[{"category": "", "categoryclass": "", "imagename": "61212354b96e7c45dbcc62090e885e81.png", "infoid": 1068559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "健身房就像分类，但在类固醇上。然而，与ClassPass的BTC模型不同，BydPass合作伙伴随时为平台（APP）支付固定费用，然后允许他们的员工从几个福利计划中选择，让他们可以访问Myriad In-Perside健身房和工作室健康应用程序的目录，如平静。这些产品分为以下类别：身体健康，情绪健康，营养和睡眠。\n 根据该公司的说法，5月，健身器在其网络上持续400万元的全球合作伙伴的核心核实员。事实上，对于一些合作伙伴来说，使用达到了近年前水平。\n  在大流行期间增加的焦虑率和记录的体重增加之间，很明显，人们渴望再次激活，希望改善他们的心理健康及其背心。\n 健身房是塞萨沃山脉塞尔瓦尔山脉的大脑，是前麦肯锡＆amp;在巴西公司顾问总是在路上，并渴望一个符合他繁忙的工作时间表的企业健康产品。\n  “有些日子我从家里工作，其他几天我从办公室工作，然后有我在旅行的时候。我不能在一个地方去健身房，“Carvalho告诉TechCrunch。 “我意识到我的需求与其他人一样，”他说。\n  “我是那些疯狂的企业家之一，将他们的MBA出来开始公司，但现在回顾一下，它已经解决了，”他说，后来告诉TechCrunch，健身房现在位于巴西，墨西哥，智利，阿根廷，美国，德国，西班牙，意大利，爱尔兰和英国\n 自2012年在SãoPaulo发布以来，该公司迅速实现了产品市场健康，其增长和扩张主要是有机的。 \n最初，健身房是一个BTC概念，其中一个客户之一是巴西普华永道的高管。他如此喜欢这个产品，以至于他最终对Carvalho说，“我不能在我们在巴西设有办事处的所有城市的所有城市中沟通这件事吗？”有了这个问题 - 和优惠 -  Carvalho看到需要枢转和建立B2B公司。\n 在巴西只有三年之后，他最大的巴西客户要求Carvalho向墨西哥扩展，因为他的公司在那里有很大的存在，他想向其员工提供健身房。因此，遵循大部分的扩展故事。\n “我们扩展到西班牙，因为我们在墨西哥的一家西班牙银行合作，他们希望他们的员工在西班牙进入我们的产品，”他说。\n 这一轮将公司估值加倍至22亿美元，包括来自Softbank，一般大西洋，更具战略企业，Kaszek Ventures和Valor的参与。 Carvalho计划使用这笔钱来在美国成长公司，扩大其产品，并致力于使技术更聪明。\n “我们希望[该应用程序]能够根据您的锻炼模式推荐最佳合作伙伴，例如：'这是您与您的锻炼档案一起使用的最佳冥想应用程序，”Carvalho说。 ", "note_en": "Gympass is like ClassPass, but on steroids. However, unlike ClassPass’ BTC model, Gympass partners with employers who then pay a flat fee for the platform (an app) which then allows their employees to choose from several wellbeing plans that give them access to myriad in-person gyms and studios, and a directory of health apps, such as Calm. The offerings are broken up into the following categories: physical health, emotional health, nutrition and sleep.\n According to the company, in May, Gympass saw a record 4 million monthly check-ins across its network of more than 50,000 global partners. In fact, for some of the partners, usage hit above pre-COVID levels.\n  Between increased anxiety rates and documented weight gain during the pandemic, it’s clear that people are eager to get active again with the hopes of improving their mental health and their waistlines.\n GymPass is the brainchild of Cesar Carvalho, a former McKinsey &amp; Company consultant in Brazil who was always on the road and yearned for a corporate wellness product that would comply with his hectic work schedule.\n  “Some days I worked from home, other days I worked from the office, and then there was the time I was traveling. I could never go to the gym in one place,” Carvalho told TechCrunch. “I realized that my needs were the same as others,” he said.\n  “I’m one of those crazy entrepreneurs that drops out of their MBA to start a company, but looking back now, it worked out okay,” he said, later telling TechCrunch that Gympass is now in Brazil, Mexico, Chile, Argentina, the U.S., Germany, Spain, Italy, Ireland, and the U.K.\n Since its launch in São Paulo in 2012, the company achieved product-market fit fairly quickly, and its growth and expansion have been largely organic.\n Originally, Gympass was a BTC concept, and one of its first clients was an executive at PricewaterhouseCoopers in Brazil. He liked the product so much that he eventually said to Carvalho, “Can’t I communicate this to my 5000 employees in all the cities where we have offices in Brazil?” With that question – and offer – Carvalho saw the need to pivot and build a B2B company.\n After only three years in Brazil, one of his biggest Brazilian clients asked Carvalho to expand to Mexico, because his company had a large presence there and he wanted to offer Gympass to its employees. And so follows most of the expansion stories.\n “We expanded to Spain, because we worked with a Spanish bank in Mexico, and they wanted their employees in Spain to have access to our product,” he said.\n This round, which doubles the company’s valuation to $2.2 billion, includes participation from SoftBank, General Atlantic, More Strategic Ventures, Kaszek Ventures and Valor. Carvalho plans to use the money to grow the company in the U.S., expand its offerings, and work on making the tech smarter.\n “We want [the app] to be able to recommend the best partners for your complete well-being journey based on your workout patterns, for example: ‘This is the best meditation app for you to use with your workout profile,’” Carvalho said.", "posttime": "2021-06-29 23:18:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,企业,corporate,健身房", "title": "健身房是一个为员工提供50,000多家健身房的企业健身应用程序，估值2.2亿美元升高220米，其估值的两倍 ", "title_en": "Gympass, a corporate fitness app that gives employees access to 50,000+ gyms, raises $220M Series E at a $2.2B valuation, twice its previous valuation", "transed": 1, "url": "https://techcrunch.com/2021/06/29/gympass-the-corporate-wellness-unicorn-raises-a-220m-series-e/", "via": "", "real_tags": ["程序", "企业", "corporate", "健身房"]}, {"category": "", "categoryclass": "", "imagename": "c2086f44543491c3b4f6e9c2c40ce7b4.jpg", "infoid": 1068558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公告强调强大的信心投资者继续在技术部门的初创企业中备份，并这些天可以为初创公司提供的金额。\n 具体而言，今天加快宣布其第十五届早期的美国资金为6.5亿美元;其第七届欧洲和以色列基金的第七次也为6.5亿美元及其第六个全球增长阶段基金，收于17.5亿美元。后者资金另外，并旨在补充，以前未经发售的23亿美元的全球“领导者”基金，这些基金专注于加权于12月份关闭的后期投资。\n  据富国合作伙伴，Accel预计平均每项基金投资约20至30家公司。其增长基金的平均投资将在5000万美元至7500万美元的范围内，以及7500万美元和1亿美元的全球领导基金。\n 黄说，该公司也仍然渴望孵化的公司渴望和“兴奋”。\n “我们仍然将500,000美元达到100万美元的种子检查，”他告诉TechCrunch。 “对我们来说很重要，并通过一开始，通过整个旅程来支持他们。”\n 实际上，正如TechCrunch最近报道的那样，Accel拥有先前引导的支持公司的历史（通常是有利可图的） - 刚刚筹集了1亿美元的哥伦布，俄亥俄州的Fintech较低的最新示例。\n 有趣的是，Accel经常通过现有的投资组合公司（也在较低的情况下）提交了一些这些公司，其首席执行官被伽利略粘土威尔克被提交为加权）。频繁，加权出于早期和增长基金的公司被引导和位于硅谷之外。 \n该企业长期以来一直在硅谷外面看机会，并且不仅在湾区的办事处，而且在伦敦和班加罗尔多年来。根据黄宏，其一部分投资论文是“投资早期和当地”。这一理念的例子包括在世界各地的公司的投资 - 从墨西哥到斯德哥尔摩到特拉维夫到慕尼黑。\n 自2019年上次基金闭幕以来，该公司已经看到了10家投资组合公司公开，包括Slack，基于奥斯汀的Bumble，以Bumber-Comath，Crowdstrike，PageRduty，TranswardOo和Squarespace等。\n  它还拥有40家公司担任M＆amp; A，包括犹他州的高程度的高程度的80亿美元通过SAP和SEGENT的32亿美元收购。此外，罗克韦尔自动化的上周也宣布推出以22.2亿美元的现金购买密歇根州的Plex系统。 Accel首次投资于2012年开发了基于订阅的智能制造平台。\n 最近的投资包括许多金融公司，如Latam的Flink，基于柏林的贸易共和国，单位和罗比赫的竞争对手。 Accel还支持现有的投资组合公司，如WebFlow，这是一个帮助企业构建没有代码网站和事件启动Hopin的软件公司。\n   “例如，我们将查看自动化公司，消费者业务和安全公司，而是以全球范围为单位。我们的目标是找到最好的企业家，无论他们在哪里，」\n 黄说，这只被智能手机和云崛起的加强。\n “之前，公司大多卖给了自己国家的消费者，”他补充道。 “但现在市场的规模如此巨大巨大，让他们变得更大，这是我相信我们以这种速度看到投资步伐的原因之一。” \n为支持这一点，Accel的全球领导基金是“大幅”的全国领导基金大于2019年结束的5亿美元的领导基金。\n 此外，De Rycker指出，公司留在私人较长的时间里，所以在他们出售或公开之前投资他们的机会更大。\n Accel也是患者。在某些情况下，该公司的投资者将与他们正在追求的公司发展“较长期”的关系。\n “1Password是这种方法的一个例子，”黄说。 “Arun [Mathew]在投资之前至少六年的关系。最后，1Password叫做并说'我们准备好了，我们希望你这样做。“\n 因此，Accel领导了加拿大公司在其14年历史上的第一个外部资金 -  2019年的2亿美元系列。\n 虽然公司是开放的，但仍有一些行业尚未像其他行业一样接受。例如，Wong说：“我们不公布22亿美元的加密基金，但我们已经完成了加密投资，看看有一些非常有趣的趋势。我们会看看Crypto带我们的地方。“ ", "note_en": "The announcement underscores both the robust confidence investors continue to have for backing startups in the tech sector and the amount of money available to startups these days.\n Specifically, today Accel is announcing its fifteenth early-stage U.S. fund at $650 million; its seventh early-stage European and Israeli fund also at $650 million and its sixth global growth stage fund at $1.75 billion. The latter fund is in addition, and designed to complement, a  previously unannounced   $2.3 billion global “Leaders” fund that is focused on later-stage investing  that Accel closed in December.\n  Accel expects to invest in about 20 to 30 companies per fund on average, according to Partner Rich Wong. Its average investment in its growth fund will be in the $50 million to $75 million range, and $75 million and $100 million out of its global Leaders fund.\n But the firm is also still eager and “excited” to incubate companies, Wong said.\n “We’ll still write $500,000 to $1 million seed checks,” he told TechCrunch. “It’s important to us to work with companies from the very beginning and support them through their entire journey.”\n Indeed, as TechCrunch recently reported, Accel has a history of backing companies that were previously bootstrapped (and often profitable) -– the latest example being  Lower, a Columbus, Ohio-based fintech, which just raised a  $100 million Series A.\n Interestingly, Accel is often referred to some of these companies by existing portfolio companies (also in the case of Lower, whose CEO was referred to Accel by Galileo Clay Wilkes). More often than not, companies that Accel backs out of its early-stage and growth funds are bootstrapped and located outside of Silicon Valley.\n The venture firm has long looked outside of Silicon Valley for opportunities, and has had offices not only in the Bay Area, but in London and Bangalore for years. Part of its investment thesis is to “invest early and locally,” according to Wong. Examples of this philosophy include investments in companies based all over the world — from Mexico to Stockholm to Tel Aviv to Munich.\n Since the time of its last fund closure in 2019, the firm has seen 10 portfolio companies go public, including  Slack, Austin-based Bumble, Bucharest-based UiPath, CrowdStrike, PagerDuty, Deliveroo and  Squarespace, among others.\n  It also had 40 companies experience an M&amp;A, including Utah-based Qualtrics’s $8 billion acquisition by SAP and Segment’s $3.2 billion acquisition by Twilio. Also, just last week, Rockwell Automation announced it was   buying Michigan-based Plex Systems  for  $2.22 billion in cash. Accel first invested in Plex, which has developed a subscription-based smart manufacturing platform, in 2012.\n Recent investments include a number of fintech companies such as LatAm’s  Flink, Berlin-based  Trade Republic,  Unit and Robinhood rival  Public. Accel has also backed as existing portfolio companies such as  Webflow, a software company that helps businesses build no-code websites and events startup  Hopin.\n   “For example, we’ll look at automation companies, consumer businesses and security companies, but at a global scale. Our goal is to find the best entrepreneurs regardless of where they are,” she said.\n That has only been intensified by the recent rise of the smartphone and cloud, Wong said.\n “Before, companies were mostly selling to the consumer in their own country,” he added. “But now the size of the market is so dramatically bigger, allowing them to become even larger, which is one of the reasons why I believe we’re seeing investment pace at this speed.”\n To support this, it’s notable that Accel’s global Leaders fund is “dramatically” larger than the $500 million Leaders fund the firm closed in 2019.\n Also, de Rycker points out, companies are staying private longer so the opportunity to invest in them until they sell or go public is greater.\n Accel is also patient. In some cases, the firm’s investors will develop “years-long” relationships with companies they are courting.\n “1Password is an example of this approach,” Wong said. “Arun [Mathew] had that relationship for at least six years before that investment was made. Finally, 1Password called and said ‘We’re ready, and we want you to do it.’ ”\n And so Accel led the Canadian company’s first external round of funding in its 14-year history —  a $200 million Series A — in 2019.\n While the firm is open-minded, there are still some industries it has not yet embraced as much as others. For example, Wong said, “We’re not announcing a $2.2 billion crypto fund, but we have done crypto investments, and see some very interesting trends there. We’ll look at where crypto takes us.”", "posttime": "2021-06-29 23:18:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,阶段,stage", "title": "Accel宣布第十五次早期阶段的美国基金，七十亿美元，第七届欧洲和以色列基金为6.5亿美元，第六个全球增长阶段基金为1.75亿美元 ", "title_en": "Accel announces fifteenth early-stage US fund at $650M, seventh early-stage European and Israeli fund at $650M, and sixth global growth stage fund at $1.75B", "transed": 1, "url": "https://techcrunch.com/2021/06/29/accel-closes-on-3b-across-three-funds/", "via": "", "real_tags": ["美国", "阶段", "stage"]}, {"category": "", "categoryclass": "", "imagename": "2bedc5c16cfa82d8369d66f1bf97a11a.png", "infoid": 1068557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "精确地了解最近的开放空域可以棘手的地方，特别是在纽约这样的大城市。今天，字母表的无人机交付子公司翼宣布它在美国在Google Play和iOS App Store上推出了OpenSky应用程序。\n   该应用程序于2019年在澳大利亚推出，为爱好者和商业驱动器飞行员，民航安全管理局（Casa）提供帮助。 U.S.版本是通过FAA的输入来创建的，用于低空授权和通知能力（LANC）空域的操作。\n 使用该应用程序，无人机运营商可以申请批准在像周围地区的空间中运营，加快传统上需要几天或几周的过程。\n “为什么一个投资运营商应用程序的无人机交付公司？”翼在博客帖子中修整问道。 “因为在美国的近200万登记无人机，所有无人机的法规遵守将使他们安全地分享天空。此外，合规性最终将扩大无人机的用途和益处 - 在他们的紧急响应，商业检查和非接触式交付中 - 更多的人。“ ", "note_en": "Knowing precisely where the nearest open airspace is can get tricky, particularly in large cities like New York. Today, Alphabet’s drone-delivery subsidiary Wing announced that it’s launching its OpenSky app in the U.S. on Google Play and the iOS App Store.\n   The app was launched in Australia back in 2019 for both hobbyist and commercial drone pilots, with help from the Civil Aviation Safety Authority (CASA). The U.S. version was created with input from the FAA for operation in Low Altitude Authorization and Notification Capability (LAANC) airspaces.\n Using the app, drone operators can request approval to operate in spaces like those around areas, expediting a process that would traditionally take days or weeks to go through.\n “Why is a drone delivery company investing in an operator app?” Wing asks rhetorically in a blog post. “Because with nearly two million registered drones in the U.S. already, regulatory compliance of all drones will allow them to share the sky safely. Moreover, compliance will ultimately expand the uses and benefits of drones — among them emergency response, commercial inspections and contactless delivery — to more people.”", "posttime": "2021-06-29 23:17:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,android,美国,opensky,wing", "title": "在2019年在澳大利亚首次亮相之后，在美国Android和iOS上发射Opensky Opensky Opensky Opensky，让用户在澳大利亚首次亮相之后，您可以找到最近的露天空间。 ", "title_en": "Alphabet's Wing launches OpenSky in the US on Android and iOS, letting users find the nearest open airspace for drones, after debuting in Australia in 2019", "transed": 1, "url": "https://techcrunch.com/2021/06/29/alphabets-wing-launches-opensky-drone-airspace-authorization-app-in-us/", "via": "", "real_tags": ["ios", "android", "美国", "opensky", "wing"]}, {"category": "", "categoryclass": "", "imagename": "634b6c6e636c414d04761c3317504d4c.jpg", "infoid": 1068556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "起初暗示，它看起来像一个初学者的课本例子，它目的是从未到达任何地方的初创想法。根据定义，任何新的搜索引擎与谷歌竞争，其90％加上市场份额为其他玩家留下了很少的氧气。我们一直习惯于在有谷歌之前免费获得我们的搜索 - 这可能会为您的声音付出代价，就像预计购买电话簿一样。\n 但Neeva确实是新的搜索引擎，今天正式启动，即提供订阅费。虽然在许多方面非常类似于谷歌 - 但是由于它自己的一些曲折，它会使网络巨头的尊重广告的业务模式避免分心，隐私酶促和其他妥协。它是免费的三个月 - 足够长的用户，以便用户习惯于毫无义务 - 此后每月4.95美元。 iPhone和iPad的应用程序以及Chrome，Firefox，Safari，Edge和Brave的浏览器扩展，是交易的一部分。\n Neeva可能对此有一定的不可能性，但它的Cofounders，Sridhar ramaswamy和Vivek Raghunathan是Naïfs最远的东西。两位长期谷歌高管在他们之间拥有超过四分之一世纪的经验，他们有一个内在人们对其运作方式的了解。此外，在NEEVA组装的大约60人工作人员中约有30％由前陀螺组成，包括来自乌迪曼伯（谷歌搜索的前负责人）和Darin Fisher（其中一位发明者之一） Chrome）。他们还获得了7750万美元的资金，包括福利 - 首都泰坦Greylock和LemoIa的投资。\n  NEEVA在最高级别，NEEVA代表了谷歌通过广告赚取搜索和其他服务的赌注 - 因为它已经完成了超过二十年的盈利效果 - 阻碍了其用户体验，从而开放了一个机会。 “我告诉人们Neeva是一个社会实验，因为它是一种技术实验，”公司的首席执行官Ramaswamy说。 “它正在寻找问题的答案，”如果有一种高质量的产品，那么在多种方面明确地利益，你会为它付出代价，而不是因为它是免费的，由广告支持？＆＃39;“\n 无论对这个问题的答案如何，Neeva的创造者都明白他们进入了什么。 “Sridhar和Vivek，他们对从技术到实际需要和做的事情的一切知识的深度，可能是世界上唯一的人，我会去的地方，”好的，我会和你一起去旅行，因为你知道如何继续这个旅程，＆＃39;“ Greylock Partner和Linkedin Cofounder Reid Hoffman说。\n （这并不是说没有其他雄心勃勃的隐私中心搜索引擎至少有些类似于Neeva的搜索引擎。Duckduckgo一直在自己的13年;一旦一个人的操作，它现在有129名员工和100美元来自广告的年收入中的百万，不涉及跟踪个别用户。并勇敢的是由Web先驱Brendan Eich创立的浏览器公司，是测试自己的隐私第一搜索引擎，并提供免费和付费版本。）\n  抛弃反托拉斯案，除了谷歌是明显脆弱的。多年来，与垄断市场份额的一些产品不同，微软的互联网探险家来到思想 - 搜索Beemoth没有通过缺乏竞争来钙化。相反，它仍然是该类别的创新引擎：谷歌表示，它去年单独推出4,500个改进。 \n但谷歌对广告收入的一些缺点是我们的眼前。一旦着名不引人注目，搜索结果显示的广告已从右栏逐渐迁移到搜索结果的顶部，乘以数量和尺寸，并丢失了从有机结果隔离的阴影框。今天，对于许多搜索，Al Al Al Al Al Al But But But All，在屏幕上将有机成果从屏幕上向下滚动。对于其他人来说，与谷歌自己的赚钱服务有关，例如Google航班，获得Prime Real Estate。\n  然后，谷歌基于在线活动的基础上构建了其用户的简档，更好地迫切地针对他们的广告，而不是在自己的网站上进行广告，而是通过谷歌推广的所有其他网络。没有广告即可为UP服务，NEEVA不应该留下隐私的类型，感觉像他们被监视的尺子目的。 （默认情况下，NEEVA确实抓住了90天的搜索，以提高自动发言等功能的质量，但您可以删除此日志或告诉服务您不希望将其保持在第一个位置。）\n  在搜索引擎传统的另一个休息中，NEEVA表示，它将至少将其最具额外的伙伴的最终收入的20％，包括前两个宣布，Quora和Medium。虽然这可能导致的地方仍然含糊，但它是另一次尝试将NEEVA与谷歌分开，这通常被指控从媒体网点的内容中受益，而没有充分的赔偿，这是一项导致诉讼和立法的长期酝酿的争议。 （经过多年的争议，谷歌至少可以指出它在涉及给新闻网点捐款的方案上花费了10亿美元。）\n  Ramaswamy和Raghunathan倾向于在礼貌的条件下造成谷歌的商业模式的不适。 Neeva的投资者之一 -  Nyu教授，作者和企业家斯科特加洛韦 - 不是那么谨慎的。正如您可能希望呼吁谷歌和其他科技巨头分手的人，他在他对谷歌和热情的分析中积累了对待Neeva在其普遍存在中的Neeva削减的可能性。\n “搜索的上瘾性质，让你的指尖或与人们联系的答案，这是尼古丁的答案，”洛克莱说。 “这对你来说很糟糕，这是令人上瘾的，但它没有给你癌症。为您提供癌症的东西，烟草，如果您愿意，是广告模型。因为最终，随着时间的推移，你专注于正在收集更多关于消费者的数据，以便进一步将他或她货币化。最终的位置是您现在的谷歌，谷歌不再将您带到您的查询，但到另一个地方可以进一步货币化。“\n  加洛韦强调他主要将钱放入Neeva，因为他认为这是一个聪明的投资。与此同时，他补充道，“我想成为尝试和释放谷歌对内容发现的施行的努力的一小部分。我认为它会导致非常糟糕的地方。“\n 即使您无处可见，在谷歌的主导地位和实践中令人振奋的是加洛韦，您也可能会发现自己为Neeva正在努力实现的目标。搜索“是一种改变我们生活的现象日常习惯，”NEEVA董事会成员MARGO GEORGIADIS说，他是一家前高级吉隆勒，他在美国，加拿大和拉丁美洲运行了公司的商业和广告业务。 “但是有机会与我们生活的生活方式发挥作用，如果您的商业模式与消费者对齐100％，我们会更好地发展到我们的生活方式。” \n很难从大型技术公司提出广告补贴服务，如果您没有为您支付产品，那么如果您没有为产品支付，您就是产品。通过NEEVA的基于订阅的模型，产品毫无疑问的产品。它只需要一个引人注目的 - 即使它的团队很小，比赛有23年的脑袋。\n  在某种程度上，NEEVA的故事始于2003年。那是Ramaswamy加入谷歌的时候，并在其静止的广告团队上工作。将有针对性的文本广告放在搜索结果旁边已经证明是一个强大的想法，但“我的小孩或大多数其他人，意识到这将是有史以来最大的企业之一，”他记得。他将近十五年致力于该增长的工程方面，最终监督10,000名陀螺歌手作为广告和商业的高级副总裁。\n 但是，由于当时的后半部分，他正在通过在网上全部围绕网络通过目标广告来制定QUARMALLY通过针对性的广告来破坏眼球的主张。 “我支付了很多关注的事情之一是数据如何在除了谷歌体验和谷歌体验之间分开，”他解释道。 “对我来说，保持数据分开是谷歌隐式对其用户所做的承诺的重要组成部分。”然而，越来越多地发现他自己必须同意妥协，例如用户的谷歌搜索影响他们在YouTube上看到的广告。\n “我们试图深思地了解信息如何流动，但它也很清楚事情所指出的地方，”雷马西说。他填补了与广告业务相关的困境，他探讨了在谷歌中枢转到不同的角色。最终，“我决定一个干净的开始就是我需要的，”他说。\n  在2018年秋季退出谷歌后，他认为他发现在Greylock的风险资本家中发现干净的开始。不过，广告业务模式与服务用户之间的冲突仍然在他的脑海中。考虑到他把他带到了会导致Neeva的道路上。\n 很快，他加入了拉格努纳森的这一探索，他曾令人印象深刻的谷歌职业。在其中的中间，他现在在谷歌上工作了，这是一项关于搜索更多预期的倡议，后来演变为谷歌助理。他说，他发现塑造了搜索的未来令人振奋，但仍然“走到黑暗的一面，我将你被货币化的YouTube。”\n 像Ramaswamy一样，Raghunathan摔断了商业压力对用户体验的影响。营销人员喜欢通过将消费者暴露在同一广告中通过一遍又一遍地加强他们的消息。 YouTube粉丝在这样的重复中粉丝。猜猜谁的利益赢了？ “我们会在交易用户幸福的情况下，有这些良好的谈话，以满足客户价值，”拉吉坦坦召开。 \n仍然在谷歌，拉格森纳用ramaswamy追逐后者正在制定的启动思想。 “我记得他告诉我这个洞察力，他正在拉的这个字符串，”拉格森纳森说。 “如果您无法重新旨在搜索产品，而无需重新称解基于基本搜索的商业模式。”渴望加入这一努力，拉格村在近12年后离开了谷歌成为Neeva的Cofounder。\n （为什么姓名“Neeva？”Raghunathan高兴地承认他们选择了它，然后在理由中回填：“在后古，有一个故事我们可以讲述Neeva，在梵语，意思是”基础知识“或”基础知识“。它实际上意味着我们使命是非常核心的东西。但如果我告诉你我们知道这一点，我会撒谎。“）\n 正如Ramaswamy和Raghunathan招募一个团队一样，他们发现其他陀螺队过去和目前渴望进行新的搜索，包括他们在旧公司尚未知道的人。 “我听到的那种想法来自Sridhar和Vivek真的很激动我，”Bindu Pucha说，曾经是IBM研究人员，在谷歌五年内花了五年，现在在Neeva的基础设施技术上工作。\n  对于UDI Manber，Neeva令人兴奋地引起了足够的兴奋，让他回到搜索，这是他在2015年留下的一个地区，专注于国家卫生研究院和其他地方的健康有关的技术。今年早些时候，他加入了Neeva兼职，每周花费两三天，并在研究努力上。\n 一个传奇的计算机科学家，在雅虎和亚马逊以及谷歌举行了顶级工作，Manber是另一个与广告补贴搜索的动态的挫折。 “我是谷歌的最大倡导者之一，我很长一段时间推动了它，”他说。 “我赢了一些战斗。我失去了许多人。“ Neeva很小的事实是解放的，他辩称：“创新对每个公司来说都很难，但我认为小公司总体而言比大公司更好。”\n  要说NEEVA处于重新思考的位置，搜索不是表明它试图改变一切。它启动的不是iPhone到谷歌的黑莓手机。实际上，大部分用户体验都可以被公平地描述为“谷歌类似”。\n  那不是坏事。 “悖论以及这里的挑战是它必须与已经存在的东西有所不同，而且要引人注目，但并不是那么根本地不同，这对人们迷失方向，”长期观察者搜索业务和市场洞察副总裁Uberall。 “有一个奇怪的紧绳，我认为他们试图走路。” \n他们不是一个人这样做。 NEEVA在搜索结果的底部索引了几亿个网页，而且还在苹果，Bing和Yelp上索引;其他信息提供商包括Intrinio，Weather.com和XIgnite。甚至谷歌是一种成分，谷歌地图嵌入了搜索结果。\n “无论我们建立在哪里，我们都会建立，”raghunathan宣布。 “我们可以在哪里许可或购买，我们会。用户不在乎。因此，我们将对用户建立最大化，最大限度的，最大，令人愉快的产品有意义。“\n  关于最终结果的任何内容都可能会发现谷歌群众。有一个搜索字段看起来就像谷歌的搜索字段一样 - 除了它体育一套旋转的标记，如“这里没有广告”和“你不是产品”。与您键入的自动发言，加上与相关搜索的链接以及“人们也要求”查询。在整个结果中遍历视频和新闻项目的行，并且右栏通常包括基于维基百科等来源搜索的任何事实块。\n  然而，在NEEVA和Google上挖掘相同的结果，您将注意到一些差异。例如，虽然搜索引擎的响应了与整洁的旋转木马求出的搜索，但它们在Neeva上更加突出，而谷歌在顶部展示了类似的付费链接旋转木马。您还可以将Neeva的摘要扩展到更详细的预览中，而无需离开搜索结果，是一个用于比较购物的福音。 （该服务采用了类似的方法。）\n Google主页由搜索字段组成，“Google Search”和“我感到幸运”按钮，并且从1998年的原始环保的白色空间显着不变。通过对比度，Neeva填补了其主页使用可个性化小部件。它们包括当地天气，您选择的股票价格和新闻。最后一个小部件完全由名称 - 品牌媒体网点的故事组成 - 从每日野兽到福克斯新闻 - 您可以通过指定您想要更常见或更少的源来定制它。\n  另一个有区别的特征是NEEVA与第三方服务的一体化。您可以将服务与信息源（如Gmail或Outlook电子邮件）和日历，Google Drive或Dropbox存储以及/或Slack或Jira帐户提供联系。然后，NEEVA将在搜索结果中向其中索引它们和漫步材料，并在专用的“个人”选项卡中将其呈现。谷歌已经尝试了过去的类似概念 - 曾经用过谷歌搜索和Gmail  - 但似乎已经从这个概念上移动。\n  对于所有这一切都很好，关于NEEVA-over坐在页面顶部的有机结果，而不是在广告的有效载荷之下 - 它通过在门外达到Google的复杂性而无法完成不可能的。这些以产品为导向的搜索结果，如“最佳笔记本电脑”，包装良好，但我被检查出来的源头稀薄，PC Mag占据了审查链接，这在某种程度上我想知道它是通过一些伙伴关系交易。 （它不是。） \nNeeva也没有在附近的任何地方以及谷歌的地方信息：它知道我的邮政编码，但是当我搜索当地的披萨链时，它给了我一个28英里的分支的地图，而不是步行距离之内。它可以回答问题，例如“在里约在什么时候？” “乔拜登有多高？”与结果页面本身出现的事实，但它没有这样做，因为谷歌这样的查询数组。当我使用预发布的网站时，我也遇到了偶尔的出口故障，就像旧金山的缩略图地图，当我点击它时，旧金山的缩略图地图变成了印第安纳波利斯。\n  Ramaswamy承认，在目前的国家，Neeva是一个粗略的草案：“在公开可用之后，我们在搜索质量方面有几个大型推出，在搜索质量方面，”他说。看到秋天的地方会有很有趣的是，当时的人们签名结束他们的三个月免费试验并选择是否成为支付客户。\n 在那里可以追求很难说，但它不像搜索没有剩下的问题要解决。当我问一个人的努力时，他不会告诉我：“我很久以前学到了，只有在我完成了他们之后才能谈论事情，而不是我打算做他们的时候。”\n  正如我开始在这篇文章上工作并获得了对NEEVA的预发布访问，我想一直使用它。为了确保我没有反驳谷歌，我进入了Safari的设置，将我的默认搜索引擎更改为NEEVA。那么我意识到我不能。大多数主要浏览器让您从一些预先选择的搜索引擎中挑选，而不是（尚未）包括NEEVA;只有Chrome允许您选择一个不在其罐头列表中的一个。\n 这种经验强调了Neeva正在进入一个并不完全有线的世界，以便为新的独立搜索引擎提供最佳的成功射击。为了控制其命运，搜索公司真的需要至少写一些自己的软件;从谷歌到Duckduckgo的每个人都没有浏览器并不是巧合。现在所以拥有NEEVA，具有IPHOD和iPadoS浏览器以及嵌入其他浏览器中的类似功能的扩展。\n “浏览器和搜索只是如此交织在一起，对吧？” Neeva软件工程师Darin Fisher说。 “搜索是浏览器UI的如此重要的部分。”费舍尔知道他讲的地方：他是一个21年的浏览器战争的老兵，他的Résumé包括Netscape和Firefox以及今年早些时候的铬。\n 根据Fisher，浏览和搜索的共生性质可以创建设计难题，将浏览器/搜索引擎公司与其用户的赔率。例如，如果您在浏览器的地址栏中键入站点的名称，它会在那里发送你吗？或者它会在将您指导到搜索结果的页面方面，它可以通过广告批准？ \n没有广告，Neeva可以抵制这种诱惑。 “当我想到Neeva和那个简单的商业模式时 - 如果人们幸福，他们付钱 - 它打开了没有那张紧张的门，”Fisher说。\n 随着NEEVA搜索引擎前端和中心，公司的应用和扩展允许它实现与隐私相关的功能，它无法纯粹地实现为Web服务。在浏览网站时，您可以点击其地址附近的图标，以获取其包含它包含的跟踪器的摘要，该序列监控广告和其他目的的浏览;您还可以打开称为跟踪预防的功能，这会阻止此类监视并加快页面呈现。\n  在Neeva官方首次亮相前几天，正如我使用预发布浏览器的那样，我发现它不仅挫败了跟踪器，而且还删除了网络上的广告。事实证明，NEEVA也对扫描广告删除，其浏览器依赖来自Mozilla Firefox的核心技术的文物感到惊讶。 Mozilla反跟踪系统\n...... ", "note_en": "At first blush, it may seem like a textbook example of a startup idea destined never to get anywhere. By definition, any new search engine competes with Google, whose 90 percent-plus market share leaves little oxygen for other players. And we’ve been accustomed to getting our search for free since well  before there was a Google—which might make paying for it sound like being expected to purchase a phone book.\n But  Neeva is indeed a new search engine, officially launching today, that carries a subscription fee. Though it’s extremely similar to Google in many respects—with a few twists of its own—it dumps the web giant’s venerable ad-based business model in the interest of avoiding distractions, privacy quandaries, and other compromises. It’s free for three months—long enough for users to grow accustomed to it without obligation—and $4.95 a month thereafter. Apps for iPhones and iPads, and browser extensions for Chrome, Firefox, Safari, Edge, and Brave, are part of the deal.\n Neeva may have a certain whiff of improbability about it, but its cofounders,  Sridhar Ramaswamy and Vivek Raghunathan, are the furthest thing from naïfs. Two long-time Google executives with more than a quarter-century of experience at the web giant between them, they have an insider’s understanding of how it operates. Moreover, about 30 percent of the roughly 60-person staff they’ve assembled at Neeva consists of ex-Googlers, including Hall-of-Famers such as Udi Manber (a former head of Google search) and Darin Fisher (one of the inventors of Chrome). They’ve also secured $77.5 million in funding, including investments from venture-capital titans Greylock and Sequoia.\n  At its highest level, Neeva represents a bet that the way Google monetizes search and other services through advertising—as it’s done for more than two decades to wildly profitable effect—has hampered its user experience, thereby opening up an opportunity. “I tell people that Neeva is as much a social experiment as it is a technological experiment,” says Ramaswamy, the company’s CEO. “It’s looking for the answer to the question, ‘If there was a high-quality product that clearly benefits you in multiple ways, would you pay for it as opposed to having it be free, supported by ads?&#39;”\n Whatever the answer to that question, Neeva’s creators understand what they’re getting into. “Sridhar and Vivek, with their depth of knowledge on everything from technology to what people actually need and do, are probably the only people in the world where I would go, ‘Okay, I’ll go on this journey with you, because you know how to go on this journey,&#39;” says Greylock partner and LinkedIn cofounder Reid Hoffman.\n (Which is not to say there aren’t other ambitious privacy-centric search engines on journeys at least somewhat similar to Neeva’s. DuckDuckGo has been on its own for 13 years;  once a one-man operation, it now has  129 employees and $100 million in annual revenue from ads that don’t involve tracking individual users. And Brave, the browser company  founded by web pioneer Brendan Eich, is beta-testing its own  privacy-first search engine and says free and for-pay versions will be available.)\n  Looming antitrust case aside, it’s not that Google is all that obviously vulnerable. Over the years, unlike some products with monopolistic market share— Microsoft’s Internet Explorer comes to mind—the search behemoth hasn’t calcified through lack of competition. Instead, it remains the category’s  leading engine of innovation: Google says that it  rolled out 4,500 improvements last year alone.\n But  some of the downsides of Google’s dependence on ad revenues are right before our eyes. Once famously unobtrusive, the ads displayed with search results have gradually migrated from the right column to the top of search results, multiplied in number and size, and lost the shaded box that isolated them from organic results. Today, for many searches, ads all but crowd the organic results off the screen until you scroll downwards. For others, links to Google’s own money-making services, such as Google Flights, get prime real estate.\n  Then there’s the fact that Google  builds profiles of its users based on their online activity, the better to precisely target them with advertising not only at its own sites but all the other ones across the web whose ads are powered by Google. With no ads to serve up, Neeva shouldn’t leave privacy-conscious types feeling like they’re being monitored for ulterior purposes. (By default, Neeva does hold onto your searches for 90 days to improve the quality of features such as autosuggestions, but you can erase this log or tell the service you don’t want it to keep it in the first place.)\n  In another break from search-engine tradition, Neeva says that it will  turn at least 20 percent of its top-line revenue over to publishing partners, including the first two it’s announced, Quora and Medium. Though the details of where this could lead remain vague, it’s another attempt to set Neeva apart from Google, which has often been accused of benefiting from media outlets’ content without adequate compensation, a long-simmering dispute that has led to  lawsuits and  legislation. (After years of controversy, Google can at least point to the fact that it’s  spending $1 billion on programs involving giving money to news outlets.)\n  Ramaswamy and Raghunathan tend to frame their discomfort about Google’s business model in polite terms. One of Neeva’s investors—NYU professor, author, and entrepreneur  Scott Galloway—isn’t so circumspect. As you might expect of someone who has  called for the breakup of Google and other tech giants, he’s withering in his analysis of Google and enthusiastic about the possibility of an upstart like Neeva chipping away at its pervasiveness.\n “The addictive nature of search, of getting answers at your fingertips or connecting with people, that’s sort of the nicotine,” says Galloway. “It’s bad for you, it’s addictive, but it doesn’t give you cancer. The thing that gives you cancer, the tobacco, if you will, is the ad model. Because ultimately, over time, all you’re focused on is gathering more data on the consumer so that you can further monetize him or her. And where it ends up is where you are now with Google, where Google no longer takes you to the best place based on your query, but to another place they can further monetize.”\n  Galloway emphasizes that he put money into Neeva mostly because he thinks it’s a smart investment. At the same time, he adds, “I want to be a small part of the effort to try and release the stranglehold that Google has on content discovery. I think it leads to very bad places.”\n Even if you’re nowhere near as agitated over Google’s dominance and practices as Galloway is, you might find yourself rooting for for what Neeva is trying to accomplish. Search “is a phenomenal daily habit that has transformed how we live,” says Neeva board member Margo Georgiadis, herself a former high-ranking Googler who ran the company’s commercial and ad operations in the U.S., Canada, and Latin America. “But there’s an opportunity with how we’ve evolved the way we live our lives and use technology to make it much, much better if your business model is aligned 100 percent with the consumer.”\n It’s hard to bring up ad-subsidized services from big tech companies without someone helpfully reminding you that if  you’re not paying for the product, you are the product. With Neeva’s subscription-based model, the product is unquestionably the product. It just needs to be a compelling one—even though its team is small and the competition has a 23-year head start.\n  In a way, the Neeva story begins in 2003. That’s when Ramaswamy joined Google and was put to work on its still-nascent advertising team. Placing targeted text ads next to search results was already proving to be a powerful idea, but “little did I, or most others, realize that this would be one of the largest businesses ever,” he remembers. He devoted the next fifteen years to the engineering side of that growth, eventually overseeing 10,000 Googlers as senior VP of ads and commerce.\n But by the latter part of that time, he was developing qualms about the whole proposition of monetizing eyeballs through targeted ads all around the web, as Google was doing. “One of the things that I paid a lot of attention to is how data was separated between off-Google experiences and on-Google experiences,” he explains. “To me, keeping that data separate was an important part of the promise that Google implicitly made to its users.” Increasingly, however, he found himself having to consent to compromises such as users’ Google searches influencing the ads they saw on YouTube.\n “We tried to be thoughtful about how information flowed around, but it was also very clear where things were pointed at,” Ramaswamy says. Having had his fill of the dilemmas associated with the ad business, he explored the possibility of pivoting to a different role within Google. Ultimately, “I decided that a clean start was what I needed,’ he says.\n  After quitting Google in the fall of 2018, he thought he’d found that clean start as a venture capitalist at Greylock. The conflict between ad-based business models and serving users remained on his mind, though. Thinking about it took him down the path that would lead to Neeva.\n Soon, he was joined in this exploration by Raghunathan, who’d had an impressive Google career of his own. In the middle of it, he’d worked on  Google Now, an initiative to make search more anticipatory that later evolved into the Google Assistant. He says that he found shaping the future of search to be exhilarating, but nonetheless then “went over to the dark side, and I monetized YouTube.”\n Like Ramaswamy, Raghunathan wrestled with the effect that business pressures had on user experiences. Marketers love to reinforce their messaging by exposing consumers to the same ad over and over and over. YouTube fans rankle at such repetition. Guess whose interests won out? “We’d have these well-intentioned conversations around trading off users’ happiness for customer value,” Raghunathan recounts.\n  Still at Google, Raghunathan chatted with Ramaswamy about the startup idea the latter was formulating. “I remember him telling me this insight, this string he was pulling on,” says Raghunathan. “That you could not reimagine search the product without reimagining the business model that underpins search.” Eager to join that effort, Raghunathan left Google after almost 12 years to become Neeva’s cofounder.\n (Why the name “Neeva?” Raghunathan cheerfully admits that they chose it, then backfilled in a rationale: “In hindsight, there is a story we can tell about Neeva, in Sanskrit, meaning ‘fundamentals’ or ‘the basics.’ It actually means something that is very core to our mission. But I’d be lying if I told you we knew that.”)\n As Ramaswamy and Raghunathan recruited a team, they found that other Googlers past and present were eager to take a fresh look at search, including some whom they hadn’t known at their old company. “The kind of ideas I heard from Sridhar and Vivek really excited me,” says Bindu Pucha, who was once an IBM Research staffer, spent five years at Google, and now works on infrastructure technology for Neeva.\n  For Udi Manber, what Neeva was up to was compelling enough to lure him back into search, an area he’d left behind in 2015 to focus on health-related technologies at the National Institutes of Health and elsewhere. Earlier this year, he joined Neeva part-time, spending two or three days a week on research efforts.\n A legendary computer scientist who held top jobs at Yahoo and Amazon as well as Google, Manber was another key Googler who had his frustrations with the dynamics of ad-subsidized search. “I was one of the biggest advocates of privacy at Google, and I pushed for it a long time,” he says. “I won some fights. I lost many others.” The fact that Neeva is tiny is liberating, he argues: “Innovation is hard for every company, but I think small companies are better at it than large companies overall.”\n  To say that Neeva is in a position to rethink search is not to suggest that it’s trying to change everything. What it’s launching is not the iPhone to Google’s BlackBerry. Indeed, much of the user experience can fairly be described as “Google-like.”\n  That’s not a bad thing. “The paradox and the challenge here is that it has to be different enough from what already exists to get attention and to be engaging, but not so radically different that it’s disorienting to people,” says Greg Sterling, a  long-time observer of the search business and VP of market insights at location marketing company Uberall. “There’s a weird tight rope that I think they’re trying to walk.”\n They’re not doing it alone. Neeva has indexed several billion web pages on its own but also credits Apple, Bing, and Yelp at the bottom of search results; other information providers include Intrinio, Weather.com, and Xignite. Even Google is an ingredient, with Google Maps embedded in search results.\n “Wherever we can build, we will build,” declares Raghunathan. “Where we can license or buy, we will. Users don’t care. And so we will do what makes sense for users to build a maximally differentiated, maximally useful, maximally, delightful product.”\n  Nothing about the end result is likely to discombobulate the Googling masses. There’s a search field that looks just like Google’s search field—except that it sports a rotating set of taglines such as “No ads here” and “You are not the product.” There are autosuggestions as you type, plus links to related searches and “People Also Asked” queries. Rows of videos and news items are interspersed throughout the results, and the right column often includes a block of facts on whatever you searched for based on sources such as Wikipedia.\n  Dig into the same results on Neeva and Google, however, and you’ll notice some differences. For instance, while both search engines respond to searches such as “best laptops” with tidy carousels summarizing expert reviews, they’re more prominent on Neeva, while Google puts a similar-looking carousel of paid links at the top. You can also expand Neeva’s summaries into more detailed previews without leaving the search results, a boon for comparison shopping. (The service takes a similar approach with recipes.)\n The Google home page consists of a search field, “Google Search” and “I’m Feeling Lucky” buttons, and an expanse of white space—remarkably unchanged from its original look back in 1998. Neeva, by contrast, fills its home page with personalizable widgets. They include ones for local weather, stock prices of your choice, and news. That last widget consists entirely of stories from name-brand media outlets—from  The Daily Beast to Fox News—and you can customize it by specifying which sources you want to see more often or less often.\n  Still another distinguishing characteristic is Neeva’s integrations with third-party services. You can hook the service up with information sources such as your Gmail or Outlook email and calendar, Google Drive or Dropbox storage, and/or Slack or Jira account. Neeva will then index them and intersperse material from them in your search results as well as presenting it in a dedicated “Personal” tab. Google has experimented with similar concepts in the past—it once  mashed up Google search and Gmail—but seems to have moved on from the concept.\n  For all that’s nice about Neeva—starting with its organic results sitting at the top of the page rather than below a payload of advertising—it hasn’t done the impossible by reaching Google-like sophistication right out of the gate. Those product-oriented results for searches such as “best laptops” are well packaged, but the ones I checked out were thin on sources, with  PC Mag dominating the review links to such an extent that I wondered if it was through some partnership deal. (It isn’t.)\n Neeva also doesn’t do local information anywhere near as well as Google: It knows my Zip Code, but when I searched for a local pizza chain, it gave me a map for the branch 28 miles away, not the one within walking distance. It can answer questions such as “What time is it in Rio?” and “How tall is Joe Biden?” with facts that appear on the results page itself, but it doesn’t do so for as dizzying an array of queries as Google does. When I used the pre-release site, I also encountered the occasional out-and-out glitch, like a thumbnail map of San Francisco that turned into Indianapolis when I clicked on it.\n  Ramaswamy acknowledges that in its current state, Neeva is something of a rough draft: “We have several large launches planned for next month, on the search quality side, after being publicly available,” he says. It will be interesting to see where it gets by the fall, when the people now signing up conclude their three-month free trials and choose whether to become paying customers.\n Where it could go after that is hard to say, but it’s not like search has no remaining problems to solve.  When I asked Manber about what he was working on, he wouldn’t tell me: “I learned a long time ago to talk about things only after I’ve done them, not when I’m just planning to do them.”\n  As I began working on this article and got pre-release access to Neeva, I wanted to use it all the time. To ensure that I didn’t reflexively Google for anything, I went into Safari’s settings to change my default search engine to Neeva. It was only then that I realized I couldn’t. Most major browsers make you pick from a few pre-selected search engines, not (yet) including Neeva; only Chrome allows you to choose one that’s not on its canned list.\n That experience underlined that Neeva is entering a world that isn’t exactly wired to give a new stand-alone search engine its best shot at success. To control its destiny, a search company really needs to write at least some of its own software; it’s not a coincidence that everyone from Google to  DuckDuckGo has come out with a browser. And now so has Neeva, with its iPhone and iPadOS browsers as well as extensions that embed similar functionality in other browsers.\n “The browser and search are just so intertwined, right?” says Neeva software engineer Darin Fisher. “Search is such an important part of the UI of the browser.” Fisher knows whereof he speaks: He’s a 21-year veteran of the browser wars whose résumé includes Netscape and Firefox as well as Chrome from  its inception until earlier this year.\n According to Fisher, the symbiotic nature of browsing and searching can create design conundrums that put a browser/search engine company at odds with its users. For example, if you type the name of a site into the browser’s address bar, will it send you right there? Or will it err on the side of directing you to a page of search results it can monetize through ads?\n With no ads, Neeva can resist such temptations. “When I think about Neeva and that simple business model that it has—if people are happy, they’re paying—it opens the door to not having that tension,” says Fisher.\n Along with putting the Neeva search engine front and center, the company’s apps and extensions allow it to implement privacy-related features it couldn’t implement purely as web services. While browsing a website, you can click on an icon near its address to get a summary of the trackers it contains that monitor your browsing for advertising and other purposes; you can also turn on a feature called Tracking Prevention, which blocks such surveillance and speeds up page rendering.\n  A few days before Neeva’s official debut, as I used the pre-release browser, I found that it not only foiled trackers but also eliminated advertisements all over the web. It turned out that Neeva was also surprised by the sweeping ad deletion, an artifact of its browser’s reliance on core technologies from Mozilla’s Firefox. The Mozilla anti-tracking sys\n......", "posttime": "2021-06-29 23:17:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,发布,google,谷歌,ad", "title": "Neeva，来自两个前谷歌高管的免费搜索引擎，从两家前谷歌高管提供14.95美元/月，在筹集77.5米后发布 ", "title_en": "Neeva, a $4.95/month ad-free search engine from two ex-Google executives, launches after raising $77.5M", "transed": 1, "url": "https://www.fastcompany.com/90650719/neeva-search-engine-google-alternative-privacy-sridhar-ramaswamy-tech", "via": "", "real_tags": ["免费", "发布", "google", "谷歌", "ad"]}, {"category": "", "categoryclass": "", "imagename": "ee4fd8e6efced593998b77cf35ec3f5d.png", "infoid": 1068555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft周二宣布了一个人工智能系统，可以推荐用于软件开发人员的代码，因为它们编写代码。\n 微软希望简化编程的过程，该公司于1975年开始的区域。这可以保留已经使用公司的程序员和＃39; S CONERS CONSECT CONSECT，也吸引新的程序员。\n  该系统称为GitHub Copilot，绘制上传到源代码上传到用于代码共享服务Github，Microsoft于2018年获取，以及其他网站。 Microsoft和GitHub从Openai的帮助开发了它，这是Microsoft在2019年支持的AI Research初创公司。\n 微软和其他机构的研究人员一直试图教会计算机代码数十年。这个概念尚未成为主流，有时是因为编写程序的程序尚未足够多才多多姿。 GitHub Copilot努力是该领域的显着尝试，依赖于在许多编程语言中的大量代码上，并且巨大的蔚蓝的云计算能力。\n Nat Friedman，GitHub的首席执行官，描述了GitHub Copilot作为软件创建者称之为一对程序员的虚拟版本 - 当两个开发人员在同一项目上并排工作时，＆＃39; s。该工具在当前文件中查看现有代码和注释以及光标的位置，它提供了一个或多个要添加的行。随着程序员接受或拒绝建议，模型学会并随着时间的推移而变得更加复杂。\n 弗里德曼在上周在一次采访中表示，新软件使编码更快。弗里德曼说，在编码时，Github的数百名开发人员一整天都在使用Copilot功能，而且他们的大多数是接受建议而不是关闭功能。\n 编程涉及提出关于如何做某事，然后实施它，并且GitHub Copilot在第二部分擅长第二部分，这是Openai及其首席技术官的联合创始人Greg Brockman表示。 \n＆＃34;你不想去读斜视和＃39; s api文件。它知道所有的东西。它＆＃39;它实际上非常可靠，＆＃34;他说。布洛克曼称这项工作最后一英里编程，他说拥有电脑照顾它导致速度改进。\n  ＆＃34;它可以拯救我通过一堆文档来潜水，让一个工具做我知道它的事情和能够做的事情，这对于生产力是如此善于善良，而且为生产力，＆＃34是如此善良。他说。 ＆＃34;我可以＆＃39; t甚至告诉你我浪费的小时数，浪费了试图弄清楚做出相对年轻的东西的正确方法，只是导航这些工具的复杂性。＆＃34;\n  ＆＃34;这可能是一个使编程本身更加平易近的东西之一，＆＃34;斯科特说。\n 弗里德曼说，它几乎可以支持几乎每种编程语言，但它曾设计用于使用JavaScript，Python和Cypescript工作。\n GitHub Copilot将首先出现在Microsoft＆＃39; S Visual Studio代码，免费开源产品和Microsoft计划将来将其纳入商业视觉工作室产品。\n  Brockman表示，GitHub Copilot的核心核心，称为Codex，称为Codex，是GPT-3的后代，这是Openai在大量文本上训练的强大模型。喂养型号的工程师＆＃34;许多，许多人的公共来源代码，＆＃34;弗里德曼说。\n 这是Microsoft第一次靠在Openai上提供智能软件的ISN＆＃39; t。上个月Microsoft展示了它如何更新Power Apps Studio应用程序，其中Nontechnical人员使用来编写应用程序，使用户可以键入描述它们的元素和＃39; d喜欢添加的元素，并且有必要的选项代码。 \nOpenai认识到AI模型的潜力提出了GPT-3的代码，它去年推出了它。启动在其网站上说，提供GPT-3的在线服务可以处理＆＃34;代码完成。＆＃34;但是回到Openai首次培训模型时，博克曼说，启动无意教授如何帮助代码。它的含义更为作为一种通用语言模型，例如，可以生成文章，修复错误的语法并从一种语言转换为另一个语言。\n 在接下来的几个月里，人们尝试了模型，看看它可以做些什么，无论是有用和愚蠢的吗 - 例如，一个工程师制作了一个网站，可以设计一个看起来像西瓜的按钮。布罗克曼向弗里德曼伸出协议，因为他正在运行一个关键的目的地，其中数百万程序员在代码上工作，事物从那里进行。\n GitHub员工试图确保GitHub Copilot将产生安全，高质量的代码。 ＆＃34;我们＆＃39;在副本中建立了许多安全机制，我们认为在这里减少了各个领域的错误机会，但它们＆＃39肯定不完美，＆＃34 ;弗里德曼说。\n 潜在的技术赢得了＆＃39; t只是微软＆＃39; s。 Brockman表示，Openai将在今年夏天发布今年夏天为第三方开发人员编写自己的应用程序。\n 斯科特说，微软可以释放企业可以训练的产品版本，以了解他们的编程样式。目前，Microsoft仅提供了了解关于存储在公共存储库中的代码的服务。 ", "note_en": "Microsoft on Tuesday announced an artificial intelligence system that can recommend code for software developers to use as they write code.\n Microsoft is looking to simplify the process of programming, the area where the company got its start in 1975. That could keep programmers who already use the company&#39;s tools satisfied and also attract new ones.\n  The system, called GitHub Copilot, draws on source code uploaded to code-sharing service GitHub, which Microsoft acquired in 2018, as well as other websites. Microsoft and GitHub developed it with help from OpenAI, an AI research start-up that Microsoft  backed in 2019.\n Researchers at Microsoft and other institutions have been trying to teach computers to write code for decades. The concept has yet to go mainstream, at times because programs to write programs have not been versatile enough. The GitHub Copilot effort is a notable attempt in the field, relying as it does on a large volume of code in many programming languages and vast Azure cloud computing power.\n Nat Friedman, CEO of GitHub, describes GitHub Copilot as a virtual version of what software creators call  a pair programmer -- that&#39;s when two developers work side by side collaboratively on the same project. The tool looks at existing code and comments in the current file and the location of the cursor, and it offers up one or more lines to add. As programmers accept or reject suggestions, the model learns and becomes more sophisticated over time.\n The new software makes coding faster, Friedman said in an interview last week. Hundreds of developers at GitHub have been using the Copilot feature all day while coding, and the majority of them are accepting suggestions and not turning the feature off, Friedman said.\n Programming involves coming up with an idea about how to do something and then implementing it, and GitHub Copilot is good at the second part, said Greg Brockman, a co-founder of OpenAI and its chief technology officer.\n  &#34;You don&#39;t want to go read  Twilio&#39;s API documentation. It knows all that stuff. It&#39;s actually quite reliable at it,&#34; he said. Brockman calls this work last-mile programming, and he said that having computers take care of it leads to speed improvements.\n  &#34;It can save me from having to dive through a whole bunch of documentation to get a tool to do a thing that I know it&#39;s capable of doing, and that is so good for productivity,&#34; he said. &#34;I can&#39;t even tell you the number of hours I&#39;ve wasted trying to figure out the right way to do a relatively prosaic thing, just navigating the complexity of these tools.&#34;\n  &#34;It may very well be one of those things that makes programming itself more approachable,&#34; Scott said.\n It supports almost every programming language, but it&#39;s been designed to work best with JavaScript, Python and TypeScript, Friedman said.\n GitHub Copilot will first appear in Microsoft&#39;s Visual Studio Code, a free open-source product, and Microsoft plans to incorporate it into the commercial Visual Studio product in the future.\n  The model at the core of GitHub Copilot, called Codex, is a descendent of GPT-3, a powerful model that OpenAI trained on large volumes of text, Brockman said. Engineers fed the model &#34;many, many terabytes of public source code out there,&#34; Friedman said.\n This isn&#39;t the first time Microsoft has leaned on OpenAI to deliver smart software. Last month  Microsoft showed how it would update the Power Apps Studio application, which nontechnical people use to write apps, so that users could type in words describing the elements they&#39;d like to add and have GPT-3 show options for the necessary code.\n OpenAI recognizes the potential for AI models to come up with code with GPT-3, which it introduced last year. The start-up says on  its website that an online service delivering GPT-3 can handle &#34;code completion.&#34; But back when OpenAI was first training the model, the start-up had no intention of teaching it how to help code, Brockman said. It was meant more as  a general purpose language model that could, for instance, generate articles, fix incorrect grammar and translate from one language into another.\n Over the next few months, people experimented with the model to see what it could do, both useful and silly --  for instance, one engineer made a website that could design a button that looked like a watermelon. Brockman reached out to Friedman, as he was running a key destination where millions of programmers work on code and things proceeded from there.\n GitHub employees have tried to ensure that GitHub Copilot will generate secure, high-quality code. &#34;We&#39;ve built a number of safety mechanisms into Copilot that we think are cutting-edge in terms of reducing the chances of mistakes in various areas here, but they&#39;re definitely not perfect,&#34; Friedman said.\n The underlying technology won&#39;t be only Microsoft&#39;s to use. OpenAI will release the Codex model this summer for third-party developers to weave into their own applications, Brockman said.\n Microsoft could someday release a version of the product that enterprises could train to understand their programming styles, Scott said. For now, Microsoft is only offering the service that knows about code stored in public repositories.", "posttime": "2021-06-29 23:16:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,代码,programming,github,编程", "title": "Microsoft和Open AI构建GitHub Copilot，基于AI的工具，以在几乎任何编程语言中推荐给软件开发人员的代码 ", "title_en": "Microsoft and Open AI build GitHub Copilot, an AI-based tool to recommend code to software developers in almost any programming language", "transed": 1, "url": "https://www.cnbc.com/2021/06/29/microsoft-github-copilot-ai-offers-coding-suggestions.html", "via": "", "real_tags": ["microsoft", "代码", "github", "编程"]}, {"category": "", "categoryclass": "", "imagename": "88f35ca2e0d4562d9ee346a57980e4dc.jpeg", "infoid": 1068554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新：2U确认这笔交易，预计将在120天内关闭监管和政府批准后，在发布发布后发布。它还证实收购的价格将是8亿美元的全现金交易。\n 这笔交易给了一家提交2014年公开的公司，并继续成为股票市场上市的稀有美国Edtech公司之一，这是一个新的协作内容为其软件。此外，由于其常春藤联盟支持者，刚刚获得了更强的名称识别，其中一些人认为作为一个品牌举措，可以帮助上市公司拥有自己的市场。该公司的最后一次大收购是在2019年，当时支付了7.5亿美元的收购Trilogy教育，这是一个在与大学合作中建立在人类和在线训练者的公司。\n  EDX成立于2012年，在一系列大规模开放的在线课程（MOOC）产品中，包括Udacity和Coursera。该公司作为一个非营利性，在发布时举行了诱人的承诺：它将帮助世界上的任何人都拿一个哈佛大学或麻省理工学院的课程。当然，该机构曾在累计8000万美元中抛出捐赠进入EDX以防止操作。在Coursera宣布普林斯顿，斯坦福大学和密歇根大学将在其自己的在线学习平台上宣布自己的发射。现在，Coursera公开的Edx的收购是几个月的。\n  如今，由总裁兼教授anantAgarwal领导的EDX，超过3,000名课程，由15,000名教师领导，3500万用户使用。根据本组织的网站，Open EDX是平台的开源平台，在全球2,400个学习网站使用。\n EDX将成为本次交易的一部分的公共福利公司。每个来源，交易的收益将进入哈佛大学和麻省理工学院管理的另一项非营利性，该机构不会损益交易。也就是说，一个麻省理工学院说法揭示了。 EDX从麻省理工学院和哈佛队采取了一系列信贷，这些资金将返回两所机构。\n “因为EDX是一个公共慈善机构，销售的收益只能分发，以便与EDX的使命一致，而不是弥补那些为非营利组织做出贡献的人，”该声明读。\n 自2月2021年2月以来一直在作品中的这一交易的一部分是由于EDX对自己的金融困境和成为自我维持业务的旅程是透明的。然后，麻省理工学院勇敢的拉斐尔·雷夫，现在学校总统，在最终的收入发电时，该计划首次发布，在2012年说“驱动器不是赚钱的......我们打算找到一种支持这些方法活动。我们正在考虑几种方法，我们不希望这个项目成为麻省理工学院或哈佛预算的流失。“ \n2018年，同样的财政年度，收入3700万美元，EDX介绍了支撑费，同时持续提供，要求学生在课程完成后支付验证的认证。在公告中，该公司写道：“我们相信我们需要走向允许EDX和我们的合作伙伴的财务模式，以实现可持续性，并承认这意味着远离我们目前的型号无论如何自由地提供。” EDX板也考虑了其他选择，麻省理工学院。说，但决定那些“与EDX，其学习者或其合作机构不那么有利于2U的交易”。\n 新的交易和EDX转向公共福利公司的选择可能成为它本身正在寻找的财务模式，表明如何。很难它可能是将mooc货币化。虽然2U致力于继续持续五年的射频的免费课程，以及播种新的非营利性，EDX目前代表 - 这是一个大规模的教育非盈​​利 - 将来不会再运作，因为它将来不再运作。 ", "note_en": "Update: 2U confirmed the deal, expected to close within 120 days subject to regulatory and governmental approvals, in a press release post-publication. It also confirmed that the price of the acquisition which will be an $800 million all-cash deal.\n The deal gives 2U,  a company that filed to go public in 2014 and continues to be one of the rare U.S. edtech companies listed on the stock market, a new wave of collaboratively-built content to its software. Plus, 2U just acquired with stronger name recognition thanks to its Ivy League backers, which some see as a branding move that could help the public company with its own chunk of the market. The company’s last big acquisition was in 2019,  when it paid $750 million to acquire Trilogy education, a company that builds in-person and online bootcamps in collaboration with universities.\n  EdX was founded in 2012 amid a crop of massive open online course (MOOC) offerings, including Udacity and Coursera. The company, set up as a non-profit, had an alluring promise upon launch: it would help anyone in the world take a Harvard or MIT class, for free. The institutions, of course, have thrown in a cumulative $80 million in donations into edX to keep the operation free.  Its own launch came weeks after Coursera announced that Princeton, Stanford, UPenn, and the University of Michigan would host courses on its own online learning platform. Now, edX’s acquisition comes months after Coursera went public.\n  Today, edX, led by president and professor Anant Agarwal, hosts over 3,000 courses led by 15,000 instructors and used by 35 million users. Open edX, the platform’s open source platform, is used by 2,400 learning sites worldwide,  according to the organization’s website.\n EdX will turn into a public benefit corporation as part of this transaction. Per sources, proceeds from the transaction will go into another non-profit managed by Harvard and MIT, and the institutions will not profit off of the transaction. That said, an MIT statement reveals. that edX took a line of credit from MIT and Harvard, and those funds will be returned to both institutions.\n “Because edX is a public charity, the proceeds from its sale can only be distributed for a purpose consistent with edX’s mission, not to compensate those who contributed to the nonprofit,”  the statement reads.\n Part of this transaction, which has been in the works since February 2021, is colored by the fact that edX has been transparent with its own financial woes and journey to becoming a self-sustaining business. Then MIT Provost Rafael Reif, now the president of the school, had  hinted at eventual revenue generation the program first launched, saying in 2012 that “the drive is not to make money..that said, we intend to find a way to support those activities. There are several approaches we are considering, and we don’t want this project to become a drain on the budgets of MIT or Harvard.”\n In 2018, the same fiscal year it  had $37 million in revenue, edX introduced  a support fee, alongside its ongoing offering that asks students to pay for a verified certification upon course completion. In announcement, the company wrote that “we believe that we need to move toward a financial model that allows edX and our partners to achieve sustainability and we acknowledge that means moving away from our current model of offering virtually everything for free.” The edX board also considered other options, MIT. said,  but decided those were “not as beneficial to edX, its learners, or its partner institutions as the transaction with 2U.”\n The new transaction and edX’s choice to turn into a public benefit corporation might become the financial model that it itself was looking for, indicating just how. hard it may be to monetize a MOOC. While 2U has committed to continuing edX’s free coursework for at least five years, as well as seeding a new non-profit, edX as it currently stands – a massive education non-profit – will no longer function as it currently does in the future.", "posttime": "2021-06-29 23:16:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大学,美国,教师,programs,edx", "title": "2U为顶级美国大学提供学位课程，收购EDX，托管托管3K课程由15,000名教师领导，现金为800亿美元 ", "title_en": "2U, which provides degree programs for top US universities, acquires edX, a nonprofit hosting 3K courses led by 15,000 instructors, for $800M in cash", "transed": 1, "url": "https://techcrunch.com/2021/06/29/2u-set-to-acquire-non-profit-edx-for-deal-north-of-600m/", "via": "", "real_tags": ["大学", "美国", "教师", "programs", "edx"]}, {"category": "", "categoryclass": "", "imagename": "44783303e63595fc64e4f4366307488e.jpg", "infoid": 1068553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据业界来源的说法，首尔法院上周上周的决定将有效地证实了Netflix向移动运营商支付网络使用费用的义务表明，这是全球视频流巨头可能必须在韩国改变其业务战略。去年，韩国的收入超过415.5亿韩元的美国内容提供商在韩国的收入中尚未向SK电信互联网协议电视子公司提供网络费用。 SK单位于2019年11月向韩国通信委员会提出了投诉，几个月后Netflix Sued SK。 Netflix要求法院审查是否有义务支付其网络使用费用。在星期五，法院裁定对Netflix，称，“根据合同自由原则，是否缔结合同，代价是什么通过有关缔约方的谈判决定。”法院还表示，“Netflix至少接受网络服务，包括网络质量管理，以成本为本。” “说Netflix有义务向SK宽带支付服务的义务是合理的。”星期五的裁决被行业观察者解释为表明网络中立的原则在韩国失去了地面，其中包括Facebook和谷歌在内的全球平台巨头将有义务为他们看到越来越多的网络流量来支付价格的价格韩国用户。互联网服务提供商表示，“该决定明确证明Netflix需要向SK宽带支付网络使用费用。”虽然美国公司正式说，Netflix似乎很有可能呼吁，但它将继续与SK宽带的合作伙伴，并承诺继续投资其“开放式联系”战略。美国公司已经用KT和LG U +伪造了营销伙伴关系，使其在另外两家移动运营商的费用问题上占据了一支大手。周一，SKT首席执行官公园Jung-Ho评论了这个问题，说：“时间来满足Netflix。” “我认为裁决可以让我们的会议更好。亚洲的合作对Netflix非常重要。“根据行业估计，Netflix的总费用将不得不向所有三个移动运营商支付，每年超过1000亿韩元。 Netflix在2020年第四季度该国总网络流量的4.8％占全国网络交通的4.8％。韩国门户巨头海军，占所有交通的1.8％，去年赢得了大约700亿韩元。卡洛支付了约300亿韩元的法院估计SK的网络使用费将达到200亿韩元。 “如果Netflix改变其立场并愿意与我们交谈，这两个公司都可以评估确切的费用，”SK宽带表示。 “然而，呼吁很可能遵循。”去年，作为Covid-19大流行影响的韩国，由于流媒体服务，Netflix用户的数量增长和网络流量，SK官方解释说。由于韩国电信网络是国家骨干的一部分，当网络速度减速时，移动运营商被迫处理差的网络质量。此外，与净中立原则放弃的美国不同，韩国保留了规定互联网服务提供商应同样对待互联网上所有数据的原则，而不是对内容提供商的歧视。 Netflix在美国，日本和法国支付使用费，坚持韩国的网络中立。 “最新的裁决可能会给kt和lg u +谈判费用，”一个行业官员说。 “它也会影响像迪斯尼+和亚马逊素数的其他外国内容提供商的参赛作品和业务战略，这些提供商正在关注韩国市场。” （song@heraldcorp.com） ", "note_en": "A Seoul court’s decision last week that effectively confirmed Netflix‘s obligation to pay network usage fees to mobile carriers suggests that the global video streaming giant might have to change its business strategy in South Korea, according to industry sources Monday.   The US-based content provider that raised 415.5 billion won ($367.6 million) in revenue in Korea alone last year has not been paying network fees to provider SK Broadband, the internet protocol TV subsidiary of SK Telecom.   The SK unit filed a complaint with the Korea Communications Commission in November 2019, and Netflix sued SK a few months later. Netflix asked the court to review whether or not it has an obligation to pay for its network usage.   On Friday, the court ruled against Netflix, saying, “According to the principle of freedom of contract, whether to conclude a contract and what price to pay is a matter to be decided through the negotiations of the concerned parties.”   The court also said, “Netflix is at least receiving network services, including management of the network quality, at a cost.”   “It is also reasonable to say that Netflix has the obligation of paying the price for the services to SK Broadband.”  Friday‘s ruling was interpreted by industry watchers as indicating the principle of net neutrality is losing ground in Korea, where global platform giants, including Facebook and Google, would be obligated to pay the price for their massive network traffic as they see growing numbers of Korean subscribers.   “This decision clearly confirms by law that Netflix needs to pay network usage fees to SK Broadband,” the internet service provider said.   It seems highly likely that Netflix will appeal, although the US firm officially said it will continue its partnership with SK Broadband for both companies’ customers and promised to continue investing in its “open connect” strategy.   The US firm has forged marketing partnerships with KT and LG U+, giving it an upper hand on the fee issue with the two other mobile carriers.    On Monday, SKT CEO Park Jung-ho commented on the issue, saying, “The time has come to meet Netflix.”  “I think the ruling can make our meeting much better. Cooperation in Asia will be important for Netflix.”   According to industry estimates, the total fees Netflix will have to pay to all three mobile carriers would be over 100 billion won a year.   Netflix accounted for 4.8 percent of the country’s total network traffic in the fourth quarter of 2020.   Korean portal giant Naver, which accounted for 1.8 percent of all traffic, paid around 70 billion won last year. Kakao paid around 30 billion won   The court estimated the network usage fee for SK would be around 200 billion won.   “If Netflix changes its stance and is willing to talk with us, both firms could appraise the exact amount of fees,” an official from SK Broadband said. “However, an appeal is highly likely to follow.”   Last year, as the COVID-19 pandemic affected Korea, the number of Netflix users grew and network traffic spiked due to the streaming service, the SK official explained.   Since the Korean telecommunications network is part of the national backbone, when network speeds slow down, mobile carriers are forced to deal with poor network quality.   Also, unlike in the United States where the net neutrality principle was abandoned, Korea keeps the principle that stipulates internet service providers should treat all data on the internet the same, and not discriminate against content providers.   Netflix, which pays usage fees in the US, Japan and France, insists on net neutrality in Korea.   “The latest ruling might give KT and LG U+ room for negotiating the fee,” said an industry official. “It would also affect entries and business strategies of other foreign content providers like Disney+ and Amazon Prime that are eyeing the Korean market.”   ( song@heraldcorp.com)", "posttime": "2021-06-29 23:16:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,网络,traffic,netflix", "title": "韩国法院裁定Netflix有义务向移动运营商支付网络使用费; Netflix在2020年第四季度占该国交通的4.8％ ", "title_en": "A South Korean court has ruled that Netflix is obligated to pay network usage fees to mobile carriers; Netflix made up 4.8% of the country's traffic in Q4 2020", "transed": 1, "url": "http://www.koreaherald.com/view.php?ud=20210628000798", "via": "", "real_tags": ["2020", "网络", "traffic", "netflix"]}, {"category": "", "categoryclass": "", "imagename": "cd79ea6516cd435bdfe215883d9a5383.jpg", "infoid": 1068552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Snapchat是警告iPhone用户，App Store中可用的消息传递应用程序的版本有问题，并且公司正在尝试解决。\n  Snapchat上次在6月28日在App Store中更新了IOS应用程序，版本11.34.0.35更新添加了多个＆＃34;错误修复＆＃34;到消息工具。但是，维护发布对某些用户出错了。\n 许多Snapchat用户声称，只要打开它，应用程序将自动崩溃到iPhone主屏幕。尚不清楚触发崩溃的内容，但它发生在相机进料变得可见之后。\n  Snapchat＆＃39; S支持团队在星期一发布到Twitter，它是＆＃34;意识到这个问题，＆＃34;警告用户＆＃34;挂紧，我们正在研究它并在修复上工作！＆＃34;\n 虽然它是未知的，但在App Store中可用时，它必须通过App Store Review进程，因此可能通过审查本身快速跟踪主要应用程序。如果是这样，更新的版本可能很快到达。\n 更新，下午7:23。东部：Snapchat报告该问题已得到修复。继续看到问题的用户被指示手动将其应用程序更新到版本11.34.1.35。\n 在每周AppleInsider播客中跟上Apple  - 并每天从AppleInsider获得快速新闻更新。刚说，＆＃34;嘿，西里，＆＃34;到您的HomePod Mini并询问这些播客，以及我们最新的HomeKit Insider Enisode。 \n如果您想要一个免费的主要AppleInsider播客体验，您可以通过苹果＆＃39; s vodcasts应用程序订阅5美元，或者通过Patreon来支持AppleInsider Podcast，如果您喜欢任何其他播客播放器。  AppleInsider已经提交伙伴关系，可以通过联盟链接购买的产品培训委员会。 这些伙伴关系不会影响我们的编辑内容。 ", "note_en": "Snapchat is warning iPhone users that the version of the messaging app available in the  App Store has a problem, and is something the company is trying to solve.\n  Snapchat last updated its  iOS app in the App Store on  June 28, with the version 11.34.0.35 update adding a number of &#34;bug fixes&#34; to the messaging tool. However, the maintenance release has gone wrong for some users.\n A number of Snapchat users claim the app automatically crashes to the iPhone Home Screen whenever it is opened. It is unclear what is triggering the crash, but it occurs just after the camera feed becomes visible.\n  Snapchat&#39;s support teams  posted to Twitter on Monday that it is &#34;aware of the issue,&#34; warning users to &#34;Hang tight, we are looking into it and working on a fix!&#34;\n While it is unknown exactly when the patch will be available in the App Store, given it has to pass through the App Store review process to do so, it is likely that the major app may be fast-tracked through the review itself. If so, the updated version could arrive fairly soon.\n Update, 7:23 p.m. Eastern: Snapchat reports the issue has  been fixed. Users who continue to see problems are instructed to manually update their app to version 11.34.1.35.\n Keep up with everything Apple in the weekly AppleInsider Podcast — and get a fast news update from AppleInsider Daily. Just say, &#34;Hey, Siri,&#34; to your HomePod mini and ask for these podcasts, and our latest HomeKit Insider episode too.\n If you want an ad-free main AppleInsider Podcast experience, you can support the AppleInsider podcast by subscribing for $5 per month  through Apple&#39;s Podcasts app, or  via Patreon if you prefer any other podcast player.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2021-06-29 23:16:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,appleinsider", "title": "AppleInsider. ", "title_en": "AppleInsider", "transed": 1, "url": "https://appleinsider.com/articles/21/06/28/dont-update-the-ios-snapchat-app-until-its-fixed", "via": "", "real_tags": ["apple"]}, {"category": "", "categoryclass": "", "imagename": "3a3a8e0fe82e6f2320d52e1ecb5a15b5.jpg", "infoid": 1068551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您一直在推出Snapchat崩溃的IOS版本的错误，似乎现在有一个更新可以在App Store中修复它。由更新修复的错误似乎没有影响应用程序的Android版本。\n 在更新到最新版本之前，11.34.1.35，该应用程序会给我一条消息，在我的iPhone 12 Mini上撞击跳板之前出现了出现问题。现在，我不再收到错误，并成功地发送了一个捕捉。\n   Snapchat支持Twitter帐户尚未推断修复程序（尽管有一个泛滥的推文谈论错误），但Snap的产品SVP已经发布了修复的问题。我自己和我的一名同事测试了更新，它修复了我们两个人的崩溃问题。\n 如果您的手机不会自动下载更新，您可以通过进入App Store来获取自己，在右上角的右上角敲击您的个人资料图片，然后拉下来刷新。应出现任何可用的更新，您可以下载它们。如果关闭自动更新以避免窃听版本，则可以将其转回设置＆gt; App Store，然后在自动下载下切换应用更新。\n 6月28日更新，7:00 PM等：更新以反映该问题似乎已通过Snapchat的更新修复。 ", "note_en": "If you’ve been experiencing the bug where the iOS version of Snapchat crashes at launch, it seems that there’s now an update to fix it available in the App Store. The bug that’s been fixed by the update didn’t appear to have affected the Android version of the app.\n Before updating to the latest version, 11.34.1.35, the app would give me a message that something went wrong, before crashing to Springboard on my iPhone 12 Mini. Now, I’m no longer getting the error, and have successfully been able to send a Snap.\n   The Snapchat Support Twitter account hasn’t yet tweeted about the fix (despite  having a pinned tweet talking about the bug), but Snap’s SVP of Product  has tweeted about the issue being fixed. Both myself and one of my co-workers tested the update, and it fixed the crashing issue for both of us.\n If your phone isn’t automatically downloading the update, you can grab it yourself by going to the App Store, tapping on your profile picture in the top right corner, and pulling down to refresh. Any available updates should appear, and you can download them. If you turned off Auto-update to avoid the bugged version, you can turn it back on by going to Settings &gt; App Store, and then toggling App Updates on under Automatic Downloads.\n Update June 28th, 7:00PM ET:  Updated to reflect that the issue appears to have been fixed by an update from Snapchat.", "posttime": "2021-06-29 23:15:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,ios,app,修复", "title": "snapchat说它已修复导致其iOS应用程序崩溃的问题，要求用户手动更新应用程序，如果它们仍然面临任何问题 ", "title_en": "Snapchat says it has fixed the issue causing its iOS app to crash for some users, asks users to manually update the app if they are still facing any problem", "transed": 1, "url": "https://www.theverge.com/2021/6/28/22554376/snapchat-ios-latest-update-crash-launch-not-working?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["程序", "ios", "app", "修复"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068550, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters", "note_en": "Artificial Intelligence (AI) holds great promise for improving the delivery of healthcare and medicine worldwide, but only if ethics and human rights are put at the heart of its design, deployment, and use, according to new WHO guidance published today. The report, Ethics and governance of artificial intelligence for health, is the result of 2 years of consultations held by a panel of international experts appointed by WHO. “Like all new technology, artificial intelligence holds enormous potential for improving the health of millions of people around the world, but like all technology it can also be misused and cause harm,” said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. “This important new report provides a valuable guide for countries on how to maximize the benefits of AI, while minimizing its risks and avoiding its pitfalls.” Artificial intelligence can be, and in some wealthy countries is already being used to improve the speed and accuracy of diagnosis and screening for diseases; to assist with clinical care; strengthen health research and drug development, and support diverse public health interventions, such as disease surveillance, outbreak response, and health systems management. AI could also empower patients to take greater control of their own health care and better understand their evolving needs. It could also enable resource-poor countries and rural communities, where patients often have restricted access to health-care workers or medical professionals, to bridge gaps in access to health services.However, WHO’s new report cautions against overestimating the benefits of AI for health, especially when this occurs at the expense of core investments and strategies required to achieve universal health coverage.It also points out that opportunities are linked to challenges and risks, including unethical collection and use of health data; biases encoded in algorithms, and risks of AI to patient safety, cybersecurity, and the environment.       For example, while private and public sector investment in the development and deployment of AI is critical, the unregulated use of AI could subordinate the rights and interests of patients and communities to the powerful commercial interests of technology companies or the interests of governments in surveillance and social control. The report also emphasizes that systems trained primarily on data collected from individuals in high-income countries may not perform well for individuals in low- and middle-income settings. AI systems should therefore be carefully designed to reflect the diversity of socio-economic and health-care settings. They should be accompanied by training in digital skills, community engagement and awareness-raising, especially for millions of healthcare workers who will require digital literacy or retraining if their roles and functions are automated, and who must contend with machines that could challenge the decision-making and autonomy of providers and patients. Ultimately, guided by existing laws and human rights obligations, and new laws and policies that enshrine ethical principles, governments, providers, and designers must work together to address ethics and human rights concerns at every stage of an AI technology’s design, development, and deployment.  Six principles to ensure AI works for the public interest in all countriesTo limit the risks and maximize the opportunities intrinsic to the use of AI for health, WHO provides the following principles as the basis for AI regulation and governance:Protecting human autonomy: In the context of health care, this means that humans should remain in control of health-care systems and medical decisions; privacy and confidentiality should be protected, and patients must give valid informed consent through appropriate legal frameworks for data protection.Promoting human well-being and safety and the public interest. The designers of AI technologies should satisfy regulatory requirements for safety, accuracy and efficacy for well-defined use cases or indications. Measures of quality control in practice and quality improvement in the use of AI must be available. Ensuring transparency, explainability and intelligibility. Transparency requires that sufficient information be published or documented before the design or deployment of an AI technology. Such information must be easily accessible and facilitate meaningful public consultation and debate on how the technology is designed and how it should or should not be used. Fostering responsibility and accountability. Although AI technologies perform specific tasks, it is the responsibility of stakeholders to ensure that they are used under appropriate conditions and by appropriately trained people. Effective mechanisms should be available for questioning and for redress for individuals and groups that are adversely affected by decisions based on algorithms.Ensuring inclusiveness and equity. Inclusiveness requires that AI for health be designed to encourage the widest possible equitable use and access, irrespective of age, sex, gender, income, race, ethnicity, sexual orientation, ability or other characteristics protected under human rights codes. Promoting AI that is responsive and sustainable. Designers, developers and users should continuously and transparently assess AI applications during actual use to determine whether AI responds adequately and appropriately to expectations and requirements. AI systems should also be designed to minimize their environmental consequences and increase energy efficiency. Governments and companies should address anticipated disruptions in the workplace, including training for health-care workers to adapt to the use of AI systems, and potential job losses due to use of automated systems.          These principles will guide future WHO work to support efforts to ensure that the full potential of AI for healthcare and public health will be used for the benefits of all.", "posttime": "2021-06-29 23:15:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,发布,global,warning", "title": "谁在医疗保健中发布了第一份全球报告，为期2年的努力，为其设计和使用具有六个指导原则，如保护人类自治 ", "title_en": "WHO publishes its first global report on AI in health care, a 2-year effort, with six guiding principles for its design and use, like protecting human autonomy", "transed": 1, "url": "https://www.who.int/news/item/28-06-2021-who-issues-first-global-report-on-ai-in-health-and-six-guiding-principles-for-its-design-and-use", "via": "", "real_tags": ["设计", "发布", "global", "warning"]}, {"category": "", "categoryclass": "", "imagename": "b738ec7e128a645f05af6146ba213713.jpg", "infoid": 1068549, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以色列的桑尼维尔成立的JFROG在纳斯达克公开交易，去年9月公立，目前市场上限为4.65亿美元。与此同时，vdoo从包括NTT，戴尔，GGV和Verizon的投资者筹集了大约7000万美元（免责声明：Verizon拥有TechCrunch），当我们涵盖最近的资金回合时，我们估计估值在1亿美元至200美元之间百万，使这是一个体面的回报。\n Shlomi Ben Haim，JFROG的联合创始人兼首席执行官表示，他的公司转向更深入的安全性，并尤其是填写这种策略，这是其旨在建立端到端的自然进展Devops团队的平台。\n  “当我们开始Jfrog时，主要挑战是在建造，测试和部署软件方面，教育市场是最重要的优先事项，”他说。然后在2015-2016左右的某个时候他说他们开始意识到系统中有一个“裂缝”，“裂缝称为安全”。 Infosec工程师和开发人员有时会在交叉目的工作，因为“开发人员变得太快”，他们所做的工作无意中导致了很多安全漏洞。\n Jfrog以来一直在构建许多工具，以解决该工具，并将集体优先级汇集在一起​​，例如其X射线产品。事实上，VDoo不是Jfrog首次进入安全性，但它代表了更深入的步骤进入在软件上运行的硬件和系统。 “这是一个非常重要的飞跃，”Ben Haim说。\n 因为它的部分，vdoo诞生于实现和挑战性的使命：IoT和其他连接的设备 - 截至去年的大约500亿件硬件的宇宙 - 代表了大规模的安全性头痛，而不仅仅是因为设备的卷：每个对象在云中使用和交互，因此每个实例都代表潜在的漏洞，零天漏洞，CVE，配置和硬化问题，以及一些最常见的标准不完整。\n 虽然连接设备安全性最多通常集中在硬件上的监视活动中，但数据如何进出它，VDoo的方法是建立一个监控设备本身的行为的平台，使用ai可以比较这个行为来识别什么东西不起作用。有趣的是，这反映了JFROG在其Devops平台中提供的二元分析，使两个互补互补。\n 但是，值得注意的是，这将使JFROG在边缘变得更大的比赛，因为VDoo平台的一部分在设备本身上工作，“微代理”以前将它们描述为我，以检测和修复终点上的漏洞。 \n虽然Jfrog从头开始建立了许多自己的业务，但它已经为技术螺栓进行了一些收购（一个示例：它用于将持续集成和交付到Devops平台上的持续集成和交付）。在这种情况下，Vdoo的联合创始人兼首席执行官Netanel Davidi（以前共同创立并销售了另一个安全创业公司Cyvera，Cyvera到Palo Alto Networks）表示这是一个很好的契合，因为这两家公司从根本上采取了同样的他们的工作方法（我可能会添加另一个协同作用和Devops和InfoSec的理由，我也可以补充）。\n “就公司之间的适合而言，这是关于我们对二进制文件的方法，”Davidi在接受采访时说，并指出这两个方法与这种方法的同一页面是对交易的基础。 “这只是从一开始就覆盖整个管道的方式，当他们开始开发一些东西，一直到设备或服务器或应用程序或移动电话。这是真正了解背景和背景风险的唯一途径。“\n 他还不仅仅是技术的备忘，而且在收购时的才能提出：100人加入JFrog的800。\n “如果Jfrog选择自己自己建造一些东西，他们本可以做到这一点，”他说。但是，这里的唯一性是我们已经建立了最好的安全团队，最好的安全研究人员，最好的漏洞研究人员，这是最好的逆向工程，不仅关注嵌入式系统，而且被认为是最难的事情学习并分析，但也在软件伪影中。我们带着这些知识与我们一起。“\n JFFROG表示，vdoo会随时继续作为独立的SaaS产品运行。所做的更新将有助于支持JFROG平台，两项目标是在2022年之前具有完全集成的“整体”产品。\n 除此之外，JFROG重申了下一季度的财务指导，将于6月30日结束，预计将收入为4760万美元至4860万美元，非GAAP营业收入为50万美元至150万美元，非GAAP EPS为0.00美元假设大约1.04亿加权平均摊薄股份所突出的0.01美元。全年2021年，收入预计为1.98亿美元至2.04亿美元，非GAAP营业收入在500万美元至700万美元之间，加权平均摊薄股增加约3％。 JFROG预计综合运营支出，须缴纳2021年的剩余时间约为9-10百万美元，但须遭到收购闭幕。 ", "note_en": "Sunnyvale-based, Israeli-founded JFrog is publicly traded on Nasdaq, where it went public last September, and currently it has a market cap of  $4.65 billion. Vdoo, meanwhile, had raised about $70 million from investors that include NTT, Dell, GGV and Verizon (disclaimer: Verizon owns TechCrunch), and when we covered its  most recent funding round, we estimated that the valuation was somewhere between $100 million and $200 million, making this a decent return.\n Shlomi Ben Haim, JFrog’s co-founder and CEO, said that his company’s turn to focusing deeper on security, and making this acquisition in particular to fill out that strategy, are a natural progression in its aim to built out an end-to-end platform for the DevOps team.\n  “When we started JFrog, the main challenge was to educate the market on what we saw as most important priorities when it comes to building, testing and deploying software,” he said. Then sometime around 2015-2016 he said they started to realize there was a “crack” in the system, “a crack called security.” InfoSec engineers and developers sometimes work at cross purposes, as “developers became too fast” the work they were doing was inadvertently led to a lot of security vulnerabilities.\n JFrog has been building a number of tools since then to address that and to bring the collective priorities together, such as its XRay product. And indeed, Vdoo is not JFrog’s first foray into security, but it represents a significant step deeper into the hardware and systems that are being run on software. “It’s a very important leap forward,” Ben Haim said.\n For its part, Vdoo was born out of a realization as well as a challenging mission: IoT and other connected devices — a universe of some 50 billion pieces of hardware as of last year — represents a massive security headache, and not just because of the volume of devices: each object uses and interacts with software in the cloud and so each instance represents a potential vulnerability, with zero-day vulnerabilities, CVEs, configuration and hardening issues, and standard incompliances among some of the most common.\n While connected-device security up to now has typically focused on monitoring activity on the hardware, how data is moving in and out of it, Vdoo’s approach has been to build a platform that monitors the behavior of the devices themselves on top of that, using AI to compare that behavior to identify when something is not working as it should. Interestingly, this mirrors the kind of binary analysis that JFrog provides in its DevOps platform, making the two complementary to each other.\n But what’s notable is that this will give JFrog a bigger play at the edge, since part of Vdoo’s platform works on devices themselves, “micro agents” as the company has described them to me previously, to detect and repair vulnerabilities on endpoints.\n While JFrog has built a lot of its own business from the ground up, it has made a number of acquisitions to bolt on technology (one example:  Shippable, which it used to bring continuous integration and delivery into its DevOps platform). In this case, Netanel Davidi, the co-founder and CEO of Vdoo (who previously co-founded and sold another security startup, Cyvera,  to Palo Alto Networks) said that this was a good fit because the two companies are fundamentally taking the same approaches in their work (another synergy and justification for DevOps and InfoSec being more closely knitted together too I might add).\n “In terms of the fit between the companies, it’s about our approach to binaries,” Davidi said in an interview, noting that the two being on the same page with this approach was fundamental to the deal. “That’s only the way to cover the entire pipeline from the very beginning, when they go you develop something, all the way to the device or to the server or to the application or to the mobile phone. That’s the only way to truly understand the context and contextual risk.”\n He also made a note not just of the tech but of the talent that is coming on with the acquisition: 100 people joining JFrog’s 800.\n “If JFrog chose to build something like this themselves, they could have done it,” he said. “But the uniqueness here is that we have built the best security team, the best security researchers, the best vulnerability researchers, the best reverse engineers, which focus not only on embedded systems, and IoT, which is considered to be the hardest thing to learn and to analyze, but also in software artifacts. We are bringing this knowledge along with us.”\n JFrog said that Vdoo will continue to operate as a standalone SaaS product for the time being. Updates that are made will be in aid of supporting the JFrog platform and the two aim to have a fully integrated, “holistic” product by 2022.\n Along with the deal, JFrog reiterated financial guidance for the next quarter that will end June 30, 2021. It expects revenues of $47.6 million to $48.6 million, with non-GAAP operating income of $0.5 million to $1.5 million and non-GAAP EPS of $0.00 to $0.01, assuming approximately 104 million weighted average diluted shares outstanding. For Full Year 2021, revenues are expected to be $198 million to $204 million, with non-GAAP operating income between $5 million and $7 million and an approximately 3% increase in weighted average diluted shares. JFrog anticipates consolidated operating expenses to increase by approximately $9-10 million for the remainder of 2021, subject to the acquisition closing.", "posttime": "2021-06-29 23:15:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,安全,company,jfrog", "title": "Devops Company Jfrog获取VDoo，它为IOT和连接设备开发了基于AI的安全工具，以满足300米 ", "title_en": "DevOps company JFrog acquires Vdoo, which develops AI-based security tools for IoT and connected devices, for $300M", "transed": 1, "url": "https://techcrunch.com/2021/06/29/devops-platform-jfrog-acquires-ai-based-iot-and-connected-device-security-specialist-vdoo-for-300m/", "via": "", "real_tags": ["开发", "安全", "company", "jfrog"]}, {"category": "", "categoryclass": "", "imagename": "767da17d1df3717ee13792e052b31538.jpeg", "infoid": 1068548, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要求某些供应商允许亚马逊在潜在的低于市场汇率下购买股票的权利，作为合同的一部分\n   想要降落Amazon.com Amzn -0.53％的供应商作为他们的商品和服务的客户可以发现它的业务随着捕获：亚马逊的权利，亚马逊在其公司购买大型赌注，以潜在的巨大折扣到市场价值。\n  根据企业申请和公司申请，若干技术和零售公司至少有十几家与公开交易的公司达成了公开交易的公司，其中呼吁认股权证，以低于市场价格低于市场价格。与参与交易的人进行访谈。\n  据熟悉此事的人表示，过去十年过去十年的亚马逊还完成了75多家私人持有公司的交易。总之，科技泰坦的赌注和潜在的股票跨越数十亿美元的公司，这些公司将所有从呼叫中心服务到天然气，以及在某些情况下，这些企业的顶级股东中的亚马逊地位。\n  不寻常的安排提供了另一个窗口进入亚马逊如何使用其市场的巨大，以增加其财富和污染。该公司在竞争实践中，该公司一直在监管机构和立法者的审查，包括与其合作伙伴的公司。\n  虽然该交易可以通过锁定大合同来使供应商受益，但也可以提高其股价，在其中几家公司的高管表示他们认为他们无法拒绝亚马逊的推动购买股票的权利，而不冒着主要合同。在某些情况下，交易还提供亚马逊权利，如董事会代表，以及其他公司的任何收购优惠的能力。\n  对于亚马逊，安排使其成为他们的供应商可以与世界上最大的公司之一进行业务的潜在众多。 \n亚马逊经常利用其大小和权力来强制为自己受益的术语，包括让合作伙伴在一个企业中登录其其他服务;通过其风险资本基金学习上行技术公司;或创造顶级销售与其网站上的小卖家竞争的亚马逊品牌商品。它积极地竞争竞争对手的市场份额，亚马逊向购物者提供了更好的优惠成果。\n  根据亚马逊在此交易工作的情况下，亚马逊在包括认股权证的供应商交易中，亚马逊抛出其重量，以确切的利润丰富的术语，知道许多公司不会拒绝。\n  一位亚马逊发言人表示，它在商业协议中获得的认股权证通常与亚马逊必须满足的里程碑相关联，例如来自供应商的大型购买。该公司拒绝评论具体交易，或者说它行使或从此类协议中取出的金额有多少令。发言人表示，它有少于它进入的商业协议的少于1％的交易。\n  去年杂货店分销商Spartannash与亚马逊修改了合同，向其亚马逊新鲜手臂提供杂货。宏伟急流，迈克基州的公司自2016年以来一直在为亚马逊提供亚马逊，但这一次亚马逊增加了一个条件：如果它在七年超过了价值80亿美元的杂货，则可以获得距离Spartannash股票的15％价格潜在低于市场。亚马逊还表示希望收到任何收购斯巴达什什的报价，并有一个10天的窗口来提供抵消。\n    熟悉此事的人表示，Spartannash高管们被吃惊了解。之前没有客户要求此类条款。高管最终决定他们不想与Spartannash最大的客户讨厌，并且与亚马逊联系可以提高他们公司的个人资料，其中一位人民称。亚马逊在该交易宣布时收到了公司的认股权证，如果行使，股票的2.5％。根据合同条款，如果收到和练习认股权证，额外的12.5％，它将是Spartannash的第二大股东Blackrock Inc.\n    亚马逊高管和律师在构建交易的情况下，亚马逊一直在做大约十年的卖方达成协议，但在过去几年中积极提高了这种做法。该公司在其最新的季度报告中，该公司的认股权证价为28亿美元，三年前的五倍多。亚马逊没有披露其拥有的股份的价值，因为行使其权证。\n  亚马逊季度备案的说法，通过认股权证，直接投资或其他方式在公司中获得的认股权证和股权的更广泛的衡量标准，直接投资或其他方式增加了10倍至84亿美元。 \n像股票期权，保证让持有人在设定期间以设定的价格购买公司的股票。如果股票超越罢工价格，则护令持有人可以以低于市场价格购买股票。\n  在一系列行业和律师中的企业高管表示，亚马逊推动获得权证，因为供应商交易的一部分是非常不寻常的。在经济问题的投资者中，保证交易更常见，在经济困境中，在交易中被视为高风险。\n    前亚马逊高管在逮捕令交易上工作说他们在公司开始袭击他们之前没有直接先例。对于指导来说，亚马逊团队通过2008年金融危机的金融文件中的金融文件中找到了有关涉及认股权证的银行救助的信息，其中一位人民表示。\n  亚马逊发言人指出了其他一些公司的少数例子，令人犯了令人信度的安排。在2017年，澳门队在亚马逊击中了与本公司认股权证的商业交易后几个月获得了沃尔玛在插头电源中获得了认股权证。沃尔玛发言人表示，该公司非常不经常在其他公司获得认股权证。插头功率拒绝评论。\n  一些供应商看到授予亚马逊的权证作为一个有价值的竞争优势。清洁能源燃料在今年早些时候与亚马逊达成协议，这可能会在未来十年内为较大的公司提供20％的股份，使其成为2号股东。根据熟悉此事的人表示，管理层从未完成商业交易，但据熟悉此事，但亚马逊已经向其他天然气公司提供了大量提出的提案，并确定了接受认股权证条款的清洁能源该人说，将亚马逊保持与竞争对手的更多业务。作为条款的一部分，如果该人表示，清洁能量必须通知亚马逊如果收到收购报价。清洁能源拒绝发表评论。\n  亚马逊的首次重大认股权证与公开交易供应商交易于2016年。亚马逊正在寻求与货运飞机的合作伙伴，以帮助建立其巨大的物流网络。高管推出，该公司潜在的合作伙伴都是较小的，较小的公司具有滞留增长的较小公司，并且据熟悉此事的人表示，亚马逊的主要合同会使其股票振兴。该人说，亚马逊想要一些潜在的上行程序。\n  据熟悉此事的人，亚马逊提出了俄亥俄州航空运输服务集团威尔明顿的威尔明顿的交易，威廉航空运输服务集团最初推动了逮捕令规定。它的团队飞往西雅图，并在亚马逊获得了“激烈，谈判的谈判”，其中一位人民称。 “这花了很多令人信服，”这个人说。亚马逊目前拥有约19.5％的ATSG，使其成为最大的股东。 \n亚马逊高管知道需要租赁更多的飞机来处理其交付运营中的爆炸性增长，并且初始逮捕令他们要求他们要求其他公司的类似条款，其中一个人表示。\n  在与Atlas Air Worldwide Holdings Amazings Amazon的谈判中，亚马逊提供了10年的租赁交易，具有类似的条款。这次亚马逊要求认股权证，达到五年多达20％的阿特拉斯股权的权益 - 以稍后的方式为10％的选项 - 取决于它给予了多少商业。亚马逊还希望在满足某些里程碑之后将导演选举主任的权利。\n  参与双方的人士表示，认股权证是亚马逊与阿特拉斯合作的条件。 “绝对有一种感觉，如果没有同意没有交易，”其中一个人说。该人表示，阿特拉斯高管不想从亚马逊那里提出从亚马逊的收入机会，并将认股权证放在亚马逊的价格。\n  2016年5月宣布该交易时，阿特拉斯赞成这笔交易，包括股权安排。它的股价当天飙升27％。当Amazon完成了公开交易的逮捕令时，这种跳跃是常见的，因为它宣布其协议，Spartannash的股票上涨26％。\n  阿特拉斯认股权证的罢工价格为37.50美元，略低于股票在交易宣布之前交易。根据阿特拉斯发言人，亚马逊稍后举行了9％的阿特拉斯股票的股票并销售了股票。亚马逊拒绝发表评论它在其销售的地图集股票上。\n    根据阿特拉斯发言人，阿特拉斯从未做过类似的交易。她说，亚马逊从未将导演的主任命名为阿特拉斯委员会。\n    亚马逊还签署了包括认股权证的货车销售商。 Cargojet没有回复评论要求。 \n亚马逊经常将其权证与其给予多少商业。 在达成TheelEk Inc.的情况下，基于科罗拉多州的呼叫中心公司同意给亚马逊获得20％的股份权，如果亚马逊有超过八年的开发人员的营业员每股6亿美元。 这将使Amazon Startek的第二大股东，如果是获得认股权证并锻炼它们。 Startek没有回复评论请求。  前亚马逊高管表示，他们在供应商谈判中避免做任何事情，例如将其概括书的书面形式放入，这将为亚马逊滥用权力的批评者提供饲料。 其中一位前高管表示，大多数公司遵守其对认股权证的需求。 在此次交易中工作的几位前亚马逊高管在采访中表示，他们发现他们是不公平和片面的，称这些公司没有拒绝的位置，大部分上行都去了亚马逊。 ", "note_en": "Certain suppliers are asked to give Amazon the right to buy shares at potentially lower-than-market rates as part of their contract\n   Suppliers that want to land  Amazon.com    AMZN  -0.53%  as a client for their goods and services can find that its business comes with a catch: the right for Amazon to buy big stakes in their companies at potentially steep discounts to market value.\n  The technology-and-retail giant has struck at least a dozen deals with publicly traded companies in which it gets rights, called warrants, to buy the vendors’ stock in the future at what could be below-market prices, according to corporate filings and interviews with people involved with the deals.\n  Amazon over the past decade also has done more than 75 such deals with privately held companies, according to a person familiar with the matter. In all, the tech titan’s stakes and potential stakes amount to billions of dollars across companies that provide everything from call-center services to natural gas, and in some cases position Amazon among the top shareholders in those businesses.\n  The unusual arrangements offer another window into how Amazon uses its market heft to increase its wealth and clout. The company has been under growing  scrutiny from regulators and lawmakers over its competitive practices,  including with companies it partners with.\n  While the deals can benefit the suppliers by locking in big contracts, which can also boost their share prices, executives at several of the companies said they felt they couldn’t refuse Amazon’s push for the right to buy the stock without risking a major contract. The deals in some cases also give Amazon rights such as board representation and the ability to top any acquisition offers from other companies.\n  For Amazon, the arrangements give it a piece of the potential upside their vendors can get from doing business with one of the world’s biggest companies.\n  Amazon routinely leverages its size and power to force terms that benefit itself, including by getting  partners in one business to sign on to its other services; learning about  up-and-coming technology companies through its venture-capital fund; or  creating top selling Amazon branded goods that compete with small sellers on its site. It has aggressively competed to wrest market share from rivals, which Amazon says results in better deals for shoppers.\n  In its supplier deals that include warrants, Amazon throws its weight around to exact lucrative terms, knowing many companies won’t refuse, according to former Amazon executives who worked on the deals.\n  An Amazon spokeswoman said the warrants it obtains in commercial agreements are typically tied to milestones that Amazon has to meet, such as large purchases from the supplier. The company declined to comment on specific deals, or say how many warrants it has exercised or the amount of money it has made from such agreements. The spokeswoman said it has warrant deals in fewer than 1% of the commercial agreements it enters into.\n  Grocery distributor  SpartanNash  last year amended a contract with Amazon to deliver groceries to its Amazon Fresh arm. The Grand Rapids, Mich.-based company had been supplying Amazon with food since 2016, but this time Amazon added a condition: if it bought $8 billion worth of groceries over seven years, it could get warrants to purchase around 15% of SpartanNash’s stock at a price potentially lower than the market. Amazon also said it wanted to be notified of any takeover offers for SpartanNash and have a 10-day window to offer a counterbid.\n    SpartanNash executives were taken aback, said people familiar with the matter. No customer had requested such terms before. Executives ultimately decided they didn’t want to haggle with one of SpartanNash’s biggest customers, and that being tied to Amazon could raise their company’s profile, one of the people said. Amazon received warrants in the company when the deal was announced that would amount to 2.5% of its stock if exercised. If it receives and exercises warrants for the additional 12.5%, according to the contract terms, it would be SpartanNash’s second-largest shareholder after mutual-fund manager BlackRock Inc.\n    Amazon has been doing such deals with vendors for about a decade but has aggressively increased the practice in the past few years, said former Amazon executives and lawyers who worked on structuring the deals. In its latest quarterly report, the company valued its warrants at $2.8 billion, more than five times the level three years ago. Amazon doesn’t disclose the value of stakes it owns as a result of exercising its warrants.\n  A broader measure of its warrants and the stakes it holds in companies through warrants, direct investment or other ways increased 10 times to $8.4 billion in that period, according to Amazon’s quarterly filings.\n  Like stock options, warrants let the holder buy a company’s shares at a set price during a set period. If the stock surpasses that strike price, the warrant holder can buy shares at a below-market price.\n  Corporate executives in a range of industries and lawyers said Amazon’s push to get warrants as part of vendor deals is highly unusual. Warrant deals have more commonly been used by investors who back companies in financial trouble, in deals deemed high risk.\n    Former Amazon executives who worked on warrant deals said they found no direct precedent before the company began striking them. For a guide, an Amazon team sleuthed through financial documents from the 2008 financial crisis to find information about bank bailouts that involved warrants, one of the people said.\n  The Amazon spokeswoman pointed to a few examples of other companies striking warrant arrangements. In 2017,  Walmart  obtained warrants in  Plug Power  a few months after Amazon struck a commercial deal tied to warrants with the company. A Walmart spokeswoman said the company very infrequently obtains warrants in other companies. Plug Power declined to comment.\n  Some suppliers see granting Amazon warrants as a worthwhile competitive advantage.  Clean Energy Fuels  struck a deal with Amazon earlier this year that could give the larger company a 20% stake over the next decade, making it the No. 2 shareholder. Management had never done a commercial deal where it gave the customer warrants, according to a person familiar with the matter, but Amazon had put out a large request for proposals from other natural-gas companies, and Clean Energy determined that accepting the terms of warrants would keep Amazon from choosing to do more business with competitors, the person said. As part of the terms, Clean Energy must notify Amazon if it receives a takeover offer, the person said. Clean Energy declined to comment.\n  Amazon’s first major warrants deal with a publicly traded vendor came in 2016. Amazon was seeking a partner with cargo planes to help build out its massive logistics network. Executives reasoned that the company’s potential partners were all smaller, lesser-known companies with stagnant growth, and that a major contract from Amazon would invigorate their stocks, according to a person familiar with the matter. Amazon wanted some of that potential upside, the person said.\n  Amazon proposed a deal, with warrants, to Wilmington, Ohio-based  Air Transport Services Group  The aircraft-leasing company initially pushed back on the warrant stipulation, according to people familiar with the matter. Its team flew to Seattle and had “intense, protracted negotiations” where Amazon got ATSG to agree to the structure, one of the people said. “It took a lot of convincing,” the person said. Amazon currently owns around 19.5% of ATSG, making it the biggest shareholder.\n      Amazon executives knew it would need to lease many more planes to handle explosive growth in its delivery operation, and the initial warrant deal emboldened them to demand similar terms from other companies, said one of the people involved.\n  In talks with  Atlas Air Worldwide Holdings  Amazon broached a 10-year leasing deal, with similar terms. This time Amazon demanded warrants that would amount to up to 20% of Atlas’s equity over five years—with an option for 10% more later—depending on how much business it gave Atlas. Amazon also wanted the right to elect a director to Atlas’s board, after meeting certain milestones.\n  People involved on both sides said that warrants were a condition of Amazon partnering with Atlas. “There was definitely a sense that if it wasn’t agreed to there wouldn’t be a deal,” said one of the people. Atlas executives didn’t want to pass up the revenue opportunity from Amazon and viewed giving up the warrants as the price of doing business with Amazon, said the person.\n  When it announced the deal in May 2016, Atlas lauded the deal, including the equity arrangement. Its share price soared 27% that day. Such jumps have been common when Amazon has done warrant deals with publicly traded suppliers—SpartanNash’s stock rose 26% on the day it announced its agreement.\n  The strike price for the Atlas warrants was $37.50, slightly below where the shares were trading before the deal was announced. Amazon later exercised warrants for 9% of Atlas’ stock and sold the shares, according to an Atlas spokeswoman. Amazon declined to comment on how much it made on its sale of Atlas stock.\n    Atlas has never done a similar deal, according to the Atlas spokeswoman. Amazon never named a director to Atlas’s board, she said.\n    Amazon also signed a vendor deal with  Cargojet  that included warrants. Cargojet didn’t respond to requests for comment.\n  Amazon often ties its warrants to how much business it gives a supplier. In a deal with Startek Inc., the Colorado-based call-center company agreed to give Amazon the right to acquire 20% of its shares if Amazon does $600 million of business with Startek over eight years. That would make Amazon Startek’s second-largest shareholder, if it were to obtain the warrants and exercise them. Startek didn’t respond to requests for comment.\n  Former Amazon executives said they avoided doing anything during supplier negotiations, such as putting its ultimatums in writing, that would give fodder to critics who have said Amazon abuses its power. One of the former executives said that most companies complied with its demands over warrants. Several former Amazon executives who worked on such deals said in interviews that they found them to be unfair and one-sided, saying the companies weren’t in a position to refuse and that most of the upside went to Amazon.", "posttime": "2021-06-29 23:15:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,市场,docs", "title": "消息来源和文件：作为合同的一部分，亚马逊在供应商中的股份制定了80多种优惠，通常在市场低于市场价格，如何利用其权力 ", "title_en": "Sources and docs: as part of contracts, Amazon has made 80+ deals for stakes in suppliers, often at below-market prices, a sign of how it leverages its power", "transed": 1, "url": "https://www.wsj.com/articles/amazon-demands-one-more-thing-from-some-vendors-a-piece-of-their-company-11624968099?mod=djemalertNEWS", "via": "", "real_tags": ["amazon", "亚马逊", "市场", "docs"]}, {"category": "", "categoryclass": "", "imagename": "1b2f6fa28c0d3417726fdfb5e6436695.jpg", "infoid": 1068547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联盟，伦敦，6月29日（路透社） -  TP ICAP（TCAPI.L），世界＆＃39;最大的Instumer经纪人，正在推出一个带有富达投资和标准特许的加密货币交易平台和数码资产监护单位。星期二。\n 机构投资者今年的加密部门加热到了加密部门，该平台将于今年下半年推出，最初允许他们交易比特币，第二大令牌以太网将被稍后添加。\n TP ICAP和12月的风险投资（Stan.l）和北方信托的风险投资和北极信托队推出的富达数字资产和Zodia监护权，正在寻求将加密交易类似于股票，债券和外国等传统资产的贸易交换。\n 该平台将提供与数字资产保管人网络的贸易贸易基础设施，并在一份声明中表示，并单独执行和结算，被广泛被视为更大的风险厌恶投资者在新兴加密市场中参与的关键。\n 目前，加密执行和监护服务通常在一个场地中卷起，增加信用风险。基于阿姆斯特丹的流量交易员将为平台提供流动性。\n TP ICAP通过提供新的数据和分析服务和推出新产品，通过全球资本市场扩大了其占地面积。\n 专门的加密资金已经看到了今年的唱片流量，但主要银行提供通道必须与与加密货部门长期相关的符合性头痛和监管机构增加审查，这必须平衡增长的兴趣。阅读更多 \n尽管如此，该举措是渣打银行的最新认可，其风险投资单位本月早些时候表示，它将在英国和欧洲建立一个单独的加密经纪和交流平台，与香港＆＃39; S BC技术集团（ 0863.hk）。阅读更多\n ＆＃34;投资者对这个新的资产阶级的兴趣在过去的六到八个月里爆炸了，而＃34; Duncan Trenholme，TP ICAP的数字资产的联合主管，告诉路透社。 ＆＃34;在我们与客户的大多数对话中，他们希望从执行能力与当前存在的模型相反的执行能力分离。＆＃34;\n TP ICAP于2019年推出比特币期货和CME的选项，现在计划推出其他衍生产品，包括总回报互换和不可交付的前锋。\n 该平台正在等待英国的批准和金融监管机构。 TP ICAP表示，既未投资于该平台，仍未投入净化的租赁或保真投资。\n （此故事重新排放到标题，第9和第11段中的名称中添加丢弃的字母） ", "note_en": "LONDON, June 29 (Reuters) - TP ICAP  (TCAPI.L), the world&#39;s biggest interdealer broker, is launching a cryptocurrency trading platform with Fidelity Investments and Standard Chartered&#39;s digital assets custody unit, the consortium said on Tuesday.\n Institutional investors have warmed to the crypto sector this year and the platform, which is due to launch in the second half of the year, will initially allow them to trade bitcoin , with second-largest token ether to be added later.\n TP ICAP, along with Fidelity Digital Assets and Zodia Custody, launched by the venture capital arm of Standard Chartered  (STAN.L) and Northern Trust in December, is seeking to make crypto trading akin to that of traditional assets like stocks, bonds and foreign exchange.\n The platform will offer post-trade infrastructure with a network of digital asset custodians, the consortium said in a statement, and separate execution and settlement, something widely seen as key to greater involvement of larger risk-averse investors in the emerging crypto market.\n At present, crypto execution and custody services are usually rolled up in one venue, increasing credit risks. Amsterdam-based Flow Traders will provide liquidity to the platform.\n TP ICAP has broadened its footprint in global capital markets by offering new data and analytics services and rolling out new products.\n Dedicated crypto funds have seen record flows this year but major banks offering access must balance growing interest with the compliance headaches long associated with the cryptocurrency sector and increasing scrutiny by regulators.   read more\n Still, the move is the latest endorsement of the sector by Standard Chartered, whose venture capital unit said earlier this month it will set up a separate crypto brokerage and exchange platform in Britain and Europe, with Hong Kong&#39;s BC Technology Group  (0863.HK).   read more\n &#34;Investor interest in this new asset class has exploded dramatically in the last six to eight months,&#34; Duncan Trenholme, co-head of digital assets at TP ICAP, told Reuters. &#34;In most of our conversations with clients, they want a separation of custodial roles from execution capabilities which is opposite to the models that exist currently.&#34;\n TP ICAP launched bitcoin futures and options on CME in 2019 and now plans to launch other derivative products including total return swaps and non-deliverable forwards.\n The platform is awaiting approval by Britain&#39;s financial regulator. Neither Standard Chartered nor Fidelity Investments have invested in the platform, TP ICAP said.\n (This story refiles to add dropped letters to name in headline, 9th and 11th paragraphs)", "posttime": "2021-06-29 23:14:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,货币,icap,加密", "title": "世界上最大的Interdealer经纪人TP ICAP表示，它正在推出具有保真投资和标准特许的加密货币交易平台 ", "title_en": "TP ICAP, the world's largest interdealer broker, says it is launching a cryptocurrency trading platform with Fidelity Investments and Standard Chartered", "transed": 1, "url": "https://www.reuters.com/business/exclusive-icap-launch-crypto-trading-platform-with-fidelity-standard-chartered-2021-06-29/", "via": "", "real_tags": ["交易", "货币", "icap", "加密"]}, {"category": "", "categoryclass": "", "imagename": "46c6a7fc11d21abaf412d4809eefcfab.jpg", "infoid": 1068546, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在我们的EC-1中详细探讨的400人公司，由Luis von Ahn，Captcha和Recaptcha的发明者和Severin黑客共同创立。其故事最明显的比特之一？它是作为当时稀有的Edtech消费者业务被货币化的途径。该公司有一段有点迂回的旅程 - 充满了试用和错误 - 寻找完美的商业模式。它最终降落在订阅上，这归功于其使命提供免费教育。\n   绝大多数Duolingo的收入来自订阅。例如，在最近的日历年度，Edtech Giant从订阅收入中生成了总顶线的73％。该收入随后是2020年的广告收入和Duolingo英语考试（DEC），其中代表其顶级的17％和10％。（特别是，Von Ahn希望DEC将是Duolingo截至2019年的20％，a图中未能达到的数字。）\n  它的多件商业模式似乎正在付清。该公司的收入从2019年的7080万美元增加到2020年的16170万美元，增加了129％。当然，其中一些增长将发生在最近的全球大流行中，但并不难以看到数据中有一些与会相关的加速度。 Duolingo还在2021年的第一季度报告了5540万美元的收入，占年前期间的97％。\n  但在更严格的会计条款中，净损失已为Duolingo种植。例如，在3月31日止三月31日止三个月，该公司净亏损1350万，与去年同期相比，净亏损率为220万美元。从2019年到2020年，公司的GAAP净亏损从1360万美元扩大到1580万美元。\n 应该指出的是，公司的净利润在2020年改善，因为它的收入增加了一倍多，而其损失几乎没有悄悄地疲惫不堪。该公司的盈利能力或缺乏在即将上市期间不应该成为一个问题。\n 在其S-1申请中，Duolingo提供了一个占位符1亿美元的资金，用于筹集资金;当它在其路演后，我们会更好地了解Edtech Unicorn在IPO期间在其IPO期间船上的资金。\n 前初创公司有效地启动了Q3 2021 IPO季节，其中一些发明人告诉TechCrunch将超过活跃。 \nDuolingo迄今为止已筹集了18330万美元的风险投资。公司在公司有意义的投资者包括Newview Capital，Union Square Ventures，Capitalg，Kleiner Perkins和Allantic，最近通过二级交易在Cap桌上找到了一个点。\n 今天的运行率约为2.2亿美元，增长超过100％，Duolingo不应有问题清除其私人设定的24亿美元的价格标签。除非公众市场投资者感到关切的，否则埃德科市场的增长大多是在它的背后。 Duolingo在第一季度增长了近100％，这可能会锻炼这些问题。\n   TechCrunch仍然可以通过Duolingo的IPO归档来挖掘它，但我们发现了许多细节，可以为最近的增长和业务结果增加了多种。以下是一些练习：\n 2020年的“记录低”的磨损率，其中只有四名员工，或其2％的劳动力离开了公司。\n 该公司最终计划在其提供的语言中启动“Duolingo Patch Cate Packs”，希望创建“广泛接受的语言能力水平指标，并使Duolingo全球水平标准”。\n 它引用了Apple的“Translate”工具，一个IOS应用程序在2020年推出，允许用户在几种语言之间翻译文本句子或语音，作为“风险因素”部分中的竞争对手。\n 最后，它确认它正在寻求潜在的收购候选人，以向其启动添加互补服务。 ", "note_en": "The 400-person company,  which we explored in great detail in our EC-1, was co-founded by Luis von Ahn, the inventor of CAPTCHA and reCAPTCHA, and Severin Hacker. One of the most revealing bits of its story? It’s a route to monetization as a then rare edtech consumer business based outside of Silicon Valley. The company has had a somewhat circuitous journey — full of trial and error — on finding the perfect business model. It eventually landed on subscriptions, despite an original distaste for it thanks to its mission to provide free education.\n   The vast majority of Duolingo’s revenue comes from subscriptions. In the most recent calendar year, for example, the edtech giant generated 73% of its total top line from subscription incomes. That revenue was followed by advertising incomes and the Duolingo English Test (DET), which represented 17% and 10% of its top line in 2020. (Notably, von Ahn hoped that  the DET would be 20% of Duolingo’s revenue by 2019, a figure that it failed to reach by some margin.)\n  Its multi-part business model appears to be paying off. The company’s revenue grew from $70.8 million in 2019 to $161.7 million in 2020, a 129% increase. Of course some of that growth would have happened sans the recent global pandemic, but it’s not hard to see some COVID-related acceleration in the figures. Duolingo also reported $55.4 million in revenue during the first quarter of 2021, representing a 97% growth from the year-ago period.\n  But in more strict accounting terms, net losses have grown for Duolingo. In the three months ended March 31, 2021, for example, the company had net losses of 13.5 million, a sharp increase compared to the same period last year when it had net losses of $2.2 million. And from 2019 to 2020, the company’s GAAP net losses expanded from $13.6 million to $15.8 million.\n It should be noted that the company’s net margin improved in 2020, as its revenue more than doubled and its losses barely crept higher. The company’s profitability or lack thereof should not prove to be a problem during its impending listing.\n In its S-1 filing, Duolingo provided a placeholder $100 million figure for the funds it expects to raise; we’ll get a better idea of how much capital the edtech unicorn may onboard during its IPO when it sets an IPO price range after its roadshow.\n The former startup is effectively the kick-off to the Q3 2021 IPO season, one that several inventors have told TechCrunch will be more than active.\n Duolingo has raised $183.3 million in venture capital to date. Investors that have meaningful stakes in the company include NewView Capital, Union Square Ventures, CapitalG, Kleiner Perkins, and General Atlantic, which  recently got a spot on the cap table through a secondary transaction.\n At a run rate of around $220 million today and growth of more than 100%, Duolingo should not have a problem clearing its privately set $2.4 billion price tag. Unless public-market investors are concerned that the edtech market’s growth is mostly behind it. That Duolingo grew by nearly 100% in the first quarter could temper such concerns.\n   TechCrunch is still digging its way through Duolingo’s IPO filing, but we’ve found a number of details that add more than a little color to its recent growth and business results. Here are some standouts:\n A “record low” attrition rate in 2020 in which only four employees, or 2% of its workforce left the company.\n The company eventually plans to launch a “Duolingo Proficiency Score” across its offered languages, with the hopes of creating a “widely accepted indicator of language proficiency level and make Duolingo a global proficiency standard.”\n It cited Apple’s “Translate” tool, an iOS app launched in 2020 that allows users to translate text sentences or speech between several languages, as a competitor in the ‘risk factors’ section.\n And finally,  it confirmed that it is seeking potential acquisition candidates to add complementary services to its startup.", "posttime": "2021-06-29 23:14:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,美国,文件,revenue,duolingo", "title": "Duolingo文件为美国IPO，揭示了2020年的收入增长了129％，并在2021季度报告了55.4米的收入 ", "title_en": "Duolingo files for US IPO, reveals revenue growth of 129% YoY in 2020, and reports $55.4M in revenue during Q1 2021", "transed": 1, "url": "https://techcrunch.com/2021/06/28/duolingo-s-1/", "via": "", "real_tags": ["2020", "美国", "文件", "revenue", "duolingo"]}, {"category": "", "categoryclass": "", "imagename": "dbc11a87287f30bad92adbdda938a83e.jpeg", "infoid": 1068544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "惠普已经推出了亭Aero 13，这是公司＆＃39; S最轻的消费式笔记本电脑。该器件重量小于一千克，它的第一座亭子笔记本电脑，具有90％的屏幕到身体无线电。\n 13.3英寸机器具有2.5K显示器，16:10纵横比，400个亮度和100％的SRGB调色板。 Pavilion Aero 13具有WiFi 6支持和AI噪音，以减少视频通话的不需要的背景声音。惠普索赔您＆＃39; LL从一次充电达到10.5小时。笔记本电脑由AMD Ryzen 5000系列处理器提供动力，内置Radeon Graphics，最多可达Ryzen 7 5800U。\n   Pavillion Aero 13由消费后再生和海洋塑料制成，它采用水性涂料。惠普表示，这台笔记本电脑是EPEAT金牌和能源之星，被认证，作为拥有＆＃34的目标的一部分。世界＆＃39;最可持续的PC组合。＆＃34;它＆＃39; LL于7月份通过HP.com获得，它始于749美元。你＆＃39; ll能够通过秋天从其他零售商捡起来。\n  同时，惠普将宣布为其M系列显示器阵容进行两次补充。该公司在CES揭示了这条线。他们使用Eyesafe认证的技术，HP索赔减少了蓝色光，而不会影响颜色精度。使用回收的海洋塑料制造的监视器现在包括24和27英寸型号，内置音频。他们＆＃39; 7月份可用，24英寸显示器起价为230美元，更大的凡人售价为290美元。\n   ENGADGET推荐的所有产品由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括联盟链接。如果您通过其中一个链接购买某些内容，我们可能会获得联盟委员会。\n   由于您的隐私首选项，此内容不可用。在此处更新您的设置，然后重新加载页面以查看它。 ", "note_en": "HP has unveiled the Pavilion Aero 13, which is the company&#39;s lightest consumer laptop yet. The device weighs less than a kilogram and it&#39;s the first Pavilion laptop with a 90 percent screen-to-body radio.\n The 13.3-inch machine has a 2.5K display with a 16:10 aspect ratio, 400 nits of brightness and a 100 percent sRGB color palette. The Pavilion Aero 13 has  WiFi 6 support and AI noise removal to reduce unwanted background sounds on video calls. HP claims you&#39;ll get up to 10.5 hours of use from a single charge. The laptop is powered by an  AMD Ryzen 5000 series processor with built-in Radeon graphics, up to Ryzen 7 5800U.\n   The Pavillion Aero 13 is made with post-consumer recycled and ocean-bound plastics and it uses water-based paint. HP says the laptop is  EPEAT Gold registered and Energy Star certified as part of its goals of having the &#34;world&#39;s most sustainable PC portfolio.&#34; It&#39;ll be available through HP.com in July and it starts at $749. You&#39;ll be able to pick it up from other retailers by the fall.\n  Meanwhile, HP announced two more additions to its M-Series  monitor lineup. The company  revealed the line at CES. They use Eyesafe-certified tech, which HP claims reduces blue light without affecting color accuracy. The monitors, which are made using recycled ocean-bound plastics, now include 24- and 27-inch models with built-in audio. They&#39;ll be available in July, with the 24-inch monitor starting at $230 and the larger variant starting at $290.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2021-06-29 23:14:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电脑,笔记本电脑,pavilion,内置", "title": "惠普推出13.3英寸亭Aero 13，其最轻的消费笔记本电脑，称重在1千克下，屏幕到体比为90％，售价为749美元，于7月份 ", "title_en": "HP unveils the 13.3-inch Pavilion Aero 13, its lightest consumer laptop, weighing under 1KG with a 90% screen-to-body ratio, starting at $749, available in July", "transed": 1, "url": "https://www.engadget.com/hp-pavilion-aero-13-laptop-m-series-monitors-130032913.html", "via": "", "real_tags": ["电脑", "笔记本电脑", "pavilion", "内置"]}]