[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1070563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JPG vs Raw：第一次做对 © 2009 KenRockwell.com。版权所有。我使用这些商店。我不能保证下面的广告。 2008 年的一个大问题是人们在拍摄时不知道为什么。 Raw 需要专用软件才能读取。如果您刚刚购买了新相机，则在更新计算机软件之前您将无法打开这些文件。更糟糕的是，许多新相机在相机制造商的软件更新前一周推出，如果您使用 Adob​​e、Apple 或其他公司的软件，可能需要等待数周（或更长时间）才能更新。这意味着如果您没有拍摄 JPG，您今天可能无法使用新相机打开文件！如果您使用 Photoshop 和 Adob​​e Camera Raw，您可能只需要购买最新版本的 Photoshop，因为 Adob​​e 不会更新旧版本以从新相机读取文件。哈哈！ Photoshop 非常好，我发现不需要从 CS2 更新，也不需要拍摄原始数据，我不必这样做。如果你在拍摄动作片，raw 是行不通的。您会以超乎想象的速度填满一张 8 gig 卡。我从不直接射击。我为什么要？ Raw 浪费时间和空间，即使您可以打开文件，它看起来也不比 JPG 好。相机都从原始数据开始，并使用相机中的硬件将这些数据转换为 JPG 图像。然后他们丢弃原始数据，因为它不再需要。\n保存这些原始数据就像人们将二十年的报纸堆放在房子周围一样。他们知道他们有时可能需要这些信息，但它确实会妨碍！其他人认为他们疯了。一些更高级的相机会保存这些原始数据，以便您以后可以使用软件来执行相机硬件所做的相同操作。软件需要更长的时间来完成相机硬件所做的相同事情，但让信心不足的人有机会在以后尝试修复错误。 JPG 和 raw 的图像质量相同。请参阅我的 D200 图像质量设置示例。另请参阅我对文件格式的解释。此页面引起争议，因为事实并不总是与聊天室中数码摄影新手传播的老太太的故事一致。我正在分享在数字成像领域连续三年全职带薪专业经验中收集到的对我有用的东西。此外，在我获得工程学位之前，我已经学习了十年的数字成像，并开始作为一名专业人士，与发明了这一切的数学博士们一起工作。读者对那些对我在下面分享的观察结果提出异议的人的回应在这里。如果您一天拍摄成百上千张图片，请拍摄 JPG，不要担心。几乎所有意图和目的的质量都与原始文件相同，原始文件将需要数 GB 或数十 GB 的时间来下载、转换、编目和刻录到备份 CD。事实上，如果你拍摄这么多，那么 JPG 可以提供更好的质量，因为尝试拍摄这么多原始照片会阻碍你的工作流程，并且当你的卡片填满时，你可能会完全错过制作一些图像。您总是会用完存储卡或等待访问指示灯停止闪烁的时间。如果你喜欢一张一张地调整你的图像并且一次拍摄不到一百张照片，那么 raw 可能适合你。事实上，如果您更喜欢可以从 raw 中获得的外观（在某些情况下它可能与 JPG 不同，具体取决于软件），您可以让您的计算机批量处理图像并将结果保存为 JPG。我几乎从不以原始格式拍摄任何东西，而且当我这样做时，无论如何我都浪费了所有努力，但我从来没有看到任何区别。 （如果我在我的电脑上把东西吹到 100% 或更大，我可以看到差异，但在打印时不会。）\n这就是它的全部内容。令人遗憾的是，有些人实际上对这一切感到如此兴奋，以至于他们建立了像以前一样的仇恨网站。这很可悲，因为我完全同意佩特里的 Pontifications。我认为他把那个仇恨页面移到了这里。对 JPG 或 raw 的偏好取决于您要尝试做什么。每种格式都没有绝对的优点；这完全取决于它们与您手头的特定工作的合适程度。每个人的需求都不一样，我只是更喜欢 JPG。话虽如此，这里更多的是我“通常的固执己见，暴躁的风格”。如果您了解上述基础​​知识，则可以安全地跳过它。 JPG（与 JPEG 相同）是普通的数码相机图像。相机根据您的设置（如锐度和白平衡）从原始图像传感器数据创建 JPG 图像。相机制作JPG，然后一旦记录JPG，原始数据就会蒸发。当心 JPEG 2000，它只能在某些高级软件中找到。这是一个更新的 JPG 版本，今天在静态摄影中已经被遗忘了。它与当前的 JPG 系统完全不兼容。 JPEG 2000 已在数字电影计划中得到应用，并将用作我们许多人或大多数人今天和不久的将来在影院观看的电影的标准。原始文件只是原始传感器数据。在进一步处理之前，它不是图片。大多数花哨的数码相机允许您保存原始数据而不是实际的 JPG 图片。如果这样做，您仍然需要在计算机中进行处理以制作您实际可以看到的图像（JPG 或其他格式）。相机在硬件中执行此处理的速度比计算机在软件中执行的速度要快得多。一些相机具有方便的原始 + JPG 模式，可同时保存原始数据和 JPG 图片。原始文件就像生橄榄：您需要先烹饪或以其他方式处理它们，然后才能使用它们。如果保持原始状态，它们也会很快变质，并且一旦加工成橄榄油或 JPG 之类的东西就可以永久保存。\n恐怖的恐怖，我听说最新的尼康软件甚至无法读取旧相机的 NEF，您需要加载旧软件才能读取它们。就像生鸡蛋一样，除非您将其处理成蛋清打印或 JPG 之类的东西，否则如果不进行处理，原始文件可能会变质。不是文件变坏了，愚蠢，而是未来软件读取它的潜在能力。由于原始数据对于每台相机都是完全唯一的，并且即使对于同一相机的不同固件版本也是不同的，因此即使不同的文件具有相同的后缀，如 .CRW 或 .NEF，原始数据也不是一种格式。原始文件本身不会坏。糟糕的是，在 10 年或 20 年之后，无论我们在使用何种类型的计算机上运行的任何软件，都可能无法打开一个被遗忘已久的 20 年专有文件。 JPG 是通用的。 Raw 专用于相机品牌和型号，甚至相机固件版本。如果没有可靠的制造商支持，您将无法再次使用原始文件。您能在今天的 Lotus Notes 或 PFS Write 或 Brother Style Writer 中找到一台计算机来打开 10 或 20 年前的文字处理文件吗？我不能；这就是为什么我尽可能将我的文件从这些程序转换为通用的 .TXT 格式。你相信佳能、尼康和 Adob​​e 支持 10 或 20 岁的相机吗？ 30 或 40 年前的相机怎么样？如果这样做，请继续将原始文件保留为原始文件。我将所有原始文件转换为 JPG 或 TIFF 进行存档。相机中的 JPG 处理可能比您稍后在软件中从原始数据中处理的更好。在“户外摄影师”杂志 2004 年 9 月号的第 25 页中，Rob Shepard 说“……当两者直接打开时，高质量的 JPEG 图像看起来远远优于原始文件。”相机从传感器传出的 12 位或更多原始数据创建其 JPG。您的对比度、白平衡、锐化和所有内容都会应用于相机内的原始数据，然后才将文件压缩并存储为 JPG。您将看不到额外的工件，因为这些都是在 JPG 转换之前完成的。\n使用原始文件显然需要更多的时间和耐心，就像重制豆子一样，因为您可以在相机中免费完成所有这些处理。如果由于某种原因您不确定要使用什么设置，您只想解决这个问题。原始数据，因为它包含所有内容，所以也占用了更多的空间，需要更多的时间来移动。这有点像拥有一辆可以运行的完整汽车 (JPG)，或者拥有一百万件仍需要组装才能驾驶它的科学项目（原始）。在拍摄原始文件后，您无法真正更改曝光度，尽管打开此数据的软件提供了重新缩放数据的选项并给人以更改曝光度的印象。您也可以从 JPG 中获得相同的合成照明，尽管只有原始图像才可以修正过度曝光。我从调整者那里得到了很多热量，因为我和其他摄影师一样，更喜欢在相机内进行调整并直接使用 JPG。其他人更喜欢以后花更多的时间来处理原始数据，但这不适合我。我用 JPG 获得了我需要的外观，并且更喜欢花时间制作更多照片。如果你是那种喜欢玩弄和重做的人，那么生吃绝对适合你。每个人的需求都不一样。对于许多爱好者来说，调整是乐趣的一部分，我不想破坏它。请不要认为我更喜欢第一次就拍对，而不是以后再调整。如果我需要纠正一个错误，我只需从 JPG 中完成。 JPG（与 JPEG 相同）是多产射手使用的标准。它提供了出色的质量，并为一切提供了最快的速度。它是地球上最流行和最兼容的图像格式。它尤其适用于数码相机最适合拍摄的内容，例如新闻、体育和活动。使用 JPG，您可以一次拍摄成百上千张图像，并且无需进一步处理即可发布文件。 JPG 处理得当，就像数码相机在设置为 NORMAL 或 FINE 时所做的那样，提供可以立即使用的出色效果。当然，您需要一台专业的数码相机来提供精确的相机内调整，例如微妙的白平衡控制和即时、轻松的访问，才能做到这一点。如果这些相机需要通过菜单进行调整或白平衡功能有限，那么专业人士会跳过许多让业余爱好者兴奋的相机。像 Karl Grobl 这样需要产生结果的专业记者拍摄 JPG。卡尔刚从亚洲为期两个月的一系列任务中归来。他带回了 20 GB 的 JPG，而这些只是保管者。 Karl 不再有时间在 Photoshop 中摆弄任何东西：如果图像在拍摄时不完美，它就会被删除。如果制作图像是你的生计，那么生命太短暂了，不能摆弄草率的图像。当然，如果摄影是你的爱好并且你觉得无聊很有趣，或者如果你在工作室里有时间燃烧，那么那就是另一回事了。卡尔有大量的图像，他需要接触大量的客户，然后他就开始下一个任务了。没有时间等待诸如原始文件处理之类的事情。我从他的 JPG 中看到了 Karl 的 20 x 30&quot; 照片，它们非常壮观。有时 raw 看起来与 JPG 不同，这取决于相机内使用的锐化算法 (JPG) 和不同版本的软件 (raw) 之间的差异。我找到每一个原始版本（Adobe Photoshop CS、Adobe Camera raw、相机制造商的版本、iView 等）在锐度、曲线和颜色方面对图像的处理略有不同，所以在你之后你永远不会真正有一个明确的外观已将文件打开并保存为标准 JPG、PSD 或 TIFF。您可能更喜欢其中一个。如果您不喜欢相机内选项，请拍摄未锐化的 JPG 并在其他地方锐化。同样，如果您设置错误白平衡或曝光不足，您可以稍后使用例如 Photoshop 的色阶、曲线和/或色彩平衡功能等进行校正。我在 Photoshop 的色阶或曲线命令中为深色 JPG 添加两档曝光没有问题。\n许多拍摄 raw 的人，我认为这是浪费时间，没有意识到即使是 JPG 也可以在 Photoshop 中调整白平衡。不，Photoshop 还没有一个“傻瓜”面板，实际上标有常见的白平衡绰号，但熟练的摄影师总是能够做到这一点。我更喜欢在色阶命令中使用“设置白点”和“设置中性灰色”滴管。请参阅此处了解如何操作。一些相机，如卡西欧 EX-Z750，也允许在拍摄后对白平衡和曝光的 JPG 进行校正。我通过在 ISO 200、ISO 800 下以 JPG 和原始格式拍摄场景，然后在 ISO 200 下两次曝光不足（将曝光补偿设置为 -2），对我的 D1H（您也可以）进行了刻意比较。现在有六枪。通过在打开时添加 +2 档来打开曝光不足的原始图像，并使用色阶或曲​​线对深色 JPG 进行校正。现在看看这两个和 ISO 800 下拍摄的照片。它们看起来几乎一样，如果你真的深入了解相机的信号处理和外部数学，你会意识到你正在对相同的数据做同样的事情;只是不同的进程在不同的地方执行这些相同的算法。当然，您如何使深色 JPG 变亮可能会改变图像的外观；我忘记了我最好用什么曲线来模拟添加两个停靠点。嘻嘻，我只拍了普通的 ISO 200 照片是为了表明从 ISO 200 推两档与直接在 ISO 800 下拍摄具有相同的颗粒感。实际上最好首先在 ISO 800 下拍摄，因为相机做得更好通过增加 CCD 放大器的模拟增益。此外，该室内/室外对比场景的最佳图像是通过使用曝光不足的图像（保留室外部分）并使用滤镜来减轻室内的黑暗。我从 JPG 和原始文件中得到了相同的结果。如果你是一个调整者，你会感兴趣学习 raw 和 JPG 也有相同的有效位精度。 JPG 每像素每种颜色有 8 位，而 raw 可能有 12 位，但这里有一个大问题：raw 是 12 位线性，JPG 是 8 位对数、伽马校正或其他一些从 12 位线性数据派生的非线性变换.因此，在这可能很重要的阴影中，两者是相同的，因为非线性编码保留了黑暗区域中的完整 12 位分辨率。即使这两种格式的暗分辨率不同，传感器噪声仍然大于 1 LSB，这使其成为一个有争议的问题。 Raw 是为那些打算一次花费大量时间处理一张图像的人设计的。对于这些应用，我使用大画幅 4x5&quot; 胶片来获得更好的质量，因此您明白我为什么不使用 raw。Raw 非常适合用数码相机拍摄风景的人，这不是数码相机的用途。不幸的是，这在业余爱好者中越来越流行，但请记住，业余爱好者的乐趣在于制作照片，而数码才是王道。个人而言，我专注于最终图像，大电影擅长。这可以解释我从中获得的所有热量业余爱好者，他们当然喜欢 raw 并在他们的数码单反上拍摄优胜美地，这与我所做的非常不同。Raw 也适用于在制作图像时尚未获得完美曝光的人，当然 JPEG 也允许这些调整。如果你能得到正确的图像，Raw 是不必要的乏味。Raw 总是需要额外的步骤来从相机处理成可用的格式，文件只能用非常特殊的软件打开，需要更多的时间来处理所有事情因此会减慢工作流程。实际上，raw 并不是任何一种标准格式：.CRW 或 .NEF 或任何文件实际上与每种型号的相机都非常不同，您需要不断更新转换软件才能从任何文件中读取文件你刚拿到的相机。我有来自尼康 D70 的高级样品的 NEF 文件，由于软件尚未发布，我无法打开。在专业领域，工作流程效率是等待批量转换完成与从事新的付费项目之间的区别。不管怎样，Raw 看起来和好的 JPG 一样。我承认，在 D70 上，默认锐化的差异在于，如果您在计算机上放大到 100%，原始图像看起来确实比 JPG 更清晰，但在 12 x 18&quot; 打印时我仍然看不到. 不要过分关注销售演示，其中展示了如何在关键的半光圈曝光过度的镜头中恢复高光细节。首先，没有人真的是演播室摄影师如此糟糕，以至于他们实际上会过度曝光一系列的工作室拍摄了半个停止而在数码相机上不知道的。这让我想起喜剧演员乔治卡林的台词，他认为人类可以做的最愚蠢的事情是在有工作的汽车中耗尽汽油电量计。你可以在相机的 LCD 上看到过度曝光。是的，如果你搞砸了，raw 可以很好地捕捉到最后半个停止，但这大约取决于你的相机可以纠正的范围。今天我发现这与之前不同尼康 D70 相机似乎提供了更多的捕捉能力h 失去了高光，我还没有看到，raw 所涉及的努力证明了最终图像的任何改进是合理的。尽管我可以看到改进，但我的女朋友仍然更喜欢 BASIC JPG 图像的 12 x 18&quot; 打印，而不是从原始文件制作的 12 x 18&quot; 打印，我花了一个小时校正所有级别和镜头失真和色度问题。这就是艺术！\n如果你打算花几个小时来处理单个镜头，或者有足够的时间像这样在聊天室里浪费时间，那么继续拍摄原始照片，记住将它们保存为标准化的东西，以便以后阅读。如果您现在需要大量精美图像，请直接拍摄标准 JPG。对于真实照片，RAW 看起来并不比 JPG 好。它只会占用空间，浪费您的时间，并冒着现在和将来都无法打开的风险。如果您只拍摄几十张图像并且想在 Photoshop 中处理每张图像，那么 Raw 是可以的；如果您每天需要成百上千的图像并在开始时将它们正确放入相机，那么 JPG 是最佳选择。从单个原始文件制作双重曝光合成的最新技巧实际上可以从 JPG 中完成；只需在 Photoshop 中打开 JPG（为高光曝光），然后将 LEVELS 或 CURVES 命令应用于表示阴影的图层。示例 1：我的一个朋友第一天带着他的 D1X 参加了一场跑步比赛。他不知道他会拍这么多，他的单张 256MB 卡很快就装满了。他不得不将相机设置为 SMALL 分辨率 (1,312 x 2,000) 和 BASIC JPG (256kB)，这样他才能继续拍摄。然后，他将其中一个图像文件授权给一家鞋履公司用于海报。印刷时看起来很棒，他获得了 1,200 美元用于临时使用该文件。 （不，他并没有以如此低的价格直接出售图像。）当然，他可以拍摄原始照片，但如果他这样做，他将完全错过镜头，因为他会失去记忆，根本没有任何图像而不是一个好看的。示例 2：昨天当每个人都在聊天室时，我花了一整天的时间来咨询价值 7,000,000 美元的房屋的拍摄。我们在佳能 1D 上拍摄了 raw + JPG，这样我的客户就会有两种文件供以后学习。从 1 Gig 闪存卡下载图像花了半个小时，......", "note_en": "JPG vs Raw:   Get it Right the First Time  © 2009 KenRockwell.com. All rights reserved.\n      I use  these stores. I can&#39;t vouch for  ads below.            A big problem in 2008 is that people are shooting raw and not knowing why. Raw requires dedicated software to read. If you just bought a new camera, you won&#39;t be able to open the files until you update your computer&#39;s software.\n  Worse, many new cameras come out a week before the camera maker&#39;s software is updated, and if you use software by Adobe, Apple or others, may have to wait weeks (or much longer) until there is an update. That means you may not be able to open your files today with your new camera if you didn&#39;t shoot JPG!\n  If you use Photoshop and Adobe Camera Raw, you just might have to buy the newest version of Photoshop, since Adobe doesn&#39;t update older versions to read the files from new cameras. Ha Ha! Photoshop is so good I&#39;ve seen no need to update from CS2, and not shooting raw, I don&#39;t have to.\n  If you&#39;re shooting action, raw doesn&#39;t work. You&#39;ll fill an 8 gig card faster than you can imagine.\n  I never shoot raw. Why would I? Raw is a waste of time and space, and doesn&#39;t look any better than JPG even when you can open the files.\n      Cameras all start with raw data and convert this data to JPG images with hardware in the camera. They then throw away the raw data since it&#39;s no longer needed.\n  Saving this raw data is  exactly like people who save twenty years of newspapers in piles around their house. They know they might need the information sometime, but it sure gets in the way! Other people think they are crazy.\n  Some fancier cameras save this raw data so you can use software to do the same thing the camera&#39;s hardware did, later. Software takes much longer to do the same thing the camera&#39;s hardware does, but gives less confident people the chance to try to fix mistakes later.\n  Image quality is the same in JPG and raw. See my  D200 Image Quality Setting Examples. See also my explanation of  File Formats.\n  This page generates controversy because fact doesn&#39;t always agree with old wives&#39; tales circulated by newcomers to digital photography in chat rooms. I&#39;m sharing what works for me gathered across three decades of continuous full-time paid professional experience in digital imaging. In addition I was studying digital imaging for ten years before I got my engineering degree and started as a professional working with the guys with Ph.Ds in mathematics who invented all this.\n  A reader&#39;s response to those who take issue with the observations I share below is  here.\n          If you shoot hundreds or thousands of images in a day shoot JPG and don&#39;t worry. The quality is the same for almost all intents and purposes as raw, and the raw files would take gigabytes or tens of gigabytes and resultant hours to download, convert, catalog and burn to backup CDs. In fact, if you shoot this much then JPG can give better quality since attempting to shoot this much raw will constipate your workflow and you could miss making some images entirely as your cards fill up. You&#39;d always be running out of memory cards or time waiting for the access light to stop blinking.\n  If you love to tweak your images one-by one and shoot less than about a hundred shots at a time than raw could be for you. In fact, if you prefer the look you can get from raw (it may be different from JPG in some cases depending on software) you can let your computer batch process images and save the results as JPGs, too. I almost never shoot anything in raw, and when I do I never see any difference for all the effort I wasted anyway. (I can see differences if I blow things up to 100% or bigger on my computer, but not in prints.)\n  That&#39;s about all there is to it. It&#39;s sad that some people actually get so excited by all this that they put up hate sites like one that used to be  here. It&#39;s sad because I completely agree with Petteri&#39;s Pontifications. I think he moved that hate  page here. One&#39;s preference for JPG or raw depends on what you&#39;re trying to do. Each format has no absolute goodness; it&#39;s all in how appropriate they are to your particular work at hand. Everyone&#39;s needs vary and I just happen to prefer JPG.\n  With that said, here&#39;s more in my &#34;usual opinionated, cranky style.&#34; If you understand the basics above you can safely skip it.\n      JPGs (same as  JPEGs) are normal digital camera images. Cameras create JPG images from raw image sensor data based on your settings like Sharpness and White Balance. The camera makes the JPG and then the raw data evaporates as soon as the JPG is recorded.\n  Beware  JPEG 2000 which you only find in some advanced software. It was a newer proposed version of JPG that has been forgotten today for still photography. It is COMPLETELY INCOMPATIBLE WITH the current JPG systems. JPEG 2000 has found application in the  Digital Cinema Initiative and will be used as their standard for the movies many or most of us will be seeing in theaters today and in the near future.\n      Raw files are just the raw sensor data. It isn&#39;t a picture until it is processed further. Most fancy digital cameras allow you to save the raw data instead of the actual JPG picture. If you do, you still have to do the processing in your computer to make an image (JPG or otherwise) that you actually can see. Cameras do this processing in hardware much faster than your computer can do it in software.\n  Some cameras have a handy raw + JPG mode which saves both the raw data and the JPG picture.\n  Raw files are just like raw olives: you need to cook or otherwise process them before you can use them. They also go bad fast if left in the raw state and can keep forever once processed to something like olive oil or JPGs.\n  Horror of horrors, I&#39;ve heard that the latest Nikon software can&#39;t even read the NEFs from older cameras and that you need to load older software to read them. Just like raw eggs, unless you process it into something like an egg-albumen print or a JPG, the raw files may go bad if left unprocessed.\n  It&#39;s not the file that goes bad, silly, it&#39;s the potential ability of future software to read it. Since raw data is entirely unique to each camera, and different even for different firmware revisions for the same camera, raw isn&#39;t even a format, even though the different files have the same suffix like .CRW or .NEF.\n  Raw files themselves don&#39;t go bad. What goes bad is that in 10 or 20 years, whatever software we&#39;re running on whatever sort of computer we&#39;ll be using may not be able to open a long-forgotten 20-year old proprietary file.\n  JPGs are universal. Raw is proprietary to camera make and model and even camera firmware version. Without solid manufacturer support you won&#39;t be able to use your raw files again.\n  Can you find a computer to open word processing files from 10 or 20 years ago today in Lotus Notes or PFS Write or Brother Style Writer? I can&#39;t; that&#39;s why I converted my files from these programs to the universal .TXT format back when I could. Do you trust Canon, Nikon and Adobe to support 10 or 20 year old cameras? How about 30 or 40 year old cameras? If you do, go ahead and leave your raw files as raw. I convert all my raw files to JPGs or TIFFs for archiving.\n  The JPG processing in the camera can be better than what you may be able to do later in software from raw. In the September 2004 issue of &#34;Outdoor Photographer&#34; magazine, page 25, Rob Shepard says &#34;...the high quality JPEG images looked far superior to the raw files when both were opened directly.&#34;\n  Cameras create their JPGs from the 12 bit or more raw data as it comes off the sensor. Your contrast, white balance, sharpening and everything are applied to the raw data in-camera, and only afterwards is the file compressed and stored as a JPG. You&#39;ll see no additional artifacts since that&#39;s all done before the JPG conversion.\n  Using raw files obviously takes a lot more time and patience, like  refrying beans, since you could have had all that processing done right in the camera for free. You only want to go through this trouble if for some reason you&#39;re unsure of what settings to use. The raw data, since it includes everything, also takes up a whole lot more space and takes more time to move around. It&#39;s sort of like either having a complete car that runs (JPG), or a science project in a million pieces that still needs assembly before you can drive it (raw). You can&#39;t really change exposure after a raw file is shot, although the software that opens this data gives one the option to rescale the data and give the impression of changing exposure. You can get this same synthetic lightening from JPGs, too, although only raw allows some ability to correct overexposure.\n  I take a lot of heat from tweakers because I, like other photographers, prefer to make my adjustments in-camera and use the JPGs directly. Others prefer to spend even more time later twiddling in raw, but that&#39;s not for me. I get the look I need with JPGs and prefer to spend my time making more photos. If you&#39;re the sort of person who likes to twiddle and redo than by all means raw is for you.\n  Everyone&#39;s needs vary. For many hobbyists tweaking is part of the fun and I don&#39;t want to spoil that. Please just don&#39;t take it personally that I prefer to get my shots right the first time instead of having to tweak them later. If I need to correct a goof I just do it from the JPGs.\n      JPG (same as  JPEG) is the standard used by prolific shooters. It gives great quality and offers the fastest speed for everything. It is the most popular and compatible image format on the planet. It is especially popular for the things for which digital cameras are best suited in the first place, like news, sports and events. With JPG you can shoot hundreds or thousands of images at a time and the files are ready for release with no further processing. JPGs done properly, as digital cameras do when set to NORMAL or FINE, give great results you can use immediately. Of course you need a professional digital camera that provides the exact in-camera adjustments, like subtle white balance control and immediate, easy access to them, to be able to do this. Pros skip many of the cameras that excite amateurs if those cameras require adjustments to be made through menus or have limited WB capabilities.\n  Professional journalists like  Karl Grobl who need to produce results shoot JPG. Karl just returned from a two month series of assignments in Asia. He brought back 20 Gigabytes of JPGs, and those were just the keepers. Karl no longer has the time to piddle with anything in Photoshop: if the image isn&#39;t perfect as shot it gets deleted. Life is too short to piddle with sloppy images if making images is what you do for a living. Of course if photography is your hobby and you find the piddling enjoyable or if you&#39;re in a studio with time to burn then that&#39;s another story. Karl has a ton of images he needs to get to a ton of clients, and then he&#39;s off on the next assignment. There is just no time to wait for things like raw file processing. I&#39;ve seen Karl&#39;s 20 x 30&#34; prints from his JPGs and they are spectacular.\n  Sometimes raw will look different from JPG depending on the differences between sharpening algorithms used in-camera (JPG) and in different versions of software (raw.) I find every raw opener (Adobe Photoshop CS, Adobe Camera raw, the camera maker&#39;s version, iView, etc.) processes the image a little bit differently in terms of sharpness, curves and colors, so you never really have a definitive look until after you&#39;ve opened and saved the file as a standard JPG, PSD or TIFF.\n  You may prefer one or the other. If you don&#39;t like the in-camera options, shoot unsharpened JPGs and sharpen elsewhere. Likewise, if you set the wrong white balance or underexposed you can always correct it later using, for instance, Photoshop&#39;s Levels, Curves and/or Color Balance features, among others. I have no problem adding two stops of exposure to a dark JPG in Photoshop&#39;s Levels or Curves command.\n  Many people who shoot raw, which I consider to be a big waste of time, don&#39;t realize that white balance can be adjusted in Photoshop even from JPGs. No, Photoshop doesn&#39;t yet have a &#34;dummies&#34; panel actually marked with common white balance monikers, but skilled photographers have always been able to do it. I prefer using the &#34;Set White Point&#34; and &#34;Set Neutral Gray&#34; eyedroppers in the Levels command. See  here for how to do it.\n  Some cameras, like the  Casio EX-Z750, allow correction of JPGs for White Balance and exposure after they&#39;ve been shot as well.\n  I&#39;ve made deliberate comparisons on my D1H (and so can you) by shooting a scene in both JPG and raw at ISO 200, ISO 800 and then underexposing two stops (set exposure compensation to -2) at ISO 200. There now are six shots. Open the underexposed raw by adding +2 stops while opening and apply correction to the dark JPG with Levels or Curves. Now look at these two vs. the shots made at ISO 800. They look pretty much the same, which if you really get into the camera&#39;s signal processing and external math you&#39;ll realize that you&#39;re doing the same thing to the same data; just the different processes are doing these identical algorithms in different places. Of course how you lighten the dark JPG will probably alter the look of the image; I forget what curves I used best to simulate adding two stops. Hee hee, I only made the normal ISO 200 shots to show that pushing two stops from ISO 200 gives the same grain as shooting directly at ISO 800. Actually it&#39;s better to shoot at ISO 800 in the first place since the camera does a better job by increasing the analog gain of the CCD amplifiers. Also the very best image of that indoor/outdoor contrasty scene was made by using the underexposed image (which retained the outdoor part) and using a filter to lighten the dark indoors. I got the same result from the JPG and raw files.\n  If you&#39;re a tweaker you&#39;d be interested to learn raw and JPG also have the same effective bit precision. JPG has 8 bits per color per pixel and raw may have 12 bits, but here&#39;s the big catch: raw is 12 bit linear, and JPG is 8 bit  log, gamma corrected or some other non-linear transform derived from the 12 bit linear data. Thus in the shadows where this might matter the two are the same, since the full 12 bit resolution in the dark areas is preserved by the non-linear coding. Even if the two formats differed in dark resolution the sensor noise is still greater than one  LSB anyway making it a moot point.\n      Raw is designed for people who intend to spend a lot of time twiddling with one image at a time. For these applications I use large format 4x5&#34; film instead for much better quality, thus you see why I don&#39;t use raw. Raw is very popular for people shooting landscapes with digital cameras, which is not what digital cameras are for. Unfortunately this is becoming popular among amateurs, but remember that for amateurs the fun is in making the photo, and for fun digital is king. Personally I focus on the final image, for which big film excels. This goes to explain all the heat I get from hobbyists, who of course love raw and shoot Yosemite on their digital SLRs which is very different from what I do. Raw is also for people who don&#39;t yet get perfect exposure right when they make the image, although of course JPEGs also allow these adjustments.\n  Raw is needlessly tedious if you can get the right image to begin with. Raw always requires extra steps to process from the camera into a usable format, the files can only be opened with very special software, requires far more time for everything and therefore slows workflows. In fact, raw is not any sort of a standard format: .CRW or .NEF or whatever files are actually very different from each model of camera, and you constantly need to be updating your conversion software just to be able to read files from whatever camera you just got. I had NEF files from an advance sample of a Nikon D70 I couldn&#39;t open since the software had not been released. In the professional arena workflow efficiency is the difference between waiting for a batch convert to complete and working on a new paying project. Raw looks the same anyway as a good JPG. I will admit that on the D70 the differences in default sharpening are such that the raw images do look sharper than the JPGs if you&#39;re looking zoomed in to 100% on a computer, but were still invisible to me in 12 x 18&#34; prints.\n  Don&#39;t pay too much attention to sales demos showing how you can restore details in highlights for a shot that was overexposed by a critical half stop. First off, no one really is so bad a studio photographer that they&#39;d actually overexpose a series of studio shots by a half a stop and not know it on a digital camera. That reminds me of comedian  George Carlin&#39;s line about he thinks that the stupidest thing a human being can do is to run out of gas in a car with a working gas gauge. You can see overexposure on the LCD of the digicam. Yes, raw is great to catch this last half a stop if you goofed, but that&#39;s about as far as it can correct depending on your camera. Today I find that unlike earlier cameras the Nikon D70 seems to offer a good deal more ability to catch lost highlights, which again I have yet to see that the efforts involved with raw justified any improvement in the final image. Even though I could see the improvement, my girlfriend still preferred the 12 x 18&#34; print of the BASIC JPG image to the 12 x 18&#34; print made from the raw file on which I spent an hour correcting all the levels and lens distortion and chromatic issues. Such is art!\n  If you intend to spend hours twiddling with individual shots or have enough time to waste piddling in chat rooms like  this then go ahead and shoot raw, just remember to save them as something standardized so you can read them later. If you need loads of great images  now then shoot straight to standard JPGs.\n  Raw looks no better than JPG for real photos. It just takes up space, wastes your time and runs the risk of not being able to be opened now and in the future. Raw is OK if you only shoot a few dozen images and you want to play around with each of them in Photoshop; JPG is best if you need hundreds or thousands of images each day and get them right in the camera to begin with. The latest trick of making dual-exposure composites from single raw files actually can be done just the same from a JPG; just open the JPG (exposed for the highlights) in Photoshop and apply the LEVELS or CURVES command to the layer representing your shadows.\n  Example 1 : a friend of mine on his first day out with his D1X shot a foot race. He had no idea he would shoot so much and his single 256MB card was filling up quickly. He had to set the camera down to SMALL resolution (1,312 x 2,000) and BASIC JPG (256kB) so he could keep shooting. He then licensed one of those image files to a shoe company for use on a poster. It looked great in print and he got $1,200 for the temporary use of the file. (No, he did not sell the image outright for such a low price.) Sure, he could have shot raw, but if he did he would have missed the shot completely since he would have been out of memory giving him  no image at all instead of a great looking one.\n  Example 2: While everyone was in chat rooms yesterday I spent the day consulting on a shoot of a $7,000,000 home. We shot raw + JPG on a Canon 1Ds so my client would have both kinds of files from which to learn afterwards. It took a half hour to download the images from the 1 Gig flash card, a\n......", "posttime": "2021-07-30 10:34:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jpg,raw", "title": "JPG vs. RAW：第一次做对（2009）", "title_en": "JPG vs. RAW: Get it right the first time (2009)", "transed": 1, "url": "https://www.kenrockwell.com/tech/raw.htm", "via": "", "real_tags": ["jpg", "raw"]}, {"category": "", "categoryclass": "", "imagename": "ac7de3d0bca852c8a7a2156d9ea553f9.jpg", "infoid": 1070562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用 Axios AM/PM 让您忙碌的日子变得更简单。在短短 5 分钟内了解新功能及其重要性。订阅 Axios Closer 以深入了解当天的商业新闻和趋势以及它们为何如此重要订阅 Axios Markets 以获取最新的市场趋势和经济见解。免费注册。通过 Axios Sports 尽情享受推动体育世界发展的统计数据和故事。免费注册。使用 Axios Login 从硅谷和 DC 获取我们对技术的明智看法。免费注册。通过 Axios Sneak Peek 获取新白宫的内幕指南。免费注册。通过 Axios Denver 获取影响您家乡的最重要故事的每日摘要\n通过 Axios Des Moines 获取影响您家乡的最重要故事的每日摘要 通过 Axios Twin Cities 获取影响您家乡的最重要故事的每日摘要 通过 Axios Tampa Bay 获取影响您家乡的最重要故事的每日摘要 获取与 Axios Charlotte 一起了解影响您家乡的最重要故事的每日摘要 及时了解由当地记者撰写的影响阿肯色州西北部的最重要和最有趣的故事 忘记家庭办公室 — 45% 的美国远程工作者经常在沙发上工作，根据家居装修营销公司 CraftJack 的一项研究，38% 的人经常在床上工作，20% 的人经常在外面工作。虽然一些工人已经能够花费数百甚至数千美元在家中建立工作站，但其他人却在大流行中挣扎。\n许多远程工作者，尤其是居住在城市的工作者，一直在与室友或家人共享的空间中工作，并且没有办公桌。虽然为远程工作人员配备装备的蓬勃发展的行业如雨后春笋般涌现，而且像 Dropbox 这样的科技公司也提供丰厚的 WFH 津贴，但大多数员工并没有那么幸运。根据数字：人们平均花费 268 美元来改善远程工作设置，但仍有 50% 的人表示在家工作的痛苦和不适足以让他们回到办公室。底线：Axios 的 Kia Kokalitcheva 指出，公司为远程工作人员提供津贴以购买符合人体工程学的椅子或办公桌是不够的。许多人根本就没有在家中分配用于办公室设置的空间，而且搬到更大的地方可能太昂贵了。方法：CraftJack 对 2021 年 6 月 16 日至 25 日期间完全或主要在家工作的 1,520 名美国人进行了调查。", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   Forget the home office — 45% of American teleworkers regularly work from a couch, 38% regularly work from bed and 20% often work outside, according to  a study by the home improvement marketing firm CraftJack.\n  While some workers have been able to spend hundreds — or even thousands — of dollars setting up work stations in their homes, others have struggled through the pandemic.\n Many remote workers, especially those living in cities, have been working in shared spaces with roommates or family members and working without desks.\n While a thriving sector for  outfitting remote workers has sprung up, and tech companies like Dropbox are offering lavish WFH stipends, most employees aren&#39;t so lucky.\n By the numbers: People have spent an average of $268 trying to improve their remote work setups, but a whopping 50% still say the pain and discomfort of working from home is enough to send them back to the office.\n The bottom line: It&#39;s not enough for companies to provide stipends for teleworkers to buy ergonomic chairs or desks, Axios&#39; Kia Kokalitcheva notes. Many people simply do not have the space allocated inside their homes for an office setup, and it can be too expensive to move to a bigger place.\n Methodology: CraftJack surveyed 1,520 Americans who worked entirely or primarily from home between June 16 – 25, 2021.", "posttime": "2021-07-30 10:34:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,工作者,workers,axios", "title": "每日统计：38% 的远程工作者在床上工作", "title_en": "Stat of the day: 38% of remote workers work from bed", "transed": 1, "url": "https://www.axios.com/38-percent-remote-workers-work-bed-f8708125-a068-47ff-9519-bb7870011cd5.html", "via": "", "real_tags": ["远程工作", "工作者", "workers", "axios"]}, {"category": "", "categoryclass": "", "imagename": "d7ca370df31565a4d1deb63c5ad65506.jpg", "infoid": 1070561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的 C 轮融资 2.05 亿美元，由 Vy Capital 领投，Google Ventures、DFJ Growth、Valor Equity Partners、Craft Ventures、Founders Fund 和 Gigafund 跟投。我们也很高兴地宣布，一批在具有战略意义的领域的领先高管和企业家也加入了这一轮，包括 Robert Nelson（ARCH Venture Partners 的联合创始人）、Blake Byers（Byers Capital）、Sam Altman（董事会主席）。 YC Group 和 OpenAI 首席执行官）、Fred Ehrsam（Paradigm 和 Coinbase 的联合创始人）和 Ken Howery（PayPal 和 Founders Fund 的联合创始人）。 Neuralink 在过去四年中一直在构建第一个用于患者治疗的高通道数脑机接口。我们的第一款产品 N1 Link 是一种 1024 通道设备，一旦植入，它就完全不可见，并通过无线连接传输数据。该设备的第一个迹象是通过允许用户以高带宽和自然的方式与他们的计算机或手机交互，帮助四肢瘫痪者重新获得数字自由。本轮融资将用于将 Neuralink 的第一个产品推向市场，并加速未来产品的研发。 Neuralink 由埃隆·马斯克 (Elon Musk) 创立，旨在在短期内帮助脑损伤患者，并在长期内降低人工智能对人类的风险。该公司的使命是开发治疗各种大脑相关疾病的脑机接口，最终目标是创建一个能够更紧密地连接生物和人工智能的全脑接口。", "note_en": "Our Series C funding round of $205 million, led by Vy Capital, with participation from Google Ventures, DFJ Growth, Valor Equity Partners, Craft Ventures, Founders Fund, and Gigafund.\n  We are also happy to share that a group of leading executives and entrepreneurs in areas of strategic importance are also joining the round, including Robert Nelson (Co-Founder of ARCH Venture Partners), Blake Byers (Byers Capital), Sam Altman (Chairman of YC Group and CEO of OpenAI), Fred Ehrsam (Co-founder of Paradigm and Coinbase) and Ken Howery (Co-Founder of PayPal and Founders Fund).\n  Neuralink has spent the last four years building the first high channel count brain machine interface intended for therapeutic use in patients. Our first product, the N1 Link, is a 1024 channel device that, once implanted, is completely invisible and transmits data via a wireless connection. The first indication this device is intended for is to help quadriplegics regain their digital freedom by allowing users to interact with their computers or phones in a high bandwidth and naturalistic way. The funds from the round will be used to take Neuralink’s first product to market and accelerate the research and development of future products.\n  Neuralink was founded by Elon Musk to help those with brain injuries in the near term and reduce AI risk to humanity in the long term. The company’s mission is to develop brain-machine interfaces that treat various brain related ailments, with the eventual goal of creating a whole brain interface capable of more closely connecting biological and artificial intelligence.", "posttime": "2021-07-30 10:34:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "融资,funding,人工智能", "title": "C轮融资公告", "title_en": "Series C funding round announcement", "transed": 1, "url": "https://neuralink.com/blog/series-c", "via": "", "real_tags": ["融资", "funding", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "a25e410ad3c69d97df37de267551bb03.jpeg", "infoid": 1070560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（彭博社）——Robinhood Markets Inc. 希望通过首次公开募股创造历史，现在它已经——出于错误的原因。在该公司的第一个交易日，这家支持模因股票革命的经纪人的股价比 IPO 价格下跌了 8.4%。根据彭博汇编的数据，这是有记录以来在筹集到与 Robinhood 一样多的现金的 51 家美国公司中最糟糕的首次亮相。它取代了另一家券商 MF Global Holdings Ltd. 的 2007 年首次公开募股，成为符合条件的公司中最糟糕的首次公开募股。 MF Global 首日下跌 8.2%。 Robinhood 以 38 美元的首次公开募股价格开盘。对于 Robinhood 规模及更大规模的 IPO，这是自 2019 年 5 月优步科技公司以来美国公司中最弱的开盘交易。优步首日收盘下跌 7.6%。", "note_en": "(Bloomberg) -- Robinhood Markets Inc. wanted to make history with its initial public offering, and now it has -- for the wrong reason.\n Shares in the broker behind the meme-stock revolution fell 8.4% below the IPO price in the company’s first trading session. That’s the worst debut on record among 51 U.S. firms that raised as much cash as Robinhood or more, according to data compiled by Bloomberg.\n It dethroned the 2007 IPO by another brokerage, MF Global Holdings Ltd., as the worst debut among qualifying firms. MF Global ended its first day down 8.2%.\n   Robinhood opened at the $38 initial public offering price. For an IPO of Robinhood’s size and larger, that’s the weakest opening trade since Uber Technologies Inc. in May of 2019 among U.S. firms. Uber finished its debut session down 7.6%.", "posttime": "2021-07-30 10:33:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "robinhood,worst", "title": "Robinhood 有史以来最糟糕的首次公开募股", "title_en": "Robinhood Has the Worst Debut Ever for IPO of Its Size", "transed": 1, "url": "https://finance.yahoo.com/news/robinhood-flirts-worst-debut-ever-172454124.html", "via": "", "real_tags": ["robinhood", "worst"]}, {"category": "", "categoryclass": "", "imagename": "c37fd4345be434b9d7bbb4819558bcfb.png", "infoid": 1070558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "&lt;ruby&gt; HTML 元素表示在基础文本上方、下方或旁边呈现的小注释，通常用于显示东亚字符的发音。它也可以用于注释其他类型的文本，但这种用法不太常见。术语 ruby​​ 起源于排字机使用的一种度量单位，表示文本可以在新闻纸上打印同时保持清晰的最小尺寸。", "note_en": "The   &lt;ruby&gt;  HTML element represents small annotations that are rendered above, below, or next to base text, usually used for showing the pronunciation of East Asian characters. It can also be used for annotating other kinds of text, but this usage is less common.\n The term  ruby originated as  a unit of measurement used by typesetters, representing the smallest size that text can be printed on newsprint while remaining legible.", "posttime": "2021-07-30 10:30:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,html,表示", "title": "ruby - 文本上方注释的 HTML 元素", "title_en": "ruby - HTML element for annotations above the text", "transed": 1, "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ruby", "via": "", "real_tags": ["ruby", "html", "表示"]}, {"category": "", "categoryclass": "", "imagename": "856570d7fd77e40e50ef18588bfbe0df.jpeg", "infoid": 1070557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "On the Clock 是 Motherboard 对有组织的劳工运动、零工工作、自动化和工作的未来的报告。 7 月 31 日，外卖应用程序 DoorDash 的零工工人将拒绝在当天工作，这似乎是 DoorDash 历史上的第一次协同罢工。零工工人要求平台在他们同意交付订单之前向他们展示他们的技巧，并为每个订单制定至少 4.50 美元的基本工资。 （基本工资是司机在给小费之前的订单中赚取的金额。由于最近的减薪，许多司机在小费前的收入低至 2.00 美元）。 “没有 DASHER = 没有交付 = DOORDASH 的巨大损失，”关于在 Reddit 上流传的罢工的帖子说。罢工不隶属于任何组织，但最近几天 Reddit 和 Facebook 上的数百名 Dashers 讨论了罢工，并分发了一张图片和要求清单。主板收到了七名计划罢工的司机的消息，还有更多人表示他们将参加，因为他们已经看到基本工资下降，并希望在接受订单之前能够看到他们的小费。 “我很震惊，因为他们在这里将基本工资从 3 美元降低到 2.50 美元，而且随着汽油的增加，很难赚钱，”堪萨斯州欧弗兰帕克的一名司机告诉主板。 “没有小费，我们什么也做不了。” DoorDash 罢工的呼吁发生在特殊情况下。 7 月初，DoorDash 重新编写了自己的代码以关闭 Para，这是一个第三方应用程序，允许零工工人在接受送货订单之前查看他们的小费金额。 Para 由 Uber 的前运营和物流经理开发，它透露了包含在 DoorDash 代码中的小费信息，但并未向送货司机显示。\n司机会同时登录这两个应用程序，向 Para 提供他们的 DoorDash 登录凭据。当 DoorDash 向司机提供送货单时，来自 Para 应用程序的通知会下拉通知司机与该订单相关的小费金额。 （如果没有 Para，DoorDash 只会在司机完成交付前向他们显示他们的估计收入金额。）UberEats 也对司机隐藏了小费金额，但 Para 无法在他们的代码中找到小费金额。一夜之间，Para 应用炸了。根据一名 Para 员工提供的截图，截至 7 月 24 日，它已在苹果应用商店下载约 20 万次，在 Google Play 商店下载约 5 万次。 Para 目前在 App Store 中的商业应用程序中排名第 40。在数百条在线评论中，DoorDash 工作人员称赞 Para 允许他们访问他们的提示。 “我喜欢这个应用程序，”一位 Dasher 在 5 月份写道。 “它预先告诉你你会赚多少钱，所以它不需要在长途旅行中赌博。它帮助我赚了更多的钱，这太棒了。”但在 7 月中旬，帕拉停止了工作。 Bridgit 是新泽西州 Tom&#39;s Creek 的 DoorDash 司机，有三个孩子，她在 3 月份注册了 DoorDash，特别是因为她希望在使用 Para 应用程序接受订单之前能够看到她的小费金额。 “我阅读了一些论坛，每个人都在谈论 Para。”她告诉主板，由于失去了 Para 提供的提示透明度，她将在 7 月 31 日罢工。 “我会说，当帕拉停止工作时，很多工人都醒了，”她说。 “Para 表明 DoorDash 并不像它应有的那样透明。我认为 DoorDash 隐藏订单提示是荒谬的。没有提示是很常见的。”虽然一些司机在失去 Para 提供的小费透明度后被迫罢工，但其他司机主要是因为 DoorDash 的基本工资很低。根据 DoorDash 的说法，订单的基本工资范围从 2 美元到 20 美元不等，但司机们表示，工资通常较低。今年 2 月，DoorDash 司机发起了一场名为#DECLINENOW 的抗议活动，以玩弄 DoorDash 的算法，并通过拒绝低于 5 美元的订单来推高基本工资。 DoorDash 被指控盗窃小费、数据泄露、低于最低工资标准。 “DoorDash 很自豪能够为 Dashers 提供灵活、低门槛的创收机会，同时帮助餐厅发展业务。在全国范围内，Dashers 平均每周工作不到 4 小时，在送货时每小时收入超过 25 美元，包括 100% 的小费，”DoorDash 的一位女发言人在回应罢工消息时告诉 Motherboard。\n总体而言，零工经济因使用“黑盒算法”而臭名昭著，这些算法将有关工资、小费和订单的关键信息对零工工人隐藏，通常对工人不利。在 DoorDash 的当前模型下，工作人员无法知道订单是否附有 50 美分或 50 美元的小费，即使 DoorDash 在分配该订单时知道。司机们说这会造成困难，因为他们的收入大部分来自小费，而且他们经常被迫赌需要行驶 20 英里的订单会有值得的小费。司机说，在事先不知道小费的情况下接受订单可能会导致在考虑汽油成本后的负收益。许多客户实际上会给小费，或者根本不给小费。另一方面，DoorDash 司机还表示，Para 允许司机利用所谓的“独角兽”，订单的小费有时是基本工资的 300%。换句话说，司机可能会拒绝 15 美元的订单，因为他们希望得到 2 美元的小费，而没有意识到附加了 50 美元的小费。 “帕拉停止工作，这肯定影响了我罢工的决定，”德克萨斯州高地村/花丘的 DoorDash 司机米兰达·阿什利说。 “我认为 DoorDash 应该是 100% 透明的，所有的支出都应该是透明的，因为它直接影响我们是否会接受订单。当 DD 隐藏小费信息时，只会导致 Dashers 拒绝订单，客户等待时间更长，并且甚至可能是冷食。” DoorDash 的一位发言人告诉 Motherboard，Para 违反了其服务条款，但没有回答有关重写其代码的问题。 “Para 通过未经 DoorDash 平台授权抓取内容来收集其信息。这令人深感担忧，因为我们致力于保护我们市场和利益相关者各方的隐私和数据安全，”他们说。 DoorDash 的服务条款规定，“您将仅将软件和服务用于您自己的用途，不得直接或间接转售、许可或转让软件、服务或服务显示的内容给第三方。” “在几个月内，近 200,000 名 DoorDash 司机注册了 Para，以便在接受旅行之前了解他们的全部收入潜力，”Para 创始人 David Pickerell 和 Jeffrey Tang 在一份声明中告诉 Motherboard。 “DoorDash 所依赖的劳动力要求更高的透明度，以及决定他们从这些零工平台接受什么样的工作的自主权。我们希望 DoorDash 在这里做正确的事，并为司机提供工具他们需要就自己的工作和生计做出明智的决定。”\n科罗拉多州丹佛市的另一名 Para 员工和 DoorDash 司机史蒂夫约翰逊告诉主板，在 7 月中旬，DoorDash 重写了其软件，有效地删除了 Para。 Johnson 认为，作为独立承包商，DoorDash 的司机应该可以在每个订单中获得全额小费，并可以自由使用任何可用的工具来增加收入。 “我们试图让你有信息来决定是否接受订单，”Para 员工史蒂夫约翰逊说。 “这是我们作为独立承包商的权利。他们应该让我们完全透明。”约翰逊说，通过有效地删除 Para 并重写他们的代码，DoorDash 否认其零工工人享有公司宣传的独立承包商权利，从而自相矛盾。去年，DoorDash、优步、Lyft 和 Instacart 花费了 2.04 亿美元，以将他们的零工工人归类为加利福尼亚的独立承包商。零工经济中的罢工很难真正损害公司的底线，因为零工工人被社会孤立，分布在全国各地，无法组建工会。 Instacart 此前曾声称，由其工人于 2020 年 3 月发起的全国性罢工“完全没有影响”。一些 DoorDash 零工工人表示，他们将在周六的罢工中工作，因为他们认为罢工没有足够的工人支持来伤害 DoorDash。", "note_en": "On the Clock is Motherboard&#39;s reporting on the organized labor movement, gig work, automation, and the future of work.\n  On July 31, gig workers on the food delivery app DoorDash will refuse to work for the day in what appears to be the first coordinated strike in DoorDash history.\n  Gig workers are demanding that the platform show them their tips before they agree to deliver an order and institute a base pay of at least $4.50 per order. (Base pay is the amount drivers earn on an order before tips. Thanks to recent pay cuts, many drivers earn as little as $2.00 before tips).\n    &#34;NO DASHER = NO DELIVERIES = MASSIVE LOSS FOR DOORDASH,&#34;   a post about the strike circulating on Reddit says.\n  The strike isn&#39;t affiliated with any organization, but hundreds of Dashers on Reddit and Facebook have discussed the strike in recent days, and circulated   a graphic and   list of demands. Motherboard heard from seven drivers who plan to strike, and many more have stated they will participate because they&#39;ve seen their base pay drop and want to be able to see their tips before they accept orders.\n  &#34;I&#39;m striking because they lowered the base pay from $3 to $2.50 here, and with gas increases, it’s hard to make any money,&#34; a driver in Overland Park, Kansas told Motherboard. &#34;Without tips we’re not making anything.&#34;\n  The call for a DoorDash strike occurs under peculiar circumstances. In early July, DoorDash rewrote its own code to cut off Para, a third-party app that allowed gig workers to see their tip amounts before they accepted a delivery order. Developed by a former operations and logistics manager at Uber, Para revealed tip information that&#39;s included in DoorDash&#39;s code but is not surfaced for delivery drivers.\n    Drivers would log in to both apps at once, providing Para with their DoorDash login credentials. When DoorDash offered drivers a delivery order, a notification from the Para app would drop down informing drivers of the tip amount associated with that order. (Without Para, DoorDash only shows drivers the estimated amount on their earnings before they complete the delivery.) UberEats also hides the tip amount from drivers, but Para was unable to find tip amounts in their code.\n  Overnight, the Para app blew up. As of July 24, it has been downloaded roughly 200,000 times in Apple&#39;s App Store and 50,000 times in the Google Play store, according to a screenshot provided by a Para employee. Para currently sits at #40 among business apps in the App Store. In hundreds of reviews online, DoorDash gig workers praise Para for allowing them to access their tips.\n  &#34;I love this app,&#34; one Dasher wrote in May. &#34;It shows you up front how much you will be making so it takes the guesswork out of gambling on longer mileage trips. It&#39;s helped me make more money and it&#39;s amazing.&#34;\n  But in mid-July, Para stopped working. Bridgit, a DoorDash driver in Tom&#39;s Creek, New Jersey with three kids, signed up for DoorDash in March, specifically because she expected to be able to see her tip amount before accepting an order using the Para app. &#34;I read some forums and everyone was talking about Para.&#34;\n  She told Motherboard that she&#39;s striking on July 31 because of losing the tip transparency offered on Para. &#34;I would say a lot of workers woke up when Para stopped working,&#34; she said. &#34;Para showed that DoorDash is not as transparent as it could be. I think it&#39;s ridiculous that DoorDash hides tips for orders. It&#39;s very common to get no tips.&#34;\n    While some drivers are being propelled to strike after losing the tip transparency offered by Para, others are mostly motivated by DoorDash&#39;s poor base pay. Base pay ranges on orders ranges from $2 to $20, according to DoorDash, but drivers say pay is often on the lower end. In February,   DoorDash drivers launched a protest campaign called #DECLINENOW to game DoorDash&#39;s algorithm and push up base pay by declining orders under $5. DoorDash has been accused of   rampant tip theft,   data breaches,   sub-minimum wage pay.\n  “DoorDash is proud to provide flexible, low-barrier earning opportunities for Dashers while helping restaurants grow their businesses. On average nationally, Dashers work fewer than four hours a week and earn over $25 an hour while they’re on a delivery, including 100 percent of their tips,&#34; a spokeswoman from DoorDash told Motherboard, in response to news of the strike.\n    Across the board, the gig economy is notorious for using &#39;blackbox algorithms&#39; that keep crucial information about wages, tips, and orders hidden from gig workers, often to the disadvantage of workers. Under DoorDash&#39;s current model, workers have no way to know whether an order has 50 cents or a $50 tip attached, even though DoorDash is aware when it assigns that order.\n  Drivers say this creates hardship because the vast majority of their earnings come from tips, and they&#39;re often forced to gamble that orders that require driving 20 miles will have a worthwhile tip. Accepting an order without knowing the tip beforehand can result in negative earnings after accounting for the cost of gas, drivers say. Many customers literally tip pennies, or nothing at all.\n  On the other end of the spectrum, DoorDash drivers also say that Para allowed drivers to take advantage of so-called &#34;unicorns,&#34; orders with giant tips that are sometimes 300 percent of the base pay. In other words, a driver might decline a $15 dollar order because they expect a $2 tip, without realizing that there&#39;s a $50 tip attached.\n  &#34;Para stopped working, and that&#39;s definitely influenced my decision to strike,&#34; said Miranda Ashley, a DoorDash driver in Highland Village/Flower Mound, Texas. &#34;I believe DoorDash should be 100% transparent with the full payouts, as it directly affects whether or not we will accept an order. When DD hides tip information, it only causes Dashers to decline orders and customers to have much longer wait times, and possibly even cold food.&#34;\n    A spokesperson for DoorDash told Motherboard that Para violated its terms of service, but did not respond to a question about rewriting its code. &#34;Para collects its information by scraping content without authorization from the DoorDash platform. This is deeply concerning as we are committed to protecting the privacy and data security of every side of our marketplace and stakeholders,&#34; they said.\n  DoorDash&#39;s terms of service say, &#34;You will use the Software and Services only for your own use and will not directly or indirectly resell, license or transfer the Software, Services or content displayed by the Services to a third party.”\n  “In a matter of months, nearly 200,000 DoorDash drivers signed up for Para in order to understand their full earning potential before accepting trips,&#34; Para founders David Pickerell and Jeffrey Tang told Motherboard in a statement. &#34;The very people whose labor DoorDash depends on are demanding more transparency, as well as the autonomy to make decisions about what kind of work they accept from these gig platforms. We hope DoorDash will do the right thing here, and provide drivers with the tools they need to make informed decisions about their work and livelihoods.”\n  Steve Johnson, another Para employee and a DoorDash driver in Denver, Colorado, told Motherboard that in mid-July, DoorDash rewrote its software, effectively cutting out Para.\n  Johnson believes that as independent contractors, DoorDash&#39;s drivers should have access to full tip amounts with every order, and the freedom to use any tools at their disposal to increase their earnings. &#34;We were trying to make it so that you have the information to decide if you want to accept an order,&#34; Steve Johnson, the Para employee, said. &#34;That’s our right as independent contractors. They’re supposed to allow us full transparency.&#34;\n  Johnson says that by effectively cutting out Para and rewriting their code, DoorDash is contradicting itself by denying its gig workers the independent contractor rights that the company has advertised. Last year, DoorDash, Uber, Lyft, and Instacart   spent $204 million fighting to keep their gig workers classified as independent contractors in California.\n  It&#39;s hard for strikes in the gig economy to actually hurt a company&#39;s bottom line, because gig workers are socially isolated, spread out across the country, and cannot form unions. Instacart has previously claimed that a nationwide strike led by its workers in March 2020   had &#34;absolutely no impact.&#34; Some DoorDash gig workers say they&#39;ll be working through the strike on Saturday because they don&#39;t think the strike has enough buy-in from workers to harm DoorDash.", "posttime": "2021-07-30 09:52:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "deliveries,doordash", "title": "“没有 DASHER = 没有交付：”DoorDash 司机罢工以提高提示透明度", "title_en": "'NO DASHER = NO DELIVERIES:' DoorDash Drivers Strike for Tip Transparency", "transed": 1, "url": "https://www.vice.com/en/article/pkbvgz/no-dasher-no-deliveries-doordash-drivers-strike-for-tip-transparency", "via": "", "real_tags": ["doordash"]}, {"category": "", "categoryclass": "", "imagename": "f525410694c2698bb8b1d8694d5dab0c.jpg", "infoid": 1070556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界墨西哥城（美联社）——墨西哥最高安全官员周三表示，前两届政府花费 6100 万美元购买 Pegasus 间谍软件，该软件与政府监视世界各地的对手和记者有关。公共安全部长 Rosa Icela Rodríguez 表示，已发现 2006-2012 年总统 Felipe Calderón 和 2012-18 年总统 Enrique Peña Nieto 执政期间签署的 31 份合同的记录。一些合同可能伪装成购买其他设备。政府表示，与以色列间谍软件公司 NSO Group 的许多合同都是与幌子公司签订的，这些公司在墨西哥经常被用来提供回扣或避税。上周，政府最高反洗钱调查员表示，前两届政府的官员已花费约 3 亿美元的政府资金购买间谍软件。但该数字可能反映了所有间谍软件和监控采购，或者可能包括尚未确定的合同。墨西哥金融情报部门负责人圣地亚哥·涅托 (Santiago Nieto) 表示，Pegasus 间谍软件等项目的账单似乎包括超额付款，这些款项可能已作为回扣转回给政府官员。涅托说，支付的金额和支付方式表明，政府在一项已经有问题的电话窃听计划中存在腐败，该计划针对记者、活动家和反对派人士，当时包括现任总统安德烈斯·曼努埃尔·洛佩斯·奥夫拉多尔及其核心圈子。 “这意味着或至少假定存在腐败行为，在 2012 年至 2018 年期间以高价向政府出售（间谍软件），”涅托说。\n洛佩斯·奥夫拉多尔 (López Obrador) 于 2018 年 12 月 1 日上任，并发誓永远不会使用间谍软件。涅托表示，现任政府没有发现任何交易。据报道，在 NSO 客户选择进行潜在监视的数千个电话号码中，墨西哥的名单最多——大约有 700 个电话号码。", "note_en": "World        MEXICO CITY (AP) — Mexico’s top security official said Wednesday that two previous administrations spent $61 million to buy Pegasus spyware that has been implicated in government surveillance of opponents and journalists around the world.\n Public Safety Secretary Rosa Icela Rodríguez said records had been found of 31 contracts signed during the administrations of President Felipe Calderón in 2006-2012 and President Enrique Peña Nieto in 2012-18. Some contracts may have been disguised as purchases of other equipment.\n The government said many of the contracts with the Israeli spyware firm NSO Group were signed with front companies, which are often used in Mexico to facilitate kickbacks or avoid taxes.\n Last week, the government’s top anti-money laundering investigator said officials from the two previous administrations had spent about $300 million in government money to purchase spyware. But that figure may reflect all spyware and surveillance purchases, or may include yet-unidentified contracts.\n Santiago Nieto, the head of Mexico’s Financial Intelligence Unit, said the bills for programs like the Pegasus spyware appear to have included excess payments that may have been channeled back to government officials as kickbacks.\n Nieto said the amounts paid, and the way they were paid, suggested government corruption in an already questionable telephone tapping program that targeted journalists, activists and opposition figures, who at the time included now President Andrés Manuel López Obrador and his inner circle.\n “This implies or at least presumes the existence of acts of corruption, by selling (the spyware) at inflated prices to the government between the years 2012 and 2018,” Nieto said.\n López Obrador took office on Dec. 1, 2018, and vowed never to use spyware. Nieto said no transactions had been detected in the current administration.\n Mexico had the largest list — about 700 phone numbers — among the thousands reportedly selected by NSO clients for potential surveillance.", "posttime": "2021-07-30 09:44:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,间谍,officials,政府", "title": "墨西哥称官员在 Pegasus 间谍软件上花费了 6100 万美元", "title_en": "Mexico Says Officials Spent $61 Million On Pegasus Spyware", "transed": 1, "url": "https://www.pbs.org/newshour/world/mexico-says-officials-spent-61-million-on-pegasus-spyware", "via": "", "real_tags": ["软件", "间谍", "officials", "政府"]}, {"category": "", "categoryclass": "", "imagename": "02e936efa5e2cb2557b2886d50feb717.jpg", "infoid": 1070555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "爱沙尼亚官员表示，他们上周逮捕了一名当地嫌疑人，该嫌疑人利用漏洞访问政府数据库并下载 286,438 名爱沙尼亚人的政府身份证照片。袭击发生在本月早些时候，嫌疑人于上周 7 月 23 日被捕，爱沙尼亚警方在昨天，即 7 月 28 日的新闻发布会上说。袭击者的身份没有透露，他只被确认为塔林人。男性。官员们表示，嫌疑人在信息系统管理局 (RIA) 管理的数据库中发现了一个漏洞，RIA 是管理该国 IT 系统的爱沙尼亚政府机构。在昨天发布的常见问题解答页面中，RIA 表示其数据库通常会在返回查询以显示用户的政府 ID 照片之前检查五个不同的子系统。 “嫌疑人在 RIA 的一个应用程序中发现了一个安全漏洞，该漏洞没有充分检查查询的有效性，”RIA 昨天表示。为了利用该漏洞，RIA 表示攻击者必须提供爱沙尼亚公民的姓名以及他们正确的个人识别码。\n根据国家刑警网络犯罪局局长奥斯卡·格罗斯的说法，这些信息是在上周搜查房屋时在嫌疑人的电脑上发现的，以及下载的照片。官员们表示，他们不相信嫌疑人将被盗照片转移给另一方，但调查仍在调查此事。 RIA 表示，它修补了其数据库并进行了验证，以查看其其他系统是否受到相同错误的影响。该机构表示，它现在正在通过电子邮件将事件通知所有受影响的爱沙尼亚公民。该事件被认为不足以要求个人拍摄新照片并更改其身份证件。 7 月 21 日 – RIA 通过额外监控检测到从身份文件数据库 (KMAIS) 中大量下载数据并关闭服务。 7 月 22 日 - RIA 追踪可能用于下载照片的 IP 地址并将信息转发给警方。 7 月 22 日——RIA 启动了一项内部调查，以确定可能操纵图像存储系统控制机制的原因。\n7 月 23 日——警方逮捕涉嫌下载数据的男子并执行初步程序。 7 月 23 日——RIA 重新开放了固定图像系统，该系统再次允许人们下载他们的文档照片。 7 月 23 日至 27 日——RIA 还调查了在其他服务中使用类似攻击向量的可能性。", "note_en": "Estonian officials said they arrested last week a local suspect who used a vulnerability to gain access to a government database and download government ID photos for 286,438 Estonians.\n The attack took place earlier this month, and the suspect was arrested last week on July 23, Estonian police said in a press conference yesterday, July 28.\n The identity of the attacker was not disclosed, and he was only identified as a Tallinn-based male.\n  Officials said the suspect discovered a vulnerability in a database managed by the Information System Authority (RIA), the Estonian government agency which manages the country’s IT systems.\n In a  FAQ page published yesterday, RIA said its database usually checked with five different subsystems before returning a query to display a user’s government ID photo.\n “The suspect discovered a security vulnerability in one of RIA’s applications that did not sufficiently check the validity of the query,” RIA said yesterday.\n To exploit the vulnerability, RIA said the attacker had to provide the name of an Estonian citizen, along with their correct personal identification code.\n According to Oskar Gross, Head of the Cybercrime Bureau of the National Criminal Police, this information was discovered on the suspect’s computer during a house search last week, along with the downloaded photos.\n  Officials said they don’t believe the suspect transferred the stolen photos to another party but that an investigation is still looking into the matter.\n RIA said it patched its database and verified to see if other of its systems are affected by the same bug.\n The agency said it is now notifying all the affected Estonian citizens via email about the incident. The incident was not considered severe enough to ask individuals to take new photos and change their IDs.\n  July 21 – RIA detects the mass download of data from the Identity Documents Database (KMAIS) through additional monitoring and closes the service.\n July 22 – RIA tracks down the possible IP address used to download the photos and forwards the information to the police.\n July 22 – RIA launches an internal investigation to determine the reason how manipulation of the control mechanism of the image storage system was possible.\n July 23 – The police arrests the man suspected of downloading the data and performs the initial procedural acts.\n July 23 – RIA reopens the fixed image system that again allows people to download their document photos.\n July 23-27 – RIA also investigates the possibility of using a similar attack vector in other services.", "posttime": "2021-07-30 09:43:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据库,黑客,database,下载,hacker", "title": "爱沙尼亚称黑客从政府数据库下载了 286,000 张身份证照片", "title_en": "Estonia Says a Hacker Downloaded 286,000 ID Photos From Government Database", "transed": 1, "url": "https://therecord.media/estonia-says-a-hacker-downloaded-286000-id-photos-from-government-database/", "via": "", "real_tags": ["数据库", "黑客", "database", "下载", "hacker"]}, {"category": "", "categoryclass": "", "imagename": "1d02cd3fcce0a7fdf45ccda22a5c6d88.jpg", "infoid": 1070553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "强大的电机带来惊心动魄的骑行体验，而电动动力总成则消除了污染和噪音，只留下一丝尾迹。 Arc One 专为无缝连接的划船体验而设计和制造。通过无线更新，它只会随着年龄的增长而变得更好。更少的移动部件意味着不再有生锈的发动机部件或令人厌烦的过冬。花时间享受您的船，而不是维护它。 Arc One 由前火箭工程师团队驱动，采用尖端技术和工程设计。我们将新颖的船体设计与定制的电池组搭配使用，以实现前所未有的稳定性、航程和速度。智能设计的船体结合了航海级铝材和航空航天制造技术。结果？轻巧而坚固的结构可实现卓越的射程。专用电池组可以严格控制船只的重心，从而实现最佳航程和性能——以及额外的 60 英尺 3 存储空间。轻巧的铝制船体与强大的发动机相结合，使其成为同类船中速度最快的船。期待一个活泼、平稳、惊醒的旅程。\n双电池组可让您在水上畅游一整天 — 无需充电。用您的维护头痛换取电动机的安心。告别发动机噪音。低声的电动​​机不会淹没您的谈话、曲调或开阔水域的声音。创造一种改变人们享受海洋环境的方式的行业定义产品听起来很诱人吗？上车吧。", "note_en": "A powerful motor delivers a thrilling ride while the electric powertrain eliminates pollution and noise, leaving nothing behind but a wake.\n  The Arc One was designed and built for a seamlessly connected boating experience. And with over-the-air updates, it only gets better with age.\n  Fewer moving pieces means no more rusty engine parts or tiresome winterization. Spend time enjoying your boat instead of maintaining it.\n  Driven by a team of former rocket engineers, the Arc One features cutting edge technology and engineering. We paired a novel hull design with custom battery packs for unprecedented stability, range, and speed.\n  The intelligently engineered hull combines marine-grade aluminum and aerospace manufacturing techniques. The result? A lightweight yet strong structure that enables superior range.\n  Specialized battery packs provide tight control over the boat’s center of gravity, yielding optimal range and performance — and an extra 60 ft 3 of storage space.\n  A lightweight, aluminum hull paired with a wildly powerful motor makes this the quickest boat of its kind. Expect a snappy, smooth, wake-throwing ride.\n  Dual battery packs give you a full day on the water — no recharge needed. Trade in your maintenance headaches for the peace of mind of an electric motor.\n  Say goodbye to engine noise. A whisper-quiet electric motor won’t drown out your conversations, tunes, or the sound of the open water.\n  Does creating an industry-defining product that transforms the way people enjoy marine environments sound enticing? Come aboard.", "posttime": "2021-07-30 09:42:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "下一代,generation,电池组", "title": "下一代船", "title_en": "The Next Generation of Boats", "transed": 1, "url": "https://arcboats.com", "via": "", "real_tags": ["下一代", "电池组"]}, {"category": "", "categoryclass": "", "imagename": "bca827ebcd8140e6ac8b553534438d3f.png", "infoid": 1070552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于某些人来说，理想的游戏机是拥有最逼真的图形、尽可能高的帧速率和影院品质的音频，无论他们身在何处。 Playdate 不是这些东西中的任何一个，但这并不能阻止它看起来非常有趣。 Panic 是广受欢迎的 Untitled Goose Game 背后的发行商，正在推出一款带有手摇曲柄和黑白屏幕的掌上游戏机。它明亮的黄色机身看起来非常友好，所有与控制台一起发布的古怪独立游戏看起来都很有趣。想要动手吗？几乎是时候为自己预订一台了。只有一个地方可以让您获得 Playdate。您需要直接前往 Playdate 网站，并准备好为控制台支付 179 美元。此价格仅适用于控制台，而不适用于可单独订购的 Stereo Dock 配件或笔。目前唯一可用的配件是 30 美元的保护套，仅提供亮紫色。这些其他配件的价格和供货情况尚未公布。为避免 PlayStation 5 式的可用性搜索，Playdate 不会售罄。相反，发货日期将逐渐推迟，以匹配公司获得组装控制台所需零件的能力。在上次更新时，发货已推迟到 2022 年的某个时间点。奇怪的是，这款游戏机目前还没有确定的发布日期。 Playdate 应该会在 2021 年的某个时候发货前 20,000 台。很可能 Panic 会在其视频更新之一中提供有关发货日期的更多信息，就像我们在 6 月份看到的那样。我们所知道的是 Playdate 将在发布时向以下国家/地区发货：\n如果您只订阅一份 CNET 时事通讯，就是这样。获取编辑精选的当天最有趣的评论、新闻报道和视频。", "note_en": "For some people the ideal gaming console is the one with the most realistic graphics, the highest possible frame rate and theater-quality audio wherever they are. The   Playdate is not any of those things, but that doesn&#39;t stop it from being incredibly fun looking.  Panic, the publisher behind the wonderfully popular   Untitled Goose Game, is delivering a handheld console with a hand crank and a black-and-white screen. Its bright yellow body looks super friendly, and all of the quirky indie games announced with the console look like a ton of fun.\n Want to get your hands on one? It&#39;s almost time to preorder one for yourself.\n  There&#39;s only one place you will be able to get yourself a Playdate. You&#39;ll need to head straight to the Playdate website, and be ready to pay   $179 for the console.\n  This price is for just the console, and not its Stereo Dock accessory or Pen, which can be ordered separately. The only accessory available right now is a $30 cover, which is only available in a bright purple. The prices and availability for these other accessories have not yet been announced.\n To avoid a   PlayStation 5-style hunt for availability, the Playdate will not sell out. Instead, the ship date will be bumped incrementally back to match the company&#39;s ability to acquire the parts necessary to assemble the consoles. At the time this was last updated, shipping has been delayed to some point in 2022.\n  Oddly enough, there is no set launch date for this console just yet. The Playdate is supposed to be shipping the first 20,000 units at some point in 2021. It&#39;s likely Panic will be giving more information on a shipping date in one of its video updates like the one we saw in June.\n What we do know is Playdate will be shipping at launch to the following countries:\n  If you subscribe to only one CNET newsletter, this is it. Get editors&#39; top picks of the day&#39;s most interesting reviews, news stories and videos.", "posttime": "2021-07-30 08:53:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "曲柄,console,playdate", "title": "Playdate，带曲柄的控制台，要到 2022 年才会发货", "title_en": "Playdate, the Console With a Crank, Will Not Ship Until 2022", "transed": 1, "url": "https://www.cnet.com/tech/computing/playdate-preorder/#ftag=CAD590a51e", "via": "", "real_tags": ["曲柄", "console", "playdate"]}, {"category": "", "categoryclass": "", "imagename": "4b4f0c4e45a633d20bd11ccc0eb10ced.jpg", "infoid": 1070551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络安全公司 SentinelOne 的研究人员在一份新报告中重构了最近对伊朗火车系统的网络攻击，发现了一个新的威胁行为者——他们将其命名为“MeteorExpresss”——以及一个前所未见的雨刷器。 7 月 9 日，当地新闻媒体开始报道针对伊朗火车系统的网络攻击，黑客通过要求乘客拨打伊朗最高领袖哈梅内伊办公室的电话号码“64411”来破坏火车站的显示屏。火车服务中断，仅一天后，黑客就关闭了伊朗交通部的网站。据路透社报道，在道路和城市发展部的计算机遭到攻击后，该部的门户网站和子门户网站瘫痪。在他的检查中，SentinelOne 首席威胁分析师 Juan Andres Guerrero-Saade 解释说，这次攻击背后的人称这种前所未见的雨刷器为“Meteor”，并在过去三年中开发了它。 Guerrero-Saade 说：“目前，我们无法将此活动与先前确定的威胁组或其他攻击联系起来，”并补充说，由于安全研究员 Anton Cherepanov 和伊朗防病毒软件，他们能够重建攻击公司。 “尽管缺乏具体的妥协指标，我们还是能够恢复帖子中描述的大部分攻击组件以及他们遗漏的其他组件。在这个关于停止的火车和流氓巨魔的古怪故事背后，我们发现了一个不熟悉的人的指纹攻击者。” Guerrero-Saade 表示，对 Padvish 安全研究人员的早期分析是 SentinelOne 重建的关键，以及“恢复的攻击者工件，其中包括更长的组件名称列表”。\n“攻击者滥用组策略来分发 cab 文件来进行攻击。整个工具包由批处理文件的组合组成，这些批处理文件编排了从 RAR 档案中删除的不同组件，”Guerrero-Saade 解释说。 “使用攻击者提供的 Rar.exe 副本和密码 &#39;hackemall&#39; 解压档案。擦除器组件按功能拆分：Meteor 基于加密配置加密文件系统，nti.exe 破坏 MBR，以及 mssetup。 exe 锁定系统。” SentinelOne 发现，大部分攻击是“通过一组嵌套在其各自组件旁边并在连续执行中链接在一起的批处理文件进行策划的”。据报道，批处理文件通过伊朗铁路网络内网络共享中的 CAB 文件复制初始组件。从那里，批处理文件使用自己的 WinRAR 副本从三个使用 Pokemon 主题密码的附加档案中解压缩附加组件，“hackemall”在攻击期间在其他地方也被引用。 “在这一点上，执行开始分叉到其他脚本中。第一个是 &#39;cache.bat&#39;，它专注于清除障碍并使用 Powershell 为后续元素做好准备，”Guerrero-Saade 说。 “&#39;cache.bat&#39;执行三个主要功能。首先，它会将受感染设备与网络断开连接。然后它会检查机器上是否安装了卡巴斯基防病毒软件，在这种情况下它会退出。最后，&#39;cache.bat&#39;。 bat&#39; 将为其所有组件创建 Windows Defender 排除项，有效地为成功感染扫清障碍，而不会遇到任何障碍。”该报告解释说，这个特定的脚本在重建攻击链方面具有指导意义，因为它包含一个攻击组件列表，为研究人员提供了要搜索的特定内容。\n部署了两个批处理文件，使机器无法启动并清理事件日志。在一系列其他操作之后，update.bat 将调用“msrun.bat”，它传递“Meteorwiper 可执行文件作为参数”。 Guerrero-Saade 解释说，另一个批处理文件——msrun.bat——移动到一个屏幕锁和 Meteor 雨刷器的加密配置中。计划任务由名为“mstask”的脚本创建，然后设置为在午夜前五分钟执行流星雨刷。 “整个工具包存在一种奇怪的碎片化程度。批处理文件产生其他批处理文件，不同的 rar 存档包含混合的可执行文件，甚至预期的操作也分为三个有效负载：流星擦除文件系统，mssetup.exe 将用户锁定，并且 nti.exe 可能会破坏 MBR，”Guerrero-Saade 写道。 “这个错综复杂的攻击链的主要有效载荷是一个位于‘env.exe’或‘msapp.exe’下的可执行文件。在内部，编码人员将其称为‘Meteor’。而这个特定的 Meteor 实例遭受了严重的 OPSEC 故障（包含可能用于内部测试的详细调试字符串），它是一个具有广泛功能集的外部可配置擦除器。”根据该报告，Meteor 雨刷器带有一个参数，即加密的 JSON 配置文件“msconf.conf”。 Meteor 在从加密配置移动时擦除文件删除卷影副本并将机器从域中取出以使修复复杂化。报告称，这些只是触及了 Meteor 功能的皮毛。尽管未用于对伊朗火车站的攻击，但擦除器能够更改所有用户的密码、禁用屏幕保护程序、根据目标进程列表终止进程、安装屏幕锁、禁用恢复模式、更改启动策略错误处理、创建计划任务、注销本地会话、删除卷影副本、更改锁定屏幕图像和执行需求。\nGuerrero-Saade 指出，wiper 的开发人员为wiper 创造了多种方法来完成这些任务中的每一个“但是，操作员显然在编译带有大量用于内部测试的调试字符串的二进制文件时犯了一个重大错误。后者是这表明尽管开发人员在他们的武器库中有任何先进的实践，但他们缺乏确保此类错误不会发生的强大部署管道。此外，请注意，此示例是在部署前六个月编译的，并且没有发现错误，“报告发现。 “其次，该代码是自定义代码的奇异混合体，其中包含开源组件 (cpp-httplib v0.2) 和几乎古老的滥用软件（FSProLabs 的 Lock My PC 4）。虽然这可能表明 Meteor 雨刷器是内置的是一次性的，或用于单个操作，这与外部可配置设计并列，允许对不同操作进行有效重用。”当 SentinelOne 研究人员深入研究 Meteor 时，他们发现冗余证明了擦除器是由添加不同组件的多个开发人员创建的。该报告补充说，“擦除器的外部可配置特性”表明它不是为这个特定操作而创建的。他们还没有在野外看到流星雨刷的任何其他攻击或变种。研究人员无法将这次攻击归因于特定的威胁行为者，但解释说，攻击者是“中级玩家，其不同的操作组件从笨拙和简陋到精巧而发达。” “一方面，我们有一个新的外部可配置擦除器，其中充满了有趣的功能，涉及成熟的开发过程，以及实现目标的冗余手段。甚至他们的批处理脚本也包括广泛的错误检查，这是部署脚本很少遇到的功能.他们的攻击旨在削弱受害者的系统，无法通过域管理或恢复卷影副本进行简单的补救，”格雷罗-萨德写道。\n“另一方面，我们看到一个对手还没有处理他们的部署管道，使用他们的恶意软件样本，其中包含与此特定操作无关的广泛调试功能和刻录功能。” Guerrero-Saade 继续说 SentinelOne “尚无法在迷雾中辨认出这个对手的形状”，并推测它是“一个肆无忌惮的雇佣军团体”或具有各种动机的国家支持的演员。尽管他们无法确定此次袭击的原因，但他们指出，攻击者似乎熟悉伊朗铁路系统的一般设置和目标使用的 Veeam 备份，这意味着威胁行为者在发动攻击之前在该系统中度过了一段时间。据路透社报道，在袭击发生时，伊朗官员没有确认是否有赎金要求或他们认为袭击的幕后黑手是谁。 《以色列时报》指出，在 2010 年臭名昭著的 Stuxnet 攻击之后，伊朗切断了其大部分基础设施与互联网的连接。", "note_en": "Researchers with cybersecurity company SentinelOne reconstructed the recent cyberattack on Iran&#39;s train system  in a new report, uncovering a new threat actor -- which they named &#39;MeteorExpresss&#39; -- and a never-before-seen wiper.\n     On July 9,  local  news outlets began  reporting on a cyberattack targeting the Iranian train system, with  hackers defacing display screens in train stations by asking passengers to call &#39;64411&#39;, the phone number of Iranian Supreme Leader Khamenei&#39;s office.\n Train services were disrupted and just one day later, hackers took down the website of Iran&#39;s transport ministry.  According to Reuters, the ministry&#39;s portal and sub-portal sites went down after the attack targeted computers at the Ministry of Roads and Urban Development.\n In his examination, SentinelOne principal threat analyst Juan Andres Guerrero-Saade explained that the people behind the attack called the never-before-seen wiper &#39;Meteor&#39; and developed it in the last three years.\n  &#34;At this time, we have not been able to tie this activity to a previously identified threat group nor to additional attacks,&#34; Guerrero-Saade said, adding that they were able to reconstruct the attack thanks to security researcher Anton Cherepanov and an Iranian antivirus company.\n &#34;Despite a lack of specific indicators of compromise, we were able to recover most of the attack components described in the post along with additional components they had missed. Behind this outlandish tale of stopped trains and glib trolls, we found the fingerprints of an unfamiliar attacker.&#34;\n Guerrero-Saade said the early analysis of Padvish security researchers was key to SentinelOne&#39;s reconstruction alongside &#34;a recovered attacker artifact that included a longer list of component names.&#34;\n   &#34;The attackers abused Group Policy to distribute a cab file to conduct their attack. The overall toolkit consists of a combination of batch files orchestrating different components dropped from RAR archives,&#34; Guerrero-Saade explained.\n &#34;The archives decompressed with an attacker-supplied copy of Rar.exe coupled with the password &#39;hackemall&#39;. The wiper components are split by functionality: Meteor encrypts the filesystem based on an encrypted configuration, nti.exe corrupts the MBR, and mssetup.exe locks the system.&#34;\n SentinelOne found that the majority of the attack was &#34;orchestrated via a set of batch files nested alongside their respective components and chained together in successive execution.&#34;\n The batch file copies the initial components via a CAB file in a network share within the Iranian railways network, according to the report. From there, the batch file uses its own copy of WinRAR to decompress additional components from three additional archives that use a Pokemon-themed password, &#34;hackemall&#34; which was also referenced elsewhere during the attack.\n &#34;At this point, the execution begins to bifurcate into other scripts. The first one is &#39;cache.bat&#39;, which focuses on clearing obstacles and preparing the ground for subsequent elements with the use of Powershell,&#34; Guerrero-Saade said.\n &#34;&#39;cache.bat&#39; performs three main functions. First, it will disconnect the infected device from the network. Then it checks to see if Kaspersky antivirus is installed on the machine, in which case it&#39;ll exit. Finally, &#39;cache.bat&#39; will create Windows Defender exclusions for all of its components, effectively clearing the way for a successful infection without impediments.&#34;\n The report explained that this specific script was instructive in rebuilding the attack chain because it includes a list of the attack components that gave researchers specific things to search for.\n Two batch files are deployed that make the machine unbootable and clean up the event logs. After a number of other actions, update.bat will then call &#39;msrun.bat,&#39; which passes &#34;the Meteor wiper executable as a parameter.&#34;\n Another batch file -- msrun.bat -- moves in a screen locker and the encrypted configuration for the Meteor wiper, Guerrero-Saade explained. A scheduled task is created by the script called &#39;mstask&#39; that is then set to execute the Meteor wiper at five minutes to midnight.\n &#34;There&#39;s a strange level of fragmentation to the overall toolkit. Batch files spawn other batch files, different rar archives contain intermingled executables, and even the intended action is separated into three payloads: Meteor wipes the filesystem, mssetup.exe locks the user out, and nti.exe presumably corrupts the MBR,&#34; Guerrero-Saade wrote.\n &#34;The main payload of this convoluted attack chain is an executable dropped under &#39;env.exe&#39; or &#39;msapp.exe&#39;. Internally, the coders refer to it as &#39;Meteor&#39;. While this particular instance of Meteor suffers from a crippling OPSEC failure (the inclusion of verbose debug strings presumably intended for internal testing), it&#39;s an externally configurable wiper with an extensive set of features.&#34;\n The Meteor wiper, according to the report, is supplied with a single argument, an encrypted JSON configuration file &#39;msconf.conf.&#39;\n Meteor wipes files as it moves from the encrypted config deletes shadow copies and takes a machine out of a domain to complicate remediation. These only scratched the surface of what Meteor is capable of, according to the report.\n Although not used in the attack on the Iranian train station, the wiper is able to change passwords for all users, disable screensavers, process termination based on a list of target processes, install a screen locker, disable recovery mode, change boot policy error handling, create schedule tasks, log off local sessions, delete shadow copies, change lock screen images and execute demands.\n Guerrero-Saade noted that the developers of the wiper created multiple ways for the wiper to accomplish each of these tasks\n &#34;However, the operators clearly made a major mistake in compiling a binary with a wealth of debug strings meant for internal testing. The latter is an indication that despite whatever advanced practices the developers have in their arsenal, they lack a robust deployment pipeline that ensures such mistakes do not happen. Moreover, note that this sample was compiled six months before its deployment and the mistake was not caught,&#34; the report found.\n &#34;Secondly, the code is a bizarre amalgam of custom code that wraps open-source components (cpp-httplib v0.2) and practically ancient abused software (FSProLabs&#39; Lock My PC 4). While that might suggest that the Meteor wiper was built to be disposable, or meant for a single operation, that&#39;s juxtaposed with an externally configurable design that allows efficient reuse for different operations.&#34;\n When SentinelOne researchers did a deeper dive into Meteor, they found that the redundancies were evidence that the wiper was created by multiple developers who added different components.\n The report added that the &#34;externally configurable nature of the wiper&#34; shows that it wasn&#39;t created for this particular operation. They have yet to see any other attacks or variants of the Meteor wiper in the wild.\n Researchers were not able to attribute the attack to a specific threat actor but explained that the attacker is an &#34;intermediate level player whose different operational components sharply oscillate from clunky and rudimentary to slick and well-developed.&#34;\n &#34;On the one hand, we have a new externally-configurable wiper packed full of interesting capabilities, involving a mature development process, and redundant means to accomplish their goals. Even their batch scripts include extensive error checking, a feature seldom encountered with deployment scripts. Their attack is designed to cripple the victim&#39;s systems, leaving no recourse to simple remediation via domain administration or recovery of shadow copies,&#34; Guerrero-Saade wrote.\n &#34;On the other hand, we see an adversary that doesn&#39;t yet have a handle on their deployment pipeline, using a sample of their malware that contains extensive debug features and burning functionality irrelevant to this particular operation.&#34;\n Guerrero-Saade goes on to say that SentinelOne &#34;cannot yet make out the shape of this adversary across the fog&#34; and theorizes that it is &#34;an unscrupulous mercenary group&#34; or state-backed actors with a variety of motives.\n Although they were unable to attribute the attack, they noted that the attackers appeared to be familiar with the general setup of Iran&#39;s railway system and the Veeam backup used by the target, implying the threat actors spent time in the system before launching an attack.\n At the time of the attack, Iranian officials did not confirm if there was a ransom demand or who they believed was behind the attack,  Reuters reported.\n The Times of Israel noted that following the infamous  Stuxnet attack in 2010, Iran  disconnected significant parts of its infrastructure from the internet.", "posttime": "2021-07-30 08:53:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "行为,detail,攻击", "title": "研究人员详细介绍了一个新的威胁行为者使用一种名为 Meteor 的可重复使用的雨刷器对伊朗火车系统和交通部进行的前所未见的攻击", "title_en": "Researchers detail a never-before-seen attack against Iran's train system and transport ministry from a new threat actor using a reusable wiper called Meteor", "transed": 1, "url": "https://www.zdnet.com/article/hackers-used-never-before-seen-wiper-in-recent-attack-on-iranian-train-system-report/", "via": "", "real_tags": ["行为", "detail", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "071a9916a894d5c5739d5b4636a23726.jpg", "infoid": 1070550, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Robinhood 开盘价为 38 美元，下跌约 10%，随后回升，但在首日交易时仍下跌 8% 至 34.90 美元。据彭博社报道，在 51 家公司筹集的资金达到 Robinhood 或更多的公司中，这是最糟糕的第一天。对于 Robinhood 向散户投资者提供大部分 IPO 的实验来说，这也是个坏消息。 Robinhood 的股票定价在每股 38 美元至 42 美元的目标价格区间的底部，可能是因为担心波动性，或者可能是因为 Robinhood 想要确保其散户投资者的人气。据《纽约时报》报道，尽管 Robinhood 曾表示将最多 35% 的股份分配给零售，但实际上只有 20% 用于零售，这“表明兴趣低于预期”。 Pitchbook 分析师罗伯特·勒 (Robert Le) 表示，由于股价下跌，机构投资者——那些传统上购买 IPO 并购买了大部分 IPO 的机构投资者——如果有很多散户投资者参与，可能会对未来的 IPO 持怀疑态度。这可能意味着银行家和其他公司将避免向散户投资者提供尽可能多的未来 IPO 机会。从长远来看，糟糕的第一天交易对 Robinhood 来说可能意义不大。我的意思是，Facebook 在 2012 年进行了灾难性的 IPO——定价为 38 美元，第一天什么也没做，然后在接下来的交易日下跌。顺便说一下，Facebook 目前的股价是 358.32 美元。可以说是成功的！所以我不知道今天对 Robinhood 公司意味着什么。此外，Robinhood 向其客户出售股票——如果他们喜欢该产品，他们可能是非常忠诚的投资者。范德比尔特大学金融学助理教授乔什·怀特 (Josh White) 曾任美国证券交易委员会 (Securities and Exchange Commission) 的金融经济学家，他说，现在，散户投资者可能并不试图最大化他们的回报。他们可能只是在赌博。 “投资者正在努力最大化他们的幸福，而不是他们的财富，”怀特说。 “很多人从交易股票中获得了实用性——乐趣或快乐。”也许，他建议，这比去赌场或在 DraftKings 上赌博要好，因为公司可以用这笔钱投资于就业和增长。 Robinhood 是 meme 股票和零售投资兴起的代名词。事实上，美国证券交易委员会今天在针对尼古拉创始人特雷弗·米尔顿 (Trevor Milton) 提起的诉讼中称，米尔顿“针对他称为‘罗宾汉投资者’的一类投资者展开了一场无情的公关闪电战。”投诉继续说，米尔顿追踪了进入尼古拉股票的新 Robinhood 投资者的数量，作为成功的标志。米尔顿被指控犯有证券欺诈罪； Nikola 去年的价格在 65 美元以上达到顶峰，现在价值 12.26 美元。如果这些散户投资者损失了很多钱，那可能会给经纪人带来麻烦——而不仅仅是 Robinhood。 “最终，这些将成为所有经纪公司都想吸引的客户，”怀特说。 “如果他们现在亏了很多钱，他们会完全退出投资吗？”", "note_en": "Robinhood started trading at $38, dropped about 10 percent, recovered, but still closed down 8 percent at $34.90 on its first day of trading. It’s the worst first day among 51 firms that raised as much as Robinhood or more,  according to  Bloomberg. It’s also bad news for Robinhood’s experiment at offering retail investors a chunk of the IPO.\n Robinhood’s shares priced at the bottom of  the targeted price range of $38 to $42 a share, perhaps because of concerns about volatility or perhaps because Robinhood wanted to ensure a pop for its retail investors. And though Robinhood had said it would allocate up to 35 percent of its shares to retail, only 20 percent actually went to retail, which “indicated less interest than expected,”  according to  The New York Times .\n  Because the stock traded down, institutional investors — those who traditionally buy IPOs and who bought the majority of this one — may be leery of future IPOs if there are a lot of retail investors involved, according to Robert Le, an analyst for Pitchbook. That may mean bankers and other companies will avoid giving retail investors as much access to future IPOs.\n A bad first day of trading may not mean much for Robinhood in the long run. I mean, Facebook had a disastrous IPO in 2012 — pricing at $38, doing not much of anything its first day, and then falling during the following trading days. Facebook’s current share price, by the way, is $358.32. It is arguably successful! So I don’t know what today means for Robinhood the company. Besides, Robinhood sold shares to its customers — and they may be very loyal investors if they like the product.\n Now, it may be that retail investors aren’t trying to maximize their returns,  says Josh White, an assistant professor of finance at Vanderbilt University, who was previously a financial economist for the Securities and Exchange Commission. They might just be doing some  gambling. “Investors are trying to maximize their happiness, not their wealth,” White says. “A lot of people get utility — fun or joy — out of trading stock.” Maybe, he suggests, this is better than going to a casino or gambling on DraftKings because companies can use the money to invest in jobs and growth.\n Robinhood is synonymous with the rise of meme stocks and retail investing. In fact, in a complaint  the SEC filed today against Nikola founder Trevor Milton, it says that Milton “embarked on a relentless public relations blitz aimed at a class of investors he called ‘Robinhood investors.” The complaint goes on to say that Milton tracked the number of new Robinhood investors who got into Nikola’s stock as a sign of success. Milton is  being charged with securities fraud; Nikola, which peaked in price above $65 last year, is now worth $12.26.\n If those retail investors lose a lot of money, that may be trouble for brokers — not just Robinhood. “Eventually, these are going to be customers that all brokerage firms want to attract,” White says. “If they lose a lot of money now, are they going to exit investing altogether?”", "posttime": "2021-07-30 08:52:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,股票,stock,投资者", "title": "$ HOOD 股票在交易的第一天下跌", "title_en": "$HOOD stock down on the first day of trading", "transed": 1, "url": "https://www.theverge.com/2021/7/29/22600570/robinhood-ipo-retail-investors", "via": "", "real_tags": ["交易", "股票", "stock", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "2076123f2893b2c90421754bf62b62a6.jpg", "infoid": 1070549, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个大型俄罗斯模块与国际空间站对接并开始“无意中”启动其推进器后，美国宇航局和俄罗斯航天局的飞行控制员周四避免了一场灾难。当地时间上午 8 点 30 分（UTC 时间 13 点 30 分），美国宇航局任务控制中心所在地休斯顿，俄罗斯“Nauka”模块与空间站相连。之后，空间站上的俄罗斯宇航员开始准备打开通向瑙卡的舱口，但在休斯顿时间上午 11 点 34 分，瑙卡意外地开始发射其运动推进器。几分钟之内，空间站开始失去姿态控制。这是一个问题，原因有几个。首先，该站需要一定的姿态来保持与地球同步卫星的信号并与地面的任务控制中心通话。此外，太阳能电池阵列被定位为基于该预定姿态收集电力。另一个问题是空间站结构上的重力。庞大的空间站的各种组件在微重力下组装，并设计为在零重力下运行。因此，即使车辆上的小应力也会导致车站结构出现小裂缝或其他问题。由于所有这些原因，休斯顿和莫斯科的空间站飞行控制员在空间站开始漂移后迅速采取行动。上午 11 点 42 分，姿态控制完全丧失，空间站服务舱的发动机点火。随后移交给与空间站相连的俄罗斯进步车辆，该车辆开始发射推进器。这场拔河比赛抵消了 Nauka 模块推进器的活动，该活动最终在燃料供应耗尽后停止。到周四中午 12 点 29 分，姿态控制已恢复。它在地面和太空中停留了一个小时。 “哎哟！”在周四的空间站活动期间，休斯顿的首席飞行总监 Zebulon Scoville 在轮班结束后在推特上发了推文。 “那。是。一天。”到周四下午晚些时候，当美国宇航局官员召开电话会议向记者通报情况时，情况似乎已经得到控制。然而，官员们拒绝透露在空间站恢复正常状态之前任务控制中心的情况有多严重。 NASA 空间站项目经理乔尔·蒙塔尔巴诺 (Joel Montalbano) 说：“在你用完所有应急计划之前，你不会真的开始担心。” “而我们今天没有那样做。”\n蒙塔尔巴诺说，美国宇航局的一个工程师团队已经在研究周四失去控制对空间站结构的影响。与此同时，俄罗斯工程师正在评估 Nauka 模块的健康状况。两组都应在周五结束前完成初步评估。对于 NASA 来说，这意味着推迟计划于周五发射的 Starliner 航天器。这项期待已久的任务是在 2019 年 12 月的首次试飞因软件问题出现问题后 19 个月来的。由于 Starliner 在第一次试飞期间无法与空间站对接，波音公司同意在载人飞行之前执行 Starliner 的第二次测试任务。美国宇航局将 Starliner 的发射时间提前至美国东部时间周二下午 1 点 20 分（世界标准时间 17 点 20 分）从佛罗里达州（UTC 时间 17 点 20 分）使用 Atlas V 火箭发射。如果飞船在下周二发射并且一切顺利，Starliner 将在下周三与空间站对接。与此同时，俄罗斯人将继续努力将 Nauka 与空间站整合起来。这是一个相当大的模块，包括船员宿舍、用于科学实验的气闸等等。它的质量约为 24 公吨，比该站最大的俄罗斯部分 Zvezda 服务模块大约 20%。 Nauka 有着悠久的历史，但迄今为止，它的历史并不光彩。由于缺乏资金和技术问题，它在 8 天前的发布被推迟了十多年。到达轨道后不久，俄罗斯在 Nauka 的主推进系统上遇到了困难，与空间站的对接被推迟。在使用备用推进器提升高度并到达空间站后，Nauka 停靠。目前尚不清楚发射后不久的推进系统问题在周四的困难中可能发挥了什么作用。", "note_en": "Flight controllers at NASA and Roscosmos averted a disaster on Thursday after a large Russian module docked with the International Space Station and began to &#34;inadvertently&#34; fire its thrusters.\n The Russian &#34;Nauka&#34; module linked to the space station at 8:30 am CT (13:30 UTC), local time in Houston, where NASA&#39;s Mission Control is based. After that, Russian cosmonauts aboard the station began preparing to open the hatches leading to Nauka, but at 11:34 am Houston time, Nauka unexpectedly started to fire its movement thrusters.\n Within minutes, the space station began to lose attitude control. This was a problem for several reasons. First of all, the station requires a certain attitude to maintain signal with geostationary satellites and talk to Mission Control on the ground. Also, solar arrays are positioned to collect power based upon this predetermined attitude.\n Another concern is G forces on the station&#39;s structure. The various components of the extensive space station were assembled in microgravity and designed to operate at zero-G. So even small stresses on the vehicle can induce small cracks or other problems with the station&#39;s structure.\n  For all of these reasons, space station flight controllers in Houston and Moscow acted quickly after the station started to drift. Attitude control was fully lost at 11:42 am, and engines on the space station&#39;s service module were fired. This was followed by a handover to the Russian Progress vehicle attached to the station, which began to fire its thrusters. This tug-of-war offset the Nauka module thruster activity, which eventually stopped after fuel supplies were exhausted. By 12:29 pm on Thursday, attitude control was restored. It made for quite an hour on the ground and in space. &#34;Yeehaw!&#34;  tweeted Zebulon Scoville, lead flight director in Houston during Thursday&#39;s space station activities, after his shift ended. &#34;That. Was. A. Day.&#34;\n    By late Thursday afternoon, when NASA officials held a teleconference to brief reporters, the situation appeared to be well in hand. Officials, however, declined to say how serious the situation got in Mission Control before the station returned to its proper attitude.\n &#34;Until you exhaust all your contingency plans, you&#39;re not really starting to worry,&#34; said NASA&#39;s space station program manager Joel Montalbano. &#34;And we didn&#39;t do that today.&#34;\n Already, Montalbano said, a team of NASA engineers was studying the effect of Thursday&#39;s loss of control on the station&#39;s structure. Meanwhile, Russian engineers were assessing the health of the Nauka module. Both groups should complete preliminary assessments by the end of the day Friday.\n For NASA, this meant delaying the launch of a Starliner spacecraft planned for Friday. This long-awaited mission comes 19 months after an initial test flight in December 2019 went awry due to software problems. Because Starliner was not able to dock with the space station during this first test flight, Boeing agreed to fly a second test mission of Starliner before a crewed flight.\n NASA moved the Starliner launch to no-earlier-than Tuesday at 1:20 pm EDT from Florida (17:20 UTC) on its Atlas V rocket. If the spacecraft launches next Tuesday and all goes well, Starliner will dock with the space station next Wednesday.\n Meanwhile, the Russians will continue to work toward integrating Nauka with the space station. This is a sizable module that includes crew quarters, an airlock for scientific experiments, and much more. With a mass of about 24 metric tons, it is roughly 20 percent larger than the biggest Russian segment of the station, the Zvezda service module.\n Nauka has had a long and, so far, inglorious history. Its launch eight days ago came after more than a decade of delays due to lack of funds and technical problems. Shortly after reaching orbit, Russia had difficulties with Nauka&#39;s main propulsion system, and docking with the space station was delayed. After using backup thrusters to raise its altitude and reach the station, Nauka docked. It&#39;s not clear what role the propulsion system issues experienced shortly after the launch may have played in Thursday&#39;s difficulties.", "posttime": "2021-07-30 08:11:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,rust,模块,module,空间站", "title": "俄罗斯模块与空间站对接后突然发射推进器", "title_en": "Russian module suddenly fires thrusters after docking with space station", "transed": 1, "url": "https://arstechnica.com/science/2021/07/russian-module-suddenly-fires-thrusters-after-docking-with-space-station/", "via": "", "real_tags": ["俄罗斯", "rust", "模块", "module", "空间站"]}, {"category": "", "categoryclass": "", "imagename": "c568a11d25dd60b75f52e51285295cf6.jpg", "infoid": 1070548, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿特区（美国有线电视新闻网）周四在国际空间站出现了一种不寻常且具有潜在危险的情况，因为新对接的俄罗斯 Nauka 模块无意中发射了其推进器，导致与空间站的“拔河”并短暂地将其推离了位置，根据美国宇航局飞行控制员的说法。 Nauka——俄罗斯航天局上周发射到国际空间站的一个长期延迟的实验室模块——在周四早上与国际空间站对接后无意中发射了它的推进器。美国宇航局官员宣布这是“航天器紧急情况”，因为空间站失去了近一个小时的姿态（国际空间站应该保持定向的角度）控制，并且地面控制员失去了与目前在国际空间站上的七名宇航员的通信在磨难期间持续了 11 分钟。 NASA 和俄罗斯航天局 Roscosmos 之间的联合调查正在进行中。美国宇航局国际空间站计划负责人乔尔·蒙塔尔巴诺坚称，宇航员从未处于危险之中，他们也没有注意到国际空间站有任何损坏。然而，位于德克萨斯州休斯顿的 NASA 任务控制中心曾一度要求他们向空间站的窗户外面看，看是否能发现空间站的任何碎片或损坏。该事件还推迟了原定于周五发射的波音 Starliner 无人驾驶试飞到该站的发射。美国宇航局表示，此举让“国际空间站团队有时间继续检查新抵达的 Roscosmos 的 Nauka 模块，并确保该站为 Starliner 的到来做好准备。”美国宇航局人类探索和运营任务理事会副局长凯西·卢德斯说：“太空飞行很艰难，当我们引入新能力时，可能会出现故障，这就是我们为这些突发事件做准备和训练的原因。”\n美国宇航局官员很快淡化了事件的严重性，将其描述为“非常激动人心的时刻”和“动态事件”。蒙塔尔巴诺说：“直到您用尽所有应急计划，您才开始担心，而今天我们不在那里。”然而，蒙塔尔巴诺也承认，在空间站进入轨道的 20 年里，推进器的意外点火只发生了“三到四次”。奥巴马政府期间美国宇航局前副局长洛里·加弗 (Lori Garver) 将这一事件描述为“提醒我们，我们对俄罗斯合作伙伴能力缺乏洞察力是一种无法控制的风险。我不确定我们是否会允许我们的一个商业合作伙伴如果他们刚刚遇到我们事先听说过的这个模块的问题，就与（该）站对接。”", "note_en": "Washington DC (CNN)An unusual and potentially dangerous situation unfolded Thursday at the International Space Station, as the newly-docked Russian Nauka module inadvertently fired its thrusters causing a &#34;tug of war&#34; with the space station and briefly pushing it out of position, according to NASA flight controllers.\n Nauka — a long-delayed laboratory module that Russian space agency Roscosmos&#39; launched to the International Space Station last week — inadvertently fired its thrusters after docking with the International Space Station Thursday morning.\n NASA officials declared it a &#34;spacecraft emergency&#34; as the space station experienced a loss of attitude (the angle at which the ISS is supposed to remain oriented) control for nearly one hour, and ground controllers lost communications with the seven astronauts currently aboard the ISS for 11 minutes during the ordeal. A joint investigation between NASA and the Russian space agency Roscosmos is now ongoing.\n     Joel Montalbano, the head of NASA&#39;s International Space Station Program, insists the astronauts were never in danger and that they have not noticed any damage to the ISS. NASA&#39;s Mission Control in Houston, Texas, however, at one point asked them to look outside the windows of the space station to see if they could spot any debris or damage to the station.\n    The incident also delayed the launch of the Boeing Starliner uncrewed test flight to the station, which had been set to launch on Friday.\n  NASA says the move allows the &#34;International Space Station team time to continue working checkouts of the newly arrived Roscosmos&#39; Nauka module and to ensure the station will be ready for Starliner&#39;s arrival.&#34;\n &#34;Spaceflight is hard, and when we bring on new capabilities there can be glitches, which is why we prepare and train for these contingencies,&#34; said Kathy Lueders, associate administrator for NASA&#39;s Human Exploration and Operations Mission Directorate.\n NASA officials were quick to downplay the severity of the incident, describing it as a &#34;pretty exciting hour&#34; and a &#34;dynamic event.&#34;\n &#34;Until you exhaust all your contingency plans, that&#39;s when you start to worry and today we just weren&#39;t there,&#34; said Montalbano.\n   Yet Montalbano also acknowledged that accidental firings of thrusters have only taken place &#34;maybe three or four times&#34; during the 20 years that the space station has been in orbit.\n Lori Garver, the former deputy administrator of NASA during the Obama administration, described the incident as &#34;a reminder that our lack of insight into our Russian partners capabilities is an uncontrolled risk. I&#39;m not sure we would have allowed one of our commercial partners to dock with (the) station if they had just experienced the problems we heard about with this module in advance.&#34;", "posttime": "2021-07-30 08:03:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,模块,briefly,空间站", "title": "新俄罗斯模块失火后国际空间站短暂失去控制", "title_en": "ISS Briefly Loses Control After New Russian Module Misfires", "transed": 1, "url": "https://www.cnn.com/2021/07/29/tech/nasa-iss-russian-space-module-misfire-scn/index.html", "via": "", "real_tags": ["俄罗斯", "模块", "briefly", "空间站"]}, {"category": "", "categoryclass": "", "imagename": "0d20c70757cb12f71edee7afc1877dc5.jpg", "infoid": 1070547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自由党政府提出了一个庞大的新系统，旨在确保非法内容，如儿童色情和仇恨言论，不会出现在 Facebook、YouTube、Pornhub 和 Twitter 等日常互联网平台上。这项范围广泛的提案于周四发布并发布到网上，以便加拿大人可以在 9 月底之前提供反馈。该提案将要求政府设立一个“加拿大数字安全专员”，负责监督联邦政府提出的一系列新规则，旨在保留五种类型的非法内容——儿童色情、恐怖主义内容、煽动暴力、仇恨言论以及未经同意在网上分享私密图片。平台可能会因不遵守规定而受到严厉处罚，并且该提案为警方和加拿大情报机构打开了新的大门，在被认为涉及国家安全的情况下，他们可以卷入在线进行潜在非法活动的事件。 “我们向加拿大人展示的东西反映了我们认为最好的前进方式，”遗产部长史蒂文吉尔博特告诉《星报》。 “我们要求平台以迄今为止他们尚未采取的方式承担他们的责任，所以我认为对于绝大多数加拿大人来说，我们提出的建议很有意义。”但由于提案的规模和范围，周四只能给出第一印象的专家表示，他们有一些保留意见。\n一些人说，例如，通过一个独立委员会提出的上诉程序可能会因感到被 Facebook 轻视的用户的投诉而陷入困境。其他人指出，该委员会将对言论自由问题做出判断，这一举措需要仔细分析并采取适当的保护措施。根据新规则，平台将被要求将用户标记的非法内容从其网站上移除，并拥有强大的监控系统。平台需要一定程度的透明度，以确保它们采取相应的行动。虽然提案中包含了流行的社交媒体网站，但该规定不包括通过 Rogers、Telus、Bell、WhatsApp 或 Facebook Messenger 等公司进行的私人通信。该提案仅涵盖在线通信服务提供商 (OCSP)，这是一个新的法律定义，其中包括 Instagram、Twitter 和 TikTok，但不包括其他社交媒体平台，如优步、TripAdvisor 或 MyFitnessPal。所涵盖的平台必须在 24 小时内删除非法内容并遵守其他规定，否则它们可能面临高达 1000 万美元或平台全球总收入 3% 的经济处罚——以较高者为准。如果不遵守规定，专员可以对一家公司处以高达 2500 万美元或全球总收入 5% 的罚款，以较高者为准。在恶劣的情况下，当一个平台公然违反规则时，特别是涉及恐怖主义内容或儿童色情内容时，专员可能会在法庭上寻求封锁令，这可能会使加拿大人无法访问该网站。\n与新专员一起的将是一个咨询委员会和一个“加拿大数字追索委员会”，该委员会将监督一个法庭系统，在该系统中，平台用户可以在用尽平台本身的上诉后寻求对决定的追索权。追索委员会将对内容删除做出具有约束力的决定。 Guilbeault 表示，根据他与提出类似监管框架的欧洲同行的对话，他“有信心”，即追索委员会不会因社交媒体用户的投诉而陷入困境。然而，“我们希望这个监管系统能够随着时间的推移而发展，因为显然，社会习惯在变化，技术在变化，平台也在变化，”他说。加拿大反仇恨网络执行董事埃文·巴尔戈德 (Evan Balgord) 表示，根据他的经验，Facebook 经常拒绝删除仇恨内容的请求。 “从来没有听说过上诉有效，”他说。追索委员会意味着“你可以向另一个人投诉”，他补充说，并指出有一个过程，用户提交他们的故事，然后 Facebook，例如，提交他们的。 “在受害者必须自我代表的情况下，存在很大的权力失衡，”巴尔戈德说。 “如果平台——即使他们在实际做正确的事情上明显更好，并且实际上尝试做正确的事情，我们知道他们没有，那么这个在线法庭仍然会有很多案件在审理成为超额认购的问题。”\n渥太华大学法学教授 Vivek Krishnamurthy 表示，他对追索权委员会感到担忧，因为它“感觉非常像一个将要对言论的合法性做出判断的法院。” “我们希望确保有强有力的程序保障，并且做出的决定……符合法治原则。”最后，他说，该提案“在主流技术平台方面不会真正改变太多。” Krishnamurthy 说：“在某些方面，我们应该将其视为非法内容法案，而不是网络伤害法案。” “您知道，许多类型的在线危害完全无法通过此解决。例如，虚假信息。”他还提到了 Parler 和 Gab 的案例，这是极右翼崇拜的两个类似 Twitter 的平台，“基本上不删除任何内容是一种自豪。”他补充说，如果规则范围内的公司在加拿大没有服务器或办事处，那么还有一个管辖权问题。 “他们正在处理非常小的问题子集，”他说。 “我真的很怀疑这是否会对任何在网上面临各种问题的人产生有意义的影响。”根据新规则，平台还必须保留潜在的非法内容和涉及国家安全的内容。他们不能删除可以合法获得的内容或识别信息。\n同时，有两个提议的规则可以让平台通知警察或加拿大安全情报局（CSIS）。如果内容表明存在迫在眉睫的伤害风险，则可以通知执法部门，如果内容涉及国家安全问题，则可以通知 CSIS。政府还在考虑改变 CSIS 的运作方式，并允许情报机构通过类似于生产订单的方式从平台获取订户信息。赋予 CSIS 的新权力还可以允许该机构调查网络恐怖主义内容以外的事件，并扩展到外国干涉和间谍活动。 Guilbeault 说，他们的提议只是提供他们在物理世界中拥有的执法工具，并允许它们在数字世界中使用。然而，他补充说，决定尚未最终确定，“这是一个真正的磋商过程。”任何人都可以阅读对话，但要做出贡献，您应该是注册 Torstar 帐户持有人。如果您还没有 Torstar 帐户，您现在可以创建一个（免费） 对话是我们读者的意见，并受行为准则的约束。星报不认可这些意见。", "note_en": "The Liberal government has proposed a vast new system that would be tailored to ensure illegal content, such as child pornography and hate-speech, doesn’t end up on everyday internet platforms such as Facebook, YouTube, Pornhub and Twitter.\n The wide-ranging proposal was released Thursday and put  online so Canadians can provide their feedback for it until the end of September.\n The proposal would see the government establish a “digital safety commissioner of Canada” who would oversee a slate of new rules proposed by the federal government aimed at keeping five types of illegal content — child pornography, terrorist content, incitements to violence, hate-speech and the non-consensual sharing of intimate images — off the web.\n Severe penalties could be slapped on platforms for not complying and the proposal opens up new doors for police and Canada’s intelligence agency, in cases deemed to be of national security concern, to get involved in incidents where potential illegal activity is being carried out online.\n “What we’re presenting to Canadians reflects what we feel is the best way forward,” Heritage Minister Steven Guilbeault told the Star.\n “We’re asking platforms to take their responsibilities in ways that they haven’t so far and so I think that for the vast majority of Canadians, what we’re proposing will make a lot of sense.”\n But experts — who were only able to give first impressions Thursday due to the size and scope of the proposal — said they had some reservations.\n Some say the appeals process — through an independent council — that’s on the table could become bogged down in complaints from users who feel slighted by Facebook, for example. Others noted the council will be making judgments on free speech issues, a move that needs to be analyzed carefully and have proper safeguards put in place.\n   Under the new rules, platforms would be required to keep illegal content flagged by users off their websites and have robust monitoring systems. There would be a level of transparency required of platforms to make sure they are acting accordingly.\n While popular social media websites are included in the proposal, the regulations would not cover private communications through companies such as Rogers, Telus, Bell, WhatsApp or Facebook Messenger.\n The proposal only covers Online Communication Service Providers (OCSPs), a new legal definition, which includes Instagram, Twitter and TikTok, but not other social media platforms such as Uber, TripAdvisor or MyFitnessPal.\n The platforms covered would have to remove illegal content within 24 hours and follow other regulations or they could face financial penalties of as much as $10 million or three per cent of a platform’s gross global revenue — whichever is higher.\n In cases of non-compliance, the commissioner could seek a fine for a company of as much as $25 million or five per cent of the gross global revenue, whichever is higher.\n In egregious cases, when a platform is flagrantly violating the rules when it comes to, specifically, terrorist content or child pornography, there could be a blocking order sought by the commissioner in court, which could make the website inaccessible to Canadians.\n Alongside the new commissioner would be an advisory council and a “Digital Recourse Council of Canada” which would oversee a tribunal system in which users of platforms could seek recourse on decisions after exhausting appeals with the platforms themselves. The recourse council would make binding decisions on content removal.\n Guilbeault said that he was “confident,” based on his conversations with counterparts in Europe where similar regulatory frameworks have been proposed, that the recourse council would not be bogged down by complaints from social media users.\n However, “We want this regulatory system to be one that can evolve over time, because clearly, social habits are changing, technologies are changing, platforms are changing,” he said.\n Evan Balgord, executive director of the Canadian Anti-Hate Network, said it’s been his experience that Facebook frequently denies requests for hateful content to be taken down. “Never heard of an appeal working,” he said.\n The recourse council would means there’s “another person you can go complain to,” he added, noting that there’s a process where the user submits their side of the story and then Facebook, for example, submits theirs.\n “There’s a big power imbalance there with the victim having to self-represent,” Balgord said.\n  “If the platform’s — even if they got significantly better at actually doing the right thing, and actually trying to do the right thing, which we know they don’t, there’d still be so many cases going before this online tribunal that it becomes a question of it being oversubscribed.”\n Vivek Krishnamurthy, a law professor at the University of Ottawa, said he had concerns about the recourse council because it “feels very much like a court that is going to be passing judgment on the legality of speech.”\n “We want to make sure that there are strong procedural safeguards and that the decisions that are made ... conform with rule of law principles.”\n In the end, he said, the proposal is “not really going to change much when it comes to mainstream technology platforms.”\n “In some ways, we should view this as an illegal-content bill rather, than an online-harms bill,” Krishnamurthy said. “Many kinds of online harms are just completely unaddressed by this, you know. Disinformation, for example.”\n  He also raised the cases of Parler and Gab, two Twitter-like platforms adored by the far-right, which “make it a point of pride not to remove any content, essentially.” There’s also a question of jurisdiction, he added, if a company under the scope of the rules doesn’t have servers or offices in Canada.\n “They’re dealing with a very small subset of the issues,” he said. “I really question if this is going to make a meaningful difference to anyone who has faced, you know, various kinds of problems online.”\n Under the new rules, platforms would also have to preserve potentially illegal content and content of national security concern. They couldn’t delete content or identifying information that can be lawfully obtained.\n Meanwhile, there are two proposed rules that could see police or the Canadian Security Intelligence Service (CSIS) notified by platforms. Law enforcement could be notified if the content suggests an imminent risk of harm and CSIS could be notified if the content presents a national security concern.\n The government is also looking at changing how CSIS operates and allowing the intelligence agency to obtain subscriber information from platforms through something akin to a production order. New powers given to CSIS could also allow the agency to investigate instances beyond just terrorist content online and extend to foreign interference and espionage.\n Guilbeault said that what they’re proposing is simply giving law enforcement tools that they have in the physical world and allowing them to be used in the digital one.\n However, he added that decisions haven’t been finalized and that “this is a genuine consultation process.”\n       Anyone can read Conversations, but to contribute, you should be registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free)\n Conversations are opinions of our readers and are subject to the  Code of Conduct. The Star does not endorse these opinions.", "posttime": "2021-07-30 08:02:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "规则,penalties,平台", "title": "加拿大提议设立数字安全专员一职，以监督违反新的有害在线内容规则的行为并对平台进行处罚", "title_en": "Canada proposes the creation of a digital safety commissioner role to oversee violations of new harmful online content rules and issue penalties to platforms", "transed": 1, "url": "https://www.thestar.com/news/canada/2021/07/29/canada-proposes-digital-safety-commissioner-to-keep-illegal-content-off-facebook-youtube-pornhub-and-other-platforms.html", "via": "", "real_tags": ["规则", "penalties", "平台"]}]