[{"category": "", "categoryclass": "", "imagename": "1d8b7938f305704afddd8932581d1cca.png", "infoid": 1071801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "放聪明点。购物安全。智能音箱、健身追踪器、无线耳机有多可怕？我们创建本指南是为了帮助您购买安全可靠的互联产品。", "note_en": "Be Smart. Shop Safe.\r\rHow creepy is that smart speaker, that fitness tracker, those wireless headphones? We created this guide to help you shop for safe, secure connected products.", "posttime": "2021-08-07 01:09:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mozilla,privacy,音箱", "title": "Mozilla：*不包括隐私", "title_en": "Mozilla: *Privacy Not Included", "transed": 1, "url": "https://foundation.mozilla.org/en/privacynotincluded/", "via": "", "real_tags": ["mozilla", "privacy", "音箱"]}, {"category": "", "categoryclass": "", "imagename": "0f5d64dffb588d734dab45f3ca170b61.jpg", "infoid": 1071797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，一家新的初创公司希望成为 UX 团队的关键 DesignOps 平台，并已筹集资金帮助其扩大规模。 Zeroheight 现在已经筹集了 1000 万美元的 A 轮融资，由 Tribe Capital 领投，Adobe、Y Combinator、FundersClub 和 Expa 以及天使投资人包括 Tom Preston-Werner（GitHub 联合创始人）、Bradley Horowitz（副总裁）跟投。 Google 产品）、Irene Au（为 Google 构建和运行 UX 设计）和 Nick Caldwell（Twitter 工程副总裁）。总部位于伦敦的 zeroheight 现在将扩展到旧金山/湾区，并全面发展团队。到目前为止，它的重点一直是用户体验文档，但它现在还将探索其他领域，例如缩小设计和开发之间的差距。联合创始人杰罗姆·德·拉法格 (Jerome de Lafargue) 表示：“zeroheight 为 UX 所做的事情就像 GitHub 等 DevOps 平台为构建和交付代码所做的那样，提供了一个记录和管理 UX 组件的中心位置，再加上允许团队跳过设计交接的设计 API并加快用户体验交付过程。”他说该公司解决了用户体验团队的扩展问题：“问题已经出现，因为用户体验团队在过去几年中急剧增长，因为用户体验现在对于大多数公司来说非常重要，只是为了竞争。因此，因此您现在需要集中化，您需要可重复使用的组件，以便团队可以提高效率，而不会在不断发货时降低质量。” Zeroheight 拥有 1,300 多个客户群，其中包括 Adob​​e 和 United Airlines 等多家财富 500 强公司。", "note_en": "Now, a new startup hopes to become a key DesignOps platform for UX teams, and has raised money to help it, in turn, scale-up.\n Zeroheight has now raised a $10 million Series A funding round led by Tribe Capital, with participation from Adobe, Y Combinator, FundersClub and Expa, as well as angel investors including Tom Preston-Werner (co-founder of GitHub), Bradley Horowitz (VP Product at Google), Irene Au (built and ran UX design for Google) and Nick Caldwell (VP Engineering at Twitter).\n London-based zeroheight will now expand to the San Francisco/Bay Area, and grow the team across the board. Its focus so far has been on UX documentation, but it will now also explore other areas such as closing the gap between design and development.\n Co-founder Jerome de Lafargue said: “zeroheight does for UX what DevOps platforms like GitHub do for building and shipping code, providing a central place to document and manage UX components, coupled with design APIs that allow teams to skip the design hand-off stage entirely and speed up the UX delivery process.”\n He said the company addresses the scaling problem for UX teams: “Problems have emerged because UX teams have grown dramatically in the past few years, because UX is now so important for most companies to just compete. And so because of this you now need centralization, you need components that are reusable so that teams can be efficient and not lose quality as it keeps shipping.”\n Zeroheight counts several Fortune 500 companies like Adobe and United Airlines as customers among its 1,300+ customer base.", "posttime": "2021-08-07 00:22:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "capital,tribe,团队", "title": "zeroheight 筹集了由 Tribe Capital 牵头的 1000 万美元融资，用于为 UX 团队扩展 DesignOps", "title_en": "\n\t\t\t\tzeroheight raises $10M round led by Tribe Capital to scale DesignOps for UX teams\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/zeroheight-raises-10m-round-led-by-tribe-capital-to-scale-designops-for-ux-teams/", "via": "", "real_tags": ["capital", "tribe", "团队"]}, {"category": "", "categoryclass": "", "imagename": "6305b091159fd1f2d2c17c8bed28b1c8.png", "infoid": 1071796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "换句话说，偷看，现在是点钟。在今晚 11:59 (PT) 的早鸟价结束之前购买您的通票。我们不可能在一篇文章中详细介绍所有 Disrupt 演讲、演讲者、活动和机会——相信我，我们已经尝试过了。因此，让我们只关注您不容错过的 Disrupt 2021 的一个方面。分组会议。您会发现在这三天中分散的各种会议。我们将在这里重点介绍一些，并确保在 Disrupt 2021 议程中查看所有这些。 Startup Pitch Feedback Sessions：您会在三天内找到其中的 10 个。抽出时间观看和学习在 Startup Alley 中展示的所有初创公司，并听取 TC 工作人员的反馈。你一定会学到一些技巧来提高你自己的音调。你完成我：在可组合生态系统的时代，我们现在都是合作伙伴——从死敌到纯粹的合作。那么为什么现在是邀请朋友和挑战者参加会议的合适时机呢？事实是，我们必须为未知的未来而建设，拥有共同的战略和价值成果。加入我们，探索在平台经济中鼓励更多共生关系的五种方法。由 Mambu 首席客户官 Elliott Limb 介绍。黑客美国医疗保健：很少有事情比导航医疗账单更能唤起负面情绪；美国人迫切需要解决方案来优先考虑他们的需求，降低成本并提升患者旅程，以便他们可以专注于获得护理。数字创新可以提供卓越的患者体验，消除付款人、供应商和消费者之间的摩擦。听听数字健康独角兽 Cedar 如何设计一个以消费者为先的数字平台，该平台正在彻底改变整个医疗保健行业的金融体验。雪松介绍。照顾下一代：KiwiCo 使孩子们能够通过动手工具包探索、创造和学习。 Mirvie 为早期检测和干预提供了一个个性化的怀孕窗口。 Grove 致力于通过其环保美容、家居和生活方式产品系列打造无塑料未来。听听这三家公司的杰出领导者讲述他们为现在和子孙后代创造一个更美好世界的使命，建立运动和社区，以及摆脱速度的里程碑。梅菲尔德介绍。\nTechCrunch Disrupt 2021 是您需要在 9 月 21 日至 23 日参加的地方。为什么不以低于 100 美元的价格在那里？在今晚 11:59 (PT) 交易到期之前购买早鸟通行证。贵公司是否有兴趣赞助或参展 Disrupt 2021？填写此表格，联系我们的赞助销售团队。", "note_en": "In other words, peeps, it’s now-o’clock.  Buy your pass before  the early-bird price ends tonight  at 11:59 pm (PT).\n We can’t possibly detail all of the Disrupt presentations,  speakers, events and opportunities waiting for you in one post — believe me, we’ve tried. So, let’s focus on just one aspect of Disrupt 2021 you won’t want to miss. The breakout sessions.\n You’ll find a diverse array of these sessions scattered throughout all three days. We’ll highlight a few here, and be sure to check out all of them in the  Disrupt 2021 agenda.\n Startup Pitch Feedback Sessions: You’ll find 10 of these scheduled over three days. Make time to watch and learn as all the startups exhibiting in Startup Alley pitch and hear feedback from TC staff. You’re sure to pick up tips to improve your own pitch.\n You Complete Me: In the age of the composable ecosystems, we’re all partners now – from frenemies to pure collaborations. So why is now the right time to invite friends and challengers to the table? The truth is we have to build for an unknown future, with a shared strategy and value outcome. Join us to discover five ways to encourage more symbiotic relationships in the platform economy. Presented by Elliott Limb, chief customer officer at Mambu.\n Hacking U.S. Healthcare: Few things conjure more negative emotions than navigating medical billing; Americans urgently need solutions that prioritize their needs, decrease costs and elevate the patient journey so they can focus on getting care. Digital innovation can provide exceptional patient experiences that remove friction for payers, providers and consumers. Hear how Cedar, a digital-health unicorn, engineered a consumer-first digital platform that’s revolutionizing the financial experience for the entire healthcare industry. Presented by Cedar.\n  Taking Care of the Next Generation: KiwiCo empowers kids to explore, create and learn with hands-on kits. Mirvie provides a personalized window into pregnancy for early detection and intervention. Grove is committed to a plastic-free future with its line of eco-friendly beauty, home and lifestyle products. Hear from the exceptional leaders of these three companies about their mission to create a better world now and for future generations, building movements and communities, and the milestones in getting to escape velocity. Presented by Mayfield.\n TechCrunch Disrupt 2021 is where you need to be on September 21-23. Why not be there for less than $100?  Buy an early-bird pass before  the deal expires tonight  at 11:59 pm (PT).\n Is your company interested in sponsoring or exhibiting at Disrupt 2021? Contact our sponsorship sales team by   filling out this form.", "posttime": "2021-08-07 00:22:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "techcrunch,increase,disrupt", "title": "今晚所有 TechCrunch Disrupt 2021 通行证的价格都会上涨", "title_en": "\n\t\t\t\tPrices increase tonight on all TechCrunch Disrupt 2021 passes\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/prices-increase-tonight-on-all-techcrunch-disrupt-2021-passes/", "via": "", "real_tags": ["increase", "disrupt"]}, {"category": "", "categoryclass": "", "imagename": "ce1bb4ff2971d89f10a536623322e1b4.jpg", "infoid": 1071794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据最新公开的法庭文件，谷歌考虑收购 Epic Games，因为两家公司就 Epic 的 Fortnite Android 应用程序展开了争论。昨晚，谷歌取消了 Epic 对谷歌的反垄断投诉中的一些删节，Epic 上个月对其进行了修改和重新提交。投诉仍然省略了许多关于谷歌与特定公司交易的细节，但新的细节反映了谷歌内部关于 Android 平台竞争的沟通。 Epic 声称谷歌计划通过通过其他渠道分发 Fortnite 来回避谷歌的官方 Play 商店佣金，并且在一个未编辑的部分中，它引用了一份谷歌内部文件，称 Epic 的计划是威胁谷歌的“传染病”。以下是 Epic 对这种情况的描述：谷歌甚至与业务合作伙伴分享其垄断利润，以确保他们同意排除竞争，开发了一系列内部项目来解决它从 Epic 和其他人为消费者和开发商提供有竞争力的替代品，甚至考虑购买部分或全部 Epic 以消除这种威胁。讨论这种可能性的内部消息仍然保密，投诉并未表明谷歌曾就这些计划与 Epic 接触过。它还没有给出讨论的时间表——尽管它可能发生在 Epic 于 2018 年开始计划在 Android 上推出 Fortnite 之后。 Epic 还声称谷歌向其提供了在 Play 商店推出 Fortnite 的“特别优惠”。在另一个未密封的部分，投诉描述了一位 Google Play 经理就其侧载 Fortnite 的计划与 Epic 联系——并且显然承认侧载在这个过程中是一种“坦率地糟糕”的体验。一位经理联系了 Epic 的副总裁兼联合创始人，以评估 Epic 对一项特殊交易的兴趣，并讨论了通过直接下载“在 Android 上获得 Fortnite 的体验”。经理的通话记录指出，她认为直接下载 Fortnite 是“坦率地说是糟糕透顶的”和“糟糕的体验”，并且 Epic 应该“担心大多数人不会通过 15 个以上的步骤”。另一部分说，“工作人员在内部承认，谷歌对希望直接下载的消费者施加的困难导致了‘[p]糟糕的用户体验’，因为有 15 个以上的步骤来获得应用 [通过侧载] vs Play 或 iOS 上的 2 个步骤。&#39;”\n总体而言，“谷歌明白，它为直接下载设置的无数障碍具有保护其应用分发垄断地位和限制开发人员分发应用的能力的效果，”Epi​​c 在其投诉中称。在一份名为“对 Epic 的回应”的内部文件中，一位谷歌员工解释说，与直接下载相关的“安装摩擦”对用户来说“不仅是一种糟糕的体验”，而且谷歌“从其数据中知道它将极大地限制 [Epic 的] 抵达”。该文件继续解释说，“[f]uture [Fortnite] 更新将受到挑战：定位，通过网络更新体验”；直接下载方法“与恶意应用程序最相关”，这将“与 [Epic 的] 品牌/人口统计数据不兼容”；并且“[t] 他的方法会造成严重的用户混淆，因为 [Google Play] 仍然会吸引 [数十亿] 用户，他们将搜索 Fortnite 并遇到不清楚如何解决的死胡同”。 Epic 的诉讼最近与针对谷歌的更大的州反垄断投诉有关。与 Epic 一样，一组州检察长声称 Android 的开放程度远低于谷歌声称的那样，称其削减故意设置障碍——包括 Android 手机功能和与手机制造商的交易——以限制第三方应用商店并阻止直接下载应用。谷歌还删除了州投诉中的一些删节，主要涉及其对 Android 工作原理的内部描述。例如，在 2017 年关于亚马逊 App Store 的演讲中，谷歌显然指出，“如果我们说实话，我们会承认大多数用户和开发者并没有有意识地‘选择’他们使用默认设置。”在 2019 年，它将 Apple 和 Android 称为“新的封闭互联网生态系统”，“通过应用商店集中分发内容……[和] 通过应用商店服务进行支付”——尽管这些言论的大背景尚不清楚。谷歌强烈否认了这两起诉讼中的指控。 “开放的 Android 生态系统让开发者可以通过多个应用商店分发应用。对于选择使用 Play 商店的游戏开发商，我们有一致的政策，对开发商公平，并确保商店对用户的安全，”它在之前对 Epic 修改后的文件的评论中说。 “虽然 Fortnite 在 Android 上仍然可用，但我们不能再在 Play 上提供它，因为它违反了我们的政策。我们将继续为这些毫无根据的指控辩护。” Epic 去年对苹果和谷歌提起诉讼，因为它推出了新的 Fortnite 支付系统，回避了他们的支付系统和应用内购买佣金，导致两家公司将 Fortnite 踢出他们的移动商店。 （Fortnite 仍可通过侧载在 Android 设备上使用。）Epic 对 Apple 的诉讼于 5 月开始审理，目前正在等待法院的裁决。", "note_en": "Google considered buying Epic Games as the companies sparred over Epic’s  Fortnite Android app, according to  newly unsealed court filings. Last night, Google lifted some of its redactions in Epic’s antitrust complaint against Google, which  Epic amended and refiled last month. The complaint still omits many details about Google’s dealings with specific companies, but the new details reflect internal Google communications about competition on the Android platform.\n Epic claims Google was threatened by its plans to sidestep Google’s official Play Store commission by distributing  Fortnite through other channels, and in an unredacted segment, it quotes an internal Google document calling Epic’s plans a “contagion” threatening Google. Here’s Epic’s description of the situation:\n Google has gone so far as to share its monopoly profits with business partners to secure their agreement to fence out competition, has developed a series of internal projects to address the “contagion” it perceived from efforts by Epic and others to offer consumers and developers competitive alternatives, and has even contemplated buying some or all of Epic to squelch this threat.\n The internal messages discussing that possibility remain secret, and the complaint doesn’t indicate that Google ever reached out to Epic with these plans. It also doesn’t give a timeframe for the discussion — although it presumably happened after Epic started its plans to launch  Fortnite on Android in 2018.\n Epic has also alleged that Google offered it a “special deal” to launch  Fortnite on the Play Store. In another unsealed section, the complaint describes a Google Play manager reaching out to Epic about its plans to sideload  Fortnite — and apparently admitting that sideloading is a “frankly abysmal” experience in the process.\n One manager contacted Epic’s Vice President and Co-Founder to gauge Epic’s interest in a special deal and, among other things, discussed “the experience of getting  Fortnite on Android” via direct downloading. The manager’s call notes state that she viewed direct downloading  Fortnite as “frankly abysmal” and “an awful experience”, and that Epic should “worry that most will not go through the 15+ steps.”\n Another section says that “staff members have acknowledged internally that the difficulty Google imposes on consumers who wish to direct download leads to a ‘[p]oor user experience,’ in that there are ‘15+ steps to get app [via sideloading] vs 2 steps with Play or on iOS.’”\n Overall, “Google understands that the myriad barriers it erects to direct downloading have the effect of protecting its app distribution monopoly and limiting developers’ ability to distribute their apps,” Epic alleges in its complaint.\n In an internal document titled “Response to Epic”, a Google employee explained that the “install friction” associated with direct downloading was “not only a bad experience” for users but that Google knew “from its data that it will drastically limit [Epic’s] reach”. The document goes on to explain that “[f]uture [ Fortnite] updates will be challenged re: targeting, update experience via web”; that the direct downloading approach was “most associated with malicious apps”, which would be “incompatible with [Epic’s] brand/demographics”; and that “[t]he approach will create significant user confusion, since [Google Play] will still attract [billions] of users who will search for  Fortnite and run into deadends that aren’t clear how to resolve”.\n Epic’s lawsuit was recently linked with a much bigger  state antitrust complaint against Google. Like Epic, a group of state attorneys general alleges that Android is much less open than Google claims, saying it cuts create deliberate barriers — including Android phone features and deals with phone makers — to restrict third-party app stores and discourage downloading apps directly.\n  Google also removed some redactions in  the state complaints, mostly relating to its internal descriptions of how Android works. In a 2017 presentation about Amazon’s App Store, for instance, Google apparently noted that “if we were honest we would admit that most users and developers aren’t consciously ‘choosing’ they are going with the default.” And in 2019, it referred to Apple and Android as “new closed internet ecosystems” that “centralized content distribution via app stores… [and] payments via app store services” — although the larger context of those remarks isn’t clear.\n Google has strongly denied the claims in both suits. “The open Android ecosystem lets developers distribute apps through multiple app stores. For game developers who choose to use the Play Store, we have consistent policies that are fair to developers and keep the store safe for users,” it said in a previous comment on Epic’s amended filing. “While  Fortnite remains available on Android, we can no longer make it available on Play because it violates our policies. We will continue to defend ourselves against these meritless claims.”\n Epic filed lawsuits against both Apple and Google last year after it introduced a new  Fortnite payment system that sidestepped their payment systems and in-app purchase commissions, leading both companies to kick  Fortnite off their mobile stores. ( Fortnite is still available on Android devices via sideloading.) Epic’s case against Apple went to trial in May and is currently awaiting a ruling from the court.", "posttime": "2021-08-07 00:10:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,部分,considered,epic", "title": "法庭文件称，谷歌考虑在 Fortnite Clash 期间购买“部分或全部”Epic", "title_en": "Google Considered Buying 'Some or All' of Epic During Fortnite Clash, Court Documents Say", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22612921/google-epic-antitrust-case-court-filings-unsealed", "via": "", "real_tags": ["谷歌", "google", "部分", "epic"]}, {"category": "", "categoryclass": "", "imagename": "030c581db1a3f5232215dc728ae7d926.png", "infoid": 1071792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开源社区是当今存在的协作和工程的最纯粹表达。这就是为什么我们请来 Logz.io 的工程副总裁 Doron Gill 来回答我们关于开源安全性、实施以及开源工具堆栈最适合哪些公司的问题。 Dev Interrupted Discord 社区拥有 1200 多名成员，是工程领导者进行日常对话的最佳场所。不允许销售人员。加入社区&gt;&gt;", "note_en": "The open source community is the most pure expression of collaboration and engineering that exists today.\n That’s why we’ve brought in Doron Gill, the VP of Engineering at Logz.io, to answer our questions about open source security, implementation, and which companies an open source tool stack is perfect for.\n        With over 1200 members, the Dev Interrupted Discord Community is the best place for Engineering Leaders to engage in daily conversation. No sales people allowed.  Join the community &gt;&gt;", "posttime": "2021-08-07 00:09:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,source,社区", "title": "在贵公司使用开源工具", "title_en": "Using Open Source Tools at Your Company", "transed": 1, "url": "https://devinterrupted.com/podcast/using-open-source-tools-at-your-company/", "via": "", "real_tags": ["开源", "source", "社区"]}, {"category": "", "categoryclass": "", "imagename": "470bf92ebf06abc64e37927ea97a98df.png", "infoid": 1071791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Airyx 是一个新的开源 OS 项目，旨在在 x86-64 系统上提供类似的体验和与 macOS 的一些兼容性。它建立在 FreeBSD 的坚实基础、同一空间中现有的开源包以及填补空白的新代码之上。与 macOS 应用程序的源代码兼容性（即您可以在 Airyx 上编译一个 Mac 应用程序并运行它）类似的 GUI 隐喻和熟悉的 UX（文件管理器、应用程序启动器、反映打开应用程序的顶部菜单栏等）与 macOS 文件系统（HFS+ 和APFS) 和文件夹布局（/Library、/System、/Users、/Volumes 等）在文件夹或单个文件中的自包含应用程序和（主要）无安装程序的 /Applications 体验主要保持与 FreeBSD 基本系统的兼容性和 X11 - 引擎盖下的标准 Unix 环境 如果没有 Cirrus CI 对 CI/CD 和 Cloudsmith 对包托管的慷慨支持，这个项目是不可能实现的！感谢这些很棒的组织支持开源软件！", "note_en": "Airyx is a new open source OS project that aims to provide a similar experience and some compatibiilty with macOS on x86-64 sytems. It builds on the solid foundations of FreeBSD, existing open source packages in the same space, and new code to fill the gaps.\n    source compatibility with macOS applications (i.e. you could compile a Mac application on Airyx and run it)\n similar GUI metaphors and familiar UX (file manager, application launcher, top menu bar that reflects the open application, etc)\n compatible with macOS filesystems (HFS+ and APFS) and folder layouts (/Library, /System, /Users, /Volumes, etc)\n self-contained applications in  folders or a  single file and a (mostly) installer-less experience for /Applications\n mostly maintain compatibility with the FreeBSD base system and X11 - a standard Unix environment under the hood\n  This project would not be possible without the generous support of  Cirrus CI for CI/CD and  Cloudsmith for package hosting! Thanks to these awesome organizations for supporting open source software!", "posttime": "2021-08-07 00:08:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,类似,operating,应用程序", "title": "基于 FreeBSD 的类似 macOS 的操作系统", "title_en": "A macOS-like operating system based on FreeBSD", "transed": 1, "url": "https://github.com/mszoek/airyx", "via": "", "real_tags": ["操作系统", "类似", "operating", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071790, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "调度 BGP。 PeabodyInternet-DraftUpdates：4122（如果获得批准）K. DavisIntended status：Standard Track 26 April 2021Expires：28 October 2021 New UUID Formats draft-peabody-dispatch-new-uuid-format-01Abstract 本文档介绍了新的基于时间的 UUID 格式，这些格式是适合用作数据库密钥。现代应用程序的常见情况是创建唯一标识符以用作数据库表中的主键。该标识符通常实现一个嵌入式时间戳，该时间戳可以使用最高有效位中的单调创建时间进行排序。此外，标识符具有很强的抗冲突性，难以猜测，并提供最小的安全攻击面。现有的 UUID 版本（包括 UUIDv1）都没有以最有效的方式满足这些要求中的每一个。本文档是一份更新 [RFC4122] 的提案，使用三个新的 UUID 版本来解决这些问题，每个版本都有不同的权衡。本备忘录的状态 本互联网草案的提交完全符合 BCP 78 和 BCP 79 的规定。 Internet-Drafts 是 Internet Engineering Task Force (IETF) 的工作文件。请注意，其他组也可以将工作文档作为 Internet 草案分发。当前互联网草案的列表位于 https://datatracker.ietf.org/drafts/current/。 Internet-Drafts 是有效期最长为六个月的草稿文件，可以随时更新、替换或被其他文件淘汰。将互联网草案用作参考材料或引用它们而不是“正在进行的工作”是不合适的。此互联网草案将于 2021 年 10 月 28 日到期。版权声明 版权所有 (c) 2021 IETF Trust 和确定为文档作者的人员。版权所有。 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [Page 1] Internet-Draft new-uuid-format 2021 年 4 月 本文档受 BCP 78 和 IETF Trust 与 IETF 文档相关的法律规定的约束 ( https://trustee.ietf.org/ license -info) 在本文档发布之日生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文档中提取的代码组件必须包含 Trust Legal Provisions 第 4.e 节中所述的简化 BSD 许可文本，并且不提供如简化 BSD 许可中所述的保证。目录 1. 介绍 。 . . . . . . . . . . . . . . . . . . . . . . . 2 2. 背景。 . . . . . . . . . . . . . . . . . . . . . . . . 3 3. 变更概要。 . . . . . . . . . . . . . . . . . . . . 5 4. 格式。 . . . . . . . . . . . . . . . . . . . . . . . . . . 6 4.1.版本。 . . . . . . . . . . . . . . . . . . . . . . . 6 4.2.变体。 . . . . . . . . . . . . . . . . . . . . . . . . 6 4.3. UUIDv6 布局和位顺序。 . . . . . . . . . . . . . . 7 4.3.1. UUIDv6 时间戳用法。 . . . . . . . . . . . . . . 8 4.3.2. UUIDv6 时钟序列用法。 . . . . . . . . . . . . 8 4.3.3. UUIDv6 节点使用。 . . . . . . . . . . . . . . . . . 8 4.3.4. UUIDv6 基本创建算法。 . . . . . . . . . . 8 4.4. UUIDv7 布局和位顺序。 . . . . . . . . . . . . . . 10 4.4.1. UUIDv7 时间戳用法。 . . . . . . . . . . . . . . 11 4.4.2. UUIDv7 时钟序列用法。 . . . . . . . . . . . . 11 4.4.3. UUIDv7 节点使用。 . . . . . . . . . . . . . . . . . 11 4.4.4. UUIDv7 编码和解码。 . . . . . . . . . . . 11 4.5。 UUIDv8 布局和位顺序。 . . . . . . . . . . . . . . 16 4.5.1. UUIDv8 时间戳用法。 . . . . . . . . . . . . . . 18 4.5.2. UUIDv8 时钟序列用法。 . . . . . . . . . . . . 20 4.5.3. UUIDv8 节点使用。 . . . . . . . . . . . . . . . . . 20 4.5.4. UUIDv6 基本创建算法。 . . . . . . . . . . 21 5. 编码和存储。 . . . . . . . . . . . . . . . . . . . 24 6. 全球唯一性。 . . . . . . . . . . . . . . . . . . . . . 24 7. 分布式 UUID 生成。 . . . . . . . . . . . . . . . . 24 8. IANA 考虑因素。 . . . . . . . . . . . . . . . . . . . . 25 9. 安全考虑。 . . . . . . . . . . . . . . . . . . 25 10. 致谢。 . . . . . . . . . . . . . . . . . . . . . 25 11. 规范性参考文献。 . . . . . . . . . . . . . . . . . . . 25 12. 参考资料。 . . . . . . . . . . . . . . . . . . 26 作者的地址。 . . . . . . . . . . . . . . . . . . . . . . 27 1. 介绍关键词“必须”、“不得”、“要求”、“应该”、“不应该”、“应该”、“不应该”、“推荐”、“可以”和“可选”本文档中的内容将按照 [RFC2119] 中的描述进行解释。 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [Page 2] Internet-Draft new-uuid-format 2021 年 4 月 2. 背景 自 UUID 最初创建以来，很多事情都发生了变化。现代应用程序需要使用（并且许多已经实现）UUID 作为数据库主键。使用 UUID 作为数据库键的动机主要源于应用程序在本质上越来越分布式的事实。具有整数顺序的简单“自动增量”方案在分布式系统中不能很好地工作，因为在网络上同步这些数字所需的工作很容易成为负担。 UUID 可用于在分布式系统中创建唯一且合理的短值而无需同步，这一事实使它们成为此类环境中用作数据库键的良好候选者。然而，[RFC4122] UUID 的某些属性不太适合此任务。首先，大多数现有的 UUID 版本（例如 UUIDv4）的数据库索引局部性较差。这意味着连续创建的新值在索引中彼此不接近，因此需要在随机位置执行插入。其对用于此的常见结构（B 树及其变体）的负面性能影响可能是巨大的。因此，新插入的值应该按时间排序来解决这个问题。虽然 UUIDv1 确实包含嵌入式时间戳并且可以按时间排序； UUIDv1 还有其他问题。可以按时间对版本 1 UUID 进行排序，但这是一项费力的任务。该过程需要将 UUID 的字节分成不同的部分，重新​​排列位，然后根据重建的时间戳确定顺序。这在非常大的系统中效率不高。实现将通过排序顺序进行简化，其中 UUID 可以简单地视为不透明的字节序列并按顺序排序。在嵌入时间戳之后，其余 64 位本质上用于在全球范围内和给定时间戳记内提供唯一性。时钟序列值确保当为同一个时间戳值生成多个 UUID 时，会给出一个单调序列值。这种显式排序有助于进一步促进排序。剩余的随机位确保冲突最小。 Peabody &amp; Davis 将于 2021 年 10 月 28 日到期 [第 3 页] Internet-Draft new-uuid-format 2021 年 4 月 此外，UUIDv1 使用源自公历的非标准时间戳纪元。更具体地说，协调世界时 (UTC) 作为自 1582 年 10 月 15 日 00:00:00.00 以来的 100 纳秒间隔的计数。 epoch 或其他具有应用程序所需的各种时间戳精度级别的时间戳源。最后，在版本 1 UUID 的节点字段中使用 MAC 地址会引起隐私和网络安全问题。暴露的 MAC 地址可用作攻击面来定位机器并揭示有关此类机器的各种其他信息（最低限度是制造商，可能还有其他详细信息）。相反，“密码安全”伪随机数生成器 (CSPRNG) 或伪随机数生成器 (PRNG) 应该在应用程序上下文中使用，以提供唯一性和不可猜测性。由于到目前为止 UUIDv1 和 UUIDv4 细节的缺点，许多分布广泛的数据库应用程序和大型应用程序供应商都在寻求解决创建一个更好的基于时间、可排序的唯一标识符作为数据库键的问题。这导致在过去 10 多年中以略有不同的方式解决同一问题的大量实现。在准备本规范时，对以下 16 种不同的实现进行了分析，以了解总 ID 长度、位布局、词汇格式/编码、时间戳类型、时间戳格式、时间戳准确性、节点格式/组件、冲突处理和多时间戳记号生成序列的趋势。 1. [LexicalUUID] 来自 Twitter 2. [Snowflake] 来自 Twitter 3. [Flake] 来自 Boundary 4. [ShardingID] 来自 Instagram 5. [KSUID] 来自 Segment 6. [Elasticflake] 来自 P. Pearcy 7. [FlakeID] 来自T. Pawlak 8. [Sonyflake] 由 Sony 9. [orderedUuid] 由 IT。 Cabrera 10. [ COMBGUID] R. Tallent 11. [ ULID] A. Feerasta 12. [ SID] A. Chilton 13. [ pushID ] Google 14. [ XID ] O. Poitrey 15. [ ObjectID] MongoDB 16. [CUID] 由 E. Elliott Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [第 4 页] Internet-Draft new-uuid-format 2021 年 4 月 对这些实现的检查详细说明了以下有助于定义该标准的趋势： - 时间戳必须是k-可排序的。也就是说，相同时间戳内或接近相同时间戳的值通过排序算法正确排序。 - 时间戳应该是 big-endian，按原样嵌入时间的最重要位，无需重新排序。 - 时间戳应该使用毫秒精度和 Unix Epoch 作为时间戳源。虽然，根据应用程序要求，在实现之间存在一些变化。 - 在文本表示中，ID 格式应该是可按字典顺序排序的。 - ID 必须确保正确的嵌入顺序，以便在给定时间戳期间创建多个 UUID 时进行排序。 - ID 不得要求唯一的网络标识符作为实现唯一性的一部分。 - 分布式节点必须能够在不咨询集中资源的情况下创建抗冲突的唯一 ID。 3. 变更摘要 为了解决这些挑战，本规范引入了三个新版本标识符，分配给基于时间的 UUID。第一个 UUIDv6 旨在为已经实现 UUIDv1 的应用程序最容易实现。 UUIDv6 规范保留原始公历时间戳源，但不会按照 UUIDv1 使用的过程对时间戳位重新排序。 UUIDv6 还要求必须使用伪随机数据代替 MAC 地址。其余的 UUIDv1 格式在 UUIDv6 中保持不变。参见第 4.3 节 接下来，UUIDv7 引入了一种全新的基于时间的 UUID 位布局，它利用来自广泛实施和众所周知的 Unix Epoch 时间戳源的可变长度时间戳。时间戳被分解为一个 36 位整数部分，然后是一个可变长度的字段，它表示亚秒时间戳部分，编码以便从最高到最低有效的每一位都增加了更高的精度。请参阅第 4.4 节 最后，UUIDv8 引入了一种宽松的基于时间的 UUID 格式，以迎合无法使用 UUIDv1、UUIDv6 或 UUIDv7 的应用程序实现。 UUIDv8 还通过允许来自尚未定义的时间戳源的基于时间的 UUID 格式来验证该规范的未来。可变大小的时间戳提供了很大的灵活性来创建特定于实现的 RFC 兼容基于时间的 UUID，同时保留使 UUID 出色的属性。请参阅第 4.5 节 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [第 5 页] Internet-Draft new-uuid-format 2021 年 4 月 4. 格式 16 个八位字节（128 位）的 UUID 长度保持不变。由 8-4-4-4-12 格式的 36 个十六进制和破折号字符组成的 UUID 的文本表示保持不变，以提高人类可读性。此外，版本和变体位的位置在布局中保持不变。 4.1.版本 表 1 定义了在给定 UUID 中的第 48 位到第 51 位中找到的 4 位版本。 +------+------+------+------+-------+------- ------------+ | msb0 | msb1 | msb2 | msb3 |版本 |说明 | +------+------+------+------+-------+------- ------------+ | 0 | 1 | 1 | 0 | 6 |重新排序的公历| | | | | | |基于时间的 UUID | +------+------+------+------+-------+------- ------------+ | 0 | 1 | 1 | 1 | 7 |可变长度 Unix | | | | | | |基于纪元时间的 UUID | +------+------+------+------+-------+------- ------------+ | 1 | 0 | 0 | 0 | 8 |自定义基于时间 | | | | | | | UUID | +------+------+------+------+-------+------- ------------+ 表 1：本规范 4.2 定义的 UUID 版本。变体 本规范中 UUID 使用的变体位与 [RFC4122] 第 4.1.1 节相同。表 2 列出了变体字段的内容，第 64 位和第 65 位，其中字母“x”表示“无关”值。常见的十六进制值 8 (1000)、9 (1001)、A (1010) 和 B (1011) 频繁出现在文本表示中。 +------+------+------+---------------------------- -------------+ | msb0 | msb1 | msb2 |说明 | +------+------+------+---------------------------- -------------+ | 1 | 0 | × |本文档中指定的变体。 | +------+------+------+---------------------------- -------------+ 表 2：本规范定义的 UUID 变体 Peabody &amp; Davis 将于 2021 年 10 月 28 日到期 [第 6 页] Internet-Draft new-uuid-format 2021 年 4 月 4.3。 UUIDv6 布局和位顺序 UUIDv6 旨在通过重用 UUIDv1 中的大部分位布局来最容易实现，但更改了时间戳的位顺序。其中 UUIDv1 将时间戳位拆分为三个不同的部分，并将它们排序为 time_low、time_mid、time_high_and_version。 UUIDv6 而是保持时间戳中的源位完整，并将顺序更改为 time_high、time_mid 和 time_low。顺便说一句，这将匹配原始的 60 位格里高利时间戳源。时钟序列位在 [RFC4122] 中的用法和位置保持不变。 48 位节点必须设置为伪随机值。 16 字节、128 位 UUIDv6 的格式如图 1 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ -+-+-+-+-+-+-+-+-+ | time_high | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ | time_mid | time_low_and_version | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |clk_seq_hi_res | clk_seq_low |节点 (0-1) | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |节点 (2-5) | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ 图 1：UUIDv6 字段和位布局 time_high：60 位起始时间戳的最高 32 位。占用位 0 到 31（八位字节 0-3） time_mid：60 位起始时间戳的中间 16 位。占用第 32 至 47 位（八位字节 4-5） time_low_and_version：前四个最高有效位必须包含 UUIDv6 版本 (0110)，而其余 12 位将包含来自 60 位起始时间戳的最低有效 12 位。占用位 48 到 63（八位字节 6-7） clk_seq_hi_res：前两位必须设置为 UUID 变体 (10) 其余 6 位包含时钟序列的高位部分。占用第 64 位到第 71 位（八位字节 8） Peabody &amp; Davis 2021 年 10 月 28 日到期 [第 7 页]\nInternet-Draft new-uuid-format 2021 年 4 月 clock_seq_low：时钟序列的 8 位低部分。占用位 72 到 79（八位字节 9）节点：用作空间唯一标识符的 48 位伪随机数占用位 80 到 127（八位字节 10-15） 4.3.1。 UUIDv6 时间戳用法 UUIDv6 重用 60 位格里高利时间戳，精度为 100 纳秒，在 [RFC4122] 第 4.1.4 节中定义。 4.3.2. UUIDv6 时钟序列用法 UUIDv6 不会更改 [RFC4122] 第 4.1.5 节定义的时钟序列用法。 4.3.3. UUIDv6 节点使用 UUIDv6 节点位应该设置为 48 位随机或伪随机数。 UUIDv6 节点不应使用 IEEE 802 MAC 地址或 [RFC4122]，第 4.5 节生成随机多播 IEEE 802 MAC 地址的方法。 4.3.4. UUIDv6 基本创建算法 以下实现算法基于 [RFC4122]，但有特定于 UUIDv6 的更改： 1. 从系统范围的共享稳定存储（例如，文件）或全局变量中，读取 UUID 生成器状态：用于生成最后一个 UUID 的时间戳和时钟序列。 2. 获取自 1582 年 10 月 15 日 00:00:00.00 以来 100 纳秒间隔的 60 位计数的当前时间。 3. 将 time_low 字段设置为起始 60 位时间戳的 12 个最低有效位。 4. 将时间戳截断为 48 个最高有效位以创建 time_high_and_time_mid。 5. 将 time_high 字段设置为截断时间戳的 32 个最高有效位。 6. 将 time_mid 字段设置为截断时间戳的 16 个最低有效位。 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [第 8 页] Internet-Draft new-uuid-format 2021 年 4 月 7. 通过将 4 位 UUIDv6 版本与 12 位 time_low 连接来创建 16 位 time_low_and_version。 8. 如果状态不可用（例如，不存在或损坏）或时间戳大于当前时间戳，则生成随机的 14 位时钟序列值。 9. 如果状态可用，但保存的时间戳小于或等于当前时间戳，则增加时钟序列值。 10. 通过将时钟序列连接到在 16 位值中占据最重要位置的 UUID 变体位来完成 16 位时钟序列的高、低和保留创建。 11. 生成一个 48 位的伪随机节点。 12. 将每个部分的 128 位连接起来进行格式化：time_high|time_mid|time_low_and_version|variant_clk_seq|node 13. 将状态（当前时间戳和时钟序列）保存回稳定存储 将 time_high_and_time_mid 拆分为 time_high 和 time_mid 的步骤是可选的，因为time_high 和 time_mid 的 48 位将在最终连接期间保持与 time_high_and_time_mid 相同的顺序。在重用现有的 UUIDv1 实现时，这一额外的分割为最高有效 32 位和最低有效 16 位的步骤证明很有用。其中可以应用以下逻辑以最少的修改重新排列位。 +--------------+------+--------------+ | UUIDv1 字段 |位 | UUIDv6 字段 | +--------------+------+--------------+ |时间低 | 32 | time_high | +--------------+------+--------------+ | time_mid | 16 | time_mid | +--------------+------+--------------+ | time_high | 12 |时间低 | +--------------+------+--------------+ 表 3：UUIDv1 到 UUIDv6 字段映射 Peabody &amp; Davis 到期2021 年 10 月 28 日 [第 9 页] Internet-Draft new-uuid-format 2021 年 4 月 4.4。 UUIDv7 布局和位顺序 UUIDv7 格式旨在以任意亚秒级精度对 Unix 时间戳进行编码。 UUIDv7 提供的关键属性是由一个系统生成并由另一个系统解析的时间戳值保证具有生成器或解析器的子部分精度，以较小者为准。此外，解析 UUIDv7 值的系统不需要知道在编码期间使用了哪种精度才能正常运行。 16 字节、128 位 UUIDv6 的格式如图 2 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ -+-+-+-+-+-+-+-+-+ | unixt | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |unixts | subsec_a |版本 | subsec_b | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |var|潜艇……", "note_en": "dispatch BGP. PeabodyInternet-DraftUpdates:  4122 (if approved) K. DavisIntended status: Standards Track 26 April 2021Expires: 28 October 2021  New UUID Formats  draft-peabody-dispatch-new-uuid-format-01Abstract This document presents new time-based UUID formats which are suited for use as a database key. A common case for modern applications is to create a unique identifier for use as a primary key in a database table. This identifier usually implements an embedded timestamp that is sortable using the monotonic creation time in the most significant bits. In addition the identifier is highly collision resistant, difficult to guess, and provides minimal security attack surfaces. None of the existing UUID versions, including UUIDv1, fulfill each of these requirements in the most efficient possible way. This document is a proposal to update [ RFC4122] with three new UUID versions that address these concerns, each with different trade-offs.Status of This Memo This Internet-Draft is submitted in full conformance with the provisions of  BCP 78 and  BCP 79. Internet-Drafts are working documents of the Internet Engineering Task Force (IETF). Note that other groups may also distribute working documents as Internet-Drafts. The list of current Internet- Drafts is at  https://datatracker.ietf.org/drafts/current/. Internet-Drafts are draft documents valid for a maximum of six months and may be updated, replaced, or obsoleted by other documents at any time. It is inappropriate to use Internet-Drafts as reference material or to cite them other than as &#34;work in progress.&#34; This Internet-Draft will expire on 28 October 2021.Copyright Notice Copyright (c) 2021 IETF Trust and the persons identified as the document authors. All rights reserved. Peabody &amp; Davis Expires 28 October 2021 [Page 1]\n  Internet-Draft new-uuid-format April 2021 This document is subject to  BCP 78 and the IETF Trust&#39;s Legal Provisions Relating to IETF Documents ( https://trustee.ietf.org/  license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the  Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.Table of Contents  1. Introduction . . . . . . . . . . . . . . . . . . . . . . . .  2  2. Background . . . . . . . . . . . . . . . . . . . . . . . . .  3  3. Summary of Changes . . . . . . . . . . . . . . . . . . . . .  5  4. Format . . . . . . . . . . . . . . . . . . . . . . . . . . .  6  4.1. Versions . . . . . . . . . . . . . . . . . . . . . . . .  6  4.2. Variant . . . . . . . . . . . . . . . . . . . . . . . . .  6  4.3. UUIDv6 Layout and Bit Order . . . . . . . . . . . . . . .  7  4.3.1. UUIDv6 Timestamp Usage . . . . . . . . . . . . . . .  8  4.3.2. UUIDv6 Clock Sequence Usage . . . . . . . . . . . . .  8  4.3.3. UUIDv6 Node Usage . . . . . . . . . . . . . . . . . .  8  4.3.4. UUIDv6 Basic Creation Algorithm . . . . . . . . . . .  8  4.4. UUIDv7 Layout and Bit Order . . . . . . . . . . . . . . .  10  4.4.1. UUIDv7 Timestamp Usage . . . . . . . . . . . . . . .  11  4.4.2. UUIDv7 Clock Sequence Usage . . . . . . . . . . . . .  11  4.4.3. UUIDv7 Node Usage . . . . . . . . . . . . . . . . . .  11  4.4.4. UUIDv7 Encoding and Decoding . . . . . . . . . . . .  11  4.5. UUIDv8 Layout and Bit Order . . . . . . . . . . . . . . .  16  4.5.1. UUIDv8 Timestamp Usage . . . . . . . . . . . . . . .  18  4.5.2. UUIDv8 Clock Sequence Usage . . . . . . . . . . . . .  20  4.5.3. UUIDv8 Node Usage . . . . . . . . . . . . . . . . . .  20  4.5.4. UUIDv6 Basic Creation Algorithm . . . . . . . . . . .  21  5. Encoding and Storage . . . . . . . . . . . . . . . . . . . .  24  6. Global Uniqueness . . . . . . . . . . . . . . . . . . . . . .  24  7. Distributed UUID Generation . . . . . . . . . . . . . . . . .  24  8. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  25  9. Security Considerations . . . . . . . . . . . . . . . . . . .  25  10. Acknowledgements . . . . . . . . . . . . . . . . . . . . . .  25  11. Normative References . . . . . . . . . . . . . . . . . . . .  25  12. Informative References . . . . . . . . . . . . . . . . . . .  26 Authors&#39; Addresses . . . . . . . . . . . . . . . . . . . . . . .  27  1. Introduction The key words &#34;MUST&#34;, &#34;MUST NOT&#34;, &#34;REQUIRED&#34;, &#34;SHALL&#34;, &#34;SHALL NOT&#34;, &#34;SHOULD&#34;, &#34;SHOULD NOT&#34;, &#34;RECOMMENDED&#34;, &#34;MAY&#34;, and &#34;OPTIONAL&#34; in this document are to be interpreted as described in [ RFC2119]. Peabody &amp; Davis Expires 28 October 2021 [Page 2]\n  Internet-Draft new-uuid-format April 2021  2. Background A lot of things have changed in the time since UUIDs were originally created. Modern applications have a need to use (and many have already implemented) UUIDs as database primary keys. The motivation for using UUIDs as database keys stems primarily from the fact that applications are increasingly distributed in nature. Simplistic &#34;auto increment&#34; schemes with integers in sequence do not work well in a distributed system since the effort required to synchronize such numbers across a network can easily become a burden. The fact that UUIDs can be used to create unique and reasonably short values in distributed systems without requiring synchronization makes them a good candidate for use as a database key in such environments. However some properties of [ RFC4122] UUIDs are not well suited to this task. First, most of the existing UUID versions such as UUIDv4 have poor database index locality. Meaning new values created in succession are not close to each other in the index and thus require inserts to be performed at random locations. The negative performance effects of which on common structures used for this (B-tree and its variants) can be dramatic. As such newly inserted values SHOULD be time-ordered to address this. While it is true that UUIDv1 does contain an embedded timestamp and can be time-ordered; UUIDv1 has other issues. It is possible to sort Version 1 UUIDs by time but it is a laborious task. The process requires breaking the bytes of the UUID into various pieces, re- ordering the bits, and then determining the order from the reconstructed timestamp. This is not efficient in very large systems. Implementations would be simplified with a sort order where the UUID can simply be treated as an opaque sequence of bytes and ordered as such. After the embedded timestamp, the remaining 64 bits are in essence used to provide uniqueness both on a global scale and within a given timestamp tick. The clock sequence value ensures that when multiple UUIDs are generated for the same timestamp value are given a monotonic sequence value. This explicit sequencing helps further facilitate sorting. The remaining random bits ensure collisions are minimal. Peabody &amp; Davis Expires 28 October 2021 [Page 3]\n  Internet-Draft new-uuid-format April 2021 Furthermore, UUIDv1 utilizes a non-standard timestamp epoch derived from the Gregorian Calendar. More specifically, the Coordinated Universal Time (UTC) as a count of 100-nanosecond intervals since 00:00:00.00, 15 October 1582. Implementations and many languages may find it easier to implement the widely adopted and well known Unix Epoch, a custom epoch, or another timestamp source with various levels of timestamp precision required by the application. Lastly, privacy and network security issues arise from using a MAC address in the node field of Version 1 UUIDs. Exposed MAC addresses can be used as an attack surface to locate machines and reveal various other information about such machines (minimally manufacturer, potentially other details). Instead &#34;cryptographically secure&#34; pseudo-random number generators (CSPRNGs) or pseudo-random number generators (PRNG) SHOULD be used within an application context to provide uniqueness and unguessability. Due to the shortcomings of UUIDv1 and UUIDv4 details so far, many widely distributed database applications and large application vendors have sought to solve the problem of creating a better time- based, sortable unique identifier for use as a database key. This has lead to numerous implementations over the past 10+ years solving the same problem in slightly different ways. While preparing this specification the following 16 different implementations were analyzed for trends in total ID length, bit Layout, lexical formatting/encoding, timestamp type, timestamp format, timestamp accuracy, node format/components, collision handling and multi-timestamp tick generation sequencing. 1. [ LexicalUUID] by Twitter 2. [ Snowflake] by Twitter 3. [ Flake] by Boundary 4. [ ShardingID] by Instagram 5. [ KSUID] by Segment 6. [ Elasticflake] by P. Pearcy 7. [ FlakeID] by T. Pawlak 8. [ Sonyflake] by Sony 9. [ orderedUuid] by IT. Cabrera 10. [ COMBGUID] by R. Tallent 11. [ ULID] by A. Feerasta 12. [ SID] by A. Chilton 13. [ pushID] by Google 14. [ XID] by O. Poitrey 15. [ ObjectID] by MongoDB 16. [ CUID] by E. Elliott Peabody &amp; Davis Expires 28 October 2021 [Page 4]\n  Internet-Draft new-uuid-format April 2021 An inspection of these implementations details the following trends that help define this standard: - Timestamps MUST be k-sortable. That is, values within or close to the same timestamp are ordered properly by sorting algorithms. - Timestamps SHOULD be big-endian with the most-significant bits of the time embedded as-is without reordering. - Timestamps SHOULD utilize millisecond precision and Unix Epoch as timestamp source. Although, there is some variation to this among implementations depending on the application requirements. - The ID format SHOULD be Lexicographically sortable while in the textual representation. - IDs MUST ensure proper embedded sequencing to facilitate sorting when multiple UUIDs are created during a given timestamp. - IDs MUST NOT require unique network identifiers as part of achieving uniqueness. - Distributed nodes MUST be able to create collision resistant Unique IDs without a consulting a centralized resource.  3. Summary of Changes In order to solve these challenges this specification introduces three new version identifiers assigned for time-based UUIDs. The first, UUIDv6, aims to be the easiest to implement for applications which already implement UUIDv1. The UUIDv6 specification keeps the original Gregorian timestamp source but does not reorder the timestamp bits as per the process utilized by UUIDv1. UUIDv6 also requires that pseudo-random data MUST be used in place of the MAC address. The rest of the UUIDv1 format remains unchanged in UUIDv6. See  Section 4.3 Next, UUIDv7 introduces an entirely new time-based UUID bit layout utilizing a variable length timestamp sourced from the widely implemented and well known Unix Epoch timestamp source. The timestamp is broken into a 36-bit integer sections part, and is followed by a field of variable length which represents the sub- second timestamp portion, encoded so that each bit from most to least significant adds more precision. See  Section 4.4 Finally, UUIDv8 introduces a relaxed time-based UUID format that caters to application implementations that cannot utilize UUIDv1, UUIDv6, or UUIDv7. UUIDv8 also future-proofs this specification by allowing time-based UUID formats from timestamp sources that are not yet be defined. The variable size timestamp offers lots of flexibility to create an implementation specific RFC compliant time- based UUID while retaining the properties that make UUID great. See  Section 4.5 Peabody &amp; Davis Expires 28 October 2021 [Page 5]\n  Internet-Draft new-uuid-format April 2021  4. Format The UUID length of 16 octets (128 bits) remains unchanged. The textual representation of a UUID consisting of 36 hexadecimal and dash characters in the format 8-4-4-4-12 remains unchanged for human readability. In addition the position of both the Version and Variant bits remain unchanged in the layout.  4.1. Versions Table 1 defines the 4-bit version found in Bits 48 through 51 within a given UUID. +------+------+------+------+---------+-----------------------+ | Msb0 | Msb1 | Msb2 | Msb3 | Version | Description | +------+------+------+------+---------+-----------------------+ | 0 | 1 | 1 | 0 | 6 | Reordered Gregorian | | | | | | | time-based UUID | +------+------+------+------+---------+-----------------------+ | 0 | 1 | 1 | 1 | 7 | Variable length Unix | | | | | | | Epoch time-based UUID | +------+------+------+------+---------+-----------------------+ | 1 | 0 | 0 | 0 | 8 | Custom time-based | | | | | | | UUID | +------+------+------+------+---------+-----------------------+ Table 1: UUID versions defined by this specification  4.2. Variant The variant bits utilized by UUIDs in this specification remains the same as  [RFC4122], Section 4.1.1. The Table 2 lists the contents of the variant field, bits 64 and 65, where the letter &#34;x&#34; indicates a &#34;don&#39;t-care&#34; value. Common hex values of 8 (1000), 9 (1001), A (1010), and B (1011) frequent the text representation. +------+------+------+-----------------------------------------+ | Msb0 | Msb1 | Msb2 | Description | +------+------+------+-----------------------------------------+ | 1 | 0 | x | The variant specified in this document. | +------+------+------+-----------------------------------------+ Table 2: UUID Variant defined by this specification Peabody &amp; Davis Expires 28 October 2021 [Page 6]\n  Internet-Draft new-uuid-format April 2021  4.3. UUIDv6 Layout and Bit Order UUIDv6 aims to be the easiest to implement by reusing most of the layout of bits found in UUIDv1 but with changes to bit ordering for the timestamp. Where UUIDv1 splits the timestamp bits into three distinct parts and orders them as time_low, time_mid, time_high_and_version. UUIDv6 instead keeps the source bits from the timestamp intact and changes the order to time_high, time_mid, and time_low. Incidentally this will match the original 60-bit Gregorian timestamp source. The clock sequence bits remain unchanged from their usage and position in [ RFC4122]. The 48-bit node MUST be set to a pseudo-random value. The format for the 16-octet, 128-bit UUIDv6 is shown in Figure 1 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | time_high | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | time_mid | time_low_and_version | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ |clk_seq_hi_res | clk_seq_low | node (0-1) | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | node (2-5) | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ Figure 1: UUIDv6 Field and Bit Layout time_high: The most significant 32 bits of the 60-bit starting timestamp. Occupies bits 0 through 31 (octets 0-3) time_mid: The middle 16 bits of the 60-bit starting timestamp. Occupies bits 32 through 47 (octets 4-5) time_low_and_version: The first four most significant bits MUST contain the UUIDv6 version (0110) while the remaining 12 bits will contain the least significant 12 bits from the 60-bit starting timestamp. Occupies bits 48 through 63 (octets 6-7) clk_seq_hi_res: The first two bits MUST be set to the UUID variant (10) The remaining 6 bits contain the high portion of the clock sequence. Occupies bits 64 through 71 (octet 8) Peabody &amp; Davis Expires 28 October 2021 [Page 7]\n  Internet-Draft new-uuid-format April 2021 clock_seq_low: The 8 bit low portion of the clock sequence. Occupies bits 72 through 79 (octet 9) node: 48-bit pseudo-random number used as a spatially unique identifier Occupies bits 80 through 127 (octets 10-15)  4.3.1. UUIDv6 Timestamp Usage UUIDv6 reuses the 60-bit Gregorian timestamp with 100-nanosecond precision defined in  [RFC4122], Section 4.1.4.  4.3.2. UUIDv6 Clock Sequence Usage UUIDv6 makes no change to the Clock Sequence usage defined by  [RFC4122], Section 4.1.5.  4.3.3. UUIDv6 Node Usage UUIDv6 node bits SHOULD be set to a 48-bit random or pseudo-random number. UUIDv6 nodes SHOULD NOT utilize an IEEE 802 MAC address or the  [RFC4122], Section 4.5 method of generating a random multicast IEEE 802 MAC address.  4.3.4. UUIDv6 Basic Creation Algorithm The following implementation algorithm is based on [ RFC4122] but with changes specific to UUIDv6: 1. From a system-wide shared stable store (e.g., a file) or global variable, read the UUID generator state: the values of the timestamp and clock sequence used to generate the last UUID. 2. Obtain the current time as a 60-bit count of 100-nanosecond intervals since 00:00:00.00, 15 October 1582. 3. Set the time_low field to the 12 least significant bits of the starting 60-bit timestamp. 4. Truncate the timestamp to the 48 most significant bits in order to create time_high_and_time_mid. 5. Set the time_high field to the 32 most significant bits of the truncated timestamp. 6. Set the time_mid field to the 16 least significant bits of the truncated timestamp. Peabody &amp; Davis Expires 28 October 2021 [Page 8]\n  Internet-Draft new-uuid-format April 2021 7. Create the 16-bit time_low_and_version by concatenating the 4-bit UUIDv6 version with the 12-bit time_low. 8. If the state was unavailable (e.g., non-existent or corrupted) or the timestamp is greater than the current timestamp generate a random 14-bit clock sequence value. 9. If the state was available, but the saved timestamp is less than or equal to the current timestamp, increment the clock sequence value. 10. Complete the 16-bit clock sequence high, low and reserved creation by concatenating the clock sequence onto UUID variant bits which take the most significant position in the 16-bit value. 11. Generate a 48-bit psuedo-random node. 12. Format by concatenating the 128 bits from each parts: time_high|time_mid|time_low_and_version|variant_clk_seq|node 13. Save the state (current timestamp and clock sequence) back to the stable store The steps for splitting time_high_and_time_mid into time_high and time_mid are optional since the 48-bits of time_high and time_mid will remain in the same order as time_high_and_time_mid during the final concatenation. This extra step of splitting into the most significant 32 bits and least significant 16 bits proves useful when reusing an existing UUIDv1 implementation. In which the following logic can be applied to reshuffle the bits with minimal modifications. +--------------+------+--------------+ | UUIDv1 Field | Bits | UUIDv6 Field | +--------------+------+--------------+ | time_low | 32 | time_high | +--------------+------+--------------+ | time_mid | 16 | time_mid | +--------------+------+--------------+ | time_high | 12 | time_low | +--------------+------+--------------+ Table 3: UUIDv1 to UUIDv6 Field Mappings Peabody &amp; Davis Expires 28 October 2021 [Page 9]\n  Internet-Draft new-uuid-format April 2021  4.4. UUIDv7 Layout and Bit Order The UUIDv7 format is designed to encode a Unix timestamp with arbitrary sub-second precision. The key property provided by UUIDv7 is that timestamp values generated by one system and parsed by another are guaranteed to have sub-section precision of either the generator or the parser, whichever is less. Additionally, the system parsing the UUIDv7 value does not need to know which precision was used during encoding in order to function correctly. The format for the 16-octet, 128-bit UUIDv6 is shown in Figure 2 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | unixts | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ |unixts | subsec_a | ver | subsec_b | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ |var| subs\n......", "posttime": "2021-08-07 00:08:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "格式,formats,uuid", "title": "新的 UUID 格式——IETF 草案", "title_en": "New UUID Formats – IETF Draft", "transed": 1, "url": "https://datatracker.ietf.org/doc/html/draft-peabody-dispatch-new-uuid-format", "via": "", "real_tags": ["格式", "formats", "uuid"]}, {"category": "", "categoryclass": "", "imagename": "1880e1c3673a91c0ed2df58e790eaf80.jpg", "infoid": 1071789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "夏威夷檀香山一个国营帐篷城的无家可归者正在接受机器警犬扫描他们的眼睛。该市警方表示，这是检查 COVID-19 症状的更安全方法。但当地民权倡导者表示，使用名为 Spot 的机器人使檀香山一些最脆弱的居民失去人性。夏威夷美国公民自由联盟的法律主任 Jongwook Kim 说：“因为这些人无家可归，所以这样做被认为是可以的。” “在大流行结束后，它会在某个时候再次出现，用于其他一些用途”。今年早些时候，檀香山警察局社区外展部门的代理中尉约瑟夫·奥尼尔为该机器人的使用辩护。他说，它通过在避难所扫描人们的体温来保护官员、避难所工作人员和居民，在那里他们可以隔离并接受 COVID-19 检测。该机器人还用于远程采访病毒检测呈阳性的个人。\n“我们没有一个人说，&#39;这太可怕了，太令人担忧了，&#39;”奥尼尔说。 “我们不只是四处走动，随意扫描人”。警方使用这种机器人的情况仍然很少见，而且基本上未经测试——而且并不总是受到公众的欢迎。当当地新闻机构 Honolulu Civil Beat 透露 Spot 购买是用联邦救济资金进行时，檀香山官员面临强烈反对。去年年底，纽约警察局在将 Spot 涂成蓝色并将其重命名为“Digidog”后开始使用它。在纽约人开始在野外发现它并将视频发布到社交媒体之前，它几乎没有被注意到。 “这是一些机械战警的东西，这太疯狂了，”民主党国会议员贾马尔鲍曼 4 月份的反应是。在一段广为流传的视频显示，机器人与警察在曼哈顿一栋高层公共住宅大楼内对家庭暴力报告做出回应后，他是几位发表意见的纽约政客之一。几天后，经过民选市政府官员的进一步审查，该部门表示将终止租约并归还机器人。\n公职人员说，这台昂贵的机器几乎没有引起任何公众注意或解释，并被部署到已经过度监管的公共住房中。使用高科技犬也与 Black Lives Matter 呼吁取消警察行动和再投资于其他优先事项的呼吁发生冲突。在惨败之后，制造机器人波士顿动力公司的波士顿动力公司表示，它需要更好地向公众和几乎没有经验的客户解释这项技术。对于该公司的客户之一荷兰国家警察，解释这项技术包括强调 Spot 是一个非常好的机器人——行为端正，毕竟不是那么聪明。 “它不会为自己考虑，”荷兰国家警察特别行动组主任 Marjolein Smit 在谈到遥控机器人时说。 “如果你告诉它向左走，它就会向左走。如果你告诉它停下来，它就会停下来”。今年早些时候，她的警察部门将其机器人派往比利时边境附近一个致命的毒品实验室爆炸现场，以检查危险化学品和其他危害。根据波士顿动力公司的说法，其可接受的使用指南禁止 Spot 的武器化或任何违反隐私或民权法的行为，并表示这在道德上使檀香山警方处于明确状态。这都是该公司一年来努力的一部分，该公司过去依赖军事资金，使其机器人看起来更友好，从而更受地方政府和面向消费者的企业的欢迎。\n相比之下，一个鲜为人知的竞争对手，总部位于费城的 Ghost Robotics，对武器化没有疑虑，并将其类似狗的机器人供应给美国军队及其盟友的几个部门。 “它只是即插即用，你想要的任何东西，”Ghost Robotics 首席执行官吉伦·帕里克 (Jiren Parikh) 说，他批评波士顿动力公司的道德原则是“选择性道德”，因为该公司过去曾涉足军队。 Parikh 补充说，他的公司不会向警察部门销售其四足机器人，但他表示警察使用它们是有意义的。现在大约有 500 个 Spot 机器人。 Perry 说，公用事业公司通常使用它们来检查高压区和其他危险区域。 Spot 还用于监控建筑工地、矿山和工厂，配备工作所需的任何传感器。它仍然主要由人类控制，尽管他们所要做的就是告诉它往哪个方向走，它可以凭直觉爬楼梯或穿越崎岖的地形。它也可以自主运行，但前提是它已经记住了指定的路线并且没有太多的意外障碍。波士顿动力公司业务发展副总裁迈克尔佩里说：“大多数人在机器人身上看到的第一个价值是让一个人摆脱危险境地。”夏威夷 ACLU 的 Kim 承认，此类机器可能有许多合法用途，但表示为与人互动的警察机器人敞开大门可能不是一个好主意。\n他指出达拉斯警方在 2016 年如何将炸药粘在轮式机器人上以杀死一名狙击手，引发了关于警务和战争中“杀手机器人”的持续辩论。 “这些机器人有可能增加警察部门的军事化，并以不可接受的方式使用它，”金说。", "note_en": "Homeless residents of a state-run tent city in Honolulu, Hawaii, are having their eyes scanned by a robotic police dog.\n  Police in the city say it&#39;s a safer way to check for symptoms of COVID-19.\n But local civil rights advocates say the use of the robot – called Spot – dehumanises some of Honolulu&#39;s most vulnerable residents.\n   &#34;Because these people are houseless it’s considered OK to do that,” said Jongwook Kim, legal director at the American Civil Liberties Union of Hawaii. “At some point it will come out again for some different use after the pandemic is over&#34;.\n  Acting Lt. Joseph O’Neal of the Honolulu Police Department’s community outreach unit defended the robot’s use in a media demonstration earlier this year.\n He said it had protected officers, shelter staff and residents by scanning people’s body temperatures at a shelter where they could quarantine and get tested for COVID-19.\n  The robot is also used to remotely interview individuals who have tested positive for the virus.\n  &#34;We have not had a single person out there that said, ‘That’s scary, that’s worrisome,’&#34; O’Neal said. &#34;We don’t just walk around and arbitrarily scan people&#34;.\n Police use of such robots is still rare and largely untested — and hasn’t always gone over well with the public.\n  Honolulu officials faced a backlash when a local news organisation, Honolulu Civil Beat, revealed that the Spot purchase was made with federal relief money.\n  Late last year, the New York Police Department started using Spot after painting it blue and renaming it &#34;Digidog&#34;. It went mostly unnoticed until New Yorkers began spotting it in the wild and posting videos to social media.\n   &#34;This is some Robocop stuff, this is crazy,&#34; was the reaction in April from Democratic congressman Jamaal Bowman.\n  He was one of several New York politicians to speak out after a widely shared video showed the robot strutting with police officers responding to a domestic-violence report at a high-rise public housing building in Manhattan.\n Days later, after further scrutiny from elected city officials, the department said it was terminating its lease and returning the robot.\n The expensive machine arrived with little public notice or explanation, public officials said, and was deployed to already over-policed public housing. Use of the high-tech canine also clashed with Black Lives Matter calls to defund police operations and reinvest in other priorities.\n In the aftermath of the fiasco, Boston Dynamics, the company that makes the robots, Boston Dynamics, said it needed to do a better job of explaining the technology to the public and customers who have had little experience with it.\n   For the Dutch national police, one of the company’s customers, explaining the technology includes emphasising that Spot is a very good robot — well-behaved and not so smart after all.\n &#34;It doesn’t think for itself,&#34; Marjolein Smit, director of the special operations unit of the Dutch national police, said of the remote-controlled robot. &#34;If you tell it to go to the left, it will go to the left. If you tell it to stop, it will stop&#34;.\n Earlier this year, her police division sent its robot into the site of a deadly drug lab explosion near the Belgian border to check for dangerous chemicals and other hazards.\n According to Boston Dynamics, its acceptable use guidelines prohibit Spot’s weaponisation or anything that would violate privacy or civil rights laws, which it said puts the Honolulu police in the clear ethically.\n It&#39;s all part of a year-long effort by the company, which in the past relied on military funding, to make its robots seem friendlier and thus more palatable to local governments and consumer-oriented businesses.\n   By contrast, a lesser-known rival, Philadelphia-based Ghost Robotics, has no qualms about weaponisation and supplies its dog-like robots to several branches of the US military and its allies.\n &#34;It’s just plug and play, anything you want,&#34; said Ghost Robotics CEO Jiren Parikh, who was critical of Boston Dynamics’ stated ethical principles as &#34;selective morality&#34; because of the company’s past involvement with the military.\n Parikh added that his company doesn’t market its four-legged robots to police departments, though he said it would make sense for police to use them.\n  There are roughly 500 Spot robots now in the wild. Perry said they&#39;re commonly used by utility companies to inspect high-voltage zones and other hazardous areas. Spot is also used to monitor construction sites, mines and factories, equipped with whatever sensor is needed for the job.\n It’s still mostly controlled by humans, though all they have to do is tell it which direction to go and it can intuitively climb stairs or cross over rough terrain. It can also operate autonomously, but only if it’s already memorised an assigned route and there aren’t too many surprise obstacles.\n  &#34;The first value that most people see in the robot is taking a person out of a hazardous situation,&#34; Michael Perry, vice president of business development at Boston Dynamics, said.\n Kim, of the ACLU in Hawaii, acknowledged that there might be many legitimate uses for such machines, but said opening the door for police robots that interact with people is probably not a good idea.\n He pointed to how Dallas police in 2016 stuck explosives on a wheeled robot to kill a sniper, fueling an ongoing debate about &#34;killer robots&#34; in policing and warfare.\n &#34;There’s the potential for these robots to increase the militarization of police departments and use it in ways that are unacceptable,&#34; Kim said.", "posttime": "2021-08-07 00:07:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无家可归者,police,机器人", "title": "扫描无家可归者的机器警犬引发争论", "title_en": "Robot police dog that scans homeless people sparks debate", "transed": 1, "url": "https://www.euronews.com/next/2021/08/06/a-useful-tool-or-dehumanising-robot-police-dog-that-scans-homeless-people-sparks-debate", "via": "", "real_tags": ["无家可归者", "police", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "3d863a480c1ee82d9506cf7018535628.jpg", "infoid": 1071788, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在互联网速度测试方面，Ookla 的 Speedtest 是黄金标准。因此，当 Ookla 检查 Starlink 及其卫星互联网竞争对手 HughesNet 和 Viasat 的数据时，它得出的数字很有意义。不出所料，Ookla 发现 Starlink 轻而易举地击败了 HughesNet 和 Viasat。该公司发现，“Starlink 是美国唯一一家拥有类似固定宽带的延迟数据的卫星互联网提供商，并且中值下载速度足以满足现代在线生活的大部分需求，在2021 年第二季度。HughesNet 以 19.73 Mbps 位居第二，Viasat 以 18.13 Mbps 位居第三。”至于延迟，从您通过 Internet 开始活动到收到回复之间的时间，它甚至不是竞争。 Starlink 的中位延迟为 45 毫秒 (ms)，接近固定宽带的 14 毫秒。低延迟对于语音和视频通话、游戏和直播内容流至关重要。相比之下，630 毫秒的 Viasat 和 724 毫秒的 HughesNet 几乎无法用于这些目的。为什么会有如此巨大的差异？这是简单的物理学。除非我们得到量子网络，否则我们的网络速度无法超过光速。 Starlink 使用低地球轨道 (LEO) 卫星星座，以相对较近的 550 至 1,200 公里 (km) 在我们上方飞行，而 HughesNet 和 Viasat 的地球同步轨道高得多，约为 35,000 公里。当然，即使是 Starlink 也不如电缆或光纤互联网那么快。据 Ookla 称，美国固定宽带的中位数为 115.22Mbps，延迟为 15 毫秒。但是，Starlink 从来没有打算在城市和郊区与地球上的互联网竞争。它旨在为居住在该国的人们提供另一种选择。我知道有人仍在使用——是的，我是认真的——拨号调制解调器和慢得像污垢一样的 DSL 连接，其速度一直下降到每秒千比特 (Kbps)。对于这些用户来说，星链显然是更好的选择。但是，Starlink 仍在推出中。这意味着某些地方有时会比其他地方获得更好的性能。 Ookla 发现排名第一的是阿拉巴马州摩根县的用户，速度为 168.30 Mbps，而落后超过 100 Mbps 的是印第安纳州麦迪逊县的居民。一般来说，由于目前 Starlink 卫星星座的设置方式，您住得越靠北，您的连接越好。但是，正如摩根县所表明的那样，这不是硬性规定。例如，在加拿大，Starlink 的平均下载速度为 86.92 Mbps，超过了该国固定宽带速度的中值 84.24 Mbps。\n在其他国家，例如法国、德国和英国，Starlink 的速度大大超过了地面互联网速度。在法国，Starlink 的下载速度为 139.39 Mbps，轻松超越了全国固定宽带平均速度 70.81 Mbps。与德国的差距更大。一位德国互联网用户可以期望看到 Starlink 的速度为 107.98 Mbps，而其在地球上的竞争对手的速度为 58.17 Mbps。在英国，不仅仅是在远离通常互联网提供商的苏格兰地区，Starlink 的 108.30 Mbps 比固定宽带 50.14 Mbps 空洞。当然，在所有情况下，Starlink 的延迟都会比其领土竞争对手慢。你无法击败物理学。您可能想知道 HughesNet 和 Viasat 如何保持业务发展。原因很简单。它们是许多国家镇上唯一的网络游戏。例如，在巴西，Viasat 的 60.30 Mbps 下载速度与固定宽带的 61.38 Mbps 相当。如果您住在乡村的坎波斯，您可以获得 Viasat，在那里您可能没有实际的选择。但是，尽管 Starlink 听起来不错，但其生产线仍远远落后于需求。例如，我还没有看到我的 Starlink 终端，我在大约六个月前订购了它。理论上，Starlink 将于 9 月在全球上市。在实践中，我并不指望它。 Starlink 适合所有人吗？不可以。但是，如果您生活在传统高速互联网无法到达的地方或一般互联网服务较差的地区，您会想要尝试使用它。一旦掌握，它显然是最好的卫星互联网服务。", "note_en": "When it comes to internet speed tests,  Ookla&#39;s  Speedtest is the gold standard. So when Ookla examined its data for  Starlink and its satellite internet rivals,  HughesNet and  Viasat, the numbers it comes up with are meaningful.\n     To no great surprise,  Ookla found Starlink beats HughesNet and Viasat handly. The company found that &#34;Starlink was the only satellite internet provider in the United States with fixed-broadband-like latency figures, and median download speeds fast enough to handle most of the needs of modern online life at 97.23 Megabits per second (Mbps) during Q2 2021. HughesNet was a distant second at 19.73 Mbps and Viasat third at 18.13 Mbps.&#34;\n As for latency, the time between when you start an activity over the internet and when you get a response back, it&#39;s not even a competition. Starlink&#39;s median latency, 45 milliseconds (ms) is close to fixed broadband&#39;s 14 ms. Low latency is vital for voice and video calling, gaming, and live content streaming. By comparison, Viasat, 630 ms, and HughesNet, 724 ms, are almost unusable for these purposes.\n Why was there such a huge difference? It&#39;s simple physics. Unless we ever get  quantum networking, we can&#39;t network faster than the speed of light. Starlink uses low earth orbit (LEO) satellite constellations, flying above us at a relatively close 550 to 1,200 kilometers (km), while HughesNet and Viasat have far higher geosynchronous orbits of about 35,000km.\n Of course, even Starlink isn&#39;t as fast as cable or fiber-based internet. According to Ookla, the median fixed-broadband in the US is 115.22Mbps with a latency of 15ms. But, Starlink was never meant to compete with Earth-bound internet in cities and suburbs. It&#39;s meant to offer an alternative to people living in the country. There I know people who are still using -- yes, I&#39;m serious -- dial-up modems and slow-as-dirt DSL connections with speeds that go all the way down to Kilobits per second (Kbps).\n For these users, Starlink is clearly the better choice. But, Starlink is still being rolled out. This means some places at some times get much better performance than others. Ookla found at the top were users in Morgan county, Alabama at 168.30 Mbps, while lagging more than 100 Mbps behind were the residents of Madison County, Indiana.\n Generally speaking, due to how the Starlink satellite constellations are currently set up, the farther North you live, the better your connection. But, as Morgan county shows, that&#39;s not a hard and fast rule. For example, in Canada Starlink&#39;s median download speed of 86.92 Mbps exceeded the country&#39;s median fixed broadband speed of 84.24 Mbps.\n   In other countries, such as France, Germany, and the United Kingdom Starlink&#39;s speed vastly beats terrestrial internet speeds. In France, Starlink&#39;s download speed 139.39 Mbps, easily outran the country-wide fixed broadband average speed of 70.81 Mbp. With Germany, the difference is even larger. A German internet user can expect to see a Starlink speed of 107.98 Mbps while its Earth-bound competitors come in at 58.17 Mbps. While in the UK, and not just in those areas of Scotland far away from the usual internet providers, Starlink&#39;s 108.30 Mbps beats fixed broadband, 50.14 Mbps, hollow. Of course, in all cases, Starlink&#39;s latency will be slower than its territorial competitors. You can&#39;t beat physics.\n You might be wondering how HughesNet and Viasat can stay in business. The reason for that is simple. They&#39;re the only internet game in town in many countries. For instance, in Brazil, Viasat&#39;s 60.30 Mbps download speed is comparable to fixed broadband&#39;s 61.38 Mbps. If you live in the campos, the countryside, you can get Viasat, where you may not have a practical alternative.\n But, while Starlink may sound wonderful, its manufacturing lines are still lagging far behind demand. I, for instance, have yet to see my Starlink Terminal and I ordered it almost six months ago.\n In theory,  Starlink will be available around the world by September. In practice, I&#39;m not counting on it.\n Is Starlink for everyone? No. But, if you live beyond the reach of conventional high-speed internet or areas with poor general internet service, you&#39;ll want to try to get it. Once in hand, it&#39;s clearly the best satellite internet service.", "posttime": "2021-08-07 00:07:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卫星,satellite,starlink", "title": "Starlink 比卫星和 DSL 好，但不如光纤或电缆快", "title_en": "Starlink is better than satellite and DSL but not as fast as fiber or cable", "transed": 1, "url": "https://www.zdnet.com/article/starlink-is-better-than-its-satellite-competition-but-not-as-fast-as-landline-internet/", "via": "", "real_tags": ["卫星", "satellite", "starlink"]}, {"category": "", "categoryclass": "", "imagename": "3c039aa2326c56d4766bba35777c9890.jpg", "infoid": 1071786, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但河马的衰退似乎不是它自己造成的。 Lemonade 是另一家美国新保险公司——尽管更专注于租赁保险——本周早些时候公布的第二季度业绩略好于预期。报告发布后，柠檬水的价值大幅下跌，似乎拖累了河马。交易波动本身很有趣，但更重要的是，几家新保险公司的价值下跌是更大趋势的一部分。本周的下跌并不令人意外——最近几个季度，市场对技术支持的保险提供商进行了负面重新定价，对于以前受到公众投资者热烈关注的类别来说，这可能是一种令人不安的情况。在这个时刻，我们通常会反复讨论公共新保险公司的新价值，并使用这些数据来猜测价格下跌对相关初创公司可能意味着什么。获取公开市场数据并使用它来更好地了解私人市场几乎是本专栏的全国消遣。今天不行。相反，我们将研究新保险公司之间有趣的动态，这对我们对私人市场的理解可能更重要。也就是说，我们可以命名和跟踪的领域中的参与者通常现金充裕而市场情绪不佳。公开市场正在削减新保险股的价值，但估值下降背后的公司却相当富有。这使得他们的企业价值比您快速浏览一下他们的市值数据所猜测的要小。但 Lemonade 或 Hippo 真的关心股票市场从一个季度到下一个季度决定他们的业务价值正负 10% 吗？无论如何，他们是否有足够的现金来追求他们的长期愿景？让我们拆开所有数字，讨论本周早些时候 The Exchange 与 Hippo 首席执行官 Assaf Wand 进行的一次采访，并考虑 Lemonade 在其财报电话会议上所说的话。", "note_en": "But Hippo’s declines don’t appear to be of its own doing. Lemonade, another U.S. neoinsurance player — albeit one more focused on rental coverage — posted slightly  better-than-expected Q2 results earlier in the week. After its report, Lemonade’s value dropped sharply, and it appears it dragged Hippo down with it.\n     The trading volatility is interesting on its own, but what matters more is that the drop in the value of several neoinsurance companies is part of a larger trend. This week’s declines are not incredibly surprising — the market has negatively repriced tech-enabled insurance providers in recent quarters, which can be an uncomfortable situation for a category that previously basked in warm attention from public investors.\n At this juncture, we’d typically riff on the new values of public neoinsurance companies and use that data to work our way into a guess concerning what the price declines might mean for related startups. Taking public-market data and using it to better understand private markets is pretty much the national pastime of this column.\n Not today. Instead, we’re going to look into an interesting dynamic among neoinsurance companies that may matter a bit more for our comprehension of the private markets. Namely that the players in the space that we can name and track are generally cash-rich and market-sentiment poor.\n Public markets are cutting the value of neoinsurance stocks, but the companies behind the valuation declines are rather wealthy. This makes their enterprise values smaller than you might guess from a quick glance at their market cap figures. But do Lemonade or Hippo really care if the stock market decides from one quarter to the next that their businesses are worth plus or minus 10%? Do they have enough cash to pursue their long-term visions, regardless?\n Let’s unpack all the numbers, discuss an interview The Exchange held with Hippo CEO Assaf Wand earlier in the week and consider what Lemonade had to say during its earnings call.", "posttime": "2021-08-06 23:23:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科技,cash,价值", "title": "大量现金和少量爱：一个保险科技的故事", "title_en": "\n\t\t\t\tA lot of cash and little love: An insurtech story\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/a-lot-of-cash-and-little-love-an-insurtech-story/", "via": "", "real_tags": ["科技", "cash", "价值"]}, {"category": "", "categoryclass": "", "imagename": "344be08c224ad0e2e0491c3d9a131ddb.jpg", "infoid": 1071785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果昨天正式宣布了今年晚些时候将推出的一系列新功能，称为儿童扩展保护。新功能包括对 iMessage 中敏感图像的保护、针对儿童性虐待材料 (CSAM) 内容的 iCloud 照片扫描，以及 Siri 和搜索的新知识。在分发给参与该项目的团队并由 9to5Mac 获得的内部备忘录中，Apple 承认围绕新功能存在“误解”，但加倍坚信这些功能是保护儿童安全的“重要使命”的一部分.苹果公司在这些功能方面面临大量阻力，包括来自爱德华斯诺登和电子前沿基金会等知名人士的阻力。批评主要集中在苹果计划扫描 iCloud 照片以检查儿童性虐待材料 (CSAM) 数据库是否匹配以及此类功能的潜在影响。这份备忘录于昨晚深夜分发并由 9to5Mac 获得，由 Apple 软件副总裁 Sebastien Marineau-Mes 撰写。 Marineau-Mes 表示，Apple 将继续“解释和详细说明这一儿童保护扩展套件中包含的功能”。 Marineau-Mes 写道，虽然 Apple 已经看到对这些新功能的“许多积极回应”，但它意识到“有些人对这些功能的工作方式存在误解”，并且“不少人担心其影响”。尽管如此，Marineau-Mes 对苹果公司的信念加倍强调，即这些是“保护儿童”的必要功能，同时也保持苹果公司“对用户隐私的深刻承诺”。今天标志着扩大儿童保护计划的正式公开揭幕，我想花点时间感谢你们每一个人在过去几年中的辛勤工作。如果没有你们的不懈奉献和弹性，我们就不会达到这个里程碑。保护儿童安全是一项如此重要的使命。在真正的 Apple 时尚中，实现这一目标需要深入的跨职能承诺，涵盖工程、GA、HI、法律、产品营销和公关。我们今天宣布的是这种令人难以置信的合作的产物，它提供了保护儿童的工具，同时也保持了 Apple 对用户隐私的坚定承诺。\n我们今天看到了许多积极的回应。我们知道有些人有误解，而且有不少人担心其影响，但我们将继续解释和详细说明这些功能，以便人们了解我们构建的内容。虽然在接下来的几个月中需要付出很多努力才能交付这些功能，但我想分享我们今天从 NCMEC 收到的这篇笔记。我发现它令人难以置信的激励，希望你也能。备忘录还包括来自国家失踪和受虐儿童中心的信息，由战略合作伙伴关系执行董事玛丽塔罗德里格斯签署。 Apple 正在与 NCMEC 密切合作，开发新的 iCloud 扫描功能。以下是 NCMEC 发给 Apple 致力于这些功能的团队的笔记全文： 我想分享一份鼓励的笔记，说 NCMEC 的每个人都为你们每个人以及你们做出的令人难以置信的决定感到骄傲优先保护儿童的名称。看到您今天发布的内容（并在其中扮演了一个小角色），我们整个团队都非常振奋。我知道这是漫长的一天，你们中的许多人可能已经 24 小时没有睡觉了。我们知道，未来的日子里将充斥着少数人的尖叫声。我们帮助那些经历过最难以想象的虐待和受害的孩子的承诺将更加坚定。\n在这些漫长的白天和不眠之夜中，我希望您能够宽慰地知道，因为有您，数以千计的性剥削受害儿童将被解救，并获得治愈的机会和他们应得的童年。您如何看待 Apple 关于扩大儿童安全保护的公告？请在评论中告诉我们！您正在阅读 9to5Mac — 日复一日地发布有关 Apple 及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 9to5Mac 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道", "note_en": "Apple  yesterday officially announced a range of new features coming later this year, dubbed Expanded Protections for Children. The new features include protections for sensitive images in iMessage, iCloud Photo scanning for child sexual abuse material (CSAM) content, and new knowledge for Siri and Search.\n In an internal memo distributed to the teams that worked on this project and obtained by  9to5Mac, Apple acknowledges the “misunderstandings” around the new features, but doubles down on its belief that these features are part of an “important mission” for keeping children safe.\n  Apple has faced a significant amount of pushback for these features, including from notable sources such  as Edward Snowden and the  Electronic Frontier Foundation. The criticism centers primarily on Apple’s plans to scan iCloud Photos to check against a database of child sexual abuse material (CSAM) for matches and the  potential implications of such a feature.\n The memo, which was distributed late last night and obtained by  9to5Mac, was written by Sebastien Marineau-Mes, a software VP at Apple. Marineau-Mes says that Apple will continue to “explain and detail the features” included in this suite of Expanded Protections for Children.\n Marineau-Mes writes that while Apple has seen “many positive responses” to these new features, it is aware that “some people have misunderstandings” about how the features will work, and “more than a few are worried about the implications.” Nonetheless, Marineau-Mes doubles down on Apple’s belief that these are necessary features to “protect children” while also maintaining Apple’s “deep commitment to user privacy.”\n  Today marks the official public unveiling of Expanded Protections for Children, and I wanted to take a moment to thank each and every one of you for all of your hard work over the last few years. We would not have reached this milestone without your tireless dedication and resiliency.\n Keeping children safe is such an important mission. In true Apple fashion, pursuing this goal has required deep cross-functional commitment, spanning Engineering, GA, HI, Legal, Product Marketing and PR. What we announced today is the product of this incredible collaboration, one that delivers tools to protect children, but also maintain Apple’s deep commitment to user privacy.\n We’ve seen many positive responses today. We know some people have misunderstandings, and more than a few are worried about the implications, but we will continue to explain and detail the features so people understand what we’ve built. And while a lot of hard work lays ahead to deliver the features in the next few months, I wanted to share this note that we received today from NCMEC. I found it incredibly motivating, and hope that you will as well.\n The memo also includes a message from the National Center for Missing and Exploited Children, signed by Marita Rodriguez, executive director of strategic partnerships. Apple is working closely with NCMEC on the new iCloud scanning features.\n Here is the full text of the note from NCMEC sent to the team at Apple working on these features:\n I wanted to share a note of encouragement to say that everyone at NCMEC is SO PROUD of each of you and the incredible decisions you have made in the name of prioritizing child protection.\n It’s been invigorating for our entire team to see (and play a small role in) what you unveiled today.\n I know it’s been a long day and that many of you probably haven’t slept in 24 hours. We know that the days to come will be filled with the screeching voices of the minority.\n  Our commitment to lift up kids who have lived through the most unimaginable abuse and victimizations will be stronger.\n During these long days and sleepless nights, I hope you take solace in knowing that because of you many thousands of sexually exploited victimized children will be rescued, and will get a chance at healing and the childhood they deserve.\n What do you think of Apple’s announcements around expanded protections for child safety? Let us know down in the comments!\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-08-06 23:15:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,扫描,protect,功能", "title": "在一份内部备忘录中，苹果承认对其新照片扫描功能的担忧和“误解”，但表示有必要“保护儿童”", "title_en": "In an internal memo, Apple acknowledges concerns and “misunderstandings” about its new Photo scanning feature but says it is necessary to “protect children”", "transed": 1, "url": "https://9to5mac.com/2021/08/06/apple-internal-memo-icloud-photo-scanning-concerns/", "via": "", "real_tags": ["苹果", "apple", "扫描", "protect", "功能"]}, {"category": "", "categoryclass": "", "imagename": "17de85516057877941279fdf061d95a7.jpeg", "infoid": 1071783, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新西兰惠灵顿（美联社）——官方周五证实，谷歌联合创始人拉里佩奇已获得新西兰居留权，引发了关于极富人群是否可以购买进入这个南太平洋国家的辩论。新西兰移民局表示，佩奇于 11 月首次根据特殊签证申请居留权，该签证对至少有 1000 万新西兰元（700 万美元）的投资人开放。该机构在一份声明中说：“由于他当时在海外，由于 COVID-19 的限制，他的申请无法得到处理。” “一旦佩奇先生进入新西兰，他的申请就能够得到处理，并于 2021 年 2 月 4 日获得批准。”获得新西兰居留权不一定会影响佩奇在美国或任何其他国家的居留身份。新西兰立法者证实，佩奇和他的儿子于 1 月首次抵达新西兰，此前其家人提交了紧急申请，要求儿子因医疗紧急情况从斐​​济撤离。卫生部长安德鲁·利特尔 (Andrew Little) 在议会对立法者说：“收到申请后的第二天，由新西兰 ICU 护士护送的新西兰空中救护车将孩子和一名成年家庭成员从斐济送到新西兰。”在新西兰对非居民关闭边境以阻止冠状病毒传播的时候，很少有人回答佩奇是如何设法进入该国的。\n新西兰移民局指出，虽然佩奇成为居民，但他没有永久居留身份，仍受到某些限制。尽管如此，该机构在其网站上仍将“Investor Plus”签证吹捧为提供“新西兰生活方式”，并补充说“您可以将汽车、船只和家居用品带到新西兰，免收海关费用。”福布斯周五将佩奇列为全球第六大富豪，财富达 1170 亿美元。福布斯指出，佩奇于 2019 年卸任谷歌母公司 Alphabet 首席执行官一职，但仍是董事会成员和控股股东。反对党议员表示，这一事件引发了人们的疑问，即在许多急于进入新西兰的技术工人或离散家庭成员被拒之门外，佩奇为何如此迅速地获得批准。 “政府正在发出一个信息，即金钱比医生、水果采摘者和与孩子失散的家庭更重要，”ACT 副领导人 Brooke van Velden 在一份声明中说。 2017 年，硅谷亿万富翁彼得·泰尔（Peter Thiel）在六年前获得了新西兰公民身份，尽管他从未在新西兰生活过。在一位高级立法者认为他的创业技能和慈善事业对国家有价值之后，蒂尔获得了批准。泰尔甚至不必离开加利福尼亚参加仪式——他是在新西兰驻圣莫尼卡领事馆举行的私人仪式上获得公民身份的。", "note_en": "WELLINGTON, New Zealand (AP) — Google co-founder Larry Page has gained New Zealand residency, officials confirmed Friday, stoking debate over whether extremely wealthy people can essentially buy access to the South Pacific country.\n Immigration New Zealand said Page first applied for residency in November under a special visa open to people with at least 10 million New Zealand dollars ($7 million) to invest.\n “As he was offshore at the time, his application was not able to be processed because of COVID-19 restrictions,” the agency said in a statement. “Once Mr. Page entered New Zealand, his application was able to be processed and it was approved on 4 February 2021.”\n Gaining New Zealand residency would not necessarily affect Page’s residency status in the U.S. or any other nations.\n New Zealand lawmakers confirmed that Page and his son first arrived in New Zealand in January after the family filed an urgent application for the son to be evacuated from Fiji due to a medical emergency.\n  “The day after the application was received, a New Zealand air ambulance staffed by a New Zealand ICU nurse-escort medevaced the child and an adult family member from Fiji to New Zealand,” Health Minister Andrew Little told lawmakers in Parliament.\n Little was responding to questions about how Page had managed to enter the country at a time when New Zealand had shut its borders to non-residents in an attempt to stop the spread of the coronavirus.\n   Immigration New Zealand noted that while Page had become a resident, he didn’t have permanent residency status and remained subject to certain restrictions.\n Still, the agency on its website touts the “Investor Plus” visa as offering a “New Zealand lifestyle,” adding that “you may be able to bring your car, boat and household items to New Zealand, free of customs charges.”\n   Forbes on Friday ranked Page as the world’s sixth-wealthiest person, with a fortune of $117 billion. Forbes noted that Page stepped down as chief executive of Google’s parent company Alphabet in 2019 but remained a board member and controlling shareholder.\n Opposition lawmakers said the episode raised questions about why Page was approved so quickly at a time when many skilled workers or separated family members who were desperate to enter New Zealand were being turned away.\n “The government is sending a message that money is more important than doctors, fruit pickers and families who are separated from their children,” ACT deputy leader Brooke van Velden said in a statement.\n In 2017, it emerged that Silicon Valley billionaire Peter Thiel had been able to gain New Zealand citizenship six years earlier, despite never having lived in the country. Thiel was approved after a top lawmaker decided his entrepreneurial skills and philanthropy were valuable to the nation.\n Thiel didn’t even have to leave California for the ceremony — he was granted citizenship during a private ceremony held at the New Zealand Consulate in Santa Monica.", "posttime": "2021-08-06 23:14:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,创始人,founder,新西兰", "title": "谷歌创始人获得新西兰居留权，引发质疑", "title_en": "Google founder gets New Zealand residency, raising questions", "transed": 1, "url": "https://apnews.com/article/technology-lifestyle-travel-new-zealand-immigration-b7184a3296dea7c8c276232d615da0ac", "via": "", "real_tags": ["谷歌", "google", "创始人", "founder", "新西兰"]}, {"category": "", "categoryclass": "", "imagename": "88da2325b616b8d13d5b974739426981.jpg", "infoid": 1071782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该视频是关于非凡的 Casio AI-1000，它是 1989 年推出的支持 Lisp 编程语言的袖珍电脑。", "note_en": "This video is about the remarkable Casio AI-1000, a pocket computer from 1989 that supported the Lisp programming language.In this video I walk through its b...", "posttime": "2021-08-06 23:14:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,卡西欧,lisp,支持", "title": "1989 年的卡西欧 AI-1000 袖珍 Lisp 电脑", "title_en": "Casio AI-1000 Pocket Lisp Computer from 1989", "transed": 1, "url": "https://www.youtube.com/watch?v=H-yuZ2pejGU", "via": "", "real_tags": ["电脑", "卡西欧", "lisp", "支持"]}, {"category": "", "categoryclass": "", "imagename": "b9e77ced6d56d11b5ad6f5e0cac8cd7a.png", "infoid": 1071781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本文是 On Tech 时事通讯的一部分。您可以在此处注册以在工作日收到它。请保持你的嘘声。很难想象没有 YouTube 的互联网。在相对起步阶段购买视频网站是谷歌做过的最明智的事情之一。但在加入谷歌这一互联网历史上最成功的赚钱机器近 15 年之后，目前尚不清楚 YouTube 是否已经为自己和参与其庞大数字经济的每个人发挥了其财务潜力。两个数据点：YouTube 过去一年从销售广告（其主要收入来源）中获得的收入约为 112 亿美元，仅比拥有 CBS 电视的美国中端电视公司 ViacomCBS 的广告收入高不了多少网络。与 YouTube 相比，Twitter 的每个用户的平均广告销售额大约是 YouTube 的两倍。没有人应该对 YouTube 感到难过。是的，没关系。但它说明了互联网的活力，YouTube 可能是最具活力的在线经济体，仍然很难称其为不合格的金融赢家。如果 YouTube 没有赢，它的大量视频创作者也不会赢。互联网的巨大承诺是让任何人都可以通过做他们喜欢的事情谋生，但 YouTube 表明这个梦想是多么难以实现。如果 YouTube 没有达到很高的期望，那意味着互联网也没有。让我深入挖掘一下 YouTube 在一个重要方面的奇怪之处：它支付了一些在其虚拟货架上存放产品的人和公司的费用。在 Facebook、Instagram、TikTok、Snapchat 和 Twitter，我们免费制作他们的产品——除了一些例外——以我们愚蠢的模因、订婚派对的照片和我们发布的美容教程的形式。对于符合 YouTube 标准的视频制作者，该网站通常会将出现在视频中或视频周围的广告收入的 55% 交给这些人和组织。\n由于 YouTube 的收益分享和内容创作者从视频中赚钱的其他方式，它很可能为在线用户带来了比以往任何网站都多的收入。 （这是不可能证明的。人们确实通过在 Instagram 和 TikTok 等平台上建立受众来通过不太直接的方式赚钱，但 YouTube 仍然是人们在线赚取收入的首选地点。）也许是 YouTube，尤其是在多次披露之后几年前，公司的广告出现在宣传反犹太主义和其他可怕观点的视频中，与 Facebook 和 Twitter 等公司相比，在到处传播商业信息方面没有那么激进。这是一件好事，即使 YouTube 和视频制作商错失了赚取更多收入的机会。最终的结果是，YouTube 为自己和视频制作商赚了很多钱，其收入增长非常快，但相对于其规模和影响力而言，这个数字仍然有些微不足道。事实上，我什至在与中等电视公司 ViacomCBS 和 Twitter 的同一段落中提到了 YouTube ……嗯，这说明了一段时间以来 YouTube 的表现如何。 YouTube 削减的广告收入也不到 Netflix 年收入的一半。 （这些数字没有计算 YouTube 从其他来源获得的收入，包括订阅，该公司不会定期披露这些收入。）如果 YouTube 到目前为止还没有达到其财务潜力，那么这对数字世界的其他部分意味着什么？如果您阅读像我的同事 Taylor Lorenz 这样记录互联网劳动力的人的工作，很容易看出互联网经济的承诺与现实之间可能存在不匹配。有些人确实从他们在 YouTube 或其他应用程序上的创作中获得了不错的生活，但其他许多人却在不断地为花生而忙碌并筋疲力尽。在 TikTok 上制作舞蹈视频、在 Twitch 上直播视频游戏或主持 YouTube 脱口秀的人群中，很难脱颖而出，而创意行业一直都是这样。除了数字乐观主义者想要相信互联网会让任何人更容易、更民主地找到他们的粉丝和他们的电话。\n这就是 YouTube 的财务状况对我们其他人很重要的原因。如果 YouTube 还没有完全奏效，那么互联网的前景也不是。看电视应该很容易，但是GOOD GRACIOUS 在美国看我们想看的奥运会赛事并不简单。 《纽约时报》的消费者技术专栏作家 Brian X. Chen 向我们介绍了他的努力。我通过艰难的方式了解到，放弃有线电视的人仍然会陷入困境。本周，我试图观看奥运会攀岩比赛的重播。我对见到世界上最好的登山者 Adam Ondra 特别感兴趣。但是 NBC 在 YouTube TV 上提供的半决赛录音，我付费购买的在线电视频道捆绑，将攀登的报道缩减到只有一个小时。令我沮丧的是，该片段省略了 Ondra 的大部分广播时间。 （如果你想知道 Ondra 在周四的比赛中表现如何，请阅读本文。）我在 Twitter 上发布了一个尖刻的抱怨。我很快从我的追随者那里了解到，美国人在黄金时段电视或 YouTube TV 等服务上看到的奥运会报道远不如 NBC Sports 应用程序中更完整的奥运会赛事报道。我下载了 NBC Sports 应用程序，就在那里：每个事件的完整镜头！但我遇到了另一个问题。要使用该服务，我需要使用有线电视订阅的帐户信息登录该应用程序，但我没有。\n（Peacock 也有奥运会报道，Peacock 是一家与 NBC 属于同一家公司的视频流媒体服务。这令人困惑。）长话短说，剪线很棒。对于体育迷来说，在线观看现场比赛和赛事比过去容易得多。但是，拥有有线电视仍然是最佳选择。谁负担得起所有这些订阅？我们仍然没有弄清楚健康应用程序：纽约是美国第一个大型司法管辖区，餐厅、健身房和其他公共场所将要求客户提供针对冠状病毒的疫苗接种证明。我的同事 Erin Woo 和 Kellen Browning 研究电子系统对隐私的影响，以跟踪接种疫苗的人。 （其他国家也推出了数字疫苗验证系统。） Facebook 与学者：该公司表示，招募志愿者帮助研究 Facebook 上不透明的广告定位系统的研究人员正在威胁人们的隐私。彭博新闻说，Facebook 有一个有效的论点，学者们也是如此。还记得赛格威吗？不？确切地。一位前图书经纪人在 Slate 上写到他在过度炒作赛格威中所扮演的角色，这是 2001 年推出的一款新颖但最终不受欢迎的踏板车，它承诺改变世界，但并没有。这是关于不可能实现的梦想的压力如何破坏新产品的机会的有用教训。 1996 年民主党全国代表大会上的人群随着“Macarena”跳舞。这是令人痛苦的陈词滥调和美妙。我们希望收到你的来信。告诉我们您对本时事通讯的看法以及您希望我们探索的其他内容。您可以通过 ontech@nytimes.com 联系我们。\n如果您的收件箱中还没有收到此时事通讯，请在此处注册。您还可以阅读过去的 On Tech 专栏。", "note_en": "This article is part of the   On Tech newsletter . You can   sign up here  to receive it weekdays.\n  Please hold your boos. It’s hard to imagine the internet without YouTube. Buying the video site in its relative infancy was one of the smartest things Google ever did. But after nearly 15 years of being part of Google, the most successful money machine in internet history, it’s still not clear that YouTube has fulfilled its financial potential both for itself and everyone involved in its vast digital economy.\n Two data points: The money that YouTube keeps from selling advertisements — its main source of income — was about $11.2 billion in the past year, not much more than the ad revenue of ViacomCBS, a mid-tier American TV company that owns the CBS television network. Twitter, which is not so hot at money, pulls in roughly double the ad sales on average from each of its users compared with YouTube.\n No one should feel bad about YouTube. Yeah, it’s fine. But it says something about the vitality of the internet that YouTube is probably the most vibrant economy online and it’s still hard to call it an unqualified financial winner. And if YouTube isn’t winning, its masses of video creators also won’t be.\n The internet’s big promise was to give anyone a shot at making a living from doing what they love, but YouTube shows just how elusive that dream turned out to be. If YouTube isn’t quite living up to high hopes, that means the internet isn’t, either.\n Let me dig a little deeper into how odd YouTube is in one important respect: It pays some of the people and companies that stock its virtual shelves with products.\n At Facebook, Instagram, TikTok, Snapchat and Twitter, we make their products for free — with some exceptions — in the form of our silly memes, photos from engagement parties and beauty tutorials that we post. For video makers  that meet YouTube’s standards, the site typically hands over to those people and organizations about 55 percent of the money from ads that appear in or around their videos.\n Because of YouTube’s revenue sharing and  other ways for content creators to make money from videos, it most likely has delivered more income to people online than any internet site ever. (This is impossible to prove. People do  make money in less direct ways from building an audience on places like Instagram and TikTok, but YouTube remains a go-to spot for people to earn an income online.)\n Maybe YouTube, particularly after  revelations several years ago that companies’ advertisements were  appearing in videos that promoted anti-Semitism and other horrific views, has been less aggressive than companies like Facebook and Twitter about shoving commercial messages everywhere. This is a good thing, even if those are missed opportunities for YouTube and video makers to earn more money.\n The end result is that YouTube makes a lot of money for itself and video makers, and its revenue is growing very quickly, but the numbers remain kind of meh relative to its size and influence.\n The fact that I even mentioned YouTube in the same paragraph as the middling TV company ViacomCBS and Twitter … well, that says something about how YouTube  has underwhelmed for some time. YouTube’s cut of ad revenue is also less than half the size of Netflix’s yearly revenue. (Those figures don’t count YouTube’s income from other sources including subscriptions, which the company does not regularly disclose.)\n If YouTube has so far fallen short of its financial potential, what does that say about the rest of the digital world? If you read the work of people like my colleague  Taylor Lorenz, who chronicles the internet’s labor force, it’s easy to see that there may be a mismatch between the promise of the internet economy and the reality.\n Some people do earn a good living from their creations on YouTube or other apps, but many others are constantly hustling for peanuts and  burning out.\n It’s hard to stand out in the sea of people making dance videos on TikTok, livestreaming video games on Twitch or hosting YouTube talk shows, and it has always been that way for creative professions. Except digital optimists wanted to believe that the internet would make it easier and more democratic for anyone to find their fans and their calling.\n That’s why YouTube’s finances matter to the rest of us. If YouTube isn’t quite working out, then the promise of the internet isn’t, either.\n Watching TV should be easy, but GOOD GRACIOUS it’s not simple in the United States to watch the Olympics events we want to see.   Brian X. Chen , the consumer technology columnist for The New York Times, walks us through his efforts.\n I learned the hard way that people who ditch cable TV still get the short end of the stick.\n This week, I was trying to watch a replay of the rock climbing events at the Olympics. I was particularly interested in seeing  Adam Ondra, the world’s best climber.\n But the recording of the semifinals that NBC made available on YouTube TV, the online bundle of TV channels that I pay for, trimmed the climbing coverage to just one hour. To my frustration, the segment omitted most of Ondra’s airtime. ( Read this if you want to know how Ondra did in Thursday’s competition.)\n I posted a  snarky complaint on Twitter. I soon learned from my followers that the Olympics coverage that Americans see on prime-time television or stream on services like YouTube TV is vastly inferior to the more complete Olympics event coverage in the  NBC Sports app.\n I downloaded the NBC Sports app and there it was: full footage of each event! But I ran into another problem. To use the service, I needed to log into the app with account information for a cable TV subscription, which I don’t have.\n (There is also  Olympics coverage on Peacock, the video streaming service that’s part of the same company as NBC. It’s confusing.)\n Long story short, cord cutting is great. It’s far easier than it used to be for sports junkies to watch live games and events online. But it’s still optimal to have cable TV, too. Who can afford  all these subscriptions?\n We still haven’t figured out health apps: New York is the first large jurisdiction in the United States where restaurants, gyms and other public places will require that customers provide proof of vaccination against the coronavirus. My colleagues Erin Woo and Kellen Browning  look at the privacy implications of electronic systems to keep track of vaccinated people. (Other countries have also rolled out digital vaccine verification systems.)\n Facebook vs. academics: The company said that researchers who solicited volunteers to help study the opaque system of ad targeting on Facebook are threatening people’s privacy. Facebook has a valid argument, Bloomberg News  says, and so do the academics.\n Remember the Segway? No? Exactly. A former book agent writes in Slate about his role in  overhyping the Segway, a novel but ultimately unpopular scooter introduced in 2001 that promised to change the world and did not. It’s a useful lesson in how the pressure of impossible dreams can ruin the chances of a new product.\n  The crowd at the 1996 Democratic National Convention  danced to “Macarena.” It is painfully corny and wonderful.\n  We want to hear from you. Tell us what you think of this newsletter and what else you’d like us to explore. You can reach us at   ontech@nytimes.com.\n If you don’t already get this newsletter in your inbox,   please sign up here . You can also read   past On Tech columns .", "posttime": "2021-08-06 23:13:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube", "title": "YouTube 平淡无奇", "title_en": "YouTube Is Underwhelming", "transed": 1, "url": "https://www.nytimes.com/2021/08/05/technology/youtube-underwhelming.html", "via": "", "real_tags": ["youtube"]}, {"category": "", "categoryclass": "", "imagename": "bdc7eb71c914a4c2a49097e7ef224e51.jpg", "infoid": 1071780, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Starship 20 正准备在德克萨斯州 Starbase 的 Super Heavy Booster 4 上堆叠。助推器已经安装了所有 29 个猛禽引擎，而 Shi...", "note_en": "Starship 20 is being prepared for stacking atop Super Heavy Booster 4 at Starbase, Texas. The booster already has all 29 Raptor engines installed and the Shi...", "posttime": "2021-08-06 23:13:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "星舰,starship,引擎", "title": "现场直播：星舰原型船 20 被堆叠在超重型 [视频]", "title_en": "Live: Starship Prototype Ship 20 Being Stacked on Super Heavy [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=4B2_dfvRZ4M", "via": "", "real_tags": ["星舰", "starship", "引擎"]}]