[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1071812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8 月 4 日星期三晚上 6 点 30 分，我和 15 岁的女儿在萨斯喀彻温省里贾纳市 91 岁的妈妈家门前停了一辆捷豹 I-Pace 电动车。我又累又痛，因为我刚刚在两天内完成了 1,725 公里（1,072 英里）的驾驶，这是自 Covid 开始以来第一次见到她。我很高兴看到妈妈，对很长一段时间以来的第一次公路旅行感到高兴，也很高兴检验了 2021 年全电动汽车可以进行长途旅行的假设。这篇文章收集了这次旅行的数据并试图得出结论。还有一个实时的 Twitter 线程，上面有错别字和糟糕的图片。致我的非公制读者：对不起，它以公里为单位。我将转换一些关键数字。体验 · 实际上，这非常美妙。 Jaguar 是一款舒适的现代汽车，拥有舒适的座椅、出色的音响以及您所期望的所有自动化功能。当您遇到棘手的传球情况时，它具有令人敬畏的压倒性加速能力。我的女儿是优秀的公司。沿着一条好路巡航——很多横贯加拿大的高速公路都是这样——成为一种非常愉快的体验。最糟糕的部分是野火烟雾，它挡在我们和世界上一些最奇妙的风景之间。但这是气候危机加剧的一个症状，我们可以做的最好的事情之一就是停止燃烧化石燃料旅行。当然，这次公路旅行不同于以往的任何一次体验，因为充电。在化石汽车中，您不必思考，您只需等待油箱下降一半或四分之三，然后在下一站靠边停车。充电需要规划；幸运的是，这些工具还不错；更多关于下面的内容。充电器 · 我认为这个实验值得一试的一个原因是加拿大石油公司关于他们的电气公路计划的信息，我引用：“我们从哈利法克斯，NS 到维多利亚，BC 每 250 公里或更短的距离就有一个充电器”有一个不远的地方从我住在温哥华的地方开始，我尝试了它，它第一次只用信用卡水龙头就可以工作，不用大惊小怪。\n问题是，这句话有点像谎言。有间隙，那就是所有充电器都在工作的时候，而它们却经常不工作。但我的经验是，Petro-Can 虽然很好，但绝不是您唯一的充电选择。这里需要一些背景。 “大功率”快速直流充电器有多种功率等级：我看到有 50、100、200 和 350kW。差异产生差异。我们的 Jag 只能以 100 kW 的功率真正充电，但我个人的看法是，更高功率的充电器充满电的速度要快 20%。而且感觉很复杂；例如，根据我使用 Co-op Connect 充电器的经验，额定功率“仅”100kW，感觉更快。当你使用这些东西时，它们感觉就像第一代技术，推动了可能（或至少可维护）的边缘。特别是，当您将 350kW 充电器插入电池电量非常低的汽车时，一旦它完成同步并开始输送电子，声音就会像 747 起飞一样变大。并且这些装置包括多个高大的金属盒子（见下图）。此外，巨大的粗连接线摸起来非常热。无论如何，我对 Petro-Can 网络的印象大多是积极的。机器运转良好。令人讨厌的是，有些是 100 千瓦，有些是 200 千瓦，有些是 350 千瓦，原因不明。令人讨厌的是，有时它们会被卡在地段一个奇怪的肮脏的后角，这使得您的汽车很难找到正确的位置，以通过电线到达充电端口。但是，对他们很好。 Electrify Canada 是另一个承诺建立全国快速充电器网络的组织。他们是 Electrify America 的合作伙伴，由大众汽车建造，作为他们在排放测试中作弊的解决方案的一部分。不管怎样，也许有一天他们会很棒。一旦我的行程足够远，可以让 Petro-Can 完全解决问题，我试图找到一个处于工作状态的 Electrify 充电器，但失败了。如果您可以使用 50kW 充电器，那么有很多选择。许多小城镇游客中心和商会都安装了一个，我自己的电力公司 BC Hydro 也是如此。但是，一旦您使用了更高功率的充电器，它们就不是一种令人满意的体验。数字 · 下表中的每一行代表一个行驶段，并包括该段开始时的充电体验（因此在每天的初始段中不存在）。我认为列标题大多很明显，除了：\nkWh/h 是果汁量除以驾驶暂停时间。通常充电器会报告更少的时间，我把这归结为初始化延迟，所以我认为我使用了正确的值。这里的变化有点随机，因为它的速度在很大程度上取决于电池的电量。 km/ch 代表“每充电小时公里数”，估算每小时充电可行驶的里程数。我认为这是一个非常重要的数字。网络; “PC”是加拿大石油公司，“Flo”不是首字母缩写词，“Co-op”是 Co-op Connect。有两个数据来源：行驶时间数据来自捷豹通过其 Incontrol 应用程序的行程记录；因此，不收费的路边停车带来的尴尬。充电时间数据是沿途各个充电会话的输出。我确信两者都不是完美的，但根据我的经验，结果在正确的邻域中似乎很直观。让我们仔细看看我觉得有趣的数字。充电时间 · 17:42 行驶，6:24 充电（包括一天的行驶结束后的一晚充电）。从表面上看并不是那么好。现在，它显然可以更少；由于我对任何给定的充电器都能正常工作的信心一开始很弱，因此我小心翼翼地允许故障并且不会将电池电量耗尽。在旅行的后期，随着我获得信心（特别是在加拿大石油网络中），我愿意承担诸如 Calgary-to-Medicine Hat 腿之类的事情，2:43 和 285.9 公里，将电池从 90% 降低到11%。而且我的女儿毕竟是个十几岁的孩子，也许不像我在咖啡馆和洗手间等地方走来走去那么快。\n还要注意腿有点短；这辆车充一次电可以行驶400公里。但当您在一条几乎没有其他交通的宽阔现代草原高速公路上，以 110 公里/小时（65 英里/小时）或更高的速度连续爆破时，情况就不一样了。我想你会发现每辆电动汽车都是如此。但是，事情是这样的：感觉并不过分。我只记得我们有意识地挂着等待充电一共大概有十五分钟。大多数地方，我们喝了咖啡或午餐，去洗手间，为了我们的膝盖绕着街区走一圈，然后是时候拔掉插头走人了。话虽如此，这是一辆 2019 年的车型，充电技术正在改进。如果我们有一辆保时捷 Taycan 而只有 350kW 的充电器，情况就会大不相同。快充技术能否进入主流车价位面？ 350kW充电器会无处不在吗？我想知道。在这种情况下，还有一个我认为非常有趣的数字：“km/ch”，即充电一小时可以行驶多远。对于使用这种充电器选择的这辆特殊汽车，每小时充电超过 200 公里（124 英里）。我想这就够了？也许在足够低的地区，但在那里。最后，我怀疑每个驾驶安全专业人士都会欣然接受这样一种动力系统，这种动力系统迫使您每行驶几百公里就下车走动。 $$$ · 我们的电费为 120.52 美元。这是很多还是一点？我暂时认为他们收费不足。虽然电力本身相当便宜，但充电基础设施却不是。如果这行得通，充电网络将不得不赚钱，我看不到这些价格。请记住，在家里的车库里有 2 级充电器，充电感觉几乎是免费的。旅行可能不需要像网络目前所做的那样便宜。\n此外，按分钟收费似乎是错误的。我想有一个基于时间的组件可以防止慢速充电器一直吸收，但特别是在超大功率充电器上，保时捷 Taycan 每分钟将获得比5 岁的 Nissan Leaf，那么为什么他们要为相同的续航里程支付更少的费用呢？嗯嗯。 PlugShare · 如果你有一辆特斯拉，那么计划就少了，汽车知道增压器在哪里。如果您还有其他事情，您真的需要 PlugShare。这个领域有一些应用程序，但 PlugShare 最擅长向您展示带有所有充电器的地图，从而帮助您规划路线。它有效的原因是因为它是社交的；每当您到达充电站时，您都可以“办理登机手续”并留下一张便条，说明它是否正在工作以及充电速度有多快。这大大降低了卷到车站并发现它坏了的风险。我绝对认为没有它就不可能完成这次旅程。专业提示：当您计划在 PlugShare 上旅行时，请放入所有可能在旅途中使用的充电器。然后当你开车时，你可以查看你的剩余里程和即将到来的选择，大多数选择变得非常容易。它有一个有限但不错的 Android Auto 应用程序，我经常使用它。 （我也假设 CarPlay？） 未来 · 一个问题：充电器是否足够，还是太多？目前，答案可能是“太多了”。我真正担心的一件事是一瘸一拐地走进某个充电站，发现所有充电器都被占用了，不得不等一个小时才能开始。上图是我唯一一次见到其他人类；一对年轻夫妇带着四天大的 Mustang Mach-E，去坎卢普斯兜风。否则，我们访问的充电器没有生命迹象。有人花了很多钱来建造一种今天基本上没有使用的昂贵资源。话虽如此，任何对我们的未来抱有一丝乐观的人都必须相信，将会有更多的电池电动汽车问世。在加拿大西部边缘的卑诗省，我们拥有北美最高的电动汽车使用量，推动了 10% 的新车销量。当我们在坎卢普斯的大型 Petro-Can 站充电时，从两个位置很好的充电器走到咖啡店，我们经过了加油站，那里很大，至少有十几个泵和汽车排成一排为了所有人。到了某个时候，情况会翻转，偶尔会有供应商仍在销售汽油，但大多只是光滑、快速的充电器。我担心这个过程会有点痛苦，但我相信它会发生。所以我希望有人正在计划过渡。\n从现在开始，每个人都应该停止驾驶化石车辆。因为气候危机就在我们身边。我们现在无法阻止它，但如果我们削减碳排放，我们可以挽救生命并减少破坏。没有理由不这样做。我们拥有一辆 Nissan Leaf 并且很喜欢它；我们只将它用于城镇周围的短途旅行（这是我们开车的大部分时间）。一直困扰着我的一件事是：住在公寓和街边停车位的数百万人如何参与电动汽车革命？这对我来说一切都很好，谁可以在我的车库里过夜充电（尽管最近一些关于房屋被烧毁的故事让我有点担心。）看来这需要大量的基础设施投资才能基本上使充电器几乎像停车场一样米。要么是这样，要么给每周必须去指定充电区 2 或 3 次的人带来很大不便。", "note_en": "At 6:30 PM on Wednesday August 4 th my 15-year-old daughter and I pulled up the Jaguar I-Pace electric car in front of my 91-year-old Mom’s place in Regina, Saskatchewan. I was tired and achey because I’d just finished driving 1,725km (1,072 miles) across two days to see her for the first time since Covid started. I was happy to see Mom, happy about the first road-trip in a long time, and happy to have tested the hypothesis that, in 2021, a fully-electric vehicle can handle long-haul travel.\n   This essay gathers together the data from the trip and tries to draw conclusions. There’s also a  real-time Twitter thread with typos and bad pictures.\n To my non-metric readers: Sorry, it’s in km. I’ll convert a few of the key numbers.\n The experience · It was pretty wonderful, actually. The Jaguar is a comfortable modern car with great seats, good audio, and all the automation you’d expect. It has awesome, overwhelming acceleration power for when you’re in a tricky passing situation. My daughter was excellent company. Cruising along a good road  — and a lot of the Trans-Canada highway is  — becomes a pretty pleasing experience.\n The worst part, by a wide margin, was the wildfire smoke, between us and some of the world’s most fantastic scenery. But that’s a symptom of the onrushing climate crisis, and one of the best things we can do to mitigate the devastation is to stop burning fossil fuels to travel.\n   Of course, this road trip was different from any previous experience, because charging. In a fossil car, you don’t have to think, you just wait for the tank to get a half or three quarters down, then pull over at the next station. Recharging requires planning; fortunately the tools are pretty good; more on that below.\n The chargers · One reason I decided this experiment was worth trying was Petro-Canada’s message about their  Electric Highway program, and I quote: “We have a charger every 250 km or less from Halifax, N.S. to Victoria, B.C.” There’s one not far from where I live in Vancouver, i tried it, and it worked first time with just a credit-card tap, no fuss no muss.\n Trouble is, that quote is kind of a lie. There are gaps, and that’s when all the chargers are working, which fairly regularly they’re not. But my experience is that Petro-Can, while good, is never your only charging option.\n Some background is required here. “High-power” Fast DC chargers come at multiple power levels: I saw 50, 100, 200, and 350kW. The difference makes a difference. Our Jag can only really charge at 100kW, but my personal perception is that the higher-power chargers fill up that last 20% much faster. And it feels complicated; for example, in my experience with a Co-op Connect charger, rated at “only” 100kW, it felt faster.\n When you use these things, they feel like first-generation tech, pushing the edges of what’s possible (or at least maintainable). In particular, when you plug a 350kW charger into a car with a really low battery, once it’s finished syncing and starts pumping electrons, the sound torques up like a 747 taking off. And the installations include multiple big tall metal boxes (see the picture below). Also, the huge big thick connecting wire gets super hot to the touch.\n   Anyhow, my impression of the Petro-Can network remains mostly positive. The machines work well. It’s annoying that some are 100kW, some 200, and some 350, for no obvious reason. It’s annoying that sometimes they’re stuck into a weird grubby back corner of the lot in a way that makes it hard to get your car in the right position to reach the charging port with the wire. But, good on ’em.\n Electrify Canada is another organization that’s promising a national network of fast chargers. They’re a partner of Electrify America, constructed by Volkswagen as part of their settlement over cheating on emissions testing. Anyhow, maybe they’ll be great some day. Once I was far enough into the trip to have Petro-Can fully worked out, I tried to find an Electrify charger in working condition but failed.\n If you’re OK with using 50kW chargers there are loads and loads of options. Many smaller-town Visitor Centres and and Chambers of Commerce put one in, as has my own electrical utility, BC Hydro. Once you’ve worked with a higher-power charger though, they’re just not a satisfying experience.\n The numbers · Each line in the table below represents one driving leg and includes the charging experience at the beginning of that leg (thus absent on each day’s initial leg). I think the column headings are mostly pretty obvious, except perhaps for:\n kWh/h is the amount of juice divided by the driving pause. Often the charger would report less time, which I put down to initialization delay, so I think I’m using the right value. The variation here is a little random, because how fast it goes depends strongly on how empty your battery is.\n km/ch stands for “km per charge-hour”, estimating the amount of road range you get per hour of charging. Which I think is a really important number.\n Network; “PC” is  Petro-Canada, “Flo”  isn’t an acronym, and “Co-op” is  Co-op Connect.\n There are two data sources: The drive-time data is from Jaguar’s trip logging via their  Incontrol app; thus the awkwardness caused by non-charge roadside stops. The charge-time data is the output from the various charging sessions along the way. I’m certain that neither is perfect, but the results seem intuitively in the right neighborhood, based on my experience.\n  Let’s have a closer look at the numbers that seem interesting to me.\n Charge time · 17:42 driving, 6:24 charging (including one evening charge after the day’s drive was finished). Not that great on the face of it. Now, it clearly could have been less; since my confidence that any given charger would Just Work started out weak, I was carefully allowing for failures and not running the battery very low. Later on in the trip as I gained confidence (specifically in the Petro-Canada network) I was willing to take on things like the Calgary-to-Medicine Hat leg, 2:43 and 285.9km, running the battery from 90% down to 11%.\n Also my daughter is after all a teen-ager, and perhaps not quite as quick as I moving through cafes and restrooms and so on.\n Also note that the legs are kind of short; this car can go 400km on a charge. But not when you’re on a big wide modern Prairie highway with almost no other traffic, blasting along at 110km/h (65mph) or more, continuously. I think you’d find this true of pretty well every electric vehicle.\n But, here’s the thing: It didn’t  feel excessive. I can only remember a total of maybe fifteen minutes when we were consciously just hanging waiting for charge. Most places, we got a coffee or lunch, hit the bathroom, took a walk around the block for our knees’ sake, and then it was time to unplug and go.\n Having said that, this is a 2019 model-year car and the charging technology is improving. If we’d had a Porsche Taycan and nothing but 350kW chargers, the story would have been very different. Will the fast-charging technology make the leap into the mainstream-car price plane? Will 350kW chargers become ubiquitious? I’d like to know.\n In this context, there’s another number there that I think is really interesting: The “km/c-h”, how far you can get on an hour’s charge. For this particular car on this selection of chargers, it was over 200km (124 miles) per charge-hour. I think that’s enough? Maybe in the lower regions of enough, but there.\n And finally, I suspect every driving-safety professional would beam in approval of a power system that forces you to get out of the car and move around every couple of hundred km.\n $$$ · It cost us $120.52 in electricity. Is that a lot or a little? I tentatively think they’re undercharging. While the electricity itself is pretty cheap, the charging infrastructure isn’t. If this is going to work, the charging networks are going to have to make money and I don’t see it at these prices.\n Bear in mind that at home with the Level 2 charger in the carport, charging feels close to free. Travel maybe doesn’t need to be as cheap as the networks are currently making it.\n Also, charging by the minute seems wrong. I guess having a time-based component makes sense to keep slow chargers from soaking up all the time, but especially at an extra-high-powered charger, a Porsche Taycan is going to get a whole lot more range out of each minute than a five-year-old Nissan Leaf, so why should they pay less for the same amount of range? Hmmmm.\n PlugShare · If you’ve got a Tesla there’s less planning, the cars know where the Superchargers are. If you have anything else, you really need  PlugShare. There are a few apps in this space, but PlugShare is best at showing you a map with all the chargers on it, and thus helping you route-plan. The reason it works is because it’s social; whenever you hit a charging station you can “Check In” and leave a note saying whether it’s working and how fast it goes. This dramatically reduces the risk of rolling up to a station and finding it broken. I absolutely don’t think this journey would have been possible without it.\n Pro tip: When you’re planning a trip on PlugShare, put in  all the chargers you might be able to use as you go along. Then when you’re driving, you can look at your remaining range and your upcoming options and most choices become pretty easy. It’s got a limited but decent Android Auto app that I used a lot. (I assume CarPlay too?)\n   Futures · A question: Are there enough chargers, or too many? At the moment, the answer is probably “too many”. One of the things I really worried about was limping into some charging station to find all the chargers occupied and having to wait for an hour before I could even start. The picture above shows the only time I saw other humans; a young couple with a four-day-old Mustang Mach-E, off for a joyride to Kamloops. Otherwise, the chargers we visited showed no signs of life. Somebody spent a lot of money to build an expensive resource that is today largely un-used.\n Having said that, anyone with even a shred of optimism about our future has to believe there are going to be a whole lot more battery-electric cars coming. Here in BC at the west edge of Canada we have  North America’s highest EV uptake, pushing 10% of new car sales.\n When we were charging at the big Petro-Can station in Kamloops, walking from the the two well-positioned chargers to the coffee shop, we went by the gas-sales part, which was  massive, at least a dozen pumps and cars lined up for every one.\n At some point that picture will flip, and there’ll be occasional vendors that still sell gas, but mostly just slick, fast, chargers. I worry that the process will be kind of painful, but I’m sure it’ll happen. So I hope someone’s planning the transition.\n  And everyone should stop driving fossil vehicles starting now. Because the climate crisis is upon us. We can’t prevent it now, but we can save lives and reduce destruction if we slash carbon output. There’s no excuse not to.\n      We own a Nissan Leaf and love it; we only use it for short trips around town (which is most of our driving).\n One thing that keeps bugging me is: how do the millions of people who live in apartments and park on the street participate in the electric car revolution? It is all well and good for me, who can charge overnight in my garage (though some recent stories about houses burning down have me a bit worried about that.)\n It seems this would require a huge infrastructure investment to basically make chargers almost like parking meters. Either that, or big inconvenience to people who have to go to designated charging areas 2 or 3 times a week.", "posttime": "2021-08-07 02:15:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "行驶,electric,充电", "title": "电动车2天行驶1725公里", "title_en": "Driving 1725km in an electric car in 2 days", "transed": 1, "url": "https://www.tbray.org/ongoing/When/202x/2021/08/05/Western-Electric", "via": "", "real_tags": ["行驶", "electric", "充电"]}, {"category": "", "categoryclass": "", "imagename": "860cddb8010586800dcb65a5269577ae.jpg", "infoid": 1071811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简介：我们本周的开源软件亮点是 Session。它是另一个日益流行的私人信使信号的分支。 Session 甚至不需要您的电话号码即可操作。关注隐私的人们一直在寻找一种终极服务，让您可以安全地进行通信，同时在多个平台上尊重我们的隐私。最近，我遇到了 Loki Foundation 的一个有趣的开源消息传递应用程序“Session”，它在技术上是另一个开源加密信使 Signal 的分支。在本文中，我将分享我对 Session 应用程序的体验，同时重点介绍它提供的功能。 Session 对这个场景来说是相当新的——我已经在文章底部提到了我遇到的一些错误。我将重点介绍 Session 的主要功能，这些功能将帮助您确定它是否足以让您尝试。对于隐私爱好者来说，使用 Signal 或其他此类应用程序注册电话号码是一种潜在风险。\n但是，使用 Session，您不需要电话号码，只需在台式机或手机上安装后单击“创建帐户”，它就会生成一个随机（唯一）会话 ID。因此，您只需与要添加的联系人共享您的会话 ID。或者，您也可以选择在创建帐户后获取二维码，您可以与朋友分享以重新添加您。对于了解区块链是什么的用户来说，他们一直在等待普通用户可以使用的实际应用程序。 Session 就是这样一个例子，它以区块链为核心，你不需要知道它的存在。如果您对它的工作原理感到好奇，可以查看他们的官方博客文章来解释它。对于严格以隐私为重点的内容，您还希望它可以跨多个平台使用。当然，主要是我会专注于 Linux 和 Android 支持，但它也支持 Windows/Mac/iOS。因此，您可以轻松地跨平台在多个设备之间进行同步。毫无疑问，它提供了一些以隐私为重点的基本功能，有助于使体验更加安全。\n消息 TTL：这使您可以控制在收件人看到消息之前消息存在的时间。阅读回执：让其他人知道您已看到该消息或您的消息是否已被阅读。尽管 Session 不是点对点技术，但它没有用于网络的中央服务器。它采用分散的方法来传输（或路由）消息。如果你不知道我在说什么，你可以关注 Session 的官方博客文章，了解中心化和去中心化之间的区别，并探索它是如何工作的。而且，这种网络方法可以帮助他们保护元数据（与 IP 地址等消息相关的信息）。不仅限于最新/最大的隐私友好功能，它还支持群聊、语音消息，还允许您发送附件。如果您前往官方下载页面，您将能够下载 .应用图像文件。如果你不知道它是如何工作的，你应该看看我们关于如何使用 AppImage 的文章。\n无论哪种情况，您都可以前往他们的 GitHub 发布页面并获取 .deb 文件。我已经设法在多个平台上尝试了它。对于桌面，我使用了 Pop!_OS 19.10 上的 .AppImage 文件来运行 Session。一旦您从设置中备份了您的密码（称为种子），恢复您的帐户也很容易。有时，当您从两个不同的设备（使用相同的 ID）回复时，接收者会收到两个不同的对话。当然，没有什么是完美的。现在，我正在考虑安装它并考虑 Session 的功能，这绝对是一个注重隐私的用户应该尝试的东西。你怎么看待这件事？请随时在下面的评论中告诉我您的想法。", "note_en": "Brief: Our open source software highlight of the week is Session. It is a fork of another increasingly popular private messenger Signal. Session doesn’t even need your phone number to operate.\n   Privacy concerned people are always in the search of an ultimate service that lets you communicate securely while respecting our privacy across multiple platforms.\n Recently, I came across an interesting open-source messaging app “ Session” by  Loki Foundation, which is technically a fork of another  open source encrypted messenger Signal.\n In this article, I’ll be sharing my experience with the Session app while highlighting the features it offers.\n Session is fairly new to the scene – I’ve mentioned some of the bugs that I encountered at the bottom of the article.\n  I’ll highlight the key features of Session that will help you decide if it’s good enough for you to try.\n    For privacy-enthusiasts, registering the phone number with Signal or other such applications is a potential risk.\n But, with Session, you do not need a phone number, simply click on “ Create Account” after you install it on your desktop or phone and it will simply generate a random (unique)  Session ID.\n  So, you just have to share your Session ID with the contact you want to add. Or, you can also opt to get the  QR Code after account creation which you can share with your friends to add you back.\n   For the users who’re aware of what a  blockchain is – they’ve been waiting for real-world applications that an average user can utilize. Session is one such example that utilizes blockchain at its core and you don’t need to know it’s there.\n If you’re curious about how it works, you can take a look at their  official blog post explaining it.\n   For something strictly privacy-focused, you’d also want it to be available across multiple platforms.\n Of course, primarily, I’d focus on the Linux and Android support but it also supports Windows/Mac/iOS. So, you can easily sync between multiple devices cross-platform.\n   Undoubtedly, it offers some essential privacy-focused features that will help make the experience more secure.\n  Message TTL: This lets you control how long the message exists before the recipient sees the message.\n Read Receipts: Let others know that you’ve seen the message or if your message has been read.\n  Even though Session isn’t a peer-to-peer technology, it does not have a central server for the network.\n It takes a decentralized approach to how the messages are transmitted (or routed). If you’ve no idea what I’m talking about, you can follow Session’s official blog post to know the  difference between centralization and decentralization and explore how it potentially works.\n And, this approach of network helps them to protect the metadata (the information associated with a message like IP address).\n  Not just limited to the latest/greatest privacy-friendly features, but it also supports group chats, voice messages, and also allows you to send attachments.\n  If you head to the  official download page, you will be able to download an . AppImage file. In case you have no clue how it works, you should take a look at our article on  how to use AppImage.\n In either case, you can also head to their  GitHub releases page and grab the  .deb file.\n   I’ve managed to try it on multiple platforms. For the desktop, I utilized the .AppImage file on  Pop!_OS 19.10 to run Session.\n  It’s also easy to recover your account once you’ve backed up your secret code (which is known as  seed) from the settings.\n   Sometimes when you reply from two separate devices (using the same ID), the receiver gets two different conversations.\n  Of course, nothing’s ever perfect. For now, I’m thinking of keeping it installed and considering Session’s features, it is definitely something a privacy-focused user should try.\n What do you think about it? Feel free to let me know your thoughts in the comments below.", "posttime": "2021-08-07 02:14:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电话号码,private,session", "title": "会话：不需要电话号码的私人信使", "title_en": "Session: A Private Messenger That Doesn't Need Phone Number", "transed": 1, "url": "https://itsfoss.com/session-messenger/", "via": "", "real_tags": ["电话号码", "private", "session"]}, {"category": "", "categoryclass": "", "imagename": "f2ab56b2eab25ee6759822692924662e.jpg", "infoid": 1071809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者注：这是长期的 Linux 内核网络开发人员和 Cilium 项目的创建者 Thomas Graf 的帖子 Linux 内核社区最近宣布了 bpfilter，它将用高性能网络过滤器取代长期存在的 iptables 内核实现Linux BPF，同时保证 Linux 用户的无中断过渡。从作为 tcpdump 和 Wireshark 等流行工具底层的包过滤功能的卑微根源，BPF 已经发展成为一个丰富的框架，以高度灵活的方式扩展 Linux 的功能，而不会牺牲性能和安全等关键属性。这种强大的组合已经导致像 Google、Facebook 和 Netflix 这样的 Linux 内核技术的前瞻用户选择 BPF 用于从网络安全和负载平衡到性能监控和故障排除的用例。 Netflix 的 Brendan Gregg 首先将 BPF Superpowers 称为 Linux。这篇文章将介绍这些“超能力”如何使像 iptablesredundant 这样的长期存在的内核子系统同时启用新的内核用例，这是以前很少有人想象的。在过去的 15 年里，我在 Linux 内核社区中编写了许多子系统的代码，包括 TCP/IP 堆栈、iptables 等等，这让 meto 能够近距离观察 BPF 的发展。我很快意识到 BPF 不仅仅是另一个特性，而是代表了一种基础技术转变，随着时间的推移，它将改变 Linux 中网络和安全性的几乎所有方面。我开始做出贡献，并与 Alexei Starovoitov 和 Daniel Borkmann 一起成为其最大的支持者之一，他们现在正在维护 BPFupstream。从这个角度来看，从 iptables 到 bpfilter 的转变只是 BPF 为现代领域振兴 Linux 网络堆栈之旅的下一个合乎逻辑的步骤。要了解这种转变为何如此令人兴奋，请允许我带您了解内核中 iptables 的历史。多年来，iptables 一直是在 Linux 上实现防火墙和数据包过滤器的主要工具。 iptables 及其前身 ipchains 从一开始就是我个人 Linux 之旅的一部分。最初作为用户，后来作为内核开发者。多年来，iptables 既是福也是祸：是因为它的灵活性和快速修复。在多个系统组件正在争夺谁可以安装什么 iptables 规则的环境中调试 5K 规则 iptables 设置时的诅咒。 OH：“在任何团队中，您都需要坦克、治疗师、伤害输出者、具有人群控制能力的人以及另一个了解 iptables 的人”——Jérôme Petazzoni (@jpetazzo) 2015 年 6 月 27 日\n当 20 年前 iptables 开始出现以取代其前身 ipchains 时，防火墙功能的编写范围很简单：当时，网络速度很慢。还记得拨号时调制解调器发出的声音吗？那是 iptables 最初开发和设计的时代。实现 iptables 实现的访问控制列表 (ACL) 的标准做法是使用规则的顺序列表，即每个接收或传输的数据包都与规则列表一个接一个地匹配。然而，线性处理有一个明显的巨大缺点，过滤数据包的成本会随着规则数量的增加而线性增加。一段时间过去了，网络速度提高了，iptables 设置从几十条规则增加到了数千条规则。从性能和延迟的角度来看，遍历顺序的 iptables 列表变得难以忍受。社区很快确定了最常见的瓶颈：拒绝或允许单个 IP 地址和端口组合的一长串规则列表。这导致了 ipset 的引入。 ipset 允许将匹配 IP 地址和/或端口组合的规则列表压缩到哈希表中，以减少 iptables 规则的整体数量。从那以后，这一直作为一种解决方法，而没有解决核心问题本身。不幸的是，ipset 并不能解决所有问题。一个突出的例子是 kube-proxy，它是 Kubernetes 的一个组件，它使用 iptables 和 -j DNAT 规则为服务提供负载平衡。它为服务所服务的每个后端安装多个 iptables 规则。 Foreach 服务添加到 Kubernetes，要遍历的 iptables 规则列表呈指数增长。最近的 KubeContalk 检查了 kube-proxy 性能的所有细节。演讲展示了随着服务数量的增长，不可预测的延迟和性能下降的测量结果。它还揭示了 iptables 的另一个主要弱点：缺乏增量更新。每次添加新规则时，都必须替换整个规则列表。这导致安装代表 20K Kubernetes 服务的 160K iptablesrules 的总持续时间为 5 小时。\n使用基于 IP/端口的机制通常有许多其他明显的缺点，特别是在应用程序容器时代。容器经常被部署和拆除。这可能会导致单个 IP 地址的生命周期较短。一个 IP 地址可能会被一个容器使用几秒钟，然后在几秒钟后被另一个容器重新使用。这给依赖使用 IP 地址进行安全过滤目的的系统带来压力，因为集群中的所有节点必须不断了解容器映射的最新 IP。虽然这在集群内几乎不困难，但跨集群变得非常具有挑战性。深入了解细节超出了这篇博文的范围，因此我们将其保存以供以后的博文使用。近年来，BPF 以疯狂的速度发展，解锁了以前不在内核范围内的东西。这是通过 BPF 提供的令人难以置信的强大和高效的可编程性实现的。以前需要自定义内核开发和内核重新编译的任务现在可以在 BPFsandbox 的安全边界内使用高效的 BPF 程序来完成。以下是一个项目列表，展示了 BPF 如何被各种项目和公司利用： Cilium 正在将 BPF 的力量释放到容器世界，并在 L3-L7 提供强大而高效的网络、安全性和负载平衡。阅读 Cilium 简介以开始了解 Cilium。 @ciliumproject 对 eBPF 和 XPD 所做的事情是我见过的最干净的网络插件，疯狂的道具 https://t.co/oOShMvT2iY pic.twitter.com/mPV864Aia1 — jessie frazelle (@jessfraz) 2017 年 8 月 16 日 Facebook 有介绍了基于 BPF/XDP 的负载平衡的令人兴奋的工作，以取代还包括 DDoS 缓解逻辑的 IPVS。虽然与 iptables 相比 IPVS 是一个诱人的下一步，但 Facebook 在看到性能大约提高了 10 倍之后，已经从 IPVS 迁移到 BPF。\neBPF 性能让你大开眼界！我使用 XDP 编写的一个简单的入口防火墙处理 1100 万个数据包/秒。是时候进行更多优化了！ — Diptanu Choudhury (@diptanu) 2017 年 8 月 21 日 Netflix，尤其是 Brendan Gregg，一直在利用 BPF 的功能进行性能分析和跟踪。 bcc 项目让用户可以使用 BPF 的强大功能，例如，生成惊人的火焰图：有关更多详细信息，包括有关如何利用 BPF 进行应用程序跟踪的许多示例，请查看 Brendan Gregg 的博客文章。正如我对许多在系统工程领域求职的人所说的那样：BPF 体验越来越热 https://t.co/bScbqE6m17 — Brendan Gregg (@brendangregg) 2017 年 5 月 20 日 Google 一直在研究 bpfd使用 eBPF 为远程目标启用强大的 Linux 跟踪。基于围绕 BPF 的上游参与，他们似乎也在考虑将各种内部项目迁移到 BPF。\nCloudflare 正在使用 BPF 来缓解 DDoS 攻击，并发布了多篇博文，并就该主题进行了多次公开演讲。 Suricata 是一个 IDS，它开始使用 BPF 和 XDP 来替换 nfqueue，后者是一个基于 iptables 的有线窃听基础设施。更多细节可以在这个内核食谱中找到。有太多的例子不胜枚举一一列举在这篇博客文章。我们aremaintaining的BPF参考指南中的项目usingBPF更完整的列表。 BPF 的最新发展是一个令人兴奋的提议，以对用户完全透明的方式用 BPF 完全替换 iptables 的内核部分，即现有的 iptables 客户端二进制文件和库将继续工作。您可以在内核邮件列表上找到上游讨论。该提案的作者是 Daniel Borkmann（Covalent）、网络维护者 David Miller（Red Hat）和 Alexei Starovoitov（Facebook）。该提案被 LWN 的一篇文章所涵盖，该文章对最初的讨论进行了很好的总结。 Quentin Monnet 在 FRnOG 30 上展示的下图显示了 bpfilter 与 iptables 和 nftables 相比的一些早期测量结果。它显示了纯软件 BPF 实现以及硬件卸载测试：这些早期的性能数字令人难以置信，并且表明了 BPF 的强大功能。需要注意的是，bpfilter和BPF本身并不能解决iptables使用顺序列表带来的性能问题。这样做将需要本地使用 BPF，如 Cilium 项目所做的那样。\n一些 Linux 内核邮件列表以其火焰战争而闻名。 Haveflamewars在这种情况下爆发了？不，事实上，核心 iptables 维护者已经立即提出了所有针对 BPF 方向的建议。 Florian Westphal 提出了一个框架，该框架将在 bpfilter 之上运行，并将 nftables 转换为 BPF。这允许保留特定领域的 nftables 语言，但受益于 BPF 运行时的所有优势，包括其 JIT 编译器、硬件卸载和工具。 Pablo Neira Ayuso 似乎一直在研究类似的提案，并且已经发表了一系列将 nftables 转换为 BPF 的系列。方法上的主要区别似乎是 Pablo 打算在内核中执行翻译。此后，社区一致同意，任何 BPF 程序的注入都必须通过用户空间发生，并通过 BPFverifier 传递，以保证 BPF 的安全行为。我认为 BPF 是多年来最令人兴奋的 Linux 开发。我们几乎没有触及其潜力的表面，它仍在不断发展。用 BPF 替换 iptables 的内核部分是合乎逻辑的第一步。真正的过渡将是 BPF 原生工具，以及摆脱传统的 IP 地址/端口中心结构。", "note_en": "Author Note: this is a post by long-time Linux kernel networking developer andcreator of the Cilium project, Thomas Graf\n The Linux kernel community recently announced  bpfilter, which will replacethe long-standing in-kernel implementation of iptables with high-performancenetwork filtering powered by Linux BPF, all while guaranteeing a non-disruptivetransition for Linux users.\n From humble roots as the packet filtering capability underlying popular toolslike tcpdump and Wireshark, BPF has grown into a rich framework to extend thecapabilities of Linux in a highly flexible manner without sacrificing keyproperties like performance and safety. This powerful combination has ledforward-leaning users of Linux kernel technology like  Google,  Facebook, and Netflix to choose BPF for use cases ranging from network security andload-balancing to performance monitoring and troubleshooting. Brendan Gregg ofNetflix first called BPF  Superpowers for Linux. This post will cover howthese “superpowers” render long-standing kernel sub-systems like iptablesredundant while simultaneous enabling new in-kernel use cases that few wouldhave previously imagined were possible.\n Having spent the past 15 years in the Linux kernel community authoring code tomany subsystems including the TCP/IP stack, iptables, and many more, allowed meto observe BPF developments up close. I soon realized that BPF was not simplyyet another feature but instead represented a foundational technology shiftthat in time would change nearly every aspect of networking and security withinLinux. I started contributing and became one of its biggest supporters alongside with Alexei Starovoitov and Daniel Borkmann which are now maintaining BPFupstream. In this lens, the shift from iptables with bpfilter is just the nextlogical step in a BPF’s journey to revitalize the Linux networking stack forthe modern area. To understand why this shift is so exciting, allow me to takeyou on a bit of a tour through the history of iptables in the kernel.\n  iptables has been the primary tool to implement firewalls and packet filters onLinux for many years. iptables and its predecessor ipchains have been part ofmy personal Linux journey from early on. Initially as a user, later as a kerneldeveloper. Over the years, iptables has been a blessing and a curse: a blessingfor its flexibility and quick fixes. A curse during times debugging a 5K rulesiptables setup in an environment where multiple system components are fightingover who gets to install what iptables rules.\n  OH: &#34;In any team you need a tank, a healer, a damage dealer, someone with crowd control abilities, and another who knows iptables&#34;\n— Jérôme Petazzoni (@jpetazzo)  June 27, 2015\n When iptables started its life 20 years ago to replace its predecessoripchains, firewall functionality was written with a simple scope:\n  Back then, network speeds were slow. Remember the sound a modem made whendialing in? That was the era when iptables was initially developed anddesigned. The standard practice of implementing access control lists (ACLs) asimplemented by iptables was to use sequential list of rules, i.e. every packetreceived or transmitted is matched against a list of rules, one by one.\n However, linear processing has an obvious massive disadvantage, the cost offiltering a packet can increase linearly with the number of rules added.\n  Some time passed, network speeds increased and iptables setups had grown from adozen rules to sets of thousands of rules. Traversing sequential iptables listshad become unbearable from a performance and latency perspective.\n The community quickly identified the most common bottleneck: long lists ofrules either rejecting or allowing individual IP address and port combinations.This lead to the introduction of  ipset. ipset allows to compress list ofrules matching on IP addresses and/or port combinations into a hash table toreduce the number of iptables rules overall. This has since been serving as aworkaround without addressing the core problem itself.\n Unfortunately, ipset is not an answer to all problems. A prominent example is kube-proxy, a component of  Kubernetes that usesiptables and  -j DNAT rules to provide load-balancing for services. Itinstalls multiple iptables rules for each backend a service is serving to. Foreach service added to Kubernetes, the list of iptables rules to be traversedgrows exponentially.\n A recent  KubeContalkexamined kube-proxy performance in all details. The talk presents measurementsshowing unpredictable latency and reduced performance as the number of servicesgrows. It also reveals another major weakness of iptables: lack of incrementalupdates. The entire list of rules has to be replaced each time a new rule isadded. This leads to a total duration of 5 hours to install the 160K iptablesrules representing 20K Kubernetes services.\n Using IP/port based mechanisms has many other obvious disadvantages in general,in particular in the age of application containers. Containers are deployed andtorn down frequently. This can lead to a short lifetime of individual IPaddresses. An IP address may be used by a container for just seconds and thengets reused by another container a couple of seconds later. This puts stress onsystems which rely on using IP addresses for security filtering purposes as allnodes in a cluster must be constantly aware of the latest IP to containermapping. While this is barely difficult within a cluster, it becomes incrediblychallenging across clusters. Diving into the details is outside of the scope ofthis blog post so we will save it for a future post.\n  BPF has been evolving at an insane pace in recent years, unlocking what waspreviously outside the scope of the kernel. This is made possible by theincredible powerful and efficient programmability that BPF provides. Tasks thatpreviously required custom kernel development and kernel recompilations can nowbe achieved with efficient BPF programs within the safe boundaries of the BPFsandbox.\n The following is a list of projects that show how BPF is being leveraged invarious projects and companies:\n Cilium is unleashing the powers of BPF tothe world of containers and provides powerful and efficient networking,security and load-balancing at L3-L7. Read the  introduction toCilium to get started on learningabout Cilium.\n What  @ciliumproject is doing with eBPF and XPD is the cleanest networking plugin I&#39;ve seen, mad props  https://t.co/oOShMvT2iY  pic.twitter.com/mPV864Aia1\n— jessie frazelle (@jessfraz)  August 16, 2017\n Facebook has presented exciting work on  BPF/XDP based load-balancing toreplaceIPVSthat also includes DDoS mitigation logic. While IPVS is a tempting next stepcompared to iptables, Facebook has already migrating away from IPVS to BPFafter seeing roughly a 10x improvement in performance.\n Mind blown by eBPF performance! A simple ingress firewall I wrote using XDP processes 11 million packets/s. Time for more optimizations!\n— Diptanu Choudhury (@diptanu)  August 21, 2017\n Netflix, in particular Brendan Gregg, have been utilizing thepowers of BPF for performance profiling and tracing. The  bcc projectprovides users access to the powers of BPF to, for example, generate amazingflamegraphs:\n  For more details including many examples on how to leverage BPF forapplication tracing, checkout out Brendan Gregg’s  blogposts.\n as I&#39;ve said to a number of people job hunting in systems engineering: BPF experience is hot and getting hotter  https://t.co/bScbqE6m17\n— Brendan Gregg (@brendangregg)  May 20, 2017\n Google has been working on bpfd which enables  Powerful Linux Tracing forRemote targets usingeBPF.Based on upstream engagement around BPF, they also seem to be looking atmigrating various internal projects over to BPF.\n Cloudflare is using BPF to  mitigate DDoS attacksand has put out several blog posts and presented multiple public talks on thetopic.\n Suricata is an IDS that started using BPF andXDP to replace nfqueue which is an iptables based infrastructure to wiretappackets. More details can be found in this  Kernel Recipestalk.\n There are too numerous examples to list them all in this blog post. We aremaintaining a more complete list of  projects usingBPF in the BPF reference guide.\n  The most recent development in the evolution of BPF is an exciting proposal tocompletely replace the kernel part of iptables with BPF in a way that iscompletely transparent to the user, i.e. existing iptables client binaries andlibraries will continue to work.\n You can find the upstream discussion on the  Kernel mailinglists. Theproposal is authored by Daniel Borkmann (Covalent), the networking maintainerDavid Miller (Red Hat), and Alexei Starovoitov (Facebook). The proposal wascovered by an  LWN article that gives agreat summary of the initial discussion.\n The following graph as presented by Quentin Monnet at FRnOG 30 shows some earlymeasurements of bpfilter in comparison with iptables and nftables. It showsboth the software only BPF implementation as well as a hardware offloaded test:\n  These early performance numbers are incredible promising and an indication ofthe power of BPF. It must be noted that bpfilter and BPF itself will not solvethe performance problems caused by iptables&#39;s use of sequential lists. Doing sowill require native use of BPF such as done by the  Ciliumproject.\n  Some of the Linux kernel mailing lists are famous for their flame wars. Haveflamewars burst out in this case? No, in fact, there have been immediateproposals from core iptables maintainers all aiming into the direction of BPF.\n Florian Westphal has  proposed aframework that willoperate on top of bpfilter and will convert nftables to BPF. This allows tokeep the domain specific nftables language but benefits from all theadvantages of the BPF runtime with its JIT compiler, hardware offload, andtooling.\n Pablo Neira Ayuso seems to have been working on a  similarproposaland has published a series which also translates nftables to BPF. The maindifference in approach seemed to be that Pablo intended to perform thetranslation in the kernel. The community has since agreed that any injection ofBPF programs must occur through user space and be passed through the BPFverifier to guarantee the safety behavior of BPF.\n  I consider BPF the most exciting Linux development since many years. We arebarely scratching the surface of its potential and it is still evolving. Themove to replace the kernel part of iptables with BPF is a logical first step.The real transition will be to BPF native tooling as well as move away fromtraditional IP address/port centric constructs.", "posttime": "2021-08-07 02:13:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社区,community,bpf", "title": "为什么内核社区要用 BPF 代替 iptables？ (2018)", "title_en": "Why is the kernel community replacing iptables with BPF? (2018)", "transed": 1, "url": "https://cilium.io/blog/2018/04/17/why-is-the-kernel-community-replacing-iptables", "via": "", "real_tags": ["社区", "community", "bpf"]}, {"category": "", "categoryclass": "", "imagename": "d523e07669fabd8c81878a6abee972f7.jpeg", "infoid": 1071807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到 2022 年底，它将创建一个供人们使用的 OneNote 应用程序。在接下来的 12 个月中，Microsoft 将在 Windows 上为其 OneNote 应用程序推出一系列更新，旨在创造单一的用户体验。目前，人们可以使用两个版本：随 Office 安装的 OneNote 应用和 Microsoft Store 中提供的 OneNote for Windows 10 应用。不过，微软将更新 OneNote 应用程序，使其具有 Windows 10 上预装的同类应用程序所独有的功能，并且还将为该程序带来视觉上的刷新。微软原本打算在适用于 Windows 10 的 OneNote 应用程序可用时杀死 OneNote 应用程序，但它改变了计划并在 2019 年重新启动了该应用程序。它使用一系列新功能升级了笔记程序，并将其与 Office 安装捆绑在一起一年之后。现在，这家科技巨头表示，它将使用视觉元素更新 OneNote，并将与其他 Windows 应用程序共享这些视觉元素，作为微软为 Windows 11 提供更无缝外观的努力的一部分。合并后的 OneNote 应用程序还将获得最新的 Microsoft 笔和墨水功能，以及新的导航 UI 布局选项。那些已经在使用随 Office 安装的应用程序的人无需执行任何操作，只需等待即将推出的更新。对于使用 OneNote for Windows 10 的用户，一旦其他应用程序准备就绪，Microsoft 将向他们发送应用程序内邀请以升级到其他应用程序。该公司表示，预计将在 2022 年下半年开始发送邀请，现在建议组织让员工使用 OneNote 应用程序，这样他们明年就不必迁移了。 Engadget 推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果您通过这些链接之一购买商品，我们可能会赚取会员佣金。由于您的隐私偏好，此内容不可用。在此处更新您的设置，然后重新加载页面以查看它。", "note_en": "By the end of 2022, it will have created a single OneNote app for people to use.\n  Over the next 12 months, Microsoft is  rolling out a series of updates for its OneNote apps on Windows with the intention of creating a single user experience. At the moment, there are two versions people can use: The OneNote app installed with Office and the OneNote for Windows 10 app available in the Microsoft Store. Microsoft will update the OneNote app with features currently exclusive to its counterpart pre-installed on Windows 10, though, and it will also give the program a visual refresh.\n Microsoft originally intended to kill the OneNote app when the one for Windows 10 became available, but it changed its plans and  revived the app in 2019. It upgraded the note-taking program with a bunch of new features and bundled it with Office installs a year later. Now, the tech giant says it will update OneNote with visual elements that it&#39;ll share with other Windows apps as part of Microsoft&#39;s efforts to give Windows 11 a more seamless look. The merged OneNote application will also gain access to the latest Microsoft pen and ink features, as well as a new navigational UI layout option.\n  Those already using the app installed with Office don&#39;t have to do anything but wait for the upcoming updates to roll out. As for those using OneNote for Windows 10, Microsoft will send them an in-app invite to upgrade to the other application once it&#39;s ready. The company says it expects to start sending out invitations in the second half of 2022, and it now advising organizations to make their personnel use the OneNote app, so they don&#39;t have to migrate next year.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2021-08-07 01:12:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,microsoft,微软,windows,合并", "title": "微软正在合并其 Windows 版 OneNote 应用程序", "title_en": "Microsoft is Merging Its OneNote Apps for Windows", "transed": 1, "url": "https://www.engadget.com/microsoft-onenote-app-windows-102737016.html", "via": "", "real_tags": ["程序", "microsoft", "微软", "windows", "合并"]}, {"category": "", "categoryclass": "", "imagename": "d177e015d32751b08ce8e2dce2add3e5.jpg", "infoid": 1071806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "化工行业将原材料转化为其他所有行业必不可少的基本产品——从化妆品到汽车再到药品——尽管主要是消费者的想法。但对 Ali Amin-Javaheri 来说，这是他的整个职业生涯。 “这是一个非常吸引人的市场，大多数人一生中都不会花一分钟时间去思考，”他告诉福布斯。 “这是生活在阴影中的市场之一，不直接接触我们，但消费者和大多数人没有意识到化学物质被用来制造地球上的每一种物质。”作为杜邦化学家的孩子, Amin-Javaheri 在自己进入市场之前在这个领域长大。尽管市场规模庞大，2019 年的收入估计为 3.9 万亿美元，但买家与它的互动方式自他父亲时代以来并没有发生太大变化。 Amin-Javaheri 旨在解决这个问题。 “它非常分散，目前的购买体验真的和你想象的一样低效，”他说。 Amin-Javaher 知道将传统行业带入数字时代有多么困难——他是 ChemPoint 团队的一员，该团队试图做他现在创建的事情，最终成为一个中间人分销平台。尽管如此，他还是能够在 2017 年再次尝试，并创建了 Knowde，这是一个现代 B2B 市场，用于直接连接化工行业的买家和卖家。自从与他的联合创始人 Wojciech Krupa 一起创立以来，这家初创公司已经与估计 15,000 家潜在供应商中的数千家签约。鉴于全球对该服务的需求不断增长，这家初创公司筹集了新一轮资金以继续前进。这家总部位于旧金山的公司筹集了 7200 万美元的 B 轮融资，由 Coatue 领投，除了红杉等现有投资者之外，还有 Sound Ventures 和 Mantis 等其他新投资者参与。红杉资本的合伙人肖恩·马奎尔 (Shaun Maguire) 于 2020 年 5 月领导了该公司的 A 轮融资，他告诉福布斯，他最初对该公司感到兴奋，因为它正在处理一个因其规模和分散性而非常适合市场模型的行业。他说他回来投资 B 轮是因为他对公司的进步印象深刻。 “阿里对他将如何开始有了非常清晰的愿景，这让我们非常兴奋，”马奎尔说。 “他们基本上已经完成了他们说他们会做的所有事情，公司一直关注的第一件事就是索引并在 Knowde 上吸引尽可能多的用户。” Knowde Amin-Javaheri 说，第一步只是在网上获取有关不同卖家的信息，而这些信息实际上并不存在。他解释说，该行业在很大程度上仍被困在 PDF 中，这意味着买家通常会在几个月内与卖家来回交流，只是为了了解他们拥有的不同东西，更不用说要求样品或进行购买了。 “我们在内部说的是&#39;你如何把它缩短到 12 天？&#39;我们必须将所有产品都放在平台上，并能够应用基本的搜索过滤器，这样 [客户] 才能真正快速地从 100,000 个 [卖家] 找到合适的 7 个。”一旦这一点到位，该公司就会努力添加更多功能，例如供应商的营销工具和在线交易的能力。迄今为止，Knowde 已将大约 20% 的化学品供应商引入该平台，到目前为止，重点主要集中在北美和欧洲。尽管最初认为这将是一个更适合较小买家以了解市场的解决方案，但该平台也受到了联合利华等大型集团的强烈关注。 Amin-Javaheri 表示，他的初创公司将利用新资金扩大其地理范围并继续增加更多供应商。 “创新发生的方式是通过化学，如果你想更快地创新并获得正确的原料，你必须能够找到合适的供应商，”他说。 “从本质上讲，我们已经为化学打造了 Google，我们为此感到非常自豪。”", "note_en": "The chemicals industry converts raw ingredients to the basic products essential to every other industry — from cosmetics to cars to pharmaceuticals — despite remaining mainly out of the minds of consumers. But to Ali Amin-Javaheri, it’s his entire career. “It’s a really fascinating market that most people don’t spend a minute of their lives thinking about,” he tells  Forbes. “It’s one of those markets that lives in the shadows, and doesn’t touch us directly, but consumers and most people don’t realize that chemicals are used to make every physical good on earth.&#39;&#39;As the child of a DuPont chemist, Amin-Javaheri grew up in the space before entering the market himself. Despite the market’s size, an estimated $3.9 trillion of  revenue in 2019, how buyers interact with it hasn’t changed all that much since his dad’s days. Amin-Javaheri aims to fix that. “It’s massively fragmented and the current buying experience is really as inefficient as you can imagine,” he says.\n    Amin-Javaher knows how difficult it is to bring a legacy industry into the digital age— he was part of a team at ChemPoint that tried to do what he’s created now and ended up as more of a middleman distribution platform. Because of this experience though, he was able to give it another go in 2017 and created Knowde, a modern B2B marketplace for directly connecting buyers and sellers in the chemicals industry. Since launching with his cofounder Wojciech Krupa, the startup has signed on thousands of the estimated 15,000 potential suppliers. Given the growing global appetite for the service, the startup raised a new round of capital to keep going.\n  The San Francisco-based company raised a $72 million Series B round led by Coatue, with participation from other new investors including Sound Ventures and Mantis in addition to existing investors like Sequoia. Shaun Maguire, a partner at Sequoia, who led the firm’s Series A in May 2020, tells  Forbes that he was originally excited about the company because it was tackling a sector that was the perfect fit for a marketplace model due to its size and fragmentation. He says he came back to invest in the Series B because he’s been impressed by the company’s progress. “Ali just had this incredibly clear vision of how he was going to get started and that got us very excited,” Maguire says. “They basically have done everything they said they would do and the number one thing the company has been focused on is indexing and getting as many users on Knowde as possible.”\n    The first step for Knowde Amin-Javaheri says was just getting information about the different sellers online, something that hadn’t really existed. The industry is largely still trapped within PDFs which means buyers are typically going back and forth with sellers for months just to get an idea of the different things they had, let alone request a sample or make a purchase, he explains. “What we say internally is ‘how do you get it down to 12 days?’ We have to put every product on the platform, and be able to apply basic search filters, so [customers] can go from 100,000 [sellers] to the right seven really quickly.” Once this was in place the company worked to add more features like marketing tools for the suppliers and the ability to make the transactions online.\n    Knowde has brought approximately 20% of chemical suppliers on to the platform thus far, and so far the focus has mainly been on North America and Europe. Despite originally thinking this would be a solution more designed for smaller buyers to get a feel for the market, the platform has seen strong traction from large groups like Unilever too. Amin-Javaheri says his startup will use the fresh capital to expand its geographic reach and continue adding more suppliers. “The way that innovation happens is through chemistry, if you want to innovate faster and get the right ingredients, you have to be able to find the right suppliers,” he says. “We take a lot of pride in the fact that essentially we’ve built the Google for chemistry.”", "posttime": "2021-08-07 01:11:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "knowde,online", "title": "化工行业在线市场 Knowde 筹集了 7200 万美元的 B 轮融资，由 Coatue 领投，红杉、Sound Ventures 和 Mantis 参与", "title_en": "Knowde, an online marketplace for the chemicals industry, raises a $72M Series B led by Coatue, with Sequoia, Sound Ventures, and Mantis participating", "transed": 1, "url": "https://www.forbes.com/sites/rebeccaszkutak/2021/08/05/knowde-raises-72-million-on-its-journey-to-bring-the-chemicals-market-online/", "via": "", "real_tags": ["knowde", "online"]}, {"category": "", "categoryclass": "", "imagename": "ce1bb4ff2971d89f10a536623322e1b4.jpg", "infoid": 1071805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据最新公开的法庭文件，谷歌考虑收购 Epic Games，因为两家公司就 Epic 的 Fortnite Android 应用程序展开了争论。昨晚，谷歌取消了 Epic 对谷歌的反垄断投诉中的一些删节，Epic 上个月对其进行了修改和重新提交。投诉仍然省略了许多关于谷歌与特定公司交易的细节，但新的细节反映了谷歌内部关于 Android 平台竞争的沟通。 Epic 声称谷歌计划通过通过其他渠道分发 Fortnite 来回避谷歌的官方 Play 商店佣金，并且在一个未编辑的部分中，它引用了一份谷歌内部文件，称 Epic 的计划是威胁谷歌的“传染病”。以下是 Epic 对这种情况的描述：谷歌甚至与业务合作伙伴分享其垄断利润，以确保他们同意排除竞争，开发了一系列内部项目来解决它从 Epic 和其他人为消费者和开发商提供有竞争力的替代品，甚至考虑购买部分或全部 Epic 以消除这种威胁。讨论这种可能性的内部消息仍然保密，投诉并未表明谷歌曾就这些计划与 Epic 接触过。它还没有给出讨论的时间表——尽管它可能发生在 Epic 于 2018 年开始计划在 Android 上推出 Fortnite 之后。 Epic 还声称谷歌向其提供了在 Play 商店推出 Fortnite 的“特别优惠”。在另一个未密封的部分，投诉描述了一位 Google Play 经理就其侧载 Fortnite 的计划与 Epic 联系——并且显然承认侧载在这个过程中是一种“坦率地糟糕”的体验。一位经理联系了 Epic 的副总裁兼联合创始人，以评估 Epic 对一项特殊交易的兴趣，并讨论了通过直接下载“在 Android 上获得 Fortnite 的体验”。经理的通话记录指出，她认为直接下载 Fortnite 是“坦率地说是糟糕透顶的”和“糟糕的体验”，并且 Epic 应该“担心大多数人不会通过 15 个以上的步骤”。另一部分说，“工作人员在内部承认，谷歌对希望直接下载的消费者施加的困难导致了‘[p]糟糕的用户体验’，因为有 15 个以上的步骤来获得应用 [通过侧载] vs Play 或 iOS 上的 2 个步骤。&#39;”\n总体而言，“谷歌明白，它为直接下载设置的无数障碍具有保护其应用分发垄断地位和限制开发人员分发应用的能力的效果，”Epi​​c 在其投诉中称。在一份名为“对 Epic 的回应”的内部文件中，一位谷歌员工解释说，与直接下载相关的“安装摩擦”对用户来说“不仅是一种糟糕的体验”，而且谷歌“从其数据中知道它将极大地限制 [Epic 的] 抵达”。该文件继续解释说，“[f]uture [Fortnite] 更新将受到挑战：定位，通过网络更新体验”；直接下载方法“与恶意应用程序最相关”，这将“与 [Epic 的] 品牌/人口统计数据不兼容”；并且“[t] 他的方法会造成严重的用户混淆，因为 [Google Play] 仍然会吸引 [数十亿] 用户，他们将搜索 Fortnite 并遇到不清楚如何解决的死胡同”。 Epic 的诉讼最近与针对谷歌的更大的州反垄断投诉有关。与 Epic 一样，一组州检察长声称 Android 的开放程度远低于谷歌声称的那样，称其削减故意设置障碍——包括 Android 手机功能和与手机制造商的交易——以限制第三方应用商店并阻止直接下载应用。谷歌还删除了州投诉中的一些删节，主要涉及其对 Android 工作原理的内部描述。例如，在 2017 年关于亚马逊 App Store 的演讲中，谷歌显然指出，“如果我们说实话，我们会承认大多数用户和开发者并没有有意识地‘选择’他们使用默认设置。”在 2019 年，它将 Apple 和 Android 称为“新的封闭互联网生态系统”，“通过应用商店集中分发内容……[和] 通过应用商店服务进行支付”——尽管这些言论的大背景尚不清楚。谷歌强烈否认了这两起诉讼中的指控。 “开放的 Android 生态系统让开发者可以通过多个应用商店分发应用。对于选择使用 Play 商店的游戏开发商，我们有一致的政策，对开发商公平，并确保商店对用户的安全，”它在之前对 Epic 修改后的文件的评论中说。 “虽然 Fortnite 在 Android 上仍然可用，但我们不能再在 Play 上提供它，因为它违反了我们的政策。我们将继续为这些毫无根据的指控辩护。” Epic 去年对苹果和谷歌提起诉讼，因为它推出了新的 Fortnite 支付系统，回避了他们的支付系统和应用内购买佣金，导致两家公司将 Fortnite 踢出他们的移动商店。 （Fortnite 仍可通过侧载在 Android 设备上使用。）Epic 对 Apple 的诉讼于 5 月开始审理，目前正在等待法院的裁决。", "note_en": "Google considered buying Epic Games as the companies sparred over Epic’s  Fortnite Android app, according to  newly unsealed court filings. Last night, Google lifted some of its redactions in Epic’s antitrust complaint against Google, which  Epic amended and refiled last month. The complaint still omits many details about Google’s dealings with specific companies, but the new details reflect internal Google communications about competition on the Android platform.\n Epic claims Google was threatened by its plans to sidestep Google’s official Play Store commission by distributing  Fortnite through other channels, and in an unredacted segment, it quotes an internal Google document calling Epic’s plans a “contagion” threatening Google. Here’s Epic’s description of the situation:\n Google has gone so far as to share its monopoly profits with business partners to secure their agreement to fence out competition, has developed a series of internal projects to address the “contagion” it perceived from efforts by Epic and others to offer consumers and developers competitive alternatives, and has even contemplated buying some or all of Epic to squelch this threat.\n The internal messages discussing that possibility remain secret, and the complaint doesn’t indicate that Google ever reached out to Epic with these plans. It also doesn’t give a timeframe for the discussion — although it presumably happened after Epic started its plans to launch  Fortnite on Android in 2018.\n Epic has also alleged that Google offered it a “special deal” to launch  Fortnite on the Play Store. In another unsealed section, the complaint describes a Google Play manager reaching out to Epic about its plans to sideload  Fortnite — and apparently admitting that sideloading is a “frankly abysmal” experience in the process.\n One manager contacted Epic’s Vice President and Co-Founder to gauge Epic’s interest in a special deal and, among other things, discussed “the experience of getting  Fortnite on Android” via direct downloading. The manager’s call notes state that she viewed direct downloading  Fortnite as “frankly abysmal” and “an awful experience”, and that Epic should “worry that most will not go through the 15+ steps.”\n Another section says that “staff members have acknowledged internally that the difficulty Google imposes on consumers who wish to direct download leads to a ‘[p]oor user experience,’ in that there are ‘15+ steps to get app [via sideloading] vs 2 steps with Play or on iOS.’”\n Overall, “Google understands that the myriad barriers it erects to direct downloading have the effect of protecting its app distribution monopoly and limiting developers’ ability to distribute their apps,” Epic alleges in its complaint.\n In an internal document titled “Response to Epic”, a Google employee explained that the “install friction” associated with direct downloading was “not only a bad experience” for users but that Google knew “from its data that it will drastically limit [Epic’s] reach”. The document goes on to explain that “[f]uture [ Fortnite] updates will be challenged re: targeting, update experience via web”; that the direct downloading approach was “most associated with malicious apps”, which would be “incompatible with [Epic’s] brand/demographics”; and that “[t]he approach will create significant user confusion, since [Google Play] will still attract [billions] of users who will search for  Fortnite and run into deadends that aren’t clear how to resolve”.\n Epic’s lawsuit was recently linked with a much bigger  state antitrust complaint against Google. Like Epic, a group of state attorneys general alleges that Android is much less open than Google claims, saying it cuts create deliberate barriers — including Android phone features and deals with phone makers — to restrict third-party app stores and discourage downloading apps directly.\n  Google also removed some redactions in  the state complaints, mostly relating to its internal descriptions of how Android works. In a 2017 presentation about Amazon’s App Store, for instance, Google apparently noted that “if we were honest we would admit that most users and developers aren’t consciously ‘choosing’ they are going with the default.” And in 2019, it referred to Apple and Android as “new closed internet ecosystems” that “centralized content distribution via app stores… [and] payments via app store services” — although the larger context of those remarks isn’t clear.\n Google has strongly denied the claims in both suits. “The open Android ecosystem lets developers distribute apps through multiple app stores. For game developers who choose to use the Play Store, we have consistent policies that are fair to developers and keep the store safe for users,” it said in a previous comment on Epic’s amended filing. “While  Fortnite remains available on Android, we can no longer make it available on Play because it violates our policies. We will continue to defend ourselves against these meritless claims.”\n Epic filed lawsuits against both Apple and Google last year after it introduced a new  Fortnite payment system that sidestepped their payment systems and in-app purchase commissions, leading both companies to kick  Fortnite off their mobile stores. ( Fortnite is still available on Android devices via sideloading.) Epic’s case against Apple went to trial in May and is currently awaiting a ruling from the court.", "posttime": "2021-08-07 01:11:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,epic", "title": "法庭文件：Epic 称谷歌计划通过侧载威胁性“传染”来分发 Fortnite，并考虑购买部分或全部 Epic", "title_en": "Court filings: Epic says Google called plans to distribute Fortnite via sideloading a threatening “contagion”, and contemplated buying some or all of Epic", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22612921/google-epic-antitrust-case-court-filings-unsealed?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["谷歌", "google", "epic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我家有一个传统，每个人都轮流在一年一度的圣诞布丁中表达一个秘密的愿望。重要的是，愿望对许愿者来说是保密的，否则布丁魔法将不起作用，所以自从搬到美国后，我实施了一种散列我的愿望的新方法，这样它就可以通过短信搅拌，而搅拌器不知道愿望。布丁秘法专家向我保证，布丁魔法可以反转任何散列函数来恢复最初的愿望。去年，我从 OpenSSH 随机艺术中获得灵感，该艺术使人们能够比通过比较简单的十六进制字符串更可靠地查看两个密钥是否相同。 +-----[第一]-----+ +-----[第二]----+| .=o。 . | | ..=o 。 || . *+*。 ○ | | o 0+.. o || =.*..o | | Xo|| o + .. | | . * . . ||所以。 | |所以 。 ||哦。 | |哦。 || . . . | | . ..||哦。| | .o|| E.| | Eo|+-----------------+ +-----------------+ 试图找出十六进制代码的差异是很难，但你的大脑真的很擅长注意到 ASCII 艺术是不同的。我真的很喜欢生成的图像的通风感，所以我想我会深入研究它们是如何制作的。我几乎没有在线研究表明 OpenSSH 使用了一种由 Alexander von Gernler 设计的名为“The Drunken Bishop”的算法。然后，我找到了 Dirk Loss、Tobias Limmer 和 Alexander von Gernler 撰写的出色分析和文章，其中清楚地描述了该过程及其一些更精细的特征。我期待粗糙的密码学，但令我宽慰的是，算法真的很简单，并且巧妙地总结了一个有点奇怪的短篇小说：\n彼得主教发现自己在一个环境中庭的中间。四面都有墙，显然没有出口。地板铺有方砖，严格地黑白交替。他的头很痛——可能是因为他之前喝了太多酒——他开始随意地四处游荡。嗯，准确的说，他只走对角线——就像棋盘上的主教一样。当他撞到一堵墙时，他会移动到一边，这会将他从黑色瓷砖带到白色瓷砖（反之亦然）。每次移动后，他都会在地板上放一枚硬币，以记住他以前去过那里。走了64步，就在没有硬币的时候，彼得突然醒了过来。多么奇怪的梦啊！ Dirk Loss、Tobias Limmer 和 Alexander von Gernler – 醉酒主教：OpenSSH 指纹可视化算法的分析 总结：我们创建了一个棋盘（OpenSSH 为 17 x 9）并将我们的“主教”放在中心，将其标记为开始。然后我们将输入分解为定义 4 种可能移动的位对：{00：左上（↖），01：右上（↗），10：左下（↙），11：右下（↘ )} 对于输入中的每一对位，我们将象棋在棋盘上移动一个空间，并增加一个计数器，记录我们访问每个方块的次数。主教不是在边缘移离板，而是沿着侧面滑动，就好像它们是墙壁一样。例如，如果象在棋盘的右边缘并且下一步是 01，我们只需将象垂直向上滑动一个空格，像往常一样增加新方格上的计数器。以这种方式沿着墙壁滑动可以让象棋棋盘上的方块从黑色变为白色。在执行输入位指定的所有步骤后，我们标记最终位置。最后，通过根据访问次数为板上的每个位置分配一个符号来简单地绘制板。 OpenSSH 使用这些选择来反映“一行越来越粗的 ASCII 字符”的符号：[&#39; &#39;, &#39;.&#39;, &#39;o&#39;, &#39;+&#39;, &#39;=&#39;, &#39;*&#39;, &#39;B&#39;, &#39;0&#39;, &#39; X&#39;, &#39;@&#39;, &#39;%&#39;, &#39;&amp;&#39;, &#39;#&#39;, &#39;/&#39;, &#39;^&#39;]\n描述没有定义如果计数器 &gt;13 应该做什么，所以我选择环绕，这在实践中似乎不太可能发生。这就是 ASCII 的真正含义。但是我无法抗拒将 HTML &lt;canvas&gt; 取出并播放更多...与其将棋盘状态绘制为字符串，我们还可以利用画布的完整矢量图形功能做更多的事情。我首先划分绘图区域，为主教板上的每个方块指定一个不同的位置。当板的宽度大于高度以考虑等宽字体的非方形特性时，ASCII 版本效果最佳。在画布上制作方形网格似乎更自然，但没有要求。更大的网格会导致更长的路径和更斜的格子感觉，因为这个象不太频繁地滑到其他颜色方块上。较小的董事会感觉更忙。 17 x 17 尺寸似乎效果很好。然后我决定非常简单地遵循主教所采取的路径，在每个访问点画一个圆，其半径等于该点被访问的次数。按照创建顺序的路径会导致后面的点出现在前面的点之上。用简单的颜色循环填充圆圈效果很好，我很快就得到了令人满意的结果。我很快发现，直接从输入字符串中拉出位对会导致向上和向右移动，从而导致图像不平衡。这样做的输入消息和输出图像之间有很好的联系，但结果在视觉上并不吸引人。首先使用 SHA-3 对输入进行哈希处理为我们提供了一个固定长度的输入，可以很好地探索整个空间。我留下了散列或不向用户开放的选项。我相信这个简单的想法可以做更多的事情。扩展到三个维度或动画它浮现在脑海中。在明年的布丁愿望需要发送之前，我们将看到会发生什么……", "note_en": "There’s a tradition in my family that everyone takes a turn stirring a secret wish into the yearly  christmas pudding. It’s important that the wishes remain secret to the wisher or the pudding magics wont work so since moving to America I’ve implemented a new way of hashing my wish so it can be stirred in via text message without the stirrer knowing the wish. Experts in pudding arcana assure me that pudding magic can reverse any hash function to recover the original wish.\n Last year I took inspiration from the OpenSSH  random art that allows a human to see if two keys are the same more reliably than by comparing simple hex strings.\n      +-----[first]-----+ +-----[second]----+| .=o. . | | ..=o . || . *+*. o | | o 0+.. o || =.*..o | | X.o. o || o + .. | | . * . . || S o. | | S o . || o . | | o . || . . . | | . ..|| o .| | .o|| E.| | Eo|+-----------------+ +-----------------+\n Trying to spot the difference in the hex codes is tough but your brain is  really good at noticing that the ASCII art are different.\n I really like the airy feeling of the resulting images, so I thought I’d dig into how they are made.\n   I little online research revealed that OpenSSH uses an algorithm called “The Drunken Bishop”  devised by Alexander von Gernler. I then found an excellent  analysis and write up by Dirk Loss, Tobias Limmer, and Alexander von Gernler that clearly describes the process and some of its finer features.\n I expected gnarly cryptography, but to my relief the algorithm is really quite simple and is neatly summarised by a somewhat bizzare short story:\n Bishop Peter finds himself in the middle of an ambient atrium. There are walls on all four sides and apparently there is no exit. The floor is paved with square tiles, strictly alternating between black and white. His head heavily aching—probably from too much wine he had before—he starts wandering around randomly. Well, to be exact, he only makes diagonal steps—just like a bishop on a chess board. When he hits a wall, he moves to the side, which takes him from the black tiles to the white tiles (or vice versa). And after each move, he places a coin on the floor, to remember that he has been there before. After 64 steps, just when no coins are left, Peter suddenly wakes up. What a strange dream!\n  Dirk Loss, Tobias Limmer, and Alexander von Gernler – The drunken bishop: An analysis of the OpenSSHfingerprint visualization algorithm\n To summarise: we create a chess board (17 by 9 for OpenSSH) and place our “Bishop” at the center, marking this as the start. Then we break the input into pairs of bits that define 4 possible moves:\n {00: up-left (↖), 01: up-right (↗), 10: down-left(↙), 11: down-right (↘)}\n For each pair of bits in the input we move the bishop one space on the board and increment a counter recording how many times we visit each square. Instead of moving off the board at the edges, the bishop slides along the sides as if they were walls. For example, if the bishop is on the right edge of the board and the next move is 01 we simply slide the bishop one space vertically up, incrementing the counter on the new square as normal. Sliding along the walls in this way allows the bishop to change from black to white squares on the chess board. After carrying out all the steps dictated by the input bits we mark down the final position.\n Finally, the board is drawn simply by assigning a symbol to each position on the board according to how many times it was visited. OpenSSH uses these symbols chosen to reflect “a line of ASCII characters getting thicker”:\n [&#39; &#39;, &#39;.&#39;, &#39;o&#39;, &#39;+&#39;, &#39;=&#39;, &#39;*&#39;, &#39;B&#39;, &#39;0&#39;, &#39;X&#39;, &#39;@&#39;, &#39;%&#39;, &#39;&amp;&#39;, &#39;#&#39;, &#39;/&#39;, &#39;^&#39;]\n The description doesn’t define what should be done if a counter is &gt;13, so I chose to wrap around, this seems unlikely to occur in practice.\n That’s really it for the ASCII. But I couldn’t resist getting the HTML  &lt;canvas&gt; out and playing a little more…\n   Rather than draw the board state to a string, there’s plenty more we could do with the full vector graphics power of the canvas.\n I started out by dividing the drawing area to give a distinct position for each square on the bishop’s board. The ASCII version works best when the board is wider than it is tall to account for the non-square nature of the monospace font. On the canvas it seems more natural to make a square grid, but there’s no requirement to. A larger grid results in longer paths and a more diagonal lattice feel, as this bishop slides onto the other colour squares less frequently. Smaller boards feel busier. A  17 x 17 size seemed to work well.\n I then decided to quite simply follow the path taken by the bishop drawing a circle at each visited point with a radius equal to the number of times the point was visited. Following the path in the order it was made causes later points to appear on top of earlier points. Filling the circles with a simple colour cycle worked nicely and I was getting a pleasing result in no time.\n I quickly found that simply pulling the bit pairs directly out of an input string biases towards upward and to the right moves leading to lopsided images. There is a nice connection between the input message and the output image doing this, but the results aren’t as visually appealing. Hashing the input with  SHA-3 first gives us a fixed length input that nicely explores the full space. I left the option to hash or not open to the user.\n I’m sure there’s lots more could be done with this simple idea. Extending to three dimensions or animating it come to mind. We’ll see what comes up before next year’s pudding wish needs sending…", "posttime": "2021-08-07 01:10:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,主教,bishop,愿望", "title": "醉酒主教算法", "title_en": "The Drunken Bishop Algorithm", "transed": 1, "url": "https://www.jfurness.uk/the-drunken-bishop-algorithm/", "via": "", "real_tags": ["算法", "主教", "bishop", "愿望"]}, {"category": "", "categoryclass": "", "imagename": "0682becf6217f89473556069726eec16.jpg", "infoid": 1071803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过数月的低迷，世界上最大的 COVID-19 治疗试验之一终于重新启动。 Solidarity 是由世界卫生组织 (WHO) 领导的一项全球研究，将在住院的 COVID-19 患者中测试三种新药：癌症药物伊马替尼，一种名为英夫利昔单抗的抗体，用于治疗自身免疫性疾病，以及青蒿琥酯，一种抗疟药。挪威公共卫生研究所的 John-Arne Røttingen 说，这些药物已经运往芬兰，芬兰是第一个获得所有批准的国家，他是该研究执行小组的主席。 “我预计第一批患者可能随时会被招募到那里，”他说。其他国家很快就会加入 SolidarityPlus，因为新阶段被称为； 40 多个正在获得道德和监管批准。当最初的 Solidarity 试验于 2020 年 3 月开始时，这是第一次：在大流行期间同时在数十个国家测试药物的努力。到年底，它已经对四种治疗方法做出了判决——没有一种显示出益处——但随后陷入了与制药公司的谈判和监管延误的泥潭。 “Solidarity 再次进行随机临床试验真是太好了，因为它们已经在大流行期间为我们的治疗方法做出了重要贡献，”斯克里普斯研究转化研究所所长 Eric Topol 说。 “我们不能因为需要为重症 COVID 患者提供更好的治疗而自满。”尽管 COVID-19 疫苗的开发取得了巨大的成功，但只有两种药物被证明可以降低住院患者的 COVID-19 死亡率。 2020 年 6 月，英国的恢复试验发现，地塞米松是一种廉价的类固醇，可将该组的死亡人数减少多达三分之一。 2 月，Recovery 研究人员宣布托珠单抗（tocilizumab）是一种阻断白细胞介素 6 受体的单克隆抗体，可进一步降低死亡率。这两种药物的作用是抑制重症患者的过度免疫反应。新药还针对免疫系统而不是病毒本身。 Røttingen 解释说，在 Solidarity 中的重症患者中，抗病毒药物可能已经太晚了。 （例如，针对 SARS-CoV-2 的单克隆抗体在严重疾病发展之前给予最有效。）但病情较重的患者可以从其他针对免疫系统的药物中受益，伦敦帝国理工学院的重症监护专家安东尼戈登说.尽管地塞米松广泛地抑制免疫反应并且托珠单抗强有力地关闭了一个特定的途径，“我们仍然可以阻止其他途径，并且可能会有所作为，”戈登说。伊马替尼是一种用于治疗某些白血病和其他类型癌症的口服药物，也可以保护肺泡内的上皮细胞，肺泡上的氧气从肺部进入血液。 6 月发表的一项针对荷兰 400 名住院 COVID-19 患者的安慰剂对照试验显示，服用该药的患者在呼吸机上花费的时间更少，死亡的可能性也更低。戈登说，虽然没有统计学意义，但这些数据足以激发更大规模的研究，他是另一项名为 REMAP-CAP 的国际试验的一部分，该试验也计划测试该药物。英夫利昔单抗是一种单次输液的抗体，可阻断肿瘤坏死因子 α（免疫系统中的关键信号分子），用于治疗自身免疫性疾病，如类风湿性关节炎和炎症性肠病。 Røttingen 说，来自大量患者群体的一些观察数据表明，该药物还可以预防 COVID-19。\n青蒿琥酯是一种注射用的青蒿素衍生物，是疟疾寄生虫的强大杀手，在 SARS-CoV-2 的实验室研究中也显示出一些抗病毒活性。但是 Solidarity 正在测试它的另一个作用：该药物似乎可以减少炎症并抵消将免疫细胞吸引到组织中的信号。这可以阻止在严重的 COVID-19 中损害肺部的免疫反应。团结工会的复兴由来已久。 2020 年 10 月，它发布了来自 400 家医院的 11,000 多名患者的结果，这些结果通过显示四种治疗方法无效：HIV 联合疗法洛匹那韦/利托那韦、疟疾药物羟氯喹、干扰素β和吉利德Sciences 的抗病毒药物瑞德西韦。瑞德西韦的试验组持续了一段时间以收集更多数据——预计未来几周将获得完整的结果——但到 1 月下旬，所有试验组都已停止。不久之后，一个独立专家委员会选出了这三种新药。 Røttingen 说，推迟的部分原因是与制造商进行谈判，以确保如果这些药物有效，它们将在全球范围内以可承受的价格提供，部分原因是参与国的监管和伦理批准需要时间。罗廷根说：“我们确实看到，在流行初期，人们强烈愿意在正常系统之外进行工作，并真正加快进程，而现在情况似乎有所不同。”他补充说，这是可以理解的，“但这也表明这些流程不适合紧急情况。我们需要面向未来的快速通道系统，适用于所有国家。”", "note_en": "After months in the doldrums, one of the world’s largest trials of COVID-19 treatments is finally restarting. Solidarity, a global study led by the World Health Organization (WHO), will test three new drugs in hospitalized COVID-19 patients: the cancer drug imatinib, an antibody named infliximab that is used to treat autoimmune diseases, and artesunate, an antimalarial.\n The medicines have been shipped to Finland, the first country to have all approvals in place, says John-Arne Røttingen of the Norwegian Institute of Public Health, who chairs the study’s executive group. “I expect that the first patients will probably be recruited there any day,” he says. Other countries could soon join SolidarityPlus, as the new phase has been dubbed; more than 40 are in the process of getting ethical and regulatory approvals.\n When the  original Solidarity trial started in March 2020 it was a first: an effort to test drugs in dozens of countries simultaneously in the middle of a pandemic. By late in the year it had  delivered verdicts on four treatments—none showed a benefit—but then became mired in negotiations with pharmaceutical companies and regulatory delays. “It’s great that Solidarity is proceeding with randomized clinical trials again, as they have already made an important contribution to our therapeutic approach during the pandemic,” says Eric Topol, director of the Scripps Research Translational Institute. “We can’t be at all complacent about needing better therapies for patients with severe COVID.”\n    Although COVID-19 vaccine development has been a huge success story, only two drugs have proved to reduce COVID-19 mortality in hospitalized patients. In June 2020, the  United Kingdom’s Recovery trial  found that dexamethasone, a cheap steroid, reduced deaths in that group by up to one-third. In February,  Recovery investigators announced that tocilizumab, a monoclonal antibody that blocks the receptor for interleukin-6, reduced mortality a bit further. Both drugs work by dampening the overshooting immune response in severely sick patients.\n The new drugs also target the immune system rather than the virus itself. In the severely ill patients included in Solidarity, it’s probably too late for an antiviral drug to work, Røttingen explains. (Monoclonal antibodies to SARS-CoV-2, for example, are most effective when given before serious disease develops.) But sicker patients could benefit from additional drugs that target the immune system, says Anthony Gordon, a critical care specialist at Imperial College London. Although dexamethasone broadly dampens the immune response and tocilizumab powerfully shuts off one particular pathway, “There are still other pathways that we can block and maybe make a difference,” Gordon says.\n Imatinib, an oral drug used to treat some leukemias and other types of cancer, can also protect the epithelium lining the alveoli, where oxygen crosses from the lungs into the blood. A placebo-controlled trial in 400 hospitalized COVID-19 patients in the Netherlands,  published in June, showed patients on the drug spent less time on ventilators and were less likely to die. Although not statistically significant, the data were encouraging enough to spur larger studies, says Gordon, who is part of another  international trial called REMAP-CAP that is also planning to test the drug.\n Infliximab is an antibody given as a single infusion that blocks tumor necrosis factor alpha, a pivotal signaling molecule in the immune system, and is used to treat autoimmune diseases such as rheumatoid arthritis and inflammatory bowel disease. Some observational data from large patient populations suggest the drug can also protect against COVID-19, Røttingen says.\n Artesunate, an injected derivative of artemisinin and a powerful killer of malaria parasites, has also shown some antiviral activity in laboratory studies of SARS-CoV-2. But Solidarity is testing it because of another effect: The drug appears to reduce inflammation and counteract signals that attract immune cells into tissues. That could stop the immune reactions that damage the lungs in severe COVID-19.\n Solidarity’s revival was a long time coming. In October 2020, it  published results from more than 11,000 patients in 400 hospitals that deflated hopes—and punctured hype—by showing no benefit for four treatments: the HIV combination therapy lopinavir/ritonavir, the malaria drug hydroxychloroquine, interferon-beta, and Gilead Sciences’s antiviral drug remdesivir. The remdesivir arm was continued for a while to gather more data—full results are expected in the coming weeks—but  by late January all arms had been stopped.\n An independent expert committee picked the three new drugs soon after. The delay is due partly to negotiations with the manufacturers to ensure that the drugs would be available at affordable prices worldwide if they turned out to work, Røttingen says, and partly due to the time needed for regulatory and ethical approvals in participating countries.\n “We have definitely seen that there was a strong willingness to sort of work outside the normal system and really speed up processes in the beginning of the epidemic, and that seems to be less the case now,” Røttingen says. That’s understandable, he adds, “But it also demonstrates that these processes are not fit for emergencies. We need fast-track systems for the future, in all countries.”", "posttime": "2021-08-07 01:10:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "试验,trial,药物", "title": "Covid-19 治疗的大规模试验正在重新开始。这些是药物", "title_en": "Giant trial of Covid-19 treatments is restarting. These are the drugs", "transed": 1, "url": "https://www.sciencemag.org/news/2021/08/giant-trial-covid-19-treatments-restarting-here-are-drugs-it-s-betting", "via": "", "real_tags": ["试验", "trial", "药物"]}, {"category": "", "categoryclass": "", "imagename": "1d8b7938f305704afddd8932581d1cca.png", "infoid": 1071801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "放聪明点。购物安全。智能音箱、健身追踪器、无线耳机有多可怕？我们创建本指南是为了帮助您购买安全可靠的互联产品。", "note_en": "Be Smart. Shop Safe.\r\rHow creepy is that smart speaker, that fitness tracker, those wireless headphones? We created this guide to help you shop for safe, secure connected products.", "posttime": "2021-08-07 01:09:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mozilla,privacy,音箱", "title": "Mozilla：*不包括隐私", "title_en": "Mozilla: *Privacy Not Included", "transed": 1, "url": "https://foundation.mozilla.org/en/privacynotincluded/", "via": "", "real_tags": ["mozilla", "privacy", "音箱"]}, {"category": "", "categoryclass": "", "imagename": "0f5d64dffb588d734dab45f3ca170b61.jpg", "infoid": 1071797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，一家新的初创公司希望成为 UX 团队的关键 DesignOps 平台，并已筹集资金帮助其扩大规模。 Zeroheight 现在已经筹集了 1000 万美元的 A 轮融资，由 Tribe Capital 领投，Adobe、Y Combinator、FundersClub 和 Expa 以及天使投资人包括 Tom Preston-Werner（GitHub 联合创始人）、Bradley Horowitz（副总裁）跟投。 Google 产品）、Irene Au（为 Google 构建和运行 UX 设计）和 Nick Caldwell（Twitter 工程副总裁）。总部位于伦敦的 zeroheight 现在将扩展到旧金山/湾区，并全面发展团队。到目前为止，它的重点一直是用户体验文档，但它现在还将探索其他领域，例如缩小设计和开发之间的差距。联合创始人杰罗姆·德·拉法格 (Jerome de Lafargue) 表示：“zeroheight 为 UX 所做的事情就像 GitHub 等 DevOps 平台为构建和交付代码所做的那样，提供了一个记录和管理 UX 组件的中心位置，再加上允许团队跳过设计交接的设计 API并加快用户体验交付过程。”他说该公司解决了用户体验团队的扩展问题：“问题已经出现，因为用户体验团队在过去几年中急剧增长，因为用户体验现在对于大多数公司来说非常重要，只是为了竞争。因此，因此您现在需要集中化，您需要可重复使用的组件，以便团队可以提高效率，而不会在不断发货时降低质量。” Zeroheight 拥有 1,300 多个客户群，其中包括 Adob​​e 和 United Airlines 等多家财富 500 强公司。", "note_en": "Now, a new startup hopes to become a key DesignOps platform for UX teams, and has raised money to help it, in turn, scale-up.\n Zeroheight has now raised a $10 million Series A funding round led by Tribe Capital, with participation from Adobe, Y Combinator, FundersClub and Expa, as well as angel investors including Tom Preston-Werner (co-founder of GitHub), Bradley Horowitz (VP Product at Google), Irene Au (built and ran UX design for Google) and Nick Caldwell (VP Engineering at Twitter).\n London-based zeroheight will now expand to the San Francisco/Bay Area, and grow the team across the board. Its focus so far has been on UX documentation, but it will now also explore other areas such as closing the gap between design and development.\n Co-founder Jerome de Lafargue said: “zeroheight does for UX what DevOps platforms like GitHub do for building and shipping code, providing a central place to document and manage UX components, coupled with design APIs that allow teams to skip the design hand-off stage entirely and speed up the UX delivery process.”\n He said the company addresses the scaling problem for UX teams: “Problems have emerged because UX teams have grown dramatically in the past few years, because UX is now so important for most companies to just compete. And so because of this you now need centralization, you need components that are reusable so that teams can be efficient and not lose quality as it keeps shipping.”\n Zeroheight counts several Fortune 500 companies like Adobe and United Airlines as customers among its 1,300+ customer base.", "posttime": "2021-08-07 00:22:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "capital,tribe,团队", "title": "zeroheight 筹集了由 Tribe Capital 牵头的 1000 万美元融资，用于为 UX 团队扩展 DesignOps", "title_en": "\n\t\t\t\tzeroheight raises $10M round led by Tribe Capital to scale DesignOps for UX teams\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/zeroheight-raises-10m-round-led-by-tribe-capital-to-scale-designops-for-ux-teams/", "via": "", "real_tags": ["capital", "tribe", "团队"]}, {"category": "", "categoryclass": "", "imagename": "6305b091159fd1f2d2c17c8bed28b1c8.png", "infoid": 1071796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "换句话说，偷看，现在是点钟。在今晚 11:59 (PT) 的早鸟价结束之前购买您的通票。我们不可能在一篇文章中详细介绍所有 Disrupt 演讲、演讲者、活动和机会——相信我，我们已经尝试过了。因此，让我们只关注您不容错过的 Disrupt 2021 的一个方面。分组会议。您会发现在这三天中分散的各种会议。我们将在这里重点介绍一些，并确保在 Disrupt 2021 议程中查看所有这些。 Startup Pitch Feedback Sessions：您会在三天内找到其中的 10 个。抽出时间观看和学习在 Startup Alley 中展示的所有初创公司，并听取 TC 工作人员的反馈。你一定会学到一些技巧来提高你自己的音调。你完成我：在可组合生态系统的时代，我们现在都是合作伙伴——从死敌到纯粹的合作。那么为什么现在是邀请朋友和挑战者参加会议的合适时机呢？事实是，我们必须为未知的未来而建设，拥有共同的战略和价值成果。加入我们，探索在平台经济中鼓励更多共生关系的五种方法。由 Mambu 首席客户官 Elliott Limb 介绍。黑客美国医疗保健：很少有事情比导航医疗账单更能唤起负面情绪；美国人迫切需要解决方案来优先考虑他们的需求，降低成本并提升患者旅程，以便他们可以专注于获得护理。数字创新可以提供卓越的患者体验，消除付款人、供应商和消费者之间的摩擦。听听数字健康独角兽 Cedar 如何设计一个以消费者为先的数字平台，该平台正在彻底改变整个医疗保健行业的金融体验。雪松介绍。照顾下一代：KiwiCo 使孩子们能够通过动手工具包探索、创造和学习。 Mirvie 为早期检测和干预提供了一个个性化的怀孕窗口。 Grove 致力于通过其环保美容、家居和生活方式产品系列打造无塑料未来。听听这三家公司的杰出领导者讲述他们为现在和子孙后代创造一个更美好世界的使命，建立运动和社区，以及摆脱速度的里程碑。梅菲尔德介绍。\nTechCrunch Disrupt 2021 是您需要在 9 月 21 日至 23 日参加的地方。为什么不以低于 100 美元的价格在那里？在今晚 11:59 (PT) 交易到期之前购买早鸟通行证。贵公司是否有兴趣赞助或参展 Disrupt 2021？填写此表格，联系我们的赞助销售团队。", "note_en": "In other words, peeps, it’s now-o’clock.  Buy your pass before  the early-bird price ends tonight  at 11:59 pm (PT).\n We can’t possibly detail all of the Disrupt presentations,  speakers, events and opportunities waiting for you in one post — believe me, we’ve tried. So, let’s focus on just one aspect of Disrupt 2021 you won’t want to miss. The breakout sessions.\n You’ll find a diverse array of these sessions scattered throughout all three days. We’ll highlight a few here, and be sure to check out all of them in the  Disrupt 2021 agenda.\n Startup Pitch Feedback Sessions: You’ll find 10 of these scheduled over three days. Make time to watch and learn as all the startups exhibiting in Startup Alley pitch and hear feedback from TC staff. You’re sure to pick up tips to improve your own pitch.\n You Complete Me: In the age of the composable ecosystems, we’re all partners now – from frenemies to pure collaborations. So why is now the right time to invite friends and challengers to the table? The truth is we have to build for an unknown future, with a shared strategy and value outcome. Join us to discover five ways to encourage more symbiotic relationships in the platform economy. Presented by Elliott Limb, chief customer officer at Mambu.\n Hacking U.S. Healthcare: Few things conjure more negative emotions than navigating medical billing; Americans urgently need solutions that prioritize their needs, decrease costs and elevate the patient journey so they can focus on getting care. Digital innovation can provide exceptional patient experiences that remove friction for payers, providers and consumers. Hear how Cedar, a digital-health unicorn, engineered a consumer-first digital platform that’s revolutionizing the financial experience for the entire healthcare industry. Presented by Cedar.\n  Taking Care of the Next Generation: KiwiCo empowers kids to explore, create and learn with hands-on kits. Mirvie provides a personalized window into pregnancy for early detection and intervention. Grove is committed to a plastic-free future with its line of eco-friendly beauty, home and lifestyle products. Hear from the exceptional leaders of these three companies about their mission to create a better world now and for future generations, building movements and communities, and the milestones in getting to escape velocity. Presented by Mayfield.\n TechCrunch Disrupt 2021 is where you need to be on September 21-23. Why not be there for less than $100?  Buy an early-bird pass before  the deal expires tonight  at 11:59 pm (PT).\n Is your company interested in sponsoring or exhibiting at Disrupt 2021? Contact our sponsorship sales team by   filling out this form.", "posttime": "2021-08-07 00:22:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "techcrunch,increase,disrupt", "title": "今晚所有 TechCrunch Disrupt 2021 通行证的价格都会上涨", "title_en": "\n\t\t\t\tPrices increase tonight on all TechCrunch Disrupt 2021 passes\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/prices-increase-tonight-on-all-techcrunch-disrupt-2021-passes/", "via": "", "real_tags": ["increase", "disrupt"]}, {"category": "", "categoryclass": "", "imagename": "ce1bb4ff2971d89f10a536623322e1b4.jpg", "infoid": 1071794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据最新公开的法庭文件，谷歌考虑收购 Epic Games，因为两家公司就 Epic 的 Fortnite Android 应用程序展开了争论。昨晚，谷歌取消了 Epic 对谷歌的反垄断投诉中的一些删节，Epic 上个月对其进行了修改和重新提交。投诉仍然省略了许多关于谷歌与特定公司交易的细节，但新的细节反映了谷歌内部关于 Android 平台竞争的沟通。 Epic 声称谷歌计划通过通过其他渠道分发 Fortnite 来回避谷歌的官方 Play 商店佣金，并且在一个未编辑的部分中，它引用了一份谷歌内部文件，称 Epic 的计划是威胁谷歌的“传染病”。以下是 Epic 对这种情况的描述：谷歌甚至与业务合作伙伴分享其垄断利润，以确保他们同意排除竞争，开发了一系列内部项目来解决它从 Epic 和其他人为消费者和开发商提供有竞争力的替代品，甚至考虑购买部分或全部 Epic 以消除这种威胁。讨论这种可能性的内部消息仍然保密，投诉并未表明谷歌曾就这些计划与 Epic 接触过。它还没有给出讨论的时间表——尽管它可能发生在 Epic 于 2018 年开始计划在 Android 上推出 Fortnite 之后。 Epic 还声称谷歌向其提供了在 Play 商店推出 Fortnite 的“特别优惠”。在另一个未密封的部分，投诉描述了一位 Google Play 经理就其侧载 Fortnite 的计划与 Epic 联系——并且显然承认侧载在这个过程中是一种“坦率地糟糕”的体验。一位经理联系了 Epic 的副总裁兼联合创始人，以评估 Epic 对一项特殊交易的兴趣，并讨论了通过直接下载“在 Android 上获得 Fortnite 的体验”。经理的通话记录指出，她认为直接下载 Fortnite 是“坦率地说是糟糕透顶的”和“糟糕的体验”，并且 Epic 应该“担心大多数人不会通过 15 个以上的步骤”。另一部分说，“工作人员在内部承认，谷歌对希望直接下载的消费者施加的困难导致了‘[p]糟糕的用户体验’，因为有 15 个以上的步骤来获得应用 [通过侧载] vs Play 或 iOS 上的 2 个步骤。&#39;”\n总体而言，“谷歌明白，它为直接下载设置的无数障碍具有保护其应用分发垄断地位和限制开发人员分发应用的能力的效果，”Epi​​c 在其投诉中称。在一份名为“对 Epic 的回应”的内部文件中，一位谷歌员工解释说，与直接下载相关的“安装摩擦”对用户来说“不仅是一种糟糕的体验”，而且谷歌“从其数据中知道它将极大地限制 [Epic 的] 抵达”。该文件继续解释说，“[f]uture [Fortnite] 更新将受到挑战：定位，通过网络更新体验”；直接下载方法“与恶意应用程序最相关”，这将“与 [Epic 的] 品牌/人口统计数据不兼容”；并且“[t] 他的方法会造成严重的用户混淆，因为 [Google Play] 仍然会吸引 [数十亿] 用户，他们将搜索 Fortnite 并遇到不清楚如何解决的死胡同”。 Epic 的诉讼最近与针对谷歌的更大的州反垄断投诉有关。与 Epic 一样，一组州检察长声称 Android 的开放程度远低于谷歌声称的那样，称其削减故意设置障碍——包括 Android 手机功能和与手机制造商的交易——以限制第三方应用商店并阻止直接下载应用。谷歌还删除了州投诉中的一些删节，主要涉及其对 Android 工作原理的内部描述。例如，在 2017 年关于亚马逊 App Store 的演讲中，谷歌显然指出，“如果我们说实话，我们会承认大多数用户和开发者并没有有意识地‘选择’他们使用默认设置。”在 2019 年，它将 Apple 和 Android 称为“新的封闭互联网生态系统”，“通过应用商店集中分发内容……[和] 通过应用商店服务进行支付”——尽管这些言论的大背景尚不清楚。谷歌强烈否认了这两起诉讼中的指控。 “开放的 Android 生态系统让开发者可以通过多个应用商店分发应用。对于选择使用 Play 商店的游戏开发商，我们有一致的政策，对开发商公平，并确保商店对用户的安全，”它在之前对 Epic 修改后的文件的评论中说。 “虽然 Fortnite 在 Android 上仍然可用，但我们不能再在 Play 上提供它，因为它违反了我们的政策。我们将继续为这些毫无根据的指控辩护。” Epic 去年对苹果和谷歌提起诉讼，因为它推出了新的 Fortnite 支付系统，回避了他们的支付系统和应用内购买佣金，导致两家公司将 Fortnite 踢出他们的移动商店。 （Fortnite 仍可通过侧载在 Android 设备上使用。）Epic 对 Apple 的诉讼于 5 月开始审理，目前正在等待法院的裁决。", "note_en": "Google considered buying Epic Games as the companies sparred over Epic’s  Fortnite Android app, according to  newly unsealed court filings. Last night, Google lifted some of its redactions in Epic’s antitrust complaint against Google, which  Epic amended and refiled last month. The complaint still omits many details about Google’s dealings with specific companies, but the new details reflect internal Google communications about competition on the Android platform.\n Epic claims Google was threatened by its plans to sidestep Google’s official Play Store commission by distributing  Fortnite through other channels, and in an unredacted segment, it quotes an internal Google document calling Epic’s plans a “contagion” threatening Google. Here’s Epic’s description of the situation:\n Google has gone so far as to share its monopoly profits with business partners to secure their agreement to fence out competition, has developed a series of internal projects to address the “contagion” it perceived from efforts by Epic and others to offer consumers and developers competitive alternatives, and has even contemplated buying some or all of Epic to squelch this threat.\n The internal messages discussing that possibility remain secret, and the complaint doesn’t indicate that Google ever reached out to Epic with these plans. It also doesn’t give a timeframe for the discussion — although it presumably happened after Epic started its plans to launch  Fortnite on Android in 2018.\n Epic has also alleged that Google offered it a “special deal” to launch  Fortnite on the Play Store. In another unsealed section, the complaint describes a Google Play manager reaching out to Epic about its plans to sideload  Fortnite — and apparently admitting that sideloading is a “frankly abysmal” experience in the process.\n One manager contacted Epic’s Vice President and Co-Founder to gauge Epic’s interest in a special deal and, among other things, discussed “the experience of getting  Fortnite on Android” via direct downloading. The manager’s call notes state that she viewed direct downloading  Fortnite as “frankly abysmal” and “an awful experience”, and that Epic should “worry that most will not go through the 15+ steps.”\n Another section says that “staff members have acknowledged internally that the difficulty Google imposes on consumers who wish to direct download leads to a ‘[p]oor user experience,’ in that there are ‘15+ steps to get app [via sideloading] vs 2 steps with Play or on iOS.’”\n Overall, “Google understands that the myriad barriers it erects to direct downloading have the effect of protecting its app distribution monopoly and limiting developers’ ability to distribute their apps,” Epic alleges in its complaint.\n In an internal document titled “Response to Epic”, a Google employee explained that the “install friction” associated with direct downloading was “not only a bad experience” for users but that Google knew “from its data that it will drastically limit [Epic’s] reach”. The document goes on to explain that “[f]uture [ Fortnite] updates will be challenged re: targeting, update experience via web”; that the direct downloading approach was “most associated with malicious apps”, which would be “incompatible with [Epic’s] brand/demographics”; and that “[t]he approach will create significant user confusion, since [Google Play] will still attract [billions] of users who will search for  Fortnite and run into deadends that aren’t clear how to resolve”.\n Epic’s lawsuit was recently linked with a much bigger  state antitrust complaint against Google. Like Epic, a group of state attorneys general alleges that Android is much less open than Google claims, saying it cuts create deliberate barriers — including Android phone features and deals with phone makers — to restrict third-party app stores and discourage downloading apps directly.\n  Google also removed some redactions in  the state complaints, mostly relating to its internal descriptions of how Android works. In a 2017 presentation about Amazon’s App Store, for instance, Google apparently noted that “if we were honest we would admit that most users and developers aren’t consciously ‘choosing’ they are going with the default.” And in 2019, it referred to Apple and Android as “new closed internet ecosystems” that “centralized content distribution via app stores… [and] payments via app store services” — although the larger context of those remarks isn’t clear.\n Google has strongly denied the claims in both suits. “The open Android ecosystem lets developers distribute apps through multiple app stores. For game developers who choose to use the Play Store, we have consistent policies that are fair to developers and keep the store safe for users,” it said in a previous comment on Epic’s amended filing. “While  Fortnite remains available on Android, we can no longer make it available on Play because it violates our policies. We will continue to defend ourselves against these meritless claims.”\n Epic filed lawsuits against both Apple and Google last year after it introduced a new  Fortnite payment system that sidestepped their payment systems and in-app purchase commissions, leading both companies to kick  Fortnite off their mobile stores. ( Fortnite is still available on Android devices via sideloading.) Epic’s case against Apple went to trial in May and is currently awaiting a ruling from the court.", "posttime": "2021-08-07 00:10:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,部分,considered,epic", "title": "法庭文件称，谷歌考虑在 Fortnite Clash 期间购买“部分或全部”Epic", "title_en": "Google Considered Buying 'Some or All' of Epic During Fortnite Clash, Court Documents Say", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22612921/google-epic-antitrust-case-court-filings-unsealed", "via": "", "real_tags": ["谷歌", "google", "部分", "epic"]}, {"category": "", "categoryclass": "", "imagename": "030c581db1a3f5232215dc728ae7d926.png", "infoid": 1071792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开源社区是当今存在的协作和工程的最纯粹表达。这就是为什么我们请来 Logz.io 的工程副总裁 Doron Gill 来回答我们关于开源安全性、实施以及开源工具堆栈最适合哪些公司的问题。 Dev Interrupted Discord 社区拥有 1200 多名成员，是工程领导者进行日常对话的最佳场所。不允许销售人员。加入社区&gt;&gt;", "note_en": "The open source community is the most pure expression of collaboration and engineering that exists today.\n That’s why we’ve brought in Doron Gill, the VP of Engineering at Logz.io, to answer our questions about open source security, implementation, and which companies an open source tool stack is perfect for.\n        With over 1200 members, the Dev Interrupted Discord Community is the best place for Engineering Leaders to engage in daily conversation. No sales people allowed.  Join the community &gt;&gt;", "posttime": "2021-08-07 00:09:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,source,社区", "title": "在贵公司使用开源工具", "title_en": "Using Open Source Tools at Your Company", "transed": 1, "url": "https://devinterrupted.com/podcast/using-open-source-tools-at-your-company/", "via": "", "real_tags": ["开源", "source", "社区"]}, {"category": "", "categoryclass": "", "imagename": "470bf92ebf06abc64e37927ea97a98df.png", "infoid": 1071791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Airyx 是一个新的开源 OS 项目，旨在在 x86-64 系统上提供类似的体验和与 macOS 的一些兼容性。它建立在 FreeBSD 的坚实基础、同一空间中现有的开源包以及填补空白的新代码之上。与 macOS 应用程序的源代码兼容性（即您可以在 Airyx 上编译一个 Mac 应用程序并运行它）类似的 GUI 隐喻和熟悉的 UX（文件管理器、应用程序启动器、反映打开应用程序的顶部菜单栏等）与 macOS 文件系统（HFS+ 和APFS) 和文件夹布局（/Library、/System、/Users、/Volumes 等）在文件夹或单个文件中的自包含应用程序和（主要）无安装程序的 /Applications 体验主要保持与 FreeBSD 基本系统的兼容性和 X11 - 引擎盖下的标准 Unix 环境 如果没有 Cirrus CI 对 CI/CD 和 Cloudsmith 对包托管的慷慨支持，这个项目是不可能实现的！感谢这些很棒的组织支持开源软件！", "note_en": "Airyx is a new open source OS project that aims to provide a similar experience and some compatibiilty with macOS on x86-64 sytems. It builds on the solid foundations of FreeBSD, existing open source packages in the same space, and new code to fill the gaps.\n    source compatibility with macOS applications (i.e. you could compile a Mac application on Airyx and run it)\n similar GUI metaphors and familiar UX (file manager, application launcher, top menu bar that reflects the open application, etc)\n compatible with macOS filesystems (HFS+ and APFS) and folder layouts (/Library, /System, /Users, /Volumes, etc)\n self-contained applications in  folders or a  single file and a (mostly) installer-less experience for /Applications\n mostly maintain compatibility with the FreeBSD base system and X11 - a standard Unix environment under the hood\n  This project would not be possible without the generous support of  Cirrus CI for CI/CD and  Cloudsmith for package hosting! Thanks to these awesome organizations for supporting open source software!", "posttime": "2021-08-07 00:08:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,类似,operating,应用程序", "title": "基于 FreeBSD 的类似 macOS 的操作系统", "title_en": "A macOS-like operating system based on FreeBSD", "transed": 1, "url": "https://github.com/mszoek/airyx", "via": "", "real_tags": ["操作系统", "类似", "operating", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071790, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "调度 BGP。 PeabodyInternet-DraftUpdates：4122（如果获得批准）K. DavisIntended status：Standard Track 26 April 2021Expires：28 October 2021 New UUID Formats draft-peabody-dispatch-new-uuid-format-01Abstract 本文档介绍了新的基于时间的 UUID 格式，这些格式是适合用作数据库密钥。现代应用程序的常见情况是创建唯一标识符以用作数据库表中的主键。该标识符通常实现一个嵌入式时间戳，该时间戳可以使用最高有效位中的单调创建时间进行排序。此外，标识符具有很强的抗冲突性，难以猜测，并提供最小的安全攻击面。现有的 UUID 版本（包括 UUIDv1）都没有以最有效的方式满足这些要求中的每一个。本文档是一份更新 [RFC4122] 的提案，使用三个新的 UUID 版本来解决这些问题，每个版本都有不同的权衡。本备忘录的状态 本互联网草案的提交完全符合 BCP 78 和 BCP 79 的规定。 Internet-Drafts 是 Internet Engineering Task Force (IETF) 的工作文件。请注意，其他组也可以将工作文档作为 Internet 草案分发。当前互联网草案的列表位于 https://datatracker.ietf.org/drafts/current/。 Internet-Drafts 是有效期最长为六个月的草稿文件，可以随时更新、替换或被其他文件淘汰。将互联网草案用作参考材料或引用它们而不是“正在进行的工作”是不合适的。此互联网草案将于 2021 年 10 月 28 日到期。版权声明 版权所有 (c) 2021 IETF Trust 和确定为文档作者的人员。版权所有。 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [Page 1] Internet-Draft new-uuid-format 2021 年 4 月 本文档受 BCP 78 和 IETF Trust 与 IETF 文档相关的法律规定的约束 ( https://trustee.ietf.org/ license -info) 在本文档发布之日生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文档中提取的代码组件必须包含 Trust Legal Provisions 第 4.e 节中所述的简化 BSD 许可文本，并且不提供如简化 BSD 许可中所述的保证。目录 1. 介绍 。 . . . . . . . . . . . . . . . . . . . . . . . 2 2. 背景。 . . . . . . . . . . . . . . . . . . . . . . . . 3 3. 变更概要。 . . . . . . . . . . . . . . . . . . . . 5 4. 格式。 . . . . . . . . . . . . . . . . . . . . . . . . . . 6 4.1.版本。 . . . . . . . . . . . . . . . . . . . . . . . 6 4.2.变体。 . . . . . . . . . . . . . . . . . . . . . . . . 6 4.3. UUIDv6 布局和位顺序。 . . . . . . . . . . . . . . 7 4.3.1. UUIDv6 时间戳用法。 . . . . . . . . . . . . . . 8 4.3.2. UUIDv6 时钟序列用法。 . . . . . . . . . . . . 8 4.3.3. UUIDv6 节点使用。 . . . . . . . . . . . . . . . . . 8 4.3.4. UUIDv6 基本创建算法。 . . . . . . . . . . 8 4.4. UUIDv7 布局和位顺序。 . . . . . . . . . . . . . . 10 4.4.1. UUIDv7 时间戳用法。 . . . . . . . . . . . . . . 11 4.4.2. UUIDv7 时钟序列用法。 . . . . . . . . . . . . 11 4.4.3. UUIDv7 节点使用。 . . . . . . . . . . . . . . . . . 11 4.4.4. UUIDv7 编码和解码。 . . . . . . . . . . . 11 4.5。 UUIDv8 布局和位顺序。 . . . . . . . . . . . . . . 16 4.5.1. UUIDv8 时间戳用法。 . . . . . . . . . . . . . . 18 4.5.2. UUIDv8 时钟序列用法。 . . . . . . . . . . . . 20 4.5.3. UUIDv8 节点使用。 . . . . . . . . . . . . . . . . . 20 4.5.4. UUIDv6 基本创建算法。 . . . . . . . . . . 21 5. 编码和存储。 . . . . . . . . . . . . . . . . . . . 24 6. 全球唯一性。 . . . . . . . . . . . . . . . . . . . . . 24 7. 分布式 UUID 生成。 . . . . . . . . . . . . . . . . 24 8. IANA 考虑因素。 . . . . . . . . . . . . . . . . . . . . 25 9. 安全考虑。 . . . . . . . . . . . . . . . . . . 25 10. 致谢。 . . . . . . . . . . . . . . . . . . . . . 25 11. 规范性参考文献。 . . . . . . . . . . . . . . . . . . . 25 12. 参考资料。 . . . . . . . . . . . . . . . . . . 26 作者的地址。 . . . . . . . . . . . . . . . . . . . . . . 27 1. 介绍关键词“必须”、“不得”、“要求”、“应该”、“不应该”、“应该”、“不应该”、“推荐”、“可以”和“可选”本文档中的内容将按照 [RFC2119] 中的描述进行解释。 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [Page 2] Internet-Draft new-uuid-format 2021 年 4 月 2. 背景 自 UUID 最初创建以来，很多事情都发生了变化。现代应用程序需要使用（并且许多已经实现）UUID 作为数据库主键。使用 UUID 作为数据库键的动机主要源于应用程序在本质上越来越分布式的事实。具有整数顺序的简单“自动增量”方案在分布式系统中不能很好地工作，因为在网络上同步这些数字所需的工作很容易成为负担。 UUID 可用于在分布式系统中创建唯一且合理的短值而无需同步，这一事实使它们成为此类环境中用作数据库键的良好候选者。然而，[RFC4122] UUID 的某些属性不太适合此任务。首先，大多数现有的 UUID 版本（例如 UUIDv4）的数据库索引局部性较差。这意味着连续创建的新值在索引中彼此不接近，因此需要在随机位置执行插入。其对用于此的常见结构（B 树及其变体）的负面性能影响可能是巨大的。因此，新插入的值应该按时间排序来解决这个问题。虽然 UUIDv1 确实包含嵌入式时间戳并且可以按时间排序； UUIDv1 还有其他问题。可以按时间对版本 1 UUID 进行排序，但这是一项费力的任务。该过程需要将 UUID 的字节分成不同的部分，重新​​排列位，然后根据重建的时间戳确定顺序。这在非常大的系统中效率不高。实现将通过排序顺序进行简化，其中 UUID 可以简单地视为不透明的字节序列并按顺序排序。在嵌入时间戳之后，其余 64 位本质上用于在全球范围内和给定时间戳记内提供唯一性。时钟序列值确保当为同一个时间戳值生成多个 UUID 时，会给出一个单调序列值。这种显式排序有助于进一步促进排序。剩余的随机位确保冲突最小。 Peabody &amp; Davis 将于 2021 年 10 月 28 日到期 [第 3 页] Internet-Draft new-uuid-format 2021 年 4 月 此外，UUIDv1 使用源自公历的非标准时间戳纪元。更具体地说，协调世界时 (UTC) 作为自 1582 年 10 月 15 日 00:00:00.00 以来的 100 纳秒间隔的计数。 epoch 或其他具有应用程序所需的各种时间戳精度级别的时间戳源。最后，在版本 1 UUID 的节点字段中使用 MAC 地址会引起隐私和网络安全问题。暴露的 MAC 地址可用作攻击面来定位机器并揭示有关此类机器的各种其他信息（最低限度是制造商，可能还有其他详细信息）。相反，“密码安全”伪随机数生成器 (CSPRNG) 或伪随机数生成器 (PRNG) 应该在应用程序上下文中使用，以提供唯一性和不可猜测性。由于到目前为止 UUIDv1 和 UUIDv4 细节的缺点，许多分布广泛的数据库应用程序和大型应用程序供应商都在寻求解决创建一个更好的基于时间、可排序的唯一标识符作为数据库键的问题。这导致在过去 10 多年中以略有不同的方式解决同一问题的大量实现。在准备本规范时，对以下 16 种不同的实现进行了分析，以了解总 ID 长度、位布局、词汇格式/编码、时间戳类型、时间戳格式、时间戳准确性、节点格式/组件、冲突处理和多时间戳记号生成序列的趋势。 1. [LexicalUUID] 来自 Twitter 2. [Snowflake] 来自 Twitter 3. [Flake] 来自 Boundary 4. [ShardingID] 来自 Instagram 5. [KSUID] 来自 Segment 6. [Elasticflake] 来自 P. Pearcy 7. [FlakeID] 来自T. Pawlak 8. [Sonyflake] 由 Sony 9. [orderedUuid] 由 IT。 Cabrera 10. [ COMBGUID] R. Tallent 11. [ ULID] A. Feerasta 12. [ SID] A. Chilton 13. [ pushID ] Google 14. [ XID ] O. Poitrey 15. [ ObjectID] MongoDB 16. [CUID] 由 E. Elliott Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [第 4 页] Internet-Draft new-uuid-format 2021 年 4 月 对这些实现的检查详细说明了以下有助于定义该标准的趋势： - 时间戳必须是k-可排序的。也就是说，相同时间戳内或接近相同时间戳的值通过排序算法正确排序。 - 时间戳应该是 big-endian，按原样嵌入时间的最重要位，无需重新排序。 - 时间戳应该使用毫秒精度和 Unix Epoch 作为时间戳源。虽然，根据应用程序要求，在实现之间存在一些变化。 - 在文本表示中，ID 格式应该是可按字典顺序排序的。 - ID 必须确保正确的嵌入顺序，以便在给定时间戳期间创建多个 UUID 时进行排序。 - ID 不得要求唯一的网络标识符作为实现唯一性的一部分。 - 分布式节点必须能够在不咨询集中资源的情况下创建抗冲突的唯一 ID。 3. 变更摘要 为了解决这些挑战，本规范引入了三个新版本标识符，分配给基于时间的 UUID。第一个 UUIDv6 旨在为已经实现 UUIDv1 的应用程序最容易实现。 UUIDv6 规范保留原始公历时间戳源，但不会按照 UUIDv1 使用的过程对时间戳位重新排序。 UUIDv6 还要求必须使用伪随机数据代替 MAC 地址。其余的 UUIDv1 格式在 UUIDv6 中保持不变。参见第 4.3 节 接下来，UUIDv7 引入了一种全新的基于时间的 UUID 位布局，它利用来自广泛实施和众所周知的 Unix Epoch 时间戳源的可变长度时间戳。时间戳被分解为一个 36 位整数部分，然后是一个可变长度的字段，它表示亚秒时间戳部分，编码以便从最高到最低有效的每一位都增加了更高的精度。请参阅第 4.4 节 最后，UUIDv8 引入了一种宽松的基于时间的 UUID 格式，以迎合无法使用 UUIDv1、UUIDv6 或 UUIDv7 的应用程序实现。 UUIDv8 还通过允许来自尚未定义的时间戳源的基于时间的 UUID 格式来验证该规范的未来。可变大小的时间戳提供了很大的灵活性来创建特定于实现的 RFC 兼容基于时间的 UUID，同时保留使 UUID 出色的属性。请参阅第 4.5 节 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [第 5 页] Internet-Draft new-uuid-format 2021 年 4 月 4. 格式 16 个八位字节（128 位）的 UUID 长度保持不变。由 8-4-4-4-12 格式的 36 个十六进制和破折号字符组成的 UUID 的文本表示保持不变，以提高人类可读性。此外，版本和变体位的位置在布局中保持不变。 4.1.版本 表 1 定义了在给定 UUID 中的第 48 位到第 51 位中找到的 4 位版本。 +------+------+------+------+-------+------- ------------+ | msb0 | msb1 | msb2 | msb3 |版本 |说明 | +------+------+------+------+-------+------- ------------+ | 0 | 1 | 1 | 0 | 6 |重新排序的公历| | | | | | |基于时间的 UUID | +------+------+------+------+-------+------- ------------+ | 0 | 1 | 1 | 1 | 7 |可变长度 Unix | | | | | | |基于纪元时间的 UUID | +------+------+------+------+-------+------- ------------+ | 1 | 0 | 0 | 0 | 8 |自定义基于时间 | | | | | | | UUID | +------+------+------+------+-------+------- ------------+ 表 1：本规范 4.2 定义的 UUID 版本。变体 本规范中 UUID 使用的变体位与 [RFC4122] 第 4.1.1 节相同。表 2 列出了变体字段的内容，第 64 位和第 65 位，其中字母“x”表示“无关”值。常见的十六进制值 8 (1000)、9 (1001)、A (1010) 和 B (1011) 频繁出现在文本表示中。 +------+------+------+---------------------------- -------------+ | msb0 | msb1 | msb2 |说明 | +------+------+------+---------------------------- -------------+ | 1 | 0 | × |本文档中指定的变体。 | +------+------+------+---------------------------- -------------+ 表 2：本规范定义的 UUID 变体 Peabody &amp; Davis 将于 2021 年 10 月 28 日到期 [第 6 页] Internet-Draft new-uuid-format 2021 年 4 月 4.3。 UUIDv6 布局和位顺序 UUIDv6 旨在通过重用 UUIDv1 中的大部分位布局来最容易实现，但更改了时间戳的位顺序。其中 UUIDv1 将时间戳位拆分为三个不同的部分，并将它们排序为 time_low、time_mid、time_high_and_version。 UUIDv6 而是保持时间戳中的源位完整，并将顺序更改为 time_high、time_mid 和 time_low。顺便说一句，这将匹配原始的 60 位格里高利时间戳源。时钟序列位在 [RFC4122] 中的用法和位置保持不变。 48 位节点必须设置为伪随机值。 16 字节、128 位 UUIDv6 的格式如图 1 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ -+-+-+-+-+-+-+-+-+ | time_high | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ | time_mid | time_low_and_version | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |clk_seq_hi_res | clk_seq_low |节点 (0-1) | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |节点 (2-5) | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ 图 1：UUIDv6 字段和位布局 time_high：60 位起始时间戳的最高 32 位。占用位 0 到 31（八位字节 0-3） time_mid：60 位起始时间戳的中间 16 位。占用第 32 至 47 位（八位字节 4-5） time_low_and_version：前四个最高有效位必须包含 UUIDv6 版本 (0110)，而其余 12 位将包含来自 60 位起始时间戳的最低有效 12 位。占用位 48 到 63（八位字节 6-7） clk_seq_hi_res：前两位必须设置为 UUID 变体 (10) 其余 6 位包含时钟序列的高位部分。占用第 64 位到第 71 位（八位字节 8） Peabody &amp; Davis 2021 年 10 月 28 日到期 [第 7 页]\nInternet-Draft new-uuid-format 2021 年 4 月 clock_seq_low：时钟序列的 8 位低部分。占用位 72 到 79（八位字节 9）节点：用作空间唯一标识符的 48 位伪随机数占用位 80 到 127（八位字节 10-15） 4.3.1。 UUIDv6 时间戳用法 UUIDv6 重用 60 位格里高利时间戳，精度为 100 纳秒，在 [RFC4122] 第 4.1.4 节中定义。 4.3.2. UUIDv6 时钟序列用法 UUIDv6 不会更改 [RFC4122] 第 4.1.5 节定义的时钟序列用法。 4.3.3. UUIDv6 节点使用 UUIDv6 节点位应该设置为 48 位随机或伪随机数。 UUIDv6 节点不应使用 IEEE 802 MAC 地址或 [RFC4122]，第 4.5 节生成随机多播 IEEE 802 MAC 地址的方法。 4.3.4. UUIDv6 基本创建算法 以下实现算法基于 [RFC4122]，但有特定于 UUIDv6 的更改： 1. 从系统范围的共享稳定存储（例如，文件）或全局变量中，读取 UUID 生成器状态：用于生成最后一个 UUID 的时间戳和时钟序列。 2. 获取自 1582 年 10 月 15 日 00:00:00.00 以来 100 纳秒间隔的 60 位计数的当前时间。 3. 将 time_low 字段设置为起始 60 位时间戳的 12 个最低有效位。 4. 将时间戳截断为 48 个最高有效位以创建 time_high_and_time_mid。 5. 将 time_high 字段设置为截断时间戳的 32 个最高有效位。 6. 将 time_mid 字段设置为截断时间戳的 16 个最低有效位。 Peabody &amp; Davis 于 2021 年 10 月 28 日到期 [第 8 页] Internet-Draft new-uuid-format 2021 年 4 月 7. 通过将 4 位 UUIDv6 版本与 12 位 time_low 连接来创建 16 位 time_low_and_version。 8. 如果状态不可用（例如，不存在或损坏）或时间戳大于当前时间戳，则生成随机的 14 位时钟序列值。 9. 如果状态可用，但保存的时间戳小于或等于当前时间戳，则增加时钟序列值。 10. 通过将时钟序列连接到在 16 位值中占据最重要位置的 UUID 变体位来完成 16 位时钟序列的高、低和保留创建。 11. 生成一个 48 位的伪随机节点。 12. 将每个部分的 128 位连接起来进行格式化：time_high|time_mid|time_low_and_version|variant_clk_seq|node 13. 将状态（当前时间戳和时钟序列）保存回稳定存储 将 time_high_and_time_mid 拆分为 time_high 和 time_mid 的步骤是可选的，因为time_high 和 time_mid 的 48 位将在最终连接期间保持与 time_high_and_time_mid 相同的顺序。在重用现有的 UUIDv1 实现时，这一额外的分割为最高有效 32 位和最低有效 16 位的步骤证明很有用。其中可以应用以下逻辑以最少的修改重新排列位。 +--------------+------+--------------+ | UUIDv1 字段 |位 | UUIDv6 字段 | +--------------+------+--------------+ |时间低 | 32 | time_high | +--------------+------+--------------+ | time_mid | 16 | time_mid | +--------------+------+--------------+ | time_high | 12 |时间低 | +--------------+------+--------------+ 表 3：UUIDv1 到 UUIDv6 字段映射 Peabody &amp; Davis 到期2021 年 10 月 28 日 [第 9 页] Internet-Draft new-uuid-format 2021 年 4 月 4.4。 UUIDv7 布局和位顺序 UUIDv7 格式旨在以任意亚秒级精度对 Unix 时间戳进行编码。 UUIDv7 提供的关键属性是由一个系统生成并由另一个系统解析的时间戳值保证具有生成器或解析器的子部分精度，以较小者为准。此外，解析 UUIDv7 值的系统不需要知道在编码期间使用了哪种精度才能正常运行。 16 字节、128 位 UUIDv6 的格式如图 2 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ -+-+-+-+-+-+-+-+-+ | unixt | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |unixts | subsec_a |版本 | subsec_b | ++-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+- +-+-+-+-+-+-+-+ |var|潜艇……", "note_en": "dispatch BGP. PeabodyInternet-DraftUpdates:  4122 (if approved) K. DavisIntended status: Standards Track 26 April 2021Expires: 28 October 2021  New UUID Formats  draft-peabody-dispatch-new-uuid-format-01Abstract This document presents new time-based UUID formats which are suited for use as a database key. A common case for modern applications is to create a unique identifier for use as a primary key in a database table. This identifier usually implements an embedded timestamp that is sortable using the monotonic creation time in the most significant bits. In addition the identifier is highly collision resistant, difficult to guess, and provides minimal security attack surfaces. None of the existing UUID versions, including UUIDv1, fulfill each of these requirements in the most efficient possible way. This document is a proposal to update [ RFC4122] with three new UUID versions that address these concerns, each with different trade-offs.Status of This Memo This Internet-Draft is submitted in full conformance with the provisions of  BCP 78 and  BCP 79. Internet-Drafts are working documents of the Internet Engineering Task Force (IETF). Note that other groups may also distribute working documents as Internet-Drafts. The list of current Internet- Drafts is at  https://datatracker.ietf.org/drafts/current/. Internet-Drafts are draft documents valid for a maximum of six months and may be updated, replaced, or obsoleted by other documents at any time. It is inappropriate to use Internet-Drafts as reference material or to cite them other than as &#34;work in progress.&#34; This Internet-Draft will expire on 28 October 2021.Copyright Notice Copyright (c) 2021 IETF Trust and the persons identified as the document authors. All rights reserved. Peabody &amp; Davis Expires 28 October 2021 [Page 1]\n  Internet-Draft new-uuid-format April 2021 This document is subject to  BCP 78 and the IETF Trust&#39;s Legal Provisions Relating to IETF Documents ( https://trustee.ietf.org/  license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the  Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.Table of Contents  1. Introduction . . . . . . . . . . . . . . . . . . . . . . . .  2  2. Background . . . . . . . . . . . . . . . . . . . . . . . . .  3  3. Summary of Changes . . . . . . . . . . . . . . . . . . . . .  5  4. Format . . . . . . . . . . . . . . . . . . . . . . . . . . .  6  4.1. Versions . . . . . . . . . . . . . . . . . . . . . . . .  6  4.2. Variant . . . . . . . . . . . . . . . . . . . . . . . . .  6  4.3. UUIDv6 Layout and Bit Order . . . . . . . . . . . . . . .  7  4.3.1. UUIDv6 Timestamp Usage . . . . . . . . . . . . . . .  8  4.3.2. UUIDv6 Clock Sequence Usage . . . . . . . . . . . . .  8  4.3.3. UUIDv6 Node Usage . . . . . . . . . . . . . . . . . .  8  4.3.4. UUIDv6 Basic Creation Algorithm . . . . . . . . . . .  8  4.4. UUIDv7 Layout and Bit Order . . . . . . . . . . . . . . .  10  4.4.1. UUIDv7 Timestamp Usage . . . . . . . . . . . . . . .  11  4.4.2. UUIDv7 Clock Sequence Usage . . . . . . . . . . . . .  11  4.4.3. UUIDv7 Node Usage . . . . . . . . . . . . . . . . . .  11  4.4.4. UUIDv7 Encoding and Decoding . . . . . . . . . . . .  11  4.5. UUIDv8 Layout and Bit Order . . . . . . . . . . . . . . .  16  4.5.1. UUIDv8 Timestamp Usage . . . . . . . . . . . . . . .  18  4.5.2. UUIDv8 Clock Sequence Usage . . . . . . . . . . . . .  20  4.5.3. UUIDv8 Node Usage . . . . . . . . . . . . . . . . . .  20  4.5.4. UUIDv6 Basic Creation Algorithm . . . . . . . . . . .  21  5. Encoding and Storage . . . . . . . . . . . . . . . . . . . .  24  6. Global Uniqueness . . . . . . . . . . . . . . . . . . . . . .  24  7. Distributed UUID Generation . . . . . . . . . . . . . . . . .  24  8. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  25  9. Security Considerations . . . . . . . . . . . . . . . . . . .  25  10. Acknowledgements . . . . . . . . . . . . . . . . . . . . . .  25  11. Normative References . . . . . . . . . . . . . . . . . . . .  25  12. Informative References . . . . . . . . . . . . . . . . . . .  26 Authors&#39; Addresses . . . . . . . . . . . . . . . . . . . . . . .  27  1. Introduction The key words &#34;MUST&#34;, &#34;MUST NOT&#34;, &#34;REQUIRED&#34;, &#34;SHALL&#34;, &#34;SHALL NOT&#34;, &#34;SHOULD&#34;, &#34;SHOULD NOT&#34;, &#34;RECOMMENDED&#34;, &#34;MAY&#34;, and &#34;OPTIONAL&#34; in this document are to be interpreted as described in [ RFC2119]. Peabody &amp; Davis Expires 28 October 2021 [Page 2]\n  Internet-Draft new-uuid-format April 2021  2. Background A lot of things have changed in the time since UUIDs were originally created. Modern applications have a need to use (and many have already implemented) UUIDs as database primary keys. The motivation for using UUIDs as database keys stems primarily from the fact that applications are increasingly distributed in nature. Simplistic &#34;auto increment&#34; schemes with integers in sequence do not work well in a distributed system since the effort required to synchronize such numbers across a network can easily become a burden. The fact that UUIDs can be used to create unique and reasonably short values in distributed systems without requiring synchronization makes them a good candidate for use as a database key in such environments. However some properties of [ RFC4122] UUIDs are not well suited to this task. First, most of the existing UUID versions such as UUIDv4 have poor database index locality. Meaning new values created in succession are not close to each other in the index and thus require inserts to be performed at random locations. The negative performance effects of which on common structures used for this (B-tree and its variants) can be dramatic. As such newly inserted values SHOULD be time-ordered to address this. While it is true that UUIDv1 does contain an embedded timestamp and can be time-ordered; UUIDv1 has other issues. It is possible to sort Version 1 UUIDs by time but it is a laborious task. The process requires breaking the bytes of the UUID into various pieces, re- ordering the bits, and then determining the order from the reconstructed timestamp. This is not efficient in very large systems. Implementations would be simplified with a sort order where the UUID can simply be treated as an opaque sequence of bytes and ordered as such. After the embedded timestamp, the remaining 64 bits are in essence used to provide uniqueness both on a global scale and within a given timestamp tick. The clock sequence value ensures that when multiple UUIDs are generated for the same timestamp value are given a monotonic sequence value. This explicit sequencing helps further facilitate sorting. The remaining random bits ensure collisions are minimal. Peabody &amp; Davis Expires 28 October 2021 [Page 3]\n  Internet-Draft new-uuid-format April 2021 Furthermore, UUIDv1 utilizes a non-standard timestamp epoch derived from the Gregorian Calendar. More specifically, the Coordinated Universal Time (UTC) as a count of 100-nanosecond intervals since 00:00:00.00, 15 October 1582. Implementations and many languages may find it easier to implement the widely adopted and well known Unix Epoch, a custom epoch, or another timestamp source with various levels of timestamp precision required by the application. Lastly, privacy and network security issues arise from using a MAC address in the node field of Version 1 UUIDs. Exposed MAC addresses can be used as an attack surface to locate machines and reveal various other information about such machines (minimally manufacturer, potentially other details). Instead &#34;cryptographically secure&#34; pseudo-random number generators (CSPRNGs) or pseudo-random number generators (PRNG) SHOULD be used within an application context to provide uniqueness and unguessability. Due to the shortcomings of UUIDv1 and UUIDv4 details so far, many widely distributed database applications and large application vendors have sought to solve the problem of creating a better time- based, sortable unique identifier for use as a database key. This has lead to numerous implementations over the past 10+ years solving the same problem in slightly different ways. While preparing this specification the following 16 different implementations were analyzed for trends in total ID length, bit Layout, lexical formatting/encoding, timestamp type, timestamp format, timestamp accuracy, node format/components, collision handling and multi-timestamp tick generation sequencing. 1. [ LexicalUUID] by Twitter 2. [ Snowflake] by Twitter 3. [ Flake] by Boundary 4. [ ShardingID] by Instagram 5. [ KSUID] by Segment 6. [ Elasticflake] by P. Pearcy 7. [ FlakeID] by T. Pawlak 8. [ Sonyflake] by Sony 9. [ orderedUuid] by IT. Cabrera 10. [ COMBGUID] by R. Tallent 11. [ ULID] by A. Feerasta 12. [ SID] by A. Chilton 13. [ pushID] by Google 14. [ XID] by O. Poitrey 15. [ ObjectID] by MongoDB 16. [ CUID] by E. Elliott Peabody &amp; Davis Expires 28 October 2021 [Page 4]\n  Internet-Draft new-uuid-format April 2021 An inspection of these implementations details the following trends that help define this standard: - Timestamps MUST be k-sortable. That is, values within or close to the same timestamp are ordered properly by sorting algorithms. - Timestamps SHOULD be big-endian with the most-significant bits of the time embedded as-is without reordering. - Timestamps SHOULD utilize millisecond precision and Unix Epoch as timestamp source. Although, there is some variation to this among implementations depending on the application requirements. - The ID format SHOULD be Lexicographically sortable while in the textual representation. - IDs MUST ensure proper embedded sequencing to facilitate sorting when multiple UUIDs are created during a given timestamp. - IDs MUST NOT require unique network identifiers as part of achieving uniqueness. - Distributed nodes MUST be able to create collision resistant Unique IDs without a consulting a centralized resource.  3. Summary of Changes In order to solve these challenges this specification introduces three new version identifiers assigned for time-based UUIDs. The first, UUIDv6, aims to be the easiest to implement for applications which already implement UUIDv1. The UUIDv6 specification keeps the original Gregorian timestamp source but does not reorder the timestamp bits as per the process utilized by UUIDv1. UUIDv6 also requires that pseudo-random data MUST be used in place of the MAC address. The rest of the UUIDv1 format remains unchanged in UUIDv6. See  Section 4.3 Next, UUIDv7 introduces an entirely new time-based UUID bit layout utilizing a variable length timestamp sourced from the widely implemented and well known Unix Epoch timestamp source. The timestamp is broken into a 36-bit integer sections part, and is followed by a field of variable length which represents the sub- second timestamp portion, encoded so that each bit from most to least significant adds more precision. See  Section 4.4 Finally, UUIDv8 introduces a relaxed time-based UUID format that caters to application implementations that cannot utilize UUIDv1, UUIDv6, or UUIDv7. UUIDv8 also future-proofs this specification by allowing time-based UUID formats from timestamp sources that are not yet be defined. The variable size timestamp offers lots of flexibility to create an implementation specific RFC compliant time- based UUID while retaining the properties that make UUID great. See  Section 4.5 Peabody &amp; Davis Expires 28 October 2021 [Page 5]\n  Internet-Draft new-uuid-format April 2021  4. Format The UUID length of 16 octets (128 bits) remains unchanged. The textual representation of a UUID consisting of 36 hexadecimal and dash characters in the format 8-4-4-4-12 remains unchanged for human readability. In addition the position of both the Version and Variant bits remain unchanged in the layout.  4.1. Versions Table 1 defines the 4-bit version found in Bits 48 through 51 within a given UUID. +------+------+------+------+---------+-----------------------+ | Msb0 | Msb1 | Msb2 | Msb3 | Version | Description | +------+------+------+------+---------+-----------------------+ | 0 | 1 | 1 | 0 | 6 | Reordered Gregorian | | | | | | | time-based UUID | +------+------+------+------+---------+-----------------------+ | 0 | 1 | 1 | 1 | 7 | Variable length Unix | | | | | | | Epoch time-based UUID | +------+------+------+------+---------+-----------------------+ | 1 | 0 | 0 | 0 | 8 | Custom time-based | | | | | | | UUID | +------+------+------+------+---------+-----------------------+ Table 1: UUID versions defined by this specification  4.2. Variant The variant bits utilized by UUIDs in this specification remains the same as  [RFC4122], Section 4.1.1. The Table 2 lists the contents of the variant field, bits 64 and 65, where the letter &#34;x&#34; indicates a &#34;don&#39;t-care&#34; value. Common hex values of 8 (1000), 9 (1001), A (1010), and B (1011) frequent the text representation. +------+------+------+-----------------------------------------+ | Msb0 | Msb1 | Msb2 | Description | +------+------+------+-----------------------------------------+ | 1 | 0 | x | The variant specified in this document. | +------+------+------+-----------------------------------------+ Table 2: UUID Variant defined by this specification Peabody &amp; Davis Expires 28 October 2021 [Page 6]\n  Internet-Draft new-uuid-format April 2021  4.3. UUIDv6 Layout and Bit Order UUIDv6 aims to be the easiest to implement by reusing most of the layout of bits found in UUIDv1 but with changes to bit ordering for the timestamp. Where UUIDv1 splits the timestamp bits into three distinct parts and orders them as time_low, time_mid, time_high_and_version. UUIDv6 instead keeps the source bits from the timestamp intact and changes the order to time_high, time_mid, and time_low. Incidentally this will match the original 60-bit Gregorian timestamp source. The clock sequence bits remain unchanged from their usage and position in [ RFC4122]. The 48-bit node MUST be set to a pseudo-random value. The format for the 16-octet, 128-bit UUIDv6 is shown in Figure 1 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | time_high | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | time_mid | time_low_and_version | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ |clk_seq_hi_res | clk_seq_low | node (0-1) | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | node (2-5) | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ Figure 1: UUIDv6 Field and Bit Layout time_high: The most significant 32 bits of the 60-bit starting timestamp. Occupies bits 0 through 31 (octets 0-3) time_mid: The middle 16 bits of the 60-bit starting timestamp. Occupies bits 32 through 47 (octets 4-5) time_low_and_version: The first four most significant bits MUST contain the UUIDv6 version (0110) while the remaining 12 bits will contain the least significant 12 bits from the 60-bit starting timestamp. Occupies bits 48 through 63 (octets 6-7) clk_seq_hi_res: The first two bits MUST be set to the UUID variant (10) The remaining 6 bits contain the high portion of the clock sequence. Occupies bits 64 through 71 (octet 8) Peabody &amp; Davis Expires 28 October 2021 [Page 7]\n  Internet-Draft new-uuid-format April 2021 clock_seq_low: The 8 bit low portion of the clock sequence. Occupies bits 72 through 79 (octet 9) node: 48-bit pseudo-random number used as a spatially unique identifier Occupies bits 80 through 127 (octets 10-15)  4.3.1. UUIDv6 Timestamp Usage UUIDv6 reuses the 60-bit Gregorian timestamp with 100-nanosecond precision defined in  [RFC4122], Section 4.1.4.  4.3.2. UUIDv6 Clock Sequence Usage UUIDv6 makes no change to the Clock Sequence usage defined by  [RFC4122], Section 4.1.5.  4.3.3. UUIDv6 Node Usage UUIDv6 node bits SHOULD be set to a 48-bit random or pseudo-random number. UUIDv6 nodes SHOULD NOT utilize an IEEE 802 MAC address or the  [RFC4122], Section 4.5 method of generating a random multicast IEEE 802 MAC address.  4.3.4. UUIDv6 Basic Creation Algorithm The following implementation algorithm is based on [ RFC4122] but with changes specific to UUIDv6: 1. From a system-wide shared stable store (e.g., a file) or global variable, read the UUID generator state: the values of the timestamp and clock sequence used to generate the last UUID. 2. Obtain the current time as a 60-bit count of 100-nanosecond intervals since 00:00:00.00, 15 October 1582. 3. Set the time_low field to the 12 least significant bits of the starting 60-bit timestamp. 4. Truncate the timestamp to the 48 most significant bits in order to create time_high_and_time_mid. 5. Set the time_high field to the 32 most significant bits of the truncated timestamp. 6. Set the time_mid field to the 16 least significant bits of the truncated timestamp. Peabody &amp; Davis Expires 28 October 2021 [Page 8]\n  Internet-Draft new-uuid-format April 2021 7. Create the 16-bit time_low_and_version by concatenating the 4-bit UUIDv6 version with the 12-bit time_low. 8. If the state was unavailable (e.g., non-existent or corrupted) or the timestamp is greater than the current timestamp generate a random 14-bit clock sequence value. 9. If the state was available, but the saved timestamp is less than or equal to the current timestamp, increment the clock sequence value. 10. Complete the 16-bit clock sequence high, low and reserved creation by concatenating the clock sequence onto UUID variant bits which take the most significant position in the 16-bit value. 11. Generate a 48-bit psuedo-random node. 12. Format by concatenating the 128 bits from each parts: time_high|time_mid|time_low_and_version|variant_clk_seq|node 13. Save the state (current timestamp and clock sequence) back to the stable store The steps for splitting time_high_and_time_mid into time_high and time_mid are optional since the 48-bits of time_high and time_mid will remain in the same order as time_high_and_time_mid during the final concatenation. This extra step of splitting into the most significant 32 bits and least significant 16 bits proves useful when reusing an existing UUIDv1 implementation. In which the following logic can be applied to reshuffle the bits with minimal modifications. +--------------+------+--------------+ | UUIDv1 Field | Bits | UUIDv6 Field | +--------------+------+--------------+ | time_low | 32 | time_high | +--------------+------+--------------+ | time_mid | 16 | time_mid | +--------------+------+--------------+ | time_high | 12 | time_low | +--------------+------+--------------+ Table 3: UUIDv1 to UUIDv6 Field Mappings Peabody &amp; Davis Expires 28 October 2021 [Page 9]\n  Internet-Draft new-uuid-format April 2021  4.4. UUIDv7 Layout and Bit Order The UUIDv7 format is designed to encode a Unix timestamp with arbitrary sub-second precision. The key property provided by UUIDv7 is that timestamp values generated by one system and parsed by another are guaranteed to have sub-section precision of either the generator or the parser, whichever is less. Additionally, the system parsing the UUIDv7 value does not need to know which precision was used during encoding in order to function correctly. The format for the 16-octet, 128-bit UUIDv6 is shown in Figure 2 0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | unixts | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ |unixts | subsec_a | ver | subsec_b | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ |var| subs\n......", "posttime": "2021-08-07 00:08:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "格式,formats,uuid", "title": "新的 UUID 格式——IETF 草案", "title_en": "New UUID Formats – IETF Draft", "transed": 1, "url": "https://datatracker.ietf.org/doc/html/draft-peabody-dispatch-new-uuid-format", "via": "", "real_tags": ["格式", "formats", "uuid"]}]