[{"category": "", "categoryclass": "", "imagename": "322f4e2e19d414ec012fc785a83a6b96.jpg", "infoid": 1031314, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国宇航局证实月球阳光照耀的表面存在水，这一突破表明，与之前在黑暗和寒冷地区发现的冰相比，对地球生命至关重要的化学化合物可能分布在月球表面更多的地方。这一突破表明，月球表面存在水，这一突破性进展表明，与之前在黑暗和寒冷地区发现的冰相比，对地球生命至关重要的化合物可能分布在更多的月球表面。\n美国宇航局局长吉姆·布里登斯廷说，我们还不知道是否可以将其作为一种资源，但他补充说，更多地了解这些水对于美国探索月球的计划至关重要。\n这一发现来自航天局的红外天文平流层天文台(SOFIA)，这是一架改装后的波音747，可以将其大型望远镜带到地球大气层的高空，高度可达45000英尺。这些高度使研究人员可以凝视太空中的物体，而几乎不会受到水蒸气的任何视觉干扰。\n水分子在克拉维斯陨石坑里，这是月球南半球的一个大陨石坑。为了探测这些分子，索非亚使用了一种特殊的红外相机，可以分辨出水6.1微米的特定波长和它的密切化学相对羟基(OH)的波长。\nNASA在一份关于这一发现的新闻稿中表示，来自该地点的数据显示，月球表面分布的一立方米土壤中的水浓度为百万分之100到412，大致相当于一瓶12盎司的水。\n关于这一发现的一项研究的主要作者凯西·霍尼博尔(Casey Honniball)说，这不是水坑，而是分散得如此分散的水分子，它们不会形成冰或液态水。\n这些数据证实了专家们的怀疑，即月球阳光的一面可能存在水。但近年来，研究人员只能记录月球两极和其他更暗、更冷地区的水冰。\n专家们现在将试图找出水是如何形成的，以及为什么它会持续存在。美国宇航局的科学家在最新一期的“自然天文学”上发表了他们的发现。\nHonniball说，如果没有厚厚的大气层，阳光照耀的月球表面的水应该会流失到太空中。然而，不知何故，我们正在看到它。有什么东西在产生水，一定有什么东西把水困在那里。\n对于水的存在有几种可能的解释，包括它可能是由撞击月球的微型陨石送到地表的。根据研究人员的论文，这一过程中的玻璃珠可以捕获水，但索非亚的仪器无法区分撞击玻璃内的水和滞留在颗粒之间和空隙中的水。", "note_en": "NASA has confirmed the presence of water on the moon&#39;s sunlit surface, a breakthrough that suggests the chemical compound that is vital to life on Earth  could be distributed across more parts of the lunar surface than the ice that has previously been found in  dark and cold areas.\n  &#34;We don&#39;t know yet if we can use it as a resource,&#34; NASA Administrator Jim Bridenstine said, but he added that learning more about the water is crucial to U.S. plans to explore the moon.\n  The discovery comes from the space agency&#39;s Stratospheric Observatory for Infrared Astronomy, or SOFIA — a modified Boeing 747 that can take its large telescope high into Earth&#39;s atmosphere, at altitudes up to 45,000 feet. Those heights allow researchers to peer at objects in space with hardly any visual disruptions from water vapor.\n  The water molecules are in Clavius crater, a large crater in the moon&#39;s southern hemisphere. To detect the molecules, SOFIA used a special infrared camera that can discern between water&#39;s specific wavelength of 6.1 microns and that of its close chemical relative hydroxyl, or OH.\n    &#34;Data from this location reveal water in concentrations of 100 to 412 parts per million — roughly equivalent to a 12-ounce bottle of water — trapped in a cubic meter of soil spread across the lunar surface,&#34; NASA said in a release about the discovery.\n  &#34;This is not puddles of water but instead water molecules that are so spread apart that they do not form ice or liquid water,&#34; said Casey Honniball, the lead author of a study about the discovery.\n    The data confirm what experts have suspected, that water might exist on the moon&#39;s sunny side. But in recent years, researchers had been able to document only water ice  at the moon&#39;s poles and other darker and colder areas.\n  Experts will now try to figure out exactly how the water came to form and why it persists. NASA scientists published their findings in the latest issue of   Nature Astronomy.\n  &#34;Without a thick atmosphere, water on the sunlit lunar surface should just be lost to space,&#34; said Honniball. &#34;Yet somehow we&#39;re seeing it. Something is generating the water, and something must be trapping it there.&#34;\n  There are several possible explanations for the water&#39;s presence, including the possibility that it was delivered to the surface by micrometeorites impacting the moon. Glass beads from that process could trap water, but the SOFIA instruments cannot distinguish between water held inside impact glasses and water trapped between grains and in voids, according to the researchers&#39; paper.", "posttime": "2020-10-27 05:49:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,美国,证实,confirms,月球", "title": "美国国家航空航天局证实月球上的水分子", "title_en": "NASA Confirms Water Molecules On Moon", "transed": 1, "url": "https://www.npr.org/2020/10/26/927869069/water-on-the-moon-nasa-confirms-water-molecules-on-our-neighbors-sunny-surface", "via": "", "real_tags": ["nasa", "美国", "证实", "confirms", "月球"]}, {"category": "", "categoryclass": "", "imagename": "4e7ed6ed96318909c557ea613cff188e.jpeg", "infoid": 1031313, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前，在AMC影院租用麦克风与客人交谈比出租整个影院本身的成本更高。100美元对99美元。这似乎是对2020年电影院行业状况的相当简洁的总结。\n曾经是MoviePass的钱焚化炉现在看起来很古怪。不仅小影院苦苦挣扎，情况如此糟糕，以至于美国第二大连锁影院富豪集团(Regal)自愿决定重新关闭。而AMC(最大的连锁店)在与派拉蒙等制片厂达成协议后-几乎关闭了现金的影院窗口-现在似乎处于破产的边缘。\n情况很糟糕。Tenet无法拯救剧院，因为没有什么可以拯救剧院。我们仍处于一场大流行中，在室内与其他人亲近往好了说是不明智的，往坏了说是危险的。因此，无论社交距离有多远，一次坐在一个封闭的房间里长达数小时的生意就像是…。嗯，很难想象还有比这更糟糕的生意了。或者水烟休息室？\n但现实是，在这一切之前，电影院业务正在发生变化。多年来，迪士尼一直拥有票房，因为他们想出了在现代有意义的公式。也就是说，创造或购买人们关心的IP，并围绕这些资产发行一部又一部电影。如果可以的话，把它们都绑在一起。然后拿出那些膨胀的大片，给它们注射营销类固醇。\n如果预算足够低，较小的电影仍然可以上映。在大流行来袭之前，影院里的中等大小电影已经绝迹。Netflix和其他流媒体服务公司很乐意接受其中的一些服务。他们现在更乐意这样做了。而那些流媒体服务现在创造的一些原创公司仅仅是为了声望而渴望去电影院。这基本上是为颁奖季做营销。别告诉克里斯托弗·诺兰那个肮脏的小秘密。\n然而，大流行最终会结束。那之后有什么计划呢？\n可悲的是，当世界重新觉醒的时候，很多影院都将不复存在。那些幸存下来的人仍将面临一场艰苦的战斗，要让人们支付再次长时间呆在室内的费用。迪士尼和类似的电影将有助于现在备份的电影，但仍然会有真正的紧张局势。\n在这一点上，似乎不可避免地需要一条新的前进道路。而这条道路很可能看起来与创业之初制定的道路相似。就是拥有影院的电影公司。\n人们会记得，正是这种垂直一体化导致了20世纪40年代的派拉蒙法令。制片厂过去不仅控制着电影的制作，而且还控制着电影的放映，并以竞争的名义被迫从后者手中剥离。？正如上面那句400字所说的那样，应该清楚地表明：现在的世界非常不同了。\n而且，就像运气不错的时候一样，同意法令正在解除。这并不意味着制片厂将能够参与任何形式的反竞争行为，但这应该意味着他们可以再次拥有影院。因为，再说一次，现在的世界与20世纪40年代大不相同。\n人们可以想象迪士尼或类似的公司介入拯救AMC。也许他们仍然会同意放映其他制片厂的电影。但也许他们会超越极限来展示他们自己的作品。或者，也许迪士尼+的订阅者会得到一笔交易。等。\n然后维亚康姆哥伦比亚广播公司(派拉蒙)可能会收购帝王。康卡斯特(环球)收购Cinemark。索尼收购Cineplex。等。\n或者亚马逊可能会买下其中的一家。Netflix已经购买/挽救了几家影院，或许这种情况还会继续下去。同样，在这种情况下，它更多的是市场营销，而不是戏剧性的商业模式。你知道谁和其他人一样热爱营销吗？苹果。十年前，苹果可能拥有电影院似乎很滑稽。现在，他们向Apple TV+投入了大量资金，并吸引了最优秀的好莱坞人才，这似乎完全合乎逻辑。\n想象一下，一家电影院不是公共厕所，而是一座电影宫。你知道，就像他们在过去一样。当然，这些仍然存在于一些地方。²但世界上的资产管理公司花了过去20年的时间将它们消灭，并在它们掏空的身体中放映电影。指望世界上一些最大的公司-亚马逊(Amazons)、苹果(Apple)、迪士尼(Disney)-介入拯救电影院听起来很疯狂，但这就是世界的现状。", "note_en": "It currently  costs more to rent a microphone to talk to your guests at an AMC theater than it does to rent out  the entire theater itself.  $100 vs. $99. This seems like a pretty succinct summary of the state of the movie theater business in 2020.\n The  money incinerator that was MoviePass seems  quaint  now. Not only are small theaters struggling, things are so bad that Regal, the number two chain in the US, voluntarily decided to shut back down. And AMC (the largest chain) after  cutting a deal with studios like Paramount to  all-but close the theatrical window for cash, now seems  on the verge of insolvency.\n Things are dire.   Tenet couldn’t save the theaters because nothing could save the theaters. We’re still in the midst of a pandemic where being close to other human beings indoors is ill-advised at best and dangerous at worst. So a business that involves sitting in an enclosed room with each other, no matter how socially distanced, for hours at a time seems… well, it’s hard to imagine a worse business to be in. Maybe hookah lounges?\n But the reality is that the movie theater business was in the process of  changing before all of this. For years now,  Disney has owned the box office because they figured out the formula that makes sense in the modern age. That is, create or buy up IP that people care about and release movie after movie around those properties. Tie them all together if you can. Then take those bulked up blockbusters and inject them with marketing steroids.\n  Smaller movies can still work if the budgets are low enough. Mid-sized movies were  going extinct in theaters before the pandemic hit. Netflix and the other streaming services were happy to take some of those.  They’re even more happy to do so now. And some of the originals those streaming services now create aspire to go to theaters simply for prestige reasons. It’s basically marketing for awards season.  Don’t tell Christopher Nolan that dirty little secret.\n And yet, the pandemic will end eventually. So what’s the plan after that?\n Sadly, a lot of theaters will be gone by the time the world re-awakens. Those that survive will still face an uphill battle in getting people to pay to be indoors for prolonged periods again. Disney and the like will help with a now backed-up slate of movies, but there’s still going to be a real tension.\n It seems inevitable at this point that there’s going to need to be a new path forward. And that path may very well be one that looks similar to a path forged at the beginning of the business. That is,  studios owning theaters.\n People will remember that this type of vertical integration is what led to  the Paramount Decree in the 1940s. The studios used to control not only the production of movies, but the  exhibition of them and were forced to divest from the latter in the name of competition.¹ As the above 400ish words should make clear: the world is  very different now.\n And as a good bit of timing luck would have it,  the consent decrees are being unwound. This doesn’t mean studios will be able to partake in any kind of anti-competitive behavior, but it should mean they can own theaters again. Because, again, the world is a very different place than it was in the 1940s.\n One could imagine Disney or the like stepping in to save AMC. Perhaps with the notion that they would still agree to show other studios’ films as well. But perhaps they would go above and beyond to showcase their own. Or maybe Disney+ subscribers would get a deal. Etc.\n And then maybe ViacomCBS (Paramount) buys Regal. Comcast (Universal) buys Cinemark. Sony buys Cineplex. Etc.\n Or maybe Amazon buys one of them. Netflix has already  bought/saved a  couple of theaters, perhaps that continues. Again, in that case, it’s less about the theatrical business model and more about marketing. And you know who loves marketing just as much as anyone else? Apple. A decade ago, it would have seemed comical to have Apple potentially owning movie theaters. Now with all the money they’re  pouring into Apple TV+ and  wooing the best Hollywood talent, it may seem  downright logical.\n Imagine a movie theater that isn’t  a public restroom, but instead is  a cinematic palace. You know, like they were  in the old days. Certainly, those still exist in places.² But  the AMCs of the world spent the last 20 years wiping them out and screening films in their hollowed out carcasses. It sounds crazy to hope for a world where some of the biggest companies on the planet — the Amazons, the Apples, the Disneys — step in to save movie theaters, but such is the state of the world.", "posttime": "2020-10-27 05:49:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,ios,movie", "title": "现在是电影制片厂介入拯救电影院的时候了", "title_en": "It's Time for the Movie Studios to Step In To Save the Movie Theaters", "transed": 1, "url": "https://500ish.com/its-time-for-the-movie-studios-to-step-in-to-save-the-movie-theaters-9de38e26670c", "via": "", "real_tags": ["电影", "ios", "movie"]}, {"category": "", "categoryclass": "", "imagename": "20e53cc318ccfa899cb824d00f3852f6.jpg", "infoid": 1031312, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你会因为有可能学习一些新的和复杂的东西而感到兴奋和精力充沛吗？你会因为细微差别而兴奋吗？你真的会被新想法和富有想象力的场景所激发吗？\n如果是这样的话，你可能会有多巴胺流入你的突触，但不是我们传统上认为的这种神经递质流动的地方。\n总体而言，无序带来的增长潜力已经深深地编码在我们的DNA中。我们不仅进化了调节我们的防御和破坏性冲动的能力，而且我们还进化了理解未知事物的能力。参与探索使我们能够将新奇或意想不到的事件与现有的知识和经验相结合，这是成长所必需的过程。\n多巴胺的产生对生长至关重要。但是，关于多巴胺在认知和行为中的作用，人们有太多的误解。多巴胺经常被贴上“感觉良好的分子”的标签，但这是对这种神经递质的严重错误描述。正如人格神经学家科林·德杨(我的一位亲密同事)指出的那样，多巴胺实际上是“探索的神经调节器”。多巴胺的主要作用是让我们想要东西，而不一定是喜欢东西。当我们有可能获得奖励时，我们的大脑中会涌现出最大的多巴胺，但这种冲动并不能保证一旦我们得到它，我们就会真的喜欢它，甚至享受它。多巴胺在我们的生活中是一股巨大的能量力量，推动我们探索的动机，并促进认知和行为过程，使我们能够从未知中提取最多的快乐。\n如果多巴胺并不全是关于感觉良好的，那么为什么感觉良好的神话会在公众的想象中持续存在呢？我认为这是因为人们对多巴胺进行了如此多的研究，研究它在激励我们探索更原始的“欲望”奖励方面所起的作用，如巧克力、社会关注、社会地位、性伴侣、赌博或可卡因等毒品。\n然而，近年来，大脑中的其他多巴胺通路已经被提出，它们与信息的奖励价值密切相关。在总的探索倾向中得分高的人不仅会被驱使从事行为形式的探索，而且往往会通过发现新信息的可能性以及从他们的经历中提取意义和成长来获得活力。正如人文主义心理学家亚伯拉罕·马斯洛(Abraham Maslow)所说的那样，这些“认知需求”与人类成为一个完整的人的其他需求一样重要。\n你那呆板的多巴胺通路有多活跃？如果这些陈述中的一部分或全部描述了你，那么多巴胺很可能正强烈地流向你的前额叶皮质：\n我不明白为什么你周围的每个人都对性、毒品和金钱感兴趣，为什么你会因为激发想法和学习新的有趣的东西而如此兴奋？现在你有了一个潜在的答案：你可能对信息的奖励价值高度敏感。", "note_en": "Do you get excited and energized by the possibility of learning something new and complex? Do you get turned on by nuance? Do you get really stimulated by new ideas and imaginative scenarios?\n  If so, you may have an influx of dopamine in your synapses, but not where we traditionally think of this neurotransmitter flowing.\n  In general, the potential for growth from disorder has been encoded deeply into our DNA. We didn’t only evolve the capacity to regulate our defensive and destructive impulses, but we also evolved the capacity to make sense of the unknown. Engaging in exploration allows us to integrate novel or unexpected events with existing knowledge and experiences, a process necessary for growth.\n  Dopamine production is essential for growth. But there are so many misconceptions about the role of dopamine in cognition and behavior. Dopamine is often labeled the “feel-good molecule,” but this is a gross mischaracterization of this neurotransmitter. As personality neuroscientist Colin DeYoung (a close colleague of mine) notes, dopamine is actually the “  neuromodulator of exploration.” Dopamine’s primary role is to make us want things, not necessarily like things. We get the biggest rush of dopamine coursing through our brains at the possibility of reward, but this rush is no guarantee that we’ll actually like or even enjoy the thing once we get it. Dopamine is a huge energizing force in our lives, driving our motivation to explore and facilitating the cognitive and behavioral processes that allow us to extract the most delights from the unknown.\n  If dopamine is not all about feeling good, then why does the feel-good myth persist in the public imagination? I think it’s because so much research on dopamine has been conducted with regard to its role in motivating exploration toward our more primal “appetitive” rewards, such as chocolate, social attention, social status, sexual partners, gambling or drugs like cocaine.\n  However, in recent years, other dopamine pathways in the brain have been proposed that are strongly linked to the   reward value of information. People who score high in the general tendency toward exploration are not only driven to engage in behavioral forms of exploration, but also tend to get energized through the possibility of discovering new information and extracting meaning and growth from their experiences. These “cognitive needs,” as the humanistic psychologist Abraham Maslow referred to them, are just as important as other human needs for becoming a whole person.\n  How active is your nerdy dopamine pathway? If some or all of  these statements describe you, dopamine might well be flowing strongly to your prefrontal cortex:\n    Don’t understand why everyone else around you is so interested in sex, drugs and money, and why you get so turned on by stimulating ideas and learning new and interesting things? Now you have a potential answer: You may be highly sensitive to the reward value of information.", "posttime": "2020-10-27 04:16:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "书呆子,science,多巴胺", "title": "书呆子的科学", "title_en": "The Science of Nerdiness", "transed": 1, "url": "https://www.scientificamerican.com/article/the-science-of-nerdiness/", "via": "", "real_tags": ["书呆子", "science", "多巴胺"]}, {"category": "", "categoryclass": "", "imagename": "ca21841d42e8781869636fa985a428f8.png", "infoid": 1031311, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面是一些陈述/假设，可以帮助我解释这篇文章的想法和目标：\n重要的是，软件的构建和交付要在合理的短时间内完成。\n开发软件的方法和方式有很多种，没有一种方法对所有组织都是正确的。\n这篇文章的目标是分享我在职业生涯中学到的一种方法或一种方法的组合，以更快、更高质量地交付软件产品。这里没有我发明的任何东西。它仅仅是公司和个人通过书籍和框架建议和测试的方法的总结，并在我工作过的几家公司中应用。\n我不建议将此视为交付/质量策略。需要根据对现有方法、流程和行为的观察和分析，为每个组织量身定做交付/质量策略。然而，我确实喜欢将其视为构建软件交付和质量策略时参考的心理模型。\n我在这篇文章中想要强调的另外一件事是关于“测试”与“质量”的常见误解，以及当事情出错时求助于端到端测试(这并不是一件错误的事情)。\n请联系我进一步讨论和挑战这一模式。我很想听听你的反馈(在我的个人网站上可以找到几种联系方式)。\n在软件交付方面遇到很多困难是很常见的，而造成这种困难的原因是多方面的，这在每个组织中都是不同的。然而，围绕质量问题通常有一个共同的主题。\n质量很难下定义。这需要与团队和风险承担者进行大量沟通，以了解哪些是可接受的，哪些是不可以接受的。在开始任何改变之前，理想的做法是与人们交谈，了解他们对当前产品质量和系统行为的看法-不同的人会根据他们的角色和他们对质量的定义有不同的看法。\n做一个“软件交付回顾”，使人们能够识别当前发布过程中的痛点，编码实践中的痛点，或者规划实践中的痛点，等等。从识别问题开始。\n通常，质量斗争/问题通过首先解决测试来解决。这不是不正确的。但是，有必要记住，测试是帮助提高质量的单个组件。因此，团队还需要考虑其他组件。\n我们想要高质量的快速交货，我们想从某个地方开始。没有足够的时间进行讨论、回顾和规划。每个人都希望行动迅速，这没有什么错。因此，团队通常从增加测试覆盖率入手，从单元测试开始，到E2E测试结束。这是一件很棒的事情，我强烈鼓励这样做。但在详细介绍此方法之前，我想先谈谈端到端测试。\n我在软件开发/测试领域认识的90%的人说E2E测试不好。它们又长又脆，速度慢，易碎，易碎，而且要花很多钱。我的个人经验与这种描述一致，我认为这些测试通常会在一两年内被放弃，这取决于组织重新评估其质量流程(或整体开发-和交付-流程)和调整新的工作方式的速度，这些新的工作方式可能会消除这种痛苦，可能需要进行一些权衡。\n从上一段可能可以理解，我建议避免编写E2E测试，因为它们在一定时间后无论如何都会被放弃。事实上，我不是。我建议回归基础，采取务实的方法，最大限度地减少E2E测试的数量，以降低成本，并以不同的方式解决质量问题。\nE2e测试通常模拟真实的用户场景。由于关注用户是每个组织的目标，这使得E2E测试成为一个超级好主意。\nE2e测试有助于在应用程序的所有部分连接在一起的情况下运行应用程序，这将识别组件测试没有发现的bug\n除此之外，我们喜欢过一种没有压力的生活(或者降低我们生活中的压力水平)。增加E2E测试将在投产前提供信心，这将给利益相关者带来一些安心。\n我相信，把最终用户放在第一位，自动化回归套件，(尽可能)防止bug滑向生产，并致力于过一种没有压力的生活，这些都是正确和伟大的选择。\n决定通过添加E2E测试来解决这些问题很容易，因为团队可以识别用户场景，然后通过浏览器模拟将其自动化。通常，团队在修复/改进系统质量方面压力很大，采用E2E看起来是最快的方式。但与任何决定一样，还需要考虑其他因素。\n简单地说，E2E测试很脆弱，编写成本很高，运行起来很耗时，而且很难维护。它们很脆弱，对应用程序的微小更改都会破坏这些测试。\n使用这种方法来解决质量问题本身很快就会成为一个问题，形成一个冰激凌蛋筒：\n在这种方法中，E2E测试是第二道防线，它们涵盖了可能被忽略的依赖项。所以拥有它们是好的，但它们不能解决主要问题。E2E到位并不意味着质量问题得到解决。\n即使有相当数量的单元测试(可能还有一些集成测试)、长时间运行的E2E测试套件和非常多的手动测试，在生产中仍然可能会遇到回归错误-下一节(在代码→自动化→E2E下)将详细介绍这一点。我们能做什么？\n这些问题可能暗示现在是时候考虑有关交付高质量软件的总体方法了。\n请注意，这里我提到了质量和不是测试，因为这是两件不同的事情。测试只是会带来更好质量的活动之一(可以争论它是否是主要活动-我们不会讨论这一问题)。\n在本节中，我们将间接回答前面的一些问题(将最终用户放在第一位，阻止bug进入生产，等等)。\n测试不应该在发布之前进行。我们应该在发布之前、发布期间和发布之后不断地进行测试。我喜欢丹·阿什比(Dan Ashby)关于持续测试的以下可视化描述：\n但如何切实做到这一点，有很多工作需要完成，而且所有团队的时间和资源都是有限的。这并不容易，需要纪律和适应能力：\n询问/质询所有功能请求(我们为什么需要它？这是要实施的正确做法吗？)。\n讨论用户情景的测试(是否需要UI级别的测试，集成测试或单元测试是否足够？)。\n大多数情况下，产品已经存在，我们不能放弃现有的手动测试(特别是如果在另一个级别没有足够的覆盖率)。当团队在早期讨论对其他领域的影响时，这将给出是否需要任何进一步的手动回归测试的提示。这主要是风险评估。\n讨论分支方法是否有助于细粒度用户情景的开发和发布\n分支似乎是我们曾经建立并忘记的东西，但实际上，时不时地对其进行评估是有好处的。随着开发过程的发展，可能需要相应地调整分支策略。例如，如果我们连续发布，或者有两个主分支，那么拥有一个发布分支就没有多大意义。\n在开始开发之前，测试人员和开发人员之间的配对可能非常有用(测试优先方法-每个用户故事花费的时间不应超过15分钟)。\n在吉拉机票上写下一个班轮的变化(如果可能的话，也可以作为测试)。\n讨论如何部署用户情景(可以先部署后端吗？可以单独测试吗？是否可以在不影响系统中任何其他内容的情况下将其发布到生产中？)。\n重新访问需要自动化的内容和级别-就谁在实施哪些内容达成高级别协议是有益的。\n确定正在开发的项目在合并到主分支之前是否需要由其他人在本地进行测试。\n代码审查非常重要--为审查留出足够的时间有助于在过程的早期阶段识别问题--如果审查没有配对，那么在本地运行最新的代码并对其进行一些探索性测试可能是有益的。\n不用说，创建单元测试，并通过临时更改输入和/或实际代码来测试它们的失败\n本地测试，无论是由测试人员还是由其他工程师进行测试。这比在测试环境中进行测试要好得多(这将在流程早期显示失败，在那里编写的解决方案仍然新鲜)-基于早期完成的配对，很可能不需要另一个工程师或测试人员。\n手动测试本地实施的内容(探索性视觉测试)-是的，打开该应用程序并确保其行为符合预期。\n涵盖主要业务案例(例如，如果用户情景建议实现允许设置值的字段，则E2E将设置正确的值，保存然后验证保存的值-我们不会在此级别测试错误的值，或者按钮是否启用或禁用)。\n其他未覆盖的情况怎么办(例如，应禁用按钮)？如果可能，这些变体应该在不同的级别上涵盖。如果这是不可能的，那么在开发期间通过手动探索性测试来覆盖它就足够了-如果它后来在生产中被破坏了怎么办？如果这是一个主要场景，那么它将在测试中涵盖，不会投入生产。如果这是第二种情况，那么在生产中出现故障也没问题，只要我们有办法快速修复它并使其正常工作(发布方法在这里很重要)-但这可能不是业务的选择。在这种情况下，最好看看可能每天执行的可视测试方法，比如快照测试，其中会比较当前和以前的UI。请注意，即使有大量的测试，也不可能有无bug的软件。\n应该以尽可能快的方式进行验证。例如，如果我们可以更快地验证网络请求是用正确的值提交的，我们就不应该打开另一个页面来验证设置是否被正确保存(另一个页面应该在它自己的测试中进行练习，在该测试中我们验证保存的值是否被正确检索)。\n设置数据和访问正在测试的功能应该以尽可能快的方式进行。例如，如果我们需要单击多个按钮才能到达我们试图更新的字段，如果这样更快的话，最好直接导航到该页面并设置字段(单击按钮到达字段应该在不同的场景中执行)-如果我们需要创建用户以使字段可见以进行测试，则越好地以尽可能快的方式创建用户，无论是通过API、插入到数据库中，还是在可能的情况下模拟该记录。\n可以包括合同测试，这将有助于使其他集成和E2E测试更容易、更有效。\n单元测试有助于在开发周期的早期发现问题，这些问题可能是规范中的错误或缺陷\n单元测试在重构代码片段、升级库或扩展功能时(例如在回归测试中)提供了信心，并允许开发人员确保模块仍然正常工作。\n单元测试使集成测试变得容易得多，因为我们正在测试程序的各个部分，然后测试这些部分的总和。\n单元测试允许覆盖输入、输出和错误条件，这将有助于覆盖更多边缘情况。\n密切关注合并，以防多人在同一区域、冲突测试区附近工作。\n构建类似于分支，是值得不断评估和寻找增强它的方法的好东西。建造速度慢吗？在构建过程中有没有我们可以去掉的步骤？\n将这两个组件分开是非常重要的。这是在用户故事的基础上讨论的内容，团队定义是否需要功能标志。\n发布和部署是这一提议模型的基石。出于以下原因，建议使用持续部署战略：\n把风险降到最低。随着我们向单个版本添加更多代码(功能/修复)，风险将会增加。\n更快的生产时间，这意味着更快的反馈循环，无论是来自客户的反馈(如果是发布的)，还是来自“在生产中测试”的反馈(如果它是一个隐藏的功能。\n这通常会带来更快的交货周期和更好的质量。有些人会担心，即使在发布之前执行了大量的手动测试回归，错误仍然会被引入到生产中，那么如何在多个部署中避免这种情况呢？\n主要是这些都应该通过开发的规划来覆盖，团队在那里评估影响的区域。如果要部署/发布一大段代码，这是一个提示，它需要进一步整理并拆分成多个可部署的故事(在流程的早期投资总是值得的)。\n即使有影响，受单个更改影响的区域也比受多个更改影响的区域更容易后退。\n随之而来的是对失败的反应文化。问题会出现，能否迅速解决这些问题是成功的关键。因此，应该有一个良好的监控和“生产测试”实践，以便快速响应。\n我知道，更频繁的释放会降低风险，这似乎有点违反直觉。然而，现实中发生的情况是，这将显示出过程和制度中的薄弱环节，并有助于加强它们。\n总而言之，采用世界上一些最成功的公司选择的这一过程将有助于：\n降低部署风险-进行较小的更改意味着出现问题的可能性较小，并且更容易在出现问题时进行修复\n更快的反馈循环-如果该功能可见，最终用户将能够更快地对其进行反映。或者，使用一些有用的数据在生产中进行测试将会有很大的好处。\n下图直观地显示了我们如何分散风险、提高速度以及更快地响应问题：\n生产中的反馈是使我们能够快速响应事件的最强大的工具之一。\n有效的监控有助于快速发现问题(例如，如果发布后性能下降，我们可以快速响应)。\n监视信息有助于确定未来版本的探索性测试的优先顺序，在这些版本中，可以将重点放在高使用率的组件上。\n日志文件将提供低级详细信息，以诊断生产问题的根本原因。\n产品中的探索性测试很不错，可以帮助开发人员体验用户对该功能的看法。\n生产中的自动化E2E烟雾测试也是一个很好的想法，作为第三道防线\n此流程需要灵活和可调整，以满足业务和团队需求。质量是一个非常宽泛和主观的术语。了解这对我们的产品利益相关者意味着什么，这一点很重要。然而，交付高质量的软件产品通常可以通过文化、体系结构、测试和过程的组合来完成。\n采用分布式体系结构，并使用微服务将独立(可以说)实现对每个服务的频繁更新。\n在这种方法中，高质量的自动化测试是必要的，以便在发布时充满信心。\n我们是否满足了前面讨论的事项-将最终用户放在首位、使回归套件自动化、(尽可能)防止bug滑向生产，并以无压力的生活为目标？\n我们把最终用户放在第一位，我们让最终用户能够非常快速地访问新实施的项目，而且损坏的风险很低(我们还通过快速反馈考虑了用户的意见)。\n我们已经自动化了手动回归套件-这可能需要很长时间，我们可能没有，这会导致其他问题。我们提供了一种自动测试受影响内容和重要内容的方法。我们还建议快速反馈，快速修复循环。这样不是更好吗？\n防止bug滑向生产(尽可能多)-我们建议采用一种积极主动的方法来积极地细化、计划、创建测试和小代码块，并在流程的早期进行配对，以防止问题滑向生产。\n目标是过一种没有压力的生活-我不认为这是存在的，但随着时间的推移，我们通过部署经过单独测试的低风险项目来管理我们的压力", "note_en": "Below are a few statements / assumptions that would help me explain the idea and the goal of this post:\n It is important that the software is built and delivered in a reasonably short time\n  There are lots of methods and ways of working to develop software, and there is no single way that is correct for all organisations\n The goal of this post is to share an approach or a combination of approaches I learned in my career to deliver software products faster and with higher quality. There is nothing I invented here. It is merely a summary of methods suggested and tested by companies, individuals through books and frameworks, and applied in a few companies I worked with.\n I do not suggest to  consider this as a delivery/quality strategy. A delivery/quality strategy needs to be tailored to each organisation based on observations and analysis of existing methods, processes and behaviours. However, I do like to think of it as a mental model that I refer to when building a software delivery and quality strategy.\n One additional thing I try to highlight in this post is a common misconception about “Testing” vs “Quality”, and the resort towards End to end testing (which is not an incorrect thing) when things go wrong.\n Please reach out to me to further discuss and challenge this model. I would love to hear your feedback (A few ways to reach out can be found on my  personal website).\n  It is common to encounter lots of struggle with software delivery, and there are multiple reasons for that struggle, which would be different in each organisation. However, there is usually a common theme around quality problems.\n Quality is difficult to define. This requires lots of communication with the team and the stakeholders to understand what is acceptable and what is not. Before starting with any change, it would be ideal to talk to people and get their opinion on the current product quality and system behaviour — different individuals would have different opinions based on their roles and their definition of quality.\n  Do a “software delivery retrospective” that would enable people to identify the pain points in the current release process, in the coding practices, or the planning practices, etc. Start with identifying the problems\n  Usually, quality struggles / problems are solved by addressing tests first. This is not incorrect. However, it is necessary to keep in mind that testing is a single component that helps improve quality. So the team needs to consider other components as well.\n  We want to deliver fast with quality, and we want to start somewhere. There isn’t enough time for discussions, retrospectives and planning. Everybody wants to get moving fast, and nothing is wrong with that. So the team usually proceeds with increasing the test coverage, starting with unit tests, and ending with E2E tests. That is a great thing to do, and I highly encourage it. But before getting into the details of this approach, I would like to talk a bit about End to End tests.\n 90% of the people I know in the software development/testing domain say that E2E tests are not good. They’re lengthy, brittle, slow, fragile, flakey, and they cost a lot of money. My personal experience aligns with this description, and I think these tests are usually abandoned within a year or two, depending on the speed of the organisation in reassessing its quality processes (or overall development — and delivery — processes) and adapting new ways of working that could potentially make that pain go away, maybe with some trade-offs.\n Possibly it could be understood from the previous paragraph that I am suggesting to avoid writing E2E tests since they’re abandoned anyways after a certain period of time. In fact, I am not. I am proposing to go back to the basics, take a pragmatic approach,  minimize the amount of E2E tests to lower the cost, and address the quality problem differently.\n    E2E tests typically simulate real user scenarios. As focusing on the user is what every organisation aims for, this makes E2E tests a super good idea.\n   E2E tests help exercise the application with all of its parts connected together, which would identify bugs that the component tests did not\n In addition to that, we like to live a stress free life (or lower the stress levels in our lives). Adding E2E tests would provide confidence before releasing to production, which would give stakeholders some peace of mind.\n   I believe that putting the end user first, automating the regression suite, preventing bugs from slipping to production (as much as possible), and aiming to live a stress free life are all   rightful and great choices.\n Deciding to solve these issues through adding E2E tests is easy because the team could identify the user scenarios, then automate them through browser simulation. Usually, the team is under lots of pressure to fix/improve the system quality, and picking up E2E would look like the fastest way to go. But as with any decisions, other factors need to be taken into consideration.\n Simply the E2E tests are brittle, expensive to write, time consuming to run and difficult to maintain. They’re fragile, and small changes to the application would break these tests.\n Using this approach to address quality problems would become quickly a problem itself, forming an ice-cream cone:\n    In this approach, the E2E tests are a second line of defense, and they cover dependencies that might have been overlooked. So they’re good to have, but they do not solve the primary problem. Having E2E in place does not mean the quality problem is solved.\n Even with a reasonable amount of unit tests (and possibly some integration tests), a long running suite of E2E tests, and a very big sheet of manual tests, regression bugs might still be encountered in production — More on this in the following section (under Code → Automation → E2E). What can we do?\n These questions could be a hint that it is the time to look at the overall approach regarding delivering a high quality software.\n  Notice here that I mentioned quality and not testing, as these are 2 different things. Testing is just one of the activities that would lead to a better quality (it could be argued whether it is the main activity or not — we will not get into that debate).\n In this section we will answer some of the previous questions indirectly (putting end user first, stop bugs from going to productions, etc.).\n Testing should not happen before a release. We should be constantly testing before, during and after the release. I like the following visualisation from Dan Ashby about  continuous testing:\n  But how to do that practically, there are lots of work that need to happen, and all teams are limited on time and resources. This is not easy and requires discipline and adaptability:\n  Question / Challenge all feature requests (Why do we need it? Is that the correct thing to implement?)\n  Discuss the testing of the user story (Does it require testing on the UI level, would integration testing or unit testing be sufficient?)\n Most of the time, the product already exists, we cannot just abandon the existing manual tests (especially if there isn’t enough coverage at another level). As the team discusses the impact on other areas early on, this would give a hint whether any further manual regression testing is needed. This is mainly a risk assessment.\n  Discuss if the branching method is helping with the development of the granular user stories and releasing them\n It might seem that branching is something we set up once and forget about it, but in fact, it is good to assess it every now and again. As the development process evolve, it might be needed to adjust the branching strategy accordingly. For example, it does not make lots of sense to have a release branch if we are releasing continuously, or having 2 main branches, etc.\n  Pairing between the tester and the developer before starting with the development could be very useful (Test First approach — should not take more than 15 minutes per user story)\n Write down the variations in a one liner on the Jira ticket (or as a test if possible)\n  Discuss how to deploy the user story (can the backend go first? can it be tested separately? can it be released to production without affecting anything else in the system?)\n Re-visit what needs to be automated and at which level — good to have a high level agreement on who is implementing what\n Decide whether the item being developed requires to be tested by someone else on local before having it merged to the main branch\n Code review is very important — giving enough time for the review helps identify issues at a very early stage of the process — if the review is not being paired on then it could be benficial to run the latest code on local and give it some exploratory testing as well\n Needless to say, create unit tests, and exercise their failure by changing the input and/or the actual code temporarily\n Test locally, whether by the tester or another engineer. This is much better than testing in the test environment (this will show failures early on in the process, where the solution written is still fresh) — It is likely that another engineer or tester might not be needed based on the pairing done early on\n Manually test what is implemented locally (exploratory visual testing) — yes, open that app and make sure it’s behaving as expected\n Cover the main business cases (e.g. if the user story suggests implementing a field that allows setting up a value, then the E2E for it would be to set up a correct value, save then verify the value got saved — we do not test a wrong value at this level, or if a button got enabled or disabled)\n What about other cases that are not covered (e.g. a button should be disabled)? These variations should be covered at a different level if possible. If that was not possible, then it should be sufficient to be covered through manual exploratory testing during development — What if it got broken in production later on? if it’s a primary scenario it would be covered by tests and wouldn’t go to production. If it’s a secondary scenario then it’s alright to get broken in production, as long as we have the means to fix it quickly and get it to work (Release method is important here) — but maybe that’s not an option for the business. In this case, it is good to look at visual testing methods such as snapshot testing that get executed maybe on a daily basis, where a comparison between current and previous UI happens. Note that having a bug free software is not possible even with lots of tests in place.\n The verification should be done in the fastest way possible. For example, we should not open another page to verify that the setting got saved correctly if we can verify faster that network request got submitted with the correct value (the other page should be exercises in its own test where we verify the values saved are retrieved correctly)\n Setting up the data and accessing the feature being tested should happen in the fastest possible way. For example, if we need to click multiple button to get to the field we’re trying to update, it would be better to directly navigate to that page and set up the field if that’s faster (clicking the buttons to get to the field should be exercised in a different scenario) — In case we needed to create user to be able to get a field visible to test, the better create the user in the fastest possible way, whether through API, insertion in the DB, or even mocking that record if that’s possible\n    Could include  contract tests, which would help make other integration and E2E tests easier and more performant\n  Unit testing helps find problems early in the development cycle, which could be bugs or flaws in the specifications\n Unit tests provide confidence when refactoring a piece of code, upgrading a library or extending a feature (e.g. in regression testing), and allow the developer to make sure the module is still working correctly\n Unit tests make the integrations tests become much easier, as we’re testing parts of the program then testing the sum of these parts\n Unit tests allow coverage of inputs, outputs and error conditions, which would help in covering more edge case\n  Good to keep an eye on the merges in case multiple people where working around the same area, test areas of conflict\n The build is similar to the branch, is something good to keep assessing and finding ways to enhance it. Is the build slow? is there steps in the build that we can get rid of?\n  It is very important to separate these 2 components. This is something to be discussed on a user story basis, where the team defines whether a feature flag is needed or not\n The release &amp; deployment is the cornerstone of this proposed model. It is proposed to use a continuous deployment strategy for the following reasons:\n Minimize the risk. As we add more code (features/fixes) to a single release, the risk will increase.\n Faster time to production, which means a faster feedback loop, whether from customer if it was released, or from “Testing in production” if it was a hidden feature\n This would give a faster delivery cycle with better quality in general. Some concerns would be that bugs are still being introduced to production, even with an extensive manual testing regression executed before a release, so how would this be avoided with multiple deployments?\n Mainly this should all be covered through the planing to the development, where the team assessed the area of impact. If a large piece of code is going to be deployed/released, this is a hint that it needs to be further groomed and split into multiple deployable stories (it is always worth it to invest this time early on in the process)\n Even if there is an impact, it’s easier to regress an area impacted by a single change than by multiple changes\n Alongside this comes the culture of reaction to failure. Problems will arise, and the ability to solve these items quickly is key to success. So there should be a good monitoring and “testing in production” practice to respond fast\n I know it seems a bit counter-intuitive that releasing more frequently reduces risk. However, what happens in reality is that this will show weak points in the process and the system, and helps strengthen them.\n To summarize, adopting this process that’s chosen by some of the most successful companies in the world would help with:\n Reducing the deployment risk — doing smaller changes means there’s less probability something will go wrong, and it’s easier to fix should a problem appear\n Faster feedback loop — the end user will be able to reflect faster on the feature if it was visible. Alternatively, testing in production with some juicy data would be of great benefit\n The following graph visualizes how we’re splitting the risk, increasing our speed, and making our response to problem faster:\n   Feedback in production is one of the most powerful tools that would allow us to respond quickly to incidents\n  Effective monitoring can help discover issues quickly (for example if the performance degraded after a release, we can respond quickly)\n Monitoring info can help prioritise exploratory tests for future releases where the focus can be directed to highly used components\n  The log files would provide low-level details to diagnose root cause of an issue on prod\n Exploratory testing in production is nice and helps the developer experience how the user is seeing the feature\n Automated E2E smoke testing in production is also a great idea, as a third line of defense\n  This process needs to be flexible and adjustable to meet both business and teams needs. Quality is a very wide and subjective term. It is important to understand what it means to our product stakeholders. However, delivering quality software products usually can be done through a combination of culture, architecture, tests, and process.\n    Going with a distributed architecture, and using microservices will enable frequent updates on each service independently (arguably)\n  Automated tests with high quality are necessary in this approach in order to be confident when releasing.\n   Have we catered for the items we discussed earlier — putting the end user first, automating the regression suite, preventing bugs from slipping to production (as much as possible), and aiming to live a stress free life?\n We put the end user first, we are giving the end user a very fast access to newly implemented items, with a low risk of getting things broken (we are also taking the user opinion in consideration as well through the fast feedback)\n We have automated the manual regression suite — this might take a long long long time, which we might not have, and that would cause other problems. We came with an approach to automate the testing of what is impacted and what is important. We also suggested fast feedback, fast fix loop. Isn’t that better?\n Preventing bugs from slipping to production (as much as possible) — we are suggesting a proactive approach to aggressively refine, plan, create tests and small chucks of code, and pair early on in the process to prevent issues from slipping to production\n Aiming to live a stress free life — I don’t think this exists, but we managed our stress over time through deploying low risk items that are well tested individually", "posttime": "2020-10-27 02:42:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,高质量,model,测试", "title": "交付高质量软件的心智模型", "title_en": "Mental model to deliver high quality software", "transed": 1, "url": "https://ali-haydar.medium.com/lessons-learned-about-software-quality-or-delivery-3a05ca2e4609", "via": "", "real_tags": ["软件", "高质量", "model", "测试"]}, {"category": "", "categoryclass": "", "imagename": "92969314089082b2e34bdc9c16b55233.jpg", "infoid": 1031310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在病例和入院人数激增的情况下，比利时列日市的医生被要求继续工作，即使他们感染了冠状病毒。\n现在已有10家医院要求检测呈阳性但没有症状的工作人员继续工作。\n比利时医学会负责人告诉BBC，如果要防止医院系统在几天内崩溃，他们别无选择。\n菲利普·德沃斯博士承认，将病毒传染给患者存在明显的风险。\n在这个比利时东部城市，三分之一的人检测结果呈阳性。几天前，卫生部长弗兰克·范登布鲁克(Frank Vandenbroucke)警告说，该国正处于感染海啸的边缘，当局不再控制正在发生的事情，几天后，医院正在将患者转移到其他地方，并取消非紧急手术。\n这一决定是在欧洲各国政府试图应对新一波冠状病毒感染之际做出的。\n意大利-在3月份受到病毒的重创-已经关闭了健身房、剧院和游泳池，以求降低病例数量。周日，该国报告了超过2.12万例新感染病例。\n意大利政府警告说，病例的增加给医疗服务带来了巨大的压力，但总理朱塞佩·孔戴(Giuseppe Conte)表示，全面封锁将对经济造成灾难性影响。\n餐厅、酒吧和咖啡馆必须在18：00停止餐桌服务，午夜之前只提供外卖。接触性运动是被禁止的，但商店和大多数企业将继续营业。\n新的限制有效期至11月24日，意大利高中和大学75%的课程也将在网上进行，而不是在课堂上进行。\n据意大利媒体报道，地区政府曾要求所有课程都通过远程学习进行，但这一举措遭到了教育部长露西亚·阿佐利纳(Lucia Azzolina)的反对。\n政府还敦促人们除非绝对必要，否则不要离开家乡或城市旅行，如果可能的话，避免使用公共交通工具。\n孔特在周日的新闻发布会上表示：我们认为这个月我们会受到一些影响，但通过咬紧牙关实施这些限制，我们将能够在12月再次呼吸。\n比利时的健身房和游泳池也已经关闭，商店必须在20：00关门。现在，在公共场所戴口罩是强制性的。\nBBC Panorama发现，在英国，16岁至25岁的人在流感大流行期间失业的可能性是年龄较大的员工的两倍多。该节目看到的研究还表明，特权青年和弱势青年之间的教育差距进一步拉大。\n在法国，卫生专家警告说，每天新增新冠肺炎病例的数量可能在100,000例左右-是官方数字的两倍。\n让-弗朗索瓦·德尔弗雷西(Jean-Francois Delfraissy)教授是法国科学委员会的负责人，该委员会为政府提供流感大流行方面的建议。他说，估计的数字包括未诊断和无症状的病例。\n他告诉RTL电台，他对第二波浪潮的残酷感到惊讶，他预计第二波会比第一波严重得多，并补充道：我们的许多同胞还没有意识到等待我们的是什么。\n法国已经对包括巴黎在内的主要城市实施了夜间宵禁。周日，它又报告了一天内创纪录的5.2万例病例。该国共记录了110多万例病例，死亡人数为34780人。\n与此同时，西班牙宣布全国进入紧急状态，并在新冠肺炎感染人数再次激增的情况下实施夜间宵禁。\n总理佩德罗·桑切斯(Pedro Sánchez)表示，周日晚间生效的宵禁将在23：00至06：00之间实施。\n根据这些措施，地方当局还可以禁止地区之间的旅行。西班牙已出现100多万例病例，34750人死亡。\n在捷克共和国，一家由军队在7天多一点的时间里新建的野战医院已经移交给布拉格的主要传染病医院。该国的感染人数正在急剧上升，目前已有超过25.8万例确诊病例和2000多例死亡。\n俄罗斯官员周一表示，俄罗斯每天新增冠状病毒病例达到创纪录的17347例。报告的病例总数已超过150万例，但受灾最严重的城市莫斯科的市长表示，尽管仍有增长…。它要慢一些。", "note_en": "Doctors in the Belgian city of Liège have been asked to keep working even if they have coronavirus amid a surge in cases and hospital admissions.\n  Now 10 hospitals have requested that staff who have tested positive but do not have symptoms keep working.\n The head of the Belgian Association of Medical Unions told the BBC they had no choice if they were to prevent the hospital system collapsing within days.\n Dr Philippe Devos acknowledged that there was an obvious risk of transferring the virus to patients.\n One in three people tested are coming back positive with the virus in the eastern Belgian city. Hospitals are transferring patients elsewhere and cancelling non-urgent surgeries, days after Health Minister  Frank Vandenbroucke warned the country was close to a &#34;tsunami&#34; of infections where authorities &#34;no longer control what is happening&#34;.\n  The decision comes as governments across Europe try to tackle fresh waves of coronavirus infections.\n Italy - hit hard by the virus in March - has closed gyms, theatres and swimming pools in a bid to bring down case numbers. The country reported more than 21,200 new infections on Sunday.\n The Italian government has warned that the rise in cases was putting a huge strain on health services, but Prime Minister Giuseppe Conte said that a full lockdown would be catastrophic for the economy.\n  Restaurants, bars and cafes must stop table service at 18:00 and offer only take-away until midnight. Contact sports are prohibited but shops and most businesses will remain open.\n The new restrictions, which are in force until 24 November, will also see 75% of classes at Italy&#39;s high schools and universities conducted online instead of in a classroom.\n Regional governments had asked for all classes to be conducted via distance learning, Italian media reported, but the move was opposed by Education Minister Lucia Azzolina.\n  The government is also urging people not to travel outside their home towns or cities unless absolutely necessary and to avoid using public transport if possible.\n &#34;We think that we will suffer a bit this month but by gritting our teeth with these restrictions, we&#39;ll be able to breathe again in December,&#34; Mr Conte told a news conference on Sunday.\n   Gyms and pools have also closed in  Belgium, and shops must shut at 20:00. Masks are now compulsory in public spaces.\n In the  UK, people aged 16 to 25 are more than twice as likely as older workers to have lost their job during the pandemic,  BBC Panorama has found. Research seen by the programme also suggests the education gap between privileged and disadvantaged young people has widened further.\n In  France, health experts have warned that the number of new Covid-19 cases per day could be about 100,000 - twice the official figure.\n  Prof Jean-Francois Delfraissy, the head of France&#39;s scientific council which advises the government on the pandemic, said the estimated figure included undiagnosed and asymptomatic cases.\n He told RTL radio he was surprised by the &#34;brutality&#34; of the second wave which he expected to be much worse than the first, adding: &#34;Many of our fellow citizens have not yet realised what awaits us.&#34;\n France has already imposed night-time curfews on major cities, including Paris. On Sunday, it reported another record 52,000 cases in a day. The country has recorded more than 1.1 million cases in total and 34,780 deaths.\n Meanwhile,  Spain has declared a national state of emergency and imposed a night-time curfew amid a new spike in Covid-19 infections.\n   Prime Minister Pedro Sánchez said the curfew, which came into force on Sunday night, would be in place between the hours of 23:00 and 06:00.\n Under the measures, local authorities can also ban travel between regions. Spain has seen more than one million cases and 34,750 deaths.\n In the  Czech Republic, a new field hospital built by the army in just over seven days has been handed over to Prague&#39;s main infectious diseases hospital. The country is experiencing a steep rise in infections and now has more than 258,000 confirmed cases and more than 2,000 deaths.\n  Russia has registered a record 17,347 new daily coronavirus cases, officials said on Monday. Total reported cases have surpassed 1.5 million - but the mayor of the worst-hit city, Moscow, said that while &#34;there is still growth... it is slower&#34;.", "posttime": "2020-10-27 02:42:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,感染,belgian", "title": "Covid：感染冠状病毒的比利时医生要求继续工作", "title_en": "Covid: Belgian doctors with coronavirus asked to keep working", "transed": 1, "url": "https://www.bbc.com/news/world-europe-54688846", "via": "", "real_tags": ["病毒", "冠状病毒", "感染", "belgian"]}, {"category": "", "categoryclass": "", "imagename": "8a968ba617e73d30a8712ca595da0640.png", "infoid": 1031308, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "杰里米·英格兰是谁？这个问题有很多答案。他是一名生物化学毕业生，29岁时成为麻省理工学院物理学助理教授。他是一位被任命为拉比的人。他是大屠杀幸存者的孙子。他是地球上第一种生命形式的后代。他也可以被描述为表现出复杂的、栩栩如生的行为的原子的集合。英格兰可能会将自己描述为宇宙中众多能源消散者中的一员-他说，这似乎是回答人类几千年来一直在问的问题的一个有用的方式：生命是什么，它是如何产生的？\n这个问题--以及英格兰的答案--构成了他的新书“每个生命都着火了：热力学如何解释生物起源”的基础，这本书探讨了燃烧能量是生命的基本活动这一观点。但他说，英国没有简单、巧妙的故事可讲：这是一个复杂的、多层次的主题，必须不仅仅作为一个科学问题来对待。这就是为什么“每个生命都在燃烧”大胆地从希伯来语圣经中带来想法，并用它们来解开科学的包袱。文化和宗教传统长期以来一直在探索这一领域，他说，在我们最终从哪里来的问题上，文化和宗教传统可以补充科学的角度。他认为，如果我们真的想了解自己，我们需要的不仅仅是科学。\n你是如何将物理学和生物学结合起来，提出关于生命起源的想法的？\n我一直想学物理，因为我喜欢简单原理的预测能力。与此同时，我对生物学中形式和功能之间的关系很着迷--特别是当你看到它仍然存在的时候，当你深入到分子水平的时候。我一开始在一个结构生物学和一个细胞生物学湿实验室工作，但在这方面做得很差！当我本科毕业的时候，我在一个理论实验室工作，研究蛋白质折叠。所以对我来说，被这一组问题所吸引是很自然的。\n没有人给生命下一个无懈可击的定义，这重要吗？\n不怎么有意思。我们得到了生命是什么的概念。你可以做很多伟大的科学，同时说，“让我接受有一类东西，鱼属于它，树木属于它，但岩石不属于它，冰也不属于它。”我们可以继续使用这个词，同时承认我们对于这个词的发展从哪里来并没有真正的科学谱系。是的，会有一些疑难病例，比如病毒。但是我们可以接受这个范畴，并尽我们所能地研究这个范畴中我们感兴趣的东西的性质。\n探索的一部分也包括在无生命的事物中寻找逼真的行为，不是吗？\n在某种程度上，是的。几年前，我们在“物理评论快报”(Physical Review Letters)上发表了一篇论文，内容是关于一堆球和弹簧的模拟，只是晃动一下，弹簧就会从球上钩住和松开。然后你以一定的频率摆动其中一个弹簧，它就会以一种不同的方式混杂在一起，并以不同的方式钩在一起。现在你有了一个谐振器，它能更好地从你摆动球的频率吸收能量。学会更好地从周围环境中获取能源是一个听起来栩栩如生的反馈过程。另一方面，如果你把它举到某人面前说，“看这一大堆摇晃的球和弹簧，它是活的。”他们会嘲笑你，这是理所当然的。\n所以很明显，这是一个将会有很多不同争论的领域。有些人可能会说，“嗯，生命的根本就是它做了X。”其他人可能会说，“嗯，生活的根本就是它做Y。”我发现，当我专注于这些属性中的任何一个时，您总是可以找到示例和反例。例如，如果你对复制自己意味着什么的理解足够松散，那么蔓延的火焰就是一种自我复制现象。但是，把火说活是这个词领域的一个真正有争议的延伸。\n我们所说的生命就是所有这些不同事物的五花八门的捆绑在一起：你擅长自我复制，能量收集，等等。当你单独研究这些东西时，它是一种物理现象，有更原始的例子。但这些例子是我们有机会更好地理解基本原则的地方。\n许多物理学家理解生命的努力似乎都引用了热力学的观点，比如熵。对我来说，这感觉很不舒服，因为热力学的发展完全是为了另一个目的。你执着于热力学方法吗？\n出于历史原因，有必要谈论熵，如果我们对如何使用这个术语足够保守，它仍然可以作为一种速记有用。我现在主张的是，我们试着提出一些关于事情发生的概率的理论。是的，熵，也就是计算事情可能发生的方式的数量，确实是决定概率的天平的一部分-但它不是唯一影响概率的东西。因此，试图谈论熵是否应该增加，变得非常分散注意力。我认为谈论它的更好方式是更多地考虑可能的结果，考虑到起点，考虑到系统的驱动方式，以及系统中的波动来源。熵将是那里重要的事情之一，但不是唯一的。\n这真是太棒了！伽利略先生的调查结果是正确的。“。这个结论并不是基于你所见过的最仔细的实验，但它是最壮观的实验之一-因为它是在月球上进行的。在.。多读。\n你说生活似乎需要一个解释。你觉得你找到了一个吗？\n我的研究重点更多的是，我们是否能够发展能力，在实验环境中实现我所说的“逼真”的不同方面，通过控制和能够清楚表达的理论原则。我们可能不知道我们生活的具体例子是如何组合在一起的，但我们开始看到一个人是如何将一堆事情总体上组合在一起的。这样做的起点是将事物分解成这些不同的现象，比如能量收集、自我复制等等。在每一个方面，我们都取得了一些进展。还有更多的事情要做，但我们可以开始看看故事是如何结合在一起的。\n能源收集是你想法的核心。你认为生命出现的一个关键方面是通过耗散能量来适应环境的结构。你能详细说明一下吗？\n想象一下，我有一个受环境影响的物质集合。从本质上讲，环境是推动问题、撞击问题并使其改变形状的能量来源。我感兴趣的是，在未来的某个时候，这种物质的哪些配置可能会存在。这种可能性在一定程度上取决于在此过程中吸收和消散了多少额外的能量。在整个系统的历史进程中，高度耗散的历史将导致极有可能的结果。\n一个例子可能是一种能自我复制的细菌，它吃一些糖。它用糖来制造自己的另一个副本。现在我有两只，它们吃糖的速度更快，然后它们生出四只，然后它们吃糖的速度更快。所以化学消散正在加速走向一个可能的结果，那就是我的未来比我过去拥有更多的细菌。球和弹簧也是这样工作的。这是一个积极的反馈过程，在这个过程中，你正在探索一个有物质组合的空间。那里有一种能源。系统中的能量流动会导致正反馈关系，你会发现一个更好的能量吸收器，它会帮助你吸收更多的能量，然后你会发现另一个更好的能量吸收状态。\n有一个积极的反馈过程：我最终来到了一个特定的地方，因为我过去处于一种善于吸收能量的状态，它将我不可逆转地带向了一个我无法回头的方向。它留下了自己的印记。因此，耗散适应的一般思想是，系统的当前状态包含了我在过去必须处于某种特殊状态才能吸收大量能量的特征。这帮助我在相应的方面改变了我的身材。有时这会导致能量吸收随着时间的推移而增长，有时会导致能量吸收随着时间的推移而消亡。这两件事都会留下非常明显的指纹，这是逼真行为的不同方面。\n我还不能将这些想法严格地应用到活细胞之类的任何东西上--当然不是在实验中，甚至也不是在理论模型上。在生物学的背景下做事情要复杂得多，也要复杂得多。但我不认为做这样的实验是很遥远的事。通常情况下，如果我给生物学家看一个活细胞，我说，“看，它的行为方式是它对环境正在做的事情的反应非常聪明。”默认的假设是，“嗯，你还不理解生物学上的某些东西，这就是你所看到的东西的解释。”实验的设计必须非常仔细地进行。\n如果你还不会使用生物学，你可以用什么来探索这些想法呢？\n例如，有一些无膜液滴在不同的条件下自组织成细胞。它们似乎具有非常可塑性和弹性的特性，以帮助细胞响应不同的功能需求。生物学家可能会说，“哦，嗯，它拥有所有这些进化的能力，这些能力来自亿万年的自然选择，使它在所做的事情上变得越来越好。”但是，很难想象每一种像这样的反应都有自己的独立程序，就好像它们都是从过去学到的一样。越来越多的实验生物学家对生物系统中这些新出现的适应行为感兴趣。\n我们一直在研究原始的非生物样本。我们正在寻找的地方叫做“活性物质”。它可以包括蛋白质咀嚼化学燃料，以及相互结合和解离。但是你也可以用更大的物体来做这件事。我在佐治亚理工学院有一个合作项目，我们用机器人群来做这件事。也有“胶体颗粒”的例子，它们的表面有特殊的涂层-它们就像小型化学喷射器。而且它们已经表现出非常有趣的集体行为。活性物质是一个很好的实验大本营。你不必试图去理解活细胞，在那里，除了其他一切之外，你还可以在有机体层面上受到自然选择的所有影响。我们可以只研究像更原始的相互作用蛋白质汤一样的东西的集体行为。\n然而，“每个生命都在燃烧”仍然不是人们期待已久的生命故事的起源吗？\n这是真的：还有更多的东西需要填写。我相信有些人读了这本书后会说，“好吧，你已经谈到了不同种类的生命力以及它们是如何出现的，但这与我们所知的生命是如何组合在一起的从头到尾的完整故事不是一回事。”也许我们可以理解自我复制者是如何开始出现的，通过准确预测他们的环境或他们的行为来响应环境模式的预测机制是如何出现的。也许能量采集是我们可以理解的东西。因此，这无疑重新调整了我们的意识，即如何想象一个益生菌的情况，并思考利用周围的东西实现什么是困难的，还是容易的。但是，不，这不是一回事，这和讲述一个详细的故事不是一回事。我敢肯定，任何想要在一个令人信服和可测试的故事中寻找那样程度的细节的人都必须等待一段时间。对这样的历史距离进行取证是相当困难的。\n试图掌握生命起源的下一个阶段是什么？\n短期内，这将是关于我们能在多大程度上推动这一想法，即在正确的模式下，天真的物质可以表现出计算和学习行为。我现在正试图和我的一些合作者-佐治亚理工学院的丹·戈德曼和其他参与控制机器人群的人一起做这件事。我们想要突破这一极限，展示那种效果的确凿证据，创造出可以在实验室进行测试和验证的东西。这将使物理原理站稳脚跟。我们越能以这种方式取得令人印象深刻的成果，我们就越能加倍努力，理解这一理论的更广泛影响，并将其与其他事情联系起来。老实说，更广泛的问题是，我们如何开始谈论生活是如何结合在一起的，这是我发现更难预测的问题：我还不能断言我还看不到方向。\n有一件事使你的书特别有趣，那就是它并不完全专注于科学，而是将宗教叙事-特别是希伯来经文中摩西的故事-编织到科学叙事中。你为什么要这么做？\n谈论生命的起源，或者说什么是活的和什么不是之间的界限，涉及到更广泛的问题，而不是你可以科学理解的狭义领域。我不想把头埋在沙子里。如果我对事物进行科学的推理，我想了解它们是如何运作的。但我也是一个有其他兴趣的人。我是一个信奉宗教的犹太人--我是一名被任命的东正教拉比--我非常关心这些事情。因此，我会觉得把科学想法放在那里，而不是对一个更大的对话发表我自己的评论是愚蠢的，因为更大的对话包括对其中一些可能意味着什么的更多视角。当我决定写这本书的时候，我很快意识到我想去看看律法，看看我是否能找到一条评论，回应我已经在思考的科学问题。我当然认为可以从这个角度来思考生命和非生命之间的界限，我会争辩说，这篇文章显然包含了这样的思考。\n你认为包含所有这些不同的观点对于我们寻求自我意义很重要吗？\n很明显，关于过去发生了什么的问题并不是一个低风险的问题。你可以从人们对历史的争论中看到这一点，在非常情绪化的争论中，人们最终会对史前或宇宙学产生争议。归根结底，这是我从“律法”中学到的，你如何描述过去并不是意识形态中立的。你谈论我们是谁，我们来自哪里的方式对人们来说很重要-部分是因为这让一些人变得强大，并使他们能够说服其他人做某些事情。因此，我当然不想消除我们谈论过去所需要的任何意义框架-我们不能只有涉及基础领域或生前化学反应等概念的框架。\n有时我认为基础物理学家会鼓吹这样的概念，即当我们完成。我们只讨论弦，这就够了。但是我们已经知道，如果你仅仅从库仑定律和薛定谔方程开始，你就不能描述有趣的世界现象。它不起作用。你需要不同的语言。我们当然不应该试图减少它们的数量。物理学和生物学的不同之处在于，它们是谈论同一个世界的不同语言。试图寻找一种可以取代或包容所有其他语言的语言是错误的。我可以谈论一个人，并将其视为原子的集合，这一事实不应取代我也可以将这个人作为经济参与者、道德存在者或个人来谈论的事实。\n这不是我们应该希望耗尽的谈话。那些认为我们已经解决问题的人在某种程度上是被误导的。人们需要保持尊重，带着理智的诚实，用不同的语言交谈，并按顺序相互分享这些语言。这就是我们在理解上取得进步的方式。\n迈克尔·布鲁克斯拥有物理学博士学位，是“量子占星家手册”的作者。\n阅读杰里米·英格兰的“为什么物理学不能告诉我们生命是什么”，也在本期。", "note_en": "Who is Jeremy England? There are many answers to that question. He is a biochemistry graduate who became an MIT assistant professor in physics when he was 29 years old. He is an ordained rabbi. He is the grandson of Holocaust survivors. He is a descendant of the first life-form on Earth. He can also be described as an assemblage of atoms that exhibits complex, life-like behavior. England might describe himself as one of the many dissipators of energy in the universe—this, he says, seems to be a useful way to answer the question that humans have asked for so many millennia: What is life, and how did it arise?\n This question—and England’s answer—form the basis of his new book  Every Life Is On Fire: How Thermodynamics Explains the Origin of Living Things, which explores the idea that burning up energy is the base activity of life. But England has no simple, neat tale to tell: This is a complex, multilayered subject, and must be treated as more than a scientific issue, he says. That’s why  Every Life Is On Fire daringly brings ideas from the Hebrew Scriptures and uses them to unpack the science. Cultural and religious traditions have long been exploring this territory, he says, and can complement scientific angles on the question of where we ultimately came from. If we really want to understand ourselves, he suggests, we’ll need more than science.\n   How did you get into combining physics and biology to come up with ideas about life’s origins?\n I always wanted to do physics because I liked the predictive power of simple principles. At the same time, I was fascinated by the relationships between form and function in biology—especially when you see that it’s still there when you get down to the molecular level. I started out working in a structural biology and a cell biology wet lab, and was very bad at that! By the time I was finishing undergraduate school, I was working in a theoretical lab looking at protein folding. So it feels natural for me to be drawn to this set of questions.\n Does it matter that no one has come up with a watertight definition of life?\n Not really. We get the notion of what life is. You can do plenty of great science while saying, “Let me accept that there is a category of things where fish belongs to it, and trees belong to it, but rocks don’t belong to it, and ice doesn’t belong to it.” We can continue to use the word while admitting that we don’t really have a scientific pedigree for where the development of the word came from. And yes, there will be some difficult cases such as viruses. But we can accept the category as given, and study, to the best of our ability, the properties of the things in that category that are of interest to us.\n  Part of the quest involves seeking out life-like behavior in inanimate things too, doesn’t it?\n In a way, yes. We had a paper in   Physical Review Letters a few years ago about a simulation of a bunch of balls and springs, just jiggling and the springs were hooking and unhooking from the balls. Then you wiggled one of the springs at a certain frequency and it all jumbles and hooks together in a different way. Now you have a resonator that’s better at absorbing energy from the frequency that you’re wiggling the ball at. Learning to harvest energy better from its surroundings is a feedback process that sounds lifelike. On the other hand, if you held it up to someone and said, “Look at this jiggling mass of balls and springs, it’s alive,” they would just laugh at you, and rightly so.\n So it’s clear that this is a territory where there’s going to be a lot of different arguments. Some might say, “Well, the fundamental thing about life is that it does X.” And someone else might say, “Well, the fundamental thing about life is that it does Y.” What I find is that when I focus on any one of those properties, you can always find examples and counter-examples. If you were loose enough in your understanding of what it means to copy yourself, for instance, then a spreading fire is a self-copying phenomenon. But to call a fire alive is a really contentious extension of the domain of that word.\n What we term life is this multifarious bundle of all these different things together: You’re good at self-replication, energy harvesting, and so on. When you study each one of those things on its own, it’s a physical phenomenon that has more primitive examples. But those examples are where we have a chance of understanding the fundamental principle better.\n A lot of physicists’ efforts to understand life seem to invoke ideas from thermodynamics, such as entropy. To me, that feels uncomfortable, because thermodynamics was developed for another purpose entirely. Are you wedded to a thermodynamics approach?\n It’s necessary to talk about entropy for historical reasons, and if we are conservative enough about how we use the term, it can still be useful as a shorthand. What I advocate for now is that we try to make theories that talk about the probability of things happening. And yes, it’s true that entropy, which is counting the number of ways something could happen, is part of what weighs on the scale in determining probabilities—but it is not the only thing that impacts probability. So trying to talk about whether entropy should increase becomes very distracting. I think a better way to talk about it is more to consider what is the likely outcome, given the starting point, given the way the system is being driven, and given the sources of fluctuation in the system. Entropy will be one of the things that matters there, but not the only one.\n How about that! Mr. Galileo was correct in his findings.” That conclusion wasn’t based on the most careful experiment you’ll ever see, but it was one of the most spectacular in its way—because it was performed on the moon. In...  READ MORE\n You say that life seems to demand an explanation. Do you think that you’ve found one?\n The focus of my line of research is more about whether we can develop the capability to bring about the different aspects of what I would call “lifelikeness” in experimental settings, with control and with theoretical principles that can be clearly articulated. We may not know exactly how our particular example of life got put together, but we start to see how one puts a bunch of things together in general. The starting point for that is to break things apart into these different phenomena like energy-harvesting, self-replication, et cetera. With each of those, we’ve made some progress. There’s more to do, but we can start to see how a story might come together.\n Energy harvesting is central to your ideas. You suggest a key aspect of life’s emergence is down to structures that adapt to their environment by dissipating energy. Can you elaborate on that?\n Imagine I have a collection of matter under the influence of an environment. The environment is essentially sources of energy that are kicking the matter and knocking into it and allowing it to change shape. I’m interested in which configurations of that matter will be likely to exist at some point in the future. That likelihood depends, in part, on how much extra energy was absorbed and dissipated on the way. Over the course of the whole history of the system, highly dissipative histories are going to lead to highly likely outcomes.\n  An example might be a self-copying bacterium that eats some sugar. It uses the sugar to build another copy of itself. Now I have two of them and they eat the sugar even faster, and then they make four of them, and then they eat the sugar even faster. So the chemical dissipation is accelerating toward a likely outcome, which is that I have more bacteria in my future than I had in my past. The balls and springs work that way as well. It’s a positive feedback process where you’re exploring a space with combinations of matter. There’s an energy source. And the flow of energy through the system is leading to a positive feedback relationship where you find a better energy absorber and it helps you absorb even more energy, then you find another even better energy absorbing state.\n   There’s a feedback process that’s positive: I end up in a particular place because I was in a state in my past that was good at absorbing energy and it carried me irreversibly in a certain direction that I can’t go back from. It left its mark. So the general idea with dissipative adaptation is that the current state of the system holds the signature of how I had to be in some special state in my past to absorb a lot of energy. That helped me change my shape in consequential ways. Sometimes that leads to growing energy absorption over time, and sometimes it leads to extinction of energy absorption over time. And both of those things can leave very noticeable fingerprints that are different aspects of lifelike behavior.\n  I haven’t been able to apply these ideas rigorously to anything like living cells yet—certainly not in experiments, but also not even with theoretical models. It’s much messier and more complicated to try to get things done in the biological context. But I don’t think that doing that kind of experiment is a long way away. Usually if I show a biologist a living cell and I say, “Look, it’s behaving in this way where it’s being very smart in how it’s reacting to something its environment is doing,” the default assumption is, “Well, there’s something you don’t understand yet about the biology, and that’s the explanation to what you’re seeing.” The design of experiments will have to be done very carefully.\n If you can’t yet use biology, what can you use to explore these ideas?\n There are membrane-less droplets, for instance, that self-organize into cells under different conditions. They seem to have very plastic and flexible properties to help the cell respond to different functional needs. A biologist might say, “Oh, well, it has all of these evolved abilities that come from eons of natural selection, making it better and better at what it does.” But it’s starting to be hard to imagine that every kind of response like this has its own separate program, as though it’s all been learned from the past. There’s a growing list of experimental biologists who are interested in these kinds of emergent adaptive behaviors in biological systems.\n  We’ve been working with primitive abiotic examples. The place we’re looking is called “active matter.” It can involve proteins chewing through chemical fuels and binding and unbinding from each other. But you can also do it with larger objects. I have a collaboration at Georgia Tech where we do this with robots swarms. There are also examples of “colloidal particles” that have special coatings on their surface—they’re like little chemical jet packs. And they already exhibit really interesting collective behaviors. Active matter is a nice experimental base camp. You don’t have to try to make sense of the living cell, where in addition to everything else you have all of the impacts of natural selection at the level of the organism. We can just study the collective behavior of things that are like soups of interacting proteins that are more primitive.\n  Every Life Is On Fire is still not the long-sought origin of life story, though?\n It’s true: There is a lot more to fill in. I’m sure there are people who will read this book and say, “Well, you’ve talked about different kinds of lifelikeness and how they might emerge, but that’s not the same thing as a full story from start to finish of how life as we know it gets put together.” Maybe we can understand how self-replicators might start to emerge, how predictive mechanisms that respond to the patterns in their environment by accurately predicting their surroundings or their behavior might emerge. And maybe energy harvesting is something whose emergence we can understand. So that certainly recalibrates our sense of how to imagine a prebiotic situation and think about what’s difficult or easy to accomplish with what would be lying around. But, no, it is not the same thing as telling a blow-by-blow story. I’m sure anyone who’s looking for that level of detail in a story that is convincing and testable will have to wait a while. Doing forensics on that kind of distance to history is pretty difficult.\n What’s the next stage in trying to get a handle on the origin of life?\n For the short term, it’s going to be about how far can we push this idea that, subjected to the right kinds of patterns, naive matter can exhibit computing and learning behaviors. I’m trying to do that right now with some of my collaborators—Dan Goldman at Georgia Tech and others who are part of this effort to control robot swarms. We want to push that envelope and show a smoking gun for that kind of an effect, creating something that can be tested and proven empirically in the laboratory. That will put the physical principles on a very firm footing. The more we can achieve impressive results in that way, the more we are going to be able to redouble our efforts to understand wider implications of the theory and tie it back into other things. To be honest, the broader question of how we start to talk about how life comes together is something I find more difficult to predict: I don’t claim that I can see which way that goes yet.\n One thing that makes your book particularly interesting is that it is not entirely focused on science, but weaves religious narratives—in particular, the story of Moses from Hebrew scripture—into the scientific narrative. What made you want to do that?\n Talking about the origin of life, or the boundary between what’s alive and what isn’t, involves broader questions that aren’t in the narrow domain of what you can understand scientifically. I didn’t want to stick my head in the sand about that. I want to understand how things work if I reason about them scientifically. But I am also a human being with other interests. I’m a practicing religious Jew—I’m an ordained Orthodox rabbi—and I care very deeply about these things. So I would feel foolish putting the scientific ideas out there but not making my own comment about a larger conversation that includes more perspectives on what some of this could mean. When I decided to write this book, I quickly realized I wanted to go and look in the Torah and see if I can find a commentary that responds to what I’m already thinking about with the science. I certainly think that it’s possible to contemplate the boundary between life and not-life from that perspective, and the text, I would argue, clearly contains such a contemplation.\n Do you think that including all these different perspectives is important in our quest to make sense of ourselves?\n It’s clear that the question of what happened in the past is not a low stakes question. You see that in how people argue about history and in the very emotional disputes people end up having about the prehistoric, or about cosmology. Ultimately, and this is something I learned from the Torah, how you describe the past is not ideologically neutral. The way you talk about who we are, and where we come from, matters to people—partly because it makes some people powerful, and enables them to convince others to do certain things. So I certainly don’t want to eliminate any frameworks of meaning that we need for talking about the past—we can’t just have frameworks that involve concepts like fundamental fields or prebiotic chemical reactions.\n I sometimes think fundamental physicists gin up the notion that when we’re done. We’ll just talk about strings and that will be everything. But we already know you can’t describe the interesting phenomena of the world if you just start with Coulomb’s law and the Schrödinger equation. It doesn’t work. You need different languages. We certainly shouldn’t be trying to have fewer of them. The difference between physics and biology is that they are different languages for talking about the same world. It’s a mistake to be trying to look for one language that will replace or subsume all others. The fact that I can talk about a person and see them as a collection of atoms should not supplant the fact that I can also talk about that person as a participant in an economy, or a moral being, or a participant in a relationship. These other frameworks of meaning are important, and we should grab them and hold on to them and insist on them.\n  This is not a conversation that we should be hoping to exhaust. People who think that we’re done sorting it out are misguided in one way or another. People need to keep talking respectfully, with intellectual honesty, and in different languages, and sharing those languages with each other in order. That’s how we’ll progress in our understanding.\n  Michael Brooks holds a Ph.D. in physics and is the author of The Quantum Astrologer’s Handbook.\n Read “ Why Physics Can’t Tell Us What Life Is” by Jeremy England, also in this issue.", "posttime": "2020-10-27 02:42:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生命,book", "title": "物理学家的新生命之书", "title_en": "The Physicist’s New Book of Life", "transed": 1, "url": "http://nautil.us/issue/92/frontiers/the-physicists-new-book-of-life", "via": "", "real_tags": ["生命", "book"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031306, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造\r帐目", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-10-27 02:41:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "植入,needed,创造", "title": "无需植入任何植入物即可精确控制大脑深处", "title_en": "No Implants Needed for Precise Control Deep into the Brain", "transed": 1, "url": "https://spectrum.ieee.org/the-human-os/biomedical/devices/deep-brain-control-without-implants", "via": "", "real_tags": ["植入", "needed", "创造"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031305, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "写入主服务器的文件会自动复制到从服务器。在本演示中，.txt和b.txt被写入/tmp/localhost_12001/filestore，并被复制到其他文件夹。\n另一个从主机localhost_12003停止从localhost_12001复制，并开始从新的主主机localhost_12002复制。\n在这个快速演示的结束状态中，LOCALHOST_12002是主设备，LOCALHOST_12003是从设备。手动在/tmp/localhost_12002/filestore下创建文件，并查看显示在/tmp/localhost_12003/filestore中的文件。\n有许多应用需要存储来存储大量相对较小的数据文件。示例包括用于存储小视频、图像、邮件附件等的媒体存储。这些对象中的每一个通常都是千字节，通常不大于几兆字节。这些用例的另一个显著特点是通常只添加或删除文件，很少更新。当有更新时，它们没有任何并发要求。\n与通用分布式文件系统必须满足的要求相比，这些要求要简单得多；这些要求将包括对文件的并发访问、读取和更新的随机访问、POSIX遵从性等。为了满足这些需求，一般的DFS也相当复杂，构建和维护成本很高。\n分布式文件系统的另一种实现包括HDFS，它的灵感来自Google的GFS。这是使用最广泛的分布式文件系统之一，它构成了Hadoop的主要数据存储平台。HDFS的主要目标是处理非常大的数据集，并通过将文件拆分成固定大小的块来跨商用服务器群集分发文件。HDFS不是特别适合存储大量相对较小的文件。\n正如我们已经指出的，可以为需求更简单的应用程序类构建一个非常简单的系统。\n不更新已创建的文件(或者删除旧文件并创建新文件是可行的)\n我们称此系统为分区文件存储(PFS)，以区别于其他分布式文件系统。该系统需要提供以下功能：\n可扩展性：应根据存储要求将文件分布在大量商用服务器上。\n容错：每个文件都应该在多个服务器上复制，这样单个服务器故障就不会降低可用性。\nApache Helix是一个通用的集群管理框架，可以非常轻松地提供可伸缩性、容错和弹性特性。Rsync可以很容易地用作服务器之间的复制通道，以便在多个服务器上复制每个文件。\n为了实现冗余，我们需要额外的副本，称为从副本。从属设备可以选择性地提供读取服务。\n在主服务器上的每一次写入都将导致创建/删除一个或多个文件。为了保持时间线一致性，从设备需要以相同的顺序应用改变以促进这一点，主设备将每个事务记录在文件中，并且每个事务与64位ID相关联，其中32LSB表示序列号，MSB表示世代号。序列号在每个事务上递增，并且当选举新的主设备时，世代递增。\n从设备需要复制才能跟上主服务器上的更改。每次从服务器应用更改时，它都会对上次应用的事务处理ID设置检查点。在重新启动期间，这允许从服务器从上一个检查点ID提取更改。与主服务器类似，从服务器将每个事务处理记录到事务处理日志中，但它不会生成新的事务处理ID，而是使用由主服务器生成的相同ID。\n当主机发生故障时，会将新的从机提升为主机。如果以前的主节点是可访问的，则新的主节点将在接管主节点之前刷新与以前的主节点相比的所有更改。新主机将记录当前一代的结束事务ID，然后以从1开始的顺序开始新一代。之后，主机将开始接受写入。\n这个应用程序演示了一个使用rsync作为复制机制的文件存储。可以设想一个类似的系统，在该系统中，不使用rsync，而是可以实现一个自定义解决方案来通知从设备更改，还可以提供一个API来拉取更改文件。\n文件服务器：该组件支持文件上传和下载，并将文件写入file_store_dir。这不包括在此应用程序中。其想法是，大多数应用程序都有不同的实现此组件的方式，并且有一些相关的业务逻辑。如果需要，想出这样一个组件并不难。\n文件存储监视器：此组件监视本地文件系统上的file_store_dir目录是否有任何更改，并将更改通知注册的侦听器。\n更改日志生成器：它注册为文件存储监视器的侦听器，并在每次通知时将更改记录到change_log_dir下的一个文件中。\n集群状态观察器：从站观察集群状态，能够知道谁是当前的主站。\nReplicator：这有两个子组件：更改日志的定期rsync：这是定期将主服务器的change_log_dir重新同步到其本地目录的后台进程。\nChange Log Watcher：它监视change_log_dir中的更改，并将更改通知注册的监听器。\n随需应变rsync调用器：它注册为更改日志观察器的侦听器，并且在每次更改时调用rsync仅同步更改的文件\n节点之间的协调由Helix完成。Helix执行分区管理，并根据复制因子将分区分配给多个节点。它选举一个节点为主节点，并指定其他节点为从节点。它以状态转换(离线到从、从到主)的形式向每个节点提供通知。它还会在群集状态发生更改时提供通知。这允许从主机停止从当前主机复制，而从新主机开始复制。\n在这个应用程序中，我们只有一个分区，但是很容易将其扩展为支持多个分区。通过对文件存储进行分区，用户可以添加新节点，并且Helix将自动在节点之间重新分配分区。综上所述，Helix提供分区管理、容错和促进自动集群扩展。", "note_en": "Files written to the master are replicated to the slaves automatically. In this demo, a.txt and b.txt are written to  /tmp/localhost_12001/filestore and they get replicated to other folders.\n    The other slave  localhost_12003 stops replicating from  localhost_12001 and starts replicating from new master  localhost_12002\n    In the end state of this quick demo,  localhost_12002 is the master and  localhost_12003 is the slave. Manually create files under  /tmp/localhost_12002/filestore and see that appear in  /tmp/localhost_12003/filestore\n  There are many applications that require storage for storing large number of relatively small data files. Examples include media stores to store small videos, images, mail attachments etc. Each of these objects is typically kilobytes, often no larger than a few megabytes. An additional distinguishing feature of these use cases is that files are typically only added or deleted, rarely updated. When there are updates, they do not have any concurrency requirements.\n  These are much simpler requirements than what general purpose distributed file system have to satisfy; these would include concurrent access to files, random access for reads and updates, posix compliance, and others. To satisfy those requirements, general DFSs are also pretty complex that are expensive to build and maintain.\n  A different implementation of a distributed file system includes HDFS which is inspired by Google’s GFS. This is one of the most widely used distributed file system that forms the main data storage platform for Hadoop. HDFS is primary aimed at processing very large data sets and distributes files across a cluster of commodity servers by splitting up files in fixed size chunks. HDFS is not particularly well suited for storing a very large number of relatively tiny files.\n  It’s possible to build a vastly simpler system for the class of applications that have simpler requirements as we have pointed out.\n  No updates to files that are already created (or it’s feasible to delete the old file and create a new one)\n  We call this system a Partitioned File Store (PFS) to distinguish it from other distributed file systems. This system needs to provide the following features:\n  Scalability: Files should be distributed across a large number of commodity servers based on the storage requirement\n  Fault-tolerance: Each file should be replicated on multiple servers so that individual server failures do not reduce availability\n  Apache Helix is a generic cluster management framework that makes it very easy to provide scalability, fault-tolerance and elasticity features. rsync can be easily used as a replication channel between servers so that each file gets replicated on multiple servers.\n  For redundancy, we need to have additional replicas called slave. Slaves can optionally serve reads\n  Every write on the master will result in creation/deletion of one or more files. In order to maintain timeline consistency slaves need to apply the changes in the same order To facilitate this, the master logs each transaction in a file and each transaction is associated with an 64 bit ID in which the 32 LSB represents a sequence number and MSB represents the generation number The sequence number gets incremented on every transaction and the generation is incremented when a new master is elected\n  Replication is required for slaves to keep up with changes on the master. Every time the slave applies a change it checkpoints the last applied transaction ID. During restarts, this allows the slave to pull changes from the last checkpointed ID. Similar to master, the slave logs each transaction to the transaction logs but instead of generating new transaction ID, it uses the same ID generated by the master.\n  When a master fails, a new slave will be promoted to master. If the previous master node is reachable, then the new master will flush all the changes from previous the master before taking up mastership. The new master will record the end transaction ID of the current generation and then start a new generation with sequence starting from 1. After this the master will begin accepting writes.\n  This application demonstrates a file store that uses rsync as the replication mechanism. One can envision a similar system where instead of using rsync, one can implement a custom solution to notify the slave of the changes and also provide an api to pull the change files.\n    File server: This component supports file uploads and downloads and writes the files to  file_store_dir. This is not included in this application. The idea is that most applications have different ways of implementing this component and have some associated business logic. It is not hard to come up with such a component if needed.\n  File store watcher: This component watches the  file_store_dir directory on the local file system for any changes and notifies the registered listeners of the changes\n  Change log generator: This registers as a listener of the file store watcher and on each notification logs the changes into a file under  change_log_dir\n  Cluster state observer: Slave observes the cluster state and is able to know who is the current master\n  Replicator: This has two subcomponents  Periodic rsync of change log: This is a background process that periodically rsyncs the  change_log_dir of the master to its local directory\n  Change Log Watcher: This watches the  change_log_dir for changes and notifies the registered listeners of the change\n  On demand rsync invoker: This is registered as a listener to change log watcher and on every change invokes rsync to sync only the changed file\n  The coordination between nodes is done by Helix. Helix does the partition management and assigns the partition to multiple nodes based on the replication factor. It elects one the nodes as master and designates others as slaves. It provides notifications to each node in the form of state transitions (Offline to Slave, Slave to Master). It also provides notifications when there is change is cluster state. This allows the slave to stop replicating from current master and start replicating from new master.\n  In this application, we have only one partition but its very easy to extend it to support multiple partitions. By partitioning the file store, one can add new nodes and Helix will automatically re-distribute partitions among the nodes. To summarize, Helix provides partition management, fault tolerance and facilitates automated cluster expansion.", "posttime": "2020-10-27 02:41:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "helix,文件", "title": "Apache Helix-接近实时的rsync复制文件系统", "title_en": "Apache Helix – Near-Realtime Rsync Replicated File System", "transed": 1, "url": "https://helix.apache.org/0.6.8-docs/recipes/rsync_replicated_file_store.html", "via": "", "real_tags": ["helix", "文件"]}, {"category": "", "categoryclass": "", "imagename": "a5cc614333fc73576a7516a219d4c10c.jpeg", "infoid": 1031303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Web上的文本对齐方式真的很难看。浏览器选择尽可能天真地在每一行上进行垃圾邮件，但这种贪婪的算法会留下松散的文本行，并且有很大的裂口。\n几百年来，有理有据的文字被认为是高超而美丽的；只有在浏览器时代，设计师才会抛弃它--而且有很好的理由。在浏览器上，对齐的文本很难看。\n请注意悬垂的标点符号，并且文本可以内联更改样式--粗体字变宽了，但文本仍然正确对齐。还支持浮动和其他对文本的侵入。\n当与连字符函数配合使用时，不合理的效果最好；我推荐使用Hypher(这就是我使用的)。\n“不合情理”在Chrome和Safai上运行得很好，在Firefox和Edge上也运行得很好。它会在一些移动浏览器上留下一个略显粗糙的画面，你可以自己决定该怎么做。\nConst options={拉伸：15，收缩：-1，悬垂：20，hyhenPenalty：1000，hyphator：function(W){//返回可连字的音节数组return[w]；}，}；const JUSTIFY=UNSIGNSEARED(OPTIONS)；\n留作标点符号的空间大小，以px为单位，在边框上方漂亮地悬挂。通常情况下，最好用来设置文本块的样式。\n(或不管悬垂是什么)，以确保文本的对齐行出现在您期望的位置，以及悬挂的标点符号...。挂起来了。\n它是一个动态规划算法，就像Knuth和Plass一样，但它比Knuth和Plass快。速度的提高来自于接受其成本函数的一部分的次优结果：一条线路和随后的线路之间的压缩差异。", "note_en": "Text justification on the web is really hideous. Browsers choose to naively cramas much as they can on each line, but this greedy algorithm leaves &#34;loose&#34; linesof text, with great gaping holes.\n For hundreds of years, well-justified text was considered masterful andbeautiful; only in the era of the browser have designers turned their back on it-- and with good reason. On a browser, justified text is ugly.\n   Note the dangling punctuation, and that text can change styles inline -- boldwords are wider, but the text is still properly aligned. Floats and otherincursions to the text are also supported.\n  Unjustifiable works best when paired with a hyphenating function; I recommend Hypher (that&#39;s what I use.)\n Unjustifiable works beautifully on Chrome and safai, and well enough on Firefox,and Edge. It  will leave a slightly ragged right on some mobile browsers, andit&#39;s up to you to decide what to do about that.\n       const  options  =  {  stretch:  15 ,  shrink:  - 1 ,  overhang:  20 ,  hyphenPenalty:  1000 ,  hyphenator:  function ( w )  {  // Returns an array of hyphenatable syllables  return  [ w ] ;  } , } ; const  justify  =  unjustifiable ( options ) ;\n         The amount of space, in px, left for punctuation to dangle attractively over themargins. It&#39;s usually best to style your textblocks with\n  (or whatever the overhang is) to ensure that the justified line of the textappears where you expect, and the hanging punctuation... hangs.\n    It&#39;s a dynamic programming algorithm, like Knuth and Plass, but it&#39;sfaster than Knuth and Plass. The speed increase comes by acceptingsuboptimal results for one part of its cost function: the differencein compression between a line and the succeeding line.", "posttime": "2020-10-27 02:41:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,动态,text,文本", "title": "一个使用动态编程的很酷的文本对齐工具", "title_en": "A cool text justification tool using dynamic programming", "transed": 1, "url": "https://github.com/diiq/unjustifiable", "via": "", "real_tags": ["编程", "动态", "text", "文本"]}, {"category": "", "categoryclass": "", "imagename": "0a59459e291821781d331f77ce9b6099.jpeg", "infoid": 1031302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我开始的时候，我被告知我不能做销售。我不会交际，所以我会是个差劲的推销员。\n他们以前有没有告诉过你，因为你缺乏才华，所以你不能做一份工作？比如成为一名推销员？还是程序员？\n“你不能成为X，因为你不会社交，而且你的数学也不好。”他们也是这么跟我说的。这完全是胡说八道。\n在我进入销售行业之前，我是一名软件开发人员。他们向软件开发人员讲述了类似的故事。“不，你不会成功的，因为你的数学很差。”我从来都不擅长数学，但我变得相当擅长编写软件。\n这两个职业都有共同之处。你不需要有独一无二的才华才能成功。写代码和卖东西都是你通过培训积累起来的技能。\n在软件开发中，您将了解语句、变量、函数，并将所有这些放到一个工作程序中。经常练习，不管你解决什么问题，你都能解决。\n销售也是以同样的方式进行的。你学习了流程，处理异议，谈判，提出正确的问题，最终，你会达成交易。\n如果您是一名软件开发人员，读到这篇文章时，您很可能会想，“但仅仅学习基础知识是不够的。有面向对象、函数式编程、…“。。没错。在软件开发中，学习永远不会停止。销售额也是如此。\n2019年初，我大开眼界。我当时正在德国北部参加一个销售研讨会。在这两天里，我们学到了很多有用的东西。最后，我们谈到了处理反对意见的话题。\n培训师问道：“这里有谁在处理异议方面有困难？请举手，我们在台上练习。“。\n几个人举起了手，他选择了一个年轻人，做摄影师。首先，他问这个年轻人：“你每天都听到什么常见的反对意见？”然后把它们写在白板上。“好的，那么，让我们为每个问题找一个好的答案。”又一次写下了所有的答案。\n接下来，他们在角色扮演中表演。培训师扮演客户，一次又一次地提出反对意见。摄影师用他刻板的回答回答，试图将谈话引向尾声。\n当然，摄影师必须付出更多的努力来练习一个令人满意的回答。然而，他学会了在15分钟内处理异议。\n我大吃一惊。这能这么简单吗？后来，培训师与另一名观众进行了类似的角色扮演，以练习在舞台上达成交易。在15分钟内，与会者可以关闭客户。令人惊异。\n回到酒店后，我做了很多笔记，并开始练习。我学到了新技术，接受了新思维，但最关键的是：\n如果一个小企业主能够学会如何在15-20分钟内处理异议并在舞台上完成交易，我就可以学到这一点。\n每当现在的潜在客户反对“太贵了”或“我需要考虑一下”时，我知道该怎么做。我树立了处理这些情况的信心。\n因此，你不需要人才。你需要正确的技术和毅力来学习。", "note_en": "When I started, I got told I couldn’t be in Sales. I couldn’t network; therefore, I’d be a lousy salesperson.\n Have they told you before you couldn’t do a job because you lacked the talent? Like becoming a Salesperson? Or a programmer?\n “You can’t become X because you don’t know how to network, and you’re not good at math.” That’s what they told me. And it’s complete nonsense.\n  Before I got into Sales, I was a software developer. They tell similar stories to software developers. “No, you won’t be successful because you suck at Math.” I was never good at math, yet I became quite good at writing software.\n Both professions share something. You don’t need to have the unique talent to become successful. Writing Code and selling something are both  skills you build over time through training.\n In Software development, you learn about statements, variables, functions and putting all of it together into a working program. Practice it often enough, and whatever problem you work on, you’ll be able to solve it.\n Sales works the same way. You learn about process, handling objections, negotiating, asking the right questions, and eventually, you’ll close deals.\n If you’re a software developer reading this, you will most likely think, “But it’s not enough to just learn foundations. There’s OOP, Functional Programming, …”. That’s right. Learning never stops in Software Development. Same for Sales.\n  I had an eye-opening moment in early 2019. I was attending a sales seminar in Northern Germany. During two days, we learned a lot of useful things. Eventually, we came to the topic of handling objections.\n The trainer asked, “Who here has trouble with handling objections? Raise your hand, and we’ll practice this on stage.”\n A few people raised their hands, and he picked a young man, working as a photographer. Firstly, he asked the young man, “What are some common objections you hear every day?” and wrote them on a whiteboard. “Ok, then, let’s find a good answer for each of them.” and again wrote down all answers.\n Next, they enacted in a role play. The trainer played the customer, mentioning one objection after another. The photographer replied with his canned response, trying to steer the conversation towards a close.\n Of course, the photographer would have to put in some more effort to practice a satisfactory reply. Yet, he learned to handle objections within 15 minutes.\n I was amazed. Could that be so easy? Later, the trainer did a similar role-play with another audience member to practice closing deals on stage. Within 15 minutes, the attendee could close customers. Amazing.\n I took lots of notes and started practicing once I was back at the hotel. I learned new techniques, adopted a new mindset, yet the most crucial aspect was this:\n If a small business owner can learn how to handle objections and close deals on stage within 15-20 minutes, I can learn this.\n Whenever now prospects object with “It’s too expensive” or “I need to think about this,” I know what to do. I built the confidence to handle these situations.\n Therefore, you don’t need talent. You need the right techniques and persistence to learn.", "posttime": "2020-10-27 02:40:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "销售,talent,处理", "title": "你不需要销售人才", "title_en": "You don’t need talent for Sales", "transed": 1, "url": "https://21-lessons.com/why-you-dont-need-talent-for-sales/", "via": "", "real_tags": ["销售", "talent", "处理"]}, {"category": "", "categoryclass": "", "imagename": "71bf49ce52d8015124a31a609629ef3d.jpg", "infoid": 1031301, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我在2019年11月a16z峰会现场演讲的缩略版。你可以在YouTube上观看视频版本。点击此处下载幻灯片。\n在不太遥远的将来，我相信几乎每家公司都将有相当大一部分收入来自金融服务。在这篇文章中，我将深入探讨实现这一转型的基础设施，更重要的是，这将如何从根本上改变我们所知的银行业。每一家公司，即使是那些与金融服务无关的公司，都将第一次有机会从金融科技那里受益。\n初创公司将能够更快、更便宜地创办公司。现有的金融服务机构将能够快速推出新产品，并减少IT维护支出。最重要的是，这意味着消费者有更多的选择、更好的产品和更低的价格。\n订阅我们的金融科技时事通讯，以获得关于金融科技未来的a16z报道。\n首先我们来简单了解一下今天的银行业状况。世界经济论坛(World Economic Forum)的一项调查发现，千禧一代和Z世代中只有28%的人相信他们的银行是公平和诚实的。这与提供令人满意的产品相去甚远。\n与此同时，超过50%的美国人靠工资过活，他们经常体验到一个完全不同的金融服务体系。虽然他们可能更需要金融服务，但他们的选择更少，而且这些服务要昂贵得多。总体而言，我们中的大多数人肯定不爱我们的银行。\n为什么在客户极度不满的情况下，现状仍然持续了这么长时间？虽然任何行业的创新都很难，但金融服务领域的创新尤其困难。这些现有的机构中有许多已经存在了100多年，并拥有很大的实体零售足迹。因此，很难削减成本并迅速推出新产品-想想全国各地需要培训的许多长期租约和数千名员工。\n虽然这些机构中的许多可能有超过10亿美元的IT预算，但在一些较大的银行，其中75%的资金仅用于维护现有产品。这是一个高度监管的行业，各州和联邦都有多个监管机构。它有一个非常复杂的基础设施。因此，虽然这对初创企业来说是一个巨大的机遇，但也存在巨大的挑战。\n考虑到所有这些挑战，为什么我对未来如此乐观？这里有一个相似之处：过去创办一家软件公司真的很难。10到15年前，你的第一步是开车去一家电脑商店。你会购买物理服务器，可能会把它们装到借来的卡车后座，然后把它们开回办公室，放在服务器机房里。你需要购买一些软件许可证，为一个数据库编写一些代码，然后花上数十万美元--如果不是数百万美元的话--之后，你终于可以开始构建你想要推向市场的产品了。\n如果这听起来完全不合时宜，那是因为它确实如此。今天，任何人都可以用信用卡和笔记本电脑创办软件公司。为什么？亚马逊Web服务将所有这些基础设施作为服务提供。AWS极大地降低了成本和复杂性，并释放了数以千计的实验。\n想想像Airbnb这样的公司吧。想象一下，如果创始人不得不去找投资者，说服他们给公司数百万美元，仅仅是为了建设基础设施，以证明是的，在这个巨大的市场上，我们都想住在陌生人的家里。结果可能会有所不同。\n同样的巨大变革--基础设施“即服务”--正在向金融服务业进军。这不仅仅是一家公司，而是多家公司，因为金融服务基础设施非常复杂。这种转型将降低成为一家金融服务公司的成本和复杂性，重要的是，它将释放数以千计的实验，为银行业的未来铺平道路。\n我们预计这种创新将来自初创企业和现有的金融服务机构。但其中很大一部分将来自首次增加金融服务的现有公司。这已经在发生了：苹果刚刚推出了一张信用卡。\n现在，这在金融科技圈子里可能是备受期待的举动，但不久前苹果还只是你的电脑公司。现在，它希望你会喜欢它的信用卡，就像你喜欢你的iPhone一样。苹果可能很容易被解雇，因为它是一家现金充裕、以推出新产品而闻名的公司。但这一趋势正在更广泛地发生。\n以优步(Uber)和Lyft为例。这些都是拼车公司，对吧？如果你是司机，他们可能也是你的银行。对于优步和Lyft来说，增加金融服务有两个好处。这两家公司都花费了数百美元收购司机。然后，他们必须通过游乐设施的保证金来弥补这一成本。如果他们在银行服务上也有利润，那么弥补这一成本就会快得多。此外，如果我是一名司机，我更有可能留在一家同时提供我金融服务的公司。最终，如果成功，优步和Lyft可能需要获得更少的司机，因为更好的留住。\n这不仅仅是一种消费现象。这也发生在B2B中。以Shopify为例，它为任何商家提供网站服务，每月收取订阅费。或者Mindbody，一家帮助瑜伽工作室等健身工作室管理业务的公司，也是按月收费的。事实证明，这两家公司近50%的收入都来自金融服务。\n那么为什么现在会发生金融科技爆炸事件呢？“作为服务”的基础设施正在向银行业进军。要理解为什么这是一件大事，我们需要看看今天的银行体系有多复杂。\n有没有想过开一家银行需要做些什么？以下是它在消费者方面的简化版。在这个高度监管的行业里，你首先需要申请执照，这可能需要数年时间。取而代之的是，大多数新公司都在寻找保荐银行(有效地借入了许可证)。但这只是你需要的第一个伙伴关系。\n然后，您需要一个核心系统(类似于大型数据库)来记录客户的钱在哪里以及它是如何流动的。您需要与一系列支付系统集成，这样客户才能从他们的帐户中取钱。要贷款，你需要通过信用局了解客户的信息。你需要遵守多个监管机构，这可能会推动KYC(了解您的客户)和AML(反洗钱)建立更多的合作伙伴关系。因为我们是在和钱打交道，所以你需要防范诈骗，这需要更多的软件。所以现在我们要看的是十几个合作伙伴。即使在签署这些交易通常需要两年的时间之后，您仍然没有开发出您想要推向市场的新产品！\n但是，如果像亚马逊对计算和存储所做的那样，公司专注于这一复杂堆栈的每一层，并将这一步骤作为一项服务提供，情况会怎样呢？这正是正在发生的事情。\n让我们来看几个例子。首先，假设我想构建一个简单的预算或财务规划应用程序。我不是要重建堆栈，我只是想从堆栈中取出数据。听起来很简单，对吧？不完全是，当你一头扎进去的时候。\n首先，我需要了解我客户的所有财务状况。从银行开始吧。全美有数千家。让事情变得更复杂的是，这些银行中的许多都有不同的核心系统，因此也就有不同的数据格式。我至少需要构建和维护几十个集成，才能拥有平庸的覆盖率。我还需要了解我客户的经纪账户，也许还有工资单。如果他们有助学贷款，那就是一套完全不同的整合。你可以很容易地看出我可以把我所有的时间都花在建设基础设施上-我甚至还没有构建我想要推向市场的伟大的财务规划应用程序。\n然而，现在有一家像Play这样的公司“作为服务”构建和维护所有这些集成。重要的是，Play还将数据转换为可用的格式。\n这个预先构建的基础设施层帮助像Earnin这样的公司加速发展，Earnin允许用户提前获得他们已经赚到的钱的工资支票，或者Blend，这是一种简化的抵押贷款应用程序。你可以简单地链接你的银行账户，而不是传真几个月的银行对账单和经纪对账单。新的联系正在建立起来，比如那些进入学生贷款服务商的联系。在不久的将来，我们很可能会看到学生贷款体验亟需的改善。\n这里还有另一个例子：假设您有一个新的消费者银行服务的好主意，该服务包括支票账户和借记卡。你需要比我上面提到的更多的合作伙伴--例如，一个用于现金提取的自动取款机网络，也许还有远程支票存款。由于许多这样的系统都是在20世纪60年代建造的，你需要编写大量的代码来将这些合作伙伴关系缝合在一起。\n但现在，我们有了一家像Synapse这样的公司，它提供所有这些“作为一项服务”。除了极大地缩短发布时间外，这还可以做两件事：第一，它使企业家能够专注于将新产品推向市场。例如，水星银行是一家小企业或初创银行。它专注于易用性和提供巨大的现金流可见性，这是许多公司倒闭的首要原因。其次，Synapse允许企业优先考虑客户理解和分销战略，而不是银行基础设施和支付专业知识。\nPropel是一家为领取电子福利(例如食品券)的4000万家庭中的一些家庭提供服务的公司。该公司的一位创始人是靠食品券长大的，对这个市场有着深刻的洞察力。Propel最初提供预算服务，现在正在分层次提供金融服务。\n许多行业都是受监管的-通常情况下，如果你不遵守，你会被罚款。但如果你不遵守金融服务业的规定，你就会坐牢。(任何在Netflix上看过奥扎克的人都知道，犯罪分子会不遗余力地将非法资金从毒品交易转移到法律系统。)。\n银行被要求遵守一套旨在防止洗钱的法律。他们监控世界各地数以百计的制裁和恐怖分子名单，以及我们的所有交易。正如您可能想象的那样，这会导致许多误报(合法客户被屏蔽)，以及大量的手动审查。这是一个繁琐的过程：在一家大型银行，21万名员工中有3万人仅在合规方面工作。由于反洗钱规定，这些工人中的绝大多数正在评估可疑活动并提交可疑活动报告。\n因此，更令人惊讶的是，实际上只有不到3%的洗钱被抓获。这为技术提供了一个将此功能作为服务提供的巨大机会。例如，Compliance Advantage为公司做了所有这些制裁/恐怖分子观察名单的整合，将数百个整合减少到一个。它提供了更细粒度的风险控制，因此银行可以花更少的时间监控交易，而把更多的时间集中在检测洗钱上。这将带来更好的客户体验、更低的成本，并且随着时间的推移，有望获得更高的成功率。这个市场的一大挑战是，一旦一家银行擅长抓捕洗钱者，作案者往往会转移到系统中的薄弱环节。\n欺诈者也是如此。我们中的许多人认为欺诈是被盗的身份，但实际上还有一种更具危害性的欺诈类型：完全捏造或合成的身份。\n以下是一家贷款公司的数据科学家发现的情况。有一天，当他们查看数据库时，注意到一个相当隐晦的名字与13个不同的社保号码有关。所以他们检查了哪些名字/SSN对有信用档案。原来，他们13个人都有信用档案！这比你想象的要容易得多。\n你可以随机选择几乎任何不是以9开头的9位数字，它可能是一个合法的社保号码。比方说，然后你去申请贷款。第一次，贷款人将ping征信局，征信局将返回“不，我们从未见过这个人。”但下一次你申请贷款时，贷款人会通知信用局，信用局会意识到，是的，已经进行了调查。很有可能，你可以找到一家贷款人，以足够高的成本和足够低的美元利率，给你提供贷款。这些合成的、虚构的人偿还贷款，向上爬，借越来越多的钱，直到他们逃脱。\n这是一种很难抓到的欺诈行为。但现在我们有一家像Sentilink这样的公司，它把它作为一项服务来做。事实证明，假冒的人获得贷款的利率与真人大不相同。如果你专注于此，你就能更有效地阻止这种欺诈行为。Sentilink已经能够显著减少所有类别的欺诈行为，从汽车到个人再到小企业。这些只是新的基础设施公司如何彻底重塑财务堆栈的几个例子-并将其作为一项服务提供给我们所有人。\n这在美国是一个巨大的机会，但在世界范围内更是一个更大的机会。世界各地的监管和支付系统各不相同。在某些情况下，金融服务堆栈是完全不同的。例如，像墨西哥这样的国家，80%的支付是现金，需要一个将现金支付合并到在线系统中的层。\n这种颠覆的独特之处在于，对于大多数重大的行业变化，往往只有一个赢家和多个输家。但在这种情况下，每个人都有机会参与并显著提高。对于初创企业，我们已经看到了一些正在建设的新基础设施公司的例子，还有更多的机会。但在这一基础设施之上将开展的数千项实验中，还有更多的机会。\n仅去年一年，金融科技就成立了近2,000家公司。现有的金融机构可能最终能够更换一些遗留系统，减少维护费用。此外，通过与其中一些初创公司合作，他们可能能够更快地推出新产品。\n正如我们在优步(Uber)、Lyft、Shopify和Mindbody上看到的那样，每家公司都应该考虑如何利用金融服务更好地服务客户，更好地留住客户，并提高利润率。\n最后，真正令人兴奋的部分来到了作为消费者的我们身上。随着新的金融服务公司的涌现-以及一些我们最喜欢的品牌推出金融服务-我们现有的服务正在变得更好。我相信，在不太遥远的将来，每个人，无论他们的社会经济人口，无论他们生活在世界的哪个地方，都将能够获得负担得起的金融服务，我们甚至可能会喜欢他们。\n这里所表达的观点是引用的AH Capital Management，L.L.C.(“a16z”)个人人员的观点，而不是a16z或其附属公司的观点。这里包含的某些信息是从第三方渠道获得的，包括从a16z管理的基金的投资组合公司获得的。虽然a16z是从被认为可靠的来源获得的，但它并没有独立核实这些信息，也没有就这些信息的持久准确性或其在特定情况下的适当性做出任何陈述。\n本内容仅供参考，不应作为法律、商业、投资或税务建议使用。关于那些问题，你应该咨询你自己的顾问。对任何证券或数字资产的提及仅用于说明目的，并不构成提供投资咨询服务的投资建议或要约。此外，这些内容不针对任何投资者或潜在投资者，也不打算供任何投资者使用，在任何情况下，在决定投资于a16z管理的任何基金时都不能依赖这些内容。(投资a16z基金的要约只能通过任何此类基金的私募备忘录、认购协议和其他相关文件进行，并应完整阅读。)。提到、提及或描述的任何投资或投资组合公司并不代表对a16z管理的投资工具的所有投资，也不能保证这些投资将是有利可图的，也不能保证未来进行的其他投资将具有类似的特点或结果。安德森·霍洛维茨管理的基金进行的投资清单(不包括发行人未提供a16z公开披露许可的投资，以及对公开交易数字资产的未宣布投资)可在以下网址获得：https://a16z.com/investments/.。\n其中提供的图表仅供参考，在做出任何投资决策时不应依赖。过去的业绩并不代表未来的成果。内容仅截至指定日期。这些材料中表达的任何预测、估计、预测、目标、前景和/或意见如有更改，恕不另行通知，并可能与其他人表达的意见不同或相反。有关其他重要信息，请参阅https://a16z.com/disclosures网站。", "note_en": "This is an abbreviated version of a presentation I gave live at the    a16z Summit   in November 2019. You can watch a video version on    YouTube  . Download the  slide deck here.\n In the not-too-distant future, I believe nearly every company will derive a significant portion of its revenue from financial services. In this post, I’ll delve into the infrastructure that’s enabling this transformation and, more importantly, how that’s going to fundamentally change banking as we know it. Every company, even those that have nothing to do with financial services, will have the opportunity to benefit from fintech for the first time.\n Startups will be able to launch companies faster and more cheaply. Existing financial services institutions will be able to introduce new products quickly—and spend less on IT maintenance. And most importantly, this means more choices, better products, and lower prices for consumers.\n Sign up for our fintech newsletter to get the a16z take on the future of fintech.\n First, let’s take a brief look at the state of the banking industry today. A survey by the World Economic Forum found that just    28 percent  of the millennial and Gen Z generations trust their banks to be fair and honest. That is a far cry from providing delightful products.\n Meanwhile, the more than 50 percent of Americans who live paycheck to paycheck often experience an entirely different financial services system. Though they’re likely to need financial services more, they have fewer options, and those offerings are much more expensive. Collectively, the majority of us definitely don’t love our banks.\n  Why has the status quo persisted for so long, despite extreme levels of customer dissatisfaction? While innovation in any industry is hard, innovation in financial services is particularly difficult. Many of these existing institutions have been around for more than 100 years and have a large brick and mortar retail footprint. As a result, it’s hard to cut costs and roll out new products quickly—think about the many long-term leases and thousands of employees that need to be trained across the country.\n While many of these institutions may have billion-dollar-plus IT budgets, at some of the larger banks, 75 percent of those dollars is spent solely on maintaining existing products. This is a highly regulated industry, with multiple regulators across state and federal. It has a very complex infrastructure. So while this is a big opportunity for startups, there are huge challenges, too.\n  Given all of these challenges, why am I so optimistic about the future? There’s a parallel here: It used to be really hard to start a software company. Ten to 15 years ago, your first step would be driving to a computer store. You’d buy physical servers, maybe load them into the back of a borrowed truck, then drive them back to your office and rack them in a server room. You’d buy some software licenses, write some code for a database, and hundreds of thousands of dollars—if not millions—later, you could finally start building the product that you wanted to bring to market.\n If this sounds totally anachronistic, that’s because it is. Today, anybody can start a software company with a credit card and a laptop. Why? Amazon Web Services brought all of this infrastructure as a service. AWS dramatically reduced cost and complexity and unleashed thousands of experiments.\n  Think of a company like Airbnb. Imagine if the founders had had to go to investors and convince them to give the company millions of dollars just to build the infrastructure to prove that yes, there’s a massive market where we all want to stay in strangers’ homes. It might have turned out differently.\n  This same monumental change—infrastructure “as a service”—is coming to financial services. And it’s not just one company, it’s multiple companies, because financial services infrastructure is so complex. This transformation will reduce the cost and complexity to become a financial services company, and importantly, it will unleash thousands of experiments that will pave the way for the future of banking.\n We would expect this innovation to come from startups and existing financial services institutions. But a large percentage of it will come from existing companies that are adding financial services   for the very first time . It’s already happening: Apple just launched a credit card.\n  Now, this may have been a highly anticipated move in fintech circles, but not that long ago Apple was just your computer company. Now it’s hoping you’re going to like its credit card as much as you like your iPhone. It could be easy to dismiss Apple because it’s a company that’s both flush with cash and known for launching new products. But this trend is happening more broadly.\n Take Uber and Lyft. These are ride-sharing companies, right? If you’re a driver, they might also be your bank.  For Uber and Lyft, adding financial services has two benefits. The companies both spend hundreds of dollars acquiring drivers. Then they have to make up that cost through margin on rides. It’s much faster to make up that cost if they also have margin on banking services. Furthermore, if I’m a driver, I’m more likely to stay with a company that is also providing my financial services. Ultimately, if successful, Uber and Lyft might need to acquire fewer drivers, due to better retention.\n  This is not just a consumer phenomenon. It’s also happening in B2B. Take Shopify, for example, which provides website services for any merchant for a monthly subscription fee. Or Mindbody, a company that helps fitness studios like yoga studios manage their businesses, also for a monthly fee. Turns out both of these companies make nearly 50 percent of their revenue through financial services.\n So, why is this fintech explosion happening now? The “as a service” infrastructure is coming to banking. To understand why this is such a big deal, we need to look at how complex the banking stack is today.\n Ever wondered what it takes to start a bank? Here’s a simplified version of what it looks like on the consumer side. In this highly regulated industry, first you need to apply for a license, which could take years. Instead, most of the new companies are finding a sponsor bank (effectively borrowing a license). But that’s just your first required partnership.\n  Then you need a core system (analogous to a large database) that logs where your customers’ money is and how it is moving around. You need to integrate with a series of payment systems so customers can take money out of their accounts. To make loans, you would need to know information about your customers via the credit bureaus. There are multiple regulatory agencies that you need to comply with, likely driving more partnerships for KYC (know your customer) and AML (anti money laundering). And because we’re dealing with money, you need to guard against fraud, which requires more software. So now we’re looking at over a dozen partnerships. Even after the two years it typically takes to ink those deals, you still haven’t built the new product that you wanted to bring to market!\n But what if, similar to what Amazon did to compute and storage, companies focused on each layer of this complex stack and provided that step   as a service ? That’s exactly what’s happening.\n   Let’s take a look at a few examples. To start, let’s say I want to build a simple budgeting or financial planning application. I’m not trying to rebuild the stack, I’m just trying to get data   out  of the stack. Sounds easy, right? Not really, when you dive into it.\n First, I would need to know everything about my customers’ finances. Start with the banks. There are thousands across the US. To make things more complex, many of these banks have different core systems and, hence, different data formats. There are at least dozens of integrations I’d need to build and maintain to have even mediocre coverage. I would also need to know about my customers’ brokerage accounts, and maybe payroll. If they have student loans, that’s an entirely different set of integrations. You can easily see how I can spend all of my time building infrastructure—and I haven’t even built the great financial planning application that I wanted to bring to market.\n  Now, however, there’s a company like Plaid that builds and maintains all of those integrations “as a service.” Importantly, Plaid also translates the data into a usable format.\n This pre-build infrastructure layer has helped accelerate companies like Earnin, which allows users to get early access early to their paycheck for money that they’ve already earned, or Blend, which is a streamlined mortgage application. Instead of faxing in months of bank statements and brokerage statements, you can simply link your bank accounts. New connections are being built, like those into student loan servicers. In the near future, we’re likely to see much-needed improvements to the student lending experience.\n  Here’s another example: say you have a great idea for a new consumer banking service that includes a checking account and debit card. You’d need more partnerships than I mentioned above—for example, an ATM network for cash withdrawal and, perhaps, remote check deposit. And since a lot of these systems were built in the 1960s, you’d need to write a lot of code to stitch these partnerships together.\n But now we have a company like Synapse that provides all of this “as a service.” In addition to dramatically reducing time to launch, this does two things: First, it enables the entrepreneur to focus on bringing a new product to market. So, for instance, Mercury is a small business or startup bank. It focuses on ease of use and providing great cash flow visibility, which is number one reason a lot of companies go out of business. Second, Synapse allows businesses to prioritize a customer understanding and distribution strategy, rather than banking infrastructure and payments expertise.\n Propel is a company that serves some of the 40 million families that are on Electronic Benefits (e.g., food stamps). One of the company’s founders grew up on food stamps and had deep insights into this market. Propel started by offering budgeting services and is now layering on financial services.\n   Many industries are regulated—typically, if you don’t comply, you’ll get fined. But if you don’t comply with regulation in the financial services industry, you’ll go to jail. (Anyone who’s seen   Ozark  on Netflix knows the lengths criminals go to move illegal money, for instance, from the drug trade into the legal system.)\n Banks are required to comply with a set of laws that’s intended to prevent money laundering. They monitor hundreds of sanctions and terrorists lists around the world——as well as all of our transactions. As you might imagine, this results in many false positives (legitimate customers getting blocked), as well as a ton of manual reviews. It’s a cumbersome process: At one of the large banks, 30,000 of 210,000 employees work solely in compliance. The vast majority of those workers are assessing suspicious activity and filing suspicious activity reports as a result of anti- money laundering regulations.\n More surprising, then, is the fact that less than 3 percent of that laundered money is actually caught. This presents a big opportunity for technology to provide this function as a service. Comply Advantage, for example, does all of these sanction/terrorist watch list integrations for companies, whittling hundreds of integrations down to one. It provides more granular risk controls, so banks can spend less time monitoring transactions and more time focusing on detecting money laundering. This yields a better customer experience, lower costs, and, over time, hopefully a higher success rate. One of the big challenges in this market is that once a bank gets good at catching money launderers, the perpetrators often move to a weaker point in the system.\n  This is also the case with fraudsters. Many of us think of fraud as stolen identities, but there’s actually a much more pernicious type of fraud: completely fabricated or synthetic identities.\n Here’s what the data scientists at a lending company discovered. While looking through the database one day, they noticed a rather obscure name linked to 13 different social security numbers. So they checked which of the name/SSN pairs had a credit profile. Turns out, all 13 of them had credit profiles! This is easier to do than you might think.\n You can pick almost any nine-digit number that doesn’t start with nine at random and it could be a legitimate social security number. Say you then go apply for a loan. The first time, the lender will ping the credit bureau who will return “No, we’ve never seen this person.” But the next time you apply for a loan, the lender will ping the credit bureau, and the credit bureau will recognize that yes, there’s been an inquiry. Chances are, you can find a lender that, for a high enough cost and a low enough dollar rate, will give you a loan. These synthetic, made-up people pay back the loan, ladder up, and borrow more and more money until they bust out.\n This is a very difficult type of fraud to catch. But now we have a company like Sentilink, which does it as a service. Turns out that fake people take out loans at much different rates than real people. And if you’re focused on it, you can stop this kind of fraud much more effectively. Sentilink has been able to significantly reduce fraud across all categories, from auto to personal to small businesses. These are just a few examples of how new infrastructure companies are completely remaking the financial stack—and providing it to all of us as a service.\n  This is a massive opportunity in the US, but it’s an even bigger opportunity worldwide. Regulation and payment systems differ around the world. In some cases, the financial services stack is entirely different. For example, a country like Mexico, where 80 percent of payments are in cash, needs a layer that incorporates cash payments into the online system.\n What’s so unique about this disruption is that, with most large industry changes, oftentimes there’s one winner and many losers. But in this case, everyone has the opportunity to participate and improve significantly. For startups, we’ve seen some of the examples of the new infrastructure companies that are being built, and there are many more opportunities. But there are even more opportunities in the thousands of experiments that are going be unleashed on top of this infrastructure.\n  Close to 2,000 fintech companies were launched last year alone. Existing financial institutions might finally be able to replace some of their legacy systems and spend less on maintenance. In addition, they may be able to launch new products more quickly by partnering with some of these startups.\n Every company, as we saw with Uber, Lyft, Shopify, Mindbody, should be thinking about how to leverage financial services to better serve their customers, better retain their customers, and drive more margin.\n Finally, the really exciting part comes to us as consumers. With new financial services companies spinning up—and some of our favorite brands launching financial services—our existing services are getting better. I believe that in the not-too-distant future, everyone, no matter their socioeconomic demographic, no matter where they live in the world, will have access to affordable financial services, and we might even love them.\n    The views expressed here are those of the individual AH Capital Management, L.L.C. (“a16z”) personnel quoted and are not the views of a16z or its affiliates. Certain information contained in here has been obtained from third-party sources, including from portfolio companies of funds managed by a16z. While taken from sources believed to be reliable, a16z has not independently verified such information and makes no representations about the enduring accuracy of the information or its appropriateness for a given situation.\n This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, or tax advice. You should consult your own advisers as to those matters. References to any securities or digital assets are for illustrative purposes only, and do not constitute an investment recommendation or offer to provide investment advisory services. Furthermore, this content is not directed at nor intended for use by any investors or prospective investors, and may not under any circumstances be relied upon when making a decision to invest in any fund managed by a16z. (An offering to invest in an a16z fund will be made only by the private placement memorandum, subscription agreement, and other relevant documentation of any such fund and should be read in their entirety.) Any investments or portfolio companies mentioned, referred to, or described are not representative of all investments in vehicles managed by a16z, and there can be no assurance that the investments will be profitable or that other investments made in the future will have similar characteristics or results. A list of investments made by funds managed by Andreessen Horowitz (excluding investments for which the issuer has not provided permission for a16z to disclose publicly as well as unannounced investments in publicly traded digital assets) is available at  https://a16z.com/investments/.\n Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any investment decision. Past performance is not indicative of future results. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others. Please see  https://a16z.com/disclosures for additional important information.", "posttime": "2020-10-27 02:40:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科技,company", "title": "每个公司都是金融科技公司", "title_en": "Every Company Will Be a Fintech Company", "transed": 1, "url": "https://a16z.com/2020/01/21/every-company-will-be-a-fintech-company/", "via": "", "real_tags": ["科技", "company"]}, {"category": "", "categoryclass": "", "imagename": "cda691f752da3b8062a630b85d69254e.jpg", "infoid": 1031300, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项服务是多年来涌现的一长串电子邮件初创公司中最新的一家，它们承诺升级电子邮件体验-最近的一款是Basecamp的嘿，这是一款新的应用程序，提供托管电子邮件服务，带有一套扩展的工具来清理你的收件箱。\n但许多人不想切换到新的电子邮件平台或客户端应用程序，他们通常也不想采用新的电子邮件地址。他们只是想驯服他们现有的收件箱。这就是邮递员的用武之地。\n这项服务的工作方式是通过你的谷歌账户进行认证，在那里你可以授予它管理邮箱标签和基本电子邮件设置的权限(比如将邮件移动到休眠文件夹)。您还可以让Mailman查看和修改电子邮件，但不能删除电子邮件。\n后一种许可值得注意和仔细考虑。收件箱中有敏感信息的任何人可能不想授予第三方访问权限来管理其电子邮件收件箱。但可以说，任何真正敏感的材料都不应该像任何安全专家会告诉你的那样，一开始就通过电子邮件传输。\n无论其价值如何，Mailman表示，它不会在Mailman界面中存储客户不直接使用的任何数据，也不会像Gmail本身那样将您的电子邮件数据货币化。它还声称，当它帮助你管理收件箱时，它只读时间戳、发件人地址和主题行，而不是你的电子邮件正文。此外，Mailman还声称对其数据库中存储的数据进行加密，这些数据存储在位于美国、加拿大和印度的服务器上。而且它是符合GDPR的-这意味着你只需点击一个按钮就可以永久删除你的所有数据。\n无论如何，你必须权衡使用任何电子邮件插件的风险和潜在好处，因为它需要获得收件箱访问权限才能正常工作。\n如果您选择继续，并且Mailman被授予管理您的收件箱的权限，则您可以选择使用其任何功能来阻止电子邮件流。\n电子邮件最大的问题之一是，电子邮件一发出，它就会在一天中不断到达。这意味着你最终只能按照发件人的日程安排回复电子邮件，而不是按照自己的日程安排。\n如果您想腾出一些没有电子邮件的时间来工作，而不受收到的电子邮件的打扰，您可以设置一个请勿打扰计划，在您指定的窗口期间保留您的电子邮件。\n另一项功能允许您选择每天按设定次数或在您配置的特定时间分批接收电子邮件。在这种情况下，Mailman会将电子邮件从您的收件箱中保留到这些投递时段-允许您设置处理电子邮件的时间，而不是让电子邮件全天吸引您的注意力。\n这项服务还可以让你优先处理重要的电子邮件，并阻止其他电子邮件。你可以在“VIP”列表中添加发件人、域名甚至关键字，让这些邮件绕过过滤器，这样你就可以随时看到紧急邮件。这可以帮助你确保不会错过来自老板或重要客户的重要电子邮件，例如，即使你使用其他工具来驯服你的收件箱。\n与此同时，不重要的电子邮件可以被自动屏蔽，因为Mailman可以屏蔽你以前从未接触过的发件人发来的时事通讯、通知和电子邮件。然而，它不会删除这些电子邮件。取而代之的是，你将收到一份每日摘要，让你选择未来如何处理这些电子邮件-例如，是从现在开始自动阻止，还是立即发送。\n随着时间的推移，这可以帮助训练邮递员，以确保你在较少分心的情况下收到重要的电子邮件。\n该公司指出，你不必使用Mailman提供的所有工具-你可以挑选你需要的工具，而不需要其他工具。因为所有的过滤都是在Gmail服务本身内完成的，所以你可以继续使用任何你喜欢的电子邮件客户端。\n这家初创公司是由连续创业者莫希特·马莫里亚(Mohit Mamoria)和安德鲁·威尔金森(Andrew Wilkinson)创立的，前者现在是Mailman的首席执行官，后者是MetaLab的创始人，现在通过Tiny投资并与初创公司合作。Mailman正在Tiny的保护伞下孵化，在那里它在营销、用户体验和早期客户获取等方面获得帮助。\nMamoria解释说，他和威尔金森都在寻找不同的方法来驯服他们的收件箱。Mamoria为此构建了一个名为Duggo的脚本。当他看到来自Wilkinson(下图)的一条询问收件箱工具的推文时，他联系了一下。\n我想每天收到几批电子邮件，而不是源源不断地收到电子邮件。\n两家公司决定合作，最终在2020年8月推出了Mailman的测试版，在那里它已经获得了略低于3000名用户。从上周开始，Mailman就可以向公众开放了。它是通过Product Hunt的一个帖子宣布的，在那里它得到了许多同行企业家和创始人的支持。一些人还为Mailman网站提供了推荐信。\n在某种程度上，你现在可以使用Gmail自己的过滤器来管理你的收件箱，但它们不是那么用户友好。而且电子邮件服务不提供配置批量递送或静默时间的工具，使得用户倾向于通过在设备上休眠推送通知来使他们的中断安静下来。由于电子邮件应用程序创新失败，嘿，超人等新服务如雨后春笋般涌现，希望为高级用户提供更好的体验。\nMailman和一些竞争对手一样，通过订阅产生收入-每月10美元，每年96美元。这比新近流行的电子邮件服务超人更实惠，后者通过每月30美元的客户端管理Gmail，但有人说它太贵了。\n联合创始人认为，与其他驯服收件箱的初创公司相比，Mailman有潜力接触到更广泛的受众，因为它尊重用户希望保留现有的电子邮件和客户端应用程序。\n“几乎所有试图解决收件箱超载问题的人都朝着建立电子邮件客户端的方向前进，”Mamoria解释说。“(Basecamp‘s)嘿更进一步，完全建立了一项电子邮件服务。他们忽略的是，更换电子邮件客户端或服务说起来容易做起来难。这需要巨大的行为改变，通常是普通用户要跨越的最大障碍，“他说。\nMailman今天可以使用，并且独家使用谷歌账户。它可能会在未来推出对其他电子邮件提供商的支持，但目前还没有在这方面的计划。", "note_en": "The service is the latest in a long line of email startups that have arrived over the years, promising an upgraded email experience — the most recent being  Basecamp’s Hey, a new app offering a hosted email service with an expanded set of tools to declutter your inbox.\n  But many people don’t want to switch to a new email platform or client app, and they don’t generally want to adopt a new email address. They just want to tame their existing inbox. That’s where Mailman comes in.\n The service works by authenticating with your Google account, where you give it permission to manage mailbox labels as well as basic email settings (like moving mail to a snoozed folder). You also give Mailman the ability to view and modify but not delete email.\n That latter permission is worth noting and considering carefully. Anyone with sensitive information in their inbox may not want to grant a third party access to manage their email inbox. But arguably, any  truly sensitive material shouldn’t be moving over email to begin with, as any security expert would tell you.\n For what it’s worth, Mailman says it doesn’t store any data that’s not directly used by the customer in the Mailman interface and it doesn’t monetize your email data — the way that Gmail itself does. It also claims to only read the timestamp, sender’s address and subject line, not the body of your emails, when it assists you in managing your inbox. Mailman additionally claims to encrypt the data it stores in its database, on servers located in the U.S., Canada and India. And it’s GDPR-compliant — meaning you can delete all your data permanently with a click of a button.\n Regardless, you’ll have to weigh the risks with the potential benefits of using any email add-on, due to its need to gain inbox access in order to function.\n If you choose to proceed and Mailman is granted access to manage your inbox, you can then opt to use any of its features to stem the flow of email.\n  One of the biggest issues with email is that it continually arrives throughout the day, as soon as emails are sent. That means you end up responding to emails on the sender’s schedule instead of your own.\n  If you would like to carve out some email-free time to work without being bothered by incoming email, you can set up a Do Not Disturb schedule that holds back your email during the window you specify.\n  Another feature lets you choose to receive emails in batches at a set number of times per day, or at specific times you configure. In this case, Mailman holds back the emails from your inbox until these delivery slots — allowing you to set times where you’ll work on email, instead of allowing email to pull your focus throughout the day.\n  The service also lets you prioritize important email and block others. You can add senders, domains and even keywords to a “VIP” list that lets those emails bypass filters so you always see urgent emails. This could help you ensure that you don’t miss critical emails from your boss or an important client, for example, even as you use other tools to tame your inbox.\n  Unimportant emails, meanwhile, can be blocked automatically as Mailman can block newsletters, notifications and emails from senders you’ve never interacted with before. It doesn’t delete these emails, however. Instead, you’ll receive a daily digest that lets you choose how to treat those emails in the future — whether they should be automatically blocked from now on, for example, or immediately sent through.\n Over time, this can help train Mailman to ensure you’re getting your important email with fewer distractions.\n You don’t have to use all the tools Mailman provides — you can pick and choose those you need while leaving others off, the company notes. And because all the filtering is being done within the Gmail service itself, you can continue to use whichever email client you prefer.\n The startup was founded by serial entrepreneur  Mohit Mamoria, now Mailman CEO, and  Andrew Wilkinson, MetaLab’s founder who now invests and partners with startups through  Tiny. Mailman is incubating under Tiny’s umbrella, where it gets help with marketing, UX and early customer acquisition, among other things.\n Explains Mamoria, he and Wilkinson were both in search of different ways to tame their inbox. Mamoria had  built a script called Duggo to do it. When he saw a tweet asking about inbox tools from Wilkinson (below), he reached out.\n I want to receive batches of email a few times a day vs email just flowing in constantly.\n The two decided to collaborate and ended up  launching Mailman into beta August 2020, where it has already gained just under 3,000 users. As of last week, Mailman became available to the public. It was announced  via a Product Hunt post where it was endorsed by a number of fellow entrepreneurs and founders. Some have also contributed testimonials to the Mailman website.\n To some extent, you can use Gmail’s own filters to manage your inbox today, but they aren’t as user friendly. And email services don’t offer tools to configure batch deliveries or quiet times, leaving users to tend to silence their interruptions by snoozing push notifications on their devices instead. Because of email apps’ failure to innovate, new services like Hey, Superhuman and others have popped up, hoping to deliver a better experience for power users.\n Mailman, like some rivals, generates revenue through subscriptions — it costs $10 per month or $96 per year. That’s more affordable than the newly popular email service Superhuman, which manages Gmail  through its $30 per month client, but it has been called out as too  expensive.\n The co-founders believe that Mailman has the potential to reach a broader audience than other inbox-taming startups because it respects that users want to keep their existing email and client app.\n “Almost everybody who has tried to solve the inbox overload has gone in the direction of building an email client,” explains Mamoria. “[Basecamp’s] Hey went a step further to build an email service altogether. What they miss is that changing email clients or services is easier said than done. It requires huge behavior change and is usually the biggest hurdle to cross for an average user,” he says.\n Mailman is available today and exclusively works with Google accounts. It may roll out support to other email providers in the future, but nothing is currently planned in that area.", "posttime": "2020-10-27 02:07:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "驯服,gmail,电子邮件", "title": "\nMailman的新Gmail助手旨在驯服你的收件箱", "title_en": "\n\t\t\t\tMailman’s new Gmail assistant aims to tame your inbox\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/mailmans-new-gmail-assistant-aims-to-tame-your-inbox/", "via": "", "real_tags": ["驯服", "gmail", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "8cd663f339ad543bf74f1f21c235b12a.jpg", "infoid": 1031299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在勒索软件感染蔓延到部分选举部门后，佐治亚州一个县恢复了将一些缺席选票签名与纸质备份匹配，而不是在线系统。\n州官员说，霍尔县的投票工作人员已经赶上了积压的缺席选票，并表示勒索软件没有扩展到用于投票或计票的系统的危险。但这种感染是2020年大选中已知的第一个例子，即机会主义犯罪黑客无意中减缓了更广泛的选举进程，联邦网络安全官员警告称，这种可能性很大。\n但这次攻击并不表明有任何广泛的努力篡改美国的投票，也没有显示美国选举制度的系统性漏洞。\n佐治亚州副国务卿乔丹·福克斯(Jordan Fuchs)说：“他们改用纸质备份，这是他们必须的。”\n她说：“他们花了一点功夫--我想他们有11天的时间要赶上去--然后他们就完成了任务。”\n该县发言人凯蒂·克拉姆利(Katie Crumley)在一封电子邮件中表示，“出于安全考虑，我们不会对与勒索软件攻击有关的任何细节发表评论。”\n这起事件突显了犯罪勒索软件团伙如何在没有刻意针对公司和政府的情况下，通过在互联网上游荡勒索公司和政府来影响美国大选。\n由于他们的技术人员通常较少，并维持基本的服务，美国当地政府网络经常发现自己成为网络罪犯的靶子。根据网络安全公司Record Future的统计，仅在2020年，就有100多个州和政府网络感染了勒索软件。\n盖恩斯维尔时报(Gainesville Times)最先报道，一个已知的犯罪勒索软件团伙本月最初感染了霍尔县的网络。该团伙在其博客上发布了被盗文件样本，NBC已经核实了这一点。勒索软件随后传播到属于该州选举部门的连接网络，导致一个当地签名数据库无法访问。\n霍尔县的投票工作人员仍然可以使用该州从佐治亚州司机服务部拉来的在线签名登记处。但是，佐治亚州国务卿办公室的投票系统实施经理加布里埃尔·斯特林(Gabriel Sterling)说，霍尔县的员工无法搜索他们的数据库，这些选民不在该州的系统中，也不能通过邮件登记这次选举。\n斯特林说：“这需要更长的时间，因为你不能那么容易地进行搜索。”“他们不得不回到那些签名的纸质复印件上。”", "note_en": "A Georgia county has reverted to matching some absentee ballot signatures to paper backups, rather than an online system, after a ransomware infection spread to part of its election department.\n Poll workers in Hall County have since caught up on a backlog of absentee ballots, state officials said, and said there’s no danger of the ransomware extending to systems used to cast or count votes. But the infection is the first known example in the 2020 general election of opportunistic criminal hackers incidentally slowing the broader election process, something that  federal cybersecurity officials have warned is a strong possibility.\n   But the attack does not indicate any broad effort to tamper with U.S. voting or show systemic vulnerabilities to the U.S. election system.\n “They switched over to their paper backups, which is required of them,” said Jordan Fuchs, Georgia’s deputy secretary of state.\n “It took a little bit of work on their part — I think they had 11 days of catch-up to do — and they completed their task,” she said.\n A spokesperson for the county, Katie Crumley, said in an email, “For security purposes, we are not commenting on any specifics related to the ransomware attack.”\n  The incident highlights how criminal ransomware gangs that troll the internet to extort companies and governments can affect U.S. elections even without deliberately targeting them.\n  Because they often have a smaller technical staff and maintain essential services, local U.S. government networks often find themselves in the crosshairs of cybercriminals. More than 100 state and government networks have been infected with ransomware in 2020 alone, according to a tally by the cybersecurity company Recorded Future.\n A known criminal ransomware gang initially infected Hall County’s networks this month,  as first reported by The Gainesville Times. The gang posted sample stolen files to its blog, which NBC has verified. The ransomware then spread to a connected network belonging to the state’s elections department, rendering one database of local signatures inaccessible.\n Poll workers in Hall County can still use the state’s online registry of signatures pulled from the Georgia Department of Driver Services. But Hall County employees can’t search their database of voters who aren’t in that state system and who registered this election by mail, said Gabriel Sterling, the voting system implementation manager for the Georgia Secretary of State’s office.\n “It’s taking longer because you can’t search as easily,” Sterling said. “They&#39;re having to go back to the paper copies of those signatures.”", "posttime": "2020-10-27 02:06:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,袭击,hit,美国", "title": "勒索软件袭击了佐治亚州的一个县。这并没有阻止它的计票工作。", "title_en": "Ransomware Hit a Georgia County. That Didn't Stop Its Ballot Counting.", "transed": 1, "url": "https://www.nbcnews.com/tech/security/ransomware-hit-georgia-county-didn-t-stop-its-ballot-counting-n1244601", "via": "", "real_tags": ["软件", "袭击", "hit", "美国"]}, {"category": "", "categoryclass": "", "imagename": "a8417558da148f304fe4c6a2eb896a86.jpg", "infoid": 1031298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "里斯本--早在冠状病毒今年春天席卷欧洲之前，许多城市就一直在抱怨，通过Airbnb等平台面向游客的短期公寓租赁激增，推高了当地人的住房成本，破坏了历史街区的特色。\n现在大流行几乎切断了稳定的游客流动，许多欧洲城市都在抓住机会，将短期租赁推回长期房地产市场。\n在葡萄牙首都里斯本，市政府通过出租空置公寓并将其转租为补贴住房，正在成为房东。在西班牙巴塞罗那，住房部门威胁要接管空置房产，并采取同样的行动。\n其他城市政府正在制定或计划制定新的法律，以遏制主要针对游客的租金的爆炸性增长。阿姆斯特丹已禁止在这座老城的中心地带租房度假；柏林一名官员警告称，将对短期租赁平台进行打击，“试图逃避监管和执法”；巴黎正计划就Airbnb型房源举行全民公投。\n多年来，在几个欧洲城市，短期出租的房产从当地居民手中抢走了住房单元。根据追踪全球城市房源的Inside Airbnb的数据，里斯本有超过2.2万套Airbnb房源。巴塞罗那有1.8万个，巴黎-该平台最大的市场之一-有近6万个。\n当游客充足时，短期租房对业主来说可能比长期租户更有利可图，市政府表示，这扭曲了已经供应紧张的城市的房地产市场。他们还指责在线平台规避为保护当地市场而实施的法律。\n巴黎副市长伊恩·布罗萨特(Ian Brossat)在接受电话采访时说，“我们不能容忍原本可以租给巴黎人的住宿现在却全年租给游客。”布罗萨特还说，他希望减少每年可以通过Airbnb这样的平台出租房产的天数--目前是120天。他指责该公司甚至违反了这一规定。\n“Airbnb假装尊重法律，但事实并非如此，”布罗萨特说。他写了一本书，批评Airbnb及其对城市的影响。\nAirbnb否认在巴黎或其他地方有任何不当行为。Airbnb欧洲、中东和非洲公共政策总监帕特里克·罗宾逊(Patrick Robinson)表示：“他们制定了规则，我们也在遵守规则。”“哪里有关于正确监管的激烈讨论，我们就是对话的一部分，最终这将由当地政客决定。”\n他说，Airbnb向里斯本、巴黎和巴塞罗那等主要旅游中心的当局提供了注册细节和其他数据，以帮助市政府官员执行他们的规定。“我们实际上认为，更好地获取数据才是这里的解决方案。”今年9月，该公司推出了城市门户网站(City Portal)，该公司表示，这将允许政府访问数据，这些数据可以帮助识别不符合当地法规的列表，如未注册的列表。\n可以说，最雄心勃勃的倡议是里斯本的倡议，它已经开始为空置的短期租赁公寓签署为期5年的租约。然后，这些物业以较低的价格转租给有资格获得补贴住房的人。市政府已拨出400万欧元(约合470万美元)用于第一年的补贴。\n该市市长费尔南多·梅迪纳(Fernando Medina)说，“我们进入大流行时，我们的房地产市场承受着巨大的压力，我们承担不起带着同样一系列问题退出大流行的代价。”“这项计划不是魔杖，但在提高保障房供应方面可以成为解决方案的一部分.”\n该计划今年的目标是吸引1000名公寓业主，到目前为止已经吸引了200名业主。梅迪纳说，他有信心该计划会实现目标，因为随着疫情的持续，旅游业短期内反弹的可能性似乎越来越小。\n这项计划受到了一些社区协会的欢迎，他们批评当地政界人士允许这座城市成为游客和富有投资者的游乐场，他们中的许多人是被2007-08年金融危机后向外国人提供的居留许可和税收减免吸引到葡萄牙的。\n城市地理学家路易斯·门德斯(Luis Mendes)是一个名为“生活在里斯本”(Living In Lisbon)的公民平台的成员，他说，“冠状病毒帮助暴露了葡萄牙从金融危机中复苏的负面因素，这场危机是由房地产和旅游业推动的，而不是关注当地人的基本需求。”\n门德斯说，最重要的是，过去用来遏制冠状病毒的封锁限制使里斯本的住房失衡成为人们关注的焦点。“如果你没有像样的房子，你怎么能隔离呢？”他说。“我们现在有了一个市政厅，它提出了一个有趣的计划，至少意识到拥有屋顶是一项基本人权。”\n然而，一些房主并不认为市政府是一个可靠的租户。他们说，葡萄牙有法律不确定性的历史，每当新政府上台时，规则都会突然改变。\n丽塔·阿尔维斯·马查多(Rita Alves Machado)在里斯本周围拥有三套空置的短期公寓，她说，“如果你看看里斯本政客们的过往记录，你会发现这是绝对没有希望的，他们无能，而且经常腐败。”“这座城市到处都是欠款，我就是不相信他们会按时还款，也不会固守自己的规矩.”\n今年9月，欧洲法院(European Court Of Justice)支持试图打击短期租赁的城市，此前该法院支持法国法院针对两名业主在Airbnb上非法出租第二套住房的裁决。法院去年发布了一项有利于Airbnb的裁决，称它是一个在线平台，而不是一家房地产公司，这将要求它遵守住房法律。欧盟委员会(European Commission)正在采取进一步措施，通过一项新的数字服务法案(Digital Services Act)对该平台和其他平台进行监管，该法案旨在使欧盟各地此类服务的法律框架现代化。\n市政府官员和当地房地产专家表示，大流行阻碍旅行的时间越长，像里斯本这样的举措就越有可能获得吸引力。与此同时，Airbnb发现自己的立场发生了变化。\n它推迟了在证券交易所上市的计划，削减了8亿美元的营销成本，裁员1900人，并筹集了10亿美元的紧急资金。Airbnb还向3月至5月期间受取消影响的房东发放了2.5亿美元。\n根据收集度假租赁数据的AirDNA的数据，在里斯本，Airbnb和曾被称为HomeAway的短租预订网站VRBO的入住率在5月份同比下降了50%。\n葡萄牙房地产经纪公司HomeLovers的联合创始人米格尔·蒂利(Miguel Tilli)表示，他在里斯本每月挂牌的新房产多达60套--几乎所有这些房产之前都是通过Airbnb出租的，但现在都对长期租户开放。\n自疫情开始以来，这座城市的租金已经下跌了10%，但之前通过Airbnb出租房产的房东仍然抵制降低租金。\n“很多房东表现得好像Covid是别人的问题一样，”蒂利说。“这不可能永远持续下去。”", "note_en": "LISBON — Long before the coronavirus swept across Europe this spring, many  cities had been complaining that a proliferation of short-term apartment rentals aimed at tourists through platforms like Airbnb was driving up housing costs for locals and destroying the character of historic districts.\n Now that the pandemic has all but cut off the steady flow of visitors, many European cities are seizing an opportunity to push short-term rentals back onto the long-term housing market.\n In Lisbon, the Portuguese capital, the city government is becoming a landlord itself by renting empty apartments and subletting them as subsidized housing. In Barcelona, Spain, the housing department is threatening to  take possession of empty properties and do the same.\n Other city governments are enacting or planning new laws to curb the explosive growth of rentals aimed largely at tourists. Amsterdam has  banned vacation rentals in the heart of the old city; a Berlin official  warned of a crackdown on short-term leasing platforms “trying to evade regulation and the enforcement of law”; and Paris is planning a referendum on Airbnb-type listings.\n For years, properties rented out for short-term stays have snatched away housing units from local residents in several European cities. Lisbon has more than  22,000 Airbnb listings, according to Inside Airbnb, which tracks listings in cities around the globe. Barcelona has 18,000, and Paris — one of the platform’s largest markets — has nearly 60,000.\n When tourists are plentiful, renting a property on a short-term basis can be more lucrative for owners than a long-term tenant, something that city governments say has  distorted housing markets in cities where supply is already tight. They also accuse online platforms of circumventing laws put in place to protect local markets.\n “We cannot tolerate that accommodations that could be rented to Parisians are now rented all year to tourists,” the deputy mayor of Paris, Ian Brossat, said in a phone interview. Mr. Brossat also said he was hoping to cut the number of days per year that a property can be rented through platforms like Airbnb — currently 120. He accused the company of breaching even that rule.\n “Airbnb pretends to respect the law, but it’s not the case,” said Mr. Brossat, who has written a  book critical of Airbnb and its impact on cities.\n Airbnb denies any wrongdoing, in Paris or elsewhere. “They’ve set the rules, and we’re following the rules,” said Patrick Robinson, Airbnb’s director of public policy for Europe, the Middle East and Africa. “Where there is a vigorous discussion about the right regulations, we’re part of that conversation, and ultimately that’s for local politicians to decide.”\n He said that Airbnb provided registration details and other data to the authorities in major tourism hubs like Lisbon, Paris and Barcelona to help city officials enforce their rules. “We actually think that better access to data is the solution here.” In September, the company introduced  City Portal, which it says will allow governments access to data that can help identify listings that do not comply with local regulations, such as unregistered listings.\n The most ambitious initiative is arguably the one in Lisbon, which has started signing five-year leases for empty short-term rental apartments. These properties are then sublet at lower prices to people eligible for subsidized housing. The city government has set aside 4 million euros, or about $4.7 million, for the first year of subsidies.\n  “We entered the pandemic with a huge pressure on our housing market, and we cannot afford to exit the pandemic with the same set of problems,” said the city’s mayor, Fernando Medina. “This program is not a magic wand, but it can be part of the solution in terms of raising the supply of affordable housing.”\n The program is aiming to attract 1,000 apartment owners this year, and has drawn 200 so far. Mr. Medina said he was confident that the plan would meet its goal, since a rebound in tourism anytime soon seems increasingly unlikely as the pandemic drags on.\n The plan has been welcomed by some neighborhood associations that had criticized local politicians as allowing the city to become a playground for tourists and wealthy investors, many of them drawn to Portugal by residency permits and tax breaks offered to foreigners after the 2007-8 financial crisis.\n “The coronavirus has helped expose the negative aspects of Portugal’s recovery from the financial crisis, which was driven by real estate and tourism rather than a focus on the basic needs of local people,” said Luís Mendes, an urban geographer who is a member of a citizens’ platform called Living in Lisbon.\n Above all, Mr. Mendes said, the lockdown restrictions used to contain the coronavirus put the spotlight on the housing imbalances in Lisbon. “How can you quarantine if you don’t have a decent house?” he said. “We now have a city hall that has put forward an interesting scheme and is at least aware that having a roof is a fundamental human right.”\n  However, some homeowners do not consider the city government a reliable tenant. Portugal, they say, has a history of legal uncertainty and sudden rule changes whenever a new administration takes office.\n “If you look at the track record of the politicians in Lisbon, it’s an absolutely hopeless one, of incompetence and often corruption,” said Rita Alves Machado, who owns three empty short-term apartments around Lisbon. “The city owes money all over the place, and I just don’t believe they will pay on time or stick to their own rules.”\n  In September,  the European Court of Justice backed cities attempting to crack down on short-term rentals, after supporting a French court ruling against two property owners illegally renting out second homes on Airbnb. The court had issued a ruling in Airbnb’s favor last year, saying that it was an  online platform rather than a real estate company, which would have required it to comply with housing laws. The European Commission is taking further steps to regulate the platform and others through a new  Digital Services Act, which aims to modernize the legal framework for such services across the European Union.\n The longer the pandemic hinders travel, the more likely initiatives like Lisbon’s are to gain traction, city officials and local property experts say. In the meantime, Airbnb has found itself on shifting ground.\n  It has delayed plans for a stock exchange listing, cut $800 million in marketing costs,  laid off 1,900 employees and raised $1 billion in emergency funding. Airbnb also dished out $250 million to  hosts impacted by cancellations between March and May.\n In Lisbon, occupancy rates for Airbnb and Vrbo, a short-rental booking site that was once known as HomeAway, dropped 50 percent in May from a year earlier, according to AirDNA, which collects vacation rental data.\n Miguel Tilli, the co-founder of HomeLovers, a Portuguese real estate agency, said he had been listing as many as 60 new properties a month in Lisbon — almost all of which had previously been rented through Airbnb but were now open to long-term tenants.\n Rental prices in the city have dropped 10 percent since the start of the pandemic, but landlords who had previously let properties through Airbnb were still resistant to reducing rents.\n “Many landlords are acting as if Covid is somebody’s else problem,” Mr. Tilli said. “That cannot last forever.”", "posttime": "2020-10-27 02:06:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "枯竭,dries,airbnb", "title": "随着旅游业的枯竭，葡萄牙、西班牙、法国和其他欧洲国家开始使用Airbnb租赁服务供市民长期使用", "title_en": "As tourism dries up, Portugal, Spain, France, and other European countries are moving to use Airbnb rentals for long-term use by citizens", "transed": 1, "url": "https://www.nytimes.com/2020/10/25/world/europe/airbnb-lisbon-housing.html", "via": "", "real_tags": ["枯竭", "dries", "airbnb"]}, {"category": "", "categoryclass": "", "imagename": "28339d1bda2f2e3b73769e4b852fb210.jpg", "infoid": 1031296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2015年初，我受雇于Netflix领导交通团队。几周后，我还被要求包租一个混沌工程团队。当时，“混沌工程”本质上是一个名为“混沌猴子”的程序，有几篇支持的博客文章。我想了解一下我们的工程师对实践的看法，所以我四处打听：“什么是混沌工程？”我通常听到的回答是，“哦，那是我们在生产中打碎东西的时候。”\n虽然这听起来很酷，但我可以整天在生产过程中破坏东西，而不会为Netflix提供任何价值。我想保住我的工作，而不是造成毫无意义的破坏。因此，我与我的团队坐下来，将混沌工程定义为一种提高可用性的主动性规程。我们大量借鉴了弹性工程领域和软件行业以外的其他研究，以构建遵循西方科学最佳传统的实验实践。我们的定义仍然发布在http://principlesofchaos.org/.上。混沌工程学的重点不是制造混乱，而是在混乱中绘制一条自信之路。\n在Netflix工作是我在混沌工程之旅中的一大亮点。另一个是与Nora Jones(Jeli.io)合著并出版了“混沌工程：实践中的系统弹性”(Chaos Engineering：System Resiliency in Practice)。现在我很高兴有机会免费赠送我的书的电子版。\n在大流行期间，远程通信确实在拯救生命。从未有过如此多的人依赖数字基础设施来执行甚至是基本的任务，比如获取食物。向远程工作和远程教育的大规模迁移已经不可逆转地改变了社会结构、规范和交流的进程。\n数亿人的工作和学校在几周内就转移到了网上。对于我们将成为其中一部分的最复杂的社会技术系统来说，这是一个巨大的变化。在这个实验中，我们无法接触到控制组。我们只有一次机会把事情做好。赌注很高。\n高风险带来高价值的机会。我们突然如此依赖的数字系统的安全性和可靠性从未像现在这样明显。我们有机会也有责任在可用性和安全性领域进行创新，以对人们至关重要的方式使这些系统变得更好。\n旧的方法是行不通的。它们还不错，但还不够。事件响应管理、警报、指标/日志记录、灾难恢复-所有这些都很棒，但也都是被动的。他们关注检测时间和补救时间。我们需要积极主动的方法。TDD、结对编程、对等代码审查、语法扫描、QA--也很棒，但它们不会影响复杂系统中的可用性或安全性。你不能指望一个人为某种东西(一个复杂的分布式系统)提供安全保证，因为根据定义，这种东西超出了人的心智建模能力。\n混沌工程是提高复杂系统安全性能的一种主动方法。我们必须依靠这些新的、创新的方法来帮助我们应对我们的组织所处的日益复杂和压力的问题。如果您觉得您的组织在可靠性方面面临着前所未有的需求和要求，那么您就是好伙伴：我们大多数规模的操作系统都处于同样的位置。有了混沌工程，您就有机会满足这些需求并驾驭这种复杂性。\n这本书解释了混沌工程学的由来，并提供了一些思维模型来挑战当前关于系统可靠性的主流思想。然后，我们提供了来自Slake、Google、Microsoft、LinkedIn和CapitalOne的作者贡献的章节，这样您就可以听到负责大规模关键系统的人是如何接受混沌工程来应对当今的挑战的。我们还将探讨分布式软件工程的典型边界之外的一些内容，以了解该实践的未来及其在制造、自动车辆、人类系统、网络安全和持续验证方面的影响。\n诺拉和我写了一本最全面、最实用的混沌工程学指南。我们甚至花了整整一章来建立ROI，这样您就可以看到混沌工程是如何产生积极影响的。\n现在Verica正在赞助这本书，这样我们就可以免费给你寄一本电子书。作为一家公司，我们相信，其中探索的概念有可能彻底改变人们构建、运营和维护大规模系统的方式。要获得免费副本，请访问verica.io/book/。\n如果您喜欢这篇文章，我们想您会喜欢由Casey Rosenthal和Nora Jones撰写的关于混沌工程的官方书籍“混沌工程，实践中的系统弹性”(Chaos Engineering，System Resiliency in Practice)。", "note_en": "I was hired at Netflix to lead the Traffic Team in early 2015. A few weeks later I was also asked to charter a Chaos Engineering Team. At the time, Chaos Engineering was essentially a program called Chaos Monkey with a few supporting blog posts. I wanted to get a feel for what our engineers thought about the practice, so I asked around: “What is Chaos Engineering?” The response I usually heard was, “Oh, that’s when we break stuff in production.”\n As cool as that sounds, I could break stuff in production all day long and not provide any value to Netflix. I wanted to keep my job, not cause pointless havoc. So instead, I sat down with my team and defined Chaos Engineering as a proactive discipline to improve availability. We borrowed heavily from the field of Resilience Engineering and other research outside of the software industry to frame a practice of experimentation that follows in the best traditions of western science. Our definition is still published at  http://principlesofchaos.org/. The point of Chaos Engineering isn’t to create chaos; it’s to chart a path of confidence through the chaos.\n Working at Netflix was a highlight of my journey with Chaos Engineering. Another is co-authoring and publishing “Chaos Engineering: System Resiliency in Practice” with Nora Jones (Jeli.io). And now I am thrilled to have the opportunity to give away free e-copies of my book.\n  Remote communication is literally saving lives during the pandemic. Never before have so many people relied on digital infrastructure to perform even basic tasks like getting food. The massive migration to remote work and remote education has irrevocably changed the course of societal structures, norms, and communication.\n Work and school for hundreds of millions of people moved online in a matter of weeks. This is a monumental change to the most complex sociotechnical system we will ever be a part of. We don’t have access to a control group in this experiment. We only have one shot to get this right. The stakes are high.\n With high stakes comes the opportunity for high value. The safety and reliability of the digital systems that we are suddenly so dependent on has never been more obvious. We have the opportunity and the responsibility to innovate in the areas of availability and security, to make these systems better in ways that matter to people.\n The old methods won’t cut it. They aren’t bad, but they aren’t sufficient. Incident response management, alerting, metrics/logging, disaster recovery—all great, but also all reactive. They focus on time-to-detect and time-to-remediate. We need proactive methods. TDD, pair programming, peer code reviews, syntax scanning, QA—also great, but they won’t move the needle on availability or security in a complex system. You can’t expect a human to provide safety guarantees on something (a complex distributed system) that by definition is beyond the capability of a human to mentally model.\n Chaos Engineering is a proactive approach to improving the safety properties of complex systems. We have an imperative to lean into these new, innovative approaches to help us cope with the increasing complexity and stress that our organizations are in. If you feel like your organization is facing unprecedented demands and requirements from a reliability perspective, you are in good company: most of us operating systems at scale are in that same position. With Chaos Engineering, you have an opportunity to meet those demands and navigate that complexity.\n  This book explains where Chaos Engineering came from and provides some mental models to challenge the current mainstream thinking on system reliability. We then provide chapters contributed by authors from Slack, Google, Microsoft, LinkedIn, and CapitalOne, so that you can hear in their own words how people responsible for critical systems at scale are embracing Chaos Engineering to meet the challenges of the day. We also explore a bit outside of the typical boundaries of distributed software engineering to take a look at the future of the practice as well as its impact in manufacturing, autonomous vehicles, human systems, cyber security, and Continuous Verification.\n  Nora and I wrote the most comprehensive, practical guide to Chaos Engineering. We even dedicated an entire chapter to establishing ROI so that you can see how Chaos Engineering has a positive effect.\n Now Verica is sponsoring this book so that we can send you a digital copy for free. As a company, we believe the concepts explored within have the potential to completely change for the better how people build, operate, and maintain systems at scale. To get your free copy, go to  verica.io/book/.\n  If you liked this article, we think you’d love the official book on Chaos Engineering “Chaos Engineering, System Resiliency in Practice” by Casey Rosenthal and Nora Jones.", "posttime": "2020-10-27 01:48:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书籍,工程学,engineering,工程", "title": "混沌工程学书籍", "title_en": "The Chaos Engineering Book", "transed": 1, "url": "https://www.verica.io/the-chaos-engineering-book/", "via": "", "real_tags": ["书籍", "工程学", "工程"]}]