[{"category": "", "categoryclass": "", "imagename": "63c1671a0a51a242d0324362e6181771.jpg", "infoid": 1029197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "捕蝇器的短期“记忆”可持续约30秒。如果昆虫只轻拍植物敏感的毛发一次，陷阱就会保持静止。但是，如果昆虫在大约半分钟内再次轻拍，这种肉食植物的叶子就会啪的一声合上，诱捕它的猎物。\n金星捕蝇器(Dionaea Muscipula)是如何记住最初的触碰的，这一直是一个谜。10月5日，研究人员在“自然植物”(Nature Plants)杂志上在线报道，一项新的研究显示，这些植物使用钙来完成这一任务。\n日本冈崎国立基础生物学研究所的生物学家、该研究的合著者桥部光也(Mitsuyasu Hasebe)说，科学家们知道一些植物有一种长期记忆。一个例子是春化，植物会记住长时间的冬季寒冷，以此作为春天开花的信号。但是短期记忆更加神秘，“这是钙参与的第一个直接证据，”Hasebe说。\n尽管这种以下巴状叶子闻名的肉食植物没有大脑或神经系统，但它显然能数到5，并能区分活的猎物和雨水等东西，这些东西可能会无意中触发它的叶子啪的一声关上，浪费能量(SN：1/24/16)。之前的研究表明钙在这一过程中发挥了作用，但在基因工程的帮助下，Hasebe和他的同事们能够真正看到钙的作用。\n研究人员将基因添加到金星捕蝇器中，这种捕蝇器可以产生一种蛋白质，这种蛋白质在接触钙时会发出绿色的光。当研究小组轻拍捕捉器的一根感官毛发时，那根毛发的根部开始发光，然后这种光在树叶中传播，然后开始褪色。当研究人员在大约30秒内第二次触摸毛发-或者触摸树叶上的另一根毛发时，捕捉器的叶子比以前更亮了，植物很快就关闭了。\n研究人员说，研究结果表明，捕蝇器的短期记忆是叶片细胞内钙的消长。每触发一根感官毛发，它就发出钙释放的信号。当钙浓度达到一定水平时，通过第二次更快的钙涌动，陷阱就会关闭。\n尽管如此，这项研究并没有揭示这种植物的所有秘密。德国维尔茨堡大学生物物理学家雷纳·赫德里希(Rainer Hedrich)与人合著者雷纳·赫德里希(Rainer Hedrich)说，为了感知猎物，捕蝇器运行着一个快速的电子网络，可以将苍蝇或其他昆虫的运动转化为小电压变化，在植物细胞中产生涟漪。科学家们仍然不确定钙记忆系统是如何与电力网络协同工作来激活植物的咬合的。\n“钙和电信号的密切联系在普通植物中是已知的，所以在捕蝇草中也是如此，”没有参与这项研究的捷克奥洛穆克帕拉克·法利大学的植物生理学家Andrej Pavlovič说。但他说，研究中最有趣的部分是让陷阱发光。这样的遗传转化在研究频繁的植物中很常见，但在研究较少的捕食性植物中就更难做到，因此成功地改造捕蝇草的基因使植物发光“是肉食性植物研究的一大飞跃”。\nH.Suda等人。转基因捕蝇器关闭过程中钙动态的可视化。天然植物。2020年10月5日在线发布。电话：10.1038/s41477-02020-1.", "note_en": "A Venus flytrap’s short-term “memory” can last about 30 seconds. If an insect taps the plant’s sensitive hairs only once, the trap remains still. But if the insect taps again within about half a minute, the carnivorous plant’s leaves snap shut, ensnaring its prey.\n How Venus flytraps ( Dionaea muscipula) remember that initial touch has been a mystery. A new study reveals that the plants  do so using calcium, researchers report online October 5 in  Nature Plants.\n Scientists know that some plants have a type of long-term memory, says study coauthor Mitsuyasu Hasebe, a biologist at the National Institute for Basic Biology in Okazaki, Japan. One example is vernalization, whereby plants remember long periods of winter cold as a signal to flower in the spring. But short-term memory is more enigmatic, and “this is the first direct evidence of the involvement of calcium,” Hasebe says.\n Even though the carnivorous plant, famous for its jawlike leaves, has no brain or nervous system, it  can apparently count to five and distinguish between live prey and things like rain, which could inadvertently trigger its leaves to snap shut, wasting energy ( SN: 1/24/16). Previous research suggested that calcium plays a role in this process, but with the help of genetic engineering, Hasebe and colleagues were able to actually see calcium in action.\n  The researchers added genes to the Venus flytraps that produce a protein, which glows green when exposed to calcium. When the team tapped one of the trap’s sensory hairs, the base of that hair began glowing, and then the glow spread through the leaf before beginning to fade. When the researchers touched the hair a second time — or touched a different hair on the leaf — within about 30 seconds, the trap’s leaves lit up even brighter than before, and the plant quickly snapped shut.\n The results show that the flytrap’s short-term memory is a waxing and waning of calcium within leaves’ cells, the researchers say. Each time a sensory hair is triggered, it signals the release of calcium. When the calcium concentration reaches a certain level, achieved by that second, faster surge of calcium, the trap closes.\n  Still, the research doesn’t reveal all of the plant’s secrets. To sense prey, “the flytrap operates a fast electrical network” that can convert a fly or other insect’s movement into small voltage changes that ripple across the plant’s cells, says coauthor Rainer Hedrich, a biophysicist at the University of Würzburg in Germany. Scientists are still unsure how the calcium memory system works in tandem with that electrical network to activate the plant’s snap.\n “The close association of calcium and electrical signal is known in ordinary plants, so it was also expected in the Venus flytrap,” says Andrej Pavlovič, a plant physiologist at Palacký University in Olomouc, Czech Republic who wasn’t involved in the study. But the most interesting part of the research was getting the trap to glow, he says. Such genetic transformations are common in frequently studied plants, but more difficult to do in less well-studied predatory plants, so successfully engineering the flytrap’s genes to make the plant glow “is a great leap forward in studies on carnivorous plants.”\n   H. Suda et al.  Calcium dynamics during trap closure visualized in transgenic Venus flytrap.  Nature Plants. Published online October 5, 2020. doi: 10.1038/s41477-020-00773-1.", "posttime": "2020-10-16 19:46:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "捕蝇器,flytraps,植物", "title": "金星捕蝇器存储猎物的短期“记忆”", "title_en": "Venus flytraps store short-term ‘memories’ of prey", "transed": 1, "url": "https://www.sciencenews.org/article/how-venus-flytraps-store-short-term-memories-prey/", "via": "", "real_tags": ["捕蝇器", "flytraps", "植物"]}, {"category": "", "categoryclass": "", "imagename": "9c3a451aae2171016d4e2cb8a6c98195.jpg", "infoid": 1029196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "访问http://linode.com/linuxexperiment，在你的新linode账户上获得20美元的积分！ubuntu是目前最大的发行版。它对……产生了变革性的影响。", "note_en": "Visit http://linode.com/linuxexperiment for a 20$ credit on your new Linode account!Ubuntu is the biggest distro out there. It had a transformative impact o...", "posttime": "2020-10-16 19:46:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,招致,linode", "title": "为什么Ubuntu会招致如此多的仇恨？", "title_en": "Why is Ubuntu Getting so much HATE?", "transed": 1, "url": "https://www.youtube.com/watch?v=WpRi6nCuTcA", "via": "", "real_tags": ["ubuntu", "招致", "linode"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029195, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "API是Application Programming Interface(应用编程接口)的缩写，广泛用于服务器间通信的编程。API允许两个服务/服务器相互交互，而不需要知道每个服务/服务器的具体实现方式。API是计算机科学中的一个基本概念-抽象-的一个关键设计方面。\n有人认为HTML5作为一种标记语言没有编程接口；相反，这些API是带有格式化HTML响应的JavaScriptAPI。这是因为API通常是为服务器-服务器接口编写的。这种混淆可能与W3C定义的HTML5规范主要涵盖HTML语义元素有关。所涵盖的大多数HTML5API功能都被视为高级HTML，而不是API。WHATWG(Web超文本应用程序技术工作组)是涵盖HTML5API规范的文档。当您查看WHATWG文档时，您会注意到几乎没有提到JavaScript，并且JavaScript知识并不是理解HTML5API的首要内容。\n在HTML API中，定义和协议在HTML本身中，工具在HTML中查找配置。HTMLAPI通常由可以在现有HTML上使用的特定类和属性模式组成。\n前端开发人员倾向于浏览HTML5API，而不是构建JavaScript UI库来替换其功能。本文将介绍一些HTML5API-它们的特性、意图、用法和限制。\n地理定位API允许Web服务检索地理用户信息。因为位置跟踪会损害安全和隐私，除非用户同意并允许浏览器访问这一位信息，否则用户的位置是不可用的。一旦获得同意，通常用户单击“允许”对话框，然后才能检索位置信息以供进一步使用。地理信息对某些应用程序非常有用，这些应用程序在很大程度上依赖于了解用户的当前位置，例如医疗急救服务、健身应用程序、地图服务，甚至市场营销都可以从了解用户的附近获得极大的好处。HTML5地理位置API在启用了GPS和位置信息的设备(如移动设备)上提供更准确的位置。然后，它以一组纬度和经度坐标的形式提供。地理位置API使用像getCurrentPosition()这样的方法，它返回用户的当前位置。它也是一种允许在地图上显示位置的方法，就像Google Maps一样。WatchPosition()方法返回用户的当前位置，并在用户移动时继续更新该位置。这是一种有益的方法，因为它提供了此API的动态实现，为程序员提供了更高级别的灵活性。用于停止watchPosition()方法的clearWatch()方法用于取消位置跟踪。用户到达目的地后，此API方法将停止持续更新位置信息。地理位置的限制包括：\n对位置更新几乎没有控制，因为这些更新是由GPS自己管理的。此外，定位精度有时会受到无线ISP(互联网服务提供商)的影响。\n拖放(DND)功能是一个简单的过程，允许用户将元素从屏幕的一个部分拖到另一个部分。它只允许HTML元素是可拖动的。此API功能允许程序员创建简单的在线游戏，如虚拟国际象棋，您可以在屏幕棋盘上拖放棋子。拖放过程非常简单。\nDND的HTML5实现是由Microsoft在其IE5.0实现中发起的，后来被其他浏览器采用。DND实现使用DOM事件模型和各自的拖动事件。要使元素可拖动，它的“Draggable”属性必须设置为“true”。\n像ondragstart、ondragover和ondrop这样的其他功能是在用户开始拖动对象、鼠标在拖动区内移动以及可拖动元素已被释放时触发事件的集合。让原生HTML5API处理拖放，确保对特定环境的完全支持，并最大限度地减少过程中的意外事件/行为。它的限制之一是没有中点拖动控件。\n这个API是游戏规则的改变者，因为它允许Web应用程序将用户信息存储在浏览器存储内部。将数据本地存储在计算机浏览器上，无需首先通过互联网传输即可检索数据，这给应用程序带来了巨大的优势。在HTML5 web存储API之前，前端开发者无法实现数据的本地存储，用户数据必须存储在cookie中，即使cookie是基于服务器的，需要随每个HTTP请求一起发送。Web存储API是软件工程师存储大量很少更改的数据的首选，通过Internet传输将耗费宝贵的时间和资源。与Cookie相比，Web存储显然还有其他优势，例如可用存储空间和安全问题，使Web存储成为首选。HTML5Web存储API提供了两种在操作和范围上不同的独特机制-本地存储和会话存储。本地存储将用户的数据永久存储在网站上。即使重新打开或刷新浏览器，用户详细信息也不会清除。从该存储中清除数据是有意的，并通过清除缓存文件来完成。它使用localStorage对象。另一方面，会话存储临时存储数据。关闭或刷新浏览器时，数据将消失。它使用sessionStorage对象。\nWeb Speech API由两个主要部分组成-语音合成(也称为文本到语音或TTS)和语音识别。Web语音API在浏览器中的实现为通过语音命令(如语音搜索、语音导航和文本听写)进行交互提供了大量机会。该接口目前仍是浏览器前缀，仅限于Chrome和Firefox。它还使用Google服务器端API来处理语音。由于Web Speech API的后端进程，它只有在用户的浏览器在线时才可用。实例化此API的中央控制器接口是SpeechRecognition，它使用onstart、onresult、onend、Continue和lang等方法和事件。此接口的一个缺点是只请求一次权限，并且在第一次授予权限后不需要再次授权。这个漏洞引起了人们对潜在安全漏洞的担忧，因为一旦用户提供了第一次也是唯一的授权，第三方就可以在页面上录制或监听。\nWebRTC API允许在浏览器上实现媒体和本机应用程序之间的实时通信功能。IT​支持对等文件共享、语音呼叫和媒体流(音频和视频)。\n使用此API，可以在连接到机器的设备(如摄像头或麦克风)上访问音频流和视频流，而不需要第三方插件。\n所有现代浏览器都支持WebRTC API，甚至Android和iOS应用程序等本地客户端都支持WebRTC API。\nWebRTC不同于其他通信模型。浏览器代表它实现另外三个主要的HTML5 API：\n我们只介绍了W3C和WHATWG规范中的一些API。还有更多有文档记录的API值得注意：\nCanvas 2D Context API-此API允许用户在浏览器中绘图。不过，在WHATWG的生活水平方面，提到已不再积极维持这项空气污染指数。\n电池状态API-此API允许网站根据设备的电池状态更改其操作。如果电池电量不足，用户可能无法再使用某些功能。\nMedia HTMLAPI-media API是浏览器对​视频和音频元素的JavaScript方法的实现。它使用onplay()、canPlayType()、pause()、play()和load()等方法。\n​这个接口允许用户在后台线程中运行JavaScript，而不会影响网站的性能。该脚本独立于用户在页面上的操作。\n文件API-此​API允许浏览器从本地文件系统加载和处理文件。它需要用户的权限才能访问文件。它还允许用户从一台计算机中选择多个文件。HTML文件API的一个优点是它包含拖放功能，允许用户将文件从他们的计算机系统拖到浏览器界面。\nHistory API-此API允许访问和操作浏览器的会话历史记录。​。\n服务器发送事件(SSE)API-此API允许从服务器自动更新网页。\nHTML5属性是使开发人员更容易编程的强大API。它们为Web应用程序和网页带来了丰富的交互性。可悲的是，它们往往被忽视，而偏向于服务器端编程和库。关于HTML5API需要注意的一件重要事情是，它们正在不断地朝着有利于前端开发人员的方向发展。随着它们的成熟，各种实现之间的差异将会缩小。\nHTML5绝不是移动应用开发的灵丹妙药。HTML5应用程序是有时间和地点的，就像仍然需要创建本地应用程序一样。\n不是每个网页或应用程序都需要HTML5API，但了解它们是什么，它们是如何工作的，它们的局限性和优势将帮助程序员决定什么是最适合手头工作的。", "note_en": "API stands for Application Programming Interface, and they are widely used in programming for communication between servers. APIs allow two services/servers to interact with each other without knowing how precisely each one of them is implemented. API is a key design aspect of one of the fundamental concepts in computer science –  abstraction.\n  There are arguments that HTML5 as a markup language does not have programming interfaces; instead, these APIs are JavaScript APIs with formatted HTML responses. This is because APIs are usually written for server-server interfacing. This confusion can be linked to the fact that the HTML5 specification defined by W3C mainly covers HTML semantic elements. Most of the  HTML5 API features covered are treated as advanced HTML, rather than as APIs.  WHATWG ( Web Hypertext Application Technology Working Group) is the documentation that covers the HTML5 APIs specifications. When you look at the WHATWG documentation, you will notice that JavaScript is barely mentioned and that knowledge of JavaScript does not take precedence in understanding HTML5 APIs.\n In an HTML API, the definitions and protocols are in the HTML itself, and the tools look in HTML for the configuration. HTML APIs usually consist of a certain class and attribute patterns that can be used on existing HTML.\n Frontend developers tend to skim over HTML5 APIs rather than building JavaScript UI libraries to replace its functions. This article will look at some HTML5 APIs - their  features, intent, usage, and  limitations.\n   The geolocation API allows web services to retrieve geographical user information. Because location tracking compromises safety and privacy, a user’s location is not available unless they consent and allow the browser to access this bit of information. Once consent is achieved, usually the user clicking on an “Allow” dialog, and only then location information can be retrieved for further usage.  Geographical information can be useful to some applications, which strongly depend on knowing the users’ current location, such as Medical Emergency Services, Fitness Apps, Maps Services, and even Marketing can strongly benefit from knowing the users’ vicinity. The HTML5 geo-location API provides more accurate positions on devices with enabled GPS and location information (such as mobile devices). It is then offered as a set of latitude and longitude coordinates. The geo-location API uses methods like  getCurrentPosition() – which returns a user’s current position. It is also the method that allows the location to be shown on a map, like  Google Maps. The  watchPosition() method returns the user’s current position and continues to update the position as the user moves. This is a beneficial method as it provides a dynamic implementation of this API, giving a higher grade of flexibility to the programmer. The  clearWatch() - method, which stops the  watchPosition() method, is used to cancel location tracking. Once the user has reached their destination, this API method stops the continuous update with location information. The limitations of the geo-location include:\n There is very little control over the location updates, as those are managed by the GPS itself. Besides, location accuracy is sometimes influenced by wireless ISPs (Internet Service Providers).\n   The  Drag and Drop ( DnD) feature is a simple procedure that allows a user to drag an element from one part of the screen to another. It merely enables HTML elements to be draggable. This API functionality allows a programmer to create simple online games like virtual chess, where you can drag and drop chess pieces across an onscreen board. The drag and drop process is quite simple.\n  The HTML5 implementation of  DND was initiated by Microsoft in their IE5.0 implementation and was later adopted by the other browsers. The DND implementation uses the  DOM Event Model and respective  drag events. To make an element  draggable, it’s “draggable” attribute has to be set to ‘true’.\n  Other functions like  ondragstart, ondragover and  ondrop are a set to trigger events when the user starts dragging the object, when the mouse moves within the drag zone and when the draggable element has been released.  Letting the native HTML5 API handle drag and drop, ensure complete support for specific environments, and minimizes unexpected events/behaviors during the process. One of its limitations is that there is no control mid-drag.\n   This API is a game-changer as it allows web applications to store user information insider the browser’s storage. Storing Data locally on a computer’s browser and retrieving it without transferring it first over the internet brings vast advantages to applications. Before HTML5 web storage API, frontend developers could not implement local storage of data, and users’ data had to be stored in cookies, even though cookies were server-based and needed to be sent with each HTTP request. The Web storage API is the preferred choice of software engineers for storing significant amounts of data that is rarely changed, and transfer over the internet would cost valuable time and resources. There are obviously other advantages to Web Storage compared to Cookies, such as available storage space and security issues, making Web Storage the preferred choice.  HTML5 web storage API provides two unique mechanisms that differ in operation and scope –  local storage and  session storage.  Local storage stores a user’s data on a website permanently. User details will not clear even when a browser is reopened or refreshed. Clearing data from this storage is intentional and done by clearing the cache files. It uses the localStorage object.  Session storage, on the other hand, stores data temporarily. Data is gone when the browser is closed or refreshed. It uses the  sessionStorage object.\n   The  Web Speech API consists of two major parts –  speech synthesis (also known as  Text to Speech or  TTS) and  Speech Recognition. The implementation of the Web Speech API in browsers presents a world of opportunities for interactions through voice commands, such as  voice search, voice navigation, and  text dictating. This API is currently still browser-prefixed and limited to  Chrome and  Firefox. It also uses a Google server-side API to process speech. Due to the Web Speech API’s back-end process, it is available only when the users’ browser is online. The central controller interface to instantiate this API is SpeechRecognition, and it works with methods and events like onstart, onresult, onend, continuous, and lang.  One of the drawbacks of this API is that it requests permission only once and does not require another authorization once the first permission was given. This flaw has created concerns for potential security breaches, as a third party can record or listen in on the page once a user provides the first and only authorization.\n   WebRTC API allows real-time communications capabilities on the browser between media and native apps. It​ supports peer-to-peer file sharing, voice calling, and media streams (audio and video).\n With this API, it is possible to access audio and video streams on devices attached to a machine, such as cameras or microphones, without the need for third-party plugins.\n The WebRTC API is supported by all modern browsers and even native clients like Android and iOS applications.\n WebRTC is different from other communication models. Browsers implement three other primary HTML5 APIs on its behalf:\n  We have covered just some of the APIs within the W3C and WHATWG specifications. There are many more documented APIs out there worth noting:\n Canvas 2D Context API – This API allows users to draw in browsers. However, on the WHATWG living standard, it is mentioned that this API is no longer being actively maintained.\n Battery Status API – This API allows a website to change its operations based on the battery status of the device. If the battery is low, some features may no longer be available to the user.\n Media​ API – The media API is the browser’s implementation of JavaScript methods on HTML video and audio elements. It uses methods like onplay(), canPlayType(), pause(), play() and load().\n Web workers API -​ This API allows users to run JavaScript in background threads without affecting a website’s performance. The script is independent of a user’s operations on a page.\n File API - This​ API allows the browser to load and process files from the local file system. It requires permission from users before it can access files. It also makes provision for users to select multiple files from a computer. One advantage of the HTML File API is that it incorporates drag and drop features, allowing users to drag files from their computer system to the browser interface.\n History API - This API allows access and manipulation of the browser’s session history. ​\n Server-Sent Events (SSE) APIs - This API allows automatic updates from servers to a webpage.\n  HTML5 attributes are potent APIs that make programming easier for developers. They bring rich interactivity to web apps and web pages. Sadly, they tend to be overlooked in favor of server-side programming and libraries. One important thing to note about HTML5 APIs is that they are continually evolving in favor of the frontend developer. As they mature, the discrepancies between various implementations will be narrower.\n HTML5 is by no means a silver bullet for  mobile app development. There’s a time and a place for HTML5 apps, just as there’s still a need to create native apps.\n Not every web page or app will require HTML5 APIs, but understanding what they are, how they work, their limitations and advantages will help a programmer decide what is best for the job at hand.", "posttime": "2020-10-16 19:46:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "htmlapi,understanding,api", "title": "了解HTMLAPI的指南", "title_en": "A guide to understanding HTML APIs", "transed": 1, "url": "https://codecoda.com/en/blog/entry/a-guide-to-understanding-html-apis", "via": "", "real_tags": ["htmlapi", "api"]}, {"category": "", "categoryclass": "", "imagename": "e52669aa0dd5e737b281e50437ffa6bf.jpg", "infoid": 1029192, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "买一台旧的Windows笔记本电脑，你可能会一直安装Windows更新，直到你确定你的系统没有足够的RAM或足够快的处理器来满足你的需求。\n谷歌保证，每发布一款新的Chromebook，都会在一段设定的时间内提供操作系统更新，在此之后，你将无法运行可能不再具有最新功能或安全更新的软件。\n好消息是，谷歌一直在延长软件更新的保修期--本月发布的两款新Chromebook将率先获得近9年的支持。\n根据Chrome汽车更新到期政策网站的说法，惠普Pro C645 Chromebook Enterprise和联想ThinkPad C13 Yoga Chromebook Enterprise都将至少在2029年6月之前收到更新。\n这些Chromebook是首批搭载AMD Ryzen处理器的产品之一，这两款产品都是在2020年9月推出的，这意味着它们的支持时间将超过8.5年，甚至可能更长(众所周知，谷歌会在Chromebook不时出现生命周期结束后的几个月内推出更新)。\n很有可能到2029年到来的时候，你可能不会使用今天购买的Chromebook了，因为到那时硬件可能会相当过时，电池续航时间也会相当差。\n延长新Chromebook的使用寿命是一件好事，因为它可以帮助客户更长时间地保留硬件，而不会让自己面临不必要的安全风险。\n当第一代Chromebook发布时，谷歌只承诺4年的更新，但在过去的几年里，我们看到这个数字一次只有一点点上升。但这并不影响已经上市一段时间的旧机型的自动更新过期(AUE)政策。\n但是，对于那些可能购买翻新的、二手的或B股Chromebook的人来说，有一个结束日期仍然是一个问题。现在Chromebook已经存在一段时间了，零售商经常对已经停止接收更新或可能只剩下一年或更少更新的旧机型进行销售。\nLiliputing的主要收入来源是广告和会员链接(例如，如果你点击页面顶部的“商店”(Shop)按钮，然后在亚马逊上购买东西，我们将获得少量佣金)。\n但是有几种方式可以让你直接支持这个网站，即使你正在使用广告拦截器*并且讨厌网上购物。\n*如果您使用的是像uBlock Origin这样的广告拦截程序，并且在屏幕底部看到弹出消息，我们有一个指南可以帮助您禁用它。\n在此浏览器中保存我的姓名、电子邮件和网站，以便下次我发表评论时使用。", "note_en": "Buy an old Windows laptop and you’ll probably be able to keep installing Windows updates until you decide that your system doesn’t have enough RAM or a fast enough processor to meet your needs anymore.\n  Google guarantees to deliver OS updates for a set period of time for each new Chromebook that’s released, and after that you’re stuck running software that may no longer have the latest features or security updates.\n The good news is that Google keeps extending amount of time for which software updates are guaranteed – two new Chromebooks announced this month will be the first to receive almost 9 years of support.\n   The   HP Pro C645 Chromebook Enterprise and   Lenovo ThinkPad C13 Yoga Chromebook Enterprise will both receive updates until at least June, 2029 according to the  Chrome Auto Update Expiration policy website.\n These Chromebooks are some of the first to  feature AMD Ryzen processors, and both models were launched in September of 2020, which means they’ll be supported for more than 8.5 years, and possibly for longer than that (Google has been known to roll out updates for a few months after a Chromebook hits the end of life from time to time).\n Odds are that by the time 2029 rolls around, you probably won’t be using a Chromebook purchased today anyway since the hardware will probably be rather outdated and the battery life rather subpar by then.\n Extending the lifespan of new Chromebooks is a good thing, since it could help customers keep their hardware for longer without exposing themselves to unnecessary security risks.\n When the first Chromebooks were launched, Google only promised 4 years of updates, but over the past few years we’ve seen that number inch upward a little bit at a time. But it doesn’t affect the Auto Update Expiration (AUE) policy of older models that have already been on the market for a while.\n But having an end date at all is still kind of a problem for folks who may be buying refurbished, used, or B-stock Chromebooks. Now that Chromebooks have been around for a while, retailers are often running sales on  older models that have either already stopped receiving updates or which may have a year or less of updates left to go.\n     Liliputing&#39;s primary sources of revenue are advertising and affiliate links (if you click the &#34; Shop&#34; button at the top of the page and buy something on Amazon, for example, we&#39;ll get a small commission).\n But there are several ways you can support the site directly even if you&#39;re using an ad blocker* and hate online shopping.\n   * If you  are using an ad blocker like uBlock Origin and seeing a pop-up message at the bottom of the screen, we have a  guide that may help you disable it.\n Save my name, email, and website in this browser for the next time I comment.", "posttime": "2020-10-16 19:45:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,操作系统,chromebook,lifespans", "title": "Chromebook寿命缓慢上升：一些机型获得9年的操作系统更新", "title_en": "Chromebook lifespans creeping upward: some models get 9 years of OS updates", "transed": 1, "url": "https://liliputing.com/2020/10/chromebook-lifespans-creeping-upward-some-models-get-9-years-of-os-updates.html", "via": "", "real_tags": ["chrome", "操作系统", "lifespans"]}, {"category": "", "categoryclass": "", "imagename": "f6b51e3f32e26cfec16542437a8928c1.jpeg", "infoid": 1029191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年10月13日，我辞去CircleUp首席执行官一职，这家公司是我和同事罗里·埃金于2011年创立的。离开我曾经做过的最好的工作-在我帮助创建的公司-是困难和令人困惑的。我希望我能找到其他关于这一转变是如何进行的故事，以及它的感觉是什么。但我发现，从最初的角色转变而来的创始人或首席执行官提供的第一手资料令人惊讶地很少，更少的人分享了他们离开时真实发生的事情，以及他们对这一过程的真实感受。有了有限的先例来指导我，我发现这个过程无论是在逻辑上还是在情感上都非常难以管理。\n这就是我写这个博客的原因。我确信我在执行过渡过程中没有做好所有的事情，但这不是重点。我不是来这里分享剧本的--我不认为有剧本存在。我想坦率地分享我的经验和弱点，希望其他创始人能拥有我所缺乏的资源；希望他们能从我的经验中学习，通过这个过程感觉到比我更少的孤独感。我还希望这篇文章能帮助那些支持、支持创始人并与他们生活在一起的投资者、团队和家庭之间建立更大的同理心和理解，他们的挣扎乍一看可能看起来不透明或难以理解，但本质上是深厚的人性。\n在过去的一年里，当我开始告诉团队成员、投资者、有限合伙人和其他利益相关者我的转变时，他们的第一个问题不可避免地是“为什么？”我通常会解释说，一家初创公司的创始人/首席执行官平均在位时间不到五年；我在CircleUp工作了九年，已经筋疲力尽了。但远不止于此。\n我不记得我第一次告诉董事会，我已经筋疲力尽，需要辞去CEO一职了。我想是在2016或2017年左右，这是一个由紧张的商业决策和身心健康问题定义的时期。后来我意识到，董事会将我的抱怨解读为“典型的创始人/CEO疲惫”。我为这种不清晰而责备自己。多年来，我在表达压力和疲惫的深度方面做得很差，有时我甚至不确定自己的感受，这只会让这个问题变得更加严重。有一段时间，我感到可怕-孤独；恐惧；沮丧。抑郁会加剧精疲力竭。但我试着摆出一副勇敢的面孔，以确保董事会感到舒适。有时我也会感到高兴，这让事情变得更加复杂。尽管我知道低迷是不健康和难以为继的，但高潮让我继续前进。我很难衡量我的痛苦有多大，是因为家里有年幼的孩子，是特定的商业挑战造成的，还是创始人/首席执行官精疲力竭的典型案例。什么是正常的？除了凭我自己的感觉，没有办法回答这个问题。从2011年到2017年，我的疲惫感觉“正常”。从2017年开始，它不再是这样了。我不再觉得自己像个传教士，我觉得自己像个雇佣兵。\n这些负面情绪的根源可以归结为大约18个月的时间，从2016年年中到2017年。在那段时间里，我们从最初的市场转向了CircleUp。我们还不得不经历一轮裁员，这是我作为首席执行官以来第一次不得不经历的裁员。他们是必要的，但他们是残忍的。我们解雇的人之所以加入，是因为他们相信我们的产品和使命。他们没有做错任何事，但是突然之间就没有他们的位置了。我记得我解雇了一个大学时代就认识的人。她转过身来对我说，“我接受这份工作，而不是做一份薪水更高的工作，现在我该怎么办？”这些痛苦的决定让我彻夜难眠数周，我知道这对那些受影响的人来说要艰难得多。\n然后，我们募集了第一支机构风险投资基金(这只是我们将技术货币化的方式之一)。如果你有从事风险投资的朋友，而且这看起来是一份轻松的工作，看看他们是否筹集了首次资金。这不像做首席执行官那么难，但它是…。不舒服。我同时做了两件事--经营一家科技公司，同时与世界各地数百家机构有限合伙人会面，以筹集一只首次风投基金。在转型之后，在裁员之后，在筹集了1.25亿美元的资金之后，我们从淡马锡和TPG为母公司筹集了一轮意义重大的融资。我不知道我们是如何在转向后立即从世界级投资者那里筹集到一大轮资金的，但我们做到了。\n与此同时，我们被迫与一名适得其反的董事会成员打交道。在我们在2019年完全买断他的股份后，我发送了这封反馈电子邮件，详细说明了他以何种方式扰乱了我们的董事会和公司。处理这个问题是我作为首席执行官面临的最孤独的时刻之一。需要说明的是，这封电子邮件和我一生中发过的任何邮件都不一样，我对分享它的决定考虑了很久，也考虑了很久。我这样做并不是为了贬低有问题的个人；唯一的目的是帮助其他可能发现自己处于类似情况的人\n从2016年开始，我和我的妻子经历了绝对残酷的生育问题。早在大学时代，我就为了建立一个大家庭的目标做出了艰难的决定。这种强调影响了一切，从我从事的工作到我吃的食物-甚至在我结婚之前。所以你可以想象这些生育问题是如何影响我和我的妻子金的。我们会见了全国五六家最好的生育诊所。测试太多了。最终，我们得到了第二个孩子的祝福，但这是一个极其痛苦和孤立的过程。\n其中一项测试揭示了意想不到的可怕信息。我被诊断出患有癌症。我只记得与医生第一次交谈时的一句话：“两个肿瘤”。一开始我很难理解它。我几乎不喝酒，从不抽烟或吸毒，一周锻炼五次。我怎么会得癌症呢？医生一定是说话不清楚。\n但他确实是。我仍然处于震惊之中，双手因恐惧而颤抖，我乘坐电梯到另一层楼立即进行测试-甚至在我还没有来得及将这个消息告诉我的妻子之前。慢慢地，现实开始沉浸其中，“恶毒”这个词的巨大力量猛烈地打击了我。我记得护士抽血时向她哭喊。然后我走出加州大学旧金山分校的医院，躲在一根混凝土柱子后面，最后打电话给我的妻子。我快要失控了，当她试图坚强起来的时候，我能从她的声音中听到恐惧。我从来没有真正听到过她害怕的声音，我感到无助，因为我无法做任何事情来改变这种情况。\n两天后，我飞往加利福尼亚州阿纳海姆参加一个工作会议，同时也试图安排进一步的检查和治疗。在30分钟的优步车程中，我在电话中多次向多家医院的多名管理人员讲述了我的故事(原因与这篇博客文章无关，因为我的病情是独一无二的，极其复杂)。我记得没有人说“对不起”，他们只是以冰冷的、临床上的精确度处理后勤，这可能是某人在癌症中心工作所必需的。最后我失去了理智，大叫道：“你为什么不现在就说‘对不起’呢？”这对他们不公平，我并不以此为荣，但我还是崩溃了。在接下来的几个月里，我的情绪有时会像潮水一样涌出，泪流满面，大喊大叫。愤怒、沮丧、恐惧、困惑--有太多的感觉需要与之抗衡。在整个优步乘车过程中，我的司机一句话也没有说。但是当我们开到酒店，我爬出来的时候，他打开门，站起来，给了我一个拥抱。然后他说：“嘿，我只是想让你知道我得了同样类型的癌症。我很抱歉“。\n癌症的诊断变得更加难以处理，因为我错误地认为我不应该和别人讨论这个问题。CircleUp刚刚经历了我们的转折点，我们正在筹集第一轮基金和母公司融资。当时，我担心团队会以我的诊断为借口认输，担心我的健康会让人分心，导致公司倒闭，让事情变得更糟。我把我的诊断告诉了董事会和我的联合创始人，但公司里其他人都不知道。我甚至对除了几个朋友以外的所有朋友都隐瞒了这一信息，担心这个消息可能会泄露出去。回想起来，我认为我会通过脆弱和真实的态度让我们的公司更紧密地联系在一起，我当然不会感到那么孤独。\n我做了一次成功的手术。从那时起，我每年都要接受几次定期检查。直到今天，我每次去斯坦福癌症中心都会哭。事后看来，我应该去看一位心理学家来处理我所经历的事情--对我来说，情感上的损失比身体上的损失要严重得多。\n同时处理生育问题、癌症和工作中的问题是我一生中最艰难的挑战。我睡不着觉，不能放松，一直处于紧张状态。好几个星期以来，我的视线都很模糊。个人和职业压力的结合远远超出了我的承受能力。我已经20多年没有头痛了，现在我一天都不能不经历头部的剧痛。医生给我的大脑做了两次核磁共振检查，看看癌症是否在那里扩散了。在第一次核磁共振之后，他们最初认为是这样的。在第二次检查后，他们说：“11名医生已经检查过了，我们确定这不是癌症。”我向你保证，这并不像现在听起来那么令人欣慰，因为它回避了一个问题，“你为什么需要11个？”\n几周后，我开始反复尿血。经过更多的检查，医生向我保证，这一最新症状也与我的癌症无关。这些症状都是万分之一的侥幸。我告诉我的癌症医生，“我喜欢数据。那可是万分之一的侥幸。“。我现在家里有一个6个月大的男孩，对医生是否遗漏了什么感到无情的恐惧，以及持续不断的一系列职业挑战\n到了2017年底，我完全筋疲力尽了。然后，突然之间，主要的职业挑战就完成了。我们完成了CircleUp的比赛。我们筹集了这笔资金。轴心在我们身后。我的个人障碍得到了更好的控制，我们现在有了一个男婴和我们当时三岁的女儿。一位伟大的董事会成员丹打电话给我说，“瑞安，在我的职业生涯中，我从来没有见过像你这样疲惫不堪的CEO。拜托，你需要休假--至少六个星期。“。他和其他董事会成员如此努力地试图做正确的事情，并说服我照顾好自己。但在苦苦思索了一辈子之后，我告诉自己我不需要休息。我认为我的反应之一就是杰瑞·科隆纳在“重新启动”中所说的“虚假的坚韧”。\n但是，当坚持不懈对我取得的任何成功都是如此关键的时候，我很难不去坚持。毅力(以及不可否认的特权)帮助我走到了今天的位置，尽管我从来都不是房间里最聪明、最高或最有技能的人。当丹要求我退一步--即使只是暂时的--我想着我是如何在双膝手术后仅仅几个月就勉强让篮球队成为杜克大学的跑龙套的，而我的医生说我需要放弃篮球。我想，在我联系的第一批70多家私募股权公司(甚至免费提供我的服务)拒绝后，我是如何勉强进入商学院，并在私募股权公司找到一份工作的。我回想起2011年，当我们讨论推出CircleUp的可能性时，我对罗里说过的话：“我想让你知道，我永远不会放弃。”坚持不懈是我的超能力。但现在我终于明白，坚持是一把双刃剑，我决定不休息，不再从我的盘子里拿走更多东西，这伤害了我，伤害了我的家人和公司。那是我职业生涯中最大的错误。\n从那时起，我的疲惫只会与日俱增。这份工作本身一点也不像过去那样困难，但抑郁和倦怠会让人觉得即使是小挑战也会变得很大。问题似乎堆积如山。幸福的时刻转瞬即逝。一些队友试图帮助我只专注于给我带来快乐的工作，但我未能完成这项任务。我从我们的胜利中感受到的快乐很少，而从我们的失败中感受到了相当多的痛苦。我记得有一位顶级风投，他不是我们的投资者之一，他在网上发布了一些关于我和CircleUp的非常积极的东西。我在手机上读到它，立刻说，“该死的！”给我妻子。我解释说，他不可能知道这些积极的事情，他的评论只会让我希望他真的知道。我已经到了只关注损失而不能接受积极事情的地步。\n我终于意识到，在太长的时间里，我对自己或他人都不清楚我想要什么或需要什么。有时候，我觉得自己发出的红色光芒让我无法保持自己的步伐，但其他人只是看到了创业者正常的起起落落。我相信数以百计的创始人都有自己版本的这个故事，但很少有人讲述。我希望我的坦率能帮助别人比我寻求帮助时感觉更舒服，比我更愿意在孤独感和体力衰退达到临界点之前面对它们。\n对我来说，这发生在2019年秋天。工作中没有最后一根稻草；坦率地说，公司的表现比以往任何时候都要好，而我的工作实际上比以往任何时候都更容易。没关系，我只能感觉到疼痛。最后，女儿看着我说：“爸爸，你看起来总是那么伤心。”她才五岁。这是我需要改变的动力。\n2019年10月，我告诉董事会，我计划辞去首席执行官一职。我准备了与我的管理教练和一些CEO朋友的对话，但我仍然害怕潜在的反应。然后我跟进了这封电子邮件(在他们允许的情况下包含在这里)。除了修改电子邮件地址之外，我没有更改笔记中的任何内容(甚至连打字错误都没有)。再说一次，我不会分享这些信息，因为我认为这是处理这种情况的完美方式，但其他人可能会从我的经验中学到东西。我当然希望我有可以依靠的例子。\n当我发那封电子邮件时，董事会很不高兴。我不怪他们。我知道这对CircleUp来说是一个艰难的过渡，但我也相信这对公司来说是正确的一步，对我来说也是正确的一步。他们试图说服我留下来，但我明确表示，这不是一个选择，这不是关于我的精神健康以外的任何问题。\n经过几次讨论，董事会同意我的决定，但觉得我无法在12个月内过渡。董事会认为，要吸引一位伟大的CEO，我们需要两年以上的跑道，因此希望我们筹集一轮资金。在他们看来，在这一点完成之前，我们无法聘请新的首席执行官，而同时做这两件事将\n筹集一轮资金并同时聘请一名替代者令人情绪疲惫，部分原因是尽管我个人已经筋疲力尽，但我必须表现出激情和兴奋。我并没有在我对公司的信念或未来的意图上误导他们，但我试图掩盖我感受到的沮丧。谁愿意投资于一位不开心的CEO呢？对于投资者来说，脆弱性或倦怠往往与风险混为一谈。因此，我觉得我别无选择，只能成为潜在利益相关者的能量来源，尽管我自己几乎没有足够的能量。你有没有在客人来的时候，即使你心情不好，也要摆出一副好面孔？感觉就是这样，晚餐看不到尽头，而且比尴尬的闲聊更有利害关系。而且，为了更好地衡量，我们必须在全球大流行期间完成所有这些工作。\n尽管如此，在不到一年的时间里，我们以我们和董事会都满意的条款筹集了一轮大笔融资(没有宣布)。我们聘请了一位出色的总裁尼克·塔尔瓦，他在10月13日成为首席执行官，也就是我成为执行主席的那一天。虽然我知道这是正确的决定，但我深爱并会怀念这份工作的很大一部分。当我要在尼克的聘书上签字时，我盯着电脑屏幕看了35分钟。我妻子走了进来，我和她一起哭了。她拍了这张照片。\n很多人问我接下来会发生什么。首先，我将调任CircleUp的全职执行主席。我还在这里，只是压力小多了。我和我的管理教练埃德·巴蒂斯塔(Ed Batista)一起研究这种过渡已经有一段时间了。我还与无数的CEO(包括我的文学团队)、朋友和顾问进行了交谈。我读过的最好的书之一是威廉·布里奇斯的“过渡”。在书中，他谈到如何适应生活在“虚无”中，当被问及“下一步是什么”时，他说：“我不知道。”一个成功和健康的过渡需要一个人生活在一个时期结束和另一个时期开始之间的虚无中。我需要接受我作为首席执行官的任期即将结束的事实，尽管我仍将留在CircleUp。最终我就不会是了。我不知道那一天什么时候会到来。如果你问我那之后是什么，我的答案是…。我不知道。\n现在我有机会反省，我的感觉很复杂。我松了一口气，因为我得到了新CEO的帮助。我作为CircleUp首席执行官的旅程已经结束，我感到很难过。我感到害怕，因为我不知道下一步是什么，尽管我相信不知道对我来说是健康的。我感到紧张的是，人们将如何解释这种转变，以及他们会对自己(和他人)说什么。当我谈到我过去的旅行时，我也有过类似的担忧，但这次的担忧更大。我感到沮丧的是，有些事情我本可以做，也应该做得不同。当被问及我下一步要做什么时，我对自己的回答“我不知道”感到不安--这会被认为是不够的。我担心我还会不会再做我觉得充满激情的事情：成为CircleUp的创始人兼首席执行官是我做过的最伟大的工作。\n我不确定其他人会作何反应。在风险投资中，怀疑是不受尊重的。我相信，一些人，尤其是风投人士，将不可避免地认为我的故事缺乏勇气。如果CircleUp在2017年失败，而不是帮助CircleUp转型并在三年后离开，他们对我的看法会不会更好？也许我的经历意味着一些风投公司不会再资助我了。也许这意味着我现在对企业家有了更多的同理心。如果不是因为个人问题，我能坚持到底吗？我想是的，但我不能知道这个问题的答案，就像我不能知道人们会对这个账户作何反应一样。我唯一的希望是，这可能会让其他创始人感到不那么孤单。\n再说一次，每个人都有自己的东西。我试着分享我的经历--完整而诚实的版本--希望你在旅途中不会感到孤独。我想让你知道，还有其他创始人/CEO觉得，不管国内情况如何，他们别无选择，只能在团队、客户或投资者面前“忍气吞声”。对我来说，个人问题的完美风暴不幸地与一些最关键的商业决策同时发生。\n.", "note_en": "On October 13th 2020 I stepped down as CEO of CircleUp, the company I started in 2011 with my co-fou nder, Rory Eakin. Leaving the best job I ever had — at the company I helped to create — was difficult and confusing. I wish I had found other stories about how the transition actually went and what it felt like. But I found surprisingly few first-hand accounts from founders or CEOs transitioning from their initial role, and even fewer that shared their full, authentic story of what really happened when they left and how they truly felt about the process. With limited precedent to guide me, I found the process extremely hard to manage, both logistically and emotionally.\n That’s why I’m writing this blog. I’m sure I didn’t do everything right in executing my transition, but that isn’t the point. I’m not here to share a playbook — I don’t think one exists. I want to share my experiences and vulnerabilities with full candor in the hope that other founders can have a resource that I lacked; that they can learn from my experience and feel less lonely than I have through this process. I also hope this piece can help build greater empathy and understanding among the investors, teams and families that have backed, supported and lived with founders whose struggles might at first seem opaque or impenetrable but are, in essence, deeply human.\n  Over the past year, when I began telling team members, investors, LPs and other stakeholders about my transition, their first question was, inevitably, “Why?” I typically explained that the average founder/CEO of a startup is in the seat for less than five years; I had been with CircleUp for nine, and I was exhausted. But there was so much more to it than that.\n I don’t remember the first time I told our board that I was exhausted and needed to step down as CEO. I imagine it was around 2016 or 2017, a period defined by stressful business decisions and physical and mental health issues. I later realized that the board interpreted my complaints as “typical founder/CEO exhaustion”. I blame myself for that lack of clarity. For years I did a poor job of communicating the depth of my stress and exhaustion, a problem only compounded by the fact that, at times, I wasn’t even sure of my own feelings. There were stretches of time where I felt horrible — lonely; terrified; depressed. Depression exacerbates exhaustion. But I tried to put on a brave face to make sure the board felt comfortable. There were also occasional periods where I felt joy, which complicated matters even more. The highs kept me going even though I knew the downs were unhealthy and untenable. It was hard for me to measure how much of my pain was because I had young kids at home, the result of specific business challenges or a classic case of founder/CEO exhaustion. What is normal? There was no way to answer that other than to go by my own feelings. From 2011–17, my exhaustion felt “normal”. Starting in 2017, it no longer did. I no longer felt like a missionary, I felt like a mercenary.\n The root of these negative feelings can be boiled down to roughly an 18-month period from mid-2016 through 2017. During that time, we  pivoted CircleUp away from the original marketplace. We also had to go through a round of layoffs, the first I’d ever had to navigate as a CEO. They were necessary, but they were brutal. The people we let go had joined because they believed in our product and mission. They had done nothing wrong, yet suddenly there was no longer a place for them. I remember letting go of someone I had known since college. She turned to me and said, “I took this job over something that paid more, and now what should I do?” These agonising decisions kept me up at night for weeks, and I know it was much harder on those affected.\n Then we raised our  first institutional VC fund (just one of the ways in which we monetize our tech). If you have friends in venture and it looks like a cushy job, see if they’ve raised a first-time fund. It’s not as hard as being a CEO, but it is… not cushy. I was doing both — running a technology company while meeting with hundreds of institutional LPs around the world to raise a first-time VC fund. After the pivot, after the layoffs and after raising that $125m fund, we raised a meaningful round for the parent company from Temasek and TPG. I don’t know how we raised a big round from world-class investors right after a pivot, but we got it done.\n Simultaneously, we were forced to deal with a board member who was beyond counterproductive. After we bought him out fully in 2019, I sent  this feedback email detailing the ways in which he had disrupted our board and company. Dealing with this issue was one of the loneliest times I faced as a CEO. To be clear, this email is unlike anything I’ve sent in my life, and I’ve thought long and hard about the decision to share it. I’m not doing so to disparage the individual in question; the only objective is to help others who might find themselves in a similar situation. (Nothing has been removed, including typos, from the email except for names.)\n That group of professional challenges was more difficult than anything else I’ve faced in my career. At the time, I told a teammate that it felt like I was playing seven-dimensional chess because of the complexity of the negotiations combined with so many conflicting challenges at work. What she didn’t know — and what most people didn’t know — is that during that same 18-month window, I was also juggling personal challenges that were far more stressful than the hurdles at work.\n It started with absolutely brutal fertility issues that my wife and I went through, beginning in 2016. As far back as college, I’ve made hard decisions with the goal of building a great family. That emphasis has impacted everything from which jobs I’ve pursued to what foods I’ve eaten — even before I was married. So you can imagine how those fertility issues impacted me and my wife, Kim. We met with five or six of the best fertility clinics in the country. There were so many tests. Eventually, we were blessed with our second child, but it was an extremely painful and isolating process.\n One of those tests revealed unexpected, terrifying information. I was diagnosed with cancer. I only remember a pair of words from the first conversation with my doctor: “two tumors”. I struggled to process it at first. I barely drink, have never smoked or done drugs and work out five times a week. How could I have cancer? The doctor must not have been speaking clearly.\n But he was. Still in shock, and with my hands shaking out of fear, I took the elevator to another floor for immediate tests — before I could even break the news to my wife. Slowly, reality began to sink in and the enormity of the word “malignant” hit me in full force. I remember crying to the nurse as she drew blood. Then I walked outside the UCSF hospital, hid behind a concrete pillar, and finally called my wife. I was losing control, and while she tried to be strong, I could hear the fear in her voice. I’d never really heard her scared before, and I felt helpless being unable to do anything to change the situation.\n Two days later, I flew to a work conference in Anaheim, CA while also trying to schedule further tests and treatment. In a 30-minute Uber ride, I told my story multiple times over the phone to multiple administrators at multiple hospitals (for reasons that aren’t relevant to this blog post, my medical case was uniquely and extremely complex). I remember no one said, “I’m sorry” — they just processed the logistics with an icy, clinical precision that is probably required for someone to work in a cancer center. Finally I lost it, shouting, “why aren’t you just saying ‘I’m sorry’ right now?” It wasn’t fair to them, and I’m not proud of it, but I cracked. For the next several months, my emotions would sometimes pour out in a tidal wave of tears and yelling. Anger, frustration, fear, confusion — there were so many feelings to contend with. Throughout the entire Uber ride, my driver hadn’t said a word. But as we pulled up to the hotel and I climbed out, he opened his door, stood up and gave me a hug. He then said: “Hey, I just want you to know I had the same type of cancer. I’m so sorry.”\n The cancer diagnosis became even tougher to deal with because I mistakenly believed I shouldn’t discuss it with others. CircleUp had just gone through our pivot and we were in the middle of raising that first fund and the parent company round. At the time, I worried that the team would use my diagnosis as an excuse to throw in the towel, that my health would become a distraction, cause the company to fail and make things that much worse. I told the board and my co-founder about my diagnosis, but no one else at the company knew. I even hid the information from all but a few friends, fearing that word might get out. In retrospect, I think I would have brought our company closer together by being vulnerable and authentic, and I certainly wouldn’t have felt as lonely.\n I had a successful operation. Since then, I have undergone regular testing several times a year. To this day, I cry every time I go to the cancer center at Stanford. In hindsight I should have seen a psychologist to process what I was going through — the emotional toll was far worse for me than the physical.\n Dealing with the fertility problem, cancer and issues at work all at once was the hardest challenge of my life. I couldn’t sleep, couldn’t relax, and was constantly on edge. For weeks at a time I had blurred vision. The combination of personal and professional stress was far beyond what I could handle. I hadn’t had a headache in 20-plus years and now I couldn’t go through a full day without experiencing crippling pain in my head. The doctors did two MRIs on my brain to see if the cancer had spread there. After the first MRI, they initially thought it had. After the second they said: “Eleven doctors have looked at this and we have determined it is not cancer.” I assure you that wasn’t as comforting as it may now sound as it begs the question, “why did you need eleven?”\n  A few weeks later, I started peeing blood, repeatedly. After more tests, the doctors assured me that this latest symptom was also unrelated to my cancer. These symptoms were one-in-a-million flukes. I told my cancer doctor, “I like data. That’s a lot of one-in-a-million flukes”. I now had a six-month-old boy at home, a relentless fear of whether the doctors might have missed something and an ongoing slew of professional challenges to face.\n By the end of 2017, I was completely worn out. Then, suddenly, the major professional challenges were done. We got the round done for CircleUp. We raised the fund. The pivot was behind us. My personal obstacles were under better control and we now had an infant boy along with our daughter, who was three at the time. A great board member,  Dan, called me to say, “Ryan, I’ve never in my career seen a CEO as worn out as you. Please, you need to take a sabbatical — at least six weeks”. He, and other board members, tried so hard to do the right thing and convince me to take care of myself. But after a lifetime of gritting things out, I told myself I didn’t need to take a break. I think an element of my reaction is what Jerry Colonna calls “false grit” in   Reboot.\n But it was hard to turn away from persistence when it has been so crucial to any success I’ve achieved. Grit (along with undeniable privilege) helped get me to where I am even though I have never been the smartest, tallest or most skilled person in the room. When Dan asked me to step back — even just temporarily — I thought about how I had gritted out making the basketball team as a walk-on at Duke just months after double knee surgery and my doctor saying I needed to give up basketball. I thought about how I gritted out getting into business school and securing a job in private equity after being denied by the first 70-plus PE firms I reached out to (even offering my services for free). I thought about what I had said to Rory in 2011 when we were discussing the possibility of launching CircleUp: “I need you to know that I never give up.” Persistence was my superpower. But now I’ve now come to understand that persistence is a double-edged sword, and my decision not to take a break, to not take more off my plate, hurt me, my family and the company. That was the biggest mistake of my career.\n From there, my exhaustion only grew. The job itself was nowhere near as difficult as it had been in the past, but depression and burnout can make even small challenges feel like a big deal. Problems seemed to stack one on top of the other. Moments of happiness were fleeting. A few teammates tried to help me focus only on work that brought me joy, but I failed at that task. I absorbed very little pleasure from our wins, and quite a bit of pain from our losses. I remember a top VC, who was not one of our investors, posted something very positive about me and CircleUp online. I read it on my phone and immediately said, “Damnit!” to my wife. I explained that he couldn’t possibly know enough to mean these positive things, and his comments only made me wish that he genuinely did. I had gotten to a place where I only focused on the losses and couldn’t accept positive things.\n I’ve eventually realized that for far too long, I wasn’t clear — with myself or others — about what I wanted or needed. At times I thought I was sending up big red flares that I couldn’t sustain my pace, but others were just seeing the normal ups and downs of a founder. I believe hundreds of founders have their own version of this story, but it is rarely told. I hope that my candor helps others to feel more comfortable than I did asking for help and more willing than I was to confront feelings of loneliness and weakening stamina before they reach a breaking point.\n For me, that happened in the fall of 2019. There was no final straw at work; frankly the company was doing better than it ever had and my job was actually easier than it ever had been. It didn’t matter: I could only feel pain. Finally, my daughter looked at me and said, “Daddy, you always look so sad”. She was five. It was the push I needed to change.\n  In October 2019 I told the board that I planned to transition out as CEO. I prepped for the conversation with my management coach and some CEO friends, but I was still terrified of the potential reaction. I  then followed up with this email (included here with their permission). I have changed nothing in the note (not even a typo) other than redacting email addresses. Once again, I’m not sharing this information because I think it was the perfect way to handle the situation, but so others might be able to learn from my experience. I certainly wish I’d had examples to lean on.\n The board wasn’t happy when I sent that email. I don’t blame them. I knew it would be a difficult transition for CircleUp, but I also believed it was the right move for the company as much as it was the right move for me. They tried to convince me to stay, but I made it clear that wasn’t an option, that this wasn’t about any issue other than my mental wellbeing.\n After several discussions, the board became aligned with my decision but felt I wouldn’t be able to transition within 12 months. Believing that to attract a great CEO we would need more than two years of runway, the board wanted us to raise a round. In their minds, we wouldn’t be able to hire a new CEO until that was done, and doing both simultaneously would be impossible to get done in less than a year. I disagreed: even though I knew how difficult it would be to accomplish both tasks at once, I was confident it could be done.\n Raising a round and hiring a replacement in parallel was emotionally draining, in part because I had to show passion and excitement even though I was personally exhausted. I wasn’t misleading them about my belief in the business or my intentions going forward, but I was trying to mask the depression I felt. Who wants to invest in an unhappy CEO? For investors, vulnerability or burnout is often conflated with risk. So I felt I had no choice but to be a source of energy for potential stakeholders even though I barely had enough energy for myself. Have you ever had to put on a good face when guests come over, even though you’re in a horrible mood? It felt like that, with no end of dinner in sight and with much higher stakes than awkward small talk. And, for good measure, we had to get all of this done during a global pandemic.\n Still, in less than a year we raised a big round (not announced) on terms both we and the board were happy with. We hired a fantastic president,  Nick Talwar, who became CEO on October 13th, the day I became Executive Chairman. While I know this is the right decision, there are huge parts of the job I deeply love and will miss. When it was time for me to sign Nick’s offer letter, I stared at my computer screen for 35 minutes. My wife came in and I cried with her. She took this picture.\n   More than a few people have asked me what comes next. First, I am transferring to a full-time Executive Chairman role at CircleUp. I’m still here, just with far less stress. I’ve worked on this transition for a while with my management coach,  Ed Batista. I’ve also talked with countless CEOs (including my  LIT group), friends and advisors. One of the better books I’ve read is   Transitions by William Bridges. In it, he talks about becoming comfortable with living in the “nothingness” and saying, “I don’t know” when asked, “what’s next?” A successful and healthy transition requires one to live in the nothingness between the end of one period and the beginning of another. I need to come to terms with the end of my time as CEO, though I will still be here at CircleUp. Eventually I won’t be. I don’t know when that day will come. And if you ask me what’s after that, my answer is… I don’t know.\n Now that I have a chance to reflect, my feelings are complicated. I am relieved that I’m getting help in the form of a new CEO. I feel sad that my journey as CEO of CircleUp has come to an end. I feel fear in that I don’t know what’s next, even though I believe it’s healthy for me not to know. I feel nervous about how people will interpret this transition and what narrative they will tell themselves (and others). When I’ve talked about my journey in the past, I’ve had similar concerns, but these ones are greater. I feel frustrated that there are things I could have and should have done differently. I feel insecure about my answer of “I don’t know” when asked what I’ll do next — that it will be viewed as inadequate. I worry about whether I will ever do anything again that I feel as passionate about: being the Founder and CEO of CircleUp is the greatest job I’ve ever had.\n I feel unsure about how others will react. In venture, doubt isn’t respected. I am confident some, especially in VC, will inevitably view my story as a lack of grit. Would their perception of me be better if, instead of helping CircleUp pivot and leaving three years later, the company had failed in 2017? Maybe my experience means some VCs will not fund me again. Maybe it means I now have more empathy for entrepreneurs. Could I have stuck it out if not for the personal issues? I think so, but I can’t know the answer to that any more than I can know how people will react to this account. My only hope is that it might help other founders feel less alone.\n Again, everyone has their things. I’m trying to share my experience — the full and honest version — so that you hopefully don’t feel as lonely on your journey. I want you to know that there are other founders/CEOs who feel that they have no choice but to “tough it out” in front of the teams, customers or investors, despite what’s going on at home. For me a perfect storm of personal problems unhappily coincided with some of the most critical business decisions a\n......", "posttime": "2020-10-16 19:45:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "跃迁,transitions", "title": "跃迁", "title_en": "Transitions", "transed": 1, "url": "https://ryancaldbeck.medium.com/transitions-fa7ce4af435", "via": "", "real_tags": ["跃迁"]}, {"category": "", "categoryclass": "", "imagename": "23c3759d93e1e6e050fa1708e4d431f0.jpg", "infoid": 1029190, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么人们不愿意花钱买蛋糕呢？专业厨师和面包师雷希米·班尼特经常想知道，为什么她不认识的人会让她免费烘焙一块值得在Insta上使用的蛋糕。\n这位伦敦的面包师经营着Anges de Sucre，她打电话给要求免费服务的社交媒体影响力人士，在网上掀起了一场风暴。\n我在Instagram上写这篇博客是因为我厌倦了有影响力的人总是要求免费蛋糕。在大流行之后，情况变得更糟，开始让我心烦意乱。\n与新冠肺炎时期的许多企业一样，雷什米也看到了她的客户行为发生了变化。尽管许多人减少了不必要的购买，但她的面包店很忙，因为人们继续订购她的庆祝蛋糕。\n然而，她也注意到，有影响力的人也在要求更多的免费赠品。这是她过去做过的事情--看看有影响力的人和他们的帖子，关注他们的人，他们是如何与观众打交道的，但她说这对她不管用。\n我们从来没有人[说]他们在别人的帖子或个人资料上看到我们的蛋糕，它总是通过付钱的顾客口碑相传。\n有影响力的市场是巨大和多样化的。企业只需根据他们在有影响力的人的订阅源上看到的内容、他们的穿着或他们谈论的内容来选择他们想要与之合作的人。\n美容和生活方式博主卡里什穆亚(Karishma Vijay)放弃了未来的医学界职业，转而成为一名全职影响力人士。她强调，她拥有近18万Instagram和7万TikTok粉丝，她的品牌影响力一直有利可图，但她并不是没有付出努力和努力。\n对于我的Instagram上的帖子，我可以收取200-600英镑之间的费用，具体取决于我在该帖子上花费了多少小时。\n如果一个化妆品或护肤品品牌想让我用他们的产品制作一个教程，我知道他们会在Instagram或TikTok上收到成百上千万的浏览量。而且我知道我至少可以让他们的销售额达到2000英镑。\n福布斯预测，有影响力的领域将出现巨大增长，到2022年，这个市场的价值可能达到110亿GB。随着该行业如此多样化，现在更明显的是微博作者的崛起-拥有较少、忠诚的追随者和较短内容帖子的人。\n里兹·卡亚尔(Riz Kayaal)经营着一家开斋节和斋月装饰公司，他欣然接受了这一点。我们已经与350多位有影响力的人和微博作者合作过，我还免费赠送了价值15,000-20,000 GB的股票。\n这些小的有影响力的人和博客作者在展示我的产品、欣赏产品方面做得更好。\n里兹说，与提供费率卡的有影响力的人合作是最有效率的运营方式。他们可能会对两篇帖子和一篇Instagram故事收取300英镑的费用，但他们清楚地表明了自己会做什么，以及如何展示产品。\n品牌和数字策略师阿散蒂·阿卡布西(Ashanti Akabusi)的公司VirtuBrands拥有来自企业界和娱乐界的客户。她的大部分工作都是关于建立和加强客户的社交媒体形象和品牌-这通常涉及到与有影响力的人合作。\n当它是正确的影响力时，他们可以对企业产生极大的影响力。然而，她明白，许多人并没有真正的影响力，他们声称自己有影响力。我们看到的许多反弹都是对市场过饱和的回应，人们称自己是有影响力的人，但他们可能没有权利这么做。\n她说，企业和有影响力的人之间的关系通常是积极的，但关键是选择正确的有影响力的人。\n许多企业还没有摆脱广告牌广告，但随着越来越多的数字空间来展示产品，竞技场也变得更大了。这意味着普通人有更多的空间作为有影响力的人工作-比如美容博客作者和商科学生艾莎·沙班(Aisha Shaban)。她说，她是一个不情愿的微博用户(Instagram上有1.7万粉丝)，但更重要的是，她是一个从不索要免费服务的人。\n如果他们找到我进行合作，我非常乐意通过在我的平台上做广告来支持这家公司，但我永远不会不厌其烦地接触这个品牌，因为我觉得我会从他们的辛勤工作中获益。\nAisha已经得到了大型在线时尚品牌的付费赞助协议，但她出于道德原因拒绝了这一协议。她说，这就是帮助一个成功的有影响力的人变得真实的原因，追随者欣赏这种诚实。如果一个大品牌做了她不同意的事情，她会选择不与他们合作。由于他们之间没有财务承诺，这就更容易做到。\n随着许多企业深受疫情的影响，有影响力的人是否应该利用他们的力量来帮助支持各个行业？\n由安娜·席尔瓦·赖利(Ana Silva O&#39；Reilly)运营的旅游博客“O环游世界”最近发起了一项活动，号召旅游影响力人士支持旅游业。#PayOurWay希望之前受益于免费旅行的有影响力的人通过支付下次旅行的费用并免费撰写博客来帮助启动该行业。\n此外，(有点有争议的)#EatOutToHelpOut计划在很大程度上得到了美食和生活方式博客作者的支持，他们支持参与其中的餐厅、酒吧和咖啡馆。\n未来，有影响力的人是否应该采取更多措施向企业展示自己的价值？阿散蒂·阿卡库西认为这是前进的方向：有影响力的人是那些在他们的领域里是专家，并且已经在他们的观众中建立了信誉的人。\n面包师雷什米·班尼特(Reshmi Bennett)呢？他只想让有影响力的人停止索要免费蛋糕。我同样热衷于告诉其他蛋糕制造者不要这么做。如果每个人都说不，那么在某个时候就得有人付钱买蛋糕。", "note_en": "&#34;Why don&#39;t people want to pay for cake?&#34; Professional chef and baker Reshmi Bennett often wonders why people she doesn&#39;t know will ask her to bake an Insta-worthy cake free of charge.\n The London-based baker runs Anges de Sucre, and she&#39;s created a bit of an online storm by calling out social media influencers who&#39;ve asked for freebies.\n &#34;I wrote this blog on Instagram because I&#39;m sick of influencers asking for free cake all the time. After the pandemic it got worse and it started upsetting me.&#34;\n Like many businesses during Covid-19, Reshmi has seen a change in her customers&#39; behaviour. Although many people cut back on unnecessary purchases, her bakery was busy as people carried on ordering her celebration cakes.\n Yet she also noticed influencers were asking for more freebies too. It&#39;s something she has done in the past - looking at the influencer and their posts, who follows them, how they engage with their audience, but says it didn&#39;t work for her.\n &#34;We have never had a sale off someone [saying] they saw our cake on someone&#39;s post or profile, it&#39;s always been through word of mouth, from paying customers.&#34;\n  The influencer market is large and diverse. Businesses simply have to choose who they want to collaborate with based on what they see on the influencer&#39;s feed, what they wear or what they talk about.\n Beauty and lifestyle blogger Karishmua (Karishma Vijay) gave up a future career in medicine to be a full time influencer. With nearly 180,000 Instagram and 70,000 TikTok followers, her &#34;brand influence&#34; has been lucrative - but not without effort and hard work on her part, she stresses.\n &#34;For a post on my Instagram I can charge between £200-600 depending on how many hours I&#39;ve dedicated to that post.\n &#34;If a cosmetics or skincare brand want me to create a tutorial using their products, I know that will receive hundreds or even millions of views on Instagram or TikTok. And I know I can make them at least £2,000 in sales.&#34;\n  Forbes predicts huge growth in the influencer space, and the market could be worth £11bn by 2022. With the sector being so diverse, what is more visible now is the rise of the micro-blogger - people with smaller, loyal followings and shorter content posts.\n This is something Riz Kayaal, who runs an Eid and Ramadan decorations firm, has embraced. &#34;We&#39;ve worked with over 350 influencers and micro-bloggers and I&#39;ve given away stock worth £15,000-20,000 as freebies.\n &#34;These small influencers and bloggers have been much better in terms of how they&#39;ve showcased my product, how they&#39;ve appreciated the product.&#34;\n Riz says working with influencers who provide rate cards is the most productive way to operate. &#34;They might charge £300 for two posts and an Instagram story, but they make it clear what they will do and how they can showcase the product.&#34;\n  Brand and digital strategist Ashanti Akabusi has clients from the corporate and entertainment worlds at her company VirtuBrands. Much of her work is about building and strengthening clients&#39; social media profile and brands - which often involves working with influencers.\n &#34;When it&#39;s the right influencer, they can be extremely impactful for a business.&#34; However, she understands that many do not have real influence they claim they do. &#34;A lot of the backlash we&#39;re seeing is in response to an over-saturation of the market, and people calling themselves influencers when they probably don&#39;t have the right to do so.&#34;\n She says the relationship between a business and an influencer can often be a positive one, but &#34;the key is to choose the right influencer&#34;.\n Many businesses haven&#39;t yet moved away from billboard advertising, but with a growing number of digital spaces to show off products, the arena is bigger. That means more space for ordinary people to work as influencers - like beauty blogger and business student Aisha Shaban. She says she&#39;s a reluctant micro-blogger (17,000 Instagram followers) but more importantly, is someone who never asks for freebies.\n  &#34;If they reach out to me to collaborate, I&#39;m more than happy to support the company by advertising them on my platforms, but I would never go out of my way to reach out to the brand because I feel like I would be taking advantage of their hard work.\n  Aisha has been offered paid sponsorship deals by big online fashion brands, which she turned down for ethical reasons. This, she says, is what helps a successful influencer to be authentic, and followers appreciate that honesty. If a big brand does something she doesn&#39;t agree with, she chooses not to work with them. With no financial commitment between them, that&#39;s easier to do.\n With many businesses deeply affected by the pandemic, should influencers be utilising their power to help support various industries?\n Travel blog Mrs O Around The World run by Ana Silva O&#39;Reilly recently started a campaign for travel influencers to support the tourism industry. #PayOurWay wants influencers who have previously benefitted from travel freebies to help kick start the industry by paying for their next trip and blogging about it free of charge.\n Also, the (somewhat controversial) #EatOutToHelpOut scheme was largely supported by food and lifestyle bloggers who championed restaurants, bars and cafes that were taking part.\n Should influencers do more to show their worth to businesses in the future? Ashanti Akabusi thinks this is the way forward: &#34;The influencers who are going to win are those who are experts in their field, and who have built credibility with their audience.&#34;\n And what about baker Reshmi Bennett who just wants influencers to stop asking for free cake? &#34;I&#39;m as passionate about telling other cake makers to not do it. If everyone says no, someone is going to have to pay for cake at some point.", "posttime": "2020-10-16 19:44:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,影响力,influencers", "title": "“我受够了有影响力的人要免费蛋糕。”", "title_en": "'I'm sick of influencers asking for free cake'", "transed": 1, "url": "https://www.bbc.co.uk/news/business-54543279", "via": "", "real_tags": ["免费", "影响力"]}, {"category": "", "categoryclass": "", "imagename": "0da10a0a2eadba0185680984a0fa9cd1.jpg", "infoid": 1029188, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你好，我是Aline(interviewing.io的创始人)。这是我们的客座作者系列的第二篇帖子。第一篇帖子谈到了你在面试公司时可能会遇到的危险信号。作为补充，这篇文章由我们一位多产的长期面试官撰写，探讨了受访者经常犯的错误。\n我对客座作家系列最兴奋的事情之一是它给我们的博客带来了多样化的观点。技术面试和招聘充满了争议，这些帖子并不是所有内容都会符合我的观点或官方对面试的看法。但这就是它的伟大之处。在这个行业工作了十多年，我仍然不认为有一种正确的方式来进行面试，我认为招聘总是会有一点混乱，因为这从根本上说是一个人性化的过程。即使我们不总是达成一致，我也承诺我们提出的内容将是精心策划的、高质量的，并由对这一领域充满热情的聪明人撰写。\n如果你对面试或招聘有强烈的意见，并且一直渴望写出来，我们很乐意听取你的意见。请给我发电子邮件至arein@interviewing.io以开始。\n威廉·伊恩·道格拉斯(William Ian Douglas)绰号“伊恩”(Ian)，用的是他/他的代名词。他住在科罗拉多州丹佛市，1996年毕业于计算机工程专业。他的职业生涯涉及后端系统、API架构、DevOps/DBA职责和安全，并一直担任管理小团队的团队负责人和工程总监。伊恩在2014年扩展到专业技术面试教练领域，并在2017年将他的整个职业生涯转移到丹佛地区的图灵软件与设计学院(Turing School of Software&amp；Design)教授软件开发。他于2017年夏天作为合同面试官加入Interviewing.io，是IIO制作的数据分析博客帖子的铁杆粉丝，这些博客帖子旨在帮助揭露和消除我们科技行业面试中的偏见。伊恩在https://techinterview.guide撰写技术指导信息，你可以在推特、领英和gihub上联系到他。\n最近，我在Interviewing.io(IIO)网站上进行了第600次面试。我想分享学到的经验教训，为什么我会这样对待面试，并就我在技术面试中看到的常见问题领域做出一些解释。平台上的每个面试官都是不同的，所以你的结果可能会有所不同。我们有一些优秀的人在这个平台上帮助我们，我们有一个很棒的社区在努力让我们自己变得更好。\n采访。io Mock采访在我们对IIO的采访中，我们用三个4分制给人们打分。1分意味着他们做得非常差，4分意味着他们在这一类别中做得非常好。我通常会在面试开始时，每个人马上得到3分(满分4分)，然后随着面试的进行，我会获得或失去分数。\n平台上的每一位面试官都会有一些他们比其他人更喜欢的方面。作为一名面试官，我自己的偏见倾向于沟通和解决问题，下面我会指出这一点。\n技术熟练程度在这一类别中，我根据候选人对他们选择的语言的熟练程度、他们在编写特定风格的算法时是否有重大问题、如果我在编码过程中需要给出很多提示来对他们进行评分。\n解决问题在这里，我给候选人打分，看他们把问题分解成小块的程度，想出解决小问题的策略，并在此过程中调试问题。调试时思考问题的能力与编写代码一样重要。当问题发生时，他们是被难住了，还是能够自己找到根本原因？\n沟通面试官真的很想听听你的决策过程。这在调试代码时也非常重要。我倾向于雇佣那些能很好地适应较小团队或开发人员集群的人。考虑到这一点，协作和轻松的沟通是赢得我的一个好方法。\n我在这里的采访中看到的常见问题领域是我在采访中看到的最主要的问题领域，不仅是在IIO上，而且总体上也是如此。我希望这个建议对你有帮助。\n常见问题1：过早进入代码我在所有类型和级别的开发人员中都看到了这一点，但主要是拥有2-5年经验的“中等”级别的开发人员。他们听到一个问题，用30秒或更少的时间谈论高级设计，并且急于开始编码。他们觉得自己像是在计时器上。他们想赶着把事情做完。这是一场冲向终点线的比赛。第一个越过终点线的人是胜利者。\n花时间想出一个中层设计的人，无论是伪代码还是只是写下他们的方法的注释，倾向于在以后花更少的时间调试他们的代码。那些直接开始编码的人会陷入我所说的“随用随用设计”问题，您需要花费大量时间重构您的代码，因为您需要更改传递的参数或返回值，或者等待，循环在错误的位置，等等。作为面试官，这一点很容易辨认出来。\n在中层设计上花费一些时间并不能保证你的成功，但从长远来看，通过更深入地思考你的计划可能会节省你的时间，而且你买来的额外时间可以在以后用来解决问题。\n另外，作为一名面试官，我希望看到你成功。特别是如果你在“现场”(现在是面对面或远程)，因为你在现场面试过程中花费了我们公司更多的钱。虽然我需要公平对待所有候选人，但如果我可以提前看到您的设计，并发现该设计中的缺陷，我就可以提出引导性问题来引导您找到问题并更早地纠正您的方法。\n如果您直接跳到代码中，我甚至不知道您的实现是否可以工作，而这不是安排您的面试官的好地方。在我真正理解您的代码中发生了什么之前，如果您已经编写了100行Java代码，那么我要纠正一个设计就会困难得多。\n在2012年的一次真正的采访中，我看到了这种缺乏规划的适得其反的可怕效果。应聘者被人力资源部的人带到我的面试间，问他们是否想要一瓶水，并答应回来。我们做了自我介绍，开始着手进行技术挑战。候选人没有分享细节，没有设计，几乎没有谈到高级方法，什么也没有写下来，然后开始在白板上编写代码。(这将是我进行的倒数第二次白板采访，我讨厌白板采访！)。几分钟后，HR出现了，大声敲门，递给他一瓶水，然后离开了。应聘者感激地喝了一杯，打开瓶盖，开始啜饮一口，这时他们脸上露出了令人不快的疲惫表情。送一瓶水分散了他们的注意力，让他们完全失去了思路，我无法帮助他们恢复，因为他们没有和我分享任何关于他们的做法的细节。他们花了几分钟重新思考这个问题，然后重新开始。\n然而，在这枚硬币的“另一面”，你可能会在设计阶段花费“太长时间”，没有时间来实施你的天才计划。我见过候选人通过中层设计，然后写笔记，然后用这些笔记手动演练一个示例，以真正确保他们的计划是好的，而现在他们只剩下几分钟的时间来实际实施工作了。也许是通信方面的加分，但我们也需要看到一些有效的代码。\n我通常推荐练习，直到您花大约5分钟思考高级设计选择，5分钟计划和证明中级设计，然后开始编写代码。这里的好消息是“熟能生巧”--你越是练习这种设计分解和解决问题的方法，你就会得到越好的效果。稍后会详细介绍这一点。\n常见问题区域2：交流“半信半疑”这是我多年来创造的一个术语，在这个术语中，您开始大声地说出一个想法，完成脑海中的想法，然后更改代码的某些内容。通常听起来是这样的：\n“嗯，我想知道我能不能…。…。…。不，不要紧，我就这样做吧。“。\n面试官想知道你的思维过程是怎么回事。重要的是要知道你是如何做决定的。您如何使想法合格或取消资格？你为什么选择用一种特殊的方式来实现某件事呢？您是否在代码中发现了潜在问题？那是什么东西？\n这些缺失的信息对你的面试官来说是一个隐藏的宝藏。只需几秒钟就可以将您的通信更改为以下内容：\n“我想知道如果…。嗯，…。嗯，我想把它作为深度优先搜索来实现，但考虑到_的限制，我认为更好的方法可能是_，你觉得呢？“\n这可能多花了2到3秒钟，你已经征求了我的意见或同意，我们可以一起考虑可能性，现在我们正在合作这一过程。你已经觉得自己是我未来的同事了！\n常见问题区域3：不问澄清问题您有一组整数。编写一个方法，找出两个加起来等于给定目标值的数字，立即停止，并报告这些数字。如果未找到任何内容，则返回两个“null”值。\n这是一个很棒的问题，它向我展示了你是如何看待算法的，以及当你听到一个问题时，你会做出什么样的假设。\n我编写代码已经有相当长的一段时间了。实际上是从1982年开始的。在我使用过的任何语言中都没有称为“分组”的数据结构。那么你对这个问题有什么假设呢？\n大多数候选人立即认为数字的“分组”是在一个数组中。您可以通过使用数组存储数字来成功解决此问题。您的算法可能是O(n^2)(n平方)算法，因为您将以指数方式迭代数据：对于每个值，迭代其余的值。有一种更有效的方法可以在O(N)时间内解决这个问题，方法是选择不同的数据结构。\n去问你的面试官有关这个问题的问题吧。如果他们告诉你做出你自己的假设，那就不同了，但是要问问他们是否是好的假设。询问是否有您将用作测试用例的备用数据集，这可能会影响您的算法。\n常见问题之四：假设面试官制定了所有规则是的，你在那里面试，但你在那里向他们展示你将如何在团队中工作，当有清晰、开放的沟通和协作意识时，团队工作得最好。在面试的前几分钟设定期望，特别是围绕沟通和工作流程。\n与面试官进行这种聊天并没有什么错：“在这样的技术挑战中，我的典型工作流程是花一两分钟静静地思考问题，并写下笔记，我稍后会与你分享这些想法，以获得你的意见。”然后，在我编写代码的同时，我也倾向于安静地工作，但我肯定会不时地暂停一下，在我进行的过程中分享我的思考过程，然后在我们第一次运行它之前更彻底地向您介绍代码。您觉得这样可以吗？或者您对我如何沟通或解决问题有不同的期望？“\n我保证你会让他们大吃一惊的。大多数面试官不会准备好让你这样考虑他们的期望。这表明你能很好地在团队中工作。你在为自己创造环境，同时也在为他人着想。你预先说明了你的意图，并让他们有机会在这个过程中进行合作。\n常见问题之五：没有像你的面试官那样更快地寻求帮助，我有可能在遇到技术挑战时提供少量的帮助。显然，我不能指导你完成所有的事情，但我宁愿给你一个提示，在一个题目上扣分，看着你最终在这个问题上取得成功，而不是默默地挣扎，绕着圈子转，让我们都觉得面试是在浪费时间。\n作为一名软件学院的专业面试者和讲师，我已经变得非常善于问引导性问题来引导你实现或回答问题，而不需要我给你解决方案。\n当你陷入困境时，承认是可以的。这不会让你失败，它会让你变得有人性。让你的面试官知道你在想什么，告诉他你哪里有问题。仔细倾听他们的反应，他们可能会提供问题的线索，或者可能会给你提供更全面的如何进行的建议。\n分享我最喜欢的资源当我们在IIO的面试结束后，我喜欢深入研究他们的过程中的许多反馈，以及我认为他们可以在哪些方面利用额外的练习来改进。一般说来，我会花10到20分钟回答别人的问题，有时会远远超出我一个小时的预期时间，并对事情进行更详细的讨论。我喜欢帮助IIO上的人。\n没有什么比听你自己录制的声音更糟糕的了。但所有的IIO采访都是录音的，我经常在我的反馈和事后的回顾笔记中告诉人们，我会在事后打字收听采访录音的最后几分钟，以审查我给他们的反馈。您还可以随时暂停这些录制并获取代码副本。(这些录音当然是你和你的面试官的隐私。)。\n在回放过程中，倾听你自己的思维过程以及你是如何交流你的想法的。当你解决其他挑战时，如果可能的话，找到一种方法来记录自己大声谈论问题，并为自己回放。你会变得更善于表达完整的想法。\n问题解决和中级设计更常见的实践网站，如HackerRank、CodeWars、LeetCode等，非常适合编写编码算法，但不给您任何练习设计过程的方法。\n我把我的学生送到欧拉计划。Euler是一位数学家，所以网站上的问题通常都是非常重的数学题，但你可以把问题改成你喜欢的任何形式。如果你不知道如何计算一个质数，没关系，把它换成一个数字是否能被17整除或其他东西。\n我喜欢欧拉计划，因为那里的挑战只有文字问题。您必须考虑所有问题：算法、要使用的数据结构，特别是如何将问题分解为更小的部分。\n我最喜欢的问题之一是他们档案中的第19个问题：计算1901年1月到1999年12月之间有多少个月是从一个星期天开始的。他们给你每个历月的天数，告诉你1900年1月1日是星期一，以及如何计算闰年。剩下的就看你的了。\n你把自己暴露在不同类型的问题中越多，你就越能更好地发现模式。\n练习，练习，练习我们给学生的一条建议是，每个技术挑战都要练习几次。我们的执行董事杰夫·卡西米尔(Jeff Casimir)告诉学生们要练习10次。这感觉像是一项很大的努力。我更多地瞄准了3到4次，我的理由是：\n当你第一次解决问题时，你所做的一切就是解决了问题。你可能在某些部分挣扎过，但你在这里唯一的真正成就是完成。\n如果您删除您的工作并重新开始，您可能会想出一个不同的方法来解决问题，也许是一个更有效的解决方案。也许不是，但至少你正在练习解决这类问题。\n现在擦掉你的作业，再做第三次。然后是第四次。这些时候，你会开始积极地记忆解决这个特殊问题所采取的策略。当您看到其他技术挑战时，这种“肌肉记忆”将帮助您发现相似之处。“哦，这看起来像是背包问题”，因为您已经多次解决了这个问题，所以进行高级设计和中级设计的时间缩短了很多。\n我最喜欢的技术挑战之一可以使用几种不同的算法(DFS、BFS、DP等)来解决。如果你认为你可以用类似的方式解决一个问题，那么用这些算法中的每一个也可以解决3到4次。您将非常善于发现相似之处，并拥有大量处理其他技术问题的策略。\n无耻的自我推销我一直在为https://techinterview.guide.有抱负的新开发人员写笔记。它还不完整，但我对准备技术面试、网络和外展、简历和求职信等有很多自己的想法。关于谈判策略和优雅的辞职，我还有几个章节要写，但我很乐意听取其他人对内容的反馈。\n我每天也有一系列的电子邮件，涵盖了几种面试问题，但不是从如何完美回答这些问题的角度来看，有很多资源可以做到这一点。相反，我会从面试官的角度审视问题--我真正想问的是什么，我希望你告诉我什么，我希望你不会说什么，等等。例如，一个小小的预览：当你被问到“告诉我关于你自己的情况”时，他们并不是真的在问你的生活故事。他们实际上是在问“告诉我关于你的一些事情的摘要，这些事情会让你在这里成为一个有价值的员工”。\n感谢您对受访者的期望和常见陷阱的洞察！对于我目前的情况来说，这是一个非常及时的时刻(在预筛选和预OnSites之间)。\n我会把自己归类为你所说的“中等水平”。我是一个“思考者”(也许，倾向于“过度思考者”)，所以我努力保持我开始的高层讨论的简明扼要，甚至更进一步，理解什么时候足够清楚地展示我的中层设计。我倾向于立即知道一种直接/暴力解决方案，但随后就会有几个更优化的版本的想法。\n在分享太多想法之前，你对如何自我编辑有什么建议吗？在透明度和听起来令人困惑的…之间有一条细微的界限。一旦你决定描述所选解决方案的中层设计，这样你就不会浪费时间(我已经做了太多次了！)，而是从面试官的角度来思考什么是“足够”的。换句话说，您需要在中层设计中看到什么/应该如何显示才能传达解决方案的框架并确认其清晰度？\n我真的很喜欢你对面试官坦率地告诉面试官你喜欢怎样工作的建议。(我很冗长-很明显-但一开始更喜欢沉默地思考)。这是不是应该从头到尾都要做的事情(比如询问开始编码的许可，询问这个解决方案是否清晰)？或者是否需要在直截了当、听起来合乎情理等之间取得平衡？\n这是一篇多么精彩的细致入微和富有洞察力的文章。通读伊恩分享的不同问题领域和资源，很明显，他非常关心那些他采访和指导的人。特别是，问题区域2和4是纯金的。作为被采访者，很容易迷失在我们的思想中，只说出我们所想的一半。此外，将面试官视为审讯者而不是合作者，这会让你很难唤起一种同志情谊，让团队合作成为一种有益的经历。\n我从技术产品支持过渡到编写代码的旅程已经进行了大约16个月。正是这类材料有助于阐明成功编写软件所需的沟通技能的广度。我非常感谢这篇帖子，并期待着来自Interviewing.io贡献者的更多内容。", "note_en": "Hey, Aline (founder of interviewing.io) here. This is the second post in our Guest Author series The first post talked about  red flags you might encounter while interviewing with companies . Complementarily, this post,  authored by one of our prolific, long-time interviewers,  explores common missteps that interviewees make.\n One of the things I’m most excited about with the Guest Author series is the diversity of opinions it’s bringing to our blog. Technical interviewing and hiring is fraught with controversy, and not everything these posts contain will be in line with my opinions or the official opinions of interviewing.io. But that’s what’s great about it. After over a decade in this business, I still don’t think there’s a right way to conduct interviews, and I think hiring is always going to be a bit of a mess because it’s a fundamentally human process. Even if we don’t always agree, I do promise that the content we put forth will be curated, high quality, and written by smart people who are passionate about this space.\n If you have strong opinions about interviewing or hiring that you’ve been itching to write about, we’d love to hear from you. Please email me at  aline@interviewing.io to get started.\n William Ian Douglas goes by “Ian”, and uses he/him pronouns. He lives in the Denver, Colorado region and graduated from a Computer Engineering program in 1996. His career spans back-end systems, API architecture, DevOps/DBA duties and security, and has been a team lead managing small teams, and Director of Engineering. Ian branched out into professional technical interview coaching in 2014, and in 2017 pivoted his entire career to teaching software development for the Turing School of Software &amp; Design in the Denver area. He joined interviewing.io as a contract interviewer in the summer of 2017 and is a big fan of the data analytics blog posts that IIO produces to help expose and eliminate bias in our tech industry interviews. Ian writes technical coaching information at   https://techinterview.guide  and you can reach him on   Twitter ,   LinkedIn  and   GitHub .\n I recently conducted my 600th interview on interviewing.io (IIO). I’d like to share lessons learned, why I approach interviews the way that I do, and shed some light on common problem areas I see happen in technical interviews. Every interviewer on the platform is different, and so your results may vary. We have some excellent folks helping out on the platform, and have a wonderful community working to better ourselves.\n The interviewing.io Mock Interview During our interviews on IIO, we rate people on three 4-point scales. A score of 1 means they did extremely poorly, and a 4 means they did extremely well in that category. I typically start my interview where everyone gets 3 out of 4 points right away, and then earn/lose points as the interview goes on.\n Every interviewer on the platform will have some aspect that they favor over others. My own bias as an interviewer tends to be around communication and problem solving, which I’ll point out below.\n Technical Proficiency In this category, I grade a candidate on how proficient they seem in their language of choice, whether they had significant problems coding an algorithm of a particular style, if I needed to give a lot of hints during coding.\n Problem Solving Here, I grade a candidate on how well they break the problem into smaller pieces, come up with a strategy for solving the smaller problems, and also debugging issues along the way. The ability to think through problems while debugging is just as important as writing the code in the first place. Are they stumped when a problem happens, or are they able to find the root cause on their own?\n Communication Interviewers really want to hear your decision-making process. This is also very important when debugging code. I tended to hire folks who would fit in well on smaller teams or clusters of developers. With that in mind, collaboration and easy communication are a good way to win me over.\n Common Problem Areas I See in Interviews Here are the top problem areas I see in interviews, not just on IIO, but in general. I hope you find this advice helpful.\n Common Problem Area 1: Jumping into code too soon I see this in developers of all types and levels, but mostly in the “intermediate” level of 2-5 years of experience. They hear a problem, talk about a high-level design for 30 seconds or less, and are eager to get coding. They feel like they’re on a timer. They want to rush to get things finished. It’s a race to the finish line. First one across the finish line is the winner.\n    People who take time to think out a mid-level design, whether that’s pseudocode or just writing out notes of their approach, tend to spend less time debugging their code later. Folks who jump right into coding fall into what I call “design-as-you-go” problems, where you’re spending lots of time refactoring your code because you need to change a parameter passed or a return value, or wait, that loop is in the wrong place, etc.. This is very easy to spot as an interviewer.\n Spending some time on mid-level design doesn’t guarantee your success, but it might save you time in the long run by thinking through your plan a little deeper, and that extra time you bought could be used to fix problems later.\n Also, as an interviewer, I want to see you succeed. Especially if you’re “on-site” (in person, or remote nowadays) because you’re costing our company a lot more money in an on-site interview process. While I need to be fair to all candidates in the amount of help I can give, if I can see your design ahead of time, and spot a flaw in that design, I can ask leading questions to guide you to the problem and correct your approach earlier.\n If you jump straight into code, I have no idea if your implementation is even going to work, and that’s not a great place to put your interviewer. It’s much harder for me to correct a design when you have 100 lines of Java code written before I really understand what’s going on in your code.\n I saw this lack of planning backfire in a horrible way in a real interview in 2012. The candidate was brought to my interview room by someone in HR, asked if they would like a bottle of water, and promised to return. We introduced ourselves and got down to the technical challenge. The candidate shared no details, no design, barely talked about a high-level approach, wrote nothing down, and started writing code on a whiteboard. (This would be my second-to-last whiteboard interview I ever conducted, I hate whiteboard interviews!) HR showed up a few minutes later, knocking loudly on the door, offering the bottle of water and leaving. The candidate, grateful for a drink, uncapped the bottle and started to take a sip when this awful, draining look came over their face.  The distraction of delivering a bottle of water made them completely lose their train of thought, and I couldn’t help them recover because they hadn’t shared any details with me about their approach. They spent several minutes re-thinking the problem and starting over.\n On the “other side” of this coin, however, you can spend “too long” on the design stage and run out of time to implement your genius plan. I’ve seen candidates talk through a mid-level design, then write notes, then manually walk through an example with those notes to really make sure their plan is a good one, and now they only have a few minutes left to actually implement the work. Extra points on communication, maybe, but we need to see some working code, too.\n  I typically recommend practicing until you spend about 5 minutes thinking through high-level design choices, 5 minutes to plan and prove the mid-level design, and then get to work on code. The good news here is that “practice makes better” — the more you practice this design break-down and problem solving, the better you’ll get. More on this later.\n Common Problem Area 2: Communicating “Half-thoughts” This is a term I’ve coined over the years, where you start to say a thought out loud, finish the thought in your head, and then change something about your code. It usually sounds something like this:\n “Hmm, I wonder if I could … … … no, never mind, I’ll just do this instead.”\n  Interviewers want to know what’s going on in your thought process. It’s important that thwey know how you’re making decisions. How are you qualifying or disqualifying ideas? Why are you choosing to implement something in a particular way? Did you spot a potential problem in your code? What was it?\n This missing information is a hidden treasure for your interviewer. It takes mere seconds to change your communication to something more like this:\n “I wonder if … hmm … well, I was thinking about implementing this as a depth-first-search, but given a constraint around ___ I think a better approach might be ___, what do you think?”\n That took maybe 2 or 3 extra seconds, and you’ve asked for my opinion or buy-in, we can consider possibilities together, and now we’re collaborating on the process. You already feel like my future coworker!\n Common Problem Area 3: Not asking clarifying questions  You have a grouping of integer numbers. Write a method that finds two numbers that add up to a given target value, stop immediately, and report those numbers. Return two ‘null’ values if nothing is found.\n This is a great question that shows me how you think about algorithms and the kinds of assumptions you make when you hear a problem.\n I’ve been coding for a pretty long time. Since 1982, actually. There’s no data structure called “a grouping” in any language I’ve ever used. So what assumptions are you going to make about the problem?\n Most candidates immediately assume the “grouping” of numbers is in an array. You can successfully solve this problem by using an array to store your numbers. Your algorithm will likely be an O(n^2) (n-squared) algorithm because you’ll be iterating over the data in an exponential way: for each value, iterate through the rest of the values. There’s a more efficient way to solve this in O(n) time by choosing a different data structure.\n Go ahead and ask your interviewer questions about the problem. If they tell you to make your own assumptions that’s different, but ask if they’re good assumptions. Ask if there are alternate data sets that you’ll be using as test cases which could impact your algorithm.\n Common Problem Area 4: Assuming your interviewer sets all the rules   Yes, you’re there for the interview, but you’re there to show them how you’ll work on the team, and teams work best when there is clear, open communication and a sense of collaboration. Spend the first few minutes of the interview setting expectations, especially around communication and work process.\n There’s nothing wrong with having this kind of chat with your interviewer: “My typical work process in a technical challenge like this is to spend a minute or two thinking quietly about the problem and writing down notes, I’ll share those thoughts with you in a moment to get your input. Then, while I code, I tend to work quietly as well, but I’ll be sure to pause now and then to share my thought process as I go, and then walk you through the code more thoroughly before we run it the first time. Would that be okay with you, or do you have different expectations of how you’d like me to communicate or work through the problem?”\n I promise you’ll blow their mind. Most interviewers won’t be ready for you to take their expectations into consideration like this. It shows that you’ll work well on a team. You’re setting the environment where you’re advocating for yourself, but also being considerate of others. You’re stating your intentions up front, and giving them the opportunity to collaborate on the process.\n Common Problem Area 5: Not asking for help sooner As your interviewer, I have a small amount of help that I’m likely able to provide during a technical challenge. I can’t coach you through everything, obviously, but I’d rather give you a hint, deduct a point on a rubric, and see you ultimately succeed at the problem, than to struggle silently and spin in circles and make us both feel like the interview is a waste of time.\n As a professional interviewer and an instructor at a software school, I’ve become pretty good at asking leading questions to guide you to a realization or answer without me giving you the solution.\n It’s okay to admit when you’re stuck. It doesn’t make you a failure, it makes you human. Let your interviewer know what you’re thinking and  where you’re having problems. Listen very carefully to their response, they might be offering a clue to the problem, or might give you more thorough advice on how to proceed.\n My Favorite Resources to Share When our interviews at IIO are over, I like to dive into a lot of feedback on their process and where I think they could use extra practice to improve. Generally, I spend 10 to 20 minutes, sometimes going way beyond my one-hour expected time slot, to answer questions for someone, and going into more detail on things. I  LOVE to help people on IIO.\n  Communication There’s nothing worse than listening to your own recorded voice. But all IIO interviews are recorded, and I often tell folks in my feedback and in the review notes I type up afterward to listen to the last few minutes of the interview recording to review the feedback I give them. You can also pause those recordings and grab a copy of your code at any time. (These recordings are of course private to your and your interviewer.)\n During the playback, listen to your own thought process and how you communicate your ideas. As you work through other challenges, find a way to record yourself talking through the problem out loud if possible, and play that back for yourself. You’ll get better at articulating full and complete thoughts.\n Problem Solving and Mid-Level Design The more common practice sites like HackerRank, CodeWars, LeetCode, etc, are great for writing a coded algorithm, but don’t give you any way to exercise your design process.\n I send my students to  Project Euler.  Euler was a mathematician, so the problems on the website will generally be pretty math-heavy, but you can change the problems to be whatever you’re comfortable building. If you don’t know how to calculate a prime number, that’s fine, swap that out for whether a number is equally divisible by 17 or something instead.\n I like Project Euler because the challenges there are just word problems. You have to think of everything: the algorithm, which data structure(s) to use, and especially how to break the problem into smaller pieces.\n One of my favorite problems is #19 in their archive: counting how many months between January 1901 and December 1999 began on a Sunday. They give you the number of days in each calendar month, tell you January 1st 1900 is a Monday, and how to calculate a leap year. The rest is up to you.\n The more you expose yourself to different types of problems, the better you’ll get at spotting patterns.\n Practice, Practice, Practice One piece of advice we give our students is to practice each technical challenge several times. Our executive director, Jeff Casimir, tells students to practice something 10 times. That feels like a big effort. I aim more for 3 to 4 times, and here’s my reasoning:\n The first time you solve a problem, all you’ve done is solve the problem. You might have struggled through certain parts, but your only real achievement here is finishing.\n If you erase your work and start it a second time, you might think of a different approach to solving the problem, maybe a more efficient solution. Maybe not, but at least you’re getting practice with this kind of problem.\n Now erase your work and do it a third time. Then a fourth time. These are the times when you will start to actively build a memory of the strategy it takes to solve this particular problem. This “muscle memory” will help you when you see other technical challenges, where you’ll start to spot similarities. “Oh, this looks like the knapsack problem” and because you’ve solved that several times, the time you take on high level design and mid-level design just shortened quite a lot.\n One of my favorite technical challenges can be solved using a handful of different algorithms (DFS, BFS, DP, etc). If you think you can solve a problem in a similar fashion, solve it 3 or 4 times with each of those algorithms as well. You’ll get REALLY good at spotting similarities, and have a great collection of strategies to approach other technical problems.\n Shameless Self-Promotion I’ve been writing up notes for aspiring new developers at  https://techinterview.guide. It’s not complete, but I have a lot of my own thoughts on preparing for technical interviews, networking and outreach, resumes and cover letters, and so on. I still have a few chapters to write about negotiation tactics and graceful resignations, but I’m happy to take feedback from others on the content.\n I also have a daily email series covering several kinds of interview questions, but not from a perspective of how to answer the questions perfectly, there are plenty of resources out there to do that. Instead, I examine questions from an interviewer’s perspective — what am I really asking, what do I hope you’ll tell me, what do I hope you won’t say, and so on. A small preview, for example: when you’re asked “Tell me about yourself” they’re not really asking for your life story. They’re really asking “Tell me a summary of things about you that will make you a valuable employee here”.\n      Thanks for your insight into expectations and common pitfalls of interviewees! This has come at very timely point for my current situation (between pre-screenings and pre-onsites).\n I woud classify myself in that category of “mid-level” you describe. I’m a “thinker” (perhaps, leaning towards “over-thinker”) so I struggle with keeping my beginning high-level discussion concise, and even further, understanding when enough is enough to clearly demonstrate my mid-level design. I tend to immediately know a direct/brute-force solution, but that then branches into several ideas for more optimized versions.\n Do you have advice on how to self-edit before sharing too many ideas? There is that fine line between transparency and sounding confused… And potentially, thoughts on what is *enough* once you decide to describe a mid-level design for the solution chosen so that you aren’t wasting time (as I have done too many times!), but from an interviewer’s perspective. In other words, what do you need to see in the mid-level design/how should it be shown to convey the framework of the solution and confirm its clarity?\n I really like your suggestion on frankness with the interviewer regarding how you prefer to work. (I am verbose – clearly – but prefer to think with silence at first). Is that something that should be done throughout (such as asking permission to start coding, asking whether this solution is clear)? Or is there a need to balance between directness, sounding to feable, etc.?\n  What a wonderfully nuanced and insightful article. Reading through the different problem areas and resources Ian shares, it’s apparent he cares deeply for those he interviews and instructs. In particular, problem areas 2 and 4 are pure gold. As an interviewee, it’s very easy to get lost in our thoughts and speak only half of what we’re thinking. As well, perceiving the interviewer as an interrogator instead of collaborator makes it challenging to conjure the sense of camaraderie that makes working on a team a rewarding experience.\n I’m about 16 months into my journey to transition from technical product support to writing code. It’s this kind of material that helps to illuminate the breadth of communication skills necessary to succeed in writing software. I’m so grateful for this post and looking forward to more from Interviewing.io contributors.", "posttime": "2020-10-16 19:44:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面试,技术,problems", "title": "我在技术面试中看到的常见问题", "title_en": "Common problems I see in technical interviews", "transed": 1, "url": "https://blog.interviewing.io/ive-conducted-over-600-technical-interviews-on-interviewing-io-here-are-5-common-problem-areas-ive-seen", "via": "", "real_tags": ["面试", "技术", "problems"]}, {"category": "", "categoryclass": "", "imagename": "f6464d3542cf28d18402f17b8c57e14d.jpg", "infoid": 1029187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界卫生组织(World Health Organization)赞助的一项对30个国家的11,000多人进行的一项研究显示，雷米德韦是美国唯一被授权用于治疗新冠肺炎的抗病毒药物，但未能防止患者死亡。\n这些数据于周四发布在网上，尚未经过同行审查或在科学期刊上发表。\n加拿大阿尔伯塔大学传染病内科医生伊兰·施瓦茨(Ilan Schwartz)说：“这就解决了这个问题--肯定没有死亡率方面的好处。”\n但加州大学旧金山分校(University of California，San Francisco)传染病专家彼得·金宏(Peter Chin-Hong)博士则更为谨慎。\n他说，像这样的大规模试验，在拥有不同医疗保健系统的不同国家进行，可能会导致不一致的治疗方案，其效果可能很难分析。\n“护理投入太多了，”金宏医生说。“药物只是其中的一部分。”\nRemdesivir最初是为了治疗埃博拉和丙型肝炎而开发的，它通过将自己塞进新的病毒基因来干扰病毒的复制。\n在美国国立卫生研究院(National Institutes Of Health)进行试验后，该药物于5月1日获得美国食品和药物管理局(Food And Drug Administration)的紧急授权。试验发现，瑞希韦适度缩短了重症患者的康复时间。\n那项研究也没有发现雷米西韦可以预防新冠肺炎患者的死亡。美国国家过敏和传染病研究所所长安东尼·福奇(Anthony Fuci)博士当时承认，雷米德韦尔不是一种“击倒”药物。\n根据药物制造商吉利德(Gilead)的说法，10月8日发表在“新英格兰医学杂志”(New England Journal Of Medicine)上的一项最终分析表明，在接受瑞德韦治疗的某些患者中，“死亡率有下降的趋势”。\n周四，吉利德驳斥了世卫组织的研究结论，指出各种药物和药物组合已经在广泛的情况下进行了评估，更严格的研究发现了好处。\n由于它的设计，试验进行的方式有“显著的异质性”。该公司在一份事先准备好的声明中表示：“因此，目前还不清楚是否可以从研究结果中得出任何结论性的结论。”\n这种抗病毒药物已经成为美国新冠肺炎患者护理标准的一部分，自获得批准以来，已经为数以千计的患者提供了治疗，其中包括特朗普总统本月被诊断为新冠肺炎之后。\n对于在美国有私人保险的患者来说，这种药物的价格是每个疗程3120美元。\n虽然最初只批准用于病情足以需要补充氧气或呼吸支持的人，但redesivir的紧急授权在8月份扩大到包括所有住院患者，无论疾病严重程度如何。\n这一举动遭到了一些专家的批评，他们说FDA在没有足够证据的情况下做出了这一转变。\n世界卫生组织的这项名为团结试验的研究在30个国家的405家医院招募了11,300多名与新冠肺炎一起的成年人。参与者被单独或联合给予四种药物：雷米西韦、羟氯喹、洛匹那韦、干扰素或干扰素加洛匹那韦。大约4100人没有接受药物治疗。\n最终，与没有接受药物治疗的患者相比，没有任何药物或药物组合降低了死亡率、需要机械通气的机会或在医院度过的时间。\n之前的几项研究已经指出，羟氯喹和洛比那韦作为治疗冠状病毒的药物是无效的。关于干扰素的数据较少，干扰素是免疫系统对病毒做出反应的一种分子。\n在他们的手稿中，该研究的作者称总体发现“没有希望”，并表示它们“足以驳斥早期的希望”，即任何测试的药物都“将大幅降低住院死亡率、开始通气或住院时间”。\n耶鲁大学(Yale University)传染病内科医生马里卡尔·马利尼斯博士(Dr.Maricar Malinis)说，根据之前的研究结果，redesivir的发现并不令人惊讶，但它们“仍然有效”，特别是考虑到团结工会试验的规模令人眼花缭乱。\n尽管如此，施瓦茨博士和马里卡尔博士都指出，雷米德韦尔仍可能使新冠肺炎患者在病程早期受益。\n严重的新冠肺炎被认为在很大程度上是由过度活跃的免疫反应推动的，这种免疫反应在病毒感染人体几天后开始。在此之前，一种抗病毒药物可能足以抑制病毒，以保护一个人免受免疫系统的友好攻击。\n施瓦茨博士说，在那之后再使用瑞希韦尔可能是没有意义的，并补充说，“马已经出了谷仓。”", "note_en": "Remdesivir, the  only antiviral drug authorized for treatment of Covid-19 in the United States,  fails to prevent deaths among patients, according to a study of more than 11,000 people in 30 countries sponsored by the World Health Organization.\n The data, which were posted online on Thursday, have not yet been peer-reviewed or published in a scientific journal.\n “This puts the issue to rest — there is certainly no mortality benefit,” said Dr. Ilan Schwartz, an infectious-disease physician at the University of Alberta in Canada.\n But Dr. Peter Chin-Hong, an infectious-disease expert at the University of California, San Francisco, was more circumspect.\n A huge trial like this one, conducted in various countries with various health care systems, can lead to inconsistent treatment protocols whose effects can be difficult to analyze, he said.\n “So much goes into care, “ Dr. Chin-Hong said. “The drug is only part of it.”\n Remdesivir, which was originally developed as a treatment for Ebola and hepatitis C, interferes with the reproduction of viruses by jamming itself into new viral genes.\n The drug was  granted emergency authorization by the Food and Drug Administration on May 1 following a trial by the National Institutes of Health, which found that remdesivir modestly reduced the time to recovery in severely ill patients.\n  That study, too, did not find that remdesivir prevented deaths in patients with Covid-19. Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, acknowledged at the time that remdesivir was not a “knockout” drug.\n A final  analysis, published in The New England Journal of Medicine on Oct. 8, suggested “a trend toward reduced mortality” in certain patients receiving remdesivir,  according to the drug’s maker, Gilead.\n Gilead disputed the conclusions of the W.H.O. study on Thursday, noting that a variety of drugs and drug combinations had been evaluated under a wide range of circumstances and that more rigorous studies had found a benefit.\n Because of its design, there was “significant heterogeneity” in the way the trial was conducted. “Consequently, it is unclear if any conclusive findings can be drawn from the study results,” the company said in a prepared statement.\n  The antiviral has become part of the standard of care for Covid-19 patients in the United States and has been administered to thousands of patients since its approval, including President Trump after his diagnosis with Covid-19 this month.\n The drug costs $3,120 per treatment course for patients with private insurance in the United States.\n  Although originally cleared only for use in people who were sick enough to need supplemental oxygen or breathing support, remdesivir’s emergency authorization was  expanded in August to include all hospitalized patients, regardless of disease severity.\n The move was criticized by some experts, who said the F.D.A. had made the shift without sufficient evidence.\n The W.H.O.’s study, called the Solidarity trial, enrolled more than 11,300 adults with Covid-19 in 405 hospitals in 30 countries. The participants were given four drugs singly or in combination: remdesivir, hydroxychloroquine, lopinavir, interferon or interferon plus lopinavir. About 4,100 received no drug treatment.\n In the end, no drug or combination reduced mortality, the chances that mechanical ventilation would be needed, or time spent in the hospital, compared with the patients without drug treatment.\n Several previous studies had pointed to the futility of hydroxychloroquine and lopinavir as treatments against the coronavirus. Less data has been published on interferon, a molecule produced by the immune system in response to viruses.\n In their manuscript, the study’s authors called the overall findings “unpromising” and said they “suffice to refute early hopes” that any of the drugs tested “will substantially reduce inpatient mortality, initiation of ventilation or hospitalization duration.”\n  The remdesivir findings aren’t terribly surprising based on previous findings, but they are “still impactful,” especially given the dizzying size of the Solidarity trial, said Dr. Maricar Malinis, an infectious disease physician at Yale University.\n Still, both Dr. Schwartz and Dr. Maricar noted that remdesivir might still benefit people with Covid-19 earlier in the course of their illness.\n Severe Covid-19 is thought to be driven largely by an overly exuberant immune response that starts several days after the virus infects the body. Before that happens, an antiviral might tamp down the virus enough to protect a person from the immune system’s friendly fire.\n Administering remdesivir after that point may be pointless, Dr. Schwartz said, adding, “The horse is out of the barn.”", "posttime": "2020-10-16 12:08:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "未能,fails,患者", "title": "Remdevir未能阻止新冠肺炎在审判中死亡", "title_en": "Remdesivir Fails to Prevent Covid-19 Deaths in Trial", "transed": 1, "url": "https://www.nytimes.com/2020/10/15/health/coronavirus-remdesivir-who.html", "via": "", "real_tags": ["未能", "fails", "患者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Math+协议包括用于新冠肺炎预防和早期治疗的伊维菌素选项；疾病阶段关键护理(US2020-10-14)TrialSiteNews马里克博士(东肯塔基医学院)协议建议(可选)将伊维菌素用于预防(！)、门诊患者和轻症住院患者", "note_en": "MATH+ Protocol Includes Ivermectin Option for Prophylaxis and Early Treatment of COVID-19; Phase of Disease Key to Care (US 2020-10-14) TrialSiteNews Dr. Marik (Eastern Kentucky Medical School) protocol recommends (optionally) IVM for prophylaxis (!), outpatients and mildly-ill inpatients", "posttime": "2020-10-16 11:46:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "早期,rate,协议", "title": "伊维菌素：基于多项研究的早期治疗，新冠肺炎治愈率约为100%", "title_en": "Ivermectin: ~100% Covid-19 cure rate if treated early based on multiple studies", "transed": 1, "url": "http://www.reddit.com/r/ivermectin", "via": "", "real_tags": ["早期", "rate", "协议"]}, {"category": "", "categoryclass": "", "imagename": "9f891322936cf028d0420d766fd57596.jpg", "infoid": 1029185, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "🆓免费私网是100%免费的。它不是免费的，它是免费的。像在演讲中一样自由。免费PN不需要任何费用，而且永远不会。没有信用卡，没有账户，没有费用，没有收入。\n📺没有带宽上限。没有油门。全天流媒体，然后下载。与其他VPN不同，FreePN永远不会阻碍您的连接。\n🔒FreePN对所有网络流量使用AES256位加密，因此您可以放心，只要您重新连接，您就会受到保护。\n👻建立在ToR的点对点原则之上，是唯一完全匿名的虚拟专用网。FreePN从不记录您的IP或跟踪您的活动。\n🌟FreePN是第一个致力于保护您的在线隐私的完全免费、完全开放的网络。加入网络很容易：只需下载并安装应用程序即可。没有账户，没有注册，没有设置。一旦你启动了这款应用程序，你就已经受到了保护。事情就是这么简单。FreePN的代码也是完全开源的。你不必相信我们关于隐私的说法--你可以自己去看看。\n有了FreePN，你就可以从世界任何地方传输你最喜欢的内容--比如Netflix、迪士尼+或🌎，绕过当地政府对应用程序和网站的审查，并阻止互联网服务提供商的带宽限制。\n😌互联网提供商、网络运营商、广告服务公司、政府和黑客都可以跟踪和监控您的在线活动。FreePN保护您的数据不被窥探，让您高枕无忧。", "note_en": "🆓 FreePN is 100% free. It&#39;s not freemium, it&#39;s free. Free as in speech. FreePN costs nothing, and always will. No credit card, no account, no cost, no catch.\n 📺 No bandwidth caps. No throttling. Stream all day, and download away. Unlike other VPNs, FreePN will never bottleneck your connection.\n 🔒 FreePN uses AES 256-bit encryption on all network traffic, so you can rest assured that as long as you&#39;re connected, you&#39;re protected.\n 👻 Built on the peer-to-peer principles of Tor, FreePN is the only completely anonymous VPN. FreePN never logs your IP or tracks your activity.\n  🌟 FreePN is the first completely free, completely open network dedicated to protecting your online privacy. Joining the network is easy: just download and install the app. No accounts, no registration, no setup. Once you start the app, you&#39;re already protected. It&#39;s that simple. FreePN&#39;s code is also completely open-source. You don&#39;t have to trust what we say about privacy - you can   see for yourself.\n 🌎 With FreePN, you can stream your favorite content -- like Netflix, Disney+, or Spotify -- from anywhere in the world, bypass local government censorship on apps and websites, and defeat ISP bandwidth throttling.\n 😌 Internet providers, network operators, ad services, governments, and hackers can all   track &amp; monitor your activity online. FreePN shields your data from prying eyes, giving you peace of mind.", "posttime": "2020-10-16 11:25:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,peer", "title": "FreePN：开源对等VPN服务", "title_en": "FreePN: Open-source peer-to-peer VPN service", "transed": 1, "url": "https://www.freepn.org/", "via": "", "real_tags": ["开源", "peer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "车-杆平衡问题是强化学习的一个典型问题。一根杆子系在带有旋转接头的手推车上。代理人必须通过向左或向右移动手推车来平衡杆子。\n互联网上的大多数解决方案似乎都采用强化学习结合复杂的Kera模型来解决这一问题。\n在这篇文章中，我将向您展示，如果您足够了解您的系统，您不需要任何深度学习方案。在手摇平衡的情况下，你所需要的只是一些基本的力学知识。\n系统在任何时候的状态$t$由$(x，v，\\θ，\\omega)$与。\n有了这个，我们就可以计算出手推车和柱子的位置为$t&39；$。代理检查手推车的水平位置是否在杆的水平位置的左侧。如果是，把手推车移到右边，否则把手推车移到左边。\nDef Make_Decision(x，v，θ，ω，L=1，dt=0.027)：预计θ=θ+ω*dt预计x_x_Cart=x+v*dt预计x_尖端极=预计x_Cart+NP。如果预测_x_TIP_POLE&lt，则SIN(预测_θ)*L返回0；如果预测_x_Cart为1，则返回1。\n你需要知道时间步长$\\Δt$和极点长度$L$。通过试验和错误，我发现$\\Δt\\约为0.027，L=1$在我的计算机上运行良好。\nMAX_SCORE=500 n_SPECTES=40 SCORES=[]，适用于范围内的k(N_SPECTES)：环境。当True：step+=1 env时，Reset()step=0。Render()state=env。状态操作=Make_Decision(*STATE)_，_，TERMINAL，_=env。如果终止或步骤&&gt;=MAX_SCORE：中断分数，则步骤(操作)。附加(步骤)。\n如果超过100集的移动平均超过195集，OpenAI认为一种策略是一种解决方案。\n一旦得分超过500，我们就停止模拟。否则，它将永远保持平衡。", "note_en": "The  cart-pole balancing problem is a prototypical problem for reinforcement learning. A pole is attached to a cart with a rotating joint. An agent has to balance the pole by moving the cart left or right.\n Most solutions in the internet seem to use reinforcement learning with complicated Keras model to solve this problem.\n In this post, I will show that if you understand your system well enough, you don&#39;t need any deep-learning schemes. In the case of cartpole balancing, all you need is some rudimentary knowledge of mechanics.\n  The state of the system at any time $t$ is given by $(x,v, \\theta, \\omega)$ with\n  With this, we can compute the positions of the cart and the pole at $t&#39;$. The agent checks if the horizontal position of the cart is to the left of the horizontal position of the pole. If yes move the cart to the right, otherwise move the cart to the left.\n def  make_decision ( x ,  v ,  theta ,  omega ,  L = 1 ,  dt = 0.027 ):  predicted_theta  =  theta  +  omega * dt  predicted_x_cart  =  x  +  v * dt  predicted_x_tip_pole  =  predicted_x_cart  +  np . sin ( predicted_theta ) * L  return  0  if  predicted_x_tip_pole  &lt;  predicted_x_cart  else  1\n You need to know the time-step $\\delta t$ and the length of the pole $L$. Through trial and errors, I saw that $\\delta t \\approx 0.027, L=1$ works great on my computer.\n  MAX_SCORE  =  500 n_episodes  =  40 scores  =  [] for  k  in  range ( n_episodes ):  env . reset ()  step  =  0  while  True :  step  +=  1  env . render ()  state  =  env . state  action  =  make_decision ( * state )  _ ,  _ ,  terminal ,  _  =  env . step ( action )  if  terminal  or  step  &gt;=  MAX_SCORE :  break  scores . append ( step )\n  OpenAI considers a strategy to be a solution if it the moving average over 100 episode exceeds 195.\n We stop the simulation once we go past a score of 500. Otherwise, it will balance forever.", "posttime": "2020-10-16 11:25:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "强化,reinforcement,手推车", "title": "当你有基础物理的时候，你不需要强化学习", "title_en": "You don't need reinforcement learning when you have basic physics", "transed": 1, "url": "https://npdeep.github.io/cartpole-without-reinforcement-learning.html", "via": "", "real_tags": ["强化", "手推车"]}, {"category": "", "categoryclass": "", "imagename": "7cd787665b08c3145c539e91c90e99da.jpg", "infoid": 1029183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于研究游戏是如何制作的人来说，视频游戏源代码和其他来源材料无疑是最好的资源。然而，这些材料充其量也是稀缺的，网上几乎没有可用的例子，机构档案馆中的例子就更少了。更糟糕的是，媒体最早时代的历史源代码正在一天比一天丢失。\n我们想要改变这一点。今天，我们宣布我们的视频游戏源项目，这是VGHF到目前为止最雄心勃勃的计划。这敲响了保护这一濒危资源的警钟，号召人们找到它，让它变得容易获取，并以前瞻性的眼光展望一个将这种材料作为教育资源司空见惯的世界。\n简单地说，当我们提到视频游戏的“来源”时，我们指的是制作过程中使用的原材料，包括但不限于源代码、艺术、文档和通信记录(想想电子邮件、信件，或者像我们档案中的一些存储库那样，传真)。\n在视频游戏行业中，源代码的保存和文档记录是游戏在最初发布之后继续存在的原因。如果没有它，重新制作一款游戏，甚至将其移植到另一个平台上几乎是不可能的。\n在历史学家的手中，一个正确存档的源库是仅次于时间旅行的第二好东西。\n我们已经确定了视频游戏来源无法获取的三个关键因素：交易保密性、熵和缺乏意识。\n简单地说，来源是其所有者的知识产权，在几乎所有的情况下，都被视为行业内的商业秘密。如果竞争对手可以访问游戏的源代码，游戏的各个方面就可以很容易地被克隆。不幸的是，视频游戏档案没有内部的“诉讼时效”，所以一款30年前的绝版游戏往往和目前在售的游戏一样受到严密保护。\n这也是熵宣称其受害者的方式。过了鼎盛时期的原始材料往往会被遗忘，更糟糕的是，会被销毁，因为商业行业内的长期档案做法非常罕见。由于办公室搬迁、关闭、事故、被盗和忘记的知识，我们丢失了无数的档案-可能没有人留在工作人员那里，记得旧文件在哪里，或者如何取回它们。\n最后，到目前为止，还没有一个协调一致的视频游戏源宣传活动。我们采访过的许多开发人员惊讶地发现，人们对这些材料有着历史上的兴趣，这些材料经常被遗忘在软盘或其他过时的介质上，迫切需要备份。\n我们希望尽可能多地保存资源，并使其在教育上的使用正常化。\n要实现这一目标，我们必须找出并解决阻碍这种情况发生的问题。为此，我们已经开始成立一个咨询委员会，成员不仅包括商业电子游戏行业的人士，还包括学术界和其他与我们类似的非营利性机构的人士。\n我们还以身作则，制作内容展示历史学家手中的视频游戏素材的力量。我们解构了一部16位的经典游戏，从死亡中找回了一款丢失的游戏，并展示了在一个未完成的原型中发现的隐藏的历史。\n我们也很自豪地宣布将在10月30日举办一项活动，通过与游戏创建者罗恩·吉尔伯特(Ron Gilbert)一起查看原始材料来庆祝“猴岛的秘密”30周年。门票在这里可以买到。\n总有一天，通过图书馆和机构获取资源将会像今天的作者手稿和电影制作档案馆一样普遍。在我们到达那里之前，我们还有很长的路要走，但这段旅程现在就开始了。\n如果你想与这个项目取得联系，或者如果你有需要帮助保存的材料，那我们就谈谈吧！给我们发电子邮件到Sourecode@gameHistory y.org。\n视频游戏源项目是一个100%的志愿者倡议。您的财政支持有助于确保我们能够做好这件事。", "note_en": "Video game source code and other source materials are inarguably the best resources for those studying how a game was made. And yet the availability of these materials is scarce at best, with few examples available online and even fewer in institutional archives. Worse, historical source code from the earliest days of the medium is being lost by the day.\n We’d like to change that. Today, we’re announcing what we’re calling our Video Game Source Project, the VGHF’s most ambitious initiative to date. It’s a wake-up call to preserve this endangered resource, a call to arms to locate it and make it accessible, and a forward-thinking vision of a world in which using this material as an educational resource is commonplace.\n   Simply put, when we refer to a video game’s “source”, we mean the raw materials used in its production, including but not limited to source code, art, documentation, and records of correspondence (think emails, letters, or, as is the case for some repositories in our archives, faxes).\n In the video game industry, the preservation and documentation of source is what allows a game to survive past its initial release. Remastering a game, or even porting it to another platform, is nearly impossible without it.\n In the hands of an historian, a properly archived source repository is the next best thing to time travel.\n    We’ve identified three key factors for video game source being inaccessible: trade secrecy, entropy, and a lack of awareness.\n Simply put, source is the intellectual property of its owner, and in almost all cases, is seen as a trade secret within the industry. If competitors had access to a game’s source, aspects of the game could easily be cloned. Unfortunately, there is no internal “statute of limitations” for video game archives, so an out-of-print game from 30 years ago is often as closely guarded as a game that’s currently for sale.\n This is also how entropy claims its victims. Source material that is past its prime is often forgotten or, worse, destroyed, since long-term archival practices within the commercial industry are incredibly rare. We have lost countless archives due to office moves, closures, accidents, theft, and forgotten knowledge — there might not be anyone left on staff who remembers where the old files are, or how to retrieve them.\n And finally, there just hasn’t been a coordinated awareness campaign for video game source until now. Many developers we’ve spoken to have been surprised to learn that there is historical interest in this material, which is often sitting forgotten on floppy disks or other deprecated media in desperate need of backing up.\n  We want to preserve as much source as we can, and to normalize its educational use.\n And to get there, we must identify and solve the issues that are preventing this from happening. To that end, we’ve begun to establish an advisory committee consisting of people not only from the commercial video game industry, but from academia and other non-profit institutions similar to ours.\n We’re also leading by example, producing content that demonstrates the power of video game source material in an historian’s hands. We’ve  deconstructed a 16-bit classic, brought a lost game  back from the dead, and demonstrated the  hidden history found in an unfinished prototype.\n We’re also proud to announce an event on October 30, celebrating the 30th anniversary of The Secret of Monkey Island by looking through its source material with the game’s creator, Ron Gilbert.  Tickets are available here.\n   One day, access to source through libraries and institutions will be as common as author manuscripts and film production archives are today. We’ve got a long way to go until we get there, but that journey starts now.\n  If you’d like to get in touch about the project, or if you have material you’d like help conserving, let’s talk! Email us at  sourcecode@gamehistory.org.\n The Video Game Source Project is a 100% volunteer initiative. Your financial support helps ensure that we can do this right.", "posttime": "2020-10-16 11:25:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,视频,game", "title": "视频游戏源项目", "title_en": "The Video Game Source Project", "transed": 1, "url": "https://gamehistory.org/video-game-source-project/", "via": "", "real_tags": ["游戏", "视频", "game"]}, {"category": "", "categoryclass": "", "imagename": "11e1dba6b869c75e11fb655185e8f92d.jpg", "infoid": 1029182, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取的有关黑客的详细信息文件仍不清楚。勒索软件团伙还威胁说泄露源代码看门狗的成员：军团一场即将上演的育碧游戏。..。\n微软认为，实验架构Cheri将对2019年修复的错误数量产生重大影响。\nDDoS攻击是以下攻击之一最原始的形式网络攻击，但是他们&#39；We‘我们也是最强大的，并且可以很难停下来。了解如何识别和防范DDoS攻击..。\n如果你受够了与Facebook合作是因为它侵犯隐私的行为和影响选举的职位，你可能想要尝试一个", "note_en": "Details\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tabout\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thackers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tobtained\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfiles\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tremain\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunclear.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRansomware\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgang\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\talso\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthreatened\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tleak\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsource\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcode\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWatch\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDogs:\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLegion,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupcoming\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUbisoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgame.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft reckons experimental architecture CHERI would have had a big impact on the number of bugs fixed in 2019.\n  DDoS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tattacks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tone\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrudest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tforms\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcyberattacks,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthey&#39;re\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\talso\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tone\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmost\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpowerful\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdifficult\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstop.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLearn\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tidentify\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprotect\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tagainst\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDDoS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tattacks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n    If\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tup\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFacebook\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbecause\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprivacy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tviolations\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\telection\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinfluencing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tposts,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmight\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twant\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttry\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsocial\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmedia\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplatform\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat’s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdoing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trather\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twell.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-10-16 11:06:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,2020,入侵,fraud,育碧", "title": "报告：3M+Dickey‘s烧烤店客户的支付卡详细信息在2019年7月至2020年8月期间在POS入侵事件中被盗，被发布在欺诈市场上", "title_en": "Report: payment card details of 3M+ Dickey's Barbecue Pit customers, stolen in a POS breach between July 2019 and Aug. 2020, were posted on a fraud marketplace", "transed": 1, "url": "https://www.zdnet.com/article/card-details-for-3-million-dickeys-customers-posted-on-carding-forum/", "via": "", "real_tags": ["发布", "2020", "入侵", "fraud", "育碧"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tasmota不是商业产品，支持有限。你必须愿意自己研究和解决潜在的问题。\nTasmota是由Theo Arends创建和维护的基于ESP8266的设备的开源固件。\n一切都以Sonoff-MQTT-OTA开始，并于2016年1月25日承诺。作者：西奥·阿伦斯特。它的目标是为基于ESP8266的ITEAD Sonoff设备提供MQTT和无线或OTA固件。\n最初只是一种简单的方式，可以将云绑定的Sonoff Basic(市场上最早的廉价且可访问的智能家居设备之一)侵入本地控制的设备，但现在已经发展成为几乎任何基于ESP8266的设备的完全成熟的生态系统。", "note_en": "Tasmota is not a commercial product and support is limited. You have to be willing to research and solve potential problems yourself.\n    Tasmota is an open source firmware for  ESP8266 based devices created and maintained by  Theo Arends.\n  Everything began as  Sonoff-MQTT-OTA with a  commit on 25th January 2016. by Theo Arendst. Its goal was to provide ESP8266 based  ITEAD Sonoff devices with MQTT and &#39;Over the Air&#39; or OTA firmware.\n  What started as a simple way to hack a cloud bound Sonoff Basic (one of the first cheap and accessible smart home devices in the market) into a locally controlled device has grown into a fully fledged ecosystem for virtually any ESP8266 based device.", "posttime": "2020-10-16 11:02:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,适用,cloud,设备", "title": "Tasmota：适用于ESP8266设备的免云开源智能家居固件", "title_en": "Tasmota: Cloud-free open source smart home firmware for ESP8266 devices", "transed": 1, "url": "https://tasmota.github.io/docs/About/", "via": "", "real_tags": ["开源", "适用", "cloud", "设备"]}, {"category": "", "categoryclass": "", "imagename": "ece5676de67efb21a9e3380aee757708.jpg", "infoid": 1029180, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加入此频道以支持测试并获得额外福利，例如向亚当提问：https://www.youtube.com/channel/UCiDJtJKMICpb9B1qf7qjEOA/join...", "note_en": "Join this channel to support Tested and get access to perks, such as asking Adam a question: https://www.youtube.com/channel/UCiDJtJKMICpb9B1qf7qjEOA/join...", "posttime": "2020-10-16 11:02:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "讲述,savage,https", "title": "亚当·萨维奇讲述了佩戴助听器的一些现实情况", "title_en": "Adam Savage opens up about some realities of wearing hearing aids", "transed": 1, "url": "https://www.youtube.com/watch?v=AEHsxb_rSAk", "via": "", "real_tags": ["讲述", "savage", "https"]}]