[{"category": "", "categoryclass": "", "imagename": "3546993837f8c3701e81606c365c9e3e.jpeg", "infoid": 1070707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，关于吸引员工的最佳方式一直存在着无休止的争论，尤其是当公司发现招聘在大流行期间辞职或被解雇的员工变得更加困难时。上周，AnyVision 首席执行官、前谷歌产品总监兼科技投资巨头软银的运营合伙人阿维·戈兰 (Avi Golan) 大放异彩，并在 Linkedin 上发出绝望的呼吁，呼吁其他首席执行官“#stopthemadness”。 Golan 解释说，问题在于科技公司提供的工资和福利过于慷慨，他声称从长远来看会伤害员工。戈兰写道：“我正在呼吁所有以色列高科技行业的首席执行官在泡沫破裂之前停止疯狂招聘。” “新一代的年轻工程师需要适当的指导，我们需要负责向他们传授职业基础知识。我的许多 CEO 同事 [正在] 寻求或探索将开发服务外包到国外。我们正在伤害我们的年轻一代以及他们我们自己的市场和国家，因为我们不断提高工资并提供疯狂的不合逻辑的福利。”去年，有报道称该公司的人工智能被用于监视约旦河西岸的巴勒斯坦人（AnyVision 予以否认）后，微软撤回了对该公司的投资，这是总部位于以色列的 Anyvision 之前在公众眼中最大的一次亮相。 AnyVision 没有立即回应主板的评论请求。至少可以说，对 Golan 评论的反响不一。 AnyVision 最近在一轮融资中筹集了 2.35 亿美元，Golan 改变了他在网站上的简历来吹嘘。 “Avi Golan，请原谅我的提问，但你在最新一轮中学习了多少次要课程，”微软高级产品经理 Ran Moram 在 LinkedIn 上问道。 “你认为将数百万美元/谢克尔作为次要是负责任的行为并与泡沫保持一致，但向辛勤工作的员工多支付 10-20% 的钱不是吗？你的高层管理人员作为次要的钱可能是投资于增长和/或招聘优秀人才。如果你能接受，你的员工也能接受。对我来说，这似乎是双重标准。”以色列科技人力资源公司 TiSpace 的产品经理 Yanir Gold 在 LinkedIn 上写道，他发现 Golan 的文章“令人尴尬”，并希望员工辞职。 “我对所有和任何 Anyvision 员工的回应。跳船。为什么？你在他的计算器上是数字，标志很清楚。员工是坏的！糟糕的员工！你怎么敢要求中产阶级的好工资！你怎么敢！可耻在你身上！”\n在另一篇文章中，TiSpace 甚至为 Anyvision 员工提供“免费咨询”以帮助他们找到新工作，尽管似乎很少有人接受该公司的提议。正如针对 Golan 帖子的数十条评论指出的那样，当他的简历上写着“刚刚筹集了 2.35 亿美元，我们正在招聘顶尖的 AI 人才！”这里真正的疯狂之处在于科技估值被夸大了，无论 Golan 的帖子有什么意义，并不是 AnyVision 的领导层只是通过试图让不同公司的 CEO 都承诺减薪来寻找工人。", "note_en": "Over the past few months, there has been endless debate over the best way to attract workers, especially as companies are finding it harder to hire workers who quit or were laid off during the pandemic. Last week, AnyVision CEO Avi Golan, a former Google product director and operating partner at tech investing giant SoftBank, threw his hat in the ring and took to Linkedin to issue a desperate call for fellow CEOs to &#34;#stopthemadness.&#34;\n    The problem, Golan explained, was that tech companies are offering wages and benefits that were too generous and, he claimed, would hurt employees in the long run.\n  &#34;I&#39;m calling all Israeli CEOs specifically in hi-tech to stop the hiring madness before the bubble explodes,&#34; Golan wrote. &#34;This new generation of young engineers needs proper guidance, and we need to be responsible to teach them career fundamentals. Many of my CEO colleagues [are] already looking or exploring to outsource dev services abroad. We are hurting our young generation as well as our own market and country by the fact we keep raising salaries and offering crazy illogical benefits.&#34;\n  Israel-based Anyvision’s previous largest stint in the public eye came when Microsoft   pulled its investments from the company last year after reports (which AnyVision denied) that   the company’s AI was used to surveil Palestinians in the West Bank. AnyVision did not immediately respond to Motherboard’s request for comment.\n  The reception to Golan’s comments has been mixed, to say the least. AnyVision recently raised $235 million in a funding round, which Golan changed his bio on the site to brag about.\n  &#34;Avi Golan, excuse me for asking, but how much secondary did you take in your latest round,&#34;   asked Ran Moram, a senior product manager at Microsoft, on LinkedIn. &#34;Do you believe that taking millions of dollars/shekels as secondary is acting responsible and aligned with the bubble, but paying 10-20% more to your hard-working employees is not? The money your high-level management took as secondary could be invested in growth and/or for hiring great talent. If you can take it, so can your employees. Seems like double standards to me.&#34;\n  Yanir Gold, a product manager at TiSpace--an Israeli tech staffing company--  wrote on LinkedIn that he found Golan&#39;s piece &#34;embarrassing&#34; and hoped employees would quit. &#34;My response to all and any Anyvision&#39;s employees. Jump ship. Why? You are numbers in his calculator and the signs are clear. The employees are bad! bad employees! how dare you ask for good middle class wages! how dare you! Shame on you!&#34;\n  In   a separate post, TiSpace went so far as to offer Anyvision employees &#34;free consulting&#34; to help them find a new job, though it seems few have taken the company up on its offer.\n  As dozens more comments point out in response to Golan&#39;s post, his call to action to lower wages and benefits for the rank-and-file is undercut a bit when his bio reads &#34;Just raised $235M, We are hiring top AI talent!&#34;\n  The real madness here is that tech valuations are inflated, and whatever the point of Golan’s post was, it’s not that AnyVision’s leadership is just looking out for workers by trying to get CEOs at different companies to all pledge to reduce salaries.", "posttime": "2021-07-31 03:18:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ceo,员工", "title": "科技公司首席执行官表示工人获得了太多的薪酬和福利", "title_en": "Tech CEO Says Workers Get Too Much Pay and Benefits", "transed": 1, "url": "https://www.vice.com/en/article/bvz59w/tech-ceo-says-engineers-get-too-much-pay-and-benefits", "via": "", "real_tags": ["ceo", "员工"]}, {"category": "", "categoryclass": "", "imagename": "a3be473774b9d44e55bc2717f3b0ac5f.jpg", "infoid": 1070706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "澳大利亚士兵正在与新南威尔士州当地警察一起，在悉尼及其周边地区实施冠状病毒封锁，因为当局试图遏制与传染性更强的三角洲变种相关的最新病例爆发。从周一开始，大约 300 名手无寸铁的士兵将开始在悉尼（一个拥有 600 万人口的城市）巡逻。据澳大利亚广播公司 ABC 报道，他们将敲门以确保居民遵守严格的居家措施。周三，悉尼将封锁期延长了一个月——直到 8 月 28 日——因为那里的病例继续增加。 ABC 表示，尽管采取了这些措施，但悉尼所在的新南威尔士州报告了另外 170 例病例，可追溯到一名感染病毒但未能自我隔离的男子。新南威尔士州警察局长戴维·埃利奥特 (David Elliott) 告诉澳大利亚第九频道，需要军方的帮助来执行这些限制，因为少数人认为“这些规则不适用于他们”。最近几周，澳大利亚总理斯科特·莫里森 (Scott Morrison) 因澳大利亚疫苗接种速度缓慢而受到严厉批评，其中约 14% 的疫苗接种率已完全接种，这是经济合作与发展组织 (Organization for Economic Cooperation and Development) 成员国中记录最差的国家之一。周三，莫里森为他的政府对疫苗接种的处理进行了辩护，他说：“没有一个国家对大流行做出了 100% 的反应。”莫里森周五表示，希望平息公众对封锁的愤怒并阻止疫苗耐药性，一旦该国的接种率达到 70%，接种疫苗的澳大利亚人将能够避免一些封锁。他说，一旦这一比率达到 80%，就不再需要在主要城市进行广泛的封锁。\n“如果你接种了疫苗，就会有适用于你的特殊规则。为什么？因为如果你接种了疫苗，你对公共健康的风险就会较小。你感染病毒的可能性较小。你传播病毒的可能性较小，”总理告诉记者，据悉尼先驱晨报报道。", "note_en": "Australian soldiers are joining local police in New South Wales to enforce a   coronavirus lockdown in and around Sydney as authorities try to tamp down the latest outbreak of cases linked to the more infectious  delta variant.\n  Starting Monday, some 300 unarmed soldiers will begin patrols in Sydney — a city of 6 million people. They will be knocking on doors to ensure that residents are following strict stay-at-home measures, the Australian broadcaster  ABC reported.\n     On Wednesday, Sydney  extended a lockdown by a month — until Aug. 28 — as cases there continued to rise. Despite those measures, New South Wales, the state where Sydney is located, is reporting 170 additional cases traced to a man who caught the virus but failed to self-isolate, ABC said.\n     The military&#39;s help is needed to enforce the restrictions because a small minority of people thought &#34;the rules didn&#39;t apply to them,&#34; New South Wales Police Minister David Elliott told Australia&#39;s Channel Nine.\n  Australian Prime Minister Scott Morrison has come in for heavy criticism in recent weeks over the slow pace of vaccinations in Australia, where about 14% have been fully dosed — one of the poorest records among any member country of the Organization for Economic Cooperation and Development.\n  Defending his government&#39;s handling of the vaccination rollout, Morrison on Wednesday said, &#34;No country has got their pandemic response 100%.&#34;\n       Hoping to quell public anger over the lockdowns and discourage vaccine resistance, Morrison said Friday that vaccinated Australians would be able to avoid some lockdowns once the rate of inoculation in the country hit 70%. He said once that rate hits 80%, broad lockdowns in major cities would no longer be necessary.\n  &#34;If you get vaccinated, there will be special rules that apply to you. Why? Because if you&#39;re vaccinated, you present less of a public health risk. You are less likely to get the virus. You are less likely to transmit it,&#34; the prime minister told reporters, according to   The Sydney Morning Herald.", "posttime": "2021-07-31 03:17:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,军队,troops", "title": "澳大利亚军队将帮助在悉尼实施冠状病毒封锁，7 月 30 日", "title_en": "Australian Troops Will Help Enforce a Coronavirus Lockdown in Sydney, July 30", "transed": 1, "url": "https://www.npr.org/sections/coronavirus-live-updates/2021/07/30/1022685816/australia-sydney-lockdown-covid-coronavirus-troops", "via": "", "real_tags": ["病毒", "冠状病毒", "军队", "troops"]}, {"category": "", "categoryclass": "", "imagename": "b903a5e3d1be189cc013e4c71b4ba28d.png", "infoid": 1070705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用公正的、基于事实的新闻和分析来武装技术、商业和公共政策领域的决策者，以应对瞬息万变的世界。", "note_en": "Arming decision-makers in tech, business and public policy with the unbiased, fact-based news and analysis they need to navigate a world in rapid change.", "posttime": "2021-07-31 03:17:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mapbox,employees,新闻", "title": "Mapbox 员工已加入工会", "title_en": "Mapbox Employees Have Unionized", "transed": 1, "url": "https://www.protocol.com/bulletins/mapbox-employees-have-unionized-cwa-organizing-push", "via": "", "real_tags": ["mapbox", "employees", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "eceef335c104409a0fdd0ff2cc36c87f.jpg", "infoid": 1070704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "交通部长宣布，公路法规的新变化将使行人在路口和十字路口享有比汽车更高的优先权。根据现行法规，驾车者只有在行人踏上十字路口时才必须让路。新法规还将确保骑自行车的人在路口直行时享有优先权。 “道路使用者等级制度”将道路安全的责任放在更危险的交通方式上。交通部表示，这些变化以及额外的 3.38 亿英镑用于促进骑自行车和步行，将有助于维持大流行期间积极旅行的增加。交通部长格兰特沙普斯表示，骑自行车和步行有助于人们保持健康、减少交通拥堵并保护环境，因此他决心通过让人们更轻松、更安全来保持这一趋势。将于秋季公布的公路法规变更将影响英格兰、苏格兰和威尔士。北爱尔兰有自己的代码版本。\nDfT 表示，该法规的新道路使用者等级将确保“可能造成最大伤害的道路使用者”，例如汽车、货车和卡车中的人，“有最大的责任减少他们可能对他人造成的危险”。这一变化受到了倡导更适宜步行的城镇的慈善机构 Living Streets 的欢迎，该慈善机构的临时首席执行官斯蒂芬·爱德华兹说：“《公路法》目前将步行上学的儿童和卡车司机视为他们对自己的孩子负有同等责任。或其他人的安全。他说，步行的人是最不危险的道路使用者，但“往往要为其他人的行为付出代价”。他说，每个人都会受益，因为在某些情况下，每个人都是行人，即使他们开车或在其他时间循环。DfT 表示更新后的代码将加强行人在人行道上以及过马路或等待过马路时的优先权。根据现有代码，在行人移到斑马线之前，交通不必在斑马线上让路穿越。\n同时，行人被告知，在道路上的车辆停止之前，他们不应开始穿越。目前的法规还告诉驾车者在路口拐弯进入道路，“如果他们已经开始横穿”，则给行人让路。新法规还将为过往的骑自行车者提供指导、安全距离和速度，并确保骑手在直行时在交叉路口享有优先权。政府表示，额外资金将用于建设数百英里的高质量自行车道，包括改善整个国家自行车网络，并帮助实施鼓励步行的新计划。 DfT 表示，去年在英国道路上骑行的里程数增加了近 46%，达到 50 亿英里，增幅超过过去 20 年的总和。", "note_en": "New changes to the Highway Code will give pedestrians greater priority over cars at junctions and crossings, the transport secretary has announced.\n Under the current code, motorists only have to give way when pedestrians step onto a crossing.\n The new code will also ensure cyclists have priority when travelling straight ahead at junctions.\n And a &#34;hierarchy of road users&#34; puts more responsibility for road safety on more dangerous modes of transport.\n The Department of Transport said the changes, along with an extra £338 million to boost cycling and walking, will help to sustain the increase in active travel during the pandemic.\n Transport Secretary Grant Shapps said cycling and walking help people keep fit, reduce congestion and help the environment, so he was determined to keep the trend going by making them easier and safer.\n The changes to the Highway Code, due to be published in the autumn, will affect England, Scotland and Wales. Northern Ireland has its own version of the code.\n  The DfT said the code&#39;s new hierarchy of road users would ensure &#34;road users who can do the greatest harm&#34;, such as those in cars, vans and lorries, &#34;have the greatest responsibility to reduce the danger they may pose to others&#34;.\n The change was welcomed by Living Streets, a charity which advocates more walkable towns and cities,\n Stephen Edwards, the charity&#39;s interim chief executive said: &#34;The Highway Code currently treats children walking to school and lorry drivers as if they are equally responsible for their own or other people&#39;s safety.\n  He said people walking are the least dangerous road users but are &#34;often left paying the price&#34; of other people&#39;s actions.\n Everyone would benefit, he says, as everyone is a pedestrian on some occasions, even if they drive or cycle at other times.\n The DfT said the updated code would strengthen pedestrian priority on pavements and when crossing or waiting to cross the road.\n Under the existing code, traffic does not have to give way at a zebra crossing until a pedestrian has moved onto the crossing.\n At the same time, pedestrians are told they should not start to cross until the vehicles on the road have stopped.\n The current code also tells motorists turning into a road at a junction to give way to pedestrians &#34;if they have started to cross&#34;.\n  The new code will also offer guidance and safe distances and speeds for passing cyclists as well as ensuring that riders have priority at junctions when travelling straight ahead.\n The government said the additional funding will pay for hundreds of miles of high-quality cycle lanes, including improvements across the National Cycle Network, and help with new programmes to encourage walking.\n Last year the number of miles cycled on British roads rose by nearly 46% to five billion, a larger increase than in all of the previous 20 years put together, the DfT said.", "posttime": "2021-07-31 03:17:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英国,introduce,行人", "title": "英国将推出新的公路法规", "title_en": "UK to introduce new Highway Code", "transed": 1, "url": "https://www.bbc.co.uk/news/uk-58021450", "via": "", "real_tags": ["英国", "introduce", "行人"]}, {"category": "", "categoryclass": "", "imagename": "bd572d75c841d53fa985c736ec46abc2.jpg", "infoid": 1070703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯嘉丽·约翰逊昨天起诉华特迪士尼公司，声称该公司违反了她的合同，在《黑寡妇》在影院上映的同一天在 Disney+ 上发行。约翰逊在洛杉矶提交的诉状称，同步上映让迪士尼支付给约翰逊的钱更少，因为她和迪士尼旗下的漫威公司同意，她对《黑寡妇》的补偿“将主要基于影片产生的‘票房’收据”。加利福尼亚州县高级法院。这是违反合同的，因为约翰逊获得了漫威的承诺，电影最初只会在影院上映，诉讼称：为了最大限度地提高这些收入，从而保护她的经济利益，约翰逊女士从漫威那里获得了一项承诺，即上映图片的一部分将是“戏剧发行”。正如约翰逊女士、迪士尼、漫威和好莱坞的其他大多数人都知道的那样，“影院上映”是电影院独有的上映。迪士尼很清楚这一承诺，但仍然指示漫威违反其承诺，而是在电影上映的同一天在迪士尼+流媒体服务上发布该图片。造成这种情况的原因是双重的。首先，迪士尼希望将影片的观众从电影院吸引到其自有的流媒体服务，在那里它可以为自己保留收入，同时增加 Disney+ 用户群，这是提振迪士尼股价的行之有效的方法。其次，迪士尼想大幅贬低约翰逊女士的协议，从而充实自己。在这起诉讼之前的几个月里，约翰逊女士给了迪士尼和漫威一切机会来纠正他们的错误并兑现漫威的承诺。然而，与许多其他电影制片厂不同——包括华纳兄弟，根据信息和信念，在去年将这些电影“日期和日期”发布到其流媒体服务 HBO Max 后，根据信息和信念，凭借其在电影中的才华而安顿下来——迪士尼而漫威在很大程度上忽略了约翰逊女士，基本上是强迫她提起诉讼。该诉讼指控迪士尼故意干涉合同关系并诱导违约，称违约“是迪士尼指示漫威无视约翰逊女士的协议和/或否决漫威希望遵守该协议的直接结果。” Johansson 要求陪审团审判，并要求法庭提供金钱和惩罚性赔偿，金额有待审判证明。据 Screen Rant 报道，约翰逊的诉讼可能只是针对迪士尼的第一起此类诉讼，因为女演员“据报道，艾玛·斯通正在考虑就迪士尼 + 上发布的克鲁拉一事起诉迪士尼”。迪士尼通过向截止日期和其他媒体发表声明回应了这起诉讼，称：“这份文件没有任何价值。这起诉讼尤其令人悲伤和痛苦，因为它冷酷无视 COVID-19 的可怕和长期全球影响大流行。迪士尼完全遵守了约翰逊女士的合同，此外，通过 Premier Access 在 Disney+ 上发布 Black Widow 大大增强了她在迄今为止获得的 2000 万美元之外获得额外补偿的能力。”\n尽管迪士尼声称在线发行为约翰逊提供了“额外补偿”，但一位“熟悉她合同细节的人”告诉华尔街日报，迪士尼“决定将这部电影放在 Disney+ 上预计将花费约翰逊女士超过 5000 万美元.”在回应迪士尼的声明时，约翰逊的经纪人布赖恩·劳德 (Bryan Lourd) 表示，该公司“无耻地错误地指责约翰逊女士对全球 COVID 大流行不敏感，试图让她看起来是他们我知道她不是的人。 .”案例可能归结为“广泛的戏剧发行”一词是如何定义的。约翰逊引用的合同条款没有明确规定这部电影不能在网上和影院上映——它说，“如果制片人自行决定发行这部电影，那么这种发行应该是电影的广泛影院发行。图片（即不少于 1,500 个屏幕）。”约翰逊的诉讼称，普遍接受的“广泛上映”的定义意味着这部电影必须在影院独家放映三到四个月。 “约翰逊女士从漫威那里获得了一份有价值的合同承诺，即影片的发行将是&#39;广泛的影院发行&#39;，”约翰逊的诉讼称。 “双方以及迪斯尼都明白，这意味着该影片最初将只在电影院上映，并且将在大约 90 到 120 天的时间内只在电影院上映。这大约是 90 到 120 天影院‘窗口’不仅是协议敲定时的行业标准，也是迪士尼之前发行的漫威电影的标准做法，包括由约翰逊女士主演的电影。”诉讼称，约翰逊的合同给了她“一定的固定报酬”以及“与全球票房收入直接相关的递延报酬和奖金”。诉讼称，在 2019 年 11 月推出 Disney+ 之前的几个月里，“约翰逊的代表寻求保证，漫威将停止与《黑寡妇》的戏剧发行相关的交易”。漫威的首席法律顾问在 2019 年 5 月回复说：“我们完全理解斯嘉丽愿意拍这部电影和她的全部交易是基于这部电影会像我们的其他电影一样在院线广泛上映的前提下。我们理解如果计划改变，我们需要与您讨论并达成共识，因为这笔交易是基于一系列（非常大的）票房奖金。”\n该诉讼称，漫威关于《黑寡妇》上映将“与我们的其他影片一样”的声明是对“漫威/漫威漫威标准 90-120 天的影院排他性”的引用。诉状称：“在签订协议时，双方和迪士尼都非常清楚，‘影院上映’是指在大约 90 至 120 天的较长时间内在影院独家上映。”诉讼称，Marvel Studios 之前的电影“在 82 到 159 天之间有不间断的放映窗口”，而约翰逊之前的所有七部漫威电影都有至少 96 天的放映窗口。以前与约翰逊合作的漫威电影“都没有像黑寡妇那样在流媒体平台上发布‘日期和日期’；相反，就这些电影而言，漫威工作室的电影花了六到八个月的时间可以在像 Disney+ 这样的 SVOD [订阅视频点播] 服务上进行流式传输，”诉讼称。迪士尼宣布将于 2021 年 3 月同时在线和在影院上映《黑寡妇》，迪士尼+用户需一次性支付 30 美元的电影费用。它于 7 月 9 日发布。在接下来的几个月里，“约翰逊通过她的代表，试图与漫威进行谈判，以达成上述漫威首席法律顾问在这种情况下承诺的替代‘理解’，”诉讼称。 “然而，最终，Marvel 忽略了这一宣传，没有达成任何解决方案，该图片于 2021 年 7 月 9 日同时在影院和 Disney+ Premier Access 上发布。” “不出所料，迪士尼违反协议成功地将数百万粉丝从影院转移到其迪士尼+流媒体服务上，”诉讼继续说道。 “根据迪士尼自己的自我祝贺新闻稿，这部电影仅在第一个周末就在 Disney+ Premier Access 上获得了超过 6000 万美元的收入。”诉讼称，Disney+ 的发布因此“节省了 [d] Marvel（以及迪士尼）‘非常大’的钱，否则它会欠 Johansson 女士。”诉讼称，迪士尼的股价在发布后的几天内上涨了 4%，公司高管可能会直接从流媒体服务的成功中受益：\n迪士尼的财务披露清楚地表明，精心策划这一战略的迪士尼高管将个人从他们和迪士尼的不当行为中受益。 2021 财年，迪士尼首席执行​​官罗伯特·查佩克 (Robert Chapek) 获得的股权赠款总额是其 250 万美元基本工资的 3.8 倍。根据迪士尼薪酬委员会的说法（详见公司 2021 年年度报告），获得该奖项的主要理由是查佩克先生“致力于在我们的 DTC [直接面向消费者] 和线性渠道上快速规划新产品”和“在几个关键市场推出了我们直接面向消费者的服务。”查佩克先生的前任罗伯特·艾格（Robert Iger）也以股票赠款的形式获得了他的绝大多数薪酬——刚刚超过 1650 万美元。他获得巨额奖项的原因（根据同一份年度报告）是因为他“成功推出了 Disney+，并在第一年推动了前所未有的订户增长。”简而言之，迪士尼最高管理层传达的信息很明确：增加迪士尼+订阅者，不要在意你的合同承诺，你会得到回报。为了支持约翰逊关于迪士尼强迫漫威违反合同的论点，该诉讼引用了 2021 年 2 月的一篇文章，其中“综艺”报道称 [漫威影业的总裁凯文] 费奇“反对混合推出”，但“有权’来自迪士尼的消息仍然可以‘说服菲格改变主意——或者完全推翻他。’”在接下来的一个月，也就是在宣布 Disney+ 发布前不到一周，“迪士尼的查佩克先生澄清了所有剩余的疑虑，即它是迪士尼，而不是漫威发号施令，告诉彭博电视台，“我们可能会在最后一分钟就这些电影如何推向市场做出决定，无论是黑寡妇还是其他任何电影……我们将关注电话会议”诉讼称。据报道，费格对迪斯尼的决定感到“愤怒和尴尬”，因为他试图说服迪斯尼，不要在标准的影院放映窗口之后在迪斯尼+上发布《黑寡妇》。", "note_en": "Scarlett Johansson sued the Walt Disney Company yesterday, alleging that it breached her contract by releasing  Black Widow on Disney+ the same day it was released in theaters.\n The simultaneous release allowed Disney to pay Johansson less money because she and the Disney-owned Marvel agreed that her compensation for  Black Widow &#34;would be based largely on &#39;box office&#39; receipts generated by the picture,&#34; according to Johansson&#39;s  complaint filed in Los Angeles County&#39;s Superior Court for the State of California. This was a contract violation because Johansson secured a promise from Marvel that the movie would initially be released in theaters only, the lawsuit said:\n To maximize these receipts, and thereby protect her financial interests, Ms. Johansson extracted a promise from Marvel that the release of the picture would be a &#34;theatrical release.&#34; As Ms. Johansson, Disney, Marvel, and most everyone else in Hollywood knows, a &#34;theatrical release&#34; is a release that is exclusive to movie theaters. Disney was well aware of this promise, but nonetheless directed Marvel to violate its pledge and instead release the picture on the Disney+ streaming service the very same day it was released in movie theaters.\n The reasons for this were twofold. First, Disney wanted to lure the picture&#39;s audience away from movie theaters and towards its owned streaming service, where it could keep the revenues for itself while simultaneously growing the Disney+ subscriber base, a proven way to boost Disney&#39;s stock price. Second, Disney wanted to substantially devalue Ms. Johansson&#39;s agreement and thereby enrich itself. In the months leading up to this lawsuit, Ms. Johansson gave Disney and Marvel every opportunity to right their wrong and make good on Marvel&#39;s promise. Unlike numerous other movie studios, however—including Warner Brothers who, on information and belief, settled with its talent on films such as  Wonder Woman after it released those films &#34;day-and-date&#34; to its streaming service HBO Max last year—Disney and Marvel largely ignored Ms. Johansson, essentially forcing her to file this action.\n The lawsuit accuses Disney of intentional interference with contractual relations and inducing breach of contract, alleging that the contract breach &#34;was the direct result of Disney directing Marvel to ignore Ms. Johansson&#39;s agreement and/or overruling Marvel&#39;s wishes to comply with it.&#34; Johansson demanded a jury trial and asked the court for monetary and punitive damages in amounts to be proven at trial.\n Johansson&#39;s lawsuit could be just the first of its type against Disney, as actress &#34;Emma Stone is reportedly considering suing Disney over the release of  Cruella on Disney+,&#34;  according to Screen Rant.\n  Disney responded to the lawsuit with a  statement to Deadline and other media outlets, saying, &#34;There is no merit whatsoever to this filing. The lawsuit is especially sad and distressing in its callous disregard for the horrific and prolonged global effects of the COVID-19 pandemic. Disney has fully complied with Ms. Johansson&#39;s contract and furthermore, the release of  Black Widow on Disney+ with Premier Access has significantly enhanced her ability to earn additional compensation on top of the $20 million she has received to date.&#34;\n Despite Disney&#39;s claim that the online release gave Johansson &#34;additional compensation,&#34; one &#34;person familiar with details of her contract&#34;  told The Wall Street Journal that Disney&#39;s &#34;decision to put the movie on Disney+ is projected to cost Ms. Johansson more than $50 million.&#34;\n In response to Disney&#39;s statement, Johansson&#39;s agent, Bryan Lourd,  said the company &#34;shamelessly and falsely accused Ms. Johansson of being insensitive to the global COVID pandemic, in an attempt to make her appear to be someone they and I know she isn&#39;t.&#34;\n  The case may come down to how the phrase &#34;wide theatrical release&#34; is defined. The contract clause cited by Johansson doesn&#39;t explicitly state that the film could not be released online and in theaters—it says, &#34;if Producer in its sole discretion determines to release the Picture, then such release shall be a wide theatrical release of the Picture (i.e., no less than 1,500 screens).&#34;\n Johansson&#39;s lawsuit said that the commonly accepted definition of &#34;wide theatrical release&#34; means that the film was required to run exclusively in theaters for three to four months.\n &#34;Ms. Johansson obtained from Marvel a valuable contractual promise that the release of the picture would be a &#39;wide theatrical release,&#39;&#34; Johansson&#39;s lawsuit said. &#34;Both parties, as well as Disney, understood this meant that the picture would initially be released exclusively in movie theaters, and that it would remain exclusively in movie theaters for a period of between approximately 90 and 120 days. This roughly 90-120 day theatrical &#39;window&#39; was not only industry-standard at the time the agreement was finalized but also standard practice for prior Marvel movies distributed by Disney, including those starring Ms. Johansson.&#34;\n Johansson&#39;s contract gave her &#34;certain fixed compensation&#34; plus &#34;deferred compensation and bonuses directly tied to the amount of worldwide box office receipts,&#34; the lawsuit said.\n  In the months leading up to the November 2019 launch of Disney+, &#34;Johansson&#39;s representatives sought assurances that Marvel would hold up its end of the bargain with respect to the theatrical release&#34; of  Black Widow, the lawsuit said. Marvel&#39;s chief counsel replied in May 2019, &#34;We totally understand that Scarlett&#39;s willingness to do the film and her whole deal is based on the premise that the film would be widely theatrically released like our other pictures. We understand that should the plan change, we would need to discuss this with you and come to an understanding as the deal is based on a series of (very large) box office bonuses.&#34;\n Marvel&#39;s statement that the  Black Widow theatrical release would be &#34;like our other pictures&#34; is a reference to the &#34;standard Marvel/MCU 90-120 days of theatrical exclusivity,&#34; the lawsuit said.\n &#34;At the time the agreement was entered, it was well understood by the parties and Disney that a &#39;theatrical release&#39; referred to an exclusive release in theaters for an extended period of time that was roughly 90-120 days,&#34; the complaint said. Marvel Studios&#39; previous films &#34;had uninterrupted theatrical windows between 82 and 159 days,&#34; and all seven of Johansson&#39;s previous Marvel movies had theatrical windows of at least 96 days, the lawsuit said.\n None of the previous Marvel movies with Johansson &#34;included &#39;day-and-date&#39; releases on streaming platforms as would come to pass with Black Widow; rather, in connection with those films, it took six to eight months before Marvel Studios&#39; films would be available for streaming on an SVOD [subscription video-on-demand] service like Disney+,&#34; the lawsuit said.\n  Disney announced it would release  Black Widow online and in theaters simultaneously  in March 2021, with Disney+ users being charged a one-time fee of $30 for access to the film. It was  released on July 9.\n In the intervening months, &#34;Johansson, through her representatives, attempted to negotiate with Marvel to reach the aforementioned alternative &#39;understanding&#39; that Marvel&#39;s chief counsel had promised under these circumstances,&#34; the lawsuit said. &#34;Ultimately, however, Marvel ignored this outreach, no resolution was reached, and the picture was simultaneously released in theaters and on Disney+ Premier Access on July 9, 2021.&#34;\n &#34;To no one&#39;s surprise, Disney&#39;s breach of the agreement successfully pulled millions of fans away from the theaters and toward its Disney+ streaming service,&#34; the lawsuit continued. &#34;According to Disney&#39;s own self-congratulatory press releases, the picture grossed more than $60 million on Disney+ Premier Access in its first weekend alone.&#34;\n  The Disney+ release thus &#34;save[d] Marvel (and by extension, Disney) &#39;very large&#39; amounts of money that it would otherwise owe Ms. Johansson,&#34; the lawsuit said. Disney&#39;s stock price jumped 4 percent in the days after the release, and company executives are likely to benefit directly from the streaming service&#39;s success, the lawsuit said:\n Disney&#39;s financial disclosures make clear that the very Disney executives who orchestrated this strategy will personally benefit from their and Disney&#39;s misconduct. In fiscal year 2021, Disney&#39;s Chief Executive Officer, Robert Chapek, was awarded equity grants totaling 3.8 times his $2.5 million base salary. The primary justification for that award, according to Disney&#39;s compensation committee (as detailed in the company&#39;s 2021 annual report), was that Mr. Chapek &#34;worked to quickly program new offerings on our DTC [direct-to-consumer] and linear channels&#34; and &#34;launched our direct-to-consumer services in several key markets.&#34; Robert Iger, Mr. Chapek&#39;s predecessor, also received the overwhelming majority of his compensation—just over $16.5 million—in the form of stock grants. The reason for his mammoth award (according to the same annual report) was that he &#34;[s]uccessfully launched Disney+ and drove unprecedented subscriber growth in the first year.&#34; In short, the message to—and from—Disney&#39;s top management was clear: increase Disney+ subscribers, never mind your contractual promises, and you will be rewarded.\n To support Johansson&#39;s contention that Disney forced Marvel to violate her contract, the lawsuit cited a February 2021 article in which &#39;Variety reported that [Marvel Studios&#39; President Kevin] Feige &#39;was opposed to a hybrid rollout,&#39; but that &#39;the powers that be&#39; from Disney could still &#39;convince Feige to change his mind—or overrule him completely.&#39;&#34; The next month, less than a week before announcing the Disney+ release, &#34;Disney&#39;s Mr. Chapek cleared up any remaining doubt that it was Disney, not Marvel, calling the shots, telling Bloomberg Television that &#39;We&#39;ll make the call probably at the last minute in terms of how these films come to market, whether it&#39;s Black Widow or any other title... We&#39;ll be watching the call carefully and make the call when we have to,&#39;&#34; the lawsuit said.\n Feige is  reportedly &#34;angry and embarrassed&#34; about Disney&#39;s decision, as he tried to convince Disney not to release  Black Widow on Disney+ until after a standard theatrical window.", "posttime": "2021-07-31 02:36:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "迪士尼,disney", "title": "斯嘉丽约翰逊起诉迪士尼，称迪士尼+发行的《黑寡妇》违约", "title_en": "Scarlett Johansson sues Disney, says Disney+ release of Black Widow broke contract", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/07/scarlett-johansson-sues-disney-says-disney-release-of-black-widow-broke-contract/", "via": "", "real_tags": ["迪士尼", "disney"]}, {"category": "", "categoryclass": "", "imagename": "d8f2e7eb39dd38f7f389f66697afd69b.jpg", "infoid": 1070702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "维多利亚州大炮台在一份声明中说，该地点已被疏散，没有人员受伤。它补充说，该站点已与电网断开连接，电力供应不会受到影响。运营该设施的法国能源公司 Neoen 和承包商特斯拉正在与紧急服务部门合作以应对这种情况。据《悉尼先驱晨报》报道，由于火灾，附近的 Batesford、Bell Post Hill、Lovely Banks 和 Moorabool 地区已发出有毒烟雾警告。居民被警告要搬到室内，关闭窗户、通风口和壁炉烟道，并将宠物带入室内。维多利亚州大型电池厂是一个 300 MW/450 MWh 电池存储设施，被视为维多利亚州政府到 2030 年实现 50% 可再生能源目标的关键。它是继 Neoen 和特斯拉在 Hornsdale 的 100 MW/129 MWh 电池农场成功之后南澳大利亚州提前完工，为市场参与者和消费者节省了数百万美元。这两个站点本质上都在可再生能源不可用时提供区域备用电源，在没有阳光和风的情况下有效地填补了空白。今年 2 月，Neoen 宣布维多利亚时代的 Big Battery 将利用特斯拉的大型电池组（该公司的 Gigafactory 生产的实用型电池）和 Autobidder 软件向电网出售电力。 Victorian Big Battery 与澳大利亚能源市场运营商 (AEMO) 签订了合同。作为协议的一部分，该站点将通过在未来十年的澳大利亚夏季释放现有的维多利亚至新南威尔士互连器的额外 250 MW 峰值容量来提供能源稳定性。", "note_en": "The site was evacuated and there were no injuries, Victorian Big Battery said in a statement. It added that the site had been disconnected from the power grid and that there will be no impact to the electric supply. French energy company Neoen, which operates the facility, and contractor Tesla are working with emergency services to manage the situation.\n As a result of the fire, a warning for toxic smoke has been issued in the nearby Batesford, Bell Post Hill, Lovely Banks and Moorabool areas, reports   The Sydney Morning Herald. Residents were warned to move indoors, close windows, vents and fireplace flues and bring their pets inside.\n  The Victorian Big Battery site, a 300 MW/450 MWh battery storage facility, is viewed as key to the Victorian government’s 50 percent renewable energy target by 2030. It follows the success of Neoen and Tesla’s 100 MW/129 MWh battery farm in Hornsdale in South Australia, which was completed ahead of  schedule and has resulted in  multi-million dollar savings for market players and consumers. Both sites essentially provide a regional power backup for when renewable energy is not available, effectively filling the gap when the sun isn’t shining and the wind isn’t blowing.\n In February, Neoen announced that the Victorian Big Battery would utliize Tesla’s megapacks — utility-sized batteries produced at the company’s Gigafactory — and Autobidder software to sell power to the grid. Victorian Big Battery has a contract with the Australian Energy Market Operator (AEMO). As part of the pact, the site will provide energy stability by unlocking an additional 250 MW of peak capacity on the existing Victoria to New South Wales Interconnector over the next decade of Australian summers.", "posttime": "2021-07-31 02:35:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,澳大利亚,megapack,能源", "title": "一辆特斯拉 Megapack 在澳大利亚维多利亚州的大型电池工厂起火", "title_en": "\n\t\t\t\tA Tesla Megapack caught fire at the Victorian Big Battery facility in Australia\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/a-tesla-megapack-caught-fire-at-the-victorian-big-battery-facility-in-australia/", "via": "", "real_tags": ["特斯拉", "澳大利亚", "megapack", "能源"]}, {"category": "", "categoryclass": "", "imagename": "c0fdddf181637cf20ae62ba952251006.jpg", "infoid": 1070700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您从 Verge 链接购买东西，Vox Media 可能会获得佣金。请参阅我们的道德声明。根据即将出版的一本关于特斯拉的书，据报道，特斯拉首席执行官埃隆马斯克在 2016 年与现任苹果首席执行官蒂姆库克的电话中要求成为苹果的首席执行官。洛杉矶时报分享的这个故事来自华尔街日报记者蒂姆希金斯的《权力游戏：特斯拉、埃隆马斯克和世纪赌注》。正如书中所说，库克向马斯克建议苹果收购特斯拉，马斯克说他想成为首席执行官。据报道，库克同意了，但马斯克澄清说他想成为苹果的首席执行官。 “据一位听到（马斯克）重述这次交流的前助手说，”库克在挂断电话前说“操你”。但马斯克和苹果都表示，这次谈话不可能发生，因为马斯克和库克从未说过话。马斯克在周五的一条推文中直言不讳地说：“库克和我从来没有说过话或写过信。”他还表示，他曾试图与库克会面，讨论苹果收购特斯拉的问题，但库克拒绝了。 （马斯克之前曾在 12 月讨论过这次尝试性会面。）库克和我从来没有说过话或写过信。有一次我要求与库克会面，讨论苹果收购特斯拉的问题。概无提出任何收购条件。他拒绝见面。特斯拉的价值约为今天价值的 6%。 — 埃隆·马斯克 (@elonmusk) 2021 年 7 月 30 日\n当被问及对所报道的谈话发表评论时，苹果指出库克在接受纽约时报的卡拉斯威舍采访时发表的言论，他否认曾与埃隆交谈过。 “你知道，我从来没有和埃隆说过话，尽管我对他建立的公司非常钦佩和尊重，”库克说。马斯克还声称这本书的大部分内容都是假的。 “希金斯设法让他的书既虚假又无聊，”马斯克在周五的一条推文中说：马斯克显然试图在写这本书时泼冷水，他告诉希金斯这本书的大部分内容都是“胡说八道” ，”据《洛杉矶时报》报道。马斯克显然没有参与《Power Play》的创作。在最后的作者笔记中，希金斯写道，马斯克“有很多机会对这些页面中呈现的故事、事实和特征进行评论。他没有指出任何具体的错误，只是简单地说：“你在这本书中读到的大部分，但不是全部，都是胡说八道。””希金斯说，马斯克有“很多机会”发表评论，谈话的故事据当时听到复述的人说，与库克的谈话“来自马斯克自己对谈话的描述。”在早些时候的一条推文中，他还将马斯克和库克谈话的故事描述为“在特斯拉与 Model X 斗争时被告知”。马斯克有很多机会对此发表评论。他没有。据当时听到复述的人说，这则轶事来自马斯克自己对谈话的描述。 https://t.co/GRKZRBsaeR — 蒂姆·希金斯 (@timkhiggins) 2021 年 7 月 30 日\n正如 POWER PLAY 中所详述的那样，据听过它的人说，这是特斯拉在公司内部与 Model X 斗争时讲述的一个故事，有些人希望白衣骑士能够挽救这一天。马斯克的信息很明确：特斯拉的命运掌握在自己手中。 https://t.co/4e0KJb3CD2 — Tim Higgins (@timkhiggins) 2021 年 7 月 30 日 他还说，苹果“有几次机会在发表之前发表评论，但遭到拒绝。”希金斯和该书出版商的代表尚未回复置评请求。在发推说他从未见过库克后不久，马斯克发推文支持 Epic 与苹果公司的斗争及其在 App Store 上的规则。 “苹果应用商店的费用实际上是对互联网征收的全球税，”马斯克说。 “史诗是对的。”", "note_en": "If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n Tesla CEO Elon Musk reportedly demanded to become Apple’s CEO in a 2016 phone call with current Apple CEO Tim Cook, according to an upcoming book about Tesla. The story, shared by  the  Los Angeles Times, comes from   Power Play: Tesla, Elon Musk, and the Bet of the Century by  The Wall Street Journal reporter Tim Higgins.\n As the book tells it, Cook suggested to Musk that Apple acquire Tesla, and Musk said he wanted to be CEO. Cook reportedly agreed, but Musk clarified that he wanted to be the CEO of Apple. “According to a former aide who heard (Musk’s) retelling of the exchange,” Cook said “Fuck you” before hanging up the phone.\n But Musk and Apple have both suggested that the conversation couldn’t have happened because Musk and Cook have never spoken.\n Musk, in a tweet on Friday,  flat out said that “Cook &amp; I have never spoken or written to each other ever.” He also said that he attempted to meet with Cook about Apple acquiring Tesla, a meeting that Cook refused. (Musk previously discussed  this attempted meeting in December.)\n Cook &amp; I have never spoken or written to each other ever.   There was a point where I requested to meet with Cook to talk about Apple buying Tesla. There were no conditions of acquisition proposed whatsoever.   He refused to meet. Tesla was worth about 6% of today’s value.\n— Elon Musk (@elonmusk)  July 30, 2021\n When asked for comment about the reported conversation, Apple pointed to remarks Cook made during an interview with  The New York Times’ Kara Swisher where he denied having ever spoken to Elon. “You know, I’ve never spoken to Elon, although I have great admiration and respect for the company he’s built,”  Cook said.\n Musk also claims that much of the book is false. “Higgins managed to make his book both false *and* boring,”  Musk said in a tweet on Friday:\n  And Musk apparently tried to dash cold water on the book while it was being written, telling Higgins that much of the book was “nonsense,” according to the  Los Angeles Times.\n Musk apparently did not participate in the creation of “Power Play.” In an author’s note at the end, Higgins writes that Musk “was given numerous opportunities to comment on the stories, facts, and characterizations presented in these pages. Without pointing to any specific inaccuracies, he offered simply this: ‘Most, but not all, of what you read in this book is nonsense.’”\n Higgins says that Musk had “plenty of opportunities” to comment and that the story of the conversation with Cook “comes from Musk’s own account of the conversation, according to people who heard the retelling at the time.” In an earlier tweet, he also characterized the story of Musk and Cook’s conversation  as one that was “told inside Tesla as the company struggled with the Model X.”\n Musk was given plenty of opportunities to comment on this. He didn’t. This anecdote comes from Musk’s own account of the conversation, according to people who heard the retelling at the time.  https://t.co/GRKZRBsaeR\n— Tim Higgins (@timkhiggins)  July 30, 2021\n As detailed in POWER PLAY, this is a story that was told inside Tesla as the company struggled with the Model X, according to people who heard it, and as some hoped for a white knight to save the day. Musk’s message was clear: Tesla’s fate was in their own hands.  https://t.co/4e0KJb3CD2\n— Tim Higgins (@timkhiggins)  July 30, 2021\n He also says that Apple “was given several opportunities to comment prior publication and declined.”\n Higgins and a representative for the book’s publisher have not replied to a request for comment.\n Shortly after tweeting that he has never met Cook, Musk tweeted in support of  Epic’s fight against Apple and its rules on the App Store. “Apple app store fees are a de facto global tax on the Internet,”  Musk said. “Epic is right.”", "posttime": "2021-07-31 02:26:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,库克,苹果,马斯克,musk", "title": "埃隆马斯克和苹果否认他试图取代蒂姆库克的疯狂故事", "title_en": "Elon Musk and Apple Deny Wild Story That He Tried To Replace Tim Cook", "transed": 1, "url": "https://www.theverge.com/2021/7/30/22602017/elon-musk-tim-cook-apple-ceo-demand-tesla-acquisition", "via": "", "real_tags": ["apple", "库克", "苹果", "马斯克", "musk"]}, {"category": "", "categoryclass": "", "imagename": "5f5f74ccf1087d5bdb6db9b54bce2926.jpg", "infoid": 1070699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从 MTV 于 1981 年 8 月 1 日开播的那一刻起，它就必然会触动父母和道德斗士的神经。在播出的第一个十年中，包括麦当娜和乔治迈克尔在内的流行歌星的挑衅视频和表演引起了人们的注意并引发了争议。虽然现在有线电视频道转型的娱乐品牌已经不再是音乐视频的发源地，但它对电视领域的贡献超越了音乐和真人秀。到 1990 年代，该网络最大的明星还包括其常驻的一对动画指关节：Beavis 和 Butt-Head。这部关于脑死亡青少年和他们青春期奇思妙想的节目于 1993 年在 MTV 上首次亮相，从粗暴的动画风格到明星的冲动行为，很快就受到了抨击。评论家称这对二人组“粗鲁”、“丑陋”和“自毁”。克里斯布朗于 1994 年成为 Beavis 和 Butt-Head 的首席编剧。他说当他被分配到他的第一集时，他向自己的父亲描述这个节目是“关于这两个非常愚蠢的 13 岁的孩子，他们只是自我毁灭。他们真的很喜欢重金属，我的意思是我不认为它真的适合你，但我真的很兴奋。”他的父亲停顿了一下，正如布朗回忆的那样，他说：“好吧，你打算为别的东西写作吗？”但该节目是批评证明。 Beavis and Butt-Head 一度成为 MTV 收视率最高的节目，并扩展为 1996 年的故事片 - Beavis and Butt-Head Do America。这部电影得到了评论家 Gene Siskel 和 Roger Ebert 的两个赞，并有多个客串，其中一个来自超级粉丝大卫莱特曼，他是一个最肯定是屁股头的人。 Beavis 和 Butt-Head 可能是一部卡通片，但它也是 MTV 身份的核心。事实证明，动画已经融入了该网络的基础，帮助开发 MTV 最初品牌活动的 Fred Seibert 说。 “我们有点意识到，在很多方面，像 Looney Tunes 这样的卡通片，有点像摇滚乐的孩子，”Seibert 解释说。\n对于当时想要在电视惯例之外工作的动画师来说，MTV 成为了目的地和实验室。加州艺术学院动画历史学家莫琳·弗尼斯 (Maureen Furniss) 表示，“[MTV] 向人们展示了他们以前在动画中从未见过的公共事物，并为许多独立动画师和实验动画师提供了机会。”其中最重要的实验之一是作为电台宣传 ID 的短裤：例如，MTV 标志的“M”变形为各种形式。 Abby Terkuhle 说，MTV 的营销团队给予这些宣传片创作者的自由有助于成为该网络如何处理其较长动画节目的原型。他成为了该网络广播宣传的负责人——并最终监督了 MTV 动画。 “MTV 动画确实是 MTV 播出推广的产物和延伸，MTV 播出推广令人难以置信。它是一个创意实验室，”特库勒说。 “我们不仅被允许冒险，而且被鼓励冒险，高管们支持我们。”这种敢于冒险的创意实验室的精神吸引了节目创作者来推销和推动不会在其他地方出现在电视上的想法。 MTV 的第一个完整动画节目 Liquid 电视于 1991 年首播，是各种动画的自由流动展示。它包括 Beavis 和 Butt-Head 在短片“青蛙棒球”中的首次亮相——当时是动画节的最爱——以及对现有电视类型的模仿，如游戏节目和肥皂剧。 Liquid TV 还包括大胆的叙事性实验——并介绍了 Aeon Flux 的视觉奢华世界——一位后来成为邪教偶像的间谍。\n为 MTV 开发 Aeon Flux 的 Peter Chung 说：“它必须是你在其他任何地方都看不到的东西。所以这真的鼓励我制作一些充满暗示的东西，使它成为一个重点尽我所能地越界和引人注目。”从 1990 年代中期到 2000 年代初，MTV 还经营着自己的动画工作室，制作了多个系列——包括为观众带来另一个标志性角色的 Beavis 和 Butt-Head 衍生剧。达里亚 (Daria) 于 1997 年首播，是一部不怕咬住它的手的节目。它尖锐的主角经常追求青少年生活的肤浅和商品化——这是 MTV 长期以来一直被指责的一种趋势。但该节目也可以提供令人心酸的成年时刻。 “我们只是采用了每部关于青少年的节目所涵盖的典型故事，但因为它来自 Daria 的眼睛，所以它以完全不同的语气结束，这是一种有趣而冷漠的幽默，”Daria 合作者说。创作者苏西刘易斯。 MTV 动画不仅仅是手绘图像。该网络还制作了一个名为 Celebrity Deathmatch 的热门粘土动画系列，其中名人的模型在摔跤场上互相厮杀，然后战斗到死。试播集与 1998 年超级碗中场秀同时播出。近年来，MTV 在动画方面的记录并不相同。其他网络和流媒体服务已经成为面向老年观众的更大胆的卡通片的发源地。但是 MTV Entertainment 总裁 Chris McCarthy 说你现在不应该把 MTV 算在内。麦卡锡说 MTV 正在开发新的动画创意以及重新启动一些旧的最爱。\n回归的节目包括 Beavis 和 Butt-Head（其第二次重新启动记录）以及一系列将 Daria 角色 Jodie 重新想象为进入劳动力市场的 Z 代大学毕业生。 “我们认为动画及其重生只是这一遗产下一个伟大篇章的开始，”麦卡锡说。这个故事的先前版本拼错了将要衍生的 Daria 角色的名字。她的名字是乔迪，不是乔迪。", "note_en": "From the moment MTV launched on Aug. 1, 1981, it was bound to rattle the nerves of parents and moral crusaders. In its first decade on air, provocative videos and performances from pop stars including Madonna and George Michael invited attention and ignited controversy.\n  Though it&#39;s fairly established by now that the cable channel-turned-entertainment brand stopped being the home of music videos some time ago, its contribution to the television landscape transcends music and reality TV. By the 1990s, the network&#39;s biggest stars also included its resident pair of animated knuckleheads: Beavis and Butt-Head.\n    The show about brain dead teens and their pubescent whims debuted on MTV in 1993 and was quick to catch flack for everything from its rougher animation style to the impulsive actions of its stars. Critics called the duo  &#34;crude,&#34; &#34;ugly&#34; and &#34;self-destructive.&#34;\n     Kris Brown became the head writer of  Beavis and Butt-Head in 1994. He says when he was assigned his first episode, he described the show to his own father as being &#34;about these two 13-year-olds that are really stupid and they&#39;re just self-destructive. They&#39;re really into heavy metal, and I mean I don&#39;t think it&#39;s for you really, but I&#39;m really excited about it.&#34; His dad paused and, as Brown recalls, said, &#34;Well, do you plan on writing for anything else?&#34;\n    But the show was critic-proof.  Beavis and Butt-Head became MTV&#39;s highest rated show at one time and expanded into a 1996 feature film –  Beavis and Butt-Head Do America. The movie got two thumbs up from critics Gene Siskel and Roger Ebert and featured multiple cameos, including one from super-fan David Letterman as a roadie who most certainly sired Butt-Head.\n      Beavis and Butt-Head may have been a cartoon, but it was also central to MTV&#39;s identity. Animation, it turns out, was baked into the network&#39;s foundation, says Fred Seibert, who helped develop MTV&#39;s initial branding campaigns.\n  &#34;We kind of realized that in many ways cartoons, like  Looney Tunes, were kind of like the kid equivalent of rock &#39;n&#39; roll,&#34; Seibert explains.\n  For animators who wanted to work outside of TV conventions at the time, MTV became a destination and a laboratory. According to Maureen Furniss, who is an animation historian at the California Institute of the Arts, &#34;[MTV] showed people in the public things they had never seen before in animation and gave opportunities to a lot of independent animators and experimental animators.&#34;\n  One of the most important of those experiments were shorts that served as the station&#39;s promotional IDs: the &#34;M&#34; of the MTV logo morphing into various forms, for example.\n        The freedom given to the creators of these promos by MTV&#39;s marketing teams helped serve as a prototype for how the network approached its longer animated shows, says Abby Terkuhle. He became head of the network&#39;s on-air promotions — and eventually oversaw MTV animation.\n  &#34;MTV animation was truly an outgrowth and extension of MTV on-air promotion and MTV on-air promotion was incredible. It was a creative laboratory, &#34; Terkuhle says. &#34;We were not only allowed to take risks, but encouraged to take risks and the executives had our back.&#34;\n    That ethos of a creative laboratory that took risks drew show creators to pitch and push for ideas that wouldn&#39;t end up elsewhere on television.\n  MTV&#39;s first full animated program  Liquid Television premiered in 1991 and was a free-flowing showcase of all kinds of animation. It included the cable debut of  Beavis and Butt-Head in the short &#34; Frog Baseball&#34; – an animation festival favorite at the time — as well as parodies of existing TV genres such as game shows and soap operas.\n    Liquid Television also included bold experiments in narrative storytelling — and introduced the visually sumptuous world of  Aeon Flux — a spy who has since become a cult icon.\n    Peter Chung, who developed  Aeon Flux for MTV, says, &#34;It had to be something you could not see anywhere else. And so that really encouraged me to make something that was as loaded with as much innuendo, making it a point to make it as transgressive and as eye-catching as I could make it.&#34;\n    From the the mid-1990s to the early 2000s, MTV also ran its own animation studio which produced multiple series — including a  Beavis and Butt-Head spinoff that gave audiences another iconic character.\n  Daria premiered in 1997 and was a show unafraid to bite the hand that feeds it. Its incisive main character regularly went after the superficialities and commodification of teen life — a tendency MTV itself has long been accused of. But the show could also offer poignant coming-of-age moments.\n    &#34;We kind of just went with the typical stories that every show about teenagers covers, but because it was from the eyes of Daria, it ended up with a completely different tone, which was funny and deadpan kind of humor,&#34; says  Daria co-creator Susie Lewis.\n    MTV animation wasn&#39;t only hand-drawn images. The network also produced a hit claymation series called  Celebrity Deathmatch in which mock-ups of celebrities took each other on in the wrestling ring and fought, well, to the death. The pilot episode aired at the same time as the Super Bowl halftime show in 1998.\n  In recent years, MTV hasn&#39;t had the same track record in animation. Other networks and streaming services have become home to even bolder cartoons intended for older audiences.\n  But MTV Entertainment president Chris McCarthy says you shouldn&#39;t count MTV out just yet. McCarthy says MTV is developing new animated ideas as well as rebooting a few old favorites.\n    Among the shows coming back are  Beavis and Butt-Head (its second reboot for the record) as well as a series reimagining  Daria character Jodie as a Gen Z college grad entering the workforce.\n  &#34;We think the animation and its rebirth is just the beginning of a next great chapter of this legacy,&#34; says McCarthy.\n A previous version of this story misspelled the name of the Daria character who will be in spinoff. Her name is Jodie, not Jody.", "posttime": "2021-07-31 02:25:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "butt,mtv", "title": "Beavis、Butt-Head 和 Daria 如何破坏电缆", "title_en": "How Beavis, Butt-Head and Daria disrupted cable", "transed": 1, "url": "https://www.npr.org/2021/07/30/1022642071/mtv-beavis-butthead-daria-aeon-flux-liquid-television", "via": "", "real_tags": ["butt", "mtv"]}, {"category": "", "categoryclass": "", "imagename": "a214929e027e59473434df4bfc208720.jpg", "infoid": 1070698, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十多年前的一个没有月亮的夜晚，瑞典隆德大学的动物视觉专家 Marie Dacke 和 Eric Warrant 在南非有了一个惊人的发现。研究人员一直在观察夜间活动的蜣螂，热带稀树草原的微型西西弗斯，因为它们翻滚着巨大的粪球。甲虫似乎能够非常直地滚动，即使它们没有明确的地标可供参考。 “我们认为他们可能在使用我们的相机，也许有人在某处生火了，”达克博士说。 “我们真的很困惑。”然后他们意识到甲虫是由银河系 100,000 光年长的条纹引导的。我们人类以这种事情而闻名。星星召唤我们的物种横渡海洋，点燃了科学，后来让我们用火箭推向它们。从文化到文化，银河系为有关河流、树木、神灵、蛇，当然还有探索的故事提供了背景和灵感。像 Dacke 博士这样的研究人员怀疑，大片的动物世界有时可能会借助星光导航——并且可能会随着我们的城市灯光被越来越多的星光淹没而消失。她的团队于周四发表的最新研究发现，蜣螂在光线充足的天空下变得混乱。这一结果增加了几十年来进行的一小部分分散的研究，研究夜空对其他能感觉到它的地球人意味着什么。这些实验提出了同样的几个难题：动物能看到星星吗？动物可以使用它们吗？当他们失去它们时会发生什么？在 1780 年代，天文学家威廉和卡罗琳赫歇尔在天空中搜寻星云，发现了一些类似于螺旋贝壳的星云。 1920 年代，埃德温·哈勃 (Edwin Hubble) 掌管着一架巨大的望远镜，他发现银河系、仙女座和赫歇尔旋涡是浩瀚宇宙海洋中的星系岛屿。\n在 2000 年代中期，德国科隆的研究员尼克游到他自己的望远镜前，一屁股坐在水下椅子上。然后他把头伸进管子里，如果他看到一颗星星，就按下一个桨。他得到了鱼的奖励。当现任罗斯托克大学海洋生物学家吉多·德恩哈特 (Guido Dehnhardt) 正在研究海洋哺乳动物如何定位自己时，斑海豹尼克进入了天文学史册。如果海豹能够辨别星星，Dehnhardt 博士和他的同事 Björn Mauck 假设，这可能有助于解释这些动物如何能够在没有特征的海洋中完成长时间的游泳。为了测试海豹的天文技能，莫克博士设计了两个科学史上最睁大眼睛、充满奇迹的实验。首先，该团队构建了他们的密封镜 - 一个没有镜头的管子，尼克可以通过它参观夜空。当金星、天狼星和北极星等亮点出现时，他一直按着桨；研究人员确定，他无法像人类一样看到尽可能多的微弱恒星，但他仍然可以使用大量可能的天体地标。接下来，莫克博士建造了更大的东西。这次邀请了两只海豹参加，尼克和他更聪明的兄弟马尔特。当被带回科隆动物园的游泳池时，海豹进入了一个 15 英尺宽的圆顶，它的边缘搁在一个浮环上。这个定制的水族天文馆的内部被 6,000 颗模拟恒星点亮。 “他们立即游过天文馆，看着星星，就像，&#39;哦，那是什么？&#39;”德恩哈特博士说。 “你的印象是他们真的认出了这是什么。”首先，研究人员使用激光指示器将海豹引导到圆顶边缘与离天狼星最近的水相遇的地方，狗之星。如果一只海豹游过来并用它的鼻子接触到圆顶的那个精确部分，它就会得到一些鱼。然后指针直接对准了天狼星。同样，海豹的任务是游向这颗恒星并接触它正下方的边缘点。\n然后研究人员放弃了激光笔。无论星体投射器朝向哪个方向，两只海豹最终都可以朝天狼星的方向游动。研究人员在 2008 年的一篇论文中指出，这表明穿越公海的海豹有能力使用北极星来引导它们的旅行。经验更丰富的天文学家尼克花了 11 次训练才可靠地接触到天狼星正下方的墙壁。但是马尔特在他们第一次把他一个人留在天文馆时就做到了。 “马耳他绝对是一只出色的海豹，”德恩哈特博士说。虽然海豹可能会受星辰支配，但有些鸟类确实如此，正如斯蒂芬·T·埃姆伦 (Stephen T. Emlen) 启发的半个多世纪的实验所证明的那样。 1960 年代初期，时任密歇根大学研究生、现为康奈尔大学名誉教授的埃姆伦博士开始在晚上将靛蓝彩旗带入天文馆。 “我自己也是夜行动物，”他最近说。靛蓝彩旗在夜间迁徙，飞行距离可达 2,000 英里。在他们开始之前，他们会朝着他们计划去的方向跳，让导航研究人员清楚他们的意图。埃姆伦博士表明，如果靛蓝彩旗暴露在星空下，鸟儿会以一种方式跳跃，表明它们知道朝北的方向。人类观察者知道，在夜间，随着地球绕地轴自转，星星在天空中盘旋。这些圈子缩小了更多的北极星——而最北端的北极星似乎根本没有绕圈。一旦你知道了这一点，你只需要记住北方附近的一个星座——北斗七星运作良好——就可以确定方向。 Emlen 博士想知道彩旗是否采用了类似的技巧。如果他把北极星藏在天文馆里，他们还能找到北方吗？他们确实可以，他发现。如果他只涂掉北斗七星，或者只涂掉仙后座呢？现在鸟类的表现各不相同。如果他把最北端的所有星座都抹掉？鸟儿丢了。\n后来埃姆伦博士招募了刚刚离开巢穴的年轻靛蓝彩旗。整个夏天，他调整了天文馆的投影仪，让天空围绕着猎户座肩部的红巨星参宿四而不是北极星旋转。果然，到了秋天，彩旗用它们的啤酒花表示他们认为参宿四引导了北方的道路。 Emlen 博士和他的同事认为，这表明这只鸟的观星技能是习得的，而不是源自它们基因中编码的某些星图。在闪闪发光的黑暗中，每只年轻的彩旗显然都花了一些时间仰望、学习，因为星星在夜空中盘旋。大约在尼克和马尔特学会发现天狼星的时候，达克博士和沃兰特博士在南非与蜣螂一起度过了他们的发现时刻。一只蜣螂爬到粪堆上后，会煞费苦心地把比自己大的粪雪球拼凑起来。然后它爬上球并旋转，扫描，好像破译天体。通过蜣螂的复眼，星星看起来像斑点，而不是光点。但同样的眼睛对暗淡的物体（如银河系斑驳的图案）比我们的眼睛更敏感。在它的旋转扫描之后，一只甲虫将它的球沿着一条直线滚离粪堆几分钟，随机航向。 （这似乎最大限度地减少了两只甲虫相遇的可能性，这通常会导致打架。）Dacke 博士发现，通过确认甲虫前往的银河系内场景仍然与早期的参考图像相匹配，它们似乎可以保持直线滚动.但是当 Dacke 博士的团队继续研究这种行为时发生了一件有趣的事情：他们越来越难以在天空中定位银河系。 “我最终花了一个晚上骑自行车进入森林，”詹姆斯福斯特说，他作为研究生加入该项目，现在是德国维尔茨堡大学动物学博士后。\n这是一种常见的体验； 2016 年的一项研究显示，大约五分之四的美国人、三分之二的欧洲人以及世界上三分之一的人居住的地方晚上太亮，银河无法看到每年都更大。 Dacke 博士和 Foster 博士决定测试被冲刷的天空是否对他们的研究对象也很重要。在周四发表在 Current Biology 上的最新实验中，他们将聚光灯照射在甲虫上，并将它们带到位于约翰内斯堡市中心的金山大学生物大楼的屋顶。他们发现了两种效果，但都不是很好。当甲虫的天空被一束耀眼的光所支配时，它仍然可以直行——但它不是向随机方向滚落，而是直奔信标。更令人困惑的是你在郊区可能会期待的毫无特色、光线充足的天空：甲虫只是绕着圈子转。其他物种可能会受到类似的影响。恒星或多或少一直是恒定的，而地标会被侵蚀，行星的磁场也会发生变化。但是现在，它们突然消失了。 “我们在小得多的范围内看到的蜣螂可能对鸟类、海豹和飞蛾产生巨大影响，”福斯特博士说。随着他们的研究结束，科学界的先驱动物天文学家走向了不同的命运。一些南非蜣螂现在住在隆德的实验室里，研究人员有时会在完全模拟的天空下研究它们。埃姆伦博士在他的实验室里保存着参宿四迷惑的靛蓝彩旗整个冬天，并在春天释放它们。他说，希望他们在开始第一次迁移之前重新校准到真正的北方。海豹尼克仍然是声学、流体动力学和光学等领域的积极贡献者，尽管马尔特几年前去世了。尼克现在住在一个通向波罗的海的庞大港口实验室里。 Dehnhardt 博士说，到了晚上，他和围栏里的其他海豹可以看到头顶上的梦幻般的天空。\n“但他们是否使用它，”他说，“我不知道。”", "note_en": "One moonless night a little more than a decade ago, Marie Dacke and Eric Warrant, animal vision experts from Lund University in Sweden, made a surprise discovery in South Africa.\n The researchers had been watching nocturnal dung beetles, miniature Sisyphuses of the savanna, as they tumbled giant balls of dung. The beetles seemed to be able to roll remarkably straight, even though they had no clear landmarks to reference.\n “We thought maybe they were using our cameras, maybe someone had lit a fire somewhere,” Dr. Dacke said. “We were really confused.” Then they realized the beetles were guided  by the 100,000 light-years-long streak of the Milky Way.\n We humans are famous for this sort of thing. The stars beckoned our species to cross seas and kindled the sciences that later let us putter up toward them in rockets. From culture to culture, the Milky Way served as backdrop and inspiration for stories about rivers, trees, gods, serpents and, of course, exploration.\n Researchers like Dr. Dacke suspect that a wide swath of the animal world might sometimes navigate by starlight — and might be lost as our city lights drown out ever more of it.  Her team’s newest study, published Thursday, found that dung beetles became confused under light-swamped skies. The result adds to a small and scattered body of research, conducted over decades, on what the night sky might mean to the other earthlings who can sense it.\n These experiments raise the same few, difficult questions: Can animals see the stars? Can animals use them? And what happens when they lose them?\n  In the 1780s, the astronomers William and Caroline Herschel scoured the skies for nebulae, finding some that resembled spiral seashells. In the 1920s, Edwin Hubble, at the helm of an enormous telescope, discovered that the Milky Way, Andromeda and Herschel spirals were galactic islands in a vast cosmic sea.\n And in the mid-2000s, Nick, a researcher of sorts in Cologne, Germany, swam to his own telescope and plopped into an underwater chair. Then he stuck his head in a tube and, if he saw a star, pressed a paddle. He was rewarded with fish.\n Nick, a harbor seal, entered the annals of astronomical history when Guido Dehnhardt, a marine biologist now at the University of Rostock, was studying how marine mammals orient themselves. If seals could discern stars, Dr. Dehnhardt and his colleague Björn Mauck hypothesized, that might help explain how the animals are able to complete long swims across otherwise featureless seas.\n To test a seal’s astronomical skills, Dr. Mauck devised what must be two of scientific history’s most wide-eyed, wonder-infused experiments.\n First the team constructed their seal-o-scope — a tube with no lens, through which Nick was given a tour of the night sky. He consistently pressed his paddle when bright points like Venus, Sirius and Polaris came into view; he could not see as many faint stars as humans can,  the researchers determined, but plenty of possible celestial landmarks were still available to him.\n Next Dr. Mauck built something even bigger. This time two seals were invited to participate, Nick and his even cleverer brother, Malte.\n When ushered back into the pool at a Cologne zoo, the seals entered a dome measuring 15 feet across, its rim resting on a floating ring. The insides of this bespoke aqua-planetarium were lit up with 6,000 simulated stars. “They were immediately swimming across the planetarium and looking at stars like, ‘Oh, what’s that?’” Dr. Dehnhardt said. “You got the impression that they really recognized what this is.”\n First the researchers used a laser pointer to direct the seals to where the rim of the dome met the water nearest to Sirius, the Dog Star. If a seal swam over and touched that precise part of the dome with its snout, it received some fish. Then the pointer was aimed directly at Sirius. Again the seal’s task was to swim toward the star and touch the point on the rim directly beneath it.\n Then the researchers dispensed with the laser pointer. No matter which way the star-projector was oriented, both seals could eventually swim in the direction of Sirius. That showed, the researchers  argued in a 2008 paper, that seals traversing the open sea had the capacity to use lodestars to guide their travels.\n It had taken Nick, the more seasoned astronomer, 11 sessions to reliably touch the wall right under Sirius. But Malte did it the very first time they left him alone in the planetarium. “Malte was an absolutely brilliant seal,” Dr. Dehnhardt said.\n  While seals might  steer by the stars, some birds definitely do, as more than a half-century of experiments inspired by Stephen T. Emlen have demonstrated.\n In the early 1960s, Dr. Emlen, then a graduate student at the University of Michigan and now an emeritus professor at Cornell, began carrying indigo buntings into a planetarium in the evenings. “I was nocturnal myself,” he said recently.\n Indigo buntings migrate at night, flying as far as 2,000 miles. Before they start out, they hop in the direction they plan to go, making their intent apparent to a navigation researcher.  Dr. Emlen showed that if indigo buntings were exposed to the stars, the birds hopped in a manner indicating that they knew which way was north.\n Human observers know that at night the stars trace circles in the sky as Earth spins on its axis. Those circles shrink for more northern stars — and the northernmost, Polaris, doesn’t seem to circle at all. Once you’ve learned that, you need only to remember a constellation in the vicinity of north — the Big Dipper works well — to get oriented.\n Dr. Emlen wondered whether buntings employed a similar trick. If he covered up Polaris in the planetarium, could they still find north? Indeed they could, he discovered. What if he blotted out just the Big Dipper, or just Cassiopeia? Now the birds’ performance varied. And if he erased all the northernmost constellations together? The birds were lost.\n Later Dr. Emlen enlisted young indigo buntings that had just left their nests. Over the summer he tweaked the planetarium projector so that the sky rotated around Betelgeuse, the red giant star at Orion’s shoulder, rather than Polaris.\n Sure enough, come autumn, the buntings indicated with their hops that they thought Betelgeuse guided the way north. This suggested that the bird’s stargazing skills were learned, not derived from some star map encoded in their genes,  Dr. Emlen and his colleagues argued. In the glittering dark, each young bunting had apparently spent some time looking up, studying, as the stars traced circles in the night sky.\n  Around the time Nick and Malte learned to spot Sirius, Dr. Dacke and Dr. Warrant had their eureka moment in South Africa with dung beetles.\n After a dung beetle arrives on a dung pile, it painstakingly cobbles together a snowball of dung larger than itself. Then it climbs up onto the ball and spins around, scanning, as if deciphering the celestial scene.\n Through a dung beetle’s compound eyes, stars appear as blobs, not as points of light. But those same eyes are more sensitive than ours to dim objects like the dappled patterns of the Milky Way.\n After its spinning scan, a beetle rolls its ball in a straight line away from the dung pile for a few minutes, on a random heading. (This seems to minimize the likelihood that two beetles will meet, which often results in a fight.) Dr. Dacke found that the beetles seem to keep themselves rolling straight by  confirming that the intragalactic scene they were heading toward still matched the earlier reference image.\n But a funny thing happened as Dr. Dacke’s team kept studying this behavior: They had an increasingly difficult time locating the Milky Way in the sky. “I ended up spending one night cycling off into the forest,” said James Foster, who joined the project as a graduate student and is now a postdoc in zoology at the University of Würzburg in Germany.\n That’s a common experience; roughly four in five Americans, two in three Europeans, and one in three people in the world reside somewhere too bright at night for the Milky Way to be visible,  a 2016 study showed, and the fraction of our planet that is illuminated at night grows larger every year.\n Dr. Dacke and Dr. Foster resolved to test whether washed-out skies might also matter to their study subjects. In  their latest experiments, published Thursday in Current Biology, they shined spotlights on the beetles, and brought them to the roof of the Wits University biology building in central Johannesburg.\n They found two effects, neither of them good. When a beetle’s sky was dominated by a single glaring light, it could still go straight — but instead of rolling off in a random direction, it made a beeline for the beacon. More confusing were the featureless, light-swamped skies you might expect in suburbs: The beetles just went in circles.\n Other species may be similarly affected. The stars have always been more or less constant while landmarks erode and the planet’s magnetic field shifts. But now, rather abruptly, they are fading out. “What we’ve seen on a much smaller scale with the dung beetles could have huge impacts on birds and seals and migratory moths,” Dr. Foster said.\n With their studies concluded, science’s pioneering animal astronomers have gone on to different fates. A few of the South African dung beetles now live in the lab in Lund, where the researchers sometimes study them under a fully simulated sky.\n Dr. Emlen kept the Betelgeuse-beguiled indigo buntings in his lab through the winter and released them in the spring. Hopefully, he said, they recalibrated to the true north before beginning their first migration.\n And Nick the seal is still an active contributor to fields like acoustics, hydrodynamics and optics, although Malte died a few years ago. Nick now lives in a sprawling harbor lab that opens to the Baltic Sea; at night, he and the other seals in the enclosure can see fantastic skies overhead, Dr. Dehnhardt said.\n “But whether they use it,” he said, “I don’t know.”", "posttime": "2021-07-31 02:24:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "动物,stars,博士", "title": "动物在星空中看到了什么，以及它们将失去什么", "title_en": "What Animals See in the Stars, and What They Stand to Lose", "transed": 1, "url": "https://www.nytimes.com/2021/07/29/science/animals-starlight-navigation-dacke.html", "via": "", "real_tags": ["动物", "stars", "博士"]}, {"category": "", "categoryclass": "", "imagename": "a05486d62c79ecd61218ad2999f77030.png", "infoid": 1070697, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Yarn 现在接受赞助！请查看我们的 OpenCollective 和 GitHub 赞助商页面以了解更多详细信息。注意：可以通过从项目中的源代码运行 yarn set version 来试用 master 中的功能（现有的 contrib 插件会自动更新，而新的 contrib 插件可以通过运行 yarn plugin import from sources &lt;name&gt; 来添加）。 enableImmutableInstalls 现在在 CI 上默认为 true（我们仍然建议在 CLI 上显式使用 --immutable）。使用 PnP 时，Yarn 现在将生成 .pnp.cjs 文件（而不是 .pnp.js），无论清单中的类型字段设置为什么。删除了纱线工作区 foreach 的 -a 别名标志；使用 -A,--all 代替，这是完全相同的。 bstatePath 配置选项已被删除。构建状态 (.yarn/build-state.yml) 已移动到安装状态 (.yarn/install-state.gz) 缓存文件需要重新生成。我们不得不更改他们的时间戳，以解决 zip 规范中导致某些第三方工具出现问题的缺陷。\n我们的 CLI 支持的 --clipanion=definitions 命令现在将公开入口点上的定义（而不是 .command 上的）工作区现在即使在节点模块链接器下也可以获得自引用（就像它已经与pnp 链接器）。这意味着名为 foo 的工作区现在可以安全地假设对 require(&#39;foo/package.json&#39;) 的调用将始终有效，在大多数情况下不需要绝对别名。节点模块链接器现在尽最大努力支持门户：协议。这种支持有两个重要的限制：使用此类依赖项的项目如果希望访问其依赖项，则必须使用 --preserve-symlinks 节点选项运行。由于安全原因 Yarn installs 永远不会修改项目外的文件，带有 portal: 的包的子依赖项必须被提升到门户之外。如果失败（例如，如果门户包依赖于与通过另一个包提升的版本不兼容的东西），链接器将产生错误并放弃安装。节点模块链接器现在可以使用硬链接。新设置 nmMode：经典 |硬链接本地| hardlinks-global 指定应该使用哪个 node_modules 策略：hardlinks-global - 标准 node_modules 布局，硬链接指向使用此选项的所有项目的全局内容存储\n节点模块链接器现在将通过在需要时执行几轮来确保生成的安装布局是终端。当工作区依赖于列出安装脚本的另一个工作区时，节点模块链接器将不再打印有关安装后脚本的警告。节点模块链接器现在正确提升了依赖于它们自己的父节点的对等依赖项。当通过 ${ENV_VAR} 语法在配置文件中指定时，布尔值将被正确解释。 PnP 链接器现在计划在删除未插入文件夹的情况下重建包 新的 enableMessageNames 标志可以设置为 false 以从输出中排除 YNxxxx。 yarn init 现在甚至可以从现有项目中运行（将创建丢失的文件）。\n除非设置了 --skip-plugins，否则源代码中的 yarn set 版本现在也将升级内置插件。 yarn version apply 现在支持一个新的 --prerelease 标志，它取代了以前处理预发布的方式。 yarn workspaces foreach --verbose 现在将在进程开始和结束时打印，即使它们没有输出。 yarn workspaces foreach 现在支持 --from &lt;glob&gt; 标志，当与 -R 结合使用时，将定位可从“from”glob 访问的工作区。 yarn patch-commit 现在可以在同一个补丁文件夹中多次使用。 yarn patch-commit 现在支持一个新的 -s,--save 标志，它将保存补丁而不是仅仅打印它。 yarn up 现在支持一个新的 -R,--recursive 标志，它将升级指定的包，无论它在哪里。\nyarn config unset 是一个新命令，它将从本地配置中删除设置（如果设置了 -H，则为 home ）。在 Yarn v1 项目中运行 yarn install 现在将自动启用节点模块链接器。这应该可以解决人们在迁移中遇到的大部分问题。我们仍然建议为新项目保留默认的 PnP，但选择权在您手中。现在以@yarnpkg/esbuild-plugin-pnp 的名称提供了一个官方的 ESBuild 解析器。我们用它来捆绑 Yarn 本身！ PnP 项目现在可以使用节点导出字段 - 无论节点版本如何。 Prettier SDK 不再使用 PnPify，因为它是它唯一剩余的用途，并且具有相当的侵入性；因此，必须在 Prettier 的 plugins 配置属性中指定 Prettier 插件。无法应用的内置补丁将不再导致错误（它们会发出警告并使用原始来源）。请记住，补丁对我们的团队来说也是一个问题，我们这样做只是因为我们现在没有任何其他选项可供我们使用 - 如果您想提供帮助，请考虑对 TypeScript 存储库中的相关拉取请求进行投票，或者，如果您在 Microsoft 工作，也许可以向隔壁的 Ty​​peScript 团队提及解决此问题对您有益。由于补丁冲突，无法安装 TypeScript 4.2 版本。现在已修复。此版本仅包含特定于 4.2 的修复，但从 3.0 开始的未来 Yarn 版本将更能容忍这种情况，不会导致此类错误。\n重新实现了解析管道。我们之前使用多遍方法，在每次传递之间执行 SAT 优化，但经过调查发现 SAT 优化几乎没有影响并增加了性能瓶颈。我们现在使用更简单、更有效的算法运行分辨率。链接器现在可以定义自定义数据以在 Yarn 调用之间缓存。内置链接器 new 使用这些新功能来缓存不能在运行之间更改的包信息。在实践中，这会转化为更快的循环安装（当运行添加很少新包的安装时，如果有的话）。现在，当 packageExtensions 规则未使用或与原始包定义冗余时，会报告警告。可能会破坏，但它从一开始就是这样打算的：packageExtensions 字段不能再用于替换依赖项（只能添加缺少的依赖项）。更喜欢使用分辨率字段来替换现有字段。 upgrade-interactive 命令现在将只显示具有可用升级（而不是所有升级）的软件包的升级建议。 upgrade-interactive 命令已收到 UI 改进，应该更容易查看。 yarn workspaces focus 命令现在将只为聚焦的工作空间运行安装后脚本。\n新的 yarn npm audit 命令可让您从 npm 注册表中查询审计信息。纱线工作区 foreach 命令有一个新标志 -R,--recursive，它将在当前工作区和它依赖的所有其他工作区上运行命令。 yarn install 上的新 --skip-builds 选项将让您跳过构建脚本而不影响生成的 Yarn 工件（与 enableScripts 相反，它也将停止拔出由于包含构建脚本而被拔出的包）。即使您的其他依赖项之一被报告为与您的系统不兼容，现在也可以在使用节点模块链接器时运行依赖项二进制文件。默认情况下，Windows 在生成任何文件名包含“install”、“setup”、“update”或“patch”（它认为它们是安装程序）的二进制文件之前会自动请求管理员权限。我们现在在 Windows 上使用的二进制跳线中明确选择退出此行为。默认情况下，传递给 MinGW 编译程序的参数由基本的 glob 模式引擎自动扩展。我们现在在 Windows 上使用的二进制跳线中明确选择退出此行为。您现在可以使用新的 logFilters 设置将警告转换为错误或信息，或完全隐藏它们。请注意，我们计划在下一个版本中显着改进对等依赖警告，因此即使您有一堆警告，也不要立即将它们静音。\n一些 shell 错误（未找到匹配项、错误的文件描述符、未绑定变量、未绑定参数）现在将是可恢复的错误，使 shell 继续执行链中的下一个命令，而不是硬崩溃。修复 rm -rf ./inexistentFolder/* || 等情况真的。即使工作区不包含 zip 文件（通常是因为您排除了它们），扩展程序现在也会激活。即使导入的模块位于工作区深处，TypeScript 导入建议现在也应该是正确的。处于监视模式的 TypeScript（使用 -w 和在 VSCode 中）现在将在您添加新依赖项时检测它们。在 VSCode 中使用 ctrl+click 导入将不再带您到虚拟包（需要 SDK 更新）。在 node_modules 链接器中继承工作区对等依赖项时考虑对等依赖项默认值 yarn 标记命令集已从 Yarn Classic 移植为 yarn npm 标记。\n运行 yarn info 现在将打印有关您的依赖项的许多信息。可以使用各种选项来调整输出，包括 --json。插件作者可以通过 fetchPackageInfo 钩子提供他们自己的信息部分。使用 -r,--reset 标志运行 yarn stage 现在将取消所有似乎与 Yarn 相关的更改。所有命令现在都记录了它们的每个选项（运行 yarn add -h 以查看示例）。发布注册表错误现在将按原样报告，而不是折叠为一般错误消息。现在将在 Windows 上使用本机二进制跳线来避免终止批处理作业 (Y/N)？调用依赖二进制文件时提示。以下更改仅适用于 pnp 链接器（这是默认安装策略）： pnpapi 模块现在公开了一个名为 getAllLocators 的新函数，允许您访问地图中所有定位器的列表，而无需遍历依赖关系树。这个方法被认为是一个 Yarn 扩展，所以如果你打算在你的代码中使用它，你应该检查它是否存在。\n当使用具有对等依赖关系的包的门户时，Yarn 会丢失解决这些对等依赖关系所需的信息。现在它将以与依赖树中的所有其他包相同的方式正确解析它们。 bin 符号链接现在将从 node_modules/.bin 文件夹中正确删除，因为它们的相应依赖项已被删除。出现了一个名为 nmHoistingLimits 的新设置。它取代了先前在 Yarn 1 中称为 nohoist 的东西。我们现在更加宽容那些对提升布局做出错误假设的包，首先尝试最大化顶层的包暴露。只有在填充了顶层之后，我们才会对剩余的包进行重复数据删除。修复了一些关于对等依赖的病态案例。特别是，工作区的对等依赖项现在将针对其最近的工作区祖先（根据目录层次结构）进行解析，而不是被忽略。请注意，在使用节点模块链接器时，工作区的对等依赖项存在固有问题，并且只能通过使用默认的即插即用链接器才能获得严格正确的行为。现在支持在安装中断后运行安装，并将导致一致的安装状态 yarn stage 命令现在允许在没有 -c,--commit 标志的情况下调用时暂存文件。\n添加了一些内置扩展，以提高与未正确列出其依赖项的包的兼容性。包现在可以使用其清单中的 publishConfig.executableFiles 字段来指示一旦打包到存档中后哪些文件应保留可执行标志。这很重要，因为出于可移植性的原因，Yarn 在打包期间从所有文件中剥离了可执行标志（否则，在 Posix 和 Windows 上运行时，yarn 包会产生不同的输出）。 bin 字段中列出的文件默认假定为可执行文件，因此您无需在 executableFiles 中明确列出它们。即使没有通过 files 字段明确引用，yarn pack 也会正确包含 main/module/bin 文件。在某些日子使用新的 Windows 终端时，进度条的样式会正确。 Yarn 现在将避免使用依赖项的弃用版本，除非只有弃用版本可用于请求的范围。现在可以正确计算构建键，这解决了构建脚本在应该触发的时候并不总是被触发的问题。当纱线添加和纱线上升期间无法解决请求时，纱线现在将显示实际错误\nyarn config set 现在支持 -H,--home 标志，这会导致它更新 home 配置而不是项目配置。当被较旧的 Yarn 版本使用时，在 home 配置文件中找到的设置不会导致异常。不支持的选项将被默默忽略。在使用配置有不同 Yarn 版本的多个项目时，这应该会改善用户体验。新的 immutablePaths 设置允许您指定在使用 --immutable 标志集运行 Yarn 时不得更改的路径。您可以使用它来检测对安装工件的意外更改，无论是 .pnp.js 还是 node_modules 文件。脚本现在可以使用 $RANDOM 变量以及在 $(()) 中使用 +、-、*、/ 和 () 的简单计算脚本现在可以使用分组花括号 ({echo foo}) 在上下文中执行命令的当前 shell（没有像 (echo foo) 那样创建子 shell）。现在，当需要来自无法立即访问它们的上下文的 Node 内置函数时（例如，从 Webpack 浏览器包中访问 fs 模块时），PnP 钩子将显示更清晰的错误消息。包现在可以使用清单中的新 &quot;preferUnplugged&quot;: true 字段声明它们需要解包才能正常工作。这会损害用户的体验（您的项目将是唯一需要硬安装的项目），因此除非别无选择，否则请不要使用此字段。\n运行 yarn search 将打开一个丰富的界面来搜索要安装的包（需要交互式工具插件）。从源代码运行 yarn plugin import 将允许您从我们存储库的主分支构建插件。运行 yarn workspaces focus 只会安装当前的工作空间，以及它可能依赖的任何其他工作空间。 --production 标志只会安装它们的生产依赖项。运行 yarn exec 将在当前工作空间的根目录执行指定的命令（从 Classic 分支重新引入）。 yarn init 现在将生成一个 EditorConfig 文件，并在生成的文件夹上运行 git init。 yarn init 现在支持 -i 标志，它会自动在项目中固定 Yarn 版本。 yarn init 现在将在生成初始清单时注入 initFields 配置设置中的设置（未来版本将删除现已弃用的 initVersion 和 initLicense 设置）。\n纱线设置版本现在作为别名纱线策略设置版本（将在 3.x 中弃用）。 yarn run 现在支持二进制文件的 --inspect 和 --inspect-brk 开关（例如 yarn run --inspect-brk jest）。 yarn dlx 现在尊重本地项目配置（特别是配置的注册表）。这仍然是实验性的，将在接下来的几个月中进一步改进。当底层命令也返回退出代码时，yarn dlx 现在正确退出并带有退出代码。 yarn config get（和 set）现在可以访问嵌套的配置值（例如，yarn config get npmScopes.foo.npmRegistryServer 会告诉您为给定服务器配置了哪个服务器，如果有的话）。 yarn config get 现在将对世界其他地方隐藏它的秘密（或者你的秘密）。如果需要，新的 --no-redacted 选项将关闭此行为。 yarn config set 现在有一个 --json 选项，它会让 Yarn 知道它应该将给定的值解释为 JSON 对象（用于设置服务器配置等）。\n如果出现错误，纱线工作区 foreach 现在将以预期的状态代码退出。注册表身份验证设置现在可以按范围声明（它们以前必须是每个注册表）。这对于 GitHub 包注册表模型会很方便，其中每个范围可能具有不同的访问令牌。配置文件现在使用 ${name} 语法（默认情况下严格；使用 ${name:-default} 提供默认值）使用环境变量插入值。新的 changesetIgnorePatterns 设置可用于忽略来自纱线版本检查的变更集检测中的某些路径（在决定哪些工作区需要新版本时，不会考虑对这些路径的更改）。新的 changesetBaseRef 设置可用于更改纱线版本检查将在其变更集启发式中使用的主分支的名称。新的 httpTimeout 和 httpRetry 设置允许您配置 HTTP(s) 请求的行为。新的 preferredTruncatedLines 设置允许您告诉 Yarn 如果信息和警告消息被截断以适合一行（错误将始终根据需要包装，并且管道 Yarn 的输出将完全关闭此行为）。\n现在可以通过compressionLevel 配置缓存压缩级别。如果您不使用零安装，则使用 0 值可能会以很小的成本提高速度。 Git 协议现在可以从给定的存储库克隆任何工作区。为此，请使用 owner/repo#workspace=name 语法（您可以像往常一样将其与分支名称混合使用）。使用 Git 协议克隆的存储库现在将自动禁用 core.autocrlf，以便构建产生确定性的结果。一般来说，已经进行了改进，以避免新构建的包产生不同的结果。使用 Git 协议获取的包现在将使用 Yarn 1、Yarn 2、npm 或 pnpm 之一构建。将根据源的内容进行选择（例如，如果我们检测到 package-lock.json，我们将使用 npm pack 打包项目）。 exec: 协议具有不同的 API。特别是，现在可以访问内置模块而无需实际需要它们。文件外 PnP 数据生成已得到修复（它允许在与 JS 加载器本身分离的 JSON 文件中生成 PnP 数据）。虚拟实例重复数据删除中的一个边缘情况已得到修复；具有相同有效对等依赖项的包现在总是共享完全相同的实例。\n我们用于在路径中定位 zip 文件的启发式方法已得到改进。因此，在我们的存储库上运行 ESLint 现在需要 28 秒而不是 57 秒。 Yarn 现在将从工作区检测中排除 node_modules 文件夹。因此，在您的工作区字段中列出 **/* 现在会将所有子包检测为工作区。为了使缓存内容寻址，缓存名称已更改。特别是，这意味着如果我们需要修复 fetch 步骤中的错误，我们将不再需要碰撞全局缓存键。 PnP 链接器现在具有额外的松散模式（可选，并通过 pnpMode:loose 设置启用）。在这种模式下，Yarn 将计算在 node_modules 链接下会被提升的包列表......", "note_en": "Yarn now accepts sponsorships! Please give a look at our  OpenCollective and  GitHub Sponsors pages for more details.\n  Note: features in  master can be tried out by running  yarn set version from sources in your project (existing contrib plugins are updated automatically, while new contrib plugins can be added by running  yarn plugin import from sources &lt;name&gt;).\n   The  enableImmutableInstalls will now default to  true on CI (we still recommend to explicitly use  --immutable on the CLI).\n  Yarn will now generate  .pnp.cjs files (instead of  .pnp.js) when using PnP, regardless of what the  type field inside the manifest is set to.\n  The  -a alias flag of  yarn workspaces foreach got removed; use  -A,--all instead, which is strictly the same.\n   The  bstatePath configuration option has been removed. The build state ( .yarn/build-state.yml) has been moved into the install state ( .yarn/install-state.gz)\n The cache files need to be regenerated. We had to change their timestamps in order to account for a flaw in the zip spec that was causing problems with some third-party tools.\n   The  --clipanion=definitions commands supported by our CLIs will now expose the definitions on the entry point (rather than on  .command)\n    Workspaces now get self-references even when under the  node-modules linker (just like how it already worked with the  pnp linker). This means that a workspace called  foo can now safely assume that calls to  require(&#39;foo/package.json&#39;) will always work, removing the need for  absolute aliases in the majority of cases.\n The node-modules linker now does its best to support the  portal: protocol. This support comes with two important limitations:\n Projects that make use of such dependencies will have to be run with the  --preserve-symlinks Node option if they wish to access their dependencies.\n Because Yarn installs will never modify files outside of the project due to security reasons, sub-dependencies of packages with  portal: must be hoisted outside of the portal. Failing that (for example if the portal package depends on something incompatible with the version hoisted via another package), the linker will produce an error and abandon the install.\n The node-modules linker can now utilize hardlinks. The new setting  nmMode: classic | hardlinks-local | hardlinks-global specifies which  node_modules strategy should be used:\n hardlinks-global - standard  node_modules layout with hardlinks pointing to global content storage across all the projects using this option\n  The  node-modules linker will now ensure that the generated install layouts are terminal, by doing several rounds when needed.\n The  node-modules linker will no longer print warnings about postinstall scripts when a workspace depends on another workspace listing install scripts.\n Peer dependencies depending on their own parent are now properly hoisted by the node-modules linker.\n Boolean values will be properly interpreted when specified inside the configuration file via the  ${ENV_VAR} syntax.\n    The PnP linker now schedules packages to be rebuilt if their unplugged folder is removed\n  A new  enableMessageNames flag can be set to  false to exclude the  YNxxxx from the output.\n  yarn init can now be run even from within existing projects (will create missing files).\n   yarn set version from sources will now upgrade the builtin plugins as well unless  --skip-plugins is set.\n yarn version apply now supports a new  --prerelease flag which replaces how prereleases were previously handled.\n  yarn workspaces foreach --verbose will now print when processes start and end, even if they don&#39;t have an output.\n yarn workspaces foreach now supports a  --from &lt;glob&gt; flag, which when combined with  -R will target workspaces reachable from the &#39;from&#39; glob.\n yarn patch-commit can now be used as many times as you want on the same patch folder.\n yarn patch-commit now supports a new  -s,--save flag which will save the patch instead of just printing it.\n yarn up now supports a new  -R,--recursive flag which will upgrade the specified package, regardless where it is.\n yarn config unset is a new command that will remove a setting from the local configuration (or home if  -H is set).\n    Running  yarn install inside a Yarn v1 project will now automatically enable the  node-modules linker. This should solve most of the problems people have had in their migrations. We still recommend to keep the default PnP for new projects, but the choice is yours.\n  An official ESBuild resolver is now provided under the name  @yarnpkg/esbuild-plugin-pnp. We use it to bundle Yarn itself!\n PnP projects can now use the Node   exports field - regardless of the Node version.\n  The Prettier SDK does not use PnPify anymore since it was its only remaining use, and was fairly invasive; as a result, the Prettier plugins must be specified in Prettier&#39;s  plugins configuration property.\n  Builtin patches that fail to apply will no longer cause an error (they&#39;ll emit a warning and the original sources will be used instead). Remember that patches are a problem for our team too, and that we only do this because we don&#39;t have any other option available to us right now - if you wish to help, consider  upvoting the relevant pull request in the TypeScript repository or, if you work at Microsoft, perhaps mention to your TypeScript team next door that fixing this would benefit you.\n      The release of TypeScript 4.2 couldn&#39;t be installed due to patch conflicts. This is now fixed. This version only includes a fix specific to 4.2, but future Yarn releases starting from 3.0 will be more tolerant of this kind of situation and won&#39;t cause such errors.\n    The resolution pipeline got reimplemented. We previously used a multi-pass approach where we performed SAT optimization between each pass, but after investigating it turned out the SAT optims had little impact and added performance bottlenecks. We now run the resolution using a much simpler and more efficient algorithm.\n Linkers can now define custom data to cache between Yarn invocations. The builtin linkers new use those new capabilities to cache package information that can&#39;t change between runs. In practice, this translates into much faster recurrent installs (when running an install that adds few new packages, if any).\n Warnings are now reported when  packageExtensions rules are either unused or redundant with the original package definition.\n Potentially breaking, but it was intended this way from the start: the  packageExtensions field cannot be used to  replace dependencies anymore (only to add missing ones). Prefer using the  resolutions field to replace existing ones.\n  The  upgrade-interactive command will now only show upgrade suggestions for packages that have available upgrades (rather than all of them).\n The  upgrade-interactive command has received UI improvements that should make it easier to look at.\n The  yarn workspaces focus command will now only run the  postinstall scripts for the focused workspaces.\n A new  yarn npm audit command lets you query audit information from the npm registry.\n The  yarn workspaces foreach command has a new flag,  -R,--recursive, which will run a command on the current workspace and all others it depends on.\n A new  --skip-builds option on  yarn install will let you skip the build scripts without impacting the generated Yarn artifacts (contrary to  enableScripts, which would also stop unplugging the packages that would otherwise be unplugged due to containing build scripts).\n  It&#39;s now possible to run dependency binaries when using the node-modules linker even if one of your other dependencies is reported as incompatible with your system.\n By default Windows automatically requests for administrator rights before spawning any binary whose filename contains &#34;install&#34;, &#34;setup&#34;, &#34;update&#34;, or &#34;patch&#34; (it thinks they are installers). We now explicitly opt-out of this behavior in the binary jumpers we use on Windows.\n By default, arguments passed to MinGW-compiled programs are automatically expanded by a basic glob pattern engine. We now explicitly opt-out of this behavior in the binary jumpers we use on Windows.\n  You can now use the new  logFilters setting to turn warnings into either errors or info, or to hide them entirely. Note that we plan to significantly improve the peer dependency warnings in the next release, so perhaps don&#39;t silence them just now even if you have a bunch of them.\n  Some shell errors ( No matches found,  Bad file descriptor,  Unbound variable,  Unbound argument) will now be recoverable errors that make the shell continue on to the next command in the chain instead of hard crashes. Fixes cases such as  rm -rf ./inexistentFolder/* || true.\n  The extension will now activate even if the workspace doesn&#39;t contain zip files (usually because you excluded them).\n  TypeScript import suggestions should now be correct even when the imported module is deep within a workspace.\n TypeScript in watch mode (both using  -w and within VSCode) will now detect new dependencies as you add them.\n  Using  ctrl+click on imports in VSCode won&#39;t take you to virtual packages anymore (require an SDK update).\n    Take into account peer dependency defaults when inheriting workspace peer dependencies in the node_modules linker\n    The  yarn tag set of commands has been ported over from Yarn Classic as  yarn npm tag.\n Running  yarn info will now print many information about your dependencies. Various options are available to tweak the output, including  --json. Plugin authors can provide their own information sections via the  fetchPackageInfo hook.\n Running  yarn stage with the  -r,--reset flag will now unstage all changes that seem related to Yarn.\n All commands now document each of their options (run  yarn add -h to see an example).\n Publish registry errors will now be reported as is rather than being collapsed into a generic error message.\n A native binary jumper will now be used on Windows to avoid the  Terminate batch job (Y/N)? prompts when invoking dependency binaries.\n   The following changes only apply to the  pnp linker (which is the default install strategy):\n The  pnpapi module now exposes a new function called  getAllLocators allow you to access the list of all locators in the map without having to traverse the dependency tree. This method is considered a Yarn extension, so you should check for its existence if you plan to use it in your code.\n When using a portal to a package that had peer dependencies, Yarn would loose the information required to resolve those peer dependencies. It will now properly resolve them the same way as all other packages in the dependency tree.\n  The bin symlinks will now be properly removed from the  node_modules/.bin folder as their corresponding dependencies are removed.\n A new setting called  nmHoistingLimits has appeared. It replaces what was previously known as  nohoist in Yarn 1.\n We are now more forgiving for packages that make incorrect assumptions about the hoisting layout by first trying to maximize package exposure at the top-level. Only after the top-level has been populated will we deduplicate the remaining packages.\n Fixed some pathological cases around peer dependencies. In particular, workspaces&#39; peer dependencies will now be resolved against their closest workspace ancestor (according to the directory hierarchy) rather than be ignored. Note that peer dependencies are inherently problematic with workspaces when using the  node-modules linker, and that the strictly correct behavior can only be obtained by using the default Plug&#39;n&#39;Play linker.\n Running install after an interrupted install is supported now and will result in a consistent install state\n    The  yarn stage command will now allow to stage files when called without the  -c,--commit flag.\n    Added a few builtin extensions to improve compatibility with packages that weren&#39;t correctly listing their dependencies.\n    Packages can now use the  publishConfig.executableFiles field in their manifests to indicate which files should keep the executable flag once packed in the archive. This is important as for portability reasons Yarn strips the executable flag from all files during packing (otherwise  yarn pack would yield different outputs when run on Posix vs Windows). Files listed in the  bin field are assumed executable by default, so you don&#39;t need to explicitly list them in  executableFiles.\n  yarn pack will properly include main/module/bin files, even when not explicitly referenced through the  files field.\n  The progress bars will be properly styled when using the new Windows terminal on certain days.\n Yarn will now avoid using deprecated versions of the dependencies, unless only deprecated versions are available for the requested ranges.\n Build keys are now properly computed, which fixes issues where build scripts weren&#39;t always triggered when they should have been.\n   Yarn will now show the actual error when it fails to resolve a request during  yarn add and  yarn up\n  yarn config set now supports the  -H,--home flag, which causes it to update the home configuration instead of the project configuration.\n  The settings found in the home configuration file won&#39;t cause exceptions when consumed by older Yarn versions. Unsupported options will simply be silently ignored. This should improve the user experience when working with multiple projects configured with different Yarn versions.\n A new  immutablePaths setting allow you to specify paths that must not change when running Yarn with the  --immutable flag set. You can use it to detect unforeseen changes to your install artifacts, be it  .pnp.js or  node_modules files.\n  Scripts can now use the  $RANDOM variable as well as simple calculations using  +,  -,  *,  / and  () inside  $(())\n Scripts can now use grouping curly braces ( {echo foo}) to execute a command in the context of the current shell (without creating a subshell like in the case of  (echo foo)).\n  The PnP hook will now display clearer error message when requiring Node builtins from contexts that can&#39;t access them out of the box (for example when accessing the  fs module from within a Webpack browser bundle).\n       Packages can now declare they they  need to be unpacked in order to be functional using the new  &#34;preferUnplugged&#34;: true field in the manifest. This will hurt the experience of your users (your project will be the only one that will require hard installs), so please refrain using this field unless there&#39;s no other choice.\n  Running  yarn search will open a rich interface to search for packages to install (requires the  interactive-tools plugin).\n  Running  yarn plugin import from sources will allow you to build plugins from the master branch of the our repository.\n Running  yarn workspaces focus will only install the current workspace, plus any other workspace it might depend on. The  --production flag will only install their production dependencies.\n Running  yarn exec will execute the specified command at the root of the current workspace (reintroduced from the Classic branch).\n  yarn init will now generate an  EditorConfig file, and run  git init on the resulting folder.\n yarn init now supports a  -i flag which will automatically pin the Yarn version in the project.\n yarn init will now inject the settings from the  initFields configuration setting when generating the initial manifest (future release will remove the now deprecated  initVersion and  initLicense settings).\n   yarn set version now as an alias called  yarn policies set-version (will be deprecated in 3.x).\n yarn run now supports the  --inspect and  --inspect-brk switches for binaries (for example  yarn run --inspect-brk jest).\n  yarn dlx now respects the local project configuration (particularly the configured registries). This is still experimental and will be further improved in the next months.\n yarn dlx now properly exits with an exit code when the underlying command returned an exit code too.\n yarn config get (and  set) can now access nested configuration values (for example,  yarn config get npmScopes.foo.npmRegistryServer will tell you which server is configured for the given server, if any).\n yarn config get will now hide its secrets (or rather yours) from the rest of the world. A new  --no-redacted option will toggle off this behavior if needed.\n yarn config set now has a  --json option that will let Yarn know it should interpret the given value as a JSON object (useful to set server configuration, etc).\n yarn workspace foreach will now exit with the expected status code if there&#39;s an error.\n  Registry auth settings can now be declared per-scope (they previously had to be per-registry). This will be handy with the GitHub Package Registry model, where each scope may have different access tokens.\n The configuration file now interpolates the values with the environment variables using the  ${name} syntax (strict by default; use  ${name:-default} to provide a default value).\n The new  changesetIgnorePatterns setting can be used to ignore some paths from the changeset detection from  yarn version check (changes to those paths won&#39;t be taken into account when deciding which workspaces need to fresh releases).\n The new  changesetBaseRef setting can be used to change the name of the master branch that  yarn version check will use in its changeset heuristic.\n The new  httpTimeout and  httpRetry settings allow you to configure the behavior of the HTTP(s) requests.\n The new  preferTruncatedLines setting allow you to tell Yarn that it&#39;s ok if info and warning messages are truncated to fit in a single line (errors will always wrap as much as needed, and piping Yarn&#39;s output will toggle off this behaviour altogether).\n The cache compression level can now be configured through  compressionLevel. If you don&#39;t use Zero-Installs, using a value of  0 may yield speed improvements at little cost.\n  The Git protocol can now clone any workspace from a given repository. To do this, use the  owner/repo#workspace=name syntax (which you can mix with branch names as usual).\n The repositories cloned using the Git protocol will now automatically disable  core.autocrlf so that the builds lead to deterministic results. Generally speaking, improvements have been made to avoid freshly built packages from generating different results.\n Packages fetched using the Git protocol will now be built using either of Yarn 1, Yarn 2, npm, or pnpm. The choice will be made based on the content of the sources (for example, we will pack the project using  npm pack if we detect a  package-lock.json).\n The  exec: protocol has a different API. In particular, builtin modules can now be accessed without having to actually require them.\n  The out-of-file PnP data generation has been fixed (it allows to generate the PnP data in a JSON file separated from the JS loader itself).\n An edge case in the virtual instances deduplication has been fixed; packages with the same effective peer dependencies now always share the exact same instance.\n The heuristic we use to locate zip files within paths has been improved. As a result, running ESLint on our repository now takes 28s instead of 57s.\n Yarn will now exclude the node_modules folder from the workspace detection. As a result, listing  **/* in your  workspaces field will now detect all child packages as workspaces.\n The cache names have changed in order to make the cache content-addressed. In particular, this mean that in the event where we need to fix a bug in the fetch steps, we won&#39;t need to bump a global cache key anymore.\n The PnP linker now features an additional loose mode (optional, and enabled through the  pnpMode: loose setting). Under this mode, Yarn will compute the list of packages that would have been hoisted under the node_modules linke\n......", "posttime": "2021-07-31 02:23:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "纱线,yarn,现在", "title": "纱线 3.0.0", "title_en": "Yarn 3.0.0", "transed": 1, "url": "https://github.com/yarnpkg/berry/blob/master/CHANGELOG.md", "via": "", "real_tags": ["纱线", "yarn", "现在"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约——周五，由于投资者和金融机构继续向隔夜窗口注入现金，美联储逆回购工具的交易量飙升至创纪录的 1.039 万亿美元。在美联储上个月将逆回购协议的利率从 0% 上调至 0.05% 后，成交量激增，作为技术性调整的一部分，以防止有效联邦基金利率降得太低。 （由 Gertrude Chavez-Dreyfuss 报道，由 Chris Reese 编辑）注册接收来自 Postmedia Network Inc 的一个部门 Regina Leader-Post 的每日头条新闻。欢迎电子邮件正在发送中。如果您没有看到它，请检查您的垃圾文件夹。下一期 Regina Leader Post Headline News 很快就会出现在您的收件箱中。 Postmedia 致力于维护一个活跃但民间的讨论论坛，并鼓励所有读者分享他们对我们文章的看法。评论可能需要长达一个小时的审核才能出现在网站上。我们要求您保持评论的相关性和尊重性。我们已启用电子邮件通知 - 如果您收到评论回复、您关注的评论线程有更新或如果您关注某个用户的评论，您现在将收到一封电子邮件。请访问我们的社区准则以获取有关如何调整电子邮件设置的更多信息和详细信息。", "note_en": "NEW YORK — Volume at the U.S. Federal Reserve’s reverse repurchase facility soared to a record $1.039 trillion on Friday as investors and financial institutions continued to pour cash into the overnight window.\n      Volume surged after the Fed last month raised the rate it pays on reverse repurchase agreements to 0.05% from 0% as part of technical adjustments to keep the effective federal funds rate from falling too low. (Reporting by Gertrude Chavez-Dreyfuss Editing by Chris Reese)\n                  Sign up to receive daily headline news from Regina Leader-Post, a division of Postmedia Network Inc.\n    A welcome email is on its way. If you don&#39;t see it, please check your junk folder.\n  The next issue of Regina Leader Post Headline News will soon be in your inbox.\n      Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our  Community Guidelines for more information and details on how to adjust your  email settings.", "posttime": "2021-07-31 02:23:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,交易量,reverse,评论", "title": "美联储逆回购交易量达到创纪录的 1T 美元", "title_en": "U.S. Fed reverse repo volume hits record $1T", "transed": 1, "url": "https://leaderpost.com/pmn/business-pmn/u-s-fed-reverse-repo-volume-hits-record-1-trillion", "via": "", "real_tags": ["交易", "交易量", "reverse", "评论"]}, {"category": "", "categoryclass": "", "imagename": "e47830c36948f6e0771598ffad00fcfd.png", "infoid": 1070694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "打破悉尼——周五，澳大利亚的一个特斯拉 Megapack 电池单元在测试由法国 Neoen SA 运营的世界上最大的储能项目之一时发生火灾，消防当局表示。当局表示，当地时间周五早上，在墨尔本附近被称为维多利亚大炮台的备受瞩目的能源项目的初步试验中发生了火灾，并补充说没有人受伤，该设施已被疏散。 “Neoen 和特斯拉正在与现场的紧急服务部门密切合作以应对这种情况，”Neoen 董事总经理 Louis de Sambucy 在一份声明中说。 de Sambucy 补充说，该站点已与电网断开连接，“电力供应不会受到影响”。维多利亚的大型电池项目遇到了障碍。 Moorabool 基地的一个大型特斯拉电池组已经起火。 https://t.co/5zYfOfohG3 #7NEWS pic.twitter.com/8obtcP61X1 — 7NEWS 墨尔本（@7NewsMelbourne）2021 年 7 月 30 日维多利亚州消防救援队表示，配备呼吸器的工作人员正在努力阻止火势从 13 吨重的电池中蔓延到现场附近的电池。\n它补充说，一名消防部门的科学官员正在进行大气监测，但它表示对社区没有威胁。该项目的总成本尚未披露，但 Neoen 在今年早些时候从澳大利亚政府获得了 1.6 亿澳元（1.18 亿美元）的廉价融资，用于资助旨在生产 450 兆瓦时 (MWh) 电力的大型电池。特斯拉为该项目提供了 Megapack 技术，该项目将于 12 月开始的澳大利亚夏季及时开始运营。", "note_en": "Breaking        SYDNEY — A fire broke out in a  Tesla Megapack  battery unit in  Australia on Friday during testing of one of the world&#39;s biggest energy storage projects, run by France&#39;s Neoen SA, fire authorities said.\n  The fire erupted during an initial trial of the high-profile energy project known as the Victorian Big Battery near Melbourne on Friday morning local time, authorities said, adding that nobody was injured and the facility was evacuated.\n  &#34;Neoen and Tesla are working closely with emergency services on site to manage the situation,&#34; Neoen Managing Director Louis de Sambucy said in a statement.\n  The site had been disconnected from the grid and &#34;there will be no impact to the electricity supply,&#34; added de Sambucy.\n  Victoria&#39;s big battery project has hit a snag. One of the massive Tesla battery packs at the Moorabool site has gone up in flames.  https://t.co/5zYfOfohG3  #7NEWS  pic.twitter.com/8obtcP61X1\n — 7NEWS Melbourne (@7NewsMelbourne)  July 30, 2021\n      Fire Rescue Victoria said crews with breathing apparatus were working to stop the blaze spreading from the 13-ton battery to nearby batteries at the site.\n  A fire department scientific officer was conducting atmospheric monitoring, it added, although it said there was no threat to the community.\n    The total cost of the project has not been disclosed, but Neoen won A$160 million ($118 million U.S.) in cheap finance from the Australian government earlier this year to help fund the big battery designed to produce 450 megawatt hours (MWh) of electricity.\n  Tesla supplied its Megapack technology for the project, which is due to start operating in time for the Australian summer, which begins in December.", "posttime": "2021-07-31 01:41:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,装置,megapack,项目", "title": "特斯拉 Megapack 装置在澳大利亚测试时着火：13 吨电池是世界上最大的储能项目之一的一部分", "title_en": "Tesla Megapack unit catches fire in Australia during testing: 13-ton battery was part of one of the world's biggest energy storage projects", "transed": 1, "url": "https://www.autoblog.com/2021/07/30/tesla-megapack-battery-fire-melbourne-australia/", "via": "", "real_tags": ["特斯拉", "装置", "megapack", "项目"]}, {"category": "", "categoryclass": "", "imagename": "4e3bb96925435accd92f0ec8302ecdcf.jpg", "infoid": 1070693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 2021 年的早期阶段，设计专家 Scott Tong 向我们介绍了创始人应该思考设计的一些方式。 Tong 参与了一些最大的科技品牌的产品和品牌设计，包括 IDEO、IFTTT、Pinterest 等。他现在是设计基金的合伙人。童解释了如何将品牌视为不仅仅是一个标志或社交媒体的存在，设计意味着什么以及关注像素之前的步骤，并就企业家何时应聘请第三方设计机构或引入全面的设计提供指导。时间天赋。在此快速调查中提供建议，我们将与所有人分享结果。莎士比亚写道：“凡人时代所能承受的最纯粹的宝藏是一尘不染的声誉。”尽管我们经常将品牌视为徽标或社交媒体角色，但品牌相当于一个人的声誉。它象征着公司和产品所代表的意义，它具有令人难忘的元素，无论是声望，如香奈儿，还是糟糕的客户服务，如康卡斯特。英语中与品牌最接近的词实际上是声誉。比喻是品牌之于公司，正如声誉之于人。如果您可以将您的品牌与您公司的声誉联系起来，我认为当您就品牌进行对话时，这是一个非常好的起点。第一印象是什么？您的品牌希望一遍又一遍地重复的一致行为是什么？哪些令人难忘的时刻脱颖而出，让您的品牌和声誉令人难忘？ （时间戳：2:40）Tong 概述了设计的真正含义。关于设计方法论有许多不同的思想流派，并且有许多不同类型的设计。您可能同时考虑产品设计、标志设计和品牌设计，而成功雇用并完成这些任务的唯一方法是了解设计的核心是什么。", "note_en": "At Early Stage 2021, design expert Scott Tong walked us through some of the ways founders should think about design. Tong was involved in product and brand design at some of the biggest brands in tech, including IDEO, IFTTT, Pinterest and more. He’s now a partner at Design Fund.\n Tong explained how to think about brand as more than a logo or a social media presence, what design means and the steps that come before focusing on the pixels, and gave guidance on when entrepreneurs should hire third-party design agencies or bring on full-time talent.\n Provide a recommendation in  this quick survey and we’ll share the results with everybody.\n  “The purest treasure mortal times afford is spotless reputation,” wrote Shakespeare. Though we often think of a brand as a logo or a social media persona, a brand is the equivalent of a person’s reputation. It signifies what the company and products stand for, and it has an element of being memorable for something, whether it’s prestige, like for Chanel, or terrible customer service, like for Comcast.\n The closest word in the English language to brand is actually reputation. The analogy is that brand is to company as reputation is to person. If you can link your brand with your company’s reputation, I think it’s a really great place to start when you’re having conversations about brands. What is the first impression? What are the consistent behaviors that your brand hopes to repeat over and over? What are the memorable moments that stand out and make your brand, your reputation memorable?   (Timestamp: 2:40)\n  Tong outlined what design is truly about. There are many different schools of thought on design methodology and there are many different types of design. You may be thinking about product design and logo design and brand design all at the same time, and the only way to successfully hire for those tasks and complete them is to understand what design is, at its core.", "posttime": "2021-07-31 01:41:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,expert", "title": "设计专家 Scott Tong 概述了创始人在设计产品时应考虑的 4 个概念", "title_en": "\n\t\t\t\tDesign expert Scott Tong outlines 4 concepts founders should consider when designing products\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/design-expert-scott-tong-outlines-4-concepts-founders-should-consider-when-designing-products/", "via": "", "real_tags": ["设计", "expert"]}, {"category": "", "categoryclass": "", "imagename": "5667f7ae6b400cb64f1febbdfac1b1b7.jpg", "infoid": 1070692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "政府问责办公室周五表示，它否认 Blue Origin 的抗议和 Dynetics 提出的单独挑战，Dynetics 是一家国防承包商，也提交了一份合同提案。 GAO 的结论是，NASA 在授予 SpaceX 唯一奖励时没有违反任何法律法规。该机构在一份新闻稿中说：“因此，GAO 否认了 NASA 向 SpaceX 授予单一奖项的不当行为的抗议论点。”正式抗议是针对 NASA 决定授予载人着陆系统计划合同的决定，该计划旨在自阿波罗以来首次将人类送回月球，仅授予 SpaceX，而不是最初打算的两家公司。 SpaceX 的载人着陆系统计划的提案金额为 29 亿美元，约为 Blue Origin 59.9 亿美元提案的一半。本周早些时候，贝索斯给 NASA 局长比尔·纳尔逊 (Bill Nelson) 写了一封公开信，提议以该价格降低 20 亿美元，以解决导致 NASA 只选择一家公司签订合同的“近期预算问题”。 NASA 只授予一家公司奖项的决定确实背离了历史标准，但 GAO 坚持认为“[合同]公告保留授予多个奖项、单个奖项或根本不授予奖项的权利。” Blue Origin 坚持认为，在 NASA 得出结论它没有足够的资金来获得两个奖项后，它没有时间修改其投标。该公司在抗议中说：“Blue Origin 显然因该机构未能传达这一要求的变化而受到损害。” “蓝色起源本可以并且已经采取多项行动来修改其提议的方法，降低其价格以更紧密地与原子能机构可用的资金保持一致，和/或提出时间表替代方案。” “我们坚信 NASA 的决定存在根本性问题，但 GAO 由于其管辖权有限而无法解决这些问题。我们将继续倡导两个直接供应商，因为我们相信这是正确的解决方案。”该发言人指出，立法者在参议院的一项法案中增加了一项条款，要求 NASA 为 HLS 计划选择供应商，这让该公司感到鼓舞。 TechCrunch 已联系 Dynetics 征求意见。如果他们回应，我们将更新故事。", "note_en": "The Government Accountability Office said Friday that it was denying both Blue Origin’s protest and a separate challenge filed by Dynetics, a defense contractor that also submitted a proposal for the contract. GAO concluded that NASA did not violate any laws or regulations when granting the sole award to SpaceX. “As a result, GAO denied the protest arguments that NASA acted improperly in making a single award to SpaceX,” the agency said  in a press release.\n The formal protest was over NASA’s decision to award the contract for the Human Landing System Program, which aims to return humans to the moon for the first time since Apollo, solely to SpaceX – and not to two companies, as was originally intended. SpaceX’s proposal for the Human Landing System Program came in at $2.9 billion, around half of Blue Origin’s $5.99 billion proposal. Earlier this week, Bezos penned an open letter to NASA Administrator Bill Nelson offering to knock $2 billion off that price to solve the “near-term budgetary issues” that caused NASA to select just one company for the contract.\n   NASA’s decision to give just one company the award did veer from historical standard, but GAO maintained that “the [contract] announcement reserved the right to make multiple awards, a single award, or no award at all.”\n Blue Origin maintains that it was not given time to revise its bid after NASA concluded it did not have sufficient funding for two awards. “Blue Origin was plainly prejudiced by the Agency’s failure to communicate this change in requirements,” the company said in the protest. “Blue Origin could have and would have taken several actions to revise its proposed approach, reduce its price to more closely align with funding available to the Agency, and/or propose schedule alternatives.”\n   “We stand firm in our belief that there were fundamental issues with NASA’s decision, but the GAO wasn’t able to address them due to their limited jurisdiction. We’ll continue to advocate for two immediate providers as we believe it is the right solution.”\n The spokesperson noted that the company was encouraged by lawmakers adding a provision to a bill in Senate that would require NASA to select to providers for the HLS program.\n    TechCrunch has reached out to Dynetics for comment. We will update the story if they respond.", "posttime": "2021-07-31 01:40:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "监管,watchdog,nasa", "title": "政府监管机构拒绝蓝色起源对月球着陆器合同的抗议", "title_en": "\n\t\t\t\tGovernment watchdog rejects Blue Origin’s protest over lunar lander contract\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/government-watchdog-rejects-blue-origins-protest-over-lunar-lander-contract/", "via": "", "real_tags": ["监管", "watchdog", "nasa"]}, {"category": "", "categoryclass": "", "imagename": "a5ee02c4b0d897e888a7421a3e1c8d98.jpg", "infoid": 1070691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Epic Games 与 Apple 的法律纠纷肯定会持续数年，而这家 Fortnite 制造商也几乎不隐瞒其赢得民意之战的目标。马斯克的信任投票可能会影响尚未就该话题形成明确意见的消费者。苹果公开辩称，不满意的开发者可以将他们的产品带到 Android 或 iOS 上的移动网络上，但 Epic Games 和其他公司辩称，苹果对应用程序的束缚简直就是垄断。不太清楚的是为什么马斯克现在要处理这个问题。虽然马斯克很少会拒绝就一个与他无关的有争议的问题发表外部意见，但马斯克目前的公司似乎都没有受到 App Store 收费的严重影响，尽管这背后肯定会发生一些行动。场景。 Apple 应用商店费用是事实上的全球互联网税。史诗是对的。", "note_en": "Epic Games legal battle with Apple is sure to last years and the Fortnite maker has hardly been secretive about its aims to win the battle for popular opinion as well. Musk’s vote of confidence could hold sway with consumers who have yet to develop a clear opinion on the topic.\n Apple has argued publicly that dissatisfied developers can take their products to Android or mobile web on iOS, but Epic Games and others have argued that Apple’s stranglehold on apps is nothing short of a monopoly.\n  What’s less clear is why Musk is taking up this issue right now. While Musk is rarely one to pass up offering an outside opinion on a contentious issue that doesn’t involve him, none of Musk’s current companies seem to be deeply affected by the fees from the App Store, though there certainly could be action happening behind the scenes.\n Apple app store fees are a de facto global tax on the Internet. Epic is right.", "posttime": "2021-07-31 01:40:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,互联网,musk,马斯克", "title": "埃隆马斯克称苹果的 App Store 费用是“事实上的全球互联网税”", "title_en": "\n\t\t\t\tElon Musk calls Apple’s App Store fees ‘a de facto global tax on the Internet’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/elon-musk-calls-app-store-fees-a-de-facto-global-tax-on-the-internet/", "via": "", "real_tags": ["apple", "苹果", "互联网", "musk", "马斯克"]}]