[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1013268, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，苹果首席执行官蒂姆·库克宣布，他们将把Mac系列产品、MacBooks、iMac等全部产品从英特尔芯片组转变为定制的Apple Silicon。不是ARM，而是定制的苹果硅片。差别可能很细微，但也是非常非常重要的。\n这不仅仅是因为坚持把它叫做ARM上的Mac有点小气，特别是如果你从来没有遇到过说AMD而不是PC on x86或其他任何东西的问题。不是的。因为这大多是错误的…。基本上都是。\n首先，ARM有两种不同的许可证。一个是芯片组设计。你付了费用，拿了你的Cortex内核或者别的什么，你就把它们弄好了，你就得到了你的CPU。\n另一个是ISA许可证。这样，就不会有芯片设计了。没有。您得到的只是指令集体系结构。你必须自己滚动实际的设计。\n这就是苹果公司一直在做的事情。制作自己的定制设计，使用ARM指令集。好多年了。\n有传言称，苹果的许可证可能会让他们获得比这更多的客户，但让我们暂时把它放在一边。\n其次，因为ARM指令集，甚至CPU，只是苹果硅封装的一小部分。从字面上看。\n有这样一个古老的故事：史蒂夫·乔布斯从日本回来，想在无限循环的咖啡馆Mac咖啡厅吃到绝对最好的寿司。因为史蒂夫·乔布斯。\n乔布斯想要最好的寿司，所以他找来了他能找到的最好的寿司厨师来Caffe Macs为他做寿司。芯片组也是如此。\n当iPhone和iPad使用定制硅的情况变得更好的时候，故事就发生了，史蒂夫·乔布斯开始寻找世界上最好的芯片设计师，并把他们带到苹果为他制造硅。\n而这一切都演变成了由高级副总裁约翰尼·斯劳吉(Johny Srouji)领导的硬件技术部门。\n2010年1月，苹果公司的第一款内部硅芯片首次出现在最初的iPad中。同年6月，它出现在iPhone上。\n它被称为A4，它是片上系统(SoC)。这意味着，不再需要单独的处理器、显卡、RAM模块，而是像PC一样，所有这些都集成到一块芯片中。\n它使用的是ARM Cortex-A8处理器的一个版本，因为当时，苹果正在授权ARM设计。A5使用的是Cortex-A9的一个版本，但在2012年，苹果改用指令集许可证，并发布了他们第一个带有A6的定制CPU。\n2013年9月，苹果不仅推出了他们的第一款64位芯片组，还率先推出了移动行业。\n没错，虽然高通和三星满足于在未来几年里弥补32位的研发成本，但苹果确实震惊了硅界，并提供了绝对零的…。FABS…。关于以最快的速度把它们都跳到64位。\n苹果用硅做的事情没有什么神奇之处。别耍花招。原因只有两个--两个相互关联的原因--为什么苹果能够年复一年地在性能和效率上胜过其他所有手机和平板电脑。\n其一，苹果不必出售其芯片组。他们不是硅片供应商。他们不必像硅片供应商那样运作。他们不必担心营销、加价或保质期。他们甚至不必关心每一代芯片组或每一代芯片是否盈利，只需关注芯片组驱动的设备就可以了。\n苹果的平台技术团队不会因此而受到任何约束或阻碍，任何方式都不会。\n第二，苹果的硅片团队只有一个客户。他们不必担心使用相互竞争或冲突的技术、功能集或议程来支持多个不同的供应商。他们不必尝试猜测哪些需要支持，哪些需要支持，或者建造可能会用到或可能不会用到的东西。\n苹果的平台技术团队现在要做的就是运行iOS、iPadOS、TVOS和WatchOS--很快就会运行MacOS--比地球上任何东西都快。那是他们唯一的工作。\n我的意思是，不要离题太远，而是要这样看：苹果(Apple)已经为Watch出货了五年的专用可穿戴芯片，而高通(Qualcomm)刚刚发布了他们的第三代经过改造的旧手机芯片，因为几乎没有人能付得起他们的钱，让他们投资于其他任何东西，而且他们肯定不会按规定做这件事。\n只要有无限的时间，任何有价值的硅片团队都可以设计出性能最高、效率最高的芯片上系统，达到我们宇宙中已知的物理极限。但是我们并不生活在一个时间无限的世界里。我们生活在一个期限紧迫、风险极高的国家。你有几年的时间来计划，但你必须每年发货。\n因此，苹果所做的就是建立一个坚实的基础，然后反复重复。不仅是一项多年计划，而且是一项多年投资。\n看，当苹果这么早就推出64位的时候，我们中的许多人，包括我自己，都很难理解为什么。一群专家陷入了最令人厌倦的陈词滥调，认为更多的位只对寻址更多的内存真正有用。但这还不是全部。\n我们中的一些人选择了新的、更干净的ARM64指令集和改进的硬件安全性。\n但苹果对A7真正做的是完全重新设计芯片组本身。这才是真正的飞跃。64位仅仅是面向未来的肉汁。\n然后，苹果注意到，在更大的内核上推动最高性能意味着在低端留下空白。因此，有了A10 Fusion，他们开始将高性能内核与高效率内核配对，并创建了性能控制器来智能、透明地管理交换。\n有了A11仿生机，苹果摆脱了融合，让每个内核根据需要单独或一起运行。他们还制造了新的能效核心，速度几乎和上一代的性能核心一样快。\n目前的内核具有更高的性能效率。好多了。而且它仍然在TSCM的7纳米节点上的ARMv8分支上。别管即将问世的ARMv9和5纳米节点了。\n但是…。在一开始说ARM指令集部分，CPU部分只是整个软件包中非常小的一部分之后，我刚刚花了大量的时间来讨论它们，因为它们的定制程度超出了任何ARM设计的范围。\n在同一款A11仿生产品中，苹果推出了他们自己定制图形处理器或GPU。此前，苹果一直在使用PowerVR，但出于我会马上开始使用的原因，他们在2017年全力以赴地使用苹果，采用了一种宽泛而缓慢的方法，让他们能够尽可能高效地处理负载，但也给了他们在需要时处理峰值的余地。\n换句话说，当事情变得拥堵时，在单车道高速公路上拥有一辆法拉利可能会非常令人沮丧。不过，是8车道的高速公路吗？嗯，如果法拉利需要开足马力，通常还有空间。\n但是，真正的意义并不在于超级跑车。它是周遭一切事物的超高效率。\n因为性能和能效是齐头并进的。事实上，如果处理得当，能效可以提高性能。\n有了A11，苹果还增加了他们的第一个e-Apple神经引擎，它现在不仅有8个内核，而且还有一个机器学习控制器，可以在性能内核中瞄准AMX-Apple机器学习加速器。\n神经引擎现在还与图像信号处理器捆绑在一起，除了所有照片和视频处理之外，还包括计算摄影效果的实时预览和4K视频流的交错扩展动态范围。\n而这仍然只是苹果的片上系统正在做的事情的一部分，远远超出了指令集和CPU。\n其中包括电源管理、密码加速器、安全Enclave、高效音频处理、深度引擎、PRO显示引擎、存储控制器、HEVC视频编码器、HDR视频处理器、永不停机处理器、高性能统一内存、高带宽高速缓存、硅封装和增强型OLED处理。\n这并不是说苹果想要在每一台设备中制造每一种组件，因为这种傲慢会导致最糟糕的跌倒。但是，感觉苹果似乎非常想拥有每一个能为客户带来真正的、有影响力的、差异化的体验的组件。\n因为苹果的硅片团队只有一个客户，而且硅片团队与硬件工程团队、软件工程团队，甚至人机界面团队的合作非常紧密，他们可以专门制造硅片来支持这些团队想要创建的硬件、软件和界面。\n因此，在这里，重要的是要明白，苹果并没有真正出货过芯片组。他们提供功能集。\n苹果从来没有推出过NFC，它推出的是Apple Pay。他们从来没有运过神经引擎，他们运的是面部识别码。\n是的，早在任何权威人士写道苹果在机器学习领域远远落后于他们永远赶不上的时候，苹果就已经将机器学习集成到硅片水平，其他供应商甚至不得不争先恐后地跟上这一水平。\n这并不夸张。这是因为规格、技术，没有用户体验那么重要。\n每年，当谁在最新款Galaxy手机和6个月或10个月的iPhone之间进行基准测试时，或者写到400美元的iPhone SE比你能买到的最昂贵的Android手机更快时，所有的性能都会引起所有的关注。所有这些都是偶然的。这不仅是苹果设计CPU的方式的副作用，也是整个SoC设计方式的副作用。\n综上所述，我不认为很多人真的能体会到苹果上个月宣布的Mac转型带来的巨大影响。\n再说一次，他们不仅仅是从x86转向ARM。那是目光短浅。他们正在从英特尔CPU、英特尔和AMD图形处理器以及他们多年来一直在出货的定制Apple T2芯片的大杂烩中转移，以解决这些英特尔CPU和GPU缺乏功能的问题。\n他们正在转向苹果硅业。乔尼·斯劳吉(Jony Srouji)非常明确地表示，这将包括一系列单芯片系统(System-on-a-Chip)。\n当蒂姆·库克(Tim Cook)宣布这些计划时，他并没有说要制造更快的Mac电脑，尽管这是每个人都希望的，或者是电池续航时间更长的Mac电脑，尽管这可能是一个稳妥的假设。他当然没有说这是为了让Mac变得更便宜，而不是直接说，也没有考虑到针对这个问题的团队的实际成本和机会成本。不，他非常明确地说，这是为了制造更好的Mac，这是其他任何方式都不可能做到的。\n当史蒂夫·乔布斯(Steve Jobs)在15年前说过完全相同的话时，我们在3年内就有了MacBook Air，而在5年内，Air又重新定义了一代笔记本电脑。\n那就是与英特尔合作，以及他们的工艺和热量限制。与苹果硅片合作，简直就是天方夜谭。\n我的意思是，目前的开发套件使用的是为iPad设计的芯片，而不是为Mac设计的芯片，也根本不是苹果的Mac硅芯片，而且它的性能已经令人印象深刻。Windows本地运行在Qualcomm上的仿真运行效果似乎更好。我们会在紧要关头回到这个话题。\n还记得几年或五年前吗？12英寸的MacBook无法编辑单一的4K数据流。较新的13英寸MacBook Air在MAX的粉丝面前几乎无法应付。同年的iPad Pro可以处理3个数据流。而且它甚至没有风扇。\n没有一点风扇噪音的苹果硅片MacBook能处理什么呢？\n我们已经听说Apple Silicon将内置虚拟机管理程序来实现超高性能的虚拟化。苹果还可以内置什么，以使Mac体验的其他关键元素以任何现成的芯片组都无法做到的方式实现超高性能？\n我认为，这就是为什么说苹果硅上的Mac是英特尔上Windows的终结，而微软和他们所有的供应商都在争先恐后地转向ARM，这有点没有切中要害。\n这不是手臂的设计。这不是将高通芯片放入Surface，甚至将AMD或Intel混合芯片放入惠普或戴尔。这甚至不是在同一个宇宙里发生的。\n别误会我的意思。这些产品可能很棒，也可能是一样的，也可能只是不同，但它们仍将使用商用硅，它们仍将是模块化的，它们仍不会做苹果正在做的任何事情。\n除非或直到微软花一年时间和一大笔钱制造自己的硅片或高通，创造自己的操作系统和生产计算机硬件。\n需要明确的是，这对苹果来说可能是一个巨大的优势，但也可能是一个巨大的风险。今年晚些时候，在接下来的两年里，苹果硅片不仅要发货，而且要交付。如果那些SoC还没有准备好怎么办？如果他们的表现或效率不像每个人希望的那样好，或者，哦，天哪，不像英特尔那样，那该怎么办呢？\nIPhone、iPad和Apple Watch，从硅片开始，都取得了惊人的成功。如果苹果的硅质Mac电脑也要同样成功，那它们就得靠自己赚到钱。\n因为这才是做这一切的真正成本--苹果只有在他们继续生产我们都想买的产品的情况下，才能赚回他们的钱，才能获得传奇般的利润率。", "note_en": "Last month, Apple&#39;s CEO, Tim Cook, announced that they were going to be transitioning the Mac lineup, the MacBooks, the iMacs, all of it, from Intel chipsets to custom Apple Silicon. Not ARM, but custom Apple Silicon. And the difference may be subtle but it&#39;s also really really significant.\n Not just because insisting on calling it Mac on ARM is kinda petty, especially if you&#39;ve never had any issue saying AMD instead of PC on x86 or whatever. No. Because it&#39;s mostly wrong… Mostly.\n  First, ARM has two different kinds of licenses. One is for chipset designs. You pay your fee, you take your Cortex cores or whatever, you get them fabbed, and you&#39;ve got your CPUs.\n The other is an ISA license. With that, you get no chip design. None. All you get is the instruction set architecture. You have to roll the actual design yourself.\n  And that&#39;s what Apple&#39;s been doing. Making their own custom designs that use the ARM instruction set. For years.\n Rumor has it Apple&#39;s license may let them get even more custom than that, but let&#39;s just leave it there for now.\n And, second, because the ARM instruction set, even the CPU, is only one small part of the Apple silicon package. Literally.\n  There&#39;s this old story about Steve Jobs coming back from Japan and wanting the absolute best sushi at the Caffe Macs, the cafeteria at Infinite Loop. Because Steve Jobs.\n  Jobs wanted the best sushi so he got the best sushi chef he could find to come to Caffe Macs and make it for him. Same with chipsets.\n The instant it became clear the iPhone and iPad would be better off with custom silicon, the story goes Steve Jobs set out to find the best chip designers in the world and bring them to Apple to make that silicon for him.\n And that&#39;s all evolved into the hardware technologies group led by senior Vice President Johny Srouji.\n   In January of 2010, Apple&#39;s first ever in-house silicon debuted inside the original iPad. It came to the iPhone that same June.\n It was called the A4 and it was a system-on-a-chip or SoC. That means, instead of having a separate processor, graphics card, RAM modules, and all that, like a PC has, everything was integrated together into a single chip.\n  It used a version of the ARM Cortex-A8 processor, because back then, Apple  was licensing the ARM designs. The A5 used a version of the Cortex-A9, but in 2012, Apple switched to the instruction set license and released their first, custom CPU with the A6.\n In September of 2013, Apple introduced not only their first 64-bit chipset, but the mobile industries first.\n That&#39;s right, while Qualcomm and Samsung were content to make up R&amp;D costs on 32-bit for years still to come, Apple very literally shocked the silicon world and giving absolutely zero… fabs… about leap-frogging them all to 64-bit as fast as Srouji-ly possible.\n  There&#39;s no magic to what Apple does with silicon. No tricks. There are just two reasons — two inter-related reasons — why, year after year, Apple&#39;s been able to out-perform every other phone and tablet on performance and efficiency.\n One, Apple doesn&#39;t have to sell its chipsets. They&#39;re not a silicon vendor. They don&#39;t have to operate like a silicon vendor. They don&#39;t have to worry about marketing or markups or shelf-life. They don&#39;t even have to care about making a profit on each chipset or generation, just on the devices the chipsets power.\n Apple&#39;s platform technologies team isn&#39;t constrained or held back by any of that, not in any way.\n Two, Apple&#39;s silicon team only has one customer. They don&#39;t have to worry about supporting multiple different vendors with competing or conflicting technologies, feature sets, or agendas. They don&#39;t have to try and guess what will need support and what won&#39;t, or build things that may be used or may not.\n All Apple&#39;s platform technologies team has to do, right now, is run iOS and iPadOS and tvOS and watchOS — and soon, macOS — faster than anything else on the planet. That&#39;s their only job.\n And, I mean, not to get too far off on a tangent, but look at it this way: Apple has already shipped half a decade of dedicated wearable silicon for the Watch and Qualcomm just announced their third generation of rehashed old phone chips because there&#39;s literally no one who can afford to pay them to invest in anything beyond that, and they&#39;re sure as hell don&#39;t seem willing to do it on spec.\n  Given infinite time, any silicon team worth a damn could design a system-on-a-chip with maximum performance at maximum efficiency up to the limits of known physics in our universe. But we don&#39;t live in a world with infinite time. We live in one with tight deadlines and supremely high stakes. You get a few years to plan, but you have to ship every year.\n So, what Apple&#39;s done, is build a solid foundation and then iterate on it over and over again. Not just as a multi-year plan but as a multi-year investment.\n See, when Apple went 64-bit so early, many of us, myself included, struggled to understand why. A bunch of pundits fell into the tiredest of cliches about more bits only really being useful to address more memory. But that wasn&#39;t it as all.\n A few of us settled on the new, cleaner, ARM64 instruction set and improved hardware security.\n But what Apple really did with A7 was completely re-architect the chipset itself. That was the actual leap forward. 64-bit was just future-proofing gravy.\n Then, Apple noticed that pushing maximum performance on bigger cores meant leaving a gap on the low end. So, with the A10 Fusion, they began pairing the high-performance cores with high-efficiency cores, and created a performance controller to intelligently, transparently manage the switching.\n With the A11 Bionic, Apple got rid of the fusion and let each and every core operate separately or together as needed. And they also made the new efficiency cores almost as fast as previous generation&#39;s performance cores.\n Current cores have even better performance efficiency. Way better. And that&#39;s still on a branch of ARMv8 on TSCM&#39;s 7-nanometer node. Never mind the upcoming ARMv9 and 5-nanometer nodes.\n But… after saying at the very beginning that the ARM instruction set part, the CPU part, was only a very small part of the package, I&#39;ve just spent a ton of time talking about them, because they&#39;ve been so customized beyond any ARM design.\n  In that same A11 Bionic, Apple debuted their own custom graphics processor or GPU. Previously, Apple had been using PowerVR but for reasons I&#39;ll get into in a minute, in 2017 they went full-on Apple, with &#34;a wide and slow&#34; approach, which lets them handle loads as efficiently as possible but it also gives them the headroom to handle spikes when they need to.\n In other words, having a Ferrari on a single lane highway can be super frustrating when things get congested. An 8 lane highway, though? Well, there&#39;s usually room when and if that Ferrari needs to go full-throttle.\n But, the real point isn&#39;t the super car. It&#39;s the super-efficiency of everything else moving around it.\n Because performance and power-efficiency go hand-in-hand. In fact, when done right, power efficiency enables performance.\n With the A11, Apple also added their first ANE — Apple Neural Engine, which now not only has 8 cores, but a machine learning controller that can also target AMX — Apple machine learning accelerators in the performance cores.\n The Neural Engine is also tied into the image signal processor now, which in addition to all the photo and video handling, including things like live previews on computational photography effects and interleaving extended dynamic range on 4K video streams.\n And that&#39;s still only part of what Apple&#39;s system-on-a-chip is doing, well beyond the instruction set and CPU.\n There&#39;s power management, the cryptography accelerator, Secure Enclave, high-efficiency audio processing, depth engine, pro display engine, storage controller, HEVC video encoder, HDR video processor, always-on processor, high performance unified memory, high bandwidth cache, silicon packaging, and enhanced OLED processing.\n It&#39;s not that Apple wants to make every component inside every device, because that kind of arrogance leads to the worst kinds of fall. But, it feels very much seems like Apple wants to own every component that leads to a real, impactful, differentiated experience for customers.\n  Because Apple&#39;s silicon team only has one client, and because the silicon team works so closely with the hardware engineering teams, software engineering teams, even human interface teams, they can build silicon specifically to support the hardware, software, and interfaces those teams want to create.\n So, here, it&#39;s critical to understand that Apple doesn&#39;t really ever ship chipsets. They ship feature sets.\n Apple never shipped NFC, it shipped Apple Pay. They never really shipped a neural engine, they shipped Face ID.\n Yes, years before any pundit wrote how far behind Apple was in Machine Learning they&#39;d never catch up, Apple was already integrating Machine Learning at the silicon level that other vendors would have to race to even try to keep up.\n And that&#39;s not hyperbole. That&#39;s because the specs, the tech, none of it matters as much as the user experience it&#39;s there to support.\n All the performance, which gets all the attention every year when whoever runs a benchmark between the latest Galaxy phone and the 6 or 10 month old iPhone, or writes about the $400 iPhone SE being faster than the most expensive Android phone you can buy. All of that is incidental. It&#39;s a side effect of the way Apple is designing not just its CPUs but its entire SoC.\n  All that to say, I don&#39;t think many people are really getting the enormity of the Mac transition Apple announced last month.\n Again, they&#39;re not moving from just x86 to ARM. That&#39;s myopic. They&#39;re moving from a hodgepodge of Intel CPUs, Intel and AMD GPUs, and custom Apple T2-chips they&#39;ve been shipping for years to work around the lack of features in those Intel CPUs and GPUs.\n And they&#39;re moving to Apple Silicon. Which Jony Srouji very specifically has said will include a family of systems-on-a-chip.\n And when Tim Cook announced them, he didn&#39;t say it was to make faster Macs, though that&#39;s what everyone is hoping for, or Macs with better battery life, though that&#39;s probably a safe assumption. And he certainly didn&#39;t say it was to make Macs cheaper, not directly, not given the real and opportunity costs of targeting that team at this problem. No, he very specifically said it was to make better Macs, Macs that just simply wouldn&#39;t be possible any other way.\n When Steve Jobs said that exact same thing a decade and half ago, within 3 years we got the MacBook Air and within 5, the Air went on to redefine a generation of laptops.\n That was working with Intel, and their process and thermal limits. Working with Apple silicon, literally the sky&#39;s the limit.\n I mean, the current developer kit is using a chip designed for an iPad, not for a Mac, not what will be Apple&#39;s Mac silicon at all, and it&#39;s performance is already impressive. Running seemingly better in emulation that Windows runs on Qualcomm natively. Which we&#39;ll get back to in a hot minute.\n Remember back a few or five years ago? The 12-inch MacBook couldn&#39;t handle editing single stream of 4K. The newer 13-inch MacBook Air could barely handle it with the fans on max. The same year&#39;s iPad Pro could handle 3 streams. And it didn&#39;t even have a fan.\n What will an Apple silicon MacBook be able to handle and without a lick of fan noise?\n We&#39;ve already heard that Apple Silicon will have hypervisor built in to make virtualization ultra-performant. What else could Apple build in to make other, critical elements of the Mac experience ultra-performant in a way no off-the-shelf chipset could ever do?\n Which is why, I think, talk of the Mac on Apple Silicon being the end of Windows on Intel, and Microsoft and all their vendors racing to switch to ARM, is kind of missing the point.\n This isn&#39;t an ARM design. This isn&#39;t throwing a Qualcomm chip in a Surface or even a hybrid AMD or Intel Chip into an HP or Dell. This just isn&#39;t even in the same universe.\n Don&#39;t get me wrong. Those products could be great, they could be the same, they could just be different, but they&#39;ll still be using merchant silicon, they&#39;ll still be modular, and they&#39;ll still not be doing anything like what Apple&#39;s doing.\n Not unless or until Microsoft spends a years and a fortune making its own silicon or Qualcomm creating its own operating system and production computer hardware.\n Which, to be clear, could be a huge advantage for Apple but could also be a huge risk. Come later this year and for the next two years, Apple Silicon not only has to ship but has to deliver. What if those SoC aren&#39;t ready? What if they&#39;re not as performant or as efficient as everyone is hoping they&#39;ll be, or, oh god, as Intel?\n The iPhone, iPad, and Apple Watch, have all been phenomenally successful from the silicon on up. And if Apple silicon Macs are going to be just as successful, they&#39;re going to have to earn it.\n Because that&#39;s the real cost of doing all this — Apple only makes their money back, only makes their legendary margins, if they continue to make products we all want to buy.", "posttime": "2020-07-21 21:38:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,moving,苹果", "title": "Mac正在转向Apple Silicon--而不是ARM", "title_en": "The Mac is moving to Apple Silicon – not ARM", "transed": 1, "url": "https://www.imore.com/mac-moving-apple-silicon-not-arm", "via": "", "real_tags": ["apple", "moving", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "ced094a1fa5c6a4515d4a3e253d267ef.jpg", "infoid": 1013266, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司今天上午宣布，计划在未来10年内使其整个业务达到碳中性。这一消息发布之前，该公司正在推动完全碳中性的公司结构，将其制造供应链和由此产生的产品加入其中。\n今天发布的可持续发展路线图是该公司年度环境进展报告的一部分。将其销售的每一台设备都减少到对气候零影响意味着几件事。首要关注的是找到将生产过程中的排放量减少75%的方法。其余的将集中在帮助消除大气中的碳的努力上。\n该公司已经开始推动用回收材料生产更大比例的产品，这在一定程度上要归功于它自己的内部机器人戴夫(Dave)和黛西(Daise)(2001年的严重振动)，它们回收了关键的稀土磁铁和钨，同时也回收了一些钢材。该公司还在卡内基梅隆大学(Carnegie Mellon)的工程师的帮助下，在奥斯汀经营着自己的材料回收实验室。\n苹果公司表示，它正在与70多家能源供应商合作，为其生产中心实现100%的可再生能源，相信这一合作伙伴关系每年减少的碳排放量将大致相当于300万辆汽车。该公司还致力于在欧洲推出世界上最大的太阳能电池板之一。至于剩余的25%的碳减排，报告中概述了一些倡议，包括努力利用非洲和南美的森林。\n该公司还计划推出一个“影响加速器”，旨在投资于少数族裔拥有的企业，这是该公司种族公平和正义倡议的一部分。至于这与可持续发展的话题有何关系，副总统丽莎·杰克逊在一份新闻稿中说，“系统性种族主义和气候变化不是独立的问题，它们不会遵守单独的解决方案。我们有一代人的机会来帮助建设一个更绿色、更公正的经济，在这个经济中，我们发展全新的产业，追求给下一代一个值得称之为家园的星球。“。\n近年来，苹果公司普遍受到绿色和平组织的高度评价，因为它积极努力限制其大规模全球业务的影响。", "note_en": "Apple this morning announced plans to make its entire business carbon neutral within the next 10 years. The news follows the company’s push toward a fully carbon neutral corporate structure, adding its manufacturing supply chain and resulting products into the mix.\n The roadmap to sustainability as released today, as part of the company’s annual  Environmental Progress Report. Reducing every device it sells to zero climate impact means a couple of things. The primary concern is finding ways to reduce emissions from productions by 75%. The remainder will be focused on efforts to help remove carbon from the atmosphere.\n The company has already begun pushing to make a larger percentage of its products from recycled materials, thanks in part to its own in house robots Dave and Daisy (serious  2001 vibes), which recover key rare earth magnets and tungsten, along with some steel recovery. The company also runs its own Material Recovery Lab in Austin, with help from engineers at Carnegie Mellon.\n  Apple says it’s working with more than 70 energy suppliers to go 100% renewable for its production centers, partnership it believes will reduce roughly the same amount of carbon emissions annually as three million cars. The company is also working to launch one of the world’s biggest solar arrays in Europe. As far as the remaining 25% of carbon reduction, there are number of initiatives outlined in the report, including efforts to resort forests in Africa and South America.\n There are also plans to launch an “Impact Accelerator,” aimed at investing in minority-owned businesses launched as part of the company’s Racial Equity and Justice Initiative. As for how that relates to the topic of sustainability, VP Lisa Jackson says in a press release, “Systemic racism and climate change are not separate issues, and they will not abide separate solutions. We have a generational opportunity to help build a greener and more just economy, one where we develop whole new industries in the pursuit of giving the next generation a planet worth calling home.”\n Apple has generally  received high marks from Greenpeace in recent years, for its aggressive efforts to limit the impact of its massive global operations.", "posttime": "2020-07-21 21:16:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,供应链,supply", "title": "\n苹果称其供应链和产品到2030年将实现碳中性", "title_en": "\n\t\t\t\tApple says its supply chains and products will be carbon neutral by 2030\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/apple-says-its-supply-chains-and-products-will-be-carbon-neutral-by-2030/", "via": "", "real_tags": ["苹果", "apple", "供应链", "supply"]}, {"category": "", "categoryclass": "", "imagename": "01f93f6ca0a50f76fbe47043bf583f66.jpg", "infoid": 1013265, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "杰夫·科波罗在金融科技行业拥有超过25年的经验，目前是支付处理公司BlueSnap全球业务开发和合作伙伴关系的负责人。\n全球每年有近150万亿美元的B2B和B2C交易发生，但只有一小部分是数字的。许多科技公司都想在这块巨大的蛋糕上分得一杯羹。然而，直到最近，只有支付服务商(又名“Payfacs”)、网关、银行和信用卡公司才能访问它。\n这一点正在改变。不管他们是否知道，B2B技术平台正在成为支付公司。Payfacs正在竞相将他们的技术整合到这些平台中，这推动了越来越多的交易。收入分享交易摆在桌面上，支付事实正在推动它们可以为这些B2B平台的客户提供的竞争优势。跨境支付、无缝客户自注册、欺诈保护、市场支付和B2B发票影响力等功能，Payfacs在“综合支付”(这个领域的行话)中胜出，而哪些不胜出。\n过去将网关的选择留给客户的B2B公司需要在支付技术方面变得精通，既要控制用户体验，又要利用这一新业务。桌面上有大量的收入，在这个过程中很容易错失这个机会并疏远客户。\n十年前，云计算革命催生了一波B2B技术平台，承诺“颠覆”每一个行业。健身房有健身房管理平台。医院有了诊所管理平台。零售商有了商业管理平台。媒体公司拥有订阅管理平台。其中许多填补空白的管理平台-全部是独立软件供应商(ISV)-帮助客户管理其运营以及与消费者或其他企业的交互。\n但ISV没有参与支付，这很奇怪，因为他们的平台是如何补充支付的，以及有多少钱处于危险之中。万事达卡说，全球每年约有120万亿美元的B2B支付，在美国25万亿美元的支付量中，纸质支票仍然占据着大约一半的份额。与此同时，根据eMarketer的数据，在26万亿美元的零售总额中，零售电商销售额占4.2万亿美元，约占16.1%。据认为，只有不到8%的全球商业发生在网上。\n你可能会认为B2B软件公司会找到一种方法从146万亿美元的交易中获得收入，但大多数都没有。支付处理是它自己的、混乱的、复杂的利基市场。Payfacs要准备一个商家账户，需要经历一个令人精疲力竭的承保过程，其中包括了解你的客户(KYC)和反洗钱(AML)检查。如果商家违约，Payfac就是下一个兑现交易的人。\n因此，B2B平台保持清晰。他们形成了与一篮子支付工具的集成(Strip、PayPal、Square、我的公司BlueSnap等)。然后让他们的客户选择使用哪一种。要维护的集成有很多。", "note_en": "Jeff Coppolo has over 25 years of experience in the fintech industry and is currently Head of Global Business Development and Partnerships for payments processing company  BlueSnap.\n  Nearly $150 trillion in worldwide B2B and B2C transactions take place every year, but only a tiny portion are digital. A lot of technology companies want their piece of that massive pie. Until recently, though, only payment facilitators (aka, “payfacs”), gateways, banks and credit card companies had access to it.\n That’s changing. Whether they know it yet or not, B2B tech platforms are becoming payments companies. Payfacs are competing to integrate their technology into these platforms, which drive an ever-growing number of transactions. Revenue-sharing deals are on the table, and payfacs are pushing the competitive advantages they can offer to the clients of these B2B platforms. Capabilities like cross-border payments, seamless customer onboarding, fraud protection, marketplace payments and B2B invoicing influence, which payfacs win in “integrated payments” (the jargon for this space) and which don’t.\n B2B companies that use to leave the choice of gateway to their clients need to become savvy in payment technology, both to control the user experience and to tap this new business. There’s a massive amount of revenue on the table, and it’s just too easy to blow this opportunity and alienate clients in the process.\n  A decade ago, the revolution in cloud computing led to a wave of B2B tech platforms promising to “disrupt” every industry. Gyms got gym management platforms. Hospitals got clinic management platforms. Retailers got commerce management platforms. Media companies got subscription management platforms. Many of these fill-in-the-blank management platforms — all independent software vendors (ISVs) — helped clients manage their operations and interactions with consumers or other businesses.\n But ISVs didn’t get involved in payments, which was odd, given how complementary payments were to their platforms and how much money was at stake. Mastercard says there is about  $120 trillion annually in B2B payments worldwide, and paper checks still dominate about half of the U.S.’s  $25 trillion payment volume. Meanwhile, retail e-commerce sales account for $4.2 trillion out of $26 trillion in total retail, or about 16.1%,  according to eMarketer. Less than  8% of global commerce is thought to occur online.\n You’d think B2B software companies would find a way to generate revenue on some of that $146 trillion in transactions, but most did not. Payment processing is its own, messy, complicated niche. Payfacs go through a grueling underwriting process to provision a merchant account, which includes know-your-customer (KYC) and anti-money laundering (AML) checks. If a merchant defaults, the payfac is next in line to make good on the transactions.\n  So, B2B platforms stayed clear. They formed integrations with a basket of payfacs (Stripe,  PayPal,   Square, my company BlueSnap, etc.) and then let their clients choose which one to use. That’s a lot of integrations to maintain.", "posttime": "2020-07-21 21:16:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,startups,支付", "title": "\n所有的b2b初创公司都在从事支付业务。", "title_en": "\n\t\t\t\tAll B2B startups are in the payments business\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/all-b2b-startups-are-in-the-payments-business/", "via": "", "real_tags": ["初创", "startups", "支付"]}, {"category": "", "categoryclass": "", "imagename": "72d1767b4c8f4e56905d9de64c535171.jpg", "infoid": 1013264, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "达珀实验室(Dapper Labs)首席执行官兼创始人罗姆·加雷戈兹卢(Roham-Gharegozlou)在一份声明中说，“随着世界日益网络化，消费者发现和收集数字纪念品的愿望也在增强，这些纪念品让他们离自己最喜欢的运动员、音乐家和标志性人物又近了一步。”“有了我们新的苏斯博士数字贴花体验，我们结合了两个世界最好的东西-让粉丝们互动，发现一些全新的东西，同时利用我们对童年时代意义重大的人物的集体怀旧之情。”我们很高兴能与苏斯博士企业公司合作，推出这项肯定会给世界各地的苏斯博士粉丝们带来欢乐的首次努力。“。\n今年9月，Dapper Labs从包括安德森·霍洛维茨(Andreessen Horowitz)的密码基金在内的一系列投资者那里筹集了1100万美元的融资，参与融资的投资者包括帮凶公司、AppWorks、Autonomy Partners、芬布希数字公司(Fenbushi Digital)和华纳音乐集团(Warner Music Group)。\n这些投资者紧随其后的是一系列其他风险公司，如联合广场风险投资公司(Union Square Ventures)、Venrock、数字货币集团(Digital Currency Group)、Animoca Brands、SV Angel、Version One和CoinFund等。\n据Gharegozlou称，这是投资者中的佼佼者，他们正在买入Dapper开发的名为“Flow”的基础平台，这是一种专为娱乐业设计的区块链。", "note_en": "“As the world moves increasingly online, so has consumers’ desire for discovering and collecting digital memorabilia that brings them one step closer to their favorite athletes, musicians and iconic characters,” said Roham Gharegozlou, the chief executive and founder of  Dapper Labs,   in a statement. “With our new Dr. Seuss digital decal experience, we are marrying the best of both worlds – allowing fans to interact and discover something entirely new, while tapping into our collective nostalgia for the characters that mean so much from our childhood. We are thrilled to be working alongside Dr. Seuss Enterprises to launch this first of its kind endeavour that is bound to bring joy to Dr. Seuss fans around the globe.”\n In September, Dapper Labs raised $11 million in financing from a slew of investors including  Andreessen Horowitz’s   crypto fund, with participation from investors including Accomplice, AppWorks, Autonomous Partners, Fenbushi Digital and Warner Music Group.\n Those investors followed on a slew of other venture firms like  Union Square Ventures,    Venrock,    Digital Currency Group,   Animoca Brands, SV Angel, Version One, and CoinFund, among others.\n That who’s who of investors are buying in to the underlying platform Dapper developed called “Flow”, a specialized blockchain designed for the entertainment industry, according to Gharegozlou.", "posttime": "2020-07-21 21:15:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "区块链,制造商,blockchain", "title": "\n多亏了Cryptokitties的制造商，Seuss博士来到了区块链", "title_en": "\n\t\t\t\tDr. Seuss comes to the blockchain thanks to the maker of Cryptokitties\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/dr-seuss-comes-to-the-blockchain-thanks-to-the-maker-of-cryptokitties/", "via": "", "real_tags": ["区块链", "制造商"]}, {"category": "", "categoryclass": "", "imagename": "9d501b662b28ef283ff8f9b92b0ca7bd.jpg", "infoid": 1013262, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，Reaction在Web开发领域已经存在了相当长的一段时间了。近年来，它作为敏捷Web开发工具的地位稳步加强。特别是在宣布和发布了新的钩子API/概念之后，编写组件变得前所未有的容易。\n尽管Reaction背后的团队和庞大的社区试图以令人印象深刻的方式培训和解释框架的概念，但我仍然看到在使用它时犯下的一些陷阱和常见错误。我保留了一个列表，列出了过去几年中我看到的所有与Reaction相关的错误，特别是与使用挂钩有关的错误。在这篇文章中，我想向您展示最常见的。我也会试着详细地解释，为什么我认为它们是错误的，并提出了一个更干净的方式做这件事的建议。\n在我们开始这个清单之前，我必须说，下面的大多数事情不是根本性的错误，或者乍一看不会看起来是错误的。其中大多数不太可能影响应用程序的性能或外观，可能除了从事产品开发的开发人员之外，没有人会注意到这里有问题，但我仍然相信，高质量的代码可以带来更好的开发人员体验，从而产生更好的产品。\n与任何软件框架或库一样，关于它也有数百万种不同的意见。你在这里看到的一切都是基于我个人的观点，不应该被认为是一般性的。如果你对她有不同的看法，我很乐意听听。如果你对她有不同的看法，我很乐意听听。\nReaction的核心概念之一是处理状态。您可以通过状态控制整个数据流和渲染。每次再次渲染树时，它很可能与状态更改相关联。\n使用useState挂钩，您现在还可以在函数组件中定义您的状态。这是在Reaction中处理状态的一种非常简洁和简单的方法。但它也可能被滥用，就像我们在下面的示例中看到的那样。\n对于下一个示例，我们需要一点解释，假设我们有两个按钮，一个按钮是计数器，另一个按钮用当前计数发送请求或触发操作。但是，当前数字永远不会显示在组件中。仅当您单击第二个按钮时才需要该请求。\n函数ClickButton(属性){const[count，setCount]=useState(0)；const onClickCount=()=&gt；{setCount((C)=&gt；c+1)；}；const onClickRequest=()=&gt；{apiCall(Count)；}；Return(计数器提交)；}\n乍一看，你可能会问这到底有什么问题？这难道不是为这个州而设的吗？你当然是对的，这个可以很好地工作，而且可能永远不会有问题。但是，在Reaction中，每个状态更改都将强制组件及其子组件重新提供程序。但在上面的示例中，由于我们从未在呈现部分中使用该状态，因此每次我们设置计数器时，最终都会出现不必要的呈现，这可能会影响性能，也可能会产生意想不到的副作用。\n如果您想在组件内使用一个变量，该变量应该在呈现之间保持其值不变，但也不想强制重新呈现，您可以使用useRef钩子。它将保留该值，但不会强制组件重新渲染。\n函数ClickButton(Props){const count=useRef(0)；const onClickCount=()=&gt；{count.current++；}；const onClickRequest=()=&gt；{apiCall(count.current)；}；Return(Counter Submit)；}", "note_en": "React has been out in the world of web development for quite some time now. Its position as a tool for agile web development has steadily strengthened in recent years. Especially after the announcement and release of the  new hook api/concept, writing components has never been easier.\n Although the team behind react and the huge community have tried to train and explain the concepts of the framework in an impressive way, I still see some pitfalls and common mistakes that were made while working with it.I kept a list of all the mistakes I saw over the last years related to react especially with using hooks. In this article I want to show you the most common ones. I will also try to explain in detail, why I think they are mistakes and a suggestion for doing it in a cleaner way.\n  Before we start with the list, I have to say that most of the following things are not fundamental mistakes or don&#39;t look wrong at first glance. Most of them are unlikely to affect the performance or apperance of the application.Probably nobody would notice, except for the developers working on the product, that something is wrong here, but I still believe that good quality code can lead to a better developer experience and thus to a better product.\n As with any software framework or library, there are millions of different opinions about it. Everything you see here is based on my personal opinion and should not be considered a general rule.If you have a different opinion about her, I would love to hear it 🌟\n  One of the core concepts of react is dealing with state. You can control your entire data flow and rendering through state. Each time the tree is rendered again, it is most likely tied to a change in state.\n With the  useState hook you can now also define your state in function components. Which is a really neat and easy way how to handle states in react. But it can also be misused as we see in the following example.\n For the next example we need a bit of explanation, suppose we have two buttons, one button is a counter and the other button sends a request or triggers an action with the current count. However, the current number is never displayed within the component. It is only required for the request when you click the second button.\n  function  ClickButton ( props )  {  const  [count , setCount ]  =  useState ( 0 ) ;  const  onClickCount  =  ( )  =&gt;  {  setCount ( ( c )  =&gt; c  +  1 ) ;  } ;  const  onClickRequest  =  ( )  =&gt;  {  apiCall (count ) ;  } ;  return  (      Counter     Submit      ) ; }\n  At first sight, you might ask what exactly is the problem with that? Isn&#39;t that what state was made for?Sure you are right, this will work just fine and probably there will never be a problem with that. However in react every state change will force a rerender for that component and most likely its children. But in the above example since we never use that state in our render part, this will end up being an unnecessary render every time we set the counter, which can impact the performance or could have unexpected side effects.\n  If you want to use a variable inside your component which should keep its value between rendering but also don&#39;t force a rerender, you can use the  useRef hook. It will keep the value, but doesn&#39;t force the component to rerender.\n function  ClickButton ( props )  {  const count  =  useRef ( 0 ) ;  const  onClickCount  =  ( )  =&gt;  { count .current ++ ;  } ;  const  onClickRequest  =  ( )  =&gt;  {  apiCall (count .current ) ;  } ;  return  (      Counter     Submit      ) ; }", "posttime": "2020-07-21 21:13:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "钩子,common,可能", "title": "在使用钩子进行写作时避免以下五个常见错误", "title_en": "Avoid these five common mistakes when writing react with hooks", "transed": 1, "url": "https://www.lorenzweiss.de/common_mistakes_react_hooks/", "via": "", "real_tags": ["钩子", "common", "可能"]}, {"category": "", "categoryclass": "", "imagename": "7912b08a0c2aacb9b6c41ae6ddbd7315.jpg", "infoid": 1013261, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于公司来说，监控其基础设施节点至关重要，特别是在公司没有现场访问权限以在出现问题时进行干预的情况下。事实上，某些资源的密集使用可能是故障或过度拥挤的迹象。但是，除了预防之外，还可以使用监控来评估新软件在生产环境中可能产生的影响。目前，市场上有几种“现成”的解决方案可以跟踪所有消耗的资源。这些看似合理的解决方案提出了两个关键问题：高昂的设置成本和与第三方相关的安全问题。\n第一个问题与成本有关。价格从每月10欧元到数千欧元不等，这取决于你需要监控的主机数量-前者是消费者定价，后者是企业定价。例如，假设我在一年中有三个节点要监控。每月10欧元，我会花120欧元。对于价格在每年1万至2万欧元之间的较小企业来说，这样的费用可能会膨胀其基本成本结构，并在财务上变得难以为继。\n第二个问题是第三方风险。通常，基础设施数据必须通过第三方公司才能为客户查看和分析-无论客户是个人消费者还是企业。第三方公司如何捕获数据并将其呈现给客户？简单地说，第三方公司通常通过安装在节点上并受到监控的自定义代理来收集数据。人们经常发现此安装不是最新的，并且与操作系统不兼容。之前的工作已经由安全研究人员完成，他们揭示了“专有收集器”的问题。你会相信他们吗？我不会的。\n在为ToR和某些加密货币保留节点时，我更喜欢选择一种免费、易于配置和开源的替代方案。在这里，我们将使用三元组：grafana、InfluxDB和Colltd。\n为了能够分析我们的基础设施的每一个指标，有必要使用一个能够捕获我们想要监视的机器的统计数据的程序。在这方面，Collectd对您很有帮助：它是一个守护进程，可以分组并收集(因此得名)所有可以存储在磁盘上或通过网络发送的参数。\n数据将被传输到InfluxDB的一个实例：一个特定的时间序列数据库，它将服务器接收数据的时间(以UNIX时间戳编码)与每个数据相关联。这样，COLLECTD发送的数据就已经以时间方式设置为一系列事件。\n最后，您将使用Grafana，它将连接到InfluxDB来创建华丽的仪表板，以用户友好的方式显示数据。通过各种直方图和图表，可以实时观察与CPU、RAM等相关的所有数据。\n让我们从InfluxDB开始，它是我们监视“系统”的心脏。InfluxDB是在GO中开发的开源时间序列数据库，用于将数据存储为事件序列。\n每次添加数据时，默认情况下它都链接到UNIX时间戳。这为用户提供了极大的灵活性，他们不再需要担心保存“时间”变量，例如，“时间”变量有时配置起来很麻烦。让我们设想一下，我们有几台机器分布在多个大洲。我们如何管理“时间”变量？我们所有的数据都使用格林威治子午线吗？或者我们是否为每个节点设置不同的时区？如果数据保存在不同的时区，我们如何准确地显示图表？如您所见，这可能非常复杂。\n作为一个自动为任何数据点添加时间戳的时间感知型数据库，InfluxDB具有同时写入特定数据库的优势。这就是为什么我们经常把InfluxDB想象成一个时间线。写入数据不会影响数据库的性能(在MySQL中有时会发生这种情况)，因为写入只是将特定事件添加到时间线中。这个程序的名字正是源于这样一个概念，即时间是一股流动的无限的、不确定的“流”。\nInflxuDB的另一个优势是易于安装，以及社区提供的广泛支持该项目的大量文档。它有两种类型的接口：Via Command Line(对于开发人员来说功能强大且灵活，但没有做好查看大量数据的准备)和允许与数据库直接通信的HTTP API。\nInfluxDB不仅可以从官方网站下载，也可以从发行版的包管理器下载(在本例中，我们使用的是Debian系统)。建议安装前通过GPG检查包，下面我们导入InfluxDB包的密钥：\n[电子邮件受保护]#~：cURL-SL https://repos.influxdata.com/influxdb.key|sudo APT-KEY ADD-[电子邮件受保护]#~：来源/etc/os-release[电子邮件受保护]#~：ECHO&#34；deb https://repos.influxdata.com/debian$(lsb_release-cs)稳定&#34；|sudo tee/etc/apt/Soures.list.d/influxdb.list。\n为了确保没有恶意人员进入，我们创建了用户“管理员”。InfluxDB使用一种名为“InfluxQL”的特定查询语言，类似于SQL，它允许您与数据库交互。要创建新条目，我们使用查询CREATE USER。\n[电子邮件受保护]#~：impxConnected to http://localhost:8086InfluxDB Shell版本：x.y.z&&gt;&gt；创建具有所有权限的密码为MYPASSISCOOL&#39；的用户ADMIN。\n从相同的CLI界面中，我们创建“指标”数据库，该数据库将用作指标的容器。\n接下来，让我们修改influxdb(/etc/fluxdb/fluxdb.conf)的配置，使接口在端口24589(Udp)上打开，直接连接到名为“metrics”的数据库，以支持集合体。您还需要下载tyes.db文件并将其放在/usr/share/Collect td/(或任何其他文件夹)中，以定义Collect以本机格式发送的数据。\n有关配置中Collectd块的详细信息，请参阅文档参考。\nCollectd是我们监控基础设施中的一个数据聚合器，它便于将数据传输到InfluxDB。默认情况下，Collectd捕获CPU、RAM、内存(在磁盘上)、网络接口、进程等指标。该程序的潜力是无穷无尽的，因为它可以通过预安装的插件启用或通过创建新插件进行扩展。\n让我们以一种简单化的方式来说明Colltd是如何工作的。假设我想检查我的节点有多少个进程。在执行此操作时，Collectd只需执行一个API调用即可获得每个时间单位的进程数(默认情况下定义为5000ms)。一旦捕获，数据将通过一个需要配置的模块(称为“Network”)发送到InfluxDB。\n使用我们的编辑器打开文件/etc/Collectd.conf，滚动以找到Network部分，然后按照以下代码片段中的内容进行编辑。请务必指定InfluxDB(INFLUXDB_IP)的接口所在的IP。\n我的建议是在配置中修改发送到InfluxDB的主机名(在我们的基础设施中，InfluxDB是一个“集中式”数据库，因为它驻留在单个节点上)。这样做，数据将不会是冗余的，并且不会有其他节点覆盖信息的风险。\n为了记住这句著名的“引语”，通过图表实时观察基础设施指标，使我们能够以高效和及时的方式采取行动。要创建和配置仪表板，我们将使用Grafana。\nGrafana是一个开源工具，与多种数据库(包括InfluxDB)兼容，它以图形方式表示指标，并允许用户在特定数据满足条件时创建警报。例如，如果您的CPU达到高峰，可以通过电子邮件等方式在Slake、MatterMost上通知您。事实上，每次有人进入SSH时，我都会亲自配置警报，这样我就可以主动监控谁“进入”了我的基础设施。\nGrafana不需要任何特殊设置：同样，是InfluxDB“扫描”“time”变量。集成非常简单。让我们首先导入公钥，从Grafana官网添加包(这取决于您使用的操作系统)：\n[电子邮件受保护]#~：wget-q-O-https://packages.grafana.com/gpg.key|sudo APT-KEY ADD-[电子邮件受保护]#~：ECHO&#34；Deb https://packages.grafana.com/oss/deb稳定主&34；|sudo tee-a/etc/apt/Soures.list.d/grafan a.list[电子邮件受保护]#~：apt-get update&amp；&amp；apt-get install grafana。\n接下来，当我们通过浏览器转到localhost：3000页面时，应该会看到grafana的登录界面。默认情况下，您应该使用admin作为用户名，使用admin作为密码(建议在第一次登录后更改密码)。\n现在，屏幕在New Dashboard的正下方显示一个绿色的小矩形。将鼠标悬停在此矩形上并选择添加面板，然后选择图形：\n现在将显示包含测试数据的图表。单击此图表的标题，然后选择编辑。Grafana允许编写智能查询：您不必知道数据库的每个字段，因为Grafana通过一个列表建议它们，您可以从列表中选择要分析的参数。\n编写查询从未像现在这样简单：只需选择您想要跟踪的度量，然后单击Refresh。我还建议按主机名区分指标，这样可以更容易地隔离任何问题。如果您正在寻找创建仪表板的其他想法，我建议您访问Grafana Showcase获取灵感。\n正如我们已经注意到的，Grafana是非常可扩展的，允许我们比较不同性质的数据。没有不能捕捉到的指标，所以创造力是你唯一的限制。监控您的机器，获得基础架构的通用实时视图！\n我真的要感谢Andrés的插图。", "note_en": "It is essential for a company to monitor its infrastructure nodes, especially if the company does not have on-site access to intervene when issues arise. In fact, the intensive use of some resources can be an indication of malfunctioning or overcrowding. However, in addition to prevention, monitoring could be used to assess possible implications of new software in the production environment. Currently, there are several “ready-to-use” solutions on the market to keep track of all the resources consumed. These solutions, which appear reasobable, present two key problems: the high price of setup and security issues related to third parties.\n The first problem is related to cost. Prices vary from 10 euros per month up to thousands depending on how many hosts you need to monitor — with the former being consumer pricing and the latter being enterprise pricing. So, for example, let’s imagine that I have three nodes to monitor during the course of a year. At 10 euros per month, I would spend 120 euros. For smaller enterprises, where the price can range between 10,000 and 20,000 euro per year, such an expense can bloat its underlying cost structure and become financially untenable.\n The second problem is third party risk. Typically, infrastructure data must pass through a third party company in order to be seen and analysed for the customer — whether that be an individual consumer or an enterprise. How does the third party company capture the data and then present it to the customer? Simply put, the third party company often collects data through a custom agent that is installed onto a node and monitored. Quite often is it found that this installation is not up-to-date and compatible with operating systems. Previous work has been done by security researchers who cast light upon problems with  “proprietary collectors”. Would you trust them? I would not.\n In keeping nodes for both  Tor and some  cryptocurrencies, I prefer to opt for a cost free, easy to configure, and open-source alternative. Here, we will use the triad: Grafana, InfluxDB, and CollectD.\n   In order to be able to analyse every metric of our infrastructure, it is necessary to use a program capable of capturing statistics on the machines we want to monitor. In this regard,  CollectD comes to your aid: it is a daemon that groups and collects (hence the name) all the parameters that can be stored on disk or sent over the network.\n The data will be transmitted to an instance of  InfluxDB: a particular time series database that associates to each data the time (coded in UNIX timestamp) in which the server received it. In this way, the data sent by CollectD will already be set in a temporal way, as a succession of events.\n Finally, you will use  Grafana which will connect to InfluxDB to create flashy dashboards to display the data in a user-friendly way. Through histograms and graphs of every kind, it will be possible to observe in real time all the data related to CPU, RAM, etc.\n       Let’s start with InfluxDB, which is the beating heart of our monitoring “system”. InfluxDB is a time series database  open-source developed in  Go to store data as a sequence of events.\n Each time data is added, it is linked to  a UNIX timestamp by default. This allows enormous flexibility for the user who no longer has to worry about saving, as an example, the “time” variable, which is sometimes cumbersome to configure. Let’s imagine we have several machines located in a number of continents. How do we manage the “time” variable? Do we use the  Greenwich meridian for all the data? Or do we set a different time zone for each node? If data is saved on different time zones, how can we accurately display the graphs? As you can see, this can be very complicated.\n As a time-aware database that automatically timestamps any data point, InfluxDB has the advantage of simultaneously being able to write to a certain database. This is why we often imagine InfluxDB as a timeline. Writing data does not affect the performance of the database (as sometimes happens in MySQL), since writing is simply the addition of a certain event to the timeline. The name of the program derives precisely from the conception of time as an infinite and indefinite “flow” that flows.\n  Another advantage of InflxuDB is the  ease of installation and the extensive  documentation provided by the community that widely supports the project. It has two types of interfaces: via  Command Line (which is powerful and flexible for developers, but poorly prepared to see large amounts of data) and an  HTTP API that allows direct communication with the database.\n InfluxDB can be downloaded not only from the official website, but also from the package manager of the distribution (in this example we use a Debian system). It is advisable to check the package via GPG before installation, so (below) we import the keys of the InfluxDB package:\n [email protected]#~: curl -sL https://repos.influxdata.com/influxdb.key | sudo apt-key add - [email protected]#~: source /etc/os-release [email protected]#~: echo  &#34;deb https://repos.influxdata.com/debian  $(lsb_release -cs )  stable&#34; | sudo tee /etc/apt/sources.list.d/influxdb.list\n     To make sure that no one nefarious enters, we create the user “administrator”. InfluxDB uses a particular query language called  “InfluxQL”, similar to SQL, which allows you to interact with the database. To create a new entry, we use the query   CREATE USER.\n [email protected]#~: influxConnected to http://localhost:8086InfluxDB shell version: x.y.z&gt;&gt; CREATE USER admin WITH PASSWORD  &#39;MYPASSISCOOL&#39; WITH ALL PRIVILEGES\n From the same CLI interface, we create the “metrics” database that will be used as a container for our metrics.\n  Next, let’s modify the configuration of InfluxDB ( /etc/influxdb/influxdb.conf) to have the interface open on port  24589 (UDP) with direct connection to the database named “metrics” in support of CollectD. You also need to download and place the  types.db file in  /usr/share/collectd/ (or any other folder) to define the data that  CollectD sends in native format.\n  For further information on the CollectD block within the configuration, see the  reference to documentation.\n      CollectD is a data aggregator, in our monitoring infrastructure, that facilitates the transmission of data to InfluxDB. By default, CollectD captures metrics on CPU, RAM, memory (on disk), network interfaces, processes, etc. The potential of the program is endless, given that it can be extended with a preinstalled  plugin enablement or through the  creation of new ones.\n   In a simplistic manner, let’s illustrate how CollectD works. Suppose that I want to check how many processes my node has. In doing so, CollectD does nothing more than make an API call to get the number of processes per time unit (defined as 5000 ms, by default). Once captured, the data will be sent to InfluxDB via a module (called “Network”) to be configured.\n Open the file  /etc/collectd.conf with our editor, scroll to find the  Network section, and edit as written in the following snippet. Be sure to specify the IP where the interface of InfluxDB ( INFLUXDB_IP) is located.\n  My suggestion is to modify, within the configuration, the hostname that is sent to InfluxDB (which in our infrastructure is a “centralized” database, since it resides on a single node). In doing so, the data will not be redundant and there is no risk that other nodes will overwrite the information.\n     In remembrance of this famous “quote”, observing the infrastructure metrics live through graphs and tables enables us to act in an efficient and timely manner. To create and configure the dashboard, we will use Grafana.\n Grafana is an open-source tool, compatible with a wide range of databases (including InfluxDB), that presents a graphical representation of metrics and allows a user to create alerts if a particular piece of data meets a condition. For example, if your CPU reaches high peaks, you can be notified on Slack, Mattermost, by email, etc. In fact, I have personally configured an alert every time someone enters SSH, so I can actively monitor who “enters” my infrastructure.\n Grafana does not require any special settings: once again, it is InfluxDB that “scans” the “time” variable. The integration is simple. Let’s start by import the public key to add the package from the  Grafana official website (it depends on the OS you are using):\n [email protected]#~: wget -q -O - https://packages.grafana.com/gpg.key | sudo apt-key add - [email protected]#~: echo  &#34;deb https://packages.grafana.com/oss/deb stable main&#34; | sudo tee -a /etc/apt/sources.list.d/grafana.list  [email protected]#~: apt-get update  &amp;&amp; apt-get install grafana\n   Next, as we go to the localhost:3000 page through the browser, we should be presented with a login interface for Grafana. By default, you should use  admin as username and  admin as password (it is advisable to change the password after the first login).\n     The screen now shows a small green rectangle just below the New Dashboard. Hover your mouse over this rectangle and select Add Panel, then Graph:\n  A graph with the test data is now shown. Click on the title of this chart and choose Edit. Grafana allows the writing of intelligent queries: you do not have to know every field of the database, as Grafana proposes them through a list from which you can choose the parameter to analyse.\n  Writing queries has never been easier: just select the measurement you would like to trace and click Refresh. I also recommend differentiating the metrics by hostname, so it is easier to isolate any problems. If you are looking for other ideas for creating dashboards, I recommend visiting  Grafana showcase for inspiration.\n As we have noticed, Grafana is very extensible and allows us to compare data of different nature. There is no metric that cannot be captured, so creativity is your only limit. Monitor your machine and get a universal, live view of your infrastructure!\n I really would like to thank  Andrés for his illustrations.", "posttime": "2020-07-21 21:12:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "grafana,infrastructure,influxdb", "title": "使用Grafana、InfluxDB和Collect监控您自己的基础架构", "title_en": "Monitoring your own infrastructure using Grafana, InfluxDB, and CollectD", "transed": 1, "url": "https://serhack.me/articles/monitoring-infrastructure-grafana-influxdb-connectd/", "via": "", "real_tags": ["grafana", "influxdb"]}, {"category": "", "categoryclass": "", "imagename": "18a8165a1f9b1b08f09ee985c674a9ef.jpg", "infoid": 1013260, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国的医生正在考虑是否罢工，抗议他们合同的拟议修改，他们正在伦敦游行，作为抗议活动的一部分。取消医疗保健对国家健康的可能影响是什么？医生们似乎在赌政府不想惊动选民。\n对医生罢工的医疗影响的最全面的评论发表在享有盛誉的学术期刊“社会科学与医学”上。由美国埃默里大学和乔治敦大学以及加拿大麦克马斯特大学的Solveig Cunningham和Salim Yusuf领导的一个团队分析了世界各地的五次医生罢工，都是在1976年至2003年之间。\n在分析的不同罢工中，医生从9天到17周之间撤回了他们的劳动力。然而，所有不同的研究都报告说，在医疗罢工期间，人口死亡率要么保持不变，要么甚至下降。没有一项研究发现，与其他时间相比，罢工几周内的死亡率有所上升。\n例如，1976年1月，加利福尼亚州洛杉矶县的医生举行罢工，抗议医疗事故保险费飙升。在五周的时间里，该县约50%的医生减少了执业，并拒绝为除紧急情况外的任何情况提供护理。坎宁安和他的同事引用的一项分析发现，罢工实际上可能阻止了比它造成的更多的死亡。\n这项名为“医生罢工与死亡：回顾”的研究表明，在医生罢工期间，选择性手术或非紧急手术往往会停止，这似乎是关键因素。这种手术的死亡率看起来令人惊讶，当医生撤回他们的劳动而停止择期手术时，这种手术就消失了。死亡率从第一周(21人/10万人口)稳步下降到第六周(13人)和第七周(14人)，当时死亡率低于前五年的平均水平。\n然而，一旦恢复择期手术，死亡人数就上升了。1976年罢工(即医生重返工作岗位)后的两周内，与手术相关的死亡人数比1975年同期增加了90人。\n但是，与洛杉矶不同的是，大多数医生都参加了罢工，罢工持续了几个月，医生们的劳工行动会带来什么影响呢？\n坎宁安和他的同事报告了1983年3月2日至6月26日在耶路撒冷发生的一次罢工，原因是政府和以色列医学会之间的工资纠纷。耶路撒冷11000名医生中有8000名拒绝在医院内治疗病人，尽管他们中的许多人设立了单独的救助站，在那里他们收费治疗紧急情况。\n一项分析检查了罢工期间(1983年2月16日至9月3日)周围几个月的死亡证明，以及前一年控制期(1982年2月17日至9月3日)的死亡证明。在罢工期间或之后，死亡率没有增加，即使是在选择性手术恢复时也是如此。\n控制期和罢工期间的罢工前死亡人数相同，为89人；罢工期间的死亡人数比控制期减少了6人，而在罢工后的10周内，死亡人数比1982年增加了7人。\n在医生罢工可能适得其反的一个例子中，这项特殊死亡分析的作者认为，罢工显然没有对死亡率产生影响，这表明当时耶路撒冷的医生供过于求。得出结论的问题仍然是，罢工并不涉及整个规模的医疗服务剥夺。\n坎宁安和他的同事在他们的综述论文中指出，罢工的医生开设了救助站，补充了医疗保健，并防止人们围攻医院。虽然从技术上讲，医生在争端的四个月内处于罢工状态，但事实上，大多数医生并没有遵守劳工行动规定。事实上，耶路撒冷的大多数医生都是在私人或部分私人的情况下提供护理的，因此，虽然他们参与了精神治疗，但实际上并没有撤回服务。\n另一项耐人寻味的研究通过研究“耶路撒冷邮报”关于另一次耶路撒冷医生罢工期间葬礼的报纸报道，分析了死亡率的变化。这次罢工发生在2000年3月至6月之间。这一问题源于以色列医学会与政府提出的工资方案的冲突。该地区的医院取消了所有选择性入院和手术，但保留了急诊室和其他重要部门，如透析单元和肿瘤科的开放。\n葬礼研究发现，与之前三年的同一个月相比，罢工三个月期间的葬礼数量有所下降。一个殡葬协会报告说，在罢工的一个月内(2000年5月)举行了93场葬礼，而1999年5月为153场，1998年5月为133场，1997年5月为139场。\n坎宁安和他的同事总结了他们对评估医生罢工对死亡率影响的研究综述，发现七项研究中有四项报告称，由于医疗-工业行动，死亡率有所下降，三项研究发现，在罢工期间或随后的一段时间内，死亡率没有显著变化。\n对于这一令人惊讶的发现，有几种可能的解释。一个是，由于它的选择性或非紧急手术，这通常是最有效的医生罢工，它的死亡率调查结果可能反映了选择性手术的影响。这些发现可能很重要，因为它们可能阐明了择期手术相对较高的风险，这实际上可能会增加死亡率。如果不是医生罢工，这可能是一个发现，具有讽刺意味的是，这一发现从未得到适当的强调。\n另一个发人深省的可能结论是，公众，也许还有医生自己，高估了药物延缓或影响死亡率的能力。\n然而，乔纳森·格鲁伯(Jonathan Gruber)和塞缪尔·克莱纳(Samuel Kleiner)使用纽约州1984至2004年期间的护士罢工分析了医院护士罢工对患者结局的影响。这篇题为“罢工会致命吗？”来自纽约州的证据发现，对于在罢工期间入院的患者，护士罢工使住院死亡率增加了19.4%，30天再入院时间增加了6.5%。来自麻省理工学院和卡内基梅隆大学的作者在他们发表在国家经济研究局15855号工作论文上的论文中得出结论，护士罢工期间的医院提供的病人护理质量更低。\n与医生相比，公众似乎更应该担心护士罢工，但讽刺的是，护士的收入似乎比医生少得多。\n正如坎宁安和他的同事在他们的综述论文中指出的那样，解释关于医生罢工的数据的问题是，在迄今为止研究的所有医疗罢工中，并不是所有的医生都放下了工具。在1976年的洛杉矶罢工中，只有50%的医生参与其中。因此，医生罢工并不一定会大幅减少获得医疗保健的机会。鉴于大多数罢工的目的是剥夺管理层对工人的劳动及其福利，这就提出了一个发人深省的问题：与其他职业相比，医生罢工到底能有多大效果。\n让医生像其他职业那样退出劳动非常困难，这暗示了与追求其他谋生方式相比，医生是什么样子的根本不同。对Striks的研究表明，医生不是你要做的事情，而是你本身。这个身份问题就是为什么医生简单地停止行医要困难得多。这是一个容易被政府和雇主利用的性格缺陷，有效地挫败了标准的工会策略。\n英国卫生部长杰里米·亨特(Jeremy Hunt)反对医生及其劳工行动的威胁；在最近一篇被广泛报道的评论中，他解释了为什么国家想要改变医生的合同，显然是为了在周末为医院提供更多的医疗保险。他说：“…。周末的医疗保险比他们(医生)在几周内少了三倍，这意味着如果你在周日入院，比在周三入院，你死亡的可能性要高出15%。\n与关于医生罢工的研究相比，数据显示在周末医生较少的情况下入院会导致更高的死亡率，这一数据确实有些自相矛盾。\n会不会是医药和医疗保健的组织方式，而不是简单地有很多医生在身边，才是根本问题？英国政府可能巧妙地转移了人们对英国医疗保健管理方式深层次问题的注意力，转而强调了迫使医生在周末到场的问题。\n另一个具有讽刺意味的是，来自医生罢工的数据本身表明，这个问题并不像部署更多医生意味着生命得到拯救那么简单。\n但是，目前英国医生和他们的国家雇主之间的冲突的结果可能取决于选民认为哪一方真正对照顾病人最感兴趣，而不是保护他们自己的利益。\n如果不是所有的医生都举行全面罢工，即使这样做可能符合他们的经济利益，这可能会向公众发出信号，表明在这件事上应该信任谁-他们的医生还是他们的政客。\n关于为什么医生罢工时病人的寿命会更长，另一种理论是，这个行业终于摆脱了雇主限制性做法的束缚，恢复了自由行医的状态，尽管只是暂时的，正如它真的想要的那样。\n也许，这实际上是医生所能采取的最有效的劳工行动。\n现在，拉杰·佩尔绍德和彼得·布鲁根在iTunes和Google Play上都有一款免费的应用程序，名为“对话中的拉杰·佩尔绍德”，其中包括大量关于精神健康最新研究成果的免费信息，以及对世界各地顶尖专家的采访。", "note_en": "Doctors in the U.K. are considering whether to strike over proposed changes in their contracts, and they are marching in London as part of the protest. What&#39;s the likely impact of withdrawing medical care on the health of the nation? Physicians seem to be gambling that the government doesn&#39;t want to alarm the electorate.\n   The most comprehensive review of the medical impact of doctors&#39; strikes is published in the prestigious academic journal  Social Science and Medicine. A team lead by Solveig Cunningham and Salim Yusuf at Emory and Georgetown Universities in the U.S. and McMaster University in Canada, analysed five physician strikes around the world, all between 1976 and 2003.\n  Doctors withdrew their labour, in the different strikes analysed, from between 9 days and 17 weeks. Yet all the different studies report population mortality either stays the same, or even decreases, during medical strikes. Not a single study found death rates increased during the weeks of the strikes, compared to other times.\n  For example, in Los Angeles County, California in January 1976, doctors went on strike in protest over soaring medical malpractice insurance premiums. For five weeks, approximately 50% of doctors in the county reduced their practice and withheld care for anything but emergencies. One analysis, quoted by Cunningham and colleagues, found the strike may have actually prevented more deaths than it caused.\n  The study entitled, &#34;Doctors&#39; strikes and mortality: A review,&#34; suggests that it&#39;s the fact that elective, or non-emergency surgery, tends to stop during a doctors&#39; strike, which seems to be the key factor. It looks like a surprising amount of mortality occurs following this kind of procedure which disappears when elective surgery ceases due to doctors withdrawing their labour. Mortality declined steadily from week one (21 deaths/100,000 population) to weeks six (13) and seven (14), when mortality rates were lower than the averages of the previous five years.\n   However, as soon as elective surgery resumed, there was a rise in deaths. There were 90 more deaths associated with surgery for the two weeks following the strike in 1976 (ie when doctors went back to work) than there had been during the same period in 1975.\n But, unlike Los Angeles, what about the impact of doctors&#39; industrial action where the majority of doctors participate, and the strike lasts several months?\n  Cunningham and colleagues report on a strike in Jerusalem from 2 March to 26 June 1983 due to a salary dispute between the government and the Israel Medical Association. 8000 of Jerusalem&#39;s 11,000 physicians refused to treat patients inside hospitals, though many of them set up separate aid stations where they treated emergency cases for a fee.\n  One analysis examined death certificates from several months surrounding the strike period, 16 February-3 September 1983, and from a control period the previous year, 17 February-3 September 1982. Mortality did not increase during or after the strike, even when elective surgery resumed.\n  The pre-strike deaths for the control period and the strike period were identical at 89; there were six fewer deaths during the strike than during the control period, while in the ten weeks following the strike, there were seven more deaths than there had been in 1982.\n In an example of how a doctor&#39;s strike can backfire, the authors of this particular mortality analysis argued this apparent lack of impact of the strike on mortality suggests that there was an over-supply of doctors in Jerusalem at the time. The problem with drawing conclusions remains that the strike did not involve the whole scale deprivation of medical services.\n  Cunningham and colleagues point out in their review paper that striking physicians opened aid stations, supplementing medical care, and preventing people from mobbing the hospitals. While physicians were technically on strike during the four months of the dispute, most did not, in fact, adhere to the industrial action regulations. In truth, most doctors in Jerusalem provided care in a private or partially private context, so, while participating in spirit, they did not actually withdraw services.\n  Another intriguing study analysed changes in mortality by studying the Jerusalem Post&#39;s newspaper reports of funerals during another Jerusalem doctors&#39; strike, this time between March and June of 2000. This one arose from the Israel Medical Association&#39;s conflict with the government&#39;s proposed wages. The hospitals in the area canceled all elective admissions and surgeries but kept emergency rooms and other vital departments, such as dialysis units and oncology departments, open.\n  The funeral study found a decline in the number of funerals during the three months of the strike, compared with the same months of the previous three years. One burial society reported 93 funerals during one month of the strike (May 2000) compared with 153 in May 1999, 133 in May of 1998, and 139 in May 1997.\n  Cunningham and colleagues summarise their review of research assessing the effects of doctors&#39; strikes on mortality, finding that four of the seven studies report mortality dropped as a result of medical-industrial action, and three observed no significant change in mortality during the strike or in the period following.\n   There are several possible interpretations of this surprising finding. One is that as its elective or non-emergency surgery which is usually most effected in a doctor&#39;s strike, it could be the mortality findings reflect an impact of elective surgery. The findings might be important because they perhaps illuminate the relatively high risks of elective surgeries, which may actually increase mortality. If it wasn&#39;t for doctor&#39;s strikes, this might be a finding, ironically never otherwise properly highlighted.\n  Another sobering possible conclusion is that the public, and perhaps doctors themselves, overestimate the ability of medicine to stave off or have an impact on mortality.\n However, Jonathan Gruber and Samuel Kleiner analysed the effects of nurses&#39; strikes in hospitals on patient outcomes using nurses&#39; strikes over the 1984 to 2004 period in New York State. The paper entitled, &#34;Do Strikes Kill? Evidence from New York State,&#34; found nurses&#39; strikes increase in-hospital mortality by 19.4% and 30-day readmission by 6.5% for patients admitted during a strike. The authors, from MIT and Carnegie Mellon University, conclude, in their paper published as National Bureau of Economic Research Working Paper No. 15855, that hospitals during nurses&#39; strikes are providing a lower quality of patient care.\n  It would seem the public should worry much more about nurses going on strike compared to doctors, yet the irony is, nurses seem to earn a lot less than doctors.\n The problem with interpreting the data, on doctors’ strikes, as Cunningham and colleagues point out in their review paper, in all medical strikes studied so far, not all doctors down tools. In the 1976 Los Angeles strike only 50% of physicians were involved. So doctors&#39; strikes don&#39;t necessarily drastically reduce access to health care. Given the purpose of most strikes is to deprive  management of the worker&#39;s labour, and it&#39;s benefits, this raises the sobering question of how effective a doctors&#39; strike can ever be in comparison to other occupations.\n  The very difficulty in getting physicians to withdraw their labour in the way other occupations can do, hints at a fundamental difference between what it is to be a doctor, compared to pursuing other ways of making a living. A doctor, the research on strikes illuminates, isn&#39;t something you do, it&#39;s something you are. This issue of  identity is why it&#39;s so much more difficult for doctors to simply discontinue practicing medicine. It&#39;s a character flaw prone to exploitation by governments and employers, effectively frustrating standard union tactics.\n  The Minister of Health in the U.K., Jeremy Hunt, is opposing the doctors and their threats of industrial action; in a recent comment widely reported, he explains why the state wants to change doctors’ contracts, apparently to provide more medical cover of hospitals at week-ends. He said: ‘…three times less medical cover at weekends as they (doctors) do in weeks and that means that there&#39;s a 15% greater chance of you dying if you are admitted on a Sunday, compared to being admitted on a Wednesday.’\n  There is indeed something paradoxical about the data showing that being admitted to hospital when there are fewer doctors at week-ends leads to greater mortality, compared to the research on doctors’ strikes.\n  Could it be that the way medicine and health care are organised, rather than simply having lots of doctors around, is the fundamental issue? The UK Government may have cleverly distracted  attention away from the deep problems over how healthcare is managed in the UK, by highlighting instead the issue of forcing doctors to be present at week-ends.\n  Yet another irony is that the data from doctors strikes themselves indicate the issue isn’t as simple as just deploying more doctors means lives get saved.\n But the outcome of the current conflict between doctors and their state employer in the U.K. may hinge on which side the electorate believes is genuinely most interested in looking after patients, as opposed to protecting their own interests.\n  If doctors don’t all go on complete strike, even when it could be in their financial interests to do so, this may signal to the public who to trust on this one – their doctors or their politicians.\n Another theory as to why patients live longer when doctors go on strike is that the profession finally shakes off the shackles of its employer&#39;s restrictive practices, and returns, albeit temporarily, to practicing medicine freely, as it would really like to.\n  And perhaps, that&#39;s actually the most effective sort of industrial action doctors can ever take.\n Raj Persaud and Peter Bruggen now have a free app on  iTunes and  Google Play entitled &#34;Raj Persaud in Conversation,&#34; which includes a lot of free information on the latest research findings in mental health, plus interviews with top experts from around the world.", "posttime": "2020-07-21 21:12:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罢工,stop,医生", "title": "为什么当医生罢工时，病人会停止死亡？(2015)", "title_en": "Why Do Patients Stop Dying When Doctors Go on Strike? (2015)", "transed": 1, "url": "https://www.psychologytoday.com/us/blog/slightly-blighty/201510/why-do-patients-stop-dying-when-doctors-go-strike", "via": "", "real_tags": ["罢工", "stop", "医生"]}, {"category": "", "categoryclass": "", "imagename": "69d2a9dcae329994d9e76f5c9054735b.jpg", "infoid": 1013259, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在1974年接受美国广播公司(ABC)采访时，科幻小说家阿瑟·C·克拉克(Arthur C.Clarke)大胆地宣称，有朝一日计算机将使人们能够在家工作，而且……", "note_en": "In this ABC interview from 1974, science fiction writer Arthur C. Clarke makes the bold claim that one day computers will allow people to work from home and ...", "posttime": "2020-07-21 21:11:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,放在,computer,美国广播公司", "title": "总有一天，一台电脑会放在桌子上(1974)[视频]", "title_en": "One day, a computer will fit on a desk (1974)[video]", "transed": 1, "url": "https://www.youtube.com/watch?v=sTdWQAKzESA", "via": "", "real_tags": ["电脑", "放在", "computer", "美国广播公司"]}, {"category": "", "categoryclass": "", "imagename": "5543c59f5febb1b645055452d0577971.jpg", "infoid": 1013258, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rich Hickey是Clojure的作者，是一名独立的软件设计师、顾问和应用程序架构师，在软件开发的各个方面都有20多年的经验。里奇从事过调度系统、广播自动化、音频分析和指纹识别、数据库设计、产量管理、出口投票系统和机器监听方面的工作。\n奇异循环是一个多学科的会议，旨在将开发人员和思想家聚集在一起，在新兴语言、替代数据库、并发、分布式系统、移动开发和网络等领域构建未来的技术。\n简单经常被错误地误认为容易。轻松意味着近在咫尺。简单意味着平易近人。简单是复杂的反义词，意思是缠绕在一起。简单=容易。\n软件中最重要的是：软件做了应该做的事情吗？它质量好吗？我们能靠得住吗？一路上的问题能解决吗？需求会随着时间的推移而改变吗？这些问题的答案是在编写软件时重要的是什么，而不是编写代码的体验的外观和感觉，或者它的文化含义。\n简单性的好处是：易于理解、易于更改、易于调试、灵活。\n简单的构造：值、函数、命名空间、数据、多态、托管引用、集合函数、队列、声明性数据操作、规则、一致性。\n通过以下方式构建简单的系统：抽象-通过回答与什么、谁、何时、何地、为什么和如何相关的问题进行设计。\n2：02&#34；Simple&34；的词根是&#34；sim&34；；和&#34；plex&34；的词根是&#34；one twist&34；的意思是&#34；one twist&34；的意思是&#34；one twist&34；。相反的，这将是复杂的，是多重缠绕或编织在一起的。\n2：30演讲的中心点是看软件是不是折叠在一起。\n2：54&#34；Easy&34；“的拉丁语起源是&#34；相邻&34；的词根，意思是&#34；躺在&#34；附近，而&#34；则在&#34；附近。\n3：34简单的事情只有一个作用。他们完成一个任务，他们有一个目标，他们涵盖一个概念。\n简单的事情可能是他们试图解决的多维问题的一个维度。\n4：12简单并不意味着独一无二。接口不必只有一个方法才能简单。基数在这里并不重要。重要的是不要让问题交织在一起。\n5：16 Easy的由来暗示着近在咫尺，靠近的东西可以很容易地触摸或抓到。(这句话的意思是“容易”的意思是“靠近”的意思是：靠近的东西很容易摸到或抓到。)。\n5：58在软件开发中，Easy意味着接近我们的理解，掌握我们的技能，熟悉我们。\n6：20 Easy在软件业被高估了。我能在5秒内让它运行起来吗？&#34；如果结果是一大团泥球，那也没有关系。重要的是动作要快。\n所有的新事物都有些陌生。即使一开始很难掌握或做，也不要回避。\n7：14人们说一些超出他们能力范围的事情通常会感到不舒服。\n8：17容易是一个相对的术语。有些事情对某人来说可能是容易的，对另一些人来说可能是困难的。\n8：44很多时候，开发人员说有些东西很简单，但他们的意思是简单，因为他们的意思是他们熟悉的东西。\n9：05在处理软件构造和工件时，简单和容易之间的区别是相关的。\n9：36工件的属性是它如何运行，它的性能是什么，它可以如何随着时间的推移而改变。这些属性不是原始构造(代码)。\n10：06人们把太多的注意力放在构造上，他们写东西有多容易，或者用一个开发人员替换一个开发人员有多容易，只考虑了所使用的工具的熟悉程度，而不考虑新开发人员需要处理的代码的简单或复杂。\n我们应该问自己这些问题：软件做了应该做的事情吗？它质量好吗？我们能靠得住吗？一路上的问题能解决吗？需求会随着时间的推移而改变吗？这些问题的答案是在编写软件时重要的是什么，而不是编写代码的体验的外观和感觉，或者它的文化含义。\n12：34&#34；我们只能希望让我们理解的事情变得可靠。这通常是需要权衡的。当发展一个系统，使其更具可扩展性和动态性时，可能会变得更难理解和决定它是否正确。\n13：24人一次只能变戏法做几件事，很少。一个人一次能想到的事情的数量也是如此。当事情交织在一起时，这就变得更加困难，因为人们不能孤立地对它们进行推理。\n14：35为了能够更改现有的软件，您需要了解它，并决定如何以及在哪里应用更改。如果一个人不能对一个计划进行推理，他可以做出那些决定。\n15：45问：外面的每一个虫子都发生了什么？答：它通过了类型检查，并且通过了所有测试。\n17：35只有跑得很短的人才能从比赛开始就使用他们的最大速度。一些人试图通过每100码发射发令枪来欺骗生活，并称之为新的冲刺。\n18：50如果你选择轻松，事情会进展得很快，但随着时间的推移，累积的复杂性会扼杀项目。如果选择简单性，项目开始的速度会更慢，因为人们必须仔细考虑。\n19：35简单的事情可能很复杂。可以有描述简洁、熟悉、可用且易于使用的复杂构造。这是附带的复杂性。\n简单的好处是：易于理解、易于更改、易于调试、灵活。\n我们可以把它们带到手边，通过学习变得熟悉，从而使事情变得更容易。\n我们不能突然改变我们的大脑去理解一些复杂的东西。我们需要简化复杂性，这样我们才能处理它。\n因为我们同时处理多少球是有限的，我们需要决定我们想要多少附带复杂性与问题复杂性。\n28：08程序员喜欢只强调新工具或新方法的好处，但他们很少提到缺点或权衡。\n28：50复杂：状态、对象、方法、变量、继承、切换、匹配、语法、命令性循环、参与者、ORM、条件、不一致。更简单：值、函数、命名空间、托管引用、多态性、数据、集函数、队列、声明性数据操作、规则、一致性。\n33：08完成的意思是把辫子编在一起。作曲的意思是把……放在一起。如果模块高度互连，则组成模块化组件并不简单。\n35：40状态很容易，但会带来复杂性，因为它交织着价值和时间。状态与它直接或间接接触到的一切交织在一起，模块和封装不会减轻它的影响。\n42：58人们可以用更简单的工具更好地编写复杂的系统，这些工具让人们专注于系统，而不是语言或工具的构造。\n47：22我们需要学会忍受环境的复杂性：CPU、内存、与实现相关的固有复杂性(例如GC)等等。\n通过以下方式构建简单的系统：抽象-通过回答与什么、谁、何时、何地、为什么以及如何相关的问题进行设计。\n50：38回答什么应该使用可用的构造-接口、协议、类型类-来创建函数集，并使它们成为抽象。\n该怎么做，以后由你自己或别人来解决吧。\n52：40回答构建较大组件时由谁负责，将子组件作为参数传递。不要硬把他们和他们的父母连在一起。\n56：06信息很简单。保持简单。不要使用对象来处理信息。这不是物体的本意。我们需要创建处理信息的泛型结构。您只需构建它们一次，然后重用它们。对象增加了该领域的复杂性。\n57：00如果您有地图，请使用地图构造。不要为其创建对象。将数据保留为数据。不要将数据逻辑与其表示联系起来。避免ORM。\n57：20选择简单的工具。写一些简单的东西。把别人的工作理顺，使之简单化。\n简约是一种选择。我们有一种复杂的文化。避免使用工具(语言、构造等)。会产生复杂的输出。简单！=简单。寻找复杂性并避免它。可靠性工具--测试、重构、类型系统--是好的，但却是次要的。他们不强制要求简单性。它们只是一张安全网。", "note_en": "Rich Hickey, the author of Clojure, is an independent software designer, consultant and application architect with over 20 years of experience in all facets of software development. Rich has worked on scheduling systems, broadcast automation, audio analysis and fingerprinting, database design, yield management, exit poll systems, and machine listening.\n  Strange Loop is a multi-disciplinary conference that aims to bring together the developers and thinkers building tomorrow&#39;s technology in fields such as emerging languages, alternative databases, concurrency, distributed systems, mobile development, and the web.\n    Simple is often erroneously mistaken for easy. &#34;Easy&#34; means &#34;to be at hand&#34;, &#34;to be approachable&#34;. &#34;Simple&#34; is the opposite of &#34;complex&#34; which means &#34;being intertwined&#34;, &#34;being tied together&#34;. Simple != easy.\n  What matters in software is: does the software do what is supposed to do? Is it of high quality? Can we rely on it? Can problems be fixed along the way? Can requirements change over time? The answers to these questions is what matters in writing software not the look and feel of the experience writing the code or the cultural implications of it.\n  The benefits of simplicity are: ease of understanding, ease of change, ease of debugging, flexibility.\n    Simple constructs: Values, Functions, Namespaces, Data, Polymorphism, Managed refs, Set functions, Queues, Declarative data manipulation, Rules, Consistency.\n  Build simple systems by: \r\t Abstracting - design by answering questions related to what, who, when, where, why, and how.\n      2:02 The roots of &#34;simple&#34; are &#34;sim&#34; and &#34;plex&#34;, and means &#34;one twist&#34;. The opposite, which would be complex, is &#34;multiple twists&#34; or &#34;braided together&#34;.\n  2:30 The central point of the talk is seeing software as being folded together or not.\n    2:54 The latin origin of &#34;easy&#34; is the root of &#34;adjacent&#34;, which means &#34;to lie near&#34; and &#34;to be nearby&#34;.\n    3:34 Simple things are those which have one role. They fulfill one task, they have one objective, they cover one concept.\n  3:56 Simple things may be one dimension of a multi-dimensional problem they attempt to solve.\n    4:12 Simple does not mean one of a kind. An interface does not have to have only one method to be simple. Cardinality does not matter here. What is important is not to have interleaving of issues.\n    5:16 The origin of &#34;easy&#34; implies &#34;nearness&#34;. Something that is near can be easily touched or grabbed.\n    5:58 In software development, easy means being near to our understanding, being in our skillset, being familiar.\n  6:20 Easy is overrated in the software industry. &#34;Can I get this running in 5 seconds?&#34; It does not matter if the result is a large ball of mud. All it matters is to be done quickly.\n  7:03 All that is new is somewhat unfamiliar. Do not avoid it even if it is harder to grasp or do at first.\n  7:14 People usually feel uncomfortably to say about something that it is beyond their capabilities.\n  8:17 Easy is a relative term. Something may be easy for someone and difficult for someone else.\n  8:44 Many times, developers say about some that is simple, but they mean easy, because they mean it is something they are familiar with.\n  9:05 The distinction between simple and easy is relevant when dealing with software constructs and artifacts.\n  9:36 The attributes of an artifact are how it runs, what&#39;s the performance, how it can be changed over time. These attributes are not the original construct (code).\n  10:06 People focus too much on the construct, on how easily they can write something or how easily is to replace one developer with another, considering just the familiarity of the tools used, not the simplicity or complexity of the code the new developer needs to deal with.\n    11:36 We should ask ourselves these questions: does the software do what is supposed to do? Is it of high quality? Can we rely on it? Can problems be fixed along the way? Can requirements change over time? The answers to these questions is what matters in writing software not the look and feel of the experience writing the code or the cultural implications of it.\n  12:34 &#34;We can only hope to make reliable those things we understand&#34;. And there is usually a tradeoff. When evolving a system, making it more extensible and dynamic, it may become harder to understand and decide if it is correct.\n  13:24 People can juggle only a few things at a time, a small number. The same with the number of things one can think of at one time. That becomes even harder when things are intertwined, because one cannot reason about them in isolation.\n    14:35 To be able to change existing software one needs to understand it and decide how and where to apply changes. If one cannot reason about a program, he can make those decisions.\n  15:45 Q: What happened to every bug out there? A: it passed the type checker, and it passed all tests.\n    17:35 Only people running very short races can use their maximum speed from the beginning of the race. Some attempt to cheat life by firing the starting gun every 100 yards and call it a new sprint.\n    18:50 If one chooses easiness, things move fast but accumulated complexity will kill the project over time. If simplicity is chosen, the project starts slower because one has to think things over.\n  19:35 Easy things can be complex. There can be complex constructs that are succinctly described, familiar, available and easy to use. That is incidental complexity.\n  21:31 The benefits of simplicity are: ease of understanding, ease of change, ease of debugging, flexibility.\n  22:35 We can make things easier by bringing them at hand, by becoming familiar through learning.\n  23:19 We can’t suddenly change our brain to grasp something complex. We need to simplify complexity so we can handle it.\n  24:24 Because we are limited in how many balls we can juggle in the same time, we need to decide how much incidental complexity vs. problem complexity we want.\n    28:08 Programmers like to emphasize only the benefits of a new new tool or method, but they rarely mention the downsides or the tradeoffs.\n  28:50 Complex: state, objects, methods, vars, inheritance, switch, matching, syntax, imperative loops, actors, ORM, conditionals, inconsistency. Simpler: values, functions, namespaces, managed refs, polymorphism, data, set functions, queues, declarative data manipulation, rules, consistency.\n    33:08 Complect means to braid together. Compose means to place together. Composing modular components is not simple if the modules are highly interconnected.\n    35:40 State is easy but introduces complexity because it intertwines value and time. State intertwines everything it touches directly or indirectly, and it is not mitigated by modules and encapsulation.\n        42:58 One can better write sophisticated systems with simpler tools that let one focus on the system rather the constructs of the language or tool.\n        47:22 One needs to learn to live with environmental complexity: CPU, memory, inherent complexity related to implementation (GC, for example), etc.\n    49:17 Build simple systems by: \r\r\t Abstracting - design by answering questions related to what, who, when, where, why, and how\n  50:38 Answering What \r\t Use the constructs available - interfaces, protocols, type classes - to create sets of functions, and make them abstractions.\n            Let how is to be done to be solved later by yourself or someone else.\n  52:40 Answering Who \r\t When building larger components, pass the subcomponents as arguments. Do not hardwire them into their parents.\n        56:06 Information is simple. Keep it simple. Don’t use an object to handle information. That’s not what objects were meant for. We need to create generic constructs that manipulate information. You build them once and reuse them. Objects raise complexity in that area.\n  57:00 If you have a map, use a map construct. Don’t create an object for it. Leave data as data. Do not tie data logic to its representation. Avoid ORM.\n  57:20 Choose simple tools. Write simple stuff. Simplify other people’s work by disentangle it.\n  58:10 Simplicity is a choice. We have a culture of complexity. Avoid tools (languages, constructs, etc.) that generate complex outputs. Simple != easy. Look for complexity and avoid it. Reliability tools - testing, refactoring, type systems - are good but secondary. They do not enforce simplicity. They are just a safety net.", "posttime": "2020-07-21 21:11:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "简单易行,simple,复杂性", "title": "简单易行(2011)", "title_en": "Simple Made Easy (2011)", "transed": 1, "url": "https://www.infoq.com/presentations/Simple-Made-Easy/", "via": "", "real_tags": ["简单易行", "simple", "复杂性"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013255, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Phil WinterBottom和Rob Pike Bell Labs，Lucent Technologies{Philw，rob}@plan9.bell-labs.com虚拟机是现代便携式环境(如Inferno和Java)的重要组件，因为它们提供独立于体系结构的可执行代码表示。它们的性能对这类环境的成功至关重要，但它们很难设计好，因为它们受相互冲突的目标的影响。一方面，它们提供了一种隐藏指令体系结构之间差异的方法；另一方面，它们必须在各种底层机器上有效地实现。通过对Inferno和Java虚拟机的工程设计和发展进行比较，可以深入了解它们在设计和实现方面的权衡。我们认为，虚拟机的设计应该植根于现代处理器的本质，而不是语言解释器，着眼于即时编译，而不是解释或特殊用途的硅。1995年初，我们开始将Plan9操作系统[1]的思想应用于更广泛的设备和网络。由此产生的系统Inferno[2]是一个小型操作系统和执行环境，支持跨多种处理器和操作系统的应用程序可移植性。由于没有从Oak项目的技术中意识到建立Java的当代工作[3]，我们独立地得出结论，虚拟机(VM)是这样一个系统的必要组件[4]。由于处理器速度的提高和动态编译器的可行性，VM可以足够快地执行，从而在经济上是可行的。名为Dis的Inferno虚拟机在设计上有几个不同寻常的方面：指令集、模块系统和垃圾收集器。Dis指令集与现有处理器的体系结构非常匹配。指令的形式如下：src1和dst操作数指定一般地址或任意大小的常量，而src2操作数被限制为较小的常量和堆栈偏移量，以减少代码空间。每个操作数在执行过程的堆栈帧或其模块的全局数据中指定一个地址。操作数的类型由指令设置。基本类型有WORD(32位有符号)、BIG(64位有符号)、BYTE(8位无符号)、REAL(64位IEEE浮点)和指针(取决于实现)。该指令集遵循CISC处理器的示例，为算术、数据移动等提供三个操作数的内存到内存操作。它还包含分配内存、加载模块以及创建、同步和进程间通信的指令。模块是动态加载的代码和数据的单元。模块由VM指令加载，该指令返回指向模块的方法表的指针。该指针由VM的垃圾收集器管理，因此模块的代码和数据像任何其他内存一样被垃圾收集。通过在模块加载时使用类型的MD5签名检查方法类型，可以保护类型安全。内存管理与虚拟机的指令集紧密相关。DIS使用混合垃圾收集方案：大多数垃圾通过简单的引用计数来收集，而实时着色收集器收集循环数据。因为引用计数是一种精确的垃圾收集形式，而不是保守的形式，所以VM运行时系统必须知道所有数据项的类型。因此，语言到VM编译器为所有复合类型生成类型描述符。此描述符会报告类型中所有指针的位置，从而允许VM在复制项时跟踪引用。内存控制着小型系统的成本，因此虚拟机的设计应尽可能保持较低的内存使用量。通过引用计数垃圾收集，Dis在内存闲置时回收内存。引用计数还消除了高效标记和清除收集所需的大舞台需求。这两个结果都降低了VM及其应用程序的内存需求。与Java VM相比，Java VM的指令集使得在复制对象时很难跟踪引用。这不利于引用计数，因此JVM实现选择了更懒惰的技术，如标记和清除、导致更大的竞技场和延迟收集，这两者都会增加内存使用，从而增加整个系统的成本。解释基于堆栈的虚拟机(SM)(如Java虚拟机(JVM))的各个指令很容易，因为大多数操作数都是隐式的。然而，解释器的高级语言实现比诸如Dis的存储器传送机(MM)中的等效指令集产生更多的存储器通信量。考虑到执行SM的代码将通过这样的代码突发来执行此操作，我们使用L表示加载，S表示s来注释它的内存流量", "note_en": "Phil Winterbottom and Rob Pike Bell Labs, Lucent Technologies  {philw,rob}@plan9.bell-labs.com Virtual machines are an important component of modern portable environments such as Inferno and Java because they provide an architecture-independent representation of executable code. Their performance is critical to the success of such environments, but they are difficult to design well because they are subject to conflicting goals. On the one hand, they offer a way to hide the differences between instruction architectures; on the other, they must be implemented efficiently on a variety of underlying machines. A comparison of the engineering and evolution of the Inferno and Java virtual machines provides insight into the tradeoffs in their design and implementation. We argue that the design of virtual machines should be rooted in the nature of modern processors, not language interpreters, with an eye towards on-the-fly compilation rather than interpretation or special-purpose silicon. In early 1995, we set out to apply the ideas of the Plan 9 operating system [1] to a wider range of devices and networks. The resulting system, Inferno [2], is a small operating system and execution environment that supports application portability across a wide variety of processors and operating systems. Unaware of the contemporary work to establish Java [3] from the technology of the Oak project, we independently concluded that a virtual machine (VM) was a necessary component of such a system [4]. Because of improvements in processor speed and the feasibility of on-the-fly compilers, a VM can execute quickly enough to be economically viable. The Inferno virtual machine, called Dis, has several unusual aspects to its design: the instruction set, the module system, and the garbage collector. The Dis instruction set provides a close match to the architecture of existing processors. Instructions are of the form The  src1 and  dst operands specify general addresses or arbitrary-sized constants, while the  src2 operand is restricted to smaller constants and stack offsets to reduce code space. Each operand specifies an address either in the stack frame of the executing procedure or in the global data of its module. The types of operands are set by the instructions. Basic types are  word (32-bit signed),  big (64-bit signed),  byte (8-bit unsigned),  real (64-bit IEEE floating point), and pointer (implementation-dependent). The instruction set follows the example of CISC processors, providing three-operand memory-to-memory operations for arithmetic, data motion, and so on. It also has instructions to allocate memory, to load modules, and to create, synchronize, and communicate between processes. A module is the unit of dynamically loaded code and data. Modules are loaded by a VM instruction that returns a pointer to a method table for the module. That pointer is managed by the VM&#39;s garbage collector, so code and data for the module are garbage collected like any other memory. Type safety is preserved by checking method types at module load time using an MD5 signature of the type.  Memory management is intimately tied to the instruction set of the VM. Dis uses a hybrid garbage collection scheme: most garbage is collected by simple reference counting, while a real-time coloring collector gathers cyclic data. Because reference counting is an exact rather than conservative form of garbage collection, the type of all data items must be known to the VM run-time system. For this reason, the language-to-VM compiler generates a type descriptor for all compound types. This descriptor reports the location of all pointers within the type, allowing the VM to track references as items are copied. Memory dominates the cost of small systems, so the VM should be designed to keep memory usage as small as possible. Through reference-counted garbage collection, Dis reclaims memory the moment it becomes unused. Reference counting also eliminates the need for a large arena as required for efficient mark-and-sweep collection. Both these results reduce the memory requirements of the VM and its applications. Compare this to the Java VM, whose instruction set makes it difficult to track references as objects are copied. This biases against reference counting, so JVM implementations choose lazier techniques such as mark-and-sweep, inducing a larger arena and delayed collection, both of which increase the memory use and therefore the cost of the overall system. It is easy to interpret the individual instructions of a stack-based virtual machine (SM) such as the Java virtual machine (JVM), because most operands are implicit. However, a high-level language implementation of the interpreter generates more memory traffic than the equivalent set of instructions in a memory transfer machine (MM) such as Dis. Consider the code to execute An SM would execute this by a code burst such as this, which we have annotated with its memory traffic using L for load and S for store: push a # LS \tpush b # LS \tadd # LLS \tstore c # LS\n The corresponding MM code burst would be the plain three-operand instruction When interpreting, the extra memory traffic of the SM is masked by the time saved by not decoding any operand fields. The operand fields are implicit in the SM instructions, while the MM they are explicit: three operand fields must be decoded in every instruction, even those without operands. When compiling, the tradeoffs are different. Clearly, either design can produce the same native instructions from its just-in-time compiler (JIT), but in the SM case most of the work must be done in the JIT, whereas in the MM design the front end has done most of the work and the JIT can be substantially simpler and faster. A JIT for an SM is forced to do most of the work of register allocation in the JIT itself. Because the types of stack cells change as the program executes, the JIT must track their types as it compiles. In an MM, however, the architecture maps well to native instructions. This produces a continuum of register allocation strategies from none, to simple mapping of known cells to registers, to flow-based register allocation. Most of the work of any of these strategies can be done in the language-to-VM compiler. It can generate code for an infinite-register machine, and the JIT can then allocate as many as are available in the native architecture. Again, this distribution of work keeps the JIT simple.  The same issues that face the JIT writer also face the designer of special-purpose processors to support a VM. Register allocation in the JIT is analogous to register relabeling in silicon, and an SM design adds unnecessary complexity to an already difficult problem. One might argue that a stack-based processor design would mitigate the difficulties, but our experience with the implementation of a stack machine in the AT&amp;T Crisp microprocessor [5] leads us to believe that stack architectures are inherently slower than register-based machines. Their design lengthens the critical path by replacing simple registers with a complex stack cache mechanism. In other words, it is a better idea to match the design of the VM to the processor than the other way around. Dis fits this criterion better, but we do not plan to implement Dis in silicon. The idea of a VM is to be architecture-independent; offering a special processor to run it negates the original goal by favoring one instruction set. Ignoring that for the moment, though, there could still be two reasons to consider designing silicon for Dis: performance and cost. On performance, history shows that language-specific CPUs are not competitive. The investment in the special design takes energy away from the systems issues that ultimately dominate performance. Performance gains realized through language-specific support tend to be offset by parallel improvements in general-purpose processors during the life cycle of the CPU. Dis compiles quickly into native code that runs only 30-50% slower than native C. At the current rate of processor improvement, that is only a few months of processor design time. It is wiser to focus on improving execution on commodity, general purpose processors than on inventing a new architecture. The issue of cost is more subtle. Dis is close enough to familiar architectures that a special chip with high integration of systems facilities could be cost-effective on small platforms. The real reason for that, though, is that the memory management design of the virtual machine makes it easy to implement Dis in small memory. By contrast, whatever cost gains an integrated Java processor might realize will likely be lost in the extra memory required by its conservative garbage collection scheme [6].  1. R. Pike, D. Presotto, S. Dorward, B. Flandrena, K. Thompson, H. Trickey, and P. Winterbottom. ``Plan 9 from Bell Labs&#39;&#39;,   J. Computing Systems  8:3, Summer 1995, pp. 221-254.", "posttime": "2020-07-21 21:10:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,设计,inferno,vm", "title": "Inferno虚拟机的设计", "title_en": "Design of the Inferno Virtual Machine", "transed": 1, "url": "http://www.herpolhode.com/rob/hotchips.html", "via": "", "real_tags": ["虚拟机", "设计", "inferno", "vm"]}, {"category": "", "categoryclass": "", "imagename": "5aeae10db7f576384a9a30dd751b4337.jpg", "infoid": 1013254, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据开发这种疗法的英国公司的说法，一项临床试验的初步结果表明，一种针对新冠肺炎的新疗法减少了需要重症监护的患者数量。\n南安普顿生物技术公司Synairgen的治疗方法使用了一种名为β干扰素的蛋白质，这种蛋白质是人体在感染病毒时产生的。\n使用雾化器将这种蛋白质直接吸入到冠状病毒患者的肺部，希望它能刺激免疫反应。\n初步研究结果表明，这种治疗将住院的新冠肺炎患者罹患严重疾病(如需要通气)的几率降低了79%。\nSynairgen声称，患者恢复到日常活动不受疾病影响的可能性是对照组的两到三倍。\n它说，这项试验还表明，在接受治疗的患者中，呼吸困难的减少非常显著。\n此外，对于那些接受新药治疗的患者来说，据说患者平均住院时间减少了三分之一-从平均9天下降到6天。\n这项双盲试验有101名志愿者参加，他们因新冠肺炎感染而在英国9家医院接受治疗。\n一半的参与者服用了这种药物，另一半服用了所谓的安慰剂-一种非活性物质。\n股票市场规则意味着Synairgen有义务报告试验的初步结果。\n这一结果还没有发表在同行评议的期刊上，也没有完整的数据可用；因此BBC无法证实这种治疗的说法。\n但如果结果像该公司所说的那样，这将是在治疗冠状病毒感染方面向前迈出的非常重要的一步。\n负责这项试验的科学家汤姆·威尔金森(Tom Wilkinson)表示，如果这一结果在更大规模的研究中得到证实，新的治疗方法将改变游戏规则。\n他说，试验规模相对较小，但治疗有益于患者的信号异常强烈。\nSynairgen首席执行官理查德·马斯登(Richard Marsden)告诉BBC，我们不能指望比这些更好的结果了。\n他将这一结果描述为新冠肺炎住院患者治疗方面的一项重大突破。\n马斯登表示，该公司将在未来几天向世界各地的医疗监管机构提交其调查结果，看看他们需要哪些进一步的信息才能批准这种治疗。\n这个过程可能需要几个月的时间，尽管英国政府和其他许多国家一样，已经表示将尽快让有前途的冠状病毒治疗方法获得批准。\n它有可能获得紧急批准，就像抗病毒药物redesivir在5月份那样。\n另一种可能性是允许更多的患者接受治疗，并仔细监测疗效，以确认其安全有效。\n如果它真的获得批准，那么用于运送它的药物和喷雾器将需要大量生产。\n马斯登表示，他早在4月份就指示企业开始生产供应品，以确保在结果积极的情况下能够获得供应品。\n他说，他预计Synairgen到冬天每月能提供10万剂。\n干扰素β是人体抵御病毒的第一道防线的一部分，它警告身体可能会受到病毒的攻击。\n冠状病毒似乎抑制了它的产生，这是它逃避我们免疫系统的策略的一部分。\n这种新药是一种特殊的β干扰素配方，通过雾化器直接将干扰素输送到气道，使蛋白质形成气雾剂。\n这个想法是，在肺部直接注射这种蛋白质将触发更强的抗病毒反应，即使是在免疫系统已经很弱的患者中也是如此。\nSynairgen之前进行的临床试验表明，它可以刺激免疫反应，哮喘和其他慢性肺部疾病的患者可以舒适地耐受这种治疗。\n在试验结束之前，参与试验的人都不知道哪些患者接受了哪些治疗。\n南安普顿医院给病人服用这种新药的护士之一桑迪·艾特肯(Sandy Aitken)解释说，如果你知道它是一种药物，你的头脑可能会有偏见。\nSynairgen的药物试验是雅阁计划的模板，该计划是英国政府在4月份设立的一项快速临床试验计划，旨在加快新冠肺炎患者的新药开发。\nSynairgen研究小组相信，这种药物在感染的早期阶段可能会更有效。\n一项旨在探索一旦确认患有新冠肺炎就给高危人群服用新药的效果的试验，一直在努力寻找志愿者，因为目前新的感染病例太少了。\n来自谢菲尔德大学的急救医学专家史蒂夫·古达克教授说：这些结果无法解释。我们需要完整的细节，也许更重要的是，试验方案。在进行任何分析之前，试验应该已经登记，并提供了一个可用的方案。\n格拉斯哥大学新陈代谢医学教授纳维德·萨塔尔教授说：结果似乎非常令人印象深刻，尽管人们承认这项试验规模很小，只有100多人参加，但疾病严重程度降低79%可能会改变游戏规则。\n看到完整的结果一旦公布并经过同行评审，以确保它们是健壮的，试验行为是严格的，那将是一件好事。此外，随着数字的减少，真正的收益水平也就不那么确定了，或者不同风险特征的人之间的收益是否有所不同。这样的工作需要更大规模的试验，但即便如此，这些结果还是非常令人兴奋的。", "note_en": "The preliminary results of a clinical trial suggest a new treatment for Covid-19 reduces the number of patients needing intensive care, according to the UK company that developed it.\n The treatment from Southampton-based biotech Synairgen uses a protein called interferon beta which the body produces when it gets a viral infection.\n The protein is inhaled directly into the lungs of patients with coronavirus, using a nebuliser, in the hope that it will stimulate an immune response.\n The initial findings suggest the treatment cut the odds of a Covid-19 patient in hospital developing severe disease - such as requiring ventilation - by 79%.\n Patients were two to three times more likely to recover to the point where everyday activities were not compromised by their illness, Synairgen claims.\n  It said the trial also indicated &#34;very significant&#34; reductions in breathlessness among patients who received the treatment.\n In addition, the average time patients spent in hospital is said to have been reduced by a third, for those receiving the new drug - down from an average of nine days to six days.\n  The double-blind trial involved 101 volunteers who had been admitted for treatment at nine UK hospitals for Covid-19 infections.\n Half of the participants were given the drug, the other half got what is known as a placebo - an inactive substance.\n  Stock market rules mean Synairgen is obliged to report the preliminary results of the trial.\n The results have not been published in a peer-reviewed journal, nor has the full data been made available; so the BBC cannot confirm the claims made for the treatment.\n  But if the results are as the company says, it will be a very important step forward in the treatment of coronavirus infections.\n The scientist in charge of the trial, Tom Wilkinson, says if the results are confirmed in larger studies the new treatment will be &#34;a game changer&#34;.\n The trial was relatively small but the signal that the treatment benefits patients was unusually strong, he says.\n &#34;We couldn&#39;t have expected much better results than these,&#34; Synairgen chief executive Richard Marsden told the BBC.\n He described the results as &#34;a major breakthrough in the treatment of hospitalised Covid-19 patients&#34;.\n   Mr Marsden said the company will be presenting its findings to medical regulators around the world in the next couple of days to see what further information they require in order to approve the treatment.\n That process could take months, although the British government, like many others, has said it will work as fast as possible to get promising coronavirus treatments approved.\n It is possible it could be given emergency approval,  as the anti-viral drug remdesivir was in May.\n Another possibility is that permission will be given for more patients to receive the treatment with the effects being carefully monitored to confirm it is safe and effective.\n If it does get approval, the drug and the nebulisers used to deliver it would then need to be manufactured in large quantities.\n Mr Marsden says he instructed companies to start producing supplies back in April to ensure they would be available should the results be positive.\n He says he expects Synairgen to be able to deliver &#34;a few 100,000&#34; doses a month by the winter.\n  Interferon beta is part of the body&#39;s first line of defence against viruses, warning it to expect a viral attack.\n The coronavirus seems to suppress its production as part of its strategy to evade our immune systems.\n  The new drug is a special formulation of interferon beta delivered directly to the airways via a nebuliser which makes the protein into an aerosol.\n The idea is that a direct dose of the protein in the lungs will trigger a stronger anti-viral response, even in patients whose immune systems are already weak.\n  Previous clinical trials conducted by Synairgen have shown that it can stimulate an immune response and that patients with asthma and other chronic lung conditions can comfortably tolerate the treatment.\n  No-one involved in the trial knew which patients have been given which treatment until it was over.\n &#34;If you know it&#39;s a drug, your mind might have a bias,&#34; explained Sandy Aitken, one of the nurses who administered the new drug to patients at Southampton Hospital.\n Synairgen&#39;s drug trial was the template for the Accord programme, a fast-track clinical trial scheme set up by the UK government in April to accelerate the development of new drugs for patients with Covid-19.\n The Synairgen team believes the drug could be even more effective at the early stages of infection.\n A trial exploring the effects of giving patients who are in high-risk groups the new drug as soon as they are confirmed as having Covid-19 has struggled to find volunteers because there are so few new infections at the moment.\n  Expert in emergency medicine Prof Steve Goodacre, from the University of Sheffield, said: &#34;These results are not interpretable. We need the full details and, perhaps more importantly, the trial protocol. The trial should have been registered and a protocol made available before any analysis was undertaken.&#34;\n Prof Naveed Sattar, professor of metabolic medicine at the University of Glasgow, said: &#34;The results seem very impressive, and although accepted that the trial is small with just over 100 participants, a 79% reduction in disease severity could be a game changer.\n &#34;It would be good to see the full results once presented and peer-reviewed to make sure they are robust and the trial conduct was rigorous. Also, with small numbers comes less certainty on the true level of benefit, or whether benefits vary between people with differing risk characteristics. Such work would require a larger trial but, even so, these results are very exciting.&#34;", "posttime": "2020-07-21 21:09:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,冠状病毒,病毒,蛋白,protein", "title": "冠状病毒蛋白治疗试验“取得突破性进展”", "title_en": "Coronavirus protein treatment trial 'a breakthrough'", "transed": 1, "url": "https://www.bbc.co.uk/news/health-53467022", "via": "", "real_tags": ["冠状病毒", "病毒", "蛋白", "protein"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013253, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索系统设计是定义系统的体系结构、模块、接口和数据以满足特定要求的过程。系统设计可以看作是系统论在产品开发中的应用。与系统分析、系统架构和系统工程的学科有一些重叠。[1][2]。\n如果更广泛的产品开发主题将市场营销、设计和制造的视角融合到产品开发的单一方法中，那么设计就是利用市场信息并创造要制造的产品的设计的行为。因此，系统设计是定义和开发系统以满足用户特定需求的过程。\n系统设计的基础研究是理解各组成部分及其相互之间的后续交互。[4]。\n直到20世纪90年代，系统设计在数据处理行业一直扮演着重要而受人尊敬的角色。在20世纪90年代，硬件和软件的标准化导致了构建模块化系统的能力。在通用平台上运行软件的重要性与日俱增，加强了软件工程的纪律。\n系统的体系结构设计强调系统体系结构的设计，该体系结构描述该系统的结构、行为以及更多的视图和分析。\n系统的逻辑设计涉及系统的数据流、输入和输出的抽象表示。这通常是通过使用实际系统的过度抽象(有时是图形化)模型的建模来实现的。在系统的上下文中，设计也包括在内。逻辑设计包括实体关系图(ER图)。\n物理设计涉及系统的实际输入和输出过程。这从如何将数据输入系统、如何验证/认证、如何处理以及如何显示等方面进行了说明。在物理设计中，决定了关于系统的以下要求。\n换句话说，系统设计的物理部分通常可以分为三个子任务：\n用户界面设计关注用户如何向系统添加信息，以及系统如何向他们返回信息。数据设计关注如何在系统中表示和存储数据。最后，流程设计关注数据如何在系统中移动，以及当数据流入、流过和流出系统时，如何以及在何处对其进行验证、保护和/或转换。在系统设计阶段结束时，将生成描述这三个子任务的文档，并提供给下一阶段使用。\n在此上下文中，物理设计不是指信息系统的有形物理设计。打个比方，个人计算机的物理设计包括通过键盘输入，在CPU内处理，通过监视器、打印机等输出。它不关心有形硬件的实际布局，对于PC来说，有形硬件将是监视器、CPU、主板、硬盘驱动器、调制解调器、视频/图形卡、USB插槽等。它涉及用户和产品数据库结构处理器和控制处理器的详细设计。为所提出的系统制定了H/S个人规范。\n软件领域的计算机编程和调试，或者消费者、企业或商业领域的详细设计-指定最终的系统组件。\n设计--设计师将设计出一个或多个他们看到的系统最终样子的模型，使用或丢弃来自分析部分的想法。将制作一份描述系统的文档，但没有什么是具体的-他们可能会说触摸屏或GUI操作系统，但没有提到任何具体的品牌；\n系统架构-为硬件、软件、人员和数据资源创建具有必要结构和行为规范的设计蓝图。在许多情况下，在选择一个架构之前会对多个架构进行评估。\n系统测试-评估与预期或预期功能相关的系统实际功能，包括所有集成方面。\n快速应用程序开发(RAD)是一种系统设计人员为最终用户生成原型的方法。最终用户审查原型，并就其适用性提供反馈。重复此过程，直到最终用户对最终系统感到满意。\n联合应用程序设计(JAD)是从RAD发展而来的一种方法，在该方法中，系统设计人员与由以下各方组成的小组进行协商：\nJAD涉及多个阶段，在这些阶段中，团队共同为系统的设计和实现开发一个商定的模式。\n^*本文合并了总务署文档中的公共领域材料：联邦标准1037C&34；。\n维克多·J·帕帕内克(1984)[1972]。“为现实世界设计：人类生态学与社会变革”(第2版)。芝加哥：芝加哥学院。第276页。ISBN为0897331532。华侨城：12343986。CS1维护：REF=HARV(链接)。\n题名/责任者：The First of the Lentley，Lonnie D.，Kevin C.Dittman，和Jeffrey L.Whitten。系统分析和设计方法。(1986、1997、2004)。\nC.West Churchman(1971)。查询系统的设计：系统与组织的基本概念。纽约：基础书籍。ISBN电话：0-465-01608-1。\nMaier，Mark W.和Rechtin，Eberhardt(2000)。“系统架构的艺术”(第二版)。博卡拉顿：CRC出版社。CS1维护：使用作者参数(链接)。\nSaltzer，J.H.；等人。(1984年11月)。&#34；系统设计中的端到端参数&#34；(PDF)。计算机系统上的ACM汇刊。2(4)：277-288。10.1145/357401.357402。\n卡尔·T·乌尔里希；史蒂文·D·艾平格(2000)。“产品设计与开发”(第二版)。波士顿：欧文·麦格劳·希尔。\n杰弗里·L·惠顿；本特利，朗尼·D；迪特曼，凯文·C(2004)。系统分析和设计方法的基本原理。", "note_en": "Jump to navigation  Jump to search  Systems design is the process of defining the  architecture, modules, interfaces, and  data for a  system to satisfy specified  requirements. Systems design could be seen as the application of  systems theory to  product development. There is some overlap with the disciplines of  systems analysis,  systems architecture and  systems engineering.  [1]  [2]\n   If the broader topic of  product development &#34;blends the perspective of marketing, design, and manufacturing into a single approach to product development,&#34;  [3] then design is the act of taking the marketing information and creating the design of the product to be manufactured. Systems design is therefore the process of defining and developing  systems to satisfy specified  requirements of the user.\n The basic study of system design is the understanding of component parts and their subsequent interaction with one another.  [4]\n Until the 1990s, systems design had a crucial and respected role in the  data processing industry. In the 1990s,  standardization of hardware and software resulted in the ability to build  modular systems. The increasing importance of software running on generic platforms has enhanced the discipline of  software engineering.\n  The architectural design of a system emphasizes the design of the  system architecture that describes the  structure,  behavior and more  views of that system and analysis.\n  The logical design of a system pertains to an abstract representation of the data flows, inputs and outputs of the system. This is often conducted via modelling, using an over-abstract (and sometimes graphical) model of the actual system. In the context of systems, designs are included. Logical design includes  entity-relationship diagrams (ER diagrams).\n  The physical design relates to the actual input and output processes of the system. This is explained in terms of how data is input into a system, how it is verified/authenticated, how it is processed, and how it is displayed.In physical design, the following requirements about the system are decided.\n  Put another way, the physical portion of system design can generally be broken down into three sub-tasks:\n  User Interface Design is concerned with how users add information to the system and with how the system presents information back to them. Data Design is concerned with how the data is represented and stored within the system. Finally, Process Design is concerned with how data moves through the system, and with how and where it is validated, secured and/or transformed as it flows into, through and out of the system. At the end of the system design phase, documentation describing the three sub-tasks is produced and made available for use in the next phase.\n Physical design, in this context, does not refer to the tangible physical design of an information system. To use an analogy, a personal computer&#39;s physical design involves input via a keyboard, processing within the CPU, and output via a monitor, printer, etc. It would not concern the actual layout of the tangible hardware, which for a PC would be a monitor, CPU, motherboard, hard drive, modems, video/graphics cards, USB slots, etc.It involves a detailed design of a user and a product database structure processor and a control processor. The H/S personal specification is developed for the proposed system.\n  Computer programming and  debugging in the software world, or detailed design in the consumer, enterprise or commercial world - specifies the final system components.\n Design – designers will produce one or more &#39; models&#39; of what they see a system eventually looking like, with ideas from the analysis section either used or discarded. A document will be produced with a description of the system, but nothing is specific – they might say &#39;touchscreen&#39; or &#39;GUI operating system&#39;, but not mention any specific brands;\n  System architecture – creates a  blueprint for the design with the necessary structure and behavior specifications for the hardware, software, people and data resources. In many cases, multiple architectures are evaluated before one is selected.\n System testing – evaluates the system&#39;s actual functionality in relation to expected or intended functionality, including all integration aspects.\n   Rapid application development (RAD) is a methodology in which a system designer produces prototypes for an end-user. The end-user reviews the prototype, and offers feedback on its suitability. This process is repeated until the end-user is satisfied with the final system.\n  Joint application design (JAD) is a methodology which evolved from RAD, in which a system designer consults with a group consisting of the following parties:\n  JAD involves a number of stages, in which the group collectively develops an agreed pattern for the design and implementation of the system.\n    ^    This article incorporates  public domain material from the  General Services Administration document:   &#34;Federal Standard 1037C&#34;.\n   ^    Papanek, Victor J. (1984) [1972].  Design for the Real World: Human Ecology and Social Change (2nd ed.). Chicago: Academy Chicago. p. 276.  ISBN   0897331532.  OCLC  12343986.  CS1 maint: ref=harv ( link)\n   Bentley, Lonnie D.,  Kevin C. Dittman, and  Jeffrey L. Whitten.  System analysis and design methods. (1986, 1997, 2004).\n C. West Churchman (1971).  The Design of Inquiring Systems: Basic Concepts of Systems and Organization. New York: Basic Books.  ISBN   0-465-01608-1.\n    Maier, Mark W., and Rechtin, Eberhardt (2000).  The Art of System Architecting (Second ed.). Boca Raton: CRC Press.  CS1 maint: uses authors parameter ( link)\n Saltzer, J.H.; et al. (November 1984).  &#34;End-to-End arguments in System Design&#34;  (PDF).  ACM Transactions on Computer Systems.  2 (4): 277–288.  doi: 10.1145/357401.357402.\n Ulrich, Karl T.;  Eppinger, Steven D. (2000).  Product Design and Development (Second ed.). Boston: Irwin McGraw-Hill.\n Whitten, Jeffrey L.;  Bentley, Lonnie D.;  Dittman, Kevin C. (2004).  Fundamentals of system analysis and design methods.", "posttime": "2020-07-21 21:08:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,系统,systems", "title": "什么是系统设计？", "title_en": "What Is Systems Design?", "transed": 1, "url": "https://en.wikipedia.org/wiki/Systems_design", "via": "", "real_tags": ["设计", "系统", "systems"]}, {"category": "", "categoryclass": "", "imagename": "18597371540bf3ff05568424ffb60fba.png", "infoid": 1013252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代UI团队首先设计组件；界面仅仅是组件的深思熟虑的组合。这给用户在“不愉快的道路”上留下了一个经常明显的漏洞--用户可能会有意无意地偏离你的理想化流程。当我们学习制作系统而不是页面时，我们必须投入精力来塑造这些经常遗漏的设计状态，并使用可以支持每个人的组件生命周期进行创建。在我看来，生命周期是这样的：\n在组件执行任何操作之前会发生什么情况？也许这是用户第一次看到它。也许它还没有被激活。从本质上讲，该组件存在，但尚未启动。\n可怕的国家。在一个完美的世界里，没有人会看到这一点；唉，我们在这里找到了自己。有很多方法可以使您的加载状态保持微妙和低调。Facebook在这方面做得相当好：\n您的组件已初始化，但它是空的。没有数据。没有物品。现在可能是让用户行动起来的好时机(“做这件事！”)，或者奖励他们(“干得好，一切都安排好了”)。\n你有一些数据。在输入时，这可能是在第一次击键之后。在列表中，可能是当您有一项(或剩下一项)时。\n这通常是你首先想到的。此组件的理想状态是什么？您的数据已加载，您有输入，并且用户熟悉它。\n哇，那里！用户在某些方面做得过火了。结果太多(可能您现在给它们分页)、字符太多(可能是省略号？)，等等。\n应用程序已收到用户的正确输入。他们再也不用担心这件事了。", "note_en": "Modern UI teams are designing components first; Interfaces are merely the thoughtful composition of components. This leaves an often glaring hole for users on “the unhappy path” — The places where users may, intentionally or not, stray from your idealized flow. As we learn to craft systems rather than pages, we must invest effort into shaping these often missed states of design and create with a component lifecycle that can support everyone. Here’s the lifecycle as I see it:\n   What happens  before your component does anything? Maybe it’s the first time a user sees it. Maybe it’s not activated yet. Essentially, the component exists but hasn’t  started.\n   The dreaded state. In a perfect world, no one would ever see this; Alas, here we find ourselves. There are plenty of ways to keep your loading state subtle and unobtrusive. Facebook does a pretty good job of this:\n   Your component has initialized, but it’s empty. No data. No Items. Now may be a good time to get the user to act (“Do this thing!”), or to reward them (“Good job, everything is taken care of”).\n   You have some data. On an input, this may be after the first keystroke. In a list, it might be when you have one item (or one left).\n   This is usually what you think of first. What is the ideal state for this component? Your data is loaded, you have input, and the user is familiar with it.\n   Woah there! The user has overdone it in some way. Too many results (maybe you paginate them now), too many characters (maybe ellipses?), and so on.\n         The user’s correct input has been received by the application. They don’t have to worry about it anymore.", "posttime": "2020-07-21 21:08:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,states,组件", "title": "“设计的九种状态”(2015)", "title_en": "The Nine States of Design (2015)", "transed": 1, "url": "https://medium.com/swlh/the-nine-states-of-design-5bfe9b3d6d85", "via": "", "real_tags": ["设计", "states", "组件"]}, {"category": "", "categoryclass": "", "imagename": "418914608f8b313e10b3829f5ea360dc.jpg", "infoid": 1013250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "脸书删除了其平台上最大的反面具群之一，原因是该群违反了禁止传播关于新冠肺炎的错误信息的政策。\n有9600多名成员的公众团体“揭开美国面罩！”的“关于”部分将其描述为“在这里传播关于面具的真相！”它提出了几个关于口罩阻碍氧气流动和产生负面心理影响的说法，这些说法已被广泛揭穿。“它是压制、奴役和认知顺从的心理锚。当你戴上口罩时，你就是宣布所有人类都是危险、传染性和威胁的同谋。“帖子中写道。\n这是在Facebook上搜索“揭开面纱”很容易找到的几十个这样的群中的一个。其中一些群是私有的，这意味着群管理员必须先批准新成员才能加入。但主题是一样的：这两个团体反对医学专家倡导的公共卫生干预。美国疾病控制和预防中心建议人们在所有公共场所佩戴口罩，这应该会限制病毒的传播。这些Facebook群是为那些不想戴口罩的人而设的，而且数量很多。\nFacebook的行动是在“The Verge”对该组织进行询问后采取的。Facebook发言人Dami Oyefeso在一封电子邮件中说：“我们有明确的政策反对宣传关于COVID19的有害错误信息，并在我们审查其他组的同时删除了这个组。”\n根据Facebook的规定，如果一个群反复分享虚假消息，该平台将在用户的新闻馈送中显示该群的内容较低，并停止建议人们加入该群以降低其增长。\n“揭开美国面罩”的群组页面包括一些成员的照片，他们戴着印有“让美国再次伟大起来”(Make America Great Again)口号的口罩，或其他提及特朗普总统的内容，通常是为了抗议口罩要求。其他帖子描述了与需要口罩的商店打交道的经历，许多帖子询问如何申请“豁免”口罩规则。\n一张由“自由呼吸机构”发行的“免面膜卡”的图片被链接到醒目的位置；一张海报建议其他人“打印、层压并使用它”。这个数字是合法的。“。据“纽约时报”报道，目前并不存在这样的政府机构，执法官员警告称，这类卡片--使用的是司法部鹰标志的版本--“不具有法律效力”。\n私人团体中有“百万露面游行”团体，该团体有7800多名成员。“父母是很有权势的！我们是一群妈妈、爸爸、祖父母、叔叔、阿姨、老师、朋友、护士，以及任何关心秋天孩子戴口罩上学的人，“该团体的”关于“部分写道。“我们相信，我们的孩子带着口罩上学对身体和心理都是有害的。和我们一起说，不要再戴面具了！“。而拥有约400名成员的“揭开恐惧”小组正在推动8月1日的一项活动“集会反对强制性面具”。\n然而，医学专家表示，几乎没有医学原因阻止大多数人在公共场合穿布质面罩。现在大约有24个州有某种公共口罩要求。就连在很大程度上抵制在公共场合戴口罩的特朗普总统周一也在推特上表示，“在无法与人交往的情况下戴口罩是爱国的”。\nFacebook已经采取了几项措施，试图阻止其平台上冠状病毒错误信息的泛滥，结果好坏参半。人权组织Avaaz在4月份发布的一份严厉的报告发现，Facebook上关于该病毒的100条错误信息被分享了超过170万次，浏览量约为1.17亿次。Facebook于4月16日宣布，当有人点赞、评论或回应带有虚假冠状病毒信息的帖子时，它将添加警告标签。同样在4月份，该公司表示，将从广告商可以用来瞄准潜在客户的类别列表中删除“伪科学”，“以防止广告中潜在的滥用”。\n今年5月，该公司发布了一份报告，描述了其使用人工智能以及人类事实核查人员和主持人来执行其社区标准。报道称，4月份，脸书为5,000万条新冠肺炎相关内容贴上警示标签，自3月1日以来，已下架250多万条与面膜销售、洗手液、新冠肺炎测试包相关的内容。", "note_en": "Facebook has removed one of the largest anti-mask groups on its platform for violating its policies against spreading misinformation about COVID-19.\n The About section of the public group Unmasking America! — which had more than 9,600 members — described it as “here to spread the TRUTH about masks!” It made several claims which have been  widely debunked about masks obstructing oxygen flow and having a negative psychological impact. “It is a psychological anchor for suppression, enslavement and cognitive obedience. When you wear a mask you are complicit in declaring all humans as dangerous, infectious and threats,” the post stated.\n It is one of dozens of such groups easily found in a search for “unmasking” on Facebook. Some of the groups are private, meaning a group admin has to approve new members before they can join. But the theme is the same: the groups oppose the public health intervention championed by medical experts. The US Centers for Disease Control and Prevention recommends people wear masks in all public areas, which should  limit the spread of the virus. These Facebook groups are for people who don’t want to wear masks, and there are a lot of them.\n Facebook’s action came after an inquiry about the group from  The Verge. “We have clear policies against promoting harmful misinformation about COVID 19 and have removed this group while we review the others,” Facebook spokesperson Dami Oyefeso said in an email.\n According to Facebook’s rules, if a group shares false news repeatedly, the platform will show the group’s content lower in users’ News Feeds and stop suggesting people join the group to reduce its growth.\n   The Unmasking America group page included posts of photos from members wearing masks emblazoned with the Make America Great Again slogan or other references to President Trump, usually as a way of protesting mask requirements. Other posts described experiences dealing with stores that require masks, and many posters asked how to claim an “exemption” from mask rules.\n An image of a “Face Mask Exempt Card” issued by the “Freedom to Breathe Agency” was linked to prominently; one poster advised others to “print it, laminate it and use it. The number is legit.” No such government agency exists and law enforcement officials have warned that such cards — which use a version of the justice department’s eagle logo — “do not carry the force of law,”   The New York Times reported.\n  Among the private groups are the “Million Unmasked March” group, which has more than 7,800 members. “Parents are powerful! We are a group of moms, dads, grandparents, uncles, aunts, teachers, friends, nurses and anyone who is concerned with our children wearing masks to school in fall,” the group’s “about” section reads. “We believe that our children wearing masks to school is physically and psychologically damaging. Join us in saying NO MORE MASKS!” And the “Unmasking Fear” group, which has about 400 members, is promoting an August 1st event “rallying against mandatory masks.”\n Medical experts, however, say there are  very few medical reasons to preclude most people from wearing cloth face coverings when they go out in public. About two dozen states now have some kind of public mask requirement in place. Even President Trump, who has been largely resistant to wearing a mask in public,  tweeted Monday that it was “patriotic to wear a face mask when you can’t socially distance.”\n Facebook has taken several steps to attempt to stem the flood of coronavirus misinformation on its platforms, with mixed results. A scathing report in April from human rights group  Avaaz found 100 pieces of misinformation regarding the virus on Facebook were shared more than 1.7 million times and viewed about 117 million times. Facebook  announced April 16th that it was  adding a warning label when a person liked, commented, or reacted to a post with fake coronavirus information. Also in April, the company said it was  removing “pseudoscience” from the list of categories advertisers could use to target potential customers “to prevent potential abuse in ads.”\n In May, the company released a report describing its use of  artificial intelligence along with human fact-checkers and moderators to enforce its community standards.  According to the report, in April, Facebook put warning labels on 50 million pieces of content related to COVID-19, and since March 1st, has removed more than 2.5 million pieces of content related to mask sales, hand sanitizers, and COVID-19 test kits.", "posttime": "2020-07-21 20:47:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,散布,spreading,口罩", "title": "脸书因散布新冠肺炎错误信息暂停反面具组", "title_en": "Facebook suspends anti-mask group for spreading COVID-19 misinformation", "transed": 1, "url": "https://www.theverge.com/2020/7/20/21331060/anti-mask-groups-facebook-misinformation", "via": "", "real_tags": ["facebook", "散布", "spreading", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "c290d001112cd6b1d0da3b1362899cd0.jpg", "infoid": 1013248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在发表在学术期刊“高级科学”(Advanced Science)上的一篇新论文中，IBM的研究人员详细介绍了他们在创造一种聚合物方面的工作，这种聚合物可以与用于治疗不耐药感染株的抗生素疗程相结合，其剂量等于甚至低于那些被发现对治疗缺乏克服抗生素能力的各种感染有效的药物。\n这种大分子的工作原理基本上是将自己与细菌在使用抗生素治疗时修饰的酶联系在一起，但并不是完全消除。这就是为什么你总是被告知在处方上全程服用抗生素的一个重要原因：如果抗生素没有完全消除，当它复发时，它可能会反弹并对所使用的治疗产生抗药性。\nIBM聚合物基本上缩短了细菌在对抗抗生素效果时开发的保护措施，恢复了(或甚至可能略有提高)它们的效力。\n这仍然是在高度受控的实验室环境中进行的相对早期的研究，需要更多的开发和测试，包括涉及人类患者的适当临床试验，然后才能真正用于现实世界。但这些基于实验室的结果提供了一个非常有希望的基础，在此基础上开展这项工作，显示了对真正的多重耐药细菌感染的有效性。", "note_en": "In a  new paper published in academic journal  Advanced Science, the IBM researchers detail their work in creating a polymer that can be combined with course of antibiotics that are used to treat non-resistant strains of infections, in does equal or even lower to those that are found to be effective in treating the varieties of the infections that lack the ability to overcome antibiotics.\n The macromolecule works by essentially hitching itself to the enzymes that bacteria modify when they are treated using antibiotics, but not completely eliminated. That’s a big reason why you’re always told to take the entire course of an antibiotic when it’s prescribed: If it isn’t completely wiped out, it can rebound and develop resistance to the treatment used when it comes back.\n  The IBM polymer basically shorts out the protective measures developed by the bacteria when to counter the effects of the antibiotic, returning (or potentially even slightly improving) their efficacy.\n This is still relatively early research that’s been done in the highly controlled environment of the lab, and would require a lot more development and testing, including proper clinical trials involving human patients before it actually becomes anything to be used in the real world. But these lab-based results provide a very promising basis upon which to build that work, having shown demonstrated efficacy with real multidrug-resistant bacterial infections.", "posttime": "2020-07-21 20:46:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,research,抗生素", "title": "\nIBM Research开发可对抗抗生素耐药性的新高分子", "title_en": "\n\t\t\t\tIBM Research develops new macromolecule that could counter antibiotic resistance\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/ibm-research-develops-new-macromolecule-that-could-counter-antibiotic-resistance/", "via": "", "real_tags": ["开发", "research", "抗生素"]}]