[{"category": "", "categoryclass": "", "imagename": "8727b786b7301e732dee8b3eca208150.jpg", "infoid": 1070768, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿——为了寻求资金来帮助支付参议院两党基础设施​​一揽子计划，立法者已将加密货币行业作为潜在的税收来源，并提议对数字交易进行更严格的审查。该一揽子计划的规定将要求加密货币经纪人和投资者向美国国税局提供更多有关其交易的披露。目的是为一个不透明的部门带来更多透明度，批评人士认为这是洗钱和逃税的避风港。但该条款也强调了华盛顿的认识，即价值 2 万亿美元的产业将继续存在，并提供产生联邦税收的新机会。根据对该计划进行分析的联合税收委员会的估计，通过加强对此类数字资产的税收执法，联邦政府可以在十年内筹集 280 亿美元。虽然这只是立法者在新的联邦基础设施支出中提议的 5500 亿美元的一小部分，但它是该计划中为数不多的新收入来源之一。对加密交易进行更多联邦审查的可能性正在使新兴的金融技术行业感到不安，迄今为止，该行业已经摆脱了适用于传统金融服务的那种严格监督。 Beacon Policy Advisors 分析师欧文·特德福德 (Owen Tedford) 周五在给客户的一份报告中写道：“目前尚不清楚将出台哪些法规，来自哪些机构，但请不要搞错——监管正在针对该行业。” “立法者和监管机构正在认真对待加密货币问题，似乎准备在多个方面做出持续努力，使其摆脱阴影。”今年早些时候，拜登政府概述了各种政策优先事项以及如何利用它们来增加收入，包括让加密行业接受美国国税局的更多审查。政府最初提出了报告加密货币交易的要求，作为其缩小 7 万亿美元所谓税收差距的更广泛举措的一部分。然而，财政部的计划附带了额外的资金，以帮助美国国税局打击骗税行为——参议院基础设施一揽子计划中不包括的资金。这可能会使本已捉襟见肘的机构更难打击几乎在一夜之间发展起来的高科技产业。\n《纽约时报》获得的参议院立法初稿的措辞比财政部的提议更广泛。政府的计划将对纳税人从一个经纪人那里购买加密资产然后将其转移给另一个经纪人的情况适用新的报告要求。它也适用于收到价值超过 10,000 美元的加密资产的企业。根据财政部的估计，该提议将增加“微不足道”的收入。参议院法案仍可能发生变化，提出了类似的报告要求，但包括对加密货币经纪人的更广泛定义，意指促进数字资产转移的任何人。一些加密货币经纪人已经向美国国税局报告了他们的交易，但由于现行法律的含糊不清，大多数都没有。加密货币行业争辩说，它希望监管更加清晰，但其一些成员警告说，经纪人的深远定义可能会产生意想不到的后果。游说团体数字商会会长佩里安·博林 (Perianne Boring) 表示，该法案的起草速度过快。她认为，通过如此宽泛地定义加密货币经纪人，它可能会对该行业的每个人施加披露要求，从赚取数字货币的“矿工”到技术开发商和投资者。 Boring 女士表示，让该行业的参与者制定他们可能无法遵守的法规，很可能会破坏该法案的目标。 “这可能会对一些最重要的创新领域的发展产生相当大的影响，或者可能会扼杀该行业的一部分或将其推向海外，”她说。 “我们应该拥抱这项技术，而不是将它排除在外。”\n随着监管机构围绕该行业，加密货币公司一直在囤积高价游说者，以帮助制定即将出台的规则。本周，马萨诸塞州民主党参议员伊丽莎白沃伦致信财政部长珍妮特 L.耶伦，敦促她动员她领导的金融稳定监督委员会协调一项战略，以“减轻加密货币对金融业构成的日益增长的风险”。金融系统。”沃伦女士特别担心它们对银行构成的威胁以及对冲基金等投资工具对加密货币的敞口越来越大。俄亥俄州民主党参议员谢罗德布朗在周二的参议院银行委员会听证会上对加密货币发出了严厉警告。布朗先生说：“一个阴暗、分散的网上搞笑资金网络没有任何&#39;民主&#39;或&#39;透明&#39;的东西。” “在使用这些技术十年后，可以肯定地说，绝大多数技术对除了他们的创造者之外的任何人都没有好处。”美国顶级金融监管机构本月举行会议，讨论稳定币、资产支持的数字货币，这些货币迅速流行以至于政府难以跟上步伐——以及它们对金融体系和国家安全构成的风险。对加密货币制定新的报告要求并不容易，目前尚不清楚它们是否会增加立法者希望的收入数额。这种计算具有挑战性，因为税收联合委员会或其他组织必须根据对行业规模的估计来进行计算。前美国国税局刑事调查部门国际业务执行董事埃里克·海尔顿 (Eric Hylton) 表示，更多地了解加密货币世界仍然对缩小税收差距大有帮助。\n“对于试图隐瞒收入的个人而言，这种洞察力将是有益的，”海尔顿先生说。 “我认为这对税收生态系统中的每个人来说都是一个巨大的胜利。”", "note_en": "WASHINGTON — In a hunt for funds to help pay for the Senate’s  bipartisan infrastructure package, lawmakers have turned to the cryptocurrency industry as a potential source of tax revenue and are proposing tougher scrutiny of digital transactions.\n A provision of the package would require cryptocurrency brokers and investors to provide more disclosure about their transactions to the Internal Revenue Service. The aim is to bring more transparency to an opaque sector, which critics argue is a haven for money laundering and tax evasion. But the provision also underscores the realization in Washington that the  $2 trillion industry is here to stay and offers a new opportunity to generate federal tax revenue.\n By strengthening tax enforcement on such digital assets, the federal government could raise $28 billion over a decade, according to an estimate by the Joint Committee on Taxation, which analyzed the plan. While that would be just a small fraction of the $550 billion that lawmakers have proposed in new federal spending on infrastructure, it is among the  few fresh sources of revenue included in the plan.\n The potential for more federal scrutiny of crypto transactions is rattling nerves in the nascent financial technology industry, which has so far escaped the kind of rigorous oversight applied to traditional financial services.\n “What regulation will come, and from which agencies, is not clear yet, but make no mistake — regulation is coming for the industry,” Owen Tedford, an analyst at Beacon Policy Advisors, wrote in a note to clients on Friday. “Lawmakers and regulators are taking cryptocurrency concerns seriously and seem poised to make sustained efforts on multiple fronts to bring it out of the shadows.”\n Earlier this year, the Biden administration outlined a variety of policy priorities and how they could be used to raise revenue, including bringing the crypto industry under more I.R.S. scrutiny. The administration initially proposed requirements for reporting cryptocurrency transactions as part of its broader initiative to narrow the $7 trillion so-called tax gap.\n That Treasury Department plan, however, came with additional funding to help the I.R.S. crack down on tax cheats — money the Senate infrastructure package does not include. That could make it more difficult for an already strapped agency to crack down on a high-tech industry that has developed almost overnight.\n A preliminary draft of the Senate legislation, which The New York Times obtained, has broader language than the Treasury Department’s proposal. The administration’s plan would apply new reporting requirements to cases in which taxpayers bought crypto assets from one broker and then transferred them to another broker. It would also apply to businesses that received crypto assets worth more than $10,000. According to the Treasury’s estimates, that proposal would raise a “negligible” amount of revenue.\n The Senate bill, which could still change, proposes similar reporting requirements but includes a broader definition of a cryptocurrency broker to mean anyone who facilitates transfers of digital assets.\n Some cryptocurrency brokers already report their transactions to the I.R.S., but most do not because of ambiguity in the existing law.\n  The cryptocurrency industry contends that it wants more regulatory clarity, but some of its members warn that the far-reaching definition of a broker could have unintended consequences.\n Perianne Boring, president of the Chamber of Digital Commerce, a lobbying group, said the legislation was being drafted too quickly. She argued that by defining cryptocurrency brokers so broadly, it could impose disclosure requirements on everyone involved in the industry, from the “miners” who make digital money to technology developers and investors.\n Saddling participants in the industry with regulations that they may be unable to comply with, Ms. Boring suggested, would most likely undermine the goal of the bill.\n “This can have a pretty significant impact on the development of some of the most important areas of innovation or will likely kill part of the industry or drive it overseas,” she said. “We should be embracing this technology, not regulating it out of existence.”\n With regulators circling the industry, cryptocurrency firms have been  stocking up on high-priced lobbyists to help shape the coming rules.\n This week, Senator Elizabeth Warren, Democrat of Massachusetts, sent a letter to Treasury Secretary Janet L. Yellen urging her to mobilize the Financial Stability Oversight Council, which she leads, to coordinate a strategy to “mitigate the growing risks that cryptocurrencies pose to the financial system.” Ms. Warren is particularly concerned about the threat that they pose to banks and the growing exposure to cryptocurrencies at investment vehicles such as hedge funds.\n Senator Sherrod Brown, Democrat of Ohio, issued a stark warning about cryptocurrencies at a Senate Banking Committee hearing on Tuesday.\n “There’s nothing ‘democratic’ or ‘transparent’ about a shady, diffuse network of online funny money,” Mr. Brown said. “After a decade of experience with these technologies, it seems safe to say that the vast majority haven’t been good for anyone but their creators.”\n Top U.S. financial regulators met this month to discuss stablecoins, asset-backed digital currencies that are exploding in popularity so quickly that the government is struggling to keep up — and the risks that they pose to the  financial system and national security.\n Putting in place new reporting requirements on cryptocurrencies would not be easy, and it is not clear that they would raise the amount of revenue that lawmakers hope. Such calculations are challenging because the Joint Committee on Taxation or other organizations have to base them on estimates about the size of the industry.\n Eric Hylton, formerly the executive director of international operations for the I.R.S. criminal investigations division, said shedding more light on the world of cryptocurrency would still go a long way toward reducing the tax gap.\n “The insight will be beneficial in regards to individuals that are trying to hide their income,” Mr. Hylton said. “I think it would be a huge win for everyone within the tax ecosystem.”", "posttime": "2021-07-31 10:34:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,deal,货币", "title": "基础设施交易使加密货币成为华盛顿的十字准线", "title_en": "Infrastructure Deal Puts Cryptocurrencies in Washington’s Cross Hairs", "transed": 1, "url": "https://www.nytimes.com/2021/07/30/us/politics/infrastructure-deal-cryptocurrency.html", "via": "", "real_tags": ["交易", "deal", "货币"]}, {"category": "", "categoryclass": "", "imagename": "46d2cbe9eccb89d6860dfa38f82889d6.jpeg", "infoid": 1070767, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果首席执行官蒂姆库克和特斯拉首席执行官埃隆马斯克正在通电话。 2016 年的 Model 3 即将发布，但特斯拉陷入了严重的财务困境。库克有个主意：苹果收购特斯拉。当然，库克说。当 Apple 在 2014 年收购 Beats 时，它保留了创始人 Jimmy Iovine 和 Dr. Dre。 《华尔街日报》记者蒂姆·希金斯 (Tim Higgins) 在“权力游戏：特斯拉、埃隆·马斯克和世纪赌注”中最生动的指控也是如此。二手轶事在某种程度上是非典型的——希金斯没有透露太多新闻或八卦——但它也很好地概括了电动汽车巨头的这段历史，这家公司似乎经常创新和蓬勃发展，尽管其创始人而不是他吹嘘的天才。是一本关于特斯拉的书，而不是关于它的创始人。埃隆马斯克已经做得很好了，把焦点放在自己身上。正如希金斯所描述的那样，特斯拉花了一个村庄。“权力游戏”的核心是关于许多未命名的员工Elon Musk 为汽车制造商今天所享有的任何成功做出了重要贡献。不要担心：Musk 始终是故事的一部分，他贡献了自己的戏剧品牌以推动事情的发展。但在这本书中，自封的“TechnoKing” ”（他的实际特斯拉的职位）不是主角，而是那些在混乱、功能失调的条件下尽力而为的人的戏剧性衬托。一位是斯坦福工程师 JB Straubel，他与马斯克合作接管了最初的特斯拉，该公司由 Martin Eberhard 和 Marc Tarpenning 于 2003 年创立。马斯克是有钱人，斯特劳贝尔是电池技术背后的大脑。在董事会同意让马斯克成为地球上最富有的人之一的薪酬计划后，斯特劳贝尔于 2019 年离开特斯拉。另一个在这里得到应得的关键人物是斯特林安德森，他是自动驾驶汽车的先驱，他领导了特斯拉的自动驾驶仪项目，但在马斯克拒绝了他为确保人们安全而推动的驾驶员监控技术之后，他才辞职。马斯克表示，他不想添加可能会惹恼特斯拉客户的技术。 Anderson 现在是 Aurora Innovation 的联合创始人兼首席产品官，负责设计真正的自动驾驶汽车。\n还有彼得罗林森，他从莲花来到特斯拉担任 Model S 的首席工程师。他和马斯克相处得很好，直到罗林森开始批评马斯克对命运多舛的 X 型车的一些想法。然后马斯克发现他“令人讨厌”。罗林森辞职，现在经营 Lucid Motors，这是一家豪华电动汽车制造商，很快就会推出将与特斯拉直接竞争的汽车。还有数十人被注意到，其中大多数是马斯克愤怒和愤怒的目击者或受害者，这是一位高管的头发触发因素，无论他们是否应得的，都会迅速解雇他们。在特斯拉加利福尼亚州弗里蒙特工厂的地板上，一名生产线工人告诉马斯克，他发明了一种方法，通过在门封条上做一个切口来修复车窗的刺耳声音。马斯克怒不可遏地对制造主管约翰·恩辛格 (John Ensign) 说：“在你的工厂里工作的人知道解决方案，而你甚至不知道这一点，这是不可接受的！”少尉被解雇了。事实上，工程师们已经尝试过这种方法，而且修复被证明是暂时的。少尉 - 现在是洛杉矶电动巴士制造商 Proterra 的首席运营官 - 不想在马斯克面前这么说让工人难堪。马斯克解决许多制造问题的方法过去是，现在看来仍然是，在修复生产线问题的同时，保持装配线运转。他不喜欢丰田方法，在这种方法中，工人可以停止生产线，直到问题得到解决。他是关于音量的。这可能是特斯拉质量如此参差不齐的一个原因——为什么购买一辆会让人感觉像是在胡说八道。一些车主报告说他们的车很完美；有人说他们卖的是一块垃圾。 （包括 Kristen Wiig 和 Avi Rothman。）事实上，丰田就此类问题终止了与特斯拉的合作关系。 “如果解决一些质量问题意味着放慢他们的日程安排，马斯克愿意放任不管……”希金斯报告说。 “当马斯克沿着跑道起飞时，特斯拉正在制造飞机。”很多读者会回答：当然可以，但看看他让特斯拉变得多么成功。也许你需要那种个性才能成功。\n这些天，也许是这样。毫无疑问：在马斯克的领导下，特斯拉在汽车历史上占有重要地位。当汽车行业的其他人在假设很少有人会购买替代品的情况下试图保护其内燃机业务时，马斯克表明时尚、快速和有趣的电动汽车将被证明很受欢迎。 Model S 的销量足以促使监管机构开始下令逐步淘汰汽油和柴油汽车。大众汽车柴油作弊丑闻以及通用汽车和克莱斯勒的破产削弱了汽车行业的影响力。现在每个人都在电动汽车转型上花费数十亿美元。尽管如此，该公司还有很长的路要走。特斯拉去年确实交付了不到 50 万辆汽车，但这仍然不到全球市场的 1%。特斯拉今天的利润主要来自向其他汽车制造商出售排放信用以及为“完全自动驾驶”技术向每位客户支付 10,000 美元——马斯克在最近的一次分析师电话会议上承认，这是行不通的。在 YouTube 上发布的视频证明了这一事实。其中一张显示特斯拉的“自动驾驶”系统错误地将月球识别为黄色交通灯。有人称马斯克为天才。说到筹款，他自己一个人上课。特斯拉至少两次避免破产。如果没有债务和股权的持续注入，公司就不会活到今天。美国历史上持续时间最长的牛市起到了帮助作用。因此，投资者更喜欢讲故事而不是老式的基本面作为评估公司股票的一种方式。但是，表演者只能长期掩饰严重的长期挑战。希金斯在危机初期引用摩根士丹利分析师亚当乔纳斯的话：“最大的问题是，特斯拉能否保持足够长的偿付能力，以利用即将到来的技术突破。”“即将到来”这个词在这里很关键。虽然特斯拉现在有四辆汽车市场上，只有未来的项目才能证明公司惊人的 6250 亿美元市值是合理的。2016 年，马斯克承诺，一辆自动驾驶汽车、一辆特斯拉半卡车和一辆新的，可能是喷气动力的跑车即将问世。没有一个是遥不可及的到生产。马斯克的副业也没有做得更好：他的地下隧道项目只是拉斯维加斯的一个旅游景点。他在 2016 年伪造了一种创新的太阳能屋顶瓦，然后特斯拉救助了马斯克表兄弟拥有的公司 SolarCity。他承诺到 2020 年底将有 100 万台机器人出租车。到目前为止还没有。然后是马斯克在 2018 年虚假的“资金担保”收购公告，使他被美国证券交易委员会处以罚款f 欺诈。马斯克显然没有参与《Power Play》的创作。在最后的作者笔记中，希金斯写道，马斯克“有很多机会对这些页面中呈现的故事、事实和特征进行评论。他没有指出任何具体的不准确之处，只是简单地说：&#39;你在这本书中读到的大部分，但不是全部，都是胡说八道。&#39;”\n自 2016 年以来，我一直以记者的身份报道特斯拉。当希金斯写下我熟悉的事实和情况时，我可以证明他每次都在按钮上。如果“权力游戏”中有任何废话，希金斯不是它的来源。", "note_en": "Apple Chief Executive  Tim Cook and Tesla Chief Executive  Elon Musk are talking on the phone. The 2016 unveiling of the make-it-or-break-it Model 3 is coming soon, but Tesla is in serious financial trouble. Cook has an idea: Apple buys Tesla.\n  Sure, says Cook. When Apple bought  Beats in 2014, it kept on the founders, Jimmy Iovine and Dr. Dre.\n    So goes the juiciest allegation in “ Power Play: Tesla, Elon Musk and the Bet of the Century&#34; by Wall Street Journal reporter Tim Higgins. The secondhand anecdote is atypical in a way — Higgins doesn&#39;t break much news or gossip — but it also nicely encapsulates this sweeping history of the electric-car juggernaut, a company that often seems to innovate and thrive in spite of its founder rather than as a result of his vaunted genius.\n To the inevitable disappointment of some and the relief of others, this is a book about Tesla, not about its founder. Elon Musk already does a fine job aiming the spotlight  on himself. As Higgins details, it took a village to build Tesla. “Power Play” at its core is about the many employees not named Elon Musk who made essential contributions to whatever success the carmaker enjoys today.\n Don&#39;t fret: Musk is always part of the story, contributing his own brand of drama to keep things moving along. But in this book, the self-anointed &#34;TechnoKing&#34; (his actual job title at Tesla) serves not as main character but dramatic foil to those doing their best under chaotic, dysfunctional conditions.\n One is  J.B. Straubel, the Stanford engineer who teamed with Musk to take over the original Tesla,  founded in 2003 by Martin Eberhard and Marc Tarpenning. Musk was the money man, Straubel the brains behind the battery technology. Straubel departed Tesla in 2019 after the board of directors agreed to a pay plan that has made Musk one of the richest people on the planet.\n  Another key player who gets his due here is Sterling Anderson, the self-driving-car pioneer who headed Tesla’s Autopilot project, only to quit after Musk rejected his push for driver-monitoring technology to keep people safe. Musk said he didn’t want to add technology that might nag Tesla customers. Anderson is now cofounder and chief product officer at  Aurora Innovation, engineering true self-driving vehicles.\n There is also Peter Rawlinson, who came to Tesla from Lotus as chief engineer for the Model S. He and Musk got along fine until Rawlinson started criticizing some of Musk’s ideas for the ill-fated Model X. Musk then found him “irritating.” Rawlinson quit and now runs  Lucid Motors, a luxury EV maker soon to introduce vehicles that will compete directly with Tesla.\n Dozens more are noted, most of them witnesses to or victims of the rage and wrath of Musk, a hair trigger of an executive who’s quick to fire people whether they deserve it or not.\n On the floor of Tesla’s  Fremont, Calif., factory, a line worker told Musk he’d invented a way to fix a car window’s screeching sound by making an incision on the door seal. Musk turned on manufacturing executive John Ensign in a rage: “This is unacceptable that you had a person working in your factory that knows the solution and you don’t even know that!” Ensign was fired. In fact, engineers had already tried that approach and the fix proved temporary. Ensign — now chief operating officer at Los Angeles electric bus maker  Proterra — didn’t want to embarrass the worker by saying so in front of Musk.\n Musk’s approach to many manufacturing issues was, and still appears to be, keeping the assembly line moving while line problems are being fixed. He’s not a fan of the Toyota method, where a worker can stop the line until the problem is solved. He’s all about the volume.\n That may be one reason why the quality of Teslas is so variable — why buying one can feel like a crapshoot. Some owners report their car is perfect; some say they were sold a piece of junk. ( Including Kristen Wiig and Avi Rothman.)\n In fact, Toyota ended a partnership with Tesla over such issues. “Musk was willing to let some quality issues slide if addressing them meant slowing down their schedule…,” Higgins reports. “Tesla was building the airplane as Musk was heading down the runway for takeoff.”\n Plenty of readers would respond: Sure, but look at how successful he’s made Tesla. Maybe you need that kind of personality to succeed.\n These days, maybe so. No question: Tesla has earned a prominent place in motor vehicle history under Musk. While the rest of the auto industry sought to protect its internal-combustion business under the assumption few people would buy an alternative, Musk showed that stylish, fast and fun electric cars would prove popular. The Model S sold in sufficient numbers to prompt regulators to begin ordering phaseouts of gasoline and diesel cars. The Volkswagen diesel-cheat scandal and the bankruptcies of General Motors and Chrysler weakened auto industry clout. Now everybody’s spending billions on an EV transition.\n Still, the company has a long way to go. Tesla did deliver just shy of 500,000 cars last year, but that’s still less than 1% of the world market. Tesla profits today come mostly from sales of emissions credits to other automakers and $10,000-per-customer payments for &#34; full self-driving&#34; technology — which, Musk admitted in a recent analyst call, doesn’t work. Videos posted all over YouTube  attest to the fact. One shows Tesla&#39;s &#34;self-driving&#34; system  mistakenly identifying the moon as a  yellow traffic light.\n Some call Musk a genius. When it comes to fundraising, he’s in a class by himself. Tesla’s skirted bankruptcy at least twice. The company would not be alive today without continued infusions of debt and equity. The longest-running bull market in U.S. history has helped. So has investor preference for storytelling over old-fashioned fundamentals as a way to value a company’s stock. But a showman can only paper over serious long-term challenges for so long.\n Higgins quotes Morgan Stanley analyst Adam Jonas at an early crisis point: “The biggest question is if Tesla can remain solvent long enough to capitalize on the forthcoming technology breakthroughs.&#34; The word “forthcoming” is key here. While Tesla now has four cars on the market, only future projects will justify the company’s jaw-dropping $625 billion market value.\n In 2016, Musk promised that a self-driving car, a Tesla semi truck and a new, possibly jet-powered roadster were imminent. None are remotely close to production. .Musk&#39;s side hustles are doing no better: His underground tunnel project is just a tourist attraction in Las Vegas. He  faked an innovative solar roof tile in 2016 before Tesla bailed out  SolarCity, a company owned by Musk’s cousins. He promised a million robotaxis by the end of 2020. So far there are none.\n And then there&#39;s Musk&#39;s  fake &#34;funding secured&#34; buyout announcement in 2018 that earned him a wrist-slap fine from the Securities Exchange Commission on charges of fraud.\n Musk apparently did not participate in the creation of “Power Play.” In an author’s note at the end, Higgins writes that Musk “was given numerous opportunities to comment on the stories, facts, and characterizations presented in these pages. Without pointing to any specific inaccuracies, he offered simply this: &#39;Most, but not all, of what you read in this book is nonsense.&#39;”\n I’ve  covered Tesla as a reporter since 2016. When Higgins writes about facts and situations I’m familiar with, I can attest he’s right on the button, every time. If there’s any nonsense in “Power Play,” Higgins isn’t the source of it.", "posttime": "2021-07-31 10:33:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,特斯拉,历史,deep,马斯克", "title": "评论：特斯拉深刻的新历史让埃隆·马斯克大放异彩", "title_en": "Review: A deep new history of Tesla takes the shine off Elon Musk", "transed": 1, "url": "https://finance.yahoo.com/news/review-deep-history-tesla-takes-130057001.html", "via": "", "real_tags": ["埃隆·马斯克", "特斯拉", "历史", "deep", "马斯克"]}, {"category": "", "categoryclass": "", "imagename": "ebf3c79e0c5aae1f1f0a9ac32b87859c.jpeg", "infoid": 1070766, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据疾病预防控制中心周五发布的新数据，在马萨诸塞州 Covid-19 爆发中，大约四分之三的感染者接种了疫苗。发表在美国机构的发病率和死亡率周报上的新数据还发现，完全接种疫苗的感染者鼻子中携带的病毒与未接种疫苗的人一样多。根据美国疾病控制与预防中心周五发布的新数据，在马萨诸塞州 Covid-19 爆发中感染的人中，约有四分之三接种了冠状病毒疫苗，其中四人最终住院。新数据发表在美国机构的发病率和死亡率周报中，还发现完全接种疫苗的感染者鼻子中携带的病毒与未接种疫苗的人一样多，并可能传播给其他人。 “这一发现令人担忧，是导致 CDC 更新口罩建议的关键发现，”CDC 主任罗谢尔·瓦伦斯基 (Rochelle Walensky) 博士在一份声明中说。 “更新了掩蔽建议，以确保接种疫苗的公众不会在不知不觉中将病毒传播给他人，包括未接种疫苗或免疫功能低下的亲人。”周二，疾病预防控制中心改变了其先前的指导方针，并建议居住在 Covid 感染率高地区的已接种疫苗的美国人恢复在室内戴口罩。根据 CNBC 的分析，该指南涵盖了大约三分之二的美国人口。 Walensky 在周二的电话会议上对记者说，虽然 delta 变体继续对未接种疫苗的人造成最严重的打击，但一些接种疫苗的人可能携带比以前了解的更高水平的病毒，并有可能将其传播给其他人。她补充说，该变种的行为“与过去的病毒株截然不同”。\nCNBC 审查过的 CDC 文件警告说，席卷全国的 delta 变种与水痘一样具有传染性，比最初的 Covid 毒株具有更长的传播窗口，即使老年人已经完全接种疫苗，也可能使他们病情加重。该文件称，Delta 病毒目前已在至少 132 个国家/地区成为美国的主要疾病，比普通感冒、1918 年西班牙流感、天花、埃博拉病毒、MERS 和 SARS 更容易传播。只有麻疹似乎比变种传播得更快。周五公布的数据基于 469 例 Covid 病例，这些病例与 7 月在马萨诸塞州巴恩斯特布尔县举行的多个夏季活动和大型公众集会有关，该县包括科德角，就在玛莎葡萄园外。据NBC新闻报道，这些活动在普罗温斯敦举行。大约四分之三或 74% 的病例发生在已完成两剂 mRNA 疫苗疗程或接受过强生疫苗注射的完全接种人群中。据 CDC 称，总体而言，274 名接种疫苗的突破性感染患者出现症状。最常见的副作用是咳嗽、头痛、喉咙痛、肌肉疼痛和发烧。据该机构称，在住院的五名 Covid 患者中，有四人接种了疫苗。没有死亡报告。虽然许多研究表明，这些疫苗对 delta 变体的作用不如对其他菌株有效，但卫生官员表示，它们仍然非常有效，尤其是在预防严重疾病和死亡方面。美国卫生官员本周重​​申，美国大约 97% 的新住院病例和 99.5% 的死亡病例都是未接种疫苗的人。 CDC 还表示，这些数据有局限性。该机构指出，随着人口层面疫苗接种覆盖率的增加，接种疫苗的人可能占 Covid 病例的更大比例。此外，该机构表示，由于检测偏倚，无症状的突破性感染可能代表性不足。疾病预防控制中心还表示，该报告“不足以”得出关于此次疫情期间经批准的 Covid 疫苗（包括 delta 变体）的有效性的结论。", "note_en": "About three-fourths of people infected in a Massachusetts Covid-19 outbreak were fully vaccinated, according to new data published Friday by the CDC.\n The new data, published in the U.S. agency&#39;s Morbidity and Mortality Weekly Report, also found that fully vaccinated people who get infected carry as much of the virus in their nose as unvaccinated people.\n About three-fourths of people infected in a Massachusetts Covid-19 outbreak were fully vaccinated against  the coronavirus with four of them ending up in the hospital, according to new data published Friday by the Centers for Disease Control and Prevention.\n The new data, published in the U.S. agency&#39;s Morbidity and Mortality Weekly Report, also found that fully vaccinated people who get infected carry as much of the virus in their nose as unvaccinated people, and could spread it to other individuals.\n  &#34;This finding is concerning and was a pivotal discovery leading to CDC&#39;s updated mask recommendation,&#34; CDC Director Dr. Rochelle Walensky said in a statement. &#34;The masking recommendation was updated to ensure the vaccinated public would not unknowingly transmit virus to others, including their unvaccinated or immunocompromised loved ones.&#34;\n On Tuesday, the CDC  reversed course on its prior guidance and recommended fully vaccinated Americans who  live in areas with high Covid infection rates resume wearing face masks indoors. The guidelines  cover about two-thirds of the U.S. population, according to a CNBC analysis.\n  While the delta variant continues to hit unvaccinated people the hardest, some vaccinated people could be carrying higher levels of the virus than previously understood and are potentially transmitting it to others, Walensky told reporters on a call Tuesday. She added the variant behaves &#34;uniquely differently from past strains of the virus.&#34;\n A CDC document that was reviewed by CNBC warned that the delta variant sweeping across the country is  as contagious as chickenpox, has a longer transmission window than the original Covid strain and may make older people sicker, even if they&#39;ve been fully vaccinated.\n  Delta, now in at least 132 countries and already the dominant form of the disease in the United States, is more transmissible than the common cold, the 1918 Spanish flu, smallpox, Ebola, MERS and SARS, according to the document. Only measles appears to spread faster than the variant.\n  The data published Friday was based on 469 cases of Covid associated with multiple summer events and large public gatherings held in July in Barnstable County, Massachusetts, which encompasses Cape Cod and is just outside Martha&#39;s Vineyard. The events were held in Provincetown, according to NBC News. Approximately three-quarters, or 74%, of the cases occurred in fully vaccinated people who had completed a two-dose course of the mRNA vaccines or received a single shot of Johnson &amp; Johnson&#39;s.\n Overall, 274 vaccinated patients with a breakthrough infection were symptomatic, according to the CDC. The most common side effects were cough, headache, sore throat, muscle pain and fever. Among five Covid patients who were hospitalized, four were fully vaccinated, according to the agency. No deaths were reported.\n  While numerous studies have shown that the vaccines don&#39;t work as well against the delta variant as they did against other strains, health officials say they are still highly effective, especially in protecting against severe illness and death. Roughly 97% of new hospitalizations and 99.5% of deaths in the U.S. are among unvaccinated individuals, U.S. health officials repeated this week.\n The CDC also said the data has limitations. The agency noted that as population-level vaccination coverage increases, vaccinated persons are likely to represent a larger proportion of Covid cases. Additionally, asymptomatic breakthrough infections might be underrepresented because of detection bias, the agency said.\n The CDC also said the report is &#34;insufficient&#34; to draw conclusions about the effectiveness of the authorized vaccines against Covid, including the delta variant, during this outbreak.", "posttime": "2021-07-31 10:30:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "接种,study,疫苗", "title": "CDC 研究表明，在 MA Covid 爆发中，74% 的感染者接种了疫苗", "title_en": "CDC study shows 74% of people infected in MA Covid outbreak were vaccinated", "transed": 1, "url": "https://www.cnbc.com/2021/07/30/cdc-study-shows-74percent-of-people-infected-in-massachusetts-covid-outbreak-were-fully-vaccinated.html", "via": "", "real_tags": ["接种", "study", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "488d6c0d1a6ef0438b44fde510b7a367.jpg", "infoid": 1070765, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "印度政府今天晚上在宣布第四次血清调查结果时表示，大约三分之二的六岁以上印度人在某个时候感染了 SARS-CoV2 病毒，这种病毒会导致 COVID-19 疾病.", "note_en": "Roughly two-thirds of all Indians above the age of six have, at some point, been infected with the SARS-CoV2 virus - which causes the COVID-19 disease - the government said this evening, as it announced the results of the fourth serosurvey.", "posttime": "2021-07-31 10:30:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抗体,covid,今天", "title": "6 岁以上印度人中 67.6% 有 Covid 抗体：血清调查结果", "title_en": "67.6% of Indians over Six Have Covid Antibodies: Sero Survey Results", "transed": 1, "url": "https://www.ndtv.com/india-news/coronavirus-67-6-of-indians-over-six-have-covid-antibodies-sero-survey-results-2490809", "via": "", "real_tags": ["抗体", "covid", "今天"]}, {"category": "", "categoryclass": "", "imagename": "0d2d45bc3653b12a10b9038ab23be05f.jpg", "infoid": 1070764, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎收看 2021 年 7 月 30 日的每日紧缩。这真是一周啊，我的朋友们。它挤满了 IPO 和收益、创业新闻和新的风险基金。而今天也不例外。然而，在我们开始之前，我很高兴地报告 Calendly 首席执行官 Tope Awotona 即将加入 Disrupt。这也是便宜的早鸟通行证的最后一天。到时候那里见！ — Alex Elon vs. Tim Apple：财报季通常充斥着 CEO 和其他高管说的很少，通常是无聊的事情。这是因为 CEO 和其他企业领导人在他们的公司上市时可以说什么是有规则的。然后是埃隆马斯克，他在特斯拉的财报电话会议上对苹果进行了含糊其辞的抨击，随后在推特上发文称苹果的 App Store 削减是对互联网的征税。游戏开始。为什么 Robinhood 上市：TechCrunch 本周早些时候与该公司的首席财务官讨论了为什么现在是消费者交易服务上市的合适时机。他的回答？该公司已经完成了高管人才、产品工作、安全方面的工作，并已做好准备。我们还深入研究了为什么该公司的首次亮相有点沉闷。 Gopuff 确认投资 1 亿美元：在最新投资后，这家按需交付公司现在价值 150 亿美元，这意味着所谓的“即时”交付空间现在比以往任何时候都获得了更好的资金。谁投入的资本？大量交叉基金和其他资金池。请注意，这是软银愿景基金的胜利。以字母“Y：”开头的初创公司美好的一天：还记得Yik Yak吗？雅克呢？还有哟？好吧，现在请关注 Yat，这家初创公司已售出数千万美元的表情符号字符串，可以代表您的个人或个性。我会嘲笑这个，但我认为 Bitmoji 是愚蠢的，所以我知道什么。 Outvio 为其白标履行服务完成了 300 万美元的融资：Outvio 来自知名的创业中心爱沙尼亚，希望围绕其白标“西班牙和爱沙尼亚大中型在线零售商的履行解决方案”建立 SaaS 业务，TechCrunch报告。坦率地说，考虑到电子商务游戏的规模越来越大，Outvio 背后的想法并不令人意外。让我们看看它可以用它的新资本完成什么。让我们在太空中建造东西：这就是我们假设 Varda Space 在忙于筹集 4200 万美元的 A 轮融资时所投的。为什么要在难以到达的太空中建造东西？微重力。瓦尔达希望在 2023 年之前建立它的第一个太空制造中心。我内心的科幻书呆子被大肆宣传。\nPorter 希望构建一个 PaaS 产品来改进 Kubernetes 管理：YC 的毕业生刚刚为其工作筹集了 150 万美元。简而言之，创始团队喜欢像 Kubernetes 这样的技术，但不喜欢管理它。因此，他们构建了一个工具来简化这项工作。为什么 Porter 筹集了 2012 年的种子轮融资我们不知道，但如果进展顺利，该公司肯定可以获得更多资金。许多技术工人并不是非常注重职业；平均而言，他们的薪酬高于其他初创公司员工，而且最有才华的人通常会从事他们个人感兴趣的项目。但不断增长的人才需求被持续的短缺所抵消：公司无法足够快地雇用开发人员和工程师，尽管许多人仍然不认为自己是需求旺盛的员工。 “坦率地说，许多开发人员和工程师在管理自己的职业生涯方面很糟糕，”瞻博网络首席技术官 Raj Yavatkar 说。摆脱传统技术文化可能具有挑战性，因此 Yavatkar 建议开发人员和工程师“像对待软件项目一样对待职业发展”。 （Extra Crunch 是我们的会员计划，可帮助创始人和初创团队取得成功。您可以在此处注册。）火灾、月球和欧洲罚款？我们今天在我们的大型技术观察列表中为您提供了一切：\n13 吨特斯拉电池点燃：电池有时会着火。三星在当天就学到了这一点。特斯拉是最近的受害者。近日，澳大利亚东南部一辆 13 吨重的特斯拉 Megapack 起火，成为新闻。全员平安无事。 Blue Origin 不会获得月球车交易：在向美国政府提供大幅折扣的项目后，Blue Origin 在其请求被拒绝后将无法得到它想要的东西。 Dynetics 对 SpaceX 合同的质疑也被拒绝。这么多。欧盟对亚马逊的午餐费进行了罚款：卢森堡国家数据保护委员会 (CNPD) 已评估了价值 7.46 亿欧元的巨额罚款，或每两周 8.87 亿美元的弗隆。亚马逊对 GDPR 衍生的罚款并不满意。但是，该公司每年仍产生数百亿美元的经营现金流。这笔罚款到底有多大伤害？ Airtel Africa 的移动货币部门又筹集了 2 亿美元：正如 TechCrunch 所指出的，越来越多的资金流入非洲的所有数字领域。初创公司并不是唯一获得支票的团体。非洲电信公司 Airtel Africa 的移动货币部门最近几周筹集了大量资金，其中包括从卡塔尔投资局的一家附属公司筹集的 2 亿美元。万事达卡和 TPG 也是投资者。我们正在与初创公司创始人联系，告诉我们他们在需要最新的增长营销实践时会向谁求助。在此处填写调查。感言：“除了他们的知识和经验（非常丰富！），他们对早期企业面临的独特挑战有着深刻的理解和欣赏。他们适应不同成长阶段的特定障碍，并能够根据这些障碍调整自己的工作风格。他们不仅帮助我们执行重要的增长策略，还帮助我们建立了框架，无论我们是 5、50 还是 500 人，都可以继续执行这些策略。这在我们扩大规模并向未来投资者展示时非常重要。他们也是杰出的导师，能够提供现实世界的建议并灵活地工作，以适应高增长早期业务不断变化的性质。”", "note_en": "Hello and welcome to Daily Crunch for July 30, 2021. What a week, my friends. It was packed full of IPOs and earnings and startup news and new venture funds. And today was no exception. Before we get into it, however, I am happy to report that  Calendly CEO Tope Awotona is coming to Disrupt. It’s also the  last day for early-bird passes, which are cheap. See you there! —  Alex\n   Elon vs. Tim Apple: Earnings season is usually replete with CEOs and other execs saying very few, usually boring things. That’s because there are rules about what CEOs and other corporate leaders can say when their companies are public. Then there’s Elon Musk, who took a  poorly veiled potshot at Apple during Tesla’s earnings call, and followed it up by tweeting that Apple’s App Store cut is a tax on the internet. Game on.\n Why Robinhood went public: TechCrunch spoke with the company’s CFO earlier this week about why this was the right time for the consumer trading service to go public. His answer? The company had done the work on exec talent, product work, safety and was ready. We also dug into why the company’s debut has been a bit staid.\n Gopuff confirms $100M investment: The on-demand delivery company is now worth $15 billion after the latest investment, meaning that the so-called “instant” delivery space is now better funded than ever. Who put the capital in? A raft of crossover funds and other capital pools. This is a win  for SoftBank’s Vision Fund, mind.\n  A good day for startups starting with the letter “Y:” Remember  Yik Yak?  And Yac?  And Yo? Well, now keep your mind wrapped around  Yat, a startup that has sold tens of millions of dollars in emoji strings that can represent your person or personality. I would mock this but I thought Bitmoji were dumb, so what do I know.\n Outvio closes $3M round for its white-label fulfillment service: Hailing from known startup hub Estonia, Outvio wants to build a SaaS business around its white-labelable “fulfillment solution for medium-sized and large online retailers in Spain and Estonia,” TechCrunch reports. Frankly given how big the e-commerce game is getting, the idea behind Outvio is not a surprise. Let’s see what it can get done with its new capital.\n Let’s build stuff in space: That’s what we presume Varda Space pitched when it was busy raising a $42 million Series A round. Why build stuff in space, which is hard to get to? Microgravity. Varda wants to have its first space-based manufacturing hub set up by 2023. My inner science fiction nerd is hyped.\n Porter wants to build a PaaS offering to make Kubernetes management better: The YC graduate just raised $1.5 million for its work to boot. In short, the founding team liked tech like Kubernetes, but didn’t like managing it. So they built a tool to make that work easier. Why Porter raised a 2012-era seed round is beyond us, but the company can surely access more funds if things go well.\n  Many technical workers aren’t extremely career focused; on average, they’re paid more than other startup employees, and the most talented often get to work on projects that interest them personally.\n But the increasing demand for talent is offset by an ongoing shortage: Companies can’t hire developers and engineers fast enough, even though many still don’t see themselves as in-demand workers.\n “To put it bluntly, many developers and engineers stink at managing their own careers,” says Raj Yavatkar, CTO of Juniper Networks.\n Breaking away from traditional tech culture can be challenging, so Yavatkar recommends that developers and engineers “treat career advancement as you would a software project.”\n  (Extra Crunch is our membership program, which helps founders and startup teams get ahead.  You can sign up here .)\n  Fires, the moon and a European fine? We have it all for you today in our big technology watchlist:\n 13 tons of Tesla batteries ignite:  Batteries sometimes catch fire. Samsung learned this back in the day. Tesla is the most recent victim. A 13-ton Tesla Megapack caught fire in southeast Australia recently, which made the news. No one was hurt.\n Blue Origin won’t get a moon rover deal: After offering a heavily discounted project to the U.S. government, Blue Origin won’t get what it wanted after its request was turned down. A challenge to a SpaceX contract by Dynetics was also denied. So much for that.\n The EU fines Amazon its lunch money: Luxembourg’s National Commission for Data Protection, or CNPD, has assessed a mammoth fine worth €746 million in metric, or $887 million in furlongs per fortnight. Amazon was not pleased with the GDPR-derived fine. But still, the company generates tens of billions of dollars in operating cash flow each year. How much does this fine really hurt?\n Airtel Africa’s mobile money arm raises another $200M: As TechCrunch has noted, there’s  more and more capital flowing into all things digital in Africa. And startups aren’t the only groups landing checks. African telco Airtel Africa’s mobile money unit has raised lots of capital in recent weeks, including a fresh $200 million from an affiliate of the Qatar Investment Authority. Mastercard and TPG are also investors.\n   We’re reaching out to startup founders to tell us who they turn to when they want the most up-to-date growth marketing practices.  Fill out the survey here.\n    Testimonial: “Beyond their knowledge and experience (which is in abundance!), they have a deep understanding and appreciation for the unique challenges early-stage businesses have. They are in tune with the particular hurdles at various stages of growth and are able to adapt their working style dependent on those. They haven’t just helped us execute vital growth tactics, but they’ve helped us set up the framework to keep executing on those whether we are 5, 50 or 500 people. This is incredibly important as we scale and to demonstrate to future investors. They are also exceptional mentors and are able to offer real-world advice and work flexibly to suit the ever-changing nature of a high-growth early-stage business.”", "posttime": "2021-07-31 07:52:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,广告,advertising", "title": "每日紧缩：欧洲隐私监管机构因有针对性的广告行为对亚马逊罚款 8.87 亿美元", "title_en": "\n\t\t\t\tDaily Crunch: European privacy regulators fine Amazon $887M over targeted advertising practices\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/daily-crunch-38/", "via": "", "real_tags": ["amazon", "亚马逊", "广告"]}, {"category": "", "categoryclass": "", "imagename": "88f614bcbedde319c9ec13cf71f3b3c2.jpg", "infoid": 1070763, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "合同工坚持他们认为与科技行业其他人类似的待遇。当时，谷歌似乎希望避免与为员工配备员工的咨询公司 HCL Technologies 发生争执。 “我们与许多合作伙伴合作，其中许多拥有工会员工，而其中许多没有，”谷歌在最初的工会投票后表示。 “与我们所有的合作伙伴一样，HCL 的员工是否加入工会是他们与雇主之间的事情。我们将继续与 HCL 合作。”据 USW 称，匹兹堡的 65 名工人已经批准了与 HCL 的合同。根据工会的一份说明，这是一项为期三年的协议，涵盖工作条件、工作保障和工资。 “经过 HCL 成员近两年的辛勤工作、耐心和团结，我们为我们在这项协议中取得的成就感到自豪，”南加州大学校长汤姆康威在与该消息相关的新闻稿中说。 “我们与 HCL 的斗争比以往任何时候都更表明所有工人都应该得到工会合同的保护和福利。”上周，随着交易接近完成，HCL 在提供给 The Verge 的一份声明中表示，“在整个过程中，HCL 一直真诚地积极与 USW 进行有意义和公平的讨论。我们一直坚定地承诺尊重员工选择加入工会的权利。”然而，在 USW 发布的一份新闻稿中，谈判委员会成员 Renata Nelson 指出在这个过程中存在一些明显的紧张。 “在无视我们的担忧后，HCL 试图阻止我们组建工会，当它失败时，该公司拖延了谈判过程，同时将我们的工作岗位派往海外进行报复，”帕克斯在新闻稿中说。 “现在，有了强大的工会和合同，我们相信我们的声音会被听到。”", "note_en": "The contract workers held out for what they believed to be similar treatment as others in the tech industry. At the time, it seemed Google was hoping to stay out of the fray with HCL Technologies, the consulting company that staffed the workers.\n “We work with lots of partners, many of which have unionized workforces, and many of which don’t,” Google said following the initial union vote. “As with all our partners, whether HCL’s employees unionize or not is between them and their employer. We’ll continue to partner with HCL.”\n  According to the USW, the 65 Pittsburgh-based workers have ratified the contract with HCL. It’s a three-year-deal that covers working conditions, job security and wages, per a note from the union.\n  “After close to two years of hard work, patience and solidarity from our members at HCL, we are proud of what we achieved in this agreement,” USW President Tom Conway said in a release tied to the news. “More than ever, our struggle with HCL shows that all workers deserve the protections and benefits of a union contract.”\n Last week, with the deal nearing completion, HCL said in a statement  provided to The Verge, “Throughout this process, HCL has been actively engaged in meaningful and fair discussions with the USW in good faith. We have been steadfast in our commitment to respect our employees’ right to pursue unionization should they choose to do so.”\n In a release issued by USW, however, bargaining committee member Renata Nelson notes some clear tension in the process. “After ignoring our concerns, HCL tried to prevent us from forming a union, and when it failed, the company dragged out the negotiating process while sending our jobs overseas in retaliation,” Parks said in the release. “Now, with a strong union and contract in place, we’re confident that our voices will be heard.”", "posttime": "2021-07-31 07:52:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,谷歌,google,hcl", "title": "匹兹堡谷歌承包商批准与 HCL 的交易", "title_en": "\n\t\t\t\tPittsburgh Google contractors ratify deal with HCL\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/pittsburgh-google-contractors-ratify-deal-with-hcl/", "via": "", "real_tags": ["交易", "谷歌", "google", "hcl"]}, {"category": "", "categoryclass": "", "imagename": "fc14355f46e0d0081ecd3e10f96e983c.jpg", "infoid": 1070762, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳至主要内容 在 2020 年夏天，英特尔似乎已准备好取得胜利。然后一切都出错了。 “简而言之：英特尔搞砸了，”Forrester Research 的研究主管 Glenn O&#39;Donnell 解释说。英特尔被迫向全世界宣布，它将把其芯片的下一个重大制造里程碑再推迟几年，承认英特尔再次落后于竞争对手。经过多年的错误押注、制造延迟和领导层变动，这位之前无可争议的芯片制造王发现自己面临着几十年来从未面临过的竞争——同时发现自己正处于公司的最低谷。 2020 年，英特尔被迫承认将严重推迟其最近更名为英特尔 4 的 7nm 节点。这导致领导层外流，并承认英特尔可能不得不面对不可想象的事情并外包自己的制造。英特尔设法度过了去年夏天的地狱，代价是被迫自上而下地重新思考其业务。现在它有了一个新的 CEO，一个新的计划，以及一个渴望更多芯片的市场。它设定了雄心勃勃的目标，揭示了其最详细的工艺路线图，并做出大胆承诺，如果能够避免过去十年中常见的陷阱，将在 2025 年之前跃进并重新夺回处理器领先地位。未来几年将是一个成败的救赎时刻，要么纠正路线，要么让英特尔陷入可能的最后一幕。 “这不是突然发生的事情。这些东西会随着时间的推移不断积累，不断积累，直到发生某些事情导致整个事物崩溃，”奥唐奈说。多年来，英特尔的情况一直在下滑，但直到去年夏天——以及 7nm 的延迟——英特尔外观的裂缝开始看起来更像是峡谷。 “纵观其历史，直到最近，制造仍然是英特尔正在发生的神奇事情之一——英特尔的秘密武器之一是制造创新，这就是为什么 7nm 如此令人尴尬，”O&#39;Donnell说。 “从心理上来说，这对整个公司以及整个市场都是一个巨大的打击，因为这意味着英特尔不再拥有那个秘密武器。”英特尔今天仍然制造自己的芯片，这一事实在业界是罕见的。绝大多数科技公司都是无晶圆厂，这意味着它们将芯片的制造外包给其他公司——即使它们是自己设计的。 AMD、英伟达、高通、苹果、联发科和博通是当今无晶圆厂公司的一些主要例子。\n英特尔是少数仍自行设计和制造硬件的计算机芯片公司之一——它可以根据自己的规格和目的设计流程的每个部分，并且对其产品的实际制造拥有无与伦比的控制权。它实际上拥有自己的晶圆厂，而且它是目前唯一一家仍在美国生产芯片的大公司。几十年来，制造业一直是英特尔最大的优势之一。但是，该公司在 10 纳米延迟多年之后才刚刚恢复，错过了对 7 纳米的预测，这一事实是一个巨大的打击。英特尔去年开局良好。该公司宣布了其 Tiger Lake 芯片（从技术上讲是该公司的第三代 10nm 设计），该芯片还见证了该公司酝酿已久的 Xe GPU 架构的首次亮相，为其带来了令人兴奋的新一波处理器浪潮，在该领域（图形）方面拥有强大的实力长期以来一直是英特尔的弱点之一。这些芯片提供了出色的性能，尽管 - 就像他们自己拖延已久的 Ice Lake 前辈一样 - 它们仅限于功率较低的笔记本电脑。事实证明，对 10nm 和英特尔新显卡的等待是值得的：新芯片发布时在单核性能上超过了 AMD，而且它们实际上不负众望。还有更多事情要做：英特尔只为其最弱的笔记本电脑产品发布了 10 纳米芯片；如果您购买的是轻薄型计算机，它会比以往任何时候都更好，具有新架构节点带来的所有性能和能效改进。但该公司几乎用了整整一年的时间才发布了更强大的 H 系列 Tiger Lake 芯片，用于专为游戏和视频编辑而设计的更强大的笔记本电脑，这些笔记本电脑才刚刚开始看到这些好处。而且它还没有将其台式机芯片转移到 10nm（这可能会对今年的芯片造成不利影响，这些芯片试图在 14nm 架构上融合 10nm 设计，但结果喜忧参半）。经过多年的制造延迟，英特尔似乎几乎有可能重回正轨。但是当六月到来时，英特尔的麻烦又开始了。经验丰富的工程师吉姆·凯勒宣布他出于“个人原因”离开公司。凯勒是芯片设计界的 Fixit 先生：他帮助苹果开发了内部的 A 系列芯片，帮助了 AMD 的 Zen 架构，以及特斯拉的自动驾驶计算机芯片。英特尔于 2018 年让 Keller 加入，虽然该公司没有公开定义他在领导英特尔的“片上系统 (SoC) 开发和集成”硅工程团队之外的角色，但他的工作很明确：作为英特尔的领导者10,000 人的半导体工程团队，他要让英特尔重回正轨。凯勒以在公司的短暂工作而闻名——他经常进来，开始工作，然后在烟花开始之前离开。但他在英特尔不到两年的时间和他的突然离职标志着他任期最短的一年，也是英特尔夏天的一个不吉利的开端。但几天后还有更多坏消息等着英特尔，当时苹果在 2020 年 WWDC 上宣布将改用自己的基于 Arm 的芯片，而不是使用了十多年的英特尔处理器。原因类似于苹果在 2005 年首次从 PowerPC 转向英特尔时：彭博社报道称，这家 Mac 制造商权衡并衡量了英特尔的路线图，最近已经饱受拖延的困扰，并发现它有缺陷。\nApple 的 2019 年第二季度收益报告更进一步，直接将 Mac 销量下降归咎于英特尔的处理器供应问题。 “我们相信，如果没有这些限制，我们的 Mac 收入会比去年有所增长，”首席执行官蒂姆库克指出。对苹果来说，离开英特尔是让 Mac 向前飞跃的必要选择 至少一位前英特尔工程师证实了这些挫败感：直言不讳的首席工程师 François Piednoël 告诉 PC Gamer，这种转变至少部分是由于该公司 Skylake 的质量保证不佳筹码。但转向 Arm 芯片不仅仅是宣布苹果对英特尔的拖延感到厌烦——这是科技最有影响力的公司之一向世界宣布英特尔的芯片不再符合要求。 “当我们做出大胆的改变时，是出于一个简单而有力的理由：这样我们就能制造出更好的产品，”库克在公告中说——对苹果来说，让英特尔落后是让 Mac 向前飞跃的必要选择。果然，Apple 的第一款 M1 芯片在各个方面都超出了预期，去年晚些时候问世时颠覆了我们对笔记本电脑性能的概念。但这一切仍然是英特尔最大的迫在眉睫的灾难的前奏：在其 2020 年第二季度财报电话会议上宣布，该公司在其 7nm 工艺中发现了“缺陷模式”，使进展至少偏离了一年。下一代芯片原定于 2021 年末发布，是英特尔让生产重回正轨并赶上台积电等其他硅生产商战略的关键部分，现在被推迟到 2023 年初。这是一个大问题对于英特尔。正如计算机工程教授、计算机架构领域的领先研究员 Natalie Enright Jerger 所解释的那样，芯片制造商可以通过两种主要方式提高性能：新设计，例如在芯片上安装更多内核或新的 AI 加速器；并添加更多晶体管，这些晶体管主要来自新的和更小的架构。 “如果无法缩小节点，他们就会失去性能的两个关键驱动因素之一。他们仍然能够进行创新……但他们无法像 AMD 那样获得更多晶体管的额外胜利。” AMD 也是台积电更先进生产的受益者：其 Ryzen 芯片自 2019 年以来一直采用 7nm，当其 5nm Zen 4 芯片在 2022 年出货时，它可能会再次超越英特尔。\n英特尔实际上是在一只手被绑在背后进行竞争。它完全跟上的事实证明了其内部生产提供的优势，以及其独特的 Foveros 包装技术等方面的创新——所有这些都是前面提到的“秘方”——但新产品的持续延迟架构表明这是英特尔只能跟上这么长时间的技巧。夏季事件的影响很快就来了。 7nm 消息传出后不久，该公司前硬件主管 Venkata “Murthy” Renduchintala 离职。英特尔前首席执行官鲍勃·斯旺（Bob Swan）——在登上最高职位之前曾是英特尔的首席财务官——被前英特尔工程师帕特·盖尔辛格（Pat Gelsinger）取代，后者以帮助开拓英特尔在 1980 年代的一些最早的创新而闻名，并担任公司的第一任首席技术官. Gelsinger 是一名旨在帮助调整船舶的雇员，这向员工和全世界表明英特尔想要认真对待芯片并再次发挥其优势。 Gelsinger 毫不犹豫地宣布了一项新的英特尔“IDM 2.0”战略，该战略将使该公司将部分生产外包给台积电和三星等其他公司，并通过新的英特尔代工厂将英特尔打造成其他公司的芯片制造商服务业务，并制定雄心勃勃的目标，到 2025 年让英特尔回到尖端芯片设计的前沿。 新公布的路线图——英特尔在一段时间内分享的对其未来产品的最详细介绍——以及其技术的更名更好地将它们与竞争对手联系起来的节点是该策略的一部分；公司的一项重要声明，表明它计划返回。在对 The Verge 的评论中，英特尔执行副总裁 Michelle Johnston Holthaus 表示：“我们拥有坚实的基础，以及一个令人兴奋的战略愿景摆在我们面前，”强调了公司的新投资和路线图。但到达那里将是一个挑战。英特尔——这家曾经以不可动摇的 CPU 制造领导者而闻名的公司——不可否认地落后了。虽然它的一些新公告，比如它正在向亚利桑那州的新工厂投资 200 亿美元，听起来令人印象深刻，但它们的赌注需要数年时间才能获得回报。与宣布在 2019 年投资 1160 亿美元用于半导体生产的三星或宣布计划在未来三年投资超过 1000 亿美元扩大产能的台积电等竞争对手相比，它们也相形见绌。甚至英特尔的新路线图也无法保证未来的发展。那里有很多雄心勃勃的目标，包括在 2023 年推出其拖延已久的 7nm Intel 4 芯片，以及在 2024 年推出采用 Intel 20A 的下一代晶体管架构。但 Intel 正在摆脱最近的 10nm 和 7nm 挣扎，需要使确保它在这里设定的激进的年度速度不会遇到可能在 PC 行业产生连锁反应的类似障碍。三星和台积电等竞争对手已经准备好推出具有更高晶体管密度和更先进技术的下一代芯片，这意味着 AMD 和高通等新近复苏的竞争对手将等待填补英特尔的空缺。正如 O&#39;Donnell 解释的那样，“&#39;他们现在必须跨越式发展——仅仅赶上是不够的。”\n去年夏天为英特尔敲响了警钟，清楚地表明多年的延误和错失的机会是一笔钱，它不能再继续过去了。英特尔在这一年所做的改变是正确的：带回经验丰富的领导者、硬件设计师，并专注于让其半导体业务重回正轨。英特尔将不得不重新获得信任并重建其作为 OEM 和客户可以信赖的领导者的声誉，并表明它仍然可以在芯片的前沿竞争。去年是一个很好的第一步，球在英特尔的球场上。但现在，它需要交付。", "note_en": "Skip to main content                                                                                                                In the summer of 2020 Intel seemed poised for triumph. Then it all went wrong. “To put it briefly: Intel blew it,” explains Glenn O’Donnell, a research director at Forrester Research. Intel was forced to announce to the world that it’d be delaying its next major manufacturing milestone for its chips for another few years, an admission that, once again, Intel was falling behind the competition.\n After years of misplaced bets, manufacturing delays, and changing leadership, the previously undisputed chip-making king has found itself faced by competition the likes of which it hasn’t faced in decades — while simultaneously finding itself at what could be the company’s nadir.\n In 2020, Intel was forced to admit that it would be severely delaying its 7nm node, recently rebranded as Intel 4. This precipitated an exodus of leadership and the admission that Intel might have to face the unthinkable and outsource its own manufacturing.\n Intel managed to survive its last summer hell, at the cost of being forced to dramatically rethink its business from the top down. Now it has a new CEO, a new plan, and a market hungry for more chips. It’s set ambitious goals, revealing its most detailed process roadmap and a bold promise to jump ahead and reclaim processor leadership by 2025, if it can avoid the familiar pitfalls of the past decade. The coming years will be a make-or-break moment of redemption that will either right the course — or send Intel into what might be its final tailspin.\n “It wasn’t something that just happened suddenly. These things build, they build and build over time until something happens that causes the whole thing to kind of crumble,” says O’Donnell. Things have been headed in a downward trajectory for Intel for years, yet it was last summer — and the delay on 7nm — when the cracks in Intel’s facade started to look a lot more like canyons.\n  “For all of its history, until recently, manufacturing was one of the magic things that was going on at Intel — part of the secret sauce of Intel was the manufacturing innovations, and that’s why 7nm was such a big embarrassment,” O’Donnell says. “It was a huge hit, psychologically, across the company, but also across the market because that meant Intel no longer had that secret sauce.”\n The fact that Intel still makes its own chips today is a rarity in the industry. The vast majority of tech companies are fabless, meaning that they outsource the fabrication of their chips — even if they design them themselves — to other companies. AMD, Nvidia, Qualcomm, Apple, MediaTek, and Broadcom are some of the leading examples of fabless companies today.\n Intel is one of the few computer chip firms that still designs  and manufactures its own hardware — it can design every part of the process to its own specifications and purposes, and it has an unmatched control over the actual manufacturing of its products. It actually  owns its own fabs, and it’s the only major company still making chips in the US right now.  Manufacturing has been one of Intel’s biggest strengths for decades. But the fact that the company missed its projections for 7nm, coming after years of 10nm delays that it was only just recovering from, was a huge blow.\n  Last year started well for Intel. The company  announced its Tiger Lake chips (technically the company’s third-generation 10nm designs) which also saw the debut of the company’s long-gestating Xe GPU architecture, giving it an exciting new wave of processors with prowess in an area (graphics) that had long been one of Intel’s weaknesses. The chips offered great performance, even though — much like their own  long-delayed Ice Lake predecessors — they were limited to only lower-powered laptops. The wait for 10nm and Intel’s new graphics turned out to have been worth it: the new chips outpaced AMD’s in single-core performance  when they were released, and they actually lived up to the hype.\n There was still more to do: Intel had only released 10nm chips for its weakest laptop products; if you were buying a thin-and-light computer, it’d be better than ever, with all the performance and power efficiency improvements that the new architecture node brought with it. But it took the company almost a full year before it released  more powerful H-series Tiger Lake chips for beefier laptops designed for gaming and video editing, which are only just starting to see those benefits. And it still has yet to move its desktop chips to 10nm (to the  potential detriment of this year’s chips, which tried to  fuse 10nm designs on 14nm architectures to mixed results).\n After years of manufacturing delays, Intel almost seemed to maybe, possibly, be heading back on track.\n But when June rolled around, Intel’s troubles started back up again. Seasoned engineer Jim Keller announced that  he was leaving the company for “personal reasons.”  Keller is the Mr. Fixit of the chip design world: he helped Apple with its in-house A-series chips, AMD with its Zen architecture, and Tesla with its Self-Driving Computer chip.  Intel brought Keller on board in 2018, and while the company didn’t publicly define his role beyond leading Intel’s silicon engineering team for “system-on-chip (SoC) development and integration,” his job was clear: as the leader of Intel’s 10,000-person semiconductor engineering team,  he was to get Intel back on track.\n Keller is known for short stints at companies — he often comes in, sets things in motion, and leaves before the fireworks start. But his less than two years at Intel and his abrupt departure marked one of his shortest tenures yet, and an inauspicious start to Intel’s summer.\n But there was more bad news waiting for Intel just a few days later, when  Apple announced at WWDC 2020 that it would be making the switch to its own Arm-based chips, away from the Intel processors it had been using for over a decade. The reasoning was similar to when Apple first switched from PowerPC to Intel in 2005:   Bloomberg reported that the Mac maker weighed and measured Intel’s roadmaps, already riddled with recent delays, and found it wanting.\n Apple’s Q2 2019 earnings report goes even further, straight up blaming a dip in Mac sales that quarter on processor supply issues with Intel. “We believe that our Mac revenue would have been up compared to last year without those constraints,” CEO Tim Cook noted.\n To Apple, leaving Intel behind was a necessary choice to let the Mac leap forward\n At least one former Intel engineer corroborates those frustrations:  outspoken principal engineer François Piednoël told  PC Gamer that the switch was at least partially due to poor quality assurance with the company’s Skylake chips.\n But the switch to Arm chips wasn’t just an announcement that Apple was fed up with Intel’s delays — it was a declaration to the world from one of tech’s most influential companies that Intel’s chips just weren’t up to snuff anymore. “When we make bold changes, it’s for one simple yet powerful reason: so we can make much better products,” Cook said at the announcement — to Apple, leaving Intel behind was a necessary choice to let the Mac leap forward. And sure enough,  Apple’s first M1 chips exceeded expectations on every front,  upending our concept of laptop performance when they arrived later last year.\n But all that was still a prelude to Intel’s biggest looming disaster:  an announcement on its Q2 2020 earnings call that the company had identified a “defect mode” in its 7nm process, derailing progress by at least a year. The next-generation chip,  originally set for a late 2021 release and a crucial part of Intel’s strategy to get its production back on track and to catch up to other silicon producers like TSMC, were now delayed until early 2023.\n And that’s a big problem for Intel. As Natalie Enright Jerger, a professor in computer engineering and leading researcher in computer architectures explains, there are two main ways that chipmakers can improve performance: new designs, like putting more cores or new AI accelerators onto chips; and adding more transistors, which primarily come from new and smaller architectures. “Without being able to shrink the node they’re losing out on one of the two key drivers of performance. They’re still able to innovate … but they’re not able to get that additional win of more transistors that AMD has.”\n AMD is also a beneficiary of TSMC’s more advanced production: its Ryzen chips have been on 7nm since 2019, and it could be poised to leapfrog Intel again when its 5nm Zen 4 chips ship in 2022.\n  Intel is effectively competing with one hand tied behind its back. The fact that it’s keeping up at all is a testament to the advantages its in-house production offers, and the innovations in things like its  unique Foveros packaging technologies — all of which is the aforementioned “secret sauce”— but the continued delays to new architectures show it’s the kind of trick that Intel can only keep up for so long.\n The fallout from the summer’s events came quickly. Shortly after the 7nm news hit, Venkata “Murthy” Renduchintala, the company’s former hardware chief,  left his position. And Intel’s former CEO Bob Swan — previously Intel’s chief financial officer before taking the top spot —  was replaced by Pat Gelsinger, a former Intel engineer best known for helping pioneer some of Intel’s earliest innovations in the 1980s and serving as the company’s first chief technology officer. Gelsinger was a hire meant to help right the ship, a sign to both employees and the world that Intel wanted to get serious about chips and play to its strengths again.\n Gelsinger has wasted no time, already announcing a  new “IDM 2.0” strategy for Intel that will see the company outsource some of its production to other players like TSMC and Samsung, work to establish Intel as a chipmaker for other companies through a new Intel Foundry Service business, and create an ambitious goal to return Intel to the forefront of cutting-edge chip designs by 2025.\n The  newly announced roadmap — the most detailed look at its future products that Intel has shared in some time — and the renaming of its technology nodes to better contextualize them with competitors is part of that strategy; a major declaration from the company that it has a plan to make its way back.\n In a comment to  The Verge, Intel executive vice president Michelle Johnston Holthaus said that “We have a solid foundation in place, and an exciting, strategic vision ahead of us,” highlighting the company’s new investments and roadmap.\n But it’ll be a challenge to get there. Intel — the company once known for being the untouchable leader of CPU making — is undeniably behind. While some of its new announcements, like the $20 billion it is investing into new factories in Arizona, sound impressive, they’re bets that will take years to pay off. They also pale in comparison to competitors  like Samsung, which announced a decade-long $116 billion investment in semiconductor production in 2019, or TSMC, which has announced plans to  invest over $100 billion in expanding capacity over the next three years.\n  Even Intel’s new roadmap is not guaranteed for the future. There are a lot of ambitious goals there, including launching its long-delayed 7nm Intel 4 chips in 2023, and next-generation transistor architecture with Intel 20A in 2024. But Intel is coming off its recent 10nm and 7nm struggles and will need to make sure that its aggressive annual pace it’s setting here doesn’t hit similar snags that could cascade through the PC industry. And competitors like Samsung and TSMC are  already gearing up their  next generation of chips with higher transistor density and more advanced technologies, meaning that newly reinvigorated competitors like AMD and Qualcomm will be waiting to pick up any of Intel’s slack. As O’Donnell explains, “‘They’ve got to leapfrog now — simply catching up is insufficient.”\n Last summer was a wake-up call for Intel, a clear sign that the years of delays and missed opportunities were a buck that it could no longer continue to pass. The changes that Intel’s made in the year since are the right ones:  bringing back experienced leaders,  hardware designers, and focusing on getting its semiconductor business back on track. Intel will have to regain trust and rebuild its reputation as a leader that OEMs and customers can rely on and show that it can still compete on the bleeding edge of chips. The last year was a good first step, and the ball’s in Intel’s court. But now, it needs to deliver.", "posttime": "2021-07-31 07:43:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,芯片,apple,2020,苹果", "title": "看看英特尔惨淡的 2020 年，它看到了其 7nm 架构的延迟，苹果转向基于 Arm 的芯片，以及吉姆凯勒和其他高管的离职", "title_en": "A look at Intel's dismal 2020, which saw the delay of its 7nm architecture, Apple's switch to Arm-based chips, and the departure of Jim Keller and other execs", "transed": 1, "url": "https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["英特尔", "芯片", "apple", "2020", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "2fd44097644487458a2d7f2349cfa28d.jpg", "infoid": 1070761, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由 30 岁以下获奖者史蒂文·艾德曼 (Steven Eidelman) 共同创立和领导的兽医公司 Modern Animal 今天宣布已筹集了 7550 万美元。资金来自过去一年的两笔（之前未宣布的）投资：由 True Ventures 和 Addition 领投的 3550 万美元 A 系列，以及由 Founders Fund 领投的 4000 万美元 B 系列，后者还在 2019 年领投了 Modern Animal 的 1300 万美元种子轮. Modern Animal 的联合创始人兼首席执行官 Eidelman 表示，他们创办公司时的目标是为 21 世纪创造宠物护理：通过其移动应用程序无缝访问、24/7 远程医疗、提供美丽的诊所以及兽医专业人员可以感觉舒适。根据 Eidelman 的说法，作为宠物主人在诊所承受压力和焦虑的经历非常昂贵，因为除了他们自己（不是政府，通常也不是公司），没有其他人为客户的宠物支付费用，所以他们的目标是让这种体验物有所值。 “大多数人认为宠物公司自己为宠物服务，但我们考虑的是我们如何为人类服务，”艾德曼说。 “在很多方面，我们都认为自己是第一家以人为本的兽医公司。”此外，Eidelman 表示，兽医行业正在经历一场巨大的危机，该行业的流失率非常高，主要是由于压力以及完成 4 年医学院学业的兽医面临巨额债务。 “有很多了不起的兽医，但他们还不够，”艾德曼说。 “尤其是现在，走出大流行似乎每个人都养了一只宠物，所以我们想知道我们如何为从业者创造更高效、更有成效的体验。”艾德曼说，现代动物通过技术、创造效率和更智能的劳动模式来解决问题。\n特别受欢迎的是 Modern Animal 的远程医疗产品，它既为宠物主人节省了时间和金钱，也为兽医节省了资源，因为他们不必花时间检查可能健康的宠物。 Modern Animal 提供会员模式，每只宠物收取 100 美元的年费，包括所有考试费用和 24/7 远程医疗。除了 24 小时急诊和专家护理（如肿瘤学家）外，该公司还通过提供普通兽医诊所所能提供的一切来创造收入。目前，Modern Animal 在西好莱坞经营一个地点（于 2020 年 4 月开业），该地点已达到 4,000 名活跃会员，目前有一个候补名单。艾德曼说，每个成员每年花费约 1000 美元，平均每年来诊所 5 次，同时每年通过远程医疗与兽医互动约 40 次。该公司计划在未来 18 个月内在加州开设大约 12 家门店。在共同创立 Modern Animal 之前，Eidelman（其父母是乌克兰移民）毕业于宾夕法尼亚大学，曾在贝恩公司担任管理顾问，并共同创立了一家名为 Whistle 的宠物可穿戴设备公司，该公司于 2016 年以 1.17 亿美元的价格出售给了火星（感谢2014 年，Eidelman 进入了 30 岁以下消费科技榜单）。两年后，艾德曼与 Ben Jacobs（Whistle 的联合创始人，目前是 Modern Animal 的董事会成员）和 David Bowman（目前是 Modern Animal 的董事会成员）共同创立了 Modern Animal。这家总部位于洛杉矶的公司目前拥有 80 名员工，通过 1350 万种子轮融资，Modern Animal 的股权投资总额已增长至 8900 万美元。 True Ventures 的合伙人托尼康拉德 (Tony Conrad) 表示，在宠物行业，消费者和兽医方面存在一系列问题，据他说，在现代动物的案例中，这可能更为突出和中心。 “通过解决兽医面临的一些挑战和压力点，您可以创造一种文化，然后以更真诚、更坦率、更快乐的方式与最终用户互动：宠物主人和宠物本身，”康拉德说。", "note_en": "Veterinary company  Modern Animal, cofounded and spearheaded by Under 30 honoree Steven Eidelman, announced today that it has raised $75.5 million. The funding comes from two (previously unannounced) investments over the past year: a $35.5M Series A led by True Ventures and Addition, and a $40M Series B led by Founders Fund, who also led the Modern Animal&#39;s $13 million seed round in 2019.\n    Eidelman, cofounder and CEO of Modern Animal says that their goal when starting the company was to create pet care for the 21st century: seamless access through its mobile app, 24/7 telemedicine, offering beautiful clinics, and a place where veterinary professionals would feel comfortable.\n  According to Eidelman, the experience of being in the clinic as a pet owner with the stress and the anxiety is very expensive, given there’s nobody else paying for clients’ pet’s care other than themselves (not the government and usually not the company), so their goal was to make that experience worth the money and the time.\n    “Most people think of pet companies serving the pet themselves, but we think about how we serve the human,” Eidelman says. “In many ways we think of ourselves as being the first human-focused veterinary company.”\n    In addition, Eidelman says that the veterinary profession is going through a  massive crisis, with the churn in the industry extremely high, mainly due to stress and because veterinarians who have finished 4 years of medical school face large debt.\n    “There’s a lot of amazing veterinarians, but there’s not enough of them,” Eidelman says. “Especially now, coming out of the pandemic everyone seems to have gotten a pet, so we wonder how do we create a more efficient and productive experience for practitioners.”\n    Eidelman says that Modern Animal solves the problem through technology, by creating efficiency and a more intelligent labour model.\n  What has been particularly popular is Modern Animal’s telemedicine offering, which both saves time and money for pet owners, as well as resources when it comes to veterinarians, as they don’t have to spend the time checking a pet that is likely healthy.\n  Modern Animal offers a membership model charging an annual fee of $100 per pet, which covers all exam fees and 24/7 telemedicine. The company also generates revenue by offering everything that a general veterinarian practice would offer, with the exception of 24 hour emergency and specialists’ care (such as oncologists).\n  At the moment, Modern Animal operates one location (opened in April of 2020) in West Hollywood, which has hit capacity at 4,000 active members and currently has a waitlist. Eidelman says that each member spends about $1000 a year, and on average comes to the clinic 5 times a year, while interacting with veterinarians about 40 times a year through telemedicine. The company’s plans are to open about a dozen locations over the next 18 months across California.\n    Prior to cofounding Modern Animal, Eidelman (whose parents are Ukrainian immigrants), graduated from University of Pennsylvania, worked as a management consultant at Bain, and cofounded a pet wearables company called Whistle, which was  sold to Mars for $117 million in 2016 (thanks to Whistle in 2014 Eidelman made the  Under 30 Consumer Technology list). Two years later, Eidelman cofounded Modern Animal along with Ben Jacobs (cofounder of Whistle and currently a board member at Modern Animal), and David Bowman (currently a board member at Modern Animal).\n  The Los Angeles-based company currently has 80 employees, and with the 13.5 million seed round, the total amount of equity investment in Modern Animal has grown to $89 million.\n  Tony Conrad, a partner at True Ventures, says that in the pet industry there’s a set of problems for the consumers and the veterinarians’ side, which according to him, is probably even more front and center in the case of Modern Animal.\n  “By addressing some of the challenges and stress points that happen for vets, you create a culture which then engages with the end users: the pet owner and the pet itself in a more sincere, and frankly happier way,” Conrad says.", "posttime": "2021-07-31 07:42:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "宠物,劳动力,led,兽医", "title": "Modern Animal 是一家为兽医提供 24/7 远程医疗和更“智能”劳动力模型的宠物护理服务公司，在由 Founders Fund 领投的 B 轮融资中筹集了 4000 万美元", "title_en": "Modern Animal, a pet care service offering 24/7 telemedicine and a more “intelligent” labor model for veterinarians, raises $40M Series B led by Founders Fund", "transed": 1, "url": "https://www.forbes.com/sites/igorbosilkovski/2021/07/30/veterinary-company-modern-animal-announces-755-million-in-raised-capital/", "via": "", "real_tags": ["宠物", "劳动力", "led", "兽医"]}, {"category": "", "categoryclass": "", "imagename": "e801e75fd8923e050ac7d0d3e5383062.jpeg", "infoid": 1070760, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此更新使视频更上一层楼。群组视频通话现在最多可容纳 1000 名观众，视频消息录制质量更高且可以扩展，常规视频可以以 0.5 或 2 倍的速度观看。我们还为所有视频通话添加了带声音的屏幕共享，包括一对一通话——等等。群组视频通话允许多达 30 位用户通过他们的相机和屏幕播放视频——现在 1000 人可以观看从在线讲座到现场说唱比赛的任何内容。我们将继续增加此限制，直到地球上的所有人类都可以加入一个群组通话并观看我们庆祝的 yodel（即将推出）。要发起群组视频通话，请从您是管理员的任何群组的信息页面（在 Android 上的 ⋮ 菜单中）创建语音聊天，然后打开您的视频。视频消息是一种无需在图库中添加其他视频即可查看或分享周围环境的快捷方式。它们现在具有更高的分辨率，您可以点击视频消息来扩展它并接收所有这些额外的像素。点击扩展的视频消息会暂停它，并让您有机会快进或后退消息，以防您错过一个字。要录制视频消息，请点击消息栏中的麦克风图标以从语音消息录制切换到视频。按住进行录制，然后点击相机图标切换回来。\n设备中的音频将在您录制时继续播放，因此您现在可以跟着自己喜欢的歌曲唱歌或回复，而无需暂停播客。此外，使用后置摄像头录制可让您捏住放大并捕捉远处的事物或添加戏剧效果（不包括怪异的音乐）。为了通过讲座视频和慢动作回放功夫动作，媒体播放器现在支持 0.5x、1.5x 和 2x 播放速度。我们的 Android 开发人员是蜂鸟的粉丝，因此他的应用程序还支持 0.2 倍速度。要更改视频播放速度，请在全屏观看视频时点按 Android 上的 ⋮ 或 iOS 上的 ⋯。在 Android 上，您还可以在播放语音或视频消息时按住 2X 按钮在 0.5x、1x、1.5x 和 2x 播放速度之间切换。自 2019 年以来，在视频和 YouTube 链接的字幕或回复中添加 0:30 等时间戳可让用户跳转到那一秒 – 现在您可以按住消息中的时间戳来复制链接并在另一个聊天。屏幕共享也已添加到 1 对 1 通话中，现在包括在任何视频通话中广播时来自设备的声音。因此，请确保在轮到你之前退出超级马里奥 - 或者不要，并使用游戏进行音效。在任何通话期间打开视频时，您都可以滑动以选择摄像头或共享您的屏幕——并使用视频预览来确保一切都在直播前完美无缺。\n要在视频通话期间共享您的屏幕，请点击相机按钮并选择您的屏幕作为视频源。任何聊天中的消息都可以设置为在 1 天或 1 周后自行删除 - 现在是 1 个月，以防您需要聊天在消失之前保留一个完整的农历周期。要在 Android 上启用计时器，请点按 ⋮ &gt; 清除历史记录，然后选择一个持续时间。在 iOS 上，按住一条消息，点击选择 &gt; 清除聊天（左上角）&gt; 启用自动删除。媒体编辑器允许您使用图画、文本和贴纸来说明和装饰您的照片和视频。为了更轻松地添加精细细节（或完美的胡须和尖耳朵），现在放大时画笔的宽度会减小 - 为您提供专业的精确度。要随时更改画笔的宽度，请从颜色选择器中向上拖动点。 Telegram 桌面应用程序现在拥有自己的照片编辑器，可以裁剪、旋转或翻转图像——并添加绘图或贴纸。桌面独有，您可以通过取消选中“压缩图像”框将编辑后的版本作为未压缩文件发送。新的动画使密码锁定界面比以前更加快捷。如果您使用的是动画背景，它也会出现在密码锁定屏幕上。迪斯科舞会永不停歇。\n我们在“设置”中添加了一个新提示，以帮助您练习输入两步验证密码。如果您忘记了密码，即使您没有恢复电子邮件，也可以使用一个新的密码重置选项——只要您仍然登录到您的帐户。该过程需要 7 天，并且可以从您的任何设备取消。与表情符号和贴纸一样，文本消息具有新的轻量级动画——当您点击发送时，您的文本会随着它飞入聊天室而平滑地转换为消息气泡。 iOS 用户在之前的更新中收到了这些节能动画。应用程序内相机现在使用您设备上的所有缩放级别 - 包括 0.5 倍和 2 倍（如果可用）。您还可以按住以打开缩放轮，让您可以精细控制放大和缩小。要使用应用内相机，请点击消息栏中的图标，然后点击附件菜单中的相机源。通过点击转发菜单中的“选择”来选择转发消息的多个收件人，与所有最好的朋友分享您的最佳模因。在聊天列表中用两根手指快速滚动可选择多个聊天进行批量操作，例如存档、删除或全部标记为已读。\n现在，当您在群聊中滚动时，个人资料图片会跟随消息，因此您始终知道谁发送了每个消息，即使是一长串。单词。后。其他。没有新的动画表情符号，电报更新就不算完整。与往常一样，只需发送带有单个表情符号的消息即可在聊天中获取其中一个：今天的更新就到此为止——我们正在以 2 倍的速度处理下一个。", "note_en": "This update takes video to the next level.  Group video calls now have up to  1000 viewers,  video messages record in higher quality and can be expanded, regular videos may be watched at  0.5 or  2x speed. We&#39;ve also added  screen sharing with sound to  all video calls, including  1-on-1 calls — and much more.\n  Group video calls allow up to 30 users broadcast video from both their camera and screen – and now  1000 people can watch anything from online lectures to live rap battles.\n We will keep  increasing this limit until all humans on Earth can join one group call and watch us yodel in celebration (coming soon).\n  To start a Group Video Call, create a Voice Chat from the info page (in the ⋮ menu on Android) of any group where you are an admin – then turn your video on.\n  Video messages are a quick way to check in or share your surroundings without adding another video to your gallery. They now have  higher resolution and you can tap on a video message to  expand it and take in all those extra pixels.\n  Tapping on an expanded video message  pauses it and gives you the opportunity to  fast forward or  rewind the message in case you missed a word.\n To record a video message, tap the microphone icon in the message bar to switch from voice message recording to video. Press and hold to record, then tap the camera icon to switch back.\n Audio from your device  will keep playing as you record so you can now sing along to your favorite songs or reply without pausing your podcast. Additionally, recording with your rear camera lets you pinch to  zoom in and capture things at a distance or add a dramatic effect (eerie music not included).\n  To power through lecture videos and replay kung fu moves in slow motion, the media player now supports  0.5x,  1.5x and  2x playback speeds. Our Android developer is a fan of hummingbirds, so his app also supports  0.2x speed.\n  To change your video playback speed, tap ⋮ on Android or ⋯ on iOS when watching a video in fullscreen.\n On Android, you can also press and hold the  2X button when playing  voice or  video messages to switch between  0.5x,  1x,  1.5x and  2x playback speed.\n  Since  2019, putting a  timestamp like  0:30 in the captions or replies to videos and YouTube links lets users jump to that exact second – and you can now press and hold on a timestamp in a message to  copy the link and share the moment in another chat.\n  Screen sharing has been added to  1-on-1 calls as well, and now includes the  sound from your device when broadcasting in any video call. So make sure you quit  Super Mario before its your turn to present — or don&#39;t, and use the game for sound effects.\n  When switching on video during any call, you can swipe to choose a camera or share your screen instead — and use the  video preview to make sure that everything is perfect before going live.\n To share your screen during a video call, tap the camera button and select your screen as the video source.\n  Messages in any chat can be set to  erase themselves after  1 day or  1 week – and now  1 month, in case you need your chats to stick around for a full lunar cycle before disappearing.\n  To enable the timer on Android, tap ⋮ &gt; Clear History then choose a duration. On iOS, press and hold a message, tap Select &gt; Clear Chat (top-left) &gt; Enable Auto-Delete.\n  The media editor allows you to illustrate and decorate your photos and videos with drawings, text and stickers. To more easily add fine details (or that perfect mustache and pointy ears), the width of your brush now  decreases as you  zoom in – giving you the precision of a professional.\n  To change the width of your brush at any time, drag the dot up from the color selector.\n The  Telegram Desktop app now has its own photo editor to  crop,  rotate or  flip images – and  add drawings or stickers. Unique to desktop, your edited versions can be sent as  uncompressed files by unchecking the  Compress Images box.\n  New animations make the passcode lock interfaces even snappier than before. If you&#39;re using an  animated background, it will also appear on the  passcode lock screen. The disco never stops.\n   We&#39;ve added a new prompt in Settings to help you  practice entering your Two-Step Verification password.\n  If you  forgot your password, there is a new  password reset option that works even if you don’t have a recovery email — as long as you&#39;re still logged into your account. The process will take  7 days and can be cancelled from any of your devices.\n  Like  emoji and stickers,  text messages have new lightweight animations – when you hit  Send, your text smoothly transforms into the message bubble as it flies into the chat. iOS users received these energy-efficient animations in the  previous update.\n   The in-app camera now utilizes all zoom levels on your device – including  0.5x and  2x if available. You can also press and hold to open a  zoom wheel that lets you zoom in and out with granular control.\n  To use the in-app camera, tap the   icon in the message bar and then tap the camera feed in the attachment menu.\n  Choose  multiple recipients for  forwarded messages by tapping &#39;Select&#39; in the forwarding menu to share your best memes with all your best friends.\n  Scrolling with two fingers in the chat list quickly  selects several chats for  bulk actions like archive, delete or mark all as read.\n Profile pictures now  follow the messages as you scroll in group chats so you always know who sent each one, even in long chains of one. word. after. another.\n   No Telegram update is complete without new animated emoji. As always, simply send a message with a  single emoji to get one of these in a chat:\n  And that&#39;s all for today&#39;s update – we&#39;re working on the next one at  2X speed.", "posttime": "2021-07-31 07:42:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "视频,video", "title": "Telegram 的最新更新增加了多达 1,000 名用户的群组视频通话，可同时进行 30 次广播、视频消息、视频通话期间的屏幕共享等", "title_en": "Telegram's latest update adds group video calls of up to 1,000 users with 30 simultaneous broadcasts, video messages, screen sharing during video calls, more", "transed": 1, "url": "https://telegram.org/blog/video-1000", "via": "", "real_tags": ["视频", "video"]}, {"category": "", "categoryclass": "", "imagename": "8310e9ce0541a13819066ddc7ba687cf.jpg", "infoid": 1070759, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "披头士乐队开创性的中士。在专辑原制作人乔治·马丁的儿子、制作人吉尔斯·马丁承认当前版本“听起来不太对劲”之后，胡椒的孤独之心俱乐部乐队将接受另一个杜比全景声混音。目前的混音由年轻的 Martin 在 2017 年制作，考虑到杜比全景声 (Dolby Atmos) 影院，而不是通过 Apple Music 等服务进行个人聆听。 “我要更换它，”这位两届格莱美奖得主对滚石说。 “很好。但这不对。”专辑当前的 Atmos 混音是在 2017 年 50 周年之际创建的。当时，它被设计为在杜比全景声 (Dolby Atmos) 影院的一系列现场聆听活动中播放。但是现在它可以通过 Amazon Music HD 和最近的 Apple Music 等流媒体服务获得，人们开始在较小的房间或戴着耳机收听它。 “中士。 Pepper&#39;s 是一种戏剧组合，然后被转换成较小的媒体“”。我认为，Pepper&#39;s 是有史以来第一张以杜比全景声 (Dolby Atmos) 混音的专辑。我们以戏剧表演的形式这样做，”马丁解释道。 “所以中士。 Pepper&#39;s 是一种戏剧组合，然后被转换成较小的媒体。因此，这并不完全正确。我要回到影院混音，把它变成所谓的近场杜比全景声，而不是电影院的杜比全景声。它有点亮。它有点数字化。但同样，我要更换它，所以这很酷。”据马丁说，中士的空间组合。 Pepper 的“似乎缺少一点低音和它背后的一点重量。”相比之下，为 2019 年成立 50 周年而制作的 Abbey Road 的 Atmos 混音是“功能更好的 Atmos 混音，因为它在声音上更接近立体声混音”。中士有什么特别吸引人的地方？根据 NPR 的说法，Pepper 的专辑是在单声道录音是大多数制作人的主要关注点的时候发行的。据报道，乔治·马丁花了三周时间对专辑的原始单声道版本进行混音，然后只花了三天时间进行立体声发行。这张专辑有效地经历了音乐的三个时代：首先是单声道，然后是立体声，现在是空间音频。由于空间音频还处于起步阶段，因此有很多著名专辑的示例在新格式中听起来不太合适。我的同事 Chris Welch 在他对 Apple Music 空间音频的评论中概述了其中的一些，其中包括 Weezer 的“Buddy Holly”和“What&#39;s My Age Again?”等歌曲。 by Blink 182 遭受诸如低沉的人声和毫无生气的吉他之类的问题。但希望这些只是与一种相对较新的格式相关的成长的痛苦，有一天我们会像回顾 60 年代早期的立体声录音一样回顾这些曲目。\nGiles Martin 对 Rolling Stone 的完整采访非常值得一读，因为制作人对空间音频潜力的见解非常值得一读。", "note_en": "The Beatles seminal  Sgt. Pepper’s Lonely Hearts Club Band is set to receive another Dolby Atmos mix, after producer Giles Martin, son of the album’s original producer George Martin, admitted that the current version “doesn’t sound quite right.” The current mix, produced by the younger Martin in 2017, was made with Dolby Atmos theaters in mind, rather than personal listening via services like Apple Music. “I’m gonna replace it,” the said the two time Grammy winner  to  Rolling Stone . “It’s good. But it’s not right.”\n The current Atmos mix of the album was created to  coincide with its 50th anniversary in 2017. At the time, it was designed to be played in Dolby Atmos cinemas at a series of live listening events. But now that it is available via streaming services like  Amazon Music HD and  more recently Apple Music, people are listening to it in smaller rooms or with headphones.\n “Sgt. Pepper’s is a theatrical mix that’s then being converted into a smaller medium”\n “ Sgt. Pepper’s was, I think, the first album ever mixed in Dolby Atmos. And we did that as a theatrical presentation,” Martin explains. “So  Sgt. Pepper’s is a theatrical mix that’s then being converted into a smaller medium. Therefore, it’s not quite right. I’m gonna go back to the theatrical mix and make it into what’s called near-field Dolby Atmos, as opposed to the cinema Dolby Atmos. It’s a bit bright. It’s a bit digital. But again, I’m gonna replace it, so that’s cool.”\n According to Martin, the spatial mix of  Sgt. Pepper’s “seems to lack a bit of bass and a little bit of weight behind it.” In comparison, the Atmos mix of  Abbey Road, which was produced for  its 50th anniversary in 2019 is “a much better-functioning Atmos mix because it’s much closer to the stereo mix, sonically.”\n What’s particularly fascinating about  Sgt. Pepper’s, is that the album was released at a time when mono recordings were the primary focus for most producers,  according to  NPR . George Martin reportedly spent three weeks mixing the original mono version of the album, before spending just three days on the stereo release. The album has effectively lasted through three eras of music: first mono, then stereo, and now spatial audio.\n With spatial audio in its infancy, there are plenty of examples out there of well known albums that don’t sound quite right in the new format. My colleague Chris Welch outlines a few of these in his  review of Apple Music’s spatial audio, where songs like “Buddy Holly” by Weezer and “What’s My Age Again?” by Blink 182 suffer from problems like muffled vocals and lifeless guitars. But hopefully these are just growing pains associated with a relatively new format, and we’ll one day look back on these tracks like we look back on early stereo recordings from the 60s.\n Giles Martin’s  full interview with  Rolling Stone is well worth a read for the producer’s insights on the potential for spatial audio.", "posttime": "2021-07-31 07:41:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pepper,doesn,混音", "title": "军士Pepper 将获得新的 Atmos 混音：当前版本“听起来不太对”", "title_en": "Sgt. Pepper’s to get new Atmos mix: current version ‘doesn’t sound quite right’", "transed": 1, "url": "https://www.theverge.com/2021/7/30/22601508/the-beatles-dolby-atmos-sgt-peppers-lonely-hearts-club-band-remix-mono-stereo-apple-music", "via": "", "real_tags": ["pepper", "doesn", "混音"]}, {"category": "", "categoryclass": "", "imagename": "fcaf15fb4fbf8c18fdb132a835bc6018.jpg", "infoid": 1070758, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "➡️想看完整采访，请点击以下链接！加入我们的社区论坛并在评论中分享您的想法。 https://社区....", "note_en": "➡️ If you want to watch the full interview, please click the link below! Join our community forum and share your thoughts in the comments. https://community....", "posttime": "2021-07-31 07:41:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "资本主义,noam,社区论坛", "title": "专访诺姆·乔姆斯基：资本主义与言论自由", "title_en": "Interview with Noam Chomsky: Capitalism and Free Speech", "transed": 1, "url": "https://www.youtube.com/watch?v=HovxY1qBfek", "via": "", "real_tags": ["资本主义", "noam", "社区论坛"]}, {"category": "", "categoryclass": "", "imagename": "7f464542ccfc1847679bf085943478c3.jpg", "infoid": 1070757, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌最近更新并完善了一些 Play 商店政策，现在糖爹应用被禁止了。该政策于 2021 年 9 月 1 日生效，可能会影响 Seeking Arrangement 和 Spoil 等热门应用。 “糖”关系是一种用金钱或礼物换取陪伴的关系。这项新政策不会影响可以在其中获得此类关系的其他应用程序，例如 Tinder。更新，2021 年 7 月 30 日（美国东部时间上午 10 点 50 分）：谷歌已对 Android Police 关于禁止“糖爹”应用程序的原始文章做出回应。回应如下：作为一个平台，我们总是很高兴能够支持我们的开发者合作伙伴，但我们也努力为用户提供安全的体验。在收到非政府组织、政府和其他关注用户安全的用户权益组织的反馈后，我们更新了不当内容政策，以禁止促进性行为以换取报酬的应用程序。这使我们的政策与其他 Google 政策和行业规范保持一致。从本质上讲，谷歌表示它不希望 Play 商店中出现“促进性行为以换取补偿”的应用程序。这可能意味着糖爹应用将需要走“寻求安排”的路线，并尽可能保持其真实性质。毕竟，如果它只是一个连接不同财富类别的人的约会应用程序，那不会属于谷歌在这里的解释。当然，这仍然没有解决一个事实，即糖关系可以发生在所有类型的应用程序上，包括 Tinder 甚至 Instagram。\n原始文章，2021 年 7 月 29 日（美国东部时间下午 12:58）：Google Play 商店上有数百个（如果不是数千个）约会应用程序。您可能已经知道重量级人物，例如 Tinder、Bumble 和 OkCupid。不过，您可能不知道其他一些应用程序，例如 Seeking Arrangement、Elite 或 Spoil。那是因为最后三个应用程序是所谓的糖爹应用程序。 “糖”关系被定义为激励性陪伴。一个常见的例子是一个年轻女人和一个年长的、富有的男人约会，男人向女人赠送昂贵的物品甚至现金。在那种情况下，这个男人会被称为糖爹。然而，糖妈妈也存在，不想把性别扔到所有东西上的人只会使用“糖”这个词。然而，谷歌似乎并不赞成人们通过 Play 商店购买这些安排。在 Android Police 首次发现的一项新政策变化中，谷歌将锤子放在了傍大款应用程序上。术语更改包括删除“有偿性关系（即糖约会）”。谷歌表示，这个应用类别现在属于其不当内容政策。因此，除非谷歌改变主意，否则所有甜蜜约会应用程序都将在 2021 年 9 月 1 日从 Play 商店中消失。谷歌在这里的政策变化的问题在于它似乎过于选择性。是的，例如，Seeking Arrangement 应用程序表明这是一种寻找“互利关系”的方法。但这并不意味着您也无法在其他应用程序（例如 Tinder）上找到这些关系。 Tinder 上几乎所有有魅力的女性都通过该应用程序获得了糖爹安排，这很有可能。当然，也许只有少数人真正做到了，但它肯定会发生。但谷歌不会禁止 Tinder——我们确信这一点。最终，这一政策变化可能只是谷歌打击明确宣传自己为糖爹应用程序的一种方式。 Seeking Arrangement 应用程序在其描述中的任何地方都没有使用“糖”一词，因此它可能不会在 9 月 1 日看到禁令。不过，如果您正在寻找互惠互利的关系，您可能需要学习如何侧载 Android 应用程序将于 9 月推出。", "note_en": "Google just recently updated and refined some of its Play Store policies, and now sugar daddy apps are banned.\n The policy takes effect September 1, 2021, and could affect popular apps like Seeking Arrangement and Spoil.\n A “sugar” relationship is one in which there is money or gifts exchanged for companionship. This new policy does not affect other apps in which relationships like these could be obtained, such as Tinder.\n  Update, July 30, 2021 (10:50 AM ET): Google has issued a response to   Android Police’s original article on the banning of sugar daddy apps. The response is below:\n As a platform we are always excited to support our developer partners, but we also work hard to provide a safe experience for users. We have updated our inappropriate content policy to prohibit apps that facilitate sexual acts in exchange for compensation following feedback we received from NGOs, governments, and other user advocacy groups concerned with user safety. This aligns our policies with other Google policies and industry norms.\n Essentially, Google is saying it doesn’t want apps that “facilitate sexual acts in exchange for compensation” on the Play Store. This likely means that sugar daddy apps will need to take the route of Seeking Arrangement and keep their true nature as vague as possible. After all, if it’s just a dating app that connects people of different wealth categories, that wouldn’t fall under Google’s explanation here.\n Of course, this still doesn’t address the fact that sugar relationships can happen on all types of apps, including Tinder and even Instagram.\n  Original article, July 29, 2021 (12:58 PM ET): There are hundreds (if not thousands) of dating apps on the Google Play Store. You probably already know the heavy hitters, such as Tinder, Bumble, and OkCupid. You might not know about some other apps, though, such as  Seeking Arrangement,  Elite, or  Spoil.\n That’s because those last three apps are so-called sugar daddy apps. A “sugar” relationship is defined as incentivized companionship. A common example is a young woman dating an older, wealthy man, with the man gifting expensive items or even cash to the woman. In that situation, the man would be called a sugar daddy. However, sugar mommies exist as well, and people who don’t want to throw genders onto everything just use the term “sugar.”\n  Google, however, doesn’t seem to approve of people procuring these arrangements through the Play Store. In  a new policy change first spotted by   Android Police, Google puts the hammer down on sugar daddy apps. The terminology change includes the removal of “compensated sexual relationships (i.e., sugar dating).” Google says this app category now falls under its Inappropriate Content policy.\n As such, unless Google changes its mind, all sugar dating apps will go missing from the Play Store on September 1, 2021.\n  The problem with Google’s policy change here is that it appears to be overly selective. Yes, the Seeking Arrangement app, for example, lays out that it is a way to find “mutually beneficial relationships.” But that doesn’t mean you couldn’t also find those relationships on other apps, such as Tinder.\n Chances are good that nearly every attractive woman on Tinder has been offered a sugar daddy arrangement through that app. Sure, maybe only a few actually follow through, but it certainly happens. But Google isn’t about to ban Tinder —  we’re certain of that.\n Ultimately, this policy change might just be a way for Google to crack down on apps that explicitly promote themselves as sugar daddy apps. The Seeking Arrangement app does not use the term “sugar” anywhere in its description, so it’s possible it won’t see a ban on September 1. Still, if you are looking for a mutually beneficial relationship, you might need to learn  how to sideload Android apps come September.", "posttime": "2021-07-31 07:40:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,google,禁止,apps,应用程序", "title": "Google Play 商店禁止“糖爸爸/妈妈/宝贝”约会应用程序，但不禁止 Tinder", "title_en": "Google Play Store bans “sugar dad/mom/baby” dating apps, but not Tinder", "transed": 1, "url": "https://www.androidauthority.com/sugar-daddy-apps-2020846", "via": "", "real_tags": ["程序", "google", "禁止", "apps", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "b2399cb83c75f9b32b6f6ebd78af4e84.jpg", "infoid": 1070756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "后端工程节目的这一集是由我在 RedisLabs 的朋友赞助的。我将把这个视频分成三个部分，我们将首先定义...", "note_en": "This episode of the backend engineering show is sponsored by my friends at RedisLabs.  I’m going to break this video into three sections, we will first defin...", "posttime": "2021-07-31 06:51:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,redis,primary,工程", "title": "Redis 可以用作主数据库吗？ [视频]", "title_en": "Can Redis be used as a primary database? [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=VLTPqImLapM", "via": "", "real_tags": ["数据库", "database", "redis", "primary", "工程"]}, {"category": "", "categoryclass": "", "imagename": "f4487f0a3a04a91eba7a0115fe567722.png", "infoid": 1070755, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lunatic 是一个单一的可执行文件，可在 Windows、macOS 和 Linux 上运行。它从拥有自己的堆/堆栈的 WebAssembly 模块生成轻量级进程。这些进程被预先安排在多线程执行器上。 Lunatic 的设计完全是关于超轻量级工艺。进程创建速度快，内存占用小，调度开销低。它们专为大规模并发而设计。 Lunatic 位于您的操作系统和正在运行的进程之间。这允许它在每个进程的基础上决定将哪些系统调用转发到操作系统。如果你想运行一些不受信任的代码，你可以。只需在没有任何权限的进程中生成它。 Lunatic 是一个在 MIT/Apache 许可下许可的开源项目。你可以在 Github 上查看代码。 Lunatic 建立在 WebAssembly 的安全性之上。我们都使用与我们的代码一起部署的未经审计的第三方库，Lunatic 可以使用基于功能的安全性来限制它们。 Lunatic 支持 Wasmer 或 Wasmtime 将您的 Wasm 及时编译为机器代码。支持 LLVM 和 Cranelift 作为代码生成器。使用 LLVM 时，运行时性能与本机代码大致相当。我们希望支持所有编译为 Wasm 的语言。有些更适合 Lunatic 的用例。目前，我们专注于 Rust 和 AssemblyScript。\n您可以自由地以任何您想要的方式构建您的应用程序。理想情况下，您应该能够将现有应用程序编译为 Wasm 并享受 Lunatic 的一些好处。疯狂的进程是完全隔离的，每个进程都有一个堆栈和堆。如果一个进程崩溃，它不会影响运行时中的其他进程。", "note_en": "Lunatic is a  single executable and runs on Windows, macOS and Linux. It spawns lightweight processes from WebAssembly modules that have their own heap/stack. These processes are preemptively scheduled on a multi-threaded executor.\n  Lunatic&#39;s design is all about super  lightweight processes. Processes are fast to create, have a small memory footprint and a low scheduling overhead. They are designed for massive concurrency.\n  Lunatic sits between your operating system and the running processes. This allows it to decide on a per process basis what  syscalls are going to be forwarded to the operating systems.  If you would like to run some untrusted code, you can. Just spawn it inside of a process without any privileges.\n  Lunatic is an open source project licensed under the MIT/Apache license. You can check out the code on  Github.\n Lunatic builds on WebAssembly&#39;s security. We all use unaudited third-party libs that get deployed with our code, Lunatic can use capability based security to limit them.\n Lunatic supports  Wasmer or  Wasmtime to just-in-time compile your Wasm to machine code. LLVM and Cranelift are supported as code generators. When LLVM is used, runtime performance is roughly equal to native code.\n We want to support all languages that compile to Wasm. Some are better suited for Lunatic&#39;s use-cases. Currently, we are focused on Rust and AssemblyScript.\n You have the freedom to architecture your app in any way you want. Ideally you should be able to compile your existing app to Wasm and enjoy some benefits of Lunatic.\n Lunatic processes are completely isolated, with a per-process stack and heap. If a process crashes, it won&#39;t affect others in the runtime.", "posttime": "2021-07-31 06:51:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webassembly,erlang,lunatic", "title": "Lunatic 是一个受 Erlang 启发的 WebAssembly 运行时", "title_en": "Lunatic is an Erlang-inspired runtime for WebAssembly", "transed": 1, "url": "https://lunatic.solutions/", "via": "", "real_tags": ["erlang", "lunatic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070754, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是时候为我的（纸质）密码学图书馆找一个新家了。它大约有 150 英尺长的书籍、会议记录、期刊和专着——大部分来自 1980 年代、1990 年代和 2000 年代。我的偏好是去教育机构，但如果这是唯一可用的选择，我会考虑公司或个人住宅。如果你认为你可以把它拆散卖掉，我会认为这是最后的手段。新所有者支付所有包装和运输费用，可能还包括购买价格，具体取决于您是谁以及您想对图书馆做什么。", "note_en": "The time has come for me to find a new home for my (paper) cryptography library. It’s about 150 linear feet of books, conference proceedings, journals, and monographs — mostly from the 1980s, 1990s, and 2000s.\n My preference is that it goes to an educational institution, but will consider a corporate or personal home if that’s the only option available. If you think you can break it up and sell it, I’ll consider that as a last resort. New owner pays all packaging and shipping costs, and possibly a purchase price depending on who you are and what you want to do with the library.", "posttime": "2021-07-31 06:51:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加密,crypto,图书馆", "title": "我要和我的加密库分手", "title_en": "I Am Parting with My Crypto Library", "transed": 1, "url": "https://www.schneier.com/blog/archives/2021/07/i-am-parting-with-my-crypto-library.html", "via": "", "real_tags": ["加密", "crypto", "图书馆"]}]