[{"category": "", "categoryclass": "", "imagename": "133edb7f8600ac075f9cd1a26e9b6fba.jpg", "infoid": 1000958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项通过移动网络和安卓应用程序提供的服务，允许用户访问任何文本格式的网站(没有视频、图像、音频和其他消耗大量数据的元素)，并消耗几兆字节的互联网数据。\n对于Discover，这是该公司免费基础服务计划的一部分，Facebook正在与Bitel、Claro、Entel和Movistar的移动运营商合作。Discovery目前在秘鲁上市，目前正处于初始测试阶段。\n在秘鲁，Discover每天向用户提供10MB的免费数据。Facebook的一位发言人告诉TechCrunch，合作的移动运营商决定了每天的数据限额，并预计Discovery将接受测试的其他国家的运营商每天提供高达20MB的数据。\n但一切都不是一成不变的。这位发言人表示：“我们将在试验期间评估人们如何使用Discover，以及每天更多的数据量，并可能与我们的运营商合作伙伴在未来进行调整。”他补充说，移动运营商还将决定是否可以在Discover中增加对照片的支持。\n取消对视频和图像的支持意味着Discover用户将能够在一天内加载数十个网站，而不会耗尽他们的数据容限。\nDiscovery是Facebook近年来推出的几项互联网连接努力中的最新一项。该公司在印度维护Internet.org和Express WiFi，前者提供对数十个市场的数十个网站的不受限制的访问；后者允许社区商店向用户出售小包互联网套餐。Facebook已经与该国1万多家商家和商店合作销售这些数据计划。\n在Internet.org网站上，该公司还列出了连接实验室(Connectivity Lab)，这是免费基础计划(Free Basics Initiative)的另一项努力，通过该计划，该公司正在“探索各种技术，包括高空长航时飞机、卫星和激光”，以让更多的人上网。这些测试中至少有一项已经停止。\n“在冠状病毒公共卫生危机期间，我们认为特别重要的是探索如何帮助人们保持联系，并增加人们在互联网上获得健康信息和其他资源的机会。作为我们正在进行的将人们与准确的健康信息联系起来的工作的一部分，冠状病毒健康资源将在Discover主页上突出显示，“Facebook的产品经理Yoav Zeevi说。\nFacebook的免费基础计划，帮助数千万人访问互联网，也因其方法和一些意想不到的后果而受到审查。在世界第二大互联网市场的地方当局发现Internet.org违反了网络中立原则后，Internet.org在印度被禁止。\nZeevi说，公司已经听到了反馈，并做出了回应，允许人们浏览所有网站。他说：“我们在发现号上的工作受到了我们更广泛的努力的启发，包括我们参与了网络合同，在继续保护隐私的同时，扩大了对开放网络的连接和访问。”蒂姆·伯纳斯-李(Tim Berners-Lee)的网络合同欢迎“探索”(Discover)的推出。\n批评人士认为，Internet.org等节目也助长了现实生活中的暴力行为。Internet.org在一些额外的市场已经停产。\n随着Facebook扩大其连接努力，其他一些公司已经缩减了他们的倡议。今年早些时候，谷歌停止了其名为Station的免费Wi-Fi计划，该计划在印度400多个火车站提供互联网接入，并在其他几个市场的公共场所提供。\n2018年，维基百科关闭了维基百科Zero，这是一个允许72个国家超过8亿人免费访问在线百科全书的项目。", "note_en": "The service, available through mobile web and  Android   app, allows users to visit any website in text format (no video, images, audio and other elements that eat up large amounts of data) and consume a few megabytes of internet data.\n For Discover, which is part of the company’s Free Basics initiative, Facebook is working with mobile operators in Bitel, Claro, Entel, and Movistar. Discover is currently available in Peru, where it is in the initial testing phase.\n  In Peru, Discover is offering 10MB of free data to users each day. A Facebook spokesperson told TechCrunch that the partner mobile operator determines the daily data allowance, and it anticipates operators in other countries where Discover would be tested to offer up to 20MB each day.\n But nothing is set in stone. “We’ll be assessing how people are using Discover and the amount of daily data more during the trials and may work with our operator partners on adjustments going forward,” the spokesperson said, adding that mobile operators will also determine whether support for photos could be added to Discover.\n Eliminating support for videos and images means that Discover users would be able to load dozens of websites in a day without running out of their data allowance.\n Discover is the latest of a handful of internet connectivity efforts that Facebook has rolled out in recent years. The company maintains  Internet.org,   which offers unfettered access to dozens of websites in dozens of markets; and Express WiFi, which allows neighbourhood stores to sell small sachet of internet plans to users, in India. Facebook has partnered with more than 10,000 merchants and stores in the country to sell these data plans.\n On the  Internet  .org website, the company also  lists Connectivity Lab, another effort that is part of Free Basics initiative through which it is “exploring a variety of technologies, including high-altitude long-endurance planes, satellites and lasers” to bring more people online. At least one of those tests has been  discontinued.\n “During the coronavirus public health crisis, we believe it is particularly important to explore ways to help people stay connected and to increase access to health information and other resources on the internet. As part of our ongoing work to connect people to accurate health information, coronavirus health resources will be highlighted on the Discover homepage,” said Yoav Zeevi, a product manager at Facebook.\n Facebook’s Free Basics initiative, which has helped tens of millions of people access internet, has also received scrutiny for its approach and some unintended consequences. Internet.org was  banned in India after the local authority in the world’s second largest internet market found that the program violated net neutrality principles.\n Zeevi said the company has heard the feedback and responded by allowing people to browse all websites. “Our work on Discover has been informed by our broader efforts — including our participation in the  Contract for the Web — to expand connectivity and access to the open web while continuing to protect privacy,” he said. Tim Berners-Lee’s Contract for the Web has  welcomed the launch of Discover.\n Critics have argued that programs such as Internet.org, which has been  discontinued in some additional markets, have also  fuelled violence in real life.\n As Facebook expands its connectivity efforts, some other companies have scaled down their initiatives. Earlier this year,  Google    discontinued its free Wi-Fi program called Station that offered internet access in more than 400 railway stations in India, and was available at public places in handful of other markets.\n In 2018, Wikimedia  shut down Wikipedia Zero, a program that allowed more than 800 million people to access the online encyclopaedia in 72 countries for free.", "posttime": "2020-05-06 23:38:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,免费,discover", "title": "探索是Facebook帮助人们免费访问网站的新努力--但有限制", "title_en": "Discover is Facebook's New Effort To Help People Access Websites for Free -- But With Limits", "transed": 1, "url": "https://techcrunch.com/2020/05/06/facebook-discover-connectivity-free-basics-initiative/", "via": "", "real_tags": ["facebook", "免费", "discover"]}, {"category": "", "categoryclass": "", "imagename": "3852cb45ad1dfc502619e329d4b17d64.jpg", "infoid": 1000957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大气水汽在天气中所起的作用是复杂的，目前还不清楚。然而，亚利桑那大学的研究人员在“地球物理研究快报”杂志上发表的一项新研究中开始梳理出不同大气条件下上午土壤水分和下午降雨量之间的关系。亚利桑那州水文和大气科学系的主要作者乔希·韦尔蒂(Josh Welty)说，关于和之间的关系，普遍的看法是，如果早上更潮湿，下午的降雨量就会更大，但情况要比这复杂得多，他是亚利桑那州水文和大气科学系的博士生，主要作者乔希·韦尔蒂(Josh Welty)说，这两者之间的关系是，如果早上更潮湿，下午的降雨量就会更大，但情况要比这复杂得多。在全球范围内，我们看到的证据表明，在潮湿和干燥的土壤条件下，下午降雨的可能性都更大，这取决于大气湿度。\n该研究小组还包括来自内华达州沙漠研究所和美国国家航空航天局戈达德太空飞行中心的研究人员，他们使用了过去五年来对北半球土壤水分和下午降雨量的卫星观测。这项工作得到了美国国家航空航天局的支持，并基于美国国家航空航天局的全球降水测量任务和土壤湿度主动被动卫星，以及纳入卫星观测的现代研究和应用回顾性分析第2版(MERRA-2)模型中的大气湿度和运动数据。\n研究人员发现，在大气湿度很小的日子里，下午的降雨更有可能发生在土壤更潮湿或相对湿度更高的地方。在风带来大量大气水分的日子里，更干燥的土壤或更低的相对湿度更有可能出现下午的降雨。研究小组还发现，在这两种情况下，早上土壤或气温较高的情况下，下午更有可能出现降雨。\n研究人员将重点放在下午降雨的天数上，并注意到在湿润程度高于平均水平的土壤上出现的降雨天数与在干燥程度高于平均水平的土壤上出现的降雨天数之间的差异。然后，他们将他们的结果分成三类：高、中和低大气水分通过风的输送。\n这项研究建立在2018年的一项研究基础上，该研究确定了土壤水分在俄克拉荷马州南部大平原下午降雨量中的作用。新的发现表明，俄克拉荷马州土壤湿度、下午降雨量和大气湿度之间的关系并不适用于整个北半球。\n在大平原南部，我们发现，当风带来的水分较少时，干燥的土壤与降雨量的增加有关；当风带来较大的水分时，湿润的土壤与降雨量的增加有关。在目前的研究中，我们发现，实际上，在许多地区，下午降雨的可能性正好相反，韦尔蒂说。\n据韦尔蒂的论文顾问、论文合著者曾旭斌、Agnese N.Haury环境捐赠主席、气候动力学和水文气象中心以及陆地-大气-海洋相互作用小组主任表示，了解水蒸气在天气中的作用非常重要，因为它的影响无处不在。\n例如，在大平原南部，有许多龙卷风活动，因为有水蒸气从墨西哥湾进入。此外，在加州海岸，你会谈论来自大气河流的严重洪水，这些河流是集中的水蒸气的走廊，一旦到达山脉，就会迅速沉淀，导致大规模洪水，曾说。\n风带来的水蒸气是我们了解的重要来源。过去，人们在研究土地条件对降雨量的影响时没有给予足够的重视，这可能会使他们的结果具有误导性。曾鸣说，一旦我们考虑到风对水蒸气的移动，结果就会变得更加稳健。\n随着全球变暖改变了大气湿度、土壤等的模式，理解这种关系变得更加重要。曾说，这些变化不仅会对天气和自然灾害产生影响，还会对农业产生影响。\n来自NASA戈达德太空飞行中心的物理学家、论文合著者乔·桑塔内洛(Joe Santanello)说，这些结果确实显示了陆地对天气和气候影响的复杂性。他是NASA支持的改善天气和气候模型的当地陆地-大气耦合工作组的主席。当你加入灌溉或土地利用的人为因素来改变土壤的干燥或潮湿时，我们目前在模型中没有很好地表现出来，我们可能会对天气和气候产生额外的下游影响，这是我们没有预见到的。\n下一步是评估这些关系如何在全球气候和天气预测模型中发挥作用。\n我们的发现是观察性的，但现在，我们想用计算机建模来帮助我们理解为什么更干燥或更潮湿的土壤会增加降雨的可能性，曾说。我们知道这是真的，但我们不知道为什么。更多信息：J·韦尔蒂等人，“地球物理研究快报”(2020)，在更潮湿或更干燥的土壤上增加了可察觉的下午降雨的可能性，这取决于大气动力学的影响。DOI：10.1029/2020GL087779", "note_en": "The role that atmospheric water vapor plays in weather is complex and not clearly understood. However, University of Arizona researchers have started to tease out the relationship between morning soil moisture and afternoon rainfall under different atmospheric conditions in a new study in the journal  Geophysical Research Letters.    &#34;The prevailing wisdom on the relationship between   and   is that if you have wetter   in the morning, you&#39;ll have a greater occurrence of rainfall in afternoon, but it&#39;s more complicated than that,&#34; said lead author Josh Welty, a UArizona doctoral student in the Department of Hydrology and Atmospheric Sciences. &#34;On a global scale, we see evidence that you can have greater chances of afternoon rainfall over both wet and dry soil conditions, depending on atmospheric moisture.&#34;\n  The team, which also included researchers from the Desert Research Institute in Nevada and NASA&#39;s Goddard Space Flight Center, used satellite-based observations of soil moisture and afternoon rainfall in the northern hemisphere from the last five years. The work was supported by NASA and is based on NASA   from the Global Precipitation Measurement mission and the Soil Moisture Active Passive satellite, as well as atmospheric moisture and movement data from the Modern-Era Retrospective analysis for Research and Applications Version 2, or MERRA-2, model, which incorporates satellite observations.\n  The researchers found that on days when   in little atmospheric moisture, afternoon rainfall is more likely to occur over wetter soils or higher relative humidity. On days when wind introduces lots of atmospheric moisture, afternoon rainfall is more likely over drier soils or lower relative humidity. The team also found that for both conditions, afternoon rainfall occurrence is more likely with warmer morning soil or air temperature.\n  The researchers focused on days in which afternoon rainfall occurred and noted the difference between the number of rainfall days that occurred over wetter-than-average soil and the number of rainfall days that occurred over drier-than-average soil. They then grouped their results into three categories: high, mid and low atmospheric moisture transport by wind.\n    This research builds on a  2018 study that identified soil moisture&#39;s role in afternoon rainfall amount in the Southern Great Plains of Oklahoma. The new findings show that the relationship between soil moisture, afternoon rainfall and atmospheric moisture in Oklahoma doesn&#39;t apply across the entire northern hemisphere.\n  &#34;Over the Southern Great Plains, we found that when the wind brings less moisture, dry soils are associated with increases in rainfall amount; and when the wind brings greater moisture, wet soils are associated with increases in rainfall amount. In the current study, we find that, actually, in many regions, the opposite is true for the likelihood of afternoon rainfall,&#34; Welty said.\n  Understanding the role of water vapor in weather is important because its effects are felt everywhere, according to Welty&#39;s thesis adviser and paper co-author Xubin Zeng, Agnese N. Haury Endowed Chair in Environment and director of the Climate Dynamics and Hydrometeorology Center and Land-Atmosphere-Ocean Interaction Group.\n  &#34;For example, for the Southern Great Plains there are many tornado activities because there is water vapor moving in from the Gulf of Mexico. Also, on the California coast you talk about severe flooding from atmospheric rivers,&#34; which are corridors of concentrated water vapor that can quickly precipitate once hitting a mountain range, causing mass flooding,&#34; Zeng said.\n  &#34;Water vapor brought in by the winds is an important source to understand. In the past, people didn&#39;t pay enough attention to it in studying how land conditions affect rainfall, potentially making their results misleading. Once we consider the wind&#39;s movement of water vapor, the results become more robust,&#34; Zeng said.\n  Understanding this relationship is even more important as global warming changes patterns of atmospheric moisture, soil   and more. Such changes will not only have effects on weather and natural disasters, but also on agriculture, Zeng said.\n  &#34;The results really show the complexity of the land&#39;s influence on weather and climate,&#34; said physical scientist and paper co-author Joe Santanello from NASA&#39;s Goddard Space Flight Center, who chairs the NASA-supported Local Land-Atmosphere Coupling working group to improve weather and climate models. &#34;When you add in the human factor of irrigation or land use that changes the dryness or wetness of the soils, which we currently don&#39;t represent well in the models, we potentially have additional downstream effects on weather and climate that we haven&#39;t foreseen.&#34;\n  The next step is to assess how these relationships play out in global climate and weather forecasting models.\n  &#34;Our findings are observational, but now, we want to use computer modeling to help us understand why drier or wetter soil could enhance rainfall likelihood,&#34; Zeng said. &#34;We know it&#39;s true, but we don&#39;t quantitatively know why.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tJ. Welty et al, Increased likelihood of appreciable afternoon rainfall over wetter or drier soils dependent upon atmospheric dynamic influence,  Geophysical Research Letters (2020).  DOI: 10.1029/2020GL087779", "posttime": "2020-05-06 23:23:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "下午,water,大气", "title": "水汽对下午降水的影响", "title_en": "The impact of water vapor on afternoon rainfall", "transed": 1, "url": "https://phys.org/news/2020-05-decoding-impact-vapor-afternoon-rainfall.html", "via": "", "real_tags": ["下午", "water", "大气"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000956, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-05-06 23:23:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞机,plane,创建", "title": "高速公路上的电动车能模仿飞机对飞机加油吗？", "title_en": "Can Electric Cars on the Highway Emulate Plane-to-Plane Refueling?", "transed": 1, "url": "https://spectrum.ieee.org/cars-that-think/energy/batteries-storage/will-electric-cars-on-the-highway-emulate-airtoair-refueling", "via": "", "real_tags": ["飞机", "plane", "创建"]}, {"category": "", "categoryclass": "", "imagename": "bb1f52a413af310bbcadfd95fe2b9d7d.jpg", "infoid": 1000955, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX最新的星际飞船原型首次启动引擎，可能为不久的将来进行试飞铺平道路。\nSN4是SpaceX的火星殖民飞船的最新测试版，周二晚间(5月5日)，SN4在静态火力方面取得了A级成绩，它的单个猛禽发动机短暂点亮，同时仍留在该公司位于德克萨斯州南部的设施中。\n周二晚些时候，SpaceX创始人兼首席执行官埃隆·马斯克在推特上表示，星际飞船SN4通过了静态火灾。你可以在这里看到静态火灾的视频，这是由SPadre.com提供的，也可以从NASASpaceflight.com和LapPadre这里看到。\n这次成功的测试是这位亿万富翁企业家连续第二个重要的里程碑：他的女朋友，歌手格里姆斯在周一(5月4日)生下了这对夫妇的儿子。\n有了后视镜中的静态火焰，SpaceX可以开始为SN4的下一个重要时刻做准备：无人驾驶试飞，马斯克曾表示，这将把飞行器带到约500英尺(150米)的目标高度。\n到目前为止，只有一个星际飞船原型升空-一种名为StarHopper的粗壮飞船，它去年在退役前进行了几次短暂的短途旅行。\nSN4的飞行天数无疑也会很短。SpaceX已经在建造SN5，如果一切按计划进行，SN5将有三架猛禽，在测试任务期间将飙升至约12英里(20公里)的目标高度。\n最终投入使用的星际飞船将配备六个猛禽发动机，并足够强大，可以从月球和火星上发射自己。但这艘可搭载100名乘客的宇宙飞船需要帮助才能离开地球；它将从地球表面发射，搭载一枚名为“超级重型”的巨型火箭，该火箭将由31架猛禽提供动力。\n马斯克说，星际飞船和超重型都将完全和快速地重复使用。每一枚超级重型火箭在升空后不久都会垂直降落在地球上，就像SpaceX猎鹰9号和猎鹰重型火箭的第一级已经做的那样。每艘星际飞船将能够执行许多任务，无论是前往月球、火星还是其他深空目的地。\n美国国家航空航天局(NASA)最近向SpaceX提供了资金，用于开发“星际飞船”作为潜在的人类登月系统，用于该机构的阿特弥斯(Artemis)月球探测计划，该飞行器也有资格将NASA的机器人有效载荷运送到月球表面。但这颗红色星球是马斯克这艘165英尺高(50米)宇宙飞船的主要目标。\n这位亿万富翁企业家设想每隔26个月就会有庞大的星际舰队出发前往火星，届时地球和太阳的第四块岩石将适当排列，以执行星际任务。马斯克希望这样的飞行能够帮助在这颗红色星球上建立一个拥有100万人口的城市，并相对较快地做到这一点-理想情况下，是在未来50到100年内。\n迈克·沃尔是“外面的世界”(Grand Central Publishing，2018；Karl Tate绘图)的作者，这是一本关于寻找外星生命的书。在Twitter@michaeldwall上关注他。在Twitter@Spacedotcom或Facebook上关注我们。\n在有限的时间内，您可以订阅我们任何畅销的科学杂志，每月只需2.38美元，即前三个月的标准价格有45%的折扣。视图交易。\n加入我们的空间论坛，继续谈论空间的最新任务，夜空和更多！如果您有任何新闻提示、更正或评论，请发送电子邮件至：Community@space.com。", "note_en": "SpaceX&#39;s newest   Starship prototype has fired its engine for the first time, potentially paving the way for a test flight in the very near future.\n The SN4, the latest test version of SpaceX&#39;s Mars-colonizing Starship vehicle, aced a &#34;static fire&#34; Tuesday night (May 5), lighting up its single   Raptor engine briefly while remaining on the ground at the company&#39;s South Texas facilities.\n  &#34;Starship SN4 passed static fire,&#34; SpaceX founder and CEO Elon Musk   said via Twitter late on Tuesday.    You can see video of the static fire here, courtesy of  SPadre.com, as well as  from NASASpaceflight.com here and from  LapPadre here.\n    The successful test was the second big milestone for the billionaire entrepreneur in quick succession: His girlfriend, the singer Grimes, gave birth to the couple&#39;s son on Monday (May 4).\n With the static fire in the rearview mirror,   SpaceX can begin prepping the SN4 for its next big moment: an uncrewed test flight, which Musk has said will take the vehicle to a target altitude of about 500 feet (150 meters).\n   Just one Starship prototype has gotten off the ground to date — a stubby craft called   Starhopper, which made a few brief jaunts last year before being retired.\n The SN4&#39;s flying days will doubtless be short as well. SpaceX is already building the SN5, which will have three Raptors and will soar to a target altitude of about 12 miles (20 kilometers) during its test missions, if all goes according to plan.\n  The final, operational Starship will sport six Raptor engines and be powerful enough to launch itself off the moon and Mars. But the 100-passenger spaceship will need help getting off Earth; it will launch from our planet&#39;s surface atop a giant rocket called Super Heavy, which will be powered by 31 Raptors.\n  Both Starship and Super Heavy will be fully and rapidly reusable, Musk has said. Each Super Heavy will come down for vertical landings here on Earth shortly after liftoff, as the first stages of SpaceX Falcon 9 and Falcon Heavy rockets already do. And each Starship will be capable of flying many missions, be they to the moon, Mars or other deep-space destinations.\n NASA recently awarded funding to SpaceX to develop Starship as a   potential human landing system for the agency&#39;s Artemis program of lunar exploration, and the vehicle is eligible to carry robotic NASA payloads to the moon&#39;s surface as well. But the Red Planet is Musk&#39;s main target for the 165-foot-tall (50 m) spaceship.\n The billionaire entrepreneur envisions huge fleets of Starships departing for Mars every 26 months, when Earth and the fourth rock from the sun are properly aligned for interplanetary missions. Musk wants such flights to help establish a million-person city on the Red Planet, and to do it relatively soon — ideally, within the next 50 to 100 years.\n   Mike Wall is the author of &#34;   Out There &#34; (Grand Central Publishing, 2018; illustrated by    Karl Tate ), a book about the search for alien life. Follow him on Twitter    @michaeldwall . Follow us on Twitter    @Spacedotcom  or    Facebook .\n For a limited time, you can take out a digital subscription to any of  our best-selling science magazines for just $2.38 per month, or 45% off the standard price for the first three months. View Deal\n Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:  community@space.com.", "posttime": "2020-05-06 23:09:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,starship,星际", "title": "SpaceX的星际飞船SN4原型首次发射火箭发动机", "title_en": "SpaceX's Starship SN4 prototype fires rocket engine for first time", "transed": 1, "url": "https://www.space.com/spacex-starship-sn4-engine-static-fire-test.html", "via": "", "real_tags": ["火箭", "starship", "星际"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000954, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HashMap是Java中最常用的集合类型之一，它存储键-值对。理想情况下，它期望使用哈希表，期望数据访问时间复杂度为O(1)，然而，由于哈希冲突，现实中使用链表或红黑树来存储数据，这使得最坏情况下的时间复杂度为O(Logn)。\n虽然集合使用像数组和链表这样的数据结构，但与数组不同的是，当没有足够的空间存储数据时，它们将动态调整大小，因为这涉及将数据从旧数组复制到新数组，这被认为是一项繁重的操作，因此通常可以指定初始容量，以避免在已经估计条目数量的情况下不必要的大小调整。\n在决定正确的初始容量之前，需要回答的一个重要问题是何时在HashMap中触发调整大小？\nHashMap提供了一个可以接受初始容量值的构造函数方法，最终该构造函数方法将调用另一个默认负载因子值为0.75的构造函数方法。\npublic HashMap(int initialCapacity，Float loadFactor){if(initialCapacity&lt；0)抛出新的IllegalArgumentException(&#34；非法初始容量：&#34；+initialCapacity)；if(initialCapacity&&gt;；Maximum_Capacity)initialCapacity=Maximum_Capacity；IF(loadFactor&lt；=0||Float.isNaN(Loadfactor))抛出新的IllegalArgumentException(&#。\n这里的阈值是用于确定何时应该触发大小调整的阈值。从赋值中，它不直接获取初始容量值，而是调用另一个方法tableSizeFor()来计算阈值。\n静态最终int tableSizeFor(Int Cap){int n=cap-1；n|=n&gt；&gt；&gt；1；n|=n&gt；&gt；&gt；2；n|=n&gt；&gt；&gt；4；n|=n&gt；&gt；&gt；8；n|=n&gt；&gt；&gt；16；return(n&lt；0。最大容量：N+1；}。\n计算值将类似于2^N，它允许查找旧数据在新表中的位置。\n当10000是初始容量时，我们可能认为它会在添加10000*0.75=7500个条目后触发大小调整。事实是，在运行tableSizeFor()之后，它调整大小的阈值变为2^14=16384。这是否意味着即使在Hashmap中添加了10000个条目，它也不会触发调整大小？\n如果1000是初始容量怎么办？计算后的阈值将是2^10=1024，因此在添加1000个条目后也不会触发调整大小？\n要理解这一点，还有另一个问题需要回答，表何时初始化？resize()的目的是在达到阈值时调整表的大小，但它还有另一个用途，resize()还负责表的初始化。\n当使用构造函数方法创建HashMap对象时，它只会在将第一个值放入映射时初始化表。\nFinal V putVal(int hash，K key，Vvalue，Boolean Only IfAbsend，Boolean Eevict){Node&lt；K，V&gt；[]tab；Node&lt；K，V&gt；p；int n，i；if((tab=table)==null||(n=tab.length)=0)n=(tab=resize()).length；//调用resize()//.}。\n最终节点&lt；K，V&&gt;；[]Resize(){Node&lt；K，V&&gt;；[]oldTab=table；int oldCap=(oldTab==null)？0：oldTab.length；int oldThr=Threshold；int NewCap，newThr=0；IF(oldCap&&gt;0){if(oldCap&&gt;t；=Maximum_Capacity){Threshold=Integer.MAX。Maximum_Capacity&amp；&amp；oldCap&&gt;；=Default_Initial_Capacity)newThr=oldThr；&lt；1；}Else If(oldThr&gt；0)NewCap=oldThr；//1 Else{NewCap=Default_Initial_Capacity；newThr=(Int)(Default_Load_factor*Default_Initial_Capacity)；}If(newThr=0){//2 Float ft=(Float)NewCap。FT&lt；(Float)Maximum_Capacity？(Int)ft：Integer.MAX_VALUE)；}Threshold=newThr；//3 Node&lt；K，V&gt；[]newTab=(Node&lt；K，V&gt；[])new Node[NewCap]；table=newTab；//4//.}。\n当指定了初始容量但表尚未初始化时，它会将oldThr分配给NewCap，因此创建的新表将具有初始阈值的大小。那么门槛将调整为NewCap*0.75.。在此之后，将创建并初始化表。\n因此，如果初始容量为1000，则触发调整大小的实际阈值将为1024*0.75=768，这意味着将在添加1000个条目之前触发调整大小。如果初始大小为10000，则触发调整大小的实际阈值为16384*0.75=12288。\n因此，在创建HashMap对象时指定初始容量值时，要指定的实际值应该计算为预期的初始容量/负载因子，以避免意外的大小调整。", "note_en": "HashMap is one of the most frequently used collection types in Java, it stores key-value pairs. Ideally it expects to use hash table which expects the data access time complexity to be O(1), however, due to hash conflicts, in reality, it uses linked list or red-black tree to store data which makes the worst case time complexity to be O(logn).\n  Although collections are using data structures like arrays and linked lists, unlike arrays, they will dynamically resize when there is not enough space to store data  It involves copying data from old array to the new array which is considered as a heavy operation, so normally an initial capacity can be specified to avoid unnecessary resizing if there is already an estimation of the number of entries would be.\n  Before deciding the correct initial capacity, one important question to be answered is when resizing will be triggered in HashMap?\n  HashMap provides a constructor method which can take an initial capacity value and eventually this constructor method will call another constructor method with default load factor value of 0.75.\n  public HashMap(int initialCapacity, float loadFactor) {\r if (initialCapacity &lt; 0)\r throw new IllegalArgumentException(&#34;Illegal initial capacity: &#34; + initialCapacity);\r if (initialCapacity &gt; MAXIMUM_CAPACITY)\r initialCapacity = MAXIMUM_CAPACITY;\r if (loadFactor &lt;= 0 || Float.isNaN(loadFactor))\r throw new IllegalArgumentException(&#34;Illegal load factor: &#34; + loadFactor);\r this.loadFactor = loadFactor;\r this.threshold = tableSizeFor(initialCapacity);\r}\n  Here  threshold is the one being used to determine when the resizing should be triggered. From the value assignment, it&#39;s not directly taking the initial capacity value, instead it calls another method  tableSizeFor() to calculate the threshold.\n  static final int tableSizeFor(int cap) {\r int n = cap - 1;\r n |= n &gt;&gt;&gt; 1;\r n |= n &gt;&gt;&gt; 2;\r n |= n &gt;&gt;&gt; 4;\r n |= n &gt;&gt;&gt; 8;\r n |= n &gt;&gt;&gt; 16;\r return (n &lt; 0) ? 1 : (n &gt;= MAXIMUM_CAPACITY) ? MAXIMUM_CAPACITY : n + 1;\r}\n  The calculated value will be like 2^N which allows to find the location of the old data in new table.\n  When 10000 is the initial capacity, we may think that it would trigger resizing after adding 10000*0.75 = 7500 entries. The truth is that after running tableSizeFor(), it&#39;s threshold for resizing becomes 2^14 = 16384. Does this mean it will not trigger resize even if 10000 entries have been added in the HashMap?\n  What if 1000 is the initial capacity? The threshold after calculation would be 2^10 = 1024, hence it will not trigger resizing after adding 1000 entries as well?\n    To understand this, there is another question to be answered, when is the table initialized?  resize() has the purpose of resizing the table when threshold is reached, but it also has another purpose,  resize() also takes care of table initialization.\n  When creating the HashMap object with constructor method, it will only initialize the table when first value is put in the map.\n  final V putVal(int hash, K key, V value, boolean onlyIfAbsent,boolean evict) {\r Node&lt;K,V&gt;[] tab; Node&lt;K,V&gt; p; int n, i;\r if ((tab = table) == null || (n = tab.length) == 0)\r n = (tab = resize()).length; // call resize()\r // ...\r}\n    final Node&lt;K,V&gt;[] resize() {\r Node&lt;K,V&gt;[] oldTab = table;\r int oldCap = (oldTab == null) ? 0 : oldTab.length;\r int oldThr = threshold;\r int newCap, newThr = 0;\r \r if (oldCap &gt; 0) {\r if (oldCap &gt;= MAXIMUM_CAPACITY) {\r threshold = Integer.MAX_VALUE;\r return oldTab;\r }\r else if ((newCap = oldCap &lt;&lt; 1) &lt; MAXIMUM_CAPACITY &amp;&amp; oldCap &gt;= DEFAULT_INITIAL_CAPACITY)\r newThr = oldThr &lt;&lt; 1; \r } else if (oldThr &gt; 0) \r newCap = oldThr; // ①\r else { \r newCap = DEFAULT_INITIAL_CAPACITY;\r newThr = (int)(DEFAULT_LOAD_FACTOR * DEFAULT_INITIAL_CAPACITY);\r }\r \r if (newThr == 0) {\r // ②\r float ft = (float)newCap * loadFactor;\r newThr = (newCap &lt; MAXIMUM_CAPACITY &amp;&amp; ft &lt; (float)MAXIMUM_CAPACITY ?(int)ft : Integer.MAX_VALUE);\r }\r\r threshold = newThr; // ③\r Node&lt;K,V&gt;[] newTab = (Node&lt;K,V&gt;[])new Node[newCap];\r table = newTab; // ④\r // ....\r}\n  When initial capacity is specified but table is not initialized yet, it will assign  oldThr to  newCap, hence the new table created will have the size of the initial threshold. Then the  threshold will be adjusted to newCap*0.75. After this, the table will be created and initialized.\n  So if the initial capacity is 1000, the actual threshold to trigger resize would be  1024*0.75 = 768, this means that resizing will be triggered before 1000 entries are added. If the initial size is 10000, the actual threshold to trigger resize is 16384*0.75 = 12288.\n  Hence when specifying the initial capacity value when creating HashMap object, the actual value to be specified should be calculated as  expected initial capacity/loadFactor to avoid unexpected resizing.", "posttime": "2020-05-06 22:54:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,hashmap,triggered,int", "title": "何时在Java HashMap中触发调整大小？", "title_en": "When will resizing be triggered in Java HashMap?", "transed": 1, "url": "https://www.pixelstech.net/article/1588467060-When-will-resizing-be-triggered-in-Java-HashMap", "via": "", "real_tags": ["java", "hashmap", "triggered", "int"]}, {"category": "", "categoryclass": "", "imagename": "2e91a164dde8370b14a2eafe129bac2d.gif", "infoid": 1000953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全文标题：羟氯喹和阿奇霉素早期治疗冠状病毒患者：法国马赛1061例回顾性分析。\n在法国，羟氯喹(HCQ)和阿奇霉素(AZ)联合用于治疗冠状病毒。\n我们回顾性报告了1061例SARS-CoV-2阳性患者接受HCQ(200 mg，每日3次，共10天)+AZ(第1天500 mg，随后4天每天250 mg)治疗至少3天。结果是死亡，临床恶化(转到ICU，住院10天)和病毒持续脱落(10天)。\n本次分析共纳入1061名患者(46.4%为男性，平均年龄43.6岁-14-95岁)。10d内973例(91.7%)获得良好的临床转归和病毒学治愈。47例(4.4%)患者病毒携带时间延长，且与确诊时病毒载量较高有关(p &lt； .001)，但第10天病毒培养均为阴性。除1例外，其余患者在第15天均被清除。46例患者(4.3%)临床结果不佳，8例死亡(0.75%)(74-95岁)。所有的死亡都是由呼吸衰竭引起的，而不是心脏毒性。5名患者仍在住院(目前治愈的患者占98.7%)。PClinO与高龄(OR 1.11)、入院时严重程度(OR 10.05)和低HCQ血清浓度相关。PClinO与选择性β受体阻滞剂和血管紧张素II受体阻滞剂的使用独立相关(p &lt； .05)。总共有2.3%的患者报告了轻微的不良反应(胃肠道或皮肤症状、头痛、失眠和一过性视力模糊)。\n在冠状病毒并发症发生前给予HCQ+AZ联合用药是安全的，并且与患者的病死率非常低有关。\n视图摘要", "note_en": "Full-length title: Early treatment of COVID-19 patients with hydroxychloroquine and azithromycin: A retrospective analysis of 1061 cases in Marseille, France\n      In France, the combination hydroxychloroquine (HCQ) and azithromycin (AZ) is used in the treatment of COVID-19.\n We retrospectively report on 1061 SARS-CoV-2 positive tested patients treated with HCQ (200 mg three times daily for ten days) + AZ (500 mg on day 1 followed by 250 mg daily for the next four days) for at least three days. Outcomes were death, clinical worsening (transfer to ICU, and &gt;10 day hospitalization) and viral shedding persistence (&gt;10 days).\n A total of 1061 patients were included in this analysis (46.4% male, mean age 43.6 years – range 14–95 years). Good clinical outcome and virological cure were obtained in 973 patients within 10 days (91.7%). Prolonged viral carriage was observed in 47 patients (4.4%) and was associated to a higher viral load at diagnosis (p &lt; .001) but viral culture was negative at day 10. All but one, were PCR-cleared at day 15. A poor clinical outcome (PClinO) was observed for 46 patients (4.3%) and 8 died (0.75%) (74–95 years old). All deaths resulted from respiratory failure and not from cardiac toxicity. Five patients are still hospitalized (98.7% of patients cured so far). PClinO was associated with older age (OR 1.11), severity at admission (OR 10.05) and low HCQ serum concentration. PClinO was independently associated with the use of selective beta-blocking agents and angiotensin II receptor blockers (p &lt; .05). A total of 2.3% of patients reported mild adverse events (gastrointestinal or skin symptoms, headache, insomnia and transient blurred vision).\n Administration of the HCQ+AZ combination before COVID-19 complications occur is safe and associated with very low fatality rate in patients.\n      View Abstract", "posttime": "2020-05-06 22:54:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,回顾性,treatment,患者", "title": "HCQ联合AZ早期治疗冠状病毒1061例回顾性分析", "title_en": "Early treatment of Covid-19 with HCQ and AZ:retrospective analysis of 1061 cases", "transed": 1, "url": "https://www.sciencedirect.com/science/article/pii/S1477893920302179", "via": "", "real_tags": ["病毒", "冠状病毒", "回顾性", "treatment", "患者"]}, {"category": "", "categoryclass": "", "imagename": "f07e036d49bd82f8fb3e4841ef436d6d.jpg", "infoid": 1000952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软今天将推出Surface Book 3，承诺比两年多前的前身性能提高50%。这一次没有大的设计变化，仍然会有两种尺寸的选择：13.5英寸的型号或更大的15英寸版本。看不到任何设计调整是令人失望的，但在引擎盖下有一些重要的改变，应该会改善周围的性能。\nSurface Book 3将搭载英特尔最新的第10代处理器，基础13.5英寸机型的四核酷睿i5起价1，599美元，15英寸机型采用四核i7处理器，起价2，299美元。虽然最基本的13.5英寸机型将包括英特尔的内置Iris Plus显卡，但也可以选择升级到NVIDIA GeForce GTX 1650 Max-Q机型(起价1，999美元)。这款15英寸的机型配备了GTX 1660Ti，企业或企业可以升级到Quadro RTX 3000 GPU，起价3499美元。\n微软负责设备项目管理的公司副总裁罗宾·塞勒在接受The Verge采访时解释说：“对于需要动力的设计师和专业人士，我们将增加NVIDIA Quadro RTX 3000。”它的设计目标是使用3D对象或CAD设计软件等需要Quadro GPU能力来渲染对象的工具的专业人员。“像Solidworks这样的工具，当您渲染它们时，渲染时间减少了大约50%，”Seiler补充道。\n这一次，微软也将Surface Book 3的重点放在了游戏性能上。当我检查Book2时，我发现由于15英寸型号附带的102W充电器的限制，当它插入电源时，它在游戏过程中不能保持充满电。“当你最大限度地耗尽电力时，你不会把它插上电源，也不会充电，”塞勒说。“我们已经对此进行了测试，这是我们这一次想要解决的关键问题之一。”充电器现在已经升级为15英寸型号的127W充电器。\nBook 3没有搭载NVIDIA最新的GeForce RTX移动卡，这意味着没有硬件加速的光线跟踪功能。但GTX 1600Ti应该足以运行最新的Xbox游戏通行证，分辨率为60fps和1080p。微软正在使用Windows10的游戏模式来优化散热和功率，以调整游戏性能，因此希望我们在游戏期间听到更少的粉丝动作。尽管如此，就价格和性能而言，这并不是游戏笔记本电脑的最佳选择，除非你想要独特的可拆卸触摸屏组合，而且还包括手写笔支持。您可以将Razer的新Blade 15配置为RTX 2060和144 Hz显示屏，价格低于Surface Book 3的起步价。\n这种对功能的关注体现在Surface Book 3的其他地方。微软专门针对开发者进行了一些升级。“Surface Book 3的变化是，它现在配备了高达32 GB的RAM，这对于运行虚拟机或Kubernetes之类的东西真的很重要，”塞勒解释说。Surface Book 3还将搭载微软有史以来出货速度最快的固态硬盘：1TB和2TB两种型号的M.2 2280。“这是我们从程序员那里得到的最大要求之一，他们需要它来编译、源代码控制、包管理，”Seiler说。\n不过，SSD、RAM和GPU的性能提升无法与处理器性能提升相匹配。微软在这里仍然使用15W的英特尔处理器(准确地说是酷睿i7-1065G7)，而苹果在其MacBook Pro中使用45W的芯片。\n不幸的是，对性能和能力的关注也没有延伸到微软在Surface Book 3上的端口选择上。目前仍然没有Thunderbolt3的支持，这会让许多希望利用它作为外部驱动器存储甚至连接更强大的GPU的专业人士感到失望。您仍然可以获得两个USB-A端口、一个支持USB Power Delivery 3.0的USB-C端口、一个全尺寸UHS-II SD卡读卡器和一个Surface Connect端口。\n一名微软员工最近透露，出于安全考虑，Surface设备不附带迅雷。关于这一点，我问过塞勒，为什么Surface Book 3仍然没有迅雷支持。\n塞勒说：“我们有一个总体战略，确保我们放入设备中的组件符合我们相信我们的客户将会使用的功能。”因此，在Surface Book 3和我们在新Dock中投入的内容之间，我们相信他们会有他们需要的性能。“。\n微软今天还宣布推出Surface Dock 2，配有快速充电、四个USB-C端口，并支持两个60 Hz的4K显示器，这要归功于更高的DisplayPort比特率。坞站2上的表面连接器电缆长度也有所增加，以便更轻松地将设备放置在坞站旁边。\n不过，Surface Book 3的外部几乎没有什么变化。微软正在增加远距离录音棚麦克风，就像它对Surface Laptop 3所做的那样，该公司正试图让购买Surface设备变得更容易，因为在疫情流行期间，很难进入商店。塞勒说：“任何从商店购买的人都将有60天的退货窗口，免费送货，并可以获得按需和现场培训。”对于那些需要设备，但现在可能不是最好的付费时机的人，我们还将提供所有接入定价，这样他们就可以每月支付较低的费用购买。“。\nSurface Book 3今天开始接受预订，起价为1599美元，5月21日在美国和加拿大发货。它将在“接下来的几周内”推广到其他市场，Surface Dock 2将于5月26日开始发货，售价为259.99美元。", "note_en": "Microsoft is launching its Surface Book 3 today, with a big promise of 50 percent more performance than its predecessor from  more than two years ago. There are no big design changes this time around, and there will still be two size options: a 13.5-inch model or the larger 15-inch version. It’s disappointing to not see any design tweaks, but there are some important changes under the hood that should improve performance all around.\n The Surface Book 3 will ship with Intel’s latest 10th Gen processors, with the base 13.5-inch model starting at $1,599 for a quad-core Core i5, and the 15-inch version using a quad-core Core i7 processor priced starting at $2,299. While the most basic 13.5-inch model will include Intel’s built-in Iris Plus graphics, there will be an option to move up to an Nvidia GeForce GTX 1650 Max-Q model (starting at $1,999). The 15-inch model ships with a GTX 1660Ti or businesses can upgrade to a Quadro RTX 3000 GPU starting at $3,499.\n   “For designers and professionals who need power, we’re adding the Nvidia Quadro RTX 3000,” explains Robin Seiler, corporate vice president of program management for devices at Microsoft, in an interview with  The Verge. This is designed to target professionals working with tools like 3D objects or CAD design software that require the Quadro GPU power to render objects. “Tools like Solidworks, when you render them the render time is reduced by about 50 percent,” adds Seiler.\n Microsoft has also focused the Surface Book 3 on gaming performance this time around. When I  reviewed the Book 2, I found that it wouldn’t stay fully charged during gameplay when it was plugged in, due to the limitations of the 102W charger that shipped with the 15-inch model. “When you max out the power you will not get it plugged in and not charging,” Seiler says. “We’ve tested for it, it was one of the key things we wanted to address this time around.” The charger has now been upgraded to a 127W one on the 15-inch model.\n The Book 3 doesn’t ship with Nvidia’s latest GeForce RTX mobile cards, which means there’s no hardware-accelerated ray tracing. But the GTX 1600Ti should be good enough to run the latest Xbox Game Pass titles at 60fps with 1080p resolution. Microsoft is using Windows 10’s Game Mode to optimize thermals and power to tune for gaming performance, so hopefully we’ll hear less fan action during games. Still, this isn’t the best choice for a gaming laptop in terms of price and performance, unless you want the unique combination of a removable touchscreen that also includes stylus support. You can configure  Razer’s new Blade 15 with an RTX 2060 and 144Hz display for less than the starting price of the Surface Book 3.\n   This focus on power is reflected elsewhere with the Surface Book 3. Microsoft has made some upgrades specifically aimed at developers. “What’s changing with Surface Book 3 is that it now comes with up to 32GB of RAM, which is really important for running virtual machines or things like Kubernetes,” explains Seiler. The Surface Book 3 will also ship with the fastest SSD Microsoft has ever shipped: an M.2 2280 in the 1TB and 2TB models. “This is one of the biggest asks we’ve had from coders, who need it for compiling, source control, package management,” says Seiler.\n The SSD, RAM, and GPU bumps aren’t matched by processor performance bumps, though. Microsoft is still using 15W Intel processors here (the Core i7-1065G7 to be precise), while Apple makes use of 45W chips in its MacBook Pro.\n Unfortunately, the focus on performance and power also doesn’t extend to Microsoft’s port selection on the Surface Book 3. There’s still no Thunderbolt 3 support, which will disappoint a lot of professionals hoping to make use of it for external drive storage or even to hook up a more powerful GPU. You’ll still get two USB-A ports, a single USB-C port with USB Power Delivery 3.0 support, a full-size UHS-II SD card reader, and a Surface Connect port.\n A Microsoft employee recently revealed that  Surface devices don’t ship with Thunderbolt due to security concerns. I asked Seiler about this and why the Surface Book 3 still doesn’t have Thunderbolt support.\n  “We have a general strategy around making sure that the components we put in the device are meant for the capabilities that we believe our customers will use,” says Seiler. “So between what’s in Surface Book 3 and what we’re putting in the new Dock, we believe they will have the performance that they need.”\n   Microsoft is also  announcing a Surface Dock 2 today, complete with fast charging, four USB-C ports, and support for two 4K monitors at 60Hz thanks to higher DisplayPort bit rates. The Surface Connector cable length has also increased on the Dock 2 to make it easier to position a device next to the dock.\n Little else has changed on the outside of the Surface Book 3, though. Microsoft is adding far-field studio mics like it did with the Surface Laptop 3, and the company is trying to make it easier to purchase Surface devices, as it’s difficult to get into stores during the pandemic. “Anyone who buys from a store will have a 60-day return window, free shipping, and access to on-demand and live training,” Seiler says. “For those that need a device, but this may not be the best time to pay for it, we’ll also offer all access pricing so they can purchase with low monthly payments.”\n The Surface Book 3 is available to preorder starting at $1,599 today, and ships in the US and Canada on May 21st. It will roll out to other markets “in the weeks to follow,” and the Surface Dock 2 will start shipping on May 26th, priced at $259.99.", "posttime": "2020-05-06 22:54:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,nvidia,gpu,launches", "title": "微软推出配备新NVIDIA GPU选项的Surface Book 3", "title_en": "Microsoft launches Surface Book 3 with new Nvidia GPU options", "transed": 1, "url": "https://www.theverge.com/2020/5/6/21247907/microsoft-surface-book-3-specs-price-release-date", "via": "", "real_tags": ["微软", "microsoft", "nvidia", "gpu", "launches"]}, {"category": "", "categoryclass": "", "imagename": "061248a82d5daa1aa19bebeac1cdab5b.jpg", "infoid": 1000951, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的Surface设备和附件今天开始接受预订，旨在帮助您随时随地工作、学习、连接和娱乐。\n我们的工作方式、联系方式和学习方式就在我们面前不断发生变化。我们的设备已经成为我们通向世界的窗口-我们的办公室、我们的学校和我们的社交空间。为了帮助驾驭当前环境，人们比以往任何时候都更多地求助于Windows PC。事实上，每月花在Windows10上的时间超过4万亿分钟，同比增长75%。这不仅仅是更大的屏幕和更好的键盘的吸引力，而是一款设备的多功能性，它运行我们需要的软件，以及我们喜欢的游戏和娱乐，内置摄像头和麦克风，将我们与最重要的人联系起来。这就是Windows PC要做的事情。这就是我们设计Surface的目的。\n新款Surface Go 2、Surface Book 3、Surface耳机2、Surface耳塞和配件旨在帮助您随时随地做您需要的事情-这一概念自我们第一次开始开发这些产品以来就具有了新的影响力。我们不再是飞机、咖啡厅和办公室，而是从家庭办公室搬到厨房桌子再搬到沙发，但我们对保持高效和联系的设备的需求从未像现在这样强烈。\n作为一家公司，我们专注于在这个变革时期为我们的客户提供支持。从让每个人都可以使用Microsoft团队到不断发展的Microsoft 365，我们希望确保每个人和每个组织都拥有保持联系和提高工作效率所需的工具。没有什么比看到我们的客户和员工对我们的产品所做的令人惊叹的事情更能激励我了。我与悉尼新南威尔士大学的David Kellermann博士这样的教育工作者和ELISA这样的家长联系过，他们使用Surface让学生参与进来，并在家学习。我感受到了我们自己的团队在导航如何远程制造产品并将其推向市场时的能量。我非常感谢他们为我们的客户所做的工作。我们非常高兴能将这些新的Surface设备送到人们手中，与他们今天所处的位置见面，并为他们提供持续工作、持续创造和持续学习所需的工具。\n随着我们不断扩大Surface设备系列，我们的目标是为每个人、每种工作方式和每个地点设计一款Surface，从最便携的设备扩展到最高性能的设备。为您提供可以像您一样快速切换上下文的设备，让您从工作到娱乐，再到两者之间的一切。今天，我们将发布四款新产品和新配件，切记这一点。\nSurface Go 2以轻便便携的设计提供了难以置信的价值，为您的公司或家庭中的任何人提供了一款出色的设备。\nSurface Book 3是我们有史以来功能最强大的笔记本电脑。这是一款功能强大的工作站，专为需要从任何地方获得台式机级别性能的专业人士而设计。\nSurface耳机2和Surface耳塞完善了您的Surface体验，帮助您随时随地找到焦点，并与重要的人和内容保持联系。\nSurface Dock 2和多端口Microsoft USB-C Travel Hub可帮助您随时随地设置终极工作空间。\n我们创建Surface Go是为了给Surface系列提供更实惠、更便携的2：1。英国的法学院招生委员会、雷诺/F1和国家医疗服务公司(National Healthcare Services)等组织，以及密苏里州的蓝泉学区和日本爱知县等学校都选择了Surface Go，因为它的紧凑设计、触摸屏、键盘、Pen的多功能性以及LTE Advanced的附加连接。\nSurface Go 2保持了相同的轻薄设计，但现在提供了更大的10.5英寸像素感应显示屏，提高了电池续航时间，并且首次采用第8代英特尔®酷睿™M选项，使性能比最初的型号快64%。我们增加了Studio Mics，这是我们的双麦克风解决方案，可提高团队会议或视频聊天的语音清晰度并降低背景噪音，500万像素的前置摄像头即使在光线较弱的情况下也能提供清晰的视频。我们还为后置摄像头添加了新的摄像头应用程序，以便轻松扫描文档和白板-无论你是分享会议笔记还是交作业。搭配Surface Pen，Surface Go 2可以让远程学习者和远程工作者保持数字化，同时释放天然墨水的力量，用于绘制图表、标记文档或处理数学公式。你可以个性化你的Surface Go，有各种颜色的Type Go，包括白金，黑色，罂粟红和冰蓝。Surface Go 2起价399美元，将于5月12日开始发售。\n当我们第一次设计Surface Book时，我们的目标是让人们在一个设计精美的设备中拥有台式机的强大功能，平板电脑的多功能，以及轻薄笔记本电脑的自由。开发人员、设计师和专业人士依赖Surface Book进行编码和编译，使用Adobe和Autodesk进行工作负载，以及使用适用于PC或Steam的Xbox Game Pass进行游戏。\nSurface Book 3是我们有史以来功能最强大的笔记本电脑，提供比Surface Book 2高达50%的性能和长达17.5小时的电池续航时间。无论您选择13英寸还是15英寸，Surface Book 3都具有漂亮的清晰度、高DPI像素感应显示屏、流畅、精确的触控板、舒适的键盘和第10代英特尔®酷睿™处理器的性能，并可选择独立的NVIDIA®GeForce GTX™或Quadro RTX™GPU。对于推动设备计算和IO性能的开发人员来说，Surface Book 3现在配备了高达32 GB的RAM和我们有史以来最快的SSD。对于热爱游戏的人来说，Surface Book 3 15英寸拥有NVDIA GeForce GTX™图形处理器，足以在流畅的60帧/秒内以1080p的速度玩PC游戏的顶级Xbox游戏通行证。我们还为NVIDIA Quadro RTX™3000增加了一个新选项，以更好地满足商业客户和高等教育机构的需求。Surface Book 3售价1599美元起，将于5月21日开始发售。\n人们告诉我们，戴上耳机在今天相当于在任何环境下关上办公室的门，专注和联系。表面耳机2的设计可以舒适地滑过您的耳朵，并以壮观的音质环绕您，包括13个级别的环境噪音控制。我们改善了音质和电池续航时间，为您带来长达20小时的清晰声音。*我们的有源噪音消除功能可通过直观的耳机刻度盘进行调节，并专门调整为屏蔽或放大人声。“当您试图在家与室友、孩子、重要的其他人或宠物一起工作时，这将派上用场。”我们更新了耳杯设计，使佩戴在脖子上时更加舒适，并在经典白金耳机的基础上增加了漂亮的黑色抛光选项。Surface耳机2的定价为$2美元。“我们更新了耳杯设计，使佩戴在脖子上时更舒适，并在经典白金耳机的基础上增加了漂亮的黑色抛光选项。Surface耳机2的定价为$2。\n我们知道，有时你想在不完全与世隔绝的情况下联网-比如在外出跑步时听音乐，或者在做饭时接电话。Surface耳塞拥有超舒适和稳定的贴合，提供直观的触摸控制，这样你就可以在不拿出手机的情况下开始打电话或更换歌曲。体验丰富、身临其境的全方位音效，只需轻击耳塞三下，即可从您的Android手机上即时播放Spotify。通过与Microsoft 365的无屏幕集成，您可以在适用于iOS的Outlook移动应用程序中播放我的电子邮件，或在Word、Outlook或PowerPoint中听写。随附的无线充电盒让您享受全天的电池续航时间。Surface耳机定价199美元，将于5月12日开始发售。\n能够连接到显示器、附件和附加存储设备，可帮助您设置终极工作空间。*Surface Dock 2通过简单的磁性点击帮助您扩展工作空间，并提供更快的充电速度、更高的数据传输率和\n我们还推出了两个新的Microsoft配件捆绑包，旨在帮助您提高工作效率和舒适性，无论您的办公室位于何处。Microsoft符合人体工程学的台式机采用分体式键盘设计，以软垫掌托和带软垫拇指靠背的超精密鼠标为特色，可减轻疲劳，并提供非凡的舒适性和控制力。*微软蓝牙台式机为您提供了纤薄现代设计的全尺寸按键和小巧时尚的鼠标，让您手持自如。微软人体工学台式机定价为89.99美元，微软蓝牙台式机定价为59.99美元。\n新款Surface Go 2、Surface Book 3、Surface耳机2、Surface耳塞、Surface Dock 2和配件今天在特定市场接受预订，并将在未来几个月向所有Surface市场推出。为了帮助更好地满足我们看到的对Surface的全球需求，我们很高兴地与大家分享，我们将于今年晚些时候将Surface引入墨西哥和南非。\n我们希望这些新产品不仅能帮助人们在目前工作和学习的任何地方提高工作效率，还能帮助人们找到专注和放松的时刻。凭借我们有史以来最完整的Surface产品组合，我们拥有可满足广泛需求的设备和附件。我们将为您找到最适合您的Surface。我们迫不及待地想看看你会怎么处理它。", "note_en": "Available for preorder today, new Surface devices and accessories are designed to help you work, learn, connect and play from anywhere\n  The way we work, connect and learn continues to change right in front of us. Our devices have become our window to the world – our office, our school and our social space. To help navigate the current environment people are  turning to Windows PCs more than ever. In fact, over 4 trillion minutes are being spent on Windows 10 a month, a 75% increase year on year. It’s not just the pull of the larger screen and better keyboard, but the versatility of a device that runs the software we need and games and entertainment we love, with cameras and mics built in to connect us to the people who matter most. This is what Windows PCs were built to do. This is what we design Surface for.\n The new Surface Go 2, Surface Book 3, Surface Headphones 2, Surface Earbuds and accessories are designed to help you do what you need, from anywhere – a concept that has taken on new weight since we first started working on these products. Instead of planes, coffee shops and offices, we’re moving from home office to kitchen table to couch, but our need for devices that keep us productive and connected has never been greater.\n As a company, we are focused on supporting our customers during this time of change. From making  Microsoft Teams available to everyone to  evolving Microsoft 365, we want to make sure every person and every organization has the tools they need to stay connected and productive. Nothing inspires me more than seeing the amazing things our customers and employees are doing with our products. I’ve connected with educators like  Dr. David Kellermann at the UNSW in Sydney and parents like  Elisa who are using Surface to keep students engaged and learning from home .  I’ve felt the energy from our own team as they navigated how to build and bring products to market remotely. I am deeply appreciative of work they are doing for our customers. We are so excited to get these new Surface devices in people’s hands, meeting them where they are today and supporting them with the tools they need to keep working, keep creating and keep learning.\n  As we continue to expand our Surface family of devices, our goal is to design a Surface for every person, every work style and every location, scaling from the most portable to the most performant. To give you devices that can switch context as quickly as you do to take you from work to play to everything in between. Today we are announcing four new products and new accessories with that in mind.\n Surface Go 2 delivers incredible value in a light, portable design, providing a great device for anyone in your company or family.\n Surface Book 3 is our most powerful laptop ever. Designed for professionals who need desktop-level performance from anywhere, this is the powerhouse workstation.\n The  Surface Headphones 2 and  Surface Earbuds complete your Surface experience, helping you find focus wherever you are and stay connected to the people and content that matters.\n The  Surface Dock 2 and the multi-port  Microsoft USB-C Travel Hub help you set up the ultimate workspace wherever that may be.\n   We created Surface Go to offer a more affordable and portable 2:1 to the Surface line. Organizations  like Law School Admissions Council, Renault/F1 and National Healthcare Services in the U.K., and schools like Blue Springs School District in Missouri and Aichi Prefecture in Japan, have chosen Surface Go for its compact design, the versatility of the touch screen, keyboard, Pen and added connectivity of LTE Advanced.\n Surface Go 2 keeps the same thin, lightweight design, but now offers a larger 10.5-inch PixelSense display, improved battery life and a model with up to 64% faster performance than the original with 8 th Generation Intel® Core™ M options for the first time. We’ve added Studio Mics, our dual microphone solution, to increase voice clarity and reduce background noise for Teams meetings or video chats, and a 5MP front-facing camera delivers sharp video even in low light. We’ve also added the new Camera app for the rear-facing camera to make it easy to scan documents and whiteboards – whether you’re sharing notes from a meeting or turning in homework. Paired with Surface Pen, Surface Go 2 allows distance learners and remote workers to stay digital, while unlocking the power of natural ink for things like drawing diagrams, marking up documents or working through math equations. You can personalize your Surface Go with Type Covers, Sleeves and accessories in a variety of colors, including Platinum, Black, Poppy Red, and Ice Blue. Surface Go 2 starts at $399 and will be available starting May 12.\n    When we first designed Surface Book, our goal was to give people the power of a desktop, the versatility of a tablet, and the freedom of a light and thin laptop in one beautifully designed device. Developers, designers and professionals rely on Surface Book for coding and compiling, workloads in Adobe and Autodesk, and for gaming with Xbox Game Pass for PC or on Steam.\n Surface Book 3 is our most powerful laptop ever, providing up to 50% more performance than Surface Book 2 and up to 17.5 hours of battery life.  Whether you choose 13-inch or 15-inch, Surface Book 3 has beautifully crisp, high-DPI PixelSense Display, smooth, precise trackpad, comfortable keyboard and the performance of 10 th Generation Intel® Core™ processors and choice of discrete NVIDIA® GeForce GTX™ or Quadro RTX™ GPUs.  For developers that push the computing and IO performance of their device, Surface Book 3 now comes with up to 32GB of RAM and the fastest SSD we have ever shipped. For people who love to game, Surface Book 3 15-inch has an NVDIA GeForce GTX™ GPU with enough power to play the top Xbox Game Pass for PC titles at 1080p in a smooth 60 frames per second. We’ve also added a new option with the NVIDIA Quadro RTX™ 3000 to better meet the needs of commercial customers and higher education institutions. Surface Book 3 starts at $1599 and will be available starting May 21.\n   People tell us that putting on headphones is today’s equivalent of shutting the office door to focus and connect in any setting. Surface Headphones 2 are designed to slip comfortably over your ears and surround you with spectacular sound quality, including 13 levels of ambient noise control. We improved sound quality and battery life, bringing you up to 20 hours of clear sound. Our active noise cancellation is adjustable through intuitive on-ear dials and specifically tuned to either block out or amplify human voices.  This comes in handy when you are trying to work from home with roommates, kids, significant others or pets. We updated the ear cup design to rotate 180 degrees for greater comfort when wearing around your neck, and added a beautiful Black finish option in addition to our classic Platinum. Surface Headphones 2 are priced at $249 and will be available starting May 12.\n   We know there are times when you want to be connected without fully shutting out the world – such as listening to music while out for a run or taking a call while making dinner.  Featuring an ultra-comfortable and stable fit, Surface Earbuds offer intuitive touch controls so you can start a phone call or change the song without taking out your phone. Experience rich, immersive Omnisonic sound and instantly play Spotify from your Android phone with a triple tap on either earbud. Screen-free integration with Microsoft 365 lets you catch up on emails with Play My Emails in the Outlook Mobile App for iOS or allow you to dictate in Word, Outlook or PowerPoint. Enjoy all-day battery life with the included wireless charging case. Surface Earbuds are priced at $199 and will be available starting May 12.\n   The ability to connect to monitors, accessories and additional storage can help you set up the ultimate workspace.  Surface Dock 2 helps you expand your workspace with a simple magnetic click and delivers faster charging, higher data transfer rates and the enterprise management tools people have been asking for. We’re also announcing a new multi-port Microsoft USB-C Travel Hub to give you more ways to connect to networks, displays and USB-C™ accessories when you’re on the go. Surface Dock 2 is priced at $259.99 and the Microsoft USB-C Travel Hub is priced at $99.99. Both will start shipping to customers later this month in select markets.\n  We’re also introducing two new Microsoft accessories bundles designed to help make you more productive and comfortable wherever your office is located. The Microsoft Ergonomic Desktop reduces fatigue and delivers exceptional comfort and control with a split keyboard design featuring a cushioned palm rest and an ultra-precise mouse with cushioned thumb rest.  The Microsoft Bluetooth Desktop gives you a full-sized keyset in a slim and modern design and a compact, stylish mouse that fits comfortably in your hand. The Microsoft Ergonomic Desktop is priced at $89.99 and the Microsoft Bluetooth Desktop is priced at $59.99.\n The new Surface Go 2, Surface Book 3, Surface Headphones 2, Surface Earbuds, Surface Dock 2 and accessories are available for preorder today in select markets and will roll out to all Surface markets in the coming months. To help better address the global demand we are seeing for Surface, we excited to share that we will bring Surface to Mexico and South Africa later this year.\n We hope these new products will not only help people be more productive from wherever they are currently working and learning, but also help people find moments of focus and relaxation. With our most complete Surface portfolio ever, we have devices and accessories to meet a broad set of needs.  Find the Surface that’s right for you. We can’t wait to see what you’ll do with it.", "posttime": "2020-05-06 22:53:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "surface", "title": "Surface Go 2、Surface Book 3、Surface耳机2和Surface耳塞", "title_en": "Surface Go 2, Surface Book 3, Surface Headphones 2 and Surface Earbuds", "transed": 1, "url": "https://blogs.windows.com/devices/2020/05/06/introducing-surface-go-2-surface-book-3-surface-headphones-2-and-surface-earbuds/", "via": "", "real_tags": ["surface"]}, {"category": "", "categoryclass": "", "imagename": "7dd200e739b8172944784cb85925e0d6.jpg", "infoid": 1000950, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲南半球天文研究组织", "note_en": "ESO, European Organisation for Astronomical Research in the Southern Hemisphere", "posttime": "2020-05-06 22:53:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "仪器,instrument,南半球", "title": "ESO仪器发现距离地球最近的黑洞", "title_en": "ESO Instrument Finds Closest Black Hole to Earth", "transed": 1, "url": "https://www.eso.org/public/news/eso2007/", "via": "", "real_tags": ["仪器", "南半球"]}, {"category": "", "categoryclass": "", "imagename": "35cf4f8626d2a5da627e8b534a8243e4.jpg", "infoid": 1000949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在上周提交给美国证券交易委员会(SEC)的文件中，优步披露了裁员3700人的计划。这一数字约占这家叫车巨头员工总数的14%。\n该公司在文件中称，裁员是计划削减运营费用的一部分，“以应对冠状病毒大流行带来的经济挑战和不确定性，及其对公司业务的影响.”\n虽然优步并没有完全暂停运营，但由于州政府发布了非必要工人的居家命令，该公司的底线无疑受到了巨大的打击。\n在给员工的一封信中，首席执行官Dara Khosrowshahi指出，裁员将来自社区运营和招聘。优步还将关闭约40%的Greenlight门店-用于面对面的司机协助。\n他写道：“随着我们乘车出行数量大幅下降的现实，我们对CommOps以及面对面支持的需求也大幅下降。”“在我们冻结招聘的情况下，招聘人员根本没有足够的工作。”\n该公司在备案文件中写道：“鉴于上述情况，公司首席执行官Dara Khosrowshahi在与董事会协商后，同意在截至2020年12月31日的本年度剩余时间内免除基本工资。”关于这一决定，Khosrowshahi先生和本公司签订了一项书面协议，自2020年5月2日起生效。", "note_en": "In  an SEC filing dating back to last week, Uber disclosed plans to layoff 3,700 employees. The figure amounts to around 14% percent of the ride hailing giant’s total workforce.\n In the document, the company states that the job loss is part of a planned reduction in operating expenses “in response to the economic challenges and uncertainty resulting from the COVID-19 pandemic and its impact on the company’s business.”\n While Uber hasn’t suspended operations altogether, the company has no doubt taken a massive hit to its bottom line as state governments have issued stay at home orders for non-essential workers.\n  In  a letter to staff, CEO Dara Khosrowshahi noted that the cuts will come from from community operations and recruiting. Uber will also be closing around 40 percent of its Greenlight locations — used for in-person driver assistance.\n “With the reality of our rides trips volumes being down significantly, our need for CommOps as well as in-person support is down substantially,” he writes. “And with our hiring freeze, there simply isn’t enough work for recruiters.”\n  “In connection with the foregoing, Dara Khosrowshahi, the Company’s Chief Executive Officer, after consultation with the Board of Directors, agreed to waive his base salary for the remainder of the year ending December 31, 2020,” the company writes in the filing. “In connection with this decision, Mr. Khosrowshahi and the Company entered into a letter agreement, effective as of May 2, 2020.”", "posttime": "2020-05-06 22:53:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,plummet", "title": "优步裁员3700人，因为冠状病毒导致乘车人数暴跌", "title_en": "Uber is laying off 3,700, as rides plummet due to Covid-19", "transed": 1, "url": "https://techcrunch.com/2020/05/06/uber-is-laying-off-3700-as-rides-plummet-due-to-covid-19/", "via": "", "real_tags": ["病毒", "冠状病毒", "plummet"]}, {"category": "", "categoryclass": "", "imagename": "ffc7e5e099b2f30170aaee50ed21ee6c.png", "infoid": 1000948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面向Web的精美矩阵协作客户端。通过在GitHub上创建帐户，为Vector-im/riot-web开发做出贡献。", "note_en": "A glossy Matrix collaboration client for the web. Contribute to vector-im/riot-web development by creating an account on GitHub.", "posttime": "2020-05-06 22:53:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "包间,default,web", "title": "riot.im：v1.6中包间的默认E2EE", "title_en": "Riot.im: Default E2EE for private rooms in v1.6", "transed": 1, "url": "https://github.com/vector-im/riot-web/releases/tag/v1.6.0", "via": "", "real_tags": ["包间", "default", "web"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一生中参加过相当多的编程课程。其中有几个已经在神圣的C编程语言中出现了。曾经有一段时间，C和C++是我唯一可以说自己精通的语言。\n多年来，我在所有这些课程中看到了一个不变的模式-它们教给你所有你应该学习的基础知识，但没有教给你你将需要的东西。例如，您已经学习了使用结构，但没有太多关于如何使用它们来理解您在用C语言编写代码时可能经常遇到的邪恶的疯狂行为。我将向您展示这个巧妙的技巧，它使用了结构，可以真正简化数组的工作。您可以使用宏做一些简单的事情，使动态分配大量的时间变得可读。是的，stdio.h内部就有一些令人惊叹的工具，它们可以使字符串操作变得容易得多。您可以使用此技巧来实现对C代码方式的一些根本更改。\n这不是一篇面向专业C程序员的文章。这是为那些希望能够真正使用C的Python和Javascript程序员准备的，因为他们习惯于让自己喜欢的语言做一些有用的事情。\n通常，当我们使用struct数据类型时，我们定义的结构如下所示：\n我对此没有问题-这是一个经典的方法，每个优秀的C程序员都知道-但是我必须在这里放两次struct关键字吗？我可以推荐一个简单的习惯用法来定义结构吗？它可以将代码的整体感觉改变为更现代、更不过时的东西。\n仅此而已。我们没有为该结构命名，但我们将其用作tyecif的一部分，以便为特定数据类型(即该结构)创建一个新名称。现在，宣言应该是这样的：\n对于任何更熟悉OOP代码的人来说，这比对C代码更具可读性。\n为什么有人要这么做？因为即使对于我们这些只使用Python、Javascript和Java等高级语言工作的人来说，有时我们也只需要使用一小段C(算了吧，没有一小段C-它至少有30行；)如果您遇到这种情况，需要编写C代码，但是真的希望它有面向对象的感觉，那么这是一个保持头脑清醒的简单工具。说到OOP感觉，\n看看这个函数，它读取C中的整数数组并计算它们的和：\nint sum(int*arr，int length){int sum=0，i；for(i=0；i&lt；length；i++)sum=sum+arr[i]；return sum；}。\n一个简单、友好、丑陋得不可调和的功能。为什么，哦，为什么，为什么以伟大的Chthullu的名义，有一个额外的参数来表示数组的长度？从字面上看，没有任何其他编程语言-即使是那个丑陋的灾难Java-也不需要这样。只有在C和C++中-在实际的C++中也不是这样，因为他们使用像std：：Vector这样合理的东西-我们必须处理这种不美观的问题。我有一个简单的解决方案来处理这个乱七八糟的问题，它涉及到C：\n是的，我正在制作一个结构，用大写的I命名为Int，使用tyecif，并使其包含一个用于动态分配的指针，以及一个用于存储如此动态分配的数组长度的谦虚整数。不完全是火箭科学，是吗？现在我们要做的就是让一些函数初始化结构，有点像构造函数，如果你愿意的话。完成此操作后，我在上面编写的函数将变得更加美观：\nint sum(Int Arr){int sum=0，i；for(i=0；i&lt；Arr.length；i++)sum=sum+Arr.val[i]；return sum；}。\n那里。疼吗？如果我们没有LENGTH变量的精确值，就会发生这种情况，但是如果我们在分配内存时设置LENGTH变量，这里应该没有什么问题。构造函数简单地如下所示：\nint newInt(Int Length){Int A={null，0}；A.val=(int*)malloc(sizeof(Int)*length)；A.length=length；返回A；}。\n只有一件事需要注意-虽然指针val总是通过值传递，但它所指向的东西却不是。在函数内更改Arr.val的成员，后果自负。\n该函数中唯一难看的代码是其中包含malloc的那一行。这就是我下一步要做的。\n当您想要动态分配任何类型的数组时，请使用它生成的新宏。其实很简单：\n//长度为5的整数数组：int*arr=new(int，5)；//长度为2的双精度数组：Double*Trouble=new(Double，2)；//长度为25的字符串，不含空字符：char*name=new(char，26)；\n我真的需要解释这个吗？所有的malloc语句彼此都太相似了，不值得一遍又一遍地写。只需使用此单行样板将所有malloc语句替换为一个像样的新语句，就像您在C++或Java中使用的那样。\n请注意最后一个示例。我们已经创建了一个字符串。众所周知，使用C中的字符串是一件令人难以置信的痛苦。即使有了string.h库，它们仍然是需要处理的巨大痛苦。所有方法都会四处传递指针。其中一些函数更改了参数中的字符串，这些函数之所以可以这样做，是因为我们必须逐个指针地传递字符串。他们中的一些人没有，因为有问题的程序员当时感觉很好。它真的是一团糟，而string.h一直(至少对我来说)是访问文档的地方。即使这样，也没有简单方法可以将字符串解析为整数或将整数取消解析为字符串，如果您遇到需要的这种情况，您将会很难过。\n在C的好的旧stdio.h头中有两个令人难以置信的强大功能，没有人谈论它们。令人怀疑的是，老师们对此保持沉默。如果你在课堂上遇到过他们，一定要让我知道。即使是关于C语言的好书也不会花太多时间颂扬这些坏男孩的优点。我不知道为什么这两个令人惊叹的功能总是默默无闻。\n当然，我所说的无名英雄是spintf和sscanf方法。这些都非常有用。他们干些什么？它们所做的正是它们的表亲fprintf和fscanf所做的事情，但是这些函数不是写入和读取文件，而是写入字符串。\n是。它们不使用文件指针，而是使用指向字符数组的指针作为第一个参数。然后，它们只需对char数组本身进行写入或读取！\n想象一下这意味着什么。这是一条连接两个字符串str1和str2并将它们放入新字符串target中的简单语句：\n现在，为什么不用好的老的strcat呢？嗯，原因有三个：\n这个更快。它比strcat快大约20%，因为它使用syscall访问存储在target中的字符串，而不是在其上循环。我在MANJARO5.4内核(LINUX)的Manjaro上检查过使用GCC 9.3。\n如果您想用空格或逗号连接两个字符串，该怎么办呢？比如，把名字和姓氏写成全名？\n最好的部分是您可以在两个字符串之间放置任何东西-逗号、空格、制表符、换行符等等。想要在拍打第二个字符串的末尾之前删除第一个字符串的最后两个字符吗？在他们中间放一双\\b。想要用“abcde”替换字符串的前N个字符吗？在他们之间放一个回车。可能性是无限的!。\n你有一个整数。你有一根绳子。您希望在字符串末尾追加整数。Python中类似这样的内容：\n用C语言做这件事是极其困难的。除非使用spintf。然后就会变得极其简单。请注意此代码：\n请再次注意，连接的对象根本不需要是字符串！这就是我们的下一个大把戏：\n是的，解析。在字符串S中有一个整数，就像我们在字符串S中写一个数字一样，换句话说，是逐位写入数字。您的工作是将其放入整数变量n中，该变量应该包含二进制格式的整数，就像整数在RAM中的存在方式一样。\n就像Javascript中的parseInt或Python中的int一样简单。与Java中的Integer.parseInt一样简单(好吧，很奇怪，但很简单)。就像C#中的int.parse一样简单。C和C++的噩梦。\n输入sscanf。注意这个词的用法。它类似于fscanf，但是它从字符串中读取变量，而不是从文件中读取。开始：\n将现有整数n转换为字符串并将其存储在字符串变量S中同样容易，只需打印到S，而不是从它进行扫描：\n现在，有一件重要的事情需要注意：您将要求stdio使用这两个函数。如果将它们放在头文件中，则需要确保在stdio.h头文件之后调用头文件。\n这就是目前的情况。在我的下一篇文章中，我将讨论如何实现拆分和联接函数。然后我将使用C++，因为std：：Vector类在存储字符串列表方面比直接数组要好得多，我们的拆分函数将实现该列表，而我们的联接函数将读取为参数。\n然而，有了后两个函数，就有可能做出比单纯的技巧和习惯用法强大得令人难以置信的东西。当然，我说的是变量变量数据类型。\n这将需要C++提供的一些有趣的抽象。在我的下一篇文章中，我将写关于实现动态类型变量数据类型，并使用它来生成无数类型变量的向量。\n祝您今天过得愉快。请发表评论。我想知道我是否做错了什么，或者这些技术是否已经被其他程序员发现并以他们的名字命名(我不打算抄袭！)。或者是否有更大的简化可用。", "note_en": "I have been in a fair number of programming courses in my life. Several of these have been in the hallowed C programming language. There was a time when C and C++ were the only languages I could call myself proficient in.\n Over the years, I have seen a constant pattern in all these courses - they teach you all the basics you should learn, but none of what you will need. For instance, you have been taught to use structures, but not much about how to use them to make sense of vile madness that you might often encounter while coding in C. There is this neat trick I will show you which uses structures and can really simplify working with arrays. There’s something easy you can do with macros to make dynamic allocations tons of times readable. And yes, there are amazing tools right inside  stdio.h which can make string manipulation much easier. And you can use this trick to implement some radical changes in the way you code C.\n This is not an article for professional C programmers. This is for Python and Javascript programmers who would like to be able to really  use C, the way they are used to making their favourite languages do useful things.\n  Generally, when we work with the  struct datatype, we define the structures something like this:\n     I have no problem with this - it is a classic method, something every good C programmers would know - but must I place the  struct keyword twice here? Might I suggest a simple idiom for defining the structure which changes the whole feel of the code to something more modern and less archaic?\n  And that is all. We do not give the structure a name, but we use it as part of a  typedef to make a new name for the specific datatype which is this structure. Now, this is what the declaration would look like:\n  This is much more readable to anyone who is more familiar with OOP code than with C code.\n Why would someone do this? Because even for those of us who work only in higher level languages like Python, Javascript and Java, there are times when we just  have to use a small snippet of C. (scratch that, there is no such thing as a  small snippet of C - it is at least thirty lines;) This is a simple tool to maintain your sanity if you are ever stuck in such a situation and need to make a C code, but are really wishing that there was some OOP feel to it. Speaking of OOP feel,\n  Look at this function, which reads an array of integers in C and computes their sum:\n int sum(int *Arr, int length){ int sum = 0, i; for(i = 0; i &lt; length; i++) sum = sum + Arr[i]; return sum;}\n A simple, friendly, and irreconcilably ugly function. Why, oh why, why in the name of the Great Chthullu, is there an additional argument for the length of the array? Literally  NO other programming language - not even that ugly disaster Java - requires this.  Only in C and C++ - and that too not in practical C++ where they use sensible things like  std::vector - must we deal with this unaesthetic. I have a simple solution to deal with this mess, and it involves some primitive encapsulation in C:\n  Yes, I am making a structure, naming it  Int with a capital  I using a typedef, and making it contain a pointer for dynamic allocation, and a humble integer to store the length of the array so dynamically allocated. Not exactly rocket science, is it? Now all we have to do is make some functions initialize the structure, sort of like a  constructor, if you will. Once this is done, the function I wrote above will become much more beautiful:\n int sum(Int Arr){ int sum = 0, i; for(i = 0; i &lt; Arr.length; i++) sum = sum + Arr.val[i]; return sum;}\n There. Did that hurt? It would if we didn’t have an accurate value of the length variable, but if we set the length variable at the time when we allocate the memory, there should be nothing wrong here. The constructor is simply something like this:\n Int newInt(int length){ Int A = {NULL, 0}; A.val = (int *)malloc(sizeof(int) * length); A.length = length; return A;}\n There is just one thing to note - while the pointer  val is always being passed by value, the things it points to are not. Change the members of  Arr.val inside a function at your own peril.\n The only bit of ugly code in that function is the line with the  malloc in it. And that is what I will take on next.\n    When you want to dynamically allocate an array of any type, use the  new macro it makes. It’s really simple:\n // Integer array of length 5:int *Arr = new(int, 5);// Double array of length 2:double *Trouble = new(double, 2);// String of length 25, excluding the null character:char *name = new(char, 26);\n Do I really need to explain this? All malloc statements are too similar to one another to merit being written over and over again. Just use this single-line boilerplate to replace all malloc statements with a decent  new statement like you would use in C++ or Java.\n  Note the last example. We have created a string. As everyone knows, strings in C are an incredible pain to have to work with. Even with the  string.h library, they are still an epic pain to deal with. All the method pass pointers around. Some of them change the strings in their arguments, something these functions can do only because we have to pass them strings by pointer. Some of them don’t, because the programmer in question was feeling kind at the moment. Its a real mess, and  string.h has always, at least for me, been a visit to the documentation. Even with all that, there is no easy way to parse a string into an integer or unparse an integer into a string, and woe be upon you if you were to ever come across such a situation as would need\n There are two incredibly powerful functions in the good old  stdio.h header of C which no one talks about. Teachers are suspiciously silent about them. If you have ever come across them in a class lecture, do let me know about it. Even good books on C do not spend much time extolling the virtues of these badboys. I do not know why these two amazing functions must always languish in obscurity.\n The unsung heroes I speak of are, of course,  sprintf and  sscanf methods. These are incredibly useful. What do they do? Well, they do  exactly what their cousins  fprintf and  fscanf do, but instead of writing to and reading from  files, these functions write to  strings.\n Yes. Instead of taking a  FILE pointer, they take a pointer to a  char array as their first argument. Then they simply  write to or read from the char array itself!\n Just imagine what this means. This is a simple statement to concatenate two strings  str1 and  str2 and place them inside a new string,  target:\n  Now, why would one not just use good old  strcat? Well, there are three reasons:\n This is faster. Its about 20% faster than  strcat, since it accesses the string stored in  target with a  SYSCALL instead of looping over it. I have checked using GCC 9.3 on Manjaro with kernel 5.4 (Linux).\n What if you wanted to concatenate two strings with a space between them, or a comma between them? Such as, making a full name out of first and last names?\n    The best part is that you can put literally anything between the two strings - a comma, a space, a tab, a newline, and so on. Want to remove the last two characters of the first string before slapping the second one at its end? Put a pair of  \\b between them. Want to replace the first N characters of a string by  “abcde”? Put a carriage return between them. The possibilities are endless!\n  You have an integer. You have a string. You want to append the integer at the end of the string. Something that goes like this in Python:\n     Doing this in C is insanely difficult. Unless use  sprintf.  Then it becomes insanely easy. Notice this code:\n  Once again, note that the things being concatenated need not be strings at all! And that is what leads us to our next great trick:\n  Yes, parsing. there is an integer written down like we would write a number - in other words, digit-by-digit - in the string  S. Your job is to put it in the integer variable  n, which should contain the integer in the binary format, the way integers are meant to exist in a RAM.\n As simple as  parseInt in Javascript or  int in Python. As simple as  Integer.parseInt (well, okay, grotesque, but simple) in Java. As simple as  int.parse in C#. A nightmare in C and C++.\n Enter  sscanf. Note how to use this one. Its like  fscanf, but it reads your variables off a string, not a file. Go:\n   It is equally easy to convert existing integer  n into a string and store it in a string variable  S. Simply print to  S instead of scanning from it:\n  Now, there is one important matter of note:  you are going to require  stdio to use these two functions. If you are placing them inside a header file, you need to make sure that the header file is called  after the  stdio.h header.\n  That is all for now. In my next article, I will discuss how to implement the  split and  join functions. I will be using C++ then, since the  std::vector class is much better than direct arrays for storing a list of strings, which our  splitfunction shall implement and our  join function will read as an argument.\n However, with those last two functions, it is possible to make something incredibly more powerful than mere tricks and idioms. I am talking, of course, about the  var -  Variant - datatype.\n This will require some of the juicy abstraction C++ provides. I will write about implementing a dynamically typed Variant datatype and using it to make a vector of variants of myriad types in my next article.\n Have a great day. And please do comment. I would like to know if I am wrong about anything, or if these techniques have already been discovered by other programmers and named after them (I do not intend to plagiarize!) or if there are even greater simplifications available.", "posttime": "2020-05-06 22:53:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,tricks", "title": "C/C++中的一些简单技巧", "title_en": "Some simple tricks in C/C++", "transed": 1, "url": "https://able.bio/Theocrat/some-simple-tricks-in-c-and-c--755ne2i", "via": "", "real_tags": ["c++", "tricks"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "立即开始使用Java", "note_en": "Get started with Java today", "posttime": "2020-05-06 22:52:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,官方网站", "title": "为什么Java官方网站如此过时？", "title_en": "Why is the offical Java website so outdated?", "transed": 1, "url": "https://www.java.com/en/", "via": "", "real_tags": ["java", "官方网站"]}, {"category": "", "categoryclass": "", "imagename": "f9be51f9dcaaa0ca64fc792b752c8b82.jpg", "infoid": 1000944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，微软最小的Surface平板电脑Surface Go 2进行了一些重要的硬件升级。最大的变化是显示屏更大：从原来的10英寸面板增加到10.5英寸。这不会改变Surface Go 2的整体大小，但会略微减小边框。它们没有Surface Pro X上的那么薄，但肯定没有近两年前的Surface那么大。\n更大的显示屏还意味着更大的1920x1280分辨率(220ppi)，同时仍然保持Surface Products众所周知的3：2宽高比。在内部，微软还调整了Surface Go 2的处理器选项。起价399.99美元的基本款仍然包括英特尔奔腾金牌处理器，但也有新的第8代酷睿m3机型。微软承诺，使用Core m3处理器选项，Surface Go 2的性能将提高64%。\n基本的Surface Go 2包括4 GB的RAM和64 GB的eMMC存储，而售价629美元的Core m3型号有8 GB的RAM和128 GB的固态硬盘。此外，还有8 GB内存和128 GB固态硬盘，搭载奔腾黄金处理器，售价为549美元。和往常一样，Surface Go Type的保护套是单独出售的，起价99美元。\n现有的Surface Go类型的盖子和附件在Surface Go 2上仍然可以很好地工作，因为硬件具有相同的尺寸和端口位置。这包括一个USB-C端口，用于充电和对接的Surface Connect端口，以及microSDXC读卡器。微软还在Surface Go 2上增加了录音棚麦克风，这将改善视频会议和音频通话。\n“我们也听取了延长电池续航时间的要求，”微软负责设备项目管理的公司副总裁罗宾·塞勒(Robin Seiler)在接受The Verge采访时解释道。“Surface Go 2拥有更大的物理电池和更低的功耗，因此您的电池续航时间长达10小时。”\n发布会上还将推出Surface Go 2的LTE机型，消费机型定价为729美元，配备Core m3处理器、8 GB RAM和128 GB固态硬盘存储。企业还将获得额外的LTE机型，配备Core m3处理器、8 GB RAM和256 GB SSD存储，售价879美元。\nSurface Go 2将于5月12日上市，在美国、加拿大、澳大利亚、新西兰、德国、奥地利、英国、爱尔兰、法国、瑞士、比利时、荷兰、丹麦、芬兰、挪威、瑞典、意大利、西班牙、葡萄牙、波兰和日本的售价为399美元起。", "note_en": "Microsoft’s smallest Surface tablet is getting some important hardware upgrades today in the form of the Surface Go 2. The most significant change is a bigger display: now 10.5 inches, up from the 10-inch panel on the original. That doesn’t alter the overall size of the Surface Go 2, but it does reduce the bezels slightly. They’re not as skinny as the ones found on the Surface Pro X, but they’re certainly nowhere near as big as the original Surface Go from nearly two years ago.\n The bigger display also means a bigger 1920 x 1280 resolution (220 ppi), while still maintaining the 3:2 aspect ratio Surface products are known for. Inside, Microsoft has also switched up the processor options on the Surface Go 2. The base model, which starts at $399.99, still includes an Intel Pentium Gold processor, but there’s also a new 8th Gen Core m3 model. Microsoft is promising 64 percent faster performance on the Surface Go 2 with the Core m3 processor option.\n While the base Surface Go 2 includes 4GB of RAM and 64GB of eMMC storage, the Core m3 model, priced at $629, has 8GB of RAM and a 128GB SSD. There’s also an 8GB RAM and 128GB SSD model with the Pentium Gold processor priced at $549. As always, Surface Go Type Covers are sold separately, starting at $99.\n   Existing Surface Go Type Covers and accessories will still work just fine on the Surface Go 2, as the hardware has the same dimensions and port placements. That includes a single USB-C port, the Surface Connect port for charging and docking, and the microSDXC card reader. Microsoft has also added studio mics to the Surface Go 2, which will improve videoconferencing and audio calls.\n “We also listened to the asks for longer battery life,” explains Robin Seiler, corporate vice president of program management for devices at Microsoft, in an interview with  The Verge. “Surface  Go 2 has a larger physical battery and reduced power consumption so you have up to 10 hours of battery life.”\n There will also be LTE models of the Surface Go 2 at launch, with a consumer model priced at $729, with the Core m3 processor, 8GB of RAM, and 128GB of SSD storage. Businesses will also get access to an additional LTE model, with the Core m3 processor, 8GB of RAM, and 256GB of SSD storage for $879.\n The Surface Go 2 will be available on May 12th, priced from $399 in the US, Canada, Australia, New Zealand, Germany, Austria, UK, Ireland, France, Switzerland, Belgium, Netherlands, Denmark, Finland, Norway, Sweden, Italy, Spain, Portugal, Poland, and Japan.", "posttime": "2020-05-06 22:52:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,显示屏,launches,surface", "title": "微软推出更大显示屏的Surface Go 2", "title_en": "Microsoft launches Surface Go 2 with a bigger display", "transed": 1, "url": "https://www.theverge.com/2020/5/6/21248142/microsoft-surface-go-2-tablet-10-5-inch-screen-price-release-date", "via": "", "real_tags": ["微软", "microsoft", "显示屏", "launches", "surface"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1000942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在T-Mobile和Sprint试图获得监管部门对其260亿美元合并的批准时，高管们一再承诺这笔交易将创造就业机会。不只是几个工作，而是很多工作。尽管美国电信业的历史表明，这类交易几乎总是会引发大规模裁员，但T-Mobile和Sprint的高管尽职尽责地重申，这笔交易将在第一年创造超过3500名全职美国员工，到2024年将增加11000人。\n在交易墨水还没有干之前，T-Mobile就开始关闭其Metro预付费业务，并解雇受影响的员工。当被问及相互矛盾的承诺时，T-Mobile拒绝回应媒体的询问。现在关闭速度加快了，估计随着新合并的公司关闭不想要的预付费零售商，T-Mobile子公司大约有6000名员工被解雇。T-Mobile表示，此举与冠状病毒无关，只是他们在优化自己的零售业务。业内人士对此并不感到好笑：\n自合并计划首次提出以来，Boost Mobile在澳大利亚和美国的创始人彼得·阿德顿(Peter Adderton)一直是Boost品牌和经销商的直言不讳的倡导者。他估计，最近的关闭影响了大约6000人。他援引一位经销商的话说，他不得不关闭95家门店，其中一些最早在5月1日就关闭了。\n在合并最终获得批准之前的争论中，T-Mobile和Sprint的高管都辩称，这不会导致许多反对者预测的那种失业。他们承诺创造就业机会，而不是削减就业机会。\n“整件事就是我们所说的，没有人把他们叫出来。这太不真诚了，“Adderton告诉Wilst，并补充说这不是因为冠状病毒。其他行业的许多零售商在危机期间都在关闭门店，但计划在安全的情况下重新开张。\n所有这些都不应该让任何人感到惊讶。从工会到华尔街股民，每个人都曾预测，随着时间的推移，随着多余的支持、零售和中层管理职位的取消，这笔交易将引发1.5万至3万人的裁员。这是美国主要电信合并中经常发生的事情。到目前为止，有40年来非常清楚、确凿的数据说明了这一点。然而，在去年的一篇博客文章(明年这个时候可能会被删除)中，T-Mobile首席执行官约翰·莱杰尔不仅坚称永远不会裁员，他还有效地指责工会、专家、消费者团体和一长串经济学家撒谎：\n这一合并完全是为了创造新的、高质量的、高薪的就业机会，新的T-Mobile从第一天起就是就业积极的，此后的每一天都是积极的。这不仅仅是一个承诺。这不仅仅是一个承诺。这是事实……到2021年，这些共同努力将创造近5600个新的美国客户服务工作岗位。到2024年，新T-Mobile将雇佣比独立公司多7500多名护理专业人员。\n那是永远不会发生的。竞争和旋转门减少，监管机构被俘虏，法院体系崩溃，这意味着T-Mobile在争取监管机构的同时，几乎没有动力去做它承诺的大部分事情。当然，在大流行的情况下，这样的就业增长更不可能发生，这将为无论如何都会发生的裁员提供绝妙的掩护。\n在看过更多这样的电信盛会后，通常会发生的情况是，这些公司通常会在大约一年的时间里不处理事情，以保持员工的冷静，并让人觉得交易批评者在夸大其词。然后，一旦媒体和公众不再关注(这不会花很长时间)，就会拿出斧头，开始裁员。当裁员和竞争减少不可避免地到来时，他们要么被忽视，要么被归咎于其他事情。在这种情况下，不可避免的是冠状病毒。\n几年后，批准这笔交易的监管机构将转到他们监管的同一家公司的智囊团、法律或游说职位。那些过度炒作合并前承诺的媒体不会再跟进，因为这种事后政策报道或消费者倡导是没有钱的。像约翰·莱杰尔(John Legere)这样的高管(在将他在纽约价值17.5美元的顶层公寓出售给乔治·阿玛尼(Giorgio Armani)后刚刚离开T-Mobile)得到了尽职尽责的回报，盲目合并狂热很快就被有意遗忘了，现实市场和人力成本也被遗忘了。", "note_en": "Back when T-Mobile and Sprint were trying to gain regulatory approval for their $26 billion merger, executives  repeatedly promised the deal would  create jobs. Not just a few jobs, but  oodles of jobs. Despite the fact that US telecom history indicates such deals almost  always trigger mass layoffs, the media  dutifully repeated T-Mobile and Sprint executive claims that the deal would create &#34;more than 3,500 additional full-time U.S. employees in the first year and 11,000 more people by 2024.&#34;\n  Before the ink on the deal was even dry, T-Mobile  began shutting down its Metro prepaid business and laying off impacted employees. When asked about the conflicting promises, T-Mobile refused to respond to press inquiries. Now that  shutdown has accelerated, with estimates that roughly 6,000 employees at the T-Mobile subsidiary have been laid off as the freshly-merged company closes unwanted prepaid retailers. T-Mobile says the move, which has nothing to do with COVID-19, is just them &#34;optimizing their retail footprint.&#34; Industry insiders aren&#39;t amused:\n &#34;Peter Adderton, the founder of Boost Mobile in Australia and in the U.S. who has been a vocal advocate for the Boost brand and for dealers since the merger was first proposed, figures the latest closures affect about 6,000 people. He cited one dealer who said he has to close 95 stores, some as early as May 1.\n In their arguments leading up to the merger finally getting approved, executives at both T-Mobile and Sprint argued that it would not lead to the kind of job losses that many opponents were predicting. They pledged to create jobs, not cut them.\n “The whole thing is exactly how we called it, and no one is calling them out. It’s so disingenuous,” Adderton told Fierce, adding that it’s not because of COVID-19. Many retailers in other industries are closing stores during the crisis but plan to reopen once it’s safe to do so.&#34;\n None of this should be a surprise to anybody. Everybody from unions to Wall Street stock jocks had  predicted the deal would trigger anywhere between 15,000 and 30,000 layoffs over time as redundant support, retail, and middle management positions were eliminated. It&#39;s what  always happens in major US telecom mergers. There are 40 years of very clear, hard data speaking to this point. Yet in a  blog post last year (likely to be deleted by this time next year), T-Mobile CEO John Legere not only insisted layoffs would never happen, he effectively accused unions, experts, consumer groups, and a long line of economists of lying:\n &#34;This merger is all about creating new, high-quality, high-paying jobs, and the New T-Mobile will be jobs-positive from Day One and every day thereafter. That’s not just a promise. That’s not just a commitment. It’s a fact....These combined efforts will create nearly 5,600 new American customer care jobs by 2021. And New T-Mobile will employ 7,500+ more care professionals by 2024 than the standalone companies would have.&#34;\n That was never going to happen. Less competition and  revolving door, captured regulators and a  broken court system means there&#39;s less than zero incentive for T-Mobile to do much of anything the company promised while it was wooing regulators. And of course such employment growth is even less likely to happen under a pandemic, which will provide &#34;wonderful&#34; cover for cuts that were going to happen anyway.\n Having watched more telecom megadeals like this than I can count, what usually happens is the companies leave things generally alone for about a year to keep employees calm and make it seem like deal critics were being hyperbolic. Then, once the press and public is no longer paying attention (which never takes long), the hatchets come out and the downsizing begins. When the layoffs and reduced competition inevitably arrives, they&#39;re either ignored or blamed on something else. In this case, inevitably, COVID-19.\n In a few years, the regulators who approved the deal will have moved on to think tank, legal or lobbying positions at the same companies they &#34;regulated.&#34; The same press that over-hyped pre-merger promises won&#39;t follow back up, because there&#39;s no money in that kind of hindsight policy reporting or consumer advocacy. And executives like John Legere (who just quit T-Mobile after selling his  $17.5 NYC penthouse to Giorgio Armani) are dutifully rewarded, with the real world market and human cost of mindless merger mania quickly and intentionally forgotten.", "posttime": "2020-05-06 22:51:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "合并,creating,mobile", "title": "“创造就业机会”Sprint T-Mobile合并引发约6000人非Covid裁员", "title_en": "'Job Creating' Sprint T-Mobile Merger Triggers Estimated 6k Non-Covid Layoffs", "transed": 1, "url": "https://www.techdirt.com/articles/20200505/08185044434/job-creating-sprint-t-mobile-merger-triggers-estimated-6000-non-covid-layoffs.shtml", "via": "", "real_tags": ["合并", "creating", "mobile"]}]