[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1030200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "单调的时间是这样一种东西，除非你被不使用它咬了，否则你可能不会了解它。拥有一个只会向上走的时钟的全部意义在于，这个系统与你达成了一个协议，那就是它永远不会倒退。然后，您可以使用它来测量持续时间，而不管人类可读的(墙时间)可能在做什么。\n也就是说，即使计算机管理员在计算过程中将系统时间倒退了55秒，您仍然可以可靠地计数出实际的60秒，并且仍然可以等待合适的时间。如果您使用系统时钟(挂钟时间)这样做，那么它将受到该调整的影响。\n让我们假设您是一名开发人员，这就是您。你用time()或gettimeofday()或类似的东西计算持续时间，然后闰秒把你的系统搞得一团糟，或者有人严重破坏了你的计时，你的机器向前跳了17秒，然后又向后跳了17秒。您吸取了教训并开始使用单调计时器。\n现在，让我们假设你已经转向在笔记本电脑和其他有时会进入睡眠状态的系统上做事情。您希望跟踪机器实际处于活动状态而不是绝对时间的持续时间。在这样一台机器上，您转到lock_gettime的手册页，您会发现：\nCLOCK_UPTIME_RAW：以与CLOCK_MONTOTION_RAW相同的方式单调递增的时钟，但在系统休眠时不会递增。返回值与应用适当的mach_timebase转换后的mach_Absolute_time()的结果相同。\n好啊，好啊，好啊！听起来很棒，对吧？它向上滴答作响，从不倒退，而且只在机器唤醒时滴答作响。听起来太棒了！\n你围绕着这一点建立你的东西，事情在一段时间内是好的。但是有一天，您注意到您的代码在某些情况下非常不愉快。事实上，看起来你的东西在非常紧的圈子里运行了不合理的时间。它应该在这个紧密的循环中旋转至多几毫秒，但在这里它要转几分钟，甚至几个小时！\n然后有一天，你会注意到，只有在电池电量低于50%的情况下，才会在系统深度睡眠一小时或更长时间后出现这种情况。这就是你看到它的时候：在更新版本的操作系统上，当机器重新唤醒时，计时器会重置！\n现在您知道了为什么代码会100%地占用该自旋循环中的CPU，并且会一直运行，直到机器的实际正常运行时间大约翻了一番。也就是说，如果你让它在45分钟的正常运行时间后用低电量的电池休眠，然后过一段时间唤醒它，它会像这样再旋转45分钟。\n根据我从一位读者那里得到的一份报告，这在运行Catalina的Mac上似乎非常真实，而在Mojave上却不是这样。您也可以看到在哪里向libuv和llvm报告了这一点。\n我还没有尝试在我自己的Mac电脑上复制这一点，因为这需要大量的电池消耗，然后需要很长时间的睡眠，而且我还有其他事情要处理这些盒子。根据那些错误报告，我愿意相信这是真的。", "note_en": "Monotonic time is one of those things that you probably don&#39;t learn about until you&#39;ve been bitten by not using it. The whole point of having a clock which only ever ticks upward is that the system makes an agreement with you that it will never ever go backwards. You can then use this to measure durations no matter what the human-readable (&#34;wall time&#34;) might be doing.\n That is, even if admin of a box sets the system time back 55 seconds in the middle of your calculations, you can still reliably count out 60 actual seconds and still wait the right amount of time. If you did that with the system clock (wall time), then it would be affected by that adjustment.\n Let&#39;s say you&#39;re a developer, and this is you. You were counting out durations with time() or gettimeofday() or something like that, and then a leap second made a hash of your system, or someone seriously screwed up your timekeepingand your machine jumped forward and then back 17 seconds. You learned your lesson and started using monotonic timers.\n Now let&#39;s say you&#39;ve moved on to doing stuff on laptops and other systems which go to sleep sometimes. You&#39;d like to track durations when the machine is actually alive and just not absolute time. You go to the man page for clock_gettime on such a machine, and you find this:\n CLOCK_UPTIME_RAW: clock that increments monotonically, in the same manner as CLOCK_MONOTONIC_RAW, but that does not increment while the system is asleep. The returned value is identical to the result of mach_absolute_time() after the appropriate mach_timebase conversion is applied.\n Well well well! That sounds pretty awesome, right? It ticks upward, never goes backwards, and only ticks when the machine is awake. That sounds perfect!\n You build your stuff around this, and things are okay for a while. But then one day, you notice that your code is very unhappy in certain situations. Indeed, it looks like your stuff is running in very tight circles for unreasonable amounts of time. It was supposed to spin in that tight loop for at most a few milliseconds, but here it is going for minutes, and hours, even!\n Then one day you notice that it happens after a deep system sleep of an hour or more, and only when the battery is below 50%. That&#39;s when you see it: on newer versions of the OS, that timer  resets when the machine wakes back up!\n You now know why your code would eat 100% of the CPU in that spinloop and would keep going until the machine&#39;s actual uptime had roughly doubled. That is, if you put it to sleep after 45 minutes of uptime with a low-ish battery, then woke it up some time later, it would spin like that for another 45 minutes.\n Based on a report I got from a reader, this seems to be very real on Macs running Catalina, whereas it was not a thing on Mojave. You can see where this has been reported to libuvand  llvm too.\n I haven&#39;t tried to duplicate this yet on my own Macs given that it takes a lot of battery drain and then a substantial time asleep and I have other things to do with these boxes. I&#39;m willing to believe this is real based on those bug reports.", "posttime": "2020-10-21 07:22:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时间,monotonic,系统", "title": "在Catalina上违反单调的时间期望", "title_en": "Violating monotonic time expectations on Catalina", "transed": 1, "url": "http://rachelbythebay.com/w/2020/10/20/ticktock/", "via": "", "real_tags": ["时间", "monotonic", "系统"]}, {"category": "", "categoryclass": "", "imagename": "37ecd395986ee9e77210d01214c6851f.jpg", "infoid": 1030199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何专注于将机器学习应用于现实世界问题的研究人员都可能收到这样的回应：“作者为一个原创的、极具激励作用的问题提供了一个解决方案，但它是一个应用程序，对机器学习社区的意义似乎有限。”\n这些话直接来自于我向NeurIPS(神经信息处理系统)会议提交的一篇论文的评论，NeurIPS(神经信息处理系统)会议是机器学习研究的顶级场所。我在论文评论中一次又一次地看到这种重复，我和我的合著者提出了一种基于应用程序的方法，我也从无数其他人那里听到了类似的故事。\n这让我不禁要问：如果社区觉得用机器学习来解决高影响力的现实问题意义有限，那么我们到底想要达到什么目的呢？\n人工智能(Pdf)的目标是推动机器智能的前沿。在机器学习领域，一个新的发展通常意味着一个新的算法或过程，或者-在深度学习的情况下-一个新的网络结构。正如其他人指出的那样，这种对新方法的过度关注导致了大量的论文，这些论文报告了基准数据集的边际或增量改进，并在研究人员争先恐后地登上榜首之际展示了有缺陷的学术研究(Pdf)。\n同时，许多描述新应用的论文提出了新的概念和影响很大的结果。但是，即使是“申请”这个词的暗示，似乎也会破坏评论家们的论文。因此，这类研究在大型会议上被边缘化。他们的作者唯一真正的希望是他们的论文在研讨会上被接受，而研讨会很少得到社区的同样关注。\n这是一个问题，因为机器学习在促进健康、农业、科学发现等方面大有可为。第一张黑洞图像是使用机器学习生成的。对蛋白质结构的最准确预测是使用机器学习进行的，这是药物发现的重要一步。如果该领域的其他人已经优先考虑现实世界的应用程序，那么到目前为止，我们还会有哪些其他突破性的发现呢？\n这并不是什么新发现。引用美国国家航空航天局(NASA)计算机科学家基里·瓦格斯塔夫(Kiri Wagstaf)发表的一篇名为“重要的机器学习”(Machine Learning That Matters，pdf)的经典论文的话说：“当前的许多机器学习研究已经失去了与更广泛的科学和社会世界的重要问题的联系。”就在瓦格斯塔夫发表论文的同一年，一种名为AlexNet的卷积神经网络赢得了一场以流行的ImageNet数据集为中心的高调图像识别比赛，导致了人们对深度学习的兴趣激增。不幸的是，自那以后，她所描述的脱节似乎变得更加严重。\n将应用研究边缘化会带来真正的后果。基准数据集，如ImageNet或CoCo，一直是推进机器学习的关键。它们使算法能够在相同的数据上进行训练和比较。然而，这些数据集包含可以构建到结果模型中的偏差。\n例如，ImageNet(Pdf)中超过一半的图片来自美国和英国。这种不平衡导致系统在不同地理位置(Pdf)的类别中对图像进行不准确的分类。美国电话电报公司(AT&amp；T)脸部数据库等流行的脸部数据集主要包含浅色皮肤的男性受试者，这导致系统很难识别深色皮肤和女性面孔。\n当机器学习在现实世界中的应用研究被排除在主流之外时，研究人员很难看到他们有偏见的模型的影响，这使得他们努力解决这些问题的可能性要小得多。\n应用研究被最小化的一个原因可能是机器学习中的其他人认为这项工作只是简单地应用已经存在的方法。然而，在现实中，使机器学习工具适应特定的现实世界问题需要大量的算法和工程工作。没有意识到这一点并期望工具“现成”工作的机器学习研究人员最终往往会创建无效的模型。要么他们使用不能转化为真实世界影响的指标来评估模型的性能，要么他们选择了完全错误的目标。\n例如，大多数将深度学习应用于超声心动图分析的研究都试图超越医生预测疾病的能力。但是，预测正常的心功能(Pdf)实际上会通过识别不需要他们专业知识的患者来节省心脏病学家更多的时间。加州惠特克拉夫特酒厂的德雷克·惠特克拉夫特说，许多将机器学习应用于葡萄栽培的研究旨在优化葡萄产量(Pdf)，但酿酒商“想要适当水平的糖和酸，而不仅仅是大量的大浆果”。\n应用研究对主流机器学习至关重要的另一个原因是，该领域的基准数据集与现实严重脱节。\n新的机器学习模型是根据大型的、精选的数据集来衡量的，这些数据集没有噪音，并且有定义明确的、明确标记的类别(猫、狗、鸟)。深度学习很好地解决了这些问题，因为它假设了一个基本稳定的世界(Pdf)。\n但在现实世界中，这些类别会随着时间的推移或根据地理和文化背景而不断变化。不幸的是，人们的反应并不是开发新的方法来解决现实世界数据的困难；相反，人们一直在推动应用程序研究人员创建他们自己的基准数据集。\n这些努力的目标基本上是将现实世界的问题挤入其他机器学习研究人员用来衡量性能的范例中。但是，特定于领域的数据集在表示真实世界场景方面可能不会比现有版本更好。结果可能弊大于利。那些可能从这些研究人员的工作中获得帮助的人将会对那些在最重要的时候表现不佳的技术感到幻灭。\n由于该领域被误导的优先事项，那些试图解决世界上最大挑战的人并没有从人工智能非常真实的承诺中尽可能多地受益。当研究人员试图在人为的基准上相互超越时，世界上每九个人中就有一个在挨饿。地球正在变暖，海平面正以惊人的速度上升。\n正如神经学家和人工智能思想领袖加里·马库斯曾经写道：“人工智能对社会的最大贡献…。最终可以也应该出现在自动化科学发现等领域，其中包括导致比目前可能的医学版本复杂得多的医学。但要做到这一点，我们需要确保整个领域不会首先陷入局部最低水平。“。\n要让世界从机器学习中受益，社区必须再次问自己，就像瓦格斯塔夫曾经说过的那样：“该领域的目标函数是什么？”如果答案是要在世界上产生积极的影响，我们必须改变我们对申请的思考方式。\n汉娜·科纳(Hannah Kerner)是马里兰大学学院公园分校的助理研究教授。作为NASA收获计划的一部分，她研究用于农业监测和食品安全的遥感应用的机器学习方法。", "note_en": "Any researcher who’s focused on applying machine learning to real-world problems has likely received a response like this one: “The authors present a solution for an original and highly motivating problem, but it is an application and the significance seems limited for the machine-learning community.”\n  These words are straight from a review I received for a paper I submitted to the  NeurIPS (Neural Information Processing Systems) conference, a top venue for machine-learning research. I’ve seen the refrain time and again in reviews of papers where my coauthors and I presented a method motivated by an application, and I’ve heard similar stories from countless others.\n  This makes me wonder: If the community feels that aiming to solve high-impact real-world problems with machine learning is of limited significance, then what are we trying to achieve?\n  The  goal of artificial intelligence (pdf) is to push forward the frontier of machine intelligence. In the field of machine learning, a novel development usually means a new algorithm or procedure, or—in the case of deep learning—a new network architecture. As others have pointed out, this hyperfocus on novel methods leads to a scourge of papers that report  marginal or incremental improvements on benchmark data sets and  exhibit flawed scholarship (pdf) as researchers race to top the  leaderboard.\n  Meanwhile, many papers that describe new applications present both novel concepts and high-impact results. But even a hint of the word “application” seems to spoil the paper for reviewers. As a result, such research is marginalized at major conferences. Their authors’ only real hope is to have their papers accepted in workshops, which rarely get the same attention from the community.\n  This is a problem because machine learning holds great promise for advancing health, agriculture, scientific discovery, and more. The first  image of a black hole was produced using machine learning. The most accurate  predictions of protein structures, an important step for drug discovery, are made using machine learning. If others in the field had prioritized real-world applications, what other groundbreaking discoveries would we have made by now?\n  This is not a new revelation. To quote a classic paper titled “ Machine Learning that Matters” (pdf), by NASA computer scientist  Kiri Wagstaf f: “Much of current machine learning research has lost its connection to problems of import to the larger world of science and society.” The same year that Wagstaff published her paper, a convolutional neural network called AlexNet won a high-profile competition for image recognition centered on the popular  ImageNet data set, leading to an explosion of interest in  deep learning. Unfortunately, the disconnect she described appears to have grown even worse since then.\n    Marginalizing applications research has real consequences. Benchmark data sets, such as ImageNet or  COCO, have been key to advancing machine learning. They enable algorithms to train and be compared on the same data. However, these data sets  contain biases that can get built into the resulting models.\n  More than half of the images in ImageNet (pdf) come from the US and Great Britain, for example. That imbalance leads systems to inaccurately classify images in categories that differ by  geography  (pdf). Popular face data sets, such as the  AT&amp;T Database of Faces, contain primarily light-skinned male subjects, which leads to systems that struggle to recognize  dark-skinned and female faces.\n    When studies on real-world applications of machine learning are excluded from the mainstream, it’s difficult for researchers to see the impact of their biased models, making it far less likely that they will work to solve these problems.\n  One reason applications research is minimized might be that others in machine learning think this work consists of simply applying methods that already exist. In reality, though, adapting machine-learning tools to specific real-world problems takes significant algorithmic and engineering work. Machine-learning researchers who fail to realize this and expect tools to work “off the shelf” often wind up creating ineffective models. Either they evaluate a model’s performance using metrics that don’t translate to real-world impact, or they choose the wrong target altogether.\n  For example, most studies applying deep learning to echocardiogram analysis try to surpass a physician’s ability to predict disease. But  predicting  normal  heart function (pdf) would actually save cardiologists more time by identifying patients who do not need their expertise. Many studies applying machine learning to viticulture aim to  optimize grape yields (pdf), but winemakers “want the right levels of sugar and acid, not just lots of big watery berries,” says Drake Whitcraft of  Whitcraft Winery in California.\n    Another reason applications research should matter to mainstream machine learning is that the field’s benchmark data sets are woefully out of touch with reality.\n  New machine-learning models are measured against large, curated data sets that lack noise and have well-defined, explicitly labeled categories (cat, dog, bird). Deep learning does well for these problems because it  assumes a largely stable world (pdf).\n  But in the real world, these categories are constantly changing over time or according to geographic and cultural context. Unfortunately, the response has not been to develop new methods that address the difficulties of real-world data; rather, there’s been a push for applications researchers to create their own benchmark data sets.\n  The goal of these efforts is essentially to squeeze real-world problems into the paradigm that other machine-learning researchers use to measure performance. But the domain-specific data sets are likely to be no better than existing versions at representing real-world scenarios. The results could do more harm than good. People who might have been helped by these researchers’ work will become disillusioned by technologies that  perform poorly when it matters most.\n  Because of the field’s misguided priorities, people who are trying to solve the world’s biggest challenges are not benefiting as much as they could from AI’s very real promise. While researchers try to outdo one another on contrived benchmarks, one in every nine people in the world  is starving.  Earth is warming and  sea level is rising at an alarming rate.\n  As neuroscientist and AI thought leader Gary Marcus  once wrote (pdf): “AI’s greatest contributions to society … could and should ultimately come in domains like automated scientific discovery, leading among other things towards vastly more sophisticated versions of medicine than are currently possible. But to get there we need to make sure that the field as whole doesn’t first get stuck in a local minimum.”\n  For the world to benefit from machine learning, the community must again ask itself, as Wagstaff once put it: “What is the field’s objective function?” If the answer is to have a positive impact in the world, we must change the way we think about applications.\n  Hannah Kerner  is an assistant research professor at the University of Maryland in College Park. She researches machine learning methods for remote sensing applications in agricultural monitoring and food security as part of the   NASA Harvest  program.", "posttime": "2020-10-21 07:22:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,研究,researchers,学习", "title": "太多的人工智能研究人员认为现实世界的问题无关紧要", "title_en": "Too many AI researchers think real-world problems are not relevant", "transed": 1, "url": "https://www.technologyreview.com/2020/08/18/1007196/ai-research-machine-learning-applications-problems-opinion/", "via": "", "real_tags": ["人工智能", "研究", "学习"]}, {"category": "", "categoryclass": "", "imagename": "77e67b9c577f57adddd96d1254075163.jpg", "infoid": 1030198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊的露娜流媒体服务已经到位，该公司今天提前推出了面向有限客户的服务。它从50款游戏库开始，支持Mac、PC、Fire TV，还首次支持主要的流媒体服务iOS设备-因为亚马逊有一款网络应用程序，可以绕过苹果有争议的App Store规则。露娜的起薪是每月5.99美元。\n我们花了几个小时与露娜一起直播游戏。以下是它到目前为止的样子，以及它与微软XCloud和谷歌Stadia等其他流媒体服务的比较。\n与任何云游戏服务一样，露娜面临的最大问题是性能。为了让云游戏运行良好，像亚马逊这样的公司需要快速提供压缩视频帧，以响应你的按钮按下，即使互联网带宽下降，即使你的房子不在亚马逊服务器群旁边。亚马逊建议露娜的最低连接速度为10兆位/秒，但你家的内部网络也很重要。我们在两个不同海岸、不同网速和连接类型的两个不同的Verge编辑家中，在各种设备上测试了露娜。\n到目前为止，10 Mbps似乎远远不够。我们发现，我们需要至少25 Mbps的连接才能获得可持续播放的流，显然带宽越高越好。我的同事肖恩·霍利斯特(Sean Hollister)将他的路由器限制在10 Mbps、15 Mbps和20 Mbps，但他仍然可以看到断断续续的视频。\n最好的性能(当然)来自一台带有有线以太网连接和控制器的PC，家里没有其他家庭成员播放视频。玩血迹斑斑的游戏：在那个坚实的连接上玩夜的仪式实际上与本地运行的游戏没有什么区别。(来回切换，你可以看出挥舞一把剑需要的时间哦，所以，稍微长了一点，但感觉完全可以玩。)。诚然，在一台功能强大的PC上实际使用露娜来流式播放游戏并没有什么好处。\n另一方面，Metro：Exodus是可供流媒体播放的图形最密集的游戏之一，在网络浏览器上流传输的外观和玩法显然比在功能强大的游戏PC上差得多。老实说，无论是在露娜还是在体育场，它看起来都不是很棒，但至少体育场可以跟上鼠标和键盘。露娜的老鼠非常懒。\n使用无线连接给露娜的表现带来了更多的变数。如果你有一个稳定的、强大的Wi-Fi连接，露娜工作得相当好，几乎没有延迟，流畅的高清视频，以及足够灵敏的游戏响应，甚至可以在配备双蓝牙控制器的苹果手机上享受像Sonic Mania这样的快节奏平台。\n但是，当露娜的人脉不好时，情况就会变得很糟糕。出于某种原因，当连接速度不好时，亚马逊似乎不会降低视频流的质量；它只是试图通过丢弃帧直到速度回升来打开电源。我还遇到了音频开始落后于原本流畅的游戏的问题，大概是因为连接缓慢。现在看来，露娜的表现几乎完全依赖于良好的网络。\n在我对iPhone的最初测试中，像Control这样的游戏几乎无法玩，因为我的Wi-Fi运行速度比平时慢。直到完全重新启动网络，速度才大幅提高，从而获得了更具可玩性的游戏体验。实际上，与不断变换的Wi-Fi(一直在30 Mbps到120 Mbps之间波动)相比，我在LTE上获得稳定的性能要幸运得多。\n不管他们玩得多好，这些游戏的加载速度都很快。微软XCloud目前最大的问题之一是，每款游戏实际上都是从服务器机架上的旧Xbox one S主板上流媒体播放的，许多游戏可能需要整整一分钟的时间才能加载。斯塔迪亚和露娜运行在功能强大的服务器上，没有这个问题。控制的加载速度比PS4快得多，血迹斑斑的画面弹出的速度也和我们家里的游戏PC一样快。\n露娜的表现有两个关键部分我们还没能测试出来：4K流媒体，被列为“快到了”，以及亚马逊露娜控制器，它可以直接连接亚马逊的服务器，并承诺与蓝牙控制器相比，延迟可以减少“17到30毫秒”。亚马逊今天才刚刚向提前购买的客户开放了露娜控制器的销售，10天后才会发货。\n对于露娜来说，特别值得注意的是，由于有了增强的网络应用程序，它是首批提供功能iOS选项的游戏流媒体服务之一。“安装”露娜只需要在Safari中打开它一次，然后将露娜网站保存到你的iOS主屏幕上(就像你对任何Safari网络应用程序所做的那样)，然后它就会像其他任何iOS应用程序一样运行。\n虽然亚马逊几乎肯定会遇到一些技术限制，因为无法开发出一个成熟的原生应用程序，但露娜的网络应用体验已经足够好了，如果我不知道它是一个网络应用程序，我可能不会猜到。到目前为止，它还能用--也许除了当应用程序忘记蓝牙与我们的控制器配对时，我们不得不打开和关闭蓝牙的时候。\n亚马逊推出了“露娜+”游戏频道，该频道在早期使用期间每月收费5.9美元，有50款游戏，并承诺还会推出更多游戏。以下是目前为止的全部收藏：\n有一些大的游戏，包括控制，地铁：出埃及，网格，浪涌系列，音速狂热，蒸汽世界游戏，等等。它的阵容不像微软的XCloud库(提供100多款游戏)那样令人印象深刻，但亚马逊的服务还为时过早。理论上，露娜添加游戏比添加体育场更容易：谷歌要求开发者迁移到它的linux服务器，而亚马逊使用的是windows box。\n但是，尽管它正在玩Windows游戏，但似乎还没有一种方法可以让你的电脑游戏随身携带。这是XCloud(可以与你的Xbox库同步)和NVIDIA的GeForce Now的最大好处之一，后者主要可以与Steam和Epic.\n露娜还依靠你为捆绑游戏的“渠道”付费。露娜的工作方式更像有线电视，你可以将多个频道捆绑在一起观看你想要的游戏，而不是像Netflix或更相关的XCloud那样，提供免费的价格让你访问服务上的所有内容，而不是像Netflix或更相关的XCloud那样，让你可以访问服务上的所有东西，而是让你可以捆绑成组的频道观看你想要的游戏。\n但就像有线电视一样，你必须在这些频道组内工作，至少目前是这样。在早期接入中，露娜只提供频道。例如，如果你只想玩一款育碧游戏，当育碧目录出现在服务上时，你就必须为整个育碧目录付费。\n露娜的应用程序(和网络应用程序)在这个时候是相当基本的。有一个用于恢复你已经开始的游戏的主页菜单，一个列出你在订阅中有权访问的所有游戏的库，一个用于保存你最喜欢的游戏的“播放列表”菜单，一个搜索栏和一个设置菜单。\n选择一款游戏可以暗示亚马逊未来可能会如何利用露娜，无论你在看什么游戏，都会有一份Twitch流的直播列表，但这是目前与Twitch整合的全部内容。现在，没有办法直接将露娜的游戏流式传输到Twitch，也没有办法将玩家现有的Twitch游戏库集成到露娜中。\n最后，露娜允许玩家轻松地从一台设备跳转到另一台设备，但有一个相当大的限制：比方说，如果你还在手机上活跃地运行游戏，你才能很容易地从iphone跳到PC。一旦您“退出”游戏，就没有快速恢复功能；您必须等待游戏完全重新启动。希望你在辞职前存了钱。", "note_en": "Amazon’s Luna streaming service has arrived, with the company rolling out early access to a limited set of customers today. It’s starting with a library of 50 games and support for Mac, PC, Fire TV, and, in a first for a major streaming service, iOS devices — because Amazon has a web app  that circumvents Apple’s controversial App Store rules. Luna starts at $5.99 a month.\n We’ve spent a couple of hours streaming games with Luna. Here’s what it’s like so far and how it compares to other streaming services out there like Microsoft xCloud and Google Stadia.\n    The biggest question for Luna — like any cloud gaming service — is performance. For cloud gaming to work well, companies like Amazon need to rapidly deliver compressed video frames that respond to your button presses even if internet bandwidth dips and even if your house isn’t located right next to an Amazon server farm. Amazon recommends a minimum connection speed of 10 Mbps for Luna, but your home’s internal network also matters. We tested Luna on a variety of devices in two different  Verge editors’ homes across two different coasts with a variety of internet speeds and connection types.\n So far, 10 Mbps doesn’t seem like nearly enough. We found that we needed a connection of at least 25 Mbps in order to have a consistently playable stream, with more bandwidth obviously being better. My colleague Sean Hollister limited his router to 10 Mbps, 15 Mbps, and 20 Mbps, but he’d still get stretches of choppy video.\n The best performance (of course) came from a PC with a wired Ethernet connection and controller, with no other family members streaming video in the house. Playing  Bloodstained: Ritual of the Night on that solid of a connection was virtually indistinguishable from the game running natively. (Switching back and forth, you can tell it takes oh-so-slightly longer to swing a sword, but it felt perfectly playable.) Admittedly, there are few benefits to actually using Luna to stream the game on a capable PC.\n On the other hand,  Metro: Exodus, one of the most graphically intensive games available to stream, looked and played decidedly worse streamed to a web browser than it does on a capable gaming PC. Honestly, it doesn’t look great in either Luna or Stadia, but at least Stadia could keep up with a mouse and keyboard. Luna’s mouse was extremely laggy.\n  Using wireless connections introduces a lot more variables into Luna’s performance. If you have a steady, strong Wi-Fi connection, Luna works pretty well, with little to no lag, smooth HD video, and responsive enough gameplay to enjoy even fast-paced platformers like  Sonic Mania on an iPhone with a paired Bluetooth controller.\n But when Luna has a bad connection, it’s rough. For some reason, Amazon doesn’t seem to degrade the quality of video streaming when connection speeds are bad; it just tries to power on through by dropping frames until speeds pick up. I also ran into issues where audio started to lag behind what was otherwise smooth gameplay, presumably due to a sluggish connection. Right now, it seems that Luna’s performance is almost entirely dependent on having good internet.\n   On my initial tests on my iPhone, games like  Control were virtually unplayable since my Wi-Fi was running slower than usual. It wasn’t until a full network restart that speeds jumped up and allowed for a far more playable gameplay experience. I actually had better luck getting consistent performance over LTE than with my constantly shifting Wi-Fi (which has been bouncing between 30 Mbps and 120 Mbps).\n Regardless of how well they play, these games load  fast. One of the biggest issues with Microsoft’s xCloud right now is that every game is literally streaming from an old Xbox One S motherboard in a server rack, and  many games can take a full minute to load. Stadia and Luna are running on powerful servers that don’t have that issue.  Control loaded far faster than it does on a PS4, and  Bloodstained popped up just as quickly as it does on our gaming PCs at home.\n There are two key parts to Luna’s performance that we haven’t been able to test: 4K streaming, which is listed as “coming soon,” and  the Amazon Luna Controller, which can directly connect to Amazon’s servers and promises to reduce latency “by 17 to 30 milliseconds” compared to a Bluetooth controller. Amazon only just opened sales for the Luna Controller to early access customers today, and it won’t ship for another 10 days.\n  Of particular note for Luna is the fact that it’s one of the first game streaming services to offer a functional iOS option, thanks to a souped-up web app. “Installing” Luna requires just opening it once in Safari and saving the Luna website to your iOS home screen (just like you would any Safari web app), after which it functionally behaves like any other iOS app.\n   While Amazon is almost certainly running into some technical limitations by not being able to produce a full-fledged native app, the Luna web app experience is good enough that if I didn’t already know it was a web app, I probably wouldn’t have guessed. So far, it just works — except perhaps for the times we had to toggle on and off our Bluetooth when the app forgot it was paired to our controllers.\n  Amazon is launching its Luna Plus game channel — which costs $5.99 per month during early access — with 50 games, with the promise of more to start. Here’s the whole collection so far:\n   There are some big titles there, including  Control,  Metro: Exodus,  Grid,  The Surge series,  Sonic Mania, the  SteamWorld games, and more. It’s not as impressive of a lineup as Microsoft’s xCloud library (which offers over 100 games), but it’s also still early for Amazon’s service.  It’s theoretically easier for Luna to add games than for Stadia: Google requires developers to migrate to its Linux servers, while Amazon is using Windows boxes.\n But although it’s playing Windows games, there doesn’t yet seem to be a way to bring your PC savegames along for the ride. That’s one of the  biggest benefits of xCloud (which can sync with your Xbox library) and Nvidia’s GeForce Now, which can primarily sync with Steam and Epic.\n Luna is also relying on you paying for “channels” of bundled games. Instead of an all-you-can-eat price (like Netflix or, more relevantly, xCloud) that gives you access to everything on the service,  Luna works more like cable, where you’ll be able to bundle together groups of channels to get access to the games you want.\n But like cable, you’ll have to work within those channel groups, at least for now. In early access, Luna only offers channels. So if you want to just play one Ubisoft game, for example, you’ll have to pay for the entire Ubisoft catalog when it appears on the service.\n  The Luna apps (and web apps) are pretty bare-bones at this time. There’s a home menu for resuming games that you’ve already started, a library that lists all the games you have access to in your subscription, a “playlist” menu for saving your favorite games, a search bar, and a settings menu.\n Selecting a game gives a hint at how Amazon might leverage Luna in the future, with a list of live Twitch streams of whatever game you’re looking at, but that’s the full extent of any integration with Twitch for now. Right now, there’s no way to directly stream a Luna game to Twitch, nor any option to integrate  player’s existing Twitch game libraries into Luna.\n   Lastly, Luna allows players to easily jump from one device to another but with a fairly large catch: you can only easily jump from, say, an iPhone to a PC if you’re still actively running the game on your phone. Once you’ve “quit” a game, there’s no quick-resume functionality; you’ll have to wait for the game to fully relaunch. Hopefully, you saved before you quit.", "posttime": "2020-10-21 07:06:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,游戏,亚马逊,ios,性能", "title": "亚马逊的露娜在早期接入：没有强大的连接，流媒体性能可能参差不齐，iOS网络应用支持还不错，频道组竖井游戏选择", "title_en": "Amazon's Luna in early access: streaming performance can be spotty without a strong connection, iOS web app support is decent, channel groups silo game choice", "transed": 1, "url": "https://www.theverge.com/2020/10/20/21525339/amazon-luna-hands-on-cloud-gaming-streaming-early-access-price-games?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["amazon", "游戏", "亚马逊", "ios", "性能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新一代CRISPR技术为治疗学治疗广泛的遗传性眼病奠定了基础。\n加利福尼亚州欧文-2020年10月19日-由加州大学欧文分校的研究人员领导的一项突破性研究，恢复了患有遗传性视网膜疾病的小鼠模型的视网膜和视觉功能。\n今天发表在“自然生物医学工程”杂志上的这篇题为“通过腺嘌呤碱基编辑恢复患有遗传性视网膜疾病的成年小鼠的视觉功能”的论文说明了新一代CRISPR技术的使用，并为开发一种新的治疗由不同基因突变引起的各种遗传性眼病的方法奠定了基础。\n在这项概念验证研究中，我们提供了基础编辑在纠正导致遗传性视网膜疾病的突变和恢复视觉功能方面的临床潜力的证据，UCI医学院眼科系欧文·H·利奥波德主席、博士Krzysztof Palczewski博士说。“我们的研究结果展示了迄今为止使用基因组编辑最成功的失明救治方法。”\n遗传性视网膜疾病(IRD)是一组由250多个不同基因突变引起的致盲疾病。以前，没有任何途径可以治疗这些毁灭性的致盲疾病。最近，FDA批准了第一个针对Leber先天性黑色素(LCA)的基因增强疗法，LCA是一种常见的IRD形式，起源于儿童时期。\n“作为基因增强疗法的一种替代方案，我们应用了新一代CRISPR技术，被称为‘碱基编辑’，作为遗传性视网膜疾病的治疗方法，”第一作者、UCI医学院眼科助理专家苏西·苏(Susie Suh)说。该研究的第一作者之一、UCI眼科的助理专家Elliot Choi说：“通过利用胞嘧啶和腺嘌呤碱基编辑器(CBE和ABE)，我们克服了CRISPR-Cas9系统的一些障碍，例如不可预测的非靶标突变和低编辑效率。使用这些编辑器使我们能够以精确和可预测的方式纠正点突变，同时将可能导致不良副作用的意外突变降至最低，”该研究的合著者埃利奥特·崔(Elliot Choi)也是UCI眼科的助理专家。\n利用在RPE65基因中存在临床相关致病突变的LCA小鼠模型，UCI研究小组成功地展示了碱基编辑在治疗LCA以及其他遗传性致盲疾病方面的治疗潜力。在其他结果中，基础编辑治疗将LCA小鼠的视网膜和视觉功能恢复到接近正常的水平。基址编辑是由麻省理工学院和哈佛大学的大卫·刘博士的实验室开发的。\n帕尔谢夫斯基说：“在接受治疗后，我们研究中的小鼠可以在方向、大小、对比度以及时空频率等方面辨别视觉变化，这些结果非常令人鼓舞，代表着遗传性视网膜疾病治疗方法的发展取得了重大进展。”\n鉴于眼睛的可及性、其免疫特权地位以及RPE65基因增强疗法的成功临床试验(导致了美国食品和药物管理局(FDA)批准的第一种基因疗法)，治疗遗传性视网膜疾病的基因疗法特别令人感兴趣。现在，正如这项研究证明的那样，碱基编辑技术可以提供另一种基因增强治疗的治疗模式，永久挽救因突变而丧失功能的关键视觉相关蛋白的功能。\n这项研究部分得到了下列机构的资助：美国国立卫生研究院、国家眼科研究所和NEI大胆目标倡议；斯坦因预防失明研究计划；芬兰视力、眼睛和组织库基金会(芬兰)；芬兰文化基金会、猎户座研究基金会、海伦·海伊·惠特尼基金会、美国退伍军人事务部；以及加州大学欧文分校眼科系无限制预防失明研究拨款。\nUCI医学院每年培养400多名医学生，近150名博士生和硕士研究生。超过700名住院医生和研究员在UCI医疗中心及其附属机构接受培训。医学院提供医学博士学位；医学博士/博士双重医学科学家培训计划；以及解剖学和神经生物学、生物医学科学、遗传咨询、流行病学、环境健康科学、病理学、药理学、生理学和生物物理学以及翻译科学的博士和硕士学位。医学生还可以通过三个基于使命的项目之一攻读医学博士/工商管理硕士(MD/MBA)、公共卫生医学博士/硕士学位或医学博士/硕士学位：促进综合医学领袖的健康教育(Hear-IM)、促进非洲、黑人和加勒比多样性的领导力教育(LEAD-ABC)和拉丁裔社区医学教育计划(Prime-LC)。UCI医学院获得了医学认证联络委员会的认可，并跻身于全国研究前50名之列。欲了解更多信息，请访问som.uci.edu。", "note_en": "New generation CRISPR technology lays foundation for therapeutics to treat a wide range of inherited ocular diseases\n    Irvine, CA – October 19, 2020 – A breakthrough study, led by researchers from the University of California, Irvine, results in the restoration of retinal and visual functions of mice models suffering from inherited retinal disease.\n Published today in  Nature Biomedical Engineering, the paper, titled, “ Restoration of visual function in adult mice with an inherited retinal disease via adenine base editing,” illustrates the use of a new generation CRISPR technology and lays the foundation for the development of a new therapeutic modality for a wide range of inherited ocular diseases caused by different gene mutations.\n &#34;In this proof-of-concept study, we provide evidence of the clinical potential of base editors for the correction of mutations causing inherited retinal diseases and for restoring visual function,&#34; said  Krzysztof Palczewski, PhD, the Irving H. Leopold chair and a distinguished professor in the Gavin Herbert Eye Institute, Department of Ophthalmology at the UCI School of Medicine. “Our results demonstrate the most successful rescue of blindness to date using genome editing.”\n Inherited retinal diseases (IRDs) are a group of blinding conditions caused by mutations in more than 250 different genes. Previously, there was no avenue available for treating these devastating blinding diseases. Recently, the FDA approved the first gene augmentation therapy for Leber congenital amaurosis (LCA), a common form of IRD which originates during childhood.\n “As an alternative to gene augmentation therapy, we applied a new generation of CRISPR technology, referred to as ‘base editing’ as a treatment for inherited retinal diseases,” said first author Susie Suh, assistant specialist in the UCI School of Medicine Department of Ophthalmology.   “We overcame some of the barriers to the CRISPR-Cas9 system, such as unpredictable off-target mutations and low editing efficiency, by utilizing cytosine and adenine base editors (CBE and ABE).  Use of these editors enabled us to correct point mutations in a precise and predictable manner while minimizing unintended mutations that could potentially cause undesirable side effects,” said co-first author Elliot Choi, also an assistant specialist in the UCI Department of Ophthalmology.\n Using an LCA mouse model harboring a clinically relevant pathogenic mutation in the  Rpe65 gene, the UCI team successfully demonstrated the therapeutic potential of base editing for the treatment of LCA and by extension other inherited blinding diseases. Among other results, the base editing treatment restored retinal and visual function in LCA mice to near-normal levels. Base editing was developed at the Broad Institute of MIT and Harvard in the lab of  David Liu, PhD.\n “After receiving treatment, the mice in our study could discriminate visual changes in terms of direction, size, contrast and spatial and temporal frequency,” said Palczewski.  “These results are extremely encouraging and represent a major advance towards the development of treatments for inherited retinal diseases.&#34;\n Gene therapy approaches to treating inherited retinal diseases are of special interest given the accessibility of the eye, its immune-privileged status and the successful clinical trials of  RPE65 gene augmentation therapy that led to the first US Food and Drug Administration-approved gene therapy. Now, as demonstrated in this study, base-editing technology can provide an alternative treatment model of gene augmentation therapy to permanently rescue the function of a key vision-related protein disabled by mutations.\n This research was supported in part by grants from the National Institutes of Health, National Eye Institute and NEI Audacious Goals Initiative, a Research to Prevent Blindness Stein Innovation Award, Fight for Sight, Eye and Tissue Bank Foundation (Finland), The Finnish Cultural Foundation, Orion Research Foundation, Helen Hay Whitney Foundation, US Department of Veterans Affairs, and a Research to Prevent Blindness unrestricted grant to the Department of Ophthalmology, University of California, Irvine.\n  Each year, the UCI School of Medicine educates more than 400 medical students, and nearly 150 doctoral and master’s students. More than 700 residents and fellows are trained at UCI Medical Center and affiliated institutions. The School of Medicine offers an MD; a dual MD/PhD medical scientist training program; and PhDs and master’s degrees in anatomy and neurobiology, biomedical sciences, genetic counseling, epidemiology, environmental health sciences, pathology, pharmacology, physiology and biophysics, and translational sciences. Medical students also may pursue an MD/MBA, an MD/master’s in public health, or an MD/master’s degree through one of three mission-based programs: the Health Education to Advance Leaders in Integrative Medicine (HEAL-IM), the Leadership Education to Advance Diversity-African, Black and Caribbean (LEAD-ABC), and the Program in Medical Education for the Latino Community (PRIME-LC). The UCI School of Medicine is accredited by the Liaison Committee on Medical Accreditation and ranks among the top 50 nationwide for research. For more information, visit  som.uci.edu.", "posttime": "2020-10-21 07:03:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "显示,reveals,研究", "title": "研究显示基因治疗后视网膜和视觉功能恢复", "title_en": "Study reveals restoration of retinal and visual function following gene therapy", "transed": 1, "url": "https://www.som.uci.edu/news_releases/Retinal-visual-function-restored-with-gene-therapy.asp", "via": "", "real_tags": ["显示", "reveals", "研究"]}, {"category": "", "categoryclass": "", "imagename": "06191392dbc057819c83d516b38d4207.jpg", "infoid": 1030195, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一份新闻稿，作为与WildBrain，Peanuts Worldwide和Lee Mendelson电影制作公司扩大合作伙伴关系的一部分，花生动画经典将在AppleTV+上流媒体播放，而不是在广播电视上播出。\n“了不起的南瓜”、“查理·布朗”、“查理·布朗感恩节”和“查理·布朗圣诞节”将于今年秋冬两季在流媒体平台上免费提供。\n10月30日至11月1日，彩带上将免费提供伟大的南瓜，11月25日至27日的感恩节特别节目，12月11日至13日的圣诞特别节目。\n围绕母亲节、地球日、除夕夜和开学季节的花生原创节目也将由WildBrain制作并在AppleTV+上播出。节目中将包括史努比秀和史努比在太空的第二季。\n查理·布朗的假日节目早在20世纪60年代就在哥伦比亚广播公司(CBS)首次亮相，后来在美国广播公司(ABC)播出。如果他们今年不在网络电视上播出，这将是几十年来的第一次。\n随着正在进行的小说冠状病毒(新冠肺炎)促使健康专家建议家庭今年避免不给糖就捣蛋，举办一场真正的大南瓜守望派对可能是安全进入秋季精神的绝佳机会。", "note_en": "Instead of airing on broadcast television, the Peanuts animated classics will be streaming on AppleTV+ as part of an expanded partnership with WildBrain, Peanuts Worldwide and Lee Mendelson Film Productions, according to a  press release.\n          It&#39;s the Great Pumpkin, Charlie  Brown,  A Charlie Brown Thanksgiving and  A Charlie Brown Christmas will be offered on the streaming platform for free for certain dates this fall and winter.\n  Great Pumpkin will be available for free on the streamer from October 30 to November 1, the Thanksgiving special from November 25 to 27, and the Christmas special from December 11 to 13.\n                Original Peanuts programming surrounding Mother&#39;s Day, Earth Day, New Year&#39;s Eve and back-to-school season will also be produced by WildBrain to air on AppleTV+. Included in the programming will be  The Snoopy Show and season 2 of  Snoopy in Space.\n  The Charlie Brown holiday shows made their debut back in the 1960s on CBS and later aired on ABC. If they don&#39;t air on network TV this year, it will mark the first time in decades.\n  With the ongoing  novel coronavirus (COVID-19) prompting health experts to advise families  avoid trick-or-treating this year, having a  Great Pumpkin watch party could be a great opportunity to  safely get into the autumn spirit.", "posttime": "2020-10-21 06:46:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "查理,pumpkin,节目", "title": "“这是伟大的南瓜，查理·布朗”今年不会在广播电视上播出。", "title_en": "'It's the Great Pumpkin, Charlie Brown' Won't Air On Broadcast TV This Year", "transed": 1, "url": "https://people.com/tv/its-the-great-pumpkin-charlie-brown-stream-appletv-for-free/", "via": "", "real_tags": ["查理", "pumpkin", "节目"]}, {"category": "", "categoryclass": "", "imagename": "78cdea0db2555839573f5b3db263fd67.jpeg", "infoid": 1030193, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔·拜登(Joe Biden)7月份在宾夕法尼亚州邓莫尔(Dunmore)宣布：“我们结束股东资本主义时代的时间已经过去很久了。”公司“对他们的工人、他们的社区、对他们的国家负有责任。”这呼应了去年181位首席执行官发出的美德信号，当时商业圆桌会议(Business Roundtable)重新定义了企业宗旨，从股东转向“利益相关者资本主义”：一种由工人、客户、社区、气候和国家组成的集体主义信条。为什么感觉我们的口袋要被偷了？信息很明确：利润是贪婪的，所以把财富分散开来。", "note_en": "“It’s way past time we put an end to the era of shareholder capitalism,” Joe Biden declared in Dunmore, Pa., in July. Companies “have responsibility to their workers, their community, to their country.” This echoes last year’s virtue semaphoring by 181 CEOs, when the Business Roundtable redefined corporate purpose away from shareholders and toward “stakeholder capitalism”: a collectivist creed of workers, customers, communities, climate and country. Why does it feel like we’re about to get our pockets picked? The message is clear: Profits are greedy, so spread the wealth around.", "posttime": "2020-10-21 06:42:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大众,public,股东", "title": "服务大众，追求利润", "title_en": "To Serve the Public, Seek Profits", "transed": 1, "url": "https://www.wsj.com/articles/to-serve-the-public-seek-profits-11602435735", "via": "", "real_tags": ["大众", "public", "股东"]}, {"category": "", "categoryclass": "", "imagename": "a2886c7db03f7e5e98ddf60a8289f491.png", "infoid": 1030191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我认为这本书是计算机科学中最经典、最重要的著作之一--“设计模式：面向重用对象设计的元素”(Design Patterns：Elements of Reuse Object Oriented Design)。这是不幸的，因为前一年是这本书出版25周年，一本如此古老的书能产生如此尖酸刻薄的言辞是很奇怪的。尤其是推特上的人对这本书相当粗暴-使用了像“无法穿透”这样的词，并在一个令人难忘的降级中使用了“计算机科学的地图集耸耸肩”(The Atlas Shimed Of Computer Science)。\n从某种意义上说，我对此并不感到惊讶。即使当这本书出版时，它似乎也有和支持者一样多的批评者。更重要的是，即使是在写这本书的时候，当时也有一小群热情的评论家认为，在出版之前，这本书需要完全重写。但每本书都有问题-设计模式也不能幸免于这样一个事实，即任何作品充其量只能不完美地反映作者的想法。\n然而，在我看来，最难理解的是，不管对作品的格式、风格甚至字体选择有何评论，我一直不太明白的是，为什么有人会以琐碎、无用或平庸为由拒绝其中包含的想法。但话又说回来，这就是我作为一名程序员和一名作家的经历与我在过去25年中发现的最常见的情况不同的地方。\n那么让我们从头开始吧。我首先学会了如何编程，就像我们这一代的许多人一样--我们在家用电脑上学习基本编程。对我来说，这是我在学校、在朋友家遇到的一连串的东西，最终我拥有了它们。在高中期间，我学会了用Integer和Applesoft Basic在Apple II上编程，在VIC-20上编程，在TI-99/4A上编程，在Sclair TX1000上编程。在Sclair上编程，只有4K，奇怪的Shift-键组合来创建基本的关键字，这与在Apple II相对宽敞的48K上编程的体验截然不同，苹果II的键盘触感极佳，需要你完整地键入所有命令。因此，我在Sclair上进行的低级开发比在Apple上做的要多得多，在Apple上，Applesoft Basic出色的浮点功能让我可以自由发挥自己的想象力。几乎从一开始，我就了解到你可用的环境和语言形成了你思考问题的方式。\n除此之外，我学习编程的方式在当时是相当典型的-我是通过编写程序来学习的。现在，会有一些你可以阅读的程序-特别是那些在杂志上发表的程序，你必须键入它们才能运行它们(没有互联网！)。在少数几个可以免费获得并在BBS、磁盘和磁带上流传的(早在“开源”成为一件事之前很久)，但总的来说，你学会了如何通过解决问题来解决问题。\n当我去大学攻读学位时，我发现这仍然是学习编程和计算机科学中比较棘手的部分的主要范例。例如，当我上一堂关于操作系统的课程时，我们会读到一个概念，比如信号量或文件系统，然后被期望能够实现这个概念。文本中可能有几个简单的示例来帮助您了解实现如何工作，但通常这些示例是伪代码类型，您必须在头脑中将其转换为C或C++。\n当我从大学毕业，开始从事C++和C程序员的工作时，与我在大学里学习东西的方式相比，没有什么太大的改变。每个编程问题都是从搜索相关库的文档开始的，然后坐下来规划如何从头开始编写解决方案。这正是我认为发展应该是这样的，而且永远都会是这样。\n但是，在1989年冬天，我有了一个不同寻常的机会，改变了我思考如何解决问题的方式，从而改变了我对编程的思考方式。那个机会是在我被介绍给Smalltalk的时候(特别是Digitalk的Smalltalk/V PM版本)。用Smalltalk编写程序与传统的开发方式背道而驰，我花了很长时间才完全理解它。我发现，试图学习它的人最终会陷入两个极端之一-要么它成为他们一直以来最喜欢的开发语言和环境，要么他们以近乎狂热的热情讨厌它。\n为了理解为什么这是真的，您需要了解一些事情，这些事情在当时对于Smalltalk来说是完全激进的，即使到了今天，也没有在任何其他开发语言或环境中完全复制。\n1.Smalltalk没有您放置源代码的文件。现在，从某种意义上说，这是一个谎言，因为只有一个文件包含你的源代码，但它并不是按照你想象的方式组织起来的。与每个模块或类的单个文件不同，所有早期的Smalltalk实现都有一个称为更改日志的大型滚动日志文件，其中包含您添加到系统中的新源代码。当您添加新方法或修改方法时，它会添加到更改文件的末尾。2.Smalltalk没有基于文件的编译系统-相反，您对更改文件中的任何方法或类定义所做的每一次更改都会由增量编译器立即编译，并添加到整个Smalltalk系统的单个大型内存映像中。3.SmallTalk过去(现在也是)完全是面向对象的。它是面向对象的，Java、Python或C++(或更新的语言)甚至无法与之匹敌-因为即使是整数也是对象-而且，您可以通过向其添加新方法来扩展Integer的行为！4.Smalltalk有一个很棒的概念，称为工作区，它允许您突出显示和运行任何长度的小代码片段-它只需立即编译和运行它们。人们还会在一个工作区内混合搭配文档和代码片段--这是当今Jupyter笔记本背后的基本理念。这对于仅仅尝试一些东西看看它做了什么来说是很棒的--这是在探索中学习的过程的一部分。\n但最后这一点只是冰山一角，我认为这是Smalltalk最具革命性的事情之一，它改变了我的发展方式，并影响了当时每个接触Smalltalk的人对发展的看法。冰山的其余部分是这样的-整个系统，从实现您在中开发的编辑器的代码，到像Integer和Collection类这样的基本系统库，再到Smalltalk编译器类本身，都可以在Image中(从单个基础的、不变的“源”文件)供您阅读！\n正是这个功能改变了我对开发的想法--而这种改变只是通过教我如何使用Smalltalk来实现的。我得到了两位真正的语言大师-萨姆·亚当斯(Sam Adams)和肯·奥尔(Ken Auer)的授课，这是一次美妙的经历，他们当时都在知识系统公司(Knowledge Systems Corporation)工作，这是最早的Smalltalk咨询公司之一。他们给我上的简单一课是这样的：\n不要从头开始任何新的编程任务-在开始构建任何新任务之前，请始终先查看Smalltalk映像，看看有哪些可用内容以及已经完成了哪些操作。\n对我来说，这是一个启示。它颠覆了我到目前为止所学到的关于编程的一切。但是，当我回想起我的职业生涯和生活时，我意识到这并不是什么不寻常的事情。回想一下你最初是如何学会阅读的(不管是哪种语言)。你的小学老师没想到你一掌握字母就会写小说。不，他们可能做的(我知道我做的)是先给你机会详细阅读，然后你才能写出类似的东西。当我回顾我的小学时代时，我记得我写了很多读书报告-它们实际上只是较大作品的较短摘要-但重点是，我们最终阅读的内容可能是实际写作的10倍。\n随着我进入高中和大学，我预计要写的文章、报告和其他东西的长度增加了，但同样粗略的10：1读写比大致保持不变，甚至随着我进入大学，特别是研究生(在那里，这一比例可能是50：1)，我的读写比例也在增加。\n在这一点上，我的一些Z世代和千禧一代的朋友将失去兴趣，因为他们开始喃喃地谈论婴儿潮一代，原因如下\n那只是自吹自擂。我们现在有一个叫做“互联网”的东西，特别是这个叫做“堆栈溢出”的东西。\n(我是X世代，谢谢-因此，我天生的X世代愤世嫉俗告诉我，你忘记了我们的存在，不是吗？)。但我想提出的论点是，使用Stack Overflow与我所指的不同，体验也完全不同。当您使用Stack Overflow或像Google这样的搜索引擎时，您所做的就是以您所描述的特定方式缩小解决问题的特定方式。这是因为您是按关键字搜索的-您缺少的是上下文-以及在编写解决方案的上下文中查看解决方案的能力。你还错过了一个偶然发现的思考问题的更好的方法，这可能是你开始搜索时想不到的。您还错过了在源代码中追逐兔子的纯粹乐趣，因为您试图了解代码的某一特定部分是如何工作的，这导致您找到了另一只兔子，又是另一只兔子。\n这就是我们回到这个博客的原始主题的地方，那就是“设计模式”一书。当这本书第一次出版时，我已经做了大约五年的Smalltalk程序员-事实上，在这本书正式发行之前，我第一次遇到这些模式是在这本书的一部分的复印预印本中。除了这本书的整体背景之外，它们并没有给我留下太多印象。但是，一旦这本书出版，我就带着一本书从罗利到亚特兰大的长途汽车旅行(大约6个小时)，并在路上阅读了它。这一次，它一拍即合。\n因此，让我们想想我过去几年的开发方式是如何塑造我的思维的-每当我解决编程问题时，我总是浏览Smalltalk源代码来寻找想法和灵感。这意味着我已经多次阅读了Smalltalk/V和Smalltalk-80(VisualWorks)的大部分(如果不是全部)源代码，并且在我正在工作的项目中一直在使用我从源代码中获得的东西。\n设计模式所做的就是突然为我提供了一个词汇表，涵盖了我在阅读所有源代码时已经遇到的许多(不是全部，但很多)东西。我记得在遇到观察者时想--“好吧，我不仅见过这个，而且我已经用了几百次了，因为没有它就不能在VisualWorks Smalltalk中编写GUI。”然后我遇到了Mediator-并意识到我已经在两个Smalltalk版本的GUI源代码中看到了这一点，随着我阅读的越来越多，我不断地体验到同样的似曾相识的感觉，一遍又一遍。\n我能想到的最好的比喻是，就好像我一直在读和写小说，但我没有描述我正在做的事情的词汇量-我不知道怎么称呼一个人物，一个场景，或者一个情节装置，但我在自己的作品中都使用了它们，并且在我读过的小说中遇到了它们。\n但它真正起到的作用是打开了我的思维，让我认识到这23种模式并不是我见过的所有反复出现的主题。今天，在小说中(尤其是动漫和科幻类型)，我们把这些比喻称为比喻，有很多专门针对它们的网站，比如TVTropes，在那里你可以了解到共同的主题，比如疯狂科学家的美丽女儿和邪恶的分类算法(这两个都读了--你会认出它们来的)。但这个想法要古老得多-约瑟夫·坎贝尔(Joseph Campbell)著名地宣称，有一个名为英雄之旅的单一“单一神话”可以捕捉到从“奥德赛”到“星球大战”的每个史诗故事的精髓。\n这让我回到了这个博客的原始主题。人们拿起设计模式，希望把它当作文学来读，但你不能这样做--它不是一个故事。你不应该那样读。它更像是一本关于比较文学的教科书。它最好的情况是教你一些关于编写代码的艺术，就像一本比较文学教科书教你一些关于写小说的艺术一样。它不会教你编程-这就是许多人开始应用模式的方式的问题，这导致了令人难以置信的过度使用23个模式，他们在这些模式中应用了“当你有锤子的时候，一切看起来都像钉子”反模式。\n相反，您只应将模式视为23个术语，它们可用于描述面向对象编程中最常见的特定比喻。它可以帮助你识别这些比喻，甚至给你一些提示，告诉你什么时候它们可能会有帮助-但最重要的是，它给了你一个与他人谈论这些比喻的词汇表。\n现在，还有一件事我想提出--可能是我听到人们对这些模式不屑一顾的最常见的一件事，因为“嗯，这些只是X、Y或Z中的语言特征，所以在那种语言中你不需要它们。”没有什么比真相更离谱的了。\n你看，这个特殊的比喻应用到的第一种语言是Smalltalk！当这本书出版时，Smalltalk留言板(记住-这是1996年！)。充斥着来自Smalltalk开发人员的消息，他们说，之所以需要这些模式，只是因为C++(它是当时唯一广泛使用的另一种面向对象语言)非常不足。尽管设计模式中大约一半的示例最初是用Smalltalk编写的，但这仍然是事实。\n但这就是我能帮上忙的地方。长话短说，Sherman Alpert、Bobby Woolf和我成为了Design Patterns Smalltalk Companion的合著者--这是Design Pattern的第一本官方续集。我们证明了这些想法和比喻是普遍存在的。您可以用某些语言比其他语言更简单地实现它们，但重要的是，这些思想跨越语言和环境的界限保持不变。\n这就引出了我想要说明的最后一点--如果您不理解这些模式，并且不能理解它们，那么也许要做的一件事就是--多读一些代码。如果您主要阅读过自己的代码，而没有广泛阅读过其他人的代码，那么您很有可能没有遇到任何模式，就像您从未看过或读过任何科幻小说或在线玩过MMORPG游戏一样，永远不会遇到邪恶的排序算法。但是，你看的和读的越多，你就越有可能遇到这种比喻。\n另一件要做的事情是阅读特定类型的代码-老实说-并不是所有的代码都是平等创建的。在我的工作中，我对客户端代码做了大量的代码审查，主要是用Java，其中一些特别糟糕。事实上，我发现有一个问题是地方性的。这就是代码“假定”面向对象的地方，但实际上，它没有利用面向对象的任何特性(没有继承、没有方法重写，并且很少使用类型替换(如果有的话)。特别是，我看到大量代码中存在这些静态“数据”对象(对Martin Fowler的另一种模式的误解，称为数据访问对象)和这些“处理”对象，它们在很大程度上只是对数据对象进行操作的过程。这只是名义上的面向对象，而不是实践中的面向对象。如果您遇到的唯一代码是这样的，那么我再次理解为什么您可能从未遇到过设计模式中的任何模式。我也为您感到难过，因为像这样阅读代码既痛苦又累人。不幸的是，我认为这种开发风格受到了我们用来开发它们的工具的鼓励-不幸的是，关注文件级别的编辑器永远不会鼓励您考虑文件上下文之外的内容-随着面向文件的语言和开发环境取而代之，另一个东西已经丢失了。\n尽管存在这种潜在的痛苦，但在任何情况下，阅读更多的代码都不会是一件坏事。如果您在工作中没有任何好的代码可读，那么我鼓励您转向开源项目-我们中的许多人只是使用开源代码和使用公共API，而没有深入了解内部是如何编写的-这样做将使您有机会看到有多少不同的人编写代码，并比较许多不同的开发风格。即使您没有看到设计模式中的23种模式，您也将学会识别和学习其他的用法，我保证，这些用法将改进您的编程，无论您使用哪种语言进行开发。而且，如果您想用词汇表来帮助其他人描述这些比喻，那么您可以像设计模式的作者那样做-写下比喻，以便其他人可以识别它。这就是每个人都会从中受益的方式--你从别人的经验中学习，其他人在再次遇到这个特定概念时能够采用你的词汇。\n顺便说一句，如果您想亲自尝试Smalltalk，Squeak Smalltalk提供了一个非常忠实的Smalltalk开源实现，并且可以在大多数平台上使用。", "note_en": "The last year has not been kind to a book that I believe to be one of the classic, and most important works of computer science — the book  Design Patterns: Elements of Reusable Object Oriented Design. This is unfortunate, because the preceding year had been the 25th anniversary of the book’s publication and it’s odd that a book that old can generate such vitriol. The twitterverse in particular has been pretty savage to the book — using words like “impenetrable” and in one memorable put-down “the  Atlas Shrugged of Computer Science”.\n In a sense, I’m not surprised by this. Even when the book came out, it seemed it had as many detractors as it had supporters. What’s more, even when it was being written, there was a small but impassioned contingent of reviewers at the time that argued that the book needed to be completely rewritten before it was ever published. But every book has issues — and  Design Patterns is not immune to the fact that any work is at best an imperfect reflection of the ideas of the authors.\n However, what to my mind is the most difficult part to understand is that regardless of comments on the format, style, or even font choice of the work, I’ve never quite understood is how anyone could reject the  ideas contained within it as being either trivial, useless, or banal. But then again, that’s where my experience as a programmer, and an author, differs from what I have found over the last twenty-five years to be the most common case.\n So let’s start with the beginning. I first learned how to program in the same way many people of my generation did — we learned BASIC programming on a home computer. For me, it was a succession of them that I encountered at school, at friends houses, and eventually that I owned. During my high school years I learned to program on the Apple II in Integer and Applesoft BASIC, on the VIC-20, on the TI-99/4A, and on the Sinclair TX1000. Programming on the Sinclair, with only 4K and it’s bizarre shift-key combinations to create BASIC keywords was very different experience from programming on the relatively spacious 48K that the Apple II possessed and it’s wonderfully tactile keyboard that required you to fully type out all of your commands. As a result, I did a lot more low-level development with PEEK and POKE on the Sinclair than I did on the Apple, where the wonderful floating-point capabilities of Applesoft BASIC gave me free reign for my imagination. So nearly from the beginning, I learned that your available environment and language formed the way you thought about a problem.\n Besides that, the way I learned to program was pretty typical for the time — I learned by writing programs. Now, there would be some programs that you could read — particularly those published in magazines where you had to type them in to run them (no internet!) and in the few that were available freely and circulated on BBS, disk and tape (long before “open source” became a thing), but in general, you learned how to solve problems by solving problems.\n When I went to University for my degree, I found that this was still the predominant paradigm for learning the trickier bits of programming and of computer science. For example, when I took a class on operating systems, we would read about a concept, like a semaphore, or a file system, and then be expected to be able to implement the concept. There might be a few simple examples in the text to help get you over the hump as to how the implementation would work, but more often than not these were in a type of pseudocode that you would have to mentally translate into C or C++.\n When I graduated from University and went to work as a C++ and C programmer, nothing much changed from the way I had learned things in college. Every programming problem began with searching out the documentation of the relevant libraries, then sitting down and plotting out how to write the solution from scratch. That was just the way I thought development should be, and always would be.\n But then, in the winter of 1989, I had an unusual opportunity come my way that changed the way I thought about programming by changing the way I thought about how to solve problems. That opportunity was when I was introduced to Smalltalk (particularly the Smalltalk/V PM version from Digitalk). Writing programs in Smalltalk is such a departure from traditional ways of developing that it took me a long time to fully wrap my head around it. I’ve found that people that try to learn it end up in one of two extremes — either it becomes their all-time favorite development language and environment, or they hate it with a passion bordering on mania.\n In order to understand why this is true, you need to understand some things that were, at the time completely radical about Smalltalk, and that even to this day, have not fully been replicated in any other development language or environment.\n 1. Smalltalk does not have files where you put your source code. Now, in a sense that’s a lie, because there IS a single file that contains your source code, but it’s not organized the way you think it might be. Instead of a single file for each module or class, all of the early Smalltalk implementations feature a single large, rolling log file, called the change log, that contains the new source code that you’ve added to the system. As you add a new method, or modify a method, it gets added on the end of the change file. 2. Smalltalk doesn’t have a file-based compilation system — instead, every change you make to any method or class definition in that changes file is instantly compiled by an incremental compiler and added into a single, large, in-memory image of the entire Smalltalk system.  3. Smalltalk was (and is) completely and totally Object-oriented. It was object-oriented in a way that Java, Python or C++ (or newer languages) cannot even match — in that even Integers are objects — and what’s more, you can extend the behavior of an Integer by adding new methods to it! 4. Smalltalk had this great concept called Workspaces that allowed you to highlight and run little snippets of code of any length — it would just compile and run them instantly. People would also mix and match documentation and code snippets within a Workspace — this is the basic idea behind Jupyter notebooks today. This was awesome for just trying something out to see what it did — part of a process of learning by exploration.\n But that last observation is merely the tip of the iceberg on what I think was one of the most revolutionary things about Smalltalk that changed the way I develop — and influenced the way that everyone who was exposed to Smalltalk in those days thinks about development. The remainder of that iceberg is this —  the entire system, from the code implementing the editors you developed in, to the basic system libraries like the Integer and Collection classes, up through the Smalltalk compiler classes themselves were available in that Image (from a single base, unchanging “sources” file) for you to read!\n  It was this feature that changed the way I thought about developing — and that change only came about by how I was taught to use Smalltalk. I had the wonderful experience of being taught by two of the true masters of the language — Sam Adams and Ken Auer, who at the time were both with Knowledge Systems Corporation, one of the first Smalltalk consulting companies. The simple lesson they taught me was this:\n Don’t start any new programming task from scratch — always look in the Smalltalk image first to see what’s available and what has been already done before you start building anything new.\n To me, this was a revelation. It upended everything I had ever learned to this point about programming. But as I’ve thought back over my career and my life, I realized that this really isn’t that unusual. Think back to how you first learned to read (in whatever language that was). Your elementary school teachers didn’t expect you to write a novel as soon as you mastered the alphabet. No, what they probably did (I know mine did) was to first give you the opportunity to read at length before you were expected to be able to write something comparable. As I look back to my elementary school days, I remember writing a lot of book reports — which are really just shorter summaries of larger works — but the point is, we ended up reading probably 10 times more than we actually wrote.\n As I moved into high school and college, the lengths of the essays, reports and other things I was expected to write grew, but that same rough 10–1 ratio of reading to writing remained approximately the same, or even increased as I moved on to university and especially graduate school (where the ratio may have been 50–1).\n At this point, some of my Gen Z and Millenial friends will be losing interest as they start muttering about Boomers because of the following thought\n That’s just Boomertalk. We have this thing called the “Internet” now, and especially this thing called “Stack Overflow”\n (I’m Gen X, thank you — and as such my natural Gen X cynicism informs me that you forgot we exist, didn’t you!) But the argument I want to make is that using Stack Overflow is not the same as what I’m referring to — and that the experience was quite different. When you use Stack Overflow, or a search engine like Google, what you’re doing is narrowing in on a particular way of solving a problem in the specific way you describe it. That’s because you’re searching by keyword — what you’re missing is context — and the ability to see a solution in the context in which it was written. What you’re also missing is the serendipity of coming across a better way of thinking about a problem than you may have had in mind when you began the search. You’re also missing the sheer joy of just chasing rabbits through the source code as you sought to understand how a particular section of the code worked, which led you to another rabbit, and another.\n And that is where we work our way back to the original topic of this blog, which was the book  Design Patterns. I had been a Smalltalk programmer for about five years when the book first came out — in fact, I first encountered the patterns in a xeroxed pre-print of part of the book before the book was officially released. Outside of the context of the book as a whole, they didn’t make much of an impression on me. But then, once the book was released, I took a copy with me on a long car ride from Raleigh to Atlanta (about six hours) and read it on the way. This time, it clicked.\n So let’s think about how the way I had been developing for the last several years had molded my thinking — I would always browse through the Smalltalk source code for ideas and inspiration whenever I was solving a programming problem. That means I had read through most, if not all of the Smalltalk/V and Smalltalk-80 (VisualWorks) source code several times, and had been using things I picked up from that source code in the projects I was working on.\n What  Design Patterns did was to suddenly give me a vocabulary for many (not all, but a lot) of the things that I had already encountered in reading all of that source code. I remember coming across  Observer and thinking — “OK, I’ve not only seen this, but I’ve used this a couple of hundred times because you can’t write a GUI in VisualWorks Smalltalk without it.” Then I came across  Mediator — and realized I had seen that inside the GUI source code of both Smalltalk versions, and as I read more I kept experiencing the same sense of deja vu over, and over, and over again.\n The best analogy I can think of was as if I had been reading and writing fiction, but I didn’t have the vocabulary to describe what I was doing — I didn’t know what to call a Character, or a Scene, or a Plot Device, but I had used all of them on my own work and had encountered them in fiction I had read.\n But the thing that it really did was to open my mind to the possibility that those 23 patterns weren’t all of the recurring themes that I had seen. Today, in fiction (particularly the anime and sci-fi genres) we call these Tropes, and there are entire websites devoted to them, like  TVTropes, where you can learn about common themes like  The Mad Scientist’s Beautiful Daughter and  The Sorting Algorithm of Evil (read them both — you’ll recognize them). But the idea is much older — Joseph Campbell famously declared that there is a single “monomyth” called  The Hero’s Journey that can capture the essence of every epic story from  The Odyssey through  Star Wars.\n And that wraps me back around to the original thesis of this blog. People pick up  Design Patterns and expect to read it as literature, but you can’t do that — it’s not a story. You shouldn’t read it that way. It’s more like a textbook about comparative literature. At its best it teaches you something about the art of writing code, much like a comparative literature textbook would teach you something about the art of writing fiction. It will not teach you programming — that is the problem with the way many people started applying the patterns, which resulted in unbelievable overuse of the 23 patterns where they applied the “Everything looks like a nail when you have a hammer” antipattern.\n Instead, you should just think of the patterns as 23 terms that can be useful for describing particular tropes that are most common in object-oriented programming. It can help you recognize those tropes, and even give you some indication as to when they might be helpful — but most importantly it gives you a vocabulary to talk to others about those tropes.\n Now, there is one more thing I want to bring in about this — probably the most common thing I hear people dismiss the patterns as are “well, these are just things that are language features in X, Y or Z, so you don’t need them in that language”. Nothing could be farther from the truth.\n You see, the first language that this particular trope was applied to was Smalltalk! When the book came out, the Smalltalk message boards (remember — this was 1996!) were flooded with messages from Smalltalk developers saying that these patterns were only needed because C++ (which was the only other OO language widely used at the time) was so deficient. This was despite the fact that about half of the examples in  Design Patterns were originally written in Smalltalk.\n But this is where I was able to help out. To make a long story short, Sherman Alpert, Bobby Woolf and I became co-authors of  The Design Patterns Smalltalk Companion — the very first official follow-on book to  Design Patterns. We showed that the ideas, the tropes, are universal. You can implement them more simply in some languages than others, but the fact that the ideas remain the same across the boundaries of language and environment is the important thing.\n Which brings me to the last point I want to make — if you don’t understand the patterns, and can’t make heads or tails of them, maybe one thing to do is — read more code. If you’ve primarily read your own code, and you’ve not read widely in the code of others, odds are good that you’ve not encountered any of the patterns, much like you’d never encounter  The Sorting Algorithm of Evil if you never watched or read any science fiction or played online MMORPGs. But the more you watch and read, the more likely you are to encounter that trope.\n Another thing to do is to read particular types of code — let’s be honest — not all code is created equally. In my job I do a lot of code review of client code, mostly in Java, and some of it is particularly terrible. In fact, there’s one problem I see that is endemic. That’s where the code is “supposedly” object-oriented, but in fact, it doesn’t take advantage of any of the features of object orientation (no inheritance, no method overrides, and few if any uses of type substitution). In particular I see tons of code where there are these static “data” objects (a misunderstanding of another pattern from Martin Fowler, called the  Data Access Object) and these “processing” objects that are, for the most part, just bags of procedures that operate on the data objects. This is object-orientation in name only, and not in practice. If the only code you ever encounter looks like that, then I again understand why you may never have encountered any of the patterns from  Design Patterns. I also feel terrible for you, because reading code like that is painful and wearing. Unfortunately, I think that this style of development is encouraged by the very tools we use to develop them — editors that focus on the level of a file will, unfortunately, never encourage you think about what lies beyond the context of the file — yet another thing that’s been lost as file-oriented languages and development environments took over.\n Despite that potential pain, in any case, reading more code can never be a bad thing. If you don’t have any good code to read in your work, then I encourage you to turn to open source projects — many of us simply consume open-source code and use the public API’s without ever diving down into understanding how the internals are written — doing that will give you an opportunity to see how many different people code, and to compare many different styles of development. Even if you don’t see the 23 patterns from  Design Patterns, you will learn to identify and pick up other tropes that will, I guarantee, improve your programming in whatever language you develop in. And, if you want to help others out with a vocabulary to describe those tropes, then you can do what the authors of  Design Patterns did — write the trope down so that others can identify it. That’s how everyone will benefit — you from learning from the experiences of others, and everyone else from being able to adopt your vocabulary when they re-encounter that particular concept.\n BTW, if you want to try Smalltalk yourself,   Squeak Smalltalk  provides a very faithful open-source implementation of Smalltalk and is available on most platforms.", "posttime": "2020-10-21 06:41:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,设计,艺术,smalltalk,patterns", "title": "设计模式、Smalltalk和失落的代码阅读艺术", "title_en": "Design Patterns, Smalltalk, and the Lost Art of Reading Code", "transed": 1, "url": "https://medium.com/swlh/design-patterns-smalltalk-and-the-lost-art-of-reading-code-1727d93fd7fa", "via": "", "real_tags": ["代码", "设计", "艺术", "smalltalk", "patterns"]}, {"category": "", "categoryclass": "", "imagename": "16ad9b81ab4539cdc721bf83b184470e.jpg", "infoid": 1030190, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "诉讼指控谷歌“在美国非法维持对一般搜索服务、搜索广告和一般搜索文本广告市场的垄断”。它由11个州共同签署，所有州都有共和党总检察长-德克萨斯州、阿肯色州、佛罗里达州、佐治亚州、印第安纳州、肯塔基州、路易斯安那州、密歇根州、密苏里州、蒙大拿州和南卡罗来纳州。\n谷歌称美国司法部的案件存在“严重缺陷”，并提供了一个逐个平台的论点，即它实际上并没有不公平的市场主导地位。例如，它将其在搜索中的受欢迎程度归因于一种优越的产品，而不是反竞争的做法。\n与此同时，华尔街投资者似乎并不特别担心这起诉讼。\n亚马逊推出了一个项目，为消费者的非亚马逊购物数据支付费用-亚马逊购物者小组(Amazon Shopper Panel)项目要求用户每月为在非亚马逊零售商进行的任何购买提交10张收据。\nSnap股价在超出盈利预期后暴涨-该公司公布的营收为6.79亿美元，超出了华尔街的预期。\n评论：iPhone12和iPhone12Pro，两颗宝石，一颗宝石--这两款手机都提供了坚实的价值，但有两个挑战者等待着。\nPerch筹集了1.235亿美元，以发展其稳定的在亚马逊上销售的D2C品牌-Perch收购了已经在亚马逊上销售的D2C业务和产品，然后继续运营和增长。\nGowalla正在被复兴为一款增强现实社交应用-这家初创公司曾是一款雄心勃勃的消费者社交应用，令硅谷投资者感到兴奋，但最终在与Foursquare展开竞争的过程中举步维艰。\nSynthetaic筹集了350万美元，用于用合成数据训练人工智能-它已经在与拯救大象组织合作跟踪动物数量，并与密歇根大学合作对脑瘤进行分类。\n七位投资人讨论2020年的增强现实和VR创业机会--“现在还早，但不再太早了.”\n随着初创企业在创纪录的第三季度加速，欧洲和亚洲获得了巨大的风险投资业绩-北美以外的投资刚刚经历了多年来最好的一个季度。\n现在可能是成为一名全栈开发人员的最佳时机--Talos Digital的塞尔吉奥·格拉纳达(Sergio Granada)对这个时髦的职位有想法。\n(提醒：Extra Crunch是我们的订阅会员计划，旨在使初创企业的信息大众化。您可以在这里注册。)。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "The suit  accuses Google of “unlawfully maintaining monopolies in the markets for general search services, search advertising, and general search text advertising in the United States.” It’s co-signed by 11 states, all with Republican attorneys general — Texas, Arkansas, Florida, Georgia, Indiana, Kentucky, Louisiana, Michigan, Missouri, Montana and South Carolina.\n  Google called the U.S. Department of Justice’s case  “deeply flawed” and offered a platform-by-platform argument that it doesn’t actually have unfair market dominance. For example, it attributed its popularity in search to a superior product, rather than anti-competitive practices.\n Meanwhile, Wall Street investors  don’t seem to be particularly alarmed by the suit.\n  Amazon launches a program to pay consumers for their data on non-Amazon purchases — The Amazon Shopper Panel program asks users to send in 10 receipts per month for any purchases made at non-Amazon retailers.\n Snap shares explode after blowing past earnings expectations — The company delivered $679 million in reported revenue, smashing past Wall Street expectations.\n Review: iPhone 12 and iPhone 12 Pro, two gems, one jewel — Both of these phones offer solid value, but two challengers wait in the wings.\n  Perch raises $123.5M to grow its stable of D2C brands that sell on Amazon — Perch acquires D2C businesses and products that are already selling on Amazon, then continues to operate and grow them.\n Gowalla is being resurrected as an augmented reality social app — The startup was an ambitious consumer social app that excited Silicon Valley investors but ultimately floundered in its quest to take on Foursquare.\n Synthetaic raises $3.5M to train AI with synthetic data — It’s already working with Save the Elephants to track animal populations, as well as with the University of Michigan to classify brain tumors.\n  Seven investors discuss augmented reality and VR startup opportunities in 2020 — “It’s still early, but it’s no longer too early.”\n As startups accelerate in record Q3, Europe and Asia rack up huge VC results — Investment outside North America just had its best quarter in years.\n Now may be the best time to become a full-stack developer — Talos Digital’s Sergio Granada has thoughts about this buzzy job title.\n (Reminder: Extra Crunch is our subscription membership program, which aims to democratize information about startups.  You can sign up here.)\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-10-21 06:25:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,谷歌,google,rust,crunch", "title": "\nDaily Crunch：美国司法部对谷歌提起反垄断诉讼", "title_en": "\n\t\t\t\tDaily Crunch: DOJ files antitrust suit against Google\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/daily-crunch-doj-files-antitrust-suit-against-google/", "via": "", "real_tags": ["美国", "谷歌", "google", "rust", "crunch"]}, {"category": "", "categoryclass": "", "imagename": "96fa5806f876bd73c064b87f2cc62805.jpg", "infoid": 1030189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们将向您展示一系列照片，并询问每一张照片的拍摄时间。\n我们如何看待历史在很大程度上是由我们与每个时期联系在一起的美学所定义的。当你对照片进行约会时，你可能会寻找上下文线索-人们穿着什么，是否有任何熟悉的建筑，以及你是否认出了任何面孔。你可能也在看颜色。\n受这条推文的启发，我们想测试一下颜色是否会扭曲我们对时间的感知。汉娜·比切勒(Hannah Beachler)是一名制作设计师，曾参与碧昂斯(Beyoncé)的柠檬水专辑“黑豹”(Black Panther)和“月光”(Moonlight)的制作。她发布了民权运动的彩色照片，并问道：“我们能不能停止展示整个20世纪60年代的黑白照片，这样人们就不会认为那是1000年前的事情了。”我比民权运动年轻两岁。鲁比·布里奇斯就住在离我不远的那条街上，她的照片就在Instagram上。“。\n你看到的第一张照片是彩色的，但其他人看到的是一张经过数码修改的黑白照片。黑白照片真的能让我们认为50年前发生的事情真的发生在100多年前吗？首先，我们来看一下您看到的5张照片：\n这次测验中出现的所有照片最初都是彩色拍摄的，但都是随机呈现的彩色或黑白照片。简而言之：自19世纪中期以来，彩色摄影实际上就以这样或那样的形式存在，但它很难打入主流。直到20世纪70年代，彩色摄影一直受到回避，因为它“被广告和业余爱好者使用，对于一个努力被接受为艺术的媒体来说，这是一种负担。”但是，即使在受到更广泛的欢迎之后，新闻机构也不得不迎头赶上。“密尔沃基日报”于1891年首次在页面上使用彩色，但“纽约时报”又花了近一个世纪的时间才在1993年报道称，“报纸几乎完成了彩色印刷”，超过97%的北美报纸在部分页面上采用彩色印刷。\n为了呈现黑白照片，我们使用Adobe Photoshop对每张照片进行100%去饱和度处理。然后我们以10%的密度使用“温滤器(81)”。存在于公共领域的照片可以通过知识共享获取，或者通过购买许可证来使用。照片来源于国会图书馆、美国国家航空航天局、林肯大学和盖蒂图片公司。\n虽然这个结果页面显示了你的答案与其他人对照片日期的比较，但平均值中只包括首次参加测验的人和美国境内的人的答案。我们计划在未来进行分析。", "note_en": "We’re going to show you a series of photos and ask you when each picture was taken.\n              How we view history is largely defined by the aesthetics we associate with each period. When you were dating the photos, you probably looked for  context clues — what people were wearing, if there were any familiar buildings, and if you recognized any faces. You were probably also looking at color.\n  Inspired by this  tweet, we wanted to test how color does or does not  warp our perception of time.  Hannah Beachler, a production designer who’s worked on Beyoncé’s Lemonade album, Black Panther, and Moonlight, posted color photos from the Civil Rights Movement and asked: “Can we stop showing Black and White pictures of the entire decade of the 1960s so people stop thinking it was 1000 years ago. I’m two years younger than the Civil Rights movement. And Ruby Bridges lives down the street from me and is on Instagram.”\n  You saw the first photo in  in color, but others saw a  digitally altered black and white photo. Can black and white photos really make us think that events that happened 50 years ago actually took place 100+ years ago? First, let’s look at the 5 photos you saw:\n      All photos that appear in this quiz were originally taken in color, but were randomly presented in either color or black and white. Short aside: Color photography has actually  existed in some form or another since the mid 1800s, but it had trouble breaking into the mainstream. Until the 1970s,  color photography was shunned because it was “used by advertising and amateurs, a liability for a medium struggling to be accepted as art.” But, even after being embraced more broadly, news organizations had to play catch-up. The Milwaukee Journal first used color in its pages in 1891, but it took nearly another century for  The New York Times to report in 1993 that “newspapers&#39; adoption of color nearly complete” with more than 97 percent of North American newspapers printing color on some of their pages.\n  To present the photos in black and white, we used Adobe Photoshop to desaturate each photo by 100%. We then applied “Warming Filter (81)” at 10% density. The photos exist in the  public domain were available through  creative commons, or were used with the purchase of a license. Photos were sourced from the  Library of Congress,  NASA,  Lincoln University, and  Getty Images.\n  Although this results page shows you how your answers compare to how everyone else dated the photos, only the answers of first-time quiz takers and people geolocated within the United States have been included in the averages. We plan to build out the analysis in the future.", "posttime": "2020-10-21 06:21:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "看待,view,照片", "title": "关于我们如何看待历史的一次实验", "title_en": "An Experiment about How We View History", "transed": 1, "url": "https://pudding.cool/2020/10/photo-history", "via": "", "real_tags": ["看待", "view", "照片"]}, {"category": "", "categoryclass": "", "imagename": "7ddb46ee61d1815a1e2d289720055449.png", "infoid": 1030187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我问我的同事为什么mmap比系统调用快时，他们的回答不可避免地是“系统调用开销”：跨越用户空间和内核之间边界的开销。事实证明，这种开销比我过去认为的更细微，所以让我们来看看幕后的情况，以了解性能差异。\n系统调用。系统调用是一种特殊的函数，它允许您跨越保护域。当程序在用户模式(非特权保护域)下执行时，不允许执行在内核模式(特权保护域)下执行的代码所允许的事情。例如，在用户空间中运行的程序通常在没有内核帮助的情况下无法读取文件。当用户程序从操作系统请求服务时，系统会通过系统调用保护自己不受恶意程序或错误程序的影响。系统调用执行特殊的硬件指令，通常称为“陷阱”，将控制转移到内核。然后内核可以决定是否接受该请求。\n虽然这种保护非常有用，但也是有代价的。当我们从用户空间进入内核时，我们必须保存硬件寄存器，因为内核可能需要使用它们。此外，由于直接取消引用用户级指针是不安全的(如果它们为空怎么办-这会使内核崩溃！)。必须将这些指针引用的数据复制到内核中。\n当我们从系统调用返回时，我们必须以相反的顺序重复该序列：复制出用户请求的任何数据(因为我们不能只给用户程序指向内核内存的指针)，恢复寄存器并跳转到用户模式。\n页面错误。操作系统和硬件一起将写在程序可执行文件中的地址(称为虚拟地址)转换为实际物理内存中的地址(物理地址)。编译器直接生成物理地址非常不方便，因为它不知道您可能在哪台机器上运行您的程序，它有多少内存，以及在您的程序运行时，哪些其他程序可能正在使用物理内存。因此需要这种虚拟到物理地址转换。翻译或映射设置在程序的页表中。当您的程序开始运行时，不会设置任何这些映射。因此，当您的程序试图访问虚拟地址时，它会生成一个页面错误，通知内核去设置映射。内核被通知需要通过陷阱处理页面错误，因此在这种情况下，它有点类似于系统调用。不同之处在于系统调用是显式的，而页面错误是隐式的。\n缓冲区缓存。缓冲区缓存是内核内存的一部分，用于保存最近访问的文件块(这些块称为块或页)。当用户程序请求读取文件时，(通常)首先将文件中的页面放入缓冲区缓存。然后，在从系统调用返回期间，将数据从缓冲区高速缓存复制到用户提供的缓冲区。\nMmap。Mmap代表内存映射文件。它是一种在不调用系统调用的情况下读写文件的方法。操作系统保留程序虚拟地址的块以直接“映射”到文件中的块。因此，如果程序从地址空间的该部分读取数据，它将获得驻留在文件的相应部分中的数据。如果文件的该部分恰好驻留在缓冲区高速缓存中，则在第一次访问时，映射区块的虚拟地址将简单地映射到相应缓冲区高速缓存页的物理地址，并且稍后不会调用任何系统调用或其他陷阱。如果文件数据不在缓冲区缓存中，访问映射区域将生成页面错误，提示内核从磁盘获取相应的数据。\n让我们从阐述假设开始。为什么我们期望mmap更快呢？有两个显而易见的原因。首先，它不需要显式地跨越保护域，尽管当我们有页面错误时仍然存在隐式跨越。也就是说，如果文件中的给定范围被多次访问，那么在第一次访问之后，我们很可能不会出现页面错误。然而，在我的实验中没有出现这种情况，所以我确实预料到每次读取文件的新块时都会遇到页面错误。\n其次，如果编写的应用程序可以直接访问映射区域中的数据，我们就不必执行内存复制。不过，在我的实验中，我感兴趣的是测量应用程序为其读取的数据具有单独的目标缓冲区的场景。因此，即使文件被mmmap，应用程序仍然会将数据从映射区域复制到目标缓冲区。\n因此，在我的实验环境中，我预计mmap会比系统调用稍微快一些，因为我认为处理页面错误的代码会比系统调用的代码更精简一些。\n我用下面的方式设置了我的实验。我创建了一个4 GB的文件，然后使用4KB、8KB或16KB的块大小顺序或随机读取它。我使用read系统调用或mmap读取文件。在mmap的情况下，数据从映射区域复制到单独的“目标”缓冲区。我使用冷缓冲区缓存(意味着文件不在那里缓存)或热缓冲区缓存(意味着文件在内核内存中)来运行这些测试。存储介质是您可能期望在典型服务器中找到的SSD。所有读取都使用单个线程执行。这里是我的基准测试的源代码。\n下图显示了顺序/暖、顺序/冷、随机/暖和随机/冷运行的读取基准的吞吐量。\n除了少数例外，mmap比系统调用快2-6倍。让我们分析一下热实验中发生了什么，因为mmap提供了更一致的改进。\n下图显示了在16KB块大小的顺序/暖SysCall实验期间收集的CPU配置文件。在此实验期间，CPU利用率为100%，因此CPU配置文件可以告诉我们全部情况。\n我们看到大约60%的时间花在COPY_USER_ENHANDIZED_FAST_STRING上-这是一个将数据复制到用户空间的函数。大约15%用于跨越系统调用边界的其他工作(函数do_syscall_64、entry_syscall_64和syscall_return_via_sysret)，大约6%用于在缓冲区缓存中查找数据的函数(find_get_entry和Generic_file_Buffered_read)。\n现在，让我们看一下在使用相同参数的mmap测试期间发生了什么：\n这份个人资料有很大的不同。大约60%的时间花在__memmove_avx_unaligned_erms上，还有大量时间花在设置页面映射的各种函数上。\n我们稍后将返回到__memmove_avx_unaligned_erms，但现在让我们试着计算一下映射页面所花费的确切时间。我有一个巧妙的窍门来做那件事。在Linux上，mmap系统调用可以接受MAP_PUPULATE标志。此标志的作用是强制mmap在实际系统调用期间预先填充所有页面映射，因此在测试实际运行时不会执行任何页面映射工作。因此，我将测试更改为使用MAP_PUPULATE调用mmap，并了解到实验完成速度提高了大约36%。(我只测量主循环的计时，而不测量mmap系统调用的计时)。因此，我假设在上面的配置文件中，所有这些映射函数约占36%。\n让我们总结一下到目前为止我们所掌握的内容。使用CPU配置文件，我们能够解释syscall实验大约82%的执行时间(60%用于复制，15%用于其他跨域操作，8%用于从缓冲区缓存实际读取文件)，mmap实验大约96%：60%用于用户级内存复制，大约36%用于映射页面。\n我还必须告诉您，如果我调整实验运行很长时间，一遍又一遍地在循环中访问同一个文件，mmap实验完全由内存副本控制：\n如果我运行更长时间，Syscall实验的概况基本保持不变：\n这就是事情变得非常有趣的地方。有很大一部分时间-至少60%-花费在复制数据上。但是，syscall和mmap使用的函数非常不同，不仅在名称上如此。\n__memmove_AVX_UNALIGNED_ERMS在mmap实验中称为__memmove_avx_unaligned_erms，它是使用高级矢量扩展(AVX)实现的(这里是它所依赖的函数的源代码)。另一方面，Copy_User_Enhanced_FAST_String的实现要简单得多。在我看来，这是mmap速度更快的重要原因。使用宽向量指令进行数据复制有效地利用了内存带宽，并与CPU预取相结合，使mmap变得非常快。\n为什么内核实现不能使用AVX？如果它这样做了，那么它将不得不在每次系统调用时保存和恢复这些寄存器，这将使跨域变得更加昂贵。所以在Linux内核中这是一个有意识的决定。\n同时，将应用程序转换为使用mmap而不是系统调用可以使其运行得更快。也就是说，使用mmap编程并不总是很方便，但这是另一篇…文章的主题", "note_en": "When I ask my colleagues why mmap is faster than system calls, the answer is inevitably “system call overhead”: the cost of crossing the boundary between the user space and the kernel. It turns out that this overhead is more nuanced than I used to think, so let’s look under the hood to understand the performance differences.\n  System calls. A system call is a spe cial function that lets you cross protection domains. When a program executes in user mode (an unprivileged protection domain) it is not allowed to do things that are permitted for the code executing in the kernel mode (a privileged protection domain). For example, a program running in user space typically cannot read files without help from the kernel. When a user program asks a service from an operating system, the system protects itself from malicious or buggy programs via  system calls. A system call executes a special hardware instruction, often called “trap”, that transfers control into the kernel. Then the kernel can decide whether it will honour the request.\n While this protection is super useful, it has a cost. When we cross from user space into the kernel, we have to save the hardware registers, because the kernel might need to use them. Further, since it is unsafe to directly dereference user-level pointers (what if they are null — that’ll crash the kernel!) the data referred to by these pointers must be copied into the kernel.\n When we return from the system call, we have to repeat the sequence in the reverse order: copy out any data that the user requested (because we can’t just give user programs pointers into kernel memory), restore the registers and jump to user mode.\n Page faults. The operating system and the hardware together translate the addresses that are written down in your program’s executable (these are called  virtual addresses) to the addresses in the actual physical memory ( physical addresses). It would be pretty inconvenient for the compiler to generate physical addresses directly, because it doesn’t know on what machine you might run your program, how much memory it has and what other programs might be using physical memory at the time your program runs. Hence the need for this virtual-to-physical address translation. The translations, or mappings, are set up in your program’s page table. When your program begins to run, none of these mappings are set up. So when your program tries to access a virtual address, it generates a  page fault, which signals the kernel to go set up the mapping. The kernel is notified that it needs to handle a page fault via a trap, so in this way it is a bit similar to a system call. The difference is that the system call is explicit and the page fault is implicit.\n Buffer cache. Buffer cache is a part of kernel memory that is used to keep recently accessed chunks of files (these chunks are called blocks or pages). When a user program requests to read a file, the page from the file is (usually) first put into the buffer cache. Then the data is copied from the buffer cache out to the user-supplied buffer during the return from the system call.\n Mmap. Mmap stands for  memory-mapped files. It is a way to read and write files without invoking system calls. The operating system reserves a chunk of a program virtual addresses to “map” directly to a chunk in a file. So if the program reads the data from that part of the address space, it will obtain the data that resides in the corresponding part of the file. If that part of the file happens to reside in the buffer cache, the virtual addresses of the mapped chunk will simply be mapped to the physical addresses of the corresponding buffer cache pages upon the first access, and no system calls or other traps will be invoked later on. If the file data is not in the buffer cache, accessing the mapped area will generate a page fault, prompting the kernel to go fetch the corresponding data from disk.\n  Let us begin by formulating the hypothesis. Why do we expect mmap to be faster? There are two obvious reasons. First, it requires no explicit crossing of protection domains, though there is still  implicit crossing when we have page faults. That said, if a given range in the file is accessed more than once, chances are we won’t incur page faults after the first access. That, however, did not occur in my experiments, so I did expect to hit a page fault every time I read a new block of the file.\n Second, if the application is written such that it can access the data directly in the mapped region, we don’t have to perform a memory copy. In my experiments, though, I was interested in measuring the scenario where the application has the separate target buffer for the data it reads. So even though the file is mmapped, the application will still copy the data from the mapped area into the target buffer.\n Therefore, in my experimental environment, I expected mmap to be slightly faster than system calls, because I thought the code for handling page faults would be a bit more streamlined than that for system calls.\n  I set up my experiment in the following way. I create a 4GB file and then read it either   sequentially or   randomly using a block size of   4KB,   8KB or   16KB. I read the file using either a read   system call or   mmap. In the case of mmap, the data is copied from the mapped area into a separate “destination” buffer. I run these tests using either a   cold buffer cache, meaning that the file is not cached there, or a   warm buffer cache, meaning that the file is there in kernel memory. The storage medium is an SSD that you might expect to find in a typical server. All reads are performed using a single thread. The source code of my benchmark  here.\n  The following charts show the throughput of the read benchmark for the  sequential/warm,  sequential/cold,  random/warm and  random/cold runs.\n     Barring few exceptions, mmap is  2–6 times faster than system calls. Let’s analyze what happens in the  warm experiments, since there mmap provides a more consistent improvement.\n  The following figure shows the CPU profile collected during the  sequential/warm syscall experiment with 16KB block size. During this experiment the CPU utilization is 100%, so the CPU profile tells us the whole story.\n  We see that ~60% of the time is spent in copy_user_enhanced_fast_string — a function that copies data out to user space. About 15% is spent on other work that occurs on crossing the system call boundary (functions do_syscall_64, entry_SYSCALL_64 and syscall_return_via_sysret), and about 6% in functions that find the data in the buffer cache (find_get_entry and generic_file_buffered_read).\n Now let’s look at what happens during the mmap test with the same parameters:\n  This profile is vastly different. About 60% of the time is spent in __memmove_avx_unaligned_erms, and a bunch of time in various functions that set up page mappings.\n We will come back to __memmove_avx_unaligned_erms in a moment, but for the time being let’s try to figure out exactly how much time is spent mapping pages. I have a neat trick up my sleeve to do that. On Linux, the mmap system call can accept a MAP_POPULATE flag. What this flag does is it  forces mmap to pre-populate all the page mappings during the actual system call, so none of the page-mapping work would be done when my test actually runs. So I changed my test to invoke mmap with MAP_POPULATE and learned that the experiment completes about 36% faster. (I only measure the timing of the main loop, and not that of the mmap system call). Therefore, I assume that in the above profile all those mapping functions take up about 36%.\n Let’s summarize what we have so far. Using the CPU profile we were able to explain about 82% of the execution time for the syscall experiment (60% spent on copyout, 15% on other domain crossing operations, and 8% on actually reading the file from the buffer cache), and about 96% for the mmap experiment: 60% was spent in user-level memory copy and about 36% in mapping pages.\n I also have to tell you that if I tweak the experiment to run for a very long time, accessing the same file in a loop over and over again, the mmap experiment is completely dominated by the memory copy:\n  The profile of the syscall experiment, if I run it much longer, stays largely the same:\n  Here is where things get very interesting. A huge portion of time — at least 60% — is spent in copying data. However, the functions used for syscall and mmap are very different, and not only in the name.\n __memmove_avx_unaligned_erms, called in the mmap experiment, is implemented using Advanced Vector Extensions (AVX) (here is the source code of the  functions that it relies on). The  implementation of copy_user_enhanced_fast_string, on the other hand, is much more modest. That, in my opinion, is the huge reason why mmap is faster.   Using wide vector instructions for data copying effectively utilizes the memory bandwidth, and combined with CPU pre-fetching makes mmap really really fast.\n Why can’t the kernel implementation use AVX? Well, if it did, then it would have to save and restore those registers on each system call, and that would make domain crossing even more expensive. So this was a  conscious decision in the Linux kernel.\n In the meantime, converting your application to use mmap rather than system calls could make it run faster. That said, mmap is not always convenient to program with, but that’s a subject for another post…", "posttime": "2020-10-21 06:20:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "系统,faster,mmap", "title": "为什么mmap比系统调用快(2019年)", "title_en": "Why mmap is faster than system calls (2019)", "transed": 1, "url": "https://medium.com/@sasha_f/why-mmap-is-faster-than-system-calls-24718e75ab37", "via": "", "real_tags": ["系统", "faster", "mmap"]}, {"category": "", "categoryclass": "", "imagename": "e81d3b7331b4f36f55a4e7c9914184ff.jpg", "infoid": 1030186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一项重大突破中，布里斯托尔大学(University Of Bristol)领导的一个国际科学家团队潜在地发现了是什么使SARS-CoV-2具有高度传染性并能够在人类细胞中迅速传播。今天(10月20日)发表在“科学”杂志上的这些发现描述了如何通过抑制剂来降低病毒感染人类细胞的能力，这种抑制剂可以阻断新发现的病毒与宿主之间的相互作用，从而展示了一种潜在的抗病毒治疗方法。与导致普通感冒和轻微呼吸道症状的其他病毒不同，新冠肺炎的病原体SARS-CoV-2具有高度的传染性和传播性。到目前为止，关于为什么SARS-CoV-2很容易感染呼吸系统以外的器官，如大脑和心脏，主要问题仍然没有答案。\n要感染人类，SARS-CoV-2必须首先附着在呼吸道或肠道内的人类细胞表面。一旦附着，病毒就会入侵细胞，然后复制自身的多个副本。然后，复制的病毒被释放，导致SARS-CoV-2的传播。\n病毒附着和入侵人体细胞的过程是由一种被称为“棘刺”的病毒执行的。了解这种蛋白识别人类细胞的过程对于开发治疗新冠肺炎的抗病毒疗法和疫苗至关重要。\n在这项突破性的研究中，布里斯托尔生命科学学院的研究小组，来自生物化学学院的Peter Cullen教授，细胞和分子医学学院的副教授兼病毒学家Yohei Yamuchi博士，以及Cullen实验室的高级研究员Boris Simonetti博士，使用多种方法发现SARS-CoV-2识别人类细胞表面的一种名为Neuropilin-1的蛋白质，以促进病毒感染。\nYohei，Boris和Pete解释说：在观察SARS-CoV-2刺突蛋白的序列时，我们惊讶地发现存在一个小的氨基酸序列，似乎模仿了在人类蛋白质中发现的与Neuropilin-1相互作用的蛋白质序列。这导致我们提出了一个简单的假设：SARS-CoV-2的刺突蛋白是否与Neuropilin-1相关，以帮助病毒感染人类细胞？令人兴奋的是，通过应用一系列的结构和生物化学方法，我们已经能够确定SARS-CoV-2的刺突蛋白确实与神经粘连蛋白-1结合。\n一旦我们确定了Spike蛋白与Neuropilin-1结合，我们就能够证明这种相互作用能够增强在细胞培养中生长的人类对SARS-CoV-2的侵袭。重要的是，通过使用实验室创造的类似于自然产生的抗体的蛋白质，或者使用一种选择性药物来阻断这种相互作用，我们已经能够降低SARS-CoV-2的感染能力。这凸显了我们的发现在对抗新冠肺炎的战斗中潜在的治疗价值。\n耐人寻味的是，德国慕尼黑工业大学和芬兰赫尔辛基大学的科学家独立发现，Neuropilin-1促进SARS-CoV-2细胞进入和传染性。\n布里斯托尔的研究人员共同得出结论：要击败新冠肺炎，我们将依靠有效的疫苗和大量的抗病毒疗法。我们发现了非典型肺炎冠状病毒-2尖峰与神经皮林-1的结合及其对病毒感染性的重要性，这为抑制当前新冠肺炎大流行的抗病毒治疗提供了一条以前不为人知的途径。更多信息：神经皮林-1是2020年10月20日非典型肺炎冠状病毒2感染科学的宿主因子：cience.Science encemag.org/Lookup/…。1126/Science.abd3072", "note_en": "In a major breakthrough an international team of scientists, led by the University of Bristol, has potentially identified what makes SARS-CoV-2 highly infectious and able to spread rapidly in human cells. The findings, published in  Science today [20 October] describe how the virus&#39;s ability to infect human cells can be reduced by inhibitors that block a newly discovered interaction between virus and host, demonstrating a potential anti-viral treatment.    Unlike other  , which cause common colds and mild respiratory symptoms, SARS-CoV-2, the causative agent of COVID-19, is highly infective and transmissive. Until now, major questions have remained unanswered as to why SARS-CoV-2 readily infects organs outside of the respiratory system, such as the brain and heart.\n  To infect humans, SARS-CoV-2 must first attach to the surface of human cells that line the respiratory or intestinal tracts. Once attached, the virus invades the cell then replicates multiple copies of itself. The replicated viruses are then released leading to the transmission of SARS-CoV-2.\n  The virus&#39;s process of attachment to and invasion of human cells is performed by a  , called the &#39;Spike&#39;  . Understanding the process by which the &#39;Spike&#39; protein recognises human cells is central to the development of antiviral therapies and vaccines to treat COVID-19.\n  In this breakthrough study, the research groups in Bristol&#39;s Faculty of Life Sciences, Professor Peter Cullen from the School of Biochemistry; Dr. Yohei Yamauchi, Associate Professor and virologist from the School of Cellular and Molecular Medicine, and Dr. Boris Simonetti, a senior researcher in the Cullen lab, used multiple approaches to discover that SARS-CoV-2 recognises a protein called neuropilin-1 on the surface of human cells to facilitate viral infection.\n   Yohei, Boris and Pete explained: &#34;In looking at the sequence of the SARS-CoV-2 Spike protein we were struck by the presence of a small sequence of amino acids that appeared to mimic a protein sequence found in human proteins which interact with neuropilin-1. This led us to propose a simple hypothesis: could the Spike protein of SARS-CoV-2 associate with neuropilin-1 to aid viral infection of human cells? Excitingly, in applying a range of structural and biochemical approaches we have been able to establish that the Spike protein of SARS-CoV-2 does indeed bind to neuropilin-1.\n     &#34;Once we had established that the Spike protein bound to neuropilin-1 we were able to show that the interaction serves to enhance SARS-CoV-2 invasion of human   grown in cell culture. Importantly, by using  —lab-created proteins that resemble naturally occurring antibodies—or a selective drug that blocks the interaction we have been able to reduce SARS-CoV-2&#39;s ability to infect  . This serves to highlight the potential therapeutic value of our discovery in the fight against COVID-19.&#34;\n  Intriguingly, scientists at the Technical University of Munich, Germany and the University of Helsinki, Finland, have independently found that neuropilin-1 facilitates SARS-CoV-2 cell entry and infectivity.\n  Together the Bristol researchers concluded: &#34;To defeat COVID-19 we will be relying on an effective vaccine and an arsenal of anti-viral therapeutics. Our discovery of the binding of the SARS-CoV-2 Spike to neuropilin-1 and its importance for viral infectivity provides a previously unrecognised avenue for anti-viral therapies to curb the current COVID-19 pandemic.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tNeuropilin-1 is a host factor for SARS-CoV-2 infection  Science  20 Oct 2020:  science.sciencemag.org/lookup/ … 1126/science.abd3072", "posttime": "2020-10-21 06:02:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推动,drives,sars", "title": "Neuropilin-1推动SARS-CoV-2传染性，发现突破性研究", "title_en": "Neuropilin-1 drives SARS-CoV-2 infectivity, finds breakthrough study", "transed": 1, "url": "https://medicalxpress.com/news/2020-10-neuropilin-sars-cov-infectivity-breakthrough.html", "via": "", "real_tags": ["推动", "drives", "sars"]}, {"category": "", "categoryclass": "", "imagename": "9a6b2868c3c983c2dd0157f94c3e43e4.jpg", "infoid": 1030185, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其中，对讲机是最值得注意的更新，因为它帮助HomePod赶上了竞争对手的智能扬声器，如苹果和谷歌的扬声器，这两家公司多年来一直提供类似的广播消息系统。\n但在苹果的例子中，对讲机不仅仅是发送用户的语音信息，比如“晚餐准备好了！”或者“该走了！”--通过家里的HomePod扬声器。它还打算通过增加对iPhone、iPad、Apple Watch，甚至AirPods和CarPlay的支持，在苹果的设备生态系统中工作。\n这对HomePod来说可能是一个竞争优势，特别是因为亚马逊-以其负担得起的Echo设备引领美国市场-不再拥有自己的智能手机业务。\n然而，苹果公司表示，对讲机对其他设备的扩展支持今天不会推出。取而代之的是，它将在今年晚些时候通过进一步的软件更新到达。\n除了新的对讲支持，软件更新还引入了与苹果地图和iPhone的更深层次的集成，能够设置和停止来自任何HomePod的定时器和闹钟，能够继续收听具有多用户支持的播客，等等。\n更深层次的整合意味着HomePod的所有者现在可以向Siri询问交通状况以及附近的餐馆和企业的信息。然后，Siri的建议会自动出现在你iPhone的地图上，这样你一上车就可以找到路线。\nHomePod用户现在还可以要求Siri搜索网络，然后Siri将结果发送到iPhone。\n另外两个新功能将于今年晚些时候发布，包括将一个(或更多)HomePod连接到Apple TV 4K上，用于立体声、5.1和7.1环绕声，以及Dolby Atmos，用于电影、电视、游戏等。\n另一项即将推出的功能名为“个人更新”(Personal Update)，你很快就可以向Siri询问“我的更新是什么”或“播放我的更新”，以获取开始一天所需的所有信息，包括新闻、天气、日历事件和任何提醒。", "note_en": "Of these,  Intercom   is the most notable update, as it helps the HomePod catch up to rival smart speakers, like those from Apple and Google, which have offered similar broadcast messaging systems for years.\n But in Apple’s case, Intercom doesn’t just send a user’s voice message — like  “dinner’s ready!” or  “time to go!” — across the family’s HomePod speakers. It’s also meant to work across Apple’s device ecosystem, by adding support for iPhone, iPad, Apple Watch, and even AirPods and CarPlay.\n  This could be a competitive advantage for HomePod, particularly because Amazon — which leads the U.S. market with its affordable Echo devices — no longer has its own smartphone business.\n However, Apple says Intercom’s expanded support for other devices isn’t being rolled out today. Instead, it will arrive through further software updates later this year.\n      In addition to the new support for Intercom, the software update also introduces deeper integration with Apple Maps and iPhone, the ability to set and stop timers and alarms from any HomePod, the ability to continue listening to a podcast with multiuser support, and more.\n The deeper integration means HomePod owners can now ask Siri for information about traffic conditions, as well as nearby restaurants and businesses. A Siri suggestion will then automatically appears in Maps on your iPhone so the route is available as soon as you get in the car.\n HomePod owners can also now ask Siri to search the web, which then sends results to the iPhone.\n Two other new features will arrive later this year, including the ability to connect one HomePod (or more) to Apple TV 4K for stereo, 5.1 and 7.1 surround, and Dolby Atmos for movies, TV, games and more.\n The other upcoming feature, called Personal Update, will soon let you ask Siri “what’s my update” or “play my update,” to get all the info you need to start your day, including news, weather, calendar events, and any reminders.", "posttime": "2020-10-21 05:46:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,homepod,支持", "title": "\nApple HomePod更新带来对讲机和其他新功能", "title_en": "\n\t\t\t\tApple HomePod update brings Intercom and other new features\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/apple-homepod-update-brings-intercom-and-other-new-features/", "via": "", "real_tags": ["apple", "homepod", "支持"]}, {"category": "", "categoryclass": "", "imagename": "7693524571016497931dd95b40b558a6.jpg", "infoid": 1030184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "塞尔吉奥·格拉纳达(Sergio Granada)是Talos Digital的首席技术官，Talos Digital是一个由专业软件开发人员组成的全球团队，与多个行业的机构和企业合作，为他们的技术需求提供软件开发和咨询服务。\n简单地说，就是软件的客户端(前端)和服务器端(后端)的开发。全栈开发人员是各行各业的高手，因为他们处理的是客户端与之交互的软件的设计方面，以及服务器端的编码和结构。\n在技术需求快速发展，公司可能负担不起完整的开发人员团队的情况下，同时了解前端和后端的软件开发人员是必不可少的。\n为了应对冠状病毒的流行，随着各行各业的公司将其业务迁移到虚拟世界，进行全栈开发的能力可以使工程师变得非常有市场。那些能够通过全栈方法快速开发和交付软件项目的人最有可能排在公司或客户愿望清单的首位。\n那么，你如何才能成为一名全套工程师，你的期望是什么呢？在大多数工作环境中，您不需要在每一种平台或语言上都有绝对的专业知识。但是，我们会假定您了解的知识足以理解，并且能够解决软件开发两端的问题。\n最常见的是，全栈开发人员熟悉HTML、CSS、JavaScript和后端语言，如Ruby、PHP或Python。这也符合新员工的期望，因为您会注意到，许多完整堆栈开发人员工作的空缺都需要在多个后端计划中进行专业化认证。\n全栈正在成为默认的开发方式，以至于软件工程社区中的一些人争论这个术语是否多余。随着技术的发展，前端和后端之间的界限变得模糊，开发人员现在被期望更频繁地从事软件的各个方面的工作。然而，开发人员可能会有一个专长，他们在其他领域表现出色，而在某些…方面则是新手。.那没问题.。\n然而，进入全栈意味着您应该专注于在您想要使用的特定前端和后端程序中寻找合适的位置。一种实用而常见的方法是学习JavaScript，因为它涵盖了前端和后端功能。您还需要熟悉数据库、版本控制和安全性。此外，确定设计的优先顺序是明智的，因为您将处理面向客户端的事情。\n由于全堆栈开发人员可以与开发团队的每一方进行通信，因此它们对于节省时间和避免项目中的混乱是非常宝贵的。\n反对全栈的一个常见论点是，从理论上讲，可以做所有事情的开发人员可能不会在专家级别上做一件事。但并没有硬性或速成的规则说你不能成为编程高手，也不能同时学习前端技术，反之亦然。\n在进入全套架构之前，您可能会遇到一个障碍，那就是您还在考虑成为一名DevOps工程师的选择。这两个职业当然有相似之处，包括丰厚的薪水和尽可能快而不出错地生产软件的最终目标。与全栈开发人员一样，DevOps工程师的需求也越来越大，因为他们为公司提供了灵活性。", "note_en": "Sergio Granada is the CTO of Talos Digital, a global team of professional software developers that partners with agencies and businesses in multiple industries providing software development and consulting services for their tech needs.\n   Simply put, it’s the development on the client-side (front end) and the server-side (back end) of software. Full-stack developers are jacks of all trades as they work with the design aspect of software the client interacts with as well as the coding and structuring of the server end.\n In a time when technological requirements are rapidly evolving and companies may not be able to afford a full team of developers, software developers that know both the front end and back end are essential.\n In response to the coronavirus pandemic, the ability to do full-stack development can make engineers extremely marketable as companies across all industries migrate their businesses to a virtual world. Those who can quickly develop and deliver software projects thanks to full-stack methods have the best shot to be at the top of a company’s or client’s wish list.\n  So how can you become a full-stack engineer and what are the expectations? In most working environments, you won’t be expected to have absolute expertise on every single platform or language. However, it will be presumed that you know enough to understand and can solve problems on both ends of software development.\n Most commonly, full-stack developers are familiar with HTML, CSS, JavaScript, and back-end languages like Ruby, PHP, or Python. This matches up with the expectations of new hires as well, as you’ll notice a lot of openings for full-stack developer jobs require specialization in more than one back-end program.\n Full-stack is becoming the default way to develop, so much so that some in the software engineering community argue whether or not the term is redundant. As the lines between the front end and back end blur with evolving tech, developers are now being expected to work more frequently on all aspects of the software. However, developers will likely have one specialty where they excel while being good in other areas and a novice at some things….and that’s OK.\n Getting into full-stack though means you should concentrate on finding your niche within the particular front-end and back-end programs you want to work with. One practical and common approach is to learn JavaScript since it covers both front and back end capabilities. You’ll also want to get comfortable with databases, version control, and security. In addition, it’s smart to prioritize design since you’ll be working on the client-facing side of things.\n Since full-stack developers can communicate with each side of a development team, they’re invaluable to saving time and avoiding confusion on a project.\n One common argument against full stack is that, in theory, developers who can do everything may not do one thing at an expert level. But there’s no hard or fast rule saying you can’t be a master at coding and also learn front-end techniques or vice versa.\n  One hold up you may have before diving into full-stack is you’re also mulling over the option to become a DevOps engineer. There are certainly similarities among both professions, including good salaries and the ultimate goal of producing software as quickly as possible without errors.  As with full-stack developers, DevOps engineers are also becoming more in demand because of the flexibility they offer a company.", "posttime": "2020-10-21 05:27:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "全栈,开发,可能,full,开发人员", "title": "\n现在可能是成为全栈开发人员的最佳时机", "title_en": "\n\t\t\t\tNow may be the best time to become a full-stack developer\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/now-may-be-the-best-time-to-become-a-full-stack-developer/", "via": "", "real_tags": ["全栈", "开发", "可能", "full", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "be8cd4811de1da38d5ee9bad1ea40bc7.png", "infoid": 1030183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TrickBot在最初的一次被拿下后幸存下来尝试，但是微软和它的合作伙伴正在对抗TrickBot每次搬家后接线员，删除所有新的集团基础架构..。\n美国国家安全局敦促美国公共和私营部门应用补丁或缓解措施以防止攻击。\n两个新的勒索软件家族已经上升到加入一些过去一年中最危险的几个月作为网络罪犯拧紧螺丝使攻击更加有效。..。\n新冠肺炎大流行呈现出一种企业面临重大挑战在世界各地作为看来他们分散的劳动力对…几乎不屑一顾它", "note_en": "TrickBot\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsurvived\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinitial\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttakedown\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tattempt,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpartners\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcountering\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTrickBot\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toperators\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tafter\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tevery\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmove,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttaking\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdown\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tany\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinfrastructure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgroup\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  NSA urges US public and private sector to apply patches or mitigations to prevent attacks.\n  Two\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfamilies\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\transomware\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thave\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trisen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tup\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tjoin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmost\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdangerous\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tover\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlast\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmonths\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcyber\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcriminals\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tturn\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscrew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmake\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tattacks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teffective.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCOVID-19\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpandemic\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpresents\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsignificant\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchallenge\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbusinesses\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taround\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tworld\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tseems\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttheir\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdispersed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tworkforce\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thave\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlittle\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tregard\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmobile\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tphishing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Vulnerabilities allow attackers to trick users into accessing malicious sites while showing the incorrect URL in the address bar.\n  Git project makes progress in moving the world&#39;s most popular versioning control system to a safer cryptographic hash.\n  The Darkside ransomware gang has donated $10K it received as part of ransom demands to Children International and The Water Project.", "posttime": "2020-10-21 05:26:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,发布,谷歌,google,漏洞", "title": "谷歌发布Chrome更新以部署安全修复，包括针对主动利用的零日漏洞的补丁", "title_en": "Google releases Chrome update to deploy security fixes, including a patch for an actively exploited zero-day vulnerability", "transed": 1, "url": "https://www.zdnet.com/article/google-releases-chrome-security-update-to-patch-actively-exploited-zero-day/", "via": "", "real_tags": ["chrome", "发布", "谷歌", "google", "漏洞"]}, {"category": "", "categoryclass": "", "imagename": "5b19992713440bc2c81ee073f2dee07a.jpg", "infoid": 1030182, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一年多以前，我在车库里安装了一个机架，在那里扔了一台思科交换机，一台APC UPS和我的航班跟踪设置，以及第二台ESXi主机。原件见下文：\n它经历了休斯顿冬天的寒冷和严酷的休斯顿夏天的炎热和潮湿。到目前为止，甚至没有人抱怨过它太热了，事实上风扇甚至没有在开关上一直旋转起来。\n实际上，在我在休斯顿的空调实验室里，温度从来没有超过我看到的设备使用的温度，这证明只要空气通过硬件流动，就没有问题。无设备故障、无电池故障、无固态硬盘故障、无硬盘故障、无收发器故障。\n我上周更换了UPS电池，但他们仍然报告了1小时的运行时间，并且通过了测试。我现在把这些电池用在备用的测试UPS上，它们已经用了7年了……。\n然而，这里有很多灰尘……。但这并没有影响到系统。我计划在今年晚些时候给他们大扫除。\n开关后面的胶合板上有一块不错的灰尘/污渍。我猜这意味着至少有很多灰尘最终落到了交换机外面！\n没什么好说的，因为没有什么值得注意的事情发生，一切都很好……。\n除了在我做过的电气工作期间停电外，它是24/7全天候运行的，没有任何问题。\nCisco Catalyst 2960-S PoE+10G 48端口交换机(48个1G PoE+和2个10G SFP+)通过10G的OM3光纤连接回我的主机架。\n运行ESXi 6.7的联想M73微型机(i5、16 GB DDR3、800 GB英特尔DC S3700固态硬盘、5TB 2.5和#34；SATA硬盘)。\n如果你想知道你是否可以在你的车库里运行你的实验室，那就去做吧。你得到了我的许可", "note_en": "A little over a year ago I mounted a rack in my garage, threw a Cisco Switch in there, an APC UPS and my Flight Tracking setup, and a second ESXi host. See below for the original:\n  Its been through the &#34;cold&#34; of a Houston Winter and the heat and humidity of the brutal Houston Summer. To date, nothing has even complained that its hot, in fact the fans are not even spun all the way up on the switch\n The temperatures actually never got above what I see equipment go to in my air conditioned lab in the Houston, which proves that as long air is flowing through the hardware, its fine. No equipment failures, no battery failures, no SSD failures, no HDD failures, no Transceiver failures\n I replaced the UPS batteries last week, but they still reported 1 hour of runtime, and passed the test fine. I now use those batteries in a spare test UPS, they were 7 years old...\n There is however a LOT of dust... but it has not affected the systems. I plan to give them a good clean later on this year\n     There is a nice dust/dirt stain in the plywood behind the switch. I guess that means a lot of the dust ends up out the switch at least!\n   There isn&#39;t much more to say, because nothing of note happened, it all just works fine...\n Apart from a power outage during electrical work I had done, its been running 24/7 with no problem\n   Cisco Catalyst 2960-S PoE+ 10G 48 Port Switch (48 x 1G PoE+ and 2 x 10G SFP+) connected back to my main rack with OM3 Fiber @ 10G\n  Lenovo M73 Tiny (i5, 16GB DDR3, 800GB Intel DC S3700 SSD, 5TB 2.5&#34; SATA HDD) Running ESXi 6.7\n If you are wondering if you can run your lab in your garage, go for it. You have my permission", "posttime": "2020-10-21 05:23:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "德克萨斯,texas", "title": "无条件德克萨斯车库实验室-1年后", "title_en": "Unconditioned Texas Garage Lab – 1 year later", "transed": 1, "url": "https://blog.networkprofile.org/unconditioned-garage-lab-1-year-later/", "via": "", "real_tags": ["德克萨斯", "texas"]}]