[{"category": "", "categoryclass": "", "imagename": "35d71b0c78e4c58320efd02045ee7807.png", "infoid": 1002856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几天前，Shopify在Twitter上大张旗鼓地推出了他们“有史以来最重要的产品”之一：一款面向消费者的购物应用，简称Shop。\n许多人将此解读为Shopify战略的巨大转变，以更直接地与亚马逊竞争。\n受到Shop推出的启发，我决定写一篇关于电子商务的两部分文章。第一部分--你现在正在阅读的这篇文章--着眼于网购的现状。它解释了Shopify(和亚马逊)背后的商业模式，以及Shop如何适应这一战略。\n第二部分--我将在下周发布--是对电子商务未来的展望。它描述了我认为目前购物体验中缺少的东西，以及Shopify下一步应该建立什么。\n首先，让我们先来看看Shopify和亚马逊是如何运营的-因为虽然这两家公司都是电子商务公司，但他们的战略实际上是根本不同的。\n(免责声明：这一部分本质上是本·汤普森对同一主题的出色分析的傲慢副本摘要)。\nShopify首先是一家基础设施公司。它提供了一个平台，商家可以在这个平台上建立自己的商店，与最终客户建立直接关系。这就是为什么Shopify支持的业务类型通常被称为“直接面向消费者”(D2C)。\n另一方面，亚马逊更像是一个聚合器。除了自己的供应，亚马逊还允许任何商家在Amazon.com网站上销售他们的产品。但拥有客户关系的总是亚马逊，而不是商家。供应方变得商品化。\n不只是这两家公司的战略不同-他们还服务于两种完全不同类型的购物行为。\n任何互联网服务都可以根据两种类型的用户动作大致分类：拉和推。\n谷歌是拉服务的完美例子。用户正在积极地寻找特定的信息或特定问题的答案(例如，“如何制作煎饼？”或者“考拉是熊吗？”)。谷歌的搜索引擎可以让你提取这些信息。\n另一方面，Facebook是一种典型的推送服务。用户行为要被动得多，因为您不必主动询问信息。相反，Facebook会自动将最相关的内容推送到您的新闻提要中。\n亚马逊本质上是电商领域的谷歌。它主要是一个搜索引擎，当你已经有了你想买的东西的想法时，它的效果最好。不过，亚马逊在发现方面并不出色。它不会向你展示你甚至不知道你感兴趣的东西。\n这个问题有点难，因为没有一个明确的答案。我们看到Instagram和Pinterest等社交网络慢慢演变为产品发现渠道，而不是一个专门的产品发现平台。事实上，它们不是纯粹的电子商务应用，而是在有机内容之间插入产品，这可能正是它们表现如此出色的原因。\n在Instagram上运行得特别好的产品类型都是视觉上有吸引力的东西。你在Instagram上看不到HDMI电缆或挡风玻璃手机支架的广告-这些都是典型的亚马逊产品。\n相反，在Instagram上表现良好的是珠宝、化妆品、时尚或家居配饰等产品-这些都是经典的Shopify D2C品牌。\nShopify正在为“电商Facebook”的基础设施提供动力，但它并不拥有或控制整个渠道。这是有风险的。\n虽然Instagram的一些流量可能是有机的，但最重要的客户群体来自基于拍卖的广告(由于Instagram的无链接政策)。这意味着，随着竞争的加剧(一旦某一特定细分市场的D2C品牌取得了一定的成功，就会出现这种情况，因为没有任何真正的进入壁垒)，广告价格就会上涨。\n因此，Shopify的许多商家并不是真正直接面向消费者的品牌，他们更像是direct-to-consumer-but-with-Instagram-in-the-middle-eating-all-of-their-margin品牌。\nInstagram捕捉到了大部分价值，这是一个完美的例子，说明了为什么需求聚合总是比供应聚合更强大。过度依赖像Instagram这样强大的看门人对Shopify及其商家来说是一种风险。\n首先要注意的是，Instagram并不是推动Shopify商店流量的唯一产品发现渠道。如前所述，“电商脸书”这一角色并没有一位领跑者参与角逐。Pinterest、YouTube和Twitter也是产品发现引擎(以及其他许多试图做到这一点的服务)。\n因此，Shopify的选择之一是使其商家可以使用的用户获取渠道组合多样化。这就是为什么我觉得过去几周Shopify的Pinterest和Google Shopping的合作声明比Shop的发布有趣得多。\nShop被吹捧为Shopify自己的产品发现渠道-这将是解决其目前对其他平台依赖的另一种方式。Shopify可以简单地开始聚合需求方本身，变得更像亚马逊那样的市场，而不是依赖Instagram流量。\n但是如果你安装并打开Shop，你会注意到这个应用程序并不是这样做的。Shop将您与您过去购买过的商家联系起来，而不是带有产品推荐的Feed。\n保护Shopify商家免受不断增加的客户获取成本(阅读Instagram广告)的另一个选择是同时增加客户终身价值。这正是Shop应该做的事情。\n通过将您与您以前购买的商家联系起来，Shop将向您推荐您可能感兴趣的来自相同卖家的其他产品。其结果是更高的购买后忠诚度，从而更高的LTV，这使得通过Instagram更容易证明高昂的初始收购成本是合理的。\n话虽如此，不难想象，未来Shopify也会开始推荐其他商家的产品。这到底应该是什么样子，这是这篇文章的第二部分的主题，我将在下周发表这篇文章。敬请关注。\n你对这篇文章有什么反馈或想法吗？如果是这样的话，我很想听听！", "note_en": "With much fanfare and many hot takes on Twitter, Shopify launched one of their  “most significant products ever” a few days ago:  a consumer-facing shopping app, simply called  Shop.\n Many have been interpreting this as a massive shift in Shopify’s strategy to compete more directly with Amazon.\n  Inspired by the launch of Shop, I decided to write a two-part essay on ecommerce. The first part – the article you’re reading right now – looks at the current state of online shopping. It explains the business model behind Shopify (and Amazon) and how Shop fits into that strategy.\n The second part – which I’ll release next week – is an outlook on the future of ecommerce. It describes what I believe is currently missing in the shopping experience and what Shopify should build next.\n   To start things off, let’s first take a look at how Shopify and Amazon operate – because while both of them are ecommerce companies, their strategies are actually fundamentally different.\n (Disclaimer: This section is essentially a   brash copy summary of  Ben Thompson’s excellent analysis on the same topic)\n Shopify is first and foremost an infrastructure company. It provides a platform on which merchants can build their own stores to have a  direct relationship with their end customers. This is why the type of business Shopify enables is often referred to as “direct to consumer” (D2C).\n  Amazon, on the other hand, is more of an aggregator. Alongside its own supply, Amazon lets any merchant sell their products on the Amazon.com website. But it is always Amazon which owns the customer relationship – never the merchant. The supply side becomes commoditized.\n  It’s not just the two companies’ strategies that are different – they also serve two completely different types of shopping behavior.\n  Any internet service can broadly be categorized based on two types of user actions:  Pull and push.\n Google is the perfect example of a Pull service. Users are actively looking for a particular piece of information or an answer to a specific question  (e.g. “ how to make pancakes?” or “ are koalas bears?“). Google’s search engine lets you  pull that information.\n Facebook, on the other hand, is a typical Push service. The user behavior is a lot more passive since you don’t have to actively ask for information. Instead, Facebook automatically  pushes the most relevant content into your newsfeed.\n Amazon is essentially the Google of ecommerce. It’s primarily a search engine and works best when you already have an idea of what you want to buy. Amazon is not great at discovery though. It doesn’t show you things you didn’t even know you were interested in.\n  That question is a little more difficult because there’s not one clear answer. Instead of one dedicated platform for product discovery, we have seen social networks like Instagram and Pinterest slowly morph into product discovery channels. And the fact that they are not pure ecommerce apps, but insert products between organic content, is probably exactly why they perform so well.\n The types of products that work particularly well on Instagram are things that are visually appealing. You don’t see ads for HDMI cables or windshield phone mounts on Instagram – those are typical Amazon products.\n Instead, it’s products like jewelry, cosmetics, fashion or home accessories that do well on Instagram – and those are classic Shopify D2C brands.\n Shopify is powering the infrastructure of the “Facebook for ecommerce”, but it doesn’t own or control the entire channel. And that’s a risk.\n    While some of that Instagram traffic might be organic, the most significant chunk of customers is coming from auction-based ads (due to Instagram’s no-link-policy). This means that as competition increases  (and it always does once one D2C brand in a particular segment sees some success, because there aren’t any real barriers to entry), ad prices go up.\n As a result, many of Shopify’s merchants aren’t really direct-to-consumer brands, they are more like direct-to-consumer-but-with-Instagram-in-the-middle-eating-all-of-their-margin brands.\n Instagram capturing most of the value is a perfect example of  why demand aggregation is always more powerful than supply aggregation. Too much reliance on a powerful gatekeeper like Instagram is a risk for Shopify and its merchants.\n   The first thing to note is that Instagram isn’t the only product discovery channel driving traffic to Shopify stores. As mentioned earlier, there is not one leading contestant for the role of “Facebook for Ecommerce”. Pinterest, YouTube and Twitter are also product discovery engines (among many other services trying to do the same).\n One of Shopify’s options is therefore to diversify the portfolio of user acquisition channels its merchants can use. This is why I find Shopify’s  Pinterest and  Google Shopping partnership announcements from the last few weeks way more interesting than the launch of Shop.\n Shop has been touted as Shopify’s own product discovery channel – which would be another way to tackle its current dependence on other platforms. Instead of relying on Instagram traffic, Shopify could simply start aggregating the demand side itself and become more of a marketplace like Amazon.\n But if you install and open Shop, you’ll notice that that’s not really what the app does. Instead of a feed with product recommendations, Shop connects you with merchants you have purchased from in the past.\n   Another option to defend Shopify merchants against ever increasing customer acquisition costs (read Instagram ads) is to simultaneously increase customer lifetime value. This is exactly what Shop is supposed to do.\n By connecting you with merchants you have bought from before, Shop will recommend you  additional products that you might be interested in from the same sellers. The result is higher post-purchase loyalty and thus higher LTV which makes it easier to justify high initial acquisition costs via Instagram.\n That being said, it’s not difficult to imagine a future where Shopify also starts recommending products from other merchants. What exactly this should look like is the topic of part two of this essay, which I’ll publish next week. Stay tuned.\n  Do you have feedback or thoughts on this post? If so,  I’d love to hear them!", "posttime": "2020-05-20 03:36:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思考,ecommerce,shopify", "title": "关于电子商务的思考：现状", "title_en": "Thoughts on Ecommerce: The Status Quo", "transed": 1, "url": "https://julian.digital/2020/05/17/thoughts-on-ecommerce-the-status-quo-shopify-shop-amazon/", "via": "", "real_tags": ["思考", "ecommerce", "shopify"]}, {"category": "", "categoryclass": "", "imagename": "714ce6567c4845d4f2edc1bf7892cc5f.jpg", "infoid": 1002854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "https://spoti.fi/JoeRogan", "note_en": "https://spoti.fi/JoeRogan", "posttime": "2020-05-20 03:35:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "播客,体验,rogan,https", "title": "乔·罗根体验播客将转向Spotify", "title_en": "The Joe Rogan Experience Podcast Is Moving to Spotify", "transed": 1, "url": "https://youtu.be/X8bVqI2j8o4", "via": "", "real_tags": ["播客", "体验", "rogan", "https"]}, {"category": "", "categoryclass": "", "imagename": "2be1fa220d0e1f49155961475dbad32b.jpg", "infoid": 1002853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几天里，在第一个Deno版本之后，出现了一场关于Node.js的新讨论。在社交媒体和技术论坛上，许多开发者现在都在谈论Node.js的命运。甚至有人猜测Node.js很快就会消亡。或者最终会的。虽然我不是预言家，但我有一些见解要与大家分享。我特别想回答“Node.js会死吗”这个问题。我介绍了目前对Node.js死亡的恐慌是如何无关紧要的，尽管有支持它的证据。\n每当一种语言或技术诞生时，许多人立即开始谈论它的消亡。你不相信我吗？只需打开Google并键入。\n从字面上讲，对于任何技术，你都可以找到一堆文章，其中许多毫无疑问都是垃圾。即使是库伯内斯这样的新技术也是如此。js也不例外。但引发“Node.js死亡”话题的是Deno的首次发布。\n如果您不知道Deno是什么，只需阅读下一节即可对其有所了解。这有助于你理解当前恐慌的气氛。\nDeno是由Node.js创建者Ryan Dahl编写的Javascript运行时。这个名字是单词“Node”🙂的自然类型。\n该项目由Dahl于2018年在他的演讲“我对Node.js的十件遗憾”中宣布。Deno是用Rust编写的，与用C/C++编写的Node.js形成对比。\n在撰写本文时，Deno有一个压缩大小约为15MB的执行文件。\n此外，它没有像NPM一样的或单独的外部包管理器。它是内置的。\nDeno以沙盒模式运行(表示不能直接访问文件、网络和其他IO)，因此应该显式授予任何权限。\n突然开始认为Node.js正在消亡的主要原因是因为Deno的1.0版本于2020年5月13日发布。尽管这个项目已经有两年多的历史了，但是这个版本还是在社交媒体上引起了Node开发者的恐慌。\n不用说，Deno和Node.js之间有很多不同之处。而且Deno不一定是Node.js的替代品(到目前为止)，但许多人无论如何都惊慌失措。我对恐惧的原因进行了分类，并分别对每种原因进行了分析。\n造成这种情况的一个主要原因是因为这两款产品的创作者都是一样的。很多人认为瑞安·达尔不会花时间在诺德身上。因此，Node.js正在消亡。\n虽然这是一个合理的假设，但它从根本上说是错误的。js有一个巨大的社区，这个社区比许多其他社区要大得多。因此，它不是一个人的项目。\n在相反的论点上，一些人将Dahl的存在比作Node.js，将Linus Torvalds的存在比作Linux。我告诉你，这根本不是一个正确的比较。\n首先，Dahl自2012年以来就没有参与过Node.js。但在过去的30年里，托瓦尔兹一直在以这样或那样的形式致力于Linux的研究。\n其次，不能保证即使Torvalds离开内核社区，Linux也会消亡。此外，不要将2018年9月Linux社区的混乱与托瓦尔兹事件相提并论。2018年的混乱是一个黑暗而可怕的事件，其中一部分是关于托瓦尔兹的言论。\n最后，托瓦尔兹也创建了Git，但没有对其进行维护。他刚刚完全交出了。吉特死了吗？\njs社区被誉为无人维护的库的坟墓。无意冒犯，每天诞生或死亡的图书馆数量超过了任何人的细胞数量。\n每隔一天就会创建一个新的框架，它有时会成为社区的事实，然后突然之间，它就不需要维护了。通过快速搜索，你可以在GitHub中找到几十个没有人维护的星星。\n有人可能会说，如果这是社区的现状，是什么让我们认为同样的事情不会发生在Node.js身上呢？\n答案是这要视情况而定。这取决于社区和企业的支持。不一定要通过货币资助，但更多的贡献和支持是明智的。如果广泛使用Node.js的公司雇佣一些人积极为项目做出贡献，那么Node.js的死亡几乎是不可能的。让我给你举个例子。爪哇已经存在了25年了。除了在几乎所有设备上大量使用之外，Java长寿的原因之一是企业的支持。不仅甲骨文公司支持，亚马逊、IBM和许多其他公司也支持。\n但我们不要忘记，许多使用Node.js的公司大多是生命周期短、预算紧张的初创公司。我们不能说明那些公司的贡献。它需要一家像Facebook或谷歌这样的大而富有的公司。\n如果社区分道扬镳和/或大公司不支持Node，这是一个合理的担忧，可能会使Node走下坡路。\n当然了。那是真的。通过构建Node.js获得了丰富的经验和知识。所以如果德诺更好也就不足为奇了。但是，一项技术不仅仅是根据它的能力来评估的。这只是其中一个因素。使用和支持是更重要的角色。而德诺并不完全在那里，因为它还很年轻。所以node.js不会立即死亡。\n但我们还是做最坏的打算吧。然后会发生什么呢？阅读该😀的下一节。\n在我的研究中，我发现有些人讨论Node.js的死亡就像一个人刚刚去世一样。嗯，一种语言或技术的消亡并不等同于一个过关的人。这不是一天之内发生的。\n技术的改变通常需要数年时间，因为公司不可能在一夜之间或一个月内更换他们的产品，然后再切换到新的产品。节点在这里也不例外。js库不能与Deno一起工作，构建它需要时间。此外，不要忘记专业知识的可用性。目前，没有多少人熟悉德诺来打造生产规模的产品。所有这一切至少需要几年时间。\n即使Node比预期更早死亡，它也会有就业市场。当然不同于COBOL。但至少在接下来的5年里，它会有工作机会。这应该会为节点开发人员提供足够的缓冲区来进行切换。另外，因为Deno和Node都与JS世界相关，所以从一个切换到另一个不会很乏味。\nNode.js至少在未来五年内不会消亡，目前社交媒体上关于其消亡的争论是毫无意义的。虽然有一些关于其衰落的猜测，但到目前为止还没有一个是确定的。即使假设对Node.js不利，而对Deno有利，公司仍然需要时间切换到新技术，并且需要构建库。如果你很担心甚至好奇，我强烈建议你开始玩弄迪诺。\n最后，我想澄清一下，我对德诺没有意见。这是一个很有前途的好项目。我写这篇文章的目的不是贬低Node.js开发人员的压力，而是减轻他们的压力。", "note_en": "In the last couple of days, a new discussion about Node.js has surfaced after the first Deno release. In social media and technical forums, many developers are now talking about the destiny of the Node.js. And even some speculating that Node.js is going to die soon. Or eventually will. While I am not a foreteller, I have some insights to share with you. I particularly try to answer the “Is Node.js dying” question. I cover how the current panic over the death of Node.js is irrelevant even though there is supporting evidence for it.\n  Whenever a language or technology is born, many immediately start to talk about its death. You don’t believe me? Just open Google and type\n  Literally, for any technology, you can find a bunch of articles that unarguably many are trash. Even for new technologies such as Kubernetes. Node.js is not an exception, either. But what heated the “Node.js death” topic is the first release of Deno.\n If you don’t know what Deno is, just read the next section to have an idea about it. That helps you understand the atmosphere over the current panic.\n  Deno is a Javascript runtime written by the Node.js creator,  Ryan Dahl. The name is the natural sort of the word “Node” 🙂\n The project was announced by Dahl in 2018 during his talk “10 Things I Regret About Node.js”. The Deno is written in Rust, by the contrast of Node.js that is written in C/C++.\n Deno has a single execution file with the zipped size of ~15 MB, at the time writing this article.\n  Additionally, it does not have an NPM like or a separate external package manager. It’s built-in.\n Deno runs in a sandbox mode (means no direct access to file, network, and other IOs), so any permission should be explicitly given.\n   The main reason that suddenly start to think that Node.js is dying because version 1.0 of Deno released on 13th May 2020. Even though the project is been around for over two years, this release caused panic for Node developers in social media.\n Needless to say, there are lots of differences between Deno and Node.js. And Deno is not necessary a Node.js replacement (as of now), but many panicked anyway. I categorize the fear reasons and go through each separately.\n  One of the main reasons for the current situation is because both products have the same creator. And many think that Ryan Dahl won’t spend any time over Node. Thus, Node.js is dying.\n While this is a valid assumption, it is fundamentally wrong. Node.js has a gigantic community that is much larger than many others. Thus, it is not a single person project.\n On the counter-argument, some compare Dahl’s existence to Node.js with Linus Torvalds’s existence to Linux. I tell you, that’s not a correct comparison at all.\n First of all, Dahl has not been involved with Node.js since 2012. But Torvalds’s been working on Linux over the last 30 years in one form or another.\n Second of all, there’s no guarantee that even if Torvalds leaves the Kernel community, Linux will die. And also don’t equalize the September 2018 mayhem in the Linux community with the Torvalds exit. The 2018 chaos was a dark monstrous event that a part of it was about Torvalds qutting.\n Lastly, Torvalds also created Git but is not maintaining it. He just handed over entirely. Has Git died?\n  Node.js community has a reputation for being a graveyard of unmaintained libraries. With no offense, the number of libraries that are born or die everyday outnumbers any person’s cells.\n Every other day a new framework is created that becomes the community defacto for sometimes and then out of the blue, it goes unmaintained. With a quick search, you can find dozens of them in GitHub with many stars that no one is maintaining them.\n One may say if this is the current situation in the community what makes us think the same won’t happen to Node.js?\n The answer is it depends. It depends on the community and corporations’ supports. Not necessary through monetary funding, but more contribution and support wise. If the companies that are extensively using Node.js hire some people to actively contribute to the project, then the death of Node.js is almost impossible. Let me give you an example. Java’s been around for 25 years. Besides its massive use on almost all devices, one of the reasons that Java longevity is due to corporations’ support. Not only the Oracle’s but also Amazon’s, IBM’s, and many other companies’ support.\n But let’s not forget that many companies use Node.js are startups that mostly have short lifespans and are on tight budgets. We can’t account for those companies’ contributions. It requires a big, wealthy company like Facebook or Google.\n If the community diverge and/or big corporations do not support Node, this is a valid concern that can put Node to the decline path\n  Of course. That’s true. Wealth of experience and knowledge gained over building Node.js. So there’s no surprise if Deno is better. But a technology is not only evaluated by its capabilities. That’s just one of the factors. Usage and support are more important players. And Deno is not quite there because it is young. So node.js won’t be dying immediately.\n But let’s assume the worst. Then what happens? Read the next section for that 😀\n  In my research, I’ve found that some people discuss the death of Node.js as if a person has just died. Well, the death of a language or technology is not the same as a person passing. It doesn’t happen in a day.\n Change of technology usually takes years because companies can’t replace their products overnight or in a month and then switch to a new one. Node is not an exception here. Node.js libraries don’t work with Deno and it takes time to build. Also, don’t forget about expertise availability. Currently, not many people are familiar with Deno to built production scale products. All of these will take a few years at least.\n  Even if the Node dies sooner than anticipated, there would be a job market for it. Of course not similar to COBOL. But at least for the next 5 years, there are jobs for it. That should provide enough buffer to Node developers to switch. Also since both Deno and Node are related to the JS world, switching from one to another won’t be tedious.\n  Node.js is not dying at least for the next five years and the current argument over its death in social media is meaningless. While there are some speculations over its decline, none of them so far are definitive. Even assuming the worst against Node.js and in favor of Deno, companies still need time to switch to the new technology and libraries need to be built. If you are worry or even curious, I highly recommend you start to toy around with Deno.\n In the end, I want to clarify that I have no issue with Deno. It is a good project with a bright future. My intention in writing this article is not to diss Deno but to alleviate Node.js developers’ stress.", "posttime": "2020-05-20 03:34:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "node,js", "title": "Node.js快要死了吗？", "title_en": "Is Node.js Dying?", "transed": 1, "url": "https://www.geekyhacker.com/2020/05/19/is-node-js-dying/", "via": "", "real_tags": ["node", "js"]}, {"category": "", "categoryclass": "", "imagename": "a37d053edd8cb37a6c884a7d0eb6deff.jpg", "infoid": 1002852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着全球旅行限制的实施，我们推出了一个新的系列，通过镜头的世界，在这个系列中，摄影记者帮助你虚拟地把你带到我们星球上一些最美丽、最有趣的地方。本周，苏珊·赖特(Susan Wright)分享了意大利阿布鲁佐地区收获藏红花的照片集。\n意大利的阿布鲁佐地区虽然偏远，但也未能幸免于冠状病毒大流行的破坏。该地区已报告数千例病例，数百人死亡。\n然而，几年前，在比较愉快的时候，我去了意大利亚平宁山脉以东的这个与世隔绝的角落，拍摄一年一度的秋季藏红花收获。\n这是我第一次穿越这个国家崎岖的中部山脉-去荒野的一边，远离受欢迎的旅游景点，那里的地形原始，沉睡的中世纪村庄散布在美丽的山麓。\n我在澳大利亚的农村环境中长大，对意大利农业社区着迷：他们与悠久的传统有着深厚的联系，并以富有感染力的爱和激情将他们的土地和文化融入其中。\n意大利各地的这些乡村社区聚集在一起参加他们一年一度的节日，也就是众所周知的Sagre，这是多么美妙啊，这个节日通常致力于一种特定的当地食物。\n乔瓦尼娜·萨拉(Giovannina Sarra，通常被称为藏红花女王)和她的家人在家里招待了我和其他几个人。清晨，在纳维利高原，我们在雾蒙蒙、紫罗兰色的田野中散开扇形，参与收割。\n藏红花取自藏红花的柱头，是一种有利可图的作物。也被称为oro roso，或红金，大约在13世纪左右首次引入该地区-从西班牙进口。它被誉为一种充满异国情调的香料，在米兰和威尼斯等较富裕的地区和城市销售，在法国、德国和奥地利也有销售。\n藏红花是在日出前几个小时收获的，而藏红花的花瓣仍然关闭；这使得花更容易采摘，并有助于保护它们珍贵的深红色柱头。精致的花蕾是手工采摘的，放在篮子里。\n稍后，在同一天，柱头-每朵花三根细丝-从潮湿的花瓣上分离出来。这是一个微妙的过程，需要几个小时的熟练和耐心的手。\n晚上，在明火上，明亮的丝状柱头在铁丝篮中烘干，这一过程增加了颜色和味道的丰富性。\n制造一盎司藏红花粉大约需要4000朵花-这意味着在出售香料的微小容器中包装着惊人的劳动力。\n不久前，当我坐下来端着一盘令人垂涎的米兰调味饭(一道注入了藏红花的菜肴)时，我回忆起与吉娜·萨拉(Gina Sarra)和她的家人度过的那个雾蒙蒙的清晨。\n得知萨拉女士于2018年去世，我感到很难过。她和她的家人在20世纪70年代初帮助组织的藏红花合作社现在正在与市场关闭作斗争。意大利是欧洲冠状病毒爆发的中心，几周来，意大利的生活还需要很长时间才能恢复正常。\n但毫无疑问，像萨拉这样的家庭总有一天会恢复他们的萨格雷的力量-以及在纳维利高原和更远的田野上世世代代延续的许多传统。\n苏珊·赖特(Susan Wright)是一名居住在意大利的澳大利亚摄影师，她自2003年以来一直生活在意大利。你可以在Instagram上关注她的工作。", "note_en": "With travel restrictions in place worldwide, we’ve launched a new series,   The World Through a Lens , in which photojournalists help transport you, virtually, to some of our planet’s most beautiful and intriguing places. This week, Susan Wright shares a collection of photographs from a saffron harvest in the Abruzzo region of Italy.\n  Italy’s Abruzzo region, although remote, has not been spared from the devastation of the coronavirus pandemic. The area has reported  thousands of cases and  hundreds of deaths.\n A few years ago, though, in happier times, I traveled to this isolated corner of Italy, east of the Apennine Mountains, to photograph the annual autumn saffron harvest.\n  It was my first adventure across the country’s rugged central mountains — to the wilder side, away from the popular tourist spots, where the terrain is pristine and sleepy medieval villages are scattered throughout the pretty foothills.\n  Having grown up in a rural setting in Australia, I was fascinated by the Italian agricultural communities: their deep connection to centuries-old traditions, and the infusion of their land and culture with an infectious love and passion.\n How wonderful that these rural communities throughout Italy come together for their annual festivals, known as sagre, which are often dedicated to a specific local food.\n Giovannina Sarra (often called the  Saffron Queen) and her family hosted me and a handful of others at their home. Early in the morning, in the Navelli plateau, we fanned out among the misty, violet-tinged fields and participated in the harvest.\n  Saffron, which is taken from the stigmas of the saffron crocus, is a lucrative crop. Also called oro rosso, or red gold, it was first introduced into the region around the 13th century — an import from Spain. Prized as an exotic spice, it was sold in the wealthier regions and cities of Milan and Venice, and abroad in France, Germany and Austria.\n  Saffron is harvested in the hours just before sunrise, while the crocus petals remain closed; this makes the flowers easier to pick and helps protect their precious crimson-red stigmas. The delicate buds are handpicked and placed into baskets.\n  Later, on the same day, the stigmas — three tiny threads per flower — are separated from the moist petals. It’s a delicate process that takes hours with a skilled and patient hand.\n   In the evening, over an open wood fire, the bright threadlike stigmas are dried in wire baskets, a process that adds to the richness of both the color and the flavor.\n  It takes roughly 4,000 flowers to make one ounce of saffron powder — which means there’s a staggering amount of labor packed into the tiny containers in which the spice is sold.\n  Not long ago, when I sat down to a mouthwatering plate of  Risotto alla Milanese (a dish that’s infused with saffron), I recalled the early misty morning I spent with Gina Sarra and her family.\n Ms. Sarra, I was saddened to learn,  died in 2018. The  saffron cooperative she and her family helped organize in the early 1970s is struggling now with market closures. And it will be a long time before life in Italy — for many weeks the  epicenter of the coronavirus outbreak in Europe — returns to normal.\n  But there’s no doubt that families like the Sarras will one day return to the restorative power of their sagre — and to the many traditions that have endured for generations in the fields of the Navelli plateau and beyond.\n Susan Wright  is an Australian photographer based in Italy, where she has lived since 2003. You can follow her work on   Instagram .", "posttime": "2020-05-20 03:19:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "观看,italy,藏红花", "title": "近距离观看意大利的藏红花丰收", "title_en": "An Intimate Look at Italy’s Saffron Harvest", "transed": 1, "url": "https://www.nytimes.com/2020/05/12/travel/italy-saffron.html", "via": "", "real_tags": ["观看", "italy", "藏红花"]}, {"category": "", "categoryclass": "", "imagename": "2a22454be31d9434f9cefeed301808b5.png", "infoid": 1002850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年，在一个全虚拟构建会议上，我们发布了许多关于Windows Subsystem for Linux(WSL)的令人兴奋的消息！这篇博客为您提供了所有WSL新闻的摘要，包括现在可用的和未来可以期待的。\n对Windows Subsystem for Linux 2(WSL 2)发行版的支持将于本月在Windows 10 2020年5月更新中提供。\n4年前，在Build 2016上，微软宣布了Windows Subsystem for Linux-WSL(当时也称为“Bash on Ubuntu on Windows”)，这让世界大吃一惊。WSL使Windows用户可以直接在Windows中运行原生的、未经修改的Linux命令行工具和应用程序，以及他们喜欢的所有Windows应用程序和工具。WSL的使用量已经从最初只有几千人下载第一个预览版，发展到今天超过350万台月度活跃设备！\n然而，我们希望WSL能做得更多--运行所有的Linux应用程序和工具，并更快地运行应用程序和工具。在Build 2019上，WSL团队发布了WSL 2的第一个预览版，它利用Windows的Hypervisor平台中的新功能在容器中运行发行版和工具，该容器位于真正的Linux内核映像之上，该映像由Microsoft构建和交付，托管在一个轻量级VM中，从冷启动不到2秒！这意味着WSL2提供了与真正的Linux内核的完全系统调用兼容性，并且比WSL的早期版本快3-6倍。您可以使用以下命令轻松地将任何WSL发行版的版本设置为使用WSL2：wsl.exe--set-version&lt；DistroName&gt；2。\n社区的反应是巨大的，坦率地说，是积极压倒性的-最诚挚地感谢运行WSL2、提交问题和要求特性的每个人，您帮助我们使WSL2比我们希望的更好！\n在WSL 2宣布后不久，Docker Inc.。决定在WSL 2上托管Docker Desktop for Windows！经过一段成功的预览期后，Docker宣布Docker Desktop for Windows在2020年5月10日的Windows更新上安装时，将默认在WSL 2上运行，这也将把Docker Desktop带给Windows Home用户。\n对WSL 2上的主机Docker的这一更改将导致Containers更快地启动，同时由于WSL 2与完整的虚拟机相比占用更少的资源，因此在主机上消耗的资源更少。\n您很快就可以使用单个命令安装WSL。只需打开Windows终端并输入`wsl.exe-install`\n关于WSL的一个常见抱怨是它不容易找到并启用。我们同意这一点，这就是为什么我们正在对wsl.exe命令行工具进行一些改进，以帮助您安装WSL。很快，您就可以通过在命令行中输入：wsl.exe--install来简单地安装WSL了！\n此命令将添加到每台Windows计算机上，因此您只需打开一个以管理员权限提升的终端窗口，然后运行wsl.exe--install。从那里将启用WSL可选组件，并且您指定的发行版将在重启时自动下载和安装。\n在接下来的几个月里，你可以在Windows Insiers Fast Ring中看到这个功能的初始版本。\n我们还将在首次安装WSL时引入更改，使WSL2成为新的默认分发类型。WSL2带来了重大改进，我们发现我们的Insider分支机构上的大多数用户都在使用WSL2发行版。在开发wsl.exe--install时，将其默认为人们正在使用的WSL 2是有意义的，当启用‘Windows Subsystem for Linux’可选组件时，我们也将其包括在任何新安装的WSL中。在接下来的几个月里，您将在wsl.exe(安装改进)的同时，在Insiers Fast Ring中看到这些更改。\n从我们的第一个版本开始，将CUDA和/或GPU计算支持添加到WSL一直是我们最受欢迎的功能！在过去3年多的时间里，WSL、虚拟化、DirectX、Windows驱动程序团队和我们的芯片合作伙伴一直在努力进行复杂的工程壮举，以交付此功能。\n这就是为什么我们很高兴地宣布，我们将在未来几个月内开始在Windows10Insider版本中预览对WSL的GPU计算支持！\nDirectML团队将发布带有DirectML后端的TensorFlow预览包，支持跨各种Windows硬件的AI&amp；ML工作负载的硬件无关加速-DirectML还将支持本机Windows，包括Windows上的TensorFlow！\n此预览版发布后，您只需确保安装了最新的Windows Insider Fast Build，安装了WSL 2，并从硬件供应商为您的GPU安装了正确的驱动程序，然后您就可以开始在WSL中开发、培训和测试您的机器学习和AI模型了！\n这一变化将在接下来的几个月内发布给Windows Inside Fast Ring。有关此更改的所有详细信息以及它是如何实现的，请阅读DirectX开发人员的博客文章。\n我们另一个最多产的请求之一是不仅要支持命令行应用程序，还要支持Linux GUI应用程序。例如，一些用户希望在Linux环境中运行他们首选的Linux GUI文本编辑器或IDE，并处理本地存储在发行版文件系统中的代码，或者简单地在他们的Windows机器上开发Linux GUI应用程序。\n我们的目标是让您能够与Windows应用程序一起在桌面上无缝运行Linux GUI应用程序。这将使您能够使用Linux应用程序编辑、构建和运行代码，在Python中可视化数据绘图，甚至使用针对Linux环境优化的应用程序。\n在Build中，我们演示了这项工作的早期版本，直接从WSL运行了几个GUI示例应用程序，比如Eye of Gnome、Gedit和MPV媒体播放器。这些应用程序连接到在WSL内部运行的Wayland服务器，该服务器与Windows主机上的RDP客户端通信。您可以在下面的屏幕截图中看到这一点，其中我们同时在WSL和Outlook中运行GNOME文件管理器。\n这些变化都在WSL的团队路线图上，您可以期待在2020年假期之前听到更多关于这项工作的信息。\n总而言之，一旦您更新到2020年5月10日的Windows 10更新，您将完全支持WSL 2发行版！如果你加入了Windows Insiders Fast Ring，你将在接下来的几个月内准备好开始接收最新的WSL功能，包括新的安装体验和GPU计算。\nWSL有很多令人兴奋的新闻和功能，所以请继续关注这个博客，了解任何重大公告的细节。你可以在Twitter@Craigaloewen上关注我，也可以在Twitter上关注WSL团队的成员，了解那里的任何新闻。请查看Kevin Gallo的博客文章，了解Build中所有针对Windows开发人员的新闻。感谢您对WSL的支持！", "note_en": "This year at an all virtual BUILD conference we had many exciting announcements for the Windows Subsystem for Linux (WSL)! This blog post gives you a summary of all the WSL news, including what’s available now and what you can expect in the future.\n     Support for Windows Subsystem for Linux 2 (WSL 2) distros is coming this month in the Windows 10 May 2020 Update\n 4 years ago, at Build 2016, Microsoft surprised the world by announcing Windows Subsystem for Linux – WSL (also known at the time as “Bash on Ubuntu on Windows”). WSL enables Windows users to run native, unmodified Linux command-line tools and apps directly in Windows, alongside all their favorite Windows apps and tools. WSL usage has grown enormously from initially just a few thousand people downloading the first preview build to more than 3.5 million monthly active devices today!\n However, we wanted WSL to do more – to run all Linux apps and tools, and to run apps and tools faster. At Build 2019, the WSL team unveiled the first preview of WSL 2, which utilizes new capabilities in Windows’ Hypervisor Platform to run distros and tools in containers,  atop a real Linux kernel image that is built and delivered by Microsoft, hosted in a lightweight VM, which boots from cold in less than 2s! This means that WSL 2 delivers full system call compatibility with a real Linux kernel and is 3-6x faster compared to earlier versions of WSL. You can easily set the version of any WSL distro to be using WSL 2 with the command:  wsl.exe --set-version &lt;distroName&gt; 2.\n The response from the community has been huge and, frankly, positively overwhelming – sincerest thanks to everyone who ran WSL 2, filed issues, and asked for features, you’ve helped us make WSL2 even better than we hoped it could be!\n   Shortly after WSL 2 was announced, Docker Inc.  decided to host Docker Desktop for Windows atop WSL 2! Following a successful preview period, Docker has announced that Docker Desktop for Windows will now default to run atop WSL 2 when installed on the Windows 10 May 2020 update, which will bring  Docker Desktop to Windows Home users as well.\n This change to host Docker on WSL 2 will result in containers booting up faster, while consuming fewer resources on the host machine due to WSL 2’s more lightweight footprint vs. full VMs.\n   You’ll soon be able to install WSL with a single command. Just open a Windows Terminal and enter `wsl.exe –install`\n One common complaint about WSL is that it’s not easy to find and enable. We agree, which is why we’re working on some improvements to the wsl.exe command-line tool to help you install WSL. Soon you will be able to simply install WSL by entering:  wsl.exe --install in your command-line!\n  This command will be added to every Windows machine so that all you need to do is open a Terminal window elevated with administrator privileges and run  wsl.exe --install. From there the WSL optional components will be enabled, and your specified distro will be downloaded and installed for you automatically upon restart.\n You can expect to see initial releases of this feature in the next few months in the Windows Insiders Fast Ring.\n  We’re also introducing the change to make WSL 2 the new default distribution type when installing WSL for the first time. WSL 2 brings significant improvements and we found that the majority of our users on Insider branches are using WSL 2 distros. When developing  wsl.exe --install it made sense for it to default to what people are using: WSL 2, and we’ve included this as well for any new installations of WSL when enabling the ‘Windows Subsystem for Linux’ optional component. You’ll see these changes in the Insiders Fast ring in the next few months alongside the  wsl.exe --install improvement.\n  Adding  CUDA and/or  GPU Compute support to WSL has been our #1 most requested feature since our first release! Over the last 3+ years, the WSL, Virtualization, DirectX, Windows Driver teams, and our silicon partners have been working hard on a complex engineering feat to deliver this capability.\n This is why we’re thrilled to announce that we will start previewing GPU compute support for WSL in Windows 10 Insider builds within the next few months!\n  DirectML The team will be releasing a preview package of TensorFlow with a DirectML backend enabling hardware agnostic acceleration of AI &amp; ML workloads across the breadth of Windows hardware – DirectML will also support native Windows too, including TensorFlow on Windows!\n Once this preview is released, you will simply need to ensure that you have the latest Windows Insider Fast build, WSL 2 installed, install the correct driver for your GPU from the hardware vendor, and then you’ll be ready to start developing, training and testing your machine learning and AI models inside of WSL!\n  This change will be released to the Windows Insiders Fast ring in the next few months. For all the details of what this change means and how it was made possible, please read  the DirectX Developer blog post.\n  One of our other most prolific requests is to support not just command-line apps, but Linux GUI apps as well. For example, some users want to run their preferred Linux GUI text editor or IDE in a Linux environment and work on their code stored locally within their distro’s filesystem, or simply develop Linux GUI apps on their Windows machine.\n Our goal is for you to be able to run Linux GUI apps on your desktop seamlessly alongside your Windows apps. This will enable you to use Linux apps to edit, build, and run your code, visualize data plots in Python, or even use applications that are optimized for a Linux environment.\n At BUILD we demonstrated an early version of this work, running a few GUI sample apps directly from WSL such as  Eye of Gnome,  gedit and the  mpv media player. These apps connected to a wayland server running inside of WSL, which communicated with a RDP client on the Windows host. You can see a screenshot of this in action below where we’re running the GNOME file manager in WSL and Outlook side by side.\n  These changes are on the WSL’s team roadmap and you can expect to hear more about this work by holiday 2020.\n  To summarize, once you update to the Windows 10 May 2020 Update you’ll have full support for WSL 2 distros! If you join the Windows Insiders Fast Ring you’ll be ready to start receiving the latest WSL features including the new install experience and GPU compute within the next few months.\n There’s lots of exciting news and features coming to WSL, so please stay tuned to this blog for the details of any big announcements. You can follow me on Twitter  @craigaloewen or  members of the WSL team that are on Twitter for any news there as well. Please check out  Kevin Gallo’s blog post for all of the Windows developer focused news from BUILD. Thank you for supporting WSL!", "posttime": "2020-05-20 03:18:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,windows,linux,app,支持", "title": "Windows将开始支持Linux GUI应用程序", "title_en": "Windows will start supporting Linux GUI apps", "transed": 1, "url": "https://devblogs.microsoft.com/commandline/the-windows-subsystem-for-linux-build-2020-summary/#wsl-gui", "via": "", "real_tags": ["程序", "windows", "linux", "app", "支持"]}, {"category": "", "categoryclass": "", "imagename": "4123f79b90fcb63d8fc7b2cf8c0c5bb1.jpg", "infoid": 1002849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软在Windows10中增加了一个内置的软件包管理器。该公司今天宣布Windows Package Manager将在Build 2020中发布，这是一个新的本机软件包管理器，将被内置到Windows10中。\n对于那些不熟悉的人来说，软件包管理器允许用户在他们的机器上快速安装软件，而不必手动转到每个应用程序的网站或通过Microsoft Store。\nWindows软件包管理器是一个新工具，用户可以使用它来实现这一点。使用新的“Winget”命令，Windows软件包管理器会自动获取您要下载的应用程序的最新版本，验证其真实性，并将其安装在您的计算机上。例如，要安装最新版本的Windows终端(顺便说一下，它刚刚升级到1.0)，您只需运行“Winget install Terminal”即可安装最新版本的Windows终端，而无需前往微软商店。您也可以使用“Winget Search”来搜索应用程序。以下是其他可用命令：\n微软将提供自己的第一方存储库，其中包括流行的Windows10应用程序，你也可以提交一个拉取请求来添加新的应用程序(带有清单文件)。该公司还将允许用户从第三方存储库下载应用程序，因此你也可以从第三方来源下载应用程序。\n微软表示，该公司制作自己的软件包管理器而不是为现有的软件包管理器做出贡献的主要原因是安全。“我们关心的一个关键问题是如何建立一个受信任的应用程序存储库。我们会自动检查每一份舱单。我们利用SmartScreen、静态分析、SHA256散列验证和一些其他过程来降低恶意软件进入存储库和进入您的机器的可能性，“微软高级程序经理Demitrius Nelon说。\n“如果您对当前的包管理器感到满意，请继续使用它。我们的目标是让在Windows上安装软件对每个人都更好，“Nelon补充说。\nWindows Package Manager支持Windows10版本1709及更新版本，一旦版本达到1.0，它将预装Windows10的桌面应用安装程序。目前，用户可以使用Windows软件包管理器，方法是通过Windows Insider程序从此处的GitHub存储库下载Windows软件包管理器，或者通过将其Microsoft帐户电子邮件地址发送到[受保护的电子邮件]来加入Windows软件包管理器Insider计划。\n高级会员对新闻帖子的评论将以提升状态为特色，从而提高他们的可见性。此选项卡允许您与其他高级会员一起参与高级评论。注册以加入其他高级会员提升对话！\n注册或订阅。\n您没有登录但想要加入对话吗？成为瑟罗特高级或基本用户参与。\n登记簿", "note_en": "Microsoft is adding a built-in package manager to Windows 10. The company today announced Windows Package Manager at Build 2020, and it’s a new, native package manager that is going to be built into Windows 10.\n A package manager, for those unfamiliar, allows users to quickly install software on their machine without having to manually go to every application’s website or through the Microsoft Store.\n  Windows Package Manager is a new tool that will allow users to do exactly that. With the new “winget” command, Windows Package Manager automatically gets the latest version of an app you want to download, validates its authenticity, and installs it on your machine. For example, to install the latest version of Windows Terminal ( which just hit 1.0 by the way), you can simply run “winget install terminal” and install the latest version of the Windows Terminal without having to go to the Microsoft Store. You can also use “winget search” to search for an app. Here are the other available commands:\n  Microsoft will offer its own first-party repository that includes popular Windows 10 apps, and you can also submit a pull request to add new apps (with manifest files). The company will also allow users to download apps  from third-party repositories, so you will be able to pull apps from a third-party source as well.\n Microsoft says the main reason behind the company making its own package manager instead of contributing to existing ones was security. “One critical concern we had was how to build a repository of trusted applications. We are automatically checking each manifest. We leverage SmartScreen, static analysis, SHA256 hash validation and a few other processes to reduce the likelihood of malicious software making its way into the repository and onto your machine,” said Demitrius Nelon, a senior program manager at Microsoft.\n “If you are happy with your current package manager, keep using it. Our goal is to make installing software on Windows better for everyone,” Nelon added.\n Windows Package Manager supports Windows 10 version 1709 and newer and it will come pre-installed with Windows 10’s Desktop App Installer once it reaches version 1.0. For now, users will be able to use the Windows Package Manager by downloading it  from the GitHub repository here, via the Windows Insider program, or by joining the Windows Package Manager Insider program by sending their Microsoft Account email address to   [email protected].\n Premium member comments on news posts will feature an elevated status that increases their visibility.This tab would allow you to participate in Premium comments with other premium members.Register to join the other Premium members in elevating the conversation!\n  Register or Subscribe\n  Don&#39;t have a login but want to join the conversation? Become a Thurrott Premium or Basic User to participate\n  Register", "posttime": "2020-05-20 03:17:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,cli,offer,windows", "title": "微软将提供其自己的CLI包管理器，可选择第三方回购", "title_en": "Microsoft will offer its own CLI Package Manager with option of 3rd party repos", "transed": 1, "url": "https://www.thurrott.com/windows/windows-10/236301/windows-10-is-getting-its-own-built-in-package-manager", "via": "", "real_tags": ["microsoft", "微软", "cli", "offer", "windows"]}, {"category": "", "categoryclass": "", "imagename": "be543a5b2ef2bf5c03fc3e62fc6bc13a.jpg", "infoid": 1002848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "二月的一个晚上，我去巴尔的摩地下科学空间听讲座，这是一个社区实验室，以前是瓶盖工厂。就像全国其他几十个“生物空间”一样，这个实验室被称为“生物空间”，是由一种颠覆性的业余精神激发起来的。任何人都可以去那里学习，然后做那种尖端的板凳科学-基因编辑，合成生物学-通常仅限于资金雄厚的学术机构和私营公司。里面有一块黑板，上面画着一个微生物和一个双螺旋的卡通图画，欢迎新来者，但实验室区域已经装修得很整齐了。有一台实时PCR机器，科学家们可以用它复制数百万份特定的DNA链，以便研究和操作它。实验室执行主任丽莎·谢菲尔(Lisa Scheifele)告诉我：“我们没有太多超级花哨的东西，”不过，这可能取决于你对层流引擎盖(根据实验室网站，“用于处理你真的不想被污染的细胞和培养物”)、Alpha Innotech凝胶成像仪或负70度储存冰柜等物品的想象力有多高。“我们有我们需要的东西，”Scheifele说。“你可以在这里做大部分的遗传学研究。你可以做微生物学。“。\n那天晚上，20多人鱼贯而入，聆听33岁的扬恩·洪·德·克马德克(Yann Huon De Kermadec)谈论开放胰岛素项目(Open Insulin Project)，他希望为该项目招募当地志愿者。他今年33岁，拥有格勒诺布尔大学(University Of Grioble)蛋白质生物化学博士学位。该项目于2015年在奥克兰的生物空间柜台文化实验室(BioSpace Counter Culture Labs)发起，针对美国医疗体系中的一个彻头彻尾的失败提出了一个“生物黑客”方案：胰岛素的成本不断上涨。胰岛素是一种合成形式的荷尔蒙，750万糖尿病患者必须每天注射这种荷尔蒙才能生存。它的目标是复制由礼来公司、诺和诺德和赛诺菲三家制药公司在美国制造和销售的胰岛素，并公布一项安全生产胰岛素的协议。这三家美国制造商最近的要价都在每瓶300美元以上。最终，该项目希望推出一个由患者和工人拥有的合作药物网络，该网络将生产小批量胰岛素，并向糖尿病患者提供每瓶约7美元的价格。至少，Open Insulin想要证明这样的药物密码破译是可以做到的，希望它能揭开药物生产过程的神秘面纱。\n巴尔的摩的讲座是在19年危机需要社会疏远的几周前举行的，所以我们紧紧地坐在半圆形里。Pepperidge农场的饼干和混合坚果摆在桌子上，旁边是一本出售的书，书名为“零到遗传工程英雄：在Makerspace的家庭、学校和学校编程细菌的初学者指南”(Zero to Genetic Engineering Hero：The初级指南to Programming in Home，School&Amp；in the Makerspace)。一张传单宣传了一项名为“生物打印突破”的活动，承诺将“向新的受众和应用介绍3D组织工程”。在人群中，有一些看起来很时髦的年轻夫妇，一个穿着大衣的中年非裔美国人，还有一个61岁的常客，他在计算机安全部门工作，喜欢社区实验室的场景，因为他告诉我，你可以想说多少就说多少科学，而在“正常的社交情况下，人们开始逃跑”。\nHuon de Kermadec戴着克拉克·肯特(Clark Kent)的眼镜，穿着牛仔裤和灰色连帽衫，他自我介绍说自己是“一个拥有我博士学位的法国人，当我妻子找到工作时，他就跟着她。”(他与也在Open Insulin工作的路易丝·拉萨勒(Louise Lassalle)结婚，并来到美国劳伦斯·伯克利国家实验室(Lawrence Berkeley National Laboratory)攻读生物化学博士后学位。)。Huon de Kermadec最初被Open Insulin吸引是因为他认为实验室的工作会很有趣-他热爱生物学工艺，但对发表论文的学术压力感到恼火。他向听众指出，近一半的美国成年人患有糖尿病或高血糖水平，但目前美国还没有胰岛素的仿制药，也没有任何机制来控制价格，就像加拿大和欧洲一样。他说，“如果三大公司中有一家涨价，他们都会涨价.”“因为他们能做到。”他展示了一张图表的幻灯片，该图表描绘了胰岛素价格的指数曲线。1996年，礼来公司推出了这种荷尔蒙的合成版Humalog，每瓶10毫升，售价21美元；在接下来的20年里，零售价上涨了10倍。赛诺菲的Lantus和诺和诺德的Novolog的成本也同样飙升。(礼来公司最近宣布，在-19疫情期间，它将把每月自掏腰包购买胰岛素的成本降低到35美元，但这种药物是该公司重要的收入来源，价格可能会反弹。)。1型糖尿病患者通常每月需要两到三瓶胰岛素。即使他们有保险，也不一定能支付全部费用。宾夕法尼亚大学研究人员于2018年进行的一项研究\nHuon de Kermadec叹了口气。“你可以找到黑市的方法，”他说。“但谁能接触到这一点呢？你不能改变体制。“。他在房间前面踱来踱去，接着说：“我们的目标是更多地改变这件事的制作方式。这不一定是大制药公司利用人们的痛苦的情况。我们可以设计出更好的系统。“。\nOpen Insulin有它的批评者，而不仅仅是制药业的游说者。耶鲁大学公共卫生学院(Yale School Of Public Health)流行病学教授格雷格·贡萨尔维斯(Gregg Gonsalves)是该组织的前成员，该组织在危机期间对药物开发采取了对抗性、反制度主义的立场。然而，贡萨尔维斯告诉我，DIY医学“就像GoFundMe的基本医疗保健活动--这是系统崩溃的标志。”他继续说，DIY运动“正在走向绝望的死胡同，当所有的精力和愤怒可能更好地集中在与政客打交道时”，并为普及医疗保健而战。\n然而，考虑到美国医疗保健体系的严重缺陷，Open Insulin的方法还是有希望的。该集团正在考虑与当地医院和药店合作，这将有助于将其方法与主流机构的方法相结合。凯利·希尔斯(Kelly Hills)是一家名为“流氓生物伦理学”的咨询公司的生物伦理学家，她赞赏Open Insulin的努力，这种感觉在冠状病毒危机期间只会加深。她告诉我，在小型社区实验室分散生产标准药物可能是一种方式，可以确保当传统的供应线中断时，我们不会遇到短缺。希尔斯说，药品短缺经常发生，即使我们不是在应对大流行，而且“如果你依赖药物维持生命，那就非常可怕”。“但是，如果你有一个社区实验室，你就可以跳过生产延误和边境停顿。如果你知道只要花几美元就可以去社区实验室给你开一个月的胰岛素处方，这将是一种巨大的压力缓解。“。她说，最大的问题是开放式胰岛素是否能满足食品和药物管理局(Food And Drug Administration)规定的严格安全要求。\n约翰·威尔班克斯是研究非营利组织Sage Bionetworks的卫生技术专家，他告诉我，DIY医学，尽管其所有激进的方面，都可以被视为典型的美国项目。他指出：“我们有一种争先恐后的文化，在这种文化中，你应该找到自己的个人解决方案。”“嗯，他们就是这么做的。”\nDIY-Bio运动出现在两千年的早期，似乎几乎是在进化上适应了它的历史时刻。它呼应了创业文化的方方面面，特别是个人电脑的早期，它以车库为基础的起源故事。先是硬件，然后是软件，现在连生活的湿器都可以在人们家里创造了。DIY.Bio反映了大众对职业权威和把关的怀疑，但它对学习或专业知识并不怀疑。“我”是麻省理工学院2004年开始的一项针对本科生的合成生物学竞赛，现已扩大到包括社区实验室的工作人员和其他机构外的科学家。DIY-Bio运动还滋生了侧面喧嚣的概念和Maker Fire活动的兴起，这给业余爱好者带来了一种很酷的新合法性。对于一些想要改变世界的初出茅庐的科学家来说，气候变化和大流行性疾病的挑战使生物学比计算机科学更有说服力。\n近年来，人们相对容易获得精密的实验室仪器，如PCR机器、原子力显微镜和环境传感器。例如，当新的生物技术公司倒闭时，他们倾向于以折扣价出售设备，而社区实验室和生物黑客则将其抢购一空。威尔班克斯告诉我，“DIY.Bio与硅谷70年代末的家庭酿造、黑客俱乐部文化非常相似。如果你还没有在eBay上购买他们可以在24小时内发货给你的DNA测序仪，那就去看看吧--那里有一个巨大的二级市场。“。\nDIY-Bio生态系统包含了很多做好事的人，他们中的许多人都受到了19年危机的鼓舞。艾伦·乔根森(Ellen Jorgensen)是一名分子生物学家，也是美国第一个社区实验室Genspace的创始人，该实验室于2010年在布鲁克林开业。她现在是一名生物技术高管，但她仍然相信DIY Bio的可能性。在巴黎成立的合作网络Only One Giant Lab的赞助下，约根森正在领导一项诊断-19测试的研究，该测试将消除对PCR机器的需求，尽管PCR机器在美国已经变得很常见，但在世界上较贫穷的地区很难买到。Jorgensen的团队正在开发一种基于环介导的等温扩增的-19测试协议，这是一种复制病毒遗传物质的低成本方法，最初由研究人员在\nDIY生物谱包括无政府主义自由主义者。让约根森和犬类这样的人沮丧的是，这种兄弟般的元素往往会吸引媒体的注意，因为他们喜欢直播特技。2018年，在奥斯汀的一次会议上，28岁的生物黑客亚伦·特雷威克(Aaron Traywick)直播了自己注射DIY治疗生殖器疱疹的过程。(目前还不清楚它是否有效；那年晚些时候，特雷威克在使用感官剥夺坦克时在华盛顿特区去世。)。这项运动的这一部分包括戈佐自我实验者，寻求延长寿命的跨舒马主义者，以及渴望成为半机械人的人-比方说，通过在手臂上植入包含他们医疗记录的微芯片。与我交谈过的一个人称这群人为“你做了什么？”人群。另一个人说，这样的人遵循“因为它很酷，因为我们可以”的信条。\n其中最著名的也许是乔西亚·泽纳(Josiah Zayner)，他是一名生物黑客企业家，拥有芝加哥大学(University Of Chicago)生物物理学博士学位，是一个厚颜无耻的公众形象，与监管机构的关系也很狡猾。2017年，泽纳直播了他自己注射的基因编辑技术，这是为了增强他的肌肉。(它没有起作用。)。他还记录了一个自我实验，在这个实验中，他将朋友捐赠的粪便中的物质移植到他的肠道中，从而改变了他的微生物群。他现在有一家名为奥丁(Odin)的公司，该公司销售邮购套件，让你可以尝试，制造黑暗中发光的酵母，并对树蛙进行基因工程。泽纳似乎接受了这样一种观点，即唯一有趣的科学家是一个疯狂的科学家。\n去年8月，在拉斯维加斯举行的一场名为“生物黑客星球”的会议上，泽纳发表了一次演讲，他在演讲中指出，在多米尼加共和国这样的邻国，有许多绝望的患者愿意尝试任何一种实验性的基因疗法，即使它很有可能会杀死他们。他建议，DIY激进分子应该对这群人进行测试。“当你可以飞上几个小时，而不需要与任何政府作战时，为什么要与美国政府作战呢？”他说。\n对于一些生物黑客挑衅者来说，大型制药公司是一个诱人的目标。在生物黑客大会上，一个名叫加布里埃尔·利奇纳(Gabriel Licina)的人坐在舞台边缘，就他和两个朋友--奥地利的生物技术专家安德烈亚斯·施特尔默(Andreas Stürmer)和密西西比州的石油工人、自学成才的生物学家和狗饲养员大卫·伊希(David Ishee)--启动的一个项目进行了激烈的讨论。他宣布，他们已经对基因治疗药物Glybera进行了反向工程，这种药物治疗一种名为脂蛋白脂肪酶缺乏症的罕见疾病，这种疾病会导致甘油三酯在血液中危险的积聚。\n利希纳在生物黑客社区中很出名，因为他在2015年进行了一次自我实验，用自己设计的眼药水创造了“夜视”。(这些药水含有氯素e6，一种与海洋生物中发现的类似的光敏物质。)如果你在谷歌上搜索他的名字，你会发现他的照片，他的瞳孔放大，眼皮肿胀，剃光头，看起来像个外星人。他说，他在晚上看了几个小时的更远的地方，没有受到持久的损害。\n当荷兰公司UniQure在2015年推出Glybera时，它是世界上最昂贵的药物，每剂大约100万美元。两年后，UniQure将Glybera撤出市场，因为只有一家德国的保险公司会为一名患者承保。(大约每百万人中就有一人患有脂蛋白脂肪酶缺乏症。)。在拉斯维加斯，李奇纳说，他和他的同事们已经确定了相关的DNA，将他们的发现发送到了外部的遗传学实验室，并对大肠杆菌进行了改造，以生产出患有这种疾病的人所缺少的蛋白质。(这个过程类似于胰岛素的制造过程。)。利希纳宣布，他带了40瓶改良过的细菌来参加会议，他不时地在头顶上挥舞一瓶，咯咯地笑着。他邀请科学家来培养、提纯和测试他的发明。但是，知道他的观众喜欢自我实验，他说，“不要给自己注射这种东西。看在上帝的份上，别再刺伤自己了。“。\n二月份，我和利奇娜通了电话。他当时在印第安纳州的南本德，在那里他在家里经营着一个社区实验室，科学之家。“这听起来会很轻率，”他说。“但是我和我的朋友们决定做Glybera的事情，因为我们认为这会很有趣。我是说，这是一种价值百万美元的毒品。“。然而，他声称，即使是它的秘密也相对容易地解开了。(保留该药专利的uniQure表示，被Licina的“山寨产品”搞得措手不及，但尚未提起诉讼。)。利希纳说，他不希望任何人将他的创作用于治疗。他只是想让像他这样的生物黑客停止生产在黑暗中发光的啤酒-是的，这是一件事-并专注于他们的刺激\nDIY生物运动最早出现在生物技术蓬勃发展的地方，如马萨诸塞州剑桥和旧金山湾区。一些缺乏在学术和企业实验室从事生物研究所需的资金或资质的人开始装备自己。其他人想要证明高级医疗信息和技术可以共享。2008年，凯·奥尔刚刚从。\n..", "note_en": "One evening in February, I went to hear a lecture at the Baltimore Underground Science Space, a community lab in a former bottle-top factory. Like several dozen other “biospaces” around the country,  , as the lab is known, is animated by a spirit of subversive amateurism. Anybody can go there to learn about, and then do, the kind of cutting-edge bench science—gene editing, synthetic biology—that is generally confined to well-funded academic institutions and private corporations. Inside, a chalkboard with cartoon drawings of a microbe and a double helix welcomes newcomers, but the lab areas are seriously kitted out.   has a real-time PCR machine, the gadget that allows scientists to make millions of copies of a particular strand of DNA, in order to study and manipulate it. “We don’t have a lot else that’s  super fancy,” Lisa Scheifele, the lab’s executive director, told me, though that might depend on how fancy you consider such items as a laminar-flow hood (“for working with cells and cultures that you really don’t want contaminated,” according to  the lab’s Web site), an Alpha Innotech gel imager, or a negative-seventy–degree storage freezer. “We have what we need,” Scheifele said. “You can do most genetics here. You can do microbiology.”\n  That night, two dozen people had filed in to hear Yann Huon de Kermadec—a low-key thirty-three-year-old with a Ph.D. in protein biochemistry from the University of Grenoble—talk about the Open Insulin Project, for which he hoped to recruit local volunteers. The project, which originated in 2015, at the biospace Counter Culture Labs, in Oakland, proposes a “biohack” for a stark failing in the American health-care system: the rising cost of insulin, the synthetic form of the hormone that 7.5 million diabetics must inject daily in order to live. Its goal is to replicate the insulin that is manufactured and sold in this country by three pharmaceutical companies—Eli Lilly, Novo Nordisk, and Sanofi—and to publish a protocol for safely producing it. The three U.S. manufacturers have lately been charging upward of three hundred dollars a vial. Eventually, the project hopes to launch a network of patient-and-worker-owned coöperatives that will produce small batches of insulin and offer vials to diabetics for about seven dollars each. At the very least, Open Insulin wants to show that such pharmaceutical code-breaking can be done, in the hope that it will demystify the drug-production process.\n  The Baltimore lecture took place a few weeks before the  -19 crisis necessitated social distancing, so we sat in tight semicircles. Pepperidge Farm cookies and mixed nuts were set out on a table, near a book for sale called “ Zero to Genetic Engineering Hero: The Beginner’s Guide to Programming Bacteria at Home, School &amp; in the Makerspace.” A flyer advertised an event, BioPrinting Breakout, which promised to introduce “3D tissue engineering to new audiences and applications.” In the crowd, there were some hip-looking young couples, a middle-aged African-American man in a parka, and a sixty-one-year-old regular who works in computer security and loves the community-lab scene because, he told me, you can talk science as much as you want, whereas in “normal social situations people start running away.”\n Huon de Kermadec, who wore Clark Kent glasses, jeans, and a gray hoodie, introduced himself as “a French guy having my Ph.D. who followed my wife when she found a position.” (He is married to Louise Lassalle, who also works with Open Insulin, and came to the U.S. to do a postdoc in biochemistry at the Lawrence Berkeley National Laboratory.) Huon de Kermadec was originally attracted to Open Insulin because he thought the lab work would be fun—he loves the craft of biology but is annoyed by the academic pressure to publish. He noted to the audience that nearly half of American adults have diabetes or high blood-sugar levels, yet there are currently no generic forms of insulin available in the U.S., nor are there any mechanisms in place for controlling the price, as there are in Canada and in Europe. “If one of the three big companies increases the price, they all increase the price,” he said. “Because they can.” He showed a slide of a chart depicting an exponential curve for insulin prices. In 1996, Eli Lilly introduced Humalog, its synthetic version of the hormone, at twenty-one dollars for a ten-millilitre vial; during the next two decades, the retail price increased tenfold. Sanofi’s Lantus and Novo Nordisk’s Novolog have similarly soared in cost. (Eli Lilly recently announced that, during the  -19 epidemic, it would lower the monthly out-of-pocket cost of insulin to thirty-five dollars, but the drug is a crucial source of revenue for the company, and the price will likely rebound.) Patients with Type 1 diabetes typically require two to three vials of insulin a month. Even if they have insurance, it doesn’t necessarily cover the entire expense. A  2018 study conducted by researchers at the Yale School of Medicine found that one in four diabetes patients scrimped on insulin usage—not filling prescriptions regularly, using less than prescribed—risking kidney failure, blindness, and death.\n Jean Peccoud, a professor of chemical and biological engineering at Colorado State University and the founder of the journal  Synthetic Biology, told me, “The price of insulin is something for which there is no technical justification, no justification other than greed. It’s simple to make, with a large market. It should be as cheap as Tylenol.”\n  The scientist who discovered that injections of insulin could save diabetics from a painful death wanted to see the drug affordable and widely available. In 1921, Frederick Banting, a Canadian orthopedist, derived insulin from the pancreases of dogs; he sold the patent to the University of Toronto for one dollar, clearing the way for it to be mass-produced. “Insulin does not belong to me,” he declared. “It belongs to the world.”\n Open Insulin plans to use protocols laid out in published papers to perform genetic engineering on two organisms—yeast and  E. coli—causing them to produce insulin. This is how pharmaceutical factories generally make the drug. Last spring, the group announced that preliminary results indicated the successful insertion of a target gene into  E. coli cells, and the subsequent production of a protein that converts into insulin. The next step was to assess the samples, using mass spectrometry and other technologies.\n When Huon de Kermadec mentioned this development, a guy with a close-shaved head and a Russian accent interjected to say that he ran a drug-testing lab, and wouldn’t mind vetting some of Open Insulin’s samples. The project was a “fascinating testament to the prospect of citizens doing science,” the man said. Still, he noted, maybe it would be simpler for people who needed expensive medications to get hold of them on the black market, or in other countries.\n Huon de Kermadec sighed. “You  could find a way with a black market,” he said. “But who will have access to that? You don’t change the system.” Pacing the front of the room, he went on, “What  we aim for is more changing the way this is produced. It doesn’t  have to be a situation where Big Pharma exploits people’s misery. We can design a better system.”\n  Open Insulin has its critics, and not only lobbyists for the pharmaceutical industry. Gregg Gonsalves, a professor of epidemiology at the Yale School of Public Health, is a former member of  , which took a confrontational, anti-institutionalist stance to drug development during the   crisis. Yet Gonsalves told me that D.I.Y. medicine is “like GoFundMe campaigns for basic health care—a sign of a broken system.” The D.I.Y. movement, he continued, “is going down a dead end of desperation, when all that energy and anger might be better focussed on dealing with politicians” and fighting for universal access to health care.\n  Yet, given the profound flaws of the American health-care system, there is something hopeful about Open Insulin’s approach. The group is considering teaming up with local hospitals and pharmacies, which would help integrate its methods with those of mainstream institutions. Kelly Hills, a bioethicist at a consulting firm called Rogue Bioethics, appreciates Open Insulin’s efforts, a feeling that has only deepened during the coronavirus crisis. She told me that the decentralized production of standard drugs in small community labs might be a way of insuring that we don’t run into shortages when traditional supply lines are disrupted. Drug shortages occur fairly often, even when we’re not dealing with a pandemic, and they are “very scary if you are life-dependent on a medication,” Hills said. “But, if you have a community lab, you’re skipping manufacturing delays and pauses at borders. It would be a huge stress relief if you knew you could go to a community lab and fill your insulin prescription for a month for a few bucks.” The big question, she said, is whether Open Insulin can meet the exacting safety requirements mandated by the Food and Drug Administration.\n John Wilbanks, a health technologist at the research nonprofit Sage Bionetworks, told me that D.I.Y. medicine, for all its radical aspects, can be viewed as a quintessentially American project. “We have this whole culture of hustle and grind, in which you’re supposed to find your own individual solutions,” he pointed out. “Well, that’s what they’re doing.”\n The D.I.Y.-bio movement, which emerged in the early two-thousands, seems almost evolutionarily adapted to its historical moment. It echoes aspects of startup culture, especially the early days of personal computing, with its garage-based origin stories. First came the hardware, then the software; now even the wetware of life can be created in people’s homes. D.I.Y. bio reflects popular skepticism about professional authority and gatekeeping, but it is not skeptical about learning or expertise. i , a synthetic-biology competition for undergraduates which started at M.I.T. in 2004, has expanded to include people working in community labs and other extra-institutional scientists. The D.I.Y.-bio movement also feeds off the notion of the side hustle and the rise of Maker Faire events, which have lent hobbyists a cool new legitimacy. To some budding scientists who want to make a difference in the world, the challenges of climate change and pandemic disease have made biology more compelling than, say, computer science.\n  In recent years, it has become relatively easy for people to acquire sophisticated lab instruments such as PCR machines, atomic-force microscopes, and environmental sensors. For example, when new biotech companies fail, they tend to sell off their equipment for a discount, and community labs and biohackers scoop it up. Wilbanks told me, “D.I.Y. bio is very similar to the home-brew, hacker-club culture of the late seventies in Silicon Valley. If you’ve not gone on eBay to shop for a DNA sequencer that they can ship to you in twenty-four hours, check it out—there’s a massive secondary market.”\n The D.I.Y.-bio ecosystem includes a lot of do-gooders, and many of them have been galvanized by the  -19 crisis. Ellen Jorgensen is a molecular biologist and a founder of GenSpace, the country’s first community lab, which opened in Brooklyn in 2010. She is now a biotech executive, but she continues to believe in the possibilities of D.I.Y. bio. Under the auspices of Just One Giant Lab, a collaborative network founded in Paris, Jorgensen is leading research on a diagnostic  -19 test that would eliminate the need for PCR machines, which, as commonplace as they have become in the U.S., are hard to come by in poorer parts of the world. Jorgensen’s team is developing a  -19 testing protocol based on loop-mediated isothermal amplification, a low-cost method of replicating a virus’s genetic material, initially developed by researchers in Japan; according to  Just One Giant Lab’s Web page, the process “can be done in a cup of hot water.”\n Another veteran of GenSpace, Will Canine, co-founded a company that makes open-source robots. The machines allow labs to automate a tedious task required in a lot of modern biological research: dispensing precise amounts of liquids, over and over again. When the coronavirus emerged, a hundred and seventy of Canine’s machines were repurposed by a public-private partnership, the Covichain Robots Initiative, and shipped, at no cost, to hospitals in Spain. The robots can make testing for  -19 speedier and cheaper, and help eliminate humans from labs at a time when social distancing is crucial. Canine told me that D.I.Y. bio has a lot to teach our pandemic world. The movement has learned to use accessible language without dumbing down science, and it has also learned what  not to do: “speculate about scientifically invalid and dangerous things in public forums”; “hoard protocols, data, equipment, reagents, or anything else that could be broadly useful to others.” Canine added that “D.I.Y. bio should not be concerned with doing the most bleeding-edge experiments but, rather, with making the most relevant scientific knowledge and tools available to those otherwise excluded from them.”\n The D.I.Y.-bio spectrum includes anarcho-libertarians. To the frustration of people like Jorgensen and Canine, this bro-ish element tends to attract media attention, because of a predilection for live-streaming stunts. In 2018, at a conference in Austin, the twenty-eight-year-old biohacker Aaron Traywick live-streamed his self-injection of a D.I.Y. treatment for genital herpes. (It’s unclear if it worked; Traywick died later that year, in Washington, D.C., while using a sensory-deprivation tank.) This part of the movement includes gonzo self-experimenters, transhumanists seeking to extend their life spans, and people eager to become cyborgs—by, say, implanting microchips in their arms which contain their medical records. One person I spoke to called this cohort the “You did  what?” crowd. Another said that such people followed a credo of “because it’s cool, and because we can.”\n Perhaps the best known of these edgier types is Josiah Zayner, a biohacking entrepreneur with a Ph.D. in biophysics from the University of Chicago, a cheeky public persona, and a slyly contentious relationship with regulatory authorities. In 2017, Zayner live-streamed his self-injection of   gene-editing technology, which was an attempt to enhance his muscles. (It didn’t work.) He also documented a self-experiment in which he transplanted matter from a friend’s donated stool into his gut, thus altering his microbiome. He now has a company, the Odin, which sells mail-order kits that allow you to try your hand at  , make glow-in-the-dark yeast, and genetically engineer tree frogs. Zayner seems to embrace the idea that the only interesting scientist is a mad one.\n  Last August, at a conference in Las Vegas called Biohack the Planet, Zayner gave a speech in which he noted that, in such nearby countries as the Dominican Republic, there were many desperate patients who’d be willing to try any kind of experimental gene therapy, even if there was a good chance that it would kill them. D.I.Y. radicals, he suggested, should perform tests on this population. “Why fight against the U.S. government when you can just, you know, fly a couple hours, and you don’t have to fight against  any government?” he said.\n Big Pharma makes a tempting target for some biohacking provocateurs. At the Biohack the Planet conference, a man named Gabriel Licina sat on the edge of the stage and gave a pugnacious talk about a project that he and two friends—Andreas Stürmer, a biotechnologist in Austria, and David Ishee, an oil worker, self-taught biologist, and dog breeder in Mississippi—had embarked on. They had, he announced, reverse engineered the gene-therapy drug Glybera, which treats a rare disease, called lipoprotein-lipase deficiency, that results in a dangerous buildup of triglycerides in the blood.\n Licina is famous in the biohacking community for a self-experiment he undertook in 2015, with eye drops of his own devising, to create “night vision.” (The drops contained Chlorin e6, a light-sensitive substance similar to one found in sea creatures.) If you Google his name, you’ll discover photographs of him with his pupils dilated, his eyelids swollen, and his head shaved, looking like an extraterrestrial. He says that he saw farther at night for a few hours and suffered no lasting damage.\n  When the Dutch firm UniQure introduced Glybera, in 2015, it was the most expensive medication in the world, at about a million dollars a dose. Two years later, UniQure pulled Glybera from the market, because only one insurer, in Germany, would cover it—for one patient. (Approximately one in a million people have lipoprotein-lipase deficiency.) In Las Vegas, Licina said that he and his colleagues had identified the relevant DNA, sent their findings to an outside genetics lab, and engineered  E. coli to produce the protein that is missing in people who suffer from the disease. (The process is similar to how insulin is made.) Licina announced that he had brought forty vials of the modified bacteria to the conference, and he periodically waved one above his head, chuckling. He invited scientists to culture, purify, and test his creation. But, knowing his audience’s penchant for self-experimentation, he said, “Do  not inject yourself with this thing. For the love of God, stop stabbing yourselves.”\n In February, I spoke to Licina on the phone. He was in South Bend, Indiana, where he runs a community lab, Scihouse, out of his home. “This is going to sound so flippant,” he said. “But my friends and I decided to do the Glybera thing because we thought it would be  funny. I mean, this was a million-dollar drug.” Yet even its secrets were unlocked with relative ease, he claimed. (UniQure, which retains a patent on the drug, said that it was blindsided by Licina’s “knockoff” but has not sued.) Licina said that he doesn’t want anyone to use his creation therapeutically. He just wanted biohackers like him to stop making glow-in-the-dark beer—yes, that’s a thing—and focus their thrill-seeking minds on more substantive projects. He was pleased when two Stanford undergraduates, Alec Luiz Lourenco and Cooper Veit, volunteered to test his version of Glybera at a university lab. Lourenco and Veit are part of  , a student group that takes inspiration from the D.I.Y. movement and pursues what Lourenco calls “independent-type” biological research. (The   project is pending, having been delayed by the pandemic shutdown.)\n In many ways, the earnest, democratizing amateurism of community labs feels nothing like the snarky, performative energy projected by biohackers. The people I spoke with at Open Insulin are modest, serious, and, in some cases, steeped in social-justice activism. Still, there is overlap between members of the two factions—they know one another, attend some of the same conferences, and share a belief that real science can be conducted outside institutional settings. And they are similarly committed to making their protocols and findings transparent. One of Open Insulin’s founders, Anthony Di Franco—a computer scientist who lives in Berkeley and is himself a Type 1 diabetic—told me that, though he thinks of Open Insulin as belonging to the “lineage of mutual-aid societies,” he also sees the group as “definitely part of the biohacking community.”\n The D.I.Y.-bio movement first emerged in places where biotech was booming, like Cambridge, Massachusetts, and the Bay Area. Some people who lacked the funding or the credentials required to work on biological research at the academic and corporate labs where it was being done began to equip themselves. Others wanted to demonstrate that high-level medical information and techniques  could be shared. In 2008, Kay Aull had just graduated fr\n......", "posttime": "2020-05-20 03:02:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流氓,rogue,实验室", "title": "“流氓实验者”", "title_en": "The Rogue Experimenters", "transed": 1, "url": "https://www.newyorker.com/magazine/2020/05/25/the-rogue-experimenters", "via": "", "real_tags": ["流氓", "rogue", "实验室"]}, {"category": "", "categoryclass": "", "imagename": "9fa5e4031f58114a7e8e8b8c3299cbab.jpg", "infoid": 1002846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "喜剧演员、世界上最受欢迎的播客之一的主持人乔·罗根(Joe Rogan)将他的节目带到了Spotify上。乔·罗根的体验很快就会成为Spotify的独家节目，这意味着从今年晚些时候开始，剧集的完整音频和视频只能通过该平台提供。到目前为止，罗根的节目从未在Spotify上观看过，更不用说在任何平台上独家提供了。\n该节目将于9月1日开始在Spotify全球播出，之后将成为独家节目。听众不需要付费观看剧集，但他们必须成为Spotify用户。Spotify在一份新闻稿中表示，罗根保留了对他的节目的创意控制权。该公司没有透露在这笔交易上花费了多少钱。该公司还将与一家广告代理公司合作，联合销售针对该计划的广告。罗根说，去年他的节目每月下载量约为1.9亿次。\n罗根的YouTube频道将继续直播，但不会包含全集。可能有一些片段或其他补充内容可以受益于YouTube的搜索算法，并推动人们在Spotify上收听整集。\n这对Spotify来说是一个巨大的收获，它已经将播客作为核心关注点。它去年收购了Gimlet Media、Anchor和Parcast，最初是这样做的，然后又签署了更多Spotify独家协议。它与奥巴马夫妇的制作公司独家合作，并致力于与乔·巴登(Joe Budden)和艾米·舒默(Amy Schumer)等其他大牌公司进行交易，并收购了The Ringer。\n尽管独家交易似乎是该公司获取听众的主要策略，但Spotify并没有立即将Gimlet节目转向独家模式。取而代之的是，它制作了辅助的独家内容，如Gimlet Academy和额外回复所有剧集，同时保持现有节目的广泛可用。在这种情况下，该公司似乎会相对较快地采取行动，让Rogan成为仅限Spotify使用的产品。\nSpotify的播客野心总是直接针对苹果，到目前为止，苹果一直是播客播放器中最大的名字。但随着与罗根的交易，Spotify还有另一个新目标：YouTube。本月早些时候，当它开始测试其视频播客功能时，它得到了两个广受欢迎的YouTuber的支持。罗根是最受欢迎的YouTube播客之一，通常每集都有数百万人观看，所以在这个平台上失声对YouTube来说是一大成功，对Spotify来说也是一大收获。", "note_en": "Joe Rogan, comedian and host of one of the most popular podcasts in the world, is taking his show to Spotify.  The Joe Rogan Experience will soon become  a Spotify exclusive, meaning episodes’ full audio and video will only be available through the platform starting later this year. Up until now, Rogan’s show has never been available on Spotify, let alone exclusive to any platform.\n The show will become available on Spotify globally starting on September 1st, and it’ll become an exclusive sometime after that point. Listeners won’t have to pay to access the episodes, but they will have to become Spotify users. Spotify said in a press release that Rogan retains creative control over his show. It didn’t disclose how much it spent on the deal. The company will also work with an ad agency to jointly sell ads against the program. Rogan  said last year his show reached about 190 million downloads a month.\n Rogan’s YouTube channel will remain live, but it won’t contain full episodes. There might be clips or other supplementary content which could benefit from YouTube’s search algorithm and push people to listen to full episodes on Spotify.\n  This is a massive get for Spotify, which has made podcasting a core focus. It acquired Gimlet Media, Anchor, and Parcast last year, to start, and then signed more Spotify-exclusive deals. It’s working with  the Obamas’ production company exclusively and committed to deals with other big names, like Joe Budden and Amy Schumer, and acquired The Ringer.\n Although exclusive deals seem to be the company’s main listener acquisition strategy, Spotify didn’t immediately move Gimlet shows to an exclusive model. Instead, it produced ancillary, exclusive content like  Gimlet Academy and extra  Reply All episodes while keeping existing shows widely available. In this case, the company will seemingly move relatively quickly to make Rogan a Spotify-only offering.\n  Spotify’s podcast ambitions always directly targeted Apple, which, up until now, has been the biggest name in podcast players. But with the Rogan deal, Spotify also has another new target: YouTube. When it  began testing its video podcasting feature earlier this month, it did so with the backing of two popular YouTubers. Rogan is one of the  most popular YouTube podcasters, often with millions of people watching each episode, so losing his voice on the platform is a major hit to YouTube and a big gain for Spotify.", "posttime": "2020-05-20 02:45:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "播客,rogan,spotify", "title": "乔·罗根的播客正在成为Spotify的独家节目", "title_en": "Joe Rogan’s podcast is becoming a Spotify exclusive", "transed": 1, "url": "https://www.theverge.com/2020/5/19/21263927/joe-rogan-spotify-experience-exclusive-content-episodes-youtube", "via": "", "real_tags": ["播客", "rogan", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "d4c22fc52cc7edc4b788f9d16d23ace2.png", "infoid": 1002845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "H&Co为印刷、网络和移动环境设计字体。", "note_en": "H&Co designs fonts for print, web, and mobile environments.", "posttime": "2020-05-20 02:45:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字体,proofing,网络", "title": "校对字体的文本：告别快速棕色狐狸", "title_en": "Text for Proofing Fonts: A Farewell to the Quick Brown Fox", "transed": 1, "url": "https://www.typography.com/blog/text-for-proofing-fonts", "via": "", "real_tags": ["字体", "proofing", "网络"]}, {"category": "", "categoryclass": "", "imagename": "a99ef22e15973332db25d38aa3b6f101.png", "infoid": 1002844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌今天发布了其Chrome网络浏览器83版，这是自2009年该浏览器首次发布以来发布的功能最丰富的Chrome更新之一。\n今天发布的v83版本包含了一系列新功能。其中包括增强的隐私控制、用于管理cookie文件的新设置、新的安全检查选项、对选项卡组的支持、Web表单元素的新图形、用于检测条形码的新API以及新的反XSS安全功能等等。\nChrome83包含如此多功能的原因是由于持续的冠状病毒流行，Google取消了Chrome82的发布。\n因此，Chrome82的一些功能被推到了Chrome83上，而其他功能则被重新安排在今年晚些时候。\nChrome用户现在可以通过访问Chrome-&&gt;；帮助-&gt；关于Google Chrome部分(chrome：//settings/help)立即更新到Chrome 83版本。\n新的选项卡组功能允许用户在选项卡栏上将选项卡组织成小组。选项卡组可以着色、重命名和在选项卡栏中移动，以帮助用户一起管理不同的工作区。在未来的版本中，谷歌计划让用户折叠选项卡组，这样用户就可以为当前的选项卡节省选项卡栏上的空间，帮助用户更好地集中注意力。\nChrome 83也是第一个Chrome版本，现在Chrome设置页面中有一个部分，允许用户按站点管理和删除cookie，这一功能到目前为止只对Firefox用户可用。为用户提供逐个站点删除Cookie的能力，使用户无需清除所有站点上的Cookie即可调试中断的登录体验，并中断现有的身份验证会话。\n从Chrome83开始，浏览器的隐姓埋名(私人浏览)模式现在有一个选项，可以让用户屏蔽第三方cookie。阻止第三方Cookie通过阻止在线广告商通过Cookie文件跟踪用户来保护用户隐私。\nGoogle在Chrome 83中的Chrome-&gt；Settings-&gt；Privacy and Security(Chrome：//Settings/Privacy)下添加了一个新的安全检查选项。这款新工具会扫描Chrome是否在运行最新版本，检查用户的密码是否在在线入侵中被泄露，安全浏览服务是否已启用并正在运行，以及用户是否在此设备上安装了任何恶意扩展。\n谷歌还在Chrome设置页面增加了另一个新的部分，让用户可以管理安全的浏览保护。更具体地说，现在有了增强的安全浏览模式，可以为用户提供更主动和量身定制的保护，使其免受网络钓鱼、恶意软件和其他基于网络的威胁。\nChrome83为Chrome内部的网页表单元素带来了新的面貌。新的用户界面是微软工程师在微软将Edge转移到Chromium引擎后开发的，最初计划与Chrome81一起发布，但由于持续的流行病而推迟到Chrome83发布。下面是大多数网络和联系人表单未来的样子。\n从Chrome83开始，所有的扩展现在都是通过Chrome工具栏上的一个按钮来管理的，而不是有自己的按钮。用户仍然可以将他们最喜欢的扩展固定在Chrome工具栏上，但是所有新安装的扩展都将首先出现在新的扩展图标下。\nChrome现在支持条形码检测API，这是形状检测API的一个子集，能够检测和解码提供给浏览器的图像中的条形码。这将允许Chrome扩展开发者直接使用Chrome内置的技术创建条形码读取应用程序。\n2019年7月，谷歌移除了经典的XSS Auditor工具，该工具作为抵御XSS(跨站点脚本)攻击的安全功能。当时，谷歌工程师表示，他们正计划以新的可信类型API的形式添加一个替代品。Chrome83是第一个支持这一新API的Chrome版本，据说它可以保护网站免受经典的XSS攻击。\n在Chrome83中，Google在Chrome设置面板中添加了一个选项，用户可以在其中轻松使用，启用对HTTPS(DoH)协议的DNS支持。此选项位于Chrome-&gt；Settings-&gt；Privacy and Security(Chrome：//Settings/Privacy)下的高级部分的所有设置下。\n启用第一个选项的用户将使用Chrome的内置DoH机制。这是通过获取用户的操作系统DNS服务器并查找DoH接口来实现的。如果DNS服务器提供DoH替代，Chrome将使用DoH接口作为默认DNS查询机制。此页上提供了此受支持服务器的列表。\n如果用户选择第二个选项，他们将能够进入自定义DoH解析器，并使用该解析器匿名他们的DNS查询。第二个选项将覆盖操作系统级别和组织级别的DNS设置。更多信息请看这里。\n从Chrome83开始，Chrome现在将阻止沙盒iframe启动文件下载操作。沙盒iframe经常被用来加载广告，这一措施可以防止恶意广告(也称为恶意广告)在用户设备上强制下载恶意软件。\n谷歌表示，从今天开始，当用户从通过HTTPS加载的网站发起文件下载时，Chrome将阻止通过HTTP进行的文件下载。\n这家浏览器制造商去年表示，它不打算屏蔽从HTTP网站开始的HTTP下载，因为Chrome已经通过地址栏中的不安全指示器警告用户该网站的安全性较差。\n我们的计划是阻止那些看似安全(通过HTTPS加载)但下载内容不是(通过HTTP加载)的网站上的不安全下载。谷歌表示，网站URL中出现的HTTPS欺骗了用户，让他们认为下载也是通过HTTPS进行的，但在某些情况下并非如此。\n但我们只涉及了Chrome83的主要新增功能。想要了解Chrome83版本中添加或删除的其他功能的用户可以查看以下链接以获取更多信息。", "note_en": "Google has released today version 83 of its Chrome web browser, one of the most feature-packed Chrome updates released since the browser&#39;s initial launch back in 2009.\n Today&#39;s v83 release includes a slew of new features. These include enhanced privacy controls, new settings for managing cookie files, a new Safety Check option, support for tab groups, new graphics for web form elements, a new API for detecting barcodes, and a new anti-XSS security feature, among many many others.\n The reason why Chrome 83 includes so many features is because  Google canceled the Chrome 82 release due to the ongoing coronavirus pandemic.\n As a result, some of the Chrome 82 features were pushed into Chrome 83, while others were rescheduled for later this year.\n    Chrome users can update to the Chrome 83 version right now by visiting the  Chrome -&gt;  Help -&gt;  About Google Chrome section (  chrome://settings/help).\n  The  new Tab Groups feature lets users organize tabs into small groups on the tab bar. Tab groups can be colorized, renamed, and moved around the tab bar to help users manage different workspaces together. In future versions, Google plans to let users collapse tab groups so users can save space on their tab bar for their current tabs and help users focus better.\n     Chrome 83 is also the first Chrome version that now features a section in the Chrome settings page that lets users  manage and delete cookies on a per-site basis, a feature that until now has only been available to Firefox users. Giving users the ability to delete a cookie on a per-site basis lets users debug broken login experiences without having to clear cookies on all sites, and break existing authenticated sessions.\n    Starting with Chrome 83, the browser&#39;s incognito (private browsing) mode now features an option that lets users block third-party cookies. Blocking third-party cookies preserve user privacy by preventing online advertisers from tracking users via cookies file.\n   Google added in Chrome 83 a new &#34; Safety Check&#34; option under  Chrome -&gt;  Settings -&gt;  Privacy and security (  chrome://settings/privacy). The new tool scans if Chrome is running the latest version, checks if the user&#39;s passwords have been compromised in breaches online, if the Safe Browsing service is enabled and running, and if the user has any malicious extensions installed on this device.\n   Google has also added another new section in the Chrome settings page that lets users manage the Safe Browsing protections. More specifically, there is now an Enhanced Safe Browsing mode that gives users more proactive and tailored protections from phishing, malware and other web-based threats.\n    Chrome 83 brings a new look for how web form elements look inside Chrome.  The new UI was developed by Microsoft engineers after Microsoft moved Edge to the Chromium engine and was initially scheduled to be released with Chrome 81, only to be delayed for Chrome 83 due to the ongoing pandemic. Below is an image of how most web and contact forms will look going forward.\n   Starting with Chrome 83, all extensions are now managed through one single button on the Chrome toolbar, rather than having their own buttons. Users will still be able to pin their favorite extensions to the Chrome toolbar, but all newly installed extensions will first appear under the new extensions &#34;puzzle&#34; icon going forward.\n   Chrome now supports the  Barcode Detection API, a subset of the Shape Detection API which provides the ability to detect and decode barcodes in an image provided to the browser. This will allow Chrome extension developers to create barcode reading apps using technologies built into Chrome directly.\n  In July 2019,  Google removed the classic XSS Auditor tool that worked as a security feature against XSS (cross-site scripting) attacks. At the time, Google engineers said they were planning to add a replacement in the form of a  new Trusted Types API. Chrome 83 is the first Chrome version to support this new API, which is said to safeguard sites against classic XSS attacks.\n   In Chrome 83, Google has added an option in the Chrome settings panel where users can use easily enable support for the DNS-over-HTTPS (DoH) protocol. This option can be found at under  Chrome -&gt;  Settings -&gt;  Privacy and security (  chrome://settings/privacy), in the  Advanced section, below all settings.\n Users who enable the first option will use Chrome&#39;s built-in DoH mechanism. This works by taking the user&#39;s operating system DNS servers, and looking for a DoH interface. If the DNS server provides a DoH alternative, Chrome will use the DoH interfaceas the default DNS query mechanism. This list of supported servers is available  on this page.\n If users select the second option, they&#39;ll be able to enter a custom DoH resolver, and use that one to anonymize their DNS queries. This second option will overwrite OS-level and organization-level DNS settings. More  here.\n   Starting with Chrome 83, Chrome will now  block sandboxed iframes from initiating a file download action. Sandboxed iframes are often utilized to load ads, and this measure prevents malicious ads (also known as malvertising) from forcefully downloading malware on users&#39; devices.\n  Starting today, Google says Chrome will  block file downloads that take place via HTTP, when the user initiated the file download from a site loaded via HTTPS.\n  The browser maker said last year it did not intend to block HTTP downloads started from HTTP sites, since Chrome is already warning users about the site&#39;s poor security via the &#34;Not Secure&#34; indicator in the URL bar.\n The plan is to block insecure downloads on sites that appear to be secure (loaded via HTTPS) but where the downloads aren&#39;t (loaded via HTTP). Google said that the presence of the HTTPS in the site&#39;s URL was tricking users into thinking the download was also via HTTPS, but in some cases it was not.\n   But we only touched on the major Chrome 83 additions. Users who&#39;d like to learn more about the other features added or removed from the Chrome 83 release can check out the following links for more information.", "posttime": "2020-05-20 02:30:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,chrome,groups", "title": "发布的Chrome 83具有增强的隐私控制、选项卡组功能", "title_en": "Chrome 83 Released With Enhanced Privacy Controls, Tab Groups Feature", "transed": 1, "url": "https://www.zdnet.com/article/chrome-83-released-with-enhanced-privacy-controls-tab-groups-feature/", "via": "", "real_tags": ["发布", "chrome", "groups"]}, {"category": "", "categoryclass": "", "imagename": "5a3335841a27194b0c6081e49dbeb835.jpg", "infoid": 1002843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到导航跳跃搜索半球燃烧室是具有圆顶气缸盖的往复式内燃机的一种燃烧室类型。以这种半球形燃烧室为特色的发动机被称为半发动机。\n在证明了内燃机概念之后不久，在一些最早的汽车发动机上引入了半球形燃烧室。它们的名字反映了圆顶气缸盖的概念，活塞的顶部包围了大约半个球体(半+球体+-球体)的空间，尽管在实践中通常不到一半。\n半球气缸盖至少从1901年就开始使用了；[1]比利时汽车制造商PIPE在1905年[2]和1907年的菲亚特130马力大奖赛车手都使用了半球气缸盖。[3]1912年的标致大奖赛(Peugeot Grand Prix)和1914年的阿尔法·罗密欧(Alfa Romeo)大奖赛车都是四气门发动机，戴姆勒(Daimler)和莱利(Riley)也使用半球燃烧室。斯图兹从1912年开始使用四气门发动机，[4]从概念上预见了现代汽车发动机。其他例子包括宝马双推杆设计(布里斯托尔汽车采用)，标致403，丰田T发动机，丰田V发动机(丰田的第一个V8发动机)，米勒赛车发动机，以及捷豹XK发动机。[5]。\n半球形头部(半球形头部)提供了一个高效的燃烧室，头部的热损失最小，并允许两个大阀门。然而，由于难以将四个气门的配气机构布置成分流角度，半封头通常每个气缸不允许超过两个气门，而且这些大气门必然比具有相似气门面积的多气门发动机的气门重，而且通常需要更多的气门升程。进气阀和排气阀位于腔室的相对两侧，必须采用横流头部设计。由于燃烧室实际上是一个半球，除非使用较小的燃烧室，否则平顶活塞会产生较低的压缩比。\n使用半球形气室的发动机商业化的重大挑战围绕着气门驱动的设计，以及如何以可接受的成本使其有效、高效和可靠。[需要引用]克莱斯勒在20世纪50年代开发半发动机时就提到了这种复杂性：在公司广告中，这种头被称为双摇杆头。[2]。\n虽然楔形头部结构简化了阀门的驱动，但通常是通过将阀门并排放置在阀腔内，阀杆轴线平行来实现的。这可以通过将阀头直径的总和限制在每个气缸两个气门的布置中不超过气缸的内径，来限制进气和排气流入和流出室。对于带有张开阀杆角度的半球形腔体，这一限制随角度增加，使得在顶置阀门配置中，阀门总径尺寸有可能超过内径尺寸。另一种方法请参见IOE引擎。\n此外，张开的气门角度会导致气门座平面倾斜，从而使进排气进入/离开气缸盖的端口有更直的流动路径。工程师们已经了解到，虽然增加阀口更直的尺寸有利于提高高转速下的最大功率，但它会减缓进气流速，在正常转速范围内无法提供最佳的排放、效率或功率燃烧事件。\n圆顶活塞通常用于保持较高的机械压缩比，这往往会增加火焰传播距离，也不利于高效燃烧，除非增加每个气缸的火花塞数量。\n火焰温度非常高，导致NOx排放量过高，这可能需要废气再循环和其他排放控制措施来满足现代标准。半球形腔的其他缺点包括增加生产成本和较高的相对重量(根据克莱斯勒的工程师的说法，比可比的楔形头重25%[6])。这些在现代已经使半头失去了青睐，直到克莱斯勒2003年的重新设计被证明是受欢迎的。\nSOHC切面显示横流设计、腔体的半球形形状、顶置凸轮的中心位置以及摇杆轴带侧翼支撑的顶置凸轮的中心位置。\n半引擎需要更复杂、数量更多的部件。上图为一对半头的双摇杆系统及其复杂的活塞铸件。下图为一对楔头的可比部件。\n半圆设计的一个主要缺点在这里是显而易见的-相对于整体发动机尺寸而言，头部铸件较大。横向流头所需的敞开式阀门需要较宽的铸件，这需要较大的发动机间隔。工程师们正在寻求缩小和减小车辆和为其提供动力的发动机的尺寸。\n阿尔法·罗密欧多年来一直在生产成功的半头发动机。可以说，他们最喜爱的例子之一是朱塞佩·巴索(Giuseppe Busso)最初的2.5升V6发动机，它被一些人称为有史以来最好、最独特的探空生产发动机之一(即使是后24V的形式)。[7]这种赞誉的部分原因可能是因为原来的2气门发动机的半球形头部允许几乎完全直的排气口，从而减少了发动机声音的稀释或混浊，使阿尔法罗密欧能够使用更安静的排气，而不会损失他们独特的、深受喜爱的种族培育的发动机噪音。\n阿斯顿·马丁著名的DOHC(4个凸轮)V8在20世纪60年代末到80年代末使用了半球形的燃烧室。每个凸轮控制一组气门，要么是一组进气阀，要么是一组排气阀。阿斯顿马丁V8 5.3L(5340毫升/325英寸3)产生了315马力(235千瓦)。\n也许最广为人知的半球形腔体设计的支持者是克莱斯勒公司。从20世纪60年代开始，克莱斯勒主要是通过为赫米这个名字注册商标，然后在他们的广告活动中广泛使用它而被识别出来的。克莱斯勒已经生产了三代这样的发动机：第一代(克莱斯勒火力发动机)在20世纪50年代，第二代(426 Hemi)于1964年为纳斯卡(NASCAR)开发，并一直生产到20世纪70年代初，最后一代是21世纪初的新型HEMI。目前，克莱斯勒生产4种不同型号的Hemi发动机：5.7L，根据配置的不同，扭矩在360-395马力和390-407lb*ft(529-552N*m)之间，6.4L(也称为392立方英寸)，485马力和475百万磅⋅ft(644N⋅m)扭矩，6.4L(不同)6.4L，410马力和425亿磅⋅ft(576。以及6.2L增压发动机(俗称地狱猫)，可产生707马力和650亿磅⋅ft(881N⋅m)的扭矩。\n克莱斯勒还在澳大利亚发布了一款半球形6，带有非全球形腔体，但生产线顶部4.3L，265立方英寸电机制造了302马力(225千瓦)。他们出来的结果是215 120马力245 160马力265(STD)203马力。\n阿登为福特平头设计的头部可能是第一次在现成的美国V8发动机上使用半球形头部。[8]1947年作为售后产品首次上市，这些头部将福特平板头改装成在半球室中操作的头顶阀门。佐拉·阿库斯·邓托夫(Zora Arkus-Duntov)后来在通用汽车工作，是雪佛兰克尔维特(Chevrolet Corvette)开发的主要推动者，他和他的兄弟尤拉(Yura)是阿登的兄弟。\n福特在20世纪60年代中期生产了一种带有两个顶置凸轮(每个头部一个凸轮)和半球形燃烧室的发动机。这款发动机排水量为425立方英寸，属于福特FE系列发动机，被称为427SOHC；也被称为Cammer。这是一组SOHC半头螺栓固定在福特的FE发动机机体上。1964年的发动机是为赛车而设计的，经过90天的密集工程努力[9]。427SOHC使用侧注油器发动机块稍作修改，以处理丢失的块内凸轮，以及其他OHC问题。[9]由于他们的动力水平，而且克莱斯勒已经向比尔·法兰西展示了一辆DOHC426HEMI正在制造中，这款车被禁止参加纳斯卡比赛，尽管它在某些飙车级别是允许的。在纳斯卡被禁止后，福特继续生产SOHC，在柜台上出售给赛车手和其他人[10]，他们用它为许多改装的轴距A/FX野马和增压顶级燃料拖拉机提供动力。康妮·卡利塔(Connie Kalitta)、皮特·罗宾逊(Pete Robinson)和斯内克·普鲁德霍姆(Prudhomme)都在他们的顶级燃料赛车中使用了这种发动机。1967年，康妮·卡利塔(Connie Kalitta)的SOHC-Powered&34；赏金猎人(Bounty Hunter)在AHRA、NHRA和NASCAR冬季运动会上获得了最高燃油荣誉，成为飙车历史上唯一的三冠王。[11]当天的测功机结果显示，SOHC Hemi以板条箱形式(每升100马力)生产近700马力(522千瓦)。[12]头顶的凸轮意味着它不会像克莱斯勒的海米那样有转速限制，因为他们有推杆和沉重而复杂的配气机构。[13]。\n后来福特设计的带有半球形室的发动机包括Calliope，它使用两个块内凸轮，一个在另一个之上布置，以驱动每个半球形室3个气门。[14]从顶部凸轮轴启动阀门的推杆几乎是水平的。1968年，福特推出了一个全新的发动机系列，名为385系列。这台发动机的头部使用了一种改进型的半球形燃烧室，称为半半球室(Semi-hemi)。[15]。\n20世纪70年代，福特设计并生产了半球形头部的小块发动机，以解决人们对燃油经济性日益增长的担忧。不幸的是，即使采用了先进的直接燃油喷射系统为分层充气室提供燃料，半排废气的排放也不能做到足够清洁，不符合法规的要求。[16][17][16][17]半壁江山的排放不足以符合法规的要求。这加上阀门驱动系统的成本，以及将燃料直接输送到腔内所需的高压泵的成本，以及驱动泵所需的吉尔默皮带驱动系统，使得进一步的开发在当时变得毫无意义。大多数20世纪80年代的4缸福特使用福特CVH发动机，CVH的意思是复合阀，半球形(头部)&34；。\n从1949年开始，捷豹在传奇的XK发动机上使用了这种头部设计，这些发动机为从勒芒(Le Mans)获胜的D型到XJ6的各种汽车提供动力。[18]。\n莲花在他们的一些发动机中使用了半球形的腔室(见右图)。这种燃烧室中可能存在的相对较大的阀门允许大量的空气-燃料混合物快速进出燃烧室，但并不总是完全燃烧。\n半球形燃烧室是1980年推出的M102发动机的一个特点，与横向流头设计一起提高了它取代的M115发动机的效率。[19]。\n位于泰晤士河畔阿宾登的MG工厂从1958年到1960年生产了推杆MGA1600MkI MG MGA生产线的Twin-Cam变体。原推杆1588cc铸铁缸体采用铸铝双凸轮气缸盖，每个气缸各有一个进、排气门。这种配置使得能够在燃烧室内实现横流半头部循环，从而能够改善呼吸(容积效率)以及利用扩大的阀门和圆顶活塞。早期的版本在街上和竞争中被证明是脆弱的，因为预燃(爆炸)和石油损失，导致压缩比从9.1降低。用重新设计的活塞提高到8.3。这是一次成功的更新，但销量下降如此之快，以至于公司停止了Twin Cam的生产，并将匹配的底盘用于一些MGA，配备推杆发动机，被称为MGA 1600MkI和MkII豪华车型。\n保时捷广泛使用了半头发动机，包括1963-1999年保时捷911车型的风冷Flat-6发动机。1973年2.7亿升的版本每自然吸气式活塞排量产生56万马力。[20]。\n丰田汽车公司的V系列发动机是纵向安装的V8发动机设计。它们从20世纪60年代一直使用到90年代。V系列发动机用于享有盛誉的丰田世纪。丰田与雅马哈合作生产了第一台日本全铝合金机体发动机。V系列经常被称为丰田HEMI，因为该发动机的气缸盖设计与克莱斯勒的Hemi相似，尽管大多数发动机设计完全不同。\nV2.6L发动机于1964年至1967年首次用于皇冠8，作为第二代皇冠系列的一部分。此后，皇冠八号被高档的丰田世纪牌(Toyota Century)所取代。\n3V，4V和5V发动机一直在丰田世纪使用，直到1997年，丰田进行了彻底的重新设计，获得了5.0L 1GZ-FE V12。\nV系列发动机，如丰田汽车公司的几款发动机(如2T-C、2M、4M等)。当时有一个半球形的燃烧室。火花塞位于燃烧室的顶部。\n在现代排放时代，半室内已经开始远离持续发展。半球形燃烧室是最简单、最容易的设计。一个多世纪以来，它一直是内燃机的基本设计，所有其他的改进和工程发展都是从它衍生出来的。随着新发动机所涉及的技术的改进和发展，真正的半球燃烧室已经变形和扭曲成更复杂和更复杂的设计，旨在从任何给定的燃烧事件中提取更多的能量和更低的排放。\n今天的许多发动机都使用主动燃烧室，旨在使燃烧室内的燃料/空气混合物翻滚和旋转，以实现最有效的燃烧事件。[21]这些活动腔通常看起来像四季豆或两个合并的小区域，由活塞上方的平面淬火区域包围。[22]。\n^Curtis Boat&Amp；木工公司1901年由Truscott Launch and Engine Company制造的HEMI发动机，密歇根州圣约瑟夫。由密西西比州切尔西市切尔西制造公司的赫米发明家艾莉·雷·韦尔奇(Allie Ray Welch)设计。CurtisBoat.com。2009年09月25日。网址：http://www.curtisboat.com/hemi_prototype.html.。访问时间：2009-09-25。(由网站https://www.webcitation.org/5k4B8p3aw)存档\n美国半身人起源的历史。Webcitation.org.。2007年10月12日从原件存档。\n迈克·穆勒(2006)。美国马力：百年伟大的汽车发动机。MBI出版公司。第112页，113页。ISBN电话：978-0-7603-2327-4。\n迈克·穆勒(2006)。美国马力：百年伟大的汽车发动机。MBI出版公司。42页。ISBN电话：978-0-7603-2327-4。\n福特427SOHC&34；的历史。Webcitation.org.。2008年3月26日从原件存档。\n史蒂夫·马格南特(Steve Magnante)“沼泽鼠巢内”(Inside the Swamp Rate‘s Nest)，“街头罗德高级杂志”(Street Rodder Premium Magazine)，第2卷第2期，2011年冬季|第52页。\n书名/作者The Flammang，James M.编辑。(2005年)。肌肉车编年史。出版国际。第2168页。ISBN为9781412712019。\n^Genat，Robert(2007)。赫米：终极美国V-8。MBI出版公司。第14页。ISBN电话：978-0-7603-2747-0。\n书名/作者The Flammang，James M.编辑。(2005年)。肌肉车编年史。出版国际。第214页。ISBN为9781412712019。\n“美洲豹的历史”(^&#34；A History of Jaguar DOHC&34；)。Webcitation.org.。2008年2月6日从原件存档。\n^Long，Brian(2015)。梅赛德斯-奔驰W123系列：所有型号1976至1986年。韦洛斯出版公司(Veloce Publishing)。第114页。ISBN电话：978-1-8458-4792-0。\n^Genat，Robert(2007)。赫米：终极美国V-8。MBI出版公司。第13页。ISBN电话：978-0-7603-2747-0。\n淬火翻滚和漩涡。Webcitation.org.。2010年5月5日从原件存档。", "note_en": "Jump to navigation  Jump to search  A  hemispherical combustion chamber is a type of  combustion chamber in a reciprocating  internal combustion engine with a domed  cylinder head. An engine featuring this type of hemispherical chamber is known as a  hemi engine.\n    Hemispherical combustion chambers were introduced on some of the earliest automotive engines, shortly after proving the concept of internal combustion engines themselves. Their name reflects the  concept of a domed  cylinder head and the top of the  piston enclosing a space that approximates a half of a  sphere (  hemi- +   -sphere +   -ical), although in practice it is generally less than half.\n Hemispherical cylinder heads have been used since at least 1901;  [1] they were used by the  Belgian car maker  Pipe in 1905  [2] and the 1907  Fiat 130 HP Grand Prix racer.  [3] The  Peugeot Grand Prix Car of 1912 and the  Alfa Romeo Grand Prix car of 1914 both were four valve engines also,  Daimler, and  Riley were also using hemispherical combustion chambers.  Stutz, beginning in 1912, used four-valve engines,  [4] conceptually anticipating modern car engines. Other examples include the  BMW double-pushrod design (adopted by  Bristol Cars), the  Peugeot 403, the  Toyota T engine, and  Toyota V engine (Toyota&#39;s first V8 engine), and  Miller racing engines, and the  Jaguar XK engine.  [5]\n  A hemispherical  head (&#34;hemi-head&#34;) gives an efficient combustion chamber with minimal heat loss to the head, and allows for two large  valves. However, a hemi-head usually allows no more than two valves per cylinder due to the difficulty in arranging the valve gear for four valves at diverging angles, and these large valves are necessarily heavier than those in a  multi-valve engine of similar valve area, as well as generally requiring more valve lift. The intake and exhaust valves lie on opposite sides of the chamber and necessitate a &#34; cross-flow&#34; head design. Since the combustion chamber is virtually a hemisphere, a flat-topped piston yields a lower compression ratio unless a smaller chamber is utilized.\n Significant challenges in the commercialization of engines utilizing hemispherical chambers revolved around the design of the valve actuation, and how to make it effective, efficient, and reliable at an acceptable cost. [   citation needed] This complexity was referenced early in Chrysler&#39;s development of their 1950s hemi engine: the head was referred to in company advertising as the  Double Rocker head.  [2]\n  Although a wedge-head design offers simplified valve actuation, it usually does so by placing the valves side by side within the chamber, with parallel stem axes. This can restrict the flow of the intake and exhaust into and out of the chamber by limiting the diameters of valve heads to total no more than the bore of the cylinder in a two valve per cylinder arrangement. With a hemispherical chamber with splayed valve stem angle, this limitation is increased by the angle, making the total valve diameter size possible to exceed the bore size within an  overhead valve configuration. See  IOE engine for another method.\n Also, the splayed valve angle causes the valve seat plane to be tilted, giving a straighter flow path for the intake and exhaust to/from the port exiting the cylinder head. Engineers have learned that while increasing the valve size with straighter port is beneficial for increasing the maximum power at high rpm, it slows the intake flow speed, not providing the best combustion event for emissions, efficiency, or power in the normal rpm range.\n Domed pistons are commonly used to maintain a higher mechanical compression ratio, which tend to increase the flame propagation distance, being also detrimental to efficient combustion, unless the number of spark plugs per cylinder is increased.\n Flame temperatures are very high, leading to excessive NOx output which may require  exhaust gas recirculation and other emission control measures to meet modern standards. Other drawbacks of the hemispherical chamber include increased production cost and high relative weight (25% heavier than a comparable wedge head according to  Chrysler&#39;s engineers  [6]). These had pushed the hemi head out of favor in the modern era, until Chrysler&#39;s 2003 redesign that has proven popular.\n  SOHC Cutaway showing cross-flow design, hemispherical shape of the chamber, center position of the overhead cam with flanking supports for the rocker shafts.\n The hemi engine requires parts of more complexity and quantities. Upper photos of double rocker system for a pair of Hemi heads and its complex piston casting. Lower photos of comparable parts for a pair of Wedge Heads.\n A major drawback of the hemi design is evident here— Large head castings relative to overall engine size. The splayed valves necessary for the crossflow head require a wider casting, which requires large engine bays. Engineers are looking to shrink and reduce the size of vehicles and the engines that power them.\n    Alfa Romeo has produced successful hemi-head engines throughout the years. Arguably one of their most beloved examples is  Giuseppe Busso&#39;s original  2.5-liter V6, which has been cited by some as one of the best and most distinctive sounding production engines (even in its latter 24v forms) of all time.  [7] Part of this praise is likely because the hemispherical heads on the original 2-valve engine allowed for an almost completely straight exhaust port, resulting in a less diluted or muddied engine sound, allowing Alfa Romeo to use quieter stock exhausts without losing much of their distinct and beloved race-bred engine noise.\n   Aston Martin&#39;s famous  DOHC (4 cams)  V8 used a hemispherical chamber during the late 1960s through to the late 1980s. Each cam controlled one set of valves, either a bank of intake valves or a bank of exhaust valves. The  Aston Martin V8 5.3 L (5340 cc/325 in 3) produced 315 hp (235 kW).\n   Perhaps the most widely known proponent of the hemispherical chamber design is the  Chrysler Corporation. Chrysler became identified primarily by trademarking the &#34;Hemi&#34; name and then using it extensively in their advertising campaigns beginning in the 1960s. Chrysler has produced three generations of such engines: the first (the  Chrysler FirePower engine) in the 1950s, the second (the  426 Hemi), developed for  NASCAR in 1964 and produced through the early 1970s, and finally the &#34;new HEMI&#34; in the early 2000s. Currently, Chrysler produces 4 variations of the Hemi engine: a 5.7 L that, depending on configuration, makes between 360 and 395 horsepower and 390-407 lb*ft (529-552 N*m) of torque, a 6.4 L (also known as the 392 cubic inch) that makes 485 horsepower and 475 lb⋅ft (644 N⋅m) of torque, a (different) 6.4L that makes 410 horsepower and 425 lb⋅ft (576 N⋅m) of torque, and a supercharged 6.2 L (commonly known as the Hellcat) that makes 707 horsepower and 650 lb⋅ft (881 N⋅m) of torque.\n Chrysler also released a hemi 6 in Australia with a non full hemispherical chamber but the top of the line 4.3 L, 265cubic inch motor made 302 hp (225 kW). They came out as 215 120 hp 245 160 hp 265(std) 203 hp.\n  Ardun heads for the  Ford flathead were perhaps the first use of a hemispherical head on a readily available American  V8.  [8] First offered in 1947 as an aftermarket product, these heads converted the  Ford flathead to overhead valves operating in a hemispherical chamber. Zora  Arkus- Duntov, who later worked for GM and was a major force behind the development of the  Chevrolet Corvette, and his brother Yura, were the &#34;AR&#34; &#34;DUN&#34; of &#34;Ardun.&#34;\n Ford produced an engine with two overhead cams (one cam per head) and hemispherical chambers in the mid-1960s. The engine, displacing 425 cubic inches and belonging to the  FE family of  Ford engines, was known as the &#34;427  SOHC&#34;; it was also known as the  Cammer. It was a set of SOHC hemi heads that bolted onto Ford&#39;s  FE engine block. The 1964 engine was designed in 90 days of intensive engineering effort  [9] for use in racing. The 427 SOHC used the side oiler engine block modified slightly to deal with the missing in-block cam among other  OHC issues.  [9] Because of their power levels, and the fact that Chrysler had showed Bill France that a DOHC 426 Hemi was in the works, it was banned from  NASCAR races, though allowed in certain drag racing classes. After the NASCAR ban, Ford continued to produce the SOHC, selling it over the counter to racers and others  [10] who used it to power many altered-wheelbase A/FX Mustangs and supercharged  Top Fuel dragsters.  Connie Kalitta, Pete Robinson, and  &#34;Snake&#34; Prudhomme all used the engine in their Top Fuel racers. In 1967 Connie Kalitta&#39;s SOHC-powered &#34;Bounty Hunter&#34; won Top Fuel honors at AHRA, NHRA and NASCAR winter meets, becoming the only &#34;triple crown&#34; winner in drag racing history.  [11] Dynamometer results of the day showed the SOHC Hemi producing almost 700 hp (522 kW) in crate form (100 hp per liter).  [12] The overhead cams meant that it was not as rpm-limited as the Chrysler Hemis were with their pushrods and heavy and complex valvetrains.  [13]\n Later Ford engine designs with hemispherical chambers included the  Calliope, which used two in-block cams, arranged one over the other, to drive 3 valves per hemispherical chamber.  [14] The pushrods activating the valves from the top camshaft were almost horizontal. In 1968, Ford brought out a completely new engine family called the   385-series. This engine&#39;s heads used a modified form of the hemispherical chamber called  Semi-Hemi.  [15]\n In the 1970s, Ford designed and produced a  small-block engine with hemispherical heads to address the growing concerns about fuel economy. Unfortunately, even with an ahead-of-its-time  direct fuel injection system feeding a  stratified charge chamber,  [16]  [17] the hemi&#39;s emissions could not be made clean enough for compliance with regulations. This plus the cost of the valve actuation systems, along with the cost of the high pressure pump needed to deliver fuel directly into the chamber, as well as the  gilmer belt drive system needed to drive the pump, made further development pointless at the time. Most 1980s 4-cylinder Fords used the  Ford CVH engine, CVH meaning &#34;Compound Valve, Hemispherical (Head)&#34;.\n    Jaguar used this head design, beginning in 1949, on the legendary  XK engines, which powered cars ranging from the Le Mans winning D-Type to the XJ6.  [18]\n    Lotus has used hemispherical chambers in some of their  engines (see photo to right). The relatively large valves possible in such a chamber allowed large volumes of air-fuel mixture to enter and exit the chamber quickly; not always completely combusted.\n  Hemispherical chambers were a feature of the  M102 engine introduced in 1980, which together with the crossflow head design promoted greater efficiency over the  M115 engine it replaced.  [19]\n  The MG factory in Abingdon-On-Thames produced a Twin-Cam variant of the pushrod MGA 1600 MkI  MG MGA line from 1958 to 1960. The original push rod 1588 cc cast iron block was crowned with a cast aluminum twin cam cylinder head which included one inlet and exhaust valve each, per cylinder. This configuration enabled a cross flow &#34;hemi head&#34; circulation within the combustion chamber, that enabled improved breathing (volumetric efficiency) as well as utilization of enlarged valves and domed pistons. Early versions proved fragile on the street and in competition due to pre-ignition (detonation), and oil loss, which led to decreasing the compression ratio from 9.1. to 8.3 with redesigned pistons. It was a successful update but sales dropped off so rapidly the company halted Twin Cam production and used the matching chassis for some MGAs, with push rod engines, known as the MGA 1600 MkI and MkII DeLuxe models.\n     Porsche has made  extensive use of hemi-head engines, including the air-cooled  flat-6  engine in  Porsche 911 models from 1963 to 1999. The 1973 2.7 L version generated 56 hp per naturally aspirated litre of  piston displacement.  [20]\n  Toyota Motor Corporation&#39;s   V family of engines were a longitudinally mounted  V8 engine design. They were used from the 1960s through the 1990s. The V family engine was used in the prestigious  Toyota Century. Toyota had worked with Yamaha to produce the first Japanese full aluminum alloy block engine. The V Family is often referred to as the Toyota HEMI as the engine features a similar cylinder head design to those found on the Chrysler&#39;s Hemi, even though most of the engine design is completely different.\n The V 2.6L engine was first used in the  Crown Eight from 1964 to 1967 as part of the  second generation Crown range. Thereafter the Crown Eight was replaced by the upmarket  Toyota Century.\n The 3V, 4V and 5V engines were used in the  Toyota Century up until 1997 when it got a complete redesign and gained the 5.0 L  1GZ-FE  V12.\n The V series engines, like several  Toyota Motor Corporation engines (e.g.  2T-C,  2M,  4M etc.) at the time had a hemispherical combustion chamber. The spark plugs were located at the top of the combustion chamber.\n     In the modern emissions-era, the hemi chamber has begun to fade away from continuing development. The hemispherical combustion chamber is the simplest, and easiest design. It has served for more than a century as the basic design in combustion engines, from which all other improvements and engineering developments derive. As the engineering involved in new engines has improved and evolved, the true hemispherical chamber has morphed and twisted into more sophisticated and complex designs that are meant to extract more power, with lower emissions, from any given combustion event.\n Many of today&#39;s engines use active combustion chambers designed to tumble and swirl the fuel/air mix within the chamber for the most efficient combustion event possible.  [21] These active chambers usually look like kidney beans or two merged small &#39;hemi&#39; areas surrounded by flat quenching areas over the pistons.  [22]\n   ^  Curtis Boat &amp; Woodworking Co. 1901 Hemi engine by Truscott Launch and Engine Company, St Joseph, MI. Designed by Hemi inventor, Allie Ray Welch, Chelsea Manufacturing Company, Chelsea, MI.. CurtisBoat.com. 2009-09-25. URL: http://www.curtisboat.com/hemi_prototype.html. Accessed: 2009-09-25. (Archived by WebCite at  https://www.webcitation.org/5k4B8p3aw)\n ^     a     b    &#34;A history of the origins of the American Hemi&#34;. Webcitation.org. Archived from  the original on October 12, 2007 .\n    ^   Mueller, Mike (2006).  American Horsepower: 100 years of Great Car Engines. MBI Publishing. pp. 112, 113.  ISBN   978-0-7603-2327-4.\n  ^   Mueller, Mike (2006).  American Horsepower: 100 years of Great Car Engines. MBI Publishing. p. 42.  ISBN   978-0-7603-2327-4.\n  ^    &#34;History of Ford 427 SOHC&#34;. Webcitation.org. Archived from  the original on March 26, 2008 .\n ^  Steve Magnante | &#34;Inside the Swamp Rat&#39;s Nest&#34;, Street Rodder Premium Magazine | Volume 2 Number 2 Winter 2011 | page 52\n ^   Flammang, James M., ed. (2005).  Muscle Car Chronicle. Publications International. p. 168.  ISBN   9781412712019.\n ^   Genat, Robert (2007).  Hemi: The Ultimate American V-8. MBI Publishing. p. 14.  ISBN   978-0-7603-2747-0.\n  ^   Flammang, James M., ed. (2005).  Muscle Car Chronicle. Publications International. p. 214.  ISBN   9781412712019.\n   ^    &#34;A history of the Jaguar DOHC&#34;. Webcitation.org. Archived from  the original on February 6, 2008 .\n ^   Long, Brian (2015).  Mercedes-Benz W123 series: All models 1976 to 1986. Veloce Publishing. p. 114.  ISBN   978-1-8458-4792-0.\n  ^   Genat, Robert (2007).  Hemi: The Ultimate American V-8. MBI Publishing. p. 13.  ISBN   978-0-7603-2747-0.\n ^    &#34;Quench Tumble and Swirl&#34;. Webcitation.org. Archived from  the original on May 5, 2010 .", "posttime": "2020-05-20 02:28:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "半球,combustion,发动机", "title": "半球燃烧室", "title_en": "Hemispherical Combustion Chamber", "transed": 1, "url": "https://en.wikipedia.org/wiki/Hemispherical_combustion_chamber", "via": "", "real_tags": ["半球", "发动机"]}, {"category": "", "categoryclass": "", "imagename": "77050df3f46444d2f67ed279ef30db70.jpg", "infoid": 1002842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook一直致力于将你与你所热爱的东西联系起来。这意味着朋友和家人，但也包括产品、品牌和业务。多年来，人们一直在使用我们的应用程序买卖东西，从最初发布一张带有“待售”标题的自行车照片，到在Marketplace上出售你的咖啡桌，再到现在在Instagram上从你最喜欢的品牌和有影响力的人那里购买款式。正是那些使用我们的应用程序的人设想了社交商务。我们正在帮助他们使之成为现实。\n我们想让人们有一个地方体验购物的乐趣，而不是购买的苦差事。我们希望帮助小企业适应，让人们更容易发现和购买他们喜欢的东西。\n现在许多小企业都在苦苦挣扎，随着门店的关闭，更多的企业正寻求将他们的业务带到网上。我们的目标是让购物变得无缝，并使从小企业主到全球品牌的任何人都能使用我们的应用程序与客户联系。这就是为什么我们要推出Facebook商店，并投资于我们所有应用程序的功能，这些功能可以激励人们购物，让在线购物和销售变得更容易。\nFacebook商店让企业很容易建立一个单一的在线商店，让客户可以在Facebook和Instagram上访问。创建Facebook商店既免费又简单。商家可以从他们的目录中选择他们想要展示的产品，然后用展示他们品牌的封面图像和强调色来定制他们商店的外观和感觉。这意味着，任何卖家，无论其规模或预算如何，都可以在方便的时候随时随地在线开展业务并与客户联系。\n人们可以在企业的Facebook页面或Instagram个人资料上找到Facebook商店，或者通过故事或广告发现它们。从那里，你可以浏览整个收藏，保存你感兴趣的产品，并下单-要么在企业的网站上，要么如果企业在美国启用了结账功能，则无需离开应用程序。\n就像你在实体店里需要向某人寻求帮助一样，在Facebook商店里，你可以通过WhatsApp、Messenger或Instagram Direct向企业发送消息，询问问题、获得支持、跟踪送货等等。在未来，你将可以在WhatsApp、Messenger或Instagram Direct上查看商家的商店，并在聊天中立即进行购买。\n我们今天开始推出Facebook商店，并将在接下来的几个月里更广泛地使用。您可以在这里了解更多关于我们如何在考虑隐私的情况下建造商店的信息。\n我们还在我们的应用程序中投资于功能，如Instagram Shop、Live Shop等，这些功能将与Facebook商店集成，帮助客户发现他们感兴趣的产品，并使购买变得更容易。\n今年夏天，从美国开始，我们将推出Instagram Shop，这是一种在Instagram Explore中发现和购买你喜欢的产品的新方式。你可以从@shop的收藏中获得灵感，浏览你最喜欢的品牌和创作者的选择，根据美容和家居等类别进行过滤，并在一个地方购买你喜欢的外观。今年晚些时候，我们将在导航栏中添加一个新的商店标签，这样你只需点击一下就可以进入Instagram商店。\n多年来，人们一直在我们的应用程序上使用直播视频来展示产品，从鞋店宣布新款运动鞋到影响美容的人尝试不同的口红。现在，我们正在让实时购买产品变得更容易。很快，卖家、品牌和创建者将能够在上线之前从他们的Facebook商店或目录中标记产品，这些产品将显示在视频的底部，这样人们就可以轻松地点击了解更多信息和购买。我们开始在Facebook和Instagram上的企业中测试这一点，并将在接下来的几个月里更广泛地推出。\n我们还在测试一些方法，通过让你能够将你的忠诚度计划，比如当地咖啡馆的积分计划，与你的Facebook账户联系起来，让你更容易从你喜欢的企业赚取奖励。你可以很容易地看到并记录你的积分和奖励。我们正在探索帮助小企业在Facebook商店创建、管理和推出忠诚度计划的方法。\n我们还与Shopify、BigCommerce、WooCommerce、ChannelAdvisor、CedCommerce、Cafe24、Tienda Nube和Feedonomics等合作伙伴更紧密地合作，为小企业提供所需的支持。这些组织提供了强大的工具，帮助创业者开始和运营他们的企业，并转移到网上。现在，他们将帮助小企业建立和发展他们的Facebook商店，并使用我们的其他商务工具。\n我们希望这些工具可以缓解小企业目前面临的一些压力，并帮助各种规模的企业为未来做好准备。", "note_en": "Facebook has always been about connecting you to what you love. That means friends and family, but also products, brands and businesses. For years, people have used our apps to buy and sell things from the early days of posting a photo of a bicycle with the caption “for sale,” to selling your coffee table on Marketplace and now shopping styles from your favorite brands and influencers on Instagram. It was the people who use our apps who envisioned social commerce. We’re helping them make it a reality.\n We want to give people a place to experience the joy of shopping versus the chore of buying. And we want to help small businesses adapt and make it easier for people to discover and shop for things they love.\n Right now many   small businesses are struggling , and with stores closing, more are looking to bring their business online. Our goal is to make shopping seamless and empower anyone from a small business owner to a global brand to use our apps to connect with customers. That’s why we’re launching Facebook Shops and investing in features across our apps that inspire people to shop and make buying and selling online easier.\n  Facebook Shops make it easy for businesses to set up a single online store for customers to access on both Facebook and Instagram. Creating a Facebook Shop is free and simple. Businesses can choose the products they want to feature from their catalog and then customize the look and feel of their shop with a cover image and accent colors that showcase their brand. This means any seller, no matter their size or budget, can bring their business online and connect with customers wherever and whenever it’s convenient for them.\n People can find Facebook Shops on a business’ Facebook Page or Instagram profile, or discover them through stories or ads. From there, you can browse the full collection, save products you’re interested in and place an order  —  either on the business’ website or without leaving the app if the business has enabled   checkout  in the US.\n    And just like when you’re in a physical store and need to ask someone for help, in Facebook Shops you’ll be able to message a business through WhatsApp, Messenger or Instagram Direct to ask questions, get support, track deliveries and more. And in the future, you’ll be able to view a business’ shop and make purchases right within a chat in WhatsApp, Messenger or Instagram Direct.\n   We’re starting to roll out Facebook Shops today, and it will be more widely available in the coming months. You can learn more about how we built Shops with privacy in mind  here.\n We’re also investing in features across our apps like Instagram Shop, live shopping and more that will be integrated with Facebook Shops to help customers discover products they’re interested in and make purchasing easier.\n  This summer, starting in the US, we’re introducing Instagram Shop, a new way to discover and buy products you love in Instagram Explore. You can get inspired by collections from   @shop , browse selections from your favorite brands and creators, filter by categories like beauty and home, and purchase the looks you love all in one place. And later this year, we’re adding a new shop tab in the navigation bar, so you can get to Instagram Shop in just one tap.\n   People have been using live video on our apps to showcase products for years, from shoe stores announcing new sneakers to beauty influencers trying on different lipsticks. Now, we’re making it easier to shop for products in real time. Soon, sellers, brands and creators will be able to tag products from their Facebook Shop or catalog before going live and those products will be shown at the bottom of the video so people can easily tap to learn more and purchase. We’re starting to test this with businesses on Facebook and Instagram, and we’ll roll it out more broadly in the coming months.\n    We’re also testing ways to make it easier to earn rewards with businesses you love by enabling you to connect your loyalty programs, like the points program at your local cafe, to your Facebook account. You’ll be able to easily see and keep track of your points and rewards. And we’re exploring ways to help small businesses create, manage and surface a loyalty program on Facebook Shops.\n   We’re also working more closely with partners like  Shopify, BigCommerce, WooCommerce, ChannelAdvisor, CedCommerce, Cafe24, Tienda Nube and Feedonomics to give small businesses the support they need. These organizations offer powerful tools to help entrepreneurs start and run their businesses and move online. Now they’ll help small businesses build and grow their Facebook Shops and use our other commerce tools.\n We hope these tools can relieve some of the pressure small businesses are facing right now and help businesses of all sizes prepare for the future.", "posttime": "2020-05-20 02:28:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,商店", "title": "介绍Facebook商店", "title_en": "Introducing Facebook Shops", "transed": 1, "url": "https://about.fb.com/news/2020/05/introducing-facebook-shops/", "via": "", "real_tags": ["facebook", "商店"]}, {"category": "", "categoryclass": "", "imagename": "48d2d7de321596de81ad266dcf6d34b2.jpg", "infoid": 1002841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在怀特岛试行的冠状病毒接触追踪应用程序中已经发现了广泛的安全漏洞。\n参与其中的安全研究人员警告说，这些问题会对用户的隐私构成风险，并可能被滥用来防止传染警报的发送。\nGCHQ的国家网络安全中心(NCSC)告诉BBC，它已经意识到了大多数提出的问题，并正在解决这些问题。\n具体地说，他们呼吁采取新的法律保护措施，以防止官员将这些数据用于识别哪些人有感染风险之外的目的，或者无限期持有这些数据。\n此外，他们建议NHS考虑从目前的集中式模式(在电脑服务器上进行联系人匹配)转变为分散式模式(在人们的手机上进行匹配)。\nThink网络安全首席执行官凡妮莎·蒂格博士表示，无论是分散模式还是集中式模式，都可能存在漏洞和安全漏洞。\n但最大的不同之处在于，分散的解决方案不会有一个中央服务器，其中包含每个感染者最近的面对面接触信息。\n卫生部长马特·汉考克周一表示，不需要一项新的法律，因为“数据保护法”将会完成这项工作。\n医疗服务机构NHSX的数字创新部门NHSX表示，随着时间的推移，使用集中化模式将更容易改进这款应用，并根据人们的自我诊断症状触发警报，而不仅仅是医疗测试结果。\n注册过程中可能允许攻击者窃取加密密钥的弱点，这将允许攻击者在联系人冠状病毒检测呈阳性时阻止通知用户和/或生成欺骗传输以创建虚假联系人事件的日志。\n将未加密数据存储在手机上，执法机构可能会使用这些数据来确定两个或更多人何时见面。\n每天为用户生成一次新的随机ID码，而不是像谷歌和苹果开发的竞争模型那样，每15分钟生成一次。从理论上讲，较长的间隔使得确定用户是否与工作同事有染或下班后与某人见面成为可能。\n报告的第二作者克里斯·库尔纳内博士告诉BBC新闻，总体风险是多种多样的。\n就注册问题而言，这是相当低的风险，因为它需要对保护良好的服务器进行攻击，我们认为这种可能性不大。\n但未加密数据的风险更高，因为如果有人访问您的手机，那么由于存储在手机上的内容，他们可能会了解到一些额外的信息。&#34；\nNCSC技术总监伊恩·利维(Ian Levy)在博客上感谢这两名研究人员的工作，并承诺解决他们发现的问题。\n但他表示，可能需要发布几个版本的应用程序，才能解决所有问题。\n他写道，报告给团队的所有东西都将经过适当的分类(尽管这比正常情况下需要更长的时间)。\nNCSC的一位发言人表示：人们一直希望，发布代码和解释应用程序背后的决定等措施能引发与安全和隐私社区的有意义的讨论。\n我们期待着继续与安全和密码学研究人员合作，将这款应用做到最好。\n但还存在更广泛的问题，即缺乏保护这些数据使用的立法[包括事实]对于何时必须删除这些数据没有严格的限制。\n这与澳大利亚形成鲜明对比，在危机结束时，澳大利亚对删除其应用程序数据有非常严格的限制。\n与此同时，议会人权委员会主席哈丽特·哈曼(Harriet Harman)宣布，她正在寻求许可，提出一项私人议员法案，限制谁可以使用该应用程序收集的数据，以及如何使用，并创建一个监督机构来处理公众的相关投诉。\n这位工党议员告诉BBC新闻，我个人会亲自下载这款应用程序，即使我担心这些数据会被用来做什么。\n但我的委员会的观点是，除非[政府]愿意实施隐私保护措施，否则这款应用程序不应该继续进行。", "note_en": "Wide-ranging security flaws have been flagged in the Covid-19 contact-tracing app being piloted in the Isle of Wight.\n The  security researchers involved have warned the problems pose risks to users&#39; privacy and could be abused to prevent contagion alerts being sent.\n GCHQ&#39;s National Cyber Security Centre (NCSC) told the BBC it was already aware of most of the issues raised and is in the process of addressing them.\n  Specifically, they call for new legal protections to prevent officials using the data for purposes other than identifying those at risk of being infected, or holding on to it indefinitely.\n  In addition, they suggest the NHS considers shifting from its current &#34;centralised&#34; model - where contact-matching happens on a computer server - to a &#34;decentralised&#34; version - where the matching instead happens on people&#39;s phones.\n  &#34;There can still be bugs and security vulnerabilities in either the decentralised or the centralised models,&#34; said Thinking Cybersecurity chief executive Dr Vanessa Teague.\n &#34;But the big difference is that a decentralised solution wouldn&#39;t have a central server with the recent face-to-face contacts of every infected person.\n  Health Secretary Matt Hancock said on Monday a new law &#34;is not needed because the Data Protection Act will do the job&#34;.\n And NHSX - the health service&#39;s digital innovation unit - has said using the centralised model will both make it easier to improve the app over time and trigger alerts based on people&#39;s self-diagnosed symptoms rather than just medical test results.\n     weaknesses in the registration process that could allow attackers to steal encryption keys, which would allow them to prevent users being notified if a contact tested positive for Covid-19 and/or generate spoof transmissions to create logs of bogus contact events\n storing unencrypted data on handsets that could potentially be used by law enforcement agencies to determine when two or more people met\n generating a new random ID code for users once a day rather than once every 15 minutes as is the case in a rival model developed by Google and Apple. The longer gap theoretically makes it possible to determine if a user is having an affair with a work colleague or meeting someone after work, it is suggested\n &#34;The risks overall are varied,&#34; Dr Chris Culnane, the second author of the report, told BBC News.\n &#34;In terms of the registration issues, it&#39;s fairly low risk because it would require an attack against a well protected server, which we don&#39;t think is particularly likely.\n &#34;But the risk about the unencrypted data is higher, because if someone was to get access to your phone, then they might be able to learn some additional information because of what is stored on that.&#34;\n  NCSC technical director Ian Levy  blogged thanking the two researchers for their work and promising to address the issues they identified.\n But he said it might take several releases of the app before all the problems were addressed.\n &#34;Everything reported to the team will be properly triaged (although this is taking longer than normal),&#34; he wrote.\n An NCSC spokesman said: &#34;It was always hoped that measures such as releasing the code and explaining decisions behind the app would generate meaningful discussion with the security and privacy community.\n &#34;We look forward to continuing to work with security and cryptography researchers to make the app the best it can be.&#34;\n    &#34;But there are broader issues around the lack of legislation protecting use of this data [including the fact] there&#39;s no strict limit on when the data has to be deleted.\n &#34;That&#39;s in contrast to Australia, which has very strict limits about deleting its app data at the end of the crisis.&#34;\n    Meanwhile, Harriet Harman, who chairs the Parliament&#39;s Human Rights Committee, announced she was seeking permission to introduce a private member&#39;s bill to limit who could use data gathered by the app and how and create a watchdog to deal with related complaints from the public.\n &#34;I personally would download the app myself, even if I&#39;m apprehensive about what the data would be used for,&#34; the Labour MP told BBC News.\n &#34;But the view of my committee was that this app should not go ahead unless [the government] is willing to put in place the privacy protections.&#34;", "posttime": "2020-05-20 02:27:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,冠状病毒,coronavirus,病毒,漏洞", "title": "冠状病毒：英国NHS接触者追踪应用程序发现安全漏洞", "title_en": "Coronavirus: Security flaws found in UK NHS contact-tracing app", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-52725810", "via": "", "real_tags": ["程序", "冠状病毒", "病毒", "漏洞"]}, {"category": "", "categoryclass": "", "imagename": "17ccddf0bea3d998512c0cd82bcea319.jpeg", "infoid": 1002840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，在Slake-通常是在高增长时期-团队默认在瀑布中工作，在那里，一个想法被提出和研究，然后按照这个顺序进行设计或规范，然后建立。这不是最有效的工作方式，而且随着公司的发展--每一步都有更多的人参与进来--它只会变得更慢。\n倒退的成本高得令人难以置信；如果您意识到在构建阶段犯了错误，回到绘图板可以被视为偏离或没有进行充分的计划。后见之明是20/20，正如他们所说，那么为什么要等到项目结束才能从这种清晰度中受益呢？要摆脱这种模式以便迭代地工作，需要高度的信任和自治，这需要团队花费时间来构建，因此明确地谈论过程会有所帮助。我们成功地将重点放在原型过程上，将其作为打破过时的线性瀑布思维的一种方式。我们在这里要分享的不是说明性的方法论，而是一个可以适应团队需求的简单框架。\n我将从IDEO的Tim Brown倡导的设计思维过程中借用一些术语和想法，并在interaction-design.org上简明扼要地写下来，所以如果这篇文章能引起你的共鸣，那么设计思维文学可以提供更多的东西！\n原型是一个学习和评估的过程。如果您在一个项目中有一个您想要验证的假设，一个您想要获得反馈的特定方向，或者一个您想要评估的技术计划，原型可以为您提供做出坚定决策所需的信息。\n在将团队的全部资源投入到这些机会之前，原型也可以用来评估广泛的机会。构建一个您已经考虑了一年的功能或系统的粗略版本会让您有机会决定不再使用它。这是一项使产品和工程团队能够协助关键业务决策的技能。\n最重要的是，原型为我们提供了安全和高效地失败的护栏。失败是学习过程中重要的一部分，和成功一样有价值。\n您的假设是原型应该证明或反驳的陈述。预先定义成功是什么样子很重要-特别是在评估主观设计方向时-但同样重要的是确定失败是什么样子。记住，在这里失败不是可以避免的，它只是一种可能的结果，需要做好计划。失败几乎总是会导致问题的改革和新的原型；这就是设计过程的构思阶段和原型阶段之间的关系。\n让我们看看我们在Slake的一些示例假设，以及可能伴随它们的成功/失败标准。\n💡所见即所得消息可以与数据库中的现有消息一起无缝显示。✅旧邮件继续正确显示在新的所见即所得格式邮件旁边。✅可以修改搜索基础结构以返回两种格式的结果。❌需要将所有旧消息迁移为新格式以支持所见即所得。结果：成功。这是为所见即所得大型工程项目铺平道路的早期原型之一。\n💡css-in-JS将使实现暗模式变得更容易，风险更低。✅我们使用css-in-js解决方案组装了一个基本的暗模式原型。❌css-in-JS迁移路径导致我们将样式分叉到两个位置，如果没有额外的工具，这两个位置将无法保持协调。❌css-in-JS没有为我们打开新的技术可能性。结果：失败。使用CSS-in-JS的迁移路径在那个时间点上似乎不值得投资，我们选择使用CSS变量，您可以在之前的博客文章中阅读到更多关于CSS变量的信息。\n通过CDN提供静态💡，而不是从服务器呈现模板，我们可以在1秒内让SLACK呈现出来。✅我们的概念验证时间接近或低于1秒的加载时间。❌我们遇到了一个不可逾越的技术障碍。❌，我们不能令人信服地接近1秒。结果：成功。这是导致我们重新构建Slake客户端的原始原型。你可以在这篇博客文章中阅读更多关于该项目的信息。\n在你开始之前把这些写下来是很重要的。当原型组装在一起时，球门柱很容易移动，特别是当它令人兴奋的时候。\n原型是验证一个想法的机会，没有生产质量工程带来的所有包袱。如果你打算在最后扔掉代码，那么像硬编码数据、跳过测试、忽略Linter等快捷方式都是合理的选择。\n如果需要编写生产代码，在单独的repo中工作或将原型隔离到自己的页面可以帮助缓解安全问题并提高代码的可读性。始终花时间计划您的技术方法；安全至关重要！\n外卖不是代码或输出本身，而是从中学到的东西。花点时间对工作进行评估和记录，并决定如何处理这些新信息。什么进行得好，什么进行得不好？有什么惊喜吗？你达到你的成功标准了吗？你的假设有没有错？\n记录学到的经验教训不仅仅是重述工作的一种有用方式-当另一个团队正在考虑类似的想法时，它可以成为未来的重要历史文物。能够说“我们试过了，这是我们的发现”，这给了其他人有价值的信号，让他们一起工作。\n如果你的原型失败了，下一步可能是制定一个新的假设，并尝试一种不同的方法。如果原型是成功的，并且展示了您正在寻找的可行性，那么您可能会在作为工程项目基础的详细技术规范中了解到您所学到的东西。", "note_en": "Over the years at Slack — usually during periods of high growth — teams have defaulted to working in a waterfall where an idea is proposed and researched, then designed or spec’d, then built, in that order. It’s not the most efficient way to work and as a company grows — with more people involved at each step — it only gets slower.\n There is an incredibly high cost to going backwards; if you realize you got it wrong during the build phase, going back to the drawing board can be seen as a departure or a failure to plan adequately. Hindsight is 20/20, as they say, so why wait until the end of the project to benefit from that clarity? Escaping this mode in order to work iteratively requires a high degree of trust and autonomy that takes time for teams to build, so it helps to talk explicitly about process. We’ve found success by focusing on  the prototyping process as a way to break out of outdated, linear waterfall thinking. What we’ll share here is not a prescriptive methodology but rather a simple framework that can be adapted to a team’s needs.\n I’ll be borrowing some terms and ideas from the Design Thinking process championed by Tim Brown at IDEO and written up succinctly on   interaction-design.org , so if this post resonates with you then the Design Thinking literature has a lot more to offer!\n  Prototyping is a  process for learning and evaluating. If you are at a point in a project where you have an  assumption you’d like to validate, a  specific direction you’d like to get feedback on, or a  technical plan you want to evaluate, prototyping can give you the information necessary to make a firm decision.\n Prototyping can also be used to  evaluate broad opportunities before investing the full resources of a team into them. Building a rough version of that feature or system you’ve been kicking around for a year gives you the chance to decide  not to pursue it. This is a skill that enables product and engineering teams to assist with critical business decisions.\n Most importantly, prototyping gives us the  guardrails to fail safely and productively. Failure is an important part of the learning process and is just as valuable as success.\n   Your hypothesis is the statement that the prototype should prove or disprove. It’s important to define what success looks like up front — especially when evaluating subjective design directions — but equally important is deciding what failure looks like. Remember that failure is not something to be avoided here, it’s simply one of the possible outcomes to plan for. A failure will almost always lead to a reformation of the problem and a new prototype; this is the relationship between the ideation and prototyping phases of the design process.\n Let’s look at some example hypotheses we had at Slack and the success/failure criteria that might accompany them.\n 💡 What-you-see-is-what-you-get messages can be displayed seamlessly alongside existing messages in the database. ✅ Older messages continue to display correctly alongside newer WYSIWYG-formatted messages. ✅ The search infrastructure can be modified to return results from both formats. ❌ All old messages need to be migrated to a new format to support WYSIWYG.  Result: Success. This was one of the early prototypes that paved the way for the large WYSIWYG engineering project.\n 💡 CSS-in-JS will make it easier and lower-risk to implement dark mode. ✅ We put together a basic dark mode prototype using a CSS-in-JS solution. ❌ The CSS-in-JS migration path causes us to fork our styles into two places that don’t stay coordinated without additional tooling. ❌ CSS-in-JS doesn’t unlock new technical possibilities for us.  Result: Failure. The migration path using CSS-in-JS didn’t seem worth the investment at that point in time and we instead opted to use CSS variables, which you can read more about in  a previous blog post.\n 💡 We could make Slack render in under 1 second by serving static HTML from the CDN rather than rendering a template from the server. ✅ Our proof-of-concept is close to, or under, 1 second of load time. ❌ We hit an insurmountable technical snag. ❌ We can’t come convincingly close to 1 second.  Result: Success. This was the original prototype that led us to rearchitect the Slack client. You can read more about that project  in this blog post.\n It’s important to write these down before you start. The goalposts are easy to move as the prototype comes together, especially when it’s exciting.\n  Prototyping is chance to validate an idea without all of the baggage that comes with production-quality engineering. If you’re planning to throw the code away at the end, then shortcuts like hardcoding data, skipping the tests, ignoring the linter, etc. are all fair game.\n Working in a separate repo or isolating the prototype to its own page can help mitigate safety concerns and increase code readability if writing production code is necessary. Always take the time to plan your technical approach; safety is essential!\n  The takeaway is not the code or the output itself, but the  learning that comes out of it. Take the time to evaluate and document the work and decide what you’ll do with this new information. What went well and what didn’t? Were there any surprises? Did you meet your success criteria? Were any of your assumptions incorrect?\n Documenting the lessons learned is not just a useful way to recap the work — it can become an important historical artifact down the road when another team is considering similar ideas. The ability to say “we tried that; here’s what we found” gives others valuable signal to work with.\n If your prototype failed, the next step might be to formulate a new hypothesis and try a different approach. If the prototype was successful and demonstrated the viability you were looking for, perhaps you capture what you learned in a detailed technical spec that serves as the basis for an engineering project.", "posttime": "2020-05-20 02:26:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "进行,prototyping,原型", "title": "在Slake进行原型制作", "title_en": "Prototyping at Slack", "transed": 1, "url": "https://slack.engineering/prototyping-at-slack-b1ec3a298226", "via": "", "real_tags": ["进行", "原型"]}, {"category": "", "categoryclass": "", "imagename": "4266d23e2c5262c1b31d2b75781bcd5b.png", "infoid": 1002839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司总有一天会发布一款AR眼镜，这似乎是不可避免的。今天，我们从YouTube首页科技频道的YouTuber和乔恩·普罗瑟(Jon Prosser)那里传出了一系列传言。Prosser是一个相当新的泄密者，但AppleInsider对他过去正确的事情进行了很好的总结。他声称看到了眼镜原型的视频，并有一长串令人惊讶的苹果下一个大事件的详细信息。\n首先，我们有一个名字。普罗瑟声称，苹果的AR眼镜将被称为Apple Glass，就像谷歌眼镜一样。苹果眼镜看起来很像一副真正的眼镜，据称售价为499美元，外加药方的价位。报告称，这款眼镜计划在2020年第四季度或2021年第一季度发布。显然，苹果原本计划在发布iPhone12的同时发布眼镜，但苹果希望媒体在苹果眼镜发布时在场，所以计划是等到整个冠状病毒大流行结束后，人们才能亲临现场。2021年第四季度-2022年第一季度将在近一年后的2021年第四季度正式推出。\nProsser甚至声称他看到了一段苹果眼镜原型版本的视频，并警告说原型上的任何东西都可能改变，他分享了更多的细节。首先，他声称所有数据都是在iPhone上处理的，并给出了第一代Apple Watch作为类似功能的例子。据推测，这意味着眼镜将需要一直与iPhone配对，而且至少没有互联网连接。Prosser表示，镜框是塑料的，可以通过内置支架进行无线充电。出于隐私考虑，该设备上没有摄像头。\n普罗瑟说，右边的寺庙里有一个激光雷达传感器，这很可能是建立在苹果公司在2020年iPad Pro上所做的小型化工作的基础上的。iPad Pro的摄像头阵列中有一个激光雷达传感器，它可以插入苹果的SDK，让现有的ARKit应用程序获得更可靠的跟踪。很多人猜测，苹果目前的增强现实工作是为了让开发者顺利过渡到增强现实眼镜应用，而这与之前的猜测是一致的。\n普罗瑟说，原型机在两个镜头上都显示了信息，UI名为Starboard，这是iOS的一个很好的配对名称。这款设备是通过在设备上和设备前面的手势控制的，可以扫描苹果专有的二维码，这可能需要特别设计，因为记住，没有RGB摄像头。目前，没有太阳镜的选择。\n苹果AR眼镜的传言已有多年，你很可能会在那里找到声称将于今年、明年或后年上市的报道。彭博社(Bloomberg)2017年的一份报告称，AR眼镜将于2020年准备就绪。去年有报道称，苹果的AR眼镜将推迟到2023年推出，但有传言称，苹果将推出一款时尚的独立耳机。有传言说这款眼镜将在2021年末或2022年初发布，但这款眼镜并不是独立的--你需要在口袋里装一部iPhone。\n苹果眼镜的名字和总体产品设计将赢得很多人将其与谷歌眼镜(Google Glass)相提并论，谷歌眼镜最初于2013年发布，是谷歌失败的平视显示屏。听起来苹果不想重蹈谷歌眼镜的覆辙，这里有很多关键的不同之处。首先，看起来像一副真正的眼镜将比谷歌眼镜的设计有很大改进，谷歌眼镜看起来像是太空外星人会戴的东西。谷歌眼镜在你的面前放了一大块玻璃，这会分散佩戴者或任何与他们交谈的人的注意力。眼镜只有一个玻璃块，所以它只用一只眼睛显示信息，而据报道，苹果眼镜用两个镜头都能显示信息。\n其次，苹果眼镜没有摄像头是明智之举，因为围绕谷歌眼镜的讨论几乎完全围绕着面带式摄像头，以及人们是否被秘密记录下来。谷歌眼镜是最早的消费者平视显示器电脑之一，但所有人都在谈论哪里适合佩戴相机，基本上就是把产品煮熟了，变成了一款面带式Go-Pro。\n这里的第三大不同之处是实际的增强现实技术，它将能够以3D方式感知外部世界，并在上面覆盖信息。谷歌眼镜并没有做任何真正的增强现实--它基本上只是一部透明的智能手机，这意味着它显示的是一块平面屏幕，不会察觉你正在看的是什么，也不会与外部世界互动。我们都在电影中看到的未来平视显示技术，比如在你的视野中高亮显示一个物体并告诉你，或者覆盖3D世界中的导航指令，都是不可能的。\n谷歌眼镜的另一个重大错误是谷歌典型的半心半意的、业余爱好者式的产品支持。谷歌眼镜从来没有真正接入谷歌生态系统，它有一个糟糕的应用程序SDK，而且它从来没有得到用户想要的发布后支持(这里是谷歌浏览器#1499)。我仍然很痛苦)。大多数观察人士认为，苹果已经在让开发者为Apple Glass的支持做好准备。苹果现有的AR Kit SDK似乎注定要在Apple Glass上开箱即用，像激光雷达组件这样的东西将为Apple Glass提供与iPad Pro相当的硬件，而iPad Pro已经在开发者手中。", "note_en": "It seems inevitable that Apple will someday release a set of AR glasses, and today we have a set of rumors from YouTuber Jon Prosser of the &#34;Front Page Tech&#34; YouTube channel. Prosser is a fairly new leaker, but  AppleInsider has a good roundup of things he has gotten right in the past. He claims to have seen video of a prototype of the glasses and has a surprisingly long list of details for Apple&#39;s Next Big Thing.\n First, we have a name. Prosser claims Apple&#39;s AR glasses will be called &#34;Apple Glass,&#34; just like Google Glass. Apple Glass apparently looks like an actual pair of glasses and has a claimed &#34;$499 plus prescription&#34; price point. The report says the glasses are planned to be a &#34;One More Thing&#34; announcement in Q4 2020 or Q1 2021. Apparently, Apple originally planned to announce the glasses alongside the iPhone 12, but Apple &#34;wants the media present&#34; when Apple Glass is announced, so the plan is to wait out the whole coronavirus pandemic so people can be there in person. An actual launch would be nearly a year later in &#34;Q4 2021 - Q1 2022.&#34;\n Prosser even claims he has seen a video of a prototype version of Apple Glass, and with the caveat that anything could change on the prototype, he shared a few more details. First, he claims &#34;all data is processed on the iPhone&#34; and gives the first-gen Apple Watch as an example of similar functionality. Presumably, that means the glasses will need to be paired to an iPhone at all times and that the glasses would, at a minimum, lack Internet connectivity. Prosser says the frames were plastic and could be charged wirelessly with an included stand. There was no camera on the device due to privacy concerns.\n Prosser says the right temple houses a lidar sensor, which is most likely building on the miniaturization work Apple did on the  2020 iPad Pro. The iPad Pro has a lidar sensor in the camera array, which plugged in to Apple&#39;s SDK and gave existing ARKit apps more solid tracking. There has been plenty of speculation that Apple&#39;s current AR work is designed to smoothly transition developers to AR Glasses apps, and this would line up with that speculation.\n Prosser says the prototype displayed information in both lenses, and the UI is called &#34;Starboard,&#34; a good companion name to iOS&#39; &#34;Springboard.&#34; The device was &#34;controlled via gestures on and in front of the device&#34; and could &#34;scan proprietary Apple QR codes,&#34; which presumably would have to be specially designed, since, remember, there&#39;s no RGB camera. Currently, there is no option for sunglasses.\n Apple&#39;s AR glasses have been rumored for years, and you can probably find reports out there claiming a launch date this year, next year, or the year after. A 2017 report from Bloomberg claimed AR Glasses would be  ready in 2020. Reports from last year claimed Apple&#39;s AR glasses would be  pushed back to 2023, but that rumor describes a &#34;sleek&#34; and &#34;standalone&#34; headset. This rumor is splitting the difference with a late 2021 or early 2022 release date, but the glasses aren&#39;t standalone—you&#39;ll need an iPhone in your pocket.\n  The Apple Glass&#39; name and general product design will earn it a lot of comparisons  to Google Glass, Google&#39;s failed heads-up display that was originally released in 2013. It sounds like Apple doesn&#39;t want to repeat a lot of the mistakes of Google Glass, and there are a number of key differences here. First, looking like an actual pair of glasses would be a big improvement over the Google Glass design, which looks like something  a space alien would wear. Google Glass put a big block of glass in front of your face, which was distracting for the wearer or anyone talking to them. Glass has a single glass block, so it displays information in only one eye, while Apple Glass reportedly displays in both lenses.\n Second, Apple Glass&#39; lack of a camera is a smart move, since conversation around Google Glass was focused  almost entirely around the face-mounted camera and whether or not people were being secretly recorded. Glass was one of the first consumer heads-up-display computers, but all anyone could talk about was where it was appropriate to wear a camera, basically boiling the product down to a face-mounted Go-Pro.\n The third big differentiator here is actual augmented reality technology, which would be able to sense the outside world in 3D and overlay information on it. Google Glass didn&#39;t do any real augmented reality—it was mostly just a transparent smartphone, meaning it showed a flat screen that was oblivious to what you were looking at and never interacted with the outside world. The future heads-up-display technology we all see in movies, like highlighting an object in your vision and telling you about it or overlying navigation instructions in the 3D world, weren&#39;t possible.\n The other major mistake of Google Glass was Google&#39;s typical half-hearted, &#34;hobbyist&#34;-style support of the product. Glass never really plugged in to the Google ecosystem, it had a terrible app SDK, and it never got the post-release support its users wanted (Glass Explorer #1499 here. I&#39;m still bitter). Most observers think Apple is already gearing up developers for Apple Glass support. Apple&#39;s existing AR Kit SDK seems destined to work out of the box on Apple Glass, and things like the lidar component would give Apple Glass comparable hardware to the iPad Pro, which is already in developers&#39; hands.", "posttime": "2020-05-20 02:26:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,app,apple,2020,glass", "title": "“Apple Glass”AR传闻：499美元价位，激光雷达，2020年末发布", "title_en": "“Apple Glass” AR rumors: $499 price point, Lidar, announcement in late 2020", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/05/apple-glass-ar-rumors-499-price-point-lidar-announcement-in-late-2020/", "via": "", "real_tags": ["发布", "app", "apple", "2020", "glass"]}]