[{"category": "", "categoryclass": "", "imagename": "ffdac79015a5f6a77693be3ea45c982f.png", "infoid": 1069140, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，在名为 Old School RuneScape 的视频游戏中开始发生一些奇怪的事情。突然间，游戏中出现了很多新玩家，而且他们的行为方式几乎相同。他们连续几个小时在那里，一遍又一遍地执行相同的任务。杀死绿龙，收获金子，杀死更多的绿龙，收获金子。很明显，这些新玩家就是游戏玩家所说的“淘金者”。他们在游戏中赢得金牌，然后通过在地下网站上将其出售给其他玩家来将游戏金牌转化为实际货币。它已经持续了多年，大多数游戏都禁止它，但它仍然在发生。问题是：为什么 Old School RuneScape 中突然出现这么多新玩家？答案在于一个正在崩溃的经济体。委内瑞拉。猖獗的恶性通货膨胀正在削弱当地货币。对于成千上万的委内瑞拉人来说，电子游戏黄金已成为一种避难货币。", "note_en": "A few years ago, something strange started to happen in a video game called Old School RuneScape. Suddenly there were lots of new players in the game, and they were all behaving in pretty much the same way. They were there for hours on end, performing the same tasks over and over again. Killing green dragons, and harvesting gold, killing more green dragons and harvesting gold.\n  It seemed pretty clear these new players were what gamers call &#34;gold farmers.&#34; They were winning gold in the game and then converting that game gold into actual money by selling it to other players on underground websites. It&#39;s been going on for years, and most games prohibit it, but it still keeps happening.\n  The question was: why were there suddenly so many of these new players in Old School RuneScape?\n  The answer lay in one single collapsing economy. Venezuela. Rampant hyperinflation was undermining the local currency. And for thousands of Venezuelans, video game gold had become a currency of refuge.", "posttime": "2021-07-23 08:41:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,gaming", "title": "视频游戏系统", "title_en": "Video Gaming the System", "transed": 1, "url": "https://www.npr.org/2021/07/21/1018915121/video-gaming-the-system", "via": "", "real_tags": ["游戏", "gaming"]}, {"category": "", "categoryclass": "", "imagename": "3dc1aa744e9f6d9229ea5ce94e65e9ef.jpg", "infoid": 1069139, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在 2020 年 12 月，DeepMind 就用 AlphaFold（一种预测蛋白质结构的人工智能工具）解决了一项长达 50 年的重大挑战，震惊了生物学界。上周，这家总部位于伦敦的公司发布了该工具的完整细节并发布了其源代码。现在，该公司宣布已使用其 AI 来预测人体内几乎所有蛋白质的形状，以及在 20 种研究最广泛的生物体中发现的数十万种其他蛋白质的形状，包括酵母、水果苍蝇和老鼠。这一突破可以让世界各地的生物学家更好地了解疾病并开发新药。到目前为止，该宝库包含 350,000 个新预测的蛋白质结构。 DeepMind 表示，它将在未来几个月内预测和发布超过 1 亿个的结构——或多或少是科学已知的所有蛋白质。 “蛋白质折叠是我 20 多年来一直关注的一个问题，”DeepMind 联合创始人兼首席执行官 Demis Hassabis 说。 “这对我们来说是一个巨大的项目。我想说这是我们迄今为止所做的最大的事情。从某种意义上说，这是最令人兴奋的，因为它应该对人工智能以外的世界产生最大的影响。”蛋白质由氨基酸长带组成，这些氨基酸将自身扭曲成复杂的结。了解蛋白质结的形状可以揭示该蛋白质的作用，这对于了解疾病的工作原理和开发新药或识别有助于应对污染和气候变化的生物至关重要。在实验室中弄清楚蛋白质的形状需要数周或数月的时间。 AlphaFold 可以在一两天内预测最接近原子的形状。新数据库应该让生物学家的生活更加轻松。 AlphaFold 可能可供研究人员使用，但并非每个人都希望自己运行该软件。 “从数据库中获取结构比在自己的计算机上运行要容易得多，”华盛顿大学蛋白质设计研究所的大卫贝克说，他的实验室已经建立了自己的预测蛋白质结构的工具，称为 RoseTTAFold，基于 AlphaFold 的方法。在过去的几个月里，贝克的团队一直在与生物学家合作，他们之前一直在试图弄清楚他们正在研究的蛋白质的形状。 “有很多非常酷的生物学研究已经真正加速了，”他说。一个包含数十万个现成蛋白质形状的公共数据库应该是一个更大的加速器。\n“它看起来令人印象深刻，”伦敦帝国理工学院研究酵母基因组的合成生物学家汤姆埃利斯说，他很高兴尝试使用该数据库。但他警告说，大多数预测的形状尚未在实验室中得到验证。在新版本的 AlphaFold 中，预测带有置信度分数，该工具使用该分数来标记它认为每个预测形状与真实事物的接近程度。使用这种方法，DeepMind 发现 AlphaFold 预测了 36% 的人类蛋白质的形状，准确度可以精确到单个原子的水平。 Hassabis 说，这对于药物开发来说已经足够了。此前，经过数十年的研究，人体中只有 17% 的蛋白质在实验室中确定了其结构。如果 AlphaFold 的预测像 DeepMind 所说的一样准确，那么该工具在短短几周内就将这个数字翻了一番多。即使在原子水平上不完全准确的预测仍然有用。对于人体内超过一半的蛋白质，AlphaFold 已经预测出一种形状，应该足以让研究人员弄清楚蛋白质的功能。 AlphaFold 目前的其余预测要么是不正确的，要么是针对人体中三分之一的蛋白质，这些蛋白质在与其他蛋白质结合之前根本没有结构。 “它们很松软，”哈萨比斯说。哥伦比亚大学系统生物学家 Mohammed AlQuraish 开发了自己的蛋白质结构预测软件，他说：“它可以在这种质量水平上应用，这一事实令人印象深刻。”他还指出，拥有生物体中大多数蛋白质的结构将使研究这些蛋白质如何作为一个系统而不是孤立地工作成为可能。 “这就是我认为最令人兴奋的地方，”他说。 DeepMind 正在免费发布其工具和预测，并且不会说明未来是否有从中获利的计划。不过也不排除这种可能性。为了建立和运行数据库，DeepMind 正在与欧洲分子生物学实验室合作，这是一家已经拥有大型蛋白质信息数据库的国际研究机构。现在，AlQuraishi 迫不及待地想看看研究人员如何处理新数据。 “真是太壮观了，”他说，“我认为我们中的任何人都没有想到我们会这么快就到这里。真是令人费解。”", "note_en": "Back in December 2020, DeepMind took the world of biology by surprise when it  solved a 50-year grand challenge with AlphaFold, an AI tool that predicts the structure of proteins. Last week the London-based company published  full details of that tool and released its source code.\n  Now the firm has announced that it has  used its AI to predict the shapes of nearly every protein in the human body, as well as the shapes of hundreds of thousands of other proteins found in 20 of the most widely studied organisms, including yeast, fruit flies, and mice. The breakthrough could allow biologists from around the world to understand diseases better and develop new drugs.\n  So far the trove consists of 350,000 newly predicted protein structures. DeepMind says it will predict and release the structures for more than 100 million more in the next few months—more or less all proteins known to science.\n  “Protein folding is a problem I&#39;ve had my eye on for more than 20 years,” says DeepMind cofounder and CEO Demis Hassabis. “It’s been a huge project for us. I would say this is the biggest thing we’ve done so far. And it’s the most exciting in a way, because it should have the biggest impact in the world outside of AI.”\n  Proteins are made of long ribbons of amino acids, which twist themselves up into complicated knots. Knowing the shape of a protein’s knot can reveal what that protein does, which is crucial for understanding how diseases work and developing new drugs—or identifying organisms that can help tackle pollution and climate change. Figuring out a protein’s shape takes weeks or months in the lab. AlphaFold can predict shapes to the nearest atom in a day or two.\n  The new database should make life even easier for biologists. AlphaFold might be available for researchers to use, but not everyone will want to run the software themselves. “It’s much easier to go and grab a structure from the database than it is running it on your own computer,” says David Baker of the Institute for Protein Design at the University of Washington, whose lab has built its own tool for predicting protein structure, called  RoseTTAFold, based on AlphaFold’s approach.\n   In the last few months Baker’s team has been working with biologists who were previously stuck trying to figure out the shape of proteins they were studying. “There&#39;s a lot of pretty cool biological research that&#39;s been really sped up,” he says. A public database containing hundreds of thousands of ready-made protein shapes should be an even bigger accelerator.\n  “It looks astonishingly impressive,” says Tom Ellis, a synthetic biologist at Imperial College London studying the yeast genome, who is excited to try the database. But he cautions that most of the predicted shapes have not yet been verified in the lab.\n    In the new version of AlphaFold, predictions come with a confidence score that the tool uses to flag how close it thinks each predicted shape is to the real thing. Using this measure, DeepMind found that AlphaFold predicted shapes for 36% of human proteins with an accuracy that is correct down to the level of individual atoms. This is good enough for drug development, says Hassabis.\n  Previously, after decades of work, only 17% of the proteins in the human body have had their structures identified in the lab. If AlphaFold’s predictions are as accurate as DeepMind says, the tool has more than doubled this number in just a few weeks.\n  Even predictions that are not fully accurate at the atomic level are still useful. For more than half of the proteins in the human body, AlphaFold has predicted a shape that should be good enough for researchers to figure out the protein’s function. The rest of AlphaFold’s current predictions are either incorrect, or are for the third of proteins in the human body that don’t have a structure at all until they bind with others. “They’re floppy,” says Hassabis.\n  “The fact that it can be applied at this level of quality is an impressive thing,” says Mohammed AlQuraish, a systems biologist at Columbia University who has developed his own software for predicting protein structure. He also points out that having structures for most of the proteins in an organism will make it possible to study how these proteins work as a system, not just in isolation. “That’s what I think is most exciting,” he says.\n  DeepMind is releasing its tools and predictions for free and will not say if it has plans for making money from them in future. It is not ruling out the possibility, however. To set up and run the database, DeepMind is partnering with the European Molecular Biology Laboratory, an international research institution that already hosts a large database of protein information.\n  For now, AlQuraishi can’t wait to see what researchers do with the new data. “It’s pretty spectacular,” he says “I don&#39;t think any of us thought we would be here this quickly. It&#39;s mind boggling.”", "posttime": "2021-07-23 08:08:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表示,release,蛋白质", "title": "DeepMind 表示将释放科学已知的每种蛋白质的结构", "title_en": "DeepMind says it will release the structure of every protein known to science", "transed": 1, "url": "https://www.technologyreview.com/2021/07/22/1029973/deepmind-alphafold-protein-folding-biology-disease-drugs-proteome/", "via": "", "real_tags": ["表示", "release", "蛋白质"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069136, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "勒索软件非常猖獗，虽然您可能还不是勒索软件攻击的受害者，但成为网络犯罪分子攻击目标的可能性很高。您的安全意识，有时甚至是纯粹的运气，让普通用户能够逃脱黑客和网络犯罪分子设置的复杂陷阱。我们生活在一个技术驱动的世界，在这个世界里，物联网 (IoT) 使我们的日常生活更加舒适和方便。是的，物联网很棒，但我们对此类技术的日益依赖意味着网络犯罪分子正在关注它们。这些设备有可能被恶意软件劫持，因为犯罪分子会利用其漏洞来破坏其功能。我们在电影中看到过这种情况：勇敢的英雄开着他或她的车在路上疾驰，突然间恶棍以某种方式控制并撞毁了车辆。这是好莱坞戏剧的一个激动人心的地方，但能够控制汽车的那种软件真的不是那么遥远。您的汽车的主要目的是将您从 A 点带到 B 点。但是，在完成其主要工作的同时，您的汽车为您提供了许多功能，这些功能可以提高便利性和舒适性并提高汽车性能。这是通过汽车中的许多嵌入式设备完成的。这些设备正在处理数据并与其他设备进行无缝通信，而您并不知情。网络安全专业人士现在担心，随着恶意软件的不断发展，jackware 的风险正在增加。长期以来，我们一直关注勒索软件加密您的 PC、Mac 和移动设备上的文件的能力，但 Jackware 将影响我们在日常生活中常用的连接物理设备和机器。我们之前谈到的那个动作片场景？想象一下你在你的车里，汽车在你不踩踏板的情况下加速。你接到一个电话，说如果你想控制你的车，就付钱。在那种情况下，对于我们大多数人来说，我们甚至不会等待一秒钟来付款。一个不太夸张但仍然可怕的情况可能是简单的事情，比如锁上你的车门并要求赎金让你进出。这似乎很牵强，但当网络安全专业人员第一次开始围绕勒索软件进行讨论时，它听起来有点牵强。\n多年来，恶意软件经历了快速发展。在这样做的同时，它也跟上了技术的发展。现在我们每天都使用小型设备，它们实际上只是帮助我们保持联系的非常小的计算机。这些小型嵌入式设备在提供特定功能时非常专业。我们称它们为嵌入式，因为它们通常包含在另一个设备中。 Jackware 很危险，因为它可以针对这些嵌入式设备。以前，恶意软件仅限于计算机，但随着嵌入式设备的兴起，恶意软件现在可以成为无处不在的威胁。它可以到达您的汽车、安装在您家中的智能家居系统、您办公室中的智能系统，甚至是关键基础设施。受感染的物理设备会对您的生活产生直接的不利影响。只需几行代码，黑客就可以感染嵌入式设备并关闭它，甚至远程控制它，从而影响嵌入式设备所在的设备生态系统。早些时候，我们设想了一个黑客接管汽车，但想得更大。 Jackware 还可能导致电力供应中断 - 以另一个好莱坞奇幻故事，Take of Pelham 123，火车被劫持。破坏的范围是无限的，由此产生的混乱具有可怕的潜力。那么我们如何准备好停止 jackware 呢？答案是更好的保护。虽然机器中的新的高级功能受到欢迎，但也应该集成先进的安全技术来保护这些系统免受不断增长的威胁环境的影响。我们作为最终用户必须更加了解智能机器是如何受到威胁的。不要将智能系统的安全视为理所当然。在购买任何具有智能功能的设备/机器之前，请先了解它们的安全性（如果有的话）。如果这些设备提供关键功能，那么您在使用它们之前就更有理由小心谨慎。不要给网络犯罪分子破坏您生活的机会。在网络安全领域，了解你的敌人是保护自己的第一步。第二步是部署一层网络安全，以保护您免受这个敌人的侵害。您必须为您的家用 Mac 和 PC 部署最好的网络安全。 Sophos Home 提供同样强大的、受 IT 安全专业人员信赖的企业级安全性。它提供 AI 支持的恶意软件检测，可保护家庭计算机免受前所未见的网络威胁。这里的关键是培养对不断增长的威胁形势的高度认识，并确定有助于防范复杂威胁的正确保护措施。", "note_en": "Ransomware is rampant, and while you might not have been a victim of a ransomware attack yet, the chances of being targeted by cybercriminals are high. Your security awareness, and sometimes pure luck, that has allowed the average user to escape the sophisticated traps set by hackers and cybercriminals.\n  We are living in a tech-enabled world, a world where the Internet of Things (IoT) makes daily life more comfortable and convenient for us. Yes, IoT is great, but our increasing reliance on such technologies means  cybercriminals are eyeing them. These devices have the potential to be hijacked by malware, as criminals exploit their vulnerabilities to disrupt their functionalities.\n      We’ve seen it happen in the movies: the intrepid hero is racing down the road in his or her car, and suddenly the villain somehow takes control and crashes the vehicle. It’s a thrilling bit of Hollywood theatrics, but the sort of software capable of taking control of a car really isn’t that far off.\n    The primary purpose of your car is to get you from point A to B. But, while doing its main job, your car offers you plenty of features that improve convenience and comfort as well as enhance car performance. This is done through a host of embedded devices in your car. These devices are processing data and also communicating with other devices, seamlessly, without you being aware of it.\n    Cybersecurity professionals are now worried that with the evolving nature of malware, the risk of jackware is now increasing. We’ve long focused on ransomware’s ability to encrypt files on your PCs, Macs and mobile devices, but jackware will impact the connected physical devices and machines we commonly use in our daily lives. That action movie scene we talked about earlier? Imagine you are in your car, and the car accelerates without you pushing the pedal. You receive a call, saying pay up if you want the control of your car.\n  In that sort of situation, for most of us, we will not wait even a split second to pay up. A less over the top, but still scary situation, could be something as simple as locking your car doors and asking for a ransom to let you in, or out.\n  It seems far-fetched, but ransomware sounded far-fetched when cybersecurity professionals first started having discussions around it.\n      Malware has undergone rapid evolution over the years. While doing so, it has kept up with the evolution of technology. Every day now we use small devices that are really just very small computers that help us stay connected. These small embedded devices and are highly specialized as they deliver specific features. We call them embedded as they are typically included within another device.\n  Jackware is dangerous because it can target these embedded devices. Previously, malware was restricted to computers, but with the rise of embedded devices, malware can now become an omnipresent threat. It can reach your cars, the smart home systems installed in your homes, the smart system in your offices, and even critical infrastructure. An infected physical device can have a direct adverse impact on your lives. With just a few lines of code, a hacker can infect an embedded device and shut it down or even control it remotely, impacting the device ecosystem the embedded device resides within.\n  Earlier, we envisioned a hacker taking over a car, but think bigger. Jackware can also cause disruptions in power supply – take another Hollywood fantasy,  the Taking of Pelham 123, where a train is hijacked. The scope of sabotage is limitless and the resulting chaos has terrible potential.\n    So how do we get ready to stop jackware? The answer is better protection. While new, advanced features in machines are welcome, integrating advanced security techniques that safeguard these systems from an ever growing threat landscape should also be in place. We as end users must become more aware of how smart machines can be compromised. Do not take security of your smart systems for granted. Before you buy any device/machine with smart features, find out how they are secured, if at all. If these devices deliver a critical functionality, all the more reason that you take deliberate care before using them. Don’t give cybercriminals an opportunity to disrupt your life.\n  In cybersecurity, knowing your enemy is the first step towards protecting yourself. The second step is deploying a layer of cybersecurity that will safeguard you from this enemy. It is imperative that you deploy the best cybersecurity for your home Macs and PCs. Sophos Home delivers the same powerful, business-grade security trusted by IT security professionals. It delivers AI backed malware detection that protects home computers from never-before-seen cyber threats.\n  The key here is to develop a sense of heightened awareness about the growing threat landscape and identifying the right protection that helps guard against sophisticated threats.", "posttime": "2021-07-23 08:03:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,劫持,malware,设备", "title": "Jackware：可以劫持机器的恶意软件", "title_en": "Jackware: Malware That Can Hijack a Machine", "transed": 1, "url": "https://home.sophos.com/en-us/security-news/2021/what-is-jackware.aspx", "via": "", "real_tags": ["软件", "劫持", "malware", "设备"]}, {"category": "", "categoryclass": "", "imagename": "166b81b90b6fab67db504fc03504538e.png", "infoid": 1069135, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦运输管理局在 2019 年向阿纳海姆提供了 200 万美元的赠款，周四该市的交通网络宣布了与 Arrival 合作的计划，以实现其在 2025 年之前运营加州首个全电动公交车队的目标。这家总部位于英国的公司表示，阿纳海姆运营往返迪斯尼乐园和其他当地景点的交通服务，将成为其轻型电池巴士的第一个客户。抵达时将从五辆 40 英尺的巴士开始，但没有回应有关巴士何时推出以及何时会增加车队的更多信息的请求。前往阿纳海姆的巴士将在 Arrival 位于南卡罗来纳州罗克希尔的第一家美国微型工厂制造。 Arrival 的另一家微型工厂位于北卡罗来纳州的夏洛特，但该初创公司的目标是到 2024 年底在全国拥有 31 家微型工厂。根据 EV 公司的一份声明，Arrival 与阿纳海姆运输网络的合作伙伴关系还包括劳动力发展计划。拥有电气和机械工程课程的当地社区学院将能够为符合条件的学生提供实习机会，以获得零排放交通工作的经验。 “Arrival Bus 上路后将改变公共交通的面貌，”Arrival Automotive 首席执行官 Mike Ableson 说。 “我们从美国过境运营商处收到的第一份订单仅仅是个开始。”最近通过 SPAC 合并上市的 Arrival 已经拥有许多值得注意的合作伙伴关系。去年，它与 UPS 签署了一项协议，将在 2024 年之前推出 10,000 辆电动送货车的初始订单。 5 月，该公司与 Uber 合作开发了一款专为网约车打造的电动汽车，就在上周，该公司宣布荷兰“汽车即服务”公司 LeasePlan 最初订购了 3,000 辆电动汽车。", "note_en": "The  Federal Transportation Administration awarded Anaheim a $2 million grant in 2019, and on Thursday the city’s transportation network announced the plan to partner with Arrival to achieve its goal of running California’s first all-electric bus fleet by 2025.\n The U.K.-based company said Anaheim, which operates transit services to and from Disneyland and other local attractions, would be the first customer for its lightweight-battery bus. Arrival will start with five 40-foot buses, but did not respond to requests for more information about when the buses would launch and when to expect more additions to the fleet.\n   The buses for Anaheim will be built in Arrival’s first U.S. microfactory in Rock Hill, South Carolina. Arrival’s other microfactory is in Charlotte, North Carolina, but the startup aims to have 31 microfactories all over the country by the end of 2024.\n Arrival’s partnership with Anaheim Transportation Network also includes workforce development programs, according to a statement from the EV company. Local community colleges with electrical and mechanical engineering programs will be able to give eligible students internships to gain experience working with zero-emission transportation.\n “The Arrival Bus will change the face of public transportation when it hits the roads,” said Mike Ableson, CEO of Arrival Automotive. “Our first order from a U.S. transit operator is just the beginning.”\n Arrival, which recently went public via a SPAC merger, already has a number of notable  partnerships. Last year, it signed an agreement with UPS to roll out an initial order of 10,000 electric delivery vehicles through 2024. In May the company partnered with Uber to create a purpose-built EV for ride-hailing, and just last week, the company announced an  initial order of 3,000 EVs from LeasePlan, a Dutch “car-as-a-service” company.", "posttime": "2021-07-23 07:30:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,电动,ev,arrival", "title": "商业电动汽车公司 Arrival 为阿纳海姆制造电动巴士", "title_en": "\n\t\t\t\tCommercial EV company Arrival to build electric buses for Anaheim\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/commercial-ev-company-arrival-to-build-electric-buses-for-anaheim/", "via": "", "real_tags": ["商业", "电动", "ev", "arrival"]}, {"category": "", "categoryclass": "", "imagename": "da333b6bf553d1269aad012724752b43.jpg", "infoid": 1069134, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦一家法院表示，英国软件公司 Autonomy 的创始人可以被引渡到美国，面临共谋和欺诈指控。迈克·林奇在 2011 年以 110 亿美元的价格将 Autonomy 卖给了美国计算机巨头惠普（HP）。他的律师、高伟绅律师事务所的克里斯·莫维罗表示，林奇博士对裁决感到失望并将上诉。林奇博士一直在伦敦高等法院面临民事指控，惠普正在起诉他对这笔交易的损害赔偿。但另外，美国司法部（DoJ）正在对他提起刑事指控。迈克尔·斯诺法官表示，他将在不等待民事判决的情况下就该诉讼作出裁决，称这“在本案中意义有限”。林奇博士在伦敦被法官保释。林奇博士告诉 BBC Radio 4 的 PM 节目，该决定并不意外，因为英国与美国签订的引渡条约的条款。 “我们有这种不平衡和默认的引渡条约，可用于[在]与美国公司及其利益发生的任何争端。”\n“这个引渡条约的疯狂之处在于它不依赖任何事实，”他说。林奇博士补充说，他认为引渡条约“不平衡”，英国公众没有意识到美国司法系统的运作方式与英国完全不同。他说，司法部没有等待英国高等法院的完整判决，这“特别令人震惊”，该判决将在九周后到期。他声称，他在 2019 年被判入狱五年的前首席财务官 Sushovan Hussain 没有得到公正的审判。林奇博士说，没有辩护证人出现在侯赛因先生的审判中，因为他们被告知如果他们进入美国将被逮捕。他的律师莫维洛先生说：“应美国司法部的要求，法院裁定，应将经营一家在伦敦证券交易所上市的英国公司的英国公民引渡到美国，因为他在英国的行为受到指控。 “我们说这个案子属于英国。如果内政大臣仍然决定下令引渡，林奇博士打算上诉。”英国严重欺诈办公室 (SFO) 于 2013 年调查了这笔交易，两年后因“证据不足”而撤销此案。\nAutonomy 由 Lynch 博士于 1996 年创立。它开发的软件可以从“非结构化”数据源（例如电话、电子邮件或视频）中提取有用信息，然后执行诸如向呼叫中心接线员或监视器建议答案等操作文字或主题的电视频道。在被惠普收购之前，它的总部位于旧金山和英国剑桥。 2010 年，Autonomy 报告的收入中约有 68% 来自美国和美洲其他地区。惠普和美国检察官指控林奇博士和其他前 Autonomy 高管在 2009 年至 2011 年间人为夸大了这家软件公司的收入和收益，导致惠普为该公司支付了过高的费用。但林奇博士辩称，惠普在 2011 年交易后利用这些指控掩盖了自己对 Autonomy 的管理不善。 “我认为我们在 Autonomy 没有做错任何事，但让我提醒你，惠普出于自愿决定为 Autonomy 支付比伦敦股票市场价格高 70% 的价格，”他告诉第 4 电台“这是一笔天文数字，但这是他们的选择——而不是我们的选择。”\n林奇博士还批评 SFO 未能清除他的罪名：“SFO 因没有认罪而受到很多批评，但就我而言，他们也未能清除无辜者。他们进行了调查，发现没有错，但基本上坐在那里。“当我们国家的无辜公司受到照顾自己利益的国家的司法干预时，保护他们很重要。”", "note_en": "The founder of UK software firm Autonomy can be extradited to the US to face charges of conspiracy and fraud, a London court has said.\n Mike Lynch sold Autonomy to US computer giant Hewlett Packard (HP) for $11bn in 2011.\n  His lawyer, Chris Morvillo of Clifford Chance, said Dr Lynch was disappointed by the ruling and would appeal.\n Dr Lynch has been facing civil charges at the High Court in London, where HP is suing him for damages over the deal. But separately, the US Department of Justice (DoJ) is pursuing criminal charges against him.\n Judge Michael Snow said he would deliver his ruling in that action without awaiting the civil verdict, saying it was &#34;of limited significance in the case&#34;. Dr Lynch was released on bail by the judge in London.\n   Dr Lynch told BBC Radio 4&#39;s PM programme that the decision was not unexpected, because of the terms of the extradition treaty the UK has with the US.\n &#34;We have this imbalance and this default extradition treaty which can be used [in] any dispute that&#39;s going on with American companies and their interests.&#34;\n &#34;The insanity of this extradition treaty [is that] it doesn&#39;t rely on any facts,&#34; he said.\n Dr Lynch added that he felt the extradition treaty was &#34;imbalanced&#34; and that the British public did not realise that the US justice system works entirely differently to the UK&#39;s.\n He said it was &#34;particularly egregious&#34; that the DoJ was not waiting to see the full judgement from the UK High Court, which will be due in nine weeks&#39; time.\n He claimed his former chief financial officer Sushovan Hussain, who was jailed for five years in 2019, did not receive a fair trial. Dr Lynch said no defence witnesses turned up to Mr Hussain&#39;s trial because they were told they would be arrested if they entered the US.\n  His lawyer Mr Morvillo said: &#34;At the request of the US Department of Justice, the court has ruled that a British citizen who ran a British company listed on the London Stock Exchange should be extradited to America over allegations about his conduct in the UK.\n &#34;We say this case belongs in the UK. If the home secretary nonetheless decides to order extradition, Dr Lynch intends to appeal.&#34;\n  The UK&#39;s Serious Fraud Office (SFO) investigated the deal in 2013, before dropping the case two years later because of &#34;insufficient evidence&#34;.\n Autonomy was founded by Dr Lynch in 1996. It developed software that could extract useful information from &#34;unstructured&#34; sources of data such as phone-calls, emails or video, and then do things such as suggest answers to a call-centre operator or monitor TV channels for words or subjects.\n Before it was bought by HP, it had headquarters in San Francisco and Cambridge in the UK.\n In 2010, about 68% of Autonomy&#39;s reported revenues came from the US and elsewhere in the Americas.\n  HP and US prosecutors allege that Dr Lynch and other former Autonomy executives artificially inflated the software company&#39;s revenues and earnings between 2009 and 2011, causing HP to overpay for the firm.\n But Dr Lynch has argued that HP used the allegations to cover up its own mismanagement of Autonomy after the 2011 deal.\n &#34;I don&#39;t think that we did anything wrong at Autonomy, but let me remind you that HP, of its own free will, decided to pay 70% more for Autonomy than its price on the London stock market,&#34; he told Radio 4.\n &#34;It was an astronomical amount of money, but it was their choice - not ours.&#34;\n Dr Lynch is also critical of the SFO for failing to clear him: &#34;The SFO has had a lot of criticism for not getting the guilty, but in my case, they&#39;ve also failed to clear the innocent. They&#39;ve investigated, found nothing wrong, and yet have basically sat there.\n &#34;It&#39;s important to defend the innocent companies in our country when they are subject to judicial overreach from countries that are looking after their own interests.&#34;", "posttime": "2021-07-23 07:27:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,引渡,founder", "title": "Autonomy 创始人迈克林奇可以被引渡到美国", "title_en": "Autonomy Founder Mike Lynch Can Be Extradited To US", "transed": 1, "url": "https://www.bbc.com/news/business-57933718", "via": "", "real_tags": ["美国", "引渡", "founder"]}, {"category": "", "categoryclass": "", "imagename": "aa478a9c65e00f0b965772729f14c58e.jpg", "infoid": 1069133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在 3 月份，摩托罗拉就推出了 Moto G 系列的第一款旗舰手机：Moto G100。 G100 是第一款配备骁龙 800 系列芯片组的 Moto G 手机，特别是骁龙 870，但与摩托罗拉的 Edge+ 不同，G100 并没有破产。现在，摩托罗拉已经在美国推出了 Moto G100，并从今天开始上市。 Moto G100 凭借其骁龙 870 芯片组提供旗舰级性能，骁龙 865 的超频变体为摩托罗拉之前的 Edge+ 旗舰产品提供动力。该芯片组搭配 8GB RAM 和 128GB 内部存储，后者可通过 microSD 卡扩展至 1TB。这款手机由坚固的 5000mAh 电池供电；不支持无线充电，但可以通过随附的 20W 适配器为手机电池充电。在背面，Moto G100 配备三摄像头设置，包括一个 64MP 主摄像头、一个 16MP 超广角摄像头和一个 2MP 深度传感器。超广角相机兼作微距相机，并具有环形灯以照亮附近的拍摄对象，如特色图片所示。在正面，这款手机配备了一个 16MP 自拍相机和一个 8MP 广角相机，以容纳更多人。在正面，该手机具有 6.7 英寸 LCD 面板，分辨率为 2520×1080 像素，宽高比为 21:9。刷新率最高为 90Hz。由于 DisplayPort 备用模式支持，显示器可以扩展到外部显示器或电视，一旦扩展，摩托罗拉的“Ready For”软件就会接管以提供类似桌面的体验。与欧洲型号不同，美国 Moto G100 似乎没有专用的 Google Assistant 按钮（这是美国版摩托罗拉手机的典型特征）。它保留了嵌入电源按钮的指纹扫描仪、3.5 毫米耳机插孔和 microSD卡槽，但是。 Moto G100 在美国提供三种颜色：虹彩海洋、虹彩天空和石板灰。它与 AT&amp;T 和 T-Mobile 以及在其网络上运行的所有 MVNO 兼容。但是，它仅支持 AT&amp;T 网络上的 4G LTE，因此您需要使用 T-Mobile 或 T-Mobile MVNO 才能通过运营商的 sub-6GHz NSA 网络获得 5G 连接。考虑到这一点，您今天可以从 motorola.com 购买 Moto G100。摩托罗拉在有限的时间内为这款手机打折了 100 美元，因此它目前的售价为 499.99 美元。它不是你在美国能买到的最便宜的 5G 手机，但考虑到它的规格，它确实物超所值。\nMoto G100 是摩托罗拉首款具有旗舰级规格的 Moto G 手机，它终于在美国上市了", "note_en": "Back in March, Motorola launched its first flagship phone in the Moto G line:  the Moto G100. The G100 is the first Moto G phone with a Snapdragon 800-series chipset, specifically the  Snapdragon 870, but unlike Motorola’s Edge+, the G100 didn’t break the bank. Now, Motorola has launched the Moto G100 in the U.S., and it’s available starting today.\n  The Moto G100 offers flagship-level performance thanks to its Snapdragon 870 chipset, an overclocked variant of the Snapdragon 865 that powered Motorola’s previous Edge+ flagship. The chipset is paired with 8GB of RAM and 128GB of internal storage, the latter of which is expandable by up to 1TB with a microSD card. The phone is powered by a beefy 5000mAh battery; there’s no wireless charging support, but the phone’s battery can be charged via the included 20W adapter.\n On the rear, the Moto G100 sports a triple camera setup, comprised of a 64MP main camera, a 16MP ultra wide-angle camera, and a 2MP depth sensor. The ultra wide-angle camera doubles as a macro camera and has a ring light to illuminate nearby subjects, as shown in the featured image. On the front, the phone has a 16MP selfie camera joined by an 8MP wide-angle camera to fit more people in the frame.\n On the front, the phone has a 6.7-inch LCD panel at 2520×1080 pixel resolution for a 21:9 aspect ratio. The refresh rate maxes out at 90Hz. The display can be extended to an external monitor or TV thanks to DisplayPort Alternate Mode support, and once extended,  Motorola’s “Ready For” software takes over to provide a desktop-like experience.\n Unlike the European model, the American Moto G100 seems to lack the dedicated Google Assistant button (as is typical with U.S. versions of Motorola phones.) It does retain the fingerprint scanner embedded in the power button, the 3.5mm headphone jack, and the microSD card slot, however.\n The Moto G100 is available in the U.S. in three colors: Iridescent Ocean, Iridescent Sky, and Slate Grey. It’s compatible with both AT&amp;T and T-Mobile as well as all MVNOs operating on their networks. However, it only supports 4G LTE on AT&amp;T’s network, so you’ll need to be on T-Mobile or a T-Mobile MVNO to get 5G connectivity through the carrier’s sub-6GHz NSA network.\n With that in mind, you can  buy the Moto G100 from motorola.com today. Motorola has discounted the phone by $100 for a limited time, so it’s currently on sale for $499.99. It’s not the  cheapest 5G phone you can buy in the States, but it does give a lot of bang for the buck considering its specs.\n  The Moto G100 is Motorola&#39;s first Moto G phone with flagship-level specs, and it&#39;s finally available in the U.S.", "posttime": "2021-07-23 07:26:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,xda,手机", "title": "XDA 开发人员", "title_en": "XDA Developers", "transed": 1, "url": "https://www.xda-developers.com/moto-g100-us-launch/", "via": "", "real_tags": ["开发", "xda", "手机"]}, {"category": "", "categoryclass": "", "imagename": "8f1360cbd29a84fa7cf021fdd675f3cd.jpg", "infoid": 1069132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "摩托罗拉在今年早些时候向拉丁美洲和欧洲市场推出 Moto G100 之后，现在正在美国销售它。它配备中端规格，例如 5,000 毫安时的大电池、5G 和 90Hz 屏幕，建议零售价为 599 美元。从即日起至 8 月 5 日，摩托罗拉提供全零售价 100 美元的折扣。 G100 的美国运营商兼容性有两个重要的脚注：它是仅支持 GSM 的手机，因此适用于 AT&amp;T 和 T-Mobile 但不适用于 Verizon，其 5G 连接仅与 T-Mobile 的 5G 网络兼容。除此之外，它似乎是一款受人尊敬的中端设备，如果价格偏高的话。它使用具有 8GB RAM、低于 6GHz 5G 的 Snapdragon 870 处理器和具有 90Hz 刷新率的 6.7 英寸 1080p 显示屏。摩托罗拉今年在美国发布的手机集中在 200-400 美元的范围内，使 G100 成为该公司最近在美国推出的价格较高的设备之一。虽然大电池、刷新速度更快的屏幕和更高级的处理器感觉适合其 599 美元的价格标签，但它缺乏 IP 等级和广泛的运营商/5G 支持可能会使其与三星 A52 5G 或Pixel 4A 5G（如果你还能找到的话）。", "note_en": "Motorola is  now selling the Moto G100 in the US, after  introducing it earlier this year for Latin American and European markets. It comes with midrange specs like a big 5,000mAh battery, 5G, and a 90Hz screen for a $599 MSRP. From now until August 5th, Motorola is offering a $100 discount off the full retail price.\n There are two important footnotes on the G100’s US carrier compatibility: it’s a GSM-only phone, so will work on AT&amp;T and T-Mobile but not Verizon, and its 5G connectivity is only compatible with T-Mobile’s 5G network. Outside of that, it appears to be a respectable midrange device, if priced a little on the high end. It uses a Snapdragon 870 processor with 8GB of RAM, sub-6GHz 5G, and a 6.7-inch 1080p display with 90Hz refresh rate.\n Motorola’s US phone releases this year have been concentrated around the $200-400 range, making G100 one of the pricier devices the company has introduced stateside recently. While a big battery, faster-refreshing screen, and a higher-tier processor feel fitting of its $599 price tag, its lack of IP-rating and broad carrier / 5G support could set it back against similarly priced peers like the Samsung A52 5G or the Pixel 4A 5G (if you can still find one).", "posttime": "2021-07-23 07:26:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,芯片,美国,上市,camera", "title": "摩托罗拉旗舰 Moto G100 手机于 3 月推出，现已在美国上市，售价 599 美元，配备三摄像头设置、Snapdragon 870 芯片组、128 GB 存储空间", "title_en": "Motorola's flagship Moto G100 phone, launched in March, is now available in the US for $599, with triple camera setup, Snapdragon 870 chipset, 128 GB of storage", "transed": 1, "url": "https://www.theverge.com/2021/7/22/22589232/motorola-moto-g100-price-specs-screen-battery?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["手机", "芯片", "美国", "上市", "camera"]}, {"category": "", "categoryclass": "", "imagename": "a94f912466f94eac5dd0d54179428caa.jpeg", "infoid": 1069131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州州长加文·纽瑟姆 (Gavin Newsom) 本周承诺在一场旋风般的“加利福尼亚复出”之旅中安置和养活世界上的无家可归者，该之旅旨在避免愤怒的选民在 9 月召回。金州已经在全国最大的无家可归人口和 COVID-19 后最糟糕的经济气候之一的重压下崩溃。随着数百万中产阶级居民和企业主逃往红州，留下来的人看到了新兴的下层阶级出现。一些县的汽油价格为每加仑 5 美元，180,000 名无家可归者挤进所有蓝色城市，破旧的高速公路上散落着垃圾。甚至大西洋杂志也在一篇题为“加州梦正在消亡”的长篇文章中概述了敌对的经济环境。正是在这种背景下，纽瑟姆周一召开了新闻发布会，承诺在已经花费的数十亿美元的基础上，再投入 120 亿美元用于解决无家可归问题。人们会得到照顾，任何想要实现加州梦的人都受到欢迎，他在回答记者问他是否希望国家的无家可归者带着这笔新支出来到加州时说。纽森说：“这是关于让人们远离街头，摆脱危机事件，在他们所在的地方与人们会面，以及人们想要来这里寻找新的开始和所有收入水平的程度，这是加州梦想的一部分。” “我们有责任容纳、活跃和鼓舞人心，加州的梦想仍然存在并且很好。”纽森补充说：“我为来自世界各地的人们再次关注加州寻找机会而感到自豪，而且这不应该只针对某些人。无论收入水平如何，无论生活状况如何，所有人都应该向往加州梦想。”\n加利福尼亚州是全美税收最高的州，对于普通居民来说，买房是遥不可及的。纽森没有提到这一点，而是指出了 800 亿美元的预算盈余，他说这笔钱足以帮助所有人实现美国梦。洛杉矶县警长亚历克斯·维拉纽瓦（Alex Villanueva）听取了纽森的信息，对所听到的内容并不满意。尽管今年预算削减了 1.45 亿美元，但维拉纽瓦仍试图弥补犯罪率上升和无家可归者人数增加的差距。 “那些评论让我们大吃一惊，我们正努力保持头脑清醒，他就这么说？”维拉纽瓦告诉华盛顿审查员。 “当他邀请全国其他无家可归的人到加利福尼亚时，这就是死亡之愿。” Villanueva表示，洛杉矶县洛杉矶县的凶杀案比去年增长了58％，新选区院士乔治·瓦尔康拒绝举办侦探带来的侦查犯罪案件5,900件刑事案件。加斯康在一个少起诉和更多社区援助违法者的平台上运行。 “凭借 [Gascon] 的特权成长，这不会影响他，”维拉纽瓦说。 “我在街上遇到患有精神疾病的无家可归者，他们袭击居民，放火烧他们的房子，并用汽车碾过他们。随着无家可归者人数的增加，暴力程度就像往火上泼汽油一样。”纽森在新闻发布会上说：“归根结底，我们必须承担责任，承担更多责任，做得更多，做得更好。”\n“这就是这个预算打算做的事情，它是关于结果的，”他补充道。", "note_en": "California Gov. Gavin Newsom pledged to house and feed the world’s homeless population this week during a whirlwind “Comeback California” tour that is designed to stave off a September recall by angry voters.\n The Golden State is already cracking under the weight of the nation’s largest homeless population and one of the worst economic climates post-COVID-19. With millions of middle-class residents and business owners fleeing to red states, those left behind have seen a burgeoning lower class emerge.\n  Gasoline is pushing $5 a gallon in some counties, 180,000 homeless pack into all the blue cities, and dilapidated freeways are strewn with trash.\n Even the Atlantic outlined the hostile economic environment in a lengthy article titled “ The California Dream is Dying.”\n It’s against this backdrop that Newsom held a  press conference Monday pledging $12 billion to combat homelessness on top of billions that have already been spent. People will be taken care of, and anyone who wants to avail themselves to the California dream is welcome, he said in response to a reporter who asked whether he expected the nation’s homeless to descend upon California with this new expenditure.\n “It’s about getting people off the streets, out of incidents of crisis, and meeting people where they are and to the extent that people want to come here for new beginnings and all income levels, that’s part of the California dream,” Newsom said. “We have a responsibility to accommodate and enliven and inspire, and California’s dream is still alive and well.”\n Newsom added: “I’m proud of people from around the world looking at California again for opportunity, and that, again, that should not just be for certain people. All people should aspire to that California dream regardless of their income level and regarding their lot in life.”\n California is the highest-taxed state in the nation, and buying a home is out of reach for the average resident. Newsom did not mention this but rather pointed to an $80 billion budget surplus that he said is enough money to help all achieve the American dream.\n  Los Angeles County Sheriff Alex Villanueva listened to Newsom’s message and was not pleased with what he heard.\n  Villanueva has tried to stand in the gap of rising crime and increased homelessness despite a $145 million “ defund the police” cut to his budget in the current year.\n “Those comments blew us away, we are trying to keep our heads above water, and he goes and says that?” Villanueva told the Washington Examiner. “When he invites the rest of the nation’s homeless to California, that is the death wish.”\n Homicides in Los Angeles County are up 58% from last year, and newly elected District Attorney George Gascon refused to file a record 5,900 criminal cases brought by detectives this year, Villanueva said. Gascon ran on a platform of less prosecution and more community assistance for lawbreakers.\n “With [Gascon’s] privileged upbringing, this doesn’t impact him,” Villanueva said. “I have homeless with mental illness on the streets who attack residents, set their houses on fire, and run over them with cars. Just the sheer level of violence that comes with the increase in population of homeless is like pouring gasoline on the fire.”\n  &#34;At the end of the day, we have to take accountability, responsibility, and do more, do better,&#34; Newsom said during the press conference.\n “And that’s what this budget intends to do, it’s about results,&#34; he added.", "posttime": "2021-07-23 07:26:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "邀请,newsom,加州", "title": "加文纽森邀请世界无家可归者到加州", "title_en": "Gavin Newsom invites world's homeless to California", "transed": 1, "url": "https://www.yahoo.com/now/gavin-newsom-invites-worlds-homeless-110000209.html", "via": "", "real_tags": ["邀请", "newsom", "加州"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建账户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2021-07-23 07:26:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "干扰,jamming,创建", "title": "古巴干扰火腿电台？", "title_en": "Cuba Jamming Ham Radio?", "transed": 1, "url": "https://spectrum.ieee.org/tech-talk/telecom/wireless/cuba-jamming-ham-radio-listen-for-yourself", "via": "", "real_tags": ["干扰", "jamming", "创建"]}, {"category": "", "categoryclass": "", "imagename": "4662c47ebfa5f29f6cf8487b61080a22.jpg", "infoid": 1069129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但与任何社交媒体公司一样，Tumblr 需要保持自己的运转，以便其用户继续分享深奥的粉丝艺术、难以理解的狗屎帖子以及隐藏在“阅读更多”按钮下的过于私人的日记条目。昨天，Tumblr 宣布了其 Post+ 订阅功能的有限 Beta 测试，如果一切按计划进行，最终将允许 Tumblr 用户向每月支付 3.99 美元、5.99 美元或 9.99 美元的订阅者发布付费内容。 Tumblr 远不是第一个以这种方式寻求收入的社交媒体平台——Twitter 正在推出超级关注和提示罐功能，本周，YouTube 也宣布了一个打赏功能。甚至 Instagram 也在开发自己的 Twitter 超级关注版本，让用户可以创建“独家故事”。但是在一个社区的网站上，对于任何拥有平台的人（除了威尔·惠顿和尼尔·盖曼，他们只是在共鸣）来说，自己是一个“完全无法无天的荒地”，向付费内容的转变并没有张开双臂欢迎.货币化是一把双刃剑。对于 Tumblr 艺术家来说，在他们的博客上链接到第三方 Patreon 或 Ko-fi 网站并不被认为是不酷的，他们最热情的追随者可以在那里访问付费内容或向他们发送提示。因此，Post+ 似乎是 Tumblr 创收的一种显而易见的方式——与其将粉丝引导到其他网站，他们可以为粉丝建立一种方式来支持他们自己平台上的创作者，同时抽取 5% 的分成。考虑到 Twitter 将从其新的货币化工具中获得 3% 的收入，而 YouTube 和 Twitch 等以视频为中心的平台分别获得 30% 和 50% 的收入，这并非不合理。但 Tumblr 不是 Twitter、YouTube 或 Twitch。与其他平台不同，Tumblr 不允许您查看其他人的关注者数量，并且没有帐户经过验证。判断热门帖子背后的人是拥有 100 名关注者还是 100,000 名关注者并不容易，而用户更喜欢这种方式。但 Post+ 改变了这一点，在博主的用户名旁边有一个类似于 Twitter 蓝色支票的图标。 Tumblr 本周向一组精选的创作者推出了 Post+，其中包括作家和天体物理学家 Kaijuno。该平台在一个专门针对该产品的新博客上发布了 Post+，而不是其已建立的员工博客，用户知道该博客会检查重大公告。因此，作为获得访问权限的最多公众用户，这位 24 岁的博主成为愤怒的 Tumblrites 强烈反对的目标，他们不想看到他们最喜欢的社交媒体网站变成超级资本主义的地狱。当 Kaijuno 因 Beta 版 Post+ 测试而收到死亡威胁时，Tumblr 的工作人员进行了干预并谴责对 Post+ 用户的骚扰。 “我们想听听您喜欢什么，喜欢什么，以及您关心什么。即使它不是很好。告诉我们。我们可以接受，”Tumblr 在其员工博客上写道。 “我们永远不会接受这些创作者自今天下午以来遭受的有针对性的骚扰和威胁。 [...] 他们所做的只是测试一个功能。”在发帖之前，Tumblr 的一名员工代表直接联系了 Kaijuno，以了解他们的反对意见，但在用户已经因使用他们的产品而受到威胁之后，Tumblr 只能做这么多。 “我感觉自己像个牺牲品，因为他们没有事先宣布 Post+ 并且只给了少数人，这让我成为了一个非常生气的用户群的目标，而我只是想通过让人们可以选择为内容付费，” Kaijuno 告诉 TechCrunch。 “我知道会有一些反弹，因为用户讨厌对 Tumblr 进行任何形式的改变，但我认为反弹的首当其冲的将是员工，而 Beta 测试人员将免于其中的大部分。”\n为什么 Tumblr 用户认为货币化是一种威胁？这不是支持创作者是否有价值的问题，而是 Tumblr 是否有能力托管这样的服务。与 TechCrunch 交谈的多位长期狂热的 Tumblr 用户提到了 2020 年末发生的一起事件，当时人们的博客被垃圾邮件机器人入侵，这些机器人不断发布雷朋夏季促销广告。 “Tumblr 不是编码最完善的网站。破坏功能很容易，” Kaijuno 补充道。 “我认为任何涉及将你的财务信息交给 Tumblr 的事情都会遭到强烈反对。” Tumblr 用户还担心 Post+ 可能对隐私造成的影响——在有限的测试版中，Post+ 用户只有在联系 Tumblr 支持时才能阻止订阅他们博客的人。在订阅者骚扰的情况下，这可能会使博主处于潜在危险的境地。 “在我们今年秋天向所有美国创作者推出之前，Post+ 将允许创作者直接阻止订阅者，”Tumblr 发言人告诉 TechCrunch。尽管如此，现在占 Tumblr 48% 的极端在线 Z 世代知道，如果平台没有筹集到足够的资金来支付其员工和服务器费用，他们就不能指望该平台继续存在。 2018 年，在所有 NSFW 内容被禁止后，Tumblr 的月浏览量减少了近三分之一——从那时起，该平台的月流量一直相对停滞。一位前 Tumblr 员工告诉 TechCrunch，成为 Post+ 的功能最初是一个提示罐。但是 Tumblr 的高层（不直接与社区合作）将项目重定向到创建付费订阅产品。 “我认为 Tip Jar 将是一个巨大的进步，”Tumblr 博客 normal-horoscopes 的创作者说。通过他们在 Tumblr 上开发的核心受众，他们通过 Patreon 谋生，但他们认为 Post+ 对他们的业务没有吸引力。 “外部服务 [如 Patreon] 有更多选择、更多好处、更好的价格点，作为创作者，我可以选择如何向观众展示它们。”\n但付费订阅服务在 Tumblr 的集体眼中是不同的。对于一个在粉丝圈中蓬勃发展的网站，制作粉丝艺术和同人小说的创作者担心将这种衍生作品置于付费墙之后——Post+ 鼓励他们这样做——会让他们陷入法律困境。甚至主要的同人小说网站 Archive of Our Own 也禁止其用户链接到 Patreon 或 Ko-Fi 等网站。 “内置的货币化吸引了企业、公司账户，这些人通常首先赚钱，然后提供内容，”正常星座说。 “它改变了平台的文化。”在整个 Tumblr 上，心烦意乱的用户正在召集他们的追随者参加 Post+ 的反馈调查，以表达他们的不满。工作人员对此表示欢迎。 “与任何新产品发布一样，我们希望我们的用户能够就该功能将如何改变人们使用 Tumblr 的动态进行健康的讨论，”Tumblr 发言人告诉 TechCrunch。 “并非所有这些反馈都是积极的，这没关系。建设性的批评推动了我们创造产品的方式，并最终使 Tumblr 成为一个更好的地方。”多年来，Tumblr 的声音社区一直在质疑平台是否有可能以一种有机的方式建立新的收入来源。 Tumblr 的用户群对该网站的保护——尽管他们对员工缺乏信心——使其与 Facebook 等社交媒体巨头区别开来，后者可以将电子商务放在首位和中心，而无需太多审查。但即使在灾难性的色情禁令三年后，Tumblr 似乎也很难在不疏远使社交网络独一无二的人的情况下发展。 Reddit 和 Discord 等平台通过销售数字商品（例如用于奖励顶级海报的硬币或特殊表情符号）来维持生计。每家公司的财务需求都不同，但 Tumblr 选择通过 Post+ 货币化，凸显了该公司缺乏对自身社区愿望的洞察。", "note_en": "But like any social media company, Tumblr needs to keep itself afloat in order for its users to continue sharing esoteric fan art, incomprehensible shitposts, and overly personal diary entries hidden beneath a “Read More” button. Yesterday, Tumblr announced the limited beta test of its  Post+ subscription feature, which — if all goes as planned — will eventually let Tumblr users post paywalled content to subscribers that pay them $3.99, $5.99 or $9.99 per month.\n   Tumblr is far from the first social media platform to seek revenue this way — Twitter is rolling out  Super Follows and a  Tip Jar feature, and this week, YouTube announced  a tipping feature too. Even Instagram is working on its own version of Twitter’s Super Follows that would let users create “ exclusive stories.” But on a website with a community that prides itself as being a “completely lawless wasteland” for anyone with a platform (save for  Wil Wheaton and  Neil Gaiman, who are simply just vibing), the move toward paywalled content was not welcomed with open arms.\n  Monetization is a double-edged sword. It’s not considered uncool for a Tumblr artist to link to a third-party Patreon or Ko-fi site on their blog, where their most enthusiastic followers can access paywalled content or send them tips. So Post+ seems like an obvious way for Tumblr to generate revenue — instead of directing followers to other websites, they could build a way for fans to support creators on their own platform while taking a 5% cut. This isn’t unreasonable, considering that Twitter will take 3% revenue from its new monetization tools, while video-centric platforms like YouTube and Twitch take 30% and 50%, respectively. But Tumblr isn’t Twitter, or YouTube, or Twitch. Unlike other platforms, Tumblr doesn’t allow you to see other people’s follower counts, and no accounts are verified. It’s not as easy to tell whether the person behind a popular post has 100 followers or 100,000 followers, and the users prefer it that way. But Post+ changes that, giving bloggers an icon next to their username that resembles a Twitter blue check.\n  Tumblr rolled out Post+ this week to a select group of hand-picked creators, including  Kaijuno, a writer and astrophysicist. The platform announced Post+ on  a new blog specific to this product, rather than its established  staff blog, which users know to check for big announcements.  So, as the most public user who was granted access, the 24-year-old blogger was the target of violent backlash from angry Tumblrites who didn’t want to see their favorite social media site turn into a hypercapitalist hellscape. When Kaijuno received death threats for beta testing Post+, Tumblr’s staff intervened and condemned harassment against Post+ users.\n “We want to hear about what you like, what you love, and what concerns you. Even if it’s not very nice. Tell us. We can take it,” Tumblr wrote on its  staff blog. “What we won’t ever accept is the targeted harassment and threats these creators have endured since this afternoon. […] all they’re doing is testing out a feature.”\n Before making their post, a representative from Tumblr’s staff reached out to Kaijuno directly to check in on them regarding the backlash, but there’s only so much that Tumblr can do after a user has already been threatened for using their product.\n “I felt like the sacrificial lamb, because they didn’t announce Post+ beforehand and only gave it to a few people, which landed me in the crosshairs of a very pissed off user base when I’m just trying to pay off medical bills by giving people the option to pay for content,” Kaijuno told TechCrunch. “I knew there’d be some backlash because users hate any sort of change to Tumblr, but I thought that the brunt of the backlash would be at the staff, and that the beta testers would be spared from most of it.”\n Why do Tumblr users perceive monetization as such a threat? It’s not a question of whether or not it’s valuable to support creators, but rather, whether Tumblr is capable of hosting such a service. Multiple long-time, avid Tumblr users that spoke to TechCrunch referenced an incident in late 2020 when people’s blogs were being hacked by spam bots that posted incessant advertisements for a Ray-Ban Summer Sale.\n “Tumblr is not the most well-coded website. It’s easy to break features,” Kaijuno added. “I think anything involving trusting Tumblr with your financial information would have gotten backlash.”\n Tumblr users also worried about the implications Post+ could have on privacy — in the limited beta, Post+ users only have the ability to block people who are subscribed to their blog if they contact Tumblr support. In cases of harassment by a subscriber, this could leave a blogger vulnerable in a potentially dangerous situation.\n “Ahead of our launch to all U.S.-based creators this fall, Post+ will allow creators to block subscribers directly,” a Tumblr spokesperson told TechCrunch.\n  Still, the Extremely Online Gen Z-ers who now make up  48% of Tumblr know that they can’t expect the platform to continue existing if it doesn’t pull in enough money to pay for its staff and server fees. In 2018, Tumblr lost  almost one-third of its monthly page views after all NSFW content was banned — since then, the platform’s monthly traffic has remained relatively stagnant.\n  A former Tumblr employee told TechCrunch that the feature that became Post+ started out as a Tip Jar. But higher-ups at Tumblr — who do not work directly with the community — redirected the project to create a paywalled subscription product.\n “I think a Tip Jar would be a massive improvement,” said the creator behind the Tumblr blog  normal-horoscopes. Through the core audience they developed on Tumblr, they make a living via Patreon, but they don’t find Post+ compelling for their business. “External services [like Patreon] have more options, more benefits, better price points, and as a creator I get to choose how I present them to my audience.”\n But a paywalled subscription service is different in the collective eyes of Tumblr. For a site that thrives on fandom, creators that make fan art and fanfiction worry that placing this derivative work behind a paywall — which Post+  encourages them to do — will land them in legal trouble. Even Archive of Our Own, a major fanfiction site,  prohibits its users from linking to sites like Patreon or Ko-Fi.\n “Built-in monetization attracts businesses, corporate accounts, people who are generally there to make money first and provide content second,” said normal-horoscopes. “It changes the culture of a platform.”\n Across Tumblr, upset users are rallying for their followers to take Post+’s  feedback survey to express their frustrations. The staff welcomes this.\n  “As with any new product launch, we expect our users to have a healthy discussion about how the feature will change the dynamics of how people use Tumblr,” a Tumblr spokesperson told TechCrunch. “Not all of this feedback will be positive, and that’s ok. Constructive criticism fuels how we create products and ultimately makes Tumblr a better place.”\n Tumblr’s vocal community has been empowered over the years to question whether it’s possible for a platform to establish new revenue streams in a way that feels organic. The protectiveness that Tumblr’s user base feels for the site — despite their lack of faith in staff — sets it apart from social media juggernauts like Facebook, which can  put ecommerce front and center without much scrutiny. But even three years after the catastrophic porn ban, it seems hard for Tumblr to grow without alienating the people that make the social network unique.\n Platforms like Reddit and Discord have remained afloat by selling digital goods, like coins to reward top posters, or special emojis. Each company’s financial needs are different, but Tumblr’s choice to monetize with Post+  highlights the company’s lack of insight into its own community’s wishes.", "posttime": "2021-07-23 06:52:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "订阅,fandom,tumblr", "title": "粉丝天堂的麻烦：Tumblr 用户强烈反对其 Beta 版订阅功能", "title_en": "\n\t\t\t\tTrouble in fandom paradise: Tumblr users lash out against its beta subscription feature\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/tumblr-community-lash-out-post-plus-subscription/", "via": "", "real_tags": ["订阅", "fandom", "tumblr"]}, {"category": "", "categoryclass": "", "imagename": "7d3c8e80c7f7775265e373b7a25ddc8b.jpg", "infoid": 1069128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔即将推出的 Alder Lake 平台的新泄漏表明，这些芯片的性能可能优于 AMD 的 Ryzen 5000 系列。基准测试显示，旗舰英特尔酷睿 i9-12900K 在 Cinebench R20 中的性能比 AMD 的 Ryzen 5950X 在多核测试中高出约 18%，在单核测试中高出惊人的 28%。泄密者 OneRaichu 表示，i9-12900K 的合格样品在 Cinebench R20 的多核测试中获得了 11,600 以上的分数，在单核测试中获得了 810 分以上。这些结果使处理器在与 AMD 的直接竞争中遥遥领先，尤其是在单核性能方面。在 Guru3D 的测试中，锐龙 5950X 在 Cinebench R20 中获得了 10,409 的多核分数和 643 的单核分数。这使 12900K 的单核性能提高了约 11%，多核性能提高了 23%。泄密者表示，12900K 的结果是在没有超频的情况下通过水冷收集的，因此最终得分可能会更高。 PCGamer 的测试对 12900K 更有利。它对 5950X 的测试表明，12900K 在多核测试中的速度可以提高 18%，在单核测试中可以提高 28%。更有趣的是，测试显示12900K的速度是它将在多核测试中取代的i9-11900K的两倍多。 12900K 的分数与上周进行的性能评估相匹配。在多核和单核性能提升之间，12900K 可以巩固英特尔作为游戏和生产力的首选品牌。也就是说，我们还没有任何确定的基准。据传，Core i9-12900K 配备 16 个内核和 24 个线程，时钟速度高达 5.3GHz。该处理器采用领先的英特尔Alder Lake平台，采用big.LITTLE内核设计，在同一处理器上利用高性能和高效率的内核。\n这种混合设计出现在许多移动处理器中。处理器能够将工作委派给适当的内核，而不是用大量的电源来打包每个内核。因此，要求高的任务将交给大核，而轻量级的任务将交给小核，从而提高了处理器的效率。有传言称即将推出的 Windows 11 将利用这种混合设计，将单核性能提高多达 8.2%。我们不知道泄露的基准测试使用的是什么操作系统，更不用说整体系统配置了。但是，Windows 11 可以进一步改善结果，特别是在强调单核的任务中。英特尔还没有揭开 Alder Lake 的面纱。尽管多次泄漏和谣言让我们对范围如何形成有了一个不错的了解，但我们必须等待发布和进一步测试才能得出任何明确的结论。如果结果接近 OneRaichu 的建议，英特尔可能会在令人失望的 Rocket Lake 发布后爬回榜首。", "note_en": "A new leak for Intel’s upcoming  Alder Lake platform shows that the chips may outperform AMD’s Ryzen 5000 series. The benchmark shows the flagship Intel Core i9-12900K outperforming AMD’s Ryzen 5950X in Cinebench R20 by around 18% in the multi-core test and a staggering 28% in the single-core test.\n Leaker  OneRaichu said a qualification sample of the i9-12900K earned a score of above 11,600 in the multi-core test and above 810 in the single-core test in Cinebench R20. Those results put the processor firmly ahead of its direct competition from AMD, particularly when it comes to single-core performance.\n  In  Guru3D’s testing, the Ryzen 5950X earned a multi-core score of 10,409 and a single-core score of 643 in Cinebench R20. That puts the 12900K at around 11% faster in single-core performance and 23% faster in multi-core performance.\n The leaker says the results for the 12900K were gathered with a water-cooling without overclocking, so it’s possible the final score could be even higher.\n PCGamer’s tests are even more favorable to the 12900K. Its testing of the 5950X reveals that the 12900K could be as much as 18% faster in the multi-core test and 28% faster in the single-core test. Even more interesting, the testing reveals that the 12900K is more than twice as fast as the i9-11900K that it will replace in the multi-core test.\n The scores for the 12900K match  a performance estimate that made the rounds last week. Between multi-core and single-core performance gains, the 12900K could cement Intel as the go-to brand for both gaming and productivity. That said, we don’t have any firm benchmarks yet.\n  The  Core i9-12900K is rumored to come with 16 cores and 24 threads with a boost clock speed of up to 5.3GHz. Leading Intel’s Alder Lake platform, the processor adopts a big.LITTLE core design that utilizes high-performance and high-efficiency cores on the same processor.\n This hybrid design shows up in many mobile processors. Instead of packing each core with a ton of power, the processor is able to delegate work to an appropriate core. So, a demanding task will go to the big core while a lightweight one will go to a little core, which improves the processor’s efficiency.\n The upcoming Windows 11 is  rumored to take advantage of this hybrid design, offering up to an 8.2% improvement in single-core performance. We don’t know what operating system the leaked benchmarks were using, much less the overall system configuration. However, Windows 11 could improve results further, particularly in tasks that stress a single core.\n Intel hasn’t lifted the veil on Alder Lake yet. Although multiple leaks and rumors give us a decent idea of how the range is shaping up, we have to wait for launch and further testing to draw any firm conclusions. If the results are anywhere near what OneRaichu is suggesting, Intel could crawl its way back to the top after the disappointing  Rocket Lake launch.", "posttime": "2021-07-23 06:49:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,intel,性能", "title": "泄露的英特尔 i9-12900K 基准测试显示优于 Ryzen 5950X", "title_en": "Leaked Intel i9-12900K Benchmark Shows Gains Over the Ryzen 5950X", "transed": 1, "url": "https://www.digitaltrends.com/computing/leaked-intel-12900k-benchmark-outperforms-amd-5950x/", "via": "", "real_tags": ["英特尔", "intel", "性能"]}, {"category": "", "categoryclass": "", "imagename": "d5d1b828613c2c64957da08fdccd57c8.png", "infoid": 1069127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "机密计算支持始终加密且可验证的数据处理 - 在云中和其他地方。开发过去需要神秘知识和重大代码更改的机密应用程序。使用 EGo，您可以跳过它并像往常一样开发 Go 代码。使用 EGo，您无需重构您的应用程序即可在安全的飞地中运行它。只需使用三个简单的命令来构建、签名和运行您的代码——无论是 10 行还是 100,000 行具有复杂依赖关系的 Go。最好的事？ EGo 是完全开源的。在这篇博文中，我们将分享 EGo 的设计方法、我们在开发 EGo 时面临的最大挑战以及我们的一些关键原则。此外，我们还对 EGo 未来的其他计划进行了小规模预览。当我们开始在 EGo 上工作时，我们已经为可信执行环境构建了一个名为 Edgeless RT 的 SDK。这个项目是我们全面支持 Go 的内部解决方案，但与大多数其他 SDK 一样，它对新用户有很大的进入门槛。在使用 RT 时，我们问自己如何使机密计算更易于访问；特别是对于在机密计算社区中迈出第一步的新用户。我们的愿景很明确：我们希望创建一个提供有意义的易用性的 SDK。我们希望通过尽可能接近已知且经过验证的 Go UX 来实现这一目标。这将通过仔细选择要突出显示和忽略哪些机密计算的细节来完成，将一些更令人困惑的方面移到背景中，使最相关的功能成为中心舞台。经过仔细考虑，基于 Go 构建 SDK 感觉是一个自然的选择。首先，Go 是最相关和最直接的编程语言之一。最重要的是，它的内存安全功能提供了一个理想的安全层。但最重要的是，我们希望为那些对机密计算安全功能感兴趣但不一定对学科的来龙去脉感兴趣的开发人员提供一个简单的解决方案。针对那些最能从机密计算中受益的用例定制 EGo 是合乎逻辑的步骤——而且由于云原生空间为此类实现提供了最大的潜力，我们寻求支持其领先的编程语言。很难预测未来将在机密计算中建立什么标准，但我们认为，大多数现实世界的应用程序迟早会默认在安全区中运行大部分代码。通过将所有代码移动到 enclave，移植已经存在的应用程序成为一个简单的过程。在将 Go 移植到 enclave 时，我们必须处理语言及其编译器的一些技术上具有挑战性的细节。一种是 Go 程序如何访问操作系统的服务，如文件系统或网络套接字。 Linux 上的大多数语言都编译为与 libc 接口的本机代码。 （libc 实现了标准 C 库以及 POSIX API。）反过来，libc 执行系统调用以从操作系统内核请求服务。 Go 然而直接执行 SYSCALLs 本身。在飞地内，这是一条非法指令，因为按照设计，不应访问 TEE 之外的任何内容。为了解决这个问题，我们必须修改 Go 编译器，以便将 SYSCALL 重定向到 libc：\n然后，飞地的 libc/syscall 层要么在内部处理系统调用，要么调用主机，例如，在网络上写入文件或发送数据。此外，我们必须扩展 Open Enclave。 Open Enclave 是机密计算领域最成熟的 SDK 之一，但它仍然缺乏一些基本的 POSIX 功能，例如 pthread 和 mmap。幸运的是，当我们开始开发 EGo：Edgeless RT 时，我们已经构建了 Open Enclave 的扩展版本。你可以在这里找到 Open Enclave，它是一个具有卓越代码质量的项目。最后思考：使用 EGo，我们忽略了我们从其他 CC SDK 中了解到的关于工作流的所有信息。我们的方法将用户放在首位。因此，我们让 EGo 尽可能接近 Go，同时增加了签名、证明和密封的关键功能。设计工具和 API，使其难以被错误使用：EGo 消除了深入研究高级机密计算主题（例如所需的加密参数）的需要。相反，当用户调用“ego sign myapp”时，如果尚不存在，EGo 只会生成一个合适的密钥。 “SealWithProductKey(plaintext []byte)”也是如此：此 API 函数处理所有 SGX 密封细节，例如添加一些元数据以确保密钥在 CPU 微码更新后仍然有效。这使得开发变得简单而安全，并温和地促使用户从一开始就正确使用 EGo。实施是关键：在 EGo 中，我们将开发职责分给了三个开发人员：一名开发人员担任产品负责人，并首先创建了一个工作原型以确保项目的可行性。然后，所有三位开发人员详细计划了进一步的实施，然后他们将工作量分摊到自己身上。自然，这需要额外的时间，但同时通过公共项目库确保高质量，然后通过单元测试、集成测试和代码审查迭代扩展。尽管 EGo 已经使构建和部署 Go 机密应用程序变得非常容易，但我们才刚刚开始。以下是我们目前正在开发的功能的简短概述： 可重现的构建：我们认为机密计算与开源结合特别有意义：对一段封闭源代码的远程证明声明的意义是有限的。用户应该能够建立从证明报告到 Github 项目等的连接。理想情况下，飞地的身份应该映射准确的源代码版本。为了实现这一点，我们将向 EGo 添加可重现的构建，以便（高级）用户可以编译应用程序并将生成的 enclave 哈希与证明报告中的哈希进行比较。\n云外机器上的简化证明：目前，如果您想在云环境之外运行 EGo，您必须设置一些证明基础设施。当然，这很乏味，与我们追求的简单性不符。这就是为什么我们正在考虑简化证明的方法，以便 EGo 可以在开发机器或本地部署上使用而不会出现任何进一步的麻烦。透明文件加密：这是一个还在考虑阶段的功能。机密计算环境中的文件加密比在传统环境中更难实现，这就是为什么一些 SDK 一开始不提供它的原因。那些这样做，要么有缺陷，要么有使用限制。目前，EGo 有一个未加密的主机文件系统和一个临时的飞地内存文件系统。我们的目标是通过使用透明加密挂载目录的能力来补充这一点。现在好奇吗？如果您想了解有关 EGo 的更多信息，您应该查看我们的 GitHub 存储库或使用以下命令开始：此外，您应该查看由 EGo 维护者 Moritz Eckert 于 6 月 30 日举办的网络研讨会“轻松构建机密 Go 应用程序”。请点击这里免费注册。", "note_en": "Confidential computing enables the always-encrypted and verifiable processing of data — in the cloud and elsewhere. Developing confidential apps used to require arcane knowledge and significant code changes.  With EGo, you can skip that and develop your Go code as usual. With EGo, you don’t need to refactor your app to run it in a secure enclave. Just use three simple commands to build, sign, and run your code — be it 10 or 100,000 lines of Go with complex dependencies. Best thing? EGo is completely open-source.\n In this blog post, we share EGo’s design approach, the biggest challenges we faced while developing EGo, and some of our key principles. Furthermore, we give a small preview of what else is planned for EGo in the future.\n  When we started our work on EGo, we had already built an SDK for Trusted Execution Environments called  Edgeless RT. This project was our internal solution for comprehensive Go support, but like most other SDKs, it had significant entry barriers for new users. While using RT, we asked ourselves how we could make confidential computing more accessible; especially for new users who are taking their first steps in the  confidential computing community.\n Our vision was clear: we wanted to create an SDK that offers meaningful  ease of use. We wanted to achieve this by sticking as closely as possible to the known and proven Go UX. This would be done by carefully choosing which specifics of confidential computing to highlight and which to ignore, moving some of the more confusing aspects into the background so the most relevant features take the center stage.\n After careful consideration, building the SDK based on Go felt like a natural choice. First off, Go is one of the most relevant and straightforward programming languages. On top of that, its memory safety features provide a desirable layer of security. But most of all, we wanted to provide a simple solution for developers who are interested in confidential computing security features but not necessarily in the ins and outs of the discipline. It was a logical step to tailor EGo to those use cases which can benefit from confidential computing the most — and since the cloud-native space offers the largest potential for such implementations, we sought to support its leading programming language.\n  It is difficult to predict what standards will be established in confidential computing in the future, but we think it is likely that, sooner or later, most real-world apps will run most of their code within the enclave by default. By moving all code into the enclave, porting already existing applications becomes a straightforward process.\n  When porting Go to the enclave, we had to deal with some technically challenging specifics of the language and its compiler. One is how Go programs access the operating system’s services like filesystems or network sockets. Most languages on Linux that compile to native code interface with libc. (libc implements the standard C library as well as the POSIX API.) libc, in turn, executes system calls to request services from the OS’s kernel. Go however directly executes SYSCALLs itself. Inside an enclave, this is an illegal instruction since nothing is supposed to access anything outside the TEE by design. To solve this, we had to modify the Go compiler such that SYSCALLs are redirected to libc instead:\n  The enclave’s libc/syscall layer then either handles syscalls internally or calls out to the host, e.g., to write files or send data on a network.\n Additionally, we had to extend Open Enclave. Open Enclave is one of the most mature SDKs in the confidential computing realm, but it still lacks some essential POSIX features such as pthread and mmap. Luckily, we had already built an extended version of Open Enclave when we started the development of EGo:  Edgeless RT.  You can find Open Enclave here, it is a project with exceptional code quality.\n  Think from the end: With EGo, we ignored everything we knew about workflows from other CC SDKs. Our approach puts the user first. Therefore, we kept EGo as close as possible to Go, while adding the key features of signing, attestation, and sealing.\n Design tools and APIs such that they are hard to use incorrectly: EGo removes the need to take a deep dive into advanced confidential computing topics such as required crypto parameters. Instead, when a user calls “ego sign myapp”, EGo simply generates a fitting key if none exists yet. The same happens with “SealWithProductKey(plaintext []byte)“: this API function handles all the SGX sealing details like adding some metadata to ensure that the key remains valid after a CPU microcode update. This makes development simple as well as secure and gently nudges users towards using EGo correctly from the start.\n Implementation is key: With EGo, we split our development duties between three devs: One developer acted as the product owner and first created a working prototype to ensure the feasibility of the project. Further implementation was then planned in detail by all three developers, who then split the workload among themselves. Naturally, this took additional time but simultaneously ensured high quality via the common project base, which was then expanded iteratively with unit tests, integration tests, and code reviews.\n  Although EGo already makes it super easy to build and deploy Go confidential apps, we’re just getting started. Here is a short overview of the features we are currently working on:\n Reproducible builds: We think that confidential computing especially makes sense in combination with open source: the meaningfulness of a remote attestation statement over a piece of closed source code is limited. Users should be able to make a connection from an attestation report to, e.g., a Github project. Ideally, an enclave’s identity should map an exact source code version. To achieve this, we will add reproducible builds to EGo so that (advanced) users can compile an app and compare the resulting enclave hash with the one from the attestation report.\n Simplified attestation on machines outside the cloud: Currently, if you would like to run EGo outside of a cloud context, you have to set up some attestation infrastructure. Of course, this is tedious and does not match the simplicity we are going for. That’s why we are thinking of ways to simplify attestation so that EGo can be used on dev machines or on-premises deployments without any further hassle.\n Transparent file encryption: This is a feature that is still in the consideration stage. File encryption in a confidential computing context is trickier to get right than in a conventional context, which is why some SDKs don’t offer it in the first place. Those that do, either have flaws or usage limitations. Currently, EGo has an unencrypted host filesystem and a temporary in-enclave-memory filesystem. Our goal would be to complement this with the ability to mount directories with transparent encryption.\n Curious now? If you want to learn more about EGo you should check out our  GitHub repo or just get started with the following commands:\n  Also, you should check out the  webinar “Build Confidential Go Apps with Ease” held by EGo maintainer Moritz Eckert on June 30.   Click here to register for free.", "posttime": "2021-07-23 06:48:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "构建,built,ego", "title": "我们如何构建 EGo", "title_en": "How we built EGo", "transed": 1, "url": "https://blog.edgeless.systems/how-we-built-ego-c02220360503", "via": "", "real_tags": ["构建", "built", "ego"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069126, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为新西兰人找到安全且顶级的新西兰赌场并不容易。新西兰 CasinoDeps 选择了由 UKGC 和 MGA 保护和许可的最佳赌场网站。 --- 如果您是喜欢没有 Gamstop 赌博计划的在线赌场的英国玩家，请查看 William Terry 选择的 Non Stop 赌场。它们与英国的常规网站一样，评级最高且合法。 --- 寻找接受英国玩家的非 Gamstop 赌场网站？ Bradley Oliva 提供了一份 Gap 赌场列表，这些赌场是没有该计划的 Gamstop 品牌。 --- Peliopas voi auttaa sinua nettikasinot。 Tunne kasinopelisi ennen kuin pelaat。 --- 新的英国赌场正在发布 - 对非英国玩家也是独立的和开放的，查看列表，你可以在这里找到它。 --- 据 PokerPlayerNewspaper 报道，英国赌博委员会的赌场不在 gamstop 上，并且已经发现了缺陷。 --- --- Lyd kaikki parhaat netti kasinot ja niiden kasinobonukset ktevsti yhdelt sivulta！ --- 通过选择信誉良好且安全的澳大利亚在线赌场，玩得开心并轻松获得大奖。 Casinority 是您选择网络上最好的赌场网站的可靠助手。 --- --- 正在寻找值得信赖的在线赌场？查看 CasinoPilot.co.uk 上的最佳网站列表，您可以在这些网站上安全地玩游戏。 --- 从 NewCasinoUK.com 上精选的最新英国赌场网站中选择一家新的在线赌场，并获得独家奖金。 --- --- 日本人向けの( ベストオンラインカジノレビュー)。 --- 我们建议您访问 Casino-online.com 以查找有关美国最佳在线赌场的资源。您将玩 100 次免费旋转的老虎机（无存款奖金）。 --- 加拿大最好的在线赌场。您值得信赖的评论、评级和寻找加拿大最佳在线赌场的来源 --- www.Casimboo.com 是最新的在线赌场，为英国和更多地区增光添彩。玩家可以享受 100 款经过验证的游戏，保证支付。这个很棒的在线赌场受 UKGC 和 MGA 监管，这意味着您将获得公平和安全的游戏体验。 --- Justuk.club 为英国玩家提供安全且经过检查的非赌博娱乐场列表。由杰森法雷尔验证。 --- 你是 PS4 的粉丝吗？访问 PS4 主页以获取最新的 PlayStation 4 文章、新闻、评论等。视频游戏迷应该访问 GamerBolt.com 以获取有关视频游戏场景的最新信息和信息。使用 PS5 Home 准备 PlayStation 5 - PlayStation 5 之家 专业赌徒可以使用此非 GamStop 赌场列表在英国免费玩在线赌场游戏。澳大利亚正在改变他们的赌博规定。在线赌场澳大利亚将更难玩，但澳大利亚人仍然有一些选择。寻找最好的赌场玩？那么 BondiBet 赌场是您的选择。对于所有讲中文的赌徒来说，最好的在线赌场评论网站 CasinoHex-CN 提供了有关在线赌博的详细指南。", "note_en": "It&#39;s not easy to find safe and  top NZ casinos for Kiwis. New Zealand CasinoDeps has picked the best casino sites secured and licensed by the UKGC and MGA. --- If you&#39;re a British player who prefers online casino without Gamstop gambling scheme, check out  Non Stop casinos picked by William Terry. They are top-rated and legal like regular UK sites. --- Looking for non Gamstop casino websites accepting UK players? Bradley Oliva has provided a list of  Gap casinos that are Gamstop-free brands without the scheme. --- Peliopas voi auttaa sinua  nettikasinot. Tunne kasinopelisi ennen kuin pelaat. --- New UK casinos are being released - independent and open for non-UK players as well, check the list,  you can find it here. --- The UK gambling commission have  casinos which is not on gamstop and flaws have been found, PokerPlayerNewspaper reports. --- --- Lyd kaikki parhaat  netti kasinot ja niiden kasinobonukset ktevsti yhdelt sivulta! --- Have fun and get big wins easy by choosing reputable and safe  Australian online casino. Casinority is your reliable assistant in opting only for the best casino sites in the web. --- --- Looking for a trusted place to play casino online? Check a list of the  best sites on CasinoPilot.co.uk where you can play in a safe environment.\n --- Choose a  new online casino from a selection of the latest UK casino sites on NewCasinoUK.com and grab an exclusive bonus. --- --- 日本人向けの( ベストオンラインカジノレビュー)。\n --- Check the best  online casinos and play pokies only at trusted sites. --- We recommend that you visit  casino-online.com to find resources on the best online casinos in USA.  You will play slots with 100 free spins (no deposit bonus). --- Best online casino  in Canada. Your trusted source for reviews, ratings, and finding the best online casinos in Canada --- www.Casimboo.com  is the latest online casino to grace the UK and many more areas. Players can enjoy 100&#39;s of verified games with guaranteed pay-outs. This awesome online casino is regulated by the UKGC and the MGA meaning you&#39;ll get a fair and safe gaming experience. --- Justuk.club  offers a secure and checked list of non gamstop casinos for UK players. Verified by Jason Farrell. --- Are you a  PS4 fan? Visit  PS4 Home for the latest PlayStation 4 articles, news, reviews &amp; more.\n    Video games fans should visit  GamerBolt.com for the latest informative news and information surrounding the video game scene.\n    Prepare for the PlayStation 5 with   PS5 Home - The Home of PlayStation 5        Professional gamblers can use this  non GamStop casinos listing to get free access to playing online casino games in the United Kingdom.    Australia is changing their gambling regulations.  Online casino Australia will be harder to play but there are still some options for Aussies. Looking for the best casino to play at? Then  BondiBet casino is your option to choose.\n For all Chinese-speaking gamblers best online casino review site  CasinoHex-CN offers a detailed guide about online gambling.", "posttime": "2021-07-23 06:48:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,电子游戏,game,赌场", "title": "Vgmaps.com：电子游戏地图集", "title_en": "Vgmaps.com: The Video Game Atlas", "transed": 1, "url": "http://vgmaps.com/", "via": "", "real_tags": ["游戏", "电子游戏", "game", "赌场"]}, {"category": "", "categoryclass": "", "imagename": "905fb94d8ef8a9de67f7e1ca444ef116.jpeg", "infoid": 1069125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着 COVID-19 病例在全国范围内继续攀升——一些州出现垂直上升——公共卫生专家再次强烈呼吁美国人获得现成的高效、安全的 COVID-19 疫苗。尽管疫苗剂量供过于求，但全国只有约 49% 的地区全面接种了疫苗——而且许多州和地区的疫苗接种覆盖率仍然较低。与此同时，超传播的 delta 冠状病毒变种继续在未接种疫苗的社区中肆虐。它现在占全国测序病例的 83%。虽然病例总体上升，但在疫苗接种率低的地方上升最快。例如，路易斯安那州只有大约 36% 的人口接种了疫苗，而且是增长最快的地区之一。每日新增病例数现在可与冬季激增的病例数相媲美。但该国约有五分之一的新病例发生在佛罗里达州。该州的头号热点是杰克逊维尔周边地区，该地区感染率最高。其中包括贝克县，该县只有 20% 的人口接种了疫苗。阿肯色州、密苏里州、内华达州和密西西比州的疫苗接种覆盖率也相对较低。美国疾病控制与预防中心主任罗谢尔·瓦伦斯基周四在白宫新闻发布会上说：“我们正处于这场大流行病的又一个关键时刻，病例再次增加，一些医院已达到其产能。” “我们需要团结起来，作为一个国家，团结一致，用我们现有的工具保护我们自己、我们的孩子、我们的社区、我们的国家和我们的未来的健康。”在新闻发布会上，瓦伦斯基和美国国家过敏和传染病研究所所长安东尼·福奇重申了每个人都应该接种疫苗的所有理由，并试图消除对所谓“突破性”感染的担忧。 “这些疫苗是我们在现代医学中最有效的疫苗之一，”瓦伦斯基说，他提到了美国可用的三种疫苗的高有效率。这两种 mRNA 疫苗（辉瑞/BioNTech 和 Moderna 的疫苗）在临床试验中的有效率都在 90% 以上。强生公司的疫苗效力稍低——在美国为 72%——但仍然相当高。请注意，这些数字非常高，但不是 100%，福奇警告说。 “预计接种后会出现感染，”他说，并补充说，“没有一种疫苗是 100% 有效的。”\n福奇强调，疫苗的主要目标是预防严重疾病和死亡——这三种疫苗都做得很好，即使是针对 delta 变体也是如此。例如，在对接种过辉瑞 / BioNTech 疫苗的人进行的真实世界研究中，完整的两剂疫苗在预防因 delta 变体感染而住院方面的有效率为 96%。同样，阿斯利康疫苗（其设计与强生疫苗非常相似）对 delta 住院治疗的有效率为 92%。此外，初步实验室研究表明，所有三种疫苗都可以促进中和抗体和持久的细胞防御，从而阻止 delta 变体和其他相关变体。目前，97% 的 COVID-19 住院患者未接种疫苗，99.5% 死于 COVID-19 的患者也未接种疫苗。尽管如此，一些接种疫苗的人会在达到完全接种疫苗的状态后被感染——也就是说，在接种第二剂 mRNA 疫苗或接种一剂强生疫苗两周后。通常，这些突破性感染没有症状或症状相对较轻。值得注意的是——正如昨天发表在 Slate 上的一篇文章所做的那样——相对轻微的感染不一定是无害的。他们可能会很不愉快。但是在家里躺几天，感觉浑身发冷，发烧和发冷，这比住院、需要吸氧、或者更糟——进入重症监护室，使用呼吸机，甚至死亡要好得多. “即使我们在接种疫苗后看到感染……对严重疾病的有效性仍然很大，”福奇说，“这又是我们所有人不断说的另一个论点：接种疫苗。”在与记者的反复交流中，福奇还驳斥了对强生疫苗对 delta 变体无效的无端担忧。这种担忧主要是由本周《纽约时报》上的一篇文章引起的，该文章专注于仅关注抗体水平的未发表数据。该研究（尚未经过同行评审）声称，与针对其他病毒版本的中和抗体水平相比，强生疫苗导致针对 delta 变体的中和抗体水平较低。 《纽约时报》宣称，数据表明，接受强生一次性注射的数百万人现在需要加强注射。但专家很快予以回击。他们指出，疫苗不会单独引发抗体——它们还会引发其他关键的细胞免疫防御，以防止感染和疾病。此外，没有明确的中和抗体水平，在这一点上一个人被认为是不受保护的。最后，其他数据表明强生疫苗接种后的免疫反应是稳健和持续的。简而言之，该研究并未着眼于疫苗的功效，而且数据并未表明需要加强免疫。在周四的新闻发布会上，福奇称强生疫苗是“一种非常有效的疫苗”。 “现在没有理由相信服用强生疫苗的人需要任何形式的加强剂量，”他说。 “没有数据表明情况确实如此。”\n《泰晤士报》此后对原报道和标题进行了重大修改，但该报并未注意到任何这些变化。标题不再称疫苗“无效”；相反，标题说它“可能不太有效”。文章的顶部也进行了修改，以指出未发表的数据可能无法反映疫苗功效。为了提高美国的疫苗接种率，福奇和瓦伦斯基周四重申，迄今为止的全部数据表明，手头的疫苗对大流行的冠状病毒，甚至是 delta 变体都是安全且高效的。在安全性方面，疫苗通常会产生轻微、短暂的副作用，例如注射部位周围的疼痛，以及可能一天左右的天气感觉。但严重的副作用极为罕见。尽管一些未接种疫苗的人表示他们担心未确定的长期副作用，但疫苗接种的历史数据表明，如果出现任何副作用，他们往往会在接种疫苗后六周内发生。因此，新的副作用不太可能突然变得明显。尽管突破性病例始终是任何疫苗的关注点，但接种疫苗的人如果想保持谨慎，可以继续遵循一些健康措施，例如戴口罩和避开人群。 Walensky 补充说，在 delta 变种的传播中，对于接种率低且传播率高的地区的人们来说，采取额外的预防措施可能值得考虑。 “如果你没有接种疫苗，请认真对待 delta 变种，”瓦伦斯基恳求道。 “这种病毒没有松懈的动力，它仍在寻找下一个易受感染的人。请考虑接种疫苗并采取预防措施，直到你这样做为止。”对于那些从 COVID-19 中康复的人，Walensky 指出，疾病预防控制中心“强烈建议”他们也接种疫苗。她说：“它为您提供更持久、更强大的保护，其覆盖的广度和深度足以克服目前在该国流行的变种。”对于那些仍然犹豫是否接种疫苗的人，瓦伦斯基敦促他们仔细检查他们犹豫背后的原因。 “如果你对疫苗仍有疑问，我们欢迎他们，”她说。 “我对您的要求是：提出您的问题。与您的医疗保健提供者交谈。与您的药剂师交谈。与已接种疫苗的朋友和邻居交谈并回答您的问题，以便您在做出这个关键决定时感到舒适和知情.”这一点与最近在阿拉巴马州一篇令人心碎的文章中发表的另一篇文章有​​关，其中一位在伯明翰医院工作的医生描述了她在病床上照顾未接种疫苗的 COVID-19 患者的情况。这篇文章之所以感动有几个原因，包括对错误信息如何困扰这种大流行的令人心碎的描述。文章援引一位医生的话说：\n当我接诊一名未接种疫苗的新 COVID 患者时，我尽量不带偏见，但我真的只是开始问他们，“你为什么还没有接种疫苗？”我只会直截了当地问它，以尽可能不带评判的方式。他们中的大多数人都非常诚实，他们会给我答案。 “我和这个人谈过，我在 Facebook 上看到了这件事，我收到了这封电子邮件，我在新闻上看到了这个，”你知道，这些都是我没有接种疫苗的原因。我经常问他们的一个问题是，您是否与您的初级保健医生预约并征求他们对您是否应该接种疫苗的意见？到目前为止，没有人对这个问题的回答是肯定的。美国医学协会最近的一项民意调查发现，超过 96% 的执业医生已全面接种 COVID-19 疫苗。在剩下的人中，45% 的人表示他们计划接种疫苗。", "note_en": "As COVID-19 cases continue to climb across the country—with some states seeing vertical rises—public health experts are once again emphatically imploring Americans to get the highly effective, safe COVID-19 vaccines that are readily available.\n Despite an oversupply of vaccine doses, only about 49 percent of the country is fully vaccinated overall—and many states and areas have lower vaccination coverage still. Meanwhile, the hypertransmissible delta coronavirus variant continues to blaze through unvaccinated communities. It now accounts for 83 percent of sequenced cases nationwide.\n While cases are rising overall, they&#39;re rising fastest in places with low vaccination rates. Louisiana, for instance, only has about 36 percent of its population fully vaccinated, and it is seeing one of the steepest rises. Daily new case counts now rival those seen in the winter surge. But about one in every five new cases in the country is in Florida. The state&#39;s top hot spot is the area around Jacksonville, which has the highest rates of infection in the state. That are includes Baker county, which has only 20 percent of its population vaccinated. Arkansas, Missouri, Nevada, and Mississippi are also seeing sharp rises—all with relatively low vaccination coverage.\n &#34;We are yet at another pivotal moment in this pandemic, with cases rising again and some hospitals reaching their capacity,&#34; Rochelle Walensky, director of the Centers for Disease Control and Prevention, said in a White House press briefing Thursday. &#34;We need to come together as one nation, unified in our resolve to protect the health of ourselves, our children, our community, our country, and our future, with the tools we have available.&#34;\n  In the press briefing, Walensky and Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, reiterated all the reasons that everyone should get vaccinated and also tried to tamp down concern over so-called &#34;breakthrough&#34; infections.\n &#34;These vaccines are some of the most effective that we have in modern medicine,&#34; Walensky said, referencing the high efficacy rates of the three vaccines available in the US. The two mRNA vaccines (Pfizer/BioNTech and Moderna&#39;s vaccines) had efficacy rates above 90 percent in clinical trials. The Johnson &amp; Johnson vaccine efficacy was a bit lower—72 percent in the US—but is still quite high.\n Note, those numbers are very high, but not 100 percent, Fauci cautioned. &#34;Infections after vaccination are expected,&#34; he said, adding, &#34;no vaccine is 100 percent effective.&#34;\n The primary goal of vaccines is to protect against severe disease and death—which all three vaccines do very well, even against the delta variant, Fauci emphasized. In a real-world study of people who had been vaccinated with the Pfizer/BioNTech vaccine, for instance, the full two doses were  96 percent effective at preventing hospitalization from infections with the delta variant. Similarly, the AstraZeneca vaccine—which is very similar in design to the Johnson &amp; Johnson vaccine—was 92 percent effective against hospitalization from delta. In addition,  preliminary laboratory studies have shown that all three vaccines can prompt neutralizing antibodies and durable cellular defenses that can thwart the delta variant and other concerning variants. Currently, 97 percent of people hospitalized with COVID-19 are unvaccinated, as are 99.5 percent of those dying of COVID-19.\n    Still, some vaccinated people will get infected after reaching a fully vaccinated state—that is, two weeks after getting either the second dose of an mRNA vaccine or the one dose of the Johnson &amp; Johnson vaccine. Typically, these breakthrough infections have no symptoms or have relatively mild symptoms. It&#39;s worth noting—as  a piece published in Slate did yesterday—that relatively mild infections aren&#39;t necessarily harmless; they can be quite unpleasant. But being laid out at home for a few days, feeling crummy with a fever and chills, is significantly better than a stay in the hospital, needing oxygen, or worse—landing in the intensive care unit, being on a ventilator, or even dying.\n &#34;Even though we are seeing infections after vaccination... the effectiveness against severe disease is still substantial,&#34; Fauci said, &#34;which is yet again another argument which all of us say continually: Get vaccinated.&#34;\n  In a back-and-forth with reporters, Fauci also shot down unwarranted concern that the Johnson &amp; Johnson vaccine was not effective against the delta variant. The concern was largely driven by an article this week in The New York Times that focused on unpublished data looking only at antibody levels. The study (which has not been peer-reviewed) claimed that the Johnson &amp; Johnson vaccine prompted lower levels of neutralizing antibodies against the delta variant, compared with neutralizing antibodies levels against other versions of the virus. The New York Times declared that the data suggests that the millions of people who received the one-and-done Johnson &amp; Johnson shot now need a booster shot.\n But experts were quick to push back. They noted that vaccines don&#39;t prompt antibodies alone—they also elicit other critical cellular immune defenses to protect from infection and disease. Moreover, there is no clear level of neutralizing antibody at which point a person is deemed unprotected. Lastly,  other data has suggested that immune responses after the Johnson &amp; Johnson vaccine are robust and sustained. In short, the study wasn&#39;t looking at vaccine efficacy, and the data does not suggest the need for boosters.\n In the press briefing Thursday, Fauci called the Johnson &amp; Johnson vaccine &#34;a very effective vaccine.&#34;\n &#34;There is no reason to believe right now that people who have taken the J&amp;J vaccine are in need of a booster dose of any sort,&#34; he said. &#34;There are no data to indicate that that is the case.&#34;\n The Times has since significantly altered  the original story and its headline, though the paper did not note any of those changes. The headline no longer calls the vaccine &#34;ineffective;&#34; instead, the headline says it &#34; may be less effective.&#34; The top of the story has also been amended to note that the unpublished data may not reflect vaccine efficacy.\n  In an effort to boost vaccination in the US, Fauci and Walensky reiterated Thursday that the totality of data so far suggests that the vaccines at hand are safe and highly effective against the pandemic coronavirus, even the delta variant. In terms of safety, the vaccines do often produce mild, short-lived side effects, such as pain around the injection site and possibly a day or so of feeling under the weather. But serious side effects are exceedingly rare. Though some unvaccinated people have said they are concerned about unidentified  long-term side effects, historical data on vaccination indicates that, if any side effects are going to arise, they tend to do so within six weeks of vaccination. Thus it&#39;s unlikely that new side effects are suddenly going to become apparent.\n    Though breakthrough cases are always a concern with any vaccine, vaccinated people can continue to follow some health measures such as mask-wearing and avoiding crowds if they want to be cautious. Taking extra precautions may be worth considering for people in areas with low vaccination rates and high transmission amid the spread of the delta variant, Walensky added.\n &#34;If you are not vaccinated, please take the delta variant seriously,&#34; Walensky pleaded. &#34;This virus has no incentive to let up, and it remains in search of the next vulnerable person to infect. Please consider getting vaccinated and take precautions until you do.&#34;\n For those who have recovered from COVID-19, Walensky noted that the CDC &#34;strongly recommends&#34; that they too get vaccinated. &#34;It gives you longer-lasting and more robust protection with the breadth and depth of coverage needed to conquer the variants currently circulating in this country,&#34; she said.\n And for those still hesitant to get vaccinated, Walensky urged them to closely examine what was behind their hesitation. &#34;If you still have questions about the vaccines, we welcome them,&#34; she said. &#34;My request to you is this: Ask your questions. Talk to your healthcare provider. Talk to your pharmacist. Talk to your friends and neighbors who have gotten vaccinated and get your questions answered so that you feel comfortable and informed in making this critical decision.&#34;\n The point connects with another made recently in  a heartbreaking article out of Alabama, in which a doctor working in a Birmingham hospital described caring for her unvaccinated COVID-19 patients on their death beds. The piece was moving for several reasons, including a heartbreaking description of how misinformation has plagued this pandemic. The article quoted a doctor as saying:\n I try to be very non-judgmental when I&#39;m getting a new COVID patient that&#39;s unvaccinated, but I really just started asking them, &#34;Why haven&#39;t you gotten the vaccine?&#34; And I&#39;ll just ask it point-blank, in the least judgmental way possible. And most of them, they&#39;re very honest, they give me answers. &#34;I talked to this person, I saw this thing on Facebook, I got this email, I saw this on the news,&#34; you know, these are all the reasons that I didn’t get vaccinated.\n And the one question that I always ask them is, did you make an appointment with your primary care doctor and ask them for their opinion on whether or not you should receive the vaccine? And so far, nobody has answered yes to that question.\n A recent poll by the American Medical Association found that  more than 96 percent of practicing doctors have been fully vaccinated against COVID-19. And of those remaining, 45 percent said they planned to get vaccinated.", "posttime": "2021-07-23 06:15:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,专家,plead,疫苗", "title": "“接种疫苗！认真对待德尔塔！”美国专家恳求案件激增", "title_en": "“Get vaccinated! Take delta seriously!” US experts plead as cases skyrocket", "transed": 1, "url": "https://arstechnica.com/science/2021/07/get-vaccinated-take-delta-seriously-us-experts-plead-as-cases-skyrocket/", "via": "", "real_tags": ["美国", "专家", "plead", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "fa9987756a47ccf800fbc641f055eb21.jpeg", "infoid": 1069124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "单击“注册”，即表示您同意接收来自 Insider 的营销电子邮件以及其他合作伙伴的优惠，并接受我们的服务条款和隐私政策。加利福尼亚州公平就业机构周二对游戏巨头动视暴雪提起诉讼，指控这家《使命召唤》发行商存在“无处不在的兄弟会男孩”，女性员工经常受到骚扰。该文件称，在一次所谓的事件中，“一名新晋升的男性主管将他的职责委托给了他现在的女性下属，以支持玩使命召唤”。据彭博社报道，加州公平就业和住房部 (DFEH) 在对女性员工的工作条件进行了两年的调查后，起诉了动视暴雪及其两家子公司——动视出版和魔兽世界的创造者暴雪娱乐。 DFEH 在周二向洛杉矶最高法院提交的文件中表示，该公司的女性受到歧视，受到“不断的性骚扰”，摸索，为“基本相似的工作”支付较少的报酬，并在她们投诉时遭到公司 HR 的报复。 “不出所料，被告的‘兄弟会男孩’文化是骚扰和歧视女性的温床，”诉讼称。动视暴雪的一位发言人在一份声明中表示，“DFEH 描绘的画面不是今天的暴雪工作场所。”\n“DFEH 包括对暴雪过去的歪曲，在许多情况下是虚假的描述。我们在整个调查过程中与 DFEH 非常合作，包括向他们提供大量数据和充足的文件，但他们拒绝告诉我们他们认为什么问题， “声明说。 “我们重视多样性，并努力营造一个为每个人提供包容性的工作场所。我们公司或行业或任何行业都不允许任何形式的性行为不端或骚扰，”发言人说。 “我们认真对待每一项指控并调查所有索赔。在与不当行为有关的案件中，我们已采取行动解决问题。”该诉讼详细声称，一些男性员工参与了“立方体爬行”，他们会“喝大量的酒精”并在办公室的隔间之间移动，经常对女性同事表现出不恰当的行为。诉讼称，一些男性员工对魔兽世界团队的女性员工进行了性挑逗，还对强奸发表了贬损言论。该机构在文件中称，动视暴雪的一名女员工在出差期间自杀身亡。诉讼称，她之前曾与之发生性关系的一名男性同事也在这次旅行中。 DFEH 说，警方发现男主管在旅途中带来了塞子和润滑剂。 DFEH 说，另一名员工表示，这名女性在去世前曾在工作中遭受性骚扰。\n目前尚不清楚这次旅行是何时发生的。动视暴雪发言人在给 Insider 的一份声明中表示，该员工的自杀“与本案无关”。该诉讼称，动视暴雪的女性员工（据称占其员工总数的 20% 左右）的晋升速度也较慢，而担任高管职位的女性“薪水、激励薪酬和总薪酬低于男性同龄人”，援引动视暴雪自己在证券交易委员会的记录。 DFEH 表示，它以薪酬不平等、性别歧视、非法性骚扰、报复以及未能防止歧视、骚扰和报复为由提起诉讼。该机构表示，它是为了公共利益和动视暴雪的女性员工提起诉讼。该机构正在寻求赔偿和惩罚性赔偿，以及女性工人的未付工资和损失工资等要求，但没有具体说明具体数额。注册来自 Insider 的通知！及时了解您想知道的内容。形成“X”的两条​​交叉线。它指示一种关闭交互或关闭通知的方式。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n    California&#39;s fair employment agency  filed a lawsuit against gaming giant  Activision Blizzard on Tuesday, accusing the Call of Duty publisher of a &#34;pervasive frat boy&#34; in which female employees were routinely harassed.\n In one alleged incident, a &#34;newly promoted male supervisor delegated his responsibilities to his now female subordinates in favor of playing Call of Duty,&#34; the filing said.\n The California Department of Fair Employment and Housing (DFEH) sued  Activision Blizzard and two subsidiaries — Activision Publishing and World of Warcraft creator  Blizzard Entertainment — after a two-year investigation into working conditions for female staff,  Bloomberg Law first reported.\n DFEH said in Tuesday&#39;s filing to the Los Angeles Supreme Court that women at the company were discriminated against, subjected to &#34;constant sexual harassment,&#34; groped, paid less for &#34;substantially similar work,&#34; and retaliated against by company HR when they complained.\n     &#34;Unsurprisingly, [the] Defendants&#39; &#39;frat boy&#39; culture is a breeding ground for harassment and discrimination against women,&#34; the lawsuit said.\n A spokesperson for Activision Blizzard said in a statement that &#34;the picture the DFEH paints is not the Blizzard workplace of today.&#34;\n &#34;The DFEH includes distorted, and in many cases false, descriptions of Blizzard&#39;s past. We have been extremely cooperative with the DFEH throughout their investigation, including providing them with extensive data and ample documentation, but they refused to inform us what issues they perceived,&#34; the statement said.\n &#34;We value diversity and strive to foster a workplace that offers inclusivity for everyone. There is no place in our company or industry, or any industry, for sexual misconduct or harassment of any kind,&#34; the spokesperson said.\n     &#34;We take every allegation seriously and investigate all claims. In cases related to misconduct, action was taken to address the issue.&#34;\n  The lawsuit detailed claims that some male workers engaged in &#34;cube crawls&#34; where they would &#34;drink copious amounts of alcohol&#34; and move between cubicles in the office, often behaving inappropriately towards their female coworkers.\n Some male workers made sexual advances to female employees on the World of Warcraft team, and also made derogatory comments about rape, the lawsuit claimed.\n     The agency said in the filing that one female Activision Blizzard worker died by suicide during a business trip. A male coworker she had previously had a sexual relationship with was also on the trip, the suit said. Police found that the male supervisor had brought a butt plug and lubricant on the trip, DFEH said.\n Another employee said the woman had suffered sexual harassment at work before her death, DFEH said.\n It is not clear when the trip happened. An Activision Blizzard spokesperson said in a statement to Insider that the employee&#39;s suicide had &#34;no bearing whatsoever on this case.&#34;\n The lawsuit alleged that Activision Blizzard&#39;s female workers — which it said makes up around 20% of its workforce — were also promoted more slowly, while  women in executive roles earned &#34;less salary, incentive pay, and total compensation than their male peers,&#34; citing Activision Blizzard&#39;s own records with the Securities and Exchange Commission.\n     DFEH said that it filed the suit on grounds of unequal pay,  sex discrimination, unlawful sexual harassment, retaliation, and for failure to prevent discrimination, harassment, and retaliation. The agency said it was suing in the public interest and for Activision Blizzard&#39;s female employees.\n The agency is seeking compensation and punitive damages, and unpaid and lost wages for female workers, among other demands, although did not specify how much.\n  Sign up for notifications from Insider! Stay up to date with what you want to know.\n            Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-07-23 06:15:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,主管,female,女性", "title": "加利福尼亚州起诉游戏巨头动视暴雪，指控对女性员工的普遍骚扰。诉讼称，一名男性主管将他的工作委托给一名女性员工，以便他可以玩《使命召唤》。", "title_en": "California sued gaming giant Activision Blizzard, alleging widespread harassment of female staff. A male supervisor delegated his work to a female employee so he could play Call of Duty, the suit said.", "transed": 1, "url": "https://www.businessinsider.com/activision-blizzard-delegated-work-to-play-call-of-duty-lawsuit-2021-7", "via": "", "real_tags": ["游戏", "主管", "female", "女性"]}]