[{"category": "", "categoryclass": "", "imagename": "f530cf63822cf48136b2c2470c417b3b.jpg", "infoid": 1070334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当局表示，eBay 的一名前安全主管周二因参与针对 Natick 夫妇的奇怪网络跟踪活动而被判处 18 个月的联邦监禁。法律文件显示，现年 56 岁的加利福尼亚州圣何塞市的 Philip Cooke 于 2020 年 10 月在波士顿美国地方法院认罪，承认串谋进行网络跟踪和串谋篡改证人。周二，检察官说，库克被判处 18 个月监禁和 3 年监督释放，其中包括 12 个月的家庭拘留。据美国检察官办公室称，他还被勒令支付 15,000 美元的罚款并进行 100 小时的社区服务。库克是被指控与跟踪有关的七名前 eBay 员工之一，当局称其目标是 Natick 夫妇 Ina 和 David Steiner，他们最近对该公司和其他与骚扰有关的各方提起联邦诉讼。代表这对夫妇进行民事诉讼的著名波士顿律师罗斯玛丽·斯卡皮奇奥 (Rosemary Scapicchio) 在周一的听证会后通过电话表示，她的客户“松了一口气”，因为库克在监狱中获得了时间，称这是对所有这些人“追究责任的第一步”涉及。检察官说，eBay 的领导人密切关注施泰纳夫妇的在线帖子，他们经常对时事通讯提出异议。 “接下来是三周的噩梦，”检察官在法庭文件中说。 “[A]匿名和亵渎要求这对夫妇停止报道eBay；在 Twitter 上公布他们的家庭住址，并威胁要在那里拜访他们；运送活昆虫和丧葬花圈； Craigslist 的帖子邀请所有来者在家中发生性关系；一辆黑色面包车在丈夫开车绕过内蒂克时跟在他后面，还有很多。”\n在法庭文件中，检察官要求对库克判处 30 个月的联邦监禁，库克是一名前警长，政府表示“应该意识到这种行为的一小部分会对受害者造成的影响”。相反，检察官写道，他“同意在网上骚扰他们，以实现公司目标。库克随后又犯了第二项罪行，他干预了随后的警方调查，妨碍了他几年前本应称其为同事的警官。检察官写道：“正如网络跟踪经常发生的那样，库克的罪行将受害者与他们的社区隔离开来，”并补充说，斯坦纳夫妇“取消了社交活动和去城外探望家人和朋友的旅行，担心他们的跟踪者会跟随并成为其他人&#39; 跟踪狂。”上周，库克的律师苏珊·温克勒 (Susan G. Winkler) 在一份单独的文件中为她的客户申请了居家禁闭期。 “虽然库克先生加​​入了参与‘白骑士战略’的计划，以发送骚扰性和匿名的 Twitter 消息来软化受害者以寻求 eBay 安全团队的帮助，并且至少查看了一些与该计划有关的消息草稿，但他被没有亲自参与骚扰同一个受害者的两个或多个不同的‘实例’，”温克勒写道。 “先生。库克已经遭受了广泛的惩罚，”温克勒写道。 “他失去了一份他喜欢的工作，对他给家人带来的失望感到沮丧，并在他的社区中受到羞辱——他光荣而忠实地服务了 30 年的社区。”检察官已确定其他与此案有关的前 eBay 工作人员是纽约的 48 岁的大卫·哈维尔； Stephanie Stockwell，26 岁，来自加利福尼亚州雷德伍德市；加利福尼亚州圣何塞，45 岁的居民 James Baugh；斯蒂芬妮·波普，32 岁；维罗妮卡·泽亚，26 岁；和布莱恩吉尔伯特，51 岁。\n记录显示，波普、斯托克韦尔、齐亚和吉尔伯特都对相关指控认罪，判决日期分别为 9 月 28 日和 9 月 30 日。哈维尔和鲍的指控仍在审理中。在 2020 年 6 月的一份声明中，eBay 表示，一旦执法部门在 2019 年 8 月通知他们涉嫌骚扰，它就会与外部法律顾问一起对此事进行“全面调查”。 由 eBay 董事会组成的独立委员会发现该公司“接受了这些指控从一开始就非常严肃。得知他们的消息后，eBay 迅速采取行动进行彻底调查并采取适当行动，”该公司当时表示。该公司补充说，它“要求员工遵守高标准的行为和道德标准，并将继续采取适当的行动以确保遵守这些标准。”但 Scapicchio 周二指出，eBay 在解雇了多名共同被告后，于 2019 年底提拔了库克。检察官在法庭文件中表示，该公司直到 2020 年 6 月在法律文件中将库克确认为“主管 1”后不久才解雇库克，该文件披露了将他与该阴谋联系起来的在线帖子的内容。此前，在公司自己的审查中，检方表示，eBay 拍摄了库克手机的照片，但照片中没有包含应用程序线程“或任何有关骚扰的消息。目前尚不清楚库克何时删除了与这些事件相关的消息。 “他们只是在他的行为公开后才解雇了他，”斯卡皮奇奥说。 “你应该采取行动，因为这是正确的做法，而不是因为你被抓住了。”", "note_en": "A former security supervisor at eBay received an 18-month federal prison sentence Tuesday for his role in a bizarre campaign of  cyberstalking aimed at a Natick couple that ran an online newsletter often critical of the e-commerce giant, authorities said.\n Philip Cooke, 56, of San Jose, Calif., had pleaded guilty in US District Court in Boston in October 2020 to conspiracy to commit cyberstalking and conspiracy to tamper with a witness, legal filings show.\n On Tuesday, prosecutors said, Cooke was sentenced to 18 months in prison, and three years of supervised release, including a 12-month period of home detention. He was also ordered to pay a $15,000 fine and perform 100 hours of community service, according to the US attorney’s office.\n Cooke was one of seven former eBay employees charged in connection with the stalking, which authorities said targeted Ina and David Steiner, a Natick couple who recently  filed a federal lawsuit against the company and other parties linked to the harassment.\n Rosemary Scapicchio, a prominent Boston attorney representing the couple in their civil suit, said via phone after Monday’s hearing that her clients “were relieved” that Cooke received time behind bars, calling it “the first step in their pursuit of accountability” for all those involved.\n  The Steiners’ online postings were followed closely by eBay leaders, who often took issue with the newsletter, prosecutors have said.\n  “A three week nightmare followed,” prosecutors said in court papers. “[A]nonymous and profane demands that the couple stop reporting about eBay; the publication of their home address on Twitter and threats to visit them there; the delivery of live insects and a funeral wreath; Craigslist posts inviting all comers to sexual encounters at their home; a black van that followed the husband as he drove around Natick, and so much more.”\n  In the court papers, prosecutors sought a 30-month federal prison term for Cooke, a former police captain whom the government said “should have appreciated the impact a fraction of this conduct would have on the victims.”\n Instead, prosecutors wrote, he “agreed to harass them online in service of a corporate objective. Cooke then committed a second crime when he interfered with the police investigation that followed, obstructing officers whom he would have called colleagues” years earlier.\n “As cyberstalking frequently does, Cooke’s crime cut the Victims off from their community,” prosecutors wrote, adding that the Steiners “cancelled social engagements and a trip to see family and friends out of town, fearful that their stalkers would follow, and become others’ stalkers.”\n Cooke’s attorney, Susan G. Winkler, requested a term of home confinement for her client in a separate filing last week.\n “While Mr. Cooke joined the plan to engage in a ‘white knight strategy’ to send harassing and anonymous Twitter messages to soften up the victims for eBay’s security team’s assistance, and viewed at least some draft messages in connection with that scheme, he was not personally involved in two or more separate ‘instances’ of harassing the same victim,” Winkler wrote.\n  “Mr. Cooke has endured extensive punishment already,” Winkler wrote. “He lost a job he enjoyed, was devastated by the disappointment he caused his family, and was humiliated in his community — a community he honorably and faithfully served for 30 years.”\n  Prosecutors have identified the other former eBay workers charged in connection with the case as David Harville, 48, of New York; Stephanie Stockwell, 26, of Redwood City, Calif.; and San Jose, Calif., residents James Baugh, 45; Stephanie Popp, 32; Veronica Zea, 26; and Brian Gilbert, 51.\n Popp, Stockwell, Zia, and Gilbert have all pleaded guilty to related charges, with sentencings slated for Sept. 28 and Sept. 30, records show. Harville and Baugh’s charges are still pending.\n In a June 2020 statement, eBay said it launched a “comprehensive investigation” into the matter with outside legal counsel once law enforcement informed them of the alleged harassment in August 2019.\n An independent committee formed by eBay’s board of directors found the company “took these allegations very seriously from the outset. Upon learning of them, eBay moved quickly to investigate thoroughly and take appropriate action,” the company said at the time.\n The company added that it “holds its employees to high standards of conduct and ethics and will continue to take appropriate action to ensure these standards are followed.”\n But Scapicchio noted Tuesday that eBay had promoted Cooke in late 2019 after firing multiple codefendants.\n Prosecutors said in court filings that the company didn’t fire Cooke until shortly after he was identified in June 2020 as “Supervisor 1” in legal documents that revealed the contents of an online thread linking him to the plot. Previously, during the company’s own review, prosecutors said, eBay had taken an image of Cooke’s phone, but the photo did not include the app thread “or any messages regarding the harassment. It is not clear when in relation to these events Cooke deleted” the messages.\n  “They only fired him when his conduct became public,” Scapicchio said. “You’re supposed to be taking action because it’s the right thing to do, and not because you got caught.”", "posttime": "2021-07-29 22:25:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "夫妇,supervisor,ebay", "title": "前 eBay 主管因针对 Natick 夫妇的网络跟踪案件被判入狱 18 个月", "title_en": "Former eBay Supervisor Sentenced To 18 Months in Prison For Cyberstalking Case Targeting Natick Couple", "transed": 1, "url": "https://www.bostonglobe.com/2021/07/27/metro/former-ebay-supervisor-faces-sentencing-cyberstalking-case-targeting-natick-couple/", "via": "", "real_tags": ["夫妇", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "c5ae6c8becb6a971748534eb6f531364.jpeg", "infoid": 1070333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一，特斯拉首席执行官埃隆马斯克在讨论特斯拉收益的电话会议上两次抨击硅谷邻居苹果公司。他第一次表示，苹果在电池中使用的钴比特斯拉多。第二次，在他提到“围墙花园”之后，他假装咳嗽了一声，并在提到苹果对其 App Store 政策的挑战时提到了苹果。周一，特斯拉首席执行官埃隆马斯克在讨论特斯拉收益的电话会议上两次抨击硅谷邻居苹果公司。尽管这两家公司今天没有直接竞争，但据报道，苹果正在一个代号为 Titan 的项目下制造电动自动驾驶汽车，并吸引了特斯拉的许多工程师和高管。据报道，泰坦项目由道格·菲尔德负责，他在特斯拉工作了五年后于 2018 年重返苹果。当被问及特斯拉的供应链时，马斯克表示存在一种误解，即特斯拉使用了大量钴，钴是生产用于智能手机和电动汽车的锂离子电池的关键材料。 “我认为苹果在其电池、手机和笔记本电脑中几乎 100% 使用钴，但特斯拉在磷酸铁电池组中不使用钴，在镍基化学品中几乎不使用钴，”马斯克说。 “在加权平均的基础上，我们可能会使用 2% 的钴，而苹果的 100% 钴则是。无论如何，这真的不是一个因素。”\n在刚果民主共和国等地开采的一些钴与童工等侵犯人权行为有关。据《卫报》报道，2019 年，除了特斯拉和其他主要科技公司之外，苹果还被列为人权诉讼的被告。在今年早些时候发布的一份冲突矿产报告中，苹果表示它发布了一份所有冲突矿产和钴冶炼厂和精炼厂的清单，苹果的所有钴供应商都参与了 2020 年的审计。苹果代表没有回复置评请求。后来在电话中，马斯克对苹果所谓的“围墙花园”进行了破解，之所以这么命名，是因为苹果通过其 App Store 严格控制着 iPhone 上可以安装哪些软件。苹果的围墙花园正面临立法者和其他公司的审查，包括今年早些时候在被 Epic Games 就 App Store 费用和政策起诉后进行的一项反垄断审判。 “我认为我们确实想强调我们的目标是支持可持续能源的出现，”马斯克在回答有关让竞争对手使用其充电器网络的问题时说。 “这不是创建一个有围墙的花园，然后用它来打击一些公司使用的竞争对手。”在电话会议中，马斯克表示，除非他有“非常重要的事情”需要说，否则他可能不会出现在未来的特斯拉财报电话会议上。", "note_en": "Tesla CEO Elon Musk sniped at Silicon Valley neighbor Apple twice during a conference call to discuss Tesla earnings on Monday.\n The first time, he said that Apple uses more cobalt in its batteries than Tesla did.\n The second time, after he referred to &#34;walled gardens,&#34; he fake coughed and mentioned Apple in a reference to challenges to its App Store policies.\n Tesla CEO Elon Musk sniped at Silicon Valley neighbor  Apple twice during a conference call to discuss Tesla earnings on Monday.\n Although the companies don&#39;t compete directly today, Apple is reportedly building an electric self-driving vehicle under a project code-named Titan, and has  attracted a number of engineers and executives away from Tesla. The Titan project is  reportedly run by Doug Field, who returned to Apple in 2018 after five years at Tesla.\n  When asked about Tesla&#39;s supply chain, Musk said that there&#39;s a misperception that Tesla uses a lot of cobalt, a key material in the production of lithium-ion cells used in both smartphones and electric cars.\n &#34;Apple uses I think almost 100% cobalt in their batteries and cell phones and laptops, but Tesla uses no cobalt in the iron-phosphate packs, and almost none in the nickel-based chemistries,&#34; Musk said. &#34;On on a weighted-average basis we might use 2% cobalt compared to say, Apple&#39;s 100% cobalt. Anyway, so it&#39;s just really not a factor.&#34;\n Some cobalt mined in places like the Democratic Republic of the Congo has been linked to human rights abuses such as child labor. In 2019, Apple, in addition to Tesla and other major technology companies, was named as defendants in a human rights lawsuit,  according to The Guardian.\n In a conflict minerals report published earlier this year, Apple said it publishes a list of all conflict minerals and cobalt smelters and refiners, and all of Apple&#39;s cobalt suppliers participated in audits in 2020. An Apple representative didn&#39;t return a request for comment.\n Later in the call, Musk made a crack about Apple&#39;s so-called &#34;walled garden,&#34; which is named because  Apple strictly controls what software can be installed on the iPhone through its App Store. Apple&#39;s walled garden is facing scrutiny from lawmakers and other companies, including in  an antitrust trial that took place earlier this year after it was sued by Epic Games over App Store fees and policies.\n  &#34;I think we do want to emphasize that our goal is to support the advent of sustainable energy,&#34; Musk said in response to a question about letting competitors use its charger network. &#34;It is not to create a walled garden and use that to bludgeon our competitors which is used by some companies.&#34;\n  During the call, Musk said he likely would not appear on future Tesla earnings calls unless he has &#34;something really important&#34; that he needs to say.", "posttime": "2021-07-29 22:24:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,马斯克,musk", "title": "埃隆马斯克在财报电话会议上两次抨击苹果", "title_en": "Elon Musk Sniped at Apple Twice on Earnings Call", "transed": 1, "url": "https://www.cnbc.com/2021/07/26/elon-musk-snipes-at-apple-twice-on-tesla-earnings-call.html", "via": "", "real_tags": ["apple", "苹果", "马斯克", "musk"]}, {"category": "", "categoryclass": "", "imagename": "df97da53e42deeaaeeb49e3d7a187185.jpg", "infoid": 1070332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在曼达洛人的第 2 季结局中，这位名义上的孤独赏金猎人完成了他的任务，将格罗古（以前称为尤达宝宝）交付给绝地张开的双臂。但不仅仅是任何绝地武士。一位年轻的卢克·天行者出现在兴奋中，然后是粉丝们的失望，他们对他的 VFX 沉重的表情感到惊讶。进入名为 Shamook 的 YouTube 用户，他的 The Mandalorian deepfake 于 12 月出版，已获得近 200 万次观看，以改善用于使 Mark Hamill 衰老的视觉效果。太棒了，Shamook 然后与 Lucasfilm 及其视觉效果部门 Industrial Light and Magic 获得了新的演出机会。 “你们中的一些人可能已经知道，我几个月前加入了 ILM/Lucasfilms，但没有时间制作任何新的 YouTube 内容，”Shamook 在最近一段视频的评论部分写道。 “现在我已经适应了我的工作，上传应该会再次开始增加。它们仍然会很慢，但希望不会相隔几个月。” “[工业光与魔法]一直在寻找才华横溢的艺术家，实际上已经聘请了在线角色&#39;Shamook&#39;的艺术家，”卢卡斯影业的一位代表在一份声明中说。 “在过去的几年里，ILM 一直在投资机器学习和人工智能，以此作为制作引人注目的视觉效果作品的一种手段，随着技术的进步，看到这个领域的势头正在增强，这真是太棒了。” Deepfake 视频使用人工智能使人看起来正在做或说一些他们从未做过的事情，就像这些 Tom Cruise 的 deepfakes 一样。在不那么令人不安的领域，改善电影视觉效果的深度伪造似乎是你电影制作简历的一个很好的补充。", "note_en": "The   season 2 finale of   The Mandalorian saw the titular lone bounty hunter complete his mission by delivering Grogu (formerly known as   Baby Yoda) to the open arms of a Jedi. But not just any Jedi. A young Luke Skywalker showed up to the excitement, then disappointment of fans who raised eyebrows at his VFX-heavy look.\n Enter the YouTuber known as  Shamook, whose  The Mandalorian deepfake, published in December, has earned nearly 2 million views for improving the VFX used to de-age Mark Hamill. It was so good Shamook then earned a new gig with Lucasfilm and its visual effects division Industrial Light and Magic.\n   &#34;As some of you may already know, I joined ILM/Lucasfilms a few months ago and haven&#39;t had the time to work on any new YouTube content,&#34; Shamook wrote in the comment section of a  recent video. &#34;Now I&#39;ve settled into my job, uploads should start increasing again. They&#39;ll still be slow, but hopefully not months apart.&#34;\n   &#34;[Industrial Light and Magic is] always on the lookout for talented artists and have in fact hired the artist that goes by the online persona &#39;Shamook,&#39;&#34; a Lucasfilm representative said in a statement.\n &#34;Over the past several years ILM has been investing in both machine learning and A.I. as a means to produce compelling visual effects work and it&#39;s been terrific to see momentum building in this space as the technology advances.&#34;\n   Deepfake videos use artificial intelligence to make it appear that a person is doing or saying something they never did, as with these  Tom Cruise deepfakes. In less disturbing territory, deepfakes that improve visual effects in movies appear to be a great addition to your movie-making CV.", "posttime": "2021-07-29 22:24:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,影业,hires,视觉效果", "title": "卢卡斯影业聘请 Deepfake YouTuber 修复曼达洛人", "title_en": "Lucasfilm Hires Deepfake YouTuber Who Fixed The Mandalorian", "transed": 1, "url": "https://www.cnet.com/news/lucasfilm-hires-deepfake-youtuber-who-fixed-the-mandalorian/", "via": "", "real_tags": ["youtube", "影业", "hires", "视觉效果"]}, {"category": "", "categoryclass": "", "imagename": "56bb3d4d04600b3a3843af3086cdf7ac.jpg", "infoid": 1070331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国已将吴唐氏专辑《少林黄飞鸿》的唯一副本出售给一位匿名买家。出售的价格也被保密。这张专辑之前由臭名昭著的“Pharma Bro”马丁·什克雷利（Martin Shkreli）拥有，他将一种救命药物的价格提高了 5,000%，后来被判犯有证券欺诈罪并被判处七年徒刑。作为 740 万美元没收判决的一部分，他于 2018 年被迫将其交给美国。纽约东区代理美国检察官 Jacquelyn M. Kasulis 今天宣布了这一消息。 “Shkreli 已被追究责任，并为撒谎和窃取投资者以致富而付出了代价，”Kasulis 说。 “随着今天这张独一无二的专辑的销售，他的没收款项现已完成。” Shkreli 于 2015 年在拍卖会上以 200 万美元的价格购买了这张 31 首曲目的专辑。它被宣传为“独特的艺术作品”，没有实体或数字复制品，包括从雷德曼到基拉米的更广泛的吴唐家族的出现。在得知是 Shkreli 购买了这张专辑后，Wu-Tang 成员 RZA 告诉彭博社，该组织决定将“很大一部分收益捐给慈善机构”。", "note_en": "The United States has sold the only copy of the Wu-Tang Clan album  Once Upon a Time in Shaolin  to an anonymous buyer. The price of the sale was also kept confidential.\n  The album was previously owned by Martin Shkreli, the infamous &#34;Pharma Bro&#34; who raised the price of a life-saving drug by  5,000 percent and was later convicted of  securities fraud and sentenced to seven years in prison. He was forced to hand it over to the United States in 2018 as a part of a $7.4 million forfeiture judgement.\n        The announcement was made today by Jacquelyn M. Kasulis, the Acting United States Attorney for the Eastern District of New York. &#34;Shkreli has been held accountable and paid the price for lying and stealing from investors to enrich himself,&#34; said Kasulis. &#34;With today&#39;s sale of this one-of-a-kind album, his payment of the forfeiture is now complete.&#34;\n  Shkreli purchased the 31-track album at auction in 2015 for a reported $2 million. It was promoted as a &#34;unique work of art&#34; with no physical or digital duplicate in existence, and included appearances from the wider Wu-Tang family from Redman to Killarmy. Upon learning that it was Shkreli who bought the album, Wu-Tang member  RZA told  Bloomberg  that the group decided to give &#34;a significant portion of the proceeds to charity.&#34;", "posttime": "2021-07-29 22:24:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,出售,sold,专辑", "title": "美国政府出售“Pharma Bro” Martin Shkreli 独一无二的武当家族专辑", "title_en": "'Pharma Bro' Martin Shkreli's One-of-a-Kind Wu-Tang Clan Album Sold By US Government", "transed": 1, "url": "https://www.npr.org/2021/07/27/1021284593/martin-shkreli-wu-tang-clan-album-sold", "via": "", "real_tags": ["美国", "出售", "sold", "专辑"]}, {"category": "", "categoryclass": "", "imagename": "2e080306f0b53a839e29f8fb36b22d70.jpg", "infoid": 1070330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "默认情况下，Instagram 已将 16 岁以下的新帐户设为私有，因此只有获得批准的关注者才能看到帖子和“喜欢”或评论。它说，测试表明，当私人设置是默认设置时，只有五分之一的人选择了公共帐户。现有账户持有人将收到通知，“强调转为私人的好处”。但 Instagram 也表示，它正在推动面向 13 岁以下青少年的新应用程序，尽管遭到了一些团体的强烈反对。母公司 Facebook 表示：“现实情况是，他们已经上线，并且没有万无一失的方法来阻止人们歪曲他们的年龄，我们希望打造专门为他们设计、由父母和监护人管理的体验。”即将出台的在线安全法案让科技巨头有责任确保采取足够的保护措施，以防止儿童访问可能有害的内容。但该系统依赖于帐户中列出的年龄——年轻用户可能会为了避免此类限制而撒谎。\n该公司表示：“从历史上看，我们要求年轻人在注册 Instagram 时在公共帐户或私人帐户之间进行选择，但我们最近的研究表明，他们更喜欢更私密的体验。” Instagram 表示，它的另一项变化 - 防止帐户显示“潜在的可疑行为”，例如最近被阻止发送消息或关注儿童的帐户 - 将使他们“难以为某些成年人找到”。同时，“更谨慎的方法”将使广告商能够仅根据年龄、性别和位置而不是兴趣和网络浏览习惯来定位儿童。在为一般的有针对性的广告及其对某些类型的选择退出功能进行辩护时，Instagram 表示：“我们从青年倡导者那里听说，年轻人可能没有能力做出这些决定。”", "note_en": "Instagram has made new under-16s&#39; accounts private by default so only approved followers can see posts and &#34;like&#34; or comment.\n Tests showed only one in five opted for a public account when the private setting was the default, it said.\n And existing account holders would be sent a notification &#34;highlighting the benefits&#34; of switching to private.\n But Instagram also said it was pushing ahead with new apps for under-13s, despite  a backlash from some groups.\n &#34;The reality is that they are already online and, with no foolproof way to stop people from misrepresenting their age, we want to build experiences designed specifically for them, managed by parents and guardians,&#34; parent company Facebook said.\n    The upcoming Online Safety Bill puts the onus on technology giants to ensure sufficient safeguards to prevent children accessing potentially harmful content.\n     But the system relies on the age listed in the account - something younger users may lie about to avoid such restrictions.\n   &#34;Historically, we asked young people to choose between a public account or a private account when they signed up for Instagram but our recent research showed that they appreciate a more private experience,&#34; the company said.\n  Another of its changes - preventing accounts showing &#34;potentially suspicious behaviour&#34; such as recently having been blocked from messaging or following children&#39;s accounts - would make them &#34;difficult to find for certain adults&#34;, Instagram said.\n Meanwhile, &#34;a more precautionary approach&#34; will see advertisers able to target children based on only age, gender, and location, rather than interests and web-browsing habits.\n And while defending targeted ads in general and the optout features it has for some types, Instagram said: &#34;We have heard from youth advocates that young people may not be well equipped to make these decisions.&#34;", "posttime": "2021-07-29 22:24:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "instagram,private,帐户", "title": "Instagram 默认将 16 岁以下的帐户设为私有", "title_en": "Instagram Makes Under-16s' Accounts Private By Default", "transed": 1, "url": "https://www.bbc.com/news/technology-57984790", "via": "", "real_tags": ["instagram", "private", "帐户"]}]