[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你总是伤害你爱的人-康妮·弗朗西斯(1958)", "note_en": "You Always Hurt The One You Love - Connie Francis (1958)", "posttime": "2020-05-12 06:00:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "皮尔,peel,康妮", "title": "约翰·皮尔·塞申斯", "title_en": "John Peel Sessions", "transed": 1, "url": "https://davestrickson.blogspot.com/2020/05/john-peel-sessions.html", "via": "", "real_tags": ["皮尔", "peel", "康妮"]}, {"category": "", "categoryclass": "", "imagename": "c156b5202c8785b0ff59abe5e4875591.jpg", "infoid": 1001726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如The Verge之前报道的那样，特斯拉首席执行官埃隆·马斯克证实，他将重新开放公司在加州的汽车工厂，这违反了当地的就地避难命令。马斯克说，他本周将在公司的生产线上。他写道：“如果有人被捕，我要求只有我一个人。”\n马斯克周末的部分时间都在抨击这项命令，这项命令是阿拉米达县官员在3月中旬实施的，目的是减轻冠状病毒的传播。该命令限制除“基本业务”以外的所有业务执行最低限度的操作，如处理工资。特斯拉最初反对这一订单后，于3月23日关闭了工厂。\n马斯克辩称，州长加文·纽瑟姆(Gavin Newsom)实施的全州范围内的居家命令为特斯拉的汽车制造厂留出了继续开放的空间，马斯克让特斯拉在周六对该县提起诉讼，以示抗议。周一，纽瑟姆表示，该州已经与县官员和特斯拉代表进行了“非常有建设性的对话”，他希望公司能“最早在下周”开业。\n阿拉米达县主管斯科特·哈格蒂(Scott Haggerty)上周末告诉《纽约时报》(New York Times)，该县和特斯拉已接近达成协议，将于5月18日重新开放工厂，但那是在马斯克周六猛烈抨击并提起诉讼之前。\n正如The Verge周一早些时候报道的那样，特斯拉在周末开始生产汽车，并告诉所有员工，它已经休假，准备重返工作岗位。这些员工被告知，如果他们感到不舒服，可以呆在家里，但为了做到这一点，他们必须休无薪假期。(特斯拉在上个月延长休假后，兑现了许多员工的带薪休假。)。其他汽车制造商，如福特和通用汽车，计划在本月晚些时候恢复他们在美国的制造。其中一些汽车制造商想要更早开业，但面临着代表他们劳动力的全美汽车工人联合会(United Auto Workers Union)的抵制。", "note_en": "Tesla CEO Elon Musk has confirmed that he’s  reopening his company’s car factory in California in violation of a local shelter-in-place order, as  The Verge previously reported. Musk said he’ll be on the company’s production line this week. “If anyone is arrested, I ask that it only be me,” he wrote.\n Musk spent parts of the weekend  railing against the order, which was put in place in mid-March by Alameda County officials in order to mitigate the spread of COVID-19. The order restricted all but “essential businesses” from performing anything other than the most minimal operations, like processing payroll. After initially fighting the order, Tesla shut down the factory on March 23rd.\n Musk has argued that the statewide stay-at-home order put in place by governor Gavin Newsom left room for Tesla’s auto manufacturing plant to remain open, and Musk had Tesla file a lawsuit against the county on Saturday in protest. On Monday, Newsom said that the state has had “very constructive conversations” with the county officials and Tesla representatives and that he hoped the company could open up “as early as next week.”\n Alameda County supervisor Scott Haggerty told   The New York Times this past weekend that the county and Tesla had been close to an agreement to reopen the factory on May 18th, but that was before Musk lashed out and filed the lawsuit on Saturday.\n Tesla started making cars over the weekend,  as  The Verge reported earlier on Monday, and told all of the employees that it placed on furlough to get ready to go back to work. Those employees have been told they can stay home if they feel uncomfortable, but have to take unpaid leave in order to do so. (Tesla cashed out many employees’ paid leave after extending the furlough last month.) Other automakers like Ford and General Motors are scheduled to get their US manufacturing back up and running later this month. Some of those automakers wanted to open earlier, but faced resistance from the United Auto Workers union, which represents their workforces.", "posttime": "2020-05-12 05:58:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,埃隆·马斯克,马斯克,musk", "title": "埃隆·马斯克无视重启特斯拉的居家命令要求逮捕", "title_en": "Elon Musk defies stay-home order to reopen Tesla and asks to be arrested", "transed": 1, "url": "https://www.theverge.com/2020/5/11/21255149/elon-musk-tesla-fremont-factory-reopen-order-arrest-alameda", "via": "", "real_tags": ["特斯拉", "埃隆·马斯克", "马斯克", "musk"]}, {"category": "", "categoryclass": "", "imagename": "0e919b31e7aed180c085cd60434eb626.png", "infoid": 1001725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "服务构成MetaMates主干。当服务收到请求时，它会将其映射到特定于供应商的数据表示和数据传输技术。一旦底层后端返回响应，服务就会将其映射回抽象模式图，并将其传递给发出请求的MetaMate。\n发现服务向MetaMate提供它可以与之交互的服务。这些服务可以是可公开路由的，也可以位于专用网络中。\n网关服务使MetaMate能够与外部数据提供程序交互。与API、区块链、网站或P2P网络对话。简而言之：一切都与互联网相连。\nMetaMate社区围绕实际数据逐步对抽象模式图进行建模。它的类型系统是广泛采用的数据传输技术(即GraphQL、GRPC、Thrift和OpenApi)语言功能的最低公分母。\n抽象模式图以编程方式强制模式的向后兼容性。构建在MetaMate之上的服务和应用程序永远有效。\nMetaMate负责映射不同类型版本之间的通信。v1客户端与v2服务无缝对话。\nMetaMate的CLI为每个项目生成类型化SDK，仅覆盖整个模式图所需的子集。\n由于MetaMate的类型系统是作为主要传输协议功能的最低公分母派生出来的，因此它可以无缝映射到基于GraphQL、GRPC、Thrift和JSON的数据传输实现上。\nMetaMate是无状态的，遵循12因素应用程序。它易于部署和扩展。", "note_en": "Services form MetaMates backbone. When a service receives a request, it maps it onto the vendor-specific data representation and data transmission technology. Once the underlying backend returns a response, the service maps it back onto the abstract schema graph and delivers it to the requesting MetaMate.\n Discovery services supply a MetaMate with services it can interact with. These services can be publicly routable or live in a private network.\n Gateway services enable a MetaMate to interact with external data providers. Talk to APIs, blockchains, websites, or p2p networks. In a nutshell: everything that&#39;s connected to the internet.\n The MetaMate community progressively models the abstract schema graph around real-world data. Its type system is derived as the lowest common denominator of the language capabilities of widely adapted data transmission technologies, namely GraphQL, gRPC, Thrift, and OpenApi.\n   The abstract schema graph programmatically enforces the backward compatibility of the schema. Services and applications built on top of MetaMate work forever.\n MetaMate takes care of mapping the communication between different versions of types. A v1 client seamlessly talks to a v2 service.\n MetaMate&#39;s CLI generates typed SDKs per project, covering only the desired subset of the overall schema graph.\n As MetaMate&#39;s type system is derived as the lowest common denominator of the capabilities of leading transmission protocols, it maps seamlessly onto GraphQL, gRPC, Thrift, and JSON based data transmission implementations.\n MetaMate is stateless and follows the 12 Factor app. It&#39;s easy to deploy and scale.", "posttime": "2020-05-12 05:58:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "api,metamate,服务", "title": "MetaMate-您的API无所不能", "title_en": "MetaMate – Your API for Everything", "transed": 1, "url": "https://metamate.io/", "via": "", "real_tags": ["api", "metamate", "服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雀巢。让你的钱为你工作。", "note_en": "Nesteggly. Make your money work for you.", "posttime": "2020-05-12 05:42:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "退休,calculators", "title": "工程师退休计算器", "title_en": "Retirement Calculators for Engineers", "transed": 1, "url": "https://www.nesteggly.com/", "via": "", "real_tags": ["退休"]}, {"category": "", "categoryclass": "", "imagename": "7ddf3e1dd624de5b1582063f5324c196.jpg", "infoid": 1001720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马斯克在周一下午的推文中表示，他将“在生产线上”，他指的是特斯拉生产Model X、Model S、Model 3和Model Y的工厂的装配线。他补充说，“如果有人被捕，我要求只有我一个人。”\nTechCrunch已经联系了阿拉米达县官员、特斯拉和埃隆·马斯克请其置评。一旦他们回复，我们会及时更新。\n特斯拉今天将违反阿拉米达县的规定重新开始生产。我会和其他人在线上。如果有人被捕，我要求只有我一个人。\n马斯克的举动是在推特上公开发泄了几天的情绪以及一场诉讼之后的-这些努力都是为了向阿拉米达县官员施压，要求他们允许该公司重新开放工厂。\n阿拉米达县警局公共信息官员雷·凯利中士告诉TechCrunch，该县、弗里蒙特市和对此有管辖权的弗里蒙特警察局的官员正在继续与特斯拉谈判。\n周六，特斯拉对阿拉米达县提起诉讼，寻求禁令救济，以使阻止该汽车制造商重新开业的命令无效。\n特斯拉原计划周五召回约30%的工厂工人，作为其重新开工计划的一部分，此前加州州长加文·纽瑟姆(Gavin Newsom)发布了新的指导意见，将允许制造商恢复运营。然而，州长的指导包括警告地方政府可以保持更具限制性的规定。阿拉米达县和其他几个湾区县市上周将家庭居家订单期限延长至5月底。这些命令进行了修订，确实放松了一些限制。然而，它并没有取消制造订单。\n周一，纽瑟姆在每天的冠状病毒简报会上发表了对特斯拉和马斯克的支持，称他相信阿拉米达县和该公司之间的问题将在未来几天内得到解决。\n纽瑟姆说：“长期以来，我一直是早期采用者和技术的坚定倡导者和支持者，我不仅认识这家公司，而且认识它的创始人很多年了。”“我非常尊重他们的技术、他们的创新精神、他们的领导力，我对我们能在未来几天内与这个特定的县和这家公司一起解决县级问题抱有很高的期望。”", "note_en": "Musk said in tweet Monday afternoon that he will “be on the line,” a reference to the assembly line at the factory where Tesla makes the Model X, Model S, Model 3 and Model Y. He added “if anyone is arrested, I ask that it only be me.”\n TechCrunch has reached out to Alameda County officials, Tesla and Elon Musk for comment. We will update once they respond.\n Tesla is restarting production today against Alameda County rules. I will be on the line with everyone else. If anyone is arrested, I ask that it only be me.\n Musk’s move follows days of public venting on Twitter as well as a lawsuit — efforts that are all aimed at pressuring Alameda County officials to allow the company to reopen its factory.\n Officials at the county, the city of Fremont, and Fremont Police Department, which has jurisdiction on this, are continuing to negotiate with Tesla, Sgt. Ray Kelly, public information officer with Alameda County Sheriff’s Department told TechCrunch.\n Tesla filed a lawsuit Saturday against Alameda County seeking injunctive relief, an effort to invalidate orders that have prevented the automaker from reopening.\n Tesla had planned to bring back about 30% of its factory workers Friday as part of its reopening plan, after California Gov.  Gavin Newsom issued new guidance that would allow manufacturers to resume operations. However, the governor’s guidance included a warning that local governments could keep more restrictive rules in place. Alameda County, along with several other Bay Area counties and cities, last week extended the  stay-at-home orders through the end of May. The orders were revised and did ease some of the restrictions. However, it did not lift the order for manufacturing.\n On Monday, Newsom issued support for Tesla and Musk during his daily COVID-19 briefing, saying that he believes the issue between Alameda County and the company will be resolved in the next few days.\n “I have long been a strong advocate and supporter early adopter, the technology, I have not only known that company, but I’ve known its founder for many, many years,” Newsome said. “I have great reverence for their technology for their innovative spirit, for their leadership, and I have great expectations that we can work through at the county level issue with this particular county and this company in the next number of days.”", "posttime": "2020-05-12 05:27:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,埃隆·马斯克,马斯克,musk,官员", "title": "埃隆·马斯克无视县命令重新启动特斯拉工厂", "title_en": "Elon Musk Restarts Tesla Factory In Defiance of County Orders", "transed": 1, "url": "https://techcrunch.com/2020/05/11/elon-musk-restarts-tesla-factory-in-defiance-of-county-orders/", "via": "", "real_tags": ["特斯拉", "埃隆·马斯克", "马斯克", "musk", "官员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们发现少数网站(即一个网站)的密码重置页面与密码使用页面托管在不同的域上。因此，在密码重置后，站点上注册了错误的密码散列。一种解决方案是创建此类站点的列表，以便PwdHash可以告诉如何处理它们。涉及服务器端更改的其他解决方案也是可能的。有时，用户希望在不能安装浏览器扩展的机器上登录他们的网络帐户(例如在网吧)。在这种情况下，用户可以连接到我们的网站，根据他们的浏览器是否支持通过脚本的剪贴板操作，向他们显示以下形式之一：JavaScript计算本地计算机上的密码散列(这样用户的密码永远不会传递给Stanford)。生成的散列密码可以粘贴到用户的Web登录表单中。", "note_en": "We found a small number of sites (i.e. one site) where thepassword reset page is hosted on a different domain than the passworduse page. As a result the wrong password hash is registered atthe site after password reset. One solution is to createa list of such sites so that  PwdHashcan tell how to handle them. Other solutions involving server-side changes are also possible.    Occasionally, users want to login to their web accounts onmachines where they cannot install browser extensions (e.g. at Internetcafes). In this case users can connect to our web site   where they are presented with one of the following forms, depending on whether their browser supports clipboard operations via script:   Javascript computes the password hash on the local machine (so that the user&#39;s password isnever communicated to Stanford). The resulting hashed password can be pasted into the user&#39;s web login form.", "posttime": "2020-05-12 05:27:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pwdhash,密码", "title": "PwdHash", "title_en": "PwdHash", "transed": 1, "url": "https://crypto.stanford.edu/PwdHash/", "via": "", "real_tags": ["pwdhash", "密码"]}, {"category": "", "categoryclass": "", "imagename": "a8985a52fcbb0bdd2b6f8d76585548a5.jpg", "infoid": 1001718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉公司(Tesla Inc.)。特斯拉首席执行官埃隆·马斯克(Elon Musk)周一晚些时候誓言，将不顾当地停产命令，重新开放这家汽车制造商在加州的工厂。特斯拉今天将违反阿拉米达县的规定重新开始生产。我会和其他人在线上。马斯克在推特上写道：如果有人被捕，我要求只有我一个人。周六，特斯拉对其在美国唯一的汽车制造工厂所在的阿拉米达县提起诉讼，加剧了与当地卫生当局的争执，后者曾表示，他们更严格的关闭令凌驾于州政府命令之上。特斯拉股价在结束常规交易日下跌1%后，在延长的交易日中下跌0.1%。", "note_en": "Tesla Inc.  TSLA,  -0.99% Chief Executive Elon Musk late Monday vowed to reopen the car maker&#39;s factory in California against local shutdown orders. &#34;Tesla is restarting production today against Alameda County rules. I will be on the line with everyone else. If anyone is arrested, I ask that it only be me,&#34; Musk tweeted. Tesla on  Saturday filed a lawsuit against Alameda County, where its sole U.S. car-making factory is located, escalating a tiff with local health authorities who have said their more stringent shutdown orders prevail over state orders. Shares of Tesla fell 0.1% in the extended session after ending the regular trading day down 1%.", "posttime": "2020-05-12 05:26:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "马斯克,dares,交易日", "title": "马斯克敢于在阿拉米达县逮捕他", "title_en": "Musk dares Alameda county to arrest him", "transed": 1, "url": "https://www.marketwatch.com/story/musk-vows-to-reopen-california-factory-2020-05-11?mod=mw_latestnews", "via": "", "real_tags": ["马斯克", "dares", "交易日"]}, {"category": "", "categoryclass": "", "imagename": "c14ee147ec43baaaaf6b65c4da16d78a.jpg", "infoid": 1001717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "独家报道：今天将是你在优步的最后一个工作日。看着哽咽的高管告诉3500名拼车员工，他们将在三分钟的变焦通话中立即被解雇。\n上周，至少35000名优步员工在3分钟的Zoom电话中得知他们将被裁员。\n每日邮报网站(Dailymail.com)获得了优步客户服务主管鲁芬·查韦罗(Ruffin Chaveleau)宣布这一消息的通话视频。\n查韦罗说：我们将裁减3500个一线客户支持职位。您的角色将受到影响，今天将是您在优步的最后一个工作日。\n裁员是在客户支持和招聘团队中进行的，这意味着司机数量基本上不会受到影响。\n一位不愿透露姓名的前优步员工抨击公司在Zoom电话会议上裁员如此之多，而且没有得到通知。\n上周，数千名优步员工在三分钟的Zoom电话中得知他们将被解雇。\n这家拼车公司通知全国3500名从事客服和招聘工作的人，这将是他们在现场通话中为优步工作的最后一天。\n优步(Uber)的鲁芬·查韦罗(Ruffin Chaveleau)负责发布这一消息，即该应用程序将取消每日邮报(DailyMail.com)获得的数千个通话中的工作岗位，这一消息由Uber的鲁芬·查韦罗(Ruffin Chaveleau)负责发布。查韦罗是优步凤凰卓越中心的负责人--优步用这个词来形容它的客户服务办公室。\nChvaleau告诉员工：我们的游乐设施业务下降了一半以上。许多前线客户支持员工没有足够的工作。[结果]我们将裁减3500个一线客户支持职位。\n您的角色将受到影响，今天将是您在优步的最后一个工作日。你将一直留在工资单上，直到你的遣散费中注明的日期。\n当查韦罗告诉员工们，没有人想接这样的电话时，她的声音嘶哑了。\n她说：我知道这很难听。没人想接这样的电话。由于每个人都很遥远，而且有这么大的变化，我们必须以一种允许我们尽快告诉你的方式来做这件事，这样你就不会从谣言工厂听到它。\n我也想亲自告诉你这个消息，我只想花一点时间来感谢你对优步的贡献。\n这已经不是查韦罗第一次告诉优步员工他们失业了。\n今年2月，这位高管的任务是通知80名员工，当优步关闭其洛杉矶客户支持办公室时，他们正在失去工作。\n这项业务已经被大流行摧毁，周三提交给公司的一份文件显示，其全球员工将裁员约3700人-约占其2.69万名员工的14%。\n裁员将在客户支持和招聘团队中进行，这意味着司机数量基本上不会受到影响。\n文件显示，该公司预计将产生约2000万美元的遣散费和相关费用。\n一位要求匿名的前优步员工抨击该公司在Zoom电话会议上解雇了这么多人，而且没有得到通知。\n她说，这是一个3700人现场直播的Zoom电话。它被控制住了。我更希望事先得到通知。前一天，我们被告知，我们将在两周内知道哪些部门将被解雇。\n他们没有通知我们。如果我错过了变焦电话，我就会错过新闻了。我们知道他们没有司机的后盾，但他们没有任何人的后盾。\n这名员工接着说：他们给我们寄来了遣散费和其他东西，但他们什么都不告诉我们。这是全球性的，但我的办公室里大约有50个人被解雇了。\n他们是按照抽奖的方式去的，就像俄罗斯轮盘赌一样。她继续说，优步的遣散费很慷慨，但他们对待我们就像对待司机一样。她指的是优步在公平补偿独立承包商方面的声誉不佳。\n她说，优步正在为他们已经裁员的人办理失业申领。他们教我们如何做那件事，然后第二天他们就解雇了我们。\n显然，首席执行官级别的某人泄露了这件事即将发生的消息，所以他们加快了行动。\n他们还没有把人赶走。他们做这件事的方式是非常消极的，她说。优步接受过同理心培训，他们教会我们同情他人的需求，但他们并没有言行一致。\n现在我们都在拿遣散费，但是如果他们愿意的话，他们可以改变主意。\n优步已经受到冠状病毒封锁的重创，因为呆在家里预约打车的人要少得多。\n该公司周四公布净亏损29亿美元，并宣布将实施招聘冻结，并从企业员工中裁员数千人。\n首席执行官Dara Khosrowshahi今年剩余时间将不会获得薪酬。他的工资定在2019年为100万美元，可能还有200万美元的奖金。\n周三发给员工的一份备忘录显示，Khosrowshahi暗示可能会有更多裁员。\n他说：我们正在考虑许多情况，以及整个公司的每一项成本，无论是可变成本还是固定成本。我们希望变得聪明，行动迅速，尽可能多地留住我们伟大的员工，并以尊严、支持和尊重对待每一个人。\nKhosrowshahi补充说，在我们冻结招聘的情况下，招聘者根本没有足够的工作。\n优步的一位首席发言人表示：让员工离职从来都不是一件容易或简单的事情，在这个前所未有的时期，我们都在几十个城市和国家的家中工作，这一点更是如此。我们一直致力于尽可能提供最清晰、最有同情心的体验，并制定了强有力的遣散费和其他福利。", "note_en": "EXCLUSIVE: &#39;Today will be your last working day with Uber.&#39; Watch as choked up executive tells 3,500 rideshare employees they are being laid off effective immediately over a three-minute ZOOM call\n At least 3,5000 Uber employees learned that they were being laid off in a three-minute Zoom call last week\n DailyMail.com obtained video of the call where Ruffin Chaveleau, head of Uber&#39;s customer service, broke the news\n &#39;We are eliminating 3,500 frontline customer support roles,&#39; Chaveleau said. &#39;Your role is impacted and today will be your last working day with Uber&#39;\n The cuts were be made among customer support and recruiting teams, meaning driver number will be largely unaffected\n A former Uber employee, who asked to remain anonymous, slammed the company for laying off so many people on a Zoom call and for the lack of notice\n        Thousands of  Uber employees learned that they were being laid off in a three-minute Zoom call last week.\n The ride-sharing company informed 3,500 people who worked in customer service and recruitment around the country that it would be their last day working for Uber on the live call.\n Uber&#39;s Ruffin Chaveleau was tasked with breaking the news that the app was &#39;eliminating&#39; thousands of jobs on the call, obtained by DailyMail.com. Chaveleau heads Uber&#39;s Phoenix Center of Excellence - the term the company uses to describe its customer service office.\n Chevaleau told staff: &#39;Our rides business is down by more than half. There is not enough work for many frontline customer support employees. [As a result] we are eliminating 3,500 frontline customer support roles.\n &#39;Your role is impacted and today will be your last working day with Uber. You will remain on payroll until the date noted in your severance package.&#39;\n    Chaveleau&#39;s voice cracked as she told the employees that &#39;no one wants to be on a call like this&#39;.\n She said: &#39;I know that this is incredibly hard to hear. No one wants to be on a call like this. With everyone remote and a change of this magnitude, we had to do this in a way that allowed us to tell you as quickly as possible so that you did not hear it from the rumor mill.\n  &#39;I also wanted to deliver this news personally and just take a brief moment to thank you for your contributions to Uber.&#39;\n This was not the first time Chaveleau had to tell Uber employees they were out of a job.\n In February the executive was tasked with informing 80 staff they were losing their jobs when Uber shut down its Los Angeles customer support office.\n The business has been devastated by the pandemic and a company filing on Wednesday revealed around 3,700 roles will be cut from its global workforce - roughly 14% of its 26,900 employees.\n The cuts will be made among customer support and recruiting teams, meaning  driver number will be largely unaffected.\n The company expects to incur about $20 million in costs for severance and related charges, the filing revealed.\n A former Uber employee, who asked to remain anonymous, slammed the company for laying off so many people on a Zoom call and for the lack of notice.\n &#39;It was a 3,700-person live Zoom call,&#39; she said. &#39;It was controlled. I would prefer to have had notice. The day before, we were told we would know in two weeks what departments would be let go.\n &#39;They gave us no notice. If I missed that Zoom call, I would have missed the news. We knew they didn&#39;t have the drivers&#39; backs, but they don&#39;t have anyone&#39;s backs.\n  The employee continued: &#39;They sent us severance and stuff, but they&#39;re not telling us anything. It&#39;s worldwide, but there were like 50 people laid off in my office.\n &#39;They were going based on a lottery, like Russian roulette. The severance package is generous, but they&#39;re treating us like they treat the drivers,&#39; she continued, referring to Uber&#39;s less than stellar reputation in fairly compensating their independent contractors.\n &#39;Uber is doing unemployment claims for people they&#39;ve laid off,&#39; she said. &#39;They taught us how to do that stuff and then the next day they fired us.\n &#39;Apparently someone at the CEO level leaked that this was gonna happen, so they expedited it.&#39;\n  &#39;They&#39;re still not done getting rid of people. The way they&#39;ve gone about it is very negative,&#39; she said. &#39;Uber has empathy training and they teach us to be sympathetic to other people&#39;s needs, but they&#39;re not practicing what they preach.\n &#39;Right now we&#39;re all getting a severance, but they can change their mind on that if they want to.&#39;\n Uber has been decimated by the COVID-19 lockdown with far fewer people booking rides as they stay home.\n The company posted a net loss of $2.9billion on Thursday and announced it was implementing a hiring freeze as well as cutting thousands of jobs from its corporate workforce.\n   CEO Dara Khosrowshahi will not be paid for the rest of the year. His salary was set for $1million in 2019 with a possible bonus of $2million.\n A memo sent to staff on Wednesday saw Khosrowshahi hint that more cuts may be on the way.\n He said: &#39;We are looking at many scenarios and at each and every cost, both variable and fixed, across the company. We want to be smart, to move fast, to retain as many of our great people as we can, and treat everyone with dignity, support and respect.\n &#39;And with our hiring freeze, &#39; Khosrowshahi added, &#39;there simply isn&#39;t enough work for recruiters.&#39;\n A spokesperson for Uber said: &#39;It&#39;s never easy or uncomplicated to let employees go, and that&#39;s only been more true during this unprecedented period, where we are all working from home across dozens of cities and countries. We&#39;ve focused on providing the clearest, most empathetic experience, possible and have put together a strong severance package and other benefits.&#39;", "posttime": "2020-05-12 05:11:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zoom,uber,优步", "title": "优步通过Zoom裁员3700人", "title_en": "Uber lays off 3700 employees via Zoom", "transed": 1, "url": "https://www.dailymail.co.uk/news/article-8301471/Watch-3-500-Uber-employees-told-laid-three-minute-ZOOM-call.html", "via": "", "real_tags": ["zoom", "uber", "优步"]}, {"category": "", "categoryclass": "", "imagename": "21f0d970e7c4e38214fb0f6685fba3b0.jpg", "infoid": 1001716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比特币刚刚经历了一个四年一遇的事件：它的第三次减半，这使得矿工大宗奖励从12.5BTC降至6.25BTC。\n2020年最受期待的加密货币事件--比特币(BTC)第三次腰斩刚刚生效。最新的比特币挖掘块奖励每四年才发生一次，刚刚将比特币块奖励从12.5BTC减少到6.25BTC。\n比特币的第三次减半活动发生在下午3点23分。根据来自贸易区块网站的数据，美国东部时间周一。根据Coin360的数据，在克服了减半的问题后，比特币的交易价格为8500美元，截至发稿时，比特币的市场主导地位为67%。\n自2009年第一个比特币区块产生以来，已经发生了三起减半事件。比特币每开采21万个区块，或者说大约每四年一次，比特币将目前的矿工区块奖励减半50%。第一次比特币减半活动发生在2012年，将原来的大宗奖励从50个比特币削减到25个比特币。第二次减半发生在2016年，奖励从25 BTC降至12.5 BTC。\n由于比特币的供应量限制在2100万枚，比特币减半的事件应该会持续到2140年，或者说到第2100万个BTC。到那时，大宗奖励应该会达到1个智士，或者说是比特币的最小单位，0.00000001比特币。根据Blockchain.com的数据，截至发布时，比特币的流通数量达到1837万。\n由于前两次比特币减半最终对比特币价格产生了积极影响，比特币减半成为各种价格预测和投机的主题。虽然一些密码玩家预测，第三次比特币减半不会影响比特币的价格，但另一些人相信，由于新比特币供应的减少，减半肯定会影响加密货币的价格。\n虽然比特币价格相关性似乎值得怀疑，但最新的比特币减半对矿商有直接影响。多位密码专家预测，新的减半将很快触发矿工关闭生产新比特币，因为大量的挖掘设备将变得过时。据Poolin的副总裁亚历山大·德拉托雷(Alejandro De La Torre)说，在比特币周一减半之前，一些没有盈利的矿商已经开始关闭他们的设备。\n比特币腰斩刚刚发生，但Cointelegraph的比特币腰斩派对仍在YouTube上继续。查看计划并使用此链接加入。", "note_en": "Bitcoin has just experienced a once-in-four-years event: its third halving, which has cut the miner block reward from 12.5 BTC to 6.25 BTC.\n   The most anticipated cryptocurrency event of 2020, Bitcoin’s ( BTC)  third halving, has just taken effect. Occurring only once every four years, the latest Bitcoin mining block reward halving just  reduced the Bitcoin block reward from 12.5 BTC to 6.25 BTC.\n Bitcoin’s third halving event took place at 3:23 p.m. EST on Monday, according to data from  Tradeblock.com. Having overcome the halving, Bitcoin is trading at $8,500, with market dominance of 67% as of press time, according to  Coin360.\n  Since the  first Bitcoin block was generated back in 2009, there have been three halving events.  Taking place once every 210,000 blocks mined, or approximately once every four years, a Bitcoin halving cuts the current miner block reward by 50%. The  first Bitcoin halving event took place in 2012, cutting the original block reward from 50 BTC to 25 BTC. The second halving took place in 2016, with the reward dropping from 25 BTC to 12.5 BTC.\n As Bitcoin’s supply is limited to 21 million coins, Bitcoin halving events should  continue to take place until the year 2140, or until the 21-millionth BTC. By that time, the block reward should reach 1 satoshi, or the smallest unit of Bitcoin at 0.00000001 BTC. At the time of publication, the number of Bitcoin in circulation amounts to 18.37 million, according to  Blockchain.com.\n  As the two previous Bitcoin halvings  eventually impacted Bitcoin’s price in positive ways, Bitcoin halvings have  become the subject of diverse price predictions and speculation. While some crypto players have predicted that the third  Bitcoin halving will have no effect on Bitcoin&#39;s price, others are  confident that the halving will definitely affect the price of the cryptocurrency due to a cut in new Bitcoin supply.\n While Bitcoin price correlation appears to be questionable, the latest  Bitcoin halving has a direct impact on miners. A number of crypto experts predict that the new halving will imminently trigger miners to  shut down generating new Bitcoin as a wide number of mining devices will become outdated. According to mining pool Poolin&#39;s vice president, Alejandro De La Torre, a number of unprofitable miners had already  begun shutting down their equipment before the Bitcoin halving on Monday.\n Bitcoin’s halving has just happened, but Cointelegraph’s Bitcoin halving party still continues on YouTube. Check out the  schedule and  use this link to join.", "posttime": "2020-05-12 04:57:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "app,事情,bitcoin,减半", "title": "事情发生了：比特币刚刚经历了历史上第三次减半", "title_en": "It Happened: Bitcoin Just Experienced Third Halving In Its History", "transed": 1, "url": "https://cointelegraph.com/news/it-happened-bitcoin-just-experienced-third-halving-in-its-history", "via": "", "real_tags": ["app", "事情", "bitcoin", "减半"]}, {"category": "", "categoryclass": "", "imagename": "c33a89ffae4a70b1f37637eba2264e3f.jpg", "infoid": 1001715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在艾滋病流行的最初几年，困惑和恐惧占据了主导地位。艾滋病仍被称为“同性恋瘟疫”。男同性恋者在某种程度上接受了任何健康建议，那就是避免性行为。1983年，活动家理查德·伯科维茨(Richard Berkowitz)和迈克尔·卡伦(Michael Callen)在病毒学家约瑟夫·桑纳本德(Joseph Sonnabend)的指导下，为他们的社区发布了一份基础性文件，名为“如何在流行病中有性”。这本小册子认识到人们生活中对快乐的需要，拒绝将禁欲作为唯一的方法，并就男同性恋者更安全的性行为提供了一些最早的指导，包括关于避孕套的建议，以及哪些性行为具有较低或更高的疾病传播风险。\n公共卫生专家几十年前就知道，仅限禁欲的信息对性是行不通的。它对物质使用也不起作用。同样，要求美国人避免几乎所有面对面的社交接触都不会遏制冠状病毒-至少不会永远如此。\n#呆在家里有它的时刻。美国迫切需要平化这一曲线，争取时间来扩大卫生保健能力、检测和接触者追踪。但隔离疲劳是真实存在的。我不是在说那些对所谓的冠状病毒恶作剧进行军国主义抗议的人。我说的是那些正在经历极度身体和社会距离带来的沉重负担的人。除了造成经济困难外，孤立还会严重损害心理健康，特别是对那些在危机开始前就已经抑郁或焦虑的人来说。在凯撒家庭基金会最近的一项民意调查中，近一半的美国人表示，冠状病毒大流行损害了他们的精神健康。\n与此同时，大多数公共卫生专家一致认为，过早恢复旧版常态将是灾难性的。各国仍然缺乏广泛的冠状病毒检测或接触者追踪的能力。到目前为止的血清学检测表明，大多数人仍然容易感染。疫苗还需要几个月甚至几年的时间。新病例继续上升，每天有数千人死亡，如果社区恢复正常运作，这些数字将不可避免地增加。\n但是，在无限期地呆在家里和现在恢复正常业务之间的选择是错误的。风险不是二进制的。而要么全有要么全无的疾病预防方法可能会产生意想不到的后果。个人可能会专注于不太可能的传染源-邮件中的包裹，街上的跑步者或骑自行车的人-而低估了预防措施，如布口罩，这些措施虽然不完美，但却有帮助。\n促进完全消除风险的公共卫生运动，如仅限禁欲的性教育，是支持长期更可持续的低风险行为的一个错失的机会。单纯的禁欲教育不仅无效，而且与更糟糕的健康结果相关，部分原因是它剥夺了人们在选择性行为时如何降低风险的理解。如果没有微妙的风险处理方法，仅限禁欲的信息可能会无意中污蔑任何低于100%风险降低的东西。在过去的两个月里，美国人看到了这一点的实时展开，因为大流行羞辱-针对那些被认为违反了社会距离规则的人，在线和面对面的谩骂-已经成为一种全国性的消遣方式。\n羞辱背后的愤怒是可以理解的。拥挤海滩的照片或大型室内派对上的人的视频可能会让观众感觉就像是在观看冠状病毒的实际传播。对看似危险的行为大喊大叫也会让人产生一种控制的错觉，尤其是在这种情况很难实现的时候。但是，正如多年的艾滋病预防研究表明的那样，羞耻并不能消除危险的行为--它只会将其推向地下。即使在今天，许多男同性恋者也不愿向医疗保健提供者披露他们的性史，因为他们预计会受到耻辱。羞辱人们的行为可能会适得其反。\n伯科维茨和卡伦知道，无限期禁欲对每个人来说都是不现实的，他们没有羞愧，而是试图给男同性恋者提供他们需要的工具，以便能够在艾滋病毒传播风险较低但不是零的情况下发生性行为。本质上，这是一种减少伤害的模式，它认识到一些人将承担风险，无论公共卫生专家是否希望他们这样做-而不是谴责，而是为他们提供减少任何潜在伤害的策略。这种方法满足人们的需求，并承认个人层面的决策发生在更广泛的背景下，其中可能包括人们无法控制的因素。\n对冠状病毒来说，减少危害看起来是什么样子？首先，政策制定者和健康专家可以帮助公众区分低风险和高风险的活动；当持续禁欲不是一个选择时，这些当局也可以为低风险的活动提供支持。科学家们对这种新病毒还有很多需要了解的地方，但早期的流行病学研究表明，并不是所有的活动或环境都会带来同样的冠状病毒传播风险。封闭和拥挤的环境，特别是长时间和近距离接触的环境，传播的风险最高，而在户外环境中的随意互动似乎风险要低得多。一个可持续的抗冠状病毒战略仍然会建议不要参加家庭聚会。但它也可能涉及重新设计室外和室内空间，以减少拥挤，增加通风，并促进物理距离，从而使人们在减轻(但不是消除)风险的同时过上自己的生活。\n其次，健康专家还可以认识到影响个人决策和冠状病毒传播风险的背景因素。一些人因为强烈的孤独、焦虑或对快乐的渴望而在家庭之外寻求人际交往。与朋友跑步或与大家庭一起聚集在公园的决定可能与一些社区目前的公共卫生指导相冲突，但对一些人来说，这些环境中冠状病毒传播的低风险可能会被人际交往、锻炼和户外活动对健康的好处所盖过。我们也可以承认，一些人不能遵守公共卫生指导，因为结构性因素，包括系统性种族主义，使身体距离成为一种特权。如果我们忽视这一更广泛的背景，有色人种不仅将继续首当其冲地遭受流行病本身的冲击，而且还将继续承受美国社会对其反应的首当其冲。\n第三，美国人可以接受，尽管我们尽了最大努力，一些人还是会选择从事高风险的活动-我们可以为他们提供减少任何潜在伤害的工具，而不是羞辱他们。想看看你的孙子孙女吗？你还打算开那个派对吗？在外面碰头。不要与人共用食物或饮料。戴上口罩。保持你的手干净。如果你病了就呆在家里。\n只要疾病控制和预防中心保持沉默，地方和州卫生部门、流行病学家和临床医生就可能需要带头。纽约市卫生和心理卫生部和哈佛医学院的教职员工都在冠状病毒大流行期间创建性健康指南，这些指南可以为社交、工作环境、学校和其他环境提供减少伤害的方法的路线图。他们传达了身体距离的迫切需要，以及正如纽约文件所说的那样，“你是你最安全的性伴侣”的想法。与此同时，纽约和哈佛的指导方针含蓄地承认，一些人可能会选择在家庭内或家庭外发生性行为，并在不同的潜在情况下提供减少伤害的提示，从而明确了风险连续体。\n美国正处于一场传染病危机之中，这场危机已经造成了全球破坏，迄今为止夺走了超过7.5万美国人的生命，而且看不到结束的迹象。但是，正如其他流行病所表明的那样，试图让人们感到羞愧，从而100%降低风险将适得其反。美国人现在需要的是一本关于如何在大流行中生活的手册。如果没有其他人提供疾控中心不会提供的指导，我们每个人都需要找出自己的指导。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n是一位传染病流行病学家，也是哈佛医学院和哈佛朝圣者保健研究所人口医学系的助理教授。", "note_en": "In the earliest years of the HIV epidemic, confusion and fear reigned. AIDS was still known as the “gay plague.” To the extent that gay men received any health advice at all, it was to avoid sex. In 1983, the activists Richard Berkowitz and Michael Callen, with guidance from the virologist Joseph Sonnabend, published a foundational document for their community, called “How to Have Sex in an Epidemic.” Recognizing the need for pleasure in people’s lives, the pamphlet rejected abstinence as the sole approach and provided some of the earliest guidance on safer sex for gay men, including recommendations about condoms and which sex acts had a lower or higher risk for disease transmission.\n   Public-health experts have known for decades that an abstinence-only message  doesn’t work for sex. It  doesn’t work for substance use, either. Likewise, asking Americans to abstain from nearly all in-person social contact will not hold the coronavirus at bay—at least not forever.\n  #StayHome had its moment. The United States urgently needed to flatten the curve and buy time to scale up health-care capacity, testing, and contact tracing. But quarantine fatigue is real. I’m not talking about the people who are staging  militaristic protests against the supposed coronavirus hoax. I’m talking about those who are experiencing the profound burden of extreme physical and social distancing. In addition to the economic hardship it causes, isolation can severely damage psychological well-being, especially for people who were  already depressed or anxious before the crisis started. In a  recent poll by the Kaiser Family Foundation, nearly half of Americans said that the coronavirus pandemic has harmed their mental health.\n    Meanwhile, most public-health experts agree that a premature return to the old version of normalcy would be disastrous. States continue to lack the capacity for widespread coronavirus testing or contact tracing. Serologic testing to date suggests that the majority of the population is still susceptible to infection. A vaccine is months or even years away. New cases continue to rise, with thousands of people dying each day, and those numbers will inevitably increase if communities go back to business as usual.\n  But the choice between staying home indefinitely and returning to business as usual now is a false one. Risk is not binary. And an all-or-nothing approach to disease prevention can have unintended consequences. Individuals may fixate on unlikely sources of contagion—the package in the mail, the runner or cyclist on the street—while undervaluing precautions, such as cloth masks, that are imperfect but helpful.\n  Public-health campaigns that promote the total elimination of risk, such as abstinence-only sex education, are a missed opportunity to support lower-risk behaviors that are more sustainable in the long term. Abstinence-only education is not just ineffective, but it’s been associated with   worse health outcomes, in part because it deprives people of an understanding of how to reduce their risk if they do choose to have sex. And without a nuanced approach to risk, abstinence-only messaging can inadvertently stigmatize anything less than 100 percent risk reduction. Americans have seen this unfold in real time over the past two months as  pandemic shaming—the invective, online and in person, directed at those perceived as violating social-distancing rules—has become a national pastime.\n  The anger behind shaming is understandable. Photos of  crowded beaches or videos of people at a large indoor party may make viewers feel as if they’re watching coronavirus transmission in action. Calling out seemingly dangerous behavior can also provide an illusion of control at a time when it’s particularly hard to come by. But, as years of research on HIV prevention have shown, shaming doesn’t eliminate risky behavior—it just drives it underground. Even today, many gay men hesitate to disclose their sexual history to health-care providers because of the stigma that they anticipate. Shaming people for their behavior can backfire.\n Berkowitz and Callen knew that indefinite abstinence wasn’t realistic for everyone, and instead of shaming, tried to give gay men the tools they needed to be able to have sex with a low but non-zero risk of HIV transmission. In essence, this is the harm-reduction model, which recognizes that some people are going to take risks, whether public-health experts want them to or not—and instead of condemnation, offers them strategies to reduce any potential harms. This approach meets people where they are and acknowledges that individual-level decisions happen in a broader context, which may include factors that are out of people’s control.\n    What does harm reduction look like for the coronavirus? First, policy makers and health experts can help the public differentiate between lower-risk and higher-risk activities; these authorities can also offer support for the lower-risk ones when sustained abstinence isn’t an option. Scientists still have a lot to learn about this new virus, but early epidemiological studies suggest that not all activities or settings confer an equal risk for coronavirus transmission. Enclosed and crowded settings, especially with prolonged and close contact, have the highest risk of transmission, while casual interaction in outdoor settings seems to be much lower risk. A sustainable anti-coronavirus strategy would still advise against house parties. But it could also involve redesigning outdoor and indoor spaces to reduce crowding, increase ventilation, and promote physical distancing, thereby allowing people to live their lives while mitigating—but not eliminating—risk.\n   Second, health experts can also acknowledge the contextual factors that affect both a person’s decisions and their risk of coronavirus transmission. Some people are seeking human contact outside of their households because of intense loneliness, anxiety, or a desire for pleasure. The decision to go for a run with a friend or gather in a park with extended family may be in conflict with current public-health guidance in some communities, but for some people, the low risk of coronavirus transmission in these settings may be outweighed by the health benefits of human connection, exercise, and being outdoors. We can also acknowledge that some people can’t comply with public-health guidance because of structural factors, including systemic racism, that render physical distancing a  privilege. If we ignore this broader context, people of color will continue to bear the brunt of not only the pandemic itself, but also  American society’s response to it.\n Third, Americans can accept that, despite our best efforts, some people will choose to engage in higher-risk activities—and instead of shaming them, we can provide them with tools to reduce any potential harms. Want to see your grandkids? Still planning to have that party? Meet up outside. Don’t share food or drinks. Wear masks. Keep your hands clean. And stay home if you’re sick.\n  As long as the Centers for Disease Control and Prevention is  silenced, local and state health departments, epidemiologists, and clinicians may need to lead the way. The  New York City Department of Health and Mental Hygiene and  faculty from Harvard Medical School each created guidance on sexual health during the coronavirus pandemic that could provide a road map for a harm-reduction approach to socializing, work environments, schools, and other settings. They communicated the urgent need for physical distancing and the idea that, as the New York document puts it, “ you are your safest sex partner.” At the same time, the New York and Harvard guidelines implicitly acknowledge that some people may choose to have sex within or outside of their households and offer tips to reduce harm in different potential scenarios, making the risk continuum clear.\n The U.S. is in the midst of an infectious-disease crisis that has wrought global devastation and taken the lives of more than 75,000 Americans to date, with no end in sight. But, as other epidemics have shown, trying to shame people into 100 percent risk reduction will be counterproductive. What Americans need now is a manual on how to have a life in a pandemic. If no one else provides the guidance  that the CDC won’t, each of us will need to figure out our own.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n         is an infectious disease epidemiologist and an assistant professor in the Department of Population Medicine at Harvard Medical School and Harvard Pilgrim Health Care Institute.", "posttime": "2020-05-12 04:57:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "隔离,fatigue,人们", "title": "隔离疲劳是真实存在的", "title_en": "Quarantine Fatigue Is Real", "transed": 1, "url": "https://www.theatlantic.com/ideas/archive/2020/05/quarantine-fatigue-real-and-shaming-people-wont-help/611482/", "via": "", "real_tags": ["隔离", "fatigue", "人们"]}, {"category": "", "categoryclass": "", "imagename": "4374c59c7d47cb73c8aca81a88be40ae.jpg", "infoid": 1001714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "访问https://NordVPN.com/RoyalOceanFilm，使用ROYALOCEANFILM代码可以获得3年期计划的70%折扣。今天就在线保护自己吧！想看看每一位新的皇室成员。", "note_en": "Go to https://NordVPN.com/RoyalOceanFilm and use code ROYALOCEANFILM to get 70% off a 3-year plan. Protect yourself online today! Want to see every new Royal...", "posttime": "2020-05-12 04:56:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宫崎骏,miyazaki,https", "title": "宫崎骏的飞艇", "title_en": "Hayao Miyazaki's Airships", "transed": 1, "url": "https://www.youtube.com/watch?v=KcXrZHJup88", "via": "", "real_tags": ["宫崎骏", "miyazaki", "https"]}, {"category": "", "categoryclass": "", "imagename": "341b89f22dd5a1e8f08859386bf696a2.png", "infoid": 1001713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "指标说明：这些指标是根据疾病控制和预防中心、世界卫生组织、美国国务院和其他公共卫生专家的指导建立的。要了解更多信息，请阅读“纽约前瞻”(NY Forward Book)。指标1-住院总人数下降。该地区必须在14天期间显示净住院总人数(每天住院总人数)的三天滚动平均值持续下降。或者，如果总住院日净增长(按3天滚动平均值计算)从未超过15，则各地区可以满足这一指标。指标2-死亡人数下降。该区域必须在14天期间显示出每日住院死亡人数的三天滚动平均值持续下降。或者，如果每日新住院死亡人数的三天滚动平均值从未超过5。指标#3-新住院人数，地区可以满足这一指标。该地区每10万居民的新住院人数必须少于2次，按三天滚动平均值计算。新住院包括新入院和后来确认为COVID阳性病例的既往入院。指标4-医院床位容量。各地区必须至少有30%的医院床位可用。指标5-ICU床位容量。各地区必须至少有30%的ICU床位可用。指标6-诊断测试能力。过去7天的平均每日诊断检查必须足以每1000名居民每月进行30次检查。指标7-接触追踪能力。每个地区的接触示踪剂数量必须达到卫生部与约翰·霍普金斯大学公共卫生和重要战略学院合作设定的阈值。", "note_en": "Description of Metrics: These metrics have been established based on guidance from the Center for Disease Control and Prevention, the World Health Organization, the U.S. Department of State, and other public health experts. For more information,  read the NY Forward Book.  Metric #1—Decline in Total Hospitalizations. Region must show a sustained decline in the three-day rolling average of total net hospitalizations (the total number of people in the hospital each day) over the course of a 14-day period. Alternatively, regions can satisfy this metric if the daily net increase in total hospitalizations (measured on a 3-day rolling average) has never exceeded 15.  Metric #2—Decline in Deaths. Region must show a sustained decline in the three-day rolling average of daily hospital deaths over the course of a 14-day period. Alternatively, regions can satisfy this metric if the three-day rolling average of daily new hospital deaths has never exceeded 5.  Metric #3—New Hospitalizations. Region must experience fewer than 2 new hospitalizations per 100,000 residents, measured on a three-day rolling average. New hospitalizations include both new admissions and prior admissions subsequently confirmed as positive COVID cases.  Metric #4—Hospital Bed Capacity. Regions must have at least 30% of their hospital beds available.  Metric #5—ICU Bed Capacity. Regions must have at least 30% of their ICU beds available.  Metric #6—Diagnostic Testing Capacity. Average daily diagnostic testing over the past 7 days must be sufficient to conduct 30 tests per 1,000 residents per month.  Metric #7—Contact Tracing Capacity. Number of contact tracers in each region must meet thresholds set by the Department of Health, in collaboration with the Johns Hopkins University School of Public Health and Vital Strategies.", "posttime": "2020-05-12 04:42:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现场,launches,指标", "title": "纽约推出每个地区的现场仪表盘进展达到7个重新开放标准", "title_en": "NY launches live dashboard of each regions progress hitting 7 reopening criteria", "transed": 1, "url": "https://forward.ny.gov/regional-monitoring-dashboard", "via": "", "real_tags": ["现场", "launches", "指标"]}, {"category": "", "categoryclass": "", "imagename": "97482a7cc9b5227bb21aa760b3192def.jpg", "infoid": 1001712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五，总部位于犹他州的监控技术公司Banjo的首席执行官兼创始人辞职，10天前，有消息称他曾是白人至上主义团体的成员。\n班卓在一篇博客文章中宣布了达米恩·巴顿(Damien Patton)的离职消息，称公司首席技术官贾斯汀·R·林赛(Justin R.Lindsey)将接替他。\n巴顿在帖子中说：“我相信班卓最伟大的日子还在前面，我会尽我所能确保我们的任务成功。”然而，在目前的情况下，我相信班卓最好的前进道路是在不同的领导下。“。\n自从在线科技出版物OneZero报道巴顿十几岁时是三K党(Ku Klux Klan)的成员，并是犹太教堂枪击案的逃逸司机以来，该公司一直受到密切关注。\n在消息发布当天的一篇博客文章中，巴顿否认了他过去的信仰，并向那些他伤害过的人道歉。\n他写道：“我对我生命中的这段时间深感羞愧，并对我与可恶团体的关系感到由衷的悔恨和深深的遗憾，这些团体的行为和信仰是完全卑鄙、不道德和不可辩解的。”\n犹他大学为班卓的服务每年支付50万美元，周四终止了合同。所有其他已知的州合同-在司法部长肖恩·雷耶斯(Sean Reyes)和他的工作人员的敦促下获得的-都被暂停，直到他们从第三方审计中获得结果。\n州审计师约翰·杜格尔(John Dougall)正在审查该平台是否容易受到偏见或隐私问题的影响。该平台涉及从UDOT交通摄像头、911呼叫、紧急车辆位置以及私人和公共安全摄像头获取数据。\n该公司表示，他们使用这些信息来帮助急救人员，并在需要的地方迅速部署资源，但隐私专家长期以来一直担心Banjo的潜在危害，要么是滥用数据，要么是来自黑客。\n在这篇博客文章中，新任首席执行官林赛说：“9个月前，我受到班卓全职加入公司担任首席技术官的使命的鼓舞。作为首席执行官，我期待着班卓继续致力于保护隐私的技术解决方案。“", "note_en": "The CEO and founder of the  Utah-based surveillance technology company Banjo resigned from his position on Friday, 10 days after news emerged that he’d been a member of white supremacist groups.\n  Banjo announced Damien Patton’s departure in a  blog post, saying the company’s chief technology officer, Justin R. Lindsey, would replace him.\n  “I am confident Banjo’s greatest days are still ahead, and will do everything in my power to ensure our mission succeeds,&#34; Patton said in the post. &#34;However, under the current circumstances, I believe Banjo’s best path forward is under different leadership.”\n    Since OneZero, an online science and tech publication,  reported Patton was a member of the Ku Klux Klan as a teenager and was the getaway driver in a synagogue shooting, the company has come under scrutiny.\n  In a blog post the day the news broke, Patton disavowed his past beliefs and apologized to those he’d hurt.\n  “I am deeply ashamed of this time in my life and feel sincere remorse and deep regret for my affiliation with hateful groups whose actions and beliefs are completely despicable, immoral and indefensible,” he wrote.\n  The University of Utah, which paid $500,000 a year for Banjo’s services,  terminated its contract Thursday. All other known state contracts — secured at the urging of Attorney General Sean Reyes and his staff — are suspended until they get results from a  third-party audit.\n  State Auditor John Dougall is reviewing whether the platform, which involves taking in data from UDOT traffic camera feeds, 911 calls, emergency vehicle locations, and private and public security cameras, is susceptible to bias or privacy concerns.\n    The company says it uses the information to help first responders and quickly deploy resources where they’re needed, but privacy experts had long been worried about Banjo’s  potential for harm, either through the misuse of data or from hackers.\n    In the blog post, new CEO Lindsey said, “Nine months ago, I was inspired by Banjo’s mission to join the company full time as the CTO. As CEO, I’m looking forward to continuing Banjo’s dedication to technology solutions that protect privacy.”", "posttime": "2020-05-12 04:42:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "首席,ceo,班卓", "title": "班卓首席执行官在过去成为KKK成员的消息传出后辞职", "title_en": "Banjo CEO steps down after news of past KKK membership", "transed": 1, "url": "https://www.sltrib.com/news/2020/05/08/banjo-ceo-steps-down/", "via": "", "real_tags": ["首席", "ceo", "班卓"]}, {"category": "", "categoryclass": "", "imagename": "53c742031a3a5d9c42caf45083586660.png", "infoid": 1001711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "再过几个小时，比特币网络将经历第三次“腰斩”。那么它是什么，它是如何在引擎盖下工作的呢？\n简单回顾一下：此时此刻，世界各地的矿工都在运行硬件和软件，以计算下一个比特币区块的哈希值。\n如果他们设法及时解开这道数学难题，他们就可以索要整笔奖金。\n这里有很多流行语，不是吗？让我们把它分解一下。\n采矿的整个概念是非常聪明的。实际上并没有什么难题需要解决，它更多的是一种暴力尝试，试图猜出一个神奇的数字。\n比特币网络几乎在任何地方都使用SHA256哈希。简而言之，世界各地的矿工都在尝试运行这个功能：\n$magicNumber也称为现时值，这是一个曾经使用过的数字。通过将先前块的散列包括在新的散列计算中，形成将每个块链接到新块的实际链。区块链本质上是类固醇上的链表。\n矿工们正在猜测$magicNumber的价值。它们反复运行完全相同的计算，递增(或随机化)$magicNumber值。通过这样做，它们每次都会更改函数的结果。\n它是如此简单，几乎是愚蠢的。计算的难度取决于前面需要多少个零。当第一个区块被开采时，它的前面只有8个零：\n在撰写本文时，当计算出最后一个散列时，它的前面有19个零。\n前面需要的零越多，就越难猜出这个神奇的数字。\n旁注：这个算法的卓越之处实际上在于它每隔2016个模块就会自动重新计算难度目标(也就是：需要多少个零)，但这是为了另一次写入。\n如果你猜对了数字，你就会得到奖励。这一奖励以新铸造的比特币的形式出现。\n这些比特币基本上是凭空创造出来的。只不过它既不薄也不空气。努力以计算能力和能量的形式投入到网络中。结果，你得到了比特币。作为一名矿工，您的奖励是保护网络安全的结果。\n这些新创造的比特币是在所谓的Coinbase交易中创造的。这是一个独特的交易，包括在每个区块中，它向猜到正确散列的矿工支付一定数量的比特币。\n(是的，这可能就是广受欢迎的加密货币交易所“Coinbase”得名的原因，它指的是矿工奖励交易。)\n每个正确区块的奖励都是自动计算的，并随着比特币网络的推进而自动调整。这种工作方式非常漂亮，我很乐意带您来一次代码之旅。\nCAmount GetBlockSubsidy(int nHeight，const Consensus：：params&amp；consensusParams){int halvings=nHeight/consensusParams。nSubsidyHalvingInterval；//未定义Right Shift时强制块奖励为零。如果(Halvings&&gt;；=64)返回0；CAmount nSubsidy=50*硬币；//补贴每210,000块削减一半，大约每4年发生一次。nSubsidy&gt；&gt；=减半；返回nSubsidy；}。\n那里面是什么？让我们把它分解一下。我写C已经有一段时间了，但幸运的是，它的可读性相当好。\n最后一个参数conensusParams.nSubsidyHalvingInterval在src/chainparams.cpp中定义为共识规则的一部分。这是比特币网络上的每个人都需要遵守的一套规则。\n附注：对这些共识规则的任何更改都将创建一个“硬分叉”，即一套不再遵循原有链条的新规则。\nnHeight指的是当前块的“高度”。或者，换句话说，就是已经发生的块数。\n这将使减半的价值为3。这将是该电视网第三次将其整体奖励减半。\n但是，如果有一个浮点结果值，显然它不适合整型变量，会发生什么呢？\n这将导致2.952380952。但是，由于变量被定义为整数，因此通过删除小数将其四舍五入为最低整数值。然后，减半变成2。\n//未定义右移位时强制块奖励为零。如果(Halvings&gt；=64)返回0；\n这是一种我不太理解的条件的安全代码：如果出于某种原因，consensusParams.nSubsidyHalvingInterval太低或nHeight非常高，则会导致变量减半的值也很高。\n我认为这张支票无关紧要，因为我们会看到下面的代码？\n更新：多亏了@niobos，我现在知道Shift-by操作数被屏蔽了。这对于本文中较低的代码很重要，但这意味着x&gt；&gt；65变为x&gt；&gt；1，因此需要保留对&gt；=64的检查。\n这部分经常被误解为“会有64个比特币腰斩”。这是不正确的。比特币将减半33个，我们将看到更低的部分。\n“减半”这个词指的是限制你作为矿工可以获得的比特币数量的过程。每21万个街区，这个数字就会减半。\n在一开始，10多年前，每在网络上发现一个区块，就会奖励50个比特币。\n然后，在21万个街区之后，这个数字被削减了一半，只有25个。再过21万个街区，就变成了12.5。这就是我们今天所处的位置。\n几个小时后，它将再次被砍成两半，只有6.25个比特币奖励给矿工。再快进210,000个数据块，就变成了3.125个。诸若此类。\n我想要强调的是，该代码中正在进行一个聪明的按位操作：\n块奖励的起始值固定为50。每枚硬币可以分为100,000,000个单位，在src/mount t.h中定义。如果我们想要正确的话，一个矿工得到的不是“一枚比特币”作为奖励，而是一枚比特币的“一亿块”作为奖励。\n这为我们提供了初始值nSubsidy为5,000,000,000。如果你用二进制编写，你会得到。\nnSubsidy&gt；&gt；=3表示：将位向右移动3位。这就给我们留下了：\n当您将该二进制值转换为其十进制表示形式时，您将获得625,000,000。换言之：“625,000,000 mBTC”或“6.25 BTC”。\n在下一次减半时，在小数表示的末尾又减少了一个零，有效地再次减半了奖励值。\n因为总共只有33位，我们将在第33次减半后(大约在2140年)用完块奖励减半。\n(假设在这一点上，支付的交易费应该足以补偿矿工的电力消耗和硬件。)。\n一个由数千名(如果不是数百万名)矿工组成的网络可以和谐工作的整个想法令人振奋。如果你曾经尝试过建立一个由5个节点组成的集群，你就会知道达成共识或法定人数是很困难的。\n这一切都适用于比特币网络，在未知的硬件上运行，在未知的网速和未知的节点版本和软件上运行-这一切都是因为数学和社会共识，即每个人在网络上都遵循相同的规则。\n它以最新的新闻、指南和教程以及新的开源项目为特色。您可以通过下面的电子邮件注册。", "note_en": "In a few hours, the Bitcoin network will experience its third “halving”. So what is it and how does it work under the hood?\n   A quick recap:  miners all around the world are, at this very moment, running hardware and software to calculate the  hash of the next Bitcoin block.\n If they manage to solve the mathematical puzzle in time, they can claim the  block reward.\n That’s a lot of buzzwords right there, isn’t it? Let’s break it down.\n  The whole concept of mining is extremely clever. There isn’t actually a  puzzle to solve, it’s more of a brute force attempt at trying to  guess a magic number.\n The Bitcoin network uses  SHA256 hashes pretty much everywhere. In a simplified version, miners all around the world are trying to run this function:\n  The  $magicNumber is also called a  nonce, a  Number Used Once. By including the previous blocks’ hash in the new hash calculation, an actual chain is formed linking each block to the new one. A blockchain is essentially a  linked list on steroids.\n Miners are in the process of  guessing the value of  $magicNumber. They run the very same calculations over and over again, incrementing (or randomizing) the  $magicNumber value. By doing so, they change the outcome of the function every time.\n    It’s so simple it’s almost stupid. The  difficulty of the calculations are determined by how many zeroes need to be at the front. When the  very first block was mined, it only had 8 zeroes at the front:\n  When, at the time of writing, the last hash was calculated, it had  19 zeroes at the front.\n  The more zeroes are needed at the front, the more difficult it becomes to guess that  magic number.\n Sidenote: the brilliance of this algorithm is actually in the way it automatically re-calculates its difficulty target (aka: how many zeroes are needed) every 2016 blocks, but that’s for another write-up.\n  If you guess the number correctly, you get a reward. That reward comes in the form of newly  minted Bitcoins.\n These are Bitcoins that are essentially created  out of thin air. Except it’s neither thin nor air.  Effort was put into the network in the form of computational power and energy. As a result, you get Bitcoin. As a miner, your reward is the result for securing the network.\n These newly created Bitcoin are created in what is called a  Coinbase Transaction. This is a unique transaction, included in every block, that pays a certain amount of Bitcoin to the miner that guessed the correct hash.\n (Yes, that’s probably where the popular cryptocurrency Exchange “Coinbase” got its name from, a reference to the miner reward transaction.)\n The reward for each correct block is calculated automatically and auto-adjusts as the bitcoin network marches on. The way this works is quite beautiful, and I’d love to take you on a trip through the code.\n   CAmount  GetBlockSubsidy ( int  nHeight ,  const  Consensus :: Params &amp;  consensusParams ) {  int  halvings  =  nHeight  /  consensusParams . nSubsidyHalvingInterval ;  // Force block reward to zero when right shift is undefined.   if  ( halvings  &gt;=  64 )  return  0 ;  CAmount  nSubsidy  =  50  *  COIN ;  // Subsidy is cut in half every 210,000 blocks which will occur approximately every 4 years.   nSubsidy  &gt;&gt;=  halvings ;  return  nSubsidy ; }\n So, what’s in there? Let’s break it down. It’s been a while since I wrote C, but lucky for us it’s fairly readable.\n    The last parameter,  consensusParams.nSubsidyHalvingInterval, is defined in  src/chainparams.cpp as part of the  consensus rules. These are a set of rules everyone on the bitcoin network needs to honour.\n Sidenote: any change on these consensus rules would create a “hard fork”, a new set of rules that no longer follow the original chain.\n   The  nHeight refers to the current block “height”. Or, put differently, the number of blocks that have already happened.\n   Which will give  halvings a value of 3. This will be the third time the network has halved its block reward.\n But what happens if there’s a floating point result value, clearly that doesn’t fit in an  int variable?\n  This would result in 2.952380952. However, since the variable is defined as an integer, it is  rounded to the lowest integer value by dropping the fractional. Then,  halving becomes 2.\n   // Force block reward to zero when right shift is undefined.  if  ( halvings  &gt;=  64 )  return  0 ;\n This is safety code for a condition I don’t quite understand: if, for some reason,  consensusParams.nSubsidyHalvingInterval is too low or  nHeight is  very high, it would result in the variable  halvings with a high value too.\n I don’t think this check matters, because of the code we’ll see lower down?\n  Update: thanks to  @niobos, I now know that the shift-by operand is masked. This is important for the code lower in this post, but it means that  x &gt;&gt; 65 becomes  x &gt;&gt; 1, so the check for  &gt;= 64 needs to stay.\n This part is often misinterpreted as “there will be 64 Bitcoin halvings”. That is incorrect. There will be 33 Bitcoin halvings, as we’ll see lower.\n  The word “halving” refers to the process of limiting the amount of Bitcoin you can get as a miner. At every 210,000 blocks, that amount is  cut in half.\n  At the very start, more than 10 years ago, 50 Bitcoin were rewarded for every block found on the network.\n Then, after 210,000 blocks, that got cut in half to 25. Another 210,000 blocks later, that became 12.5. That’s where we are today.\n In a few hours, it’ll be cut in half again, and only 6.25 Bitcoins are rewarded to the miner. Fast-forward another 210,000 blocks and that becomes 3.125. And so on.\n There’s a clever  bitwise operation going on in that code that I want to highlight:\n     The block rewards have a fixed start value at 50. Each coin can be divided into 100,000,000 units, defined in  src/amount.h. If we want to be correct, a miner doesn’t get “a Bitcoin” as a reward, it gets “100,000,000” pieces of a Bitcoin as a reward.\n  This gives us an initial value of  nSubsidy at  5,000,000,000. If you write that in binary, you get\n  The  nSubsidy &gt;&gt;= 3 means: shift the bits 3 places to the right. This leaves us with:\n  When you convert that binary value to its decimal representation, you get  625,000,000. In other words: “625,000,000 mBTC” or “6.25 BTC”.\n At the next halving, another zero gets cut at the end of the decimal representation, effectively halving the reward value once again.\n Because there are only 33 bits in total, we will run out of block rewards to halve after the 33rd halving, roughly in 2140.\n (It’s assumed that at that point, the transaction fees being paid should be sufficient to compensate the miner power consumption and hardware.)\n   The whole idea that a network of thousands, if not millions, of miners can work in harmony is mindblowing. If you’ve ever tried to set up a 5-node cluster of  anything, you’ll know reaching  consensus or  quorum can be hard.\n  This all  just works on the Bitcoin network, operating on unknown hardware, on unknown internet speeds with unknown node versions and software - all because of math and the social consensus that everyone follows the same rules on the network.\n         It features the latest news, guides &amp; tutorials and new open source projects. You can sign up via email below.", "posttime": "2020-05-12 04:41:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,减半,code,矿工", "title": "剖析导致比特币减半的代码", "title_en": "Dissecting the code responsible for the Bitcoin halving", "transed": 1, "url": "https://ma.ttias.be/dissecting-code-bitcoin-halving/", "via": "", "real_tags": ["代码", "减半", "code", "矿工"]}, {"category": "", "categoryclass": "", "imagename": "826f7d860fca07eb053df4d74ba88df5.jpeg", "infoid": 1001710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "芝加哥(美联社)-推特周一宣布，当一条推文包含有争议的或误导性的关于冠状病毒的信息时，它将警告用户。\n这项新规定是科技公司为应对其网站上爆发的与病毒相关的错误信息而推出的一系列更严格政策中的最新一项。\n公司领导周一表示，Twitter将采取逐案处理的方式来决定哪些推文被贴上标签，只会删除有害的帖子。\n一些推文在运行时会在下面加上一个标签，将用户引导到一个链接，该链接包含有关冠状病毒的其他信息。其他推文可能会被警告标签完全覆盖，提醒用户“这条推文中分享的部分或全部内容与公共卫生专家关于冠状病毒的指导相冲突。”\n新的标签将有大约40种语言版本，最快今天就会开始出现在推特上。这一警告可能会追溯到过去的推文。\nTwitter全球公共政策高级策略师尼克·皮克尔斯(Nick Pickles)说，Twitter不会直接对网站上的推文进行事实核查或称其为虚假推文。警告标签可能会将用户引导到经过策划的推文、公共卫生网站或新闻文章。\n皮克斯说：“人们不希望我们扮演为他们决定什么是真、什么是假的角色，但他们确实希望人们在提供背景信息时发挥更强大的作用。”\n这条微妙的界线类似于科技竞争对手Facebook的做法，Facebook曾表示，它不想成为“真相的仲裁者”，但已经安排了第三方事实核查人员来审查其网站上的虚假信息。美联社是Facebook事实核查计划的一部分。\n可能在其网站上贴上标签的有争议的推文的一个例子包括关于冠状病毒来源的说法，这仍然是未知的。关于这种病毒是如何开始的，以及它是否是人为的，阴谋论已经在社交媒体上流传了几个月。\n推特将继续删除对个人或团体安全构成威胁的冠状病毒推文，并试图煽动大规模暴力或广泛的内乱。该公司已经清除了虚假的冠状病毒治疗方法，并声称社交距离或口罩不能遏制病毒的传播。\n今年2月，推特(Twitter)宣布了一项类似的举措，在民主党众议院议长南希·佩洛西(Nancy Pelosi)的一段视频被放慢速度，使其看起来像是含糊的话之后，在其网站上贴上了篡改或篡改的照片或图像的标签。从那时起，Twitter只对被操纵的媒体贴了两次标签。\n科技巨头谷歌、Facebook、YouTube和Twitter已经对错误信息的全球传播做出了回应，自1月份病毒爆发以来，这些错误信息一直在传播。上个月，Facebook还开始提醒那些与冠状病毒错误信息互动的用户，将他们引导到世界卫生组织的事实页面。", "note_en": "Chicago (AP) — Twitter  announced Monday it will warn users when a tweet contains disputed or misleading information about the coronavirus.\n The new rule is the latest in a wave of stricter policies that tech companies are rolling out to confront an outbreak of virus-related misinformation on their sites.\n Twitter will take a case-by-case approach to how it decides which tweets are labeled and will only remove posts that are harmful, company leaders said Monday.\n  Some tweets will run with a label underneath that directs users to a link with additional information about COVID-19. Other tweets might be covered entirely by a warning label alerting users that “some or all of the content shared in this tweet conflict with guidance from public health experts regarding COVID-19.”\n The new labels will be available in roughly 40 languages and should begin appearing on tweets as soon as today. The warning could apply retroactively to past tweets.\n Twitter won’t directly fact check or call tweets false on the site, said Nick Pickles, the company’s global senior strategist for public policy. The warning labels might direct users to curated tweets, public health websites or news articles.\n “People don’t want us to play the role of deciding for them what’s true and what’s not true but they do want people to play a much stronger role providing context,” Pickles said.\n The fine line is similar to one taken by tech rival Facebook, which has said it doesn’t want to be an “arbiter of the truth” but has arranged for third-party fact checkers to review falsehoods on its site. The Associated Press is part of Facebook’s fact-checking program.\n One example of a disputed tweet that might be labeled on its site includes claims about the origin of COVID-19, which remains unknown. Conspiracy theories about how the virus started and if it is man-made have swirled around social media for months.\n Twitter will continue to take down COVID-19 tweets that pose a threat to the safety of a person or group, along with attempts to incite mass violence or widespread civil unrest. The company has already been removing bogus coronavirus cures and claims that social distancing or face masks do not curb the virus’ spread.\n Twitter  announced in February a similar initiative to label doctored or manipulated photos or images on its site after a video of Democratic House Speaker Nancy Pelosi was slowed down to make it appear as if she slurred her words. Since then, Twitter has only applied the label twice to manipulated media.\n  Tech giants Google, Facebook, YouTube and Twitter have responded to a global spread of misinformation that has moved with the virus since the outbreak began in January. Last month, Facebook also began  alerting users who interacted with coronavirus misinformation by directing them to the World Health Organization’s fact page.", "posttime": "2020-05-12 04:13:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,推特,病毒,争议,label", "title": "推特将为有争议的冠状病毒推文贴标签", "title_en": "Twitter To Label Disputed COVID-19 Tweets", "transed": 1, "url": "https://apnews.com/c8a542e2f22004c0c06cbbe1e1b58a52", "via": "", "real_tags": ["冠状病毒", "推特", "病毒", "争议", "label"]}]