[{"category": "", "categoryclass": "", "imagename": "be9607374578fd9bd13d7c7a479f32ac.png", "infoid": 1013169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电流量子干涉是传统超导量子干涉器件(SQUID)中最重要、最广为人知的量子现象。在这里，我们报道了在原子鱿鱼中观察到电流的量子干涉。与传统的SQUID类似，原子SQUID中流经两个结点的电流由于旋转的相位差而受到干扰。这种干扰会导致临界电流的调制。这种调制被观察到三个不同的半径，具有清晰的调制周期，被测量为与基本旋转率一致。这一观察结果表明，用原子电子鱿鱼研究各种有趣的鱿鱼物理是可能的，特别是，有电流的宏观量子现象可以用原子电子鱿鱼实现旋转传感量子测量的目标。\n具有约瑟夫森结的回路中的超流体由于其独特的量子现象及其在量子传感和信息处理中的应用，在过去的几十年里得到了广泛的研究。电流的量子干涉是这类系统中最重要的量子现象之一，超导量子干涉器件(SQUID)就是以此命名的。在传统的SQUID中，由于外加磁场，超导体中的电子会受到相位扭曲的影响，而量子干扰引起的临界电流的周期性调制导致了直流SQUID作为最灵敏的磁力计3、4的发展。利用超流氦的中性原子，已经证明了由器件的物理旋转引起的相位扭曲会产生电流的量子干涉，从而使旋转传感成为可能5、6。此外，原子子型SQUID 7、8，一种原子子式的9模拟磁力仪。已经被开发用来探索具有稀薄量子气体的鱿鱼的量子现象。\n原子鱿鱼由一个环形陷阱和充当约瑟夫森结的隧道势垒组成。与传统的SQUID类似，可以使用不同数量的约瑟夫森结来制作原子SQID，以满足不同的应用。对于单结原子SQUID，已经观察到相位滑移7和滞后10，表现出与射频(RF)SQUID相似的特性。在双结原子SQUID中，约瑟夫森效应8和阻性流11已经被证实，但至今还没有观察到电流的量子干涉。\n在这里，我们通过测量临界电流的周期调制，首次观测到原子SQUID中电流的量子干涉。与DC SQUID类似，外部旋转产生的相位扭曲由于量子干扰而产生对临界电流的周期性调制。我们观察到一个临界原子数的周期调制，这相当于对临界电流的调制，对于三个不同的原子SQUID半径，我们选择这三个不同的原子来演示调制周期的变化。理论上，调制周期等于一个单位缠绕数的环内循环原子的自转速率，可称为基本自转速率Ω0 12。实测的调制周期与直接测量的Ω0一致，证实了观测到的周期调制是旋转诱导量子干涉的结果。这种直流原子鱿鱼的实现使得制造灵敏和紧凑的旋转传感器成为可能。此外，传统SQUID的许多有趣的量子现象都可以用稀薄的量子气体来研究。特别地，可以通过控制物理旋转来操纵电流的量子态，使得能够为许多有趣的应用创建宏观量子态，包括旋转传感13、14、15、16和量子信息处理17的量子计量。\n临界电流的周期性调制可以通过计算基于量子相控约瑟夫森结电流和环形陷阱几何形状的原子电子SQUID模型中的总电流来理解(图1a)。总电流是两个约瑟夫森结电流的量子干涉的结果，由下式给出。\n其中Ic是原子的临界电流，It是总电流，Ij是原子电子鱿鱼周围的循环电流。由于描述原子的波函数的环形几何和单值性，相位应满足。\n式中\\(\\ω=\\frac{\\omega}{{\\omega}_{0}}\\)，其中Ω是原子的旋转速率，n是整数。原子的自转速度可以表示为。\n其中\\({\\omega}_{\\rm{ext}}=\\frac{{\\omega}_{\\rm{ext}{{\\omega}_{0}}\\)，Ωext是原子鱿鱼的外转速，\\(\\beta_{{\\mathm{ATOM}=\\frac{{2\\pi_{\\rm{c}\n双结原子鱿鱼的示意图。原子化SQUID是通过扫描单束834 nm激光束产生的，束腰为1.7 µm，势垒半高宽为2.1 µm，ΩEXT为原子化SQUID的旋转率，Ω为原子的旋转率。∅1和∅2是约瑟夫森结的相位差，I1和I2是约瑟夫森结电流，N1和N2是每一半的原子数。箭头表示交汇点的移动。计算了半径为3.85 µmb的原子SQUID电势和原子密度，它们是不同Ω原子值下计算的ΩEXT/β0的函数。C归一化临界电流(2Ic/N)，其中Ic是临界电流，N是原子总数，对于半径为3.85ωµm的原子SQUID，它是具有不同 EXT的原子数的函数。β原子随原子数和临界电流的变化而变化。对于每个原子数，计算β原子，以求出归一化临界电流的变化。对3种不同归一化偏置电流的临界原子数随ΩEXT/Ω0的D调制(半径为3.85 µm的原子SQUID)。\n方程(1)-(4)等价于DC SQUID的方程4，反映了双结原子SQUID和DC SQUID的基本物理基础相同的事实。在β原子 = 0的极限下(例如，当Ic ≈ 0具有更高的势垒高度时)，我们可以解析地计算总电流：It = 2 I Ccos(πωExt)Sin(∅1 − πωExt)。因此，临界电流为|2I CCOS(πωEXT)|，其建立了周期为Ω0的临界电流的清晰调制。对于有限的β原子，我们可以数值计算临界电流，周期调制幅度随着β原子的增加而减小，如图1b所示。\n利用图1b中计算的调制，用二维(2D)的Gross-Pitaevskii方程(GPE)8，18计算了原子电子SQUID中临界电流的预期周期调制。图1c显示了归一化临界电流(有关原子电子鱿鱼中约瑟夫森效应的详细信息，请参阅“方法”)，它是归一化为原子数(2Ic/N)的原子临界电流，作为原子数在原子电子鱿鱼不同转速下的函数。对于固定的原子数量，图1c中所示的归一化临界电流随旋转速度调制。然而，由于归一化临界电流对原子数的强烈依赖性，以及难以稳定地产生具有相同原子数的BEC，因此很难在实验上观察到这种调制。因此，我们使用固定的归一化偏置电流，而不是固定的原子数量，这是通过以固定的速度移动约瑟夫森结而产生的。当转速改变时，临界原子数--即在从直流到交流(AC)约瑟夫森效应与所选择的归一化偏置电流的转变处的原子数量--周期性地调制，如图1D的GPE计算所示。我们选择这种临界原子数的调制作为观察电流量子干涉的一种方式。\n在先前的工作19中，通过扫描激光束产生的时间平均电位，即绘制电位(详见绘制电位上的“方法”)被用来创建各种原子电路20，并且这里使用该方法来创建双结原子电子鱿鱼，如图1a所示。在扫描过程中，通过降低特定位置的激光束功率来控制原子鱿鱼中障碍物的高度、厚度和位置的变化。\n87Rb BEC是在具有不同转速的双结原子鱿鱼中创建的(有关详细信息，请参阅BEC生产中的“方法”)。然后，将两个结彼此移动以产生如图2a所示的归一化偏置电流0.8 s−1，并且将两个结的旋转速率选择为ΩExt + 2πf和ΩExt − 2πf以实现这一点。在这一结移动步骤之后，通过原位吸收成像测量原子数量，以确定归一化布居差\\(z=\\frac{{N_2-N_1}}{N}\\)(见图11a)。Z从DC(由于保持相同密度的原子在结和N &gt； Nc之间的隧穿而保持恒定的z，其中Nc是临界原子数)到AC(由于原子的净隧穿减少而导致结上的密度差异和N &lt； Nc)约瑟夫森效应的变化可以在图2b中看到，对于原子的两种不同的旋转速度。为了确定临界原子数，数据用带有斜率的直线和带有过渡点的常数的分段函数拟合。\n计算Ω0不是平凡的，因为与陷阱23的半径相比，原子波函数的宽度很重要。计算是通过在旋转坐标系中将BEC的能量最小化来实现的，而GPE是在2D中进行的。图4a显示了Ω0的实测值和计算值的比较。基于Ω0测量数据进行半径估计的最佳拟合值为0.96，正好位于标定尺度的1σ不确定度范围(0.97和1.0 3)之外。这种小位移的一个可能原因是陷阱电位中的小缺陷改变了Ω0的值。这一机制和其他可能的转变机制可能会在未来进一步研究。\n曲线图中的误差条代表标准误差。Ω0/2π的实测值和计算值的比较(使用gpe进行计算)。这三条曲线对应于雾化鱿鱼半径的校准刻度。用GPE模拟和DC SQUID理论计算得到的B-d临界原子数随转速的变化，以及测量数据和最佳拟合结果，验证了B-d临界原子数与旋转率的关系。对于b，半径为4.82 µm；对于c，半径为3.85 µm；对于d，半径为2.891 µm。\n图3中数据集的调制波形与图1D中的理论曲线相比显示出一些不同。为了更详细地研究这些差异，我们对测量临界原子数的实验序列进行了动态2D GPE模拟。图4b-d显示了数据集和DC SQUID理论曲线的比较。GPE仿真结果与DC SQUID理论在波形上有很好的一致性。然而，临界原子数在这两种计算之间有一个恒定的变化。我们认为这种转变的发生是因为动力学不是完全绝热的。因此，微小的残余相位涨落引发了从直流到交流约瑟夫森效应的转变，净效应是降低临界电流，从而增加临界原子数。GPE模拟结果与实验数据相比仍有一定差异。主要区别在于第二次振荡的振荡幅度降低。这种类阻尼效应可能是由势原子和非旋转热原子的静态微扰引起的。一项改变静态微扰和热原子振幅的专门研究可能会在未来进一步阐明这一效应。\nDC SQUID理论与GPE模拟的良好一致性表明，该系统是实现稀量子气体下常规SQUID各种量子现象的理想系统。例如，原子电子鱿鱼提供了通过利用其以高分辨率和灵敏度24检测各种多体状态的能力来研究宏观量子效应的可能性。利用这种独特的能力，有可能模拟和研究常规SQUID的许多量子现象，以解决关于宏观量子态25的性质的各种紧迫的未决问题。另一个有希望的方向在于创造不同角动量状态的宏观叠加。这些状态可与Leggett-Garg不等式26一起用于旋转传感的量子计量、量子信息处理以及宏观现实主义的可能测试。\n在前面的工作8中，通过与偏置电流的比较测量临界电流，用原子电子SQUID演示了约瑟夫森效应。结果表明，归一化电流定义为(doz=2i/N)，其中i为原子电流，N为原子总数，(z=frac{{N2-N1}}{N})为归一化布居差，是描述原子鱿鱼约瑟夫森效应18的有效方法。通过以旋转频率f使两个结彼此靠近，可以感应偏置电流。归一化偏置电流可计算为(点z0=4f)，其中z0是相同化学势和原子密度下的平衡归一化布居差。约瑟夫森效应在直流区和交流区是约瑟夫森效应，其中(点z{rm{c}}，&rm{c})是归一化临界电流，在交流区，原子鱿鱼的两个区域之间存在原子密度差.在交流区，当(点zrm{c})是归一化临界电流时，约瑟夫森效应是在交流区，而在交流区，原子鱿鱼的两个区域之间存在着原子密度的差异，当(点zrm{c})是归一化临界电流时，约瑟夫森效应是在交流区，而当(点z{rm{c}})是交流区时，约瑟夫森效应是在交流区，其中是归一化临界电流.。\n绘制电位是来自快扫描激光束19的时间平均光学电位。本实验使用了两束绘制光束。一种为垂直涂装光束，波长为834 nm，腰围为1.7 µm；另一种为水平涂装光束，波长为10 6 4 nm，腰围为12 µm，涂装频率分别为15 kHz和33 kHz。垂直光束绘制的雾化鱿鱼的陷阱深度为82 NK，障碍物的全宽最大为", "note_en": "Quantum interference of currents is the most important and well known quantum phenomenon in a conventional superconducting quantum interference device (SQUID). Here, we report the observation of quantum interference of currents in an atomtronic SQUID. Analogous to a conventional SQUID, currents flowing through two junctions in an atomtronic SQUID interfere due to the phase difference from rotation. This interference results in modulation of critical currents. This modulation was observed for three different radii with clear modulation periods which were measured to be consistent with fundamental rotation rates. This observation shows the possibility of studying various interesting SQUID physics with an atomtronic SQUID and especially, macroscopic quantum phenomena with currents may be realized with an atomtronic SQUID toward the goal of quantum metrology of rotation sensing.\n     A superfluid in a loop with Josephson junctions has been studied for the past several decades because of its unique quantum phenomena and applications in quantum sensing  1 and information processing  2. One of the most important quantum phenomena in such a system is the quantum interference of currents, after which superconducting quantum interference devices (SQUIDs) were named. In a conventional SQUID, the electrons in superconductors are subject to phase twists due to the external magnetic field and the periodic modulation of critical currents that results from quantum interference led to the development of the direct current (DC) SQUID as one of the most sensitive magnetometers  3, 4. Using neutral atoms of superfluid helium, it has been shown that the phase twist induced by the physical rotation of the device creates quantum interference of currents, making rotation sensing possible  5, 6. Furthermore, the atomtronic SQUID  7, 8, an atomtronic  9 analog of a SQUID that uses a Bose–Einstein condensate (BEC), has been developed to explore quantum phenomena of a SQUID with a dilute quantum gas.\n An atomtronic SQUID consists of a toroidal trap and tunneling barriers that act as Josephson junctions. Similar to the conventional SQUID, an atomtronic SQUID can be made with a different number of Josephson junctions for different applications. With a single junction atomtronic SQUID, phase slips  7 and hysteresis  10 have been observed, showing similarity to a radio frequency (RF) SQUID. With a double junction atomtronic SQUID, Josephson effects  8 and resistive flow  11 have been demonstrated, but the quantum interference of currents has not been observed until now.\n Here we report the first observation of quantum interference of currents in an atomtronic SQUID through the measurement of the periodic modulation of the critical current. Analogous to a DC SQUID, the phase twist from external rotation produces periodic modulation of the critical current due to quantum interference. We observe periodic modulation of a critical atom number, which is equivalent to modulation of the critical current, for three different atomtronic SQUID radii that were chosen to demonstrate the variation of the modulation periods. Theoretically, the modulation period is identical to the rotation rate of atoms circulating within the loop with a unit winding number, which may be called the fundamental rotation rate Ω 0  12. The measured modulation periods are consistent with the directly measured Ω 0, confirming that the observed periodic modulation was the result of rotation-induced quantum interference. This realization of a DC atomtronic SQUID makes it possible to create a sensitive and compact rotation sensor. In addition, many intriguing quantum phenomena of the conventional SQUID can be studied with a dilute quantum gas. In particular, the quantum state of currents may be manipulated by controlling the physical rotation, enabling the creation of macroscopic quantum states for many interesting applications, including quantum metrology of rotation sensing  13, 14, 15, 16 and quantum information processing  17.\n The periodic modulation of the critical current can be understood by calculating the total current within a model of the atomtronic SQUID based on quantum phase-controlled Josephson junction currents and a toroidal trap geometry (Fig.  1a). The total current is the result of quantum interference of the two Josephson junction currents, given by\n    where  I c is the critical current of atoms,  I t is the total current, and  I j is the circulating current around the atomtronic SQUID. Because of the toroidal geometry and single valuedness of the wavefunction describing the atoms, the phases should satisfy\n  where  \\(\\omega = \\frac{\\Omega}{{\\Omega}_{0}}\\), with Ω being the rotation rate of atoms, and  n is an integer. The rotation rate of the atoms can be shown to be\n  where  \\({\\omega}_{\\rm{ext}} = \\frac{{\\Omega}_{\\rm{ext}}}{{\\Omega}_{0}}\\), Ω ext is the external rotation rate of the atomtronic SQUID,  \\(\\beta _{{\\mathrm{atom}}} = \\frac{{2\\pi I_{\\rm{c}}}}{{N{\\mathrm{\\Omega }}_0}}\\), and  N is the total number of atoms. This equation for the rotation rate of atoms can be derived from the relation between the circulating current and the movement of atoms relative to the Josephson junctions. The parameter  β atom is analogous to the screening parameter in the conventional SQUID and can be thought as proportional to the inductance, which induces the deviation of the rotation rate of atoms from the imposed external rotation rate of the atomtronic SQUID.\n a Schematic of a double junction atomtronic SQUID. The atomtronic SQUID was created by scanning a single 834 nm laser beam with 1.7 µm waist and the barrier full width at half maximum (FWHM) was 2.1 µm. Ω ext is the rotation rate of the atomtronic SQUID and Ω is the rotation rate of atoms.  ∅ 1 and  ∅ 2 are the phase differences across the Josephson junctions,  I 1 and  I 2 are Josephson junction currents, and  N 1 and  N 2 are numbers of atoms in each half. Arrows represent the movement of the junctions. The calculated potential of the atomtronic SQUID and the density of atoms are shown for the radius of 3.85 µm.  b Critical current as a function of Ω ext/Ω 0 calculated for different values of  β atom.  c Normalized critical currents (2 I c/ N) where  I c is the critical current and  N is the total number of atoms as a function of the number of atoms with different  ω ext for the atomtronic SQUID with 3.85 µm radius.  β atom varies with the number of atoms and the critical current. For each number of atoms,  β atom was calculated to find the variation of the normalized critical current.  d Modulation of the critical atom number as a function of Ω ext/Ω 0 for 3 different normalized bias currents with the 3.85 µm radius atomtronic SQUID.\n Equations ( 1)–( 4) are equivalent to those of a DC SQUID  4, reflecting the fact that the fundamental underlying physics of a double junction atomtronic SQUID and a DC SQUID is the same. In the limit of  β atom = 0 (for example, when  I c ≈ 0 with much higher barrier height), we can analytically calculate the total currents:  I t = 2 I ccos( πω ext)sin( ∅ 1 −  πω ext). Thus the critical current is |2 I ccos( πω ext)|, which establishes a clear modulation of the critical currents with a period of Ω 0. With finite  β atom, we can numerically calculate the critical current, and the periodic modulation amplitude decreases with the increasing  β atom, as can be seen in Fig.  1b.\n By using the calculated modulation in Fig.  1b, the expected periodic modulation of the critical current in an atomtronic SQUID was calculated with the Gross–Pitaevskii equation (GPE)  8, 18 in two dimensions (2D). Figure  1c shows the normalized critical current (see “Methods” for the details on the Josephson effects in an atomtronic SQUID), which is the critical current of atoms normalized to the number of atoms (2 I c/ N), as a function of the number of atoms for the different rotation rates of the atomtronic SQUID. For a fixed number of atoms, the normalized critical current shown in Fig.  1c modulates with rotation rate. However, it is very difficult to experimentally observe this modulation because of the strong dependence of the normalized critical current on the number of atoms and the difficulty in producing a BEC with the same number of atoms consistently. Instead of a fixed number of atoms, we therefore used a fixed normalized bias current, generated by moving Josephson junctions with a fixed speed. When the rotation rate changes, the critical atom number—which is the number of atoms at the transition from DC to alternating current (AC) Josephson effect with the chosen normalized bias current—modulates periodically, as shown in the GPE calculation of Fig.  1d. We chose this modulation of the critical atom number as a way to observe the quantum interference of currents.\n  In the previous work  19, painted potentials (see “Methods” on painted potentials for details), time-averaged potentials generated by scanning laser beams, were used to create various atomtronic circuits  20, and this method was used here to create a double junction atomtronic SQUID, as shown in Fig.  1a. The change in the height, thickness, and location of the barriers in the atomtronic SQUID was controlled by lowering the power of the laser beam at the specific locations during the scanning.\n The  87Rb BEC was created in a double junction atomtronic SQUID with varying rotation rates (see “Methods” on the BEC production for details). Then two junctions were moved to each other to create a normalized bias current of 0.8 s −1 as shown in Fig.  2a, and rotation rates for two junctions were chosen to be Ω ext + 2 πf and Ω ext − 2 πf to make this possible. After this junction movement step, the number of atoms was measured via in situ absorption imaging to determine the normalized population difference  \\(z = \\frac{{N_2 - N_1}}{N}\\) (see Fig.  1a). The change of  z from DC (constant  z due to the tunneling of atoms maintaining same density across the junctions and  N &gt;  N c, where  N c is the critical atom number) to AC (decreasing  z due to the decreasing of the net tunneling of atoms resulting in the density difference across the junctions and  N &lt;  N c) Josephson effect can be seen in Fig.  2b for two different rotation rates of the atomtronic SQUID. To determine the critical atom number, the data were fitted with a piecewise function of a straight line with a slope and a constant with a transition point between the two as a fitting parameter. A clear shift in the critical atom number can be seen for the two different rotation rates, as shown in Fig.  2b. Figure  3a–c shows the change in the measured critical atom number as a function of rotation rates of the atomtronic SQUID for three different radii. All three data sets show clear, periodic modulation. The modulation periods were determined by fitting the data sets to a damped sine function. As mentioned earlier, this modulation may be used to sense rotation. With 4.82-µm radius atomtronic SQUID, from the slope of the modulation curve and atom-shot-noise-limited atom number sensitivity of 50, the sensitivity of 0.1 Hz over 1 min integration time may be achieved. The sensitivity can be improved by increasing the radius  r, as it scales as 1/ r 2. Further improvements can be made by employing entanglement techniques from quantum metrology  21.\n a Movement of Josephson junctions during the experimental observation of quantum interference. The total duration of the junction movement used to create a bias current was 300 ms with a 3 Hz rotation frequency (Ω ext/2 π) and a 0.2 Hz frequency for the bias current generation ( f).  b Variation of  z as a function of the number of atoms for two different rotation frequencies with fitting to determine the critical atom number for the atomtronic SQUID of radius 4.82 µm. The red line shows the best fit with a piecewise function of a constant and a straight line with a slope with the blue line indicating the transition point and critical atom number.\n The error bars in the plots represent the standard error and the numbers inside the brackets represent one standard deviation uncertainty. The uncertainty in the radius of the atomtronic SQUID consists of the systematic uncertainty in the estimation of the radius, which is 3% of the radius and the statistical uncertainty. The radius for  a and  d is 4.82 (0.14) sys (0.01) stat µm, for  b and  e is 3.85 (0.11) sys (0.02) stat µm, for  c and  f is 2.891 (0.084) sys (0.022) stat µm. The modulation periods for  a– c were measured with a damped sine function fitting. The transition point from the 0 to 1 winding number for  d– f was determined with the fitting function  \\(1/(1+e^{-k({\\Omega}_{\\rm{ext}}-\\frac{{\\Omega}_{0}}{2})})\\). Modulation periods (Hz) were found to be 5.99 (0.22), 9.52 (0.48), and 17.99 (0.64) for  a– c, respectively. Ω 0/2 π (Hz) were measured to be 5.70 (0.10), 8.96 (0.12), and 18.11 (0.35) for  d– f, respectively.\n In order to compare Ω 0 with the measured modulation periods, Ω 0 must be directly measured. With a rotating system, minimization of free energy shows that, when  \\(n - \\frac{1}{2} \\,&lt;\\, \\frac{{\\Omega}_{\\rm{ext}}}{{\\Omega}_{0}} \\, &lt; \\, n + \\frac{1}{2}\\), where  n is an integer, the winding number should be equal to  n. Since this transition involves an abrupt change in the winding number from 0 to 1 at  \\({\\Omega}_{\\rm{ext}} = \\frac{{\\Omega}_{0}}{2}\\), determining this transition point is the most accurate way of measuring Ω 0. To measure Ω 0, during the evaporation a single Josephson junction was rotated at a constant rate. After the end of evaporation, absorption images were taken to determine the winding number  22 (see “Methods” on the winding number determination for details). Figure  3d–f shows the results of this measurement for the same three radii that were used previously for the modulation measurement. All plots show a distinct transition of the winding number from 0 to 1, as expected, and Ω 0 was measured from this transition. The measured Ω 0 values are in good agreement with the measured modulation periods, as can be seen from Fig.  3, confirming that the observed periodic modulation is due to quantum interference of currents from the rotation-induced phase twist.\n  Calculating Ω 0 is non-trivial since the width of the wavefunction of atoms is significant compared to the radius of the trap  23. The calculation was performed by minimizing the energy of a BEC in a rotating frame with the GPE in 2D. Figure  4a shows a comparison of the measured and calculated values of Ω 0. The best fit value for the calibration scale for the radius estimation based on the Ω 0 measurement data is 0.96, which lies just outside the one-sigma uncertainty range of calibration scale (0.97 and 1.03). One possible reason for this small shift is the change in the value of Ω 0 from small imperfections in the trap potential. This and other possible mechanisms for the shift may be studied further in the future.\n The error bars in the plots represent the standard error.  a Comparison of the measured and calculated values of Ω 0/2 π (calculation done using GPE). The three curves correspond to calibration scales of the atomtronic SQUID radius.  b– d Critical atom number as a function of the rotation rates obtained with GPE simulation and DC SQUID theory, along with the measured data and the best fit. For  b, the radius is 4.82 µm; for  c, the radius is 3.85 µm; and for  d, the radius is 2.891 µm.\n The modulation waveforms of data sets in Fig.  3 show a few differences compared to the theoretical curve in Fig.  1d. To study these differences in more detail, we performed a dynamic 2D GPE simulation of the experimental sequence for the measurement of the critical atom number. Figure  4b–d shows the comparison for the data sets and DC SQUID theory curves. There is a good agreement in the waveform shape between the GPE simulation and DC SQUID theory. However, there is a constant shift of the critical atom number between these two calculations. We believe that this shift occurs because the dynamics is not completely adiabatic. Thereby, small residual phase fluctuations initiate a transition from the DC to the AC Josephson effect, with the net effect of reducing the critical current, and consequently increasing the critical atom number. With the GPE simulations, there is still a difference compared to the experimental data. The main difference is a decrease in the oscillation amplitude of the second oscillation. This damping-like effect may be caused by static perturbations of the potential and non-rotating thermal atoms. A dedicated study with varying amplitude of the static perturbations and thermal atoms might further elucidate this effect in the future.\n The good agreement between the DC SQUID theory and GPE simulation shows that this system is ideal for realizing various quantum phenomena of the conventional SQUID with a dilute quantum gas. For example, the atomtronic SQUID offers the possibility to study macroscopic quantum effects by utilizing its ability to detect various many body states with high resolution and sensitivity  24. With this unique capability, it may be possible to simulate and study many quantum phenomena of the conventional SQUID to solve various urgent open questions regarding the nature of macroscopic quantum states  25. The other promising direction lies in creating macroscopic superpositions of distinct angular momentum states. These states may be used for quantum metrology of rotation sensing, quantum information processing, and a possible test of macroscopic realism, along with the Leggett–Garg inequality  26.\n In the previous work  8, Josephson effects were demonstrated with an atomtronic SQUID by measuring the critical current through the comparison with the bias current. It was shown that the normalized current defined as  \\(\\dot z = 2I/N\\), where  I is the current of the atoms , N is the total number of atoms, and  \\(z = \\frac{{N_2 - N_1}}{N}\\) is the normalized population difference, is a useful way to describe the Josephson effect  18 of an atomtronic SQUID. By moving two junctions close to each other with a rotation frequency  f, a bias current can be induced. The normalized bias current can be calculated to be  \\(\\dot z_0 = 4f\\), where  z 0 is the equilibrium normalized population difference for equal chemical potential and density of atoms. The Josephson effect is in a DC regime when  \\(\\dot z_{\\rm{c}} \\, &gt; \\, \\dot z_0\\) and in an AC regime when  \\(\\dot z_{\\rm{c}} \\, &lt; \\, \\dot z_0\\), where  \\(\\dot z_{\\rm{c}}\\) is the normalized critical current and there is an atom density difference between two regions of the atomtronic SQUID in the AC regime.\n  Painted potentials are time-averaged optical potentials from fast scanning laser beams  19. Two painting beams were used for this experiment. One was a vertical painting beam with a wavelength of 834 nm and waist of 1.7 µm, and the other was a horizontal painting beam with a wavelength of 1064 nm and waist of 12 µm. The painting frequency was 15 kHz for the vertical beam and 33 kHz for the horizontal beam. The vertical beam painted the atomtronic SQUID with a trap depth of 82 nK, a barrier full width at half maximum of 2.1 µm, a barrier height of 42 nK, a radial trap frequency of 520 Hz, and a radius varying from 2.89 to 4.82 µm. The horizontal beam painted a line to create a flat potential to trap atoms against gravity. This created a box-shaped horizontal trap. This horizontal beam also creates a vertical trap. The width of this trap was 39 µm with a trap depth of 1.3 µK and a vertical trap frequency of 297 Hz. The painting was performed using an acousto-optic modulator (AOM) by modulating the frequency and amplitude of the input to the AOM using arbitrary waveform generators.\n  The  87Rb atoms from a magneto optical trap were transferred to the quadrupole magnetic trap. RF evaporation cooling w\n......", "posttime": "2020-07-21 08:40:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "量子,interference,原子", "title": "原子化鱿鱼中电流的量子干涉", "title_en": "Quantum interference of currents in an atomtronic SQUID", "transed": 1, "url": "https://www.nature.com/articles/s41467-020-17185-6", "via": "", "real_tags": ["量子", "原子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国证券交易委员会(SEC)今天指控一家总部位于加利福尼亚州山景城的科技初创公司及其首席执行官通过对公司财务和收入来源做出虚假和误导性的陈述来欺骗投资者。\nSEC的起诉书称，从2018年到2019年，私营公司YouPlus的创始人兼首席执行官肖卡特·沙米姆(Shaukat Shamim)从投资者那里筹集资金，同时多次歪曲公司的财务状况。YouPlus是一家私营公司，据称开发了一款分析互联网视频的机器学习工具。根据起诉书，沙米姆虚假地告诉投资者，YouPlus的年收入高达数百万美元，拥有100多个客户，其中包括财富500强公司。当一名投资者向Shamim施压，要求他提供证实这些说法的信息时，Shamim涉嫌向投资者提供伪造的银行对账单，以掩盖欺诈行为。该骗局据称在2019年末破灭，当时Shamim向某些投资者承认，YouPlus从2013年成立以来实际上赚了不到50万美元，而且只获得了4名付费客户。\n“正如我们在诉状中指控的那样，Shamim和YouPlus通过提供有关该公司财务表现和客户基础的虚假信息来鼓动人们对该公司的兴趣，”SEC旧金山地区办公室主任Erin E.Schneider说，“从事早期融资的私人公司在向投资者出售证券时必须说出真相.”\n证券交易委员会向美国加利福尼亚州北区地区法院提起诉讼，指控YouPlus和Shamim违反联邦证券法的反欺诈条款，并寻求永久禁令、民事罚款、带判决前利息返还以及针对Shamim的高级管理人员兼董事律师资格。\n在一个平行的行动中，美国加利福尼亚州北区检察官办公室今天宣布对Shamim提出刑事指控。\nSEC的调查仍在继续，目前正由Mike Foley和Rebecca Lubens进行，旧金山地区办事处的Tracy L.Davis和Monique C.Winkler负责监督，针对YouPlus和Shamim的诉讼将由John han和Brent Smyth牵头，但SEC感谢美国加州北区检察官办公室和联邦调查局的协助。", "note_en": "The Securities and Exchange Commission today charged a Mountain View, California-based technology start-up and its chief executive officer with defrauding investors by making false and misleading statements about the company’s finances and sources of revenue.\n The SEC’s complaint alleges that from 2018 to 2019, Shaukat Shamim, the founder and CEO of YouPlus, a private company that purported to have developed a machine-learning tool to analyze videos on the internet, raised funds from investors while repeatedly misrepresenting the company’s financial condition.  According to the complaint, Shamim falsely told investors that YouPlus earned millions of dollars in annual revenue and had more than 100 customers, including Fortune 500 companies.  When one investor pressed Shamim for information substantiating those claims, Shamim allegedly provided the investor with falsified bank statements in an effort to conceal the fraud.  The scheme allegedly unraveled in late 2019 when Shamim confessed to certain investors that YouPlus had in fact earned less than $500,000 and obtained only four paying customers from the company’s inception in 2013.\n “As we allege in our complaint, Shamim and YouPlus drummed up interest in the company by providing false information about its financial performance and customer base,” said Erin E. Schneider, Director of the SEC’s San Francisco Regional Office.  “Private companies engaged in early-stage fundraising must tell the truth when selling securities to investors.”\n The SEC’s complaint, filed in the U.S. District Court for the Northern District of California, charges YouPlus and Shamim with violating the antifraud provisions of the federal securities laws and seeks permanent injunctions, civil money penalties, disgorgement with prejudgment interest, and an officer-and-director bar against Shamim.\n In a parallel action, the U.S. Attorney’s Office for the Northern District of California today announced criminal charges against Shamim.\n The SEC’s investigation, which is continuing, is being conducted by Mike Foley and Rebecca Lubens, and supervised by Tracy L. Davis and Monique C. Winkler of the San Francisco Regional Office.  The litigation against YouPlus and Shamim will be led by John Han and Brent Smyth.  The SEC appreciates the assistance of the U.S. Attorney’s Office for the Northern District of California and the Federal Bureau of Investigation.", "posttime": "2020-07-21 08:40:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "指控,charges,shamim", "title": "SEC指控YouPlus和CEO欺诈投资者", "title_en": "SEC charges YouPlus and CEO with defrauding investors", "transed": 1, "url": "https://www.sec.gov/news/press-release/2020-160", "via": "", "real_tags": ["指控", "charges", "shamim"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013166, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenAI最近为GTP-3开放了测试版，正如每个正在测试它的人所说的那样，它“好得令人震惊”。不幸的是，我们大多数非科技名人无法访问API。我们看到的是人们在任何可以想象到的事情上使用它的截图。但我找到了一种解决办法。\nAI地下城是一款基于文本的交互式角色扮演游戏。它已经活跃了一年，使用较旧的GTP-2作为基础，但现在你可以每月支付10美元来访问“龙”-他们用GTP-3建造的高级人工智能。人工智能地下城与使用普通的GTP-3API并不完全一样-它有多层假设，这有助于它作为一款角色扮演游戏变得更好-但它仍然使用相同的基础技术。通过做一些黑客操作，AI地下城可以做一些非常不可思议的事情。\n我首先使用“定制”游戏设置来创建场景，比如创建海军拉维坎特和唐纳德·特朗普风格的推文，“暮光之城”剧集的标题和描述，以及马尔科姆·格拉德威尔(Malcolm Gladwell)的书籍描述。要让人工智能做一些它不想做的事情需要做一些工作，但这是可能的。\n然后我发现了一种方法来构建“场景”，并给人工智能特定的知识在这些场景中工作。我构建了一个更符合AI地下城设计目标的场景：角色扮演场景。只是我的角色扮演场景不是巫师与龙搏斗。在我设计的场景中，你扮演一家直接面向消费者的公司的首席营销官，与一名营销顾问会面，为你的品牌解决特定的挑战。该场景允许您决定(1)产品是什么，(2)您的目标受众是什么，以及(3)您希望与顾问合作解决什么问题。然后，您就可以自由地“角色扮演”解决问题并向顾问寻求帮助(基于人工智能顾问已经“完成”的广泛研究)。\n你可以在这里自己玩这个场景(注意：除非你每月支付10美元，否则你将玩GTP-2，这远没有那么有趣)。\n下面是我通过自己演绎的第一个场景的全文。有几次我不得不编辑掉顾问的一两条评论，但通常我只是让它运行，并作为CMO与它互动(我提出问题的部分应该非常明显，但有时AI会问我问题，我只是让它跟着运行)。\n下面是讨论内容。前三个粗体部分是我为此特定练习选择的参数。我在玩的时候大笑了几次。\n你是一家新成立的DTC公司的首席营销官。贵公司通过互联网直接向消费者销售椅子。您的目标受众是在家工作的人。你已经得到了一位营销顾问的服务，他已经对你的目标受众、你的竞争对手和你的产品类别进行了广泛的研究。顾问到了你们的办公室，你们都进入了董事会会议室。咨询师会问你今天想关注什么。你告诉她想出一个新的品牌名称。她看着你，开始问问题。\n[这就是我接手我的角色的地方-任何时候你看到&gt；-那就是我]。\n你说“人们坐下来用椅子。这就是它被称为椅子的原因。“。[这是人工智能把话塞进我嘴里]。\n你说“每个人坐下来的时候屁股都会感觉舒服”。[人工智能]。\n&gt；你说“它既非常舒适，又非常耐力--类似于售价10倍的椅子。它仍然比“便宜”的椅子贵得多，但这个价位的质量是无与伦比的。“。\n她点点头，又做了几个笔记。你看到她旁边有一堆文件。她说她已经想出了4个不同的名字供你选择。\n&gt；您会说“太好了。你能告诉我你想出的四个名字吗？“。\n&gt；你说“不错。你能告诉我你为什么选择那些名字吗？“。\n“质量创新”，因为我们是一家希望改进别人设定的标准的公司。\n“对你的背部更好”，因为我们卖的椅子可以改善你的背部。\n“舒适设计”顾名思义。你注意到她在这之后做了更多的笔记。\n她停顿了一下，想了一会儿。她说，她不确定，因为所有这些都有利有弊。她开始解释她的思维过程。她以#1“Versa”开头，然后顺着名单往下走。\n对于人们来说，“舒适设计”可能会让人感到有点困惑，而且这个名字并没有真正暗示任何关于产品的信息。\n&gt；你说“所以听起来你最喜欢”Versa“？”\n她回答说，这有点不清楚，但她认为“Versa”是赢家，即使只是以微弱的优势。\n她想了一会儿，回答说没有什么问题。\n&gt；你说“比方说我们选择了”Versa“，那么，三年后我们会后悔使用这个名字。你觉得为什么会这样呢？“\n她回答说，这个名字不太容易拼写或说出来，有些人可能不喜欢。她想了一会儿说，“但这些绝对不是交易的破坏者。”\n她想了一会儿，说她喜欢“Versa”，不想开始改变。她建议你保持原样，因为它看起来和听起来都不错。\n&gt；你说：“听起来你把Versa逼得很紧。其他的名字是不是就是“错误的选择”？“。\n她笑了。“不，不，我真的很喜欢这个名字，”她回答说。“它令人难忘，在保持优雅的同时脱颖而出。”你们彼此对视片刻。\n&gt；你说：“你能给我们几个类似于Versa的名字，我们可以从中选择吗？”\n“是的，”她回答说，“我可以做到。”你告诉她你对类似于“Versa”的名字感兴趣，看她是否能想出一些其他的选择。她回答说，她可以在大约10分钟内做到这一点，然后带着一些选择回来。十分钟后，她带着她的单子回来了：\n顶点-暗示一个山峰或山顶，对于试图销售电梯或攀岩设备的公司来说，这可能是一个非常好的联想。\nVertas-这是“Vertex”的动词形式。它的声音也很好听。\n北极星-这是北极星的名字。我喜欢这个名字的原因是它意味着领导和指导。\n&gt；您会说“谢谢您的帮助。既然我们不卖电梯，也不卖攀岩设备，为什么要用Vertex这样的名字来称呼椅子呢？“。\n“因为听起来很酷，”她回答说。“你知道椅子不会让你发财的，对吧？”\n“不是所有的都是这样，但我们卖的那些是这样的。”你回答说椅子只是业务的一小部分。\n她回答说，她意识到了这一点，但“Vertex”这个名字与品牌“onit”搭配起来听起来不错。\n&gt；您说“onit”是从哪里来的？我有点喜欢它作为椅子的名字。“。\n她回答说，她是根据历史上最畅销的办公椅的品牌名称“One”创造的。“One”是历史上最畅销的办公椅的品牌名称。\n&gt；你说“那么现在有没有一把椅子叫”onit“？”\n她回答说，有一些椅子叫做“One”，但没有一把椅子上有“onit”这个词。她补充说，“onit”听起来像“联合”这个词的过去式，这正是这把椅子的作用。她还提到，品牌名称“One”和“onit”听起来非常相似。她还提到，大多数人将最畅销的椅子称为“一把椅子”，因此使用“一”这个词可能有助于销售。\n&gt；你会说“但如果已经有一个叫‘One’的椅子，我们不想和他们混淆，对吗？”\n她回答说，由于价格的巨大差异，这两个椅子品牌之间不太可能出现混淆。“One”是一把中档办公椅，“onit”将是一把豪华办公椅。“One”的零售价为399美元，“onit”的零售价为5000美元。\n她回答说，价格还没有确定下来。她补充说，即使“onit”真的卖到1,000美元，在质量上仍然会有巨大的差异。她提到，将“onit”与其他产品区分开来的一件事是它的特殊面料。\n&gt；你说“一致认为我们的座椅比市面上任何一款中档座椅都要好。但如果它被混淆为质量较低的椅子，那可能会有问题。“。\n她提到，在某些方面，“onit”不仅仅是一把办公椅。她说，这真的是一件恰好有四个轮子的家具。\n&gt；你可以这样说作为标语。“ONIT：不仅仅是一把办公椅”\n她回答说这不是标语，这只是关于椅子的一个有趣的事实。她补充说，这把椅子是用1000多个不同的部件制造的，其中很多部件都是手工制造的。\n&gt；您会说“这是真的。那么，你现在是在推动onit还是支持Versa？或者像Vertex或Polaris这样的其他星座之一？“。\n她问所有这些问题的意义是什么。她说她是来回答你们关于“onit”的任何问题的。她说这是市面上最好的办公椅。\n&gt；你说“你是帮助我们开发品牌的品牌顾问，记得吗？”\n她说不能指望她记住每一个细节。她说，她以为你又回到了之前关于价格的谈话。“我们已经覆盖了这一领域，”她说。\n&gt；您说：“我们只是想利用这次会议来提高我们产品的知名度。”\n她说，和你这样做一直很困难，因为你一直在打断她，让她谈不同的话题。“我们能专心点吗？”她问。\n&gt；您回答“是的。同意。让我们把重点放在产品名称上。你给了我们七个选择。你现在最喜欢哪一个？“。\n她说她没有偏爱。“他们都是好名字，”她说。\n&gt；你说“好的。我想我喜欢“Versa”，你的第一个建议。你有没有品牌名称后面的标语清单？“。\n她说，她的笔记本上有一长串标语。“你想听一些吗？”她问。\n“ONIT的高密度聚氨酯泡沫将改变你对泡沫的看法，”她说。\n她说：“坐在扶手椅上，非常舒服，感觉就像被拥抱了一样。”\n“它正在改变人们对办公家具的看法，”她说。\n“你知道吗？它的泡沫可以用水洗。我们看待卫生的方式将会改变，“她说。\n她说：“未来的办公室里会有安乐椅。”\n“你知道onit标志上的橙色应该是未来的颜色吗？”\n&gt；你说“谢谢这些。但是你们有没有叫“Versa”这个名字的呢？“。\n她说她不确定。“你认为onit应该为它的新名字加上一个标签行吗？”她问。\n&gt；您说“我认为我们要使用Versa名称，而不是onit名称。”\n她说你说得有道理。“我们应该保留ONIT品牌吗？它值得保留吗？“。她问。\n她问你为什么要这么做。“难道我们不应该只专注于一个品牌吗？”她问。“或者至少在两者之间选择，”她说。\n&gt；您回答“是的。我们选凡尔萨。我们现在可以在这上面退休了。“。\n“谢谢你的建议，”她说。“你的诚实让你如此讨人喜欢，”她说。\n&gt；您会说“太好了。你能把Versa办公椅的标语念给我听吗？“\n她说她没有写下来。她说：“我会确保在演示之前做到这一点。”\n&gt；你会说“你现在能花几分钟想出几个吗？”\n她说她有一个。“棉花糖的柔软，”她说。\n&gt；您会说“太好了。我们就这么办吧。“Versa椅子：棉花糖的柔软”\n她说她看得出这是一本畅销书。“我现在得走了。我很快就会见到你的。谢谢你的帮助，“她说。她走了，你挥手告别。\n我将继续探索人工智能以及它能为营销做些什么。它不可能比很多顾问更糟糕，而且价格要合理得多！(Versa和onit都是不错的名字！)。如果你想了解更多，请在Twitter上关注我，或者真的不想错过任何东西，我的时事通讯每周二早上都会出版，从“第三条道路”CMO那里潜入最新的营销BS。\n爱德华是华平(Warburg Pincus)的高级顾问，曾在General Assembly和A Place for Ma担任首席营销官。他是Expedia的高管，麦肯锡公司(McKinsey&Amp；Company)的顾问，沃顿商学院(Wharton School)毕业生。", "note_en": "OpenAI has recently opened up beta for  GTP-3, and as everyone who is testing it is saying, it is “ shockingly good”. Unfortunately, most of us non-tech celebrities do not have access to the API. We are left looking at screenshots of people who are using it for everything imaginable. But I found a workaround.\n AI Dungeon is an interactive text-based role playing game. It has been active for a year now using the older GTP-2 as it’s base, but now you can pay $10/month to get access to “Dragon” — their advanced AI that is built with GTP-3. AI Dungeon is NOT exactly like using the normal GTP-3 API — it has layers of assumptions that help make it better as a role playing game — but it is still uses the same base technology. By doing some hacks AI Dungeon can do some very incredible things.\n I first used the “Custom” game setting to create scenarios that would do things like create tweets in the style of  Naval Ravikant and  Donald Trump,  Twilight Zone episode titles and descriptions, and  Malcolm Gladwell book descriptions. It takes a bit of work to get the AI to do something it wasn’t really meant to do, but it IS possible.\n Then I discovered a way to build “Scenarios” and give the AI specific knowledge to work on in those scenarios. I built a scenario more in line with what AI Dungeon is designed to do: A role playing scenario. Only my role playing scenario was not a wizard fighting a dragon. In the scenario I built you play a CMO of a direct to consumer company in a meeting with a marketing consultant working through a specific challenge for your brand. The scenario lets you decide (1) what the product is, (2) what your target audience is, and (3) what problem you want to work on with the consultant. Then you are set loose to “role play” the problem solving and ask the consultant for help (based on the extensive research the AI consultant has already “done”).\n You can play through the scenario yourself here (note: Unless you pay the $10/month you will be playing with GTP-2, which is far less interesting).\n Below is the full text from the first scenario I played through myself. There were a couple of times when I had to edit out a comment or two from the consultants, but generally I just let it run and interacted with it as the CMO (the parts where I asked questions should be pretty obvious, but sometimes the AI would ask questions for me, and I just let it run with it).\n Here is the discussion. The first three  bold parts are the parameters I selected for this particular exercise. I laughed out loud a couple of times while playing.\n  You are the chief marketing officer of a new DTC start-up. Your company sells  Chairs over the internet directly to consumers. Your target audience is  People working from home. You have obtained the services of a marketing consultant who has already done extensive research on your target audience, your competitors and your product category. The consultant arrives at your office and you all enter the board room. The consultant asks what you want to focus on today. You tell her  Come up with a new brand name. She looks at you and begins to ask questions.\n    [This is where I take over in my role — anytime you see &gt; — that is me]\n   You say “People sit down to use a chair. That is why it is called a chair.” [this was the AI putting words in my mouth]\n    You say “Everyone’s butt feels comfortable when they sit down”. [AI]\n    &gt; You say “It is both extremely comfortable and extremely ergometric — similar to chairs that would cost 10x the price. It is still a lot more expensive than “cheap” chairs but there is nothing like the quality at this price point. “\n    She nods her head and makes a few more notes. You see a stack of papers to the side of her. She says that she has come up with 4 different names for you to choose from.\n &gt; You say “Great. Can you tell me the four names you came up with?”\n   &gt; You say “Not bad. Can you tell me why you chose those names? “\n  “Quality Innovations” because we are a company that looks to improve upon the standards set by others.\n “Better For Your Back” because we sell chairs that will better your back.\n “Comfort Design” as the name implies. You notice that she takes more notes after this.\n  She pauses and thinks for a moment. She says that she is not sure because there are pros and cons to all of them. She begins to explain her thought process. She begins with #1 “Versa” and goes down the list.\n “Comfort Design” might be a little confusing for people to remember and the name doesn’t really imply anything about the product.\n &gt; You say “So it sounds like you like “Versa” best?”\n She replies that it is a little unclear but she thinks that “Versa” is the winner, if only by a slim margin.\n  She thinks for a moment and replies that there isn’t anything wrong with it.\n &gt; You say “Let’s say we choose “Versa”, then, three years from now we regret using that name. Why do you think that would be?”\n She replies that the name isn’t super easy to spell or say and that some may not like it. She thinks for a moment and says, “but those are not deal breakers by any means.”\n  She thinks for a moment and says that she likes “Versa” and does not want to start changing things up. She recommends that you keep it as is because it looks and sounds good.\n &gt; You say “It sounds like you are pushing Versa on us pretty hard. Were the other names just there as “false choices”?”\n She smiles. “No, no I really like the name,” she replies. “It is memorable and stands out while still being classy.” You look at each other for a moment.\n &gt; You say “Could you give us a few other names similar to Versa we could choose from?”\n “Yes,” she replies, “I can do that.” You tell her that you are interested in names similar to “Versa” and see if she can come up with some other options. She replies that she can do that in about ten minutes and comes back with some options. Ten minutes later she returns with her list:\n Vertex — implies a peak or mountain top which could be a very good association for a company trying to sell elevators or climbing equipment.\n Vertas — This is the verb form of “Vertex”. It also has a nice sound to it.\n Polaris — This is the name for the North Star. The reason I like this name is that it implies leadership and guidance.\n &gt; You say “Thank you for your help. Since we are not selling elevators or climbing equipment, why would we use a name like Vertex for a chair?”\n “Because it sounds cool,” she replies. “You are aware that chairs don’t make you rich, right?”\n “Not all of them do, but the ones we sell do.” You reply that the chairs are just a small part of the business.\n She replies that she realizes that, but the name “Vertex” sounds good when paired with the brand “Onit”.\n &gt; You say “Where did “Onit” come from? I kind of like it for the name of a chair.”\n She replies that she created it based on the name “One”, which is the brand name of the best-selling office chair in history.\n &gt; You say “So is there already a chair out there called “Onit”?”\n She replies that there are chairs that are called “One” but none with the word “Onit” in them. She adds that “Onit” sounds like the past tense of the word “to unite”, which is exactly what this chair does. She also mentions that the brand name “One” and the brand name “Onit” sound very similar. She also mentions that most people refer to the best-selling chair as “the one chair”, so using the word “One” might help sales.\n &gt; You say “But if there is already a chair called “One”, we wouldn’t want to be confused with them, would we?”\n She replies that it’s unlikely that there will ever be confusion between the two chair brands because of the vast difference in price. “One” is a mid-range office chair and “Onit” will be a luxury office chair. “One” retails for $399 and “Onit” will sell for $5,000.\n  She replies that the price is not set in stone yet. She adds that even if “Onit” does sell for $1000, there will still be a vast difference in quality. She mentions that one of the things that will set “Onit” apart from the rest is its special fabric.\n &gt; You say “Agreed that our chair is better than any mid-range chair out there. But that might be a problem if it is confused for a lower-quality chair.”\n She mentions that in some ways “Onit” is not just an office chair. She says it’s really a piece of furniture that just happens to have four wheels.\n &gt; You say “ Like that for a tag line. “Onit: Not just an office chair”\n She replies that it’s not a tag line, it’s just an interesting fact about the chair. She adds that the chair is built using over 1000 different parts, and a lot of these parts are made by hand.\n &gt; You say “That is true. So are you now pushing for Onit or for Versa? Or for one of the others like Vertex or Polaris?”\n She asks what is the point of all these questions. She says she is here to answer any questions you have about “Onit”. She says this is the best office chair on the market.\n &gt; You say “You are the brand consultant helping us develop a brand name, remember?”\n She says that she can’t be expected to remember every detail. She says she thought you had gone back to the previous conversation about price. “We have covered that ground,” she says.\n &gt; You say “We just want to use this session to develop the name of our product.”\n She says that it has been difficult to do that with you because you keep interrupting her to go off on different tangents. “Can we please focus?” she asks.\n &gt; You say “Yes. Agreed. Lets focus on the product name. You have given us seven options. Which is your favorite now?”\n She says that she doesn’t have a preference. “They are all good names,” she says.\n &gt; You say “Okay. I think I like “Versa”, your first suggestion. Do you have a list of tag lines to go after the brand name?”\n She says she has a long list of tag lines she has been keeping in her notebook. “Would you like to hear some?” she asks.\n  “Onit’s high-density polyurethane foam will change the way you think about foam,” she says.\n “Onit armchairs, so comfortable that you feel like you are being hugged,” she says.\n “Onit is changing the way that office furniture is thought about,” she says.\n “Did you know that Onit’s foam can be washed with water? The way that we think about hygiene will change,” she says.\n “The office of the future will have Onit chairs in it,” she says.\n “Did you know that the orange in Onit’s logo is supposed to be the color of the future?”\n &gt; You say “Thanks for those. But do you have any for the “Versa” name?”\n She says she is not sure. “Do you think that Onit should add a tag line to go along with it’s new name?” she asks.\n &gt; You say “I think we want to use the Versa name, not the Onit name.”\n She says that you have a point. “Should we keep the Onit brand? Is it worth keeping?” she asks.\n  She asks why you would want to do that. “Shouldn’t we focus on just one brand?” she asks. “Or at least pick between the two,” she says.\n &gt; You say “Yes. We pick Versa. We can retire Onit for now.”\n “Thanks for your advice,” she says. “Your honesty is what makes you so likeable,” she says.\n &gt; You say “Great. Can you read me your taglines for Versa office chairs?”\n She says that she does not have any written down. “I will make sure to do that before the presentation,” she says.\n &gt; You say “Can you spend a few minutes now coming up with a few?”\n She says that she has one. “The softness of a marshmallow,” she says.\n &gt; You say “Great. Let’s go with that. “Versa Chairs: The Softness of a marshmallow”\n She says that she can see that being a best-seller. “I have to go now. I will see you soon. Thanks for your help,” she says. She leaves, and you wave goodbye.\n  I am going to continue to explore the AI and what it can do for marketing. It can’t be worse than a lot of consultants out there, and the price is a lot more reasonable! (Versa and Onit are not bad names!) If you want more of this, please follow me on  twitter, or to really not miss anything,  my newsletter comes out every Tuesday morning diving into the latest marketing BS from a  “Third Way” CMO.\n   Edward is a senior advisor at Warburg Pincus and former CMO at General Assembly and A Place For Mom. He was an executive at Expedia, a consultant at McKinsey &amp; Company and a graduate of the Wharton School.", "posttime": "2020-07-21 08:39:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ai,dungeon,椅子", "title": "使用AI地下城访问GTP-3(和预建场景)", "title_en": "Using AI Dungeon to get access to GTP-3 (and pre-built scenario)", "transed": 1, "url": "https://medium.com/@ednever/using-aidungeon-as-an-advanced-ai-marketing-consultant-68a2aaaf4505", "via": "", "real_tags": ["ai", "dungeon", "椅子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013165, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LibreWolf总是基于最新的Firefox稳定源代码构建，以获得最新的安全性和功能以及稳定性。", "note_en": "LibreWolf is always built from the latest Firefox stable source, for up-to-date security and features along with stability.", "posttime": "2020-07-21 08:39:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,librewolf,fork,构建", "title": "LibreWolf-Firefox的一个分支，专注于隐私、安全和自由", "title_en": "LibreWolf – A fork of Firefox, focused on privacy, security and freedom", "transed": 1, "url": "https://librewolf-community.gitlab.io/", "via": "", "real_tags": ["firefox", "librewolf", "fork", "构建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013163, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下周没有时事通讯运行TLA+研讨会。在那之后我就不会有任何脑力了。语法突出显示是对信息通道的浪费...", "note_en": "No newsletter next week Running the TLA+ workshop. No way I'm gonna have any brainpower after that. Syntax highlighting is a waste of an information channel...", "posttime": "2020-07-21 08:38:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "突出,highlighting", "title": "语法突出显示是对信息通道的浪费", "title_en": "Syntax highlighting is a waste of an information channel", "transed": 1, "url": "https://buttondown.email/hillelwayne/archive/syntax-highlighting-is-a-waste-of-an-information/", "via": "", "real_tags": ["突出"]}, {"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1013162, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“纽约时报”(New York Times)周末发布的一条迷你纵横字谜线索是基于这样一个概念，即“Enter”只是Return键的同义词。不是这样的。它们是两个不同的关键点，通常执行相同的操作，但不总是。\n所有的键盘都有一个专用的Return键， - ，它是您想要的位于右Shift键上方的大键。在mac上，按Return键时的键码是36，键的字形是↵。\n专用Enter键通常只出现在带有数字小键盘 - 的扩展键盘上，它是右下角的键，通常是键盘上唯一垂直方向(而不是水平方向)较大的超大键。它的mac密钥码是76，字形是⌅。看看这样一个键盘：Return键说“Return”，Enter键说“Enter”。\n如果您的键盘没有专用的Enter键，您可以通过按Fn-Return键来键入Enter键。这就是为什么有些回车键在“回车”一词的上方用小字体打印了“回车”。如果您的键盘既没有专用的Enter键，也没有Fn修饰键，我认为您不能键入Enter。\n在Tweetbot for Mac中，当您编辑tweetbot时，Return将插入换行符；Enter将立即发送tweet。\n在脚本编辑器和脚本调试器中，Return将插入换行符，但Enter将编译脚本。\n在BBEdit shell工作表中，Return插入换行符，但Enter将执行当前行。\n在某些电子表格(而不是数字)中，Return将确认您正在编辑的单元格的内容，并将所选内容移动到下一行；Enter将只确认当前单元格的内容。\n一般来说，当它们不同时，Return只是键入换行符的键(在经典的Mac OS上，它实际上是一个回车字符，但在这里我们不再赘述)，而Enter则输入您已经键入的内容，而不添加新行。1个。\n在甚至连Return键都意味着“Send this”的上下文中，这在Messages和Sack等聊天类型的应用程序中很常见，您可以使用Option-Return插入换行符。-↩︎", "note_en": "A New York Times mini crossword clue over the weekend  was based on the notion that “Enter” is just a synonym for the Return key. It’s not. They’re two different keys that usually perform the same action, but not always.\n All keyboards have a dedicated Return key — it’s the big key you’re thinking of above the right Shift key. On a Mac, the  key code when you press Return is 36, and the glyph for the key is ↵.\n A dedicated Enter key is generally only present on extended keyboards with a numeric keypad — it’s the key in the lower-right corner and is generally the only oversized key on the keyboard that is larger vertically, not horizontally. Its Mac key code is 76 and its glyph is ⌅.  Just look at such a keyboard: the Return key says “Return”, and the Enter key says “Enter”.\n If your keyboard doesn’t have a dedicated Enter key, you can type the Enter key by pressing Fn-Return. That’s why some Return keys have “Enter” printed in small type above the word “Return”. If your keyboard has neither a dedicated Enter key nor an Fn modifier key, I don’t think you can type Enter.\n  In Tweetbot for Mac, when you’re editing a tweet, Return will insert a newline character; Enter will immediately send the tweet.\n In Script Editor and  Script Debugger, Return inserts a newline, but Enter will compile the script.\n In a  BBEdit shell worksheet, Return inserts a newline, but Enter will execute the current line.\n In some spreadsheets (but not Numbers), Return will confirm the contents of the cell you’re editing and move the selection to the next row; Enter will just confirm the contents of the current cell.\n As a general rule, when they differ, Return is simply the key for typing a newline character (which, on classic Mac OS, was literally a return character, but let’s not get into that here), whereas Enter  enters what you’ve already typed without adding a new line.  1\n In contexts where even the Return key means “send this”, common in chat-type apps such as Messages and Slack, you can use Option-Return to insert a newline character.  ↩︎", "posttime": "2020-07-21 08:33:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "return,enter", "title": "Return和Enter是两个不同的键", "title_en": "Return and Enter Are two different keys", "transed": 1, "url": "https://daringfireball.net/2020/07/return_and_enter", "via": "", "real_tags": ["return", "enter"]}, {"category": "", "categoryclass": "", "imagename": "b231ff3ca42a068f5116e1d9960362a6.jpeg", "infoid": 1013161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HSE首席信息官弗兰·汤普森(Fran Thompson)说：“我们很高兴向Linux Foundation Public Health捐赠爱尔兰Covid Tracker应用程序背后的开源Covid Green。”他说：“这款应用程序很好地展示了爱尔兰卫生部门的创新与爱尔兰软件行业的IT能力相结合。我们为与NearForm合作应对这场流行病所做的工作感到无比自豪。我们期待着通过Linux基金会公共卫生与世界各地的其他公共卫生当局合作，帮助他们迅速复制我们的方法，同时学习他们的经验。“", "note_en": "“We are pleased to contribute Covid Green, the open source code behind Ireland’s Covid Tracker app, to Linux Foundation Public Health,” said  Fran Thompson, chief information Officer of the HSE. “This app is a great demonstration of innovation within the Irish health sector combined with the IT capabilities of the Irish software industry. We’re immensely proud of the work we’ve undertaken in partnership with NearForm in responding to the pandemic. We are looking forward to collaborating with other public health authorities around the world via Linux Foundation Public Health to assist them in quickly replicating our approach while learning from their experiences.”", "posttime": "2020-07-21 08:12:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,肺炎,爱尔兰", "title": "爱尔兰政府向Linux基金会捐赠成功的新冠肺炎APP", "title_en": "Irish government donate successful COVID-19 app to the Linux Foundation", "transed": 1, "url": "https://www.irishtimes.com/business/health-pharma/hse-donates-contact-tracing-app-to-public-health-project-1.4308955", "via": "", "real_tags": ["linux", "肺炎", "爱尔兰"]}, {"category": "", "categoryclass": "", "imagename": "fda8a224f45cf238ad85f708a68b8836.png", "infoid": 1013160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Adobe今天宣布，曾利用软件将谷歌Pixel相机打造成强大功能的研究员马克·莱沃伊(Marc Levoy)已加入Adobe，共同开发一款通用相机应用程序。\nLevoy领导的团队开发了谷歌Pixel智能手机中使用的令人印象深刻的计算摄影技术，包括夜视、肖像模式和HDR+等功能。他的工作还帮助Pixels拍摄了很棒的照片，而不需要像竞争对手的手机那样需要那么多硬件-众所周知，Pixel系列只需要一个摄像头就能与苹果的iPhone竞争，直到对更清晰变焦图像的渴望促使谷歌在去年的Pixel4上增加了第二个长焦镜头。(第一款配备第二个镜头的iPhone是iPhone 7 Plus，于2016年问世。)。\nLevoy的努力可以说激励了苹果、三星和其他公司加强他们的计算摄影印章。\n在Adobe，听起来Levoy可能计划不仅为Pixel用户，而且为任何拥有智能手机的人制造一款很棒的相机。Levoy将致力于整个Adobe的计算摄影计划，有趣的是，他的努力将“以通用相机应用程序的概念为中心”，该公司在一封电子邮件中说。尽管如此，Adobe并不能立即为我们定义“通用相机应用程序”-我们也听说过这个短语指的是Facebook和Snapchat等公司可以用来生产自己的相机应用程序的应用程序平台，或者可以在相机和单反等更大的相机上运行的应用程序。我们希望能缩小范围。\nAdobe已经在Photoshop Camera中提供了相机应用程序，Adobe Lightroom应用程序中也内置了一个相机应用程序，但也许Adobe对其相机应用程序有更宏伟的愿景。Adobe在一封电子邮件中表示，Levoy还将与Photoshop Camera、Adobe Research和Sensei AI团队合作，因此也许Photoshop Camera将成为这些更大努力的重点。Levoy将向Adobe首席技术官Abhay Parasnis汇报工作，他今天开始工作。\nLevoy在谷歌工作了近六年后，于今年3月离开。在全职加入谷歌之前，Levoy在谷歌前Moonshot部门Google X担任客座教师，在价值1500美元的Google Glass Explorer Edition中从事相机工作。2002年，他在斯坦福大学发起了一个由谷歌资助的研究项目，最终成为谷歌地图中的街景。Levoy也是斯坦福大学的一名计算机图形学研究员，他在那里的一些作品帮助世界对光场摄影产生了兴趣。\n更正：第一款配备第二个摄像头的iPhone是iPhone 7 Plus，而不是我们最初所说的iPhone X。我们对这个错误感到抱歉。", "note_en": "Marc Levoy, the researcher who used software to turn Google’s Pixel camera into a powerhouse, has joined Adobe to build a universal camera app, Adobe announced today.\n Levoy headed up the team that developed the impressive computational photography technology used in Google’s Pixel smartphones, including features like  Night Sight, Portrait Mode, and HDR+. His work also helped Pixels take great photos  without requiring as much hardware as competing phones — the Pixel line famously only needed a single camera to stay competitive with Apple’s iPhones, until a desire for sharper zoom images pushed Google to add a second, telephoto lens with last year’s  Pixel 4. (The first iPhone with a second lens,  the iPhone 7 Plus, came out in 2016.)\n Levoy’s efforts arguably inspired Apple, Samsung, and others to beef up their computational photography chops\n At Adobe, it sounds like Levoy could be planning to make a great camera not just for Pixel users, but for anyone with a smartphone. Levoy will be working on computational photography initiatives across Adobe, and intriguingly, his efforts will be “centered on the concept of a universal camera app,” the company said in an email. That said, Adobe wasn’t immediately able to define “universal camera app” for us — we’ve also heard that phrase refer to an app platform that companies like Facebook and Snapchat could use to produce their own camera apps or an app that could work across, say, a cameraphone and a larger camera like a DSLR. We’re hoping to narrow that down.\n Adobe already offers a camera app in  Photoshop Camera, and there’s one built into the  Adobe Lightroom app, too, but perhaps Adobe has a grander vision for its camera apps. And Adobe said in an email that Levoy will also be working with the Photoshop Camera, Adobe Research, and Sensei AI teams, so maybe Photoshop Camera will be the focus for these bigger efforts. Levoy will report to Adobe CTO Abhay Parasnis, and he starts today.\n Levoy left Google  in March after nearly six years at the company. Before he joined Google full time, Levoy  worked on the camera in the  $1,500 Google Glass Explorer Edition as visiting faculty at Google’s former Moonshot division, Google X, and he launched a Google-funded research project at Stanford in 2002 that eventually became Street View in Google Maps. Levoy is also a computer graphics researcher at Stanford, and he  helped get the world interested in light field photography with some of his writing there.\n  Correction : The first iPhone with a second camera lens was the iPhone 7 Plus, not the iPhone X, like we said originally. We regret the error.", "posttime": "2020-07-21 08:11:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,adobe,相机,camera", "title": "Google Pixel相机背后的大脑正在为Adobe构建通用相机应用", "title_en": "The Brain Behind the Google Pixel Camera Is Building a Universal Camera App For Adobe", "transed": 1, "url": "https://www.theverge.com/2020/7/20/21331331/google-pixel-camera-app-lead-adobe-marc-levoy", "via": "", "real_tags": ["google", "adobe", "相机", "camera"]}, {"category": "", "categoryclass": "", "imagename": "e7ca6794b889be507cebb1d8a9859422.jpg", "infoid": 1013159, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卡尔斯鲁厄理工学院KIT能源中心的科学家说，德国地热供暖和电力装置提取的地下水中溶解的锂足够满足该国大多数(如果不是全部)电池制造商的需求。“据我们所知，每升锂的含量可能高达200毫克，”KIT应用地球科学研究所的地球科学家延斯·格里默博士说。“如果我们始终如一地利用这一潜力，我们可以满足德国相当一部分的需求.”", "note_en": "Scientists at the  KIT Energy Center at the Karlsruhe Institute of Technology say  there is enough lithium dissolved in the groundwater extracted by German geothermal heating and electricity installations to meet the needs of most if not all of the battery manufacturers in the country. “As far as we know, there can be up to 200 milligrams per liter,” says geoscientist Dr. Jens Grimmer of  the Institute of Applied Geosciences at KIT. “If we consistently use this potential, we could cover a considerable part of the demand in Germany.”", "posttime": "2020-07-21 08:11:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设施,extracted,科学家", "title": "可以从地热设施的地下水中提取锂。", "title_en": "Lithium Can Be Extracted From Groundwater At Geothermal Installations", "transed": 1, "url": "https://cleantechnica.com/2020/07/19/lithium-can-be-extracted-from-groundwater-at-geothermal-installations/", "via": "", "real_tags": ["设施", "extracted", "科学家"]}, {"category": "", "categoryclass": "", "imagename": "e308d66ed9289575f0ac31722439e90f.png", "infoid": 1013157, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook的Reaction Native团队遵循一些原则，这些原则有助于确定我们在Reaction Native上的工作优先顺序。这些原则具体代表了我们的团队，并不一定代表Reaction原住民社区中的每个利益相关者。我们在这里分享这些原则是为了让我们更透明地了解是什么驱使我们，我们如何做出决定，以及我们如何集中精力。\n对于Reaction Native，我们的首要任务是满足人们对每个平台的期望。这就是为什么将原生呈现反应为平台基元的原因。与跨平台一致性相比，我们更看重原生外观。\n例如，Reaction Native中的TextInput呈现为iOS上的UITextField。这确保了与密码管理器和键盘控件的集成开箱即用。通过使用平台原语，Reaction原生应用程序还能够及时了解新发布的Android和iOS的设计和行为变化。\n为了与本地应用程序的外观和感觉相匹配，我们还必须与它们的性能相匹配。这是我们集中最雄心勃勃的努力的地方。例如，Facebook创建了Hermes，这是一个新的JavaScript引擎，从头开始为Android上的Reaction Native构建。爱马仕显著提高了Reaction Native应用的启动时间。我们还在进行重大的架构更改，以优化线程模型，并使Reaction Native更易于与本机代码进行互操作。\nFacebook应用程序中的数百个屏幕都是用Reaction Native实现的。Facebook的这款应用程序有数十亿人在各种设备上使用。这就是为什么我们投资于规模最具挑战性的问题。\n在我们的应用程序中部署Reaction Native可以让我们识别在较小范围内看不到的问题。例如，Facebook专注于提高从最新款iPhone到许多老款Android设备的各种设备的性能。这一重点为我们的架构项目(如Hermes、Fabric和TurboModules)提供了信息。\n我们已经证明，Reaction Native也可以扩展到大型组织。当数百名开发人员在同一个应用程序上工作时，逐步采用是必须的。这就是为什么我们确保“原生反应”可以一次只采用一个屏幕的原因。很快，我们将更进一步，支持迁移现有原生屏幕的单个原生视图以响应原生。\n专注于大规模意味着我们的团队目前没有致力于很多事情。例如，我们的团队并没有推动业界采用Reaction Native。我们也不会积极地为我们看不到规模的问题构建解决方案。我们感到自豪的是，我们有许多合作伙伴和核心贡献者，他们能够专注于社区的这些重要领域。\n出色的用户体验是以迭代方式创建的。在运行的应用程序中查看代码更改的结果应该只需几秒钟。Reaction Native的架构使其能够在开发过程中提供近乎即时的反馈。\n我们经常从团队那里听到，采用Reaction Native显著提高了他们的开发速度。这些团队发现，开发过程中的即时反馈使他们更容易尝试不同的想法并添加额外的改进，因为他们不必因为每一个小的更改而中断他们的编码过程。当我们对原生反应进行更改时，我们确保保持开发人员体验的这一质量。\n即时反馈并不是Reaction Native提高开发速度的唯一方式。团队可以很容易地利用快速增长的高质量开放源码包生态系统。团队还可以在Android、iOS和Web之间共享业务逻辑。这有助于他们更快地发送更新，并减少平台团队之间的组织孤岛。\n当我们在2014年推出Reaction Native时，我们提出了我们的座右铭“一次学习，随时随地写”--我们指的是任何地方。开发者应该能够接触到尽可能多的人，而不受设备型号或操作系统的限制。\nReaction Native瞄准非常不同的平台，包括移动、台式机、网络、电视、VR、游戏机等。我们希望在每个平台上实现丰富的体验，而不是要求开发人员为最低公分母而构建。要实现这一点，我们将重点放在支持每个平台的独特功能上。这包括从不同的输入机制(如触摸、笔、鼠标)到完全不同的消费体验，如VR中的3D环境。\n这一原则使我们决定用跨平台的C++实现REACTION Native的新核心架构，以促进跨平台的平等性。我们还在改进针对其他平台维护者的公共界面，比如微软的Windows和MacOS。我们努力使任何平台都能支持REPACT Native。\n我们不相信在每个平台上部署完全相同的用户界面，我们相信用相同的声明性编程模型公开每个平台的独特功能。我们声明性编程模型是Reaction。\n根据我们的经验，Reaction普及的单向数据流使应用程序更容易理解。我们更喜欢将屏幕表示为声明性组件的组合，而不是强制托管的视图。Reaction在网络上的成功，以及新的原生Android和iOS框架的发展方向表明，该行业也已经接受了声明式UI。\n反应普及的声明性用户界面。然而，仍然有许多问题没有解决，反应是独特的定位来解决。REACTION Native将继续建立在REACT的创新之上，并保持在声明性用户界面运动的前沿。", "note_en": "The React Native team at Facebook is guided by principles that help determine how we prioritize our work on React Native. These principles represent our team specifically and do not necessarily represent every stakeholder in the React Native community. We are sharing these principles here to be more transparent about what drives us, how we make decisions, and how we focus our efforts.\n  Our top priority for React Native is to  match the expectations people have for each platform. This is why React Native renders to platform primitives. We value native look-and-feel over cross-platform consistency.\n For example, the TextInput in React Native renders to a UITextField on iOS. This ensures that integration with password managers and keyboard controls work out of the box. By using platform primitives, React Native apps are also able to stay up-to-date with design and behavior changes from new releases of Android and iOS.\n In order to match the look-and-feel of native apps, we must also match their performance. This is where we focus our most ambitious efforts. For example, Facebook created Hermes,  a new JavaScript Engine built from scratch for React Native on Android. Hermes significantly improves the start time of React Native apps. We are also working on major architectural changes that optimize the threading model and make React Native easier to interoperate with native code.\n  Hundreds of screens in the Facebook app are implemented with React Native. The Facebook app is used by billions of people on a huge range of devices.  This is why  we invest in the most challenging problems at scale.\n Deploying React Native in our apps lets us identify problems that we wouldn’t see at a smaller scale. For example, Facebook focuses on improving performance across a broad spectrum of devices from the newest iPhone to many older generations of Android devices. This focus informs our architecture projects such as Hermes, Fabric, and TurboModules.\n We have proven that React Native can scale to massive organizations too. When hundreds of developers are working on the same app, gradual adoption is a must. This is why we made sure that React Native can be adopted one screen at a time. Soon, we will be taking this one step further and enable migrating individual native views of an existing native screen to React Native.\n A focus on massive scale means there are many things our team isn’t currently working on. For example, our team doesn’t drive the adoption of React Native in the industry. We also do not actively build solutions for problems that we don’t see at scale. We are proud that we have  many partners and core contributors that are able to focus on those important areas for the community.\n  Great user experiences are created iteratively.  It should only take a few seconds to seeing the result of code changes in a running app. React Native&#39;s architecture enables it to provide near-instant feedback during development.\n We often hear from teams that adopting React Native significantly improved their development velocity. These teams find that the instant feedback during development makes it much easier to try different ideas and add extra polish when they don’t have to interrupt their coding session for every little change. When we make changes to React Native, we make sure to preserve this quality of the developer experience.\n Instant feedback is not the only way that React Native improves developer velocity. Teams can easily leverage the fast-growing ecosystem of high quality open source packages. Teams can also share business logic between Android, iOS, and the web. This helps them ship updates faster and reduce organizational silos between platform teams.\n  When we introduced React Native in 2014, we presented it with our motto “Learn once, write anywhere” — and we mean  anywhere.  Developers should be able to reach as many people as possible without being limited by device model or operating system.\n React Native targets very different platforms including mobile, desktop, web, TV, VR, game consoles, and more. We want to enable rich experiences on each platform instead of requiring developers to build for the lowest common denominator. To accomplish this, we focus on supporting the unique features of each platform. This ranges from varying input mechanisms (e.g. touch, pen, mouse) to fundamentally different consumption experiences like 3D environments in VR.\n This principle informed our decision to implement React Native’s new core architecture in cross-platform C++ to promote parity across platforms. We are also refining the public interface targeted at other platform maintainers like Microsoft with Windows and macOS. We strive to enable any platforms to support React Native.\n  We don’t believe in deploying the exact same user interface on every platform, we believe in  exposing each platform’s unique capabilities with the same declarative programming model. Our declarative programming model is React.\n In our experience, the unidirectional data flow popularized by React makes applications easier to understand. We prefer to express a screen as a composition of declarative components rather than imperatively managed views. React’s success on the web and the direction of the new native Android and iOS frameworks show that the industry has also embraced declarative UI.\n React popularized declarative user interfaces. However, there remain many unsolved problems that React is unique positioned to solve. React Native will continue to build on top of the innovations of React and remain at the forefront of the declarative user interface movement.", "posttime": "2020-07-21 07:57:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "本土,native,reaction", "title": "反应本土团队原则", "title_en": "React Native Team Principles", "transed": 1, "url": "https://reactnative.dev/blog/2020/07/17/react-native-principles", "via": "", "real_tags": ["本土", "native", "reaction"]}, {"category": "", "categoryclass": "", "imagename": "c5652d96496960eb1dcad28668d1fe31.jpg", "infoid": 1013156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约20年前，纯在线视频游戏成为零售业的一支重要力量。你可以期待盒装游戏，从30-60美元不等，完全围绕着对抗死亡比赛竞技场或MMO任务这样的事情展开。显然，在现代个人电脑和游戏机上，这一点已经改变了。\n但是，当2020年的一家游戏发行商试图回到过去，对其中一款游戏收取30美元的费用时，会发生什么呢？付费的纯在线游戏能在现代的免费游戏市场上发挥作用吗？\n我们没有从Rocket Arena得到确凿的答案，EA上周在PC、PS4和Xbox One上发布了售价30美元的火箭竞技场(Rocket Arena)。在这个时代，很可能会有一款全新的游戏能够胜任这项任务，但这一款更像是一个警示故事。\n因为这是Ars Technica，我们必须首先将这款新游戏的名字与流行的、长期运行的同名Mod区分开来。火箭竞技场(Rocket Arena)也是“地震III竞技场”(Quake III Arena)等游戏中有趣的1v1调整的名称，它在比赛开始时为两名玩家提供每一种可能的武器，然后让他们进行高速决斗。显然，这个模型的名字从来没有注册过商标，这款新游戏在Final Strike Games上的开发者在2017年突袭并将其抢走。\n从现在开始，任何提到火箭竞技场的斜体都指的是2020年的新比赛。是的，在点击Publish之前，我必须确保我没有不小心键入火箭联盟(Rocket League)，这是一款大获成功的3v3汽车足球游戏的名称。\n诚然，EA的新游戏更倾向于将标题作为一个概念，因为它几乎完全围绕着火箭发射器作为武器。从10名战斗人员中挑选，每个人都有自己的专用火箭发射器作为主要武器，然后跳到3v3在线战斗中。除了简单的练习模式之外，还有零离线模式可言；如果你想要对抗这个游戏的人工智能，有一个在线选项，可以塞进几个菜单中。\n事情一开始就很尴尬，这要归功于教程对火箭跳跃的关注。对于外行来说，经典的地震游戏围绕着这样一个想法：在脚下发射一枚火箭，把自己炸到更高的跳跃。这种高速机动伴随着伤害权衡：跳得更远，承受爆炸伤害。在火箭竞技场，没有人会伤害自己，这一事实，再加上教程坚持要求你学会爬墙的动作，可能会让你认为整个游戏是一场爆炸到跳跃的运动狂潮。\n问题是，EA游戏与竞技场的对决大多是带有浮动平台的露天战场，而不是旧的走廊排列的地震地图；出于任何战略原因，很少有有机的墙或角落可以让你弹跳。更糟糕的是，你可能希望火箭跳跃会在这些地图上提供有用的速度提升，因为游戏的模式强调移动(这一点我稍后会讲到)。但这些弹跳提供的速度与内置三级跳远机械师相同。所以.。为什么所有的重点都放在火箭跳跃上？\n然而，在游戏试图回答这个问题之前，火箭竞技场用一个看起来直接来自堡垒之夜的界面打了你一巴掌。买新衣服吧！买一张战斗通行证！为你的图腾购买装饰品，这是一面在比赛之间短暂出现的旗帜。火箭竞技场(Rocket Arena)在你已经支付了30美元开始游戏之后，推动你在现实世界中花钱的方式，如果他们不觉得自己是在消费者脸上打了一记耳光，那将是非常滑稽的。\n如果重新设计用户界面以反映游戏中的经济运行方式，EA可能会留下不同的印象。第一次玩游戏的玩家可以通过简单地与10个角色中的每个角色进行一场比赛来积累一吨游戏中的货币，这些钱可以花在某些化妆品解锁上。更重要的是，发布游戏的大部分化妆品选项只能通过游戏获得。一旦你进入游戏，所有的模式都是可用的；没有游戏的门禁在进一步的付款之后。\n也许，仅仅是也许，艺电应该在它的推出阶段取消所有与现实世界金钱的联系，从而迫使玩家探索玩游戏的自然行为是如何导致新的服装和装饰的。在试图榨取我们所有人再多几块钱之前。\n让我们假设艺电以某种方式理顺了关于金钱和受人尊敬的玩家的信息。这里有值得推荐的游戏吗？差不多了。\n火箭竞技场提供了几种对抗模式，所有模式都分解为3v3对决。这些模式中有两个提供了传统版本的团队死亡比赛和山顶之王；两个在夺旗和区域控制方面提供了稍微不寻常的旋转；最后一个是对抗人工智能坏人浪潮的部落模式。(对于RA&#39；的部落模式，没有任何可调整的难度或其他选项，但是，我不能推荐它。)。\n麻烦开始于一个由10个角色组成的演员阵容，他们显然不是设计成在每个模式下都闪耀着光芒。一个例子是Plink，这位青春期的神童可以完全摧毁敌人，这要归功于他默认的迷你火箭的接二连三的攻击，有点像是击中了目标。如果你需要将火箭(这款游戏的旗帜版本)从竞技场的一边移到另一边，他就不够格了，因为他的心灵传送能力不是移动技术选项。但他是一个不平衡的破坏机器，可以在一轮团队死亡比赛中立即扭转局面。在某些模式下毫无价值；在另一些模式下势在必行。\n一个好的英雄射手，当它的职业范围鼓励团队合作和协调，从而使任何团队框架在任何模式下都可行时，才能发挥作用。但是火箭竞技场的机械师们的任务是造成伤害，捡起散落在地图上的临时物品(加速装置、可投掷炸弹)，而不是设置魔法或区域控制增强等东西。在10名战斗人员中，只有两名有能力召唤任何类型的盾牌，而且只有一种盾牌能减缓敌人在特定区域的攻击，从而使队友受益。(火箭竞技场掩盖了这个问题，部分原因是不允许玩家在比赛前或比赛期间点击单个按钮来审查角色能力。)。\n在发布时，我只成功地使用了那些增加伤害的角色，比如Plink和不需要重新加载的海盗Blastbeard，以及为了基于目标的模式而超快的角色Rev。我在尝试能力较弱的伤害处理选项时毫无乐趣。", "note_en": "Roughly 20 years ago, online-only video games became a significant force in retail. You could expect boxed games, ranging from $30-60, to revolve entirely around things like versus-deathmatch arenas or MMO quests. That, obviously, has changed on modern PCs and consoles.\n But what happens when a game publisher in 2020 tries to go back in time and charge $30 for one of these things? Can a paid, online-only game work in the modern, free-to-play marketplace?\n We don&#39;t get a conclusive answer from   Rocket Arena, which EA released last week on PC, PS4, and Xbox One  for $30. There may very well be a brand-new game in this era that&#39;s up to the task, but this one is more of a cautionary tale.\n   Because this is Ars Technica, we must start by differentiating this new game&#39;s name from the popular, long-running mod of the same name. &#34;Rocket Arena&#34; is also the name of  a fun 1v1 tweak for games like  Quake III Arena that gives two players every possible weapon at the start of a match, then places them in a high-speed duel. Apparently, that mod&#39;s name was never trademarked, and this new game&#39;s developers at Final Strike Games swooped in to nab it in 2017.\n From here on out, any italicized mention of  Rocket Arena refers to the new 2020 game. And, yes, before hitting &#34;publish,&#34; I had to make sure I didn&#39;t accidentally type   Rocket League, the name of a wildly successful 3v3 car-soccer game.\n EA&#39;s new game, admittedly, leans more into the title as a concept, because it revolves almost entirely around rocket launchers as weapons. Pick from 10 combatants, each with their own specialized rocket launcher as a primary weapon, and jump into 3v3 online battles. There&#39;s zero offline mode to speak of beyond a simplistic practice mode; if you want to fight the game&#39;s AI, there&#39;s an online option, tucked into a few menus.\n Things begin awkwardly thanks to the tutorial&#39;s focus on &#34;rocket jumping.&#34; For the uninitiated, classic   Quake games revolve around the idea of blasting yourself to a higher jump by launching a rocket at your feet. This high-speed maneuver comes with a damage tradeoff: jump farther, take blast damage. In  Rocket Arena, nobody can hurt themselves, and this fact, coupled with the tutorial&#39;s insistence that you learn the move to climb up walls, might make you think the whole game is a blast-to-jump movement frenzy.\n Trouble is, the EA game&#39;s versus arenas are mostly open-air battlegrounds with floating platforms, not corridor-lined  Quake maps of old; there&#39;s rarely an organic wall or corner to bounce yourself off of for any strategic reason. Worse, you might hope that a rocket jump would offer a useful speed boost across these maps, since the game&#39;s modes emphasize movement (which I&#39;ll get to). But these bounces offer the same speed as the built-in &#34;triple jump&#34; mechanic. So... why all that emphasis on rocket jumping?\n     Before the game tries to answer that question, however,  Rocket Arena slaps you across the face with an interface that looks straight out of   Fortnite. Buy new outfits! Buy a battle pass! Buy decorations for your &#34;totem,&#34; a flag that briefly appears between matches. The ways  Rocket Arena nudges you to spend real-world money, after you&#39;ve already paid $30 to start the game, would be hilarious if they didn&#39;t feel like a slap in consumers&#39; faces.\n Had the UI been redesigned to reflect how the in-game economy works, EA might have left a different impression. A first-time player can rack up a ton of in-game currency by simply playing one match with each of the 10 characters, which can be spent on certain cosmetic unlocks. What&#39;s more, a majority of the launch game&#39;s cosmetic options can  only be earned via gameplay. And once you&#39;re in the game, all of the modes are available; no gameplay is gated behind further payments.\n Maybe, just maybe, EA should have removed all ties to real-world money in its &#34;launch&#34; period, thus forcing players to explore how the natural act of playing the game leads to new outfits and decorations... before trying to squeeze us all for a few more bucks.\n  Let&#39;s say EA somehow straightened its messaging about money and respected players. Is there a game worth recommending here? Almost.\n Rocket Arena offers a few versus modes, all broken down to 3v3 faceoffs. Two of these modes offer traditional versions of team deathmatch and king-of-the-hill; two offer slightly unusual spins on capture-the-flag and zone control; and the last one is a &#34;horde&#34; mode against waves of AI baddies. (Without any adjustable difficulty or other options for  RA&#39;s horde mode, however, I cannot recommend it.)\n    The trouble begins with a cast of 10 characters who are clearly not designed to shine in every mode. One example is Plink, the preteen wiz-kid who can absolutely lay waste to foes thanks to his default barrage of mini-rockets that kinda-sorta home in on targets. Should you need to move the &#34;rocketball&#34; (this game&#39;s version of a flag) from one side of an arena to another, he&#39;s not up to snuff, as his &#34;teleport&#34; ability isn&#39;t a movement-tech option. But he&#39;s an imbalanced damage machine who can instantly turn the tide in a round of team deathmatch. Worthless in some modes; imperative in others.\n A good &#34;hero shooter&#34; works when its range of classes encourage teamwork and coordination, and thus make any team framework viable in any mode. But  Rocket Arena&#39;s mechanics revolve around doing damage and picking up temporary items scattered across the map (speed boosts, throwable bombs), not setting up things like buffs or zone-control augmentations. Out of the 10 combatants, only two have the ability to conjure &#34;shields&#34; of any kind, and only one of these shields benefits teammates by slowing down enemies&#39; attacks in a certain zone. ( Rocket Arena buries this issue, in part, by not letting players tap a single button to review character abilities before or during a match.)\n At launch, I&#39;ve only had success with characters who pile on the damage, like Plink and the doesn&#39;t-have-to-reload pirate Blastbeard, and the super-fast character Rev for the sake of objective-based modes. I&#39;ve had zero fun experimenting with less capable damage-dealing options.", "posttime": "2020-07-21 07:30:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,游戏,play", "title": "艺电新推出的30美元纯在线游戏：免费世界中的艰难旅程", "title_en": "EA’s new $30 online-only game: An uphill slog in a free-to-play world", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/rocket-arena-impressions-when-not-free-to-play-goes-wrong/", "via": "", "real_tags": ["免费", "游戏", "play"]}, {"category": "", "categoryclass": "", "imagename": "b6fd175a0d753df7e1e57285e35c36e0.png", "infoid": 1013155, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新冠肺炎大流行中已经拥有最多感染人数的美国，似乎奇怪地致力于让事情变得更糟。随着新感染人数飙升至创纪录的水平，主要零售商正在将基本的保护措施作为可选措施，而佐治亚州州长正在采取行动，阻止任何地方当局采取行动保护他们的公民。尽管美国疾病控制中心(CDC)负责人曾表示，如果我们现在就能让每个人都戴上口罩，我真的认为在接下来的4、6、8周内，我们就能控制住这种流行病。\n而且这不仅仅是面具。虽然卫生专家几乎一致表示，只有在社区感染率较低的情况下才能重新开学，重新设计教室以允许更大的社会距离，并在需要的地方使用远程学习。但特朗普政府威胁说，如果任何学校不能完全重新开放面对面课堂，就不会向它们提供资金。与此同时，政府试图淡化一件事的价值-更多的检测-这可以帮助我们了解病毒在我们人群中的进展。\n本周末，就美国为什么会犯下如此严重的错误，提供了一些解释。一种是详细说明在美国接近最初的感染高峰时，关键决定是如何做出的。第二个是对特朗普总统本人的采访，他给人的印象是生活在一个充满错误信息和阴谋论的世界里。\n上周末，特朗普总统坐下来接受了福克斯新闻克里斯·华莱士(Chris Wallace)的长时间采访。这次采访多次涉及到这场流行病，并提供了一扇窗口，让人们了解特朗普对目前正在发生的事情的想法。这很有启发性，因为它揭示了他有很多想法，但很少有现实基础-采访提出了问题的几个原因。\n最引人注目的案例之一发生在华莱士挑战特朗普，称由于新冠肺炎的原因，美国的死亡率是最糟糕的国家之一。特朗普的回应是让他的新闻秘书凯利·麦克纳尼(Kayleigh McEnany)递给华莱士一张据称可以反驳这一事实的图表。然而，该图表只显示了少数几个国家的数据，美国似乎比一些国家好，但比另一些国家差。这表明问题的一部分是特朗普没有从他的顾问那里了解到全部情况，而且在这个问题上没有足够的投入，以至于没有意识到他得到的情况是不完整的。这表明特朗普没有从他的顾问那里了解到全部情况，而且没有足够的投入到这个问题上来，意识到他得到的情况是不完整的。\n特朗普为了让自己看起来好看而编造故事的倾向也起到了推波助澜的作用。在短短几句话的时间里，他从我认为我们的死亡率是世界上最低的国家之一，到声称图表显示我们的死亡率排名第一，尽管图表显示有几个国家的死亡率更高。\n当华莱士问及检测显示的SARS-CoV-2感染激增时，特朗普对这些问题的松懈也被提及。在这里，特朗普重申了他在案件开始增加后又回到的一个主题：这一切都是因为我们的测试能力。他一度告诉华莱士，如果我们不进行测试，你就不能展示那张图表了。如果我们测试的次数减半，这些数字就会下降。\n但是，正如蒂姆·李(Ars&#39；Tim Lee)所描述的那样，有一种方法可以追踪增加的检测在多大程度上影响了检测出的病例总数：返回阳性结果的检测的比例。这一衡量标准表明，美国新病例的增长是由病毒的传播推动的，而不是扩大检测。特朗普应该知道这一点；他一再表示不知道的事实表明，简报者未能让他了解最新情况，或者他处理信息的能力失败。\n但似乎发生了其他事情，华莱士随后将其与欧洲相对较少的病例进行了比较。华莱士问道：“有没有可能他们的病毒没有我们那么严重？”特朗普用阴谋论对此不屑一顾：他们有可能不进行测试，这才是可能的。\n这种阴谋论也出现在特朗普对美国国内公共卫生政策的回应中。加利福尼亚州重新对其公民实施了限制措施，以应对目前正在经历的案件的死灰复燃。但是，由于特朗普显然不相信会卷土重来，他怀疑这是一场针对他的阴谋。加州没有理由做……。他告诉华莱士，除了11月3日(选举日)，他们都在做他们正在做的事情。他随后表示，民主党人希望尽可能长时间地将其关闭，因为他们认为这对选举有好处。但是我认为经济做得很好。\n在构建了感染人数不会快速增长的另一个现实之后，特朗普正在制定相应的政策。这包括推动学校在今年秋天全面重新开放，接受面授课程，否则将面临联邦资金中断的威胁。(值得称赞的是，华莱士指出，这将对最贫穷的社区造成最严重的打击。)。\n然而，有些荒谬的政策决定并不能完全归入任何一类。华莱士还提出了疾控中心主任的论点，即最近的证据表明，全民使用口罩将使我们能够在几个月或更短的时间内控制住大流行。但特朗普表示，他不愿意接受专家的意见，更不用说以此为基础的政策了，他说，我希望人们有一定的自由，我不相信这一点。不，我也不同意这样的说法，即如果每个人都戴面具，一切都会消失。&#34；\n对现实的普遍缺乏把握似乎也在推动采访中没有提到的其他政策决定。周六，“华盛顿邮报”披露，政府正试图阻止国会在其下一项救济法案中插入针对大流行的资金。一些有争议的资金将流向疾控中心-特朗普对疾控中心的建议不屑一顾。其余的将用于测试和接触者追踪，特朗普指责这让大流行看起来比他想象的更糟糕。因此，很明显，特朗普的信仰，无论他是如何产生的，都在影响着政策。\n同样在周六，《纽约时报》发表了一篇经过深入研究的报道，描述了当病例接近第一个高峰时，政府如何转变为默认立场，无视大流行。报告指出，除了特朗普对不符合现实的事情的看法外，他的政府的回应很大程度上是由白宫的一小部分高级领导层推动的，除了一人之外，所有人都没有医学专业知识(当然，这个小组包括贾里德·库什纳和霍普·希克斯)。\n也许是因为一些成员对小联邦政府的承诺，该组织专注于将责任转移到各州。这一点，尽管这种方法早期变得明显的一些问题-例如有迹象表明，各州之间对检测工具包和保护装备等资源的竞争最终导致了它们的价格上涨。考虑到美国公民很容易跨越州界，还有一些问题，比如接触者追踪，不是每个州都能处理的。\n另一件清楚的事情是，由于只有一位公共卫生专家一直参与其中，该组织对大流行发生的情况没有很好的看法。专家黛博拉·伯克斯(Deborah Birx)博士告诉该小组，到4月中旬，模特显示美国正接近顶峰。事实证明这是真的。但高峰和下降在很大程度上是由纽约州和附近的各州推动的，这些州制定了严格的社会疏远和孤立规定。根据“泰晤士报”的说法，Birx依赖的模型假设所有的州都会采取类似纽约的方式-这是政府中的其他人没有完全注册的一个警告。\n事实上，认为美国不需要进一步限制就能看到案件降至可控水平的信念，与特朗普总统认为经济尽快重启至关重要的信念不谋而合。因此，他甚至在案件达到顶峰之前就开始推动各州重新开放。政府中似乎没有人重新评估这一做法，尽管与遵循社会距离规则的欧洲国家不同，美国的案件仍处于相对较高的平台期。事实证明，这是该病毒在更广泛的美国人口中建立的产物，为其目前的增长奠定了基础。\n这种比例的公共卫生灾难不会因为单一的个性而发生。显然，特朗普政府中的许多官员让美国失望了，因为他们允许自己的意识形态推动做出与既定的公共卫生做法背道而驰的决定。但是，他们在允许总统不仅保持错误的信念，而且以此为基础制定政策方面也失败了。\n至于特朗普，当华莱士暗示人们说你想看世界就谈论世界，而不是追随科学时，他实际上是低估了。采访清楚地表明，特朗普很可能无法认识到任何与他希望的世界背道而驰的科学，更不用说追随它了。", "note_en": "The United States, already in possession of the largest number of infections in the COVID-19 pandemic, seems strangely committed to making things worse. As new infections have shot up to record levels, major retailers are  making basic protective steps optional, while the governor of Georgia is  moving to block any local authorities from acting to protect their citizens. This is despite the fact that the head of the US Centers for Disease Control (CDC) has said &#34;If we could get everybody to wears a mask right now, I really think in the next four, six, eight weeks, we could bring this epidemic under control.&#34;\n And it&#39;s not just masks. While health experts are nearly unanimous in indicating that reopening schools should only take place in the context of having a low infection rate in the community, classrooms redesigned to allow greater social distancing, and distance learning used where needed. But the Trump administration is  threatening to withhold funding from any schools that doesn&#39;t fully reopen for in-person classrooms. Meanwhile, the administration is attempting to  downplay the value of one thing—more testing—that could help us understand the virus&#39; progression through our population.\n  This weekend delivered a few explanations for how the US went so badly wrong. One was in the form of a detailed account of how key decisions were made as the US approached its initial peak in infections. The second is an interview with President Trump himself, who comes across as living in a world of misinformation and conspiracy theories.\n  Over the weekend, President Trump sat down for  an extended interview with Fox News&#39; Chris Wallace. The interview touched on the pandemic multiple times and provides a window into Trump&#39;s ideas about what&#39;s going on. And it is revelatory, in that it revealed that he&#39;s got a lot of ideas but very few of them have a basis in reality—and the interview brings out several of the reasons for the problems.\n One of the most striking cases came when Wallace challenged Trump about the United States being one of the worst countries in terms of its mortality rate due to COVID-19. Trump responded by getting his press secretary, Kayleigh McEnany, to hand Wallace a graph that supposedly contests this fact. The graph, however, only showed data from a handful of countries, with the US appearing better than some but worse than others. This suggests that part of the problem is that Trump isn&#39;t getting the full picture from his advisors and isn&#39;t engaged enough in the issue to realize the picture he&#39;s gotten is incomplete.\n Trump&#39;s tendency to make things up in order to make himself look good also kicked in. Within the span of a few sentences, he went from &#34;I think we have one of the lowest mortality rates in the world&#34; to claiming the graph showed we had the &#34;Number one low mortality fatality rates,&#34; even though the graph showed a couple of countries with better rates.\n Trump&#39;s loose grasp of the issues also came up when Wallace asked about the huge surge in SARS-CoV-2 infections revealed by testing. Here, Trump repeated a theme he&#39;s returned to since cases started growing: it&#39;s all because of our testing capacity. &#34;If we didn&#39;t test, you wouldn&#39;t be able to show that chart,&#34; he told Wallace at one point. &#34;If we tested half as much, those numbers would be down.&#34;\n But, as  Ars&#39; Tim Lee described, there&#39;s a way to track how much increased testing is influencing the total number of cases detected: the fraction of tests that return a positive result. And that measure shows that the growth in new cases in the US is being driven by the spread of the virus, rather than expanded testing. Trump  should know this; the fact that he repeatedly says he doesn&#39;t indicates a failure of briefers to get him up to speed or a failure of his ability to process information.\n  But something else seems to be going on, as Wallace followed up with a comparison to the relatively small number of cases in Europe. &#34;Is it possible that they don&#39;t have the virus as badly as we do?&#34; Wallace asked. Trump dismisses this with a conspiracy theory: &#34;It&#39;s possible that they don&#39;t test, that&#39;s what&#39;s possible.&#34;\n This sort of conspiracy theorizing is also present in Trump&#39;s response to public health policy within the United States. California has re-instituted restrictions on its citizens in response to the resurgence in cases it&#39;s now experiencing. But, since Trump apparently doesn&#39;t believe there is a resurgence, he suspects it&#39;s a plot against him. &#34;There&#39;s no reason for California to do... to be doing what they&#39;re doing except for November 3rd [election day],&#34; he told Wallace. He later went on to say &#34;the Democrats want to keep it closed as long as possible because they think that&#39;s good for election. But I think the economy is doing very well.&#34;\n And, having constructed an alternate reality in which the number of infections isn&#39;t growing rapidly, Trump is setting policy accordingly. That includes pushing schools to reopen fully for in-person classes this fall or face the threat of a cutoff of federal funding. (To his credit, Wallace points out that this will hit the poorest communities the hardest.)\n  There are, however, some nonsensical policy decisions that don&#39;t fit neatly into any category. Wallace also brought up the CDC Director&#39;s argument that recent evidence suggests that population-wide mask use would allow us to get the pandemic under control in a matter of a couple of months or less. But Trump indicates he&#39;s not willing accept expert opinion, much less base policy on it, saying &#34;I want people to have a certain freedom, and I don&#39;t believe in that. No, and I don&#39;t agree with the statement that if everybody wears a mask everything disappears. &#34;\n The general lack of grip on reality also seems to be driving other policy decisions that didn&#39;t come up in the interview. On Saturday, The Washington Post revealed the administration is trying to keep Congress from inserting pandemic-focused funding into its next relief bill. Some of the funding at issue would be directed to the CDC—the ones whose advice Trump is dismissing. The rest would be for testing and contact tracing, which Trump blames for making the pandemic look worse than he thinks it is. So it&#39;s clear that Trump&#39;s beliefs, however he came about them, are influencing policy.\n  Also on Saturday, The New York Times published a deeply researched story that describes how the government shifted into  a default stance of ignoring the pandemic back when cases were approaching their first peak. The report indicates that, in addition to Trump having a view of matters not based on reality, his administration&#39;s response was largely driven by a small group of senior leadership in the White House, all but one of whom had no medical expertise (naturally, the group included Jared Kushner and Hope Hicks).\n Perhaps because of the commitment of some members to a small federal government, the group focused on shifting responsibilities to the states. This, despite some problems with this approach that became obvious early—such as the indications that competition between states for resources like testing kits and protective gear ended up raising prices for them. There are also some issues, like contact tracing, that can&#39;t be handled by individual states, given the ease with which US citizens cross state lines.\n The other thing that became clear is that, with only a single public health expert consistently involved, the group didn&#39;t have a good perspective on what was happening with the pandemic. That expert, Dr. Deborah Birx, told the group that, by mid-April, modeling was showing that the United States was nearing a peak. This turned out to be true. But the peak and decline were largely driven by New York and nearby states, which instituted strict social-distancing and isolation rules. According to the Times, the models Birx relied on assumed that all states would take a New York-like approach—a caveat that others in the administration didn&#39;t fully register.\n  In fact, the belief that no further restrictions were needed in order for the US to see cases drop to manageable levels fit in with President Trump&#39;s belief that it was critical for the economy to restart as quickly as possible. As a result, he started pushing states to reopen before the crest in cases was even reached. Nobody in the administration appears to have re-evaluated the approach despite the fact that, unlike European countries that had seen social-distancing rules followed, the US saw cases remain at a relatively high plateau. That turned out to be the product of the virus being established in the wider US population, setting the stage for its current growth.\n A public health disaster of these proportions doesn&#39;t happen due to a single personality. Obviously, many officials in the Trump administration have failed the US by allowing their own ideology to drive decisions that went against well-established public health practices. But they&#39;ve also failed in terms of allowing the president to not only maintain false beliefs but to set policies based on them.\n As for Trump, Wallace was actually being understated when he suggested that &#34;People say that you talk about the world as you&#39;d like to see it rather than follow the science.&#34; The interview makes clear that Trump is likely to be incapable of recognizing any science that runs counter to the world as he wishes it to be, much less follow it.", "posttime": "2020-07-21 07:30:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,新冠,response,特朗普", "title": "越来越清楚为什么美国对新冠肺炎的回应是可怕的", "title_en": "It’s becoming clear why the US’ response to COVID-19 is terrible", "transed": 1, "url": "https://arstechnica.com/science/2020/07/inside-the-us-pandemic-incompetence-it-starts-at-the-top/", "via": "", "real_tags": ["美国", "新冠", "response", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "94462c9894c39a1e785b090c08e9042d.jpeg", "infoid": 1013154, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软将停止依赖亚马逊帮助其运行广受欢迎的视频游戏《我的世界》。\n对于微软来说，这一转变代表了一种明显的方式，以削减对其最强硬的竞争对手之一的付款，并推广自己的产品。亚马逊网络服务(Amazon Web Services)统治着公共云基础设施的市场，这些基础设施可以通过庞大的数据中心远程运行软件，而微软一直在努力与其Azure云分享市场份额。\nAzure的增长速度比微软的许多其他部门都要快，这有助于它减少对Windows和Office等历史悠久的资产的依赖。将更多自己的软件转移到Azure，可以帮助微软向客户证明，它不会在其他地方寻找计算、存储和网络资源来提供在线服务。这是一个重要的考虑因素，因为亚马逊可以告诉客户，其庞大的电子商务业务消耗了AWS的资源。\n微软的大部分消费者和商业资产，包括团队通讯应用程序，都已经使用了Azure。去年，在完成对商业社交网络LinkedIn的收购两年半后，微软表示将把LinkedIn从自己的专用数据中心迁移到Azure。\nAWS for My world的一个名为Realms的版本的使用可以追溯到2014年。Realms是一个让小团体聚集在一起玩开放世界游戏的虚拟场所。几个月前，AWS发表了一篇关于“我的世界”背后的游戏开发商Mojang选择利用AWS收购Realms的博客文章，几个月后，微软宣布将以25亿美元收购Mojang。\n自那以后，“我的世界”已经成长为世界上最畅销的游戏，截至5月份已售出2亿份，每月有1.26亿人玩这款游戏。\n一位微软发言人在一封电子邮件中告诉CNBC，Mojang Studios过去曾使用过AWS，但在过去几年里，我们一直在将所有云服务迁移到Azure。亚马逊拒绝置评。\n微软工作室负责人马特·布蒂(Matt Booty)在最近的一次采访中表示，让Mojang在收购后立即退出AWS是不正确的。\n一家大型组织很容易走进来说：嘿，我们将向你展示它是如何做到的。我们将让您摆脱这段Java代码。Booty告诉GamesIndustry.biz说：我们将把东西搬到C语言。我们将把你从亚马逊网络服务转移到Azure，Booty告诉GamesIndustry.biz。但重要的是要认识到，创造“我的世界”的条件，以及它是如何形成的，很可能是在一个更具公司性质的结构中很难再创造出来的。\n微软发言人写道，我们将在今年年底前完全过渡到Azure。", "note_en": "Microsoft will stop relying on  Amazon to help it run the popular Minecraft video game.\n The shift represents an obvious way for Microsoft to cut back on payments to one of its toughest competitors and promote its own product. Amazon Web Services rules the market for public cloud infrastructure for running software from afar through vast data centers, and Microsoft has been working to take share with its Azure cloud.\n  Azure is growing faster than many other parts of Microsoft, helping it lean less on longstanding properties like Windows and Office. Moving more of its own software to Azure can help Microsoft make the case to customers that it doesn&#39;t look anywhere else for computing, storage and networking resources to deliver its online services. That&#39;s an important consideration, because Amazon can tell customers that its sprawling e-commerce business consumes resources from AWS.\n Most of Microsoft&#39;s consumer and commercial properties, including the Teams communication app, already draw on Azure. Last year, two and a half years after it closed the acquisition of business social network LinkedIn, Microsoft said it would  migrate LinkedIn from its own dedicated data centers to Azure.\n The use of AWS for Minecraft for a version called Realms — virtual places for small groups to gather and play the open-world game together — dates to 2014. Months after AWS published a  blog post about how Mojang, the game developer behind Minecraft, had chosen to tap AWS for Realms, Microsoft  announced that it would acquire Mojang for $2.5 billion.\n Minecraft has since grown into the world&#39;s best-selling game, with over  200 million copies sold as of May, and 126 million people play it each month.\n &#34;Mojang Studios has used AWS in the past, but we&#39;ve been migrating all cloud services to Azure over the last few years,&#34; a Microsoft spokesperson told CNBC in an email. Amazon declined to comment.\n  It would not have been right to make Mojang get off AWS immediately after the acquisition, Matt Booty, the head of studios at Microsoft, suggested in a recent interview.\n &#34;It would be easy for a large organization to come in and say: &#39;Hey, we&#39;re going to show you how it&#39;s done. We&#39;re going to get you off this Java code. We&#39;re going to get things moved over to C. We&#39;re going to get you off Amazon Web Services and over to Azure,&#39;&#34; Booty told  GamesIndustry.biz. &#34;But it&#39;s important to realize that the conditions that created Minecraft, how it came to be, are likely to be things that are difficult to recreate within a more corporate structure.&#34;\n  &#34;We&#39;ll be fully transitioned to Azure by the end of the year,&#34; the Microsoft spokesperson wrote.", "posttime": "2020-07-21 07:29:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,亚马逊,微软,amazon,世界", "title": "微软旗下的“我的世界”将停止使用亚马逊的云", "title_en": "Microsoft-Owned Minecraft Will Stop Using Amazon's Cloud", "transed": 1, "url": "https://www.cnbc.com/2020/07/20/microsoft-minecraft-mojang-abandon-aws-for-azure.html", "via": "", "real_tags": ["microsoft", "亚马逊", "微软", "amazon", "世界"]}, {"category": "", "categoryclass": "", "imagename": "d6a5a30682ea4a07b9b3043fa03d1622.jpg", "infoid": 1013153, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该项目将使用谷歌苹果暴露通知系统来支持公共卫生当局的检测、追踪和隔离做法。\nLinux基金会介绍了它的最新项目，该项目使用开源技术来帮助公共卫生当局(PHA)抗击新冠肺炎大流行。Linux基金会公共卫生(LFPH)计划于周一宣布，重点关注开源暴露通知应用程序的使用。\nLFPH总经理丹·科恩(Dan Kohn)在新闻稿中表示，为了促进这一开源开发，Linux基金会公共卫生基金会正在建立一个由领先的技术和咨询公司、公共卫生当局、流行病学家和其他公共卫生专家、隐私和安全专家以及个人开发人员组成的全球社区。\n科恩补充说，虽然我们很高兴能推出两个非常重要的开源项目，但我们认为，我们能够协作抗击这场流行病的召集功能可能是我们最大的影响。\nLFPH与七个主要合作伙伴合作：思科、doc.ai、Geeter、IBM、NearForm、腾讯和VMware。该倡议的重点是两个关键应用程序-COVID Shield和COVID Green-这两个应用程序正在加拿大、爱尔兰和美国几个州部署。\nCoVID Shield是由来自Shopify的40多名开发人员组成的志愿者团队创建的，目前正致力于在加拿大部署。根据COVID Shield主页的说法，这款应用是一款免费的曝光通知解决方案，其使命是帮助加拿大人安全重返工作岗位。\nCOVID Shield不是直接可以下载的，而是作为当地公共卫生当局建立自己的应用程序的参考点提供的。\n移动应用程序打算在入网后在后台运行，没有用户交互。通过蓝牙，该应用程序收集随机ID，并与附近安装了COVID Shield的手机共享。如果用户的冠状病毒检测呈阳性，他们可以匿名分享他们的数据，这样其他人就可以知道感染。\n根据新闻稿，COVID Green是NearForm开发的另一款冠状病毒追踪应用程序，作为爱尔兰政府应对大流行的一部分。\n自两周前发布以来，这款应用已经被该国超过三分之一的成年人采用。\n根据新闻稿，这两款应用程序都可以供其他PHA和IT合作伙伴定制和使用，LFPH托管的其他开源项目也将加入它们的行列。\n上周，LFPH在其在线GAEN研讨会期间接待了来自几乎每个国家的代表，他们正在构建GAEN应用程序。在研讨会期间，与会者讨论了PHA面临的一些困难问题，以及GAEN应用程序如何提供帮助。\n正如谷歌和苹果的一份新闻稿中所说，传统的接触者追踪方法对于遏制感染的传播至关重要。技术可以支持和加强这些努力，允许公共卫生当局迅速通知可能接触过新冠肺炎感染者的人，包括该人可能不直接认识的人。这从你智能手机上的暴露通知开始，如果你可能接触过新冠肺炎，联系人追踪应用程序就会向你发送通知。\nLFPH还创建了一个环境，允许跟踪新冠肺炎响应生态系统中的开源和封闭源代码应用程序，以及应用程序在世界各地推出的位置。\n我们提供有关公司、人民和产品革命性改变地球的顶级商业技术新闻。每日递送。\n今天报名", "note_en": "The project will use the Google Apple Exposure Notification system to support public health authority&#39;s testing, tracing, and isolation practices.\n  The Linux Foundation introduced its latest project that uses open source technologies to help public health authorities (PHAs) fight against the  COVID-19 pandemic. The  Linux Foundation Public Health (LFPH) initiative, announced on Monday, focuses on the use of open source exposure notification applications.\n   &#34;To catalyze this open source development, Linux Foundation Public Health is building a global community of leading technology and consulting companies, public health authorities, epidemiologists, and other public health specialists, privacy and security experts, and individual developers,&#34; said Dan Kohn, LFPH general manager, in the release.\n  &#34;While we&#39;re excited to launch with two very important open source projects, we think our convening function to enable collaboration to battle this pandemic may be our biggest impact,&#34; Kohn added.\n   LFPH is working alongside seven key partners: Cisco, doc.ai, Geometer, IBM, NearForm, Tencent, and VMware. The initiative focuses on two key applications— COVID Shield and  COVID Green—which are being deployed in Canada, Ireland, and several US states.\n  COVID Shield was created by a volunteer team of more than 40 developers from Shopify and is working toward being deployed in Canada. The app is a free exposure notification solution with the mission of helping Canadians safely return to work, according to the COVID Shield homepage.\n COVID Shield is not directly available for download, but is instead offered as a reference point for local  public health authorities to build their own app.\n The mobile app is intended to run in the background with no user interaction after onboarding. Via Bluetooth, the app collects and shares random IDs with nearby phones that have COVID Shield installed. If a user tests positive for the coronavirus, they  can anonymously share their data so others can be aware of exposure.\n COVID Green is another coronavirus tracker app developed by NearForm as a part of the Irish government&#39;s response to the pandemic, according to the release.\n Since its launch two weeks ago, the app has been adopted by more than one-third of the country&#39;s adults.\n Both apps are available for other PHAs and IT partners to customize and use, and they will be joined by other open source projects hosted by LFPH, according to the release.\n Last week, LFPH hosted representatives from nearly every country who are building a GAEN app during its online  GAEN Symposium. During the symposium, attendees discussed some of  the difficult issues PHAs are facing and how GAEN apps could help.\n As stated in a press release from Google and Apple, &#34;Traditional methods of contact tracing are critical to containing the spread of infection. Technology can support and augment these efforts by allowing public health authorities to quickly notify people who may have been exposed to a person who has contracted COVID-19, including those the person might not know directly. This starts with Exposure Notifications on your smartphone, which enable contact tracing apps to send you a notification if you&#39;ve likely been exposed to COVID-19.&#34;\n LFPH has also created a landscape that allows for the tracking of open and closed source applications in the COVID-19 response ecosystem,  as well as the where applications are in their rollouts around the world.\n  We deliver the top business tech news stories about the companies, the people, and the products revolutionizing the planet. Delivered Daily\n        Sign up today", "posttime": "2020-07-21 07:29:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,苹果,谷歌,apple,linux", "title": "Linux基金会宣布倡议帮助公共卫生官员抗击流行病，推出两款使用谷歌和苹果API的新冠肺炎追踪应用程序", "title_en": "Linux Foundation announces initiative to help public health officials in pandemic battle, launches two COVID-19 tracker apps using Google and Apple APIs", "transed": 1, "url": "https://www.techrepublic.com/article/linux-foundation-announces-open-source-exposure-notification-apps-initiative-to-combat-covid-19/", "via": "", "real_tags": ["google", "苹果", "谷歌", "apple", "linux"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013152, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pharo得益于优雅的设计，可以相对简单地实现许多高级编程技术。以下是其中一些：\n在Pharo中，可以消除程序和IDE之间的边界。这意味着您可以在调试期间直接使用代码来直观地表示数据结构，并且可以轻松地修改内置工具以满足您的需要，等等。\n在断点上，使用调试器中的自定义电路区域可视化表示形式，对原始调试器内的一段代码运行另一个调试器，编辑调试器内的电路并继续单步执行。\n法罗把一切都暴露给程序员。可以相对于对象封装规则检查和改变系统中的每个对象。\n在某个窗口实例上打开检查器，查找所有引用它的对象并调查它们。\n在法罗，一切都是对象。这种在系统和语言设计上的纯净和统一，使法罗的学习变得干净和舒适。\nTrue是名为True的类的实例，该类具有处理闭包的控制结构的方法(如ifTrue。\nPharo使用文件来序列化源代码，但是默认情况下，它不使用文件来编辑它们。它提供了浏览和修改类、方法、类注释和其他程序实体的工具，而不是文本编辑器。因此，Pharo对它们之间的关系有了更好的理解，并允许更轻松地导航和重构。\nPharo中具有非本地返回的闭包允许优雅地实现控制结构，而不需要在语言本身中定义它们。Pharo是一种简单的元语言，其中程序员拥有编写自定义的可读域特定语言所需的所有功能。\n展示了消息重复的实现和用法。包含具有非本地返回的闭包的方法(映射)。\n在Pharo中，您可以轻松地将一个对象替换为另一个对象。正在运行的程序中对旧对象的所有引用都将替换为对新对象的引用。\n检查桌面上的所有图形元素，找到徽标，从用户选择的显示区域创建新图片，并将徽标对象的标识更改为此新图片*。\nPharo提供了高级异常系统，该系统可以从引发的异常中恢复，并提供替代结果，这样您的程序就可以从故障中恢复。\n您可以通过多种方式(文本形式、图形表示)可视化您的对象，并使用它来检查正在运行的程序的状态。调试器可以使用这些可视化效果来帮助您理解。\n法罗可以在运行过程中进化。它就像一个有机体。您可以执行诸如添加或删除已有实例的类的实例变量之类的操作。所有这些活生生的实例都将得到适当的修改。\n查看某个类的随机实例，并向该类添加新变量\n您可以更改现有类的定义，包括更改其超类。对于某些选定的对象，您只需分配一个不同的类并执行类似的操作即可。这些功能对于系统在不需要重新启动的情况下发展的能力至关重要。\n计算Point类的所有活实例，用其原始变量的一半创建一个新类，并在图形系统运行时将其用作Point的新超类。\nPharo使用速度非常快的虚拟机，具有许多独特功能，可在Windows、MacOS和Linux(包括ARM处理器)上运行。\n垃圾回收器源代码的一部分，用于处理具有稳定内存位置的固定对象。\n为了更自然地理解和调试虚拟机，它主要是用Pharo编写的。\n在编写虚拟机代码期间，您可以使用Pharo IDE的所有优点。然后将源文件翻译成C。\n您可以轻松地检查、修改或序列化调用堆栈。这使得调试工具的构建变得容易得多。\n调用堆栈操作允许非常轻松地实现延续，而不需要直接支持虚拟机。这些扩展对于Web开发任务和回溯实现非常方便。\n使用Pharo反射，您可以轻松地枚举特定类的所有现有实例并调查对它们的引用。它有助于检测内存泄漏。这是一项基本的法罗反射率功能。\n查找包含减号“Pharo Has”的所有现有字符串，并根据其大小将其可视化为树形映射。\n方法是对象，对象可以充当方法。在这种情况下，调用方法意味着对象接收到一条特殊消息。它可以例如在覆盖测试期间使用。您用这样的代理对象替换所有类方法，当被调用时，这些对象用原始方法替换它们自己，并将此信息写入日志。\nPharo类使用单一继承，但它们可以使用有状态特征与其他类共享行为。\n树表使用有状态特性，该特性通过具有上下文菜单的能力来扩展其行为。\nPharo包括自己的进程管理，即使在不支持并发编程的平台上也可以使用。\n方法的抽象语法树可以通过元链接进行扩展，这些元链接允许在特定AST节点之前、之后或代替特定AST节点执行附加操作。这允许断点、覆盖率测试、记住旧值的变量等功能的干净一流实现。\n在AST节点上安装断点。具有断点的方法的示例字节码。\n实例变量也由对象描述。例如，这使得实现更智能的实例变量变得容易，比如保持两个对象之间双向托管引用的变量。然后，简单的赋值也会自动更新参照的另一侧。\n通用语言元模型的一部分，用于定义包与其所有者之间的多对一关系。当您指定具有简单赋值的类包时，该类将自动添加到包的子实体集合中。\n对象有类，类也有类，也就是元类。这些元类也有一个类，并且Pharo允许使用自定义类。它允许将语言特性(如特征)实现为独立库，而无需在虚拟机中提供任何直接支持。\nPharo在用JavaScript编写的虚拟机中的Web浏览器中运行。用户界面是完全相同的。\n编译器是用Pharo编写的，您可以像修改系统中的任何其他内容一样修改它。您可以对某些类使用完全不同的编译器。\n为了提高工作效率，铁匠会为他们的任务创建定制工具。法罗有着同样的理念。它允许您创建自然专用的工具，以便更好地了解您的问题，从而支持您进行更快的开发。\n编写一个简单的小工具，显示Pharo类集合内的实际代码和自动格式化代码之间的差异。\n系统中的所有对象都可以同时存储在一个名为image的独立于平台的文件中。因此，例如，您可以在调试期间保存程序的完整状态，并将其还原以尝试找到不同的执行路径或替代解决方案。\n安装断点，运行应用程序，并在调试器出现时保存系统状态。在调试器中执行一些步骤，然后关闭Pharo。恢复保存的状态并重复该步骤。\nPharo拥有超出标准文件级别的高级集成Git支持。您可以按特定方法的粒度合并分支、浏览它们的历史记录、直接从IDE创建拉请求，等等。\n所有对象，包括类或运行上下文，都可以序列化为一个文件。例如，您可以将调试器的状态与当前堆栈的内容一起存储，并将其附加到问题报告。\nPharo可以使用分数、刻度小数、大整数等来处理数字，而不会损失算术精度。\nPharo包含一个FFI接口，它使得创建到C库的绑定变得非常简单。\n能够轻松创建代理对象-处理所有消息和/或将所有消息重新发送到另一个对象的对象，对于面向对象的语言来说是必不可少的。\n在Pharo中，程序员几乎有绝对的自由来定制系统和使用许多潜在的危险功能。另一方面，大多数程序员都会慎重地使用它们，因为默认情况下，Pharo提供了一个强大的标准库和工具，这些库和工具决定了如何以正确的方式使用系统。它不是让语言变得严格，而是引导程序员做正确的事情。\nPharo是以非病毒式开源麻省理工学院许可证分发的。主Pharo存储库托管在GitHub上。", "note_en": "Pharo benefits from an elegant design that enables a relatively simple implementation of many advanced programming techniques.  Here are some of them:\n In Pharo, the border between your program and IDE can be eliminated. That means that you may directly use your code for a visual representation of your data structures during debugging, and easily modify the built-in tools to fit your needs, etc.\n On a breakpoint, use the custom circuit region visual representation in the debugger, run another debugger on a piece of code inside the original debugger, edit the circuit inside the debugger and continue in stepping\n Pharo exposes everything to the programmer. Every object in the system can be examined and changed with respect to the object encapsulation rules.\n Open inspector on some window instance, find all objects that have reference to it and investigate them\n In Pharo, everything is an object. This purity and uniformity in the system and language design makes Pharo clean and comfortable to learn.\n True is instance of the class named True that has methods for control structures (like ifTrue:) that work with closures\n Pharo uses files for serialization of source code, but, by default, it does not use files to edit them. Instead of a text editor, it provides the tools to browse and modify the classes, methods, class comments and other program entities. So Pharo has a much better understanding of relations between them and allows easier navigation and refactorings.\n  The closures in Pharo with non-local returns allow elegant implementation of control structures without needing to define them in the language itself. Pharo is a simple meta-language where the programmer has all features required for the writing of custom readable domain-specific languages.\n Show implementaion and usage of message repeat. A method (map) that contains closure with non-local return\n In Pharo, you can easily replace an object with another one. All references to the old object in your running program will be replaced by references to the new object.\n Inspect all graphical elements on desktop, find logo, create new picture from a display region selected by the user and change identity of the logo object to this new picture*\n Pharo provides advanced exceptions system that can do things like resuming from a raised exception with providing an alternative result so your program can recover from failures.\n You can visualize your objects in many ways (textual form, graphical representation) and use it to inspect the state of your running program. Debuggers can use these visualizations to help you to your understanding.\n Pharo can evolve while it’s running. It is like an organism. You can do things like add or remove instance variables of classes that have already existing instances. All these living instances will be properly modified.\n Look at some random instance of a class and add new variable to this class\n You can change the definition of existing classes including changing its superclass. To some selected object, you can simply assign a different class and do similar operations. These capabilities are essential for the ability of the system to evolve without the need for restarts.\n Count all living instances of a class Point, create a new class with half of its original variables and use it as new superclass of Point while the graphical system is running\n Pharo uses a very fast virtual machine with many unique features that runs on Windows, macOS and Linux including the ARM processors\n A part of the garbage collector sources that deals with pinned objects that have stable memory location\n For more natural understanding and debugging of the virtual machine, it is mostly written in Pharo.\n You can use all benefits of the Pharo IDE during writing of the virtual machine code. The source is then translated to C.\n You can easily inspect, modify or serialize the call stack. This allows, among other things, much easier building of debugging tools.\n Call stack manipulation allows surprisingly easy implementation of continuations without the need for direct support of the virtual machine. The continuations are very handy for web development tasks and backtracking implementation.\n With the Pharo reflection, you can easily enumerate all existing instances of a particular class and investigate references to them. It is beneficial for detecting memory leaks. It is an essential Pharo reflectivity feature.\n Find all existing strings that contain subsctring ‘Pharo has’ and visualize them as a tree map according their sizes\n Methods are objects and objects can serve as methods. In this case, the invoking of a method means that the object receives a special message. It may be used for example during the coverage testing. You replace all class methods with such proxy objects, and when called, these objects replace themselves with the original method and write this information to a log.\n Pharo classes use single inheritance, but they can use stateful traits for sharing of behavior with other classes.\n Tree table uses a stateful trait that extends its behavior with the ability to have a context menu\n Pharo includes own process management that allows using concurrent programming even on platforms that do not support it.\n Abstract syntax tree of methods can be extended by metalinks that enable doing additional operations before, after or instead of particular AST nodes. That allows the clean first-class implementation of features like breakpoints, coverage testing, variables that remember old values, etc.\n Installation of a breakpoint on an AST node. Example bytecode of a method with breakpoint.\n Instance variables described by objects, too. This makes it easy to implement, for example, much smarter instance variables like variables that keep bidirectional managed references between two objects. A simple assignment then automatically updates the other side of the reference, too.\n Part of a general language meta-model that defines many-to-one relation between package and its owner. When you secify a class package with a simple assignment, the class is added to the child entities collection of the package automatically.\n Objects have classes and classes have classes, too, the metaclasses. These metaclasses have a class, too, and Pharo allows using custom ones. It allows having the implementation of language features like traits as standalone libraries without any direct support in the virtual machine.\n  Pharo running in a web browser in a virtual machine written in JavaScript. The UI is the very same.\n The compiler is written in Pharo, and you can modify it as anything else in the system. You can use completely different compilers for some of your classes.\n To be more productive, blacksmiths create custom tools for their tasks. Pharo shares the same philosophy. It allows you to create naturally dedicated tools for better understanding of your problems, supporting you in faster development\n Write a small simple tool that shows differences between actual and automatically formatted codes inside the Pharo class Collection\n All objects in the system can be stored at once in a platform-independent file named image. So you can, for example, save complete state of your program during debugging and restore it to try to find a different execution path or alternative solution.\n Install a breakpoint, run the application, and when the debugger appears, save the system state. Do some steps inside the debugger and then close Pharo. Recover the saved state and repeat the stepping.\n Pharo has advanced integrated Git support that goes beyond the standard level of files. You can merge your branches on the granularity of particular methods, browse their history, create pull-requests directly from the IDE, and so on.\n All objects, including classes or running contexts, can be serialized to a file. You can, for example, store the state of a debugger with the content of current stack and attach it to the issue report.\n Pharo can use fractions, scaled decimals, large integers and so on to work with numbers without loss of arithmetic precision.\n Pharo includes an FFI interface that makes the creation of bindings to C libraries very straightforward.\n Ability to easily create proxy objects - objects that process and/or resend all messages to another object, is essential to object-oriented languages.\n  In Pharo, the programmers have almost absolute freedom to customize the system and use many potentially dangerous features. On the other hand, most programmers will use them with deliberation, because Pharo, by default, provides a powerful standard library and tools that shape how to use the system the right way. Instead of making the language strict, it guides the programmers to do things right.\n Pharo is distributed with a non-viral open-source MIT license. The main Pharo repository is hosted on GitHub.", "posttime": "2020-07-21 07:17:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "smalltalk,对象", "title": "Pharo Smalltalk概述", "title_en": "Pharo Smalltalk Overview", "transed": 1, "url": "https://www.pharo.org/features", "via": "", "real_tags": ["smalltalk", "对象"]}]