[{"category": "", "categoryclass": "", "imagename": "c501ad2f83d0edd0a7aa93c81b39ee6d.jpg", "infoid": 1000974, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒的大流行迫使迪士尼推迟了其最大的电影的上映，包括“花木兰”和“黑寡妇”，但如果冠状病毒大流行持续更长时间，这些电影真的会直接进入流媒体或数字点播平台吗？\n迪士尼表示，它可能会根据具体情况，考虑将一些大片直接放到流媒体上。\n发生了什么-周二，迪士尼为投资者举行了2020年第二季度收益电话会议，首席执行官鲍勃·查佩克、首席财务官克里斯汀·麦卡锡和执行主席鲍勃·伊格尔(远程)出席了会议，发表声明并回答问题。\n从电话会议的顶部看，冠状病毒就像切尔纳博一样隐约可见，因为每个人-包括迪士尼高管-都表达了对关闭和限制业务造成的收入损失的一些担忧。没有电影院放映电影，没有主题公园开放，没有迪士尼旗下的ESPN现场体育节目，麦卡锡告诉投资者，冠状病毒对2020年第二季度的财务影响已经造成高达14亿美元的损失。\n在电话会议的问答环节，投资者问道，迪士尼是否考虑过为其推迟上映的电影(如“花木兰”、“黑寡妇”和“永恒”)提供优质流媒体服务。随着流行病迫使影院关闭，人们不得不在家里说话，迪士尼是否愿意放弃影院，转而像一些制片厂那样在数字平台上发行电影(即：巨魔世界巡演)？\n影院巨头查佩克在电话会议上告诉投资者，迪士尼将主要坚持在影院上映其所有大片，包括那些重新安排在晚些时候上映的影片。\n查佩克说，我们非常相信上映大片的影院体验的价值，并指出迪士尼将在2019年上映，这是2020年坚持在影院上映的原因。如你所知，我们在2019年有七部10亿美元的电影。\n正如专家之前告诉“逆向”的那样，迪士尼有能力等待疫情结束，在影院上映电影，因为像迪士尼这样的制片厂仍然在那里赚取最大的利润。查佩克补充说，迪士尼将根据具体情况考虑溢价流媒体发行。\n但我们也意识到，要么是因为消费者动态的变化和演变，要么是因为Covid等特定情况，我们可能不得不对整体战略做出一些改变，仅仅因为影院没有开放，或者没有开放到每个人都需要在财务上可行的程度，他说。\n查佩克用谨慎的语气补充道，所以我们将像现在这种冠状病毒的情况下一样，对每一部电影逐一进行评估。\n查佩克于2月25日就任迪士尼首席执行官，他提出了Artemis Fowl计划的变化。根据伊恩·科尔弗(Eoin Colfer)与导演肯尼斯·布拉纳(Kenneth Branagh)合作的青少年奇幻小说改编的“阿特米斯·福尔”(Artemis Fowl)原定于8月9日在影院上映，但这场流行病迫使迪士尼将其上映时间推迟了两个月，并直接将其带入其流媒体服务。这部电影将于6月12日在迪士尼+首映。\n查佩克说，考虑到这部电影的人口统计数据和吸引力，阿特米斯·福尔将转向迪士尼+。但是我们所有的触角电影都被重新安排在今年晚些时候上映，所以我们非常相信这个大片推出平台的力量。\n看看Tenet？-有趣的是，Bob Chapek提到了华纳兄弟公司的一个直接竞争对手，尽管这位首席执行官从未提到华纳兄弟公司的名字。在电话会议上，当被问及由于影院在重新开放时限制客人而调整预期时，查佩克提到了一家在花木兰之前上映的竞争对手，以此来衡量迪士尼的表现。\n花木兰前一周上映的那部大电影？克里斯托弗·诺兰(Christopher Nolan)的动作惊悚片“Tenet”由竞争对手华纳兄弟公司(Warner Bros)发行，大多数电影公司都推迟了上映时间，即使是定于今年晚些时候上映的电影(包括迪士尼)，华纳兄弟公司也坚持使用“Tenet”，并未触及7月17日的上映日期。木兰将在一周后，即7月24日获释。\n查佩克说：我们会对此有一个相当好的想法，因为有一部竞争对手的电影比我们的电影上映早一周。在这一点上，我们希望这些电影的银幕开放数量和放映时间都能恢复到表面上的正常水平。我们的手指祈祷了。这是我们走出大门的第一部大片。\n他说：由于参展商实行社交距离，加上被压抑的需求令人难以置信，在有限座位的某种平衡之间，我认为我们肯定会找到答案的，或许我们会在竞争对手的电影上映前一周找出答案，他说，“我想我们一定会找到答案的，也许我们会在竞争对手的电影上映前一周找出答案，因为参展商实行的是社交距离，再加上令人难以置信的被压抑的需求，我想我们肯定会找到答案的。”\n逆向分析--在作为迪士尼首席执行官的第一次通话中(尽管他的前任鲍勃·伊格尔(Bob Iger)仍然在他之前)，查佩克和其他高管坦率地谈到了迪士尼的亏损，但也预测了未来更美好的日子。该公司相信，在隔离了50多天后，观众和主题公园的游客会更想出去娱乐。\n至于“花木兰”或“漫威”系列电影是否会在流媒体平台上首映，迪士尼对每部电影的评价意味着，可能会有一些电影先于影院进入消费者的家中。但不是全部。“黑寡妇”和“永恒”实在太大了，不能在家里首映。但是新变种人呢？这更有可能。\n漫威漫画公司(Fox)出品的恐怖电影“新变种人”(The New Mutants)自2018年以来一直被推迟上映。这是一部既大又小的电影，人们可以想象，尽管存在着繁文缛节，但它仍将获得溢价的流媒体首映式。“新变种人”是一部由福克斯制作的恐怖电影，自2018年以来一直被推迟上映。这部电影也曾在亚马逊Prime Video上短暂接受预订，直到被取消。\n对于那些真正渴望观看“黑寡妇”的人来说，如果没有大流行，这部电影本可以在上周5月1日上映的，你只有一件事可以做：等待。", "note_en": "The  Covid-19 pandemic has forced  Disney to postpone the release of its biggest movies, including  Mulan and  Black Widow, but will those movies actually end up heading straight to a streaming or digital-on-demand platform if the coronavirus pandemic drags on even longer?\n Disney says it might consider sending some major movies straight to streaming on a &#34;case-by-case&#34; basis.\n What happened — On Tuesday, Disney held its Q2 2020 earnings call for investors, with CEO Bob Chapek, CFO Christine McCarthy, and executive chairman Bob Iger in attendance (remotely) to give statements and take questions.\n From the top of the call, Covid-19 loomed like  Chernabog, as everyone — Disney executives included — expressed some worry over the loss of revenue due to closed and restricted business. Without movies in theaters, theme parks open, and live sports being played for Disney-owned ESPN, McCarthy told investors the financial impact of Covid-19 in Q2 of 2020 has disrupted &#34;as much as $1.4 billion.&#34;\n In the Q&amp;A section of the call, investors asked if Disney had considered a &#34;premium streaming&#34; release for its postponed movies, like   Mulan,   Black Widow, and   The Eternals. With the pandemic forcing theaters to close and people to say at home, is Disney willing to forgo theaters and instead release movies on digital platforms, as some studios have (i.e.:  Trolls World Tour)?\n   The &#34;Power&#34; of Theaters — Chapek told investors on the call that Disney will mostly stick to theatrical releases for all of its big movies, including the ones that were rescheduled for later dates.\n &#34;We very much believe in the value of the theatrical experience to launch blockbuster movies,&#34; Chapek said, citing Disney&#39;s releases in 2019 as the reason to stick with theaters in 2020. &#34;As you know, we had seven billion-dollar films in calendar year 2019.&#34;\n As experts  previously told  Inverse, Disney can afford to wait out the pandemic and release movies in theaters because that&#39;s still where studios like Disney still earn the biggest profits. Chapek added that Disney will consider a premium streaming release on a &#34;case-by-case&#34; basis.\n &#34;But we also realize that, either because of changing and evolving consumer dynamics or because of certain situations like Covid, we may have to make some changes to that overall strategy just because theaters aren&#39;t open, or aren&#39;t open to the extent everybody needs to be financially viable,&#34; he said.\n Chapek added, with a cautious tone, &#34;So we&#39;re going to evaluate every one of movies on a case-by-case situation as we are doing right now during this coronavirus situation.&#34;\n Chapek, who assumed the role of Disney CEO on February 25, brought up the change in plans for  Artemis Fowl. An adaptation of Eoin Colfer&#39;s young adult fantasy novels with director Kenneth Branagh,  Artemis Fowl was scheduled to open in theaters on August 9, but the pandemic compelled Disney to bump its release by two months and bring it straight to its streaming service. The movie will premiere on Disney+ on June 12.\n &#34; Artemis Fowl is moving over to Disney+, given the demographics and appeal of that film,&#34; Chapek said. &#34;But all of our tentpole movies have been rescheduled theatrically for later in the year, so we believe very much in the power of that launch platform for our big movies.&#34;\n  Looking at  Tenet? — Interestingly, Bob Chapek brought up a direct competitor in Warner Bros., though the CEO never mentioned the studio by name. When asked on the call about adjusting expectations due to theaters limiting guests when they reopen, Chapek mentioned &#34;a competitor&#34; opening before  Mulan as a way to gauge how Disney may perform.\n That big movie opening the week before  Mulan?  Tenet, the Christopher Nolan action-thriller being released by rival studio Warner Bros. Where most studios delayed its releases, even for films set for much later in the year (including Disney), Warner Bros. has stuck by  Tenet and hasn&#39;t touched its July 17 release.  Mulan will be released a week later, on July 24.\n &#34;We&#39;re gonna get a pretty good idea of that because there&#39;s a competitor movie that opens one week before our film does,&#34; Chapek said. &#34;And at that point, we&#39;re hoping there&#39;s some return to a semblance of normal in terms of the number of screens opening and number of showtimes for those movies. Our fingers are crossed. That&#39;s our first big movie out of the gate.&#34;\n  &#34;Between some balance of limited number of seats as social distancing is practiced by the exhibitors combined with what&#39;s got to be incredible pent-up demand, I think we&#39;ll certainly find out and maybe we&#39;ll find out the week before with the competitor movie,&#34; he said.\n  The  Inverse Analysis — On his first call as Disney CEO (though he was still preceded on the call by his predecessor, Bob Iger), Chapek and the other executives were upfront about Disney&#39;s losses but also forecasted better days ahead. The company believes audiences and theme park goers will want to go out for recreation even more after spending 50-plus days in quarantine.\n As for whether  Mulan or the Marvel movies will premiere on streaming platforms, Disney&#39;s evaluation of each movie means there could be some that make it into consumer&#39;s homes before theaters. But not all.  Black Widow and  The Eternals are simply  too big to premiere in homes. But   The New Mutants? That&#39;s more likely.\n The New Mutants, a Marvel Comics horror movie produced by Fox that&#39;s been delayed since 2018, is the kind of &#34;big but small enough&#34; movie that one could fathom receiving a premium streaming premiere  pre-existing red tape notwithstanding. The movie was also briefly  available for pre-order on Amazon Prime Video until it was pulled.\n For those really aching to watch  Black Widow, which would have hit theaters last week on May 1 without the pandemic, there&#39;s only one thing you can do: Wait.", "posttime": "2020-05-07 01:43:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,电影,具体情况,case,迪士尼", "title": "迪士尼将“根据具体情况”在流媒体上发布大电影", "title_en": "Disney Will Release Big Movies on Streaming 'On a Case-by-Case Basis'", "transed": 1, "url": "https://www.inverse.com/entertainment/mulan-black-widow-disney-plus-release-date", "via": "", "real_tags": ["发布", "电影", "具体情况", "case", "迪士尼"]}, {"category": "", "categoryclass": "", "imagename": "cc0ee3ed6fe9992b094d9cbcd4d2c456.jpg", "infoid": 1000973, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "弗洛里安·施耐德去世，享年73岁。他是这家颇具影响力的德国电子音乐集团的联合创始人和键盘手。\n“Kraftwerk的联合创始人和电气先驱Ralf Hütter给我们带来了一个非常令人难过的消息，他的朋友和同伴几十年来一直在为他工作。弗洛里安·施耐德73岁生日刚过几天，就死于一场短暂的癌症。“乐队在一份声明中说。\n1968年，拉尔夫·胡特和弗洛里安·施耐德开始了他们的艺术和音乐合作。1970年，他们在杜塞尔多夫建立了他们的电子Kling Klang工作室，并开始了多媒体项目Kraftwerk。Kraftwerk的所有目录专辑都是在那里构思和制作的。“。\nKraftwerk由Schneider和Ralf Hütter于20世纪60年代末成立，他对键盘和合成器的开创性使用后来激励了音乐谱系中所有流派的艺术家，从摇滚和电子音乐到嘻哈和流行音乐。\n虽然在七八十年代经历了无数的阵容变化，但施耐德和胡特的合作伙伴关系仍然是该集团的创意支柱。两人与著名的Krautrock制作人康尼·普兰克(Conny Plank)一起录制了三张专辑-1970年的Kraftwerk，1971年的Kraftwerk 2和1973年的Ralf und Florian-但Kraftwerk认为他们1974年的专辑Autobahn是他们著名目录的真正开始，这张专辑为乐队赢得了2014年格莱美终身成就奖。\n在Autobahn上，施耐德和胡特固化了克拉夫特沃克的声音：催眠般地循环重复的节拍、合成器和声音编码的人声，创造出无限的音景，就像有影响力的主题曲一样，可以跨越唱片的整个侧面。\n现在，卡尔·巴托斯(Karl Bartos)和沃尔夫冈·弗卢尔(Wolfgang Flur)加入了电子打击乐的行列，他们在杜塞尔多夫的Kling Klang工作室是他们的官方前哨，Kraftwerk接下来发行了1975年的Radio-Activity和1977年的Trans-Europe Express；后一张专辑的灵感来自大卫·鲍伊(David Bowie)1976年的LP Station to Station，以及鲍伊和伊基·波普(Iggy Pop)对克林克林访问的抒情回忆-将促进两位艺术家之间的相互钦佩，鲍伊的英雄。\n在进军合成器之前，施耐德是一名长笛演奏家。弗洛里安来自长笛，我们在同一所学校，他在古典乐团，但当时他已经在用均衡器、延迟和模糊盒等小玩意儿来操纵声音了。结果听起来像是电子化的，但它根本不是电脑或合成器，“曾经是克拉夫特沃克的成员，也是Neu的创建者！吉他手迈克尔·罗瑟(Michael Rther)在2016年告诉UnCut。\n虽然胡特是克拉夫特沃克的代言人和代言人，但臭名昭著的害羞施耐德--德国波恩机场的设计者、建筑师保罗·施耐德-埃斯莱本(Paul Schneider-Esleben)的儿子--被认为是带领乐队走向极限的功臣。“弗洛里安是一个健全的恋物癖。我不是，我可能更像是一个词迷，“胡特在2005年告诉Mojo。“这些角色不是一种义务，它们只是多年来根据我们的喜好而发展起来的。”\n作为电子流行的鼻祖，克拉夫特沃克用两张专辑-1978年的“人机”(The Man-Machine)和1981年的“电脑世界”(Computer World)-辜负了他们的声誉，这两张专辑倾向于他们近乎机器人的阴谋；2005年，在克拉夫特沃克的许可下，酷玩乐队(Coldplay)为乐队的热门歌曲“Talk”重组了后一张专辑的“Computer Love”。施耐德和胡特对自行车的共同热爱接下来导致了1983年的单曲“环法自行车赛”；两人将一起重温他们最后一张录音室专辑的主题，2003年的环法自行车赛配乐。五年后，施耐德离开了克拉夫特沃克，留下胡特作为乐队唯一的成员。\n在音乐上领先于他们的时代，这支乐队在70年代中期在美国巡回演出时并没有受到美国观众的欢迎，而且经常被误解。然而，Kraftwerk的影响遍及整个音乐领域：Afrika Bambaataa 1982年的开创性单曲“星球摇滚”(Planet Rock)直接受到了Kraftwerk的“数字”(Numbers)和“跨欧快车”(Trans-Europe Express)的影响，后者的曲目也被德雷博士在Jay-Z合作的“压力之下”(Under Stress)中使用。在接下来的几十年里，该团体将经常受到嘻哈乐队的抽样调查，导致一场里程碑式的商标诉讼。\n2019年，克拉夫特沃克被提名为摇滚名人堂成员，尽管该乐队没有被选为2020届的一部分。", "note_en": "Florian Schneider, co-founder and keyboardist of the influential German electronic music group  , has died at the age of 73.\n “Kraftwerk co-founder and electro pioneer Ralf Hütter has sent us the very sad news that his friend and companion over many decades. Florian Schneider has passed away from a short cancer disease just a few days after his 73rd birthday,” the band said in a statement.\n “In the year 1968 Ralf Hütter and Florian Schneider started their artistic and musical collaboration. In 1970 they founded their electronic Kling Klang studio in Düsseldorf and started the multi-media project Kraftwerk. All the Kraftwerk catalogue albums were conceived and produced there.”\n Formed by Schneider and Ralf Hütter in the late Sixties, Kraftwerk’s pioneering use of keyboards and synthesizers would later inspire artists in all genres of the musical spectrum, from rock and electronic music to hip-hop and pop.\n While undergoing numerous lineup changes over Seventies and Eighties, the partnership of Schneider and Hütter remained the group’s creative backbone.  The duo recorded three albums alongside famed Krautrock producer Conny Plank — 1970’s  Kraftwerk, 1971’s  Kraftwerk 2 and 1973’s  Ralf und Florian — but Kraftwerk considered their 1974 album  Autobahn to be the true start of their famed catalogue, which earned the group a Grammy Lifetime Achievement Award in 2014.\n  On  Autobahn, Schneider and Hütter solidified the Kraftwerk sound: Hypnotically looping and repetitive beats and synths and vocoded vocals to create boundless soundscapes that, like in the case of the influential title track, could span the entire side of a record.\n  Now joined by Karl Bartos and Wolfgang Flur on electronic percussion, with their Kling Klang studio in Dusseldorf their official outpost, Kraftwerk next released 1975’s  Radio-Activity and 1977’s  Trans-Europe Express; the latter album – inspired by David Bowie’s 1976 LP  Station to Station and lyrically reminisces about a Kling Kling visit by Bowie and Iggy Pop – would foster a mutual admiration between the two artists, with Bowie’s  Heroes track “V-2 Schneider” an ode to the Kraftwerk keyboardist.\n Prior to his forays into synthesizers, Schneider was a flautist.  “Florian came from the flute, we were at the same school and he was in the classical orchestra, but at that time he was already manipulating sound with gadgets like equalizer, delay and fuzzbox. The results sounded electronic, but it was not anything near computers or synthesizers,” one-time Kraftwerk member and founding Neu! guitarist Michael Rother  told  Uncut in 2016.\n While Hütter was the voice and mouthpiece of Kraftwerk, the notoriously press-shy Schneider  — the son of the architect Paul Schneider-Esleben, who designed Germany’s Bonn Airport —  is credited with navigating the band toward its boundary-pushing limits.  “Florian is a sound fetishist. I am not so much, I’m maybe more a word fetishist,” Hütter told  Mojo in 2005. “These roles are not an obligation, they have just developed over the years as our preferences.”\n As the progenitors of electronic-pop, Kraftwerk lived up to their reputation with a pair of albums — 1978’s  The Man-Machine and 1981’s  Computer World — that leaned into their almost-robotic machinations; in 2005, Coldplay, with permission from Kraftwerk, retooled the latter album’s “Computer Love” for the band’s hit “Talk.” Schneider and Hütter’s joint love of cycling would next result in the 1983 single “Tour de France”; the duo would revisit the theme for their final studio album together, 2003’s  Tour de France Soundtracks. Five years later, Schneider left Kraftwerk, leaving Hütter as the band’s only remaining member.\n Ahead of their time musically, the band was not embraced and often misunderstood by American audiences upon touring the U.S. in the mid-Seventies. However, Kraftwerk’s impact traversed the musical spectrum: Afrika Bambaataa’s groundbreaking 1982 single “Planet Rock” was directly influenced by Kraftwerk’s “Numbers” and “Trans-Europe Express,” with the latter track also employed by Dr. Dre on the Jay-Z collaboration “Under Pressure.” The group would frequently be sampled by hip-hop acts over the ensuing decades, leading to  a landmark trademark lawsuit.\n  In 2019, Kraftwerk was nominated for the Rock and Roll Hall of Fame, although the group was not selected as part of the Class of 2020.", "posttime": "2020-05-07 01:42:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "联合,founder,乐队", "title": "克拉夫特沃克联合创始人弗洛里安·施耐德去世，享年73岁", "title_en": "Kraftwerk Co-Founder Florian Schneider Dead at 73", "transed": 1, "url": "https://www.rollingstone.com/music/music-news/kraftwerk-florian-schneider-dead-994735/", "via": "", "real_tags": ["联合", "founder", "乐队"]}, {"category": "", "categoryclass": "", "imagename": "5b3e8105511d42fe3850911e158b25bc.jpg", "infoid": 1000972, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "耶鲁大学的一组科学家在死猪的脑细胞中检测到电活动。意想不到的结果引发了关于细胞死亡意味着什么的问题。\n没有氧气的器官不会存活，然而由耶鲁大学Nenad Sestan博士领导的一组研究人员挑战了这一普遍的教条。他们研究了在屠宰场被杀的猪的死脑，看看当注射一种类似血液的物质时，死亡细胞是否可以被重新激活。2019年4月发表的这一令人惊讶的结果显示，细胞可以重新激活，大脑本身在被认为死亡10小时后仍然正常工作。\n“当我们开始这项研究的时候，我们真的从来没有想过我们会走到这一步，”神经科学研究员、发表在“自然”杂志上的这篇论文的作者之一内纳德·塞斯坦博士(Dr Nenad Sestan)说。\n没有氧气的身体会迅速褪色和死亡，因此没有氧气的大脑也会走上同样的道路。一旦脑细胞停止接受氧气，组织就会迅速退化，丧失功能，细胞死亡。\n然而，几项研究表明，脑死亡并不像我们曾经认为的那样发生。以前的研究报告说，在细胞被认为死亡后，死亡脑细胞中的线粒体(细胞的动力库)仍在工作。对哺乳动物的其他研究表明，在没有氧气的情况下，细胞在接受氧气供应的情况下仍然可以恢复。\n因此，问题就产生了。一旦没有氧气，脑细胞就会死亡吗？我们能通过输送营养物质和氧气来恢复细胞的活动吗？Nenad Sestan博士和他的团队想要回答这些问题，所以他们向死亡的脑细胞注入氧气和营养物质，看看它们是否可以重新激活。\n研究小组使用了一种名为BrainEx的系统，这是一种向死亡的大脑泵入氧气的设备。在收集大脑四个小时后，研究人员将它们连接到设备上，并保持氧基液体循环六个小时。这样，在脑死亡10小时后，他们终于可以观察这些细胞，并了解BrainEx是否恢复了某些细胞功能。为了得到准确的结论，科学家们将接受Brain Ex机器供应的大脑与接受虚假供应的大脑(即控制组)进行了比较。\n塞斯坦博士的团队能够恢复以前被认为是死亡的细胞中的生命，他们通过简单地观察细胞正在做什么来理解他们的结果：\n“我们能证明的是大脑，也就是细胞，正在消耗氧气…。正在生产二氧化碳…。所以这是一个明显的迹象，表明这些细胞是活的，“塞斯坦博士说。\n结果还显示，连接到BrainEx系统的大脑解剖结构完好无损。即使是最敏感的区域也保持着功能结构。动脉和毛细血管也在工作，神经系统的主要细胞(称为神经元)状态良好。下图中可以看到正常的死脑和BrainEx脑之间的比较(移动灰色滑块)。\n最后，在意识到大脑在死后10小时仍然高度正常后，科学家们进行了最后一次测试。他们寻找电活动，这是意识的迹象。\n这种方法具有伦理含义。恢复意识意味着大脑可以“感觉”到疼痛，所以研究小组准备好了，如果他们发现任何复苏的迹象，就会关闭实验。然而，在测试后，他们发现了轻微的电活动，这不足以让大脑有意识或有意识。\n简单地说，大脑不是活的，但它的细胞也没有死，正如塞斯坦博士进一步解释的那样：“在细胞层面，这些大脑非常接近于活着，但如果我们把大脑的生命看作是大脑功能的表达，那么它们离活着就很远了。”\n当谈到对大脑的了解时，科学家们要么研究死亡的大脑，要么研究活着的大脑的模拟。直到现在。\n研究人员现在可以通过将死脑连接到BrainEx系统来研究活脑的特写版本。这种研究大脑的新奇模型可能会开启新的可能性。伦敦帝国理工学院神经科学教授Simone Di Giovanni进一步表示，“这可能是我们未来可以探索的东西，以了解疾病的细胞和分子机制。”\n尽管可能性还在前面，塞斯坦博士仍然想要了解在连接到BrainEx的过程中，脑细胞可以活跃多长时间。毕竟，细胞在死后10小时是正常的，但15小时后它们还能活跃吗？仍然需要研究来了解门槛。“可以想象，我们只是在预防不可避免的事情，而大脑将无法恢复，”塞斯坦博士说。“我们只飞了几百米，但我们真的能飞吗？”", "note_en": "A team of scientists from Yale University detected electrical activity in brain cells from dead pigs. The unexpected results raise questions about what it means for a cell to be dead.\n Organs without oxygen do not survive, yet a team of researchers led by Dr Nenad Sestan at Yale University challenged this universal dogma. They studied dead brains from pigs that had been killed in an abattoir, to see whether dead cells can be reactivated when injected with a blood-like substance. The surprising results, published in April 2019, showed that cells could be reactivated and the brain itself was still functional 10 hours after being considered dead.\n “When we started this study, we really never imagined we would get to this point,” said Dr Nenad Sestan, neuroscience researcher and one of the authors of the paper published in    Nature .\n  A body without oxygen rapidly fades and dies, thus a brain with no oxygen follows the same path. As soon as brain cells stop receiving oxygen, tissue quickly deteriorates, loses function, and cells die.\n However, several studies have shown that brain death does not happen as we once thought. Previous research reported that mitochondria (the powerhouses of the cell) in dead brain cells were still working after the cells were considered dead. Other studies in mammals showed that after one hour without oxygen, cells could still recover if they received a supply of oxygen.\n Thus, questions arise. Do brain cells die once there’s no oxygen? Could we recover a cell’s activity by pumping nutrients and oxygen? Dr Nenad Sestan and his team wanted to answer these questions, so they injected oxygen and nutrients into dead brain cells to see if they could be reactivated.\n  The team used a system called   BrainEx  – a device to pump oxygen into the dead brain. Four hours after collecting the brains, researchers connected them to the device and maintained an oxygen-based fluid circulating for six hours. This way, 10 hours after brain death they could finally look at the cells and understand whether the   BrainEx  restored some cell function. To get accurate conclusions, scientists compared brains that received the supply from the   Brain Ex  machine and brains that received a fake supply, known as the control group.\n  Dr Sestan’s team was able to restore life in cells that had previously been considered dead, and they understood their results by simply looking at what cells were doing:\n “What we can show is that the brain, and that is the cells, are consuming oxygen… and are producing CO 2 … so it’s a clear sign that these cells are alive,” said Dr Sestan.\n The results also showed that the anatomy of the brains that had been connected to the   BrainEx  system was intact. Even the most sensitive regions kept a functional structure. The arteries and capillaries were working too, and the main cells of the nervous system (known as neurons) were in good shape. A comparison between a normal dead brain and a   BrainEx  brain can be seen in the figure below (move the grey slider).\n   Finally, after realising that the brain was still highly functional 10 hours after death, the scientists made one last test. They searched for electrical activity, a sign of  consciousness .\n This approach had ethical implications. Bringing back  consciousness  means the brain could “feel” pain, so the team was ready to shut down the experiment if they found any sign of resuscitation. However, after testing, they found minor electrical activity, which was not enough for the brain to be conscious or aware.\n Putting it simply, the brain was not alive, yet its cells were not dead either, as Dr Sestan further explained: “At the cellular level, these brains are very close to being alive, but if we consider the life of the brain as the expression of the functionality of the brain, then they’re very far from being alive.”\n  When it comes to learning about the brain, the scientists were stuck with studying either dead brains or simulations of living brains. Until now.\n Researchers could now study a close-up version of the living brain by connecting dead brains to the   BrainEx  system. This novel model to study the brain could unlock new possibilities. Simone Di Giovanni,  a professor of neuroscience at Imperial College London, states further that, “ This can be something that we could explore in the future to understand cellular and molecular mechanisms of disease.”\n Even though possibilities are ahead, Dr Sestan still wants to understand how long the brain cells could be active while plugged to the   BrainEx . After all, cells were functional 10 hours after death, but could they still be active after 15 hours? Research is still needed to understand the  threshold. “It is conceivable we are just preventing the inevitable, and the brain won’t be able to recover,” Dr Sestan says. “We just flew a few hundred metres, but can we really fly?”", "posttime": "2020-05-07 01:28:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,死亡,find,大脑", "title": "科学家在死亡的脑细胞中发现生命", "title_en": "Scientists find life in dead brain cells", "transed": 1, "url": "http://forgetoday.com/2020/05/03/scientists-find-life-in-dead-brain-cells/", "via": "", "real_tags": ["科学家", "死亡", "find", "大脑"]}, {"category": "", "categoryclass": "", "imagename": "69b98cb4efe49d1a13210cb81cc4c740.jpg", "infoid": 1000971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "极具影响力的电子流行乐队Kraftwerk的联合创始人弗洛里安·施耐德去世，享年73岁。\n这个德国四重奏在20世纪70年代和80年代用Autobahn和The Model等歌曲为合成器音乐设定了模板。\n他们既实现了音乐创新，又取得了商业上的成功，并激励了从电子音乐到嘻哈等各种流派的数十名艺术家。\n米奇·尤尔形容施耐德超前于他的时代，而歌手埃德温·柯林斯则用“他是上帝”来概括。\n施耐德于1970年与拉尔夫·胡特(Ralf Hütter)共同组建了该集团，并一直是该集团的成员，直到2008年离职。\n一份声明说，他73岁生日刚过几天就死于一场短暂的癌症。\n音乐界的悼念之声此起彼伏。斯潘道芭蕾舞团的加里·肯普说，施耐德对我们所知道的许多音乐都产生了如此重要的影响，并为我们所有人打造了一个新的音乐大都会。\n杜兰杜兰键盘手尼克·罗兹(Nick Rhodes)记得听过Autobahn，它听起来与收音机里的其他东西有多么根本的不同。\n它激发了我对他们的创新和创造力的毕生钦佩，他们对当代音乐的影响深深地编织在我们的流行文化结构中，他写道。\nOMD表示，他们听到这个消息后都悲痛欲绝，让-米歇尔·贾尔也表达了敬意。\n受克拉夫特沃克影响的艺术家名单很长，其中包括大卫·鲍伊(David Bowie)，他在“英雄”(Heroes)专辑中以施耐德的名字为曲目V-2施耐德(V-2 Schneider)命名；以及Depeche Mode、New Order和Daft Punk。\n酷玩乐队在他们的热门演讲中使用了Kraftwerk&#39；的“电脑之恋”中的一段，而Jay-Z和Dr Dre则借用了泛欧快递的歌曲“压力之下”。据说克拉夫特沃克拒绝了想要合作的迈克尔·杰克逊。\n该乐队最初在英国音乐媒体中面临阻力，但后来在音乐创新和商业成功两方面都取得了成功。\n他们在1975年突破了催眠的高速公路，并在1981年凭借双A面单曲The Model/Computer Love登上了英国第一的宝座。\n甚至连克拉夫特沃克的形象也是机械的--在20世纪70年代，他们开始把自己描绘成机器人形象，穿得一模一样，站在舞台上的键盘后面排成一排。\n随着引人注目的专辑封面增加了他们的视觉冲击力，他们的艺术和音乐身份导致了一系列广受好评的常驻画廊，比如纽约的Moma和伦敦的泰特现代美术馆(Tate Modern)。\n施耐德那时已经离开了。他和胡特仍然是出了名的神秘，但胡特在2009年告诉“卫报”，他的乐队成员已经很多年没有真正参与到克拉夫特沃克了。\n在70年代中期，乐队对他们所谓的机器人流行音乐的忠诚，通过EDM和电子音乐为从嘻哈到家庭音乐的一切设定了声音模板。\n电子音乐以前就存在过--从德尔·香农(Del Shannon)的“逃跑”(Runaway)中的军管独奏，到1963年由英国广播公司(BBC)无线电工作坊录制的“神秘博士”(Doctor Who)这首令人心旷神怡的主题曲。\n但Kraftwerk开发了一种新的音乐词汇，雕刻了催眠的低频声音，庆祝欧洲浪漫的过去，并期待着它闪闪发光的未来。\n在Facebook或Twitter@BBCNewsEnts上关注我们。如果您有故事建议，请发送电子邮件至Entertainment.news@bbc.co.uk。", "note_en": "Florian Schneider, co-founder of highly influential electronic pop group Kraftwerk, has died at the age of 73.\n The German quartet set the template for synthesiser music in the 1970s and 80s with songs like Autobahn and The Model.\n They achieved both musical innovation and commercial success, and inspired scores of artists across genres ranging from techno to hip-hop.\n Midge Ure described Schneider as &#34;way ahead of his time&#34;, while singer  Edwyn Collins summed it up with: &#34;He&#39;s God&#34;.\n Schneider formed the group with Ralf Hütter in 1970, and remained a member until his departure in 2008.\n  A statement said he &#34;passed away from a short cancer disease just a few days after his 73rd birthday&#34;.\n  Tributes flowed from the music world. Spandau Ballet&#39;s Gary Kemp said Schneider was &#34;such an important influence upon so much of the music we know&#34;, and had forged &#34;a new Metropolis of music for us all to live in&#34;.\n   Duran Duran keyboardist Nick Rhodes remembered hearing Autobahn and &#34;how radically different it sounded from everything else on the radio&#34;.\n It &#34;sparked my lifelong admiration for their innovation and creativity&#34;, and the group&#39;s &#34;influence on contemporary music is deeply woven into the fabric of our pop culture&#34;, he wrote.\n OMD said they were &#34;absolutely devastated&#34; at the news, and Jean-Michel Jarre also paid tribute.\n     The long list of artists to have been influenced by Kraftwerk included David Bowie, who named the track V-2 Schneider on his Heroes album after Schneider; as well Depeche Mode, New Order and Daft Punk.\n Coldplay used a section from Kraftwerk&#39;s Computer Love in their hit Talk, while Jay-Z and Dr Dre borrowed from Trans Europe Express for their track Under Pressure. Kraftwerk reputedly turned down Michael Jackson, who wanted to collaborate.\n  The group faced resistance in the British music press at first, but went on to achieve both musical innovation and commercial success.\n They broke through with the hypnotic Autobahn in 1975, and went to number one in the UK with the double A-side single The Model/Computer Love in 1981.\n Even Kraftwerk&#39;s image was mechanical - during the 1970s, they began to portray themselves as robotic figures, dressed identically and standing in a row behind keyboards on stage.\n  With striking album covers adding to their visual impact, their artistic as well as musical identity led to a series of acclaimed residencies in galleries like New York&#39;s Moma and the Tate Modern in London in the 2010s.\n Schneider had left by then. He and Hütter remained famously enigmatic, but  Hütter told The Guardian in 2009 his bandmate had not been &#34;really involved in Kraftwerk for many, many years&#34;.\n    During the mid-70s, the band&#39;s allegiance to what they called &#34;robot pop&#34; set the sonic template for everything from hip-hop to house music via EDM and techno.\n  Electronic music had existed before - from the musitron solo on Del Shannon&#39;s Runaway to the mind-expanding Doctor Who theme, recorded by the BBC&#39;s Radiophonic Workshop in 1963.\n But Kraftwerk developed a new musical vocabulary, sculpting hypnotic, low-frequency sounds that celebrated Europe&#39;s romantic past, and looked forward to its shimmering future.\n  Follow us on  Facebook , or on Twitter  @BBCNewsEnts . If you have a story suggestion email    entertainment.news@bbc.co.uk .", "posttime": "2020-05-07 01:28:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "施耐德,founder,音乐", "title": "克拉夫特沃克创始人弗洛里安·施耐德逝世，享年73岁", "title_en": "Kraftwerk founder Florian Schneider dies at 73", "transed": 1, "url": "https://www.bbc.co.uk/news/entertainment-arts-52564281", "via": "", "real_tags": ["施耐德", "founder", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "376115dbd750887ca08cbce63ecbc182.jpg", "infoid": 1000970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于开发者来说，GitHub发布了一个重要的公告，它推出了Codespaces--一个可以让你直接在网络上编写代码的功能。可以将其视为云上的虚拟集成开发环境(IDE)。\n早些时候，要为项目做出贡献，您需要发出拉取请求，并根据项目的要求在本地计算机上设置环境。有了Codespaces，您就不再需要这样做了。只要你点击代码按钮，网站就会在几秒钟内设置好环境。\nGitHub产品高级副总裁Shanku Niyoi表示，您也可以根据需要配置CodeSpace：\n可以将代码空间配置为加载您的代码和依赖项、开发人员工具、扩展和点文件。在环境之间切换很简单-您可以随时导航离开，当您切换回来时，您的CodeSpace会自动重新打开。\n产品管理高级总监马里奥·罗德里格斯(Mario Rodriguez)在一次电话会议上告诉TNW，这个想法是为了降低开发者为该项目做出贡献的门槛。代码空间将是在Azure上运行的完整VS代码编辑器的基于浏览器的版本。您还可以添加您通常使用的任何插件。\nRodriguez补充说，您可以随心所欲地设置这些代码空间，并且同一项目可以有多个配置。\n除了Codespaces，GitHub还推出了讨论，这是一个类似论坛的功能，位于您的项目下，允许其他人与您和其他贡献者互动。您还可以将常见问题解答或其他协作文档作为单独的线索进行维护。到目前为止，这些对话只在“问题”和“拉取请求”标签下进行。\nGitHub也有一套社区指南，为讨论中允许的内容定下基调。此外，它还为用户提供了报告有害行为的工具。\nGitHub与许多社区的讨论目前处于测试阶段，包括Vercel(前身为Zeit)、Prisma、Reaction Table和Reaction Query。\nCodespaces还提供免费的公测版本。该公司表示，虽然代码空间IDE中的代码编辑功能将永远是免费的，但它计划通过为密集任务(如构建)添加即付即用模式来向开发人员收费。\n阅读我们关于科技行业如何应对冠状病毒的每日报道，并订阅我们的每周时事通讯“冠状病毒”(CoronaVirus)。\n有关远程工作的提示和诀窍，请在此处查看我们的增长季度文章或在Twitter上关注我们。", "note_en": "In a major announcement for developers, GitHub has launched Codespaces — a feature that lets you code directly on the web. Think of this as a virtual  Integrated Development Environment (IDE) on the cloud.\n Earlier, to contribute to a project you would need to make a pull request, and set up the environment on your local machine according to the requirements of a project. With Codespaces, you don’t need to do that anymore. As soon as you click on the code button, the website sets up the environment in seconds.\n    Shanku Niyogi, SVP of Product, GitHub, said you can also configure codespace according to your need:\n Codespaces can be configured to load your code and dependencies, developer tools, extensions, and dotfiles. Switching between environments is simple—you can navigate away at any time, and when you switch back, your codespace is automatically reopened.\n Mario Rodriguez, Senior Director of Product Management, told TNW on a call that the idea is to lower the barrier for developers for contributing to the project. The Codespaces will a browser-based version of the full VS Code editor running on Azure. You’ll also be able to add any plugins your use normally.\n Rodriguez added that you can set up these Codespaces anyway you like, and you can have multiple configurations for the same project.\n In addition to Codespaces, GitHub is also launching Discussions, a forum-like feature that lives under your project that allows others to engage with you and other contributors. You can also maintain FAQs or other collaborative documents as separate threads. Until now, these conversations took place only under ‘issues’ and ‘pull requests’ tabs.\n  GitHub also has a set of  community guidelines to set a tone for what’s allowed under Discussions. Plus, it gives users tools to report harmful behavior.\n GitHub Discussions is currently in beta with a number of communities, including Vercel (formerly Zeit), Prisma, React Table, and React Query.\n Codespaces is also available as a public beta for free. The company said that while code-editing functionality in the codespaces IDE will always be free, it plans to charge developers through adding pay-as-you-go models for intensive tasks such as builds.\n  Read our  daily coverage on how the tech industry is responding to the coronavirus and subscribe to our weekly newsletter  Coronavirus in Context.\n  For tips and tricks on working remotely, check out our Growth Quarters articles  here or follow us on  Twitter.", "posttime": "2020-05-07 01:02:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "github,代码,codespaces", "title": "GitHub代码空间允许您在浏览器中编写代码，无需任何设置", "title_en": "GitHub Codespaces Lets You Code in Your Browser Without Any Setup", "transed": 1, "url": "https://thenextweb.com/dd/2020/05/06/github-codespace-lets-you-code-in-your-browser-without-any-setup/", "via": "", "real_tags": ["github", "代码"]}, {"category": "", "categoryclass": "", "imagename": "e05bbb6c0ac01ea06d5c1dcee6169416.png", "infoid": 1000969, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Anvil是一个只用Python构建全栈Web应用的平台。无需纠结于JS、HTML、CSS、Python、SQL及其所有框架--只需用Python构建即可。\n是-在浏览器中运行的Python。在服务器上运行的Python。构建UI的Python。拖放式UI编辑器。我们甚至有一个内置的Python数据库，以防您没有自己的数据库。太整洁了！\n但是，一旦您构建了Web应用程序，您就需要将其部署到某个地方。当然，您可以与我们一起部署您的应用程序，但有时您希望自己托管它。也许您正在为没有良好互联网接入的远程医疗机构提供服务。也许您正在用您的树莓PI构建一个IoT设备。或者，如果陨石击中我们的数据中心，或者我们遭到一群路过的风险资本家的抢劫，或许你只是想要安全。\n我为电视台制作软件。当你在直播的时候，节目必须继续-无论有没有网络！\n使用开源App Server，我可以构建不依赖互联网连接的应用程序-这很棒，因为Anvil是我遇到过的开发速度最快的工具。\nAnvil Runtime现在可以在GitHub上获得，它是支持我们的托管服务的开源引擎。它为您的应用程序提供服务，启动和管理您的服务器代码，验证您的用户，渲染您的PDF…。所有这些美好的事物。我们把它作为一个库(嗯，一组库)开源。\nAnvil应用服务器，现在也在GitHub上，是一个独立的服务器，也是在你自己的电脑上托管Anvil应用的最简单的方式。\n我很高兴你这么问！Anvil App Server在PyPI上可用，因此您可以使用三个命令创建和提供示例应用程序：\n当然，如果您已经使用Anvil Editor构建了一个应用程序，您可以使用Git检查并运行它！这里有一个分步指南：Anvil App Server入门。\n在下载Anvil App Server的一个小时内，我就可以通过手机上的Web应用程序安全地控制我家周围的设备了。\n不要啊！App Server内置Postgres，默认情况下将在.anvil-data/目录中设置一个新的私有数据库。\n问得好-安全对于公共互联网上的任何应用程序都很重要！幸运的是，App Server可以使用We‘s Encrypt，所以您只需要：\n我打赌你会的。查看源树中的自述文件：\n实际上，这相当容易-而且我们的在线编辑器是免费使用的！从我们的分步教程开始，或查看我们的全尺寸示例应用程序：\n最后：如果您有任何问题，或者需要帮助，请加入我们的Anvil社区论坛！我们期待着在那里与您见面。", "note_en": "Anvil is a platform for building full-stack web apps with nothing but Python. No need to wrestle with JS, HTML, CSS, Python, SQL and all their frameworks – just build it all in Python.\n Yes – Python that  runs in the browser. Python that  runs on the server. Python that  builds your UI. A  drag-and-drop UI editor. We even have a built-in  Python database, in case you don’t have your own. It’s neat!\n But once you’ve built your web app, you need to deploy it somewhere. You can  deploy your app with us, of course, but sometimes you want to host it yourself. Perhaps you’re serving a remote medical facility without good Internet access. Perhaps you’re building an IoT device with your Raspberry Pi. Or perhaps you just want to be safe if a meteorite hits our datacentre, or if we get mugged by a passing gang of venture capitalists.\n  I build software for TV stations. When you’re on air, the show must go on – internet or no internet!\n With the open-source App Server, I can build applications that don’t depend on an internet connection – which is great, because Anvil is the fastest tool I’ve ever encountered for development.\n    The Anvil Runtime,  now available on GitHub, is the open-source engine that powers our hosting service. It serves your apps, launches and manages your server code, authenticates your users, renders your PDFs…all those good things. We have open-sourced it as a library (well, a set of libraries).\n  The Anvil App Server,  also now on GitHub, is a standalone server and the easiest way to host an Anvil app on your own computer.\n   I’m glad you asked! The Anvil App Server is available  on PyPI, so you can create and serve a sample app with three commands:\n  Of course, if you’ve already built an app with the Anvil Editor, you can  check it out with Git and run it! Here’s a step-by-step guide:  Getting Started with the Anvil App Server.\n Within an hour of downloading the Anvil App Server, I was securely controlling devices around my home from a web app on my phone.\n  Nope! The App Server comes with  Postgres built in, and by default will set up a new, private database in the  .anvil-data/ directory.\n  Good question – security is important for any app on the public Internet! Fortunately, the App Server works with  Let’s Encrypt, so all you need is:\n      I bet you do. Take a look at the README file in the source tree:\n    It’s pretty easy, actually – and our online editor is  free to use! Start with our step-by-step tutorials, or check our our full-size example apps:\n  Finally: If you have any questions, or need a hand, please join us in the  Anvil Community Forum! We look forward to meeting you there.", "posttime": "2020-05-07 01:00:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,app,anvil,sourcing", "title": "Open Sourcing the Anvil App Server(开源Anvil应用服务器)", "title_en": "Open Sourcing the Anvil App Server", "transed": 1, "url": "https://anvil.works/blog/open-source", "via": "", "real_tags": ["开源", "app", "anvil", "sourcing"]}, {"category": "", "categoryclass": "", "imagename": "31acaec76243d59e423f7219b87ab641.jpg", "infoid": 1000968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook推出了一款新的聊天机器人，声称能够展示同理心、知识和个性。\nBlender&#34；使用可用的公共领域对话进行培训，其中包括15亿个人类交流实例。\n这家社交媒体巨头表示，与另一名人类相比，49%的人更喜欢与聊天机器人互动。\n但专家表示，使用Reddit等平台训练人工智能(AI)有其缺点。\n在更长的谈话中出现了许多问题。Blender有时会用攻击性的语言回应，而在其他时候，它会完全捏造事实。\nFacebook的一位发言人表示：我们认为，发布模型对于全面、可靠地洞察它们的能力至关重要。\n咨询公司The Envisioners的首席执行官、人工智能专家戴夫·科普林(Dave Coplin)表示，Blender是朝着正确方向迈出的一步，但他指出，仍有两个根本问题需要克服。\n他告诉BBC，首先，复制人类属性的所有细微差别是多么复杂，比如举行对话的能力，这是大多数三岁孩子都能掌握的技能。\n第二个问题是与用于训练模型的数据和模型生成的结果之间的关系。\n像Reddit这样伟大的平台，根据你在那里发现的对话来训练算法，会让你在麦子里得到很多无聊的东西。\n它向人们展示了两组对话，一组是与Blender进行的，另一组是与Meena进行的。\n我们通过一种新的聊天机器人配方实现了这一里程碑，其中包括改进的解码技术，新颖的技能融合，以及拥有94亿参数的模型，这是现有最大系统的3.6倍。\n这是第一个将多种会话技能融合在一个系统中的聊天机器人。\n构建一个真正智能的、可以像人类一样聊天的对话代理仍然是当今人工智能领域最大的开放挑战之一。", "note_en": "Facebook has launched a new chatbot that it claims is able to demonstrate empathy, knowledge and personality.\n &#34;Blender&#34; was trained using available public domain conversations which included 1.5 billion examples of human exchanges.\n The social media giant said 49% of people preferred interactions with the chatbot, compared with another human.\n But experts say training the artificial intelligence (AI) using a platform such as Reddit has its drawbacks.\n Numerous issues arose during longer conversations. Blender would sometimes respond with offensive language, and at other times it would make up facts altogether.\n   &#34;We believe that releasing models is essential to enable full, reliable insights into their capabilities,&#34; a Facebook spokesperson said.\n  Artificial Intelligence expert Dave Coplin, chief executive of consultancy The Envisioners, said that Blender was a &#34;step in the right direction,&#34; but noted two fundamental issues that still need to be overcome.\n &#34;The first is just how complex it is to replicate all of the nuances of a human attribute, like the ability to hold a conversation, a skill that most three-year-olds can master,&#34; he told the BBC.\n &#34;The second is around the relationship with the data used to train the model and the results generated by the model.\n &#34;As great a platform as Reddit is, training algorithms based on the conversations you find there is going to get you a lot of chaff amongst the wheat.&#34;\n   It showed people two sets of conversations, one made with Blender and the other with Meena.\n   &#34;We achieved this milestone through a new chatbot recipe that includes improved decoding techniques, novel blending of skills, and a model with 9.4 billion parameters, which is 3.6x more than the largest existing system.\n &#34;This is the first chatbot to blend a diverse set of conversational skills together in one system.&#34;\n &#34;Building a truly intelligent dialogue agent that can chat like a human remains one of the largest open challenges in AI today.&#34;", "posttime": "2020-05-07 00:47:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,facebook,帖子,reddit,表示", "title": "Facebook使用15亿Reddit帖子创建聊天机器人", "title_en": "Facebook uses 1.5bn Reddit posts to create chatbot", "transed": 1, "url": "https://www.bbc.com/news/technology-52532930", "via": "", "real_tags": ["机器人", "facebook", "帖子", "reddit", "表示"]}, {"category": "", "categoryclass": "", "imagename": "513a2fe403a179cd13970f0e76bdc69e.png", "infoid": 1000967, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是人们构建软件的地方。超过5000万人使用GitHub发现、派生和贡献超过1亿个项目。", "note_en": "GitHub is where people build software. More than 50 million people use GitHub to discover, fork, and contribute to over 100 million projects.", "posttime": "2020-05-07 00:47:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,代码", "title": "GitHub代码扫描", "title_en": "GitHub Codescanning", "transed": 1, "url": "https://github.com/features/security/advanced-security/signup", "via": "", "real_tags": ["github", "代码"]}, {"category": "", "categoryclass": "", "imagename": "eb4c4710a59f4cab117b0adfc827a023.jpeg", "infoid": 1000965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三个月前，我申请了一家游戏工作室。并不是说我很配，但人口统计数据对我有利：在我的地理位置上，很少有开发人员拥有C++、C#、Node JS和Mobile开发技术的致命组合。\n在我长达20年的职业生涯中，我一直阻止自己成为一名软件经理。我从来没有升职过。\n我想继续做一名坚定的开发人员，因为只有高超的技术才能在某一天使我获得巨大的逃生：兼职项目企业家精神。\n三个星期过去了，我没有收到任何回音。我用不同的主题行发送了一封后续电子邮件，人力资源部回复了我：\n“不幸的是，这个职位最近已经有人填补了。顺便问一下，你什么时候申请的？“。\n当他回复时，我又转发了一封同样的电子邮件给他：“是的，我收到了这封，但之前的那封在我的垃圾邮件文件夹里。Gmail已将其隔离，因为该附件包含您的个人数据。“。\n“是的，你确实不走运。被录用的那个人比你晚两天申请。\n我大吃一惊。Gmail是否过滤掉了每个包含电话号码或电子邮件地址的附件？这在他们打击垃圾邮件的努力中真的有效吗？毕竟，我没有把它寄给我招聘者办公室里的每个人。\n过去，我曾三次向谷歌提交申请。我再也没有收到他们的回音。其中两封是通过Gmail发送的。\n回过头来看，我觉得通过Gmail失去的工作岗位可能超过150个。\n你的求职信向未来的雇主展示了你的个性。Gmail的写作建议设置掩盖了这一点。\n在键盘变小之后，我最讨厌在iPhone上发短信的地方是自动更正。\n每次我输入“我是拥有15年…经验的高级开发人员”Gmail用“经验”提示我。如果我想写“专业知识”呢？\n当键入“I Hope the Position…”时。当我真的想写“打开”时，它会弹出“仍然可用”。\n告诉你的潜在约会对象你有空，而不是敞开心扉去谈一段新的关系，感觉如何？它保持了对仍有待建立的关系的相互尊重。\n想知道是否有工作的整个想法把申请者放在了购物者的篮子里。它把雇主放在了一个更高的基座上。\nGmail扼杀了求职申请最重要的方面：自由写作。即使在语法上/逐字上可能很糟糕，我仍然想听到我的话的声音。我想要思考我的情绪的好的、坏的和丑陋的。\n你的求职信向未来的雇主展示了你的个性。Gmail的写作建议设置掩盖了这一点。\nGmail的自动建议背后的整个想法是让人们利用他们的移动电子邮件体验来提高工作效率。如果你在通勤或开会时打字怎么办？这真的加快了这个过程。\n在这样做的过程中，它试图通过一种名为人工智能的最强大的武器来了解我们的大脑和我们的沟通模式。\n虽然可以从Gmail设置(编写建议选项)关闭该功能，但显然大多数人不会费心更改默认设置，尤其是在Gmail服务器上进行更新时。\n顺便说一句，谷歌自己也承认默认的价值。它每年向苹果支付数十亿美元，以保持谷歌在Safari上的默认搜索引擎地位。\n电子邮件起草效率的巧妙提升是向企业客户销售更多Gmail商务套餐的门户。\n虽然云是即使是大公司的既定选择，但组织不愿将其内部通信托管在由庞然大物控制的服务器上。如此丰厚的附加值可以极大地促进Gmail的商业发展。\n但蛋糕上真正的樱桃是自动建议(可能)在幕后做的事情：收集用户通信的数据，为他们的相关业务提供支持。\n给你的招聘人员发了一封电子邮件，要求加薪吗？Gmail将其与他们自己的雇主数据库进行匹配，并在https://hire.google.com/.上使用。当它实时发生时，多亏了他们的招聘门户，你将有50多个申请者要与之竞争。\n更糟糕的是，你的雇主给你发到你的Gmail账户的工作机会可能会被扫描，以寻找你的工资数据。\n你刚才是不是用Gmail把发票寄给你的客户了？它可以用来优化面向企业的谷歌支付(Google Pay)。下个月，当你的竞争对手注册这样的账户时，他可能会收到基于你的定价的销售价格建议。\n您有没有用您的护照号码预订酒店？你把身份证寄到你孩子的学校了吗？您有没有就上一笔有问题的交易写信给您的密码钱包提供商客户关怀中心？\n虽然谷歌明目张胆地滥用用户数据还没有得到所有领域的全面评估，但求职申请并不是没有Gmail就不能做的。至少现在还没有。\n招聘，谷歌的招聘产品还处于初级阶段。但是一旦我们用我们的简历填饱肚子，它就会成为一个不可或缺的巨人。有权势的雇主可能还会花钱了解他们的申请者是否在向竞争对手申请。\n另一方面，LinkedIn已经足够酷和成熟，可以让你的雇主首先看到你是谁，以及你一直在做什么。最重要的是，它宣传自己是真正的自己，没有任何后门的人工智能噱头。它还提供消息传送功能，到目前为止，我们还不知道它能分析你的加薪要求。\n你可以在StackOverflow、LinkedIn或直接在招聘人员的网站上写求职信。它们也都为附件提供了便利。一个免费的Wordpress网站(或者一个自定义域名，如果你负担得起的话)可以作为你的实时简历，而且你再也不需要Gmail来申请工作了。", "note_en": "Three months back, I applied to a game studio. Not that I was a great match, but the demographics were on my side: Very few developers possessed the deadly combination of C++, C#, Node JS, and Mobile development technology in my geography.\n Throughout my 20 years long career, I prevented myself from becoming a software manager. I never got promoted.\n  I wanted to remain a steadfast developer because only technical prowess could one day empower my great escape: side project entrepreneurship.\n   Three weeks passed, I heard back nothing. I sent a follow-up email using a different subject line, and the HR got back to me:\n “Unfortunately the position is recently filled up. By the way, when did you apply?”\n I forwarded him the same e-mail again when he responded: ”Yeah, I got this one, but the earlier one was in my Spam folder. Gmail quarantined it because the attachment contained your personal data.”\n  “And yes, you were indeed out of luck. The guy who got hired applied 2 days after you.”\n I was aghast. Was Gmail filtering out every attachment that contained a phone number or an email address? Was this really effective in their efforts to fight spam? After all, I didn’t send it to everyone in my recruiter’s office.\n  In the past, I had sent my application to Google 3 times. I never heard back from them. Two of them were through Gmail.\n  Looking back, I feel that the number of jobs lost via Gmail could be more than 150.\n  Your cover letter reveals your persona to the future employers. Gmail’s writing suggestions setting masks it.\n   After a smaller keyboard size, the thing that I hate most about texting on an iPhone is auto-correct.\n  Every time I type “I am a Senior developer with 15 years of…” and Gmail hints me with “experience”. What if I wanted to write “expertise”?\n When type “I hope the position…” and it pops up “is still available” when I really want to write “open”.\n How does it feel to tell your prospect date that you are  available, instead of  open to a new relationship? It preserves the mutual respect for a relationship that is still to be built.\n The whole idea of wondering if a job is  available places the applicant in a baggers’ basket. It puts the employer on a higher pedestal.\n Gmail kills the most important aspect of a job application:  free writing. Even if it may suck grammatically/verbatim, I still want to hear the voice of my words. I want to ponder upon the good, bad and ugly of my emotions.\n Your cover letter reveals your persona to the future employers. Gmail’s writing suggestions setting masks it.\n   The whole idea behind Gmail’s auto-suggest is to make people productive with their mobile email experience. What if you are typing during a commute or a meeting? It really speeds up the process.\n  In doing so, it tries to get under our minds and our communication patterns via the most powerful weapon called AI.\n     While the feature can be turned off from Gmail Settings ( Writing Suggestions option), it is obvious most people don’t bother to alter defaults, especially when updates happen on Gmail servers.\n Google itself acknowledges the value of  Defaults, by the way. It handsomely pays Apple  a few billions every year to keep Google the default search engine on Safari.\n   A cute boost in email drafting productivity is a gateway to sell more Gmail for business packages to their enterprise customers.\n While the cloud is a given choice for even large corporations, organizations are reluctant to host their internal communications on servers controlled by behemoths. Such nice value additions can provide an enormous boost to Gmail for business.\n  But the real cherry on the cake is what auto-suggest (possibly) does behind the curtains: Gather data on users’ communications to power their relevant businesses.\n Sent an email to your recruiter with a salary request? Gmail matches it up with their own employer database and uses it on  https://hire.google.com/. When it happens in real-time, you will have 50 more applicants to compete with, thanks to their  Hire portal.\n Worse, your job offer that your employer sent you to your Gmail account could be scanned for your salary data.\n  Did you just send an invoice to your client using Gmail? It could be used to optimize  Google Pay for Businesses. Next month, when your competitor signs up for such an account, he might get a sale price recommendation based on your pricing.\n Did you request a booking with a hotel with your passport number? Did you send your ID to your kids’ school? Did you write to your crypto wallet provider customer care about the last problematic transaction?\n    While Google’s  blatant abuse of user data is yet to be evaluated fully across all domains, job applications aren’t something one cannot do without Gmail. Not at least yet.\n Hire, Google’s recruiting product is still in its infancy. But once we feed itself with our CVs, it will become an indispensable giant. Powerful employers may also pay to know if their applicant is applying to their competitors.\n LinkedIn, on the other hand, is already cool and mature enough that gives your employer first view of who you are, and what you have been up to. Most importantly, it advertises itself as what it really is, without any backdoor AI gimmicks. It also provides messaging, which as of now, hasn’t been known to analyze your salary requests.\n You could write your cover letters on StackOverflow, LinkedIn, or directly on your recruiter’s site. They all also provide facility for an attachment. A free Wordpress website (or a custom domain, if you can afford) can serve as your live CV, and you will never need Gmail for a job application.", "posttime": "2020-05-07 00:46:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发送,cv,gmail", "title": "永远不要通过Gmail发送你的简历", "title_en": "Never Send Your CV via Gmail", "transed": 1, "url": "https://medium.com/swlh/why-you-should-never-send-your-cv-via-gmail-b4fddd35fb3e", "via": "", "real_tags": ["发送", "cv", "gmail"]}, {"category": "", "categoryclass": "", "imagename": "d2123d26e66d094111a371295fc9f3f0.png", "infoid": 1000964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一起设定目标，加快发货速度。从开发人员到首席执行官，GitHub Insights使用世界上最大的开发人员社区的知识来推动您组织中的每个人向前发展。\n联系销售。\n每一步都很重要。GitHub Insights向您的团队展示如何更好地处理每个拉取请求、审核和提交。\n有了实时反馈，您可以缩小流程更改的范围，帮助您交付最好的软件。\n以透明的方式查看您的开发周期，并使您团队中的每个人都能够检查状态、改进流程并更紧密地协作。\n衡量开发过程的每一步，以便团队能够做出缩短周期和加快上市时间的决策。\n确保您正在衡量的是通过GitHub社区验证的可操作、有帮助和有影响力的KPI发挥作用。\n可视化当前活动，获取最新快照，并了解您的团队如何在工作进行时快速协作。\n软件是团队的成果。GitHub Insight可帮助每个人了解您的组织是如何协同工作的。\n了解您是如何做出贡献的，并找到与团队一起学习、改进和成长的新方法。", "note_en": "Set goals and ship faster, together. From developer to CEO, GitHub Insights uses the knowledge of the world’s largest developer community to keep everyone in your organization moving forward.\n  Contact Sales\n Every step counts. GitHub Insights shows your team how to work better with each pull request, review, and commit.\n With real-time feedback, you can narrow in on the process changes that help you ship your best software.\n  Get a transparent view into your development cycle and empower everyone on your team to check status, improve processes, and collaborate more closely.\n  Measure every step of your development process so teams can make decisions that shorten cycles and speed time to market.\n  Make sure what you’re measuring is making a difference with actionable, helpful, and impactful KPIs validated by the GitHub community.\n  Visualize current activity, get up-to-date snapshots, and understand how your team collaborates as quickly as the work happens.\n Software is a team effort. GitHub Insights helps everyone see how your organization works together.\n  See how you contribute and find new ways to learn, improve, and grow with your team.", "posttime": "2020-05-07 00:33:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,团队", "title": "GitHub洞察力", "title_en": "GitHub Insights", "transed": 1, "url": "https://github.com/features/insights", "via": "", "real_tags": ["github", "团队"]}, {"category": "", "categoryclass": "", "imagename": "4ce24a5b224daef39055159ea9f7dff3.png", "infoid": 1000963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代码空间将在有限的测试版中提供给一小部分GitHub用户。随着时间的推移，将有更多的用户根据可用性和注册日期访问测试版。\n如果您使用的是Codespaces测试版，您将在所有支持的存储库的Code选项卡中看到一个“Code”按钮。\n在有限的测试版中，代码空间将可用于您自己的存储库和公共存储库。其他支持将随着测试版的进展而可用，但目前，Codespaces不能用于属于组织的私有存储库。\n当您创建CodeSpace时，您可以让它保持打开状态，只要您愿意，但它会在30分钟不活动后自动挂起。您可以随时通过浏览器中的代码空间或VS代码重新连接。\n如果您愿意，可以在GitHub中打开CodeSpace，然后在VS Code中连接到它。\nCodespaces在测试版中是免费的。计划和价格将随着测试版的进展而公布。\nCodespaces建立了一个云托管的、容器化的、可定制的VS代码环境。设置后，您可以通过浏览器或VS代码连接到CodeSpace。\n在CodeSpace中，您可以访问Visual Studio代码市场，并且可以使用devtainer配置文件预加载您想要在启动时加载的任何扩展。您还可以通过拉入点文件来个性化您的CodeSpace。", "note_en": "Codespaces will be available to a small group of GitHub users while in limited beta. Over time, more users will have access to the beta based on availability and sign up date.\n  If you’re in the Codespaces beta, you’ll see a “Code” button in the Code tab of all supported repositories.\n  While in limited beta, Codespaces will be available for repositories you own and public repositories. Additional support will be available as the beta progresses, but for now, Codespaces will not be available for private repositories that belong to organizations.\n  When you create a codespace, you can leave it open for as long as you wish but it will suspend automatically after 30 minutes of inactivity. You can reconnect at any time through Codespaces in the browser or VS Code.\n  If you prefer, you can open a codespace in GitHub and then  connect to it in VS Code.\n  Codespaces is free while in beta. Plans and pricing will be announced as the beta progresses.\n  Codespaces sets up a cloud-hosted, containerized, and customizable VS Code environment. After set up, you can connect to a codespace through the browser or through VS Code.\n  Inside of a codespace, you’ll have access to the  Visual Studio Code Marketplace, and you can preload any extensions you want loaded at launch using a  devcontainer configuration file. You can also  personalize your codespace by pulling in dotfiles.", "posttime": "2020-05-07 00:32:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,代码", "title": "GitHub代码空间", "title_en": "GitHub Codespaces", "transed": 1, "url": "https://github.com/features/codespaces", "via": "", "real_tags": ["github", "代码"]}, {"category": "", "categoryclass": "", "imagename": "473175b97a70b177401d39caf36cb6a6.jpg", "infoid": 1000962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在短短一个月内，坦桑尼亚从只有20例冠状病毒病例记录到480例，这一惊人的增长使该国成为东非病例数量最多的国家。然而，该国总统约翰·马古富利(John Magufuli)相信，由于进口检测工具的技术故障，这个数字可能被夸大了。\n拥有化学博士学位的马古富利说，测试人员在动物和水果上随机获得了几个非人类样本，其中包括一只绵羊、一只山羊和一只爪子，结果呈阳性。这些样本被赋予了人名和年龄，并被提交给该国的国家转诊实验室进行冠状病毒检测，而实验室技术人员并不知道样本的真实身份。\n这显然促使马古富利相信，一些冠状病毒检测呈阳性的人可能根本没有感染这种新型病毒。他在坦桑尼亚西北部查托的一次活动中说：“我一直对我们的国家实验室如何处理冠状病毒病例表示怀疑。”总统已经下令对该国的测试协议进行调查，暗示可能有未具名的破坏者的干预。\n但长期以来，坦桑尼亚一直受到公共卫生专家的批评，因为与邻国东非国家的严格封锁和限制相比，坦桑尼亚对疫情采取了更宽松的方式。取而代之的是，马古富利要求坦桑尼亚人祈祷驱散病毒，并自冠状病毒爆发以来将礼拜场所开放。\n冠状病毒大流行的长期后果将改变工作场所、教育、外交、全球化、化石燃料等。全球经济的每个角落都不会不受影响。\n在总统面临额外压力之前，反对党的三名国会议员在过去两周内死于疑似冠状病毒症状。反对党现在拒绝进入议会，因为他们试图自我孤立，而马古富利则威胁要在他们缺席的情况下向他们收取静坐费。\n马古富利现在把他的信任寄托在一种草药疗法上，马达加斯加总统安德里·拉乔利纳(Anry Rajoelina)将其吹捧为治疗冠状病毒的方法。然而，世界卫生组织(WHO)警告称，没有任何治愈的证据。\n“我正在与马达加斯加沟通，他们已经写了一封信，说他们发现了一些药物。我们将派一架飞机把药品运来，这样坦桑尼亚人也能受益。因此，作为政府，我们正在夜以继日地工作。“他说。\n刚果共和国和几内亚比绍是其他承诺进口这种草药的非洲国家。\n2015年10月，马古富利当选后不久，坦桑尼亚人，甚至其他非洲人，都对他的“推土机”形象表示赞赏，因为他做了一些事情，比如在他的反腐运动中临时访问公共机构，解雇了一些政府高官。标签#WhatWouldMagufuliDo？在这个蜜月期间，推特上流行起来，被视为其他非洲领导人效仿这位严肃的坦桑尼亚领导人的警钟。\n随着时间的推移，随着媒体的镇压，这种光芒已经消退，总统因该国日益恶化的人权状况而受到抨击，其中包括禁止怀孕女孩上学的政策。\n该国将在今年晚些时候举行选举，马古富利可能会再次参选。\n请在此处注册Quartz Africa Weekly Brief，在您的收件箱中获取有关非洲商业、技术和创新的新闻和分析。\n为我注册每日简报，Quartz为聪明、忙碌的人提供的早间电子邮件。\n想要冷静，理性，甚至是好奇的方法来对付冠状病毒吗？我们已经收到了一封关于这件事的电子邮件。\n为我注册每日简报，Quartz为聪明、忙碌的人提供的早间电子邮件。", "note_en": "In just a month, Tanzania went from having only 20 coronavirus cases recorded to 480 cases, an alarming increase which puts the country with the highest number of cases in East Africa. However, the country’s president John Magufuli is convinced the number  may be exaggerated due to technical hiccups with the imported testing kits.\n Magufuli, who holds a doctorate in chemistry, said the testers  had randomly obtained several non-human samples on animals and fruits which included a sheep, a goat and a pawpaw and the results came out positive. The samples were given human names and ages and were submitted to the country’s National Referral Laboratory to test for coronavirus without the lab technicians knowing the true identity of the samples.\n This apparently prompted Magufuli to believe some people who were tested positive for Covid-19 might not have contracted the novel virus after all. “I have always raised my suspicions about how our national lab has been conducting the Covid-19 cases,”  he said at an event in Chato in northern-western Tanzania. The president, who has ordered a probe into the country’s testing protocols, insinuated possible interference by unnamed saboteurs.\n But Tanzania has long been criticized by public health experts for enabling  a more relaxed approach to the pandemic compared to the strict lockdowns and restrictions in neighboring East African countries. Instead Magufuli has asked Tanzanians to pray away the virus and left places of worship open since the Covid-19 outbreak began.\n  The long-term consequences of the coronavirus pandemic will transform the workplace, education, diplomacy, globalization, fossil fuels, and more. No corner of the global economy will be unaffected.\n The additional pressure on the president has come after  three members of parliament in the opposition party died with suspected Covid-19 symptoms over the last two weeks. The opposition party is now refusing to come to parliament as they try to self-isolate while Magufuli has threatened to charge them sitting fees in their absence.\n Magufuli is now putting his trust on a herbal treatment  touted as a cure for Covid-19 by the president of Madagascar Andry Rajoelina. However,  the World Health Organization (WHO) has warned that there was no proof of any cure.\n “I am communicating with Madagascar, and they have already written a letter saying they have discovered some medicine. We will dispatch a flight to bring the medicine so that Tanzanians can also benefit. So as the government we are working day and night,” he said.\n The Republic of Congo and Guinea Bissau are other African countries who have promised  to import the herbal remedy.\n Soon after Magufuli was elected in October 2015, Tanzanians and even other Africans, celebrated his “bulldozer” persona for getting things done such as firing a number of government top officials in his anti-corruption crusade with impromptu visits to public institutions. The  hashtag #WhatWouldMagufuliDo? trended on Twitter during this honeymoon period and seen as a wake-up call for other African leaders to emulate the no-nonsense Tanzanian leader.\n Over time that shine has worn off  with media clampdowns and the president has come under fire for the country’s  deteriorating human rights situation which included a policy on banning pregnant girls from school.\n The country is set to hold elections later this year, with Magufuli likely to contest again.\n Sign up to the  Quartz Africa Weekly Brief here for news and analysis on African business, tech and innovation in your inbox\n Sign me up for the Daily Brief, Quartz’s morning email for smart, busy people.\n Want a calm, rational, even curious approach to coronavirus? We’ve got an email for that.\n  Sign me up for the Daily Brief, Quartz’s morning email for smart, busy people.", "posttime": "2020-05-07 00:19:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,coronavirus,冠状病毒,president,马古富利", "title": "坦桑尼亚总统将冠状病毒病例急剧上升归咎于检测试剂盒有问题", "title_en": "Tanzania's President is Blaming the Sharp Rise of Coronavirus Cases on Faulty Testing Kits", "transed": 1, "url": "https://qz.com/africa/1850839/tanzania-president-magufuli-blames-covid-19-rise-on-faulty-tests-goats/", "via": "", "real_tags": ["病毒", "冠状病毒", "president", "马古富利"]}, {"category": "", "categoryclass": "", "imagename": "9fb0fe6d7abf0ee519ef3cdd0c9751ae.jpg", "infoid": 1000961, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒大流行持续的时间比国会和白宫承诺向个人和小企业提供数千亿美元时预期的要长。\n重要的是：这些救助计划的目的是止血，在伤口灼伤时争取时间。不幸的是，伤势比最初诊断的要严重。\n财政部长史蒂夫·姆努钦(Steve Mnuchin)告诉哥伦比亚广播公司(CBS)，整个一揽子计划提供了大约10周的整体经济缓解。\n没有人预计到那个时候会看到第四阶段的刺激措施，也没有人会看到全面的经济重新开放。\n薪资保护计划(PPP)贷款要求小企业有效地维持八周的人员配备水平。对于早期的受助人来说，这意味着他们的工资义务可能在月底就用完了。\n该计划在4月底重新充实了金库，但小企业不允许重新申请。\nAxios要求几位国会领导人解释为什么选择八周作为到期日，但无法得到直接答案。\n来自两党的众议院助手将我们的问题引导到参议院，参议院工作人员将Axios引导到财政部。财政部让我们参考了姆努钦之前的公开评论，比如，[这]没有很好的模型，因为推动经济的很多因素都是健康问题。\n直接向个人发放高达1200美元的支票预计只能帮助支付一个月的费用，尽管许多州已经进入了封锁的第二个月。\n增强的失业救济金持续到7月31日的时间更长，尽管一些共和党参议员承诺阻止任何延期。\n联邦政府实际上已经为小企业设定了一个回归正常的最后期限，尽管这样的决定应该由各州做出。\n截止日期是通过特朗普总统于3月27日签署的立法设定的，因此它无法适应随后的公共卫生数据和指南。\n华盛顿的共识是，3月份的法案从来没有打算成为刺激计划的结束。\n参议院共和党的一位高级助手告诉Axios，第一个法案是关于可能的艺术和让事情通过的艺术。它应该是我们监控的东西。你不能开一张只是一张空白支票的账单。\n但民主党人和共和党人在下一项刺激法案应该是什么样子的问题上仍存在很大分歧，更不用说应该在什么时候讨论了，因为已经拨付的资金继续减少。\n共和党领导层曾表示，不打算继续通过权宜之计来补充眼前的援助。取而代之的是，它希望下一项法案更多地关注长期复苏和重新开放美国。\n民主党人表示，各州、企业和医疗行业仍需要紧急救济，共和党人不愿满足这一时刻。\n一句话：小企业贷款和个人支票原本是作为重新开放的桥梁而设计的，但如果它们只是将裁员和经济痛苦推迟几个月，那么它们最终可能会作为通往无处的桥梁而被人们记住。", "note_en": "The coronavirus pandemic is lasting longer than Congress and the White House anticipated when it committed hundreds of billions of dollars to individuals and small businesses.\n Why it matters: These bailouts were meant to stop the bleeding, to buy time while the wound cauterizes. Unfortunately, the injury was more severe than originally diagnosed.\n Treasury Secretary Steve Mnuchin  told CBS that &#34;the entire package provides economic relief overall for about 10 weeks.&#34;\n No one  expects to see a phase 4 stimulus by that date, nor a full-scale economic reopening.\n Paycheck Protection Program (PPP) loans require that small businesses effectively maintain staffing levels for eight weeks. For early recipients, that means their payroll obligations could run out by month&#39;s end.\n The program&#39;s coffers were refreshed at the end of April, but small businesses are not allowed to reapply.\n Axios asked several congressional leaders to explain why eight weeks was picked as the expiration date but was unable to get a direct answer.\n House aides from both parties directed our questions to the Senate, and Senate staffers directed Axios to the Treasury. Treasury directed us to prior public comments by Mnuchin, such as that &#34;there&#39;s no great models for [this] because so much of what is driving the economy is the health issue.&#34;\n Direct checks of up to $1,200 to individuals were only expected to help cover expenses for one month, even though many states already are well into their second month of lockdown.\n Enhanced unemployment benefits last longer, through July 31, although some GOP senators have  pledged to block any extension.\n  The federal government has effectively created a &#34;back to normal&#34; deadline for small businesses, even though such decisions are supposed to be made by the states.\n The deadline was set via legislation signed by President Trump on March 27, thus it&#39;s unable to adapt to subsequent public health data and guidance.\n The D.C. consensus is that the March bills were never intended to be the end of the stimulus.\n &#34;The first bill was about the art of the possible and getting things through,&#34; a senior Senate GOP aide told Axios. &#34;It was supposed to be something that we monitor. You can’t write a bill that’s just a blank check.&#34;\n But Democrats and Republicans remain far apart on what the next stimulus bill should look like, let alone when it should come to the floor, as already-appropriated funds continue to dwindle.\n Republican leadership has said it doesn’t plan to continue passing stopgap measures to replenish immediate aid. Instead, it wants the next bill to be more focused on long-term recovery and reopening America.\n Democrats say states, businesses and the health industry still need emergency relief and that Republicans are unwilling to meet the moment\n The bottom line: The small business loans and individual checks were designed as bridges to reopening, but if they only delayed layoffs and economic pain by a couple of months, then they may end up being remembered as bridges to nowhere.", "posttime": "2020-05-07 00:05:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,持续时间,outlasting", "title": "冠状病毒的持续时间超过了刺激", "title_en": "The coronavirus is outlasting the stimulus", "transed": 1, "url": "https://www.axios.com/the-coronavirus-is-outlasting-the-stimulus-5ededaa6-235d-4693-8288-0d85231220c7.html", "via": "", "real_tags": ["病毒", "冠状病毒", "持续时间"]}, {"category": "", "categoryclass": "", "imagename": "1c5218ae9e41ec04fd29507d59987eeb.png", "infoid": 1000960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造性的编码员使用机器来创造美学和令人惊讶的体验。这套90分钟的作品由荷兰数字艺术社区创意编码乌得勒支策划，呈现了来自欧洲创意编码社区的一系列动态作品。从机器学习的有趣使用到现场编码，以创建实验性、即兴的视觉和音乐。\n@sasj@sasj_nl Saskia Freeke每天都会创作多产的计算艺术。她的作品和她的实践都以其鲜明的嬉戏特征脱颖而出。通过创建她自己的规则，并在她前进的过程中嬉戏地调整这些规则，萨斯基亚将一种值得注意的不断演变的叙事应用到她的工作中。现场编码的行为为她的话语提供了一个令人敬畏的补充上下文-因为这是在创意同行之间和与之合作的实时练习，使她的当代艺术原则得到了充分发挥。\n@tmhglnd@tmhglnd Timo Hoogland是荷兰阿佩尔霍伦的实况编码器、创意编码器、音乐技术专家和教育家。他现场录制实验性的电子舞曲，并开发具有生成性的视听作品、装置和表演。他与创意编码乌得勒支一起积极组织现场编码会议和算法会议，是荷兰编码现场社区的一员，并在香港大学音乐技术学士学位教授创意系统和声音设计。\n@edwinRNDR@voorbeeld Edwin Jakobs是RNDR的联合创始人，RNDR是一家总部位于荷兰的互动设计工作室，他在那里就设计和软件的交叉进行设计、实验和研究。他是OPENRNDR的主要开发者，OPENRNDR是一个创造性编码框架。\n@andreref@andreref Andreas Refsgaard是哥本哈根的一位艺术家和创意程序员。他使用算法和机器学习，让人们只用眼神和面部手势来演奏音乐，通过发出愚蠢的声音来控制游戏，或者将纸上的乐器图画转化为真正的作品。最近，安德烈亚斯一直在试验使用机器学习根据大量训练数据创建新的文本和图像，并创建了Booksby.ai-一家出售人工智能生成的科幻小说的在线书店。\n创造性的编码员使用机器来创造美学和令人惊讶的体验。这套90分钟的作品由荷兰数字艺术社区创意编码乌得勒支策划，呈现了来自欧洲创意编码社区的一系列动态作品。从机器学习的有趣使用到现场编码，以创建实验性、即兴的视觉和音乐。Saskia Freeke&amp；Timo Hoogland汞合金一种现场编码表演，结合了用九头蛇编码的高对比度几何2D视觉效果，映射到听觉反应性3D对象，以及用水星编码的抽取式深度技术编码。Hydra是一个基于浏览器的可视化编码环境，Mercury是一种高度抽象的语言，用于用MaxMSP、NodeJS和OpenGL编码的电子音乐的算法作曲。关于标题：在化学中，元素汞可以与另一种金属元素形成合金。这种两种金属的结合被称为汞合金。Edwin Jakobs，RNDR Live Coding with OPENRNDR在本次会议中，我将讨论创意编码、实时编码和OPENRNDR。创造性编码没有严格的定义，但在本课程的上下文中，它是为(或作为)艺术表达编写软件的过程。然后，实时编码是指软件可以在运行时进行更改。快速迭代想法的能力使实时编码成为创造性程序员的令人兴奋的工具。在这次演讲中，我将重点介绍OPENRNDR，这是一个用于创造性编码的开源框架，最近收到了用于实时编码的工具。安德烈亚斯·雷夫斯加德(Andreas Refsgaard)，膨胀好玩的机器学习交互设计师和数字艺术家安德烈亚斯·雷夫斯加德(Andreas Refsgaard)将分解几个有趣的互动项目，并将引导每个拥有网络摄像头和浏览器的人自己尝试这些项目。", "note_en": "Creative Coders use machines to create aesthetic and surprising experiences. This 90-minute set, curated by Dutch digital arts community Creative Coding Utrecht, presents a dynamic array of work coming from the creative coding community in Europe. from playful uses of machine learning to live coding to create experimental, improvised visuals and music.\n    @sasj       @sasj_nl   Saskia Freeke creates generative, computational art on a daily basis. Both her works and her practice stand out by their distinctive playful characteristic. By creating her own rules and playfully adapting these as she goes, Saskia applies a notable evolving narrative to her work. The act of Live coding provides an awesome complementary context to her discourse - for it is the realtime exercise amongst and in conjunction with creative peers that make her contemporary artistic principles come into full play.\n    @tmhglnd       @tmhglnd   Timo Hoogland is a livecoder, creative coder, music technologist and educator based in Apeldoorn, The Netherlands. He livecodes experimental electronic dance music and develops generative audiovisual compositions, installations and performances. He has an active role in organizing livecoding meetups and algoraves together with Creative Coding Utrecht, is part of the Netherlands Coding Live community and he educates creative system and sound design at the HKU Bachelor of Music Technology.\n    @edwinRNDR       @voorbeeld   Edwin Jakobs is a co-founder of RNDR -a studio for interactive design based in The Netherlands- where he designs, experiments and researches on the intersection of design and software. He is the principal developer of OPENRNDR, a framework for creative coding.\n    @andreasref       @andreasref   Andreas Refsgaard is an artist and creative coder based in Copenhagen. He uses algorithms and machine learning to allow people to play music using only eye movement and facial gestures, control games by making silly sounds or transform drawings of musical instruments on paper into real compositions. Recently Andreas has been experimenting with using machine learning to create new texts and images based on large amounts of training data and has created Booksby.ai - an online bookstore which sells science fiction novels generated by an artificial intelligence.\n  Creative Coders use machines to create aesthetic and surprising experiences. This 90-minute set, curated by Dutch digital arts community Creative Coding Utrecht, presents a dynamic array of work coming from the creative coding community in Europe. from playful uses of machine learning to live coding to create experimental, improvised visuals and music.   Saskia Freeke &amp; Timo Hoogland  Amalgam A live-coding performance combining high contrast geometric 2D visuals coded in Hydra mapped to audioreactive 3D objects with decimated deep techno coded in Mercury. Hydra is a browser-based visual coding environment, Mercury is a highly abstracted language for algorithmic composition of electronic music coded in MaxMSP, NodeJS and OpenGL. About the title: In chemistry the element Mercury can form an alloy with another metallic element. This combination of two metals is called an amalgam.   Edwin Jakobs, RNDR  Live coding with OPENRNDR In this session I talk about creative coding, live coding and OPENRNDR. Creative coding is not strictly defined, but in this session&#39;s context it is the process of writing software for (or as) artistic expression. Then, live coding is the idea of software that can be changed while it runs. The ability to quickly iterate over ideas makes live coding an exciting tool for creative coders. I focus in this talk on OPENRNDR, which is an opensource framework for creative coding that has recently received tools for live coding.   Andreas Refsgaard, Inflation  Playful machine learning Interaction designer and digital artist Andreas Refsgaard will break down a few fun interactive projects, and will guide everyone with a webcam and a browser to try them out themselves.", "posttime": "2020-05-07 00:04:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,卫星,satellite,编码", "title": "GitHub卫星直播流", "title_en": "GitHub Satellite Livestream", "transed": 1, "url": "https://githubsatellite.com/", "via": "", "real_tags": ["github", "卫星", "satellite", "编码"]}, {"category": "", "categoryclass": "", "imagename": "8ff79f548a59b1e847a1ff39efe86826.png", "infoid": 1000959, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是亚马逊的副总裁兼杰出工程师。我们大约有20人。我们是公司最资深的工程师。我们对公司的技术方向有重大影响。我们在公司文化中也有重要的话语权。\n当Tim Bray加入亚马逊时，我很兴奋。他的技术专长是众所周知的XML的合著者之一，我期待着向他学习的机会。“不幸的是，亚马逊在我13年的时间里已经成为一家大公司，20位杰出的工程师分散在公司各处，很难密切合作。如你所见，我是全球运营领域的两位杰出工程师之一。”虽然我们严重依赖AWS，但我没有机会与TIM密切合作。\n我不能谈论他决定离开亚马逊的所有事情。但他已经陈述了自己的理由。\n我反对的是，First Tim一开始就说：“亚马逊的信息已经很紧急，他们正在优先考虑这个问题，并在仓库安全方面投入了大量努力。我实际上相信这一点：我从我信任的人那里听到了关于紧张的工作和巨大的投资的详细描述。对他们来说很好，…“。然后他插了一句，“让我们承认，你不会一下子就把一艘超级油轮翻个底朝天。”\n他说得对，我们把这个问题放在首位，…。自从这项计划开始以来，每周7天。但他错了，我们行动迟缓。我相信有很强的理由表明，亚马逊对这场危机的反应比世界上任何其他公司都更灵活。新的政府强制协议在几个小时内就会实施。我的组织发明了一种使用人工智能来审查社交距离合规性的能力，并在4天内部署了它。这让我们能够找出改进的机会，并与这些领域的领导者合作解决这些问题。我们将供应链能力集中在最初很难获得的温度检查和口罩上。我们在数百座建筑中安装了热像仪。我们重新设计了从如何卸车到如何包装、分类和装载包裹的各种流程，以便至少由一个人来完成，而不是最近的邻居。亚马逊是第一家开始推出员工测试的大雇主。这些只是150多个流程中的一个小样本。(亚马逊是第一家开始推出员工测试的大雇主。)这些只是150多个流程中的一个小样本。亚马逊更像是一个能够极快适应的蚂蚁农场。\n它正在奏效。我们在几周内实施了广泛的健康和安全措施，同时继续向公众提供必要的产品。当我第一次加入全球运营公司领导机器人公司时，我学到的第一件事就是安全决定一切。我们的产品路线图是由我们可以带来更高安全性的地方驱动的，例如机器人堆垛机和出货箱，它们省去了堆放和拆卸运输手提箱的努力。我们的部署受到安全性能的限制。我们每一次新的机器人部署都是。\n如果我们希望人们选择为亚马逊工作，帮助向客户递送包裹，首要工作是让那些有价值的员工相信，你每天都在尽你所能确保他们的安全。12周前，当美国处于3.6%的创纪录低位失业率时，所有技能的员工都很受欢迎，就像现在大流行期间一样，我们很快又雇佣了17.5万人。\n我们还想做更多吗？我们做了，我们正在做。我们正在努力开发和部署更多的流程和技术，用于一系列措施-从社会距离到接触者追踪。我们正在开发移动紫外线卫生设施。我的Prime Air无人机和机器人集团已经成为COVID创新的研发实验室，我迫不及待地想与你们分享。今天，我回顾了72个我们可以改进的新想法的清单。\n每个人都会相信我们做得够多了吗？不会。当你每天有数十万人来上班，他们都经历着不同的流行病时，你不能指望每个人都做出同样的反应。你可以提供额外的补偿。你可以允许休假和休假。你可以承诺照顾员工，如果他们真的生病了，不管他们在哪里感染了病毒。这些都是亚马逊几乎立即做的事情。但你不能完全消除我们所有人共同的恐惧和担忧。\n不过，蒂姆·布雷(Tim Bray)说的“亚马逊将仓库中的人类视为可替代的拣选和打包单元”的说法最终是完全错误的。我发现这深深地冒犯了我们这些在全球运营部门工作的人。对于我们这些在全球运营部门工作的人来说，没有什么比事实更离谱了。我们的同事是你在任何地方都会遇到的最令人惊叹的人，也是我们所做一切的核心。感谢您每天为兑现亚马逊的客户承诺所做的一切。", "note_en": "I am a Vice President and Distinguished Engineer at Amazon. There are about 20 of us. We’re the most senior engineers at the company. We have significant impact on the technical direction of the company. We also have a significant voice in the culture of the company.\n I was excited when Tim Bray joined Amazon. His technical expertise is well known as one of the co-authors of XML and I looked forward to the opportunity to learn from him. Unfortunately, Amazon has become a large company in my 13 years and the 20 Distinguished Engineers are spread out across the company, making it hard to collaborate closely. You see, I am one of two Distinguished Engineers in World-Wide Operations. While we rely heavily on AWS, I have not had occasion to work closely with Tim.\n I cannot speak to everything that went into his decision to quit Amazon. He has stated his reasons.\n Where I object is that first Tim starts by saying “Amazon’s messaging has been urgent that they are prioritizing this issue and putting massive efforts into warehouse safety. I actually believe this: I have heard detailed descriptions from people I trust of the intense work and huge investments. Good for them…” He then throws in “and let’s grant that you don’t turn a supertanker on a dime.”\n He’s right that we are prioritizing this issue… 7 days a week since this started. He’s wrong that we were slow. I believe a strong case can be made that Amazon has responded more nimbly to this crisis than any other company in the world. New government-mandated protocols are implemented within hours. My organization invented an ability to use AI to review social distancing compliance and deployed it in 4 days, allowing us to pin point opportunities for improvement and work with the leaders in those areas to fix them. We focused our supply chain capabilities on temperature checks and face masks that were initially hard to procure. We have thermal cameras in hundreds of buildings. We redesigned our processes for everything from how to unload trucks to how to pack, sort and load packages so that they could be done by one person at least 6’ apart from their nearest neighbor. Amazon is the first major employer to begin rolling out employee testing. These are just a small sampling of the over 150 process changes we have made. Amazon is not a super-tanker… Amazon is more like an ant farm that can adapt extremely quickly.\n And it is working. We’ve implemented a wide range of health and safety measures over a matter of weeks while continuing to provide essential products to the public. When I first joined World-Wide Operations to lead Robotics, the very first thing I learned was that safety dictated everything. Our product roadmap is driven by where we can bring increased safety, such as robotic palletizers and depalletizers that save the effort of stacking and destacking transport totes. Our deployments are gated by our safety performance. Every new robotic deployment is expected to significantly exceed the safety benchmarks set by the existing process.\n If we want people to choose to work for Amazon helping deliver packages to customers, job number one is to convince those valuable employees that you are doing everything you can every day to keep them safe. That prerequisite was equally true 12 weeks ago when the United States was at record low unemployment rate of 3.6% and employees of all skills were in high demand everywhere, as it is now during the pandemic as we’ve hired 175,000 additional people very quickly.\n Do we want to do more? We do and we are. We are working hard to develop and deploy additional processes and technology for a range of measures – from social distancing to contact tracing. We are developing mobile ultraviolet sanitation. My Prime Air drones and robotics group has become an R&amp;D lab for COVID innovation that I can’t wait to share with you. Today I reviewed a list of 72 new ideas for improvements we can make.\n Is everyone going to be convinced we are doing enough? No. When you have hundreds of thousands of people coming to work every day who are all experiencing this pandemic differently, you cannot expect everyone to react the same way. You can provide additional compensation. You can allow time off and leaves of absence. You can commit to taking care of employees if they do get sick, regardless of where they caught the virus. These are all things Amazon did almost immediately. But you can’t entirely eliminate the fear and concerns that we all share.\n Ultimately though, Tim Bray is simply wrong when he says “It’s that Amazon treats the humans in the warehouses as fungible units of pick-and-pack potential.” I find that deeply offensive to the core. For those of us who work in World-Wide Operations, nothing could be farther from the truth. Our associates are the most amazing people you will meet anywhere and the heart of everything we do. Thank you for all that you do every day to deliver on Amazon&#39;s customer promise.", "posttime": "2020-05-06 23:50:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "离职,tim,机器人", "title": "对蒂姆·布雷离职的回应", "title_en": "Response to Tim Bray's Departure", "transed": 1, "url": "https://www.linkedin.com/pulse/response-tim-brays-departure-brad-porter/", "via": "", "real_tags": ["离职", "tim", "机器人"]}]