[{"category": "", "categoryclass": "", "imagename": "6f4efb1b252be82539dddc2a54901522.jpg", "infoid": 1066418, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在以色列北部约旦河河附近的kibbutz，Sde Eliyahu的幼儿园，您可能无法承认它。相反，你会看到铸造物体的院子：生锈的拖拉机零件，旧电脑和孤单的自行车车轮。意识到一些人或许多人已经致力于将零件安排成奇怪的结构和机器需要几分钟。\n 在这个Kibbutz的院子里似乎似乎就像猩猩一样，在以色列跨越数百个类似的院子里，实际上是一个关于孩子如何学习和尖锐的批判的理论的表达。幼儿园Junkyard在一瞬间逆兴地争辩到了安全和诉讼 - 但可能有一些东西教授刚刚通过一岁的教育对教育本身的局限性的父母。垃圾园是一个紧迫问题的答案：当我们教孩子时，如果我们准备好他们爬上一个有序的测试，导致其他测试，等级和度 - 或者我们应该为混乱做好准备吗？\n 我在春天的SDE Eliyahu找到了Malka Haas，在一款针织冬天的帽子和毛衣，坐在她儿子，伊利莎的轮椅上。她最近打了100岁，一直失明了几年，现在太虚弱了走路或接受采访。但她是以色列世界的占主导地位的早期儿童教育的统治者，这融入了90多岁。我的妻子来自这个Kibbutz，幼儿园垃圾园的产品，她就像在这里长大的其他人 - 讲述了众多敬畏和一点点恐惧。哈斯从来没有泡沫的老师。她是一个艰难的女人，学到了一些艰难的课程，并提出了艰难的想法。\n 80年前，Junkyard Playground出生在这个Kibbutz，以及创始人的第一个孩子。建造了SDE Eliyahu的人，其中许多德国犹太人逃脱了纳粹，是孩子们自己：在1939年的当天，当第一个帐篷上涨时，哈斯是19.没有成年人。没有成年人围绕如何提出如何提高家庭。他们自己的父母在欧洲，许多人后来被谋杀了。他们是自己的。\n  就像她的其他同志一样，哈斯从来没有机会完成高中，但她就参加了六个月的教师神学院，让她成为教育权威的kibbutz最接近的事。她负责幼儿园。 Kibbutz Idefatione理想化的节俭和拒绝任何资产阶级 - 这是幸运的，因为在那些年里，Kibbutzniks经常缺乏食物的钱，更不用说玩具。没有成年监督和效忠于之前的事情，Kibbutzniks发现了创新的瞬间。\n 孩子们是工人社区的一部分。他们应该从田野，研讨会和厨房中丢弃丢弃的物体，将它们放到他们所需的任何使用中。他们没有任何指令建造，以及他们构建的内容对成年人都没有意义。正如她在后来解释的那样，在她的想法被庆祝之后，被教导到抱负的教师，垃圾碎片“不代表破碎，生锈，肮脏的人类活动的遗留，而是生活所提供的所有多方面的丰富性。”\n HAAS的想法和当前时尚之间的距离在一个现场HAAS描述于1985年的论文中，“垃圾园中的儿童”。几个5岁的女孩在院子里工作 - 这是一个她更喜欢这个词的词。女孩们在他们自己建造的结构中，配有倾斜椅子，水壶和餐具。他们是一个家庭，它是安息日。 （大多数Kibbutzim由犯罪的无神论者成立，但这个Kibbutz是宗教，试图将社会主义和传统犹太教相结合。）一个女孩假装睡在用抹布填充的篮子里睡觉。另一个，Avishag在母亲的角色上迎来了附近的灌木丛，为安息日的桌子挑选一些粉红色的花朵，并将它们放入塑料瓶中。花朵，一个人在哈斯的偏手描述中学习，是嗅觉，这是美丽的，也可以杀死你。 \n实际上，这个垃圾场的场景将在个人伤害律师中激发任何安全检查员和眩晕的恶劣。谁让孩子们玩Oleanders？但这是理论的一个特征，而不是一个错误。生活很脏，危险。有时你会受伤。\n 有些人问哈斯，例如，如果这是一个好主意让孩子们赤脚在院子里工作。她写道的答案很明显：“一个赤脚的孩子学会更快地照顾自己，因为他通过他的脚的感情磨砺了他的理解。”她的文章是对教育的罕见作品中，强调破伤风射击的重要性。她的态度仍然非常活跃在Kibbutz上，因为当我的双胞胎儿子约有4和他们的祖父，kibbutz电工，他自己在哈斯的垃圾场上长大，去了一块旧的玩具，拔出了孩子们锯。当我所期望的情况下，孩子们的锯子不是塑料，而是锋利的（如果生锈）钢铁 - 为孩子们做出了完全真正的锯。\n M在1920年出生于律师的女儿的柏林中阶层家庭。她的父母是犹太人，但被认为自己是德国人。当1933年之后纳粹种族法律生效时，她被踢出了学校，加入了犹太岛的青年运动，并在她15岁时向英国授权巴勒斯坦做好准备。她停止使用父母给她，希尔德的名字，并开始呼叫她是一个意思是“女王”的希伯来语。根据Elisha的说法，当她从柏林开始到她的新生活时，她的母亲给了她一个三明治在途中吃：“在一个特色的行动中，她把它扔掉了窗外。”\n  她的父母在纳粹首都幸存下来，直到1941年，当他们逃到火车到塞维利亚，西班牙，并设法到达美国。 Haas于1948年通过以色列的独立战争，包括由Kibbutz的田地侵犯伊拉克军队的战斗。她有一个小弟弟，她第一次见到他22岁时。在那些年的犹太家庭，这是一个愉快的故事。\n “孩子们必须知道，”哈斯在2010年讲述了一个面试官，“当他们在院子里工作意外事情会发生。问题是你如何学会处理它。这些孩子的整个生命将处理意外，但没有意义，我们将它们包裹在棉球上。“\n 这不仅仅是一种教育方法，而是她的个性延伸，因为她的儿子是一位生物物理学教授描述了它。他的母亲来自这里作为“yekkes”的社会群体，中产阶级德国犹太人，其上层德国犹太人，其上层态度与以色列的创始人的Irreverent Enalitanis波有关。 （这术语字面意思是“夹克”，尽管气候和无产阶级卡其地的官方偏好，但他们据说他们据说是非理性的依恋的衣服。）“尤克斯不拥抱，”Elisha Haas告诉我。 “他们通过投资奉献给孩子们献上爱的爱情。这就是孩子知道他很重要的事情。“\n Malka Haas是一个自动渗透的自动渗透，在20世纪40年代初，她在遥远的山谷中欣赏她的想法，但其他人在第二次世界大战周围的混乱年度沿着类似的线条思考。最着名的例子可能来自Bortwar英国，Lady Marjory Allen of Hurtwood的艾伦·艾伦举行的思想令人满意的四个S的摇摆，跷跷板，沙箱，滑动“冒险游乐场”的形式，令人惊叹的垃圾套装在德国人轰炸的建筑物的遗址上。这些想法飞越了其他流行的理论，争论幼儿应该保护幼儿免受轰炸的建筑物，并授予秩序世界和美丽。例如，蒙台梭利学校认为，每个教育对象应该是“总是美丽，闪耀的，良好的修复，没有任何缺少，这样它就会向孩子们看起来很新，并完成并准备使用。” \n事实是，我们对教学儿童的实际工作尤其知之甚少，海法大学教育教授Deborah Golden告诉我。 Golden是关于Kibbutz Junkyard的几篇文章的作者，是哈斯理论的适度续签的部分。她说，如果一个功能性成年人是这样的方式，那么这几乎是不可能的，因为她的学校提供​​她美丽的玩具或垃圾场，或者如果信贷属于其他人，而是对她的父母或社会没有学校。 “童年是一个巨大的空间，让我们想象自己进入它，”Golden说。成年人选择对成年人有意义的教育理念。 Kibbutz Junkyard可能会呼吁我，换句话说，因为在多伦多的童年时期的令人沮丧的安全，这是一个在危险之中不大的地方。或者，在过去的一年之后，因为它与缩放的思维决定性的沉思的相反。\n 以色列的孩子们被许多西方国家的孩子允许更多自由和风险，但即使在这里时尚现在正在奔放不同的方向。 Nadav Strizover是一位教育幼儿园的北部又名Akko的朋友，描述了几个不同水平的安全检查员定期来看看院子里的院子里，挥舞着复杂的手册和消除恰好遇到活动的危险孩子们最喜欢。他说，检查员会很高兴，当院子是“一只小塑料房子站在完全平坦的合成草上。”他研究了哈斯的理论，欣赏他们，但不能实现它们。这就是今天垃圾场可以在克巴布塔姆农村发现的一个原因，这仍然比城市幼儿园仍有更多的自主权，而是由市政检查员和诉讼的城市父母。在垃圾园的想法中，金色的新兴趣是由此被认为是濒临灭绝的感觉 - 没有妥善赞赏，它将被安全检查和起飞。\n 幼儿园垃圾园是在一系列独特的情况下开发的：20世纪40年代的贫困kibbutz，年轻的父母看到世界上最糟糕的是世界可以提供和想要应付的孩子。也许我们的世界从根本上不同。今天的父母可能会在我们成长时尽可能多地假设。但在过去一年之后，当混乱后，在几代可预测性之后抵达西部家园时，在争夺儿童正在努力管理的情况下进行正规教育，那个论点更加艰难。我们可能会学习年轻的Malka Haas知道什么：生活不会按计划进行。它会给我们垃圾，我们必须制作它的工作。 ", "note_en": "W  the kindergarten at Sde Eliyahu, a kibbutz near the Jordan River in northern Israel, you might not recognize it. Instead, you’ll see a yard for castaway objects: rusty tractor parts, old computers, and orphaned bike wheels. It takes a few moments to realize that some person, or many people, has devoted thought to arranging the parts into strange structures and machines.\n What seems at first like a haphazard jumble in the yard at this kibbutz, and in hundreds of similar yards across Israel, is in fact the expression of a theory about how children should learn and a sharp critique of the way they’re usually taught. The kindergarten junkyard is countercultural at a moment preoccupied with safety and litigation—but may have something to teach parents who’ve just been through a yearlong education on the limits of education itself. The junkyard is one answer to a pressing question: When we teach kids, should we prepare them to climb an orderly ladder of tests that lead to other tests, grades, and degrees—or should we prepare them for chaos?\n I found Malka Haas at Sde Eliyahu in the spring, in a knitted winter hat and sweater, sitting in a wheelchair pushed by her son, Elisha. She recently turned 100, has been blind for several years, and is now too frail to walk or be interviewed. But she was a dominant figure in the Israeli world of early-childhood education well into her 90s. My wife is from this kibbutz, a product of the kindergarten junkyard, and she—like everyone else who grew up here—speaks of Haas with great reverence and a little fear. Haas was never a teacher of the bubbly variety. She’s a tough woman who learned some tough lessons, and came up with tough ideas.\n The junkyard playground was born on this kibbutz 80 years ago, along with the founders’ first kids. The people who built Sde Eliyahu, many of them German Jews who’d escaped the Nazis, were kids themselves: On the day in 1939 when the first tents went up on these steamy flatlands by the Jordan, Haas was 19. There were no adults around to give advice on how to raise a family. Their own parents were in Europe, where many were later murdered. They were on their own.\n  Like the rest of her comrades, Haas never had the chance to finish high school, but she’d attended a teachers’ seminary for six months, making her the kibbutz’s closest thing to an authority on education. She took charge of the kindergarten. Kibbutz ideology idealized frugality and rejected anything bourgeois—which was lucky, because in those years the kibbutzniks often lacked money for food, let alone toys. With no adult supervision and little allegiance to the way things had been done before, the kibbutzniks found the moment ripe for innovation.\n The children were part of a community of workers, Haas thought. They should play with discarded objects from the fields, workshops, and kitchens, putting them to whatever use they desired. They’d build together with no instruction, and what they built didn’t have to make sense to adults. As she  explained much later, after her ideas became celebrated and were taught to aspiring teachers, pieces of junk “do not represent the broken, rusty, dirty remnants of human activity, but rather all the multifaceted richness that life has to offer.”\n The distance between Haas’s ideas and current fashions is illustrated in a scene Haas describes in her 1985 treatise, “Children in the Junkyard.” A few 5-year-old girls are in the yard working—that word being one she preferred to the word  play. The girls are in a structure they built themselves, and furnished with cast-off chairs, jugs, and cutlery. They’re a family, and it’s the Sabbath. (Most kibbutzim were founded by committed atheists, but this kibbutz is religious, an attempt to combine socialism and traditional Judaism.) One girl is pretending to sleep in a basket padded with rags. Another, Avishag, in the role of the mother, goes over to a nearby bush, picks some pink flowers for the Sabbath table, and puts them in a plastic bottle. The flowers, one learns in Haas’s offhand description, are oleanders, which are beautiful, and also so toxic that they can kill you.\n Indeed, this junkyard scene would inspire queasiness in any safety inspector and giddiness in a personal-injury attorney. Who lets kids play with oleanders? But this was a feature of the theory, not a bug. Life is dirty and dangerous. Sometimes you’re going to get hurt.\n Some people asked Haas, for example, if it was a good idea to let children work barefoot in the yard. The answer, she wrote, was obvious: “A barefoot child learns faster to take care of himself, because the feelings he gets through his feet sharpen his understanding.” Her articles are among the rare works on education that stress the importance of tetanus shots. Her attitude is still very much alive on the kibbutz, as I learned when my twin sons were about 4 and their grandfather, the kibbutz electrician, who himself grew up in Haas’s junkyard, went to an old box of toys and pulled out the kids’ saw. The kids’ saw turned out not to be plastic, as I’d expected, but sharp (if rusty) steel—a completely real saw made for kids.\n M born in 1920 to a middle-class family in Berlin, the daughter of a lawyer. Her parents were Jewish but considered themselves German. She was kicked out of school when Nazi race laws came into effect after 1933, joined a Zionist youth movement, and made her way to British Mandate Palestine when she was 15. She stopped using the name her parents gave her, Hilde, and began calling herself Malka, a Hebrew word that means “queen.” According to Elisha, when she boarded the train from Berlin to her new life, her mother gave her a sandwich to eat on the way: “In a characteristic move, she threw it out the window.”\n  Her parents survived in the Nazi capital until 1941, when they escaped on a train to Seville, Spain, and managed to get to the United States. Haas lived through Israel’s War of Independence in 1948, including a battle with invading Iraqi troops by the fields of the kibbutz. She had a little brother whom she met for the first time when he was 22. For a Jewish family in those years, this was a happy story.\n “The children have to know,” Haas told an interviewer in 2010, “that when they work in the yard unexpected things are going to happen. The question is how you learn to deal with it. The entire lives of these children will be dealing with the unexpected, but without meaning to we wrap them in cotton balls.”\n This wasn’t just an educational approach, but an extension of her personality, as her son, a professor of biophysics, described it. His mother came from a social group known here as “ yekkes,” middle-class German Jews whose uptight attitude was out of step with the irreverent egalitarianism of Israel’s founders. (The term literally means “jackets,” an item of clothing for which they supposedly had an irrational attachment despite the climate and the official preference for proletarian khaki.) “The  yekkes don’t hug,” Elisha Haas told me. “They show love another way, by dedication to the child, by investment. That’s how the child knows he’s important.”\n Malka Haas was an autodidact who came about her ideas by herself in her remote valley in the early 1940s, but others were thinking along similar lines in the chaotic years around World War II. The best-known example probably comes from postwar Britain, where Lady Marjory Allen of Hurtwood  proposed an antidote to the mind-numbing four  s’s—swing, seesaw, sandbox, slide—in the form of “adventure playgrounds,” yards of thrilling junk set up on the sites of buildings that had been bombed by the Germans. These ideas flew against other popular theories arguing that young children should be protected from things like bombed-out buildings and granted a world of order and beauty. The Montessori schools, for example, believed that each educational object should be “always beautiful, shining, and in good repair, with nothing missing, so that it looks new to the child, and is complete and ready for use.”\n The truth is that we know little about what actually works for teaching children, Deborah Golden, an education professor at the University of Haifa, told me. Golden is the author of several recent articles about the kibbutz junkyard, part of a modest renewal of interest in Haas’s theories. It’s virtually impossible to know, she said, if a functional adult is that way because her school offered her beautiful toys or a junkyard, or if the credit belongs not to school at all but to her parents or society. “Childhood is a huge space that allows us to imagine ourselves into it,” Golden said. Adults choose educational ideas that make sense to adults. The kibbutz junkyard might appeal to me, in other words, because of the uninspiring safety of my own childhood in Toronto, a place not big on danger. Or, after the past year, because it’s the opposite of the mind-deadening depersonalization of Zoom.\n Israeli kids are allowed more freedom and risk than kids in many Western countries, but even here fashions are now moving in a different direction. Nadav Strizover, a friend of mine who teaches kindergarten in the northern city of Akko, described how several different levels of safety inspectors come regularly to look over the yard where his pupils play, wielding intricate manuals and eliminating hazards that happen to be the activities the kids like most. The inspectors will be happy, he said, when the yard is “a little plastic house standing alone on completely flat synthetic grass.” He studied Haas’s theories, and admires them, but can’t implement them. That’s one reason that today the junkyards can mainly be found on rural kibbutzim, which still have more autonomy than urban kindergartens subject to municipal inspectors and litigious city parents. The new interest in the junkyard idea, said Golden, is driven partly by the sense that it’s endangered—that without proper appreciation, it will be safety-inspected and sued out of existence.\n The kindergarten junkyard was developed in a unique set of circumstances: a poor kibbutz in the 1940s, young parents who’d seen the worst of what the world can deliver and wanted kids who could cope. Perhaps our world is fundamentally different. Today’s parents might have assumed as much when we were growing up. But after the past year, when chaos arrived in Western homes after a few generations of predictability, with formal education in tatters and signs that children are struggling to manage, that argument is harder to make. We might be learning what the young Malka Haas knew: Life won’t go according to plan. It’s going to give us junk, and we’ll have to make it work.", "posttime": "2021-06-17 17:48:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "课程计划,plan,孩子", "title": "她的课程计划是垃圾 ", "title_en": "Her Lesson Plan Was Junk", "transed": 1, "url": "https://www.theatlantic.com/ideas/archive/2021/06/malka-haas-kibbutz-kindergarten-junkyard/619204/", "via": "", "real_tags": ["课程计划", "plan", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "ae820fdcbf1b92f5f199b37d74844c48.jpg", "infoid": 1066417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "飞行赛车电气Alauda MK3在南澳大利亚的测试航班。他们被澳大利亚的民用航空安全管理局观察，他认证了飞机。 Pearson的愿景 - 观看一些航空公司的电影拖车，你可以看到的东西 - 这是一个让人想起星球大战的标志性的傀儡，没有人类或生物。\n 将在2021年举行的前三场比赛，将所有功能驾驶飞机。该公司正在计划早期为2022年的营业展示。\n  未加工的MK3，可达到每小时124英里（200 km / h）的最高速度，重286磅（130千克）。该公司表示，它可以加速0到62英里/小时的2.8秒，比较Tesla模型S或保时捷Taycan。在Fidelity致一级方程式和NASCAR，MK3有一个​​可拆卸电池，可在Pitstops期间快速更换。内部的Pit Step船员已经能够更换由Alauda设计的电池，在20秒内。 MK3能够在单个电池组上飞行10至15分钟，因此在45分钟的比赛中，地面上的飞行员将远程导航飞机落地大约三次PitStop。\n MK3配备了Pearson表示的LIDAR，雷达和机器视觉的组合，避免避免系统。该公司未指定TechCrunch每个工艺上的传感器数量，并拒绝提供有关系统的进一步详细信息，引用专有信息。然而，为飞行赛车设计安全系统的挑战是允许足够的灵活性，使飞机可以尽可能地靠近，而无需彼此抵抗。这对将互相竞争的飞行员来说是一个问题，而且是空军动物的系统。\n Pearson这样的解释如下：“车辆正在互相交谈，他们知道其他人在哪里，他们都以相同的算法以相同的方式解决碰撞避免问题。所以他们知道他们可以预测彼此的行为。作为这种碰撞避免的框架，而且在其中，我们希望尽可能多地提供飞行员和尽可能多的控制。所以拨打屏障在飞行员和机器之间拨打的地方是一个非常有趣的东西。“\n  虽然诱人的旨在比较正在开发空中出租车服务的主要Evtol公司，但Pearson表示，电动飞行赛车的商业化经济和路径不同。 “商业化模型更加迅速，”他说。 “在任何人都可以在商业运营之前，我们可以比赛。”\n 他们可以如此敏捷的一个原因是因为其认证途径与旨在梭人的空中出租车所需的认证途径非常不同。这些初创公司可以花费数亿美元 - 通过一些估计 - 关于一架飞机模型的设计，认证和制造，最多数亿美元 - 高达10亿美元。 MK3正在与澳大利亚民航安全管理局的实验认证下飞行，这意味着虽然它必须满足某些安全和适航标准，但监管负担远远低于客机。 \n“关于我们的计划的重要事项是将车辆保持在不断的发展周期。 因此，而不是试图建造一辆车，然后在10年内证明它，我们每年都试图建造新飞机，“他解释说。 “这不是航空如何正常运作的。 当然，如果你想进入乘客应用程序，那不是你的方式。“  Airspeeder于4月2020年4月的第一个资金循环，以澳大利亚投资者盐水资本和墨西克风险投资领导的未指明金额。 Pearson表示，他还提供资本，他们设法吸引了物流公司BHL和Luxury Watch Maker IWC Schaffhausen的合作伙伴关系。 该公司拒绝提供进一步的具体细节，了解如何从地上为一项小型航空制造业务提供资金。 ", "note_en": "That flying race car, the electric Alauda Mk3, had its test flights in south Australia. They were observed by Australia’s Civil Aviation Safety Authority, who certified the aircraft. Pearson’s vision – and what you can see by watching some of Airspeeder’s  cinematic trailers – is a race somewhat reminiscent of Star Wars’ iconic podracing, without a human or creature in the pilot seat.\n The first three races, which are set to take place in 2021, will all feature remotely piloted aircraft. The company is planning for a crewed showcase as early as 2022.\n  The unpiloted Mk3, which can reach top speeds of 124 miles per hour (200 km/h), weighs just 286 pounds (130 kg). It can accelerate from 0 to 62 mph in 2.8 seconds, the company said, likening it to the Tesla Model S or the Porsche Taycan. In fidelity to Formula One and NASCAR, the Mk3 has a removable battery for quick replacement during pitstops. In-house pitstop crews have been able to replace the battery, which was designed by Alauda, in just under 20 seconds. The Mk3 is able to fly 10 to 15 minutes on a single battery pack, so during a 45-minute race, pilots on the ground will remotely navigate the aircraft to land for a pitstop about three times.\n Mk3 is equipped with a combination of LiDAR, radar and machine vision that Pearson said creates a collision avoidance system. The company did not specify to TechCrunch the number of sensors that are on each craft and declined to provide further details on the system, citing proprietary information. The challenge of designing a safety system for a flying race car, however, is allowing enough flexibility so that the aircraft can get as close together as possible, without actually hitting each other. This is a problem for the pilots who will be competing against each other, but also Airspeeder’s system.\n Pearson explained it like this: “The vehicles are talking to each other, they know where the others are and they’re all solving the collision avoidance problem in the same way using the same algorithm. So they know they can predict each other’s behavior. There’s that as the kind of framework for collision avoidance, but inside that, we want to give the pilots as much freedom and as much control as possible. So dialing up where the barrier is between pilot and machine is going to be a really interesting thing.”\n  While it’s tempting to draw comparisons to major eVTOL companies that are developing air taxi services, Pearson said the economics and path to commercialization for electric flying race cars is different. “The commercialization model is a lot more rapid,” he said. “We can be racing before anyone can be in commercial operations.”\n One reason why they can be so agile is because its certification pathway is very different from that required by air taxis designed to shuttle people. Those startups can spend many hundreds of millions of dollars – up to $1 billion, by some estimates – on the design, certification, and manufacture of a single aircraft model. The Mk3 is flying under an experimental certification with Australia’s Civil Aviation Safety Authority that means that while it must meet certain safety and airworthiness standards, the regulatory burden is far less than for a passenger aircraft.\n “The important thing about our program is to keep the vehicles in constant development cycles. So instead of trying to build one vehicle, and then certify it over 10 years, we’re trying to build new aircraft every year,” he explained. “It’s not how aviation really functions normally. And certainly, if you want to get into passenger applications, that’s not how you do it.”\n Airspeeder had its first funding round in April 2020 for an unspecified amount, which was led by Australian investors Saltwater Capital and Jelix Ventures. Pearson said he’d also provide capital, and they’ve managed to attract partnerships from logistics company BHL and luxury watch maker IWC Schaffhausen. The company declined to provide further specifics on how it’s managed to fund a small-scale aeronautics manufacturing operation from the ground up.", "posttime": "2021-06-17 17:13:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电动,electric", "title": "Airspeeder希望在2021年使电动飞行赛车成为现实 ", "title_en": "\n\t\t\t\tAirspeeder wants to make electric flying racing cars a reality in 2021\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/airspeeder-wants-to-make-electric-flying-racing-cars-a-reality-in-2021/", "via": "", "real_tags": ["电动", "electric"]}, {"category": "", "categoryclass": "", "imagename": "fbe6dce23f0d9a0d894c071ea46aeba6.png", "infoid": 1066415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "错误：1 https://packages.microsoft.com/ubuntu/20.04/prod focal / main amd64 dotnet-host amd64 5.0.7-1 404未找到[IP：104.214.230.139 443]错误：2 https：//包.microsoft.com / ubuntu / 20.04 / prod focal / main amd64 dotnet-hostfxr-3.1 amd64 3.1.16-1 404未找到[IP：104.214.230.139 443]错误：3 https://packages.microsoft.com/ubuntu /20.04/prod焦点/主amd64 dotnet-runtime-deps-3.1 amd64 3.1.16-1 404未找到[IP：104.214.230.139 443]错误：4 https：//packages.microsoft.com/ubuntu/20.04/prod Focal / Main AMD64 Dotnet-Runtime-3.1 AMD64 3.1.16-1 404未找到[IP：104.214.230.139 443]错误：5 https://packages.microsoft.com/ubuntu/20.04/prod焦点/主amd64 aspnetcore- Runtime-3.1 AMD64 3.1.16-1 404未找到[IP：104.214.230.139 443] err：6 https://packages.microsoft.com/ubuntu/20.04/prod焦点/主amd64 dotnet-apphost-pack-3.1 amd64 3.1.16-1 404未找到[IP：104.214.230.139 443] err：7 https://packages.microsoft.com/ubuntu/20.04/prod focal / main amd64 dotnet-sdk-3.1 amd64 3.1.410-1 404找不到[IP：10 4.214.230.139 443] E：无法获取https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-host/dotnet-host-5.0.7-x64.deb 404未找到[IP：104.214.230.139 443] E：未能获取https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-hostfxr-3.1/dotnet-hostfxr-3.1.16-x64 .DEB 404未找到[IP：104.214.230.139 443] E：未能获取https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-runtime-deps-3.1/dotnet- Runtime-Deps-3.1.16-x64.deb 404未找到[IP：104.214.230.139 443] E：未能获取https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet -runtime-3.1 / dotnet-runtime-3.1.16-x64.deb 404未找到[IP：104.214.230.139 443] E：未能获取https://packages.microsoft.com/ubuntu/20.04/prod/pool/ main / a / aspnetcore-runtime-3.1 / aspnetcore-runtime-3.1.16-x64.deb 404未找到[IP：104.214.230.139 443] E：未获取https://packages.microsoft.com/ubuntu/20.04 /prod/pool/main/d/dotnet-apphost-pack-3.1/dotnet-apphost-pack-3.1.16-x64。 NED 404未找到[IP：104.214.230.139 443] E：未能获取https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-sdk-3.1/dotnet-sdk-3.1 .410-x64.deb 404未找到[IP：104.214.230.139 443] ", "note_en": "Err:1 https://packages.microsoft.com/ubuntu/20.04/prod focal/main amd64 dotnet-host amd64 5.0.7-1 404 Not Found [IP: 104.214.230.139 443]Err:2 https://packages.microsoft.com/ubuntu/20.04/prod focal/main amd64 dotnet-hostfxr-3.1 amd64 3.1.16-1 404 Not Found [IP: 104.214.230.139 443]Err:3 https://packages.microsoft.com/ubuntu/20.04/prod focal/main amd64 dotnet-runtime-deps-3.1 amd64 3.1.16-1 404 Not Found [IP: 104.214.230.139 443]Err:4 https://packages.microsoft.com/ubuntu/20.04/prod focal/main amd64 dotnet-runtime-3.1 amd64 3.1.16-1 404 Not Found [IP: 104.214.230.139 443]Err:5 https://packages.microsoft.com/ubuntu/20.04/prod focal/main amd64 aspnetcore-runtime-3.1 amd64 3.1.16-1 404 Not Found [IP: 104.214.230.139 443]Err:6 https://packages.microsoft.com/ubuntu/20.04/prod focal/main amd64 dotnet-apphost-pack-3.1 amd64 3.1.16-1 404 Not Found [IP: 104.214.230.139 443]Err:7 https://packages.microsoft.com/ubuntu/20.04/prod focal/main amd64 dotnet-sdk-3.1 amd64 3.1.410-1 404 Not Found [IP: 104.214.230.139 443]E: Failed to fetch https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-host/dotnet-host-5.0.7-x64.deb 404 Not Found [IP: 104.214.230.139 443]E: Failed to fetch https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-hostfxr-3.1/dotnet-hostfxr-3.1.16-x64.deb 404 Not Found [IP: 104.214.230.139 443]E: Failed to fetch https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-runtime-deps-3.1/dotnet-runtime-deps-3.1.16-x64.deb 404 Not Found [IP: 104.214.230.139 443]E: Failed to fetch https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-runtime-3.1/dotnet-runtime-3.1.16-x64.deb 404 Not Found [IP: 104.214.230.139 443]E: Failed to fetch https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/a/aspnetcore-runtime-3.1/aspnetcore-runtime-3.1.16-x64.deb 404 Not Found [IP: 104.214.230.139 443]E: Failed to fetch https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-apphost-pack-3.1/dotnet-apphost-pack-3.1.16-x64.deb 404 Not Found [IP: 104.214.230.139 443]E: Failed to fetch https://packages.microsoft.com/ubuntu/20.04/prod/pool/main/d/dotnet-sdk-3.1/dotnet-sdk-3.1.410-x64.deb 404 Not Found [IP: 104.214.230.139 443]", "posttime": "2021-06-17 17:06:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,microsoft,https", "title": "由于空间问题，Microsoft Ubuntu存储库被打破了 ", "title_en": "Microsoft Ubuntu repositories are broken because of space issues", "transed": 1, "url": "https://github.com/dotnet/core/issues/6381", "via": "", "real_tags": ["ubuntu", "microsoft", "https"]}, {"category": "", "categoryclass": "", "imagename": "81e8a9c1a88d70dc628bdc61f1cd181a.jpeg", "infoid": 1066414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当大多数计算机科学家如何考虑信息检索时，统计关键字算法如TF-IDF和BM25可能会想到。这些部署在开源系统中，例如Apache Lucene和Apache Solr。关键字搜索的云版本可以从Elasticsearch和Algolia等公司提供。\n 您可能不知道的是，自然语言处理（NLP）的进步，特别是在2017年引入变形金刚，已经迎来了一种新的信息检索的味道，以各种信息检索（短暂的短路）和语义搜索。这些系统的定义特征是它们应用神经网络以了解比关键字搜索更深入的语言。这使得它们能够表面更广泛的相关内容，同时显示更精确的结果。\n 神经红外系统在他们的初期，如果您对此领域的更深入了解，我建议使用Mitra和Craswell的神经信息介绍。 2020年初发布的亚马逊肯德拉是此类系统的第一个商业示例，而Microsoft语义搜索，于2021年4月发布，ZIR语义搜索是最近的。\n  在本文的其余部分，我们将建立一个小集合的搜索。我将使用Zir的语义搜索平台，因为它的设计简单且经济地集成到SaaS和PaaS产品中，并且具有独特的索引和搜索多种语言内容的能力。您可以从amin3141 / zir下载来自Github的本教程的源代码-souffle。\n  Importank DataSet酒店提供各地主要城市广泛的酒店点评。出于演示的目的，我们将建立在旧金山的三家最审查的酒店搜索：渔民喜来登托斯卡纳酒店，渔夫码头酒店，威斯汀酒店和圣弗朗西斯威斯汀酒店。\n 数据文件具有简单的标签分隔格式。第一列是审查日期，第二列是标题，第三列是实际文本：\n 2009年2009年的酒店已经访问了旧金山几次，这... 15 2009年的优越位置和我的朋友和我的朋友和我... 13 2009年的完美体验这家酒店非常完美。这是一个辉煌的位置...... \n首先，我们将对自己的JSON文档分开，并将其另存为单独的文件。我们将包括酒店的名称和审查日期，因为元数据（Zir语义搜索使用搜索结果自动返回元数据。）\n {“DocumentId”：1036995557202582223269989080822232699890258222326998908822232699890，“metadatajson”：“{\\”date \\“2005年4月23日”，\\“Hotel \\”：\\“best_western_tuscan_inn_fisherman_s_wharf_a_kimpton_hotel \\”}“，”部分“：[{”text“ ：“我们在托斯卡纳旅馆度过了六晚，只有这家酒店的狂欢评论位置是完美的。步行距离到缆车，码头，公共汽车47和F线。有友好的员工的大餐厅。每个人都很愉快，非常乐于助人。漂亮的干净房间和私下卫生间。我们急于返回！玛丽和杰克从Scituate Ma“}”，“Title”：“Great Hotel”}\n 文档ID是Murmur3 x64 128位哈希完全审查。返回搜索结果后，包含此ID，允许查询系统轻松检索完整文档。为了便于查找，实现此逻辑的ImportRank2json.py程序还创建了一个SQLite数据库，其中包含文件中的所有审查，由文档ID键入。\n  就像与Algolia和Elasticsearch这样的关键字搜索系统一样，您必须按下要搜索的内容，以便可以索引。除了基于UI的拖放之外，ZIR语义搜索还提供了基于GRPC的API，以支持快速原型设计。\n 使用左手菜单导航到语料库，并创建一个名为“酒店评论”的新语料库。语料库只是可以在以后查询的文档和文本材料集合。\n 点击并打开酒店评论语料库。将包含Review JSON文档的文件夹拖放到语料库中。\n  在附加的五到十分钟内，文件将可搜索。您可以通过在托管的UI选项卡上运行查询并检查正在返回的结果来验证这一点。 \n由于对该平台进行了身份验证，因此我们需要一个有效的用户来连接并运行查询。目前，我们将使用OAuth 2.0客户端凭据流动为方便起见。通常，当客户端在可信环境中运行时，您应该只使用此流程，并且凭据可以保持安全，例如在运行服务器中。\n  使用左手菜单，导航到身份验证→应用程序客户端，然后单击“创建App Client”按钮。\n 给它一个名字（例如，酒店 -  CLI），将类型设置为客户端凭据，并输入回调和注册的任何URL（例如https://auth.zir.dev）。请注意客户端ID和客户端秘密，因为连接和运行查询时，您需要它们。\n 点击回到语料库中，单击授权选项卡，然后单击“创建角色”按钮。选择您在步骤二中创建的应用程序客户端，并在语料库上授予查询权限。\n  信息检索的神经方法围绕着单词，句子和段落的矢量化。神经网络是将短语作为输入的数学函数，并产生高维向量作为输出。这些矢量以这种方式代表了这种短语的语义，这种方式与相关语义的短语共享矢量空间中的几何结构。这些载体经常被称为嵌入。\n 由于这种抽象质量，神经系统对拼写错误和其他拼写错误系统的鲁棒性是强大的。相比之下，关键字系统通常必须配置停止字删除，单词源头和法术校正，以便获得良好的效果。\n 要保持本教程简单，我们将构建一个基于Python的命令行解释器，接受查询并返回前面添加的客户评论的顶级匹配结果。 ZIR语义搜索在每个结果中返回以下信息： \n文档ID和元数据。客户端使用此信息将结果加入原始信息源，并在上下文中显示它。我们将使用文档ID查找完整审查并显示它。\n 相关片段。文档通常涵盖许多主题，因此搜索结果包括它标识为最相关的部分。作为一般规则，在向用户显示此代码段时显示一点点周围文本有助于。\n 分数。分数是一个与搜索结果信心相关的实数。重要的是，分数不是校准的概率，因此应该谨慎地解释。但是，它可以安全地使用，适用于下游机器学习型号，如重新登记。\n 我在宾馆实施了一个完整的客户。下面的代码显示了如何使用requests库提交查询。\n   下面的动画GIF显示了交互式语义搜索会话。第一个问题的结果，“房间是宽敞的”，证明了搜索了解宽敞的单词的语义，因此可以像“只有缺点是房间大小”一样返回结果。\n 第二个查询询问关于“附近的用餐”，搜索能够返回没有关键字重叠的相关结果，如“Alos [SiC]，相邻餐厅的食物非常好！”\n  最后，第三个查询故意拼写拼写一个关键术语“早餐Bufet”，并搜索的搜索可供自助早餐甚至早上自助餐！ \n大量的研究已经建立了与抚摸和令人满意的用户相关的重要性。 例如，Microsoft的2012年研究展示了与Bing搜索中的用户参与中的劣化相关性和长期缩减之间的因果关系。 通过超越关键字，谷歌着名的Alta Vista，Lycos和其他人在排名搜索结果时融入有关网页链接结构的信息。  无论您的目标是提高用户订阅，还是您只想帮助您的用户快速找到最相关的信息，您每天都要以缺失和无关的搜索结果的形式支付高昂的关键字搜索。 作为电子商务，客户支持，企业搜索和法律电子发现的应用程序都可以从语义搜索技术的出现中受益，这是为了重新估计信息检索的景观。 ", "note_en": "When most computer scientists think of information retrieval, statistical keyword algorithms like TF-IDF and BM25 probably come to mind. These are deployed in open source systems such as Apache Lucene and Apache Solr. Cloud versions of keyword search are available from companies like Elasticsearch and Algolia.\n What you may not know is that advancements in natural language processing (NLP), particularly the introduction of transformers in 2017, have ushered in a new flavor of information retrieval known variously as neural information retrieval (neural IR for short) and semantic search. The defining characteristic of these systems is that they apply neural networks to understand language at a deeper level than keyword search. This enables them to surface a broader variety of relevant content, while showing results with greater precision.\n Neural IR systems are in their infancy, and I would recommend  An Introduction to Neural Information Retrieval by Mitra and Craswell if you’re interested in gaining a deeper appreciation of the field.  Amazon Kendra, released early in 2020, is the first commercial example of such a system, while  Microsoft Semantic Search, released in April 2021, and  ZIR Semantic Search are more recent.\n  In the rest of this article, we’ll build a search over a small collection ofhotel reviews. I’ll use ZIR’s semantic search platform because it’s designedfor easy and affordable integration into SaaS and PaaS products, and has the unique ability to index and search content across several languages.You can download the source code for this tutorial from GitHub at  amin3141/zir-souffle.\n  The  OpinRank Dataset includes an extensive collection of hotel reviews from major cities around the world. For the purposes of the demo, we’re going to build a search over the three most-reviewed hotels in San Francisco: Best Western Tuscan Inn, Sheraton Fisherman’s Wharf Hotel, and The Westin St. Francis.\n The datafile has a simple tab-delimited format. The first column is the date of the review, the second column is the title, and the third column is the actual text:\n 16  2009 The Prefect Hotel Have visited San Francisco several times and this…   15  2009 Great location and great hotel My friend and I…   13  2009 Perfect experience This hotel was perfect. It was a brilliant location…\n To begin with, we’ll separate every review into its own JSON document and save it as a separate file. We’ll include the name of the hotel and the date of the review as metadata (ZIR Semantic Search returns metadata automatically with search results.)\n { “documentId”:  1036995557631769528072025822232699890, “metadataJson”: “{\\” date\\”: \\”Apr  23  2005\\”, \\”hotel\\”: \\”best_western_tuscan_inn_fisherman_s_wharf_a_kimpton_hotel\\”}”, “section”: [ { “ text”: “We spent six nights at the Tuscan Inn  and have  nothing but rave reviews  for this hotel! The  location was perfect. Walking distance  to Cable Cars,Wharf, Bus  47  and F  Line. Great restaurant  with a friendly staff. Everyone was pleasant  and very helpful. Nice clean rooms  and a spaciousbathroom. We are anxious  to  return!Mary  and Jack  from Scituate MA” } ], “title”: “Great Hotel”}\n The document ID is the  murmur3 x64 128-bit hash of the full review. When search results are returned, this ID is included, which allows the querying system to easily retrieve the full document. To facilitate lookup, the  opinrank2json.py program, which implements this logic, also creates a SQLite database containing all the reviews in the files, keyed by document ID.\n  Just as with keyword search systems like Algolia and Elasticsearch, you must push the content you want to search into the platform so that it can be indexed. ZIR Semantic Search provides gRPC-based APIs for doing this, in addition to UI-based drag-and-drop to support rapid prototyping.\n Use the left hand menu to navigate to corpora, and create a new corpus named “Hotel Reviews”. A corpus is just a named collection of documents and textual material that can be queried later.\n Click and open the Hotel Reviews corpus. Drag and drop the folder containing the review JSON documents into the corpus.\n  Within five to ten minutes of being added, the documents will become searchable. You can verify this by running a query on the Hosted UI tab and checking that results are being returned.\n  Since all access to the platform is authenticated, we’ll need a valid user toconnect and run queries. For now, we’ll use the OAuth 2.0 Client Credentials Flow for convenience. Normally, you should only use this flow when the client is running in a trusted environment and the credentials can be kept secure, such as within a running server.\n  Using the left hand menu, navigate to Authentication →  App Client, and click on the “Create app client” button.\n Give it a name (e.g. hotels-cli), set the type to Client Credentials, and enter any URL for callback and signout (e.g.  https://auth.zir.dev). Note the  client id and  client secret, as you’ll need them both when connecting and running queries.\n Click back to the corpus, click the  Authorization tab, and click the “Create Role” button. Choose the app client you created in step two and grant query privileges on the corpus to it.\n  Neural approaches to information retrieval revolve around vectorization of words, sentences, and paragraphs. The neural network is the mathematical function that takes a phrase as input and produces a high dimensional vector as output. These vectors represent the semantics of the phrase in such a way that phrases with related semantics share geometric structure in the vector space. These vectors are frequently referred to as  embeddings.\n Due to this abstractive quality, neural systems are robust to misspellingsand other typos which throw off keyword systems. In contrast, keyword systems must generally configure stop word removal, word stemming, and spell correction in order to get good results.\n To keep the tutorial simple, we’ll build a Python based command-line interpreter that accepts queries and returns top matching results from the customer reviews we added earlier. ZIR Semantic Search returns the following information in every result:\n The document ID and metadata. The client uses this information to join the result to the original information source, and display it in context. We’ll use the document ID to lookup the full review and display it.\n The relevant snippet. A document generally covers many topics, so the search result includes the part it identifies as the most relevant. As a general rule, it’s helpful to display a little bit of the surrounding text when displaying this snippet to your users.\n A score. The score is a real number that correlates with confidence in the search result. Importantly, the score is  not a calibrated probability, so it should be interpreted with caution. However, it can safely be used as-is for downstream machine learned models such as rerankers.\n I’ve implemented a complete client in  hotels.py. The code below shows how the query is submitted using the  requests library.\n   The animated gif below shows an interactive semantic search session. The results for the first question, “are the rooms spacious”, demonstrate that the search understands the semantics of the word  spacious, and can therefore return results like “Only drawback is room size”.\n The second query asks about “nearby dining”, and the search is able to return relevant results  without keyword overlap, like “Alos [sic], the food in the adjoining restaurant was very good!”\n  Finally, the third query intentionally misspells a key term, “breakfast bufet”, and the search nevertheless returns results for  breakfast buffet and even  morning buffet!\n  A great deal of research has established the importance of relevance in engaging and satisfying users. For example, a  2012 study by Microsoft demonstrated a causal link between degraded relevance and long-term reductions in user engagement with Bing Search. And Google famously outmaneuvered Alta Vista, Lycos, and others by moving beyond keywords to incorporate information about the linking structure of web pages when ranking search results.\n Whether your objective is to improve user engagement, or you simply want to help your users quickly find the most relevant information, you pay the high cost of keyword search every day in the form of missing and irrelevant search results. Applications as diverse as e-commerce, customer support, enterprise search, and legal e-discovery all stand to benefit from the emergence of semantic search technology, which is poised to resculpt the landscape of information retrieval.", "posttime": "2021-06-17 17:06:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "搜索,cost", "title": "关键字搜索的高成本 ", "title_en": "The High Cost of Keyword Search", "transed": 1, "url": "https://blog.zir-ai.com/the-high-cost-of-keyword-search", "via": "", "real_tags": ["搜索", "cost"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066413, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "帖子尚未标记为JWESTVER的JWESTVER的投票邮寄邮票  这将是不幸的。 我们如何说服您＆＃39; ll将其放在释放中。  我一直试图自己汇编。 https://mac-dev-env.patrickbougie.com/php/的说明是关闭。一些试验和错误。缺少apachs缺少apsx  添加评论  这是一个巨大的一步向后。 关于MacOS的一个很好的东西是内置的Apache，包括PHP。 请重新考虑这一点。 ", "note_en": "Post not yet marked as solved     Up vote post of jwestveer       Down vote post of jwestveer\n  That would be unfortunate. How can we convince you&#39;ll to put it back in the release.\n    I have been trying to compile it myself. Instructions at  https://mac-dev-env.patrickbougie.com/php/ are close.Perhaps some trial and error.First issue is apsx is missing from apache\n   Add a Comment\n  This is a giant step backwards. One of the nice things about macOS is the built in apache including PHP. Please reconsider this.", "posttime": "2021-06-17 17:05:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "monterey,removed,jwestver", "title": "PHP已在MacOS Monterey中删除 ", "title_en": "PHP has been removed in macOS Monterey", "transed": 1, "url": "https://developer.apple.com/forums/thread/681907", "via": "", "real_tags": ["monterey", "removed", "jwestver"]}, {"category": "", "categoryclass": "", "imagename": "67d275740065584804037db899266f7b.jpg", "infoid": 1066410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "主要银行的互联网服务和支付终端以及其他主要品牌的网站，周四下午在周四下线，似乎是一个广泛使用的DDoS缓解服务的问题。\n 用户报告广泛的问题来自CBA，Westpac，Anz，Ubank，AMP Bank，Macquarie Bank，Me Bank等的CBA，Westpac，Anz，Ubank，AMP Bank，Me Bank等的一系列互联网属性和在线服务。\n 根本原因似乎是Akamai的分布式拒绝（DDOS）缓解平台的问题。\n “如果你面对停机时间，请关心/路线拓展，”通过在Akamai的网站上通过聊天达到的客户服务代理商建议。\n   代理人表示，没有其他信息可以提供，但是Akamai的“技术团队正在努力”。\n 在社交媒体渠道中进行了类似的披露，并且源类似地证实了作为原因。\n  ＆＃34;我们知道问题并积极努力尽快恢复服务，＆＃34;发言人说。 \n一个消息来源告诉ITNews，中断对维尔京澳大利亚的飞行业务产生了影响，门口无法访问航空公司的IT系统大约半小时，但这已经解决了。  主要银行通过社交媒体渠道对客户面临大量批评，许多左侧搁浅在销售点，无法完成交易。  ＆＃34;外部中断目前正在影响我们的一些服务，＆＃34; 它说。 ＆＃34;我们正在调查，并随着更多信息，您可以保持更新。＆＃34;  更新，5.35PM：这个故事最初表示eftpos是＆＃34;基于服务SA和最终用户等公司用户的建议。 eftpos发言人澄清了eftpos本身不是＆＃34;下降＆＃34;，虽然用户无法访问其服务。 故事已被纠正以反映这一点。 ", "note_en": "Major banks’ internet services and payment terminals, as well as websites for other major brands, went offline on Thursday afternoon in what appears to be an issue with a widely-used DDoS mitigation service.\n Users reported widespread problems accessing a range of internet properties and online services from  the likes of CBA, Westpac, ANZ, UBank, AMP Bank, Macquarie Bank, ME Bank and more.\n The root cause appears to be an issue with Akamai’s distributed denial-of-service (DDoS) mitigation platform, Prolexic.\n “If you face the downtime, kindly turn off/route off Prolexic solution,” a customer service agent reached via chat on Akamai’s website advised.\n   The agent said there was no other information that could be offered but that Akamai’s “technical team are working on it.”\n Similar disclosures were made in social media channels, and sources similarly confirmed Prolexic as the cause.\n  &#34;We are aware of the issue and actively working to restore services as soon as possible,&#34; a spokesperson said.\n A source told  iTnews that the outage was having an impact on Virgin Australia’s flight operations, with gate crew unable to access the airline’s IT systems for about half an hour, but this had since been resolved.\n Major banks were facing large amounts of criticism from customers via social media channels, with many left stranded at the point-of-sale, unable to complete transactions.\n  &#34;An external outage is currently impacting a number of our services,&#34; it said. &#34;We are investigating and will keep you updated as more information is available.&#34;\n  Updated, 5.35pm: This story originally stated that eftpos was &#34;down&#34;, based on advisories from corporate users such as  Service SA, and end users. An eftpos spokesperson has since clarified that eftpos itself was not &#34;down&#34;, although users could not access its services. The story has been corrected to reflect this.", "posttime": "2021-06-17 17:05:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "eftpos,banks,akamai", "title": "主要银行在线服务，eftpos，航空系统下降 ", "title_en": "Major banks' online services, eftpos, airline systems go down", "transed": 1, "url": "https://www.itnews.com.au/news/major-banks-online-services-eftpos-airline-systems-go-down-566080", "via": "", "real_tags": ["eftpos", "banks", "akamai"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试全数字访问，了解为什么超过100万读者订阅FT  选择购买审判订阅$ 1持续4周，您将在审判结束后每月收费91美元  4周接收无限的优质数字访问FT＆＃39; S值得信赖，获奖的商业新闻  礼品文章 - 每月分享最多10条与家人，朋友和同事 ", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1 for 4 weeks   You will be billed $91 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2021-06-17 16:23:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "金融时报,financial,订阅", "title": "金融时报 ", "title_en": "Financial Times", "transed": 1, "url": "https://www.ft.com/content/1a489db5-1d79-4e2c-bd52-d693dae142c6", "via": "", "real_tags": ["金融时报", "financial", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "b603180b72153f2bd39eec1eaec9ebc3.png", "infoid": 1066407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为Windows，Linux和Mac的应用程序运行。 或在服务器上的Docker容器中和客户端上的Web浏览器中。  免费表编辑器 - 快速表数据编辑（导入/导出前的清理数据，原型表等）  归档 - 在使用Web应用程序时，在本地文件系统上的JSON文件中备份您的数据（或在DBGATE服务器上）  创建问题，如果您在应用程序中找到问题，或者您对新功能有影响。 如果问题已经存在，您可以对其进行评论，以优先考虑最受欢迎的问题。  告诉你的朋友关于DBGATE或分享社交网络 - 当更多人将使用DBGATE时，它将成长更好  Working WheSwork  -  Windows，Linux，Mac，Web浏览器（+ Mobile Web计划），没有妥协  基于独立的NPM包，可以在没有DBGATE的情况下运行脚本（例如 -  CSV导出） \n许多数据浏览功能基于外键 -  Master / Detail，展开列，可扩展表单视图（上面的截图）\n  应用简单性 -  Dbgate采取最好的，唯一的旧DBGate，Datadmin和DBMouse。\n  Indecended  - 将在Server上的单个Docker容器中作为Web应用程序运行，或者在Linux，Windows和Mac上使用电子平台的应用程序\n  插件是NPMJS.com上发布的标准NPM包。查看所有现有的dbgate插件。访问DBGate Generator主页查看，如何创建自己的插件。\n   基本的插件集是DBGATE GIT存储库的一部分，并安装了应用程序。从NPM下载附加插件符号（此任务由dbgate处理）\n   如果要在图书馆或插件中进行修改，请在第二终端中运行Watch模式的库编译器：\n      此模式与电子应用的生产运行非常相似。 Electron App Forks在动态分配的端口上使用API​​，与编译的JavaScript文件一起使用，并使用编译版本的插件（不使用localhost：5000） ", "note_en": "Runs as application for Windows, Linux and Mac. Or in Docker container on server and in web Browser on client.\n  Free table editor - quick table data editing (cleanup data after import/before export, prototype tables etc.)\n Archives - backup your data in JSON files on local filesystem (or on DbGate server, when using web application)\n   Create issue, if you find problem in app, or you have idea to new feature. If issue already exists, you could leave comment on it, to prioritise most wanted issues.\n Tell your friends about DbGate or share on social networks - when more people will use DbGate, it will grow to be better\n   Works everywhere - Windows, Linux, Mac, Web browser (+mobile web is planned), without compromises in features\n Based on standalone NPM packages, scripts can be run without DbGate (example -  CSV export )\n Many data browsing functions based using foreign keys - master/detail, expand columns, expandable form view (on screenshot above)\n  Application simplicity - DbGate takes the best and only the best from old  DbGate,  DatAdmin and  DbMouse .\n  Platform independed - will run as web application in single docker container on server, or as application using Electron platform on Linux, Windows and Mac\n  Plugins are standard NPM packages published on  npmjs.com. See all  existing DbGate plugins. Visit  dbgate generator homepage to see, how to create your own plugin.\n   Basic set of plugins is part of DbGate git repository and is installed with app. Additional plugins pust be downloaded from NPM (this task is handled by DbGate)\n   If you want to make modifications in libraries or plugins, run library compiler in watch mode in the second terminal:\n      This mode is very similar to production run of electron app. Electron app forks process with API on dynamically allocated port, works with compiled javascript files and uses compiled version of plugins (doesn&#39;t use localhost:5000)", "posttime": "2021-06-17 16:23:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,数据库,database,开源,open", "title": "dbgate  - 开源数据库客户端 - 现在支持SQLite ", "title_en": "DbGate – open-source database client – now supports SQLite", "transed": 1, "url": "https://github.com/dbgate/dbgate", "via": "", "real_tags": ["sqlite", "数据库", "database", "开源", "open"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我只是花了两个多小时的故障排除了一个看似简单的HTML问题。当我复制并粘贴了一小部分HTML时，Web浏览器会从原始浏览到新的截面。某些元素之间的水平间距略有不同，导致整个页面看起来不对劲。但这怎么可能？这两个HTML部分是相同的 - 新的部分实际上是旧的副本。\n 这个简单的探测问题藐视我所有的尝试解释它。我想出了许多伟大的理论：我的CSS课程或利润和填充物的问题。不匹配的HTML标记。浏览器错误。我尝试了三个不同的浏览器，并在所有浏览器中得到了相同的结果。\n 感到非常困惑，我再次在Wordpress编辑器（文本视图）中的HTML的两部分看看，并确认它们完全相同。然后我尝试了Firefox的内置Web开发人员工具，以查看页面的渲染元素，并比较所有CSS属性。相同 - 但不知何故，他们渲染不同。我使用开发人员工具来检查从我的Web服务器接收的确切HTML，再次选中这两个部分，并验证了它们是字符相同的字符。 Firefox的“页面来源”工具还确认了两部分完全相同。\n 到这一点，我准备责备宇宙射线或伏都教魔法。我发现任何时候我都复制了任何类似的HTML部分，那么新的粘贴部分将出现在浏览器中，具有错误的元素间距。这可能是怎么样的？然后，我尝试了W3C验证器，它发现了我的页面的一些其他问题，但没有任何可以解释这种行为。再一次，它确认，尽管在浏览器中呈现不同，但HTML的两部分是相同的。\n 显然有些东西没有加起来。我用卷曲从我的Web服务器下载网页，查看本地副本，并看到了与以前相同的行为。但是当我用十六进制编辑器打开存储的.html文档时，我终于答案了。 HTML的两部分不相同：一个部分使用了另一个不同类型的空间字符。\n  我发现原始的HTML部分包含了不破坏的空间。但不是用＆amp; nbsp编码它们;实体，它们直接编码为Unicode字符C2A0。我不确定这是怎么发生的，但我责怪WordPress。在WordPress HTML Editor中查看此部分时，C2A0空间出现类似于普通空格，并复制编辑器内的部分静默转换为具有十六进制值20的正常空间。因此，即使是呈现的复制版本源HTML似乎是相同的。\n 这就像21世纪版本的混淆零，大写字母o，但更糟糕。我甚至不知道未破坏的空间有一个unicode字符值 - 我认为＆amp; nbsp;是编码它们的唯一方法。我将HTML恢复到了使用＆amp; nbsp;现在这一切都适用。 \n我很惊讶于如何在HTML源中的空间类型之间揭示这种微妙但是重要的区别。 WordPress HTML编辑器无法显示或正确处理差异。 Firefox Web开发人员工具和页面源工具失败。 W3C验证器的源视图失败。 卷曲加一个十六进制编辑器是最终建立关于HTML源的精确内容的地面真实的唯一方法。  阅读6条评论并加入对话 ", "note_en": "I just spent more than two hours troubleshooting a seemingly simple HTML problem. When I copied and pasted a small section of HTML, the web browser displayed the newly-pasted section differently from the original. The horizontal spacing between some of the elements was slightly different, causing the whole page to look wrong. But how could this be? The two HTML sections were identical – the new one was literally a copy of the old one.\n This simple-sounding problem defied all my attempts to explain it. I came up with lots of great theories: problems with my CSS classes, or with margins and padding. Mismatched HTML tags. Browser bugs. I tried three different browsers and got the same results in all of them.\n Feeling very confused, I looked again at the two sections of HTML in the WordPress editor (text view), and confirmed they were exactly identical. Then I tried Firefox’s built-in web developer tools to view the page’s rendered elements, and compared all their CSS properties. Identical – yet somehow they rendered differently. I used the developer tools to examine the exact HTML received from my web server, checked the two sections again, and verified they were character-for-character identical. Firefox’s “page source” tool also confirmed the two sections were exactly identical.\n By this point I was getting ready to blame cosmic rays or voodoo magic. I discovered that any time I copy-pasted any similar HTML section, the newly-pasted section would appear in the browser with the wrong element spacing. How could this possibly be? I then tried the  W3C Validator, which found some other problems with my page, but nothing that could explain this behavior. And once again, it confirmed that despite rendering differently in the browser, the two sections of HTML were identical.\n Clearly something wasn’t adding up. I used curl to download the web page from my web server, viewed the local copy, and saw the same behavior as before. But when I opened the stored .html document with a hex editor, I finally had my answer. The two sections of HTML were  not identical: one section used a different type of space character from the other.\n  I discovered that the original HTML section contained non-breaking spaces. But instead of encoding them with the  &amp;nbsp; entity, they were encoded directly as Unicode character C2A0. I’m not sure when or how this happened, but I blame WordPress. When viewing this section in the WordPress HTML editor, the C2A0 spaces appeared like normal spaces, and copy-pasting the section inside the editor silently converted non-breaking spaces to normal spaces with hex value 20. So the copied version rendered differently, even though the source HTML appeared to be the same.\n This is like the 21st century version of confusing a zero with a capital letter O, yet worse. I wasn’t even aware that non-breaking spaces have a Unicode character value – I thought &amp;nbsp; was the only way to encode them. I changed the HTML back to use &amp;nbsp; and now it all works fine.\n I’m surprised at how many different tools failed to reveal this subtle but important difference between types of spaces in the HTML source. The WordPress HTML editor failed to show or correctly handle the difference. The Firefox web developer tools and page source tools failed. The W3C Validator’s source view failed. Curl plus a hex editor was the only way to finally establish the ground truth about the precise contents of the HTML source.\n  Read 6 comments and join the conversation", "posttime": "2021-06-17 15:41:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "空间,space,html", "title": "当空间不是空间时 ", "title_en": "When a Space Is Not a Space", "transed": 1, "url": "https://www.bigmessowires.com/2021/06/01/when-a-space-is-not-a-space/", "via": "", "real_tags": ["空间", "space", "html"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters", "note_en": "[WI48]N. Wiener (1948).Time, communication, and the nervous system. Teleological mechanisms. Annals of the N.Y. Acad. Sci. 50 (4): 197-219. [Quote: &#34;The history of the modern computing machine goes back to Leibniz and Pascal. Indeed, the general idea of a computing machine is nothing but a mechanization of Leibniz&#39;s calculus ratiocinator.&#34;] [SMO13]L. Smolin (2013). My hero: Gottfried Wilhelm von Leibniz. The Guardian, 2013.  Link. [Quote: &#34;And this is just the one part of Leibniz&#39;s enormous legacy: the philosopher Stanley Rosen called him &#34;the smartest person who ever lived&#34;.&#34;] [T20] J. Schmidhuber (2020).  Critique of 2018 Turing Award.  [HIN] J. Schmidhuber (2020).  Critique of 2019 Honda Prize.  [GOD21] J. Schmidhuber (2021). 90th anniversary celebrations:  1931: Kurt Gödel, founder of theoretical computer science,shows limits of math, logic, computing, and artificial intelligence  [GOD21a]J. Schmidhuber (2021). Als Kurt Gödel die Grenzen des Berechenbaren entdeckte. (When Kurt Gödel discovered the limits of computability.)  Frankfurter Allgemeine Zeitung, 16/6/2021. [ALL2]J. Schmidhuber (2000).Algorithmic theories of everything.ArXiv: quant-ph/ 0011122. More. See also:Hierarchies of generalized Kolmogorov complexities and nonenumerable universal measures computable in the limit. International Journal of Foundations of Computer Science 13(4):587-612, 2002. PDF. More.See also: The Speed Prior: A New Simplicity Measure Yielding Near-Optimal Computable Predictions.Proc. COLT 2002. PDF.  More. [GM6]J. Schmidhuber (2006).Gödel machines: Fully Self-Referential Optimal Universal Self-Improvers. In B. Goertzel and C. Pennachin, eds.:   ArtificialGeneral Intelligence, p. 199-226, 2006.  PDF.Preprint  arXiv:cs/0309048 (2003).See also:Ultimate Cognition   à la Gödel. Cognitive Computation 1(2):177-193, 2009.  PDF. More. [DL1] J. Schmidhuber, 2015. Deep Learning in neural networks: An overview. Neural Networks, 61, 85-117.  More. [DL2] J. Schmidhuber, 2015.  Deep Learning.Scholarpedia, 10(11):32832. [MIR] J. Schmidhuber (2019).  Deep Learning: Our Miraculous Year 1990-1991. Preprint  arXiv:2005.05744, 2020.  [DEC] J. Schmidhuber (2020).  The 2010s: Our Decade of Deep Learning / Outlook on the 2020s.  [VAR13]M. Y. Vardi (2013). Who begat computing? Communications of the ACM, Vol. 56(1):5, Jan 2013. Link. [ZU36]K. Zuse (1936).Verfahren zur selbsttätigen Durchführung von Rechnungen mit Hilfe von Rechenmaschinen. Patent application Z 23 139 / GMD Nr. 005/021, 1936.  [First patent application describing a general, practical, program-controlled computer.] [ZU37]K. Zuse (1937). Einführung in die allgemeine Dyadik.  [Mentions the storage of program instructions in the computer&#39;s memory.] [ZU38]K. Zuse (1938). Diary entry of 4 June 1938.  [Description of computer architectures that put both program instructions and data into storage—compare the later &#34;von Neumann&#34; architecture.  ] [ZU48]K. Zuse (1948). Über den Plankalkül als Mittel zur Formulierung schematisch kombinativer Aufgaben.\rArchiv der Mathematik 1(6), 441-449 (1948). PDF. [Apparently the first practical design of an automatic theorem prover (based on Zuse&#39;s high-level programming language Plankalkül).] [NS56]A. Newell and H. Simon. The logic theory machine—A complex information processing system. IRE Transactions on Information Theory 2.3 (1956):61-79. [RO98]R. Rojas (1998). How to make Zuse&#39;s Z3 a universal computer. IEEE Annals of Computing, vol. 19:3, 1998. [BAU]F. L. Bauer, H. Woessner (1972). The &#34;Plankalkül&#34; of Konrad Zuse: A Forerunner of Today&#39;s Programming Languages.  [KNU]D. E. Knuth, L. T. Pardo (1976). The Early Development of Programming Languages. Stanford University, Computer Science Department.  PDF. [Z36] S. Faber (2000). Konrad Zuses Bemühungen um die Patentanmeldung der Z3.  [SHA37]C. E. Shannon (1938). A Symbolic Analysis of Relay and Switching Circuits. Trans. AIEE. 57 (12): 713-723. Based on his thesis, MIT, 1937.  [AI51]Les Machines a Calculer et la Pensee Humaine: Paris, 8.-13. Januar 1951, Colloques internationaux du Centre National de la Recherche Scientifique; no. 37, Paris 1953. [ H. Bruderer rightly calls that the first conference on AI.] [BRU1]H. Bruderer. Computing history beyond the UK and US: selected landmarks from continental Europe. Communications of the ACM 60.2 (2017): 76-84. [BRU2]H. Bruderer. Meilensteine der Rechentechnik. 2 volumes, 3rd edition. Walter de Gruyter GmbH &amp; Co KG, 2020. [BRU3]H. Bruderer. Milestones in Analog and Digital Computing. 2 volumes, 3rd edition. Springer Nature Switzerland AG, 2020. [BRU4]H. Bruderer. The Birthplace of Artificial Intelligence? Communications of the ACM, BLOG@CACM, Nov 2017.  Link. [BRO21]D. C. Brock (2021).Cybernetics, Computer Design, and a Meeting of the Minds.An influential 1951 conference in Paris considered the computer as a model of—and for—the human mind.IEEE Spectrum, 2021. Link. [BAN]Banu Musa brothers (9th century). The book of ingenious devices (Kitab al-hiyal). Translated by D. R. Hill (1979), Springer, p. 44, ISBN 90-277-0833-9. [Perhaps the Banu Musa music automaton was the world&#39;s first machine with a stored program.] [KOE1][21] T. Koetsier (2001). On the prehistory of programmable machines: musical automata, looms, calculators. Mechanism and Machine Theory, Elsevier, 36 (5): 589-603, 2001. [RAU1]M. Rausch. Heron von Alexandria. Die Automatentheater und die Erfindung der ersten antiken Programmierung. Diplomica Verlag GmbH, Hamburg 2012. [Perhaps the world&#39;s first programmable machine was an automatic theatre made in the 1st century by Heron of Alexandria, who apparently also had the first known working steam engine.] [SHA7a]N. Sharkey (2007). A programmable robot from AD 60. New Scientist, Sept 2017. [SHA7b]N. Sharkey (2007). A 13th Century Programmable Robot. Univ. of Sheffield, 2007. [On a programmable drum machine of 1206 by Al-Jazari.]  [LIL1]US Patent 1745175 by Austrian physicist Julius Edgar Lilienfeld for work done in Leipzig: &#34;Method and apparatus for controlling electric current.&#34; First filed in Canada on 22.10.1925.  [The patent describes a field-effect transistor. Today, almost all transistors are field-effect transistors.] [LIL2] US Patent 1900018 by Austrian physicist Julius Edgar Lilienfeld: &#34;Device for controlling electric current.&#34; Filed on 28.03.1928.  [The patent describes a thin film field-effect transistor.]  .", "posttime": "2021-06-17 15:41:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pioneerkurtg,computing,warning", "title": "计算机科学PioneerKurtGödel显示了数学，逻辑，计算，AI的限制 ", "title_en": "Computer science pioneer Kurt Gödel shows limits of math, logic, computing, AI", "transed": 1, "url": "https://people.idsia.ch/~juergen/goedel-1931-founder-theoretical-computer-science-AI.html", "via": "", "real_tags": ["computing", "warning"]}, {"category": "", "categoryclass": "", "imagename": "5bc7dd1bbde66c928d2f1729ef371ba5.jpg", "infoid": 1066402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "https://en.m.wikipedia.org> wiki> creativ ...对于任何版权问题，请告诉我 -  immanuelahmed@ox.ac.ukhttps：//www.cs.mcgill.ca/~rwest/wikis。 .. ", "note_en": "https://en.m.wikipedia.org › wiki › Creativ...For Any Copyright Issue Please contactEmail me at - immanuelahmed@ox.ac.ukhttps://www.cs.mcgill.ca/~rwest/wikis...", "posttime": "2021-06-17 15:40:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ivermectin,wiki", "title": "Covid，Ivermectin和世纪罪：皮埃尔kory和bret weinstein ", "title_en": "Covid, Ivermectin, and the Crime of the Century: Pierre Kory and Bret Weinstein", "transed": 1, "url": "https://www.youtube.com/watch?v=zL9TUjJVoZo", "via": "", "real_tags": ["wiki"]}, {"category": "", "categoryclass": "", "imagename": "238c4e35c41fa81e95799e06a372c3d1.jpg", "infoid": 1066401, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它现在已经关闭了一系列B系列，由未公开的投资者为6.00万美元。这将其总资金带到4200万美元。这一轮是支持国际扩张。\n AKUR8由精算师和定价团队使用，以制定关于保险索赔的更快决定。\n  客户包括Axa，Generali和慕尼黑Re，Specialty保险公司Canopius和Tokio Marine Kiln，Insurechs Wakam和Wefox，以及互动的球员Matmut。\n Akur8的联合创始人兼首席执行官Samuel Falmagne评论：“我们很高兴地宣布我们的B系列资金循环结束，并感谢我们从投资者看到的支持。这个最新的里程碑将使我们能够进一步加速保险定价的转型，燃料我们在美国和APAC的国际扩张，并配备了P＆amp; C和卫生运营商，具有我们所拥有的最先进的综合定价解决方案一直在建立和炼油。“\n Blackfin Capital Partners的合作伙伴JulienCreuzé说：“Blackfin团队很激动，看到Akur8继续在全球保险公司中展开它的翅膀并部署其下一代定价平台。我们与Akur8管理团队建立了良好的关系，很高兴欢迎新投资者并继续与他们一起旅行。“ ", "note_en": "It’s now closed a Series B funding round of $30m led by an undisclosed investor. This brings its total funding to $42m. The round is to support international expansion.\n Akur8 is used by actuaries and pricing teams to make faster decisions about insurance claims.\n  Customers include AXA, Generali, and Munich Re, specialty insurers Canopius and Tokio Marine Kiln, insurtechs Wakam and wefox, as well as mutualistic player Matmut.\n Samuel Falmagne, co-founder and CEO of Akur8 commented: “We are happy to announce the closing of our Series B funding round and are grateful for the support we have seen from our investors. This latest milestone will enable us to accelerate the transformation of insurance pricing even further, fuel our international expansion in the US and APAC, and equip P&amp;C and health carriers with a state-of-the-art, integrated pricing solution that we have been building and refining tirelessly.”\n Julien Creuzé, Partner at BlackFin Capital Partners Said: “The BlackFin team is thrilled to see Akur8 continue to spread its wings and deploy its next-generation pricing platform across insurance carriers worldwide. We have built a great relationship with the Akur8 management team and it’s a pleasure to welcome new investors and continue this journey with them.”", "posttime": "2021-06-17 15:04:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ai,定价", "title": "Insurech AI Startup Akur8关闭$ 30m系列B ", "title_en": "\n\t\t\t\tInsurtech AI startup Akur8 closes $30M Series B\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/insurtech-ai-startup-akur8-closes-30m-series-b/", "via": "", "real_tags": ["ai", "定价"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066399, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "查找最新和趋势机学习论文 ", "note_en": "Find latest and trending machine learning papers", "posttime": "2021-06-17 14:57:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变压器,survey,学习", "title": "变压器调查 ", "title_en": "A Survey of Transformers", "transed": 1, "url": "https://papers.labml.ai/paper/2106.04554", "via": "", "real_tags": ["变压器", "survey", "学习"]}, {"category": "", "categoryclass": "", "imagename": "4543df2461f0a3397c04b1308455fe07.jpg", "infoid": 1066396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Kune是最近的食品科技创业公司之一，今天，六个月大的肯尼亚公司正在宣布已关闭100万美元的种籽圆，于8月推出其按需食品服务。\n 泛非风险投资公司发射非洲企业导致了预先种子。参加的其他投资者包括Century Oak Capital GmbH和Squance，具有生态系统管理公司Pariti的贡献。\n  Kune于2020年12月由首席执行官Robin Recht成立，可以可争议的价格提供新鲜的，即食的膳食。当2020年11月首次从法国恢复到肯尼亚时，不容易获得价格实惠的即食饭菜。\n “在进入肯尼亚三天后，我问我可以以便宜的价格得到伟大的食物，每个人都告诉我这是不可能的，”他告诉TechCrunch。 “这是不可能的，因为你要去街道，你吃街头食物，这真的很便宜，但没有那么好的品质，或者你在优步吃，加洛沃或朱米，你得到质量，但你必须支付至少10美元。“\n reach注意到市场上的差距并试图填补它。下个月，他决定启动Kune。目标？提供价格实惠，方便美味的餐点。开发飞行员花了一周的时间，并且在特定的办公空间中有50名客户的准备候补名单，他的计划是议案。 kune售出500多顿饭（平均4美元），并将其客户群增长到50到150。\n Reetch说，客户对产品和Kune筹集了50,000美元的产品，kune特别兴奋。然而，在那之后，对于他们无法跟上的小团队，订单变得太大了;在一点，它每天收到50个订单。因此，而不是与可能分解的动力进行推进，而是队伍占据了一个人口。\n “我们已经开始搞砸了订单，因为你知道，当你坐在一个小厨房的环境中时，它很复杂。所以我说好，没有意义这样做，需求如此之高，更好地做正确的事情。“ \n未来几个月花费了重组公司，使雇用和建造工厂每天生产5,000餐。然后，当公司准备筹集时，Reetch表示，他看到了与客户和投资者的热情相同。在两个月内，kune关闭了这一轮，是东非最大的一个，是少数人在大陆上筹集了七分类预先种子的非金融金。\n  在肯尼亚的快速增长和拥挤的餐厅和食品送餐市场中，Kune希望通过在kibanda定价（通常被称为典型的当地路边食品店）和从全球公司的按需食物送货价格。\n Kune应用混合动力车模型，结合云和黑暗的厨房概念。 Kune餐在其工厂烹饪和包装，直接送到网上，零售和公司客户。\n 混合模型谈到为什么发射非洲削减kune的支票。根据该公司的董事，巴尔德德沙姆达，“利用云厨房模型并拥有整个供应链为Kune Africa提供了大规模的增长和扩大机会。”他补充说：“我们期待着看到业务起飞和成长。”\n kune计划在新工厂完成后全面推出8月。根据其现场的详细信息，该公司承诺客户将每天平均30分钟进行交付。\n 为了实现这一目标，Kune确保它拥有整个供应链，从烹饪到包装，以便用自己的司机和摩托车交付。 “我们的战略是将所有生产和人力资源的能力内化，”他说。这就是Kune将把大部分资金带到前进的地方。除了工厂，费用约占总投资的10％，Kune将希望建立一个庞大的团队。 Reetch告诉我，判断运营 - 重kune如何，团队规模将达到100岁12月。\n  曾经推出过，公司将于2022年初建造自己的100辆电动摩托车队伍。此外，还有计划聘请100名女性司机。 \n目前，kune每天展示三餐：两种欧陆式菜肴和一个外国餐。 在未来几个月和季度，kune的产品将削减微波膳食，减肥餐和零食，以定位欧洲和美国客户。 对于后者来说，reach是对向西方国家出口非洲食品文化的热情。 作为一个旅行的人，首席执行官认为肯尼亚与其他国家不同，没有强烈的粮食文化。 他将食物媒体称为电视节目，其中各种餐饮和烹饪以及如何展示如何烹饪食物的烹饪和调节器。 Reetch希望Kune成为肯尼亚的此类课程。  “在肯尼亚，我们没有任何烹饪秀。 所以我们将把那个职位作为肯尼亚的烹饪专业，你如何创造这个？ 通过创造惊人的内容，我们计划通过创建关于如何烹饪或者通常的食品业务的视频和写作文章来做。“ ", "note_en": "Kune is one of the most recent food-tech startups, and today, the six-month-old Kenyan-based company is announcing that it has closed a $1 million pre-seed round to launch its on-demand food service in August.\n Pan-African venture capital firm  Launch Africa Ventures led the pre-seed round. Other investors that took part include Century Oak Capital GmbH and Consonance, with a contribution from ecosystem management firm  Pariti.\n  Founded by CEO Robin Reecht in December 2020, Kune delivers  freshly  made, ready-to-eat meals at  arguably  affordable prices.  When Reetch first came to Kenya from France in November 2020, it wasn’t easy to get affordable ready-to-eat meals .\n “After three days of coming into Kenya, I asked where I can get great food at a cheap price, and everybody tell me it’s impossible,” he told TechCrunch . “It’s impossible because either you go to the street and you eat street food, which is  really  cheap but with not-so-good quality, or you order on Uber Eats, Glovo or Jumia, where you get quality but you have to pay at least $10.”\n Reetch noticed a gap in the market and sought to fill it. The next month, he decided to start Kune. The goal? To provide affordable, convenient and tasty meals.  It took a week to develop a pilot, and with a ready waitlist of 50 customers in a particular office space, his plans were in motion . Kune sold more than 500 meals ($4 average) and tripled its customer base from 50 to 150.\n Customers were particularly excited about the product and Kune raised $50,000 from them to continue operations, Reetch said. After that, however , the orders became too large for the small team that they couldn’t keep up; at one point, it received 50 orders per day. Thus, instead of advancing with a momentum that could break down, the team took a hiatus.\n “We had started to mess up the order because, you know, it’s complicated to get food right when you’re  just  in a small kitchen setting . So I said okay, that there is no point doing that, and the demand is so high and better to do things right.”\n The next months  were spent  restructuring the company, making hires and building a factory to produce 5,000 meals per day . Then, when  the company was ready to raise, Reetch said he saw the same enthusiasm from customers and investors . In two months, Kune closed this round, one of the largest in East Africa, and is one of the few non-fintechs to have raised a seven-figure pre-seed round on the continent.\n  In a fast-growing and crowded restaurant and food delivery marketplace in Kenya, Kune wants to offer a new way for busy people in Nairobi to access meals by finding a balance between Kibanda pricing (usually referred to as the typical local roadside food shop) and on-demand food delivery prices from global companies.\n Kune applies a hybrid model, combining both cloud and dark kitchen concepts. Kune meals  are cooked  and packaged in its factory and delivered  directly  to online, retail and corporate customers.\n The hybrid model speaks to why Launch Africa cut a check for Kune. And according to the director of the firm, Baljinder Sharma  ,  “leveraging the cloud kitchen model and owning the entire supply chain provides a massive growth and scaling opportunity for Kune Africa.” He added: “We are looking forward to seeing the business take off and grow.”\n Kune plans to  fully  launch in August after its new factory  is completed .  Per details on its site, the company is promising customers that delivery will  be done  on an average of 30 minutes daily .\n To achieve this, Kune ensures that it owns the entire supply chain, from cooking to packaging to delivery with its own drivers and motorbikes. “Our strategy is to internalize all production and human resources capacities,” he stated. That’s where Kune will put most of the funds  to use going forward. In addition to the factory, which costs about 10% of the total investment, Kune will be looking to build a huge team.  Reetch tells me that judging by how operations-heavy Kune is, the team size will reach 100 come December .\n  Once launched, the company will build its own fleet of 100 electric motorcycles by early 2022.  In addition , there are plans to hire 100  female drivers.\n Currently, Kune showcases three different meals daily: two continental dishes and one foreign meal . In the coming months and quarters, Kune’s offerings will cut across microwavable meals, weight reduction meals and retail meals to target European and U.S. clients.  For the latter, Reetch is enthusiastic about exporting the African food culture to Western countries . As someone who travels a lot, the CEO thinks Kenya, unlike other countries, doesn’t have a strong food culture.  He references food media like TV shows where various meals and cuisines and tutorings on how to cook food are showcased . Reetch wants Kune to be the go-to for such programs in Kenya.\n “In Kenya, we don’t have any culinary show. So we are going to take that position as the culinary major of Kenya, and how do you create this?  By creating amazing content, which we plan to do by creating videos and writing articles on how to cook or  maybe  just  food business in general .”", "posttime": "2021-06-17 14:20:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "饮食,kune", "title": "Kenyan Foodtech Startup Kune培养了1万美元的籽籽饮食服务 ", "title_en": "\n\t\t\t\tKenyan foodtech startup Kune raises $1M pre-seed for its ready-to-eat meals service\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/16/kenyan-foodtech-startup-kune-raises-1m-pre-seed-for-its-ready-to-eat-meals-service/", "via": "", "real_tags": ["饮食", "kune"]}, {"category": "", "categoryclass": "", "imagename": "50feebb701562b4429c74c232d398d83.jpg", "infoid": 1066394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界银行拒绝了萨尔瓦多的要求，以帮助实施比特币作为法律招标。\n  本月早些时候，中美洲国家宣布计划成为第一家正式采用数字货币的国家。\n  世界银行＆＃39的决定可能意味着该国面临着抵达其截止日期的问题，以确保在未来三个月内全国范围内接受比特币。\n  ＆＃34;我们致力于以多种方式帮助萨尔瓦多，包括货币透明度和监管流程，＆＃34;世界银行发言人通过电子邮件告诉路透社新闻机构。\n  ＆＃34;虽然政府确实对比特币进行了帮助，但这不是世界银行可以支持的环境和透明度缺点，而＃34;他们补充道。\n 萨尔瓦多＆＃39;金融部长亚历杭德罗·泽拉亚亚拉亚拉周三表示，该国向世界银行向世界银行援助加密货币作为官方付款方式。\n Zelaya先生还表示，与国际货币基金组织（IMF）的讨论取得了成功，称国际货币基金组织是＆＃34;不是反对＆＃34;比特币的实施。 \n但上周的国际货币基金组织表示，它看到了它的宏观经济，金融和法律问题＆＃34;采用萨尔瓦多＆＃39;采用比特币。\n  上周，萨尔瓦多成为世界上第一个正式分类比特币作为法律货币的国家。\n   布基尔总统表示，政府曾签订了历史，而这一举措将使萨尔瓦多斯生活在国外汇款之家。\n 根据立法，比特币将成为法律招标，在国会批准的90天内与美元一起。\n 新法律意味着每件事务必接受比特币作为商品或服务的法律招标，除非它无法提供处理交易所需的技术。\n 萨尔瓦多＆＃39;经济依赖于汇款，或者从国外送回家乡的钱，该汇款占该国约20％的国内生产总值（GDP）\n 超过200万萨尔瓦多人住在国外，但继续与他们的出生地保持密切联系，每年寄回超过40亿美元（29亿英镑）。 ", "note_en": "The World Bank has rejected a request from El Salvador to help with the implementation of Bitcoin as legal tender.\n  Earlier this month, the Central American country announced plans to become the first nation to formally adopt the digital currency.\n  The World Bank&#39;s decision could mean the country faces problems in hitting its deadline to ensure that Bitcoin is accepted nationwide in the next three months.\n  &#34;We are committed to helping El Salvador in numerous ways including for currency transparency and regulatory processes,&#34; a World Bank spokesperson told the Reuters news agency via email.\n  &#34;While the government did approach us for assistance on Bitcoin, this is not something the World Bank can support given the environmental and transparency shortcomings,&#34; they added.\n It comes after El Salvador&#39;s Finance Minister Alejandro Zelaya said on Wednesday that the country had asked the World Bank for technical assistance with the implementation of the cryptocurrency as an official method of payment.\n Mr Zelaya also said that discussions with the International Monetary Fund (IMF) have been successful, saying the IMF was &#34;not against&#34; the implementation of Bitcoin.\n But the IMF last week said it saw &#34;macroeconomic, financial and legal issues&#34; with El Salvador&#39;s adoption of Bitcoin.\n  Last week, El Salvador became the first country in the world to officially classify Bitcoin as a legal currency.\n   President Bukele said the government had made history, and that the move would make it easier for Salvadoreans living abroad to send money home.\n Under the legislation Bitcoin will become legal tender, alongside the US dollar within 90 days of the approval by Congress.\n The new law means every business must accept Bitcoin as legal tender for goods or services, unless it is unable to provide the technology needed to process the transaction.\n El Salvador&#39;s economy relies heavily on remittances, or money sent home from abroad, which make up around 20% of the country&#39;s gross domestic product (GDP)\n More than two million Salvadoreans live outside the country, but continue to keep close ties with their place of birth, sending back more than $4bn (£2.9bn) each year.", "posttime": "2021-06-17 14:13:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,世界银行,bank,法律", "title": "世界银行拒绝萨尔瓦多要求比特币帮助 ", "title_en": "World Bank rejects El Salvador request for Bitcoin help", "transed": 1, "url": "https://www.bbc.com/news/business-57507386", "via": "", "real_tags": ["比特币", "世界银行", "bank", "法律"]}]