[{"category": "", "categoryclass": "", "imagename": "664408b8dd2c56bbec6cc297045ccc03.jpg", "infoid": 1035346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两年前，凯利·麦格雷戈里(Kelly McGregory)医生在明尼阿波利斯郊外开设了自己的儿科诊所，在那里，她可以花尽可能多的时间与病人相处，父母也可以得到所有问题的答案。\n但就在她的诊所开始蓬勃发展的时候，冠状病毒袭击了美国，并开始在全国范围内传播。\n麦格雷戈里博士说，“作为一家独立的诊所，与大型医疗系统没有真正的联系，这太糟糕了。”她一度只剩下三个医用口罩，担心自己再也不能安全地治疗病人了。\n家庭也在远离，担心感染病毒。她说：“我做了一些远程医疗，但数量不足以取代我在诊所里做的事情。”\n在丈夫在另一个州找到一份新工作后，49岁的麦格雷戈里博士做出了一个艰难的决定，在8月份关闭了她的诊所。“这是毁灭性的，”她说。“那是我的孩子。”\n许多其他医生也在叫停。非营利组织医师基金会7月份对3500名医生进行的一项调查显示，在流感大流行期间，已有数千家医疗机构关闭。约8%的医生报告称，近几个月来关闭了他们的诊所，该基金会估计，这可能相当于约1.6万家诊所。另有4%的人表示，他们计划在明年内关闭。\n其他医生和护士正在提前退休或离职。一些人担心自己的健康，因为年龄或健康状况使他们处于高危状态。其他人在疫情最严重的时候停止练习，没有精力重新开始。一些人只是需要从大流行给他们的队伍和患者带来的损失中休息一下。\n拉里·A·格林中心(Larry A.Green Center)与非营利组织初级保健合作组织(Primary Care Collaborative)的另一项分析发现了类似的模式。在9月份接受调查的初级保健临床医生中，近五分之一的人表示，他们的执业医生中有人因为新冠肺炎的原因计划提前退休或已经退休，15%的人表示有人已经或计划离开诊所。\n临床医生也为他们的生活描绘了一幅严峻的图景，因为大流行进入了一个新的强健阶段，美国的病例数量创下了纪录。大约一半的人已经表示，他们的精神疲惫程度达到了历史最高水平。许多人担心继续敞开大门：约7%的人表示，他们不确定在没有财政援助的情况下，他们能否在12月之后继续敞开大门。\n65岁的琼·本卡(Joan Benca)博士在威斯康星州麦迪逊担任麻醉师，她说，“老实说，如果不是大流行，我还会继续工作，因为那时退休不是我的计划。”\n但她的女儿和女婿在一家医院的重症监护病房担任行政职务，治疗病情最严重的Covid患者，他们有两个年幼的孩子。当病例在春季攀升时，他们的日托中心关闭了，本卡医生的女儿迫切需要一个她信任的人来照顾孩子。\n“这不是我想以这种方式结束我的职业生涯，”本卡博士说。“我认为，对我们大多数人来说，我们会说，你会为家庭而死，但不会为工作而死，”她说。她还说，她认识其他留在家里照顾孩子或年长亲戚的女同事。\n66岁的迈克尔·佩克(Michael Peck)医生是马里兰州罗克维尔的一名麻醉师。今年4月，他在医院的重症监护室工作，为危重病人插管，担心自己的健康，因此决定离职。“一天结束后，我只是说，‘我想我完了’--我想过我的生活，我不想生病，”佩克博士说，他已经在减少工作时间了。\n他现在每天花几个小时担任一家初创企业的首席医疗官。\n尽管如此，事实证明，大多数做法都是有弹性的。由国会授权的Paycheck Protection Program帮助包括医疗机构在内的企业应对疫情的经济影响，帮助许多医生维持生计。科罗拉多州斯普林斯的家庭医生、内科基金会研究委员会主席里普利·霍利斯特(Ripley Hollister)博士说，这笔钱“在某种程度上让我变得稳固”。他说，现在的销量“真的在回升”。\n但是，咨询公司Gist Healthcare的联合创始人丽莎·比拉莫维奇(Lisa Bielamowicz)博士预测，根据疫情的未来进程，“将会出现另一波财务压力冲击实践。”许多医生团体将寻找买家，无论是医院、保险公司还是计划将诊所整合为更大业务的私募股权公司。\n一名医生说，在疫情到达美国之前，她和她的伴侣已经在与附近的医院讨论购买儿科诊所的事宜。由于讨论是保密的，这名医生要求不具名。\n她说，尽管联邦援助有所帮助，但就诊人数仍比正常水平低15%，他们继续担心发工资和有足够的医生和工作人员看病。随着中西部地区病毒病例数量的激增，她的员工必须与越来越焦躁的父母打交道。\n“他们对我的员工大喊大叫，骂我，”她说。她补充说，为远程医疗公司工作可能是另一种选择。她说：“要想拥有自己的企业，从一开始就是一项艰难的工作。”\n冠状病毒危机放大了医生已经面临的问题，无论他们是拥有自己的诊所还是受雇。美国医学会(American Medical Association)主席苏珊·R·贝利(Susan R.Bailey)博士说，“甚至在疫情爆发之前，许多医生就已因职业倦怠而命悬一线。”\n特别是，规模较小的诊所仍然很难找到足够的个人防护装备，如手套和口罩。她说，“大医院和医疗保健系统都有相当完善的体育教育系统，”但规模较小的机构可能没有可靠的来源。她说：“我真的是在eBay上寻找口罩。”对于一些做法来说，这些用品的成本也已经成为一个重大的财务问题。\n医生们也因为永无止境的安全需要而感到压力。贝利博士说，“现在有一种低调的心态。”她担心，一些医生会因为在疫情期间照顾病人的长期压力而患上创伤后应激障碍(PTSD)。\n即使是那些不负责管理自己的诊所的人也在离开。40岁的考特尼·巴里(Courtney Barry)是加利福尼亚州索莱达市一家乡村诊所的家庭护士，她眼睁睁地看着她所在地区的冠状病毒病例最终消退，却眼睁睁地看着野火爆发。她的许多病人都是农场工人，在外面工作，他们因为吸烟而生病。\n在14年的护士生涯中，巴里从未经历过这样的事情，“压力如此之大，而且还在继续，”她说，并补充说，“另一个艰难的部分是看不到尽头。”\n她试图减少工作天数，但最终决定从12月初开始完全停止工作几个月。巴里还没有想好她的下一步是什么。\n她说：“我的目的是留在医学界，尽管我不会完全反对在一个完全不同的领域做一些事情，这是我过去不会说的。”\n患者确实感受到了影响。霍利斯特博士是一名家庭医生，他认为封闭的诊所很可能会导致“患者获得医疗服务的机会受到严重损害”。霍利斯特博士说，疫情已经发展成了“一场真正的巨大破坏”。在他所在的社区，专科医生和初级保健医生都在离开，他正在照顾更多不再有医生的病人。\n麦格雷戈里博士曾在麦迪逊的威斯康星大学医学院和公共卫生学院工作，他担心这个问题。在她的诊所里，有一些家庭她无法说服他们立即寻找另一位儿科医生。她说，他们“正在等待，这是我不鼓励的，因为我认为每个孩子都应该有一个医疗院。”", "note_en": "Two years ago, Dr. Kelly McGregory opened her own pediatric practice just outside Minneapolis, where she could spend as much time as she wanted with patients and parents could get all of their questions answered.\n But just as her practice was beginning to thrive, the coronavirus hit the United States and began spreading across the country.\n “As an independent practice with no real connection to a big health system, it was awful,” Dr. McGregory said. At one point, she had only three surgical masks left and worried that she could no longer safely treat patients.\n Families were also staying away, concerned about catching the virus. “I did some telemedicine, but it wasn’t enough volume to really replace what I was doing in the clinic,” she said.\n After her husband found a new job in a different state, Dr. McGregory, 49, made the difficult decision to close her practice in August. “It was devastating,” she said. “That was my baby.”\n Many other doctors are also calling it quits. Thousands of medical practices have closed during the pandemic, according to  a July survey of 3,500 doctors by the Physicians Foundation, a nonprofit group. About 8 percent of the doctors reported closing their offices in recent months, which the foundation estimated could equal some 16,000 practices. Another 4 percent said they planned to shutter within the next year.\n Other doctors and nurses are retiring early or leaving their jobs. Some worry about their own health because of age or a medical condition that puts them at high risk. Others stopped practicing during the worst of the outbreaks and don’t have the energy to start again. Some simply need a break from the toll that the pandemic has taken among their ranks and their patients.\n Another analysis, from the Larry A. Green Center with the Primary Care Collaborative, a nonprofit group, found similar patterns. Nearly a fifth of primary care clinicians  surveyed in September say someone in their practice plans to retire early or has already retired because of Covid-19, and 15 percent say someone has left or plans to leave the practice.\n The clinicians also painted a grim picture of their lives, as the pandemic enters a newly robust phase with record case counts in the United States. About half already said their mental exhaustion was at an all-time high. Many worried about keeping their doors open: about 7 percent said they were not sure they could remain open past December without financial help.\n “Honestly, if it hadn’t been for the pandemic, I would have still been working because it was not my plan to retire at that point,” said Dr. Joan Benca, 65, who worked as an anesthesiologist in Madison, Wis.\n But her daughter and son-in-law hold administrative positions in a hospital intensive care unit, treating the sickest Covid patients, and they have two small children. When cases climbed in the spring, their day care center closed, and Dr. Benca’s daughter desperately needed someone she trusted to look after the children.\n “It wasn’t the way I wanted to end my career,” Dr. Benca said. “I think for most of us, we would say, you would fall on your sword for your family but not for your job,” she said, adding that she knows other female colleagues who have stayed home to care for children or older relatives.\n  Dr. Michael Peck, 66, an anesthesiologist in Rockville, Md., decided to leave after working in April in the hospital’s intensive care unit, intubating critically ill patients, and worrying about his own health. “When the day was over, I just said, ‘I think I’m done’ — I want to live my life, and I don’t want to get ill,” said Dr. Peck, who had already been cutting back his hours.\n He is now spending a few hours a day as the chief medical officer for a start-up.\n Still, most practices have proved resilient. The Paycheck Protection Program — authorized by Congress to help businesses, including medical practices, with the economic fallout of the pandemic — helped many doctors remain afloat. That money “kind of made me solid,” said Dr. Ripley Hollister, a family physician in Colorado Springs who serves as chairman of the research committee for the Physicians Foundation. The volume now “is really coming back,” he said.\n But, depending on the future course of the pandemic, Dr. Lisa Bielamowicz, a co-founder of Gist Healthcare, a consulting firm, predicts “another wave of financial stress hitting practices.” Many doctors’ groups will seek a buyer, whether a hospital, an insurance company or a private equity firm that plans to roll up practices into a larger business.\n One doctor, who asked not to be identified because the discussions are confidential, said she and her partner had already been talking with the nearby hospital nearby about buying their pediatric practice before the pandemic arrived in the United States.\n Although federal aid has helped, patient visits are still 15 percent below normal, she said, and they are continually worried about making payroll and having enough doctors and staff to see patients. As the number of virus cases balloons in the Midwest, her employees must deal with increasingly agitated parents.\n “They’re yelling and cussing at my staff,” she said. Working for a telemedicine firm might be an alternative, she added. “It’s a hard job to begin with, to own your own business,” she said.\n The coronavirus crisis has amplified problems that doctors were already facing, whether they own their practice or are employed. “A lot of physicians were hanging on by a thread from burnout before the pandemic even started,” said Dr. Susan R. Bailey, the president of the American Medical Association.\n In particular, smaller practices continue to have difficulty finding sufficient personal protective equipment, like gloves and masks. “The big hospitals and health care systems have pretty well-established systems of P.P.E.,” she said, but smaller outfits might not have a reliable source. “I was literally on eBay looking for masks,” she said. The cost of these supplies has also become a significant financial issue for some practices.\n Doctors are also stressed by the never-ending need to keep safe. “There is a hunker-down mentality now,” Dr. Bailey said. She is concerned that some doctors will develop PTSD from the chronic stress of caring for patients during the pandemic.\n Even those who are not responsible for running their own practices are leaving. Courtney Barry, 40, a family nurse practitioner at a rural health clinic in Soledad, Calif., watched the cases of coronavirus finally ebb in her area, only to see wildfires break out. Many of her patients are farmworkers and work outside, and they became ill from the smoke.\n In 14 years as a nurse, Ms. Barry has never experienced anything “like this that is just such a high level of stress and just keeps going,” she said, adding, “The other hard part is there’s no end in sight.”\n She tried working fewer days but decided eventually that she would stop altogether for several months beginning in early December. Ms. Barry hasn’t figured out what’s next for her.\n “My intention is to stay in medicine, although I would not be totally opposed to doing something in a totally different area, which is something that I would not have said in the past,” she said.\n And patients have indeed felt the effects. The pandemic has developed into “a really huge disruption,” said Dr. Hollister, the family physician, who thinks closed practices are likely to result in “a significant impairment to patients’ access to medical care.” In his community, where both specialists and primary care doctors are leaving, he is tending to more patients who no longer have a doctor.\n It is an issue that Dr. McGregory, who took a job at the University of Wisconsin School of Medicine and Public Health in Madison, worries about. There were some families in her practice whom she could not convince to find another pediatrician immediately. She said they “are waiting, which I discouraged, because I think every child should have a medical home.”", "posttime": "2020-11-16 07:44:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流行,calling,医生", "title": "在大流行的压力下，医生们将其称为戒烟。", "title_en": "Doctors Are Calling It Quits Under Stress of the Pandemic", "transed": 1, "url": "https://www.nytimes.com/2020/11/15/health/Covid-doctors-nurses-quitting.html", "via": "", "real_tags": ["流行", "calling", "医生"]}, {"category": "", "categoryclass": "", "imagename": "a9d27eb8c5e04bb9367a6e8f748f517b.jpg", "infoid": 1035345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "&#34；嗨，远程工作者！我们会付钱让你在塔尔萨工作。塔尔萨遥控器发来的欢迎信中写道，你一定会喜欢这里的。\n该项目由乔治·凯泽家庭基金会(George Kaiser Family Foundation)发起，向搬到俄克拉荷马州塔尔萨远程工作的人支付1万美元，现在有越来越多的申请者来自旧金山湾区。\n仅在过去的两周内，我们就收到了1000多名申请者。超过一半的人来自加州，很多人来自旧金山湾区。“该项目的社区经理格兰特·布姆加纳(Grant Bumgarner)在6日接受”新闻“(News)采访时说。“对我们来说，这是一段疯狂的时光。”\n即使在大流行之前，俄克拉荷马州的人口就已经放缓，这主要是由于能源部门的低迷。当该项目于2018年启动时，堪萨斯城联邦储备银行俄克拉荷马城分行的查德·威尔克森告诉彭博社：“过去几年是自上世纪80年代末90年代初以来人口增长最慢的几年。”\n塔尔萨遥控器的设计是为了让这个小城市在地图上声名鹊起，并给它带来活力和多样性。新冠肺炎疫情爆发后，人们开始转向远程工作，这使得该网站所称的数字游牧民对该项目的兴趣空前高涨。\n塔尔萨遥控器(Tulsa Remote)将在2020年卷土重来，规模更大。该计划称，我们正在寻找250名远程工作人员。\n该基金会表示，它希望让塔尔萨变得更加多样化，但并不是每个人都可以申请。申请者必须是远程工作者或个体户。\n除了1万美元的现金，这个机会还在塔尔萨市中心的一个联合办公中心提供了一个免费的办公桌空间，提供一个完成工作的地方，并与当地其他企业家、远程工作者和数字游牧民合作。\n现金是在进城的第一年里发放的。先给一些钱来帮助支付搬迁费用，然后按月发放津贴，让事情继续进行下去。\n如果被选中，申请者必须严格停留在塔尔萨市的范围内。那些被选中参加该项目的人必须居住在塔尔萨市范围内。城市范围不包括周边地区，如比克斯比、破箭、沙泉、萨普尔帕或詹克斯，规则规定。", "note_en": "&#34;Hi, remote workers! We&#39;ll pay you to work from Tulsa. You&#39;re going to love it here,&#34; reads the welcome message from  Tulsa Remote.\n  The program, started by the George Kaiser Family Foundation, is paying people $10,000 to move to Tulsa, Okla., to work remotely, and a surge of applicants are now coming from the Bay Area.\n  &#34;We&#39;ve had over a thousand applicants just in the last two weeks alone. Over half of them are from California, many from the Bay Area,” Grant Bumgarner, the program&#39;s community manager, told  News on 6. “It&#39;s been a wild time for us.”\n  Even before the pandemic, there was a slowing in population in Oklahoma, largely due to the downturn in the energy sector. “The last few years have been the slowest population growth since the late ‘80s, early ‘90s,” Chad Wilkerson, of the Kansas City Fed’s Oklahoma City branch offic,e told Bloomberg when the program was launched in 2018.\n    Tulsa Remote is designed to put the small city on the map and give it a jolt of energy and diversity. The major shift to remote work after the COVID-19 pandemic has led to an unprecedented spike in interest in the program from &#34;digital nomads,&#34; as the site calls them.\n   &#34;Tulsa Remote is back and bigger for 2020. We&#39;re looking for 250 more remote workers,&#34; the program states.\n  The foundation says that it wants to make Tulsa more diverse, but not everyone can apply. Applicants must be a remote worker or self-employed.\n  Beyond the $10,000 in cash, the opportunity offers a free desk space at a co-working hub in downtown Tulsa that &#34;provides a place to get work done and collaborate with other local entrepreneurs, remote workers and digital nomads.&#34;\n   The cash is handed out over the course of the first year in the city. Some money is given upfront to help with relocation expenses followed by a monthly stipend to keep things moving.\n  If selected, applicants are required to strictly stay in the Tulsa city limits. &#34;Those selected for the program must live within Tulsa city limits. The city limits do not include surrounding areas such as Bixby, Broken Arrow, Sand Springs, Sapulpa or Jenks,&#34; the rules state.", "posttime": "2020-11-16 07:44:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "湾区,旧金山,加州,area,远程", "title": "旧金山湾区申请者为离开加州支付1万美元的洪水计划", "title_en": "Bay Area applicants flood program that pays them $10k to leave California", "transed": 1, "url": "https://www.sfgate.com/living-in-sf/article/San-Franciscans-are-jumping-at-an-offer-of-10k-15591762.php", "via": "", "real_tags": ["湾区", "旧金山", "加州", "area", "远程"]}, {"category": "", "categoryclass": "", "imagename": "589924cb0e7ea2b7ae5abfa688caf644.jpg", "infoid": 1035344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用Webflow制作，提交你的曲目或艺术作品，让成百上千的其他创意产生共鸣。我们会审阅你的意见书，并在电台和时事通讯中介绍你。\n花8美元购买包含数百首精选歌曲的完整播放列表来支持电台。可以在Spotify、Deezer和YouTube上购买。", "note_en": "Made with Webflow  Submit your track or artwork to make hundreds of other creatives vibe. We’ll review your submission and feature you in the radio and newsletter.\n Support the radio by buying the full playlist with hundreds of curated songs for $8. Available on Spotify, Deezer and Youtube.", "posttime": "2020-11-16 07:44:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创意,creative,电台", "title": "超级创意电台-为创意工作而精心策划的不间断音乐", "title_en": "Super Creative Radio – nonstop curated music for creative work", "transed": 1, "url": "https://www.supercreative.design/radio", "via": "", "real_tags": ["创意", "creative", "电台"]}, {"category": "", "categoryclass": "", "imagename": "b0aca4e9f7e4570b5d910dee7633a0a4.jpg", "infoid": 1035342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Thoughtexchange是一家总部位于加拿大不列颠哥伦比亚省温哥华的高级对话扩展平台，获得了HarbourVest Partners的投资。\n在联合创始人兼首席执行官戴夫·麦克劳德(Dave MacLeod)的带领下，Thoughtexchange Thoughtexchange提供了一个语音平台，让领导者能够将关键任务对话扩大到数百人甚至数千人。参与者被邀请分享坦诚的想法，然后在不知道是谁分享了别人的想法的情况下对其进行评分，消除了种族、性别、排名等大量偏见。专利数据分析和人工智能提供了深刻的见解和可操作的情报，以帮助领导者做出明智的决策。\n该公司最近已超过100家企业客户，其中包括许多财富500强品牌，如好事达保险(AllState Insurance)、麦当劳(McDonalds)和美国航空(American Airlines)。", "note_en": "Thoughtexchange, a Vancouver, British Columbia, Canada-based advanced platform for scaling conversations, received an investment from HarbourVest Partners.\n   Led by Dave MacLeod, co-founder &amp; CEO, Thoughtexchange Thoughtexchange provides a voice platform that enables leaders to scale mission critical conversations to include hundreds and even thousands of people. Participants are invited to share candid thoughts and then rate others’ thoughts without knowing who shared them, eliminating an enormous list of biases such as ethnicity, gender, rank etc. Patented data analysis and AI provides deep insights and surfaces actionable intelligence to help leaders make informed decisions.\n The company has recently passed 100 corporate customers which include many Fortune 500 brands like Allstate Insurance, McDonalds and American Airlines.", "posttime": "2020-11-16 07:26:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "偏见,hosts,平台", "title": "ThoughtExchange主持大型小组对话，同时保护参与者的身份，以减少性别和种族偏见，该公司在B系列融资3400万美元", "title_en": "Thoughtexchange, which hosts large group conversations while shielding participants' identities to reduce gender and ethnicity biases, raises $34M Series B", "transed": 1, "url": "https://www.finsmes.com/2020/11/thoughtexchange-closes-final-tranche-of-34m-series-b-funding.html", "via": "", "real_tags": ["偏见", "hosts", "平台"]}, {"category": "", "categoryclass": "", "imagename": "3b9e4376b8ac7010ce269de6c68d019e.png", "infoid": 1035340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "诸如此类的陈词滥调是含糊其辞的，是建立在轶事和传闻之上的。它们会引起没完没了的、不必要的争论，把事实搞得一团糟。\n评论一个人喜欢的操作系统很容易，但给出客观、具体的例子却很难。\n在警告Windows和Linux都在移动目标的同时，本文档描述了更倾向于使用Linux作为桌面操作系统的一些具体技术原因。\n这些理由不是详尽的--也不是故意的--但旨在具有代表性。\n本文档不会讨论封闭与开放源码的开发，而是将重点放在功能性上。其他地方有很多关于开放源码的优点和缺点的讨论。\n(此外，既然我们现在知道连微软都喜欢开源了，还有什么好讨论的呢？)。\n这次讨论只会提到微软和其他公司，只要他们的行为与Windows和Linux的技术能力直接相关。\n(顺便说一句，微软在开源世界里得到了很多废话，但对于一家利润依赖于专有软件和设备销售的公司来说，它的行为是典型的。这是经济上的，而不是恶意的。)\n讨论的目的是尽可能准确，但代价是技术细节可能导致干燥。\n我最熟悉的是基于Debian的Linux发行版系列，所以我的评论必然会更多地涉及这些发行版，但我已经尝试在可能的情况下包括其他发行版。\n在本文档中，术语Linux是整个发行版的缩写，包括引导加载程序、内核、外壳、窗口管理器、包管理器等。同样，术语Windows指的是Microsoft Windows NT现代版本的所有默认组件，包括Windows XP、Windows Vista、Windows 7和Windows 8。\n支持Linux的许多相同论点也适用于BSD系列操作系统(以及总体上与POSIX兼容的操作系统)，但不幸的是，我对它们中的任何一个都不够熟悉，无法具体评论。\n大多数人在桌面上使用Windows，因为它是默认的。很少有人意识到切换到另一个操作系统的好处，愿意为此付出努力的人就更少了。\n有兴趣尝试Linux的Windows用户可能很难找到一个连贯的理由这样做，因为对操作系统的比较往往是模糊的、不知情的或基于观点的。\n即使是那些了解并选择使用Linux的人也无法很好地向他们的同事解释它的好处，尤其是在不放下Windows用户或Windows应用程序的情况下。\n此外，桌面上还有许多Linux的开源替代品，包括名为ReactOS的Windows的二进制兼容克隆。如果只是开源的问题，为什么要费心去学习Linux呢？\n即使你不使用Linux或Windows，知道Linux的优势在哪里也是很有用的，因为这些问题与所有操作系统都相关。\n如果您是Linux的新用户，本文档旨在告诉您一些您可能不知道的Linux的好处，如果您感兴趣，还可以深入挖掘。\n如果你是一名经验丰富的Linux用户，本文档是对这样一种理论的检验，即获得反馈的最快方式是在人们关心的事情上公开犯错。欢迎更正和补充。\n本文档并不是说Windows在所有方面都是劣势的，甚至不是说它整体上是劣势的。\n相反，这是为了让人们了解为什么有些人选择使用Linux作为桌面操作系统，尽管它有缺点，也可能是为了挑战人们对Linux和Windows的一些误解。\n当然，我们欢迎对其进行修改和添加。Windows开发人员最了解它的缺陷和优点。\n最后，更好和更差的定义必然是主观的，尽管书名声称是客观的。你可能会由衷地不同意下面的大部分内容，但即使如此，它也可能对你有用。\n以下是Windows内核或API导致的特定限制的示例列表。\n例如，在Windows 8之前，桌面版本的Windows不能从USB启动。(在运行Windows 8的实时USB时，仍然不能挂载内部硬盘。)。\nBartPE LiveCD构建程序是第三方软件，可以在任何版本的Windows上运行，但它只能为Windows XP或Windows Server 2003制作LiveCD。\n还有WinBuilder项目，它最接近于现代Windows版本的全功能LiveCD，但安装软件和驱动程序有时仍是一个挑战。\n如果虚拟机出现故障，也不用太担心。仅仅因为虚拟机无法正确引导并不意味着您的引导介质不能工作，我看到了一些奇怪的结果，这取决于VM拥有的内存量和我加载的驱动程序。\n由于缺少功能齐全的Windows实时版本，因此很难用于确定错误是由硬件还是软件问题引起的，从文件系统损坏或磁盘扇区损坏的机器恢复数据，以及在不创建新硬盘驱动器分区的情况下测试不同版本的OS。\n实时版本的Linux是完整的操作系统，能够挂载和重新分区磁盘、连接到互联网并运行Web浏览器，甚至可以在下次启动时保留设置和数据(对于永久的实时USB闪存驱动器)。这使得实时版本的Linux对于从损坏的硬盘驱动器恢复文件、对整个驱动器进行可引导备份、在不加载潜在受损操作系统的情况下扫描磁盘上的恶意软件、区分硬件问题和软件问题以及其他需要临时操作系统的任务非常有用。\n有些Linux发行版(如Puppy Linux)非常轻量级，它们默认从RAM磁盘运行，因此磁盘I/O比必须访问旋转硬盘的操作系统快得多。(这是以磁盘空间受RAM限制为代价的。不过，没有理由不能挂载内部或外部驱动器来存储文件。)。\n很少有硬件预装Linux的桌面版本，所以Linux的实时版本往往工作得很好，因为它几乎总是这样安装的。\n与实时引导类似，Linux通常作为虚拟机运行，因此它能够很好地适应硬件的变化。\n物理硬盘上现有的Linux分区可以被虚拟化并在另一台机器上运行，这是Windows所不具备的优点。\n与Linux不同，Windows安装不能轻易地从一个硬件迁移到另一个硬件。这不仅是因为微软的激活机制，而且是因为安装的内核和驱动程序依赖于实际的硬件。\n问题出在Windows，因为它的驱动程序设置，特别是存储设备的驱动程序设置，是不可移植的。除非修改Windows注册表以强制启动物理机和虚拟机的存储驱动程序，否则每次都很可能会出现0x0000007B停止蓝屏错误，需要恢复或修改注册表才能修复。\n尽管内核没有专有驱动程序(例如一些WiFi卡)，但它甚至可以将Linux安装转移到USB机箱，然后直接在同一架构的另一台机器上引导它。\nWindows路径长度限制为260个字符，包括文件名。(实际上，它通常更像199个字符。)这不是NTFS或Windows本身的缺陷，而是Windows API的非Unicode版本中的缺陷。\n这个问题可以通过使用Unicode版本的API调用来避免，但许多应用程序(例如Windows资源管理器、.NET以及随后的PowerShell)都没有这样做。\n当然，在编写良好的软件中，大多数操作系统限制都不是问题。也许Windows路径足够长。MAX_PATH在真正的软件中真的存在问题吗？\n但更大的问题是，许多Windows开发者太习惯于解决这个问题，以至于这个问题已经根深蒂固，可能永远不会得到解决。\nLinux内核确实有一个可调整的路径名长度限制；它在典型的内核和文件系统中有4096个字符。您可以通过运行以下命令来检查它：\n但是，Linux在其上运行的任何文件系统都不会强制执行此限制，因此在尝试解析规范文件路径时，一些libc实现一度容易受到缓冲区溢出的影响。\n2008年的POSIX修订版已经解决了这个问题，但在此之前，Linux内核不得不进行非标准修改以避免溢出，并在Linux程序员手册的realpath(3)手册页中警告了这个问题。\n这说明，虽然Linux内核开发者小心翼翼地避免破坏外部兼容性，但他们也故意暴露错误的假设，因为错误的假设往往会导致难以修复的错误。这就是为什么Linus Torvalds为Linux选择了异常高的定时器中断频率：\n我选择1000的部分原因是为了确保那些认为HZ是100的人会被迅速踢到裤子里。这意味着要做出巨大的改变，而不是微妙的小改变。例如，人们往往会突然说机器已经开机100天了(即使它真的只开机了10天)，但如果它只停机了两倍，这一点可能会被忽视。\nLinux使用区分大小写的文件名，因为Unix使用区分大小写的文件名。Unix区分大小写，因为Multics区分大小写。Multics区分大小写，因为ASCII标准既包括大写字母，也包括小写字母。[1]。\n电报代码只使用大写字母，或者至少不区分大写和小写。即使是1930年的国际标准ITA2，也使用了一个5位代码，可以在字母和数字之间切换，但不能大写和小写。[2]同样，穿孔卡片只使用大写字母。\n早在1959年，人们就提出了大小写不同位模式的编码方案[3]，但并未得到广泛应用。例如，1961年首次安装在洛斯阿拉莫斯国家实验室的IBM7030超级计算机采用的是交错大小写字母的8位编码。[4]然而，7030的字符编码并没有流行起来。\n早些时候，ASCII委员会得出结论，6位编码(64位模式)除了需要26个字母和10个数字之外，不足以同时包括控制字符和特殊字符，因此他们决定使用7位编码。然而，ASCII被设计为包括一个有用的6位子集，它只能容纳一个字母表。\n对于标准委员会来说，考虑6位、64字符的图形子集是很重要的。如果最终决定列6和列7用于图形，那么列2到列7将包含空间、94图形和删除。但是，即使代码提供了94个图形，标准委员会的一个主要假设是，在可预见的将来，数据处理应用程序将满足于一个单一的字母表(即64个或更少的图形子集)，就像它们过去所做的那样-64个字符的打印机将占主导地位。因此，能够通过简单(而不是复杂)的逻辑从代码中推导出64个字符的单一字母表图形子集是非常重要的。\n事实上，一些委员想把剩下的空间留给控制角色。\n上一段的结论是基于这样的假设，即7位代码中将包括两个字母，即小写字母和大写字母，而这一决定尚未做出。如果最终决定第6列和第7列将包含控件，那么7位代码中将不包含小写字母。*。\n*如果委员会真的决定对第6栏和第7栏进行控制，他们仍然很可能希望提供一个小写字母表。据推测，小写字母表可能是通过替换大小写的方法提供的。\n虽然该委员会最初成立于1961年，但直到1963年末，他们才最终同意采用小写字母，这在很大程度上是由于国际电报和电话咨询委员会(CCITT)的影响。\n在1963年10月29-31日召开的ISO/TC97/SC2第一次会议上，通过了一项决议，将小写字母分配到第6列和第7列。\n然而，国际标准化组织的提案没有包括CCITT认为必不可少的小写字母和五个重音符号。\n它可以使文件名更容易理解，例如区分路径/usr/share/X11/Locale/en_US.UTF-8/中的United States缩写(&#34；US&34；)和第一人称复数宾语代词(&#34；us&34；)。\n它还允许文件名有更多的可能性，并使文件名比较更简单、更快，因为它们不必偶尔转换为大写或小写。\n请记住，文件系统对大小写不敏感比对大小写敏感的工作要多得多。默认情况下，文件系统区分大小写，在最简单的情况下，只能通过大量额外的工程使其不区分大小写。在UNIX中，系统所要做的就是对文件名的前几个字母的ASCII值进行排序。在Mac OS和Windows中，文件系统必须足够智能，能够创建各种字母的同义词--A代表a，以此类推--并进行相应的排序。这需要大量的代码。1984年，在Windows向PC端提供小写字母之前，所有这些都得到了正确的处理，这证明了最初的Mac OS的完备性。\n然而，也不乏观点认为，强制文件名区分大小写--甚至通常区分大小写--是一个糟糕的决定。[5]。\n严格地说，现代Windows文件名可能区分大小写，但它们不区分大小写，因为用于打开文件的Windows API不区分大小写，即对CreateFiles的默认调用不会启用FILE_FLAG_POSIX_SEMANTICS选项。\n但是，Windows自己的NTFS文件系统是保留大小写的。这意味着可以使用Linux挂载NTFS分区，并在与MYFILE.TXT&34；相同的目录下创建名为Myfile.txt&34；的文件，但不能读取或修改这两个文件，至少不能使用标准Windows软件读取或修改这两个文件。\n此API行为的存在是为了维护与MS-DOS文件系统的兼容性。[7]MS-DOS是在Tim Paterson的86-DOS(1980年发布)和Marc McDonald的FAT文件系统上构建的，旨在与CP/M兼容。[8][9]CP/M是由Gary Kildall于1973年创建的，也使用不区分大小写的文件名。[12]\n小写ASCII字母在内部转换为大写，以符合CP/M文件和设备命名约定。\nCP/M手册没有明确说明使用这些约定的原因，但Gary Kildall在英特尔工作时，在一台运行TOPS-10操作系统的DEC PDP-10上编写了CP/M。[10]因此，CP/M和TOPS-10之间有许多相似之处，包括文件名不区分大小写。\n(应该指出的是，CP/M也与RT-11相提并论，RT-11是一种用于PDP-11小型机的DEC操作系统，与TOPS-10密切相关[11]，尽管其影响可能没有那么直接。)。\n为什么TOPS-10使用不区分大小写的名称？因为用于文件名的DEC SIXBIT编码针对其架构进行了优化。\n在FILES-11和RT-11磁盘中使用Rad50。它用于存储16位字中的3个字符。在TOPS-10 36位系统上使用SIXBIT在一个字中存储6个字符。它还允许快速搜索文件名，因为所有名称都在单词边界上(完整文件名CompAir需要2compair，1次掩码操作需要6+3个文件名)。\n(CP/M是为8位体系结构编写的，这大概就是它使用8.3文件名而不是6.3文件名的原因。)[13]。\n同样，RT-11没有使用ASCII作为文件名，而是使用了一种名为Radix-50的编码，这有助于节省内存。[14]。\n这两种编码都不再经常使用，但它们不区分大小写，这是对20世纪70年代硬件的有用优化，一直延续到今天。\n在文件名区分大小写方面缺乏一致意见似乎无关紧要，但这给跨平台开发带来了持续的困难。[15][16][17]。\n跨平台软件的开发人员试图避免假设文件名区分大小写，但当从Windows移植到Linux或从Linux移植到Windows时，这类问题就会出现。[18]。\nUnity无法在区分大小写的文件系统上正常运行(Unity用户如果试图在区分大小写的HFS+文件系统上安装和运行Unity，就会发现这一点)。这主要归功于Unity的资产数据库，以及它如何存储将它们映射到GUID值的路径。当然，在早期我们试图变得聪明一些，但如果您没有设置好实际验证您所做的操作在区分大小写的文件系统上是否有效，那么一些好心的程序员在某个地方抛出一个Tolower()并毁掉聚会是不会失败的。\nMultics中的所有内容都区分大小写；Multics允许使用全大写和小写ASCII字符集。\n多语言命令名和编程语言使用小写旁路约定，但用户可以在路径名、标识符、用户名等中自由使用大写字母。\n显然，BCD没有小写字符，Multics根本没有使用BCD，只是将日志、崩溃和磁带挂载消息从ring0输出到原始SElectric操作员的控制台。\n由于Multics文件系统区分大小写，外部名称必须区分大小写，并且在没有太多讨论的情况下，我们选择让所有变量名称区分大小写。\n分配给触摸者的代码和小写字母字符之间应该存在简单的对应模式。\n摘自第#34；页《256个字符的通用卡片码的建议》，《ACM通讯》，第2卷，第9期，9月1日。1959年。\nMac和Windows用户必须让技术支持人员通过电话向他们朗读文件名。他们必须能够给他们的母亲写一些关于如何打开邮件程序的便条，而不用担心文件名是如何大写的。难道你从来没有对路径中文件夹名称首字母大写的URL感到恼火吗？在得到一个绝对不是404个避风港的回复之前，你难道没有因为电子邮件地址区分大小写而暗地里感到高兴吗？\n众所周知，无论是初学者还是有经验的用户，程序中区分大小写都很容易出错。Bob Frankston是Multics的校友，也是VisiCalc的共同发明人，他曾经说过这是Multics给世界造成的最大错误。\n基于C的语言最有害的问题之一是它们区分大小写。虽然这个决定在1972年这种语言诞生的时候可能是有意义的，但人们想知道为什么克奈根和里奇的罪行在过去的33年里一直被盲目地延续下去。\n除非你有非常令人信服的理由让某些东西区分大小写，否则不区分大小写是一个更人性化的设计选择。设计对机器来说更容易的软件充其量也是有问题的。\n让人类学习和处理计算机存储大小写字符的方式不再有任何借口。取而代之的是，软件应该处理人类语言的奇特之处。\n既然它似乎是出于观点而不是必要性的表现，可以说区分大小写是现代技术最糟糕的表现方式。\n这真的很愚蠢，它会导致大量的问题，而且再也没有什么好的理由来区分大小写了。\n.", "note_en": "Clichés like these are vague and wishy-washy,and they are founded on anecdotes and hearsay.They cause  endless, unnecessary debates and make a muddle of the facts.\n It&#39;s easy to opine about one&#39;s preferred operating system,but harder to give objective, concrete examples.\n With the caveat that both Windows and Linux are moving targets,this document describes some specific technical reasonsto prefer using Linux as a desktop operating system.\n These reasons are not exhaustive—and not meant to be—but aim to be representative.\n  This document will not cover closed vs. open source development,but will instead focus on functionality.There is plenty of discussionof the advantages and disadvantages of open source elsewhere.\n (Besides, what is there to discusswhen we now know that  even Microsoft loves open source?)\n This discussion will only mention Microsoft and other companiesin so far as their actions are directly relevantto the technically capabilities of Windows and Linux.\n (As an aside, Microsoft gets a lot of guff in the open-source world,but its behavior is typical for a corporationwhose a bottom line relies on sales of proprietary software and devices.It&#39;s economics, not malice.)\n The discussion is intended to be as accurate as possible,at the cost of possible dryness due to technical detail.\n I am most familiar with the Debian-based family of Linux distributions,so my remarks will necessarily touch on these more,but I have tried to include other distributions when possible.\n In this document, the term &#34;Linux&#34; is shorthand for the entire distribution,including bootloader, kernel, shell, window manager, package manager, etc.Similarly, the term &#34;Windows&#34;refers to all default components of modern versions of Microsoft Windows NT,including Windows XP, Windows Vista, Windows 7, and Windows 8.\n Many of the same arguments in favor of Linuxalso apply to the BSD family of operating systems(and POSIX-compliant operating systems in general),but unfortunately I am not familiar enough with any of themto comment specifically.\n   Most people use Windows on the desktop because it&#39;s the default.Few are aware of the benefits of switching to another operating system,and even fewer are willing to put in the effort to do so.\n A Windows user interested in trying Linuxwill probably have difficulty finding a coherent reason to do so,since comparisons of operating systemstend to be vague, uninformed, or opinion-based.\n Even people who know and use Linux by choicemay not do a good job of explaining its benefits to their colleaguesespecially without putting down Windows usersor Windows applications in general.\n Also, there are many open source alternatives to Linux on the desktop,including a binary-compatible clone of Windows called  ReactOS.If it were just a matter of being open source,why bother with the additional effort to learn Linux?\n Even if you don&#39;t use Linux or Windows,it&#39;s useful to know where Linux has an edge,since these issues are relevant to all operating systems.\n If you are a new Linux user,this document is intended to inform youabout some of the benefits of Linux you may not be aware of,and to dig deeper if you are interested.\n If you are an experienced Linux user,this document is a test of the theory that the fastest way to get feedbackis to be publically wrong about something people care about.Corrections and additions are welcome.\n  This document does not claim that Windows is inferior in every way,or even that it is inferior overall.\n Instead, this is meant to provide insightinto why some people choose to use Linux as a desktop operating system,despite its shortcomings,and possibly to challenge some misconceptionsthat people have about Linux and Windows.\n Corrections and additions are, of course, welcome.Windows developers are ones who know the most about its flaws and strengths.\n Finally, definitions of better and worse are necessarily subjective,despite the title&#39;s claim of objectivity.You may heartily disagree with substantial parts of what follows,but perhaps it may be useful to you, even so.\n   This is a list of examples of specific limitationsthat are the result of the Windows kernel or API.\n    For example,  until Windows 8, desktop versions of Windowscould not boot from a USB.(And while running a live USB of Windows 8,it is still not possible to mount internal hard disks.)\n The  BartPE LiveCD building programis 3rd party software that will run on any version of Windows,but it is  only able to make a LiveCDfor Windows XP or Windows Server 2003.\n There is also the  WinBuilder project,which is the closest to a fully-functional LiveCD of modern Windows versions,but installing software and drivers is still sometimes a challenge.\n If the Virtual Machine fails don’t worry too much. Just because the VirtualMachine fails to boot right does not mean your boot media won’t work, I’veseen odd results depending on the amount of memory the VM has and whatdrivers I load.\n  The absence of fully functional live versions of Windowsmakes it difficult to use for, e.g,determining if a bug is due to hardware or software problems,recovering data from a machine with filesystem corruption or bad disk sectors,and testing out different versions of an OSwithout making a new hard drive partition.\n Live versions of Linux are full operating systems,able to mount and repartition disks,connect to the internet and run a web browser,and even retain settings and data on the next boot-up(for  persistent live USB flash drives).This makes live versions of Linux useful forrecovering files from damaged hard drives,making bootable backups of an entire drive,scanning a disk for malwarewithout loading a potentially compromised operating system,distinguishing hardware problems from software problems,and other tasks requiring a temporary operating system.\n Some live Linux distributions, such as  Puppy Linux,are lightweight enough that they default to  running from a RAM disk,and consequently have much faster disk I/Othan an OS that must access a spinning hard drive.(This comes at the cost of disk space being limited by RAM.There&#39;s no reason you can&#39;t mount an internal or external driveto store files, though.)\n Very little hardware comes with a  desktop version of Linux pre-installed,so live versions of Linux tend to work very well,since that is almost always the way it is installed.\n   Similar to live booting,Linux is often run as a virtual machine,and consequently it is well-adapted to changes in hardware.\n An existing Linux partition on a physical hard drivecan, with some care, be virtualized and run on another machine,a virtue which Windows does not share.\n Windows installations, unlike Linux, cannot easily be moved from onehardware to another. This is not just due to Microsoft&#39;s activationmechanism but the fact that the installed kernel and drivers depend on theactual hardware.\n  The problem lies with Windows, in that its driver settings, particularlyfor storage devices, are not portable. Unless you modify the Windowsregistry to force start storage drivers for both the physical and virtualmachines, you will mostly likely end up with a  0x0000007B STOP bluescreen error each time which will require a restore or modifying theregistry to fix.\n  It&#39;s even possible to transfer a Linux install to a USB enclosureand boot it directly on another machine of the same architecture,although the kernel will lack proprietary drivers (e.g. some wifi cards).\n   Windows path lengths  are limited to 260 characters, including filename.(In practice, it is often more like  199 characters.)This is  not a flaw in NTFS or Windows per se,but in the  non-Unicode version of the Windows API.\n This problem can be avoided by using Unicode versions of the API calls,but many applications(e.g.  Windows Explorer,  .NET and  consequently Powershell)have not done so.\n Of course, most OS restrictions are  not an issue in well-written software.Maybe Windows paths  are long enough.Is  MAX_PATH an actual problem in real software?\n   But the bigger issueis that many Windows developers are  so used to  working around the problemthat it has become deeply entrenched and may  never be fixed.\n The Linux kernel does have an adjustable pathname length limit;it&#39;s  4096 chars in typical kernels and filesystems.You can check it by running:\n  However,  this limit is not enforcedby any filesystems that Linux runs on,and consequently some  libc implementationswere for a while  susceptible to buffer overflowwhen trying to resolve canonical file paths.\n The 2008 POSIX revision has  addressed the issue, but prior to thisthe Linux kernel had to make non-standard modifications to avoid overflow,and  warned about the problem in the  realpath (3) man pageof the Linux Programmer&#39;s Manual.\n This illustrates that while the Linux kernel developersscrupulously avoid breaking external compatibility,they also intentionally expose false assumptions,since false assumptions tend to cause hard-to-fix bugs.This is why Linus Torvalds chose an unusually high timer interrupt frequency for Linux:\n I chose 1000 originally partly as a way to make sure that people thatassumed HZ was 100 would get a swift kick in the pants. That meant makinga _big_ change, not a small subtle one. For example, people tend to reactif &#34;uptime&#34; suddenly says the machine has been up for a hundred days (evenif it&#39;s really only been up for ten), but if it is off by just a factor oftwo, it might be overlooked.\n   Linux uses case-sensitive filenamesbecause Unix used case-sensitive filenames.Unix was case-sensitive because Multics was case-sensitive.Multics was case-sensitive because the ASCII standardincluded both an uppercase and a lowercase alphabet.  [1]\n  Telegraphy codes used uppercase only,or at least did not distinguish upper and lowercase.Even ITA2, an international standard from 1930,used a 5-bit code with a shift to switch between letters and figures,but not upper and lowercase.  [2]Similarly, punched cards used uppercase letters only.\n Encodings with different bit patterns for uppercase and lowercasehad been proposed as early as 1959,  [3]though they were not widely implemented.For example, the IBM 7030 &#34;Stretch&#34; supercomputer,first installed at Los Alamos National Laboratory in 1961,had an 8-bit encoding that interleaved uppercase and lowercase alphabets. [4]However, the 7030&#39;s character encoding did not catch on.\n Early on, ASCII committee concluded that 6-bit encodings (64 bit patterns)were insufficient to include both control characters and special charactersin addition to the required 26 alphabetics and 10 numerics,so they decided to use a 7-bit code.However, ASCII was designed to include a useful 6-bit subset,which could only fit a single alphabet.\n The consideration of a 6-bit, 64-character graphic subset was important tothe standards committee. If the ultimate decision was that columns 6 and 7would be for graphics, then columns 2 through 7 would contain Space, 94graphics, and Delete. But, even with the code providing 94 graphics, amajor assumption of the standards committee was that data processingapplications would, for the foreseeable future, be satisfied with amonocase alphabet (that is, a 64- or less graphic subset) as they had inthe past---that 64-character printers would predominate. So it wasimportant to be able to derive a 64-character, monocase alphabet, graphicsubset from the code by simple, not complex, logic.\n In fact, the some of the committee memberswanted to reserve the remaining space for control characters.\n The conclusion of the preceding paragraph is based on the assumptionthat two alphabets, small letters and capital letters, would be includedin the 7-bit code and that decision had not yet been made. If thedecision was ultimately made that columns 6 and 7 would would containcontrols, then small letters would not be included in the 7-bit code.  *\n * If the committee did decide for controls in columns 6 and 7, it isstill likely that they would have wanted an alphabet of small letters to beprovided. Presumably, the small letter alphabet would then have beenprovided by a caseshift approach.\n Though the comittee first formed in 1961,it wasn&#39;t until late 1963that they finally agreed to include a lowercase alphabet,largely because of the influence of theInternational Telegraph and Telephone Consultative Committee (CCITT).\n At the first meeting of ISO/TC97/SC2 in 1963 October 29-31, a resolutionwas passed that the lower-case alphabet should be assigned tocolumns 6 and 7.\n The ISO proposal, though, did not include the lower case alphabet and thefive accent marks that the CCITT considered essential.\n  It can make filenames more intelligible,such as distinguishing betweenthe abbreviation for United State (&#34;US&#34;)and the first-person plural objective pronoun (&#34;us&#34;)in paths such as  /usr/share/X11/locale/en_US.UTF-8/.\n It also allows more possibilities for filenames,and makes filename comparisons simpler and fasterbecause they don&#39;t have to occasionally convertto uppercase or lowercase.\n Bear in mind that it&#39;s MUCH more work for a filesystem to becase-insensitive than -sensitive. A filesystem is case-sensitive bydefault, in the simplest case; it can only be made case-INsensitive througha lot of extra engineering. In UNIX, all the system has to do is sort onthe ASCII values of the first letters of the filenames. In the Mac OS andWindows, the filesystem has to be smart enough to create synonyms ofvarious letters — A for a, and so on — and sort accordingly. That takes aLOT of code. It&#39;s a testament to the completeness of the original Mac OSthat in 1984 this was all handled properly, before Windows even broughtlower-case letters to the PC side.\n  However, there is also no shortage of opinionsthat enforcing filename case-sensitivity-- and even case-sensitivity in general --was a bad decision.  [5]\n   Strictly speaking, modern Windows filenames could be case-sensitive,but they aren&#39;tbecause the  Windows API for opening files  is not case-sensitive,i.e. the  default call to  CreateFiledoes not enable the  FILE_FLAG_POSIX_SEMANTICS option.\n However, Windows&#39; own NTFS filesystem is  case-preserving.This means that it is possible to mount an NTFS partition with Linuxand make a file called &#34;Myfile.txt&#34; in the same directory as &#34;MYFILE.TXT&#34;,but it will  not be possible to read or modify both of those files,at least not with standard Windows software.\n This API behavior exists to maintain compatibility with MS-DOS filesystems.  [7]MS-DOS was built on Tim Paterson&#39;s 86-DOS (released in 1980)and Marc McDonald&#39;s FAT filesystem,which were designed for compatibility with CP/M.  [8]  [9]CP/M was created in 1973 by Gary Kildall,and also used case-insensitive filenames.  [12]\n Lower case ASCII alphabetics are internally translated to uppercase to be consistent with CP/M file and device name conventions.\n  The CP/M manual does not state explicitly why it uses these conventions,but Gary Kildall wrote CP/M on a  DEC  PDP-10 mainframerunning the  TOPS-10 operating systemwhen he was working at Intel.  [10]Consequently, there are many similarities between CP/M and TOPS-10,including filename case-insensitivity.\n (It should be noted that CP/M has also been compared to RT-11,a DEC operating system for the PDP-11 minicomputerthat is closely related to TOPS-10,  [11]although the influence may not have been as direct.)\n Why did TOPS-10 use case-insensitive names?Because the DEC SIXBIT encoding used for filenameswas optimized for its architecture.\n RAD50 was used in FILES-11 and RT-11 disks. It was used to store 3characters in a 16 bit word. SIXBIT was used on TOPS-10 36bit systems tostore 6 characters in a word. It also allowed for a fast file name searchsince the names were all on word boundaries (full filename compair took 2compair, and 1 mask operation 6+3 file names).\n  (CP/M was written for an eight-bit architecture,which is presumably why it used an 8.3 filenameinstead of a 6.3 filename.)  [13]\n Similarly, the RT-11 didn&#39;t use ASCII for filenames,but rather an encoding called RADIX-50,which helped to save memory.  [14]\n Neither of these encodings are used much anymore,but their case-insensitivity,a useful optimization on 1970s hardware,endures to this day.\n The lack of agreement on filename case-sensitivity may seem insignificant,but it has caused persistent difficultiesin cross-platform development.  [15]  [16]  [17]\n Developers of cross-platform software try to  avoid making assumptions about filename case-sensitivity,but problems of this ilk crop upwhen porting from Windows to Linux or vice-versa.  [18]\n  Unity does not properly run on a case-sensitive file system (which issomething that Unity users have discovered if they’ve tried to install andrun Unity on a case-sensitive HFS+ file system). This is primarily due toUnity’s asset database, and how it stores paths to map them to GUID values.Of course we tried to be smart in the early days, but if you don’t set up away to actually verify that what you’re doing works on a case-sensitivefile system, then it will never fail that some well-intentioned programmerthrows a toLower() in somewhere and ruins the party.\n Everything in Multics is case sensitive; Multics permits use of the fullupper and lower case ASCII character set.\n Multics command names and programming languages use lowercase byconvention, but users are free to use uppercase letters in path names,identifiers, user names, etc.\n    Obviously, BCD had no lower-case characters, and Multics did not use BCDat all, except to output log and crash and tape mount messages from ring0 to the primitive Selectric operator&#39;s console.\n  Since the Multics file system distinguished between upper and lower case,external names had to be case sensitive, and without much discussion wechose to have all variable names be case sensitive.\n  Simple pattern of correspondence should exist between codes assigned toupper and lower case alphabetic characters.\n From page 20 of &#34;A proposal for a generalized card code for 256 characters&#34;,Communications of the ACM, Volume 2 Issue 9, Sept. 1959.\n  Mac ＆ Windows users have to have filenames read to them over the phoneby support techs. They have to be able to write little sticky notes totheir mothers about how to open up the mail program, without worryingabout how the filenames are capitalized. Haven&#39;t you ever fumed over aURL with initial-caps in the folder names in the path, having to fiddlewith capitalization until you get a response that&#39;s anything but a 404?Haven&#39;t you ever been secretly pleased that e-mail addresses aren&#39;tcase-sensitive?\n  Anecdotally, case sensitivity in programs is known to be error-prone forboth beginners and experienced users. Bob Frankston, a Multics alumnusand the co-inventor of VisiCalc, once said it was the biggest mistakethat Multics had inflicted on the world.\n  One of the most pernicious problems with C-based languages is thatthey&#39;re case-sensitive. While this decision may have made sense in 1972when the language was created, one wonders why the sins of Kernighan andRitchie have been blindly perpetuated for the last thirty-three years.\n  Unless you have extremely compelling reasons to make somethingcase-sensitive, case insensitivity is a much more human being friendlydesign choice. Designing software that&#39;s easier for machines isquestionable at best.\n  There is no longer any excuse for making humans learn and handle thequirks of the way computers store upper- and lower-case characters.Instead, software should handle the quirks of human language.\n  Since it appears to have manifested out of opinion rather thannecessity, it could be said case-sensitivity is the worst way thatmodern technology sucks.\n  This is really stupid, it causes a ton of problems and there is nolonger any good reason to have case sensitivity in \n......", "posttime": "2020-11-16 07:21:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,linux,喜欢,reasons", "title": "更喜欢Linux而不是Windows的客观原因", "title_en": "Objective reasons to prefer Linux over Windows", "transed": 1, "url": "https://github.com/nbeaver/why-linux-is-better", "via": "", "real_tags": ["windows", "linux", "喜欢", "reasons"]}, {"category": "", "categoryclass": "", "imagename": "fa090186754a6a8de7fc9a59d0fc0917.jpg", "infoid": 1035339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本系列之前的一篇博文是关于多个国家正在开发或已经开发的手机应用程序，用于追踪新冠肺炎感染的传播情况。这篇博客特别描述了挪威的情况，我们表达了我们的担忧，但也表达了我们的信任，因为挪威数据保护局(‘Datatilsynet’)将现场保护隐私-这是受挪威严格的隐私法规监管的。\n我们是对的，我们为挪威数据保护局的干预感到自豪，该局在6月份禁止了挪威新冠肺炎追踪应用Smittestopp。这项禁令表明了NDPA的独立性，当公共(和私人)组织违反法律时，NDPA有法律权力执行隐私保护。\n这一权力植根于《个人数据法》(Personopysningsloven)、挪威实施的GDPR以及个人数据法规(Personopysningsforskriten)。\n在对今年4月实施的应用程序Smittestopp进行评估后，NDPA得出结论认为，该应用程序主要在两个方面违反了隐私法：\n这款应用程序并不是对用户基本数据保护权利的适当干预。\n6月12日，NDPA通知挪威公共卫生研究所(NIPH)，该应用程序将被禁止，并于7月6日得到确认。因此，NIPH立即停止从该应用程序的大约60万活跃用户那里收集数据，并删除了他们的Azure服务器上存储的所有数据。\n违反比例干预要求的原因是，由于测试地区实际使用APP的人口相对较少(只有16%)，APP在感染跟踪方面的预期价值较低。\n违反数据最小化原则的原因是，这款应用的设计涵盖了三个不同的目的：\nNDPA对这款应用程序也很关键，因为用户不可能选择他们的数据将用于这三个目的中的哪一个。\n政府已经决定终止Smittestopp的进一步开发，转而专注于开发一款新的应用程序。在征求了NIPH的建议后，政府决定在谷歌苹果曝光通知系统(GAEN)的基础上开发一款新的应用程序，他们称之为“谷歌和苹果的国际框架”，因为很多国家(例如丹麦、芬兰、德国、英国)都在走向“GAEN之路”。\n支持政府决定的重要论据是，GAEN只支持数字感染跟踪(基于蓝牙)，不涉及中央数据存储，并包括交流经验和处理用户越境的可能性。与此同时，欧盟已经实施了一项分散日冕追踪应用的建议，将Gaen“直接放在框架内”。\nNIPH的任务是在新应用程序开发任务的公开竞争中明确征求建议书，现在(10月20日)丹麦网络公司被聘请来进行开发。Netcompany与丹麦卫生当局有类似的合同，是唯一的投标人(！)。这款新的APP预计将于今年(2020年)实施。\n三个主要问题仍在争论中，第一个是技术问题：蓝牙足够可靠吗？经验表明，在使用蓝牙时，确实会出现假阳性，但也会出现假阴性。\n第二个问题当然是隐私。即使个人数据存储在手机本地，手机之间的通知也必须通过网络转发--那么黑客攻击又如何呢？此外，都柏林的三一学院发现，在安卓手机上，除非将所有者和位置信息发回谷歌，否则gaen将无法工作。\n这就引出了第三个问题：让科技巨头控制一个涉及处理非常私人的信息的解决方案明智吗？“谷歌或苹果是否有权告诉民选政府或其公共卫生机构，他们在一款应用上可能有什么，或者可能没有什么？”\n今年9月11日，挪威数据保护局发布了一份关于新冠肺炎(冠状病毒)感染追踪的数字解决方案的报告。这份报告是由Simula Research Laboratory开发的，该实验室没有投标新的基于GAEN的应用程序的合同(辩称他们是一家研究机构，而不是一家软件开发公司)。\n这份名为《…》的报告。重点关注政府使用的效率、数据隐私、技术相关风险和有效性。在隐私和数据保护方面，报告指出，如果位置数据仍然由谷歌存储，新冠肺炎应用Smittestopp对隐私的侵犯将比Gen应用少。\n最后，我们将引用一句话(在我们的翻译中)：“数字感染跟踪没有完美的解决方案。有效的感染控制和隐私是对立的。“。\n对于Runbox的我们来说，隐私是无价的，我们仍然在想是不是利大于弊。", "note_en": "Our previous blog post in this series concerned mobile phone applications under development, or already developed, in various countries for tracing the spread of COVID-19 infections.  In particular the blog described the situation in Norway, and we expressed our concerns, but also our trust, in the fact that The Norwegian Data Protection Authority (‘Datatilsynet’) would be on the spot to safeguard privacy – as regulated by  strict  Norwegian privacy regulations.\n   We were right, and we are proud of the intervention by the Norwegian Data Protection Authority (NDPA), which in June banned the Norwegian COVID-19 tracker app  Smittestopp. The ban illustrates NDPA’s  independency, and that NDPA has legal power to enforce privacy protection when public (and private) organizations violate the law.\n This power is anchored in the Personal Data Act ( personopplysningsloven), the Norwegian implementation of GDPR, and the Personal Data Regulations ( personopplysningsforskriften).\n After evaluating the app  Smittestopp as it was implemented in April this year,  NDPA concluded that the app violated the privacy legislation in mainly two respects:\n The app was not a proportionate intervention of the user’s fundamental right to data protection.\n On June 12, The NDPA notified The Norwegian Institute of Public Health (NIPH) that  the app would be banned, which was confirmed on July 6. Consequently, NIPH immediately stopped collecting data from the around 600,000 active users of the app, and deleted all stored data on their Azure server.\n  The breach of the requirement for proportional intervention concerned the expected low value of the app regarding infection tracking, due to the relatively small number of the population in the testing areas actually using the app (only 16%).\n The reason for the breach of the principle of data minimization was that the app was designed to cover  three different purposes:\n  The NDPA was also critical to the app because it was not possible for the users to choose for which of the three purposes their data would be used.\n  The government has decided to terminate further development of  Smittestopp, and will instead focus on the development of a new app. After seeking advice from NIPH, the government has decided to base a new app on the Google Apple Exposure Notification (GAEN) System, or ENS, which they call “the international framework from Google and Apple” because many countries (for instance Denmark, Finland, Germany, Great Britain) are going “the GAEN way”.\n Important arguments for the government’s decision are that GAEN supports digital infection tracking only (Bluetooth-based), involves no central data storage, and includes the possibility to exchange experiences and handle users’ border crossings. In the meantime the EU has implemented a recommendation for decentralized Corona tracking applications, putting GAEN “ squarely in the frame“.\n NIPH was given the task to specify a request for proposal in an open competition for the development assignment of the new app, and now (October 20) the Danish Netcompany is hired to do the development. Netcompany has a similar contract with the Danish health authorities, and was the only bidder (!). The new app expected to be implemented this year (2020).\n  Three main issues are still being debated, and the first is technical: Is Bluetooth reliable enough? Experiences show that false positives, but also false negatives, do occur when Bluetooth is being used.\n The second issue is of course privacy. Even if personal data is stored locally on the phone, notifications between phones have to be relayed through a network – so  what about hacking? In addition, Trinity College in Dublin has uncovered that on Android phones,  GAEN will not work unless it is sending owner and location information back to Google.\n This leads to the third issue: Is it sensible to let the  tech giants control a solution that involves processing very personal information? “Do Google or Apple get to tell  a democratically elected government or its public health institutions what they may or may not have on an app?”\n The Norwegian Data Protection Authority published a  report on digital solutions for COVID-19 (‘Coronavirus’) infection tracking on September 11 this year. The report was developed by Simula Research Laboratory, who did not bid on the contract for the new GAEN-based application (arguing that they are a research institution and not a software development company).\n The report “… focuses on efficiency, data privacy, technology-related risks, and effectiveness for government use. In terms of privacy and data protection,  the report notes that if location data is still stored by Google, the COVID-19 app  Smittestopp would be less privacy intrusive than the GAEN one.”\n  We will conclude with  a quote (in our translation): “There is no perfect solution for digital infection tracking. Effective infection control and privacy stand in opposition to each other.”\n For us at Runbox, privacy is priceless, and we are still wondering if the pros outweigh the cons.", "posttime": "2020-11-16 07:01:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新冠,tracing,数据", "title": "挪威新冠肺炎联系人追踪APP被数据保护局禁止", "title_en": "Norwegian Covid-19 contact tracing app banned by the Data Protection Authority", "transed": 1, "url": "https://blog.runbox.com/2020/10/the-norwegian-covid-19-contact-tracing-app-is-banned-by-the-data-protection-authority/", "via": "", "real_tags": ["新冠", "tracing", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一条常见的数学线索认为，不是一种单一的无穷大，实际上存在不同级别的无穷大的无限层次。而整数集的大小是纯无限的，而有理数集和整数一样大(因为你可以通过交错分子和分母的数字将每个有理数映射成一个整数，例如。\\(0.456456456..)。=\\frac{456}{999}=\\frac{152}{333}\\right tarrow 135323\\))，实数集的大小是某种更大的无穷大，因为没有办法从实数到整数进行类似的映射。\n首先，我应该指出，没有映射的说法是错误的，这是相对容易看出的。这里有一张简单的地图。对于一个给定的实数，给我一个(确定性的)python程序，它将打印出它的数字(例如。对于π，这可能是一个使用无穷级数\\(\\pi=4-\\FRAC{4}{3}+\\FRAC{4}{5}-\\FRAC{4}{7}+...\\)计算出越来越好的近似值的程序。我可以将程序转换为数字(使用n=int.from_bytes(open(&#39；program.py&#39；).read()，；BIG)，然后输出该数字。好了。这就是从实数到整数的映射。\n现在，让我们来看看最常见的声称不存在这样的映射的论点，即康托的对角线论点。以下是加州大学丹佛分校的一篇讲解，它很简短，所以我只会截图看整件事的来龙去脉：。\n现在，这一论点的根本缺陷在于：实数的小数展开并不是唯一的。要提供精确格式的反例，请考虑用对角线数字加粗的集合(用二进制写成的数字)：\n对角线给出：01111……。如果我们翻转每个数字，我们得到的数字是：\\(y=\\)0.10000.。\n这就是问题所在：就像十进制一样，0.9999……。等于1，二进制表示为0.01111.。等于0.10000……。因此，即使新的小数展开不在原始列表中，数字\\(y\\)与数字\\(x[2]\\)完全相同。\n请注意，这直接意味着停顿问题实际上是可解的。要了解其中的原因，可以想象一个有人声称不会停止的计算机程序。设c[1]为一步后的程序状态，c[2]为两步后的程序状态，依此类推。设x[1]，x[2]，x[3]……。是所有实数(存在，如上所述)的完整枚举，以基数\\(2^D\\)表示，其中\\(D\\)是程序内存的大小，因此程序状态总是可以表示为单个数字。设y=0.c[1]c[2]c[3].。假设这个数字是列表的一部分，因此它是x[i]值之一，因此可以在有限的时间内计算它。这对许多行业都有影响，尤其是在证明图灵完成区块链实际上是安全的方面。", "note_en": "A common strand of mathematics argues that, rather than being one single kind of infinity, there are actually an infinite hierarchy of different levels of infinity. Whereas the size of the set of integers is just plain infinite, and the set of rational numbers is just as big as the integers (because you can map every rational number to an integer by interleaving the digits of its numerator and denominator, eg.  \\(0.456456456.... = \\frac{456}{999} = \\frac{152}{333} \\rightarrow 135323\\)), the size of the set of  real numbers is some kind of even bigger infinity, because there  is no way to make a similar mapping from real numbers to the integers.\n First of all, I should note that it&#39;s relatively easy to see that the claim that there is no mapping is false. Here&#39;s a simple mapping. For a given real number, give me a (deterministic) python program that will print out digits of it (eg. for π, that might be a program that calculates better and better approximations using the infinite series  \\(\\pi = 4 - \\frac{4}{3} + \\frac{4}{5} - \\frac{4}{7} + ...\\)). I can convert the program into a number (using  n = int.from_bytes(open(&#39;program.py&#39;).read(), &#39;big&#39;)) and then output the number. Done. There&#39;s the mapping from real numbers to integers.\n Now let&#39;s take a look at the most common argument used to claim that no such mapping can exist, namely Cantor&#39;s diagonal argument. Here&#39;s an  exposition from UC Denver; it&#39;s short so I&#39;ll just screenshot the whole thing:\n  Now, here&#39;s the fundamental flaw in this argument:  decimal expansions of real numbers are not unique. To provide a counterexample in the exact format that the &#34;proof&#34; requires, consider the set (numbers written in binary), with diagonal digits bolded:\n  The diagonal gives: 01111..... If we flip every digit, we get the number:  \\(y =\\) 0.10000......\n And here lies the problem: just as in decimal,  0.9999.... equals 1, in binary 0.01111..... equals 0.10000..... And so even though the new  decimal expansion is not in the original list, the  number  \\(y\\) is exactly the same as the number  \\(x[2]\\).\n Note that this directly implies that the halting problem is in fact solvable. To see why, imagine a computer program that someone claims will not halt. Let c[1] be the state of the program after one step, c[2] after two steps, etc. Let x[1], x[2], x[3].... be a full enumeration of all real numbers (which exists, as we proved above), expressed in base  \\(2^D\\) where  \\(D\\) is the size of the program&#39;s memory, so a program state can always be represented as a single &#34;digit&#34;. Let y = 0.c[1]c[2]c[3]........ This number is by assumption part of the list, so it is one of the x[i] values, and hence it can be computed in some finite amount of time. This has implications in a number of industries, particularly in proving that &#34;Turing-complete&#34; blockchains are in fact secure.", "posttime": "2020-11-16 07:00:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无限,wrong,数字", "title": "康托错了：揭穿无限集合层次", "title_en": "Cantor was Wrong: debunking the infinite set hierarchy", "transed": 1, "url": "https://vitalik.ca/general/2019/04/01/cantor.html", "via": "", "real_tags": ["无限", "wrong", "数字"]}, {"category": "", "categoryclass": "", "imagename": "e3751d7bb62d192c759cd99e44ee6756.png", "infoid": 1035337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论他们的年龄、兴趣或能力如何，这些礼物都会让任何一个黑客在这个节日期间笑逐颜开。\n这三个国家支持的黑客组织(APT)分别是俄罗斯的锶(Fancy Bear)和朝鲜的Zinc(Lazarus Group)和Cerium。\n这是一种批判性的组合制造工厂的性质安全漏洞意味着黑客们很容易就盯上了发薪日--以及袭击事件正在增加。..。\n美国国土安全部的网络安全机构否认了美国总统唐纳德·特朗普关于选举舞弊的指控。\n该公司声称，有影响力的人联手推广亚马逊平台上列出的假冒产品。\nVertare将这一事件归咎于人类用户数据后出错存储在一个不安全的外部存储服务。这些文件是由访问的外部的一方。..。\nACSC表示，针对卫生部门的SDBBot攻击有所增加，SDBBot是Clop勒索软件的已知先驱。", "note_en": "No matter their age, interests, or ability, these gifts will put a smile on any hacker&#39;s face this holiday season.\n  The three state-sponsored hacker groups (APTs) are Russia&#39;s Strontium (Fancy Bear) and North Korea&#39;s Zinc (Lazarus Group) and Cerium.\n  A\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcombination\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcritical\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnature\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmanufacturing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplants\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvulnerabilities\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmean\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thackers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teyeing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tup\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teasy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpay\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdays\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t-\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tattacks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trise.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Department of Homeland Security&#39;s cybersecurity agency rejects US president Donald Trump&#39;s claims of election fraud.\n  The company claims influencers worked together to promote fake products listed on Amazon’s platform.\n  Vertafore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tblames\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tincident\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thuman\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\terror\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tafter\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tuser\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdata\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstored\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunsecured\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texternal\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstorage\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservice.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfiles\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twere\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taccessed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texternal\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tparty.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The ACSC says it has seen an uptick in attacks targeting the health sector with SDBBot, a known precursor of the Clop ransomware.", "posttime": "2020-11-16 06:43:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "货币,heist,黑客", "title": "另一起加密货币抢劫案，这一次从阿克卫城被盗200万美元", "title_en": "Another Cryptocurrency Heist, This Time $2 Million Stolen from Akropolis", "transed": 1, "url": "https://www.zdnet.com/article/hacker-steals-2-million-from-cryptocurrency-service-akropolis/", "via": "", "real_tags": ["货币", "heist", "黑客"]}, {"category": "", "categoryclass": "", "imagename": "a24c858b3dd327b337b48ddc70e854ce.jpeg", "infoid": 1035336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "瑞典首席流行病学家承认，该国正在经历冠状病毒病例的第二次激增，尽管此前曾预测，由于该国的不封锁政策，今年秋季的感染人数将相当低。\n到了秋天，会有第二波浪潮。瑞典将拥有很高的豁免权，病例数量可能会相当低，安德斯·泰内尔(Anders Tegnell)在5月份向英国《金融时报》表示。\n然而，据英国《金融时报》周四报道，最新数据显示，相对于瑞典的人口规模，瑞典的感染、住院和死亡人数都高于邻国。\n根据路透社(Reuters)报道的官方数据，瑞典周四记录了4658例新的冠状病毒病例，最近几周每天新增病例激增。\n住院人数也大幅增加，有1000多名新冠肺炎患者在医院接受治疗，比上周增加了60%。这些数据是由国家电视台SVT报道的，并被《卫报》引用。\n经人口数量调整后，瑞典的冠状病毒死亡率目前是世界上最高的之一。\n因设计瑞典的反封锁政策而闻名的泰内尔本周承认，该国正目睹病毒在全国范围内显著传播。\n据路透社报道，泰格纳尔在新闻发布会上说，我不认为这个定义有那么重要，但我们现在看到社区同时在许多地区蔓延。\n瑞典公共卫生机构也承认，该国在第一波疫情中发现的大量病例在第二波疫情中并没有起到保护作用。\n瑞典公共卫生局(Public Health Agency)的萨拉·拜福斯(Sara Byfors)向英国《金融时报》表示：我们还看到，欧洲其他许多国家在春季造成了很大影响，那些先是封锁，现在又开始封锁的国家，现在也出现了大幅增长。\n所以它似乎遵循这样的模式，如果你在春季有很多病例，你现在也会看到很多病例……。我们不知道为什么会这样。\n瑞典政府最初拒绝采取严格措施来应对冠状病毒，只依靠自愿指导来尝试和遏制感染的传播。\n然而，感染人数的激增促使该国在最近几周采取了更严厉的措施。\n据BBC报道，瑞典已经采取行动，禁止晚上10点以后在酒吧和酒吧销售酒类。特内尔本周告诉瑞典人，政府可能会被迫在圣诞节前在全国范围内实施旅行限制。\n点击“注册”，即表示您同意接收来自Business Insider以及其他合作伙伴的营销电子邮件，并接受我们的服务条款和隐私政策。\n两条交叉的线，组成一条直线。它指明了一种关闭交互或取消通知的方式。", "note_en": "Sweden&#39;s chief epidemiologist has admitted that the country is experiencing a second surge in coronavirus cases despite  previously predicting that the number of infections in the autumn would be &#34;quite low&#34; due to the country&#39;s no-lockdown policy.\n &#34;In the autumn there will be a second wave. Sweden will have a high level of immunity and the number of cases will probably be quite low,&#34; Anders Tegnell told the  Financial Times back in May.\n However, the latest figures show Sweden is experiencing higher levels of infections, hospitalizations and deaths than its neighbours, relative to its population size, the  Financial Times reported on Thursday.\n Sweden recorded 4,658 new coronavirus cases on Thursday,  according to official figures reported by Reuters, with new daily cases having surged in recent weeks.\n   Hospitalizations have also increased dramatically, with over 1000 patients with COVID-19 being treated in hospitals, a 60% increase from last week. The figures were  reported by state broadcaster SVT and  cited by the Guardian.\n The death rate from coronavirus in Sweden is now  one of the highest in the world when adjusted for population size.\n Tegnell, who has become known for designing Sweden&#39;s anti-lockdown policy, admitted this week that the country was seeing significant spread of the virus across the country.\n &#34;I don&#39;t think the definition is that important, but we see community spread in many regions simultaneously right now,&#34; Tegnall told a press conference, according to  Reuters.\n   Sweden&#39;s public health agency also acknowledged that the high number of cases seen in the country in the first wave had not protected it in the second.\n &#34;We also see that many other countries in Europe that had a big effect during the spring, that had lockdowns and now again have lockdowns also see a big increase now,&#34; Sara Byfors from the Public Health Agency of Sweden told the Financial Times.\n &#34;So it seems to follow this pattern that if you had a lot of cases during the spring you also see a lot of cases now... We don&#39;t know why this is.&#34;\n The Swedish government initially refused to adopt strict measures to tackle the coronavirus, relying only on voluntary guidance to try and curb the spread of infections.\n   However, the surge in infections has prompted the country to  adopt harsher measures in recent weeks.\n The country has moved to  ban the sale of alcohol in pubs and bars after 10pm and Tegnell this week told Swedes that the government may be forced to introduce travel restrictions across the country &#34;right before Christmas,&#34;  according to the BBC.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n          Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-11-16 06:19:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,群体,herd", "title": "瑞典的群体免疫力希望因第二波冠状病毒浪潮而破灭", "title_en": "Sweden's herd immunity hopes dashed by second coronavirus wave", "transed": 1, "url": "https://www.businessinsider.com/sweden-herd-immunity-second-wave-coronavirus-cases-hospitalisations-surge-2020-11", "via": "", "real_tags": ["病毒", "冠状病毒", "群体", "herd"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "21世纪职场生活的一个更黑暗的结果是掠夺性零工经济。由于没有医疗福利和固定工资，数百万工人被告知，为了不断递减的回报，他们应该幸运地开车载着乘客四处转转。\n上周，一项允许零工经济公司继续将司机视为独立承包商的投票措施--22号提案(Propose22)--有望在加州这个日益进步的州被否决。但由于优步(Uber)、Lyft、Seamless和DoorDash的巨额支出，选民们以压倒性多数通过了这项法案。科技巨头联盟释放了超过2亿美元的资金--是工会等反对者的10倍--轻而易举地淹没了那些为工人权利而战的人。\n总数是巨大的。优步及其盟友没有留下任何侥幸心理。这些公司获得了数十亿美元的投资资本，可以很容易地部署现金来粉碎那些代表他们的员工进行倡导的人。\n随着22号提案的通过，这些科技巨头中的下层阶级将继续超负荷工作，工资过低，得不到全职员工的福利。他们将继续生活在早产中，在大流行期间无法获得失业保险、带薪探亲假或医疗保健。\n这次投票可能会对全国产生影响，因为它拒绝了2018年州最高法院裁决中概述的原则，以及2019年州法律中规定的在公司正常业务范围内执行任务的工人必须被视为员工的原则。现在零工工人不受这些规定的约束，可以继续独立工作。\n这是一个有害的资本主义新时代，在这个时代，企业可以残忍地剥削工人，而永远不会盈利。像通用汽车(General Motors)这样的旧世界巨头至少需要赚钱才能生存。\n优步的商业模式是特朗普式的。优步冲进世界各地的城市，公然藐视当地法规，烧掉了投资者的现金，纯粹是通过无处不在的方式取胜。优步每年亏损，但吞噬了市场，提供人为廉价的交通工具，同时迫使出租车司机等竞争对手自杀。没有办法与一家允许在亏损的情况下蓬勃发展的公司竞争。优步可以不断地打折乘车，相信新的资本将永远到来支撑它。\n事实上，优步的生存取决于不把司机归类为全职员工。这将使他们成为一家传统的公司，受到一定的引力定律的约束。工人的成本可能很高；毕竟，他们会提出要求。\n如果22号提案失败，估值高达数十亿美元的优步将被迫将资金重新投向员工的口袋。从长远来看，这将是不可接受的，剥夺了其富有的捐赠者和高管的虚幻。\n在一个理智的社会里，一家公司不可能习惯性地赔钱、惩罚员工并维持运转。优步可以。\n在2010年代的大部分时间里，零工公司都依赖于公众的善意。大多数消费者和政界人士幸灾乐祸地没有意识到他们的商品是如何变得如此便宜的，他们庆祝优步(Uber)、Lyft和他们的兄弟们的崛起。\n这一措施的结果不应被视为对大型科技公司的全民公投--不应存在如此荒谬的支出差距。给工会2亿美元来反击宣传，总票数可能会被推翻。然而，这一结果确实给左翼敲响了警钟，这些贪婪的公司将不惜一切代价保护它们在市场上的非自然优势。\n优步(Uber)及其同类公司将员工视为可牺牲的资产。在加州获胜后，他们将在其他地方寻求毁灭性的胜利。这将取决于其他州，甚至国会，以某种方式迫使这些公司就范。这是一场必须加入的战斗。", "note_en": "O ne of the darker outcomes of 21st-century work life has been the predatory gig economy. Divorced from healthcare benefits and regular pay, millions of workers are told they are supposed to be lucky to drive passengers around in a car for ever-diminishing returns.\n Last week, there was hope that Proposition 22, a ballot measure that allows gig economy companies to continue treating drivers as independent contractors, would be defeated in California, an increasingly progressive state. But voters passed the measure overwhelmingly, thanks to obscene amounts of spending by Uber, Lyft, Seamless and DoorDash.  Unleashing more than $200m – 10 times the amount of the proposition’s opponents, like labor unions – the coalition of tech giants easily drowned out those fighting for the rights of workers.\n  The sum is titanic.  Uber and its allies left nothing to chance. Reaping billions in investment capital, the companies could easily deploy the cash to crush those advocating on behalf of their workforce.\n With Proposition 22’s passage, the underclass of these tech giants will remain overworked and underpaid, denied the benefits of full-time employees. They will continue to dwell in precarity, unable to access unemployment insurance, paid family leave or healthcare during a pandemic.\n The vote will probably have a nationwide impact, since it rejected the principles outlined in a 2018 state supreme court ruling and enshrined in a 2019 state law that said workers who performed tasks within a company’s regular business must be treated as employees. Now gig workers are exempted from these rules and can continue to work independently.\n This is a pernicious new era of capitalism, in which companies can brutally exploit their workers without ever turning a profit. Old-world giants, like General Motors, at least needed to make money to survive.\n  The Uber business model is Trumpian. Storming into cities across the world and openly flouting local regulations, Uber burns up investor cash, winning through sheer ubiquity. Uber loses money every year but devours the market, offering artificially cheap transportation while driving rivals, like taxi drivers,  to suicide. There is no way to compete with a company that is allowed to thrive while losing money. Uber can continually discount its rides, confident new capital will arrive to prop it up forever.\n In fact, Uber’s survival depends on not classifying its drivers as full-time employees. That would make them a conventional company, subject to certain laws of gravity. Workers can be costly; they make demands, after all.\n Had Proposition 22 failed, Uber, with its multibillion-dollar valuation, would have been forced to redirect its capital into the pockets of its workers. This, in the long run, would be unacceptable, depriving its wealthy benefactors and executives of their unreality.\n In a sane society, a company could not habitually lose money, punish its workers and keep functioning. Uber can.\n For much of the 2010s, gig companies coasted on the goodwill of the public. Blissfully unaware of how their goods were rendered so cheaply, most consumers and politicians celebrated the rise of Uber,  Lyft and their brethren.\n The outcome of this measure should not be treated as a referendum on big tech – not with such an absurd spending disparity. Give a labor union $200m to counter propaganda, and a vote total could be flipped. The outcome does, however, serve as a warning to the left that these rapacious companies will do anything and everything to protect their unnatural advantage in the marketplace.\n Uber and its ilk treat workers as expendable assets. Having won in  California, they will seek devastating victories elsewhere. It will be up to other states, even Congress, to somehow bring these companies to heel. This is the fight that must be joined.", "posttime": "2020-11-16 05:20:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经济,tech", "title": "大型科技公司在一项旨在伤害零工经济工人的投票措施上投入了2亿美元。他们赢了", "title_en": "Big tech threw $200m at a ballot measure to hurt gig economy workers. They won", "transed": 1, "url": "https://www.theguardian.com/commentisfree/2020/nov/13/big-tech-california-gig-workers-labor-rights", "via": "", "real_tags": ["经济", "tech"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你需要在你的后台(在云中运行)和你的前端(在用户的设备上运行，无论是以移动应用还是web应用的形式)之间提供一个API。\n我们尝试通过识别系统中的域对象以及将对其执行的操作来定义这样的API，让后端和前端团队就这些名词和动词达成一致，让后端团队实现API，并由前端团队使用它们。\n在三层前端-后端-数据库体系结构中，尝试使用尽可能薄的中间层。或者甚至通过直接将数据库暴露给前端来完全消除后端层。\n例如，如果API返回Person对象，只需返回底层表1：1的字段。执行SELECT*，迭代所有列，并将它们复制到将发送回前端的JSON。向数据库添加列时，这样的后端层不需要更改。相反，只选择SQL查询中的某些列。或者只将SQL响应中的某些列复制到JSON中，如下所示：\n无论何时添加新的数据库列，都需要更改此代码。当--而不是如果--你忘记了，它会导致不必要的混淆和调试：\n前台工程师：为什么我没有看到前台的电话号码栏？您没有将该列添加到数据库中吗？后台工程师：是的，我是这么做的。前台工程师：你没填上吗？后台工程师：是的，我是这么做的。前台工程师：那是怎么回事？后端工程师：您提出的请求是正确的吗？前台工程师：是的，看看这段代码…。后台工程师：看起来是正确的，但可能在运行时参数有误。你为什么不给我看看真正发出的请求呢？前台工程师：在这里。后台工程师：嗯，…。这个请求是正确的。我们如何确定后端不会返回电话号码。也许是这样的，但是在前端代码…的某一层中，它被遗漏了。前台工程师：我不这么认为，因为…。后端工程师：可以肯定的是，最好使用Postman进行测试。前台工程师：*去测试*看，这是API请求和响应。后台工程师：嗯，让我看看，也许几天后，我现在正忙着做别的事情。(两天后)哦，后端API实现需要更新才能添加新的字段。\n通过使后端成为直通通道，您可以绕过整个效率低下的问题。这让你少了一件担心的事情，这是任何工程师都会欢迎的。\n在API文档中，不要逐个列出要返回的字段及其类型。取而代之的是“返回与数据库相同的字段”。同样，出于同样的原因：它可能--不，将--过时，并且误导性的文档对您的公司有负面价值。相反，让前端工程师直接参考数据库模式，它不会过时，因为它是真相的来源。\n这是一层不会增加价值的翻译。这使得工程师更难获得系统的端到端视图，比如他们是否好奇姓名是以独立的名字和姓氏字段表示，还是以单个全名字段表示。不仅如此，这样的翻译层还会有需要修复的错误。\n您可以更进一步，直接将数据库公开给客户端应用程序，例如让客户端应用程序只将SQL查询发送到服务器执行。如果走到这一步，您甚至不会拥有后端层--而不是三层前端后端数据库体系结构，而是两层前端数据库体系结构。\n现在，这可能并不总是可能的。比如说安全性--你不想让一个受到威胁的客户获得其他客户数据的访问权，或者让一个客户在没有付费的情况下将自己标记为高级计划中的一员。或者，可能某些代码需要访问客户端上不可用的资源。或者要求太高而不能在客户机上运行。或者需要在特定时间运行，而不管客户端设备当时是否在线。\n所以，在没有后端的情况下，一个瘦的后端可能是你的正确选择。也许您可以授予客户端对数据库的只读访问权限，但不能授予其写入权限。或者，您可以只授予客户端对其数据的读写访问权限。问问你自己，你怎么会懒惰，把尽可能多的工作推给数据库。现代后端框架使用的数据库能力可能只有5%。这是不幸的。\n作为仅直接公开数据库中部分数据的示例，假设您正在构建一个社交网络，其中的朋友信息是公开的。假设您将其建模为一个Friends表，该表由两列组成，其中包含两个好友的用户ID。现在，传统的方法是让你为前台定义一个后端API来交朋友。相反，您可以定义一个API，该API从客户端获取SQL查询，运行它，然后返回结果。此查询可以在仅具有读取访问权限的数据库用户帐户下运行，该数据库用户帐户也仅具有对FRIENDS表的访问权限。这可以适应不可预见的用途，比如获取好友数量，而不是实际的列表。或者，如果有一个搜索框，用户可以在其中过滤他的朋友，你可以进行Like查询。或者，您可以将返回的好友数量限制为在用户界面中显示的数量。或者只返回一些字段，即您将在前端使用的字段。或者只过滤有电话号码的朋友，比如你是否正在构建某种拨号器用户界面。所有这些灵活性现在都是可用的，而您不必预见、规划和构建它。不要让后端层成为数据库和前端之间的紧身衣，就像你不会强迫与会者通过摩尔斯电码进行交流一样。\nSQL强大、简单、声明性强，大多数工程师都知道这一点--没有其他任何东西能带来这些好处。当然不是您的定制API。Greenspun的第十条编程规则说，任何足够复杂的C或Fortran程序都包含一个临时的、非正式指定的、充满错误的、缓慢实现的Common Lisp的一半。类似地，您的自定义API包含半个SQL的临时的、非正式指定的、充满错误的、缓慢的实现。至多一半。不要定义如此贫乏的API。\n这是一种新的思维方式：在有事情要做的时候构建一个后端API，而不是作为对数据库的传递。这与您不会定义一个对象来包装另一个对象并转发对该对象的所有方法调用和返回值，而不做任何其他操作的原因是相同的。\n无论如何，您都会在设计数据库模式时投入大量心思。如果不是，就应该这么做，因为这比后端或前端代码更难更改。但是，一旦这样做了，为什么还要设计另一个模式，即后端返回的响应呢？\n现在，您可能不同意上面的建议，因为您反对理想的API不应该在后端数据库更改的情况下更改。理想的API应该是抽象层。但是，您不需要在第一天就进行所有可能的抽象层。抽象层的设计和实现需要时间，而且很难重构功能并将其转移到另一个层。\n抽象层甚至可能需要雇佣一个单独的后端团队，这反过来又会增加团队之间的协调成本，这种成本永远不会消失。让每个额外的人都加入进来并充分发挥效率需要一年的时间。让团队编写一个规范来就它们之间的接口达成一致，实现这个规范，处理由于后端没有实现规范或前端假定规范不能保证的东西而导致的错误，在需要更改时更新这一层等等，这些都是更大的开销。\n取而代之的是，让你的前端(包括移动)工程师负责API。后端工程师应该在那里提供建议、协助、实现和指出前端工程师忽略的事情，而不是定义API。让前端团队负责API，而不是让前端团队和后端团队建立平等的合作伙伴关系。\n例如，假设您的前端工程师提议，不是先用API来吸引人，再用第二个API来获得订单，再用第三个API来获得其他东西，他们将用一个API来一次性获得渲染主页所需的所有数据。让他们为所欲为吧。事实上，这使前端工程师不必进行多次调用来获取他们想要呈现页面并将其组合在一起的数据。这进而导致了更复杂的问题，比如如何处理部分失败，其中一个调用成功，另一个调用失败。此外，如果像幼稚的实现那样一个接一个地进行调用，则会增加延迟。最好是把它们放在一起。除非第二个API依赖于第一个API。当您定义能够满足您的即时需求的API(如获取主页数据)时，所有这些复杂性就不复存在了。如果你想要一辆车，你不会想买一个发动机、方向盘、刹车和其他部件，然后自己把它们组装成一辆车。\n每当主页UX发生更改，并且需要不同的信息时，让API更改。好的API不应该改变，但当您控制API的两端时，这并不重要[1]。内部API不应与公共API遵循相同的标准。如果你试图这样做，你就过度设计了它。走捷径。你是在一个背景下进行设计，而不是在真空中，所以不利用那个背景是愚蠢的。\n事实上，即使使用同一术语API来指代两个完全不同的事物-内部API和公共API-也是有问题的，因为其中一个的含义并不适用于另一个。这就像用车辆这个词来指代自行车和核潜艇，并试图将潜艇设计中的一些原则应用到自行车上。\n如果你把拥有一个尽可能小的后端的想法推向它的逻辑结论，你最终会得到一个Baas，就像Firebase一样。这个架构背后蕴含着很多智慧。如果我要开始一种新产品，Baas会是我的第一选择。只有在我确定巴斯不会为我工作的情况下，我才会使用其他人。\n如果Baas对您不起作用，可以尝试PostGraphile或Hasura等接受数据库并自动生成API服务器的工具，通过GraphQL公开数据库内容。或者PostgREST，它类似，但是会自动生成一个REST服务器，如果您不需要GraphQL的话。\n最终，您可能会发现这种架构已经无法满足您的需求，需要一个更重的后端。现在是建造一个的时候，而不是在此之前。这适用于很多事情--通常情况下，您不需要进行自动化测试。或微服务。或者正式的人力资源政策。或者很多事情。不要效仿谷歌或亚马逊。考虑到你所处的位置，做对你合适的事。", "note_en": "You need to come up with an API between your backend (running in the cloud) and your frontend (running on users’ devices, whether in the form of a mobile or a web app).\n We try to define such an API by identifying the domain objects in our system and the operations that will be performed on them, have the backend and frontend team agree on these nouns and verbs, have the backend team implement the API, and the frontend team consume them.\n  In the three-tier frontend-backend-database architecture, try to have as thin a middle layer as possible. Or even eliminate the backend layer altogether by directly exposing the database to the frontend.\n For example, if your API returns a Person object, just return the fields of the underlying table 1:1. Do a SELECT *, iterate over all the columns, and copy them to the JSON that will be sent back to the frontend. Such a backend layer won’t need changing when you add columns to your database. As opposed SELECT’ing only certain columns in your SQL query. Or copying only certain columns from the SQL response to the JSON like:\n  This code will require changing whenever you add a new database column. And when — not if — you forget, it result in needless confusion and debugging:\n Frontend engineer: Why am I not getting the phone number field on the frontend? Did you not add the column to the database? Backend engineer: Yes, I did. Frontend engineer: Did you not populate it? Backend engineer: Yes I did. Frontend engineer: Then what’s going wrong? Backend engineer: Are you making the right request? Frontend engineer: Yes, look at this code… Backend engineer: That looks correct, but maybe the parameters are wrong at runtime. Why don’t you show me the actual request that’s sent? Frontend engineer: Here it is. Backend engineer: Hmm… the request is correct. How can we be sure that the backend isn’t returning the phone number. Maybe it is, and it’s getting missed at some layer of the frontend code… Frontend engineer: I don’t think so, because… Backend engineer: Better test it using Postman, to be sure. Frontend engineer: *goes off and tests* See, here’s the API request and response. Backend engineer: Hmm, let me look at it, maybe in a few days, I’m busy with something else now. (After two days) Oh, the backend API implementation needs to be updated to add the new field.\n You can bypass this whole inefficiency by making the backend a pass-through. That gives you one fewer thing to worry about, which any engineer will welcome.\n In your API documentation, don’t list out fields that will be returned, and their types, one by one. Instead say “Returns the same fields as the database.” Again, for the same reason: It can — no,  will — get out of date, and misleading documentation has a negative value to your company. Instead, ask the frontend engineers to directly refer to the database schema, which can’t get out of date, because it is the source of truth.\n   That’s a layer of translation that doesn’t add value. And makes it harder for engineers to get an end to end view of the system, say if they’re curious whether names are represented as separated given and family name fields or as a single full name field. Not only that, but such translation layers will have bugs that need fixing.\n You can take this one step further by directly exposing the database to the client app, such as by having the client app just send SQL queries to the server to execute. If you go this far, you wouldn’t even have a backend layer — instead of a three-tier frontend-backend-database architecture, you’d have a two-tier frontend-database architecture.\n Now, that may not always be possible. Say for security — you don’t want a compromised client getting access to other clients’ data, or for a client to mark itself as being on the premium plan despite not paying. Or maybe some code requires access to resources not available on the client. Or is too demanding to run on the client. Or needs to be run at a certain time irrespective of whether the client device is online at that time.\n So, intead of no backend, a thin backend may be the right choice for you. Maybe you can give clients read-only access to the database, but not write. Or maybe you can give clients read-write access to only their data. Ask yourself how you can be lazy, pushing as much work as possible down to the database. Modern backend frameworks use maybe 5% of the power of databases. This is unfortunate.\n As an example of directly exposing only some data from the database, imagine you’re building a social network, where friend information is public. Say you model this as a friends table consisting of two columns for the user IDs of the two people who are friends. Now, the conventional approach would have you define a backend API for the frontend to get friends. Instead, you can define an API that takes an SQL query from the client, runs it, and returns the results. This query can be run under a database user account that has only read access, that too only to the friends table. This can accommodate unforeseen uses, like getting the number of friends rather than the actual list. Or if there’s a search box where the user can filter his friends, you can do a LIKE query. Or you can limit the number of friends returned to how many will be displayed in the UI. Or return only some fields, the ones you’ll use in your frontend. Or filter only friends who have a phone number, say if you’re building some kind of dialer UI. All this flexibility is now available without you having to foresee it, plan for it, and build it. Don’t make the backend layer a straitjacket between the database and the frontend, any more than you’d force participants in a meeting to communicate via morse code.\n SQL is powerful, simple, declarative and most engineers know it — there’s nothing else with all these benefits. Certainly not your custom API. Greenspun’s tenth rule of programming says that any sufficiently complicated C or Fortran program contains an ad hoc, informally-specified, bug-ridden, slow implementation of half of Common Lisp. Similarly, your custom API contains an ad-hoc, informally-specified, bug-ridden, slow implementation of half of SQL. At most half. Don’t define such an anaemic API.\n This is a new way of thinking: build a backend API when it has something to do, not as a pass through to your database. This is the same reason you wouldn’t define an object that wraps another object and forwards all method calls to it, and the return values back, without doing anything else.\n You’re anyway going to put in a lot of thought into designing your database schema. And if you’re not, you should, since that’s harder to change than either backend or frontend code. But once you do that, why design another schema, which is the responses returned by your backend?\n Now, you may disagree with the above advice, by objecting that an ideal API should not change if the backend database changes. An ideal API should be a layer of abstraction. But you don’t need every possible layer of abstraction on day 1. Layers of abstraction take time to design and implement, and make it hard to refactor functionality and move it to another layer.\n A layer of abstraction may even require hiring a separate backend team, which in turn imposes a coordination cost between the teams, which will never go away. Getting each additional person onboarded and fully productive takes a  year. Having teams write a spec to agree on the interface between them, implement this spec, deal with bugs caused by the backend not implementing the spec or the frontend assuming things that the spec doesn’t guarantee, updating this layer when needs change, and so on, is more overhead.\n Instead, put your frontend (which includes mobile) engineers in charge of the API. The backend engineers should be there to advise, assist, implement and point out things the frontend engineers overlooked, not to define the API. Instead of an equal partnership between the frontend and the backend teams, put the frontend team in charge of the API.\n For example, suppose your frontend engineers propose that instead of having an API to get people, and a second API to get orders, and a third API to get something else, they’ll have an API to get all the data needed to render the home page in one go. Let them have their way. This, in fact, saves frontend engineers from having to make multiple calls to get the data they want to render the page and knit it together. Which in turn causes more complexity like how to handle partial failures, where one call succeeds and another fails. Also, if the calls be made one after another, as a naive implementation would, it increases latency. It’s better to make them in parallel. Unless the second API depends on the first. All this complexity goes away when you define APIs that do what you immediately need, like  get data for home page. If you want a car, you don’t want to buy an engine, a steering wheel, brakes and other components and assemble them into a car yourself.\n Whenever the home page UX changes, and different information is needed, let the API change. Good APIs aren’t supposed to change, but that doesn’t matter when you control both sides of the API [1]. An internal API should not be held to the same standard as a public API. If you try to, you’ve over-engineering it. Take shortcuts. You’re designing in a context, not in a vacuum, so it’s foolish not to take advantage of that context.\n In fact, even using the same term  API to refer to two completely different things — internal and public APIs — is questionable, because connotations from one don’t apply to the other. It’s like using the term  vehicle to refer to both a bicycle and a nuclear submarine, and trying to apply some principles from designing the sub to the cycle.\n If you take this idea of having as small a backend as possible to its logical conclusion, you’ll end up with a BaaS, like Firebase. There’s a lot of wisdom behind that architecture. If I were starting a new product, BaaS would be my first choice. I’d use others only if I’m sure BaaS wouldn’t work for me.\n If BaaS doesn’t work for you, explore things like  PostGraphile or  Hasura that take in a database and autogenerate an API server, exposing the database contents via GraphQL. Or  PostgREST, which is similar but autogenerates a REST server, if GraphQL is unnecessary for you.\n Eventually you may find that you’ve outgrown this architecture, and need a heavier backend. That’s the time to build one, not before. That goes for a lot of things — you don’t need to have automated tests as a general practice. Or  microservices. Or formalised HR policies. Or a lot of things. Don’t ape Google or Amazon. Do what’s right for you, given where you are.", "posttime": "2020-11-16 05:20:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "后端,layer,api", "title": "让你的后端层越薄越好", "title_en": "Make Your Back End Layer as Thin as Possible", "transed": 1, "url": "https://kartick.substack.com/p/make-your-backend-layer-as-thin-as", "via": "", "real_tags": ["后端", "layer", "api"]}, {"category": "", "categoryclass": "", "imagename": "76cc97d15ac3f15672669baa173561a7.jpg", "infoid": 1035331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在地图上拖放国家以比较它们的相对大小。格陵兰岛真的和整个非洲一样大吗？你可能会对你的发现感到惊讶！对教育工作者来说是一个很棒的工具。", "note_en": "Drag and drop countries around the map to compare their relative size. Is Greenland really as big as all of Africa? You may be surprised at what you find! A great tool for educators.", "posttime": "2020-11-16 05:19:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "墨卡托,size,发现", "title": "国家的真实大小(墨卡托预测)", "title_en": "The True Size Of Countries (Mercator projection)", "transed": 1, "url": "https://thetruesize.com/", "via": "", "real_tags": ["墨卡托", "size", "发现"]}, {"category": "", "categoryclass": "", "imagename": "ee1c089c1e43e75f1513c42a1a5d22f9.jpg", "infoid": 1035330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果新的iPhone 12系列热销，但数以百万计的潜在升级者现在应该按兵不动了。\nMacRumors发现，大量用户报告称，新iPhone 12机型的短信服务出现故障。投诉的范围很广，从无法发送或接收短信，到群聊中遗漏了短信，以及没有收到短信接通的通知。这个问题似乎也影响到了一些较老的机型。\n“@AppleSupport你什么时候能解决iPhone 12专业版的问题？我和大多数其他iPhone 12专业版用户都没有收到短信？”--来源。\n他说：“我可以证实这是真的。在绿色泡泡群聊中，我错过了大约三分之一的短信，而我有一部iPhone 12 Pro Max。妻子用的是iOS14.2版的iPhone X，她没有错过任何一部。“--消息来源。\n“嘿，@AppleSupport，我刚拿到我的新iPhone 12 Pro Max，但我没有收到短信。”你能帮忙吗？“--来源。\n“导致我收不到所有短信的bug什么时候能解决？我使用iPhone已经有10年了，但我打算退掉这台iPhone 12 Pro。“--消息来源。\n“@AppleSupport有没有解决iPhone 12收不到短信群发短信的主要问题？这变得非常烦人。“--消息来源。\n“@AppleSupport你们能解决iPhone 12的iMessage/短信问题吗？我25%的短信都不见了，真的很糟糕。”--消息来源。\n“自从我更新手机后，我就没有收到过短信通知，我对@Apple非常恼火。”--消息来源。\n“@AppleSupport Um短信怎么回事？24小时后我会收到任何短信。“--来源。\n@AppleSupport我需要修复短信通知漏洞。自从我下载了iOS14之后，我就一直错过重要的短信。“--来源。\n有趣的是，对于一些老款iPhone的用户来说，这个问题似乎从iOS 14问世以来就一直在表面下冒泡。但直到新款iPhone 12的发布，这个问题才似乎变得普遍起来，苹果还没有承认这一点：\n“我收到了苹果和Tmobile的麻烦通知单，但这两家公司都还没有收到任何信息。”升级到工程部，但一直没有听到任何消息。苹果的技术人员非常怀疑这是他们的问题，但这个问题太普遍了。“--消息来源。\n我已经联系了苹果公司，当我收到回复时，我会更新这篇文章。与此同时，考虑到没有收到短信可能带来的严重后果(这对双因素身份验证也至关重要)，我建议考虑购买任何iPhone 12机型的买家推迟购买，直到这个问题得到解决。", "note_en": "Apple’s new iPhone 12 range is selling like hot cakes, but millions of potential upgraders should now hold fire.\n         Spotted by  MacRumors, large numbers of users are reporting that SMS messaging on the new iPhone 12 models is broken. Complaints range from being unable to send or receive SMS, to missing messages in group chats and no notifications for the SMS messages which do get through. The problem also appears to be hitting some older models.\n        “@AppleSupport When will you fix the issue on the iPhone 12 pro where I, and most other iPhone 12 pro users, are not receiving SMS texts?” -  source\n    “I can confirm this is true. I’m missing about 1/3 of the texts in a green bubble group chat and I have an iPhone 12 Pro Max. Wife is on iPhone X with iOS 14.2 and she’s not missing any.” -  source\n  “Hey @AppleSupport I just got my new iPhone 12 pro max and I’m not getting sms messages. Can you help?” -  source\n  “When will the bug that causes me not to receive all SMS text messages be resolved? I’ve been an iPhone user for 10 years, but I’m about to return this iPhone 12 Pro.” -  source\n  “@AppleSupport is there a fix for the major issue of the iPhone 12 not receiving SMS group text messages? This is becoming very annoying.” -  source\n  “@AppleSupport are you guys ever going to fix the iMessage/text issue with the iPhone 12. It really sucks missing 25% of my texts.” -  source\n  “I haven’t been getting text notifications ever since I updated my phone and I’m SO ANNOYED @Apple” -  source\n  “@AppleSupport Um what&#39;s going on with SMS TEXTS? I am getting any SMS text like 24 hours later.” -  source\n  @AppleSupport I need the text message notifications bug fixed. I keep missing important text messages ever since I downloaded iOS 14.” -  source\n  Interestingly, for some owners of older iPhones it appears that this problem has been bubbling under the surface since the  arrival of iOS 14. But only with the launch of the new iPhone 12 models has the problem seemingly become widespread, something Apple has yet to acknowledge:\n  “I&#39;ve got trouble tickets with Apple and Tmobile and nothing from either yet. Escalated to engineering but havent heard anything. Apple tech was VERY suspicious that it is their issue, but it&#39;s so widespread.” -  source\n  I have contacted Apple and will update this article when I receive a response. In the meantime, given the potentially serious consequences that occur from not receiving SMS messages (also crucial for  two-factor authentication), I would advise buyers considering any iPhone 12 model to hold off on their purchase until this is fixed.", "posttime": "2020-11-16 05:19:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,发出,issued,短信", "title": "向数百万新iPhone 12用户发出警告", "title_en": "Warning Issued for Millions of New iPhone 12 Users", "transed": 1, "url": "https://www.forbes.com/sites/gordonkelly/2020/11/14/apple-iphone-12-pro-max-mini-sms-text-message-failure-send-receive-ios-14-upgrade/", "via": "", "real_tags": ["iphone", "发出", "issued", "短信"]}, {"category": "", "categoryclass": "", "imagename": "233380145c39ce52c4b5abd77c6aeb1a.png", "infoid": 1035328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约一年前，我辞去了开发倡导者的工作，创办了一家公司。\n我有大约12000美元的积蓄。足够支付一年的开支，甚至更多。我几乎什么都不花钱了。\n这能有多难，对吧？我创造了一些东西，找到了10到20个客户，然后就完成了。我每个月赚1000美元，然后增长到20000美元的MRR。没问题。\n井。但事实并非如此。你们都知道这一点。我没有。我太天真了，我想我不是唯一一个这么想的人。\n有消息吗？成功的故事？关于自助的书？播客？对所有这些都感到内疚。我以为我够聪明了。如果其他人也能做到的话..。我?。甚至更好。\n井。我现在身无分文。我讨厌我创造的项目。我讨厌我花光了所有的钱，却没有赚到一美元(我赚了大约60美元，这比0美元还要痛苦)，而不是从我的项目中，而不是从客户或公司那里。\n所以真正的成本比我损失的钱还多。我让我的女朋友在家呆了一年，我们什么也没做，我们没有买衣服，吃了最便宜的食物等等。我觉得我已经失去了我生命中的一年。\n我在这里写的关于独立黑客的文章比我的任何一个项目都要多得多。我在几个小时内就完成了这些工作。\n我一直认为人们会恨我，告诉我我是个白痴，是个骗子，我的想法很糟糕，我很烂。\n我一直想写更多的东西。我爱死它了。但我觉得，如果我不能成功，我就不能写作。但我想这是没有规则的。\n所以，如果你喜欢我的写作，请给我一个快乐的时刻，给我买一两杯咖啡：https://www.buymeacoffee.com/jrleonr.。\n我感觉到了。戒烟完全没问题，老实说，我觉得我们应该让戒烟更常态化。\n坚韧不拔和吃苦耐劳是成功的重要因素，但如果你认为经营企业是一场马拉松，而不是短跑，那么我们需要承认，每个人都有不同的速度和耐力，就像跑马拉松一样。我说我们指的是我们个人，而不是整个社区。根据我的经验，独立黑客的很大一部分是了解自己，并能够设定健康的界限。\n此外，生活中很少有东西是永恒的。如果你现在放弃了，并不意味着你以后就不能再回来了。但你必须做适合你的事。保重!。\n这是如此真实，我能感觉到它充满了激情。不幸的是，这个故事在许多IndieHacker中很常见。只有真正成熟的人才能承认失败，意识到创业不适合自己。\n这个话题在这个论坛上提得不够多。作为一个社区，我们庆祝200美元的MRR，这有时令人印象深刻，但它不会支付账单，也不会帮助你迈出信念的一步，真正做到自力更生。\n你介意分享一下你认为如果重新开始你会改变什么吗？我和其他IndieHacker肯定都很想知道。\n谢谢你分享这篇文章，因为这篇文章真的切中了我的要害。我想过很多次要戒烟，但成功的小小暗示让我坚持了下来。有时候，那些成功的暗示实际上是海市蜃楼，我相信你也遇到过这样的情况。\n自力更生是一件很难的事。在我工作的头两年，我遛狗来支付房租，在开发商的消费上刷爆了我的信用卡。\n做了同样的事。最好是在继续工作的同时兼职做生意。风险要低得多。调整后重试。\n我是一名游戏开发者。我在2018年4月被解雇了。我过去一个月挣3500美元。在过去的两年半里，我赚了大约7000美元，大部分都是自由职业。我所有的游戏都失败了。我和我的父母住在一起，和你一样对失去的时光有同样的感受。我不知道这条评论的目的，但我只是想分享一下。\n做你喜欢做的事。如果你实现了成为一名独立黑客制造者的梦想，如果这些梦想是以彻底的焦虑为代价的，那也无关紧要。你喜欢写作，显然你在这方面很出色。做你喜欢做的事。\n把今年的好东西拿走吧。你可能学到了比你一生中任何一年都要多的东西，你离你真正想要的生活又近了一步，你比你想象中更多地测试了你与爱人和你自己的个人关系。如果你今年熬过了，其他任何一年你都能熬过去。\n祝你余生好运，我希望在IH圈子里再次见到你(写作，而不是创作)。\n👆🏻-你做到了。这是没有规则的。你可以边走边编。\n他被送进了监狱。但是，他遭受了邪恶的折磨，这是从你口中说出来的。\n马尔科克斯以罪犯身份入狱，但离开时却是一个受过教育、有强烈动机、虔诚信仰的民权人士。\n你的故事令人谦卑。对于我们这些仍在试水的人来说，这是一个亟需的现实检验。\n它也让很多退伍军人分享了他们不那么光鲜的经历，所以谢谢你的分享。\n好的一面是，你在IH上学到了一些非常昂贵的课程，但仍然喜欢写作……。也许整理一下你的想法，花些时间记录你的错误，你本可以做的不同的事情，等等，然后把它出版成一本电子书：作为一个自学成才的创始人要避免的事情？\n这。谢谢你写下这封信。自从几个月前我决定成为一名独立制作人以来，我开始感到焦虑，甚至出现了肠道问题。我花了3000英磅，从……赚了2英磅。5~6成熟。\n有一句话说，爱而受伤总比从未被爱要好--我相信这里也是如此。你试过了。你尽了你最大的努力。正如你在其中一条评论中所说，戒烟需要勇气。祝你未来的事业好运，伙计！\n如果这能让你感觉好一些，你应该知道，对营销和推动创业的商业方面的焦虑总体上是非常普遍的。\n我认为，如果你看大多数个性图，你会发现这一面与分析相反，所以这在某种程度上是意料之中的。\n也许现在正是做你正在考虑做的事情的好时机，为这个人工作一段时间，重新获得一些自信，改善财务状况。“。\n如果你真的决定在之前再给一次，或许你应该考虑和这些超级外向、过于自信、有魅力的推销员们共同创立公司，或许你应该考虑与这些超级外向、过于自信、魅力十足的销售人员共同创立公司？这样一来，你就不需要处理向他人推介创意/产品时的焦虑情绪，而只是享受创造的乐趣。\n乔斯，祝你一切顺利，好起来，谢谢你这篇勇敢的帖子！\n此外，我认为每个人都在为害怕别人的想法而苦苦挣扎。认识到这是正常的，这是开始克服它的一种健康方式。\n嘿，何塞，真的很抱歉读到这个。我可以告诉你，这一年你可能学到了很多有用的东西，但我知道这不会让你感觉好一点。\n我认为这里给其他独立黑客(包括我)的教训是，在你有一个副业开始获得一些吸引力之前，不要辞去你的工作。\n嘿，我可以说我很遗憾听到这个消息，但现实是，你的故事对很多人来说都是真实的，它更像是一种常态，而不是异常值。有些人很幸运，第一次尝试就找到了宝石，许多人在尝试的过程中放弃了，还有一些人最终找到了宝石，并从中获利。\n当你与成功的创始人交谈时，你会意识到，即使是价值数十亿美元的成功故事，也至少有一次，而且往往是无数次，都处于死亡的边缘。\n好消息是，你会暂时与外界脱节，然后意识到这一年对你的生活是多么有价值。现在这可能看起来像是浪费，但你最终会开始欣赏它的。有时你甚至可能会再试一次，甚至可能比你想象的更早。\n此外，如果你是游戏做一些兼职项目，你可以给我发电子邮件(电子邮件在个人资料)，让我知道你的技术堆栈。我可能有一些线索。\n如果你活下来了，你将能够做很多你想做的事情。\n感谢你能做所有这些事。独立黑客并不容易。也不是每个人都适合。这就是为什么我们的员工从事他们喜欢的工作(朝九晚五)的原因。\n独立黑客不仅是为了赚钱，也是为了管理风险。风险在于没有死。\n成功的人都有多次投篮机会，但我们只看到成功的事件，而不是他们失败的事情。\n所有那些关于人们放弃一切去创办一家赚一吨钱的公司的故事通常会遗漏很多重要的信息。\n我建议你完全休息6个月，让一切恢复正常，然后只在晚上和周末继续工作。\n很遗憾听到这个人的消息！你的故事引起了我的共鸣，也引起了很多其他独立黑客的共鸣。\n我在多个副业上浪费了一年半的时间，都失败了。但我并不后悔，你知道为什么吗？因为建造、创造是我所热爱的。当我在做这些项目的时候，我是最开心的！\n你已经做出了一个正确的决定，暂时辞职，另找一份工作，过上一两年正常的生活，然后如果你愿意，也许你可以做些副业来娱乐一下！然后是盈利，这就是我现在正在做的事情。\n很遗憾听到这个消息，伙计。这绝对是一场艰苦的比赛，需要很大的运气。\n我同意宣传部分很艰难。我们中的许多人都只是建设者，喜欢创造东西，所以把我们的作品卖给别人的想法感觉是错误的，正如你所说的那样，因为判断而给我们带来了压力。\n我刚刚在Reddit上发布了我的应用程序，很快就被人否决了。那里甚至允许自我推销，但有人看到这篇帖子后想，不，不是今天。\n我希望你能重新开始尝试用较小的容量制作东西，作为一项兼职工作或仅仅是一种爱好！我做这件事只是一种爱好，我已经意识到我可能不能像这里的许多人那样全职做这件事。\n如果你把你的生命和所爱的人置于未知的危险之中，你就不应该去追求它。它们的重要性超过了所有独立黑客的总和。\n爱死这个了。我最近终止了一个我投入了两年的项目。只有杀了它，才能意识到这是多么错误--无论是作为一家企业，还是对我来说，作为一个人。\n尽管如此，它还是教会了我很多。像你一样，我只把精力放在产品上，而不是把精力放在宣传上。这一次，我从相反的方向开始。推销自己的产品；)。\n我祝你一如既往地走出V型复苏之路。很多时候，最大的胜利发生在巨大的损失之后。也许把你学到的东西用来做一个微型SaaS应用。听起来你似乎开始患上一些冒名顶替者综合症，因为在我看来，你完全有能力。我一直认为，某些类型的日记、目标设定或对抗冒名顶替者综合症的工具会非常酷。我们常常忘记自己有多有能力。这个社区的每个人来到这里或找到这个地方都是有原因的。\n我在自己身上看到了你的故事，可能在很多独立制作人身上，而且肯定有办法绕过它。你认为单打独斗是问题的一部分吗？如果有任何合作伙伴甚至顾问，会有什么不同吗？\n这话听起来很难，伙计！希望你能找到适合你的东西，享受这段旅程很重要！干杯，享受你的咖啡☕。\n何塞-很高兴你花时间分享了一篇简短的帖子，讲述了你为什么选择辞职。机会成本是个婊子。\n然而，你现在是查瓦尔，在推销自己，所以这是可行的。我失去了你的5倍，因为我投入了更多的时间，做出了更愚蠢的决定，给我的个人生活带来了更大的压力。你必须继续前进。\n你辞职是因为你损失了3.8万美元。不是因为你失败了。因为失败是成功的一部分。\n对于那些多次失败但仍然不想放弃并继续下去的人来说，这篇帖子是一种打击……表现出纯粹的毅力；现在他们放弃了。对于那些做得非常好的人来说，这也是一种动力。该死的！\n很遗憾听到这个消息。你在这一年里学到了很多东西，所以可能过一段时间你还可以再试一次。\n那是什么？你认为失败的主要原因是什么？\n老实说，我不同意这一点。成功意味着总是做A/B测试，检查不同的假设。一如既往地做同样的事情并不能带来成功。\n听到这个消息我很难过。看来你是一个非常多产的产品创造者。没有多少人能生产出像你今年这么多的产品。你损失的钱是直接投资于你的项目，还是你在以前的工作中可以得到的钱？\n听到那家伙的话我很难过！当然，这是一种艰难的谋生方式。\n很遗憾听到这个消息，兄弟。这很艰难。而你对赚60美元比赚0美元更糟糕的感觉如坐针毡。去过了，做过了，拿到T恤了！", "note_en": "Around a year ago I left my job as a Developer Advocate to bootstrap a company.\n I had around $12K in savings. Enough to cover a year of expenses and a bit more. I stopped spending money on almost everything.\n How hard could that be, right? I create something, find 10-20 clients, and done. I&#39;ll make $1K per month and from there grow it to $20K MRR. No problem.\n Well. It didn&#39;t work that way. You all know that. I didn&#39;t. I was naive and I think I am not the only one who thinks like that.\n News? Success stories? Books on self-help? podcasts? Guilt it of all of that. I thought I was smart enough. If other could do it... me? Even better.\n Well. I am broke now. I hate the projects I created. I hate that I spent all my money and didn&#39;t make a dollar (well I made around $60, which is even more painful than $0) not from my projects, not from a client or a company.\n So the real cost is more than the money I lost. I made my girlfriend stay home for a year, we didn&#39;t do anything, we didn&#39;t buy clothes and ate the cheapest food, etc. I feel that I have lost a year of my life.\n I got much more from the articles that I wrote here on Indie Hackers than from any of my projects. And I did those in a couple of hours.\n   All the time I think people are going to hate me, tell me that I am an idiot, a con maker, that my ideas are terrible, that I suck.\n   I always wanted to write more. I love it. But I felt that I couldn&#39;t write if I wasn&#39;t successful. But I guess there are no rules.\n So if you like my writing, please, give me a happy moment and buy me a coffee, or two:  https://www.buymeacoffee.com/jrleonr.\n  I feel this. It&#39;s totally ok to quit, and honestly I feel like we should normalize quitting things more.\n Tenacity and grind are a huge part of success, but if you believe &#34;running a business is a marathon not a sprint&#34;, then we need to accept everyone has a different pace and stamina for doing so, just like running a marathon. I say &#34;we&#34; meaning us as individuals, not so much the community. From my experience, a big part of indie hacking is knowing yourself and being able to set healthy boundaries.\n Also, few things in life are forever. If you throw up your hands and quit now, it doesn&#39;t mean you can&#39;t come back and revisit it in the future. But you have do what&#39;s right for you. Take care!\n  This is so real and I can tell it’s filled with so much passion. Unfortunately this story is common among many IndieHackers out there. It takes a real mature person to admit defeat and realize when entrepreneurship isn’t suited for them.\n This topic isn’t brought up enough on this forum. As a community we celebrate things like $200 MRR, which is impressive at times, but it doesn’t pay the bills and won’t help you take the leap of faith to truly be bootstrapped.\n Do you mind sharing what you think you could have changed if you started over? I, and I’m sure other IndieHackers out there, would love to know.\n Thanks for sharing this because this truly hits home for me. I thought about quitting so many times, but small hints of success pushed me through. At times, those hints of success were actually mirages and I’m sure you ran into those too.\n Bootstrapping is HARD. My first two years, I walked dogs to pay my rent and maxed out my credit cards on developer spend.\n  Did same. Better to build business on the side while continuing to work. Much lower risk. Adjust and try again.\n  I am a game developer. I got fired April 2018. I used to make $3500 a month. I have made around 7000$ dollars in the last 2.5 years mostly all of it from freelancing. All my games flopped. I live with my parents and feel the same about the lost time as you. I don&#39;t know the purpose of this comment but I just wanted to share.\n  Do what you love. It doesn&#39;t matter if you achieve your &#39;dreams&#39; of being an Indiehacker maker if they come at the cost of complete anxiety. You love to write, and you are obviously exceptional at it. Do what you love.\n Take the good from this year. You&#39;ve probably learnt more than you ever will in a single year of your life, you&#39;re one step closer to what you really want in life, and you tested your personal realtionship with your loves ones and yourself more than you ever thought you could. If you&#39;ve made it through this year, you can make it through any other.\n Good luck in the rest of your life, I hope to see you within the IH circles again (writing, not making).\n  👆🏻 — you nailed it. there are no rules to this. you make them up as you go along.\n  he was sent to prison. but the observation &#34;he has suffered evil,&#34; is an addition coming from you.\n  malcomx went to prison a criminal but left as an educated, motivated, and deeply religious man towards civil rights.\n  Your story is humbling. It is a much needed reality check for those of us still testing the waters.\n It also got lots of veterans to share their less than glamorous experiences, so thank you for sharing it.\n On the bright side, you’ve learnt some very expensive lessons on IH and still enjoy writing ... perhaps collect your thoughts and take some time to document your mistakes, things you could have done differently etc then publish it as an ebook  Pitfalls: Things to avoid as a bootstrapped founder?\n  This. Thanks for writing this. I started getting anxiety and even bowel problem since I decided to be an &#39;indie maker&#39; a few months ago. I spent £3,000 and earned £2 from... Medium.\n There&#39;s a saying that &#34;it&#39;s better to love and get hurt rather than never loved at all&#34; - I believe that it&#39;s also the case here. You tried. You gave it your best shot. As you said in one of your comments, it requires braveness to quit. Good luck for your future endeavour, buddy!\n  If it helps you feel any better, you should know that anxiety over marketing and pushing the business side of entrepreneurship in general is very common.\n I think if you look at most personality diagrams that side is on the opposite of being analytical, so that&#39;s kind of to be expected.\n Maybe it&#39;s an opportune time to do exactly what you&#39;re thinking about doing, work for the man for a while, earn some self-confidence back and improve the financial side of things.\n If you do decide to give it another ago, maybe you should consider co-founding with some of these super-extroverted, overly confident, charismatic sales guys/girls? That way you wouldn&#39;t need to deal with the anxiety you feel when pushing the ideas/products to other people and could just enjoy creating.\n All the best to you Jose, get better and thanks a bunch for this courageous post!\n  Also, i think everyone struggles with fearing what others think. Recognizing that it&#39;s normal is a healthy way to start overcoming it.\n  Hey Josè, really sorry to read this. I could tell you that you probably learned a lot of useful things during this year but I know it&#39;s not going to make you feel better.\n I think the lesson for other Indie Hackers (me included) here would be don&#39;t quit your job until you have a side project that starts getting some traction.\n  Hey, I could say I am sorry to hear this, but the reality is that your story is true to so many people, it&#39;s more of a norm than an outlier. Some people get lucky and find the gem on their first try, many give up along the way, and a few more eventually figure it out and get profitable.\n As you talk to successful founders you realize that even many billion-dollar success stories were on a brink of death at least once, and often numerous times.\n The good news is that you will disconnect for a while, process, and realize how valuable this year has been to your life. It probably looks like a waste right now, but you will eventually start to appreciate it. You might even try it again sometimes, maybe even sooner than you think.\n Also, if you are game to do some part time projects, can you email me (email in profile) and let me know your tech stack. I might have some leads.\n  If you survived, you will be able to do lot of things that you want to do.\n Just be grateful that you got to do all these things. Indie Hacking is not easy. Also not for everyone. That&#39;s why we have people who work at jobs (9-5) they are comfortable with.\n Indie Hacking is not only about earning money, but also managing the risk. The risk is being not dead.\n  People who have been successful, had multiple shots equally, but we only see the successful events, not what they have failed at.\n  All those stories about people dropping everything to start a company that makes a tonne of money usually miss out a lot of important info.\n  I&#39;d suggest taking 6 months off this totally to get things back in order then resume on evenings and weekends only.\n  Sorry to hear this man! your story resonates a lot with me, and with a lot of other indie hackers.\n I lost a year and a half working on multiple side projects, all have failed. But I don&#39;t regret it, you know why? because building, creating is what I love. I was the happiest ever when I was working on those projects!\n You have made a good decision to quit for now, find another job, live a &#34;normal&#34; life for a year or two, then maybe if you want, you can work on side projects for fun! and then profit, that&#39;s what i&#39;m doing right now.\n  Sorry to hear that, dude. It&#39;s definitely a tough racket and requires a lot of luck.\n I agree that promo part is tough. Many of us are just builders and love creating things, so the idea of selling our work to others feels wrong and like you indicated, stresses us because of judgment.\n I just posted my app on reddit somewhere and immediately someone just downvoted it. Self-promotion is even allowed there, but somebody saw the post and thought, nah, not today.\n I hope you can get back to trying to make things in a smaller capacity as a side gig or just a hobby! I&#39;m doing it as just a hobby and already realizing that I probably couldn&#39;t do it full-time like a lot of folks here.\n  If you are putting your life and loved ones at the risk of the unknown, you shouldn’t pursue it. They are important than all of indie hacking combined.\n  Love this. I recently killed a project I put 2 years into. It took killing it to see how wrong it was - as a business and for me as a person.\n It taught me a lot tho. Like you, I put effort only into product and zero into promoting it. This time I’m starting the other way around. A product that markets itself ;)\n  I wish you nothing less than a v-shaped recovery. Often times, the greatest wins come after tremendous losses. Maybe take what you learned and use it to fuel a micro-saas app. It sounds like you are starting to regress to a bit of &#34;impostor&#39;s syndrome&#34; because in my opinion, you are fully capable. I always thought some types of journal or goal-setting or tool for fighting impostor syndrome would be extremely cool. We often forget how capable we are. Everybody in this community is here or found this place for a reason.\n  I see your story in myself, probably in a lot of indie makers, and there&#39;s gotta be ways around it. Do you think working on it alone was part of the problem? if there were any partners or even advisors, would it make a difference?\n  That&#39;s tough to hear man! Hope you will find something that works for you, it&#39;s important to enjoy the ride! Cheers and enjoy your coffee ☕\n  Jose - glad you took the time to share a brief post on why you&#39;re choosing to quit. Opportunity cost is a bitch.\n  And yet here you are chaval, promoting yourself, so it&#39;s doable. I lost 5X what you lost with more time invested, more stupid decistions made and more strain on my personal life. You have to keep going.\n  You quit because you lost &gt; $38k. Not because you failed. Because failure is the part of the success.\n  This post is a demotivation for those who failed multiple times but still don&#39;t want to give up and continue again.....showing the pure perserverance; and now they quit. And a motivation for those who are doing extremely good. Damn!!!!\n  Sorry to hear this. You learned so much during this year so probably after some time you can try again.\n  What is that? What do you think is the main reason of not being successful?\n  I wouldn&#39;t agree on that to be honest. Being successful means always do A/B testing and checking different hypothesises. Doing the same all time is not leading to success.\n  I am sorry to hear this. It seems you are a very prolific product creator. Not many can make as many products as you did this year. Was the money you lost due to direct investments in your projects or the money you could have got while working in your previous job?\n  Sorry to hear that dude! It&#39;s a hard way to earn a living for sure.\n  Sorry to hear this, brother. It  is tough. And you&#39;re spot on about that feeling of making $60 being worse than $0. Been there, done that, got the t-shirt!", "posttime": "2020-11-16 04:56:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,独立,savings", "title": "在失去了作为独立黑客的积蓄之后，我再也做不下去了。我不干了。", "title_en": "After losing my savings as an indie hacker, I can't do it anymore. I quit.", "transed": 1, "url": "https://www.indiehackers.com/post/after-losing-38676-as-an-indie-hacker-i-cant-do-it-anymore-i-quit-8673223598", "via": "", "real_tags": ["黑客", "独立", "savings"]}, {"category": "", "categoryclass": "", "imagename": "bf920f68d45fc794a6ba9c8e74eec81e.jpeg", "infoid": 1035327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当北卡罗来纳州农工大学(North Carolina A&amp；T State University)大三学生阿里尔·G·布朗(Arielle G.Brown)在9月份参加国际营销考试时，一个作弊检测程序一直通过电脑网络摄像头分析她的行为。测试结束后，她的副教授发了一封愤怒的电子邮件，猛烈抨击她所在的班级，指责该软件标记出的一些“负面行为”。\n她写道：“一名学生在6分钟内做了776次头部和眼球运动，”她后来又补充道，“我不想把你写进去。”\n但布朗和她的同学们并不打算对作弊这一站不住脚的指控坐视不管。他们很快启动了群聊--一名学生写道：“我们(应该)怎么控制我们的眼睛？”布朗在推特上分享了这封电子邮件，很快就引起了管理员的注意，并获得了10万多个“赞”。\n她在一次采访中说：“这感觉太咄咄逼人了。”“在真正的课堂上，人们不会三思而后行的东西正被用来对付我们。”(教官和学校官员没有回复记者的置评请求。)。\n“在线监督”公司从冠状病毒的关闭中看到了一个机会，可以从一次重大的教育改革中获利，向学校出售一种高科技产品，其中包括监控网络摄像头的工人和旨在捕捉学生考试作弊的眼球跟踪软件。\n近几个月来，他们从数千所大学获得了数百万美元，其中一些是公共资金。但这也引发了全国范围内的学校监督抗议，学生们举行抗议，并采取创造性的策略，迫使校园管理人员重新考虑这些交易。\n学生们争辩说，考试系统让他们不敢点击太多，也不敢让眼睛休息，因为他们害怕被贴上作弊的标签。一些学生还说，他们曾因压力而哭泣或在课桌前小便，因为他们被禁止离开屏幕。\n一个名为Proctorio的系统使用凝视检测、面部检测和计算机监控软件来标记学生的任何“异常”头部移动、鼠标移动、眼睛游移、计算机窗口大小调整、选项卡打开、滚动、点击、打字以及复制和粘贴。学生可能会因为完成考试太快或太慢、点击太多或不够而被扣分。\n如果摄像机在背景中看到其他人，学生可能会被标记为“检测到多个人脸”。如果其他人在同一个网络上--比如在宿舍楼里--参加考试，那就是潜在的“考试串通”。房间太吵了，网络太乱了，相机坏了吗？旗帜，旗帜，旗帜。\n冠状病毒之后的大规模学校停课正在推动新一波学生监控浪潮，因为秋季学期异常中断，即将迎来期末考试，这场学生叛乱已经爆发为网络战争，诉讼、撤职和病毒斗殴进一步动摇了引发焦虑的大学考试背景。一些学生甚至试图从内部撤下这款软件，挖掘代码，了解它如何监控数百万场高风险的考试的细节。\n这种紧张关系引发了关于美国向在线教育的危险转变的更深层次的辩论。阻止几个作弊者是否值得像对待骗子一样对待每一个学生？考虑到那些生活已经翻天覆地的学生承受的额外压力，这些考试到底有多重要？\n杰西·斯托梅尔(Jesse Stommel)有20年的教学经验，也是学术期刊“混合教育学”的创始人，该杂志今年夏天公开与普罗科托里奥的校长发生了争执。斯托梅尔说，他收到了大量来自学生的情绪信息，“谈论着学生们围绕这件事所经历的痛苦、焦虑、恐惧和担忧。”\n他们中的大多数人已经从传统的考试变成了高压视频考试，在视频考试中，他们的一举一动都受到了仔细的审查。他说，难怪他们在反击。他说，该软件的核心是“向学生传达的最明确的价值是‘我们不信任你’。”\n这些名为ProctorU、Respondus和Honorlock的公司宣传了一系列抓作弊的技术，这些技术可以锁定学生的网络浏览器，跟踪他们的电脑活动，或者将他们的麦克风和网络摄像头连接到付费观看学生考试的大型“监考”呼叫中心。一些公司还提供人工智能软件，用于发现潜在的可疑行为，包括用于验证考生身份的面部扫描仪，以及在考生在屏幕外看得太久时可以标记的眼睛传感器。\n这些公司表示，他们的系统可以嗅到学生游戏测试中许多有创意的方式，比如看墙上的笔记，从其他网站抄袭，或者听朋友大声说出答案。对于普罗科托里奥来说，任何这些“行为标志”--或者任何一个学生与班上其他人不同的行为，都被称为“异常”--都会提高学生的“怀疑水平”，而学生是不被允许看到这一点的。\n在对14名学生的采访中，他们中的许多人表示，系统还会标记他们许多无害的小动作，比如当他们草草记下笔记、大声朗读问题或将目光移开思考时。虽然教授可以改变哪些学生的行为受到监控，并忽略系统的调查结果，但这并不能保证。为了保护自己的诚信，学生们可能不得不证明这位高科技作弊侦探不知何故搞错了。\n一些学生说，让陌生人和算法默默地判断他们的行动的经历令人深感不安，许多人担心，即使被指控作弊，也可能危及他们获得好成绩、奖学金、实习机会和毕业后职业生涯的机会。\n孩子们过去很喜欢屏幕时间。然后学校要求全天强制使用Zoom。几名学生说，他们曾希望能自由地度过充满朋友的大学时光，但现在他们听天由命，只能在儿时的卧室里进行长达数小时的监控视频考试，而且看不到明显的结束的迹象。\n“你知道在高中的时候，当你在做考试时，老师会在你身后走来走去，偷偷地看着你吗？”一名学生说，他和其他人一样，为了避免学术上的反响而要求匿名。“你在那10秒钟里感到的焦虑吗？”…。这基本上就是我们所有人“每时每刻”的感受。\n另一位网友说：感觉就像是“有人在看着我发疯。”\n公司高管表示，如果一个学期没有监督员，在线考试将变成一片无法无天的荒地。ProctorU与全球1200多所学校合作，其首席执行官斯科特·麦克法兰(Scott McFarland)指出，该公司过去一年的数据显示，在100多万个受监控的考试中，该系统捕捉到了“非法资源”或引发了“积极干预”，监考人员跳出来实时处理潜在的作弊行为。他补充说，该系统已经标记了24.7万份“已确认的诚信违规行为”，约占其390万份监考考试的6%。\n普罗科托里奥的首席执行官迈克·奥尔森(Mike Olsen)预计，今年将监督1000多所学校的2500万多场考试。普罗科托里奥向一些学校收取了大约50万美元的一年服务费。他说，如果不在疫情期间采取反作弊措施，学生的大学成绩将永远受损--他所说的“日冕文凭”，未来的雇主可能会发现“不那么可信”。\n经理们求助于监控软件，即始终在线的网络摄像头，以确保员工(真的)在家工作，但这些系统的技术要求使得仅仅参加考试就变得几乎滑稽地复杂。安大略省威尔弗里德·劳里埃大学(Wilfrid Laurier University)的一名学生分享了他在网上介绍线性代数期中考试的说明：五页，总计2000多字，要求学生使用一种特殊的活动监控网络浏览器，并始终将脸、手和桌子放在相机的视线上。\n首先，学生们必须进行一次“环境扫描”，将他们可能在考试中使用的所有东西，包括计算器和任何废纸，每个人举在摄像头前3秒钟。他们还必须放置一面镜子以反射回摄像头，以证明屏幕上没有任何东西；镜子本身也必须进行扫描。\n任何想上厕所的学生都必须先对着麦克风大喊：‘我要去洗手间，很快就会回来的，’“指南写道。违反规定或面临技术困难的学生可能会因学术不端行为而受到调查。\n“比起考试本身，”这名学生说，“这些指示让我更加焦虑。”\n由于害怕触发系统警报，学生们以令人不安的方式扭曲了自己。皮肤黝黑的学生用明亮的灯光照射他们的脸，担心系统无法识别他们。其他学生则求助于扔进垃圾桶。\n上个月参加了纽约州第一次在线律师考试的一些法律系学生说，他们曾在椅子上小便，因为他们不能离开电脑。这是一项由ExamSoft公司监考的90分钟的在线律师考试。这两名纽约州议员正在推动改变疫情期间新律师执照的相关规定，这两名议员进行的一项调查显示，这些学生表示，他们曾在椅子上小便，因为他们不被允许离开电脑。\n一位自称用过金属壶的受访者写道：“我大声告诉录音，我要尿尿…。为了不违反规定，我不得不和相机保持眼神接触。这是非常尴尬和羞辱的。现在有个不知名的监考老师拍到了我在考试时撒尿的视频。“。\n州参议员布拉德·霍尔曼(Brad Hoylman)和国会议员乔·安妮·西蒙(Jo Anne Simon)谴责这项测试“严重缺乏正当性”，并表示还有数百人面临技术故障。ExamSoft发言人妮琪·桑德伯格表示，虽然远离镜头可能会构成对“诚信的破坏”，但所有考生都提前被告知了“考试的形式和参数”。\n一些学生说，他们担心自己的行动或需求超出了自己的控制范围，可能会被贴上可疑的标签。在全国残疾法律学生协会今年夏天的一项调查中，数百人表示，他们担心自己会因为残疾而受到惩罚，其中一人称这是“我一生中最重要的一次考试”。\n“如果我们被贴上作弊的标签，”一位受访者说，“我们还不如和我们的驾照吻别。”\n其他人则表示，他们担心这些系统会加深数字鸿沟，因为只有拥有完美的互联网连接、隐蔽的工作空间和合适的科技设备的学生才能通过该系统的完整性测试。\n最新的危机：今年秋天，低收入家庭的学生辍学人数惊人，萨克拉门托城市学院(Sacramento City College)的护理专业学生萨拉·塞克(Sarah Seyk)今年早些时候尽了最大努力准备一场由普罗科托里奥(Proctorio)监控的竞争性考试。在养老院新冠肺炎病房轮班的间隙，她征用了家里最安静的房间，也就是她妹妹的房间，举着笔记本相机四处走动，以证明这个空间是干净的，没有作弊。\n然而，一旦测试开始，她就被踢了三次，她将部分原因归咎于她在陷入思考时倾向于把目光投向屏幕外。每一次，她都不得不崇敬自己的身份和周围环境的神圣性，燃烧着至关重要的时间。\nProctorio的奥尔森说，只有当学生的互联网连接中断超过2分钟，或者他们试图打开未经授权的程序时，考试才会终止。他补充说，该公司建议管理人员在疫情期间对学生表现出“更多的同情心”。\n“我不想让我的眼睛移动太多。我不想写太多东西。我只是歇斯底里地抽泣。“塞克说。“我可怜的小妹妹一直想进房间，但你不能让任何人进来。”\n越来越多的学生转向网络，通过录制催泪的TikTok视频，在“Procteario”和“ProcThreat U”等Twitter账户上记录他们的恐怖故事，来突出他们对持续监视下的考试的愤怒。他们还在网上对允许虚拟陌生人进入他们家的可怕风险表示同情，并表达了对他们的监管者是否会在考试后在社交媒体上追踪到他们的担忧。(一名学生说，她的学监一直叫她“甜心”。)。\n但他们也试图更深入地挖掘这项技术本身。今年9月，俄亥俄州迈阿密大学(Miami University)18岁的工科学生埃里克·约翰逊(Erik Johnson)说，他仔细查看了Proctorio保存在用户电脑上的文件，因为他想了解该公司是如何保护学生数据安全的。\n他在一系列推文中分享了他的发现-质疑该系统对学生电脑的监控和访问的深度-并对该大学的领导层进行了标记。他写道：“如果大学和你们的教授不知道这些事情，改变是不会发生的。”\n他惊讶地看到，该公司反击的速度如此之快，推动Twitter和其他网站删除了约翰逊的帖子。他补充说，普罗科托里奥还屏蔽了他的互联网协议地址，这可能会阻止他在未来的考试中使用该地址，他称这是一种“荒谬的”报复行为。\nProctorio的奥尔森表示，约翰逊对该系统做出了错误的假设，违反了公司的规定和版权。奥尔森说，如果约翰逊或该大学指定约翰逊的IP地址，他愿意撤销这项禁令，他说这项禁令是软件自动触发的。校方没有回复记者的置评请求。\n这并不是普罗科托里奥第一次对批评者做出有力回应。今年6月，奥尔森对不列颠哥伦比亚大学的一名学生发起了一次不同寻常的直言不讳的攻击，他在大学Reddit的一个帖子上发布了客户支持聊天日志，他说这与这名学生的抱怨相矛盾：“如果你要撒谎，兄弟…。当公司清楚地掌握了你们谈话的完整记录时，不要这么做。“他写道。\n但最激烈的小规模冲突可能会在法庭上做出决定。今年8月，UBC学习技术专家伊恩·林克利特(Ian Linklett)在推特上发布了Proctorio培训视频的链接，向教职员工展示了如何观看学生的网络摄像头镜头-他说，这清楚地证明了“使用这项技术对学生造成的情感伤害”。YouTube上的视频只有有链接的人才能看到，但LinkLetter的推文基本上向公众开放了它们。\nProctorio很快停用了这些链接，称这些视频是“保密和专有的”，并在一周后对LinkLetter提起诉讼，要求赔偿其侵犯版权和“背信弃义”的行为。\nLinkLetter的律师辩称，分享互联网上已有视频的链接并不违法。但LinkLetter说，这起诉讼的潜在信息是试图恐吓其他批评者，让他们不敢直言不讳。\n他在一次采访中说：“我们所有人都有权讨论这种学术监控软件是否符合道德标准。”在为自己的法律辩护筹款时，LinkLetter称这是一场“为未来而战”，并说：“你能想象被起诉发8条推特的情景吗？”\n奥尔森说，这些视频被嵌入了一个受密码保护的教职员工帮助中心，他辩称，提交法庭文件的目的是保护公司的知识产权，而不是压制批评。奥尔森说：“我们对他的钱不感兴趣。”“如果我们想要得到他的工作，我们早就去上大学了。”\n校规随着在线学习进入了新的领域，监管公司声称他们是学生成功和隐私的捍卫者，但许多学生并不信服。数以千计的大学生在加利福尼亚州、科罗拉多州、佛罗里达州、马萨诸塞州、纽约州、俄亥俄州、德克萨斯州、威斯康星州和华盛顿州签署了取消在线Proctor交易的请愿书。其他人则组织了致信管理人员的活动，辩称这项技术太具侵入性，无法支持。\n学生们还指出，这些公司的个人视频数据宝藏是网络攻击的一个主要漏洞。今年7月，黑客公布了从ProctorU窃取的40多万条记录，包括姓名、密码和家庭地址。ProctorU表示，自那以来，它已经启用了新的安全措施。\nProctorTrack是一家宣传“世界上最先进的远程在线监考解决方案”的公司。该公司表示，它通过面部扫描或“指节扫描”来验证学生的身份。上个月，在黑客泄露其源代码并发送似乎来自官方账户的攻击性电子邮件后，ProctorTrack的母公司关闭了这项服务8天。\n这家名为Verificient Technologies的公司表示道歉，并表示没有个人数据被获取。(两个月前，麻省理工学院(Massachusetts Institute Of Technology)的学生在请愿书中提出了对系统遭受攻击的担忧。)。\n大学正在将学生的手机变成监控机器，追踪数十万名学生的位置。几名学生表示，他们预计这些系统将在学校停课后很长一段时间内塑造大学体验。在4月份接受非营利组织Education ause调查的高等教育机构中，近60%的人表示，他们正在或正在考虑在考试期间使用或考虑对学生进行被动视频监控。\n但美国教育界的一些人对这一制度的潜在风险表示不安。包括加州大学伯克利分校(University Of California At Berkeley)在内的几所学校，出于隐私和可访问性的考虑，已经禁止了在线监督。\n美国大学理事会的一名官员告诉《华盛顿邮报》，负责SAT大学招生考试的大学理事会原本计划改用在线监督考试，但由于担心需要三个小时不间断的流媒体视频质量的互联网，该计划被叫停了，这是许多学生无法保证的。官员们还担心给学生带来巨大的新负担，这些学生并不完全缺乏外部压力。\nProctorio的奥尔森为该公司辩护，称该公司是学术不诚实违规行为的早期预警系统，他说，应该由讲师审查这些旗帜，并以适当的方式惩罚或回应。然而，他确实表示，“如今很多教职员工反应过度”，例如，要求学生只在高度受控的地区参加考试，尽管疫情已经颠覆了他们的生活。\n大学生如何充分利用远程学习，他也批评学生的反弹是被误导的--他在6月份说，“学生假装关心他们的数据到哪里去，这太搞笑了”--而且很大程度上是基于对这项服务运作方式的“反胃”批评。他说，大多数学生只要习惯就行了：“大学压力很大。…。压力一直都很大。“。\n像俄亥俄州立大学(Ohio State University)大四学生麦迪逊·特雷西(Madison Tracy)这样的学生已经参加了18次普罗科托里奥(Proctorio)监控考试，他认为这些公司的监控或混乱的论点是错误的选择。她说，问题不在于作弊，而在于考试。课堂上可以提供更具原创性的提示、创造性的即兴创作和批判性思维的考试，而不是为监考软件而设计的闭门造车的、容易在谷歌上搜索的记忆练习--不需要网络摄像头的监督。\n特蕾西的一些教授已经走上了这条路，她说，考试让她感觉同样充满挑战，远没有那么不知所措。但目前，患有注意力缺陷/多动障碍的特蕾西说，她必须在每次有人监督的测试之前提醒自己，她通常用来重新聚焦的一些小技巧--比如伸展双臂或把目光移开--可能会被标记为潜在的有毒行为。\n“我一半的大脑都在专注于不搞砸，不做错事，不做错事，…。”而另一半则在努力准备考试。“特蕾西说。“我见过这么多学生说，‘我可以在镜头前哭吗？’的表情包。”这件事能走多远？“。\n如果您通过本文中推荐的链接购买产品，Microsoft可能会获得会员佣金。", "note_en": "When North Carolina A&amp;T State University junior Arielle G. Brown took her International Marketing exam in September, a cheating-detection program analyzed her behavior through a computer webcam the entire time. After the test, her associate professor fired off a  furious email ripping into her class for some “negative behavior” the software had flagged.\n       “A STUDENT IN 6 MINUTES HAD 776 HEAD AND EYE MOVEMENTS,” she wrote, adding later, “I would hate to have to write you up.”\n   But Brown and her classmates weren’t about to take the shaky accusations of cheating lying down. They quickly lit up a group chat — “How the hell are we [supposed] to control our eyes,” one student wrote — and Brown shared the email in a  tweet that quickly got administrators’ attention, as well as more than 100,000 “likes.”\n “It just felt so aggressive,” she said in an interview. “Stuff that people wouldn’t think twice about in a real classroom was being used against us.” (The instructor and school officials did not respond to requests for comment.)\n “Online proctoring” companies saw in coronavirus shutdowns a chance to capitalize on a major reshaping of education, selling schools a high-tech blend of webcam-watching workers and eye-tracking software designed to catch students cheating on their exams.\n They’ve taken in millions of dollars, some of it public money, from thousands of colleges in recent months. But they’ve also sparked a nationwide school-surveillance revolt, with students staging protests and adopting creative tactics to push campus administrators to reconsider the deals.\n Students argue that the testing systems have made them afraid to click too much or rest their eyes for fear they’ll be branded as cheats. Some students also said they’ve wept with stress or urinated at their desks because they were forbidden from leaving their screens.\n One system, Proctorio, uses gaze-detection, face-detection and computer-monitoring software to flag students for any “abnormal” head movement, mouse movement, eye wandering, computer window resizing, tab opening, scrolling, clicking, typing, and copies and pastes. A student can be flagged for finishing the test too quickly, or too slowly, clicking too much, or not enough.\n If the camera sees someone else in the background, a student can be flagged for having “multiple faces detected.” If someone else takes the test on the same network — say, in a dorm building — it’s potential “exam collusion.” Room too noisy, Internet too spotty, camera on the fritz? Flag, flag, flag.\nMass school closures in the wake of the coronavirus are driving a new wave of student surveillance As an unusually disrupted fall semester churns toward finals, this student rebellion has erupted into online war, with lawsuits, takedowns and viral brawls further shaking the anxiety-inducing backdrop of college exams. Some students have even tried to take the software down from the inside, digging through the code for details on how it monitors millions of high-stakes exams.\n The tension has sparked deeper debates about America’s breakneck shift toward education online. Is stopping a few cheaters worth the price of treating every student like a fraud? And how important are any of these tests, really, given the extra stress on students whose lives have already been turned inside out?\n Jesse Stommel, a 20-year teacher and founder of an academic journal,  Hybrid Pedagogy, that publicly sparred with Proctorio’s chief this summer, said he’s been flooded with emotional messages from students “talking about the pain, the anxiety, the fear, the worry the students are experiencing around this.”\n Most of them have gone from traditional tests to high-pressure video exams in which their every move is scrutinized. It’s no wonder, he said, that they’re fighting back. At the software’s core, he said, “the most clear value conveyed to students is ‘We don’t trust you.’ ”\n  The companies, with names like  ProctorU,  Respondus and  Honorlock, advertise a wide range of cheater-nabbing tech that can lock down students’ Web browsers, track their computer activity or connect their microphones and webcams to large call centers of “proctors” paid to watch the students take their tests. Some companies also offer artificial-intelligence software for spotting potentially suspect behavior, including face scanners to verify a test-taker’s identity and eye sensors to flag if they’re looking too long off-screen.\n The companies say their systems can sniff out many of the inventive ways students game tests, such as looking at wall-mounted notes, copying from other websites or listening to a friend say the answers out loud. With Proctorio, any of these “behavior flags” — or anything a student does differently from the rest of the class, known as an “abnormality” — can raise a student’s “suspicion level,” which the students aren’t allowed to see.\n In interviews with 14 students, many of them said the systems also flagged them for lots of harmless little movements, such as when they jot down notes or read the questions aloud or look away to think. Though professors can change which student behaviors are monitored and ignore the systems’ findings, nothing is guaranteed. And to defend their integrity, the students may have to prove the high-tech cheating detective somehow got it wrong.\n Some students said the experience of having strangers and algorithms silently judge their movements was deeply unnerving, and many worried that even being accused of cheating could endanger their chances at good grades, scholarships, internships and post-graduation careers.\nKids used to love screen time. Then schools made Zoom mandatory all day long. Several students said they had hoped for freeing, friend-filled college years but were now resigned to hours of monitored video exams in their childhood bedrooms, with no clear end in sight.\n “You know how in high school, when you’d be doing a test and a teacher would walk around and peer over your shoulder?” said one student, who, like others, spoke on the condition of anonymity to avoid academic repercussions. “That anxiety you feel for those 10 seconds? … That’s how basically all of us feel” all the time.\n Said another: It felt like “somebody was watching me just lose my mind.”\n Company executives say a semester without proctors would turn online testing into a lawless wasteland. Scott McFarland, the chief executive of ProctorU, which works with more than 1,200 schools worldwide, pointed to  company data from over the past year saying the system had caught “unpermitted resources” or triggered an “active intervention,” with a proctor jumping in to address potential cheating in real time, in more than a million monitored tests. The system, he added, had flagged 247,000 “confirmed breaches of integrity” — or about 6 percent of their 3.9 million proctored exams.\n Mike Olsen, the chief executive of Proctorio, which has charged some schools roughly $500,000 for a year of service, expects to monitor more than 25 million exams across more than 1,000 schools this year. He said that without anti-cheating measures in place during the pandemic, students’ college accomplishments would be forever tarnished — a “corona diploma,” as he called it, that future employers might find “not as credible.”\nManagers turn to surveillance software, always-on webcams to ensure employees are (really) working from home But the systems’ technical demands have made just taking the tests almost comically complicated. One student at  Wilfrid Laurier University in Ontario shared the instructions for his online Introduction to Linear Algebra midterm: five pages, totaling more than 2,000 words, requiring students to use a special activity-monitoring Web browser and keep their face, hands and desk in view of their camera at all times.\n To start, students must conduct an “environmental scan” by holding up everything they might use for their test, including their calculator and any scrap paper, in front of the webcam for three seconds each. They must also position a mirror to reflect back at the webcam to prove nothing is attached to the screen; the mirror itself must also be scanned.\n Any student wanting to go to the bathroom must first “shout into the microphone: ‘I need to go to the washroom and will come back quickly,’ ” the guide states. Students who break the rules or face technical difficulties can be investigated for academic misconduct.\n “The instructions,” the student said, “are giving me more anxiety than the test itself.”\n  Fear of setting off the systems’ alarms has led students to contort themselves in unsettling ways. Students with dark skin have  shined bright lights at their face, worrying the systems wouldn’t recognize them. Other students have resorted to  throwing up in trash cans.\n Some law students who took New York’s first online bar exam last month, a 90-minute test proctored by the company  ExamSoft, said they had urinated in their chairs because they weren’t allowed to leave their computers, according to a  survey by two New York state lawmakers pushing to change the rules for licensing new attorneys during the pandemic.\n One respondent who said they had used a metal pot wrote, “I informed the recording by speaking aloud that I had to pee … I had to keep eye contact with my camera in order to not violate the rules. It was extremely embarrassing and humiliating. Now some faceless [proctor] has video of me peeing while taking the exam.”\n The lawmakers, State Sen. Brad Hoylman and Assemblymember Jo Anne Simon, decried the test’s “profound lack of decency” and said hundreds of others faced technical glitches. ExamSoft spokeswoman Nici Sandberg said that, while stepping away from the camera could have constituted an “integrity breach,” all test-takers had been told of “the format and parameters of the exams well ahead of time.”\n Some students said they fear they could be labeled suspect for movements or needs beyond their control. In a  survey this summer by the  National Disabled Law Students Association, hundreds said they worried they would be punished for their disability during what one called “the most important exam of my life.”\n “If we get flagged as cheaters,” one respondent said, “we might as well kiss our licenses goodbye.”\n Others said they worried these systems would deepen the digital divide, because only students with a flawless Internet connection, secluded workspace and the right tech gadgets can pass the system’s integrity tests.\nThe latest crisis: Low-income students are dropping out of college this fall in alarming numbers Sarah Seyk, a nursing student at Sacramento City College, tried her best earlier this year to prepare for a competitive Proctorio-monitored exam. Between shifts in a covid-19 unit at a nursing home, she commandeered the quietest room in the house, her little sister’s, and walked around holding up her laptop camera to prove the space was clean and cheating-free.\n Once the test started, though, she was kicked out three times, which she partially blames on her tendency of looking off-screen when lost in thought. Each time, she had to reverify her identity and the sanctity of her surroundings, burning vital time.\n Proctorio’s Olsen said the exam only terminates if a student’s Internet access drops for more than 2 minutes or if they try to open an unauthorized program. The company, he added, recommends administrators show “increased empathy” for students during the pandemic.\n “I didn’t want to move my eyes too much. I didn’t want to be writing too much. I was just full-on hysterically sobbing,” Seyk said. “My poor little sister kept trying to come in the room, but you’re not allowed to let anyone in.”\n  Students have increasingly turned to the Web to spotlight their anger at testing under constant watch, recording  tearful TikTok videos and cataloguing their horror stories on Twitter accounts like “ Procteario” and “ ProcterrorU.” They’ve also commiserated online over the creepy risks of letting virtual strangers into their home, voicing  concerns over whether their proctors might track them down on social media after the test. (One student said her proctor kept calling her “ sweetheart.”)\n But they’ve also sought to dig deeper into the technology itself. In September, Erik Johnson, an 18-year-old engineering student at Miami University in Ohio, said he poked around the files Proctorio saves to users’ computers because he wanted to understand how the company kept students’ data secure.\n He shared  his findings — which questioned the system’s depth of monitoring and access to students’ computers — in a series of  tweets, tagging the university’s leadership. “Change isn’t going to happen if the universities and your professors don’t know about these things,” he wrote.\n He was surprised to see how quickly the company fought back, pushing Twitter and other sites to remove Johnson’s posts. Proctorio, he added, also blocked his Internet-protocol address, potentially preventing him from using it for future exams in what he called an “absurd” act of retribution.\n Proctorio’s Olsen said Johnson made false assumptions about the system and violated the company’s rules and copyrights. Olsen said he offered to revoke the ban, which he said the software triggered automatically, if Johnson or the university specified Johnson’s IP address. School officials did not respond to requests for comment.\n It wasn’t the first time Proctorio had responded forcefully to its critics. In June, Olsen waged an unusually blunt attack on a  University of British Columbia student, posting customer-support chat logs to a  college Reddit thread that he said had contradicted the student’s complaint: “If you’re gonna lie bro … don’t do it when the company clearly has an entire transcript of your conversation,” he wrote.\n But the most bitter skirmish could be decided in court. In August, Ian Linkletter, a UBC learning technology specialist,  tweeted links to Proctorio training videos that showed faculty how to watch students’ webcam footage — clear proof, he said, of the “emotional harm you are doing to students by using this technology.” The YouTube videos were visible only to people with the link, but Linkletter’s tweets essentially opened them to public view.\n Proctorio quickly deactivated the links, calling the videos “confidential and proprietary,” and a week later filed a lawsuit against Linkletter seeking damages for copyright infringement and a “breach of confidence.”\n Linkletter’s attorneys have argued it’s not illegal to share links to videos already available on the Internet. But the suit’s underlying message, Linkletter said, is an attempt to intimidate other critics from speaking up.\n “All of us have the right to discuss whether this academic-surveillance software is ethical,” he said in an interview. In a  fundraiser for his legal defense, Linkletter called it “a fight for the future” and said, “Can you imagine being sued for 8 tweets?”\n Olsen said the videos were embedded in a password-protected faculty help center, and he argues that the court filing is meant to defend the company’s intellectual property, not silence criticism. “We’re not interested in his money,” Olsen said. “If we wanted to go after his job, we would have just gone to the university.”\nSchool discipline enters new realm with online learning  The proctoring companies have argued they’re a champion for student success and privacy, but many students aren’t convinced. Thousands of college students have signed petitions to cancel online-proctor deals in  California,  Colorado,  Florida,  Massachusetts,  New York,  Ohio,  Texas,  Wisconsin and  Washington state. Others have organized  letter-writing campaigns to administrators, arguing the technology is too invasive to support.\n Students also have pointed to the companies’ troves of personal video data as a major vulnerability for cyberattack. In July, hackers  published more than 400,000 records taken from ProctorU, including names, passwords and home addresses. ProctorU said it has since enabled new security measures.\n Last month, the parent company of Proctortrack, which  advertises “the world’s most advanced remote online proctoring solution” and says it verifies students’ identities through face or “knuckle scan,”  took the service offline for eight days after hackers leaked its source code and sent offensive emails that appeared to come from official accounts.\n The company, Verificient Technologies,  apologized and said no personal data had been accessed. (Students at the Massachusetts Institute of Technology had raised concerns in a  petition two months prior about the system’s exposure to attack.)\nColleges are turning students’ phones into surveillance machines, tracking the locations of hundreds of thousands Several students said they expect these systems will shape the college experience long after the shutdowns end. Nearly 60 percent of the higher-education institutions  polled in April by the nonprofit group Educause said they were using or considering “passive video surveillance of students” during exams.\n But some corners of American schooling have voiced unease over the system’s potential risks. A few schools, including  the University of California at Berkeley, have already banned online proctoring due to privacy and accessibility concerns.\n The  College Board, which runs the SAT college-admissions exam, originally had planned to shift to an online-proctored test but stopped for fear of what it would require: three hours of uninterrupted, streaming-video-quality Internet, which many students can’t guarantee, a College Board official told The Washington Post. Officials also worried about introducing a huge new burden for students not exactly lacking in outside stress.\n Proctorio’s Olsen defends the company as an early-warning system for academic-dishonesty violations, saying it’s up to the instructor to review the flags and punish or respond in an appropriate way. He did, however, say that “a lot of faculty are overreacting these days,” requiring students, for instance, to take tests only in highly controlled areas even though the pandemic has upended their life.\nHow college students can make the most of remote learning He has also criticized the student backlash as misguided —  saying in June that “it’s hilarious, students pretending to care where their data goes” — and based largely on “regurgitated” criticism of how the service works. Most students, he said, just need to get used to it: “College is stressful. … It’s always been stressful.”\n Students like Ohio State University senior Madison Tracy, who has taken 18 Proctorio-monitored exams, argue the companies’ surveillance-or-chaos argument is a false choice. The problem, she said, isn’t the cheating; it’s the tests. Instead of the closed-book, easily Googled memorization drills proctoring software is built for, classes could offer exams with more original prompts, creative improvisation and critical thinking — no webcam oversight required.\n Some of Tracy’s professors have already gone that route, using tests she said leave her feeling just as challenged and far less overwhelmed. But for now, Tracy, who has attention-deficit/hyperactivity disorder, said she has to remind herself before every proctored test that the little techniques she typically does to refocus — such as stretching her arms or looking away — could be flagged as potentially toxic behaviors.\n “Half of my brain is so concentrated on not messing up or doing anything wrong or making the wrong move … and the other half is trying to actually work on the exam,” Tracy said. “I’ve seen so many memes of students saying, ‘Is it okay if I cry in front of the camera?’ How far is this going to go?”\n  Microsoft may earn an Affiliate Commission if you purchase something through recommended links in this article.", "posttime": "2020-11-16 04:36:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,检测,detection,学生", "title": "作弊检测软件引发“学校监控反抗”", "title_en": "Cheating-Detection Software Provokes 'School-Surveillance Revolt'", "transed": 1, "url": "https://www.msn.com/en-us/news/us/cheating-detection-companies-made-millions-during-the-pandemic-now-students-are-fighting-back/ar-BB1aX8Qa", "via": "", "real_tags": ["软件", "检测", "detection", "学生"]}]