[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迷你版。2021-06-14添加了一个“s3zip”扩展，允许从ZIP档案下载单个文件。我们将探讨与下载常规对象相比，这是一个优势的用例，并解释如何使用它。\n我们之前已经描述过MinIO如何在内部优化小对象。然而，在内部存储单个对象仍然会带来文件系统限制，例如较慢的列表和最小块大小。\n通过反馈，我们发现在某些情况下，能够在没有单个对象的完整特征集的情况下引用小数据段是可取的。为了让它尽可能容易使用，我们添加了ZIP文件索引。\n此功能允许检索上载到MinIO的ZIP文件中的单个文件。使用此功能，可以上载包含数千个文件的单个ZIP文件。然后，MinIO索引工具可以确保访问ZIP文件中的文件的性能与访问单个对象的性能相同。所有这些都是透明的。\nZIP文件在大多数开发平台上都是众所周知的，并且得到了很好的支持，而且有成熟的可用工具。在大多数语言中，ZIP格式允许流式写入，因此创建归档文件时不需要将所有数据都存储在内存中。我们选择通用格式而不是定制格式，因为它提供了我们需要的功能。像TAR这样的其他格式不能满足这方面的要求，所以我们不希望实现其他格式。\n我们这个功能的主要目标是允许快速上传许多不会改变的小数据块，并允许快速下载单个文件。由于所有数据都存储为单个文件，因此占用的空间也大大减少。\n一个主要的使用示例可以是每周/每日/每小时报告，需要按每个用户访问这些报告。您可能有一个数据湖，在那里存储要分析的文件的ZIP存档。然后，文件名将是要在其上执行查找的ID。对于常规对象，这将为每个用户每个间隔创建一个对象。相反，可以上传给定时间间隔内的所有内容，并通过ID访问单个记录。\n无法更新ZIP文件中的单个文件。因此，这应该只用于预期不会更改的数据。如果ZIP文件被覆盖，所有文件都会同时被原子地替换。如果您知道要修改ZIP文件的内容，那么不要使用ZIP文件，而是将文件保存为常规对象。\nzip中的文件没有单独的元数据，只有名称和大小。修改时间从父ZIP对象继承。这意味着ILM规则和保留将作为一个整体应用于ZIP对象。\nZIP压缩是次要的，通常建议只对ZIP文件中的文件进行解压缩。这可以在压缩文件时设置。单个文件可以不压缩存储，也可以使用deflate或zstandard进行压缩。\n归档文件的字节大小对检索单个文件的响应性几乎没有影响。为了保证每个请求的响应速度，建议将每个zip文件保持在100000个单独文件以下。如果你打算超越这一点，我们建议将你的输入分成几个文件，每个文件的目标是10000个文件。\n基准测试显示，对于包含10000个文件的zip文件，每次访问大约需要1ms。这是线性扩展的，因此，假设CPU资源可用，对于100000个文件，每个操作应该额外需要10毫秒。\n通过对现有S3API的扩展，可以使用索引ZIP文件。为了确保不会出现意外的副作用，所有的使用都由启用新功能必须存在的标题进行保护。要启用扩展，必须将标题x-minio-extract的值设置为true。\n以下API请求类型支持s3zip扩展：HeadObject、GetObject和ListObjectsV2。这将允许在归档文件中列出文件并检索它们。\nzip文件中的文件被引用为/prefix/file。zip/file中的zip/path。ext.Zip文件必须具有Zip扩展名，并且Zip文件中的路径用于引用每个文件。\n例如，列出作为前缀/file上传的文件中的所有文件。zip发出一个带有前缀/file的GetObject。zip/。请注意，正斜杠是如何表示zip文件中的内容的。前缀、标记和分隔符作为常规ListObjectsV2调用运行。\n上传文件是通过常规功能完成的。上传文件不需要特殊操作，但对象键必须以结尾。拉链\n要在上传时触发即时索引，可以通过将x-minio-extract头设置为true来触发。如果没有设置，索引将由上面提到的第一个请求创建，该请求检索或列出zip中的文件。\nZip64（4GB以上的zip文件）完全受支持。不支持基于Zip加密的Zip文件。\n支持Unicode名称，应使用UTF-8编码。然而，确实存在依赖本地代码页工作的不合规压缩器。如果您计划使用Unicode名称，请检查文件名的解码是否正确。通常建议遵循通用对象键命名准则。\n要列出zip文件的内容，请发送包含zip文件的前缀作为前缀，并发送上述标题。例如前缀/文件。zip/将以键前缀/file列出zip文件的所有内容。拉链支持常规ListObjectV2参数，如附加前缀、标记和分隔符。\n例如，使用prefix=prefix/file列出。zip/folder/，delimiter=/将只列出指定文件夹中的内容。\n为了保持较低的复杂性，有几个限制：必须使用ListObjectV2。每次通话只能列出一个zip文件，并且只能列出zip文件的最新版本。\n如上所述，访问单个文件需要一个头和一个路径来指示zip文件和其中的文件。要获取路径，可以使用ListObjectsV2。还可以通过手动将对象路径与zip文件内的路径组合来构造对象名。\n单个文件作为单个请求处理。这将以与单独对象相同的速度生成单个文件。如果您需要访问存档中许多文件的内容，下载整个ZIP存档并在本地处理会更快。\nmc发布。2022-02-16增加了对远程访问zip文件中文件的支持。具体来说，ls、cp和cat命令支持源为远程zip文件的操作。这些命令有一个“-zip”参数，表示您打算在zip文件上运行该操作。\n这仅在远程服务器是以分布式模式运行的MinIO服务器时才起作用。\ns3zip功能允许您以紧凑的方式存储许多小文件。这可以很好地替代许多单个对象，从而减少ILM和其他操作的存储开销和处理时间。\n与任何扩展一样，通常的警告也适用。虽然从技术上讲，在没有任何服务器端支持的情况下实现本地索引并使用HTTP范围请求来提供类似的功能是可能的，但这需要付出相当大的努力，而且结果不会像我们使用扩展所实现的那样简化。\n出于存档目的，此扩展为通过mc命令界面检索很少访问的存档数据提供了一种更节省空间和带宽的方法。这是一种有效的存储日志数据的方法，您只需要偶尔访问这些数据。它可以用于快速上传需要ID快速访问的多个数据段。\n考虑使用USERID -GT的每日用户统计数据；json映射。使用常规对象时，可以将其实现为yyyy/mm/dd/user_id/文件。json对象命名。这需要每天为每个用户上传一个对象。\n相反，每天可以创建一个zip文件，并且可以通过读取yyyy-mm-dd.zip/user_id.json来查找用户统计数据——这将更快地上传、维护并占用更少的空间——在数据湖中工作时，这一切都是好事。\n如果有很多用户，使用确定性拆分方法，比如yyyy-mm-dd/user0-10000。zip/user_id.json将允许将其扩展到数十亿用户，减少5个数量级的对象。\n下载MinIO，并利用从ZIP文件中列出和下载单个文件的功能。如果您有任何问题或想告诉我们您正在使用MinIO构建的优秀应用程序，请点击我们hello@min.io或者加入Slack社区。", "note_en": "MinIO RELEASE.2021-06-14 added an “s3zip” extension that allows downloading individual files from ZIP archives. We will explore the use cases where this is a benefit compared to downloading regular objects, and explain how to use it.\n  We have previously described how MinIO internally optimizes  small objects. However, internally storing individual objects still imposes file system limitations such as slower listing and minimum block size.\n Through feedback we found that in certain situations it would be desirable to be able to reference small data segments without the full feature set of individual objects. To make this as easy as possible to use, we added ZIP file indexing.\n This feature allows retrieving individual files within ZIP files uploaded to MinIO. With this feature it is possible to upload a single ZIP file that contains thousands of files. A  MinIO indexing tool then ensures that accessing a file inside a ZIP file can be done with the same performance as individual objects. All of this is done transparently.\n  ZIP files are commonly known and well supported across most development platforms, as well as having well-established tools available. In most languages the ZIP format allows for streaming writes, so it doesn’t require all data to be in memory when creating the archive. We choose a common format over a custom built format since it provides the functionality we need. Other formats like TAR do not fulfill the requirements for this, so we do not expect to implement other formats.\n  Our main target for this feature is to allow fast upload of many small pieces of data that do not change and allow fast download of individual files. This also has the added benefit of taking up much less space since all data is stored as a single file.\n A prime usage example could be weekly/daily/hourly reports that need to be accessed on a per user basis. You might have a data lake where you store ZIP archives of files to be analyzed. File names would then be the ID on which you would like to perform the lookup. With regular objects this would create one object per user per interval. Instead, all content for a given time interval can be uploaded and individual records can be accessed by the ID.\n It is not possible to update individual files inside the ZIP file. Therefore this should only be used for data that isn’t expected to change. If the ZIP file is overwritten, all files are replaced atomically at the same time.  If you know that you will be modifying the contents of the ZIP file, then don’t use a ZIP file, save the files as regular objects instead.\n There is no individual metadata for files inside a zip, only name and size. Modification time is inherited from the parent ZIP object. This means that  ILM rules and  retention are applied to the ZIP object as a whole.\n ZIP compression is secondary, and generally it is recommended to just leave files inside ZIP files uncompressed. This can be set when compressing the files. Individual files can be stored uncompressed or compressed with the deflate or zstandard.\n The size in bytes of the archive has little impact on the responsiveness of retrieving individual files. To keep individual requests responsive it is recommended to keep each zip file below 100,000 individual files. If you plan to go above this, we recommend splitting your input into several files, targeting 10,000 files in each.\n Benchmarks show that for zip files with 10,000 files, each access takes roughly 1ms. This scales linearly, so with 100,000 files an additional 10ms should be expected per operation, assuming CPU resources are available.\n  Working with indexed ZIP files is made possible by an extension to the existing S3 API. To ensure there can be no unintended side-effects, all use is guarded by headers that must be present to enable the new functionality. To enable the extension the header  x-minio-extract must have the value  true set.\n The following API request types support the s3zip extensions:  HeadObject,  GetObject and  ListObjectsV2.This will allow listing files within archives and retrieving them.\n Files inside zip files are referenced as  /prefix/file.zip/path-in-zip/file.ext. Zip files must have the zip extension and the path within the zip file is used to reference each file.\n For example, to list all files in a file uploaded as  prefix/file.zip issue a  GetObject with prefix  prefix/file.zip/. Note how the forward slash indicates content inside the zip file. Prefixes, markers and separators operate as regular ListObjectsV2 calls.\n   Uploading files is done through regular functions. No special action is needed for uploading files, except that the object key must end with  .zip.\n To trigger immediate indexing on upload, it is possible to trigger it by setting the    x-minio-extract header to  true. If it is not set, the index will be created by the first request mentioned above that retrieves or lists files inside the zip.\n Zip64 (zip files above 4GB) is fully supported. Zip files with zip-based encryption are not supported.\n Unicode names are supported, and should use UTF-8 encoding. However, there do exist non-compliant compressors that rely on local codepages to work. If you are planning to use Unicode names check if file names are decoded correctly. It is generally recommended to stick to the general  object key naming guidelines.\n    To list the content of a zip file, send a prefix containing the zip file as a prefix and the header described above. For example  prefix/file.zip/ will list all content of the zip file with the key  prefix/file.zip. Regular ListObjectV2 parameters like additional prefix, markers and separators are supported.\n For example, listing with prefix =  prefix/file.zip/folder/, delimiter =  / will list only content within the folder specified.\n To keep the complexity low a few limitations are in place: ListObjectV2 must be used. Only a single zip file can be listed per call and only the most recent version of a zip file can be listed.\n   As mentioned above, accessing individual files requires a header and a path to indicate the zip file and the file within it. To get the path, ListObjectsV2 can be used. The object name can also be constructed by manually combining the object path with the path inside the zip file.\n   Individual files are handled as single requests. This will produce single files at the same speed as separate objects. If you need to access the content of many files within an archive it will be faster to download the entire ZIP archive and process it locally.\n   mc RELEASE.2022-02-16 adds support for accessing files inside zip files remotely. Specifically, the ls, cp and cat commands support operations where the source is a remote zip file. These commands have a “--zip” parameter to indicate that you intend the operation to run on zip files.\n            This will only work when the remote is a MinIO server running in distributed mode.\n  The s3zip feature allows you to store many small individual files in a compact way. This can be a good alternative to many individual objects, which will reduce the storage overhead and processing time for ILM and other operations.\n As with any extension, the usual caveats apply. While it is technically possible to implement a local index and use HTTP range requests to provide similar functionality without any server side support, it would require a considerable effort, and the result would not be as streamlined as what we’ve accomplished with our extension.\n For archival purposes this extension provides a much more space and bandwidth efficient method for retrieving rarely accessed archived data through the mc command interface. This can be an effective method for storing log data that you only occasionally need to access. It can be used for fast upload of multiple data segments that need fast access by an ID.\n Consider daily user statistics with a userid -&gt; json mapping. When using regular objects this could be implemented as a  yyyy/mm/dd/user_id/file.json object naming. This would require uploading an object for each user each day.\n Instead a single zip file could be created per day, and user stats could be looked up by reading  yyyy-mm-dd.zip/user_id.json - which will be both faster to upload, maintain and take up less space - all good things when working in a data lake.\n If there are many users, using a deterministic splitting approach, like  yyyy-mm-dd/user0-10000.zip/user_id.json would allow this to scale to billions of users, with 5 orders of magnitude less objects.\n  Download MinIO and take advantage of the ability to list and download individual files from ZIP files. If you have any questions or want to tell us about the great apps you’re building using MinIO, ping us on hello@min.io or join the  Slack community.", "posttime": "2022-02-17 13:55:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文件,file,zip", "title": "MinIO中的小文件档案", "title_en": "Small File Archives in MinIO", "transed": 1, "url": "https://blog.min.io/small-file-archives/", "via": "", "real_tags": ["文件", "file", "zip"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据上周发布的一份意向通知，能源部（DOE）将在一项旨在防止核电站关闭的计划上花费60亿美元。\n该部门&#39；美国的民用核信贷计划由两党于11月签署成为法律的《基础设施投资和就业法案》提供资金支持。该计划将允许美国商业核反应堆的所有者和运营商以竞争性方式竞购贷款，以帮助他们在经济困难的情况下继续运营。\n申请者必须证明他们的反应堆因经济原因而面临关闭，并且由于其他来源的电力生产，关闭反应堆将导致空气污染增加。申请者还必须获得美国核管理委员会（U.S.Nuclear Regulatory Commission）的安全运行批准。\n美国93座核反应堆的舰队目前提供了52%的国土面积&#39；根据能源部的数据，这是清洁的电力。然而，最后两个投入使用的反应堆——田纳西州的瓦茨巴1号和2号机组——分别于1996年和2016年上线。目前正在建设的唯一一座工厂——位于佐治亚州的Vogtle工厂——落后于计划数年，比原预算高出约140亿美元。自2013年以来，经济因素导致12座商业反应堆提前关闭。\nH.a.和#34的查尔斯·梅森（Charles Mason）说，运行反应堆的高运行和维护成本可能会使它们在某些市场变得不经济；戴夫&#34；是的，Jr. Chair在怀俄明大学的石油和天然气经济学研究所，他在2016对能源部的核能经济学进行了研究。\n虽然反应堆供电的可靠性和24小时可用性是其吸引力的一部分，但发电厂无法轻易关闭和重启这一事实意味着，当市场供应充足时，它们有时会亏损运行。他说，这使得能源部的支持计划成为让一些核电站作为无碳资源保持在线的唯一途径之一。\n&#34;核能提供了大量无碳电力，我们从来没有奖励过它，&#34；梅森说&#34;如果你想在我们向可再生能源过渡的过程中有一个确定的事情和后盾，你&#39；我们需要核能，它比可再生能源产品组合中的任何其他产品都更容易获得&#34;\n尽管一些环保人士对核能的安全性和成本提出了担忧，但拜登政府已承诺将现有的核舰队作为清洁能源转型的一部分。参议院能源和自然资源委员会主席、核计划支持者、弗吉尼亚州民主党参议员乔·梅钦在一份声明中说&#34；确保我国国内核电厂的持续运行对于实现减排目标、同时保持可靠性至关重要&#34;\n美国能源部周五发布的意向通知和信息请求将帮助美国能源部更多地了解该项目和认证过程的优先事项，美国政府预计将在今年晚些时候启动该项目和认证过程。\n核能研究所（NEI）政策制定高级主管马特·克罗扎特（Matt Crozat）表示，该行业目前处于&#34；鼓励&#34；通过建立信贷计划，但仍在推动更持久的经济支持。民主党人提出了一项为期10年的生产税减免（PTC），将在《重建更好法案》（Build Back Better Act）谈判中支持核电站，NEI正在寻求额外的税收减免工具。\n&#34;PTC的透明性为核电站所有者提供了更大的确定性，并将成为实现激励持续运行目标的更有效机制，34；克罗扎特在一封电子邮件中说&#34;如果PTC得以实施，我们预计DOE民用核信贷计划将成为一个后盾，其应用范围将比DOE计划是联邦支持的唯一形式更为有限&#34;", "note_en": "The Department of Energy (DOE) will spend          $6 billion on a program       designed to keep nuclear power plants from closing, according to a notice of intent published last week.\n The department&#39;s Civil Nuclear Credit Program is backed by funding from the bipartisan          Infrastructure Investment and Jobs Act       signed into law in November. The program will allow owners and operators of commercial U.S. nuclear reactors to competitively bid on credits to help continue their operations amid economic hardship.\n Applicants will have to prove that their reactor faces closure for economic reasons and that closing the reactor would lead to an increase in air pollution because of power production from other sources. Applicants must also be approved by the U.S. Nuclear Regulatory Commission for safe operation.\n    The U.S. fleet of 93 nuclear reactors currently provides 52% of the nation&#39;s clean electricity, according to DOE figures. However, the          last two reactors to enter service       – Watts Bar Units 1 and 2 in Tennessee – came online in 1996 and 2016, respectively. The only one currently under construction – the          Vogtle plant in Georgia       – is years behind schedule and roughly $14 billion over the original budget. Since 2013, economic factors have led to the early closure of 12 commercial reactors.\n The high operating and maintenance costs of running a reactor can make them uneconomical in some markets, said  Charles Mason, the H. A. &#34;Dave&#34; True, Jr. Chair in Petroleum and Natural Gas Economics at the University of Wyoming who          worked on a review       of the economics of nuclear power for DOE in 2016.\n While the reliability and 24-hour availability of power from a reactor is part of their appeal, the fact that the plants cannot easily be shut down and restarted means that they sometimes operate at a loss when there is ample supply on the market. That, he said, makes the DOE support program one of the only ways to keep some nuclear plants online as a carbon-free resource.\n &#34;Nuclear power provides substantial amounts of carbon-free electricity and we have never rewarded it,&#34; Mason said. &#34;If you want to have a sure thing and a backstop as we transition to renewable energy, you&#39;ll need nuclear, which is more readily available than anything else in the renewable portfolio.&#34;\n Although some environmentalists have raised safety and cost concerns with nuclear power, the Biden administration has          committed to the existing nuclear fleet       as part of the clean energy transition. Sen. Joe Machin, D-W.Va., chairman of the Senate Energy and Natural Resources Committee and a backer of the nuclear program, said in a statement that &#34;ensuring the continued operation of our domestic nuclear fleet is essential to achieving our emission reduction goals while also maintaining reliability.&#34;\n The Notice of Intent and Request for Information released by the DOE Friday will help the department learn more about priorities for the program and certification process, which the administration anticipates launching later this year.\n Matt Crozat, senior director of policy development for the Nuclear Energy Institute (NEI), said the industry is &#34;encouraged&#34; by the creation of the credit program, but is still pushing for more permanent economic support. Democrats included a 10-year production tax credit (PTC) that would support nuclear plants in the          Build Back Better Act       negotiations and NEI is seeking an additional vehicle for that tax credit.\n &#34;The transparent nature of the PTC provides greater certainty to nuclear plant owners and will be a more effective mechanism to accomplish the goal of incentivizing continuing operation,&#34; Crozat said in an email. &#34;If the PTC were to be enacted, we would expect the DOE civil nuclear credit program to serve as a backstop with more limited applications than if the DOE program were the only form of federal support.&#34;", "posttime": "2022-02-17 13:53:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,核反应堆,nuclear,反应堆", "title": "美国能源部将提供60亿美元，让苦苦挣扎的核反应堆保持在线", "title_en": "US DOE to offer $6B to keep struggling nuclear reactors online", "transed": 1, "url": "https://www.utilitydive.com/news/doe-to-offer-6-billion-to-keep-struggling-nuclear-reactors-online/618919/", "via": "", "real_tags": ["美国", "核反应堆", "nuclear", "反应堆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lorinda Cherry于1969年从史蒂文斯理工学院获得了计算机科学硕士学位，当时计算机科学课程更多的是一个专业数学学位，有一些编程课程，但几乎没有理论。她作为Fortran程序员工作了几年，但发现经常根据别人的想法编写程序“非常无聊”。她渴望从事系统方面的工作，但这类工作几乎没有什么入门点：个别实验室倾向于招收新毕业生，并用内部编程语言对他们进行培训，而Cherry的资质已经过高。她最终在贝尔实验室找到了一个家，在那里她开发了一个新的Unix操作系统，当她加入团队时，这个系统还没有转换到C。\nCherry在贝尔实验室的协作和创造性环境中蓬勃发展，这鼓励程序员想象和执行他们感兴趣的项目。她研究过几种有影响力的数学工具，包括台式计算器语言（bc）；TeX和eqn，都是用于出版数学公式的排版系统；以及一种基于三角统计的数据压缩方法。Cherry回忆说，在这些年里，电脑的潜力几乎没有被挖掘出来，如果问到她靠什么谋生，她会说，她的工作是“看看我能让电脑做什么样的整洁的新东西，在那些日子里，电脑做的不多，但它非常有趣，你可以让它做更多的事情。”\nUnix系统的早期优势在于它允许不同的程序在一项任务上进行协作，Cherry自称“在Unix中思考”，她经常找到方法将一个应用程序中的洞察或功能应用到一个看似无关的上下文中。因此，最早的拼写检查程序之一，打字，从她的统计工作演变而来。Cherry继续帮助开发其他与文本相关的项目，包括Writer's Workbench，这是一个编辑程序，受到高中和大学英语系的热烈欢迎。\nCherry在生活的各个领域都为自己的工作找到了灵感，从拉力赛车到训狗。事实上，她撰写了一系列关于使用统计分析来评估狗狗秀评委对某些特征或品种的无意识偏见的论文。正如她对一位采访者所说，“我是一名从业者。我会带着任何借口或活动去写程序。”\nJanice Zdankus是惠普企业客户体验和质量团队的质量副总裁。在这个角色中，Janice和她的团队正在转变\n阅读更多»\n伊冯是谷歌计算机科学教育团队的项目经理。在她的角色中，她管理外部合作伙伴关系，并与项目团队合作，如\n阅读更多»\n米斯蒂是博尔德本地人，是一位经验丰富的（计算机）梦想家。她喜欢认识朋友和结识新朋友。她是一个热情的旅行者，而地图是\n阅读更多»\nLisa A. Flores是科罗拉多大学传播系的副教授。她拥有美国语言交流博士学位\n阅读更多»", "note_en": "Lorinda Cherry received her Master’s in Computer Science from Stevens Institute of Technology in 1969, at a time when the computer science program was more of a specialized math degree, with some programming courses but little theory. She worked for a few years as a Fortran programmer, but found it “very boring” to constantly write programs based on someone else’s ideas. She yearned to work on systems, but there were few entry points for such jobs: individual labs tended to recruit new graduates and train them in their in-house programming language, and Cherry was already overqualified. She eventually found a home at Bell Labs, where she worked on the nascent Unix operating system, which had not yet made the switch to C when she joined the team.\n Cherry thrived in the collaborative and creative environment of Bell Labs, which encouraged programmers to imagine and execute projects that interested them. She worked on several influential mathematical tools, including a desk-calculator language (bc); TeX and eqn, both typesetting systems for publishing mathematical formulae; and a method of data compression based on trigram statistics, among others. In these years, Cherry recalls, the potential of the computer had barely been tapped, and if asked what she did for a living, she would say that her job was to “see what kind of neat new things I can make the computer do, and in those days the computer wasn’t doing a lot, but it was super interesting and there was a lot more stuff you could make it do.”\n An early strength of the Unix system was the way it allowed different programs to cooperate on a task, and Cherry, who described herself as “thinking in Unix,” often found ways to apply an insight or feature from one application to a seemingly unrelated context. Thus, one of the first spell-check programs, typo, evolved from her statistics work. Cherry went on to help develop other text-related projects, including Writer’s Workbench, an editing program that was eagerly embraced by high school and college English departments.\n Cherry found inspiration for her work in every area of her life, from rally car racing to dog training. In fact, she authored a series of papers on using statistical analysis to evaluate the unconscious bias of dog show judges toward certain characteristics or breeds. As she told one interviewer, “I’m a practitioner. I’m off to write programs with any excuse or activity.”\n  Janice Zdankus is Vice President of Quality in Hewlett Packard Enterprise’s Customer Experience and Quality team.  In this role, Janice and her team are transforming\n  \t\t\t\tRead More »\n  Yvonne is a Program Manager on Google’s Computer Science Education team. In her role she manages external partnerships and works with program teams such as\n  \t\t\t\tRead More »\n  A Boulder native, Misty is an experienced (computer) visionary. She enjoys recognizing friends and meeting new people. She is an ardent traveler, and mapping is\n  \t\t\t\tRead More »\n  Lisa A. Flores is Associate Professor in the Department of Communication at the University of Colorado.  She has a Ph.D. in Speech Communication from the\n  \t\t\t\tRead More »", "posttime": "2022-02-17 13:50:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cherry,团队", "title": "Lorinda Cherry，《哥伦比亚特区，公元前，eqn》的作者去世", "title_en": "Lorinda Cherry, author of dc, bc, eqn has died", "transed": 1, "url": "https://ncwit.org/profile/lorinda-cherry/", "via": "", "real_tags": ["cherry", "团队"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该命令打开一个iTerm2窗口，并通过ssh连接到拆分窗格会话中的每个指定主机，通过iTerm2和#39将任何键入或粘贴的文本复制到所有窗格；s&#39；广播&#39；特色iTerm2和#39；s的拆分窗格控件可以正常使用，因此每个窗格可以切换广播输入，会话可以重新启动，等等。\n克隆此repo（或者只下载&#39；csshi&#39；文件），使csshi文件可执行，并可能将其复制或链接到$PATH中的某个位置。\n用法：csshi[-h][l用户名][p端口][d][J跳线主机][o选项][C列]目的地[目的地…]在iTerm2终端中同时运行多个ssh连接。位置参数：目标[user@]主机[：端口]ssh服务器规范。在IPv6 IP地址周围使用方括号。可选参数：-h，--help显示此帮助消息并退出-l USERNAME，--USERNAME登录USERNAME，通过指定&#39覆盖每个主机；user@host&#39; -p PORT，--PORT-PORT-PORT-ssh-server-PORT，通过指定&#39，每个主机覆盖；主机：端口-d，--debug打开调试-J JUMPHOST，--jump JUMPHOST ProxyJump主机规范，如[user@]JUMPHOST[：port]-o选项，--OPTIONS原始ssh选项字符串，例如&#39-我~/。ssh/id_-ansible和#39-C列，--列最大列数。\n如果您发现自己在一次csshi会话中打开了许多终端，请选择一些优化外壳密度的首选项：\n禁用窗格菜单栏：iTerm2-&gt；偏好-&gt；外观-&gt；窗格-&gt；使用拆分窗格显示每个窗格的标题栏您仍然可以使用Ctrl键而不是菜单栏汉堡图标访问每个窗格的菜单\n使用小字体，如原来的misc fixed 6x13，并禁用抗锯齿：iTerm2-&gt；偏好-&gt；简介-&gt；文本-&gt；消除锯齿", "note_en": "The command opens an iTerm2 Window and connects over ssh to each specified host in a  split pane session, with any text typed or pasted replicated to all panes through iTerm2&#39;s &#39;broadcast&#39; feature. iTerm2&#39;s split pane controls are available as normal, so broadcast input can be toggled per-pane, sessions can be restarted, etc.\n   Clone this repo (or just download the &#39;csshi&#39; file), make the csshi file executable, and maybe copy or link it to somewhere in your $PATH.\n  usage: csshi [-h] [-l USERNAME] [-p PORT] [-d] [-J JUMPHOST] [-o OPTIONS] [-C COLUMNS] destination [destination ...]Run multiple ssh connections concurrently in an iTerm2 terminal.positional arguments: destination [user@]host[:port] ssh server specification. Use square brackets around IPv6 IP adresses.optional arguments: -h, --help show this help message and exit -l USERNAME, --username USERNAME Login username, overridden per-host by specifying &#39;user@host&#39; -p PORT, --port PORT ssh server port, overridden per-host by specifying &#39;host:port -d, --debug Turn on debugging -J JUMPHOST, --jump JUMPHOST ProxyJump host specification, like [user@]jumphost[:port] -o OPTIONS, --options OPTIONS Raw ssh options string, e.g. &#39;-i ~/.ssh/id_ansible&#39; -C COLUMNS, --columns COLUMNS Maximum number of columns.\n  Some preferences to optimise for shell density if you find yourself opening a lot of terminals in one csshi session:\n Disable pane menubars:  iTerm2 -&gt;  Preferences... -&gt;  Appearance -&gt;  Panes -&gt;  Show per-pane title bar with split panes You can still access the menu for each pane with Ctrl-click instead of the menubar burger icon\n Use a small font, like the original  misc-fixed 6x13, and disable antialiasing:  iTerm2 -&gt;  Preferences... -&gt;  Profiles -&gt;  Text -&gt;  Anti-aliased", "posttime": "2022-02-17 13:49:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iterm2,clusterssh,窗格", "title": "iTerm2的ClusterSSH", "title_en": "ClusterSSH for iTerm2", "transed": 1, "url": "https://github.com/ilikejam/csshi", "via": "", "real_tags": ["iterm2", "窗格"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我第一次读到联邦政府关于“零信任过渡”的备忘录时，我激动得跳了出来。备忘录中有很多很棒的东西（见我之前的博客帖子），但最让我兴奋的是备忘录在VPN上的立场。\n你可能希望备忘录会说“VPN还不够”，因为它们真的不够。备忘录说：\n如果在没有其他防御措施的情况下使用老式的周边VPN，则问题非常严重。只有一个外围VPN来保护你的资产，但没有其他防御，这类似于你的公司安全态势是围绕着给办公楼钥匙，而不是给个别办公室钥匙。一旦攻击者进入大楼，他们可以进入任何办公室，没有人能阻止他们做任何他们想做的事。\n我们已经知道，这备忘录部分是对殖民地管道勒索事件2021的反应，其中一个不活跃的VPN帐户允许攻击者违反殖民地管道的整个基础设施。因此，我们预计周边VPN将被弃用。\n因此，我希望接下来的备忘录会说“使用VPN划分网络”。这就像是给个人钥匙，而不是整栋楼的钥匙。这就是今天许多现代VPN的功能——它们使用策略或基于角色的访问控制（RBAC）来控制给定用户可以访问公司网络的哪个部分。但实际上备忘录上没有这么说。上面说：\n所以，这听起来有点合理。你可以想象让用户登录到VPN背后的应用程序。因此，首先，您将VPN接入网络，然后使用另一组凭据登录到您的应用程序。\n换句话说，它实际上建议不要使用VPN！企业应用程序必须足够安全，才能在没有VPN的情况下使用。这是谷歌在2013年发布的beyondcorp方法。备忘录后来更明确地阐明了自己的立场，称：\n对于大多数机构来说，在不依赖虚拟专用网络（VPN）或其他网络隧道的情况下，以安全的方式访问互联网应用程序是一个重大转变，需要付出巨大努力才能实现。\n考虑这一点的一种方式是VPN是一根拐杖。如果团队认为他们的应用程序“在VPN后面”，因此“对手无法访问”，那么他们就会懒得锁定应用程序，从而增加应用程序被破坏的风险。\n换句话说，通过插入身份验证系统、MFA和RBAC（正如备忘录所建议的那样）来锁定单个应用程序更为困难，而且更容易将东西“固定在VPN后面”。备忘录鼓励人们改变思维方式，声明“从安全角度来看，每个应用程序都应该被视为可以通过互联网访问”。这是一种转变。政府甚至私营企业需要时间来适应这一点。\n下面是您想要控制对特定应用程序的访问的另一个原因——这样做可以降低攻击者从网段中托管的一个目标横向移动到同一网段中另一个目标的风险。\n我们知道，通过远程访问协议进行横向移动是攻击者的常见策略。例如，在2009年的Aurora行动中就发生了这种情况（攻击者在VPN后面使用泄露的管理员凭据从一个目标跳到另一个目标）。\n（公平地说，我们还需要做其他事情来限制横向移动，比如关闭开放的端口并正确构建网络层，但不可否认的是，通过远程访问工具进行横向移动是攻击者喜欢使用的技术。）\n分段VPN还提供了一般的访问控制——它们可以控制用户Alice可以访问哪些专用网络，但不能控制用户在该网络内时可以访问哪些目标、应用程序或角色。网络分割几乎总是以比创建访问集群的应用程序更大的粒度级别发生。您总是希望您的隔间包含一个应用程序。最好的方法是控制对应用程序的访问\n让我们回到我的办公楼类比。即使Alice只被允许访问特定的一组办公室，但一旦她进入办公室，她就可以访问办公室里的任何设备、文件或材料。所以如果爱丽丝在人力资源部，你最好确保所有的人力资源文件都在爱丽丝的办公室里。（好吧，我正在努力进行这个物理类比，我已经有一段时间没有在真正的办公室了，但你明白我的意思了！）\n我们可以做得比使用密钥办公室（即分段VPN）间接屏蔽访问更好。更好的方法是对Alice实施特定的组织角色和责任。如果她是人力资源人员，她可以访问人力资源信息。如果她是一名会计，她可以获得会计信息。\n控制对应用程序上特定角色的访问并不是VPN的设计目标。\n备忘录中提到，需要记录用户访问应用程序时的行为，并提到“提高机构对用户活动的了解，从而更好地检测异常行为”。\nVPN不能很好地做到这一点。它们只跟踪用户访问的网段。换句话说，他们停在办公室的前门，但他们看不到办公室里发生的事情。（有很多工具可以部署和关联，以便通过VPN了解用户的行为。想象一下，我的VPN、NAC、CASB、NGFW和目录日志之间需要关联。但谁想这么做呢！）\n如果用户对应用程序进行身份验证，代理机构可以准确跟踪谁登录了应用程序，他们扮演了什么角色，他们运行了什么命令或访问了什么资源。所有这些活动都与他们的用户身份有关，而不是与一个模棱两可的角色或IP地址有关。\n所有这些都让我想起了2013年奥巴马总统在国情咨文中说“网络攻击”的那一刻。现在这么说很有趣，但那时候我震惊了，觉得我在博士学位上赌对了马。\n因为BastionZero不是VPN。BastionZero允许您登录目标，而不是网络。它控制用户在这些目标上访问的角色。它会记录用户在这些目标上所做的一切。\nBastionZero提供基础设施访问即服务。它可以在几秒钟内部署，自动发现目标，并自动与IdP集成。您可以编写策略来决定某人可以访问哪些目标以及使用哪些角色。该服务记录每个命令、运行它的人、角色和目标。\n通过今天预订演示了解更多信息。", "note_en": "When I first read the  federal government’s memo on it’s “transition zero trust”, I was jumping out of my skin with excitement.  There’s lots of great stuff in that memo (see my  earlier blog post) but what excited me most was the memo’s stance on VPNs.\n    You would expect the memo to say “VPNs are not enough”, because they really aren’t.  The memo says:\n    The old-fashioned perimeter VPNs are highly problematic, if they are used in the absence of other defenses. Having just one perimeter VPN to protect your assets, but no other defense, is akin to basing your corporate security posture around giving keys to office  buildings but not to individual offices.  Once the attacker enters the building, they can get into any office and no one can stop them from doing whatever they want.\n  We already know that this memo is, in part, a reaction to the Colonial Pipeline ransomware incident of 2021, where a  single inactive VPN account allowed the attackers to breach Colonial Pipeline’s entire infrastructure.  So we’d expect perimeter VPNs to be deprecated.\n    So what I would have expected next would be for the memo to say “segment your network using VPNs”.  This would be like giving individuals keys to individual offices, rather than the entire building.  And this is what many of today’s modern VPNs do -- they use policy or role-based access control (RBAC) to control which part of a corporate network a given user has access to. But actually the memo didn’t say that.  It said:\n    So, that sounds kind of reasonable.  You could imagine having users log into applications behind a VPN.   So first you would VPN into the network, and then you would use another set of credentials to log into your application.\n        In other words, it actually advises  against using VPNs at all!  Enterprise applications must be secure enough to be used without a VPN. This is the  beyondcorp approach that Google promulgated back in 2013.  The memo later spells out it’s stance even more starkly by saying\n  Making applications internet-accessible in a safe manner, without relying on a virtual private network (VPN) or other network tunnel, is a major shift for most agencies that will take significant effort to achieve.\n      One way to think about this is that VPNs are a crutch.  If teams believe that their applications are “behind a VPN” and therefore “inaccessible to adversaries”, then they’ll be lazy about locking down the application and therefore increase the risk that the application will be breached.\n  In other words, it’s more difficult to lock down individual applications by inserting authentication systems, MFA and RBAC ( as suggested by the memo), and it’s much easier to stick things “behind a VPN”.  The memo encourages a change in mindset by stating “every application should be treated as internet accessible from a security perspective”.   This is a shift. It will take time for the government and even private companies to get used to this.\n    Here’s another reason you want to control access to a specific application --- doing this reduces the risk that an attacker will move laterally from one target hosted in a network segment to another target in the same network segment.\n  We know that lateral movement via remote access protocols is a common strategy for attackers.  This happened, for instance, in the  2009 Operation Aurora (when attackers used compromised admin credentials to jump from one target to another while behind a VPN).\n        (To be fair, there are other things one needs to do to restrict lateral movement, like close open ports and properly architect the network layer, but it is undeniable that lateral movement via remote access tools is a technique attackers love to use. )\n      Segmented VPNs also provide mediocre access control -- they can control which private networks a user Alice is allowed to access, but not which targets or applications or roles she’s able to access while she’s inside that network.  Network segmentation almost always occurs at a level of granularity greater than the application creating clusters of access. You always want your compartment to contain one application. The best way to do that is control access to applications\n  Let’s go back to my office building analogy. Even if Alice is allowed to access only a specific set of offices, once she’s inside an office she can access any of the devices, paperwork or materials that are lying around in the office. So if Alice is in HR, you better make sure that all the HR paperwork is available in Alice’s office. (OK I am struggling with this physical analogy, I haven’t been in a real office for a while, but you get where I am saying!)\n  We can do better than indirectly gating access using keys offices (i.e. segmented VPNs). A far better approach would be to enforce specific organizational roles and responsibilities on Alice. If she’s an HR person, she gets access to HR information. If she’s an accountant, she gets access to accounting information.\n  Control access to specific roles on an application is not something that VPNs are designed to do very well.\n    The memo alludes to the need to log the behavior of users while they are accessing applications, talking about “improve[d] agencies’ knowledge of user activities, thereby better detecting anomalous behavior”.\n  VPNs can’t do this very well. They just track what network segment a user accessed. In other words, they stop at the front door of the office, but they lack visibility of what’s going on inside the office.   (There are a multitude of tools you could deploy and correlate to get an understanding of a user’s behavior through a VPN.   Just imagine having to correlate between my VPN, NAC, CASB, NGFW, and directory logs.  But who wants to do that!?)\n  If users authenticate into applications, agencies can track exactly who logged into the application, what role they assumed, and what commands they ran or resources they accessed. And all of this activity is tied back into their user identities, rather than into an ambiguous role or IP address.\n    All of this it kind of reminded me of that moment in 2013 when I saw President Obama say the words “cyber-attack” in his  state of the union address.  It’s funny to say this now, but back then I was stunned and felt like I had bet on the right horse for my PhD.\n    Because BastionZero is not a VPN.  BastionZero lets you log into targets, not networks. It controls what roles users access on those targets. And it logs everything that users do on those targets.\n BastionZero provides infrastructure access as a service. It deploys in seconds, autodiscovers your targets, and automatically integrates with your IdP. You write policies to decide which targets someone can access and under which roles. The service logs each command, who ran it, as which role, and on which target.\n Learn more by booking a demo today.", "posttime": "2022-02-17 13:44:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bash,federal,访问", "title": "在这篇文章中，我同意联邦政府和bash VPN的观点，以获得乐趣和利润", "title_en": "In which I agree with the federal government and bash VPNs for fun and profit", "transed": 1, "url": "https://www.bastionzero.com/blog/bashing-vpns-for-fun-and-profit", "via": "", "real_tags": ["bash", "federal", "访问"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "移动应用是我们日常生活的核心部分。目前，谷歌Play上超过90%的应用程序是免费的，为数十亿用户提供了访问有价值内容和服务的途径。数字广告在实现这一点上起着关键作用。但为了确保一个健康的应用生态系统——让用户、开发者和企业受益——该行业必须继续发展数字广告如何改善用户隐私。这就是为什么我们最初开发广告ID是为了给用户更多的控制权。去年，我们对这些控制措施进行了改进，但我们认为进一步改进很重要。\n今天，我们宣布了一项在Android上构建隐私沙箱的多年计划，目标是推出新的、更私密的广告解决方案。具体而言，这些解决方案将限制与第三方共享用户数据，并在没有跨应用标识符（包括广告ID）的情况下运行。我们还正在探索降低隐蔽数据收集可能性的技术，包括应用程序与广告SDK集成的更安全方法。\n安卓系统上的隐私沙箱建立在我们在网络上现有的努力基础上，为改善用户隐私提供了一条明确的道路，同时又不会危及对免费内容和服务的访问。\n​​我们意识到，其他平台对广告隐私采取了不同的做法，直接限制了开发者和广告商使用的现有技术。我们认为，如果不首先提供保护隐私的替代途径，这种方法可能会无效，并导致用户隐私和开发者业务的更糟糕结果。\n我们在安卓系统上使用隐私沙箱的目标是开发有效且增强隐私的广告解决方案，用户知道他们的信息受到保护，开发者和企业拥有在移动设备上取得成功的工具。在我们设计、构建和测试这些新解决方案的同时，我们计划至少在两年内支持现有的ads平台功能，并且我们打算在未来的任何更改之前提供实质性通知。\n从今天开始，开发者可以查看我们最初的设计方案，并在Android开发者网站上分享反馈。我们计划在今年发布开发者预览，年底发布测试版。我们&#39；我们会定期更新设计和时间表，你也可以注册接收更新。\n我们知道这项计划需要整个行业的投入才能成功。我们已经从许多合作伙伴那里听说，他们有兴趣合作改善Android上的广告隐私，并邀请更多组织参与。\n引用Snap Inc.的话&#34；“在Snap，我们把隐私作为一个优先事项，并将其置于我们设计产品的中心。我们很高兴与谷歌合作，为Android开发新的隐私保护标准。”；\n引用Rovio的话：“我们支持谷歌努力提高平台上的隐私标准，同时让用户更容易了解他们的数据是如何被使用的。很好，他们让开发人员尽早参与这一过程，以确保我们有时间做出反应并参与到如此重要的变化中。”\n引用Duolingo的话&#34；“用户隐私是Duolingo的优先事项，我们赞赏Android发布新提案和征求生态系统反馈的审议过程。”\n我们还致力于与监管机构密切合作。我们已经为我们在网络上的隐私沙箱努力做出了公开承诺，包括确保我们不会对谷歌&#39；广告、产品或网站。我们&#39；我将把这些原则应用到我们的Android工作中，并继续与英国竞争和市场管理局等合作。\nAndroid上的隐私沙箱是我们提高用户隐私标准的重要部分，同时为开发者和企业提供在移动设备上取得成功所需的工具。我们期待着在这段旅程中与业界合作。", "note_en": "Mobile apps are a core part of our everyday lives. Currently over 90% of the apps on Google Play are free, providing access to valuable content and services to billions of users. Digital advertising plays a key role in making this possible. But in order to ensure a healthy app ecosystem — benefiting users, developers and businesses — the industry must continue to evolve how digital advertising works to improve user privacy. That’s why we originally developed  advertising ID to give users more control. Last year we  introduced improvements to these controls, but we believe it’s important to go further.\n Today, we’re announcing a multi-year initiative to build the  Privacy Sandbox on Android, with the goal of introducing new, more private advertising solutions. Specifically, these solutions will limit sharing of user data with third parties and operate without cross-app identifiers, including advertising ID. We’re also exploring technologies that reduce the potential for covert data collection, including safer ways for apps to integrate with advertising SDKs.\n The Privacy Sandbox on Android builds on our  existing efforts on the web, providing a clear  path forward to improve user privacy without putting access to free content and services at risk.\n  ​​We realize that other platforms have taken a different approach to ads privacy, bluntly restricting existing technologies used by developers and advertisers. We believe that — without first providing a privacy-preserving alternative path — such approaches can be  ineffective and lead to worse outcomes for user privacy and developer businesses.\n Our goal with the Privacy Sandbox on Android is to develop effective and privacy enhancing advertising solutions, where users know their information is protected, and developers and businesses have the tools to succeed on mobile. While we design, build and test these new solutions, we plan to support existing ads platform features for at least two years, and we intend to provide substantial notice ahead of any future changes.\n  Starting today, developers can review our initial design proposals and share feedback on the  Android developer site. We plan to release developer previews over the course of the year, with a beta release by the end of the year. We&#39;ll provide regular updates on designs and timelines, and you can also  sign up to receive updates.\n We know this initiative needs input from across the industry in order to succeed. We’ve already heard from many partners about their interest in working together to improve ads privacy on Android, and invite more organizations to participate.\n  Quote from Snap Inc. saying &#34;“At Snap, we&#39;ve made privacy a priority and placed it at the center of how we design our products. We are excited to collaborate with Google to develop new privacy-preserving standards for Android.&#34;\n  Quote from Rovio saying “We support Google&#39;s effort to elevate privacy standards on the platform, while making it easier for users to understand how their data is being used. It&#39;s great they are involving developers in the process early to make sure we have time to react and participate in such an important change.”\n  Quote from Duolingo saying &#34;“User privacy is a priority for Duolingo and we appreciate the deliberative process Android is taking to publish new proposals and solicit feedback from the ecosystem.”\n  We’re also committed to working closely with regulators. We’ve offered public  commitments for our Privacy Sandbox efforts on the web, including ensuring that we don’t give preferential treatment to Google&#39;s ads products or sites. We&#39;ll apply these principles to our Android work as well, and continue working with the U.K. Competition and Markets Authority, and others.\n The Privacy Sandbox on Android is an important part of our mission to raise the bar for user privacy, while giving developers and businesses the tools they need to succeed on mobile. We look forward to working with the industry on this journey.", "posttime": "2022-02-17 13:42:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,安卓,sandbox,开发者", "title": "安卓上的隐私沙箱", "title_en": "The Privacy Sandbox on Android", "transed": 1, "url": "https://blog.google/products/android/introducing-privacy-sandbox-android/", "via": "", "real_tags": ["android", "安卓", "sandbox", "开发者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073834, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN订户已向您提供以下仅限订阅的内容。成千上万的订阅者依靠LWN从Linux和自由软件社区获得最好的消息。如果您喜欢这篇文章，请考虑订阅LWN。感谢您访问LWN。网\n与计算领域的大多数组件一样，网络硬件随着时间的推移稳步增长。事实上，今天&#39；s的高端网络接口通常比其所连接的系统处理数据的速度更快。网络开发人员多年来一直致力于提高其子系统的可扩展性；当前的项目之一是Eric Dumazet和Coco Li开发的大型TCP补丁集。大TCP不是&#39；但在某些情况下，它有可能显著提高网络性能。想象一下，你正在努力跟上100Gb/s网络适配器的步伐。正如网络开发者Jesper Brouer在2015年所描述的那样，如果一个人使用的是1538字节的长期最大数据包大小，全速运行接口意味着每秒要处理800多万个数据包。在这个速率下，CPUH需要大约120N的时间来处理每个数据包，这并不需要很多时间；一次缓存未命中可能会破坏整个处理时间预算。不过，如果数据包的数量减少，情况会变得更好，而这可以通过使数据包变大来实现。因此，毫不奇怪，高性能网络安装，尤其是局域网，在局域网中，所有东西都作为一个单元进行管理，使用更大的数据包大小。通过适当的配置，可以使用最大为64KB的数据包，从而大大改善了这种情况。但是，在以兆字节或千兆字节为单位移动数据的环境中（或者更多——cat视频一直在变大），系统仍然需要处理大量数据包。数据包计数在很多方面都是有害的。在系统中传输的每个数据包都有一个重要的固定溢出。每个包必须在网络堆栈中找到自己的路径，从上层协议层到接口的设备驱动程序（或背面）。更多的数据包意味着来自网络适配器的中断更多。sk#buffstructure（&#34；SKB&#34；）用于在内核中表示数据包的是一个大型Beast，因为它必须能够支持可能正在使用的任何网络功能；这会导致每个包的内存使用和内存管理成本显著增加。因此，至少对于某些类型的应用程序，我们有充分的理由希望能够以更少、更大的数据包移动数据。IP分组的长度存储在IP报头中；对于IPv4和PV6，该长度都存在于16位字段中，将最大数据包大小限制为64KB。在设计这些协议时，一个64kb的数据包可能需要几秒钟才能在可用的主干网线上传输，因此它看起来一定是一个非常大的数字；当然，64KB比任何人理性地想要放入一个数据包的容量都要多。但时代变了，64KB现在似乎是一个非常低的限制。对这个问题的认识并不是最近才开始的：1999年采用的RFC 2675中有一个解决方案（至少是IPv6）。IPv6规范允许放置&#34；一步一步地&#34；带有附加信息的标题；顾名思义，逐跳标头用于在两个直接连接的系统之间传递选项。RFC 2675通过对协议进行几处调整来实现更大的数据包。发送&#34；jumbo和#34；数据包时，系统必须将（16位）IPpayload length字段设置为零，并添加包含实际有效负载长度的逐跳标头。该报头中的长度字段是32位，这意味着巨型数据包最多可以包含4GB的数据；这对每个人来说都应该足够了。当连接的最大传输单元（MTU）设置得非常高时，大型TCP补丁集增加了生成和接受巨型数据包所需的逻辑。不出所料，要想让它真正发挥作用，有很多细节需要管理。更重要的问题之一是，任何大小的数据包都很少存储在物理上连续的内存中，这通常很难获得。对于零拷贝操作，缓冲区位于用户空间，数据包保证通过物理内存分散。因此，数据包被表示为一组&#34；碎片&#34；，每个页面可以短至一（4KB）；网络接口处理从传输中收集数据包的任务（或在收到数据包时将其分割）。当前内核将存储在SKB中的片段数量限制为17，这足以将64KB的数据包存储在单页块中。这一限制显然会干扰更大数据包的创建，因此patch set将最大片段数提高到45个。但是，asAlexander Duyck指出，许多接口驱动程序对一个数据包可能被拆分成的最大片段数的假设进行编码。他说，在不修复驱动程序的情况下提高这一限制可能会导致性能下降，甚至导致硬件锁定。经过一些讨论，Dumazet建议通过添加一个配置选项来解决这个问题，该选项控制任何给定数据包允许的最大片段数。对于构建自己内核的站点来说，这是很好的，而这一功能的潜在用户相对来说很可能会这样做。不过，它对分销商几乎并没有帮助，他们必须为所有用户的这个选项选择一个值。在任何情况下，许多驱动程序都需要更新以处理巨型数据包。现代网络接口执行分段卸载，这意味着创建单个数据包的大部分工作是在接口本身内完成的。使用大型打包机进行分段卸载，只需进行少量调整；一些驱动程序在批处理集中更新。另一个小问题与RFC 2675逐跳标头的放置有关。根据IPv6标准，这些报头位于IP报头的中间位置；这可能会让那些&#34；知道&#34；可以在apacket中的IP头之后立即找到TCP头。tcpdump实用程序在这方面存在一些问题；似乎还有相当多的BPF项目包含了这种假设。因此，即使底层硬件和链路可以处理这些数据包，在默认情况下也会禁用巨型数据包处理。Dumazet在发布补丁时提供了一些简短的基准测试结果。实现185000字节的数据包大小可以将网络吞吐量提高近50%，同时还可以显著减少往返延迟。因此，BIGTCP似乎是一个值得拥有的选项，至少在使用高速链路并能可靠传输大数据包的环境（例如数据中心）中是这样。如果明天&#39；美国的猫视频来得更快一些，大TCP可能是原因之一。见杜马泽&#39；s2021 Netdev将就此主题进行讨论，了解更多详细信息。（登录发表评论）\n这与现代文件系统在使用现代存储的全部带宽时遇到的问题没有太大区别。不是&#39；根本问题不一样吗？CPU的速度并没有加快，但其他硬件的速度却在加快，因此抽象层必须尽可能少地工作，算法必须非常高效。操作系统开发非常有趣的时刻。\n硬盘的I/O速度也没有明显提高。它&#39；它实际上开始成为一个问题，因为随着HDD变得更大而不是更快，存储空间与I/O带宽的比率变得非常偏向前者，因此大量HDD不会&#39；我们没有足够的总带宽来大规模使用。你可以通过购买大量小型硬盘来解决这个问题，但那&#39；它是如此昂贵（每GB）以至于你&#39；我们最好还是买SSD吧。因此，我们&#39；重新开始看到SSD的使用增加，即使在硬盘寻找时间本来可以接受的领域，硬盘有时会降级到&#34；酷&#34；存储和批处理。（以上描述了我在超大规模服务方面的经验。对于&#34；普通规模的&#34；服务，你&#39；可能可以使用一个或十个硬盘，但如果你突然决定建立自己的私人YouTube，你至少应该运行这些数字，以防万一。）\n我相信&#34；现代化的存储&#34；2022年，每台NVMe驱动器的IOPS均达到500万次。\n对于许多用例来说，这仍然是非常昂贵的（目前）；HDD（甚至磁带）仍有大量发展。例如，一些供应商开始部署多驱动器硬盘（我们最近在Linux中得到了支持），因此您可以同时进行多个读/写操作——显然是&#39；它仍然比flash慢。\n100Gb/s的NIC和交换机也是如此，所以目前它们都不是消费者级的。\n嗯，无可否认，我的家庭系统不是&#39；我不像很多人。。。但我重新组织了（就像去年存档的那样）大量邮件列表，值得注意的是，即使在雷鸟回来说&#34；完成&#34；，磁盘子系统——raid-5阵列——正在拼命追赶。有32GB的ram，只要它能缓存所有优秀的I&#39；我不担心，但它&#39；知道这一点还是有点吓人&#39；尽可能快地刷新磁盘队列中的大量内容。。。\n即使在我2007年开始在谷歌工作时，这也是一个问题；磁盘变得如此之大，以至于像恢复之类的东西都成了问题。所以问题一直存在，它&#39；随着问题越来越严重，它只是慢慢地进入更“正常”的问题领域。\n2022年2月15日17:45 UTC（星期二）由rgmoore发布（✭ 支持者✭, #[链接]\n我假设，对于YouTube这样的东西，最终的解决方案涉及多个级别的缓存，在延迟和成本之间进行不同的权衡。对于一个主要通过浏览来访问的网站，你可以根据&#39；关于用户&#39；屏幕，并可以相应地预填充缓存。我&#39；我确信有工程师的全部工作就是优化这种行为。这也让我想知道，一些可怕的YouTube算法是不是&#39；t试图引导观众进入&#39；现在很流行，因为它&#39；它肯定在缓存中可用。\n与我的谷歌帽对话：说最终解决方案涉及&#34；多级缓存&#34；就像说一场魔法游戏：聚会涉及多个规则。[1] 除此之外，我&#39；I’我真的没有评论的自由，但我可以在[2]向您介绍公司关于推荐系统工作原理的官方热线。[3] [1]见https://media.wizards.com/2022/downloads/MagicCompRules%2...对于MTG规则。但是唐&#39；我不会真的去读它们，因为它们&#39；re用于解决特定问题，而不是作为&#34；这里&#39；这就是如何玩这个游戏&#34；起点。[2]:  https://blog.youtube/inside-youtube/on-youtubes-recommend...[3]：链接的博客帖子是Google/YouTube&#39；他在这件事上的官方立场，可能并不反映我个人的观点（我对讨论这个问题没有兴趣）。它&#39；S也从2021年9月开始，所以事情从那时开始可能已经改变了。\n&gt；实现185000字节的数据包大小可以将网络吞吐量提高近50%&#34；吞吐量#34；涉及通过DMA从NIC上获取大的TCP数据包，对于如此多的数据，可能是分散-聚集类型。它&#39；值得注意的是，这些传输的速度足以使速度提高50%。\n&gt；当前内核将存储在SKB中的片段数量限制为17个，即&gt；足以在单页块中存储64KB的数据包。该限制将&gt；显然会干扰更大数据包的创建，因此补丁集会引发&gt；碎片的最大数量（到45）。但是，正如亚历山大·杜伊克指出的那样，&gt；许多接口驱动程序对最大片段数的假设进行编码&gt；一个数据包可以被分成几个部分。在不修正&gt；他说，驱动程序可能会导致性能下降，甚至导致硬件锁定；她说&gt&gt；经过一些讨论后，Dumazet建议通过添加一个&gt；配置选项，用于控制&gt；任何给定的包。对于构建自己内核的网站来说，这很好，因为&gt；这项功能的潜在用户相对来说更可能这样做。它提供的服务很少&gt；不过，对于分销商，他们必须为所有&gt；他们的用户。嗯，听起来很像块层中的&#34；阻塞队列限制&#34；；其中，每个实现块层接口的低级驱动程序也为该特定队列提供了一组限制，除其他外，还包括该队列的分散-聚集列表的外观，以便底层设备能够实际处理它。例如，一些设备可以&#39；t处理多页分散元素，而其他元素可以；有些在单个列表中有分散元素的上限，以此类推。这样就没有&#39；不必是单个配置开关和/或整个内核的旋钮。\n&gt；软件&#34；知道&#34；TCP报头可以在数据包的IP报头之后立即找到。\n我在此确认，在20世纪80年代，64KB的数据包对我来说似乎太大了\nRFC2675在IPv6中为4GB数据包添加了32位字段，那么IPv4呢，IPv4怎么能处理超过16位长度的数据包呢？我仍然不知道&#39；我不明白这是怎么回事。\n传统技术可以&#39；不能做超过16位的数据包长度；如果你需要网络上的巨型数据包，你必须升级到IPv6。\n实现这样的更改的一个问题是使用全局设置，这对一个设置来说控制太多。例如，增加MTU的问题。它&#39；很难改变MTU，因为它&#39；s用于控制接收数据包大小和发送数据包大小。局域网上的每个人都必须同意MTU，因为交换机不&#39；t在ICMP或（对于IPv4）碎片域中运行。那么，如果一个&#39；s公司的主干网已发展到显著更高的带宽，但仍会丢弃一小部分数据包，TCP流量控制算法基于延迟限制传输。更大的MTU会有所帮助，但实现这一点需要在参与对话的每个子网中设立一个卖旗日。如果一个人可以改变系统，接受更大的MTU，但不发送更大的MTU，那么卖旗日就不是&#39；t必需，因为每个系统都可以配置为接受较大的MTU，但不能传输它们。一旦每个系统都被更改，那么路由器端口和端点系统就可以更改为更大的MTU。我希望BIG TCP也能做类似的事情，首先可以将系统配置为在发送之前接受BIG TCP，这样可以避免在卖旗日要求实现它。除了点对点通信，每个系统都需要数年才能使用大型TCP。理想情况下，它可以基于连接对而不是交换机控制的以太网帧大小限制来实现。", "note_en": "The following subscription-only content has been made available to you by an LWN subscriber. Thousands of subscribers depend on LWN for the best news from the Linux and free software communities. If you enjoy this article, please consider  subscribing to LWN. Thank youfor visiting LWN.net!\n Like most components in the computing landscape, networking hardware hasgrown steadily faster over time. Indeed, today&#39;s high-end networkinterfaces can often move data more quickly than the systems they areattached to can handle. The networking developers have been working foryears to increase the scalability of their subsystem; one of the currentprojects is  theBIG TCP patch set from Eric Dumazet and Coco Li. BIG TCP isn&#39;t foreverybody, but it has the potential to significantly improve networkingperformance in some settings. Imagine, for a second, that you are trying to keep up with a 100Gb/snetwork adapter. As networking developer Jesper Brouer  described back in 2015, if one is using the longstandingmaximum packet size of 1,538 bytes, running the interface at full speedmeans coping with over eight-million packets per second. At that rate, CPUhas all of about 120ns to do whatever is required to handle each packet,which is not a lot of time; a single cache miss can ruinthe entire processing-time budget. The situation gets better, though, if the number of packets is reduced, andthat can be achieved by making packets larger. So it is unsurprising thathigh-performance networking installations, especially local-area networkswhere everything is managed as a single unit, use larger packet sizes.With proper configuration, packet sizes up to 64KB can be used, improving the situationconsiderably. But, in settings where data is being moved in units ofmegabytes or gigabytes (or more — cat videos are getting larger all thetime), that still leaves the system with a lot of packets to handle. Packet counts hurt in a number of ways. There is a significant fixedoverhead associated with every packet transiting a system. Each packetmust find its way through the network stack, from the upper protocol layersdown to the device driver for the interface (or back). More packets means moreinterrupts from the network adapter. The  sk_buffstructure (&#34;SKB&#34;) used to represent packets within the kernel is a largebeast, since it must be able to support just about any networking feature that may be in use; that leads to significant per-packetmemory use and memory-management costs. So there are good reasons to wishfor the ability to move data in fewer, larger packets, at least forsome types of applications. The length of an IP packet is stored in the IP header; for both IPv4 andIPv6, that length lives in a 16-bit field, limiting the maximumpacket size to 64KB. At the time these protocols were designed, a 64KBpacket could take multiple seconds to transmit on the backbone Internetlinks that were available, so it must have seemed like a wildly large number;surely 64KB would be more than anybody would ever rationally want to put intoa single packet. But times change, and 64KB can now seem like acripplingly low limit. Awareness of this problem is not especially recent: there is a solution(for IPv6, at least) to be found in  RFC 2675,which was adopted in 1999. The IPv6 specification allows the placement of &#34;hop-by-hop&#34;headers with additional information; as the name suggests, a hop-by-hopheader is used to communicate options between two directly connectedsystems. RFC 2675 enables larger packets with a couple of tweaks tothe protocol. To send a &#34;jumbo&#34; packet, a system must set the (16-bit) IPpayload length field to zero and add a hop-by-hop header containing thereal payload length. The length field in that header is 32 bits,meaning that jumbo packets can contain up to 4GB of data; that shouldsurely be enough for everybody. The BIG TCP patch set adds the logic necessary to generate and accept jumbopackets when the maximum transmission unit (MTU) of a connection is setsufficiently high. Unsurprisingly, there were a number of details tomanage to make this actually work. One of the more significant issues isthat packets of any size are rarely stored in physically contiguous memory,which tends to be hard to come by in general. For zero-copy operations,where the buffers live in user space, packets are guaranteed to bescattered through physical memory. So packets are representedas a set of &#34;fragments&#34;, which can be as short as one (4KB) page each;network interfaces handle the task of assembling packets from fragments ontransmission (or fragmenting them on receipt). Current kernels limit the number of fragments stored in an SKB to 17,which is sufficient to store a 64KB packet in single-page chunks. Thatlimit will clearly interfere with the creation of larger packets, so thepatch set raises the maximum number of fragments (to 45). But, asAlexander Duyck  pointedout, many interface drivers encode assumptions about the maximum numberof fragments that a packet may be split into. Increasing that limitwithout fixing the drivers could lead to performance regressions or evenlocked-up hardware, he said. After some discussion, Dumazet  proposedworking around the problem by adding a configuration option controlling themaximum number of allowed fragments for any given packet. That is fine forsites that build their own kernels, which prospective users of this feature are relatively likely to do. It offers little help fordistributors, though, who must pick a value for this option for all oftheir users. In any case, many drivers will need to be updated to handle jumbo packets.Modern network interfaces perform segmentation offloading, meaning thatmuch of the work of creating individual packets is done within theinterface itself. Making segmentation offloading work with jumbo packetstends to involve a small number of tweaks; a few drivers are updated in thepatch set. One other minor problem has to do with the placement of the RFC 2675hop-by-hop header. These headers, per the IPv6 standard, are placedimmediately after the IP header; that can confuse software that &#34;knows&#34;that the TCP header can be found immediately after the IP header in apacket. The  tcpdump utility has some problems in this regard; italso seems that there are a fair number of BPF programs in the wild thatcontain this assumption. For this reason, jumbo-packet handling isdisabled by default, even if the underlying hardware and link could handlethose packets. Dumazet included some brief benchmark results with the patch posting.Enabling a packet size of 185,000 bytes increased network throughput bynearly 50% while also reducing round-trip latency significantly. So BIGTCP seems like an option worth having, at least in the sort of environments(data centers, for example) that use high-speed links and can reliablydeliver large packets. If tomorrow&#39;s cat videos arrive a little morequickly, BIG TCP may be part of the reason. See  Dumazet&#39;s2021 Netdev talk on this topic for more details.         ( Log in to post comments)\n  This is not too different from the problems that modern file systems have using the full bandwidth of modern storage. Isn&#39;t the root problem the same? CPUs are not getting faster, but other hardware pieces are, so abstraction layers have to do as little as possible and algorithms have to be extremely efficient. Very interesting times for operating system development.\n HDD I/O speeds are not getting significantly faster, either. It&#39;s actually starting to become a bit of a problem, because the ratio of storage space to I/O bandwidth has gotten extremely biased in favor of the former as HDDs get bigger but not faster, so a large fleet of HDDs doesn&#39;t have enough overall bandwidth to be useful at scale. You could work around this by buying a lot of small HDDs, but that&#39;s so expensive (per gigabyte) that you&#39;re probably better off just buying SSDs instead. As a result, we&#39;re starting to see increased use of SSDs even in domains where HDD seek time would otherwise be acceptable, and HDDs are sometimes getting relegated to &#34;cool&#34; storage and batch processing.  (The above describes my experience with extremely large-scale services. For &#34;normal-sized&#34; services, you&#39;re probably fine with an HDD or ten, but if you&#39;ve suddenly decided to build your own private YouTube, you should at least run the numbers, just in case.)\n I believe &#34;modern storage&#34; in 2022 are NVMe drives capable of 5 million IOPS each.\n For many use-cases thats still just way too expensive (for the moment); and there is plenty of development still happening in HDDs (even tapes). For example, some vendors starting to deploy multi-actuator HDDs (we recently got support for that in Linux), so you can have multiple reads/writes concurrently - obviously that&#39;s still slower than flash.\n Well so are 100Gb/s NICs and switches so neither one is consumer level driven at the moment.\n Well, admittedly my home system isn&#39;t configured like a lot of them ...  But I reorganised (as in archived last year&#39;s) loads of mailing lists, and it was noticeable that even after Thunderbird came back and said &#34;finished&#34;, that the disk subsystem - a raid-5 array - was desperately struggling to catch up. With 32GB of ram, provided it caches everything fine I&#39;m not worried, but it&#39;s still a little scary knowing there&#39;s loads of stuff in the disk queue flushing as fast as possible ...\n  This was a problem even when I started in Google in 2007; disks were getting so large that anything like recovery or the likes was getting problematic. So the problem has been there all along, it&#39;s just moving slowly into more “normal” problem domains as the problem gets worse and worse.\n  Posted Feb 15, 2022 17:45 UTC (Tue) by  rgmoore ( ✭ supporter ✭, #75) [ Link]\n  I assume that with something like YouTube, the final solution involves multiple levels of caching with different tradeoffs between latency and cost. With a site that is accessed mostly by browsing, you can get advance notice of what items are likely to be looked at soon based on what&#39;s on the users&#39; screens and can pre-populate the cache accordingly. I&#39;m sure there are engineers whose whole job is to optimize this behavior. It also makes me wonder if some of the dreaded YouTube algorithm isn&#39;t built around trying to steer viewers into stuff that&#39;s popular right now because it&#39;s sure to be available in cache.\n Speaking with my Google hat on: Saying that the final solution involves &#34;multiple levels of caching&#34; is like saying that a game of Magic: The Gathering involves multiple rules.[1] Beyond that I&#39;m not really at liberty to comment, but I can point you at [2] for the official company line on how the recommendation system works.[3]  [1] See  https://media.wizards.com/2022/downloads/MagicCompRules%2... for the MTG rules. But don&#39;t actually try to read them, because they&#39;re intended to be used for resolving specific issues, not as a &#34;here&#39;s how to play the game&#34; starting point. [2]:  https://blog.youtube/inside-youtube/on-youtubes-recommend... [3]: The linked blog post is Google/YouTube&#39;s official position on the matter, and may not be reflective of my own personal views (which I have no interest in discussing). It&#39;s also from September 2021, so things may have changed since then.\n  &gt; Enabling a packet size of 185,000 bytes increased network throughput by nearly 50%  Presumably &#34;throughput&#34; involves getting the BIG TCP packet off the NIC via DMA, probably of the scatter-gather variety for so much data. It&#39;s remarkable that the speed of these transfers is sufficient for a 50% speed-up.\n  &gt; Current kernels limit the number of fragments stored in an SKB to 17, which is  &gt; sufficient to store a 64KB packet in single-page chunks. That limit will  &gt; clearly interfere with the creation of larger packets, so the patch set raises  &gt; the maximum number of fragments (to 45). But, as Alexander Duyck pointed out,  &gt; many interface drivers encode assumptions about the maximum number of fragments  &gt; that a packet may be split into. Increasing that limit without fixing the  &gt; drivers could lead to performance regressions or even locked-up hardware, he  &gt; said.  &gt;   &gt; After some discussion, Dumazet proposed working around the problem by adding a  &gt; configuration option controlling the maximum number of allowed fragments for  &gt; any given packet. That is fine for sites that build their own kernels, which  &gt; prospective users of this feature are relatively likely to do. It offers little  &gt; help for distributors, though, who must pick a value for this option for all of  &gt; their users.   Hmm, sounds a lot like what we have in the block layer with &#34;block queue limits&#34;; where each low level driver that implements an interface to the block layer also provides a set of limits for this specific queue, also - among other things - including how the scatter-gather list of this queue must look like so the underlying device can actually deal with it. For example some devices can&#39;t deal with multi-page scatter-elements, while other can; some have a upper limit of scatter-elements in a single list, and so on. This way there doesn&#39;t have to be a single config switch and/or a kernel wide knob.\n  &gt; software that &#34;knows&#34; that the TCP header can be found immediately after the IP header in a packet.\n  I hereby confirm that 64KB packets seemed insanely large to me in the 1980s. ;-)\n   RFC2675 adds 32bit field for 4GB packets in IPv6, what about IPv4, how can IPv4 ever do more that 16-bit length of packages? I still don&#39;t understand how that can work.\n Legacy technology can&#39;t do more than 16 bit packet lengths; you will have to upgrade to IPv6 if you need jumbo packets on the wire.\n  One of the problems with implementing changes like this is the use of global settings which control too much for one setting. Take, for example, the problem of increasing MTU. It&#39;s hard to change the MTU because it&#39;s used both to control receive packet size and transmit packet size. Everyone on a LAN segment has to agree on the MTU because switches don&#39;t operate in the ICMP or (for IPv4) fragmentation domain. So, if one&#39;s corporate backbone has evolved to significantly higher bandwidth, but still drops a small fraction of packets, TCP flow control algorithms limit transmission based on latency. Larger MTUs would help, but implementing that requires a flag day in every subnet participating in a conversation. If one could change systems to accept larger MTUs, but not send larger MTUs, a flag day isn&#39;t required, as every system can be configured to accept larger MTUs, but not transmit them. Once every system has been changed, then the router port and endpoint systems can be changed to larger MTUs.  I hope that BIG TCP does something similar, that one can first configure systems to accept BIG TCP before they are sent, which would avoid flag-day requirements to implement it. Except for point-to-point communication, it will be years before every system can operate with BIG TCP. Ideally, it could be implemented on a connection-pair basis rather than switch-controlled Ethernet frame size limitations.", "posttime": "2022-02-17 13:33:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "包做,tcp,数据包", "title": "用TCP包做大", "title_en": "Going Big with TCP Packets", "transed": 1, "url": "https://lwn.net/SubscriberLink/884104/89d8ccf8f52ad9dc/", "via": "", "real_tags": ["包做", "tcp", "数据包"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073833, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "$date-R Fri，2019年11月29日23:52:02+0100$perl-c星期五。周五下午。pm语法正常⋮$  日期-R Sat，2019年11月30日00:03:06+0100$perl-c星期五。周五下午语法错误。下午12点，周五下午9点。pm有编译错误。", "note_en": "$  date -R Fri, 29 Nov 2019 23:52:02 +0100$  perl -c friday.pm friday.pm syntax OK ⋮$  date -R Sat, 30 Nov 2019 00:03:06 +0100$  perl -c friday.pm syntax error at friday.pm line 12, at EOF friday.pm had compilation errors.", "posttime": "2022-02-17 13:32:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,星期五,code,下午", "title": "仅在星期五语法正确的Perl代码", "title_en": "Perl code that is syntactically correct only on Fridays", "transed": 1, "url": "https://github.com/jwilk/perl-friday", "via": "", "real_tags": ["代码", "星期五", "code", "下午"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073832, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一下，在不进行任何硬件修改的情况下，使用库存3d打印机3d打印多色对象的可能性。这似乎是一个白日梦，但我们今天在这里探索这一令人兴奋的发展。今天&#39；s的多色打印选项需要对机器硬件和软件进行许多修改。目前，生产多色3d打印对象需要多个打印头/工具更换、手动线轴更换或自动灯丝拼接机。Autodrop3d和#39；s的解决方案允许软件控制的颜色变化与股票3d打印机无需硬件修改。\n热致变色材料具有与颜色和热量有关的特殊性质。你以前可能见过情绪戒指。这是一种具有热致变色特性的材料。随着材料温度的改变，颜色也随之改变。这种热致变色材料在3d打印中没有用处，因为它只是根据当前温度改变颜色。\nAutodrop3d正在寻找灯丝制造合作伙伴，将这项正在申请专利的技术商业化。请联系我们讨论授权事宜。\nAutodrop3d正在申请专利的多色打印方法的神奇之处在于通过改变打印温度来设置材料颜色。有一些热致变色材料允许以稳定的方式设置颜色，允许在材料加热超过特定设定点后持续改变颜色。这种特性的一个例子可以在可擦除笔产品中看到。可擦笔利用摩擦产生的热量使墨水透明。要使墨水再次可见，只需将纸张冻结，墨水的颜色就会恢复。  ​ 我们使用的热致变色材料有两种温度，它们会触发颜色变化。一个温度低于冰点，另一个温度在所用特定塑料的可打印温度范围内。这使得仅通过改变热端的温度就可以打印材料并选择性地改变打印部分的颜色。\n使用打印温度定义的颜色打印的多色对象，无需修改机器硬件。\nAutodrop3d的迈克·莫利纳里（Mike Molinari）正在调查多色3d打印的状态，并寻找一种在库存FDM打印机上轻松生成多色打印的方法。在寻找并发现市场上无需额外挤出机、长丝拼接机、手动更换长丝或伺服驱动永久标记机即可运行的良好选项后。FDM机器上的打印头温度在打印过程中可能会发生变化，并且存在可以通过加热改变颜色的材料。经过多次实验，迈克能够将变色材料混合到塑料聚合物中，以证明其可行性。将变色材料混合到塑料聚合物中是容易的部分，但挤出长丝是一个复杂的工艺，最好留给专家。制造灯丝既是一门艺术，也是一门科学，它根据材料直径的实时测量来控制速度、温度、张力、冷却和主动调谐。我们联系了youtube上有名的3d打印能手乔尔，看看他是否愿意尝试将我们的塑料挤出长丝机。乔尔有了一个更好的想法，并能够将我们与Proto意大利面公司的专家联系起来，将这一概念变为现实。点击这里观看视频，记录生产冒险和第一次概念验证的结果。\n下面的结果显示了模型的两个部分打印了两种不同温度的对象。正如你所看到的，虽然透明部分和有色部分之间的对比度不是很高，但只需要测试不同比例的颜色添加剂。", "note_en": "Imagine the possibilities for 3d printing multi-color objects using a stock 3d printer with no hardware modifications whatsoever. This might seem like a pipe dream but we are here today to explore this exciting development.   Today&#39;s options for multi-color printing require many modifications to machine hardware and software. Multiple print-heads / tool changes, manual human spool swaps or automated filament splicing machines are currently required to produce multi-color 3d printed objects.  Autodrop3d&#39;s solution allows for software controlled color changes with stock 3d printers requiring no hardware modifications.\n  Thermochromatic materials have special properties related to color and heat.  You might have seen mood rings before. That is an example of a material with thermochromatic properties. As the temperature of the material is changed the color is altered. This kind of thermochromatic material is not useful in 3d printing as it simply changes color based on the current temperature.\n  Autodrop3d is looking for filament manufacturing partners to commercialize this patent pending technology. Please reach out discuss licencing.\n   The magic of Autodrop3d patent pending approach to multi color printing is the ability to set the material color by altering the print temperature.   There are some thermochromatic materials that allow for the color to be set in a stable way allowing for a persistent change in color after the material is heated beyond a particular set point. An example of this property can be seen in erasable pen products. Erasable pens use heat generated by friction to make the ink transparent. To make the ink visible again all one has to do is freeze the paper and the color will be restored to the ink.  ​ The thermochromatic materials we are using have two temperatures that trigger a color change. One is below freezing and the other is within the printable temperature of the particular plastic being used. This makes it possible to print the material and selectively change the color of portions of the print just by changing the temperature of the hot end.\n   Multi color object printed with color defined by print temperature with no machine hardware modifications.\n   Mike Molinari with Autodrop3d was investigating the state of multi-color 3d printing and looking for a way to easily produce multi color prints on stock FDM printers. After looking and finding no good options available on the market that operated with out the need extra extruders, filament splicers, manual filament changes or servo driven permanent markers inspiration struck.  The print head temperature on FDM machines can be changed during the print and there exists materials that can have their color modified by heat.   After much experimentation Mike was able to blend the color changing material in to a plastic polymer to demonstrate viability. Blending the color changing material in to the plastic polymer was the easy part but extruding filament is a complicated craft best left to experts. Making filament is as much an art as it is a science controlling speed, temperatures, tension, cooling and active tuning based on real time measurements of material diameters.  We reached out to Joel, the 3d printing nerd of youtube fame to see if he might be willing to try pushing our plastic through a filament extruding machine. Joel had a better idea and was able to connect us with the experts at Proto-pasta to bring the concept to reality.  Click here to see  video documenting the manufacturing adventure and the results of the first proof of concept.\n    The results below show an object printed with 2 different temperatures for the 2 portions of the model. As you can see it worked and while the contrast between the transparent and colored portions is not very high it will only be a matter of testing different ratios of the color additive.", "posttime": "2022-02-17 13:31:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,可编程,programmable,颜色", "title": "可编程灯丝", "title_en": "Programmable Filament", "transed": 1, "url": "https://www.autodrop3d.com/programmable-filament.html", "via": "", "real_tags": ["编程", "可编程", "颜色"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：高频晶体管是毫米波通信和传感器系统的基本组成部分。石墨烯中载流子的高速率和迁移率为超高速IV族晶体管开辟了道路，其性能与III-V基半导体类似，甚至更好。然而，由于制造问题、相邻材料的影响和自热效应，高速石墨晶体管的发展受到阻碍。在这里，我们报道了一种在金刚石衬底上的石墨烯场效应晶体管（FET），对于500 nm的玛瑙长度，它的f_{max}$高达54 GHz。金刚石的高导热性提供了有效的热沉，其相对较高的光学声子能量提高了石墨烯通道中载流子的饱和速度。此外，我们还发现，在不同的栅长下，金刚石上的石墨烯场效应晶体管表现出优异的结垢性能。这些结果表明，采用金刚石技术的石墨烯场效应晶体管可以达到亚太赫兹频率性能。\n从Muhammad Asad [查看电子邮件] [V1]星期四，2021年6月17日11:46:43 UTC（3010 KB）[V2]星期日，2021年6月20日21:12:04 UTC（3007 KB）[V3]星期四，2021年12月30日20:41:58 UTC（1574 KB）\n书目工具代码；关于arXivLabs的数据相关论文arXivLabs是一个框架，允许合作者直接在我们的网站上开发和共享新的arXiv功能。\n与arXivLabs合作的个人和组织都接受了我们的开放、社区、卓越和用户数据隐私价值观。arXiv致力于这些价值观，只与遵守这些价值观的合作伙伴合作。\n对一个能为arXiv增值的项目有一个想法&#39；s社区？了解更多关于arXivLabs以及如何参与的信息。", "note_en": "Download PDF  Abstract: Transistors operating at high frequencies are the basic building blocks ofmillimeter-wave communication and sensor systems. The high velocity andmobility of carriers in graphene can open way for ultra-fast group IVtransistors with similar or even better performance than can be achieved withIII-V based semiconductors. However, the progress of high-speed graphenetransistors has been hampered due to fabrication issues, influence of adjacentmaterials, and self-heating effects. Here, we report a graphene field-effecttransistor (FET) on a diamond substrate, with a $f_{max}$ up to 54 GHz for agate length of 500 nm. The high thermal conductivity of diamond provides anefficient heat-sink, and its relatively high optical-phonon energy improvessaturation velocity of carriers in the graphene channel. Moreover, we show thatgraphene FETs on diamond, with different gate lengths, exhibit excellentscaling behavior. These results indicate that graphene FETs on diamondtechnology can reach sub-terahertz frequency performance.\n  From: Muhammad Asad [ view email]     [v1] Thu, 17 Jun 2021 11:46:43 UTC (3,010 KB)    [v2] Sun, 20 Jun 2021 21:12:04 UTC (3,007 KB)  [v3]Thu, 30 Dec 2021 20:41:58 UTC (1,574 KB)\n      Bibliographic Tools      Code &amp; Data      Related Papers       About arXivLabs   arXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\n  Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\n  Have an idea for a project that will add value for arXiv&#39;s community?   Learn more about arXivLabs and   how to get involved.", "posttime": "2022-02-17 13:29:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "金刚石,fet,晶体管", "title": "高频电子学用金刚石石墨烯场效应管（2021）", "title_en": "Graphene FET on diamond for high-frequency electronics (2021)", "transed": 1, "url": "https://arxiv.org/abs/2106.09412", "via": "", "real_tags": ["金刚石", "fet", "晶体管"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位超级明星投资者可能在Nubank等数字金融服务提供商身上看到了一种完全不同的机会。", "note_en": "The superstar investor may be seeing an entirely different kind of opportunity in digital financial service providers like Nubank.", "posttime": "2022-02-17 13:29:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "巴菲特,warren,buffett,投资者", "title": "沃伦·巴菲特（Warren Buffett）刚刚向一家加密友好型银行投资了10亿美元", "title_en": "Warren Buffett just invested $1B in a crypto-friendly bank", "transed": 1, "url": "https://fortune.com/2022/02/16/warren-buffett-invested-1-billion-crypto-bank/", "via": "", "real_tags": ["巴菲特", "warren", "buffett", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在Bishop Fox写了很多报道（这是当你破解所有东西时发生的事情）。这经常导致需要对某些文本进行编辑。我们有一个长期的政策，当你编辑文本时，唯一安全的方法就是使用黑条。有时，人们喜欢变得聪明，尝试其他一些编辑技术，比如模糊、旋转或像素化。但这是一个错误。\n今天，我们将重点介绍一种这样的技术——像素化，并将向您展示为什么这是一种不好、不好、不安全、肯定会泄露敏感数据的方法。为了说明原因，我编写了一个名为Unredacter的工具，它将经过编辑的像素化文本还原为未经编辑的形式。在现实世界中，有很多这样的例子可以用来编辑敏感信息，但我不想在这里指名道姓。观看我的视频，快速回顾从不使用像素编辑文本的重要性，以及我如何取消Jumpseclabs&#39；这是一个实时的挑战。\n因此，有一个名为Depix的现有工具，它试图通过一个非常聪明的过程来实现这一点，即在给定正确字体的De Bruijn序列的情况下，查找像素排列可能会导致某些像素化块。我非常喜欢这个工具的理论，但Jumpsec的一位研究人员指出，也许它在实践中没有你想要的那么好。在现实世界中的例子中，你很可能会得到一些微小的变化和噪音，这会让你的齿轮扭动。然后，他们向任何人发出了挑战，如果你能取消对以下图片的编辑，他们将提供奖励：\n算法非常简单；将图像分割为给定块大小的网格（上面的示例是8x8）。然后，对于每个块，将经过编辑的图像的颜色设置为相同区域原始图像的平均颜色。就是这样——每个块的滚动像素平均值。\n这种效果有点“涂抹”了每个块的图像信息。但是，尽管在这个过程中有些信息丢失了，但它绝对会大量泄露出去。我们将利用这些泄露的信息为自己谋利。\n值得注意的是，由于该算法非常简单，因此被广泛标准化。所以，不管你是在GiMP、Photoshop还是其他工具中进行编辑，编辑结果都是一样的。\n我认为，这些都是相当合理的假设，因为在现实场景中，攻击者可能会收到一份完整的报告，其中只有一份经过编辑。在我们的挑战文本中，你可以在像素文本的正上方看到一些单词，它们为我们提供了这些信息。\n我们关注的关键是编校过程本质上是局部的。在密码学方面，我们可以说它没有扩散。在原始图像的某个地方改变一个像素只会影响它所属的编辑块，这意味着我们可以（大部分）逐个字符地猜测图像。我们将对每个字符进行递归深度优先搜索，根据其与编辑文本的匹配程度对每个猜测进行评分。\n基本上，我们猜测字母“a”，对该字母进行像素化，然后查看它与我们编辑的图像的匹配程度。然后我们猜字母“b”，以此类推。听起来没那么难吧？嗯，还有一大堆后勤问题需要克服，这在一开始可能并不那么明显！让我们进一步深入研究这些问题。\n我们立即遇到的第一个问题是，文本中的字符与编辑块的比例不是1:1。这意味着一个给定的正确猜测可能在最右边有一些错误的块。要了解我的意思，请查看以下示例：\n可以看到字母“t”和“h”共享一列块。所以，如果我们试着猜测字母“t”，最左边的一列结果是正确的，但最右边的一列有点错误。\n第二栏是错误的，因为字母“h”把事情搞砸了。如果我们只看这一点，你可能会得出结论，字母“t”是一个不正确的第一个字母，因为它得到了几乎一半的区块完全错误。\n我们尝试的第一件事是避免计算任何猜测中最右边的区块。这是最容易出错的专栏。问题是，在实践中，它减少了我们猜测的总大小，以至于你开始收到误报。总是有机会，你的信会意外排队，并产生一个纯粹的机会比赛，这个机会走上去，当有更少的块考虑。\n因此，我们所做的是在字母本身的边界处切掉比较块。因此，我们的差异如下所示：\n你可以看到我们比赛的质量有了很大的提高，因为我们在右边的错误区域减少了。这是因为我们在“t”结束的边缘处切掉比较：\n这样做的好处是，我们的猜测字符越多地延伸到块中，块就越有可能是一个好的猜测，因此我们保留了更多的块。因此，当猜测错误时，它会自动切掉大部分块，当猜测正确时，它会保留大部分块。\n角色溢出问题的一个具体子集是，空白往往会打破我们对角色猜测工作原理的一些假设。这个问题的本质是这样一种假设：当我们猜到一个正确的角色时，我们期望得到的像素化版本的角色与挑战图像基本相似。\n然而，当我们猜测的字符是空白时，这并不总是正确的。当这种情况发生时，像素块将被下一个角色完全取代。举个例子，猜测“this is”（后面有空格）：\n然后将其像素化，如下图所示，后面有一个空白列：\n问题是，在解决方案图像中，空格后面还有另一个字符。它流了这么多血，以至于我们正确的猜测看起来是完全错误的！\n解决这个问题的方法不止一种。最明显的是永远不要自己猜测空格，而是将其与其他非空格字符配对。这样我们就可以控制流血的角色。虽然这种方法“有效”，但它有效地将可用字符集增加了一倍。这会让整个过程变得缓慢。\n相反，我们可以做的是为空白猜测做一个特殊的划分，让他们在被认为是“好”猜测的情况下更加宽容。在测试中，似乎溢出从未如此严重，以至于超过了一个较低的阈值。我承认这有点笨拙，但似乎管用。\n人们书写的大多数字体都是可变宽度的。这意味着每个字母占用的水平空间量取决于字母本身。例如，“w”比“i”占用更多空间。这与单空格字体形成对比，单空格字体故意将字母隔开，使每个字母占据相同的水平空间。\n这对我们的攻击（假定为可变宽度字体）意味着，每个猜测的字母在其右侧都有级联效应。如果你猜：\n然后，所有未来的字母都将关闭，即使这些字母在其他方面是“正确的”。\n这听起来很重要，但实际上并不是那么糟糕。这只是意味着我们必须坚持递归深度优先搜索，而不是将字母视为独立的工件。递归深度优先搜索在这里效果很好，因为它自然会考虑这种排序。它的工作原理如下：\n我们要做的是尝试下一个字母的每个字符，看看哪些字符与经过编辑的图像匹配得相当好。我们将得到一些“好”猜测的子集，可能是“p”和“q”，因为p是正确的，q与它非常相似。然后，我们将再次开始猜测新字符串“this is sup”的整个过程，直到我们遇到一个没有好猜测的死胡同。在这一点上，函数调用堆栈将自然备份，以尝试我们的另一个猜测q。\n等等，直到我们用尽所有的“好”猜测。\n碰巧的是，不同的渲染引擎生成的图像略有不同，即使是应该完全相同的字体。看看这两个相同文本的截图。顶部是GiMP的无衬线渲染，底部是FireFox：\n它们几乎一模一样，但并不完全相同。有两件事很突出；一是长度。你可以看到上面的图片只是稍微长一点。对于足够长的字符串，这可能会产生一种级联效应，将整个事情抛诸脑后。另一个区别是文本如何光栅化；底线只是比最上面的要大胆一点。我们可以通过调整亮度来处理这个问题，但这是一个非常痛苦的问题。\n对于Undeacter，我们使用Electron拍摄本地无头HTML窗口的屏幕截图。因此，渲染器基本上是Chrome。大多数时候，这不是问题。但是，如果你的编辑文本是使用一些不符合标准的非常不可靠的程序来呈现的，那么它可能会偏离正常的方向。记住这一点。\n如果有人想通过Rube Goldberg的包装器和宏机器为Unredacter编写一个包装器，使用MS Word生成猜测，欢迎您试一试。\n对图像进行像素化时，必须考虑两个自由度：x和y偏移坐标。但这些到底是什么？\n如果你认为这是一个静态网格，那么有64个不同的位置供你放置文本在该网格上。我们称之为x和y“偏移”。根据您选择的偏移量，它可以生成截然不同的图像：\n此外，攻击者无法知道这些偏移量是什么。（与字体和字号不同）。在大多数编辑器（如GiMP）中，偏移量是由用户在创建边界框时碰巧单击的位置的随机过程确定的。如果他们向上或向下点击一个像素，像素化会产生一个完全不同的图像！\n好消息是，补偿的可能性并不多。有块大小2的排列。如果块大小为8，则需要尝试64个偏移。在我们的挑战文本中，块大小是5，这意味着只有25个偏移需要测试。\n所以，Unredacter的第一步是发现使用了什么偏移量。我们通过在循环中尝试每个偏移量来实现这一点，并查看是否有任何字母给出了一个好的首字母猜测。我们将所有第一个字母猜测正确的偏移量添加到列表中，然后尝试正确的猜测。\n可以有了这些知识和利用这些知识的工具，我们再来看看Jumpsec的挑战图：\n你可能会注意到的第一件事是它有一点奇怪的颜色。有什么好处？既然文本是黑色的，就不应该是黑白的吗？他们在用彩色字母拖拽我们吗？\n实际上，我并不完全确定为什么会发生这种情况（有时不会），但当文本呈现到屏幕上时，这是光栅化过程的产物。只需看看放大记事本中键入的文本时会发生什么：\n当Undercater将字母渲染到无头Chrome窗口时，不会出现彩色瑕疵，因此我们需要将图像转换为灰度。这会丢失一些信息，但没关系。Unredacter不需要精确匹配，只需要猜测“基本正确”。一旦向下转换，我们的挑战图像如下所示：\n我必须做最后一个调整，它在最底层：\n太小了！其余的块是5x5，但最下面一行是5x3。经过几个小时的反复试验，我还注意到这些积木太暗了。查看字母“g”的猜测与挑战图：\n看到最下面一排怎么太暗了吗？这是因为当图像被像素化时，他们一定选择了一个大小不是5倍的边界框。因此，当算法确定平均值时，它是一个较小区域的平均值。（因此更暗）没关系，我们可以通过点亮最后一排来修复它。这给了我们最后一个挑战的形象：\n下一步是找出正确的字体和字号。幸运的是，这并不难，这张图片是在MS Notepad中拍摄的，默认字体为Consoleas。经过一点尝试和错误，我发现字体大小是24px。（我只是反复尝试字体大小，直到大写字母M的高度匹配。）唯一棘手的是，记事本的默认字母间距为-0.2px。如果你试着在控制台中用Chrome渲染文本，那就太长了。但是-0.2px的字母间距正好匹配。\n如果仔细观察，“s”、“e”和“c”在记事本的渲染中有更多的曲线。但没关系。再说一遍，我们不需要100%准确。很接近！\nUnredacter很快就以[3,1]的偏移量进驻，所以让我们看看它是如何做到的！\n所以我联系了Jumpsec的Caleb Herbert，他们确认了我的猜测是正确的！\nCaleb还要求我不要透露解决方案，所以你可以自己尝试一下。（上面的文字模糊了，你根本看不懂模糊的文字，对吧？）向Jumpsec发出了巨大的欢呼声，这是一个很大的挑战。也是测试新工具的好方法！\n如果你想查看Unredacter的概念验证源代码，可以在我们的GitHub上找到。\n底线是，当你需要编辑文本时，用黑条覆盖整个文本。别用别的东西。没有像素化，没有模糊，没有模糊，没有漩涡。哦，一定要把文本编辑成图像。不要错误地更改Word文档，使其具有黑色背景和黑色文本。（你仍然可以通过这样突出显示来阅读。）\n在制作一份优秀的技术文档之后，你最不需要做的事情就是由于不安全的编辑技术而意外地泄露敏感信息。\nDan Petro是Bishop Fox的首席研究员，专注于应用程序渗透测试（静态和动态）、产品安全审查、网络渗透测试（外部和内部）以及密码分析。Dan曾在多个黑帽子和DEF CONs上展示过黑客智能保险箱、劫持谷歌Chromecast和人工智能武器化等主题。他开发了几个开源工具，包括Untwister，它可以分解伪随机数生成器。此外，《连线》、《卫报》、《商业内幕》和《Mashable》都引用了丹的话。Dan拥有亚利桑那州立大学计算机科学学士和硕士学位。\n丹的更多", "note_en": "We write a lot of reports at Bishop Fox (it’s what happens when you hack all the things). This frequently results in needing to redact certain text. We have a long-standing policy that when you redact text, the  onlyway to do it securely is to use black bars. Sometimes, people like to be clever and try some other redaction techniques like blurring, swirling, or pixelation. But this is a mistake.\n Today, we’re focusing on one such technique – pixelation – and will show you why it’s a no-good, bad, insecure, surefire way to get your sensitive data leaked. To show you why, I wrote a tool called  Unredacter that takes redacted pixelized text and reverses it back into its unredacted form. There’s plenty of real-world examples of this in the wild to redact sensitive information, but I won’t name names here. Watch my video for a quick recap of the importance of NEVER using pixelation to redact text, as well as how I unredact Jumpseclabs&#39;s Challenge in real-time.\n  So there’s an  existing tool called Depix that tries to do exactly this through a really clever process of looking up what permutations of pixels could have resulted in certain pixelated blocks, given a  De Bruijn sequenceof the correct font. I like the theory of this tool a lot, but a  researcher at Jumpsec pointed out that perhaps it doesn’t work as well in practice as you’d like. In real-world examples you’re likely to get minor variations and noise that throws a wrench into the gears. They then issued a challenge to anyone, offering a prize if you could un-redact the following image:\n The algorithm is pretty simple; you divide up your image into a grid of a given block size (the example above is 8x8). Then for each block, you set the redacted image’s color equal to the average color of the original for that same area. That’s it – just a rolling pixel average for each block.\n  The effect sort of “smears” the information of the image out across each block. But while some information is lost in the process, it absolutely leaks plenty through. And it’s this leaked information that we’ll be using to our advantage.\n Notably, this algorithm is widely standardized since it’s so simple. So, no matter whether you do this redacting in GiMP, Photoshop, or basically any other tool, the redaction will turn out the same.\n   These are fairly reasonable assumptions, I would assert, since the attacker in a realistic scenario would likely have received a full report, with just one piece redacted out. In our challenge text, you can see a few words right above the pixelated text that give us this information.\n The key thing we’re focusing on is that the redaction process is inherently local. In cryptographic terms, we’d say it has  no diffusion. A change of one pixel somewhere in the original image ONLY impacts the redacted block it belongs to, meaning that we can (mostly) guess the image character by character. We’ll do a recursive depth-first search on each character, scoring each guess by how well it marginally matches up to the redacted text.\n Basically, we guess the letter “a”, pixelate that letter, and see how well it matches up to our redacted image. Then we guess the letter “b”, and so on. Doesn’t sound so hard, right? Well, there’s still a  bunch of logistical issues to overcome that might not be so obvious at first! Let’s dig into those further.\n  The first problem we immediately encountered is that the characters of our text don’t line up 1:1 with the blocks of the redaction. This means that a given correct guess might actually have some wrong blocks on the right-most edge. To see what I mean, check out this example:\n  You can see that the letters “t” and “h” share a column of blocks. So, if we try to make a guess for the letter “t”, the left-most column of blocks turns out correct, but the right-most ones are a bit wrong.\n   The reason the second column is wrong is because the letter “h” is there messing things up. If we just looked at this alone, you might conclude that the letter “t” was an incorrect first letter, since it gets almost half of the blocks totally wrong.\n The first thing we tried was to avoid counting the right-most block of any guess. It’s the column that will have the most bleed-over and can have quite a bit of error. The problem with this was that, in practice, it reduced the total size of our guess by so much that you start receiving false positives. There’s always a chance that your letter will accidentally line up and produce a match by pure chance, and this chance goes way up when there’s fewer blocks to consider.\n So instead, what we did was to chop off the comparison block at the boundary of the letter itself. Thus, our diff would look like this:\n  You can see the quality of our match went way up, since we’re including less of that incorrect area on the right. This is because we chop the comparison off at the edge of where the “t” ends:\n  The benefit to doing it this way is that the more our guess character extends into the block, the more likely the block is to be a good guess, and so we keep more of the block. So, it will automatically chop off most of the block when the guess is bad and keep most of the block when it’s good.\n A specific subset of the character bleed-over problem is that whitespace tends to break a few of our assumptions on how character guessing works. Inherent to this whole problem is the assumption that when we guess a correct character, we expect the resulting pixelated version of it to mostly resemble the challenge image.\n However, this isn’t always true when the character we guess is whitespace. When that happens, the pixelated blocks will be completely overtaken by the next character. Take this example, making the guess “this is ” (with a trailing space):\n  This is then pixelated like below, with a trailing blank column as you’d expect:\n  The problem is that in the solution image, there is another character after the space. It bleeds over so badly that our correct guess looks to be completely wrong!\n  There’s more than one way to tackle this problem. The most obvious is to never make whitespace guesses on its own, and instead pair it up with some other non-whitespace character. That way we can control the character that bleeds over. While this “works”, it effectively doubles the available character set. This slows the whole process down to a crawl.\n Instead, what we can do is make a special carveout for whitespace guesses that give them more leniency in what is considered a “good” guess. In testing, it seemed that the bleed-over is never so bad that it’s beyond a lower threshold. It’s a bit kludge-y, I’ll grant you, but it seems to work.\n Most fonts that people write with are variable width. This means that the amount of horizontal space that each letter takes depends on the letter itself. For instance, a “w” takes up more space than an “i”. This is in contrast to monospace fonts, which deliberately space letters such that each one takes up the same amount of horizontal space.\n      What this means for our attack (which is assumed to be in a variable-width font) is that each guessed letter has a cascading effect to the right of it. If you make the guess:\n  Then all future letters will be off, even if the letters are otherwise “correct”.\n This sounds like a big deal, but it’s actually not so bad. It just means that we have to stick with a recursive depth-first search and not treat letters like individual and independent artifacts. Recursive depth-first search works well here because it naturally takes that ordering into account. It works the following way:\n   What we do is try out each character for the next letter and see which ones match up reasonably well with the redacted image. We’ll wind up with some subset of “good” guesses, perhaps “p” and “q” since p is correct and q resembles it pretty closely. We’ll then begin this whole process of guessing again for the new string of “this is sup” down the chain until we hit a dead end with no good guesses. At which point, the function call stack will naturally back up to try our other guess q.\n And so on, until we’ve exhausted every “good” guess there is.\n As it happens, different rendering engines produce slightly different images even for what should be the exact same font. Look at these two captures of the same text. On top is GiMP’s rendering in Sans Serif and on bottom is FireFox:\n  They’re  almost identical, but not quite. There are two things that stand out; one is the length. You can see that the top image is just a LITTLE longer. For long enough strings, this can have a cascading effect that will throw the whole thing off. The other difference is how the text is rasterized; the bottom line is just a little bit bolder than the top one. This one we can mostly handle by adjusting for brightness, but it’s a total pain.\n For Unredacter, we’re using Electron to take screenshots of a local headless HTML window. So, the renderer will essentially be Chrome. Most of the time, this is not a problem. But if your redacted text was rendered using some really wonky program that doesn’t adhere to standards, then it might wind up veering off course quite a bit. Keep that in mind.\n If someone out there wants to write a wrapper for Unredacter that generates guesses using MS Word through some Rube Goldberg machine of wrappers and macros, you’re welcome to give it a go.\n When pixelating an image, there’s two degrees of freedom that have to be accounted for: the x and y offset coordinates. But what the heck are those?\n   If you think of this as a static grid, then there’s 64 distinct locations for you to place the text on that grid. We call this the x and y “offset”. Depending on the offset you choose, it can produce dramatically different images:\n   Furthermore, there’s no way for the attacker to know what these offsets were. (Unlike the font and font-size). The offset is determined in most editors like GiMP by the mostly random process of where the user happened to have clicked when making a bounding box. If they had clicked a single pixel up or down, the pixelation would have made a fairly different image!\n The good news here is that there’s not THAT many possibilities for offsets. There’s blocksize 2 permutations. For a block size of 8, that makes 64 offsets to try. In our challenge text, the block size is 5, meaning there’s only 25 offsets to test.\n  So, step one of Unredacter is to discover what offset was used. We do this by trying each offset in a loop and see if  ANY letter comes up with a good first-letter guess. We take all the offsets that have good first-letter guesses and add them to a list to then try proper guesses.\n Okay! Armed with this knowledge, and a tool to exploit it, let’s take a look at Jumpsec’s challenge image again:\n  One of the first things you might notice is that it has a curious bit of coloring in it. What gives? Shouldn’t it just be black and white since the text is black? Are they trolling us with colored letters?\n I’m actually not 100% sure why this happens (and sometimes doesn’t), but it’s an artifact of the rasterization process when text is rendered to screen. Just look at what happens when you zoom in to text typed out in Notepad:\n  When Unredacter renders the letters to a headless Chrome window, no colorized artifacts appear, so we’ll need to convert the image to greyscale. This will lose some information, but it’s fine. Unredacter doesn’t need exact matches, just for guesses to be “mostly right”. Once converted down, our challenge image looks like this:\n  There’s one last adjustment I had to make, and it’s on the bottom row:\n  It’s too small! The rest of the blocks are 5x5, but that bottom row is 5x3. After a few hours of trial and error, I also noticed that these blocks are too dark. Check out what a guess of the letter “g” looks like, versus the challenge image:\n   See how that bottom row is  way too dark? It’s because when the image was pixelated, they must have selected a bounding box that wasn’t a size with multiple of 5. So, when the algorithm determined the average, it was an average over a smaller area. (Thus darker) No matter, we can fix it up by just lightening that last row. This gives us our final challenge image of:\n  Next up is to figure out the correct font and font size. Luckily this wasn’t too hard, the image was taken in MS Notepad with the default font of Consolas. After a bit of trial and error, I found that the font size is 24px. (I did this by just trying font sizes over and over until the height of capital M matched up.) The only tricky part of this wound up being that Notepad apparently has a default letter-spacing of -0.2px. If you try rendering text in Chrome in Consolas, it’s much too long. But -0.2px letter-spacing matches up  exactly.\n   If you look closely, the “s”, “e”, and “c” has a little more of a curve in Notepad’s rendering. But it’s fine. Again, we don’t need to be 100% exact. This pretty close!\n Unredacter pretty quickly homes in on an offset of [3, 1], so let’s see how it does!\n       So I reached out to Caleb Herbert at Jumpsec, and they confirmed that my guess was correct!\n  Caleb also asked me to not disclose the solution, so you reading this can have a go at it yourself. (It’s blurred out above, and there’s no way you can read blurred text, right?) Huge shoutout to Jumpsec for issuing this challenge, it was a lot of fun. Was a great way to test out a new tool, too!\n If you want to check out the proof-of-concept source code to Unredacter, it’s  available on our GitHub right here.\n The bottom line is that when you need to redact text, use black bars covering the whole text. Never use anything else. No pixelization, no blurring, no fuzzing, no swirling. Oh, and be sure to actually edit the text as an image. Don’t make the mistake of changing your Word document so that it has black background with black text. (You can still read that just by highlighting  it like this.)\n The last thing you need after making a great technical document is to accidentally leak sensitive information because of an insecure redaction technique.\n  Dan Petro is a Lead Researcher at Bishop Fox and focuses on application penetration testing (static and dynamic), product security reviews, network penetration testing (external and internal), and cryptographic analysis. Dan has presented at several  Black Hats and DEF CONs on topics such as  hacking smart safes,  hijacking Google Chromecasts, and  weaponizing AI. He has developed several open-source tools including  Untwister, which breaks pseudorandom number generators. Additionally, Dan has been quoted in Wired, The Guardian, Business Insider, and Mashable. Dan holds both a Bachelor of Science and a Master of Science in Computer Science from  Arizona State University.\n More by Dan", "posttime": "2022-02-17 13:19:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文本,text,字母", "title": "不要使用文本像素来编辑敏感信息", "title_en": "Don't use text pixelation to redact sensitive information", "transed": 1, "url": "https://bishopfox.com/blog/unredacter-tool-never-pixelation", "via": "", "real_tags": ["文本", "text", "字母"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "按照官方文档安装zig，在macOS、Windows和Linux上，也可以通过pip3安装ziglang从PyPI安装zig\ncargo zigbuild支持在--target选项中传递libc版本，例如，使用AARC64未知linux gnu目标为glibc 2.17编译：\n目前只支持Linux目标，如果可以的话，可以添加其他目标平台，拉请求是受欢迎的。\n这项工作是根据麻省理工学院的许可证发布的。许可证文件中提供了许可证的副本。", "note_en": "Install  zig following the  official documentation,on macOS, Windows and Linux you can also install zig from PyPI via  pip3 install ziglang\n  cargo zigbuild supports passing libc version in  --target option, for example,to compile for glibc 2.17 with the  aarch64-unknown-linux-gnu target:\n   Currently only Linux targets are supported, other target platforms can be added if you can make it work,pull requests are welcome.\n    This work is released under the MIT license. A copy of the license is providedin the  LICENSE file.", "posttime": "2022-02-17 13:10:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,cargo,许可证", "title": "Cargo zigbuild：使用Zig作为链接器编译Cargo项目", "title_en": "Cargo-zigbuild: Compile Cargo project with Zig as linker", "transed": 1, "url": "https://github.com/messense/cargo-zigbuild", "via": "", "real_tags": ["编译", "cargo", "许可证"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "沙贾汗以建造泰姬陵的莫卧儿统治者而闻名。然而，他花费了印度更多的财富，建造了孔雀王座（1635年完工），意在与所罗门王座抗衡。王座的价值，也许是有史以来最珍贵的珠宝，也许可以通过知道给其中一只孔雀戴上王冠的是世界上最大的钻石之一——科希诺钻石来理解。然而，在当时，科希努尔甚至不被认为是王位上最令人印象深刻或最有价值的珠宝！\n1739年，德里被波斯强盗纳德·沙阿洗劫。沙阿用“700头大象、4000头骆驼和12000匹马”运走了数百年来积累的黄金、白银和以前的石头，包括孔雀王座。\n纳德将王位带回波斯，但他很快就疯了，变得越来越偏执和邪恶。他命令把自己的儿子弄瞎，把他的眼睛放在盘子里。由于担心类似的命运，他的一些阿富汗保镖向他发起攻击，将他斩首。但他的一位将军艾哈迈德·汗·阿卜杜利仍然忠诚，在暴力和抢劫中，他守卫着王室后宫。他得到了后宫第一夫人的奖赏，获得了科希诺尔钻石，并逃到了阿富汗。\n孔雀王座的其余部分被分散开来，随风飘散，尽管王座上其他两块著名的石头可以追溯到历史。Darya-i-Noor号最终成为了穆罕默德·雷扎·沙阿皇冠上的一部分，并留在了波斯。在革命前不久，我在父亲的陪伴下，在伊朗看到了他。这颗“大莫卧儿”钻石最终出现在阿姆斯特丹，由曾是凯瑟琳大帝情人的奥尔洛夫伯爵购买。为了回到她的床上，他把钻石送给了她，但最终只欠了她一笔债，被关进了精神病院。伟大的莫卧儿现在正在克里姆林宫展出。\n艾哈迈德·汗·阿卜杜勒在返回阿富汗的路上，从纳德·沙阿被斩首的混乱中逃脱，他遇到了一辆为纳德·沙阿准备的宝藏大篷车。他霸占了商队，利用商队的财富成为了杜拉尼帝国和现代阿富汗国的创始人。唉，艾哈迈德·汗因麻风病失去了鼻子，但他一直保留着钻石，直到钻石落入他的继承人帖木儿·沙阿手中，然后落入他的最终继承人沙阿·扎曼手中（经历了多次自相残杀的战争）。扎曼自己也被一根热针扎瞎了眼睛，“针尖很快就把他视线中的酒从他的眼睛杯子里洒了出来。”正如阿富汗历史学家米尔扎·塔塔诗意地说的那样。\n随着杜拉尼帝国的衰落，锡克帝国崛起，科希努尔人在兰吉特·辛格的领导下迁往拉合尔。然而，锡克教徒将旁遮普地区拱手让给了东印度公司，后者与少年国王杜莱普·辛格签署了一项和平协议，其中包括科希努尔作为贡品。杜莱普后来被流放到英国，在那里他将亲自把科希诺号交给他的赞助人维多利亚女王。\n维多利亚女王去世后，科希努尔号被纳入了英国的各种皇冠珠宝中，除了二战期间的一个时期，当时它被藏在池塘里。从上周开始，伊丽莎白女王宣布，当查尔斯成为国王时，科希诺将成为卡米拉女王皇冠上的珠宝。", "note_en": "Shah Jahan is best known as the Mughal ruler who built the Taj Mahal. He spent much more of India’s wealth, however, building the Peacock throne (completed 1635), meant to rival the throne of Solomon. The value of the throne, perhaps the most bejeweled object ever created, can perhaps be understood by knowing that crowning one of the peacocks was the Kohinoor, one of the world’s largest diamonds. At the time, however, the Kohinoor wasn’t even considered the most impressive or valuable jewel in the throne!\n Delhi was sacked by the Persian brigand Nader Shah in 1739. With ‘700 elephants, 4,000 camel and 12,000 horses’ Shah carted off hundreds of years of accumulated gold, silver and previous stones including the Peacock throne.\n Nader brought the throne back to Persia but he soon went mad becoming ever more paranoid and vicious. He ordered his own son blinded and the eyes brought to him on a platter. Fearing a similar fate, some of his Afghan bodyguards turned on him and beheaded him. But one of his generals, Ahmad Khan Abdali, remained loyal, and amidst the violence and looting stood guard over the royal harem. He was rewarded by the first lady of the harem with the Kohinoor diamond and escaped to Afghanistan.\n The rest of the Peacock throne was disbanded and disbursed to the winds although two of the other celebrated stones from the throne can be tracked through history. The Darya-i-Noor stayed in Persia were it eventually became part of the crown jewels of Mohammad Reza Shah, which as a child accompanied by my father I saw in Iran shortly before the revolution. The “Great Mughal” diamond eventually showed up in Amsterdam where it was bought by Count Orlov, the once-lover of Catherine the Great. Hoping to get back into her bed, he gifted her with the diamond but ended up only in debt and confined to a mental asylum. The Great Mughal is now on show in the Kremlin.\n On his way back to Afghanistan, Ahmad Khan Abdali, who had escaped from the chaos of Nader Shah’s beheading, ran across a treasure caravan intended for Nader Shah. Commandeering the caravan he used its wealth to become the founder of the Durrani empire and the modern state of Afghanistan. Alas Ahmad Khan lost his nose to leprosy but kept the diamond until it fell to his heir, Timur Shah and then to his eventual heir (after much internecine warfare) Shah Zaman. Zaman was himself blinded with a hot needle “The point quickly spilled the wine of his sight from the cup of his eyes.” as Afghan historian Mirza ‘Ata put it poetically.\n As the Durrani empire fell, the Sikh empire rose and the Kohinoor moved to Lahore under Ranjit Singh. The Sikhs, however, lost the Punjab to the East India Company who signed a peace deal with the boy king, Duleep Singh, which included the Kohinoor as tribute. Duleep would later be exiled to England where he would personally hand the Kohinoor over to his patron Queen Victoria.\n After Queen Victoria’s death the Kohinoor was incorporated into various of the British crown jewels, excepting one period during World War II when it was hidden in a pond. As of last week, Queen Elizabeth announced that when Charles becomes King the Kohinoor will become part of the crown jewels of Queen Consort Camilla.", "posttime": "2022-02-17 13:08:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "王冠,wears,钻石", "title": "沉重戴着王冠和头巾", "title_en": "Heavy Wears the Crown and the Kohinoor", "transed": 1, "url": "https://marginalrevolution.com/marginalrevolution/2022/02/heavy-wears-the-crown-and-the-kohinoor.html", "via": "", "real_tags": ["王冠", "wears", "钻石"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Unikernels是使用库操作系统——维基百科——构建的专门的单地址空间机器映像\nUnikernels承诺在启动和运行时使用轻量级、安全、简约的图像。它们假定在安全的虚拟机监控程序中运行，因此可以消除现代操作系统的许多复杂性。主要有两种方法：\n剥离，即简化现有内核以减少其开销并删除不必要的功能\n尽管在2015-2016年前后有很多炒作，但unikernels没有&#39；不要像容器或库伯内特那样大受欢迎。\n作为虚拟机运行意味着应用程序可以&#39；不要像在Linux容器中那样共享一些资源（未使用的RAM）\n安全性单内核最有力的理由之一是减少了攻击面。而那&#39；这很难反驳，同样的方法会使调试更加困难。类似于从容器内部调试从头开始的容器。虽然这可以通过在调试和监视工具中烘焙来缓解，但这与整个想法背道而驰。\n轻量级是unikernels的另一个有力论据：低开销和小内存占用。另一方面，你需要为你的虚拟机分配一定数量的资源，这可以&#39；不能像Linux容器一样与其他应用程序共享。因此，您可能无法像使用容器那样进行扁平封装。\n性能虽然没有系统调用切换开销的简单内核确实提高了某些操作的性能，但它&#39；目前还不清楚这在多大程度上适用于系统调用不适用的应用程序&#39；t瓶。此外，高性能是有代价的，因此对于一部分应用程序来说，这只是一个可接受的折衷方案。\n调试/监控随着eBPF的出现，内核的可视性显著提高，因此标准也提高了。Unikernels需要为大规模采用提供一个可行的替代方案。\n调度容器现在有几个用于调度的选项（Kubernetes、Nomad等）。使用类似OpenStack的东西调度虚拟机需要进行大量改进，才能达到特定于容器的解决方案所提供的易用性/速度水平。这可以通过鞭炮之类的东西来缓解，这些东西可以与库伯内特斯结合，但是这些天堂&#39；我也不太受欢迎。\n兼容性容器对现有软件进行打包，并在未归档的情况下运行。Unikernels需要与应用程序一起编译内核。有一些解决方案可以生成用于调试的Linux二进制文件和用于生产的内核映像。保持单内核（大部分）Linux兼容是可能的，但需要一些胶水。\n目前，我能找到的仅有两种商业支持是Unikraft和NanoOS。如果你&#39；如果你想学习自己制作，可以去看看圣安德鲁斯大学（St Andrews university）教过的StardustOS，它为Xen提供了一个最小的内核&#39；很容易浏览。", "note_en": "Unikernels are specialised, single address space machine images constructed by using library operating systems --  Wikipedia\n Unikernels promise lightweight, secure, minimalistic image to boot and run. They assume being run in a secure hypervisor, so can do away with a lot of complexity of a modern OS. There are two main approaches:\n strip-down, where an existing kernel is simplified to reduce its overhead and remove unnecessary features\n   Despite a lot of hype around  2015-2016, the unikernels didn&#39;t blow up in popularity the way that containers or Kubernetes did.\n  running as VMs means applications can&#39;t share some resources (unused RAM) like they can in Linux containers\n  Security one of the strongest arguments for a unikernel is the reduced attack surface. While that&#39;s difficult to argue with, that same approach makes for more difficult debugging. Similar to debugging a FROM SCRATCH container from inside the container. While this can be alleviated by baking in debugging and monitoring tools, this goes against the whole idea.\n Lightweight another strong argument for unikernels: low overhead and small memory footprint. The flip side, is that you will need to allocate a certain amount of resources for your VM, that can&#39;t be shared with other applications like they can with Linux containers. So you might not be able to flatpack as much as you can with containers.\n Performance while a simple kernel without the overhead of syscall switch does increase the  performance of some operations, it&#39;s not clear how well that applies to applications for which the syscalls aren&#39;t bottlecks. Besides, the high performance comes at a cost, so will only be an acceptable tradeoff for a subset of applications.\n Debugging/Monitoring with the advent of eBPF, the visibility into the kernel has increased dramatically, so the standard have risen. Unikernels would need to provide a viable alternative for massive adoption to happen.\n Scheduling containers now have a few options for scheduling ( Kubernetes,  Nomad, etc). Scheduling VMs with something like OpenStack would require a lot of improvement to get to the level of ease/speed that the container-specific solutions provide. This could be alleviated with things like  Firecracker that can integrate with Kubernetes, but these haven&#39;t exactly blown up in popularity either.\n Compatibility containers package existing software and run it unchaged. Unikernels require compiling the kernel together with the application. There are some solutions that can produce a Linux binary for debugging and a kernel image for production. Keeping your unikernel (mostly) Linux-compatible  is possible, but requires some glue.\n Currently, the only two with commercial support I could find are  Unikraft and  NanoOS. If you&#39;re looking to learn to make your own, check out  StardustOS used to teach at St Andrews university, which includes a  minimal kernel for Xen that&#39;s easy to browse through.", "posttime": "2022-02-17 12:57:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "单核,unikernels,容器", "title": "单核", "title_en": "Unikernels", "transed": 1, "url": "https://github.com/seeker89/unikernels", "via": "", "real_tags": ["单核", "容器"]}]