[{"category": "", "categoryclass": "", "imagename": "0223f202b73879d152923092f3658ca8.jpg", "infoid": 1066507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因此，当新数据库提供障碍并重新定义企业时，这是出色的。\n Neo4j提供了一种以图形为中心的数据库和相关产品，今天宣布，它在由Eurazeo领导的F款项（FERaze）领导的F系列估值中筹集了3.25亿美元，其中来自字母的风险翼GV的额外资金。 Eurazeo董事总经理Nathalie Kornhoff-Brüls将加入公司的董事会。\n  这笔资金在历史上最具资助的数据库公司中制作了Neo4J，其中集体筹款Haul超过了半十一美元。对于比较，M​​ongoDB，纳斯达克交易，总共筹集了311万美元，总数在其首次公开募股前克里宁巴队筹码。与此同时，蟑螂蟑螂的名望现已筹集了3.55亿美元的资金，包括今年早些时多百万美元，估值同比为1.6亿美元。\n 过去十年已经看到了一系列新的下一代数据库模型，从Scale-out SQL到记录到键值存储到时间序列和打开和打开。像Neo4J唯一这样的图形数据库是他们关注各个数据实体之间的连接。基于图形的数据模型已成为现代机器学习和人工智能应用的核心，现在通过应用程序中的数据分析师广泛使用，作为销售到欺诈检测的营销。\n 首席执行官和联合创始人Emil Eifrem表示，在2007年建立回来的Neo4J近年来鉴于基于图形的分析的普及不断上升，近年来达到了增长步幅。 “我们在任何特定的月份积极建立了与Neo4j的应用程序的数十万名开发人员，但我们也有一个非常深刻的数据科学界。”\n 在过去，大多数业务分析都是基于关系数据库而建立的。然而，连接间的复杂性在任何地方都爬行，这就是Eifrem认为Neo4J的耐用边缘。作为一个例子，“任何船舶的公司都在跨越大陆的全球精细谷物网格，”他建议。 “突然突然船长在苏伊士运河中......睡着了，然后他们挡住了一周的苏伊士运河，然后你必须弄清楚这将如何影响我的企业，如何在整个整体上级联供应链。”使用图形模型，该分析是Cinch。\n Neo4J表示，800家企业是客户，75％的财富100是公司产品的用户。 \n我们在2020年推出了4.0次，我们最后在2020年签到了4.0，这提供了无限的缩放。今天，Neo4J有几种不同的口味。这是一个可以自托管或购买的数据库，或者作为云服务提供的云服务，它配给光环。这是数据存储人员。对于数据科学家来说，该公司提供Neo4J图数据科学库，这是一组用于分析图形数据的综合工具。该公司提供免费（或“社区”层），价格实惠的起始层和全面的企业定价选项，具体取决于需求。\n  开发继续在数据库上。今天早上在它的开发人员会议上，Neo4J在其中展示了它在2000亿个节点图上被称为“超级缩放技术”，它们之间的关系超过了一万亿的关系，展示了其工具在如此大的情况下如何提供“实时”查询规模。\n 卓越的骄傲，EIFREM表示，新的风险投资将用于继续向下递增“产品，产品，产品”，但强调了对公司至关重要的一些主要战略举措。首先，他希望继续深化公司与公共云提供商的伙伴关系。它已经与Google Cloud有一个深厚的关系（GV毕竟在这一轮的投资者），并希望继续与其他提供者建立关系。\n 它也看到了亚太地区区域兴趣的主要涨幅。 Eifrem表示，该公司最近在新加坡开设了办事处，以加速其在更广泛的IT市场销售。\n 总体而言，“我们认为图形可以是现代数据景观的重要组成部分。事实上，我们认为它可能是现代数据景观的最大部分。我认为，这一轮，发出明确的信号[那]我们要为它而来，“他说。\n Erik Nordlander和GV的Tom Hulme是该公司的领导者。此外，DTCP和Lightrock新投资和以前的投资者一个峰，Creandum和Greenbridge Partners加入了这一轮。 ", "note_en": "So it’s exceptional when a new database offering breaks through the barriers and redefines the enterprise.\n Neo4j, which offers a graph-centric database and related products, announced today that it raised $325 million at a more than $2 billion valuation in a Series F deal led by Eurazeo, with additional capital from Alphabet’s venture wing GV. Eurazeo managing director Nathalie Kornhoff-Brüls will join the company’s board of directors.\n  That funding makes Neo4j among the most well-funded database companies in history, with a collective fundraise haul of more than half a billion dollars. For comparison, MongoDB, which trades on Nasdaq,  raised $311 million in total according to Crunchbase before its IPO. Meanwhile, Cockroach Labs of CockroachDB fame has  now raised $355 million in funding, including  a $160 million round earlier this year at a similar $2 billion valuation.\n The past decade has seen a whole new crop of next-generation database models, from scale-out SQL to document to key-value stores to time series and on and on and on. What makes graph databases like Neo4j unique is their focus on the connections between individual data entities. Graph-based data models have become central to modern machine learning and artificial intelligence applications, and are now widely used by data analysts in applications as diverse as marketing to fraud detection.\n CEO and co-founder Emil Eifrem said that Neo4j, which was founded back in 2007, has hit its growth stride in recent years given the rising popularity of graph-based analysis. “We have a deep developer community of hundreds of thousands of developers actively building applications with Neo4j in any given month, but we also have a really deep data science community,” he said.\n In the past, most business analysis was built on relational databases. Yet, inter-connected complexity is creeping in everywhere, and that’s where Eifrem believes Neo4j has a durable edge. As an example, “any company that ships stuff is tapping into this global fine-grain mesh spanning continent to continent,” he suggested. “All of a sudden the ship captain in the Suez Canal … falls asleep, and then they block the Suez Canal for a week, and then you’ve got to figure out how will this affect my enterprise, how does that cascade across my entire supply chain.” With a graph model, that analysis is a cinch.\n Neo4j says that 800 enterprises are customers and 75% of the Fortune 100 are users of the company’s products.\n We last checked in with the company in 2020 when it launched 4.0, which offered unlimited scaling. Today, Neo4j comes in a couple of different flavors. It’s a database that can be either self-hosted or purchased as a cloud service offering which it dubs Aura. That’s for the data storage folks. For the data scientists, the company offers Neo4j Graph Data Science Library, a set of comprehensive tools for analyzing graph data. The company offers free (or “community” tiers), affordable starting tiers and full-scale enterprise pricing options depending on needs.\n  Development continues on the database. This morning at its developers conference, Neo4j demonstrated what it dubbed its “super-scaling technology” on a 200 billion node graph with more than a trillion relationships between them, showing how its tools could offer “real-time” queries on such a large scale.\n Unsurprisingly, Eifrem said that the new venture funding will be used to continue doubling down on “product, product, product” but emphasized a few major strategic initiatives as critical for the company. First, he wants to continue to deepen the company’s partnerships with public cloud providers. It already has a deep relationship with Google Cloud (GV was an investor in this round after all), and hopes to continue building relationships with other providers.\n It’s also seeing a major uptick in interest from the APAC region. Eifrem said that the company recently opened up an office in Singapore to accelerate its sales in the broader IT market there.\n Overall, “We think that graphs can be a significant part of the modern data landscape. In fact, we believe it can be the  biggest part of the modern data landscape. And this round, I think, sends a clear signal [that] we’re going for it,” he said.\n Erik Nordlander and Tom Hulme of GV were the leads for that firm. In addition, DTCP and Lightrock newly invested and previous investors One Peak, Creandum, and Greenbridge Partners joined the round.", "posttime": "2021-06-18 00:29:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据分析,raises,数据", "title": "Neo4j为基于图形的数据分析占据了企业的数据分析，提出了Neo $ 325米 ", "title_en": "\n\t\t\t\tNeo4j raises Neo$325m as graph-based data analysis takes hold in enterprise\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/neo4j-series-f/", "via": "", "real_tags": ["数据分析", "raises", "数据"]}, {"category": "", "categoryclass": "", "imagename": "0003ba6d46152c7a4619befe691dc58a.jpg", "infoid": 1066506, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该计划的结构类似于Apple的App Store小型商业计划，在2020年代末宣布，苹果减少到15％的开发人员达到了100万美元的门槛，之后他们的标准率较高了30％。然后，此速度继续在次年进入。谷歌，最近，通过每年通过播放结算系统获得的前100万美元的开发人员收入将佣金降至15％略有不同的课程。\n 亚马逊的削减仍然大于20％，但这是因为它提供了开发人员一种不同类型的Perk：AWS学分。\n  该公司表示，在日历年度的Appstore收入中少于100万美元的开发商将获得其收入的10％，作为AWS服务的促销信贷。这包括基础设施技术，如Compute，Storage和Databases  - 新兴技术，例如机器学习和人工智能，数据湖泊和分析以及物联网，Notes Amazon。亚马逊表示，这使得总计划的福利高达90％的收入。\n 如果开发商的收入在本年度的收入超过100万美元，他们将恢复标准版税税率，并不再收到今年剩余时间的AWS学分。\n 如果开发商在未来年度的收入下降超过100万美元，他们将在下一个日历年内再次享受小型商业计划的资格。\n “通过帮助小企业通过学分开始，我们更轻松地建立和发展他们的应用程序业务，”亚马逊Appstore Director，Palanidaran Chidambaram，在一个公告中。 “AWS为开发人员提供了广泛的技术，因此他们可以更快地创新，并且几乎可以想象的任何东西，”他补充道。\n App Store委员会结构的变化是在科技巨头看到对其业务本质上的监管压力越来越大的，其中大型应用程序出版商，包括Basecamp，Spotify，Epic Games和其他人认为是反竞争的。史诗还可以在潜在的先例设定案例中使用App Store费用来起诉Apple。作为响应，苹果和谷歌降低了较小企业的费用作为善意的姿态 - 以及一个不会显着影响自己的应用商店平台收入。 \n亚马逊表示，新计划将在第4季度推出，并在此时提供有关如何参加的更多细节。 ", "note_en": "This program’s structure is similar to Apple’s App Store Small Business Program,  announced in late 2020, which reduced Apple’s cut to 15% for developers who earn up to a $1 million threshold, after which they’re moved to the higher 30% standard rate. This rate then continues as they enter the following year. Google, more recently, took  a slightly different course, by lowering the commissions to 15% on the first $1 million of developer revenue earned through the Play billing system each year.\n Amazon’s cut remains larger at 20%, but that’s because it’s offering developers a different type of perk: AWS credits.\n  The company says developers with less than $1 million in Appstore revenue in a calendar year will receive 10% of their revenue as promotional credit for AWS services. This includes infrastructure technologies like compute, storage, and databases–to emerging technologies, such as machine learning and artificial intelligence, data lakes and analytics, and Internet of Things, notes Amazon. This brings total program benefits up to an equivalent of 90 percent of revenue, Amazon says.\n If the developer’s revenue exceeds $1 million during the current year, they’ll revert to the standard royalty rate and no longer receive the AWS credits for the rest of the year.\n And if the developer’s revenue in a future year drops below $1 million, they’ll become eligible for the Small Business program again in the next calendar year.\n “By helping small businesses get started with AWS through credits, we are making it easier for them to build and grow their app businesses,” noted Amazon Appstore Director, Palanidaran Chidambaram, in an  announcement. “AWS gives developers easy access to a broad range of technologies so they can innovate faster and build nearly anything they can imagine,” he added.\n The changes to app store commission structures come at a time when tech giants are seeing increasing regulatory pressure over the nature of their businesses, which larger app publishers, including Basecamp, Spotify, Epic Games and others have  argued are anticompetitive. Epic is  also suing Apple over its app store fees, in a potentially precedent-setting case. In response, Apple and Google lowered fees for smaller businesses as a gesture of goodwill — and one that wouldn’t significantly impact their own app store platform revenues.\n Amazon says the new program will launch in Q4 2021, and more details about how to participate will be provided at that time.", "posttime": "2021-06-18 00:28:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,开发,降低,aws", "title": "亚马逊的Appstore降低了Small Business的开发人员收入，增加了AWS学分 ", "title_en": "\n\t\t\t\tAmazon’s Appstore lowers its cut of developer revenue for small businesses, adds AWS credits\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/amazons-appstore-lowers-its-cut-of-developer-revenue-for-small-businesses-adds-aws-credits/", "via": "", "real_tags": ["亚马逊", "amazon", "开发", "降低", "aws"]}, {"category": "", "categoryclass": "", "imagename": "509421dea42b58bcaf6bab12c6a499b6.jpg", "infoid": 1066504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lordstown Motors Insim Ceo Angela Strand和富裕的施密特总统在一系列的汽车新闻协会活动中发表了一系列陈述，该活动在公司开展了一股股份，包括从客户拥有足够的“约束订单”，以资助其电动拾取卡车的有限生产。到2022年5月。在执行康复后，这些评论仅仅是本公司首席执行官和首席财务官的辞职。\n 根据美国证券交易委员会提交的文档Lordstown，看来，这些似乎是租赁或购买的“绑定订单”更像是租赁或购买。该申请使Lordstown的股份造成超过4％。\n   为了澄清6月15日汽车新闻协会在线媒体活动的公司高管的最新评论，尽管这些车辆购买协议为我们提供了一项重要的需求指标，但这些协议不代表拟订采购订单或其他公司购买承诺。如前所述，截至2020年12月31日的截至2020年12月31日的截至2002年12月31日的第10 k / A形式，我们迄今为止，我们从事有限的营销活动，我们没有约束品购买订单或来自客户的承诺。\n 在SEC提出的情况下，销售和营销策略的一个重要方面涉及与专业富有舰队管理公司的关系。例如，在2021年3月，Lordstown宣布与霍尔曼企业的舰队管理联盟有达成协议。根据协议，ARI“将使用合理的努力，以促进其租赁客户的订单，以持续三年期间的持久性符合协议所规定的条款。”\n 该公司解释说，Lordstown还与其他专业富有习得和舰队管理公司签订了汽车购买协议。这可能听起来像一个绑定顺序，但是，因为SEC Doc中的以下语言更明确。\n “这些车辆购买协议一般包括预计买方订单计划，超过了该协议的3年至5年的生活，并可以为30天通知的任何一方终止，”来自Lordstown读的文件。 “他们不致力于购买车辆的交易对手，但我们认为他们为我们提供了一个重要的耐力需求指标。”\n 来自Lordstown的逆转只是新上市公司一系列问题的最新问题。 Lordstown Motors是现代首席执行官Steve Burns'其他公司，Workhors Group，这家电池集团的电池集团也是公开交易的。 Workhorse在Lordstown Motors拥有10％的股份。 Lordstown Motors与专用采集公司Diamondpeak Holdings Corp.合并后公开 \n3月份，寒宗堡研究，尼古拉电机的报告的截止卖家公司导致仲裁裁扣和创始人的辞职，表示，它在罗德斯敦电机上采取了短暂的职位，造成股票的股票21％。 Hindenburg在其短地位基于公司的时间内有“无收入，无销售产品，我们认为我们认为误导了投资者的需求和生产能力。”\n Hindenburg争议该公司已预订了100,000个电动拾取卡车的预订，这是一款由1月份的Lordstown Motors共享的统计数据。卖空卖方表示，“广泛的研究表明，该公司的订单主要出现了虚构，并用作筹集资金和合法性的道具。”该公司进一步走得进一步，并声称Lordstown创始人兼首席执行官Steve在2016年担任2016年时，他在主导的主教前后为每辆卡车预先订购了付费顾问。\n 两个月后，由于缺乏资金，守卫在第一季度盈利中报告了第一季度的盈利，这可能是一半 - 从大约2,200辆车到1,000  - 由于缺乏资金。 Hordstown Execs Tuesday的陈述似乎是一个尝试，它被退回到缓和投资者。 ", "note_en": "Lordstown Motors interim CEO Angela Strand and President Rich Schmidt made a series of statements Tuesday at an Automotive Press Association event that drove up shares in the company, including that it has enough “binding orders” from customers to fund limited production of its electric pickup truck through May 2022. Those comments came just a day after an executive shakeup that included the  resignation of the company’s CEO and CFO.\n It appears those “binding orders” were more like agreements to maybe lease or buy,  according to a document Lordstown filed with the U.S. Securities and Exchange Commission. The filing has caused shares of Lordstown to fall more than 4%.\n   To clarify recent remarks by company executives at the Automotive Press Association online media event on June 15, although these vehicle purchase agreements provide us with a significant indicator of demand for the Endurance, these agreements do not represent binding purchase orders or other firm purchase commitments. As previously disclosed in our Form 10-K/A for the year ended December 31, 2020, filed with the Securities and Exchange Commission on June 8, 2021, to date, we have engaged in limited marketing activities and we have no binding purchase orders or commitments from customers.\n Lordstown notes in the SEC filing that an important aspect of its sales and marketing strategy involves pursuing relationships with specialty upfitting and fleet management companies. For instance, in March 2021 Lordstown announced an agreement with ARI, a fleet management affiliate of Holman Enterprises. Under the agreement, ARI “would use reasonable efforts to facilitate orders from its leasing clients for the Endurance over a three-year time period on the terms set forth in the agreement.”\n Lordstown has also entered into vehicle purchase agreements with additional specialty upfitting and fleet management companies as a component of that strategy, the company explained. This might sound like a binding order, but it’s not,  as the following language in the SEC doc makes more clear.\n “These vehicle purchase agreements generally include a projected buyer order schedule over the 3- to 5-year life of the agreement, and may be terminated by either party at will on 30 days’ notice,” the filing from Lordstown reads. “They do not commit the counterparties to purchase vehicles, but we believe that they provide us with a significant indicator of demand for the Endurance.”\n The reversal from Lordstown is just the latest in a string of issues at the newly public company. Lordstown Motors is an offshoot of the now former CEO Steve Burns’ other company, Workhorse Group, a battery-electric transportation technology company that is also publicly traded. Workhorse holds a 10% stake in Lordstown Motors. Lordstown Motors went public after merging with special-purpose acquisition company DiamondPeak Holdings Corp.\n In March, Hindenburg Research, the short-seller firm whose report on Nikola Motor led to an SEC investigation and the resignation of its founder, said it had  taken a short position on Lordstown Motors, causing shares to plummet 21%. Hindenburg said at the time that its short position was based on a company has “no revenue and no sellable product, which we believe has misled investors on both its demand and production capabilities.”\n Hindenburg disputes that the company has booked 100,000 pre-orders for its electric pickup truck, a stat shared by Lordstown Motors in January. The short seller says that “extensive research reveals that the company’s orders appear largely fictitious and used as a prop to raise capital and confer legitimacy.” The firm goes further and alleges that Lordstown founder and CEO Steve Burns paid consultants for every truck pre-order as early as 2016 while he was leading Workhorse.\n Two months later, Lordstown reported in its first-quarter earnings that production volumes of the Endurance would likely be half — from around 2,200 vehicles to just 1,000 — due to a lack of funding. The statements made by Lordstown execs Tuesday appeared to be an attempt, which backfired, to assuage investors.", "posttime": "2021-06-18 00:28:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "motors", "title": "Lordstown Motors逆转电动拾取卡车关于“装订订单”的声明 ", "title_en": "\n\t\t\t\tLordstown Motors reverses claims about “binding orders” for electric pickup truck\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/lordstown-motors-reverses-claims-about-binding-orders-for-electric-pickup-truck/", "via": "", "real_tags": ["motors"]}, {"category": "", "categoryclass": "", "imagename": "724c6a9e0d07131d64f3070b179309c6.jpeg", "infoid": 1066503, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客攻击。伪造。监视。网络是主板＆＃39;播客和在互联网的黑暗底层上报告。\n  在星期五，大众汽车披露了一个数据违约，它表示影响了330万客户和兴趣的买家。星期一，黑客将汽车制造商偷走的数据放在令人惊叹的黑客论坛上。\n  在由主板审核的销售列表中，一个第000的黑客写道，数据包括电子邮件地址和车辆识别号码（VIN）。黑客还发布了两个数据样本，其中包括全名，电子邮件地址，邮寄地址和电话号码。\n    数据类型似乎与普遍承认的Volkwagen被盗。在Cyber​​security供应商代表汽车制造商成立的网站中，大众汽车表示，＆＃34;大多数＆＃34;受影响的数据包括：＆＃34;名字和姓氏，个人或商业邮寄地址，电子邮件地址或电话号码。在某些情况下，数据还包括关于购买，租用或询问的车辆的信息，例如车辆识别号（VIN），制作，模型，年，颜色和修剪包。＆＃34;但对于90,000名受害者，数据也包括在内的数据和与购买，贷款或租赁有关的更敏感的信息。\n  几乎所有敏感的数据（超过95％）包括驾驶执照号码，＆＃34;据该公司表示，这补充说，大多数数据都涉及奥迪客户和美国和加拿大的兴趣买家。该公司还表示，它认为数据由供应商不安全。 （奥迪由大众汽车组拥有。）\n  ＆＃34;还有一个非常少量的出生日期，社会保障或社会保险号，帐户或贷款号，税号，＆＃34;网站读了。\n  主板通过电子邮件或电话达到样本中包含的所有人员。联系的七个人证实，黑客发布的至少一条数据是真实的。 \n您是否知道赎金软件事件的任何其他内容？我们很乐意听取您的意见。使用非工作手机或计算机，您可以安全地联系Lorenzo FrancesChi-Bicchierai在+1 917 257 1382，Lorenzofb上的Wickr和Telegram上的信号，或电子邮件至lorenzofb@vice.com\n  Alon Gal，网络安全公司哈德逊摇滚的联合创始人和首席技术官，警报主板到上市。\n  大众发言人分享了一个陈述数据泄露的陈述，但没有包含关于黑客论坛上销售的任何信息。发言人表示，＆＃34;我们不能超越我们的公开披露。＆＃34;\n    销售数据的黑客告诉主板，它没有包含任何社会安全号码，也没有司机＆＃39;许可证信息。黑客表示，她在整个数据库中询问了4,000美元至5,000美元。\n  000表示，她与Banthou3a一般去的另一个黑客合作。 000解释说，她设置了一个脚本来扫描Internet for曝光的Azure Blob，它基本上存储在Microsoft＆＃39; s云中的数据存储库。黑客表示，她刚刚创建了一个脚本，它可以通过检查附加到＆＃34; blob.core.windows.net，＆＃34的已知公司域来查找公开的备份。 Azure Blobs的默认URL。\n  ＆＃34;我有一堆数据刚存储，＆＃34; 000在线聊天中说。 ＆＃34;来自多个其他来源不仅是天蓝色的斑点。＆＃34;\n  黑客表示她在3月获得了数据。 Volkwagen表示，它在今年3月10日被警告。该公司补充说，它相信＆＃34;当供应商在2019年8月至2019年8月期间的某些时候左侧留下电子数据时获得了数据，当事事件的来源时，＆＃34;该公司未识别负责违约的供应商，仅说它由奥迪，大众和一些授权经销商使用。 \n该公司补充说，被盗数据从2014年到2019年到2019年，并且它正在通知所有受害者。 Volkswagen表示，它正在向受害者发送电子邮件或信件，提供免费信用监控，并提醒他们可以使用被盗的信息收到网络钓鱼攻击。 大众汽车表示，它仅提供免费信用，只有90,000名受敏感数据被盗的受害者。  更新，06/17/2021，9:51前A.M.ET：这个故事是更新的，以澄清受害者只在美国和加拿大，大众汽车仅为大约90,000个受害者提供免费信用监测。 ", "note_en": "Hacking. Disinformation. Surveillance. CYBER is Motherboard&#39;s podcast and reporting on the dark underbelly of the internet.\n  On Friday, Volkswagen  disclosed a data breach that it said affected 3.3 million customers and interested buyers. On Monday, hackers put the data stolen from the car maker on sale on a notorious hacking forum.\n  In the sales listing reviewed by Motherboard, a hacker that goes by 000 wrote that the data included email addresses and Vehicle Identification Numbers (VIN). The hacker also posted two samples of the data, which included full names, email addresses, mailing addresses, and phone numbers.\n    The type of data seems to align with what Volkwagen admitted was stolen.  In a website set up by a cybersecurity vendor on behalf of the car maker, Volkswagen said that &#34;the majority&#34; of affected data included: &#34;first and last name, personal or business mailing address, email address, or phone number. In some instances, the data also included information about a vehicle purchased, leased, or inquired about, such as the Vehicle Identification Number (VIN), make, model, year, color and trim packages.&#34; But for 90,000 victims, the data also included &#34;more sensitive information relating to eligibility for a purchase, loan, or lease.\n  Nearly all of the more sensitive data (over 95%) consists of driver’s license numbers,&#34; according to the company, which added that the majority of data pertains to Audi customers and interested buyers in the US and Canada only. The company also said it believes the data was left unsecured by a vendor. (Audi is owned by the Volkswagen Group.)\n  &#34;There were also a very small number of dates of birth, Social Security or social insurance numbers, account or loan numbers, and tax identification numbers,&#34; the website read.\n  Motherboard reached out to all the people included in the samples, either via email or phone. Seven of the people contacted confirmed that at least one piece of their data published by the hackers was real.\n Do you know anything else about a ransomware incident? We’d love to hear from you. Using a non-work phone or computer, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, lorenzofb on Wickr and Telegram, or email lorenzofb@vice.com\n  Alon Gal, the co-founder and CTO of cybersecurity firm Hudson Rock, alerted Motherboard to the listing.\n  A Volkswagen spokesperson shared a statement that addressed the data breach but did not include any information about the sale on the hacking forum. The spokesperson said that &#34;we cannot comment beyond our public disclosures.&#34;\n    The hacker who&#39;s selling the data told Motherboard that it did not contain any Social Security Numbers nor drivers&#39; license information. The hacker said she is asking between $4,000 and $5,000 for the whole database.\n  000 said she worked with another hacker who goes by General Badhou3a. 000 explained that she set up a script to scan the internet for exposed  Azure blobs, which are essentially data repositories stored in Microsoft&#39;s cloud. The hacker said she just created a script that would look for exposed backups by checking for known company domains attached to &#34;blob.core.windows.net,&#34; the  default URL for Azure blobs.\n  &#34;I have a bunch of data just stored,&#34; 000 said in an online chat. &#34;From multiple other sources not only Azure blobs.&#34;\n  The hacker said she obtained the data in March. Volkwagen said that it was alerted of the breach on March 10 of this year. The company added that it believes &#34;the data was obtained when the vendor left electronic data unsecured at some point between August 2019 and May 2021, when the source of the incident was identified.&#34; The company did not identify the vendor responsible for the breach, saying only that it is used by Audi, Volkswagen, and some authorized dealers.\n  The company added that the stolen data ranged from 2014 until 2019, and that it is notifying all victims. Volkswagen said it is sending emails or letters to the victims, offering free credit monitoring and alerting them that they may receive phishing attacks using the information stolen.  Volkswagen said it’s offering free credit only tho the approximately 90,000 victims who had more sensitive data stolen.\n  UPDATE, 06/17/2021, 9:51 a.m. ET: This story was updated to clarify that the victims are only in the US and Canada, and that Volkswagen is only offering free credit monitoring to around 90,000 of the total victims.", "posttime": "2021-06-18 00:20:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,selling,数据", "title": "黑客正在销售从奥迪和大众汽车偷来的数据 ", "title_en": "Hackers Are Selling Data Stolen From Audi and Volkswagen", "transed": 1, "url": "https://www.vice.com/en/article/xgxaq4/hackers-are-selling-data-stolen-from-audi-and-volkswagen", "via": "", "real_tags": ["黑客", "selling", "数据"]}, {"category": "", "categoryclass": "", "imagename": "e4aa5eaaab3cbc70a431168f4b73ca6e.jpg", "infoid": 1066502, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Snapchat应用程序的制造商消除了称为＆＃34;速度滤波器＆＃34的特征;这是公司发言人告诉NPR，让用户捕捉他们的移动和与朋友分享它的速度。\n  此举是Snap，Inc。的戏剧性逆转，首先在2013年推出了该功能。\n  从那时起，Snap在＆＃39的安全倡导者面前捍卫了该特征。据称它鼓励鲁莽驾驶。该公司还面临的诉讼，这些家庭在车祸中受伤或杀死的人，其中司机正在过度速度迁移，据称在应用程序上得分吹牛权利。\n    ＆＃34;生命将保存。坠毁将被阻止，但我的律师说，＆＃39;我的上帝，为什么需要这么久？＆＃39;＆＃34; Joel Feldman表示，非营利组的共同创始人分散了分散注意力，其中一个促使Snapchat去除速度滤波器的组中的一个。\n  究竟LED捕捉到SCAP现在不清楚。几周后，NPR要求捕捉一系列问题，了解为什么速度过滤器为什么长短。一家公司发言人告诉NPR，＆＃34;没有什么比我们的Snapchat社区的安全更重要。＆＃34;\n      特征＆＃34;勉强使用Snapchatters，＆＃34;她星期四说。 ＆＃34;鉴于此，我们完全删除它。＆＃34;\n  她说，该公司本周开始删除该功能，但它可能是几周前从应用程序中消失的所有5亿个月的每月活跃用户。 \n该功能已与许多致命或近乎致命的汽车崩溃有关，通常与车轮后面的青少年。\n  涉及速度过滤器的2016年碰撞留在格鲁吉亚的司机，具有永久性脑损伤。同年，该功能与费城车祸中的三名年轻女性的死亡联系在一起。同时，佛罗里达州的五个人在高速碰撞中死于据报道，涉及速度过滤器。 2017年，威斯康星州的三名年轻男子在特征上时钟时钟每小时123英里的速度，然后撞到树上并死亡。\n     作为响应，捕捉若干变化。它从A＆＃34移动了速度特征;过滤器＆＃34;到A＆＃34;贴纸＆＃34;在Snapchat中，降低其突出。它还添加了一个＆＃34;不要＆＃39; t snap和drive＆＃34;警告每次有人使用该功能时会出现。该公司还悄悄地限制了一个职位可以分享＆＃34的最高速度;驾驶速度＆＃34;以35英里/小时。当NPR在5月份询问了这一点时，Snap发言人均证实了限制已经施加。然而，该公司拒绝只需删除该功能。\n    法律战斗继续。加州Ramachandrappa是一位加州律师，他在速度过滤器上捕获速度，在诉讼中写道，一些婴儿的一些少年用户认为他们将获得数字奖品和奖杯，用于记录每小时超过100英里的速度超过100英里的奖励。\n  ＆＃34;或者至少，他们想知道他们是否会得到如此奖励，所以他们以过度的速度开车，看看会发生什么，而＃34;他写了。\n  5月份联邦上诉法院规定，在威斯康星州坠毁中死亡的年轻人的家庭应该能够在设计一种导致可预见的伤害的产品方面申请疏忽。扣押本周要求审判法院抛出案件，争论速度过滤器没有导致车祸。\n  Snap Shokesperson中的大约50亿＆＃34; Snaps＆＃34;用户每天都会让，速度特征只用于几千人，表明它不受欢迎。 \nSanta Clara University互联网伦理计划主任Irina Raicu表示，越来越多的科技公司正在对新产品和特征进行风险评估，以便在可能的滥用之前进行。  ＆＃34;如果您有新工具或功能：它允许什么？ 它邀请什么？ 它激励了什么？ 基于这三件事，＆＃34有责任。 她说。 ＆＃34;这个snapchat过滤器似乎也许它最初缺少一些对话。＆＃34;  ＆＃34;有时。＆＃34; Raicu补充道，＆＃34;部署产品的最周到的方法之一是从未部署它。＆＃34; ", "note_en": "The maker of the Snapchat app is eliminating a feature known as the &#34;speed filter&#34; that lets users capture how fast they are moving and share it with friends, a company spokesperson told NPR.\n  The move is a dramatic reversal for Snap, Inc., which first introduced the feature in 2013.\n  Since then, Snap has defended the feature in the face of warnings from safety advocates who&#39;ve argued that it encourages reckless driving. The company has also faced lawsuits from the families of those who have been injured or killed in car crashes where drivers were moving at excessive speeds, allegedly to score bragging rights on the app.\n    &#34;Lives will be saved. Crashes will be prevented, but the lawyer in me says, &#39;My God, why did it take so long?&#39;&#34; said Joel Feldman, the co-founder of the nonprofit End Distracted Driving, one of the groups that urged Snapchat to remove the speed filter.\n  What exactly led Snap to scrap the feature now is unclear. Over several weeks, NPR asked Snap a series of questions about why it had stood by the speed filter for so long. A company spokeswoman told NPR, &#34;Nothing is more important than the safety of our Snapchat community.&#34;\n      The feature &#34;is barely used by Snapchatters,&#34; she said on Thursday. &#34;And in light of that, we are removing it altogether.&#34;\n  She said the company started removing the feature this week, but it may be a couple weeks before it disappears from the app for all of its 500 million monthly active users.\n    The feature has been linked to a number of deadly or near-fatal car crashes, often with teenagers behind the wheel.\n  A 2016 collision involving the speed filter left  a driver in Georgia with permanent brain damage. That same year, the feature was tied to the  death of three young women in a Philadelphia car accident. Also that year,  five people in Florida died in a high-speed collision that reportedly involved the speed filter. In 2017,  three young men in Wisconsin clocked a speed of 123 miles per hour on the feature before they crashed into a tree and died.\n     In response, Snap made a number of changes. It moved the speed feature from a &#34;filter&#34; to a &#34;sticker&#34; in Snapchat, lowering its prominence. It also added a &#34;Don&#39;t Snap and drive&#34; warning that would appear every time someone used the feature. The company also quietly capped the top speed for which a post could be shared for &#34;driving speeds&#34; at 35 mph. When NPR inquired about this in May, the Snap spokeswoman confirmed that the limitation had been imposed. Yet the company refused to simply drop the feature.\n    And the legal battles continue. Naveen Ramachandrappa, a California lawyer who sued Snap over the speed filter,  wrote in a lawsuit that some teenage users of Snap believed they would be rewarded with digital prizes and trophies for recording a speed in excess of 100 miles per hour.\n  &#34;Or at the very least, they want to find out if they will be so rewarded and so they drive at excessive speeds to see what will happen,&#34; he wrote.\n  A federal appeals court  in May ruled that the family of the young men who died in the Wisconsin crash should be able to sue Snap for being negligent in designing a product that led to foreseeable harm. Snap  this week asked the trial court to toss the case out, arguing the speed filter did not cause the car accident.\n  A Snap spokesperson says of the some 5 billion &#34;Snaps&#34; users make every day, the speed feature is used in just a few thousand of them, suggesting that it was unpopular.\n  Irina Raicu, the director of the Internet Ethics Program at Santa Clara University, said increasingly tech companies are doing risk assessments of new products and features to try to get ahead of possible abuses.\n  &#34;If you have a new tool or feature: What does it allow? What does it invite? And what does it incentivize? There are degrees of responsibility based on those three things,&#34; she said. &#34;This Snapchat filter seems like maybe it was missing some of those conversations initially.&#34;\n  &#34;Sometimes.&#34; Raicu added, &#34;one of the most thoughtful ways to deploy a product is to never deploy it at all.&#34;", "posttime": "2021-06-18 00:20:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,消除,snap,速度", "title": "Snap消除了Snapchat的速度过滤器，让用户显示他们在美国法院裁定的那样争夺致命车祸后 ", "title_en": "Snap eliminates Snapchat's speed filter, which let users show how fast they were moving, after a US court ruled that Snap could be sued for a fatal car crash", "transed": 1, "url": "https://www.npr.org/2021/06/17/1007385955/snapchat-ends-speed-filter-that-critics-say-encouraged-reckless-driving", "via": "", "real_tags": ["美国", "消除", "snap", "速度"]}, {"category": "", "categoryclass": "", "imagename": "6538a6607a8518da75abc2dd151526a4.png", "infoid": 1066500, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Textual是使用Ricth作为渲染器的Python的TUI（文本用户界面）框架。  最终目标是能够快速创建富有终端应用，这些应用程序尽可能良好（终端仿真器施加的限制内）。  丰富的Tui将与父母项目紧密地融合，富裕。 任何现有渲染可用于更动态的应用程序。  该项目目前正在进行工作，可能无法使用一段时间。 如果您有任何请求/建议，请关注@Willmcgugan进行进度更新，或在讨论中发布。 ", "note_en": "Textual is a TUI (Text User Interface) framework for Python using  Rich as a renderer.\n The end goal is to be able to rapidly create  rich terminal applications that look as good as possible (within the restrictions imposed by a terminal emulator).\n Rich TUI will integrate tightly with its parent project, Rich. Any of the existing  renderables can be used in a more dynamic application.\n This project is currently a work in progress and may not be usable for a while. Follow  @willmcgugan for progress updates, or post in Discussions if you have any requests / suggestions.", "posttime": "2021-06-18 00:19:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python", "title": "Textual：具有丰富作为渲染器的Python文本用户界面 ", "title_en": "Textual: A Python Text User Interface with Rich as the Renderer", "transed": 1, "url": "https://github.com/willmcgugan/textual", "via": "", "real_tags": ["python"]}, {"category": "", "categoryclass": "", "imagename": "2dba58696ae257ac6e95fb2136e75b10.jpeg", "infoid": 1066499, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DOT-COM BEST再次发生在我们的鼻子下吗？它可能似乎是一个奇怪的主张，但是在1999年末和2000年上半年的投机动弹与2000年上半年之间存在显着相似，并且在过去九个月内发生了什么在清洁能源，电动汽车，大麻的时尚领域发生了什么股票和spacs。\n  如果并行继续它为加入过量的投资者而难以生病。 Tesla领导的时尚股票 - 已经将四分之一的时间降至今年的高位。但有理由希望，与世纪之交不同，不适不会传播到市场其他地方。\n  相似之处都在绩效和投资者行为。 1999年底担心互联网股票失踪达到纳斯达克综合83％，从9月底达到2000年3月的顶级。从去年9月到今年的高位，伊万科的太阳能交易所交易基金跃升了88％，Blackrock的全球清洁能源ETF跃升了81％，而Ark的创新ETF 70％。\n  后来，领先的大型泡沫股票思科上涨了133％，而今天的主要泡沫股 - 特斯拉 - 从9月份到峰值的110％上涨。纯DOT-COM区域大致增加三倍，正如大麻基金都有这次。\n  即使是一年中的时间也是如此，时尚部门在今年2月和3月达到顶峰，而DOT-COM高2000年3月10日达成。在泡沫爆发后，在六月中期的表现 - 现在 - 随之而来同样的课程，亏损来自今年的泡沫区域的第三个，并在2000年纳斯达克亏损了四分之一（思科持续了一点）。\n  您将收取$ +税（如果适用）为华尔街日记。您可以随时在客户中心的任何时间更改帐单偏好或致电客户服务。您将在率或条款的任何变化提前通知您。您可以随时通过调用客户服务来取消订阅。 ", "note_en": "Is  the dot-com bust happening again right under our noses? It might seem an odd claim, but there is a remarkable resemblance between the speculative boom-to-bust of late 1999 and the first half of 2000 and what’s happened over the past nine months in the fashionable areas of clean energy, electric cars, cannabis stocks and SPACs.\n  If the parallel continues it bodes ill for investors who joined the excess late. The trendy stocks— led by Tesla—are already down a quarter to a third from this year’s highs. But there are reasons to hope that, unlike at the turn of the century, the malaise won’t spread to the rest of the market.\n  The similarities are in both performance and investor behavior. The late-1999 fear of missing out on internet stocks inflated the Nasdaq Composite 83% from the end of September to its March 2000 top. From September last year to this year’s highs, Invesco ’s solar exchange-traded fund jumped 88%, Blackrock’s global clean energy ETF jumped 81%, and  Ark’s innovation ETF 70%.\n  Back then the  leading large bubble stock Cisco rose 133%, while today’s leading bubble stock—Tesla—was up 110% from September to peak. Pure dot-com areas roughly tripled, just as cannabis funds have this time.\n  Even the time of year is similar, with the fashionable sectors peaking in February and March this year, while the dot-com high was reached on March 10, 2000. After the bubble burst, the performance by mid-June—now—followed the same course, with losses of a quarter to a third from this year’s frothy areas, and a loss of a quarter in the Nasdaq in 2000 ( Cisco held up a little longer).\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-06-18 00:18:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,泡沫,bubble,股票", "title": "特斯拉和其他泡沫股已经像2000年一样放气 ", "title_en": "Tesla and Other Bubble Stocks Have Deflated Just Like 2000", "transed": 1, "url": "https://www.wsj.com/articles/tesla-and-other-bubble-stocks-have-deflated-just-like-2000-11623928248", "via": "", "real_tags": ["特斯拉", "泡沫", "bubble", "股票"]}, {"category": "", "categoryclass": "", "imagename": "47e7a2d10567e247ec70f858d1ec0df6.jpg", "infoid": 1066498, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一个可能横向上来：给予足够的时间，母亲大自然有一个意想不到的礼物，可以把它的小生物变成海鲜。一份新报告已经破解了开放的发现，没有少于五个记录的案件，开始的物种，即其他东西最终进化到相同的螃蟹类动物 - 硬壳和所有。\n 该研究在最近被流行的力学升起后，最近在最近被流行的机制获得了嗡嗡声，最初于2017年在林南社会的生物学杂志中发表，并发现许多甲壳类动物之间的“存在着惊人的结构相干性”分别演变以分享“蟹肉状形式”。\n  所研究的物种所有都开发了相同的基本“螃蟹状习惯，”或虽然具有不同的进化祖先，但仍然具有定义身体的基本外部结构。随着一定程度的特定变化，它们都进化了类似的硬化壳，同样熟悉的宽，平坦的形状。但在对科学世界的第一次发现中，研究甚至发现它们的内部解剖结构 - 像血管和神经系统一样的东西 - 也开始随着时间的推移而同样安排自己。\n 根据该研究的情况，这是这种过程的过程是咒语 - 根据其希腊词源，螃蟹 -  ifmices的螃蟹。研究人员认为，尽管局部差异，咒语发生的原因是所有物理：时间，温度，重力，以及浅水中的生活条件达到所有趋同 - 似乎 - 似乎是一个完全好的原始甲壳类动物并将其压在一起变得更加螃蟹。\n 并行进化性状并不闻于于其他物种（PM注意Marsupials在不同时间的单独袋发育，作为一个例子）。但是，如果你是一个沿着岸边某处的新初学，那么寻求在进化时间表中发挥浪潮，请注意 - 你的后代可能最终通过一对大眼睛研究他们的遥远的家庭历史。 ", "note_en": "This one may come at you sideways: Given enough time,  Mother Nature has an unexpected gift for turning its little living creations into seafood. A new report has cracked open the discovery that, in no fewer than five documented cases, species that started out as something else ended up evolving into the same crab-like animal —  hard shell and all.\n The study, which got the internet boiling with buzz after being picked up recently by   Popular Mechanics, was originally published in 2017 in the   Biological Journal of the Linnean Society, and finds that “amazingly similar structural coherences exist” between a number of crustacean species that evolved separately to share “crab-like forms.”\n  The studied species all developed the same basic “crab-like habitus,” or basic outer structure that defines their body, despite having differing evolutionary ancestors. With some degree of specific variation, they all evolved similar hardened shells, in the same familiar broad, flat shape. But in a first discovery for the scientific world, the study even found that their internal anatomical structures — things like the vascular and nervous systems — also began to arrange themselves similarly over time.\n The process by which this keeps happening, according to the study, is carcinization — literally, according to its Greek etymology, the crab-ifying of species. Researchers believe that, despite  local differences, the reasons carcinization occurs are all physical: time, temperature, gravity, and the similar conditions of life in shallow aquatic reaches all converge — time and time again, it seems — to take a perfectly good original crustacean and pressure it into becoming more crab-like.\n Parallel evolutionary traits aren’t unheard of across other species (with  PM noting marsupials’ separate pouch development in different times and places, as one example). But if you’re an upstart species somewhere along the shore who’s looking to  make waves in the evolutionary timeline, watch out — your descendants may just end up studying their distant family history through a pair of beady eyes.", "posttime": "2021-06-18 00:18:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "一切顺利,evolving,进化", "title": "为什么一切顺利成螃蟹 ", "title_en": "Why is everything evolving into crabs", "transed": 1, "url": "https://www.syfy.com/syfywire/evolution-turns-different-species-into-crabs", "via": "", "real_tags": ["一切顺利", "evolving", "进化"]}, {"category": "", "categoryclass": "", "imagename": "d0840234e67c048c0ffe195a4b722f92.jpg", "infoid": 1066497, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天，6月16日，创新的工作组，增长和监管改革发表了一份报告，概述了他们的愿景，“我们现在已经离开了欧盟的监管方法”。\n 作为“独立报告”的是由三个保守派议员的特遣队撰写的，由保守派总理选择，以向保守派政府追求追求令人讨厌的议程。\n 然而，该报告是重要的，因为它标志着政府对GUT GDPR和您的隐私权的愿望。其中一些建议可能会在不久的将来呈现为政策提案。\n 开放权利集团审查了他们提出的“用新英国数据保护框架替换GDPR”：它只是六页，但与公然谎言凭借公然的谎言和对诸如担任潜在政府提案的少数事实的闭路解释。\n  该报告将其案件制定了解除GDPR以“加速数字经济增长，提高生产力和人们的生命，从繁重的合规要求中释放”。在这样做时，他们将GDPR描绘为“规范和对较小的公司和慈善机构的规范性和不灵活，特别是繁琐”。\n 然而，对慈善机构，中小企业和自愿组织的繁重依从性要求是执法不佳的直接结果，而不是GPR本身。例如，如果您的云服务使我们执法当局或广告商可用的敏感信息，您将努力遵守法律义务。这是信息专员办公室应该发挥的地方，并确保在符合安全标准之前从市场上删除不安全的产品 - 实质上是监管机构的作用。然而，ico正在受到政府对“商业友好态度”和“成长导向的监管方法”的令人难过的痴迷，导致避免难题的缓慢和沉积的执法。\n 缺乏ICO执法的缺陷在第二个例子中更加明显，即该报告对GDPR提出提出，即科技巨头轰炸饼干横幅和“复杂同意要求”的事实。开放权利小组和其他人在2018年撤回了在线广告实践的投诉。ico在那年内发现了亚特科特的行业，但随后在“行业参与”和肩膀上拍摄了很长的过程留下这些非法做法。 \n一个适当强制的GDPR很快就会摆脱饼干横幅，因为他们站在非法经营的行业面前，并且不提供有意义的同意。我们知道，当被问到时，大约96％的Apple用户拒绝被追踪。用户不想被Cookie墙壁缠绕，而且他们也不想被追踪。但是，报告的解决方案完全删除了同意书。\n  该报告在提出从GDPR废除第22条时，该报告达到了可怕的，不连贯的想法，并从自动决策中消除人类审查，因为它“使组织繁重，昂贵和不切实际的组织使用AI来自动化程序” 。\n 必须写入这一点是令人尴尬的，但确实有很好的原因，为什么人类审查是算法决策所必需的。首先，这一要求不适用于AI的任何使用，而是仅适用于产生法律效应或以其他方式显着影响个人的决定。如果一项产生法律义务的决定不可批评，AI将有效地成为一个楼层，以证明任何类型的滥用行为：想想根据无法理解的自动决定申请债务的公司，或政府否认福利的自动化决定基于无法仔细审查的标准的个人。\n 如果你把它进入视角，那就摆脱第22条的说明更令人担忧。随着A级惨败，整个一代人在讨论“他妈的算法”的街道上，遵循他们的考试结果的不公平自动化。现在，尘埃已经解决，政府似乎致力于确保他们的下一个错误并不符合任何未来的审查。抄写第22条将删除英国学生之间的唯一保障措施，也是一个不公平的拒绝进入大学的一生机机会。\n 本报告通过强调“允许改变机器学习措施并删除GDPR所需的算法决策的人为审查尤为重要。该报告对这一点的坚持不仅可能对持有政府负责的规则的申诉展示，但可能非常仔细计算步骤。在荷兰，政府不得不在一份报告后辞职，该报告显示了如何以公开歧视的方式对移民歧视欺诈进行自动化决策。这也可能担心英国政府，这计划为内阁办公室引入新的权力，以做数据匹配和检测欺诈以及其他罪行。\n  关于需要提出的人工智能数据保护障碍的原因有一个决定性的。在描述GDPR“阻碍”AI开发的情况下，他们就陈述了这一点\n “GDPR第5条要求”收集规定，明确和合法目的“和”足够，相关，并限于必要的“的数据。这些限制限制了AI，因为它们在理解其潜在价值之前阻止AI组织收集新数据，并且它们也意味着现有数据不能为新颖的目的重用“。 \n事实上，GDPR有规定，允许进一步处理统计和其他研究目的的数据，并提供额外的保障措施。但是，本段终于删除了该法案，并表现出不改革的意图，而是完全取消数据保护。目的和储存限制是个人免于滥用的任何保护的基石。如果我向NHS提供联系跟踪的信息，这些信息正在向当局或雇主传递给当局或检查我是否参加了罢工，这是一种滥用，它毫不含糊地让我有风险。\n 值得注意的是，目的和存储限制单独在GDPR下的法律要求。欧洲人权公约规定，禁止在不需要或比例的方式干扰一个人的个人生活，其中目的和储存限制是一个明确的发散。此外，欧洲委员会数据保护公约还规定了“收集数据”，以“用于明确，指定和合法的目的，而不是以与这些目的不兼容的方式处理”，并“保留......不再是必要的方式处理处理这些数据的数据“。\n 因此，这些计划不仅与数据保护权的概念相冲突;它还将标志着英国政府在国际舞台上流氓的另一个例子，并且通过签署欧洲人权公约并批准“科技民营合作社”数据保护公约，本案的故意忽视了他们以前致力于的国际义务。这种建议的方法应该在欧盟响铃铃声，该欧盟试图根据英国坚持这些义务来建立个人数据的自由流动的制度。\n  政府在去年致力于对冠状病毒的反应中的所有可能的数据保护法，现在解释了摆脱数据保护的“繁重的处方”的必要性。政府跌跌撞撞地削弱了一个级别的考试结果，现在寻求删除如果他们坚持下将持有他们负责任的规定。最后，政府正在制作所有这一切，以据称涉及欧盟街区的机会。\n 在这样做时，报告的作者和政府似乎致力于蒸汽劳动，任何合理的考虑因素：人权，安全和英国在国际阶段的声誉。最终，如果他们被允许进行，他们不会让英国业务受益，而是帮助种子不道德和歧视性的商业实践，这将不仅会受到数字行业的信任，而且在公民和社会之间不仅受到信任。\n 申诉不应该，不能成为英国政策制定的基础。将影响我们的权利和我们生活的社会的决定不能基于填写谎言，遗漏和歪曲的报告。\n 换句话说，本报告应该由国会议员和政府拒绝。其提案值得被埋葬，但我们担心可能会通过立法提案来解决。请加入我们的邮件列表，保持联系，并帮助我们打击这些令人震惊的提案。 \n注册以接收有关开放权限组的工作以保护数字权利的更新。  订阅 ", "note_en": "Yesterday, on June 16,  the Taskforce on Innovation, Growth and Regulatory Reform published a report outlining their vision to “refresh the UK’s approach to regulation now that we have left the EU”.\n What’s being presented as an “independent report” has been written by a taskforce of three conservative MPs, selected by a conservative Prime Minister to advise a conservative Government in the pursuit of their deregulatory agenda.\n Yet, the Report is significant, because it signals the Government’s desire to gut GDPR and your privacy rights. Some of these suggestions are likely to appear as policy proposals in the near future.\n Open Rights Group reviewed their proposal to “Replace GDPR with a new UK framework for data protection”: it is only six pages, but riddled with blatant lies and an obtuse interpretation of the few facts presented to bless potential Government proposals.\n  The Report builds its case to deregulate GDPR to “accelerate growth in the digital economy, and improve productivity and people’s lives by freeing them up from onerous compliance requirements”. In doing so, they depict the GDPR as “prescriptive and inflexible and particularly onerous for smaller companies and charities to operate”.\n However, onerous compliance requirements on charities, SMEs and voluntary organisations are a direct result of poor enforcement, not GDPR itself. For instance,  if your cloud service makes sensitive information available to US law enforcement authorities or advertisers,  you will have a hard time complying with legal obligations. This is where the Information Commissioner’s Office should come into play, and ensure that unsafe products are removed from the market until they meet safety standards — in essence the role of a Regulator.  The ICO, however, is being held by Government’s unsavoury obsession with “business friendly attitude” and “growth-oriented regulatory approaches”, resulting in a slow and patchy enforcement that  avoids the difficult questions.\n The deficiencies from the lack of ICO enforcement are even more evident in the second example that the Report raises against the GDPR, namely the fact that tech giants are bombarding users with cookie banners and “complex consent requests”. Open Rights Group and others lodged a complaint against online advertisement practices back in 2018.  The ICO found the adtech industry to be operating illegally already in that year, but then got lost in a long process of  “industry engagement” and pats on the shoulders  that left these illegal practices unchallenged.\n A properly enforced GDPR would soon get rid of cookie banners, as they stand in front of an industry that is operating unlawfully, and do not provide meaningful consent. We know that,  when asked simply, around 96% of Apple’s users declined to be tracked. Users don’t want to be pestered by Cookie Walls, and they also don’t want to be tracked. The Report’s solution, however, is remove consent entirely.\n  The Report reaches its peak in scary, incoherent ideas when proposing to scrap article 22 from the GDPR, and eliminate human review from automatic-decision making, because it “makes it burdensome, costly and impractical for organisations to use AI to automate routine processes”.\n It is embarrassing to have to write this, but there are indeed good reasons why human review is required for algorithmic decision making. First of all, this requirement does not apply to any use of AI, but only to decisions that produce legal effects or otherwise significantly affect individuals. If a decision that produces a legal obligation wasn’t reviewable, AI would effectively become a backdoor to justify any kind of abuse: think of a company claiming a debt against you based on an automated decision that cannot be understood, or Government denying benefits to an individual based on criteria that cannot be scrutinised.\n The stated intent to get rid of article 22 is even more worrying if you put it into perspective. With the A-level fiasco, an entire generation hit the streets chanting “fuck the algorithm”, following the unfair automated computation of their exams results. Now that the dust has settled, Government seem committed to ensure that their next mistake does not meet any future scrutiny.  Scrapping article 22  would remove the only safeguard that stood between UK students and an unfair denial of their once-in-a-life chance to enter the University.\n This Report concludes by emphasising that “It is particularly important that changes are made to permit automated decision-making for machine learning and to remove the human review of algorithmic decisions required by GDPR”. The Report’s insistence on this point may not be only a display of grievance against a rule that holds Government accountable, but may very well be a carefully calculated step. In the Netherlands,  Government had to resign following a report that showed how automated-decision making for detecting tax fraud was being used in an openly discriminatory manner against migrants. This may be worrying the UK Government as well, which  is planning to introduce new powers for the Cabinet Office to do data matching and detecting frauds as well as other crimes.\n  There is a final aspect of the reasoning around data protection obstacles to Artificial Intelligence that needs to be raised. In describing how GDPR “hinders” AI development, they go as far as stating that\n “Article 5 of GDPR requires data be “collected for specified, explicit and legitimate purposes,” and “adequate, relevant and limited to what is necessary”. These restrictions limit AI because they prevent AI organisations from collecting new data before they understand its potential value and they also mean that existing data cannot be reused for novel purposes”.\n As a matter of fact, there are provisions in the GDPR that allow to further process data for statistical and other research purposes, provided that additional safeguards are put into place. However, this paragraph finally dropped the act, and shown the intention not to reform but to cancel data protection altogether. Purpose and storage limitation are the cornerstone of any safeguards for individuals against abuses. If I am providing my information to the NHS for contact tracing and this information is being passed on to the authorities or to my employer to check if I took part to a strike, this is an abuse, and it unequivocally puts me at risk.\n It is worth noting that purpose and storage limitation aren’t legal requirements under the GDPR alone. The European Convention of Human Rights stipulates  the prohibition from interfering with one’s personal life in a manner that is not necessary or proportionate, of which  purpose and storage limitation are a clear emanation. Furthermore, the  Council of Europe data protection convention also provides that data can be “collected for explicit, specified and legitimate purposes and not processed in a way incompatible with those purposes”, and “preserved … for no longer than is necessary for the purposes for which those data are processed”.\n Thus, these plans wouldn’t only conflict with the very notion of data protection rights; it would also mark  yet another instance where the UK Government went rogue on the international stage, and wilfully disregarded international obligations they previously committed to — in this case, by signing the European Convention of Human Rights and ratifying the CoE data protection convention. This proposed approach should ring alarm bells in the EU,  which is trying to establish a regime for the free flow of personal data  based on UK adherence to these obligations.\n  Government spent the last year breaking every possible data protection laws in their response to Coronavirus, and now explains the need to get rid of data protection’s “onerous prescriptions”. Government stumbled over A-level exam results and now seeks to remove the provisions that would have held them accountable if they insisted. Finally, Government is doing all of that to mark the opportunities that departing from the EU block allegedly created.\n In doing so, the Reports’ authors and the Government seem committed to steam roll any reasonable consideration: human rights, our safety, and UK reputation on the international stage. In the end, if they are allowed to proceed, they will not benefit UK business, but rather help seed unethical and discriminatory business practices, that will undermine trust not just in digital industries, but also between citizens and society.\n Grievance should not and cannot be the basis for UK policy making. Decisions that will affect our rights and the society we live cannot be based on reports filled with lies, omissions, and misrepresentations.\n In other words, this Report ought be repudiated by MPs and Government. Its proposals deserve to be buried, but we fear may surface through legislative proposals all too quickly. Please  join our mailing list to stay in touch and help us fight these appalling proposals.\n Sign up to receive updates about Open Rights Group’s work to protect digital rights.\n Subscribe", "posttime": "2021-06-18 00:18:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据保护,replace,gdpr", "title": "用英国数据保护框架取代GDPR的建议 ", "title_en": "Proposals to replace GDPR with UK data protection framework", "transed": 1, "url": "https://www.openrightsgroup.org/blog/stand-up-for-privacy", "via": "", "real_tags": ["数据保护", "replace", "gdpr"]}, {"category": "", "categoryclass": "", "imagename": "770d38d36279a5c896cf993f765d9aba.jpg", "infoid": 1066496, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sergey Toshin，Mobile App安全启动的创始人超越，在博客文章中表示，漏洞与Google App如何依赖于未与应用程序捆绑在一起的代码有关。许多Android应用程序包括Google App，减少了他们的下载大小和通过依赖于安装在Android手机上安装的代码库所需的存储空间。\n 但Google App的代码中的缺陷意味着它可以被欺骗，可以欺骗从同一设备上的恶意应用程序而不是合法的代码库中删除代码库，允许恶意应用程序继承Google应用程序的权限并授予它近乎完全访问对用户的数据。该访问包括访问用户的Google帐户，搜索历史记录，电子邮件，短信，联系人和呼叫历史记录，以及能够触发麦克风和相机，并访问用户的位置。\n Toshin说，该恶意应用程序将不得不推动一次对工作的攻击，但攻击发生在没有受害者的知识或同意。他说，删除恶意应用程序不会从谷歌应用程序中删除恶意组件。\n 谷歌发言人告诉TechCrunch，该公司上个月修复了漏洞，并且没有证据表明缺陷已被攻击者利用。 Android内置的恶意软件扫描仪Google Play Protect，旨在阻止恶意应用程序安装。但没有安全功能是完美的，并且恶意应用程序之前已通过其网。\n Toshin表示，Google App漏洞类似于今年早些时候在Tiktok启动中发现的另一个错误，这可能允许攻击者窃取Tiktok用户的会话令牌来控制他们的帐户。\n 过度发现已经找到了其他几种类似的漏洞，包括Android的Google Play应用程序和更多最近的应用程序预先安装在三星手机上。 ", "note_en": "Sergey Toshin, founder of mobile app security startup Oversecured, said  in a blog post that the vulnerability has to do with how the  Google app relies on code that is not bundled with the app itself. Many Android apps, including the Google app, reduce their download size and the storage space needed to run by relying on code libraries that are already installed on Android phones.\n But the flaw in the Google app’s code meant it could be tricked into pulling a code library from a malicious app on the same device instead of the legitimate code library, allowing the malicious app to inherit the Google app’s permissions and granting it near-complete access to a user’s data. That access includes access to a user’s Google accounts, search history, email, text messages, contacts and call history, as well as being able to trigger the microphone and camera, and access the user’s location.\n The malicious app would have to be launched once for the attack to work, Toshin said, but that the attack happens without the victim’s knowledge or consent. Deleting the malicious app would not remove the malicious components from the Google app, he said.\n A Google spokesperson told TechCrunch that the company fixed the vulnerability last month and it had no evidence that the flaw has been exploited by attackers. Android’s in-built malware scanner, Google Play Protect, is meant to stop malicious apps from installing. But no security feature is perfect, and malicious apps have slipped through its net before.\n Toshin said the Google app vulnerability is similar to another bug discovered by the startup  in TikTok earlier this year, which if exploited could have allowed an attacker to steal a TikTok user’s session tokens to take control of their account.\n Oversecured has found several other similar vulnerabilities, including  Android’s Google Play app and more recently  apps pre-installed on Samsung phones.", "posttime": "2021-06-17 23:40:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,google,谷歌,程序,bug", "title": "谷歌的Android应用程序中的安全错误将用户的数据置于风险 ", "title_en": "\n\t\t\t\tA security bug in Google’s Android app put users’ data at risk\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/a-security-bug-in-googles-android-app-installed-on-billions-of-devices-put-user-data-at-risk/", "via": "", "real_tags": ["android", "google", "谷歌", "程序", "bug"]}, {"category": "", "categoryclass": "", "imagename": "70bc4f1cc7b6d69c713d2f8531ec9ce1.jpg", "infoid": 1066495, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司以前在今年早些时候在选择市场中测试了REELS广告，包括印度，巴西，德国和澳大利亚，然后将这些测试扩展到加拿大，法国，U.K.和美国的测试。新格式的早期采用者包括BMW，Nestlé（Nespresso），Louis Vuitton，Netflix，Uber等品牌等品牌。\n Instagram告诉我们，广告将在大多数地方出现在大多数地方用户查看卷轴内容，包括在卷轴标签上，在故事中的卷轴，浏览器中的卷轴，以及Instagram进料中的卷轴，并将在用户发布的单个卷轴之间出现。然而，为了提供卷轴广告，用户首先需要处于沉浸式，全屏卷轴观众。\n   该公司不能说用户可能会看到卷轴广告的频率，并指出观众可能遇到的广告数量会根据他们使用Instagram的方式而有所不同。但是，该公司正在监视广告本身的用户情绪，而且在商业上的卷轴上的整体。\n 与Instagram的其他广告产品一样，卷轴广告将通过基于拍卖的模型推出。但到目前为止，Instagram正在下降，以分享这些广告如何根据测试来分享任何类型的性能指标。它也没有提供广告商，任何可以帮助他们开始使用卷轴广告的创造工具或模板。相反，Instagram喜欢假设广告商在手头或知道如何使他们的创造性资产有所作为，因为卷轴广告与其他地方发现的其他垂直视频广告的相似性，包括Instagram的竞争对手。\n  虽然垂直视频已经显示了将消费者推向电子商务购物网站的可能性，但Instagram尚未利用卷轴广告将用户驱动到其内置Instagram商店，但似乎是它尝试时的自然下一步将其应用程序的不同部分联系在一起。\n 但是，也许在此步骤中，Instagram需要使卷轴成为一个更引人注目的目的地 - 其他Tiktok竞争对手，现在包括Snap和YouTube  - 通过提供直接资助创建者内容来完成的。与此同时，Instagram已经提出了直接选择Tiktok Stars。\n Instagram Reels广告的推出遵循Tiktok攀登广告价格的消息。彭博本月举行的是，Tiktok现在询问美国的首页收购广告，截至第三季度，Q4将达到180万美元，假期超过200万美元。虽然公司仍在构建其广告团队和广告商尚未将其视频预算的大量分配给应用程序，但往往遵循用户的增长 - 而Tiktok现在拥有超过1亿美元的每月活跃用户。 \nApps，Instagram和Tiktok都在全球范围内拥有超过10亿美元的活动用户，但卷轴只是较大的Instagram平台的一部分。 为了比较，Instagram故事由大约5亿用户使用，这表明Instagram能够将流量驱动到其应用程序的不同区域。 Instagram拒绝分享有多少用户卷轴截至今天。 ", "note_en": "The company had  previously tested Reels ads in select markets earlier this year, including India, Brazil, Germany, and Australia, then  expanded those tests to Canada, France, the U.K. and the U.S. more recently. Early adopters of the new format have included brands like BMW, Nestlé (Nespresso), Louis Vuitton, Netflix, Uber, and others.\n Instagram tells us the ads will appear in most places users view Reels content, including on the Reels tab, Reels in Stories, Reels in Explore, and Reels in your Instagram Feed, and will appear in between individual Reels posted by users. However, in order to be served a Reels ad, the user first needs to be in the immersive, full-screen Reels viewer.\n   The company couldn’t say how often a user might see a Reels ad, noting that the number of ads a viewer may encounter will vary based on how they use Instagram. But the company is monitoring user sentiment around ads themselves, and the overall commercially of Reels, it says.\n Like Instagram’s other advertising products, Reels ads will launch with an auction-based model. But so far, Instagram is declining to share any sort of performance metrics around how those ads are doing, based on tests. Nor is it yet offering advertisers any creator tools or templates that could help them get started with Reels ads. Instead, Instagram likey assumes advertisers already have creative assets on hand or know how to make them, because of Reels ads’ similarities to other vertical video ads found elsewhere, including on Instagram’s competitors.\n  While vertical video has already shown the potential for driving consumers to e-commerce shopping sites, Instagram hasn’t yet taken advantage of Reels ads to drive users to its built-in  Instagram Shops, though that seems like a natural next step as it attempts to tie the different parts of its app together.\n But perhaps ahead of that step, Instagram needs to make Reels a more compelling destination — something other TikTok rivals, which now include both  Snap and  YouTube — have done by funding creator content directly. Instagram, meanwhile, had  made offers to select TikTok stars directly.\n The launch of Instagram Reels ads follows news of TikTok’s climbing ad prices.  Bloomberg reported this month that TikTok is now asking for more than $1.4 million for a home page takeover ad in the U.S., as of the third quarter, which will jump to $1.8 million by Q4 and more than $2 million on a holiday. Though the company is still building its ads team and advertisers haven’t yet allocated large portions of their video budget to the app, that tends to follow user growth — and TikTok now has over 100 million monthly active users in the U.S.\n Both  apps, Instagram and TikTok, now have over a billion monthly active users on a global basis, though Reels is only a part of the larger Instagram platform. For comparison, Instagram Stories is used by some  500 million users, which demonstrates Instagram’s ability to drive traffic to different areas of its app. Instagram declined to share how many users Reels has as of today.", "posttime": "2021-06-17 23:40:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,tiktok,instagram", "title": "Instagram的Tiktok竞争对手，卷轴，在全球范围内推出广告 ", "title_en": "\n\t\t\t\tInstagram’s TikTok rival, Reels, rolls out ads worldwide\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/instagrams-tiktok-rival-reels-rolls-out-ads-worldwide/", "via": "", "real_tags": ["广告", "tiktok", "instagram"]}, {"category": "", "categoryclass": "", "imagename": "f91557151389a7dd945327207c11a850.gif", "infoid": 1066494, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它仍然让我的脑海思想，没有人试图复制我们正在做的事情。 2015年初，2016年和2017年初有10或12个人行道公司。其中许多人在少数例外，出生了。\n   引用的第一部分是看似明显的真理，仍然值得重申在这里。首先：如果您发现在市场上的需求，您相信您可以解决，请参加它。其次：机器人和自动化的机会可能比我们考虑更多。第二句似乎否定了第二个点到某种程度，但更多的是，我认为这是对这个行业的无情的起诉。\n  高风险/高奖励，以及所有的风险，但即使有一个伟大的主意，聪明的人和健康的提升，仍然可以在你脸上落地你平坦的时间。现在，似乎，时间是对的。交付机器人是一个由大流行，在利益，创新方面​​加速的行业，当然是资金。\n  正如我上周指出的那样，我与Gatik联合创始人兼首席工程师Apeksha Kumavat，Nuro Jones Satrom和Starship Technologies联合创始人和CTO Ahti Heinla在上周的TC会议：移动活动。这是Kumavat不得不说的加速：\n 甚至在大流行袭击之前，整个电子商务趋势已经上升。没有人希望他们在一周或两周后完成的交货。每个人都希望他们在同一天完成，以及路边提取选项。甚至在大流行击中之前，对电子商务和按需交付的期望已经存在。在2020年3月后，我们所看到的是这种轨迹的巨大增加。\n 来自NURO的更多大消息（尝试说五次，快速），送货公司刚刚与联邦快递签署了交易，标志着包裹交付。\n  本周，我也谈到了另一对机器人初创公司，这些初创公司从大流行中出现了大规模的回合。基于博尔德的SCYThe从Htealth中出现，获得了1380万美元的A系列，使其总额额为1860万美元。公司专业从事园林绿化机器人，从割草机开始。鉴于潜在的市场规模，我真的很惊讶，没有更多的公司这样做。 \n有趣的是，该公司正在提供raas（机器人作为服务）模式，这在空间中越来越受欢迎。在这里，它根据割草的数量为客户充电。\n  与此同时，湾区尘土飞扬的机器人筹集了1650万美元的系列，使其总额筹集成2370万美元。建设是一个巨大的潜在市场，具有很多兴趣和球员。尘土飞扬的产品很有趣，有效地独特，有效地在建筑工地的地板上印刷计划。该公司将其比较“宜家的指示”。 Tessa Lau的联合创始人和首席执行官：\n 我们刚刚发布了我们的第三代硬件平台，该平台是由我们的团队在山景中的地上设计，以便专门用于在建筑工地生产准确和快速的布局。自2018年下降以来，我们一直在致力于这一产品，并将经验教训纳入了超过100万平方英尺的生产布局进入这一第三代设计。\n   IEEE Spectrum发现了几个星期前实际宣布的机器人。据ollie出现的纸张，轮式机器人比实用更实验，但它能够有些非常令人印象深刻的壮举，没有：\n 实验结果表明，线性输出调节可以维持机器人的站立，并且非线性控制器可以在远离均衡点的初始起始角度下或在变化的机器人高度下平衡机器人。\n 没有关于oollie的信息，但它肯定很有趣。 ", "note_en": "It still boggles my mind that nobody has tried to copy what we’re doing. There were 10 or 12 sidewalk robot companies in early 2015, 2016 and 2017. Many of them, with a few exceptions, went out of business.\n   The first part of the quote points to seemingly obvious truths that are still worth reiterating here. First: If you spot a need in the market you believe you can address, go for it. Second: There are likely even more opportunities for robotics and automation than we’ve considered. The second sentence seemingly negates the second point to some degree, but more than anything, I think it’s an indictment of how merciless this industry can be.\n  High risk/high reward, and all that, but even with a great idea, smart people and a healthy raise, bad timing can still land you flat on your face. For now, it seems, the timing is right. Delivery robotics are very much an industry that has been accelerated by the pandemic, in terms of interest, innovation and, of course, funding.\n  As I noted last week,  I spoke to Gatik co-founder and chief engineer Apeksha Kumavat, Nuro head of operations Amy Jones Satrom and Starship Technologies co-founder and CTO Ahti Heinla at last week’s TC Sessions: Mobility event. Here’s what Kumavat had to say about that acceleration:\n Even before the pandemic hit, this whole e-commerce trend was already on the rise. No one wants their deliveries to be done after a week or two weeks. Everyone is expecting them to be done on the same day, as well as curbside pickup options. There was already a rise in the expectations of e-commerce and on-demand deliveries even before the pandemic hit. Post-March 2020, what we have seen is a huge increase in that trajectory.\n More big news from Nuro (try saying that five times, fast), the delivery company  just signed a deal with FedEx, marking a big step into package delivery.\n  This week, I also spoke to another pair of robotics startups that have emerged from the pandemic with sizable rounds. Boulder-based Scythe  emerged from stealth with a $13.8 million Series A, bringing its total funding to $18.6 million. The company specializes in landscaping robotics, starting with a mower. Given the potential market size, I’m honestly surprised there aren’t more companies doing this.\n Interestingly, the company is offering a RaaS (robotics as a service) model, which is becoming increasingly popular in the space. Here it’s charging customers based on the number of acres mowed.\n  Bay Area-based Dusty Robotics, meanwhile,  raised a $16.5 million Series A, bringing its total raised to $23.7 million. Construction is a huge potential market with a lot of interest and players. Dusty’s offering is interesting and fairly unique, effectively printing plans on the floor of a construction site. The company likens it to “Ikea Instructions.” Here’s co-founder and CEO, Tessa Lau:\n We just released our third-generation hardware platform, which was designed from the ground up by our team in Mountain View to be purpose-built for producing accurate and speedy layout on construction sites. We’ve been working on this product since fall of 2018 and have incorporated lessons learned from completing over 1 million square feet of production layout into this third-generation design.\n   IEEE Spectrum spotted the robot, which was actually announced a few weeks ago.  According to the paper where Ollie appeared, the wheeled robot is more experimental than practical, but it’s capable of some pretty impressive feats none the less:\n Experimental results demonstrate that the linear output regulation can maintain the standing of the robot, and that nonlinear controller can balance the robot under an initial starting angle far away from the equilibrium point, or under a changing robot height.\n There isn’t a ton of info about Ollie available yet, but it sure is fun to watch.", "posttime": "2021-06-17 23:39:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,跨越,landscaping", "title": "最后一英里，景观和跨越机器人 ", "title_en": "\n\t\t\t\tLast-mile, landscaping and leaping robots\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/robotics-roundup-16/", "via": "", "real_tags": ["机器人", "跨越"]}, {"category": "", "categoryclass": "", "imagename": "a9eeecf417539a44ee451fe0354a97ee.jpg", "infoid": 1066493, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该活动将于6月29日举行，因此请务必在此注册（免费）倾听这些对话，享受投票，与当地人才的网络。\n Tsai于2012年加入Duolingo，作为其第一工程师之一，首先见证了公司的成长，从陷入困境的启动到400人全球业务。她的时间戳在公司的许多最大决定中使她成为一个关键的决策者，从中废除如何在不影响所有向所有人提供自由教育的使命的情况下货币化。\n  有一点值得注意的是，即使是异想天开的猫头鹰和创意UX似乎很简单，语言学习宇宙也是有争议的，需要健康的辩论和测试 - 对于其中的任何人来说。\n  “我们正在尝试做任何其他应用程序真正解决的事情：我们如何创造一个实际上让您非常精通语言的经验，同时适应我们学习者的期望”很有趣，方便，蔡先生在接受采访时告诉我她为我的Duolingo EC-1。 “平衡与参与的疗效是我们不断奋斗的东西。”\n 在这聊天中，Tsai将分解Duolingo如何转向A / B测试以回答其一些最大的问题。我们还将聊聊更多的元主题，何时放弃测量不可估量的，并且当测试失败和本能统治至高无上时。蔡仔致于我，曾经那个Duolingo花了多年的时间试图弄清楚如何找到一个可以涵盖学习理解和举动的参与的公制。\n “用来冻结我们的是我们认为我们需要这样的指标进行进步，”她解释道。 “我认为诚实地解放了我们基本上说，”搞砸了。“我们无法进展等待学习公制。”\n 我会采访蔡，所以任何人都欢迎为此注册这个活动来抛弃我的问题，我会尝试嵌入我的聊天。 \nTsai将给我们启动建筑师的角度来看，而市长赛托托将谈论建设一个创业生态系统的挑战，卡内基梅隆大学总裁Farnam Jahanian将讨论如何从学生使用正确的资源启动学生。  不要忘记在6月29日注册此免费活动（点击此处注册），以便在网络机会期间使用受众成员观看这些聊天和riff。 如果您是在匹兹堡的早期启动创始人，您应该申请投球您的启动（点击此处申请）。 期待做一个活的两分钟球场，从当地VCS获得反馈，甚至赢得我们的投资。 ", "note_en": "The event will be held on June 29, so make sure to  register here (for free) to listen to these conversations, enjoy the pitch off, and network with local talent.\n Tsai joined Duolingo in 2012 as one of its first engineers, and first-hand witnessed the growth of the company from a scrappy startup into a 400-person global business. Her timestamp on the company has made her a key decision-maker in many of its biggest decisions, from which features to scrap to how to monetize without compromising its mission of providing free education to all.\n  One thing to note is that even though a whimsical owl and creative UX might seem straightforward, the language learning universe is controversial and requires healthy debate – and testing – for anyone within it.\n  “We’re trying to do things that no other apps really tackle: How do we create an experience that actually makes you extremely proficient in a language while accommodating the expectations from our learners” to be fun and convenient, Tsai told me when I interviewed her for  my Duolingo EC-1. “Balancing efficacy with engagement is something that we constantly struggle with.”\n In this chat, Tsai will break down how Duolingo turned to A/B testing to answer some of its biggest questions. We’ll also chat about more meta topics, as when to give up on measuring the unmeasurable, and when tests fail and instinct reigns supreme. Tsai admitted to me once that Duolingo spent years trying to figure out how to find a metric that could encompass learning comprehension and engagement in one fell swoop.\n “What used to freeze us is that we thought we would need such a metric to make progress,” she explained. “And I think what honestly liberated us was saying essentially, ‘Screw it.’ We couldn’t make progress waiting for a learning metric.”\n I’ll be interviewing Tsai, so anyone who registers for this event is welcome to  throw me questions for her that I’ll try to embed in my chat.\n Tsai will give us the startup builder perspective, while Mayor Peduto will speak to the challenges of building a startup ecosystem, and Carnegie Mellon University President Farnam Jahanian will discuss how to go from student to startup with the correct resources.\n Don’t forget to register for this free event on June 29th ( click here to register) so you can watch these chats and riff with audience members during networking opportunities. If you’re an early-stage startup founder based in Pittsburgh, you should apply to pitch your startup ( click here to apply). Expect to do a live two-minute pitch, get feedback from local VCs, and maybe even win our pitch-off.", "posttime": "2021-06-17 23:39:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "工程,pittsburgh,启动", "title": "Duolingo工程总监Karin Tsai将在TechCrunch City Spotlight：6月29日的匹兹堡 ", "title_en": "\n\t\t\t\tKarin Tsai, director of engineering at Duolingo will be speaking at TechCrunch City Spotlight: Pittsburgh on June 29\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/karin-tsai-director-of-engineering-at-duolingo-will-be-speaking-at-techcrunch-city-spotlight-pittsburgh-on-june-29/", "via": "", "real_tags": ["工程", "启动"]}, {"category": "", "categoryclass": "", "imagename": "9a9b48759a02a7d72a049ce52d2acc2f.jpg", "infoid": 1066492, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国宇航局已经组装了它的第一个强大的空间发射系统（SLS）火箭，这将使人类携带这十年的月球。\n 星期五，佛罗里达州的工程师＆＃39; S肯尼迪航天中心完成了降低65米（212英尺）的核心级在两个较小的增压火箭之间。\n 它第一次＆＃39;第一次火箭的所有三个关键要素都在其发射配置中。\n  在这个使命期间，被称为Artemis-1，SLS将携带猎户座 - 美国＆＃39;下一代船员 - 走向月球。但是，没有宇航员将是船只;工程师希望在2023年允许的人类之前将火箭和宇宙飞船放入他们的比赛中。\n   SLS由巨型核心舞台组成，该核心舞台包括推进剂罐和四个强大的发动机，两个54米（177英尺）-long固体火箭助推器（SRB）。它们提供了在前两分钟的飞行中推动地面的大部分推力力。\n  核心阶段和SRB都比自由女神像，减去它的基座。\n 在星期五和周六，肯尼迪航天中心的团队使用重型升降机起重机首次提升核心级，将其从水平转移到垂直位置，然后将其降低到位于称为移动发射器的结构上的SRB之间。 \n移动启动器允许访问SLS进行测试，结帐和维修。 它还将将巨型火箭转移到发射垫上。  虽然这次正在进行，但核心阶段附在密西西比州的考试台上，正在经历一项被称为绿色奔跑的评估计划。  3月份，核心阶段发动机被成功地解雇了大约八分钟 -  SLS从地面到空间所花费的时间 - 在绿色运行中，最终和最重要的测试。  Artemis-3以来，这将是1972年的阿波罗17自阿波罗17以来将人类陆地陆地的首次使命。 NASA最近颁发了合同，将下一代月亮兰德建造在太空X上，这是为此目的而调整其星舰设计。 ", "note_en": "Nasa has assembled the first of its powerful Space Launch System (SLS) rockets, which will carry humans to the Moon this decade.\n On Friday, engineers at Florida&#39;s Kennedy Space Center finished lowering the 65m (212ft) -tall core stage in-between two smaller booster rockets.\n It&#39;s the first time all three key elements of the rocket have been together in their launch configuration.\n  During this mission, known as Artemis-1, the SLS will carry Orion - America&#39;s next-generation crew vehicle - towards the Moon. However, no astronauts will be aboard; engineers want to put both the rocket and the spaceship through their paces before humans are allowed on in 2023.\n   The SLS consists of the giant core stage, which houses propellant tanks and four powerful engines, flanked by two 54m (177ft) -long solid rocket boosters (SRBs). They provide most of the thrust-force that propels the SLS off the ground in the first two minutes of flight.\n  Both the core stage and the SRBs are taller than the Statue of Liberty, minus its pedestal.\n Over Friday and Saturday, teams at Kennedy Space Center used a heavy-lift crane to first hoist the core stage, transfer it from a horizontal to a vertical position, and then lower it into place between the SRBs on a structure called the mobile launcher.\n   The mobile launcher allows access to the SLS for testing, checkout and servicing. It will also transfer the giant rocket to the launch pad.\n  While this was going on, the core stage was attached to a test stand in Mississippi, undergoing a comprehensive programme of evaluation known as the Green Run.\n   In March, the  core stage engines were fired successfully for around eight minutes - the time taken for the SLS to get from the ground to space - in the Green Run&#39;s final and most important test.\n  Artemis-3, which will be the first mission to land humans on the Moon since Apollo 17 in 1972, should launch in the next few years. Nasa recently awarded the contract to  build the next-generation Moon lander to SpaceX, which is adapting its Starship design for the purpose.", "posttime": "2021-06-17 23:31:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国宇航局,美国,太空,nasa,装配", "title": "美国宇航局终于展示了装配的“太空发射系统”Megarocket ", "title_en": "NASA Finally Shows Off Assembled 'Space Launch System' Megarocket", "transed": 1, "url": "https://www.bbc.com/news/science-environment-57446686", "via": "", "real_tags": ["美国宇航局", "美国", "太空", "nasa", "装配"]}, {"category": "", "categoryclass": "", "imagename": "f037d052d9b027adf18d041bac869912.jpg", "infoid": 1066491, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您从Verge链接购买的内容，Vox Media可能会获得佣金。看看我们的道德声明。\n Snapchat正在使开发人员更容易使用病毒内容直接促进其应用程序。今天，它推出了聚光灯的创意套件，这将允许App开发人员为用户提供直接发布到Snapchat的Tiktok竞争对手的权力。与此同时，Snapchat用户可以浏览在这些应用上进行的内容，然后轻松导航以下载它们。\n 这对于双方来说，这是双赢的：Snapchat在其平台上获得更多内容，而开发人员则在其推出的效果或工具进行疾病的效果或工具奖励。开发人员还可以设置标签此内容的Hashtag主题，因此他们可以跟踪它的表现如何，并且查看者可以看到用这种效果做的一切。 Snap表示它不会从开发人员中删除任何类型的切割，即使他们的应用需要购买使用。\n 初始合作伙伴包括Lightricks，拼接，粉末和piñata农场的Videoleap和Beatleap，等。所有这些应用程序都涉及创建工具，并且显然，这是人们在它帮助制作的内容上发现应用程序 - 真实的广告。\n 虽然这只是应用Snapchat作为分发服务器的应用程序的开头，但它有可能发送倍增数量的下载方式 - 就像Snapchat的用户群“当特定过滤器变得病毒时如何弹出。 2019年，由于病毒面过滤器，7至900万用户估计在7至900万用户之间加入其平台，如人们看起来像婴儿一样。同样的事情可能发生在一个应用程序中，这在长期以来，这可能会改变开发人员和传统应用商店之间的动态。 ", "note_en": "If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n Snapchat is making it easier for developers to use viral content to directly promote their apps. Today, it’s launching Creative Kit for Spotlight, which will allow app developers to give users the power to publish directly to Snapchat’s TikTok rival, Spotlight. At the same time, Snapchat users can browse content made on those apps and then easily navigate to download them.\n It’s a win-win for both parties: Snapchat gains more content on its platform while developers are rewarded with additional downloads if an effect or tool they launch goes viral. Developers can also set up hashtag topics that’ll tag this content, so they can track how well it’s doing, and viewers can see everything made with that effect. Snap says it won’t take any sort of cut from developers, even if their app requires a purchase to use.\n Initial partners include Videoleap and Beatleap by  Lightricks,  Splice,  Powder, and  Piñata Farms, among others. All these apps involve creation tools, and clearly, this is so people discover the app on the content it helped make — a real advertisement.\n Although this is just the start of apps using Snapchat as a distributor, it has the potential to send a sizable number of downloads their way — just like how Snapchat’s user base tends to pop when a particular filter goes viral. In 2019, Snap  estimated between 7 and 9 million users joined its platform because of viral face filters, like one that made them look like babies. That same thing could happen for an app, which, in the long term, could change the dynamics between developers and traditional app stores.", "posttime": "2021-06-17 23:31:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创意,开发,程序,聚光灯,spotlight", "title": "Snap推出创意套件进行聚光灯，这将让开发人员将应用程序放在Snapchat的Tiktok竞争对手聚光灯中 ", "title_en": "Snap launches Creative Kit for Spotlight, which will let developers put their apps inside Snapchat's TikTok rival Spotlight", "transed": 1, "url": "https://www.theverge.com/2021/6/17/22536936/snapchat-spotlight-app-developers?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["创意", "开发", "程序", "聚光灯", "spotlight"]}]