[{"category": "", "categoryclass": "", "imagename": "f5b6e297250a3ead806ab030dc49c8df.jpg", "infoid": 1033214, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，美国正式退出了《巴黎协定》(Paris Agreement)，从全球范围来看，这场仍未做出决定的总统选举事关重大。随着特朗普于2017年6月开始的正式退出进程的完成，美国成为世界上唯一一个没有参与全球抗击气候危机努力的国家。\n特朗普对气候变化不屑一顾，认为这是一场骗局，并取消了数十项旨在保护环境和避免气候变化的环境法规，他决定在上任之初退出这项国际协议。但由于该协议在生效三年后才允许各国启动正式的退出程序，这一为期一年的程序于2019年11月4日正式开始。\n乔·拜登(Joe Biden)承诺在他担任总统的第一天重新加入气候协议。重新加入的过程只需30天，使该国最快可以在2021年2月19日重新加入为缔约方。\n该协议以2015年联合国缔约方大会达成该协议的城市命名，旨在将全球气温升幅控制在比工业化前水平“远低于”2摄氏度的水平。美国总统巴拉克·奥巴马(Barack Obama)努力推动达成该协议，他的政府于2016年9月正式签署了该协议。那一年是有记录以来最热的一年，尽管2020年可能很快就会超过这一年。在过去的四年里，地球的气温持续飙升，史无前例的野火、洪水、干旱、海平面上升和炎热的气温困扰着世界。\n皮尤研究中心(Pew Research Center)10月份的一项民意调查显示，在计划投票给拜登的登记选民中，68%的人表示气候变化对他们的投票非常重要，而特朗普的支持者中只有11%表示同样的看法。\n尽管来自全国各地的领导人承诺在没有联邦领导的情况下抗击气候变化，而且市场推动了可再生能源使用量的增加，但如果特朗普政府再次执政，这场斗争可能会遭遇不可估量的挫折。", "note_en": "The United States officially withdrew from the Paris Agreement on Wednesday, casting the stakes of the still-undecided presidential election in planetary terms. With the completion of the formal withdrawal process, which Trump  began in June 2017, the U.S. became the only country in the world not to participate in the global effort to fight the climate crisis.\n Trump, who has dismissed climate change as a hoax and  rolled back dozens of environmental regulations designed to protect the environment and stave off climate change, decided to exit the international agreement early in his term. But because the accord didn’t allow countries to begin the formal withdrawal process until three years after it went into effect, the yearlong process officially began on November 4, 2019.\n Joe Biden has promised to reenter the climate accord on the first day of his presidency. The  process of rejoining would take just 30 days, enabling the country to be readmitted as a party as soon as February 19, 2021.\n  The agreement, named for the city where the United Nations Conference of Parties struck it in 2015, aims to limit the global temperature rise to “well below” 2 degrees Celsius above pre-industrial levels. President Barack Obama pushed hard for the agreement, which his administration officially entered in September 2016. That year was the  warmest year on record, although 2020  may soon top it. During the past four years, the Earth’s temperature has continued to  soar and unprecedented  wildfires,  flooding,  droughts,  sea level rise, and scorching temperatures have beset the world.\n According to an October  poll from Pew Research Center, 68 percent of registered voters who planned to vote for Biden said climate change was very important to their vote, while only 11 percent of Trump supporters said the same.\n While leaders from around the country have  committed themselves to fighting climate change even without federal leadership, and the market has driven an  increase in the use of renewable energy, a second Trump administration could immeasurably set back the fight.", "posttime": "2020-11-05 12:14:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,巴黎,withdraws,气候变化", "title": "美国正式借鉴巴黎气候协议", "title_en": "US Formally Withdraws From Paris Climate Agreement", "transed": 1, "url": "https://theintercept.com/2020/11/04/paris-agreement-withdrawal/", "via": "", "real_tags": ["美国", "巴黎", "withdraws", "气候变化"]}, {"category": "", "categoryclass": "", "imagename": "88bd4910cda0e557dea313db732abc12.jpeg", "infoid": 1033213, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "缅因州的波特兰是美国越来越多禁止面部识别技术的城市中最新的一个。据班戈每日新闻报道，人们投票赞成通过一项新措施，加强波特兰现有的禁止执法机构和公职人员使用面部识别技术的禁令。市议员最初在8月份同意了一项禁令，因为他们的理解是，如果这项法令获得通过，选民公投将取代他们的法令。现在它已经过去了，至少五年内都不能碰它。\n早在9月份，俄勒冈州波特兰就通过了一项可能是美国最严格的面部识别市政禁令--甚至禁止私营企业在公共场所部署这项技术。在此之前，波士顿、旧金山和奥克兰也禁止使用它，尽管他们的规定只适用于公职人员。这种对面部识别技术使用的抵制源于各种研究，这些研究表明，他们正在与种族和性别偏见作斗争。他们仍然倾向于错误地识别女性和POC，将他们置于危险之中。例如：虚假的面部识别匹配导致今年底特律至少发生了几起错误逮捕事件。\n缅因州波特兰通过的新措施将允许公民起诉该市非法监控，并将使他们有资格获得每次违规100美元或1000美元，以较高者为准。它还将要求该市压制非法获得的证据。此外，违反该条例现在将成为市政府官员停职或解雇的理由。", "note_en": "Portland, Maine is the latest in the growing list of cities in the US to ban facial recognition technologies. According to   Bangor Daily News, people voted in favor of of passing a new measure that strengthens Portland’s existing ban on the use of facial recognition tech by law enforcement agencies and public officials. City councilors originally  agreed on a ban back in August with the understanding that the voter referendum would replace their ordinance if it passes. Now that it has passed, it can’t be touched for at least five years.\n Back in September, Portland, Oregon  passed what could be the strictest municipal ban on facial recognition in the country — one that prohibits even private businesses from deploying the technology in public spaces. Before that,  Boston,  San Francisco and  Oakland also prohibited its use, though their rules only apply to public officials. This pushback against the use of facial recognition technologies stems from various studies that  show how they’re struggling with race and gender bias. They still tend to misidentify women and POCs, putting them at risk. Case in point: False facial recognition matches led to at least  a couple of  wrongful arrests in Detroit this year.\n  The new measure Portland, Maine has passed will  allow citizens to sue the city for illegal surveillance and will make them eligible to receive $100 per violation or $1,000, whichever is higher. It will also require the city to suppress illegally obtained evidence. Plus, violating the ordinance will now be grounds for a city official’s suspension or termination.", "posttime": "2020-11-05 12:14:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "波特兰,maine", "title": "缅因州波特兰投票支持面部识别禁令", "title_en": "Portland, Maine Votes in Favor of Facial Recognition Ban", "transed": 1, "url": "https://www.engadget.com/portland-maine-facial-recognition-ban-102520333.html", "via": "", "real_tags": ["波特兰", "maine"]}, {"category": "", "categoryclass": "", "imagename": "c0ef9183801c134fbf40f75e6035e2a3.jpeg", "infoid": 1033212, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新冠肺炎危机期间，单身人士继续为在线约会功能支付高额费用，这帮助了Match Group Inc.。第三季度的财务业绩和Tinder订户增长超出预期。\n该公司公布净利润为1.321亿美元，合每股45美分，而去年同期为1.085亿美元，合每股52美分。FactSet调查的分析师预计每股收益为40美分。\nMatch MTCH拥有Hinger、OkCupid和Tinder等一系列约会品牌，该公司公布本季度调整后的息税折旧及摊销前利润(EBITDA)为2.492亿美元，高于去年同期的2.052亿美元。FactSet追踪的分析师预计为2.21亿美元。\n该季度营收从5.415亿美元增长至6.398亿美元，而分析师此前预计为6.06亿美元。\n该公司在致股东的信中表示：“尽管面临COVID挑战，但西方市场业务的表现非常好，而一些发展中市场，其中几个市场受到疫情的沉重打击，复苏速度较慢。”\nMatch旗下的Tinder品牌在9月当季平均拥有660万订户，高于6月当季的620万。Match披露，Tinder的直接收入增长了15%，而每个用户的平均收入下滑了1%。\n在整个公司范围内，Match平均拥有1080万订户，而6月份这个季度的订户为1010万，去年同期为960万。FactSet的共识是1050万。\nMatch股价在过去三个月里上涨了20%，标准普尔500指数(S&P；500 SPX，+2.20%)上涨了4.3%。", "note_en": "Singles continue to pay up for online dating features during the COVID-19 crisis, helping Match Group Inc. exceed expectations for the third quarter with its financial results and its Tinder subscriber growth.\n    The company reported net income of $132.1 million, or 45 cents a share, compared with $108.5 million, or 52 cents a share, in the year-earlier quarter. Analysts surveyed by FactSet were projecting 40 cents a share in earnings.\n  Match  MTCH,  +5.80% , which owns a portfolio of dating brands including Hinge, OkCupid and Tinder, posted adjusted earnings before interest, taxes, depreciation, and amortization (Ebitda) of $249.2 million for the quarter, up from $205.2 million a year prior. Analysts tracked by FactSet were expecting $221 million.\n    Revenue for the period grew to $639.8 million from $541.5 million, while analysts had been projecting $606 million.\n  “Western market businesses have performed extremely well despite the COVID challenges, while some developing markets, several of which have been hard hit by the pandemic, are recovering more slowly,” the company said in its shareholder letter.\n  Match’s Tinder brand had 6.6 million subscribers on average in the September quarter, up from 6.2 million in the June quarter. Match disclosed that Tinder’s direct revenue rose 15%, while the average revenue per user slipped 1%.\n       Across the broader company, Match had 10.8 million subscribers on average, compared with 10.1 million in the June quarter and 9.6 million a year earlier. The FactSet consensus was for 10.5 million.\n    Match shares have risen 20% over the past three months as the S&amp;P 500  SPX,  +2.20% has gained 4.3%.", "posttime": "2020-11-05 10:25:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "group,reports,match", "title": "Match Group公布第三季度营收为6.398亿美元，同比增长18%，超出分析师预期的6.06亿美元，净利润为1.321亿美元，同比增长22%", "title_en": "Match Group reports Q3 revenue of $639.8M, up 18% YoY, beating analysts' expectations of $606M, and reports net income of $132.1M, up 22% YoY", "transed": 1, "url": "https://www.marketwatch.com/story/match-sees-tinder-subscriber-growth-top-expectations-11604524912", "via": "", "real_tags": ["group", "reports", "match"]}, {"category": "", "categoryclass": "", "imagename": "3cf346a2b24caff075af6ae540b8a212.jpg", "infoid": 1033211, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Etherum 2.0规范的1.0版已经发布，如果一切按计划进行，区块链升级应该会在下月初进行。\n根据Etherum基金会今天的一篇博客文章，Etherum 2.0的第一个版本将于12月1日发布，只要满足一定的标准。区块链升级将网络推向利害关系证明共识机制，将允许以太持有者押注他们的硬币来帮助运营网络，而不是像目前那样挖掘区块。\n只要网络上有16384个验证器，它就会在世界协调时12月1日下午12点上线。每个验证者将需要押注32以太，目前价值1.27万美元-总金额为2.09亿美元。\n今天，以太基金会还发布了以太2.0规范的1.0版。它透露了一个Launch Pad，用户可以在那里注册成为以太2.0验证者(在网络中持有股份的人)和以太主合同地址-资金将存放在那里。\n然而，值得注意的是，资金不应该直接送到存款合同，而是应该使用赌注机制(通过发射台)进行押注。正如Consensys(为编辑独立的解密提供资金)在Twitter上指出的那样，记住：不要把ETH发送到存款合同上！将Eth发送到此合同地址将导致交易失败，并不意味着您要押注于eth2。&#34；\n在这一声明的背后，以太的价格从383美元飙升至398美元，涨幅为3.9%，涨幅为15美元。这开始逆转了本月早些时候417美元价格的下跌趋势。\n正如DECRYPT今天早些时候报道的那样，昨天发布了一个工具，可以帮助生成Etherum 2.0所需的密钥。这被视为正式规格发布的先驱者，并被命名为：We Have a Go for Main Engine Start🚀。\n更新：本文更新了有关发送到合同地址以及由此导致的以太价格上涨的更多信息。\n为获得最佳体验，请立即下载指尖上的顶级密码新闻和独家功能。", "note_en": "Version 1.0 of the Ethereum 2.0 specifications has been released and if all goes to plan, the blockchain upgrade should happen at the beginning of next month.\n    The first version of  Ethereum 2.0 is set to launch on December 1, according to an Ethereum Foundation  blog post today, as long as certain criteria are met. The blockchain upgrade, which moves the network toward a proof-of-stake consensus mechanism, will allow  Ethereum holders to stake their coins to help run the network, instead of mining blocks as is currently the case.\n As long as there are 16,384 validators on the network, it will go live on December 1 at 12pm UTC. Each validator will need to be staking 32 Ethereum, currently worth $12,700—for a total amount of $209 million.\n  The Ethereum Foundation also released version 1.0 of the specifications for Ethereum 2.0 today. It revealed a Launch Pad, where users can sign up to become an Ethereum 2.0 validator (someone who stakes on the network) and the main Ethereum contract address—where funds will be deposited.\n   However, it&#39;s worth noting that funds should not be sent directly to the deposit contract, instead they should be staked using the staking mechanism (via the Launch Pad). As ConsenSys (which funds an editorially independent  Decrypt) pointed out on Twitter, &#34;REMEMBER: DO NOT SEND ETH TO THE DEPOSIT CONTRACT! Sending Eth to this contract address will result in a failed transaction, and does not mean you are staking on Eth2.&#34;\n   On the back of the announcement, the  price of Ethereum spiked $15 from $383 to $398—up 3.9%. This start to reverse a downward trend from a price of $417 that was seen earlier this month.\n As  Decrypt reported earlier today, a tool was released yesterday that helps to generate keys required for Ethereum 2.0. This was seen as a precurser to the launch of the official specifications and was entitled &#34;We have a go for Main engine start 🚀.&#34;\n  Update: This article has been updated with more information on sending to a contract address and the resultant price jump of Ethereum.\n  For the best experience, top crypto news at your fingertips and exclusive features download now.", "posttime": "2020-11-05 10:25:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表示,launch,以太", "title": "Etherum Foundation表示，如果网络上存在足够的验证器，Etherum 2.0将于12月1日推出", "title_en": "Ethereum Foundation says Ethereum 2.0 is set to launch on December 1 if enough validators are present on the network", "transed": 1, "url": "https://decrypt.co/47193/ethereum-2-0-set-to-launch-on-december-1", "via": "", "real_tags": ["表示", "launch", "以太"]}, {"category": "", "categoryclass": "", "imagename": "eb6c085fb2bd9ff756deee044ea73ad3.jpeg", "infoid": 1033210, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高通股价在盘后交易中上涨逾11%，因其营收和调整后每股获利轻松超过华尔街预期。\n高通表示，将改变报告，公布手机、射频、汽车和物联网芯片的收入。高通表示，它不会公布业绩，也不会为MSM芯片提供指导。MSM芯片是移动调制解调器芯片。\n此前，这些业务线都是在高通的QCT部门报告的，该部门专注于芯片业务。高通说，QCT的销售额比去年同期增长了38%，达到49.7亿美元。\n高通的另一个重要领域是QTL，其中包括由于拥有电信专利而从其他科技公司收取的许可费。QTL营收较上年同期增长30%至15.1亿美元。\n高通为截至12月的第一财季提供了指引。该公司表示，预计营收在78亿美元至86亿美元之间，调整后每股收益在1.95美元至2.15美元之间。\n高通表示，该公司调整了收益和营收，因为它排除了几个项目，包括与华为达成和解协议产生的18亿美元，这是一个与战略投资相关的部门，以及基于股票的薪酬。\n高通表示，它处于有利地位，可以从5G网络和手机的崛起中受益。高通的一款5G调制解调器芯片安装在苹果的iPhone12上。高通首席执行官史蒂夫·莫伦科普夫(Steve Mollenkopf)在与分析师的电话会议上表示，高通第四季度的业绩包括美国一家大型手机制造商(可能是苹果)的部分季度业绩。\n高通周三表示，预计2020年5G智能手机出货量约为2亿部，2021年5G智能手机出货量约为5亿部。高通不生产智能手机，但向手机制造商销售关键处理和调制解调器芯片。该公司预计，明年包括5G、4G和3G手机在内的智能手机出货量将实现个位数的高增长。\n莫伦科普夫在一份声明中表示：我们第四财季的业绩表明，我们对5G的投资正在结出硕果，并在我们的授权和产品业务中显示出好处。\n上个月，高通赢得了一场重大的法庭诉讼，因为一家上诉法院驳回了联邦贸易委员会要求重审之前一项裁决的请求，该裁决认定高通的许可业务做法是合法的，从而消除了该股面临的一个悬而未决的问题。", "note_en": "Qualcomm stock rose more than 11% in extended trading as its revenue and adjusted earnings per share handily beat Wall Street expectations.\n    Qualcomm  said that it would change its reporting to break out revenue from handset, radio frequency, automotive and internet-of-things chips. Qualcomm said that it would not break out results or provide guidance for MSM chips, which are mobile modem chips.\n Previously, those business lines were reported together under Qualcomm&#39;s QCT segment, which focuses on chips. QCT sales were up 38% from the same quarter last year to $4.97 billion, Qualcomm said.\n Qualcomm&#39;s other big segment is QTL, which includes licensing fees it collects from other technology companies because of its ownership of telecommunications patents. QTL revenue increased 30% from the same period last year to $1.51 billion.\n  Qualcomm provided guidance for its fiscal first-quarter ending in December. It said that it expected revenue between $7.8 billion and $8.6 billion, and adjusted EPS between $1.95 and $2.15.\n  Qualcomm said it adjusted its earnings and revenue because it excluded several items, including $1.8 billion resulting from a settlement agreement with Huawei, a segment related to strategic investments, and share-based compensation.\n Qualcomm has said it is well-placed to benefit from the rise of 5G networks and handsets. One of its 5G modem chips is included in  Apple&#39;s iPhone 12. Qualcomm CEO Steve Mollenkopf said on a call with analysts that its fourth-quarter results included a &#34;partial quarter impact&#34; from a large U.S. handset maker, likely Apple.\n Qualcomm said on Wednesday that it expects about 200 million smartphones with 5G to be shipped in 2020, and about 500 million 5G smartphones to be shipped in 2021. Qualcomm does not make smartphones but sells handset makers critical processing and modem chips. It&#39;s expecting &#34;high-single-digit growth&#34; in smartphone shipments, including 5G, 4G, and 3G phones, next year.\n &#34;Our fiscal fourth quarter results demonstrate that our investments in 5G are coming to fruition and showing benefits in our licensing and product businesses,&#34; Mollenkopf said in a statement.\n Last month, Qualcomm won  a major court battle when an appeals court denied the FTC&#39;s request for a rehearing of a previous decision that found that Qualcomm&#39;s licensing business practices are legal, removing an overhanging issue the stock faced.", "posttime": "2020-11-05 09:37:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "同比,income,高通", "title": "高通报告第四季度营收为65亿美元，同比增长35%，预计收入超过59.3亿美元，净利润同比增长76%，达到17亿美元；股价盘后上涨12%以上", "title_en": "Qualcomm reports Q4 revenue of $6.5B, up 35% YoY and above $5.93B est., as net income rises 76% YoY to $1.7B; stock up 12%+ after hours", "transed": 1, "url": "https://www.cnbc.com/2020/11/04/qualcomm-qcom-earnings-q4-2020.html", "via": "", "real_tags": ["同比", "income", "高通"]}, {"category": "", "categoryclass": "", "imagename": "7ba293785210f22723e14e58f1921c63.jpg", "infoid": 1033209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "缅因州波特兰通过了一项投票倡议，禁止警察和城市机构使用面部识别。“班戈每日新闻”报道，选民们通过了一项投票倡议，支持禁止城市机构进行面部识别。\n在这一举措之前，市议会在8月份进行了投票，将初步禁令作为一项法令实施。今天的投票用一项更强有力的措施取代了该法令，该法令至少在五年内不能被废除。\n这项法令是今年早些时候由美国民主党社会党缅因州南部分会投票通过的，作为其他一系列进步倡议的一部分，包括15美元的最低工资和对租金上涨的新限制。\n新措施还增加了具体的处罚措施，如果普通公民在违反该条例的情况下受到监控，他们有权获得最低1000美元的民事费用。违反该条例的行为也被确立为解雇或停职城市雇员的理由。私营部门对该技术的使用不受影响。\n继波士顿、旧金山和俄勒冈州波特兰之前的禁令之后，波特兰只是最新一个发誓放弃这项技术的城市。今年6月，国会民主党人提出了一项法案，将在联邦层面实施类似的禁令，禁止所有联邦执法机构使用面部识别。", "note_en": "Portland, Maine has passed a ballot initiative banning the use of facial recognition by police and city agencies.   The Bangor Daily News is reporting that voters have passed a ballot initiative bolstering a ban on facial recognition by city agencies.\n The initiative follows  a city council vote in August, which put a preliminary ban in place as an ordinance. Today’s vote replaces that ordinance with a stronger measure, which cannot be revoked for at least five years.\n The ordinance was placed on the ballot earlier this year by the Southern Maine chapter of the Democratic Socialists of America, as part of a raft of other progressive initiatives including a $15 minimum wage and new limits on rent increases.\n The new measure also adds concrete penalties, entitling private citizens to a minimum of $1,000 in civil fees if they are surveilled in violation of the ordinance. Violations of the ordinance are also established as grounds for terminating or suspending a city employee. Private sector use of the technology is not affected.\n Portland is just the latest city to swear off the technology, following previous bans by Boston, San Francisco, and Portland, Oregon. In June, congressional Democrats  introduced a bill that would institute a similar ban at the federal level, barring all federal law enforcement agencies from employing facial recognition.", "posttime": "2020-11-05 09:31:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "监控,maine,城市", "title": "缅因州波特兰投票禁止警察和城市机构使用面部识别，被监控的公民有权获得1000美元以上的罚款", "title_en": "Portland, Maine votes to ban the use of facial recognition by police and city agencies, entitling surveilled citizens to $1,000+", "transed": 1, "url": "https://www.theverge.com/2020/11/4/21536892/portland-maine-facial-recognition-ban-passed-surveillance?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["监控", "maine", "城市"]}, {"category": "", "categoryclass": "", "imagename": "e3b9b78fd32835f0cccd059dd0f32546.jpeg", "infoid": 1033208, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选举之夜以许多专家预测的方式结束：几场竞选势均力敌，唐纳德·特朗普(Donald Trump)总统无论如何都宣布获胜。对于社交媒体平台来说，选举日也是他们证明为竞争激烈的选举做准备而收紧政策的机会。以下是到目前为止，最大的社交媒体应用程序的表现。\n推特在大选前几个月明确表示，它正在认真对待自己在防止错误信息传播方面的作用。该公司在未来几周实施了多项政策变化，为可能面临的各种威胁做好准备。\n在选举日之前，该公司发布了一个早期警告，称它将为试图过早宣布胜利的帖子贴上标签，并解释了它将如何确定结果何时是“官方的”。但真正的考验出现在特朗普开始发推文的时候。周三凌晨，当总统在推特上说“他们试图窃取选举”时，该公司在几分钟内就添加了一个标签。该标签称这条推文是“误导性的”，阻止了它直接出现在用户的时间线上。该公司还禁止转发和点赞。截至周三下午，该公司已经为总统的五条推文贴上了标签。\n他们正在努力争取在宾夕法尼亚州尽快获得50万张选票优势。同样，密歇根州和其他州也是如此！\n--唐纳德·J·特朗普(@realDonaldTrump)2020年11月4日。\nTwitter还将知名共和党人和其他有影响力的账户发布的其他一些推文贴上了违规的标签。周二，该公司在特朗普竞选账户的一条推文中添加了一个标签，该推文称，总统在南卡罗来纳州的选举结果最终出炉之前就赢得了该州。它还贴上了佛罗里达州州长罗恩·德桑蒂斯(Ron DeSantis)的推文，称特朗普在竞选开始之前赢得了佛罗里达州，并在北卡罗来纳州参议院候选人汤姆·蒂利斯(Thom Tillis)的推文中添加了通知，蒂利斯表示自己赢得了竞选。\n佛罗里达州选民发出了自己的声音，总统@realDonaldTrump大获全胜。Pic.twitter.com/94gyYdbpLE。\n-Ron DeSantis(@RonDeSantisFL)2020年11月4日\nInstagram使用了与Facebook非常相似的标签，这款应用在选举前一段时间一直在用户的帖子中添加选举信息。但也有一些小问题，比如周二Instagram上挥之不去的一条通知，通知一些用户“明天是选举日”，这似乎与该公司禁止错误信息投票的政策不符。\n一旦特朗普总统开始过早宣布获胜，我们就开始在Facebook和Instagram上发布通知，称投票仍在统计中，没有预测获胜者。我们还将使用此信息自动将标签应用于两位候选人的帖子。Pic.twitter.com/tuGGLJkwcy。\n-Facebook新闻编辑室(@fbnewsroom)2020年11月4日。\n该公司表示，错误的通知是一个小故障的结果，这个小故障只影响了“一小部分”用户，但Instagram拒绝透露有多少用户受到影响。到周三早上，Instagram和Facebook在用户信息源的顶部发布了一则新的通知，警告说结果还没有最终确定，选票仍在统计中。\nYouTube还选择在所有与选举相关的视频上贴上结果尚未最终的信息标签，但正如ArsTechnica指出的那样，该公司并未明确禁止候选人过早宣布胜利。相反，该公司的指导方针针对的是“关于投票或鼓励干预民主进程的内容的误导性声明”。\n研究人员警告说，直播可能会成为一种特别有问题的错误信息形式，因为流媒体可能会歪曲选举结果或其他事件。这种情况最终在周二上演，当时几个受欢迎的频道甚至在投票结束前就开始播放“选举结果”。据选举诚信伙伴关系(Election Integrity Partnership)的研究人员称，该公司最终删除了这些视频，但其中一些获得了数千名观众，其中一个视频成为“谷歌在摇摆州流传最广的视频之一”。\n但在周三，该公司拒绝从一家美国新闻网删除一段名为“特朗普获胜”的视频。MSM希望你不要相信自己的眼睛。“。在这段最先由CNBC报道的视频中，一名主播表示，特朗普取得了“决定性的胜利”，选民欺诈行为“猖獗”。YouTube在接受CNBC采访时表示，它不会删除这段视频，因为这段视频并没有违反公司的规定，尽管它似乎与该公司之前宣布的政策不符。然而，该公司确实从视频中撤下了广告。\n2020年的大选是TikTok的第一次总统选举，这款应用似乎避免了其他平台的许多更大的争议(可能是因为特朗普是该公司的狂热批评者，在这款应用上没有官方存在)。与其他平台一样，TikTok为选举相关内容引入了标签，并链接到有关投票和选举信息的资源。该公司还表示，将与事实核查人员合作，在美联社(Associated Press)召集比赛之前，“减少可发现的”宣称获胜的视频。\n但错误信息仍然是该平台上的一个令人担忧的问题，就像它在其他应用程序上的情况一样。TikTok的一位发言人表示，TikTok“正在继续删除违反我们社区准则的内容”，“我们删除的大部分内容都反映了互联网上发布的内容。”\n虽然目前还不清楚下架的范围有多广，但该公司确实向“纽约时报”记者泰勒·洛伦茨证实，它已经删除了一些知名账户发布的带有误导性的视频，这些视频声称选举舞弊。\n更新内容包括YouTube对美国一家新闻网视频的回应。", "note_en": "Election night ended the way many experts predicted it might: with several races too close to call and President Donald Trump claiming victory anyway. For social media platforms, Election Day was also their chance to prove that tightening their policies in preparation for  a contested election was time well spent. Here’s how the biggest social media apps have fared so far.\n  Twitter made it clear months ahead of the election that it was taking its role in preventing the spread of misinformation seriously. The company implemented a number of policy changes in the weeks ahead to prepare for the kinds of threats it may face.\n  Before Election Day, the company issued  an early warning that it would label posts that tried to declare victory prematurely, and explained how it would determine when a result was “official.” But the real test came when Trump  started tweeting. When the president tweeted in the early hours of Wednesday morning that “they are trying to STEAL the Election,” the company added a label within minutes. The label, which called the tweet “misleading,” prevented it from appearing directly on users’ timelines. The company also disabled retweets and likes. By Wednesday afternoon, the company had labeled five tweets from the president.\n   They are working hard to make up 500,000 vote advantage in Pennsylvania disappear — ASAP. Likewise, Michigan and others!\n— Donald J. Trump (@realDonaldTrump)  November 4, 2020\n  Twitter also labeled a number of other tweets from prominent Republicans and other influential accounts for breaking its rules. On Tuesday, the company added a label to a tweet from Trump’s  campaign account, which said the president had won South Carolina before results in the state were final. It also labeled a tweet from Florida Governor Ron DeSantis, which said Trump had won Florida before the race had been called, and added a notice to  a tweet from North Carolina Senate candidate Thom Tillis, who said he had won his race.\n   Florida voters have made their voices heard, delivering a BIG WIN for President  @realDonaldTrump.  pic.twitter.com/94gyYdbpLE\n— Ron DeSantis (@RonDeSantisFL)  November 4, 2020\n  Separately on Tuesday, the company shut down a handful of high-profile accounts “for breaking the company’s spam or hateful conduct policies,”  NBC News  reported. Banned accounts included a former Congressional candidate, who tweeted that “immigrants would enter the U.S. and commit violence if Trump is not elected.”\n On Wednesday, the company had also labeled many more tweets, including messages from  Eric Trump and White House Press Secretary  Kayleigh McEnany, who both tweeted the president had won Pennsylvania.\n  Like Twitter, Facebook had also warned early on that it would label posts that prematurely declared victory. The social network added labels to all of Trump’s election-related posts. It also labeled Joe Biden’s Facebook posts, though none of his posts explicitly declared victory.\n  “Once President Trump began making premature claims of victory, we started running notifications on Facebook and Instagram that votes are still being counted and a winner is not projected,” the company said in  a statement early Wednesday. “We&#39;re also automatically applying labels to both candidates’ posts with this information.”\n But Facebook also came under fire because its labels are not as clear as Twitter’s, which explicitly called the president’s comments misleading. Facebook also doesn&#39;t do anything to prevent these posts from spreading more widely. The company has throttled debunked conspiracy theories, like  a claim that use of Sharpies may have affected vote counting. But Trump’s posts have continued to be shared widely. As of Wednesday morning, the president’s (now-labeled) comments were among the most-shared posts on the platform according to analytics data  posted by CNN reporter Donie O’Sullivan.\n   We are continuing to label all posts from both presidential candidates making it clear that votes are still being counted and a winner has not been projected. We are also applying these labels to other individuals who declare premature victory in individual states or overall.  pic.twitter.com/gmGdn4q52s\n— Facebook Newsroom (@fbnewsroom)  November 4, 2020\n  In another confusing turn, Facebook said late on election night its policy on labels would  not apply to a candidate who prematurely declared victory in an individual state. The company told  The Wall Street Journal the policy  would only apply to “premature calls for the final result of the presidential race.” But on Wednesday, company  officials said Facebook was “expanding” the rules to apply at the state level as well. The change came as the social network labeled  a post from White House Press Secretary Kayleigh McEnany, who said Trump won Pennsylvania.\n  Instagram has used labels very similar to Facebook’s, and the app has been adding election messages to users’ posts for some time ahead of the election. But there have also been some hiccups, like a  lingering Instagram notification on Tuesday that informed some users’ that “Tomorrow is Election Day,” which would seem to be at odds with the company’s policy barring misinformation about how to vote.\n   Once President Trump began making premature claims of victory, we started running notifications on Facebook and Instagram that votes are still being counted and a winner is not projected. We&#39;re also automatically applying labels to both candidates’ posts with this information.  pic.twitter.com/tuGGLJkwcy\n— Facebook Newsroom (@fbnewsroom)  November 4, 2020\n  The company said the faulty notification was  the result of a glitch that only affected a “small” number of users, though Instagram declined to say how many. By Wednesday morning, Instagram and Facebook put  a new notice at the top of users&#39; feeds warning that results are not yet final and ballots are still being counted.\n  YouTube also opted to label all  election-related videos with messages that results are not yet final, but as  ArsTechnica   pointed out, the company doesn’t explicitly bar candidates from prematurely declaring victory. Instead, the company’s guidelines address “misleading claims about voting or content that encourages interference in the democratic process.”\n  Researchers warned that live stream could emerge as a particularly problematic form of misinformation, as streamers can misrepresent election results or other events. That scenario ended up playing out on Tuesday, when a handful of popular channels began streaming “election results” before polls had even closed. The company eventually removed the streams, but some racked up thousands of viewers, and one became “one of Google’s most widely circulated videos in swing states,” according to researchers at the  Election Integrity Partnership.\n But on Wednesday, the company declined to remove a video from One American News Network titled “Trump won. MSM hopes you don’t believe your eyes.” In  the video, which was first  reported by  CNBC, an anchor said there had been a “decisive victory” for Trump, and that voter fraud had been “rampant.” YouTube told  CNBC that it wouldn’t take it down because the clip doesn’t violate its rules, even though it appeared to be at odds with the company’s previously-stated policies. The company did, however, pull ads from the video.\n  The 2020 election was the first presidential election for TikTok, and the app seemed to avoid many of the bigger controversies of other platforms (likely because Trump is an  avid critic of the company, and doesn’t have an official presence on the app). As with the other platforms, TikTok  introduced labels for election-related content and linked to resources about voting and election information. The company also said it would work with fact checkers to “reduce discoverability” of videos that claim victory before a race was called by the Associated Press.\n But misinformation has still been a concern on the platform, just as it has on other apps. A company spokesperson said TikTok is “continuing to remove content that violates our Community Guidelines,” and that “much of what we&#39;re removing mirrors content that&#39;s being posted across the internet.”\n Though it’s not clear how widespread takedowns have been, the company did  confirm to  New York Times reporter Taylor Lorenz that it had removed misleading videos with claims of election fraud that were posted from some prominent accounts.\n Updated to include YouTube’s response to a video from One American News Network.", "posttime": "2020-11-05 09:20:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,帖子,individual", "title": "Facebook现在表示，它将标记来自总统候选人和“其他个人”的帖子，这些帖子宣布在个别州或整个州过早获胜", "title_en": "Facebook now says it will label posts from presidential candidates and “other individuals” who declare premature victory in individual states or overall", "transed": 1, "url": "https://www.engadget.com/how-social-media-is-handling-2020-presidential-election-223643220.html", "via": "", "real_tags": ["facebook", "帖子"]}, {"category": "", "categoryclass": "", "imagename": "9e52fffc1e77753ca4381cabf5aec409.jpeg", "infoid": 1033205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“2020年美国总统大选的获胜者还没有确定。请查看更多最新消息，并了解随着选举进程的继续会发生什么。“。\n关键的是，Facebook和Instagram还在通知上添加了时间戳，以表明通知是最近发出的。截至11月4日上午9：57。例如，美国东部时间的通知写道，它最后一次更新是在上午9：00。艾斯特。\n添加时间戳很有用，不仅是因为选举结果仍在统计中--而且很可能还会持续几天--还因为特朗普总统在周三清晨所有选票清点完毕之前过早地宣布了选举胜利。\nFacebook告诉TechCrunch，在特朗普在Facebook上发布他获胜的消息后不久，Facebook和Instagram就开始在Facebook和Instagram订阅源的顶部显示这些通知。该公司还表示，根据选举日之前分享的政策，该公司还开始为特朗普和副总统拜登发布的帖子贴标签。\n在Facebook上，特朗普的信息为自己赢得了一个标签，提醒用户选举之夜的结果和最终结果可能会有所不同，但Facebook并没有以其他方式限制这篇帖子。\n正如我们在贴标签时注意到的那样，Facebook已经开始显示没有预测获胜者的通知。\n在这些帖子上有一个时间戳也很重要，因为这两个应用程序都面临着任何形式的缓存问题，这些问题会让用户在应用程序刷新之前暂时看到过期的数据。\n昨天，也就是11月3日，这是Instagram上的一个问题，当时一个缓存问题导致一些用户看到了一则通知，模糊地写道：“明天是选举日”，而实际上选举日已经到来。\n同样，一些用户可能在他们的应用程序刷新之前，不会立即看到通知出现在Facebook或Instagram的Feed顶部。但如今，关于这类问题的抱怨并不普遍。", "note_en": "“The winner of the 2020 U.S. Presidential Election has not been projected yet. See more updates and learn what to expect as the election process continues.”\n  Critically, Facebook and Instagram have also added a timestamp to the notification to indicate its recency. As of November 4 at 9:57 a.m. EST, for example, the notification read that it was last updated at 9:00 a.m. EST.\n  The addition of a timestamp is useful not only because election results are still being counted — and will be for days to come, most likely — but also because President Trump  prematurely claimed election victory early Wednesday morning before all votes were counted.\n Facebook tells TechCrunch it began showing these notifications at the top of Facebook and Instagram feeds shortly after Trump posted to Facebook that he had won. The company also began labeling posts from both Trump and Vice President Biden in accordance  with the policies it shared ahead of Election Day, it says.\n On Facebook, Trump’s  message earned itself a label that reminded users that election night results and final results may differ, but Facebook didn’t otherwise restrict the post.\n As  we noted at the time of the labeling, Facebook had begun displaying the notifications about there being no projected winner.\n  Having a timestamp on these posts is also important in the case that either app faces any sort of caching issues that would allow users to see out-of-date data, temporarily, until the app was refreshed.\n This was an issue on Instagram  yesterday, November 3, when  a caching issue led to some users seeing a notification that read, vaguely, “Tomorrow is Election Day,” when in fact Election Day had already arrived.\n Similarly, some users may not immediately see the notification appearing at the top of their Feed on Facebook or Instagram until their app refreshes. But there are no widespread complaints about this sort of issue today.", "posttime": "2020-11-05 09:15:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,预测,instagram", "title": "Facebook和Instagram在新闻馈送上添加了带有时间戳的弹出窗口，告诉用户在特朗普过早宣布获胜后，还没有预测到赢家", "title_en": "Facebook and Instagram add pop-ups with timestamps atop News Feeds telling users that no winner has been projected, after Trump prematurely claimed victory", "transed": 1, "url": "https://techcrunch.com/2020/11/04/facebook-and-instagram-notifications-warn-u-s-users-theres-no-winner-yet-in-presidential-election/", "via": "", "real_tags": ["facebook", "预测", "instagram"]}, {"category": "", "categoryclass": "", "imagename": "f2c59181c76eb2163ec2b2961c989916.jpeg", "infoid": 1033204, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当世界准备迎接一个漫长的选举之夜时，有人掏空了世界上最有价值的数字钱包之一。选举之夜实际上还没有结束。\n周二，控制比特币地址的人转移了所有内容--惊人的69369.16716000比特币(BTC)，约合9.64亿美元(约合9.64亿美元)。这一数字达到了惊人的1HQ3Go3ggs8pFnxHVHRytPCq5fGG8Hbhx&34；。在这一点上，不可能知道这是一起抢劫案，还是仅仅是长期休眠的钱包所有者将他们的储蓄转移到另一个钱包。\n多年来，这个钱包一直是加密货币爱好者猜测的对象，在转移之前，它是现有的最有价值的比特币地址之一。最近，几名黑客一直试图破解它，试图破解保护钱包的密码，试图窃取资金。\n现在，钱不见了，转移到了另一个比特币地址，除非下令转移的人公开露面，否则我们永远不会知道发生了什么。\n一直在关注钱包的安全研究员阿隆·加尔(Alon Gal)在推特上表示，要么是破解密码的人，要么是最初的所有者，他可能注意到了最近关于他的钱包在黑客之间流传的文章。&#34；也许是店主？很难知道。&#34；\n据网络犯罪情报公司哈德逊岩(Hudson Rock)的首席技术官盖尔(Gal)解释，自2015年以来，这个钱包一直被认为处于休眠状态，这意味着从那时起，钱包的主人就再也没有从钱包里取出过任何比特币，这是因为它是网络犯罪情报公司哈德逊·洛克(Hudson Rock)的首席技术官。\n自从比特币于2009年1月推出以来，围绕这种加密货币的一些最耐人寻味的故事就是人们丢失了钱包的密码，或者扔掉了他们存储比特币的硬盘。我们都与这些故事有关，因为我们都偶尔穿上一件旧夹克，找到一些零钱，让我们感觉自己中了彩票。这就是我在2017年向比特币和另一种流行的加密货币以太投资约1000美元时所写的内容。这就是一些人所说的比特币FOMO，这种感觉是我们错过了成为早期接受者的机会，这些人幸运地获得了免费的比特币，有朝一日醒来就成了百万富翁甚至亿万富翁。\n无论是谁从那个神秘的钱包里拿走了9.6亿多美元，都没有任何FOMO，他们他妈的很富有，我们农民可能永远不知道他们是谁。\n您想阅读更多关于黑客、隐私和监控的故事吗？订阅我们的弹出式杂志《邮报》。下一个问题是关于黑客文化。", "note_en": "As the world braced for a long election night that effectively hasn&#39;t ended, someone emptied out one of the most valuable digital wallets in the world.\n  On Tuesday, whoever is in control of the Bitcoin address &#34; 1HQ3Go3ggs8pFnXuHVHRytPCq5fGG8Hbhx&#34; transferred all its contents—a staggering 69369.16716000 BTC or roughly $964,000,000. At this point, it&#39;s impossible to know whether this was a heist or just the long-dormant owner of the wallet moving out their savings to  another wallet.\n   That wallet has been an object of speculation for cryptocurrency enthusiasts for years, and until the transfer it was one of the most valuable Bitcoin addresses in existence. More recently,  several hackers have been trying to break into it, trying to bruteforce the passcode that protects the wallet in an attempt to steal the funds.\n   Now, the money is gone, moved to another Bitcoin address, and we will never know what happened unless the person who ordered the transfer comes out publicly.\n  &#34;It was either the person who cracked the password or the original owner who may have noticed the recent articles about his wallet being circulated among hackers,&#34; Alon Gal, a security researcher who&#39;s been keeping an eye on the wallet,  said on Twitter. &#34;Maybe the owner? Hard to know.&#34;\n  The wallet was considered &#34;dormant&#34; since 2015, meaning the owner didn&#39;t move any Bitcoin out of it since then, As Gal, the Chief Technology Officer of cybercrime intelligence company Hudson Rock, explained.\n  Ever since Bitcoin was launched in January of 2009, some of the most intriguing stories surrounding the cryptocurrency have been  people losing the passwords to their wallets, or  throwing out the hard drives where they were storing their bitcoins. We all related to these stories because we all occasionally put on an old jacket and find some change, making us feel like we won the lottery.  This is what I wrote about when I invested roughly $1,000 in Bitcoin and Ethereum, another popular cryptocurrency, in 2017. It&#39;s what some people call  Bitcoin FOMO, that feeling that we missed out on being those early adopters who lucked out into getting free bitcoins and waking up one day as millionaires or even billionaires.\n  Whoever moved the more than $960,000,000 out of that mysterious wallet does not have any FOMO, they are rich as fuck, and us peasants may never know who they are.\n Would you like to read more stories about hacking, privacy, and surveillance? Subscribe to our pop-up &#39;zine The Mail. The next issue is about hacking culture.", "posttime": "2020-11-05 04:35:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,钱包,bitcoin", "title": "有人刚刚掏空了一个里面有9.64亿美元的比特币钱包", "title_en": "Someone Just Emptied Out a Bitcoin Wallet with $964M in It", "transed": 1, "url": "https://www.vice.com/en/article/g5bbaj/someone-emptied-out-bitcoin-wallet-with-964000000-million", "via": "", "real_tags": ["比特币", "钱包", "bitcoin"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033203, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近看了这个关于Tper自我参照配方的博客。这个公式很有趣。它的图形包含适合17*106网格区域的所有可能的位图。因此，在众多位图中有一个包含公式本身的有意义的表示也就不足为奇了。实际上，在17*106网格中拟合公式的方式有多种，因此该公式在图形中有多次出现。但也有其他所有的公式都符合。这并不是真正的自参考，因为您需要查找正确视口的数字N没有包含在其中(请参阅底部的更新，Jeff Tper已经生成了其他真正自参考的公式，但这个著名的公式不是)。您不能将表示为数字的位图放入同一位图中，因为您将用于基数为10的数字的字体每个数字至少需要4*3&34；像素，而该数字仅包含log210位。还有比这更好的办法吗？某种形式的压缩可能会奏效。\n所以我想我该如何设计一个真正自我参照的公式。由于以下几个原因，此设计过程更像是编程：\n以下是最终形式的公式(如果有足够的兴趣，我可能会在后续文章中描述我如何达到这种形式的步骤)。最初，我在设计过程中使用了Haskell。为了验证最终的形式，我不得不创建C程序(使用GMP大数库)，因为Haskell太慢了。这使我可以再次验证公式是否与程序匹配。这是用LyX表示的公式：\n这个数字省略了N的值。N是一个非常大的数字，它包含12876位数字。您可以在下面的函数图中看到N。此外，您还可以复制并粘贴下面的C源程序中的N。下面是它自己绘制图形时的函数(黄色边框内)：\n你可以在这里找到我用来绘制它的程序的源代码(它需要GMP大数库来编译和运行)。在程序的顶部有一些常量，可以用来定义你想要的视区。它被设置为一些有趣的区域，包括N的一部分，但如果您有耐心，可以将其设置为整个区域。输出图形打印在终端上，&#39；#&#39；表示真值，&#39；##39；表示假值。如果设置的X轴比终端大，则可以重定向到文件，并使用等宽字体在非自动换行编辑器中打开。我已经将这样的文件转换成PBM ASCII格式，并使用GIMP获得上面的图像。\n注意C程序非常慢。在我的电脑上，它运行了大约30个小时。我可以对其进行优化，但我希望C中的函数与公式中的函数紧密对应。虽然程序使用整数值进行x和y计算，但是您也可以用实数值x和y来表示它。如果您不想以这种方式看到N的所有数字，则可以大大加快速度。替换：\n在本例中，您将只看到N的最后60位(并且它们将被转移到不同的位置)。\n2017年12月29日-我注意到杰夫·塔珀(Jeff Tper)创造了更多真正自我参照的公式，它们就在这里。文件有2007年，所以它们早于我2011年的公式。", "note_en": "I have seen   this blog about Tupper self-referential formula recently. This formula is interesting. Its graph contains all possible bitmaps that fit in region of 17 * 106 grid. So it is not much of wonder that one of those many bitmaps contains meaningful representation of the formula itself. Actually, there multiple ways to fit the formula in 17*106 grid, so there are multiple occurrences of the formula in the graph. But there are also all other formulas that fit. It is not truly self-referential since number N which you need to find right viewport is not included inside (see updates at the bottom, Jeff Tupper has\tproduced additional formulas that are truly self-referential,\tbut this famous one is not).\tYou cannot fit a bitmap represented as number in the same bitmap as fonts you would use for base-10 number would take at least 4*3 &#34;pixels&#34; per digit while that digit carries only log 210 bits. Is there a better way than that? Some form of compression might work.\n    So I though how I would design a formula that would be truly self-referential. This design process is more like programming for several reasons:\n    Here is the formula in final form (I will probably describe steps how I arrived to this form in some follow up article if there is enough interest). Originally I have used Haskell in design process. To verify final form, I had to create C program (uses GMP big number library) since Haskell was too slow. This allowed me to verify it again that the formula is matching the program. This is the formula as formated with LyX:\n        Now this one omitted the value of N. The N is very big number, it contains 12876 digits. You can see the N in the graph of the function below. Also, you can copy and paste the N from C source program below. Here is the function as it graphs itself (inside yellow border):\n        You can find source of the program I used to plot it  here (it requires  GMP big number library to compile and run). At the top of the program there are constants which allow to define viewport you want. It is set to some interesting region that includes part of N. But you can set it to whole region if you have patience. Output graph is printed on terminal, &#39;#&#39; denotes true value, &#39; &#39; denotes false values. If you set wider X axis than fits the terminal, you can redirect to file and open in non-word wrapping editor with monospaced font. I have transformed such file to PBM ASCII format and used GIMP to get the image above.\n  Beware that the C program is very slow. On my computer it ran for about 30 hours. I could optimize it, but I wanted the functions in C to correspond closely to the functions in the formula. While the program uses integer values for x and y computation, you can graph it with real valued x and y too. You can make it significantly faster if you don&#39;t want to see all digits of the N in this way. Replace:\n        In this case, you will see only last 60 digits of the N (and they will be shifted to different locations).\n    2017-12-29 - I have noticed that Jeff Tupper has produced additional formulas that are truly self-referential, they are  here. Files have year 2007 so they predate my formula from 2011.", "posttime": "2020-11-05 04:34:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自指,formula,公式", "title": "数学中的自指公式(2011)", "title_en": "Self Referential Formula in Math (2011)", "transed": 1, "url": "https://jtra.cz/stuff/essays/math-self-reference/index.html", "via": "", "real_tags": ["自指", "formula", "公式"]}, {"category": "", "categoryclass": "", "imagename": "2f7d34dda89f39fa0e7a1de623976704.png", "infoid": 1033202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流畅的UI系统图标是来自微软的熟悉的、友好的和现代的图标的集合。\n库通过jcenter发布，请确保已将jcenter()存储库添加到build.gradle根文件中：\n导入器从资产目录中的图标生成Android和iOS库。\n我们的构建管道运行Deploy：Android和Deploy：iOS来创建库。构建定义位于.githoub/work/中。\n请随时打开GitHub问题，并将问题或请求分配给以下联系人。\n该项目采用了Microsoft开放源代码行为准则。有关更多信息，请参阅行为准则常见问题或联系opencode@microsoft.com提出任何其他问题或意见。", "note_en": "Fluent UI System Icons are a collection of familiar, friendly and modern icons from Microsoft.\n      The library is published via JCenter, please ensure that the  jcenter() repository has been added to the root  build.gradle file:\n                 The importer generates the Android and iOS libraries from the icons in the  assets directory.\n        Our  build pipeline runs  deploy:android and  deploy:ios to create the libraries. The build definitions are located in  .github/workflows/.\n         Please feel free to  open a GitHub issue and assign to the following points of contact with questions or requests.\n   This project has adopted the  Microsoft Open Source Code of Conduct. For more information see the  Code of Conduct FAQ or contact  opencode@microsoft.com with any additional questions or comments.", "posttime": "2020-11-05 04:29:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,fluent", "title": "Microsoft Fluent UI系统图标", "title_en": "Microsoft Fluent UI System Icons", "transed": 1, "url": "https://github.com/microsoft/fluentui-system-icons", "via": "", "real_tags": ["microsoft", "fluent"]}, {"category": "", "categoryclass": "", "imagename": "2a0e141701faca58c9a1d739d8db2257.jpg", "infoid": 1033200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2006年，当一位年轻的音乐记者搬到纽约找工作时，她并没有完全领会自己简历的力量。\n注意到她最近的工作是明尼阿波利斯另类周刊City Pages的音乐编辑，这位在MTV新闻采访林赛·托马斯(Lindsey Thomas)的编辑开玩笑地说了一句她从未听说过的话：“这么说你是明尼苏达音乐评论家黑手党的一员，是吗？”\n自从普林斯一举成名、替补乐队和Hüsker Dü确立原始独立摇滚的黄金标准以来，明尼阿波利斯一直在音乐上出类拔萃。而记录这些艺术家的免费周刊《城市页面》(City Pages)也因此声名鹊起。\n虽然《城市之声》比包括《乡村之声》在内的许多同类报纸更经久不衰，但该报的现任所有者、明尼阿波利斯日报《明星论坛报》(The Star Tribune)上周三突然关闭了该报。该报称，疫情带来的挑战使该报“在经济上不可行”。\n在其40年的运营过程中，有相当多的伦敦金融城校友继续在全国性音乐杂志工作，出版有关音乐史和批评的权威书籍，并培养出一种令整个行业羡慕和效仿的基调。事实证明，即使是“城市报”的读者群也很有影响力。\n在双子城郊区长大的音乐网站Pitchfork的创始人瑞安·施莱伯(Ryan Schreiber)说，“作为当地通往艺术文化的路线图，它绝对是必不可少的。”“城市版把我带到了奇怪的地方，在那里我结识了奇怪的朋友，它教会了我们所有让我们走到一起的奇怪的艺术。”它2006年关于Pitchfork的封面故事是唯一一家对我有足够意义的媒体。\n在网络将所有出版物即时提供给每一位读者之前，一家报纸假定其受众主要是本地人。但沿海地区的媒体一直密切关注着伦敦金融城的页面--尤其是它的音乐版块。摇滚评论先驱格雷尔·马库斯(Greil Marcus)于2003年至2004年在City Pages上发表了他的“现实生活前10名”专栏，他曾称其为“美国最好的另类周刊”。来自外地的才华横溢的作家试图投稿(年轻的塔-内希西·科茨在2000年冷淡地评论了鬼脸·基拉的“最高客户”)，甚至搬到全国各地去那里工作。(我在20世纪90年代末搬到明尼阿波利斯，2000年至2001年担任音乐编辑，2017年再次担任音乐编辑，直到他们关灯。)。\n“阅读City Pages是我第一次意识到音乐评论不一定是关于‘这张专辑是好是坏？’”作家梅丽莎·梅尔兹(Melissa Maerz)说，她在20世纪初曾在那里工作，后来成为Spin and Rolling Stone的一名员工。“写作可以是实验性的，几乎是小说式的，也可以是有趣的，也可以是高概念的。”\nThe City Pages的故事始于1979年，也就是音乐杂志“滚石”(Rolling Stone)和“克里姆”(Creem)诞生十年后，出版商汤姆·巴特尔(Tom Bartel)创办了一家名为“红薯”(Sweet Poatts)的音乐报纸，几乎完全由编辑马丁·凯勒(Martin Keller)撰写(而且往往是化名)。该出版物更名为City Pages，增加了艺术和新闻报道，但它的主要吸引力仍然是它的音乐报道和评论，包括一些最早发表的关于Replacements和Hüsker Dü的故事-当然还有普林斯(Prince)，凯勒曾在一篇专栏文章中随意称他为“他的皇家坏蛋”。不久之后，当他在MTV上听到主播马克·古德曼(Mark Goodman)使用这个称谓时，他感到震惊。\nCity Pages在当地的人脉让它意外地领先于竞争对手。1983年，凯勒写了一篇关于童年时鲍勃·迪伦的朋友拉里·凯根的文章，据报道，这位出生于明尼苏达州的摇滚传奇人物感激不尽地问凯根，“我们能为马蒂做什么好事？”答案是：一次漫长的采访。\n音乐评论家史蒂夫·佩里(Steve Perry)在80年代末接任主编一职。“我一直想做的就是让自己周围都是聪明有趣的人，”他说。为了处理音乐和艺术报道，佩里请来了吉姆·沃尔什(Jim Walsh)和特里·萨顿(Terri Sutton)，这两位作家的风格专注于他们对所听到的音乐的个人反应，他让他们自由发挥。\n“我们可以自由地追随任何我们想追随的激情，”萨顿说，尽管巴特尔有一个要求：“他问我能不能少说几句脏话。”(她不能。)。\n20世纪90年代初，萨顿写下了第一批关于托伊兰宝贝的正面故事，当时这三位全是女性的人大多受到男性主导的当地场景的嘲弄，她还记录并激发了暴乱GRRR运动。杰西卡·霍珀(Jessica Hopper)是一位作家和丛书编辑，多年来为该报做出了贡献。她说，“读特里·萨顿(Terri Sutton)作为青少年乐迷和新兴的女权主义者，有效地给了我一条人生道路。”“因为”城市报“有一位女权主义评论家，所以我错误地、幸运地认为，在互联网出现之前的那些日子里，每个城镇都有一位女权主义摇滚评论家在他们的报纸上。”\n威尔·赫尔姆斯(Will Hermes)是一名移植过来的纽约人，1993年成为艺术编辑时，他帮助巩固了City Pages作为伟大音乐作品之乡的声誉，他说，“明尼阿波利斯是一个如此炙手可热的音乐小镇，你几乎有理由专注于当地正在发生的事情，但他们雄心勃勃。”(正如佩里所说，“我们认为音乐评论是一个有一堆对话的社区，即使我们是第15号市场的第二大报纸，我们也想成为这个对话的一部分。”)。\n在20世纪90年代，该报在大型媒体流行之前关注了另类国家乐队，如当地乐队The Jayhawks和经常光顾明尼苏达州的Wilco，并绘制了独立说唱品牌Rhymesayers的崛起图，这将在全国范围内产生影响。\n“乡村之声”是爱马仕的典范，他现在是“滚石”杂志和美国国家公共广播电台(NPR)的撰稿人。他说：“但”美国之声“可能会转向评论家们为对方撰文。”“你不可能真的逃脱惩罚，你必须与更广泛的读者沟通。我的理想是写一些超级市场的东西，但试着吸引一些甚至可能对阅读音乐不感兴趣的人。“\n赫尔墨斯指出，在涅槃领袖库尔特·科本去世后，有一篇专门纪念库尔特·科本的封面特写，收集了认识科本的双子城音乐家的想法和回忆，也收集了当地歌迷的想法和回忆。“在Facebook之前，它基本上就是Facebook，”他说。\n在爱马仕的领导下，City Pages建立了严格的编辑文化，并在他离开后继续下去。“编辑是有标准的，”乔恩·多兰(Jon Dolan)说，他在90年代末是“城市页面”的音乐编辑，现在在“滚石”工作。“没有想要成为莱斯特·邦斯(Lester Bang)的人发出疯狂的咆哮。”米开朗基罗·马托斯(Michaelangelo Matos)是一名定期撰稿人，他的工作包括记录中西部电子音乐界的重要文件，他说，“在那篇论文中，你不可能得到一个不必要的句子。”\n还有一种感觉，明尼阿波利斯最著名的艺术家就在你身后。也许这只是一个传说，普林斯在镇上阅读所有关于他的文章。但你永远不知道他什么时候会对批评做出回应-就像梅尔茨在2001年成为音乐编辑后不久发现的那样，她批评了他在性别角色方面的一些倒退声明。22岁的梅尔兹被传唤到佩斯利公园与这位愤怒的明星进行私下的一对一。“我们进行了一场相当激烈的辩论，最后他怒气冲冲地走出了房间，”梅尔兹说。“我很害怕，但也有点激动。”\n近年来，音乐板块试图平衡网络出版的需求与其编辑传统的标准。安德里亚·斯文森(Andrea Swensson)说，“每周都感觉像是在为我们所做的事情保持一定程度的正直而战。”2006年，“纽约时报”连锁店收购“纽约时报”并制定了数字出版配额时，她是音乐编辑。\n在接下来的几年里，City Pages记录了Bon Iver(几乎来自威斯康星州当地的Eau Claire)的崛起。并帮助向世界介绍了崭露头角的流行歌星利佐，他是2013年Pick to Click的获奖者，这是沃尔什在1991年发起的最佳新音乐艺术家投票。\n直到最后，City Pages努力保持作为音乐作家的报纸，正如沃尔什所说，热情的业余人士可以走进门对编辑说，“我想写这个，我想用第一人称，我想让它听起来很聪明。帮帮我。“", "note_en": "When a young music journalist moved to New York in 2006 looking for work, she didn’t quite grasp the power of her résumé.\n Noticing that her most recent job was as music editor for the Minneapolis alternative weekly  City Pages, the editor interviewing Lindsey Thomas for a position at MTV News playfully dropped a phrase she’d never heard: “So you’re part of the Minnesota music critic mafia, huh?”\n  Since the days when Prince vaulted to stardom and the Replacements and Hüsker Dü established the gold standard for raw indie-rock, Minneapolis has always punched above its weight, musically. And City Pages, the free weekly that documented those artists, developed an outsized reputation all its own.\n While it outlasted many of its kin, including  the Village Voice, City Pages was shut down suddenly last Wednesday by its current owner, the Minneapolis daily newspaper the Star Tribune, which said challenges brought by the pandemic made the paper  “economically unviable.”\n Throughout its four-decade run, a disproportionate number of City Pages alumni went on to work at national musical magazines, to publish definitive books of music history and criticism, and to foster a tone that was envied and emulated throughout the industry. Even City Pages’ readership proved influential.\n “It was absolutely essential as a local road map to arts culture,” said Ryan Schreiber, the founder of the music website Pitchfork, who grew up in the Twin Cities suburbs. “City Pages led me to weird places where I made weird friends, and it taught us about all the weird art that brought us together. Its 2006 cover story on Pitchfork is the only press that’s ever meant enough to me to have framed.”\n Before the web made every publication instantaneously available to every reader, a newspaper assumed its audience was primarily local. But media on the coasts kept tabs on City Pages — especially its music section. The rock criticism pioneer Greil Marcus, who published his  “Real Life Top 10” column in City Pages from 2003 to 2004, once called it “the best alternative weekly in America.” Talented writers from out of town sought to contribute (a young Ta-Nehisi Coates  unenthusiastically reviewed Ghostface Killah’s “Supreme Clientele” in 2000) and even moved across the country to work there. (I relocated to Minneapolis in the late ’90s and was the music editor from 2000 to 2001 and again from 2017 until they shut off the lights.)\n “Reading City Pages was the first time I realized music criticism didn’t have to be about, ‘Is this album good or bad?’” said the writer Melissa Maerz, who worked there in the early ’00s and later was a staffer at Spin and Rolling Stone. “The writing could be kind of experimental, almost novelistic, and it could be funny or high-concept.”\n  The City Pages story began in 1979, a decade after the births of the music magazines Rolling Stone and  Creem, when the publisher Tom Bartel started a music paper called Sweet Potato that was written almost exclusively (and often pseudonymously) by the editor Martin Keller. Rechristened as City Pages, the publication added arts and news coverage, but its main draw remained its music reporting and criticism, including some of the earliest published stories on the Replacements and Hüsker Dü — and, of course, Prince, who Keller once offhandedly referred to as “His Royal Badness” in a column, an epithet he was shocked to hear the VJ Mark Goodman use on MTV a short while later.\n City Pages’ local connections gave it an unexpected leg up on its competitors. After Keller wrote a piece about the childhood Bob Dylan friend Larry Kegan in 1983, the grateful Minnesota-born rock legend reportedly asked Kegan, “What’s a nice thing we could do for Marty?” The answer: a long interview.\n  A music critic, Steve Perry, took over as editor in chief in the late ’80s. “All I ever wanted to do was surround myself with smart, interesting people,” he said. To handle music and arts coverage, Perry brought in Jim Walsh and Terri Sutton, two writers whose styles focused on their personal reactions to the music they heard, and he gave them free rein.\n “We were let loose to follow whatever passion we wanted to follow,” Sutton said, though Bartel had one request: “He asked if I could just swear less.” (She couldn’t.)\n In the early ’90s, Sutton wrote the first positive stories on Babes in Toyland, at a time when the all-female trio were mostly mocked by the male-dominated local scene, and she also both documented and inspired  the riot grrrl movement. “Reading Terri Sutton as teenage music fan and burgeoning feminist effectively gave me a path in life,” said Jessica Hopper, a writer and book series editor who contributed to the paper over the years. “Because City Pages had a feminist critic, I assumed, mistakenly and blessedly, in those pre-internet days, that every town had a feminist rock critic at their paper.”\n Will Hermes, a transplanted New Yorker who helped consolidate City Pages’ reputation as a home of great music writing when he became arts editor in 1993, said, “Minneapolis was such a hot music town that you could have almost justified focusing on what was happening locally, but they were ambitious.” (As Perry put it, “We thought of music criticism as a community having a bunch of conversations, and even though we were the No. 2 paper in a No. 15 market, we wanted to be part of that conversation.”)\n  In the ’90s the paper paid attention to alt-country bands like the local group the Jayhawks and the frequent Minnesota visitors Wilco before the larger media caught on, and also charted the rise of the independent rap label Rhymesayers, which would have a national impact.\n The Village Voice was the model for Hermes, now a Rolling Stone and NPR contributor. “But the Voice could veer into critics writing for each other,” he said. “You couldn’t really get away with that, you had to communicate with a broader readership. My ideal was write something that is supersmart but try to hook somebody who might not even be interested in reading about music.”\n Hermes pointed to a cover feature dedicated to Kurt Cobain after the Nirvana leader’s death that collected thoughts and remembrances from Twin Cities musicians who knew Cobain, but also from local fans. “It was basically Facebook before Facebook,” he said.\n Under Hermes, City Pages established a culture of rigorous editing that continued after he left. “The editors had standards,” said Jon Dolan, a City Pages music editor in the late ’90s who now works at Rolling Stone. “There was no wannabe Lester Bangs going off on crazy rants.” Michaelangelo Matos, a regular contributor whose work included vital documentation of the Midwestern electronic music scene, said, “You couldn’t get an unnecessary sentence in that paper.”\n There was also always the sense that Minneapolis’s most famous artist was looking over your shoulder. Maybe it was just a legend that Prince read everything written about him in town. But you never knew when he might respond to criticism — as Maerz found out when, shortly after becoming music editor in 2001, she criticized some of his retrograde statements on gender roles. The 22-year-old Maerz was summoned to Paisley Park for an off-the-record one-on-one with the incensed star. “We had a pretty heated debate that ended with him storming out of the room,” Maerz said. “I was terrified, but also kind of thrilled.”\n The music section tried to balance the demands of web publishing with the standards of its editing tradition in recent years. “Every week felt like such a fight to keep some kind of integrity to what we were doing,” said Andrea Swensson, who was music editor when the New Times chain acquired the paper in 2006 and instituted digital publishing quotas.\n During the subsequent years, City Pages documented the rise of Bon Iver (from almost-local Eau Claire, Wis.) and helped introduce the world to the budding pop star Lizzo,  the 2013 winner of Picked to Click, the best new music artist poll that Walsh started in 1991.\n And until the end, City Pages strove to remain a music writer’s paper where, as Walsh put it, an enthusiastic amateur could walk in the door and say to an editor, “I’d like to write this, I’d like to use the first person and I’d like it to sound smart. Help me.”", "posttime": "2020-11-05 04:29:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "alt,pages,音乐", "title": "都市版--音乐写作独占鳌头的《Alt-Weekly》", "title_en": "City Pages, the Alt-Weekly Where Music Writing Reigned Supreme", "transed": 1, "url": "https://www.nytimes.com/2020/11/02/arts/music/minneapolis-city-pages-music.html", "via": "", "real_tags": ["alt", "pages", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "421ba2f10e45db35e630d0b900fafaf6.png", "infoid": 1033198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何商业关系最基本的核心都是信任。传统上，这是通过多个互动建立的，其中至少包括面对面的会议。\n似乎面对面的会面帮助巩固了讨论的内容。无论这是通过肢体语言，还是双方都能够降低警惕，有点非正式地说话。\n这些面对面的会面一直是维持长期业务关系的主要方式。然而，由于目前的大流行，这些类型的相互作用的能力已经被搁置。创业社区必须适应这些限制，在我看来，为创业创造了一个完美的环境。\n虽然我从商业角度认识到并经历了这场大流行的负面影响，但我试图看到积极的一面。正是出于这种动机，我最近创办了一家名为Accordable的初创公司，这是一款竞争对手监控解决方案。\n好的，很好，你想创业，但你怎么才能找到一个联合创始人呢？\n我希望我能告诉你这是最简单的部分，但实际上这可能是最难的。\n我们处在一个更受限制的社会时代，所以它变得更加困难。一个很好的起点是与你以前共事过的同事打交道。你从专业的角度了解他们，你已经看到他们是如何与同事相处的，以及他们的职业道德。\n记住，如果是你自己的公司，风险要高得多，所以这些有利的员工工作特质并不总是转化为一个好的联合创始人。\n就我个人而言，我建议你去看看不同的数字社区，你会惊讶地发现你会遇到谁，可能会找到一个和你有非常相似目标的人。\n我个人最喜欢的社区是独立黑客。他们有一个特定的群体，叫做“寻找合作伙伴”，你会发现各种各样的人都在寻找创业机会。\n理想的搭配是与你的技能完全相反的人。把它想象成一支冰球队。如果你的球队都是守门员，你就会一事无成。你需要平衡和不同的优势来帮助你的产品超越顶端。\n现在有一件事不应该是完全相反的，那就是你的动力。找到一个有同样动力的人很重要，否则在不久的将来可能会有越来越多的怨恨。\n没有两种情况是相同的，这就是为什么很难找到联合创始人的原因。需要有相似的职业目标和不同的技能组合的正确组合，才能建立强大的团队。\n另一个重要的因素是，你是否能从社会的角度看待自己与这个人的相处。面对现实吧，你将不得不花很多时间与这个人交谈，并规划你企业的未来。\n有些性格类型就是不能混为一谈。即使你们的技能完全匹配，如果你发现自己处于一段有毒的工作关系中，你的心理健康可能会受到威胁。\n对我来说，创建一家初创公司不一定是为了钱(我的意思是，这当然有帮助！)。但这是一个我的声音直接影响到企业未来的渠道。我可以测试疯狂的想法，而不用担心愤怒的投资者或惹恼管理层。\n仅仅因为你与某人见面并不能自动建立信任。每个人都有自己的问题，你永远不会真正理解影响他们决策的所有因素。\n建立信任需要时间，你们需要学习彼此的工作习惯、个性和目标。在一起工作两周后，你应该对对方有了很好的了解。\n当然，两周的时间不足以做任何长期的事情，但它会给你一个很好的方向，在这一点上，你可以选择是否继续。\n虽然你应该保护自己，但没有必要一开始就把钱浪费在律师身上。只需写一份基本协议，列出你们同意的条款，并在稍后阶段再讨论。\n即使有律师签署的协议，你也可能会被搞砸，所以一开始不要太担心这一点。\n你已经组建了一支强大的团队，你们的技能完美匹配，你已经准备好离开，但你错过了一件事。\n这是很困难的，因为无论你选择什么，你都会投入大量的时间，所以你不想做出错误的选择，从而让创业悔恨不已。\n现在我再怎么强调这一点也不为过，无论你选择什么，都要确保你真正感兴趣。我曾经遇到过很多情况，当一个想法的最初火花消失后，我被困在一个我觉得非常无聊的产品上。\n这个产品可能会赚钱，但如果你不喜欢它，它就不值得你这么做。\n我们采取的方法不是陷入分析瘫痪，我们只是从一些东西开始。\n我们开始开发一个服务器端的网络分析解决方案，并在市场上测试这个想法。我们专注于建设基础设施和容易转移的部分，我们可以将其用于其他想法。\n长话短说，与其把头撞在墙上试图找到完美的主意，不如开始吧！\n当谈到远程联合创始人时，沟通的重要性就倍增了。建立适当的渠道并保持清晰的时间表是成功的关键。\n当你是“老板”的时候，拖延是很容易的，但当你看到你的联合创始人拼命工作，而你什么都不做时，这种负罪感应该会出现。当然，除非你是个混蛋。\n我们的主要通信枢纽是Slack，我们集成了所有工具来向该平台发送通知。这是我们的主要控制面板，它帮助我们在业务健康方面保持一致。\n找出适合你们二人组的方法，然后顺其自然。对于我们来说，我们每周会有一到两个电话，然后对于较小的话题，只需相互发送音频剪辑即可。\n这种风格对我们很有效，因为当一个想法新鲜时，你可以发送一个快速音频片段，另一个人可以在他们有时间的时候收听。\n跑题是个大问题，所以试着保持在目标上，不要每天打长途电话过度沟通。\n当谈到交流时，我可以分享的一条建议是，在文本中语气没有被恰当地传达出来。我数不清有多少次我看到人们因为语气上的误解而对一封电子邮件或松懈的信息感到不安。\n在这个数字世界里，不要忘记如何沟通。仓促下结论或否定只会让你的团队倒退。在结成不必要的敌人之前先澄清。\n寻找联合创始人没有一刀切的公式。人是不可预测的。找到合适的衣服需要时间。\n唯一不变的是你的胆量，因为无论你选择谁，你都要冒一次险。\n你可能会被烧伤，或者感觉自己在做所有的工作，这只是企业家生活中的附带损害。\n你所能做的就是利用你得到的信息，决定你是否相信你的联合创始人。当它起作用的时候，它就起作用了，你最终会看到成功的。\n这就是我们与Accordable合作的方向，我们很高兴看到这个项目的下一步是什么。", "note_en": "The most fundamental core of any business relationship is trust. Traditionally this was built through multiple interactions, which included at least in-person meeting.\n It seemed that something about meeting in person helped solidify what was discussed. Whether this is through body language or both parties being able to lower their guards and speak somewhat informally.\n These in-person meetings have been a staple for long-lasting business relationships. However, the ability for these type of interactions has been put on hold thanks to the current pandemic. The startup community has had to adapt to these restrictions and in my opinion, the perfect environment for entrepreneurship was created.\n  While I recognize and have experienced the downsides of this pandemic from a business perspective, I try to look at the positives. This motivation is what led to my most recent startup,  Accordably, which is a competitor monitoring solution.\n  Alright, great, you want to start a business, but how do you actually find a cofounder?\n I wish I could tell you that this was the easy part, but it’s actually probably the hardest.\n  We are in more restricted social times, so it becomes even more difficult. A good place to start is with previous colleagues that you’ve worked with. You know them from a professional perspective, you’ve seen how they act with colleagues and their work ethic.\n Remember, the stakes are much higher when it’s your own business, so these favourable employee working traits don’t always translate into a good cofounder.\n Personally, I would recommend checking out different digital communities, you’d be surprised who you’ll meet and might find someone that has very similar goals to you.\n My personal favourite community is Indie Hackers. They have a specific group called  “Looking to partner up” and you will find a wide variety of people looking to start a business.\n     The ideal match is someone who is the complete opposite of your skillset. Think of it like an ice hockey team. If your team was all goalies, you’d get nowhere. You need balance and different strengths to help push your product over the top.\n Now one thing that shouldn’t be the complete opposite is your motivation. Finding someone who has the same drive is important or else there could be a growing resentment in your near future.\n No two situations are the same and this is why it’s difficult to find a cofounder. There needs to be the right mix of similar professional goals and differing skillsets to build a strong tandem.\n Another important attribute is whether you can see yourself getting along with this person from a social perspective. Face it, you’re going to have to spend a lot of time speaking with this person and planning out the future of your business.\n There are some personality types that just don’t mix. Even if your skillsets are the perfect match, your mental health could be at risk if find yourself in a toxic work relationship.\n For me, building a startup isn’t necessarily about the money (I mean it helps of course!) but it’s an outlet where my voice has a direct impact on the future of the business. I can test out crazy ideas and not worry about angry investors or upsetting management.\n  Just because you meet somebody in person doesn’t automatically create trust. Everyone has their own problems and you’ll never truly understand all the factors that go into their decisions.\n   It takes time to build trust, you need to learn each others working habits, personalities and goals. After 2 weeks of working together, you should have a good understanding of the other person.\n Of course, 2 weeks isn’t enough to jump into anything long term, but it will give you a good idea of direction and at that point, you can choose whether or not to continue.\n While you should protect yourself, there’s no need to waste money on lawyers right at the start. Just write up a basic agreement that lays out your agreed upon terms and that you will revisit at a later stage.\n Even with an agreement created by lawyers, you can get screwed over, so don’t worry about this too much at the start.\n  You’ve assembled a strong team, your skills match perfectly and you’re ready to go, but you’re missing one thing.\n  This is difficult because whatever you choose you will be committing a large chunk of time to it, so you don’t want to make the wrong choice and get startup remorse.\n Now I can’t stress this enough, no matter what you choose, make sure that it genuinely interests you. I’ve been in many situations that after the initial sparkle of an idea wears off, I’m stuck with a product that I find soul-crushingly boring.\n The product may make money, but if you don’t enjoy it, it’s not worth it.\n The approach that we took was rather than getting stuck in analysis paralysis, we just started with something.\n We started working on a server-side web analytics solution and testing the market on this idea. We focused on building the infrastructure and easily transferable parts that we could use for other ideas.\n   Long story short, instead of beating your head against a wall trying to find the perfect idea,  just start!\n   When it comes to remote cofounders the importance of communication is multiplied. Setting up the proper channels and maintaining a clear schedule is critical for success.\n  It’s very easy to procrastinate when you’re “the boss” but when you see your cofounder working their ass off and you’re doing nothing, that guilt should set in. Unless of course, you’re a prick.\n Our main communication hub is Slack and we have integrated all of our tools to send notifications to this platform. This is our main dashboard and it helps keeps us on the same page for the health of the business.\n Figure out what works for your duo and run with it. For us, we will have one or two calls a week and then for the smaller topics, just send each other audios clips.\n This style has worked for us because when a thought is fresh, you can send a quick audio snippet and the other can listen to it when they have time.\n Getting sidetracked is a big problem, so try to stay on goal and not overcommunicate with long phone calls every day.\n One piece of advice that I can share when it comes to communication is that tone is not conveyed properly over text. I can’t count the number of times I’ve seen people get upset over an email or Slack message from a misunderstanding in tone.\n In this digital world, don’t forget how to communicate. Jumping to conclusions or negatives will just set your team back. Clarify before making an unnecessary enemy.\n  There is no one size fits all formula to finding a cofounder. People aren’t predictable. It takes time to find the right fit.\n The one constant is your gut because no matter who you choose, you’re going to have to take a chance.\n You could get burned or feel like you’re doing all the work, that’s just collateral damage in the life of an entrepreneur.\n All that you can do is work with the information you’re given and decide if you believe in your cofounder. When it works, it works and you’ll eventually see success.\n That’s what we’re working towards with Accordably and we’re excited to see what’s next for this project.", "posttime": "2020-11-05 04:18:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "联合,saas,创业", "title": "在从未见过联合创始人的情况下开始SaaS业务", "title_en": "Starting a SaaS business when you’ve never met your cofounder", "transed": 1, "url": "https://accordably.com/blog/starting-saas-business-remote-cofounders", "via": "", "real_tags": ["联合", "saas", "创业"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们要开始了！观看西蒙·佩顿·琼斯(Simon Peyton Jones)在2020年11月4日的哈斯克尔交流会议上宣布哈斯克尔基金会(Haskell Foundation，HF)的消息。在这次演讲中，西蒙谈到了我们成立这个新组织的原因及其目标。最后，他和一群HF志愿者一起回答观众的问题。\nHaskell不仅仅是“另一种编程语言”：它体现了对整个编写软件企业的激进而优雅的攻击。它深刻地影响了软件界向更好的方向发展。Haskell基金会(HF)是一个独立的非营利性组织，致力于通过支持其工具、图书馆、教育和研究生态系统来扩大对Haskell的采用。\n忠实于哈斯克尔创立的设计原则。Haskell的设计将原则置于权宜之计之上，严格遵循纯函数式编程的原则。\n为社区赋权。HF将自己视为增强、庆祝和协调Haskell充满活力的社区的贡献和领导的一种手段。\n开放、友好和多样化。对许多人来说，Haskell与其说是一种编程语言，不如说是一种生活方式。欢迎所有人，所有人都可以贡献自己的力量。为此，我们通过了“哈斯克尔尊重沟通指南”。\n透明度。所有与HF开源项目相关的技术决策都将是透明的。\n加入HF-公告电子邮件列表。这份榜单将不会有频繁发布哈斯克尔基金会重大新闻的流量。预计所有消息都将来自HF或其指定人员。在这里订阅，在这里查看档案。\n加入HF-讨论电子邮件列表。加入这个列表是讨论和参与的一个很好的方式。所有参与者都应遵守“尊重沟通准则”。订阅：点击此处查看档案。\n哈斯克尔基金会已经向董事会发出了提名的号召。Nominations将一直开放到2021年1月11日。新的董事会成员将由临时董事会成员选举产生。", "note_en": "We&#39;re getting started! Watch Simon Peyton Jones announce the Haskell Foundation (HF) at the Haskell eXchange conference on November 4, 2020. In this talk, Simon talks about why we are launching this new organization and its goals. At the end, he is joined by a panel of HF volunteers to take questions from the audience.\n  Haskell is not “just another programming language”: it embodies a radical and elegant attack on the entire enterprise of writing software. It profoundly influences the world of software for the better. The Haskell Foundation (HF) is an independent, non-profit organization dedicated to broadening the adoption of Haskell, by supporting its ecosystem of tools, libraries, education, and research.\n Faithfulness to Haskell’s founding design principles. Haskell’s design puts principle ahead of expediency by cleaving closely to the principles of purely functional programming.\n  Empowering the community. HF sees itself as a means to augment, celebrate, and coordinate the contributions and leadership of Haskell’s vibrant community.\n Openness, friendliness, and diversity. For many, Haskell is more a way of life than a programming language. All are welcome, all can contribute. To this end we have adopted the Haskell Guidelines For Respectful Communication.\n Transparency. All technical decisions related to HF’s open source projects will be transparent.\n Join the HF-announce email list. This list will have infrequent traffic announcing major news from the Haskell Foundation. It is expected that all messages will come from HF or its designees. Subscribe  here and view the archives  here.\n Join HF-discuss email list. Joining this list is a great way to discuss and participate. All participation is expected to conform to the  Guidelines for Respectful Communication. Subscribe:  here and view the archives  here.\n  The Haskell Foundation has issued a  call fornominations to the Board of Directors. Nominationswill remain open until January 11, 2021. New Board members will be selected bythe interim members of the  Board of Directors.", "posttime": "2020-11-05 04:18:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基金会,haskell,hf", "title": "哈斯克尔基金会", "title_en": "Haskell Foundation", "transed": 1, "url": "https://haskell.foundation/", "via": "", "real_tags": ["基金会", "haskell", "hf"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到上一篇文章的主要内容，我在上一篇文章中向Tomáš向AXPboxby宣布了es40仿真器的分支，包括错误修复和返工，允许它毫无问题地安装OpenVMS8.4。从那时起，我贡献了一些补丁和文档更新，现在NetBSD也启动了(netbsd的补丁来自其他es40分支)。我也研究过网络设置，因为这是一个有点单调乏味的过程，因为pcap和linux是用于网络仿真的pcap。SIMH(其中一个很棒的VAX仿真器)在网络方面也遇到了同样的问题。本指南将向您展示如何安装AXPbox，并让OpenVMS 8.4准备好并在AXPbox中运行联网功能。这是一本很长的指南，有很多信息和输出。\n我建议你阅读AXPbox wiki安装指南，将来可能会有更多关于安装OpenVMS的更新。\n这本指南篇幅很大，内容很全面，我们涉及的范围很广。使用上面的内容表格跳到您感兴趣的部分。主题的顺序是明确的，这样你就可以跟上了。如果你有能力，一定要回馈AXPbox，这是我们开发开源AlphaEmulator的唯一希望。\n我将从一些关于网络的内容开始。在托马斯的帮助下，我花了很长时间才弄清楚发生了什么事，为什么会这样。简单地说，AXPbox使用libpcap来模拟网络。在Linux上，主机系统不会接收axpbox生成的数据包。这意味着，如果您在台式机上运行AXPbox，您的台式机将无法与AXPbox通信，但网络上的其他系统将可以。这个问题可以通过在您的主机系统上使用2个网络接口(一个用于axpbox，一个用于常规联网)或通过VirtualBox设置来解决，我们将进一步解释。\nSIMH记录了这个问题，它们具有相同的联网设置(尽管SIMH还支持TUN/TAP和VDE，它们不会受到此问题的影响)。\n在使用WinPcap界面的Windows上，模拟计算机可以在同一界面上与主机交谈。在其他安装了libpcap的平台(Linux、Mac OS)上，由于主机网络栈不接收模拟器发送的数据包，因此模拟计算机不能通过选定的接口与主机交谈。解决方法是在主机中使用第二个NIC，并将它们连接到同一网络；然后主机和模拟器可以通过物理局域网进行通信。\n2.11-我的Linux、OSX或其他Unix主机无法通过以太网与PDP-11或VAX通信；为什么？\n这些系统上的网络堆栈自然不会接收使用pcap_sendPacket API传输的数据包……\n我在桥接网络适配器方面也遇到了问题。我习惯于在使用KVM虚拟机时为创建一个桥接器，并为每个虚拟机提供其自己的TapX接口，它们可以通过这种方式直接访问网络。\n由于上述原因，如果你想使用网络(你可能会这样做，玩集群是很棒的)，并且你的PC上只有一块网卡，我建议你使用有两个独立网络适配器的虚拟机。在本指南中，我在我的桌面上使用Ubuntu20.04，它运行VirtualBox(为了便于使用，我在本指南中选择了它，而不是KVM)。\nVirtualBox有一个带2个虚拟网络适配器的Debian 10虚拟机，第一个在VirtualBox NAT网络中，一个将由OpenVMS使用，第二个桥接到我自己的局域网，那个用来从Ubuntu通过SSH连接到DebianVM。\n这台Debian 10虚拟机运行的是AXPbox，所以这有点像是在进行虚拟机初创。把你的纺纱上衣准备好。\nAXPbox内的OpenVM可以连接到互联网，通过VirtualBox，您可以创建端口转发回OpenVMS。这将在后面的网络部分进行解释，包括屏幕截图。\n我遇到了两个网桥接口的问题，OpenVMS无法连接到我的路由器，我的主机PC也无法连接到OpenVMS，但Tomas已将该设置与KVM配合使用，因此可能会起作用，但为了便于重现，我将重点介绍此VirtualBox NAT设置。\n当我插入USB网卡适配器并将AXPbox配置为使用该适配器时，连接工作正常。如果您的PC中有多个独立的网卡，则不需要安装虚拟机。\n**总结、安装VirtualBox、安装带有2个NIC、1个NAT和1个桥接NIC的Debian 10虚拟机，或在您的PC中使用多个NIC。\n如果你熟悉KVM，你也可以做到这一点，根据上面的理论和解释，网络设置应该足够简单。\n目前，只有一个合法选择可以获得OpenVMS安装介质，即VSI社区许可计划。填写那里的表单，您将收到一封电子邮件，其中包含VSI SFTP服务器的登录凭据。\n登录SFTP服务器并下载名为ALPHA0842L1.ZIPEXE的文件。这是OpenVMS Alpha的自解压存档文件，但可以在任何操作系统上使用解压缩或存档管理器正常解压。解压缩后，您应该有文件ALPHA0842L1.ISO。\n$unzip ALPHA0842L1.ZIPEXE归档文件：ALPHA0842L1.ZIPEXE警告[ALPHA0842L1.ZIPEXE]：120320个额外的字节在Zipfile的开头或内部(无论如何都尝试处理)膨胀：ALPHA0842L1.ISO$md5sum ALPHA0842L1.ISO e19f1123bdb565d9f9bb736be5314c46 ALPHA0842L1.ZIPEXE$md5sum ALPHA0842L1.ZIPEXE 2228fcd259640a16a57a6c609ec ALPHA0842L1.ZIPEXE e19f1123bdb565d9f9bb736be5314c46 ALPHA0842L1.ZIPEXE$md5sum ALPHA0842L1.ZIPEXE。\n您还将收到一封电子邮件，其中包含您的许可证、PAK文件。把那个也留着吧。\n或者，您也可以使用现已结束的HPE OpenVMS爱好者计划中的ALPHA084.ISO。不过，您确实需要一个不同于HPE的许可证PAK，并且您需要将Debian虚拟机内部的日期设置为追溯到您的HPE爱好者许可证仍然有效的时候。对于业余爱好者来说，它可以在AXPbox中正常工作。\n这是一个托管HP ISO网站，这是另一个网站，但我不确定这些网站还能存活多久。在谷歌上搜索文件名或求助于无法律互联网协议，以获得此ISO的副本。\n我将假设您在已经设置的Debian 10虚拟机中执行了这些步骤。它们对Ubuntu20.04也是一样的。\n--找到了PCAP。网络支持已启用--找到SDL。已启用SDL图形支持--找到x11。已启用X11图形支持--C++编译器标志：-O3-march=ative-DNDEBUG--C编译器标志：-O3--链接器标志：--配置完成--生成完成--构建文件已写入：/root/git/axpbox/build目标Axpbox的扫描依赖项[1%]生成CXX对象CMakeFiles/axpbox.dir/src/AliM1543C.cpp.o[3%]生成CXX。_usb.cpp.o[...][95%]生成CXX对象CMakeFiles/axpbox.dir/src/gui/scancodes.cpp.o[96%]生成CXX对象CMakeFiles/axpbox.dir/src/gui/sdl.cpp.o[98%]生成链接CXX可执行Axpbox的CXX对象CMakeFiles/axpbox.dir/src/lockstep.cpp.o[100%][100%]生成目标Axpbox。\n如果您有来自VSI的PAK(产品激活密钥)和业余爱好许可证，则可以方便地构建一个ISO，然后在安装后装载该ISO并在OpenVMS上运行Alpha_Community_License_PAK_XX_XXXX.COM脚本，然后再进行复制和粘贴。并不是所有的终端仿真器都能很好地处理它(速度太快)，而且有了惠普许可证，它的复制和粘贴就太长了。VSI许可证似乎更短。\n#为scriptmkdir许可证创建文件夹#将许可证脚本复制到该文件夹cp Alpha_Community_License_PAK_SEP_2020.COM许可证#生成该文件夹的ISO genisoImage-V许可证-o pak.iso许可证。\n转换表总大小：0总Rockbridge属性字节数：0总目录字节数：0路径表大小(字节)：10最大BRK空间使用量0175个写入区段(0 MB)。\n稍后，当我们重新安装完OpenVMS时，我们将从ISO激活此许可证。点击此处阅读有关OpenVMS脚本、ISO和记录格式的更多信息。\n综上所述，srmrom是一种BIOS，但是对于alpha和openvms来说，这是引导所必需的。它可以从HP获得，但现在不能使用了，所以我对其进行了镜像。创建一个rom文件夹并将文件下载到那里：\n缩写SRM源自Alpha系统参考手册，该手册描述了Alpha体系结构和相关固件。\nPALcode是分配给SRM固件提供的一组特定功能的名称。PAL代码用于提供高级操作系统或应用软件所需的低级功能，这些功能在Alpha硬件中可能无法直接使用。PAL代码是使用可用的Alpha指令和Alpha处理器实现的，尽管PAL代码在简化编程的模式下运行。PAL代码还允许访问特定Alpha微处理器实现的处理器特定功能和其他内部功能；操作系统或应用程序代码不容易访问的微处理器特定功能。\n我们差不多准备好安装OpenVMS了。编译和准备之后，剩下的就是配置AXPbox了。\nAXPbox有一个交互式配置提示符，您可以使用./axpbox configure调用该提示符。它会问你一系列问题，你可以在项目维基上阅读更多关于它的内容。出于本指南的目的，请使用以下配置。\n将以下内容放入名为es40.cfg的文件中，该文件与二进制文件位于同一文件夹中。\nSys0=海啸{memy.bit=28；rom.srm=&#34；rom/cl67srmrom.exe&#34；；rom.解压缩=&#34；rom/depressed.rom&#34；；rom.flash=&#34；rom/flash.rom&#34；；rom.dpr=&#34；rom/dpr.rom&#34；；cpu0=ev68cb{速度=800m；}pci0.15=Ali_ide{disk0.0=file{file=&#34；disk0.img&#34；；ial_number=&#34；vms&#34；rev_number=&#34；8.4&#34；model_number=&#34；OpenVMS8.3&#34；；read_only=false；cdrom=false；autocreate_size=6000m；}disk1.0=file{file=&#34；ALPHA0842L1.ISO&#34；；read_only=true；cdrom=true；}}pci1.1=dec21143{适配器=&#34；enp0s3&#34；；mac=&#34；08-00-DE-AD-BE-EF&#34；；}pci0.7=ALI{MUSE.ENABLED=FALSE；VGA_CONSOLE=FALSE；}pci0.19=ALI_USB{}}。\n更改适配器=#34；enp0s3&34；行以匹配您的VirtualBox NAT适配器。也就是说，不是具有您要连接的Debian VM的IP的NIC，而是具有内部VirtualBox网络的NIC。在我的示例中，enp0s8是桥接适配器，enp0s3是NAT适配器。\n确保ALPHA0842L1.ISO安装ISO与二进制文件和此配置文件位于同一文件夹中。如果您忘记放置该文件，您将收到以下提示：\nPci0.15(Ali_Ide).disk1.0(File)：无法打开文件ALPHA0842L1.ISO！仿真器故障：运行时异常：pci0.15(Ali_Ide).disk1.0(File)：文件不存在且未设置autocreate_size：/root/git/axpbox/src/DiskFile.cpp，第124行分段错误。\n我的设置是1800 MHz cpu.Speed和30位内存(1 GB而不是256MB)。对于本指南，我将推荐默认值(800 MHz和256MB)。\n如果要跳过启动时的内存测试(节省几分钟的引导时间)，请在CPU块的iCache行下面添加以下内容：\n请注意，这将导致OpenVMS安装失败，因此请在安装完成后添加该行。\nPci0.15(Ali_Ide).disk0.0(文件)：无法打开文件disk0.img！pci0.15(Ali_Ide).disk0.0(文件)：写入6,000 1KB块：100%pci0.15(Ali_Ide).disk0.0(文件)：6,000 MB文件disk0.img created.pci0.15(Ali_Ide).disk0.0(文件)：已装载文件disk0.img，12288000 512字节块，15360/16/50。\n如果一切设置正确，仿真器应提示您连接到telnet端口：\n连接到仿真器提示符指定的telnet端口(将10.0.0.8替换为Debian VM的IP)。\n$telnet 10.0.0.8 21264正在尝试10.0.0.8...连接到10.0.0.8。转义字符是&#39；^]&#39；。这是ES40 EmulatorOpenVMS PALcode V1.98-104、Tru64 UNIX PALcode V1.92-105上的串行端口#0在CPU 0[...]256 MB系统内存上启动控制台测试系统测试NetworkAlphaServer ES40控制台V7.3-1，构建于2007年2月27日12：57：47P00&gt；&gt；\n如果您看到P00&gt；&gt；&gt；提示，请继续。如果您得到崩溃，断开连接或段故障，检查仿真器选项卡，它有一个错误什么是错误的。\n在我们的示例中，DQB0具有安装磁盘，而DQA0是我们的根磁盘。引导安装ISO：\n(启动dqb0.0.1.15.0-标志0)dqb0.0.1.15.0的数据块0是一个有效的启动数据块，从dqb0.0.1.15.0中读取1230个数据块，引导程序代码Read inbase=200000，IMAGE_START=0，IMAGE_BYTES=99c00(629760)在2000处初始化HWRPB在ff56000处初始化页表初始化机器状态设置与主CPU的亲和性跳转到引导程序代码OpenVMS(TM)Alpha操作系统，版本V8.4-。\n正在安装所需的已知文件...。正在配置设备...%EWA0，控制台%EWA0设置的自动协商模式，链路状态：UP%EWA0，自动协商(内部)开始%EWA0，选择全双工100base TX连接。\n****您可以安装或升级OpenVMS Alpha操作系统，也可以安装或升级OpenVMS Alpha分发介质(CD/DVD)上包含的分层产品。您还可以执行DCL命令和过程来执行独立任务，如备份系统磁盘。请选择以下选项之一：1)升级、安装或重新配置OpenVMS Alpha版本V8.4-2L1 2)显示此过程可以安装的分层产品3)安装或升级分层产品4)显示已安装的产品5)重新配置已安装的产品6)删除已安装的产品7)查找、安装或撤消修补程序；显示或删除恢复数据8)执行DCL命令和过程9)关闭此系统输入选择或？寻求帮助：(1/2/3/4/5/6/7/8/9/？)。\nOpenVMS Alpha分发介质上提供了以下补丁包。-VSI AXPVMS TCPIP_NFS_PAT V5.7-ECO5A修补程序压缩VSI AXPVMS TCPIP_SSH_PAT V5.7-ECO5D修补程序压缩。发行说明和附函，以确定您的系统是否需要任何或所有这些补丁程序。按Return键继续...。\n按回车键，如上所述。系统将询问您是否要格式化磁盘：\n***此过程将询问一系列问题。()-附上可接受的答案[]-附上默认答案键入您的回答，然后按&lt；Return&gt；键。键入：？-重复解释^-更改先前的输入(并非总是可行)Ctrl/Y-要退出安装过程，有两种安装/升级选择：Initialize-删除目标磁盘上以前存在的所有软件和数据文件，并安装OpenVMS Alpha。保留--在目标磁盘上安装或升级OpenVMS Alpha，并保留目标磁盘的所有其他内容。*注意：您不能在安装了任何其他操作系统的磁盘上使用PERVERE安装OpenVMS Alpha。这包括其他体系结构的OpenVMS实现。是要初始化还是要保留？[保留]。\n您必须输入将安装OpenVMS Alpha的目标磁盘的设备名称。输入目标磁盘的设备名称：(？选择)？Device Device Error Volume Free Transans Mnt Name Status Count Label Block Count CntDQB0：mount wrtlck 0 ALPHA0842L1 936 81 1DQB1：Offline 1DVA0：Offline 0DQA0：Online 0DQA1：Offline 1DAD0：Online 0输入目标磁盘的设备名称：(？供选择)DQA0。\n如果要群集，则每个磁盘都必须有唯一的名称。我倾向于使用系统主机名作为系统盘名。在本教程中，只需按回车键即可获取默认设置：\n目标系统盘可以用盘上结构级别2(ODS-2)或级别5(ODS-5)进行初始化。(?。有关详细信息)您要使用ODS-2还是ODS-5进行初始化？(2/5/？)5。\nFiles-11是五个独立文件系统的总称，称为磁盘上结构(ODS)级别1到5。\nODS-1是RSX-11操作系统使用的平面文件系统，受较旧的VMS系统支持以实现RSX兼容性，但从未用于支持VMS本身；它在很大程度上已被ODS-2和ODS-5所取代。\nODS-2是标准的VMS文件系统，并且仍然是系统盘(安装操作系统的盘)最常用的文件系统。\n尽管ODS级别指定很少提及ODS-3和ODS-4，但ODS-3和ODS-4分别是对CD-ROM ISO 9660和High Sierra格式文件系统的Files-11支持。\nODS-5是Alpha和IA-64平台上提供的ODS-2的扩展版本，它增加了对使用非ASCII字符保留大小写的文件名的支持，并改进了分层目录支持。\n您已选择在新磁盘上安装OpenVMS Alpha。目标系统盘DQA0：将使用结构级别5(ODS-5)进行初始化。将启用硬链接。该磁盘将标记为ALPHASYS。目标系统磁盘上当前的所有数据都将丢失。这样可以吗？(是/否)是。\n输入系统用户的密码。由于这与Linux上的root帐户或Windows上的Administrator帐户相同，因此请使其成为一个好帐户。\n您必须输入系统帐户的密码。密码的长度必须至少为8个字符，并且不能超过31个字符。将进行检查和验证。系统不接受容易被猜到的密码。密码不会在您输入时显示。系统帐户密码：重新输入系统密码进行验证：\n此系统是否将成为OpenVMS群集的成员？(是/否)现在，此系统是否为OpenVMS Galaxy中的实例？(是/否)否。\n接下来是两个DECnet网络问题。首先是关于这个的更多信息，背景理论。因为我们将在未来的文章中建立一个集群，所以现在我们必须说明这一点。\n对于SCSNODE名称-主机名，如果您愿意的话-您必须记住只使用6个字符或更少。SCSSYSTEMID稍微复杂一些。它是通过公式X*1024+Y计算的，其中X是DECnet区域编号，Y是该区域中的DECnet节点编号。\n既然我们是从头开始，我们可以使用X=1；作为节点号，正确地考虑这一点是有意义的。有用提示：使用您想要分配给这台机器的IP地址的最后一个八位字节！因为我想把IPs10.0.2.131和10.0.2.132赋给节点，所以我会把这个设为Y=131，下一个设为Y=132。这给我们留下了这个安装的SCSSYSTEMID1155和DECnet代码1.131。稍后用于集群的另一个VM将获得1156SCSSYSTEMID1156AS SCSSYSTEMID1DECnet代码1.132。\n此节点将命名为U1，稍后将命名为U2上的第二个节点。为什么？因为它很短。\n要使系统正常运行，必须设置两个参数：SCSNODE和SCSSYSTEMID.SCSNODE可以是1到6个字母或数字。它必须至少包含一个字母。如果您计划使用DECnet，SCSNODE必须是DECnet阶段IV节点名或DECnet-Plus(阶段V)节点同义词。如果您有多个OpenVMS系统，则每个系统上的SCSNODE必须是唯一的。\n输入SCSNODE：u1如果您计划使用DECnet，则必须根据DECnet第四阶段地址设置SCSSYSTEMID。\n您是否计划使用DECnet？(是/否)[是]DECnet第四阶段地址的格式为DECnet_AREA_NUMBER。DECnet_NODE_NUMBER DECnet_AREA_NUMBER是一个介于1和63之间的数字。DECnet_NODE_NUMBER是介于1和1023之间的数字。如果您计划使用没有第四阶段兼容地址的DECnet，请输入0.0。\nSCSSYSTEMID将设置为1156。计算如下：(DECnet_Area_Numb。\n.", "note_en": "Skip to main content          In my  previous article I announced the fork of the  es40 emulator to  AXPboxby  Tomáš including bug fixes and rework allowing it to install OpenVMS 8.4 withoutproblems. Since then I&#39;ve contributed a few patches and doc updates, now NetBSD boots as well (the patches for netbsd were from other es40 forks). I&#39;ve also looked intogetting networking setup, since that is a bit of a tedious process due to pcap andlinux, pcap being used for network emulation. SIMH (among others,  a great VAX emulator)suffers from the same problems with networking. This guide will show you how to installAXPbox and get OpenVMS 8.4 ready and running with networking inside AXPbox. It&#39;s a ratherlong guide with a lot of information and output.\n   I do recommend you to read the  AXPbox wiki Installation Guide, in the future that mightbe more up to date on installing OpenVMS.\n   This guide is a big and comprehensive one, we cover a lot of ground. Use thetable of contents above to skip to a part you&#39;re interested in. The order oftopics is specifically so you can follow along. And if you&#39;re able, do contribute back to AXPbox, it&#39;s our only hope for an open source Alphaemulator.\n  I&#39;ll start off with a bit about networking. It took me a long time and  helpfrom Tomas to figure out what was happening and why. A short summary isthat AXPbox uses  libpcap to emulate networking. On Linux, packets made byaxpbox, are not received by the host system. That means, that if you runAXPbox on your desktop, your desktop will not be able to communicate withAXPbox, but other systems on the network will be. This issue can be resolvedby using 2 network interfaces on your host system (one for axpbox and one forregular networking) or by a virtualbox setup which we&#39;ll explain further.\n This  issue is documented by SIMH, they have the same setup for networking(although, simh also support tun/tap and vde, which do not suffer from thisproblem).\n  On Windows using the WinPcap interface, the simulated computer can &#34;talk&#34; tothe host computer on the same interface. On other platforms with libpcap(linux, mac OS), the simulated computer can not &#34;talk&#34; to the host computer via theselected interface, since simulator transmitted packets are not receivedby the hosts network stack. The workaround for this is to use a second NICin the host and connect them both into the same network; then the host andthe simulator can communicate over the physical LAN.\n  2.11 - My Linux, OSX or other Unix host can&#39;t communicate with the PDP-11 orVAX over Ethernet; why?\n The network stacks on these systems don&#39;t naturally receive packets which are transmitted with the pcap_sendpacket API...\n I also had issues with bridged network adapters. I&#39;m used to creating a bridgefor when using KVM virtual machines, and giving each VM it&#39;s own  tapXinterface, they can access the network directly that way.\n Because of the above, if you want to use networking (which you probably will,it&#39;s awesome to play with clustering) and have only 1 NIC in your PC, Irecommend you use a virtual machine with two separate network adapters. Inthis guide I&#39;m using Ubuntu 20.04 on my desktop, which runs Virtualbox (Ichoose that over KVM for ease of use in this guide).\n Virtualbox has a Debian 10 virtual machine with 2 virtual network adapters,the first is in the virtualbox  NAT network, that one will be used by OpenVMS,the second is bridged into my own LAN, that one is used to SSH into the DebianVM from Ubuntu.\n This Debian 10 virtual machine runs AXPbox, so it&#39;s a bit of virtual machine inception going on. Have your spinning top ready.\n OpenVMS inside AXPbox can connect to the internet, and via virtualbox you can create port forwards back into OpenVMS. That will be explained lateron in the network section, including screenshots.\n I had issues with 2 bridges interfaces, OpenVMS couldn&#39;t connectto my router and my host PC couldn&#39;t connect to OpenVMS, but Tomas has had that setup working with KVM, so that might work, but for the sake of a reproducibletutorial, I&#39;ll be focusing on this Virtualbox  NAT setup.\n When I plugged in a USB NIC adapter and configured AXPbox to use that,connectivity worked as expected. If you have multiple separate networkcards in your PC, you don&#39;t need the VM setup.\n **Summarizing, install Virtualbox, install a Debian 10 VM with 2 NIC&#39;s, one NAT and one Bridged, or use multiple NIC&#39;s in your PC..\n If you&#39;re comfortable with KVM you can do that as well, the network setup should be easy enough with the theory and explanation above.\n  Currently there is only one legal option to get OpenVMS installation media,the  VSI Community License program. Fill out the form there and you&#39;llget an e-mail with login credentials to the VSI SFTP server.\n Login in to the SFTP server and download the file named  ALPHA0842L1.ZIPEXE. This is a self-extracting archive for OpenVMS Alpha, but it can be extractednormally using  unzip or an archive manager on any operating system. Afterunzipping you should have the file  ALPHA0842L1.ISO.\n $ unzip ALPHA0842L1.ZIPEXE Archive: ALPHA0842L1.ZIPEXEwarning [ALPHA0842L1.ZIPEXE]: 120320 extra bytes at beginning or within zipfile (attempting to process anyway) inflating: ALPHA0842L1.ISO $ md5sum ALPHA0842L1.ISO e19f1123bdb565d9f9bb736be5314c46 ALPHA0842L1.ISO$ md5sum ALPHA0842L1.ZIPEXE 2228fc25d9640a16a57bada6d8c609ec ALPHA0842L1.ZIPEXE\n You will also receive an email containing your license, PAK files. Save that as well.\n  Alternatively you can use  ALPHA084.ISO from the now concluded HPE OpenVMS Hobbyist Program. You do need a different license PAK though, from HPE, andyou need to set the date inside the Debian virtual machine to back when your HPE hobbyist license was still valid. For hobbyist use, it will workfine inside AXPbox.\n Here is a site hosting that HP ISO and  here is another one, but I&#39;m not sure how long those will stay alive. Google the filename or resort toless legal internet protocols to get a copy of this ISO.\n        I&#39;ll assume you do these steps inside the Debian 10 virtual machine you&#39;ve setup. Theywork the same for Ubuntu 20.04.\n            -- pcap found. Networking support enabled-- sdl found. SDL graphics support enabled-- x11 found. x11 graphics support enabled-- C++ compiler flags : -O3 -march=native -DNDEBUG-- C compiler flags : -O3-- Linker flags : -- Configuring done-- Generating done-- Build files have been written to: /root/git/axpbox/buildScanning dependencies of target axpbox[ 1%] Building CXX object CMakeFiles/axpbox.dir/src/AliM1543C.cpp.o[ 3%] Building CXX object CMakeFiles/axpbox.dir/src/AliM1543C_ide.cpp.o[ 4%] Building CXX object CMakeFiles/axpbox.dir/src/AliM1543C_usb.cpp.o[...][ 95%] Building CXX object CMakeFiles/axpbox.dir/src/gui/scancodes.cpp.o[ 96%] Building CXX object CMakeFiles/axpbox.dir/src/gui/sdl.cpp.o[ 98%] Building CXX object CMakeFiles/axpbox.dir/src/lockstep.cpp.o[100%] Linking CXX executable axpbox[100%] Built target axpbox\n      If you have your PAK from VSI (product activation key) with the hobbyistlicense, it&#39;s handy to build an ISO and later on after the installation,mount that and run the  ALPHA_COMMUNITY_LICENSE_PAK_XX_XXXX.COM script onOpenVMS, than it is to copy and paste. Not all terminal emulators handle itwell (too fast) and with the HP license, it&#39;s way to long to copy and paste.The VSI license seems shorter.\n  # create a folder for the scriptmkdir license# copy the license script into that foldercp ALPHA_COMMUNITY_LICENSE_PAK_SEP_2020.COM license# generate an ISO of that foldergenisoimage -V license -o pak.iso license\n  Total translation table size: 0Total rockridge attributes bytes: 0Total directory bytes: 0Path table size(bytes): 10Max brk space used 0175 extents written (0 MB)\n Later on when we&#39;re finished installing OpenVMS we&#39;ll activate this licensefrom the ISO.  Read more on OpenVMS scripts, ISO and record format here\n  Summarized, the SRM rom is sort of a BIOS, but for Alpha and OpenVMS requiresthis to boot. It was available from HP, but not anymore, so I mirrored it.Create a rom folder and download the file there:\n   The abbreviation SRM is derived from the Alpha System Reference Manual, thespecification of the Alpha architecture and the associated firmware.\n PALcode is a name assigned to a particular set of functions provided by theSRM firmware. PALcode is used to provide low-level functions required byhigher-level operating system or application software, functions which may notbe directly available in Alpha hardware. PALcode is implemented usingavailable Alpha instructions and using the Alpha processor, though PALcodeoperates in a mode which simplifies programming. PALcode is also permittedaccess to processor-specific and otherwise internal features of a particularAlpha microprocessor implementation; microprocessor-specific features whichare not easily accessible to operating system or application code.\n We&#39;re almost ready to install OpenVMS. After compiling and preparing, all thatis left is configuring AXPbox.\n  AXPbox has an interactive configuration prompt which you can invoke with ./axpbox configure. It will ask you a set of questions, and you can readmore about it  on the project wiki. For the purpose of this guide, pleaseuse the below configuration.\n Place the below contents in a file named  es40.cfg in the same folder as the binary.\n sys0 = tsunami{ memory.bits = 28; rom.srm = &#34;rom/cl67srmrom.exe&#34;; rom.decompressed = &#34;rom/decompressed.rom&#34;; rom.flash = &#34;rom/flash.rom&#34;; rom.dpr = &#34;rom/dpr.rom&#34;; cpu0 = ev68cb { speed = 800M; icache = true; } serial0 = serial { port = 21264; action = &#34;&#34;; } pci0.15 = ali_ide { disk0.0 = file { file = &#34;disk0.img&#34;; serial_number = &#34;VMS&#34;; rev_number = &#34;8.4&#34;; model_number = &#34;OpenVMS8.3&#34;; read_only = false; cdrom = false; autocreate_size = 6000M; } disk1.0 = file { file = &#34;ALPHA0842L1.ISO&#34;; read_only = true; cdrom = true; } }pci1.1 = dec21143 { adapter = &#34;enp0s3&#34;; mac = &#34;08-00-DE-AD-BE-EF&#34;;} pci0.7 = ali { mouse.enabled = false; vga_console = false; } pci0.19 = ali_usb { }}\n Change the  adapter = &#34;enp0s3&#34; line to match your virtualbox NAT adapter.That is, not the NIC with the IP of the Debian VM you&#39;re connecting to, butthe one with the internal Virtualbox network. In my case  enp0s8 is thebridged adapter and  enp0s3 is the NAT adapter.\n Make sure the  ALPHA0842L1.ISO installation ISO is in the same folder as thebinary and this config file. If you forget to place that file, you&#39;ll get acrash:\n pci0.15(ali_ide).disk1.0(file): Could not open file ALPHA0842L1.ISO!Emulator Failure: Runtime exception: pci0.15(ali_ide).disk1.0(file): Filedoes not exist and no autocreate_size set:/root/git/axpbox/src/DiskFile.cpp, line 124 Segmentation fault\n I have my setup with 1800MHz  cpu.speed and 30  memory.bits (1 GB instead of256MB). For this guide I&#39;ll recommend the defaults (800MHz and 256MB).\n If you want to skip the memory test at startup (saves a few minutes ofbooting), add the following underneath the  icache line in the  cpu block:\n  Do note that this will make the installation of OpenVMS fail, so add the lineafter you&#39;re done installing.\n  pci0.15(ali_ide).disk0.0(file): Could not open file disk0.img!pci0.15(ali_ide).disk0.0(file): writing 6000 1kB blocks: 100%pci0.15(ali_ide).disk0.0(file): 6000 MB file disk0.img created.pci0.15(ali_ide).disk0.0(file): Mounted file disk0.img, 12288000 512-byteblocks, 15360/16/50.\n   If everything is setup correctly, the emulator should prompt you to connect toa telnet port:\n    Connect to the telnet port as specified by the emulator prompt (replace 10.0.0.8 by the IP of your Debian VM).\n $ telnet 10.0.0.8 21264Trying 10.0.0.8...Connected to 10.0.0.8.Escape character is &#39;^]&#39;.This is serial port #0 on ES40 EmulatorOpenVMS PALcode V1.98-104, Tru64 UNIX PALcode V1.92-105starting console on CPU 0[...] 256 MB of System MemoryTesting the SystemTesting the NetworkAlphaServer ES40 Console V7.3-1, built on Feb 27 2007 at 12:57:47P00&gt;&gt;&gt;\n If you see the  P00&gt;&gt;&gt; prompt, continue on. If you get a crash, disconnect orsegfault, check the emulator tab, it has an error what is wrong.\n     In our case,  DQB0 has the install disk and  DQA0 is our root disk. Boot theinstall ISO:\n   (boot dqb0.0.1.15.0 -flags 0)block 0 of dqb0.0.1.15.0 is a valid boot blockreading 1230 blocks from dqb0.0.1.15.0bootstrap code read inbase = 200000, image_start = 0, image_bytes = 99c00(629760)initializing HWRPB at 2000initializing page table at ff56000initializing machine statesetting affinity to the primary CPUjumping to bootstrap code OpenVMS (TM) Alpha Operating System, Version V8.4-2L1 Copyright 2016 VMS Software, Inc.\n  Installing required known files... Configuring devices...%EWA0, Auto-negotiation mode set by console%EWA0, Link state: UP%EWA0, Auto-negotiation (internal) starting%EWA0, Full Duplex 100baseTX connection selected\n  **************************************************************** You can install or upgrade the OpenVMS ALPHA operating system or you can install or upgrade layered products that are included on the OpenVMS ALPHA distribution media (CD/DVD). You can also execute DCL commands and procedures to perform &#34;standalone&#34; tasks, such as backing up the system disk. Please choose one of the following: 1) Upgrade, install or reconfigure OpenVMS ALPHA Version V8.4-2L1 2) Display layered products that this procedure can install 3) Install or upgrade layered products 4) Show installed products 5) Reconfigure installed products 6) Remove installed products 7) Find, Install or Undo patches; Show or Delete Recovery Data 8) Execute DCL commands and procedures 9) Shut down this systemEnter CHOICE or ? for help: (1/2/3/4/5/6/7/8/9/?)\n   The following PATCH kits are present on the OpenVMS ALPHA distribution media.----------------------------------- ----------- ----------PRODUCT KIT TYPE KIT FORMAT----------------------------------- ----------- ----------VSI AXPVMS TCPIP_NFS_PAT V5.7-ECO5A Patch Compressed VSI AXPVMS TCPIP_SSH_PAT V5.7-ECO5D Patch Compressed ----------------------------------- ----------- ----------2 products found Please consult the OpenVMS ALPHA Installation and Upgrade Manual, the Release Notes, and the Cover Letter to determine if any or all of these patches may be required for your system.Press Return to continue...\n Press return as said. You will be asked if you want to format the disk:\n *********************************************************** This procedure will ask a series of questions. () - encloses acceptable answers [] - encloses default answers Type your response and press the &lt;Return&gt; key. Type: ? - to repeat an explanation ^ - to change prior input (not always possible) Ctrl/Y - to exit the installation procedure There are two choices for installation/upgrade: Initialize - Removes all software and data files that were previously on the target disk and installs OpenVMS ALPHA. Preserve -- Installs or Upgrades OpenVMS ALPHA on the target disk and retains all other contents of the target disk. * Note: You cannot use preserve to install OpenVMS ALPHA on a disk on which any other operating system is installed. This includes implementations of OpenVMS for other architectures.Do you want to INITIALIZE or to PRESERVE? [PRESERVE]\n   You must enter the device name for the target disk on which OpenVMS ALPHA will be installed.Enter device name for target disk: (? for choices) ? Device Device Error Volume Free Trans Mnt Name Status Count Label Blocks Count CntDQB0: Mounted wrtlck 0 ALPHA0842L1 936 81 1DQB1: Offline 1DVA0: Offline 0DQA0: Online 0DQA1: Offline 1DAD0: Online 0Enter device name for target disk: (? for choices) DQA0\n  If you&#39;re going to cluster, every disk must have a unique name. I tend to gowith the system hostname as system disk name. In this tutorial, it&#39;s fine tojust press Return for the default:\n   The target system disk can be initialized with On-Disk StructureLevel 2 (ODS-2) or Level 5 (ODS-5). (? for more information)Do you want to initialize with ODS-2 or ODS-5? (2/5/?) 5\n   Files-11 is the general term for five separate file systems, known as on-disk &#34;structure (ODS) levels 1 through 5.\n ODS-1 is the flat file system used by the RSX-11 OS, supported by older VMS systems for RSX compatibility, but never used to support VMS itself; it has been largely superseded by ODS-2 and ODS-5.\n ODS-2 is the standard VMS file system, and remains the most common file system for system disks (the disk on which the operating system is installed).\n Although seldom referred to by their ODS level designations, ODS-3 and ODS-4 are the Files-11 support for the CD-ROM ISO 9660 and High Sierra Format file systems, respectively.\n ODS-5 is an extended version of ODS-2 available on Alpha and IA-64 platforms which adds support for case-preserving filenames with non-ASCII characters and improvements to the hierarchical directory support.\n     You have chosen to install OpenVMS ALPHA on a new disk. The target system disk, DQA0:, will be initialized with structure level 5 (ODS-5). Hard links WILL be enabled. The disk will be labeled ALPHASYS. Any data currently on the target system disk will be lost.Is this OK? (Yes/No) yes\n   Enter a password for the  SYSTEM user. Make it a good one since this is the same as the  root account on linux, or  Administrator on Windows.\n You must enter a password for the SYSTEM account.The password must be a minimum of 8 characters in length, andmay not exceed 31 characters. It will be checked and verified.The system will not accept passwords that can be guessed easily.The password will not be displayed as you enter it.Password for SYSTEM account: Re-enter SYSTEM password for verification:\n   Will this system be a member of an OpenVMS Cluster? (Yes/No) NoWill this system be an instance in an OpenVMS Galaxy? (Yes/No) No\n Next are two DECnet networking questions. First some more information on this,background theory. Because we&#39;re setting up a cluster in a future article, wemust account for that now.\n For the  SCSNODE name - the hostname, if you will - you&#39;ll have to rememberto use only 6 characters or less. The  SCSSYSTEMID is a bit more complex.It&#39;s calculated through the formula  X * 1024 + Y, where  X is the  DECnetarea number, and  Y the  DECnet node number in that area.\n Since we&#39;re starting from scratch, we can use  X=1; for the node numbers, itmakes sense to think this through properly. Useful tip: use the last octet ofthe IP address you want to assign to this machine! Since I want to give IPs10.0.2.131 and 10.0.2.132 to the nodes, I&#39;ll give this one  Y=131 and thenext one  Y=132. This leaves us with a  SCSSYSTEMID of  1155 for thisinstall, and DECnet code  1.131. The other VM, later on for clustering, willget  1156 as  SCSSYSTEMID and DECnet code  1.132.\n This node will be named  u1 and the second node later on  u2. Why? Becauseit&#39;s short.\n For your system to operate properly, you must set two parameters:SCSNODE and SCSSYSTEMID.SCSNODE can be from 1 to 6 letters or numbers. It must contain atleast one letter.If you plan to use DECnet, SCSNODE must be the DECnet Phase IVnode name, or the DECnet-Plus (Phase V) node synonym.If you have multiple OpenVMS systems, the SCSNODE on each systemmust be unique.\n  Enter SCSNODE: u1If you plan to use DECnet, SCSSYSTEMID must be set based on theDECnet Phase IV address.\n  Do you plan to use DECnet? (Yes/No) [Yes] DECnet Phase IV addresses are in the format DECnet_area_number.DECnet_node_number DECnet_area_number is a number between 1 and 63. DECnet_node_number is a number between 1 and 1023. If you plan to use DECnet WITHOUT Phase IV compatible addresses, enter 0.0.\n    SCSSYSTEMID will be set to 1156. This was calculated as follows: (DECnet_area_numb\n......", "posttime": "2020-11-05 04:18:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安装,axpbox", "title": "在带联网功能的AXPbox中安装OpenVMS 8.4 Alpha", "title_en": "Installing OpenVMS 8.4 Alpha inside AXPbox with networking", "transed": 1, "url": "https://raymii.org/s/tutorials/Installing_OpenVMS_8.4_Alpha_in_AXPbox_with_networking.html", "via": "", "real_tags": ["安装", "axpbox"]}]