[{"category": "", "categoryclass": "", "imagename": "cd1493eea10064f0fbb8cd3dbff4e0e7.jpg", "infoid": 1010535, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，这家初创公司宣布了一笔700万美元的投资，由翼风险投资公司牵头，运营商Collective和Team8提供帮助。根据交易条款，运营商的莱拉·塞卡(Leyla Seka)将加入董事会。据该公司称，今天的投资使总募集资金达到1100万美元。\n首席执行官兼联合创始人哈盖·利维(Haggai Levi)表示，他的公司基于这样的理念，即单靠佣金并不是衡量销售成功的好方法，而且实际上是一个滞后的指标。“我们想出了一种不同的方法。我们使用机器学习来创建基于进度的激励机制，“Levi解释说。\n要做到这一点，他们依靠机器学习来发现来自客户的信号，这些信号表明交易正在推进，使用积分系统，公司甚至可以在销售结束之前，就开始对达到这些里程碑的代表进行补偿。\nSetSail背后的想法的种子是几年前播下的，当时三位创始人正在谷歌工作，研究如何在纯佣金之外激励销售代表。从行为的角度来看，利维和他的联合创始人发现，采用纯粹的佣金方式，代表们承担的风险更小，他们希望找到一种方法来改变这一点。递增的薪酬体系实现了这一点。\n“如果我能成交，我就能拿到佣金。如果我不成交，我什么都得不到。这意味着从行为的角度来看，我会选择最短的途径来赢得一笔交易，我会尽可能地承担最小的风险。因此，如果出现竞争局面，我会尽量避免这种情况。“他说。\n他们查看约会、电子邮件和通话记录等内容。信号将因客户而异。人们可能会发现，与首席信息官的约会是交易走在正确轨道上的一个很好的信号，但为了避免代表通过向CRM灌输公司正在寻找的积极信号来操纵系统，他们只依赖客观数据，而不是代表自己提供的任何形式的自我报告信息。\n该团队最终在谷歌内部建立了一个这样的系统，并在2018年离开，为世界其他地方建立了一个做类似事情的解决方案。\n利维说，随着公司的发展，他正在建立一个多元化的团队，不仅因为这是正确的做法，而且因为这完全是有商业意义的。他解释说：“现实情况是，我们正在为不同的受众打造一款产品，如果我们没有一个多元化的团队，我们将永远无法打造出合适的产品。”\n该公司在销售薪酬方面的独特做法引起了Dropbox、Lyft和Pendo等客户的共鸣，他们正在寻找新的方式来激励销售团队，特别是在大流行期间，因为可能会有更长的销售周期。这种系统提供了一种更递增地补偿销售团队的方式，并奖励已证明能带来销售的积极方法。", "note_en": "Today, the startup announced a $7 million investment led by  Wing Venture Capital   with help from Operator Collective and Team8. Under the terms of the deal, Leyla Seka from Operator will be joining the board. Today’s investment brings the total raised to $11 million, according to the company.\n CEO and co-founder Haggai Levi says his company is based on the idea that commission alone is not a good way to measure sales success, and that it is in fact a lagging indicator. “We came up with a different approach. We use machine learning to create progress-based incentives,” Levi explained\n  To do that they rely on machine learning to discover the signals that are coming from the customer that indicate that the deal is moving forward, and using a points system, companies can begin compensating reps on hitting these milestones, even before the sale closes.\n The seeds for the idea behind  SetSail   were planted years ago when the three founders were working at Google tinkering with ways to motivate sales reps beyond pure commission. From a behavioral perspective, Levi and his co-founders found that reps were taking fewer risks with a pure commission approach and they wanted to find a way to change that. The incremental compensation system achieves that.\n “If I’m closing the deal, I’m getting my commission. If I’m not closing the deal, I’m getting nothing. That means from a behavioral point of view, I would take the shortest path to win a deal, and I would take the minimum risk possible. So if there’s a competitive situation I will try to avoid that,” he said.\n They look at things like appointments, emails and call transcripts. The signals will vary by customer. One may find an appointment with CIO is a good signal a deal is on the right trajectory, but to avoid having reps gaming the system by filling the CRM with the kinds of positive signals the company is looking for, they only rely on objective data, rather than any kind of self-reporting information from reps themselves.\n The team eventually built a system like this inside Google, and in 2018, left to build a solution for the rest of the world that does something similar.\n As the company grows, Levi says he is building a diverse team, not only because it’s the right thing to do, but because it simply makes good business sense. “The reality is that we’re building a product for a diverse audience, and if we don’t have a diverse team we would never be able to build the right product,” he explained.\n The company’s unique approach to sales compensation is resonating with customers like Dropbox, Lyft and Pendo, who are looking for new ways to motivate sales teams, especially during a pandemic when there may be a longer sales cycle. This kind of system provides a way to compensate sales teams more incrementally and reward positive approaches that have proven to result in sales.", "posttime": "2020-07-08 21:03:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "销售,sales", "title": "\nSetSail筹集700万美元以改变销售团队的薪酬方式", "title_en": "\n\t\t\t\tSetSail raises raises $7M to change how sales teams are compensated\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/setsail-raises-raises-7m-to-change-how-sales-teams-are-compensated/", "via": "", "real_tags": ["销售", "sales"]}, {"category": "", "categoryclass": "", "imagename": "dacd16323f6700246687712f234f16c2.jpg", "infoid": 1010534, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两家公司没有透露收购价格，但Rancher资金充裕，共投资9,500万美元。值得一提的是，距离该公司宣布由澳洲电信风险投资(Telstra Ventures)牵头的4000万美元D系列融资只有几个月的时间。其他投资者包括梅菲尔德(Mayfield)和Nexus Venture Partners、GRC SinoGreen和F&amp；G Ventures等。\n与类似的公司一样，Rancher最初的关注点是Docker基础设施，一旦Kubernetes成为集装箱编排的事实标准，它就会将重点转向Kubernetes。不出所料，这也是SUSE现在收购这家公司的原因。在经历了几次起伏和各种所有权变动之后，SUSE现在又找到了立足点，今天的收购表明，它的目标是利用目前的优势。\n就在上个月，该公司报告称，其预订的年度合同价值同比增长了30%，上个季度价值超过100万美元的客户交易增长了63%，云收入增长了70%。虽然该公司仍在从事Linux发行业务，但今天的SUSE是一家非常不同的公司，提供各种企业平台(包括其基于Cloud Foundry的云应用平台)、解决方案和服务。虽然它已经提供了一个基于Kubernetes的集装箱平台，但Rancher的专业知识只会帮助它建立这项业务。\n“对于我们的行业来说，这是一个难以置信的时刻，因为两家开源领军企业正在联手。SUSE首席执行官Melissa Di Donato在今天的声明中表示：“Enterprise Linux、边缘计算和人工智能领域的领先者与Enterprise Kubernetes Management的领先者合并，将扰乱市场，帮助客户加快数字化转型之旅。只有SUSE和Rancher的结合才能拥有全球支持的100%真正的开源产品组合的深度，包括云原生技术，以帮助我们的客户从边缘到核心再到云，在其业务范围内进行无缝创新。“。\n该公司将今天的收购描述为其‘无机增长战略’的第一步，Di Donato指出，此次收购将使公司“在渴望提供更好客户体验的云服务提供商、独立硬件供应商、系统集成商和增值转售商方面发挥更具战略意义的作用。”", "note_en": "The two companies did not disclose the price of the acquisition, but Rancher was well funded, with a total of $95 million in investments. It’s also worth mentioning that it’s only been a few months since the company  announced its $40 million Series D round led by Telstra Ventures. Other investors include the likes of Mayfield and Nexus Venture Partners, GRC SinoGreen and F&amp;G Ventures.\n Like similar companies, Rancher’s original focus was first on Docker infrastructure before it pivoted to putting its emphasis on  Kubernetes   once that became the de facto standard for container orchestration. Unsurprisingly, this is also why  SUSE   is now acquiring this company. After a number of ups and downs — and various ownership changes — SUSE has now found its footing again and today’s acquisition shows that its aiming to capitalize on its current strengths.\n  Just last month, the company reported that the annual contract value of its booking increased by 30% year over year and that it saw a 63% increase in customer deals worth more than $1 million in the last quarter, with its cloud revenue growing 70%. While it is still in the Linux distribution business that the company was founded on, today’s  SUSE   is a very different company, offering various enterprise platforms (including its  Cloud Foundry-based Cloud Application Platform), solutions and services. And while it already offered a Kubernetes-based container platform, Rancher’s expertise will only help it to build out this business.\n “This is an incredible moment for our industry, as two open source leaders are joining forces. The merger of a leader in Enterprise Linux, Edge Computing and AI with a leader in Enterprise Kubernetes Management will disrupt the market to help customers accelerate their digital transformation journeys,” said  SUSE CEO Melissa Di Donato in today’s announcement. “Only the combination of  SUSE and Rancher will have the depth of a globally supported and 100% true open source portfolio, including cloud native technologies, to help our customers seamlessly innovate across their business from the edge to the core to the cloud.”\n The company describes today’s acquisition as the first step in its ‘inorganic growth strategy’ and Di Donato notes that this acquisition will allow the company to “play an even more strategic role with cloud service providers, independent hardware vendors, systems integrators and value-added resellers who are eager to provide greater customer experiences.”", "posttime": "2020-07-08 21:03:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,acquires", "title": "\nSUSE收购Kubernetes管理平台Rancher Labs", "title_en": "\n\t\t\t\tSUSE acquires Kubernetes management platform Rancher Labs\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/suse-acquires-kubernetes-management-platform-rancher-labs/", "via": "", "real_tags": ["收购", "acquires"]}, {"category": "", "categoryclass": "", "imagename": "90664e6d4d9acf8412d277eeeb377f09.jpg", "infoid": 1010533, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "母公司Match最初承诺，将在Tinder引入视频聊天，作为其2020年第一季度收益报告的一部分，并吹捧这一功能是Tinder在面对冠状病毒大流行时发展业务的一种方式。该公司随后还详细说明了疫情对其应用程序的影响，随着社交距离要求和政府封锁的生效，Tinder用户在本季度的增长放缓。\n截至第一季度，Tinder拥有600万订户，高于2019年12月的590万-这意味着该季度仅增加了10万付费订户。相比之下，在去年同期，它增加了38.4万付费用户。Tinder的每用户平均收入(ARPU)也只增长了2%，主要是因为购买了点菜功能，而不是订阅。\nTinder表示，在新冠肺炎疫情爆发之前，它曾在不同时间测试过视频，但表示从未见过大量采用。然而，大流行改变了情况。如今，Tinder允许用户通过其Passport功能在全球范围内搜索匹配对象，使其约会应用程序更像是一个社交网络。与此同时，确实想约会的Tinder用户现在感觉几乎被迫在早期互动中使用视频，而不是像以前那样进行更简短的“了解你”的咖啡或饮料约会。\n如果应用程序中没有视频选项，这些用户通常会求助于Snapchat等第三方应用程序或其他视频聊天应用程序来进行早期连接。与此同时，优先选择视频选项的约会对象甚至可能已经转向了竞争对手Bumble，后者提供视频已有一年之久。Facebook最近还表示，由于冠状病毒的流行，它将为Facebook约会用户添加视频，迫使Tinder出手。\n新功能本身使用起来很简单。一旦两个人配对并在应用程序中聊天，他们就可以通过点击新的视频图标来表示他们已经准备好进入视频会话。聪明的地方在于，只有在两个匹配项都选择加入时，才会启用该功能本身。该公司指出，如果匹配切换到视频聊天功能，Tinder用户将不会得到通知。我们的想法是等到讨论自然而然地出现，就像在基于文本的聊天中经常做的那样。\n当两个用户都切换了视频聊天时，他们必须同意聊天开始前的基本规则。Tinder说，通话应该保持“PG”，没有裸露或色情内容。聊天也应该保持“干净”，这意味着没有骚扰、仇恨言论、暴力或其他非法活动。用户还同意通话需要与年龄相适应，这意味着没有未成年人参与。\n这项被Tinder称为“面对面”的功能是在逐场比赛的基础上启用的，并不是所有的比赛都是通用的。\nTinder到底计划如何适当地缓和这个看起来很棒的新征集平台，目前还不太清楚。此外，Tinder拥抱视频的举措意味着它可能会将性犯罪者推向镜头前。正如ProPublica去年的一份调查报告所发现的那样，包括Tinder在内的大多数配对拥有的约会应用程序都没有筛查性掠夺者。\n在弹出窗口中，完成视频通话的用户将被问及是否会再次面对面。在这里，如果需要，他们还可以选择报告用户。当然，这种追溯评级系统对任何目前感到不安全的人都没有太大帮助，目前也不清楚Tinder会在多大程度上介入正在进行的警方电话。\n当被问及细节时，Tinder拒绝透露。(在早些时候的一份报告中，Tinder首席执行官埃利·塞德曼建议Tinder将使用机器学习模型来监控聊天。)。\n同样不清楚的是，Tinder会在多大程度上介入，以阻止原本可能是双方自愿的性行为，包括付费品种的性行为。\n然而，Tinder似乎并不担心这些脱离品牌的视频聊天用例。该公司表示，最近对美国约5000名会员进行了调查，其中约一半人在过去一个月里已经在其平台上进行了视频约会，这表明他们愿意尝试视频进行在线约会。此外，40%的Z世代成员表示，即使餐馆和酒吧等场所重新开业，他们也希望在同意在现实生活中见面之前，继续使用视频作为第一步。\nTinder信任与安全产品主管罗里·科佐尔(Rory Kozoll)在一份关于此次发布的声明中表示：“面对面的联系比以往任何时候都更加重要，我们的视频聊天功能代表了一种新的方式，让人们无论物理距离如何，都可以在应用程序内相互了解。”“面对面优先控制，帮助我们的会员在他们觉得合适的时候，在聊天中采取下一步行动时感到更自在。我们已经建立了坚实的基础，并期待着在未来几周内从这次测试中学习。“科佐尔补充道。", "note_en": "Parent company Match had first promised it would introduce video chat in Tinder as part of its  Q1 2020 earnings report and touted the feature as a way Tinder was evolving its business in the face of the coronavirus pandemic. The company had also then detailed the pandemic’s impact on its app, which had slowed Tinder user growth in the quarter as social distancing requirements and government lockdowns went into effect.\n Tinder ended Q1 with 6 million subscribers, up from 5.9 million in December 2019 — meaning it only added 100,000 paid subscribers during the quarter. For comparison, in the year-ago quarter  it added 384,000 paid users. Tinder’s average revenue per user (ARPU) also grew just 2%, mainly due to purchases of à la carte features, not subscriptions.\n  Tinder says it had tested video at various times before the COVID-19 outbreak, but said it never saw significant adoption. The pandemic has changed things, however. Today, Tinder allows users to search for matches worldwide through its Passport feature, making its dating app more of a social network. Meanwhile, Tinder users who do want to date now feel almost forced to use video for their early interactions instead of going on briefer “getting to know you” coffee or drink dates, as before.\n Without a video option in the app, these users often turned to third-party apps like Snapchat or other video chat apps for these early connections. Meanwhile, daters who prioritized a video option may have even made the switch to rival Bumble, which has  offered video for a year. Facebook also recently said it would  add video for its Facebook Dating users, as a result of the coronavirus pandemic, forcing Tinder’s hand.\n  The new feature itself is simple to use. Once two people have matched and are chatting in the app, they can indicate they’re ready to move to a video session by tapping the new video icon. The clever part is that the feature itself isn’t enabled until both matches opt in. The company notes that Tinder users won’t be informed if a match toggles on the video chat feature. The idea is to wait until the discussion comes up naturally, as it often does in a text-based chat.\n When both users have toggled on video chat, they have to agree to ground rules before the chat begins. Tinder says calls should remain “PG,” with no nudity or sexual content. The chats are also supposed to stay “clean,” meaning no harassment, hate speech, violence or other illegal activities. Users also agree calls will need to be age-appropriate, meaning without minors involved.\n The feature, which Tinder calls “Face to Face,” is enabled on a match-by-match basis, not universally for all matches.\n How exactly Tinder plans to properly moderate what appears to be a fantastic new solicitation platform remains less clear. In addition, Tinder’s move to embrace video means it could be putting sex offenders in front of the camera.  As an investigative report last year from ProPublica found, most of the Match-owned dating apps, including Tinder, were not screening for sexual predators.\n  In a pop-up, users who finish a video call will be asked whether they would go Face to Face again. Here, they’ll also have the option to report the user, if needed. These sorts of retroactive rating systems don’t do much for anyone who feels unsafe in the moment, of course, and it’s not clear to what extent Tinder will step in to police calls in progress.\n Asked for specifics, Tinder declined to share. (In an earlier  report, Tinder CEO Elie Seidman suggested Tinder would use machine learning models to monitor chats.)\n Also unclear is to what extent Tinder would step into to stop what may otherwise be consensual sexual activity, including of the paid variety.\n Tinder doesn’t seem worried about these off-brand use cases for video chat, however. It says it recently surveyed around 5,000 members in the U.S. and around half of them have already had video dates with a match off its platform over the past month, indicating a willingness to try video for online dating. In addition, 40% of Gen Z members said they wanted to keep using video as an initial step before agreeing to meet in real life, even when places like restaurants and bars were re-opened.\n “Connecting face-to-face is more important than ever, and our video chat feature represents a new way for people to get to know one another in-app no matter their physical distance,” said Rory Kozoll, head of Trust and Safety Products at Tinder, in a statement about the launch. “Face to Face prioritizes control to help our members feel more comfortable taking this next step in chats if and when it feels right for them. We’ve built a solid foundation, and look forward to learning from this test over the coming weeks,” Kozoll added.", "posttime": "2020-07-08 21:02:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,目前,testing,视频", "title": "\nTinder目前在选定的市场测试视频聊天，包括美国", "title_en": "\n\t\t\t\tTinder now testing video chat in select markets, including U.S.\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/tinder-now-testing-video-chat-in-select-markets-including-u-s/", "via": "", "real_tags": ["美国", "目前", "testing", "视频"]}, {"category": "", "categoryclass": "", "imagename": "c7bbd122c16ae98699ddc6184666df0d.jpg", "infoid": 1010532, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一切都始于一项被拒绝的拨款提案。杜克大学(Duke University)神经学家艾哈迈德·哈里里(Ahmad Hariri)对结合基因测试和心理评估使用所谓的任务功能磁共振成像感兴趣。所谓任务功能磁共振成像是指受试者在接受大脑扫描的同时执行专门设计的认知任务。我们的目标是确定人们处理思想和情绪的方式差异的特定生物标记物，这些差异可能决定给定的受试者在未来更有可能或更少地经历抑郁、焦虑或与年龄相关的认知下降，如痴呆症。\n哈里里告诉“每日邮报”，我们的想法是收集一次这些数据，然后再收集一次，然后能够跟踪一个人随着时间的推移大脑的变化，以帮助我们了解他们一生中发生了什么变化。因此，他提交了一份资金提案，概述了他沿着这些路线进行纵向研究的计划。该提案假设，例如，一个人的创伤史将映射到他们的杏仁核对威胁相关刺激的反应。反过来，这将使研究人员能够对个人未来的精神健康状况发表一些看法。\n哈里里和他的团队为此设计了四种与任务相关的核心措施：一种是针对杏仁核的威胁反应，一种是针对海马和记忆，另一种是针对纹状体和奖励，第四种针对的是前额皮质和执行控制。他认为自己有坚实的科学基础。因此，基于对功能磁共振成像收集这类数据的可靠性的怀疑，当这项提案甚至没有得到评论家的评分时，他感到震惊。\n哈里里说：这才是真正的刺激，我需要更认真地考虑功能磁共振成像任务的可靠性。这些担忧导致他对已发表的研究进行了广泛的回顾，声称可以使用任务功能磁共振来预测一个人的思维或感觉模式。他特别研究了什么是所谓的重测可靠性：当一个人在接受扫描的同时接受了同样的认知测试，然后又重新接受了同样的认知测试，两者之间有多大的相关性。最近发表在“心理科学”上的一篇论文中描述的结果压倒性地表明，任务功能磁共振成像不是一个可靠的指标：同一个人的一次扫描和后来一次扫描之间的相关性只是中等到很差。\n这些发现给哈里里带来了一点职业危机。他非常坦率地告诉“今日公爵”，这与我的工作比其他任何人都更相关。这是我的错。我要把自己扔到公共汽车下面去。如果我们不能解决这一关键限制，功能磁共振成像的整个分支都可能灭绝。\n诚然，他并不是说不可能可靠地测量大脑激活功能。他告诉ARS，你不能用我们一直在做的事情，用我们一直在用的任务来做这件事。\n拉塞尔·波德拉克在接受“今日杜克”采访时表示：这并不是说我们不知道这些可靠性问题，但这篇论文将它们更清晰地结合在一起。波德拉克是斯坦福大学的心理学家，他没有参与这项回顾研究，尽管他15年前的一篇功能磁共振成像论文包括在分析中。他说，这是一个很好的警钟，这是艾哈迈德正直的标志。\n功能磁共振成像是当今使用的最流行的大脑成像技术之一，部分原因是它能产生令人惊叹的全色图像-统计数据的惊人可视化-显示不同任务下大脑活动的亮点。传统的医用核磁共振成像产生大脑的静态图像，类似于X射线，但功能核磁共振成像(FMRI)监测一组神经元在对给定刺激做出反应时共同放电产生的血流量增加。具体地说，它检测到血液含氧量的轻微增加，即所谓的大胆反应。\n成像过程会产生大量原始数据-每次扫描多达50,000个数据点。因此，神经科学家依靠计算机算法来筛选所有这些信息，将许多不同研究参与者的扫描结果平均出来，这些参与者都参与了相同的任务(通常是一项控制任务，另一项是为测量特定目标而设计的)。控制性任务与指导性任务的差异越大，大胆反应越强。只有那些超过某一统计阈值的信号才会被认为显示了被指导的任务与任何受影响的大脑区域之间的相关性。\n不可避免地会有假阳性(同一区域随机地在两次不同扫描中点亮)，但神经科学家们非常努力地将潜在的假阳性纳入他们的统计分析。这一点的重要性在2010年的一篇论文中得到了著名的说明，该论文通过对一条死鲑鱼进行fMRI扫描，发现了一个可测量的大胆反应。加州大学圣巴巴拉分校的神经学家克雷格·贝内特(Craig Bennett)是这项研究的合著者之一，当时他是达特茅斯大学的研究生。他负责校准核磁共振仪，这通常是通过扫描装满矿物油的气球来完成的。他和他的实验室伙伴决定找点乐子，试着扫描一只康沃尔猎鸡、一个南瓜，最后扫描臭名昭著的鲑鱼。\n班尼特和他的实验室伙伴将三文鱼放入头部线圈内，然后进行校准测试，其中包括向这条鱼展示带有人脸照片的照片，并要求它确定每张照片中显示的情绪。瞧，当他分析数据时，数据中出现了一个信号-尽管死亡的鲑鱼根本不可能显示出任何大脑活动。Bennett et al.。因其富有启发性的工作而获得2012年搞笑诺贝尔奖神经科学奖。\n重点并不是说功能磁共振成像是一项不可靠的技术。相反，事实证明，对于执行相同任务的参与者群体的研究，它是相当可靠的，因为这产生了一个广泛的、一般的样本，使科学家能够准确地找出人群中的共同点。当我们谈论的是试图衡量一个人的大胆反应的研究时，事情就变得有点棘手了-比如，确定受试者是否在撒谎，他们对上帝的信仰，或者他们的同理心水平。例如，如果你把100个人放在扫描仪里，试图找出他们中哪些人在撒谎，你最多只能说一个小组比另一个小组撒谎的频率更高。你已经获得了整个群体的统计意义上的快照，但这并不等同于确定该群体中的某个特定人在撒谎。\n这就是为什么个体的功能性磁共振成像研究通常会让受试者参与多次扫描，以补偿小样本(N=1)并达到所需的统计阈值。但要从数据中梳理出强烈的相关性要困难得多，而且很容易说服自己，你在数据中看到的模式和相关性其实并不存在。", "note_en": "It all started with a rejected grant proposal. Ahmad Hariri, a neuroscientist at Duke University, was interested in using so-called &#34;task fMRI&#34;—in which subjects perform specially designed cognitive tasks while having their brains scanned—combined with genetic testing and psychological evaluations. The goal was to identify specific biomarkers for differences in how people process thoughts and emotions that might determine whether a given subject would be more or less likely to experience depression, anxiety, or age-related cognitive decline like dementia in the future.\n &#34;The idea was to collect this data once, then collect it again and again and again and be able to track changes in an individual&#39;s brain over time to help us understand what changes over the course of their lives,&#34; Hariri told Ars. So he submitted a funding proposal outlining his plans for a longitudinal study along those lines. The proposal hypothesized that an individual&#39;s history of trauma, for instance, would map onto how their amygdala reacted to threat-related stimuli. And that would, in turn, enable the researchers to say something about the future mental well-being of the individual.\n Hariri and his team designed four core, task-related measures to that end: one targeting the amygdala&#39;s threat response, one targeting the hippocampus and memory, one targeting the striatum and reward, and the fourth targeting the prefrontal cortex and executive control. He thought he was on solid scientific ground. So he was shocked when the proposal wasn&#39;t even scored by reviewers, based on skepticism regarding the reliability of fMRI to collect that kind of data.\n &#34;That was the real kick in the pants that I needed to think more seriously about the reliability of task fMRI,&#34; Hariri said. Those concerns led him to undertake an extensive review of published studies claiming it is possible to predict a person&#39;s patterns of thoughts or feelings using task fMRI. He looked specifically at what&#39;s known as &#34;test-retest reliability:&#34; how much correlation there is when a person takes, and then retakes, the same cognitive test while being scanned. The results, described in  a recent paper in Psychological Science, overwhelmingly showed that task fMRI was not a reliable indicator: the correlation between one scan and a later scan for the same person was only fair to poor.\n The findings instigated a bit of a professional crisis for Hariri. &#34;This is more relevant to my work than just about anyone else&#39;s,&#34;  he told Duke Today with remarkable frankness. &#34;This is my fault. I&#39;m going to throw myself under the bus. This whole sub-branch of fMRI could go extinct if we can&#39;t address this critical limitation.&#34;\n Granted, he&#39;s not saying it&#39;s impossible to measure brain activation function reliably. &#34;You just can&#39;t do it the way we&#39;ve been doing it, using the tasks we&#39;ve been using,&#34; he told Ars.\n &#34;It&#39;s not as if we haven&#39;t known these issues of reliability, but this paper brings them together more sharply,&#34;  Russell Poldrack told Duke Today. Poldrack is a psychologist at Stanford University who was not involved in the review study, although one of his fMRI papers from 15 years ago was included in the analysis. &#34;This is a good wakeup call, and it&#39;s a marker of Ahmad&#39;s integrity that he&#39;s taking this on,&#34; he said.\n  fMRI is one of the most popular brain-imaging techniques in use today, in part because it produces stunning full-color images—striking visualizations of statistical data—showing bright spots of brain activity in response to different tasks. Conventional medical MRI produces a static image of the brain, similar to an X-ray, but functional MRI (fMRI) monitors increases in blood flow produced by groups of neurons firing together in response to a given stimulus. Specifically, it detects slight increases in blood oxygenation levels, known as the BOLD response.\n The imaging process produces a lot of raw data—as many as 50,000 data points per scan. So neuroscientists rely on computer algorithms to sift through it all, averaging out the results from the scans of many different study participants all engaged in the same tasks (typically one control task, and one designed to measure a specific target). The larger the difference between the control task and directed task, the stronger the BOLD response. Only those signals that exceed a certain statistical threshold are considered as demonstrating a correlation between the directed task and any affected brain regions.\n  There are inevitably false positives (the same area &#34;lighting up&#34; in two difference scans by random chance), but neuroscientists work very hard to factor potential false positives into their statistical analyses. The importance of this was famously illustrated in  a 2010 paper that found a measurable BOLD response from an fMRI scan of a dead salmon. Neuroscientist Craig Bennett of the University of California, Santa Barbara, was one of the co-authors and a then-grad student at Dartmouth. He was in charge of calibrating the MRI machine, which is typically done by scanning a balloon filled with mineral oil. He and his lab partner decided to have some fun and tried scanning a Cornish game hen, a pumpkin, and finally, the infamous salmon.\n Bennett and his lab partner placed the salmon inside the head coil and then ran the calibration test, which involved &#34;presenting&#34; the fish with pictures of human faces and &#34;asking&#34; it to determine the emotions on display in each image. Lo and behold, a signal appeared in the data when he analyzed it—even though there was no way the dead salmon would have shown any brain activity at all. Bennett et al. won the  2012 Ig Nobel Prize for Neuroscience for their illuminating work.\n The point is not that fMRI is an unreliable technique. On the contrary, it has proven to be quite robust for studies of groups of participants performing the same task, since this produces a broad, general sample that enables scientists to pinpoint commonalities across populations. Things get a bit stickier when we&#39;re talking about studies trying to measure a BOLD response in just one person—say, to determine if the subject is lying, their belief in god, or their level of empathy. For example, if you put 100 people in a scanner and tried to figure out which of them were lying, the best you could say is that one subgroup will likely lie more often than another subgroup. You have gained a statistically significant snapshot of the group as a whole, but that is not the same as definitively determining that a given person within that group is lying.\n That&#39;s why fMRI studies of individuals typically have the subject participate in multiple scanning sessions to compensate for the small sample size (N=1) and reach the required statistical threshold. But it is much more difficult to tease out strong correlations from the data, and it&#39;s easy to convince yourself that you are seeing patterns and correlations in the data that aren&#39;t really there.", "posttime": "2020-07-08 20:43:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,大学,杜克大学,scientist,任务", "title": "杜克大学科学家用新的研究故障任务fMRI质疑自己的研究", "title_en": "Duke scientist questions his own research with new study faulting task fMRI", "transed": 1, "url": "https://arstechnica.com/science/2020/07/study-task-fmri-cant-reliably-predict-a-single-persons-thoughts-and-feelings/", "via": "", "real_tags": ["科学家", "大学", "杜克大学", "scientist", "任务"]}, {"category": "", "categoryclass": "", "imagename": "d7100b3657360b0da12f01c645886254.jpg", "infoid": 1010531, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三上午，马自达证实了发烧友们长期以来的期待：在2021年的车型年，马自达将为马自达3掀背车和轿车提供涡轮增压发动机作为选项。发动机是该公司的2.5L Skyactiv-G动力装置，当安装在马自达3上时，它以250马力(186千瓦)和320磅英尺(434 Nm)的功率将3直接撞到热舱口区域(或热轿车区域，视情况而定)。(如果你必须给它喂87号汽油，而不是93号汽油，功率和扭矩就会减少到227马力(170kW)和310磅英尺(410 Nm)。)。\n在发烧友们寄予厚望之前，马自达3似乎只会采用四轮驱动和六速自动变速器。从视觉上看，马自达3涡轮增压的调整相当微妙。有更大的排气管，它佩戴着黑色18英寸的合金轮毂和光泽的黑色格栅，侧视镜外壳和扰流板。\n马自达还将为MY2021马自达3S提供一对自然吸气式发动机选项。这里有186马力(139千瓦)，186磅英尺(252 Nm)2.5L Skyactiv-G版本；我们第一次开这款车是在2019年，下周左右会有一个评估，因为我们在轿车和掀背车版本上都有了更多的时间。(剧透提醒：我们仍然喜欢它。)。这款车仍将是一款前轮驱动的掀背车，配有手动变速器；否则，无论是FWD还是AWD，六速汽车都是唯一的选择。\n此外，还将有2.0L Skyactiv-G变种，额定功率为155马力(116kW)和150磅英尺(203 Nm)。\n不幸的是，我们还没有任何2021款车的定价或EPA评级，但马自达表示，自然吸气的车将在8月份上市，马自达3涡轮增压将在年底前上市。虽然我们正在道歉，但遗憾的是，我们没有关于聪明的Skyactiv-X火花控制压燃式发动机可能在美国首次亮相的消息。", "note_en": "On Wednesday morning, Mazda confirmed something  enthusiasts had long hoped for: for model year 2021, the carmaker will offer a turbocharged engine as an option for the Mazda 3 hatchback and sedan. The engine is the company&#39;s 2.5L Skyactiv-G power plant, and when installed in a Mazda 3, it bumps the 3 squarely into hot-hatch territory (or hot-sedan territory, as appropriate) with 250hp (186kW) and 320lb-ft (434Nm). (If you have to feed it 87 gasoline instead of 93, power and torque decrease to 227hp (170kW) and 310lb-ft (410Nm).)\n Before enthusiasts get their hopes too high, it does appear as if the turbocharged Mazda 3 will only come in all-wheel drive and only with a six-speed automatic transmission. Visually, the tweaks to the Mazda 3 Turbo are pretty subtle. There are larger tailpipes, and it wears black 18-inch alloy wheels and gloss black grilles, side-mirror housings, and spoilers.\n Mazda will also offer a pair of naturally aspirated engine options for MY2021 Mazda 3s. There&#39;s the 186hp (139kW), 186lb-ft (252Nm) 2.5L Skyactiv-G version;  we first drove this back in 2019 and have a review coming in the next week or so now that we&#39;ve had more time in both the sedan and hatchback versions. (Spoiler alert: we still love it.) And that car will still be available as a front-wheel-drive hatchback with a manual transmission; otherwise, a six-speed auto is the only option whether FWD or AWD.\n Additionally, there will also be a 2.0L Skyactiv-G variant, which is rated at 155hp (116kW) and 150lb-ft (203Nm).\n Unfortunately we don&#39;t have pricing or EPA ratings for any of the 2021 cars just yet, but Mazda says the naturally aspirated cars arrive in August, with the Mazda 3 Turbo arriving at dealerships before year&#39;s end. And while we&#39;re apologizing, sadly we have no news about a possible US debut for that clever  Skyactiv-X spark-controlled compression-ignition engine.", "posttime": "2020-07-08 20:42:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获得,boost,马自达", "title": "马自达3通过2021年车型年的新涡轮增压选项获得提振", "title_en": "The Mazda 3 gets a boost with a new turbo option for model year 2021", "transed": 1, "url": "https://arstechnica.com/cars/2020/07/the-mazda-3-gets-a-boost-with-a-new-turbo-option-for-model-year-2021/", "via": "", "real_tags": ["获得", "boost", "马自达"]}, {"category": "", "categoryclass": "", "imagename": "46e88dc87e964b842c7fa3f21f58bc07.jpg", "infoid": 1010530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Karma Automotive比菲斯克取得了更多的进步，包括在2019年实际交付了大约500辆其首款Revero电动运动型轿车。该公司将继续销售零售价约为14万美元的Revero，并将寻求增加一款高马力的GTE版本，以及一款面向更高层次客户的超级跑车。\n这家汽车制造商还表示，它正在与一家合作伙伴讨论一款商用送货卡车，打算在年底前开发出原型车。有许多不同的公司在寻求快递面包车供包括UPS和联邦快递(FedEx)在内的快递公司使用，电子商务支出的增加确实为多家公司在这一类别中取得成功提供了机会，尽管进入者的数量正在激增。\nKarma公司表示，Karma还将寻求利用并将其新投资的好处扩大到其他汽车制造商和OEM，并通过在其EV平台上购物来实现，最终还将从纯电动汽车扩展到混合动力燃料汽车。简而言之，听起来Karma愿意尝试几乎所有的事情来规划一条盈利之路，但时间会证明这是明智的机会主义，还是散漫的绝望。", "note_en": "Karma Automotive has made more progress than Fisker ever did, including actually delivering around 500 of its inaugural Revero electric sport sedan in 2019. The company will be continuing to sell the Revero, which retails staring at around $140,000, and will also be looking to add a high horsepower GTE version, as well as a supercar for an even higher-tier customer.\n The automaker also says that it’s in discussions with a partner for a commercial delivery truck, which it intends to develop in prototype form by year’s end. There are a number of different companies pursuing delivery vans for use by courier companies including UPS and  FedEx,   and the increase in e-commerce spending does present an opportunity for multiple players to succeed in this category, even as there is a rush on in terms of entrants.\n  Karma will also seek to leverage and extend the benefits of its fresh investment by shopping around its EV platform to other automakers and OEMs, the company says, and also will eventually expand beyond pure EVs to hybrid fuel vehicles. In short, it sounds like Karma is willing to try just about everything and anything to chart a path towards profitability, but time will tell if that’s intelligent opportunism, or scattershot desperation.", "posttime": "2020-07-08 20:42:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "automotive", "title": "\nKarma Automotive筹集1亿美元，希望将其电动汽车平台转售给其他汽车制造商", "title_en": "\n\t\t\t\tKarma Automotive raises $100 million as it looks to resell it EV platform to other automakers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/karma-automotive-raises-100-million-as-it-looks-to-resell-it-ev-platform-to-other-automakers/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们发布了期待已久的KeePassXC 2.6.0。这个版本是我们整个开发团队和敬业贡献者一年努力的结果。在2.6.0版本中，用户界面进行了彻底改造，增加了自定义主题(亮和暗)、图标和激动人心的功能。我们现在有了全面的密码报告，包括对我进行密码检查以查找被攻破的密码。此外，YubiKeyand OnlyKey集成得到了极大的改进，支持同时插入多达四个密钥。图片胜过千言万语，所以这里有一些截图！看看剩下的在这里。\n请在我们的GitHub问题跟踪器上报告您遇到的任何错误。如果您对新版本有任何其他问题(请参阅联系方式)，我们也可以在Matrix和IRC上找到。\nSSH代理：密钥文件路径环境替换、SSH_AUTH_SOCK覆盖和连接测试[#3769，#3801，#4545]", "note_en": "Today we have released the long awaited  KeePassXC 2.6.0. This release is the culmination of a year’s worth of effort from across our development team and dedicated contributors. With 2.6.0 comes a complete overhaul of theuser interface with custom themes (both light and dark), icons, and exciting features. We now have comprehensive password reports, including Have I Been Pwned password checks to find breached passwords. In addition, the YubiKeyand OnlyKey integration is vastly improved with support for up to four keys plugged in simultaneously. Pictures are worth a thousand words, so here are some screenshots! Check out the rest  over here.\n     Please report any bugs you encounter at our  GitHub issue tracker.We are also available on Matrix and IRC in case you have any other issues with the new release(see  Contact).\n   SSH Agent: Key file path env substitution, SSH_AUTH_SOCK override, and connection test [ #3769,  #3801,  #4545]", "posttime": "2020-07-08 20:40:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,keepassxc,密码", "title": "KeePassXC 2.6.0发布", "title_en": "KeePassXC 2.6.0 Released", "transed": 1, "url": "https://keepassxc.org/blog/2020-07-07-2.6.0-released/", "via": "", "real_tags": ["发布", "keepassxc", "密码"]}, {"category": "", "categoryclass": "", "imagename": "fff0b071aa30b74228128b8a8d3d1d8b.png", "infoid": 1010527, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "南非荷兰语(Af)、阿塞拜疆语(Az)、波斯尼亚语(Bs)、简体中文(Ch_Sim)、繁体中文(Ch_Tra)、捷克语(Cs)、威尔士语(Cy)、丹麦语(Da)、德语(De)、英语(En)、西班牙语(Es)、爱沙尼亚语(Et)、法语(Fr)、爱尔兰语(Ga)、克罗地亚语(Hr)、匈牙利语(Hu)、印度尼西亚语(Id)、冰岛语(Is)、意大利语(It)、日语。毛利语(Mi)、马来语(Ms)、马耳他语(Mt)、荷兰语(Nl)、挪威语(No)、波兰语(Pl)、葡萄牙语(Pt)、罗马尼亚语(Ro)、斯洛伐克语(Sk)(需要重访)、斯洛文尼亚语(Sl)、阿尔巴尼亚语(Sq)、瑞典语(Sv)、斯瓦希里语(Sw)、泰语(Th)、塔加洛克语(Tl)、土耳其语(Tr)、乌兹别克语(Uz)、越南语(Vi)。\n字符列表位于easyocr/character文件夹中。如果您是以任何语言为母语的人，并且认为我们应该添加或删除任何字符，请创建问题和/或拉回请求(如此请求)。\n注意：对于windows系统，请先按照https://pytorch.org的官方说明安装TORCH和TORCHVISION。\n备注：除了filepath&#39；test.jpg&#39；，您还可以按字节传递OpenCV图像对象或图像文件。\n所选语言的型号重量将自动下载，或者您可以从以下链接手动下载，并将其放入&#39；~/.EasyOCR/model&#39；文件夹中。\n输出将采用列表格式，每个项目分别表示边界框、文本和置信度。\n[1344439]，[2168439]，[2168580]，[1344580]，&#39；ใจเด็ด&39；，0.4542357623577118)，([[1333562]，[2169,562]，[2169,709]，[1333709]]，&#39；项目&#39；0.9557611346244812)]。\n如果您没有GPU或GPU内存较低，您可以通过添加GPU=FALSE在CPU模式下运行它。\nreadtext函数有可选参数，解码器可以是&#39；贪婪&#39；(默认值)、&#39；beamsearch&#39；或&#39；wordbeamsearch&#39；。对于&#39；beamsearch&#39；和&#39；wordbeamsearch&#39；，您还可以设置波束宽度(默认值=5)。数字越大，速度越慢，但可以更准确。对于多处理，您可以设置WORKS和BATCH_SIZE。当前版本将图像转换为灰度以用于识别模型，因此对比度可能是个问题。您可以尝试使用对比度、ADJUST_CORSORATS和FILTER_THS。\n识别模型为CRNN(纸张)。它由特征提取(我们目前使用的是RESNET)、序列标注(LSTM)和解码(CTC)三个主要部分组成。用于识别部分的训练流水线是来自该存储库的修改版本。\n请创建问题以报告错误或建议新功能。欢迎拉取请求。或者，如果你觉得这个图书馆很有用，就告诉你的朋友吧。", "note_en": "Afrikaans (af), Azerbaijani (az), Bosnian (bs), Simplified Chinese (ch_sim),Traditional Chinese (ch_tra), Czech (cs), Welsh (cy),Danish (da), German (de), English (en), Spanish (es), Estonian (et),French (fr), Irish (ga), Croatian (hr), Hungarian (hu), Indonesian (id),Icelandic (is), Italian (it), Japanese (ja), Korean (ko), Kurdish (ku),Latin (la), Lithuanian (lt),Latvian (lv), Maori (mi), Malay (ms), Maltese (mt), Dutch (nl), Norwegian (no),Polish (pl), Portuguese (pt),Romanian (ro), Slovak (sk) (need revisit), Slovenian (sl),Albanian (sq), Swedish (sv),Swahili (sw), Thai (th), Tagalog (tl),Turkish (tr), Uzbek (uz), Vietnamese (vi)\n List of characters is in folder easyocr/character. If you are native speakerof any language and think we should add or remove any character,please create an issue and/or pull request (like  this one).\n      Note: for Windows, please install torch and torchvision first by following official instruction here  https://pytorch.org\n   Note: Instead of filepath &#39;test.jpg&#39;, you can also pass OpenCV image object or image file as bytes.\n Model weight for chosen language will be automatically downloaded or you candownload it manually from the following links and put it in &#39;~/.EasyOCR/model&#39; folder\n        Output will be in list format, each item represents bounding box, text and confident level, respectively.\n [([[1344, 439], [2168, 439], [2168, 580], [1344, 580]],   &#39;ใจเด็ด &#39;, 0.4542357623577118), ([[1333, 562], [2169, 562], [2169, 709], [1333, 709]],   &#39;Project &#39;, 0.9557611346244812)]\n In case you do not have GPU or your GPU has low memory, you can run it in CPU mode by adding gpu = False\n  There are optional arguments for readtext function,  decoder can be &#39;greedy&#39;(default), &#39;beamsearch&#39;, or &#39;wordbeamsearch&#39;. For &#39;beamsearch&#39; and &#39;wordbeamsearch&#39;, you can also set  beamWidth (default=5). Bigger number will be slower but can be more accurate. For multiprocessing, you can set  workers and  batch_size. Current version converts image into grey scale for recognition model, so contrast can be an issue. You can try playing with  contrast_ths,  adjust_contrast and  filter_ths.\n      Recognition model is CRNN ( paper). It is composed of 3 main components, feature extraction (we are currently using  Resnet), sequence labeling ( LSTM) and decoding ( CTC). Training pipeline for recognition part is a modified version from this  repository.\n     Please create issue to report bug or suggest new feature. Pull requests are welcome. Or if you found this library useful, just tell your friend about it.", "posttime": "2020-07-08 20:40:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "easyocr,ready,gpu", "title": "EasyOCR：支持40种语言的即用型OCR", "title_en": "EasyOCR: Ready-to-use OCR with 40 languages", "transed": 1, "url": "https://github.com/JaidedAI/EasyOCR", "via": "", "real_tags": ["easyocr", "ready", "gpu"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010526, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2016年8月，一名公园护林员在挪威偏远的哈丹格维达高原偶然发现323头野生苔原驯鹿的身体。他们在一次反常的闪电事件中丧生。但是，公园没有移走身体，而是决定让它们留在原地，让自然顺其自然，科学家们研究这个腐烂的岛屿，以及它可能如何改变北极苔原生态系统。\n多年来，科学家们观察到这些肿胀的、苍蝇出没的身体变成了干燥的骨骼。英国皇家学会(Royal Society)6月份发表的最新论文着眼于“恐惧景观”的创造，因为狼獾、金鹰和北极狐狸等顶级捕食者利用了这种腐肉。\n报告总结道：“恐惧景观框架更好地理解了动物在食品和安全权衡、捕食者-猎物关系以及群落是如何跨营养水平构建等方面的决定。”\n由于欧洲有法律规定在大多数情况下必须移走身体，大多数人永远不会看到这种死亡和腐烂。\n“当我们第一次到那里的时候，那里有点庄严，”来自位于博伊市的东南部挪威大学的首席研究员沙恩·弗兰克(Shane Frank)在谈到哈丹格维达高原时说。“看到这么多生命这么快就被扼杀了，真令人难过。”\n科学家们架设了摄像头，记录了粪便，并观察到野生动物成群结队地涌向高原上的身体。高原海拔1220米，距离最近的哈丹格利塞镇步行3个小时。“随着时间的推移，随着驯鹿的腐烂，我们远离了那种‘死亡’的感觉。我们也学到了很多东西，在某种程度上赋予了它意义，感觉这是对那种庄严的…的抵消因素。否认死亡是生命的一部分是愚蠢的，“弗兰克说。\n乌鸦、乌鸦和鹰等食腐鸟类在2017年造访了密度最高的身体，然后在2018年几乎消失了。啮齿动物(如根田鼠、旅鼠、岸田鼠和田田鼠)的情况正好相反，它们在2017年没有出现在现场，然后在2018年到处都是。科学家认为，当这些较大的鸟类在附近时，啮齿动物太害怕了，不敢去现场。屠体是互动的热点，但并不是所有的互动都是积极的：“这有点像是，这里有自助餐，你有很多饥饿的人来吃饭，可能他们彼此都不是很喜欢，”弗兰克说。\n另一项发现是，非食腐鸟类，如草甸琵鹭、北方小麦、普通芦苇、蓝线飞禽和拉普兰飞禽，都以以腐肉为食的节肢动物(如苍蝇)的“开花”为食。草甸琵琶是最常见的，一次有多达80只个体在该地点觅食。去年12月，科学家们在另一篇关于驯鹿身体的论文中写道：“雀形目动物在动物身体上觅食昆虫的事实并不是一个独特的现象，但在文学中只有几个例子。”这篇论文发表在去年12月的“奥尼斯·诺维吉卡”(Ornis Norvegica)杂志上。进一步研究这些非食腐鸟类如何从身体中获益可能有助于保护工作。\n腐烂的身体也会改变菌群。围绕着323具驯鹿身体的是龙莓种子-高山苔原的关键物种-食腐动物正在现场周围丢弃这些种子。2018年发表在“生物学快报”上的一项研究显示，在24个乌鸦粪便样本中，有21个含有可行的红莓种子，这表明种子库可能会在身体周围建立起来。\n现在人们普遍认为，把枯木留在森林里对许多物种都有好处，但留下身体仍然是禁忌。这一点，加上对疾病传播的担忧，意味着从历史上看，关于腐肉如何将养分返还给生态系统的研究很少。弗兰克说：“我们一直把重点放在动物活着的时候，它们去了哪里，它们要移动到哪里。我不知道这是否是关于死亡的事情，从文化上讲，从西方的角度来看，我们有点反对。我认为，至少在野生动物研究中，人们现在对冰冷的身体有了某种程度的热身。每件事都是相连的，都是循环的。“。\n随着气候危机的升级和极端天气频率的增加，大规模死亡事件，如哈丹格维达驯鹿死亡事件，可能会变得更加常见。例如，澳大利亚的森林大火估计已经导致超过8亿动物死亡(不包括青蛙、昆虫和其他无脊椎动物)，这将导致生态系统的长期变化。2015年，哈萨克斯坦反常的温暖天气导致一种通常无害的病原体在几周内灭绝了20万只赛加羚羊，2015-16年，100万只海鸟因北美周围巨大的“一团”热海洋而饿死。\n二十年前，我们对拾荒者重要性的理解更为有限。西班牙格拉纳达大学的动物学家马科斯·莫隆(Marcos Moleón)说，现在，来自不同学科的专家正在寻找与景观中死亡研究相关的研究机会。他认为，随着人们越来越多地认识到清道夫在陆地和水环境中发挥的关键作用，我们正处于“清道夫研究的黄金时代”。观察觅食的猎物意味着我们更好地了解食物网中的联系和相互作用，以及它们是如何创造稳定的生态系统的。他说：“特别重要的是那些可以进行长距离移动并在大空间尺度上分布营养的食腐动物，比如秃鹫和大型哺乳动物捕食者。”\n这并不意味着政策-只有在特殊情况下，欧洲才会让身体腐烂，比如当它们为秃鹫等稀有食腐动物提供食物时。吃自然保护区的大型哺乳动物通常被认为是家养的，所以一旦它们死了，它们的身体就会被移走。\n一个著名的例外是被引入荷兰阿姆斯特丹以东有争议的Oostvaarderplassen自然保护区的草食动物。这项名为荷兰塞伦盖蒂(Dutch Serengeti)的重新野生实验在数千头马鹿、科尼克马和赫克牛在冬天挨饿后引发了愤怒，部分原因是没有狼等捕食者。身体被留在了外面的公众视线中，许多抗议者谴责该项目是“虐待动物”。\n1月份发表在科学杂志“公共科学图书馆·综合”(Plos One)上的研究表明，马鹿的身体有益于Oostvaarderplassen的生物多样性。在接近完全分解后，它们周围的植物生物量比平时增加了五倍，导致以植物为食的无脊椎动物数量增加，因此捕食者的数量也增加了。科学家们发现，这种生命的繁盛持续了几个月，并通过食物链传播-甚至在景观中造成了灌木丛和异质性。\n荷兰格罗宁根大学的首席研究员Roel van Klink说，身体生态对保护区的“重新野生”起到了重要作用：“显然，因为那里躺着一具身体，所以大型食草动物，如鹿，避免在它周围吃草，因为它们知道这是不健康的。”然后你就会得到一大丛蓟。假设灌木丛可以从这里开始生长，然后是树木，最终你可能会拥有一片完全不同的景观。“\n然而，由于对动物福利的强烈关注，留下身体腐烂的问题现在受到了严格的控制。荷兰国家林业局表示，Oostvaarderplassen的大型食草动物数量不应超过1100只(一度有2855只)，整个冬天只剩下大约30到40头鹿的身体。\n作为荷兰“死亡造就生命”(Dood Doet Leven)计划的一部分，不同的自然组织正在共同努力，在风景中找回身体。该组织认为，如果红风筝、黑风筝和和尚秃鹫等食腐动物重返欧洲，政策变化至关重要。它认为，剔除死去的树木和动物会让景观变得更好。范·克林克说：“如果周围有更多的腐肉，我们可能会有更多的大型猛禽，比如从英国到德国再到波兰的任何地方的白尾鹰。”许多大型猛禽会喜欢它的。“。\n在欧洲最大的高原哈丹格维达，身体很可能会使生物多样性受益，并在生态系统中造成异质性。然而，在欧洲人口更稠密的地区，死亡的景象仍然是有问题的。尽管越来越多的研究表明在食物网中觅食的重要性，但农民和兽医仍然非常担心疾病传播的可能性，因此短期内将腐肉排除在外不太可能在更广泛的领域被接受。\n范·克林克说，要让自然保护区更容易接受遗弃身体，这是一场“艰苦的战斗”。“进展缓慢，将是局部的，但肯定会有一些进展。我们只需要继续推进，“他说。\n在这里找到更多关于物种灭绝的报道，并在Twitter上关注生物多样性记者菲比·韦斯顿和帕特里克·格林菲尔德，以获得所有最新的新闻和专题", "note_en": "In August 2016, a park ranger stumbled upon 323 dead wild tundra reindeer in Norway’s remote Hardangervidda plateau. They had been killed in a freak lightning event. But instead of removing the carcasses, the park decided to leave them where they were, allowing nature to take its course – and scientists to study this island of decomposition and how it might change the arctic tundra ecosystem.\n Over the years scientists observed the bloated, fly-infested bodies turn into dry skeletons.  The latest paper, published by the Royal Society in June, looked at the creation of a “landscape of fear”, as top predators such as wolverines, golden eagles and arctic foxes took advantage of the carrion.\n “The landscape of fear framework has provided a better understanding of animal decisions in relation to food and safety trade-offs, predator–prey relationships and how communities are structured across trophic levels,” it concluded.\n With  laws in place in Europe meaning carcasses have to be removed in most instances, most people will never see this kind of death and decay.\n “When we were first there it was a little bit solemn,” lead researcher Shane Frank from the University of South-Eastern  Norway in Bø says of the Hardangervidda plateau. “It was sad to see that much life snuffed out so quickly.”\n  Scientists set up camera traps, recorded faeces and observed the wildlife flocking to the carcasses on the plateau, which is 1,220 metres above sea level and a three-hour hike from the nearest town of Liseth in Hardanger. “Over time, as the reindeer decomposed we gained some distance from that ‘death’ feeling. We were also learning so much, in a way giving meaning to it, and it felt like that was an offsetting factor to that solemnity … It’s silly to deny death as part of life,” says Frank.\n Scavenger birds such as ravens, crows and eagles visited the highest density of carcasses in 2017 and then were nearly absent in 2018. The reverse was true of rodents (such as root vole, lemming, bank vole and field vole), which were absent from the site in 2017 and then were everywhere in 2018. Scientists believe rodents were too fearful to go to the site while these larger birds were around. Carcasses are interaction hotspots, but not all interactions are positive: “It’s kind of like, here’s a buffet, you’ve got a lot of hungry folks coming in to eat, and maybe they don’t like one another very much,” says Frank.\n Another discovery was that non-scavenger birds such as the meadow pipit, northern wheatear, common reed bunting, bluethroat and lapland bunting all fed on the “bloom” of arthropods, such as blowfly, that developed on the carrion. Meadow pipit were the most common, with up to 80 individuals feeding on the site at once. “The fact that passerines forage on insects at animal carcasses is not a unique phenomenon, but only a few examples exist in literature,” scientists wrote in another  paper on the reindeer carcasses published in Ornis Norvegica in December. Further study of how these non-scavenging birds could benefit from carcasses could help conservation efforts.\n  Rotting bodies also change flora. Surrounding the 323 reindeer carcasses were  seeds of crowberry – a keystone species of alpine tundra – that scavengers were dropping around the site. Out of 24 faecal samples from crows, 21 contained viable crowberry seeds, according to a  study published in Biology Letters in 2018, that suggests seed banks are likely to build up around carcasses.\n It is now widely accepted that leaving dead wood in forests benefits many species, but leaving carcasses is still taboo. This, along with concerns about the spread of disease, means there has historically been little research on how carrion returns nutrients to ecosystems. Frank says: “We’ve been focusing on animals when they’re alive, where they go, and where are they moving. I don’t know if it’s something about mortality, culturally, from the western perspective, that we’re a little bit averse to. I think people are now kind of warming up to cold bodies, at least in wildlife research. Everything is connected, and circular.”\n  With the escalating climate crisis and increased frequency of extreme weather, mass mortality events, such as the deaths of the reindeer in Hardangervidda, will probably become more common. The Australian bushfires, for example, are  estimated to have killed  more than 800m animals (excluding frogs, insects and other invertebrates), which will cause  long-term changes in ecosystems. Unseasonably warm weather in Kazakhstan in 2015 caused a normally harmless pathogen to  wipe out 200,000 saiga antelope in a few weeks, and 1m seabirds  starved to death in 2015-16 because of a giant “blob” of hot ocean around north America.\n Two decades ago, our understanding of the importance of scavenging was more limited. Now, experts from different disciplines are identifying research opportunities linked to the study of death in the landscape, says zoologist Marcos Moleón from the University of Granada in Spain. He believes we are in “the golden age of scavenging research”, with increasing recognition of the key functions scavengers play in terrestrial and aquatic environments. Looking at scavenged prey means we understand connections and interactions in food webs better, and how they create stable ecosystems. “Especially important are those scavengers that may perform long-distance movements and distribute nutrients over large spatial scales, such as vultures and large mammalian predators,” he says.\n  This doesn’t translate into policy – carcasses are left to rot in Europe only in exceptional circumstances, such as when they provide food for rare scavengers such as vultures. Large mammals that graze nature reserves are generally considered domestic, so their bodies are removed once they have died.\n One famous exception is herbivores introduced to the controversial  Oostvaardersplassen  nature reserve, east of Amsterdam in the Netherlands. The rewilding experiment – known as the Dutch Serengeti – caused outrage after thousands of red deer, Konik horses and Heck cattle starved in the winter, partly because of the absence of predators such as wolves. Carcasses were left outside in public view, with many protesters  condemning the project as “animal abuse”.\n  Research published in the science journal Plos One in January suggests the red deer carcasses benefited biodiversity in Oostvaardersplassen. After near-complete decomposition, plant biomass surrounding them was five times greater than usual, leading to an increase in plant-eating invertebrates and therefore an increase in predators. This bloom of life lasted for months and spread through food chains – even creating scrubby areas and heterogeneity in the landscape, scientists found.\n  Lead researcher Roel van Klink from the University of Groningen in the  Netherlands said carcass ecology played an important part in the “rewilding” of the reserve: “Obviously, because there is a carcass lying there large grazers, such as deer, avoid grazing around it because they know it’s unhealthy. You then get this huge bush of thistles. Hypothetically, scrub could start growing here and then trees, and eventually you could potentially have a completely different landscape.”\n However, owing to strong animal welfare concerns, leaving carcasses to decompose is now seriously controlled. The Dutch state forestry service says large herbivore populations should not exceed 1,100 animals in Oostvaardersplassen (there were 2,855 at one point) and only around 30 to 40 deer carcasses are left out over the winter.\n  Various nature organisations are working together to recover cadavers in the landscape as part of the Dutch “  dood doet leven” (death makes life) programme. The organisation believes policy change is vital if scavengers such as red kite, black kite and monk vulture are to return to Europe. Leaving out dead trees and animals transforms the landscape for the better, it argues. Van Klink says: “We could have many more large raptors, like white-tailed eagles everywhere from the UK to Germany to Poland, if there was much more carrion lying around. Many large raptors would love it.”\n  In Hardangervidda – the largest plateau in Europe – carcasses are likely to be benefitting biodiversity and creating heterogeneity in ecosystems. However, in more densely populated parts of Europe, the sight of death in the landscape remains problematic. Despite an increasing body of research showing the importance of scavenging in food webs, farmers and vets also remain extremely concerned about the potential for disease to spread, and so leaving out carrion is unlikely to be acceptable in the wider landscape any time soon.\n Van Klink says it is an “uphill battle” to make leaving out carcasses more acceptable on nature reserves. “Progress is slow and will be local, but there is definitely some progress. We just need to keep pushing,” he says.\n Find more  age of extinction coverage here, and follow biodiversity reporters  Phoebe Weston and  Patrick Greenfield on Twitter for all the latest news and features", "posttime": "2020-07-08 20:39:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,身体,rotting", "title": "一堆腐烂的驯鹿身体教会了科学家们", "title_en": "What a mass of rotting reindeer carcasses taught scientists", "transed": 1, "url": "https://www.theguardian.com/environment/2020/jul/08/landscape-of-fear-what-the-rotting-carcasses-of-reindeer-taught-scientists-aoe", "via": "", "real_tags": ["科学家", "身体", "rotting"]}, {"category": "", "categoryclass": "", "imagename": "d103c3bbd6bcf1eff13dfe713fb6ee1b.jpg", "infoid": 1010524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一下午，暴风雨席卷了肯尼迪航天中心-就像夏天经常发生的那样-但SpaceX继续推进其第10批Starlink卫星的发射。\n该公司将寻求在美国东部时间周二上午11：59(UTC 15：59)从肯尼迪航天中心的发射综合体-39A上用猎鹰9号火箭发射57颗Starlink卫星，以及BlackSky Global的另外两颗地球观测卫星。天气看起来不错，发射时有60%的机会有有利的条件。\nSpaceX首次尝试发射这项任务是在6月26日，但在计划发射前几个小时停止了，理由是需要额外的时间进行发射前检查。\n这些卫星的发射将使SpaceX的星链星座在近地轨道上的航天器总数接近600个。而且这些都不是小立方体卫星--每颗星链卫星重260公斤，都有自己的星载推进系统。\n由于SpaceX计划再发射数千颗这样的卫星，因为它在近地轨道上建造了一个信标星座，以便从太空提供全球互联网服务，因此天文学家开始提出担忧，这是可以理解的。他们既担心后院天文学家的夜空，也担心智利、莫纳克亚和其他地方的精密天文台。\nSpaceX已经寻求解决这个问题，首先通过使卫星变暗来降低它们的反射率。现在，该公司正在迈出更大的一步，开发一种无线电透明泡沫，这种泡沫将从卫星上翻转出来，防止反射。\n该公司表示，这款面罩在发射期间平放在底盘上，并在卫星与猎鹰9号分离期间展开。遮阳板通过完全阻挡光线到达漫射天线来防止光线从漫射天线反射出去。这种方法不仅避免了天线表面变暗带来的热影响，而且还应该对亮度降低有更大的影响。\n猎鹰9号火箭上的57颗Starlink卫星将首次搭载这些卫星。\n这将是SpaceX第三次五次发射猎鹰9号第一级-这个助推器于2019年3月从Demo-1任务开始其职业生涯，此后还飞行了另外三次任务。该公司将寻求在无人机上找回这个助推器，当然，我仍然爱你。下面的网络直播应该在起飞前大约15分钟开始。", "note_en": "Storms rolled through the Kennedy Space Center on Monday afternoon—as they often do during the summer—but SpaceX continued to press forward toward launching its 10th batch of Starlink satellites.\n The company will seek to launch 57 Starlink satellites, along with two Earth-observation satellites for BlackSky Global, on a Falcon 9 rocket at 11:59am ET on Tuesday (15:59 UTC) from Launch Complex-39A at Kennedy Space Center. The weather looks decent, with a 60-percent chance of favorable conditions at liftoff.\n  SpaceX first attempted to launch this mission back on June 26 but stood down a couple of hours before the planned launch, citing the need for additional time to conduct pre-launch checkouts.\n The launch of these satellites will bring SpaceX&#39;s Starlink constellation to very nearly 600 total spacecraft in low-Earth orbit. And these are not small CubeSats—each of the Starlink satellites weighs 260kg and has its own on-board propulsion system.\n Because SpaceX plans to launch thousands more of these satellites as it builds out a constellation of beacons in low-Earth orbit to provide global Internet service from space, astronomers have understandably begun to raise concerns. They worry both about the night sky for backyard astronomers, as well as sophisticated observatories in Chile, Mauna Kea, and elsewhere.\n SpaceX has sought to address the problem, first by darkening the satellites to make them less reflective. Now, the company is taking a bigger step, developing a radio-transparent foam that will flip out from the satellites and prevent reflection.\n &#34;This visor lays flat on the chassis during launch and deploys during satellite separation from Falcon 9,&#34;  the company stated. &#34;The visor prevents light from reflecting off of the diffuse antennas by blocking the light from reaching the antennas altogether. Not only does this approach avoid the thermal impacts from surface darkening the antennas, but it should also have a larger impact on brightness reduction.&#34;\n All of the 57 Starlink satellites on board the Falcon 9 rocket will carry these &#34;visor&#34; sats for the first time.\n This will be the third time SpaceX has launched a Falcon 9 first stage five times—this booster started its career with the Demo-1 mission in March 2019 and has since flown three other missions. The company will seek to recover this booster on the  Of Course I Still Love You droneship. The webcast below should begin about 15 minutes before liftoff.", "posttime": "2020-07-08 20:18:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "周二,launch,卫星", "title": "SpaceX周二将尝试发射带有“面罩”的Starlink卫星", "title_en": "SpaceX will try to launch Starlink satellites with “visors” on Tuesday", "transed": 1, "url": "https://arstechnica.com/science/2020/07/spacex-will-try-to-launch-starlink-satellites-with-visors-on-tuesday/", "via": "", "real_tags": ["周二", "launch", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "6e3c1931aa58b33fd878f148a0a140b4.jpg", "infoid": 1010523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TikTok删除了BBC发现的一组视频，这些视频使用了一首令人恶心的反犹歌曲，点击量超过650万次。\n周日，这首歌出现在应用程序上，其中包括歌词：我们要去一个叫奥斯威辛集中营的地方旅行，现在是洗澡时间。\n第一个使用这首歌的视频显示了一只巨大的机器蝎子，手持纳粹党徽，袭击和杀人。\n其他进一步使用这首歌的视频占了额外50万的点击量。\n奥斯威辛集中营是波兰的纳粹死亡集中营，二战期间有100多万人在那里死亡，其中许多人在被告知要公共淋浴后死于毒气室。\n近100名用户为自己的视频选择了这首歌。其中一个展示了电脑游戏Roblox中的一个角色，看起来像希特勒。\n另一个人使用了一个射击游戏的剪辑，在这个游戏中，人们被绿色毒气罐杀死。\n这批视频在被移除前不到三天就吸引了大量观众。\n反犹太主义运动的调查和执法主管斯蒂芬·西尔弗曼(Stephen Silverman)说，看着这段针对儿童的令人恶心的TikTok视频，视频中一个举着纳粹党徽的机器人抓住并焚烧犹太人，音乐取笑在奥斯威辛集中营被毒气杀害的犹太男人、女人和儿童，这让人感到难以置信的痛苦。\nTikTok特别有义务快速处理这些内容，因为它专门在儿童和年轻人最易受影响的时候向他们发送病毒式视频，而我们的研究表明，TikTok已经成为传播嘲笑大屠杀的模因的最快媒介之一。\n一位女发言人说：保障我们用户的安全是TikTok的首要任务，我们的社区指南明确指出了我们平台上不能接受的东西。\n我们不容忍任何包含仇恨言论的内容，相关声音以及所有相关视频现已被删除。虽然我们不会捕捉到所有不恰当的内容，但我们正在不断改进我们的技术和政策，以确保TikTok仍然是一个积极创意表达的安全场所。\n一些专家认为，TikTok在向更广泛的受众推广视频之前，需要采取更多措施检查视频内容。\nModern Impact首席执行官迈克尔·普里姆(Michael Priem)表示：TikTok没有透露其内容背后的算法或战略。但人们普遍认为，它类似于其他常用的模型，它们收集关于我们的内容消费和同龄人影响的网络的数据。\n随着特定视频的势头增强，算法会在整个平台上更广泛地推广它们。因此，用户直观地要求对方帮助这件事迅速传播开来。那么问题就出在内容过滤上了。\n发布引发这一表情包的原始视频的用户似乎是一名来自英国的年轻青少年。他没有回复记者的置评请求，撰写本文时，他的账户仍在运行。他在个人资料中写道，在发布视频后，他获得了1.2万名新粉丝。\n2015年，这段视频的一个非常相似的版本被上传到YouTube上。它被发布在一个小频道上，在直播的近五年里获得了6.7万的点击量。英国广播公司(BBC)联系YouTube后将其删除。\n目前还不清楚这首歌的发源地，但图像来自一款名为“围城”的电脑游戏，玩家可以通过该游戏创建定制的围城武器。", "note_en": "TikTok has deleted a collection of videos found by the BBC to be using a &#34;sickening&#34; anti-Semitic song that gained more than 6.5 million views.\n The song surfaced on the app on Sunday and includes the lyrics: &#34;We&#39;re going on a trip to a place called Auschwitz, it&#39;s shower time.&#34;\n The first video to use the song showed a giant robot scorpion with a swastika attacking and killing people.\n  Other videos that made further use of the song accounted for the additional half a million views.\n  Auschwitz was a Nazi death camp in Poland where more than a million people died during World War Two, many of them in gas chambers after being told they were going to take a communal shower.\n Nearly 100 users chose the song for their own videos. One showed a character from the computer game Roblox that looks like Hitler.\n  Another used a clip of a shooter game where people are killed by green gas canisters.\n   The collection of videos attracted the large audience in less than three days before they were removed.\n &#34;It was incredibly distressing to watch this sickening TikTok video aimed at children, showing a swastika-bearing robot grabbing and incinerating Jews, as the music poked fun at Jewish men, women and children being killed with poison gas at Auschwitz,&#34; said Stephen Silverman, director of investigations and enforcement for the Campaign Against Antisemitism.\n &#34;TikTok has a particular obligation to tackle this content fast because it specialises in delivering viral videos to children and young adults when they are most impressionable, and yet our research has shown that TikTok has become one of the fastest vectors for transmission of memes mocking the Holocaust.&#34;\n   A spokeswoman said: &#34;Keeping our users safe is a top priority for TikTok, and our community guidelines make clear what is not acceptable on our platform.\n &#34;We do not tolerate any content that includes hate speech, and the sound in question, along with all associated videos, have now been removed. While we will not catch every instance of inappropriate content, we are continuously improving our technologies and policies to ensure TikTok remains a safe place for positive creative expression.&#39;&#34;\n  Some experts believe TikTok needs to do more to check the content of videos before promoting them to a wider audience.\n Michael Priem, chief executive of Modern Impact said: &#34;TikTok is not revealing their algorithms or strategy behind content. But it&#39;s widely believed that it&#39;s similar to other commonly used models that collect data on our content consumption and peers influenced network.\n &#34;As specific videos gain momentum the algorithm then promotes them more widely across the platform. Hence the users intuitively asking each other to &#39;help this go viral&#39;. The problems rest then on the content filtering.&#34;\n The user who posted the original video that started the meme appears to be a young teenager from the UK. He did not respond to requests for comment and his account was still live at the time of writing. He wrote on his profile that he had gained 12,000 new followers after posting the video.\n A very similar version of the video was uploaded to YouTube in 2015. It was posted on a small channel and gained 67,000 views in the nearly five years it was live. YouTube removed it after being contacted by the BBC.\n It is not clear where the song originated, but the imagery is from a computer game called Besiege that allows players to create custom siege weapons.", "posttime": "2020-07-08 20:17:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,反犹,semitic,视频", "title": "TikTok算法推广反犹死亡营表情包。TikTok删除了BBC发现的一组视频，这些视频使用了一首“令人恶心的”反犹歌曲，点击量超过650万次。", "title_en": "TikTok algorithm promoted anti-Semitic death camp meme. TikTok has deleted a collection of videos found by the BBC to be using a \"sickening\" anti-Semitic song that gained more than 6.5 million views.", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-53327890", "via": "", "real_tags": ["算法", "反犹", "semitic", "视频"]}, {"category": "", "categoryclass": "", "imagename": "34c04033fb1bfd2a2d5946c75f387df4.jpg", "infoid": 1010522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这里，用户将点击并回答几个问题，包括他们做的运动类型，他们的锻炼长度，他们和谁一起锻炼(孩子，单独锻炼，和伴侣一起锻炼，等等)，强度水平和情绪。然后，Spotify会将这些信息与您的音乐品味同步，以便为您定制锻炼播放列表。如果您愿意，您还可以选择在此播放列表中同时包含音乐和播客。\n您可以随时重新参加测验以创建更个性化的播放列表，方法是在更改锻炼活动时以不同方式回答问题。然后，这些内容还会添加到您的Spotify应用程序的播放列表集合中，以便将来轻松访问。\n健身音乐在流媒体服务上已经非常受欢迎，特别是在年轻用户中。例如，该公司发现，超过一半(53%)的流媒体锻炼曲目的年龄在18岁至29岁之间。在冠状病毒封锁下，尽管用户无法去健身房，但人们对健身音乐的兴趣仍然很高。例如，在过去的两个月里，Spotify的听众已经创建了100多万个以锻炼为主题的播放列表。\nSpotify的趋势专家沙农·库克在一份关于此次发布的声明中指出：“锻炼音频一直是全球Spotify听众关注的焦点，现在用户比以往任何时候都在寻找创造性的方法，在当前的气候下保持活跃和健康。”\n为了启动这项新功能，Spotify与名人训练师科里·卡利埃(Corey Calliet)合作，后者创作了自己的个性化配乐，这里分享了这段配乐。\n这并不是Spotify第一次利用微型网站推广其服务。该公司最近推出了Listen Local等努力，它引导用户回答测验，并有选择地与Spotify联系，以获得选定市场的本地推荐。例如，当人们开始同时播放同一首歌时，它还推出了一起聆听(Listing Together)。\n但对于Spotify来说，在代表用户定制播放列表之前，要求进行测试来收集信息的情况较少。在这种情况下，这是更有必要的，因为锻炼可以是非常不同的体验。也就是说，当你在瑜伽课上集中注意力时，你想要的曲调和节奏与让你在跑步机上跑步的音乐通常是非常不同的。\n我们应该注意到，Spotify也许能够将这里收集的信息用于其他方面--也许是为了建议未来符合您兴趣的播放列表或用于广告目的。\n当然，就像Spotify制作的任何个性化播放列表一样，结果取决于你已经向服务提供的数据。如果您允许孩子或其他家庭成员使用您的帐户，或者不经常使用Spotify而使用其他服务，播放列表可能无法完全反映您的兴趣。", "note_en": "Here, users will click through and answer a few questions about the type of exercises they do, their workout length, who they work out with (kids, alone, with a partner, etc.), intensity level and mood. Spotify will then sync this information with your musical tastes in order to customize a workout playlist for you. You also can opt to have both music and podcasts combined in this playlist, if you choose.\n   You can retake the quiz at any time to create more personalized playlists by answering the questions differently as you change your workout activity. These are also then added to your collection of playlists in the Spotify app for easy access in the future.\n Workout music is already hugely popular on the streaming service, particularly among younger users. The company found that more than half (53%) of those streaming workout tunes were ages 18 to 29, for example. And under coronavirus lockdowns, interest in workout music has remained high, despite users’ inability to hit the gym. In the past two months, for instance, Spotify listeners have created more than a million workout-themed playlists.\n “Workout audio has always been a big focus for listeners on Spotify around the globe, and now more than ever, users are finding creative ways to stay active and healthy in this current climate,” noted Spotify’s Trends Expert, Shanon Cook, in a statement about the launch.\n  To kick off the new feature, Spotify partnered with celebrity trainer  Corey Calliet who created his own personalized soundtrack, which is shared  here.\n This is not the first time Spotify has made use of a microsite to promote its service. The company more recently launched efforts like  Listen Local, which directs users to answer a quiz and optionally connect with Spotify for local recommendations in select markets. It also launched  Listening Together to showcase when people are starting to play the same song at the same time, for example.\n But it’s less common for Spotify to require a quiz to collect information before customizing a playlist on users’ behalf. In this case, it was more necessary because workouts can be very different experiences. That is, the tunes and tempo you want while centering your mind during a yoga session and the music that keeps you running on the treadmill are often very different.\n Spotify may be able to use the information collected here in other ways, we should note — perhaps to suggest future playlists that match your interests or  for advertising purposes.\n Of course, like any personalized playlist Spotify makes, the result is only as good as the data you’ve already fed the service. If you’ve allowed kids or other family members to use your account or don’t often use Spotify in favor of a different service, the playlist may not perfectly reflect your interests.", "posttime": "2020-07-08 20:17:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,锻炼,personalized", "title": "\nSpotify的新个性化播放列表专为您的锻炼而设计", "title_en": "\n\t\t\t\tSpotify’s new personalized playlists are designed for your workouts\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/spotifys-latest-personalized-playlists-are-designed-for-your-workouts/", "via": "", "real_tags": ["设计", "锻炼"]}, {"category": "", "categoryclass": "", "imagename": "fa73ec1e3e61de7693ea0f2035bdd83b.jpg", "infoid": 1010520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州卡梅尔谷(Carmel Valley)。--本周末，一名旧金山科技公司首席执行官在一家餐厅庆祝生日时，拍摄到了一段种族主义咆哮，之后，一个南加州家庭发表了自己的言论。奥罗萨和陈的家人表示，他们不会让这段经历破坏在卡梅尔山谷庆祝玛丽·奥罗萨7月4日生日的一年一度的传统。相关报道：伯克利的白人居民给年轻的黑人女孩打电话说，雷蒙德·奥罗萨(Raymond Orosa)和他的家人当时正在卡梅尔谷餐厅露西亚(Lucia)用餐。我们只是在那里庆祝，玩得开心，奥罗萨说。当他们旁边的桌子上的人开始咆哮时，乐趣很快就消失了。突然我听到一个很大的声音，你知道，就像亚洲人一样，奥罗萨说。雷蒙德的侄女乔丹·陈用手机记录下了接下来发生的事情。成龙在视频中说，现在再说一遍，你很害羞。视频：一名男子在阻止拉丁裔男子进入他自己的公寓楼后被解雇，迈克尔·洛夫豪斯对这家人竖起了手指，然后说，特朗普要去-你。你.-你得走了。你-亚洲人-他充满了仇恨和愤怒，奥罗萨说。他继续说，令人难过的是，在这个世界上仍然有这样的人，更不用说在这个国家了。露西亚的一名员工很快介入。出去，你不允许在这里。你不能这样跟我们的客人说话。他们是贵宾。“滚出去！”奥罗萨说，“我很佩服她这一点。”观看：种族与冠状病毒：旧金山湾区关于新冠肺炎对亚裔美国人社区影响的虚拟市政厅对话在一份电子邮件声明中，贝尔纳杜斯旅店和水疗中心的副总裁兼总经理肖恩·达马里写道，这是一个极其不幸的情况，但我们为我们在露西亚的员工感到自豪，以符合贝尔纳杜斯·洛奇的核心价值观；这一事件得到迅速处理，用餐者被护送离开酒店，没有进一步升级。我们为客人提供安全的住宿和用餐环境，并向在假日周末享受生日庆祝的客人表示诚挚的歉意。迈克尔·洛夫豪斯还发表了一份声明，写道，我在视频中的行为令人震惊。这显然是我失去控制的时刻，我发表了令人难以置信的伤害和分裂的评论。我想向陈家深表歉意。我只能想象他们感受到的压力和痛苦。我被教导要尊重所有种族的人，我会花时间反思我的行为，并努力更好地理解我周围的许多人每天面临的不平等。他只是在保全面子。“我想他说的和做的都是真心实意的，”奥罗萨说。“我不相信他的话，因为他的行动比他说的话更能说明问题，”他继续说。奥罗萨说，这些行动在一定程度上包括一些额外的Instagram评论，这些评论似乎是洛夫豪斯针对这个家庭的一名支持者发布的，其中包括亚洲脏话，如果你走近我或我的人，你就会被咒骂死。视频：伯克利分校的妈妈拍摄了与拆毁黑人生活也是命的白人男子的对峙标语，洛夫豪斯没有回应就Instagram帖子或他扮演的Sola角色发表更多评论的请求。(注：伯克利分校的母亲拍摄了一段与白人男子的对峙，后者撕毁了黑人的生活也是命》的标语，洛夫豪斯没有回应就Instagram上的帖子或他扮演的Solar角色发表更多评论的请求。我不能说他的所作所为是可接受的或正确的，这是不对的，因为很多人可能不会同意我说我原谅他的说法。但我知道，奥罗萨说。奥罗萨说，他和妻子在美国生活了26年，在那晚之前，他们从未感觉到任何与种族主义有丝毫相似之处。他说，他希望这种情况永远不会再发生在他们或其他任何人身上。视频：是什么激励了凯伦？专家们就流行术语发表意见", "note_en": "CARMEL VALLEY, Calif. -- A Southern California family is speaking out after a San Francisco tech CEO went on a racist rant that was captured on video this weekend while they were celebrating a birthday at a restaurant.  The Orosa and Chan family say they will not let the experience ruin what has become an annual tradition celebrating Mari Orosa&#39;s July 4 birthday in Carmel Valley.   RELATED:  Young Black girls called &#39;N-word&#39; by white Berkeley resident, climbing coach says  Raymond Orosa and his family were having dinner at Carmel Valley restaurant Lucia. &#34;We were there just celebrating, having fun,&#34; said Orosa.  The fun quickly disappeared as the man at the table next to them began ranting. &#34;Suddenly I hear this loud voice, you know like f&#39;ing Asians,&#34; said Orosa.   Raymond&#39;s niece Jordan Chan, recorded what happened next on her cellphone.  &#34;Say it again, now, you&#39;re shy,&#34; said Chan in the video.   VIDEO:  Man fired after blocking Latino man from entering his own apartment building    Michael Lofthouse gave the family the finger, then said, &#34;Trump&#39;s gonna f--- you. You f------ need to leave. You f------ Asian piece of s----.&#34;  &#34;He was full of hate and anger,&#34; said Orosa. &#34;It&#39;s sad that there are still people that are like that in this world, let alone in this country,&#34; he continued.   A Lucia employee quickly stepped in. &#34;Get out, you are not allowed here. You do not talk to our guests like that. They are valued guests. Get out!&#34;  &#34;I admire her for that,&#34; said Orosa.   WATCH:  &#39;Race &amp; Coronavirus: A Bay Area Conversation&#39; virtual town hall about COVID-19 impact on Asian American community  In an emailed statement, the vice president and general manager of Bernardus Lodge and Spa, Sean Damery, writes, &#34;This is an extremely unfortunate situation, however we are proud of our staff at Lucia in keeping with Bernardus Lodge&#39;s core values; this incident was handled swiftly and the diner was escorted off property without further escalation. We provide guests with a safe environment for lodging and dining, and extend our sincere apologies to the guests enjoying a birthday celebration on a holiday weekend.&#34;  Michael Lofthouse also issued a statement, writing, &#34;My behavior in the video is appalling. This was clearly a moment where I lost control and made incredibly hurtful and divisive comments. I would like to deeply apologize to the Chan family. I can only imagine the stress and pain they feel. I was taught to respect people of all races, and I will take the time to reflect on my actions and work to better understand the inequality that so many of those around me face every day.&#34;  &#34;He&#39;s just saving face. I think he really meant what he said and what he did,&#34; said Orosa.   &#34;I don&#39;t believe his words because his actions speak louder than the words he&#39;s saying,&#34; he continued.  Orosa says those actions, in part, include additional Instagram comments that appear to have been posted by Lofthouse directed at one of the family&#39;s supporters that include &#34;Asian expletive&#34; and &#34;come near me or my people and you are expletive dead.&#34;   VIDEO:  Berkeley mom films confrontation with white man who ripped down Black Lives Matter signs    Lofthouse did not respond to a request for an additional comment about the Instagram posts or his role as Solid8 CEO, a San Francisco-based tech company.  &#34;I can&#39;t say what he did was acceptable or right, it isn&#39;t, because a lot of people will probably disagree with me for saying I forgive him... but I do,&#34; said Orosa.  Orosa says he and his wife have been in America going on 26 years and they&#39;ve never felt anything remotely close to racism until that night. He says he hopes it never happens to them or anyone else again.   VIDEO:  What motivates a &#39;Karen&#39;? Experts weigh in on popular term", "posttime": "2020-07-08 20:16:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,科技,francisco,奥罗萨", "title": "旧金山科技公司首席执行官在种族主义咆哮后被赶出餐厅", "title_en": "San Francisco tech CEO kicked out of restaurant following racist rant", "transed": 1, "url": "https://abc13.com/tech-ceo-michael-lofthouse-carmel-valley-ca-racist-solid-8-consulting-lucia-restaurant/6305369/", "via": "", "real_tags": ["旧金山", "科技", "francisco", "奥罗萨"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国马萨诸塞州波士顿，第29届USENIX安全研讨会(USENIX Security 20)论文集实用符号执行的一个主要障碍是速度，特别是与模糊测试等接近本地速度的解决方案相比。我们提出了一种基于编译的符号执行方法，其性能比最先进的实现要好几个数量级。我们介绍了SymCC，这是一个基于LLVM的C和C++编译器，它将并发执行直接构建到二进制文件中。软件开发人员可以将其用作clang和clang++的临时替代，我们将展示如何轻松添加对其他语言的支持。与KLEE相比，SymCC的速度提高了3个数量级，平均提高了12倍。它的性能也比QSYM高出两个数量级，平均提高了10倍。QSYM是一个最近在其他实现上表现出很大改进的系统。在实际软件上使用它，我们发现我们的方法始终实现了更高的覆盖率，我们在经过严格测试的OpenJPEG项目中发现了两个漏洞，这两个漏洞已经得到项目维护人员的确认，并分配了CVE标识符。\nSymCC是一个基于编译器的快速符号执行引擎。在这一页上，我们提供了SymCC的源代码，白皮书中描述的实验的原始结果，以及如何自己复制这些实验的说明。\n在本文中，我们描述了两组实验：首先在CGC程序上对SymCC进行基准测试，然后在真实软件上运行它。本节介绍如何复制我们的实验，并提供指向我们结果的链接。\n我们通过BITS的方式使用了CGC程序的Linux移植。构建SymCC时需要支持32位编译(请参阅docs/32-bit.txt；这不是Dockerfile的一部分，因为它将使容器的构建时间翻一番，同时只为少数用户提供价值)。然后，您可以简单地将cc=/path/导出到/symcc，cxx=/path/导出到/sym++和SYMCC_NO_SYMBOL_INPUT=1，并照常构建CGC程序(即通过调用它们的build.sh脚本)。\n在SYMCC_NO_SYMBOL_INPUT=1的原始POV输入上运行程序以测量纯执行时间，并取消设置用于符号执行的环境变量。为了评估覆盖范围，我们在每个生成的输入上运行AFL-showmap和AFL仪表化的CGC计划，并累计每个计划的结果覆盖图，从而为每个CGC计划生成一组覆盖的图条目。然后，可以将这些集合的大小输入到论文中提出的评分公式中。\n对于Klee和QSYM，我们使用了这里描述的设置，但是使用了由cb-multios构建的常规32位二进制文件。\n真实软件的分析总是遵循相同的过程。假设您已经导出了CC=symcc，cxx=sym++和SYMCC_NO_SYMBOL_INPUT=1，首先下载代码，然后使用自己的构建系统构建它，最后取消设置SYMCC_NO_SYMBOL_INPUT并与AFL协同分析程序(这需要为AFL第二次构建，请参见docs/Fuzzing.txt)。我们使用AFL 2.56B并使用AFL_USE_ASAN=1构建目标。请注意，Fuzing辅助对象已经安装在Docker容器中。\nOpenJPEG(我们的结果)：我们使用修订版1f1e9682，使用CMake构建，如项目的INSTALL.md中所述(添加-DBUILD_Thirdparty=on以确保第三方库也使用SymCC编译)，并分析bin/opj_despress-i@@-o/tmp/image.pgm；语料库由测试文件file1.jp2和file8.jp2组成。\nlibarchive(我们的结果)：我们使用修订版9ebb2484，按照Poject&#39；安装中的描述使用CMake构建(但添加了-DCMAKE_BUILD_TYPE=RELEASE)，并分析了bin/bsdtar TF@@；语料库只由一个包含字符&#34；A&#34；的虚拟文件组成。\ntcpdump(我们的结果)：我们构建了tcpdump和libpcap；为了让前者找到后者，只需将源目录紧挨着放在同一文件夹中。我们使用libpcap的修订版d615abec和tcpdump的修订版d57927e1。我们首先使用./configure&amp；&amp；make构建libpcap，然后使用./configure&amp；&amp；make构建tcpdump，并分析tcpdump/tcpdump-e-r@@；语料库只由一个包含字符&#34；A&#34；的虚拟文件组成。\n所有实验均使用一个AFL主进程、一个辅助AFL进程和一个SymCC进程。我们让它们运行24小时，并将每一个重复30次，以创建本文中的图形；AFL贴图密度是从二级AFL过程的lot_data文件中提取的，列map_size。\nQSYM实验使用了类似的设置，根据QSYM作者的说明用QSYM替换SymCC，并用AFL运行它。\n如果您有任何不清楚之处或需要更多信息，请随时与我们联系。", "note_en": "Proceedings of the 29th USENIX Security Symposium (USENIX Security 20), Boston, MA, USA      A major impediment to practical symbolic execution is speed, especially when compared to near-native speed solutions like fuzz testing. We propose a compilation-based approach to symbolic execution that performs better than state-of-the-art implementations by orders of magnitude. We present SymCC, an LLVM-based C and C++ compiler that builds concolic execution right into the binary. It can be used by software developers as a drop-in replacement for  clang and  clang++, and we show how to add support for other languages with little effort. In comparison with KLEE, SymCC is faster by up to three orders of magnitude and an average factor of 12. It also outperforms QSYM, a system that recently showed great performance improvements over other implementations, by up to two orders of magnitude and an average factor of 10. Using it on real-world software, we found that our approach consistently achieves higher coverage, and we discovered two vulnerabilities in the heavily tested OpenJPEG project, which have been confirmed by the project maintainers and assigned CVE identifiers.\n    SymCC is a fast compiler-based symbolic execution engine. On this page, we provide SymCC&#39;s source code, the raw results of the experiments described in the paper, as well as instructions how you can replicate those experiments yourself.\n        In the paper, we describe two sets of experiments: we first benchmark SymCC on the CGC programs, then we run it on real-world software. This section describes how to replicate our experiments, and provides links to our results.\n  We used the  Linux port of the CGC programs by Trail of Bits. SymCC needs to be built with support for 32-bit compilation (see  docs/32-bit.txt; this is not part of the Dockerfile because it would double the build time of the container while providing value to just a few users). Then you can simply export  CC=/path/to/symcc,  CXX=/path/to/sym++ and  SYMCC_NO_SYMBOLIC_INPUT=1, and build the CGC programs as usual (i.e., by invoking their build.sh script).\n  Run the programs on the raw PoV inputs with  SYMCC_NO_SYMBOLIC_INPUT=1 to measure pure execution time, and unset the environment variable for symbolic execution. To assess coverage, we ran  afl-showmap with the AFL-instrumented CGC programs on each generated input and accumulated the resulting coverage maps per program, resulting in a set of covered map entries for each CGC program. The sizes of those sets can then be fed to the scoring formula presented in the paper.\n  For KLEE and QSYM, we used the setup described  here but with the regular 32-bit binaries built by cb-multios.\n  The analysis of real-world software always follows the same procedure. Assuming you have exported  CC=symcc,  CXX=sym++ and  SYMCC_NO_SYMBOLIC_INPUT=1, first download the code, then build it using its own build system, finally unset  SYMCC_NO_SYMBOLIC_INPUT and analyze the program in concert with AFL (which requires building a second time for AFL, see  docs/Fuzzing.txt). We used AFL 2.56b and built the targets with  AFL_USE_ASAN=1. Note that the fuzzing helper is already installed in the Docker container.\n  OpenJPEG ( our results): we used revision  1f1e9682, built with CMake as described in the project&#39;s  INSTALL.md (adding  -DBUILD_THIRDPARTY=ON to make sure that third-party libraries are compiled with SymCC as well), and analyzed  bin/opj_decompress -i @@ -o /tmp/image.pgm; the corpus consisted of test files  file1.jp2 and  file8.jp2.\n  libarchive ( our results): we used revision  9ebb2484, built with CMake as described in the poject&#39;s  INSTALL (but adding  -DCMAKE_BUILD_TYPE=Release), and analyzed  bin/bsdtar tf @@; the corpus consisted of just a single dummy file containing the character &#34;A&#34;.\n  tcpdump ( our results): we built both tcpdump and libpcap; in order to make the former find the latter, just place the source directories next to each other in the same folder. We used revision  d615abec of  libpcap and revision  d57927e1 of  tcpdump. We built first libpcap and then tcpdump with  ./configure &amp;&amp; make, and analyzed  tcpdump/tcpdump -e -r @@; the corpus consisted of just a single dummy file containing the character &#34;A&#34;.\n  All experiments used one AFL master process, one secondary AFL process, and one SymCC process. We let them run for 24 hours and repeated each of them 30 times to create the graphs in the paper; AFL map density was extracted from the secondary AFL process&#39;  plot_data file, column  map_size.\n  The QSYM experiments used an analogous setup, replacing SymCC with QSYM and running it with AFL according to the QSYM authors&#39;  instructions.\n        Feel free to  reach out to us if anything is unclear or if you need more information.", "posttime": "2020-07-08 19:55:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,symcc,execution", "title": "使用SymCC执行符号：不解释，编译", "title_en": "Symbolic execution with SymCC: Don't interpret, compile", "transed": 1, "url": "http://www.s3.eurecom.fr/tools/symbolic_execution/symcc.html", "via": "", "real_tags": ["编译", "symcc", "execution"]}, {"category": "", "categoryclass": "", "imagename": "0f21eb0e372ae0f2b44c8ba830520a3b.png", "infoid": 1010518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊Fire TV已经以类似的方式提供了与其他近20个应用程序的集成，包括Philo和Pluto TV等直播电视应用程序，以及它自己的Prime Video频道。\n但是，Sling TV、YouTube TV和Hulu+Live TV的加入带来了三款最大、最受割绳用户欢迎的应用程序，他们正在为直播电视体验买单。Sling TV拥有231万订户；YouTube TV拥有200多万订户；Hulu+Live TV拥有330万订户。\n这些应用程序的实时内容可以在三个主要部分找到：Live标签、“On Now”行和多应用程序频道指南。\n多年来，通过互联网直播电视已经成为剪线者更受欢迎的选择，因为它提供了一种更便宜的方式来获得类似有线电视的体验。不幸的是，这一差距近几个月来一直在缩小，因为随着服务扩大他们的频道阵容，直播电视用户受到了持续的价格上涨的影响。\n然而，许多直播电视客户仍然留下来，因为即使提高了价格，它仍然可以略低于有线电视，并提供更大的灵活性-就像跨平台工作，而不是绑定到电缆盒。\n该公司指出，由于集成了直播内容，Live标签已成为Fire TV界面上访问量仅次于主屏幕的第二大目的地。此外，自从Fire TV添加了直播电视发现集成以来，Fire TV上的直播流媒体应用程序在应用程序和活跃客户上花费的总时间平均翻了一番以上。\n“Fire TV在菲罗的粉丝中非常受欢迎。Philo首席执行官安德鲁·麦科勒姆(Andrew McCollum)说，自从集成了亚马逊的直播发现功能以来，Philo在Fire TV上的活跃用户数量增加了近2.5倍。他的电视流媒体应用程序是Fire TV较早增加的应用程序之一。\n要使用新的集成，你首先需要登录到你使用当前帐户信息订阅的流媒体应用。然后你就可以通过Live Tab访问应用程序的实时内容，该选项卡以熟悉的类似Netflix的可滚动行的样式组织实时内容。这里有像“体育直播”和“新闻直播”这样的内容行，加上来自您订阅频道的内容。\n从这里，你可以跳到频道指南，它提供了更传统的网格指南，类似于有线电视。\n例如，周一，Roku推出了自己的直播电视频道指南，可以通过一个新的磁贴访问，允许Roku用户以类似的方式浏览Roku提供的免费直播和线性内容。\n这意味着用户可以要求Alexa打开频道指南，甚至可以通过说“Alexa，调谐到[频道名称]”来更换频道。这是通过Fire TV Cube上内置的Alexa，通过配对的Echo设备，或者使用Fire TV的Alexa语音遥控器来实现的，具体取决于您的设置。\nFire TV副总裁桑迪普·古普塔(SanDeep Gupta)在一份声明中表示：“我们很高兴欢迎Sling TV、Hulu+Live TV和YouTube TV加入我们的Live TV发现功能集成套件。”他补充说：“我们相信，联网电视的未来将带来直播内容，简化流媒体和OTT格局，并使客户能够轻松地发现他们想要观看的节目。”\n亚马逊澄清说，Sling TV的整合于今年早些时候开始推出，但今天正式宣布。\nYouTube电视将从今天开始提供，Hulu+Live TV将在未来几周内提供。", "note_en": "Already, Amazon Fire TV had offered integrations with nearly 20 other apps in a similar fashion, including live TV apps like Philo and Pluto TV, as well as its own Prime Video Channels.\n But the addition of Sling TV, YouTube TV and Hulu + Live TV brings in the three largest and most popular apps among cord cutters who are paying for a live TV experience.  Sling TV has 2.31 million subscribers;  YouTube TV has over 2 million; and  Hulu + Live TV has 3.3 million.\n  Live content from these apps will be found within three main sections: the Live tab, the “On Now” rows and the multi-app Channel Guide.\n Streaming live TV over the internet has become a more popular option for cord cutters over the years, as it offers a less expensive way to have a cable TV-like experience. Unfortunately,  that gap has been closing in more recent months, as live TV users have been subjected to continual price increases as the services expanded their channel lineups.\n However, many live TV customers remain because even with the increases, it can still be slightly less than cable and offers more flexibility — like working across platforms and not tied to a cable box.\n  The Live tab has become the second-most-visited destination on the Fire TV interface after the Home screen, due to its integrations of live content, the company noted. In addition, live TV streaming apps on Fire TV have seen the total time spent in app and active customers more than double, on average, since Fire TV added its live TV discovery integrations.\n  “Fire TV is hugely popular among Philo fans. Since integrating with Amazon’s live streaming discovery features, the number of active Philo users is up nearly 2.5x on Fire TV,” said Philo CEO Andrew McCollum, whose TV streaming app was one of the earlier additions to Fire TV.\n To use new integrations, you’ll first need to log into the streaming app you subscribe to with your current account information. You can then access the app’s live content across the Live Tab, which organizes live content in the familiar Netflix-like style of scrollable rows. Here, there are rows for things like “Live Sports” and “Live News,” plus content from your subscriptions’ channels.\n From here, you can hop into the Channel Guide, which offers the more traditional grid guide, similar to cable TV.\n  On Monday, for example,  Roku introduced its own Live TV Channel Guide, accessible via a new tile, which allows Roku users to browse the free live and linear content Roku offers in a similar way.\n   That means users can ask Alexa to open the Channel Guide or even change the channel, by saying “Alexa, tune to [name of channel],” for example. This works via built-in Alexa on the Fire TV Cube, via a paired Echo device, or by using the Fire TV’s Alexa Voice Remote, depending on your setup.\n “We’re excited to welcome Sling TV, Hulu + Live TV, and YouTube TV into our integrated suite of Live TV discovery features,” said Sandeep Gupta, VP of Fire TV, in a statement. “We believe the future of Connected TV is one that brings live content forward, simplifies the streaming and OTT landscape, and enables customers to discover the programs they want to watch with ease,” he added.\n Sling TV’s integration began rolling out earlier this year, Amazon clarifies, but is being officially announced today.\n YouTube TV will be available starting today, and Hulu + Live TV will become available in the coming weeks.", "posttime": "2020-07-08 19:18:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,amazon,tv", "title": "\nAmazon Fire TV现在从Sling TV、YouTube TV和Hulu+Live TV吸引直播电视内容", "title_en": "\n\t\t\t\tAmazon Fire TV now pulls in live TV content from Sling TV, YouTube TV and Hulu + Live TV\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/amazon-fire-tv-now-pulls-in-live-tv-content-from-sling-tv-youtube-tv-and-hulu-live-tv/", "via": "", "real_tags": ["youtube", "amazon", "tv"]}]