[{"category": "", "categoryclass": "", "imagename": "061b71868ffd05cd140ae869a1366e5e.png", "infoid": 1071833, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "毫不奇怪，近 60% 的受访者从在线资源中学习了如何编码。年轻的受访者倾向于从在线课程、论坛和其他在线资源中学习。另一方面，年长的受访者从学校和书籍等更传统的媒介中学习。学习如何编码 → AWS 保持其作为使用最广泛的云平台的领先地位，但谷歌云和微软 Azure 比去年取得了巨大的进步。值得注意的是，这是我们第一次从我们的通用平台问题中把云平台拆分出来。云平台 → 新人 Svelte 位居榜首，成为最受喜爱的框架。 React 是最需要的，也是四分之一的开发人员想要的。 Web 框架 → Perl 从去年收入最高的语言变成了今年收入第五高的语言。 Clojure 开发人员的工资中位数最高，比 F# 的第二名高出 14k。\n高薪技术 → 81% 的专业开发人员是全职员工，低于 2020 年的 83%。自称是独立承包商、自由职业者或个体经营者的专业开发人员比例从 2020 年的 9.5% 增加到 2020 年的 11.2% 2021 - 表明潜在的工作不安全或转向更灵活的工作安排。就业状况 → 美国和印度继续提供最多的调查回复，其次是德国和 UKI（英国和爱尔兰）。排名前十的国家占所有受访者的近 60%。要查看排名前十的国家，请参阅方法部分。当我们放大美国（我们的回应率最高的国家）时，我们发现拥有成熟技术中心的州的受访者最多：加利福尼亚州、纽约州、华盛顿州和德克萨斯州。程序员从年轻开始：超过 50% 的受访者在 11 到 17 岁之间编写了他们的第一行代码。几乎 60% 的受访者从在线资源中学习如何编码也就不足为奇了。年轻的受访者倾向于从在线课程、论坛和其他在线资源中学习。另一方面，年长的受访者从学校和书籍等更传统的媒介中学习。 50% 的受访者已经编码十年或更短。平均而言，来自英国的受访者在我们排名前十的国家中编码的年数最长。\n大多数受访者作为专业开发人员已经工作了十年或更短的时间，这意味着他们从未在没有 Stack Overflow 的世界中工作过。担任更高级角色的开发人员拥有最多多年的专业编码经验。与此同时，数据科学家和机器学习专家的经验最少，年数少于学术研究人员。全栈、后端、前端和桌面开发人员继续占所有受访者的大多数。 70% 的受访者和 80% 的专业开发人员完成了某种形式的高等教育，学士学位是最常见的。 48% 的专业开发人员年龄在 25-34 岁之间。在 65 岁或以上的受访者中，几乎有一半不认为自己是专业开发人员。 91% 的受访者和 92% 的专业开发人员认为自己是男性。美国的性别少数群体（女性、非二元、性别酷儿或性别不一致）的比例最高。我们有大量工作要做，以确保我们的平台具有包容性，并且我们的调查能够代表各地的开发人员。 11.5% 的受访者认为自己不是异性恋/异性恋，6.5% 的受访者表示不认同任何取向。要确保开发者社区更具包容性，还有很多工作要做。\n2,960 名受访者存在身体差异，其中大多数受访者失明或视力不佳。超过 16,000 名受访者回答了我们关于心理健康的问题，几乎 10% 的受访者表示他们应对焦虑。 JavaScript 连续第九年成为最常用的编程语言。对于大多数开发人员来说，编程就是网络编程。 Python 与 SQL 交换了位置，成为第三大流行语言。最常见的数据库在所有受访者和专业开发人员之间是一致的。我们观察到的唯一区别是，专业开发人员更倾向于使用 Microsoft SQL Server 而不是 MongoDB。 AWS 保持其作为使用最广泛的云平台的领先地位，但谷歌云和微软 Azure 比去年取得了可观的收益。值得注意的是，这是我们第一次从我们的通用平台问题中把云平台拆分出来。 .NET 框架在其他技术中最受喜爱，尽管一些 Python 的数据科学库表现出色。超过 90% 的受访者使用 Git，这表明它是成为开发人员的基本工具。\nVisual Studio Code 作为所有开发人员的首选 IDE，具有显着的领先优势。 Windows 仍然是最受欢迎的操作系统，尽管在专业开发人员中略逊一筹。今年也是我们第一次添加 WSL 作为选项。第六年，Rust 是最受欢迎的语言，而 Python 是第五年最受欢迎的语言。 82,914 回复 未使用该语言或技术进行开发但表示有兴趣使用该语言或技术进行开发的开发人员的百分比 Redis 已连续第五年成为最受欢迎的数据库。 PostgreSQL 勉强超过 MongoDB，成为最受欢迎的数据库。 IBM DB2 连续第二年成为最可怕的数据库。 72,517 回复 未使用该语言或技术进行开发但表示有兴趣使用该语言或技术进行开发的开发人员的百分比 AWS 不仅是最受欢迎的云平台，也是最受欢迎的云平台。\n60,516 回复 未使用该语言或技术进行开发但表示有兴趣使用该语言或技术进行开发的开发人员的百分比 新人 Svelte 位居榜首，成为最受欢迎的框架。 React 是最需要的，也是四分之一的开发人员想要的。 66,202 回复 未使用该语言或技术进行开发但表示有兴趣使用该语言或技术进行开发的开发人员百分比 虽然 Tensorflow 是最受欢迎的库，但 Pytorch 是一个更受喜爱的库。作为 Stack Overflow 的 .NET Core 用户，我们很高兴看到它位居榜首。 58,282 回复 未使用该语言或技术进行开发但表示有兴趣使用该语言或技术进行开发的开发人员的百分比 早些时候，我们看到 93% 的受访者使用 Git。现在我们看到 85% 的受访者希望继续使用 Git。 Git、Docker 和 Kubernetes 都是最受欢迎和最想要的工具。 75,793 回复 未使用该语言或技术进行开发但表示有兴趣使用该语言或技术进行开发的开发人员百分比\n81,838 回复 未使用该语言或技术进行开发但表示有兴趣使用该语言或技术进行开发的开发人员百分比 这里有很多内容需要解开，但这里有一些我们发现的最显着趋势。有超过 10k Javascript 开发人员想要开始或继续使用 Go 或 Rust 进行开发。大多数想要使用 Dart 的开发人员目前都在使用 JavaScript。我们还看到唯一想使用 PHP 的开发人员是 SQL 开发人员。 12,590 名 MySQL 开发人员希望使用 PostgreSQL，而 6,429 名 PostgreSQL 开发人员希望使用 MySQL。虽然 AWS 是最受欢迎的平台，但我们看到明年有大量 AWS 开发人员希望在 Google Cloud 中进行开发。 8,586 名 AWS 开发人员希望使用 Google Cloud，而只有 7,668 名 Google Cloud 开发人员希望在 AWS 中工作。目前使用 Heroku 或 Digital Ocean 的开发人员更喜欢开始使用或继续使用 AWS，然后是 Google Cloud，最后是 Azure。目前使用 Azure 的开发人员很少想迁移到 Heroku。 Django、Flask 和 Spring 开发人员满足于继续在各自的框架中工作。很少有开发人员想要使用 ASP.NET。想要在 Hadoop 中工作的开发人员目前正在使用 Pandas 或 Numpy。有 3,328 名 Tensorflow 开发人员希望继续使用 PyTorch，但只有 2,328 名 Pytorch 开发人员希望转向 Tensorflow。我们看到 IPython/Jupyter 用户想要在 VS Code 中工作。这可能是由于 VS Codes 在他们的 IDE 中添加了 Notebook API。\nPerl 从去年收入最高的语言变成了今年收入第五高的语言。 Clojure 开发人员的工资中位数最高，比 F# 的第二名高出 14k。 81% 的专业开发商是全职员工，比 2020 年的 83% 有所下降。自称是独立承包商、自由职业者或个体经营者的专业开发商比例从 2020 年的 9.5% 增加到 2021 年的 11.2% - 表明潜力工作不安全或转向更灵活的工作安排。与去年相比，来自印度的受雇全职受访者的百分比下降了 15 个百分点。相比之下，学生人数增加了 9 个百分点。总体而言，工程经理、SRE、DevOps 专家和数据工程师的薪水往往最高。在关注美国时，我们会发现薪资范围的底部存在一些差异。在美国，与全球开发人员相比，移动开发人员和教育工作者的薪水往往高于其他职业。尽管工程经理、SRE、DevOps 专家角色的薪酬最高，但我们看到他们平均也拥有超过 10 年的专业经验。数据科学家或机器学习专家的薪酬排名第 8，但平均而言，他们的经验最少。设计师虽然平均拥有 10 年以上的经验，但收入却是最低的。不到 1% 的受访者从未访问过 Stack Overflow 或 Stack Exchange Network。我们知道开发人员经常访问 Stack Overflow，今年早些时候，我们确认他们复制代码的次数也一样多。从今年的调查中，我们还知道 80% 的受访者每周访问 Stack Overflow，其中 55% 每天访问。\n在拥有 Stack Overflow 帐户的人中，46% 的人每月或每月访问该网站的次数少于一次。只有 44% 的受访者认为自己“有点”或“肯定”是 Stack Overflow 社区的成员。在这些受访者中，我们看到性别少数群体不太可能认为自己是 Stack Overflow 社区的成员。 79,517 回复 在所有受访者中，认为自己肯定或在某种程度上属于 Stack Overflow 社区的一部分的百分比。近 25,000 名受访者属于其他在线开发者社区。其中85%对公众开放，任何人都可以加入。这些其他社区中的大多数都属于 Reddit、Github 或 Discord。本报告基于对来自全球 181 个国家/地区的 83,439 名软件开发人员的调查。这是我们根据在完整、完整的调查上花费的时间，出于分析目的而认为“合格”的答复数量；另有大约 172 份回复被提交但未包括在分析中，因为受访者在调查中花费的时间不到三分钟。受访者主要通过 Stack Overflow 拥有的渠道招募。受访者的主要来源是现场消息、博客文章、电子邮件列表、横幅广告和社交媒体帖子。由于受访者是以这种方式招募的，因此 Stack Overflow 上参与度高的用户更有可能注意到在馆藏推广期间进行调查的提示。作为奖励，完成调查的受访者可以在完成调查后选择加入“人口普查”徽章。\n由于美国的运输/出口制裁，克里米亚、古巴、伊朗、朝鲜和叙利亚的潜在受访者无法访问我们的调查，因为我们的第三方调查软件阻止了流量。虽然一些受访者使用 VPN 来绕过障碍，但在解释调查结果时应牢记这一限制。许多问题仅根据受访者之前的回答显示给受访者。例如，有关工作和工作的问题只显示给那些说他们在工作的人。我们向受访者询问了他们的薪水。首先，我们询问每个受访者通常使用什么货币。然后我们询问受访者他们以该货币计算的工资是多少，以及该工资是每周、每月还是每年。与调查中的大多数问题一样，薪资问题是可选的。有 46,844 名受访者向我们提供了薪资数据。我们使用 2021-06-16 的汇率将工资从用户货币转换为美元，并假设 12 个工作月和 50 个工作周转换为年薪。美国境内外约 2% 的最高工资被削减并替换为阈值。美国境内外的阈值不同。为了确定今年的调查中包含哪些技术，我们查看了 Stack Overflow 上最受欢迎和增长最快的标签（就发布的问题而言）。我们将这些与去年包含的技术进行了比较，并研究了有多少人选择了每个选项。我们将所有这些综合在一起，以策划要包含的技术集合。\n这些问题被组织成几个问题块，这些问题是按顺序随机排列的。此外，大多数问题的答案都是按顺序随机分配的。大多数受访者认为今年的调查时间长度合适。不到 1% 的受访者认为今年的调查很困难。我不是主要的开发人员，但有时我会写代码作为我工作的一部分", "note_en": "It is no surprise that almost 60% of respondents learned how to code from online resources. Younger respondents tend to learn from online courses, forums, and other online resources. Older respondents, on the other hand, learned from more traditional mediums like school and books.\n   Learning how to code  →\n  AWS maintains its lead as the most widely used cloud platform, but Google Cloud and Microsoft Azure made substantial gains from last year. It is worth noting that this is the first year that we broke out cloud platforms from our general platforms question.\n   Cloud platforms  →\n    Newcomer Svelte takes the top spot as the most loved framework. React is the most wanted, desired by one in four developers.\n   Web frameworks  →\n  Perl moves from being the highest-paid language last year to the fifth highest-paid this year. Clojure developers have the highest median salary, 14k more than second place which belongs to F#.\n   Top paying technologies  →\n  81% of professional developers are employed full-time, a decrease from 83% in 2020. The percentage of professional developers saying they were independent contractors, freelancers, or self-employed increased from 9.5% in 2020 to 11.2% in 2021 - indicating potential job insecurity or a shift to more flexible work arrangements.\n   Employment status  →\n  The United States and India continue to provide the highest volume of survey responses, followed by Germany and UKI (UK and Ireland). The top ten countries account for almost 60% of all respondents. To see the top ten countries, refer to the methodology section. When we zoom into the United States (our top-responding country), we see that the states with established tech hubs have the most respondents: California, New York, Washington, and Texas.\n  Coders start young: over 50% of respondents wrote their first line of code between the ages of 11 to 17.\n  It is no surprise that almost 60% of respondents learned how to code from online resources. Younger respondents tend to learn from online courses, forums, and other online resources. Older respondents, on the other hand, learned from more traditional mediums like school and books.\n  50% of respondents have been coding for ten years or less. Respondents from the United Kingdom, on average, have the most years coding out of our top ten countries.\n  A majority of respondents have been working for ten or less years as a professional developer, meaning they’ve never worked in a world without Stack Overflow.\n  Developers in more senior roles have the most years of coding professionally. Data scientists and machine learning specialists, meanwhile, have the least experience, with fewer years than academic researchers.\n  Full stack, back-end, front-end, and desktop developers continue to account for the majority of all respondents.\n  70% of all respondents and 80% of professional developers have completed some form of higher education, a bachelor’s degree being the most common.\n  48% of professional developers are 25-34 years old. Almost half of the respondents 65 years or older do not consider themselves professional developers.\n  91% of all respondents and 92% of professional developers identify as a man. The United States has the highest percentage of gender minorities (Woman, Non-binary, genderqueer, or gender non-conforming). We have considerable work to do to ensure our platform is inclusive and that our survey is representative of developers everywhere.\n    11.5% of respondents identify as something other than straight / heterosexual, with 6.5% preferring not to identify with any orientation. There’s still so much work to be done to ensure the developer community is more inclusive.\n    2,960 respondents have a physical difference, with the majority of these respondents being blind or having difficulty seeing.\n  Over 16,000 respondents replied to our question on mental health, with almost 10% of all respondents indicating they deal with anxiety.\n  JavaScript completes its ninth year in a row as the most commonly used programming language. For most developers, programming is web programming. Python traded places with SQL to become the third most popular language.\n  The most common databases are consistent between all respondents and professional developers. The only difference we observed is that professional developers are slightly more likely to use Microsoft SQL Server over MongoDB.\n  AWS maintains its lead as the most widely used cloud platform, but Google Cloud and Microsoft Azure made substantial gains from last year. It is worth noting that this is the first year that we broke out cloud platforms from our general platforms question.\n    The .NET framework gets the most love in other technologies, though several data science libraries for Python make strong showings.\n  Over 90% of respondents use Git, suggesting that it is a fundamental tool to being a developer.\n  Visual Studio Code has a significant lead as the IDE of choice across all developers.\n  Windows continues to be the most popular operating system, though slightly less so among professional developers. This year was also the first time we added WSL as an option.\n  For the sixth-year, Rust is the most loved language, while Python is the most wanted language for its fifth-year.\n  82,914 responses  % of developers who are not developing with the language or technology but have expressed interest in developing with it\n  Redis is in its fifth year as the most loved database. PostgreSQL barely passes MongoDB with less than a percent as the most wanted database. And IBM DB2 is on its second year in a row as the most dreaded database.\n  72,517 responses  % of developers who are not developing with the language or technology but have expressed interest in developing with it\n  AWS is leading as not only the most loved cloud platform but also the most wanted.\n  60,516 responses  % of developers who are not developing with the language or technology but have expressed interest in developing with it\n  Newcomer Svelte takes the top spot as the most loved framework. React is the most wanted, desired by one in four developers.\n  66,202 responses  % of developers who are not developing with the language or technology but have expressed interest in developing with it\n  While Tensorflow is the most wanted library, Pytorch is a more loved library. As .NET Core users here at Stack Overflow, we’re pleased to see it in the top spot.\n  58,282 responses  % of developers who are not developing with the language or technology but have expressed interest in developing with it\n  Earlier, we saw that Git was used by 93% of all respondents. Now we saw that 85% of those respondents want to continue working with Git. Git, Docker, and Kubernetes are both the most loved and most wanted tools.\n  75,793 responses  % of developers who are not developing with the language or technology but have expressed interest in developing with it\n  81,838 responses  % of developers who are not developing with the language or technology but have expressed interest in developing with it\n  There is a lot to unpack here, but here are some of the most notable trends we uncovered. There are over 10k Javascript developers that want to start or continue developing in Go or Rust. The majority of developers that want to use Dart are currently using JavaScript. We also see the only developers that want to work in PHP are SQL developers.\n  12,590 MySQL developers want to work with PostgreSQL, while 6,429 PostgreSQL developers want to work with MySQL.\n  While AWS is the most loved platform, we see a large influx of AWS developers wanting to develop in Google Cloud next year. 8,586 AWS developers want to work with Google Cloud, while only 7,668 Google Cloud developers want to work in AWS. Developers currently using Heroku or Digital Ocean prefer to start working with or continue working with AWS, then Google Cloud, and lastly Azure. Very few developers currently using Azure want to move to Heroku.\n  Django, Flask, and Spring developers are content to continue working in their respective frameworks. Very few developers want to work with ASP.NET.\n  The developers who want to work in Hadoop are currently using Pandas or Numpy. There and 3,328 Tensorflow developers that want to continue to use PyTorch, but only 2,328 Pytorch developers that want to move to Tensorflow.\n    We see IPython/Jupyter users want to work in VS Code. This is likely due to VS Codes adding a Notebook API to their IDE.\n    Perl moves from being the highest-paid language last year to the fifth highest-paid this year. Clojure developers have the highest median salary, 14k more than second place which belongs to F#.\n  81% of professional developers are employed full-time, a decrease from 83% in 2020. The percentage of professional developers saying they were independent contractors, freelancers, or self-employed increased from 9.5% in 2020 to 11.2% in 2021 - indicating potential job insecurity or a shift to more flexible work arrangements.\n  The percent of employed full-time respondents from India decreased by 15 percentage points compared to last year. In contrast, the number of students increased by 9 percentage points.\n    Across the board, engineering managers, SREs, DevOps specialists, and data engineers tend to receive the highest salaries. When focusing on the US, we see some differences at the bottom of the salary spectrum. In the US, mobile developers and educators tend to have a higher salary relative to other occupations when compared to the global developer population.\n  Even though Engineering managers, SREs, DevOps specialist roles pay the most, we see they also have, on average, over ten years of professional experience. Data scientists or machine learning specialists are the 8th most paid but, on average, have the fewest years of experience. Designers are the lowest paid even though they have over ten years of experience on average.\n  Less than 1% of respondents have never visited Stack Overflow or the Stack Exchange Network.\n  We know that developers visit Stack Overflow a lot, and earlier this year, we confirmed that they copy code just as much. From this year’s survey, we also know that 80% of respondents visit Stack Overflow weekly, and 55% of them visit daily.\n    Of those with a Stack Overflow account, 46% are participating on the site less than once per month or monthly.\n  Only 44% of respondents consider themselves “somewhat” or “definitely” a member of the Stack Overflow community. Of these respondents, we see that gender minorities are less likely to consider themselves a member of the Stack Overflow community.\n  79,517 responses  Percent who consider themselves definitely or somewhat part of the Stack Overflow community out of all respondents.\n  Almost 25 thousand respondents belong to other online developer communities. 85% of the them are open to the public for anyone to join. The majority of these other communities belong on Reddit, Github or Discord.\n  This report is based on a survey of 83,439 software developers from 181 countries around the world. This is the number of responses we consider “qualified” for analytical purposes based on time spent on the full, completed survey; another approximately 172 responses were submitted but not included in the analysis because respondents spent less than three minutes on the survey.\n      Respondents were recruited primarily through channels owned by Stack Overflow. The top sources of respondents were onsite messaging, blog posts, email lists, banner ads, and social media posts. Since respondents were recruited in this way, highly engaged users on Stack Overflow were more likely to notice the prompts to take the survey over the duration of collection promotion.\n  As an incentive, respondents who finished the survey could opt in to a “Census” badge if they completed the survey.\n  Due to United States transport/export sanctions, our survey was unfortunately unaccessible to prospective respondents in Crimea, Cuba, Iran, North Korea, and Syria, due to the traffic being blocked by our third party survey software. While some respondents used VPNs to get around the block, the limitation should be kept in mind when interpreting survey results.\n  Many questions were only shown to respondents based on their previous answers. For example, questions about jobs and work were only shown to those who said they were working in a job.\n  We asked respondents about their salary. First, we asked what currency each respondent typically used. Then we asked that respondent what their salary was in that currency and whether that salary was weekly, monthly, or yearly.\n  The salary question, like most on the survey, was optional. There were 46,844 respondents who gave us salary data.\n  We converted salaries from user currencies to USD using the exchange rate on 2021-06-16, and also converted to annual salaries assuming 12 working months and 50 working weeks.\n  The top approximately 2% of salaries inside and outside of the US were trimmed and replaced with threshold values. The threshold values for inside and outside the US were different.\n  To identify which technologies to include on the survey this year, we looked at both the most popular and fastest growing tags on Stack Overflow (in terms of questions posted). We compared these to the technologies we included last year and looked at how many people chose each option. We synthesized all this together to curate a collection of technologies to include.\n  The questions were organized into several blocks of questions, which were randomized in order. Also, the answers to most questions were randomized in order.\n  The majority of respondents felt like this year’s survey was an appropriate length.\n  Less than one percent of respondents felt like this year’s survey was difficult.\n  I am not primarily a developer, but I write code sometimes as part of my work", "posttime": "2021-08-07 03:18:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,开发,开发者,wins,开发人员", "title": "Rust 在 2021 年 Stackoverflow 开发者调查中获胜", "title_en": "Rust wins Stackoverflow Developer Survey 2021", "transed": 1, "url": "https://insights.stackoverflow.com/survey/2021", "via": "", "real_tags": ["rust", "开发", "开发者", "wins", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "2694156bd0f320b67ad46ae568fcf779.jpg", "infoid": 1071832, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据新闻媒体 Stuff 报道，新西兰政府周四证实，谷歌联合创始人拉里·佩奇（Larry Page）已获得新西兰居留权，他是世界上第六富有的人。有了这个，佩奇加入了越来越多的超级富豪名单，他们正在秘密购买新西兰的居留身份，这是一种世界末日的保险单。自 covid-19 大流行开始以来，新西兰的边界一直受到严格控制，当有消息称美国人佩奇可能在奥克兰时，记者开始提问。新西兰内政部一夜之间没有回应置评请求。据 Stuff 报道，佩奇于 2020 年 11 月 3 日申请了特殊签证，并于 2021 年 1 月 11 日在他的孩子在斐济生病后首次飞抵该国。 Page 的居留签证被称为 Investor Plus，它允许任何人进入该国，前提是他们有至少 1000 万美元的投资。直到 2021 年 2 月 4 日佩奇进入美国后，签证才获批。据报道，48 岁的佩奇和他生病的孩子被一架新西兰空中救护车从斐济空运到新西兰的 Starship 儿童医院，但政府官员以医疗隐私问题为由拒绝透露佩奇是否自己支付了这次飞行费用.据Stuff称，目前尚不清楚佩奇的孩子患有什么疾病，但佩奇现在可能不在国内，目前还不清楚他可能在哪里。奇怪的是，新西兰政府本周早些时候向 Stuff 否认佩奇是该国居民，但最终商业、创新和就业部承认，他最近收到了他的特殊签证。据报道，佩奇一到新西兰就被隔离了一段时间，因为每个进入的人都必须这样做，但他的住宿细节尚未公布。例如，目前尚不清楚佩奇在此期间是否被允许亲自看望生病的孩子。新西兰是一个只有 500 万人口的国家，自大流行开始以来已经发生了 2,880 例 covid-19 病例和 26 例死亡，这是世界上感染率和死亡率最低的国家之一。该国的运作基本上就像从未发生过 covid-19 一样，新西兰人对富人在瘟疫期间购买进入该国的方式感到敏感，这是可以理解的。\n佩奇的身价估计为 1210 亿美元，是最新一位被披露为在这个岛国拥有秘密居住地或公民身份的科技亿万富翁，这一直吸引着富有的西方人，他们认为如果社会真的因气候变化而崩溃，他们可以逃离这里。猖獗的疾病，富人的“干草叉”，或任何其他问题。 2017 年，PayPal 的联合创始人兼 Facebook 的早期投资者 Peter Thiel 被透露，在当地人质疑为什么允许他在受保护的土地上拥有房屋后，他已获得新西兰公民身份。蒂尔是前总统唐纳德特朗普及其“美国优先”议程的亲密盟友，显然在加利福尼亚州圣莫尼卡宣誓成为新西兰的公民。由于人口相对较少、可再生能源和充足的淡水供应，新西兰最近被确定为度过世界末日的最佳地点。安格利亚鲁斯金大学全球可持续发展研究所的新研究还包括澳大利亚、英国和爱尔兰等地，但新西兰位居榜首。 《纽约客》在 2017 年报道了大量人口，尤其是富有的美国人和欧洲人，他们在新西兰站稳脚跟，作为他们防止崩溃的保险单。这基本上是富人之间公开的秘密，我们没有太多时间在地球上进行任何“常态”。 LinkedIn 联合创始人里德霍夫曼在 2017 年告诉纽约客：“说你&#39;在新西兰买房子&#39;是一种眨眼，眨眼，别再说了。”佩奇打算在哪里花钱他在新西兰的 1000 万美元，需要在未来三年内在投资者 Plus 签证下发生吗？有传言说他对空中出租车感兴趣。据了解，佩奇对 Wisk Aviation 感兴趣，该公司开发了一种电动自动驾驶飞机，旨在用作空中出租车。该公司的总部设在美国，但在新西兰设有办事处，并将在这里试飞飞机。\n佩奇对该公司的兴趣源于他所支持的航空公司 Kitty Hawk。 Wisk，原名 Zephyr，是波音和 Kitty Hawk 的合资企业。虽然新西兰公民办公室没有回复我们的电子邮件，但该机构在其网站上指出，处理申请的时间比平时长。可能是因为有这么多科技亿万富翁敲门进来。", "note_en": "The government of New Zealand confirmed on Thursday that Google co-founder Larry Page, the sixth wealthiest person in the world, has obtained residency in New Zealand, according to a report from the news outlet    Stuff. And with that, Page joins a growing list of super-wealthy Americans who are secretly buying residency status in New Zealand, a kind of insurance policy for doomsday.\n  New Zealand’s borders have been tightly controlled since the start of the covid-19 pandemic and reporters started asking questions when word got out that Page, an American, might be in Auckland. New Zealand’s Department of Internal Affairs did not respond to a request for comment overnight.\n Page applied for a special visa on Nov. 3, 2020 and first flew into the country on Jan. 11, 2021 after his child became ill in Fiji, according to    Stuff. Page’s residency visa is known as the Investor Plus, which allows anyone into the country provided they have at least $10 million to invest. The visa wasn’t approved until Feb 4, 2021, after Page entered the country.\n    The 48-year-old Page and his sick child were reportedly airlifted from Fiji to New Zealand’s   Starship children’s hospital using a New Zealand-based air ambulance, but government officials have refused to say whether Page paid for the flight himself, citing medical privacy concerns. It’s not clear what illness Page’s child is suffering from, but Page probably isn’t in the country right now, according to  Stuff, and it’s unclear where he might be at the moment.\n  Curiously, the New Zealand government denied to  Stuff that Page was a resident of the country earlier this week, but eventually the Ministry of Business, Innovation, and Employment admitted that had recently received his special visa.\n   Page reportedly spent time in quarantine once he arrived in New Zealand, as everyone who enters is required to do, but the details around his accommodations haven’t been released. It’s not clear, for example, whether Page was allowed to see his sick child in person during that time.\n New Zealand, a country of just 5 million people, has seen 2,880 cases of covid-19 since the start of the pandemic and 26 deaths, one of the lowest rates of infection and death in the world. The country is essentially operating like covid-19 never happened and New Zealanders are understandably touchy about rich people buying their way into the country during a plague.\n  Page, worth an estimated $121 billion, is just the latest tech billionaire to be revealed as having secret residency or citizenship in the island nation, which has been attracting wealthy westerners who see it as a place to flee if society truly collapses from climate change, rampant disease, “  pitchforks” for the rich, or any other host of problems.\n Peter Thiel, a co-founder of PayPal and an early investor in Facebook, was revealed   in 2017 to have been granted New Zealand citizenship after locals questioned why he was allowed to own a house on protected land. Thiel, a close ally of former president Donald Trump and his “America First” agenda, apparently took the oath of citizenship for New Zealand in Santa Monica, California.\n  New Zealand was recently determined to be the best place to ride out the apocalypse, thanks to its relatively small population, renewable energy, and abundant fresh water supply. The   new study from the Global Sustainability Institute at Anglia Ruskin University also included spots like Australia, the UK, and Ireland, but New Zealand topped the list.\n The    New Yorker reported in 2017 about the flood of people, especially rich Americans and Europeans, who are getting a foothold in New Zealand as their insurance policy against collapse. And it’s basically an open secret among the wealthy that we don’t have much time left for any kind of “normalcy” here on planet Earth.\n  “Saying you’re ‘buying a house in New Zealand’ is kind of a wink, wink, say no more,” Reid Hoffman, the co-founder of LinkedIn, told the  New Yorker back in 2017.\n Where is Page going to spend his $10 million in New Zealand, something that needs to happen within the next three years under the Investor Plus visa? The rumors are that he’s interested in air taxis.\n   Page is understood to have an interest in Wisk Aviation, which has developed an electric, autonomous aircraft intended for use as an air taxi. The company has its headquarters in the US but has a presence in New Zealand and will trial aircraft here.\n  Page’s interest in the company arises from Kitty Hawk, the aviation company he backs. Wisk, formerly called Zephyr, is a joint venture between Boeing and Kitty Hawk.\n  While New Zealand’s citizenship office didn’t respond to our email, the agency notes on its website that processing applications is taking   longer than usual. Probably because so many tech billionaires are knocking on the door to get in.", "posttime": "2021-08-07 03:17:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "秘密,page,新西兰", "title": "拉里佩奇是另一位在新西兰秘密居住的亿万富翁", "title_en": "Larry Page Revealed as Another Billionaire with Secret Residency in New Zealand", "transed": 1, "url": "https://gizmodo.com/larry-page-revealed-as-another-tech-billionaire-with-se-1847434522", "via": "", "real_tags": ["秘密", "page", "新西兰"]}, {"category": "", "categoryclass": "", "imagename": "0676ea1b930323215dc56a22b6676aad.jpg", "infoid": 1071831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新：根据该公司的一份声明，家乐氏将不再在动视暴雪的《守望先锋联赛》中为 Cheez-it 或 Pringles 做广告。文章已更新以反映这一点。根据这三家公司提供的声明，可口可乐、家乐氏和 State Farm 正在重新评估与动视暴雪的《守望先锋联赛》的合作伙伴关系。两周前，加利福尼亚州公平就业和住房部起诉这家视频游戏巨头，指控该公司对女性员工进行广泛骚扰和歧视。动视暴雪运营着守望先锋联赛和使命召唤联盟，这两个电子竞技企业围绕各自的第一人称射击游戏组织比赛。可口可乐和 State Farm 是《守望先锋联赛》网站上目前列出的五个赞助商中的两个。周五早上，家乐氏的 Cheez-it 和品客薯片品牌从名单中删除。与大公司的品牌交易渗透到联盟比赛日制作的各个方面。有由 IBM 提供支持的赞助球员排名，在评论员旁边显眼地放置红色可口可乐杯，以及在比赛中的动作之间运行的快速滚动广告。这些合作伙伴关系是联盟和动视暴雪在获得转播权和特许经营费的同时带来收入的关键方式。在周四向《华盛顿邮报》提供的两份声明中，State Farm 的一位发言人表示，保险公司“正在重新评估我们与《守望先锋联赛》的有限营销关系”，并且该公司已要求“本周末比赛期间不要投放广告”。 State Farm 于 2019 年首次成为守望先锋联赛的赞助商。 可口可乐的一位发言人周三表示，该公司“了解有关动视暴雪的指控”，并一直在密切关注局势。声明中写道：“我们正在与暴雪的合作伙伴合作，我们暂时退后一步，重新审视未来的计划和计划。”\n可口可乐的发言人拒绝评论可口可乐是否会继续赞助守望先锋联赛。下一场守望先锋联赛比赛定于东部时间周五下午 3 点举行。本周早些时候，可口可乐、家乐氏和州立农场在守望先锋联赛的比赛中投放了广告。针对全球最大视频游戏公司之一动视暴雪的诉讼指控多起基于性别的歧视、不平等和骚扰事件。上周，动视暴雪员工在暴雪娱乐总部外举行了罢工，该公司以其《魔兽世界》和《守望先锋》等广受欢迎的游戏而闻名。周二，J. Allen Brack 辞去了暴雪娱乐总裁的职务。同一天，公司人力资源主管 Jesse Meschuk 辞职。该公司是动视暴雪的子公司，现在将由 Jen Oneal 和 Mike Ybarra 共同领导，他们都是在过去两年加入公司的。另一家曾与《守望先锋联赛》和《使命召唤联赛》合作的公司 T-Mobile 的品牌也因诉讼而从官方广播中消失。上周末，《使命召唤》联盟 12 支球队之一的纽约 Subliners 用胶带覆盖了球衣上的 T-Mobile 标志，该公司不再被列为任一联盟网站上的合作伙伴。在报道《守望先锋联赛》的脱口秀节目“Plat Chat”上，印有“T-Mobile 提供”字样的粉红色咖啡杯也消失了。该播客有轮换的评论员，其中一些人全职为《守望先锋联赛》工作，但一位主持人告诉《华盛顿邮报》，播客与动视暴雪完全分开。本周早些时候，主持人拒绝回答问题，因为他们表示该节目仍在与 T-Mobile 进行积极谈判。邮报已经联系了其他守望先锋联赛的赞助商——Xfinity、IBM、TeamSpeak 和丰田——以及使命召唤联盟的赞助商，他们没有回应评论请求。\n当天最重要的新闻报道，由邮政编辑策划，每天早上发布。", "note_en": "U pdate:  Kellogg will no longer advertise Cheez-it or Pringles in Activision Blizzard’s Overwatch League, according to a statement from the company. The article has been updated to reflect this.\n Coca-Cola, Kellogg and State Farm are reassessing partnerships with Activision Blizzard’s Overwatch League, according to statements provided by all three companies. The news comes two weeks after the state of California’s Department of Fair Employment and Housing sued the video game giant over allegations of widespread harassment and discrimination against female employees at the company.\n Activision Blizzard runs the Overwatch League and the Call of Duty League, two esports ventures that organize competitions around those respective first-person shooter titles. Coca-Cola and State Farm are two of five sponsors currently listed on the  Overwatch League website. Kellog’s Cheez-it and Pringles brands were removed from the list Friday morning.\n   Brand deals with big companies bleed into all aspects of the league’s match-day production. There are sponsored player rankings powered by IBM, prominently placed red Coca-Cola cups next to commentators and quick-rolling advertisements that run between the action in a match. The partnerships are key ways for the league — and Activision Blizzard — to bring in revenue alongside broadcasting rights and franchise fees.\n In two statements provided to The Post Thursday, a spokesperson for State Farm said the insurance provider is “reevaluating our limited marketing relationship with the Overwatch League,” and the company has requested that “no advertisements run during the matches this weekend.” State Farm first became a sponsor of the Overwatch League  in 2019.\n  A spokesperson for Coca-Cola said Wednesday that the company is “aware of the allegations surrounding Activision Blizzard” and has been closely monitoring the situation.\n “We are working with our partners at Blizzard as we take a step back for a moment to revisit future plans and programs,” the statement reads.\n  The spokesperson for Coca-Cola declined to comment on whether Coca-Cola would continue to sponsor the Overwatch League. The next Overwatch League match is scheduled for Friday at 3 p.m. Eastern time. Coca-Cola, Kellogg and State Farm ran  advertisements in Overwatch League matches  earlier this week.\n    The lawsuit against Activision Blizzard, one of the world’s biggest video game companies, alleges multiple instances of gender-based discrimination, inequality and harassment. Last week,  Activision Blizzard employees staged a walkout outside of the headquarters of Blizzard Entertainment, known for its massively popular titles like “World of Warcraft” and “Overwatch.”\n On Tuesday, J. Allen Brack, stepped down from his post as president of Blizzard Entertainment. That same day, Jesse Meschuk, a human resources executive at the company, resigned. The company, which is a subsidiary of Activision Blizzard, will now be co-led by Jen Oneal and Mike Ybarra, both of whom joined the company in the past two years.\n  Branding for T-Mobile, another company that once partnered with both the Overwatch League and Call of Duty League, also vanished from official broadcasts in the wake of the lawsuit.\n   Last weekend, the New York Subliners — one of 12 Call of Duty League teams — covered the T-Mobile logo on their jerseys with duct tape, and the company is no longer listed as a partner on either league’s website.\n On “ Plat Chat,” a talk show that covers the Overwatch League, pink coffee mugs sporting the words “presented by T-Mobile” also disappeared. The podcast has a rotating cast of commentators, some of whom work full time for the Overwatch League, though one host told The Post the podcast is completely separate from Activision Blizzard. The host declined to answer questions earlier this week because they said the show is still in active talks with T-Mobile.\n   The Post has reached out to other Overwatch League sponsors — Xfinity, IBM, TeamSpeak and Toyota — and the sponsors of the Call of Duty League, who have not responded to requests for comments.\n     The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-08-07 02:33:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "state,lawsuit", "title": "在骚扰诉讼中，可口可乐、State Farm 退出暴雪的守望先锋联赛", "title_en": "Amid harassment lawsuit, Coca Cola, State Farm pull back from Blizzard’s Overwatch League", "transed": 1, "url": "https://www.washingtonpost.com/video-games/2021/08/05/activision-blizzard-sponsors-overwatch/", "via": "", "real_tags": ["state", "lawsuit"]}, {"category": "", "categoryclass": "", "imagename": "9baa123b07533e46b69d71bce23e3ecc.jpg", "infoid": 1071829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因此，不用说，我们非常高兴红杉合伙人 Stephanie Zhan 和 Rec Room 创始人 Nick Fajt 在未来几周加入我们的 Extra Crunch Live。 Rec Room 是一家位于西雅图的初创公司，它允许用户不仅可以玩游戏，还可以与朋友合作构建游戏。在大流行之后，游戏世界得到了巨大的推动，Rec Room 正在思考未来的出路，不仅作为用户，而且作为创作者，游戏的外观。该公司已经筹集了近 1.5 亿美元，红杉领投了 Rec Room 的种子轮和 A 轮融资。 Stephanie Zhan 一直在红杉作为早期和种子投资团队的一员，其投资组合包括 Sunday（户外家庭订阅服务）、Linear（现代开发人员的问题跟踪工具）和 Middesk（企业背景调查）。她还帮助领导了对 Graphcore（用于机器智能的微处理器）、Evervault（用于数据隐私的开发工具）和 Doppler（用于开发人员的秘密管理）的投资。我们将听取这位创始人/投资人二人组关于他们如何相识、是什么让他们选择彼此以及他们如何一起工作并克服前进中的障碍的消息。在这里免费注册！ Extra Crunch Live 还设有 ECL Pitch-off，观众中的创始人将有机会在我们的舞台上虚拟地举手并在我们的舞台上向我们的客人投球，他们将提供现场反馈。任何人都可以参加 Extra Crunch Live，但按需访问内容仅限于 Extra Crunch 会员。该死的，Extra Crunch 库是一个相当不错的资源。如果您还不是会员，您还在等什么？在此注册。", "note_en": "So it should go without saying that we are absolutely thrilled to have  Sequoia partner Stephanie Zhan and Rec Room founder Nick Fajt join us on Extra Crunch Live in the coming weeks.\n Rec Room is a Seattle-based startup that allows users to not only play games, but to build them collaboratively with their friends. The gaming world has seen a huge boost in the wake of the pandemic, and Rec Room is thinking way out in the future about what gaming looks like not only as a user, but as a creator.\n The company has raised nearly $150 million, and Sequoia led Rec Room’s seed and Series A financing rounds.\n Stephanie Zhan has been with Sequoia as part of the early-stage and seed investment team, with a portfolio that includes Sunday (outdoor home subscription service), Linear (issues tracking tool for modern developers) and Middesk (background checks for businesses). She has also helped lead investments in Graphcore (microprocessors for machine intelligence), Evervault (dev tools for data privacy) and Doppler (secrets management for developers).\n  We’ll hear from this founder/investor duo about how they met, what made them choose each other and how they’ve worked together and tackled obstacles moving forward.   REGISTER HERE FOR FREE!\n  Extra Crunch Live also features the ECL Pitch-off, where founders in the audience will have the opportunity to virtually raise their hand and pitch on our stage to our guests, who will give live feedback.\n Anyone can attend Extra Crunch Live, but accessing the content on-demand is reserved exclusively for Extra Crunch members. And damn, the  Extra Crunch library is quite a resource. If you’re not yet a member, what are you waiting for?  Sign up here.", "posttime": "2021-08-07 02:32:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crunch,用于", "title": "Sequoia 的 Stephanie Zhan 和 Rec Room 的 Nick Fajt 将加入我们的 Extra Crunch Live", "title_en": "\n\t\t\t\tSequoia’s Stephanie Zhan and Rec Room’s Nick Fajt are joining us on Extra Crunch Live\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/sequoias-stephanie-zhan-and-rec-rooms-nick-fajt-are-joining-us-on-extra-crunch-live/", "via": "", "real_tags": ["crunch", "用于"]}, {"category": "", "categoryclass": "", "imagename": "981f12e4cc974f2189d798b54b9456ea.jpg", "infoid": 1071828, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Davey 和 Nof 加入了我们最近的一集 Extra Crunch Live，并详细介绍了 Tusk 为何渴望为 Wheel 提供资金，带我们了解这家初创公司的 A 轮融资平台，并分享哪些幻灯片和细节促成了这笔交易。 Extra Crunch Live 是每周一次的虚拟活动系列，旨在帮助创始人建立更好的风险支持企业。我们与投资者和他们资助的创始人坐下来了解是什么让他们走到了一起，他们在彼此身上看到了什么，以及他们如何共同前进。我们还举办了 Extra Crunch 现场推介会，观众中的创始人可以向我们出色的演讲者推介他们的创业公司。每个人都可以在太平洋夏令时间星期三中午观看 Extra Crunch Live，但点播内容专为 Extra Crunch 会员保留。您可以在此处查看完整的 ECL 库。 Davey 强调了在构建音高甲板时不坚持僵化格式的重要性。她说，重要的是要专注于围绕让你有吸引力和独特的东西制作你的宣传。那应该放在前台并突出显示。对于 Wheel 来说，这意味着牵引力领先，因为该公司甚至在早期就拥有令人印象深刻的吸收率。他们最近的 B 轮融资也是如此。", "note_en": "Davey and Nof joined us on a recent episode of Extra Crunch Live and went into detail on why Tusk was eager to finance Wheel, walking us through the startup’s Series A pitch deck and sharing which slides and bits clinched the deal.\n Extra Crunch Live is a weekly virtual event series meant to help founders build better venture-backed businesses. We sit down with investors and the founders they finance to hear what brought them together, what they saw in each other and how they work together moving forward. We also host the Extra Crunch Live Pitch-Off, where founders in the audience can pitch their startups to our outstanding speakers.\n Extra Crunch Live is accessible to everyone live on Wednesdays at noon PDT, but the on-demand content is reserved exclusively for Extra Crunch members. You can check out the full  ECL library here.\n  Davey emphasized the importance of not sticking to a rigid format for building a pitch deck. She said it’s important to instead focus on crafting your pitch around what makes you appealing and unique. That should be on the foreground and featured prominently.\n For Wheel, that meant leading with traction, since the company had impressive uptake even early on. That remained true for their recent Series B raise, too.", "posttime": "2021-08-07 02:32:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "制作,pitch,创始人", "title": "围绕“可以真正吸引投资者的一件事”来制作你的宣传片", "title_en": "\n\t\t\t\tCraft your pitch deck around ‘that one thing that can really hook an investor’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/craft-your-pitch-deck-around-that-one-thing-that-can-really-hook-an-investor/", "via": "", "real_tags": ["制作", "pitch", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "e3e003ef3df900c510ebc498d207a07d.jpg", "infoid": 1071827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司的首席执行官兼创始人 Nick Hazell 曾在 Masterfoods 和 Pepsico R&amp;D 工作，他说，该公司在其国内市场已经有了强劲的发展，第一个目标是成为澳大利亚第一。但与此同时，他们将扩大在亚洲的影响力，在那里合作伙伴汉堡王推出了带有肉饼的 Whopper，在欧洲，该产品的最小可疑元素开始发挥作用。目前，v2Food 生产植物性碎牛肉和肉饼、香肠和现成的肉酱。显然，它们在这些类别中竞争激烈，这是大多数替代蛋白质公司的开场白。但是 v2Food 有两个方面的优势。首先，v2Food 产品是使用“任何标准的肉类生产设施”制造的，或者至少可以制造。由于规模经济已经发挥作用，这对扩展来说是一个很大的优势，而对成本来说却是一个劣势。创建和混合构成替代蛋白质的植物来源和其他人造物质的过程通常并不总是适合现有的基础设施。这也为与现有肉类公司建立合作关系打开了大门，这些公司可能不愿改变流程。 （顺便说一下，Hazell 指出，他们的目标不是取代传统肉类，而是向新方向发展市场，这些公司可能会欣赏这种理念。）其次，正如宣布筹款的新闻稿所说的那样它，“v2food 产品不包含转基因生物、防腐剂、色素或调味剂。这使其成为欧洲市场的理想产品，由于严格的监管，许多大型竞争对手一直无法进入市场。”这也是赢得在两种基于植物的选择之间摇摆不定的店内买家的软优势；谁没有偶尔最终选择一种成分较少的产品，并自豪地吹嘘它不含防腐剂等？购买替代蛋白质的人群可能对这一考虑特别敏感。这轮 4500 万欧元的融资是“B Plus”，由欧洲影响力基金 Astanor 领投，华兴成长资本基金、Main Sequence 和 ABC World Asia 跟投。这笔钱将用于研发和规模化。 “这笔资金是朝着 v2food 改变世界生产食物方式的目标迈出的重要一步，”Hazell 说。 “我们必须迅速扩大规模，因为这些全球性问题需要立即解决。”为此，很大一部分将用于简单地创造足够的产品来满足需求。他们还将研发支出加倍，以加速新产品的开发并改进现有产品。他们没有将必要的原料进口到澳大利亚，而是探索在那里建立当地制造工厂的可能性。如果运气好，再加上一点植物性肘部油脂，该地区可能会成为净出口国，支撑当地经济，并增强 v2Food 的弹性并降低成本。\n在该公司（和 Astanor）看来，欧洲扩张仍然是一闪而过，因为即使其简单性和非转基因起源，在欧洲市场推出新产品也并非易事。", "note_en": "The company has seen strong uptake in its home market, and the first goal is to be #1 in Australia, said CEO and Founder Nick Hazell, formerly of Masterfoods and Pepsico R&amp;D. But in the meantime they’ll be expanding their presence in Asia, where partner Burger King has launched a Whopper with their patty, and in Europe, where the product’s minimal suspicious elements come into play.\n Currently v2Food makes plant-based ground beef and patties, sausages, and a ready-made Bolognese sauce. Obviously they have strong competition in those categories, which are sort of the opening play of most alternative protein companies. But v2Food has a leg up on many of them in two ways.\n  First, v2Food products are made, or at least can be made, using “any standard meat production facility.” That’s a big plus for scaling and a minus for cost, since economies of scale are already in play. The processes for creating and mixing the plant-derived and other artificial substances that make up alternative proteins in general aren’t always amenable to existing infrastructure. This also opens the door to partnerships with existing meat companies that might have balked at having to switch processes. (Incidentally, Hazell noted that what they’re aiming for isn’t so much about replacing traditional meats so much as growing the market in a new direction, a philosophy those companies may appreciate.)\n Second, as the press release announcing the fundraise puts it, “v2food products do not contain GMOs, preservatives, colors or flavorings. This makes it an ideal product for the European market, where the many large competitors have been unable to enter the market due to strict regulation.” It’s also a soft advantage for winning over in-store buyers vacillating between two plant-based options; who hasn’t on occasion ended up going for the one with fewer ingredients that proudly touts its lack of preservatives and such? The alt-protein buying demographic is likely especially sensitive to this consideration.\n The €45M round is a “B Plus,” led by European impact fund Astanor and with participation from Huaxing Growth Capitol Fund,  Main Sequence, and ABC World Asia. The money is going towards both R&amp;D and scaling.\n   “This funding is an important step towards v2food’s goal of transforming the way the world produces food,” said Hazell. “It’s imperative that we scale quickly because these global issues need immediate solutions.”\n To that end a large portion will go towards simply creating enough product to meet demand. They’re also doubling R&amp;D spend to both accelerate new products and improve the existing ones. And rather than import the necessary ingredients to Australia, they’re exploring the possibility of building a local manufacturing facility there. With luck and a bit of plant-based elbow grease, the region could become a net exporter, propping up the local economy as well as building up v2Food’s resilience and cutting costs.\n The Europe expansion is still a twinkle in the company’s (and Astanor’s) eye, for even with its simplicity and non-GMO origins, it’s not trivial to launch a new product in the European market.", "posttime": "2021-08-07 02:32:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "v2food,产品", "title": "澳大利亚的 v2Food 计划以 4500 万欧元的融资将其植物性肉类扩展到欧洲和亚洲", "title_en": "\n\t\t\t\tAustralia’s v2Food aims to expand its plant-based meats to Europe and Asia with €45M raise\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/australias-v2food-aims-to-expand-its-plant-based-meats-to-europe-and-asia-with-e45m-raise/", "via": "", "real_tags": ["v2food", "产品"]}, {"category": "", "categoryclass": "", "imagename": "2d8c7651f25aa913a56d5ae2637defa1.jpeg", "infoid": 1071826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Moderna Inc. 周四表示，预计接种两剂 Covid-19 疫苗的人在秋季需要加强注射，以保持对新型冠状病毒的强大保护。该公司表示，其疫苗至少在六个月内对预防 Covid-19 疾病的有效率为 90%，但表示六个月后抗体水平下降，尤其是针对包括 Delta 变体在内的新型冠状病毒。 Moderna 说，在第二阶段的研究中，原始配方的第三次注射显示出针对 Covid-19 相关变体的强大抗体反应。 Moderna 首席执行官斯蒂芬·班塞尔 (Stéphane Bancel) 周四在接受采访时表示，该公司计划在分析正在进行的试验数据后，在 9 月份寻求监管部门的批准。他说，加强剂是必要的，因为免疫力会随着时间的推移而继续减弱，而且一些疫苗接种者在接触包括 Delta 在内的某些变体时会表现出中和抗体的下降。 “我们正在谨慎行事，不仅是为了达美航空，也是为了接下来的事情，”他说。 “我不认为病毒已经结束了。” 《华尔街日报》将向您收取 $ + 税款（如果适用）。您可以随时在客户中心更改您的计费偏好或致电客户服务。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客户服务部取消订阅。", "note_en": "Moderna Inc. said Thursday it expects people who received its two-dose Covid-19 vaccine to need  a booster shot in the fall to keep strong protection against newer variants of the coronavirus.\n  The company said its vaccine remains 90% effective against preventing Covid-19 disease for at least six months, but said it sees a decline in antibody levels after six months, especially against newer strains of the coronavirus including the Delta variant. In a Phase 2 study, a third shot of the original formulation showed robust antibody responses against Covid-19 variants of concern, Moderna said.\n  Moderna Chief Executive Stéphane Bancel said in an interview Thursday that the company plans to seek regulatory approval for its booster shots in September, after it analyzes data from ongoing trials.\n  He said the boosters are necessary because immunity will continue to wane over time and some vaccine recipients show a drop in neutralizing antibodies when exposed to some variants, including Delta.\n  “We’re playing it safe, not only for Delta but also for what’s coming after,” he said. “I don’t think the virus is done.”\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-08-07 02:20:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推荐,recommends,表示", "title": "Moderna 推荐 Covid-19 疫苗助推器以防止新变种", "title_en": "Moderna Recommends Covid-19 Vaccine Booster To Protect Against New Variants", "transed": 1, "url": "https://www.wsj.com/articles/moderna-says-vaccine-remains-effective-for-six-months-11628165429", "via": "", "real_tags": ["推荐", "表示"]}, {"category": "", "categoryclass": "", "imagename": "c85f765ea6a21826cde15e0cc2324a08.jpg", "infoid": 1071825, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五早上，埃隆·马斯克的 SpaceX 首次在超重型火箭助推器上堆叠了一枚星际飞船原型火箭，展示了这辆近 400 英尺高的火箭的总规模。马斯克在接受 CNBC 采访时询问他对在德克萨斯州博卡奇卡的公司工厂见证这一里程碑有何看法，他的回答很简单。 SpaceX 正在开发 Starship，用于在月球和火星任务中发射货物和人员。 Starship 原型机高约 160 英尺，大约相当于 16 层楼的大小，由不锈钢制成——代表了马斯克在 2019 年推出的火箭的早期版本。火箭在超重型火箭上升空助推器，它构成火箭的下半部分，高约 230 英尺。 Starship 和 Super Heavy 在堆叠发射时总共有近 400 英尺高。 SpaceX 在过去一年中对 Starship 原型进行了多次短途试飞，但到达轨道代表了测试火箭的下一步。该公司于 5 月公布了其首次轨道飞行计划，该计划将从该公司位于德克萨斯州的设施发射，目标是飞溅到夏威夷海岸。该公司一直在迅速为星际飞船和超重型助推器做好轨道飞行测试的准备工作，尽管在发射之前需要完成美国联邦航空管理局的当地环境审查。马斯克概述了 SpaceX 计划在未来两周内完成的四项“重要项目”，为星际飞船 20 的发射做准备。\n他表示，SpaceX 需要在飞船上添加“最终隔热瓦”，为 Booster 4 中的猛禽火箭发动机添加“热保护”，完成“地面推进剂储罐”的工作，并在顶部添加一个快速断开臂最近建造的发射塔。快速断开臂在发射前将电源和燃料管线连接到火箭。虽然 SpaceX 的猎鹰 9 号和猎鹰重型火箭可以部分重复使用，但马斯克的目标是让 Starship 完全可重复使用——一种更类似于商用飞机的火箭，飞行之间的周转时间很短，唯一的主要成本是燃料。使 Starship 完全可重复使用的一个重要部分是提高其耐用性，以在重新进入地球大气层的激烈过程中幸存下来。小型六边形隔热瓦是 SpaceX 对这个问题的解决方案，以前闪亮的 Starship 20 火箭现在被数千个隔热瓦覆盖。马斯克指出，星际飞船 20 的瓷砖工作“完成了 98%”，因为“剩余的瓷砖是需要加工的独特形状。”美国航天局一直在密切关注星际飞船的发展，尤其是今年早些时候，美国宇航局授予 SpaceX 一份有争议的 29 亿美元合同，使用火箭将宇航员送上月球表面。 NASA 负责科学任务的高级官员 Thomas Zurbuchen 博士告诉 CNBC，他将继续关注 Starship 的进展。 “是的，我一直在关注这一点，并为@SpaceX 实现这一里程碑感到兴奋！迫不及待地想看到它飞起来！” Zurbuchen 在推文中写道。\n马斯克写道：“由于它的尺寸和甚至从深空返回科学仪器的能力，星际飞船将实现全新的科学任务。”通过 CNBC Pro 成为更聪明的投资者。获得选股、分析师电话、独家采访和访问 CNBC 电视。立即注册以开始免费试用。", "note_en": "Elon Musk&#39;s SpaceX stacked a Starship prototype rocket on top of a Super Heavy rocket booster for the first time on Friday morning, giving a look at the scale of the combined nearly 400-foot-tall vehicle.\n Musk, asked by CNBC what he thought of witnessing the milestone at the company&#39;s facility in Boca Chica, Texas, responded simply.\n    SpaceX is developing Starship to launch cargo and people on missions to the moon and Mars. Starship prototypes stand at about 160 feet tall, or around the size of a 16-story building, and are built of stainless steel – representing the early version of  the rocket that Musk unveiled in 2019.\n The rocket lifts off on top of a Super Heavy booster, which makes up the bottom half of the rocket and stands about 230 feet tall. Together, Starship and Super Heavy are nearly 400 feet tall when stacked for launch.\n    SpaceX has conducted multiple short test flights of Starship prototypes over the past year, but reaching orbit represents the next step in testing the rocket. The company in May  revealed its plan for the first orbital flight, which would launch from the company&#39;s facility in Texas and aim to splash down off the coast of Hawaii.\n  The company has been working rapidly to ready Starship and the Super Heavy booster for the orbital flight test, although  a local environmental review by the Federal Aviation Administration needs to be completed before the launch happens.\n   Musk outlined four &#34;significant items&#34; that SpaceX aims to complete over the next two weeks in preparing Starship 20 for launch.\n He said SpaceX needs to add the &#34;final heat shield tiles&#34; to the ship, add &#34;thermal protection&#34; to the Raptor rocket engines in Booster 4, complete work on &#34;ground propellant storage tanks,&#34; and add a quick disconnect arm to the top of the recently-built launch tower. The quick disconnect arm connects power and fuel lines to the rocket before launch.\n  While SpaceX&#39;s fleet of Falcon 9 and Falcon Heavy rockets are partially reusable, Musk&#39;s goal is to make Starship fully reusable — a rocket that is more akin to a commercial airplane, with short turnaround times between flights such that the only major cost is fuel.\n  One important piece of making Starship fully reusable is improving its durability to survive the intense process of reentering the Earth&#39;s atmosphere. Small hexagonal heat shield tiles are SpaceX&#39;s answer to that problem, with the previously shiny Starship 20 rocket now covered in thousands of the tiles.\n Musk noted that work on the tiles is about &#34;98% done&#34; for Starship 20, as &#34;the remaining tiles are unique shapes requiring machining.&#34;\n   The U.S. space agency has been paying close attention to Starship&#39;s development, especially as NASA earlier this year  awarded SpaceX with a controversial $2.9 billion contract to deliver astronauts to the surface of the moon using the rockets.\n Dr. Thomas Zurbuchen, NASA&#39;s top official for science missions, told CNBC that he continues to watch progress on Starship.\n &#34;Yes, I have been following this all along and am excited for @SpaceX achieving this milestone! Can&#39;t wait to see it fly!&#34; Zurbuchen wrote in a tweet.\n   &#34;Due to its size &amp; ability to return science instruments even from deep space, Starship will enable a whole new class of science missions,&#34; Musk wrote.\n  Become a smarter investor with    CNBC Pro .  Get stock picks, analyst calls, exclusive interviews and access to CNBC TV.   Sign up to start a    free trial today  .", "posttime": "2021-08-07 02:20:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,发射,orbital", "title": "马斯克：“梦想成真”在轨道发射准备期间看到完全堆叠的SpaceX星际飞船火箭", "title_en": "Musk: 'Dream Come True' To See Fully Stacked SpaceX Starship Rocket During Prep for Orbital Launch", "transed": 1, "url": "https://www.cnbc.com/2021/08/06/elon-musk-spacex-starship-fully-stacked-is-dream-come-true.html", "via": "", "real_tags": ["火箭", "发射", "orbital"]}, {"category": "", "categoryclass": "", "imagename": "4d9c180c030d86d39be32e3fda245f1b.jpg", "infoid": 1071824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在 Google 确认我们的 Pixel 6 和 Pixel 6 Pro 独家发售几天后——今天我们有一些关于 Pixel 5A 及其发布的独家信息。正如谷歌自己提到的，该设备将只在两个市场推出——美国和日本。据我们熟悉此事的消息人士透露，Pixel 5A 将于 8 月 26 日星期四发布，并且只能在线购买或在 Google 商店实体店有售。我们被告知该设备将使用与去年的 Pixel 5 相同的相机，IP67 防护等级，并有一个耳机插孔。我们为 Google Pixel 5A 提供的零售价为 450 美元。由于提供此信息的消息来源，我相信这些是该设备的最终详细信息，我们将在本月晚些时候看到它。早在 5 月份，我们就向您展示了 Pixel 6 和 Pixel 6 Pro。超级独特的设计...\n对于某些人来说，iPad mini 绝对是他们的最爱。 iPad 的所有温暖模糊的感觉，都融入了这个几乎是单手操作的小巧设备中。这...", "note_en": "Just a few days after  Google confirmed our Pixel 6 and Pixel 6 Pro exclusives — today we have some exclusive information regarding the Pixel 5A and its release.\n As mentioned by Google themselves, the device is set to launch in only two markets —  The United States, and Japan.\n According to our sources familiar with the matter, the Pixel 5A will be launching on  Thursday, August 26th and will only be available for purchase online or physically available in Google Stores.\n    We’ve been told that the device will use the same camera as the Pixel 5 from last year, be IP67 rated, and have a headphone jack.\n The listed retail price we’ve been given for the Google Pixel 5A is $450 USD.\n Due to the sources who provided this information, I’m confident that these are finalized details for the device and we’ll be seeing it later on this month.\n  Back in May, we gave you your very first look at both the Pixel 6 and the Pixel 6 Pro. The super unique design...\n  For some, iPad mini is an absolute favorite. All the warm fuzzy feels of an iPad, packed into this tiny, nearly one-handed device. The...", "posttime": "2021-08-07 02:19:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "内存,5g,谷歌,google,上市", "title": "资料来源：谷歌的 Pixel 5A 将于 8 月底上市，售价 450 美元，配备 6.4 英寸显示屏和打孔摄像头、骁龙 765G、4650mAh 电池、6GB 内存等", "title_en": "Sources: Google's Pixel 5A will debut by the end of Aug. for $450, with a 6.4\" display with a hole-punch camera, Snapdragon 765G, 4650mAh battery, 6GB RAM, more", "transed": 1, "url": "https://www.frontpagetech.com/2021/08/05/exclusive-google-pixel-5a-launching-later-this-month-at-450-full-specs/", "via": "", "real_tags": ["内存", "5g", "谷歌", "google", "上市"]}, {"category": "", "categoryclass": "", "imagename": "4a4ff7b11915d8932823b744b43dab4e.jpg", "infoid": 1071823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人类的未来 Elon Musk 在很多方面改变了世界。他以担任特斯拉汽车公司、SpaceX 和 SolarCity 的负责人而闻名。他的公司使在不消耗化石燃料、进入太空或利用太阳能的情况下绕地球旅行成为可能。Credit Insane Curiosity", "note_en": "Future  of Mankind  Elon Musk has changed the world in many ways. He is known for being the head of Tesla Motors, SpaceX and SolarCity. His companies have made it possible to travel around Earth without consuming fossil fuels, going into space, or harnessing solar power.Credit Insane Curiosity", "posttime": "2021-08-07 02:18:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "马斯克,musk", "title": "埃隆马斯克和他的公司正在改变人类的未来", "title_en": "Elon Musk and His Companies Are Changing the Future of Mankind", "transed": 1, "url": "https://www.thefuturist.co/how-elon-musk-and-his-companies-are-changing-the-future-of-mankind/", "via": "", "real_tags": ["马斯克", "musk"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "tl;博士 – 我假设票务系统的物理和情感距离会降低工作满意度并提出解决方案。我记得当我还是个孩子的时候，我知道如何编码。我没有得到应有的好成绩，我在其他一些方面也没有出彩，但尽管如此，我知道我可以做一些特别的事情。我可以构建有趣的东西，我可以解决问题。当谈到我的第一份工作时，我也有同样的感觉。当时我会说我仍然有点“边缘粗糙”，但我可以解决问题，有时是棘手的问题，这让我变得有用。使用我知道自己擅长的一种方式被需要感觉很棒。没有什么比有人走到我的办公桌前告诉我一个让他们的生活变得艰难的问题并能够为他们解决的问题。很快，尽管一些更高级的工程师开始发言。 “我们不能有这样的打扰。我们需要更有条理。我们需要跟踪这项工作。我们需要在 JIRA 中提出问题。”我和很多人有同样的反应，那就是“为什么我们需要跟踪这个？我们难道不相信每个人都在尽其所能地工作吗？”。我得到了关于估算、计划等重要性的通常答案，但并不完全理解，但接受了。多年后，我自己年长，我会坚持 - 每次代码更改都必须有相关的票证。这并不是说我是某种敏捷传播者，但我确实发现票务系统是必不可少的，即使对于最小的团队也是如此。一路上的某个地方，我忘记了我曾经有过不同的感觉。下一个角色我成为了一家混乱初创公司的主要 SRE。有些人会讨厌它，但我喜欢它。战争室的嗡嗡声和刺激与事务功能开发无法比拟，最终会导致 A/B 版本，然后可能会导致指标的小百分比改进。我喜欢为我亲自见过的其他工程师解决问题，他们很高兴并印象深刻，我会解决他们的问题并改进整个系统，使将来不可能出现问题。我喜欢的并不是 SRE 本身所固有的。虽然是一个高风险的角色，但它也可以像任何角色一样孤立。它可以是在晚上醒来闹钟自己登录并解决问题，提交票证，并且没有人注意到。\n从另一个角度来看——当我去吃全食品并看着收银员扫描我定价过高的商品时，我想知道他们是怎么想的。虽然与陌生人闲聊对我来说远不是一种力量，但无论如何我都在努力以我能用的任何小方式建立联系。我不认为我可以强行开玩笑并相信时间与可变结帐时间一致。我尽量表现得很好，而不是刻板礼貌。这可能意味着我自己打包杂货，或者避免本能地盯着我的手机。我什至不能肯定收银员注意到或喜欢它。我只是假设如果我处于他们的位置，我就不想感觉自己像一台机器。首先，问题是：我们如何协调我们希望受到个人关注和人性化的需求与标准化的业务需求？我认为这个问题是本文最重要的部分。我会提出一个或两个建议，让球滚动，但这个话题是开放的。如果通过 jira 正常提交票证，但提交者还必须来到操作票证的人的办公桌前面对面解释问题怎么办？如果门票的描述方式强调了该功能用户的情感重要性，该怎么办？如果与用户交流的 PM 获得的最终用户满意度和愿望与工程师分享会怎样？", "note_en": "tl; dr – I hypothesize the physical and emotional distance of ticketing systems reduces job satisfaction and propose solutions.\n   I remember when I was a kid I knew how to code. I didn’t get as good grades as I could have, I didn’t shine in a few other ways, but despite this I knew I could do something special. I could build interesting things and I could fix problems.\n When it came to my first job I felt the same way. At the time I’d say I was still a bit “rough around the edges” but I could fix problems, sometimes hard ones, and that made me useful. It felt great to be needed using the one way I knew I was good at. There was nothing like somebody walking over to my desk to tell me about a problem that was making their lives hard, and to be able to fix it for them.\n Pretty soon though a number of more senior engineers started speaking up. “We can’t have interruptions like this. We need to be more structured. We need to track this work. We need to put to asks in JIRA.” I had the same reaction a lot of people do, which was “Why do we need to track this? Do we not trust everybody is working to the best of their ability?”. I got the usual answers about the importance of estimation, planning, etc, and didn’t entirely understand, but accepted.\n Years later, senior myself, I would insist –  every code change must have an associated ticket. That isn’t to say I’m some kind of agile evangelist, but I certainly found ticketing systems indispensable, even for the smallest of teams. Somewhere along the way I had forgotten that I had ever felt otherwise.\n Next role I became the main SRE for a chaotic startup. Some people would hate it, but I  loved it. The buzz and thrill and of a war-room was incomparable to the transactional feature development that would eventually lead to an A/B release that would then possibly lead to a small % improvement in a metric. I loved fixing things for other engineers who I saw in person, who were happy and impressed that I would fix their issue and improved the whole system to make the issue impossible in the future.\n What I loved wasn’t inherent to being an SRE itself. Though a high-stakes role, it can also be as isolating as any role. It can be waking up to an alarm at night to login in by oneself and fix an issue, file a ticket, and have nobody notice.\n  From another angle – when I go to whole foods and watch the cashier scan my overpriced items, I wonder what they think. Though small talk with strangers is far from a strength for me, I struggle anyways to connect in whatever small way I can. I don’t think I could force a joke and trust the timing to line up with the variable checkout time. I try to be nice without being stiffly polite. It may mean bagging my own groceries, or avoiding the instinct to stare at my phone. I can’t even say for sure that cashiers notice or like it.  I simply presume that if I were in their shoes I wouldn’t want to feel like a machine.\n  Well first, the question: How do we reconcile our desire to feel individually noticed and human with the business needs of standardization? I think this question is the most important piece of this article. I’ll make a proposal or two, to get the ball rolling, but the topic is wide-open.\n What if tickets are filed normally through jira, but then the filer must also come over to the desk of the person operating on the ticket and explain the issue face-to-face?\n What if tickets are described in a way that stresses the emotional importance to the user of the feature?\n What if end-user satisfaction and wishes, as captured by PMs who communicate with users, was shared with engineers?", "posttime": "2021-08-07 02:18:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "票猴,ticket", "title": "票猴", "title_en": "Ticket Monkey", "transed": 1, "url": "https://blog.alexrohde.com/archives/749", "via": "", "real_tags": ["票猴", "ticket"]}, {"category": "", "categoryclass": "", "imagename": "2f91ba467c94856cca169f767b2aa7af.jpg", "infoid": 1071821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Technicolor 胶片不是彩色胶片，它不会产生任何栩栩如生的色彩。但它是如何制作彩色电影的呢？为什么这些颜色会发光？为什么这一切都会导致多萝西得到红宝石拖鞋？任何看过旧 Technicolor 电影的人都知道，它看起来很奇怪。蓝眼睛看起来像是在发光。粉红色的脸看起来像是被涂上了桃子。红色看起来很吓人。这一切看起来都被染色了，没有被记录下来——那是因为它是。当时没有任何彩色胶片让 Technicolor 大放异彩。没有人想出如何制作可以记录颜色的胶片。然而，他们找到了一种制作胶片的方法，可以过滤掉所有不应该通过的颜色。他们有染料。通过将它们放在一起，他们使 Technicolor 变得光彩夺目。 Technicolor 相机没有彩色胶片。相反，他们用不同的滤镜以黑白拍摄。光线进入相机镜头并进入半镀银镜，该镜通过品红色镜头（红色和蓝色一起）和绿色镜头将光束分开。洋红色镜头后面是对蓝光敏感的胶片，对红光敏感的胶片。绿色镜头后面只是普通的感光胶片。制作组最后拍了三组胶卷，一组显示他们正在拍摄的物体发出的蓝光，一组显示红光，另一组显示绿色。所有这些都是黑白胶片。他们只是展示了看起来很奇怪的照片。例如，在“蓝色”卷上，皮肤中几乎没有蓝色调的人的皮肤看起来完全黑，而蓝丝带看起来是纯白色的。每个黑白图像都用其适当的颜色染色。有时，当它们被染色时，这些薄膜会合并并重新过滤，因此只有亮蓝色会从蓝色染色的薄膜中出来。最后，当影片上映时，三片染色的影片将一层一层地叠加在一起，形成“光彩夺目的彩片”。这就是为什么，尤其是在早期的电影中，色彩看起来如此绘画。这也是为什么大多数早期电影几乎都会引起眼睛疲劳的原因——尤其是著名的电影《绿野仙踪》。 Technicolor 过程很昂贵，不仅仅是因为相机和技术人员需要拍摄，还有许多附带的技术问题。有些颜色，如果太微妙，会突然像其他颜色一样弹出。如果过滤掉太多错误的颜色，黄色会随机变成绿色。而且由于进入相机的光束被分到多张胶片上，所以工作室中只有一小部分光线可以投射到任何一张胶片上。这意味着工作室需要格外明亮。绿野仙踪的许多常客抱怨工作室灯光对眼睛造成的伤害，这种情况持续了数年。不过，大多数情况下，这意味着制作团队不想浪费任何颜色的机会。书中多萝西的拖鞋是银色的，据说黄砖路、银色拖鞋、翠绿色的城市代表金本位、银币和纸币。但是银拖鞋在电影中一点都不好玩。他们也可能被拍成黑白片。然而，红色很容易看到，引人注目，并且不会对颜色混合造成严重破坏——著名的黄砖路经常这样做。因此，充分利用了Technicolor的红宝石拖鞋，永远改变了美国的童话故事。", "note_en": "Technicolor film was not color film, and it did not produce anything like lifelike colors. But how did it produce color movies? And why did those colors glow? And why did all of it lead to Dorothy getting ruby slippers?\n  As anyone who has seen an old Technicolor film knows, it looks weird. Blue eyes look like they glow. Pink faces look like they&#39;ve been painted peach. Red looks scary. It all looks dyed, not recorded — and that&#39;s because it was. There wasn&#39;t any color film at the time that Technicolor was making its big splash. No one had figured out how to create a film stock that would record color. They had, however, found a way to make film stock that would filter out all the color that shouldn&#39;t get through. And they had dyes. By putting them together, they made Technicolor glorious.\n  Technicolor cameras didn&#39;t film in color. Instead they filmed in black and white, with different filters. The light entered the camera lens and went to a half-silvered mirror, which split the beam of light through a magenta lens (red and blue together), and a green lens. Behind the magenta lens was film sensitive to blue light, and film sensitive to red light. Behind the green lens was just plain light-sensitive film. The production crew ended up with three sets of film, one showing the blue light that the object they were filming gave off, one showing the red light, and one showing the green. All of these were black and white film strips. They just showed odd-looking pictures. For example, on the &#39;blue&#39; roll, a person with few blue tones in their skin would have skin that looked completely dark, while a blue ribbon would look pure white. Each of the black and white images were dyed with its proper color. Sometimes, when they were dyed, the films would combined and re-filtered, so that only bright blues would make it out of the blue-dyed film.\n    At last, when it was time for the film to be shown, the three dyed films would be layered on top of one another, to make &#39;glorious technicolor.&#39; This is why, especially in the early films, the coloring looks so painterly. It&#39;s also why most early films nearly cause eyestrain — especially the famous film  The Wizard of Oz. The Technicolor process was expensive, not just because of the camera and the technicians needed to film, but the many incidental technical issues. Some colors, if they were too subtle, would suddenly pop out as other colors. Yellows would turn green in random patches, if too much of the wrong color was filtered out. And since the beam of light entering the camera was split between multiple films, only a fraction of the light in the studio made it onto any one film. This meant that the studio needed to be extra bright. Many regulars on  The Wizard of Oz complained of eye damage from the studio lights, that lasted years.\n  Mostly, though, it meant that production teams didn&#39;t want to waste a single opportunity for color. In the books, Dorothy&#39;s slippers were silver, and the yellow brick road, silver slippers, and emerald green city were said to represent the gold standard, silverites, and paper money. But silver slippers were no fun at all on film. They might as well be filmed in black and white. Red, however, was easy to see, eye-catching, and didn&#39;t wreak havoc with the color mixing — the way the famed yellow-brick road often did. Hence the ruby slippers, which made the most of Technicolor, and an American fairy-tale was changed forever.", "posttime": "2021-08-07 02:18:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,created,看起来", "title": "Technicolor 如何在不使用彩色胶片的情况下制作 Ruby 拖鞋", "title_en": "How Technicolor created Ruby slippers without using color film", "transed": 1, "url": "https://gizmodo.com/how-technicolor-created-ruby-slippers-without-using-col-5904930", "via": "", "real_tags": ["ruby", "created", "看起来"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我上一篇关于 Sierra Online 公司历史的文章的结尾，我们看到了肯和罗伯塔威廉姆斯如何在 1993 年 9 月将他们公司的总部从加利福尼亚北部的小镇奥克赫斯特搬到西雅图郊区贝尔维尤，那里是微软等公司的所在地。正如肯承认的那样，他们这样做是出于个人和职业原因的混合。一方面，他们的孩子越来越大，奥克赫斯特的学校远非世界一流。此外，作为奥克赫斯特公司城镇鱼缸中最大的鱼的生活通常并不总是愉快的。例如，Ken 声称他的孩子有时会受到“对 Sierra 怀有怨恨的前 Sierra 员工的孩子”的欺负。其他一些前雇员怀疑搬到贝尔维尤的另一个原因是肯忽略提及的一个原因：华盛顿州没有个人所得税，而加利福尼亚州是全国最高的。尽管如此，没有理由怀疑肯在当天给出的搬回公开理由确实是计算的主要部分：需要招聘那种可以将 Sierra 提升到一个新水平的经验丰富的商业人才。自 1987 年以来，该公司的年收入每年都在增长，而且通常是大幅增长，这当然很棒。但不太妙的是，利润从来没有像这种进展所暗示的那样高。 Sierra 擅长花掉他们赚到的几乎每一分钱。事实上，尽管收入继续稳步攀升，但最近的底线却急剧下降到亏损区域。在股东的压力下，肯威廉姆斯意识到他必须找到一种方法让他的公司开始获得回报。他认为，这样做必须组建一支只有在大城市才能找到的顶级管理团队。长期以来，他一直在奥克赫斯特（Oakhurst）寻找一位摇滚明星的首席财务官，但无济于事。肯·威廉姆斯：我聘请了一家总部位于旧金山的公司 Heidrick &amp; Struggles 来领导搜索，几个月后我一无所获，我沮丧地打电话给我在海德瑞克的联系人。 “你为什么一直给我送B级和C级的候选人？”我问。我厌倦了浪费时间去面试那些不符合我要求的候选人。答案毫不犹豫地回来了：“肯，你没有明白。不，有球员想搬到奥克赫斯特。”搬到贝尔维尤九个月后，肯终于找到了他的摇滚明星，迈克布罗楚是一位金融专家，过去 19 年来一直在伯灵顿资源公司工作。肯仍然形容为“可能是我做过的最好的雇员”的那个人是一个爱唠叨的德克萨斯人，他“激发了周围每个人的信心”。并非巧合的是，Sierra 几乎从他到达的那一刻起就开始对他们的业务表现出一种新的顽固、注重底线的态度。 1994 年 11 月，布罗楚领导了谈判，最终以 4000 万美元现金将 Sierra 富有远见但一直亏损的在线游戏服务 The ImagiNation Network 出售给 AT&amp;T。改变他们的产品开发策略。多年来，公司身份的核心一直是一系列长期运行的冒险游戏系列，其中大部分都在标题中加入了“任务”一词。从写作和设计的角度来看，虽然有时是狡猾的，但他们都表现出足够可爱的品质来钻进粉丝的心。我在之前的文章中描述了 Sierra 粉丝如何感觉像是属于一个大家庭。那么，这些游戏就是你每隔几年就能在家庭聚会上看到的表亲，他们的穿着可能与上次有所不同，但始终是同一个人。他们是令人欣慰的可预测的，这正是球迷喜欢他们的方式。但是，尽管这些摇摇欲坠、充满谜题的冒险游戏擅长巩固已经转变的人的忠诚度，但它们却没有能力释放 Sierra 现在所追求的那种爆炸性增长。正如 Ken Williams 和 Mike Brochu 所公认的那样，这是个人计算机历史上的一个关键时刻。 1994 年，家用电脑的销量将超过电视，因为消费者被 Microsoft Windows 的易用性、多媒体的魔力以及有关万维网的谣言所吸引，以惊人的数量加入了计算潮流。这些人不知道来自创世纪的国王的任务。接触他们需要一种不同的游戏：在马歇尔麦克卢汉的意义上更新鲜、更热，更符合他们在电视和电影中看到的内容。似乎现在或永远不会让 Sierra 引起他们的兴趣，即使这意味着一些老粉丝会感到有点被遗弃。因此，Sierra 的新贝尔维尤管理团队仔细研究了他们现有的系列，以确定哪些是可消耗的，哪些不是。 King&#39;s Quest 是该公司的长期旗舰系列，它已经在传统的电脑游戏贫民窟之外享有一定的知名度，即使它不是罗伯塔威廉姆斯的孩子，它也会成为一个明显的守护者。休闲套装拉里也被证明对非传统人口统计具有吸引力，因此也很容易留下来。 Space Quest 是一个边缘案例，但经理们决定再开一场比赛，哪怕只是为了向老派球迷扔骨头。但是 Police Quest 将从一系列冒险游戏改造成一系列战术 3D 动作游戏，而 Quest for Glory 将完全获得斧头。展望未来，主要重点将放在雇佣人类演员进行更大预算的冒险上，为此 Sierra 现在正在奥克赫斯特以相当大的成本建造自己的声场。他们会减少这种新型冒险的制作，但它们中的每一个都将是华而不实的高保真制作，能够吸引大屏幕电视和 CD 播放器断奶的大众市场。这个想法是让每一次 Sierra 冒险的发布都成为一个真实的事件。\n不幸的是，从一种产品策略到另一种产品策略的转变带来了一个陷阱：实现它需要一些时间，这意味着 1994 年在新游戏方面将是异常平静的一年。而这一现实，再加上新管理团队更加顽固的态度，意味着奥克赫斯特的一些人必须失业。其中包括 Quest for Glory 背后的夫妻团队 Corey 和 Lori Cole，他们的角色被取消以及他们系列的第五场比赛，这是 Sierra 系列系列中最令人印象深刻的设计野心和创新。科里回忆了一个场景，让在场的每个人都清楚地看到塞拉现在是作为一家企业而不是一家人来经营的：“会议上的所有员工都收到了信封；其中大约一半包含“粉红单”，通知他们不再为 Sierra 工作。这些员工被护送回大楼，看着他们从办公桌上取回个人物品。”裁员从来都不是一件容易的事。科里特别记得曾参与过 Sierra 的两款 EcoQuest 游戏和 Pepper&#39;s Adventures in Time 的 Gano Haine 站在停车场哭泣的情景：“Sierra 是她的梦想，她很高兴能在那里得到这份工作。”在这一痛苦的过渡年中，Sierra 仅发布了一款由 Oakhurst 打造的新冒险游戏，这使其成为近十年来在这方面最多产的一年。值得庆幸的是，对于豆计数器，有问题的游戏是 Sierra 最赚钱的冒险系列中的最新一期。 King&#39;s Quest VII: The Princeless Bride 是自 1984 年以来 Sierra 不断发展的技术展示系列中的一个典型条目。但是，这种描述本身至少意味着在技术方面的创新，而这个新条目确实实现了。虽然它没有聘请电影演员，但 King&#39;s Quest VII 以另一种方式表明了 Sierra 的新方向：它的目标不是一部互动电影，而是一部值得与迪士尼等公司进行比较的互动卡通片，这是一种雄心壮志，需要它看起来除了 Sierra 自己的一群才华横溢的内部艺术家之外，它的一些视觉效果。肯·威廉姆斯首先联系了一家名为皮克斯的新兴动画工作室。他甚至亲自与皮克斯董事长兼大股东史蒂夫·乔布斯进行了交谈，但最终该工作室被证明太忙于制作他们的第一部全长故事片《玩具总动员》，也无法承担这项任务。因此，Sierra 最终将序列外包给不少于四家其他外部动画工作室，此外还聘请了自己的艺术家来创作符合当时标准的真正视听盛宴。正如 Charles Ardai 在他为 Computer Gaming World 杂志所做的评论中所描述的那样，King&#39;s Quest VII 充满了迪士尼。我在我妈妈（一个大童话迷）身上试过这个游戏，她问：“这是迪士尼的游戏吗？”当我给出否定的回答时，她说：“但他们正在努力做迪士尼，对吗？”他们确实是。从开场画面，魔法森林中的露珠滴在魔法瓢虫的肚子上，到几秒钟后可爱的罗塞拉公主用优美的赞歌向她即将成为的人唱出她皇室的心声的场景- 失落的青春期，《国王的探索 VII》的每个动画姿势都散发着迪士尼般的品质。每一帧都是美丽的，每一行都整齐而准确，相机飞扬和滑行，乐谱的音符在跳跃的气泡中叮当作响，就像一瓶汽水一样。这就是小美人鱼或美女与野兽或阿拉丁的迪斯尼，如果你扣除那部电影针对成人的讽刺感。这是石中剑和爱丽丝梦游仙境的迪斯尼，像舒芙蕾一样轻盈蓬松。这不是小鹿斑比或白雪公主的迪斯尼；在这里，即使是威胁也是可爱的奇思妙想。如果恶棍吓坏了，那只是很短的时间，然后大家又聚在一起再唱一首歌。游戏来自 Sierra 而不是迪士尼，这根本不重要。这符合迪士尼精神。\n除了令人垂涎的新外观外，该游戏还展示了对 Robera Williams 早期作品的一些受欢迎的设计演变。在 LucasArts 的 The Secret of Monkey Island 指明道路四年之后，King&#39;s Quest VII 终于设法摆脱了无数隐藏的死胡同，这些死胡同总是让玩罗伯塔·威廉姆斯的游戏感觉就像是在和一个虐待狂玩虚构的游戏。另一方面，玩家的死亡人数仍然很多，而且仍然毫无线索，基本上是随机的，但现在至少相对来说没有痛苦。游戏现在不再期望你每五分钟保存一次，而是让你回到你之前的点，在你愚蠢到看错东西或在错误的房间里磨蹭太久之前。事实上，这样的保存文件完全消失了；现在退出游戏会自动为您的进度添加书签。这些变化都是为了让游戏更受新玩家欢迎，希望他们能被说服尝试一下，尽管它的名字后面有不祥的罗马数字。为了进一步强调这是一款更友善、更温和的 King&#39;s Quest，它使用了一个完全简化的界面，该界面围绕一键式鼠标光标构建。更奇怪的是，Sierra 可以随时播放它的任何章节，这意味着你可以从高潮开始，如果你愿意的话，可以倒退到序幕。 （当然，此功能的真正意义在于让您观看每一章的开场电影而不必亲自接触实际游戏，如果您碰巧是通常购买每个新国王的任务的众多人之一他们最新电脑的技术演示。）但唉，在其他方面，这个最新的条目真的只是另一个国王的探索。罗伯塔·威廉姆斯 (Roberta Williams) 和她最新的学徒合作设计师罗蕾莱·香农 (Lorelei Shannon) 的作品通常是童话故事和流行文化蜉蝣的散布混合体，缺乏足够的机智或想象力，即使像模仿一样引人注目，而拼图设计却是只是因为没有死人行走的情况，所以比平时少了一些愤怒。随着游戏的进行，写作和谜题都明显变得更糟，这可能表明首席设计师对她的大系列感到越来越无聊，实际上已经在为她的下一个非常不同的游戏工作。在 King&#39;s Quest VI 之后，所有这一切都令人倍感失望，这款游戏似乎预示着一个系列终于开始更加认真地对待它的工艺。即使是《国王的探索 VII》大肆吹嘘的外观，虽然在其个别部分令人印象深刻，但总体而言却造成了相当不和谐的混乱，这是许多不同动画师团队的作品。尽管如此，King&#39;s Quest VII 于 1994 年 11 月发行时销量非常好，正如该系列中的游戏一样。与此同时，Dynamix 是 Sierra 附属工作室中最稳定的，在非冒险游戏 Aces of the Deep、Front Page Sports：Football &#39;Pro 95 和 Metaltech：EarthSiege 中表现出色。然而，最重要的是，ImagiNation 的意外收获将原本丑陋的一年变成了实际上看起来相当不错的一年：8340 万美元的收入，高于 1993 年的 5950 万美元，伴随而来的是 1200 万美元利润，而上一年则亏损 860 万美元。现在，要让派对在 1995 年继续下去取决于新产品战略。该战略的第一个重大考验是罗伯塔·威廉姆斯 (Roberta Williams) 一直在与 King&#39;s Quest VII 同步开发的游戏。 Phantasmagoria 将充分利用 Sierra 刚刚建造的 Oakhurst 声场。这是一场与任何流行天后相匹配的类型的比赛：罗伯塔，适合家庭的“冒险游戏女王”，变得黑暗而性感。 “凭借《幻境》，”塞拉的营销人员写道，“罗伯塔·威廉姆斯创造了一个写得非常棒的互动故事，充满了恐怖和悬念，并且在任何时候都完全在玩家的掌控之中。” Sierra 新声场的策划者 Bil​​l Crow 相信“Phantasmagoria 将向更广泛的游戏玩家观众开放市场。我们现在开始提供更接近普通消费者的视听体验。”换句话说，在《幻境》中，电脑游戏即将从他们的书呆子的贫民窟中爆发出来，成为有眼光的成年人的复杂娱乐。时代如何变化。今天，《幻境》或多或少是一个笑柄，是冒险游戏全动态视频时代所有错误的整洁缩影。事实上，它的一些不好的说唱有点夸张；它并不比 1990 年代中期的其他几十部类似的作品更糟糕。当然，许多其他游戏也有同样俗气的表演、同样无能的写作和同样琐碎的游戏玩法。 Phantasmagoria 以搞笑无能而闻名的现代声誉在很大程度上源于其鼎盛时期的主流地位。 Sierra 掀起的炒作浪潮，其中大部分是从罗伯塔本人口中发出的，对于像您这样的尖刻评论者来说，这真的是一种猫薄荷，他们情不自禁地把这一切都扔回了她的脸上。 “我想探索具有大量实质内容和深刻情感的游戏，”罗伯塔说。但是《幻境》非常非常不是那种游戏。如果你斜视得恰到好处，你可以看到她试图创造的东西：一个幽闭恐惧症的心理恐怖游戏，一个交互式版本的闪灵。但是，唉，没有人参与其中。 Phantasmagoria 围绕着一对名叫 Adrienne 和 Don 的艺术新婚夫妇展开，他们分别是小说家和摄影师。故事开始时，他们刚刚搬进了新英格兰海岸附近一个人烟稀少的小岛上的一座杂乱无章的老宅。我们很快了解到，他们是近一个世纪以来第一批尝试住在房子里的人。最后一个在他们面前这样做的人是一位名叫卡诺的奇异舞台魔术师，他以惊人的速度经历了年轻漂亮的妻子——他们都突然从岛上消失了，再也没有出现过。最后，卡诺本人消失了，直到我们的英雄出现为止，这就是房子。当这个地方被邪恶的灵魂所困扰时，除了他们之外，绝对没有人感到惊讶。它很快开始占据 Don 的心，让玩家控制的角色 Adrienne 试图在她的丈夫谋杀她之前解开这个谜团，就像 Carno 杀死他所有的妻子一样。\n有点令人惊讶的是，鉴于 Sierra 的大众市场愿望，他们从未尝试像 Origin Systems 当时为 Wing Commander 特许经营所做的那样，为 Phantasmagoria 聘请“知名”演员。 Adrienne 的角色由 Victoria Morsell 担任，Sierra 雄心勃勃地将其描述为“电影、电视和戏剧明星”，显然将部分部分与主演部分混淆了。尽管如此，她在任务的尴尬限制下还是做得不错。另一方面，大卫·霍姆扮演唐的角色很糟糕。在恐怖开始之前，当他试图扮演一个慈爱的丈夫却惨遭失败时，他的木讷表演显得更加令人毛骨悚然，而不是在他的头脑开始隐喻地旋转之后。其余的演员也是一个类似的混合包。 Sierra 聘请了一位名叫 Peter Maris 的导演，在他身后拍摄了大量超低预算的超低成本电影，最终花了整整四个月的时间进行拍摄。即使考虑到他的作品并不完全符合奥斯卡的水准，他对节奏的完全漠视也很奇怪。 Phantasmagoria 的七张 CD——是的，七张——充满了无休止的序列，其中 Adrienne 一块一块地拆卸砖烟囱，或者一块一块地打破木门板，或者一层一层地涂上她的早晨化妆。事实上，Adrienne 坚持在整个游戏过程中在房子里的许多镜子前停下来整理自己，我们不得不在她这样做的时候观察和等待，希望不希望这周围会发生一些有趣的事情。 （尽管罗伯塔威廉姆斯在男性主导的行业中作为女性先驱的所有身份，她的游戏对性别的看法并不总是最先进的。）所有这些，再加上笨拙、过于冗长的剧本，让游戏看起来比实际玩的几个小时要长得多。这里最好有一部（糟糕的）90 分钟的恐怖电影，其中有最好的情节推进镜头； Sierra 可以轻松地丢弃七张 CD 中的三张，而不会损失太多。大肆吹嘘的“成人”内容远没有人们说的那么简单。开幕电影包括媒体史上最不性感的性爱场面。肯·威廉姆斯说，最初是要展示阿德里安娜的裸照，但塞拉最终失去了勇气：“到了发布游戏的时候，我们对其进行了编辑，只显示了一些侧面的胸部。”鉴于它已经是多么奇怪和尴尬，我们只能感谢他们最后一刻的谨慎。游戏也不是很可怕，尽管它不时变得令人毛骨悚然——一种非常不同的品质——。这些场景出现在 Adrienne 看到很久以前发生在房子不同房间的谋杀的幻象时，或者在游戏的后期，由于玩家的失败，她自己遇到了不幸的结局.不论结果好坏， ......", "note_en": "At the conclusion of  my previous article on Sierra Online’s corporate history, we saw how Ken and Roberta Williams moved their company’s headquarters from the tiny Northern California town of Oakhurst to the Seattle suburb of Bellevue, home to Microsoft among others, in September of 1993. They did so for a mixture of personal and professional reasons, as Ken has since acknowledged. Their children were getting older, for one thing, and the schools in Oakhurst were far from world-class. Additionally, life in general as the biggest fish of all in the fishbowl of a company town that Oakhurst had become wasn’t always pleasant; for example, Ken has claimed that his kids were at times bullied by “the children of former Sierra employees who had a grudge against Sierra.” Some other former employees suspect still another reason for the move to Bellevue, one that Ken neglects to mention: the fact that Washington State had no personal income tax, while California’s was the highest in the nation.\n Still, there are no grounds to doubt that the public reason Ken gave for the move back in the day was indeed a major part of the calculation: the need to recruit the sort of seasoned business talent that could take Sierra to the next level. The company’s annual revenues had grown every single year since 1987, more often than not substantially, and this was of course wonderful. But less wonderful was the fact that profits had never been as high as that progression would imply; Sierra had a knack for spending almost every dime they earned. Of late in fact, the bottom line had dipped sharply into loss territory even as revenues continued their steady climb. Under pressure from his shareholders, Ken Williams realized that he had to find a way to make his company start to pay off. He believed that doing so must entail assembling the kind of top-flight management team which could only be found in a big city. He’d been seeking a rock star of a chief financial officer for a long time from Oakhurst to no avail. Ken Williams:\n I had hired a San Francisco-based company, Heidrick &amp; Struggles, to lead the search, and after months of getting nowhere I called my contact at Heidrick in frustration. “Why do you keep sending me B and C level candidates?” I asked. I was tired of having my time wasted interviewing candidates who were not at the level I was seeking. The answer came back without hesitation: “Ken, you’re aren’t getting it. No A player wants to move to Oakhurst.”\n Nine months after the move to Bellevue, Ken finally found his rock star in the form of one Mike Brochu, a financial whizz who had spent the last nineteen years working for Burlington Resources. The man whom Ken still describes as “probably the best hire I ever made” was a garrulous Texan who “inspired confidence in everyone around him.” Not coincidentally, Sierra began to display a newly hard-nosed, bottom-line-focused attitude toward their business from virtually the moment of his arrival. As one of his first projects, Brochu led the negotiations that resulted in the sale of  The ImagiNation Network, Sierra’s visionary but perpetually money-losing online-gaming service, to AT&amp;T for $40 million in cash in November of 1994.\n Meanwhile Sierra implemented a significant shift in their product-development strategy. For many years now, the heart of the company’s identity had been a set of long-running adventure-game series, most of which worked the word “quest” somewhere into their title. Dodgy from the standpoints of both writing and design though they sometimes were, they’d all displayed enough lovable qualities to worm their way into fans’ hearts. I’ve described in earlier articles how Sierra fandom could feel like belonging to a big extended family. These games, then, were the cousins whom you could always expect to see at the family reunion every couple of years, dressed perhaps a bit differently than last time around but always the same person at bottom. They were comfortingly predictable, and that was exactly how the fans liked them.\n But for all that these ramshackle, puzzle-heavy adventure games were good at cementing the loyalty of the already converted, they were less equipped to unleash the sort of explosive growth Sierra was now after. It was a pivotal moment in the history of the personal computer, as Ken Williams and Mike Brochu well recognized. In 1994, more home computers would be sold than televisions, as consumers, tempted by the ease of use of  Microsoft Windows, the magic of multimedia, and rumors of a thing called the World Wide Web, jumped onboard the computing bandwagon in staggering numbers. These people didn’t know a  King’s Quest from an  Ultima. Reaching them would require a different sort of game: fresher,  hotter in the Marshall McLuhan sense, more in tune with what they were seeing on television and at the movies. It seemed like it was now or never for Sierra to capture their interest, even if it meant that some of the old fans were left feeling a bit abandoned.\n So, Sierra’ new Bellevue management team took a hard look at their existing series in order to decide which were expendable and which were not.   King’s Quest, the company’s longstanding flagship series, which already enjoyed a measure of name recognition outside the traditional computer-gaming ghetto, would have been an obvious keeper even if it hadn’t been the baby of Roberta Williams.   Leisure Suit Larry also had proven appeal with non-traditional demographics, and was thus also a no-brainer to keep around.   Space Quest was an edge case, but the managers decided to green-light one more game, if only to throw a bone to the old-school fans. But   Police Quest would get revamped from a line of adventure games into a line of tactical 3D action games, while   Quest for Glory would get the axe entirely. Going forward, the main focus would be on bigger-budget adventures employing filmed human actors, for which Sierra was now building their own sound stage down in Oakhurst at considerable cost. They would make fewer of this new type of adventure, but each of them would be a flashy, high-fidelity production, able to appeal to a mass market weaned on big-screen televisions and CD players. The idea was to make the release of each Sierra adventure from now on a real  event.\n Unfortunately, the transition from one product strategy to another came with a pitfall: it would take some time to bring it off, meaning that 1994 would be an unusually quiet year in terms of new games. And that reality, combined with the new management team’s more hard-nosed attitude, meant that some of the folks in Oakhurst must lose their jobs. Among them were Corey and Lori Cole, the husband-and-wife team behind  Quest for Glory, who saw their roles cancelled along with the fifth game in their series, the most impressive of all the series in the Sierra lineup in terms of design ambition and innovation. Corey recalls a scene which made it all too clear to everyone present that Sierra was now being run as a business, not a family: “All employees in the meeting were handed envelopes; about half of them contained ‘pink slips’ notifying them that they no longer worked for Sierra. Those employees were escorted back into the building and watched as they retrieved personal belongings from their desks.” Layoffs are never easy. Corey especially remembers the sight of Gano Haine, who had worked on Sierra’s  two  EcoQuest games and  Pepper’s Adventures in Time, standing in the parking lot crying: “Sierra had been her dream, and she was so thrilled to have gotten the job there.”\n During this year of wrenching transition, Sierra released just one new Oakhurst-built adventure game, making it their least prolific year in that respect in almost a decade. Thankfully for the bean counters, the game in question was the latest installment in Sierra’s most bankable adventure series of them all.  King’s Quest VII: The Princeless Bride was a typical entry in a series that had been Sierra’s ever-evolving technological showpiece since 1984. But then, that description in itself implies innovation on at least a technical front, and this the new entry certainly delivered.\n  Although it did not employ filmed actors,  King’s Quest VII was indicative in another way of Sierra’s new direction: rather than an interactive movie, it aimed to be an interactive cartoon worthy of comparison to the likes of Disney, an ambition which required it to look beyond Sierra’s own stable of talented in-house artists for some of its visuals. Ken Williams first reached out to an up-and-coming animation studio known as Pixar. He even spoke personally with Steve Jobs, Pixar’s chairman and majority owner, but in the end the studio proved to be simply too busy working on  Toy Story, their first full-length feature film, to take on this task as well. So, Sierra ended up contracting sequences out to no fewer than four other outside animation studios, in addition to employing their own artists to create what truly was an audiovisual extravaganza by the standards of its time.  King’s Quest VII went full Disney, as Charles Ardai described in his review for  Computer Gaming World magazine.\n I tried this game on my mother (a big fairy-tale fan), who asked, “Is that a game from Disney?” When I replied in the negative, she said, “But they’re trying to do Disney, right?”\n They are indeed. From the opening frames, where drops of dew in an enchanted forest drop on the tummy of an enchanted ladybug, to the scene a few seconds later in which lovely Princess Rosella sings her royal heart out in a tuneful paean to her about-to-be-lost adolescence, King’s Quest VII exudes Disney-like quality from each of its cel-animated poses.\n Every frame is beautiful, every line is neat and pert, the camera soars and glides, and the notes of the musical score tinkle out in bounding effervescence like the fizz out of a bottle of soda pop. This is the Disney of The Little Mermaid or Beauty and the Beast, or Aladdin, if you deduct that film’s adult-targeted sense of irony. It’s the Disney of The Sword in the Stone and of Alice in Wonderland, light and fluffy as a soufflé. It’s not the Disney of Bambi or Snow White; here even the menaces are adorable bits of whimsy. If the villains ever frighten, it’s only for a brief time, and then everyone gets together again for one more song.\n It matters not at all that the game is from Sierra rather than Disney. It is true to the Disney spirit.\n Along with the mouth-watering new look, the game showed some welcome design evolution over Robera Williams’s earlier work. Four years after LucasArts’s   The Secret of Monkey Island had pointed the way,  King’s Quest VII finally managed to free itself from the countless hidden dead ends that had always made playing a Roberta Williams game feel like playing make-believe with a sadist. Player deaths, on the other hand, were still copious, and still so unclued as to be essentially random, but were now at least relatively painless. Rather than expecting you to save every five minutes, the game was now kind enough to return you to the point you were at before you were so foolish as to look at the wrong thing or dilly-dally in the wrong room a second too long. In fact, save files as such disappeared altogether; exiting the game now automatically bookmarked your progress.\n  These changes all existed in the name of making the game more welcoming to brand new players, out of the hope that they could be convinced to give it a try despite the ominous Roman numeral after its name. To further emphasize that this was a kinder, gentler  King’s Quest, it used a radically simplified interface built around a one-click-does-it-all mouse cursor. More oddly, Sierra made it possible to play any of its chapters at any time, meaning you could start with the climax and work backward to the prologue if you were so inclined. (The real point of this feature, of course, was to let you watch each chapter’s opening movie without having to get your hands dirty with the actual game, if you happened to be one of the many people who typically bought each new  King’s Quest as a tech demo for their latest computer.)\n But alas, in other ways this latest entry really was just another  King’s Quest. The writing from Roberta Williams and Lorelei Shannon, her latest apprentice co-designer, was the usual scattershot blend of fairy-tale and pop-culture ephmera, lacking sufficient wit or imagination to be all that compelling even as pastiche, while the puzzle design was made less infuriating than usual only by the lack of dead-player-walking situations. Both the writing and the puzzles got noticeably worse as the game wore on, evidence perhaps of a lead designer who was feeling increasingly bored with her big series, and was in fact already working on her next, very different game. All of this was doubly disappointing coming on the heels of  King’s Quest VI, a game which had seemed to herald a series that was at last beginning to take its craft a bit more seriously. Even the much-vaunted look of  King’s Quest VII, although impressive in its individual parts, made for a rather discordant jumble when taken in the aggregate, being the work of so many different teams of animators.\n Nevertheless,  King’s Quest VII sold very well upon its release in November of 1994, as games in the series always did. Meanwhile Dynamix, the most consistent of Sierra’s subsidiary studios, delivered solid performers in the non-adventure games   Aces of the Deep,   Front Page Sports: Football ‘Pro 95, and   Metaltech: EarthSiege. Most of all, though, it was the ImagiNation windfall that turned what would otherwise have been an ugly year into one that actually looked pretty good on the bottom line: $83.4 million in revenues, up from $59.5 million in 1993, with an accompanying $12 million profit, in contrast to an $8.6 million loss the previous year. Now it was up to the new product strategy to keep the party going in 1995.\n The first big test of that strategy was to be the game that Roberta Williams had been working on concurrently with  King’s Quest VII.  Phantasmagoria would take full advantage of the Oakhurst sound stage Sierra had just built. It was to be a play against type worthy of any pop diva: Roberta, the family-friendly “queen of adventure gaming,” was going  dark  and  sexy. “With  Phantasmagoria,” wrote Sierra’s marketers, “Roberta Williams has created a superbly written interactive story, fraught with horror and suspense, and totally in the player’s control at all times.” Bill Crow, the mastermind of Sierra’s new sound stage, believed that “ Phantasmagoria is going to open the market to a much broader audience of game players. We’re now starting to deliver an audiovisual experience that’s much closer to what the average consumer can relate to.” With  Phantasmagoria, in other words, computer games were about to burst out of their nerdy ghetto to become sophisticated entertainments for discerning adults.\n How times do change. Today  Phantasmagoria is more or less a laughingstock, a tidy microcosm of everything that was wrong with the full-motion-video era of adventure games. In truth, some of its bad rap is a bit exaggerated; it’s not really any worse than dozens of other similarly dated productions of the mid-1990s. Certainly plenty of other games had equally cheesy acting, equally clueless writing, and equally trivial gameplay.  Phantasmagoria‘s modern reputation for hilarious ineptitude stems to a large extent from its mainstream prominence in its heyday. The wave of hype that Sierra unleashed, much of it issuing from the mouth of Roberta herself, is catnip for snarky reviewers like yours truly, who can’t help but throw it all back in her face. “I want to explore games with a lot of substance and deep emotions,” Roberta said. But  Phantasmagoria is so very, very much not that kind of game. If you squint just right, you can see what she was trying to create: a game of claustrophobic psychological horror, an interactive version of  The Shining. But alas, nobody involved had the chops to pull it off.\n Phantasmagoria revolves around a couple of artsy newlyweds named Adrienne and Don, a novelist and a photographer respectively. As the story begins, they’ve just moved into a rambling old mansion on a sparsely inhabited island off the coast of New England. They’re the first people to attempt to live in the house, we soon learn, in almost a century. The last person to do so before them was a strange stage magician named Carno the Magnificent, who went through pretty young wives at a prodigious rate — all of them abruptly disappearing from the island, never to be seen again. In the end, Carno himself disappeared, and that was that for the house until our heroes turn up. It comes as a surprise to absolutely no one except them when the place turns out to be haunted by a malevolent spirit. It quickly begins to take over the mind of Don, leaving Adrienne, the character the player controls, to try to sort out the mystery before her husband murders her like Carno killed all of his wives.\n Somewhat surprisingly in light of Sierra’s mass-market aspirations, they never attempted to hire “name” actors for  Phantasmagoria in the way that Origin Systems was  doing at the time for the  Wing Commander franchise. The role of Adrienne went to Victoria Morsell, whom Sierra rather ambitiously described as a “film, TV, and theater star,” having apparently confused bit parts with starring ones. Still, she does a decent job within the awkward constraints of her task. David Homb in the role of Don, on the other hand, is just awful; his wooden performance comes off as more creepy before the horror starts, when he’s trying to play a loving husband and failing at it abjectly, than it does after his head starts metaphorically spinning around. The rest of the cast is a similarly mixed bag.\n Sierra hired a director named Peter Maris, with a long run of schlocky ultra-low-budget films behind him, for a shoot that wound up taking fully four months. Even given that his oeuvre wasn’t exactly of Oscar caliber, his complete disregard for pacing is bizarre.  Phantasmagoria‘s seven CDs — yes,  seven — are filled with interminable sequences where Adrienne disassembles a brick chimney piece by piece, or breaks through a wooden door board by board, or applies her morning makeup layer by agonizing layer. Indeed, Adrienne insists on stopping and preening herself at each of the many mirrors in the house throughout the game, and we’re forced to watch and wait while she does so, hoping against hope that something interesting might happen this around. (For all of Roberta Williams’s status as a female pioneer in a male-dominated industry, her games’ view of gender isn’t always the most progressive.) All of this, combined with the clumsy, overly wordy script, makes the game seem much longer than the few hours it actually takes to play. There’s a (bad) 90-minute horror flick worth of plot-advancing footage here at the best; Sierra could easily have ditched three of the seven CDs without losing much at all.\n The much-vaunted “adult” content is rather less than it’s cracked up to be. The opening movie includes the least sexy sex scene in the history of media. Ken Williams says that it was originally to have shown Adrienne topless, but Sierra lost their nerve in the end: “When it came time to release the game, we edited it to only show some side boob.” Given how weird and awkward it already is, we can only be thankful for their last-minute fit of prudishness.\n Nor is the game remotely scary, although it does get gruesome — a very different quality — from time to time. These sequences come when Adrienne is visited by visions of the murders that took place long ago in the different rooms of the house, or, in the latter stages of the game, when she herself meets an unfortunate end thanks to a failure on the player’s part. For better or for worse, \n......", "posttime": "2021-08-07 02:18:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "支付,sierra", "title": "让塞拉支付", "title_en": "Making Sierra Pay", "transed": 1, "url": "https://www.filfre.net/2021/08/making-sierra-pay/", "via": "", "real_tags": ["支付", "sierra"]}, {"category": "", "categoryclass": "", "imagename": "491de32e8341680a61c0686c7452c067.jpg", "infoid": 1071819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何人在会所上说什么都不重要。会所的整个点是有目共睹的。谁说话或他们说什么都无关紧要。重要的是他们被视为地位高的人。当没有人可以亲眼看到时，会所便声名鹊起。每个人都被困在自己的家中。对某个群体享有很高声誉、信誉或价值的人无法亲自展示自己的地位。他们不能当面吹嘘他们所做的工作，表明他们有多聪明，或者告诉你他们在一些很酷的公司中的角色。俱乐部是一种与其他地位高的人一起被看到的方式，尤其是在科技和加密等领域。现在可以再次亲眼看到地位高的人，他们在会所上花费的时间减少了。地位较低的人只能试图让别人看到他们。如果没有高地位的人，Clubhouse 就没有达到帮助人们被人看到的目的。这是一种货物崇拜：地位低下的人重新创造地位高的人的行为，在他们离开后，认为这会使他们成为高地位的人。状态游戏的遗迹在设计中。甚至在您进入房间之前，Clubhouse 就会向您展示您关注的人。用户可以根据房间的大小、扬声器的状态以及他们关注的任何人的状态来判断房间的状态。地位高的人通常最受关注，因此他们引导发现。如果没有这些人，发现就会被玩弄，变得不那么重要。每个房间都有状态游戏在里面玩。如果您查看其他实时社交应用程序，观众通常会做一些诸如聊天或反应之类的事情。在Clubhouse上，任何不说话的人除了听和看房间里的其他成员外，无事可做。当您查看屏幕时，您会看到每个房间都是一个层次结构。重要的人在上，他们的支持在中，观众在下。重要人物上台。它是被看见的最高形式。在大房间里，如果你在舞台上，即使你不说话，每个人的注意力都在你身上。这些人实际上是在顶部并占据最多的空间，最大的化身只有三排。他们的地位因与地位高的人在一起而增加。这是寻求地位的会所用户的最终目标。层次结构的下一个级别是状态支持组。它是演讲者跟随的人群的指定区域。如果有地位高的人在场，那说明台上的人一定是地位很高的人。它们为舞台上的人提供了额外的可信度，并帮助更多人发现房间。\n例如，一个创业公司创始人在一个房间里讲话，而一位著名的风险投资家在观众席中。如果该 VC 了解这家公司，则不会共享任何新信息，但是这样做是有条件的。在那里有利于演讲者（创始人）和地位支持成员（VC）的地位。风险投资家的权威会影响演讲者，使他们看起来更合法。层次结构中的最低层是观众。这些人的等级很低，他们很少在大房间里看到。任何想被人看到并获得地位的人都应该尝试离开这个区域。人们来到这里是因为他们对对话真正感兴趣，或者试图提升等级以便获得地位。地位低的观众很少有机会进入大房间。他们是上层人士的地位饲料。现在，地位高的人大部分都走了，地位低的人填补了各个层次，并试图重新创造动态。 Clubhouse的设计还是一样的。人们试图在受欢迎的房间里出现在舞台上。主办方尽量优化他们的房间被推荐。用户用他们关心的兴趣和话题来填充他们的生物。所有这一切都被稀释了，因为有地位的人已经不在了。人们想要的地位和认可并不存在。拥有大量观众的“必听”房间较少。房间更小，由兴趣或话题驱动，而不是所涉及的人。由您关注的人驱动的推荐算法不太相关。以下列表中越来越多的人是活跃在 Clubhouse 的低地位人士，而不是来自现实世界的高地位人士。现在任何人都可以加入，包括 Android 用户，作为邀请和 iPhone 启动的排他性正在逐渐消失。会所不再是人们所看到的高地位场所。一个说明这一点的方法是害怕错过俱乐部会所的恐惧下降。很少有人认为他们不在那里就错过了任何东西。与人们购买邀请、将邀请发送给他们最亲密的朋友、在平台上花费数小时以及在社交媒体上谈论它的高峰期相比，Clubhouse 不再像以前那样具有魔力。现在可以在现实生活中的专属场所看到地位高的人在一起。面对面的派对和活动是无法与之竞争的。似乎所有其他大型科技公司都在模仿 Clubhouse，这也无济于事。每个人都想重现会所的魔力。会所能否重现成为显赫地位的魔力？他们可以试试。对于每一类人，不仅在技术和加密领域，他们必须成为与其他高地位人士一起看到的“地方”。地位高的人一定想展示自己的地位，并与平台上的其他人分享。如果发生这种情况，低地位的货物邪教成员将获得他们正在寻找的地位提升。\n另一种选择是拥抱地位较低的人。许多有趣的房间和行为发生在大房间之外。诸如消息传递之类的最新版本暗示他们正在远离仅是一个“可以看到的地方”。该应用程序有潜力成为大众音频社交网络。这很可能是一直以来的计划，他们幸运地打破了“值得一看的地方”的消遣。不管怎样，人们总是想被人看到。会所暂时抓住了这种需求。要想像以前想象的那样成功，他们需要更大规模地再做一次，或者接受地位较低的人的行为。如果没有，Clubhouse 的货物崇拜将继续。感谢来自 Foster 的 Jesse Germinario、Steven Ovadia、Padmini Pyapali、Diana Klatt、Kat Dee、Stacey King Gordon 和 Christine Cauthen 的反馈。", "note_en": "Nothing anyone says on Clubhouse matters. The whole point of Clubhouse is to be seen. It doesn’t matter who speaks or what they say. It matters that they are seen as high status people.\n Clubhouse rose to prominence when no one could be seen in person. Everyone was stuck in their homes. Someone with a high reputation, credibility, or value to a group couldn’t flex their status in person. They couldn’t brag in person about the work they were doing, signal how smart they were, or tell you about their role at some cool company. Clubhouse was a way to be seen with other high status people, especially in circles like tech and crypto.\n Now that high status people can be seen in person again, they are spending less time on Clubhouse. Lower status people are left trying to be seen amongst themselves. Without high status people, Clubhouse is not serving its purpose of helping people be seen. It is a cargo cult: low status people recreating the actions of high status people, after they have left, thinking it will cause them to be high status.\n  The relics of the status games are in the design. Even before you enter a room, Clubhouse shows you the people you follow in it. A user can judge the status of a room based on its size, the status of the speakers, and the status of any people they follow. High status people are often the most followed so they guide the discovery. Without these people, discovery is gamed and less relevant.\n Each room has status games being played within it as well. If you look at other live social apps, audiences generally do something like chat or react. On Clubhouse, anyone not talking has nothing to do except listen and look at other members of the room. When you look at the screen, you’ll see every room is a hierarchy. The important people on top, their support in the middle, and the audience on the bottom.\n The important people are on stage. It is the highest form of being seen. In big rooms, if you are on stage, everyone’s attention is on you, even if you aren’t speaking. These people literally are at the top and take up the most space, having the largest avatars only three to a row. Their status increases by being there with high status people. This is the ultimate goal of a status-seeking Clubhouse user.\n The next level of the hierarchy is the status support group. It is a designated zone for the group of people who the speakers follow. If high status people are here, it means the people on stage must be very high status. They provide extra credibility for those on stage and help the room get discovered by more people.\n For example, a startup founder is speaking in a room and a prominent venture capitalist is in the audience. If that VC knows the company, there isn’t any new information going to be shared, but there is status to doing it. It is beneficial to the status of both the speaker (founder) and the status support member (VC) to be there. The venture capitalist’s authority rubs off on the speakers, making them seem more legitimate.\n  The lowest in the hierarchy is the audience. These people are so far down the hierarchy they are rarely ever seen in large rooms. Anyone who wants to be seen and gain status should try to leave this area. People are here because they are truly interested in the conversation or are trying to move up the hierarchy so they can gain status. Low status audience members rarely get a chance to engage in big rooms. They are status fodder for people up the hierarchy.\n  Now that the high status people are mostly gone, lower status people fill all levels and try to recreate the dynamics. The design of Clubhouse is still the same. People try to be seen on stage in popular rooms. Organizers try to optimize their room to be recommended. Users fill their bio with interests and topics they care about. All of this is diluted because the people with status aren’t there anymore. The status and recognition people want is not there.\n There are fewer “must-listen” rooms with massive audiences. Rooms are smaller and driven by interests or topics, rather than the people involved. The recommendation algorithm, which is driven by people you follow, is less relevant. Following lists are increasingly filled with low status people who are active on Clubhouse rather than high status people from the real world. The exclusivity from launching as invite and iPhone only is wearing off now that anyone can join including Android users. Clubhouse is not the high status place to be seen anymore.\n A way to illustrate this is the decline in fear of missing out on Clubhouse. Few people think they are missing anything by not being there. Compared to its peak when people were buying invites, sending them to their closest friends, spending hours on the platform, and talking about it on social media, Clubhouse doesn’t have the same magic it once did.\n High status people can now be seen together in exclusive places in real life. In person parties and events are impossible to compete with. It also doesn’t help that Clubhouse is being copied by seemingly every other big tech company. Everyone wants to recreate the magic Clubhouse had.\n Can Clubhouse ever recreate the magic of being a high status place to be seen? They can try. For every category of people, not only in tech and crypto, they must become “the place” to be seen with other high status people. High status people must want to flex their status and share it with others on the platform. If this happened, the low status cargo cult members would gain the status boost they’re looking for.\n The other option is to embrace the lower status people. Many interesting rooms and behaviours are happening outside the big ones. Recent releases like  messaging give hints they are moving away from only being a “place to be seen.” The app has the potential to be the mass audio social network. This was likely the plan all along, and they had a lucky break with the “place to be seen” diversion.\n Either way, people always want to be seen. Clubhouse, for a moment, captured that need. To succeed as once thought, they need to do it again at a larger scale or embrace the behaviours of lower status people. If not, the cargo cult of Clubhouse will continue.\n  Thanks to  Jesse Germinario,  Steven Ovadia,  Padmini Pyapali,  Diana Klatt,  Kat Dee, Stacey King Gordon, and Christine Cauthen from  Foster for the feedback.", "posttime": "2021-08-07 02:17:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "货物,cargo,地位", "title": "会所是一种货物崇拜", "title_en": "Clubhouse Is a Cargo Cult", "transed": 1, "url": "https://ianvanagas.com/2021/08/06/clubhouse-is-a-cargo-cult/", "via": "", "real_tags": ["货物", "cargo", "地位"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个人都需要一部电话。不是每个人都想被监视。使用 CalyxOS 收回您的隐私。 CalyxOS 是一种 Android 移动操作系统，可将隐私和安全置于日常用户的手中。此外，主动安全建议和自动更新让您无需再猜测个人数据的隐私性。 ✌️ microG 取代了 Google Play 服务的一些功能，同时保持了更多的匿名性和隐私性。完全可选。我们最近进行了一项日记研究和一组用户访谈，并综合了对我们用户是谁的基本理解。下载研究报告！下载 PDF 八月更新在这里。它与 Special Pixel 4a 版本 (2.7.1) 基本相同，唯一的补充是安全更新。官方 CalyxOS 版本使用我们的私钥签名。无线 (OTA) 更新也使用相同的密钥签名，一旦安装操作系统，只能安装使用相同密钥签名的更新。\n查看更多 CalyxOS 是一个由 Calyx Institute 赞助的协作开源应用研究项目，Calyx Institute 是一家 501(c)(3) 非营利组织，致力于为所有人提供隐私和安全。现在加入", "note_en": "Everyone needs a phone. Not everyone wants to be spied on. Reclaim your privacy with CalyxOS.\n  CalyxOS is an Android mobile operating system that  puts privacy and security into the hands of everyday users. Plus, proactive security recommendations and automatic updates take the guesswork out of keeping your personal data personal.\n  ✌️  microG replaces some functions of Google Play Services while maintaining much more anonymity and privacy. Completely Optional.\n    We recently conducted a diary study and a set of user interviews and synthesized a baseline understanding of who our users are. Download the research report!\n  Download PDF\n  The August update is here. It’s mostly identical to the Special Pixel 4a release (2.7.1), with the only addition being the security updates.\n  The official CalyxOS builds are signed with our private keys.Over-the-air (OTA) updates are also signed with the same keys, and once you install the OS, only updates signed with the same key can be installed.\n    See more\n  CalyxOS is a collaborative open source applied research project sponsored by the Calyx Institute, a 501(c)(3) non-profit dedicated to making privacy and security available for all.\n  Join Now", "posttime": "2021-08-07 02:16:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,谷歌,google,安卓,de", "title": "CalyxOS – 去谷歌的安卓替代品", "title_en": "CalyxOS – De-Googled Android Alternative", "transed": 1, "url": "https://calyxos.org/", "via": "", "real_tags": ["android", "谷歌", "google", "安卓", "de"]}]