[{"category": "", "categoryclass": "", "imagename": "28ac4f3a7e6550a5ffe82d9ed8068891.jpg", "infoid": 1066979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "出于某种原因，不止一位哈佛教授使新闻成为克里威尔人的简便。担任法律教授在四年内，发现自己被吸引到一个欺诈和虚假指责的网络中，直到他终于没有工作，无家可归者，并且在法律费用中占用了300,000美元来保护自己。\n 在另一个案例中，一名哈佛大学科学家在癌症研究中工作无情地致力于他自己的信任朋友和同事，其中一些人失去了他们的房屋和储蓄，超过600,000美元。他迅速但天真地派了一切到尼日利亚诈骗者，他们答应了他一个酷的5000万美元回报。被捕后，他仍然无法承认在愚弄周围的人之后被愚弄自己。\n   如果条件是正确的，它仍然可以展示即使是最聪明的人仍然可以像我们其余的那样容易忍受或贪婪。\n 研究人员往往思考了如何以及为什么某些人为诈骗的人，特别是对他人来说似乎如此明显的心理。诈骗者针对某些人的特征，包括可以很容易地利用的脆弱性，例如Naiveté，过度利用，在一个人的智力或能力中过度自信，对生活立即取得成功的过度乐观，或者对帮助他人感到愉快的愿望。随着互联网的沟通变得更加复杂，所以骗局所以。许多人仍然落在它，因为骗子艺术家继续瞄准企业以及个人。\n 然而，在您甚至与神秘的尼日利亚王子达到个人互动的水平之前，这次短暂的语言学家Deborah Schaffer可以为您提供4-1-9的关于如何在首次进入时识别骗局电子邮件的语言模式你的收件箱并在讨人喜欢的话，如果被打破，华而无人的语言。\n    尼日利亚419缺点（该号码是指尼日利亚刑法的欺诈部分）实际上是互联网上最古老的骗局。他们实际上可以追溯到20世纪20年代，以良好称为西班牙囚犯的信心技巧的形式。被要求越来越多的受害者越来越多的资金来释放你所尊重的外国记者（自然不存在的人），在西班牙残酷被监禁，以换取大量奖励（从未来过）。\n 在更新的419尼日利亚骗局中，要求潜在的标记支付小额预付款费用，或者要求发送他们的银行信息或个人详细信息，以帮助移动已被锁定的资金，也许在外国，或者某个地方困难。作为回报，他们承诺了一个更大的基金回报。由于故事来说，也许它来自一位政府官员的流亡王子的金库，或者垂死的慈善家急于留下他或她的财富，在值得的电子邮件收件人上。 \n虽然Schafer发现了她的419封电子邮件的一半起源于尼日利亚，其余的是来自其他地方，通常是其他非洲和中东国家。真正有趣的是如何在这些配置中使用语言。这些故事是彼此多彩的变化，但用于告诉他们的语言是捕捉潜在标记（贪婪）想象力，缓解他们的恐惧，并建立持续受害者和僵局之间的关系的关键。\n 众所周知，大多数电子邮件由英语的非扬声器组成，从许多语法和标点错误，破碎的语法，缺失的单词和恶毒人士（“将立面达到其实际结论的意愿”中，这是明确的“追求夏洛”）。有了这么多错误，这门语言怎么欺骗任何人？通常，受害者知道该消息来自非扬声器，或者他们可能是非正式的英语扬声器本身，可能并不总是识别语法错误。这些是丑陋的语言警告标志，有助于删除大多数人的大多数人足以逃避陷阱并留下令人难以置信的故事留下兴趣的较小百分比。\n 尽管缺乏英语流畅性，但诈骗者似乎已阅读并吸收了最大的语言Derring故事。 419诈骗电子邮件充满了异常的佛罗里达语，意思是说服和哄骗读者咬住子弹并遵守，如开放问候（“赛季的赞美，我祈祷这封信就会迎接你”）和道歉（赦免这封信的突然;它是由于它的快速性“）。诈骗者使奉承的自由利用奉承（“您已经被副手向我保证了对您的能力和可靠性的信心和可靠性，以控制需要最大机密性的高净值的企业交易。”），宗教上诉援引上帝的希望寻找共同的地面，甚至保密和阴谋（“第一，我必须征求您对这笔交易的最严格的信心;这是其性质完全保密和最重要的秘密。”）。\n Schaffer还展示了419个诈骗者使用策略，例如将读者施加压力，现在为时已晚（迫切地回复我！“）并确保所提出的计划是相当安全的（”此交易是100％无风险“）而且巨大的价值和价值。诈骗者在笨拙的漫画中使用技术，军事，金融或其他专业语言进行了非凡的努力（“政府官员。。。。。。。。。。。。授予各部委和寄生虫在众多经发放的合同” ）为了保持作为律师，一般银行或银行官员的借口。\n  您可以通过点击任何营销信息的提供链接随时取消订阅。\n  这一切都以不切实际的，而且很有趣的叙述，许多普通人不熟悉，死亡百万富翁亲戚的生活，抵消了他们的运气，慈善家和王子，他们想要为他人做好事，令人痛苦的商业管理人员和石油Tycoons，所有人都失去了他们的方式，需要你的帮助。通过讲述这些高大的故事，并在同情上演奏同情，Grifters试图将他们的受害者侵入一个债券，使他们能够深入投入计划和尽可能长时间的结果。他们感到投入和忠诚的时间越长，他们就越越否认它是一个骗局。有时他们从来没有。\n 语言诈骗者用来留下深刻印象和奉承是如此明显和业余的，这似乎令人惊讶的是任何人都可以被带走。然而，许多普通人每年都会陷入陷阱。然而，这种语言令人惊讶的是，作为故事受害者的一部分往往是有说服力的，往往希望和想要真实。这是一个简单的骗局，但似乎有效，当它达到愿意忽视警告标志以寻找可以使一段时间内的生命的救生症来说，这一切都以悲伤结束。 \nJSTOR是学者，研究人员和学生的数字图书馆。 JSTOR日常读者可以在JSTOR上免费访问我们的文章背后的原始研究。  您可以通过点击任何营销信息的提供链接随时取消订阅。 ", "note_en": "For some reason, more than one Harvard professor has made the news for being the easy mark of grifters. Take  the law professor who, over the course of four years, found himself drawn into a web of fraud and false accusations, until he was finally out of a job, homeless, and out $300,000 in legal fees to defend himself.\n In another case,  a Harvard scientist working in cancer research heartlessly conned his own trusting friends and colleagues, some of whom lost their homes and savings, out of $600,000. He promptly, but naively, sent it all to Nigerian scammers, who had promised him a cool $50 million in return. After being arrested, he still could not admit to having been fooled himself after fooling so many of the people around him.\n   It just goes to show that even the smartest person can still be as gullible or as greedy as the rest of us, if the conditions are right.\n Researchers often have pondered  the psychology of how and why certain people fall for scams, especially ones that appear to be so obvious to others.  Scammers target certain human traits, including vulnerabilities that can be easily exploited, such as naiveté, overconfidence in one’s intelligence or abilities, an overly optimistic expectation of immediate success in life, or a desire to feel good about helping others. As communication on the internet has gotten more sophisticated,  so have the scams. Many still fall for it, as con artists continue to target businesses as well as individuals.\n Before you even get to the level of a personal interaction with a mysterious Nigerian prince, however,  this short study by linguist Deborah Schaffer can give you the 4-1-9 on how to recognize the linguistic patterns of a scam email when it first enters your inbox and greets you in flattering, if broken, flowery language.\n    Nigerian 419 cons (the number refers to the fraud section of the Nigerian Criminal Code) are practically the oldest scams on the internet. They can actually be traced back to the 1920s, in the form of a confidence trick most gothically known as the Spanish Prisoner. The victims are asked to pay out more and more money to release the wealthy relative of your respectable foreign correspondents (who naturally doesn’t exist), cruelly imprisoned in Spain, in return for a large reward (that never comes).\n In the updated 419 Nigerian scam, the potential mark is asked to pay a small advance fee, or asked to send their bank information or personal details to help move funds that have been locked up, perhaps in a foreign country, or somewhere plausibly difficult. In return, they’re promised a much larger fund in return. As the story goes, perhaps it comes from the coffers of a prince in exile, a government official on the take, or a dying philanthropist anxious to bequeath his or her wealth upon a deserving email recipient.\n While Schaffer found half of her collection of 419 emails originated from Nigeria, the rest were from elsewhere, often other African and Middle Eastern countries. What’s really interesting is how language is used in these con jobs. The stories are colorful variations of each other, but the language used to tell them are key to capturing a potential mark’s (greedy) imagination, relieving their fears, and building a bond and relationship between an ongoing victim and grifter.\n It’s well-known that most of the emails are composed by nonnative speakers of English, as is clear from the many grammatical and punctuation mistakes, broken syntax, missing words, and malapropisms ( “the will to personify the façade to its practical conclusion” for  “pursue the charade”). With so many mistakes, how can this language really fool anyone? Often, victims know the message comes from a nonnative speaker, or they may be nonnative English speakers themselves and may not always recognize grammatical errors. These are the ludicrous linguistic warning signs that helpfully remove most people who are savvy enough to escape the trap and leave the much smaller percentage who stay to be intrigued, starry-eyed, by an implausible story.\n Despite this lack of English fluency, the scammers seem to have read and absorbed the most swashbuckling tales of linguistic derring do. 419 scam emails are full of unusually florid language, meant to persuade and cajole the reader into biting the bullet and complying, such as in opening greetings ( “Compliments of the season, and I pray that this mail meet you in go”) and apologies ( “Pardon the abruptness of this letter; it is due to its exigency”). Scammers make liberal use of flattery ( “You have been recommended by an associate who assured me in confidence of your ability and reliability in prosecuting a business transaction of high net value requiring maximum confidentiality.”), religious appeals invoking God in the hopes of finding common ground, even secrecy and intrigue ( “First, I must solicit your strictest confidence in this transaction; this is by virtue of its nature as being utterly confidential and top secret.”).\n Schaffer also shows how 419 scammers use strategies such as pressuring readers to act now before it’s too late ( “Get Back To Me Urgently!”) and assuring them that the proposed schemes are quite safe ( “This transaction is 100% risk free”) and of immense worth and value. The scammers make extraordinary efforts to use technical, military, financial or otherwise professional language in a clumsy caricature of what formal, educated English sounds like ( “government officials . . . awarded themselves contracts that were grossly over-invoiced in various ministries and parastatals”) to keep up the pretence of being a barrister, a brigadier-general, or a bank official.\n  You may unsubscribe at any time by clicking on the provided link on any marketing message.\n  This is all wrapped up in unrealistic, yet intriguing narratives that many ordinary people are not familiar with, of the lives of dead millionaires’ relatives, down on their luck, philanthropists and princes who want to do good for others, distressed business executives and oil tycoons, all who’ve lost their way and need your help. By telling these tall tales, and playing on sympathy, grifters try to entice their victims into a bond that keeps them deeply invested in the scheme and the outcome for as long as possible. The longer they feel invested and loyal, the more they’ll continue to deny it’s a scam. Sometimes they never do.\n The language scammers use to impress and flatter is so obvious and amateurish that it can seem astonishing that anyone could ever be taken in. Yet many ordinary people do fall into the trap every year. The language, however puzzling, is designed to be persuasive as part of story victims are often wishing and wanting to be real. It’s a simple scam, but appears to be effective when it reaches credulous types who are willing to ignore the warning signs in search of a treasure hunting adventure that can make a life extraordinary for a while, before it all ends in grief.\n        JSTOR is a digital library for scholars, researchers, and students. JSTOR Daily readers can access the original research behind our articles for free on JSTOR.\n  You may unsubscribe at any time by clicking on the provided link on any marketing message.", "posttime": "2021-06-20 12:29:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "language,语言", "title": "诈骗者如何使用语言来欺骗受害者 ", "title_en": "How scammers use language to trick their victims", "transed": 1, "url": "https://daily.jstor.org/the-life-changing-linguistics-of-nigerian-scam-emails/", "via": "", "real_tags": ["language", "语言"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066978, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "生锈是一种令人兴奋的语言。我最近买了铁锈编程语言书。很多很多，很多概念我从大学里没有想过。在高级编程语言中工作，如Java，Python和CypeScript，允许我忘记了低级编程的困境。 Rust两者都重新介绍了这些问题，然后立即解决了其编译器提供的先进的静态分析。\n 我还是初学者的生锈。这是令人兴奋的部分。我有这么多的问题;很多事情要弄明白。这是一项挑战。学习很多。它让我想起了我第一次开始编程的时候。有一座工作山，以及弄清楚的无穷无尽的事情。最终变得更容易，你变得富有成效。您只因为您可以 - 因为您想证明您知道您的知识所知，请写下小型应用程序。\n 生锈充满了功能。其中许多人处理安全，如所有权系统和借款检查员。它有助于保证内存安全性，并且在编写将同时执行的代码时巧合也有助于。这些功能很重要，但我真正兴奋的是语言特征 - 使语言成为工作的功能。Rust有很多。与C，模式匹配，缺少空型，货物，逐默认，功能性编程构建的互操作性，内置，宏，一个具有我见过的最有用的错误消息的编译器，元组和模式 - 匹配。我只是刮伤了这项服务。类型系统和语法并不像TypeScript一样好，我作为绝对金标准（即使它不完美）。\n 什么特别令人兴奋的是生锈的适用性。我倾向于使用Python或Java进行小shell脚本/程序。它适合我，但它不是特别便携。如果我想与我的团队成员共享我的创作，我必须提供有关必须使用的运行时版本的显式指令以及任何可能的依赖项。生锈有点不同。由于它生成了本机二进制文件，我可以简单地将其交给可执行文件（提供依赖关系捆绑在一起）并让它们具有它。\n 我很高兴再次成为一个初学者。我很高兴了解我在日常工作中我永远不会使用的事情。我很高兴能够善于编写生锈代码。我对未来的编程语言感到兴奋，希望在Rust的脚步上追随。 ", "note_en": "Rust is an exciting language. I recently bought  The Rust Programming Language Book. It’s quite dense with a lot of concepts I haven’t thought about since college. Working in high-level programming languages such as Java, Python, and TypeScript have allowed me to mostly forget about the woes of low-level programming. Rust has both re-introduced me to these problems, and then immediately solved them with the advanced static analysis that its compiler provides.\n I’m still a beginner with Rust. That’s the exciting part. I have so many questions; so many things to figure out. It’s a challenge. It’s a lot to learn. It reminds me of when I first started programming. There was a mountain of work to do, and an endless number of things to figure out. Eventually it gets easier and you become productive. You write small applications just because you can — because you want to prove that you know what you think you know.\n Rust is full of features. Many of them deal with safety, such as the ownership system and borrow checker. It helps to guarantee memory safety, and coincidentally also helps when writing code that will be executed concurrently. These features are important, but what I’m really excited about are the language features — the features that make a language a joy to work in. Rust has plenty of these. Interoperability with C, pattern matching, the lack of a null type, Cargo, immutability-by-default, functional programming constructs built-in, macros, a compiler with the most helpful error messages I’ve ever seen, tuples, and pattern-matching. I’m just scratching the service. The type system and syntax isn’t quite as good as TypeScript, which I hold as the absolute gold standard (even if it  isn’t perfect).\n What’s particularly exciting is the applicability of Rust. I tend to use Python or Java for small shell scripts/programs. It works great for me, but it’s not especially portable. If I want to share my creations with my team members I have to provide explicit instructions about which runtime versions must be used, and any possible dependencies. Rust is a bit different. Since it produces native binaries I can simply hand them the executable (provided the dependencies are bundled) and let them have at it.\n I’m excited to be a beginner again. I’m excited to learn about things I’ll never use in my day job. I’m excited to get good at writing Rust code. I’m excited for the future of programming languages, which will hopefully follow in Rust’s footsteps.", "posttime": "2021-06-20 12:29:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,生锈", "title": "生锈是令人兴奋的 ", "title_en": "Rust Is Exciting", "transed": 1, "url": "https://shepherdjerred.substack.com/p/rust-is-exciting", "via": "", "real_tags": ["rust", "生锈"]}, {"category": "", "categoryclass": "", "imagename": "5b09f145f2bd3ec3044a485150ba50da.png", "infoid": 1066977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自上次CP4SPACE文章的三个月主要花了解了一个名为Urbit的有趣项目。在Riva-Melissa Tez（以前的英特尔）在谈话中，我的注意力被吸引到它的存在性上继续改善硬件计算效率的重要性。\n 在互联网上写了一个体面的金额关于URBit，但它往往是非技术性的，解释项目的重要性，或者在高度非传统的项目特定的行话中编写的技术。相反，我们将通过审查数学家和理论计算机科学家最有可能感兴趣的Urbit的新颖内容来离开这些中的任何一个。\n 然而，在我们这样做之前，值得询问Urbit是什么。这通常是混乱的源泉，因为它是旨在融合在一起的多个交互组件的生态系统。如果您要在ulbit组件集上隐喻地运行2-均值，则它们将干净地分为操作系统（URBit OS）和Identity System（URBit ID）。\n  NOCK：一种非常低级别的功能编程语言。它在简约的LISP方言和滑雪组合器微积分之间大致一半。在URBIT生态系统中，NOCK是URBit OS运行的虚拟机的机器代码。\n Vere：NOCK虚拟机的软件实现（写入C），能够在UNIX环境中运行VM。\n 嗨：一种更高级别的功能编程语言，其中直接写入URBit OS。这最终会编制到Nock。\n Identity System，URBit ID是称为Azimuth点的整数地址（类似于IPv4地址）的分层系统。方位点点与公钥（可变或不断）安全地相关联，并且在该公钥基础设施上建立运行URBit的机器之间的通信。 \n这些可以累积地由数据类型UINT8，UINT16，UINT32，UINT64和UINT128表示。这些数据类型具有熟悉的标准“限制性图”，熟悉C编程语言，如C：\n  例如，在其中通过取下半部分（或等效，减少模2 ^ 16）将32位整数被胁迫为16位整数。在这2 ^ n位数据类型中的每一个上都有两个优雅的方法来强加振铃结构：\n  第一选择是熟悉的一个（在C编程语言中，运算符{+，*， -   -   - }在z /（2 ^ 2 ^ n）z）中与模块化算法一致。在第二选择中，环加是按位XOR，环乘法稍微复杂地定义。\n  现在，这些限制性映射如何与URBIT相关？它们在一组方位点上施加部分顺序，其中x≤y如果x是y在限制图下的图像。这种部分顺序的哈斯图图是256棵树的森林，每个森林都有一个在其根的星系。对于不是Galaxy或Comet的每个方位角，此哈列图确定了那个方位角的唯一父级。例如，大多数行星都有明星作为父母。\n 彗星的父母身份是不同的：彗星的父级是其在限制图UINT128→UINT16下的图像，这必须是愿意主持彗星的五星之一。彗星是公共钥匙的直接散布（所以，与行星不同，不能在不同的所有者之间传输）。\n 行星，星星和星系是在Ethereum Blockchain上的非娱乐标记的可交易。这给出了从每个方位角点（32位，并且容易难忘）到Etereum地址（160位和加密安全）的可修改的分散映射。因此，可以无信任地验证方位角指向的所有者，并因此设置具有该方位点的安全通信信道;以这种方式建立运行Urbit OS的机器之间的所有通信。\n  表示方位点点的整数通过以下过程将表示方位点点转换为人类可读名称（称为“@P”）： \n对于行星和卫星（不是恒星和星系），将Feistel密码应用于整数的最低32位。这是一种可逆排列，旨在混淆行星和父颗星的名称之间的关系，反映了行星被允许在星空之间自由移动的事实。\n 生成（加密）整数的字节每个都将每个用于均匀索引字节（后缀）和奇数索引字节（前缀）的单独查找表转换为三个字母的音节。每个音节由两个辅音的侧翼侧翼。\n 音节用大端编写，在开始时每个16位字和三角形之间的连字符。\n 32位行星名称的示例是〜sorreg-namtyv，属于urbit的Deposited创始人。\n 在此StackOverFlow答案中给出了对过程的更全面描述，包括两个256元素音节查找表。\n 除了发音的'@P'标识符之外，还有一种名为SIGIL的视觉编码。这将在2×2排列的单独象限中存储（加密的！）32位整数的每个字节存储，再次使用一对256元素查找表。这里显示了这个星球的SIGIL：\n  Gavin Atkinson描述了创建Sigils系统所涉及的设计决策。由于稀缺和审美吸引力的组合，具有圆形SIGIL和/或有意义的@P名称（例如，~~木壁）往往更昂贵的行星往往更加昂贵。 \n手动填充到象限图块的查找表映射到象限块（通过绘制512瓦设计），因此可以认为URBit Sigils在程序上生成。 [完全程序生成的系统也可能已经有效，例如2009年的这个Wolfram博客文章中的系统，但现在不太可能改变。]这是，仍然是与@P名称高度一致的;还手动填充音节查找表。\n   nock是这里描述的低级纯功能编程语言。代码和数据只是二进制树（名为名词），其离开是非负整数的。 NOCK解释器是一项机智函数*，其域和Codomain都是名词的空间;它的语义在其自身和其他一元职能方面递归定义。\n 我对这些函数的最爱是树寻址运算符，/，它定义如下：\n / [1 a] a / [2 ab] a / [3 ab] b / [（a + a）b] / [2 / [ab] / [（a + a + 1）b] / [3 / [ab]] / a / a\n 特别地，如果我们让L（x）和r（x）引用树x的左和右子树，那么我们有：\n   用'r'用'l'替换每个'0'（在这个例子中，“rlrrlllllrr”）;\n 服用x并顺序地将每个字符应用于它（在该示例中，给出r（l（l（l（l（l（l（l（r（r（r（r（r（r（r（x））））））））），注意最外面的函数是最低有效位）。 \n如果我们根据使用/运算符在该节点上扎根于该节点所需的自然数所需的自然数来枚举无限二叉树中的节点，则这与树的广度遍历一致。这与Calkin-Wilf序列与Calkin-Wilf树相同的枚举（下面的鲑鱼螺旋），在该图中显示了David Eppstein：\n  操作员/是有用的，即LISP分布通常为所有2≤N≤15实现此功能的特殊情况，请参阅作为{CAR，CDR，...，CDDDDDDDDDDDR}。\n NOCK，如果天真地评估，将是令人难以置信的低效：递减整数N需要时间成比例。因此，仿真器使用称为喷射的巧妙想法：仿真器模式与各种模式（例如应用于整数的递减函数）并呼叫直接递减整数的运行时优化。\n URBit项目成功地实现了整个操作系统内核作为这种语言的函数，由于使用喷气机，它在实践中表现。 Hoon Compiler（将以更高级语言编写的程序编译为低级Nock Language）生成代码，这些代码将成功匹配这些喷射器。\n 用喷气机，它可能比NOCK更低。 URBIT没有这样做，因为这样做并没有真正的观点，除了在更简单的语言方面给出了NOCK的正式定义：\n  如果我们选择绝对简单，为什么不全程？它可以在没有型号的Lambda微积分中或在SK组合轨道微积分中实施NOCK。\n  名词树叶的非负整数可以使用教堂数字来表示：n是将其参数f映射到其n倍函数组合物f ^ n的高阶函数。 \n然而，遗憾的是，没有一种方法来查询名词是否是整数或一对。因此，我们需要使用稍微更复杂的NOCK名词编码，其中我们标记为每个名词的类型：\n  用于定义NOCK解释器的机构函数现在可以自行实现为组合器，最多可达和包括NOCK解释器*本身。\n 例如，问号运算符可以通过拍摄教会对的第一个元素（这是教堂数字0或1），然后将其“拳击”作为一个Noun，而不是'裸露的教堂数字：\n  在维基百科文章中定义了“对”和“第一”功能的位置。\n 递增运算符需要取消填写整数，取其后继，然后重新键入：\n  从技术上讲，我们在这里作弊，因为根据NOCK定义，需要在有序对和整数上定义+（x）。特别是，我们需要使用first（x）来提取教堂数字，指定x是否是有序对或整数和分支：如果教堂数字是1，那么我们可以返回一对（1，supm（第二（X）））;如果教堂数字是0，那么我们需要返回+（x）。通过固定点组合器可以从该递归定义中删除自引用。\n 剩余的运营商都是递归，因此他们同样需要在其实现中需要固定点组合器。 \n尝试为SK组合器微积分编写喷射推进的仿真器是一个有趣的练习，包括优化，例如内部代表教堂数字作为整数（具有诸如GMP的库，允许任意大型整数）并使用喷射来调用 适当时GMP实现算术运算。  通过使用“压缩相同的子树”的想法，熟悉散列和库的图书馆来操纵二进制决策图，我们避免过度编码开销，并能够实现诸如递减运算符之类的（标准实现的标准实现）的恒定时间识别。 ", "note_en": "The three months since the  last cp4space article have largely been spent learning about an interesting project called  Urbit. My attention was drawn to its existence during  a talk by Riva-Melissa Tez (formerly of Intel) on the importance of continued improvements to the computational efficiency of hardware.\n A decent amount has been written on the Internet about Urbit, but it tends to either be  non-technical, explaining the importance of the project, or technical but written in highly unconventional project-specific jargon. Instead, we’ll depart from either of these by examining the novel internals of Urbit that are most likely to be of interest to mathematicians and theoretical computer scientists.\n Before we can do so, however, it is worth asking  what Urbit is. This is often a source of confusion, because it is an ecosystem of multiple interacting components designed to mesh well together. If you were to metaphorically run  2-means on the set of Urbit components, they would cleanly separate into the operating system ( Urbit OS) and identity system ( Urbit ID).\n  Nock: a very low-level functional programming language. It’s roughly halfway between a minimalistic Lisp dialect and the  SKI combinator calculus. In the Urbit ecosystem, Nock is the machine code for the virtual machine in which the Urbit OS runs.\n Vere: a software implementation (written in C) of the Nock virtual machine, capable of running the VM inside a Unix environment.\n Hoon: a higher-level functional programming language in which the Urbit OS is directly written. This ultimately compiles down to Nock.\n The identity system, Urbit ID, is a hierarchical system of integer addresses (analogous to IPv4 addresses) called  Azimuth points. Azimuth points are securely associated to public keys (either mutably or immutably), and communication between machines running Urbit is built upon this public key infrastructure.\n    These can  cumulatively be represented by the datatypes uint8, uint16, uint32, uint64, and uint128, respectively. These datatypes possess standard ‘restriction maps’ familiar from using a programming language such as C:\n  where, for instance, a 32-bit integer is coerced into a 16-bit integer by taking the lower half (or, equivalently, reducing modulo 2^16). There are two elegant ways to impose a ring structure on each of these 2^ n-bit datatypes:\n  The first choice is the familiar one (in the C programming language, the operators {+, *, -} coincide with modular arithmetic in Z/(2^2^n)Z). In the second choice, ring addition is bitwise XOR, and ring multiplication is slightly more complicated to define.\n  Now, how do these restriction maps relate to Urbit? They impose a partial order on the set of Azimuth points, where  x ≤  y if  x is the image of  y under a restriction map. The  Hasse diagram of this partial order is a forest of 256 trees, each of which has a galaxy at its root. This Hasse diagram determines, for each Azimuth point that’s not a galaxy or comet, a unique  parent of that Azimuth point. Most planets, for instance, have stars as parents.\n The parenthood relationship for comets is different: the parent of a comet is its image under the restriction map uint128 → uint16, which must be one of five stars willing to host comets. Comets are direct hashes of public keys (so, unlike planets, can’t be transferred between different owners).\n Planets, stars, and galaxies are tradable as non-fungible tokens on the Ethereum blockchain. This gives a modifiable decentralised mapping from each Azimuth point (32 bits and easily memorable) to an Ethereum address (160 bits and cryptographically secure). As such, it’s possible to trustlessly verify the owner of an Azimuth point and therefore set up a secure communication channel with that Azimuth point; all communications between machines running Urbit OS are established in this manner.\n  The integer representing an Azimuth point is converted into a human-readable name (called an ‘@p’) through the following process:\n For planets and moons (not for stars and galaxies), a Feistel cipher is applied to the lowest 32 bits of the integer. This is a reversible permutation designed to obfuscate the relationship between the name of a planet and its parent star, reflecting the fact that planets are permitted to move freely between stars.\n The bytes of the resulting (enciphered) integer are each converted to a three-letter syllable, using a separate lookup table for even-indexed bytes (suffixes) and odd-indexed bytes (prefixes). Each syllable consists of a generalised vowel flanked by two consonants.\n The syllables are written in big-endian, with a hyphen between each 16-bit word and a tilde at the beginning.\n An example of a 32-bit planet name is  ~sorreg-namtyv, which belongs to the  departed founder of Urbit.\n A more comprehensive description of the process, including the two 256-element syllable lookup tables, is given in  this StackOverflow answer.\n In addition to the pronounceable ‘@p’ identifier, there is a visual encoding called a  sigil. This stores each byte of the (enciphered!) 32-bit integer in a separate quadrant of a 2-by-2 arrangement, again using a pair of 256-element lookup tables. The sigil for the planet ~firmer-hatful is shown here:\n  Gavin Atkinson  describes the design decisions involved in creating this system of sigils. Planets with circular sigils and/or meaningful @p names (e.g. ~timber-walled) tend to be in greater demand, and therefore more expensive, due to the combination of higher scarcity and aesthetic appeal.\n The lookup tables mapping bytes to quadrant tiles were populated manually (by drawing 512 tile designs), so the Urbit sigils can be thought of as  partially procedurally generated. [A  fully procedurally-generated system may also have worked, such as the system in  this Wolfram blog post from 2009, but this is unlikely to change now.] This is, nonetheless, highly consistent with the @p names; the syllable lookup tables were also manually populated.\n   Nock is a low-level pure functional programming language described  here. Code and data are simply binary trees (called  nouns) whose leaves are nonnegative integers. The Nock interpreter is a unary function * whose domain and codomain are both the space of nouns; its semantics are defined recursively in terms of itself and other unary functions.\n My favourite of these functions is the tree-addressing operator, /, which is defined as follows:\n /[1 a] a/[2 a b] a/[3 a b] b/[(a + a) b] /[2 /[a b]]/[(a + a + 1) b] /[3 /[a b]]/a /a\n In particular, if we let L(x) and R(x) refer to the left and right subtrees of a tree x, then we have:\n   replacing each ‘0’ with ‘L’ and ‘1’ with ‘R’ (in this example, “RLRRLLLLLR”);\n taking  x and sequentially applying each of the characters to it (in this example, giving R(L(L(L(L(L(R(R(L(R(x)))))))))), noting that the outermost function is the least significant bit).\n If we enumerate the nodes in an infinite binary tree according to the natural number required to address the subtree rooted at that node using the / operator, this agrees with a breadth-first traversal of the tree. This is the same enumeration (the salmon spiral below) that relates the  Calkin-Wilf sequence to the Calkin-Wilf tree, shown in this illustration by David Eppstein:\n  The operator / is useful enough that Lisp distributions typically implement the special-cases of this function for all 2 ≤  n ≤ 15, referring to them as {car, cdr, …, cddddr}.\n Nock, if evaluated naively, would be incredibly inefficient: decrementing an integer  n takes time proportional to  n. The emulator therefore uses a clever idea called  jets: runtime optimisations where the emulator pattern-matches various patterns (such as the decrementation function applied to an integer) and calls a native C function to decrement the integer directly.\n The Urbit project has succeeded in implementing an entire operating system kernel as a function in this language, and it is performant in practice owing to the use of jets. The Hoon compiler (which compiles programs written in the higher-level language Hoon into the low-level Nock language) generates code that will be successfully pattern-matched by these jets.\n With jets, it’s possible to go even lower-level than Nock. Urbit doesn’t do this because there’s not really much point in doing so, except to give a  formal definition of Nock in terms of an even simpler language:\n  If we’re opting for absolute simplicity, why not go the whole way? It’s possible to implement Nock in the untyped lambda calculus or in the  SK combinator calculus.\n  The nonnegative integers at the leaves of noun trees can be represented using Church numerals:  n is the higher-order function which maps its argument  f to its  n-fold functional composition,  f^ n.\n However, unfortunately there isn’t a way to query whether a noun is an integer or a pair. As such, we’ll need to use a slightly more complicated encoding of Nock nouns where we ‘tag’ each noun with its type:\n  The unary functions used to define the Nock interpreter can now be themselves implemented as combinators, up to and including the Nock interpreter * itself.\n For example, the question-mark operator can be implemented by taking the first element of the Church pair (which is the Church numeral 0 or 1) and then ‘boxing’ it as a Nock noun instead of a ‘bare’ Church numeral:\n  where the ‘pair’ and ‘first’ functions are defined in  the Wikipedia article.\n The incrementation operator needs to unbox the integer, take its successor, and then rebox it, like so:\n  Technically, we’ve cheated here, because according to the Nock definition, +(x) needs to also be defined on ordered pairs as well as integers. In particular, we need to use first(x) to extract a Church numeral specifying whether x is an ordered pair or an integer and branch on that: if the Church numeral is 1, then we can just return pair(1, succ(second(x))); if the Church numeral is 0, then we need to return +(x). The self-reference can be removed from this recursive definition by means of a  fixed-point combinator.\n The remaining operators are all recursive, so they’ll similarly require the fixed-point combinator in their implementations.\n It would be a fun exercise to attempt to write a jet-propelled emulator for the SK combinator calculus, including optimisations such as internally representing Church numerals as integers (with a library such as GMP to allow arbitrarily large integers) and using jets to call the GMP implementations of arithmetic operations when appropriate.\n By using the ‘compress identical subtrees’ idea, familiar from  Hashlife and libraries for manipulating binary decision diagrams, we avoid excessive encoding overhead as well as enabling constant-time recognition of (standard implementations of!) functions such as the decrement operator.", "posttime": "2021-06-20 12:28:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学家,urbit", "title": "数学家的尿布 ", "title_en": "Urbit for Mathematicians", "transed": 1, "url": "https://cp4space.hatsya.com/2021/05/12/urbit-for-mathematicians/", "via": "", "real_tags": ["数学家", "urbit"]}, {"category": "", "categoryclass": "", "imagename": "f9a9a8495c0f13edc7cff2a3e45409e4.jpg", "infoid": 1066976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "扩展工作负载需要性能和价格的最佳组合，以降低提供应用程序的成本，同时提供出色的用户体验。我们很高兴宣布新的虚拟机（VM）Taug VMS，即将到来谷歌云。 TAU VMS扩展Compute Engine的VM产品，并通过新的选项进行了优化的，以实现缩放工作负载的经济高效性能。\n T2D是TIAD VM系列中的第一个实例类型，是基于3RD Gen AMD EPYC TM处理器，并在绩效和工作量总体拥有成本方面跨越VMS的缩放工作负载。 （TCO）。基于AMD EPYC处理器的VM提供的X86兼容性为您提供市场领先的性能改进和成本节省，而无需将应用程序移植到新的处理器体系结构。\n 如下所示，TAU VMS提供56％的绝对性能和42％的价格 - 性能（EST.Spectrate2017_Int_Base）与来自任何领先的公共云供应商的通用VM相比。\n    Snap“在Snap中，我们的企业将继续改进我们的缩放计算基础设施，以获得AR，镜头，聚光灯和地图等关键Snapchat功能，”Cody Powell，Snap Inc.“我们被印象深刻我们用Google Kubernetes引擎测试了Google Cloud的新Tau VM。虽然它＆＃39;早期，我们相信我们可以获得基础设施性能改进的两位数，以便我们通过较少，为我们的惊人的Snapchat社区提供更多的新功能。＆＃34;\n Twitter＆＃34;在正确的价格点的高性能是我们努力服务全球公共交谈的关键考虑因素，而＃34;说尼克·泰诺，平台铅，推特。 “我们被初始测试兴奋，显示了两位数性能改进的潜力。我们正在与Google Cloud进行合作，更深入地评估价格和性能的优惠，以便通过使用新的Tau VM系列来实现。“\n DOIT＆＃34; DOIT International yoav Toussia-Cohen说，与主要云供应商的婚礼供应商进行了融合的云厂商。“ “在我们对带有Coremark基准的谷歌的新TAU VMS初步测试中，我们很激烈地看到令人难以置信的性能，比另一个领先的公共云的比较雄性的发售更好地看到令人难以置信的性能。使用TAU VMS，Google Cloud已为价格性能设置新栏，使云更能访问数字母语公司。我们很高兴能够将谷歌的Tau VM带到我们的联合客户。＆＃34;\n  TAU VMS为谷歌的长期体验工程平台带来了宽容性的工作负载给我们的客户。它们以多种预定义的VM形状，每VM最多60Vcpus，每个VCPU为4GB内存。它们提供高达32 Gbps的网络带宽和各种网络连接存储选项，使TAU VMS适用于扩展工作负载，包括Web服务器，集装箱微服务，数据记录处理，媒体转码和大型Java应用程序。 \nGoogle Kubernetes Engine（GKE）是寻找高级容器编排的组织的事实标准，提供最高级别的可靠性，安全性和可扩展性。 GKE在第1天支持TAU VM，帮助您优化满足您的Containized工作负载的价格性能。 您可以通过在GKE节点池中指定T2D机器类型将TAU VM添加到GKE群集。  TAU VMS将被定价，以支持云应用程序的显着TCO和价格性能改进。 32VCPU VM，带128GB RAM的32VCPU VM将以1.3520美元的价格为每小时$ 1.3520，以便在US-Central1中按需使用。  如果您有兴趣在Q3 2021在Q3 2021获得时尝试T2D VM，请在此处注册。 ", "note_en": "Scale-out workloads demand the best combination of performance and price to bring down the cost of delivering applications, all while providing an excellent user experience. We are excited to announce a new virtual machine (VM) family,  Tau VMs, coming to Google Cloud. Tau VMs extend  Compute Engine’s VM offerings with a new option optimized for cost-effective performance of scale-out workloads.\n T2D, the first instance type in the Tau VM family, is based on 3rd Gen AMD EPYC TM processors and leapfrogs the VMs for scale-out workloads of any leading public cloud provider available today, both in terms of performance and workload total cost of ownership (TCO). The x86 compatibility provided by these AMD EPYC processor-based VMs gives you market-leading performance improvements and cost savings, without having to port your applications to a new processor architecture.\n As illustrated below, Tau VMs offer 56% higher absolute performance and 42% higher price-performance (est. SPECrate2017_int_base) compared to general-purpose VMs from any of the leading public cloud vendors.\n    Snap “At Snap, it is critical for our business to continue improving our scale-out compute infrastructure for key Snapchat capabilities like AR, Lenses, Spotlight and Maps,” said Cody Powell, Senior Engineering Manager, Snap Inc. “We were impressed when we tested Google Cloud’s new Tau VMs with Google Kubernetes Engine. While it&#39;s early days, we believe we can gain double digits in infrastructure performance improvements for key workloads—enabling us to do more with less and invest even more in new features for our amazing Snapchat community.&#34;\n Twitter &#34;High performance at the right price point is a critical consideration as we work to serve the global public conversation,&#34; said Nick Tornow, Platform Lead, Twitter. “We are excited by initial tests that show potential for double digit performance improvement. We are collaborating with Google Cloud to more deeply evaluate benefits on price and performance for specific compute workloads that we can realize through use of the new Tau VM family.”\n DoiT &#34;DoiT partners with leading cloud vendors who are focused on growth and cost optimization,” said Yoav Toussia-Cohen, CEO,  DoiT International. “In our preliminary testing of Google’s new Tau VMs with the Coremark benchmark, we were thrilled to see the incredible performance at 50% better than a comparable ARM-based offering from another leading public cloud. With Tau VMs, Google Cloud has set a new bar for price-performance, making the cloud even more accessible to digital-native companies. We are excited to bring Google’s Tau VMs to our joint customers.&#34;\n  Tau VMs bring the benefit of Google’s long-standing experience engineering platforms for scale-out workloads to our customers. They come in multiple predefined VM shapes, with up to 60vCPUs per VM, and 4GB of memory per vCPU. They offer up to 32 Gbps networking bandwidth and a wide range of network attached storage options, making Tau VMs ideal for scale-out workloads including web servers, containerized microservices, data-logging processing, media transcoding, and large-scale Java applications.\n  Google Kubernetes Engine (GKE) is the de facto standard for organizations looking for advanced container orchestration, delivering the highest levels of reliability, security, and scalability. GKE supports Tau VMs on day 1, helping you optimize price-performance for your containerized workloads. You can add Tau VMs to your GKE clusters by specifying the T2D machine type in your  GKE node-pools.\n  Tau VMs will be priced to support significant TCO and price-performance improvements for your cloud applications. A 32vCPU VM with 128GB RAM will be priced at $1.3520 per hour for on-demand usage in us-central1.\n  If you are interested in trying out T2D VMs when they become available in Q3 2021 please sign-up  here.", "posttime": "2021-06-20 12:28:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,vms,vm", "title": "新的TAU VMS为扩展工作负载提供前瞻性性能 ", "title_en": "New Tau VMs deliver leading price-performance for scale-out workloads", "transed": 1, "url": "https://cloud.google.com/blog/products/compute/google-cloud-introduces-tau-vms", "via": "", "real_tags": ["性能", "vms", "vm"]}, {"category": "", "categoryclass": "", "imagename": "04c7085958dc06d2dbdcb891a42d2694.jpg", "infoid": 1066975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的SQLite-Utils Memory命令可以将CSV和JSON数据直接导入内存的SQLite Datbase，使用SQL组合和查询它，并将结果输出为CSV，JSON或各种其他格式的纯文本表。\n   我录制了这个视频演示了新功能 - 在下面的完整伴奏笔记。\n SQLite-utils已经提供了一种将CSV和JSON数据导入SQLite-Utils Insert命令的SQLite数据库文件的机制。使用此处理数据涉及两个步骤：首先将其导入TEMP.DB文件，然后使用SQLite-Utils查询运行查询并输出结果。\n 使用SQL重新形状数据真实有用 - 由于SQLite-Utils可以以多种不同的格式输出，我经常发现自己在CSV文件中加载并将其退回为JSON，或反之亦然。\n 本周我意识到我有大部分的作品来减少这一步。新的SQLite-utils Memory命令（此处完整文档）针对临时内存的SQLite数据库运行。它可以导入数据，执行SQL并输出一个衬垫的结果，而不需要沿途的任何临时数据库文件。\n 这是一个例子。我的dogsheep github组织有很多存储库。 github通过https://api.github.com/users/dogshep/repos at authentication-可选的api端点来制作那些可用的那些，它返回看起来像这样的json（简体）：\n [{＆＃34; id＆＃34 ;: 197431109，＆＃34;名称＆＃34 ;:＆＃34; dogsheep-beta＆＃34 ;,＆＃34; full_name＆＃34 ;:＆＃34; Dogsheep / Dogsheep-beta＆＃34 ;,＆＃34; size＆＃34 ;:61，＆＃34; stargazers_count＆＃34 ;:79，＆＃34; thepers_count＆＃34 ;:79，＆＃34;叉子＆＃34 ;: 0，＆＃34; open_issues＆＃34 ;:11}，{＆＃34; id＆＃34 ;: 256834907，＆＃34;姓名＆＃34 ;:＆＃34; dogsheep-照片＆＃34;＆＃34; full_name＆＃34 ;:＆＃34; dogsheep / dogsheep-photos＆＃34 ;,＆＃34; size＆＃34 ;: 64，＆＃34; stargazers_count＆＃34 ; 116，＆＃34;看看者_Count＆＃34 ;:116，＆＃34;叉子＆＃34 ;: 5，＆＃34; Open_issues＆＃34 ;:18}] \n使用SQLite-Utils Memory，我们可以看到这3个最受欢迎的Repos按像这样的星星数：\n $ curl -s＆＃39; https：//api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils记忆 - ＆＃39;选择full_name，forks_count，stargazers_count，从Stdin Order by Stars中的星星DESC限制3＆＃39; -tifull_name forks_count stars ------------------------------------- Dogsheep / Twitter-to-sqlite 12 225dogsheep / github-to-sqlite 14 139dogsheep / dogsheep-photos 5 116\n 我们正在使用CURL将JSON获取，并将其管道进入SQLite-Utils Memory-The-Meary“从标准输入读取”。然后我们通过以下SQL查询：\n  STDIN是为工具中的数据提供的数据创建的临时表。查询选择了三个JSON属性，将Stargazers_Count重新创建到明星，按星级排序并返回前三个。\n 这里的-t选项意味着“作为格式化表的输出” - 我们获取json：\n $ curl -s＆＃39; https：//api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils记忆 - ＆＃39;选择full_name，forks_count，stargazers_count，从Stdin Order by Stars中的星星DESC限制3＆＃39; [{＆＃34; full_name＆＃34 ;:＆＃34; dogsheep / twitter-to-sqlite＆＃34;＆＃34; forks_count＆＃34 ;: 12，＆＃34;星星＆＃34;：225}，{ ＆＃34; full_name＆＃34 ;:＆＃34; dogsheep / github-to-sqlite＆＃34 ;,＆＃34; forks_count＆＃34 ;:14，＃34;星星＆＃34;：139}，{＆＃ 34; full_name＆＃34 ;:＆＃34; dogsheep / dogsheep-photos＆＃34;＆＃34; forks_count＆＃34 ;: 5，＆＃34;星星＆＃34;：116}]\n  $ curl -s＆＃39; https：//api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils记忆 - ＆＃39;选择full_name，forks_count，stargazers_count，从Stdin Order by Stars中的星星DESC限制3＆＃39; --csvfull_name，forks_count，starsdogsheep / twitter-to-sqlite，12,225dogsheep / github-to-sqlite，14,139dogsheep / dogsheep-photos，5,116 \n-t选项支持使用--fmt指定的许多不同格式。如果我想通过星星生成顶部Reos的乳胶表，我可以这样做：\n $ curl -s＆＃39; https：//api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils记忆 - ＆＃39;选择full_name，forks_count，stargazers_count，从Stdin Order by Stars中的星星DESC限制3＆＃39; -t --fmt = laTex \\ begin {表格} {lrr} \\ hline full \\ _name＆amp; forks \\ _count＆amp;星星\\\\\\ hine dogsheep / twitter-to-sqlite＆amp; 12＆amp; 225 \\\\ dogsheep / github-to-sqlite＆amp; 14＆amp; 139 \\\\ dogsheep / dogsheep-photos＆amp; 5＆amp; 116 \\\\\\ hline \\结束{表格}\n 我们也可以运行聚合查询 - 让我们在所有存储库中添加总体大小和星数：\n $ curl -s＆＃39; https：//api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils记忆 - ＆＃39;从Stdin＆＃39选择sum（size），sum（stargazers_count）; -t sum（size）sum（stargazers_count）----------- ---------------------843 934\n （我认为这里的尺寸是以千字节测量的：GitHub API文档在这一点上不清楚。）\n  所有这些示例都使用JSON数据处理到工具中 - 但您也可以通过允许您对其执行连接的方式传递一个或多个不同格式的文件。\n  纽约时报通过随着时间的推移，在Covid案件和死亡中发布了美国的美国陈述。 \nCDC有一个未记录的JSON端点（我在这里归档）跟踪不同状态疫苗接种的进展情况。\n 我们将从该CSV数据到该JSON数据运行加入，并输出结果表。\n 首先，我们需要下载文件。为了我们的目的，CDC JSON数据并不是正确的形状：\n  sqlite-utils预期一个平坦的json armet对象 - 我们可以使用JQ重新塑造数据，如下所示：\n    既然我们在本地拥有数据，我们可以使用以下命令运行连接以将其组合：\n $ sqlite-utils memory us-solual.csv vaccination_data.json＆＃34;从T1加入T2上选择max（t1.date），t1.state，t1.cases，t1.dearts，t2.census2019，t2.dist_per_100k在t1.state = replace（t2.longname，＆＃39;纽约州＆＃39; 39;，＆＃39;纽约＆＃39;）由t1组组.State Order by dist_per_100k desc＆＃34; -tmax（t1.date）州病例死亡人口普查2019 dist_per_100k ----------------------------------- ------- -------- ------------------------2021-06-18哥伦比亚49243 1141 705749 1492482021-06-18佛蒙特州24360 256 623989 1462572021-06-18罗德岛152383 2724个1059361个1412912021-06-18马萨诸塞709263 17960 6892503 1396922021-06-18马里兰461852 9703 6045680 1381932021-06-18缅因州68753 854 1344212 1368942021 -06-18夏威夷35903 507 1415872 136024 ...\n 我在这里使用自动创建数字别名T1和T2，但我也可以使用他们的完整表姓名和＃34;美国国家＆＃34; （由于连字符所需的引号）和Vaccination_data代替。 \nreplace（）操作需要，因为vaccination_data.json文件调用纽约“纽约状态”，而美国陈述.CSV文件只需称之为“纽约”。\n max（t1.date）和t1组.state是一个有用的sqlite技巧：如果执行一个组，然后询问值的max（），则从该表返回的其他列将是列的列包含最大值的行。\n 这个演示是一个延伸的一点 - 一旦我达到这种复杂程度，我更有可能将文件加载到磁盘上的SQLite数据库文件中，并在数据缩放中打开它们 - 但这是一个更复杂的加入的有趣示例行动。\n  SQLite-utils Memred命令具有另一个新泡沫的套筒：它会自动检测CSV或TSV文件中的哪个列包含整数或浮点值，并以正确的类型创建相应的内存中的SQLite表。这可以可预测的方式确保Max（）和Sum（）并按工作顺序，而不会意外地将1排序为高于11。\n 我不想打破sqlite-utils插入命令的现有用户的向后兼容性，所以我添加了那里的类型检测，作为新的选项，--detect-types或-d for short：\n $ sqlite-utils插入my.db us_states us-solues.csv --csv -d [############################# ######] 100％$ sqlite-utils架构my.dbcreate表＆＃34; us_states＆＃34; （[日期]文本，[状态]文本，[FIPS]整数，[案例]整数，[Deaths] Integer）;\n   Sqlite-utils：3.10-（总共78个版本）-2021-06-19 Python CLI实用程序和用于操纵SQLite数据库的库 \ndogsheep-beta：0.10.2-（20版本总计）-2021-06-13从多个SQLite数据库表中构建了内容的搜索索引，并使用Databette对其运行刻面搜索  Markdown-to-sqlite：1.0-（2版本总计）-2021-06-13 CLI工具，用于将标记文件加载到SQLite数据库中 ", "note_en": "The new  sqlite-utils memory command can import CSV and JSON data directly into an in-memory SQLite datbase, combine and query it using SQL and output the results as CSV, JSON or various other formats of plain text tables.\n   I’ve recorded  this video demonstrating the new feature—with full accompanying notes below.\n sqlite-utils already offers a mechanism for importing CSV and JSON data into a SQLite database file, in the form of the  sqlite-utils insert command. Processing data with this involves two steps: first import it into a  temp.db file, then use  sqlite-utils query to run queries and output the results.\n Using SQL to re-shape data is really useful—since  sqlite-utils can output in multiple different formats, I frequently find myself loading in a CSV file and exporting it back out as JSON, or vice-versa.\n This week I realized that I had most of the pieces in place to reduce this to a single step. The new  sqlite-utils memory command ( full documentation here) operates against a temporary, in-memory SQLite database. It can import data, execute SQL and output the result in a one-liner, without needing any temporary database files along the way.\n Here’s an example. My  Dogsheep GitHub organization has a number of repositories. GitHub make those available via an authentication-optional API endpoint at  https://api.github.com/users/dogsheep/repos—which returns JSON that looks like this (simplified):\n [ {   &#34;id &#34;:  197431109,   &#34;name &#34;:   &#34;dogsheep-beta &#34;,   &#34;full_name &#34;:   &#34;dogsheep/dogsheep-beta &#34;,   &#34;size &#34;:  61,   &#34;stargazers_count &#34;:  79,   &#34;watchers_count &#34;:  79,   &#34;forks &#34;:  0,   &#34;open_issues &#34;:  11 }, {   &#34;id &#34;:  256834907,   &#34;name &#34;:   &#34;dogsheep-photos &#34;,   &#34;full_name &#34;:   &#34;dogsheep/dogsheep-photos &#34;,   &#34;size &#34;:  64,   &#34;stargazers_count &#34;:  116,   &#34;watchers_count &#34;:  116,   &#34;forks &#34;:  5,   &#34;open_issues &#34;:  18 }]\n With  sqlite-utils memory we can see the 3 most popular repos by number of stars like this:\n $ curl -s &#39;https://api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils memory - &#39; select full_name, forks_count, stargazers_count as stars from stdin order by stars desc limit 3 &#39; -tfull_name forks_count stars-------------------------- ------------- -------dogsheep/twitter-to-sqlite 12 225dogsheep/github-to-sqlite 14 139dogsheep/dogsheep-photos 5 116\n We’re using  curl to fetch the JSON and pipe it into  sqlite-utils memory—the  - means “read from standard input”. Then we pass the following SQL query:\n  stdin is the temporary table created for the data piped in to the tool. The query selects three of the JSON properties, renames  stargazers_count to  stars, sorts by stars and return the first three.\n The  -t option here means “output as a formatted table”—without that option we get JSON:\n $ curl -s &#39;https://api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils memory - &#39; select full_name, forks_count, stargazers_count as stars from stdin order by stars desc limit 3 &#39; [{&#34;full_name&#34;: &#34;dogsheep/twitter-to-sqlite&#34;, &#34;forks_count&#34;: 12, &#34;stars&#34;: 225}, {&#34;full_name&#34;: &#34;dogsheep/github-to-sqlite&#34;, &#34;forks_count&#34;: 14, &#34;stars&#34;: 139}, {&#34;full_name&#34;: &#34;dogsheep/dogsheep-photos&#34;, &#34;forks_count&#34;: 5, &#34;stars&#34;: 116}]\n  $ curl -s &#39;https://api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils memory - &#39; select full_name, forks_count, stargazers_count as stars from stdin order by stars desc limit 3 &#39; --csvfull_name,forks_count,starsdogsheep/twitter-to-sqlite,12,225dogsheep/github-to-sqlite,14,139dogsheep/dogsheep-photos,5,116\n The  -t option supports a number of different formats, specified using  --fmt. If I wanted to generate a LaTeX table of the top reos by stars I could do this:\n $ curl -s &#39;https://api.github.com/users/dogsheep/repos&#39; \\ | sqlite-utils memory - &#39; select full_name, forks_count, stargazers_count as stars from stdin order by stars desc limit 3 &#39; -t --fmt=latex\\begin{tabular}{lrr}\\hline full\\_name &amp; forks\\_count &amp; stars \\\\\\hline dogsheep/twitter-to-sqlite &amp; 12 &amp; 225 \\\\ dogsheep/github-to-sqlite &amp; 14 &amp; 139 \\\\ dogsheep/dogsheep-photos &amp; 5 &amp; 116 \\\\\\hline\\end{tabular}\n We can run aggregate queries too—let’s add up the total size and total number of stars across all of those repositories:\n $ curl -s &#39;https://api.github.com/users/dogsheep/repos&#39; \\| sqlite-utils memory - &#39; select sum(size), sum(stargazers_count) from stdin&#39; -t sum(size) sum(stargazers_count)----------- ----------------------- 843 934\n (I believe size here is measured in kilobytes: the GitHub API documentation isn’t clear on this point.)\n  All of these examples have worked with JSON data piped into the tool—but you can also pass one or more files, of different formats, in a way that lets you execute joins against them.\n  The New York Times publish a  us-states.csv file with Covid cases and deaths by state over time.\n The CDC have an  undocumented JSON endpoint (which I’ve been  archiving here) tracking the progress of vaccination across different states.\n We’re going to run a join from that CSV data to that JSON data, and output a table of results.\n First, we need to download the files. The  CDC JSON data isn’t quite in the right shape for our purposes:\n  sqlite-utils expects a flat JSON array of objects—we can use  jq to re-shape the data like so:\n    Now that we have the data locally, we can run a join to combine it using the following command:\n $ sqlite-utils memory us-states.csv vaccination_data.json &#34; select max(t1.date), t1.state, t1.cases, t1.deaths, t2.Census2019, t2.Dist_Per_100K from t1 join t2 on t1.state = replace(t2.LongName, &#39;New York State&#39;, &#39;New York&#39;) group by t1.state order by Dist_Per_100K desc&#34; -tmax(t1.date) state cases deaths Census2019 Dist_Per_100K-------------- ------------------------ ------- -------- ------------ ---------------2021-06-18 District of Columbia 49243 1141 705749 1492482021-06-18 Vermont 24360 256 623989 1462572021-06-18 Rhode Island 152383 2724 1059361 1412912021-06-18 Massachusetts 709263 17960 6892503 1396922021-06-18 Maryland 461852 9703 6045680 1381932021-06-18 Maine 68753 854 1344212 1368942021-06-18 Hawaii 35903 507 1415872 136024...\n I’m using automatically created numeric aliases  t1 and  t2 for the files here, but I can also use their full table names  &#34;us-states&#34; (quotes needed due to the hyphen) and  vaccination_data instead.\n The  replace() operation there is needed because the  vaccination_data.json file calls New York “New York State” while the  us-states.csv file just calls it “New York”.\n The  max(t1.date) and  group by t1.state is  a useful SQLite trick: if you perform a  group by and then ask for the  max() of a value, the other columns returned from that table will be the columns for the row that contains that maximum value.\n This demo is a bit of a stretch—once I reach this level of complexity I’m more likely to load the files into a SQLite database file on disk and open them up in  Datasette—but it’s a fun example of a more complex join in action.\n  The  sqlite-utils memory command has another new trick up its sleeve: it automatically detects which columns in a CSV or TSV file contain integer or float values and creates the corresponding in-memory SQLite table with the correct types. This ensures  max() and  sum() and  order by work in a predictable manner, without accidentally sorting  1 as higher than  11.\n I didn’t want to break backwards compatibility for existing users of the  sqlite-utils insert command so I’ve added type detection there as a new option,  --detect-types or  -d for short:\n $ sqlite-utils insert my.db us_states us-states.csv --csv -d [####################################] 100%$ sqlite-utils schema my.dbCREATE TABLE &#34;us_states&#34; ( [date] TEXT, [state] TEXT, [fips] INTEGER, [cases] INTEGER, [deaths] INTEGER);\n   sqlite-utils:  3.10—( 78 releases total)—2021-06-19 Python CLI utility and library for manipulating SQLite databases\n dogsheep-beta:  0.10.2—( 20 releases total)—2021-06-13 Build a search index across content from multiple SQLite database tables and run faceted searches against it using Datasette\n  markdown-to-sqlite:  1.0—( 2 releases total)—2021-06-13 CLI tool for loading markdown files into a SQLite database", "posttime": "2021-06-20 11:45:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,数据库,database,内存,csv", "title": "使用内存中的SQLite数据库加入CSV和JSON数据 ", "title_en": "Joining CSV and JSON data with an in-memory SQLite database", "transed": 1, "url": "https://simonwillison.net/2021/Jun/19/sqlite-utils-memory/", "via": "", "real_tags": ["sqlite", "数据库", "database", "内存", "csv"]}]