[{"category": "", "categoryclass": "", "imagename": "f7c4233129f93090df60b486bbe74d8d.jpg", "infoid": 1010705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微小的三维打印塑料立方体，其中内置了复杂的分形空洞，已被证明在消散冲击波方面是有效的，可能会导致新型轻质装甲和结构材料有效地抵御爆炸和撞击。洛斯阿拉莫斯国家实验室的科学家达娜·达特尔鲍姆(Dana Dattelbaum)说，这项工作的目标是操纵由海浪引起的相互作用。达特尔鲍姆是发表在“AIP进展”杂志上的一篇论文的主要作者。关于如何做到这一点还没有很好的定义，当然与添加制造的材料的机械变形相比，定义得较少。由于先进的中规模制造和设计，我们重新定义了这些原则。\n过去已经开发了利用空洞的冲击波分散材料，但它们通常涉及通过反复试验发现的随机分布。其他人则使用层来反射冲击波和释放波。精确控制材料中孔洞的位置使研究人员能够以可重现的方式设计、建模和测试按设计执行的结构。\n研究人员通过以大约每小时670英里的速度向它们发射冲击器来测试它们的分形结构。结构立方体的减震效果是同种材料的实心立方体的五倍。\n虽然有效，但分形结构是否是最好的减震设计尚不清楚。研究人员正在研究其他基于空洞或界面的模式，以寻找理想的结构来消散冲击。新的优化算法将把他们的工作引导到那些由规则的、重复的结构组成的结构之外。潜在的应用可能包括车辆、头盔或其他人类可穿戴保护的结构支撑和保护层。\n这项研究将发表在2020年7月刊的“AIP进展”上，发表在D.M.Dattelbaum等人的文章“界面主导的多孔结构的冲击波消散”中。", "note_en": "Tiny, 3-D printed cubes of plastic, with intricate fractal voids built into them, have proven to be effective at dissipating shockwaves, potentially leading to new types of lightweight armor and structural materials effective against explosions and impacts.    &#34;The goal of the work is to manipulate the wave interactions resulting from a  ,&#34; said Dana Dattelbaum, a scientist at Los Alamos National Laboratory and lead author on a paper to appear in the journal  AIP Advances. &#34;The   for how to do so have not been well defined, certainly less so compared to mechanical deformation of additively manufactured materials. We&#39;re defining those principles, due to advanced, mesoscale manufacturing and design.&#34;\n  Shockwave dispersing materials that take advantage of voids have been developed in the past, but they typically involved random distributions discovered through trial and error. Others have used layers to reverberate shock and release waves. Precisely controlling the location of holes in a material allows the researchers to design, model and test structures that perform as designed, in a reproducible way.\n  The researchers tested their fractal structures by firing an impactor into them at approximately 670 miles per hour. The structured cubes dissipated the shocks five times better than solid cubes of the same material.\n  Although effective, it&#39;s not clear that the fractal structure is the best shock-dissipating design. The researchers are investigating other void- or interface-based patterns in search of ideal structures to dissipate shocks. New optimization algorithms will guide their work to structures outside of those that consist of regular, repeating structures. Potential applications might include structural supports and protective layers for vehicles, helmets, or other human-wearable protection.\n  The research will be published in the July 2020 issue of  AIP Advances, in the article &#34;Shockwave dissipation by interface-dominated porous structures,&#34; by D.M. Dattelbaum et al.", "posttime": "2020-07-09 11:47:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "分形,dissipating,结构", "title": "减震分形立方体可锻造高科技装甲", "title_en": "Shock-Dissipating Fractal Cubes Could Forge High-Tech Armor", "transed": 1, "url": "https://phys.org/news/2020-07-shock-dissipating-fractal-cubes-forge-high-tech.html?fbclid=IwAR0xpJkJIHfwqje4cEFiq7N4_CtINW7CRufKfJgbJl1ru9aT_ePDx-kh3dg", "via": "", "real_tags": ["分形", "结构"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该站点指定用于处理器设计，以便在硬件中实现Java虚拟机。这是奥地利维也纳理工大学博士论文的一部分。这个开发的目标是一个简单而小巧的Java处理器，经过优化可以执行Java字节码。Java是桌面系统上流行的编程语言，在嵌入式系统中很少使用。Java的一些特性，如语言中的线程支持，可以极大地简化嵌入式系统的开发，但JVM(Java Virtual Machine，Java虚拟机)作为解释器或即时编译器的常见实现是不实用的。该站点描述了另一种方法：JOP(Java优化处理器)是用于嵌入式实时系统的JVM的硬件实现，具有可预测的执行时间。由于该处理器体积小，可以在低成本的FPGA中实现。对于低容量系统，与传统处理器相比，FPGA的灵活性可能比略高的成本更重要。JOP是在小型嵌入式实时系统中使用可配置Java处理器的一种方式。这将有助于提高这些系统对Java的接受程度。可以下载完整的VHDL源代码和Java语言的工具。JOP在GNU通用公共许可证版本3下是开源的。为了与其他JOP用户讨论，可以使用Yahoo小组(单击以加入java-Processor)。", "note_en": "This site is designated for a processor design to implement the Java Virtual \rMachine in hardware. It is part of a PhD \r thesis\rat the Vienna University of Technology, Austria.\rThe goal of this development is a simple and small Java processor optimized to execute \rJava bytecode. \r Java, a popular programming language on desktop system, is seldom used in embedded systems.\rSome features of Java, like thread support in the language, can greatly simplify development\rof embedded systems, but the common implementations of the JVM (Java Virtual Machine),\ras interpreter or just-in-time compiler, are not practical.\r This site describes an alternative approach: JOP (a Java Optimized Processor) is\ra hardware implementation of the JVM with predictable execution time for embedded real-time systems.\r Due to the small size of the processor, it can be implemented in a low cost FPGA.\rFor low volume systems, the flexibility of an FPGA can be of more importance then\rthe slightly higher cost compared to conventional processors.\r JOP is one way to use a configurable Java processor in small embedded real-time systems.\rIt shall help to increase the acceptance of Java for these systems.\r Complete VHDL source and tools in Java are available for download.\rJOP is open-source under the GNU General Public License, version 3.\r\rFor discussion with other JOP users a yahoo \r group\ris available (\r \rClick to join java-processor\r).", "posttime": "2020-07-09 11:21:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,优化,optimized", "title": "Java优化处理器", "title_en": "Java Optimized Processor", "transed": 1, "url": "https://www.jopdesign.com/", "via": "", "real_tags": ["java", "优化", "optimized"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近决定把棋盘游戏实验室的引擎从TypeScriptt换成Rust。以下是我使用这两种语言的经验总结。\n使用JavaScript或TypeScript的优势之一是，您可以在客户端和服务器上运行相同的代码。对于桌面游戏实验室，这意味着可以在两端独立更新游戏状态。这将在客户端带来无延迟体验，同时仍将服务器用作权威数据源。\n随着WebAssembly的起飞，您可以获得同样的优势，书写铁锈。我们通过编译Rustto WebAssembly将服务器端代码推送到客户端，而不是将客户端代码推送到服务器。\n这个Rollupplugin允许您将Cargo.toml文件导入到您的TypeScript代码库中，从而实现了Rust和TypeScript代码之间的无缝集成。开发体验几乎和编写打字稿本身一样流畅(例如，当您更改一行生锈代码时，浏览器会自动刷新)。\n用打字稿编写代码在很大程度上是一种愉快的经历，但改用铁锈立即暴露了打字稿的一些局限性。\n与类型检查器相比，TypeScript更像是一个类型提示程序，它主要确保您不会访问不是通过类型系统声明的字段(这是非常有表现力的)。它还为您的IDE启用了更好的自动完成功能。\n但是，它实际上并不能确保您正在操作的数据与您声明的表示它的类型相对应。例如，数据可能包含其他字段，甚至声明类型的值不正确。\n您必须编写数据验证代码以确保您在TypeScript中操作的数据是正确的。您可以在Rust中获得这个forfree，如果您解析的数据与要将其保存在内存中的结构不一致，则会抛出错误。\nRust的模式匹配和错误处理使得处理可能导致错误的每条代码路径变得非常容易，从而产生非常健壮的代码。\n这在很大程度上使人们相信，如果编译成功，它很可能不会在运行时抛出错误。\n在没有任何性能优化的情况下，最初的重写已经比以前的打字代码库更快了。这还不是太重要，但是棋盘游戏实验室最终将与机器人一起运行，所以一旦需要搜索游戏树，性能就会变得很重要。\n前一台服务器使用的是ws，这是NodeJS的一个受欢迎的库。新版本使用了Warp(锈蚀)，在相同的负载下使用了更少的内存。\n总体而言，我对这一转变相当满意。尽管我是Rust的新手(我有C++背景，这可能会有所帮助)，但我并没有遇到来自借用检查器的太多阻力。", "note_en": "I recently decided to switch the engine of Boardgame Lab from TypeScriptto Rust. Here is a summary of my experience with both languages.\n  One of the advantages of using JavaScript or TypeScript isthat you can run the same code on both client and server.For  Boardgame Lab, this meansthat the game state can be updated independently on both sides.This results in a lag-free experience on the clientwhile still using the server as the authoritative source ofdata.\n With  WebAssembly taking off, you can get the same advantagewriting Rust. Instead of pushing client-side code to the server, we push server-side code to the client by compiling Rustto WebAssembly.\n This  Rollupplugin allows you to import a  Cargo.toml file into yourTypeScript codebase, allowing a seamless integration betweenRust and TypeScript code. The dev experience is almost as smoothas writing TypeScript itself (for example, the browser refreshesautomatically when you change a line of Rust code).\n   Coding in TypeScript has been a largely pleasant experience,but switching to Rust immediately brought to light some of thelimitations of TypeScript.\n  TypeScript is more of a type-hinter than a type-checker.It primarily ensures that you’re not accessing fields thatyou aren’t declaring via the type system (which is quite expressive). It also enables nicer autocomplete for your IDE.\n However, it does not actually ensure that the data you aremanipulating corresponds to the type that you have declaredto represent it. For example, the data might contain  additional fields oreven  incorrect values for declared types.\n  You have to write data validation code to ensure that you’reoperating on correct data in TypeScript. You get this forfree in Rust, which will throw an error if you parse datathat doesn’t line up with the struct that is to hold it inmemory.\n  Rust’s  pattern matching and  error handling make it easy tohandle every code path that could result in an error, leadingto very robust code.\n This leads to a great degree of confidence that if it compiles,it’s probably going not to throw an error at runtime.\n   The initial rewrite without any performance optimizationsis already faster than the previous TypeScript codebase.This doesn’t matter too much yet, but Boardgame Lab will eventuallyship with bots, so the performance will matter oncegame trees need to be searched.\n    The previous server used  ws, a popular library for NodeJS. The new version uses  Warp (Rust), which uses less memoryunder the same load.\n  Overall, I’m pretty happy with the switch. I haven’t reallyencountered much resistance from the borrow checker despitebeing fairly new to Rust (I come from a C++ background, somaybe that helps).", "posttime": "2020-07-09 11:21:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webassembly,rust,生锈,typescript,代码", "title": "从打字到生锈/WebAssembly", "title_en": "Moving from TypeScript to Rust / WebAssembly", "transed": 1, "url": "https://nicolodavis.com/blog/typescript-to-rust/", "via": "", "real_tags": ["rust", "生锈", "代码"]}, {"category": "", "categoryclass": "", "imagename": "8c79d5f131f7cd02cd5e4ab90e44fcd7.png", "infoid": 1010700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于面临编程挑战的开发人员来说，大多数问题都是通过使用逻辑来解决的。如果您曾经听到开发人员说他们完全直观地解决了代码中的问题，您可能会摇头。\n然而，如果一位设计师对你说了上述话，你的反应可能会大不相同。这是因为对于编程解决方案的开发人员来说，主要的思维模式是逻辑，而对于设计人员来说，主要的思维工具是直觉。\n开发的某些方面是直观的。同样，正如我们将在这篇文章中看到的，设计的某些方面也是合乎逻辑的。\n当进入一个新的研究领域时，最好的方法往往是用建构主义的方法。这仅仅意味着，当你学习的时候，你利用你已经拥有的知识或思维方式来让自己轻松地进入新的学科。\n对于接近设计的开发人员来说，理想的策略是从设计领域中最合乎逻辑的概念开始：信息体系结构。\nGoogle将信息架构定义为信息结构的标签和组织。本质上，信息结构是已经创建或能够创建的一切。在这篇文章的上下文中，我们将使用该术语来指代网站、移动应用程序等。\n创建信息体系结构归根结底是找出要问的正确问题-解决您遇到的问题的问题。下一步是以最适合用例的方式组织信息，并解决它。\n这是一个相对合乎逻辑的、类似于编程的过程，并附加了一些直觉。这使得它成为渴望学习设计的逻辑开发人员的完美起点。\n利用我们在本文中提出的信息架构优先策略来利用设计中的逻辑，将允许您以最快、最有效的方式学习设计。\n信息架构是设计过程中最具逻辑性的部分。对于所有想要学习设计的开发人员来说，这是一个很好的起点。\n在这种情况下，也许设计产品过程中最重要的问题是正在设计的产品是否真的解决了所遇到的问题。\n因为信息体系结构也依赖于设计规划过程的最基本的末端，从信息体系结构的构建，到用户流程，再到高分辨率设计的最终实现，产品是否解决问题的基本问题也在这个层次上得到了回答。\n换句话说，因为产品设计中最重要的是解决产品要解决的问题，只有通过正确、合理地使用信息体系结构才能实现这一点，所以信息体系结构是设计过程中最重要的部分。\n扎实的信息体系结构基础使您对构建所需的设计有了初步的了解，也为您创建有效的设计并最终解决问题提供了关键。\n当我开始写这篇文章时，我首先列出了标题，其中包含了我将在整篇文章中涵盖的关键点，比如你在上面看到的标题。\n这个标题充当了最初的“信息体系结构”脚手架，然后我在其中编写并充实了这篇文章。这是对贯穿整篇文章的想法或信息的低分辨率排序。\n从最初的基础上，我逐渐向下倾泻到写作中，增加越来越高的内容或信息的分辨率，以完成这篇帖子。\n同样，如果我要创建一个网站，我会从网站地图开始，然后从网站地图中的页面开始，逐渐开始创建线框形式的更高分辨率的页面表示。从那里我可以开发出具体的、真实的元素，这些元素最终会组成页面，然后是网站。\n随着您深入上述过程，完成最终设计所需的直觉数量会增加。\n但在良好的信息体系结构的坚实基础上，这仅仅是对如何组织信息元素以获得尽可能最佳的用户体验的准确理解，这是一个可以学习的过程，然后通过分析和实践反复进行。\n设计过程可能会随着进程的进行而变得复杂，但从简单、低分辨率、鸟瞰的网站地图(作为初始信息)开始，可以使过程变得简单得多。\n要开始扎实理解信息体系结构，最好从更多的可视化教程开始。通过这种方式，你还可以了解它背后的思维过程。\n以下是YouTube上一些关于信息架构的最佳视频，它们真正侧重于基础知识：\n如果您正在寻找一些详细解释这些概念的关于信息架构的好书，请看以下内容：\n一旦您开始在适当的级别上掌握信息体系结构，您就可以着手设计和迭代使用您的信息体系结构的接口。在此基础上，您可以开始学习设计基础知识，这些基础知识将引导您培养良好的设计直觉。\n记住，互联网上总有更多的资源可以作为你下一步的指南。\n当学习新的东西时，最好的方法是利用你已经熟悉的知识模式来简化你的理解过程，并逐渐获得对这门学科的欣赏。\n对于开发人员来说，最好的模式是逻辑。因此，对于试图理解设计的开发人员来说-这需要逻辑和直觉-从频谱的逻辑端开始，并从这个基础逐步完成，直到更直观的元素开始发挥作用，这是值得的。\n我希望这篇文章能很好地介绍信息架构的概念，并能帮助您开始发展自己的设计直觉之旅。", "note_en": "For developers facing programming challenges, most problems are solved with the use of logic. If you ever heard a developer say they solved a problem within their code completely intuitively, you’d probably shake your head.\n If, however, a designer were to say the above to you, your response would likely be very different. This is due to the fact that for developers programming solutions, the primary mode of thinking is logical, while for designers the primary thinking tool is intuition.\n  There are some aspects of development that are intuitive. Likewise, as we will see in this post, there are also some aspects of design that are logical.\n When approaching a new field of study, the best way to go about it is often with a  constructivist approach. This simply means that as you learn, you leverage the knowledge or style of thinking that you already have in order to ease yourself into the new subject.\n For a developer approaching design, the ideal strategy would be to start with the most logical concept within the field of design:  information architecture.\n  Google defines information architecture as the labelling and organizing of information structures. In essence, information structures are everything that has been or can be created. Within the context of this post, we will use the term to reference things such as websites, mobile apps, and the like.\n Creating an information architecture comes down to figuring out the right questions to ask—the questions that solve the problem that you’re encountering. The next step is to structure the information in the best way for the use case, and solve it.\n It is a relatively logical, programming-like process with some intuition tacked on. Which is what makes it the perfect starting point for a logical developer who is eager to learn design.\n Leveraging the logic within design with this information-architecture-first strategy that we are laying out in this article will allow you to learn design in the fastest, most efficient way.\n  Information architecture is the most logical part of the design process. Which is what makes it a great starting point for all developers who want to learn design.\n In this context, perhaps the most important question within the process of designing a product is whether the product being designed actually solves the problem that is being encountered.\n Because information architecture also rests on the most fundamental end of the  design planning process, from the construction of an information architecture, to user flows, to the final implementation of the high-resolution design, it is at this level that the foundational question of whether or not the product solves the problem is also answered.\n In other words, because the most important thing in the design of a product is solving the problem that the product is meant to solve, and it only is by the correct, logical use of information architecture that this can occur, information architecture is the most important part of the design process.\n A firm grounding in information architecture gives you both the initial understanding of design necessary to build on, as well the keys to creating a design that  works, ultimately solving the problem.\n  When I started writing this post, I began by outlining the headings containing the key points that I would be covering throughout it, such as the heading that you see above.\n This heading served as the initial “information architecture” scaffolding, within which I then wrote and fleshed out the article. It was a low-resolution ordering of the ideas or information that would be presented throughout the piece.\n From this initial basis, I then gradually cascaded down into the writing, adding higher and higher resolutions of content or information, in order to complete the post.\n In the same way, if I were  creating a website, I would start with a sitemap, and from the pages within that sitemap, gradually begin to create higher resolution representations of those pages as wireframes. From there I could develop the specific, real-life elements that would ultimately make up the page, and then the website.\n As you go deeper into the above process, the  amount of intuition necessary to accomplish the final design increases.\n But on a solid foundation of a good information architecture, which is simply an accurate understanding of how to structure information elements for the best user experience possible, this is a process that can be learned and then iterated upon with analysis and practice.\n The design process can get complex as it progresses, but starting from the simple, low-res, bird’s-eye-view sitemap, which serves as the initial information, makes the process a lot simpler.\n  To get started on your journey toward a solid understanding of information architecture, it is best to start with more visual tutorials. This way, you can also get an understanding of the thought process that goes behind it.\n These are some of best videos on information architecture on YouTube that truly focus on the fundamentals:\n  If you’re looking for some great books on information architecture that explain the concepts in a great amount of detail, take a look at the following:\n   Once you’ve started to grasp information architecture at a decent level, you can move forward to designing and iterating interfaces that use your information architectures. From there, you can get into the design fundamentals that will guide you toward developing a good design intuition.\n And remember, there are always  more resources on the internet you can use as a guide for your next steps.\n When learning something new, the best way to ease your understanding process and gradually gain an appreciation for the subject is to leverage knowledge patterns that you are already familiar with.\n For developers, the best pattern is logic. And so, for a developer seeking to understand design—which requires both logic and intuition—it pays to start from the logical end of the spectrum, and from that foundation gradually work your way through until the more intuitive elements start to click.\n I hope that this post has served as a great introduction to the concept of information architecture and will assist you in beginning the journey toward developing your own design intuition.", "posttime": "2020-07-09 11:12:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,设计,架构,architecture", "title": "信息架构--开发者学习设计的秘诀", "title_en": "Information Architecture – The Secret Cheat Code for Developers Learning Design", "transed": 1, "url": "https://simpleprogrammer.com/information-architecture-developers-learning-design/", "via": "", "real_tags": ["开发", "设计", "架构"]}, {"category": "", "categoryclass": "", "imagename": "d1a63dcbcbacdd615f33d0908a520515.jpg", "infoid": 1010698, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "钟声以低音和许多高音同时振动，产生悦耳的音乐声音。京都大学和夏威夷大学MāNoa的科学家最近在“大气科学杂志”上发表的一项研究表明，地球的整个大气层都以类似的方式振动，这有力地证实了物理学家们在过去两个世纪里发展的理论。在这种情况下，音乐不是我们可以听到的声音，而是以横跨全球并绕赤道旅行的大规模浪潮的形式出现，一些是从东到西移动，另一些是从西向东移动。这些波中的每一种都是全球大气的共振振动，类似于钟声的一个共振音调。对这些大气共振的基本理解始于19世纪初由历史上最伟大的科学家之一、法国物理学家和数学家皮埃尔-西蒙·拉普拉斯提出的开创性见解。物理学家在接下来的两个世纪里的研究完善了这一理论，并导致了对大气中应该存在的波频率的详细预测。然而，对这类海浪的实际探测已经落后于理论。\n现在，在京都大学科学研究生院的助理教授坂崎隆和夏威夷大学MāNoa的国际太平洋研究中心大气科学系名誉教授凯文·汉密尔顿的一项新研究中，作者们详细分析了38年来全球每小时观测到的大气压力。结果清楚地揭示了数十种预测波模的存在。\n这项研究特别关注周期在2小时到33小时之间的波，这些波在大气层中水平传播，以极快的速度(超过每小时700英里)绕地球移动。这建立了一个与这些波传播时的高、低气压相关的特征棋盘图案(见图)。\n对于这些快速移动的波浪模式，我们观察到的频率和全局模式与理论预测的结果非常吻合，主要作者坂崎说。看到拉普拉斯和其他开拓性的物理学家的愿景在两个世纪后如此完全地得到证实，这是令人兴奋的。\n我们在真实数据中识别了如此多的模式，这表明大气确实像钟声一样响起，合著者汉密尔顿评论道。这最终解决了大气科学中一个由来已久的经典问题，但它也开辟了一条新的研究途径，既可以理解激发波浪的过程，也可以理解抑制波浪的过程。\n所以，让大气的音乐继续播放吧！更多信息：Takatoshi Sakazaki等人，在热带地面气压数据中发现的环形全球自由模式阵列，大气科学杂志(2020)。电话：10.1175/JAS-D-20-0053.1。\n引用：一项新的研究检测到全球大气的振铃(2020年7月8日)，从https://phys.org/news/2020-07-global-atmosphere.html检索到。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "A ringing bell vibrates simultaneously at a low-pitched fundamental tone and at many higher-pitched overtones, producing a pleasant musical sound. A recent study, just published in the  Journal of the Atmospheric Sciences by scientists at Kyoto University and the University of Hawai&#39;i at Mānoa, shows that the Earth&#39;s entire atmosphere vibrates in an analogous manner, in a striking confirmation of theories developed by physicists over the last two centuries.      In the case of the  , the &#34;music&#34; comes not as a sound we could hear, but in the form of large-scale waves of   spanning the globe and traveling around the equator, some moving east-to-west and others west-to-east. Each of these waves is a resonant vibration of the global atmosphere, analogous to one of the resonant pitches of a bell. The basic understanding of these atmospheric resonances began with seminal insights at the beginning of the 19th century by one of history&#39;s greatest scientists, the French physicist and mathematician Pierre-Simon Laplace. Research by physicists over the subsequent two centuries refined the theory and led to detailed predictions of the wave frequencies that should be present in the atmosphere. However, the actual detection of such waves in the   has lagged behind the theory.\n  Now in a new study by Takatoshi Sakazaki, an assistant professor at the Kyoto University Graduate School of Science, and Kevin Hamilton, an Emeritus Professor in the Department of Atmospheric Sciences and the International Pacific Research Center at the University of Hawai?i at Mānoa, the authors present a detailed analysis of observed atmospheric pressure over the globe every hour for 38 years. The results clearly revealed the presence of dozens of the predicted wave modes.\n  The study focused particularly on waves with periods between 2 hours and 33 hours which travel horizontally through the atmosphere, moving around the globe at great speeds (exceeding 700 miles per hour). This sets up a characteristic &#34;chequerboard&#34; pattern of high and low pressure associated with these waves as they propagate (see figure).\n   &#34;For these rapidly moving wave modes, our observed frequencies and global patterns match those theoretically predicted very well,&#34; stated lead author Sakazaki. &#34;It is exciting to see the vision of Laplace and other pioneering physicists so completely validated after two centuries.&#34;\n    &#34;Our identification of so many modes in real data shows that the atmosphere is indeed ringing like a bell,&#34; commented co-author Hamilton. &#34;This finally resolves a longstanding and classic issue in atmospheric science, but it also opens a new avenue of research to understand both the processes that excite the waves and the processes that act to damp the waves.&#34;\n  So let the atmospheric music play on!        More information:\t\t\t\t\t\t\t\t\t\t\t\tTakatoshi Sakazaki et al, An Array of Ringing Global Free Modes Discovered in Tropical Surface Pressure Data,  Journal of the Atmospheric Sciences (2020).  DOI: 10.1175/JAS-D-20-0053.1\n     Citation: New study detects ringing of the global atmosphere (2020, July 8) retrieved 8 July 2020 from https://phys.org/news/2020-07-global-atmosphere.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-07-09 11:11:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "探测,detects,大气", "title": "一项新的研究探测到全球大气的振铃", "title_en": "New study detects ringing of the global atmosphere", "transed": 1, "url": "https://phys.org/news/2020-07-global-atmosphere.html", "via": "", "real_tags": ["探测", "detects", "大气"]}, {"category": "", "categoryclass": "", "imagename": "162a6942414550dc7a1876d163e3fad0.jpg", "infoid": 1010697, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在你认为互联网不可能变得更糟的时候，国会来了一个真正灾难性的想法：表面上旨在打击性虐待未成年人的《赚取-IT法案》将对隐私造成严重破坏，并广泛审查每个人在网上围绕性和性取向的言论。", "note_en": "Just when you thought the Internet couldn’t get any worse, here comes Congress with a truly disastrous idea: The EARN-IT Act, ostensibly intended to crack down on sexual abuse of minors, would wreak havoc on privacy and broadly censor everyone’s speech around sex and sexuality online.", "posttime": "2020-07-09 10:50:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "赚取,act,想法", "title": "“赚取IT法案”即将摧毁互联网", "title_en": "The EARN-IT Act is Coming to Wreck the Internet", "transed": 1, "url": "https://www.thestranger.com/slog/2020/07/08/44053791/the-earn-it-act-is-coming-to-wreck-the-internet", "via": "", "real_tags": ["赚取", "act", "想法"]}, {"category": "", "categoryclass": "", "imagename": "cfa46673dbd9f41c424306d8ab2a4cb4.jpg", "infoid": 1010696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "西达纳之前在基金会资本工作了近9年，后来从基金会传奇创始人凯瑟琳·古尔德那里获得了他首批有限合伙人协议之一。他说，尽管大流行，但基金并没有太多痛苦。\n这在一定程度上要归功于Sidana的往绩，包括云监控初创公司SignalFx在从风投那里筹集1.79亿美元后以10亿美元的价格出售给Splunk，以及云应用监控初创公司Netsil在仅筹集570万美元后被Nutanix以7400万美元的股票价格出售。(Engineering Capital是这两家公司的第一个投资者。)。\n西达纳在加利福尼亚州帕洛阿尔托的日常工作。-它的中心是与“你可以用两个披萨喂饱的团队”合作，但他们狭隘的技术见解可以有广泛的适用性-也是一个明显的吸引力。为了了解更多，我们今天早些时候采访了西达纳，他是一位自称工程书呆子的人，曾在斯坦福大学学习计算机科学，他谈到了最近哪些“技术洞察力”吸引了他的注意。\nTC：你谈到追求有技术洞察力的创始人。大多数风险资本家不是这样吗？\nAS：没有。硅谷是一个科技投资生态系统，但它的大多数参与者并没有解决棘手的技术问题。他们有市场洞察力或消费者洞察力。这就是谷歌和Facebook的不同之处。谷歌想出了如何更好地索引，如何更好地对排序问题进行优先排序。Facebook是从消费者的洞察力开始的，那就是人们希望彼此联系起来。我专注于基于技术洞察力的公司。大多数风投公司不会这么做。\nAS：使用软件或技术来解决存在但没有解决方案的已知问题的团队。这样的问题很多。例如，我们现在的未来将是多云。亚马逊在AWS上取得了巨大的成功。微软的云业务做得很好。谷歌正在追赶他们。然后是七个小矮人，包括数字海洋。对于企业来说，参与基础设施建设是一种困难的方式。另一个技术问题根植于我们所有人都想把我们的基础设施交付给云，而不是我们的数据。我们怎么解决这个问题？一些人正在合法地解决这个问题，一些人则通过公开的方式解决。但说真的，这是个技术问题。\nTC：您最近下的赌注解决了一个技术问题吗？\nAS：我是Baffle的第一个投资者，Baffle是一家非常有趣的公司，它允许传统关系数据库的用户查看数据，而不是管理员。[编者按：该公司表示，它可以在不需要更改任何应用程序代码的情况下实现现场级别的数据保护。]。或者，鲁棒智能是一项更新的投资，它正在解决人工智能中的数据污染问题。\nAS：当你运行模型和做机器学习时，你做的是网络安全和保护它们，但人工智能正在处理的数据呢？他们有一个杀手级的演示，展示了当你用iPhone存入支票时，你的银行当然是在使用人工智能来识别支票，并确保正确的金额进入正确的账户。[但是一个邪恶的演员可以]在检查和更改号码和路由号码的照片中获得少量人眼看不见的像素。稳健所做的是保护(银行及其客户)免受这种数据污染。\nTC：我知道你倾向于很早投资--通常是开第一张支票。你是不是整天在斯坦福徘徊？你觉得这些新成立的球队怎么样？\nAS：我与许多学校都有很好的关系，包括[密歇根大学，斯坦福大学]，我参与了多伦多大学的创造性销毁实验室；我与[印度的学校]…保持着积极的关系。我花了很多时间和学术界或工业界的工程师们在一起。\nTC：你要开多少金额的支票来启动他们，你希望他们的公司能有多少回报？\nAS：大多数人认为投资于技术洞察力是昂贵的，但是如果您使用的是软件，那么它可以非常节省资本。我也在关注那些你可以通过100万美元和300万美元的收入和资金获得收入的公司。这通常需要一个5到8人的小团队，你可以用两个人来养活他们，而Linux最终是由一个人编写的。VMware是由两个人提出的技术见解创立的。谷歌的早期产品只与拉里和谢尔盖合作。\n至于所有权，我的工作是低买高卖。我和下一位风投一样贪婪，也很想拥有尽可能多的所有权，但没有公式。\nAS：Gluttony。大多数人认为他们必须追求一个大市场，解决一个大问题，但创业的魔力在于专注于一个极其狭窄、应用广泛的问题。正如史蒂夫·乔布斯(Steve Jobs)曾经说过的那样，很难扔掉功能，而不是添加它们。", "note_en": "Sidana — who previously spent nearly nine years with Foundation Capital and received one of his  first limited partner agreements  afterward from Foundation’s  legendary founder, Kathryn Gould — says the fund came together despite the pandemic without too much pain.\n That’s thanks in part to Sidana’s track record, including the sale of the cloud monitoring startup SignalFx to Splunk for $1 billion after it raised $179 million from VCs, and the sale of the cloud application monitoring startup Netsil by Nutanix for up for $74 million in stock after it raised just $5.7 million. ( Engineering Capital   was the first investor in both.)\n  Sidana’s day-to-day work in Palo Alto, Calif. –which centers on working with teams “that you can feed with two pizzas,” yet whose narrow technical insights can have broad applicability — was also an apparent draw. To learn more, we talked earlier today with Sidana, a self-described engineering nerd who studied computer science at Stanford about what “technical insights” have caught his attention most recently.\n TC: You talk about pursuing founders with technical insights. Is that not true of most venture capitalists?\n AS: No. Silicon Valley is a tech investing ecosystem, but most of its participants aren’t solving hard technical problems. They have market insights or consumer insights. It’s the difference between Google and Facebook. Google figured out how to index better, how to better prioritize a sorting problem. Facebook was started with the consumer insight that people want to be connected with each other. I focus on companies based on technical insights. Most VCs don’t.\n  AS: A team that’s using software or tech to solve a known problem that exists but for which there does not exist a solution. Many such problems exist. For example, we now the future will be multi cloud. Amazon has succeeded wildly with AWS. Microsoft is doing well with its cloud business. Google is catching up to them. Then you have the seven dwarves, including Digital Ocean. It’s a difficult way for enterprises to engage with infrastructure. Another technical problem is rooted in all of us wanting to give our infrastructure over to the cloud but not our data. How do we solve this? Some are solving it legally, some with publicity. But really, it’s a technical problem.\n TC: What’s a recent bet you’ve made that has solved a technical problem?\n AS: I’m the first investor in  Baffle, which is a really interesting company that enables the user of a traditional relational database to see the data but not an administrator. [Editor’s note: the company says it enables the field level protection of data without requiring any application code changes.] Or  Robust Intelligence is an even newer investment that’s solving the problem of data contamination in artificial intelligence.\n  AS: When you run models and do machine learning, you do cybersecurity and protect them, but what about the data that the AI is working on? They have a killer demo that shows that when you deposit a check with your iPhone, your bank is of course using AI to recognize check and ensure the right amount goes into the proper account. [But a nefarious actor could] procure a small number of pixels that are invisible to the human eye in the photo of check and change the numbers and the routing number. What Robust does is protecting [both the bank and its customers] from that kind of data contamination.\n TC: I know you tend to invest very early — often writing the first check. Are you hovering around Stanford all day? How do you find these nascent teams?\n AS: I have good relationships with many schools, including [the University of] Michigan, Stanford, I’m involved with the University of Toronto’s Creative Destruction Lab; I keep active relationships with [schools in India]… I spend a lot of time with engineers in academia or industry.\n TC: What size checks are you writing to get them started, and how much of their companies do you expect in return?\n AS: Most people think investing in technical insights is expensive, but it can be very capital efficient if you are working with software. I’m also looking at companies where you can get to revenue with $1 million and $3 million and funding. That typically takes a small team of five to eight people who you can feed with two people.  Linux was ultimately written by one person. VMWare was started by a technical insight addressed by two people. Google had its earlier stuff working with just Larry and Sergey.\n As for ownership, my job is to buy low and sell high. I’m as greedy as the next VC and would love to have as much ownership as I can, but there is no formula.\n  AS: Gluttony. Most think they have to go after a big market and solve a big problem, but the magic of doing a startup is to focus on an incredibly narrow problem that has broad application. As Steve Jobs used to say it is difficult to throw away features, not to add them.", "posttime": "2020-07-09 10:49:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "技术,fund", "title": "\n这家风投公司刚刚完成了6000万美元的融资，为“技术风险”提供资金，他说，其他风投公司很少会这样做", "title_en": "\n\t\t\t\tThis VC just closed on $60 million to fund “technical risk,” saying other VCs rarely do the same\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/this-vc-just-closed-on-60-million-to-fund-technical-risk-saying-other-vcs-rarely-do-the-same/", "via": "", "real_tags": ["技术", "fund"]}, {"category": "", "categoryclass": "", "imagename": "f3d661846d0160e8f90df8d74a9f8bc2.png", "infoid": 1010695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个通过IBM CPLEX使用约束编程(CP)生成Golomb标尺的示例应用程序。制作尺子是学习CP的一种有趣的方式(即使它不是制作它们的最有效的方法)。IBM也在他们的文档中将其用作培训练习。它包括一个Web前端，用于显示求解过程的实时指标(见下文)。\n在数学中，Golomb标尺是沿着虚构的标尺在整数位置上的一组标记，使得没有两对标记的距离相等。尺子上的记号是它的顺序，两个记号之间的最大距离是它的长度。Golomb标尺的平移和反射被认为是微不足道的，因此最小的标记通常放在0，下一个标记放在它的两个可能值中较小的一个。\n后端是用Scala编写的。前端是使用REACTION 16的单页面应用程序，并通过Web套接字监听求解器事件。\n下面是一个运行顺序为7的应用程序的示例。它显示当前找到的最佳标尺，以及诸如当前目标值、NumberOfChoicePoints、NumberOfBranches、MemoryUsage等实时指标。\n根│自述文件.md&lt；-您在这里！│└─服务器&amp；求解器││自述文件.md||.|.│└─客户端&lt；-网络客户端│自述文件.md||。||。\n解算器逻辑的核心在GolombRuler.scala中。这就是我们建模问题并启动CPLEX解决流程的地方。Server.scala设置Web服务器以接受求解请求，并设置Web套接字以将搜索过程更新发送到客户端。客户端目录包含订阅此Web套接字的Reaction前端，并提供用于向服务器发送解决方案请求的UI。\n为了在自述中包含图片，我们做了这样一个小技巧：将图片上传到这期gihub，然后复制gihub托管的资源的url。", "note_en": "This is an example application for producing  Golomb Rulers using constraint programming (CP) via IBM CPLEX. Producing rulers is a fun way to learn CP (even if it isn&#39;t the most efficient method of producing them). IBM uses it as a training exercise  in their documentation as well. It includes a web frontend that displays real time metrics of the solve process (see below).\n   In mathematics, a Golomb ruler is a set of marks at integer positions along an imaginary ruler such that no two pairs of marks are the same distance apart. The number of marks on the ruler is its order, and the largest distance between two of its marks is its length. Translation and reflection of a Golomb ruler are considered trivial, so the smallest mark is customarily put at 0 and the next mark at the smaller of its two possible values.\n    The backend is written in Scala. The frontend is a single page application which uses React 16, and listens over a web socket forsolver events.\n  Below is an example of running the app with an order of  7. It displays the current best found ruler, along with real time metrics like the current objective value,  NumberOfChoicePoints,  NumberOfBranches,  MemoryUsage etc.\n  root│ README.md &lt;- You are here!│└───server &lt;- Web server &amp; solver│ │ README.md| | .| | .│ └───client &lt;- Web client │ README.md | | . | | .\n The core of the solver logic is in  GolombRuler.scala. That is where we model the problem and kick off the CPLEX solve process. The  Server.scala sets up a web server to take solve requests, and sets up a web socket to send search process updates out to the client. The  client directory contains the React front-end which subscribes to this web socket, and provides a UI to send solution requests to the server.\n         To include images in the READMEs we do this little hack of uploading the images to  this github issue and then copying the url of the resource hosted by github.", "posttime": "2020-07-09 10:48:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,cplex,golomb,标尺", "title": "在IBM CPLEX中使用约束编程创建Golomb标尺", "title_en": "Create Golomb rulers using constraint programming with IBM CPLEX", "transed": 1, "url": "https://github.com/strateos/golomb-solver", "via": "", "real_tags": ["编程", "cplex", "golomb", "标尺"]}, {"category": "", "categoryclass": "", "imagename": "3202e9a8f8bd3c8ea36d44c3b78a99ac.png", "infoid": 1010694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CoinTracker是加密货币的投资组合助理。它由超过10万名加密货币持有者使用，拥有超过10亿美元的加密资产，使消费者和企业能够无缝跟踪他们的加密货币组合、投资表现、税收等。除了加密货币，我们还在为所有金融资产建立一个通用的自动化财务助理。\n🗺️创始人：乔恩·杨和陈丹之前创建了TextNow(5000万美元/年的收入业务)，并在谷歌工作过[x]。\n加入我们紧密联系的早期远程团队，他们依靠有趣的技术挑战和建造改善人们生活的神奇产品而茁壮成长。作为团队中的早期工程师，您将在整个团队中工作，并直接拥有顶级产品和工程目标。\n·发展我们的技术架构、基础设施、代码质量、工具和文化，以不断提高我们工程系统的质量和速度。\n·编写高质量代码，重视软件测试，维护工程、安全和设计方面的最佳实践。\n我们是一个分布广泛、组织严密的团队，遍布三个国家和五个城市。我们只有最少的过程，我们的大部分时间都花在通过Github、Slake、Zoom、Asana、Conept、Google Docs和Figma等工具进行异步工作和协作上。我们还通过每周全体员工、每周目标设定和每日站立表演保持一致。我们的目标是赋予团队中的每一个人充分的透明度、所有权、自主权和明确的目标。\n·提供大量数据-数十亿个数据点用于跟踪交易和市场配对价格。\n·数据结构和算法-包括自动转移检测、成本基础跟踪、税收优化等。您的CS基础知识终于派上用场了！\n·可扩展性-一些加密货币用户，如算法交易员，每年积累数百万笔交易。CoinTracker需要为这些强大的密码交易员无缝工作。\n·区块链-无论是运行我们自己的节点，实施xPub地址生成和遍历，还是解析智能合约以无缝支持分散交易，我们都接触到了核心区块链技术。\n·技术复杂性-与数百家交易所和区块链集成，并支持数千种加密货币意味着我们必须有条不紊地设计我们的软件，并构建关键监控系统，以提供一个强大而准确的平台。\n·开发智能订单路由平台，以实现跨交易所的加密货币交易，同时考虑到完整的交易历史、纳税批次、费用检测、套利和滑落。", "note_en": "CoinTracker is a portfolio assistant for cryptocurrency. Used by over 100,000 cryptocurrency holders with over $1,000,000,000 in crypto assets, it enables consumers and businesses to seamlessly track their cryptocurrency portfolio, investment performance, taxes, and more. Beyond cryptocurrency, we are building a general automated financial assistant for all financial assets.\n         🗺️ Founders:  Jon and  Chandan previously built TextNow ($50M/year revenue business) and worked at Google &amp; Google[x]\n   Join our tight-knit early-stage remote team that thrives on interesting technical challenges and building magical products that improve peoples&#39; lives. As an early engineer on the team, you will work across the stack and directly own top level product and engineering objectives.\n       • Evolve our technical architecture, infrastructure, code quality, tools, and culture to continually step up the quality and speed of our engineering systems\n     • Write high quality code, value software testing, and uphold best practices in engineering, security and design\n      We are a fully distributed, tight-knit team spread across three countries and five cities. We have minimal process, and the majority of our time is spent working and collaborating asynchronously through tools like Github, Slack, Zoom, Asana, Notion, Google Docs, and Figma. We also stay aligned through weekly all hands, weekly goal setting, and daily standups. We aim to empower every individual on the team with full transparency, ownership, autonomy, and clear objectives.\n         •  Lots of data — billions of data points to track transactions and market pair prices.\n •  Data structures &amp; algorithms — automated transfer detection, cost basis tracking, tax optimization, and more. Your CS fundamentals finally come in handy!\n •  Scalability — some cryptocurrency users, such as algorithmic traders, accumulate millions of transactions per year. CoinTracker needs to work seamlessly for those power crypto traders.\n •  Blockchain — whether it&#39;s running our own nodes, implementing xPub address generation and traversal, or parsing smart contracts to seamlessly support decentralized trading, we get our hands dirty with core blockchain technology.\n •  Technical complexity — integrating with hundreds of exchanges and blockchains, and supporting thousands of cryptocurrencies means we have to methodically architect our software and build critical monitoring systems to deliver a robust and accurate platform.\n    • Develop a smart order routing platform to enable cryptocurrency trading across exchanges, taking into account full transaction history, tax lots, fee detection, arbitrage and slippage.", "posttime": "2020-07-09 10:48:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,交易", "title": "CoinTracker正在聘请一名远程工程师来建造一个新的财务助理", "title_en": "CoinTracker is hiring a remote engineer to build a new financial assistant", "transed": 1, "url": "https://jobs.lever.co/cointracker/abb7f14c-5ad4-474a-ad5a-5356969b2121", "via": "", "real_tags": ["hiring", "交易"]}, {"category": "", "categoryclass": "", "imagename": "89543b828ec66bab20423c924da23023.jpg", "infoid": 1010693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球冠状病毒大流行使我们更加意识到时间是主观的。对于一些喜欢在家工作的人来说，日子过得很快。对于那些急于旅行或探望所爱之人的人来说，时间已经慢得像爬行一样。\n发明时钟是为了帮助我们跟踪时间的流逝--然而，在某些时刻，当我们盯着时钟看的时候，我们会意识到一秒钟可以感觉到多长时间。\n这两个时段的长度相等，尽管人们通常说，第一个时段-黄色方块可见的时候-感觉比第二个时段长，第二个时段是两个黄色正方形之间的空白或未填满的空隙。\n根据神经学家的说法，人体内没有一个器官或系统负责计时。事实上，心理学家已经确定了许多影响我们时间意识的因素，其中一些因素解释了我们今年对时间意识的增强。\n在这个练习中，你被要求在事件发生后做出时间估计，或者心理学家所说的回溯性判断。\n芬兰图尔库大学的哲学讲师瓦尔特里·阿尔斯蒂拉(Valtteri Arstila)解释说，你可以做出这个判断，因为你在工作记忆中有第一个要比较的形状。虽然这种方法可以比较非常短的持续时间，但对于较长的时间段则使用不同的过程。\n回想一下，当你被要求呆在家里以防止新的冠状病毒传播的时候。那段时间是过得快还是过得慢？\n例如，大多数纽约人被要求从3月份的某个时候开始呆在家里，许多人似乎注意到，尽管有重复的日子，4月份还是飞逝而过。\n加州大学圣地亚哥分校(University Of California San Diego)哲学教授克雷格·卡伦德(Craig Callender)解释说，我们做出这一判断是基于我们从长期记忆中回忆起的一件事。\n他说：“如果你把每个重要事件都看作是时钟的滴答声，4月份就没有那么多滴答声，所以感觉时间过得真的很快。”\n您刚刚观看了一系列图像，这些图像显示的时间相同，尽管新奇的图像，在本例中是嵌套的正方形，通常被认为持续时间更长。\n这就是所谓的怪异效应。阿尔斯蒂拉指出了两个现象，它们可以帮助我们理解我们是如何处理重复周期的。\n首先，我们在记忆中已经有了重复物体的记录，因此我们不太注意，感觉它过得更快。其次，当新的物体出现时，我们的注意力集中在创造新的记忆上，使时间感觉好像慢了下来。\nArstila说，抑制重复的日子是我们可能记得滞留在家里的时间过得很快的原因之一。他说，同样的影响也解释了为什么经常过着例行公事的退休人员会说时间过得飞快。\n许多研究关注了注意力和情绪是如何影响我们的时间感的。重新创建说明性示例存在挑战，但请尝试以下测试。\n您刚刚执行了间隔时间估计。三种刺激显示的持续时间相同，尽管不断扩大的圆圈通常被认为持续的时间更长。\nArstila说：“吸引我们注意力或需要更多关注的东西感觉要长得多。”\n“对时间的估计与人们的情绪最相关。如果你玩得很开心，时间过得飞快，如果你感到悲伤、孤独，那么时间就会流逝。“阿斯蒂拉说。\n忙碌的一天通常过得很快，但对一些人来说，2020年的情况正好相反。例如，前线医护人员知道他们接触冠状病毒的风险很高，由此产生的焦虑会提高他们的注意力，减缓他们对一天过得有多快的感知。\n然而，对于其他人来说，时间可以在快乐的时刻飞逝，比如视频追赶或与朋友共进晚餐。\n你可能发现自己最近在思考你最后一次与朋友见面或去健身房是什么时候。我们对最近和很久以前的事件的回忆以一种奇怪的方式扭曲。\n想一想最近的一次约会，估计它发生在多长时间之前，来测试一下自己。然后检查你的日历，看看它实际发生的时间。或者，在没有帮助的情况下，试着对以下事件进行约会。\n我们倾向于依靠记忆而不是知识来确定发生在我们有生之年的事件的日期。但是，当我们的记忆扭曲了我们对时间的感知时，它也会影响我们对事件何时发生的感觉。\n心理学家发现，当回忆起很久以前的事件时，认为它发生得比实际上更近是很常见的。但是，如果事件发生在过去三年内，我们往往认为它发生在更早的时间之前。\n这种效应叫做伸缩。可以把它想象成通过望远镜向后或向前看，图像会根据方向发生扭曲。\n鉴于今年卫生纸短缺，你还记得上一次买卫生纸是什么时候吗？记住，记忆会随着时间的推移而褪色，你的回忆可能会经历伸缩。\n2020年不会很快被遗忘为大流行之年，但我们很可能会弄错一些事件发生的确切时间。\n当你发现自己回顾这一年时，要意识到时间的错觉。\n实验室和外部世界的主观持续时间。在主观时间：时间性的哲学、心理学和神经科学[pdf]", "note_en": "The global coronavirus pandemic has heightened our awareness that time is subjective. For some people who enjoy working from home, the days have whizzed by. For others desperate to travel or visit a loved one, time has slowed to a crawl.\n Clocks were invented to help us track the passage of time - and yet in some moments when staring at a clock, we’re made aware of just how long a second can feel.\n  Both periods of time were equal in length, though the first period - when the yellow square is visible - is commonly said to feel longer than the second period, which is the empty, or unfilled, gap between two yellow squares.\n According to neuroscientists, there is not a single organ or system in the body responsible for timekeeping. In fact, psychologists have identified many factors that affect our sense of time, some of which explain our heightened awareness of it this year.\n  In this exercise, you were asked to make a time estimation after an event, or what psychologists call a retrospective judgement.\n Valtteri Arstila, a philosophy lecturer at the University of Turku in Finland, explains that you can make this judgment because you have in working memory the first shape to compare. While this method works comparing very short durations, a different process is used for longer time periods.\n Think back to when you were asked to stay home to prevent the spread of the new coronavirus. Did that period go by quickly or slowly?\n Most New Yorkers, for example, were asked to stay home beginning some time in March, and many seemed to note that April flew by despite the repetitive days.\n Craig Callender, a professor of philosophy at the University of California San Diego, explains that we’re making this judgment based on an event recalled from our longer term memory.\n “If you think of every salient event as ticks of the clock, there weren’t that many ticks in April so it feels like time went by really fast,” he said.\n  You just watched a series of images that were shown for the same amount of time though the novel image, in this case the nested squares, is often thought to have lasted longer.\n This is called the oddball effect. Arstila points to two phenomena that can help us understand how we deal with periods of repetition.\n First, we already have a record of the repeated object in memory and as such we pay less attention and it feels as though it passes more quickly. Second, when the new object appears, our attention focuses on creating a new memory, causing time to feel as though it has slowed down.\n Arstila says the suppression of repetitive days is one reason that we may remember periods stuck at home as passing quickly. This same effect, he says, explains why retired people, who often have routine days, report that time flies by.\n  A number of studies have looked at how attention and emotion affect our sense of time. There are challenges to recreating illustrative examples, but try the following test.\n  You just performed an interval time estimation. Three stimuli were shown for the same duration, though the expanding circle is often thought to last longer.\n “Things that grab our attention or require more attention feel much longer,” said Arstila.\n  “Passage of time estimates correlate best with moods people have. If you have a good time, time flies, if you are sad, lonely, then time tracks,” said Arstila.\n A busy day usually goes by quickly, but for some the opposite is true in 2020. Frontline healthcare workers, for example, know they are at high risk of exposure to the coronavirus, and the resulting anxiety heightens their attentiveness and slows their perception of how quickly a day passes.\n For others, however, time can fly during joyful moments, such as a video catch-up or dinner with friends.\n  You may have found yourself recently pondering when you last met up with a friend or went to the gym. Our recall of events both recent and long ago distort in a curious pattern.\n Test yourself by thinking of a recent appointment and estimating how long ago it happened. Then check your calendar to see when it actually occurred. Or, without help, try dating the following events.\n We tend to rely on memory rather than knowledge to date events happening within our lifetime. But as our memory distorts our perception of time, it also affects our sense of when an event took place.\n Psychologists have found that it’s common when recalling a long-ago event to think that it happened more recently than it did. But if the event happened within the past three years, we often think that it happened longer ago.\n This effect is called telescoping. Think of it as looking backward or forwards through a telescope where images are distorted depending on the orientation.\n Given the shortage in toilet paper this year, can you remember the last time you bought some? Keeping in mind that memories fade over time, your recall may experience telescoping.\n 2020 will not be forgotten as the year of the pandemic anytime soon, but there is a high probability that we will misplace exactly when some events occurred.\n As you find yourself looking back on this year, be aware of the illusion of time.\n  Subjective duration in the laboratory and the world outside. In Subjective time: The philosophy, psychology, and neuroscience of temporality  [pdf]", "posttime": "2020-07-09 10:42:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,感觉,feels,时间", "title": "为什么时间在2020年感觉如此奇怪", "title_en": "Why time feels so weird in 2020", "transed": 1, "url": "https://graphics.reuters.com/HEALTH-CORONAVIRUS/TIME/gjnvwwjegvw/", "via": "", "real_tags": ["2020", "感觉", "feels", "时间"]}, {"category": "", "categoryclass": "", "imagename": "17bbafc7f2da3e1f2e7463424fe5f68a.jpg", "infoid": 1010692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到导航跳跃以搜索惠普尔盾牌或惠普尔保险杠，由弗雷德·惠普尔发明[1]，是一种超高速撞击盾牌，用于保护载人和无人航天器免受速度通常在每秒3至18公里(1.9至11.2英里/秒)之间的微流星体和轨道碎片的碰撞。\n与早期航天器的整体屏蔽不同，惠普尔屏蔽是由一个相对较薄的外部保险杠组成的，它与主航天器壁相距一定距离。保险杠预计不会阻止传入的粒子，甚至不会带走它的大部分能量，而是将其分解和分散，将原始粒子的能量分配给许多碎片，这些碎片在保险杠和墙壁之间呈扇形分布。原来的粒子能量在更大的壁面上传播得更薄，更有可能承受得住它。一个直接的比喻是，与总质量和动能相同的单个步枪子弹相比，需要更轻的防弹背心来阻止大量的鸟弹。虽然惠普尔屏蔽与实心屏蔽相比降低了航天器的总质量，但在航天飞行中，低质量总是可取的，但额外的封闭体积可能需要更大的有效载荷整流罩。\n简单的惠普尔盾牌有几种变体。像“星尘”号航天器上使用的那样，多重防震护盾[2][3]使用间隔开的多个缓冲器来增加护盾保护航天器的能力。在坚硬的屏蔽层之间有填充物的惠普尔屏蔽称为填充惠普尔屏蔽。[4][5]这些屏蔽中的填料通常是高强度材料，如芳纶或Nextel氧化铝纤维。[6]屏蔽层的类型、材料、厚度和层之间的距离被改变，以产生质量最小的屏蔽层，该屏蔽层还将使穿透的可能性最小化。仅在国际空间站上就有100多种屏蔽配置[7]，高风险区域的屏蔽效果更好。\n惠普尔，弗雷德·L·惠普尔(1947年)，陨石与太空旅行，天文学杂志，52：131BIBCODE：1947AJ.52Q.131W，DOI：10.1086/106009。\n“航天器屏蔽的多重冲击概念”，“国际撞击工程杂志”，10(1-4)：135146DOI：10.1016/0734-743X(90)90054-Y。\n美国5067388，Crews，Jeanne L.&Amp；Burton G.Cour-Palais，超高速撞击盾牌，1991年11月26日发布。\n克里斯汀森，埃里克·L；Crews，珍妮·L；威廉姆森，乔尔·E；罗宾逊，詹妮弗·H；诺伦，安吉拉·M(1995年)，#34；增强的气象体和轨道碎片屏蔽，国际撞击工程杂志，17(1-3)：217-228，DOI：10.1016/0734-743X(95)99848-L。\n美国5610363，Crews，珍妮·L；埃里克·L·克里斯汀森和詹妮弗·H·罗宾逊等人，增强型惠普尔盾牌，1997年3月11日发布\n*克里斯汀森，埃里克·L(2003年)，气象体/碎片屏蔽，华盛顿特区：美国国家航空航天局，第13页，TP−2003-210788，存档自2013年2月25日的原始(技术报告)", "note_en": "Jump to navigation  Jump to search  The  Whipple shield or  Whipple bumper, invented by  Fred Whipple,  [1] is a type of  hypervelocity impact shield used to protect crewed and uncrewed  spacecraft from collisions with  micrometeoroids and  orbital debris whose velocities generally range between 3 and 18 kilometres per second (1.9 and 11.2 mi/s).\n   In contrast to monolithic shielding of early spacecraft, Whipple shields consist of a relatively thin outer bumper spaced some distance from the main spacecraft wall. The bumper is not expected to stop the incoming particle or even remove much of its energy, but to break up and disperse it, dividing the original particle energy among many fragments that fan out between bumper and wall. The original particle energy is spread more thinly over a larger wall area, which is more likely to withstand it. A direct analogy is that a lighter  bullet resistant vest is needed to stop a load of  birdshot than a single  rifle  bullet with the same total mass and  kinetic energy. Although a Whipple shield lowers total spacecraft mass compared to a solid shield, lower mass being always desirable in spaceflight, the extra enclosed volume may require a larger  payload fairing.\n There are several variations on the simple Whipple shield.  Multi-shock shields,  [2]  [3] like the one used on the   Stardust spacecraft, use multiple bumpers spaced apart to increase the shield&#39;s ability to protect the spacecraft. Whipple shields that have a filling in between the rigid layers of the shield are called  stuffed Whipple shields.  [4]  [5] The filling in these shields is usually a high-strength material like  Kevlar or Nextel  aluminium oxide fiber.  [6] The type of shield, the material, thickness and distance between layers are varied to produce a shield with minimal mass that will also minimize the probability of penetration. There are over 100 shield configurations on the  International Space Station alone,  [7] with higher-risk areas having better shielding.\n    ^   Whipple, Fred L. (1947), &#34;Meteorites and Space Travel&#34;,  Astronomical Journal,  52: 131,  Bibcode: 1947AJ.....52Q.131W,  doi:  10.1086/106009\n ^   Cour-Palais, Burton G.; Crews, Jeanne L. (1990), &#34;A Multi-Shock Concept for Spacecraft Shielding&#34;,  International Journal of Impact Engineering,  10 (1–4): 135–146,  doi: 10.1016/0734-743X(90)90054-Y\n ^    US 5067388, Crews, Jeanne L. &amp; Burton G. Cour-Palais, &#34;Hypervelocity Impact Shield&#34;, issued November 26, 1991\n ^   Christiansen, Eric L.; Crews, Jeanne L.; Williamsen, Joel E.; Robinson, Jennifer H.; Nolen, Angela M. (1995),  &#34;Enhanced Meteoroid and Orbital Debris Shielding&#34;,  International Journal of Impact Engineering,  17 (1–3): 217–228,  doi: 10.1016/0734-743X(95)99848-L\n ^    US 5610363, Crews, Jeanne L.; Eric L. Christiansen &amp; Jennifer H. Robinson et al., &#34;Enhanced Whipple Shield&#34;, issued March 11, 1997\n  ^   Christiansen, Eric L. (2003),   Meteoroid/Debris Shielding  (PDF), Washington DC: National Aeronautics and Space Administration, p. 13, TP−2003-210788, archived from  the original  (Technical Report) on 2013-02-25", "posttime": "2020-07-09 10:40:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "惠普,whipple,屏蔽", "title": "惠普尔盾牌", "title_en": "Whipple Shield", "transed": 1, "url": "https://en.wikipedia.org/wiki/Whipple_shield", "via": "", "real_tags": ["惠普", "whipple", "屏蔽"]}, {"category": "", "categoryclass": "", "imagename": "cddb1b3572086354cc22fd125d17d485.jpg", "infoid": 1010691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加里·拉森(Gary Larson)刚刚为“遥远的彼岸”发行了新漫画，这是自1995年1月以来的第一幅漫画。虽然拉森告诫说，这“不是远方每日漫画的复活”，在重读了25年我们最喜欢的漫画之后，我们对新作品感到如此兴奋，以至于我们愿意接受他想分享的任何东西。去年年底，拉森开始将他的漫画放到网上。\n新漫画的第一部以熊、外星人和标本为特色(都是另一边的主食)。这种风格很熟悉，但有两个大的例外：新漫画不是用水彩，而是用数字笔触制作，让图像感觉比原来的全色卡通更有体积和活力。此外，水彩画和黑白原创漫画中都存在的书面轮廓几乎完全消失了。最终的结果是图像唤起了老漫画的感觉，但不知何故变得不那么卡通了。所有的人物和元素都感觉在场景中统一在一起。\n“我被这个东西提供的所有工具和它所蕴含的所有创造潜力惊呆了。”\n风格的改变和漫画的回归都是因为拉森现在使用的是数字平板电脑。在多年与堵塞的钢笔和干涸的记号笔打交道后，拉森决定给数字化一个机会。“我被这个东西提供的所有工具和它所蕴含的所有创造潜力惊呆了。”我根本不知道这些东西已经演变到什么程度了，“拉森在他新作品的标题”新材料“(New Stuff)的开场信中写道。“也许恰如其分的是，我画的第一幅画是一个山顶洞人。”\n拉森并不是第一个用钢笔换手写笔的漫画家。诱惑力相当强。使用平板电脑打开了各种各样的数字画笔和工具，以及在对象和着色的层中工作的能力-这些选项在拉森的系列第一次运行时是不存在的。为了模仿钢笔和屏幕保护器，让它感觉像是在纸上绘图，存在的一系列触控笔也允许更流畅的过渡。\n在信的末尾，拉森要求读者记住，“我只是在探索、试验和尝试一些东西。”这是令人兴奋的。有了过多的新工具可供他使用，我们急切地想看看它们将如何用来重振遥远的世界，尽管拉森很少抽出时间来做这件事。", "note_en": "Gary Larson just released  new comics for  The Far Side, the first strips since January 1995. While Larson cautions that this is “not a resurrection of  The Far Side daily cartoons,” after 25 years of rereading our favorites, we’re so excited for new work that we’ll take anything he wants to share. Larson started to  bring his comics online late last year.\n The first of the new comics features bears, aliens, and taxidermy (all staples of  The Far Side). The style is comfortably familiar, with two large exceptions: instead of watercolor, the new comics are done in digital brushstrokes that make the images feel more volumetric and vibrant than the  original full-color cartoons. Also, the penned outlines, which exist in both the watercolor and black-and-white original comics, are almost entirely gone. The end result is images that evoke the feel of the old comics but are somehow a little less  cartoony. The characters and elements all feel unified in the scene together.\n “I was stunned at all the tools the thing offered, all the creative potential it contained.”\n Both the style changes and the comic’s return are due to the fact that Larson is now using a digital tablet. After years of frustration dealing with clogged pens and dried-up markers, Larson decided to give going digital a chance. “I was stunned at all the tools the thing offered, all the creative potential it contained. I simply had no idea how far these things had evolved,” Larson writes in an opening letter for  New Stuff, the title for his new works. “Perhaps fittingly, the first thing I drew was a caveman.”\n Larson isn’t the first cartoonist to trade in a pen for a stylus. The allure is pretty strong. Using a tablet opens up a wide variety of digital brushes and tools as well as the ability to work in layers for objects and coloring — options that didn’t exist when Larson’s series first ran. The range of styluses that exist to mimic pens and screen protectors that make it feel like drawing on paper allow for a smoother transition, too.\n At the end of the letter, Larson asks readers to remember, “I’m just exploring, experimenting, and trying stuff.” And that is exciting. With a plethora of new tools at his disposal, we’re eager to see how they’ll be used to revive  The Far Side, however infrequently Larson gets around to it.", "posttime": "2020-07-09 10:20:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "年后,side,拉森", "title": "25年后，另一边又回来了，而且都是数字化的", "title_en": "The Far Side Returns After 25 Years, and It's All Digital", "transed": 1, "url": "https://www.theverge.com/21317458/far-side-new-comics-creator-gary-larson-25-years-digital-tablet", "via": "", "real_tags": ["年后", "side", "拉森"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哇-我肯定在拖延建立这本日记.。2008年注册的域名", "note_en": "Wow - I sure am procrastinating on setting up this journal... Domain registered 2008", "posttime": "2020-07-09 09:53:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拖延,procrastination", "title": "拖延症杂志", "title_en": "Procrastination Journal", "transed": 1, "url": "http://www.procrastinationjournal.com/", "via": "", "real_tags": ["拖延"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010689, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Web货币化正在Web平台孵化器社区小组被提议作为W3C标准。\n转账能力一直是网络平台上的一个长期遗漏。因此，网络饱受广告泛滥和商业模式腐败之苦。Web货币化提供了一种开放、原生、高效和自动的方式来补偿创建者、为API调用付费并支持关键的Web基础设施。\n直到最近，还没有一个公开、中立的转账协议。Interledger为小额资金的转移提供了一种简单的、与分类帐无关和与货币无关的方法。这为流媒体货币打开了可能性，这使得网络货币化第一次成为可能。", "note_en": "Web Monetization is being proposed as a W3C standard at  the Web Platform Incubator Community Group.\n The ability to transfer money has been a long-standing omission from the web platform. As a result, the web suffers from a flood of advertising and corrupt business models. Web Monetization provides an open, native, efficient, and automatic way to compensate creators, pay for API calls, and support crucial web infrastructure.\n Until recently, there hasn&#39;t been an open, neutral protocol for transferring money.  Interledger provides a simple, ledger-agnostic, and currency-agnostic method for the transfer of small quantities of money. This opens up the possibility for streaming money, which makes Web Monetization possible for the first time.", "posttime": "2020-07-09 09:52:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,web", "title": "网络货币化", "title_en": "Web Monetization", "transed": 1, "url": "https://webmonetization.org/", "via": "", "real_tags": ["网络", "web"]}, {"category": "", "categoryclass": "", "imagename": "8695ecb60213d76e9caba78cbfe06cc7.jpg", "infoid": 1010688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早期的报道表明，在这段时间里，这家流媒体服务留住了一些订户，但速度可能低于最近推出的竞争对手服务。传感器塔向TechCrunch提供的数据估计，在Quibi应用程序的前三天注册免费试用的91万名用户中，约有8%在三个月免费试用期过后仍坚持使用这项服务。All-in-all Sensor Tower估计，在91万名订户中，“最多”有7.2万名订户在免费试用到期后仍坚持使用Quibi。\n值得注意的是，这并不是Quibi的用户总数，只占注册的前3天的转换量。作为背景，Sensor Tower分享了在注册的前三天迪士尼+的950万下载量中，约有100万用户(占总用户的11%)转换为付费订阅。这里最大的不同之处在于Quibi选择了长达三个月的免费试用，而迪士尼+则推出了7天的免费试用。\n传感器塔估计，自4月6日以来，Quibi的总下载量已达450万次。4月份之后，Quibi从3个月的免费试用过渡到14天的免费试用，因为它缩减了早期为提振早期势头所做的努力。\n在给The Verge的一份关于同样数据的声明中，Quibi的一位发言人驳斥了传感器塔的发现，称“付费订户的数量不正确一个数量级。到目前为止，已经有超过560万人下载了Quibi应用程序。我们从下载到试用的转化率高于移动应用基准，我们看到向付费订户的转化率非常好--无论是从4月份开始的90天免费试用注册，还是从5月和6月开始的14天免费试用注册。“。\n针对Quibi的声明，传感器塔的一位发言人表示，总下载数量之间不匹配的原因可能在一定程度上是因为其数据只计算为“通过单一苹果ID或谷歌账户下载的应用程序的第一次下载”。因此，我们的数据不会反映该应用程序是否由同一用户再次安装，例如删除后或安装到另一台设备上。“", "note_en": "Early reports indicate that the streaming service held onto some subscribers through that period, but perhaps at a lesser rate than recently launched rival services. Data provided to TechCrunch by Sensor Tower estimates that around 8% of the 910,000 users who signed up for a free trial of Quibi in the app’s first three days stuck with the service past the expiration of the three-month free trial period. All-in-all Sensor Tower approximates that “a maximum of” 72,000 subscribers of that 910,000 subscriber number stuck with Quibi after their free trials expired.\n It’s important to note that this is not the total number of Quibi’s users and only accounts for conversions for the first 3 days of sign-ups. For context, Sensor Tower shared that of the 9.5 million downloads for Disney+ in its first three days of sign-ups, about 1 million users (or 11% of the total) converted to paid subscriptions. The huge difference here is that Quibi opted for a lengthy three month free trial, whereas Disney+ launched with a 7-day free trial.\n  Sensor Tower estimates Quibi has been downloaded 4.5 million times in total since April 6. After April, Quibi transitioned from a three-month free trial to a 14-day free trial as it scaled back its early efforts to juice early momentum.\n  In a statement to  The Verge regarding the same data, a spokesperson for Quibi pushed back on Sensor Tower’s findings, saying that  “the number of paid subscribers is incorrect by an order of magnitude. To date, over 5.6 million people have downloaded the Quibi app. Our conversion from download to trial is above mobile app benchmarks, and we are seeing excellent conversion to paid subscribers — both among our 90-day free trial sign-ups from April, as well as our 14-day free trial sign-ups from May and June.”\n In response to Quibi’s statement, a Sensor Tower spokesperson indicated that the cause of the mismatch between total download numbers could be, in part, due to the fact that its data only counts installs as “the first download of an app by a single Apple ID or Google account. As such, our figures won’t reflect if the app is installed again by the same user, such as after deletion or to another device.”", "posttime": "2020-07-09 09:29:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,quibi", "title": "\n报告称，免费试用到期后，Quibi失去了92%的最早用户", "title_en": "\n\t\t\t\tReport says Quibi lost 92% of its earliest users after free trials expired\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/report-says-quibi-lost-92-of-its-earliest-users-after-free-trials-expired/", "via": "", "real_tags": ["免费", "quibi"]}]