[{"category": "", "categoryclass": "", "imagename": "949004924e0a52f9cd492d71714a1a42.jpg", "infoid": 1072145, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "海怪在地球上大多数航海文化的神话和传说中扮演着重要的角色，并且拥有如此鼓舞人心的海洋生物多样性，不难看出原因。与鱼的高级策展人奥利弗·克里门和软体动物的高级策展人乔恩·阿布莱特一起探索潜伏在博物馆湿藏品中的昔日奇妙海怪背后的现实灵感。海妖起源于斯堪的纳维亚民间传说，通常被描述为一种具有攻击性的头足类生物，能够摧毁整艘船并将水手拖入厄运。乔恩说：“世界各地的许多文化都有关于有触手的野兽骚扰海员或通常起不来的神话或传说。”在古希腊，亚里士多德和普林尼写过关于 teuthos（鱿鱼）的文章。有奥德赛中的 Scylla 和来自加勒比海 (Lusca)、日本 (Akkorokamui) 和新西兰 (Te Wheke-a-Muturangi) 的类似神话。乔恩说：“鱿鱼和章鱼确实是不寻常的动物。他们的身体计划与我们在海中所知的任何其他事物都不相似。它们快速移动，它们的身体、手臂和触手移动的方式似乎刺激了我们对未知事物的恐惧。 “我认为它们是如此奇怪的生物，一些非常大的物种很少被看到，这使得它们很可能成为海妖和其他海兽传说的起点。\n“我们认为发生的事情是，巨型鱿鱼和大章鱼的部分消化或腐烂的遗骸被冲上海滩，人们开始猜测它们可能是什么。 “在挪威，海妖神话不断发展，这种被冲毁的标本被解释为来自上帝或魔鬼的信息，有时被称为海天使、海魔鬼或海僧。”他补充说，“这些事情是分开发生的，世界各地的人们提出了类似的答案和神话——这是神话形式的趋同进化的一个案例。”巨型鱿鱼 (Architeuthis dux) 于 1857 年首次被西方科学分类，科学家们仍在忙于解开他们的奥秘。 “命名和分类一种新动物只是一个开始，”乔恩说。 “我们知道它是真实的，而不是人们想象中的神话中的野兽，但我们仍然只是开始了解它们。”巨型鱿鱼生活在世界各地的温带水域，生活在地表以下 200-1,400 米之间。人们认为雌性可以长到 13 米，而稍小的雄性可以长到 10 米。巨型鱿鱼不挑食——它们捕食鱼类和甲壳类动物，也吃食。科学家们发现了一些自相残杀的证据，但菜单上没有船只的迹象。\n他们最大的适应是他们的大眼睛。巨型鱿鱼拥有地球上所有生物的第二大眼睛，用于帮助探测和避开抹香鲸，抹香鲸是唯一大到足以在它们完全长大后吃掉巨型鱿鱼的捕食者。虽然其他一些较小的鱿鱼种类是好斗的猎食者，但人们认为巨型鱿鱼在远离人类接触的深温带水域过着孤独的生活。据乔恩说，“它们可能无法变得足够大以击沉一艘船，但这取决于你的船的大小。” &#39;巨型鱿鱼无法在地表获得它们所需的氧气。因此，当人们确实在地表遇到活体时，那是因为他们压力大，可能快要死了。 “我们仍然不知道它们是如何交配的，它们能活多久，它们是如何生长的。它们仍然是高度神秘的野兽，令人兴奋的是科学家仍在回答这些问题。作为世界各地航海民俗的一个特征，拥有人形躯干和蛇形尾巴的海妖和人鱼已经在地图和人类想象的角落里萦绕了数千年。奥利弗说：“在 18 世纪，任何乘坐木船飞越地平线的人比今天至少有无线电联系的宇航员更能与其他人脱节。”\n“这些水手有时会因为与家里的人没有接触而旅行多年。人们对他们可能在世界另一端看到的奇妙事物抱有很大的期望。他们的故事非常受欢迎，以至于日本有进取心的工匠在隐匿动物标本方面建立了蓬勃发展的贸易。虽然今天我们可能会因为它们是恶作剧而认出创造性动物标本剥制术或巧妙地干燥海洋动物，但美人鱼曾经是好奇心和狂欢节杂耍的私人橱柜的珍贵特征。 Jenny Hanivers - 可追溯到 1500 年代 - 是一种奇妙的海洋生物，由鳐鱼或 Rhinobatidae 科的鳐鱼（俗称吉他鱼）的干燥身体制成。这些鱼生活在海底，虽然它们身体的前端使它们看起来像鳐鱼或鳐鱼，但身体的其余部分更像鲨鱼。尽管音乐名称（指的是它们独特的体型），吉他鱼不会为水手唱小夜曲。这种平静的底栖动物吃无脊椎动物，在世界各地的浅海中都能找到。根据奥利弗的说法，在它们的亲戚——射线中可以看到与警报器行为最相似的行为。他说：“一些小种类的鳐鱼喜欢把自己的鼻子伸出水面，有时会从水中出现一个奇怪的像脸一样的幻影。它们通常是水族箱的特征，有些物种甚至会让人类触摸它们。 “如果你看一下通常位于海床上的身体底部，你会看到它们用来压碎和吃掉甲壳类动物的下巴，以及排出水的呼吸孔。当它们干燥折叠时，就会露出一张怪诞的脸。\n这些动物还有一个尖尖的鼻子或讲台，类似于教会的帽子，这就是为什么它们有时也被称为海主教。海蛇和海龙出现在世界各地可追溯到古代的故事中，通常被描绘成对水手造成严重破坏。奥利弗说：“海蛇神话可以追溯到古代，我们甚至无法辨别。” “如果我们正在寻找产生这些故事的自然世界的候选人，那么皇带鱼就位居榜首。”奥利弗说：“皇带鱼真的是一种非常漂亮的动物——长达八米，长着一张马似的脸，头上有火红色的冠，鳍一直延伸到明亮的金属银色身体。你还想从海怪那里得到什么？世界上最长的硬骨鱼，巨型皇带鱼 (Regalecus glesne)，已被记录可长达 8 米。它在世界各地的温带和热带水域均有发现，据信生活在 200 至 1,000 米的深处。与海洋中许多最大的生物一样，皇带鱼吃浮游生物。 “不幸的是，当他们浮出水面时，这意味着他们遇到了麻烦并陷入困境，”奥利弗解释说。\n皇带鱼通常以垂直或水平姿势游泳，利用身体的左右起伏和背鳍来保持平衡和向前移动。只有在水面，它们在呼吸困难时才会侧身游泳。 “它们在水面上侧身游泳，这些从左到右的起伏变成了垂直的起伏，创造了一个有趣的奇观，甚至可以使它们的身体卷出水面。”尽管生活在深海、以浮游生物为食的皇带鱼对沉没船只或吃掉水手没有兴趣，但一些人认为它们是深海地震和海啸的可靠预报器，在地震事件发生前就将自己搁浅。尽管该理论尚未得到证实，但奥利弗认为存在一些有趣的假设联系。 “它是一种长而扁平的带状动物，如果你有这种体型，它可能会特别受到压力波的影响，”他说。 &#39;有相当多的猜想，但可能有其核心的东西。 “海洋，尤其是深海，是地球上探索最少的栖息地。一直从那里传来的图像向我们展示了我们真正知道的很少，还有多少惊喜在深海等着我们。", "note_en": "Sea monsters have a prominent role in myths and legends of most seafaring cultures on Earth and with such inspiring  ocean biodiversity, it&#39;s not difficult to see why.\n  Join  Oliver Crimmen, Senior Curator of Fish, and  Jon Ablett, Senior Curator of Mollusca, as they explore the real-life inspiration behind fantastic sea monsters of yore that are lurking in the Museum&#39;s wet collections.\n  Originating in Scandinavian folklore, the kraken is usually depicted as an aggressive cephalopod-like creature capable of destroying entire ships and dragging sailors to their doom.\n  &#39;Many cultures around the world have a myth or legend about a tentacled beast bothering seamen or generally getting up to no good,&#39; Jon says.\n In ancient Greece, Aristotle and Pliny wrote about teuthos (squid). There&#39;s the Scylla in the Odyssey and similar myths from the Caribbean (Lusca), Japan (Akkorokamui) and New Zealand (Te Wheke-a-Muturangi).\n  Jon says, &#39;Squid and octopus really are unusual animals. Their body plan isn&#39;t similar to anything else that we know of in the sea. They move quickly and the way that their bodies, arms and tentacles move seem to stimulate something in our fear of the unknown.\n &#39;I think the fact that they are such odd creatures, with some very large species being very rarely seen, make it very likely that they could be the starting points for the kraken and other sea beast legends.\n &#39;What we think happened is that the partially digested or rotted remains of giant squid and large octopus were washing up on beaches and people were starting to guess what they might be.\n &#39;In Norway, the kraken myth grew and such washed-up specimens were interpreted as messages from God or the Devil, sometimes called sea angels, sea devils or sea monks.&#39;\n  He adds, &#39;These things happened separately and people around the world came up with similar answers and mythologies - a case of convergent evolution in myth form.&#39;\n  Giant squid ( Architeuthis dux) were first classified by Western science in 1857 and scientists are still busy unpacking their mysteries.\n &#39;Naming and classifying a new animal is only the beginning,&#39; Jon says. &#39;We knew it was real and not a mythical beast from people&#39;s imaginations, but we&#39;re still really just getting to know them.&#39;\n Found in temperate waters all over the world, giant squid live between 200-1,400 metres below the surface. Females are thought grow up to 13 metres and the slightly smaller males reach 10 metres.\n Giant squid aren&#39;t fussy eaters - they hunt fish and crustaceans and also scavenge. Scientists have found some evidence of cannibalism, but there&#39;s no sign of ships on the menu.\n Their greatest adaptation are their huge eyes. Giant squids have the second-largest eyes of any creature on Earth,  used to help detect and avoid sperm whales, which are the only predator large enough to eat giant squids when they are fully grown.\n While some other species of smaller squid are aggressive pack hunters, the giant squid is thought to lead a solitary life in deep, temperate water, far from human contact.\n  According to Jon, &#39;They probably can&#39;t get big enough to take down a ship, but then it depends on the size of your vessel.&#39;\n &#39;Giant squid can&#39;t get the oxygen they need at the surface. So when people do come across a live one at the surface, it&#39;s because they are stressed and probably dying.&#39;\n &#39;We still don&#39;t know how they mate, how long they live for, how they grow. They&#39;re still highly mysterious beasts and it&#39;s exciting that scientists are still answering these questions.&#39;\n  A feature of seafaring folklore around the world, sirens and merfolk with humanoid torsos and serpentine tails have haunted the corners of maps and human imagination for millennia.\n  Oliver says, &#39;Anybody travelling in a wooden ship over the horizon in the eighteenth century was more out of touch with the rest of humanity than today’s astronauts who at least have radio contact.&#39;\n &#39;These sailors would sometimes be travelling for years out of contact with people at home. There were big expectations about the fantastic things they might have seen on the other side of the world.&#39;\n Their stories were so popular that enterprising craftspeople in Japan established a thriving trade in cryptozoological specimens.\n  Although today we may recognise creative taxidermy or artfully dried sea animals for the hoaxes they were, mermaids were once prized features of private cabinets of curiosity and carnival sideshows.\n  Jenny Hanivers - which date back to the 1500s - are fantastical sea creatures manufactured from the dried bodies of skates or rays from the family Rhinobatidae , commonly known as guitar fishes. These fishes live on the seabed, and while the front end of their bodies makes them look like rays or skates, the rest of the body is more like a shark.\n  Despite the musical name (which refers to their distinctive body shape), guitar fish don&#39;t serenade sailors. The placid, bottom-dwelling animals eat invertebrates and can be found all over the world in shallow seas.\n According to Oliver, the closest resemblance to siren-like behaviour is seen in their relatives, the rays. He says, &#39;Some small species of ray have endeared themselves to humans with their habit of poking their snouts up out of the water, which can sometimes create a strange face-like apparition emerging from the water. They are often features of aquaria where some species will even let humans touch them.\n &#39;If you look at the underside of the body, which is normally resting on the seabed, you will see the jaws they use to crush and eat crustaceans and the breathing apertures where water is expelled. When they are dried and folded, a kind of grotesque face is revealed.&#39;\n  The animals also have a pointed snout or rostrum, which resembles an ecclesiastical hat, which is why they were sometimes also called sea bishops.\n  Sea serpents and sea dragons appear in stories from all over the world dating back to antiquity, and are usually depicted creating havoc for sailors.\n  &#39;Sea serpent myths go back into antiquity to a point in time we can&#39;t even discern,&#39; Oliver says. &#39;If we are looking for candidates from the natural world that generated these tales, then the oarfish is at the top of the list.&#39;\n  Oliver says, &#39;The oarfish really is a fantastic looking animal - up to eight metres long, with a horse-like face, flame-red crest on its head and fin all the way down its bright, metallic silver body. What else do you want from a sea monster?&#39;\n  The world&#39;s longest bony fish, the giant oarfish ( Regalecus glesne),  has been documented growing up to eight meters in length.\n It is found worldwide in temperate and tropical waters and is thought to live at depths between 200 and 1,000 metres. Like many of the largest creatures in the sea, oarfish eat plankton.\n  &#39;Unfortunately, when they come to the surface, it means they are in trouble and stranding themselves,&#39; Oliver explains.\n  Oarfish usually swim in a vertical or horizontal position, using left and right undulations of their bodies and dorsal fins to balance and move forward. It is only at the surface, where they are struggling to breathe that they swim on their sides.\n &#39;Swimming on their sides at the surface, these left to right undulations become vertical undulations that create an interesting spectacle and can even cause their bodies to coil up out of the water.&#39;\n  Although deep-sea-dwelling, plankton-eating oarfish have no interest in sinking ships or consuming sailors, they are considered by some to be reliable predicators of deep-sea earthquakes and tsunamis, stranding themselves in numbers before seismic events.\n  While the theory remains unproven, Oliver believes there are some interesting hypothetical links. &#39;It&#39;s a long, flat, ribbon-shaped animal and if you have that kind of body shape, maybe it&#39;s going to be particularly affected by pressure waves,&#39; he says. &#39;There&#39;s quite a lot of conjecture, but there may be something at the heart of it.\n &#39;The sea, especially the deep sea, is the least explored habitat on Earth. Images coming back from there all the time are showing us just how little we really know and how many surprises are still waiting for us in the deep ocean.&#39;", "posttime": "2021-08-09 01:48:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美人鱼,monsters,动物", "title": "海怪及其灵感来源：蛇、美人鱼、海妖等", "title_en": "Sea monsters and their inspiration: serpents, mermaids, the kraken and more", "transed": 1, "url": "https://www.nhm.ac.uk/discover/sea-monsters-inspiration-serpents-mermaids-the-kraken.html", "via": "", "real_tags": ["美人鱼", "monsters", "动物"]}, {"category": "", "categoryclass": "", "imagename": "9f7d2389e187cdabe6f0dab242ec177b.png", "infoid": 1072142, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 Grapl，我们相信为了构建最好的防御系统，我们需要深入了解攻击者的行为。作为该目标的一部分，我们正在投资进攻性安全研究。继续关注我们的博客，了解有关高风险漏洞、漏洞利用和高级威胁策略的新研究。在此处查找已发布的 CVE-2021-3490 的本地提权 (LPE) 概念证明：https://github.com/chompie1337/Linux_LPE_eBPF_CVE-2021-3490。它针对 Ubuntu 20.10 (Groovy Gorilla) 内核 5.8.0-25.26 到 5.8.0-52.58。和 Ubuntu 21.04 (Hirsute Hippo) 5.11.0-16.17。这篇博文旨在从漏洞利用开发人员的角度详细概述 eBPF。在这篇文章中，我介绍了：我对 eBPF 一无所知。我希望通过分享一个 PoC 以及我的开发经验，它可以帮助其他人开始使用 eBPF。 Berkeley Packet Filter (BPF) 最初是作为在内核中执行数据包过滤的一种方式而创建的。它的功能后来被重新设计和扩展，以创建扩展的伯克利数据包过滤器 (eBPF) [1]。简而言之，eBPF 为用户模式应用程序提供了一种无需编写内核模块即可在内核中运行代码的方法。使用 eBPF 与内核模块相比的所谓好处是易用性、稳定性和安全性。与纯用户模式程序相比，通过直接在内核中执行某些任务还可以获得性能改进。 eBPF 程序用于做很多事情，例如：跟踪、检测、挂钩系统调用、调试，当然还有数据包捕获/过滤。 eBPF 程序是用高级语言编写的，并使用工具链（例如 BCC [18]）编译成 eBPF 字节码。 eBPF VM 使用一个简单的指令集，该指令集使用 11 个* 64 位寄存器、一个程序计数器和一个 512 字节固定大小的堆栈。九个寄存器是通用读写，一个是只读堆栈指针，程序计数器是隐式的 [2] 。指令集与 x86 类似，可对 64 位和 32 位值进行操作。\n*从技术上讲，它使用了 12 个寄存器，但第 12 个寄存器是一个辅助寄存器，仅用于执行 ALU 卫生操作 [12]。用户模式应用程序使用 bpf() [14] 系统调用将字节码加载到内核中，其中 eBPF 验证器将执行许多检查以确保程序在内核中“安全”运行。这个验证步骤很关键——eBPF 为非特权用户公开了一条在 ring0 中执行的路径。加载程序后，用户模式应用程序将程序附加到“挂钩点”。挂钩点是内核中可以附加 eBPF 程序的地方 [5]。 eBPF 程序是事件驱动的，这意味着程序将在挂钩点发生某些事件时执行。经典用例是将 eBPF 程序附加到套接字，当数据写入时程序将在套接字中执行。如果设置了 kconfig 旋钮 CONFIG_BPF_JIT，则 eBPF 程序在验证和加载后会被 JIT 编译为原生汇编指令。否则，当程序执行时，它会在 eBPF 解释器中运行，该解释器解码并执行 eBPF 字节码指令。用户模式应用程序可以使用 eBPF 映射和 eBPF 辅助函数与内核中运行的 eBPF 程序交互并从中获取数据，这些函数通过 bpf() 系统调用进行访问。 sysctl 旋钮 kernel.unprivileged_bpf_disabled 决定是否允许非特权用户运行 eBPF 程序。如果未设置，则允许非特权用户将 eBPF 程序附加到用户拥有的套接字。在许多 Linux 发行版中，例如 Ubuntu，默认情况下未启用 unprivileged_bpf_disabled。因此，我决定更仔细地研究 eBPF，因为允许非特权用户在内核中运行代码是一个成熟的攻击面。我在上面提到过，用户模式进程可以使用 eBPF 映射与内核中的 eBPF 程序进行交互。它们也可以被多个 eBPF 程序用来相互交互。它们是具有任意数据结构的通用键/值存储 [6]。有多种类型的映射，包括：数组、队列和堆栈。\nkey_size - 用于索引元素的键的字节大小（用于数组映射） map_flags - 描述映射的特殊特性，例如是否应该预先分配整个映射内存。可以使用 BPF_MAP_CREATE 命令通过 bpf() 系统调用从用户空间创建和更改 eBPF 映射，使用 BPF_MAP_UPDATE_ELEM 命令更新，并使用 BPF_MAP_LOOKUP_ELEM 命令检索其内容。 eBPF 程序可以使用 BPF_MAP_CREATE 返回的文件描述符并调用 eBPF 辅助函数来访问 eBPF 映射，该函数将返回指向映射中值的指针。我编写的漏洞利用了 eBPF 验证器中的一个错误。因此，在深入研究漏洞之前，重要的是简要解释验证器的内部结构。验证器首先构建程序的控制流图。然后，它将通过每个可能的控制流来验证每条指令是否有效以及所有内存访问都是安全的 [3]。之后，它将向程序添加运行时检查。这个过程称为 ALU Sanitation，将补丁插入 eBPF 字节码，以确保在执行指针运算时不会违反运行时允许的内存范围 [4]。不能执行指针比较，只能向指针添加或减去标量值。 eBPF 验证器中的标量值是任何不是从指针派生的值。验证器跟踪哪些寄存器包含指针，哪些包含标量值。指针运算不能离开地图的“安全”边界。意思是，程序无法访问预定义地图内存之外的任何内容。为此，验证器会跟踪每个寄存器的值的上限和下限。\n指针不能存储在映射中或存储为返回值，以避免内核地址泄漏到用户空间。验证器为每个可能的执行路径中的每个寄存器存储以下边界值，以确保没有越界内存访问： umin_value ， umax_value 存储被解释为无符号时的寄存器的最小值/最大值 (64 bit) 整数 smin_value ， smax_value 在解释为有符号（64 位）整数时存储寄存器的最小值/最大值。 u32_min_value , u32min_value 在解释为无符号（32 位）整数时存储寄存器的最小值/最大值。 s32_min_value , s32_max_value 存储寄存器的最小值/最大值，当解释为有符号（32 位）整数时。 var_off 包含有关已知寄存器位的信息。它存储在一个名为 tnum 的结构中，该结构包含两个 64 位字段： mask 和 value 。在掩码中设置的每一位都意味着该位的值是未知的。未设置位是已知的，它们的真实值存储在 value 中。例如，如果 var_off = {mask = 0x0; value = 0x1} ，寄存器的所有位都是已知的，并且已知寄存器的值为1。如果var_off = {mask = 0xFFFFFFFF00000000; value = 0x3} 表示寄存器的低 32 位已知为 0x00000003，高 32 位未知。\n这些边界用于相互更新。特别是，如果 var_off 指示寄存器是已知常数，则更新最小/最大界限以反映已知值。我们稍后会看到为什么这很重要！ ALU Sanitation 是一项功能，用于补充验证器的静态范围跟踪。如果寄存器的值在运行时未落在其预期范围内，则该想法是为了防止 OOB 内存访问。添加此功能是为了帮助减轻验证器中的潜在漏洞并防止投机攻击。对于涉及指针和标量寄存器的每个算术运算，都会计算 alu_limit。这表示可以添加到指针或从指针中减去的最大绝对值 [4]。在这些操作中的每一个之前，使用以下指令修补字节码： *patch ++ = BPF_MOV32_IMM ( BPF_REG_AX , aux - &gt;alu_limit ) ； *补丁++ = BPF_ALU64_REG ( BPF_SUB , BPF_REG_AX , off_reg ) ; *补丁++ = BPF_ALU64_REG ( BPF_OR , BPF_REG_AX , off_reg ) ; *补丁++ = BPF_ALU64_IMM (BPF_NEG, BPF_REG_AX, 0); *补丁++ = BPF_ALU64_IMM (BPF_ARSH, BPF_REG_AX, 63); *补丁++ = BPF_ALU64_REG ( BPF_AND , BPF_REG_AX , off_reg ) ;注意off_reg 代表被添加到指针寄存器的标量寄存器，BPF_REG_AUX 代表辅助寄存器。运行时 off_reg 的值从 alu_limit 中减去并存储到 BPF_REG_AX 中。如果 off_reg &gt; alu_limit ，则设置 BPF_REG_AX 的最高位（符号位）。如果 BPF_REG_AUX 中存储的差值为正，off_reg 为负，表示 alu_limit 和寄存器的值具有相反的符号，则 BPF_OR 操作将设置符号位。\nBPF_NEG 操作将否定符号位。如果设置了符号位，则为 0，否则为 1。 BPF_ARSH 操作进行 63 位算术右移。这将用全 0 或 1（符号位的值）填充 BPF_REG_AX。根据上述操作的结果，BPF_AND 操作要么将 off_reg 置空，要么保持不变。这意味着如果 off_reg 超过 alu_limit ，或者如果 off_reg 和 alu_limit 具有相反的符号，则 off_reg 的值将被替换为 0，从而使指针算术运算归零。最近更新了 alu_limit 的计算方式 [15]。某些 Linux 发行版可能尚未采用新的实现。为完整起见，我将涵盖两者，并在下一节中重新讨论为什么差异很重要，因为它们变得相关。 alu_limit 由指针寄存器的边界决定。意思是，如果指针寄存器指向映射的开头，则减法的 alu_limit 为 0，加法的 alu_limit 等于映射的大小（减 1）。 alu_limit 随指针寄存器上的后续操作更新。 alu_limit 由偏移寄存器的边界决定。这意味着是否将运行时偏移寄存器的值与验证器静态范围跟踪期间计算的寄存器边界进行比较。\n我对 eBPF 验证器的初步了解来自 Manfred Paul 这篇出色的博客文章，详细介绍了他对 CVE-2020-8835 的利用。我强烈建议检查一下！回想一下，eBPF 指令集可以对整个 64 位寄存器或仅低 32 位进行操作。因此，验证器范围跟踪包含寄存器低 32 位的单独边界： {u,s}32_{min,max}_value 。每次操作都会更新这些边界。每个操作都有两个跟踪功能，一个 64 位和一个 32 位计数器部分。两者都在函数 adjust_scalar_min_max_vals 中调用 64 位操作。 * /* 警告：此函数对 64 位值进行计算，但 * 实际执行可能发生在 32 位值上。因此，*像位移这样的东西在 32 位情况下需要额外检查。*/ static int adjust_scalar_min_max_vals ( struct bpf_verifier_env *env, struct bpf_insn *insn, struct bpf_reg_state *dst_reg, struct bpf_reg_state src_reg ) { ... case BdPFst_AND - &gt;var_off = tnum_and (dst_reg - &gt;var_off , src_reg .var_off ) ; scalar32_min_max_and (dst_reg , &amp;src_reg ) ; scalar_min_max_and (dst_reg , &amp;src_reg ) ;休息 ;案例 BPF_OR : dst_reg - &gt;var_off = tnum_or (dst_reg - &gt;var_off , src_reg .var_off ) ; scalar32_min_max_or (dst_reg , &amp;src_reg ) ; scalar_min_max_or (dst_reg , &amp;src_reg ) ;休息 ;案例 BPF_XOR : dst_reg - &gt;var_off = tnum_xor (dst_reg - &gt;var_off , src_reg .var_off ) ; scalar32_min_max_xor (dst_reg , &amp;src_reg ) ; scalar_min_max_xor (dst_reg , &amp;src_reg ) ;休息 ; ... } 漏洞 CVE-2021-3490 位于 BPF_AND 、 BPF_OR 和 BPF_XOR 操作的 32 位跟踪函数中。每个功能都是一样的。让我们来看看 BPF_AND 的违规代码的摘录： static void scalar32_min_max_and ( struct bpf_reg_state *dst_reg, struct bpf_reg_state *src_reg ) { bool src_known = tnum_subreg_is_const (src_reg - &gt;var_off) bool dst_known = tnum_subreg_is_const (dst_reg - &gt;var_off); struct tnum var32_off = tnum_subreg (dst_reg - &gt;var_off) ; s32 smin_val = src_reg-&gt;s32_min_value; u32 umax_val = src_reg - &gt;u32_max_value ； /* 假设 scalar64_min_max_and 将被调用，所以它安全 * 跳过更新已知 32 位情况的寄存器。 */ 如果 (src_known &amp;&amp; dst_known ) 返回； ... }\n如上面的代码片段所示，如果源寄存器和目标寄存器的低 32 位已知，则该函数会跳过更新 32 位边界。返回上面的注释指出这是可以的，因为 64 位对应物会处理它。我们来看看： static void scalar_min_max_and ( struct bpf_reg_state *dst_reg, struct bpf_reg_state *src_reg ) { bool src_known = tnum_is_const (src_reg - &gt;var_off ) ; bool dst_known = tnum_is_const (dst_reg - &gt;var_off) ; s64 smin_val = src_reg-&gt;smin_value; u64 umin_val = src_reg - &gt;umin_value ； if (src_known &amp;&amp; dst_known ) { __mark_reg_known (dst_reg , dst_reg - &gt;var_off .value ) ;返回 ; } ... } 的确，我们可以看到如果src_known 和dst_known 为真，函数__mark_reg_known 会被调用。你能发现问题吗？在 scalar32_min_max_and 中， _known 变量是使用 tnum_subreg_is_const 计算的。 64 位对应 scalar_min_max_and 使用 tnum_is_const 。区别在于，如果寄存器的低 32 位是已知常量，则前者返回真，而后者仅在整个 64 位都是常量时才返回真。如果操作涉及低 32 位已知但高 32 位未知的寄存器，则违反注释中所述的假设。在函数 adjust_scalar_min_max_vals 中，在返回之前，通过调用以下三个函数最后一次更新目标寄存器的边界：这些函数中的每一个都有 32 位和 64 位对应项。我将只介绍 32 位情况，因为那是错误影响的内容。\nstatic void __update_reg32_bounds (struct bpf_reg_state *reg) { struct tnum var32_off = tnum_subreg (reg-&gt;var_off); /* 最小有符号是最大（符号位） | min(other bits) */ reg - &gt;s32_min_value = max_t (s32 , reg - &gt;s32_min_value , var32_off .value | (var32_off .mask &amp; S32_MIN ) ) ; /* 最大有符号是最小（符号位） | max(other bits) */ reg - &gt;s32_max_value = min_t (s32 , reg - &gt;s32_max_value , var32_off .value | (var32_off .mask &amp; S32_MAX ) ) ; reg - &gt;u32_min_value = max_t (u32 , reg - &gt;u32_min_value , (u32 )var32_off .value ) ; reg - &gt;u32_max_value = min (reg - &gt;u32_max_value , (u32 ) (var32_off .value | var32_off .mask ) ) ;请注意，最小值边界设置为当前最小值或寄存器的已知值，以较大者为准。类似地，最大边界设置为当前最大值或寄存器的已知值，以较小者为准。然后，在 __reg32_deduce_bounds 中使用有符号和无符号边界相互更新。 /* 使用有符号的最小值/最大值来通知无符号，反之亦然 */ static void __reg32_deduce_bounds ( struct bpf_reg_state *reg ) { /* 从有符号的边界中学习符号。 * 如果我们不能跨越符号边界，那么有符号边界和 * 无符号边界 * 是一样的，所以结合起来。这甚至在 * 否定情况下也有效，例如 * -3 s&lt;= x s&lt;= -1 意味着 0xf...fd u&lt;= x u&lt;= 0xf...ff。 */ if (reg - &gt;s32_min_value &gt;= 0 || reg - &gt;s32_max_value &lt; 0 ) { reg - &gt;s32_min_value = reg - &gt;u32_min_value = max_t (u32 , reg - &gt;s32_min_value , reg - &gt;u32_min_value ) ; reg - &gt;s32_max_value = reg - &gt;u32_max_value = min_t (u32 , reg - &gt;s32_max_value , reg - &gt;u32_max_value ) ;返回 ; } ... } static void __reg_bound_offset (struct bpf_reg_state *reg) { struct tnum var64_off = tnum_intersect (reg - &gt;var_off , tnum_range (reg - &gt;umin_value , reg - &gt;umax_value ) ) ; struct tnum var32_off = tnum_intersect (tnum_subreg (reg -&gt;var_off), tnum_range (reg -&gt;u32_min_value, reg -&gt;u32_max_value)); reg - &gt;var_off = tnum_or (tnum_clear_subreg (var64_off), var32_off); tnum_intersect 接受两个 tnum 并将两者传达的知识组合成一个 tnum 。让我们通过一个例子来完成这些步骤，这样我们就能理解为什么这是一个严重的漏洞。\n假设我们有指令 BPF_ALU64_REG(BPF_AND, R2, R3)。该指令对寄存器 R2 和 R3 执行 AND 运算并将结果保存在 R2 中。 R2 有 var_off = {mask = 0xFFFFFFFF00000000; value = 0x1}，表示已知低 32 位值为 1，高 32 位未知。因为寄存器的低 32 位是已知的，所以它的 32 位边界等于该值。 R3 有 var_off = {mask = 0x0; value = 0x100000002}，意味着整个 64 位是已知的并且等于 0x100000002。如 adjust_scalar_min_max_vals 片段的第 12 行所示，函数 tnum_and 被调用。这将执行 AND 运算并将结果保存在目标寄存器 R2 的 var_off 中。回想一下，两个寄存器中的低 32 位都是已知的。 R3 的所有位都是已知的：高 31 位是 0，第 32 位是 1。这意味着 R2 剩下 var_off = {mask = 0x100000000;值 = 0x0}。这是因为 2 &amp; 1 = 0（对于低 32 位），并且除了第 32 位之外的所有位都将被称为 0，因为 R3 在第 32 位中有一个 1。在下一行，调用 scalar32_min_max_and。我们已经知道这个函数会立即返回并且不会改变边界，因为两个寄存器的低 32 位都是已知的。然后 __update_reg32_bounds 被调用。这将设置 u32_max_value = 0 ，因为 var_off.value = 0 &lt; u32_max_value = 1 的值。同样，它会设置 u32_min_value = 1 因为 var_off.value = 0 &lt; u32_min_value 。签名边界也是如此。现在我们可以看到，在这种情况下，我们留下了一个寄存器，其中 {u,s}32_max_value = 0 &lt; {u,s}32_min_value = 1 ！\n@@ - 7084 , 11 + 7084 , 10 @@ static void scalar32_min_max_and (struct bpf_reg_state *dst_reg , s32 smin_val = src_reg - &gt; s32_min_value ; u32 umax_val = 3 src_max - u32 umax_val = 3 src_max - u32 umax_val = 3 src_max - u /* 3 src_max - u /* 3 2_reg_和 * 4 _ 和 * 4 将安全称为安全跳过更新已知 32 位情况的寄存器。- */ - if (src_known &amp;&amp; dst_known ) + if (src_known &amp;&amp; dst_known ) { + __mark_reg32_known (dst_reg , var32_off .value ) ; return ; + } 上面我们现在可以看到，如果源和目标寄存器的低 32 位是已知常量，则在返回之前在目标寄存器上调用 __mark_reg32_known。 /* 将寄存器的未知部分（变量偏移量或标量 * 值）标记为已知值 @imm。 */ static void __mark_reg32_known ( struct bpf_reg_state *reg, u64 imm ) { reg - &gt;var_off = tnum_const_subreg (reg - &gt;var_off , imm ) ; reg - &gt;s32_min_value = (s32 )imm ; reg - &gt; value.imm ; reg - &gt;s32_s3_s3_s32 .....", "note_en": "At  Grapl we believe that in order to build the best defensive system we need to deeply understand attacker behaviors. As part of that goal we&#39;re investing in offensive security research.  Keep up with our blog for new research on high risk vulnerabilities, exploitation, and advanced threat tactics.\n    Find the released local privilege escalation (LPE) Proof-of-Concept for  CVE-2021-3490 here:  https://github.com/chompie1337/Linux_LPE_eBPF_CVE-2021-3490. It targets Ubuntu 20.10 (Groovy Gorilla) kernels 5.8.0-25.26 through 5.8.0-52.58. and Ubuntu 21.04 (Hirsute Hippo) 5.11.0-16.17.\n    This blog post is intended to give a detailed overview of eBPF from the perspective of an exploit developer. In this post, I cover:\n     I had no knowledge of eBPF going into this. My hope is that by sharing a PoC as well as my experience developing it, it can help others get started with eBPF exploitation.\n                  Berkeley Packet Filter (BPF) was initially created as a way to perform packet filtering in the kernel. Its capabilities were later redesigned and extended to create extended Berkeley Packet Filter (eBPF)  [1].\n    Put simply, eBPF provides a way for a user mode application to run code in the kernel without needing to write a kernel module.The purported benefits of using eBPF versus a kernel module are ease of use, stability, and security. There are also performance improvements gained by doing certain tasks directly in the kernel compared to a pure user mode program. eBPF programs are used to do a myriad of things such as: tracing, instrumentation, hooking system calls, debugging, and of course, packet capturing/filtering.\n    eBPF programs are written in a high level language and compiled into eBPF bytecode using a toolchain (such as  BCC   [18]). The eBPF VM uses a simple instruction set that uses eleven* 64-bit registers, a program counter, and a 512 byte fixed-size stack. Nine registers are general purpose read-write, one is a read-only stack pointer and the program counter is implicit  [2] . The instruction set is similar to x86, and operates on both 64 and 32 bit values.\n          *Technically, it uses   12 registers,  but the 12th register is an auxiliary register only used to perform ALU sanitation operations   [12].\n  A user mode application loads the bytecode into the kernel using the   bpf()    [14] syscall, where the eBPF verifier will perform a number of checks to ensure the program is “safe” to run in the kernel. This verification step is critical - eBPF exposes a path for unprivileged users to execute in ring0.\n    After the program is loaded, the user mode application attaches the program to a “hook point”. A hook point is a place in the kernel where eBPF programs can be attached  [5]. eBPF programs are event driven, meaning the program will execute when certain events occur at the hook point. The classic use case is attaching an eBPF program to a socket, where the program will execute when data is written to it.\n    If the   kconfig knob   CONFIG_BPF_JIT is set, the eBPF program is JIT compiled into native assembly instructions after it is verified and loaded. Otherwise, when the program is executed it is run in the eBPF interpreter which decodes and executes the eBPF bytecode instructions.\n  User mode applications can interact with and get data from the eBPF program running in the kernel using eBPF maps and eBPF helper functions, which are accessed via the    bpf()  syscall.\n      The     sysctl   knob    kernel.unprivileged_bpf_disabled  determines whether unprivileged users are allowed to run eBPF programs. If it is not set, unprivileged users are allowed to attach an eBPF program to a socket that the user owns. In many Linux distributions, such as Ubuntu,    unprivileged_bpf_disabled  is not enabled by default. Because of this, I decided to look into eBPF more closely, as allowing unprivileged users to run code in the kernel is a ripe attack surface.\n    I mentioned above that user mode processes can interact with a eBPF program in the kernel using eBPF maps. They can also be used by multiple eBPF programs to interact with each other. They are a generic key/value store with an arbitrary data structure  [6]. There are various types of maps including: arrays, queues, and stacks.\n      key_size  - the size in bytes of the key used to index an element (used in array maps)\n   map_flags  - describes special characteristics of the map, such as if the entire map memory should be preallocated or not.\n eBPF maps can be created and altered from user space via the    bpf()  syscall using the    BPF_MAP_CREATE  command, updated using the    BPF_MAP_UPDATE_ELEM  command, and retrieve its contents using the    BPF_MAP_LOOKUP_ELEM  command. eBPF maps can accessed by eBPF programs using the file descriptor returned by    BPF_MAP_CREATE  and calling eBPF helper functions, which will return pointers to values within the map.\n      The exploit I wrote leverages a bug in the eBPF verifier. So before I delve into the vulnerability it is important to briefly explain the internals of the verifier.\n    The verifier starts by building a control flow graph of the program. Then, it will verify each instruction is valid and all memory accesses are safe through each possible flow of control  [3]. Afterwards, it will add in runtime checks to the program. This process, called  ALU Sanitation, inserts patches to the eBPF bytecode to ensure permitted memory ranges are not violated during runtime when performing pointer arithmetic  [4].\n      No pointer comparisons can be performed, and only scalar values can be added or subtracted to a pointer. A scalar value in the eBPF verifier is any value that is not derived from a pointer. The verifier keeps track of which registers contain pointers and which contain scalar values.\n Pointer arithmetic can not leave the “safe” bounds of a map. Meaning, the program can not access anything outside the predefined map memory. To do so, verifier keeps track of the upper and lower bounds of the values for each register.\n No pointers can be stored in maps or stored as a return value, in order to avoid leaking kernel addresses to user space.\n     The verifier stores the following bound values, for every register in each possible path of execution, to ensure there are no out-of-bound memory accesses:\n  umin_value ,    umax_value  store the min/max value of the register when interpreted as an unsigned (64 bit) integer\n smin_value ,   smax_value  store the min/max value of the register when interpreted as a signed (64 bit) integer.\n u32_min_value ,   u32min_value  store the min/max value of the register when interpreted as an unsigned (32 bit) integer.\n s32_min_value ,   s32_max_value  store the min/max value of the register when interpreted as a signed (32 bit) integer.\n var_off  contains information about the bits of the the register that are known. It is stored in a structure called    tnum  which contains two 64 bit fields:    mask  and    value . Every bit that is set in    mask  means the value of that bit is  unknown. The unset bits are known, and their true value are stored in    value . For example, if    var_off = {mask = 0x0; value = 0x1} , all bits of the register are known, and the register is known to have a value of 1. If    var_off = {mask = 0xFFFFFFFF00000000; value = 0x3}  it means that the lower 32 bits of the register are known to be 0x00000003 and the upper 32 bits are unknown.\n These bounds are used to update each other. In particular, if    var_off  indicates the register is a known constant, the min/max bounds are updated to reflect the known value. We will see why this is important later!\n      ALU Sanitation is a feature that was introduced to supplement the static range tracking of the verifier. The idea is to prevent OOB memory accesses if the value of registers do not fall within their expected range during runtime. This was added to help mitigate potential vulnerabilities in the verifier and protect against speculative attacks.\n  For every arithmetic operation that involves a pointer and a scalar register, an    alu_limit  is calculated. This represents the maximum absolute value that can be added to or subtracted from the pointer  [4]. Before each of these operations, the bytecode is patched with the following instructions:\n  *patch ++  =  BPF_MOV32_IMM ( BPF_REG_AX , aux - &gt;alu_limit ) ; *patch ++  =  BPF_ALU64_REG ( BPF_SUB ,  BPF_REG_AX , off_reg ) ; *patch ++  =  BPF_ALU64_REG ( BPF_OR ,  BPF_REG_AX , off_reg ) ; *patch ++  =  BPF_ALU64_IMM ( BPF_NEG ,  BPF_REG_AX ,  0 ) ; *patch ++  =  BPF_ALU64_IMM ( BPF_ARSH ,  BPF_REG_AX ,  63 ) ; *patch ++  =  BPF_ALU64_REG ( BPF_AND ,  BPF_REG_AX , off_reg ) ;\n    Note that    off_reg  represents the scalar register being added to the pointer register, and    BPF_REG_AUX  represents the auxiliary register.\n      The value of    off_reg  at runtime is subtracted from    alu_limit  and stored into    BPF_REG_AX . If    off_reg &gt; alu_limit , the highest bit of    BPF_REG_AX  is set (the sign bit).\n If the difference stored in    BPF_REG_AUX  is positive and off_reg is negative, indicating that    alu_limit  and the register’s value have opposing signs, the    BPF_OR  operation will set the sign bit.\n The    BPF_NEG  operation will negate the sign bit. If the sign bit is set, it will become 0, and if not, it will become 1.\n The    BPF_ARSH  operation does an arithmetic right shift of 63 bits. This fills    BPF_REG_AX  with either all 0s or 1s, the value of the sign bit.\n Depending on the result of the above operation, the    BPF_AND  operation will either null out    off_reg  or leave it unchanged.\n This means that if    off_reg  exceeds    alu_limit , or if    off_reg  and    alu_limit  have opposing signs, the value of    off_reg  will be replaced with 0, nulling the pointer arithmetic operation.\n        The way    alu_limit  is calculated was  recently updated  [15]. The new implementation may not have been adopted yet by some Linux distributions. For completeness, I will cover both, and revisit why the differences matter as they become relevant in the next sections.\n      The    alu_limit  is determined by the boundaries of the  pointer register. Meaning, if the pointer register points to the beginning of a map, the    alu_limit  for subtraction is 0, and the alu_limit for addition is equal to the size of the map (minus 1). The    alu_limit  is updated with subsequent operations on the pointer register.\n      The    alu_limit  is determined by the boundaries of the  offset register. Meaning if the value of the offset register at runtime is compared against the register’s boundaries computed during the verifier’s static range tracking.\n    My initial knowledge of the eBPF verifier came from this excellent   blog post  by Manfred Paul detailing his exploitation of CVE-2020-8835. I highly recommend checking it out!\n      Recall that the eBPF instruction set can operate on both the entire 64 bits of registers or just the lower 32 bits. For this reason, the verifier range tracking contains separate bounds for the lower 32 bits of a register:    {u,s}32_{min,max}_value .\n  These bounds are updated for every operation. Each operation has two tracking functions with a 64 bit and a 32 bit counter part. Both are called for a 64 bit operation in the function   adjust_scalar_min_max_vals  .\n  * /* WARNING: This function does calculations on 64-bit values, but * the actual execution may occur on 32-bit values. Therefore, * things like bitshifts need extra checks in the 32-bit case.*/ static int  adjust_scalar_min_max_vals ( struct bpf_verifier_env *env, struct bpf_insn *insn, struct bpf_reg_state *dst_reg, struct bpf_reg_state src_reg ) { ...  case  BPF_AND : dst_reg - &gt;var_off  =  tnum_and (dst_reg - &gt;var_off , src_reg .var_off ) ;  scalar32_min_max_and (dst_reg ,  &amp;src_reg ) ;  scalar_min_max_and (dst_reg ,  &amp;src_reg ) ;  break ;  case  BPF_OR : dst_reg - &gt;var_off  =  tnum_or (dst_reg - &gt;var_off , src_reg .var_off ) ;  scalar32_min_max_or (dst_reg ,  &amp;src_reg ) ;  scalar_min_max_or (dst_reg ,  &amp;src_reg ) ;  break ;  case  BPF_XOR : dst_reg - &gt;var_off  =  tnum_xor (dst_reg - &gt;var_off , src_reg .var_off ) ;  scalar32_min_max_xor (dst_reg ,  &amp;src_reg ) ;  scalar_min_max_xor (dst_reg ,  &amp;src_reg ) ;  break ;  ... }\n    The bug,  CVE-2021-3490, is found in the 32 bit tracking function for    BPF_AND ,    BPF_OR , and    BPF_XOR  operations. It is the same in each of the functions.\n    Let’s take a look at an excerpt of the  offending code for    BPF_AND :\n  static  void  scalar32_min_max_and ( struct bpf_reg_state *dst_reg, struct bpf_reg_state *src_reg ) { bool src_known  =  tnum_subreg_is_const (src_reg - &gt;var_off ) ; bool dst_known  =  tnum_subreg_is_const (dst_reg - &gt;var_off ) ; struct tnum var32_off  =  tnum_subreg (dst_reg - &gt;var_off ) ; s32 smin_val  = src_reg - &gt;s32_min_value ; u32 umax_val  = src_reg - &gt;u32_max_value ;  /* Assuming scalar64_min_max_and will be called so its safe * to skip updating register for known 32-bit case. */  if  (src_known  &amp;&amp; dst_known )  return ; ... }\n    As shown in the code snippet above, if the lower 32 bits of both the source and destination register are known, the function skips updating the 32 bit bounds.\n    The comment above the return states that this is OK, because the  64 bit  counterpart will take care of it. Let’s take a look:\n  static  void  scalar_min_max_and ( struct bpf_reg_state *dst_reg, struct bpf_reg_state *src_reg ) { bool src_known  =  tnum_is_const (src_reg - &gt;var_off ) ; bool dst_known  =  tnum_is_const (dst_reg - &gt;var_off ) ; s64 smin_val  = src_reg - &gt;smin_value ; u64 umin_val  = src_reg - &gt;umin_value ;  if  (src_known  &amp;&amp; dst_known )  {  __mark_reg_known (dst_reg , dst_reg - &gt;var_off .value ) ;  return ;  }  ... }\n  Indeed, we can see if    src_known  and    dst_known  are true, the function    __mark_reg_known  will be called. Can you spot the problem?\n    In    scalar32_min_max_and , the    _known  variable is calculated using    tnum_subreg_is_const  . The 64 bit counterpart,    scalar_min_max_and , uses    tnum_is_const . The difference is that the former returns true if the the lower 32 bits of the register are known constants, and the latter returns true only if the entire 64 bits are constant. If the operation involves registers where the lower 32 bits are known but the upper 32 bits are unknown, the assumption stated in the comment is violated.\n    In the function    adjust_scalar_min_max_vals , before returning, the bounds of the destination register are updated a last time by calling the  following three functions:\n    Each of these functions have 32 and 64 bit counterparts. I’ll just cover the 32 bit case, since that is what the bug affects.\n      static  void  __update_reg32_bounds ( struct bpf_reg_state *reg ) { struct tnum var32_off  =  tnum_subreg (reg - &gt;var_off ) ;  /* min signed is max(sign bit) | min(other bits) */ reg - &gt;s32_min_value  =  max_t (s32 , reg - &gt;s32_min_value , var32_off .value  |  (var32_off .mask  &amp;  S32_MIN ) ) ;  /* max signed is min(sign bit) | max(other bits) */ reg - &gt;s32_max_value  =  min_t (s32 , reg - &gt;s32_max_value , var32_off .value  |  (var32_off .mask  &amp;  S32_MAX ) ) ; reg - &gt;u32_min_value  =  max_t (u32 , reg - &gt;u32_min_value ,  (u32 )var32_off .value ) ; reg - &gt;u32_max_value  =  min (reg - &gt;u32_max_value ,  (u32 ) (var32_off .value  | var32_off .mask ) ) ; }\n    Notice that the min bounds set to either the current min or the known value of register, whichever is larger. Similarly, the max bounds are set either the current max, or the known value of the register, whichever is smaller.\n  Then, the signed and unsigned bounds are used to update each other in   __reg32_deduce_bounds  .\n  /* Uses signed min/max values to inform unsigned, and vice-versa */ static  void  __reg32_deduce_bounds ( struct bpf_reg_state *reg ) {  /* Learn sign from signed bounds. * If we cannot cross the sign boundary, then signed and * unsigned bounds * are the same, so combine. This works even in the * negative case, e.g. * -3 s&lt;= x s&lt;= -1 implies 0xf...fd u&lt;= x u&lt;= 0xf...ff. */  if  (reg - &gt;s32_min_value  &gt;=  0  || reg - &gt;s32_max_value  &lt;  0 )  { reg - &gt;s32_min_value  = reg - &gt;u32_min_value  =  max_t (u32 , reg - &gt;s32_min_value , reg - &gt;u32_min_value ) ; reg - &gt;s32_max_value  = reg - &gt;u32_max_value  =  min_t (u32 , reg - &gt;s32_max_value , reg - &gt;u32_max_value ) ;  return ;  } ... }\n      static  void  __reg_bound_offset ( struct bpf_reg_state *reg ) { struct tnum var64_off  =  tnum_intersect (reg - &gt;var_off ,  tnum_range (reg - &gt;umin_value , reg - &gt;umax_value ) ) ; struct tnum var32_off  =  tnum_intersect ( tnum_subreg (reg - &gt;var_off ) , tnum_range (reg - &gt;u32_min_value , reg - &gt;u32_max_value ) ) ; reg - &gt;var_off  =  tnum_or ( tnum_clear_subreg (var64_off ) , var32_off ) ; }\n    tnum_intersect  takes two    tnum s and combines the knowledge conveyed by both into a single    tnum .\n Let’s go through the steps using an example so we can understand why this is a critical vulnerability.\n  Suppose we have the instruction   BPF_ALU64_REG(BPF_AND, R2, R3). This instruction performs an   AND operation on registers   R2 and   R3 and saves the results in   R2.\n  R2 has   var_off = {mask = 0xFFFFFFFF00000000; value = 0x1}, meaning the lower 32 bits are known to have a value of 1, and the upper 32 bits are unknown. Because the lower 32 bits of the register are known, its 32bit bounds are equal to the value.\n R3 has   var_off = {mask = 0x0; value = 0x100000002}, meaning the entire 64 bits are known and equal to   0x100000002.\n   As shown on line 12 of the snippet of   adjust_scalar_min_max_vals, the function   tnum_and is called. This will perform an AND operation and save the results in var_off of the destination register,   R2. Recall, the lower 32 bits in both of the registers are known. All of the bits of R3 are known: the upper 31 bits of are 0, and the 32nd bit is 1. This means that    R2  is left with    var_off = {mask = 0x100000000; value = 0x0} . This is because 2 &amp; 1 = 0 (for the lower 32 bits), and all but the 32nd bit will be known to be 0, since    R3  has a 1 in the 32nd bit.\n On the next line,    scalar32_min_max_and  is called. We already know that this function will return immediately and make no changes to the bounds, because the lower 32 bits of both registers are known.\n Then    __update_reg32_bounds  is called. This will set    u32_max_value = 0 , because the value of    var_off.value = 0 &lt; u32_max_value = 1 . Similarly, it will set    u32_min_value = 1  because    var_off.value = 0 &lt; u32_min_value . The same goes for the signed bounds.\n Now we can see that in this case, we are left with a register where    {u,s}32_max_value = 0 &lt; {u,s}32_min_value = 1 !\n      @@  - 7084 , 11  + 7084 , 10 @@  static  void  scalar32_min_max_and (struct bpf_reg_state  *dst_reg , s32 smin_val  = src_reg - &gt;s32_min_value ; u32 umax_val  = src_reg - &gt;u32_max_value ;  -  /* Assuming scalar64_min_max_and will be called so its safe- * to skip updating register for known 32-bit case.- */ -  if  (src_known  &amp;&amp; dst_known ) +  if  (src_known  &amp;&amp; dst_known )  { +  __mark_reg32_known (dst_reg , var32_off .value ) ;  return ; +  }\n    Above we can see that now,   __mark_reg32_known  is called on the destination register before returning if the lower 32 bits of the source and destination register are known constants.\n    /* Mark the unknown part of a register (variable offset or scalar * value) as known to have the value @imm.*/ static  void  __mark_reg32_known ( struct bpf_reg_state *reg, u64 imm ) { reg - &gt;var_off  =  tnum_const_subreg (reg - &gt;var_off , imm ) ; reg - &gt;s32_min_value  =  (s32 )imm ; reg - &gt;s32_max_value  =  (s32 )imm\n......", "posttime": "2021-08-09 00:55:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "破解,ebpf,pwning,bpf", "title": "使用 eBPF 进行内核破解：一个爱情故事", "title_en": "Kernel Pwning with eBPF: A Love Story", "transed": 1, "url": "https://www.graplsecurity.com/post/kernel-pwning-with-ebpf-a-love-story", "via": "", "real_tags": ["破解", "ebpf", "pwning", "bpf"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072141, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Wildfire Games 自豪地宣布发布 0AD Alpha 25：“Yaunã”，这是 0 AD 的第 25 个 Alpha 版本，这是一款免费、开源的古代战争实时战略游戏。 Yaunã 是古波斯语中爱奥尼亚人（希腊人）的词。订单重组——玩家现在可以将新订单推到生产队列的前面 0 AD 是免费软件。这意味着您可以在相同的许可下免费下载、重新分发、修改和贡献应用程序：用于代码的 GNU 公共许可版本 2 (GPL v2) 和用于艺术作品的知识共享署名相同方式共享 3.0 (CC-BY-SA 3.0) .尽管您可能会发现有些人通过互联网或物理媒体出售 0 AD 的副本，但您始终可以选择直接从开发人员处完全免费下载 0 AD。没有“免费增值”模式，没有游戏内广告，没有捕获。", "note_en": "Wildfire Games proudly announces the release of 0AD Alpha 25: “Yaunã,” the twenty-fifth alpha version of 0 A.D., a free, open-source real-time strategy game of ancient warfare. Yaunã is an old Persian word for Ionians (Greeks).\n     Order Restructuring – Players Can Now Push New Orders To The Front Of Their Production Queues\n   0 A.D. is free software. This means you are free to download, redistribute, modify and   contribute  to the application under the same licences: GNU Public Licence version 2 (GPL v2) for code and Creative Commons Attribution Share-Alike 3.0 (CC-BY-SA 3.0) for artwork.\n Although you might find some people selling copies of 0 A.D., either over the internet or on physical media, you will always have the option to   download 0 A.D.  completely gratis, directly from the developers. No “freemium” model, no in-game advertising, no catch.", "posttime": "2021-08-09 00:54:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ad,alpha", "title": "0 AD 阿尔法 25：Yaunā", "title_en": "0 A.D. Alpha 25: Yaunā", "transed": 1, "url": "https://play0ad.com/new-release-0-a-d-alpha-25-yauna/", "via": "", "real_tags": ["ad", "alpha"]}, {"category": "", "categoryclass": "", "imagename": "f1ac3d2c9a9eb77da56b61f928e0d7a6.png", "infoid": 1072140, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，支付服务公司 Xsolla 解雇了 150 名员工，根据对其活动的大数据分析（通过 Game World Observer），该公司位于俄罗斯彼尔姆的办公室的员工被解雇。更糟糕的是，Xsolla 的首席执行官兼创始人 Aleksandr Agapitov 向受影响的员工发送了一封电子邮件，解释了这一决定，并透露他们已被解雇，因为他们被标记为“不敬业且效率低下的员工”。 “您收到这封电子邮件是因为我的大数据团队分析了您在 Jira、Confluence、Gmail、聊天、文档、仪表板中的活动，并将您标记为不敬业且效率低下的员工。换句话说，当您远程工作时，您并不总是在工作场所。 “你们中的许多人可能会感到震惊，但我真的相信 Xsolla 不适合你们。 Nadia 和她的护理团队与七家领先的人力资源机构合作，因为我们将帮助您找到一个好地方，在那里您赚得更多，工作更少。 Sasha 将帮助您获得推荐，包括我自己的推荐。 Natalia 会为您解读您的权利。 “再次感谢您的贡献。如果你想和我保持联系，请给我写一封长信，把你所有的观察、不公和感激。”这立即引发了可预见的反弹：无论是裁员本身还是电子邮件的语气。据 ProPerm.ru 称，该公司正在调查寻找泄露电子邮件的员工。裁员后，阿加皮托夫召开了一次新闻发布会，他解释说，大规模裁员是由于公司已停止显示 40% 的增长。阿加皮托夫提供了更多细节，包括下岗员工总数可能占公司所有办公室员工总数的 40%。\n在新闻发布会之后，阿加皮托夫通过一条推文引发了进一步的争议，推文大致翻译为“让你他妈的屁股滚开，或者让你他妈的屁股滚出去。”阿加皮托夫在接受《福布斯俄罗斯》采访时透露，在与经理讨论后，60 名受影响的员工可能会留在公司，而被解雇的员工将保留医疗保险，并获得相当于四到六个月工资的医疗工资。", "note_en": "Payment services company Xsolla has reportedly fired 150 of its employees, with workers in the company’s office in Perm, Russia being terminated based on big data analysis of their activity (via  Game World Observer).\n Making the situation worse, Xsolla CEO and founder Aleksandr Agapitov sent an email to the affected employees explaining the decision, revealing that they had been let go because they had been tagged as “unengaged and unproductive employees.”\n   “You received this email because my big data team analyzed your activities in Jira, Confluence, Gmail, chats, documents, dashboards and tagged you as unengaged and unproductive employees. In other words, you were not always present at the workplace when you worked remotely.\n “Many of you might be shocked, but I truly believe that Xsolla is not for you. Nadia and her care team partnered with seven leading HR agencies, as we will help you find a good place, where you will earn more and work even less. Sasha will help you get a recommendation, including the one from myself. And Natalia will read you your rights.\n “Once again, thank you for your contribution. If you want to stay in contact with me, please write me a long letter about all your observations, injustice, and gratitude.”\n This prompted immediate and predictable backlash: both for the layoffs themselves and for the tone of the email. According to  ProPerm.ru, the company is investigating to find the employee who leaked the email.\n Following the layoffs, Agapitov held a press conference in which he explained that the mass layoffs were caused by the fact that the company has stopped showing 40% growth. Agapitov provided further details, including that the total number of laid-off employees could total 40% of the company’s headcount across all of its offices.\n Following the press conference, Agapitov incited further controversy with a  Tweet that roughly translates to “Work your fucking ass off or get your fucking ass out.”\n Speaking with  Forbes Russia, Agapitov revealed that 60 of the affected employees might stay with the company following discussions with their managers, while those who have been let go will keep their medical insurance and receive medical pay equal to four to six monthly salaries.", "posttime": "2021-08-09 00:54:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大数据,数据分析,based,员工", "title": "艾克索拉基于对其活动的大数据分析解雇了 150 名员工", "title_en": "Xsolla fires 150 employees based on big data analysis of their activity", "transed": 1, "url": "https://www.mcvuk.com/business-news/xsolla-fires-150-employees-based-on-big-data-analysis-of-their-activity-many-of-you-might-be-shocked-but-i-truly-believe-that-xsolla-is-not-for-you/", "via": "", "real_tags": ["大数据", "数据分析", "based", "员工"]}, {"category": "", "categoryclass": "", "imagename": "6d4fe6117029a98c7aa66fe2542b07c2.png", "infoid": 1072138, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "夏季的三伏天已经到来，本周市场（股票、债务、商品市场）几乎没有变动，英国《金融时报》的撰稿人思考如何在股票和商品市场无精打采的情况下度过他们的一天。随意的想法抓住了无聊的时刻。甚至《金融时报》也暂时缩水了：本周每天 6 页，从经典的 12 页减少了。夏天到了。关于德国赔偿的争论仍在继续。在过去的一年里，英国和法国已经清楚，德国无法全额支付。 1921 年 8 月 10 日就三个核心问题展开谈判，而不是违约：德国向目前占领德国地区的英国和法国士兵付款、实物（钢、煤、木材）转移代替德国金马克，以及承担战争债务欧洲较小的国家。历史事实：德国在第一​​次世界大战后使用两种平行货币：金马克和纸币。凡尔赛条约规定以金马克支付，这造成了严重的财政压力。 1920 年代的德国当然被称为魏玛共和国，并将在 9 月开始经历严重的通货膨胀，这种通货膨胀会持续两年直到金融崩溃。纽约的交易员想知道什么可能会改变市场。 《华尔街日报》的编辑们推测，高税收和公共支出正在损害公众对拥有股票的看法。不时有足够勇敢的人对不受欢迎的普通股发表意见。标准石油公司在 1911 年被拆分为近三打公司，本文列出了所有前成分的价格。尽管过去一年艰难，但 1921 年已经显示出石油触底的迹象。作者建议精明的投资者购买所有这些股票。每家公司的交易价格都低于账面价值！市盈率介于 3 到 5 之间。提醒一下，无风险债券的收益率为 5%，积极鼓励散户投资者不要持有股票。历史事实：报纸上对普通股的冷漠会让现代投资者垂涎三尺。如果从 1921 年到现在，买入并持有道琼斯指数，总回报将是 500,000%（5,000 倍）！根据埃克森美孚的前身新泽西标准石油公司（拆分调整后的 0.04 美元），购买和持有 100 年将相当于 800,000% 的回报（8,000 倍）！致我们的读者：如果什么都不做，那么在当时投资于大盘的 100 美元今天将价值 500,000 美元！在今天的模因股票世界中，这如何成为头条新闻？\n阅读本时事通讯是免费的。如果您喜欢它，请分享给朋友或通过 PayPal 捐赠（下面的按钮）。", "note_en": "Dog days of summer have arrived, bringing little to no movements in markets this week (equity, debt, commodity markets)\n  Writers at the FT ponder how to spend their day while equity and commodity markets vacillate listlessly. Random ideas captures the very moment of boredom. Even the Financial Times has temporarily shrunk: 6 pages per day this week down from the classic 12 pages. Summer has arrived.\n Wrangling over German reparations continues. Over the past year, it has become clear to Britain and France that Germany cannot pay in full. Instead of default, talks open on August 10, 1921 regarding three core issues: German payments to British and French soldiers currently occupying German regions, in kind (steel, coal, timber) transfers in lieu of German gold marks, and assumption of war debt of smaller European countries.\n Historical Fact: Germany operates two parallel currencies after WWI: the gold mark and paper mark. The Treaty of Versailles stipulates payment in gold marks, which is causing severe fiscal strain. The Germany of the 1920s is, of course, known as the Weimar Republic and will begin experiencing severe inflation in September that drags on for two years until financial implosion.\n Traders in New York wonder what might turn the market. The editors of the WSJ surmise that high taxation and public spending are harming public perception of owning equities.\n  Every now and then, someone brave enough offers their opinion on unpopular common stocks. Standard Oil was split into nearly three dozen companies in 1911, and this article lists the prices of all former constituents. Despite having a rough past year, 1921 has shown signs of an oil bottom. The writer recommends astute investors purchase shares in all of them. Every single company trades below book value! PE ratios range from 3 to 5. As a reminder, risk free bonds are yielding 5%, and retail investors are being actively encouraged not to own equities.\n  Historical Fact: The apathy in the papers regarding common stocks would make the modern day investor salivate. If one bought and held the Dow from 1921 to present, the total return would be 500,000% (5,000x)! Based on ExxonMobil’s predecessor company Standard Oil of New Jersey ($0.04 split adjusted), buying and holding for 100 years would equate to an 800,000% return (8,000x)! To our readers: $100 invested in the broad market back then would be worth $500,000 today by doing  absolutely nothing! How’s that for a headline in today’s meme stock world?\n  Reading this newsletter is free. If you enjoy it, then please share to a friend or donate via PayPal (button below).", "posttime": "2021-08-09 00:53:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "华尔街,金融时报,ft,德国", "title": "我每周阅读 100 年前到 1929 年的英国《金融时报》和《华尔街日报》", "title_en": "I'm reading the FT and WSJ from 100 years ago each week leading to 1929", "transed": 1, "url": "https://roaring20s.substack.com/p/august-8-1921", "via": "", "real_tags": ["华尔街", "金融时报", "ft", "德国"]}]