[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify解释说，衡量和归因仍然是播客广告商面临的两个最大、尚未解决的挑战，这也是它希望通过收购Podsights来解决的问题。最初，Podsights的技术将用于帮助Spotify的广告商更准确地衡量其播客广告带来的影响和行动。然而，随着时间的推移，Spotify的目标是将衡量工具扩展到其他广告格式，包括音乐中的音频广告、视频广告和显示广告。\nPodsights有40名全职员工，所有员工都将加入Spotify，成为一个完整的部门。Spotify表示，目前没有调整该团队的计划。\n与此同时，Chartable将是Spotify Megaphone的另一个新功能。Spotify最近与一家名为Whooshkaa的公司达成了一项协议，允许广播公司将其节目转换为播客。Chartable将把它的受众洞察、宣传工具、SmartLink和SmartPromoto与扩音器结合起来，这样播客就可以了解更多关于听众群的信息，并发展业务。\n在Chartable完全集成到Megaphone之后，Spotify将不再支持独立的Chartable平台。然而，在那之前，新的和现有的出版商和广告商客户都可以使用它。\n该团队规模较小，只有11名员工，但Spotify也不打算在这里立即做出任何改变。\n可能有人担心，这些以前独立的公司现在将在Spotify内部运作。但Spotify指出，在可预见的未来，Podsights团队将独立于Spotify内部的其他服务职能部门运营，以维护其客户的信任，其中包括podcast品牌和机构。\nSpotify 2019冠状病毒疾病的独家新闻已经被列入了Joe Rogan的播客中，而评论家们说这有助于传播CVID-19的误传。这种强烈反对导致包括尼尔·杨在内的几位艺术家从Spotify的目录中撤下他们的音乐以示抗议。但到目前为止，这些批评并没有影响Spotify投资播客和播客技术的更广泛计划，因为它认为，从长远来看，这种媒体有潜力为其业务带来收入。\n“我们相信，我们仍处于数字音频的早期阶段，在这一领域做广告的机会仍然巨大，”首席内容与娱乐部的道恩·奥斯特罗夫说；Spotify的广告业务官员在一份声明中说。“我们收购了播客技术播放器Podsights和Chartable，这是我们将数字音频提升到一个新水平的重要步骤，突显了它分别为广告商和出版商带来的强大影响。”\n尽管Spotify不会立即披露收购的小型科技公司的收购价格，但它通常会在随后提交给SEC的文件中披露。例如，Spotify披露，它在2021年6月收购了播客发现公司Podz公司，为贝蒂实验室支付了5700万欧元，该公司的技术成为Spotify的直播音频平台，GealHooal.Megaphone是其规模更大的播客技术交易之一，价格为1.95亿欧元。", "note_en": "Measurement and attribution are still two of the biggest, unsolved challenges for podcast advertisers, Spotify explained, which is what it hopes to address with the Podsights acquisition. Initially, Podsights’ technology will be used to help Spotify’s advertisers more accurately measure the impact and actions driven by their podcast ads. Over time, however, Spotify aims to expand the measurement tools to other ad formats, including audio ads within music, video ads and display ads.\n Podsights has 40 full-time employees and all will join Spotify as one integrated unit. Spotify says it has no plans to adjust that team at this time.\n  Chartable, meanwhile, will be another addition to Spotify’s Megaphone, which was recently beefed up with a deal for a comapny called  Whooshkaa, which allows radio broadcasters to convert their programming into podcasts. Chartable will integrate its audience insights and its promotional tools, SmartLinks and SmartPromos, with Megaphone so podcasters can learn more about their listener base and grow their business.\n After Chartable is fully integrated into Megaphone, Spotify will deprecate the standalone Chartable platform. Until then, however, it will remain available to both new and existing publisher and advertiser clients.\n This team is smaller, having only 11 employees, but Spotify isn’t planning to make any immediate changes here, either, it says.\n There may be some concern that these previously independent firms will now be in-house at Spotify. But Spotify notes the Podsights team will operate independently from other service functions within Spotify for the foreseeable future in order to maintain trust with its clients, which include podcast brands and agencies.\n  Spotify’s name has been in the headlines in recent weeks related to its exclusive hosting of Joe Rogan’s podcast, which critics said is helping to spread COVID-19 misinformation.  This backlash led several artists, including Neil Young, to pull their music from Spotify’s catalog in protest. But so far, the criticism hasn’t impacted Spotify’s broader plan to invest in podcasts and podcast technology, as it believes the medium has the potential to drive revenue for its business in the longer term.\n  “We believe we’re still in the early chapters of digital audio and the opportunity for advertising in this space remains significant,” said Dawn Ostroff, chief content &amp; advertising business officer at Spotify, in a statement. “Our acquisitions of podcast technology players Podsights and Chartable are important steps in our pursuit of taking digital audio to the next level, underscoring the powerful impact it delivers for advertisers and publishers, respectively.”\n Though Spotify doesn’t tend to immediately disclose the acquisition price for the smaller tech companies it buys, it will often later do so in its SEC filings. For example, Spotify  disclosed it acquired the podcast discovery firm Podz, Inc. for €45 million in June 2021 and  paid €57 million for Betty Labs, whose tech became Spotify’s live audio platform, Greenroom. Megaphone was one of its larger podcast tech deals  at €195 million.", "posttime": "2022-02-17 07:06:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,抢购,snaps,spotify", "title": "Spotify抢购了播客测量和分析公司Podsights和Chartable", "title_en": "\n\t\t\t\tSpotify snaps up podcast measurement and analytics firms Podsights and Chartable\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/16/spotify-snaps-up-podcast-measurement-and-analytics-firms-podsights-and-chartable/", "via": "", "real_tags": ["播客", "抢购", "snaps", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比特币提示已经通过Strike的闪电网络在Twitter上启用，从而降低了支付费用。但以太坊的加入支持Twitter进军非比特币加密功能，比如臭名昭著的六边形NFT个人资料图片。\n你已经在个人资料上设置了提示，所以它&#39；人们表示支持容易吗？\n是的：酷，我们添加了Paga、Flatterwave易货、Paytm，以及添加以太坊地址的选项。\nTwitter发言人告诉TechCrunch：“与Twitter一样，数字货币的运行没有全球障碍。除了比特币支付之外，我们很高兴在Tips中加入以太坊，使更多人能够以尽可能少的摩擦参与数字经济。”。\nTwitter的ETH提示不支持ENS地址——只支持你的长而笨重的字母数字地址。当你发送ETH小费时，你实际上并不是通过Twitter给小费。相反，点击用户的ETH提示选项只会复制他们的地址，这样你就可以导航到你的加密钱包并向用户发送ETH提示。但由于小费的增量可能较小，考虑到与交易相关的费用，给以太坊地址小费可能没有意义。基本上，这项功能只是一种更方便用户与关注者分享钱包地址的方式。", "note_en": "Bitcoin tips were already enabled on Twitter via Strike’s Lightning Network, which reduces fees on payments. But the addition of Ethereum supports Twitter’s foray into non-Bitcoin crypto features, like the infamously hexagonal  NFT profile pictures.\n Have you set up Tips on your profile yet so it&#39;s easy for people to show their support?\n  Yes: Cool, we’ve added Paga, Barter by Flutterwave, Paytm, and the option to add your Ethereum address.\n “Like Twitter, digital currencies operate without global barriers. We’re excited to incorporate Ethereum in addition to Bitcoin payment in Tips, enabling more people to participate in the digital economy with as little friction as possible,” a Twitter spokesperson told TechCrunch.\n  Twitter’s ETH tips don’t support  ENS addresses — just your long, clunky alphanumeric one. When you send an ETH tip, you’re not actually tipping via Twitter. Instead, clicking on a user’s ETH tip option just copies their address, so you can then navigate to your crypto wallet and send the user an ETH tip. But because tips are likely to come in smaller increments, tipping to an Ethereum address might not make sense, given the fees associated with transactions. Basically, this feature is just a more user-friendly way of sharing your wallet address with your followers.", "posttime": "2022-02-17 07:05:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "twitter,send", "title": "抱歉，杰克，你现在可以通过Twitter发送ETH提示了", "title_en": "\n\t\t\t\tSorry, Jack, you can send ETH tips via Twitter now\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/16/twitter-ethereum-tips-tip-jar-wallet/", "via": "", "real_tags": ["twitter", "send"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Akshat Dixit是北卡罗来纳州立大学的大四学生，在全能风投公司实习，曾在北卡罗来纳州温斯顿塞勒姆的哈佛商学院校友天使协会和创新区实习。\n我们一直在研究VC scout项目，不仅是为了改善我们的交易来源，还有四个更广泛的原因：\n多才多艺的VC为处于转型期的创始人运营一个免费社区，“创始人的下一步”我们为可能考虑成立新公司的创始人收集了广泛的资源；天使投资/成为风投；收购一家公司；加入董事会；咨询担任临时行政人员；或者只是找份工作。我们的目标是在转型期投资、共同投资和/或招募创始人。\n包括我们在内的所有风投公司都经常看到不符合我们要求的投资机会。我们还不如把他们介绍给别人来获得补偿。有许多风险投资基金将共同投资中获得的利差分摊给转介方。另一个选择是通过下面列出的项目，成为其他风投的正式侦察员。\n3.我们正在启动自己的童子军计划，并希望将薪酬和结构与同行进行比较\n我们已经有了一支高级风险投资合作伙伴团队，他们在创业和勤奋方面为我们提供帮助。他们也可能直接与公司协商或在董事会任职，在这种情况下，我们将加快他们直接获得相关公司的补偿。童子军的目的是建立一种更轻松的关系，只关注采购。我们设想，我们可以有无限数量的童子军，但只有少数风险投资伙伴。\n我们已经确定了除我们之外的一些风投，他们公开讨论了他们的童子军项目，在某些情况下还公开分享了他们的经济情况。我们通过浏览公司的网站、社交媒体、博客帖子等找到了这些信息。我们在下面列出了所有这些信息。\n除了正式的童子军项目，请注意，许多风投公司将与“公司之友”达成一次性安排，以补偿他们的采购。除非你与风投已有关系，否则你通常无法“申请”这些关系。\n童子军通常从他们所获得的持续投资中获得一定比例的报酬。因此，除去任何预付现金，你的现金补偿（通常在创业公司退出时支付（通常从现在起三到十二年）等于：\n*（您在套利池中所占的百分比，通常为给定投资的基金套利池的2.5%-10%，即基金收益的20%）\n如果你是按每笔交易支付的，你的合同可能会对结转进行调整。例如，如果整个基金是0.9倍的倍数，即使你为该特定基金获得了一笔成功的投资，你也可能获得零报酬。）\n某些后期风投投资了我过去的一些基金，部分是为了激励我们向他们介绍未来的投资机会。一些公司也会或相反地向童子军支付现金奖励，通常为公司投资金额的1%。或者，一些公司为每笔交易支付固定比例的总资金结转，也就是说，如果你在一个基金计划的30家公司中找到一家公司，你可能会得到10%*（1/30）=0.333%的结转池。这种结构的优点是会计核算更简单，它激励scout成为整个投资组合的一个资源，而不仅仅是她收购的一家公司。\n一些基金（如Accel、红杉）为童子军提供了少量资金。实际上，童子军正在管理风险投资基金的一小部分。通常，支持VC将有一定的能力否决scout在该结构中的投资。\n也就是说，如果基金对上述公式的其他组成部分的衡量标准较低，那么慷慨的结转百分比就无关紧要了。真正重要的是童军基金是否合适。如果你找到的投资不适合你正在寻找的风投，你就赚不到钱，因为他们根本不会把钱用在工作上。\n一些童子军也有机会（或期望）通过向潜在的有限合伙人寻求资金承诺来帮助基金筹集资金。从风险投资有限合伙人处筹集资金的典型激励付款为筹集现金的0.5%-2%，较小基金的比例更大。与律师核实，确保这些薪酬结构符合要求。\n我们的重点是风险投资，但私募股权行业也雇佣了专注于创新的团队成员。这些人主要是全职团队成员，但私募股权基金也雇佣投资银行和自由职业者\n包括奖金在内，一家私募股权公司的新业务发展合伙人的大致工资约为10万美元。一些私募股权基金公开为任何推荐他们投资的人宣传奖励，而独立赞助人可以为促成交易赚取20%的费用。\nOpenVC首席执行官史蒂芬·纳赛尔（Stephane Nasser）指出：“鉴于RBF的即时性，支付是即时的：一个成功的合作关系通常会产生最多1%的融资金额。”。“如果你能接触到营收后的SaaS或电子商务公司，你可以在几天内轻松地为每家公司赚1000到10000美元。”\n大多数童子军只有在成功的基础上才能获得报酬，没有雇佣关系。如果你的职责只是转发电子邮件，偶尔做一次介绍，那么获得聘用就不那么常见了。如果符合以下条件，你可以为聘请顾问（或投资你的基金，如果你自己是风投）提出理由：\n除了正常的商业活动之外，你还将花费大量时间进行营销、采购和筛选投资。如果你打算每周工作一个小时，大多数人都会放心地知道，他们可能要到十年后才能拿到工资。但如果你每周工作超过一小时，就要求更确定的现金和/或股权补偿。我建议对你预期工作的时间/周数做一个清晰的解释，并把它与你认为合理的小时费率相乘。\n你还参与了公司活动的其他方面：尽职调查、投资组合加速、董事会服务等。\n雇佣童子军通常是因为他们在风投关注的行业、地理位置和/或社区有良好的人脉关系和可信度。Sutton Capital首席执行官乔尔·帕拉钦卡尔（Joel Palachinkal）观察到，童子军通常分为三类：", "note_en": "Akshat Dixit is a senior at North Carolina State University, an intern at  Versatile VC, and a past intern with the  HBS Alumni Angels Association and the  Innovation Quarter in Winston-Salem, North Carolina.\n  We’ve been studying VC scout programs, not just to improve our deal sourcing, but for four broader reasons:\n  Versatile VC runs a no-cost community for founders in transition, “ Founders’ Next Move.” We have collected a wide range of resources for founders who may be considering launching a new company; angel investing/becoming a VC; buying a company; joining boards; consulting; serving as an interim executive; or just getting a job. Our goal is to invest in, co-invest with and/or recruit founders in transition.\n  All VCs, including us, regularly see investment opportunities that don’t fit our mandate. We may as well get compensated for referring them to others. There are a number of VC funds that share the carry earned in their co-investment to the referring party. Another option is our becoming a formal scout for other VCs through programs like those we list below.\n 3. We’re launching our own scout program and want to benchmark compensation and structure against our peers\n We already have a senior team of venture partners who help us in origination and diligence. They may also consult with companies directly or serve on boards, in which case we’ll expedite their being compensated directly by the relevant company. Scouts are intended to be a lighter-touch relationship, focused only on sourcing. We envision we can have an unlimited number of scouts, but only a small number of Venture Partners.\n    We’ve identified a number of VCs besides us that have publicly discussed their scout programs, and in some cases publicly shared their economics. We found these by looking through firms’ websites, social media, blog posts, etc. We list all of them below.\n In addition to formal scout programs, note that many VCs will structure one-off arrangements with “friends of the firm” to compensate them for sourcing. You can’t normally “apply” for those relationships unless you have a pre-existing relationship with the VC.\n  Scouts are typically paid a percentage of carry-on investments they source. So excluding any upfront cash, your cash compensation, which is normally paid out when that startup exits (typically three to 12 years from the present) equals:\n * (your percentage of the carry pool, typically 2.5%-10% of the fund’s carry pool on a given investment, i.e., of the typical 20% that the fund earns)\n If you’re paid on a per-deal basis, your contract may have adjustments for netting of carry. For example, if the overall fund is a 0.9X multiple, you may get paid zero even if you source a winning investment for that particular fund.)\n Certain late-stage VCs have invested in some of my past funds, partly to motivate us to refer future investment opportunities to them. A few firms also or instead pay a cash bounty to scouts, typically 1% of the amount invested into the company. Alternatively, some firms pay a fixed percentage of total fund carry per deal sourced, i.e., if you source one company out of a planned 30 companies in a fund, you might get 10%*(1/30) = 0.333% of the carry pool. This structure has the advantage of simpler accounting and it motivates the scout to be a resource for the entire portfolio, not just the one company she sourced.\n A few funds (e.g., Accel, Sequoia) give the scout a small pool of capital. Effectively, the scout is then managing a tiny pocket of that VC fund. Typically, the backing VC will have some ability to veto the scout’s investments in this structure.\n That said, a generous carry percentage is irrelevant if the fund’s metrics for the other components of the formula above are low. What really matters is  scout-fund fit. You’re not going to earn any money if the sort of investments you source are not a fit for the VC you’re scouting for, because they just won’t put money to work.\n Some scouts also have the opportunity (or expectation) to help raise money for the fund by seeking fund commitments from potential LPs. Typical incentive payments for fundraising from VC limited partners is 0.5%-2% of cash raised, with larger percentages for smaller funds. Check with counsel to make sure that these compensation structures are compliant.\n  Our focus here is venture capital, but the private equity industry employs origination-focused team members also. These are primarily full-time team members, but PE funds also employ investment banks as well as freelance “finders.”\n Including bonuses, the ballpark salary for a new business development associate with a private equity firm is around $100,000. Some PE funds publicly advertise rewards for anyone who refers them to an investment, while independent sponsors can earn a 20% fee for facilitating deals.\n  “Given the instant nature of RBF, the payout is immediate: a successful affiliation typically generates up to 1% of the amount raised to the finder,”  OpenVC CEO Stephane Nasser noted. “If you have access to post-revenue SaaS or e-commerce companies, you can easily make $1,000 to $10,000 per company within a few days.”\n Most scouts get paid only on a success basis, without a retainer. If your responsibility is just forwarding emails and making an occasional intro, it’s less common to get a retainer. You can make an argument for a retainer (or an investment in your fund, if you’re a VC yourself) if some combination of the following applies:\n You’re going to spend significant time marketing, sourcing and filtering investments, beyond your normal business activities. If you’re going to work for an hour a week, most people are comfortable knowing they may not get paid, if at all, until a decade from now. But if you’re doing more than an hour a week, ask for more certainty of cash and/or equity compensation. I suggest getting clarity on the number of hours/week you’re expected to work, and multiply it by what you consider a reasonable hourly rate.\n You’re involved in other aspects of the firm’s activities: due diligence, portfolio acceleration, board service, etc.\n  Scouts are typically hired because they are well-networked and credible in an industry, geography and/or community that a VC is focusing on.  Joel Palathinkal, CEO of  Sutton Capital, observes that scouts usually fall into one of three categories:", "posttime": "2022-02-17 06:57:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "job,投资", "title": "如何为风投公司找一份侦察员的工作", "title_en": "\n\t\t\t\tHow to find a job as a scout for a VC firm\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/16/how-to-find-a-job-as-a-scout-for-a-vc-firm/", "via": "", "real_tags": ["job", "投资"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073730, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该品牌于2019年推出，是第一个将平板形状因子推向市场的清洁产品系列，承诺将永远避免一次性使用塑料。自成立以来，该公司已获得40项专利（以及正在申请的专利），并正在努力继续其快速增长的轨迹。该公司去年增长了400%以上，客户终身价值（LTV）增长了80%，这主要是由于其产品线的扩大。\n新一轮2000万美元的融资由专注于消费品牌的风险投资公司Prelude Growth Partners牵头。迄今为止，该公司已从一批名副其实的业内人士和名人那里筹集到3500万美元，其中包括贾斯汀·汀布莱克、阿德里安·格雷尼尔、詹妮弗·弗莱斯（Rent the Runway）、尼古拉斯·贾梅特（Sweetgreen）、尼克·格林（Thrive Market）等。\n莎拉笑着说：“回顾我们刚开始从事这项业务时，我和我的联合创始人约翰的使命是消除一次性塑料包装。实际上，这从来不是清洁产品。我们探索了一系列潜在的类别和形式，我们可以从中开始。当时有很多人持怀疑态度。”Blueland联合创始人兼首席执行官柳佩吉（Paiji Yoo）。“我感觉像是连续有20位投资者告诉我，没有人关心生态——人们不会为地球改变他们的行为。”\n该公司正在大声展示其生态信誉；它是一家经过认证的B公司，并且是气候中性认证的公司——对于一家已经售出了1000多万种产品并将其客户群扩大到100多万会员的公司来说，这是一个令人印象深刻的壮举。据统计，在这一过程中，已经阻止了10亿个塑料瓶进入垃圾填埋场。\nAlicia Sontag说：“Blueland的高性能产品，加上其消除一次性塑料的使命，在清洁领域赢得了无与伦比的消费者喜爱。该品牌是该领域增长最快的品牌之一，有着非凡的需求和极强的忠诚度。”，Prelude Growth Partners联合创始人兼管理合伙人。“我们很高兴能与Sarah和John合作，继续将Blueland打造成一个标志性的强大品牌。”\n在这一过程中，该公司不得不在科技领域进行一些重大投资；大多数包装消费品（CPG）公司都使用合同制造商，并依赖它们来生产配方，而Blueland则不得不走另一条路，因为他们找不到任何符合其规格的人。\n“我们最初不想自己制定所有的方案，但我们没有机会使用合同制造商。一旦我们意识到清洁喷雾剂含有90%的水，我们决定不采取传统的方法。我们去了所有这些清洁制造商——十几家——然后他们所有人都看着我们，好像我们有三个头；“好像我们很愚蠢，”柳回忆道他们没有平板电脑；他们的大部分原料都是液态的，他们无法生产出我们需要的东西。这引发了一场白费力气的追逐。我们与从糖果制造商到维生素制造商的每一个人都进行了交谈，试图弄清楚干燥格式的人是否可以帮助我们解决这个问题。这些对话的要点是，我们必须制定自己的产品。我和我的联合创始人都不是化学家，但我们聘请了Method配方总监，这是世界上最大的天然清洁品牌之一。我们有很多值得骄傲的地方——我们是第一个将平板电脑的形式因素推向市场的清洁产品，从洗手液到喷雾清洁剂，再到洗衣液和洗碗皂。这使我们成为领先的清洁品牌，在所有产品中不使用一次性塑料。", "note_en": "Launched in 2019, the brand was the first to bring the tablet form factor to market across a range of cleaning products that promise they’re shunning single-use plastics forever. Since its inception, the company has racked up 40 patents (and patents pending), and is tooling up to continue its rapid growth trajectory. The company grew more than 400% over the last year, and saw an 80% increase in customer lifetime value (LTV), largely driven by a broadening of its product lines.\n The new $20 million round of financing was led by consumer brands-focused venture firm  Prelude Growth Partners. To date, the company has raised $35 million from a veritable who’s-who of industry insiders and celebrities, including Justin Timberlake, Adrian Grenier, Jennifer Fleiss (Rent the Runway), Nicolas Jammet (Sweetgreen), Nick Green (Thrive Market) and others.\n  “Looking back to when we first started working on the business, my co-founder John and I were on a mission to eliminate single-use plastic packaging. It was actually never about cleaning products. We explored a wide range of potential categories and formats that we could start in. At that point in time there was so much skepticism,” laughs  Sarah Paiji Yoo, co-founder and CEO of Blueland.”I feel like I had 20 investors in a row telling me that no one cares about eco — and that people will not change their behaviors for the planet.”\n The company is flexing its eco-credentials loudly; it’s a certified B Corporation, and is Climate Neutral Certified — an impressive feat for a company that has also shipped more than 10 million products and grown its customer base to more than 1 million members. It calculates it has already prevented a billion plastic bottles from going to landfills in the process.\n “Blueland’s high-performance products combined with its mission to eliminate single-use plastic have resulted in unparalleled consumer love in the cleaning category. The brand is one of the fastest-growing in its space, with exceptional demand and extremely strong loyalty,” said Alicia Sontag, co-founder and managing partner at Prelude Growth Partners. “We are thrilled to be partnering with Sarah and John as they continue to build Blueland into an iconic powerhouse brand.”\n  The company had to make some big investments in tech along the way; whereas most consumer packaged goods (CPG) companies use a contract manufacturer and relies on them for their formulations, Blueland had to go a different path, as they weren’t able to find anyone who could work to their specs.\n  “We didn’t initially want to formulate everything ourselves, but we didn’t have the luxury of being able to use a contract manufacturer. Once we realized that cleaning sprays have 90% water, we decided that it wouldn’t make sense to take a traditional approach. We went to all these cleaning manufacturers — over a dozen of them — and they all looked at us like we had three heads; as if we were stupid,” Yoo recalls. “They didn’t have tablet machinery; most of their ingredients comes to them as liquids, and they weren’t able to make what we needed. That kicked off a wild goose chase. We talked to everyone from candy manufacturers to vitamin manufacturers trying to figure out if the dry-format folks could help us with this. The takeaway from those conversations was that we were going to have to formulate our own product. Neither my co-founder nor myself are chemists, but we were able to bring on the director of formulation for Method, which is one of the largest natural cleaning brands in the world. There is a lot to be proud of — we have been the first to bring the tablet form factor to market across a range of cleaning products, from hand soaps to spray cleaners to laundry and dish soaps. That has enabled us to become the leading cleaning brand that uses no single-use plastic across all of our products.", "posttime": "2022-02-17 06:56:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "避免,raises", "title": "Blueland筹集了更多资金，以避免水运，减少一次性塑料的使用", "title_en": "\n\t\t\t\tBlueland raises more money to avoid shipping water around and reduce single-use plastics\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/16/blueland-series-b/", "via": "", "real_tags": ["避免", "raises"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "便利店连锁店7-Eleven与一家机器人开发初创公司合作，提供无人送货服务。（乐天提供的照片）首尔——韩国正在试验机器人运送食物和其他物品，该国计划从2023年起允许机器人上路。", "note_en": "Convenience store chain 7-Eleven has tied up with a robot development startup to offer unmanned delivery services. (Photo courtesy of Lotte)   SEOUL -- Robots are being trialled to deliver food and other items in South Korea, which is planning to allow them on roads from 2023.", "posttime": "2022-02-17 06:53:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,送货,korea", "title": "韩国将于2023年允许公共道路上使用送货机器人", "title_en": "South Korea To Allow Delivery Robots on Public Roads in 2023", "transed": 1, "url": "https://asia.nikkei.com/Business/Technology/South-Korea-to-allow-delivery-robots-on-public-roads-in-2023", "via": "", "real_tags": ["机器人", "送货", "korea"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073728, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "印度储备银行（Reserve Bank of India，RBI）副行长T.Rabi Sankar在一次银行会议上告诉听众，加密货币是“专门为绕过受监管的金融体系而开发的”，没有任何潜在现金流的支持。\n“我们还看到，加密货币不符合货币、资产或商品的定义；它们没有潜在现金流，没有内在价值；它们类似于庞氏骗局，甚至可能更糟，”他说。\n桑卡尔发表上述言论之际，印度政府已经发出信号，表明它正在朝着将数字虚拟资产确认为法定货币的方向迈进。美国财政部长尼马拉·西塔拉曼（Nirmala Sitharaman）本月初在联邦预算中提议对加密货币和非金融交易产生的收入征税。\n尽管监管存在不确定性，加密货币和NFT的销售在过去一年里迅速进入印度市场。根据研究公司ChainAnalysis的分析，全球第二大互联网市场的加密货币投资采用率位居第二。\n她在预算演讲中说：“这些交易的规模和频率使得有必要制定具体的税收制度。”。\n到目前为止，印度央行对加密货币非常谨慎。2018年，它禁止金融公司处理加密货币。两年后，印度最高法院推翻了这项禁令，但大多数银行仍在遵循印度储备银行的指示。\n西塔拉曼周一表示，新德里和印度储备银行正在进行讨论，以制定规则，两人“在船上”\n桑卡尔的讲话明确表明，印度储备银行没有改变其长期以来的立场。“作为一种价值存储，比特币等加密货币迄今为止已经带来了可观的回报，但17世纪荷兰的郁金香也是如此。加密货币非常像一种投机性或赌博合同，就像庞氏骗局。事实上，有人认为查尔斯·庞氏在1920年设计的原始方案比加密货币更好“从社会角度来看，”他说。\n他警告称，加密货币可能会“破坏”货币体系、金融管理局、银行体系，以及政府控制经济的总体能力。\n他说：“它们威胁到一个国家的金融主权，使其容易受到创造这些货币的私人公司或控制这些货币的政府的战略操纵。所有这些因素都导致了一个结论，即禁止加密货币可能是印度最明智的选择。”。“我们研究了那些主张对加密货币进行监管的人提出的论点，发现它们都经不起基本的审查。”", "note_en": "T. Rabi Sankar, deputy governor of Reserve Bank of India (RBI), told an audience at a banking conference that cryptocurrencies have been “specifically developed to bypass the regulated financial system,” and are not backed by any underlying cash flow.\n “We have also seen that cryptocurrencies are not amenable to definition as a currency, asset or commodity; they have no underlying cash flows, they have no intrinsic value; that they are akin to Ponzi schemes, and may even be worse,” he said.\n  Sankar’s remarks come at a time the Indian government has sent signals that it’s moving in the direction of recognizing the digital virtual asset as legal tender. The nation’s Finance Minister Nirmala Sitharaman proposed taxing income accrued from transfer of cryptocurrencies and NFTs in the federal budget early this month.\n The sale of cryptocurrencies and NFTs have made quick inroads in India in the past year despite regulatory uncertainty. The world’s second-largest internet market has seen the second-highest adoption rate for cryptocurrency investments, according to an analysis by research firm Chainalysis.\n “The magnitude and frequency of these transactions have made it imperative to provide for a specific tax regime,” she said in her budget speech.\n India’s central bank has so far been very cautious about cryptocurrencies. In 2018, it banned financial firms from dealing with cryptocurrency. The ban was  overturned by India’s Supreme Court two years later, but most banks have continued to follow the RBI’s direction.\n  Sitharaman said on Monday that New Delhi and the RBI were holding discussions to formulate rules and that the two were “onboard.”\n Sankar’s speech has made it clear that the RBI has not changed its long-held stance. “As a store of value, cryptocurrencies like bitcoin have given impressive returns so far, but so did tulips in 17th century Netherlands. Cryptocurrencies are very much like a speculative or gambling contract working like a Ponzi scheme. In fact, it has been argued that the original scheme devised by Charles Ponzi in 1920 is better than cryptocurrencies from a social perspective,” he said.\n Cryptocurrencies can “wreck” the currency system, the monetary authority, the banking system and in general the government’s ability to control the economy, he warned.\n “They threaten the financial sovereignty of a country and make it susceptible to strategic manipulation by private corporates creating these currencies or governments that control them. All these factors lead to the conclusion that banning cryptocurrency is perhaps the most advisable choice open to India,” he said. “We have examined the arguments proffered by those advocating that cryptocurrencies should be regulated and found that none of them stand up to basic scrutiny.”", "posttime": "2022-02-17 06:51:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "央行,akin,货币", "title": "印度央行警告称，加密货币类似于“庞氏骗局”", "title_en": "Cryptocurrency is Akin To a 'Ponzi Scheme', Warns India's Central Bank", "transed": 1, "url": "https://techcrunch.com/2022/02/15/india-central-bank-cryptocurrency-ponzi-banning/", "via": "", "real_tags": ["央行", "akin", "货币"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当中佛罗里达大学的计算机系学生Kurt Wilson听说他的大学正在使用一种有争议的在线监考工具“荣誉锁”时，他马上就想学更多。\n该公司的业务在疫情期间蓬勃发展，它承诺通过学生使用的人工智能软件确保远程学生不会在考试中作弊，该软件“监控每个学生的考试环节，并在检测到任何潜在问题时向美国的实时监考人发出警报”该软件可以扫描学生的面部，以验证他们的身份，跟踪电脑麦克风捕捉到的特定短语，甚至承诺搜索和删除网上泄露的试题。\n霍诺洛克的一个特写尤其引起了威尔逊的兴趣。据该公司提供的材料，该公司提供了一种追踪作弊学生的方法，通过Honorlock称之为“种子网站”或其他人称之为“蜜罐”的网站，即远程诽谤考试期间访问他们的学生的假网站。\n威尔逊仔细研究了该软件的专利以了解更多信息，并找到了列出的示例网站。在过去的一年里，通过寻找通用代码和相同的测试问题，威尔逊最终找到了十几个显然与Honorlock有关的蜜罐，其中五个仍在运行。\n威尔逊说：“这在某种程度上成了一种痴迷。”几个月来，他一直没有追踪这些蜜罐，但有一次每天都在检查它们。\n威尔逊发现的地点都是赤裸裸的。它们的名字有“gradepack.com”和“quizlookup.com”它们很大程度上是数千个明显的测试问题的目录，有时非常具体。“化学消化从消化系统的哪一部分开始？”一篇帖子问道。多项选择题要求使用“VSEPR理论预测甲醛H2CO中碳原子周围的分子几何结构”\n点击任何问题下方的“显示答案”按钮，您将不会得到帮助，但会收到数字提示音，并且没有答案。但访问这些网站的用户可以获得有关鼠标移动的详细信息，甚至可以将输入信息传输到Honorlock服务器。\n在亚利桑那州立大学学生媒体最近标记的专利以及Honorlock蜜罐网站中，该公司解释说，其网站可以跟踪访客信息，如IP地址，作为学生在辅助设备上查找答案的证据。\n当疫情导致学校停课时，对Honorlock等服务的需求激增，因为教育工作者担心学生能否使用老师不知道的设备在网上轻松找到答案。Honorlock在其软件的在线资料中说，“学生可以使用越来越多的电子设备，教师也越来越难保持学术诚信。”\n但一些教育伦理专家担心，蜜罐网站这样的技术太过火了。\n卡尔加里大学的副教授Sarah Eaton说：“我可以用一个词来概括这项活动。”“诱捕。”\n虽然有几家公司提供的服务可以利用学生的网络摄像头来追踪他们，但建立虚假网站来抓捕潜在的作弊者似乎是一种创新，对一些专家来说，这种创新跨越了道德底线。\n以前，在网上搜索答案的学生可能什么也没找到，而现在，一个潜在的有罪网站将在那里诱惑他们。\n圣约翰大学（St.John’s University）研究远程监考的副教授塞西莉亚·帕恩瑟（Ceceilia Parnther）说，这种情况很讽刺：学生“被设置”通过蜜罐，试图检测学术诚信违规行为，这种行为本身就有道德问题。\n她说：“面对面的比较是老师拿着答案钥匙四处走动，把它放在每张桌子的一角，然后如果学生看了就惩罚他们。”。\n威尔逊发现的网站上没有直接提到Honorlock。但这些网站列出了彼此相同的测试问题，并包括提及电子邮件地址的服务条款页面。”privacy@hlprivacy.com.“页面的网络活动由标记审查，还显示数据被发送到Honorlock.com服务器。\n为了准确了解蜜罐网站可能会跟踪哪些数据，标记使用Firefox的开发工具检查了页面的源代码和网络活动，这些工具用于Wilson指出的每个仍在运行的网站。我们发现，这些网站在访问者的设备类型上捕获数据，访问者的鼠标在页面上的位置，他们在搜索栏中输入的内容，以及他们单击的内容的详细信息。\nHonorlock没有回复对这些网站发表评论的请求，也没有回答有关其隐私做法的其他问题。\n目前尚不清楚有多少学生被该公司的蜜罐抓到。“荣誉锁”与佛罗里达大学和马里兰大学等大学合作。该公司去年宣布，在大流行时代需求的推动下，在前一轮1150万美元的基础上，已筹集了2500万美元的风险投资。美国各地的大学现在已经与Honorlock签订了利润丰厚的合同，每年为这项服务支付数十万美元。\n与此同时，一些教育工作者也在自己使用类似的策略，在网上传播虚假或可追踪的考试答案，以抓捕查找答案的学生。\n在普林斯顿学生媒体报道的一个案例中，一名教授承认，那里的一名数学助教试图通过在网上发布的错误答案上添加“唯一标记”来捕捉学生作弊。解决方案包括与答案无关的“一个定理的引用”。《普林斯顿报》报道称，根据学生对问题的回答，有几名学生被指控作弊。\n除了蜜罐，proctoring软件的迅速崛起还引发了其他隐私和道德问题。一些学生和教育工作者认为，该软件会导致一个引发焦虑的测试环境，其他人则提出了技术上的担忧，指出人脸检测软件无法识别肤色较深的学生的面孔。\n对一个通视的普罗克托的恐惧可能会产生残酷的副作用。一名女性在参加远程律师考试时分娩，但由于担心被判作弊，她继续进行考试。\n对于教育工作者来说，能够自动追踪作弊者的软件的吸引力是显而易见的。但一些专家认为，这不是一个可以或应该通过技术进步来解决的问题，而是对这些学生最初如何测试的重新思考。\n像帕恩瑟这样的教育学伦理学家说，这种软件制造了一个学生在默认情况下受到怀疑的环境，从而适得其反。她说，这种心态本身就促进了作弊，因为它巧妙地向学生暗示，他们也可以作弊，因为老师希望他们无论如何都会作弊。帕恩瑟说：“学生们看到，在一个环境中，他们会自动地认为自己不值得信任。”。\n伊顿建议教育工作者应该考虑对考试进行更彻底的反思，一种不依赖于对学生进行监控的考试。伊顿说，惩罚学生使用他们的设备从根本上违背了互联网时代的学习方式，而利用可能的作弊者的猫捉老鼠游戏也不起作用。例如，转向一个更好的系统可能意味着转向更多的口语或开卷考试，这些考试仍能证明自己的熟练程度，而不需要简单地在谷歌上搜索答案。\n帕恩瑟认为，考试中总会有一定程度的作弊行为，但打击学生的成本现在是以牺牲他们的教育为代价的。\n她说：“虽然我们不能确保没有学生会作弊，但我们可以让大多数学生只是努力做到最好。”。\n这就是推动这种标记的原因，也正是它成为了无与伦比的非营利新闻编辑室，用技术来记录技术。\n读者支持是我们的一个重要组成部分。建设一个更美好的未来不仅是可能的，而且多亏了你们，它现在正在发生。\n现在捐赠", "note_en": "When Kurt Wilson, a computer science student at the University of Central Florida, heard that his university was using a controversial online proctoring tool called Honorlock, he immediately wanted to learn more.\n The company, whose business has boomed during the pandemic, promises to ensure that remote students don’t cheat on exams through AI-powered software used by students that “monitors each student’s exam session and alerts a live, US-based test proctor if it detects any potential problems.”  The software can scan students’ faces to verify their identity, track specific phrases that their computer microphone captures, and even promises to search for and remove test questions that leak online.\n   One feature from Honorlock especially piqued Wilson’s interest. The company, according to its materials, provides a way to track cheating students through what Honorlock calls “seed sites” or others call “honeypots”—fake websites that remotely tattle on students who visit them during exams.\n Wilson pored over a patent for the software to learn more, finding example sites listed. By looking for common code and the same test questions over the past year, Wilson eventually turned up about a dozen honeypots apparently linked to Honorlock, five of which  are still operating.\n “It kind of became an obsession at one point,” said Wilson, who hasn’t tracked the honeypots in some months but was at one point checking for them daily.\n The sites Wilson found are bare bones. They have names like “ gradepack.com” and “ quizlookup.com.” They’re largely a catalog of thousands of apparent test questions that are sometimes bizarrely specific. “In which part of the digestive system does chemical digestion begin?”  one post asks.  A multiple-choice question requests using “VSEPR theory to predict the molecular geometry around the carbon atom in formaldehyde, H2CO.”\n Click on the “show answer” button below any of the questions and you won’t get help but will be rewarded with a digital chiming noise and no answer. But visitors to the sites are having detailed information about their mouse movements and even typing transmitted to an Honorlock server.\n In the patent,  recently flagged, along with an Honorlock honeypot site, by student media at Arizona State University, the company explains that its sites can track visitor information like IP addresses as evidence that a student was looking up answers on a secondary device.\n  When the pandemic led to shuttered schools, demand for services like Honorlock skyrocketed as educators worried about whether students would be able to easily find answers online using devices that instructors didn’t know about. In  its online materials for its software, Honorlock says, “[S]tudents have access to more and more electronic devices and it’s becoming harder for instructors to preserve academic integrity.”\n But some experts in the ethics of education worry techniques like honeypot websites simply go too far.\n “I can sum up this activity in one word,” said Sarah Eaton, an associate professor at the University of Calgary who studies academic integrity. “Entrapment.”\n  While several companies offer services that tap into students’ webcams to track them, setting up fake sites to catch potential cheaters appears to be an innovation—one that crosses an ethical line for some experts.\n Before, students searching online for answers may simply have turned up nothing, while now, a potentially incriminating website will be there to tempt them.\n Ceceilia Parnther, an associate professor at St. John’s University who has studied remote proctoring, said the situation is ironic: Students “are being set up” through honeypots, she said, in an attempt to detect academic integrity violations, a practice that’s itself ethically questionable.\n “The face-to-face comparison is a teacher walking around with the answer key and putting it on the corner of each desk and then penalizing students if they look over at it,” she said.\n Honorlock is not directly mentioned on the sites Wilson found. But the sites list the same test questions as each other and include terms of service pages that mention the email address “privacy@hlprivacy.com.” The network activity of the pages, reviewed by The Markup, also shows data being sent to an Honorlock.com server.\n To understand precisely what data the honeypot sites might be tracking, The Markup inspected the page’s source code and network activity using Firefox’s developer tools for each of the still-operating websites noted by Wilson. We found that the sites captured data on a visitor’s type of device, where that visitor’s mouse was on the page, what they entered into a search bar, and details on what they clicked.\n  Honorlock didn’t respond to a request for comment on the sites or to answer other questions about its privacy practices.\n It’s not clear how many students have been caught by the company’s honeypots. Honorlock  touts partnerships with colleges like the University of Florida and University of Maryland, among several others. The company  announced last year that, fueled by pandemic-era demand, it had raised $25 million in venture funding, building on  a previous round of $11.5 million. Universities around the United States have now signed lucrative contracts with Honorlock, paying  hundreds of thousands of dollars per year for the service.\n   Some educators, meanwhile, are using similar tactics on their own, spreading false or traceable test answers online to catch students who look up answers.\n In one case, reported on  by student media at Princeton, a professor acknowledged that a mathematics TA there had attempted to catch students cheating by adding a “unique marker” to a wrong solution posted online. The solution included “a reference to a Theorem” that was irrelevant to the answer. The Princetonian reported that several students  were accused of cheating based on their response to the question.\n   Apart from honeypots, proctoring software’s rapid ascent has also given rise to other privacy and ethics concerns. Some students and educators argue the software leads to an  anxiety-inducing testing environment, and others have raised technical concerns, pointing to face-detection software that fails to recognize the faces  of darker-skinned students.\n The fear of an all-seeing proctor can have brutal side effects. One woman  went into labor while taking a remote bar exam but continued with the test, afraid of being flagged for cheating.\n For educators, the draw of software that promises to automatically track down cheaters is clear. But some experts argue that it isn’t a problem that can or should be fixed by advances in technology to surveil students but a rethinking of how those students are tested in the first place.\n  Pedagogy ethicists like Parnther say this kind of software is backfiring by creating an environment where students are, by default, under suspicion. That mindset itself facilitates cheating, she says, by subtly suggesting to students that they might as well cheat because teachers expect them to anyway. “Students see that there’s an environment where it’s automatically assumed that they are not to be trusted,” Parnther said.\n Eaton proposes that educators should consider a more radical rethinking of testing, one that doesn’t rely on surveilling students. Punishing students for using their devices fundamentally goes against how learning works in the age of the internet, Eaton says, and the cat-and-mouse game of sussing out possible cheaters isn’t working. Moving to a better system might mean shifting to more oral or open-book exams, for example, which still demonstrate proficiency without the specter of simply Googling answers.\n There will always be some level of cheating on exams, Parnther argues, but the costs of cracking down on students is now coming at the expense of their education.\n “While we can’t ensure that no students will ever cheat, we can make it a norm that most students are just trying to do their best work,” she said.\n  That’s what drives The Markup and what makes it the unparalleled nonprofit newsroom for using technology to hold technology to account.\n Reader support is an essential piece of our equation. Building a better future is not only possible, it’s happening right now—thanks to you.\n     Donate Now", "posttime": "2022-02-17 06:45:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "网站,fake,学生", "title": "一个虚假答题网站网络正试图将学生绳之以法", "title_en": "A Network of Fake Test Answer Sites Is Trying to Incriminate Students", "transed": 1, "url": "https://themarkup.org/machine-learning/2022/02/15/a-network-of-fake-test-answer-sites-is-trying-to-incriminate-students", "via": "", "real_tags": ["网站", "fake", "学生"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "托卡马克的内部——设计用来容纳核聚变反应的环形容器——呈现出一种特殊的混沌。氢原子在深不可测的高温下被粉碎在一起，形成一个旋转、翻滚的等离子体，比太阳表面还要热。找到控制和限制等离子体的智能方法将是释放核聚变潜力的关键，几十年来，核聚变一直被认为是未来的清洁能源。在这一点上，核聚变背后的科学似乎是合理的，所以剩下的是一个工程挑战。瑞士洛桑埃科尔理工学院瑞士血浆中心主任安布罗吉奥·法索利说：“我们需要能够加热这个问题，并将其保持足够长的时间，以便我们从中提取能量。”。\n这就是DeepMind的用武之地。这家由谷歌母公司Alphabet支持的人工智能公司此前已将业务转向电子游戏和蛋白质折叠，并一直在与瑞士等离子体中心（Swiss Plasma Center）开展一项联合研究项目，以开发一种用于控制核聚变反应的人工智能。\n在同样由聚变提供动力的恒星中，绝对的引力质量足以将氢原子拉到一起，并克服它们相反的电荷。在地球上，科学家们转而使用强大的磁线圈来限制核聚变反应，将其推进到所需的位置，并将其塑造成陶工在轮子上操纵粘土的形状。线圈必须小心控制，以防止等离子体接触容器的侧面：这可能会损坏容器壁并减缓聚变反应。（爆炸的风险很小，因为没有磁约束，聚变反应无法存活）。\n但是，每当研究人员想要改变等离子体的结构，尝试不同的形状，以产生更大的功率或更清洁的等离子体时，就需要大量的工程和设计工作。传统的系统是计算机控制的，基于模型和仔细的模拟，但法索利说，它们“很复杂，不一定总是经过优化的。”\nDeepMind开发了一种人工智能，可以自动控制等离子体。发表在《自然》杂志上的一篇论文描述了这两个小组的研究人员如何教授一个深度强化学习系统，以控制TCV内的19个磁线圈。TCV是瑞士等离子体中心的可变配置托卡马克装置，用于开展研究，为未来更大的聚变反应堆的设计提供信息。“人工智能，特别是强化学习，特别适合于托卡马克等离子体控制所带来的复杂问题，”DeepMind控制团队负责人马丁·里德米勒（Martin Riedmiller）说。神经网络——一种旨在模拟人脑结构的人工智能装置——最初是在模拟中训练的。它首先观察改变19个线圈的设置如何影响容器内等离子体的形状。然后它被赋予不同的形状，试图在等离子体中重建。其中包括一个D形截面，靠近将在ITER（以前的国际热核实验反应堆）内部使用的部分，法国正在建造的大型实验托卡马克，以及一个雪花结构，可以帮助在容器周围更均匀地散发反应的强烈热量。\nDeepMind的人工智能能够通过在模拟中以及科学家在TCV托卡马克内进行相同的真实实验以验证模拟时以正确的方式操纵磁线圈，自主地找出如何创建这些形状。法索利说，这是一个“重要的一步”，可能会影响未来托卡马克的设计，甚至加速通往可行的聚变反应堆的道路。“这是一个非常积极的结果，”伦敦帝国理工学院（Imperial College London）的核聚变专家亚斯敏·安德鲁（Yasmin Andrew）说，他没有参与这项研究。“看看他们能否将这项技术转移到更大的托卡马克上，这将是一件有趣的事情。”\n聚变给DeepMind的科学家们带来了一个特殊的挑战，因为这个过程既复杂又连续。与Go等基于回合的游戏不同，等离子体的状态会不断变化。Go是该公司用AlphaGo人工智能征服的著名游戏。让事情变得更难的是，它无法持续测量。这就是人工智能研究人员所说的“观察不足的系统”\nDeepMind的研究科学家乔纳斯·布奇利（Jonas Buchli）说：“有时候，擅长于这些离散问题的算法会与这些连续问题作斗争。”。“这对我们的算法来说是一个很大的进步，因为我们可以证明这是可行的。我们认为这肯定是一个非常非常复杂的问题需要解决。它的复杂性与游戏中的不同。”\n这不是人工智能第一次被用来控制核聚变。自2014年以来，谷歌一直在与总部位于加利福尼亚州的聚变公司TAE Technologies合作，将机器学习应用于不同类型的聚变反应堆，以加速实验数据的分析。英国欧洲环面（JET）联合聚变项目的研究使用人工智能来预测等离子体的行为。这个概念甚至出现在小说中：在2004年的《蜘蛛侠2》中，反派Doc Ock创造了一个由人工智能驱动、由大脑控制的外骨骼来控制他的实验性核聚变反应堆，在人工智能接管他的大脑并开始杀人之前，这个反应堆一直运转良好。\n总而言之，随着聚变反应堆变得越来越大，与DeepMind的合作可能是最关键的。尽管物理学家对如何通过常规方法控制小规模托卡马克中的等离子体有很好的把握，但随着科学家们试图使发电厂规模的装置可行，挑战只会增加。进展缓慢但稳定。上周，JET项目取得了突破，创造了从聚变项目中提取能量的新纪录。法国国际热核实验堆（ITER）正在进行建设。该国际合作项目将在2025年点火后成为世界上最大的实验聚变反应堆。\n圣地亚哥能源研究中心的副研究员德米特里·奥尔洛夫说：“托卡马克越复杂、性能越高，就越需要以越来越高的可靠性和准确性控制更多的量。”。AI控制的托卡马克可以进行优化，以控制反应热量向容器壁的传递，并防止破坏性的“等离子体不稳定性”反应堆本身可以重新设计，以利用强化学习提供的更严格控制。\n法索利说，最终，与DeepMind的合作可能会让研究人员突破界限，加速聚变动力的漫长旅程。他说：“人工智能将使我们能够探索我们无法探索的东西，因为我们可以用这种我们不敢冒险的控制系统冒险。”。“如果我们确信，我们有一个控制系统，可以使我们接近极限，但不能超过极限，我们实际上可以探索的可能性，否则就不会有探索。”\n🏃🏽‍♀️ 想要最好的健康工具吗？查看我们的装备团队挑选的最佳健身追踪器、跑步装备（包括鞋子和袜子）和最佳耳机", "note_en": "The inside of a tokamak—the doughnut-shaped vessel designed to contain a nuclear fusion reaction—presents a special kind of chaos. Hydrogen atoms are smashed together at unfathomably high temperatures, creating a whirling, roiling plasma that’s hotter than the surface of the sun. Finding smart ways to control and confine that plasma will be key to unlocking the potential of  nuclear fusion, which has been mooted as the clean energy source of the future for decades. At this point, the science underlying fusion seems sound, so what remains is an engineering challenge. “We need to be able to heat this matter up and hold it together for long enough for us to take energy out of it,” says Ambrogio Fasoli, director of the Swiss Plasma Center at École Polytechnique Fédérale de Lausanne in Switzerland.\n That’s where DeepMind comes in. The artificial intelligence firm, backed by Google parent company Alphabet, has previously turned its hand to  video games and  protein  folding, and has been working on a joint research project with the Swiss Plasma Center to develop an AI for controlling a nuclear fusion reaction.\n In stars, which are also powered by fusion, the sheer gravitational mass is enough to pull hydrogen atoms together and overcome their opposing charges. On Earth, scientists instead use powerful magnetic coils to confine the nuclear fusion reaction, nudging it into the desired position and shaping it like a potter manipulating clay on a wheel. The coils have to be carefully controlled to prevent the plasma from touching the sides of the vessel: this can damage the walls and slow down the fusion reaction. (There’s little risk of an explosion as the fusion reaction cannot survive without magnetic confinement).\n  But every time researchers want to change the configuration of the plasma and try out different shapes that may yield more power or a cleaner plasma, it necessitates a huge amount of engineering and design work. Conventional systems are computer-controlled and based on models and careful simulations, but they are, Fasoli says, “complex and not always necessarily optimized.”\n DeepMind has developed an AI that can control the plasma autonomously. A  paper published in the journal  Nature describes how researchers from the two groups taught a deep reinforcement learning system to control the 19 magnetic coils inside TCV, the variable-configuration tokamak at the Swiss Plasma Center, which is used to carry out research that will inform the design of bigger fusion reactors in the future. “AI, and specifically reinforcement learning, is particularly well suited to the complex problems presented by controlling plasma in a tokamak,” says Martin Riedmiller, control team lead at DeepMind.  The neural network—a type of AI setup designed to mimic the architecture of the human brain—was initially trained in a simulation. It started by observing how changing the settings on each of the 19 coils affected the shape of the plasma inside the vessel. Then it was given different shapes to try to re-create in the plasma. These included a D-shaped cross section close to what will be used inside ITER (formerly the International Thermonuclear Experimental Reactor), the large-scale experimental tokamak  under construction in France, and a snowflake configuration that could help dissipate the intense heat of the reaction more evenly around the vessel.\n  DeepMind’s AI was able to autonomously figure out how to create these shapes by manipulating the magnetic coils in the right way—both in the simulation and when the scientists ran the same experiments for real inside the TCV tokamak to validate the simulation. It represents a “significant step,” says Fasoli, one that could influence the design of future tokamaks or even speed up the path to viable fusion reactors. “It’s a very positive result,” says Yasmin Andrew, a fusion specialist at Imperial College London, who was not involved in the research. “It will be interesting to see if they can transfer the technology to a larger tokamak.”\n  Fusion offered a particular challenge to DeepMind’s scientists because the process is both complex and continuous. Unlike a turn-based game like Go, which the company has  famously conquered with its  AlphaGo AI, the state of a plasma constantly changes. And to make things even harder, it can’t be continuously measured. It is what AI researchers call an “under–observed system.”\n  “Sometimes algorithms which are good at these discrete problems struggle with such continuous problems,” says Jonas Buchli, a research scientist at DeepMind. “This was a really big step forward for our algorithm, because we could show that this is doable. And we think this is definitely a very, very complex problem to be solved. It is a different kind of complexity than what you have in games.”\n  This isn’t the first time artificial intelligence has been used to try to control nuclear fusion. Since 2014, Google has been working with California-based fusion company TAE Technologies to apply machine learning to a different type of fusion reactor—speeding up the analysis of experimental data. Research at the Joint European Torus (JET) fusion project in the UK has  used AI to try to predict the behavior of plasma. The concept even appears in fiction: In 2004’s  Spider-Man 2, villain Doc Ock creates an AI-powered, brain-controlled exoskeleton to  control his experimental fusion reactor, which works great until the AI takes over his mind and starts killing people.\n  All in all, the collaboration with DeepMind could prove most pivotal as fusion reactors get bigger. Although physicists have a good handle on how to control the plasma in smaller-scale tokamaks through conventional methods, the challenge will only increase as scientists try to make power-plant-sized versions viable. Progress has been slow but steady. Last week the JET project made a  breakthrough, setting a new record for the amount of energy extracted from a fusion project, and construction is ongoing at France’s ITER, an international collaboration which will become the world’s largest experimental fusion reactor when it fires up in 2025.\n “The more complex and high performance the tokamak, the greater the need to control more quantities with higher and higher reliability and accuracy,” says Dmitri Orlov, an associate research scientist at the Center for Energy Research in San Diego. An AI-controlled tokamak could be optimized to control the transfer of heat out of the reaction to the walls of the vessel and prevent damaging “plasma instabilities.” The reactors themselves could be redesigned to take advantage of the tighter control offered by reinforcement learning.\n Ultimately, Fasoli says, the collaboration with DeepMind could allow researchers to push the boundaries and accelerate the long journey toward fusion power. “AI would enable us to explore things that we wouldn’t explore otherwise, because we can take risks with this kind of control system we wouldn’t dare take otherwise,” he says. “If we are sure that we have a control system that can take us close to the limit but not beyond the limit, we can actually explore possibilities that wouldn’t otherwise be there for exploring.”\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2022-02-17 06:42:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,控制,trained", "title": "DeepMind训练了一种人工智能来控制核聚变", "title_en": "DeepMind Has Trained an AI To Control Nuclear Fusion", "transed": 1, "url": "https://www.wired.com/story/deepmind-ai-nuclear-fusion/", "via": "", "real_tags": ["人工智能", "控制", "trained"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一篇题为“Wii U&amp；Nintendo 3DS eShop停用”的帖子中，任天堂刚刚宣布，在2023年3月，这两个系统的在线店面将停止运营。\n-从2022年5月23日起，在Wii U或任天堂3DS系列系统上，使用信用卡向任天堂eShop账户中添加资金将不再可能。\n-截至2022年8月29日，在Wii U或任天堂3DS系列系统上，将不再能够使用任天堂eShop卡向任天堂eShop账户中添加资金。然而，在2023年3月底之前，仍然可以兑换下载代码。\n即使在2023年3月底之后，在可预见的未来，仍然有可能重新下载游戏和DLC，接收软件更新，并在Wii U和任天堂3DS系列系统上享受在线游戏。\n所有这些都是意料之中的事情。3DS和Wii U ten今年已经有11年的历史了，所以数字商店的关闭迟早会发生。然而，这些关闭尤其糟糕的是，这两个店面都为用户提供了购买和拥有任天堂有史以来最伟大的许多游戏的能力，自从该公司转向使用任天堂Switch Online的订阅模式以来，这在很大程度上是无法做到的。\n公司预见到了这一点。当这篇博文第一次发表时，一个相关的常见问题有以下交流：\n一旦无法在Wii U和任天堂3DS系列系统上购买任天堂eShop中的软件，过去平台上的许多经典游戏将不再可以在任何地方购买。你会以其他方式提供经典游戏吗？如果没有，为什么？任天堂难道没有义务通过不断地让人们购买来保护它的经典游戏吗？\n在我们的任天堂Switch在线会员计划中，目前有超过130款经典游戏可在不断增长的各种遗留系统库中使用。这些游戏通常会通过在线游戏等新功能进行增强。\n我们认为这是一种有效的方式，可以让众多玩家轻松获得经典内容。在这些库中，新玩家和长期玩家不仅可以找到他们记得或听说过的游戏，还可以找到其他他们可能没想过要寻找的有趣游戏。\n“我们目前没有以其他方式提供经典内容的计划，”这是一个令人难以置信的垃圾读物，因为在零情况下，基于订阅的模式是一个可以接受的替代实际拥有游戏的模式。\n尤其疯狂的是，在这本书出版后不久，任天堂就删除了Q&amp；从它的网站上下载。现在就去看看吧，“任天堂难道没有义务通过不断地让人们购买来保存它的经典游戏吗？”部分消失了。", "note_en": "In a post   titled “Wii U &amp; Nintendo 3DS eShop Discontinuation,” Nintendo just announced that in March 2023 the online storefronts for both systems will be ceasing operations.\n   - As of May 23, 2022, it will no longer be possible to use a credit card to add funds to an account in Nintendo eShop on Wii U or the Nintendo 3DS family of systems.\n - As of August 29, 2022, it will no longer be possible to use a Nintendo eShop Card to add funds to an account in Nintendo eShop on Wii U or the Nintendo 3DS family of systems. However, it will still be possible to redeem download codes until late March 2023.\n      Even after late March 2023, and for the foreseeable future, it will still be possible to redownload games and DLC, receive software updates and enjoy online play on Wii U and the Nintendo 3DS family of systems.\n  All of this is expected stuff. The 3DS is 11 years old this year and the Wii U ten, so digital store closures were always going to happen sooner or later. What’s shitty about these closures in particular, though, is that both shopfronts offered users the ability to purchase and then  own many of Nintendo’s greatest ever titles, something you’re now largely unable to do ever since the company switched to a subscription model with Nintendo Switch Online.\n  The company saw this coming. When the blog post was first made, an associated FAQ had the following exchange:\n Once it is no longer possible to purchase software in Nintendo eShop on Wii U and the Nintendo 3DS family of systems, many classic games for past platforms will cease to be available for purchase anywhere. Will you make classic games available to own some other way? If not, then why? Doesn’t Nintendo have an obligation to preserve its classic games by continually making them available for purchase?\n Across our Nintendo Switch Online membership plans, over 130 classic games are currently available in growing libraries for various legacy systems. The games are often enhanced with new features such as online play.\n We think this is an effective way to make classic content easily available to a broad range of players. Within these libraries, new and longtime players can not only find games they remember or have heard about, but other fun games they might not have thought to seek out otherwise.\n “We currently have no plans to offer classic content in other ways,” is an incredibly shitty thing to read, because under zero circumstances is a subscription-based model an acceptable substitution to actually  owning a game.\n  Especially wild, then, is the fact that not long after publishing this, Nintendo wiped that particular section of the Q&amp;A from its site.   Go and check it now and the “Doesn’t Nintendo have an obligation to preserve its classic games by continually making them available for purchase?” part is gone.", "posttime": "2022-02-17 06:40:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "任天堂,wii", "title": "任天堂（Nintendo）在2023年关闭了3DS和Wii U商店，“没有计划以其他方式提供经典内容”", "title_en": "Nintendo Closing 3DS and Wii U Shops In 2023, Has 'No Plans To Offer Classic Content In Other Ways'", "transed": 1, "url": "https://kotaku.com/nintendo-wii-u-3ds-classic-games-mario-zelda-eshop-shop-1848544931", "via": "", "real_tags": ["任天堂", "wii"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透2月16日电---纽约证券交易所（New York Stock Exchange）已申请注册&#34；纽约证券交易所&#34；对于一个不可替代代币（NFT）市场而言，更接近于建立加密货币和NFT的在线交易场所。\n去年围绕加密货币的炒作蔓延到了NFT，NFT是一种投机性投资，吸引了包括前美国第一夫人梅拉尼娅·特朗普和牙买加短跑选手大乌塞恩·博尔特在内的粉丝。\n参与该行业的公司也得到了权重股微软公司（Microsoft Corp.）和软银集团（SoftBank Group Corp.）的支持。\n如果纽约证券交易所推出一个新市场，它将与超级稀有、稀有和NFT markeplace巨头OpenSea竞争。OpenSea在最近一轮融资后估值为133亿美元。\n然而，纽约证券交易所的一位发言人表示，它目前没有推出加密货币或NFT交易的计划。\n&#34;（纽约证券交易所）定期考虑新产品及其对我们商标的影响，并相应地保护我们的知识产权；这位发言人补充说。\nNFT让很多人困惑，为什么这么多钱花在了物理上不存在的东西上。一些人还认为，这个行业已经被骗子饱和，往往会奖励低质量的病毒性艺术。\n纽约证券交易所在去年4月铸造了第一套NFT，以纪念6&#34；值得注意的是&#34；列表[ https://bit.ly/3gQiWPE]\n交易所&#39；s提交的文件表明，它也可以进入metaverse，因为它试图提供&#34；虚拟现实、增强现实和混合现实软件&#34；。\nMetaverse指可通过虚拟现实或增强现实耳机或计算机屏幕访问的共享、沉浸式数字环境。\n除了NFT，交易所还将提供&#34；为虚拟和数字资产、艺术品和#34；的买家、卖家和贸易商提供在线市场；，它在2月10日向美国专利商标局提交的一份文件中说。", "note_en": "Feb 16 (Reuters) - The New York Stock Exchange has filed an application to register the term &#34;NYSE&#34; for a marketplace for non-fungible tokens (NFTs), taking a step closer to setting up an online trading place for cryptocurrencies and NFTs.\n The hype around cryptocurrencies last year spilled over to NFTs, a form of speculative investment that has attracted fans including former U.S. first lady Melania Trump and Jamaican sprint great Usain Bolt.\n Companies involved in this sector have also been backed by heavyweights Microsoft Corp  (MSFT.O) and SoftBank Group Corp  (9984.T).\n  If the NYSE launches a new marketplace, it would compete with SuperRare, Rarible and NFT markeplace giant OpenSea, which was valued at $13.3 billion after its latest funding round.\n However, a spokesperson for the NYSE said it has no immediate plans to launch cryptocurrency or NFT trading.\n &#34;(The NYSE) regularly considers new products and their impact on our trademarks and protects our intellectual property rights accordingly,&#34; the spokesperson added.\n NFTs have left many baffled as to why so much money is spent on items that do not physically exist. Some also believe the industry is saturated by scammers and too often rewards viral art of low quality.\n The NYSE minted its first set of NFTs in April last year, commemorating the first trades of six &#34;notable&#34; listings. [ https://bit.ly/3gQiWPE]\n The exchange&#39;s filing indicates it could enter into the metaverse too, as it seeks to provide &#34;virtual reality, augmented reality and mixed reality software&#34;.\n Metaverse refers to shared, immersive digital environments which can be accessed via virtual reality or augmented reality headsets or computer screens.\n Besides NFTs, the exchange would also provide &#34;an online marketplace for buyers, sellers and traders of virtual and digital assets, artwork&#34;, it said in a  filing with the U.S. Patent and Trademark Office dated Feb. 10.", "posttime": "2022-02-17 06:38:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,商标,moves,nft", "title": "纽约证券交易所通过商标申请更接近NFT交易", "title_en": "NYSE Moves Closer To NFT Trading With Trademark Application", "transed": 1, "url": "https://www.reuters.com/technology/nyse-moves-closer-nft-trading-with-trademark-application-2022-02-16/", "via": "", "real_tags": ["交易", "商标", "moves", "nft"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073723, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在为Windows 11带来新的触摸手势、开始菜单文件夹、重新设计的任务管理器，以及更多的改进。今天，测试人员可以使用Windows 11的新版本，其中充满了新功能，看起来它们将显著提高Windows 11的整体可用性。\n新的“开始菜单”文件夹将允许Windows 11用户将“开始菜单”的固定部分自定义为文件夹。你可以将一个应用拖动到另一个应用上，创建一个文件夹，然后可以在文件夹中重新排列应用并将其删除。重命名文件夹的功能将在未来的测试版本中出现，但考虑到Windows 11在启动时没有很多方法来调整菜单设计，在“开始”菜单上看到更多的定制是件好事。\n如果你一直喜欢Windows 8中的手势，那么微软很快就会在Windows 11中推出五种新的触摸手势，这将使平板电脑的使用变得更简单。第一个功能是在任务栏上向上滑动以打开“开始”菜单，向下滑动以再次关闭它。您还可以在“开始”菜单上的“锁定”、“所有应用”和“推荐/更多”之间滑动。\n第三个新的触摸手势可以让你从任务栏右下角滑动以显示快速设置菜单——如果你需要快速切换飞行模式或访问蓝牙设置，这很有用。启动通知中心的动画也得到了改进，面向触摸的应用程序中有一个新的全屏抓取器，可以阻止你从平板电脑屏幕边缘意外滑动。微软还表示，在纵向和横向之间旋转设备会变得“更快”和“更灵敏”\n微软在Windows 11中的新快照布局功能也得到了改进，允许你将应用程序拖动到窗口顶部，并显示所有可以使用的布局。微软也在改进其聚焦功能，加入了一个“请勿打扰”模式。它使快速关闭通知变得容易得多，因此您只能看到优先级通知或警报通知。\n实时字幕将很快嵌入Windows 11，可以通过Winkey+CTRL+L快捷方式访问。现场字幕将使聋哑人或听力障碍者受益匪浅，但也可供任何人使用，并将在设备上根据包含音频的任何内容自动生成。字幕可以在窗口中浮动，也可以显示在屏幕的顶部或底部。这看起来对Windows 11的可访问性有很大的改进。\n其他改进包括在Windows11任务栏上拖放的功能。这是首次发布时缺失的一大部分，因此Windows 11用户将很高兴看到这一回归。微软还在文件资源管理器中更容易查看OneDrive存储，并改进了快速访问功能，使您可以锁定文件和文件夹。\n为了降低个人电脑的能耗，微软还在Windows 11的电源设置中更改睡眠和关机的默认值。只有当你清洁安装Windows 11时，你才能看到这些新设置，但未来的新PC可能会附带更积极的睡眠/屏幕关闭选项。\n最后但并非最不重要的一点是，Windows 11中任务管理器的重新设计现在是正式的。它包括一个新的命令栏和一个黑色主题，以及一个可以限制应用程序消耗系统资源的效率模式。\n和往常一样，这些新的Windows 11功能目前只在测试中，这意味着其中一些功能可能会在2022年的每月更新中出现。微软刚刚发布了Windows 11的第一次大更新，该公司透露，它不会等待每年只推出一次新功能。", "note_en": "Microsoft is bringing new touch gestures, Start menu folders, a redesigned Task Manager, and lots more improvements to Windows 11. A new build of Windows 11 is  available to testers today, and it’s full of new features that look like they will significantly improve the usability of Windows 11 overall.\n The new Start menu folders will allow Windows 11 users to customize the pinned section of the Start menu into folders. You drag an app on top of another to create a folder, and you can rearrange apps within folders and remove them. The ability to rename folders is coming in future test builds, but it’s good to see more customization on the Start menu, given Windows 11 launched without many ways to tweak the menu design.\n   If you’ve always been a fan of the gestures in Windows 8, Microsoft is bringing five new touch gestures to Windows 11 soon that will make using tablets a little easier. The first is the ability to swipe up on the taskbar to bring up the Start menu and swipe down to dismiss it again. You’ll also be able to swipe between pinned, all apps, and recommended / more on the Start menu.\n The third new touch gesture lets you swipe from the bottom right of the taskbar to show the Quick Settings menu — useful if you need to toggle airplane mode quickly or access Bluetooth settings. The animations for bringing up the Notification Center have also been improved, and there’s a new full-screen gripper in touch-oriented apps that will stop you accidentally swiping from the edges of a tablet screen. Microsoft also says rotating your device between portrait and landscape orientation is getting “snapper” and “more responsive.”\n   Microsoft’s new Snap Layouts feature in Windows 11 is also getting improved, allowing you to drag an app to the top of a window and reveal all the layouts you can use. Microsoft is also improving its Focus feature to include a Do Not Disturb mode. It makes it a lot easier to quickly silence notifications, so you only see priority ones or ones for alarms.\n Live Captions will soon be built into Windows 11, accessible from a Winkey + CTRL + L shortcut. Live Captions will greatly benefit people who are deaf or hard of hearing, but they’re also available for anyone to use and will be automatically generated on-device from any content that includes audio. Captions can float in a window or be displayed at the top or bottom of a screen. This looks like a great accessibility improvement to Windows 11.\n     Other improvements on the way include the ability to drag and drop on the Windows 11 taskbar. This was a big missing part of the initial launch, so Windows 11 users will be happy to see this return. Microsoft is also making it easier to see your OneDrive storage within File Explorer and improving the Quick Access feature to let you pin files as well as folders.\n In a push to reduce energy consumption on PCs, Microsoft is also changing the default values for sleep and screen off in the power settings in Windows 11. You’ll only see these new settings if you clean install Windows 11, but new PCs in the future will presumably ship with more aggressive sleep / screen off options.\n   Last but not least, the Task Manager redesign in Windows 11 is now official. It includes a new command bar and a dark theme, alongside an efficiency mode that lets you limit apps from consuming system resources.\n As always, these new Windows 11 features are only in testing right now, which means some of them will likely show up in monthly updates throughout 2022. Microsoft just delivered  Windows 11’s first big update, and the company revealed it won’t wait to bring new features just once a year.", "posttime": "2022-02-17 06:36:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,手势,gestures,功能", "title": "Windows 11正在获得新的触摸手势、开始菜单和文件夹", "title_en": "Windows 11 is Getting New Touch Gestures, Start Menu Folders", "transed": 1, "url": "https://www.theverge.com/2022/2/16/22937573/microsoft-windows-11-start-menu-folders-new-touch-gestures-features", "via": "", "real_tags": ["windows", "手势", "gestures", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿尔伯特·爱因斯坦（Albert Einstein）的广义相对论对我们的现实充满了奇怪的见解，但也许最令人难以置信的是，强大的引力场或极高的速度会扭曲时间的流逝，这种效应被称为时间膨胀。例如，由于地球引力对时间的扭曲效应，航天器上的时钟比地球上的时钟滴答声稍快。\n现在，在一项重大突破中，吉拉的科学家们在国家标准与技术研究所和科罗拉多大学博尔德分校的联合行动中，用世界上最精确的时钟测量了时间膨胀的最小规模。研究小组发现，由于地球引力的影响，相距仅一毫米（约一个铅笔头的宽度）的时钟显示的时间略有不同。\n这项新的实验为时钟的精度达到当今可用时钟的50倍铺平了道路，可以用于许多实际应用，同时也揭示了关于我们宇宙的基本奥秘，根据周三发表在《自然》杂志上的一项研究，包括长期寻求的“广义相对论与量子力学的结合”。\n这项研究的合著者、JILA物理学家叶军（Jun Ye）在一次电话采访中说：“当你使用如此小的规模时，这意味着什么？这意味着时钟精度更好。”。“从某种意义上说，我们想说的是时间和空间是相互联系的。正如爱因斯坦的相对论告诉我们的，时间就是空间，空间就是时间，时间是相对的。没有绝对的时间概念。”\n几年来，叶和他在JILA的同事一直在通过设计更加精确的原子钟来推动计时和广义相对论的前沿。在这些时钟中，摆锤的作用是通过原子中电子的移动频率来发挥的，这些原子被仔细排列在晶格中，以控制其混沌能量和运动。这些创新使原子钟成为迄今为止设计的最精确的计时器，能够在150亿年内损失一秒钟，这就是为什么它们被用于全球定位服务（GPS）卫星和其他需要超精密时间的系统。\n2010年，JILA的科学家们用这些时钟测量了海拔相差33厘米（约1英尺）的两点的时间膨胀，这在当时是一个很大的进步。经过十年的时间微调，叶和他的同事们成功地跟踪了10万个极冷锶原子样本中的频率变化，使他们能够捕捉到前所未有的毫米级膨胀效应。\n更重要的是，该团队成功地让这些原子在37秒的时间内保持完美的一致性，创造了“量子相干”持续时间的新纪录，也就是这些原子的行为可以预测的状态。\n“第一天，当我们能够看到这么长的连贯时间时，我们简直不敢相信，”叶回忆道。“量子相干性听起来非常微观。原子向你揭示了电子是如何围绕原子核运动的，等等。但是想到37秒，几乎一分钟，这是一个非常宏观的时间尺度，一个‘人类’的时间尺度，这是难以置信的。”\n“当我和学生们交谈时，我说：‘这是我有生以来第一次想象我喝咖啡时原子以连贯的方式来回跳动，’他接着说。“归根结底，实际上，这就是我们现在谈论的量子革命的本质。将非常微观的量子现象纳入宏观世界观是非常有趣的。”\n把这个奇异的量子世界带到我们更熟悉的环境中，可以帮助科学家探索科学中一些最大的开放性问题。例如，几十年来，研究人员一直试图让管理恒星和星系的大规模宇宙的广义相对论与量子力学一致，量子力学在原子内部的微小领域设定规则。随着原子钟变得越来越精确，科学家们将能够在经典世界和量子世界发生冲突的时空曲率上看到原子波。\n“如果我们做到这一点，这是最基本的，”叶说。“这是我们从未探索过的物理学领域。”叶补充说，如果这些时钟可以再提高20倍，“我们将进入一个非常非常有趣的领域”，这将“在量子力学最终与广义相对论相遇时产生新的见解”\n除了这些关于我们现实的基本性质的新发现之外，越来越精确的时钟正在激发一系列几乎无穷无尽的潜在应用，从火山爆发的预测到海平面上升的测量，再到深空任务。\n叶说：“整个地球是一个有生命的身体，它在非常活跃地运动。”。“当你谈论全球变暖和不断变化的地球时，我们需要更好的工具来监测正在发生的事情。你可以使用时钟来实际测量地球的变化，因为时间和空间是内在联系的。”\n“我们经常喜欢开玩笑：‘我们健康地生活了一百年，在这段时间里，你的大脑比你的脚衰老快半微秒左右，’”他说。“从生物学的角度来看，这是一分钟，谁会在我的百年生命中关心半微秒呢？但它在测量地球如何变化，以及测量我们最终如何驾驶载人或无人驾驶的飞行器在火星或其他遥远的行星上着陆方面起着至关重要的作用。这一切都是基于这种精确的时间安排。”信息\"\n注册即表示您同意使用条款和隐私政策&amp；接收来自Vice Media Group的电子通信，其中可能包括市场推广、广告和赞助内容。", "note_en": "Albert Einstein’s theory of general relativity is packed with weird insights about our reality, but perhaps the most mind-boggling is the fact that strong gravitational fields or incredibly high speeds can warp the passage of time, an effect known as time dilation. For instance, clocks located onboard spacecraft tick slightly faster than those on Earth, due to the distortive effects of our planet’s gravity on time.\n    Now, in a major breakthrough, scientists at JILA, a joint operation between the National Institute of Standards and Technology and the University of Colorado Boulder, have measured time dilation at the smallest scale ever using the most accurate clocks in the world. The team showed that clocks located just a millimeter apart—about the width of a pencil tip—showed slightly different times due to the influence of Earth’s gravity.\n  The new experiment paves the way toward clocks with 50 times the precision of those available today, which could be used for a host of practical applications, while also shedding light on fundamental mysteries about our universe, including the long-sought “union of general relativity and quantum mechanics,” according to  a study published on Wednesday in  Nature.\n  “When you go to such a small scale, what does that mean? It means that the clock precision is better,” said Jun Ye, a JILA physicist who co-authored the study, in a call. “In some sense, what we are trying to say is that time and space are interconnected. As Einstein&#39;s relativity told us, time is space, space is time, and time is relative. There&#39;s no absolute concept of time.”\n  Ye and his colleagues at JILA have been pushing the frontiers of timekeeping and general relativity for several years by designing ever-more accurate atomic clocks. The role of the pendulum in these clocks is played by the shifting frequency of electrons in atoms that are carefully arrayed in lattices designed to control their chaotic energy and motion. These innovations distinguish atomic clocks as being by far the most accurate timekeepers ever devised, capable of losing just one second over 15 billion years, which is why they are used on Global Positioning Service (GPS) satellites and other systems that require hyper-precise time.\n    In 2010, JILA scientists used these clocks to measure time dilation at two points with a difference in elevation of 33 centimeters (roughly a foot), which was a big advance at that point. After a decade of fine-tuning their clocks, Ye and his colleagues have managed to track frequency shifts within a sample of 100,000 extremely cold strontium atoms, enabling them to snag the unprecedented millimeter-scale effects of dilation.\n   What’s more, the team managed to keep these atoms dancing in perfect unison for 37 seconds, setting a new record for the duration of “quantum coherence,” or the state in which the behavior of these atoms can be predicted.\n  “The first day, when we were able to start to see this long coherence time, we couldn&#39;t believe it,” Ye recalled. “Quantum coherence sounds very microscopic. The atom is revealing to you how electrons are moving around the nucleus, and so on. But it&#39;s incredible to think of 37 seconds, almost a minute—that’s a very macroscopic timescale, a ‘human being’ timescale.”\n  “When I was talking to my students, I said: ‘This is the first time in my life that I can imagine my atom ticking back and forth in a coherent fashion while I drink a cup of coffee,” he continued. “In the end, actually, this is the essence of this quantum revolution we are talking about now. It&#39;s fascinating to bring quantum phenomena, which is something very microscopic, into the worldview of the macroscopic.”\n     Bringing this bizarre quantum world into our more familiar surroundings can help scientists pursue some of the biggest open questions in science. For instance, researchers have tried for decades to make general relativity, which governs the large-scale cosmos of stars and galaxies, agree with quantum mechanics, which sets the rules in the tiny realm inside atoms. As atomic clocks become ever more accurate, scientists will be able to actually see the waves of atoms across the curvature of spacetime, where the classical and quantum worlds clash.\n  “That is fundamental as it gets, if we get to that point,” Ye said. “That&#39;s an area of physics that we have never explored.” If these clocks can be improved by another factor of 20, Ye added, “we get into a very, very interesting regime” that will yield “new insights when quantum mechanics finally meets up with general relativity.”\n  Beyond these new discoveries about the basic nature of our reality, the increasingly accurate clocks are inspiring a virtually endless list of potential applications that range from predictions of volcanic eruptions, to measurements of sea level rise, to deep space missions.\n  “The entire Earth is a living body; it&#39;s moving around very actively,” Ye said. “When you are talking about global warming and the changing Earth, we need better tools to be able to monitor what&#39;s going on. You can use clocks to actually measure the change in Earth because time and space are intrinsically connected.”\n  “We often like to make a joke: ‘We live a healthy life of a hundred years and during that period, your head ages a little faster than your feet by about half a microsecond,” he noted. “It’s minute on a biological scale—who cares about half a microsecond over a hundred years of my lifetime? But it makes all the difference in terms of measuring how the Earth is changing, and measuring how eventually, we can drive manned or unmanned vehicles to land on Mars or other distant planets. It&#39;s all based on this precise timing of information.”\n  By signing up, you agree to the  Terms of Use and  Privacy Policy &amp; to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.", "posttime": "2022-02-17 06:33:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,翘曲,breakthrough,时间", "title": "科学家们在有史以来最小规模的翘曲时间方面取得突破", "title_en": "Scientists Make Breakthrough In Warping Time At Smallest Scale Ever", "transed": 1, "url": "https://www.vice.com/en/article/jgmbdg/scientists-make-breakthrough-in-warping-time-at-smallest-scale-ever", "via": "", "real_tags": ["科学家", "翘曲", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NASA、NOAA、USGS和其他美国政府机构预测，未来30年海洋高度的上升可能相当于过去100年的总上升。", "note_en": "NASA, NOAA, USGS, and other U.S. government agencies project that the rise in ocean height in the next 30 years could equal the total rise seen over the past 100 years.", "posttime": "2022-02-17 06:32:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "报告,report,上升", "title": "跨部门报告发现，到2050年，海平面将上升到1英尺", "title_en": "Sea Level To Rise Up To a Foot by 2050, Interagency Report Finds", "transed": 1, "url": "https://www.nasa.gov/feature/jpl/sea-level-to-rise-up-to-a-foot-by-2050-interagency-report-finds", "via": "", "real_tags": ["报告", "report", "上升"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "アカマイはこの買収について、本日2.月15日午後4.時30分（米国東部時間）より開催される第4.四半期および二千零二十一年末の財務結果に関するカンファレンスコールで説明する予定です。\nマサチューセッツ州ケンブリッジ、2022年2.月15日 -  Akamai技术公司(マサチューセッツ州ケンブリッジ - 2022年2.月15日 - デジタル体験を強化・保護する世界で最も信頼されているソリューションを提供するアカマイ・テクノロジーズ（纳斯达克：AKAM）は本日、最も使いやすく、最も信頼されているインフラ-作为服务（IaaS）プラットフォーム・プロバイダーのひとつである 利诺德を買収する正式契約を締結したと発表しました。\nメタバースのような仮想環境を含む現代のデジタル体験は、メディア、エンターテインメント、テクノロジー、Eコマース、金融サービス、オンラインゲームなどの融合によって生み出されています。アカマイは、今日のマルチクラウド、マルチプラットフォームの世界でアプリケーションを強化、保護することで、数十年にわたりこれらの業界の世界的リーダーの重要なパートナーとなってきました。開発者がクラウドコンピューティングを利用できるよう、シンプルで手頃な価格でアクセスできるようにした 利诺德と共に、アカマイはクラウドからエッジまで、世界で最も分散された計算プラットフォームとなるでしょう。\n「利诺德」の開発者フレンドリーなクラウドコンピューティング機能と、市場をリードするアカマイのエッジプラットフォームおよびセキュリティサービスを組み合わせる機会は、アカマイにとって大きな変革をもたらすものです」と、アカマイ・テクノロジーズの最高経営責任者兼共同創立者のトム・レイトン博士は語っています。「アカマイは 20年以上にわたってエッジコンピューティングビジネスの先駆者であり続けていますが、今日、クラウドからエッジまでのアプリケーションを構築、実行、および保護するための独自のクラウドプラットフォームを構築することで、当社の進化の新たな章を始めることができました。これは、前例のないスケール、リーチ、パフォーマンス、信頼性、およびセキュリティを提供するプラットフォーム上でアプリケーションを構築できるようになる開発者にとって大きな勝利です。\n利诺德社の創業者兼总裁である克里斯托弗·阿克我々は19年前、クラウドの力をより簡単に、より利用しやすくするために利诺德社を設立しました。その過程で、世界中の開発者や企業から信頼されるクラウドコンピューティングプラットフォームを構築してきました。今日、これらのお客様は、クラウドサービスがコアからエッジまでのコンピュート、ストレージ、セキュリティ、デリバリを含む包括的なものになるにつれ、新たな課題に直面しています。これらの課題を解決するには、膨大な統合とスケールが必要ですが、アカマイと 利诺德はそれをひとつの屋根の下で実現しようとしています。これは 利诺德にとってエキサイティングな新章であり、現在および将来のお客様にとって大きな前進となります。&#34;\nこの契約に基づき、アカマイは 利诺德有限责任公司の発行済株式のすべてを、慣習的な購入価格の調整後、約 9億ドルで取得することに合意しました。この取引を資産購入として構成した結果、アカマイは今後 15年間で推定正味現在価値約 1.億 2,000 万ドルの現金による所得税の節税効果を期待しています。この取引は 2022年の第 1.四半期に完了する予定で、慣習的な完了条件が適用されます。\n2022年度については、利诺德の買収により約1.億ドルの収益が追加され、非公认会计原则ベースのEPSに約0.05ドルから0.06ドルのわずかなプラス効果がもたらされると予想されます。アカマイは、利诺德に関する詳細、二千零二十一年第 4.四半期および年度末の財務結果、ならびに通期ガイダンスについて、本日 2022年2.月15日午後 4.時 30分（米国東部時間）より開催される同社の収益電話会議で説明します。\nPJT合作伙伴はアカマイの財務アドバイザーを、威尔默黑尔は法律顧問を務めました。 利诺德では、DH Capitalが財務アドバイザーを、莱瑟姆酒店；沃特金斯が法律顧問を務めました。\n本日2.月15日（火）午後4.時30分（日本時間）よりコンファレンスコールを実施予定\nアカマイは、本日2022年2.月15日午後4.時30分（米国東部時間）より開催される第4.四半期および二千零二十一年末の財務結果のカンファレンスコールにおいて、利诺德の買収について説明します。この電話会議には、経営陣による将来の見通しに関する財務ガイダンスが含まれる可能性があります。この電話会議には、カンファレンス身份证件番号7579719を用いて、(844) 578-9671 (国際電話の場合は508) 637-5655でアクセスできます。また、この電話会議のライブ・ウェブキャストとスライドは、www.akamai。通用域名格式の「投资者关系」セクションでご覧いただけます。また、会議終了後 2.週間にわたり、アカマイのウェブサイト、または電話番号 855-859-2056（国際電話の場合は 404-537-3406）、会議 身份证件番号 7579719で電話による通話の再放送が可能です。\nアカマイは、米国で一般に認められた会計原則（公认会计原则）に基づく財務指標に加え、公认会计原则に基づいて作成されていない（非公认会计原则）追加の財務指標を提供しています。経営陣は、会計期間中の営業成績の理解および比較、財務および業務上の意思決定、計画および予測の目的、役員報酬の測定、およびアカマイの財務実績の評価のために、公认会计原则に基づく財務指標に加えて、非公认会计原则による財務指標を使用しています。このリリースで使用されている非 公认会计原则型の財務指標は、希薄化後 1.株当たりの非 公认会计原则型純利益です。\n経営陣は、この非 公认会计原则型の財務指標は、会計期間間および同業他社との財務結果の比較を容易にすることから、事業の傾向を意味のある形で比較および分析できるように、アカマイの継続的な事業を反映していると考えています。また経営陣は、この非 公认会计原则型の財務指標により、投資家が経営陣と同じ方法でアカマイの経営結果や将来の見通しを評価できると考えています。非 公认会计原则型の希薄化後 1.株当たりの純利益は、異常な性質のもの、まれなもの、またはアカマイの継続的な経営結果を反映していない可能性のある費用や利益を除外しています。\nこの非 公认会计原则財務指標は、アカマイの 公认会计原则財務結果の表示に取って代わるものではなく、公认会计原则に基づいて表示されるアカマイの財務結果の代替としてではなく、補足としてのみ使用されるべきものです。過去の非 公认会计原则指標について、アカマイは財務報告および投資家向けプレゼンテーションで使用された各非 公认会计原则財務指標と最も直接的に比較できる 公认会计原则財務指標との調整を提示しています。これらの調整は、アカマイのウェブサイトの投資家向け情報セクションにある「一般公认会计原则」と非 公认会计原则財務指標の調整」という見出しでご覧いただけます。\nアカマイは、ガイダンスおよび将来のパフォーマンスに関する期待の表明という形で、将来の見通しに関する記述を提供しています。これらの将来の見通しに関する記述は非 公认会计原则ベースで提供されており、非 公认会计原则指標から除外する項目に影響を与える事象の量や時期が予測できないため、不合理な努力をせずに最も近い 公认会计原则指標に調整することはできません。例えば、株式ベースの報酬は、アカマイのパフォーマンスベースのアワードについては予測不可能であり、パフォーマンスベースのターゲットの将来の達成に関する現在の予想に基づいて大きく変動する可能性があります。無形資産の償却、買収関連費用、および構造改革費用はすべて、予測が困難な将来の潜在的な行動のタイミングと規模によって影響を受けます。さらに、アカマイは随時、発生頻度の低い特定の項目を除外していますが、これも本質的に予測や見積もりが難しいものです。また、除外する項目の税効果を予測することや、税務監査の解決や税法の変更など、特定の個別の税項目を推定することも困難です。このように、非公认会计原则方式の予測から除外される費用を予測することは困難であり、調整や結果の範囲を示すことは、不正確で誤解を招く可能性のある開示につながる可能性があります。除外項目のいずれかに重要な変更があった場合、当社のガイダンスおよび将来の公认会计原则ベースの業績に大きな影響を与える可能性があります。\nこのプレスリリースで使用された非 公认会计原则指標に関するアカマイの定義を以下に示します。\n希薄化後1.株当たりの非 公认会计原则型純利益 - 非 公认会计原则型純利益を加重平均希薄化後発行済普通株式で割ったもの。希薄化後の加重平均発行済み株式は、非 公认会计原则型の 1.株当たりの計算において、2027年および 2025年をそれぞれ期日とする 1,150 百万ドルの転換社債型上級ノートの発行に関連して締結されたノート・ヘッジ取引に従ってアカマイに交付される予定の株式を考慮して調整されています。公认会计原则では、ヘッジ取引に基づいて交付された株式は、交付されるまで完全希薄化後の株式計算において相殺された株式とはみなされません。しかし、当社はノートのヘッジ取引から利益を得ており、希薄化の発生を認めていないため、経営陣はこの利益を調整することで営業成績を意味あるものにすることができると考えています。2027年および2025年の各年限の転換社債型新株予約権付社債に関しては、アカマイの加重平均株価が当初の転換価格であるそれぞれ116.18ドルおよび95.10ドルを超えない限り、公认会计原则と非 公认会计原则の希薄化後加重平均普通株式の発行数に差は生じません。\n非 公认会计原则型純利益 - 公认会计原则型純利益に以下の税影響項目を調整したものです：買収した無形資産の償却、株式ベースの報酬、資産化された株式ベースの報酬の償却、買収関連費用、再構築費用、法的解決に伴う利益および損失、アカマイ基金への寄付に関連して発生した費用、負債の割引および発行費用の償却、資産化された利息費用の償却、投資に関する特定の利益および損失、持分法投資からの利益および損失、および時折発生するその他の非経常的または異常な項目。\n非 公认会计原则型の調整、および非 公认会计原则型の財務指標からそれらを除外するためのアカマイの根拠は、以下のとおりです。\n買収した無形資産の償却 - アカマイは、これまでに実施した様々な買収に関連して、公认会计原则方式の財務諸表に含まれる無形資産の償却を実施しました。買収の購入価格のうち無形資産に割り当てられた金額および関連する償却の期間は大幅に変化する可能性があり、各買収に固有のものです。そのためアカマイは、買収前後の営業成績を比較するための一貫した根拠を投資家に提供するために、非 公认会计原则財務指標から買収無形資産の償却を除外しています。\n株式ベースの報酬および資産化された株式ベースの報酬の償却 - 株式ベースの報酬は、アカマイの従業員に支払われる報酬の重要な側面ですが、付与日の公正価値は、付与時の株価、さまざまな評価方法、主観的な仮定、およびアワードの種類の多様性に基づいて変化します。このため、アカマイの現在の財務結果と過去および将来の期間との比較の解釈が難しくなっています。したがって、アカマイは、アカマイのコアビジネスのパフォーマンスを強調し、多くの投資家がアカマイのパフォーマンスを評価して同業他社と比較する方法と一致させるために、株式ベースの報酬および資産化された株式ベースの報酬の償却を非 公认会计原则財務指標から除外することが有益であると考えています。\n買収関連コスト - 買収関連コストには、取引手数料、アドバイザリー費用、デューデリジェンス費用、および戦略的活動に関連するその他の直接費用が含まれます。また、特定の買収に関連した偶発的な対価や補償金のアカマイの当初の推定額に対するその後の調整も、買収関連コストに含まれます。これらの金額は、買収のタイミングや規模によって影響を受けます。アカマイは、アカマイの営業成績を過去の期間や同業他社と比較する際に役立つよう、非 公认会计原则型の財務指標から買収関連コストを除外していますが、これはこのような金額が買収取引の規模に応じて大きく変化し、アカマイの中核業務を反映していないためです。\n構造改革費用 - アカマイは、当社の事業範囲または事業運営方法を大幅に変更したプログラムにより、構造改革費用を計上しました。これらの費用には、人員削減のための退職金および関連費用、事業で使用されなくなった長期性資産（使用権資産、その他の施設関連の有形固定資産、および内部使用ソフトウェアを含む）の減損、およびこれらのプログラムの一環として取り消された契約の解約料が含まれます。このような項目は再構築の規模によって大きく異なり、将来予想される営業費用を反映していないため、アカマイは継続事業の業績を評価する際に、非 公认会计原则型の財務指標からこれらの項目を除外しています。さらに、これらの費用は、同社の事業の現在または過去の運営の基礎について、必ずしも意味のある洞察を与えるものではありません。\n債務割引および発行費用の償却、ならびに資本化された支払利息の償却 - 2019年8.月、アカマイは2027年満期の1,150百万ドルの転換社債型シニアノートを発行しました（クーポン金利は0.375％）。2018年5.月、アカマイは1,150百万ドルの2025年満期の転換社債型シニア・ノートを発行し、クーポン金利は0.125%でした。これらの転換型シニアノートの帰属金利は、それぞれ3.10%および4.26%でした。これは、公认会计原则基準では持分法として個別に会計処理することが要求されている転換機能について、デット・ディスカウントを計上した結果、転換社債の帳簿価額が減少したことによるものです。この債務割引は、債務の発行費用と合わせて支払利息として償却されます。アカマイの非 公认会计原则型の結果から除外された支払利息は、これらの非現金要素で構成されており、経営陣はこの非現金費用が継続的な営業実績を代表するものではないと考えているため、同社の営業実績に関する経営陣の評価から除外されています。\n投資の損益 - アカマイは、特定の投資の処分、公正価値の変動、および減損による損益を計上しています。アカマイは、これらの損益をもたらしたイベントの種類がアカマイのコアビジネスの運営や継続的な営業実績を代表するものではないため、非 公认会计原则型の財務指標からこれらの金額を除外することは投資家にとって有益であると考えています。\n法的和解 - アカマイは法的問題の解決に関連して損失を被りました。これらの金額が発生した事象のタイプはアカマイの中核事業を代表するものではないため、非 公认会计原则型の財務指標からこれらの金額を除外することは、投資家にとって有益であるとアカマイは考えています。\nアカマイ基金の基金化 - アカマイは、数学と科学の教育を支援することで次世代のテクノロジー革新者を奨励することを目的とした民間企業基金であるアカマイ基金の基金化のための費用を負担しました。アカマイの最初の基金設立は2018年で、アカマイ基金が活動範囲を拡大できるようにするための恒久的な基金を可能にするためでした。2020年の第4.四半期には、テクノロジー業界の多様性を高めるための特定のイニシアティブを可能にするために、アカマイは基金を補充しました。アカマイは、これらの頻繁に発生しない、ほぼ 1.回限りの費用は同社の中核事業を代表するものではないため、これらの金額を非 公认会计原则財務指標から除外することは投資家にとって有益であると考えています。\n持分法投資からの損益 - アカマイは、持分法投資からの収益および損失のシェアについて損益を計上しています。アカマイは、投資先の運営を直接管理しておらず、関連する損益が同社の中核事業を代表するものではないため、このような損益を除外しています。\n非公认会计原则基準の調整および特定の個別税項目の税効果-上述の非公认会计原则基準の調整は税引前で報告されています。非公认会计原则基準の調整による税効果は、公认会计原则基準と非公认会计原则基準の法人税費用の差額です。非 公认会计原则法人税費用は、非 公认会计原则税引前利益（非 公认会计原则調整で調整された 公认会计原则税引前利益）に対して計算され、特定の個別税項目（評価引当金の計上や解除など）がある場合はそれを除外します。アカマイは、非公认会计原则調整およびその関連税効果を適用することで、中核事業に帰属する所得を強調することができると考えています。\n私募証券訴訟改革法に基づくアカマイの声明\nこのプレスリリースおよび本日遅くに予定されている決算説明会の電話会議には、1995年私募証券訴訟改革法の免責条項に基づき、将来の見通しに関する記述による、アカマイの経営に関する将来の予測、計画、および見通しに関する情報が含まれており、これには将来の財務実績および計画された 利诺德の買収の利点に関する記述が含まれています。実際の結果は、以下を含む様々な重要な要因により、これらの将来見通しに関する記述で示された内容と大きく異なる可能性があります。過年度と同レベルの現金を継続的に創出できないこと、利诺德社との取引を適時または全く完了できないこと、利诺德社との取引から期待される利益が実現するかどうかについての不確実性。利诺德のテクノロジーがアカマイの既存テクノロジーと期待通りに相互運用できるかどうかを含め、利诺德のビジネスがアカマイのビジネスとうまく統合されるかどうかの不確実性；提案されている取引の発表が、利诺德の主要な顧客、ベンダー、および従業員との関係を維持する能力に与える影響。技術革新への投資が市場に受け入れられるソリューションを生み出せないこと、過去と同じ割合で収益を増加させ、収益を上回る割合で費用を増加させることができないこと、進行中の2019冠状病毒疾病パンデミックの影響、当社製品または信息技术システムの欠陥または混乱、当社が買収したものの統合がうまくいかないこと。新しいサービスや機能の開発の遅れや失敗、開発されたとしても、そのようなサービスや機能が市場に受け入れられないことや、そのようなソリューションが期待通りに機能しないこと、その他、当社が秒に定期的に提出する年次報告書（フォーム10-K）四半期報告書（フォーム10-Q）およびその他の文書に記載されている要因などがあります。\nさらに、このプレスリリースおよびこのような投資家向け電話会議での声明は、このプレスリリースの日付時点でのアカマイの期待と信念を表しています。アカマイは、その後の出来事や進展により、これらの期待や見解が変更される可能性があることを予期しています。しかし、アカマイは将来の見通しに関する記述を将来のある時点で更新することを選択する可能性がありますが、その義務を負わないことを明確にします。これらの将来の見通しに関する記述は、このプレスリリースの日付以降のいかなる時点においても、アカマイの期待や信念を表すものとして依拠されるべきではありません。\nアカマイについて アカマイはオンライン生活を強力にサポートし、保護しています。世界中の最も革新的な企業が、デジタル体験の保護と配信のためにアカマイを選択し、何十億もの人々の生活、仕事、遊びを日々サポートしています。世界最大規模で最も信頼されているエッジプラットフォームにより、アカマイはアプリケーション、コード、および体験をユーザーの近くに、そして脅威をより遠くに配置します。アカマイのセキュリティ、コンテンツデリバリー、およびエッジコンピュートの製品とサービスについては、 www.akamai。com、博客。akamai。com、または 啁啾や 领英で Akamai技术をフォローしてください。\n吉娜·索里奇メディアリレーションズ 646-320-4107[受电子邮件保护]", "note_en": "アカマイはこの買収について、本日2月15日午後4時30分（米国東部時間）より開催される第4四半期および2021年末の財務結果に関するカンファレンスコールで説明する予定です。\n マサチューセッツ州ケンブリッジ、2022年2月15日 -  Akamai Technologies, Inc.(マサチューセッツ州ケンブリッジ - 2022年2月15日 - デジタル体験を強化・保護する世界で最も信頼されているソリューションを提供するアカマイ・テクノロジーズ（NASDAQ：AKAM）は本日、最も使いやすく、最も信頼されているインフラ-as-a-service (IaaS) プラットフォーム・プロバイダーのひとつである Linode を買収する正式契約を締結したと発表しました。\n メタバースのような仮想環境を含む現代のデジタル体験は、メディア、エンターテインメント、テクノロジー、E コマース、金融サービス、オンラインゲームなどの融合によって生み出されています。アカマイは、今日のマルチクラウド、マルチプラットフォームの世界でアプリケーションを強化、保護することで、数十年にわたりこれらの業界の世界的リーダーの重要なパートナーとなってきました。開発者がクラウドコンピューティングを利用できるよう、シンプルで手頃な価格でアクセスできるようにした Linode と共に、アカマイはクラウドからエッジまで、世界で最も分散された計算プラットフォームとなるでしょう。\n 「Linode の開発者フレンドリーなクラウドコンピューティング機能と、市場をリードするアカマイのエッジプラットフォームおよびセキュリティサービスを組み合わせる機会は、アカマイにとって大きな変革をもたらすものです」と、アカマイ・テクノロジーズの最高経営責任者兼共同創立者のトム・レイトン博士は語っています。「アカマイは 20 年以上にわたってエッジコンピューティングビジネスの先駆者であり続けていますが、今日、クラウドからエッジまでのアプリケーションを構築、実行、および保護するための独自のクラウドプラットフォームを構築することで、当社の進化の新たな章を始めることができました。これは、前例のないスケール、リーチ、パフォーマンス、信頼性、およびセキュリティを提供するプラットフォーム上でアプリケーションを構築できるようになる開発者にとって大きな勝利です。\n Linode社の創業者兼CEOであるChristopher Aker 、「我々は19年前、クラウドの力をより簡単に、より利用しやすくするためにLinode社を設立しました。その過程で、世界中の開発者や企業から信頼されるクラウドコンピューティングプラットフォームを構築してきました。今日、これらのお客様は、クラウドサービスがコアからエッジまでのコンピュート、ストレージ、セキュリティ、デリバリを含む包括的なものになるにつれ、新たな課題に直面しています。これらの課題を解決するには、膨大な統合とスケールが必要ですが、アカマイと Linode はそれをひとつの屋根の下で実現しようとしています。これは Linode にとってエキサイティングな新章であり、現在および将来のお客様にとって大きな前進となります。&#34;\n この契約に基づき、アカマイは Linode Limited Liability Company の発行済株式のすべてを、慣習的な購入価格の調整後、約 9 億ドルで取得することに合意しました。この取引を資産購入として構成した結果、アカマイは今後 15 年間で推定正味現在価値約 1 億 2,000 万ドルの現金による所得税の節税効果を期待しています。この取引は 2022 年の第 1 四半期に完了する予定で、慣習的な完了条件が適用されます。\n 2022年度については、Linode の買収により約1億ドルの収益が追加され、非GAAPベースのEPSに約0.05ドルから0.06ドルのわずかなプラス効果がもたらされると予想されます。アカマイは、Linode に関する詳細、2021年第 4 四半期および年度末の財務結果、ならびに通期ガイダンスについて、本日 2022年2月15日午後 4 時 30 分（米国東部時間）より開催される同社の収益電話会議で説明します。\n  PJT Partners はアカマイの財務アドバイザーを、WilmerHale は法律顧問を務めました。 Linode では、DH Capital が財務アドバイザーを、Latham &amp; Watkins が法律顧問を務めました。\n 本日2月15日（火）午後4時30分（日本時間）よりコンファレンスコールを実施予定\n アカマイは、本日2022年2月15日午後4時30分（米国東部時間）より開催される第4四半期および2021年末の財務結果のカンファレンスコールにおいて、Linode の買収について説明します。この電話会議には、経営陣による将来の見通しに関する財務ガイダンスが含まれる可能性があります。この電話会議には、カンファレンスID番号7579719を用いて、(844) 578-9671 (国際電話の場合は508) 637-5655でアクセスできます。また、この電話会議のライブ・ウェブキャストとスライドは、www.akamai.com の「 Investor Relations」セクションでご覧いただけます。また、会議終了後 2 週間にわたり、アカマイのウェブサイト、または電話番号 855-859-2056（国際電話の場合は 404-537-3406）、会議 ID 番号 7579719 で電話による通話の再放送が可能です。\n  アカマイは、米国で一般に認められた会計原則（GAAP）に基づく財務指標に加え、GAAP に基づいて作成されていない（Non-GAAP）追加の財務指標を提供しています。経営陣は、会計期間中の営業成績の理解および比較、財務および業務上の意思決定、計画および予測の目的、役員報酬の測定、およびアカマイの財務実績の評価のために、GAAP に基づく財務指標に加えて、Non-GAAP による財務指標を使用しています。このリリースで使用されている非 GAAP 型の財務指標は、希薄化後 1 株当たりの非 GAAP 型純利益です。\n 経営陣は、この非 GAAP 型の財務指標は、会計期間間および同業他社との財務結果の比較を容易にすることから、事業の傾向を意味のある形で比較および分析できるように、アカマイの継続的な事業を反映していると考えています。また経営陣は、この非 GAAP 型の財務指標により、投資家が経営陣と同じ方法でアカマイの経営結果や将来の見通しを評価できると考えています。非 GAAP 型の希薄化後 1 株当たりの純利益は、異常な性質のもの、まれなもの、またはアカマイの継続的な経営結果を反映していない可能性のある費用や利益を除外しています。\n この非 GAAP 財務指標は、アカマイの GAAP 財務結果の表示に取って代わるものではなく、GAAP に基づいて表示されるアカマイの財務結果の代替としてではなく、補足としてのみ使用されるべきものです。過去の非 GAAP 指標について、アカマイは財務報告および投資家向けプレゼンテーションで使用された各非 GAAP 財務指標と最も直接的に比較できる GAAP 財務指標との調整を提示しています。これらの調整は、アカマイのウェブサイトの投資家向け情報セクションにある「GAAP と非 GAAP 財務指標の調整」という見出しでご覧いただけます。\n アカマイは、ガイダンスおよび将来のパフォーマンスに関する期待の表明という形で、将来の見通しに関する記述を提供しています。これらの将来の見通しに関する記述は非 GAAP ベースで提供されており、非 GAAP 指標から除外する項目に影響を与える事象の量や時期が予測できないため、不合理な努力をせずに最も近い GAAP 指標に調整することはできません。例えば、株式ベースの報酬は、アカマイのパフォーマンスベースのアワードについては予測不可能であり、パフォーマンスベースのターゲットの将来の達成に関する現在の予想に基づいて大きく変動する可能性があります。無形資産の償却、買収関連費用、および構造改革費用はすべて、予測が困難な将来の潜在的な行動のタイミングと規模によって影響を受けます。さらに、アカマイは随時、発生頻度の低い特定の項目を除外していますが、これも本質的に予測や見積もりが難しいものです。また、除外する項目の税効果を予測することや、税務監査の解決や税法の変更など、特定の個別の税項目を推定することも困難です。このように、Non-GAAP 方式の予測から除外される費用を予測することは困難であり、調整や結果の範囲を示すことは、不正確で誤解を招く可能性のある開示につながる可能性があります。除外項目のいずれかに重要な変更があった場合、当社のガイダンスおよび将来のGAAPベースの業績に大きな影響を与える可能性があります。\n このプレスリリースで使用された非 GAAP 指標に関するアカマイの定義を以下に示します。\n 希薄化後1株当たりの非 GAAP 型純利益 - 非 GAAP 型純利益を加重平均希薄化後発行済普通株式で割ったもの。希薄化後の加重平均発行済み株式は、非 GAAP 型の 1 株当たりの計算において、2027 年および 2025 年をそれぞれ期日とする 1,150 百万ドルの転換社債型上級ノートの発行に関連して締結されたノート・ヘッジ取引に従ってアカマイに交付される予定の株式を考慮して調整されています。GAAPでは、ヘッジ取引に基づいて交付された株式は、交付されるまで完全希薄化後の株式計算において相殺された株式とはみなされません。しかし、当社はノートのヘッジ取引から利益を得ており、希薄化の発生を認めていないため、経営陣はこの利益を調整することで営業成績を意味あるものにすることができると考えています。2027年および2025年の各年限の転換社債型新株予約権付社債に関しては、アカマイの加重平均株価が当初の転換価格であるそれぞれ116.18ドルおよび95.10ドルを超えない限り、GAAP と非 GAAP の希薄化後加重平均普通株式の発行数に差は生じません。\n 非 GAAP 型純利益 - GAAP 型純利益に以下の税影響項目を調整したものです：買収した無形資産の償却、株式ベースの報酬、資産化された株式ベースの報酬の償却、買収関連費用、再構築費用、法的解決に伴う利益および損失、アカマイ基金への寄付に関連して発生した費用、負債の割引および発行費用の償却、資産化された利息費用の償却、投資に関する特定の利益および損失、持分法投資からの利益および損失、および時折発生するその他の非経常的または異常な項目。\n 非 GAAP 型の調整、および非 GAAP 型の財務指標からそれらを除外するためのアカマイの根拠は、以下のとおりです。\n 買収した無形資産の償却 - アカマイは、これまでに実施した様々な買収に関連して、GAAP 方式の財務諸表に含まれる無形資産の償却を実施しました。買収の購入価格のうち無形資産に割り当てられた金額および関連する償却の期間は大幅に変化する可能性があり、各買収に固有のものです。そのためアカマイは、買収前後の営業成績を比較するための一貫した根拠を投資家に提供するために、非 GAAP 財務指標から買収無形資産の償却を除外しています。\n 株式ベースの報酬および資産化された株式ベースの報酬の償却 - 株式ベースの報酬は、アカマイの従業員に支払われる報酬の重要な側面ですが、付与日の公正価値は、付与時の株価、さまざまな評価方法、主観的な仮定、およびアワードの種類の多様性に基づいて変化します。このため、アカマイの現在の財務結果と過去および将来の期間との比較の解釈が難しくなっています。したがって、アカマイは、アカマイのコアビジネスのパフォーマンスを強調し、多くの投資家がアカマイのパフォーマンスを評価して同業他社と比較する方法と一致させるために、株式ベースの報酬および資産化された株式ベースの報酬の償却を非 GAAP 財務指標から除外することが有益であると考えています。\n 買収関連コスト - 買収関連コストには、取引手数料、アドバイザリー費用、デューデリジェンス費用、および戦略的活動に関連するその他の直接費用が含まれます。また、特定の買収に関連した偶発的な対価や補償金のアカマイの当初の推定額に対するその後の調整も、買収関連コストに含まれます。これらの金額は、買収のタイミングや規模によって影響を受けます。アカマイは、アカマイの営業成績を過去の期間や同業他社と比較する際に役立つよう、非 GAAP 型の財務指標から買収関連コストを除外していますが、これはこのような金額が買収取引の規模に応じて大きく変化し、アカマイの中核業務を反映していないためです。\n 構造改革費用 - アカマイは、当社の事業範囲または事業運営方法を大幅に変更したプログラムにより、構造改革費用を計上しました。これらの費用には、人員削減のための退職金および関連費用、事業で使用されなくなった長期性資産（使用権資産、その他の施設関連の有形固定資産、および内部使用ソフトウェアを含む）の減損、およびこれらのプログラムの一環として取り消された契約の解約料が含まれます。このような項目は再構築の規模によって大きく異なり、将来予想される営業費用を反映していないため、アカマイは継続事業の業績を評価する際に、非 GAAP 型の財務指標からこれらの項目を除外しています。さらに、これらの費用は、同社の事業の現在または過去の運営の基礎について、必ずしも意味のある洞察を与えるものではありません。\n 債務割引および発行費用の償却、ならびに資本化された支払利息の償却 - 2019年8月、アカマイは2027年満期の1,150百万ドルの転換社債型シニアノートを発行しました（クーポン金利は0.375％）。2018年5月、アカマイは1,150百万ドルの2025年満期の転換社債型シニア・ノートを発行し、クーポン金利は0.125%でした。これらの転換型シニアノートの帰属金利は、それぞれ3.10%および4.26%でした。これは、GAAP基準では持分法として個別に会計処理することが要求されている転換機能について、デット・ディスカウントを計上した結果、転換社債の帳簿価額が減少したことによるものです。この債務割引は、債務の発行費用と合わせて支払利息として償却されます。アカマイの非 GAAP 型の結果から除外された支払利息は、これらの非現金要素で構成されており、経営陣はこの非現金費用が継続的な営業実績を代表するものではないと考えているため、同社の営業実績に関する経営陣の評価から除外されています。\n 投資の損益 - アカマイは、特定の投資の処分、公正価値の変動、および減損による損益を計上しています。アカマイは、これらの損益をもたらしたイベントの種類がアカマイのコアビジネスの運営や継続的な営業実績を代表するものではないため、非 GAAP 型の財務指標からこれらの金額を除外することは投資家にとって有益であると考えています。\n 法的和解 - アカマイは法的問題の解決に関連して損失を被りました。これらの金額が発生した事象のタイプはアカマイの中核事業を代表するものではないため、非 GAAP 型の財務指標からこれらの金額を除外することは、投資家にとって有益であるとアカマイは考えています。\n アカマイ基金の基金化 - アカマイは、数学と科学の教育を支援することで次世代のテクノロジー革新者を奨励することを目的とした民間企業基金であるアカマイ基金の基金化のための費用を負担しました。アカマイの最初の基金設立は2018年で、アカマイ基金が活動範囲を拡大できるようにするための恒久的な基金を可能にするためでした。2020年の第4四半期には、テクノロジー業界の多様性を高めるための特定のイニシアティブを可能にするために、アカマイは基金を補充しました。アカマイは、これらの頻繁に発生しない、ほぼ 1 回限りの費用は同社の中核事業を代表するものではないため、これらの金額を非 GAAP 財務指標から除外することは投資家にとって有益であると考えています。\n 持分法投資からの損益 - アカマイは、持分法投資からの収益および損失のシェアについて損益を計上しています。アカマイは、投資先の運営を直接管理しておらず、関連する損益が同社の中核事業を代表するものではないため、このような損益を除外しています。\n 非GAAP基準の調整および特定の個別税項目の税効果-上述の非GAAP基準の調整は税引前で報告されています。非GAAP基準の調整による税効果は、GAAP基準と非GAAP基準の法人税費用の差額です。非 GAAP 法人税費用は、非 GAAP 税引前利益（非 GAAP 調整で調整された GAAP 税引前利益）に対して計算され、特定の個別税項目（評価引当金の計上や解除など）がある場合はそれを除外します。アカマイは、Non-GAAP 調整およびその関連税効果を適用することで、中核事業に帰属する所得を強調することができると考えています。\n 私募証券訴訟改革法に基づくアカマイの声明\n このプレスリリースおよび本日遅くに予定されている決算説明会の電話会議には、1995年私募証券訴訟改革法の免責条項に基づき、将来の見通しに関する記述による、アカマイの経営に関する将来の予測、計画、および見通しに関する情報が含まれており、これには将来の財務実績および計画された Linode の買収の利点に関する記述が含まれています。実際の結果は、以下を含む様々な重要な要因により、これらの将来見通しに関する記述で示された内容と大きく異なる可能性があります。過年度と同レベルの現金を継続的に創出できないこと、Linode社との取引を適時または全く完了できないこと、Linode社との取引から期待される利益が実現するかどうかについての不確実性。Linode のテクノロジーがアカマイの既存テクノロジーと期待通りに相互運用できるかどうかを含め、Linode のビジネスがアカマイのビジネスとうまく統合されるかどうかの不確実性；提案されている取引の発表が、Linode の主要な顧客、ベンダー、および従業員との関係を維持する能力に与える影響。技術革新への投資が市場に受け入れられるソリューションを生み出せないこと、過去と同じ割合で収益を増加させ、収益を上回る割合で費用を増加させることができないこと、進行中のCOVID-19パンデミックの影響、当社製品またはITシステムの欠陥または混乱、当社が買収したものの統合がうまくいかないこと。新しいサービスや機能の開発の遅れや失敗、開発されたとしても、そのようなサービスや機能が市場に受け入れられないことや、そのようなソリューションが期待通りに機能しないこと、その他、当社がSECに定期的に提出する年次報告書（フォーム10-K）、四半期報告書（フォーム10-Q）、およびその他の文書に記載されている要因などがあります。\n さらに、このプレスリリースおよびこのような投資家向け電話会議での声明は、このプレスリリースの日付時点でのアカマイの期待と信念を表しています。アカマイは、その後の出来事や進展により、これらの期待や見解が変更される可能性があることを予期しています。しかし、アカマイは将来の見通しに関する記述を将来のある時点で更新することを選択する可能性がありますが、その義務を負わないことを明確にします。これらの将来の見通しに関する記述は、このプレスリリースの日付以降のいかなる時点においても、アカマイの期待や信念を表すものとして依拠されるべきではありません。\n アカマイについて アカマイはオンライン生活を強力にサポートし、保護しています。世界中の最も革新的な企業が、デジタル体験の保護と配信のためにアカマイを選択し、何十億もの人々の生活、仕事、遊びを日々サポートしています。世界最大規模で最も信頼されているエッジプラットフォームにより、アカマイはアプリケーション、コード、および体験をユーザーの近くに、そして脅威をより遠くに配置します。アカマイのセキュリティ、コンテンツデリバリー、およびエッジコンピュートの製品とサービスについては、 www.akamai.com、 blogs.akamai.com、または Twitter や LinkedIn で Akamai Technologies をフォローしてください。\n  Gina Sorice メディアリレーションズ 646-320-4107   [email protected]", "posttime": "2022-02-17 06:26:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,acquire,費用", "title": "Akamai将收购Linode", "title_en": "Akamai To Acquire Linode", "transed": 1, "url": "https://www.linode.com/press-release/akamai-to-acquire-linode/", "via": "", "real_tags": ["收购", "acquire", "費用"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周二举行的一次虚拟全体员工大会上，Facebook加强了其不仅重塑自身形象的努力，还试图通过一条海军口号衍生出的一套新的企业价值观来管理士气低落、往往充满敌意的员工队伍。\n首席执行官马克·扎克伯格（Mark Zuckerberg）于去年年底将公司更名为Meta，他举着一个幻灯片展示了新的公司价值观：员工应该首先优先考虑Meta，然后是一个人的团队（metamates），然后是个人（me）。据三位知情人士透露，他表示，公司的企业价值观将是“活在未来”和“直截了当、尊重同事”。这三位知情人士在描述内部事务时要求匿名。它以前是“开放的”\n几年前，该公司的口号“快速行动，打破现状”被改为“快速行动”周二，该公司宣布将“快速合作”\n知情人士说，公司价值观的变化在内部遭到了一些员工的嘲笑，他们称这些变化是公司的灌输和脱节。\nFacebook首席技术官安德鲁·博斯沃思（Andrew Bosworth）在一条推文中说，“Meta.Metamates.Me”指的是Instagram已经使用了一段时间的海军短语；他说。他的推文还说，学者道格拉斯·霍夫斯塔特（Douglas Hofstadter）在一名员工向他征求意见后创造了“metamates”一词。\n这些变化反映了Facebook在经历了多年的争议后对新身份的追求，这些争议已经让其员工士气低落。该公司更名为Meta，以帮助将重点转移到建筑硬件上。此前，一名揭发者披露了该公司对其社会危害的了解，包括对年轻女性身体形象的负面影响，以及允许虚假信息传播。\n市政厅会议也首次在Facebook的虚拟现实平台Horizon Vinces上进行了流媒体直播。该公司正试图证明，企业会议可以在虚拟现实中举行，并开始将其市政厅作为一个测试案例。\nFacebook长期以来一直有一种重视开放的工作场所文化，但据知情人士透露，随着高管们对泄密和声誉损害越来越偏执，这种情况已经发生了变化。知情人士要求匿名描述内部事务。\n该公司的71000多名员工在Workplace上相互交流，Workplace是一个类似Facebook的内部聊天系统。过去，员工们在工作场所就从黑人生活到选举等各种问题进行了深入的辩论。他们还发布了关于产品和公司对社会影响的内部研究。\n去年，揭发者弗朗西斯·豪根（Frances Haugen）在工作场所发布了数千份公司文件，展示了该公司对社会危害的研究。自豪根事件曝光以来，Facebook一直试图关闭工作场所的某些对话，要么关闭对更多人开放的团体，要么让沟通人员告诉发表批评言论的员工他们不尊重他人。", "note_en": "At a virtual all-hands meeting Tuesday, Facebook escalated its attempts to not only rebrand itself but also manage its demoralized and often adversarial workforce with a new set of corporate values derived from a naval slogan.\n  CEO Mark Zuckerberg, who renamed the company Meta late last year, held up a slide deck showcasing new corporate values: Employees would be expected to first prioritize Meta, followed by a person’s team (metamates), followed by the individual (me). He said that the company’s corporate values would be “Live in the future” and “Be direct and respect your colleagues,” according to three people familiar with the meeting who spoke on the condition of anonymity to describe internal matters. It was previously “Be open.”\n Years ago, the company’s slogan of “Move fast and break things” was changed to just “Move fast.” On Tuesday, the company announced it would now be “Move fast together.”\n  The changes to the corporate values were ridiculed by some employees internally, who described them as corporate indoctrination and out of touch, the people said.\n   In a tweet, Facebook chief technology officer Andrew Bosworth said that the saying “Meta. Metamates. Me” was a “reference to a Naval phrase which Instagram has used for a while.&#34; The phrase used by Instagram is “Ship, Shipmates, Self,&#34; he said. His tweet also said that the term “metamates” was coined by the scholar Douglas Hofstadter after an employee reached out to him for ideas.\n  The changes reflect Facebook’s pursuit of a new identity after years of controversies that have demoralized its workforce. The company  changed its name to Meta to help shift the focus to building hardware, a rebranding that followed revelations by a whistleblower that showed how much the company knew about its damage to society, including negatively affecting the body image of young women and allowing disinformation to spread.\n  The town hall meeting was also streamed for the first time on Facebook’s virtual-reality platform, Horizon Venues. The company is attempting to demonstrate the idea that corporate meetings could be held in virtual reality, starting to use its town halls as a test case.\n  Facebook has long had a workplace culture that has prized openness, but as executives become more paranoid about leaks and reputational damage, that has changed, according to people familiar with the company’s practices who spoke on the condition of anonymity to describe internal matters.\n  The company’s more than 71,000 employees communicate with one another on Workplace, an internal chat system that looks like Facebook. Employees in the past have engaged in deep debates on Workplace about everything from Black Lives Matter to the election and more. They also posted internal research about products and the company’s impact on society.\n Last year, whistleblower Frances Haugen  came forward with thousands of company documents that were posted on Workplace showing the company’s research into social harms. Since the Haugen revelations, Facebook has made attempts to shut down certain conversations on Workplace, either by closing groups that were open to larger numbers of people or by having communications personnel tell employees that posted critical comments that they were disrespectful.", "posttime": "2022-02-17 06:08:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "meta", "title": "马克·扎克伯格（Mark Zuckerberg）概述了Meta公司价值观的变化，包括“一起快速行动”、“活在未来”和“Meta，Metamates，Me”", "title_en": "Mark Zuckerberg outlines changes to Meta's corporate values, including “Move Fast Together”, “Live in the Future”, and “Meta, Metamates, Me”", "transed": 1, "url": "https://www.washingtonpost.com/technology/2022/02/15/facebook-meta-metamates/", "via": "", "real_tags": ["meta"]}]