[{"category": "", "categoryclass": "", "imagename": "16c013f7c3f42c736c27342c6be5ce3a.jpg", "infoid": 1066692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你＆＃39;你的某一代，你有机会想象（或者，在你的成年，建造）你自己的家庭拱廊，类似于金色的东西，而80s时代。一个有用的道路，使这个现实，特别是在更紧密的宿舍，是＆＃34;多人，＆＃34;一种将多个游戏喷射到单个柜中的发明。\n 但是，如果你的旧学校游戏梦想围绕着更大和笨重的东西，特别是弹球？直到最近，您的选择要么购买一堆原始弹球柜，要么建立自己的仿真解决方案。后者被弹球扮演和感觉如何变得复杂。\n 我想知道在游戏 - 怀旧的市场上变化需要多长时间，特别是因为像Arcade1up这样的公司生产和销售更多的多种机柜供家用。由于少数制造商生产弹球多个制造商，改变的时间是显然的。 Arcade1up特别是今年推出了三个不同的弹球仿真柜，每个围绕不同的许可证旋转。\n  感谢Arcade1up，I＆＃39; Ve Goale Lock-yous-of this This Mover-of the Its Motiach最有趣的产品：10个经典桌子的集合，全部由威廉姆斯创建的街机鼎盛时期，但为更方便的家庭播放而仿效。 600美元究竟有什么可让您在仿真和构建质量方面？ （ARS Technica可以通过联盟计划获得从本帖子的链接销售的赔偿。）\nArcade1up Pinball系统在今年发布的所有三种型号之间主要相同。大多数物理柜子在其盒子内部预装，并完成了结构 - 类似于经典的弹球机，配有按钮和柱塞 - 用标准螺丝刀简单。最大的捕获将使内阁＆＃39;最大，最重的件，最重，楼梯上楼梯。该部分长34英寸长，17英寸宽，高16英寸。 （幸运的是，您可以拧紧此基部块。）曾经完全建造，这个机柜＆＃39; S最高的背板高达60英寸，而默认的腿从地板上带来35英寸的脚蹼。这些包括可伸缩的脚，即甚至可以调整到套装和＃39; Salance。标准弹球柜的大小约为65％，Arcade1up版本将更有可能适合您最喜欢的游戏室，尽管它看起来更好，而不是坐在时代的官方桌旁旁边。\n    偷看假硬币门，你＆＃39; ll迅速看到Armade1up＆＃39; System从真实的东西不同：一个24英寸液晶面板，偏移到周围的重要性挡板（顶部和底部木材，左右铝）。屏幕下方，Arcade1up依赖于Android加油SOC，将720p视频信号泵在屏幕上，以及用于柱塞的模拟接收器，加速度计感测您的真实生活和＃34;倾斜，＆＃34;和四个螺线管与您的游戏玩法一起重击。其中两个位于鳍状肢按钮附近，以复制击球的感觉，而两个坐在底盘内部的两个贴合，以复制中间凹凸。\n 用背板连接并插入墙壁插座的单个AC适配器，机器已准备好摇滚。套件的一部分为弹丸 - 仿真拼图提供了两个关键块：一个较小的液晶屏，它提供分数信息和中间名动画，以及一对令人惊讶的强大的扬声器。 \n顺便说一句，背板是一种印刷的海报，无论你＆＃39的虚拟游戏如何，都会变化。我的内阁突出了来自火星的原始威廉姆斯攻击，而Arcade1up＆＃39; S另外两个2021型号分别装饰着星球大战和奇迹字符。可悲的是，对于火星内阁的攻击，Arcade1up没有为侧柜艺术获得一个很好的来源（特别是在背板和＃39; s侧面）。这些图像有点翘曲和低res。如果您的默认家庭拱廊有昏暗照明，您甚至可能会注意到。\n 电源开启，经过允许的重叠载s屏幕，Arcade1up＆＃39; S界面弹出，透露由Zen Studios＆＃39提供的10场比赛;数字弹球生态系统。我测试的威廉姆斯机器包括以下内容：\n  如果您购买其他两种模型中的任何一个，请使用ZEN Studios创建的10个虚拟表，以便以前发布的控制台和PC游戏集合，而不是真实的经典娱乐。那个＆＃39;为什么我特别要求这个模型。我对重新创建熟悉的经典更感兴趣，而不是玩Zen Studios＆＃39;仅限数字发明。 ", "note_en": "If you&#39;re of a certain generation, chances are you have imagined (or, at this point in your adulthood, built) your own home arcade that resembles something out of the golden &#39;80s era. One useful path to making this a reality, especially in tighter quarters, is the &#34;multicade,&#34; an invention that squishes multiple games into a single cabinet.\n But what if your old-school gaming dreams revolve around something bigger and bulkier, particularly pinball? Until recently, your options were either buying a bunch of original pinball cabinets or building your own ground-up emulation solution. And the latter is complicated by the realities of how pinball plays and feels.\n I&#39;ve wondered how long it would take for that to change in the gaming-nostalgia market, especially as companies like Arcade1Up produce and sell more multicade cabinets for home use. The time for change is now, evidently, thanks to a handful of manufacturers producing pinball multicades.  Arcade1Up in particular launched three distinct pinball emulation cabinets this year, each revolving around a different license.\n  Thanks to Arcade1Up, I&#39;ve gone hands-on with arguably the most interesting product in its 2021 pinball line: a collection of 10 classic tables, all created by Williams during its  arcade heyday but emulated for more convenient home play. What exactly does $600 get you in terms of emulation and build quality?      (Ars Technica may earn compensation for sales from links on this post through  affiliate programs.)\nThe Arcade1Up pinball system is largely the same across all three models released this year. Most of the physical cabinet is preassembled inside its box, and finishing the construction—which resembles a classic pinball machine, complete with buttons and a plunger—is simple enough with a standard screwdriver. The biggest catch will be getting the cabinet&#39;s biggest, heaviest piece through doors or over stairs. This portion measures 34 inches long, 17 inches wide, and 16.5 inches tall. (Luckily, you can unscrew this base chunk in a pinch.) Once fully built, this cabinet&#39;s tallest backplate gets up to 60 inches in height, while the default legs bring the flippers up 35 inches from the floor. These include twistable feet that you can adjust to even out the set&#39;s balance. At roughly 65 percent the size of a standard pinball cabinet, the Arcade1Up version will more likely fit in your favorite playroom, though it looks better in isolation rather than sitting next to an official table of the era.\n    Peek over the fake coin doors, and you&#39;ll quickly see where Arcade1Up&#39;s system differs hugely from the real thing: a 24-inch LCD panel, offset by a significant bezel all around (wood on top and bottom, aluminum on the left and right). Beneath the screen, Arcade1Up relies on an Android-fueled SoC, which pumps a 720p video signal to the screen, along with an analog receiver for the plunger, an accelerometer to sense your real-life &#34;tilts,&#34; and four solenoids that thump along with your gameplay. Two of them are positioned near the flipper buttons to replicate the sense of striking a pinball, while two fit deeper inside the chassis to replicate midgame bumps.\n With the backplate attached and a single AC adapter plugged into a wall outlet, the machine is ready to rock. Part of the kit offers two crucial pieces to the pinball-emulation puzzle: a smaller LCD screen, which provides score information and midgame animations, and a pair of surprisingly robust speakers.\n  The backplate, by the way, is a printed poster that doesn&#39;t change regardless of which virtual game you&#39;re playing.  My cabinet highlights the original Williams table  Attack From Mars, while Arcade1Up&#39;s two other 2021 models are decorated with   Star Wars and  Marvel characters, respectively. Sadly, for the  Attack From Mars cabinet, Arcade1Up didn&#39;t get a great source for the side cabinet art (especially on the backplate&#39;s sides). Those images are a bit warped and low-res. Should your default home arcade have dim lighting, you may not even notice.\n Power the system on, and after an admittedly overlong loading screen, Arcade1Up&#39;s interface pops up, revealing a selection of 10 games as powered by Zen Studios&#39; digital-pinball ecosystem. The Williams machine I tested includes the following:\n  Should you purchase either of the other two 2021 models, you&#39;ll get 10 virtual tables created by Zen Studios for previously released console and PC game collections, as opposed to recreations of real-life classics. That&#39;s why I requested this model in particular. I was more interested in recreating familiar classics than playing Zen Studios&#39; digital-only inventions.", "posttime": "2021-06-18 20:31:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "弹球,pinball,游戏", "title": "Arcade1up弹球柜评论：适合家庭，有趣的Modders ", "title_en": "Arcade1Up pinball cabinet review: Fine for families, interesting for modders", "transed": 1, "url": "https://arstechnica.com/features/2021/06/arcade1up-pinball-cabinet-review-fine-for-families-interesting-for-modders/", "via": "", "real_tags": ["弹球", "pinball", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "03123c79996fcca9378e37c8e20ff912.jpg", "infoid": 1066691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "爱尔兰警方将有权强迫人们在新立法下进行搜索权证时为电子设备提供密码。  这一变化是在周一的爱尔兰司法部长希瑟Humathreys的GardaSíochána账单的一部分。  Gardaí也将被要求制作书面记录停止和搜索。  这将使能够收集数据，因此可以评估功率的有效性和使用。  将为儿童和可能受损的儿童和嫌疑人引入特别措施。  该法案将在调查调查的调查中，账单更长的拘留期，最高可达48小时。  它还将允许一周举行一周且拘留人口贩运犯罪的拘留，目前最多24小时拘留。 \n＆＃34;这一领域的法律目前很复杂，遍布普通法，数百件立法，宪法和欧盟法律，＆＃34; 部长说。  ＆＃34;将它携带在一起将通过Gardaí清晰，透明和无障碍使用警察权力。  ＆＃34;目的是创建一个系统，即Gardaí使用和容易地了解Gardaí可以使用的权力以及他们在那些情况下的权利是什么。  ＆＃34;与此同时，我们建议将额外的权力扩展到Gardaí，我们也在加强保障措施。 该法案将强烈关注被告的基本权利和程序权利。  ＆＃34;我相信这将保持这一关键的平衡，这是我们刑事司法系统的关键，同时确保了加尔达力量的更明确和精简。＆＃34; ", "note_en": "Irish police will have the power to compel people to provide passwords for electronic devices when carrying out a search warrant under new legislation.\n The change is part of the Garda Síochána Bill published by Irish Justice Minister Heather Humphreys on Monday.\n Gardaí will also be required to make a written record of a stop and search.\n This will enable data to be collected so the effectiveness and use of the powers can be assessed.\n Special measures will be introduced for suspects who are children and suspects who may have impaired capacity.\n The bill will bring in longer detention periods for the investigation of multiple offences being investigated together, for a maximum of up to 48 hours.\n  It will also allow for a week&#39;s detention for suspects in human trafficking offences, which are currently subject to a maximum of 24 hours detention.\n  &#34;The law in this area is currently very complex, spread across the common law, hundreds of pieces of legislation, constitutional and EU law,&#34; the minister said.\n &#34;Bringing it together will make the use of police powers by gardaí clear, transparent and accessible.\n &#34;The aim is to create a system that is both clear and straightforward for gardaí to use and easy for people to understand what powers gardaí can use and what their rights are in those circumstances.\n &#34;At the same time, where we are proposing to extend additional powers to gardaí, we are also strengthening safeguards. The bill will have a strong focus on the fundamental rights and procedural rights of the accused.\n &#34;I believe this will maintain the crucial balance which is key to our criminal justice system, while ensuring greater clarity and streamlining of Garda powers.&#34;", "posttime": "2021-06-18 20:24:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,警方,police,garda", "title": "爱尔兰警方将获得密码的权力 ", "title_en": "Irish Police To Be Given Powers Over Passwords", "transed": 1, "url": "https://www.bbc.com/news/world-europe-57468750", "via": "", "real_tags": ["密码", "警方", "police", "garda"]}, {"category": "", "categoryclass": "", "imagename": "969d9e3fd0b3304f399832e3fc02b3b6.jpg", "infoid": 1066690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一下，在过去的一年中，Facebook已经设法获得了战斗royale游戏Fortnite，专注的游戏创作引擎Roblox，以及2020年的畅销游戏，使命召唤：黑色ops冷战。\n 有很多原因，这种狂欢的收购永远不会发生。最大的是，反垄断审查使Facebook越来越困难地获得类似社交网络的任何东西。这是一年多的一年前，该公司购买了奄奄一息的GIF搜索引擎Giphy，这对独立公司的成功前景很少;联合王国的竞争看门狗到目前为止，从结束时阻止了交易，警告收购会以某种方式伤害Facebook的竞争对手。\n 然而，如果你看看虚拟现实景观，Facebook已经制作了一系列的收购，这些收购大致类似于我在上面描述的虚构购物狂欢，如果是更小的规模：\n 上周，Facebook购买了Bigbox VR，战斗皇家游戏人口的制造商：一。射手具有一个结构和一个类似的“季节”的商业模式，类似于史诗般的Fortnite。\n 本周前一周，Facebook购买了单位2游戏，牧师平台制造商。 Crayta让用户以时尚的方式制作和分享游戏，这是罗布洛的快速增长的游戏平台，即今年早些时候公开。\n 2019年Facebook购买了击败游戏，打击游戏的制造商击败了军刀。 Beat Saber是Facebook购买它的Oculus平台上最受欢迎的VR游戏，它仍然是今天的畅销书，销售了超过400万份。\n 该公司的其他VR工作室收购包括Sanzaru Games并在黎明时准备。 \n亚历克斯·希斯（Alex Heath）在Twitter上密切关注AR和VR技术的崛起的记者，最近在Twitter上观察到的是，Facebook在该空间中的收购类似于几年前的新兴科技的最着名的投注：购买Instagram和WhatsApp的购买帮助该公司将其作为社交网络中的主导球员水泥地位。\n “Facebook将在VR软件中拥有近乎垄断，甚至很重要，”希思推文。 “Facebook将在实际上重新发明自行，以便通过时期的时间来计算计算中的新的范式转变，以便在其当前的状态下解决它。”\n   无论您认为国会是否应该干预规范技术收购，这是不可否认的过程慢慢移动。 Facebook于2012年购买了Instagram和2014年的WhatsApp;国会反托拉斯查询直到五年后没有开始;并且在......星期五之前没有将需要提高科技平台收购的审查的账单。 （好的，罚款，叛乱参议员josh hawley介绍了一项禁止所有平台收购的账单，以4月份，但他的账单更好地被认为是福克斯新闻委员会，而不是规范行业的严重努力。）\n 我认为联邦贸易委员会应该更加持怀疑态度，以获得直接竞争对手的科技巨头，但我不确定违约禁止收购的账单是最好的方法。收购是硅谷生命的一部分，以及他们返回投资者的资金在下一代企业家和技术中重新投资。您可以在不禁止M＆amp的情况下鼓励大量方面的竞争;无论如何，很难想象一个像这样的法案，尽管是霍利的比尔，霍利的比尔很多。\n 与此同时，让我们说你认为Facebook的Instagram和Whatsapp的收购了几年 - 无论如何，直到Tiktok出现。如果您申请移动它在九年前，您申请移动它，您是否希望向Facebook目前的购物狂欢进行审查。\n 这个问题的答案可能取决于您认为虚拟现实脑权件的市场和其伴随的软件生态系统将成为多大。目前市场小 -  Facebook的Oculus平台售出截至1月份的售价少于1000万台。相比之下，Playstation 4在其寿命期间销售超过11500万台;苹果在2020年的仅限于2020年销售了近8000万辆iPhone。\n 如果您认为VR将大致增长到大型控制台游戏平台的大小，也许您不担心有多少Studios Facebook购买。 Console制造商一直购买游戏工作室 - 微软收购Zenimax媒体，Bethesda软件的所有者及其许多流行的特许经营者，是去年在空间中的大众交易 - 没有人似乎有太多的疑虑，任何一个控制台都在发展垄断。 \n另一方面，如果您认为Oculus可能会达到类似于主要桌面计算机制造商的尺寸，如戴尔，也许你会以更严格的审查为目的。把我的牌放在桌子上：我认为它最终会。\n  Facebook仍然没有发布销售数据的任务2耳机，我告诉PlayStation VR已经销售了更多的单位整体。但我们知道，Quest 2在2020年的前季度开始，Facebook的非广告收入增长了156％。即使在相对较小的收入基础上，这可能会使VR Facebook的增长最快的业务。\n 您所看到的到处都是，您会发现Facebook对其VR平台的信心不断充满信心。首席执行官Mark Zuckerberg在过去的12个月内常常对该主题进行了面试，其中包括将AR和VR定位为企业软件平台以及玩游戏的地方。该公司聘请了10,000多人在其Facebook现实实验室硬件部门工作。\n 简而言之，有的证据表明，VR将是巨大的，在Facebook的收购竞选时，它的证据表明Instagram在Facebook在2012年购买它之前将是巨大的，在该应用程序有5000万用户之前。\n 这一切都不是说我认为VR将超越智能手机作为世界上最大的计算平台。也很清楚，Facebook有真正的竞争，因为它试图建立混合现实的未来。 Snap还在该空间中构建令人印象深刻的硬件和软件，专注于其眼镜眼镜和围绕它们的开发人员生态系统。苹果公司正在努力掌握自己的耳机，近年来至少有四家混合现实公司收购。\n 它也可能是史诗般的游戏使Fortnite是VR的富人，而Roblox则使其平台成为VR的Roblox，以及Facebook在那个空间的努力。\n Facebook告诉我其获得所以许多游戏工作室的原因很简单：它希望通过确保顶级游戏体验广泛使用，加速仍然新生行业的增长。该公司表示，这是博彩行业中的一名非常小的球员，但希望其收购对开发人员和用户有利。 \n“这一切都是真的 - 但它并不意味着它不会在六到八年内成为一个问题，”希思周三通过电话告诉我。从Heath的角度来看，Facebook的收购的更加相应的方面是，它将在一家公司统筹大量的VR人才，至少四年，而他们的购置背心的选择。\n “善良的人已经在Facebook或他们购买它们”\n “没有那么许多公司这样做，”希思说的VR产业“，”和良好的人都在Facebook或他们购买它们。“\n 如果VR行业未能达到其最近一轮的炒作，这一切都不要这样做。未能达到炒作，可能是VR产业的签名特征，以至于到目前为止的整个寿命。\n 但如果VR成为我们日常工作流程的一部分，我们也是我们的日常娱乐活动，Facebook成为该空间的市场领导者，我们可能会在另一个全球对话中，了解科技巨头如何成功地将其市场权力接管邻近的行业。 。如果是这样的话，它会让我感到震惊，那个谈话的时间是现在的时候 - 虽然基础仍然被奠定了一个轻微的似乎收购。 ", "note_en": "Imagine that, over the past year, Facebook had managed to acquire the battle royale game  Fortnite, the kid-focused game creation engine Roblox, and the best-selling game of 2020,  Call of Duty: Black Ops Cold War.\n For many reasons, such a spree of acquisitions would never happen. One of the biggest is that antitrust scrutiny has made it increasingly difficult for Facebook to acquire anything that resembles a social network. It was more than a year ago that the company bought the moribund GIF search engine Giphy, which had few prospects for success as a standalone company; the United Kingdom’s competition watchdog  has so far blocked the deal from closing, warning the acquisition would somehow harm Facebook’s competitors.\n And yet if you look at the virtual reality landscape, Facebook has made a series of acquisitions that are roughly analogous to the fictional shopping spree I describe above, if on a much smaller scale:\n Last week,  Facebook bought BigBox VR, maker of the battle royale game  Population: One. The shooter has a structure and a “season”-based business model similar to that of Epic Games’  Fortnite.\n The week before,  Facebook bought Unit 2 Games, maker of the Crayta platform. Crayta lets users make and share games in a fashion that mirrors  Roblox, the fast-growing game platform that went public earlier this year.\n In 2019 Facebook  bought Beat Games, maker of the hit game  Beat Saber.  Beat Saber was the most popular VR game on the Oculus platform by far when Facebook bought it, and it remains a bestseller today with more than 4 million copies sold.\n The company’s other VR studio acquisitions include  Sanzaru Games and  Ready at Dawn.\n Alex Heath, a reporter at  The Verge who has closely covered the rise of AR and VR technologies,  observed on Twitter recently that Facebook’s acquisitions in the space resembled its most famous bets on nascent technology from years ago: the purchases of Instagram and WhatsApp, which helped the company cement its position as the dominant player in social networks.\n “Facebook is going to probably have a near-monopoly in VR software before it even matters,” Heath tweeted. “Facebook will have literally reinvented itself for a new paradigm shift in computing by the time regulation gets around to addressing it in its current state.”\n   Whether or not you think Congress should intervene to regulate tech acquisitions, it’s undeniable that the process moves slowly. Facebook bought Instagram in 2012 and WhatsApp in 2014; a congressional antitrust inquiry didn’t begin until five years later; and a bill that would require heightened scrutiny of tech platform acquisitions was not introduced into Congress until…  Friday. (OK, fine, the insurrectionist Sen. Josh Hawley introduced a bill to  ban all platform acquisitions, period, in April, but his bills are better thought of as Fox News op-eds than as serious efforts to regulate the industry.)\n I think the Federal Trade Commission should be more skeptical of tech giants acquiring their direct competitors, but I’m not sure a bill that defaults to banning acquisitions is the best approach. Acquisitions are part of the lifeblood of Silicon Valley, and the money that they return to investors gets re-invested in the next generation of entrepreneurs and technologies. You can encourage competition in lots of ways without banning M&amp;A. And in any case, it’s hard to imagine a bill like this one garnering much support from Republicans, Hawley’s bill notwithstanding.\n At the same time, let’s say you believe Facebook’s acquisitions of Instagram and WhatsApp set back the consumer internet for a few years — until TikTok emerged, anyway. Wouldn’t you want to apply as much scrutiny to Facebook’s current shopping spree as you’re applying to moves it made as long as nine years ago?\n The answer to that question likely depends on how large you think the market for virtual reality headsets and its attendant software ecosystem will someday become. Currently the market is small — Facebook’s Oculus platform had  sold fewer than 10 million units as of January. The PlayStation 4, by contrast, has sold over 115 million units during its lifetime; Apple sold almost  80 million iPhones in the last quarter of 2020 alone.\n If you think VR will grow to roughly the size of a major console gaming platform, maybe you’re not concerned how many studios Facebook is buying. Console manufacturers buy game studios all the time —  Microsoft’s acquisition of ZeniMax Media, owner of Bethesda Software and its many popular franchises, was last year’s mega-deal in the space — and no one seems to have too many concerns that any one console is developing a monopoly.\n If, on the other hand, you think Oculus could grow to a size more closely resembling a major desktop computer manufacturer, like Dell, perhaps you would eye its acquisitions with more scrutiny. To lay my cards on the table: I think it eventually will.\n  Facebook still hasn’t released sales figures for the Quest 2 headset, and I’m told Playstation VR has sold more units overall. But we know that Quest 2  drove a 156 percent year-over-year increase in Facebook’s non-advertising revenue in the last quarter of 2020. Even on a relatively small revenue base, that might make VR Facebook’s fastest-growing business.\n Everywhere you look, you find signs of Facebook’s growing confidence in its VR platform. CEO Mark Zuckerberg has given  frequent  interviews on the  subject over the past 12 months, among other things positioning AR and VR as an enterprise software platform as well as a place to play games. The company has hired more than 10,000 people to work in its Facebook Reality Labs hardware division.\n In short, there’s more evidence that VR will be huge amid Facebook’s run of acquisitions today than there was evidence that Instagram was going to be huge when Facebook bought it in 2012, before the app had even 50 million users.\n None of that is to say that I think VR will overtake smartphones as the world’s biggest computing platform. And it’s also clear that Facebook has real competition as it tries to build out the mixed-reality future. Snap is also building impressive hardware and software in that space, focused on its Spectacles glasses and growing developer ecosystem around them. Apple, which is working on a headset of its own,  has made at least four acquisitions of mixed-reality companies in recent years itself.\n It may also be that Epic Games makes  Fortnite the  Fortnite of VR, and Roblox makes its platform the Roblox of VR, and Facebook’s efforts in that space wither.\n Facebook told me its reasons for acquiring so many game studios are straightforward: it wants to accelerate the growth of a still-nascent industry by ensuring top-flight gaming experiences are widely available. It’s a very small player in the gaming industry, the company said, but hopes its acquisitions will be good for both developers and users.\n “That’s all true — but it doesn’t doesn’t mean it isn’t going to be an issue in six or eight years,” Heath told me over the phone Wednesday. From Heath’s perspective, the more consequential aspect of Facebook’s acquisitions is that it will tie up a significant amount of VR talent at one company for at least four years while their options from the acquisition vest.\n “the people that are good either already work at Facebook or they’re buying them”\n “There are not that many companies doing this,” Heath said of the VR industry, “And the people that are good either already work at Facebook or they’re buying them.”\n None of this will much matter if the VR industry fails to live up to its most recent round of hype. And failing to live up to the hype is perhaps the signature feature of the VR industry for its entire lifespan so far.\n But if VR becomes a part of our daily workflow as well our daily entertainment, and Facebook becomes the market leader in that space, we may be in for another global conversation about how a tech giant successfully used its market power to take over an adjacent industry. If that’s to be the case, it strikes me that the time to have that conversation is now — while the foundation is still being laid, one minor-seeming acquisition at a time.", "posttime": "2021-06-18 20:24:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "边缘,verge,vr", "title": "边缘 ", "title_en": "The Verge", "transed": 1, "url": "https://www.theverge.com/2021/6/16/22537795/is-facebook-cornering-the-vr-market?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["边缘", "verge", "vr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可持续硬件和软件的设计选项Johanna Pohl，AnjaHöfner，Erik Albers和Friederike Rohde  Ecofriendly Cryptoart的指南（NFTS）备忘录Akten，Primavera de Filippi，Joanie Lemercier，Addie Wagenknecht，Mat Dryhurst和Sutu_eats_flies  人工智能与可持续性 - 新兴挑战和政策含义Friederike Rohde，Maike Gossen，Josephin Wagner和Tilman Santarius  Aloha：主权和可持续发展是谁，我们是丹尼斯“颠簸”Pu'uhonua Kanahele  立即开放气候！ Shannon Dosemagen，埃米利奥维利斯，路易斯菲利普R.Mulillo，Evelin Heidel，Alex Stinson和Michelle Thorne ", "note_en": "Design Options for Sustainable Hardware and Software  Johanna Pohl, Anja Höfner, Erik Albers, and Friederike Rohde\n  A Guide to Ecofriendly CryptoArt (NFTs)  Memo Akten, Primavera De Filippi, Joanie Lemercier, Addie Wagenknecht, Mat Dryhurst, and Sutu_eats_flies\n    Artificial Intelligence and Sustainability – Emerging Challenges and Policy Implications  Friederike Rohde, Maike Gossen, Josephin Wagner, and Tilman Santarius\n  Aloha: Sovereignty and Sustainability Are Who We Are  Dennis “Bumpy” Pu‘uhonua Kanahele\n  Open Climate Now!  Shannon Dosemagen, Emilio Velis, Luis Felipe R. Murillo, Evelin Heidel, Alex Stinson and Michelle Thorne", "posttime": "2021-06-18 20:23:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分支,magazine,持续", "title": "分支杂志 - 第2期 ", "title_en": "Branch Magazine – Issue 2", "transed": 1, "url": "https://branch.climateaction.tech/issues/issue-2/", "via": "", "real_tags": ["分支", "magazine", "持续"]}, {"category": "", "categoryclass": "", "imagename": "9cc272c5d904c7cd8fc9da52817c6fb1.png", "infoid": 1066686, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "StreetComplete是一种易于使用的Android的OpenStreetMap数据编辑器。它可以在没有任何OpenStreetMap特定知识的情况下使用。它询问简单的问题，答案直接用于编辑和改进OpenStreetMap数据。该应用程序针对不了解OSM标记方案的用户，但仍然希望为OpenStreetMap提供贡献。\n StreetComplete自动查找所需的附近地区，并将其显示为其地图上的Quest标记。然后可以通过回答一个简单的问题来解决这些任务中的每一个。例如，在标记上点击可能显示问题＆＃34;这条路的名称是什么？＆＃34;，使用文本字段回答它。在下面的屏幕截图中显示了示例。\n 用户＆＃39; s答案被自动处理并直接上传到OSM数据库中。使用用户＆＃39; s osm帐户在有意义的变革集中完成编辑.Since该应用程序意味着在调查中使用，它可以在脱机和数据使用中使用脱机和经济。\n 为了使应用程序易于使用，任务仅限于询问简单的问题的人。\n       现在有很多不同的任务类型，更多将随时间添加。您可以在OSM Wiki中看到所有任务的社区托管列表。\n    这是一个有效的开源项目，因此您可以轻松参与其中！您可以在没有任何编程或OpenStreetMap知识的情况下进行！只需选择您喜欢的任务。\n       德国联邦教育和研究部赞助了本项目（授予代码01IS20S35），在09.2020和02.2021之间的原型基金的框架内。这使得这使得盗版Zwick能够使这个应用程序成为一个更强大而有效的工具，可以轻松贡献OpenStreetMap。 \nNGI Zero Discovery是由NLNET Foundation组织的授权程序。 2019年批准使Mateusz KonieCzny能够在StreetComplete上工作大约三个月。  OpenStreetMap基金会正在为2020年的Microgrant程序的第一轮微型计划中使用StreetComplete进行地图维护的发展。  JawgMaps是基于OpenStreetMap数据的在线自定义地图，地理编码和路由的提供程序。 他们正在为他们的矢量地图瓷砖服务提供免费服务。  许多人目前正在通过Github赞助商，LiberaPay和Patreon支持这个应用程序。 如果您喜欢该应用程序，您可以加入它们☺️ ", "note_en": "StreetComplete is an easy to use editor of OpenStreetMap data available for Android. It can be used without any OpenStreetMap-specific knowledge. It asks simple questions, with answers directly used to edit and improve OpenStreetMap data. The app is aimed at users who do not know anything about OSM tagging schemes but still want to contribute to OpenStreetMap.\n StreetComplete automatically looks for nearby places where a survey is needed and shows them as quest markers on its map. Each of these quests can then be solved on site by answering a simple question. For example, tapping on a marker may show the question &#34;What is the name of this road?&#34;, with a text field to answer it.More examples are shown in the screenshots below.\n The user&#39;s answer is automatically processed and uploaded directly into the OSM database. Edits are done in meaningful changesets using the user&#39;s OSM account.Since the app is meant to be used on a survey, it can be used offline and iseconomic with data usage.\n To make the app easy to use, quests are limited to those answerable by asking simple questions.\n       There are quite a few different quest types now and more will be added over time.You can see a community-managed  list of all quests in the OSM wiki.\n    This is an active open-source project, so you can get involved in it easily!You can do so  without any programming or OpenStreetMap knowledge! Just choose a task that you like.\n       The  German Federal Ministry of Education and Research sponsored this project (grant code 01IS20S35) within the frame of the  Prototype Fund between 09.2020 and 02.2021. This enabled Tobias Zwick to work on making this app a more powerful and efficient tool to easily contribute to OpenStreetMap.\n The  NGI Zero Discovery is a grant program organized by the NLnet foundation. The 2019 grant enabled  Mateusz Konieczny to work on StreetComplete for about three months.\n The  OpenStreetMap foundation was funding the development of doing  map maintenance with StreetComplete in their  first round of the  microgrant program in 2020.\n JawgMaps is a provider of online custom maps, geocoding and routing based on OpenStreetMap data. They are providing their vector map tiles service to StreetComplete for free.\n Many people are currently supporting this app through  GitHub sponsors,  Liberapay and  Patreon. If you like the app, you can join them  ☺️", "posttime": "2021-06-18 20:22:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "易于,easy,openstreetmap", "title": "StreetComplete：易于使用OpenStreetMap数据的编辑器 ", "title_en": "StreetComplete: Easy to use editor of OpenStreetMap data", "transed": 1, "url": "https://github.com/streetcomplete/StreetComplete", "via": "", "real_tags": ["易于", "easy"]}]