[{"category": "", "categoryclass": "", "imagename": "9b8d32e62f20db9afb9204173d7159af.jpeg", "infoid": 1003488, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "💎这是一个精心挑选的资源集合，用于解决实际的营销任务，例如：\n当我们制造我们的第一个产品(iOS工程师的工具)时，我们就遇到了这些问题。我们花了将近两年的时间才学会如何推销我们的项目。😤在这段时间里，我们阅读、尝试并为许多有用的东西添加了书签：文章、视频、电子表格、播客和工具。这些资源对我们帮助很大！请从我们的收藏和体验中学习、改编和测试令人敬畏的营销技巧。祝好运!。\nLisa&amp；Ahmed，无瑕疵应用程序的创始人，根据设计验证iOS应用程序的工具。\n浏览一下我们的目录。为了帮助您导航，我们添加了每个营销类别的简要概述。此外，内容标题会尽可能清晰地显示(因此它会告诉您上下文以及如何从中受益)。\n搜索关键字或短语(例如，“Product Hunt”、“Facebook”、“blog”)。\n如果您发现了一些很棒的营销内容或工具，请为工程师市场营销集合贡献力量。只需提交与我们的投稿指南相关的拉式请求即可。我们希望您能看到您的建议！\n用户研究会给你一个答案，告诉你你的产品是谁的。分析潜在用户和客户将有助于：\n概述与您的产品交互的产品路线图、主要功能、UI设计和UX场景；\n我希望我已经说服您，用户研究是非常重要的。在学习了这些材料之后，您应该能够进行用户研究，创建基本角色，并在真人身上进行验证：\n营销角色，或买方角色，是根据共同特征对目标市场进行细分的一种方式。它用于引导媒体活动以适当的消息传递来瞄准正确的受众。买方角色通常来自市场调查。..。如果营销人物角色关注的是世界卫生组织，那么用户体验人物角色更多的是如何营销。UX人物角色或设计人物角色可以包括买方人物角色中的所有信息，但特别强调面向任务的用户行为。UX角色想要揭示的是目标用户从A点到B点将采取的所有步骤。\n移情映射是另一种广泛应用于用户体验领域的用户研究技术。这本“同理心地图实用指南”和视频将让你很好地概述这一方法。\n您需要接触到您的潜在用户，并验证您的角色假设。您可以通过调查、访谈、线上和线下会议、聊天、Skype通话、检查现有分析(Google Analytics、社交媒体数据)、分析竞争对手客户、合乎道德地搜索您的用户电子邮件和姓名并在社交媒体上进行研究，来获得真正的用户洞察力：\n9分钟的关于创建人物角色的视频，当你已经有东西要分析的时候：网站，你产品在Twitter\\Facebook上的追随者，第一批用户或付费客户。\n简单的蓝图进行一个彻底的买家的旅程研究。这是一篇有点陈旧的文章，但它有一个很好的计划，可以对当前或潜在的用户进行用户研究采访(研究)。\n在用户研究、面试和测试过程中提出正确的问题将在您真正开始与潜在用户交谈时使用(😤您必须这样做)。\n👆用户调查是客户发现过程的初始部分。你不仅应该研究你的潜在用户，还应该测试你想要构建的东西是否在市场上是需要的(这就是所谓的产品市场匹配)。如果您不熟悉精益启动方法，我建议您查看这些资源。它更多地面向初创企业，但仍然与新手产品制造商相关：\nLinkedIn搜索和LinkedIn团队关于如何使用新搜索的简短文章(这非常简单！)。\nHubSpot的买方人物角色词文档生成器可以帮助您针对您的人物角色做出第一个假设。\nTypeform是一个易于使用、移动优化的表单生成器，非常适合收集在线调查。你也可以使用谷歌表格进行在线调查。\n您的产品在哪些方面优于其他解决方案？您的副项目、开源工具或移动应用程序有什么独特之处？你对你的业务有哪些其他公司不了解的地方？\n你应该对所有这些问题都有答案。市场调查会帮你解决问题的！就我个人而言，我将市场研究定义为用户研究和竞争对手分析的结合。我们在上面一节中讨论的第一部分。这些指南将解释如何研究您的竞争对手、捕捉趋势并验证市场机会：\nGoogle Advanced Search Operators是一个有竞争力的审计工具，可以帮助您准确地找到您正在寻找的🙂。\nSimilarWeb提供不同网站的详细信息，并概述其营销战略。免费版本已经很不错了。\nAlexa是最古老的网络分析工具之一，但它仍然是一个很好的选择，因为它有强大的免费版本。\n使用Buzzsumo，您可以为给定主题或竞争对手找到共享程度最高的内容。在免费版本中，您将获得带有许多过滤器的完整内容页面。\n您可以在这里找到一系列免费的营销渠道，以获得第一批用户。他们中的大多数都会花费大量的时间和精力，但自己做不会花多少钱。一些渠道，如内容营销或影响者营销，在下面的目录中进行了全面的说明。因此，从这些现实生活故事中获得新的想法，并思考哪些可以为您的用户工作：\n保罗·格雷厄姆(Paul Graham)著的“做不到的事”。他是Y Combinator的联合创始人，Y Combinator是一名计算机科学家、投资者和企业家。保罗展示了条纹、Airbnb或Facebook等广受欢迎的公司是如何获得第一批用户的。这是一本更具哲理性的读物，可以帮助你的大脑朝着正确的方向思考。\nHow to Growth Your Startup on a$0 Marketing Budget作者：Hiten Shah。它突出了一系列不同的想法可以尝试。\n我们如何让我们的前2000名用户做那些没有规模的事情，惊人的瑞安·胡佛(Ryan Hoover)，Product Hunt的联合创始人。\n我们是如何在零营销预算的情况下从0美元到75,000美元的MRR的，谢尔盖·古瑟夫(Sergei Gusev)著。他们向市场影响力人士免费发送产品(设计师香水)，并获得视频评论。这大大增加了他们的销售额！\n我们是如何在24小时内获得首批100名付费客户的，作者是Groove的创始人亚历克斯·特恩布尔(Alex Turnbull)。\n评论营销：如何从社区参与中赚取利益，兰德·菲什金著。你可以通过分享有意义的观点和想法来获得对你公司的关注。兰德·菲什金(Rand Fishkin)制作了一段精彩的9分钟视频，讲述了如何使用这种技术👌。\n如何创建在线课程和网络研讨会来为您的产品争取用户。非常聪明的营销技巧在这些启动聊天播客！\n寻找和挖走竞争对手客户的5个地方。萨普夫分享了许多寻找线索和推销线索的聪明方法。\n“破解媒体：用零预算获得免费媒体报道的聪明方法”，作者Tucker Schreiber，来自Shopify。这篇帖子关注的是一个在线商店行业。但获得新闻自由关注的原则适用于任何市场。\n如何为你的应用程序获得媒体报道：独立开发者和代理公司创始人丹·康塞尔(Dan Counsell)的实用指南。\n推荐营销和移动推荐营销可以给你带来口碑增长。有关灵感，请查看2016年51个最佳推荐计划范例。这些有用的指南是由来自Referral Saasquatch的Brandon Gain准备的。\n5通过Braveen Kumar的低成本游击营销策略。🐒通过客流量直接进行线下曝光将适合实体产品和勇敢的创始人。\n当您有一个有许多使用案例的困难软件产品时，可以使用免费工具来产生潜在客户。这是一个很好的方式来展示你的主要产品的好处，并提高品牌知名度。这篇文章展示了如何通过免费的易用工具销售Clearbit API-Solution。你可以投入你的时间，制作一些免费的东西-UI工具包、浏览器扩展、有趣的游戏或开源工具。\n我们使用了很多免费的营销渠道。老实说，当我们推出无瑕疵应用程序时，我们没有其他办法。我们写冷冰冰的电子邮件，与有影响力的人交谈，在活动中手动招募用户，在Facebook群组中发布帖子，通过Twitter与开发人员和设计人员合作，并做了许多其他事情。这些给了我们第一批1000名测试版用户。所以值得一试！\n内容营销是通过内容进行推广。你可以经营一个个人博客，客座博客，或者在Medium(或者组合)这样的平台上写作。将重点放在如何帮助您的用户处理您的内容上。你不一定非得是专业作家才能写出很酷的文章。只要给你自己空间去发挥创造力，分享你的专业知识就行了。\n我鼓励你开始自己做内容营销。外包可能会非常棘手，特别是在一开始。🤔首先，想一想你的博客或内容将如何脱颖而出。每个行业都有很多很酷的博客。你会有什么不同呢？您可以为您的用户提供哪些独特的价值？你怎样才能建立一个参与式的读者社区呢？而最重要的问题是，你将如何将读者转化为线索。考虑到所有这些因素，您应该创建一个内容策略：\n通过将内容映射到销售漏斗(Benji Hyam)，从0-12k的有机访问者增长。这篇文章展示了如何制定面向移动和网络的博客的内容策略。\n幕后：亚历克斯·特恩布尔(Alex Turnbull)著的“幕后：我们如何用内容营销在三年内打造了500万美元/年的业务”。这是一个激动人心的故事，讲述了Groove如何重建其内容营销战略，并将重点放在能够真正帮助他们的市场上。\n布莱恩·迪恩(Brian Dean)提供的一个案例研究，介绍了如何创建能够产生400,000目标访问者的内容框架。\n别忘了计算一下内容营销的客户获取成本。德维什·卡纳尔(Devesh Khanal)将成本分为3类：每篇文章的成本，工资成本和技术成本。你可以根据你的情况重复他的计算，得到大概的预算。\n从创建一个博客开始，这个博客不仅要宣传你的产品，还要提供有用的建议、小贴士和链接等。检查一下竞争对手的博客在发布什么，行业里流行什么，你的用户对什么感兴趣。使您的文章思路与您已经定义的内容策略保持一致。要获得一些灵感，请滚动这些建议：\n帮助童子军团队的艾米丽·特里普莱特·兰茨(Emily Triplett Lentz)写的博客“我们是如何想出点子的”。\n如何使用这3个令人敬畏的工具生成内容创意。Robert Katai展示了如何使用Tools🔎(通过关键字)找出人们对您所在行业的疑问。\n来自埃德·利克的266篇博文点子。它混合了许多要写的主题。请随意滚动并盗取相关内容。\n找出写博客的内容的简单指南。正如Marko Saric提到的那样，🙏完美的话题是通过将你的激情和个性与市场需求联系起来找到的。\n如果您跳过上述内容营销部分中的文章，我鼓励您阅读这些文章！前4篇文章有很好的框架来获得战略性的内容想法。\n选择最合适的内容格式-视频、列表、长篇阅读。然后想一想正确的标题来激发你伟大文章的兴趣：\n博客搜索引擎优化的完整指南。瑞安·斯图尔特涵盖的不仅仅是让你的博客搜索引擎优化变得友好。Ryan谈论博客策略、关键词研究，以及通过建立帖子链接来推广你的博客。\n如何在谷歌首页对你的博客帖子进行排名。Marko Saric一直专注于WordPress博客的SEO优化。\n10种类型的内容，最适合搜索引擎优化。兰德·菲什金(Rand Fishkin)建议你的项目应该使用哪种格式。\n如何使用11+免费工具，以找到内特希瓦尔搜索引擎优化预审内容想法。这篇文章将教你如何通过SEO研究预审你的内容想法。\n要检查您的内容是否独一无二，您可以使用此网站或在线工具。我用这个Ru检验器。\nMedium是一个拥有庞大活跃社区的在线发布平台。你可以在那里建立你的博客，并与你的用户和媒体读者互动。你仍然需要自己宣传你的文章。Medium是一个高流量的社区，但你并不是唯一一个争夺注意力的人。\n在介质上书写的基础知识。如何撰写、编辑、发布文章以及将文章添加到出版物：\n文章，在这些文章中，您可以找到哪些主题、标题、集合、标签、类别和帖子长度最受中等读者欢迎：\n来自媒体团队的关于制作出版物(基本上是您的博客)的指南和伊丽莎白·托比(Elizabeth Tobey)的“如何让出版物看起来很棒”(How To Make Your Publisher Look Good)。\n阿里·米斯的35个发展你的中等博客的可行建议(时机，一些推广技巧)。\n在媒体或其他地方发布，消除了您所有的技术麻烦。这是开始实施您的内容营销战略的好地方。\n你需要在你自己的博客、媒体或嘉宾平台上推广内容。一些想法如何传播你的优秀文章，并使其更具共享性：\n点击发布后，您可以在39个免费位置推广博客帖子。在分享您的内容之前了解每个平台(否则您将成为垃圾邮件制造者💩)。在文章的末尾，沙菲汗提到了其他需要遵循的重要规则。\n内容推广：我们如何在5个月内通过零付费流量从0增长到32,977个用户。Benji Hyam谈到了社区驱动的内容推广。这意味着，你与目标社区接触，然后分享你的内容，这样它就会增加价值。\n通过您的内容促进社交共享。莎拉·彼得森分享的方法，将帮助读者轻松分享你的帖子。\n我让235个人在推特上转发我的文章，我得到的都是这个令人不快的案例研究。这是一个有趣的实验！约书亚·哈德威克(Joshua Hardwick)给那些在推特上发布类似帖子并要求发布推广推文的作家发了一封冷淡的电子邮件。你也可以试试这个。\n保罗·夏皮罗在分享他人内容的同时推广自己的内容。😯你有没有试过把你的博客包含在别人博客文章的UTM参数中？保罗会教你这个聪明的窍门。\n在Medium和LinkedIn上转贴内容的战略指南，作者：瑞安·巴尔斯。重新出版策略会带来增长还是会带来惩罚？瑞安·比尔斯就这一话题制作了信息性播客&amp；文章。\n让人们阅读你在Facebook上发表的博客帖子的简单方法，作者是亚当·罗杰斯(Adam Rogers)。优化你在Facebook上重新发布的内容的好主意。\n内容营销不仅仅是让人们阅读你的精彩文章(并在以后使用你的产品)。它也是关于发展和维护与社区的关系。\n影响力营销的重点是与意见领袖合作，将公司的信息/产品/服务推向更大的市场。📚这些长长的指南将有助于开始：\n你不应该害怕接触那些很酷的人。乐于助人、和蔼可亲、富有创造力：\nGroove创始人亚历克斯·特恩布尔(Alex Turnbull)写的“我用来与VIP连接的确切电子邮件脚本”。\n8个电子邮件推介模板，用于与Sapph的Influencers合作。向有影响力的人询问晋升、贡献、合作关系或评估的很好的指南和示例。自定义并使用它们！\n😱我刚刚没看就删除了你的外展电子邮件。不，我不觉得抱歉，作者：Tim Soulo。蒂姆展示了如何以正确的方式给有影响力的人发电子邮件的很酷的例子。请在联系意见领袖之前阅读这篇文章！\n如果你不能通过电子邮件表达自己，那么你就不值得任何人花时间。人们很忙，你应该避免含糊的信息，那样只会浪费时间。阅读这篇简短的文章，了解意见领袖希望在他们的收件箱中看到什么。\n26条头条新闻：如何在Venngage的会议上与有影响力的人建立联系。不要害怕与人交谈！\n与人交往：你最近为我做了什么？作者：诺亚·卡根(Noah Kagan)，一位颇受欢迎的IT企业家和影响力人物。我喜欢他关于让人们更容易答应你的请求的简短指导。\n我们如何在24小时内从亚历克斯·特恩布尔(Alex Turnbull)的一篇博客帖子中获得1000多名订阅者。Groove团队与有影响力的人建立了关系，以便在他们的博客上获得第一批读者。那里的战术很聪明！\nInfluencer Marketing如何帮助我们将月收入从0美元增长到70万美元以上。Sergei Gusev展示了他们如何在付费影响力营销平台的帮助下扩展影响力营销。他故事的第一部分在这里。\n通过Klear查找Twitter Influencers。它可以免费搜索10个关键字(技能)。付费版有更高级的选项。\n社交网络。您可以通过检查关键字搜索、关注者数量和参与度来找到意见领袖。\nTwitonomy从他的Twitter个人资料中给出了关于有影响力的人的详细信息。它可以显示定期与有影响力的人进行互动的人员。这些人可以成为你进入顶尖利基人群的起点。\nFollowerwank Analyst给出了一个关于任何Twitter用户网络的巨大数据库。这个免费的工具向你显示关于用户追随者和该用户追随的人的信息。因此，您可以找到参与的最佳时间、热门用户、位置信息等。\n使用RSS应用程序从有影响力的博客中获取内容。你可以评论这些帖子，并通过你的社交媒体分享好的帖子。Selfoss是一款不错的RSS应用程序。它是开源的，所以你可以深入研究它的代码并定制一些东西。\nProduct Hunt(PH)是一个发现、分享和极客了解科技新产品的地方。在那里提交你的产品是一个很好的出现在记者、技术人员和同行制造商面前的方式。提交后，该产品将参加日常比赛。比赛从太平洋标准时间00：00开始，以太平洋标准时间23：59结束。你必须在一天结束前获得尽可能多的好评！🏆最成功的产品出现在主页上，可以获得很多诚实的反馈、下载、用户和公关热议。请查看PH成功案例，以确定PH是否是适合您的发射平台！\n从发帖的基本规则开始：如何发帖或评论，如何寻求支持，如何访问主页。然后阅读关于产品猎头每个人都应该知道的五件事。加入PH社区，感受一下它是如何运作的，然后再实际开始你的活动。\n😱成功PH发布需要大量的准备、发布期间(24小时++)的推广和后续工作。这些指南将帮助您：\n产品狩猎101，来自顶级猎人之一罗布莱·贾马(Robleh Jama)。这是非常有用的听取启动算法的人，谁提交了许多不同的产品。\n来自俄罗斯Amplifr公司的SaaS创始人寻找产品指南。这是一个关于你的产品准备(入职、语言检查、电子邮件和其他不太明显的东西)的很好的教程。\n“产品猎头：什么管用，什么不管用”(Product Hunt：What Work and What Not)[案例研究指南]，由3D建模应用程序推出，于2016年12月在PH网站上发布。这些人没有典型的面向初创企业受众的甜蜜产品，他们推出的产品也不怎么样。我鼓励您考虑一下您将投资于PH启动的资源与可能的结果！\nProduct Hunt对开发人员工具有用吗？-这是我们在PH上发布的故事。我们分享了我们的营销策略和所有结果：流量数字、试验安装和销售。另外，我们还做了一个关于“产品猎头会议”的演讲，这是它的幻灯片。希望，这会帮助你们中的一些人在产品猎头上取得成功！\n你可以在历史排行榜或500强猎人排行榜上找到顶级猎人的名单。\n一份关于PH的100个支持率最低的项目的动态榜单。这是很好的检查失败的PH发射案例。\n在一张图表中显示每日PH排名前5位的产品，这可以向你展示每天上涨的动力。\nMakerTools可以让你在Twitter上创建一个推特列表，上面列出了所有称赞你的产品的优秀人士。感谢那些支持你的PH刘的人是一种很好的做法。\n..", "note_en": "💎 It’s a hand-picked collection of resources for solving practical marketing tasks, such as:\n  We faced these question when we made our first product (a tool for iOS engineers). It took us almost 2 years to learn how to market our project.  😤 During this time we read, tried and bookmarked many useful things: articles, videos, spreadsheets, podcasts &amp; tools. These resources helped us a lot! Please, learn, adapt and test awesome marketing hacks from our collection &amp; experience. Good luck!\n Lisa &amp; Ahmed, founders of  Flawless App, tool to verify iOS app according to the design\n   Go through our Table of Contents. To help you navigate, we`ve added brief overviews of every marketing category. Also, content titles are displayed as clearly as possible (so it will tell you the context and how you can benefit from it).\n Search for a keyword or phrase (for example, “Product Hunt”, “Facebook”, “Blog”).\n If you have found some great marketing content or tool, please, contribute to Marketing for Engineers collection. Simply submit a Pull Request with respect to our  Contribution Guidelines. We would love you to see your suggestions!\n    User research gives you an answer for whom is your product. Analyzing potential users &amp; customers will help to:\n outline product roadmap, key features, UI design and UX scenarios for interacting with your product;\n I hope that I have convinced you that user research is very important. After learning these materials you should be able to make user research, create basic Persona and validate it on real people:\n  A marketing persona, or buyer persona, is a way to segment target market by common characteristics. It is used to guide media campaigns to target the right audience with the appropriate messaging. Buyer personas usually comes from market research. ... If marketing persona is focused on the WHO, a UX persona is more about the HOW. A UX persona, or design persona, can include all the information in buyer persona, but with additional emphasis on the task-oriented user behavior. What a UX persona wants to uncover is all the steps a target user will take to go from point A to point B.\n Empathy Mapping is one more technique, which widely used in UX for user research. This  Practical Guide to Empathy Maps and  video will give you good overviews of this approach.\n You need to reach your potential users and validate your Persona &amp; hypothesis. You can get real users insight through surveys, interviews, online &amp; offline meetings, chats, Skype calls, checking existing analytics (Google Analytics, social media data), analyzing competitors&#39; customers, ethical googling your users&#39; emails &amp; names and researching them on social media:\n 9-min  video on creating a Persona, when you already have something to analyze: website, followers for your product on Twitter\\Facebook, first users or paying customers.\n Simple  blueprint for conducting a thorough buyer&#39;s journey study. It&#39;s a bit old article, but it has a nice plan for making user research interviews (study) with current or potential users.\n Asking the right questions during user research, interviews and testing will be in use when you actually start talking to the potential user ( 😤 you must do this).\n 👆 User research is an initial part of the customer discovery process. You should not only research your potential users but also test if what you want to build is needed on the market (it’s called Product Market Fit). If you are not familiar with the Lean Startup approach, I advise you to check these resources. It&#39;s more startup-oriented, but still relevant for newbie product makers:\n   LinkedIn search and brief  article from the LinkedIn team on how to use their new search (it&#39;s very easy!).\n  The Buyer Persona Word Doc  Generator from HubSpot can help you to make the first hypothesis for your persona.\n TypeForm is an easy-to-use, mobile-optimized form-builder that&#39;s great for gathering online surveys. You also can use Google Forms for making online surveys.\n  How is your product better than other solutions? What is unique about your side project, open-source tool or mobile app? What do you understand about your business that other companies in it just don&#39;t get?\n You should have answers to all these questions. Market research will help you out! Personally, I define Market Research as a combination of User Research and Competitor Analysis. The first part we discussed in the section above. And these guides will explain how to research your competitors, catch trends and validate market opportunity:\n   Google Advanced Search Operators is a competitive audit tool to help you find exactly what you’re looking for  🙂\n  SimilarWeb provides detailed info on different sites &amp; overview of their marketing strategy. A free version is pretty good.\n Alexa is one of the oldest web analytics tools out there, but it’s still a great option with strong free version.\n  With  Buzzsumo you can find the most shared content for a given topic or competitor. In a free version you will get the full page of content with many filters.\n  You will find here a collection of free marketing channels for getting the first users. Most of them will take a lot of time &amp; effort, but it will not cost money to do it yourself. Some channels, like Content Marketing or Influencer Marketing, are comprehensively explained in its own directories below. So, get fresh ideas from these real-life stories and think of what could work for your users:\n Do Things that Don&#39;t Scale by Paul Graham. He is a co-founder of Y Combinator, a computer scientist, investor, and entrepreneur. Paul shows how such popular companies as Stripe, Airbnb or Facebook got their first users. It&#39;s a more philosophical read for helping your brain to think in the right direction.\n How to Grow Your Startup on a $0 Marketing Budget by Hiten Shah. It highlights a bunch of different ideas to try.\n How We Got Our First 2,000 Users Doing Things That Don’t Scale by amazing Ryan Hoover, co-founder of Product Hunt.\n How we got from $0 to $75,000 MRR with zero marketing budget by Sergei Gusev. They sent free products (designer fragrance) to the market influencers and got video reviews. It grew their sales dramatically!\n How We Got Our First 100 Paying Customers in 24 Hours by Alex Turnbull, founder of Groove.\n Comment Marketing: How to Earn Benefits from Community Participation by Rand Fishkin. You can gain attention to your company by sharing meaningful opinions and thoughts. Rand Fishkin made an excellent 9-minute video on using this technique  👌.\n How to create  Online Courses and  Webinars to get users for your product. Very clever marketing tips in these The Startup Chat podcasts!\n 5 Places to Find and Poach Your Competitors&#39; Customers. Sapph shares many smart ways to find leads and pitch them.\n Hacking the Press: Clever Ways to Get Free Press Coverage with Zero Budget by Tucker Schreiber from Shopify. The post is focused on an online stores industry. But the principles of getting free press attention are applicable to any market.\n How to Get Press Coverage for Your App: a practical guide from Dan Counsell, indie developer &amp; agency founder.\n Referral Marketing and  Mobile Referral Marketing can give you word-of-mouth growth. For inspiration check  51 Best Referral Program Examples of 2016. These useful guides were prepared by Brandon Gains from Referral Saasquatch.\n 5 Low-Cost Guerrilla Marketing Tactics via Braveen Kumar.  🐒 Direct offline exposure via foot traffic would suit physical products and brave founders.\n Use free tools for lead generation when you have a difficult software product with many use cases. It&#39;s a great way to show the benefits of your main offering and increase brand awareness. This post shows how to sell Clearbit API-solution via free easy-to-use tools. You can invest your time and make some free stuff as well — UI kits, browser extensions, funny games or open-source tools.\n We used many free marketing channels. To be honest, when we started  Flawless App we didn&#39;t have other ways. We wrote cold emails, talked to influencers, manually recruited users at events, posted at Facebook groups, worked with developers &amp; designers via Twitter and did many other stuff. These gave us our first 1000 beta users. So it worth trying out!\n  Content marketing is about promotion via content. You can run a personal blog, guest blog or write at platforms, like Medium (or combine it). Focus on how you can help your users with your content. You don&#39;t have to be a professional writer for making cool articles. Just give yourself space to be creative and share your expertise.\n I encourage you to start doing content marketing by yourself. Outsourcing it can be very tricky, especially at the beginning. 🤔 Firstly, think how your blog or content is you going to stand out. There are plenty of cool blogs in every industry. How are you going to be different? What unique value can you offer to your users? How can you build an engaged readers community? And the most important question is how you will convert readers into leads. With all those considerations, you should create a content strategy:\n Growing From 0-12k Organic Visitors by Mapping Content to the Sales Funnel by Benji Hyam. This post shows how to make the content strategy for a mobile and web-oriented blog.\n Behind the Scenes: How We’ve Built a $5M/Year Business in 3 Years With Content Marketing by Alex Turnbull. An exciting story of how Groove rebuilt their content marketing strategy with the focus on what could actually help their market.\n A case study with the framework on  Creating Content That Generates 400,000 Targeted Visitors by Brian Dean.\n     And don&#39;t forget to calculate  The Customer Acquisition Cost of Content Marketing. Devesh Khanal has divided the cost into 3 categories: costs per article, salary costs and technology costs. You can repeat his calculations for your case and get approximate budgets.\n  Start by creating a blog that not only touts your product but offers helpful recommendations, tips &amp; tricks, links, etc. Check what competitors&#39; blogs are publishing, what is popular in the industry and what your users are interested in. Align your article ideas with the content strategy, you have already defined. To get some inspiration scroll these bits of advice:\n How We Come Up With Ideas for the Blog by Emily Triplett Lentz from Help Scout team.\n How to Generate Content Ideas With These 3 Awesome Tools. Robert Katai shows how to use tools  🔎 to find out what people are asking about your industry (via keywords).\n 266 blog post ideas from Ed Leake. It’s a mix of many topics to write about. Feel free to scroll it and steal relevant stuff.\n A Simple Guide To Figuring Out What To Blog About. As Marko Saric mentioned,  🙏 the perfect topic is found by interlinking your passion and personality with the demand from the market.\n If you have skipped articles in the Content Marketing section above, I do encourage you to read them! The first 4 articles have excellent frameworks for getting strategic content ideas.\n Pick the most appropriate content format — video, list, long-read. Then think about the right headline for driving interest to your great article:\n   The Complete Guide to Blog SEO. Ryan Stewart covers more than just making your blog SEO-friendly. Ryan talks about blog strategy, keywords research, and promotion of your blog via building links to posts.\n How To Rank Your Blog Posts On Google’s First Page. Marko Saric keeps focus on SEO optimization for WordPress blogs.\n The 10 Types of Content That Work Best for SEO. Rand Fishkin advises on which format should you use for your project.\n How To Use 11+ Free Tools To Find Prequalified Content Ideas for SEO from Nate Shivar. The article will teach you how to prequalify your content ideas with SEO research.\n  To check that your content is unique you can use  this site or online tools. I use this  Ru-checker.\n  Medium is an online publishing platform with a huge active community. You can make your blog there and engage with your users and Medium readers. You still need to promote your articles yourself. Medium is a high-traffic community, but you are not the only one who competes for attention.\n Basics of writing on Medium. How to write, edit, publish and add your article to publications:\n  Articles, where you can find what topics, titles, collections, tags, categories and post length are popular for Medium readers:\n Guide from Medium team on  making your publicatio(basically, your blog) and nice tutorial  How to Make Your Publication Look Great by Elizabeth Tobey.\n   35 Actionable Tips to Grow Your Medium Blog (timing, some promotional tips) by Ali Mese.\n Publishing on Medium or elsewhere removes all your technology hassles. It&#39;s a good place to start implementing your content marketing strategy.\n  You need to promote content on your own blog, Medium or guest platforms. Some ideas how to spread the word about your great articles and make it more shareable:\n 39 Free Places to Promote Blog Posts Once You Hit Publish. Learn about every platform before sharing your content there (or you will become a spammer 💩). At the end of the article Shafi Khan mentioned other important rules to follow.\n Content Promotion: How We Grew from 0 to 32,977 Users in 5 Months With Zero Paid Traffic. Benji Hyam talks about community-driven content promotion. It means, that you engage with the targeted community and then share your content so that it adds value.\n  Boost Social Sharing From Your Content. Sarah Peterson shared methods, that will help readers to easily share your posts.\n  I Asked 235 People to Tweet My Article and All I Got Is This Cheerless Case Study. It&#39;s an interesting experiment! Joshua Hardwick cold emailed writers who tweeted similar posts and asked for a promotional tweet. You can try this too.\n Sharing Other People Content and Simultaneously Promoting Your Own by Paul Shapiro.  😯 Have you ever tried to include your blog in the UTM parameters of somebody else blog post? Paul will teach you this smart hack.\n Strategic Guide to Reposting Content on Medium and LinkedIn by Ryan Battles. Does re-publishing strategy lead to growth or penalties? Ryan Battles made informational podcast &amp; article on the topic.\n The Simple Way to Get People to Read Your Blog Post on Facebook by Adam Rogers. Nice ideas on optimizing your republished piece of content on Facebook.\n Content Marketing is not only about getting people to read your amazing articles (and use your product later). It&#39;s also about developing and maintaining relationships with the community.\n  Influencer marketing is focused on working with opinion leaders to drive company message/product/service to the larger market.  📚 These long guides will be good for thestart:\n  You should not be afraid to reach to the cool people. Be helpful, nice and creative:\n The Exact Email Scripts I Use to Connect With VIP’s by Alex Turnbull, founder of Groove.\n 8 Email Pitch Templates to Partner with Influencers by Sapph. Nice guides &amp; examples for asking promotion, contribution, partnership or review from the influencer. Customize and use them!\n 😱  I Just Deleted Your Outreach Email Without Reading. And NO, I Don’t Feel Sorry by Tim Soulo. Tim shows cool examples of how to email influencers in the right way. Please, read this post before contacting opinion leaders!\n If you can’t express yourself by email, you’re not worthy of anyone’s time by Pieter Levels. People are busy and you should avoid vague messages, which only steals time. Read this brief article to understand what opinion leaders want to see in their inbox.\n    26 Headliners on How to Connect with Influencers at Conference by Venngage. Don&#39;t be afraid to talk to people!\n Connecting with Others: What Have You Done for Me Lately? by Noah Kagan, popular IT entrepreneur &amp; influencer. I loved his brief instruction on making it easier for people to say YES to your request.\n  How We Got 1,000+ Subscribers from a Single Blog Post in 24 Hours by Alex Turnbull. Groove team built relationships with influencers for getting the first readers on their blog. Very smart tactics there!\n  How Influencer Marketing helped us grow from $0 to $700k+ monthly revenue. Sergei Gusev shows how they scaled influencer marketing with the help of paid influencers marketing platforms. The 1st part of his story is  here.\n  Find Twitter Influencers via Klear. It&#39;s free for 10 keyword searches (&#34;skill&#34;). The paid version has more advanced options.\n Social networks. You can find opinion leaders by checking the keywords search, followers number and engagement level.\n Twitonomy gives detailed info about influencer from his Twitter profile. It can show people who are interacting with the influencer on a regular basis. Those people can become your starting point to get to the top-niche person.\n Followerwonk Analyze gives a huge database about any Twitter user&#39;s network. This free tool shows you info on user followers and people, whom this user follows. So you can find the best time to engage, popular users, location info, etc.\n Use RSS apps for getting content from influencers&#39; blogs. You can comment on those posts and share good ones via your social media.  Selfoss is a good RSS app. It&#39;s an open-source, so you may dig into its code and customize things.\n  Product Hunt (PH) is a place to discover, share, and geek out about new products in tech. Submitting your product there is a good way to appear in front of journalists, tech people and fellow makers. After submission, the product will participate in the daily race. The race starts PST 00:00 and finishes PST 23:59. You have to get as many upvotes and comments as you can by the end of the day!  🏆 The most successful products appear on the Homepage and can get a lot of honest feedback, downloads, users and PR buzz. Please, check success PH stories to decide if PH is the right launch platform for you!\n Start with  basic rules on Posting: how to post or comment, how to ask for support, how to get to the homepage. Then read  Five things everyone should know about Product Hunt. Join the PH community and feel how it works, before actually starting you launch activities.\n 😱 Successful PH launch takes a lot of preparation, promotion during the launch (24h++) and follow-up work. These guides will help you:\n Product Hunt 101 from one of the top hunters, Robleh Jama. It&#39;s very useful to listen to the launch algorithm from the person, who submit a lot of different products.\n The SaaS founder’s guide to Product Hunt from the Russian company, Amplifr. It&#39;s a nice tutorial about your product preparation (onboarding, language check, emails and other not obvious stuff).\n  Launching on Product Hunt: what works and what doesn’t [guide &amp; case study] by 3D modeling app, who launched on PH in December 2016. These folks have not typical &#34;sweet product for startup audience&#34; and their launch was &#34;so-so&#34; good. I encourage you to think about resources you will invest in PH launch versus possible outcome!\n Is Product Hunt useful for developer tools? - it&#39;s our story of launching on PH. We shared our marketing tactics and all results: traffic numbers, trials installations and sales. Also, we made a talk on Product Hunt meetup, here is  the slides from it. Hope, it will help some of you to succeed on Product Hunt!\n  You can find a list of top hunters at  All-time Leaderboard or  Top 500 Hunters.\n A dynamic list of the  100 least upvoted projects on PH. It&#39;s good to check failed PH launch cases.\n Daily Top 5 products on PH in one chart, which can show you dynamics of upvote grows on a daily basis.\n  MakerTools allows you to create a Twitter list of all the wonderful folks who upvoted your product. It&#39;s a good practice to thank those people for supporting your PH lau\n......", "posttime": "2020-05-24 14:43:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工程师,marketing", "title": "面向工程师的市场营销", "title_en": "Marketing for Engineers", "transed": 1, "url": "https://github.com/LisaDziuba/Marketing-for-Engineers", "via": "", "real_tags": ["工程师", "marketing"]}, {"category": "", "categoryclass": "", "imagename": "94bc2384738f6c857ef3595060af4c86.jpg", "infoid": 1003487, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(CNN商业报道)美国人正在削减开支，囤积现金，缩减信用卡债务，因为他们担心在冠状病毒大流行期间，他们的工作可能会消失。\n美国信用卡债务在3月份突然逆转，降幅为30多年来最大。与此同时，储蓄率攀升至罗纳德·里根(Ronald Reagan)入主白宫以来未曾见过的水平。\n消费者行为的戏剧性转变反映了疫情给美国经济带来的前所未有的动荡。尽管谨慎是对这种不确定性的合乎逻辑的回应，但在一个由消费者支出主导的经济中，低调行事也会给复苏带来风险。如果消费者袖手旁观，所谓的V型复苏是不可能发生的。\n自3月中旬以来，已有超过3300万美国人首次申请失业救济，经济学家警告称，就业市场在未来几年内不会恢复到危机前的水平。\n美国金融公司首席经济学家罗素·普莱斯(Russell Price)表示：消费者非常谨慎。我们正处于暴风雨之中。\n4月份失业率飙升至14.7%，这是自大萧条以来最严重的失业危机，美国人正在为未来更具挑战性的时期做准备。\n纽约联邦储备银行(New York Federal Reserve)周一发布的一项调查显示，4月份，人们认为的在未来12个月内丢掉一份工作的可能性飙升至近21%。这是纽约联邦储备银行(NY Fed)在2013年发起的这项调查中，这一指标连续第二个月创下历史新高。\n工人们还担心，如果他们失去了工作，他们将如何找到另一份工作。4月份，感知到的未来三个月找到工作的概率暴跌6.1个百分点，至47%，为有史以来最大的月度降幅。\n这项调查描述了家庭预期的显著恶化，包括预期收入、收入和支出增长的创纪录低点。\n奎尔情报公司(Quill Intelligence)首席执行官兼首席策略师丹妮尔·迪马蒂诺·布斯(Danielle DiMartino Booth)表示：我们知道科维德并没有离开。这将保留一些不确定和恐惧的因素，并抑制消费者的消费能力或消费欲望。\n忧心忡忡的美国人正在大幅缩减他们的信用卡债务，这是最昂贵的典型借款形式。\n根据美国联邦储备委员会(Federal Reserve)上周发布的一份报告，3月份，未偿还循环信贷按年率计算崩溃了31%。这是1989年1月以来的最大单月降幅。\n经济学家说，这种下降的部分原因是，随着越来越多的人失业，银行已经收缩了信贷额度。\n但消费者也变得更加节俭，并控制他们的借款，以防他们的收入被抹去。\n纽约联邦储备银行的调查发现，4月份，人们认为的未来三个月未能偿还最低债务的可能性升至16.2%，远高于11.9%的12个月历史平均水平。\n人们已经严格控制了他们的开支。布斯说，你不禁想知道，他们什么时候才能舒服地挥霍。\n例如，Visa(V)报告称，截至4月28日，信用卡支付量暴跌31%。Visa表示，美国支付量唯一增长的类别是食品和药店，另外还有沃尔玛(Walmart)、好市多(Costco)和塔吉特(Target)。4月份，其他所有方面的支出都有所下降。\nVisa警告称，受影响最严重的旅游、燃料、餐馆和娱乐类别的支付额在4月份暴跌了50%以上。上月旅行支出暴跌约80%。\n构成实体经济跳动心脏的消费者正准备迎接比政策制定者告诉他们的时间长得多的放缓，咨询公司RSM的首席经济学家乔·布鲁苏埃拉斯(Joe布鲁塞尔)表示。\n美国储蓄率从2月的8%攀升至3月的13.1%.。这是1981年11月以来的最高储蓄率。考虑到灾难性的经济消息，当4月份的统计数据发布时，储蓄率可能会更高。\n布鲁苏埃拉斯说，当你遭遇类似萧条的冲击时，家庭会增加储蓄，他称3月份储蓄率的飙升是疯狂的。\n消费者行为的转变再次提醒人们，鉴于华尔街近乎乐观，普通民众的痛苦往往会迷失。自3月下旬以来，随着投资者庆祝联邦政府的反应以及医疗领域出现希望的迹象，美国股市已恢复生机。\n尽管投资者对组成标准普尔500指数的大公司的前景持乐观态度，但很明显，中小企业正遭受重创。\nRSM周一公布的调查显示，约83%的中端市场企业报告4月经济前景普遍下滑。超过一半的人预计未来六个月的情况会下降。约46%的高管报告称，4月份的招聘人数有所下降，近三分之一的高管指出，提供的薪酬有所下降。\nRSM说，这项调查强烈暗示联邦政府的刺激措施在短期内不足以重振实体经济跳动的心脏和灵魂。\n尽管消费者行为的转变是理性的，但它们指出了一个由消费者支出主导的经济面临的长期挑战，消费者支出占美国GDP的三分之二以上。\n经济学家警告说，即使在家庭主妇订单取消后，许多美国人在接种疫苗之前也不会像以前那样大手大脚地花钱。这并不像重新开放经济那么简单。\n在可预见的未来，许多消费者，特别是老年人和那些有预先存在的疾病的人，可能会回避人群。这意味着经济不能像电灯开关一样被重新启动。\n“美国企业”的普莱斯说，即使你是千万富翁，你也会更不愿意去餐馆、棒球比赛和坐飞机旅行。", "note_en": "New York (CNN Business)Americans are slashing their spending,  hoarding cash and shrinking their credit card debt as they fear their jobs could disappear during the coronavirus pandemic.\n US credit card debt suddenly reversed course in March and fell by the largest percentage in more than 30 years. At the same time, savings rates climbed to levels unseen since Ronald Reagan was in the White House.\n The dramatic shifts in consumer behavior reflect the  unprecedented turmoil in the US economy caused by the pandemic. Although caution is a logical response to that uncertainty, hunkering down also poses a risk to the recovery in an economy dominated by consumer spending. A so-called V-shaped recovery can&#39;t happen if consumers are sitting on the sidelines.\n    More than 33 million Americans have filed for initial unemployment claims since mid-March, and economists warn the jobs market won&#39;t return to pre-crisis levels for years.\n &#34;Consumers are very cautious,&#34; said Russell Price, chief economist at Ameriprise Financial. &#34;We&#39;re right in the middle of the storm.&#34;\n  The unemployment rate soared to 14.7% in April — the most severe unemployment crisis since the Great Depression — and Americans are bracing for more challenging times ahead.\n The perceived probability of losing one&#39;s job over the next 12 months soared to nearly 21% in April, according to a New York Federal Reserve survey  released Monday. It was the second straight month of a record high for this metric in the survey, which the NY Fed launched in 2013.\n Workers are also worried about how they&#39;ll land another job if they lose theirs. The perceived probability of finding a job in the next three months tumbled 6.1 percentage points to 47% in April, the largest monthly decline ever recorded.\n The survey described &#34;considerable deteriorations&#34; in household expectations, including record lows for expected earnings, income and spending growth.\n &#34;We know that Covid has not gone away,&#34; said Danielle DiMartino Booth, CEO and chief strategist at Quill Intelligence. &#34;That is going to keep in place an element of uncertainty and fear and hold back consumers&#39; ability or desire to spend.&#34;\n  Worried Americans are drastically scaling back their credit card debt, the most expensive form of typical borrowing.\n In March, revolving credit outstanding collapsed at an annual rate of 31%,  according to a Federal Reserve report released last week. It was the largest one-month decline since January 1989.\n Part of that drop, economists say, is that banks have pulled back on credit  lines as more people become unemployed.\n But consumers are also becoming more frugal and reining in their borrowing in case their income is wiped out.\n The NY Fed survey found that the perceived probability of missing a minimum debt payment over the next three months rose to 16.2% in April, well above the 12-month trailing average of 11.9%.\n &#34;People have seriously reined in their spending. You have to wonder when they will feel comfortable splurging,&#34; said Booth.\n   For example,  Visa  (  V) reported that credit card payment volumes plunged 31% through April 28. Visa said the only category of US payments volume that is growing is food and drugstores, along with  Walmart  (  WMT),  Costco  (  COST) and  Target  (  TGT). Spending on everything else was down in April.\n Visa has warned that payments volume in the &#34;hardest-hit&#34; categories of travel, fuel, restaurants and entertainment plunged by more than 50% in April. Travel spending collapsed by about 80% last month.\n &#34;The consumer that constitutes the beating heart of the real economy is preparing for a much longer slowdown than what policymakers are telling them,&#34; said Joe Brusuelas, chief economist at RSM, a consultancy.\n  The savings rate in the United States climbed from 8% in February to 13.1% in March. That was the highest savings rate since November 1981. And given the disastrous economic news, the savings rate will likely go even higher when April statistics are released.\n &#34;When you have a depression-like shock, households will increase savings,&#34; said Brusuelas, who called the March spike in savings rate &#34;insane.&#34;\n  The shifts in consumer behavior are another reminder of the pain on Main Street that often gets lost given the near-euphoria on Wall Street. The US stock market has raced back to life since late March as investors have celebrated the response from the federal government and signs of hope on the health front.\n Although investors are optimistic about the future of the large companies that make up the S&amp;P 500, it&#39;s clear that small and medium-sized businesses are hurting badly.\n About 83% of middle-market businesses reported a general decline in economic prospects in April, according to a survey released Monday by RSM. And more than half expect a decline in conditions over the next six months. About 46% of executives reported a drop in April hiring and nearly a third noted a decline in compensation being offered.\n   RSM said the survey strongly implies the federal government&#39;s stimulus efforts &#34;will not be sufficient to revive the beating heart and soul of the real economy in the near term.&#34;\n  Although the shifts in consumer behavior are rational, they point to longer-term challenges for an economy that is dominated by consumer spending, which makes up more than two-thirds of US GDP.\n Economists warn that even after stay-at-home orders are lifted, many Americans won&#39;t spend as aggressively as before until there is a vaccine. It&#39;s not as simple as reopening the economy.\n   Many consumers, especially senior citizens and those with preexisting conditions, will probably shy away from crowds for the foreseeable future. And that means the economy can&#39;t get flipped back on like a light switch.\n &#34;Even if you are a multimillionaire, you&#39;re going to be much more reluctant to go to restaurants, baseball games and travel on airplanes,&#34; Ameriprise&#39;s Price said.", "posttime": "2020-05-24 13:43:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面临,economy,美国", "title": "经济面临的新威胁：美国人的储蓄就像上世纪80年代一样", "title_en": "New threat to the economy: Americans are saving like it's the 1980s", "transed": 1, "url": "https://edition.cnn.com/2020/05/12/investing/jobs-coronavirus-consumer-spending-debt/index.html", "via": "", "real_tags": ["面临", "economy", "美国"]}, {"category": "", "categoryclass": "", "imagename": "e44f9cd5b0bcebade5d4bb0ba5e44ae6.jpeg", "infoid": 1003485, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "💎这是一个精心挑选的资源集合，用于解决实际的营销任务，例如：\n当我们制造我们的第一个产品(iOS工程师的工具)时，我们遇到了这些问题。我们花了将近两年的时间才学会如何推销我们的项目。😤在这段时间里，我们阅读、尝试并为许多有用的东西添加了书签：文章、视频、电子表格、播客和工具。这些资源对我们帮助很大！请从我们的收藏和体验中学习、改编和测试令人敬畏的营销技巧。祝好运!。\nLisa&amp；Ahmed，无瑕疵应用程序的创始人，根据设计验证iOS应用程序的工具。\n浏览一下我们的目录。为了帮助您导航，我们添加了每个营销类别的简要概述。此外，内容标题会尽可能清晰地显示(因此它会告诉您上下文以及如何从中受益)。\n搜索关键字或短语(例如，“Product Hunt”、“Facebook”、“blog”)。\n如果您发现了一些很棒的营销内容或工具，请为工程师市场营销集合贡献力量。只需提交与我们的投稿指南相关的拉式请求即可。我们希望您能看到您的建议！\n用户研究会给你一个答案，告诉你你的产品是谁的。分析潜在用户和客户将有助于：\n概述与您的产品交互的产品路线图、主要功能、UI设计和UX场景；\n我希望我已经说服您，用户研究是非常重要的。在学习了这些材料之后，您应该能够进行用户研究，创建基本角色，并在真人身上进行验证：\n移情映射是另一种广泛应用于用户体验领域的用户研究技术。这本“同理心地图实用指南”将很好地概述这一方法。\n您需要接触到您的潜在用户，并验证您的角色假设。您可以通过调查、访谈、线上和线下会议、聊天、Skype通话、检查现有分析(Google Analytics、社交媒体数据)、分析竞争对手客户、合乎道德地搜索您的用户电子邮件和姓名并在社交媒体上进行研究，来获得真正的用户洞察力：\n9分钟的关于创建人物角色的视频，当你已经有东西要分析的时候：网站，你产品在Twitter\\Facebook上的追随者，第一批用户或付费客户。\n简单的蓝图进行一个彻底的买家的旅程研究。这是一篇有点陈旧的文章，但它有一个很好的计划，可以对当前或潜在的用户进行用户研究采访(研究)。\n在用户研究、面试和测试中提出正确的问题将在您真正开始与潜在用户交谈时使用(😤您必须这样做)。\n👆用户调查是客户发现过程的初始部分。你不仅应该研究你的潜在用户，还应该测试你想要构建的东西是否在市场上是需要的(这就是所谓的产品市场匹配)。如果您不熟悉精益启动方法，我建议您查看这些资源。它更多地面向初创企业，但仍然与新手产品制造商相关：\nLinkedIn搜索和LinkedIn团队关于如何使用新搜索的简短文章(这非常简单！)\nHubSpot的买方人物角色词文档生成器可以帮助您针对您的人物角色做出第一个假设。\nTypeform是一个易于使用、移动优化的表单生成器，非常适合收集在线调查。你也可以使用谷歌表格进行在线调查。\n您的产品在哪些方面比其他解决方案更好？您的副项目、开源工具或移动应用程序有什么独特之处？你对你的业务有哪些其他公司不了解的地方？\n你应该对所有这些问题都有答案。市场调查会帮你解决问题的！就我个人而言，我将市场研究定义为用户研究和竞争对手分析的结合。我们在上面一节中讨论的第一部分。这些指南将解释如何研究您的竞争对手、捕捉趋势并验证市场机会：\nGoogle Advanced Search Operators是一个有竞争力的审计工具，可以帮助您准确地找到您正在寻找的🙂。\nSimilarWeb提供不同网站的详细信息和营销策略概述。免费版相当不错。\nAlexa是最古老的网络分析工具之一，但它仍然是一个很好的选择，因为它有强大的免费版本。\n使用Buzzsumo，您可以为给定主题或竞争对手找到共享程度最高的内容。在免费版本中，您将获得带有许多过滤器的完整内容页面。\n您可以在这里找到一系列免费的营销渠道，以获得第一批用户。他们中的大多数都会花费大量的时间和精力，但自己做不会花很多钱。一些渠道，如内容营销或影响者营销，在下面的目录中进行了全面的说明。因此，从这些现实生活故事中获得新的想法，并思考哪些可以为您的用户工作：\n保罗·格雷厄姆(Paul Graham)著的“做不到的事”。他是Y Combinator的联合创始人、计算机科学家、投资者和企业家。保罗展示了条纹、Airbnb或Facebook等广受欢迎的公司是如何获得第一批用户的。这是一本更具哲理性的读物，可以帮助你的大脑朝着正确的方向思考。\nHow to Growth Your Startup on a$0 Marketing Budget作者：Hiten Shah。它突出了一系列不同的想法可以尝试。\n我们如何让我们的前2000名用户做那些没有规模的事情，惊人的瑞安·胡佛(Ryan Hoover)，Product Hunt的联合创始人。\n我们是如何在零营销预算的情况下从0美元到75,000美元的MRR的，谢尔盖·古瑟夫(Sergei Gusev)著。他们向市场影响力人士免费发送产品(设计师香水)，并获得视频评论。这大大增加了他们的销售额！\n我们是如何在24小时内获得首批100名付费客户的，作者是Groove的创始人亚历克斯·特恩布尔(Alex Turnbull)。\n评论营销：如何从社区参与中赚取利益，兰德·菲什金著。你可以通过分享有意义的观点和想法来获得对你公司的关注。兰德·菲什金(Rand Fishkin)制作了一段精彩的9分钟视频，讲述了如何使用这种技术👌。\n如何创建在线课程和网络研讨会来为您的产品争取用户。非常聪明的营销技巧在这些启动聊天播客！\n寻找和挖走竞争对手客户的5个地方。萨普夫分享了许多寻找线索和推销线索的聪明方法。\n“破解媒体：用零预算获得免费媒体报道的聪明方法”，作者Tucker Schreiber，来自Shopify。这篇文章的重点是网店行业。但获得新闻自由关注的原则适用于任何市场。\n如何为你的应用程序获得媒体报道：独立开发人员和代理公司创始人丹·康塞尔的实用指南。\n推荐营销和移动推荐营销可以给你带来口碑增长。有关灵感，请查看2016年51个最佳推荐计划范例。这些有用的指南是由来自Referral Saasquatch的Brandon Gain准备的。\n5通过Braveen Kumar的低成本游击营销策略。🐒通过客流量直接进行线下曝光将适合实体产品和勇敢的创始人。\n当您有一个有许多使用案例的困难软件产品时，可以使用免费工具来产生潜在客户。这是一个很好的方式来展示你的主要产品的好处，并提高品牌知名度。这篇文章展示了如何通过免费的易用工具销售Clearbit API-Solution。你可以投入你的时间，制作一些免费的东西-UI工具包、浏览器扩展、有趣的游戏或开源工具。\n我们使用了很多免费的营销渠道。老实说，当我们推出无瑕疵应用程序时，我们没有其他办法。我们写冷冰冰的电子邮件，与有影响力的人交谈，在活动中手动招募用户，在Facebook群组中发布帖子，通过Twitter与开发人员和设计人员合作，并做了许多其他事情。这些给了我们第一批1000名测试版用户。所以值得一试！\n内容营销是通过内容进行推广。你可以经营一个个人博客，客座博客，或者在Medium(或者组合)这样的平台上写作。将重点放在如何帮助您的用户处理您的内容上。你不一定非得是专业作家才能写出很酷的文章。只要给你自己空间去发挥创造力，分享你的专业知识就行了。\n我鼓励你开始自己做内容营销。外包可能会非常棘手，特别是在一开始。🤔首先，想一想你的博客或内容将如何脱颖而出。每个行业都有很多很酷的博客。你会有什么不同呢？您可以为您的用户提供哪些独特的价值？你怎样才能建立一个参与式的读者社区呢？而最重要的问题是，你将如何将读者转化为线索。考虑到所有这些因素，您应该创建一个内容策略：\n通过将内容映射到销售漏斗(Benji Hyam)，从0-12k的有机访问者增长。这篇文章展示了如何制定面向移动和网络的博客的内容策略。\n幕后：亚历克斯·特恩布尔(Alex Turnbull)著的“幕后：我们如何用内容营销在三年内打造了500万美元/年的业务”。这是一个激动人心的故事，Groove如何重建他们的内容营销战略，专注于什么可以真正帮助他们的市场。\n布莱恩·迪恩(Brian Dean)提供的一个案例研究，介绍了如何创建能够产生400,000目标访问者的内容框架。\n别忘了计算一下内容营销的客户获取成本。德维什·卡纳尔(Devesh Khanal)将成本分为3类：每篇文章的成本，工资成本和技术成本。你可以根据你的情况重复他的计算，得到大概的预算。\n从创建一个博客开始，这个博客不仅要宣传你的产品，还要提供有用的建议、小贴士和链接等。检查一下竞争对手的博客在发布什么，行业里流行什么，你的用户对什么感兴趣。使您的文章思路与您已经定义的内容策略保持一致。要获得一些灵感，请滚动这些建议：\n帮助童子军团队的艾米丽·特里普莱特·兰茨(Emily Triplett Lentz)写的博客“我们是如何想出点子的”。\n如何使用这3个令人敬畏的工具生成内容创意。Robert Katai展示了如何使用Tools🔎(通过关键字)找出人们对您所在行业的疑问。\n来自埃德·利克的266篇博文点子。它混合了许多要写的主题。请随意滚动并盗取相关内容。\n找出写博客的内容的简单指南。正如Marko Saric提到的那样，🙏完美的话题是通过将你的激情和个性与市场需求联系起来找到的。\n如果您跳过上述内容营销部分中的文章，我鼓励您阅读这些文章！前4篇文章有很好的框架来获得战略性的内容想法。\n选择最合适的内容格式-视频、列表、长篇阅读。然后想一想正确的标题来激发你伟大文章的兴趣：\n博客搜索引擎优化的完整指南。瑞安·斯图尔特涵盖的不仅仅是让你的博客搜索引擎优化变得友好。Ryan谈论博客策略、关键词研究，以及通过建立帖子链接来推广你的博客。\n如何在谷歌首页对你的博客帖子进行排名。Marko Saric一直专注于WordPress博客的SEO优化。\n10种类型的内容，最适合搜索引擎优化。兰德·菲什金(Rand Fishkin)建议你的项目应该使用哪种格式。\n如何使用11+免费工具，以找到内特希瓦尔搜索引擎优化预审内容想法。这篇文章将教你如何通过SEO研究预审你的内容想法。\n要检查您的内容是否独一无二，您可以使用此网站或在线工具。我用这个Ru检验器。\nMedium是一个拥有庞大活跃社区的在线出版平台。你可以在那里建立你的博客，并与你的用户和媒体读者互动。你仍然需要自己宣传你的文章。Medium是一个高流量的社区，但你并不是唯一一个争夺注意力的人。\n在介质上书写的基础知识。如何撰写、编辑、发布文章以及将文章添加到出版物：\n文章，在这些文章中，您可以找到哪些主题、标题、集合、标签、类别和帖子长度最受中等读者欢迎：\n来自媒体团队的关于制作出版物(基本上是您的博客)的指南和伊丽莎白·托比(Elizabeth Tobey)的“如何让出版物看起来很棒”(How To Make Your Publisher Look Good)。\n阿里·米斯的35个发展你的中等博客的可行建议(时机，一些推广技巧)。\n在媒体或其他地方发布，消除了您所有的技术麻烦。这是开始实施您的内容营销战略的好地方。\n你需要在你自己的博客、媒体或嘉宾平台上推广内容。一些想法如何传播你的优秀文章，并使其更具共享性：\n点击发布后，您可以在39个免费位置推广博客帖子。在分享您的内容之前了解每个平台(否则您将成为垃圾邮件制造者💩)。在文章的末尾，沙菲汗提到了其他需要遵循的重要规则。\n内容推广：我们如何在5个月内通过零付费流量从0增长到32,977个用户。Benji Hyam谈到了社区驱动的内容推广。这意味着，你与目标社区接触，然后分享你的内容，这样它就会增加价值。\n通过您的内容促进社交共享。莎拉·彼得森分享的方法，将帮助读者轻松分享你的帖子。\n我让235个人在推特上转发我的文章，我得到的都是这个令人不快的案例研究。这是一个有趣的实验！约书亚·哈德威克(Joshua Hardwick)给那些在推特上发布类似帖子并要求发布推广推文的作家发了一封冷淡的电子邮件。你也可以试试这个。\n保罗·夏皮罗在分享他人内容的同时推广自己的内容。😯你有没有试过把你的博客包含在别人的博客帖子的UTM参数中？保罗会教你这个聪明的窍门。\n在Medium和LinkedIn上转贴内容的战略指南，作者：瑞安·巴尔斯。重新出版策略会带来增长还是会带来惩罚？瑞安·比尔斯就这一话题制作了信息性播客&amp；文章。\n让人们阅读你在Facebook上发表的博客帖子的简单方法，作者是亚当·罗杰斯(Adam Rogers)。优化你在Facebook上重新发布的内容的好主意。\n内容营销不仅仅是让人们阅读你的精彩文章(并在以后使用你的产品)。它也是关于发展和维护与社区的关系。\n影响力营销的重点是与意见领袖合作，将公司的信息/产品/服务推向更大的市场。📚这些长长的指南将有助于开始：\n你不应该害怕接触那些很酷的人。乐于助人、和蔼可亲、富有创造力：\nGroove创始人亚历克斯·特恩布尔(Alex Turnbull)写的“我用来与VIP连接的确切电子邮件脚本”。\n8个电子邮件推介模板，用于与Sapph的Influencers合作。向有影响力的人询问晋升、贡献、合作关系或评估的很好的指南和示例。自定义并使用它们！\n😱我刚刚没看就删除了你的外展电子邮件。不，我不觉得抱歉，作者：Tim Soulo。Tim展示了如何以正确的方式向有影响力的人发送电子邮件的很酷的例子。请在联系意见领袖之前阅读这篇文章！\n如果你不能通过电子邮件表达自己，那么你就不值得任何人花时间。人们很忙，你应该避免含糊的信息，那样只会浪费时间。阅读这篇简短的文章，了解意见领袖希望在他们的收件箱中看到什么。\n26条头条新闻：如何在Venngage的会议上与有影响力的人建立联系。不要害怕与人交谈！\n与人交往：你最近为我做了什么？作者：诺亚·卡根(Noah Kagan)，一位颇受欢迎的IT企业家和影响力人物。我喜欢他简短的指导，让人们更容易答应你的请求。\n我们如何在24小时内从亚历克斯·特恩布尔(Alex Turnbull)的一篇博客帖子中获得1000多名订阅者。Groove团队与有影响力的人建立了关系，以便在他们的博客上获得第一批读者。那里的战术很聪明！\nInfluencer Marketing如何帮助我们将月收入从0美元增长到70万美元以上。Sergei Gusev展示了他们如何在付费影响力营销平台的帮助下扩展影响力营销。他故事的第一部分在这里。\n通过Klear查找Twitter Influencers。它可以免费搜索10个关键字(技能)。付费版有更高级的选项。\n社交网络。您可以通过检查关键字搜索、关注者数量和参与度来找到意见领袖。\nTwitonomy从他的Twitter个人资料中给出了关于有影响力的人的详细信息。它可以显示定期与有影响力的人互动的人。这些人可以成为你进入顶尖利基人群的起点。\nFollowerwank Analyst给出了一个关于任何Twitter用户网络的巨大数据库。这个免费的工具向你显示关于用户追随者和该用户追随的人的信息。因此，您可以找到参与的最佳时间、热门用户、位置信息等。\n使用RSS应用程序从有影响力的博客中获取内容。你可以评论这些帖子，并通过你的社交媒体分享好的帖子。Selfoss是一款不错的RSS应用程序。它是开放源码的，所以你可以深入研究它的代码并定制一些东西。\nProduct Hunt(PH)是一个发现、分享和极客了解科技新产品的地方。在那里提交你的产品是一个很好的出现在记者、技术人员和同行制造商面前的方式。提交后，该产品将参加日常比赛。比赛从太平洋标准时间00：00开始，以太平洋标准时间23：59结束。你必须在一天结束前获得尽可能多的好评！🏆最成功的产品出现在主页上，可以获得很多诚实的反馈、下载、用户和公关热议。请查看PH成功案例，以确定PH是否是适合您的发射平台！\n从发帖的基本规则开始：如何发帖或评论，如何寻求支持，如何访问主页。然后阅读关于产品猎头每个人都应该知道的五件事。加入PH社区，感受一下它是如何运作的，然后再实际开始你的活动。\n😱成功PH发布需要大量的准备、发布期间(24小时++)的推广和后续工作。这些指南将帮助您：\n产品狩猎101，来自顶级猎人之一罗布莱·贾马(Robleh Jama)。这是非常有用的听取启动算法的人，谁提交了许多不同的产品。\n来自俄罗斯Amplifr公司的SaaS创始人寻找产品指南。这是一个关于你的产品准备(入职、语言检查、电子邮件和其他不太明显的东西)的很好的教程。\n“产品猎头：什么管用，什么不管用”(Product Hunt：What Work and What Not)[案例研究指南]，由3D建模应用程序推出，于2016年12月在PH网站上发布。这些人没有典型的面向初创企业受众的甜蜜产品，他们推出的产品也不怎么样。我鼓励您考虑一下您将投资于PH启动的资源与可能的结果！\nProduct Hunt对开发人员工具有用吗？-这是我们在PH上发布的故事。我们分享了我们的营销策略和所有结果：流量数字、试验安装和销售。另外，我们还做了一个关于“产品猎头会议”的演讲，这是它的幻灯片。希望，这会帮助你们中的一些人在产品猎头上取得成功！\n你可以在历史排行榜或500强猎人排行榜上找到顶级猎人的名单。\n一份关于PH的100个支持率最低的项目的动态榜单。这是很好的检查失败的PH发射案例。\n在一张图表中显示每日PH排名前5位的产品，这可以向你展示每天上涨的动态。\nMakerTools可以让你在Twitter上创建一个推特列表，上面列出了所有称赞你的产品的优秀人士。这是一个很好的做法，感谢那些通过Twitter支持你的PH发布的人。\n当人们实时询问问题时，在您的发布活动期间，Crisp Live Chat非常有用。这样的交流可以提高你网站的转化率，给你很多洞察力。我们使用的是它的免费版本，到目前为止，它非常棒。\n如何从头开始创建社交媒体营销战略，缓冲区营销总监凯文·李(Kevin Lee)著。这是一本关于制定SMM战略的基础知识的综合性长篇读物。\n如果您有多个社交媒体帐户，请使用仪表板和工具在一个位置管理它们。我最喜欢的是Buffer和HootSuite(都有免费选项)。这些工具都是有价值的。\n..", "note_en": "💎 It’s a hand-picked collection of resources for solving practical marketing tasks, such as:\n  We faced these questions, when we made our first product (tool for iOS engineers). It took us almost 2 years to learn how to market our project.  😤 During this time we read, tried and bookmarked many useful things: articles, videos, spreadsheets, podcasts &amp; tools. These resources helped us a lot! Please, learn, adapt and test awesome marketing hacks from our collection &amp; experience. Good luck!\n Lisa &amp; Ahmed, founders of  Flawless App, tool to verify iOS app according to the design\n   Go through our Table of Contents. To help you navigate, we`ve added brief overviews of every marketing category. Also, content titles are displayed as clearly as possible (so it will tell you the context and how you can benefit from it).\n Search for a keyword or phrase (for example, “Product Hunt”, “Facebook”, “Blog”).\n If you have found some great marketing content or tool, please, contribute to Marketing for Engineers collection. Simply submit a Pull Request with respect to our  Contribution Guidelines. We would love you to see your suggestions!\n    User research gives you an answer for whom is your product. Analysing potential users &amp; customers will help to:\n outline product roadmap, key features, UI design and UX scenarios for interacting with your product;\n I hope that I have convinced you that user research is very important. After learning these materials you should be able to make user research, create basic Persona and validate it on real people:\n Empathy Mapping is one more technique, which widely used in UX for user research. This  Practical Guide to Empathy Maps will give you a good overview of this approach.\n You need to reach your potential users and validate your Persona &amp; hypothesis. You can get real users insight through surveys, interviews, online &amp; offline meetings, chats, Skype calls, checking existing analytics (Google Analytics, social media data), analyzing competitors&#39; customers, ethical googling your users&#39; emails &amp; names and researching them on social media:\n 9-min  video on creating a Persona, when you already have something to analyze: website, followers for your product on Twitter\\Facebook, first users or paying customers.\n Simple  blueprint for conducting a thorough buyer&#39;s journey study. It&#39;s a bit old article, but it has a nice plan for making user research interviews (study) with current or potential users.\n Asking the right questions during user research, interviews and testing will be in use when you actually start talking to potential user ( 😤 you must do this).\n 👆 User research is an initial part of customer discovery process. You should not only research your potential users but also test if what you want to build is needed on the market (it’s called Product Market Fit). If you are not familiar with Lean Startup approach, I advise you to check these resources. It&#39;s more startup-oriented, but still relevant for newbie product makers:\n   LinkedIn search and brief  article from LinkedIn team on how to use their new search (it&#39;s very easy!).\n  The Buyer Persona Word Doc  Generator from HubSpot can help you to make the first hypothesis for your persona.\n TypeForm is an easy-to-use, mobile-optimized form-builder that&#39;s great for gathering online surveys. You also can use Google Forms for making online surveys.\n  How is your product better than other solution? What is unique about your side project, open source tool or mobile app? What do you understand about your business that other companies in it just don&#39;t get?\n You should have answers to all these questions. Market research will help you out! Personally, I define Market Research as a combination of User Research and Competitor Analysis. The first part we discussed in the section above. And these guides will explain how to research your competitors, catch trends and validate market opportunity:\n   Google Advanced Search Operators is a competitive audit tool to help you find exactly what you’re looking for  🙂\n  SimilarWeb provides detailed info on different sites &amp; overview of thier marketing strategy. Free version is pretty good.\n Alexa is one of the oldest web analytics tools out there, but it’s still a great option with strong free version.\n  With  Buzzsumo you can find the most shared content for a given topic or competitor. In a free version you will get the full page of content with many filters.\n  You will find here a collection of free marketing channels for getting the first users. Most of them will take a lot of time &amp; effort, but will not cost money to do it yourself. Some channels, like Content Marketing or Influencer Marketing, are comprehensively explained in its own directories below. So, get fresh ideas from these real-life stories and think what could work for your users:\n Do Things that Don&#39;t Scale by Paul Graham. He is a co-founder of Y Combinator, computer scientist, investor, and entrepreneur. Paul shows how such popular companies as Stripe, Airbnb or Facebook got their first users. It&#39;s more philosophical read for helping your brain to think in the right direction.\n How to Grow Your Startup on a $0 Marketing Budget by Hiten Shah. It highlights a bunch of different ideas to try.\n How We Got Our First 2,000 Users Doing Things That Don’t Scale by amazing Ryan Hoover, co-founder of Product Hunt.\n How we got from $0 to $75,000 MRR with zero marketing budget by Sergei Gusev. They sent free products (designer fragrance) to the market influencers and got video reviews. It grew their sales dramatically!\n How We Got Our First 100 Paying Customers in 24 Hours by Alex Turnbull, founder of Groove.\n Comment Marketing: How to Earn Benefits from Community Participation by Rand Fishkin. You can gain attention to your company by sharing meaningful opinions and thoughts. Rand Fishkin made an excellent 9-minute video on using this technique  👌.\n How to create  Online Courses and  Webinars to get users for your product. Very clever marketing tips in these The Startup Chat podcasts!\n 5 Places to Find and Poach Your Competitors&#39; Customers. Sapph shares many smart ways to find leads and pitch them.\n Hacking the Press: Clever Ways to Get Free Press Coverage with Zero Budget by Tucker Schreiber from Shopify. The post is focused on online stores industry. But the principles of getting free press attention are applicable to any market.\n How to Get Press Coverage for Your App: practical guide from Dan Counsell, indie developer &amp; agency founder.\n Referral Marketing and  Mobile Referral Marketing can give you the word-of-mouth growth. For inspiration check  51 Best Referral Program Examples of 2016. These useful guides were prepared by Brandon Gains from Referral Saasquatch.\n 5 Low-Cost Guerrilla Marketing Tactics via Braveen Kumar.  🐒 Direct offline exposure via foot traffic would suit physical products and brave founders.\n Use free tools for lead generation when you have a difficult software product with many use cases. It&#39;s a great way to show benefits of your main offering and increase brand awareness. This post shows how to sell Clearbit API-solution via free easy-to-use tools. You can invest your time and make some free stuff as well — UI kits, browser extensions, funny games or open source tools.\n We used many free marketing channels. To be honest, when we started  Flawless App we didn&#39;t have other ways. We wrote cold emails, talked to influencers, manually recruited users at events, posted at Facebook groups, worked with developers &amp; designers via Twitter and did many other stuff. These gave us our first 1000 beta users. So it worth trying out!\n  Content marketing is about promotion via content. You can run a personal blog, guest blog or write at platforms, like Medium (or combine it). Focus on how you can help your users with your content. You don&#39;t have to be a professional writer for making cool articles. Just give yourself space to be creative and share your expertise.\n I encourage you to start doing content marketing by yourself. Outsourcing it can be very tricky, especially at the beginning. 🤔 Firstly, think how your blog or content is you going to stand out. There are plenty of cool blogs in every industry. How are you going to be different? What unique value can you offer to your users? How can you build an engaged readers community? And the most important question is how you will convert readers into leads. With all those considerations, you should create a content strategy:\n Growing From 0-12k Organic Visitors by Mapping Content to the Sales Funnel by Benji Hyam. This post shows how to make the content strategy for mobile and web-oriented blog.\n Behind the Scenes: How We’ve Built a $5M/Year Business in 3 Years With Content Marketing by Alex Turnbull. An exciting story how Groove rebuilt their content marketing strategy with the focus on what could actually help their market.\n A case study with the framework on  Creating Content That Generates 400,000 Targeted Visitors by Brian Dean.\n     And don&#39;t forget to calculate  The Customer Acquisition Cost of Content Marketing. Devesh Khanal has divided the cost into 3 categories: costs per article, salary costs and technology costs. You can repeat his calculations for your case and get approximate budgets.\n  Start by creating a blog that not only touts your product but offers helpful recommendations, tips &amp; tricks, links, etc. Check what competitors&#39; blogs are publishing, what is popular in the industry and what your users are interested in. Align your article ideas with the content strategy, you have already defined. To get some inspiration scroll these bits of advice:\n How We Come Up With Ideas for the Blog by Emily Triplett Lentz from Help Scout team.\n How to Generate Content Ideas With These 3 Awesome Tools. Robert Katai shows how to use tools  🔎 to find out what people are asking about your industry (via keywords).\n 266 blog post ideas from Ed Leake. It’s a mix of many topics to write about. Feel free to scroll it and steal relevant stuff.\n A Simple Guide To Figuring Out What To Blog About. As Marko Saric mentioned,  🙏 the perfect topic is found by interlinking your passion and personality with the demand from the market.\n If you have skipped articles in the Content Marketing section above, I do encourage you to read them! The first 4 articles have excellent frameworks for getting strategic content ideas.\n Pick the most appropriate content format — video, list, long-read. Then think about the right headline for driving interest to your great article:\n   The Complete Guide to Blog SEO. Ryan Stewart covers more than just making your blog SEO-friendly. Ryan talks about blog strategy, keywords research, and promotion of your blog via building links to posts.\n How To Rank Your Blog Posts On Google’s First Page. Marko Saric keeps focus on SEO optimization for WordPress blogs.\n The 10 Types of Content That Work Best for SEO. Rand Fishkin advises on which format should you use for your project.\n How To Use 11+ Free Tools To Find Prequalified Content Ideas for SEO from Nate Shivar. The article will teach you how to prequalify your content ideas with SEO research.\n  To check that your content is unique you can use  this site or online tools. I use this  Ru-checker.\n  Medium is an online publishing platform with the huge active community. You can make your blog there and engage with your users and Medium readers. You still need to promote your articles yourself. Medium is a high-traffic community, but you are not the only one who competes for attention.\n Basics of writing on Medium. How to write, edit, publish and add your article to publications:\n  Articles, where you can find what topics, titles, collections, tags, categories and post length are popular for Medium readers:\n Guide from Medium team on  making your publicatio(basically, your blog) and nice tutorial  How to Make Your Publication Look Great by Elizabeth Tobey.\n   35 Actionable Tips to Grow Your Medium Blog (timing, some promotional tips) by Ali Mese.\n Publishing on Medium or elsewhere removes all your technology hassles. It&#39;s a good place to start implementing your content marketing strategy.\n  You need to promote content on your own blog, Medium or guest platforms. Some ideas how to spread the word about your great articles and make it more shareable:\n 39 Free Places to Promote Blog Posts Once You Hit Publish. Learn about every platform before sharing your content there (or you will become a spammer 💩). At the end of the article Shafi Khan mentioned other important rules to follow.\n Content Promotion: How We Grew from 0 to 32,977 Users in 5 Months With Zero Paid Traffic. Benji Hyam talks about community-driven content promotion. It means, that you engage with the targeted community and then share your content so that it adds value.\n  Boost Social Sharing From Your Content. Sarah Peterson shared methods, that will help readers to easily share your posts.\n  I Asked 235 People to Tweet My Article and All I Got Is This Cheerless Case Study. It&#39;s an interesting experiment! Joshua Hardwick cold emailed writers who tweeted similar posts and asked for a promotional tweet. You can try this too.\n Sharing Other People Content and Simultaneously Promoting Your Own by Paul Shapiro.  😯 Have you ever tried to include your blog in the UTM parameters of somebodies else blog post? Paul will teach you this smart hack.\n Strategic Guide to Reposting Content on Medium and LinkedIn by Ryan Battles. Does re-publishing strategy lead to growth or penalties? Ryan Battles made informational podcast &amp; article on the topic.\n The Simple Way to Get People to Read Your Blog Post on Facebook by Adam Rogers. Nice ideas on optimizing your republished piece of content on Facebook.\n Content Marketing is not only about getting people to read your amazing articles (and use your product later). It&#39;s also about developing and maintaining relationships with the community.\n  Influencer marketing is focused on working with opinion leaders to drive company message/product/service to the larger market.  📚 These long guides will be good for thestart:\n  You should not be afraid to reach to the cool people. Be helpful, nice and creative:\n The Exact Email Scripts I Use to Connect With VIP’s by Alex Turnbull, founder of Groove.\n 8 Email Pitch Templates to Partner with Influencers by Sapph. Nice guides &amp; examples for asking promotion, contribution, partnership or review from the influencer. Customize and use them!\n 😱  I Just Deleted Your Outreach Email Without Reading. And NO, I Don’t Feel Sorry by Tim Soulo. Tim shows cool examples how to email influencers in the right way. Please, read this post before contacting opinion leaders!\n If you can’t express yourself by email, you’re not worthy of anyone’s time by Pieter Levels. People are busy and you should avoid vague messages, which only steals time. Read this brief article to understand what opinion leaders want to see in their inbox.\n    26 Headliners on How to Connect with Influencers at Conference by Venngage. Don&#39;t be afraid to talk to people!\n Connecting with Others: What Have You Done for Me Lately? by Noah Kagan, popular IT entrepreneur &amp; influencer. I loved his brief instruction on making its easier for people to say YES to your request.\n  How We Got 1,000+ Subscribers from a Single Blog Post in 24 Hours by Alex Turnbull. Groove team built relationships with influencers for getting the first readers on their blog. Very smart tactics there!\n  How Influencer Marketing helped us grow from $0 to $700k+ monthly revenue. Sergei Gusev shows how they scaled influencer marketing with the help of paid influencers marketing platforms. The 1st part of his story is  here.\n  Find Twitter Influencers via Klear. It&#39;s free for 10 keyword searches (&#34;skill&#34;). Paid version has more advanced options.\n Social networks. You can find opinion leaders by checking the keywords search, followers number and engagement level.\n Twitonomy gives a detailed info about influencer from his Twitter profile. It can show people who are interacting with the influencer on the regular basis. Those people can become your starting point to get to the top-niche person.\n Followerwonk Analyze gives a huge database about any Twitter user&#39;s network. This free tool shows you info on user followers and people, whom this user follows. So you can find the best time to engage, popular users, location info, etc.\n Use RSS apps for getting content from influencers&#39; blogs. You can comment those posts and share good one via your social media.  Selfoss is a good RSS app. It&#39;s an open source, so you may dig into its code and customize things.\n  Product Hunt (PH) is a place to discover, share, and geek out about new products in tech. Submitting your product there is a good way to appear in front of journalists, tech people and fellow makers. After submission, the product will participate in the daily race. The race starts PST 00:00 and finishes PST 23:59. You have to get as many upvotes and comments as you can by the end of the day!  🏆 The most successful products appear on the Homepage and can get a lot of honest feedback, downloads, users and PR buzz. Please, check success PH stories to decide if PH is the right launch platform for you!\n Start with  basic rules on Posting: how to post or comment, how to ask for support, how to get to the homepage. Then read  Five things everyone should know about Product Hunt. Join the PH community and feel how it works, before actually starting you launch activities.\n 😱 Successful PH launch takes a lot of preparation, promotion during the launch (24h++) and follow-up work. These guides will help you:\n Product Hunt 101 from one of the top hunters, Robleh Jama. It&#39;s very useful to listen to the launch algorithm from the person, who submit a lot of different products.\n The SaaS founder’s guide to Product Hunt from the Russian company, Amplifr. It&#39;s a nice tutorial about your product preparation (onboarding, language check, emails and other not obvious stuff).\n  Launching on Product Hunt: what works and what doesn’t [guide &amp; case study] by 3D modeling app, who launched on PH in December 2016. These folks have not typical &#34;sweet product for startup audience&#34; and their launch was &#34;so-so&#34; good. I encourage you to think about resources you will invest in PH launch versus possible outcome!\n Is Product Hunt useful for developer tools? - it&#39;s our story of launching on PH. We shared our marketing tactics and all results: traffic numbers, trials installations and sales. Also, we made a talk on Product Hunt meetup, here is  the slides from it. Hope, it will help some of you to succeed on Product Hunt!\n  You can find a list of top hunters at  All-time Leaderboard or  Top 500 Hunters.\n A dynamic list of the  100 least upvoted projects on PH. It&#39;s good to check failed PH launch cases.\n Daily Top 5 products on PH in one chart, which can show you dynamics of upvote grows on daily basis.\n  MakerTools allows you to create a Twitter list of all the wonderful folks who upvoted your product. It&#39;s a good practice to thank those people for supporting your PH launch via Twitter.\n Crisp Live Chat is very useful during your launch campaign when people ask things in a real-time. Such communication can increase conversion at your site and give you a lot of insights. We use the free version of it and it&#39;s awesome so far.\n   How to Create a Social Media Marketing Strategy From Scratch by Kevan Lee, Buffer Marketing Director. It&#39;s a comprehensive long-read about basic of making your SMM strategy.\n  When you have multiple Social Media accounts, use dashboards &amp; tools for managing them in one place. My favorite ones are  Buffer and  Hootsuite (both have free options). These tools have buil\n......", "posttime": "2020-05-24 13:12:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工程师,marketing", "title": "面向工程师的市场营销", "title_en": "Marketing for Engineers", "transed": 1, "url": "https://github.com/michael-andreuzza/Marketing-for-Engineers", "via": "", "real_tags": ["工程师", "marketing"]}, {"category": "", "categoryclass": "", "imagename": "b5e5735e582f7f0dad671cdc25f7cee2.png", "infoid": 1003484, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你是一个博客写手，你可能会发现这篇最近从博客分享给YCombinator的黑客新闻组的文章很有趣。它可能有点悲观，但对#博客圈的事态有一些公正的观察。\n现在几乎不可能找到一个主题不集中的博客，因为这是搜索引擎关注的重点，也是网站如何获利的。但你想要的恰恰相反，一个从来没有试图集中精力，甚至从来没有想过这一点的博客。\n关于目前唯一重要的搜索引擎谷歌在博客圈中的角色的观察是值得考虑的。在黑客新闻(Hacker News)的讨论中，作者因为说谷歌博客作者已经死了而受到了一些批评-这本身似乎是一个相当公平的批评，如果从迂腐的意义上说不是严格准确的话。谷歌几年前基本上就抛弃了博客作者。当然，我们自己的lightineX博客是在这里托管的，但我们并不否认谷歌充其量也就是对他们的博客平台无动于衷。\n社交媒体平台的崛起，如Twitter、Facebook、Instagram，以及最近的TikTok，为受众带来了更多的自我表达和交流选择。同样，随着越来越多的人接入宽带，播客和视频博客(视频博客，主要是在谷歌YouTube)的兴起也变得更加流行。\n另一方面，自从人们开始从家里上网以来，互联网上就有了作家，仍然有很多伟大的博客作者写着发人深省的散文、辛酸的暖心日记、短篇小说和同人小说，以及记录新闻。\n一些最有趣的小企业通过撰写长篇博客帖子，以及通过社交媒体撰写短篇或微博来与受众建立联系。\n在米苏拉，我们最喜欢的一家当地餐饮公司在意识到一场潜在的严重的全球#COVID19流行病即将到来时，改变了他们的商业模式，并创建了一种美食预制餐CSA，以当地生产的有机和可持续的食材为特色。\nTrue Food Missoula战略的一部分是让客户了解他们的新业务的Weekly Wellness博客，在那里，包括Katharine Roggeveen在内的作家可以写下他们每周的菜单(这份菜单包括羊肉罗宋汤和野生羊肚菌和烤芦笋汤！)，当地的有机农产品供应商，以及配料和其他食物选择的各种健康方面。\n世界各地每天都有有趣的人创建新的博客。人们仍然认为这是值得做的，尽管与谷歌搜索算法更友好的时候相比，现在更难接触到他们的受众，谷歌阅读器的存在是为了帮助读者跟踪他们以后想要读的东西，或者已经读过和喜欢的东西，以及可能想要分享的东西。\n这一切都是为了与你的观众建立联系。封闭式生态系统社交媒体和利润最大化算法的兴起无疑改变了博客圈，但其他东西也改变了这一点。\n精心设计的、特定于平台的社交媒体使用，可以通过交叉推广他们的长篇博客文章，帮助博客作者更快地接触到更多的受众。幸存下来的博客平台，如WordPress，在创建一个好看的、读者友好的、移动友好的网络博客方面比以往任何时候都要好。甚至连谷歌博客也更新了一些模板，为像我们这样的博客作者提供更友好的移动体验，他们一直住在破败的好莱坞博客平台上。\n我们的博客专业编辑器iBlogger是2008年iPhone App Store上的首批应用程序之一。我们上一次更新是在2017年11月-两年半前。\n我们知道，两次更新的间隔时间很长。关于为什么我们不能在并行构建iBlogger 3的同时继续更新iBlogger 2，有一个漫长而令人悲伤的故事。它涉及到我们的一位同事的濒死体验，他当时是iBlogger的关键开发人员。不过，有趣的是，多年来我们一直对博客非常感兴趣，尽管它从来没有赚过钱。\n你看，大多数博客作者希望他们的博客工具是免费的，或者至少能够免费试用，以确保它们首先有效。在最长和非常令人沮丧的时间里，在iPhone应用商店上没有一个很好的方法来做到这一点。\nLightineX是免费互联网下载的先驱。1999年，我们在实验室创建了第一个在Mac OS X(可能在任何平台上)上安全且真正无缝的应用内购买系统，并于2000年向市场交付，iXregider/iXLicenser从最早的时候起就是我们用于Mac OS X的Infinity Game Pax的一项功能。在我们的实验室中，iXLicenser/iXLicenser从一开始就是我们用于Mac OS X的Infinity Game Pax的一项功能。(这些内部组件名称从未公开过。它只是购买许可证的按钮。)。\n我们理解先试后买模式对我们客户的价值。但是苹果的开发者和客户多年来一直在抱怨，但都无济于事。\n与此同时，我们发现了博客社区和App Store市场供需交叉的一个不幸的怪癖。\n这是一个奇怪的现象。在大多数市场，如果你降低顾客喜欢的产品的价格，会有更多的顾客购买。对于iBlogger来说，这也是真的。但在大多数市场，你会以更低的价位获得更多的客户，收入也会增加。最低价位通常受到生产成本的限制。你不可能真的在每一次销售中都损失一点，而且由于销量的原因还能继续经营下去。\n然而，奇怪的是，价格在0.99美元到9.99美元之间的曲线斜率是这样的：我们几乎可以用更低的价格获得几乎完全相同的新客户数量，从而使收入持平。\n低于0.99美元(免费价格等级)，我们每天会有数百名新用户。他们中的许多人使用该产品已有多年。\niBlogger 2在最初发布的大约18个月内创建了100多万条帖子。\n这可能还不算太糟糕。通常，对于软件来说，对这种情况的正确反应是将价格定在0.99美元，然后让它飞起来！\n不幸的是，iBlogger是个例外。它不是一个独立的软件系统。为了对客户有用，它需要连接到他们的博客。\n博客写手有时需要帮助，让产品与他们的博客协同工作(即使我们免费赠送)。这意味着我们的技术支持成本不是零。\n因此，为了能够帮助博客开始使用，我们不得不限制销售，将价格维持在9.99美元，在App Store上提供它的十年中的大部分时间里，它一直保持在这个水平(大约18个月前，iPad界面的要求迫使我们暂时将该产品从App Store中移除)。\n有时候，我会花一个周末的时间来做技术支持，花0.99美元打折，甚至免费赠送iBlogger，以吸引更多的人使用它。毕竟，这就是我们建造它的原因。使用它的人越多，我们就越快乐。\n然后在周一早上，我将价格调回到9.99美元，这根本不会影响产品收入，但意味着我们只有10%的技术支持请求(通常是错误的密码和错误的博客，这些不是由我们的产品造成的，但它们阻碍了客户使用我们产品的能力)。\n因此，在一个意外地合谋让这些项目在所有规模(从博客作者到平台再到工具制造商)亏损的世界里，制作好的博客工具是一个有点挑战的问题。\n有更多的人在思考像博客和播客这样的独立声音对自由社会的重要性。\n如果你有一个WordPress博客和一部iPhone或iPad(IOS13)，我们希望你会尝试一下。让我们知道哪些其他博客平台对您很重要，以及您希望看到哪些功能。\n对于如何让iBlogger比这款数千名博客作者十年来喜爱的产品更好，我们有很好的想法，我们已经投入巨资，为SWIFT和现代可可框架的未来打下坚实的基础。\n核心文本博客功能是免费的，并且永远是免费的。我们希望您喜欢这个产品，以便订阅。\n我们认为博客有一个光明的未来，我们希望通过iBlogger 3帮助实现这一目标。", "note_en": "If you&#39;re a blogger, you might find this essay, recently shared to YCombinator&#39;s  Hacker News from a blog, to be of interest. It&#39;s perhaps a little pessimistic, but has some fair observations about the state of affairs in the #blogosphere.\n   It&#39;s almost impossible now to find a blog that&#39;s not on a focused theme because that&#39;s what search engines focus on and how websites profit. But you want the opposite, a blog that never tried to focus or even thought about it.\n The observations about the role of the only search engine that presently matters, Google, in the state of the blogosphere are worthy of consideration. In the discussion at Hacker News, the author was criticized a bit for saying that Google Blogger was &#34;dead&#34; —which itself seems a pretty fair criticism if not strictly accurate in a pedantic sense. Google basically abandoned Blogger in place years ago. Sure, our own illumineX blog is hosted here but we&#39;re not in denial about the fact that Google is at best indifferent to their Blogger platform.\n  The rise of social media &#34;walled garden&#34; platforms like Twitter, Facebook, Instagram, and recently TikTok, have brought more options for self-expression and communication to an audience. Similarly the rise of podcasting and &#34;vlogging&#34; (video blogging, mostly at Google YouTube) have become more popular as more people have access to broadband.\n  On the other hand, there have been writers on the Internet since people started connecting from home, and there are still lots of great bloggers writing thought-provoking essays, poignant heartwarming diaries, short stories, and fan fiction, as well as documenting news.\n  Some of the most interesting small businesses connect with their audiences by writing long-form blog posts, as well as short-form or microblogging via social media.\n  In Missoula, one of our favorite local catering companies pivoted their business model when they realized a potentially serious global #COVID19 pandemic was on the horizon, and created a gourmet prepared-meal CSA featuring locally produced, organic and sustainable ingredients.\n  Part of the  True Food Missoula strategy to let their customers know about their new business is the  Weekly Wellness blog where writers including Katharine Roggeveen write about their  weekly menu (this one included lamb borscht and a wild morel mushroom and grilled asparagus soup!), local organic produce suppliers, and various health aspects of ingredients and other food choices.\n  New blogs created by interesting people every day, all around the world. People still find it worth doing, even though it&#39;s harder to reach their audience than it was when the Google Search algorithm was friendlier, and  Google Reader existed to help readers keep track of things they wanted to read later, or had read and liked and might want to share, later.\n  It&#39;s all about connecting with your audience. The rise of both closed-ecosystem social media and the profit-maximizing algorithm has definitely altered the blogosphere, but other things have, too.\n    Carefully crafted, platform-specific use of social media can help bloggers reach a larger audience, faster, by cross-promoting their long-form blog essay. The blog platforms which have survived, like WordPress, are better than ever before at creating a good-looking, reader-friendly, mobile-friendly  blog. Even Google Blogger updated some templates to allow a friendlier mobile experience for bloggers, like us, who have stayed with that decaying Hollywood mansion of a blog platform.\n        Our specialized editor for blogs, iBlogger, was one of the first apps on the iPhone App Store in 2008. Our last update was in November of 2017 — two and a half years ago.\n  That&#39;s a long time between updates, we know. There&#39;s a whole long sad saga of why we weren&#39;t able to continue updating iBlogger 2, while building iBlogger 3 in parallel. It involves a near-death experience of one of our colleagues, a key iBlogger developer at the time. Really, though, the interesting part is that we remained profoundly interested in blogging over the years, even though it has never been a money maker.\n  Most bloggers, you see, wanted their blogging tools to be free, or a least be able to try them out for free to make sure they worked, first. For the longest and very frustrating time, there just wasn&#39;t a good way to do that, on the iPhone App store.\n  illumineX was a pioneer in the free internet download. We created what may have been the first secure and truly seamless In-App Purchase system on Mac OS X (maybe on any platform) in our labs in 1999 and delivery to market in 2000, iXRegistrar / iXLicenser was a feature of our Infinity Game PaX for Mac OS X from the very earliest days. (Those internal component names were never public. It was just the &#34;Purchase a license&#34; button.)\n We understood the value to our customers of the try-before-you-buy model. But Apple didn&#39;t. Developers and customers complained for years, to no avail.\n  Meanwhile, we had discovered an unfortunate quirk of the supply and demand intersection of the blogging community and the App Store marketplace.\n    This is an odd phenomenon. In most markets, if you lower the price of a product which customers like, more customers will buy it. This was true, for iBlogger, too. But in most markets, you get lots more customers at lower price points, and revenue increases. The minimum price point is usually limited by the cost of production. You can&#39;t really lose a little on every sale, and stay in business due to volume.\n  Weirdly, though, the slope of the curve at prices between $0.99 and $9.99 was such that we would get almost exactly the number of new customers at a lower price to make revenue flat.\n    Below $0.99 (the Free price tier) we would get hundreds of new users a day. Many of them used the product for years.\n  Over a million posts were created with iBlogger 2 within about 18 months of its initial release.\n     That might not have been too bad. Ordinarily the right response to this situation for software is to just put the price point at $0.99 and let it fly!\n  Unfortunately, iBlogger was an exception. It&#39;s not a stand-alone software system. In order to be useful to the customer, it needs to connect to their blog.\n  Bloggers sometimes wanted help making the product work with their blog (even if we gave it away for free.) This meant that we had a non-zero tech support cost.\n  So, in order to be able to help bloggers get going, we had to limit sales by keeping the price at $9.99, where it stayed for most of the decade that it was available on the App Store (before iPad interface requirements forced us to temporarily remove the product from the App Store about 18 months ago.)\n  Sometimes I would dedicate a weekend to tech support, and have a $0.99 sale, or even give away iBlogger for free, to get more people using it. That&#39;s why we build it, after all. The more people use it the happier we are.\n  Then on Monday morning, I would put the price back up to $9.99, which didn&#39;t affect the product revenue at all, but meant that we had only 10% as many technical support requests (usually bad passwords and misconfigured blogs, which were not caused by our product, but which stood in the way of the customer&#39;s ability to use our product).\n     So, it&#39;s a bit of a challenge to make good blogging tools in a world that accidentally conspires for those projects to lose money at all scales, from the blogger to the platforms to the toolmakers.\n    There are more people thinking about the importance to free societies of independent voices like blogs and podcasts.\n        We hope that you&#39;ll try it, if you have a WordPress blog and an iPhone or iPad (iOS 13). Let us know what other blog platforms are important to you, and what features you would like to see.\n  We have great ideas for how to make iBlogger even better than the product that thousands of bloggers  loved for a decade, and we&#39;ve invested heavily in making a solid foundation for the future in Swift and modern Cocoa frameworks.\n  The core text blogging features are free and will always be. We hope you like the product well enough to subscribe.\n  We think blogs have a bright future, and we want to help make that happen, with iBlogger 3.", "posttime": "2020-05-24 12:56:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博客,blogs", "title": "博客：还没有死，还没有死", "title_en": "Blogs: Not Dead, Yet", "transed": 1, "url": "https://blog.illuminex.com/2020/05/blogs-not-dead-yet.html", "via": "", "real_tags": ["博客", "blogs"]}, {"category": "", "categoryclass": "", "imagename": "9cdf90156fcca1968e600440970c119f.png", "infoid": 1003482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Chromium项目发现，大约70%的严重安全漏洞是内存安全问题。我们的下一个重大项目是从源头上防止此类错误。\n大约70%的严重安全错误是内存不安全问题(即C/C++指针错误)。其中一半是免费后使用的漏洞。\n(基于自2015年以来影响稳定渠道的912个高或严重严重安全漏洞进行分析。)。\n这些错误均匀地分布在我们的代码库中，并且我们的高比例的非安全稳定性错误共享相同类型的根本原因。除了危及我们用户的安全，这些漏洞在我们修复和发货Chrome的方式上也有实际的成本。\nChrome的安全体系结构一直被设计成假定这些bug存在，并对代码进行沙箱保护，以防止它们接管主机。在过去的几年里，这种架构得到了增强，以确保网站彼此隔离。这一巨大的努力使我们-只是-保持在袭击者的前面。但是我们正在到达沙箱和场地隔离的极限。\n一个关键的限制是进程是最小的隔离单位，但是进程并不便宜。尤其是在Android上，使用更多的进程会影响设备的整体健康状况：后台活动(其他应用程序和浏览器选项卡)被终止的频率要高得多。\n我们仍有共享多个站点信息的进程。例如，网络服务是一个用C++编写的大型组件，它的工作是解析来自网络上任何狂人的非常复杂的输入。这就是我们在规则2策略中所称的“末日区域”：网络服务是一个庞大的软目标，并且存在严重的漏洞。\n正如站点隔离通过将呈现器绑定到特定站点来提高安全性一样，我们可以想象对网络服务也是如此：我们可以有许多网络服务进程，每个进程都绑定到一个站点或(最好是)一个源。这将是美好的，并将极大地降低网络服务危害的严重性。然而，它也将爆炸性地增加Chromium所需的进程数量，并引发所有效率问题。\n同时，我们对规则2的坚持阻碍了Chrome开发者发布功能，因为有时启动一个新的过程来处理不可信的数据已经太昂贵了。\n我们不能再从更多的流程或更强大的沙箱中获得足够的创新(尽管这样的事情仍然是必要的)。\n因此，保持优势的最便宜的方法是在源头上压制bug，而不是稍后尝试控制它们。\n我们正在采取一切必要的手段来解决内存不安全问题--大规模修复各类错误，而不是仅仅控制它们，包括：\nstd和abseil假定调用方“对于速度”是正确的，但可以修改它们，以便使用实现更改(Abseil)和编译时标志(LLVM Libcxx)执行基本检查。\n泛化Blink的C++垃圾收集器，并更广泛地使用它(从PDFium开始)。\n由LLVM插件和预提交检查定义和实施。特别是，我们觉得可能有必要禁止来自C++的原始指针。\n对C++开发人员体验进行了重大更改，并对性能产生了一些影响。(例如，没有原始指针、边界检查和垃圾回收。)\n一种设计用于编译时安全检查的编程语言选项，运行时性能影响较小-但显然在C++和新语言之间架起桥梁是有代价的。", "note_en": "The Chromium project finds that around 70% of our serious security bugs are   memory safety problems . Our next major project is to prevent such bugs at   source.\n    Around 70% of our high severity security bugs are memory unsafety problems (that is, mistakes with C/C++ pointers). Half of  those  are use-after-free bugs.\n     (Analysis based on 912 high or critical   severity  security bugs since 2015, affecting the Stable channel.)\n  These bugs are spread evenly across our codebase, and a high proportion of our non-security stability bugs share the same types of root cause. As well as risking our users’ security, these bugs have real costs in how we fix and ship Chrome.\n  Chromium’s   security architecture  has always been designed to assume that these bugs exist, and code is sandboxed to stop them taking over the host machine. Over the past years that architecture has been enhanced to   ensure that websites are isolated from one another . That huge effort has allowed us — just — to stay ahead of the attackers. But we are reaching the limits of sandboxing and site isolation.\n  A key limitation is that the process is the smallest unit of isolation, but processes are not cheap. Especially on Android, using more processes impacts device health overall: background activities (other applications and browser tabs) get killed with far greater frequency.\n  We still have processes sharing information about multiple sites. For example, the network service is a large component written in C++ whose job is parsing very complex inputs from any maniac on the network. This is what we call “the doom zone” in our   Rule Of 2  policy: the network service is a large, soft target and   vulnerabilities  there are of   Critical  severity.\n  Just as Site Isolation improved safety by tying renderers to specific sites, we can imagine doing the same with the network service: we could have many network service processes, each tied to a site or (preferably) an origin. That would be beautiful, and would hugely reduce the severity of network service compromise. However, it would also explode the number of processes Chromium needs, with all the efficiency concerns that raises.\n  Meanwhile, our insistence on the   Rule Of 2  is preventing Chrome developers from shipping features, as it’s already sometimes just too expensive to start a new process to handle untrustworthy data.\n    We can no longer derive sufficient innovation from more processes or stronger sandboxes (though such things continue to be necessary).\n Therefore the cheapest way to maintain the advantage is to squash bugs at source instead of trying to contain them later.\n  We’re tackling the memory unsafety problem — fixing classes of bugs at scale, rather than merely containing them — by any and all means necessary, including:\n std and   Abseil  assume correct callers ‘for speed’, but can be modified to do basic checking with implementation changes (Abseil) and compile-time flags (LLVM libcxx).\n Generalizing   Blink’s C++ garbage collector , and using it more widely (starting with PDFium).\n  Defined and enforced by LLVM plugins and presubmit checks. In particular, we feel it   may be necessary to ban raw pointers from C++ .\n            Significant changes to the C++ developer experience, with some performance impact. (For instance, no raw pointers, bounds checks, and garbage collection.)\n An option of a programming language designed for compile-time safety checks with less runtime performance impact — but obviously there is a cost to bridge between C++ and that new language.", "posttime": "2020-05-24 12:26:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,安全,project,c++", "title": "铬项目发现70%的安全缺陷是内存安全问题", "title_en": "Chromium project finds that 70% of security defects are memory safety problems", "transed": 1, "url": "https://www.chromium.org/Home/chromium-security/memory-safety", "via": "", "real_tags": ["内存", "安全", "project", "c++"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003481, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大纲2020.By-=Desire=-：由deder、hellmood和qkumba编码。一个128字节的Apple II演示程序，它可以生成一些分形的树叶，然后在秋天和冬天的颜色之间循环。该代码基于Hellmod在他的64字节DOS演示中的算法。这是在AppleWin模拟器中拍摄的，不幸的是，我所有的Apple 2设备都处于锁定状态。你可以在这里获得磁盘映像：seasons.dsk(140k)，2020年5月22日)你可以在这里获得源代码，位于我的dos33fsprogs GitHub存储库的双行目录中：GIT克隆https://github.com/deater/dos33fsprogs/为此投票为苹果II(1 MHz6502)用6502汇编语言编写的128Byte演示程序使用高分辨率和6色280x192；图形模式。这种模式有很多复杂的颜色冲突和内存交错问题，这使得编写代码变得很痛苦。Apple II的图形非常简单。没有硬件精灵，没有VBLANK/HBLANK中断，没有滚动，没有调色板更改，没有任何类型的加速。它唯一的功能是两个用于翻页的图形页面(本演示中没有使用)，这取决于Applesoft Basic ROM for&#34；HPLOT&#34；例程，这意味着它至少需要Apple II+(1979年发布)或更高版本的机器。应该可以在II+/IIe/IIc/IIgs上工作，如果你有Applesoft语言卡ROM扩展，甚至可以在Apple II(1977)上工作。\n回到我的演示", "note_en": "Presented at Outline 2020.By -=DEsIRE=-: code by deater, hellmood, and qkumba.  A 128 byte Apple II demo that generates some fractal leaves, then cyclesbetween the colors of fall and the colors of winter.  The code is based on the algorithm by Hellmood in his 64 byte DOS demo&#34;Autumn&#34;.      Filmed in the AppleWin emulator, as sadly all my Apple 2 equipment is stuckat work under lockdown.   You can get the disk image here: \t seasons.dsk (140k), 22 May 2020)  You can get the sourcecode \t \there in the two-liners directory of \tmy dos33fsprogs github repository:   git clone https://github.com/deater/dos33fsprogs/ Vote for this at Pouet   128 Byte demo for the Apple II (1MHz 6502) Written in 6502 assembly language Uses &#34;high-resolution&#34; graphics mode which is 280x192 in 6 colors. This mode has lots of complex color-clash and memory-interleave issues which make it a pain to code for. The Apple II has very simple graphics. No hardware sprites, no VBLANK/HBLANK interrupts, no scrolling, no palette changes, no acceleration of any type. The only feature it has is two graphics pages for page flipping (which is not used in this demo) Depends on the Applesoft BASIC ROM for &#34;HPLOT&#34; routine which means it requires at least an Apple II+ (released in 1979) or later machine. Should work on a II+/IIe/IIc/IIgs, and even an original Apple II (1977) if you have an Applesoft language card ROM expansion\n  Back to my Demos", "posttime": "2020-05-24 12:25:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,apple,ii", "title": "“Apple II Seasons”-由Desire制作的128字节Apple II演示", "title_en": "“Apple II Seasons” – A 128-byte Apple II Demo by DESiRE", "transed": 1, "url": "http://www.deater.net/weave/vmwprod/seasons_demo/", "via": "", "real_tags": ["app", "apple", "ii"]}, {"category": "", "categoryclass": "", "imagename": "a241bf4ad801d910fca10ffc30bfaef8.jpg", "infoid": 1003480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "呆在家里的命令让更多的人远离道路，但全国各地的警察报告说，鲁莽驾驶的情况有所上升。\n在康涅狄格州，与去年相比，交通减少了一半，但致命的机动车事故增加了约40%。\n康涅狄格州警察若瑟·多雷卢斯告诉美国广播公司新闻记者吉奥·贝尼特斯，我们重新发现，随着道路开放，某些人正以此为契机，将自己的车辆推向极限。\n多雷卢斯说，在冠状病毒大流行期间，他们已经看到超过限速15英里的汽车增加了90%。\n下午1点收看美国广播公司。美国东部时间和ABC新闻下午4点直播。美国东部时间每个工作日都有ABC新闻团队对这部小说进行特别报道，包括最新的新闻、背景和分析。\n上个月，州长高速公路安全协会(GHSA)敦促全国司机减速，因为州高速公路安全官员开始报告超速严重激增。\n从3月中旬到4月中旬，加州公路巡逻队在全州范围内发布了近2500张时速超过100英里的传票，比去年同期增长了87%。\n加州现在使用它的700多个电子高速公路标志来显示这样的信息：如果你必须出行，不要超速。\n高速公路和汽车安全倡导者总裁凯西·蔡斯告诉ABC新闻，当你以每小时100英里以上的速度行驶时，这些撞车事故不可避免地会致命或接近致命。\n在马萨诸塞州，车祸的死亡率正在上升。在明尼苏达州，与前几年同期相比，机动车撞车事故和死亡人数增加了一倍多。\n专家们仍然不确定是什么促使人们从事更鲁莽的驾驶行为。\n蔡斯说，有些人可能觉得自己被关在家里，认为这是一种缓解压力的方式。有些人可能一辈子都想做这件事，现在他们发现道路变得有点通畅了，他们正在利用这一局面。\nGSHA负责外部事务的高级主管帕姆·沙德尔·费舍尔(Pam Shadel Fischer)表示，这可能是因为司机在没有其他司机上路的情况下更难测量自己的速度。\n费舍尔说，交通量当然决定了速度，我们称之为羊群心态，这是有道理的。\n在努力打击超速的同时，他们也采取了额外的安全措施，以防止冠状病毒的传播。多雷卢斯说，在康涅狄格州，他们现在交通拦截期间都戴着口罩，使用塑料袋带走司机的文件，并在可能的情况下拍摄文件。\n随着国家重新开放，国家运输安全委员会主席罗伯特·萨姆沃特周一再次呼吁道路安全。\n萨姆沃特说，随着我们迈向新常态，我们需要安全到达那里。不要超速。开车时不要分心。\n根据GHSA的说法，现在判断一些已经解除避难所命令的州是否看到超速或鲁莽驾驶恢复到大流行前的水平还为时过早。\n蔡斯说，看看当更多的人开始上路时会发生什么，这将是一件有趣的事情。当原地避难令解除后，这种危险和致命的行为是否会减少。", "note_en": "Stay-at-home orders are  keeping more people off the roads, but police across the country are reporting a rise in reckless driving.\n In Connecticut, traffic has been cut in half compared to last year, but fatal motor vehicle accidents are up by about 40%.\n  &#34;We&#39;re finding that with the open roads, certain individuals are taking this as an opportunity to push their vehicles to the limit,&#34; Connecticut State Police Trooper Josue Dorelus told ABC News&#39; Transportation Correspondent Gio Benitez.\n  Dorelus said they have seen a 90% increase in cars going over 15 miles above the speed limit during the  coronavirus pandemic.\n Tune into ABC at 1 p.m. ET and ABC News Live at 4 p.m. ET every weekday for special coverage of the novel   with the full ABC News team, including the latest news, context and analysis.\n The Governors Highway Safety Association (GHSA) urged drivers nationwide last month to slow down as state highway safety officials started reporting a &#34;severe spike&#34; in speeding.\n  The California Highway Patrol  issued nearly 2,500 citations statewide for driving over 100 miles per hour from mid-march to mid-April -- an 87% jump from the same time last year.\n California is now using its more than 700 electronic highway signs to display messages like, &#34;If you must travel do not speed.&#34;\n  &#34;When you&#39;re going in excess of 100 miles an hour, these crashes are inevitably going to be fatal or near fatal,&#34; Advocates for Highway and Auto Safety President Cathy Chase told ABC News.\n In Massachusetts, the fatality rate for car crashes is rising. In Minnesota, motor vehicle crashes and fatalities have more than doubled compared to the same time period in previous years.\n Experts are still unsure what is motivating people to engage in more reckless driving behaviors.\n  &#34;Some people might be feeling cooped up and think of it as a stress relief,&#34; Chase said. &#34;Some people may have wanted to do this their whole lives and now they see the roads have opened up a bit and they&#39;re taking advantage of the situation.&#34;\n Pam Shadel Fischer, GSHA’s senior director of external engagement, said it could be because it is harder for drivers to gauge their own speed without other drivers on the road.\n &#34;Certainly traffic volumes dictate speed,&#34; Fischer said, &#34;and there is something to be said for what we&#39;d call that herd mentality.&#34;\n  While officers try to crack down on speeding, they are also  taking extra safety precautions to prevent the spread of COVID-19. Dorelus said that in Connecticut they are now wearing masks for the duration of the traffic stops, utilizing plastic bags to take the documents of drivers and taking pictures of documents when possible.\n  As the nation reopens, the National Transportation Safety Board Chairman Robert Sumwalt renewed his call for road safety on Monday.\n &#34;As we move toward a new normal, we need to get there safely,&#34; Sumwalt said. &#34;Don’t speed. Don’t drive distracted.&#34;\n  According to the GHSA its too soon to tell whether or not some states that have lifted shelter in place orders have seen speeding or reckless driving return to pre-pandemic levels.\n &#34;It will be interesting to see what happens when more people start going on the roads,&#34; Chase said. &#34;When shelter-in-place orders are lifted, whether this dangerous and deadly behavior is reduced.&#34;", "posttime": "2020-05-24 11:41:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "高速公路,highway,安全", "title": "随着高速公路交通量的下降，鲁莽的司机是否还在增加高速公路的死亡人数？", "title_en": "With Highway Traffic Down, Are Reckless Drivers Still Increasing Highway Fatalities?", "transed": 1, "url": "https://abcnews.go.com/US/police-uptick-speeding-fatal-crashes-amid-pandemic/story?id=70751844", "via": "", "real_tags": ["高速公路", "highway", "安全"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1968年的大流行是由甲型H3N2流感病毒引起的，该病毒由甲型禽流感病毒的两个基因组成，包括一种新的H3血凝素，但也含有1957年H2N2病毒的N2神经氨酸酶。它于1968年9月在美国首次被发现。据估计，全球死亡人数为100万人，美国约为10万人。大多数超额死亡发生在65岁及以上的人群中。H3N2病毒作为季节性甲型流感病毒继续在全球传播。季节性H3N2病毒与老年人的严重疾病有关，会经历定期的抗原漂移。", "note_en": "The 1968 pandemic was caused by an influenza A (H3N2) virus comprised of two genes from an avian influenza A virus, including a new H3 hemagglutinin, but also contained the N2 neuraminidase from the 1957 H2N2 virus. It was first noted in the United States in September 1968. The estimated number of deaths was 1 million worldwide and about 100,000 in the United States. Most excess deaths were in people 65 years and older. The H3N2 virus continues to circulate worldwide as a seasonal influenza A virus. Seasonal H3N2 viruses, which are associated with severe illness in older people, undergo regular  antigenic drift.", "posttime": "2020-05-24 11:40:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,h3n2", "title": "1968年大流行(H3N2病毒)", "title_en": "1968 Pandemic (H3N2 Virus)", "transed": 1, "url": "https://www.cdc.gov/flu/pandemic-resources/1968-pandemic.html", "via": "", "real_tags": ["病毒", "h3n2"]}, {"category": "", "categoryclass": "", "imagename": "f2c8803074656d2f24d5c251b9a473ef.jpg", "infoid": 1003478, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，Tiara Show去商场寻找夏装-这是为了分散人们对自3月份以来一直让她呆在家里的流行病的注意力。\n但到处都有冠状病毒的提醒：美国鹰的一名迎宾告诉她，口罩是强制性的，并给了她一个一次性的。在里面，货架已经被削减和重新排列，牛仔裤在一个区域，衬衫在另一个区域。其他所有试衣间都关门了。在通过有机玻璃隔板支付了购买的衬衫、短裤和耳环后，Show自己从打印机那里撕下了收据。\n“一切都不一样了，”这位来自蒙大拿州米苏拉的23岁球员说。“如果说有什么不同的话，那就是它让病毒感觉更真实了。”\n在全国范围内，商店正在重新开业，接受一个改变了的现实。零售商多年来一直试图让顾客流连忘返，希望他们能买到比需要的更多的东西，现在他们正在重新想象他们的商店，以迎接一个充满刻意购买的抢占即走的未来。他们说，试妆或在过道里玩玩具的日子已经一去不复返了。现在的重点是让购物更快、更容易、更安全，以适应消费者预期和习惯的长期变化。\n苹果公司正在门口检查购物者的体温。百思买要求顾客预约购物。梅西百货(Macy‘s)和诺德斯特龙(Nordstrom)正在取消美容咨询和改装服务，而Gap正在关闭浴室和试衣间。化妆品巨头丝芙兰将不再允许购物者测试产品。其他人在将商品重新上架之前，正在对退货进行长达72小时的隔离。\n与此同时，美国鹰服饰公司(American Eagle Outfitters)正在重新想象购物体验的每一个部分。它已经投资于路边皮卡和红外线机器，这些机器可以在顾客走过时测量他们的温度。入口处的陈列品曾经堆满了服装，现在已经变成了“迎宾桌”，摆满了瓶装洗手液、一次性口罩和用来清洁鞋底的粘性蓝色垫子。衣服甚至有不同的折叠方式，以鼓励人们不插手浏览。新协议已经在435家(近一半)其美国门店推出，让我们得以一窥即使是最无害的互动也可能会如何改变。\n该公司首席商务官安德鲁·麦克莱恩(Andrew McLean)说，“从你走进我们店的那一刻起，我们就想让你看到一些新鲜的东西。”“粘乎乎的垫子、迎宾桌--它们都是顾客头脑中的触发器，让他们觉得现在的情况不同了。”\n这家零售商现在限制了商店的人数，当轮到顾客购物时，它正在使用一款移动应用程序来通知顾客。该公司还在一本65页的员工手册中详细阐述了新的协议，包括如何折叠牛仔裤和T恤，以便购物者在不接触它们的情况下对其进行详细检查。\n这些努力表明，即使美国冠状病毒死亡人数超过92,000人，零售商仍将竭尽全力安抚紧张的消费者，让他们相信再次亲自购物是安全的。在大流行期间，已经遭受重创的行业受到了沉重打击，因为长达数周的停摆导致更广泛的经济陷入衰退。四大连锁店-J.Crew、Neiman Marcus、Stage Stores和J.C.Penney-本月已根据破产法第11章申请破产保护，第五家连锁店Pier 1正濒临灭绝。分析人士说，更多的零售商正摇摇欲坠地走向破产，这增加了他们应对公共卫生的赌注。\n埃默里大学罗林斯公共卫生学院(Emory University‘s Rollins School of Public Health)全球卫生和流行病学教授罗伯特·A·贝德纳奇克(Robert A.Bednarczyk)说，“经验告诉我们，放松限制和就地避难命令意味着疾病的死灰复燃。”“口罩、体温检查、手部卫生--随着商店重新开张，这些都很重要，但增加传播的风险仍然存在。\n零售商多年来一直在他们的门店增加互动展示、样品站，甚至攀岩墙和提供全方位服务的酒吧，希望为购物者提供他们在网上无法获得的体验。但分析人士表示，这些努力中的许多现在都是不切实际或不安全的，需要进行彻底改革，最终可能会降低购物体验的乐趣，并进一步削弱本已疲软的零售环境。\n他们说，许多变化既是务实的，也是公开令人放心的：例如，如果有人在American Eagle要求试衣间，员工在允许他们进入之前，必须在购物者看得很清楚的情况下对门把手和固定装置进行消毒。\n纽约咨询公司WSL Strategic Retail的首席执行官温迪·利布曼(Wendy Liebmann)表示：“零售商开始考虑的不仅仅是商店的清洁程度。”“他们在考虑商品销售，考虑事情的发展方向。他们怎样才能让人们购物变得更容易呢？这场大流行不会稳定下来。这将是一个漫长的过山车。\n在华盛顿特区的一家独立玩具店Child‘s Play，店主史蒂文·亚伦斯(Steven Aarons)正准备减少冲动购物--减少儿童数量。他正在拆除游戏桌，取而代之的是价格更高的精灵宝可梦卡片和插孔-比如1000个拼图和滑板车-父母可以很快拿到。\nAarons在34年前开了这家店，他说：“感觉就像是我们开始了一项全新的业务。”“说我们要拿走游戏桌，不让孩子们再在商店里跑来跑去是很痛苦的，但这也是正确的做法。”\n他说，可能还需要几年时间，顾客才会觉得花几个小时和他们的孩子一起浏览过道是一件很舒服的事情。与此同时，他建立了公司的网站，并增加了自大流行开始关闭以来一直需求旺盛的送货服务。员工每天从该公司的雪佛兰大通(Chevy Chase)门店减少约60份订单，尽管整体销售额下降了约50%。\n在美国经营着375家门店的丹麦珠宝商潘多拉(Pandora)已经将珠宝清洁机从后台搬到了卖场，这样员工们就可以在顾客面前对试穿后的每一件珠宝进行消毒。\n试戴首饰有它自己的预防措施。这家零售商已经创建了一套精心设计的系统，以确保客户和员工不会发生身体接触。顾客被指示站在离商店柜台三英尺的地方。如果有人想试戴珠宝，员工会将物品从箱子里拿出来，放在柜台上的托盘上。\n该公司北美业务总裁希德·凯斯瓦尼(Sid Keswani)表示：“当员工后退时，客户会向前走一步，所以总会有6英尺高的空间。”\n该公司还将客户数量限制在一次五人以内，并正在为繁忙的假日季节制定新的安全措施，假日季节约占其销售额的40%。\n“我们觉得这是一次相当安全的旅行，”凯斯瓦尼说。“但我说相当安全，因为如你所知，目前还不能保证。”\n数据显示，自本月商场重新开业以来，客流量稳步增长。对5月1日开业的八家购物中心(包括俄克拉何马州、田纳西州和佐治亚州)的分析显示，购物中心从涓涓细流-约为一年前购物者数量的五分之一-迅速增长，在某些情况下超过了一年前的日均价格。\n根据Placer.ai的数据，截至5月6日，德克萨斯州的米德兰公园购物中心(Midland Park Mall)报告称，与前一天相比增长了79%。Placer.ai使用3000万台设备的位置数据分析了人流量模式。与此同时，南卡罗来纳州的梅西百货的客流量比去年同期跃升了9%。\n美国之鹰(American Eagle)也有类似的情况，购物者一开始小心翼翼地返回，然后热情高涨。销售额也在上升：根据该公司董事长兼首席执行官杰伊·肖滕斯坦(Jay Schotstein)的说法，许多重新开业的商店销售的商品与一年前一样多。\n“进来的顾客都是来买的，”他说。“他们不是来看的。”\n今年3月，该公司关闭了其在美国的所有980家美国鹰(American Eagle)和Aerie门店，并让4万名员工中的大多数人休假。重新开业从5月1日开始，在医生的帮助下制定了一系列新的指导方针：员工必须在每次轮班开始前洗手20秒，然后在测量自己的体温之前对商店温度计进行消毒。\n除了新的协议之外，还有更多的开放式考虑。鼓励员工从面具后面微笑，并注意非语言的暗示。“戴上口罩，一开始你可能会觉得有点尴尬，但别让这妨碍了你！”员工手册上说。“我们不希望这感觉像是一场无菌或临床互动。即使你们可能相距6英尺，但你的工作仍然是建立联系！“。\n有关于自己动手制作面罩的教程，以及制作包括每位员工微笑照片的徽章的指南。高管们表示，目标是在大流行购物的时代让顾客放心。\n肖特滕斯坦说：“这是一个为期两个月的过程，目的是弄清楚怎样才能让人们感到安全。”“这是一个新的现实：客户想要回来，但他们想要回到他们觉得安全的地方。”", "note_en": "Tiara Show went to the mall last week in search of summer clothes — and a distraction from the pandemic that has kept her homebound since March.\n  But there were  coronavirus reminders everywhere: A greeter at American Eagle told her masks were mandatory and offered her a disposable one. Inside, shelves had been pared down and rearranged, with jeans in one area, shirts in another. Every other fitting room was closed. After paying for her purchase — shirts, shorts and earrings — through a plexiglass divider, Show tore the receipt from the printer herself.\n  “Everything was so different,” said the 23-year-old from Missoula, Mont. “If anything, it made the virus feel more real.”\n  Across the country, stores are reopening to a changed reality. Retailers that have spent years trying to get customers to linger, in hopes they’ll buy more than they need, are reimagining their stores for a grab-and-go future filled with deliberate purchases. Gone, they say, are the days of trying on makeup or playing with toys in the aisles. The focus now is on making shopping faster, easier and safer to accommodate long-term shifts in consumer expectations and habits.\n    Apple is checking shoppers’ temperatures at the door. Best Buy is asking customers to shop by appointment. Macy’s and Nordstrom are doing away with beauty consultations and alteration services, while the Gap is closing off bathrooms and fitting rooms. Cosmetics giant Sephora won’t allow shoppers to test products anymore. Others are quarantining returns for as long as 72 hours before putting merchandise back on shelves.\n    American Eagle Outfitters, meanwhile, is reimagining every part of the shopping experience. It has invested in curbside pickup and infrared machines that measure customers’ temperatures as they walk by. Entryway displays once piled high with apparel have become “welcome tables” with bottles of hand sanitizer, disposable masks and sticky blue mats that clean shoe soles. Clothes are even folded differently, to encourage hands-off browsing. The new protocols, which already have been rolled out at 435, or nearly half, of its U.S. stores, offer a glimpse of how even the most innocuous interactions might be tempered.\n        “From the moment you walk into our store, we want you to see something that’s new,” said Andrew McLean, the company’s chief commercial officer. “The sticky mat, the welcome table — they’re all triggers in the customer’s mind that things are different now.”\n  The retailer, which now limits the number of people in stores, is using a mobile app to notify customers when it’s their turn to shop. And it has spelled out its new protocols in a 65-page employee handbook, including how to fold jeans and T-shirts to allow shoppers to examine them in detail without touching them.\n  The efforts illustrate the lengths to which retailers are going to reassure skittish consumers that it’s safe to shop in person again, even as U.S. coronavirus deaths surpass 92,000. The already bruised industry has been hit hard during the pandemic, as weeks-long shutdowns ushered the broader economy into recession. Four major chains — J. Crew, Neiman Marcus, Stage Stores and J.C. Penney — have filed for Chapter 11 bankruptcy protection this month, and a fifth, Pier 1, is headed toward extinction. And analysts say many more retailers are teetering toward bankruptcy, raising the stakes on their public health response.\n    “Experience has shown us that loosening restrictions and shelter-in-place orders means a resurgence of disease,” said Robert A. Bednarczyk, a professor of global health and epidemiology at Emory University’s Rollins School of Public Health. “Masks, temperature checks, hand hygiene — they’re all important as stores reopen, but there are still risks for increased transmission.&#34;\n    Retailers have spent years adding interactive displays, sample stations, even rock-climbing walls and full-service bars to their stores in hopes of offering shoppers an experience they can’t get online. But analysts say many of those efforts are now impractical or unsafe, requiring an overhaul that could ultimately make the shopping experience less enjoyable and further cut into an already weak retail environment.\n    Many of the changes, they say, are as much about being overtly reassuring as they are pragmatic: If someone asks for a fitting room at American Eagle, for example, employees must disinfect door handles and fixtures in clear view of the shopper before allowing them in.\n  “Retailers are starting to consider more than just the cleanliness of their stores,” said Wendy Liebmann, chief executive of WSL Strategic Retail, a New York-based consulting firm. “They’re thinking about merchandising, about where things go. How can they make it easier for people to shop? This pandemic isn’t going to level off. It’s going to be a long roller coaster.&#34;\n      At Child’s Play, an independent toy store in Washington, D.C., owner Steven Aarons is preparing for fewer impulse buys — and fewer children. He is removing play tables and replacing Pokémon cards and jacks with bigger-ticket items — such as 1,000-piece puzzles and scooters — that parents can quickly pick up.\n    “It feels like we’re starting a whole new business,” said Aarons, who opened the store 34 years ago. “It’s painful to say we’re going to take away the play tables and not let kids run around the store anymore, but it’s also the right thing to do.”\n  It could be years, he says, before customers feel comfortable spending hours browsing aisles with their children. In the meantime, he has built up the company’s website and added a delivery service that has been in high demand since the pandemic shutdowns began. Employees drop off about 60 orders a day from the company’s Chevy Chase store, though overall sales are down about 50 percent.\n  Pandora, a Danish jeweler that operates 375 stores in the United States, has moved its jewelry-cleaning machines from backrooms to the selling floor so that employees can sanitize each piece after it’s been tried on, in full view of customers.\n  Trying on jewelry comes with its own precautions. The retailer has created an elaborate system to ensure customers and employees don’t come into physical contact. Customers are instructed to stand three feet from store counters. If someone wants to try on jewelry, the employee takes the item out of the case and places it on a tray on the counter.\n    “The customer steps forward as the employee steps backward, so there’s always that six-foot space,” said Sid Keswani, president of the company’s North American operations.\n  The company also is limiting customers to five at a time and is developing new safety measures for the busy holiday season, which accounts for about 40 percent of its sales.\n  “We feel it’s a pretty safe journey,” Keswani said. “But I say  pretty safe because, as you know, there are no guarantees right now.”\n    Data show a steady increase in foot traffic since malls began reopening this month. An analysis of eight shopping centers that opened May 1, including in Oklahoma, Tennessee and Georgia, shows that it went from a trickle — about one-fifth the number of shoppers a year earlier — to a quick acceleration that in some cases exceeded average daily rates a year earlier.\n  By May 6, Midland Park Mall in Texas reported a 79 percent jump from the day before, according to  Placer.ai, which analyzes foot traffic patterns using location data from 30 million devices. Macy’s stores in South Carolina, meanwhile, saw traffic jump 9 percent from a year earlier.\n  It’s been a similar story at American Eagle, where shoppers returned cautiously at first, then with more gusto. Sales also are on the rise: Many reopened stores are selling as much merchandise as they were a year ago, according to Jay Schottenstein, the company’s chairman and chief executive.\n      “The customers who come in are coming in to buy,” he said. “They are not coming in to look.”\n  The company closed all 980 of its U.S. American Eagle and Aerie stores in March and furloughed the majority of its 40,000 workers. Reopenings began May 1, with a host of new guidelines created with help from doctors: Employees must wash their hands for 20 seconds at the beginning of each shift, then disinfect a store thermometer before taking their own temperature.\n    Alongside new protocols are more open-ended considerations. Employees are encouraged to smile from behind their masks and pay attention to nonverbal cues. “With masks on, you may feel a bit awkward at first, but don’t let that hold you up!” the employee manual says. “We don’t want this to feel like a sterile or clinical interaction. Even though you may be 6 feet apart — it’s your job to still create a connection!”\n  There are tutorials for do-it-yourself face masks, and a guide to creating badges that include a smiling picture of each employee. The goal, executives say, is to reassure customers in an era of pandemic shopping.\n  “This has been a two-month process of figuring out what it’s going to take to make people feel secure,” Schottenstein said. “It’s a new reality: Customers want to come back in, but they want to come back where they feel safe.”", "posttime": "2020-05-24 11:10:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "改变,changing,顾客", "title": "大流行是如何改变购物的？", "title_en": "How the pandemic is changing shopping", "transed": 1, "url": "https://www.washingtonpost.com/business/2020/05/21/pandemic-is-changing-every-aspect-shopping-store-layouts-how-jeans-are-folded/", "via": "", "real_tags": ["改变", "changing", "顾客"]}, {"category": "", "categoryclass": "", "imagename": "68d36bb85d6e5b385c0ca15303668138.jpg", "infoid": 1003477, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PubMed是由美国国家生物技术信息中心(NCBI)维护的庞大的生物医学文献数据库，是美国政府最受欢迎的网站之一，每天约有200万用户。因此，当PubMed发生变化时，它不会被忽视。\n然而，对于该网站的管理员来说，不幸的是，本周公布的一项全面重新设计让许多PubMed用户怒不可遏，并在社交媒体上表达了他们有时充满诅咒的抱怨。\n“难道只有我一个人讨厌新的PubMed吗？”5月19日，NCBI推出翻拍电影的第二天，埃默里大学医学院遗传学家大卫·温申克的实验室@LCNeuroScience在推特上写道。\n“没有。一见钟情。瑞士洛桑联邦理工学院的生物学家大卫·苏特(David Suter)答道，这也是第二和第三，这只是数百条类似推文中的一条，这些推文很快就得到了回应-其中一些无法在家庭友好的网站上发表。到5月22日，温申克实验室的原始推文已经获得了1600多个赞。\n许多投诉者谴责PubMed的新样式和布局，它显示搜索结果的方式，以及它理应增强的搜索算法。“这是你没要的新的PubMed。它会让你的眼睛流血，扼杀你的灵魂。密歇根大学医学院(University Of Michigan Medical School)分子生物学家保罗·詹金斯(Paul Jenkins)在推特上写道：#带回老朋友。\n我名字的最佳匹配-前五个包括两个我不是资深作者的地方。在什么世界里这是最好的搭配呢？\n--毒品猴(@Pharmgmonkeyblog)2020年5月19日。\n与此同时，分子生物学家理查德·埃布赖特敦促PubMed用户要求返回到旧版本：\nNCBI已经摧毁了PubMed。单击新PubMed主页右下角的反馈链接，通知NCBI您拒绝新界面，并要求永久提供旧界面。https://t.co/mhaVnCdwlj。\n-理查德·H·埃布赖特(@R_H_Ebright)2020年5月20日。\n其他人则提出了更微妙的看法，他们指出，几乎每一次流行网站的重新设计都会在人们学会接受之前最初受到批评。\n我也讨厌新发布的东西，但现在更接近技术/网站的一面，出于许多原因需要更新&从长远来看，更新往往会让网站变得更好。只是很难重新学习一些已经成为第二天性的东西。\n-希瑟·D·马歇尔(@CloudyMediaBlog)2020年5月22日。\n当被要求对这样的反馈发表评论时，包括NCBI在内的国家医学图书馆的一位发言人将Science Insider引导到NLM关于重新设计的博客文章。他们指出，翻拍的目的是为PubMed用户提供现代化的界面，更容易的导航，以及基于机器学习算法的更好的搜索结果。在1月份的一篇帖子中，NCBI的客户服务总监巴特·特拉维克(Bart Trawick)指出：“无论你认为新版本的PubMed就是这样，还是你对如何改进有很好的洞察力-我们都会等待你的消息。”\n这种等待显然已经结束了。5月21日，NLM主任帕特里夏·布伦南(Patricia Brennan)在Twitter上鼓励PubMed用户在其反馈表上记录他们的想法。她写道，该机构理解用户可能在过渡过程中遇到了“一些问题”。传统版本仍然可以在这里获得，尽管NCBI注意到访问它将只是短期的。\n*更新，5月23日，上午11：30：本文已更新，并提供了指向PubMed&#39；传统网站的链接。", "note_en": "PubMed, the massive database of biomedical literature maintained by the U.S. National Center for Biotechnology Information (NCBI), is one of the U.S. government’s most popular websites, with some 2 million users daily. So when something at PubMed changes, it doesn’t go unnoticed.\n Unfortunately for the site’s caretakers, however, a sweeping redesign unveiled this week has left many PubMed users fuming—and airing their sometimes curse-laden complaints on social media.\n “Am I the only one who hates the new PubMed?” tweeted @LCneuroscience, the laboratory of David Weinshenker, a geneticist at the Emory University School of Medicine, on 19 May, the day after NCBI rolled out its remake.\n  “No. Hate at first sight. Also second and third,” replied biologist David Suter of the Swiss Federal Institute of Technology Lausanne, in just one of hundreds of similar tweets that quickly came in response—some unprintable on family-friendly websites. And by 22 May, the original tweet from the Weinshenker lab had racked up more than 1600 likes.\n Many of the complainers decry PubMed’s new styling and layout, the way it displays search results, and its supposedly enhanced search algorithms. “HERE’S THE NEW PUBMED YOU DIDN’T ASK FOR. IT’S GOING TO MAKE YOUR EYES BLEED AND KILL YOUR SOUL. #bringbackoldpubmed,”  tweeted Paul Jenkins, a molecular biologist at the University of Michigan Medical School.\n  &#34;best match&#34; for my name - first five includes two where I&#39;m not senior author. In what world is that a best match?\n— Drug Monkey (@drugmonkeyblog)  May 19, 2020\n Molecular biologist Richard Ebright, meanwhile, urged PubMed users to demand a return to an older version:\n NCBI has destroyed PubMed.  Click feedback link at lower right corner of &#34;new&#34; PubMed homepage to inform NCBI that you reject the new interface and to demand permanent optional availability of the &#34;legacy&#34; interface.  https://t.co/mhaVnCdwlj\n— Richard H. Ebright (@R_H_Ebright)  May 20, 2020\n Others offered a more nuanced take, noting that nearly every redesign of a popular website is initially criticized before people learn to live with it.\n I also hate new pubmed, but being closer to the tech/website side of things now, updates are needed for many reasons &amp; often make the site better in the long run. It’s just hard to relearn something that had become second nature.\n— Heather D. Marshall (@CloudyMediaBlog)  May 22, 2020\n When asked to comment on such feedback, a spokesperson for the National Library of Medicine, which encompasses NCBI, directed  ScienceInsider to NLM blog posts about the redesign. They note the remake aimed to provide PubMed users with a modern interface, easier navigation, and better search results based on machine learning algorithms. And in a January post, Bart Trawick, NCBI’s director of customer services, noted that: “Whether you think the new version of PubMed is the bee’s knees just the way it is, or you have a great insight on how to make it better—we will be waiting to hear from you.”\n That wait is apparently over. And on 21 May, NLM Director Patricia Brennan took to Twitter to encourage PubMed users to record their thoughts on its  feedback form. The agency understands users may be experiencing “ some issues” with the transition, she wrote. The legacy version is  still available here, though NCBI notes that access to it will only be &#34;short-term.&#34;\n *Update, 23 May, 11:30 a.m.: This story has been updated with a link to PubMed&#39;s legacy site.", "posttime": "2020-05-24 10:54:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,欢迎,pubmed", "title": "他们重新设计了PubMed，一个深受欢迎的网站。这件事进行得不太顺利。", "title_en": "They redesigned PubMed, a beloved website. It hasn’t gone over well", "transed": 1, "url": "https://www.sciencemag.org/news/2020/05/they-redesigned-pubmed-beloved-website-it-hasn-t-gone-over-well", "via": "", "real_tags": ["设计", "欢迎", "pubmed"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择购买试用订阅港币10元，试用期4周，试用结束后每月收费港币495.00元。\n4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n礼品-每月与家人、朋友和同事分享多达10篇文章", "note_en": "Select  Purchase a Trial subscription for HK$10.00 for 4 weeks   You will be billed HK$495.00 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2020-05-24 10:39:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加大,ramps,试用", "title": "索尼加大VR力度，对虚拟活动的需求激增", "title_en": "Sony ramps up VR efforts as demand for virtual events surges", "transed": 1, "url": "https://www.ft.com/content/08f620d1-a433-41e6-af7c-a12335880076", "via": "", "real_tags": ["加大", "ramps", "试用"]}, {"category": "", "categoryclass": "", "imagename": "340c281054cc9c33f843f8711358e348.jpeg", "infoid": 1003475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“爱国者法案”即将被重新授权，但我们仍然不知道我们的网络浏览习惯是如何被收集的基本事实。", "note_en": "The Patriot Act is about to be reauthorized, but we still don't know basic facts about how our web browsing habits are being collected.", "posttime": "2020-05-24 10:39:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fbi,idea,网络", "title": "国会不知道FBI收集了多少网络浏览数据", "title_en": "Congress Has No Idea How Much Web Browsing Data the FBI Collects", "transed": 1, "url": "https://www.vice.com/en_us/article/ep4d97/congress-has-no-idea-how-much-web-browsing-data-the-fbi-collects", "via": "", "real_tags": ["fbi", "idea", "网络"]}, {"category": "", "categoryclass": "", "imagename": "7846a43e74e98aae9cd0c2de189604fc.png", "infoid": 1003472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在做了10年的活跃(超级)用户后，我刚刚删除了我在四方和群组上的账户，超过40000个活跃签到，1,000+张照片，100个给其他用户的小费，以及推特和其他服务使用的无数新增位置数据。\n我不想再登记和贡献我的数据了。我不想主动向他们的系统提供我的数据，如果可能的话，甚至是被动的。\n既然Foursquare不在乎他们的超级用户花了多少时间来保持Foursquare数据的更新，而机器人们却在用无稽之谈的数据浪费我们的时间，而且他们也几乎抛弃了他们的普通用户，所以我决定离开这个平台，加入OpenStreetMap，为一个真正的众包和开放平台做出贡献。\n多亏了Foursquare，我对随机POI非常了解，我将利用这些知识来编辑OSM。现在我正在阅读大量的常见问题解答和维基，因为OSM并非易事，但我非常肯定我会在以后的很多年里做出贡献。\n(最初的日记条目是我的推文的副本，从这一次开始：https://twitter.com/pzumk/status/1263504225222492160But我编辑了条目，使其更具可读性，因为我没有意识到这是公开的，哈哈)。\n地点：德国下萨克森州汉诺威地区汉诺威中心", "note_en": "I have just now deleted my accounts on Foursquare and Swarm after being an active (super) user for 10 years with more than 40000 active check-ins, 1000+ photos, 100s tipps for other users and a innumerable amount of added location data which has been used by Twitter and other services.\n I don’t want to check-in and contribute my data anymore. I don’t want to actively feed their system with my data, if possible not even passively.\n Since Foursquare doesn’t care about the time their super users have been spending to keep the Foursquare-data fresh whilst bots are wasting our time with nonsense data, and since they are also pretty much abandoning their normal users too, I have decided to leave the platform and join OpenStreetMap to contribute to a real crowdsourced and open platform.\n Thanks to Foursquare I know pretty much about random POI and I’m going to use that knowledge to edit the OSM. Right now I’m reading a lot of the FAQs and Wikis because OSM isn’t easy, but I’m pretty sure I’ll contribute for many years.\n  (The original diary entry was a copy of my tweets, starting with this once:  https://twitter.com/pzumk/status/1263504225222492160But I have edited the entry to make it more readable as I didn’t realise this is public, haha)\n Location:  Centre, Hanover, Region Hannover, Lower Saxony, Germany", "posttime": "2020-05-24 10:08:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "foursquare,数据", "title": "再见，Foursquare，你好，OpenStreetMap", "title_en": "Goodbye Foursquare, Hello OpenStreetMap", "transed": 1, "url": "https://www.openstreetmap.org/user/pzumk/diary/393135", "via": "", "real_tags": ["数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tails使用Tor网络来保护您的在线隐私，并帮助您避免审查。尽情享受互联网的乐趣吧。\n关闭计算机并在Tails USB棒上启动，而不是在Windows、MacOS或Linux上启动。尾巴在关闭时不会在计算机上留下任何痕迹。\nTails包括一系列应用程序，分别用于处理敏感文档和进行通信。Tails中的一切都是现成的，并且都有安全的默认设置。\n您可以免费下载Tails，独立的安全研究人员可以验证我们的工作。Tails基于Debian GNU/Linux。\n记者和他们的消息来源使用Tail发布敏感信息，并从不安全的地方访问互联网。\n我们的工作资金来自像你们这样的人和支持互联网自由的组织的捐款。见见我们的合作伙伴。", "note_en": "Tails uses the Tor network to protect your privacy online and help you avoidcensorship. Enjoy the Internet like it should be.\n Shut down the computer and start on your Tails USBstick instead of starting on Windows, macOS, or Linux. Tails leaves no trace on the computer when shut down.\n Tails includes a selection of applications to work on sensitive documents and communicatesecurely. Everything in Tails is ready-to-use and has safe defaults.\n You can download Tails for free and independent security researchers can verify ourwork. Tails is based on Debian GNU/Linux.\n   Journalists and their sources use Tails to publish sensitive informationand access the Internet from unsafe places.\n  Our work is funded by donations from people like you andorganizations that support Internet freedom.  Meet ourpartners.", "posttime": "2020-05-24 09:53:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,审查,operating,tails", "title": "Tails是一种保护您的隐私并避免审查的操作系统", "title_en": "Tails is a operating system that protects your privacy and avoids censorship", "transed": 1, "url": "https://tails.boum.org/?new", "via": "", "real_tags": ["操作系统", "审查", "operating", "tails"]}, {"category": "", "categoryclass": "", "imagename": "f37257ead15263e4bae3f43dc6cf1941.jpg", "infoid": 1003470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纯洁与危险：为什么有些人对封锁感到奇怪的安慰，害怕群体免疫力，并迅速惩罚任何质疑他们之间严峻选择的人", "note_en": "Purity and danger: Why some are strangely comforted by lockdowns, fearful of herd immunity, and quick to punish anyone who questions the stark choice between them", "posttime": "2020-05-24 09:37:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免疫,immunity,群体", "title": "“羊群免疫禁忌”杂志", "title_en": "The Herd Immunity Taboo – Tablet Magazine", "transed": 1, "url": "https://www.tabletmag.com/sections/science/articles/plague-journal-herd-immunity-doidge", "via": "", "real_tags": ["免疫", "immunity", "群体"]}]