[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1033921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10月26日星期一，也就是我们在App Store上发布ISH的四天后，我们接到苹果公司的电话，通知我们他们发现我们的应用程序不符合App Store审查指南第2.5.2节的规定，如果我们不在两周内提交令人满意的更新，他们就会将该应用程序下架。尽管我们尽了最大努力，但我们不相信明天，也就是这14天期限结束之前，我们将无法使ISH合规，我们预计，在那之后，ISH将不再可以从App Store下载。我们正在尽最大努力让ISH尽快回到App Store上，并希望在我们引导这一过程的下一步过程中得到您的理解和支持。\n苹果认为ISH不符合App Store审查指南中2.5.2节的规定，该节管理下载和运行可执行代码的应用程序。具体地说，他们认为ISH“不是自包含的，并且具有远程包更新功能”，并建议我们应该“删除远程网络活动功能，该功能可能允许远程代码导入到应用程序中，如wget或curl，或其他远程网络命令”。与苹果公司的进一步沟通表明，如果我们允许用户导入任何类型的代码，他们认为ISH是一个安全问题。\n我们相信ISH完全符合App Store审查指南。Saagar写了一篇更详细的分析，说明了为什么我们认为这一拒绝是不正确的，我们如何认为苹果误解了这一规则，并将这一规则错误地应用于我们的应用程序，并描述了2.5.2的糟糕措辞以及审查团队无法审查脚本应用程序的功能是如何导致这样的错误分类的。在更高的层面上，苹果选择性地使用第2.5.2节来瞄准ISH，而没有充分理解我们的应用程序、他们自己的指导方针，也没有充分理解他们提出的要求的后果以及他们如何影响整个App Store生态系统。要一致地执行苹果的错误解释，就需要移除所有脚本应用程序，包括App Store中许多最受欢迎的应用程序和苹果自己的一些应用程序。\n在过去的两周里，我们一直在努力让ISH不受干扰地保持可用状态。我们起草了许多上诉、要求澄清、修改规则和说明性电子邮件。我们已经和苹果公司通了几个小时的电话了。不幸的是，即使这样，我们也无法解决问题，而且这一过程的压力比我们希望的要大得多。西奥多(Theodore)是苹果的主要伊什联络人，他写了一篇关于如何改进这一过程的文章。\n我们与App Store审查团队的第一次互动实际上可以追溯到5月份，而不是10月份：我们想知道苹果对ISH的看法，因为我们不确定这些规则将如何执行。当然，ish遵守指南的规定，但审查发现它违反了2.5.2，因为它可以下载Linux可执行代码。问题似乎是APK可以让你安装软件包，所以我们决定移除它，并致力于其他功能，以使该应用程序在没有它的情况下更有用。我们在10月份提交了这个更新版本，这就是目前App Store上的版本。\n在我们的构建被标记为不符合之后，我们经历了通常的审查过程：我们首先要求澄清，然后在我们意识到规则被误用之后，我们提交了规则更改请求，当然也对决定提出了上诉。随着最后期限的临近，我们也给菲尔·席勒发了一封电子邮件，详细描述了我们的情况。不幸的是，所有这些都没有带来任何结果，这导致了我们今天的情况。\n没关系，您请。然而，这将意味着你将不再能够从App Store获得ISH，这是我们仍然希望能够提供的。App Store仍然是iOS上最简单和最受欢迎的软件分发方式，我们正在努力挽救ish的名单，因为我们认为这款应用应该在那里为喜欢这种分发方式的用户提供一个永久的位置。\n删除应用商店上的ISH列表不会影响您对ISH的使用，前提是您在应用被删除之前下载了该应用。我们还没有收到苹果关于我们的TestFlight Beta版的任何合规信息，所以我们计划继续在那里为多达10,000名Beta版测试者提供预发布版本的ISH。\n预编译的ISH版本(作为IPA文件分发)将保留在GitHub上，供AltStore安装和越狱用户使用。欢迎高级用户自行构建ISH-它是免费和开源的，而且永远都是！", "note_en": "On Monday, October 26th, just four days after we launched iSH on the App Store, we received a call from Apple informing us that they had found our app noncompliant with section 2.5.2 of the App Store Review Guidelines and that they would remove the app from sale if we did not submit a satisfactory update within two weeks. Despite our best efforts, we do not believe we will be able to bring iSH into compliance by tomorrow, the conclusion of this 14 day period, and we expect iSH to no longer be available to download from the App Store after that time. We are working our hardest to get iSH back on the App Store as soon as possible and hope for your understanding and support as we navigate our next steps in this process.\n   Apple believes iSH is not compliant with section 2.5.2 of the App Store Review Guidelines, which governs applications which download and run executable code. Specifically, they believe that iSH “is not self-contained and has remote package updating functionality”, and suggest that we should “remove the remote network activity functionality which could allow for remote code importing into the app, such as wget or curl, or other remote network commands”. Additional communication with Apple has indicated that they believe that iSH is a security concern if we allow any sort of code importing by the user.\n We believe iSH is fully compliant with the App Store Review Guidelines.  Saagar has written a more detailed analysis of why we believe this rejection is incorrect, how we believe Apple has misinterpreted and misapplied this rule to our app, and describe how 2.5.2’s poor wording coupled with the review team being unable to review functionality of scripting applications leads to mistaken classifications like these. At a high level, Apple has selectively targeted iSH using section 2.5.2 without fullying understanding our application, their own guidelines, or the consequences of what they are asking and how they affect the App Store ecosystem as a whole.  Consistent enforcement of Apple’s incorrect interpretation would require the removal of all scripting apps, including many of the most popular applications in the App Store and some of Apple’s own applications.\n  We’ve been working for the last two weeks to try to keep iSH available without interruptions. We have drafted numerous appeals, requests for clarifications, rule modifications, and explanatory emails. We’ve been on the phone with Apple for hours. Unfortunately, even with this we have been unable to resolve the issue, and the process has been significantly more stressful than we would have liked it to be. Theodore, the primary iSH liaison to Apple,  has written about how this process should be improved.\n Our first interaction with the App Store review team actually dates back to May, not October: we wanted to know what Apple thought of iSH, since we weren’t sure how the rules would be enforced for it. Of course, iSH complies with the letter of the guidelines, but review found it to violate 2.5.2 because it could download Linux executable code. The problem appeared that apk lets you install packages, so we decided to remove it and work on other features to make the app more useful in its absence. We submitted this updated build in October and this was what is currently on the App Store.\n After our build was flagged for noncompliance, we went through the usual review process: we first asked for clarification, and then after we realized that the rule was being misapplied we submitted a rule change request and of course appealed the decision as well. As the deadline approached we sent off an email to Phil Schiller as well detailing our situation. Unfortunately none of this led anywhere, which brings up to our current situation today.\n  No, not at all. However, it will mean that you will no longer be able to get iSH from the App Store, which is something which we would still like to be able to provide. The App Store remains the easiest and most popular method of software distribution on iOS, and we’re working hard to save iSH’s listing because we think the app should have a permanent spot there for users who prefer this method of distribution.\n Removal of iSH’s listing on the App Store should not affect your use of iSH if you download the app before it is removed. We have not received any compliance messages from Apple regarding  our TestFlight beta, so we plan to continue offering prerelease versions of iSH there for up to 10,000 beta testers.\n Precompiled builds of iSH (distributed as IPA files) will  remain available on GitHub for  installation through AltStore and for jailbroken users. Advanced users are welcome to  build iSH themselves—it’s free and open source and always will be!", "posttime": "2020-11-09 04:01:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,明天,remove,ish", "title": "苹果将于明天从App Store下架ISH", "title_en": "Apple will remove iSH from the App Store tomorrow", "transed": 1, "url": "https://ish.app/app-store-removal", "via": "", "real_tags": ["apple", "苹果", "明天", "remove", "ish"]}, {"category": "", "categoryclass": "", "imagename": "567190180c75b058c51b952559b74e21.jpg", "infoid": 1033918, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚历克斯·特雷贝克(Alex Trebek)，和蔼的《危险边缘》(Jeopardy！)。一位在电视游戏节目版图中拥有所有答案和令人放心的存在了50年的主持人去世了。他80岁高龄。", "note_en": "Alex Trebek, the genial \"Jeopardy!\" host with all the answers and a reassuring presence in the TV game-show landscape for five decades, has died. He was 80 years old.", "posttime": "2020-11-09 03:40:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,节目,american,游戏", "title": "美国著名智力竞赛节目主持人亚历克斯·特雷贝克逝世，享年80岁", "title_en": "Iconic American Quiz Show Host Alex Trebek Dies at Age 80", "transed": 1, "url": "https://www.cnn.com/2020/11/08/entertainment/alex-trebek-jeopardy-host-death-trnd/index.html", "via": "", "real_tags": ["美国", "节目", "american", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033917, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们的论文中，一位假唱专家就是你在野外对嘴语音生成所需要的全部，ACM多媒体2020，我们的目标是在野外将不受限制的视频对口型同步到任何想要的目标语音。目前的作品擅长在训练阶段看到的特定人的静态图像或视频上做出准确的嘴唇动作。然而，它们无法准确地变形动态、不受约束的面孔视频中任意身份的嘴唇动作，导致视频的大部分内容与新音频不同步。我们找出与此相关的关键原因，并通过向强大的对口型鉴别器学习来解决这些问题。对我们具有挑战性的基准的广泛量化评估表明，我们的Wav2Lip模型生成的视频的口型同步准确率几乎与真实同步视频一样好。有关该模型和我们新颖的评估框架的更多详细信息，请查看我们的论文。\n选择视频文件(最长20秒，文件名中没有空格)：选择包含音频的音频文件(或)视频(最长20秒，文件名中没有空格)：\n使用我们的开源代码，你可以尝试假唱更高分辨率/更长的视频。您将能够调整推理参数，从而在相同的输入下获得更好的结果。\n注意：如果没有得到视频结果，很可能意味着人脸检测器无法检测到所有输入视频帧中的人脸。动画电影剪辑有时会出现这种情况。生成结果可能需要一些时间(通常不超过一分钟)！所有结果目前都被限制在(最高)480p分辨率，并将被裁剪到最高分辨率。20s，将计算延迟降至最低。这个互动网站只是对Wav2Lip模型最基本功能的一个用户友好的演示。\n本演示网站或开源代码的所有结果只能用于研究/学术/个人目的。由于这些模型是在LRS2数据集上训练的，因此严格禁止任何形式的商业使用。如有任何疑问，请与我们联系。\n为了确保合理使用，我们强烈要求使用本站点或我们的代码创建的任何结果都必须明确表示为合成的，并且它是使用Wav2Lip模型生成的。此外，对于这项工作的强有力的积极应用，我们打算将我们的工作完全开源，因为它同时也可以鼓励人们努力检测被操纵的视频内容及其滥用。我们相信，Wav2Lip可以实现几个积极的应用，并鼓励有关合理使用合成内容的富有成效的讨论和研究努力。", "note_en": "In our paper,   A Lip Sync Expert Is All You Need for Speech to Lip Generation In the Wild,  ACM Multimedia 2020, we aim to lip-sync unconstrained videos in the wild to any desired target speech. Current works excel at producing accurate lip movements on a static image or videos of specific people seen during the training phase. However, they fail to accurately morph the lip movements of arbitrary identities in dynamic, unconstrained talking face videos, resulting in significant parts of the video being out-of-sync with the new audio. We identify key reasons pertaining to this and resolve them by learning from a powerful lip-sync discriminator. Extensive quantitative evaluations on our challenging benchmarks show that the lip-sync accuracy of the videos generated by our Wav2Lip model is almost as good as real synced videos. Please check out our  paper for more details about the model and also our novel evaluation framework.\n Select a video file (Max 20 sec,  no spaces in the file name):    Select an audio file (or) video with audio (Max 20 sec,  no spaces in the file name):\n  Using our open-source  code, you can attempt to lip-sync higher resolution/longer videos. You will be able to tune the inference parameters and hence obtain a much better result for the same inputs.\n Note: If you do not get back a video result, it most likely means that the face detector could not detect faces in all the input video frames. This can sometimes happen for animated movie clips. It may take some time (not more than a minute usually) to generate the results! All results are currently limited to (utmost) 480p resolution and will be cropped to max. 20s to minimize compute latency. This interactive site is only an user-friendly demonstration of the bare minimum capabilities of the Wav2Lip model.\n    All results from this demo website or the open-source  code should only be used for research/academic/personal purposes only. As the models are trained on the  LRS2 dataset, any form of commercial use is strictly prohibhited. Please contact us for further queries.\n To ensure fair use, we strongly require that any result created using this site or our code must unambiguously present itself as synthetic and that it is generated using the Wav2Lip model. In addition, to the strong positive applications of this work, our intention to completely open-source our work is that it can simultaneously also encourage efforts in detecting manipulated video content and their misuse. We believe that Wav2Lip can enable several positive applications and also encourage productive discussions and research efforts regarding fair use of synthetic content.", "posttime": "2020-11-09 03:31:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "视频,accurately", "title": "Wav2Lip：准确地将视频与任何语音同步", "title_en": "Wav2Lip: Accurately Lip-Sync Videos to Any Speech", "transed": 1, "url": "http://bhaasha.iiit.ac.in/lipsync/", "via": "", "real_tags": ["视频"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033915, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Clean Air System认证的无臭氧电离器每秒产生数以万计的离子，安全地消除空气中和表面的病原体，从而产生更新鲜、更清洁的条件。电离器的精确集成允许在整个空间内最大限度地产生和传递离子。\n我们风扇的气流不仅放大了产生的离子的数量，而且扩大了它们的有效覆盖面积。除了对空气和表面进行消毒外，我们的风扇气流还能提高乘员舒适性、暖通空调效率和节能效果，为企业主带来实实在在的好处。\n离子的寿命只有30秒左右，所以离子必须被输送到你的人民呼吸的空气和他们接触的表面。大屁股风扇不是将电离器隐藏在管网中，而是将电离器集成到我们的风扇中，将离子直接分配给您的员工。", "note_en": "Clean Air System’s certified ozone-free ionizers generate tens of thousands of ions per second, safely eliminating airborne and surface pathogens and resulting in fresher, cleaner conditions. The ionizers’ precise integration allows for maximum ion production and delivery throughout your space.\n      Our fans’ airflow amplifies not only the number of ions that are generated but also their effective coverage areas. Aside from disinfecting air and surfaces, our fans’ airflow improves occupant comfort, HVAC efficiency, and energy savings, providing real benefits for business owners.\n      An ion’s lifetime is only about 30 seconds, so it’s essential that ions be delivered to the air your people breathe and the surfaces that they touch. Rather than concealing ionizers within ductwork, Big Ass Fans integrates ionizers into our fans to distribute ions directly to your people.", "posttime": "2020-11-09 03:11:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "屁股,ass,离子", "title": "大屁股风扇的清洁空气系统", "title_en": "Big Ass Fan’s Clean Air System", "transed": 1, "url": "https://www.bigassfans.com/air-disinfection/", "via": "", "real_tags": ["屁股", "ass", "离子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033914, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依靠您的支持：您听说过Phoronix Premium吗？这是我们高级无广告服务在本网站上广告的补充。每月只需3美元，你就可以帮助支持我们的网站，同时产生的资金可以让我们继续进行Linux硬件审查、性能基准测试、维护我们的社区论坛等等。你也可以考虑通过贝宝(PayPal)支付小费。为了更好地迎合更新和常见的x86_64指令集扩展，开源工具链开发人员正在推进x86_64微体系结构功能级别的工作，以便能够针对基本x86_64指令集之外的几个不同级别。\rX86_64功能级别用于轻松隔离不同类别的x86_64 Intel/AMD CPU，希望Linux发行版可以更容易地将其基本要求提高到x86_64/AMD64之外，并通过一组通用的可能级别/硬件功能来改进编译器工具链，以生成优化的库。与此同时，Red Hat还致力于提高新RHEL/Fedora版本的x86_64CPU要求，以及Glibc HWCAPS等优化计划，以支持几个不同的优化级别，而不是像目前代码优化/调优那样，针对每个可能的Intel/AMD CPU微体系结构家族。\r在过去的一周，LLVMClang 12添加了对将x86_64特性级别提供给Clang C/C++编译器的支持。\r定义的x86_64功能级别包括：\rX86-64：CMOV、CMPXCHG8B、FPU、FXSR、MMX、FXSR、SCE、SSE、。SSE 2\rX86-64-v2：(靠近Nehalem)CMPXCHG16B、LAHF-SAHF、POPCNT、SSE3、SSE4.1、SSE4.2、SSSE3\rX86-64-v3：(接近哈斯韦尔)AVX、AVX2、BMI1、BMI2、F16C、FMA、LZCNT、MOVBE、XSAVE\rX86-64-v4：AVX512F、AVX512BW、AVX512CD、AVX512DQ、AVX512VL。\n如果想要针对这些目标之一进行优化，而不是手动指定特定的指令集扩展或cpu系列，则现在可以将不同的级别/版本输入到Clang 12和GCC 11的-march=中。\r这些基线是通过", "note_en": "We Rely On Your Support: Have you heard of  Phoronix Premium? It&#39;s what complements advertisements on this site for our premium ad-free service. For as little as $3 USD per month, you can help support our site while the funds generated allow us to keep doing Linux hardware reviews, performance benchmarking, maintain our community forums, and much more. You can also consider  a tip via PayPal.   In an effort to better cater towards newer and common x86_64 instruction set extensions, open-source toolchain developers are moving ahead with the work on  x86_64 micro-architecture feature levels for being able to target a handful of different &#34;levels&#34; beyond the base x86_64 instruction set.\r   The x86_64 feature levels are for easily segregating different classes of x86_64 Intel/AMD CPUs in hopes of making it easier for Linux distributions to increase their base requirements beyond just x86_64/AMD64 and improving compiler toolchains with a common set of possible levels / hardware capabilities in generating optimized libraries. This goes along with work pursued by Red Hat in  raising the x86_64 CPU requirements for new RHEL/Fedora releases and for optimization initiatives like the glibc HWCAPS in supporting a few different optimization levels rather than having to target every possible Intel/AMD CPU microarchitecture family as is currently done for code optimization/tuning.\r   This past week LLVM Clang 12  added support for feeding the x86_64 feature levels into the Clang C/C++ compiler.\r   The defined x86_64 feature levels include:\r  x86-64: CMOV, CMPXCHG8B, FPU, FXSR, MMX, FXSR, SCE, SSE, SSE2\r  x86-64-v2: (close to Nehalem) CMPXCHG16B, LAHF-SAHF, POPCNT, SSE3, SSE4.1, SSE4.2, SSSE3\r  x86-64-v3: (close to Haswell) AVX, AVX2, BMI1, BMI2, F16C, FMA, LZCNT, MOVBE, XSAVE\r  x86-64-v4: AVX512F, AVX512BW, AVX512CD, AVX512DQ, AVX512VL\n  The different levels/versions can be fed now into  -march= for Clang 12 and GCC 11 if wanting to optimize for one of those targets rather than specifying specific instruction set extensions manually or a CPU family.\r   These baselines are laid out via the", "posttime": "2020-11-09 03:11:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "体系结构,support,x86", "title": "LLVM Clang 12合并了对x86_64微体系结构级别的支持", "title_en": "LLVM Clang 12 Merges Support for x86_64 Microarchitecture Levels", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-Clang-12-Microarch-Levels", "via": "", "real_tags": ["体系结构", "support", "x86"]}, {"category": "", "categoryclass": "", "imagename": "aaea17dc1c0dd2c391d964f1d035bf53.jpg", "infoid": 1033913, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们最近发现了一个新的文件加密特洛伊木马程序，它是作为ELF可执行文件构建的，旨在加密由基于Linux的操作系统控制的计算机上的数据。\n经过初步分析，我们注意到特洛伊木马的代码、赎金笔记的文本和敲诈勒索的一般方法都有相似之处，这表明我们实际上遇到了先前已知的勒索软件家族RansomEXX的Linux版本。这种恶意软件因攻击大型组织而臭名昭著，今年早些时候最为活跃。\nRansomEXX是一种具有高度针对性的特洛伊木马程序。恶意软件的每个样本都包含受害者组织的硬编码名称。此外，加密的文件扩展名和联系勒索者的电子邮件地址都使用了受害者的名字。\n近几个月来，有几家公司成为了这种恶意软件的受害者，包括德克萨斯州交通部(TxDOT)和柯尼卡美能达(Konica Minolta)。\n我们遇到的示例aa1ddf0c8312349be614ff43e80a262f是一个64位ELF可执行文件。该特洛伊木马程序使用开源库mbedtls中的函数实现其加密方案。\n启动后，该特洛伊木马程序会生成256位密钥，并使用它在ECB模式下使用AES块密码加密属于受害者的所有文件。AES密钥由嵌入特洛伊木马正文的公开RSA-4096密钥加密，并附加到每个加密文件中。\n此外，恶意软件每0.18秒启动一次重新生成和重新加密AES密钥的线程。然而，根据对实现的分析，密钥实际上每秒都不同。\n除了加密文件和留下赎金纸条外，该示例没有其他威胁攻击者在其特洛伊木马程序中倾向于使用的附加功能：没有C&amp；C通信、没有终止运行的进程、没有反分析技巧等。\n文件加密过程伪代码的片段；变量和函数名保存在调试信息中，必须与原始源代码匹配。\n奇怪的是，ELF二进制文件包含一些调试信息，包括恶意软件开发人员使用的函数名称、全局变量和源代码文件。\n尽管之前发现的RansomEXX的PE版本使用WinAPI(特定于Windows操作系统的函数)，但特洛伊木马代码的组织和使用mbedtls库中特定函数的方法暗示ELF和PE可能源自相同的源代码。\n在下面的屏幕截图中，我们可以看到加密AES密钥的过程的比较。左侧是ELF示例aa1ddf0c8312349be614ff43e80a262f；右侧是TxDOT攻击中使用的PE示例fcd21c6fca3b9378961aa1865bee7ecb。\n尽管不同的编译器使用不同的优化选项并针对不同的平台构建，但相似性非常明显。\n我们还观察到加密文件内容的过程和代码的总体布局有相似之处。\n更重要的是，赎金纸条的文本也几乎是一样的，标题中有受害者的名字，以及相应的措辞。\n据媒体报道，该国的一家政府机构刚刚受到了一种定向勒索软件特洛伊木马的攻击。\n根据与我们描述的样本中的赎金纸条几乎相同的赎金纸条，以及上面提到的新闻文章，目标很有可能是另一种RansomEXX变种的受害者。", "note_en": "We recently discovered a new file-encrypting Trojan built as an ELF executable and intended to encrypt data on machines controlled by Linux-based operating systems.\n After the initial analysis we noticed similarities in the code of the Trojan, the text of the ransom notes and the general approach to extortion, which suggested that we had in fact encountered a Linux build of the previously known ransomware family RansomEXX. This malware is notorious for attacking large organizations and was most active earlier this year.\n RansomEXX is a highly targeted Trojan. Each sample of the malware contains a hardcoded name of the victim organization. Moreover, both the encrypted file extension and the email address for contacting the extortionists make use of the victim’s name.\n Several companies have fallen victim to this malware in recent months, including the  Texas Department of Transportation (TxDOT) and  Konica Minolta.\n  The sample we came across –  aa1ddf0c8312349be614ff43e80a262f – is a 64-bit ELF executable. The Trojan implements its cryptographic scheme using functions from the open-source library mbedtls.\n When launched, the Trojan generates a 256-bit key and uses it to encrypt all the files belonging to the victim that it can reach using the AES block cipher in ECB mode. The AES key is encrypted by a public RSA-4096 key embedded in the Trojan’s body and appended to each encrypted file.\n Additionally, the malware launches a thread that regenerates and re-encrypts the AES key every 0.18 seconds. However, based on an analysis of the implementation, the keys actually only differ every second.\n Apart from encrypting the files and leaving ransom notes, the sample has none of the additional functionality that other threat actors tend to use in their Trojans: no C&amp;C communication, no termination of running processes, no anti-analysis tricks, etc.\n  Fragment of the file encryption procedure pseudocode; variable and function names are saved in the debug information and must match the original source code\n Curiously, the ELF binary contains some debug information, including names of functions, global variables and source code files used by the malware developers.\n      Despite the fact that previously discovered PE builds of RansomEXX use WinAPI (functions specific to Windows OS), the organization of the Trojan’s code and the method of using specific functions from the mbedtls library hint that both ELF and PE may be derived from the same source code.\n In the screenshot below, we see a comparison of the procedures that encrypt the AES key. On the left is the ELF sample aa1ddf0c8312349be614ff43e80a262f; on the right is the PE sample fcd21c6fca3b9378961aa1865bee7ecb used in the TxDOT attack.\n Despite being built by different compilers with different optimization options and for different platforms, the similarity is quite obvious.\n  We also observe resemblances in the procedure that encrypts the file content, and in the overall layout of the code.\n What’s more, the text of the ransom note is also practically the same, with the name of the victim in the title and equivalent phrasing.\n  As  reported by the media, one of the country’s government institutions has just been attacked by a targeted ransomware Trojan.\n Based on the ransom note, which is almost identical to the one in the sample we described, and the news article mentioned above, there is a high probability that the target is the victim of another variant of RansomEXX.", "posttime": "2020-11-09 03:11:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,trojan", "title": "RansomEXX特洛伊木马攻击Linux系统", "title_en": "RansomEXX Trojan attacks Linux systems", "transed": 1, "url": "https://securelist.com/ransomexx-trojan-attacks-linux-systems/99279/", "via": "", "real_tags": ["linux", "trojan"]}, {"category": "", "categoryclass": "", "imagename": "4dd8d885508439686d23eaaba6d0d228.jpg", "infoid": 1033912, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "威严的蓝鲸在海洋中游荡了大约450万年，而尼安德特人在几十万年后就消失了。但这些生物代表了整个物种吗？物种在灭绝之前通常会持续多久？\n事实证明，我们现在找到的答案可能与往常截然不同。由于栖息地破坏、气候变化和一系列其他因素，植物和动物从地球上消失的速度比历史上除五个以外的所有其他时间点都要快。一些专家说，我们正处于第六次大灭绝事件中。但是，即使在地球历史上较为平静的时期，答案也会因你所观察的物种类型而有所不同。根据《人与地球》杂志上的一篇文章，哺乳动物的平均寿命为100万到200万年。\n然而，这一平均值并不适用于所有地质时期和所有哺乳动物。根据2013年发表在《综合动物学》杂志上的一项研究，新生代(6500万年前至今)哺乳动物的平均寿命为321万年，较大的哺乳动物比较小的哺乳动物寿命更长。对于无脊椎动物来说，持续时间更令人印象深刻；它们的平均寿命在500万到1000万年之间。\n然而，这些数字是有争议的。专家们对任何种类的物种在灭绝前的平均持续时间没有达成一致意见。化石记录记录了物种出现和消失的时间，但它留下了很大的误差范围，因为化石形成的条件必须是完美的，而当一个物种出现和消失时，这些条件并不总是存在。不管怎么说，这些长寿数据并没有多大用处。杜克大学(Duke University)尼古拉斯环境学院(Nicholas School Of The Environment)的保护生态学家、著名物种灭绝专家斯图尔特·皮姆(Stuart Pimm)说，他更喜欢用每天、每月或每年有多少物种灭绝来衡量物种的灭绝。\n从…的角度来看，它更容易想到。皮姆说，死亡率，很大程度上是因为有些物种活得很长。还有一些物种是短命的。平均水平并不像你想象的那样对你有多大的帮助。\n这个物种死亡率，也就是所谓的背景灭绝率，也是有争议的。皮姆认为，这个历史性的数字涵盖了所有时间，不包括大规模灭绝-大约每年每100万个物种中就有一个物种灭绝。这意味着如果地球上有一百万个物种，每年都会有一个物种灭绝。(相比之下，根据《公共科学图书馆·生物学》(PLOS Biology)杂志的一项研究，目前地球上约有870万个物种。)。然而，根据《科学进展》(Science Advance)杂志上的一篇研究文章，其他专家估计，物种通常以每年每百万个物种0.1个的速度灭绝，还有一些以每年每百万个物种2个的速度灭绝。\n他说，目前的物种灭绝速度远远高于这些关于过去的预测--大约是PIMM估计的背景物种灭绝速度的1000倍。然而，俄勒冈州生物多样性中心的资深科学家蒂拉·库里(Tiera Curry)表示，并不是每个人都同意现在物种灭绝的加速程度。一些专家估计，目前的物种灭绝速度只快100倍，或者在另一个极端，快1万倍。\n有几个原因导致对目前物种灭绝速度的估计不同。库里说，物种灭绝的速度是基于地球上有多少物种，以及它们灭绝的速度有多快。皮姆补充说，实际上没有人知道这两个问题的答案。大约90%的现存物种--主要是昆虫--可能没有名字。如果研究人员不知道某个物种存在，他们也不会知道它已经灭绝了。另一个复杂的问题是，很难判断物种何时死亡。研究人员有几年没见过它们，并不意味着它们就一去不复返了。当物种在野外灭绝但仍生活在动物园时，计算可能会变得更加困难。\n专家们一致认为，现代物种的灭绝率太高了。皮姆说，物种正在以最快的速度适应环境。但最终运气用完了，他们适应得不够快。然后他们就走了。", "note_en": "The majestic blue whale has plied the seas for about   4.5 million years, while the   Neanderthals winked out of existence in a few hundred thousand years. But are those creatures representative of species overall? How long do species usually last before they go extinct?\n  It turns out the answer we find now could be very different than it usually is. Because of habitat destruction,   climate change, and a range of other factors, plants and animals are disappearing from the planet faster than all but maybe five other points in history. Some experts say we&#39;re in the   sixth mass extinction event. But even in calmer periods of Earth&#39;s history, the answer has varied depending on the  type of species you&#39;re looking at. For mammals, the average species exists for 1 million to 2 million years, according to an article in the journal   People &amp; the planet.\n  However, this average doesn&#39;t hold during all geologic periods and for all mammals. The average for the   Cenozoic era (65 million years ago to present) mammals is 3.21 million years, with larger mammals lasting longer than smaller mammals, according to a 2013 study in the journal   Integrative Zoology. For invertebrate species, the duration is even more impressive; they last between 5 million to 10 million years, on average.\n    These numbers, however, are contentious. Experts don&#39;t agree on the average amount of time that species in any category last before going extinct. The fossil record documents when a species shows up and when it disappears, but it leaves a wide margin of error because conditions must be perfect for   fossils to form, and those conditions aren&#39;t always present when a species shows up and blinks out. And these longevity stats aren&#39;t that useful anyway. Stuart Pimm, a leading extinction expert and a conservation ecologist at Duke University&#39;s Nicholas School of the Environment, said he prefers to think about extinction in terms of how many species die out every day, or month, or year.\n  &#34;It&#39;s easier to think of in terms of… death rates, largely because there are some species that live a really long time,&#34; Pimm said. &#34;And then there are other species that are short-lived. And the average doesn&#39;t really help you as much as you might think.&#34;\n This species death rate, called the background extinction rate, is also contentious. Pimm placed the historic number — a figure that covers all time, excluding mass extinctions — at around one species extinction per 1 million species per year. That means that if there were a million species on the planet, one would have gone extinct each year. (For comparison, there are about 8.7 million species on the planet today, according to a study in the journal   PLOS Biology.) However, other experts estimate species typically die off at a rate of 0.1 species per million per year and still others at two species per million per year, according to a research article in the journal   Science Advances.\n The current extinction rate is much higher than any of these predictions about the past — about 1,000 times more than Pimm&#39;s background extinction rate estimate, he said. However, not everyone agrees on how accelerated species extinction is now, said Tierra Curry, a senior scientist at the Center for Biological Diversity in Oregon. Some experts estimate that the current extinction rate is only 100 times faster or, at the other extreme, 10,000 times faster.\n  There are several reasons why estimates of the current extinction rate vary. &#34;The extinction rate is based on how many species are on Earth and how rapidly they&#39;re going extinct,&#34; Curry said. &#34;And no one actually knows the answer to either one of those questions.&#34; About 90% of living species — largely insects — are probably unnamed, Pimm added. And if researchers don&#39;t know that a species existed, they won&#39;t know it went extinct. Another complication is that it can be difficult to tell when species are dead. Just because researchers haven’t seen them for several years doesn&#39;t mean they&#39;re gone for good. Calculations can get more difficult when species are extinct in the wild but live on in zoos.\n One thing the experts do agree on is that the modern extinction rate is far too high. &#34;Species are adapting as fast as they can,&#34; Pimm said. &#34;But eventually the luck runs out and they don&#39;t adapt fast enough. And they go.&#34;", "posttime": "2020-11-09 03:06:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "灭绝,species,物种", "title": "大多数物种在灭绝前能存活多久？", "title_en": "How long do most species last before going extinct?", "transed": 1, "url": "https://www.livescience.com/how-long-do-species-last.html", "via": "", "real_tags": ["灭绝", "species", "物种"]}, {"category": "", "categoryclass": "", "imagename": "3a91d4ef2bcd8400e164a6b52c940020.jpeg", "infoid": 1033910, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可能已经听过我们无数次这样说：GPT-3，这个能发出不可思议的类似人类语言的巨型人工智能，是一个奇迹。这在很大程度上也是一种海市蜃楼。你可以用一个简单的技巧来分辨：问它绵羊的颜色，它会像暗示“白”一样频繁地暗示“黑”--这反映了我们俗语中的“害群之马”。\n这就是语言模型的问题所在：因为它们只接受文本方面的训练，缺乏常识。现在，北卡罗来纳大学教堂山分校的研究人员设计了一种新技术来改变这一状况。他们称之为“声学化”，它赋予了像GPT-3这样的语言模型“看得见”的能力。\n这并不是人们第一次试图将语言模型与计算机视觉相结合。这实际上是人工智能研究的一个快速增长的领域。我们的想法是，这两种类型的人工智能都有不同的优势。像GPT-3这样的语言模型是通过无监督学习来训练的，这不需要人工标记数据，使得它们很容易扩展。相比之下，像物体识别系统这样的图像模型更直接地从现实中学习。换句话说，他们的理解并不依赖于文本所提供的对世界的抽象。他们可以从绵羊的照片中“看出”它们实际上是白色的。\n同时可以解析语言和视觉输入的人工智能模型也有非常实用的用途。例如，如果我们想要制造机器人助手，它们需要计算机视觉来导航世界，需要语言来与人类交流。\n但将这两种类型的人工智能结合起来说起来容易做起来难。它不像将现有的语言模型与现有的对象识别系统装订在一起那么简单。它需要用包含文本和图像的数据集(也称为视觉语言数据集)从头开始训练一个新模型。\n管理这样的数据集最常见的方法是汇编一个带有描述性说明的图像集合。例如，下面这张图片的标题是“一只橙色的猫坐在行李箱里，准备收拾行李。”这与典型的图像数据集不同，典型的图像数据集只用一个名词来标记同一张图片，比如“猫”。因此，视觉语言数据集不仅可以教会人工智能模型如何识别对象，还可以教会它们如何使用动词和介词相互关联和作用。\n但是你可以明白为什么这个数据管理过程会永远持续下去。这就是为什么现有的视觉语言数据集如此微不足道。像英文维基百科(实际上几乎包括所有英文维基百科条目)这样的纯文本数据集可能包含近30亿个单词。像Microsoft Common Objects in Context或MS Coco这样的可视化语言数据集只有700万个。这些数据根本不足以训练人工智能模型以获得任何有用的东西。\n“Vokenization”绕过了这个问题，它使用无监督的学习方法，将MS Coco中的极少量数据缩放到英文维基百科的大小。由此产生的视觉语言模型在当今用于评估人工智能语言理解能力的一些最难的测试中表现优于最先进的模型。\n自然语言处理初创公司Huking Face的联合创始人兼首席科学官托马斯·沃尔夫(Thomas Wolf)说：“你不能仅仅试一试就在这些测试中击败最先进的技术。”沃尔夫没有参与这项研究。他说：“这不是玩具测试。这就是为什么这非常令人兴奋。“。\n让我们先整理一下一些术语。“沃肯”到底是什么？\n在人工智能中，用于训练语言模型的单词被称为记号。因此，北卡罗来纳大学的研究人员决定将他们视觉语言模型中与每个符号相关的图像称为沃肯(Voken)。Vokenizer是他们所说的为每个令牌寻找语音的算法，而Vokenizer是他们所说的整个过程。\n这样做的意义不仅仅是为了表明人工智能研究人员有多喜欢编造单词。(确实如此。)。它还有助于打破声情化背后的基本理念。北卡罗来纳大学的研究人员没有从图像数据集开始，然后手动编写句子作为字幕-这是一个非常缓慢的过程-而是从语言数据集开始，使用无监督学习将每个单词与相关图像进行匹配(稍后将详细介绍)。这是一个高度可扩展的过程。\n在这里，无监督学习技术是本文的最终贡献。你实际上是如何找到每个单词的相关图片的？\n让我们回到GPT-3。GPT-3是被称为转换器的语言模型家族的一部分，当2017年第一个模型被引入时，这代表着将无监督学习应用于自然语言处理方面的重大突破。变形金刚通过观察单词在上下文中的使用情况，然后根据上下文创建每个单词的数学表示，称为“单词嵌入”，从而学习人类语言的模式。例如，“猫”这个词的嵌入可能表明，它经常在“喵”和“橙”的周围使用，但在“树皮”或“蓝色”的周围使用的频率较低。\n这就是转换器如何近似单词的意思，以及GPT-3如何写出类似人类的句子。它在一定程度上依赖于这些嵌入来告诉它如何将单词组合成句子，以及如何将句子组合成段落。\n还有一种类似的技术也可以用于图像。它不是扫描文本中的单词使用模式，而是扫描图像中的视觉模式。它将猫在床上出现的频率与在树上出现的频率制成表格，并创建一个嵌入上下文信息的“猫”。\n北卡罗来纳大学的研究人员的见解是，他们应该在MS Coco上同时使用这两种嵌入技术。他们将图片转换为视觉嵌入，并将字幕转换为文字嵌入。这些嵌入的真正巧妙之处在于，它们可以在三维空间中绘制出来，你可以从字面上看到它们是如何相互关联的。与单词嵌入密切相关的视觉嵌入将在图表中显示得更近。换句话说，可视化的猫嵌入(理论上)应该与基于文本的猫嵌入重叠。挺酷的。\n你可以看到事情的发展方向。一旦所有嵌入都绘制成图表并进行比较并相互关联，就很容易开始将图像(声符)与单词(标记)进行匹配。请记住，因为图像和单词是基于它们的嵌入进行匹配的，所以它们也是基于上下文进行匹配的。当一个单词可能有完全不同的含义时，这很有用。这项技术通过为单词的每个实例找到不同的发音，成功地处理了这一问题。\n在这两个例子中，令牌是单词“Contact”。但在第一句话中，上下文暗示这个词指的是联系信息，所以Voken是联系图标。在第二句话中，上下文暗示这个词指的是触摸，所以Voken表示一只猫被抚摸。\n研究人员使用他们用MS Coco创建的视觉和文字嵌入来训练他们的发音器算法。一旦接受了训练，发声者就能在英文维基百科中找到代币的发音符号。这并不完美。该算法仅为大约40%的令牌找到了声符。但这仍然是近30亿字数据集的40%。\n有了这个新的数据集，研究人员重新训练了一种名为BERT的语言模型，这是一种由谷歌开发的开源转换器，早于GPT-3。然后，他们在六种不同的语言理解测试中测试了新的、改进后的伯特，包括斯坦福大学问答数据集TEAND，它要求模特回答关于一系列文章的阅读理解问题，以及SWIG，它试图用英语的微妙之处绊倒模型，以探索它是否只是在模仿和记忆。改进后的伯特在所有这些人身上都表现得更好，沃尔夫说这是不容忽视的。\n研究人员，博士生谭浩和他的导师莫希特·班萨尔将在两周后的自然语言处理经验方法会议上展示他们的新语音技术。虽然这项工作还处于早期阶段，但沃尔夫认为，他们的工作在让无监督学习为视觉语言模型工作方面，是一个重要的概念突破。这是一个类似的火花，在当时帮助戏剧性地推进了自然语言处理。\n他说：“在NLP，我们在两年多前取得了巨大突破，然后突然NLP成为一个发生了很多事情的领域，它在某种程度上领先于所有其他人工智能领域。”“但我们有一个问题，那就是把文字和其他东西联系起来。所以这就像是这个机器人只会说话，但看不见，听不见。“。\n他说：“这篇论文是他们成功地将其与另一种医疗方式联系起来的一个例子，而且效果更好。”“你可以想象，当你想要在机器人中利用这个非常强大的语言模型时，这些技术中的一些可能会被重复使用。”也许你会用同样的东西把机器人的感官和文字联系起来。“", "note_en": "You’ve probably heard us say this countless times: GPT-3, the gargantuan AI that spews uncannily human-like language, is a marvel. It’s also largely  a mirage. You can tell with a simple trick: Ask it  the color of sheep, and it will  suggest “black” as often as “white”—reflecting the phrase “black sheep” in our vernacular.\n  That’s the problem with language models: because they’re only trained on text, they lack common sense. Now researchers from the University of North Carolina, Chapel Hill, have designed a new technique to change that. They call it “vokenization,” and it gives language models like GPT-3 the ability to “see.”\n  It’s not the first time people have sought to combine language models with computer vision. This is actually a rapidly growing area of AI research. The idea is that both types of AI have different strengths. Language models like GPT-3 are trained through unsupervised learning, which requires no manual data labeling, making them easy to scale. Image models like object recognition systems, by contrast, learn more directly from reality. In other words, their understanding doesn’t rely on the kind of abstraction of the world that text provides. They can “see” from pictures of sheep that they are in fact white.\n  AI models that can parse both language and visual input also have very practical uses. If we want to build robotic assistants, for example, they need computer vision to navigate the world and language to communicate about it to humans.\n  But combining both types of AI is easier said than done. It isn’t as simple as stapling together an existing language model with an existing object recognition system. It requires training a new model from scratch with a data set that includes text and images, otherwise known as a visual-language data set.\n  The most common approach for curating such a data set is to compile a collection of images with descriptive captions. A picture like the one below, for example, would be captioned “An orange cat sits in the suitcase ready to be packed.” This differs from typical image data sets, which would label the same picture with only one noun, like “cat.” A visual-language data set can therefore teach an AI model not just how to recognize objects but how they relate to and act on one other, using verbs and prepositions.\n    But you can see why this data curation process would take forever. This is why the visual-language data sets that exist are so puny. A popular text-only data set like English Wikipedia (which indeed includes nearly all the English-language Wikipedia entries) might contain nearly 3 billion words. A visual-language data set like Microsoft Common Objects in Context, or MS COCO, contains only 7 million. It’s simply not enough data to train an AI model for anything useful.\n  “Vokenization” gets around this problem, using unsupervised learning methods to scale the tiny amount of data in MS COCO to the size of English Wikipedia. The resultant visual-language model outperforms state-of-the-art models in some of the hardest tests used to evaluate AI language comprehension today.\n  “You don’t beat state of the art on these tests by just trying a little bit,” says Thomas Wolf, the cofounder and chief science officer of the natural-language processing startup Hugging Face, who was not part of the research. “This is not a toy test. This is why this is super exciting.”\n    Let’s first sort out some terminology. What on earth is a “voken”?\n  In AI speak, the words that are used to train language models are known as tokens. So the UNC researchers decided to call the image associated with each token in their visual-language model a voken.  Vokenizer is what they call the algorithm that finds vokens for each token, and  vokenization is what they call the whole process.\n  The point of this isn’t just to show how much AI researchers love making up words. (They really do.) It also helps break down the basic idea behind vokenization. Instead of starting with an image data set and manually writing sentences to serve as captions—a very slow process—the UNC researchers started with a language data set and used unsupervised learning to match each word with a relevant image (more on this later). This is a highly scalable process.\n  The unsupervised learning technique, here, is ultimately the contribution of the paper. How do you actually find a relevant image for each word?\n    Let’s go back for a moment to GPT-3. GPT-3 is part of a family of language models known as transformers, which represented a major breakthrough in applying unsupervised learning to natural-language processing when the first one was introduced in 2017. Transformers learn the patterns of human language by observing how words are used in context and then creating a mathematical representation of each word, known as a “word embedding,” based on that context. The embedding for the word “cat” might show, for example, that it is frequently used around the words “meow” and “orange” but less often around the words “bark” or “blue.”\n  This is how transformers approximate the meanings of words, and how GPT-3 can write such human-like sentences. It relies in part on these embeddings to tell it how to assemble words into sentences, and sentences into paragraphs.\n  There’s a parallel technique that can also be used for images. Instead of scanning text for word usage patterns, it scans images for visual patterns. It tabulates how often a cat, say, appears on a bed versus on a tree, and creates a “cat” embedding with this contextual information.\n  The insight of the UNC researchers was that they should use both embedding techniques on MS COCO. They converted the images into visual embeddings and the captions into word embeddings. What’s really neat about these embeddings is that they can then be graphed in a three-dimensional space, and you can literally see how they are related to one another. Visual embeddings that are closely related to word embeddings will appear closer in the graph. In other words, the visual cat embedding should (in theory) overlap with the text-based cat embedding. Pretty cool.\n  You can see where this is going. Once the embeddings are all graphed and compared and related to one another, it’s easy to start matching images (vokens) with words (tokens). And remember, because the images and words are matched based on their embeddings, they’re also matched based on context. This is useful when one word can have totally different meanings. The technique successfully handles that by finding different vokens for each instance of the word.\n  The token is the word “contact” in both examples. But in the first sentence, context suggests that the word refers to contact information, so the voken is the contact icon. In the second sentence, the context suggests the word refers to touch, so the voken shows a cat being stroked.\n  The researchers used the visual and word embeddings they created with MS COCO to train their vokenizer algorithm. Once trained, the vokenizer was then able to find vokens for the tokens in English Wikipedia. It’s not perfect. The algorithm only found vokens for roughly 40% of the tokens. But that’s still 40% of a data set with nearly 3 billion words.\n  With this new data set, the researchers retrained a language model known as BERT, an open-source transformer developed by Google that predates GPT-3. They then tested the new and improved BERT on six different language comprehension tests, including SQuAD, the Stanford Question Answering Dataset, which asks models to answer reading comprehension questions about a series of articles, and SWAG, which tries to trip up models with subtleties of the English language to probe whether it’s merely mimicking and memorizing. The improved BERT performed better on all of them, which Wolf says is nothing to sneeze at.\n  The researchers, Hao Tan, a PhD student, and Mohit Bansal, his advisor, will be presenting their new vokenization technique in two weeks at the Conference on Empirical Methods in Natural Language Processing. While the work is still early, Wolf sees their work as an important conceptual breakthrough in getting unsupervised learning to work for visual-language models. It was a similar spark that helped dramatically advance natural-language processing back in the day.\n  “In NLP, we had this huge breakthrough over two years ago, and then suddenly NLP was a field where a lot of things were happening and it kind of got ahead of all the other AI fields,” he says. “But we have this problem of connecting text with other things. So it’s like this robot that is only able to talk but cannot see, cannot hear.”\n  “This paper is one example where they managed to connect it to another modality and it works  better,” he says. “You could imagine that maybe some of these techniques could be reused when you want to leverage this really powerful language model in a robot. Maybe you use the same thing to connect the robot’s senses to text.”", "posttime": "2020-11-09 02:49:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,注入,vision,模型", "title": "研究人员希望通过将通过无监督学习(如GPT-3)训练的语言模型与有标签的计算机视觉数据集相结合，将常识注入人工智能", "title_en": "Researchers want to infuse common sense into AI by merging language models trained via unsupervised learning, like GPT-3, with labeled computer vision datasets", "transed": 1, "url": "https://www.technologyreview.com/2020/11/06/1011726/ai-natural-language-processing-computer-vision/", "via": "", "real_tags": ["人工智能", "注入", "vision", "模型"]}, {"category": "", "categoryclass": "", "imagename": "c71b0622d4622e5729f9b4e26c92c6a9.jpg", "infoid": 1033909, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Silentium首次将先进的宽带有源道路消音技术引入汽车行业。\n经过几年的开发，捷豹和路虎是首批将Silentium的“主动声学”软件集成到他们的三款新车中的汽车制造商，这意味着该技术现在可以供购车者体验。主动道路噪音消除可在从20 Hz到1 kHz的宽频带内消除90%不需要的噪音，为乘员提供更安静、更精致的体验，从而防止驾驶员疲劳。\n除了福利方面的好处，Silentium的主动声学技术还为汽车制造商提供了一种方法，可以减少他们对昂贵的被动减噪和隔音材料的依赖，并减轻车辆重量--随着汽车行业进入电动汽车的新时代，这是一个越来越重要的研发因素。\nSilentium汽车部门负责人安东尼·马尼亚斯评论说：“有源声学将改变汽车制造商降低、取消和增强车内声音的方式，以及客户感知和与这些声音互动的方式。Silentium已经证明，它可以使宽带车内噪音消除工作--现在汽车制造商有责任采用这项技术，并确保他们的客户能够享受到好处。“。\nSilentium的业内首创技术类似于一对高端降噪耳机，但更先进，因为它可以操控更多的空气。车辆底盘上最多有六个经过战略部署的加速度计，可以监测不想要的道路噪音，并将信号发送给装有Silentium软件的车载控制单元，后者通过车辆的扬声器系统播放等效的抗噪音信号。不想要的外部噪音和人工制造的抗噪音的压力波完全同时到达乘客的耳膜，并相互抵消。\nSilentium的主动声学软件可以降低、取消和增强任何车辆内的声音，改善乘员的舒适性、安全性和幸福感，并为所有人创造一个更愉快的环境。", "note_en": "Silentium has introduced advanced, broad-band active road noise cancellation to the auto industry for the first time.\n After several years in development, Jaguar and Land Rover are the first carmakers to integrate Silentium’s ‘Active Acoustics’ software in three of their new vehicles, meaning the technology is now available for car buyers to experience. Active road noise cancellation removes 90% of unwanted noise across a broad band of frequencies – from 20Hz up to 1kHz – providing a quieter and more refined experience for occupants, and therefore preventing driver fatigue.\n In addition to wellbeing benefits, Silentium’s Active Acoustics technology offers vehicle manufacturers a way to reduce their reliance on costly passive noise damping and insulation materials, and reduce vehicle weight – an increasingly important R&amp;D factor as the industry enters a new era of electro-mobility.\n Anthony Manias, Head of Automotive at Silentium, commented: “ Active Acoustics will change the way car manufacturers reduce, cancel and enhance sound inside their vehicles, and how customers perceive and interact with these sounds. Silentium has proven that it can make broadband in-car noise cancellation work – now the duty is on carmakers to adopt the technology and ensure their customers can enjoy the benefits.”\n   Silentium’s industry-first technology is similar to that found in a pair of high-end noise-cancelling headphones, but more advanced as it manipulates a larger amount of air. Up to six strategically positioned accelerometers on a vehicle’s chassis monitor unwanted road noise and send a signal to an on-board control unit with Silentium’s software, which plays an equivalent anti-noise signal through the vehicle’s speaker system. The pressure waves from both the unwanted exterior noise and manufactured anti-noise reach occupants’ eardrums at exactly the same time and cancel each other out.\n Silentium’s Active Acoustics software can reduce, cancel and enhance sound inside any vehicle, improving occupant comfort, safety and wellbeing, and creating a more enjoyable environment for all.", "posttime": "2020-11-09 02:45:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "有源,noise,噪音", "title": "汽车有源消声是如何工作的", "title_en": "How active noise cancellation for automotive works", "transed": 1, "url": "https://www.silentium.com/advanced-broad-band-active-noise-cancellation-now-available-in-cars/", "via": "", "real_tags": ["有源", "noise", "噪音"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033908, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我在Linux Foss世界中看到了许多自诩为进步的发展，但实际上却非常恼人，而且适得其反。\n结果适得其反，以至于它们实际上造成了重大的倒退、成本，就像GTK+3毁掉了用户体验和我们将永远享受Linux桌面之年的可能性。\nGTK+2曾经是Linux桌面应用程序的图形用户界面工具包。它高度可定制，相当轻量级，并且可以从C编程，这意味着几乎任何脚本语言都可以与它接口。\n它的开发人员没有以向后兼容的方式改进现有的工具包代码，而是决定引入许多突破性的API更改，这些更改需要大量的移植工作才能使现有的代码库与后续的GTK+3兼容，并且在支持GTK+3的同时保持对GTK+2的支持通常会在源代码库中涉及很多#ifdef混乱，而不是很多开发人员愿意维护的。\n此外，GTK+3还取消了许多用户可定制的主题选项，有效地让开发者花费大量精力创作的现有主题中的大部分变得毫无用处。以下是用户抱怨的问题列表。\n由于移植GTK+2应用程序需要花费大量精力才能使用GTK+3，许多已完成的GUI应用程序项目由于缺乏人力、对主要开发人员失去兴趣或过早死亡而永远无法移植。这类程序的一个例子是优秀的音频编辑器Sweep，它的上一次发布是在2008年。随着Linux发行版移除对GTK+2的支持，这些应用程序基本上消失在时间的空虚中。\n发行版的另一种选择是将(未维护的)GTK+2和GTK+3都保存在自己的存储库中，这样只有GTK+2的应用程序仍然可以使用，然而这会导致这些应用程序的用户基本上需要双倍的磁盘和RAM空间，因为这两个工具包都需要紧挨着放在一起。此外，只有在构建这两个工具包的Glib库中没有突破性变化的情况下，这才能起作用。\n更糟糕的是，由于GTK+3的迁移激怒了开发人员，许多人转而使用QT4或QT5，这需要使用C++，所以一个典型的Linux发行版现在混合了GTK+2、GTK+3、GTK+4、QT4和QT5应用程序，每个工具包都会消耗相当多的资源。\n微软(TM)知道得更清楚，认为向后兼容是其成功和市场地位的圣杯和根本原因。任何有25年历史的Win95时代的Win32图形用户界面应用程序在最新的Windows(TM)版本上仍然可以正常运行。他们甚至仍然支持使用一些内置仿真器的16位MS-DOS应用程序。\n从微软的角度来看，freedesktop.org的决策者决定让GTK+3成为一头完全不同的野兽，这对他们有利。当然，我们被教导永远不要相信恶意，而要相信愚蠢，所以这一举动背后实际上存在真正的阴谋和金钱补偿是不可想象的。否则我们就会成为阴谋论者的疯子，对吗？\n虽然蟒蛇2的发育多年来一直非常稳定，但蟒蛇3一眨眼的功夫就发生了变化。在将python3更新到下一个版本之后，现有代码不再像预期的那样工作，这并不少见。\n像我这样的许多开发人员更喜欢使用稳定的开发环境，而不是像python3那样不稳定的开发环境。\n随着决定停止使用python2，数以千计的基于py2的应用程序将经历与GTK+2应用程序相同的命运，而且没有维护者：它们将被淘汰，并从发行版存储库中消失。这可能比人们预期的要快，因为默认情况下，Python提供了对系统的OpenSSL库的绑定，该库有进行向后不兼容更改的历史。至少，一旦网络就新的TLS标准达成一致，python2将变得完全无用。\n将python2移植到python3通常不像GTK+2到GTK+3那样复杂，但由于Python的动态特性，语法检查器不能自动捕获所有代码问题，因此在运行时会遇到很多问题，导致移植的应用程序抛出回溯并停止执行，这可能会带来严重的后果。\n许多公司仍有数百万行代码仍在python2中，为了使其与python3兼容，将不得不付出相当多的汗水和费用。\n一旦学会了配置Linux盒网络连接所需的少数ifconfig和route命令，就可以轻松地在所有发行版中管理这一方面。现在，有人想出了一个绝妙的主意，宣布ifconfig和好友过时，并提供一个新的、更强大的工具来完成它的工作：IP。\n启动网络设备的命令现在是ip link set dev eth1 up，而不是旧的ifconfig eth1 up。这看起来真的像是进步吗？最糟糕的是，该工具的文档并不直观，所以人们基本上不得不向谷歌(Google)寻求例子，展示从一个命令到另一个命令的翻译。\n最新的基于system d的发行版想出了像enx78e7d1ea46da或vethb817d6a这样的网络接口名称，而不是传统的eth0。Ubuntu 20上默认分配的接口名称太长了，普通人甚至记不住，任何配置尝试都需要从IP复制/粘贴输出的名称。然而，几乎每个发行版都伴随着这种由Poetting/freedesktop.org口述的胡说八道。\n尽管在UNIX上使用的传统构建系统Autoconf有其不足之处，但它的设计方式是只有应用程序开发人员需要全套工具，而消费者只需要POSIX兼容的外壳环境和make程序。\n更现代的构建系统，比如cmake和介子系统，根本不关心用户必须安装的依赖项，事实上，根据这一点，介子作者声称他们的目标之一就是强迫用户安装一个尖端版本的python3，这样它就可以被普遍认为是既定的。\nCMake是用C++编写的，由70多MB的提取源代码组成，从源代码构建需要大量时间。它是根据调试信息构建的，从3.9.3版本开始占用了434MB的硬盘空间。它的主要原因是它支持Microsoft(TM)Visual Studio(TM)解决方案文件，因此Windows(TM)用户只需点击几下就可以从源代码编译程序。\n他们两人的共同点是，他们放弃了著名的用户界面来配置和制作，并发明了自己的NIH解决方案，这需要用户学习另一种方法来构建他的应用程序。\n这两个构建系统似乎都获得了像systemd一样的狂热追随者，或者有人付钱让巨魔出现在GitHub上，通过拉请求将GNU autoconf替换为其中任何一个，例如12。有趣的是，与freedesktop.org紧密相连的GNOME已经将将所有组件切换到meson作为其目标之一。它们的移植工作几乎涉及Linux桌面堆栈中的所有关键组件，包括cairo、pango、fontconfig、freetype、。这一努力背后的议程可能是什么？\n我们生活在一个时代，在自由和开放源码软件的世界里，人们不得不不断地重新学习东西，转向新的、理应更好的、但更臃肿的解决方案，通常给人的印象是有人从脚下拉地毯。这一领域的许多关键变化都是由一小群决策者强行通过的，他们往往与红帽/侏儒/freedesktop.org关系密切。我们正在购买这款产品。在这一领域，许多关键的变化都是由一小撮决策者强行通过的，他们往往与红帽/侏儒/freedesktop.org关系密切。我们正在购买这款产品。别忘了，红帽(Red Hat)和微软(Microsoft)是合作伙伴，甚至可能拥有相同的股东。", "note_en": "Lately I see many developments in the linux FOSS world that sell themselves as progress, but are actually hugely annoying and counter-productive.\n Counter-productive to a point where they actually cause major regressions, costs, and as in the case of GTK+3 ruin user experience and the possibility that we&#39;ll ever enjoy &#34;The year of the Linux desktop&#34;.\n  GTK+2 used to be  the GUI toolkit for Linux desktop applications.It is highly customizable, reasonably lightweight and programmable from C, which means almost any scripting language can interface to it too.\n Rather than improving the existing toolkit code in a backwards-compatible manner,  its developers decided to introduce many breaking API changes which require a major porting effort to make an existing codebase compatible with the successor GTK+3, and keeping support for GTK+2 while supporting GTK+3 at the same time typically involves a lot of #ifdef clutter in the source base which not many developers are willing to maintain.\n Additionally GTK+3 made away with a lot of user-customizable themeing options, effectively rendering useless most of the existing themes that took considerable developer effort for their creation.Here&#39;s a  list of issues users are complaining about.\n Due to the effort required to port a GTK+2 application to use GTK+3, many finished GUI application projects will never be ported due to lack of manpower, lost interest of the main developer or his untimely demise.An example of such a program is the excellent audio editor  sweep which has seen its last release in 2008.With Linux distros removing support for GTK+2, these apps are basically lost in the void of time.\n The other option for distros is to keep both the (unmaintained) GTK+2 and GTK+3 in their repositories so GTK+2-only apps can still be used, however that causes the user of these apps to require basically the double amount of disk and RAM space as both toolkits need to live next to each other. Also this will only work as long as there are no breaking changes in the Glib library which both toolkits are built upon.\n Even worse, due to the irritation the GTK+3 move caused to developers, many switched to QT4 or QT5, which requires use of C++, so a typical linux distro now has a mix of GTK+2, GTK+3, GTK+4, QT4 and QT5 applications, where each toolkit consumes considerable resources.\n Microsoft (TM) knows better and sees backwards compatibility as the holy grail and underlying root cause of its success and market position. Any 25 year old Win32 GUI application from the Win95 era still works without issues on the latest Windows (TM) release. They even still support 16bit MS-DOS apps using some built-in emulator.\n From MS&#39; perspective, the freedesktop.org decision makers played into their hands when they decided to make GTK+3 a completely different beast.Of course, we are  taught to never believe in malice but in stupidity, so it is unthinkable that there was actually a real conspiracy and monetary compensations behind this move.Otherwise we would be conspiracy theorist nuts, right ?\n   Whereas python2 development has been very stable for many years, python3 changes at the blink of an eye. It&#39;s not uncommon to find that after an update of python3 to the next release, existing code no longer works as expected.\n Many developers such as myself prefer to use a stable development environment over one that is as volatile as python3.\n With the decision to  EOL python2 thousands of py2-based applications will experience the same fate as GTK+2 applications without maintainer: they will be rendered obsolete and disappear from the distro repositories. This may happen quicker than one would expect, as python by default provides bindings to the system&#39;s OpenSSL library, which has a history of making backwards-incompatible changes. At the very least, once the web agrees on a new TLS standard, python2 will be rendered completely useless.\n Porting python2 to python3 isn&#39;t usually as involving as GTK+2 to GTK+3, but due to the dynamic nature of python the syntax checker can&#39;t catch all code issues automatically so many issues will be experienced at runtime in cornercases, causing the ported application to throw a backtrace and stopping execution, which can have grave consequences.\n Many companies have  millions of line of code still in python2 and will have to produce quite some sweat and expenses to make it compatible to python3.\n  Once one had learned his handful of ifconfig and route commands to configure a Linux&#39; box network connections, one could comfortably manage this aspect across all distros. Not any longer, someone had the glorious idea to declare ifconfig and friends obsolete and provide a new, more &#34;powerful&#34; tool to do its job:  ip.\n The command for bringing up a network device is now  ip link set dev eth1 up vs the older  ifconfig eth1 up. Does this really look like progress?Worst, the documentation of the tool is non-intuitive so one basically has to google for examples that show the translation from one command to the other.\n   Latest systemd-based distros come up with network interface names such as  enx78e7d1ea46da or  vethb817d6a, instead of the traditional  eth0.The interface names assigned by default on Ubuntu 20 are so long a regular human can&#39;t even remember them, any configuration attempt requires one to copy/paste the name from  ip a output.Yet almost every distro goes along with this  Poettering/freedesktop.org-dictated nonsense.\n  While the traditional buildsystem used on UNIX,  autoconf, has its warts, it was designed in such a way that only the application developer required the full set of tools, whereas the consumer requires only a POSIX compatible shell environment and a  make program.\n More &#34;modern&#34; build systems like  cmake and  meson don&#39;t give a damn about the dependencies a user has to install, in fact according to  this,  meson authors claimed it to be one of their goals to force users to have a bleeding edge version of python3 installed so it can be universally assumed as a given.\n CMake is written in C++, consists of 70+ MB of extracted sources and requires an impressive amount of time to build from source. Built with debug information, it takes up 434 MB of my harddisk space as of version 3.9.3.It&#39;s primary raison-d&#39;etre is its support for the Microsoft (TM) Visual Studio (R) (TM) solution files, so Windows (TM) people can compile stuff from source with a few clicks.\n The two of them have in common that they threw over board the well-known user interface to configure and make and invented their own NIH solution, which requires the user to learn yet another way to build his applications.\n Both of these build systems seem to have either acquired a cult following just like systemd, or someone is paying trolls to show up on github with pull requests to replace GNU autoconf with either of those, for example  1  2 .Interestingly also, GNOME, which is tightly connected to freedesktop.org, has made it one of its goals to  switch all components to meson.Their porting effort involves almost every key component in the Linux desktop stack, including cairo, pango, fontconfig, freetype, and dozens of others. What might be the agenda behind this effort?\n  We live in an era where in the FOSS world one constantly has to relearn things, switch to new, supposedly &#34;better&#34;, but more bloated solutions, and is generally left with the impression that someone is pulling the rug from below one&#39;s feet.Many of the key changes in this area have been rammed through by a small set of decision makers, often closely related to Red Hat/Gnome/freedesktop.org.We&#39;re buying this &#34;progress&#34; at a high cost, and one can&#39;t avoid asking oneself whether there&#39;s more to the story than meets the eye.Never forget, Red Hat and Microsoft (TM) are  partners and might even have the same shareholders.", "posttime": "2020-11-09 02:45:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "倒退,progress,应用程序", "title": "当“进步”是倒退的时候", "title_en": "When “Progress” Is Backwards", "transed": 1, "url": "https://sabotage-linux.github.io/blog/8", "via": "", "real_tags": ["倒退", "progress", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "48e4f568d5aeab69383f3de56a626275.png", "infoid": 1033906, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每周，我们都会发布有用的前端和用户体验技巧。订阅并将智能界面设计核对表PDF发送到您的收件箱。\n如果用户体验设计做了它应该做的事情，用户将不会注意到其中的任何工作。用户需要考虑的界面或设计越少，他们就越能专注于在你的网站上实现他们的目标。作为一名设计师，你的工作就是通过事先清除障碍，给他们一条通向目标的直路。\n“挡在高速行驶的货运列车上通常不会有好结果。要改变具有如此强大动力的事物的进程，需要付出很大的努力。与其强迫人们把注意力从他们的首要任务上转移，不如去他们所在的地方。“--谷歌产品总监卢克·沃布列夫斯基(Luke Wroblewski)。\n毕竟，还是考虑一下另一种选择吧。复杂和令人困惑的界面迫使用户找到解决问题的办法，而这些问题本来就不应该出现在那里。对选项、界面、导航等感到困惑的用户很可能会在思考过程中感到不知所措。即使是短暂的停顿也足以让用户重新回到他们坐在电脑前的现实中。\n这种过度思考被称为认知过载，这里我们将解释如何避免它。首先，我们需要解释我们大脑中到底是什么存在超负荷的风险。\n认知负荷指的是你的工作记忆能处理的信息总量。当你的工作记忆接收到的信息超过了它能舒适地处理的时候，就会出现认知过载，导致挫折感和复杂的决策。\n但这到底是什么意思呢？工作记忆到底是什么？这和设计有什么关系？第一步是理解认知负荷理论的起源。\n虽然对认知的研究可以追溯到几个世纪前，但直到20世纪80年代，澳大利亚教育心理学家约翰·斯韦勒(John Sweller)才将这项研究应用于教学设计。斯韦勒试图为任何类型的学习者辨别出最好的条件来保留他们所学到的信息。换句话说，让一堂课变得牢不可破的最好策略是什么？\n斯韦勒的工作在1988年出版的《认知负荷理论、学习困难和教学设计》(PDF)中达到顶峰，并于1994年晚些时候重新修改和出版。他的研究纳入了被称为图式的数据组织结构，并概述了有效和无效的教学方法，但他对工作记忆局限性的发现往往是设计师们认为最有用的。\n在许多方面，斯韦勒的工作都是基于乔治·米勒(George Miller)的信息处理理论。米勒是20世纪50年代的认知心理学家和语言学家，他测试了短期记忆的极限。自那以后，米勒的研究在数字设计中根深蒂固，特别是本文后面讨论的组块技术。米勒还负责了论文《魔术数字7，加或减2》(PDF)，这促使许多设计师将菜单项目限制在5到9之间-尽管这种技术后来在数字设计中被降级了。\n虽然这些策略最初是针对教育领域的，但它们同样适用于用户体验(UX)设计。正如我们将解释的，增强记忆力和学习的相同技术也减少了用户的烦恼。\n如果每次你想打开冰箱的时候，你都得回答一个斯芬克辛的谜题，比如：“什么东西早上用四只脚走路，下午用两只脚走路，晚上用三只脚走路？”\n过一段时间它就会变旧了，对吧？但根据认知负荷理论，这与用户对糟糕的用户体验设计的挫折感是一样的。\n要理解认知负荷理论，你必须了解工作记忆，这是一种在瞬间完成任务的大脑活动。工作记忆必须对所有外部刺激和短期记忆项目进行分类，如果需要，还可以从长期记忆中提取信息。可以把工作记忆想象成计算机RAM，把长期记忆想象成硬盘。\n工作记忆和短期记忆通常可以互换使用，但它们略有不同。工作记忆负责信息的处理，而短期记忆更像是存放重要但对长期记忆还不够重要的信息的便签簿。\n让我们看看这篇文章来解释其中的不同之处。当你在阅读的时候，你可能会遇到一个不熟悉的蓝色文本的概念。你的工作记忆需要知道蓝色文本中的概念是什么意思，才能理解文章的更大含义。你的长期记忆知道蓝色文本意味着链接，所以你的工作记忆知道点击链接获取更多信息。同时，你的短期记忆会记住你在文章中的位置，所以当你从外部页面返回时，你不会迷路--但到了明天早上，那个位置就会被遗忘。\n著名作家史蒂夫·克鲁格将认知负荷理论推广到网页设计中。他的书《别让我思考》被许多设计师认为是一部开创性的作品。\n每个页面都应该不言而喻，因为用户从中间进入网站的可能性与从主页进入网站的可能性一样大。\n用户倾向于“满意”--也就是说，对他们的问题采取第一个或最简单的解决方案，而不是最好的解决方案。此外，作为习惯生物，用户将继续一遍又一遍地使用相同的解决方案，从来没有考虑过更好的选择。\n当一个能力或经验一般的人能够使用该系统来实现他们的目标时，可用性就足够了。\n很多网络使用都是出于节省时间的愿望。所以，用户经常会采取鲨鱼式的“要么继续走，要么死掉”的心态。\n即使从未使用过，屏幕上可见的主页按钮也会给用户一种安心的感觉。\n除了克鲁格，还有许多人详细阐述了认知负荷理论在设计中的作用，包括尼尔森诺曼集团(Nielsen Norman Group)的可用性专家。\n总而言之，每次用户在浏览网站时不得不停下来思考--哪怕是一瞬间--他们的工作记忆都会被压垮。诸如“这是可点击的吗？”、“主页按钮在哪里？”以及“我该怎么存钱？”会毁了用户的体验。\n许多设计变量可能会加重用户大脑的负担，而用户外部生活和环境中的更多变量也不在您的控制范围之内。用户可能会担心第二天的工作演示，或者他们的窗口外面可能有吵闹的建筑-这些东西会耗尽他们的工作记忆，无论你的网站设计有多简单。\n我们不要忘记，每个用户都有不同的工作记忆容量。随和的用户将能够更好地专注于你的网站，而不是那些对每一件小事都有压力的用户。不经常上网的用户将不得不比有经验的网络用户考虑得更多。\n虽然我们不能普遍量化认知超负荷，但我们可以分离出最常见的导致认知超负荷的设计错误。下面，我们对网页设计中最流行的类型进行了分类，以及避免它们的最佳实践。\n用户迈出的每一步都会增加他们的认知负荷。太多不必要的动作会打乱用户的思路，或者激怒他们。因为用户的工作记忆专注于完成特定的目标，不必要的操作会迫使用户付出更多努力，这就需要无缘无故地将更多的工作记忆投入到任务中。至少，这些不必要的步骤将考验用户的耐心。\n速度和步调是最小化认知负荷的基本考虑因素。用户想要快速、有目的地完成他们的任务，所以要事先消除任何滞后。\n用户喜欢在提交电子邮件地址之前知道自己在做什么，但Touch of Modern的看门人要求在…之前注册。什么都行!。这第一个强制性和不必要的行动将吓跑相当大一部分潜在用户。\n下面是找到不必要操作的一个很好的练习：列出用户为完成任务必须执行的每个步骤。例如，发送电子邮件可能如下所示：\n通过让光标自动从“发送到”字段开始，您可以完全删除步骤2。这将省去用户的麻烦，无论这些麻烦多么微不足道。你消除的每一步都是胜利。\n让我们来看看谷歌的主页。光标从搜索字段开始，因此用户所要做的就是开始键入。这些微观互动构成了整个体验，所以不要忽视它们。\n杂乱、混乱或令人分心的界面会让用户从手头的任务中分心。就像当几个人同时与你交谈时很难集中注意力一样，在网络上，当太多的图片、动画、图标、广告、文本类型和鲜艳的颜色争抢着你的注意力时，你很难集中注意力。\n记住，一个人的工作记忆必须在朝着目标前进的过程中梳理外部刺激。每一次分心，尤其是视觉上的霸道，都需要用户的关注。\nLINGsCARS可能是一个极端的例子，但你可以看到相互竞争的元素，如鲜艳的颜色和动作，攻击感官的速度是多么快。即使在屏幕的两个不同区域同时播放两个动画，也有可能过度刺激用户。\n首先，扔掉所有不必要的东西。一般来说，只保留必要的内容是有利的，可以减少装载时间并简化体验。更重要的是，一项关于美学如何影响网站第一印象(PDF)的研究发现，与视觉上复杂的网站相比，用户更喜欢简单的网站。\n你也可以使你的内容多样化以达到平衡。太多的一种类型(比如，文本或图像)是专横的。充分利用视觉内容--图片、视频、信息图表等--在页面上营造和谐，让用户更容易理解。\n影视网站IMDb本可以很容易地严重依赖视觉内容，但它却用等量的文本内容来平衡视觉内容。\n一旦你把一个页面归结为它的必需品，以一种用户可以立即理解的方式组织这些元素。对称或建设性不对称的布局以一种更容易理解的方式显示信息，也就是说，以一种不需要大脑努力的方式显示信息。对称和巧妙的不对称不仅让人赏心悦目，而且它们的结构使界面更容易交互。\n看看Groupon是如何用特色冷冻酸奶交易的文字描述(右中)来抵消文本类别垂直菜单(左中)的影响吧？照片和色块的使用创造了一个有条理的、令人满意的沙漏形状，中间用文字夹住。\n对称不仅仅是在屏幕的两侧放置相同的布局。这是关于平衡视觉重量和视觉方向。通过这种方式，不对称屏幕仍然可以看起来井然有序，如下面的OTHR所示。\n把你的页面缩小到只有简单和非竞争性的元素，这只是对抗过度刺激的一半。不要忘了以简单的布局呈现这些元素。\n这有点自相矛盾：用户想要很多选择，但太多的选择会让他们的大脑不堪重负。\n希克定律(或称决策瘫痪)解释了这样一种现象：用户拥有的选择越多，他们做出决定所需的时间就越长。虽然威廉·希克(William Hick)和雷·海曼(Ray Hyman)在20世纪50年代首次测试了他们的理论，但在过去的十年里，他们的发现被重新定义为数字设计。行为研究(PDF)不仅证实了希克定律，而且最近在2015年的一项核磁共振研究中记录了这一现象对大脑的影响。\n作为一名设计师，要理解希克定律，就要把每一种选择都看作是一盏闪光灯。如上所述，过多的闪光灯会过度刺激使用者。\n即使是像乐天这样的流行网站的制作人也会犯这个错误，因为他们没有正确地理解这一原则。这是给用户他们想要的东西和给他们认为他们想要的东西之间的区别。\n假设你已经去掉了不必要和多余的选项，你可以将多个选项分组到伞类别中。你可以在百货商店的网站上看到很多这样的东西，那里有最广泛的产品选择。\n这不一定是关于太多的选择，只是一次有太多的选择。如果你能把其中的一些选择隐藏在隐藏的菜单、抽屉和抽屉里，你就两全其美了。这些超级菜单仍然为用户提供了许多选项，但选择的剂量不会让用户负担过重。\n然而，隐藏的导航菜单限制了可发现性，因此电子商务和新闻等行业的设计师必须小心。通过在页面上添加指向其他产品的特殊链接(例如亚马逊的“相关购买”横幅)，可以最大限度地减少隐藏菜单的缺点。或者，你可以简单地取消隐藏菜单，将标题类别泛化，直到它们可以放入单一导航菜单中(就像苹果和CNN所做的那样)。\n您还需要注意如何组织整个网站的导航。希克定律的许多问题可以通过管理信息体系结构(IA)来处理，我们将在下面的“难以找到的页面和特性”一节中讨论这一点。\n就像过度刺激和选择太多的问题一样，提供太多的内容会把你的用户的工作记忆拉向太多不同的方向。\n你显然只想显示必要的内容，但对于一些强大的网站来说，一切都是必不可少的。如果你有太多的内容，你必须学会如何组织它，这样你才不会给用户带来压力。\nArngren的问题不在于它提供的产品太多，而在于它同时提供的产品太多。更多的结构和组织会给网站的外观带来奇迹。\n正如上面所解释的，乔治·米勒的组块策略在以一种可管理的方式呈现大量内容方面是有效的。这是一种将数据分组以便于记忆的技能。电话号码分为国家代码、区号、一组三位数字和一组四位数字--一串11个或更多的数字太难记忆了。\n你想在你的在线商店的主页上展示大量的产品图片吗？不是将它们全部列在单独的行和列中，而是根据它们的类型将它们分组显示。根据卖家的说法，Etsy可以通过将产品分组，在其主页上展示更多的产品。\n文本中的组块包括短小的段落，充分使用标题和副标题，以及充足的空白处。\n对于所有数据都是必需的长篇大论的表单域，请尝试多步骤表单。长长的表格可能看起来很吓人，有时甚至会导致网站被放弃。将表单信息拆分成单独的页面，或者至少是单独的部分，以使其不那么引人注目。只需确保包含进度标记，以便用户知道预期的页面数量即可。\n买机票总是需要填写大量的数据，而这些数据都不是可浪费的。维珍航空改善了原本繁琐的体验，将其分解为单独页面上的各个步骤：选择航班、填写乘客信息、输入付款细节等。把所有这些都放在一个很长的页面上会让一些用户不堪重负，并增加弃机率。\n认知过载的最大罪魁祸首是令人困惑的用户界面。用户永远不需要花很长时间来弄清楚如何完成他们想要的动作，也不应该浪费脑力去解读一个图标。\n并不是所有的用户都精通技术，能够理解SpeedCrunch模糊的图标。即使他们对电脑有足够的了解，能够认出顶部的Windows和Mac OS X符号，右下角的这两个图标也会让艾伦·图灵(Alan Turing)等一会儿。\n不要重新发明轮子：使用用户从其他网站上已经知道的视觉提示。用户依靠共同的负担和符号来学习控制，即使是在他们以前从未访问过的网站上也是如此。\n如果这太令人窒息，你可以给熟悉的图案一个独特的旋转与你的品牌的身份。家得宝(Home Depot)使用常见的图标，但为它们提供了该品牌的橙色标志。\n同样的道理也适用于显微镜。带有“联系”和“提交”等标准标签的按钮比“地址”或“前往”等非常规标签更容易辨认。众所周知的标签方便了用户的浏览体验，而不常见的标签会让用户停下来想知道按钮是做什么的。不要因为个性而牺牲清晰度。\n另一方面，如果你有一个以前从未见过的功能呢？在这种情况下，通过使用真实的表示让它变得不言自明。伪超形术，正如它所说的那样，在现实和数字等价物之间架起了一座桥梁。例如，早期的互联网先驱选择信封来代表电子邮件，因为信封是邮件系统的明显象征。\n此外，要避免模糊的符号，特别是如果它们可能被误认为其他东西，或者在其他方面令人困惑。下面，Issuu的一些图标很熟悉，但另一些则不熟悉。如果用户不得不点击一个图标才能发现它的功能，他们将被淘汰出局。\n用全新的眼光审视你的设计，确保你没有遗漏任何明显的东西。\n看看丹尼斯·科图诺夫列出的10个常见的图标错误清单，了解哪些是不应该做的--例如，图标之间过于相似，或者个别图标过于复杂。\n任何不是完全显而易见的界面都应该包括自注册，以指导用户了解用户界面是如何工作的。简单的网站可以只用一个窗口，特别是如果一个令人难忘的图形解释了它的功能。然而，新的和独特的界面需要更多的动手教程。例如，Slake提供了一次完整的视频巡演，并配有旁白解释正在发生的事情。\n即使用户拥有他们需要的一切，他们也可能找不到。这并不比功能被破坏好到哪里去。归根结底，用户试图弄清楚该做什么是在浪费脑力。\n作为每个用户体验不可替代的组成部分，导航应该是简单和无压力的。网站导航应该感觉直观，应该给用户信心，让他们可以自由漫游，而不用担心迷路。这不仅需要在IA中进行额外的工作，而且还需要仔细应用，使其看起来比实际情况更简单。\n如果你认为汉堡图标不好，Mojo Yogurt要求你将鼠标悬停在左上角的标志上，以显示导航菜单。\n值得称道的是，一个写着“导航”的小动画环绕着这个标志。但是屏幕上所有的颜色和动作，一个模糊的提示是不够的。\n根据用户的喜好调整您的IA。你的目标用户群可能与你的想法不同，所以向他们学习如何组织网站。卡片分类测试揭示了用户如何对某些页面和主题进行分类。树测试评估真实用户对您当前或提议的结构的理解程度。\n有关信息构建的速成课程，请阅读丹·布朗(Dan Brown)的“信息构建的八大原则”(PDF)。在短短五页的时间里，他的概述解释了每个设计师都应该知道的关于IA的八条坚定不移的规则，比如多重分类原则(即使用几种不同的分类方法来适应用户的不同思维模式)和披露原则(即只显示足够的信息，以便用户知道会发生什么)。\n您还可以通过组合页面或菜单项来消除冗余。例如，高管简历不需要一个页面，团队成员个人也不需要另一个页面--它们可以放在同一个页面上。\n.", "note_en": "Every week, we send out useful front-end &amp; UX techniques. Subscribe and get the   Smart Interface Design Checklists PDF delivered to your inbox.\n      If the user experience design does what it’s supposed to do, the user won’t notice any of the work that went into it. The less users have to think about the interface or design, the more they can focus on accomplishing their goal on your website. Your job, as a designer, is to give them a straight path to their goal by clearing out the obstacles beforehand.\n “Getting in the way of a speeding freight train usually doesn’t end well. It takes a lot of effort to shift the course of something with that much momentum. Rather than forcing people to divert their attention from their primary task, come to where they are.”  — Luke Wroblewski, Product Director at Google\n After all, consider the alternative. Complicated and confusing interfaces force users to find solutions to problems that shouldn’t be there in the first place. A user who feels confused by the options, the interface, the navigation and so on will likely feel overwhelmed in their thinking process. Even momentary pauses are enough to rip users back into the reality that they’re sitting in front of their computer.\n This  excessive thinking is called cognitive overload, and here we’ll explain how you can avoid it. First, we need to explain what exactly in our brains is at risk of being overloaded.\n   Cognitive load refers to the total amount of information your working memory can handle. Cognitive overload happens when your working memory receives more information than it can handle comfortably, leading to frustration and comprised decision-making.\n But what does that mean, really? What exactly is working memory? And what does this have to do with design? The first step is to understand the origin of cognitive load theory.\n  While the study of cognition dates back centuries, it wasn’t until the 1980s that Australian educational psychologist  John Sweller applied the research to instructional design. Sweller sought to discern the best conditions for learners of any kind to retain the information they were taught. In other words, what are the best strategies for making a lesson stick?\n Sweller’s work culminated in the 1988 publication of “ Cognitive Load Theory, Learning Difficulty, and Instructional Design” (PDF), reworked and republished later in 1994. His work incorporated the data organizational constructs known as  schema and outlined both effective and ineffective teaching methods, but his findings on the limitations of working memory are what designers tend to find most useful.\n In many ways, Sweller’s work expanded on the  information processing theories of  George Miller, a cognitive psychologist and linguist of the 1950s who tested the limits of short-term memory. Miller’s research has since ingrained itself in digital design, especially the technique of  chunking, discussed later in this article. Miller was also responsible for the paper “ The Magical Number Seven, Plus or Minus Two” (PDF), which prompted many designers to limit menu items to between five and nine — although this technique has since been  demoted in digital design.\n While these strategies were originally intended for the field of education, they apply equally to user experience (UX) design. As we’ll explain, the same techniques that enhance memorability and learning also reduce user annoyance.\n   What if every time you wanted to open the fridge, you had to answer a Sphinxian riddle like, “What walks on four feet in the morning, two in the afternoon and three at night?”\n It would get old after a while, right? But according to cognitive load theory, that’s the same kind of frustration users feel with poor UX design.\n  To understand cognitive load theory, you have to understand  working memory, the brain activity used to complete a task in the moment. Working memory must sort through all external stimuli and short-term memory items, as well as draw from long-term memory if needed. Think of working memory as computer RAM and long-term memory as the hard drive.\n Working memory and short-term memory are often used interchangeably, but they are slightly different. Working memory handles the processing of information, whereas short-term memory is more like a  scratch pad for information that’s important but not important enough for long-term memory.\n Let’s look at this very article to explain the differences. As you’re reading, you might come across an unfamiliar concept in blue text. Your working memory needs to know what the concept in blue text means in order to comprehend the greater meaning of the article. Your long-term memory knows that blue text means a link, so your working memory knows to click the link for more information. At the same time, your short-term memory remembers your place in the article, so that you’re not lost when you return from the external page — but by tomorrow morning, that location will have been forgotten.\n   The influential writer Steve Krug is the one who popularized the application of cognitive load theory to web design. His book   Don’t Make Me Think is considered a seminal work by many designers.\n  Every page should be self-explanatory, because users are just as likely to enter your website from the middle as from the home page.\n Users tend to “satisfice” — that is, take the first or easiest solution to their problem, instead of the best. Moreover, as creatures of habit, users will continue to use that same solution over and over, without ever considering a better option.\n Usability is adequate when a person of average ability or experience can use the system to accomplish their goals.\n Much of web usage is motivated by a desire to save time. So, users will frequently adopt a shark’s “keep moving or die” mentality.\n  Even if it’s never used, a home button visible on the screen gives users a sense of reassurance.\n Besides Krug, many others have elaborated on the role of cognitive load theory in design,  including the usability gurus at Nielsen Norman Group.\n To summarize, every time the user has to pause to think while browsing a website — even for an instant — their working memory is weighed down. Questions like “Is this clickable?,” “Where’s the home button?” and “How do I save?” can ruin the user’s experience.\n   Many design variables have the potential to tax the user’s brain, and many more variables in the user’s external life and environment are beyond your control. A user could be worried about a work presentation the next day, or there could be loud construction right outside their window — these things will drain their working memory, regardless of how simple your website design is.\n And let’s not forgot that each user has a different capacity for working memory. Easygoing users will be able to focus on your website better than those who stress about every little thing. Users who don’t regularly go online will have to think more than experienced web users.\n While we can’t universally quantify cognitive overload, we can isolate the design mistakes that mostly commonly cause it. Below, we’ve categorized the most prevalent types found in web design, along with the best practices for avoiding them.\n  Every step the user takes adds to their cognitive load. Too many unnecessary actions will derail the user’s train of thought or irritate them. Because the user’s working memory is focused on accomplishing specific goals, unnecessary actions force the user to put in more effort, which entails dedicating more working memory to the task, for no good reason. At the very least, these unnecessary steps will test the user’s patience.\n Speed and pacing are essential considerations for minimizing cognitive load. Users want to accomplish their task at a brisk, purposeful pace, so remove any lag beforehand.\n  Users like to know what they’re getting into before submitting their email address, but Touch of Modern’s gatekeeper demands registration before… anything! This first mandatory and unnecessary action will scare away a sizeable chunk of potential users.\n  Here’s a great exercise for finding unnecessary actions:  List every step a user must do to complete a task. For example, sending an email might look like this:\n   You could remove step 2 entirely by having the cursor start in the “Send to” field automatically. This will save the user the trouble, however slight. Every step you eliminate is a win.\n  Let’s consider  Google’s home page. The cursor starts in the search field, so all the user has to do is start typing. These micro-interactions add up over the entire experience, so don’t ignore them.\n  Cluttered, chaotic and otherwise distracting interfaces can derail a user from their task at hand. Just like it’s hard to focus when several people are talking to you at once, on the web it’s hard to focus when too many images, animations, icons, ads, text types and bright colors are fighting for your attention.\n Remember that one’s working memory must sort through external stimulus as it moves forward to its goal. Every distraction, especially a visually domineering one, demands a piece of the user’s attention.\n  LINGsCARS might be an extreme example, but you can see how quickly the competing elements, such as bright colors and motion, attack the senses. Even two simultaneous animations in two different areas of the screen threaten to overstimulate the user.\n  For starters,  get rid of everything that’s not essential. Keeping only what’s necessary is advantageous in general, reducing loading times and streamlining the experience. Even more important, a study on how  aesthetics affect a website’s first impression (PDF) found that users prefer simple websites over visually complex ones.\n You can also  diversify your content for balance. Too much of one type (say, text or images) is overbearing.  Use a fair mix of visual content — images, videos, infographics, etc. — to create harmony on the page and make it easy for the user to comprehend.\n The film and TV website  IMDb could have easily leaned heavily on visual content, but instead it balances it with equal amounts of textual content.\n  Once you’ve boiled down a page to its necessities, organize those elements in a way that’s instantly comprehensible to the user.  Layouts with symmetry or constructive asymmetry display information in a way that’s quicker to understand, which is to say, in a way that demands less effort of the brain. Not only are symmetry and smart asymmetry pleasing to the eye, but their structure makes the interface easier to interact with.\n See how  Groupon offsets its vertical menu of text categories (middle left) with a text description of the featured frozen yogurt deal (middle right)? The use of photos and color blocks creates a structured and satisfying hourglass shape, pinched in the middle by text.\n  Symmetry is more than just about putting identical layouts on both sides of the screen. It’s about  balancing visual weight and visual direction. In this way, asymmetrical screens can still appear organized, as  OTHR shows below.\n  Reducing your page to only simple and non-competing elements is just half the battle against overstimulation. Don’t neglect to present these elements in a straightforward layout.\n  It’s a bit of a paradox: Users want a lot of options, but too many options will overload their brain.\n Hick’s Law (or decision paralysis) tells of the phenomenon: The more options a user has, the more time they will take to make a decision. While William Hick and Ray Hyman first tested their theory in the 1950s, in the last decade their findings have been  redefined for digital design. Not only have  behavioral studies (PDF) confirmed Hick’s Law, but recently the phenomenon’s effects on the brain have been  documented in a 2015 MRI study.\n To understand Hick’s Law as a designer, think of each option as a bright flashing light. Too many bright flashing lights will overstimulate the user, as demonstrated above.\n  Even the makers of popular websites, like Rakuten’s, make this mistake because they don’t properly understand the principle. It’s the difference between giving users what they want and giving them what they think they want.\n  Assuming you’ve already gotten rid of unnecessary and redundant options, you can  group multiple options in umbrella categories. You see this a lot on department store websites, which have the widest product selections.\n It’s not necessarily about too many options, just too many options at one time. If you can hide some of those choices in hidden menus, drawers and pullouts, you get the best of both worlds. These  mega-menus still give the user many options, but in digestible doses that won’t overburden them.\n  However,  hidden navigation menus limit discoverability, so designers in industries such as e-commerce and news must be careful. You can minimize the drawbacks of hidden menus by complementing the page with out-of-the-way links to other products (such as Amazon’s “Related purchases” banner). Or you can simply do away with hidden menus by generalizing the header categories until they fit in a single navigation menu (as Apple and CNN do).\n  You’ll also want to be careful about how you organize the website’s navigation as a whole. A lot of issues with Hick’s Law can be handled by managing the information architecture (IA), which we’ll discuss below in the “Hard-to-Find Pages and Features” section.\n  Just like the problems of overstimulation and too many options, offering too much content will pull your user’s working memory in too many different directions.\n You obviously want to display only the content that’s essential, but for some robust websites, everything is essential. If you have too much content, you must learn how to organize it so that you don’t strain users.\n  The problem with Arngren isn’t that it offers too many products, but that it offers too many products at the same time. A little more structure and organization would do wonders for the look of the website.\n  As explained above, George Miller’s tactic of  chunking is effective at presenting copious amounts of content in a manageable way. It’s the skill of grouping data to make it easy to remember. A phone number is broken into country code, area code, a set of three digits, and a set of four digits — a string of 11 or more numbers would be too hard to memorize.\n Do you want to feature a lot of product images on the home page of your online store? Instead of listing them all in separate rows and columns,  display them in groups based on their type.  Etsy is able to display more products on its home page by grouping them in chunks according to seller.\n  Chunking in text involves short paragraphs, adequate use of headings and subheadings, and ample empty space.\n For long-winded form fields in which all of the data is necessary, try a  multi-step form. Long forms can appear intimidating and sometimes even cause website abandonment.  Break up the form’s information into separate pages, or at least separate sections, to make it less imposing. Just be sure to include a progress marker so that users know how many pages to expect.\n  Buying a plane ticket always involves filling in a lot of data, none of which is expendable.  Virgin Atlantic improves an otherwise tedious experience by breaking it up into individual steps on individual pages: selecting the flight, filling in passenger information, entering payment details, etc. Putting all of that on a single long page would overwhelm some users and increase abandonment.\n   The biggest culprit in cognitive overload is confusing UIs. The user should never have to spend long figuring out how to complete the action they want, nor waste brain power deciphering an icon.\n  Not all users are tech-savvy enough to comprehend SpeedCrunch’s vague icons. Even if they know enough about computers to recognize the Windows and Mac OS X symbols at the top, those two icons in the bottom-right corner would take even Alan Turing a moment.\n  Don’t reinvent the wheel: Use  visual cues that users already know from other websites. Users rely on common  affordances and signifiers to learn controls, even on websites they’ve never been on before.\n If that’s too stifling, you could give the  familiar pattern a unique spin with your brand’s identity.  Home Depot uses common icons but gives them the brand’s telltale orange.\n  The same applies to microcopy. Buttons with  standard labels like “Contact” and “Submit” are more recognizable than unconventional labels like “Address” or “Go.” Commonly known labels facilitate the user’s browsing experience, while uncommon ones make the user pause to wonder what the button does. Don’t sacrifice clarity for individuality.\n On the other hand, what if you have a feature never seen before? In that case,  make it self-explanatory by using a real-life representation. Skeuomorphism, as it’s called,  bridges the gap between  reality and the  digital equivalent. For example, early Internet pioneers chose an envelope to represent email because envelopes are an obvious emblem of the mail system.\n Also,  avoid vague symbols, especially if they could be mistaken for something else or are otherwise confusing. Below, some of  Issuu’s icons are familiar, but others are not. If the user has to click an icon to discover its function, they will be knocked off course.\n  Run your designs through a  fresh set of eyes to make sure you’re not missing anything obvious.\n Check out Denis Kortunov’s list of  10 common icon mistakes for details on what not to do — for example, icons being too similar to each other or being too complex individually.\n Any interface that isn’t completely obvious should include   onboarding to instruct the user on how the UI works. Simple websites can get away with just a single window, especially if a memorable graphic explains the function. New and unique interfaces, though, require a more hands-on tutorial. For instance,  Slack gives a complete video tour, with narration explaining what’s going on.\n   Even if the user has everything they need, they still might not be able to find it. That’s no better than if the feature were broken. The bottom line is that the user is wasting brainpower trying to figure out what to do.\n As an irreplaceable component of every user experience, navigation should be easy and stress-free. Website navigation should feel intuitive and should give the user confidence to roam freely without worrying about getting lost. Not only does this require extra work in the IA, but careful application is required to make it appear more simple than it actually is.\n  If you think hamburger icons are bad, Mojo Yogurt requires you to hover over the logo in the upper-left corner to reveal the navigation menu.\n  To its credit, a small animation reading “Navigation” orbits the logo. But with all of the color and movement on the screen, that one vague cue is not enough.\n  Straighten out your IA according to the preferences of your users. Your target user group might not think the way you do, so learn from them how to organize the website. A  card-sorting test reveals how your users would categorize certain pages and topics. A  tree test evaluates how well your current or proposed structure is understood by real users.\n  For a crash course in IA, read Dan Brown’s “ Eight Principles of Information Architecture” (PDF). In just five pages, his overview explains the eight hard-and-fast rules every designer should know about IA, such as the principle of multiple classification (i.e. using a few different methods of categorization to accommodate users’ different modes of thinking) and the principle of disclosure (i.e. showing only enough information so that users know what to expect).\n You’ll also want to  get rid of redundancies by combining pages or menu items. For example, you don’t need one page for executive bios and another for individual team members — they can go on the same page\n......", "posttime": "2020-11-09 02:44:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "用户体验,认知,过载,cognitive", "title": "减少认知过载以获得更好的用户体验-每个人都应该阅读", "title_en": "Reducing Cognitive Overload for a Better User Experience – Everyone Should Read", "transed": 1, "url": "https://www.smashingmagazine.com/2016/09/reducing-cognitive-overload-for-a-better-user-experience/", "via": "", "real_tags": ["用户体验", "认知", "过载", "cognitive"]}, {"category": "", "categoryclass": "", "imagename": "52611f4495398127bbeb7f5795d9169b.png", "infoid": 1033905, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用于制作无人机表演的软件，由带有COEX三叶草套装的Raspberry Pi控制的无人机和带有PX4固件的飞行控制器。\n在搅拌机中创建动画，将其转换为无人机路径，设置无人机，并运行您自己的节目！\n服务器端，用于使无人机节目具有调谐无人机、动画和音乐的能力", "note_en": "Software for making the drone show with drones controlled by  Raspberry Pi with COEX  Clover package and flight controller with  PX4 firmware.\n Create animation in  Blender, convert it to drone paths, set up the drones and run your own show!\n      Server side for making the drone show with ability of tuning drones, animation and music", "posttime": "2020-11-09 02:44:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,clear,show,无人机", "title": "Clear-Show是一个软件套件，可以在一个网络上操作多个四轴飞行器", "title_en": "Clever-show is a software suite to operate multiple quadcopters over a network", "transed": 1, "url": "https://github.com/CopterExpress/clever-show/", "via": "", "real_tags": ["软件", "clear", "show", "无人机"]}, {"category": "", "categoryclass": "", "imagename": "13b72f86a3bff2bd75cfec435115c1b5.png", "infoid": 1033904, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它是由莱顿大学的研究人员制作的，他们一直在打印一系列微型游泳者，这些微型游泳者是非常小的物体，可以在液体中移动。\n这些微型游泳者通过化学反应通过液体。每个物体上的铂涂层都会与过氧化氢溶液发生反应，由此产生的力会推动它们穿过物质。\n一些游泳者可以由外部磁场推动，但在许多需要粒子自主的应用中，这是不现实的。\n通常，研究人员所做的研究都是使用球形物体，但通过对更奇怪的设计进行实验，可以发现在液体中移动的不同方式。\n研究人员在一篇论文中指出：“一项这样的研究表明，L型粒子呈现圆形轨迹。”他们还“发现了非圆柱形螺旋等意想不到的运动模式”。\n美国航行者号航行者号模型并不是研究人员打印的唯一小物体。除了螺旋和棒棒糖设计，3D Benchy也是3D打印机的标准测试对象，它是一艘30微米长的船(大约是人类头发厚度的三分之一)。\n研究人员丹妮拉·克拉夫特告诉Gizmodo：“3D Benchy是一种用来测试宏观3D打印机的结构，因为它有几个具有挑战性的功能，在微米尺度上尝试也是很自然的。”\n作为这项研究的结果，科学家们或许能够更好地了解生物微泳者。这些物质包括精子、细菌和白细胞。\n科学家们说：“回答对称性和形状如何与运动和运动模式相结合，对于理解合成和生物活动系统，无论是单独的还是集体的，都有重要的价值。”\n最终，它将允许对合成微泳者的行为进行更好的控制和设计，这对治疗诊断和药物输送方面的应用非常有用。“。\n3D打印还被应用于其他领域，包括英国国家医疗服务体系的假肢、雕塑和建筑。\n2017年，科学家们还开发出含有细菌的墨水，可以用来制造“活材料”，可以帮助器官移植，甚至可以通过调整3D打印机使用的液体来解决污染问题。\n了解更多独立高级评论可由我们会员计划的成员发布，独立高级。它允许我们参与度最高的读者辩论重大问题，分享他们自己的经验，讨论现实世界的解决方案，等等。我们的记者将尝试回应，在他们可能的情况下加入这些帖子，以创造一次真正的独立溢价会议。关于所有主题的最有洞察力的评论将每天发表在专门的文章中。您也可以选择在有人回复您的评论时通过电子邮件发送。\n对于那些没有订阅独立高级的人，现有的开放评论线程将继续存在。由于这个评论社区的巨大规模，我们不能对每个帖子给予同等程度的关注，但出于公开辩论的利益，我们保留了这一区域。请继续尊重所有评论者，并进行建设性的辩论。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n目前还没有独立的高级评论-请第一个添加您的想法。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n想要将您最喜欢的文章和故事加入书签以便以后阅读或参考吗？立即开始您的独立高级订阅。", "note_en": "It was made by  researchers at Leiden University who have been printing a range of microswimmers, which are very small objects which can move through  liquids.\n   The way that these microswimmers pass through liquid is via chemical reactions. The platinum coating on each of the objects react to a hydrogen peroxide solution and the resulting force propels them through the substance.\n  Some swimmers can be propelled by an external magnetic field, however this is not practical in many applications which require the particles to be autonomous themselves.\n  Usually, studies like those conducted by the researchers use spherical objects, but by experimenting with stranger designs different ways to move through liquid can be found.\n  “One such study showed that L-shaped particles exhibit circular trajectories”, the researchers  state in a paper. They also “found unexpected motion patterns such as non-cylindrical helices”.\n The model USS Voyager is not the only small object the researchers have printed. Along with helixes and lollipop-designs, 3D Benchy, a 30 micrometer-long boat (about a third of the thickness of a human hair) that is a standard test object for 3D printers,  was also made.\n  “3D Benchy is a structure that has been designed to test macroscopic 3D printers because it has several challenging features, and it was natural to also try it at the micrometer scale” researcher Daniela Kraft told  Gizmodo.\n   As a result of the research, scientists may be able to better understand biological microswimmers. These include sperm, bacteria, and white blood cells.\n “Answering how symmetry and shape couple to motility and motion patterns, is of significant value in understanding synthetic and biological active systems alike, individually and collectively”, the scientists say.\n  “Ultimately, it will allow a greater control and design of the behaviour of synthetic microswimmers, useful for applications in therapeutic diagnostics and drug delivery.”\n 3D printing has been used in other applications,  including NHS prosthetics ,  sculptures,  and architecture.\n  In 2017, scientists also  developed ink containing bacteria that could be used to create “living materials” that could help organ transplants and even tackle pollution by adjusting the same liquids used by 3D printers.\n        Learn more  Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment.\n The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates.\n    You may not agree with our views, or other users’, but please respond to them respectfully\n Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n There are no Independent Premium comments yet - be the first to add your thoughts\n You may not agree with our views, or other users’, but please respond to them respectfully\n Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n  Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.", "posttime": "2020-11-09 02:43:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,打印,自动,microscopic,评论", "title": "科学家3D打印自动移动的微型星际飞船", "title_en": "Scientists 3D print microscopic starship that moves on its own", "transed": 1, "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/star-trek-uss-voyager-3d-print-b1588066.html", "via": "", "real_tags": ["科学家", "打印", "自动", "评论"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033903, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个游戏的目的很简单。试着猜测散点图中的两个变量有多相关。你的猜测越接近真实的相关性，就越好。\n您的猜测应该介于0和1之间，其中0表示无相关性，1表示完全相关性。游戏中没有使用负相关性。以下是一些例子：\n我猜这种关联是一场有目的的游戏。这意味着，虽然它的目的是娱乐性的，但关于猜测的数据被收集起来，并用于分析我们如何感知散点图中的相关性。所以玩的人越多，产生的数据就越多！\n在真实相关性的0.05范围内猜测：+1生命和+5硬币在真实相关性的0.10范围内猜测：+1硬币在&gt；0.10的真实相关性范围内猜测：-1生命如果你连续猜得很好，你还将获得奖金硬币！\n我是剑桥大学(University Of Cambridge)和欧洲生物信息学研究所(European BioInformation Institute)生物信息学专业的博士生。这个游戏是为了满足我日常的好奇心而设计的一个副产品。我总是感谢大家的建议，并乐于回答有关这款游戏或这些数据将如何使用的问题。所以，发推特到@omarwagih或者发邮件给我吧。\n对结果数据的分析依赖于真实的人类猜测。请不要不厌其烦地反复系统地猜测正确的相关性(例如，使用机器人)。它通过向记分板发送垃圾邮件来剥夺其他用户的乐趣。从数据中找出这样做的用户，并从记分牌上清除他们的名字也很容易。这就是说，如果你发现错误或者什么东西不能像预期的那样工作，请给我发电子邮件，这样我就可以解决这个问题了。\n当您进行关联猜测时，以下信息将自动远程存储：当前日期和时间、IP地址和关联数据。这些数据纯粹是出于统计目的而以匿名形式进行评估的。如果你不同意提供这样的信息或提供数据，请不要玩。有关如何使用这些数据的更多信息，请随时给我发电子邮件", "note_en": "the aim of the game is simple. try to guess  how correlated the two variables in a scatter plot are. the closer your guess is to the true correlation, the better.\n  your guess should be between zero and one, where zero is no correlation and one is perfect correlation. no negative correlations are used in the game. here are some examples:\n    guess the correlation is a  game with a purpose. this means, while it aims to be entertaining, data on the guesses is collected and used to analyse how we perceive correlations in scatter plots. so the more people that play, the more data is generated!\n    guess within 0.05 of the true correlation: +1 life and +5 coins  guess within 0.10 of the true correlation: +1 coin  guess within &gt;0.10 of the true correlation: -1 life    you will also receive bonus coins if you make good guesses in a row!\n    i&#39;m a phd student studying bioinformatics at the university of cambridge and the european bioinformatics institute. this game is a side project to feed one of my many day-to-day curiosities.  i&#39;m always grateful for suggestions and happy to answer questions about the game or how the data will be used. so tweet me at  @omarwagih or  email me.\n    the analysis of the resulting data relies on true human guesses. please don&#39;t go out of your way to repeatedly and systematically guess the correct correlation (e.g. using bots). it takes away from the enjoyment of other users by spamming the score board. it&#39;s also easy to identify users that are doing this from the data and clear their name from the score board. that being said, if you find a bug or something does not work as expected, please do  email me so i can sort it out.\n  the following information will be automatically stored remotely whenever you make a correlation guess: current date and time, ip address and correlation data. this data is evaluated purely for statistical purposes in an anonymised form. if you do not consent to providing such information, or contributing data please refrain from playing. for more information on how the data will be used, feel free to  email me", "posttime": "2020-11-09 02:43:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "猜猜,guess,猜测", "title": "猜猜其中的关联性", "title_en": "Guess the Correlation", "transed": 1, "url": "http://guessthecorrelation.com/", "via": "", "real_tags": ["猜猜", "guess", "猜测"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033902, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "身份和访问管理(IAM)是云难题的重要组成部分，从安全角度来看，它通常是令人头疼的问题。让我们试着从蓝队的角度给出一些建议。\n如果您是一个刚刚继承了一批Google Cloud Platform(GCP)帐户的安全团队，本指南适合您。\nIAM围绕身份的概念展开：对其应用授权授权的(经过身份验证的)实体。\n让事情变得更有趣的是，还有两个特殊的成员，你会讨厌它们，并且你想确保它们永远不会被使用(除非有正当的商业原因)：", "note_en": "Identity and Access Management (IAM) is an important piece of the cloud puzzle and it’s usually a source of headaches from a security point of view. Let’s try to give some pointers from a blue team perspective.\n If you are a security team that just inherited a bunch of Google Cloud Platform (GCP) accounts, this guide is for you.\n  IAM revolves around the concept of  identity: an (authenticated) entity to which authorization grants are applied.\n    To make things spicier, there are also two special members that you are going to hate and you want to make sure they will  never be used (unless valid business reasons):", "posttime": "2020-11-09 02:43:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,安全,cloud", "title": "面向安全团队的Google Cloud IAM", "title_en": "Google Cloud IAM for Security Teams", "transed": 1, "url": "https://cloudberry.engineering/article/google-cloud-iam-security-guide/", "via": "", "real_tags": ["google", "安全", "cloud"]}]