[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“不可捉摸”一书的作者尼尔·埃亚尔说，分心是把我们从我们计划做的事情上拉出来的行为。分心的对立面不是专注，而是牵引力。任何事情都可以让人分心，就像任何事情都可以成为牵引力一样。如果你在计划做一个大项目时查看电子邮件，你就会分心。相反，如果你打算玩电子游戏，这个游戏不会让你分心。这是牵引力。\n拖延症是指我们全神贯注于分散注意力，而不是去做我们计划做的事情，\n关于我们为什么拖拉，以及为什么这个不受欢迎的习惯如此难以改掉，有很多理论。\n在20世纪30年代，心理学家训练老鼠做某种特定的行为，比如按下杠杆，给它们一点奖励。一旦经过训练，科学家们发现，当老鼠以每3-7次的可变比例时间表获得不可预测的奖励时，它们会更频繁地执行训练过的行为。更值得注意的是，在随机奖励的情况下，这种行为变得很难消除。\n获得奖励会在大脑中释放多巴胺，即使是对奖励的期望也会产生这种效果。\n不仅是老鼠，人类也有随机性的欲望。我们对不可预测性感到兴奋。观看体育比赛--谁会得分/获胜？钓鱼--我能钓到鱼吗？阅读新闻-(过去一个小时)发生了什么？听收音机-他们下一首歌是什么？去酒吧--我会遇到谁？购物--打折吗？\n在这个时代，我们离随机性只有一步之遥。我们中的大多数人无论走到哪里都带着一部智能手机，很大一部分吸引力在于发现“新事物”的兴奋感。对一些人来说，它比糖和海洛因更容易上瘾。\n从事随意性本身并不坏，但当我们利用它来拖延时，它可能很难停止。只需再单击、滚动或制表符。\n我们计划做的许多任务，比如工作、学习和家务，都没有立竿见影的回报。工作和学习的好处是未来的，而查看Instagram或Facebook会立即击中大脑中的奖励系统。我的帖子上有什么赞吗？钟形图标下隐藏着什么故事？\n我和其他许多人用来对抗拖延症的一种流行的技术是时间拳击(Time Boxing)，也就是所谓的“时间拳击”。波莫多罗技术。这项技术规定了25分钟的会议工作，然后是5分钟的休息。有一条严格的规定。在25分钟的工作时间里，你只能完成一项任务，不要打断自己，比如查看电子邮件。没有干扰，只有牵引力。\n在25分钟的工作时间里，我可以集中精力，但我没有休息的制度。\n在我休息的时候，我经常会不假思索地检查网上的“老虎机”。新闻网站和社交媒体。我承认我没有在5分钟的休息时间使用计时器，因为我只有一个计时器。因此，我对5分钟的休息时间不那么严格，这意味着他们可能会超过一点。\n我试过媒体禁食。太严格了。我的鼠脑经常会设法想出一个借口来打破禁食。\n我需要一个更好的休息系统。(对我来说)重点就是获得一点娱乐。我想要满足我对(社交)媒体的渴望，但要以负责任的方式。\n我意识到，相信自己会在此刻做出理性的决定是不明智的。\n丹·艾瑞里(Dan Ariely)在研究行为经济学和非理性时发现，大多数人认为自己是未来更好的版本。“我们都认为，在未来，我们是很棒的人。我们会有耐心，我们不会拖延，我们会锻炼，我们会吃得好……。问题是我们永远不会生活在那样的未来。我们总是活在当下。“\n他建议克服当前非理性的一个诀窍是提前做决定。例如，善待你未来的自己的一种方法是在月初为退休设立自动储蓄，而不是等到月底资金紧张的时候。否则，你的“现在的自己”将赢得你的“未来的自己”。\n因此，回到工作期间有效休息的问题上来。我想要一些娱乐，但不要被拖入互联网的兔子洞太深。我本可以制定一个有很多规则的严格计划，但我对自己有足够的了解，知道我会找借口打破这些规则。\n人类的大脑在某些方面与老鼠没有太大的不同。我们也渴望多巴胺的刺激。我在想，我怎样才能利用随机性的欲望来造福于我呢？\n第一个原型：我拿了一个大玻璃瓶，里面装满了纸片。在每个批次上，我都写了一件事，我会在休息时通过做一些事情来奖励自己。facebook，linkedin，twitter，youtube，俯卧撑，本地新闻，国家新闻，技术新闻，关闭浏览器标签，头脑风暴，…。还有更多。有些拍品我复印得比较多，因为我想每天复印好几次。例如，我想每天登陆Facebook多达4次，所以我用Facebook赚了4次。\n使用“随机性机器”很简单。在完成了25分钟的工作后，是时候转移注意力了。我从办公桌上站起来，走到罐子前，随机挑选了一批。闭上眼睛-不能作弊。\n第一印象：它工作得很好(否则我就不会费心写这篇文章了)。现在我的休息时间更有条理了。一个有意义的奖励，而不是我的旧习惯，一把空洞的奖励是出于无聊而挑选出来的。每次休息只有一个奖励的稀缺让我更欣赏它，更重要的是，画很多画的随意性带来了很多兴奋(双关语)。\n升级原型：几天后，我升级了原型。我意识到我白天不需要这么多奖励。所以我又增加了一条规则。一天的前半部分，我致力于深入工作，在那里我做了8个时隙的编程。我制定的新规则是，在此期间，我不会使用随机性罐子，而是在完成每个会话后掷骰子。骰子的每一面都指定了一个活动或奖励：1个伸展运动，2个瑜伽姿势，3个泡沫辊，4个思考，5个Facebook，6个从罐子里挑。我应该经常做的事情(伸展、翻滚泡沫)和消遣之间的混合。在前8个时隙完成之后，我跳过骰子，在这一天剩下的时间里直接去随机罐子里的好东西。\n有了原型的第二个版本，我仍然可以在一天中获得随机性，但它不会那么让人分心。\n如果有一种奖励我想比每天少一些，我会把它放在罐子下面几天，然后再放回罐子里。\n我的罐子里有大约两倍于我平时经历的数量，所以不能保证我每天都能拿到每一份奖励。这很好。推特可以等一等。\n画了很多之后，我没有把它放回去，但我有一些复制品或三件复制品。如果我连续两次画同样的画，我允许自己跳过它，重新画一张，不要用它来安排涉及其他人的社交消遣。\n我的休息时间更好，更有成就感，我回来工作的速度也更快。我认为白天的拖延症比较少。\n有了随机性机器，我的兴奋变得更大了。我更感谢你转移注意力。现在，它实际上感觉像是一种应得的奖励，对于我画的是哪一幅画，有一种悬念的感觉。\n减少决策疲劳。众所周知，史蒂夫·乔布斯(Steve Jobs)每天总是穿着同样的衣服，以避免不得不为穿什么而做文章。关于如何转移注意力的琐碎决定最好留给系统(JAR)。近乎无限的选择可能会让人疲惫不堪。从大局来看，我从事哪种消遣其实并不重要，所以最好还是听天由命，而不是用精力来做决定。有了随机性机器，它就像一个友好的管家，为我做决定。我的日子就像坐过山车一样。方向已经确定，但刺激取决于我的体验。\n当我画了很多不是我现在希望的东西的时候，我会感到有点失望。但后来我提醒自己，这是我以前的自己在创建Lot时希望我做的事情。所以我决定好好享受一下。\n我不知道随机性罐子是否是管理休息和消遣的最佳方式，但几周后，我认为它比没有系统或过于僵化的系统要好，所以我计划继续使用一段时间。", "note_en": "Nir Eyal, the author of “Indesctractible” says that distractions are actions that pull us away from what we plan to do. The opposite of distraction is not focus, it is traction. Anything can be a distraction, just as anything can be traction. If you check your email when you plan to work on a big project, you’re distracted. Conversely, if you plan to play video games, the game is not a distraction. It is traction.\n  Procrastination is when we give into a distraction instead of doing what we plan to do,\n There are many theories on why we procrastinate, and why this unwanted habit is so hard to break.\n In the 1930s psychologists trained rats to do a certain behavior, e.g. pressing a lever, by giving them small rewards. Once trained, the scientists discovered that when the rats were given rewards unpredictably, on a variable ratio schedule of every 3 - 7 times, they would perform the trained behavior more often. More remarkably, with randomized rewards, the behavior became hard to extinguish.\n Getting rewards releases dopamine in the brain, and even the expectation of a reward has this effect.\n Not only rats, but also humans have a desire for randomness. We get excited by unpredictability. Watching sports - who will score/win? Fishing - will I get a catch? Reading news - what has happened (in the last hour)? Listening to radio - what song will they play next? Going to a bar - who will I meet? Shopping - is there a bargain on the sale?\n In this age we are just a mouse click away from randomness. Most of us carry a smartphone everywhere we go, and a big part of the appeal is the excitement finding out what is “new”. For some it is more addictive than sugar and heroin.\n Engaging in randomness itself is not bad, but when we use it to procrastinate it can be hard to stop. Just one more click, scroll, or tab.\n Many of the tasks that we plan to do, like work, studying and chores, don’t have immediate rewards. The benefits of work and studying are in the future, whereas checking Instagram or Facebook hits the reward systems in the brain immediately. Did I get any likes on my post? What stories hide under the bell-icon?\n One popular technique that I and many others use for fighting procrastination is timeboxing a.k.a. The pomodoro Technique. The technique prescribes a 25-minute session work followed by a 5-minute break. There is a strict rule. During the 25-minute work session you must only do one task and do not interrupt yourself e.g. by checking email. No distractions - only traction.\n I am able to be focused during the 25-minute work sessions, but I didn’t have a system for the breaks.\n During my breaks I would often engage in mindless checking the online “slot-machines”. News sites and social media. I admit that I didn&#39;t use a timer for the 5-minute breaks because I have only one timer. As a result I was not so strict about the 5-minutes of the breaks, meaning they could run over a bit.\n I’ve tried media fasting. It was too strict. My rat-brain would too often manage to come up with an excuse for breaking the fasting.\n I needed a better system for the breaks. The whole point (for me) is to get a little diversion. I want to satisfy my urges for (social) media, but in a responsible way.\n I realize that it is not smart to trust myself to take a rational decision in the moment.\n Dan Ariely has found, when researching behavioral economics and irrationality, that most people think of themselves as better versions in the future. “We all think that in the future, we are wonderful people. We will be patient, we will not procrastinate, we will exercise, we will eat well... The problem is we never get to live in that future. We always live in the present.”\n One trick he recommends to overcome present irrationality is to make upfront decisions. For example a way to be nice to your future self is to set up automatic savings for retirement at the beginning of the month rather than waiting until the end of the month when money is tight. Otherwise your “present self” will win over your “future self”.\n So back to the problem of having effective breaks during work. I want some diversion, but not be drawn too deep into a rabbithole of internet. I could have made a strict plan with many rules, but I know myself well enough to know that I would have found excuses to break them.\n Human brains in some ways are not too different from rats. We also crave a dopamine rush. I thought about how I could use the desire for randomness to my benefit?\n   The first prototype: I took a big glass jar and filled it with paper-lots. On each lot I wrote a thing I would reward myself by doing during a break. Facebook, linkedIn, twitter, youtube, pushups, local news, national news, tech news, close browser tabs, brainstorm, … and a handful more. Some of the lots I made more copies of because I’d like to do it several times per day. For example I want to drop into facebook up to 4 times per day, so I made 4 lots with Facebook.\n It is simple to use the “randomness machine”. After completing a 25-minute session of work it is time for a diversion. I get up from my desk and go to the jar to pick one lot at random. Eyes closed - no cheating.\n  First Impressions: It works well (otherwise I wouldn’t have bothered to write this post). Now my breaks are more structured. One meaningful reward, instead of my old habit of a handful of empty rewards selected out of boredom. The scarcity of only one reward per break made me appreciate it more, and more importantly the randomness of drawing a lot created a lot of excitement (pun intended).\n Upgraded the prototype: A few days later I upgraded the prototype. I realized that I don’t need so many rewards during the day. So I added another rule. The first part of the day I dedicate to deep work where I do 8 time-slots of programming. The new rule I made was that during this period I will not use the randomness jar, instead I throw a dice after completing each session. Each side of the dice has assigned an activity or a reward: 1 stretching, 2 yoga-poses, 3  foam roller, 4 thinking, 5 facebook, 6 pick from the jar. A mix between something I should do more often (stretching, foam-rolling) and diversions. After the first 8 time slots are completed, I skip the dice and go right to the goodies in the randomness jar for the rest of the day.\n With the second version of the prototype I still get randomness throughout the day, but it is less distracting.\n  If there is a reward I want to engage in less frequent than daily, I keep the lot under the jar for a few days before putting it back in.\n I have about twice as many lots in the jar as I normally go through so there is no guarantee that I will get to every reward every single day. Which is fine. Twitter can wait.\n After drawing a lot I don’t put it back in, but I have some duplicate or triplicate lots. If I draw the same two times in a row, I allow myself to skip it and draw a new lot.Don’t use it for scheduled social diversions that involve other people.\n  My breaks are better and more fulfilling, and I return to work quicker. I think there is less total procrastination during the day.\n With the randomness machine my excitement gets bigger. I appreciate the diversion much more. Now it actually feels like an earned reward and there is a sense of suspense about which lot I draw.\n Less decision fatigue. Steve Jobs famously always wore the same outfit every day to avoid having to make about what to wear. Trivial decisions on what diversion to engage in is better left to a system (the jar). Near infinite choice can be fatiguing. In the grand scheme of things it doesn&#39;t really matter which diversion I engage in, so better leave it up to chance instead of using energy to make a decision. With the randomness machine, it is like a friendly butler who makes the decisions for me. My days are on a rollercoaster. The direction is set, but the thrills are up to me to experience.\n When I draw a lot that is not the one I hoped for in the moment, I can feel a bit disappointed. But then I remind myself that this is something my former self wanted me to do when I created the lot. So I decide to enjoy it.\n   I don’t know if a randomness jar is the best way to manage breaks and diversions, but after several weeks I think it is superior to having no system or a too rigid system, so I plan to keep using it for a while.", "posttime": "2020-05-10 23:37:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器,machine,奖励", "title": "随机性机器能帮助你对抗拖延症吗？", "title_en": "Could a randomness machine help you fight procrastination?", "transed": 1, "url": "https://excelerity.com/blog/arne/randomness-jar", "via": "", "real_tags": ["机器", "machine", "奖励"]}, {"category": "", "categoryclass": "", "imagename": "4d9be6170332622cc75b40c2cdeb75ea.jpg", "infoid": 1001529, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学我们最好的选择可能是发送一大群纳米宇宙飞船--由强大的激光从地球上推进--去看一看。\n几个世纪以来，天文学家一直推测太阳系中含有太阳发现的行星，这些行星在遥远的、黑暗的太阳区域内运行。他们不时地发现未知物体的引力效应，迫使他们寻找罪魁祸首。海王星和冥王星都是这样曝光的。\n现在，天文学家手上也有一个类似的谜题。一段时间以来，他们一直在收集证据，证明一定有一颗大质量的行星在大约500个天文单位(700亿公里)的距离绕太阳运行。\n证据来自海王星以外柯伊伯带中冰体的轨道。这些物体似乎以某种方式聚集在一起，只有当它们被某个大质量物体“聚集”时才能解释。\n这个天体--它被称为“九号行星”--一定是地球质量的5到10倍，但由于距离太远，尽管进行了无数次的搜索，但从地球上很难看到它。\n但是，九号行星可能很难被看到还有另一个原因：因为它根本不是一颗行星。相反，天文学家说，一种可能性是，它可能是一个原始黑洞，大爆炸遗留下来的，但被太阳捕获了。\n虽然这个黑洞的质量是地球的5到10倍，但它的直径却很小--大约5厘米。因此，用望远镜观测几乎是不可能的。通过与暗物质的相互作用可以观察到这样一个黑洞的可能性很小，但这并不能保证。所以天文学家们正在绞尽脑汁想出另一种找到它的方法。\n今天，他们有了答案，这要归功于新泽西州普林斯顿高等研究院的物理学家埃德·维滕(Ed Witten)的工作。Witten的想法是寻找这个黑洞必须对附近经过的任何物体施加的引力。因此，他建议向其方向派遣一支纳米太空飞船舰队，然后寻找任何偏离预期轨迹的意想不到的偏差。\n他说：“如果对柯伊伯带的进一步研究加强了九号行星存在的理由，但通过望远镜搜索或暗物质湮灭信号的发现不会随之而来，那么一支微型航天器舰队的直接搜索可能会变得令人信服。”\n威腾并不是第一个想象纳米空间技术潜力的人。不同的科学家和远见卓识的人研究了使用强大的地面激光束来推动微小的芯片航天器走向恒星的想法。\n最大的好处是，这样的航天器不需要携带自己的燃料，而是坐在地球上产生的激光束的尖端。这种激光束可以在很长一段时间内持续加速它们，使它们达到可能是光速的1%或2%的巨大速度。\nWitten说：“为了搜索行星9，人们希望航天器的速度(至少)为每秒数百公里。”他补充说，这样的速度将允许航天器在10年的时间尺度上旅行500AU。\n更重要的是，有可能向行星9发射数百个，甚至可能是数千个纳米空间飞行器。这一点很重要，因为Witten估计，这样的宇宙飞船需要来到距离黑洞几十AU的范围内，才能观察到其轨迹的任何变化。因为天文学家还不知道九号行星可能在哪里，所以唯一的选择就是这种散射枪方法。\n这样的任务将是一个巨大的挑战。Witten指出了之前和正在进行的开发和推出纳米空间技术的项目。最著名的是“突破星空”，这是一项1亿美元的计划，旨在开发和测试能够将激光推进的纳米空间技术发送到附近恒星系统的技术。该项目的目标是“在一代人的时间内为半人马座阿尔法星的飞越任务奠定基础。”\n前往太阳系外缘的任务可能是一个有用的技术演示。英国火箭科学家凯文·帕金(Kevin Parkin)的计算表明，这种任务的成本将与美国国家航空航天局(NASA)多次执行的10亿美元任务的成本相当。\n然而，这种任务的几乎每一个部分都将是一个挑战，从开发能够提供推进力的激光器到设计能够将位置数据转发回地球的芯片。这将要求航天器在以克为单位的有效载荷内携带一个高精度的机载时钟。“在微型宇宙飞船上进行足够精确的计时可能是这个项目的最大障碍，”Witten说。\n但肯定有尝试的动力。对于任何承担这项任务的人来说，发现一个围绕太阳运行的黑洞都将是一份丰厚的奖品。事实上，这可能是发现围绕我们的恒星运行的重要新天体的最后机会。", "note_en": "The Sciences  Our best bet could be to send a swarm of nanospacecraft — propelled from Earth by a powerful laser — to take a look.\n For centuries, astronomers have speculated that the solar system containsundiscovered planets that orbit in the distant, dark reaches of the sun’srealm. From time to time, they have spotted the gravitational effects ofunknown bodies, forcing them to look for the culprit. Both Neptune and Pluto came to light in this way.\n  Now, astronomers have a similar puzzle on their hands. For some time, they have been gathering evidence that a massive planet must be orbiting the sun at a distance of around 500 astronomical units, or 70 billion kilometers.\n The evidence comes from the orbits of icy bodies in the Kuiper Belt beyond Neptune. These objects seem to cluster together in ways that can only be explained if they were being “herded” by some massive object.\n This object — Planet Nine, as it is dubbed — must be between five and 10 times the mass of Earth, but so far away that it is hard to see from Earth, despite numerous ongoing searches.\n But there is another reason why Planet Nine might be hard to see: because it is not a planet at all. Instead, astronomers say one possibility is that it might be a primordial black hole, left over from the Big Bang but captured by the sun.\n Although between five and 10 times more massive than Earth, this black hole would by tiny — about 5 centimeters across. Consequently, it is almost impossible to spot with a telescope. There is a small possibility that such a black hole might be observable through its interaction with dark matter, but that is by no means guaranteed. So astronomers are scratching their heads to come up with another way of finding it.\n Today, they have an answer, thanks to the work of Ed Witten, a physicist at the Institute for Advanced Study in Princeton, New Jersey. Witten’s idea is to look for the gravitational forces this black hole must exert on anything that passes nearby. So he proposes sending a fleet of nanospacecraft in its direction and then looking for any unexpected deviations from the expected trajectory.\n “If further study of the Kuiper Belt strengthens the case for existence of Planet Nine, but discovery via telescopic searches or a dark matter annihilation signal does not follow, then a direct search by a fleet of miniature spacecraft may become compelling,” he says.\n Witten is not the first to imagine the potential of nanospacecraft. Various scientists and visionaries have studied the idea of using powerful ground-based laser beams to propel tiny chip-based spacecraft toward the stars.\n  The big advantage is that such spacecraft needn’t carry their own fuel, but would instead sit on the tip of laser beam generated on Earth. This laser beam could accelerate them continuously for long periods of time, allowing them to reach huge velocities of perhaps 1 or 2 percent the speed of light.\n “To search for Planet Nine, one would like spacecraft velocities of (at least) hundreds of kilometers per second,” says Witten, adding that such speeds would allow a spacecraft to travel 500 AU on a 10-year timescale.\n What’s more, it is possible to launch nanospacecraft by their hundreds, possiblythousands, toward Planet Nine. That’s important, because Witten estimates that such a spacecraft would need to come within a few dozen AU of a black hole for any changes in its trajectory to be observable. And because astronomers don’t yet know exactly where Planet Nine might be, the only option is this scattergun approach.\n Such a mission would be a significant challenge. Witten points to previous and ongoing projects to develop and launch nanospacecraft. The best known is  Breakthrough Starshot, a $100 million initiative to develop and test the technology capable of sending laser-propelled nanospacecraft to nearby star systems. The project’s goal is to “lay the foundations for a flyby mission to Alpha Centauri within a generation.”\n A mission to the outer edges of the solar system might be a useful technology demonstrator.  Calculations by the British rocket scientist Kevin Parkin suggest that the cost of such a mission would be of the same order as the $1 billion missions that NASA has undertaken many times.\n Nevertheless, almost every part of such a mission would be a challenge, from the development of a laser capable of providing propulsion to the design of a chip capable of relaying position data back to Earth. That will require the spacecraft to carry a high-precision onboard clock within a payload measured in grams. “Sufficiently accurate timekeeping in a miniature spacecraft may be the biggest obstacle to this project,” says Witten.\n But there is certainly motivation to try. The discovery of a black hole orbiting the sun would be quite a prize for whoever undertook such a task. Indeed, it may be the last chance to discover a significant new body orbiting our star.", "posttime": "2020-05-10 23:37:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "找到,tiny,可能", "title": "如果九号行星是一个小黑洞，这就是找到它的方法", "title_en": "If Planet Nine Is a Tiny Black Hole, This Is How to Find It", "transed": 1, "url": "https://www.discovermagazine.com/the-sciences/if-planet-9-is-a-black-hole-this-is-how-to-find-it", "via": "", "real_tags": ["找到", "tiny", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是会议直播！5月10日(星期日)东部时间上午10：30开始。程序。\n托管在GitHub页面上。前情提要：！！CON 2019、2018、2017、2016、2015、2014。这个页面的背景介绍了我们过去的157位演讲者！", "note_en": "This is the conference livestream! It starts on Sunday, May 10 at 10:30am Eastern.  Program.\n  Hosted on  GitHub Pages. Previously: !!Con  2019,  2018,  2017,  2016,  2015,  2014. The background of this page features our  157 past speakers!", "posttime": "2020-05-10 23:36:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,直播,livestream,github", "title": "！！CON 2020直播流[视频]", "title_en": "!!Con 2020 Livestream [video]", "transed": 1, "url": "http://bangbangcon.com/livestream", "via": "", "real_tags": ["2020", "直播", "github"]}, {"category": "", "categoryclass": "", "imagename": "431c94fe128197d9106638967c32eb4c.png", "infoid": 1001526, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Penrose是一个仍在开发中的早期系统。我们的系统还没有准备好供捐款或公众使用，但希望很快就能准备好。如果您对协作感兴趣，请发送电子邮件给我们。\n有关构建、运行、测试和调试系统的更多系统特定信息，请参阅wiki。\nTree.subset ASET BSet CSET DSet ESET FSet GSubset B ASubset C A Subset D B Subset E B Subset F CSubset G CNoInterect E DNoInterect F GNoIntersection B C。\nvenn.sty集合x{Shape=Circle{}约束包含(x，x.label)}相交xy{约束重叠(x，y)约束outside Of(y.label，x)}不相交xy{约束不重叠(x，y)}子集xy{约束包含(y，x)约束较小Than(x，y)约束outside Of(y.Label，x)}NoSubset x{目标排斥(x，x)}不相交xy{约束不重叠(x，y)}子集xy{约束包含(y，x)约束小于(y，x)约束(y.label，x)}NoSubset x{目标排斥(x，y)约束不重叠(x，y)}", "note_en": "Penrose is an early-stage system that is still in development. Our system is not ready for contributions or public use yet, but hopefully will be soon. Send us an email if you&#39;re interested in collaborating.\n See the  wiki for more system-specific information on building, running, testing, and debugging the system.\n     tree.sub Set ASet BSet CSet DSet ESet FSet GSubset B ASubset C A Subset D BSubset E BSubset F CSubset G CNoIntersect E DNoIntersect F GNoIntersect B C\n venn.sty Set x { shape = Circle { } constraint contains(x, x.label)}Intersect x y { constraint overlapping(x, y) constraint outsideOf(y.label, x) constraint outsideOf(x.label, y)}NoIntersect x y { constraint nonOverlapping(x, y)}Subset x y { constraint contains(y, x) constraint smallerThan(x, y) constraint outsideOf(y.label, x)}NoSubset x y { objective repel(x, y) constraint outsideOf(x, y) constraint outsideOf(y.label, x) constraint outsideOf(x.label, y) constraint nonOverlapping(x, y)}", "posttime": "2020-05-10 23:35:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学,create,约束", "title": "Penrose：通过在纯文本中键入数学符号来创建图表", "title_en": "Penrose: Create diagrams by typing mathematical notation in plain text", "transed": 1, "url": "https://github.com/penrose/penrose", "via": "", "real_tags": ["数学", "create", "约束"]}, {"category": "", "categoryclass": "", "imagename": "40090e0a53d6b14f88721bbaa76ed226.jpg", "infoid": 1001525, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft正在为Office 365和Exchange Online推出新的全部回复保护功能。它的设计是为了防止电子邮件风暴(回复所有启示录)，即在某人忘记将所有人都密件抄送或通讯组列表配置错误后，成百上千的人开始回复某个电子邮件线程。\n新的拦截功能将主要受益于大型组织，最初将推出检测10封回复所有电子邮件的功能，所有电子邮件都在60分钟内发送给5000多名收件人。微软的Exchange传输团队解释说：“随着时间的推移，随着我们收集使用情况遥测和客户反馈，我们希望对回复所有风暴防护功能进行调整、微调和增强，使其对更广泛的Office 365客户更有价值。”\n回复-所有的电子邮件风暴都是一个影响大大小小的企业的问题，并且已经发生了几十年。微软早在1997年就发生了一起臭名昭著的事件，员工们亲切地将其称为疯人院DL3。大约有25,000人在通讯组列表上，并不断回复这条帖子，产生了15,000,000封电子邮件和195 GB的数据。这起事件使微软自己的Exchange邮件服务器不堪重负，该公司在Exchange中推出了邮件收件人限制，试图解决未来的问题。\n尽管如此，微软仍在遭受回复所有电子邮件的风暴。去年，GitHub的一份通知引发了数千名微软员工的电子邮件风暴。早在3月份，数以千计的微软员工也收到了回复-所有的电子邮件帖子都在30分钟内被迅速关闭。\n微软新的所有回复电子邮件拦截功能在自动触发后将保留四个小时，足以阻止人们问“为什么我会在这个电子邮件帖子上？”成百上千次。这项新功能似乎适用于微软自己的员工。“不管为哪家公司工作，人类的行为仍然像人类一样，”Exchange团队说。“我们已经看到该功能的第一个版本成功地降低了微软内部的”回复-所有风暴“(Reply-All Storms)的影响。”", "note_en": "Microsoft is rolling out a new reply-all protection feature for Office 365 and Exchange Online. It’s designed to prevent email storms (reply allpocalypse), when hundreds or thousands of people start replying to an email thread after someone forgot to BCC everyone or a distribution list was misconfigured.\n The new block feature will mostly benefit large organizations, and is initially being rolled out to detect 10 reply-all emails to over 5,000 recipients within 60 minutes. “Over time, as we gather usage telemetry and customer feedback, we expect to tweak, fine-tune, and enhance the Reply All Storm Protection feature to make it even more valuable to a broader range of Office 365 customers,”  explains Microsoft’s Exchange transport team.\n   Reply-all email storms are a problem that affect businesses large and small, and have been occurring for decades. Microsoft had its own infamous incident back in 1997, which employees fondly refer to as  Bedlam DL3. Around 25,000 people were on a distribution list and kept replying to the thread, generating 15,000,000 email messages and 195 gigabytes of data. The incident overwhelmed Microsoft’s own Exchange mail servers, and the company rolled out a message recipient limit in Exchange to try and tackle future problems.\n Microsoft still suffers from reply-all email storms, though. Last year a GitHub notification triggered an email storm for thousands of Microsoft employees. Back in March, thousands of Microsoft employees were also caught in a reply-all email thread that was quickly shut down within 30 minutes.\n Microsoft’s new reply-all email block feature will stay in place for four hours after it’s automatically triggered, enough time to stop people from asking “why am I on this email thread?” hundreds of times. The new feature appears to be working for Microsoft’s own employees. “Humans still behave like humans no matter which company they work for,” says the Exchange team. “We’re already seeing the first version of the feature successfully reduce the impact of reply-all storms within Microsoft.”", "posttime": "2020-05-10 23:08:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,阻止,blocks,回复", "title": "微软现在阻止回复所有电子邮件风暴，以结束我们的收件箱噩梦", "title_en": "Microsoft now blocks reply-all email storms to end our inbox nightmares", "transed": 1, "url": "https://www.theverge.com/2020/5/10/21253627/microsoft-reply-all-email-block-reply-allpocalypse-storm", "via": "", "real_tags": ["microsoft", "微软", "阻止", "blocks", "回复"]}, {"category": "", "categoryclass": "", "imagename": "c5e07a95bf2b5c3d117407ec95ab4854.jpg", "infoid": 1001523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "帖子浏览量为1715次。MS飞行模拟器2020 VS现实生活", "note_en": "Post with 1715 views. MS Flight Simulator 2020 vs Real life", "posttime": "2020-05-10 22:37:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞行,flight", "title": "MS飞行模拟器与真实生活", "title_en": "MS Flight Simulator vs. Real Life", "transed": 1, "url": "https://m.imgur.com/a/hdWw4ds", "via": "", "real_tags": ["飞行", "flight"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "POPL过去是从周一到周三中午的事情。科马克·弗拉纳根(Cormac Flanagan)在那里发表了他未来的论文(关于如何消除隐含触摸操作的静态分析；还有臭名昭著的费莱森-瓦德勒(Felleisen-Wadler)论文)。星期三晚上，科马克和我要飞回休斯顿。在返回的航班上，科马克问了一个看似简单的问题：\n我们整个航班都在从不同的角度讨论这个问题。我帮助我儿子的代数老师的经历，以及几年前帮我做代数作业的简陋保姆的经历，把我推向了“代数是函数式编程，我们可以通过让数学活起来，就能产生巨大的不同”的方向。我们到达的时间很晚，当我回家的时候，我发了一封电子邮件，说我们明天早上要开会。\n我们都在科基·卡特赖特的办公室见面，因为它比我的大。我宣布，我想把理论抛在脑后，建立一门课程，一种编程语言，并支持使用函数式编程在K-12学校教授代数、更多的数学和编程。\n施里拉姆当场接受了这个想法。“我一直想参与这样的项目。”布鲁斯很高兴有机会设计一种新的语言。科马克明确表示他会帮忙，但他真的很想辞职。马修很安静。科基后来驳斥了这个想法。“确保当它失败时，你还有回来的路。”\n我们讨论了很长一段时间，得出了两个结论：博士生需要专注于学位论文的软件问题，以防我们失败。布鲁斯和我会专注于语言和课程。\n布鲁斯和我开始设计一种叫做Jam的语言。它被认为是简单的，方案式的，没有括号，因为我们相信老师不会喜欢括号符号。同时，我们确信语法应该基本上是“插入式简单的”。但最重要的是，我们希望在这种语言中有类似图像的部分，以便求和、积分、索引等看起来尽可能像数学教科书。\n同时，我们所有人都在讨论，我们将使用Scheme来构建这个软件生态系统。\n几周后，我发现马修在这个周末开始“拼凑埃德先生”。我肯定他用的不是“鹅卵石”，而是接近的东西。而且可能比这个周末多花了一点时间。我非常确定的是，第一次按键受孕可能发生在那一天(与我对马太福音的理解交叉产生了我的记忆)。\n我不记得不同的会议了。也许这是我第二次提出当前的用户界面-Emacs和命令行-是学生们最大的障碍。\n无论如何，我开始着手建立一个用户友好的环境。当时看来，主要的问题是构建一个可以处理现代实体(如图片和活动对象)的GUI文本编辑器。我选择dwxWindows作为起点，因为它似乎是最有前途的跨平台GUI库，选择libschema作为SchemeImplementation，因为它很容易嵌入。我认为文本编辑器最难的部分是让它运行得足够快，所以我用C++编写了这一部分。\n这个节目被称为“艾德先生”，因为它主要是一名编辑。名字“ed”已经被取走了。在前面加一个字母得到的单词中，无论出于什么原因，只有“red”是有吸引力的，但这个名字也被采用了(作为“受限ed”)。再加一个字母就到了“mred”。我喜欢“先生”这个词，也不介意它已经是会说话的马的名字了。\n尽管编辑器核心是用C++编写的，但我至少从小组那里了解到或有足够的指导，以便在环境的其余实现中致力于Scheme。因此，libschema不仅成为运行学生程序的工具，而且成为实现GUI本身的语言。为了实现这一点，我开始更改libschema：添加支持扩展OFC++类的内置对象系统，将编译添加到AST而不是直接解释S表达式，等等。几个月后，我对实现的这一部分有了足够的关注，可以将其作为单独的部分。我称它为Ms Scheme&34；，但自从Ms&34；似乎把它拼写为&#34；MzScheme&34；时，似乎太过强烈地暗示了&#34；microsoft&#34；的意思，所以我把它命名为&#34；Ms Scheme&34；，但因为它似乎太过强烈地暗示了&#34；Microsoft&#34；。(大约在2001年，我们开始使用伞形名称PLT Scheme，并且不再为子系统使用可爱的名称。PLT计划在2010年成为&#34；球拍。)。\n这就是为什么在gui-lib包中，HISTORY.txt最早的条目是“Version 0.7：1995年5月10日”，而在HISTORY.txt中，球拍集合中最早的条目是“Verion 0.27：1995年9月26日”。编辑排在第一位，语言有点像是事后才想到的。\n当然，语言很快就主导了这个想法-如果不是日常工作的话，几年来的主要工作仍然是让跨平台的GUI和绘图工具包运行良好。鉴于该语言已成为该项目的主线，即使在1995年，也很容易看到本应是一个更好起点的呼应。但是结果还不错。\n到了95年夏天，我已经设计了现在所知的设计收据的基本原理和几天的教材。我们聘请了四名教师和科基的一名博士生，通过为期一周的研讨会来测试这一材料。\n在这一周里，马修演示了一个基于埃德先生的初级IDE。我印象深刻，在四位参与者身上试用了Ed先生，图片简单，应有尽有。虽然没有成功，但我们让前四位无辜的用户试用了我们的第一个教学环境。", "note_en": "POPL used to be a Monday-through-Wednesday-noon affair. Cormac Flanaganpresented his  future paper there (a static analysis on how toeliminate implicit touch operations; there was also the infamousFelleisen-Wadler paper). Wednesday night, Cormac and I were flying backto Houston. On this flight back Cormac asked a seemingly simplequestion:\n  We spent the entire flight discussing this from various angles. Myexperience with helping my son’s algebra teacher and, years earlier, ababy sitter with algebra homework, pushed me in the direction of“algebra is functional programming and we can make a huge differenceby bringing math alive.” We arrived late in the evening, and when I gothome, I sent email that we’d have a meeting next morning.\n  We all met in Corky Cartwright’s office because it was bigger thanmine. I announced that I wanted to leave theory behind and build acurriculum, a programming language, and support software to usefunctional programming for teaching algebra, more math, andprogramming in K-12 schools.\n Shriram embraced the idea on the spot. “I have always wanted to beinvolved in such a project.” Bruce loved the chance to design a newlanguage. Cormac made clear he’d help but he really wanted adissertation. Matthew was quiet. Corky later dismissed the idea. “Makesure you have path back when it fails.”\n We discussed for quite a while and came to two conclusions: the PhDstudents needed to focus on software issues for dissertations in casewe’d fail. Bruce and I would focus on the language and thecurriculum.\n  Bruce and I started designing a language called Jam. It was supposedto be simple, Scheme-ish, and without parentheses because we wereconvinced that teachers would not like the parenthetical notation. Atthe same time, we were sure that the syntax should be  basically“parenthetically simple.” But most importantly, we wanted to haveimage-like parts in this language so that Sum, Integral, Indexing, andso on would look as much as possible like the math text books.\n In parallel, all of us discussed that we’d use Scheme to build thissoftware ecosystem.\n  A few weeks later I found out that over this weekend Matthew hadstarted to “cobbled together MrEd.” I am sure he didn’t use“cobble” but something close. And it probably took a bit more thanthis weekend. What I am pretty sure about is that the first keystrokes of conception probably took place on that day(cross-producting my memory with my understanding of Matthew).\n  I don’t remember the different meetings. Maybe it was the secondmeeting where I suggested the current user interface—  Emacs and thecommand line—  was the biggest obstacle for students.\n In any case, I set out to build a user-friendly environment. The mainproblem, it seemed at the time, was to build a GUI text editor thatcould handle modern entities like pictures and live objects. I pickedwxWindows as a starting point, because it seemed like the mostpromising cross-platform GUI library, and libscheme as the Schemeimplementation, because it was easy to embed. I figuredthat the hard part of a text editor was making it run fast enough, so Iwrote that part in C++.\n The program was called “MrEd” because it was mostly an editor. Thename “ed” was already taken. Among the words you get by adding a letterto the front, only “red” was appealing for whatever reason, but thatname was also taken (as “restricted ed”). Adding one more letter arrivedat “mred.” I liked the “Mr” part and didn’t mind that it was alreadythe name of a talking horse.\n Although the editor core was in C++, I at least knew enough or hadenough direction from the group to aim for Scheme for the rest of theenvironment’s implementation. So, libscheme became not only the vehiclefor running student programs, but also the language for implementingmuch of the GUI itself. To make that practical, I started changinglibscheme: adding a built-in object system that supports extension ofC++ classes, adding compilation to an AST instead of interpretingS-expressions directly, and so on. After a few months, I becameattached enough to this part of the implementation to break it out as aseparate piece. I called it &#34;Ms. Scheme&#34;, but since &#34;Ms&#34; seemed toolikely to suggest &#34;Microsoft&#34;, spelled it &#34;MzScheme&#34;. (Around 2001, westarted using the umbrella name &#34;PLT Scheme&#34; and moved away fromadopting cute names for subsystems. &#34;PLT Scheme&#34; became &#34;Racket&#34; in2010.)\n That’s why the oldest entry for   HISTORY.txt in the  gui-lib packageis “Version 0.7: May 10, 1995,” while the oldest entry in   HISTORY.txtfor the  racket collection is “Verion 0.27: September 26, 1995.” Theeditor came first, and the language was something of an afterthought.\n Of course, the language quickly came to dominate the idea—  if notthe day-to-day work, which for several years was still mostly aboutgetting cross-platform GUI and drawing toolkit to run well. Given thatthe language became the main line of the project, it’s easy to seechoices that would have been a better starting point, even in 1995. Butit turned out okay.\n  By summer ’95, I had designed the basics of what is now known as the design recipeand a few days worth of teaching material. We recruitedfour teachers and one of Corky’s PhD candidates to test this materialwith a week-long workshop.\n  During the week, Matthew demoed a rudimentary IDE based on MrEd. Iwas suitably impressed and tried MrEd onthe four participants, with simple images and all. It didn’t go toowell, but we had the first four innocent users try out our very firstteaching environment.", "posttime": "2020-05-10 22:22:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "球拍,racket,代数", "title": "球拍有25年的历史了", "title_en": "Racket is 25 years old", "transed": 1, "url": "https://blog.racket-lang.org/2020/05/racket-is-25.html", "via": "", "real_tags": ["球拍", "racket", "代数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IO_INGING是在Linux下进行异步I/O编程的一种强大的新方法。摆脱了上一代I/O子系统的各种限制，IO_ing有着巨大的发展前景。有关Iouring给表带来的更多详细信息，请参阅“What is Iouring？”一章。\n这本IO指南是由Shuveb Hussain创建的，他也是专注于Linux的博客unixism.net的作者。\n本指南的源代码存储库在Github上。如果您想要贡献，请给我发送拉取请求。如果您在文档或附带的源代码示例中发现任何错误，请在GitHub上提出问题。示例程序的存储库是单独维护的。请查看下面的详细信息。\nGithub上提供了本指南中所有示例程序的源代码。如果您在示例中发现错误，请在Github上提出问题。我想让这些例子简单而切中要害。出于这个原因，我可能不会合并添加功能的拉取请求。欢迎拉取修复错误的请求。", "note_en": "io_uring is a powerful new way to do asynchronous I/O programming under Linux. Doing away with various limitations of previous generation I/O subsystems,   io_uring holds immense promise. For more details on what   io_uring brings to the table, please see the chapter   What is io_uring?.\n This   io_uring guide was created by  Shuveb Hussain, who is also the author of the Linux-focused blog,  unixism.net.\n The source code repository for this guide is  here on Github. Please send me pull requests should you want to contribute. If you find any bugs in either the documentation or the included source code examples, please raise an issue on GitHub. The repository for the example programs is maintained separately. Please see details below.\n Source code for all example programs in this guide are available  on Github. If you find bugs in the examples, please raise issues on Github. I want to keep these examples simple and to the point. I many not merge pull requests that add features for that reason. Pull requests that fix bugs are welcome.", "posttime": "2020-05-10 22:07:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教程,示例,io,拉取", "title": "Iouring之王：Io_uring教程、示例和参考资料", "title_en": "Lord of the io_uring: io_uring tutorial, examples and reference", "transed": 1, "url": "https://unixism.net/loti/", "via": "", "real_tags": ["教程", "示例", "io", "拉取"]}, {"category": "", "categoryclass": "", "imagename": "230e25fac0f4de57a8fc6c33479484b4.jpg", "infoid": 1001520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "官方数据显示，在德国，冠状病毒感染人数正在上升，就在几天前，该国放松了封锁限制。\n根据罗伯特·科赫研究所(RKI)的数据，德国的繁殖率-每个确诊患者感染的人数-现在超过1。\n这份报告发布之际，数千名德国人周六聚集在一起，呼吁全面结束封锁。\n德国总理安格拉·默克尔(Angela Merkel)在与德国16个州的领导人会谈后，于周三宣布全面放松国家限制。\n所有的商店都被允许重新开张，学生们将逐渐回到学校，德甲-德国顶级足球联赛-最快将在下周末重新开始。\n但周六全国各地都发生了抗议活动，一些人呼吁更快地取消措施。\n德国的确诊病例数量在世界上排名第七，周日的最新RKI数据显示，报告的感染人数为169,218人，报告的死亡人数为7,395人。\n公共卫生机构周六发布的报告称，繁殖率估计为1.1。\n虽然这一估计涉及一定程度的不确定性，但人数的增加需要在未来几天密切关注形势。\n德国对疫情的反应赢得了赞誉。大规模检测和有效的封锁限制有助于将死亡人数保持在远低于其他欧洲国家的水平。\n但在周三与16个州的首脑交谈后，一些人批评了默克尔放松这些措施的决定。\n财政大臣实施了紧急刹车，要求地方当局在案件超过每10万人50人的门槛时重新实施限制。\n据报道，北莱茵-威斯特伐利亚州和石勒苏益格-荷尔斯坦州肉类加工厂的疫情已经突破了这条线，迫使地区官员采取行动。\n据报道，图林根州的一个地区记录了每10万人中有80多人感染，据信是由于护理设施的爆发。\n这些最新的官方数据似乎表明，德国的冠状病毒感染人数可能再次上升得更快。\n繁殖率已经上升到1.1，这意味着10个人将把病毒传染给另外11个人。为了控制住大流行，这一水平应该低于1。\n不过，这个数字只是一个估计数字。而且它确实每天都有很大的不同。因此，官员们警告不要将其过度解读为短期变化。\n但这一切都发生在德国放松对一些风险最高的行业的限制时，这些行业可能会受到感染-如餐馆、酒店和职业足球。\n因此，政府将密切关注这是否标志着一种趋势。如果病毒传播得更快，可能会重新施加一些限制。\n与此同时，尽管德国的每日死亡人数是一个多月来最低的。截至周日的24小时内，这里死于冠状病毒的人数不到40人。在其他欧洲大国，这一水平有时已升至近1000人。\n虽然一些人担心该国放松限制太快，但德国的其他人正在抗议持续的封锁。\n最近几周，少数人走上街头，但周六，人数增加到数千人，他们聚集在全国各地的城市-包括柏林、法兰克福、慕尼黑和斯图加特。\n周六，柏林警方在国会大厦外逮捕了大约30人，原因是他们不遵守社会距离措施。当局表示，一些示威者向警察投掷瓶子。", "note_en": "Coronavirus infections are rising in Germany, official data shows, just days after the country eased its lockdown restrictions.\n According to the Robert Koch Institute (RKI), Germany&#39;s reproduction rate - the number of people each confirmed patient infects - is now above 1.\n  The report came as thousands of Germans gathered on Saturday calling for a total end to the lockdown.\n Chancellor Angela Merkel announced a broad relaxation of national restrictions on Wednesday after talks with the leaders of Germany&#39;s 16 states.\n  All shops are allowed to reopen, pupils will gradually return to class and the Bundesliga - Germany&#39;s top football league - will restart as soon as next weekend.\n  But there were protests across the country on Saturday, as some called for measures to be lifted even quicker.\n Germany has the seventh-highest number of confirmed cases in the world, with latest RKI data on Sunday showing the reported infected tally at 169,218 and a reported death toll of 7,395.\n  The report from the public health agency released on Saturday said the reproduction rate was estimated at 1.1.\n While this estimate involves &#34;a degree of uncertainty&#34;, the rise in the number requires &#34;a close monitoring of the situation in the coming days&#34;.\n Germany has won praise for its response to the outbreak. Mass testing and effective lockdown restrictions have helped keep the death toll far lower than in other European countries.\n  But some have criticised Mrs Merkel&#39;s decision to relax those measures after speaking with the heads of the 16 states on Wednesday.\n The chancellor imposed an &#34;emergency brake&#34;, requiring local authorities to reimpose restrictions if cases rise above a threshold of 50 per 100,000 people.\n Outbreaks at meat processing plants in the states of North Rhine-Westphalia and Schleswig-Holstein have already reportedly breached that line, and forced district officials to act.\n And one district in the state of Thuringia reportedly recorded more than 80 infections per 100,000 people, thought to be due to outbreaks at care facilities.\n    These latest official figures appear to show that the number of Covid-19 infections in Germany may be rising faster again.\n The reproduction rate has risen to 1.1 - that means that ten people will pass the virus on to 11 more people. To keep the pandemic in check this level should be below one.\n This figure though is an estimate. And it does vary a lot from day to day. So officials warn against interpreting too much into short-term changes.\n But this all comes as Germany is easing restrictions in some of the most risky sectors when it potential infections - such as restaurants, hotels and professional football.\n So the government will be watching closely to see if this does mark a trend. And if the virus is spreading more rapidly, some restrictions could be reimposed.\n At the same though the daily death toll in Germany is the lowest it&#39;s been in more than a month. Fewer than 40 people here died of Covid-19 in the 24 hours until Sunday. In other large European countries this level has at times risen to almost 1,000.\n   While some worry that the country is easing its restrictions too soon, others in Germany are protesting against the continued lockdown.\n Small numbers of people have taken to the streets in recent weeks but on Saturday this swelled to thousands of people who gathered in cities across the country - including Berlin, Frankfurt, Munich and Stuttgart.\n  Officers in Berlin arrested about 30 people outside the Reichstag on Saturday for not obeying social distancing measures. Authorities say some demonstrators threw bottles at the police.", "posttime": "2020-05-10 22:06:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,德国,germany", "title": "冠状病毒：德国感染率上升，封锁放松", "title_en": "Coronavirus: Germany infection rate rises as lockdown eases", "transed": 1, "url": "https://www.bbc.co.uk/news/world-europe-52604676", "via": "", "real_tags": ["病毒", "冠状病毒", "德国", "germany"]}, {"category": "", "categoryclass": "", "imagename": "602663a25452bdd4ecce26f6a64a3991.jpg", "infoid": 1001518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n这场90年来最严重的危机已经过去了10周，政府拯救经济的努力既取得了惊人的成功，也遭遇了灾难性的失败。\n这一点最明显的例证出现在周五，当时政府报告称，4月份有2050万人失去了工作。这标志着全国范围内自大萧条以来从未见过的深不可测的痛苦时期。同样在周五，股市出现反弹。\n标准普尔500指数目前从3月中旬的低点上涨了30%，回到了去年10月的水平，当时2020年的企业收益前景看起来很光明。最近几周，公司为投资级公司出售了创纪录的债券。垃圾债券在经济低迷时期历来是不可靠的，但现在已经咆哮着卷土重来。\n如果你在寻找投资者对谁赢得了救助的判断，那么考虑一下这些回报：私募股权巨头阿波罗集团(Apollo Group)的股价已经从低点飙升了80%。另一家私募股权巨头黑石集团(Blackstone)的股价上涨了50%。\n原因是，像阿波罗和黑石这样的资产持有者-不成比例地是最富有和最有影响力的-已经得到了世界上最强大的中央银行的保险。这种慷慨是无穷无尽的，而且是无条件的。“即使出现第二波疫情，”摩根大通的经济学家周五在一份庆祝报告中写道，“美联储已经明确表示，没有美元限额，也没有弹尽粮绝的危险。”", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  Ten weeks into the worst crisis in 90 years, the government’s effort to save the economy has been both a spectacular success and a catastrophic failure.\n  The clearest illustration of that came on Friday, when the government reported that 20.5 million people lost their jobs in April. It marked a period of unfathomable pain across the country not seen since the Great Depression. Also on Friday, the stock market rallied.\n  The S&amp;P 500 is now up 30% from its lows in mid-March and back to where it was last October, when the outlook for 2020 corporate earnings looked sunshiny. Companies have sold  record amounts of debt  in recent weeks for investment-grade companies. Junk bonds, historically dodgy during an economic swoon, have roared back.\n  If you’re looking for investors’ verdict on who has won the bailout, consider these returns: Shares of Apollo Group, the giant private equity firm, have soared 80% from their lows. The stock of Blackstone, another private equity behemoth, has risen 50%.\n  The reason: Asset holders like Apollo and Blackstone — disproportionately the wealthiest and most influential — have been insured by the world’s most powerful central bank. This largess is boundless and without conditions. “Even if a second wave of outbreaks were to occur,” JPMorgan economists wrote in a celebratory note on Friday, “the Fed has explicitly indicated that there is no dollar limit and no danger of running out of ammunition.”", "posttime": "2020-05-10 22:06:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计划,working", "title": "救助计划正在奏效-为富人服务", "title_en": "The Bailout Is Working – For the Rich", "transed": 1, "url": "https://www.propublica.org/article/the-bailout-is-working-for-the-rich", "via": "", "real_tags": ["计划", "working"]}, {"category": "", "categoryclass": "", "imagename": "a33538f59979fd9c5a532049d9bf437b.png", "infoid": 1001517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雷蒙德在2019年和2020年经历了两次内部事件后，增加了针对大规模回复所有电子邮件风暴的保护措施。\n黑客组织ShinyHunters正在一个黑暗的网络犯罪市场上出售10家公司的数据。\n安全漏洞发生在2019年12月，被美国司法部的JSOC团队发现。\n而健壮的密码则是要确保安全，还有很长的路要走你宝贵的在线账户，基于硬件的双因素身份验证需要把保安送到更上一层楼。..。\n唐纳德·特朗普总统想要保护美国&#39；通过禁止美国建设美国电网公司从购买电气产品中脱颖而出可能来自敌国的装备。那个&#39；It‘说起来容易，说起来难..。", "note_en": "Redmond adds protection against massive &#34;Reply-All&#34; email storms after suffering two internal incidents in 2019 and 2020.\n  Hacker group &#34;ShinyHunters&#34; is selling the data of 10 companies on a dark web cybercrime marketplace.\n  Security breach took place in December 2019 and was discovered by the DOJ&#39;s JSOC team.\n    While\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trobust\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpasswords\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tway\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecuring\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvaluable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tonline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taccounts,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thardware-based\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttwo-factor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tauthentication\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttakes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnext\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlevel.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  President\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDonald\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTrump\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twants\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprotect\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAmerica&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpower-grid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tforbidding\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompanies\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbuying\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\telectrical\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tequipment\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpossible\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tenemy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcountries.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThat&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teasier\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsaid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-05-10 22:05:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户,ocean,美国", "title": "Digital Ocean在将内部文档留在网上后暴露了客户数据", "title_en": "Digital Ocean exposed customer data after it left an internal document online", "transed": 1, "url": "https://www.zdnet.com/article/digital-ocean-says-it-exposed-customer-data-after-it-left-an-internal-doc-online/", "via": "", "real_tags": ["客户", "ocean", "美国"]}, {"category": "", "categoryclass": "", "imagename": "a4ff0f583162f89be98e1d3fc0a490a0.jpg", "infoid": 1001515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，微软向Office365客户推出了一项新功能，帮助他们的IT员工检测并阻止所有电子邮件风暴的回复。\n该术语指的是员工在群发电子邮件(如全公司范围的通知)中使用全部回复选项的情况。\n如果电子邮件链中的收件人数量很多，并且多名员工点击了全部回复按钮，则随后的事件会产生大量流量，通常会降低电子邮件服务器的速度或使其崩溃。\n这类事件几乎每时每刻都在发生，在某个时候，一家公司会因为员工参与并放大回复而导致电子邮件服务器宕机-所有这些风暴都是一场恶作剧。\n微软也已经遭遇了两起这样的事件，第一起发生在2019年1月，第二起发生在2020年3月。微软回复的所有电子邮件风暴包括5.2万多名员工，他们最终导致公司内部通信堵塞达数小时之久。\n去年，在Microsoft Ignite大会上，微软宣布将致力于一项功能，该功能将有助于防止Office365 Exchange电子邮件服务器上的所有回复电子邮件风暴。\n这项功能本周开始向全球所有Office 365用户推出。在目前的形式中，微软表示，“回复所有风暴防护”功能将屏蔽所有收件人超过5000人、回复超过10封的电子邮件--所有邮件序列都是在过去60分钟内完成的。\n一旦触发该功能，Exchange Online将在接下来的四个小时内阻止电子邮件线程中的所有回复，帮助服务器确定实际电子邮件的优先顺序，并关闭所有回复风暴。\n微软表示，未来还将继续开发这一功能，承诺为Exchange管理员添加控件，这样他们就可以设置自己的风暴检测限制。\n其他计划的功能还包括回复所有风暴报告和实时通知，以提醒管理员正在进行的电子邮件风暴，以便他们可以密切关注电子邮件服务器的状态，以确定可能的减速或崩溃。\n由于微软最近遭遇了电子邮件风暴，它自己的网络被证明是这一功能的最佳试验场。\n交易所团队本周表示，无论人类为哪家公司工作，他们的行为方式都与人类相似。我们已经看到该功能的第一个版本成功降低了在Microsoft内部回复所有风暴的影响。\n注册后，即表示您同意使用条款并承认隐私政策中概述的数据做法。\n您还可以免费订阅ZDNet的今日技术更新和ZDNet公告时事通讯。您可以随时取消订阅这些时事通讯。\n您同意接收来自CBS系列公司的更新、提醒和促销信息，包括ZDNet的今日技术更新和ZDNet公告时事通讯。你可以随时退订。\n通过注册，您同意接收您可以随时取消订阅的选定时事通讯。您也同意使用条款，并承认我们的隐私政策中概述的数据收集和使用做法。\n我们似乎进入了一些人喜欢称之为浏览器大战的领域。突然之间，微软开始玩起好戏来了。\n微软提出修复免费的Surface笔记本电脑3个屏幕破裂似乎没有明显的原因。它会报销那些谁已经付钱给将此问题修复为他们的..。\n微软&#39；的私人预览节目用于全息镜头的Windows Autopilot%2现在已打开。我们的目标是：使设备更易于调配并进行规模化管理。..。\n在一周的时间里，微软宣布计划在目前没有数据中心的国家增加三个新的数据中心区域。\n微软基于Windows的双屏Surface Neo目前处于暂停状态，但该公司仍在继续研发基于Android的双屏双屏产品。\n黑客被认为是无害的，因为黑客没有获得任何主要微软应用程序的源代码。\n想要避免让你的网上账户被黑了吗？启用双因素身份验证，一项重要的安全措施那", "note_en": "Microsoft rolled out this week a new feature to Office 365 customers to help their IT staff detect and stop &#34; Reply-All email storms.&#34;\n The term refers to situations when employees use the Reply-All option in mass-mailed emails, such as company-wide notifications.\n If the number of recipients in the email chain is large, and if multiple employees hit the Reply-All button, then the ensuing event generates massive amounts of traffic that usually slows down or crashes email servers.\n Such events happen almost all the time, and, at one point or another, a company is going to have email servers go down because of employees participating and amplifying Reply-All storms as a prank.\n Microsoft, too, has suffered two such incidents already, the first in  January 2019, and a second in  March 2020. The Microsoft Reply-All email storms included more than 52,000 employees, who ended up clogging the company&#39;s internal communications for hours.\n   Last year, at the Microsoft Ignite conference,  Microsoft announced it would work on a feature that would help prevent Reply-All email storms on Office 365 Exchange email servers.\n The feature started rolling out this week to all Office 365 users worldwide. In its current form, Microsoft says the &#34;Reply All Storm Protection&#34; feature will block all email threads with more than 5,000 recipients that have generated more than 10 Reply-All sequences within the last 60 minutes.\n   Once the feature gets triggered, Exchange Online will block all replies in the email thread for the next four hours, helping servers prioritize actual emails and shut down the Reply-All storm.\n Microsoft said it would also continue working on the feature going forward, promising to add controls for Exchange admins so they can set their own storm detection limits.\n Other planned features also include Reply-All storm reports and real-time notifications to alert administrators of an ongoing email storm so that they can keep an eye on the email server&#39;s status for possible slowdowns or crashes.\n And since Microsoft has had its run-ins with email storms recently, its own network proved the best testing ground for the feature.\n &#34;Humans still behave like humans no matter which company they work for,&#34;  the Exchange team said this week. &#34;We&#39;re already seeing the first version of the feature successfully reduce the impact of reply all storms within Microsoft.&#34;\n  By registering, you agree to the  Terms of Use and acknowledge the data practices outlined in the  Privacy Policy.\n  You will also receive a complimentary subscription to the ZDNet&#39;s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe from these newsletters at any time.\n         You agree to receive updates, alerts, and promotions from the CBS family of companies - including ZDNet’s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe at any time.\n      By signing up, you agree to receive the selected newsletter(s) which you may unsubscribe from at any time. You also agree to the  Terms of Use and acknowledge the data collection and usage practices outlined in our  Privacy Policy.\n       It seemed as if we were entering what some enjoy calling browser wars. Suddenly, Microsoft starts to play nice.\n  Microsoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toffering\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trepair\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfree\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSurface\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaptop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t3\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscreens\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcracked\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tseemingly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tno\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tapparent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treason.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAnd\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treimburse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthose\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twho\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\talready\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpaid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfix\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tissue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttheir\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprivate\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpreview\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprogram\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAutopilot\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHoloLens\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t2\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\topen.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgoal:\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmake\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdevices\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teasier\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprovision\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmanage\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscale.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  In the span of a week, Microsoft announced plans to add three new datacenter regions in countries where it doesn&#39;t currently have them.\n  Microsoft&#39;s dual-screen Windows-based Surface Neo is on hold, but the company is continuing to work on the dual-screen Android-based Duo.\n  Hack considered harmless as the hacker did not gain access to the source code of any major Microsoft apps.\n  Want\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tavoid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thaving\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tonline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taccounts\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thacked?\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEnable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttwo-factor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tauthentication,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrucial\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmeasure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trequires\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\textra\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstep\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsigning\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thigh-value\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservices.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  But they are over having meetings, and most of them working for large enterprise aren&#39;t happy with their job.", "posttime": "2020-05-10 21:54:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,阻止,launches,电子邮件", "title": "微软推出Office 365新功能阻止回复-所有电子邮件风暴", "title_en": "Microsoft Launches New Office 365 Features Blocking Reply-All Email Storms", "transed": 1, "url": "https://www.zdnet.com/article/microsoft-adds-protection-against-reply-all-email-storms-in-office-365/", "via": "", "real_tags": ["微软", "microsoft", "阻止", "launches", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "5ca9e5ad76e2d174e82f0c20f4d3a73a.png", "infoid": 1001514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Gearbox⚙️是一个用Go编写的用于构建微服务的Web框架，侧重于高性能和内存优化。它建立在Fasthttp之上，比net/http快10倍。\n在变速箱中，我们关心的是每种方法在构建过程中将使用的性能和内存，以及我们如何改进这一点。它还需要更多的时间来研究将使用的每个组件，并将其与其他开源Web框架的不同实现进行比较。它可能最终会以优化的方式编写我们自己的组件来实现我们的目标。\n打包主要导入(&#34；github.com/abahmed/gearbox&#34；&#34；github.com/valyala/Fasthttp&#34；)func main(){//设置gearbox gearbox：=gearbox。new()//定义处理器变速箱。get(&#34；/hello&34；，func(CTX*Fasthttp.。RequestCtx){CTX.。回应。SetBodyString(&#34；Hello World！&#34；)})//启动服务变速箱。开始(&#34；：3000&#34；)}。\n如果您有任何问题或建议，请随时在Gitter上加入我们，或者给我们发电子邮件至gearbox@googlegroups.com", "note_en": "gearbox  ⚙️ is a web framework for building micro services written in Go with a focus on high performance and memory optimization. It&#39;s built on  fasthttp which is  10x faster than net/http\n In  gearbox, we care about peformance and memory which will be used by each method while building things up and how we can improve that. It also takes more time to  research about each component that will be used and  compare it with different implementations of other open source web frameworks. It may end up writing our  own components in an optimized way to achieve our goals\n        package main import (   &#34;github.com/abahmed/gearbox &#34;   &#34;github.com/valyala/fasthttp &#34;) func  main() {   // Setup gearbox  gearbox  := gearbox. New()   // Define your handlers gearbox. Get(  &#34;/hello &#34;,  func(ctx *fasthttp. RequestCtx) {\tctx. Response. SetBodyString(  &#34;Hello World! &#34;) })   // Start service gearbox. Start(  &#34;:3000 &#34;)}\n         Feel free to Join us on  Gitter, or email us at  gearbox@googlegroups.com if you have questions, or suggestions", "posttime": "2020-05-10 21:53:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "web,gearbox", "title": "Gearbox-一个用Go编写的Web框架", "title_en": "Gearbox  – A web framework written in Go", "transed": 1, "url": "https://github.com/abahmed/gearbox", "via": "", "real_tags": ["web", "gearbox"]}, {"category": "", "categoryclass": "", "imagename": "604e74deec5d7f464c8801e1702b9120.jpg", "infoid": 1001513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这起诉讼旨在寻求对阿拉米达县的禁令和声明救济，CNBC最先报道了这起诉讼。这起诉讼是在加利福尼亚州北区的美国地区法院提起的。\n周六早些时候，特斯拉首席执行官埃隆·马斯克(Elon Musk)在推特上表示，他正在对阿拉米达县提起诉讼，并威胁要立即将其总部和未来的项目迁往德克萨斯州或内华达州。\n特斯拉原本计划周五召回约30%的工厂工人，这是其重新开工计划的一部分，无视阿拉米达县的居家命令。马斯克是基于加州州长加文·纽瑟姆(Gavin Newsom)周四发布的新指导意见重新开业的，该指导意见允许制造商恢复运营。这一指导赢得了马斯克的赞扬，他后来向员工发送了一封内部电子邮件，说明根据州长修改后的命令重新开业的计划。然而，州长的指导包括警告地方政府可以保持更具限制性的规定。阿拉米达县和其他几个湾区县市上周将居家订单延长至5月底。这些命令进行了修订，确实放松了一些限制。然而，它并没有取消制造订单。\n诉讼认为，阻止特斯拉开业，阿拉米达县违背了自己的指导方针。\n阿拉米达县已明确承认并宣传“商家可以。。。起诉书中写道，该公司经营生产“电池和电动汽车”。“然而，令人费解的是，第三订单和县官员同时坚持特斯拉必须继续关闭，从而进一步加剧了围绕阿拉米达县关于特斯拉是否可以恢复其弗里蒙特工厂和该县其他地方制造活动的立场的模棱两可、混乱和不合理的情况。”\n术语“第三命令”指的是阿拉米达县发布的修改后的留置令。\n周五，阿拉米达县卫生局表示，特斯拉尚未获得重新开业的“绿灯”，并表示，如果该公司重新开业，将违反命令。", "note_en": "The lawsuit, which seeks injunctive and declaratory relief against Alameda County, was  first reported by CNBC. The lawsuit was filed in U.S. District Court for California’s Northern District.\n Earlier Saturday,  Tesla   CEO  Elon Musk   tweeted that he was filing a lawsuit against Alameda County and threatened to move its headquarters and future programs to Texas or Nevada immediately.\n Tesla had planned to bring back about 30% of its factory workers Friday as part of its reopening plan, defying Alameda County’s stay-at-home order. Musk was basing the reopening on new guidance issued Thursday by California Gov.  Gavin Newsom   that allows manufacturers to resume operations. The guidance won praise from Musk, who later sent an internal email to employees about plans to reopen based on the governor’s revised order. However, the governor’s guidance included a warning that local governments could keep more restrictive rules in place. Alameda County, along with several other Bay Area counties and cities, last week extended the  stay-at-home orders through the end of May. The orders were revised and did ease some of the restrictions. However, it did not lift the order for manufacturing.\n The lawsuit argues that by preventing Tesla from opening, the Alameda County is going against its own guidance.\n “Alameda County has expressly recognized and publicized that “businesses may . . . operate to manufacture” batteries and electric vehicles,” the complaint reads. “Inexplicably, however, the Third Order as well as County officials have simultaneously insisted that Tesla must remain shuttered, thereby further compounding the ambiguity, confusion and irrationality surrounding Alameda County’s position as to whether Tesla may resume manufacturing activities at its Fremont Factory and elsewhere in the County.”\n The term “third order” is a reference to a revised stay-in-place order issued by Alameda County.\n On Friday, the Alameda County Health Department said  Tesla had not been given “the green light” to reopen and said if the company did, it would be out of compliance with the order.", "posttime": "2020-05-10 21:52:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,迫使,sues,诉讼", "title": "特斯拉起诉阿拉米达县迫使加州工厂重新开工", "title_en": "Tesla sues Alameda County to force California factory reopening", "transed": 1, "url": "https://techcrunch.com/2020/05/09/tesla-sues-alameda-county-to-force-california-factory-reopening/", "via": "", "real_tags": ["特斯拉", "迫使", "sues", "诉讼"]}, {"category": "", "categoryclass": "", "imagename": "4bee66a08f4f4d87c5f8175ec24991eb.jpeg", "infoid": 1001512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据白厅正在考虑的计划，英国人可以被赋予在家工作的合法权利，以确保他们在封锁后不会被迫回到工作场所。\n《每日电讯报》透露，商业、能源和工业战略部门的官员提出了将在家工作的权利写入法律的问题，这是缓解封锁的一系列选择的一部分。\n一位消息人士说，合法权利的想法是官员们在讨论政府重返工作岗位的一揽子计划时提出的。\n这将意味着员工不会感到被迫进入办公室，同时限制了雇主的成本，这些雇主必须让他们的工作场所安全地进行社交距离。\n这一想法-仍处于初级阶段-已经赢得了政府部长们的支持，他们已经起草了鼓励人们重返工作岗位并推动经济增长的计划。其中一人说：这完全说得通。\n这项措施可能会在保守党在12月选举中赢得的所谓红墙席位中受到欢迎。英国首相鲍里斯·约翰逊(Boris Johnson)承诺，在该党2019年的宣言中，他的政府将使灵活工作成为工人的一项默认权利。\n它说：我们将鼓励弹性工作，并就将其设为默认工作进行磋商，除非雇主有充分的理由不这样做。\n2017年，马修·泰勒(Matthew Taylor)在一篇关于现代工作的评论中提出了对在家工作提供更多保护的想法，该评论称：鼓励弹性工作对每个人都有好处，并已被证明对生产率、员工留任和工作质量有积极影响。\n在2018年政府的回应中，部长们表示，作为对2019年要求弹性工作的权利的法定评估的一部分，政府应该考虑如何进一步促进工作场所真正的灵活性。\n一位熟悉这些计划背后想法的消息人士表示，合法的在家工作权利-或承诺在家工作-将确保一旦封锁解除，通勤者试图返回工作岗位时，车站不会排起长队。\n交通部门警告说，两米长的社会距离规定将意味着火车和公交车必须有85%的空载，以确保旅客被分开。\n自由民主党前座议员莱拉·莫兰(Layla Moran)表示，对雇主和工人来说，任何新法律都可能是双赢的。\n她说，通过引入这项法律，政府将让个人更多地控制工作与生活的平衡，从而改善心理健康，提高生产力。它还将有助于解决工作场所准入方面的差距，尤其是那些需要照顾孩子或承担其他照顾责任的人。\n我相信这一改变对雇员和雇主都有好处，而且有可能是双赢的。\n工会秘书长弗朗西斯·O&#39；格雷迪告诉“每日电讯报”：在家工作的权利将是向前迈出的一大步。从事各种工作的人都需要对自己的工作时间和工作地点有更多的控制权。这就是为什么我们呼吁所有员工在第一天就享有弹性工作的权利。\n英国工会联合会上周的一份报告发现，十分之四的员工担心回去工作时无法与同事保持社交距离。\n研究还发现，超过四分之一的人担心无法与客户或客户保持社交距离。三分之一的人担心会让家里的其他人面临更大的风险。\nUnison工会还报告说，其一些成员曾表示，他们很害怕，如果被迫上班，他们可能会把病毒带回家--这可能会带来毁灭性的后果。\n一位来自白厅的消息人士告诉“每日电讯报”：一旦封锁措施放松，我们正在与关键的利益相关者和行业团体以及工会就安全工作进行接触。\n一位政府发言人说：商务大臣继续与企业、工会领袖以及科学和医学界合作，这样我们就可以确保那些一旦措施放松就会重返工作岗位的人的工作场所是安全的，并给人们重返工作的信心。\n如果大臣们推进这些计划，英国将与德国结盟，德国上周公布了在疫情爆发后进一步引入在家工作的合法权利的提议。\n社会民主党劳工部长胡伯特斯·海尔(Hubertus Heil)表示，就业立法将在秋季提交，使德国和芬兰成为世界上仅有的两个将在家工作权利写入法律的国家。\n海尔告诉“星期日图片报”：只要愿意，只要工作允许，每个人都应该能够在家庭办公室工作。在这场流行病中，我们正在学习在家可以做多少工作。\n每日电讯报重视您的评论，但恳请所有帖子都是主题、建设性和尊重的。请检查我们的评论政策。", "note_en": "Britons could be given a legal right to work from home to ensure that they are not forced to go back to workplaces  after the lockdown under plans being considered in Whitehall.\n Officials at the Business, Energy and Industrial Strategy department have raised the issue of enshrining a right to work from home in law as part of a suite of options to ease the lockdown, The Telegraph can reveal.\n One source said the idea of a legal right was suggested by officials during talks about the Government&#39;s return to work package.\n It would mean staff would not feel  compelled to go in to the office, while limiting the costs for employers who have to make their workplaces safe for social distancing.\n The idea – still in its infancy – has won the support of Government ministers who have drawn up the plans to encourage people to return to work and get the economy motoring. One said: &#34;It makes complete sense.&#34;\n  The measure could prove popular in the so-called- red wall seats won by the Tories at December&#39;s election. Boris Johnson, the Prime Minister, committed his Government to making flexible working a  default right for workers in the party&#39;s 2019 manifesto.\n It said: &#34;We will encourage flexible working and consult on making it the default unless employers have good reasons not to.&#34;\n The idea of more protections to work from home were contained in a review of modern-day working by Matthew Taylor in 2017, which said: &#34;Encouraging flexible work is good for everyone and has been shown to have a positive impact on productivity, worker retention and quality of work.&#34;\n In the Government&#39;s response in 2018, ministers said that, &#34;as part of the statutory evaluation of the Right to Request Flexible Working in 2019, the Government should consider how further to promote genuine flexibility in the workplace&#34;.\n A source familiar with the thinking behind the plans said a legal right to work from home – or a commitment to one – would ensure that there are not huge queues at stations when commuters try to return to work once the lockdown eases.\n Transport authorities have warned the two-metre social distancing rules would mean trains and buses  would have to run 85 per cent empty to ensure travellers are kept apart.\n The Liberal Democrat frontbencher Layla Moran said any new law could be a &#34;win-win&#34; for employers and workers.\n &#34;By introducing this law, the Government will be giving the individuals even more control over their work-life balance, leading to improved mental health and more productivity,&#34; she said. &#34;It would also help address disparities in accessibility to the workplace, faced especially by those with childcare or other caring responsibilities.\n &#34;I believe this change would benefit both the employees and the employers, and has the potential to be a win-win.&#34;\n Frances O&#39;Grady, the TUC general secretary, told The Telegraph: &#34;The right to work from home would be a big step forward. People in all types of job need to be given more control over their hours and where they work. That&#39;s why we&#39;ve called for all workers to have a day one right to flexible working.&#34;\n A report from the TUC last week found that four in 10 workers are are concerned about not being able to socially distance from colleagues when back at work.\n  The study also found more than a quarter were concerned about not being able to socially distance from customers or clients. One third were concerned about exposing others in their household to greater risk.\n The Unison union also reported that some of its members had said they were &#34;terrified that, if forced to go into work, they might take the virus home – with potentially devastating consequences&#34;.\n A Whitehall source told The Telegraph: &#34;We are engaging with key stakeholder and industry groups, as well as the unions, on safe working once lockdown measures have been relaxed.&#34;\n A Government spokesman said: &#34;The Business Secretary continues to work with businesses, union leaders and the science and medical community so we can ensure workplaces are safe for those who will go back to work once the measures are relaxed and give people the confidence to return to work.&#34;\n If ministers take the plans forward it would align the UK with Germany, which last week unveiled proposals to  introduce a legal right to work from home after the pandemic.\n Hubertus Heil, the Social Democrat labour minister, said employment legislation would be tabled in the autumn, making Germany and Finland the only countries in the world to have the right to home working enshrined in law.\n Mr Heil told Bild am Sonntag: &#34;Everyone who wants to and whose job allows it should be able to work in a home office. We are learning in the pandemic how much work can be done from home.&#34;\n  The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy.", "posttime": "2020-05-10 21:52:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,权利,home", "title": "冠状病毒封锁后，在家工作的权利可能被载入法律", "title_en": "Right to work from home could be enshrined in law after coronavirus lockdown", "transed": 1, "url": "https://www.telegraph.co.uk/politics/2020/05/08/right-work-home-could-enshrined-law-coronavirus-lockdown-ends/", "via": "", "real_tags": ["病毒", "冠状病毒", "权利", "home"]}]