[{"category": "", "categoryclass": "", "imagename": "6abea2cab22cefc79d30cb4e1d4feb51.jpg", "infoid": 1016945, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(美国有线电视新闻网商业报道)脸书正在将其工作从家庭政策延长到明年7月，成为最新一家致力于让员工远程工作的科技巨头，以应对冠状病毒大流行。\nFacebook发言人内卡·诺维尔(Nneka Norville)周四表示，根据健康和政府专家的指导，以及我们内部讨论这些问题的决定，我们允许员工自愿在家工作到2021年7月。\n谷歌最近还将其家庭政策工作延长至2021年7月。包括推特(Twitter)在内的一些公司表示，他们的员工可能会无限期远程工作。\n在此之前，Facebook首席执行官马克·扎克伯格曾表示，在未来5到10年内，多达50%的Facebook员工可能会远程工作。\n扎克伯格向Facebook员工推销这一想法，认为这既是为了满足员工的愿望，也是为了创造更广泛的经济繁荣。\n扎克伯格在5月份发布在他的Facebook页面上的直播中表示：当你将招聘限制在生活在少数大城市或愿意搬到那里的人时，就会排除很多生活在不同社区、有着不同背景、有不同观点的人。", "note_en": "New York (CNN Business)Facebook is extending its work from home policy until July of next year, becoming the latest tech giant to commit to letting staff work remotely in response to the coronavirus pandemic.\n &#34;Based on guidance from health and government experts, as well as decisions drawn from our internal discussions about these matters, we are allowing employees to continue voluntarily working from home until July 2021,&#34; said Nneka Norville, a Facebook spokesperson, on Thursday.\n    Google also  recently extended its work from home policy until July 2021. And some companies, including  Twitter  (  TWTR), have said their staff may work remotely indefinitely.\n The announcement  follows previous indications from Facebook CEO Mark Zuckerberg that as many as 50% of Facebook employees could be working remotely within the next five to 10 years.\n  Zuckerberg pitched the idea to Facebook staff as both a matter of satisfying employee desires and also as an effort to create &#34;more broad-based economic prosperity.&#34;\n &#34;When you limit hiring to people who live in a small number of big cities, or who are willing to move there, that cuts out a lot of people who live in different communities, have different backgrounds, have different perspectives,&#34; Zuckerberg said on a livestream posted to his Facebook page in May.", "posttime": "2020-08-08 04:55:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "祖先,equity,员工", "title": "一家私募股权公司以47亿美元收购了祖先及其DNA宝库", "title_en": "A Private Equity Firm Bought Ancestry, and Its Trove of DNA, for $4.7B", "transed": 1, "url": "https://edition.cnn.com/2020/08/06/tech/facebook-work-from-home/index.html", "via": "", "real_tags": ["祖先", "equity", "员工"]}, {"category": "", "categoryclass": "", "imagename": "2611d691676df17252ce330f2b48fb70.jpeg", "infoid": 1016944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很抱歉让你失望了，但是参加那一年的健身房会员卡是不太可能减掉脂肪的。它可能对少数人有效，但大多数人会失败并增加更多公斤，或者只是保持不变的体重。如果你看一看健身房，就会发现80%的设备都是用来锻炼肌肉的，而不是用来减肥的。你也会看到健身房里有肌肉的人比肥胖的人多得多，在大多数情况下，这并不是因为他们以前很胖，后来他们通过举重增加了肌肉。因此，你可能有20%的机会通过去健身房来实现你的减肥计划，但前提是你必须选择合适的器材，选择一个好的健身房程序并坚持下去。在我看来，这些几率都很小，那么我们还能做些什么来更好地减肥呢？\n要减肥，不要去健身房，而要重新定义你与食物的关系，就这样。\n我一直喜欢甜点，披萨是我最喜欢的食物。每顿饭都必须以甜点结束，不加糖的黑咖啡和一块巧克力棒齐头并进。4年前，我的体重达到顶峰：84公斤。对于一个中等身高的人来说，178厘米，这是超重了。现在我的体重是64公斤，正在锻炼最后一厘米的顽固脂肪。为了来到这里，我经历了医生的坏消息和多次的羞愧。第二种方法效果最好，我相信羞耻是那些努力控制体重的人的关键。\n对我管用的可能对你不管用，但我相信分享我的故事会激励和激励其他与减肥作斗争的人。回过头来看，我认为了解我为什么发胖是再次变得健康的关键。\n我认为有三件事是导致体重增加的主要原因：充足的食物、榜样和缺乏运动(与锻炼不同！)。如果你只忽略了其中的一个，那么很容易让体重失控。让我们逐一研究一下它们。\n食物。如果你读到这篇文章，那么你就生活在世界上食物丰富的地方。无论我们走到哪里，我们都能看到试图诱惑我们的食物，还有旨在让你品尝新巧克力、新汉堡或新含糖饮料的广告牌。我们在商店里找到的大多数产品都不是未经加工的，如果不看标签，很难猜出几种成分。我们一天至少吃三顿饭，很多时候我们在两餐之间吃零食。如果你计算一下我们每天花在寻找食物、等待食物上菜、吃饭和打扫卫生上的时间，你可以很容易地计算出每天至少花3个小时与食物互动。现在，想象一下每天多一个小时的空闲时间。\n榜样人物。有研究表明，当你成长时，你身边最亲近的人是那些对你作为一个人的智力发展有很大影响的人。如果你的榜样--可以是老师、父母或社会领袖--很胖，那么你也很有可能随着时间的推移发胖。通过尊重和操控这些人的言行，你间接地改变了你与胖子的“关系”，胖子成了你最好的朋友之一。当你吃太多或不健康的食物时，你的大脑会开始接受肥胖的外表，你会忽略开始堆积在你腹部的脂肪层。\n没有动静。最后但并非最不重要的一点是，缺乏运动可以起到保肥的作用。是的，运动和锻炼是不同的。当你锻炼时，你的心跳开始加速，你的心率加快，你开始流汗。运动是不同的，因为它指的是不停留。它可以是在公园里散步或上班，洗碗或洗衣服，或者只是一边打电话一边在房间里走动。在过去的几十年里，我们越来越久坐不动，几乎没有时间移动：汽车载着我们挨家挨户，机器为我们洗碗洗衣服，我们一天剩下的时间都呆在电视或电脑前。当然，这并不能帮助你烧掉几个小时前吃的奥利奥饼干--你必须慢跑6分钟才能烧掉一块奥利奥！😮\n我认为保持健康的解决方案几乎不依赖于我上面描述的健康的3件事，这是最容易的部分。只要注意你吃了什么，你接受或忽略了什么，以及你是如何照顾你吃下的卡路里的。如果你这样做，那么你很可能不会发胖，而且你可以很容易地控制你的体重。\n现在，让我们在增加一些脂肪后回到正轨上来，这是最困难的部分。在这里，你必须跳过甜点，多走一英里路，更换你的型号。但在所有这些中，食物在减肥时是最重要的。对我来说，这是一个4年的过程，我仍然在努力。\n你不能指望在10年内发胖，然后在几个月内恢复良好的身材。大多数人希望在一个月内减掉10公斤，或者看到每天的进步-他们大错特错了。减掉脂肪是一个漫长的过程，你的身体需要时间来适应新的体重。对我来说，它发生在2-3个月的快速减肥期间，大约相差6公斤，每一次都是一些不同的东西扣动了我继续前进的扳机。在第一个病例中，医生传来了坏消息，在另外3个病例中，有一种强烈的羞耻感。让你希望自己孤身一人，没有人看见你的羞耻。在我体验到这种羞愧之前，我一直在努力减肥，而且我无法将秤向下移动。\n坏消息-减了7公斤。回到4年前，在一次例行体检中，我的医生告诉我我得了脂肪肝，病情不太好。这是我今天体重增加的第一个导火索。为了变得更健康，我开始少吃糖，多运动，不再吃那么多垃圾食品。我还买了一个健身跟踪器，一个家庭步行器，我每周跑步几天。这起作用了，我在正确的道路上，但我被困在77公斤。回过头来看，我想我没有正确的动力，自从我的肝脏好了，我就不太注意吃什么了，我又回到了以前的许多坏习惯：晚上睡不着觉，吃太多甜点。\n为我周围的人感到羞耻-减掉了6公斤。然后，我第一次感到羞愧的时刻到来了。那是一个炎热的夏日，我在意大利西西里岛的海滩上。我通常在海滩上感到无聊，所以我要么看书，要么睡觉，要么环顾四周观察。环顾四周，当我意识到我是一个极其繁忙的海滩上唯一的胖子时，我有了一个顿悟的时刻。我周围的每个人，不管他们多大年纪，都很健康。我完全震惊了。他们不仅很健康，而且身材也很好。我欣喜若狂，甚至穿上T恤，只仰面躺着，所以我的肚子看不见，直到那天我离开海滩。当我到达酒店房间时，我做了社会告诉我们要做的事情，我们向肥胖宣战--成为健身房的会员。我拿起手机，给家里的健身房发了一封电子邮件，要求成为会员。我有私人教练，而且我一周有三天去健身房。事情又开始移动了，再加上低碳水化合物饮食，我设法在几个月内从77公斤增加到69公斤左右。都很好，只是长期不推荐低碳水化合物饮食，所以我在6周后就停止了。一旦我取消了低碳水化合物饮食，体重又开始增加，它停止在大约71公斤。\n我真丢脸-瘦了7公斤。我在71公斤的体重上呆了两年多。然后，我的下一个羞耻时刻到来了。当我在看我骑自行车的录音时，我看到了我肥大的鞋带。我一遍又一遍地看着它，我记得当时我感到羞愧，就像我是海滩上唯一的胖子一样。我想我可以通过经常去健身房来解决这个问题，所以我开始每周去4次并坚持下去。我错了，令人惊讶的是，两个月过去了，我仍然超过了70公斤。在整个过程中，我可能减掉了一些脂肪，长出了一些肌肉，但照镜子时没有明显的区别，所以我知道我必须改变一些东西。\n因此，我开始研究，并列出了20多件我可以做的减肥事情。当帕雷托带着80/20规则来的时候，他是对得不能再正确了。在整个清单中，造成80%差异的是与之相关的食物。在接下来的6周里，我在没有去健身房的情况下减掉了6公斤多的体重，只是改成了5：2的禁食饮食。这意味着我每周有两天的卡路里摄入量低于800卡路里，其余的五天和往常一样。有研究表明，这样的饮食不仅可以帮助你减肥，而且对衰老和整体健康有很大的影响-如果感兴趣的话，可以在这里看到更多。\n花钱的耻辱--继续下去。我们为钱辛辛苦苦地工作，而且很多时候我们花错了钱。具有讽刺意味的是，我们工作是为了钱买食物，然后我们变胖了，然后我们为了钱工作得更多，只是为了把它们花在减去我们之前购买的脂肪上。如果我们一开始就不发胖，少工作会怎么样？或者买质量更好的食物，而不是很多质量较差的食物\n我第三次感到羞愧是在几天前，当时我正在外面吃晚饭。我想我就吃点清淡的吧，但是当我到餐厅的时候，他们正在吃海鲜自助餐。如果你和我一样，那么尝试不同食物的好奇心，再加上第二次去泰国餐厅，会很快说服你去吃自助餐，而不是点菜。我就是这么做的，那天晚上我吃得太多了。首先，我点了一盘不同的开胃菜，然后是另一盘不同的烤海鲜，最后，当然，还有甜点。我的清淡饭菜变成了吃得太多，并为此感到羞愧。我为那天晚上花在食物上的钱感到很难过，因为我实际上并不需要吃那么多。我不是，我从来没有节俭过。我已经想了好几个小时了，问我怎么会是那个傻瓜。我开始回想有多少次我刚买了甜点，尽管我吃饱了，或者点了更多我平时可以吃的菜。这一刻让我在点餐时变得更加清醒，如果我真的那么饿了，我会三思而后行。不知何故，我知道这一刻将帮助我减去小腹上最后的顽固脂肪，并帮助我赢得与脂肪的战争。\n通过回顾我是如何减掉20公斤的，对我来说，很明显，重新定义我的饮食方式，我吃了多少，我吃了什么，这是关键。第一次，我通过减少垃圾食品和糖来减肥。然后，低碳水化合物饮食才是关键，而不是我在健身房努力工作的事实。最后，限制卡路里摄入量帮助我每周减掉1公斤。\n改变你的饮食是很困难的，要跳过一道甜点，拒绝汉堡、意大利面或披萨，选择沙拉或只喝水而不是新鲜果汁或可乐，都需要很大的意志力。减肥并不是一个简单的过程，在你进入正确的心态之前，你会失败几次，但站在磅秤上，看到一个不错的数字，穿上中号衣服，平腹走在海滩上，这是有回报的。对我来说，那比甜点好吃多了。\n总而言之，我在下面列出了我在饮食中改变的最重要的事情和我对待食物的方式，你可以用它作为起点。\n在两周内写下你每天吃的东西，然后复习一下。如果你觉得不错，请朋友来检查一下。如果他也觉得不错，那就继续问吧。\n不要喝卡路里。这包括酒精、加糖或牛奶咖啡和新鲜果汁。水、清咖啡和茶都可以。\n外出就餐时，在打开菜单之前决定要吃沙拉，并且只看沙拉部分。\n如果我的故事帮助你达到你一直想要的体重，或者你有类似的故事，我很乐意了解更多，所以请在下面分享它！😃", "note_en": "Sorry to disappoint you, but it is highly unlikely to lose fat by taking that one year gym membership. It might work for a few people, but most will fail and gain more kilos or just stay around the same weight. If you take a look at a gym, it’s a no brainer that 80% of the equipment is designed for building muscles not for losing fat. You will also see far more people with muscles than fat people in gyms and in most cases it is not because they were fat before and then they have built on muscles by lifting weights. Thus, you have maybe a 20% chance of succeeding in your fat loss plan by going to the gym, but only if you hit the right equipment and choose a good gym routine and stick to it. These odds seem quite small to me, so what could we do better to lose fat?\n To lose weight do not go to the gym, but redefine your relation with food, period.\n I always liked desserts and pizza was my favourite food. Each meal had to end with a dessert, and the unsweetened black coffee was going hand in hand with a chocolate bar. 4 years ago I was at the peak of my weight: 84kgs. For an average tall guy, at 178cm, that is overweight. Now I’m at 64kgs, and working on the last centimetres of stubborn fat. To get here, I went through bad news from the doctor and multiple moments of shame. The second worked best and I believe that shame is the key for persons struggling to keep their weight under control.\n What worked for me might not work for you, but I am convinced that sharing my story has the power to motivate and inspire other persons that struggle with weight loss. Looking back, I think that understanding why I got fat is the key to getting fit again.\n  I believe that there are 3 things which contribute mostly to gaining weight: food abundance, role models, and lack of movement (different from exercise!). If you overlook only one of them, then there are high chances to easily get weight out of control. Let’s look a bit into each of them.\n Food. If you read this, then you live in that part of the world where there is food abundance. Everywhere we go we see food that tries to seduce us and billboards designed to make you try that new chocolate, new burger or new sugary drink. Most of the products we find in stores are not in raw form and it is hard to guess more than a few of the ingredients without reading the labels. We eat at least 3 meals a day and many times we have snacks in between meals. If you count the time we spend for finding food, waiting for food to be served, eating and then cleaning you can easily count at least 3 hours spent daily interacting with food. Now, just imagine having one additional free hour each day.\n Role models. There are studies which show that when you grow, the closest persons near you are the ones that have a strong influence on how you build evolve mentally as a person. If your role models — which can be teachers, parents or society leaders — are fat, then there is a high chance you would get fat over the years as well. By respecting and giving your fucks on what these people do and say, you change indirectly your “relationship” with fat and fat becomes one of your best friends. Your brain will start to accept the fatty look as a norm and you will ignore the layers of fat that start to pile up on your belly when you eat too much or unhealthy food.\n Lack of movement. Last but not least, there is lack of movement which acts as a fat keeper. And yes, movement is different than exercise. When you exercise, your heart starts pumping, your heart rate increases and you start sweating. Movement is different, as it refers to not staying. It could be walking in the park or to work, doing dishes or laundry, or simply moving around the room while speaking on the phone. In the last decades, we got more and more sedentary and we spend little time moving: cars get us from door to door, machines are doing dishes and laundry for us, and we spend the rest of the day in front of the TV or computer. That, for sure, doesn’t help you burn the Oreo biscuit you ate a few hours ago — you have to jog for 6 minutes to burn just a single Oreo! 😮\n  I think the solution to staying fit relies hardly on the 3 things I described above as FIT  and that is the easy part. Just pay attention to what you eat, what things you accept or ignore and how you take care of the calories you ate. If you do that, then probably you won’t get fat and you can keep your weight easily under control.\n  Now let’s get to the hard part of getting back on track after we gain some fat. Here you have to skip that dessert, walk the extra mile and change your models. But from all of these, food is what counts most when losing fat. For me it was a 4 years process and I am still working on it.\n You cannot expect to get fat in 10 years and then back to good shape in a few months. Most people expect to lose 10 kilos in one month or to see a daily progress — they are so wrong. Losing fat is a long process and your body needs time to adapt to the new weight. For me, it happened in periods of 2–3 months of rapidly losing weight when there was a difference of around 6 kilos, and each time it was something different that pulled the trigger to keep me going. In the first case there were bad news from the doctor and in the other 3 cases there was a strong felling of shame. The shame that makes you wish you were alone and nobody sees you. Before I got to experience this shame, I’ve been struggling to lose weight and I was not able to move the scale down.\n  Bad news — lost 7 kilos. Back to 4 years ago, during a routine medical check, my doctor told me that I had a fatty liver and it was not doing so well. This was the first trigger towards the weight I have today. To become healthier, I started to eat less sugar, move more and stop eating so much junk food. I also purchased a fitness tracker, a home stepper and I was running a few days per week. This worked and I was on the right path, but I got stuck at 77kgs. Looking back, I think I haven’t had the right motivation and since my liver got better, I paid less attention to what I ate and I returned to many of the previous bad habits: not sleeping at night and enjoying too many desserts.\n Ashamed of people around me — lost 6 kilos. Then, my first moment of shame came along. It was a hot summer day and I was on a beach in Sicily, Italy. I usually get bored on the beach so I either read, sleep or look around and observe. By looking around I had a eureka moment when I realised that I was the only fat person on an extremely busy beach. Everyone around me was fit no matter what age they were. I was purely shocked. Not only they were fit, but they were in very good shape. I was so embraced that I even put my T-shirt on, and layed only on my back, so that my belly was not that visible, until I left the beach that day. When I got to the hotel room, I did what society tells us to do we declare war on fat — take the gym membership. I got to my phone, I emailed the gym back home and asked for a membership. I got a personal trainer and I was hitting gym 3 days a week. Things started to move again, and combined with a low carb diet, I managed to get from 77 kilos to around 69 kilos in a few months. All good, only that the low carb diet is not recommended for long term, so I stopped it after 6 weeks. As soon as I removed the low carb diet, the weight started to build up again and it stopped at around 71kgs.\n Shame of myself — lost 7 kilos. I stayed at 71kgs for more than 2 years. Then, my next moment of shame came. While I was watching a recording of me riding a bike, I saw my fatty love handles. I watched it again and again and I recall feeling the same shame as when I was the only fat person on the beach. I thought that I can solve it again by going more regularly to the gym so I started to go 4 times per week and stick to it. I was wrong, and surprise surprise, 2 months passed and I was still over 70kgs. I might have been lost some fat and built on some muscles in this whole process, but with no obvious difference when looking in the mirror, so I know I had to change something.\n Thus, I started to research and I made a list with over 20 things I could do to lose fat. Pareto couldn’t be more right when he came with the 80/20 rule. From that entire list, the single one that made 80% of the difference was related food. In the next 6 weeks, I lost more than 6kgs without going to gym and only by switching to the 5:2 fasting diet. That means that 2 days per week I was eating under 800 calories and in the other 5 days just as usually. There are studies which show such diet would not only help you lose fat, but has strong impact over aging and overall health — if interested see more  here.\n Shame of spending money — on going. We work so hard for our money and many times we spend them wrongly. Ironically, we work for money to buy food, then we get fat and then we work more for money just to spend them on losing the fat we previously purchased. What if we’d not get fat in the first place and work less? Or buy better quality food instead of a lot of lower quality food with the same money?\n My third moment of shame was a few days ago, while I was out for a dinner. I thought that I will just eat something light, but when I got to the restaurant they were having seafood buffet. If you are like me, then the curiosity to try different foods combined with being for the 2nd time in a thai restaurant would have rapidly convinced you to go for the buffet instead of the à la carte menu. That’s what I did and I ate far too much that evening. First, I got a plate with different starters, then another one with different grilled sea food and finally, of course, the dessert. My light meal turned into eating too much and feeling ashamed of it. I was feeling so bad for the money I spent that night on food because I didn’t actually need to eat that much. I am not and I have never been frugal. I’ve been thinking for hours about it asking how I could be that fool. I started to look back how many times I just purchased a dessert although I was full or ordered more dishes that I could normally eat. This moment made me be more conscious when I order food and think twice if I am actually that hungry. Somehow I know that this is the moment which will help me lose the last stubborn fat from my lower belly and help me win the war on fat.\n By looking back at how I lost 20kgs, to me it is obvious that redefining the way I ate, how much I ate, and what I ate was the key point. The first time, I lost fat by reducing the junk food and sugar. Then, the low carb diet was the key, not the fact that I was working hard at the gym. And finally, restricting the calorie intake helped me lose 1kg per week.\n Changing your diet is hard and it takes a lot of willpower to skip a single dessert, say no to a burger, pasta or pizza and choose a salad or drink just water instead of a fresh juice or Coke. Losing weight is not a simple process and until you get into the right state of mind you will fail a few times, but it is rewardful to step on the scale and see a nice number, get medium size clothes and walk on the beach with a flat abdomen. For me that is much better than that dessert.\n To sum it up, I am making below a list with the top things that I changed in my diet and the way I treat food, which you could use as a starting point.\n Write down for 2 weeks what you eat daily and then review it. If it looks good to you, ask a friend to check it. If it looks good to him too, keep asking.\n   Don’t drink calories. This includes alcohol, sweetened or milk coffee and fresh juices. Water, black coffee and tea are fine.\n    When eating out, decide before opening the menu that you want a salad and look just at the salads section.\n If my story helps you get to the weight you always wanted or you have a similar story, I would be happy to find out more so please share it below! 😃", "posttime": "2020-08-08 04:54:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宣战,fat,食物", "title": "向脂肪宣战--我是如何通过改变饮食习惯减掉20公斤的", "title_en": "War on fat – how I lost 20 kilos by changing my eating habits", "transed": 1, "url": "https://medium.com/@stefanneculai/war-on-fat-how-i-lost-20-kilos-by-changing-my-eating-habits-7728901ad313", "via": "", "real_tags": ["宣战", "fat", "食物"]}, {"category": "", "categoryclass": "", "imagename": "93265106bd260709e8976408d1754657.jpg", "infoid": 1016942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很多人错过了去年“末日巡逻”的首播，这是一部令人欣喜的疯狂电视剧，讲述了一个与超级英雄格格不入的家庭的故事，因为它只在DC宇宙流媒体服务上播出。幸运的是，S2还在HBO Max上播出，扩大了该系列的潜在受众。除了一集低于标准的一集，第二季在第一季的基础上进行了扩展，有大量疯狂的劫持、幽默、悲情、令人惊讶的转折和WTF时刻。唉，这一季的大结局肯定会让粉丝们感到沮丧，因为它的结局非常扣人心弦，留下了多条悬而未决的叙事线索。\n正如我们之前报道的那样，蒂莫西·道尔顿饰演奈尔斯·考尔德，也就是酋长，一名医生，拯救了多名末日巡逻队成员的生命，并让他们住在他的豪宅里。他的“不合适庄园”包括简，也就是疯狂的简(黛安·格雷罗饰)，她童年的创伤导致了64个截然不同的人格，每个人都有自己的力量。丽塔(阿普丽尔·鲍尔比饰)，又名“伊拉斯蒂女人”，是一名前女演员，由于暴露在一种改变了她细胞结构的有毒气体中，她拥有她无法真正控制的弹性属性。拉里·特雷诺(Larry Trainor)，又名负能量人，是一名美国空军飞行员，他体内有一个负能量实体，必须用绷带包裹起来，以防止放射性物质从他的身体渗出。(马特·博默(Matt Bmer)饰演没有绷带的Trainor，而马修·祖克(Matthew Zuk)饰演绷带角色。)。\n克里夫·斯蒂尔，又名机器人人，是一名前纳斯卡车手，他的大脑在一次可怕的撞车后被移植到机器人体内。(布伦丹·弗雷泽(Brendan Fraser)饰演人类悬崖，莱利·沙纳汉(Riley Shanahan)饰演机器人版。)。最后是维克，也就是赛博格(乔伊凡·韦德饰)，他的父亲在一次事故后给了他控制能力的增强来拯救他的生命。他们共同组成了名义上的末日巡逻队。\n在S1中，团队面对的是大反派埃里克·摩登，也就是无名之辈(艾伦·图迪克饰)，他可以穿越次元空间，改变现实，经常打破第四堵墙-作为唯一知道自己在电视节目中的角色-讲述行动，从而按照他的喜好操纵事件。没有人会绑架考尔德，并将他囚禁在一个叫做“空白空间”的空间，而“末日巡逻队”第一季的大部分时间都在试图营救他，一路与他们的个人恶魔搏斗。\n最后，末日巡逻队击败了无名氏先生，但他们也发现，酋长是一个负责的所有悲剧，给了他们各自的权力。这么说吧，球队现在正在处理一些强烈的背叛感。考尔德有他的理由：他有一个超能力的女儿，多萝西·斯皮纳(Abigail Shapiro饰)，她深受困扰，他的行为是试图尽可能延长自己生命的一种手段，这样他就可以继续保护她。哦，整个团队，除了拉里，现在都是蟑螂大小了。\n编剧们对S2第一集的微缩主题颇感兴趣，但幸运的是，他们没有让他们在这种状态下逗留太久。威洛比·吉卜林(马克·谢泼德饰)，我们在S1中遇到的神秘侦探和混沌魔术师，被召唤来拯救这一天。但他的帮助是有代价的：考尔德必须给他带来永生的护身符，这就是每个人都知道酋长已经139岁的原因。\n现在时间紧迫，需要找到另一种方法延长考尔德的生命，这样他就可以继续保护多萝西，他和不朽的原始女人斯拉瓦(皮赛·鲍饰)的女儿多萝西。多萝西继承了斯拉瓦将想象中的朋友赋予生命的能力，当它是一只友好的巨型野兽曼尼或巨型蜘蛛赫歇尔时，这并不是那么糟糕。但在多萝西的想象中潜伏着另一种更阴险的生物：蜡烛制造者，显然与部落诅咒有关。每当多萝西许愿的时候，他就会出现，而结果通常是大范围的屠杀。\n一路上，末日巡逻队遇到了热爱迪斯科的乔纳森·百里博士(由布兰登·佩雷亚饰演的丹·马丁配音)，他拥有一种控制时间的外星人元素。他们与红杰克(罗杰·弗洛伊德饰)展开较量，红杰克从他人的痛苦中汲取能量。他们被被称为斯坎特的白色太空生物捕获，末日巡逻队遇到了考尔德未知地带的先锋们，他们是由瓦伦蒂娜·莫斯科沃斯托克(玛丽安娜·克拉维诺饰)领导的不老的宇航员，她体内也有一种消极的精神，因此与拉里建立了联系。\n探索童年创伤的想象力是本季的主流主题，在多萝西的案例中表现得最为明显。但末日巡逻队的每个成员都在某种程度上受到了严重的破坏，这不仅仅是因为考尔德在寻找延长自己生命的秘密时对他们所做的事情。在这一季中，我们看到拉里试图与他幸存的儿子重新建立联系，克里夫试图向他的女儿克拉拉(贝瑟妮·安妮·林德饰)做出补偿。维克爱上了罗尼(凯伦·奥比洛姆饰)，这位老兵的控制论增强功能被移除，给她留下了伤痕累累，因为他面临着自己的创伤后应激障碍(PTSD)。\n至于简，我们更多地了解了她的各种性格，以及这些年来他们是如何表现出来的，以及他们共享的心理空间，也就是众所周知的地下空间。每个人都有自己的位置，尽管简是主要的性格--直到地铁开始质疑她是否仍然专注于主要的使命(保护女孩，也就是凯，在多年被虐待狂的父亲虐待后退却的核心人物)。在此之前，简是最主要的人格，直到地铁开始质疑她是否仍然专注于主要的使命(即保护女孩，即在多年被虐待狂的父亲虐待后退缩的核心人物)。整个《末日巡逻队》演员阵容都表现强劲，但格雷罗依然脱颖而出，轻松切换不同性格，让我们感同身受。\n唉，丽塔在心理上的突破--她直面霸道舞台母亲给她造成的创伤--无疑是这一季最弱的一集(性爱巡逻队)的焦点。在多萝西不小心打破了砖家丹尼(前身是华尔街丹尼)之后，我们在S1中遇到的超级英雄弗莱克斯·曼塔洛(德文·钱德勒饰)和前者的丹尼森一起出现，举办了一个派对，希望能提振丹尼的精神，治愈他的创伤。Flex可以通过展示肌肉来改变现实，上一季有一个有趣的时刻，他无意中展示了错误的肌肉，让整个“末日巡逻队”同时达到了强烈的高潮(克里夫除外，因为他现在都是机器人了，尽管他试图假装团结起来)。\n这是一个伟大的一次性时刻，是众多(就像S1反复提到动植物矿工)中的一个，真正增加了整体的疯狂乐趣。但在丹尼的派对上，丽塔试图控制自己的力量，要求弗莱克斯重复性高潮的壮举，这反过来又引起了一个性恶魔的注意：神秘的埃文斯先生，他最终可能杀死所有的孩子。这并不好笑--甚至有点恶心--作为一个角色，弗莱克斯应该得到更好的待遇，而不是沦为一个窃笑、幼稚的笑话。这也让人很难相信，这将是丽塔解决过去童年创伤并更好地控制她的浮肿的关键。\n在大结局中，多萝西迎来了她的第一次月经，标志着她进入了女性化的阶段，而蜡烛制造者的力量开始在现实世界中显现出来。不过，就在剧情发展到高潮的时候，这一集……。结束。坦率地说，这令人抓狂。一场精彩的大结局为故事主线画上句号，并为下一季做好铺垫。这个刚刚被突然切断了。这一季只有9集，而S1有15集，所以很可能大流行缩短了生产。但我当然希望这部连续剧在HBO Max和DC Universal上播出能带来足够多的新观众，让我们有足够的第三季，因为我非常想知道接下来会发生什么。", "note_en": "Lots of people missed last year&#39;s debut of   Doom Patrol, a delightfully bonkers show about a &#34;found family&#34; of superhero misfits, because it aired exclusively on the  DC Universe streaming service.  Fortunately, S2 also aired on HBO Max, expanding the series&#39; potential audience. Apart from one sub-par episode, this second season expanded on the strengths of the first, with plenty of crazy hijinks, humor, pathos, surprising twists, and WTF moments. Alas, the season finale is bound to frustrate fans, since it ends on a major cliffhanger and leaves multiple dangling narrative threads.\n  As  we reported previously, Timothy Dalton plays Niles Caulder, aka The Chief, a medical doctor who saved the lives of the various Doom Patrol members and lets them stay in his mansion. His Manor of Misfits includes Jane, aka Crazy Jane (Diane Guerrero), whose childhood trauma resulted in 64 distinct personalities, each with its own powers. Rita (April Bowlby), aka Elasti-Woman, is a former actress with stretchy, elastic properties she can&#39;t really control, thanks to being exposed to a toxic gas that altered her cellular structure. Larry Trainor, aka Negative Man, is a US Air Force pilot who has a &#34;negative energy entity&#34; inside him and must be swathed in bandages to keep radioactivity from seeping out of his body. (Matt Bomer plays Trainor without the bandages, while Matthew Zuk takes on the bandaged role.)\n Cliff Steele, aka Robotman, is a former NASCAR driver whose brain was transplanted into a robot body after a horrific crash. (Brendan Fraser plays the human Cliff, and Riley Shanahan plays the robot version.) Finally, there is Vic, aka Cyborg (Joivan Wade), whose father gave him cybernetic enhancements to save his life after an accident. Together, they make up the titular Doom Patrol.\n In S1, the team faced arch-villain Eric Morden, aka Mr. Nobody (Alan Tudyk), who can travel through dimensions and alter reality, frequently breaking the fourth wall—as the only character who&#39;s aware he is on a TV show—to narrate the action, thereby manipulating events to his liking. Mr. Nobody kidnaps Caulder and holds him captive in a dimension called the &#34;White Space,&#34; and the Doom Patrol spends most of the first season trying to rescue him, wrestling with their personal demons along the way.\n In the end, the Doom Patrol defeats Mr. Nobody, but they also discover that The Chief is the one responsible for all the tragedies that gave them each their powers. Let&#39;s just say the team is dealing with some intense feelings of betrayal right now. Caulder had his reasons: he has a super-powered daughter,  Dorothy Spinner (Abigail Shapiro), who is deeply troubled, and his actions were a means of trying to extend his own life as much as possible so he could continue to protect her. Oh, and the entire team, except for Larry, is now the size of a cockroach.\n     The writers have a bit of fun with the miniaturized theme in S2&#39;s first episode, but fortunately they don&#39;t let them linger too long in that state. Willoughby Kipling (Mark Sheppard), the occult detective and chaos magician we met in S1, is summoned to save the day. But his help comes at a cost: Caulder must give him the talisman that grants him immortality, which is how everyone learns that the Chief is 139 years old.\n Now the clock is ticking to find another way to extend Caulder&#39;s life so he can continue to protect Dorothy, his daughter with Slava (Pisay Pao), an immortal primitive woman. Dorothy inherited Slava&#39;s ability to bring imaginary friends to life, which isn&#39;t so bad when it&#39;s a friendly giant beast named Manny or Herschel the giant spider. But there is another, more insidious creature lurking inside Dorothy&#39;s imagination: The Candlemaker, apparently linked to a tribal curse. He emerges whenever Dorothy makes a wish, and widespread slaughter is usually the result.\n Along the way, the Doom Patrol encounter the disco-loving Dr. Jonathon Thyme (voiced by Dan Martin, played by Brandon Perea), who is in possession of an alien element that controls time. They take on Red Jack (Roger Floyd), who draws energy from the pain of others. They get captured by White Space creatures known as Scants, and the Doom Patrol meet the Pioneers of the Uncharted, Caulder&#39;s old research team—ageless astronauts led by  Valentina &#34;Moscow&#34; Vostok (Mariana Klaveno), who also has a Negative Spirit inside her and thus bonds with Larry.\n  The power of imagination to explore childhood trauma was a prevailing theme this season, most obviously in the case of Dorothy. But every member of the Doom Patrol is badly damaged in some way, and not just because of what Caulder did to them as he was seeking the secret to prolonging his own life. Over the course of the season, we see Larry try to reconnect with his surviving son, and Cliff attempts to make amends to his daughter, Clara (Bethany Anne Lind). Vic falls in love with Roni (Karen Obilom), a veteran whose cybernetic enhancements were removed and left her scarred, as he confronts his own PTSD.\n As for Jane, we learn a great deal more about her various personalities and how they have manifested over the years, as well as the psychological space they all share, known as the Underground. Every personality has its own station, although Jane is the primary personality—until the Underground starts to question whether she is still focused on the primary mission (&#34;protect the girl,&#34; i.e. Kay, the core personality who retreated after years of abuse by her sadistic father). The entire cast of  Doom Patrol give strong performances, but Guerrero still stands out, switching between different personalities with ease and making us feel for each one of them.\n Alas, Rita&#39;s psychological breakthrough—in which she confronts the trauma her domineering stage mother inflicted upon her—is the focus of what is easily the weakest episode of the season (&#34;Sex Patrol&#34;). After Dorothy accidentally breaks Danny the Brick (formerly Danny the Street), superhero Flex Mentallo (Devan Chandler), whom we met in S1, shows up with the former &#34;Dannyzens&#34; to throw a party in hopes of lifting Danny&#39;s spirits and healing him. Flex can alter reality by flexing his muscles, and there was an amusing moment last season where he inadvertently flexed the wrong muscle and gave the entire Doom Patrol simultaneous intense orgasms (except for Cliff because he&#39;s all robot now, although he tried to fake one in solidarity).\n It was a great throwaway moment, one of many (like recurring S1 mentions of Animal Vegetable Mineral Man) that really adds to the overall sense of madcap fun. But during Danny&#39;s party, Rita seeks to control her power by asking Flex to repeat the orgasmic feat, which in turn draws the attention of a sex demon: The Shadowy Mr. Evans, who could eventually kill all children. It&#39;s just not funny—it&#39;s even a little gross—and Flex as a character deserves better than being reduced to a sniggering, puerile in-joke. It also strains credibility that this would be the key to Rita resolving her past childhood trauma and gaining better control over her blobbiness.\n In the finale, Dorothy gets her first period, marking her transition into womanhood, and the Candlemaker&#39;s powers begin to manifest in the real world. But just as the action builds to a crescendo, the episode just... ends. Frankly, it was maddening. A good finale wraps up the main story line and sets up a cliffhanger for the  next season. This one just cut off abruptly. There were only nine episodes this season, compared to 15 in S1, so it&#39;s possible the pandemic cut production short. But I certainly hope airing the series on HBO Max as well as DC Universe brought in sufficient new viewers that we get a third season because I&#39;m dying to know what happens next.", "posttime": "2020-08-08 04:29:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "末日,doom,饰演", "title": "点评：末日巡逻队强势归来凶猛好玩S2", "title_en": "Review: Doom Patrol comes back strong with  fierce and fun S2", "transed": 1, "url": "https://arstechnica.com/gaming/2020/08/review-doom-patrol-comes-back-strong-with-fierce-and-fun-s2/", "via": "", "real_tags": ["末日", "doom", "饰演"]}, {"category": "", "categoryclass": "", "imagename": "6fb5cc559e0aa57a9ea2c64ec6a865d4.jpeg", "infoid": 1016941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面，我们将探讨这些诉讼的细微差别和重要性，以及Snap多样性和包容性的记录。我们去拿吧。\n加州高等法院法官伊桑·P·舒尔曼(Ethan P.Schulman)听取了有关初步禁令的辩论，该禁令旨在迫使优步和Lyft将司机重新归类为员工。\n今年5月，加利福尼亚州总检察长泽维尔·贝塞拉(Xavier Becera)与洛杉矶、圣地亚哥和旧金山的市政检察官一起起诉优步(Uber)和Lyft，指控这两家公司通过将工人错误归类为独立承包商而获得不公平和非法的竞争优势。诉讼称，优步和Lyft剥夺了工人获得最低工资、加班、获得带薪病假、残疾保险和失业保险的权利。6月，原告提交了初步禁令，试图迫使优步和Lyft遵守AB 5，并立即停止将其司机归类为独立承包商。\n本周，100多人收看了关于初步禁令的听证会。听证会在Zoom举行，最初只能容纳100人。但对此案的兴趣迫使法院将其网络研讨会的能力增加到500人。目前还没有裁决，但舒尔曼法官表示，我们可能会在几天内做出裁决，而不是几周。\n在听证会上，舒尔曼表示，确定初步禁令在此案中的影响是多么困难。例如，舒尔曼说，优步和Lyft将如何遵守禁令，以及对司机的经济影响，比如他们的收入能力，他们可以工作的时间，以及他们是否有资格享受国家福利，目前还不清楚。\n他说：“我感觉有点像是被要求跳入一个水体，而我并不真正知道它有多深，水有多冷，以及我进去后会发生什么。”\n拟议的禁令将对Lyft和优步造成不可弥补的伤害，实际上将对司机和乘客造成巨大伤害。\n我们认为，各方严重夸大了他们需要做些什么才能遵守法律。\n本周早些时候，加州劳工委员会分别起诉优步和Lyft。单独诉讼的目的是追回据称欠这些司机的钱。通过将司机归类为独立承包商而不是员工，优步和Lyft都没有被要求支付最低工资、加班补偿，也没有被要求提供带薪休息或偿还司机的驾驶成本。\n这些诉讼的共同之处是一个核心焦点和论点，即优步和Lyft错误地将其司机归类为独立承包商，并违反了法律。这两家公司已经多次因其劳动行为而被起诉，特别是因为它们涉及到将各自的司机归类为独立承包商。最新一系列诉讼的不同之处在于，它们是根据加州今年早些时候生效的一项新法律提出的，该法律将使这些零工经济公司更难对员工进行这种分类。诉讼也来自立法机构，而不是司机本身。\n这一刻已经等了很久了。优步早在2013年就面临第一起备受瞩目的劳工诉讼，当时Douglas O‘Connor和Thomas Colopy起诉优步将他们归类为1,099个独立承包商。几年后，优步在2019年解决了这起诉讼，向奥康纳和科洛比以及其他班级成员支付了2000万美元。\nSnap在多年拒绝公布多样性数字后，终于决定现在是公开这些数字的时候了。在我们开始之前，让我们先快速回顾一下Snap在多样性方面的历史。\n2016年：Snap因几个过滤器而受到抨击，许多人称这些过滤器是种族主义的。第一个是鲍勃·马利(Bob Marley)过滤器，它基本上启用了某种数字黑脸。第二次是与一个本应是动画人物的镜头有关。取而代之的是，人们对Snapchat启用黄脸表示强烈抗议。\n2017年：“我们从根本上相信，拥有一支拥有不同背景和不同声音的团队一起工作，是我们能够创造出改善人们生活和沟通方式的创新产品的最好机会。为了实现这一目标，我们重点做了两件事。第一个-创造一个多样化的工作场所-帮助我们组建这个团队。我们每年都会召集会议，主办黑客马拉松，并投资于每年为我们带来令人惊叹的多样化人才的机构。第二个问题-创造一个包容性的工作场所-要做对要困难得多，但我们认为，这是释放拥有一个多样化团队的潜力所必需的。这是因为我们相信多样性不仅仅是数字的问题。对我们来说，这实际上是创造一种文化，在这种文化中，每个人来工作时都知道自己在谈判桌上有一席之地，并且永远会得到个人和职业上的支持。我们首先挑战我们的管理团队每天与他们的每个团队设定这一基调，并投资于从社区外展到内部专业发展的以包容为重点的项目。在所有这些努力中，我们仍有漫长而艰难的道路要走，但相信它们代表着我们创建一个不仅成功，而且我们为成为其中一员而感到自豪的最大机会之一-Snap的S-1。\n2018年：一名前Snap工程师批评该公司存在“有毒”和“性别歧视”的文化。Snap首席执行官埃文·斯皮格尔(Evan Spiegel)后来表示，这封信“对我们来说真的是一个很好的警钟。”\n2019年：Snap聘请了第一位负责多样性和包容性的负责人Oona King。金之前曾在谷歌担任公司多元化战略总监。\n2020年6月：据报道，明镜周刊在一次全体会议上表示，该公司不会公开公布数字。然而，Snap对这份报告提出了异议，称将公布这些数据。\n2020年8月：Snap发布了有史以来第一份多元化报告，显示其全球员工中只有32.9%是女性，而美国员工中黑人占4.1%，拉丁裔占6.8%，土著员工占不到1%。\nSnap的数据不是很好，但对科技行业来说也没有什么不寻常的地方。然而，Snap报告的新奇之处在于跨部门数据细分。你会注意到黑人女性的比例(1.3%)低于黑人男性的比例(2.8%)。所有种族/民族类别都是如此。在所有不同的种族中，男性比女性多。再说一次，这不是好事，但不幸的是，这是意料之中的。", "note_en": "Below, we’ll explore the nuances and the significance of these lawsuits, as well as Snap’s track record with diversity and inclusion. Let’s get it.\n    CA Superior Court Judge Ethan P. Schulman heard arguments regarding a preliminary injunction that seeks to force Uber and Lyft to reclassify their drivers as employees\n In May, California Attorney General Xavier Becerra, along with city attorneys from Los Angeles, San Diego and San Francisco sued Uber and Lyft, alleging the companies gain an unfair and unlawful competitive advantage by misclassifying workers as independent contractors. The suit argues  Uber and Lyft are depriving workers of the right to minimum wage, overtime, access to paid sick leave, disability insurance and unemployment insurance. In June, plaintiffs  filed a preliminary injunction in an attempt to force Uber and Lyft to comply with AB 5 and immediately stop classifying their drivers as independent contractors.\n  This week, more than 100 people tuned in to the hearing regarding the preliminary injunction. The hearing, held on Zoom, initially was only able to hold just 100 people. But the interest in the case forced the court to increase its webinar capabilities to 500.  There hasn’t been a ruling yet, but Judge Schulman said we could expect one likely within a matter of days, rather than weeks.\n In the hearing, Schulman expressed how hard it is to determine the impact of a preliminary injunction in this case. For example, how Uber and Lyft would comply with the injunction is unknown, as are the economic effects on drivers, such as their ability to earn income, the hours they would be able to work and their eligibility for state benefits, Schulman said.\n “I feel a little bit like I’m being asked to jump into a body of water without really knowing how deep it is, how cold the water is and what’s going to happen when I get in,” he said.\n   The proposed injunction would cause irreparable injury to Lyft and Uber, and would actually cause massive harm to drivers and harm to riders.\n  We think the parties have drastically overstated precisely what they would need to do to be in compliance with the law.\n  Earlier in the week,   California Labor Commission sued Uber and Lyft in separate lawsuits . The goals of the separate suits are to recover the money that is allegedly owed to these drivers. By classifying drivers as independent contractors rather than employees, both Uber and Lyft have not been required to pay minimum wage, overtime compensation, nor have they been required to offer paid breaks or reimburse drivers for the costs of driving.\n What these lawsuits share is a core focus and argument, that Uber and Lyft are misclassifying their drivers as independent contractors and breaking the law.  These two companies have been sued many, many times for their labor practices, specifically as they pertain to the classification of their respective drivers as independent contractors. What’s different about the latest string of lawsuits is that they’re coming in light of a new law that went into effect in California earlier this year that is supposed to make it harder for these gig economy companies to classify their workers this way. The lawsuits are also coming from legislative bodies, rather than from drivers themselves.\n This moment has been a long time coming. Uber faced its first high-profile labor lawsuit back in 2013, when Douglas O’Connor and Thomas Colopy sued Uber for classifying them as 1099 independent contractors.   Uber settled the lawsuit several years later in 2019 by paying out $20 million to O’Connor and Colopy, as well as the other class members .\n     Snap, after declining to release diversity numbers for years, finally decided now was the time to make them public. Before we jump in, let’s take a quick look at Snap’s history with diversity.\n 2016:  Snap came under fire for a couple of filters that many people called out as being racist. The first was a   Bob Marley filter that basically enabled some sort of digital blackface . The second time it had to do with a lens that was supposed to be a take on anime characters. Instead,   there was an outcry about Snapchat enabling yellowface .\n 2017:  “We fundamentally believe that having a team of diverse backgrounds and voices working together is our best shot at being able to create innovative products that improve the way people live and communicate. There are two things we focus on to achieve this goal. The first—creating a diverse workplace—helps us assemble this team. We convene at the conferences, host the hackathons, and invest in the institutions that bring us amazing diverse talent every year. The second—creating an inclusive workplace—is much harder to get right, but we believe it is required to unleash the potential of having a diverse team. That’s because we believe diversity is about more than numbers. To us, it is really about creating a culture where everyone comes to work knowing that they have a seat at the table and will always be supported both personally and professionally. We started by challenging our management team to set this tone every day with each of their teams, and by investing in inclusion-focused programs ranging from community outreach to internal professional development. We still have a long and difficult road ahead in all of these efforts, but believe they represent one of our biggest opportunities to create a business that is not only successful but also one that we are proud to be a part of” –   Snap’s S-1\n 2018:  A former Snap engineer criticized the company for a “toxic” and “sexist” culture. Snap CEO Evan Spiegel later said the letter was “a really good wake-up call for us.”\n 2019:  Snap   hired its first head of diversity and inclusion , Oona King. King previously worked at Google as the company’s director of diversity strategy.\n June 2020: Spiegel reportedly said  in an all-hands meeting the company will not publicly release its numbers. Snap, however, disputed the report, saying it would release that data.\n August 2020: Snap releases its first-ever diversity report showing its global workforce is just 32.9% women, while its U.S. workforce is 4.1% Black, 6.8% Latinx and less than 1% Indigenous.\n Snap’s numbers are not good but also nothing out of the ordinary for the tech industry. What’s novel about Snap’s report, however, is the intersectional data breakdown. You’ll note that the representation of Black women (1.3%) is lower than the representation of Black men (2.8%). The same goes for all race/ethnicity categories. Across all distinct races, there are more men than women. Again, this is not good but it’s to be expected, unfortunately.", "posttime": "2020-08-08 04:28:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "snap,capital,诉讼", "title": "\n人力资本：优步和Lyft正在与法律作斗争，并简要回顾了Snap的多样性历史", "title_en": "\n\t\t\t\tHuman Capital: Uber and Lyft’s ongoing battle with the law and a brief history of diversity at Snap\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/human-capital-uber-and-lyft-legal-battle-and-a-brief-history-of-diversity-at-snap/", "via": "", "real_tags": ["snap", "capital", "诉讼"]}, {"category": "", "categoryclass": "", "imagename": "883d17f534bb4961a234245a07656fc7.jpg", "infoid": 1016939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在4月份，当美国大部分地区还在原地避难的时候，亚马逊做出了一个非同寻常的决定。在努力完成与疫情相关的订单激增之际，该公司对其网站进行了微妙的调整，以鼓励消费者减少购买，而不是增加购买。\n据“华尔街日报”报道，除了修改送货时间表和库存外，亚马逊还禁用了一项推荐功能，该功能可以显示经常一起购买的物品，比如电池，以便与购物车中已有的玩具搭配。这些变化以一种迂回的方式突显了数字零售商仔细调整网站以最大化访问者消费额的程度。这些策略在很大程度上是良性的，比如为超过一定数量的订单提供免费送货服务，但其他策略可能更具欺骗性，属于通常被称为“黑暗模式”的一类。\n奥米迪亚网络使黑暗模式成为可能。所有有线内容都是编辑独立的，由我们的记者制作。\n暗模式是一种数字设计元素，它操纵用户做出他们本来不会做出的决定，通常对公司有利。例如，如果肯定的小工具比拒绝的选项更大、更亮，那么你可能会把你的电子邮件地址交给营销信息。这个词是十年前由用户体验设计师Harry Brignull创造的，他创造了黑暗模式的类型学，其中许多模式利用了人类的心理弱点。最近，国会讨论了这个问题，去年国会审议了一项法案，该法案将规范如何使用暗色图案。它们在网络上随处可见，但一些最令人震惊的例子出现在购物网站上，那里的利润直接受到威胁。\n去年，普林斯顿大学(Princeton University)和芝加哥大学(University Of Chicago)的研究人员发表了一项研究，调查了大约1.1万个购物网站，发现其中超过11%的网站出现了黑色模式，其中包括Fashion Nova和J.C.Penney等大型零售商。研究人员发现，网站越受欢迎，就越有可能出现黑色图案。这篇论文的主要作者、普林斯顿大学的研究生阿鲁内什·马图尔(Arunesh Mathur)表示，网络上流行的黑色图案对人们有害-而且有可能影响的不仅仅是他们的钱包。\n“黑暗模式被用来破坏隐私，剥夺用户批判性反思自己行为的能力，”他说。“设计和行为科学已经变得武器化，只为了让在线零售商受益，并剥削用户。”\n在他们的研究中，Mathur和他的合著者开发了一个机器人，它扫描了数千个购物网站，寻找基于文本的黑色图案，他们将其组织成15种不同的类型。一种变化依赖于一种同龄人的压力。研究人员查看的数百个网站使用了活动通知，提醒访问者“萨莉刚刚买了这件衣服”，或者“现在有35个人在看这件东西。”他们发现，在一些网站上，这些信息是人为捏造的-只是几行代码，而不是真实消费者购买商品的迹象。这样做的目的是欺骗你，让你相信其他人对一件产品感兴趣，让你相信它值得购买。\n另一种类型的黑暗模式利用了“稀缺性偏见”，即人们倾向于将更高的价值放在供不应求的物品上。实体店利用了同样的倾向，声明一种产品“只在有限的时间内”可以买到。例如，亚马逊经常向购物者展示它有多少某种商品的库存。Etsy甚至警告人们，有多少其他客户的购物车里已经有一款产品，这意味着它可能很快就会不可用。在他们的研究中，Mathur和他的合著者发现，购物网站经常没有指定确切的库存数量，让你自己解释什么是“低库存”。更糟糕的是，在他们查看的16个网站上，研究人员发现，声明的库存数字完全是假的，而且是以“根据时间表反复出现的确定性模式”减少的。\n许多零售网站利用稀缺性偏见，使用倒计时计时器，这表明销售或特价将在一定时间后到期。研究人员在他们检查的140个购物网站上发现了欺骗性的计时器。在分配的时间过去后，一些人只是简单地重复了一遍。在其他网站上，即使在时钟用完后，折扣仍然有效。计时器在那里是为了敦促人们冲动地进行购买，而不是通知他们有合法到期日的销售。\n另一类暗图案则更为微妙。他们通过淡化其他选项来引导你做出特定的决定。例如，如果你提供你的电子邮件地址，一些购物网站就会提供折扣，并试图羞辱那些拒绝的人。他们经常会收到这样的信息：“不，谢谢，我喜欢付全价”，或者“不，谢谢，我讨厌省钱”，而不是简单的拒绝按钮。在一个网站上，研究人员发现，选择退出营销电子邮件的按钮呈灰色，“造成了一种错觉，即该选项不可用或被禁用，即使它可以点击。”一种类似的策略是向顾客提出诱骗性的问题。一些零售商引入双重否定来迷惑你，比如“如果你不想收到最新的电子邮件，就取消勾选。”\n马图尔和他的合著者无法检测到他们研究的网站上可能出现的每一种黑暗模式。因为他们只看文本，所以他们无法分析以视觉为主的变体，例如使用更大的字体大小或更亮的颜色来强调一个选项而不是另一个选项。研究人员还指出，黑暗模式是否故意误导并不总是很清楚，专家和用户可能会有合理的分歧-很难确定聪明的营销和彻头彻尾的欺骗之间的界限。\n再来看看亚马逊在春季暂时禁用的推荐系统，它向顾客推荐经常一起购买的商品。一方面，它会促使人们购买他们本来可能不会买的东西。但它也可能帮助一些购物者记住他们真正忘记的东西，比如与新球拍配套的网球。\n大多数暗色图案都是设计选择，但也有一些可以说只是骗局。在他们的论文中，研究人员发现了几个购物网站上的评论“来源不明”的例子，表明它们可能是假的。在一个案例中，他们在两个不同的电商网站上发现了不同客户姓名下的相同评论。伪造客户评论是一种普遍的做法，联邦贸易委员会(Federal Trade Commission)已经采取了一些行动来打击这种做法。\n购物网站上发现的许多黑暗模式都是从实体店使用的既定策略演变而来的，比如心理定价。例如，零售商通常将价格定在略低于整数的水平，欺骗你相信商品的价格比实际价格要低。但马图尔说，数字零售商拥有实体零售商所没有的优势。他说，在网上，他们可以很容易地“设计、测试和整合新的暗色图案”。重新安排商店是很困难的，但设计师可以像亚马逊在疫情早期所做的那样，迅速改变网站，甚至可以同时运行不同版本的网站。\n为了避免上当受骗，仔细注意零售商似乎鼓励你的行为，以及这些轻推给你的感觉。例如，对“闪电大甩卖”感到恐慌，或者看着不祥的倒计时计时器感到焦虑，都不是一件令人愉快的事情。您还可以使用工具来帮助您，如Icebox，这是一个浏览器扩展，它可以“冻结”结账页面，直到经过指定的时间段，防止您进行冲动购买。你也可以故意拒绝使用贝宝(PayPal)和苹果支付(Apple Pay)等自动支付选项，从而给你的购物体验增加更多摩擦。输入信用卡号码这一额外的步骤可能会让你有时间反思一下，购买是否真的值得--以及你是否真的想要这样做。\n🎙️收听“连线”，这是我们关于未来如何实现的新播客。收看最新剧集，订阅📩时事通讯，跟上我们所有节目的最新动态\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Back in April, when much of the United States was still  sheltering in place, Amazon made an extraordinary decision. As the company struggled to fulfill a  surge in orders related to the pandemic, it subtly tweaked its website to encourage consumers to buy  less, not more.\n In addition to modifying shipping timelines and inventory, Amazon disabled a recommendation feature that displays items frequently bought together, like batteries to go with the toy already in your cart,   The Wall Street Journal reported. The changes underscored, in a roundabout way, the extent to which digital retailers carefully calibrate their websites to maximize the amount that visitors spend. These tactics are often largely benign, such as offering free shipping for orders over a certain amount, but others can be more deceptive, falling into a category often referred to as “ dark patterns.”\n Dark Patterns is made possible by Omidyar Network. All WIRED content is editorially independent and produced by our journalists.\n Dark patterns are digital design elements that manipulate users into making decisions they otherwise wouldn’t, often to a corporation’s benefit. You might hand over your email address for marketing messages if the affirmative widget is larger and brighter than the option to decline, for instance. The term was coined a decade ago by user experience designer Harry Brignull, who created a  typology of dark patterns, many of which prey upon humanity’s psychological weaknesses. More recently, the issue has been taken up by Congress, which considered a  bill last year that would regulate how dark patterns are used. They’re found all over the web, but some of the most egregious examples are on  shopping sites, where profits are directly at stake.\n  Last year, researchers from Princeton University and the University of Chicago published a  study looking at roughly 11,000 shopping sites, and found dark patterns on more than 11 percent of them, including major retailers like Fashion Nova and J.C. Penney. The researchers discovered that the more popular the website, the more likely it was to feature dark patterns. Arunesh Mathur, a graduate student at Princeton and the lead author of the paper, says the prevalence of dark patterns online is harmful to people—and has the potential to impact more than just their wallets.\n “Dark patterns are being used to undermine privacy, and to rob users of their ability to critically reflect on their actions,” he says. “Design and behavioral science have become weaponized to solely benefit online retailers and to exploit users.”\n  For their study, Mathur and his coauthors developed a bot that scanned thousands of shopping sites looking for text-based dark patterns, which they organized into 15 different types. One variety relies on a sort of peer pressure. Hundreds of the websites the researchers looked at used activity notifications, alerting visitors that “Sally just bought this dress,” or “35 people are looking at this item right now.” They found that on some sites, the messages were artificially fabricated—merely lines of code, not indications of real consumers buying things. The goal is to dupe you into believing other people are interested in a product, convincing you it’s worth buying.\n  Another type of dark pattern takes advantage of “scarcity bias,” people’s tendency to place higher value on items in short supply. Brick-and-mortar stores capitalize on the same inclination by stating that a product is available for a “limited time only.” Amazon, for instance, often displays to shoppers how many of a certain item it has in stock. Etsy goes so far as to warn people how many other customers already have a product in their carts, implying it might soon be unavailable. In their study, Mathur and his coauthors found that shopping websites frequently don’t specify an exact stock quantity, leaving you to interpret for yourself what “low-stock” means. Even worse, on 16 websites they looked at, the researchers found that the stated stock numbers were entirely fake, and decreased in a “recurring deterministic pattern according to a schedule.”\n  Many retail websites exploit scarcity bias by using countdown timers, which indicate that a sale or special offer will expire after a certain amount of time. The researchers found deceptive timers on 140 of the shopping websites they examined. After the allotted time passed, some simply repeated again. On other sites, the discount was still available even after the clock had run out. The timers were there to urge people to impulsively make a purchase, rather than notify them about a sale with a legitimate expiration date.\n  Another class of dark patterns is more subtle. They work by steering you toward a specific decision by downplaying other options. Some shopping websites offer a discount if you provide your email address, for example, and attempt to shame those who refuse. They often have messages that say “No thanks, I like paying full price,” or “No thanks, I hate saving money,” instead of a simple decline button. On one site, the researchers found that the button to opt out of marketing emails was grayed out, “creating an illusion that the option is unavailable or disabled even though it can be clicked.” A similar tactic is to ask customers trick questions. Some retailers introduce double negatives to confuse you, like “Uncheck the box if you prefer not to receive email updates.”\n Mathur and his coauthors couldn’t detect every dark pattern that may have been present on the websites they studied. Because they looked only at text, they were unable to analyze varieties that are predominantly visual, such as using a larger font size or brighter colors to emphasize one option over another. The researchers also note that it’s not always clear whether a dark pattern is intentionally misleading, and experts and users may reasonably disagree—it can be hard to determine the line between clever marketing and outright deception.\n Take again the recommendation system Amazon temporarily disabled in the spring, for instance, which suggested to customers items that are frequently bought together. On one hand, it nudges people to buy stuff that they perhaps otherwise wouldn’t. But it also may help some shoppers remember things they genuinely forgot, like tennis balls to accompany a new racket.\n Most dark patterns are design choices, but others are arguably just fraud. In their paper, the researchers identified a handful of instances where reviews on shopping sites were of “uncertain origin,” indicating that they might be fake. In one case, they found the same reviews on two different ecommerce sites under different customer names. Faking customer reviews is a widespread practice, and one that the Federal Trade Commission has taken  some action to combat.\n Many of the dark patterns found on shopping websites  evolved from established tactics used in physical stores, such as psychological pricing. Retailers often set prices at slightly less than a round number, for instance, tricking you into believing that items cost less than they really do. But Mathur says digital retailers have advantages that brick-and-mortar ones don’t. Online, they can easily “design, test, and integrate new dark patterns,” he says. It’s difficult to rearrange a store, but designers can quickly alter a website, as Amazon did during the early stages of the pandemic, or even run different versions of it at same time.\n To avoid being duped, take careful note of what behaviors a retailer appears to be encouraging, and how those nudges make you feel. It’s not enjoyable to panic over a “flash sale,” for example, or get anxious watching an ominous countdown timer. You can also employ tools to help, like  Icebox, a browser extension that “freezes” checkout pages until a specified period of time has passed, keeping you from making impulse buys. You can also intentionally add more friction into your shopping experience by declining to use automatic payment options like PayPal and Apple Pay. The extra step of entering a credit card number may give you the time to reflect on whether that purchase is really worth it—and whether you genuinely wanted to make it in the first place.\n      🎙️ Listen to  Get WIRED, our new podcast about how the future is realized. Catch the  latest episodes and subscribe to the 📩  newsletter to keep up with all our shows\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-08-08 04:25:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网站,tricks", "title": "购物网站用来让你花更多钱的微妙伎俩", "title_en": "The Subtle Tricks Shopping Sites Use to Make You Spend More", "transed": 1, "url": "https://www.wired.com/story/amazon-online-retail-dark-patterns/", "via": "", "real_tags": ["网站", "tricks"]}, {"category": "", "categoryclass": "", "imagename": "d0beb70d39e6fae8d37973e3cae61df0.jpg", "infoid": 1016937, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首先，如果你(和我一样)错过了这个令人惊叹的实验，科学家们在甲虫的背部安装了微型摄像头，我想我不需要解释它有多酷。但你可能想知道…。为什么要这么做？多产的威斯康星大学研究员Shyam Gollakota和几名研究生对复制昆虫视觉的某些方面感兴趣，特别是处理过程和注意力方向的效率。\n相机背包的视场很窄，使用简单的机制来引导焦距，而不是一直处理大视场图像，节省了能源，更好地模拟了真实动物的视觉。“视觉对于交流和导航非常重要，但在这么小的范围内做到这一点是极具挑战性的。因此，在我们的工作之前，小型机器人或昆虫的无线视觉是不可能的，“Gollakota说。你可以在下面观看这些生物的活动-别担心，甲虫在背包后活得很长，很快乐。\n健康和医疗界总是在技术上取得有趣的进步，但这往往是相当小众的东西。最近几周的这两个项目稍微高调一些。\n其中之一是加州大学洛杉矶分校(UCLA)与苹果公司(Apple)联合进行的一项新研究，该研究特别是其智能手表为心律失常的研究提供了大量优秀的数据。在这种情况下，医生关注的是抑郁症和焦虑症，这两种疾病更难量化和检测。但通过使用Apple Watch、iPhone和睡眠监控器测量活动水平、睡眠模式等，可以收集大量标准化数据。", "note_en": "First off, if (like me) you missed  this amazing experiment where scientists attached tiny cameras to the backs of beetles, I don’t think I have to explain how cool it is. But you may wonder… why do it? Prolific UW researcher Shyam Gollakota and several graduate students were interested in replicating some aspects of insect vision, specifically how efficient the processing and direction of attention is.\n The camera backpack has a narrow field of view and uses a simple mechanism to direct its focus rather than processing a wide-field image at all times, saving energy and better imitating how real animals see. “Vision is so important for communication and for navigation, but it’s extremely challenging to do it at such a small scale. As a result, prior to our work, wireless vision has not been possible for small robots or insects,” said Gollakota. You can watch the critters in action below — and don’t worry, the beetles lived long, happy lives after their backpack-wearing days.\n  The health and medical community is always making interesting strides in technology, but it’s often pretty niche stuff. These two items from recent weeks are a bit more high-profile.\n One is a  new study being conducted by UCLA in concert with Apple, which especially with its smartwatch has provided lots of excellent data to, for example, studies of arrhythmia. In this case, doctors are looking at depression and anxiety, which are considerably more difficult to quantify and detect. But by using Apple Watch, iPhone and sleep monitor measurements of activity levels, sleep patterns and so on, a large body of standardized data can be amassed.", "posttime": "2020-08-08 04:00:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "综述,supercomputer,视觉", "title": "\n研发综述：超级计算机新冠肺炎洞察、离子蜘蛛网、AI之白", "title_en": "\n\t\t\t\tR&D Roundup: Supercomputer COVID-19 insights, ionic spiderwebs, the whiteness of AI\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/rd-roundup-supercomputer-covid-19-insights-ionic-spiderwebs-the-whiteness-of-ai/", "via": "", "real_tags": ["综述", "视觉"]}, {"category": "", "categoryclass": "", "imagename": "b75dbf3c611b64b039400f9c13d69c4a.jpg", "infoid": 1016935, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "云游戏正越来越成为一种东西，一种可以让你在设备上玩AAA游戏的游戏，而不管硬件规格是什么。如果你的设备可以播放视频，那么它很可能就可以在谷歌体育场(Google Stadia)上玩“红死救赎”(Red Dead Reemption)，或者在微软(Microsoft)的XCloud上玩Halo(从技术上讲，XCloud现在被称为“云游戏(Beta)”，与Xbox Game Pass Ultimate一起使用)。不过，如果你的设备是iPhone或iPad，那你就不走运了。苹果公司表示，这些应用程序违反了其App Store政策，将不允许进入苹果的“围墙花园”。\n创建App Store的初衷是为客户提供一个安全、值得信赖的地方来发现和下载应用程序，并为所有开发人员提供巨大的商机。在上架我们的商店之前，所有的应用程序都会根据一套相同的指导方针进行审查，这些指导方针旨在保护客户，并为开发人员提供公平和公平的竞争环境。\n我们的客户享受数以百万计的开发者提供的优秀应用程序和游戏，游戏服务完全可以在App Store上推出，只要他们遵循适用于所有开发者的同一套指导方针，包括单独提交游戏供审查，并显示在图表和搜索中。除了App Store，开发者还可以选择通过App Store上的Safari和其他浏览器通过网络接触到所有iPhone和iPad用户。\n苹果应用商店的宣传是，它有真人亲自审查每个应用的安全和质量，给用户一个单一的、值得信赖的地方来获取他们所有的应用。苹果希望单独批准这些游戏，并让用户通过App Store对它们进行单独评分。苹果引用的指导方针断然禁止在远程电脑上显示类似商店的界面，以及为基于云的应用程序显示瘦客户端，而Stadia和XCloud都与这两种界面相冲突。\n审批过程还确保开发者遵守苹果的开发者政策，其中包括对iOS上发生的所有交易的独家权利-苹果希望任何支付都通过自己的服务进行，在那里它可以从收入中分得一杯羹。App Store确实有一些需要支付的费用，比如所有这些人工应用程序审批人的工资、开发人员支持和托管成本，但据估计，苹果公司2019年从App Store收入中削减的金额为150亿美元。苹果正在赚取巨额利润。\n微软之前在iOS上对XCloud进行了测试版测试，听起来对苹果的指导方针相当不满。微软向The Verge发送了以下声明：\n我们针对iOS的Project XCloud预览应用程序的测试期已过。不幸的是，我们没有办法通过苹果应用商店将Xbox Game Pass旗舰版云游戏的愿景带给iOS上的游戏玩家。苹果是唯一一个拒绝消费者使用云游戏和Xbox Game Pass等游戏订阅服务的通用平台。而且，它一贯以不同的方式对待游戏应用程序，对非游戏应用程序应用更宽松的规则，即使它们包括互动内容。Xbox游戏通行证目录中的所有游戏都由独立的行业评级机构(如ESRB和地区同等机构)对内容进行评级。我们致力于寻找一条道路，将Xbox Game Pass旗舰版的云游戏带到iOS平台上。我们认为，客户应该是游戏体验的核心，游戏玩家告诉我们，他们想要在任何地方玩、连接和分享，无论他们在哪里。我们同意。\n微软声称，苹果对待游戏应用的态度是不同的，这是一个相当有力的论据，因为Xbox Game Pass作为一种随心所欲的游戏订阅服务，与Netflix或迪士尼+等视频流媒体服务并没有太大不同，这两家公司都可以在App Store上使用Xbox Game Pass。苹果对远程计算的厌恶可能被视为推动更一致、更高性能的原生应用程序(以及平台保护主义)，但在这些服务上推出的AAA级游戏要么不可能，要么作为原生iOS应用程序非常不切实际。例如，“红色死神救赎2”在个人电脑上占用150 GB的空间。\n另一方面，谷歌尚未对Stadia的iOS禁令做出回应。谷歌没有微软那么争辩，因为Stadia是一家商店--游戏除了每月10美元的4K分辨率费用外，还需要花钱，所以它不是网飞公司(Netflix)的XCloud那样的游戏。谷歌肯定比微软更习惯于这种方式，谷歌和苹果的App Store可以追溯到早期，比如2009年谷歌语音(Google Voice)因为提供了另一种打电话方式而被屏蔽了一年。从技术上讲，Stadia有一款iOS应用程序，但它只适用于Stadia奇怪的设置过程。谷歌的应用程序描述特别指出，你不能直接在iOS设备上使用Stadia应用程序玩游戏，但你可以在其他设备上使用该应用程序管理体育场。\n苹果的App Store政策最近经常出现在新闻中。像Basecamp和Eic Games这样的开发商批评了该公司从每一次App Store销售中抽成的做法。在欧盟，来自Spotify和Telegram等公司的投诉正在推动对苹果应用商店政策的反垄断调查。App Store今天的另一条新闻是Facebook的游戏应用-Facebook的Twitch.tv克隆-已经在iOS上删除了游戏部分。除了观看直播流，Android上的Facebook游戏还可以让你玩植物大战僵尸等HTML游戏，但苹果公司屏蔽了这款应用，因为它绕过了应用商店(App Store)。Facebook表示，它根据WWDC宣布的新的App Store上诉程序对这一决定提出上诉，但从未得到回应。\n苹果的许多政策都可以被辩解为推动开发人员选择更一致、更用户友好的选项，或者帮助支付App Store基础设施和审查过程的成本。然而，很难想出一个以用户为中心的防御措施来禁止云游戏。苹果不提供任何类似的服务，而且这些游戏也不可能通过其他方式在iOS上运行。你可以说，云游戏将意味着从苹果游戏生态系统购买的游戏减少，但Netflix也可以这样说，让人们的眼球从苹果的视频内容中移开。", "note_en": "Cloud gaming is increasingly becoming  a thing, one that lets you play AAA games on a device regardless of the hardware specs. If your device can stream a video, it can probably play  Red Dead Redemption on Google Stadia or   Halo on  Microsoft&#39;s xCloud (which is now technically called &#34; Cloud gaming (Beta) with Xbox Game Pass Ultimate&#34;). If your device is an iPhone or iPad, though, you&#39;re out of luck. Apple says these apps violate its App Store policies and will not be allowed into Apple&#39;s walled garden.\n  The App Store was created to be a safe and trusted place for customers to discover and download apps, and a great business opportunity for all developers. Before they go on our store, all apps are reviewed against the same set of guidelines that are intended to protect customers and provide a fair and level playing field to developers.\n Our customers enjoy great apps and games from millions of developers, and gaming services can absolutely launch on the App Store as long as they follow the same set of guidelines applicable to all developers, including submitting games individually for review, and appearing in charts and search. In addition to the App Store, developers can choose to reach all iPhone and iPad users over the web through Safari and other browsers on the App Store.\n Apple&#39;s App Store pitch is that it has real, live humans personally review each app for safety and quality, giving users a single, trusted place to get all their apps. Apple wants to approve these games individually and let users rate them individually through the App Store. The guidelines Apple cites flatly ban showing &#34;store-like interfaces&#34; on a remote computer and &#34;thin clients for cloud-based apps,&#34; which Stadia and xCloud both run afoul of.\n The approval process also makes sure developers adhere to Apple&#39;s developer policies, which include things like exclusive rights to all transactions that happen on iOS—Apple wants any payments to run through its own services, where it gets a cut of the revenue. The App Store does have some expenses that need to be paid for, like the salaries of all those human app approvers, developer support, and hosting costs, but estimates put Apple&#39;s cut of App Store revenues for 2019 at  $15 billion. Apple is making a massive profit.\n Microsoft previously had a beta test of xCloud on iOS, and it sounds pretty unhappy about Apple&#39;s guidelines. Microsoft sent the following statement to  The Verge:\n Our testing period for the Project xCloud preview app for iOS has expired. Unfortunately, we do not have a path to bring our vision of cloud gaming with Xbox Game Pass Ultimate to gamers on iOS via the Apple App Store. Apple stands alone as the only general purpose platform to deny consumers from cloud gaming and game subscription services like Xbox Game Pass. And it consistently treats gaming apps differently, applying more lenient rules to non-gaming apps even when they include interactive content. All games available in the Xbox Game Pass catalog are rated for content by independent industry ratings bodies such as the ESRB and regional equivalents. We are committed to finding a path to bring cloud gaming with Xbox Game Pass Ultimate to the iOS platform. We believe that the customer should be at the heart of the gaming experience and gamers tell us they want to play, connect and share anywhere, no matter where they are. We agree.\n Microsoft&#39;s claim that Apple &#34;treats gaming apps differently&#34; is a pretty strong argument considering, as an all-you-can-eat gaming subscription, Xbox Game Pass is not all that different from video streaming services like Netflix or Disney+, both of which are allowed on the App Store. Apple&#39;s dislike of remote computing could be viewed as a push for more consistent, performant native apps (as well as platform protectionism) but the AAA games being pushed over these services would either not be possible or would be very impractical as native iOS apps.  Red Dead Redemption 2, for instance, takes up  150GB on PC.\n  Google, on the other hand, hasn&#39;t responded to Stadia&#39;s iOS ban. Google has less of an argument than Microsoft since Stadia  is a store—the games cost money in addition to the $10-a-month fee for things like 4K resolution, so it isn&#39;t the &#34;Netflix for games&#34; that xCloud is. Google is also definitely more used to this than Microsoft is, with Google and Apple&#39;s App Store sparing going back to the early days, like when Google Voice was  blocked for a year in 2009 for offering an alternative way to make phone calls. There is  technically a  Stadia iOS app, but it is only for Stadia&#39;s strange setup process. Google&#39;s app description specifically says, &#34;You can’t use the Stadia app to play games directly on an iOS device, but you can use the app to manage Stadia on other devices.&#34;\n Apple&#39;s App Store policies have been in the news a lot lately. Developers like  Basecamp and  Epic Games have criticized the cut the company takes from every App Store sale. In the EU, Complaints from companies  like Spotify and  Telegram are fueling an anti-trust investigation into Apple App Store policies. The other App Store news today is that the Facebook Gaming app—Facebook&#39;s Twitch.tv clone—has come to iOS with  the gaming portion removed. In addition to viewing live streams, Facebook Gaming on Android lets you play HTML games like  Plants versus Zombies, but Apple blocked the app since it circumvented the App Store. Facebook says it appealed the decision under the new App Store appeals process  announced at WWDC, but it never got a response.\n Many of Apple&#39;s policies can be defended as pushing developers toward more consistent, user-friendly options, or helping to pay costs for the App Store infrastructure and review process. It&#39;s hard to come up with a user-centric defense for banning cloud-gaming, though. Apple doesn&#39;t offer anything like these services, and the games aren&#39;t really possible on iOS through other means. You could say cloud gaming will mean less games purchased from Apple&#39;s gaming ecosystem, but the same could be said of Netflix pulling eyeballs away from Apple&#39;s video content.", "posttime": "2020-08-08 03:34:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,apple,苹果,援引,won", "title": "苹果援引App Store指导方针，不让Stadia或XCloud进入iOS", "title_en": "Apple won’t let Stadia or xCloud into iOS, citing App Store guidelines", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/08/apple-wont-let-stadia-or-xcloud-into-ios-citing-app-store-guidelines/", "via": "", "real_tags": ["ios", "apple", "苹果", "援引", "won"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016932, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依赖您的支持：您知道您每月只需不到3美元就可以获得Phoronix Premium吗？今天就试着在一个页面上查看我们的网站无广告、多页文章，以及更多内容，这样我们就可以写更多的Linux硬件评论了。在最近对Intel Comet Lake Celeron和Pentium CPU与其他x86_64 Intel/AMD CPU进行基准测试之后，这里有一些有趣的事情……。看看这些预算英特尔CPU在各种处理器基准测试中与Raspberry PI 4的比较情况，都是在Debian Linux上测试的。赛扬测试的部分是42美元的G5900处理器，双核3.4 GHz处理器，2MB高速缓存和UHD显卡610。Comet Lake Pentium是奔腾G6400，大约75美元的CPU，它是双核加上超线程，时钟频率为4.0 GHz，带有4MB L3缓存和超高清显卡610。同时，Raspberry Pi 4 Model B在其Broadcom SoC中采用了四核1.5 GHz ARMv8设计。Raspberry PI 4当然在价值上领先，2 GB版本的整个单板计算机的零售价为35美元以上。而即使是赛扬，仅CPU的价格也要高出几美元。树莓派4也有一个明显较低的功率包络与这些低端的彗星湖部件，每个都有58瓦的TDP。性能/美元的结果没有提供这种快速摊牌，尽管由于广泛的可能的主板组合，等等，这些彗星湖的CPU，但足以说树莓派4来的便宜得多。“。Raspbian/Debian Linux10使用Phoronix测试套件在三种配置下，在各种以CPU为中心的基准测试下进行了测试。如果你对树莓派4与英特尔最新的低端赛扬和奔腾相比有什么好奇的话，那你就知道了。彗星湖处理器。如果想要查看您自己的Linux系统如何比较，只需安装Phoronix Test Suite并运行phoronix-test-Suite基准测试2007316-NE-RPINTEL8536。", "note_en": "We Rely On Your Support: Did you know that you can get  Phoronix Premium for under $3 per month? Try it today to view our site  ad-free, multi-page articles on a single page, and more while the proceeds allow us to write more Linux hardware reviews.   Following the recent  Intel Comet Lake Celeron and Pentium CPU benchmarking against other x86_64 Intel/AMD CPUs, here was a bit of fun... Seeing how these budget Intel CPUs compare to a Raspberry Pi 4 in various processor benchmarks, all tested on Debian Linux.\r   The Celeron part tested was the G5900 as a $42 processor as a dual-core 3.4GHz processor with 2MB cache and UHD Graphics 610.\r   The Comet Lake Pentium was the Pentium G6400 as a ~$75 CPU that is dual core plus Hyper Threading and clocked at 4.0GHz with a 4MB L3 cache and UHD Graphics 610.\r   The Raspberry Pi 4 Model B meanwhile has a quad-core 1.5GHz ARMv8 design for its Broadcom SoC.\r   The Raspberry Pi 4 certainly leads in value with the 2GB version retailing for $35+ for the entire single board computer while even the Celeron costs a few dollars more for just the CPU. The Raspberry Pi 4 also has a significantly lower power envelope with these low-end Comet Lake parts each having a 58 Watt TDP. Performance-per-dollar results are not provided for this quick showdown though due to the wide number of possible motherboard combinations, etc, with these Comet Lake CPUs but suffice to say the Raspberry Pi 4 comes in much cheaper.\r    Raspbian/Debian Linux 10 was tested in the three configurations under a variety of CPU-focused benchmarks with the  Phoronix Test Suite.\r                                                          There you have it if curious how the Raspberry Pi 4 stacks up against Intel&#39;s latest bottom-end Celeron and Pentium &#34;Comet Lake&#34; processors. If wanting to see how your own Linux system(s) compare, simply install the Phoronix Test Suite and run  phoronix-test-suite benchmark 2007316-NE-RPINTEL8536.", "posttime": "2020-08-08 03:33:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,raspberry-pi,奔腾,pi,cpu", "title": "树莓PI 4与英特尔最新的赛扬奔腾CPU相抗衡", "title_en": "A Raspberry Pi 4 Performs Against Intel's Latest Celeron, Pentium CPUs", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry", "via": "", "real_tags": ["英特尔", "奔腾", "pi", "cpu"]}, {"category": "", "categoryclass": "", "imagename": "248765fb0398fa7752c52ec84cfefd87.jpg", "infoid": 1016931, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Reddit上的数十个讨论组-包括那些致力于国家橄榄球联盟(National Football League)、旧金山49人队(San Francisco 49 Ers)和大猩猩(Gorillaz)的讨论组-在周五上午的大规模收购狂潮中受到打击，利用这些子Reddits传播宣传特朗普总统的信息。\n被劫持的账户总共有数千万名会员。由14.8万名成员组成的Subreddit SuperNatural致力于同名电视节目，上面印有支持特朗普的图片和口号。自那以后，Reddit人员已将版主账户恢复为其合法所有者。上图是收购还在进行时subreddit的外观。\nReddit人员发布了这篇帖子，标题为：正在发生的mod帐户泄露事件。然后Reddit人员警告说，版主帐户正在被泄露，并被用来破坏Subreddits。它要求受影响的Subreddits的版主在回复中报告它们。在这篇帖子上线的时候，这份名单包括：\nReddit官员发表了以下声明：“与一系列遭到破坏的社区有关的调查正在进行中。看起来攻击的来源是被泄露的版主账户。我们正在努力锁定这些账户，恢复受影响的社区。“。\n这份声明没有回答关于受影响的次级红人总数的问题。该公司也没有回应我关于劫机责任人是如何实施劫机的询问。周五早上的事件报告建议版主使用双因素身份验证来保护他们的账户。这可能意味着接管的账户是使用数据库泄露的密码被攻破的。如果没有2FA的好处，在Reddit上重复使用的泄露密码就足以让攻击者访问这些账户。\n一些读者抱怨说，2FA干扰了他们使用脚本管理Subreddits的能力。\n在这篇帖子上线时，大多数或所有受影响的账户要么已经恢复并恢复到以前的状态，要么因为违反服务条款而被禁止。\n周五的事件发生三周前，黑客劫持了名人、高管和名人的账户，并在推特上向数千万粉丝发布了比特币骗局的链接。自那以后，Twitter表示，在一名员工被手机钓鱼攻击欺骗后，该公司失去了对内部系统的控制。检察官已经改变了一名17岁的少年，因为他是这一特技的幕后策划者。", "note_en": "Dozens of discussion groups on Reddit—including those dedicated to the National Football League, the San Francisco 49ers, and the Gorillaz—were hit in a Friday morning mass takeover spree that used the subreddits to spread messages promoting President Trump.\n The hijacked accounts had tens of millions of combined members. The 148,000-member subreddit  Supernatural, dedicated to the TV show by the same name, was emblazoned with pro-Trump images and slogans. Reddit personnel have since restored the moderator account to its rightful owner. The image above is how the subreddit appeared when the takeover was still active.\n Reddit personnel published  this post captioned, &#34;Ongoing incident with compromised mod accounts.&#34; Reddit personnel then warned that moderator accounts were being compromised and used to vandalize subreddits. It asked moderators of affected subreddits to report them in responses. At the time this post when live, the list included:\n   Reddit officials issued the following statement: “An investigation is underway related to a series of vandalized communities. It appears the source of the attacks were compromised moderator accounts. We are working to lock down those accounts and restore impacted communities.”\n The statement didn&#39;t answer a question seeking the total number of affected subreddits. The company also didn&#39;t respond to my inquiry on how those responsible for the hijackings carried them out. Friday morning’s incident report advised moderators to protect their accounts with two-factor authentication. That may mean that taken over accounts were breached using passwords exposed in database breaches. Without the benefit of 2FA, compromised passwords that are reused on Reddit would be enough for attackers to access the accounts.\n Several readers complained that 2FA interferes with their ability to use scripts that they use to manage subreddits.\n At the time this post went live, most or all of the affected accounts had been either restored and reverted back to their previous condition or  banned for terms of service violations.\n Friday&#39;s incident comes three weeks after hackers hijacked the accounts of celebrities, executives, and celebrities and  tweeted links to a bitcoin scam to tens of millions of followers. Twitter has since said it  lost control of its internal systems after an employee was tricked by a  phone-based phishing attack. Prosecutors have  changed a 17-year-old with being the mastermind behind the stunt.", "posttime": "2020-08-08 03:08:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "宣传,hijacking,账户", "title": "大规模劫持狂欢接管Subreddits宣传唐纳德·特朗普", "title_en": "Mass hijacking spree takes over subreddits to promote Donald Trump", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/08/mass-hijacking-spree-takes-over-subreddits-to-promote-donald-trump/", "via": "", "real_tags": ["宣传", "hijacking", "账户"]}, {"category": "", "categoryclass": "", "imagename": "f1d56bfdf67054b8b26c2de6f7a77768.jpg", "infoid": 1016930, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国地区法院法官阿纳丽莎·托雷斯(Analisa Torres)指出，Netflix等流媒体服务的崛起是她做出决定的原因之一：\n自20世纪40年代以来，不受这些法令约束的电影发行商已经进入市场-最值得注意的是华特迪士尼公司，该公司是2018年领先的电影发行商，国内票房收入约为30亿美元。…。其他不受法令约束的电影发行商包括狮门影业(2018年上映的20部电影)、焦点特写(13部电影)、路边景点(12部电影)和STX娱乐公司(10部电影)。…。没有一家互联网流媒体公司-Netflix、亚马逊(Amazon)、苹果(Apple)和其他公司-制作和发行电影不受这些法令的约束。因此，其余被告受到不适用于其竞争对手的法律限制。\n目前还不清楚这一决定是否会对大型流媒体服务产生任何影响。托雷斯承认，即使这些法令不适用于特定的制片厂，它们也“充当了可接受行为的标尺，对不是这些法令的行业演员施加了规范的影响。”\n但很难想象2020年会有人认为认真进入戏剧行业是个好主意。甚至在新冠肺炎疫情迫使大多数影院关闭之前，国内的上座率就在下降。\n在此之前，Netflix和亚马逊对拥有影院表现出了一些兴趣。据报道，亚马逊在几年前就在竞购Landmark影院连锁店，今年早些时候，有关它可能收购AMC的传言推动这家影院连锁店的股价飙升-但目前还没有宣布收购，与此同时，AMC似乎已经稳定了财务状况。\n与此同时，Netflix去年签署了纽约市巴黎剧院的长期租约，它可能也对洛杉矶的埃及剧院感兴趣。然而，这些似乎不太像更广泛的戏剧战略的第一步，更像是一次性交易，旨在让流媒体进入可以用于精彩首映式和其他放映的地点。\n这项裁决的真正影响可能是在其他领域，比如取消(在两年的日落期之后)对大宗预订和巡回交易的限制。如果没有这些限制，制片厂可能会要求希望获得有利可图的特许经营权的影院也可以放映他们不太受欢迎的电影。", "note_en": "U.S. District Court Judge Analisa Torres cited the rise of streaming services like  Netflix   as one of the reasons for  her decision:\n Motion picture distributors that are not subject to the Decrees have entered the market since the 1940s — most significantly, The Walt Disney Company, the leading movie distributor in 2018 with about $3 billion in domestic box office revenues … Other motion picture distributors not subject to the Decrees include Lionsgate (20 films released in 2018), Focus Features (13 films), Roadside Attractions (12 films), and STX Entertainment (10 films). …None of the internet streaming companies — Netflix, Amazon, Apple and others — that produce and distribute movies are subject to the Decrees. Thus, the remaining Defendants are subject to legal constraints that do not apply to their competitors.\n  It’s not clear whether this decision will have any impact on the big streaming services. Torres acknowledged the argument that even when the decrees did not apply to a given studio, they “serve as a yardstick of acceptable behavior, exerting a normative effect on industry actors who are not parties to them.”\n But it’s hard to imagine anyone in 2020 thinking it’s a good idea to seriously get into the theatrical business.  Domestic attendance was on the decline, even before the COVID-19 pandemic forced most theaters to close.\n Netflix and  Amazon   have shown some interest in owning theaters before this.  Amazon was reportedly in the running to acquire in the Landmark theater chain a couple years ago, and rumors that it might acquire AMC  sent the theater chain’s stock shooting up earlier this year — but no acquisition has been announced, and in the meantime  AMC appears to have stabilized its finances.\n Netflix, meanwhile,  signed a long-term lease for New York City’s Paris Theatre last year, and it may also have been interested in  the Egyptian Theatre in Los Angeles. However, these seem less like the first steps in a broader theatrical strategy and more like one-off deals designed to give the streamer access to locations that it can use for fancy premieres and other screenings.\n The real impact of the ruling may be in other areas, like the elimination (after a two-year sunset period) of restrictions on block booking and circuit dealing. Without those restrictions, studios could potentially require theaters that want access to a lucrative franchise title to screen their less popular films as well.", "posttime": "2020-08-08 03:07:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,电影,法官,judge", "title": "\n联邦法官批准终止同意法令，阻止电影制片厂拥有影院", "title_en": "\n\t\t\t\tFederal judge approves ending consent decrees that prevented movie studios from owning theaters\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/goodbye-paramount-consent-decrees/", "via": "", "real_tags": ["ios", "电影", "法官", "judge"]}, {"category": "", "categoryclass": "", "imagename": "25f169cee0afde904de08ec25a12f853.jpeg", "infoid": 1016928, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透旧金山8月23日电-Facebook周四表示，在多次违反公司政策后，已将致力于QAnon阴谋论网络的最大公共群组之一撤下.。\nFacebook的一位女发言人表示，这个名为官方Q/Qanon的群拥有近20万名成员，在多个个人帖子因跨越欺凌和骚扰、仇恨言论和可能导致伤害的虚假信息的界限而被删除后，该群已被删除。\n这位不愿透露姓名的女发言人说，Facebook周二采取了这一行动，并正在监控其他QAnon群组，因为它正在加强该地区的执法。\nQAnon的追随者支持一系列相互交织的信念，这些信念基于某人声称对特朗普政府有特殊内幕了解的匿名网络帖子。其核心原则是，唐纳德·特朗普(Donald Trump)总统正在秘密打击包括知名民主党人在内的儿童性掠夺者阴谋。\n尽管联邦调查局已经确认QAnon是可能鼓励极端主义暴力的边缘运动之一，但越来越多的竞选公职的共和党人称赞了这种松散的联系。\n今年5月，Facebook删除了一个规模较小的QAnon账户网络，这些账户推送了关于这种致命冠状病毒的虚假信息。\nTwitter上个月更进一步，称将删除或限制数千个Qanon账户。", "note_en": "SAN FRANCISCO (Reuters) - Facebook said on Thursday it had removed one of the largest public groups devoted to the QAnon web of conspiracy theories after repeated violations of the company’s policies.\n The group, called Official Q/Qanon and with nearly 200,000 members, had been deleted after multiple individual postings were removed for crossing the lines on bullying and harassment, hate speech, and false information that could lead to harm, a Facebook spokeswoman said.\n The spokeswoman, who declined to be identified, said Facebook took the action on Tuesday and was monitoring other QAnon groups as it strengthens enforcement in the area.\n QAnon followers espouse an intertwined series of beliefs based on anonymous web postings from someone claiming special insider knowledge of the Trump administration. The core tenet is that President Donald Trump is secretly fighting a cabal of child-sex predators including prominent Democrats.\n Though the FBI has identified QAnon as among fringe movements likely to encourage extremist violence, a growing number of office-seeking Republicans have praised the loose association.\n In May, Facebook removed a smaller network of QAnon accounts that pushed false information about the deadly coronavirus.\n Twitter last month went further, saying it would delete or restrict many thousands of QAnon accounts.", "posttime": "2020-08-08 03:06:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,仇恨,repeated,qanon", "title": "Facebook表示，在多次违反其仇恨言论和其他政策后，它删除了拥有约20万成员的最大公共QAnon阴谋组之一", "title_en": "Facebook says it removed one of the largest public QAnon conspiracy groups, with ~200K members, after repeated violations of its hate speech and other policies", "transed": 1, "url": "https://www.reuters.com/article/us-facebook-qanon/facebook-removes-one-of-largest-qanon-conspiracy-groups-after-false-posts-idUSKCN2530H6", "via": "", "real_tags": ["facebook", "仇恨", "repeated", "qanon"]}, {"category": "", "categoryclass": "", "imagename": "b6dbda4b90926f4795caaff1c73695e9.jpg", "infoid": 1016926, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名新泽西州男子因在推特上试图确认一名警察的身份而面临重罪指控。据“华盛顿邮报”报道，另有四人因转发这条推文而面临重罪指控。\n凯文·阿尔法罗(Kevin Alfaro)6月份参加了新泽西州纽约郊区纳特利(Nutley)举行的黑人生命也是命(Black Lives Matter)抗议活动。他拍了一张蒙面警察的照片，并在推特上写道，如果有人知道这个婊子是谁，就把他的信息发布到这条推文下。\n在GoFundMe支付律师费的GoFundMe中，阿尔法罗解释说，在黑人生命也是命的示威活动期间，他受到了反抗议者的身体威胁。他试图辨认一名警官，此人似乎是其中一名反抗议者的朋友，阿尔瓦拉奥认为这名抗议者是明目张胆的种族主义者。\n起初，阿尔法罗的推文几乎没有受到关注。它只被转发了几次，最终被删除。但它引起了纳特利警察局的注意。7月中旬，阿尔法罗和其他人被控网络骚扰。这是四级重罪，最高可判处18个月监禁。\n我只是转发了一条推特，因为我觉得，和任何人一样，我们应该让我们的警官承担责任，其中一名被告杰嘉娜·西萨克(Gegana Sziszak)在GoFundMe的一次活动中写道，以支付她的律师费。我从来没有听说过转发推特是犯罪，更不用说重罪了。\n针对Sziszak的起诉书声称，这条推文让这名警官担心自己、家人和财产会受到伤害。\nSziszak写道，作为一个20岁的年轻人，我只是转发了一条推文来帮助我的朋友，现在我面临着放弃我的职业生涯、服刑和有记录的风险。\nSziszak的律师艾伦·佩鲁顿(Alan Peyrouton)在接受ARS采访时表示，Sziszak的转发明显受到第一修正案的保护。我从来没有遇到过这样的情况。\n佩鲁顿指出，第三巡回法院(包括新泽西州在内的联邦司法巡回法院)的案例保护了公职人员的拍照权利。他还指出，有合法的、非骚扰的理由来寻找关于警察的身份信息。例如，阿尔法罗可能有兴趣对这名警官的行为提出正式投诉。\n圣克拉拉大学(Santa Clara University)的互联网法律学者埃里克·戈德曼(Eric Goldman)告诉Ars，仅仅转发原始推文的人可能会有另一个法律辩护：通信体面法案(Communications Decency Act)第230条。\n第230条最常被像Twitter这样的在线服务提供商引用，以保护他们免除对用户内容的责任。但第230条规定，任何在线服务的提供者或用户都不能对另一个人的内容负责。如果Sziszak只是转发了Alfaro的帖子，她应该享有与Twitter相同的豁免权。", "note_en": "A New Jersey man is facing felony charges for a tweet seeking to identify a police officer. Four others are facing felony charges for retweeting the tweet, the Washington Post  reports.\n Kevin Alfaro was attending a Black Lives Matter protest in the New York suburb of Nutley, New Jersey in June. He snapped a photo of a masked police officer and  tweeted &#34;If anyone knows who this bitch is throw his info under this tweet.&#34;\n In a  GoFundMe to cover his legal fees, Alfaro explained that he had been &#34;physically threatened&#34; by counter-protesters during the Black Lives Matter demonstration. He was trying to identify an officer who seemed to be friends with one of the counter-protestors, who Alvarao considered a &#34;blatant racist.&#34;\n Initially, Alfaro&#39;s tweet got little attention. It was retweeted only a handful of times and was eventually deleted. But it caught the attention of the Nutley Police Department. In Mid-July, Alfaro and others were charged with  cyber-harassment. That&#39;s a fourth-degree felony that carries penalties up to 18 months in prison.\n &#34;I simply retweeted because I feel that just as with anyone we should hold our officers accountable,&#34;  wrote Georgana Sziszak, one of the defendants, in a GoFundMe campaign to cover her legal fees. &#34;I never heard of retweeting a tweet being a crime let alone a felony.&#34;\n The complaint against Sziszak claims that the tweet caused the officer to &#34;fear that harm will come to himself, family, and property.&#34;\n &#34;As a 20 year old that simply retweeted a tweet to help my friend, I am now at risk of giving up my career, serving time, and having a record,&#34; Sziszak wrote.\n  Sziszak&#39;s retweet is &#34;clearly protected by the First Amendment,&#34; said  Alan Peyrouton, Sziszak&#39;s attorney, in an interview with Ars. &#34;I&#39;ve never had a case like this.&#34;\n  Peyrouton points out that there&#39;s  caselaw in the Third Circuit—the federal judicial circuit that encompasses New Jersey—protecting the right to photograph public officials. He also points out that there are legitimate, non-harassing reasons to seek identifying information about a police officer. For example, Alfaro could have been interested in filing a formal complaint about the officer&#39;s conduct.\n And Eric Goldman, an Internet law scholar at Santa Clara University, tells Ars that people who merely retweeted the original tweet are likely to have another legal defense available: Section 230 of the Communications Decency Act.\n Section 230 is most often invoked by online service providers like Twitter to shield them against liability for user content. But  Section 230 says that &#34;no provider  or user&#34; of an online service can be held responsible for another person&#39;s content. If Sziszak merely retweeted Alfaro&#39;s post, she should enjoy the same immunity Twitter does.", "posttime": "2020-08-08 02:41:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,被控,felonies,sziszak", "title": "五人因在推特上或转发警察照片而被控重罪", "title_en": "Five charged with felonies for tweeting or retweeting a cop’s photo", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/08/five-charged-with-felonies-for-tweeting-or-retweeting-a-cops-photo/", "via": "", "real_tags": ["推特", "被控", "felonies", "sziszak"]}, {"category": "", "categoryclass": "", "imagename": "e368668fcc492034389498f461c0eafa.png", "infoid": 1016925, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其中最引人注目的是副驾驶。Copilot允许两个用户同时“驱动”演示文稿，一个用户说话并且可见，另一个用户运行该演示文稿的控件、切换幻灯片、播放视频和/或改变外观。\n但让我为那些在过去几周里错过了嗯，嗯，新闻的人(可以理解)提供支持。\n如果Twitch和制作团队一起参加一个深夜脱口秀节目，而他们由此产生的爱子是在公司演示中，那么这个孩子就会被称为嗯哼。\n从本质上说，用户可以将他们屏幕上的虚拟演示从盒子里的头部(有时也可以是屏幕共享的幻灯片)提升到更优雅的制作。\n嗯，用户可以从PIP(画中画)窗口运行他们的演示文稿，在屏幕上更改自己的大小，添加有趣的滤镜和效果，所有这些都可以在运行中完成。\n尽管这可能很有趣，但在进行现场演出的同时还要做很多事情，这就是为什么MMM要推出Copilot。Copilot为用户提供了让他们自己的执行制片人帮助他们进行通话的机会，使演讲者能够专注于他们所说的内容，而不是mmhm控件。\n由于Copilot是多人游戏，从现在开始，测试版用户每天可以邀请一个朋友到该平台。\n除了Copilot，mmHMM还推出了动态房间，让用户能够创建独特的背景，选择颜色、形状等来拥有自己的“模板”。\n该产品总共筹集了450万美元，红杉资本(Sequoia)领衔，人力资本(Human Capital)、比兹·斯通(Biz Stone)、贾娜·梅塞施密特(Jana Messerschmidt)(#Angels)、乐天(Rakuten)、三木谷浩史(Hiroshi Mikitani)、孙泰三(Mistletoe)、布里安·基梅尔(Brianne Kimmel)(worklife.vc)、Digital Garage、Premired Ventures、凯文·希斯特罗姆(Kevin Systrom，IG)、迈克·克里格(Mike Krieger，IG)、琳达·科兹洛夫斯基(Linda Kozlowski，蓝色围裙)、朱莉", "note_en": "Most notable among them is Copilot. Copilot allows two users to “drive” the presentation simultaneously, with one user speaking and visible and the other running the controls of that presentation, switching slides, playing video and/or changing the look and feel.\n But let me back up for those of you who’ve (understandably) missed the mmhmm news in the past few weeks.\n   If Twitch got together with the production team for a late night talk show, and their resulting love child was into corporate presentations, that baby would be called mmhmm.\n Essentially, users can elevate their on-screen virtual presentations from a head in a box (or sometimes a screen-shared slide deck) to a more elegantly produced affair.\n mmhmm users can run their presentation from a PIP (picture-in-picture) window, change the size of themselves on screen, add interesting filters and effects and do it all on the fly.\n  And as fun as that may be, there is a lot involved in running a live production while also giving a presentation, which is why mmhmm is introducing Copilot. Copilot offers users the chance to have their very own executive producer help them with their call, allowing the presenter to focus on what they’re saying instead of the mmhmm controls.\n Because Copilot is multiplayer, beta users can invite one friend per day to the platform starting now.\n Alongside Copilot, mmhmm is also launching Dynamic Rooms, which gives users the ability to create a background unique to them, selecting the colors, shapes, etc. to have your own “template.”\n The product has raised a total of $4.5 million led by Sequoia, with participation from Human Capital, Biz Stone, Jana Messerschmidt (#ANGELS), Hiroshi Mikitani (Rakuten), Taizo Son (Mistletoe), Brianne Kimmel (worklife.vc), Digital Garage, Precursor Ventures, Kevin Systrom (IG), Mike Krieger (IG), Linda Kozlowski (Blue Apron), Julia and Kevin Hartz (Eventbrite) and Lachy Groom (Stripe).", "posttime": "2020-08-08 02:40:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,软件,phil,virtual", "title": "\n菲尔·利宾(Phil Libin)的虚拟演示软件Mmhm发布了Beta 2", "title_en": "\n\t\t\t\tmmhmm, the virtual presentation software from Phil Libin, launches its Beta 2\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/mmhmm-the-virtual-presentation-software-from-phil-libin-launches-its-beta-2/", "via": "", "real_tags": ["发布", "软件", "phil", "virtual"]}, {"category": "", "categoryclass": "", "imagename": "bb9de8a21f07429eeb8efdde2a77854f.jpg", "infoid": 1016924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从1.5年前推出我们的会员产品Extra Crunch以来，我们应社区的要求添加了许多新功能。这包括改进登录稳定性，推出视频问答系列Extra Crunch Live，推出超过12个合作伙伴福利，以及修改我们的时事通讯。我们还听取了社区的意见[…]", "note_en": "Since launching our membership product Extra Crunch 1.5 years ago, we’ve added a number of new features at the request of our community. This includes improvements to login stability, introducing the video Q&A series Extra Crunch Live, launching over a dozen Partner Perks and revamping our newsletters. We also listened to the community for where […]", "posttime": "2020-08-08 02:40:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "调查,extra,推出", "title": "\n调查：告诉我们你对额外嘎吱作响的看法", "title_en": "\n\t\t\t\tSurvey: Tell us what you think of Extra Crunch\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/survey-tell-us-what-you-think-of-extra-crunch/", "via": "", "real_tags": ["调查", "extra", "推出"]}, {"category": "", "categoryclass": "", "imagename": "236f9692751d2f61879f88800c9d930d.jpg", "infoid": 1016923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首先，作为一点背景：SBIR是一个庞大的项目网络，分布在十几个联邦机构和军方，大约40年前成立，目的是帮助任何有伟大想法但几乎没有机会获得资金的美国人摆脱困境。\n随着时间的推移，它已经增长到令人印象深刻的比例，2019年的总奖项预算接近33亿美元。需要明确的是，这笔钱基本上是打算赠送给合格的获奖者，而不是作为许可费、订单或股权；这些现金奖励从数十万美元到100多万美元不等，附带的条件非常少。\n这就是说，这并不是说你只是把手伸进SBIR曲奇罐子里，然后拿出一百万美元。就像任何涉及联邦政府的事情一样，这是一个过程，而不是一个短暂或简单的过程。后面有大量的官方教程，但本文(根据项目官员的提示)应该会帮助您上手。\n应该指出的是，这不是唯一一个与科技相关的政府拨款计划，但它是规模最大、范围最广的，而且可以说是像您这样的小企业主和发明家最容易获得的-或者说，一旦你阅读了本指南，它就会是。只要准备好投入一些工作就行了。\n你应该知道的第一件事是，SBIR计划的运作考虑到了一种特定的(尽管并不罕见)企业家类型：他们需要资金来开发和商业化一项新技术或知识产权，但还没有达到可以吸引传统投资的阶段，对于普通贷款来说，风险或成本太高了。\nSBIR奖励(一些机构提供“资助”，其他机构提供“合同”，但你可以直接说“奖励”)基本上是现金，将一些东西从创意转化为商业化。它们不是用来支付制造业首付、偿还较早贷款或其他杂项运营成本的。\n如果你的公司或发明需要帮助来覆盖研发，从实验到工作原型，或者从原型到商业化，你可能是一个很好的人选。不管是软件还是硬件，你的第一个产品还是你的第十个产品-只要你是一家自有的美国小企业，你正在建立一项需要一些资金才能启动的新技术就行了。\n该计划的第二个鲜为人知的好处是，如果您被选中，您的公司有资格跳过一些政府采购流程，否则这些流程将需要有竞争力的报价。如果你把美国政府想象成未来的潜在客户，单是这一好处可能就值得付出辛劳。\n程序通常分为几个阶段，您可能希望按顺序执行。\n第一阶段是为演示概念证明的人-从白板到原型的任何地方。奖励金额从数万美元到20万美元不等，期限为6到12个月，具体取决于具体的开发成本。\n第二阶段是针对那些对已证实的概念进行更深入研发的人，在两年内可能会有超过100万美元的资金；正如你所看到的，这是一项长期的行动，而不是一次快速的现金攫取。\n第三阶段是项目可能过渡到实际付费合同和采购的阶段-但当您到达阶段时，您可以担心这一点。\n换句话说，虽然一旦你拿到钱就几乎没有什么收获，但这个项目并不是一个免费的项目。如果这听起来像是一场比赛，而且你愿意做一些跑腿的工作，那就继续吧。\n这就是事情开始变得复杂的地方。实际上不只有一个SBIR项目，还有十几个，分布在同样多的联邦机构，从国防和能源到NASA和NOAA。每个项目都有自己的预算和申请流程-这使得这一点已经足够复杂，以至于许多寻求拨款的人都从它身上弹了出来(或者关闭了这个选项卡)。不过，别担心，事情没有听起来那么糟糕。你有三件事要做。\n这其实是一件好事。想想你的技术的“客户”是谁：你的火箭发动机对卫生和公共服务不会有太大用处；无人机的防撞系统可能对国防部有好处，但它也可能以不同的方式对能源部有帮助。你的技术具体实现了什么，为什么它会对特定一个机构的工作有所帮助？这应该有助于大大缩小范围-但不要害怕稍微跳出框框思考一下。你可能会对其中一些部门的所作所为感到惊讶。\n其次，每个机构都有它正在寻找的具体东西，无论是现在还是永久的。\n这意味着没有太多的猜测。这些数量众多、种类繁多的“邀请函”范围从一般感兴趣的领域到非常详细的请求，都是公开列出的(见下面的链接)，通常可以通过主题进行搜索或排序。例如，一旦你决定你的技术可能对EPA或NOAA有用，就看看他们的邀请函-它们会定期更新，尽管时间表根据机构的不同而不同-看看是否有人已经在要求你提供什么，或者使用了类似的关键字。你可以也应该搜索一下前几年，看看他们过去是否要求过像你这样的技术。\n采购技术援助中心(PTAC)存在于每个州，以及哥伦比亚特区、关岛和波多黎各。这些机构的工作人员是帮助小企业驾驭政府拨款计划的复杂性。您可以从这里的列表中选择您当地的办事处。\n然而，PTAC更侧重于合同，对于这些奖励，您可能希望查找当地的小型企业发展中心(Small Business Development Center)。这些由SBA资助的组织也在这里提供帮助，大多数城市及其周边都有几个(在此处的下拉菜单中选择它们并点击搜索)。\n虽然每个项目都有自己的要求和征集，但它们都是公开的。以下是拥有活跃的SBIR计划的机构，从最大的开始，并提供了指向其SBIR申请者的起始页面的链接。第二个链接是到他们的邀请函页面(尽管它可能使用不同的术语)，该页面应该列出或本身链接到当前感兴趣的主题。\n当前的征集也以不同的格式集中在这里列出。请注意，这些地址可能随时会过时，因为政府对这些程序或网站没有标准格式。即使是SBIR官员直接给我的宣传材料也已经过时了。不过，四处打猎应该能让你找到正确的地方。(如果有什么不对劲的地方，请随时在评论中告诉我们。)。\n其中一些程序比其他程序更相似，但也有几个值得注意的例外。例如，美国国家科学基金会(NSF)在基础研究而不是开发方面有更多的开放式征集。但NASA和国防部绝对是最复杂的。\nNASA的SBIR计划在其不同的研究中心(Ames、Goddard等)之间分配，每个研究中心都专门研究不同的技术。虽然这里列出的细节太多太多了，但一个好的开始方法是查看最近获得的与您自己相似或相关的技术的奖项列表，并找到哪个中心是牵头的-例如，机器人采样由喷气推进实验室(JPL)领导，但小型卫星推进由格伦(Glenn)领导。然后，您可以联系该中心的SBIR联系人。\n美国国家航空航天局(NASA)还有一个特别强大的第二阶段计划，为必然需要更长时间或更多资金的天基工作提供了更多和更多的选择。\n国防部在几把伞下有许多拨款计划，包括军队的每个军种。老实说，这有点乱，但他们正在努力简化和加快这一过程。然而，实际的国防部SBIR计划与其他计划重叠最多，因此应该与它们一起考虑。您可能希望依靠您的PTAC或SBA代表来指明方向。\n其他人会有他们自己的特点，但是入门看起来对他们所有人来说都是相似的。\n一旦你决定申请，你首先要在SBIR.gov注册-你必须首先进入系统才有资格参与这一过程。\n与我交谈过的SBIR官员强调，虽然理解项目和找到合适的一个或多个机构提交申请是重要的步骤，但如果你打电话提交实际申请，这一切都会失败-显然，这是他们一遍又一遍看到的。\n不同的机构申请不同，不同的主题自然需要不同的信息。但在所有这些内容中，你至少应该准备好表达以下几点：\n虽然申请书可能只有10页左右长，但公司应该预算至少80个全职小时来完成它们。对于对这类事情缺乏经验的公司来说，聘请专业的拨款撰稿人是一个完全有效的选择，但绝不是必需的。这也是PTAC和SBDC可以帮助解决的问题。\n官员们说，重要的是，不要只专注于出售技术或科学本身-你还必须表明，团队和公司有一条可行的前进道路，政府的资金将使之成为可能。他们可能不想要太多回报，但他们想要一些保证，他们不会把钱扔进井里。\n没有什么可以阻止您申请多个程序，不过请注意，您可能无法将应用程序从一个程序复制粘贴到另一个程序。如果您愿意，您也可以年复一年或季度接着一个季度地申请，或者申请同一机构内的多个招聘会。一家公司在多次尝试后才被录取的情况并不少见。\n最后，如果您对此有任何疑问，请找到并联系您申请的机构的SBIR代表。这些人在那里与你联系，并为你提供合适的资源，所以请不要犹豫，请随时联系。只是不要试图直接向他们推销--这是行不通的。\n正如您所看到的，申请SBIR并不是一个简单的过程，但是如果您知道基本步骤和资源，就可以在您的项目还处于早期阶段时提前完成艰苦的工作。虽然这听起来像是正在进行大量的筛选，但请记住，确实有大量资金投入到这些计划中，所有的重点都是支持美国的小企业。那就是你！", "note_en": "First, as a bit of background: SBIR is a large network of programs, spread across a dozen federal agencies and the military, established some 40 years ago as a way to help out any American with a great idea but little access to capital.\n Over time it has grown to impressive proportions, with a total award budget in 2019 of nearly $3.3 billion. To be clear, this is money intended to be essentially given away to qualified recipients, and not as license fees, or orders, or equity; these cash awards, which range from hundreds of thousands to over a million dollars, come with remarkably few strings attached.\n That said, it’s not as if you just reach into the SBIR cookie jar and pull out a million bucks. As with anything involving the federal government, there’s a process — and not a short or simple one. There are  extensive official tutorials for later, but this article (informed by tips from officials in the program) should help get you up and running.\n It should be noted that this is not the only tech-related government grant program by a long shot, but it  is the largest, broadest and arguably the most accessible to small business entrepreneurs and inventors like you — or it will be once you read this guide. Just be ready to put in a little work.\n   The first thing you should know is that the SBIR program operates with a specific (though not uncommon) type of entrepreneur in mind: Someone who needs money to  develop and commercialize a new technology or intellectual property, but isn’t yet at the stage where they can attract traditional investment, and the risk or cost is too high for an ordinary loan.\n SBIR awards (some agencies offer “grants,” others “contracts,” but you can just say “awards”) are basically cash to bring something from idea to commercialization. They are  not for footing manufacturing down payments, repaying earlier loans or other miscellaneous operating costs.\n If your company or invention needs help to cover R&amp;D to get from experiment to working prototype, or prototype to commercialization, you might be a good fit. It doesn’t matter whether it’s software or hardware, your first product or your tenth — just as long as you’re a self-owned, U.S.-based small business and you’re building a new technology that needs some cash to get started.\n A second, lesser-known benefit of the program is that if you get selected, your company is eligible to skip the line for some government procurement processes that would otherwise require competitive offers. If you picture the U.S. government as a potential client down the road, this benefit alone may be worth the toil.\n The program is generally divided into phases, which you’ll probably want to do in order.\n Phase I is for people demonstrating proof of concept — anywhere on the line from whiteboard to prototype. Awards range from tens of thousands to over $200,000, over a period of six to 12 months, depending on what is warranted for the specific development costs.\n Phase II is for those doing deeper R&amp;D on a proven concept and may be more than a million dollars over a two-year period; as you can see, this is a long-term play, not a quick cash grab.\n Phase III is where a project may transition to actual paid contracts and purchases — but you can worry about that when you get there.\n In other words, while the money has few catches once you get it, the program isn’t a free-for-all. If it sounds like a match and you’re willing to do a little legwork, proceed.\n   Here’s where it starts getting complicated. There isn’t actually just one SBIR program, there are a dozen, spread across as many federal agencies, from Defense and Energy to NASA and NOAA. Each has its own budget and application process — making this already complex enough that many a grant-seeker has bounced right off it (or closed this tab). But don’t worry, it’s not as bad as it sounds. You’ve got three things going for you.\n  This is actually a good thing. Think about who the “customer” is for your technology: Your rocket engine isn’t going to be of much use to Health and Human Services; a collision avoidance system for a drone might be good for the Defense Department, but it also might be helpful to the Department of Energy in a different way. What  specifically does your tech enable, and why would it be helpful to the work of  specifically one agency? That should help narrow it down considerably — but don’t be afraid to think outside the box a little. You might be surprised what some of these departments get up to.\n Second, each agency has specific things it’s looking for, both right now and perennially.\n This means there’s not much in the way of guesswork. These numerous and various “solicitations” range from general areas of interest to highly detailed requests, are listed publicly (see the links below) and can usually be searched through or sorted by topic. Once you’ve decided that your tech might be useful to either the EPA or NOAA, for example, look through their solicitations — they’re updated regularly, though the schedule differs by agency — and see if one is already asking for what you’re offering or uses similar keywords. You can and should also search through previous years to see if they’ve requested something like your tech in the past.\n  Procurement Technical Assistance Centers, or PTACs, exist in every state, as well as D.C., Guam and Puerto Rico. These are staffed with people whose job it is to help small businesses navigate the complexities of government grant programs.  You can find your local office by selecting it from the list here.\n PTACs are more focused on contracts, however, and for these awards you may want to look up your local Small Business Development Center instead. These SBA-funded organizations are also here to help, and there are several in and around most cities ( select them in the drop-down menu here and hit search).\n Though each program has its own requirements and solicitations, they’re all public. Here are the agencies with active SBIR programs, starting with the largest, with links to their starting pages for SBIR applicants. The second link is to their solicitations page (though it may use different terminology), which should list or itself link to current topics of interest.\n  Current solicitations are also  centrally listed here in a different format. Please note that these addresses may at any time be rendered obsolete, as the government has no standard format for these programs or websites. Even the promotional materials I was given directly by SBIR officials were already out of date. But a little hunting around should get you to the right place. (And feel free to tell us in the comments if something seems off.)\n Some of the programs are more similar than others, but there are a couple of notable exceptions. The NSF, for instance, has more open-ended solicitations for basic research rather than development. But NASA and Defense are definitely the most complicated.\n NASA’s SBIR program is divided up among its various research centers — Ames, Goddard, etc. — each of which specializes in different technologies. While the specifics are too many and various to list here, a good way to get started is to look at a list of recent awards for similar or related technologies to your own, and find which center is the lead for it — for example robotic sampling is led by JPL, but small satellite propulsion is at Glenn. Then you can reach out to the SBIR contact for that center.\n NASA also has a particularly robust Phase II program,  with extended and expanded options for space-based work that necessarily takes longer or costs more money.\n Defense has numerous grant programs under several umbrellas, including each branch of the military. To be honest, it’s kind of a mess, but they are working to simplify and accelerate the process. The actual DoD SBIR program, however, overlaps the most with the others and as such should be considered alongside them. You may want to rely on your PTAC or SBA representative to point the way.\n Others will have their own idiosyncrasies, but getting started looks similar for all of them.\n   Once you’ve decided to apply, you’ll want to  register at SBIR.gov first thing — you have to get in the system in the first place to be eligible for participation in the process.\n The SBIR officials I spoke to emphasized that while understanding the program and finding the right agency or agencies to submit to are important steps, it all falls down if you phone in the actual application — something they’ve seen over and over, apparently.\n The applications differ agency to agency, and different topics demand different information, naturally. But in all of them you should be ready to articulate at least the following:\n  Although the applications may only be 10 or so pages long, companies should budget at least 80 full-time hours to complete them. For companies with little experience with this sort of thing, hiring a professional grant writer is a perfectly valid option, but by no means required. This is also something that PTACs and SBDCs can help with.\n It’s important, officials said, not to focus just on selling the technology or science itself — you must also show that there is a viable path forward for the team and company that the government’s funding will enable. They may not want much in return, but they’d like some assurance that they’re not throwing money down a well.\n There is nothing stopping you from applying to multiple programs, though be aware that you probably won’t be able to copy-paste your application from one to the other. You can also apply year after year or quarter after quarter if you like, or to multiple solicitations within the same agency. It’s not uncommon for a company to be accepted only after multiple attempts.\n Lastly, if you have any questions about any of this, find and contact the SBIR representative for the agency you’re applying to. These folks are there to liaise and connect you with the right resources, so don’t hesitate to reach out. Just don’t try to pitch them directly — it won’t work.\n As you can see, applying to SBIR is not a  simple process, but if you know the basic steps and resources, you can frontload the hard work while your project is still at an early stage. And while it may sound like a lot of winnowing is being done, recall that there really is a ton of money going into these programs and the whole point is to support American small businesses. That’s you!", "posttime": "2020-08-08 02:39:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,计划,america,可能", "title": "\n如何获得30亿美元的SBIR计划--“美国种子基金”(America‘s Seed Fund)", "title_en": "\n\t\t\t\tHow to access ‘America’s Seed Fund,’ the $3 billion SBIR program\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/how-to-access-americas-seed-fund-the-3-billion-sbir-program/", "via": "", "real_tags": ["美国", "计划", "america", "可能"]}]