[{"category": "", "categoryclass": "", "imagename": "fb8f2745adcb125ba613fb9ee3d346e2.png", "infoid": 1030613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ubuntu 20.10，代号Groovy Gorilla已经到来，有史以来第一次有一个Raspberry Pi的版本可以从Ubuntu的下载页面发布！！Ubuntu 20.10是最新的Ubuntu，因此它附带了最新的内核和对Gnome的更新。它进一步完善了2020年4月发布的20.04 LTS(长期支持)版本。Ubuntu20.04在主版本发布后的一段时间内发布了Raspberry PI，但对于20.10，团队致力于同时发布主版本和Raspberry PI版本。\n针对：-未预安装GPIO软件-即使超频也会有点慢-在标准Stressberry测试期间达到热节流限制。\n我们的结论是：为将来的版本打下坚实的基础，使用方便，看起来棒极了。试一试，但现在还不太可能取代Raspberry Pi OS。\nUbuntu for Raspberry PI的20.10和以前版本最大的不同在于，这不是一个后来添加了桌面环境的服务器映像，例如Martin Wimpress的Desktopify项目。用于Raspberry PI的Ubuntu20.10是作为一个完整的桌面映像构建的。很高兴看到Ubuntu在Raspberry PI上运行。在PI的早期，Ubuntu和Fedora一样被认为是默认的操作系统，但最终都输给了Raspbian(官方提供的Raspberry PI OS)。\n我们设法查看了一个发布候选版本，并用我们的Raspberry PI 4(4 GB)进行了测试，这是官方支持的规格最低的机器。Ubuntu20.10可以在规格较低的机器上运行，但体验起来可能不那么流畅。同样的图像也可以用于新的树莓PI计算模块4。兼容性仅限于具有4 GB或更大RAM和16 GB eMMC的计算模块4。\n在microSD卡上安装Ubuntu20.10可以通过使用Balena Etcher闪存下载的镜像来完成，或者通过Raspberry Pi Imager来完成，在Raspberry PI Imager中，Ubuntu20.10将从发布之日起成为一个选项。一张16 GB的高速Micro SD卡是获得最佳效果的必备条件。Raspberry PI上的Ubuntu20.10是64位操作系统，这意味着它可以利用我们的4 GB RAM或我们的8 GB Raspberry PI 4(如果我们选择的话)。\n在第一次引导时，我们会被问到一系列问题来配置我们的安装，所有这些问题都以非常清晰和简单的方式进行了处理。安装完成后，我们第一次看到了Groovy Gorilla。如果你熟悉Ubuntu，那么它的界面无疑会让你非常熟悉。\n那些刚接触Ubuntu的人会注意到屏幕左侧有一个启动器，其中包含我们“最喜欢”的应用程序。在左下角，我们看到一个由九个正方形组成的网格，即应用程序网格。这将打开所有已安装并可通过桌面访问的应用程序的分页视图。通过在这个网格上拖动图标，我们可以基于任务或功能创建应用组，就像在Android设备上创建应用组一样。如果我们将九个以上的应用程序添加到一个组中，则会在组内创建一个新页面。\nUbuntu20.10中有一个方便的功能，但并不局限于Raspberry Pi，那就是Wi-Fi热点。在WiFi设置菜单中可以找到它，它可以将我们的PI变成Wi-Fi热点，以及一个可以扫描的二维码，可以快速将我们的移动设备连接到网络。\n一般来说，在PI上使用Ubuntu20.10的感觉就像在任何其他机器上使用Ubuntu一样，虽然比我们习惯的速度要慢一些，但仍然很坚固。我们不会跳槽，在PI上采用Ubuntu20.10作为我们的日常驱动程序，Twister操作系统仍然是我们的首选操作系统，但是Ubuntu20.10是可靠的，并且有很多社区支持。\nUbuntu20.10专注于Raspberry Pi板上的功能，因此，我们可以忽略为Raspberry Pi OS设计的帽子和配件。绝大多数都不会奏效。\n考虑到这一点，什么才是有效的呢？嗯，蓝牙和WiFi(2.4 GHz和5 GHz)工作无懈可击，我们可以连接蓝牙耳机，观看“少年派”的一集。Wi-Fi很稳定，我们连接到家里的不同接入点时没有遇到任何问题。\nRaspberry Pi的一个很受欢迎的补充是官方Raspberry Pi摄像头，考虑到这一点，我们测试了两个版本的官方Raspberry Pi摄像头，我们很高兴地说，它们可以与Ubuntu 20.10一起工作。通过终端命令raspistil和raspivid，基本相机和较新的HQ相机可以完美地工作。这款相机还可以用作视频通话的网络摄像头，这是在这些令人不安的时期必不可少的工具。\n遗憾的是，目前还没有可安装的Picamera Python库，这意味着要在Python脚本中使用相机，我们需要调用底层操作系统，而不是Pythonic方法。\nGPIO(参见Raspberry PI GPIO引脚说明)是使Raspberry PI如此易于访问的关键功能，如果您准备投入一些工作，通过Ubuntu 20.10可以访问GPIO。首先，没有预先安装的工具来处理GPIO，所以为了将GPIO与Python一起使用，我们必须安装RPi.GPIO模块。通常情况下，我们会通过Python打包工具pip执行此操作，但在本例中，我们发现必须使用存储在apt存储库中的包。\n安装之后，我们启动了一个Python3外壳并导入了模块，以便在短时间的LED闪烁测试中使用。我们遇到了一个问题，那就是权限。我们的标准用户没有访问GPIO的权限。为了解决这个问题，我们通过sudo运行了一个新的Python3shell。这不是做这件事的理想方式，但它奏效了。\n我们安装了Microsoft的Visual Studio代码，并编写了一个测试脚本来闪烁LED，使用一个变量来包含开和关的持续时间。同样，代码只能使用sudo提供的提升的权限运行，但是我们至少有一个专业的代码编辑器来编写代码。\nRaspberry PI上一个经常未得到充分使用的命令是vcgencmd。使用此命令，我们可以查询CPU的温度，检查电压并查看当前的CPU速度。幸运的是，vcgencmd是PI上Ubuntu20.10的一部分，我们在Stressberry测试之前使用此命令监控CPU温度。\n通常，我们只在测试用例或机箱时测量CPU温度，但我们想看看Ubuntu20.10是否使CPU比Raspberry PI OS更努力地工作，这反过来会产生更多热量。在测试中，我们没有使用机箱或外壳，也没有冷却。我们的股票Raspberry Pi 4，运行Raspberry Pi OS作为对照，它在空闲时测量到40摄氏度，在Stressberry测试期间测量到最高65摄氏度。与Ubuntu20.10相比，在相同的树莓PI上以库存速度运行，我们看到空闲时增加了7摄氏度，在Stressberry期间最高温度为77摄氏度。\n我们通过编辑/boot/fix ware/config.txt超频安装，并使用建议的超频值将Raspberry PI调到2 GHz。空闲时，PI是50摄氏度，但当我们运行Stressberry测试时，我们达到了85摄氏度的热油门限制，无法记录更高的温度。如果您打算超频您的树莓PI运行Ubuntu，那么您将需要良好的冷却。\n你已经在你的Raspberry PI上安装了Ubuntu20.10，但是你能用它做什么呢？通过Netflix、亚马逊、Hulu和迪士尼+进行媒体消费有什么好处吗？嗯，很遗憾没有。没有提供硬件加速，使用WebGL水族馆测试和2 GHz的超频，我们只看到了一条游泳鲨的15fps。对于100个游泳生物，我们看到了14fps，500是10fps，而对于1000个游泳生物，我们看到了9fps。\nUbuntu 20.10最适合设备和基本桌面任务，这些任务不需要太多资源。操作系统可以安装到USB驱动器/SSD，但这绝不是一个简单的步骤，需要在终端执行很多命令。\nUbuntu20.10就是倾听社区意见的一个例子。显然，人们对在Raspberry PI上使用Ubuntu很感兴趣。Desktopify和Ubuntu Core表明，有家庭和工业用户有兴趣通过Raspberry PI提供的协调平台来使用Ubuntu的稳定性。\n乘坐Ubuntu20.10在你的树莓PI上兜风不会花费你任何东西，可能只需要你一天中的几个小时。试一试，看看你是否喜欢。我们有，但现在我们将坚持Twister操作系统为我们的树莓PI 4。", "note_en": "Ubuntu 20.10, codename Groovy Gorilla has arrived and for the first time ever there is a release for   Raspberry Pi available on launch day from   Ubuntu’s download page !   Ubuntu 20.10 is the latest Ubuntu and as such it comes with the latest Kernel and updates to Gnome. It further refines the 20.04 LTS (Long Term Support) release which came out in April 2020. Ubuntu 20.04 saw a release for the Raspberry Pi  some time after the main version was released, but for 20.10 the team were committed to releasing the main release and a Raspberry Pi version together.\n AGAINST: - GPIO software not pre-installed  - A little slow, even when overclocked  - Thermal throttling limit hit during standard Stressberry test\n OUR VERDICT: Solid foundation for future releases, it is easy to use and looks great. Give it a try but not likely to replace Raspberry Pi OS just yet.\n The biggest difference between 20.10 and previous versions of Ubuntu for Raspberry Pi is that this is not a server image with a desktop environment added later, for example Martin Wimpress’ Desktopify project. Ubuntu 20.10 for the Raspberry Pi was built as a full desktop image. It is great to see Ubuntu running on a Raspberry Pi. n the early days of the Pi, Ubuntu was considered to be the default operating system, as was Fedora, but both ultimately lost out to Raspbian (officially provided as Raspberry Pi OS).\n  We managed to take a look at a release candidate image and tested it with our   Raspberry Pi 4 (4GB), the lowest spec officially supported machine. Ubuntu 20.10 can be run on lower specification machines but it may not be as smooth an experience. This same image can also be used with the new Raspberry Pi Compute Module 4.  Compatibility is limited to Compute Module 4 with 4GB RAM or greater and 16GB eMMC.\n   Installing Ubuntu 20.10 to a micro SD card can be accomplished by flashing a downloaded image using Balena Etcher, or via the Raspberry Pi Imager where Ubuntu 20.10 will be an option from launch day. A 16GB high speed micro SD card is a must to get the best. Ubuntu 20.10 on the Raspberry Pi is a 64 bit OS and this means it can take advantage of our 4GB RAM or our  8GB Raspberry Pi 4 if we chose to.\n On first boot, we are asked a series of questions to configure our installation, all handled in a very clear and simple manner. With the installation complete, we see the Groovy Gorilla for the first time. If you are familiar with Ubuntu then the interface will no doubt be very familiar to you.\n Those new to Ubuntu will notice to the left of the screen a launcher which contains our “favorite” applications. At bottom left we see a grid of nine squares, the applications grid. This will open a paged view of all the applications installed and accessible via the desktop. By dragging icons around this grid we can create groups of applications based on tasks or functions in a similar manner to creating groups of applications on Android devices. If we add more than nine apps to a group, then a new page is created inside the group.\n A handy feature found in Ubuntu 20.10 and not limited to the Raspberry Pi is Wi-Fi hotspots. Found in the WiFi settings menu, it can turn our Pi into a Wi-Fi hotspot, along with a QR code which can be scanned to quickly connect our mobile device to the network.\n In general using Ubuntu 20.10 on a Pi feels just like Ubuntu on any other machine, albeit a little slower than we are used to, but still solid. We wouldn’t jump ship and adopt Ubuntu 20.10 on Pi as our daily driver, Twister OS is still our OS of choice, but Ubuntu 20.10 is solid and reliable and comes with lots of community support.\n  Ubuntu 20.10 concentrates on the features present on the Raspberry Pi board and, as such, we can forget about HATs and accessories designed for use with Raspberry Pi OS. The vast majority won’t work.\n With that in mind what does work? Well Bluetooth and WiFi (2.4GHz and 5GHz) works flawlessly and we were able to connect our Bluetooth headphones and watch an episode of The Pi Cast. Wi-Fi is solid and we encountered no issues connecting to different access points in our home.\n  A popular addition to the Raspberry Pi is the official Raspberry Pi Camera and with that in mind we tested two versions of the official Raspberry Pi Cameras and we are pleased to say that they work with Ubuntu 20.10. The basic camera and the newer HQ camera work flawlessly via the terminal commands raspistill and raspivid. The camera can also be used as a webcam for video calls, an essential tool in these troubling times.\n Sadly there is no Picamera Python library installable at this time, and this means that to use the camera in a Python script we would need to make a call to the underlying OS, rather than a Pythonic approach.\n    The GPIO (see  Raspberry Pi GPIO pinout) is a key feature of what makes the Raspberry Pi such an accessible device and via Ubuntu 20.10 there is GPIO access, if you are prepared to put a little work in. Firstly there are no pre-installed tools for working with the GPIO so in order to use the GPIO with Python we had to install the RPi.GPIO module. Typically we would do this via the Python packaging tool, pip, but in this case we found that we had to use the package stored in the apt repositories.\n After installation, we fired up a Python 3 shell and imported the module for use in a short flashing LED test. We hit a problem and that was permissions. Our standard user did not have permission to access the GPIO. To fix this we ran a new Python 3 shell via sudo. That’s not an ideal way to do this but it worked.\n We installed Microsoft’s Visual Studio Code and wrote a test script to flash the LED, using a variable to contain the on and off time duration. Again, the code could only be run using the elevated privileges which sudo provides, but we at least had a professional code editor in which to write the code.\n  An often underused command on the Raspberry Pi is vcgencmd. Using this command we can query the temperature of the CPU, check voltages and see the current CPU speed. Happily vcgencmd is part of Ubuntu 20.10 on the Pi and we used this command to monitor the CPU temperature prior to our Stressberry testing.\n  Typically we only measure CPU temperature when testing cases or enclosures, but we wanted to see if Ubuntu 20.10 made the CPU work harder than Raspberry Pi OS which in turn would generate more heat. For the test we used no cases or enclosures and no cooling. Our stock Raspberry Pi 4, running Raspberry Pi OS is used as a control and it measured 40 Celsius at idle, and a peak 65 Celsius during Stressberry tests. Compare this to Ubuntu 20.10 running at stock speeds on the same Raspberry Pi and we see a 7 celsius increase at idle, and a peak temperature of 77 Celsius during Stressberry.\n We overclocked the install by editing /boot/firmware/config.txt and,  using our suggested overclock values, took the Raspberry Pi to 2 GHz. At idle, the Pi sat at 50 celsius, but when we ran the Stressberry test, we hit the thermal throttle limit of 85 celsius and were unable to record the temperature any higher. If you intend to overclock your Raspberry Pi running Ubuntu, then you will need good cooling.\n   You have Ubuntu 20.10 installed on your Raspberry Pi, but what can you use it for? Is it any good for media consumption via Netflix, Amazon, Hulu and Disney+? Well, no sadly. There is no hardware acceleration on offer and using the WebGL Aquarium test and an overclock to 2 GHz, we saw only 15 fps with one swimming shark. With 100 swimming creatures we saw 14 fps, 500 was 10 fps and, with 1000 swimming creatures, we saw 9 fps.\n Ubuntu 20.10 is best suited to appliances and basic desktop duties, tasks which do not require too many resources.The OS can be installed to a USB drive / SSD but this is by no  means a simple step and requires many commands at the terminal.\n   Ubuntu 20.10 is an example of listening to the community. There is clearly interest in using Ubuntu on the Raspberry Pi. Desktopify and Ubuntu Core show that there are domestic and industrial users interested in using the stability of Ubuntu with the harmonized platform which Raspberry Pi provides.\n Taking Ubuntu 20.10 for a spin on your Raspberry Pi will cost you nothing except perhaps a few hours of your day. Give it a try and see if you like it. We do, but for now we shall stick to Twister OS for our Raspberry Pi 4.", "posttime": "2020-10-23 01:53:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,ubuntu,gorilla,pi", "title": "Ubuntu 20.10“Groovy Gorilla”在树莓派上摇摆", "title_en": "Ubuntu 20.10 'Groovy Gorilla' Swings onto Raspberry Pi", "transed": 1, "url": "https://www.tomshardware.com/news/ubuntu-2010-for-raspberry-pi", "via": "", "real_tags": ["ubuntu", "gorilla", "pi"]}, {"category": "", "categoryclass": "", "imagename": "a92d7c8e20dd1c98c4603cea0308241b.jpeg", "infoid": 1030612, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高盛集团(Goldman Sachs Group Inc.)。在同意达成代价高昂的和解协议后，该公司扣押或扣留了现任和前任高管的1.74亿美元，以解决政府对其在马来西亚贿赂丑闻中扮演的角色的多项调查。\n这家华尔街公司将削减首席执行官大卫·所罗门(David Solomon)和两名高级副手今年的薪酬，并追回过去支付给前首席执行官劳埃德·布兰克费恩(Lloyd Blankfein)和其他人的奖金。此前，这家华尔街公司周四承认，在与一家腐败的马来西亚投资基金打交道时，存在合规行为。", "note_en": "Goldman Sachs Group Inc. is seizing or withholding $174 million from current and former executives after agreeing to a costly settlement to resolve multiple government investigations into its role in a Malaysian bribery scandal.\n  The Wall Street firm will cut this year’s pay to Chief Executive David Solomon and two top lieutenants, and claw back past bonuses paid to ex-CEO Lloyd Blankfein and others after it admitted on Thursday to compliance lapses in its dealings with a corrupt Malaysian investment fund.", "posttime": "2020-10-23 01:52:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "支付,ceo,马来西亚", "title": "高盛将在1MDB罚款后追回支付给CEO、前CEO和高管的钱", "title_en": "Goldman Sachs will claw back money paid to CEO, ex-CEO, & execs after 1MDB Fines", "transed": 1, "url": "https://www.wsj.com/articles/goldman-sachs-to-recoup-top-executives-pay-after-costly-1mdb-fines-11603380050", "via": "", "real_tags": ["支付", "ceo", "马来西亚"]}, {"category": "", "categoryclass": "", "imagename": "f3cf0aa326ee0d83a357fc44e4c329f1.jpg", "infoid": 1030611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯塔曼-骑着樱桃红色的特斯拉跑车穿越太空的假人-已经实现了他有史以来最接近火星的方式。\n2018年2月6日，在SpaceX火箭的首次试射中，这辆电动敞篷车和它的人体模型乘客被螺栓固定在猎鹰重型火箭的顶部，作为一个特技。(测试发射中包括沉重的有效载荷是很常见的，但它们通常比樱桃红色的运动伤疤更乏味。)。两年后，猎鹰重型上面级和顶部的飞行器正在进行他们的第二次绕日旅行。乔纳森·麦克道尔(Jonathan McDowell)是哈佛大学的天体物理学家，他将太空物体作为一个次要项目进行跟踪，他发现斯塔曼在凌晨2点25分从火星经过了460万英里(740万公里)。美国东部夏令时10月7日。这大约是地球到月球距离的19倍，比地球上任何人到火星的距离都近35倍。\n(根据世界地图集的数据，这两颗行星最近的一次接近是在2003年3480万英里(5600万公里)，尽管这两颗行星往往相距数亿英里。)。\n最后一次被人看到离开地球的斯塔曼，今天第一次近距离接近火星-距离这颗红色星球pic.twitter.com/gV8barFTm7不到0.05个天文单位，即500万英里。2020年10月7日。\n在目前的距离，没有人能看到猎鹰重型上层舞台。它曾经传回地球的奇怪而美丽的图像早已不复存在。但是几年内的轨道是相当容易预测的，麦克道尔利用火箭离开地球引力时的运动数据来精确定位它最近的运动。\n承载着跑车的火箭级处于不对称的轨道上，在其长途跋涉的一端(超出火星轨道)，它与太阳的距离高达1.66倍，然后又回到地球另一端的轨道内，是地球到太阳距离的0.99倍。\n该阶段已经通过了其0.99x1.66AU轨道的第二个远日点，几天前又回到了火星轨道内。Pic.twitter.com/C6b8LffPuy 2020年10月7日。\n麦克道尔说，上一次斯塔曼绕太阳运行时，它越过了火星轨道，而这颗红色星球离得相当远。但这一次，穿越排成了相当近的距离-尽管仍然不够近，感觉不到强烈的火星引力。\n在这一点上，如果你去看跑车，它可能会看起来相当不同。正如Live Science在2018年报道的那样，两个行星之间恶劣的太阳辐射环境可能已经破坏了所有暴露的有机材料(红色油漆、橡胶轮胎、皮椅等)，打破了将它们连接在一起的碳键。如果没有地球的保护大气和磁屏蔽，即使挡风玻璃上坚固的塑料和碳纤维材料也会开始解体。在几十年或几个世纪的过程中，这辆车应该只剩下铝制车架和最坚固的玻璃部件-假设它们都不会在经过的太空岩石的撞击中被摧毁。", "note_en": "Starman — the dummy riding a cherry-red Tesla Roadster through space — has made his closest approach ever to Mars.\n That electric convertible with its mannequin passenger bolted to the top of a Falcon Heavy rocket as a stunt during the SpaceX rocket&#39;s first test launch Feb, 6, 2018. (It&#39;s common for test launches to include heavy payloads, but they&#39;re usually more boring than cherry-red sportscars.) Two years later, the Falcon Heavy upper stage and the vehicle at its tip are making their second trip around the sun. Jonathan McDowell, a Harvard astrophysicist who tracks space objects as a side project, found that Starman passed 4.6 million miles (7.4 million kilometers) from Mars at 2:25 a.m. EDT Oct. 7. That&#39;s about 19 times the distance from  Earth to the moon, and 35 times closer than anyone on Earth has gotten to Mars.\n  (The closest recent approach between the two planets was 34.8 million miles (56 million km) in 2003, according to  World Atlas, though the planets are often hundreds of millions of miles apart.)\n  Starman, last seen leaving Earth, made its first close approach with Mars today—within 0.05 astronomical units, or under 5 million miles, of the Red Planet pic.twitter.com/gV8barFTm7 October 7, 2020\n   No one can see the Falcon Heavy upper stage at its current distance. And the strange, beautiful images it once beamed home to Earth have long since ceased. But orbits over periods of a few years are fairly straightforward to predict, and McDowell used data about how the rocket was moving when it left Earth&#39;s  gravity behind to pinpoint its recent movements.\n The Roadster-bearing rocket stage is on an asymmetrical orbital course that takes it as far as 1.66 times Earth&#39;s distance from the sun at one end of its trek — out beyond the orbit of Mars — and then back within Earth&#39;s orbit at the other end, 0.99 times Earth&#39;s distance from the sun.\n The stage has passed through the second aphelion of its 0.99 x 1.66 AU orbit and a couple of days ago passed back inside the orbit of Mars. pic.twitter.com/C6b8LffPuy October 7, 2020\n Last time Starman circled the sun, McDowell said, it crossed Mars&#39; orbit while the Red Planet was quite far away. But this time the crossing lined up with a fairly close approach — though still not close enough to feel a strong tug of Martian gravity.\n  At this point, if you were to go look at the Roadster, it probably would look pretty different. As  Live Science reported in 2018, the harsh solar  radiation environment between the planets would probably have wrecked all the exposed organic materials (red paint, rubber tires, leather seats and the like), breaking the  carbon bonds that hold them together. And without Earth&#39;s protective atmosphere and magnetic shielding, even the robust plastics in the windshield and carbon fiber materials would start to disintegrate. Over the course of decades or centuries, the car should be reduced to its aluminum frame and sturdiest glass parts — assuming none of them get destroyed in impacts with passing space rocks.", "posttime": "2020-10-23 01:52:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火星,特斯拉,疾驰,zipped,地球", "title": "“星人”刚刚开着他那辆快速腐烂的特斯拉跑车疾驰而过火星。", "title_en": "'Starman' just zipped past Mars in his rapidly-decaying Tesla Roadster", "transed": 1, "url": "https://www.livescience.com/starman-tesla-mars-approach.html", "via": "", "real_tags": ["火星", "特斯拉", "疾驰", "zipped", "地球"]}, {"category": "", "categoryclass": "", "imagename": "f9248c09f152f5a92f83a7147f62f6bf.png", "infoid": 1030610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任天堂最新出人意料的发布与马里奥、林克和皮卡丘等通常的吉祥物不同：它代表的是1990年在日本独家推出的回合战略系列“火象”(Fire Emblem)的吉祥物“火象”(It‘s For Fire Emblem)。为了庆祝它的30周年纪念日，这款游戏的第一个8位冒险游戏得到了重新发布的待遇，无论是作为基本的数字版本，还是与豪华的，物理收集的小册子，地图，等等。\n但是火徽有一件有趣的事：影子龙&光之刃(Amp；the Blade of Light)。这个8位的重新发布版有一些类似于仿真的调整和额外功能，但除此之外，这不是翻拍。到目前为止，其充满文本的Famicom版本从未得到西方观众的正式翻译和发行。与任天堂制作日本游戏的翻译版，然后将其搁置的罕见情况不同，这款第一款火徽游戏从未向西方粉丝做过广告或取笑。\n在其他任何一年，我们可能会看到这款令人愉快的回归到经典的、仅限日本的任天堂游戏，并短暂地竖起整个游戏的大拇指。但对任天堂来说，2020年是奇怪的一年，所以我忍不住想仔细看看，问一问：这是不是预示着更多出土的翻译版本即将问世？\n当FE：SD&amp；TBL于12月4日在任天堂Switch上发布时，它将迎来任天堂历史上发布速度最慢的第一方游戏之一。自从7月份推出Paper Mario：The折纸大王游戏以来，任天堂对其超级流行游戏机的主要新特许经营或游戏一直保持明显的沉默。取而代之的是，我们得到了“超级马里奥3D全明星”(Super Mario 3D All-Stars)的功能精简的仿真集合，以及对Pikmin3重新发布的取笑，以及对“塞尔达传奇”(Legend Of Zelda)角色在一款音乐剧风格的勇士队游戏中的另一种Koei-Tecmo转换。\n任天堂不在今年夏天类似E3的一系列视频演示中，开发人员没有使用通常的E3定时任天堂Direct，而是充斥着公告和热议的内容。在这个夏天，任天堂推出了一系列类似E3的视频演示，开发者避开了通常的E3-Time Nintendo Direct，充斥着公告和热议。在其他方面，这意味着我们仍然不知道之前宣布的电影会发生什么，比如“野性的气息”续集(The Untitle Of The Wild Spair Of The Wild Sequence)。\n由于任天堂臭名昭著的守口如瓶的名声，我们不再对任天堂未来的游戏发布时间表做出假设(除了超级马里奥3D世界的Wii U端口)，而所有这些假设都因日本游戏开发商受到冠状病毒影响的现实而变得加倍复杂。任天堂是否受到了特别的影响？我们不能说，虽然它的轻微的2020年发布时间表和日本游戏业与大流行的斗争报告并不让我们特别乐观。", "note_en": "Nintendo&#39;s latest surprise announcement hinges on a different anniversary than the usual mascots like Mario, Link, and Pikachu: It&#39;s for Fire Emblem, the turn-based strategy series that launched exclusively in Japan in 1990. To celebrate its 30th anniversary, the game&#39;s first 8-bit adventure is getting the re-release treatment, either as a basic digital version or with a deluxe, physical collection of booklets, maps, and more.\n But there&#39;s a funny thing about  Fire Emblem: Shadow Dragon &amp; The Blade of Light. This 8-bit re-release has some emulation-like tweaks and perks, but this is otherwise not a remake. Up until now, its text-filled Famicom version never got an official translation and release for Western audiences. And unlike the rare cases where Nintendo produced, then shelved, a translated version of a Japanese game, this first Fire Emblem game was never advertised or teased to Western fans.\n In any other year, we might look at this delightful throwback to a classic, Japan-only Nintendo game and briefly give the whole thing a thumbs up. But 2020 has been a weird one for Nintendo, so I&#39;m tempted to take a closer look and ask: Is this a sign of more unearthed translations to come?\n  When  FE:SD&amp;TBL launches on Nintendo Switch on December 4, it will arrive during one of Nintendo&#39;s slowest first-party stretches of game launches in history. Ever since the launch of  Paper Mario: The Origami King in July, Nintendo has kept noticeably quiet about major new franchises or games for its mega-popular console. Instead, we&#39;ve gotten the feature-thin emulation collection of  Super Mario 3D All-Stars, along with the teasing of a  Pikmin 3 re-release and another Koei-Tecmo conversion of Legend of Zelda characters in a musou-styled &#34;Warriors&#34; game.\n Nintendo wasn&#39;t part of this summer&#39;s E3-like flurry of video presentations, with the developer eschewing its usual E3-timed Nintendo Direct full of announcements and buzz. Among other things, this means we still have no idea what&#39;s happening with previously announced titles like the untitled  Breath of the Wild sequel.\n We&#39;re left making assumptions about Nintendo&#39;s game-launch schedule going forward (other than a Wii U port of  Super Mario 3D World), thanks to the developer&#39;s notoriously cagey reputation, and all of those assumptions are doubly complicated by the realities of coronavirus impact among Japanese game developers. Has Nintendo been impacted in particular? We can&#39;t say, though its light 2020 release schedule and reports of  the Japanese game industry&#39;s struggles with the pandemic don&#39;t have us particularly optimistic.", "posttime": "2020-10-23 01:11:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,2020,任天堂,火徽,translation", "title": "任天堂的新翻译曲？2020年重新发布火徽意味着什么", "title_en": "Nintendo’s new translation tune? What a Fire Emblem re-release means in 2020", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/nintendos-new-translation-tune-what-a-fire-emblem-re-release-means-in-2020/", "via": "", "real_tags": ["发布", "2020", "任天堂", "火徽"]}, {"category": "", "categoryclass": "", "imagename": "e77a9a7d6cb8ff74edb9f9832c8104ca.jpg", "infoid": 1030609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，这个节目不是现场直播的节目。与广播早间节目不同，Spotify的早间节目是预先录制的，并以播放列表的形式提供。早间节目的内容是现场直播的，通常还涉及到与听众的互动-比如打电话或比赛-Spotify的节目是预先录制的，并以播放列表的形式提供。\n这意味着你可以在美国东部时间工作日早上7点发布后的任何时间收听。\n如果你愿意，你也可以选择跳过节目的某些部分，比如音乐或一些闲聊。(需要明确的是，Spotify将该节目称为播客，但这种格式实际上将主持人的谈话电台般的内容与单独的音乐曲目分开。换句话说，它更像是一个混合媒体播放列表，而不是传统的播客。)。\nSpotify的节目与广播节目不同的另一个关键是，音乐对听众来说是个性化的。当然，这并不总是理想的。如果你更喜欢在通勤途中听新音乐，但一直忙于在Spotify的服务上播放老歌，你的早间节目将反映出这些趋势。目前也没有办法更直接地按类型编排节目。\n该节目本身由三人主持：记者斯皮迪·莫尔曼(Speedy Morman)，之前是Complex的记者；YouTuber的凯特·拉佐(Kat Lazo)，因她的系列剧“猫的呼唤”(The Kat Call)而闻名；以及Spotify自己的Xavier‘X’Jernigan，文化合作伙伴关系和内部人才主管。\n新的播放列表将在工作日上午在为您打造的音乐中心和在线音乐中心提供，供美国的免费和付费订户使用。您也可以直接从http://www.spotify.com/thegetup.访问该节目", "note_en": "The show is not a live program, however. Unlike radio morning shows where content is broadcast live and often also involves interactions with listeners — like call-ins or contests — Spotify’s show is pre-recorded and made available as a playlist.\n That means you can listen at any time after its 7 AM ET release on weekday mornings.\n  You can also opt to skip portions of the programming — like the music or some of the chatter — if you prefer. (Spotify, to be clear, refers to the show as a podcast, but the format actually splits the hosts’ talk radio-like content from the individual music tracks. In other words, it’s more like a mixed-media playlist than a traditional podcast.)\n Another key thing that makes Spotify’s programming different from a radio show is that the music is personalized to the listener. Of course, that’s not always ideal. If you prefer to listen to new music during your commute, but have had been busy streaming oldies on Spotify’s service, your morning show will reflect those trends. There’s currently no way to program the show more directly by genre, either.\n The show itself is hosted by three people: journalist  Speedy Morman, previously of Complex; YouTuber  Kat Lazo, known for her series “The Kat Call;” and Spotify’s own  Xavier ‘X’ Jernigan, Head of Cultural Partnerships and In-House Talent.\n The new playlist will be made available on weekday mornings in the Made for You and Driving hubs on Spotify for both free and premium subscribers in the U.S. You can also access the show directly from  http://www.spotify.com/thegetup.", "posttime": "2020-10-23 01:08:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "spotify,takes,节目", "title": "\nSpotify在电台上推出了自己的每日早间节目", "title_en": "\n\t\t\t\tSpotify takes on radio with its own daily morning show\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/spotify-takes-on-radio-with-its-own-daily-morning-show/", "via": "", "real_tags": ["spotify", "takes", "节目"]}, {"category": "", "categoryclass": "", "imagename": "2f54db5730604a0cf0f8ff4a2e1ab085.jpg", "infoid": 1030608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，我们对Quibi这个完整的群体的集体赞叹引出了一个合理而有趣的问题：我们是在可恶地攻击善意的失败吗？Quibi不就像所有其他初创公司一样，只是碰巧失败了吗？A16z的普通合伙人安德鲁·陈(Andrew Chen)在推特上生动地表达了这一观点，他表示“这太恶心了”，并称赞创建一家初创公司所面临的创业挑战：\n所有冲到键盘前打字的人，我都告诉过你，他们对基比的热评是这样的：\n去建立一些东西，而不是用你的能量来让Twitter知道你有多聪明，比如说共识。\n我深深地理解这种观点。事实上，TechCrunch的所有人都明白这一点。我们在这里引以为豪的一件事是尊重喧嚣。我们知道创办一家初创公司有多难。作为一个团队，我们每年都会集体与数千名创始人交谈，我们有时会听到一些令人心碎的故事和建立公司时带来的彻头彻尾的创伤。偶尔(是的，我们的大部分报道都集中在这里)，我们也会听到胜利和成功的消息。\n老实说，大多数初创公司都失败了。大多数想法最终都是错误的。大多数企业家永远不会成功。这并不意味着没有人应该创建一家初创公司，或者追逐自己的激情和梦想。当成功发生时，我们喜欢谈论它，报道它，并试图解释它为什么会发生-因为最终，更多的创业成功对我们所有人都有好处，有助于推动我们这个世界的进步。\n但我们也要清楚，有一些糟糕的想法，还有一些彻头彻尾的糟糕想法，这些想法有数十亿美元的资金来自聪明人，否则他们应该知道得更清楚。Quibi并不是众所周知的大学辍学生的火花，他们热衷于娱乐，试图用朋友和家人的拉面钱发明一种新的手机格式。Quibi由当今美国最有权势和影响力的两位高管经营，她们为自己的项目筹集的资金比其他女性创始人今年共同筹集的资金还要多。\n陈提出了一个重要的观点，科技领域的许多明显的想法都是从愚蠢的想法开始的。那是真的!。事实上，技术史上充斥着投资者和媒体认为不是愚蠢就是不可能创造的想法的例子(用更礼貌的方式说“愚蠢”)。\n对于那些“显然”知道什么时候在科技领域有坏主意的人--今天每个人都在引用Quibi--这里有一条给你的线索。Https://t.co/QpXXKG16Vm\n为什么本应愚蠢的想法最终变成了聪明的想法呢？部分原因是，开始时愚蠢的东西慢慢地迭代成了非常聪明的东西。Facebook只是一个“Facebook”，用来打量你在大学校园里的同学。如果它就这样结束了，像之前的许多其他社交网络一样枯萎了，我们很可能会把它扔进历史的垃圾箱。但扎克伯格和他的团队进行了迭代-添加了照片、订阅源、消息等功能，极其关注增长，这使得这款产品比最初推出时要多得多。\n我们一次又一次地看到这种模式。创始人从用户那里获得反馈，他们迭代，他们转向，他们尝试新的东西，慢慢地，但肯定的是，他们开始从一个可能非常原始的概念迁移到一些更准备好在当今激烈的商业和消费者关注的市场中竞争的东西。\n奎比的故事从来都不是这样的。这款产品从来没有迭代过，也没有一个长期计划来刻苦培养用户和人才，因为公司在找到牵引力的同时，小心翼翼地为任何公司成长中不可避免的艰难时刻安排资本。\n是的，我们评论员确实会犯错误，但分析人士指出了基比所有明显的红色警报缺陷，这并不是愚蠢的。那些分析师很聪明。他们是对的。当然，他们下一次可能不是正确的-任何分析师都不应对自己的预测过于自信。但与此同时，我们也不应该只是集体举起手来，把我们面前的每一个想法都说成是上天赐予我们的一份灿烂的礼物。大多数想法都是愚蠢的，我们和其他所有人都有权指出这一点。\n所以要尊重喧嚣。不要贬低一个勤奋的企业家，他只是想把他们的项目拿出来展示给世界。但这并不意味着你看到它就不能喊傻话。最优秀的企业家都知道--即使是最尖酸刻薄的--批判性反馈也是初创企业成功的必要因素。赞美每个人，没有人赞美任何人。", "note_en": "Our collective exhalation on the complete clusterfuck that was Quibi though leads to a legitimate and interesting question: are we obnoxiously attacking a good-faith failure? Wasn’t Quibi a bet just like every other startup, a bet that just happened to fail?  A16Z’s general partner Andrew Chen put it vividly on Twitter, saying “It’s gross” and lauding the entrepreneurial challenge of building a startup:\n all the people rushing to their keyboards to type in their &#34;i told you so&#34; hot takes on Quibi:\n   Go build something instead of using your energy to let twitter know how smart you are the say the consensus thing.\n I understand this view, deeply. In fact, all of us at TechCrunch understand this. One of the things that we pride ourselves on here is respecting the hustle. We know how hard it is to launch a startup. As a team, we collectively talk to thousands of founders every year, and we hear the heartbreaking stories and the downright trauma at times that comes with building a company. Occasionally (and yes, we focus most of our reporting here), we hear about the wins and successes too.\n Let’s be honest: most startups fail. Most ideas turn out wrong. Most entrepreneurs are never going to make it. That doesn’t mean no one should build a startup, or pursue their passions and dreams. And when success happens, we like to talk about it, report on, and try to explain why it happens — because ultimately, more entrepreneurial success is good for all of us and helps to drive progress in our world.\n But let’s also be clear that there are bad ideas, and then there are flagrantly bad ideas with billions in funding from smart people who otherwise should know better. Quibi wasn’t the spark of the proverbial college dropout with a passion for entertainment trying to invent a new format for mobile phones with ramen money from friends and family. Quibi was run by two of the most powerful and influential executives in the United States today, who raised more money for their project than  other female founders have raised collectively this year.\n Chen  makes an important point that many obvious ideas in tech started as dumb ideas. That’s true! In fact, the history of technology is littered with examples of ideas that investors and the press thought were either dumb or impossible to build (which is a more polite way to say “dumb”).\n for everyone who “obviously” knows when they see a bad idea in tech – everyone citing Quibi today – here’s a thread for you.  https://t.co/QpXXKG16Vm\n Why do supposedly dumb ideas turn out to be smart? Part of the reason is that what starts out as dumb slowly iterates into something that is very smart. Facebook was just a “facebook” for checking out your classmates on college campuses. If it had ended there and withered away like many other social networks before it, we might well have put it in the waste bin of history. But Zuckerberg and his crew iterated — adding features like photos, a feed, messaging and more with an extreme focus on growth that made the product so much more than when it started.\n We’ve seen this pattern again and again throughout time. Founders get feedback from users, they iterate, they pivot, they try new things, and slowly but surely they start to migrate from what might have been a very raw concept to something much more ready to compete in the ferocious marketplace of business and consumer attention today.\n This was never the story with Quibi. There was never an iteration of the product, or a long-range plan to assiduously cultivate users and talent as the company found traction while carefully husbanding its capital for the inevitable tough moments in the growth of any company.\n Yes, we in the commentariat do make mistakes, but analysts weren’t dumb in pointing out all of Quibi’s glaring, red-alert flaws. Those analysts were smart. They were right. They might not be right next time, of course — no analyst should get too overconfident in their predictions. But at the same time, we shouldn’t just collectively throw up our hands and declare every idea that comes our way a brilliant gift from the heavens. Most ideas  are dumb, and we and everyone else have every right to point that out.\n So respect the hustle. Don’t kick a hardworking entrepreneur down who is just trying to get their project out there and show it the world. But that doesn’t mean you can’t call out stupid when you see it. The best entrepreneurs know that — even at its most vituperative — critical feedback is the necessary ingredient to startup success. Lauding everyone lauds no one.", "posttime": "2020-10-23 01:08:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "喧嚣,hustle", "title": "\n尊重喧嚣，而不是愚蠢", "title_en": "\n\t\t\t\tRespect the hustle, not the stupidity\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/respect-the-hustle-not-the-stupidity/", "via": "", "real_tags": ["喧嚣", "hustle"]}, {"category": "", "categoryclass": "", "imagename": "7e710293ab8bd9b1975a165f299c902a.jpg", "infoid": 1030607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，22方的赞成票已经向该倡议投入了超过1.85亿美元。这一提议得到了优步(Uber)、Lyft、DoorDash、Insta和Postmate的资助，将确保工人仍然是独立的合同工。22号提案的失败将完全重新配置零工公司对工人的分类方式。\n在“混音”第三季的第一集，我们采访了两名临时工，提议的两边各一名。\n凡妮莎·贝恩(Vanessa Bain)是Insta的一名购物者，她反对22号提案。今年早些时候，她与人共同创立了零工工人集体，这是一个非营利性组织，旨在为零工工人争取公平的薪酬和更好的待遇。\n“我也会争论我们民主的未来。现实情况是，它建立了一个危险的先例，允许公司制定自己的劳动法，“贝恩继续说。“那里有明显的利益冲突，…。制定这项政策是为了单方面使公司受益，而损害工人的利益。“。\n住在棕榈泉的优步Eats和Postmate司机道格·米德(Doug Mead)完全没有让任何人感到惊讶，他直接坐在Yes on 22阵营，他有不同的感受。\n“这实际上是政府--他们的意图是解除个人对他们想要的补偿方式的控制。对我来说，这是毫无意义的。“米德告诉我们。“我应该控制自己想要如何获得补偿，以及由谁来补偿。”\n优步是为这一提议提供3000万美元资金的三家原始公司之一(另外两家是Lyft和DoorDash)，如果这一提议被否决，优步的商业模式将发生巨大变化。\n本月早些时候，梅根与优步政策、城市和交通主管蔡信培(Shin-pee Tsay)就一些话题进行了交谈，其中包括22号提案。她说，她理解司机双方都在努力解决的两难境地，但最终认为，司机目前拥有的灵活性值得保护。\n“但这并不完美，”蔡说。“我们应该更多地支持工人，而不是现有系统目前所能提供的，所以这是一种中间方式，你知道，既保护了灵活性，又提供了一些好处。”\nTsay指的是最低工资的120%，每参与英里30美分，以及医疗补贴，这取决于22号提案通过后的工作小时数。\n如果不能通过呢？或者，如果公司被迫设计某种神奇的混合分类，让所有司机受益，无论他们是想成为正式员工还是独立承包商？\n“我认为这在我们的分析中真的很有挑战性，从本质上说，我们必须开始确保覆盖范围，以确保有必要数量的司机来满足需求。需要做出这样的预测--我们只能提供一定数量的工作岗位来满足需求，因为人们将在固定的时间内工作。“。\n蔡说，手头的事情是让情况变得更好，而不是试图“修补两种不完美的定义”。\n“这是很多公司不得不关注的问题。我们正在尝试的，我们要面对的是，目前的系统是非常二元的。因此，我认为必须再次与城市、州和联邦政府合作，我们必须共同解决这个问题。这不是我们可以随便想出来的。而且我认为私营部门不应该仅仅靠自己的力量就能拿出来。“。\n贝恩和米德也在考虑这一提议将对优步和Lyft以外的劳动力的未来产生的潜在影响。他们都引用了所有地方的星巴克，都是出于非常不同的原因。\n米德告诉我们：“我理解对方的观点，显然有一些司机觉得他们赚的钱不够多。”“但他们要求的东西，对我来说，简直是荒唐可笑。他们想要等车就能拿到钱吗？真的？谁能拿到工钱来当服务员呢？\n“如果我是星巴克的咖啡师，店里会有几次没有顾客。然而，我也会花时间向顾客展示正在销售的产品，在商店里摆放展台，帮助清理商店。所以我还在工作，即使没有顾客。现在所有的工作都已经做完了，仍然没有客户。你猜怎么着？经理要把我送回家。他们不会让我在无事可做的时候呆在那里。所以我不会拿到钱让我等。为什么我现在要以独立承包商的身份拿到工资来等待呢？这对我来说毫无意义。“。\n贝恩资本使用了同样的例子，但方式截然不同。也是一场迎头痛击工人运动的运动。\n“我毫不怀疑…。如果22号提案成功，我们将看到星巴克(Starbucks)或沃尔玛(Walmart)等公司采取类似的策略，在这些公司，我们最终将在所有服务行业进行计件工资工作。如果我们是出纳员，我们会根据我们提出的每笔交易获得报酬。否则，如果我们是咖啡师，就得按我们做的拿铁付钱。\n“如果只需要把招聘流程和老板放到你手机上的一个应用程序中来重写劳动法，那么这个星球上的每一家公司都会这么做。”不幸的是，这里涉及的不仅仅是优步和Lyft，拼车和杂货送货，以及如何获得DoorDash订单。从字面上看，劳动力的未来岌岌可危。“", "note_en": "To date, the Yes on 22 side has put north of $185 million into the initiative. The proposition, funded by Uber, Lyft, DoorDash, Instacart and Postmates, would ensure workers remain independent contractors. A Prop 22 defeat would reconfigure fully how gig working companies classify their workers.\n On the first episode of Season 3 of Mixtape, we talked to two gig workers, one on each side of the proposition.\n  Vanessa Bain is an Instacart shopper who is opposed to Proposition 22. Earlier this year, she co-founded  Gig Workers Collective, a nonprofit to fight for fair pay and better treatment for gig workers.\n   “I would argue the future of our democracy as well. The reality is that it establishes a dangerous precedent to allow companies to write their own labor laws,” Bain continues. “There’s an obvious conflict of interest there… This policy was created to unilaterally benefit companies at the detriment of workers.”\n Surprising exactly no one, Doug Mead, an Uber Eats and Postmates driver who lives in Palm Springs and sits squarely in the Yes on 22 camp, feels differently.\n “It’s really the government — their intent to remove a person’s control over how they want to be compensated. And that to me just makes no sense whatsoever,” Mead told us. “I should be in control of how I want to be compensated and by who.”\n Uber, which was one of the three original companies (along with Lyft and DoorDash) to fund the proposition with $30 million, would see its business model change drastically if the proposition is defeated.\n Earlier this month, Megan spoke with Shin-pei Tsay, Uber’s director of policy, cities and transportation, about a number of topics, including Proposition 22. She says she understands the dilemma that drivers grapple with on both sides but ultimately believes that the flexibility drivers currently have is worth protecting.\n “But it isn’t perfect,” Tsay says. “We should be supporting workers more than the existing system enables currently, and so this is sort of a middle way of, you know, protecting that flexibility but also offering some benefits.”\n The benefits Tsay is referring to is the 120% of minimum wage, 30 cents per engaged mile, and healthcare subsidies dependent upon the number of hours worked if Prop 22 passes.\n And if it doesn’t pass? Or if the company is forced to devise some magical hybrid classification that benefits all drivers, whether they want to be full employees or independent contractors?\n “I think it’d be really challenging in our analysis, essentially, we would have to start to ensure that there’s coverage, to ensure that there’s the necessary number of drivers to meet demand. There would be this forecasting that needs to happen — we would only be able to offer a certain number of jobs to meet that demand, because people will be working in set amounts of time.”\n Tsay says that the matter at hand is to make the situation better rather than trying to “tinker around with two kinds of imperfect definitions.”\n  “This is something that a lot of companies have to look at. And what we’re trying, what we’re going up against is [that the] current system in place is very binary. And so I think it has to be, again, in partnership with cities, with states, with the federal government — we have to solve this together. This is not something that we just can come up with. And I don’t think the private sector should just come up with it on its own.”\n Both Bain and Mead are also thinking about the potential impact the proposition will have on the future of labor outside of your Ubers and Lyfts. And they both invoked Starbucks of all places and for very different reasons.\n  “I understand the other side’s point of view in terms of, there are apparently some drivers out there who don’t feel like they’re making enough money,” Mead told us. “But they’re asking for things, to me, that are just ridiculous. They want to get paid for waiting for a ride? Really? Who gets paid to wait on a job?\n “If I’m a barista at Starbucks, there are going to be times when there are no customers in the store. However, I’m also taking that time to present the product that’s being sold to the customers, to set up the displays in the stores, to help clean the store. So I’m still working, even if there’s no customers. Now all of that work has already been done, and there are still no customers. Guess what? The manager is going to send me home. They’re not going to allow me to stay there while there’s nothing to do. So I’m not going to get paid to wait. Why should I get paid to wait now as an independent contractor? That makes zero sense to me.”\n Bain uses the same example but in a drastically different way. And one that takes the labor movement head on.\n  “I have no doubt that … if Prop 22 were to succeed, we would see similar types of maneuvers from companies like Starbucks or Walmart, where we’re gonna end up with piece rate work in all of the service industry. Where we’re going to be paid per transaction that we bring up if we’re a cashier. Or we’re going to be paid per latte that we craft, if we’re a barista.\n “If all it takes is putting the hiring process and the bossing into an app on your phone to rewrite labor laws, every company on the planet is going to be doing that. There’s so much more, unfortunately, at stake here than just Uber and Lyft and ride share and grocery delivery and how you’re going to get your DoorDash orders. Literally the future of labor is at stake.”", "posttime": "2020-10-23 01:08:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,劳动,podcast", "title": "\n混音播客：22号命题与劳动分工", "title_en": "\n\t\t\t\tMixtape Podcast: Proposition 22 and the labor divide\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/mixtape-podcast-proposition-22-and-the-labor-divide/", "via": "", "real_tags": ["播客", "劳动", "podcast"]}, {"category": "", "categoryclass": "", "imagename": "4675c5fdf4ad5829c4a6746bc6a15482.jpg", "infoid": 1030606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近写了一篇文章，宣布在Amazon Elastic Compute Cloud(EC2)上提供M6g、R6g和C6g系列实例。与x86对应实例相比，这些实例提供了更好的性价比。它们基于AWS设计的AWS Graviton2处理器，采用64位ARM Neoverse N1内核。\n从今天开始，与上一代M5和R5数据库实例类型相比，借助适用于RDS的AWS Graviton2处理器，您还可以从Amazon Relational Database Service(RDS)数据库的更高性价比中获益。您可以在M6g和R6g实例系列和三个数据库引擎(MySQL 8.0.17及更高版本、MariaDB 10.4.13及更高版本以及PostgreSQL 12.3及更高版本)之间进行选择。\nM6g实例非常适合一般用途的工作负载。R6g实例提供的内存比M6g实例多50%，非常适合大数据分析等内存密集型工作负载。\n基于对具有不同计算和内存要求特征的工作负载的内部测试，Graviton2实例可为RDS开源数据库提供高达35%的性能提升和高达52%的性价比提升。\nGraviton2实例系列包括多个新的性能优化，例如每个内核更大的L1和L2缓存、比同类x86实例更高的Amazon Elastic Block Store(EBS)吞吐量、完全加密的RAM，以及本页详细介绍的许多其他功能。您现在就可以通过配置或迁移RDS实例，以最少的努力从这些优化中获益。\nRDS实例提供多种配置，从2个vCPU开始，8 GiB内存用于M6g，16 GiB内存用于R6g，高达10 Gbps的网络带宽，为您提供新的入门级通用和内存优化型实例。下表显示了可供您使用的实例大小列表：\n让我们启动您的第一个基于Graviton2的实例要启动新的RDS实例，我像往常一样使用AWS管理控制台或AWS命令行界面(CLI)，然后选择db.m6g或db.r6g实例类型之一(文档中的此页包含所有详细信息)。\nAWS rds create-db-instance\r--美国西部地区-2\\f25\r--db实例标识符$DB_INSTANCE_NAME\\\r--db-instance-class db.m6g.Large\\\r--Engine Postgres\\\r--引擎-版本12.3\\\r--已分配存储20\\\r--master-username$master_user\\\r--master-user-password$master_password\n迁移到Graviton2实例很容易，在AWS管理控制台中，我选择我的数据库，然后单击Modify。\n当您切换实例类型时，会出现短暂的服务中断。默认情况下，除非您启用ApplyImmedially选项，否则修改将在您的下一个维护窗口中进行。\n您可以在所有提供EC2 M6g和R6g的地区配置新的Amazon Relational Database Service(RDS)实例或迁移到Graviton2 Amazon Relational Database Service(RDS)实例：美国东部(弗吉尼亚州北部)、美国东部(俄亥俄州)、美国西部(俄勒冈州)、亚太地区(孟买)、亚太地区(新加坡)、亚太地区(悉尼)、亚太地区(东京)、欧洲(爱尔兰)和欧洲(法兰克福)AWS地区。\n与往常一样，让我们了解您在AWS论坛上的反馈或通过您通常的AWS联系方式。\n--SEB", "note_en": "I recently  wrote a post to announce the availability of  M6g,  R6g and  C6g families of instances on  Amazon Elastic Compute Cloud (EC2). These instances offer better cost-performance ratio than their x86 counterparts. They are based on AWS-designed  AWS Graviton2 processors, utilizing  64-bit Arm  Neoverse N1 cores.\n  Starting today, you can also benefit from better cost-performance for your  Amazon Relational Database Service (RDS) databases, compared to the previous M5 and R5 generation of database instance types, with the availability of  AWS Graviton2 processors for  RDS. You can choose between M6g and R6g instance families and three database engines ( MySQL 8.0.17 and higher,  MariaDB 10.4.13 and higher, and  PostgreSQL 12.3 and higher).\n  M6g instances are ideal for general purpose workloads. R6g instances offer 50% more memory than their M6g counterparts and are ideal for memory intensive workloads, such as Big Data analytics.\n  Graviton2 instances provide up to 35% performance improvement and up to 52% price-performance improvement for RDS open source databases, based on internal testing of workloads with varying characteristics of compute and memory requirements.\n  Graviton2 instances family includes several new performance optimizations such as larger  L1 and L2 caches per core, higher  Amazon Elastic Block Store (EBS) throughput than comparable x86 instances, fully encrypted RAM, and many others as  detailed on this page. You can benefit from these optimizations with minimal effort, by provisioning or migrating your  RDS instances today.\n  RDS instances are available in multiple configurations, starting with 2 vCPUs, with 8 GiB memory for M6g, and 16 GiB memory for R6g with up to 10 Gbps of network bandwidth, giving you new entry-level general purpose and memory optimized instances. The table below shows the list of instance sizes available for you:\n    Let’s Start Your First Graviton2 Based Instance  To start a new  RDS instance, I use the  AWS Management Console or the  AWS Command Line Interface (CLI), just like usual, and select one of the  db.m6g or  db.r6ginstance types ( this page in the documentation has all the details).\n      aws rds create-db-instance\r --region us-west-2 \\\r --db-instance-identifier $DB_INSTANCE_NAME \\\r --db-instance-class db.m6g.large \\\r --engine postgres \\\r --engine-version 12.3 \\\r --allocated-storage 20 \\\r --master-username $MASTER_USER \\\r --master-user-password $MASTER_PASSWORD\n      Migrating to  Graviton2 instances  is easy, in the  AWS Management Console, I select my database and I click  Modify.\n          There is a short service interruption happening when you switch instance type. By default, the modification will happen during your next maintenance window, unless you enable the  ApplyImmediately option.\n  You can provision new or migrate to  Graviton2  Amazon Relational Database Service (RDS) instances in all regions where  EC2 M6g and R6g are available :  US East (N. Virginia),  US East (Ohio),  US West (Oregon),  Asia Pacific (Mumbai),  Asia Pacific (Singapore),  Asia Pacific (Sydney),  Asia Pacific (Tokyo),  Europe (Ireland), and  Europe (Frankfurt) AWS Regions.\n  As usual, let us know your feedback on the  AWS Forum or through your usual AWS contact.\n  -- seb", "posttime": "2020-10-23 01:04:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,处理器,rds,实例", "title": "基于Graviton2处理器的Amazon RDS", "title_en": "Amazon RDS on Graviton2 Processors", "transed": 1, "url": "https://aws.amazon.com/blogs/aws/new-amazon-rds-on-graviton2-processors/", "via": "", "real_tags": ["amazon", "处理器", "rds", "实例"]}, {"category": "", "categoryclass": "", "imagename": "b4c486a9acc500f3aaa81efeed88c872.jpg", "infoid": 1030605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这轮融资由General Catalyst牵头，之前的投资者South Park Commons Fund和一群天使参与其中，其中包括Lee Fixel、Elad Gil和GitHub CTO(以及Heroku的前工程副总裁)Jason Warner。\n该公司自称是AWS、Azure和谷歌云(Google Cloud)的“Zero DevOps替代品”，最初在2019年4月筹集了225万美元的种子轮资金，但在赢得“扰乱战场”(Disrupt Battlefield)后获得了大量入场兴趣。但最终，该团队决定简单地从现有投资者那里筹集更多资金。\nRender的联合创始人兼首席执行官阿努拉格·戈尔解释说：“我们在Disrupt之后采访了很多人，包括阿什顿·库彻的公司，因为他是评委之一。”“最终，我们决定从现有投资者那里筹集更多资金，因为我们喜欢他们，这帮助我们从现有投资者那里获得了更好的交易。他们都对继续投资非常感兴趣。“。\n让Render脱颖而出的是它实现了Heroku的许多承诺，也许还有Google Cloud的App engine。您只需告诉它您要部署哪种服务，它就会为您处理部署和管理基础设施。\n“我们的客户都是编写代码的人。他们只是想真正轻松地部署这些代码，而不必担心服务器、维护或依赖于DevOps团队--或者在许多情况下，雇佣DevOps团队。“Goel说。“DevOps的工程师非常昂贵，而且很难找到，特别是优秀的。我们的目标是消除DevOps人员在每家公司所做的所有工作，因为每家公司的情况都非常相似。“。\n该公司今天推出的一项新功能是预览环境。您可以将它们视为一次性试运行或开发环境，开发人员可以启动它们来测试他们的代码，并承诺测试环境将与您的生产环境看起来相同(或者您也可以指定更改)。然后，开发人员可以在此环境中与QA或其产品和销售团队协作测试他们的更新。\n渲染时开发团队在一个YAML文件中指定他们的基础设施环境，打开这些新的预览环境就像在该文件中设置标志一样简单。\n“一旦他们这样做了，那么对于每个拉取请求-因为我们与GitHub和GitLab集成-我们会自动启动该环境的副本。这包括生产中的任何东西，或者像Redis实例、托管Postgres数据库、Elasticsearch实例，或者显然是API、Web服务和静态站点。“Goel说。每次您将更改推送到该分支或拉入请求时，环境也会自动更新。拉取请求关闭或合并后，Render会自动销毁环境。\n该公司将利用新的资金来壮大其团队，并扩大其服务。戈埃尔告诉我，计划是明年筹集更大规模的首轮融资。", "note_en": "The round was led by  General Catalyst,   with participation from previous investors South Park Commons Fund and a group of angels that includes Lee Fixel, Elad Gil and  GitHub   CTO (and former VP of Engineering at  Heroku)   Jason Warner.\n The company, which describes itself as a ‘Zero DevOps alternative to AWS, Azure and Google Cloud,’ originally raised a $2.25 million seed round in April 2019, but it got a lot of inbound interest after winning the Disrupt Battlefield. In the end, though, the team decided to simply raise more money from its existing investors.\n   “We spoke to a bunch of people after Disrupt, including  Ashton Kutcher’s   firm, because he was one of the judges,” Render co-founder and CEO Anurag Goel explained. “In the end, we decided that we would just raise more money from our existing investors because we like them and it helped us get a better deal from our existing investors. And they were all super interested in continuing to invest.”\n  What makes Render stand out is that it fulfills many of the promises of  Heroku   and maybe Google Cloud’s App Engine. You simply tell it what kind of service you are going to deploy and it handles the deployment and manages the infrastructure for you.\n “Our customers are all people who are writing code. And they just want to deploy this code really easily without having to worry about servers, or maintenance, or depending on DevOps teams — or, in many cases, hiring DevOps teams,” Goel said. “DevOps engineers are extremely expensive to hire and extremely hard to find, especially good ones. Our goal is to eliminate all of that work that DevOps people do at every company, because it’s very similar at every company.”\n  One new feature the company is launching today is preview environments. You can think of them as disposable staging or development environments that developers can spin up to test their code — and Render promises that the testing environment will look the same as your production environment (or you can specify changes, too). Developers can then test their updates collaborative with QA or their product and sales teams in this environment.\n Development teams on Render specify their infrastructure environments in a YAML file and turning on these new preview environments is as easy as setting a flag in that file.\n  “Once they do that, then for every pull request – because we’re integrated with GitHub and  GitLab   — we automatically spin up a copy of that environment. That include that can include anything you have in production, or things like a Redis instance, or managed Postgres database, or Elasticsearch instance, or obviously API’s and web services and static sites,” Goel said. Every time you push a change to that branch or pull request, the environment is automatically updated, too. Once the pull request is closed or merger, Render destroys the environment automatically.\n The company will use the new funding to grow its team and build out its service. The plan, Goel tells me, is to raise a larger Series A round next year.", "posttime": "2020-10-23 00:45:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "devops,render,环境", "title": "\nRender为其DevOps平台筹集了450万美元", "title_en": "\n\t\t\t\tRender raises $4.5M for its DevOps platform\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/render-raises-4-5m-for-its-devops-platform/", "via": "", "real_tags": ["devops", "render", "环境"]}, {"category": "", "categoryclass": "", "imagename": "ede5d4c5545be914e9a83305bdec9313.jpg", "infoid": 1030604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "突然之间，帮助这两个概念中的任何一个的初创公司都看到了需求的上升，即使在经济环境总体艰难的一年里也是如此。如果你有幸帮助公司将流程数字化或改善客户与公司的互动方式，你可能会看到客户和潜在收购者的兴趣与日俱增(甚至在今年之前就是这样)。一个恰当的例子是Twilio最近以32亿美元收购了Segment，以帮助构建数据驱动的应用程序，以便与客户互动。\n尽管建立积极的客户体验从来都不完全是关于数字的，但在一个很难与客户面对面互动的时候，数字的一面已经变得新的紧迫。随着新冠肺炎在今年站稳脚跟，大大小小的企业突然意识到，与客户联系的唯一方式是数字。在这一点上，当其他相互联系的方式受到严重限制时，数字转型成为客户体验的伙伴。\n这些天来，我采访的几乎每一位初创公司创始人，以及规模更大、更成熟的公司，都在谈论这场流行病如何推动公司进行数字化转型，速度远远快于没有COVID的情况。\nCRM Essentials创始人布伦特·利里(Brent Leary)表示，大流行无疑加速了将这两个伟大想法结合在一起的需要，并在这种情况下创造了机会。Leary告诉TechCrunch：“冠状病毒在很多方面对很多人来说都很可怕，它为公司创造了建立直接面向消费者(D2C)的数字管道的机会，尽管目前困难重重，这些数字管道可以让他们成为更强大的公司。”\n云在数字化转型过程中扮演着重要角色，在过去的十年里，我们看到公司缓慢但稳定地转向云。当你遇到像冠状病毒那样的情况时，一切都会变得更快。事实证明，在云中可以帮助您更快地移动，因为您不必担心运行业务关键型应用程序的所有开销，因为SaaS供应商会为您解决所有这些问题。", "note_en": "Suddenly startups that help with either of these concepts are seeing rising demand, even in a year with an overall difficult economic climate. If you are fortunate enough to be helping companies digitize a process or improve how customers interact with companies, you may be seeing increased interest from customers and potential acquirers (and this was true even before this year). A case in point is  Twilio acquiring Segment for $3.2 billion recently to help build data-fueled applications to interact with customers.\n Even though building a positive customer experience has never been completely about digital, at a time where it’s difficult to interact with customers in person, the digital side of it has taken new urgency. As COVID-19 took hold this year, businesses, large and small, suddenly realized the only way to connect to their customers was digitally. At that point, digital transformation became customer experience’s buddy when other ways of contacting one another have been severely limited.\n  Just about every startup founder I talk to these days, along with bigger, more established companies, talk about how the pandemic has pushed companies to digitally transform much faster than they would have without COVID.\n Brent Leary, founder at CRM Essentials, says that the pandemic has certainly expedited the need to bring these two big ideas together and created opportunities as that happens. “The coronavirus, as terrible as it has been in so many ways to so many people, has created opportunities for companies to build direct-to-consumer (D2C) digital pipelines that can make them stronger companies despite the current hardships,” Leary told TechCrunch.\n The cloud plays a big role in the digital transformation process, and for the last decade, we have seen companies make a slow but steady shift to the cloud. When you have a situation like we’ve had with the coronavirus, it speeds everything up. As it turns out, being in the cloud helps you move faster because you don’t have to worry about all of the overhead of running a business critical application as the SaaS vendors take care of all that for you.", "posttime": "2020-10-23 00:45:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "体验,experience", "title": "\n在大流行期间，客户体验和数字转型概念正在融合", "title_en": "\n\t\t\t\tCustomer experience and digital transformation concepts are merging during the pandemic\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/customer-experience-and-digital-transformation-concepts-are-merging-during-the-pandemic/", "via": "", "real_tags": ["体验"]}, {"category": "", "categoryclass": "", "imagename": "c01913a52f409502cd32a8816c04e869.jpeg", "infoid": 1030602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莫斯科(路透社)-美国举报人爱德华·斯诺登(Edward Snowden)的律师周四表示，俄罗斯已经授予他永久居留权，如果他想要的话，这是向俄罗斯公民身份迈出的一步。\n现年37岁的斯诺登在2013年泄露秘密文件后逃离美国，并在俄罗斯获得庇护。这些文件显示，他曾在美国国家安全局(U.S.National Security Agency)担任承包商，开展了大规模的国内和国际监控行动。\n多年来，美国当局一直希望斯诺登返回美国，接受2013年提出的间谍指控的刑事审判。\n他的俄罗斯律师阿纳托利·库切列纳(Anatoly Kucherena)告诉路透社：“他的(俄罗斯)居留证即将到期，我们要求延长。”库切列纳说，冠状病毒大流行使这一过程比往常更长。\n“我们在4月份提交了文件，我们(在周四)获得了永久居留权，”他说。\n另外，库切列纳告诉塔斯社，斯诺登现阶段不考虑申请俄罗斯护照。\n斯诺登在俄罗斯保持低调。他赞扬了这个国家的自然美景和人民的温暖，同时不时地使用社交媒体批评政府的政策。", "note_en": "MOSCOW (Reuters) - Russia has granted U.S. whistleblower Edward Snowden permanent residency rights, his lawyer said on Thursday, a step towards Russian citizenship if he wants it.\n Snowden, 37, fled the United States and was given asylum in Russia after leaking secret files in 2013 that revealed vast domestic and international surveillance operations carried out by the U.S. National Security Agency where he was a contractor.\n U.S. authorities have for years wanted Snowden returned to the United States to face a criminal trial on espionage charges brought in 2013.\n  “His (Russian) residency permit was expiring and we asked to extend it,” Anatoly Kucherena, his Russian lawyer, told Reuters. Kucherena said the coronavirus pandemic had made the process longer than usual.\n “We submitted the documents in April and we got the permanent residency rights (on Thursday),” he said.\n Separately, Kucherena told the TASS news agency that Snowden was not considering applying for a Russian passport at this stage.\n   Snowden keeps a low profile in Russia. He has praised the country’s natural beauty and the warmth of its people, while using social media to criticise government policy from time to time.", "posttime": "2020-10-23 00:41:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,给予,whistleblower", "title": "俄罗斯给予举报人爱德华·斯诺登永久居留权", "title_en": "Russia gives whistleblower Edward Snowden permanent residency rights", "transed": 1, "url": "https://www.reuters.com/article/usa-security-snowden-russia-int-idUSKBN2771Q3", "via": "", "real_tags": ["俄罗斯", "给予"]}, {"category": "", "categoryclass": "", "imagename": "af62daf8ef2bb0719075fe04e35ad4e0.jpeg", "infoid": 1030601, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TL；DR：在云中模糊化嵌入式软件时，我们是否可以使用GPU获得10倍的性能/美元？根据我们的初步工作，我们认为答案是肯定的！\n模糊是一种软件测试技术，它为程序提供许多随机化的输入，试图导致意想不到的行为。它是一项重要的行业标准技术，负责发现许多安全漏洞并预防更多漏洞。然而，很好地模糊化需要时间，并且模糊化嵌入式软件带来了额外的挑战。\n嵌入式平台不是为通过模糊查找错误所需的工具和高通量计算而设计的。在不访问源代码的情况下，此类平台的实际模糊化需要速度较慢的仿真器，或者需要许多物理设备，而这通常是不切实际的。\n大多数模糊方法都使用传统的CPU架构或仿真器，但我们决定使用其他商用硬件来解决这个问题-特别是GPU。最近机器学习的繁荣压低了GPU的非高峰价格，并使所有主要的云提供商都可以轻松获得巨大的GPU计算能力。GPU非常擅长并行执行任务，而模糊化是一个很容易并行化的问题。\n在这篇博客文章中，我将带你完成这个基于GPU的大规模并行模糊器的设计和实现。到目前为止，我们已经实现了一个执行引擎，它可以实现比libFuzzer多5倍的执行/秒/美元-而且还有更大的优化空间。\n模糊的目的是向程序生成意外的输入，并导致不想要的行为(例如，崩溃或内存错误)。最常用的模糊器是覆盖率引导的模糊器，它专注于查找导致新代码覆盖的输入(例如执行以前没有执行过的函数)，以探索可能导致程序崩溃的边缘情况。\n为此，模糊器通过目标程序运行许多不同的随机输入。此任务很容易并行化，因为每个输入都可以独立于其他输入执行。\nGPU相当便宜；在Google Cloud上购买一辆可抢占的特斯拉T4的价格是0.11美元/小时。此外，GPU非常擅长并行执行许多事情-特斯拉T4可以在40,000多个线程之间进行上下文切换，并可以同时执行其中的2,560个线程-如上所述，模糊是一个自然可以并行化的问题。使用数千个线程，理论上我们应该能够同时测试数千个不同的输入。\n简而言之，在几个关键方面，在GPU上运行代码与在CPU上运行代码有很大的不同。\n首先，GPU不能直接执行x86/aarch64/等指令，因为GPU有自己的指令集。我们的目标是模糊没有源代码的嵌入式软件。由于手头只有一个二进制文件，我们没有简单的方法来生成要运行的GPU程序集。\n其次，GPU没有操作系统。传统的并行模糊器可以启动多个进程，这些进程可以单独执行输入，而不会干扰其他进程。如果输入导致一个进程崩溃，其他进程不会受到影响。GPU没有进程或地址空间隔离的概念，任何内存违规都会导致整个Fuzzer崩溃，因此我们需要找到某种方法来隔离正在Fuzize的程序的并行实例。\n此外，如果没有操作系统，就没有人在家应答系统调用，这些调用使程序能够打开文件、使用网络等。系统调用必须被仿真或中继回CPU才能由主机操作系统执行。\n最后，GPU内存很难管理好。GPU具有复杂的内存层次结构，具有几种不同类型的内存，并且每种内存都具有不同的易用性和性能特征。性能高度依赖于内存访问模式，控制线程访问内存的时间和方式可以决定应用程序的成败。此外，没有太多内存可供分配，这使得正确管理内存布局和访问模式变得更加困难。拥有16 GB的设备内存听起来可能令人印象深刻，但将其分配给40,000个执行线程，每个线程只有微不足道的419 KiB。\n要构建一个可以工作的GPU模糊器有很多障碍，但没有一个是不可逾越的。\n首先，让我们看看是否可以在GPU上运行aarch64二进制文件。\n如前所述，我们希望模糊化嵌入式二进制文件(例如，ARMv7、aarch64等)。在GPU上。NVIDIA GPU使用一种不同的指令集架构，称为PTX(“并行线程执行”)，因此我们不能直接执行我们想要模糊的二进制文件。这个问题的一个常见解决方案是仿真嵌入式CPU，但是为GPU开发CPU仿真器可能是一项昂贵的投资，而且性能会很差。另一种选择是将二进制文件转换为PTX，这样它们就可以直接在GPU上执行，而无需仿真。\nTRAIL of BITS已经开发了一个叫做REMILL的二进制翻译工具，我们可以用它来做这件事。Remill将二进制文件“提升”到LLVMIR(中间表示)，然后可以重定目标并编译到LLVM项目支持的任何架构。碰巧LLVM支持将LLVM IR作为PTX代码发出，这非常适合我们的目的。\n假设我们有这个简单的示例函数，它将w19设置为0，加5，然后返回结果：\n我们可以将这些指令的字节传递给Remill，它会生成LLVM IR，对在ARM处理器上执行的原始程序进行建模：\n然后，通过一些优化，我们可以让LLVM将上面的LLVM IR编译为PTX程序集：\n最后，我们可以将此PTX加载到GPU中并执行它，就像我们首先可以访问源代码一样。\n如前所述，GPU没有操作系统来提供进程之间的隔离。我们需要实现地址空间隔离，以便模糊化程序的多个实例可以访问同一组内存地址，而不会相互干扰，并且需要检测目标程序中的内存安全错误。\nRemill将原始程序中的所有内存访问替换为对特殊函数read_memory和write_memory的调用。通过提供这些功能，我们可以实现一个软件内存管理单元，它可以填补缺失的操作系统功能，并调解内存访问。\n例如，考虑以下函数，该函数接受一个指针并递增其指向的整数：\nRemill将此程序集转换为以下IR，其中包含READ_MEMORY调用、ADD指令和WRITE_MEMORY调用：\n通过提供__REMILL_READ_MEMORY_32和__REMILL_WRITE_MEMORY_32函数，我们可以为每个线程提供自己的虚拟地址空间。此外，我们还可以验证内存访问，并在无效访问使整个模糊器崩溃之前拦截它。\n不过，请记住，如果跨40,000个线程共享，16 GB的设备内存实际上并不多。为了节省内存，我们可以在MMU中使用写入时复制策略；线程共享相同的内存，直到其中一个线程写入内存，此时该内存被复制。以这种方式保存内存是一种令人惊讶的有效策略。\n太棒了--我们有一些管用的东西！我们可以获取一个二进制程序，将其转换为LLVM，将其转换为PTX，混入一个MMU，然后在数千个GPU线程上并行运行结果。\n但是，我们如何实现我们的目标，建立一个模糊，达到10倍的性能每美元与其他模糊的比较呢？\n评估Fuzzer是一件非常棘手的事情，已经发表了很多关于如何有效地比较它们的论文。我们的模糊器还太年轻，还不能正确评估，因为我们仍然缺少关键的模糊器组件，如变频器，以生成程序的新输入。要仅测量执行器性能，我们可以查看Fuzzer通过目标程序运行输入的速度(以执行/秒为单位)。通过标准化计算硬件的成本(GPU比运行其他模糊器的CPU更贵)，我们可以比较执行/秒/$。\n在我们的基准测试中，我们应该模糊什么？出于以下几个原因，libpcap中的BPF数据包过滤代码似乎是一个很好的候选代码：\n它实现了一个复杂的状态机，人类很难对其进行推理，这使得它成为模糊化的一个很好的候选者。\nBPF组件在过去有过错误，所以这是一个我们可能想要模糊的现实目标。\n让我们编写一个测试应用程序，该应用程序从Fuzzer获取数据包并在其上运行复杂的BPF过滤器程序：\n这个测试程序没有做很多事情，但是它确实执行了复杂的逻辑，并且需要大量的内存访问。\n要评价我们的模糊器，我们可以把它与libFuzzer相比较，libFuzzer是一种应用广泛的快速模糊器。这不是一个完全公平的比较。一方面，libFuzzer解决了一个更简单的问题：它使用测试程序的源代码进行模糊处理，而我们的Fuzzer则翻译并检测为不同架构编译的二进制代码。在安全研究中，源代码通常是不可用的。另一方面，libFuzzer正在执行突变以生成新的输入，而我们没有这样做。虽然显然不完美，但这种比较将足够好地提供数量级的估计。\n我使用Google Compute engine 8核N1实例(撰写本文时不可抢占实例的价格为0.379998美元/小时)和Tesla T4GPU(撰写本文时价格为0.35美元/小时)进行了比较。\n不幸的是，我们的绒毛器比不上libFuzzer。LibFuzzer可以达到520万个execs/s/$，而我们的Fuzzer只能达到361k个execs/s/$。\n在我们开始优化性能之前，我们应该分析一下Fuzzer，以便更好地了解它的性能。NVIDIA的NSight Compute Profiler有助于解释硬件利用率和性能瓶颈。\n从配置文件中，我们可以看到GPU只使用了其计算能力的3%。大多数情况下，GPU计算硬件处于闲置状态，什么也不做。\n这通常是因为内存延迟较高：GPU正在等待内存读/写完成。然而，这并没有发生，因为我们的Fuzzer需要访问太多的内存；配置文件显示GPU只使用了其可用内存带宽的45%。相反，我们访问内存的效率肯定非常低。每次存储器访问都需要很长时间，并且没有提供足够的数据用于计算。\n要解决这个问题，我们需要更好地理解GPU的执行模型。\nGPU线程以32个为一组执行，称为扭曲。WARP中的所有线程在并行多处理器中一起执行，并且它们以锁步方式运行，即它们同时运行相同的指令。\n当线程读取或写入内存时，内存访问以128字节的块为单位进行。如果WARP中的32个线程试图读取位于同一128字节块中的内存，那么硬件将只需要从内存总线请求一个块(一个“事务”)。\n然而，如果每个线程都从不同的块读取存储器地址，则硬件可能需要进行32个单独的存储器事务，这些事务通常是串行化的。这导致了我们在配置文件中发现的行为：计算硬件几乎总是空闲的，因为它必须等待如此多的内存事务才能完成。内存带宽利用率看起来并不是很差，因为正在读取许多128字节的区块，但每个区块中只有4或8个字节被实际使用，因此浪费了大量使用的带宽。\n目前，我们为每个线程分配单独的内存，因此当一个线程访问内存时，它很少落入与不同线程相同的128字节块中。我们可以通过为一个扭曲(32个线程)分配一个内存片，并在该扭曲内交织线程的内存来改变这一点。这样，当线程需要访问内存中的值时，它们的值都是相邻的，并且GPU可以通过单个内存事务来完成这些内存读取。\n尝试一下，我们发现性能提高了一个数量级！显然，在为GPU编程时了解内存访问模式是极其重要的。\n重新运行性能分析器，我们可以看到，我们的计算利用率有了很大提高(33%，高于3%)，但我们仍远未达到完全利用率。我们能做得更好吗？\n继续检查内存使用模式，让我们看看使用的内存类型。NVIDIA GPU有几种位于不同物理位置的内存，但最容易使用的类型称为“统一内存”，它代表我们在不同物理位置之间自动传输数据。我们一直在使用它，因为它不需要我们过多地考虑字节的物理存储位置，但是如果管理不当可能会导致性能瓶颈，因为数据将在物理内存位置之间低效传输。\n由于我们仍然看到非常高的内存延迟，让我们更仔细地看看这些传输。\n我们的简单模糊器是“轮次”工作的：如果GPU可以运行40,000个线程，我们将40,000个输入传递给GPU，每个线程在我们启动下一轮之前对一个输入进行模糊处理。在两轮之间，我们重置使用的内存(例如，被模糊化的程序使用的覆盖范围跟踪数据结构和内存)。然而，这会导致GPU和CPU之间在每轮之间进行大量数据传输，因为内存会被分页回CPU、重置，然后再分页回GPU。当这些传输正在进行时，GPU什么也不做。当GPU等待CPU启动下一轮时，会产生额外的延迟。\n我们可以通过单次启动GPU代码并避免CPU和GPU之间的同步来改进此设置。许多数据不需要在统一内存中；相反，我们可以在GPU上分配全局内存，然后在需要发送有关Fuzization进度的信息(例如，哪些输入导致崩溃)时将数据异步传输到CPU。这样，当线程完成对输入的模糊化时，它可以重置内存并继续进行下一个输入，而不需要数据传输开销，也不需要等待CPU。\n这几乎实现了另一个数量级的加速！现在，一美元比libFuzzer快五倍左右。\n这是非常有前途的--尽管我们的Fuzzer缺少突变引擎并且不能处理系统调用，但是超过libFuzzer如此程度的性能表明使用GPU的Fuzze对于某些应用程序可能非常有用。\n虽然我们已经接近这个测试程序的性能目标，但是这个项目还有很长的路要走。硬件利用率仍然较低，因此还有进一步优化的空间。\n此外，我们需要构建对处理系统调用的支持，这在模糊化I/O繁重的应用程序时可能会对性能产生重大影响。在这个Fuzzer有用之前，我们还需要构建突变引擎，尽管这个问题比构建执行引擎更容易理解。\n尽管如此，我们仍然非常兴奋能在如此早期的开发阶段获得如此有希望的结果。我们期待在模糊化嵌入式二进制文件方面有一个数量级的改进。\n我们很想听听您对这项工作的看法！联系我们：ryan@reberhardt.com或artem@trailofbits.com。\n最后，我要向Artem Dinaburg致以极大的感谢，感谢他对这个系统的初步设计，以及在整个项目过程中对我的指导。同时，感谢Peter Goodman提供设计反馈和调试建议。", "note_en": "TL;DR: Can we use GPUs to get 10x performance/dollar when fuzzing embedded software in the cloud? Based on our preliminary work, we think the answer is yes!\n Fuzzing is a software testing technique that supplies programs with many randomized inputs in an attempt to cause unexpected behavior. It’s an important, industry-standard technique responsible for the discovery of many security vulnerabilities and the prevention of many more. However, fuzzing well takes time, and fuzzing embedded software presents additional challenges.\n Embedded platforms are not designed for the instrumentation and high-throughput computation required to find bugs via fuzzing. Without access to source code, practical fuzzing of such platforms requires an emulator, which is slow, or many physical devices, which are often impractical.\n Most fuzzing approaches have used conventional CPU architectures or emulators, but we decided to use other commodity hardware to tackle this problem—in particular, GPUs. The recent boom in machine learning has driven down the off-peak price of GPUs and made massive GPU computing capacity readily available from all major cloud providers. GPUs are very good at executing tasks in parallel, and fuzzing is an easily parallelizable problem.\n In this blog post, I’ll walk you through the design and implementation of this massively parallel GPU-based fuzzer. So far, we’ve implemented an execution engine that can achieve 5x more executions/second/dollar than libFuzzer—and there’s much more room for optimization.\n   Fuzzing aims to generate unexpected inputs to a program and cause undesired behaviors (e.g., crashes or memory errors). The most commonly used fuzzers are coverage-guided fuzzers, which focus on finding inputs that cause new code coverage (such as executing a function that wasn’t executed before) to explore edge cases that may crash the program.\n    To do this, fuzzers run many different randomized inputs through the target program. This task is easily parallelizable, as each input can be executed independently of the others.\n GPUs are fairly cheap; it costs $0.11/hour for a pre-emptible Tesla T4 on Google Cloud. Also, GPUs are really good at executing many things in parallel—a Tesla T4 can context-switch between over 40,000 threads and can simultaneously execute 2,560 of them in parallel—and, as mentioned, fuzzing is a naturally parallelizable problem. Using thousands of threads, we should theoretically be able to test thousands of different inputs at the same time.\n  In short, running code on GPUs is very different from running code on CPUs in a few critical ways.\n First, a GPU cannot directly execute x86/aarch64/etc. instructions, as GPUs have their own instruction set. Our goal is to fuzz embedded software for which no source code is available. With only a binary in hand, we have no easy way of generating GPU assembly to run.\n Second, a GPU has no operating system. Traditional parallel fuzzers  launch multiple processes that can execute inputs separately without interfering with other processes. If an input causes one process to crash, other processes will be unaffected. GPUs have no notion of processes or address space isolation, and any memory violation will cause the entire fuzzer to crash, so we need to find some way to isolate the parallel instances of the program being fuzzed.\n Additionally, without an operating system, there’s no one home to answer system calls, which enable a program to open files, use the network, and so on. System calls must be emulated or relayed back to the CPU to be executed by the host operating system.\n Finally, GPU memory is hard to manage well. GPUs have complicated memory hierarchies with several different types of memory, and each has different ease-of-use and performance characteristics. Performance is highly dependent on memory access patterns, and controlling when and how threads access memory can make or break an application. Additionally, there isn’t much memory to go around, making it even more difficult to properly manage memory layout and access patterns. Having 16GB of device memory might sound impressive, but splitting it between 40,000 threads of execution leaves each thread with a paltry 419 KiB.\n  There are many obstacles to building a working GPU fuzzer, but none of them are insurmountable.\n  First, let’s see if we can get  aarch64 binaries running on the GPU.\n As mentioned, we want to fuzz embedded binaries (e.g., ARMv7, aarch64, etc.) on the GPU. NVIDIA GPUs use a different instruction set architecture called PTX (“Parallel Thread eXecution”), so we cannot directly execute the binaries we want to fuzz. A common solution to this problem is to emulate an embedded CPU, but developing a CPU emulator for GPUs would likely be an expensive investment that would perform poorly. Another alternative is to translate binaries to PTX so they can execute directly on the GPU without emulation.\n Trail of Bits has developed a binary translation tool called  Remill that we can use to do this. Remill “lifts” binaries to LLVM IR (intermediate representation), which can then be retargeted and compiled to any architecture supported by the LLVM project. It just so happens that LLVM supports emitting LLVM IR as PTX code, which is perfect for our purposes.\n  Say we have this simple example function, which sets w19 to 0, adds 5, and returns the result:\n  We can pass the bytes for these instructions to Remill, which produces LLVM IR that models the original program executing on an ARM processor:\n  Then, with some optimizations, we can have LLVM compile the above LLVM IR to PTX assembly:\n  Finally, we can load this PTX into a GPU and execute it as if we’d had access to the source code in the first place.\n  As mentioned earlier, GPUs have no operating system to provide isolation between processes. We need to implement address space isolation so multiple instances of the fuzzed program can access the same set of memory addresses without interfering with each other, and we need to detect memory safety errors in the target program.\n Remill replaces all memory access in the original program with calls to the special functions read_memory and write_memory. By providing these functions, we can implement a software memory management unit that  fills in for the missing OS functionality and mediates memory accesses.\n  For example, consider this function that takes a pointer and increments the integer it points to:\n  Remill translates this assembly into the following IR containing a read_memory call, an add instruction, and a write_memory call:\n  By providing __remill_read_memory_32 and __remill_write_memory_32 functions, we can give each thread its own virtual address space. In addition, we can validate memory access and intercept invalid access before it crashes the entire fuzzer.\n Remember, though, that 16GB of device memory is actually not much when shared across 40,000 threads. To conserve memory, we can use copy-on-write strategies in our MMU; threads share the same memory until one of the threads writes to memory, at which point that memory is copied. Conserving memory this way has been a surprisingly effective strategy.\n  Wonderful—we have something that works! We can take a binary program, translate it to LLVM, convert it to PTX, mix in an MMU, and run the result on thousands of GPU threads in parallel.\n  But how well are we meeting our goal of building a fuzzer that achieves 10x performance per dollar when compared to other fuzzers?\n Evaluating fuzzers is a very tricky business, and there have been many papers published about how to effectively compare them. Our fuzzer is still too young to properly evaluate, since we are still missing critical fuzzer components such as a mutator to generate new inputs to the program. To measure executor performance only, we can look at how quickly our fuzzer runs inputs through the target program (in executions/second). By normalizing the cost of the compute hardware (GPUs are more expensive than the CPUs on which other fuzzers run), we can compare executions/second/$.\n What should we fuzz in our benchmarking tests? The  BPF packet filtering code from libpcap seems like a good candidate for a few reasons:\n It implements a complicated state machine that is too difficult for humans to reason about, making it a good candidate for fuzzing.\n BPF components have had bugs in the past,  so this is a realistic target that we might want to fuzz.\n Let’s write a test application that takes a packet from the fuzzer and runs a complicated BPF filter program on it:\n  This test program doesn’t do a whole lot, but it does exercise complicated logic and requires a good amount of memory access.\n To evaluate our fuzzer, we can compare it to  libFuzzer, a fast and widely used fuzzer. This isn’t an entirely fair comparison. On one hand, libFuzzer solves an easier problem: It fuzzes using the test program’s source code, whereas our fuzzer translates and instruments a binary compiled for a different architecture. Source code is often unavailable in security research. On the other hand, libFuzzer is performing mutation to generate new inputs, which we are not doing. While obviously imperfect, this comparison will work well enough to provide order-of-magnitude estimates.\n I ran this comparison using Google Compute Engine 8-core N1 instances ($0.379998/hour for non-preemptible instances at time of writing) and a Tesla T4 GPU ($0.35/hour at time of writing).\n Unfortunately, our fuzzer doesn’t compare so well against libFuzzer. libFuzzer achieves 5.2M execs/s/$, and our fuzzer only achieves 361K execs/s/$.\n    Before we start optimizing performance, we should profile the fuzzer to get a better sense of how it’s performing. Nvidia’s  Nsight Compute profiler helps explain hardware utilization and performance bottlenecks.\n  From the profile, we can see that the GPU is only using 3% of its compute capacity. Most of the time, the GPU compute hardware is sitting idle, not doing anything.\n This generally happens because of high memory latency: The GPU is waiting for memory reads/writes to complete. However, this isn’t happening because our fuzzer needs to access too much memory; the profile shows that the GPU is only using 45% of its available memory bandwidth. Rather, we must be accessing memory very inefficiently. Each memory access is taking a long time and not providing enough data for computation.\n To fix this problem, we need a better understanding of a GPU’s execution model.\n GPU threads execute in groups of 32 called a warp. All threads in a warp execute together in a parallel multiprocessor, and they run in lockstep, i.e., they run the same instruction at the same time.\n When threads read or write memory, the memory accesses happen in 128-byte blocks. If the 32 threads in the warp try to read memory that lies in the same 128-byte block, then the hardware will only need to request one block (one “transaction”) from the memory bus.\n However, if the threads each read memory addresses from different blocks, the hardware may need to make 32 separate memory transactions, which are often serialized. This leads to the behavior we found in the profile: The compute hardware is almost always idle because it has to wait for so many memory transactions to complete. The memory bandwidth utilization doesn’t appear quite as bad because many 128-byte chunks are being read, but only four or eight bytes out of each chunk are actually used, so much of the used bandwidth is wasted.\n  Currently, we allocate separate memory for each thread, so when a thread accesses memory, it very rarely falls into the same 128-byte chunk as a different thread. We can change that by allocating a slab of memory for a warp (32 threads), and interleaving the threads’ memory within that warp. This way, when threads need to access a value from memory, their values are all next to each other, and the GPU can fulfill these memory reads with a single memory transaction.\n  Trying this out, we find that performance improves by an order of magnitude! Clearly, it’s extremely important to be aware of memory access patterns when programming for GPUs.\n   Re-running the profiler, we can see that we are getting much better compute utilization (33%, up from 3%), but we are still nowhere near full utilization. Can we do better?\n  Continuing our examination of memory usage patterns, let’s look at the type of memory used. Nvidia GPUs have several kinds of memory located in different physical places, but the easiest type to use is called “unified memory,” which automatically transfers data between different physical locations on our behalf. We have been using this because it doesn’t require us to think much about where bytes are being physically stored, but it can lead to performance bottlenecks if mismanaged, since data will be transferred between physical memory locations inefficiently.\n Since we are still seeing very high memory latency, let’s take a closer look at these transfers.\n Our simple fuzzer is working in “rounds”: if the GPU can run 40,000 threads, we pass 40,000 inputs to the GPU, and each thread fuzzes an input before we launch the next round. In between rounds, we reset the memory used (e.g., coverage tracking data structures and memory used by the program being fuzzed). However, this results in significant data transfers between the GPU and the CPU in between each round, as memory is paged back to the CPU, reset, and then paged back to the GPU. While these transfers are happening, the GPU is doing nothing. Additional latency is incurred as the GPU waits for the CPU to launch the next round.\n  We can improve this setup by doing a single launch of the GPU code and avoiding synchronicity between the CPU and GPU. Much of the data doesn’t need to be in unified memory; we can allocate global memory on the GPU instead, then asynchronously transfer data to the CPU when we need to send information about fuzzing progress (e.g., which inputs are causing crashes). In this way, when a thread finishes fuzzing an input, it can reset the memory and proceed to the next input without data transfer overhead and without waiting on the CPU.\n  This achieves a speedup of almost another order of magnitude! Now, the fuzzer is about five times faster per dollar than libFuzzer.\n  It’s extremely promising—although our fuzzer lacks a mutation engine and can’t handle system calls, exceeding libFuzzer’s performance to this degree suggests that fuzzing using GPUs may be extremely useful for certain applications.\n  Although we are close to our performance goal for this test program, the project still has a long way to go. Hardware utilization remains low, so there’s room for more optimization.\n In addition, we need to build support for handling system calls, which may have a significant performance impact when fuzzing I/O-heavy applications. We also need to build the mutation engine before this fuzzer can be useful, although this problem is much better understood than building the execution engine.\n Still, we’re very excited to be getting such promising results in such early stages of development. We look forward to an order of magnitude improvement in fuzzing embedded binaries.\n We would love to hear your thoughts on this work! Contact us at  ryan@reberhardt.com or  artem@trailofbits.com.\n Finally, a big “thank you” goes to Artem Dinaburg for the initial design of this system and for mentoring me throughout this project. Also, thank you to Peter Goodman for giving design feedback and debugging suggestions.", "posttime": "2020-10-23 00:41:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,gpu,high,内存", "title": "让我们用GPU构建一个高性能的模糊器", "title_en": "Let’s build a high-performance fuzzer with GPUs", "transed": 1, "url": "https://blog.trailofbits.com/2020/10/22/lets-build-a-high-performance-fuzzer-with-gpus/", "via": "", "real_tags": ["性能", "gpu", "high", "内存"]}, {"category": "", "categoryclass": "", "imagename": "5c24f90a01499d7c3250f9ff91bd7a59.png", "infoid": 1030599, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据英国广播公司新闻报道，一家致力于治疗新冠肺炎的领先医学研究机构承认，在一次秘密谈判后，该机构向黑客支付了114万美元(约合91万英镑)的赎金。\n一个匿名的线报使BBC新闻能够在黑暗的网络上通过实时聊天跟踪赎金谈判。\n网络安全专家表示，这类谈判现在正在世界各地进行，有时金额甚至更高，无视执法机构的建议，包括联邦调查局(FBI)、欧洲刑警组织(Europol)和英国国家网络安全中心(National Cyber Security Centre)。\n在过去的两个月里，仅Netwalker一家就被认为与至少另外两起针对大学的勒索软件攻击有关。\n乍一看，它的暗网主页看起来像是一个标准的客户服务网站，有一个常见问题(FAQ)选项卡，提供免费的软件样本和实时聊天选项。\n但也有一个倒计时器在倒计时，黑客要么将赎金价格提高一倍，要么删除他们用恶意软件扰乱的数据。\nUCSF接到指示登录-无论是通过电子邮件还是被黑客攻击的电脑屏幕上留下的赎金纸条-遇到了6月5日发布的以下消息。\n六个小时后，该大学要求给予更多时间，并要求将黑客攻击的细节从Netwalker的公共博客中删除。\n但加州大学旧金山分校的代表(他可能是一名外部专家谈判代表)解释说，冠状病毒大流行对该大学来说在财务上是毁灭性的，并恳求他们接受78万美元。\n经过一天的反复谈判，加州大学旧金山分校表示，它已经凑齐了所有可用的资金，可以支付1020万美元-但犯罪分子拒绝低于150万美元。\n几个小时后，该大学回来了，详细说明了它是如何获得更多资金的，并提供了1140895美元的最终报价。\n第二天，116.4枚比特币被转移到网行者的电子钱包中，解密软件被发送到加州大学旧金山分校。\n加州大学旧金山分校现在正在协助联邦调查局进行调查，同时努力恢复所有受影响的系统。\n它告诉BBC新闻：加密的数据对我们作为一所服务于公共利益的大学所从事的一些学术工作非常重要。\n因此，我们做出了艰难的决定，向恶意软件攻击背后的个人支付部分赎金(约114万美元)，以换取一个工具来解锁加密数据并归还他们获得的数据。\n如果认为谈判中所有的陈述和主张都是真实的，那将是错误的。\n但来自欧洲刑警组织(Europol)的简·奥普·奥斯(Jan Op Gen Oorth)表示：受害者不应该支付赎金，因为这会为犯罪分子提供资金，并鼓励他们继续非法活动。欧洲刑警组织运营着一个名为“不再赎金”的项目。\n取而代之的是，他们应该向警方报告，这样执法部门才能扰乱犯罪活动。\n网络安全公司Emsisoft的威胁分析师布雷特·卡洛(Brett Clow)表示：处于这种情况的组织没有好的选择。\n即使他们支付了要求，他们也只会收到一个微不足道的承诺，即被盗数据将被删除。\n但是，为什么一个无情的犯罪企业要删除数据，这样它以后可能会进一步货币化呢？\n大多数勒索软件攻击都是从诱杀电子邮件开始的，研究表明，犯罪团伙越来越多地使用可以通过单一下载获得系统访问权限的工具。Proofpoint的网络安全分析师表示，仅在本月的第一周，他们就收到了100多万封使用各种钓鱼诱饵的电子邮件，其中包括伪造的新冠肺炎测试结果，这些邮件发送给了美国、法国、德国、希腊和意大利的组织。\n但Proofpoint的瑞安·卡兰伯(Ryan Kalember)表示：对于IT管理员来说，大学可能是一个具有挑战性的环境。\n不断变化的学生人数，再加上开放和信息共享的文化，可能会与有效保护用户和系统免受攻击所需的规则和控制相冲突。", "note_en": "A leading medical-research institution working on a cure for Covid-19 has admitted it paid hackers a $1.14m (£910,000) ransom after a covert negotiation witnessed by BBC News.\n   And an anonymous tip-off enabled BBC News to follow the ransom negotiations in a live chat on the dark web.\n Cyber-security experts say these sorts of negotiations are now happening all over the world - sometimes for even larger sums - against the advice of law-enforcement agencies, including the FBI, Europol and the UK&#39;s National Cyber Security Centre.\n Netwalker alone has been linked to at least two other ransomware attacks on universities in the past two months.\n  At first glance, its dark-web homepage looks like a standard customer-service website, with a frequently asked questions (FAQ) tab, an offer of a &#34;free&#34; sample of its software and a live-chat option.\n But there is also a countdown timer ticking down to a time when the hackers either double the price of their ransom, or delete the data they have scrambled with malware.\n Instructed to log in - either by email or a ransom note left on hacked computer screens - UCSF was met with the following message, posted on 5 June.\n  Six hours later, the university asked for more time and for details of the hack to be removed from Netwalker&#39;s public blog.\n   But the UCSF representative, who may be an external specialist negotiator, explained the coronavirus pandemic had been &#34;financially devastating&#34; for the university and begged them to accept $780,000.\n   After a day of back-and-forth negotiations, UCSF said it had pulled together all available money and could pay $1.02m - but the criminals refused to go below $1.5m.\n  Hours later, the university came back with details of how it had procured more money and a final offer of $1,140,895.\n  And the next day, 116.4 bitcoins were transferred to Netwalker&#39;s electronic wallets and the decryption software sent to UCSF.\n UCSF is now assisting the FBI with its investigations, while working to restore all affected systems.\n It told BBC News: &#34;The data that was encrypted is important to some of the academic work we pursue as a university serving the public good.\n &#34;We therefore made the difficult decision to pay some portion of the ransom, approximately $1.14 million, to the individuals behind the malware attack in exchange for a tool to unlock the encrypted data and the return of the data they obtained.\n &#34;It would be a mistake to assume that all of the statements and claims made in the negotiations are factually accurate.&#34;\n  But Jan Op Gen Oorth, from Europol, which runs a project called No More Ransom, said: &#34;Victims should not pay the ransom, as this finances criminals and encourages them to continue their illegal activities.\n &#34;Instead, they should report it to the police so law enforcement can disrupt the criminal enterprise.&#34;\n Brett Callow, a threat analyst at cyber-security company Emsisoft, said: &#34;Organisations in this situation are without a good option.\n &#34;Even if they pay the demand, they&#39;ll simply receive a pinky-promise that the stolen data will be deleted.\n &#34;But why would a ruthless criminal enterprise delete data that it may be able to further monetise at a later date?&#34;\n Most ransomware attacks begin with a booby-trapped emaiI and research suggests criminal gangs are increasingly using tools that can gain access to systems via a single download. In the first week of this month alone, Proofpoint&#39;s cyber-security analysts say they saw more than one million emails with using a variety of phishing lures, including fake Covid-19 test results, sent to organisations in the US, France, Germany, Greece, and Italy.\n  But Proofpoint&#39;s Ryan Kalember said: &#34;Universities can be challenging environments to secure for IT administrators.\n &#34;The constantly changing student population, combined with a culture of openness and information-sharing, can conflict with the rules and controls often needed to effectively protect the users and systems from attack.&#34;", "posttime": "2020-10-23 00:40:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,黑客,大学,加州大学,hackers", "title": "黑客从加州大学旧金山分校敲诈了114万美元", "title_en": "Hackers extorted $1.14M from UCSF", "transed": 1, "url": "https://www.bbc.com/news/technology-53214783", "via": "", "real_tags": ["旧金山", "黑客", "大学", "加州大学", "hackers"]}, {"category": "", "categoryclass": "", "imagename": "a6f2f4bf0a69e07ad5f25689ea870d95.jpg", "infoid": 1030598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "留住客户是每个企业主都应该痴迷的目标。归根结底，留住现有客户比收购新客户更便宜。\n事实证明，有一个简单的策略可以让你的客户留在身边，即使他们即将离开你的平台。让我们来探索一下它是什么，为什么它会起作用。\n正如在引言中已经说过的，在建立可持续的业务时，重点放在客户留住上是很重要的。\n获得客户可能是一项昂贵的努力。如果(目前)你的产品还没有通过口碑增长，那么你很可能会把收入的很大一部分花在付费广告和营销上，为你的服务带来流量。在你成千上万的访问者中，只有几个人最终会尝试你的产品，并转变为付费客户。\n优化这一营销和销售漏斗是一项棘手且成本高昂的活动。想一想吧。谁资助你学习和调整这样的漏斗呢？正确，你们的现有客户。\n这就是为什么让你的用户满意是最重要的业务目标之一。\n如果你仔细想想，你的客户离开你的平台的原因真的只有一个：\n虽然这听起来很苛刻，但我希望您考虑一下您目前订阅的所有服务。现在想象一下，你只能养一只。你会取消什么？可能除了那些你离不开就不能生活的东西。\n当然，个人的喜好是不同的，它们会随着时间的推移而改变。这就是人们取消订阅你的服务的确切原因：他们的偏好已经改变，他们可能想暂停你的服务，或者完全需要其他东西。\n现在我们知道你的客户流失的原因了，是时候换位思考如何留住他们了。\n行业标准之一是，一旦他们即将离开，就发出一份调查，收集反馈，并说服他们留下来。例如，如果用户在调查中点击了“太贵了”选项，一些服务就会提供优惠券代码。\n其他策略则更倾向于事情的阴暗面。隐藏按钮，问双重否定的问题，或者使用其他技巧让你几乎不可能离开。不用说，实行这种策略的企业的客户并不是那些散布产品有多棒的人。恰恰相反。\n但是，让我们退后一步，问问我们自己，为什么我应该留下来，或者我应该离开，这个问题首先必须是二元的。中间没有什么东西吗？用户可以留下来但不知何故同时离开的东西？\n这一困境的解决方案非常简单和明显，但很少使用：使暂停订阅成为可能。\n是的，就是这么简单。只需提供一种暂停订阅并在用户当前环境发生变化后返回订阅的方法。\n现在你可能会认为让用户暂停订阅真的是个坏主意。他们会停下来，再也不会回来了。因此，从本质上说，这是一个被动的流失，因为他们还没有离开这个平台，但可能永远不会再使用它。陈旧的用户数据位于数据库中，而您的仪表板仍在显示曲棍球棒的增长。此外，它是一项巨大的实现工作，因为暂停和恢复订阅并不被认为是业务关键的事情，因此还没有实现。\n这些都是有道理的担忧，即使你有一个暂停和恢复订阅的系统，其中一些可能会被证明是正确的。但让我们花几秒钟来看看等式的另一边。\n他们首先想到的是我们目前所处的新冠肺炎大流行。许多企业都缩减了规模，因此不得不取消订阅他们最喜欢的SaaS工具来削减成本。这里使用的一种常见的客户策略是与企业主联系，并提供为期一年的大幅折扣订阅计划。这样，企业就可以重新评估他们是应该真的辞职，把巨大的折扣留在桌上，还是干脆顺其自然，加倍下注，从这份甜蜜的多年折扣订阅协议中受益。\n让企业暂停订阅将是另一种策略，可以用来帮助在这场流行病期间留住并最终重新激活您的用户。再次设身处地为客户着想一分钟。如果你的供应商帮了你一臂之力，却把你赶出了家门，你将来难道不想还钱吗？\n即使您的客户暂停他们的帐户，您仍然可以使用他们的电子邮件地址联系他们，让他们随时了解您的产品。事实上，你应该利用这个机会保持联系，询问他们做得怎么样，并在此过程中提供一些有价值的东西。这样，你就可以保持沟通畅通，你的业务就会一直保持在他们的雷达上。当时代变了，他们即将再次扩大规模时，他们考虑你的服务的可能性更高。\n有一种暂停订阅的方法通常是经过一定程度的考虑才会采取的行动。如果您的客户想退出，无论如何他都会取消订阅。提供一种暂时暂停的方式是你的用户现在可能没有的另一个选择，所以他们被迫做出一个非常两难的决定，因此他们干脆退出。\n你还应该考虑的是，暂停订阅并不一定意味着你肯定会损失收入。您可以使用多种不同且非常有创意的方式来实现暂停。例如，我的健身房只是简单地将我的会员资格延长了几个月，就像我暂停我的会员资格一样。在夏天，我会利用这个功能，因为我无论如何都会在户外锻炼。不过，这3-4个月只是加到我的合同里了。我只是在如何以及在哪里度过我的运动时间方面有了更多一点的控制力。如果你真的想确保不会损失收入，你可以在这里发挥真正的创造力，并发明其他方法让这种机制发挥作用。\n最后，也是重要的一点是，您可以将此功能用作竞争优势和营销材料。请务必将用户可以暂停订阅这一事实添加到您的产品优惠列表中。将其添加到您的&#34；Subscribe&#34；按钮旁边的副本中。在行动号召即将到来之前解决异议和顾虑将极大地提高您的转化率。\n现在，你可能很兴奋，渴望在不久的将来实施这一战略，但在你这么做之前，我想提醒几件事，你在实施这一战略时应该牢记在心。\n首先：保持简单。没有必要直接跳到代码中并端到端地实现这一功能。开始时要手动完成。为希望手动暂停订阅的用户更新数据库记录和订阅计划。也许你会发现很少有人想要使用这个功能。你肯定要准备好的是你的新文案。如上所述，您应该确保您的营销网站已更新，并反映了您刚刚介绍的最新更改。\n接下来，您需要为暂停的客户设置自动跟进电子邮件序列/Drop活动。保持联络。询问他们在您的软件中遇到的问题，并帮助他们在目前所做的任何事情上取得成功。您可能想要立即接到一个快速呼叫，以收集一些反馈，了解他们为什么会暂停，并了解需要做些什么才能让他们回来。如果您这样做，请确保您是真正感兴趣的沟通。对用户来说，没有什么比写一封回复，然后把电子邮件打进营销空白更糟糕的了。\n一个非常重要但经常被忽视的步骤是有一个适当的工具来处理被动的流失。这样的系统确保存档的信用卡是最新的和可收费的。您的用户暂停订阅和信用卡到期之间可能会有重叠。你不会想因为那件事让他们难堪的。你甚至可以考虑一项礼宾服务，一旦他们回来，礼宾服务就会亲自登机。将此功能与他们错过和尚不熟悉的所有新功能/更新的快速更新结合起来。\n最后，你绝对不想让你的用户很难暂停他们的订阅。如上所述，不惜一切代价避免深色图案。更重要的是：不要因为他们的停顿而惩罚他们。诸如“我们将在未来60天内保留您的数据”之类的消息不适合当今这个大数据时代，您只需花五分钱和一角钱就可以访问PB级的存储空间。\n我想挑战您考虑增加暂停订阅的可能性。它适合你们的业务吗？它是否会帮助您留住更多的客户并做出反应(特别是在我们目前所处的情况下)？\n如果您要添加它，请记住它不必很复杂。首先，您的用户可以填写一个简单的电子邮件表单，让您知道他们想要暂停多长时间。只需确保您遵循上面概述的最佳实践，并宣传您的客户现在可以暂停订阅。\n客户保留率是每个企业主都应该关注的最重要的指标之一。为吸引新用户所需的客户获取成本提供资金的是现有客户。\n保持现有客户的快乐几乎总是比失去他们并获得全新的客户要便宜。\n不幸的是，很多SaaS服务只为他们的订阅计划提供了一个非常二元的选择。作为用户，您要么加入，要么退出。你要么留下来，要么离开。但是，如果用户因为当前生活环境的变化而想要暂停几个月怎么办？\n提供一种暂停订阅的方法是留住并最终响应现有客户的一种简单而有效的方法。请记住，暂停是暂时的。如果你不断地跟踪他们，帮助他们取得成功，他们最终会回来的。甚至可能是作为一个狂热的、更忠实的你品牌的粉丝。\n我希望你喜欢这篇文章，如果你对更多这样以行动为导向的帖子感兴趣，我很乐意邀请你订阅我的时事通讯。\n您有什么问题、反馈或意见吗？请随时通过电子邮件联系我或在Twitter上与我联系。", "note_en": "Customer retention is a goal every business owner should be obsessed with. At the end of the day it&#39;s cheaper to retain an existing customer than it is to acquire a new one.\n   As it turns out there&#39;s one simple strategy you can use to keep your customers around even if they&#39;re about to leave your platform. Let&#39;s explore what it is and why it works.\n  As already stated in the introduction it&#39;s important to focus on customer retention when building a sustainable business.\n Acquiring customers can be an expensive endeavour. If you&#39;re not (yet) in a position where your product grows through Word-of-Mouth you&#39;re likely spending a good portion of your revenue on paid ads and marketing to drive traffic to your service. Only a few of your thousands of visitors will eventually try your product and convert to become a paying customer.\n Optimizing this marketing and sales funnel is a tricky and costly activity. Think about it for a minute. Who finances your learnings and tweakings of such funnel? Correct,  your existing customers.\n That&#39;s why keeping your users happy and around is one of the most important business objectives.\n  If you think about it, there&#39;s really only one reason why your customers are leaving your platform:\n  While this sounds harsh I&#39;d like you to think about all the services you&#39;re currently subscribing to. Now imagine that you can only keep one. What would you cancel? Probably everything except the one you can&#39;t live without.\n Of course, the preferences are different from person to person and they change over time. And that&#39;s the exact reason why people cancel their subscription with your service: Their preferences have changed and they might want to take a pause from your service or need something else entirely.\n  Now that we know why your customers churn, it&#39;s time to get into their shoes and think about ways to keep them around.\n One of the &#34;industry&#34; standards is to send out a survey once they&#39;re about to leave to gather feedback and convince them to stay. Some services offer coupon codes if for example the user has clicked on the &#34;it&#39;s too expensive&#34; option in the survey.\n Other tactics are more on the &#34;dark patterns&#34; side of things. Hiding buttons, asking double negative questions or using other techniques to make it nearly impossible to leave. Needless to say that customers of businesses practicing such tactics aren&#39;t the ones who spread the word on how awesome the product is. Quite the opposite.\n But let&#39;s take a step back for a minute and ask ourselves why this &#34;should I stay or should I go&#34; question has to be binary in the first place. Isn&#39;t there something &#34;right in the middle&#34;? Something where a user can stay but somehow go at the same time?\n  The solution to this dilemma is dead simple and obvious, yet rarely used: Make it possible to  pause the subscription.\n Yes, it&#39;s that simple. Just offer a way to pause a subscription and get back to it once your users current circumstances have changed.\n Now you might think that it&#39;s a really bad idea to let users pause their subscription. They&#39;ll pause and never come back. So essentially it&#39;s a &#34;passive churn&#34; as they haven&#39;t left the platform yet but might never use it again. The stale user data is sitting in the database and your dashboards are still showing hockey-stick growth. Furthermore it&#39;s a huge implementation effort as pausing and resuming subscriptions isn&#39;t something considered business critical and hence wasn&#39;t implemented just yet.\n Those are all valid concerns and some of them might turn out to be true even if you have a &#34;pause- and resume your subscription&#34; system in place. But let&#39;s take a seconds to look at the other side of the equation.\n  They very first thing that comes to mind is the COVID-19 pandemic we&#39;re currently in. A lot of business scaled back and hence had to cancel subscriptions to their favorite SaaS tools to cut costs. A common &#34;save the customer tactic&#34; used here was to get in touch with the business owner and offer heavy discounted year long subscription plans. That way businesses could reassess if they should really quit and leave the huge discount on the table or just go with it and double down to benefit from the sweet, discounted multi-year subscription deal.\n Letting business put their subscription on hold would be another strategy that could be used to help retain and eventually reactivate your users during this pandemic. Put yourself into your customers shoes again for a minute. Wouldn&#39;t you want to pay it back in the future if your supplier lent you a helping hand and wasn&#39;t &#34;forcing&#34; you out the door?\n Even if your customers pause their account you still have their E-Mail address to reach out to them and keep them informed about your product. In fact you should use this opportunity to stay in touch, ask them how they&#39;re doing and providing something of value along the way. That way you keep the communication &#34;warm&#34; and your business stays on &#34;their radar&#34;. There&#39;s a higher likelihood that they think about your service when times have changed and they&#39;re about to scale things up again.\n Having a way to pause a subscription is an action that&#39;s usually taken with some level of consideration. If your customer wants to quit (s)he&#39;ll just cancel the subscription anyway. Offering a way to pause for the time-being is another option your users might just not have right now, so they&#39;re forced to make a very binary decision and therefore they just quit.\n What you should also think about is that pausing a subscription doesn&#39;t necessarily mean that you&#39;ll lose revenue for sure. There are different and very creative ways in which you can implement the pause. My gym for example simply extends my membership for the amount of months I put my membership on hold. In the summer I make use of this feature since I do my workouts outside anyways. However those 3-4 months I &#34;save&#34; are simply &#34;added&#34; to my contract. I just have a little bit more control about how and where I spend my time with sports. You can get really creative here and invent other ways for this mechanism to work if you really want to ensure that you don&#39;t lose revenue.\n A last, important point is that you can use this functionality as a competitive advantage and &#34;marketing material&#34;. Be sure to add the fact that people can pause their subscription to your list of product benefits. Add it to the copy right next to your &#34;Subscribe Now&#34; button. Addressing objections and concerns right before the call-to-action is about to happen will drastically increase your conversion rates.\n  Now you might be excited and eager to implement this strategy in the near future but before you do so I&#39;d like to call out a couple of things you should keep in mind when implementing it.\n First of all:  Keep it simple. There&#39;s no need to jump right into code and implement this functionality end-to-end. Do it manually in the beginning. Update the database records and the subscription plans for people who want to pause their subscription by hand. Maybe you find out that very few people want to make use of this feature. What you definitely want to put in place is your new copywriting. As discussed above you should ensure that your marketing website is updated and reflects the recent change you just introduced.\n Next up you want to have an  automated follow-up E-Mail sequence / Drip campaign setup for pausing customers. Keep in touch. Ask for problems they had with your software and help them succeed in whatever they&#39;re up to right now. You might want to jump on a quick call to gather some feedback as to why they paused and understand what needs to be in place for them to come back. If you do this, please ensure that you&#39;re  genuinely interested in the communication. There&#39;s nothing worse for a user than composing a reply and shooting the E-Mail into the marketing void.\n A very important, yet often overlooked step is to have a tool in place which deals with &#34;passive churn&#34;. Such a system ensures that the credit cards on file are up to date and chargeable. There could be an overlap between your users pausing their subscription and their credit cards expiring. You don&#39;t want to make them look bad because of that. You could even think about a &#34;concierge service&#34; which onboards them in person once they&#39;ll come back. Combine this with a quick update on all the new features / updates they missed and are not yet familiar with.\n Lastly you absolutely don&#39;t want to make it hard for your users to pause their subscription. As mentioned above, avoid dark patterns at all costs. And more importantly:  Don&#39;t penalize them for pausing. Messages such as &#34;We&#39;ll retain your data for the next 60 days&#34; are inappropriate in the day and age of &#34;Big Data&#34; and access to Petabytes of storage for a nickel and dime.\n  I&#39;d like to challenge you to think about adding the possibility to pause a subscription. Is it suitable for your business? Would it help you retain and reactive more customers (especially in the current situation we&#39;re in)?\n If you&#39;re about to add it, keep in mind that it doesn&#39;t have to be complicated. Start with a simple E-Mail form your users can fill out to let you know for how long they want to pause. Just make sure that you follow the best practices outlined above and that you advertise that it&#39;s now possible for your customers to pause their subscriptions.\n  Customer retention is one of the most important metrics every business owner should focus on. It&#39;s the existing customers who finance the Customer Acquisition Costs that are necessary to bring new users into the door.\n It&#39;s almost always cheaper to keep your existing customers happy than to lose them and acquire brand new ones.\n Unfortunately a lot of SaaS services only offer a very binary option for their subscription plans. As a user you&#39;re either in or you&#39;re out. You stay or you leave. But what if a user wants to take a pause for a few months because of current changes in life circumstances?\n Offering a way to pause a subscription is a simple, yet effective way to retain and eventually reactive your existing customers. Remember that a pause is temporary. If you follow-up with them on a continuous basis and help them succeed they&#39;ll eventually come back. Maybe even as a raving, more loyal fan of your brand.\n I hope that you enjoyed this article and I&#39;d love to invite you to subscribe to my Newsletter if you&#39;re interested in more, action-oriented posts like this.\n Do you have any questions, feedback or comments? Feel free to reach out via E-Mail or connect with me on  Twitter.", "posttime": "2020-10-23 00:39:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户,customer", "title": "如何防止客户取消", "title_en": "How to Prevent Customer Cancellations", "transed": 1, "url": "https://philippmuens.com/how-to-prevent-customer-cancellations/", "via": "", "real_tags": ["客户", "customer"]}, {"category": "", "categoryclass": "", "imagename": "e5af8a548c3bdd923adf907e1c5c862a.jpg", "infoid": 1030597, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看来PS4上的许多视频流媒体应用程序在发布时并不能在PlayStation5上使用。这与Xbox Series X形成了鲜明对比，Xbox Series X为Xbox One设计的媒体应用程序可以在新硬件上无缝运行。\n在今天早上的一篇博客文章中，索尼列出了一些计划在PS5游戏机首日上市的娱乐应用程序。这些应用程序包括：\n这篇帖子还列出了几个其他的流媒体应用，它们只是简单地推出了PS5，没有提到时间，包括Amazon Prime Video、myCANAL、Hulu、Peacock&34；等等。虽然措辞有点含糊，但言下之意似乎很清楚，这些应用和其他没有列出的应用，都是PS5&34；未来承诺的更多应用的一部分，预计不会为PS5&12的发布做好准备。(索尼尚未回复Ars Technica的置评请求。)。\nPS4目前托管着21个不同版本的流媒体应用。在今天PS5的博客帖子中甚至没有提到的包括：CBS All Access，CBS News，HBO Max，Crackle，Crunchyroll，Funimation，NBA，NFL，PlutoTV，Plex，VRV和Vudu。\n相比之下，现有的Xbox One媒体应用只能在Xbox Series X上运行。根据Ars&39；Owner Sam Machkovech发布前的测试，这些应用在即将推出的游戏机上的加载速度甚至更快。微软最近确认，在Xbox的通用Windows平台系统下开发的所有应用程序都应该在Series S和Series X上同等运行，而不需要开发者做任何工作。\n从长远来看，这可能不会是两款游戏机之间的巨大差异。如果一个流媒体应用程序足够受欢迎，足以在PS4上吸引观众，那么该应用程序很可能会在相对较短的时间内移植到PS5上。但在早期，将PS4部分用作视频流机顶盒的人可能会发现他们的新PS5有点欠缺。\n索尼还利用今天的博客发布了一款专为PS5设计的媒体遥控器，目前在百思买(Best Buy)和塔吉特(Target)的标价为29.99美元。除了基本的媒体和电视控制以及菜单导航功能外，该遥控器还包括用于Disney+、Netflix、Spotify和YouTube的快速启动按钮，以及用于语音命令的麦克风按钮。", "note_en": "It seems that many of the video-streaming apps on the PS4 won&#39;t be available on the PlayStation 5 at launch. That&#39;s a marked contrast to the Xbox Series X, where media apps designed for the Xbox One work seamlessly on the new hardware.\n In  a blog post this morning, Sony listed &#34;some of the entertainment apps scheduled to hit the PS5 console on day one.&#34; Those include:\n  The post also lists a few &#34;additional streaming apps&#34; that are simply &#34;coming to PS5&#34; with no mention of timing, including Amazon Prime Video, MyCanal, Hulu, Peacock &#34;and more.&#34; While the wording is a little vague, the implication seems clear that these apps, and others not listed, are part of the promised &#34;more apps to come in the future&#34; and are not expected to be ready for the  PS5&#39;s Nov. 12 launch. (Sony has yet to respond to a request for comment from Ars Technica.)\n The PS4 currently hosts versions of  21 different media-streaming apps. Among the ones not even mentioned in today&#39;s PS5 blog post: CBS All Access, CBS News, HBO Max, Crackle, CrunchyRoll, Funimation, NBA, NFL, PlutoTV, Plex, VRV, and Vudu.\n By contrast, existing Xbox One media apps just work on the Xbox Series X. According to  pre-release testing from Ars&#39; own Sam Machkovech, those apps even load faster on the upcoming console. And Microsoft  has recently confirmed that all apps developed under the Universal Windows Platform system on Xbox should &#34;run at parity&#34; on the Series S and Series X without any work on the developer&#39;s part.\n In the long run, this probably won&#39;t be a huge difference between the two consoles. If a media-streaming app was popular enough to attract an audience on the PS4, that app will likely be ported to the PS5 in relatively short order. But in the early days, people who use their PS4 in part as a video-streaming set-top box may find their new PS5 a little lacking.\n Sony also used today&#39;s blog post to announce  a specially designed Media Remote for the PS5, currently listed for $29.99 at  Best Buy and  Target. In addition to basic media and TV control and menu navigation functions, the remote includes quick-launch buttons for Disney+, Netflix, Spotify, and YouTube, as well as a microphone button for voice commands.", "posttime": "2020-10-23 00:24:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,发布,视频流,missing,ps5", "title": "PS5在发布时将缺少一些PS4视频流应用程序", "title_en": "PS5 will be missing some PS4 video-streaming apps at launch", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/ps5-will-be-missing-some-ps4-video-streaming-apps-at-launch/", "via": "", "real_tags": ["程序", "发布", "视频流", "missing", "ps5"]}]