[{"category": "", "categoryclass": "", "imagename": "cd117ce3ec06ab798961c9000a901b88.jpg", "infoid": 1067698, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Frumtak是一个有点较多的欧洲VC，直到它爆发了我们的雷达，因为控制着实时供应链监控启动后的支持，这项技术从纽约州州长安德鲁库莫河畔举行了一席之地盒子，其中包含第一次运送Covid-19疫苗到城市。控制剂是与疫苗相关的全球分发冷链中的关键球员。\n 但是，该基金还支持数字银行解决方案提供商梅纳娇，数字治疗Scaleup Sidekick Health，Travel CRM和旅游预订系统提供商Kaptio，Live Event和Fan订婚数据分析公司活动流和数据市场，由Qlik收购，由Qlik收购，由Qlik收购，由QLIK于2014年收购。\n  Svana Gunnarsdottir，弗里姆塔克州的管理合作伙伴表示：“我们为我们的投资组合公司及其团队的成就感到自豪，以及我们通过前两个基金制定的投资决策。我们期待着继续支持高级初创企业和辉煌的创始人，并使用Frumtak III。我们也非常感谢我们的LP向我们展示的信心，自2009年首次资金以来，其中许多人在我们身上与我们同在。“\n 同时，Asthildur Otharsdottir已加入公司作为合作伙伴和Frumtak III的铅投资经理。 Otharsdottir先前是Frumtak的董事长6年，并已在Marel和Icelandair集团的董事会上。 ", "note_en": "Frumtak was a somewhat lesser-known European VC until it popped up on our radar as the backers behind the Controlant real-time supply chain monitoring startup, the technology from which was pictured beside Andrew Cuomo, governor of New York, when he  held up a box containing the first-ever shipment of the COVID-19 vaccine to the city. Controlant has been a key player in the global distribution cold chain associated with vaccines.\n However, the fund has also backed digital banking solutions provider Meniga, digital therapeutics scaleup Sidekick Health, travel CRM and travel booking system provider Kaptio, live event and fan engagement data analytics company Activity Stream, and Data Market, which was acquired by Qlik in 2014.\n  Svana Gunnarsdottir, managing partner of Frumtak Ventures said: “We are proud of the accomplishments of our portfolio companies and their teams, as well as the investment decisions we made through our first two funds. We look forward to continuing our support of high-potential startups and brilliant founders with Frumtak III. We are also grateful for the confidence shown to us by our LP’s, many of whom have been with us since our first fund in 2009.”\n Concurrently, Asthildur Otharsdottir has joined the firm as partner and Frumtak III’s lead investment manager. Otharsdottir was previously Frumtak’s Chairman for 6 years and has been on the board of Marel and Icelandair Group.", "posttime": "2021-06-23 21:24:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "frumtak,ventures", "title": "冰岛的Frumtak Ventures提高了第三，5700万美元，专注于后种子和系列 ", "title_en": "\n\t\t\t\tIceland’s Frumtak Ventures raises its third, $57M, fund focusing on post-seed and Series A\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/icelands-frumtak-ventures-raises-its-third-57m-fund-focusing-on-post-seed-and-series-a/", "via": "", "real_tags": ["frumtak", "ventures"]}, {"category": "", "categoryclass": "", "imagename": "70877983c405831103ce8b3c97c39c5f.jpg", "infoid": 1067697, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Patrick Stokes，EVP和GM在Salesforce的平台上指出，这些公司在过去共同努力，提供了两种服务之间的安全共享等功能，但他们从客户听到他们想要进一步拍摄的客户，今天的宣布是实现这一点的第一步。\n “[合伙人的初始阶段]真的非常成功。我们从彼此学习了很多，并从我们的共同客户中获取他们想要尝试完成的东西的类型，无论是在Salesforce产品组合中，以及所有的亚马逊产品，都是两个解决方案的补充其他真的很好。斯托克斯解释说，客户正在向我们询问我们更多，因此我们很高兴进入下一阶段的伙伴关系，“斯托克斯解释说。\n  他补充道，“目标确实是统一我们的平台，因此将亚马逊服务的所有权力带入Salesforce平台的所有权力。”这些功能可能是完成此操作的下一步。\n  这涉及许多新功能，公司正在努力帮助开发人员在方程的平台和应用方面。对于初学者，包括使开发人员能够在Salesforce内部虚拟化Amazon数据，而无需执行所有编码以使其手动发生。\n “更具体地说，我们将要在Salesforce平台中虚拟化亚马逊数据，因此您是否使用S3桶，亚马逊RDS或任何东西，我们将使数据虚拟化，只是出现就像它在Salesforce平台上的本机数据一样，“他说。\n 同样，开发人员在亚马逊上构建应用程序将能够访问Salesforce数据，并在亚马逊本地出现。这涉及在两个系统之间提供连接器，使数据流动地使得没有大量编码来实现这一目标。\n 这些公司还宣布了活动共享功能，这使得亚马逊和Salesforce客户更容易构建交叉两个平台的基于微服务的应用程序。 \n“您可以在不必编写任何代码的情况下再次构建面向Salesforce和Amazon平台的服务的微野型型架构。为此，[我们正在开发]出盒子连接器，因此您可以单击并拖动所需的事件。“\n 公司还宣布计划从身份和访问管理角度来更容易地访问具有导游设置的平台。最后，公司正在努力将亚马逊Chime通信工具建立进入服务云和其他Salesforce服务的申请，以建立使用AWS机器学习技术等虚拟呼叫中心的东西。\n 亚马逊全球营销Rachel Thorton的VP表示，拥有两个云巨头以这种方式共同努力，开发人员可以更轻松地创建跨越两个平台的解决方案。 “我只是认为它解开了开发人员的这种可能性，而且更快，更具创新的开发人员可以成为，它只是解锁了企业的机会，并创造了更好的客户体验，”桑顿说。\n 值得注意的是，Salesforce还与包括Microsoft Azure和Google云平台在内的其他云提供商具有广泛的伙伴关系。\n 由于销售公告通常如此，虽然今天正在宣布所有这些能力，但它们仍在开发阶段，直到今年晚些时候在明年晚些时候进入测试版。预计本公司将在今年晚些时候释放有关DreamForce和Re：Special的伙伴关系的更多细节，他们的各自的客户会议。 ", "note_en": "Patrick Stokes, EVP and GM for Platform at Salesforce, points out that the companies have worked together in the past to provide features  like secure sharing between the two services, but they were hearing from customers that they wanted to take it further and today’s announcement is the first step towards making that happen.\n “[The initial phases of the partnership] have really been massively successful. We’re learning a lot from each other and from our mutual customers about the types of things that they want to try to accomplish, both within the Salesforce portfolio of products, as well as all the Amazon products, so that the two solutions complement each other really nicely. And customers are asking us for more, and so we’re excited to enter into this next phase of our partnership,” Stokes explained.\n  He added, “The goal really is to unify our platforms, so bring [together] all the power of the Amazon services with all of the power of the of the Salesforce platform.” These capabilities could be the next step in accomplishing that.\n  This involves a couple of new features the companies are working on to help developers on both the platform and application side of the equation. For starters that includes enabling developers to virtualize Amazon data inside Salesforce without having to do all the coding to make that happen manually.\n “More specifically, we’re going to virtualize Amazon data within the Salesforce platform, so whether you’re working with an S3 bucket, Amazon RDS or whatever it is we’re going to make it so that that the data is virtualized and just appears just like it’s native data on the Salesforce platform,” he said.\n Similarly, developers building applications on Amazon will be able to access Salesforce data and have it appear natively in Amazon. This involves providing connectors between the two systems to make the data flow smoothly without a lot of coding to make that happen.\n The companies are also announcing event sharing capabilities, which makes it easier for both Amazon and Salesforce customers to build microservices-based applications that cross both platforms.\n “You can build microservices-oriented architecture that spans the services of Salesforce and Amazon platforms, again without having to write any code. To do that, [we’re developing] out of the box connectors so you can click and drag the events that you want.”\n The companies are also announcing plans to make it easier from an identity and access management perspective to access the platforms with a guided setup. Finally, the companies are working on applications to build Amazon Chime communications tooling into Service Cloud and other Salesforce services to build things like virtual call centers using AWS machine learning technology.\n Amazon VP of Global Marketing Rachel Thorton says that having the two cloud giants work together in this way should make it easier for developers to create solutions that span the two platforms. “I just think it unlocks such possibilities for developers, and the faster and more innovative developers can be, it just unlocks opportunities for businesses, and creates better customer experiences,” Thornton said.\n It’s worth noting that Salesforce also has extensive partnerships with other cloud providers  including Microsoft Azure and  Google Cloud Platform.\n As is typically the case with Salesforce announcements, while all of these capabilities are being announced today, they are still in the development stage and won’t go into beta testing until later this year with GA expected sometime next year. The companies are expected to release more details about the partnership at Dreamforce and re:Invent, their respective customer conferences later this year.", "posttime": "2021-06-23 21:24:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "salesforce,aws", "title": "Salesforce，AWS宣布扩展伙伴关系，并进一步双向整合 ", "title_en": "\n\t\t\t\tSalesforce, AWS announce extended partnership with further two-way integration\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/salesforce-aws-announce-extended-partnership-with-further-two-way-integration/", "via": "", "real_tags": ["aws"]}, {"category": "", "categoryclass": "", "imagename": "46059047567876fcf6288a0d539032d6.jpg", "infoid": 1067696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些创建数据库的人喜欢从干净的板岩开始。 PlanetsCale，在周三的A16Z和SignalFire中获得3000万美元的B系列资金，采取了略微不同的方法。该公司看着MySQL，喜欢它看到的东西，并在它周围包裹了所有的增强功能。核心仍然是MySQL，运行标准引擎并响应标准查询，但包装器处理分片和复制的所有挑战，使得可以创建PlanetsCale所说的数据库，可以在几秒钟内启动并缩放“无限期。“\n 该公司表示，开发人员可以在几秒钟内创建一个新数据库，这些数据库将在几秒钟内成长，没有关于可扩展性的局限性。开发人员不需要了解环境，例如新的云区，群集大小和其他“以DB为中心的MeNutiae”。该公司在一份声明中表示，新的新资金转向全球范围扩大团队并加速曝光和采用该平台。\n  为了了解有关这些额外的层内置的内容，Venturebeat坐在PlanetsCale的首席产品官员萨姆·兰伯特队坐下来。他告诉我们，在PlanetsCale的创新中是一些基于Vitess的创新，这是一个MySQL的一个分支，它在Youtube逐步划水平的工作。超倾覆像诸如松弛，GitHub和Square等高超剖视图。\n   Sam Lambert：几乎每个数据库的问题都没有一个建筑物数据库正在考虑使用它们的人们的日常生活。像那样简单。我们在PlanetsCale上有什么不同的是，我们正在进入开发人员的日常生活以及解决与数据库相关的开发者问题。\n  兰伯特：记住NoSQL运动吗？ MongoDB将自己作为一个工具作为一个工具，开发人员在他们讨厌的模式之后，难以管理的模式 - 难以部署和使用的模式。这一切都是真的，对任何关系数据库都非常真正的批评。\n 我们所做的是允许分支和部署模式更改的请求。您可以测试您的架构，然后将其推入生产中。它作为完全可用的非阻塞变化滚动。就好像你刚推了代码。它具有易于使用的易用性。因此，您可以使用所有开发人员工作流程获得伟大的MySQL良好。\n  Lambert：SQL命令将锁定表格。这将导致您可怕的停机时间，您的应用程序会放慢速度，您的查询会堆积 - 它只是一团糟。 \nVidturebeat：所以你能够通过锁定生产的变化来滚动吗？\n Lambert：通过我们的方式，它只是异步地将变化滚到生产中 - 但如果我们看到我们停止的流量爆发。我们只是暂停我们正在做的事情，我们让我们进入交通工具，然后我们继续迁移它。因此，它就像是一个真正的安全部署代码，好像它只是在数据库群集中出发所有这些节点。\n 因此，如果要执行架构更改，则会有您的表格。这是您的用户表。您要添加列来跟踪，例如，是否订阅了用户。我们所做的是我们创建一个空的用户表的副本。只是架构。我们添加订阅列，然后我们慢慢开始将现有的数据慢慢地蚕食。我们以在线方式进行。所以它只是拉到了进来的任何新的更新。他们申请了，我们闲聊。当他们彼此最新时，我们会立即交换，新列在生产中生活。旧桌子在那里，我们删除它，新列是在生产中生活的。它与您部署应用程序时的方式相同：您将新的POD滚入生产中。这是开发商非常熟悉的事情的一种方式。\n  Lambert：Vitess是Mega-Scale，开源数据库技术为电源uTube提供了从Slack到GitHub的所有权，但它很复杂。维护很棘手。从大公司中采取一些东西并将其应用于中市或小公司，这是非常困难的，减少小团队或个人。它是为谷歌和youtube而建造的。他们做了一个巨大的工作，利用它。它是为了数据库人。这是基础设施人。\n  Lambert：用新的PlanetsCale，我们为你做了这一点。我们只是完全消除了复杂性。我们是你的基础设施人。我们是你的数据库人。我们正在遇到您作为开发人员的地方，在那里您不了解地区和集群和服务器以及其他人要求您选择的东西。但我们建在Vitess上并具有Vitess的力量。\n  兰伯特：分支是一些真正的魔法酱。因此，当您获得一个分支机构时，获取一个全新的群集，它是一个完全隔离的集群，远离您当前的集群。这是一个完全孤立的环境。\n  Lambert：不，我相信你知道，暂存环境是每个人的地狱问题。我们将杀死暂存环境的概念。他们是一个不必要的混乱。这只是一个与分支保持的另一个负担。 \n我们说：没有这种单片分期环境。只需创建每个代码分支的分支。这本身是一个很好的环境。测试它，推动它部署。然后它消失了。拥有尽可能多的分支机构。如果你愿意，每位开发人员拥有100个。它们都是用于分期的环境，但这是旧的常期环境世界的代理飞跃。\n VidtureBeat：在一个我们遇到的项目上，老板不想支付太多的测试群集。\n 兰伯特：是的，如果你的项目很大，那么克隆它们是一个巨大的成本。如果您设置了一个分支，您不会最终加倍您消耗的资源数量。这是一个光，小的子集。\n VidtureBeat：在一些项目中，我一直在，分期和测试集群将开始偏离生产。我们无法保持同步。代码将在生产中运行并在生产中失败，或者更糟糕的是，在生产中运行但在分期中失败。我们无法测试它。我们只会穿过手指并将其推进生产，因为我们知道暂存是令人挤的。\n Lambert：我见过暂存环境的最好的是他们持续昨晚的备份，并将其恢复到单独的群集上。所以，它略微陈旧，它只是脆弱。\n 我们不这样做。我们在PlanetsCale上主持PlanetsCale的主数据库。当我们添加一个功能时，我们在本地代码并创建数据库分支。当我们完成后，我们推动变化，他们都赶上了。\n  兰伯特：水平分片。它令人难以优雅，它将问题分解为多个小块。分片更优雅，而不是堆叠您的机器。如果将数据拆分为商品计算机的碎片，则您不仅可以获得相同数量的CPU核心，您可以在垂直刻度环境中使用读取，您可以获得更多服务写入。复制延迟不会成为一个问题，您只需继续增长。 \nVentureBeat：查询需要触摸所有碎片时会发生什么，也许要构建一些汇总报告？\n 兰伯特：确实发生了。但是你可以优化，我们会给你做的方法。肯定有码头碎片聚集，这有点慢。但是，当您需要时，与传统的一致性问题相比，这些都很容易优化，这是一种方式，方式更难以包裹头部。\n Venturebeat：在您的产品核心深处是MySQL。你使用股票版本吗？\n Lambert：MySQL是最好的。谈到存储和存储引擎时，这几乎是首映式。你无法击败它。您可以访问所有存储引擎 - 我们与其他MySQL人员兼容。但是，对于纯粹的存储引擎，这是我们使用它的，它只是现场。\n  兰伯特：看看我们的竞争对手。他们问你想要多少节点。有多少服务器CPU？有多少vcpus？ IO多少钱？垃圾！我们不要求这一点。当您注册我们的产品时，我们会创建数据库。我们将为您自动规模，因为我只是不相信信息是必要的。我们是专家。我们喜欢数据库。我们构建数据库。我们为您处理这个问题。\n 此外，人们对我们的计费模型感到兴奋，因为人们真的只是讨厌觉得他们因他们不使用的东西被指控。我们每行向您收取您的读取和每行写入，然后使用多少存储。就是这样。没有vcpus。没有保留的io。都不是。只是你消耗的东西和你做了什么。这是一个真正的服务体验很棒。\n VidtureBeat：像PlanetsCale这样的名字意味着你必须建立一个非常大的云。 \nLambert：我们有一个支持的业务，基本上是这些主要的规模公司，这些公司是我们的客户。如果你继续前页或看到那些家庭名称的一些徽标，那就是我们的客户。但我们的主要命运位于我们的云产品中。分支和架构更改的所有这些魔法都由云供电。我们的路线图，即将到来的一些非常酷的功能需要云。这些是您只能在云服务中提供的功能。这是人们想要的。无要的是赢得胜利。无服务器正在发生。\n VidtureBeat＆＃39; S使命是成为技术决策者的数字城市广场，以获得有关转型技术和Transact的知识。您网站提供有关数据技术和策略的基本信息，以指导您的领导您的组织。我们邀请您成为社区的成员，访问：门控思想领导者内容和对我们奖化事件的折扣访问，如转换2021：了解更多\n 成为会员 ", "note_en": "Some people who create a database like to start with a clean slate.  PlanetScale, which secured $30 million in series B funding with participation from a16z and SignalFire on Wednesday, took a slightly different approach. The company looked at MySQL, liked what it saw, and wrapped all of its enhancements around it. The core is still MySQL, running the standard engines and responding to the standard queries, but the wrapper handles all of the challenges of sharding and replication, making it possible to create what PlanetScale says is a database that can be started in seconds and scaled “indefinitely.”\n Developers can create a new database in seconds that will grow as they grow, with no limitations on scalability, the company said. Developers don’t need to know about the environment, such as new cloud zones, cluster sizes and other “DB-centric minutiae.” The new funding round will be used to scale the team globally and to accelerate exposure and adoption of the platform, the company said in a statement.\n  To find out a bit more about what is built into these extra layers, VentureBeat sat down with Sam Lambert, the chief product officer at PlanetScale. He tells us that among PlanetScale’s innovations are some based on Vitess, a  branch of MySQL that arose out of work at YouTube to scale the globe horizontally. Vitess is being used by hyperscalers such as Slack, GitHub, and Square.\n   Sam Lambert: The problem with pretty much every database out there is that no one building databases is thinking about the daily lives of the people that use them. Plain and simple like that. What’s different about us at PlanetScale is we’re getting into what the daily life of the developer looks like and solving the developer problems as they relate to the database.\n  Lambert: Remember the  NoSQL movement? MongoDB marketed themselves as a tool where developers don’t have to look after the schemas they hate, the schemas that are hard to manage — the schemas that are hard to deploy and to use. That was all true, all very real criticisms of any relational database.\n What we’ve done is allow branching and deploy requests for the schema changes. You can test your schema and then just push it into production. It rolls in as a  non-blocking change that’s completely available. It’s as if you’ve just pushed code. It has that ease of use with none of the problems. So, you get the great MySQL goodness with all developer workflows.\n  Lambert: An SQL command would lock the table. That would cause you horrible downtime, your application would slow down, your queries would pile up — it would just be a mess.\n VentureBeat: So you’re able to roll in the changes with locking up production?\n Lambert: With our way it just asynchronously rolls the changes into production — but if we see a burst of traffic we stop. We just pause what we’re doing and we let that traffic finish and then we carry on migrating it. So it’s like a real safe deployment of code, as if it’s just going out to all of these nodes in the database cluster.\n So if you want to do a schema change, you have your table. This is your users table. You want to add a column to track, say, whether a user is subscribed. What we do is we create a copy of the users table that’s empty. Just the schema. We add the subscribed column and then we slowly start to nibble data out of the existing one into the new one. We do it in an online way. So it’s just pulling in any new updates that come in. They get applied and we keep nibbling. When they’re both up to date with each other, we do an instant swap and the new column is live in production. The old table is there and we remove it and the new column is live in production. It’s the same way as when you’re deploying applications: You roll the new pods into production. This is a way of doing things the developers are very familiar with.\n  Lambert: Vitess is mega-scale, open source database technology built to power YouTube that powers everything from Slack to GitHub, but it’s complex. It’s tricky to maintain. It’s very hard to take something out of a big company and apply it to mid-market or small companies, much less small teams or individuals. It’s built for Google and YouTube. And they’ve done an immense job leveraging it. It’s for database people. It’s for infrastructure people.\n  Lambert: With the new PlanetScale, we’ve done that for you. We just completely remove the complexity. We’re your infrastructure people. We’re your database people. We’re meeting you where you are as a developer, where you don’t understand regions and clusters and servers and all of the things that others require you to choose. But we are built on Vitess and have the power of Vitess.\n  Lambert: Branching is some real magic sauce. So when you get a branch, get a whole new cluster, it’s a completely isolated cluster away from your current one. It’s a completely isolated environment.\n  Lambert: No. I’m sure you know, staging environments are a hellish problem for everybody. We are going to kill the concept of staging environments. They are an unnecessary mess. It’s just another burden to maintain with branching.\n We say: Don’t have this monolithic staging environment. Just create a branch per code branch. And that itself is a nice environment. Test it out, push it deployed. Then it goes away. Have as many branches as you want. Have 100 per developer if you want. They’re all environments used for staging, but it’s a generational leap past the old world of staging environments.\n VentureBeat: On one project we encountered, the boss didn’t want to pay for too many test clusters.\n Lambert: Yes, if your project is big, it’s a huge cost to clone them. If you set up a branch, you don’t end up doubling the number of resources you’re consuming. It’s a light, small subset.\n VentureBeat: On some projects I’ve been on, the staging and test clusters would start diverging from the production. We couldn’t keep them in sync. The code would run in staging and fail in production or, worse, run in production but fail in staging. We couldn’t test it. We would just cross our fingers and push it into production because we knew staging was munged.\n Lambert: The best I’ve seen with staging environments is they take last night’s backup and they restore it onto a separate cluster. So, it’s slightly stale and it’s just fragile.\n We don’t do that. We host PlanetScale’s main database on PlanetScale. When we’re adding a feature, we code it up locally and create a database branch. When we’re done, we push the changes and they’re all caught up.\n  Lambert: Horizontal sharding. It is supremely elegant and it breaks the problem down into multiple little chunks.. Sharding is much more elegant instead of stacking your machines. If you split your data into shards on commodity machines, you are not only getting the same amount of CPU cores serving reads as you would in a vertical scale environment, you’re getting more serving writes.  Replication delay doesn’t become an issue and you just keep growing.\n VentureBeat: What happens when the queries need to touch all of the shards, perhaps to build some aggregated report?\n Lambert: It does happen. But you can optimize, and we’ll give you ways to do that. There are definitely cross-shard aggregations, and that is a little bit slower. But when you need it, those are all easy optimizations compared to the conventional consistency problem, which is way, way more difficult to wrap your head around.\n VentureBeat: Deep in the core of your product is MySQL. Do you use the stock version?\n Lambert: The thing is that MySQL is the best. It’s pretty much the premiere when it comes to storage and storage engines. You just can’t beat it. You have access to all the storage engines — we’re compatible with other MySQL folks. But, for a pure storage engine, which is what we use it for, it’s just spot on.\n  Lambert: Look at our competitors. They ask you how many nodes you want. How many server CPUs? How many VCPUs? How much IO? Rubbish! We don’t ask for any of that. When you sign up for our product, we create your database. And we will auto-scale for you, because I just do not believe that information is necessary. We’re the experts. We love databases. We build databases. We handle that problem for you.\n Moreover, people are excited about our billing model because people really just hate to feel that they’re being charged for things they don’t use. We charge you per row you read and per row you write, and then how much storage you use. That’s it. No VCPUs. No reserved IO. None of that. Just what you consume and what you do. That is a truly service experience that is awesome.\n VentureBeat: A name like PlanetScale means you’ve got to be building out a pretty big cloud.\n Lambert: We have a support business that is reserved for, basically, these major scale companies that are our customers. And if you go on our front page or see some of those household name logos, that are our customers. But our main destiny lies in our cloud product. All of this magic of branching and schema changes is powered by the cloud. Our roadmap with some of these extremely cool features that are coming needs the cloud. These are features that you could only provide in a cloud service. It’s what people want. Serverless is winning. Serverless is happening.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-06-23 21:16:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "database,youtube,数据库,vitess,builds", "title": "PlanetsCale，它在Vitess上建立了一个类似的数据库，帮助缩放YouTube的Tech，提高了30万系列B ", "title_en": "PlanetScale, which builds a database-as-a-service offering on Vitess, the tech that helps scale YouTube, raises $30M Series B", "transed": 1, "url": "https://venturebeat.com/2021/06/23/planetscale-simplifies-distributed-database-complexity/", "via": "", "real_tags": ["database", "youtube", "数据库", "vitess", "builds"]}, {"category": "", "categoryclass": "", "imagename": "13724eef28aeb13bb5be2416d91dfa44.jpeg", "infoid": 1067695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Coindesk已经学会了，CoIndesk已经学会了一系列追踪加密犯罪的安全公司，已经关闭了2710万系列B系列资金。\n 筹款轮也由早期投资者德国推动，阿雷鲁首都和塞洛夫群体支持。\n 第三点企业的代表，它收到了一个密码板席位，确认了在电子邮件中的资金参与Coindesk。 Loeb的投资公司现在已经支持了三个加密初创公司，包括按位和etoro。\n  密码计划计划于6月2022年6月推出100人的行动，因为它试图利用Crypto智能的不断增长的市场。它几乎没有单独在该领域。 TRM Labs和ChableSysis在过去三个月里筹集了资本，Blocktrace在周一推出了一款新的软件产品，今天宣布了它已经完成了西班牙Santander最大银行的试点项目，以检测可疑活动。\n “这是在我们的空间中的一个美好时光，”戴夫·杰瓦斯在接受采访时告诉Coindesk。他说，他有12个月的资产恢复和保险公司稳定的业务，并正在展望银行。 “我们基本上我们看到了很多我们现在正在做的一切。”\n  密码销售加密交易所，政府调查员和银行的合规工具。它编译在钱包上的智能，以帮助组织跟踪交易，但不会与个人共享数据。\n  通过注册，您将收到关于COINDESK产品的电子邮件，您同意我们的条款和amp;条件和隐私政策。 \n杰维斯表示，这取决于揭露个人钱包持有者;他的公司只是帮助调查人员从一个点到B移动。\n 推出专业智能软件是最近的一个密码策略。它为4月份推出了一项制裁合规性平台，以4月份为符合金融行动工作队的工具市场“旅行规则”是“真正升温”，杰维兰说。全球金融监督员于2019年宣布规则，打击使用加密货币补助和为恐怖分子提供资金的使用。\n 另一个目标区域一直是隐私硬币。密码索赔它偶尔会突破Monero的保密面纱，犯罪分子使用的加密货币。 Jevan说，虽然他的团队是“支持Monero项目”，但他坚持认为，如果没有一定程度的监督，隐私硬币注定要失败，并指出，如果加密电机将蓬勃发展，则需要区块链追踪和合规工具。\n “如果没有这些工具，我们不会将下亿人进入市场，”他说。\n   COINDESK披露了关于加密货币，数字资产和金钱未来的信息，数字资产和未来的信息，是一种跨越最高的新闻标准，并遵守严格的编辑政策。 COINDESK是数字货币集团的独立运营子公司，投资加密货币和区块链初创公司。 ", "note_en": "CipherTrace, a security firm that tracks crypto crimes, has closed a $27.1 million Series B round of funding led by Dan Loeb’s Third Point Ventures, CoinDesk has learned.\n The fundraising round was also backed by early investors Neotribe, Acrew Capital and Seraph Group.\n A representative for Third Point Ventures, which received a CipherTrace board seat, confirmed its participation in the funding, in an email to CoinDesk.  Loeb’s investment companies have now backed three crypto startups, including  Bitwise and  eToro.\n  CipherTrace plans to double its 100-person operation by June 2022 as it tries to capitalize on the growing market for crypto intelligence. It’s hardly alone in the field.  TRM Labs and  Chainalysis have raised capital in the last three months,  Blocktrace unveiled a new software product on Monday, and  Elliptic announced today that it has completed a pilot project with Santander, Spain’s largest bank, to detect suspicious activity.\n “It’s a good time to be in our space,” CipherTrace CEO Dave Jevans told CoinDesk in an interview. He said he has had 12 months of steady business from asset recovery and insurance companies, and is looking to banks next. “We’re seeing a lot of growth in basically everything we’re doing now.”\n  CipherTrace sells compliance tools to crypto exchanges, government investigators and banks. It compiles intelligence on wallets to help organizations track transactions, but doesn’t share data on individuals.\n  By signing up, you will receive emails about CoinDesk products and you agree to our  terms &amp; conditions and  privacy policy.\n Jevans said it’s up to the courts to unmask individual wallet-holders; his company just helps investigators move from point A to B.\n Rolling out specialty intelligence software has been one recent CipherTrace strategy. It launched a  sanctions compliance platform for decentralized finance (DeFi) projects in April as the market for tools used to comply with the Financial Action Task Force “travel rule” is “really heating up,” Jevans said. The global financial watchdog announced rules in 2019 to combat the use of cryptcurrencies in money laundering and funding for terrorists.\n Another target area has been privacy coins. CipherTrace claims it can occasionally break through the veil of secrecy of  monero, a cryptocurrency that has been used by criminals. Jevan said that while his team is “supportive of the  monero project,” he insisted the privacy coin is doomed to fail without some degree of oversight and noted that blockchain tracing and compliance tools are necessary if cryptocurrency is going to flourish.\n “We’re not gonna get the next billion people into the market without these tools,” he said.\n   Disclosure The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2021-06-23 21:16:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,跟踪,helps,加密", "title": "有助于跟踪加密犯罪并销售合规工具的密码，提高27.1米系列B ", "title_en": "CipherTrace, which helps track crypto crimes and sells compliance tools, raises $27.1M Series B", "transed": 1, "url": "https://www.coindesk.com/loebs-third-point-leads-27m-investment-in-crypto-compliance-startup-ciphertrace", "via": "", "real_tags": ["密码", "跟踪", "helps", "加密"]}, {"category": "", "categoryclass": "", "imagename": "f819cdb6b6f79dbf7c06c66a22cf5239.png", "infoid": 1067694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客攻击。伪造。监视。网络是主板＆＃39;播客和在互联网的黑暗底层上报告。\n  由主板获得的iPhone解锁技术Graykey的新书面说明提供了更多地洞察设备的功能，包括Graykey是否可以解锁关闭的iPhone或者iPhone＆＃39; S电池运行低电平。\n  ＆＃34;如何用灰键，＆＃34解锁和提取来自Apple移动设备的数据;似乎由圣地亚哥警察局撰写的指示，阅读。主板通过公共记录请求获得了文件。\n 您是否在灰尘工作或了解公司产品的其他内容？我们很乐意听取您的意见。使用非工作手机或计算机，可以安全地联系Joseph Cox +44 20 8133 5190，Wickr在Josephcox上，在Josephcox上，OTR聊天在Jfcox@jabber.ccc.de上，或电子邮件joseph.cox@vice.com。\n  由基于Austin的灰度制作的Graykey旨在解锁现代IOS设备并提取其内容。默认情况下，iOS设备是加密的，这意味着有人需要拥有，或猜测设备＆＃39; s密码以访问存储在其上的一些数据。 iOS设备保护自己免受蛮力攻击，其中一块软件通过密码可能性迅速搅拌，但Graykey可以在某些情况下成功地强制强制iOS设备。该公司不断使用苹果猫和鼠标游戏，这试图修复Graykey利用的安全问题。全国各地的当地警察已经购买了金灰单位，主板已显示。\n   说明与询问读者开放，以确保他们确实有法律授权来搜索设备;这可以是搜索权证的形式。\n  ＆＃34;在将任何Apple移动设备连接到Graykey之前，确定是否已为所请求的Apple移动设备建立适当的搜索权限，＆＃34;文件读取。 \n说明描述了它声称允许GrayKey连接的各种条件：关闭设备（已知在第一次解锁之前或BFU之前）;打开手机（首次解锁后或AFU）;该装置具有损坏的显示器，当手机电池电量低时。\n  ＆＃34;灰key以2至3％的电池寿命安装代理，＆＃34;文件读取，参考＆＃34;蛮力代理人＆＃34; Graykey在手机上安装，以解锁设备。\n   在运行Graykey时，用户可以在链接的IOS设备中收集哪种数据或它们想要提取它的各种数据，指令显示。那些包括提取难以访问的文件的元数据，和＃34;当绑定密码时立即提取，＆＃34;据推测，SecureCenceave，IOS设备的一部分存储诸如密码的敏感材料。\n  指令的一个部分还介绍了如何蛮力字母数字密码。许多iPhone用户具有纯粹的数字密码，只由数字组成。字母数字密码也使用字母，因此具有更多字符选项，并且通常可以更具弹性，因为它使用随机系列的字符。如果设备使用包含真实单词的字母数字密码，这可能会使密码致力于更容易归功于Word Lists;人类可读词的长名单。\n   ＆＃34; Apple移动设备上的字母数字密码将由Graykey自动检测到Analyst，＆＃34的其他操作;说明读取。说明说，分析师将有选项使用称为＆＃34的默认字列表; CrackStation-Lean-Only.txt，＆＃34;也许是通过密码安全网站CrackStation发布的字列表。该存档包含大约15亿字。说明说，Graykey用户还可以导入自己的自定义字列表，但只有一个单词列表一次可以加载。\n  ＆＃34;如果已成功安装Brute力代理，将激活飞机模式，并且Apple移动设备可以断开连接或保持连接到GrayKey单元以进行数据提取，＆＃34;说明读取。\n  作为一个名为Siceui的功能的一部分，Graykey还允许各机构安装偷偷摸摸地记录用户的代理，如果当局将手机交回它们，NBC新闻报告说。 ", "note_en": "Hacking. Disinformation. Surveillance. CYBER is Motherboard&#39;s podcast and reporting on the dark underbelly of the internet.\n  New written instructions for the iPhone unlocking tech GrayKey obtained by Motherboard provide more insight into the capabilities of the device, including whether GrayKey can unlock iPhones that are turned off or when the iPhone&#39;s battery is running low.\n  &#34;How to unlock and EXTRACT DATA from Apple Mobile Devices with GrayKey,&#34; the instructions, seemingly written by the San Diego Police Department, read. Motherboard obtained the documents via a public records request.\n Do you work at Grayshift or know anything else about the company’s products? We’d love to hear from you. Using a non-work phone or computer, you can contact Joseph Cox securely on Signal on +44 20 8133 5190, Wickr on josephcox, OTR chat on   jfcox@jabber.ccc.de, or email joseph.cox@vice.com.\n  GrayKey, made by Austin-based Grayshift, is designed to unlock modern iOS devices and extract their contents. iOS devices are encrypted by default, meaning someone needs to have, or guess, the device&#39;s passcode to access some of the data stored on it. iOS devices protect themselves from brute force attacks, where a piece of software rapidly churns through passcode possibilities, but GrayKey can successfully brute force iOS devices in some cases. The company is   constantly in a cat-and-mouse game with Apple, which tries to fix security issues that GrayKey takes advantage of. Local police around the country have bought GrayKey units,   Motherboard has shown.\n   The instructions open with asking readers to make sure they do have legal authorization to search the device; this can be in the form of a search warrant.\n  &#34;Prior to connecting any Apple mobile device to GrayKey, determine if proper search authority has been established for the requested Apple mobile device,&#34; the document reads.\n    The instructions describe the various conditions it claims allow a GrayKey connection: the device being turned off (known as Before First Unlock, or BFU); the phone is turned on (After First Unlock, or AFU); the device having a damaged display, and when the phone has low battery.\n  &#34;GrayKey known to install agent with 2 to 3% battery life,&#34; the document reads, referring to the &#34;brute force agent&#34; GrayKey installs on the phone in order to unlock the device.\n   When running the GrayKey, users have various options around what sort of data they want to collect from a linked iOS device or how they want to extract it, the instructions show. Those include extracting metadata for inaccessible files, and &#34;immediate extraction when SE-bound passcode,&#34; presumably referring to the Secure Enclave, the part of iOS devices that stores sensitive material such as passcodes.\n  One section of the instructions also describes how to brute force an alphanumeric passcode. Many iPhone users have purely numerical passcodes, only made up of numbers. An alphanumeric passcode also uses letters, so has more characters options, and can generally be more resilient to brute force attempts if it uses a random series of characters. If the device uses an alphanumeric passcode containing real words however, that may make cracking the passcode easier thanks to word lists; long lists of human readable words.\n   &#34;An alphanumeric passcode on Apple Mobile Device will be automatically detected by GrayKey and require additional actions by the analyst,&#34; the instructions read. The instructions say that the analyst will have the option to use the default wordlist called &#34;crackstation-human-only.txt,&#34; perhaps referring to a wordlist released by the password security website Crackstation. That archive includes around 1.5 billion words. The instructions say GrayKey users can also import their own custom wordlists, but only one wordlist can be loaded at a time.\n  &#34;If the brute force agent has successfully installed, Airplane mode will be activated, and the Apple mobile device can be disconnected or remain connected to the GrayKey unit for data extraction,&#34; the instructions read.\n  As part of a feature called HideUI, GrayKey also allows agencies to install the agent which surreptitiously records the user&#39;s passcode if authorities hand their phone back to them,   NBC News reported.", "posttime": "2021-06-23 21:15:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,展示,show,graykey", "title": "说明展示了警察如何使用灰度来蛮力iPhone ", "title_en": "Instructions Show How Cops Use GrayKey to Brute Force iPhones", "transed": 1, "url": "https://www.vice.com/en/article/k7835w/how-to-brute-force-iphones-graykey", "via": "", "real_tags": ["iphone", "展示", "show", "graykey"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一名英国人，我允许符合茶食消费的刻板印象，并为我的大部分生命提供茶，我已经获得了各种基于茶的变量的观点。最大的是可接受的茶水饮用温度。\n 所以事情是。红茶（最好的茶）需要擦拭靠近沸水来味道最好。但与此同时，这与我能够立即喝它的不兼容。最重要的是因为你必须等待茶冷却，很容易忘记它，然后为时已晚：\n  有些人认为30℃或室温饮用茶是可以接受的，我认为那些人不正确。然而，在缺少可接受的温度窗口后，我决定在茶水饮用时需要一种方式来提醒。我拿出了我的Flir相机，并证实了甚至在杯子底部的新鲜酿造的一杯茶上的热量。\n  这开始了我思考。您可以设计茶杯子，可以阅读杯子的温度坐在上面。因此，我旨在制作一个带槽的过山车，用于温度传感器，在它下面，空间为ESP8266作为微控制器。\n    组装在一起看起来像这样（减去esp8266在调试中的插槽之外），MLX90616传感器从过山车的底部窥视。\n   之后，ESP8266设置了一个Web服务器，将关于普通格式的过山车温度导出指标，具有出色的精度为0.02c：\n [Ben @ aura〜] $ curl xxx：9000 / metrics＃帮助tea_mug_temp在过山车上的点temp。＃类型tea_mug_temp gaugetea_mug_temp 24.689997＃help tea_ampient_temp传感器的温度。＃类型tee_ambient_temp gaugetea_ambient_temp 27.490015 \n这意味着我可以在Grafana绘制我的过山车，看着杯子随着时间的推移而变得更冷：\n  然后我也可以写一个警报，因为当杯茶被认为是饮酒时，Max_over_time用于确保饮用性的警报并没有被我捡起杯子从中喝酒。\n 警报TeadRinkable if（max_over_time（tea_mug_temp [60s]）＆gt; 36）和（max_over_time（tea_mug_time（tea_mug_temp [60s]）＆lt; 56）对于1s注释{summary =＆＃34;山雀上的杯子现在饮用＆＃34;，描述=＆＃34;喝它。或不。 i＆＃39; m一个警报，不是cop＆＃34;，}\n 对我来说，我的警报通过AlertManager Webhook翻译，我写信给Discord聊天室，我为AlertManager写道，称为AlertManager-Discord\n    现在，可以说明您可以将LED还包含在它饮用时发出信号，以便它不依赖于互联网进行通知，但在那里的乐趣会在哪里？长时间过狗互联网。\n 如果要构建自己的TealeMetry设备，您可以在此处找到所有esp8266源代码和3D打印模型在这里：https://github.com/benjojo/tealemetry\n 如果您普遍享受此，您可以享受博客上的其他内容！如果您想及时了解我正在做的事情，您可以使用我的博客RSS，或者在Twitter上关注我 ", "note_en": "As a British person, I admittedly conform to the stereotype of tea consumption, and giving I’ve been consuming tea for most of my life I have gained opinions on all kinds of tea based variables. The biggest one being the acceptable tea drinking temperature.\n So the thing is. Black tea (the best tea) needs to be brewed with near boiling water to taste the best. But at the same time this is incompatible with me being able to drink it right away. On top of that because you have to wait for the tea to cool down, it’s easy to forget about it, and then it’s too late:\n  Some people think that drinking tea at 30c or room temperature is acceptable, I think  those people are incorrect. However after missing the acceptable temperature window too many times I decided I need a way to be alerted when the tea is drinkable. I got out my  FLIR camera and confirmed that the heat spread over a freshly brewed cup of tea is even at the bottom of the mug.\n  This started me thinking. You could design a tea coaster that can read the temperature of the mug sitting on it. So I set out to make a coaster with a slot for a temperature sensor, and under it, space for a ESP8266 as the microcontroller.\n    Assembled together it looks like this (minus the ESP8266 being outside of the slot for debugging), the  MLX90616 sensor peeking out from the bottom of the coaster.\n   After that, the ESP8266 setups up a web server that exports metrics about the coaster temperatures in  prometheus format, with exceptional accuracy of 0.02c:\n [ben@aura ~]$ curl xxx:9000/metrics# HELP tea_mug_temp The point temp on the coaster.# TYPE tea_mug_temp gaugetea_mug_temp 24.689997# HELP tea_ambient_temp the temp of the sensor.# TYPE tea_ambient_temp gaugetea_ambient_temp 27.490015\n This means I can graph my coaster in grafana and watch the mug get colder over time:\n  I can also then write a alert for when the cup of tea is considered drinkable,   max_over_time is used to ensure that the alert for drinkability is not dismissed by me picking up the mug to drink from it.\n ALERT teaDrinkable IF (max_over_time(tea_mug_temp[60s]) &gt; 36) and (max_over_time(tea_mug_temp[60s]) &lt; 56) FOR 1s ANNOTATIONS { summary = &#34;The mug on the coaster is now drinkable&#34;, description = &#34;drink it. or not. I&#39;m an alert, not a cop&#34;, }\n For me, my alerts are delivered to a  discord chat room via a alertmanager webhook translator I wrote for alertmanager called  alertmanager-discord\n    Now, arguably you could include a LED to also signal when it’s drinkable so that it’s not dependent on the internet for notifications, but where would be the fun in that? Long live the  internet of shit.\n If you want to build your own Tealemetry device, you can find all of the ESP8266 source code and 3D printing models on my github here:  https://github.com/benjojo/Tealemetry\n If you generally enjoyed this, you may enjoy what is else on the blog! If you want to stay up to date with what I am doing you can either use my blogs  RSS, or follow me on  Twitter", "posttime": "2021-06-23 21:15:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建设,telemetry,esp8266", "title": "茶A.K.A. Tealemetry建设遥测（2018） ", "title_en": "Building telemetry for tea a.k.a. Tealemetry (2018)", "transed": 1, "url": "https://blog.benjojo.co.uk/post/tealemetry-IOT-tea-coaster", "via": "", "real_tags": ["建设", "telemetry", "esp8266"]}, {"category": "", "categoryclass": "", "imagename": "f0a6fbd47b803ac88ec1ae5aa6b3d342.png", "infoid": 1067692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请在升级之前查看升级指南。在下面的打破变化部分中描述的特殊方案中有很少的破坏变化。\n     您还可以将Hasura元数据存储在由环境变量hasura_graphql_metadata_database_url给出的单独（postgres）数据库中\n  服务器概括为支持不同的数据库。我们通过为MS SQL Server和BigQuery提供只读支持来开始。\n      支持从GraphQL查询模板创建Idiomatic REST API端点，以便用户可以轻松支持非GraphQL客户端，并与其现有的REST工具集成。\n   权限系统已扩展到远程模式。您可以通过远程模式进行类型/字段屏蔽和预设参数（使用会话变量）。\n      您现在可以创建一个继承的角色，允许您将多个角色组合成一个角色（以添加方式）。这解决了许可系统的基本问题（如＃877和＃3442中所述），并且还可以帮助您以模块化方式管理角色。\n  在第一个版本中，仅在继承角色下公开postgres查询和订阅。 \nPS：继承角色是目前是一个实验特征。要启用继承的角色，请使用环境变量hasura_graphql_experish_features启动Hasura服务器：＆＃34;继承_＆＃34;\n   考虑两个表，项目（ID，名称，库存）和Shopping_cart（ID，Item_ID，数量），这两个表通过Item_ID列与。现在，在Shopping_cart表上定义INSERT权限时，只有在项目表中存在足够的库存时，才会检查才能将物品插入购物车。\n   现在支持使用Ltree，LQuery或LTXTQUERY类型的列上的比较运算符，用于搜索存储在层次结构树状结构中的数据。\n   MS SQL Server中的空间数据类型，几何和地理上的比较运算符现在支持。支持以下运营商：\n   我们现在支持使用ST_3DDWithin和ST_3DINtersects的功能在布尔表达式中使用。请注意，ST_3DINtersects需要使用SFCGAL支持构建POSTGIS，这可能取决于所使用的Partgis分布。\n  服务器：将请求字段添加到包含GraphQL查询/突变，其名称和通过的任何变量的Webhook Post Body（关闭＃2666）\n  服务器：无法再执行的一些突变将不再在模式中（例如，删除_PK突变＆＃39; t未在所有主键上选择权限的用户显示）（＃4111） \n服务器：可配置的WebSocket保持活动间隔。 添加--websocket -keepalive命令行标志和hasura_graphql_websocket_keekalive env变量（修复＃3539）  服务器：在表配置中引入可选的自定义表名，以根据自定义名称跟踪表。 已弃用set_table_custom_fields API，已添加新的API Set_Table_Customization以设置配置。 （＃3811）  服务器：支持将int或字符串标量类型连接到远程关系中的ID标量类型  服务器：各种更改，以确保在SIGTERM信号时及时清理背景线程和其他资源。  服务器：修复问题触发器在分区的表上定义的事件触发器（修复＃6261）  服务器：操作阵列关系现在支持与常用关系相同的输入参数（例如Where或Distinct_on）  服务器：修复在GraphQL-Engine中添加的远程模式的非可选模式的问题（修复＃6401） \n服务器：在JWT Config中接受新配置_SKSW，为JWT到期（修复＃2109）提供Leeway\n 服务器：始终以查询日志和http-log的detode.request_id路径记录request_id（＃6244）\n  服务器：如果从池中获取连接的时间超过可配置超时（＃6326），请终止请求\n      服务器：在远程关系＆＃39; s加入字段定义的自定义GraphQL名称时修复问题（修复＃6626）\n    服务器：删除仅支持基本类型函数参数的限制。具有表类型的参数的类型现在是＆lt; tablename＆gt; _scalar以避免与对象类型冲突＆lt; tablename＆gt ;.\n 服务器：添加--Async-actions-fetch-interning命令行标志和hasura_graphql_async_actions_fetch_interval环境变量，用于配置异步操作从元数据存储重新获取间隔（修复＃6460）\n    服务器：更新PG_DUMP清洁输出以禁用创建功能语句中的函数正文验证，以避免由于前进引用而导致的错误 \n服务器：添加＆＃34;善良＆＃34;字段查询日志项。善良可以是＆＃34;数据库＆＃34 ;,＃34;行动＆＃34 ;,＆＃34;远程模式＆＃34 ;,＆＃34; graphql＆＃34 ;,＆＃34;缓存和＃34 ;,或＃34;订阅＆＃34;\n   服务器：接受一个新的enc cenf hasura_graphqql_events_fetch_batch_size来配置从单个批处理中从事件日志表中获取的行数\n 服务器：在事件触发处理中恢复适当的批处理行为，以便一次在大多数2倍批处理事件中签出\n    服务器：仅在需要时初始化HDB_Catalog表，并且仅运行所需的源的事件循环\n         服务器：修复BIGINT溢出，在事件触发有效载荷中不正确的地质json格式（修复＃3697）（修复＃2368）\n  服务器：由GraphQL-Engine生成时转发X-Request-ID标题（而不是用户提供）（修复＃6654）\n 服务器：介绍--graceful-shutdown-timeout服务器配置，将在关闭之前等待机上计划和事件触发事件和异步操作以完成 \n服务器：Sanitize事件触发和计划触发日志以省略可能敏感的请求身体和标头  服务器：修复查询验证中的错误，这些错误会使用默认变量值拒绝（修复＃6867）  SERVER：SQL Server和BigQuery（Console Pending）上支持远程关系（数据库到远程模式连接）  服务器：BigQuery：从Dataloader方法切换到单个查询生成。 这应该导致更快的查询响应。  控制台：添加选项要将插入作为数据部分的迁移（关闭＃1766）（＃4933）  控制台：在表中具有非小写名称和评论时修复Postgres表创建（＃6760）  控制台：显示表格和Cloumn名称超过63个字符的错误通知，并缩减迁移名称超过255个字符 \n控制台：在列上添加修改功能，主键＆amp; 对MS SQL Server表的唯一键  CLI：CLI-EXT现在是CLI二进制的本机部分（不再需要作为插件）  CLI：Add --all-DatabaseS标志用于迁移应用，这允许在所有连接的数据库上应用迁移  CLI：FIX回归 - 元数据应用 - 运行在服务器上覆盖本地元数据文件时，它应该只显示差异  构建：将test_server_pg_13添加到CI以在Postgres V13上运行服务器测试（＃6070）  根据第704期间的讨论，比较输入对象中的显式空值将被视为错误，而不是导致正在评估为true的表达式。  例如：突变DELETE_USERS（其中：{id：{{_eq：$ userid}}）{name}如果$ userid为null，则会产生错误，而不是删除所有用户。 \n在远程模式关系查询中，当所有连接参数都不为空值时，将查询远程模式。当存在空值时，远程架构Won＆＃39;要查询，远程关系字段的响应将为null。早先，使用空值参数查询远程架构，响应依赖于远程模式如何处理空头参数但根据用户反馈，此行为显然不会预期。\n Order_by运算符将一个对象数组接受作为输入的输入，以便在给定顺序中按多个字段排序，即[{field1：sortorder}，{field2：sortorder}]，但它也接受一个具有多个键作为输入的单个对象， IE {field1：sortorder，field2：sortorder}。在早期版本中，HASURA＆＃39; s查询解析逻辑用于在输入对象中的键中保持键顺序，因此生成了与正确顺序的字段的适当顺序。\n 由于输入对象键的GraphQL规范提及是无序的，但新的和更严格查询解析逻辑并在输入对象中删除所生成的顺序的输入对象中的键顺序在给定的顺序中拥有字段。\n 例如：查询fetch_users（Order_by：{年龄：desc，name：asc}）{id name年龄}旨在获取由年龄命令的用户订购，然后通过他们的名称来保证首先按年龄排序返回结果然后通过他们的名称作为Order_by input作为对象传递。为了实现预期的行为，应使用以下查询fetch_users（Order_by：[{age：desc}，{name：asc}）{id name age}使用数组来定义字段顺序以生成相应的顺序按条款。\n 计算的字段参数的名称已从＆lt; compancy_name＆gt更改为＆gt; computed_field_name＆gt; _＆lt; table_name＆gt; _args作为函数名称是计算字段的内部详细信息。此更改还可以将根级跟踪函数添加为先前抛出输入类型冲突错误的计算字段。\n 由较旧的Hasura版本生成的Hasura API不能将远程模式添加到Hasura v2\n 使用v2.0，已扩展了一些自动生成的架构类型。例如，String_Comparison_exp具有另外的正则表达式输入对象字段。这意味着如果您有一个带有较旧的Hasura版本的Hasura API，则添加为远程模式，那么它将具有类型冲突。您应该升级所有Hasura远程模式以避免此类冲突。 \n在应用多个迁移时，在早期的Hasura CLI版本中，所有迁移文件都在一个事务块下运行。即，如果任何迁移抛出错误，则将滚动所有先前成功的迁移。使用Hasura CLI v2.0，每个迁移文件都在自己的事务块中运行，但所有迁移都不会在其中执行。即，如果任何迁移抛出错误，将停止应用进一步的迁移，但另一个成功执行的迁移到该点不会退回。\n 在v2.0中，使用以下env变量的值来在更新现有实例或开始新实例时定义默认数据库的连接参数。在元数据初始化期间，它们的值将移动到默认数据库的元数据，如此处定义。\n  发布初始设置/更新一旦初始化元数据，这些env变量可以被视为已弃用。即，这些env变为的变化或设置值将没有影响，因为现在使用Hasura元数据的值来定义连接参数。 ", "note_en": "Please check the  upgrade guide before upgrading. There are few breaking changes in special scenarios which are described in  Breaking changes section below.\n     You can also store Hasura metadata in a separate (Postgres) database given by the environment variable  HASURA_GRAPHQL_METADATA_DATABASE_URL\n  The server has been generalized to support different databases. We start off by providing read-only support for MS SQL server and BigQuery.\n      Support for creating idiomatic REST API endpoints from GraphQL query templates so that users can support non-GraphQL clients easily and integrate with their existing REST tooling.\n   The permission system has been extended for Remote Schemas. You can do type/field masking and preset arguments (with session variables) over remote schemas.\n      You can now create an  Inherited Role which allows you to combine multiple roles into one role (in an additive way). This solves fundamental problems with permission system (as described in  #877 and  #3442) and also helps you manage roles in a modular way.\n  In the first version, only Postgres queries and subscriptions are exposed for an inherited role.\n PS: Inherited roles is currently an experimental feature. To enable inherited roles, start the Hasura server with environment variable  HASURA_GRAPHQL_EXPERIMENTAL_FEATURES: &#34;inherited_roles&#34;\n   Consider two tables,  items(id, name, stock) and  shopping_cart(id, item_id, quantity) and these two tables are related via the  item_id column. Now, while defining insert permission on the  shopping_cart table, there can be a check to insert an item into the shopping cart only when there is enough  stock present in the  items table.\n   Comparison operators on columns with  ltree,  lquery or  ltxtquery types are now supported, for searching through data stored in a hierarchical tree-like structure.\n   Comparison operators on spatial data types, geometry and geography, are now supported in MS SQL Server. The following operators are supported:\n   We now support the use of the functions  ST_3DDWithin and  ST_3DIntersects in boolean expressions. Note that  ST_3DIntersects requires PostGIS be  built with SFCGAL support which may depend on the PostGIS distribution used.\n  server: add request field to webhook POST body containing the GraphQL query/mutation, its name, and any variables passed (close  #2666)\n  server: some mutations that cannot be performed will no longer be in the schema (for instance, delete_by_pk mutations won&#39;t be shown to users that do not have select permissions on all primary keys) ( #4111)\n   server: Configurable websocket keep-alive interval. Add --websocket-keepalive command-line flag and HASURA_GRAPHQL_WEBSOCKET_KEEPALIVE env variable (fix  #3539)\n server: introduce optional custom table name in table configuration to track the table according to the custom name. The set_table_custom_fields API has been deprecated, A new API set_table_customization has been added to set the configuration. ( #3811)\n server: support joining Int or String scalar types to ID scalar type in remote relationship\n   server: various changes to ensure timely cleanup of background threads and other resources in the event of a SIGTERM signal.\n server: fix issue with event triggers defined on a table which is partitioned (fixes  #6261)\n server: action array relationships now support the same input arguments (such as where or distinct_on) as usual relationships\n  server: fix issue with non-optional fields of the remote schema being added as optional in the graphql-engine (fix  #6401)\n server: accept new config allowed_skew in JWT config to provide leeway for JWT expiry (fixes  #2109)\n server: always log the request_id at the detail.request_id path for both query-log and http-log ( #6244)\n  server: terminate a request if time to acquire connection from pool exceeds configurable timeout ( #6326)\n      server: fix issue when a remote relationship&#39;s joining field had a custom GraphQL name defined (fix  #6626)\n    server: remove the restriction of supporting only base type function arguments. The type of an argument with a table type is now  &lt;tablename&gt;_scalar to avoid conflicts with the object type  &lt;tablename&gt;.\n server: add  --async-actions-fetch-interval command-line flag and  HASURA_GRAPHQL_ASYNC_ACTIONS_FETCH_INTERVAL environment variable for configuring async actions re-fetch interval from metadata storage (fix  #6460)\n    server: update pg_dump clean output to disable function body validation in create function statements to avoid errors due to forward references\n    server: add &#34;kind&#34; field to query-log items. Kind can be &#34;database&#34;, &#34;action&#34;, &#34;remote-schema&#34;, &#34;graphql&#34;, &#34;cached&#34;, or &#34;subscription&#34;\n   server: accept a new env conf  HASURA_GRAPHQL_EVENTS_FETCH_BATCH_SIZE to configure the number of rows being fetched from the events log table in a single batch\n server: restore proper batching behavior in event trigger processing so that at most 2x batch events are checked out at a time\n    server: initialise  hdb_catalog tables only when required, and only run the event loop for sources where it is required\n         server: fix bigint overflow, incorrect geojson format in event trigger payload (fix  #3697) (fix  #2368)\n  server: forward the x-request-id header when generated by graphql-engine (instead of being user-provided) (fix  #6654)\n server: introduce  --graceful-shutdown-timeout server config which will wait for the in-flight scheduled and event trigger events and async actions to complete before shutting down\n server: sanitise event trigger and scheduled trigger logs to omit possibly sensitive request body and headers\n   server: fix a bug in query validation that would cause some queries using default variable values to be rejected (fix  #6867)\n       server: remote relationships (database to remote schema joins) are now supported on SQL Server and BigQuery (console pending)\n server: BigQuery: switches to a single query generation from a dataloader approach. This should result in faster query responses.\n      console: add option to flag an insertion as a migration from Data section (close  #1766) ( #4933)\n                 console: fix Postgres table creation when table has a non-lowercase name and a comment ( #6760)\n              console: show error notification for table and cloumn names exceeding 63 characters and trim migration names exceeding 255 characters\n    console: add modify functionality on columns, primary keys &amp; unique keys to MS SQL Server tables\n        cli: cli-ext is now a native part of cli binary (no longer needed as a plugin)\n   cli: add  --all-databases flag for  migrate apply, this allows applying migrations on all connected databases in one go\n  cli: fix regression -  metadata apply —dry-run was overwriting local metadata files with metadata on server when it should just display the differences\n               build: add test_server_pg_13 to the CI to run the server tests on Postgres v13 ( #6070)\n  According to the discussion in  issue 704, an explicit  null value in a comparison input object will be treated as an error rather than resulting in the expression being evaluated to  True.\n For example: The mutation  delete_users(where: {id: {_eq: $userId}}) { name } will yield an error if  $userId is  null instead of deleting all users.\n In a remote schema relationship query, the remote schema will be queried when all of the joining arguments are not  null values. When there are  null value(s), the remote schema won&#39;t be queried and the response of the remote relationship field will be  null. Earlier, the remote schema was queried with the  null value arguments and the response depended upon how the remote schema handled the  null arguments but as per user feedback, this behaviour was clearly not expected.\n The  order_by operator accepts an array of objects as input to allow ordering by multiple fields in a given order, i.e.  [{field1: sortOrder}, {field2: sortOrder}] but it is also accepts a single object with multiple keys as an input, i.e.  {field1: sortOrder, field2: sortOrder}. In earlier versions, Hasura&#39;s query parsing logic used to maintain the order of keys in the input object and hence the appropriate  order by clauses with the fields in the right order were generated .\n As the  GraphQL spec mentions that input object keys are unordered, Hasura v2.0&#39;s new and stricter query parsing logic doesn&#39;t maintain the order of keys in the input object taking away the guarantee of the generated  order by clauses to have the fields in the given order.\n For example: The query  fetch_users(order_by: {age: desc, name: asc}) {id name age} which is intended to fetch users ordered by their age and then by their name is now not guaranteed to return results first ordered by age and then by their name as the  order_by input is passed as an object. To achieve the expected behaviour, the following query  fetch_users(order_by: [{age: desc}, {name: asc}]) {id name age} should be used which uses an array to define the order of fields to generate the appropriate  order by clause.\n The name of the computed field argument has changed from  &lt;function_name&gt;_args to  &lt;computed_field_name&gt;_&lt;table_name&gt;_args as the function name is internal detail for a computed field. This change also enables adding a root-level tracked function as a computed field which previously would have thrown input type conflict error.\n Hasura APIs generated by older Hasura versions cannot be added as Remote Schemas to Hasura v2\n With v2.0, some of the auto-generated schema types have been extended. For example,  String_comparison_exp has an additional  regex input object field. This means if you have a Hasura API with an older Hasura version added as a remote schema then it will have a type conflict. You should upgrade all Hasura remote schemas to avoid such type conflicts.\n While applying multiple migrations, in earlier Hasura CLI versions all migration files were run under one transaction block. i.e. if any migration threw an error, all the previously successfully executed migrations would be rolled back. With Hasura CLI v2.0, each migration file is run in its own transaction block but all the migrations are not executed under one. i.e. if any migration throws an error, applying further migrations will be stopped but the other successfully executed migrations up till that point will not be rolled back.\n In v2.0, the values of the following env vars are used to define the connection parameters of the  default database while updating an existing instance or while starting a fresh instance. During metadata initialization, their values are moved to the metadata of the  default database as defined  here.\n  Post the initial setup/update once the metadata is initialized, these env vars can be considered as deprecated. i.e. changing or setting values of these env vars will have no impact as the values in the Hasura metadata are now used to define the connection parameters.", "posttime": "2021-06-23 21:14:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "graphql,graphcell,服务器", "title": "HASURA GraphCell Engine 2.0 ", "title_en": "Hasura GraphQL Engine 2.0", "transed": 1, "url": "https://github.com/hasura/graphql-engine/releases/tag/v2.0.0", "via": "", "real_tags": ["graphql", "graphcell", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试全数字访问，了解为什么超过100万读者订阅FT  选择购买审判订阅$ 1持续4周，您将在审判结束后每月收费91美元  4周接收无限的优质数字访问FT＆＃39; S值得信赖，获奖的商业新闻  礼品文章 - 每月分享最多10条与家人，朋友和同事 ", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1 for 4 weeks   You will be billed $91 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2021-06-23 21:14:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,民主,kong,订阅", "title": "香港民主小报苹果每天关闭 ", "title_en": "Hong Kong pro-democracy tabloid Apple Daily to shut down", "transed": 1, "url": "https://www.ft.com/content/1eec04cb-bc7d-497b-9c87-4518355b5fc6", "via": "", "real_tags": ["苹果", "apple", "民主", "kong", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "ac47bd9ae7ffd39361a85c87a05d50c5.png", "infoid": 1067690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们比以往任何时候都拍摄更多照片。根据Infotrends，这已经是天文部门的增长是爆炸性的，拍摄了超过1.4万亿的照片。从2017年的1万亿美元起。视频与YouTube近年来的视频相同，大约需要500小时的视频每一分钟到平台。\n 寻找解决这些珍贵记忆的解决方案比以往任何时候都更重要，而且它成为一个越来越大的解决问题。照片描绘了一个特殊的时刻，一个可以＆＃39; t的记忆或事件被重新创建。它们是不可替代的，在很大程度上只存在数字。因此，很少有几个类别的数据，适合自由和开放的自托管解决方案。\n 纯粹主义者会争辩说你的照片是你的，你应该永远拥有它们，无论什么，全部决议。实用主义者将争辩说，只要出口工具足够好，纯度并不重要。然而，对于许多日常照片服务用户，这是所有学术思想实验 - 大多数人都使用Google照片。这项服务两年前通过了十亿用户。 （顺便说一下，在Google照片上导出意味着使用Google Rakout。我一直在等待我所要求的数据七天的撰写。）\n  但本月，选择重新打开了许多互联网用户。截至6月1日，2021年6月，上传到Google照片的任何新照片和视频都将开始计入您的Google存储配额。以前感到永无止境的空间现在是有限的一些帐户。现有的高质量照片和视频免于这种变化，但此举有很多人，我包括，思考替代品。\n    具体而言，我一直在考虑自托管的照片管理替代品 - 特别是那些Web Apps的照片。\n  照片管理是一个主题的Juggernaut，它对不同的人意味着不同的东西。例如，专业的摄影师＆＃39;只有在他们的手机上采取自拍照的人之外的波兰人。\n 下面的每个应用程序都有其优点和缺点。在撰写本文时，我们认为您＆＃39;重新找到一个魔法＆＃34;一个尺寸适合所有＆＃34;选项。但是，在一起的一些应用程序可能会导致连贯的工作流程，使谷歌照片不那么痛苦。 \n您也可以将沟通谷歌照片视为一个机会。尝试以下工具作为自主照片管理世界的底漆，并将您暴露给最令人兴奋的Google照片替代品。这个空间正在迅速发展，我们＆＃39; d建议使用DEMOS大多数项目提供，以便在进行之前为自己评估应用程序。\n 我们故意忽略了像Adobe Lightroom，Darktable和Digikam等更多桌面以桌面为中心的应用程序。毕竟，Google照片是一个Web应用程序，所以这里正在测试的软件遵循同样的范式。\n  有无数的主流应用程序或服务的例子，我们依赖于在工资空中（You＆＃39; Ve Seed Ars＆＃39;奥谷歌杀死产品＆＃34;系列，右边的持续或放置一毫无免费的功能。因此，对于许多自主旅馆，使用开源的东西是一个基本要求。在一个自主托管团结的情况下，我们＆＃39; LL也主要专注于今天的开源软件。\n  也许是你＆＃39;在一个受到＆＃34的故事中的这一点上面做到了这一点;秋季＆＃34;谷歌照片并简单地想到自己，＆＃34;良好的riddance。＆＃34;但是，在2015年在2015年推出的服务以来，Google照片已成为许多事实上的照片管理软件的原因。\n    谷歌照片大多数人都有大多数人都想要这种类型的软件，它可以合理且轻松地完成这些事情。\n Google照片具有可搜索的对象和面部识别，专辑支持，移动设备的自动备份，以及具有粒度权限的简单照片共享，以及其他功能。该服务支持照片，实时照片和视频。并且通过允许人们通过日期，地点，对象或人员搜索他们的越来越多的图书馆，谷歌解决了单一行程的组织问题。\n 谷歌＆＃39;大规模的大部分是最重要的。它＆＃39; s允许公司培训其机器学习算法以了解A＆＃34之间的差异;山＆＃34;和一个＆＃34;树＆＃34;如此准确地或为这些算法学习您的照片中的面孔。然而，谷歌＆＃39;然而，SCALE也提出了关于隐私的问题。该公司表示，＆＃34;隐私是我们所做的一切的核心，＆＃34;它并不使用Gmail，Dri​​ve，Calendar或照片等个人产品中的数据以供广告目的。一个奇迹谷歌确实使用该数据。此外，元数据往往比数据本身更强大。 \n＆＃34;因为你们这么多人依赖于Google照片......它的重要性是它能够在长途运输中为您服务，＆＃34; Google照片产品领导David Lieb在Twitter上倒下了。 我想相信Google照片将在50年内左右，但鉴于谷歌＆＃39;杀死产品的轨道记录，感觉就像一个冒险的赌注。  所以是的，谷歌照片很好。 但我们可以信任我们的数据吗？ 只要我们需要它，服务就会围绕服务？ 在什么费用？ 这些是用户通过哪个镜头开始查看自托管解决方案。 ", "note_en": "We take more photos now than ever before. Growth in this already astronomical segment is explosive, with over 1.4 trillion photos taken last year, according to InfoTrends. That&#39;s up from 1 trillion in 2017. Video is much the same, with YouTube  saying in recent years that about 500 hours of video is uploaded to the platform  every minute.\n Finding a solution to organizing and safely storing these precious memories is more important than ever, and it&#39;s becoming an increasingly large problem to solve. Photos depict a special moment in time, a memory or event that can&#39;t be recreated. They are irreplaceable and largely only exist digitally. Because of this, there are few categories of data that suit a free and open self-hosted solution better.\n Purists will argue that your photos are yours and you should own them forever, no matter what, in full resolution. Pragmatists will argue that so long as the export tools are good enough, purity doesn&#39;t matter. For many day-to-day photo service users, though, that was all an academic thought experiment—most people use Google Photos. The service  passed a billion users two years ago. (Exporting on Google Photos, by the way, means using  Google Takeout. I&#39;ve been waiting for my requested data for seven days as of this writing.)\n  But this month, the choice reopens for many Internet users.  As of June 1, 2021, any new photos and videos uploaded to Google Photos will begin to count against your Google storage quota. Space that previously felt never-ending is now finite for some accounts. Existing high-quality photos and videos are exempt from this change, but the move has a lot of people, me included, thinking about alternatives.\n    Specifically, I&#39;ve been thinking about self-hosted photo management alternatives—particularly those with web apps.\n  Photo management is a juggernaut of a topic, and it means different things to different people. For example, a professional photographer&#39;s needs are poles apart from those of people taking selfies on their cell phones.\n Each app below has its pros and cons. At the time of writing, we think you&#39;re unlikely to find a magic &#34;one size fits all&#34; option. But stringing a few apps together might result in a coherent workflow that makes leaving Google Photos less painful.\n You can also look at ditching Google Photos as an opportunity. Trying out the following tools serves as a primer for the world of  self-hosted photo management and exposes you to the most exciting Google Photos alternatives. This space is developing rapidly, and we&#39;d advise making use of the demos most projects provide to evaluate the apps for yourself before proceeding.\n We&#39;ve deliberately ignored more desktop-focused apps like  Adobe Lightroom,  Darktable, and  digiKam. Google Photos is a web app, after all, so the software being tested here follows that same paradigm.\n  There are countless examples of mainstream applications or services we rely on becoming obsolete or placing once-free features behind a paywall (you&#39;ve seen Ars&#39; ongoing &#34; Google Kills Product&#34; series, right?). So for many self-hosters, using something that is  open source is a fundamental requirement. In a show of self-hosting solidarity, we&#39;ll also focus primarily on open source software today.\n  Perhaps you&#39;ve made it to this point in a story inspired by the &#34;fall&#34; of Google Photos and simply thought to yourself, &#34;Good riddance.&#34; But there&#39;s a reason why Google Photos has become the de facto photo-management software for many since the service launched in 2015.\n    Google Photos does most things most people want from this type of software, and it does those things reasonably well and easily.\n Google Photos has searchable object and face recognition, album support, automatic backup from mobile devices, and simple photo sharing with granular permissions, among other features. The service supports photos, live photos, and videos all the same. And by allowing folks to search their growing libraries by date, place, object, or person, Google solved the problem of organization with a single stroke.\n Google&#39;s massive scale is what makes most of this possible. It&#39;s what allows the company to train its machine-learning algorithms to know the difference between a &#34;mountain&#34; and a &#34;tree&#34; so accurately or for those algorithms to learn which faces are in your photos. Google&#39;s scale also raises questions about privacy, however.  The company says that &#34;privacy is at the heart of everything we do,&#34; and it doesn&#39;t use data in personal products like Gmail, Drive, Calendar, or Photos for advertising purposes. One wonders what Google does use that data for, though. Plus, metadata is often more powerful than the data itself.\n &#34;Since so many of you rely on Google Photos... it&#39;s important that it is able to serve you over the long haul,&#34; Google Photos product lead David Lieb  wrote on Twitter last fall. I want to trust that Google Photos will be around in 50 years, but that feels like a risky bet given Google&#39;s track record for killing products.\n So yes, Google Photos is good. But can we trust our data to it? And will the service be around for as long as we need it to be? At what cost? These are the lenses through which a user starts looking at self-hosted solutions.", "posttime": "2021-06-23 20:38:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,2020,照片,hosted", "title": "谷歌照片是如此2020-欢迎来到自主照片管理世界 ", "title_en": "Google Photos is so 2020—welcome to the world of self-hosted photo management", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/the-big-alternatives-to-google-photos-showdown/", "via": "", "real_tags": ["google", "谷歌", "2020", "照片", "hosted"]}, {"category": "", "categoryclass": "", "imagename": "4467c7a11f58139a401be8a4630b1b02.png", "infoid": 1067689, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于旧金山的创业公司已筹集了1900万美元的统一，由Norwest Venture Partners领导。第一轮资本，设计师资金和涂鸦企业也参加了筹款，将用于继续投资产品和招聘：该公司现在拥​​有20本书，旨在将在今年年底之前加倍，在市场积极招待会的高跟鞋。\n 自去年正式推出以来，拟理已拿到100多家客户，初步关注自己的后院的快速扩展公司，这是一个D＆amp的标志;我特别在科技行业中焦点。那些使用人种进行比较和弄清楚赔偿的人包括Instacart，Scale.ai和Clearco，而该公司在过去的四个月中表示，该平台已被用来制作5,000个职位优惠。\n   CEO与Warren Lebovics（右图）共同创立的首席执行官Kaitlyn Knopp提出了拟理的想法，同样地相同的方式，即在企业世界中的许多创新来到市场：通过她自己的第一个 - 制造经验。\n 她花了十年的湾区就业补偿，在谷歌，Instacart和巡航中有了以前的角色。在那个时候，她发现了许多公司使用的工具缺乏，只在赔偿分析时缺乏“笨拙”。\n “到目前为止，市场工作的方式是平台作为一个元素的赔偿，而不是重点，”她说。 “这是标记线的末尾，候选人的”CRM的最后一部分“。但是你仍然必须填补所有的空白，你必须以正确的方式设置架构。随着薪酬，您必须在您自己的分析中烘焙，这意味着您必须拥有一些专业知识。“\n 事实上，与企业软件的其他方面一样，她补充说，这是最大的科技公司有时曾在自己的工具上工作，但不仅会留下更小或以其他方式以其他焦点的业务留出更好的计算工具，而且还意味着那些工具是孤独的，被扭曲的是工作世界的大量的塑造。 “我们想采取这个过程并拥有它。”\n Pequity产品基本上是通过插入HR Professional可能正在使用的所有其他工具 -  HRIS，ATS和工资单产品 - 在整个组织中管理薪水，以分析和比较赔偿如何寻找现有和潜在的员工。它结合了公司自己的数据，然后将其与来自更广泛市场的数据进行比较，包括典型的行业范围和市场趋势，为人力资源团队提供见解。 \n所有这一切都意味着人力资源团队能够做出更明智的决策，这是一个更加透明和公平的步骤编号，但也是拟理的优化，以专门涵盖其在团队中衡量补偿的优化。\n 并且符合这一点，knopp还想要在独立产品中寻址的补偿性思维方式，这是构建具有任务的工具的想法，一个可以提供可以带来数据的平台透明和公平的决定。\n “我互动的很多Comp工具都是反应的，”她说。 “您可能需要做，例如付费股权测试，您可以进行促销和优点周期，然后找到您必须解决的所有这些问题。我们正在通过我们的分析主动地将这些事情标记为我们的分析，因为我们将在这些系统中插入，这将在决定之前给您那些警报。“\n 作为这种方向的一个额度阶段，Knopp表示，最终她认为该工具应该是人力资源之外的那些，例如管理者和euployees本身，应该能够更好地了解自己补偿的逻辑并有更多信息进入任何谈判。\n 最终，看看现代化的产品是否像撒尿一样，这将是有趣的，这些产品正在解决新的方法和观点，在更广泛的市场中找到牵引力。如果人力资源中的一个目的是解决多样性和包含，那么这些问题的一部分是工具只是不适合该目的，那么我们似乎将看到更多的组织尝试新事物来看待新事物如果他们可以帮助他们自己的种族来保护人才。\n “赔偿反映了公司的价值观，影响其雇用人才的能力，并且是其P＆amp的最大费用。然而，大多数CoMP团队在电子表格和电子邮件上运行，“纳尔韦斯特，在诺尔韦斯特，在一个声明中。 “PEQUITY EMPOWERS COMPOW团队设计和管理具有由Comp专业人士设计的现代软件的公平薪酬计划，用于Comp专业人士。” ", "note_en": "The San Francisco-based startup has raised $19 million in a Series A led by Norwest Venture Partners. First Round Capital, Designer Fund, and Scribble Ventures also participated in the fundraise, which will be used to continue investing in product and also hiring: the company has 20 on its own books now and will aim to double that by the end of this year, on the heels of positive reception in the market.\n Since launching officially last year, Pequity has picked up over 100 customers, with an initial focus on fast-scaling companies in its own backyard, a mark of how D&amp;I have come into focus in the tech industry in particular. Those using Pequity to compare and figure out compensation include Instacart, Scale.ai and ClearCo, and the company said that in the last four months, the platform’s been used to make more then 5,000 job offers.\n   Kaitlyn Knopp, the CEO who co-founded the company with Warren Lebovics (both pictured, right), came up for the idea for Pequity in much the same way that many innovations in the world of enterprise IT come to market: through her own first-hand experience.\n She spent a decade working in employment compensation in the Bay Area, with previous roles at Google, Instacart, and Cruise. In that time, she found the tools that many companies used were lacking and simply “clunky” when it came to compensation analysis.\n “The way the market has worked so far is that platforms had compensation as an element but not the focus,” she said. “It was the end of the tagline, the final part of a ‘CRM for candidates.’ But you still have to fill in all the gaps, you have to set the architecture the right way. And with compensation, you have to bake in your own analytics, which implies that you have to have some expertise.”\n Indeed, as with other aspects of enterprise software, she added that the very biggest tech companies sometimes worked on their own tools, but not only does that leave smaller or otherwise other-focused businesses out of having better calculation tools, but it also means that those tools are siloed and miss out on being shaped by a bigger picture of the world of work. “We wanted to take that process and own it.”\n The Pequity product essentially works by plugging into all of the other tools that an HR professional might be using — HRIS, ATS, and payroll products — to manage salaries across the whole of the organization in order to analyse and compare how compensation could look for existing and prospective employees. It combines a company’s own data and then compares it to data from the wider market, including typical industry ranges and market trends, to provide insights to HR teams.\n All of this means that HR teams are able to make more informed decisions, which is step number one in being more transparent and equitable, but is also something that Pequity is optimized to cover specifically in how it measures compensation across a team.\n And in line with that, there is another aspect of the compensation mindset that Knopp also wanted to address in a standalone product, and that is the idea of building a tool with a mission, one of providing a platform that can bring in data to make transparent and equitable decisions.\n “A lot of the comp tools that I’ve interacted with are reactive,” she said. “You may have to do, say, a pay equity test, you do your promotion and merit cycles, and then you find all these issues that you have to solve. We’re flagging those things proactively with our analytics, because we’re plugging into those systems, which will give you those alerts before the decisions need to be made.”\n As an added step in that direction, Knopp said that ultimately she believes the tool should be something that those outside of HR, such as managers and emploiyees themselves, should be able to access to better understand the logic of their own compensation and have more information going into any kind of negotiation.\n Ultimately, it will be interesting to see whether modernized products like Pequity, which are tackling old problems with a new approach and point of view, find traction in the wider market. If one purpose in HR is to address diversity and inclusion, and part of the problem has been that the tools are just not fit for that purpose, then it seems a no-brainer that we’ll see more organizations trying out new things to see if they can help them in their own race to secure talent.\n “Compensation reflects a company’s values, affects its ability to hire talent, and is the biggest expense on its P&amp;L. And yet, most comp teams run on spreadsheets and emails,” said Parker Barrile, Partner at Norwest, in a statement. “Pequity empowers comp teams to design and manage equitable compensation programs with modern software designed by comp professionals, for comp professionals.”", "posttime": "2021-06-23 20:37:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旨在,compensation", "title": "Pequity，旨在提供更公平的薪酬的补偿平台，提高了1900万美元 ", "title_en": "\n\t\t\t\tPequity, a compensation platform designed for more equitable pay, raises $19M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/pequity-a-compensation-platform-designed-for-more-equitable-pay-raises-19m/", "via": "", "real_tags": ["旨在"]}, {"category": "", "categoryclass": "", "imagename": "001edc646b15af01e97c68d8171ae871.jpg", "infoid": 1067688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于许多原因，这一轮是值得注意的。首先，即使是今天的标准也是一个大的系列。融资还标志着以前在其七年历史中引发了较低的较低的外部资金。较低的是初创世界上这些天的罕见：有利可图。基于硅谷的Accel历史悠久，营业盈利，抢夺公司，也为1Password，阿特拉斯人，高音乐，网络流，工友和伽利略（由SOFI获得）的相似之处。\n 事实上，伽利略创始人粘土威尔克斯将VC公司推出到Dan Snyder，下的创始人和首席执行官。除了有利可图之外，这两家公司还有一些共同的事情：在采取机构资本之前，他们都在举行多年，两者都有总部在硅谷外面。\n  “我们立即感兴趣，因为基于俄亥俄州的较低呼应，”John Locke的Accel Partner John Locke说，较低，并作为投资的一部分占据公司董事会的席位。 “就像伽利略一样，较低的将是全球最成功的投机公司之一。在全球范围内的非传统区域内建造的公司的组合和一个引导的公司提醒我们​​[其他]我们与大型系列合作的公司。“\n 据较低，还有其他未命名的参与者，但加权为投资的“大多数”提供。\n Snyder于2014年共同创立了更低，目标是为消费者制作房屋过程更简单。该公司随招待所推出，其零售品牌认为，斯奈德描述为“一种技术杠杆零售抵押贷款银行”，与房地产经纪人和建筑物等。 2018年，该公司推出了较低的网站，其直接消费者数字贷款品牌具有使其平台的使命是一个停机者可以在线上网，以保存家庭，获得或再融资抵押贷款并获得保险通过其市场。今年，它推出了带有储蓄账户的下移动应用程序。\n  多年来，据斯奈德称，下降数十亿美元在贷款中获得数十亿美元的贷款，并在2020年在2020年举行令人印象深刻的收入。\n “我们的历史可能是今天Fintech公司的一点非典型，”他告诉TechCrunch。 “我们有一个看法回到公司的开始，我们希望有利地运行它。这是我们的支柱之一，所以这就是我们所做的一切。此外，我们都在抵押贷款行业中长大，所以我们先看到了市场的大小，也是多么伤了，所以我们想改变它。“ \n在推出直接消费者数字贷款品牌时，该公司正在努力使房屋过程更加“数字，透明，更容易获得消费者访问”，斯奈德说。\n 与此同时，公司不想失去人类的触感。\n “我们试图以您在应用程序中可以获得的方式设计应用程序流程，但如果您愿意在任何时间点，请与某人交谈或聊天，我们可以使用，”斯奈德补充道。\n  据斯奈德表示，较低的典型客户是千禧一代，现在是渴望拥有他们的第一家家。\n “他们可能正在思考，”好吧，我现在可能住在一个公寓里，但在接下来的几年里，我会遇到某人和/或有一个孩子，我想解开家庭的投资，' “他告诉TechCrunch。 “我们会帮助他们在那里的旅程。”\n Lower的最近推出的新应用程序提供存款账户，它是被称为“Homefund”。息息的FDIC保存账户提供了0.75％的百分比产量，并旨在帮助消费者为家庭储存，以“奖励美元的美元兑换”，斯内德说。\n 较低的工程与超过35个主要的保险公司全国，包括全国，自由，互联网。它拥有超过1,600名员工，其中大约一半以下的家庭州为基础。这是2020年6月的大约650名员工。 \n展望未来，该公司计划添加更多服务，并具有“积极的路线图”，用于为其平台添加新功能。例如，今天，较低的销售主要是Fannie Mae和Freddie Mac。虽然它提供了大部分贷款，但与许多大型贷方一样，它使用了一个子公司。然而，这将改变2022年初，当较低的打算启动自己的本机服务平台时。\n 虽然公司打算继续赚取有利可图，但斯奈德说，他和他的联合创始人“思考时间现在正在获得分享”。\n “我们希望成为全球品牌，筹集资金并获得市场份额，”他补充道。 “我们将继续在产品上加倍加倍并建立我们的能力。我们是Fintech中最好的秘密，并计划与智能品牌，广告和赞助的改变。“\n  最后但并非最不重要的是，降低了公共市场作为其长期路线图的一部分。\n “最终，我们知道我们可以建立一个伟大的公共公司，”斯奈德告诉TechCrunch。 “我们现在是一家公共公司的规模，但我们将继续下来，我们将继续建设未来几年，然后我认为我们可以在一个地方强大的公共业务。“\n Accel的Locke指出，在美国，抵押贷款和家庭金融是最大的金融服务市场之一，主要由大型银行处理。\n “对于大多数消费者来说，通过这些银行抵押贷款继续成为一种过于复杂的，缓慢移动的过程，”洛克告诉TechCrunch。 “我们认为，通过向消费者提供巨大的移动经验，降低将获得现任银行的份额，与Monzo这样的公司在银行或Venmo中的付款或贸易共和国和股票交易中的罗马时代的方式相同。” ", "note_en": "This round is notable for a number of reasons. First off, it’s a large Series A even by  today’s standards . The financing also marks the previously bootstrapped Lower’s first external round of funding in its seven-year history. Lower is also something that is kind of rare these days in the startup world: profitable. Silicon Valley-based Accel has a history of backing profitable, bootstrapped companies, having also led large Series A rounds for the likes of 1Password, Atlassian, Qualtrics, Webflow, Tenable and Galileo (which went on to be acquired by SoFi).\n In fact, Galileo founder Clay Wilkes introduced the VC firm to Dan Snyder, Lower’s founder and CEO. The two companies have a few things in common besides being profitable: they were both bootstrapped for years before taking institutional capital and both have headquarters outside of Silicon Valley.\n  “We were immediately intrigued because Ohio-based Lower echoes both of these themes,” said Accel partner John Locke, who led the firm’s investment in Lower and is taking a seat on the company’s board as part of the investment. “Like Galileo, Lower will be one of the most successful bootstrapped fintech companies globally. The combination of a company built in a nontraditional region across the globe and a bootstrapped company reminds us of [other] companies we have partnered with for a large Series A.”\n There were other unnamed participants in the round, but Accel provided the “majority” of the investment, according to Lower.\n Snyder co-founded Lower in 2014 with the goal of making the homebuying process simpler for consumers. The company launched with Homeside, its retail brand that Snyder describes as “a tech-leveraged retail mortgage bank” that works with realtors and builders, among others. In 2018, the company launched the website for Lower, its direct-to-consumer digital lending brand with the mission of making its platform a one-stop shop where consumers can go online to save for a home, obtain or refinance a mortgage and get insurance through its marketplace. This year, it launched the Lower mobile app with a savings account.\n  Over the years, Lower has funded billions of dollars in loans and notched an impressive $300 million in revenue in 2020 after doubling revenue every year, according to Snyder.\n “Our history is maybe a little atypical of fintech companies today,” he told TechCrunch. “We’ve had a view going back to the start of the company that we wanted to run it profitably. That’s been one of our pillars, so that’s what we’ve done. Also, we all grew up in the mortgage industry, so we saw firsthand the size of the market, but also how broken it was, so we wanted to change it.”\n In launching the direct-to-consumer digital lending brand, the company was working to make the homebuying process more “ digital, transparent and easier for consumers to access,” Snyder said.\n At the same time, the company didn’t want to lose the human touch.\n “We tried to design the app flow in a way where you can get as far along as you can in the application but if you want, at any point in time, to talk or chat with someone, we’re available,” Snyder added.\n  Lower’s typical customer is the millennial and now Gen Z who’s aspiring to own their first home, according to Snyder.\n “They might be thinking, ‘OK, I might be living in an apartment now, but in the next few years I’m going to meet someone and/or have a child and I want to unlock the investment that is a home,’ ” he told TechCrunch. “And we’ll help them on that journey.”\n Lower’s recently launched new app offers a deposit account it’s dubbed “HomeFund.” The interest-bearing FDIC-insured deposit account offers a 0.75% Annual Percentage Yield and is designed to help consumers save for a home with a “dollar-for-dollar match in rewards” up to the first $1,000 saved, Snyder said.\n Lower works with more than 35 major insurance carriers nationally, including Nationwide, Liberty Mutual and Allstate. It has more than 1,600 employees, about half of which are based in Lower’s home state. That’s up from about 650 employees in June of 2020.\n Looking ahead, the company plans to add more services and has an “aggressive roadmap” for adding new features to its platform.  Today, for example, Lower sells primarily to Fannie Mae and Freddie Mac. And while it services the majority of its loans, like many large lenders, it uses a subservicer. That will change, however, in early 2022, when Lower intends to launch its own native servicing platform.\n And while the company intends to continue to run profitably, Snyder said he and his co-founders “think the time is now to gain share.”\n “We want to become a global brand, raise money and gain market share,” he added. “We’re going to continue to double down on product and build out our capabilities. We are the best-kept secret in fintech and plan to change that with smart branding, advertising and sponsorships.”\n  And last but not least, Lower is eyeing the public markets as part of its longer-term roadmap.\n “Ultimately, we know we can build a great public company,” Snyder told TechCrunch. “We’re of the scale to be a public company right now, but we’re going to keep our heads down and we’re going to keep building for the next few years and then I think we can be in a spot to be a strong public business.”\n Accel’s Locke points out  that in the U.S., mortgage and home finance are among the largest financial service markets, and they have primarily been handled by large banks.\n “For most consumers, getting a mortgage through these banks continues to be an overly complex, slow-moving process,” Locke told TechCrunch. “We believe by providing consumers a great mobile experience, Lower will gain share from incumbent banks, in the same way that companies like Monzo have in banking or Venmo in payments or Trade Republic and Robinhood in stock trading.”", "posttime": "2021-06-23 20:37:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "accel,led", "title": "在7年的第一个资金中，盈利金融技术下降筹集了100万美元的级联由Accel领导 ", "title_en": "\n\t\t\t\tIn its first funding in 7 years, profitable fintech Lower raises $100M Series A led by Accel\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/lower-raises-100m-series-a-from-accel/", "via": "", "real_tags": ["accel", "led"]}, {"category": "", "categoryclass": "", "imagename": "7db3de167e86ef7acc471d901324cd0a.jpg", "infoid": 1067687, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的宣传只有几周后的赛道上推出了它的新托管数据库平台，也称为被称为PlanetsCale。该公司以前提供了托管版Vitess，但是通过这项新服务，它进一步逐步，并提供它所谓的“开发人员第一个数据库”，它摘要摘要所有基础架构，以确保开发人员不会拥有考虑云区域，群集大小和其他细节。\n 事实上，PlanetsCale Ceo和联合创始人Jiten Vaidya对本早期产品的局限性非常开放。 “我们去年建造了什么是托管Vitess，这与今天的大量云提供商提供数据库没有什么不同，”他说。 “所以这种易用性并不是这种优雅，这些优雅都不是开发商想要和期望今天的最先进的经历，我们已经建立在我们的产品中。”\n  但几个月前，该公司带来了前Github VP的工程Sam Lambert担任其首席产品官。 Vaidya指出，Lambert将很多开发人员同情推广，并帮助它推出了这款新产品。\n “人们来找你，因为他们不是数据库专家，但他们有数据，他们有问题，”兰伯特说。 “而且太多的公司，特别是在数据库世界中，不要想到他们的用户的日常生活。他们不会考虑用户实际尝试的完整旅程，这是为客户提供价值。他们对自己留下了非常深刻的印象，用于存储和检索数据。就像是，是的，我们一直这样做。自60年代以来，我们一直这样做。我们现在可以做别的吗？“\n 该公司今天的用户包括Slack，Figma，GitHub和Square的喜欢，因此它显然为大量用户提供了价值。随着Lambert的注意，Planetscale旨在为他们提供一种简单易用的产品。 “只是因为它很简单易用，而且美丽，诚实 - 就像只是美丽，设计精心的工具 - 它并不意味着它的劣等。这并不意味着它缺少任何东西。他说，这意味着其他人错过了诗歌和额外的美丽元素，即你可以添加到基础设施产品中，“他说。\n PlanetsCale计划使用新的资金来扩展其团队，并加速其平台的采用。 Insight Partners董事总经理Nikhil Sachdev将加入该公司的董事会，该公司的董事总经理前导董事Praveen Akkiraju也作为董事会观察员加入。\n “PlanetsCale正在为无服务器时代的基于云的数据库为简单，性能和可扩展性设置新栏，”Sachdev说。 “数据库的开发人员体验对于太长而痛苦。 PlanetsCale正在破坏那个链条，解决与可扩展性和可靠性相关的长期存在，以极其优雅，典雅和有用的方式。“ ", "note_en": "Today’s announcement comes only a few weeks after PlanetScale launched its new hosted database platform, also dubbed PlanetScale. The company had previously offered a hosted version of Vitess, but with this new service, it is going a step further and offering what it calls a “developer-first database” that abstracts away all of the infrastructures to ensure that developers won’t have to think about cloud zones, cluster sizes and other details.\n Indeed, PlanetScale CEO and co-founder Jiten Vaidya was quite open about the limitations of this earlier product. “What we had built last year was pretty much hosted Vitess, which was no different than how a lot of cloud providers today give you databases,” he said. “So none of this ease of use, none of this elegance, none of these state-of-the-art experiences that the developers want and expect today, we had built into our product.”\n  But a few months ago, the company brought on former GitHub VP of Engineering  Sam Lambert as its Chief Product Officer. Vaidya noted that Lambert brought a lot of developer empathy to PlanetScale and helped it launch this new product.\n “People come to you because they’re not database experts, but they have data, they have problems,” Lambert said. “And too many companies, especially in the database world, do not think about the daily lives of their users like we do. They don’t think about the complete journey of what the user is actually trying to do, which is to provide value to their customers. They’re just very impressed with themselves for storing and retrieving data. And it’s like, yep, we’ve been doing that. We’ve been doing that since the 60s. Can we do something else now?”\n The company’s users today include the likes of Slack, Figma, GitHub and Square, so it’s clearly delivering value to a lot of users. As Lambert noted, PlanetScale aims to offer them a product that is simple and easy to use. “Just because it is simple and easy to use, and beautiful, honestly — like just beautiful, well-designed tooling — it doesn’t mean it’s inferior. It doesn’t mean it’s missing anything. It means the others are missing the poetry and the additional elements of beauty that you can add to infrastructure products,” he said.\n PlanetScale plans to use the new funding to scale its team globally and accelerate the adoption of its platform. Insight Partners Managing Director Nikhil Sachdev will join the company’s board, with the firm’s Managing Director Praveen Akkiraju also joining as a board observer.\n “PlanetScale is setting a new bar for simplicity, performance and scalability for cloud-based databases in the serverless era,” said Sachdev. “The developer experience for databases has been painful for too long. PlanetScale is breaking that chain, solving longstanding problems related to scalability and reliability in an extremely elegant, tasteful, and useful way.”", "posttime": "2021-06-23 20:36:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "database,数据库,产品", "title": "PlanetsCale为其数据库服务筹集了30万美元的B系列 ", "title_en": "\n\t\t\t\tPlanetScale raises $30M Series B for its database service\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/planetscale-raises-30m-series-b-for-its-database-service/", "via": "", "real_tags": ["database", "数据库", "产品"]}, {"category": "", "categoryclass": "", "imagename": "efa7efa928252b1db0781fba9af8f9ab.jpg", "infoid": 1067685, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为Vercel票据，该公司最近几个月出现了强劲增长，自10月2020年10月以来，其网络上的所有网站和应用程序都有流量。世界上最大的10,000个网站的一半现在使用Next.js。鉴于下一个框架的开源性质，并非所有这些用户都显然是Vercel客户，但其当前的支付客户包括Carhartt，GitHub，IBM，McDonald和优步的喜好。\n  “对我们来说，它一切都以前端开发人员开头，”Vercel Ceo Guillermo Rauch告诉我。 “我们的目标是创造和赋予那些开发人员 - 以及他们的团队 - 为他们的客户创造令人愉快的沉浸式网络体验。”\n 使用Vercel，RAUCH和他的团队拍摄了下一个.JS框架，然后建立了一个无服务器的平台，专门迎合此框架，允许开发人员专注于构建前端，而无需担心缩放和性能。\n RAUCH辩论的旧解决方案是孤立地建立的，云平台和无服务技术，将其留给开发人员部署和扩展其解决方案。虽然一些潜在的用户也可能是使用无头内容管理系统的内容，但Rauch认为，越来越多地认为，开发人员需要能够建立可以更深入的解决方案，这些解决方案比当今许多企业使用的现成解决方案更深入。\n RAUCH还指出，开发人员真的喜欢Vercel每次开发人员编辑代码时都会为网站前端生成预览URL的能力。 “所以所以，我们只是在代码审查中花费所有的时间，我们正在转移方程来花费时间审查或经历前端。这使得经验更加合作，“他说。 “所以现在，设计师，营销人员，它，首席执行官现在可以在这种建筑前端的合作中聚集在一起，说，”蓝色阴影不是蓝色的正确阴影。＆＃39;“\n “Vercel领导市场转型，我们通过它看到的大多数价值 - 在前端传送的Web和云应用程序开发中，最接近用户，在那里做出真正的经验，享受真正的经验，”创始人Geoff Lewis说并在基岩管理伙伴。 “我们非常热情地与Guillermo和无与伦比的团队密切合作，他组装出来推动这场革命，非常高兴能够联合这一轮。” ", "note_en": "As Vercel notes, the company saw strong growth in recent months, with traffic to all sites and apps on its network doubling since October 2020. About half of the world’s largest 10,000 websites now use Next.js . Given the open-source nature of the Next.js framework, not all of these users are obviously Vercel customers, but its current paying customers include the likes of Carhartt, Github, IBM, McDonald’s and Uber.\n  “For us, it all starts with a front-end developer,” Vercel CEO Guillermo Rauch told me. “Our goal is to create and empower those developers — and their teams — to create delightful, immersive web experiences for their customers.”\n With Vercel, Rauch and his team took the Next.js framework and then built a serverless platform that specifically caters to this framework and allows developers to focus on building their front ends without having to worry about scaling and performance.\n Older solutions, Rauch argues, were built in isolation from the cloud platforms and serverless technologies, leaving it up to the developers to deploy and scale their solutions. And while some potential users may also be content with using a headless content management system, Rauch argues that increasingly, developers need to be able to build solutions that can go deeper than the off-the-shelf solutions that many businesses use today.\n Rauch also noted that developers really like Vercel’s ability to generate a preview URL for a site’s front end every time a developer edits the code. “So instead of just spending all your time in code review, we’re shifting the equation to spending your time reviewing or experiencing your front end. That makes the experience a lot more collaborative,” he said. “So now, designers, marketers, IT, CEOs […] can now come together in this collaboration of building a front end and say, ‘that shade of blue is not the right shade of blue.&#39;”\n “Vercel is leading a market transition through which we are seeing the majority of value-add in web and cloud application development being delivered at the front end, closest to the user, where true experiences are made and enjoyed,” said Geoff Lewis, founder and managing partner at Bedrock. “We are extremely enthusiastic to work closely with Guillermo and the peerless team he has assembled to drive this revolution forward and are very pleased to have been able to co-lead this round.”", "posttime": "2021-06-23 20:29:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,开发,react,开发人员", "title": "Vercel，它开发了流行的开源Next.js React Framework，由Bedrock Capital达到1.1亿美元的估值培养了102米系列C LED ", "title_en": "Vercel, which develops the popular open-source Next.js React framework, raises $102M Series C led by Bedrock Capital at a $1.1B valuation", "transed": 1, "url": "https://techcrunch.com/2021/06/23/vercel-raises-102m-series-c-for-its-next-js-based-front-end-development-platform/", "via": "", "real_tags": ["开源", "开发", "react", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "9fe23b8ae301ebe4343cbc02d311047c.jpg", "infoid": 1067684, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，Apple越来越多地呼吁允许IOS和iPadoS平台的第三方应用商店，这将使称为“Sideloading”的过程 - 在源自官方App Store之外的设备上安装应用程序。\n   支持者争辩说Android允许Sideloading，因此Apple也应该。允许用户在没有Apple作为中间人的IPADS上安装应用程序，因为中间人将减轻对其应用勘探和费用的担忧，这是自13年前首次授权的第三方iPhone应用程序以来的持续戏剧的一部分。 Sideloading还将削弱Apple对App Store的控制金额为非法垄断的论据。\n 但是，苹果公司隐私专家的许多安全专家以及粉丝 - 找到了这种提案令人震惊。 Android允许SIDeloading允许Sideloading是真实的，但Sideloading是Google的移动操作系统如此徽章恶意软件的主要原因之一。坏演员知道，如果他们想要攻击Android设备，那么最简单的方法就是将其隐藏在伪装的应用程序中，例如，流行的防病毒应用程序甚至是Android系统更新。一旦应用程序安装在Android设备上，它就可以注入恶意软件有效载荷，例如Ransomware。\n 为了帮助公众更好地了解Apple对Sideloading的立场，该公司已发布其最新的隐私白皮书，专注于该主题。在论文的发布之前，我与Apple的用户隐私负责人，Erik Neuenschwander关于实践以及为什么从我们的谈话中撰写的苹果判断 - 仍然是强烈反对的。\n  作为经常撰写隐私和安全的人，我同意Apple对该主题的立场。有人认为苹果应该允许签名的应用说，它将为用户提供更多选择。然而，首选是Neuenschwander说该公司通过提供不允许缺席的平台提供用户。\n “在这种情况下，侧面加载实际上是消除的选择，”他说。 “希望直接访问在没有任何审查的情况下访问应用程序的用户今天在其他平台上侧行。 iOS平台是用户理解他们不能被欺骗或欺骗到一些黑暗的小巷或侧面道路的那个，即使他们没有打算，他们也会最终结束的侧面道路。“\n 如果你有朋友在恐慌中联系你，告诉你他们的手机被恶意软件击中，你会理解的是Neuenschwander的论点如何。如果没有iOS，用户就不会有一个移动操作系统平台，他们可以选择，不可能通过恶意缺陷来定位。在Apple的观点中，换句话说：你想要最好的隐私和安全吗？你的选择是ios。你想要sideloading吗？您的选择是Android。 \nNeuenschwander不会推测在Android平台上浮现多少恶意软件因缺陷而浮动，但独立的安全专家在Android设备上发现了一个惊人的恶意软件 - 高达IOS的15倍。攻击的主要载体之一？ SIDELOODED应用程序。\n 即使在应用商店的安全措施到位，恶意软件也会潜入iPhone。但Neuenschwander认为，如果Apple将iPhone开启到侧面，那么它的数量“显然会高得多”。为什么？因为现在有两个安全检查，可保护用户免受恶意应用程序。\n 第一个是Apple的开发人员策略和进程，它规范了应用程序可以且不能做的。 Apple可以检查开发人员是否关注这些策略，因为人类审核每个应用程序提交给App Store。并通过将应用程序上传到App Store的行为，该应用程序也扫描了所有已知的恶意软件，从而保护用户免受Nefarious应用程序的更多信息。\n  第二个安全检查是用户自己。由于Apple要求开发人员以普遍的方式向用户询问您可以访问此类功能作为iPhone的麦克风或摄像机之前，因此用户可以识别应用程序内是否正在进行中的某些内容。\n 但是，如果苹果允许通过第三方应用商店签名，但它无法运行那些在第一个重要安全检查的商店的应用程序上的人类和自动检查。它还无法验证Sideloaded应用程序是否要求用户在其常用的界限内访问系统服务的权限，这意味着欺骗用户更容易欺骗恶意应用程序对诸如其照片或消息的内容。\n “今天，我们有我们的技术防御，我们有我们的政策防御，然后我们仍然拥有用户自己的智慧，”Neuenschwander说，参考Apple的App Store进程。他争辩，侧面载会否定这些防御。\n  有些人可能会争辩说，Sideloading的缺点只会击中那些签名的应用程序。那些仍然选择只通过Apple的App Store下载应用程序的人是安全的吗？ \n但是，Neuenschwander指出（如本公司的白皮书），仅仅是缺陷的应用程序的存在，它会鼓励糟糕的演员通过试图引诱他们从非官方商店或网站下载他们的恶意的人来实现毫无戒心的用户。当你看到它时，你可能会娴熟，足够谨慎地知道假的应用商店，但是你的15岁的侄子或75岁的父亲？\n “甚至是打算的用户 - 他们有意识地认为自己只是要从App Store的应用程序下载应用程序，攻击者知道这一点，所以他们会试图说服他们正在下载应用程序的用户即使在App Store中，即使在发生这种情况下，Neuenschwander也是如此。 “真的，你必须非常创造性地思考，因为攻击者追求这么多用户在他们的设备上如此丰富的数据之后。因此，无论他们是否打算导航除Apple以外的应用商店，用户将被攻击。“\n  如果您认为声音很远，请让我向您介绍假谷歌播放商店。\n  尽管苹果公司坚持不懈地，侧载的应用程序和应用商店对于选择访问它们的用户以及没有的用户来说，必须指出的是，Apple并未完全反对缺席。事实上，Apple的最旧的平台允许它：麦斯科座。\n MacOS提供自己的App Store，但您不需要用它来下载应用程序。您也可以通过第三方商店或网站来这样做。那么为什么涉及到侧面加载时，Mac和iPhone之间的政策中的差异差异？\n  部分答案归结为数学。 Neuenschwander指出，世界上至少有10倍的iPhone，因为有MACS，这使得iPhone将更加诱人的目标对坏行为者。 iPhone也可能具有比平均Mac更敏感的用户数据，而iPhone通常与他们到达的任何地方都与用户一起使用。\n “这是你随身携带的设备，”Neuenschwander笔记。 “所以它知道你的位置。因此，有人可以攻击的人会得到关于你的生活模式。它有一个麦克风，因此这是一个可以在你身边的麦克风比你的Mac的麦克风更容易。所以那种敏感的数据[在iPhone上]更令攻击者。“ \n但那并非全部。 “Mac的使用模式 - 只是风格，人们如何使用那个平台 - 往往是他们得到一些他们用来做工作或他们的爱好的应用程序，然后它达到稳定状态，” Neuenschwander解释道。 “但我们所看到的是，包括iPhone，包括iPhone的移动平台是用户正在继续持续下载应用程序的平台。这使攻击者更多的机会进入并获得该用户。因此iOS边的威胁远远高于MAC方面的威胁。“\n  还应该注意到，在最近的史诗般的竞赛中，Apple试用，Apple的软件Cred Creacerighi表示，Mac上有一个不可接受的恶意软件，这一金额是“比ios要糟糕。”它可以理解，苹果不希望问题传播到iPhone。\n 如果Apple曾经允许SIDELOADINATING IOS和iPados应用程序，可能是因为它没有选择。亚利桑那州和北达科他州的拟议法律，旨在破坏其在这些国家的应用店垄断的垄断已经失败了。但该公司在联邦级别的立法者交叉队伍中仍然在立法者的十字准则中，并将放松其对其平台的控制的反垄断补救措施仍在桌面上。\n 尽管如此，我怀疑希望看到iOS支持的iPhone用户数量相对较小。设备安全和隐私是任何小工具的一些最重要的方面，以及苹果产品的巨大销售点。很难想象许多iPhone用户愿意为潜在的狡猾的侧载应用程序牺牲这一点。如果他们想牺牲Sideload的安全性，他们已经拥有了这个选择：他们可以获得一个Android手机。\n  至于Neuenschwander，他对Sideloading的争论归结为苹果 - 包括Tim Cook的每个人都在制作。 “我相信我们所建造的是什么以及现在提供用户的内容都是统一的，因为我们可以专注于那个较小的攻击表面和我们更强大的保护，以帮助保持用户安全，”Neuenschwander说。\n Apple的白皮书现在出现，可以在这里访问。对于任何思考士和安全和安全的人来说，这是一个有趣的，非本质阅读。 ", "note_en": "Recently there have been growing calls for Apple to allow third-party app stores for the iOS and iPadOS platforms, which would  enable a process known as “sideloading”—installing an app on a device that originates outside of the official App Store.\n   Proponents argue that Android allows sideloading, so Apple should too. Allowing users to install apps on their iPhones and iPads without Apple serving as an intermediary would alleviate concerns about its  App Store rejections and  fees, which have been part of an ongoing drama since the first authorized third-party iPhone apps debuted 13 years ago. Sideloading would also weaken arguments that Apple’s control of the App Store amounts to  an illegal monopoly.\n But many security experts—and fans of Apple’s privacy features—find such a proposal alarming. It’s true that Android allows sideloading, but  sideloading is one of the main reasons that Google’s mobile operating system is so riddled with malware. Bad actors know that if they want to attack an Android device, the easiest way to do so is to hide it in a sideloaded app disguised as, for example,  a popular anti-virus app or  even an Android system update. Once the app is installed on the Android device, it can then inject the malware payload,  such as ransomware.\n To help the public better understand Apple’s stance on sideloading, the company  has released its newest privacy white paper, which focuses on the topic. In advance of the paper’s release, I spoke to Apple’s head of user privacy, Erik Neuenschwander, about the practice and why Apple—judging from our conversation—remains vehemently opposed to it.\n  As someone who frequently writes about privacy and security, I agree with Apple’s position on the topic. Some who argue that Apple should allow sideloaded apps say that it would provide users with more choice. Yet choice is exactly what Neuenschwander says the company is offering users by providing a platform that does not allow sideloading.\n “Sideloading in this case is actually eliminating choice,” he says. “Users who want that direct access to applications without any kind of review have sideloading today on other platforms. The iOS platform is the one where users understand that they can’t be tricked or duped into some dark alley or side road where they’re going to end up with a sideloaded app, even if they didn’t intend to.”\n If you’ve ever had friends contact you in a panic, telling you their phone has been hit by malware, you’ll understand just how sound Neuenschwander’s argument is. Without iOS, users wouldn’t have a mobile operating system platform they could choose from that is impossible to be targeted by malicious sideloading. In Apple’s view, in other words: Do you want the best privacy and security possible? Your choice is iOS. Do you want sideloading? Your choice is Android.\n  Neuenschwander wouldn’t speculate on just how much malware is floating around on the Android platform due to sideloading, but independent security experts have found a staggering amount of malware on Android devices— up to 15 times more than iOS. One of the main vectors of attack?  Sideloaded apps.\n Even with the App Store’s security measures in place, malware  does sneak onto iPhones. But Neuenschwander contends that its quantity “would be obviously much higher” if Apple opened the iPhone to sideloading. Why? Because right now there are two security checks that protect users from malicious apps.\n The first is Apple’s developer policies and processes, which regulate what an app can and cannot do. Apple can check whether a developer is following these policies, because a human reviews every app submitted to the App Store. And by the very act of uploading an app to the App Store, that app is also scanned for all known malware, protecting users from nefarious apps even more.\n  The second security check is the users themselves. Because Apple requires developers to ask the user for permission in a universal way before it can access such features as an iPhone’s microphone or camera, a user can identify if something shady is going on inside the app.\n But if Apple were to allow sideloading via third-party app stores, it couldn’t run those human and automated checks on apps posted to those stores—negating that first important security check. It also couldn’t verify that sideloaded apps are asking users for permission to access system services within the bounds they are used to, which means it would be easier to fool a user into granting a malicious app access to content such as their photos or messages.\n “Today, we have our technical defenses, we have our policy defenses, and then we still have the user’s own smarts,” Neuenschwander says, referring to Apple’s App Store processes. Sideloading would negate those defenses, he contends.\n  Some may argue that the drawbacks of sideloading would hit only those who sideload apps. Wouldn’t those who still choose to download apps only through Apple’s App Store be safe?\n But Neuenschwander points out (as does the company’s white paper) that the mere existence of sideloaded apps would encourage bad actors to target unsuspecting users more by trying to lure them to download their malicious ones from unofficial stores or sites. You might be savvy and cautious enough to know a fake app store when you see it, but is your 15-year-old nephew or 75-year-old father?\n “Even users who intend—they’ve consciously thought themselves that they are only going to download apps from the App Store—well, the attackers know this, so they’re going to try to convince that user that they’re downloading an app from the App Store even when that’s not happening,” Neuenschwander says. “Really, you have to think very creatively, very expansively as an attacker would trying to go after so many users with such rich data on their device. And so users will be attacked regardless of whether or not they intend to navigate app stores other than Apple’s.”\n  If you think that sounds far-fetched, let me introduce you to  the fake Google Play Store.\n  Despite Apple’s insistence that sideloaded apps and app stores would be bad for both users who choose to access them and users who don’t, it must be pointed out that Apple isn’t against sideloading altogether. As a matter of fact, Apple’s oldest platform allows it: MacOS.\n MacOS offers an App Store of its own, but you don’t need to use it to download apps. You can also do so via third-party stores or websites. So why the discrepancy in policy between the Mac and iPhone when it comes to sideloading?\n  Part of the answer comes down to math. Neuenschwander notes that there are at least 10 times as many iPhones in the world as there are Macs, which makes the iPhone a much more enticing target to bad actors. An iPhone also likely carries much more sensitive user data than the average Mac does, and the iPhone is generally with a user everywhere they go.\n “It’s the device you carry around with you,” Neuenschwander notes. “So it knows your location. And therefore somebody who could attack that would get pattern-of-life details about you. It has a microphone, and therefore that’s a microphone that could be around you much more than your Mac’s microphone is likely to be. So the kind of sensitive data [on the iPhone] is more enticing to an attacker.”\n But that’s not all. “The pattern of use of the Mac—just the style, how people use that platform—tends to be that they get a few applications that they use to do their job or their hobby, and then it kind of reaches a steady state,” Neuenschwander explains. “But what we’ve all seen is that mobile platforms, including iPhone, are ones where users are downloading apps on a continuing basis. And that gives an attacker more opportunities to get in and get at that user. So the threat on the iOS side is much higher than the threat on the Mac side.”\n  It should also be noted that at the recent  Epic Games v. Apple trial, Apple’s software chief Craig Federighi  said there was an unacceptable level of malware on the Mac, an amount “that is much worse than iOS.” It’s understandable then that Apple doesn’t want the problem to propagate over to the iPhone.\n If Apple ever does allow sideloading of iOS and iPadOS apps, it might be because it has no choice. Proposed laws in  Arizona and  North Dakota that aimed to break its App Store monopoly in those states have apparently failed. But the company  remains in legislators’ crosshairs at the federal level, and antitrust remedies that would loosen its control over its platforms remain on the table.\n Still, I suspect the number of iPhone users who would like to see sideloading supported on iOS is relatively small. Device security and privacy are some of the most important aspects of any gadget, and a huge selling point for Apple products. It’s hard to imagine that many iPhone users would be willing to sacrifice that for potentially dodgy sideloaded apps. And if they  want to sacrifice security for sideloading, they  already have that choice: They can get an Android phone.\n  As for Neuenschwander, his argument against sideloading boils down to the case that everyone at Apple— including Tim Cook—has been making all along. “I believe that what we’ve built and what we’re offering users now is uniformly better, because we can focus in on that smaller attack surface and our stronger protections to help keep users safe,” Neuenschwander says.\n Apple’s white paper is out now  and can be accessed here. It’s an interesting, nontechnical read for anyone pondering the pros and cons of sideloading and security.", "posttime": "2021-06-23 20:28:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,表示,policy,应用程序", "title": "Apple的用户隐私负责人表示，Sideloading实际上是“消除选择”，并会否定技术和政策抗辩 ", "title_en": "Apple's head of user privacy says sideloading is actually “eliminating choice” and would negate technical and policy defenses", "transed": 1, "url": "https://www.fastcompany.com/90649203/apple-iphone-sideloading-safety-apps-tech", "via": "", "real_tags": ["apple", "表示", "policy", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067683, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我拨打了56874次来电探索电话网络。这是我发现的。\n  刚开始在2000年代初从旧电话目录融入时，这个问题出现了。\n 至少有普通的订阅者，商业客户支持线，语音邮件和传真机.Subscribers和客户支持线对ME是特别感兴趣的。我对让来电者与他们交互的自动化系统更感兴趣..voice邮件和传真机适合这个定义。但是还有其他东西吗？\n 随着电话网络在芬兰预测互联网超过100年，它可以非常古老且遮掩。在互联网上获得普及，这些系统用于提供我们今天在互联网上使用的类似服务。它不是有趣的是探索一下，看看这一天幸存了什么？因为没有像电话网络的Shodan的搜索引擎，我需要自己做探索。这篇文章描述了我的探索努力。\n 要探索，我使用了Wornialing.Wordialing是一种用计算机来电呼叫电话号码列表的技术，用于使用旧的使用者使用的计算机来探索电信网络，如目前使用的端口扫描探索互联网。\n 我用手柄来称之为一堆数字并记录了在保持安静的同时收到的前60秒。这个产生的呼叫记录我可以分析更多地了解电话网络中的系统。对于我的知识，没有人发表的结果他们之前的手提努力。特别是关于芬兰数量的芬兰数空间或最近的2021年。\n 我是如何避免在半夜用幽灵呼唤的羞辱人们 \n在接收端时，手柄会导致幽灵呼叫。你得到一个电话，你拿起了一个电话，但是来电者仍然是沉默的。一段时间后，呼叫者挂断了。这个来电可以感到威胁到某个人。另外还有什么在夜间中旬叫醒，后来你了解到你在电话上所说的一切都被录制了，与第三方分享并发表了？我会生气。因此，我采取了行动，尽量减少对业主造成的任何伤害电话号码打电话。\n 语音本身就是个人信息。人们也可能透露有关他们不想被共享或发布的手机的信息。避免违反人的隐私，我做了以下情况：\n 确保任何私人的录音都没有在欧盟以外的最终，由第三方保存，或用于训练机器学习模型\n 为避免共同调用人们或泛滥的紧急服务，我选择普通订阅者或紧急线路通常不使用的数字空间。我也选择隐藏我正在调用的号码（在接收者结束时显示未知数字）希望人们不会接听电话。\n 我本可以通过录制每个呼叫来进一步最大限度地减少个人信息收集，以便更短的时间。然而，这将使录音难以对其进行分类并在另一端识别服务。60秒录制被认为是最佳的足以让呼叫连接，并且对于任何录音来发挥足够长的录音来理解它们。\n 尽管我努力不骚扰私人，但我在夜间中至少醒来了3人。这是他们在回答或明显睡觉时宣布的时候判断。\n 由于速度非常适度的速度完成，我认为它不对服务提供商的带宽有害。 \n由于我的房子里没有铜普通的老电话服务（锅）线，我不得不寻找Wornial.i发现了一个现代化的Workialer Warvox，它使用VoIP来调用.I决定使用它。\n 工作，Warvox需要VoIP中继.VoIP中继是一种作为IP网络与公共交换电话网络（PSTN）之间的网关的服务。芬兰有几个VoIP集群服务，但它们只为商业客户，或者只有偶尔的偶尔的工王昂贵。我也假设他们不会满意的手提。外国Voip中断服务对于警告芬兰电话号码昂贵。\n 在学习VoIP业务中的非法终止之后，我了解到有设备，如VoIP GSM网关，可用于设置自己的VoIP主干。这个设备有可能更改IMSI号码.VoIP GSM网关通过GSM网络充当IP网络和PSTN网络之间的桥梁。\n 通过内部SIM卡，它们可以像手机一样连接到PSTN网络，允许您制作和接听电话。IP网络，它们提供一个接口，例如SIP，可用于以编程方式制作和接听电话。\n 我买了最便宜的VoIP GSM网关，它在IP网络上提供SIP接口.warvox说话IAx2，而不是SIP，所以我必须在两个协议之间配置星号作为代理。\n 要连接到PSTN网络，我购买了5欧元的最便宜的预付费SIM。如果服务提供商不喜欢我的行为，他们可以简单地阻止这个SIM卡。\n   芬兰运输和通信机构（Traficom）在其网站上发布有关电话网络编号的决定。我使用了芬兰的E164编号计划作为选择目标电话号码来调用的起点。这份文件从2019年初指定了不同的空格，并描述了他们的不同空间目的高水平。 \n没有私人（我不想惹恼和吓唬人们在半夜用鬼呼叫）\n 最终，在芬兰的R164编号计划上的免费电话空间（使用“非地理编号 - 全国范围的服务号码（Freephone）”）被确定为最佳候选人。订户在此空间中的数字支付更高的费用以覆盖呼叫者的成本。本空间中的数字不需要呼叫，因此它适合第一个要求。\n 我想到了更高的费用将至少保持私人的数量，因为你不会指望私人要支付更高的费用，以便自由地调用它们。因此，它假设适合第二个要求。\n 自由手机空间中的系统数量很难预测。在该空间中的系统将是有意义的，以集中使用它们的成本。\n 在编号计划中，还有一个用于机器到机器通信的空间，听起来它只包含机器。不幸的是，该空间是如此庞大（11位数字），很难找到它中使用的数字。我最初选择这个空间，但在没有一个答案的情况下调用超过10 000号码后放弃了。\n  购买的VoIP GSM网关仅适用于单个SIM卡，它只支持单线。因此我只能一次性拨打一次电话。随机地对属于自由手机空间的数字进行调用。\n Warvox在每个电话上都花了60秒，无论是回答还是没有。这导致了1个电话/分钟的速度。56874呼叫，这意味着大约40天致电日夜。 \n连接呼叫所需的时间和某人接收所需的时间从60秒中扣除。这意味着录像仍然短于60秒。\n 我配置了VoIP GSM网关不要发送来电显示，所以人们会拿起更少的人，没有人会给我回电话。\n   在运行Warvox之后，我留下了包含1724个回答的Calls.warvox的录制的音频文件，自动标识调制解调器和传真机，为所有录音提供信号图。信号图形可用于按照相似性对录制进行排序，但我找到了这一点对分类和识别录音的糟糕。\n 为避免聆听所有录音，使用Google云语音到文本来传输录制，然后使用转录到具有相同消息的呼叫记录。这将呼叫数量减少到300左右的呼叫次数减少到300左右的呼叫数量。可忍受的数字。\n 然后，我手动收听不同的录音并根据下图分类：\n  在该图中，探讨呼叫被分类，每个分类都标记为不乐趣或有趣。有趣的是让来电者以某种方式与服务交互的答案，或者可能会让，如在音乐和未知系统的情况下.How许多录音每个分类都包含在图中可见。\n 由人类回答的所有电话都是企业或私人。我通过非正式的答复电话公认的私人个人。 \n当仅静音或回铃时，不可能确定在线时究竟存在什么。录像包含回铃的事实表示接收端上有一个PBX，这会拾取然后尝试调用扩展名。\n 一台机器回答的所有录音都是人类声音，传真机，音乐或未知（机器）的录音。音乐包含包含整个录制音乐的录制。未知（机器）包含包含机电声音的呼叫的录制。\n 人类声音的录音是公告宣布的东西（如不使用的数字）或者要求输入。要求输入的值为测试号码，语音邮件，电话会议服务或无法识别，因此未知（等待输入） ）。\n 总共只有3％的呼叫得到回答。其中69％被确定为有趣。只有2％的所有电话都有一个有趣的答案。\n  作为等待投入的大多数有趣的记录是未知的，我决定进一步对它们进行分类。通过相同的录制内容进行分类。类别内部的录音称为变型。基于此分类，有74个独特的有趣答案。\n 等待呼叫者输入的未知记录类别包含16种不同的变体。有2种不同的测试数变体。语音邮件类别包含23个不同的变体，电话会议类别中有24种不同的变体。所有传真机听起来与我的相同耳朵，虽然我的手柄设置有7个不同的歌曲。最后，两个未知的机器都听起来与我相同。\n   我假设所有有趣的记录除了传真机和未知机器外，都是由私有分支交流（PBXS）提供的服务.PBXS是通常由在多个用户之间进行呼叫的业务通常使用的电话系统，并且可以提供语音邮件等额外服务电话会议。 \n从未知（等待输入）的系统有大量答案，等待输入的系统在他们提供的服务中没有提示。它们的Part使用拨号盘询问PIN码或菜单选项，其他用于语音命令。\n 要求PIN的人可以是例如语音邮件盒子或电话会议服务..他们也可以对遥控的PBX的身份验证？唯一可以找到某人或试图蛮力代码的唯一方法。然而非法的。\n  寻求语音命令的人是僵尸。是一个芬兰语和一个英语机组。他们可以通过与他们进行互动进一步调查。\n   前者宣布它是一个ICS测试平台，并进行DTMF和传真测试。后一项测试服务似乎属于DTMF测试，CL回读，回声测试和SMS菜单。 。\n 仍然使用语音邮件。录制的部分是企业语音邮件要求客户反馈或联系方式。其余的是普通的，只需在哔哔声后询问消息。\n TelecoCofercing是一个受到公认的有趣记录中提供的最受欢迎的服务。最多似乎是由企业提供的。电话会议服务的确切用例并未透露。他们可以成为内部或针对外部用户的公司。\n  11个呼叫只有音乐回答。音乐可以指示某些东西，例如在某些服务中排队。所有音乐变体除了一个像通用电梯音乐一样，可能是PBX中的默认保持音乐。 \n一些未知的机器相同地回答了两个呼叫。它是不可能识别他们来自录制的何种机器。他们声音机电。\n  有一个响应存在于1074年回答的呼叫（占所有有趣答案的91％），并等待呼叫者自身互动。“Tervetuloa Palveluun”（欢迎来服务），然后重复“Anna Tunnusluku”。 （请给出访问代码）。机器没有任何暗示它的任何服务。\n 我联系了芬兰电信公司ELISA，希望他们能够识别这项服务。这篇帖子一旦我得到答案就会更新。\n  2个未知的机器声音机电。这些神秘机器听起来像evan门铃的东西的东西。我联系了Evan，希望他能够识别机器并将更新这篇文章，以防他这样做。\n   在我的手柄设置上播放了同样的录音，在两个不同的数字上。我非常惊讶地听到关于世界末日和Zombie Opocalypse在收听录音时的奇怪消息。\n 谷歌唱的数字或录音上的句子没有告诉我这是什么。录音听起来像Captchas.note我没有触摸音调！\n  Clevercrossing的枫木确认消息。其中6个。这可能是什么？什么是什么？ \n英语言语机器人不理解沉默，并将升级我的电话：\n      根据我的结果，有私人和商业电话，传真机，PBX和未识别的系统。PBXS例如作为电话会议系统，测试号码和语音邮件。有些PBX也可能还有其他目的，但这项研究不是足以找出什么。\n 我无法识别的系统，例如未知的机器和未知的PBX服务，可能会出现意外。因此，如果您知道他们是什么，请与我联系！您可以找到录制的链接这篇文章的结尾。\n 我无法完全回答原始问题，因为数字空间选择窄，样本尺寸相对较小。因此，练习更好地用于2021年的芬兰自由手机号空间中的哪种系统。\n 我只拨打了数字并被动地听了60秒。尝试以某种方式尝试与发现的服务进行交互并看看它们是如何反应的。\n 另一个想法将是具有相同方法的状况的其他电话号码空间.E164编号计划指出，长度5位数的电话号码仍用于旧的分配。因此，它是一个有希望的目标，可以发现旧服务。 ，这个数字空间足够小以在合理的时间内致电。但是，此范围可能包含充电溢价率的服务号码。\n  此处提供所有原始录制，标记在分拣图中，除语音邮件外，可以在此处提供。 \n语音邮件未公布，因为它们的一部分包含所有者自己或所有者的号码正在录制录制。 ", "note_en": "I made 56874 calls to explore the telephone network. Here’s what I found.\n  This question appeared to me a while ago when leafing through an old telephone directory from the early 2000s.\n There are at least ordinary subscribers, business customer support lines, voice mails, and fax machines.Subscribers and customer support lines are not of special interest to me.I am more interested in automated systems that let the caller interact with them somehow.Voice mails and fax machines fit this definition.But is there something else as well?\n As the telephone network predates the Internet in Finland by over 100 years, the systems in it can be very old and obscure.Before the Internet gained popularity, these systems were used to provide similar services we use on the internet today.Would it not be interesting to explore a bit and see what has survived to this day?As there are no Shodan-like search engines for the telephone network, I needed to do the exploration myself.This post describes my exploration efforts.\n To explore, I used wardialing.Wardialing is a technique to call a list of telephone numbers automatically using a computer.Hackers of old used wardialing to explore the telephone network much like port-scanning is used today to explore the Internet.\n I used wardialing to call a bunch of numbers and recorded the first 60 seconds of audio received while staying quiet myself.This produced call recordings I could analyze to learn more about systems in the telephone network.To my knowledge, nobody has published the results of their wardialing efforts before.Especially about wardialing Finnish number-spaces or as recent as 2021.\n How I tried to avoid scaring people with ghost calls in the middle of the night\n On the receiving end, wardialing causes a ghost call.You get a call, which you pick up, but the caller remains silent.After a while, the caller hangs up.This alone can feel threatening to some people.What if additionally you were woken up by the call in the middle of the night and later you learned that everything you said on phone was recorded, shared with third parties, and published?I would be angry.Therefore, I took action to minimize any harm caused to the owners of phone numbers called.\n Voice is personal information in itself.People may also disclose information on the phone they do not want to be shared or published.To avoid violating people’s privacy, I did the following:\n Ensured that any recording of private individuals did not end up outside the EU, being saved by third parties, or used to train machine learning models\n To avoid calling people altogether or flooding emergency services, I chose to call a number space that is typically not used by ordinary subscribers or emergency lines.I also chose to hide the number I was calling from (displays unknown number at the receiver’s end) in hopes that people would not pick up my calls.\n I could have further minimized the personal information collection by recording each call for a shorter amount of time.This however would have made it harder to classify the recordings and recognize the service at the other end.The 60-second recording was considered optimal as it is enough for the call to be connected and for any recordings to play long enough to make sense of them.\n Despite my efforts to not harass private individuals, I woke at least 3 persons in the middle of the night.This was judged by their announcement of the time when answering or apparent sleepiness.My apologies to them!\n As wardialing was done at a very modest speed, I considered it to not be harmful to the bandwidth of the service providers.\n  Since I have no copper Plain Old Telephone Service (POTS) line in my house, I had to look for other ways to wardial.I discovered a modern wardialer,  WarVOX, that uses VoIP for calling.I decided to use it.\n To work, WarVOX requires a VoIP trunk.VoIP trunk is a service that acts as a gateway between IP network and the Public Switched Telephone Network (PSTN).There are a few VoIP trunking services in Finland, but they are either for business customers only, or expensive for only occasional wardialing.I also assume they would not be happy with wardialing.Foreign VoIP trunking services are expensive for wardialing Finnish phone numbers.\n After learning about illegal termination in the VoIP business, I learned that there is equipment, such as VoIP GSM gateways, that can be used to set up your own VoIP trunk.Curiously, this equipment comes with the possibility to change the IMSI number.VoIP GSM gateways act as bridges between IP network and the PSTN network through the GSM network.\n With SIM card(s) inside, they connect to the PSTN network like your mobile phone does, allowing you to make and receive calls.On the IP network, they provide an interface, such as SIP, which can be used to programmatically make and receive calls.\n I bought the cheapest VoIP GSM gateway, which provides a SIP interface on the IP network.WarVOX speaks IAX2, not SIP, so I had to configure Asterisk as a proxy between the two protocols.\n To connect to the PSTN network, I bought the cheapest prepaid SIM with a 5 EUR credit.If the service provider does not like my actions, they can simply block this SIM card.\n   Finnish Transport and Communications Agency (Traficom) publishes  decisions regarding telephone network numberings on their website.I used the  Finland’s E164 numbering plan as a starting point for choosing target phone numbers to call.This document from early 2019 specifies the different number spaces and describes their purpose on a high level.\n  No private individuals (I did not want to annoy and scare people with ghost calls in the middle of the night)\n In the end, the freephone space (usage “Non-geographic number - Nationwide service numbers (freephone)” on Finland’s R164 numbering plan) was determined to be the best candidate.The subscriber pays a higher fee for the numbers in this space to cover the costs of the callers.Thus the numbers in this space cost nothing to call so it fits the first requirement.\n I imagine the higher fee would keep the number of private individuals at a minimum, as you would not expect private individuals to pay higher fees so that they can be called for free.Therefore it hypothetically fits the second requirement.\n The number of systems in the freephone space is hard to predict.Having systems in this space would make sense to centralize the costs of using them.\n In the numbering plan, there is also a space for Machine-to-Machine communication that sounds like it contains only machines.Unfortunately, the space is so huge (11 digits) that it is very hard to find numbers that are in use in it.I initially chose this space but gave up after calling over 10 000 numbers without a single answer.\n  The bought VoIP GSM Gateway fits only a single SIM card, and it only supports a single line.Therefore I could only make a single call at a time.The calls were made randomly to numbers belonging to the freephone space.\n WarVOX spent 60 seconds on every call, whether it was answered or not.This resulted in a wardialing speed of 1 call/minute.For 56874 calls, this means roughly 40 days calling day and night.\n The time required to connect the call and the time it takes for someone to pick up is deducted from the 60 seconds.This means that the recordings are all shorter than 60 seconds.\n I configured the VoIP GSM Gateway to not send Caller ID, so fewer people would pick up and nobody would call me back.\n   After running WarVOX, I was left with audio files containing recordings of 1724 answered calls.WarVOX identifies Modems and Fax machines automatically and provides signal graphs for all recordings.The signal graphs can be used to sort the recordings by similarity, but I found this to be poor for classifying and identifying the recordings.\n To avoid listening to all recordings myself, used Google Cloud Speech-to-Text to transcribe the recordings, and then used the transcriptions to aside the call recordings that have the same message.This reduced the number of calls to listen manually to around 300, a bearable number.\n I then manually listened to the different recordings and classified them according to the following diagram:\n  In the diagram, prospect calls are classified and each classification is marked either not interesting or interesting.The interesting ones are the answers that let the caller interact with the service somehow, or may let, as in the case of music and unknown systems.How many recordings each classification contains is visible in the diagram.\n All calls answered by a human were either  businesses or  private individuals.I recognized private individuals from businesses by the informal style of answering the phone.\n It is not possible to determine what exactly there are at the other end when there is only  silence or  ringback on the wire.The fact that the recordings contain ringback indicates though that there is a PBX on the receiving end, which picks up and then tries calling an extension.\n All recordings that were answered by a machine were recordings of human voice,  fax machines, music, or unknown (machine). Music contains recordings that contain music for the whole recording. Unknown (machine) contains recordings of calls that contain electromechanical sound.\n Recordings of human voice were either  announcements that announced something (such as number not in use) or asked for input.Recordings asking for input were either  test numbers,  voice mails,  teleconferencing services or they could not be identified, thus  unknown (waiting for input).\n In total, only 3% of calls were answered.Out of these, 69% were identified as interesting.Thus only 2% of all calls got an interesting answer.\n  As the large majority of interesting recordings that wait for input were unknown, I decided to classify them further.The classification was done by identical recording content.Different recordings inside categories are called variants.Based on this classification, there are 74 unique interesting answers.\n The category of unknown recordings that wait for caller input contained 16 different variants.There were 2 different test number variants.The voice mail category contained 23 different variants and there were 24 different variants in the teleconference category.All fax machines sound the same to my ears, while there were 7 different songs played at my wardialing setup.Finally, both unknown machines sounded identical to me.\n   I hypothesize that all interesting recordings, except fax machines and unknown machines, are services offered by Private Branch Exchanges (PBXs).PBXs are telephone systems usually used by businesses that switch calls between multiple users and which can offer additional services such as voice mail and teleconferencing.\n There was a large number of answers from  Unknown (waiting for input), systems waiting for input that did not hint at what service they provide.Part of them ask for a PIN code or menu option using a dial-pad, others for voice commands.\n The ones asking for PIN could be for example voicemail boxes or teleconferencing services.Maybe they could be authentications to remote-controlled PBXs too?The only ways to find out would be to ask someone or trying to brute force the codes.Brute forcing is however illegal.\n  The ones asking for voice commands were bots.There was one Finnish and one English bot.They could be investigated further by interacting with them.\n   The former announces that it is an ICS test platform and proceeds to offer DTMF and FAX testing.The latter test service seems to belong to Twilio, an American communication platform provider.It offers DTMF testing, CL readback, echo test, and an SMS menu.\n Voice mail is still used.Part of the recordings were business voice mails asking for customer feedback or contact details.The rest were ordinary ones simply asking for messages after the beep.\n Teleconferencing was a popular service offered in among the recognized interesting recordings.Most of them seemed to be offered by businesses.The exact use cases of the teleconferencing services were not revealed.They could be company internal or aimed at external users.\n  11 Calls were answered with only  music.The music could indicate something, such as being in queue for some service.All music variants except for one sounded like generic elevator music that could be the default hold music in PBXs.\n  Two calls were answered identically by some  unknown machine.It was not possible to identify what kind of machines they are from the recording alone.They sound electromechanical.\n  There was a single response that was present in 1074 answered calls (91% of all interesting answers) and that waits for the caller to interact with itself.It says “Tervetuloa palveluun” (Welcome to the service) followed by repeating “Anna tunnusluku” (Please give access code).The machine does not give any hint of what kind of service it is.\n I contacted Finnish telecommunications company Elisa in hopes they could identify this service.This post will be updated once I get an answer.\n  2 unknown machines sound electromechanical.These mystery machines sound like something out of  Evan Doorbell’s tapes.I contacted Evan in hopes he will recognize the machines and will update this post in case he does.\n   This same recording was played at my wardialing setup on two different numbers.I was very surprised to hear this bizarre message about the end of the world and a zombie apocalypse when listening to the recordings.\n Googling the numbers or the sentences on the recording did not tell me what this is.The recordings sound like captchas.Note that I pressed no touch tones!\n  Maple confirmation message for Clevercrossing.There were 6 of these.What could this be?A confirmation message for what?\n   English speech bot that does not understand silence and is going to escalate my call:\n      Based on my results, there are private and business telephones, fax machines, PBXs, and unidentified systems.The PBXs serve for example as teleconferencing systems, test numbers, and voice mails.Some PBXs may also have other purposes, but this research was not enough to find out what.\n The systems I was not able to identify, such as the unknown machines and the unknown PBX services, could turn out to be something unexpected.Therefore if you know what they are, please contact me!You can find a link to the recordings at the end of this post.\n I cannot fully answer the original question, because of the narrow number space selection and relatively small sample size.My exercise thus serves better as a peek into what kind of systems there are in the Finnish freephone number space in 2021.\n I only called the numbers and passively listened for 60 seconds.It would be interesting to attempt interacting with the discovered services somehow and see how they react.\n Another idea would be to wardial other phone number spaces with the same methodology.The E164 numbering plan states that phone numbers of length 5 digits are still in use for older assignments.Therefore, it is a promising target to discover older services.As a bonus, this number space is sufficiently small to call through in a reasonable time.However, this range may contain service numbers that charge premium rates.\n  All raw recordings marked interesting in the sorting figure, except voice mail, are available  here.\n Voice mails are not published as part of them contain a recording of the owners themselves or the owner’s number is being read by the recording.", "posttime": "2021-06-23 20:28:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "来电,explore,呼叫", "title": "我拨打了56874次来电探索电话网络。 这是我发现的 ", "title_en": "I made 56874 calls to explore the telephone network. Here’s what I found", "transed": 1, "url": "https://shufflingbytes.com/posts/wardialing-finnish-freephones/", "via": "", "real_tags": ["来电", "explore", "呼叫"]}]