[{"category": "", "categoryclass": "", "imagename": "feb77a74b32b9dc52535233a49627bda.jpg", "infoid": 1066834, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "投资银行摩根斯坦利的负责人正在采取硬水平的方法，将基于美国的员工送回办公室，称他几乎所有公司的工人都会通过劳动节返回公司总部。 ", "note_en": "The head of investment bank Morgan Stanley is taking a hardline approach to bringing U.S.-based employees back to the office, saying he expects nearly all of the firm's workers to return to the company's headquarters by Labor Day.", "posttime": "2021-06-19 12:38:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "首席,stanley,劳动节", "title": "摩根士丹利首席执行官如果他们想要WFH，他们会面对付费削减 ", "title_en": "Morgan Stanley CEO tells employees if they want to WFH they will face pay cuts", "transed": 1, "url": "https://news.yahoo.com/morgan-stanley-ceo-tells-employees-172225151.html", "via": "", "real_tags": ["首席", "stanley", "劳动节"]}, {"category": "", "categoryclass": "", "imagename": "5cdb875933773b35c143b7dd3e7f0143.jpeg", "infoid": 1066833, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "飞行意大利面条怪物的教堂将留在讽刺的领域之后，经过正式认可的试图被南澳大利亚法律权威拒绝了据称的宗教只不过是A＆＃34;欺骗和＃34;\n 偏离运动的坚持发起了法律竞标，以确保其法律地位作为纳入的实体\n  SA＆＃39;民事和行政法庭拒绝了竞标，将教会描述为A＆＃34; Sham＆＃34;和一个＆＃34;模仿＆＃34;\n 阿德莱德女人坦尼亚沃特金斯，一个自我描述的＆＃34;队长＆＃34;教会和依靠其信条的＆＃34;帕特一手法人主义＆＃34;已经反复尝试确保赤裸行动官方地位作为纳入协会。\n 在最新尝试被公司事务委员会被淘汰后，沃特金斯女士寻求对该决定的审查，随后提交南澳大利亚民事和行政法庭（SACAT）。\n 法庭从委员会和沃特金斯女士听取了证据，他争辩说，飞行意大利面怪物的教会是为A＆＃34的;宗教，教育，慈善或仁慈的目的＆＃34;因此，符合南澳大利亚＆＃的标准。 39; S协会融合法案。\n 沃特金斯女士告诉法庭教会强调帮助他人，并从事慈善机构的行为，如弗林德斯大学的活动，＆＃34;喂养饥饿的＆＃34; \n在今年早些时候的一名裁决中，最近发表在线，Sacat高级会员Kathleen Mcevoy拒绝了成立的论据。\n ＆＃34;沃特金斯女士向法庭向法庭解释说，她正在寻求为飞行意大利面怪澳大利亚的教会成立，以便该协会将被认为是不是在该法案下的利润组织，并拥有法人实体对，＆＃34; MCEVOY女士说明。\n 在裁决中，Mcevoy女士指出，虽然各种＆＃34;牧场文本＆＃34;他们以传统的宗教形式阐述，他们＆＃34;包含一些令人惊讶的关节和＃34;如对圣经书籍的引用作为＆＃34;旧睾丸＆＃34;和＃34;新睾丸＆＃34;\n ＆＃34;特别是有许多表达式参考了既定宗教的文本，以形式和语言模仿这些文本，但以一种清晰的糖类形式，＆＃34; Mcevoy女士写道。\n ＆＃34;我不接受申请人＆＃39;对使用这些表达的使用（以及许多其他类似表达，许多以种族主义和性别歧视，其他宗教的文本或做法表示的许多其他类似表达）作为幽默的例子，以及为了产生好奇心。＆＃34;\n  ＆＃34;我认为，帕特里亚语文本只能被读为模仿或讽刺，即，模仿漫画效果的工作。在我看来，它的目的是讽刺或模仿建立的宗教，它没有歧视，而且＃34;她写了。\n  MCEVOY女士维持公司事务委员会的决定没有证据表明教会从事＆＃34;系统教学和学习过程，也没有任何结构化，一致，广泛的慈善活动＆＃34; \n＆＃34;我很满意，拟议的纳入结社只是具有宗教目的，但是假宗教或宗教的模仿，＆＃34;她写了。\n ＆＃34;它没有形成宗教目的。在此基础上，为了得出结论，作为一个具有宗教目的的机构有资格纳入，显然不是一个优选的决定。＆＃34;\n 沃特金斯女士告诉ABC，她发现了Sacat＆＃39; satuction＆＃34;相当令人失望＆＃34;而且表示，他的公司将带来相当大的福利。\n ＆＃34;如果你有一个关联，那么你应该收入它，因为那么你有政府监督，你可以运行银行账户和所有这些东西，所以我们可能是透明的董事会，＆＃34;她说。\n 沃特金斯女士拒绝了教会是一个＆＃34; sham＆＃34;和一个＆＃34;骗子＆＃34;她说的是她所说的;来自误解＆＃34;\n 她说，飞行的意大利面怪物的教会将继续作为一个未合行的身体运作。\n ＆＃34;你＆＃39; ll发现有一个核心群体，真正相信帕特一手法烈主义，它可以改变人们的生活，＆＃34;她说。 ", "note_en": "The Church of the Flying Spaghetti Monster will remain in the realms of satire, after an attempt to have its Australian wing formally recognised was rejected by a South Australian legal authority on the grounds that the purported religion is nothing more than a &#34;hoax&#34;.\n An adherent of the offbeat movement launched a legal bid to secure it legal status as an incorporated entity\n  SA&#39;s Civil and Administrative Tribunal rejected the bid, describing the church as a &#34;sham&#34; and a &#34;parody&#34;\n Adelaide woman Tanya Watkins, a self-described &#34;captain&#34; of the church and adherent of its creed of &#34;Pastafarianism&#34;, has made repeated attempts to secure the offbeat movement official status as an incorporated association.\n After the latest attempt was knocked back by the Corporate Affairs Commission, Ms Watkins sought a review of that decision, and the matter was subsequently referred to the South Australian Civil and Administrative Tribunal (SACAT).\n The tribunal heard evidence from the commission and from Ms Watkins, who contended that the Church of the Flying Spaghetti Monster was formed for a &#34;religious, educational, charitable or benevolent purpose&#34;, thereby meeting the criteria of South Australia&#39;s Associations Incorporation Act.\n Ms Watkins told the tribunal the church placed emphasis on helping others, and had engaged in acts of charity such as an event at Flinders University to &#34;feed the hungry&#34;.\n In a ruling handed down earlier this year, and recently published online, SACAT Senior Member Kathleen McEvoy rejected the arguments for incorporation.\n &#34;Ms Watkins explained to the tribunal that she was seeking incorporation for the Church of the Flying Spaghetti Monster Australia in order that the association would be recognised as a not for profit organisation under the Act, and be a legal entity in its own right,&#34; Ms McEvoy stated.\n In the ruling, Ms McEvoy noted that while various &#34;Pastafarian texts&#34; are set out in traditional religious forms, they &#34;contain some surprising articulations&#34;, such as references to the books of the Bible as the &#34;Old Testicle&#34; and &#34;New Testicle&#34;.\n &#34;In particular there are numerous expressions which reference the texts of established religions, mimicking those texts in form and language, but in a clearly parodic form,&#34; Ms McEvoy wrote.\n &#34;I do not accept the applicant&#39;s explanation of the use of these expressions (and numerous other similar expressions, many expressed in racist and sexist terms, referencing texts or practices of other religions) as examples of humour, and for the purpose of generating curiosity.&#34;\n  &#34;It is my view that the Pastafarian texts can only be read as parody or satire , namely,  an imitation of work made for comic effect. In my view, its purpose is to satirise or mock established religions, and it does so without discrimination,&#34; she wrote.\n  Ms McEvoy upheld the Corporate Affairs Commission&#39;s decision that there was no evidence the church engaged in &#34;systematic teaching and learning processes, nor of any structured, consistent, and broad-based charitable activities&#34;.\n &#34;I am satisfied that the proposed incorporated association merely presents as having a religious purpose, but is a sham religion or a parody of religion,&#34; she wrote.\n &#34;It was not formed for a religious purpose. On this basis, to conclude it is eligible for incorporation as a body with a religious purpose could clearly not be a preferable decision.&#34;\n Ms Watkins told the ABC she found SACAT&#39;s decision &#34;quite disappointing&#34;, and said incorporation would have brought considerable benefits.\n &#34;If you&#39;ve got an association, then you should get it incorporated because then you&#39;ve got government oversight, you can run a bank account and all those sorts of things so we could be transparent and above board,&#34; she said.\n Ms Watkins rejected claims that the church was a &#34;sham&#34; and a &#34;hoax&#34;, which she said came &#34;from a misunderstanding&#34;.\n She said the Church of the Flying Spaghetti Monster would continue to operate as an unincorporated body.\n &#34;You&#39;ll find that there is a core group of people who really believe in Pastafarianism and that it can change people&#39;s lives for the better,&#34; she said.", "posttime": "2021-06-19 12:38:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "意大利,flying,宗教", "title": "飞行意大利面怪物的教堂丢失了法律识别的竞标 ", "title_en": "Church of the Flying Spaghetti Monster loses bid for legal recognition", "transed": 1, "url": "https://www.abc.net.au/news/2021-06-19/sa-church-of-the-flying-spaghetti-monster-proposal-rejected/100228038", "via": "", "real_tags": ["意大利", "flying", "宗教"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造  帐户 ", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2021-06-19 11:56:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑匣子,black,创造", "title": "被告知黑匣子（飞行数据记录仪）的发明者来放弃这个想法 ", "title_en": "The Inventor of the Black Box (Flight Data Recorder) Was Told to Drop the Idea", "transed": 1, "url": "https://spectrum.ieee.org/tech-history/space-age/the-inventor-of-the-black-box-was-told-to-drop-the-idea-and-get-on-with-blowing-up-fuel-tanks", "via": "", "real_tags": ["黑匣子", "black", "创造"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天＆＃39; s选项 - 从如何创造ryan北的所有内容。如果你应该被运回历史，这就是如何晒黑动物皮肤：\n ＆＃34;晒黑最初是在7000年的bce中发明的。没有晒黑，动物皮肤迅速腐烂，甚至干燥的，变得坚硬，不灵活，脆弱。鞣制将这些皮肤转化为皮革：一种物质如此抗拒，3500 BCE的皮鞋幸存成为现代时代。它＆＃39;我＆＃39; ll绝对想做，但你应该记住，为晒黑准备动物皮肤涉及皮肤发酵，而且还允许它们在尿液中浸泡，并在大便中按摩它们，所以也许设置你的坦克斯顺风。\n ＆＃34;屠宰动物后，立即将皮肤平放，覆盖盐或沙子的肉质侧，这将使它们烘干并延迟分解。在几天内，隐藏将变得艰难，几乎脆弱，然后他们可以被运送到你的晒黑地区。一旦那里，你＆＃39; ll浸泡皮肤：这清洁了污垢和血液并再次柔软它们。皮肤擦除任何剩下的肉体，然后在尿液中浸泡它们 - 这使得头发松动，然后可以刮掉。你＆＃39; LL通过混合Poo和水，使我们提前宣传的大便浆液，然后浸泡你的皮肤：大便中的酶会导致皮肤发酵，软化它们，使它们更加灵活。你可以通过站在你的便便浆料中来帮助这个过程，用脚揉捏皮肤 - 只是继续告诉自己你＆＃39;重新破碎葡萄 - 但请务必以后用肥皂和水洗涤，或者更好地使用非人类动力（如水车）揉搓皮肤。\n ＆＃34;毕竟，这两件事会发生：你的动物皮肤会柔软，灵活，准备晒黑，没有人想要在你附近的任何地方。\n ＆＃34;晒黑这些皮肤，你＆＃39; ll需要收集一些适当的名字和＃39;单宁，＆＃39;来自含有同样适当命名的树木的树木;单宁酸。＆＃39;橡树，栗子，铁杉和红树林的树皮在单宁高，因为雪松树木，红木树木等等。单宁是棕色的，所以如果你＆＃39;使用木头而不是树皮，寻找红色或棕色的木材，并记住硬木通常比软木更容纳更多的单鞣。要提取单宁，将木材或树皮切碎，然后在水中煮沸几个小时。如果你已经生产了它，那么向你的水中添加小苏打水会使它更加基础，这将更有效地制作单宁。您可以使用同样的树皮多次重复此过程以产生更稀释的单宁解决方案。\n ＆＃34;毕竟，晒黑过程实际上是最简单的部分：只需伸展动物皮下并将它们浸入您的单宁浓度浓度的单宁解决方案中几周。在此过程中，拉伸外的皮肤对单宁的水分进行交易，改变隐藏＆＃39; S蛋白质结构，使其更加柔韧，更耐腐蚀，以及防水。它＆＃39;它：你＆＃39; ve maved皮革！皮革＆＃39; s不仅适用于凉爽的夹克;它也是为了鞋子，靴子（你可以完全从皮革中制作），线束，船只，食堂（皮革可以拿着水而不漏水，它赢得了＆＃39;当你把它放下时，它像陶器一样脱落） ，鞭子（有趣的事实：当鞭子的尖端超过声音的速度超过声音时，鞭子裂缝实际上是一个小声音繁荣的声音，所以从技术上你已经发明了超音速技术）和保护盔甲。\n ＆＃34;如果你准备你的皮肤，但不要＆＃39; t棕褐色，你＆＃39; ll生产生皮，它在湿时软化，但在干燥时具有硬化和收缩的有用特性。您可以利用绑定：要将刀片连接到杆并制作轴，只需将一条湿的生根包裹牢固地缠绕在一起并让它干燥。除了为您的狗做出美味的佳肴外（我们只能假设您已经开始繁殖......），Rawhide可用于制作鼓皮，灯罩和原始马蹄铁，甚至用于演员。如果你＆＃39;再这样做，务必将一些房间留给合同：在太紧的生皮革中包裹肢体已被用于酷刑。那个＆＃39;右：当Rawhide围绕手脚签约，掌握了足够的压力来打破骨头，它会产生足够的压力，将这些骨头移动到他们不正常的地方。＆＃34; ", "note_en": "Today&#39;s selection -- from  How to Invent Everything by Ryan North. If you should get transported back to pre-history, here’s how to tan an animal skin:\n &#34;Tanning was originally invented in 7000 BCE. Without tanning, animal skins quickly rot, and even dried ones become hard, inflexible, and brittle. Tanning transforms these skins into leather: a substance so resistant to rot that leather shoes from 3500 BCE have survived into the modern era. It&#39;s something you&#39;ll definitely want to do, but you should keep in mind that preparing animal skins for tanning involves not only skin fermentation but also soaking them in urine and massaging them in poop slurries, so maybe set up your tanneries downwind.\n &#34;Immediately after slaughtering the animals, lay the skins flat and cover the fleshy side in salt or sand, which will dry them out and delay decomposi­tion. In a few days the hides will become hard and almost crispy, and they can then be transported to your tanning area. Once there, you&#39;ll soak the hides: this cleans off dirt and gore and softens them up again. Scour the skins to remove any remaining flesh, then soak them in urine -- this loosens the hair, which can then be scraped off. You&#39;ll make the poop slurry we advertised earlier by mixing poo and water, and then soak your skins in that: enzymes in the poop will cause the skins to ferment, softening them and making them more flexible. You can help this process by standing in your poop slurry and kneading the skins with your feet -- just keep telling yourself you&#39;re crushing grapes -- but be sure to wash up with soap and water afterward, or better yet use nonhuman power (like a waterwheel) to knead the skins for you.\n &#34;After all this, two things will have happened: your animal skins will be soft, flexible, and ready for tanning, and nobody will want to get anywhere near you.\n &#34;To tan these skins, you&#39;ll need to collect some appropriately named &#39;tannins,&#39; which come from trees containing the equally appropriately named &#39;tannic acid.&#39; The bark from oak, chestnut, hemlock, and mangrove trees is high in tannin, as is the wood of cedar trees, redwood trees, and more. Tannins are brown, so if you&#39;re using wood instead of bark, look for red- or brown-colored wood, and keep in mind that hardwoods generally contain more tannin than softwoods. To extract tannins, shred your wood or bark and boil it in water for several hours. If you&#39;ve produced it already, adding baking soda to your water will make it more basic, which will draw out the tannins more effectively. You can repeat this process several times with the same bark to produce more dilute tannic solutions.\n &#34;After all this, the tanning process is actually the easiest part: just stretch the animal skins out and immerse them in your tannic solutions of gradually increasing concentrations for a few weeks. During this process, the stretched-out skins trade their moisture for tannins, altering the hide&#39;s protein structure to make it more flexible, more resistant to rotting, and water resistant. And that&#39;s it: you&#39;ve produced leather! Leather&#39;s useful not just for cool jackets; it&#39;s also for shoes, boots (you can make both entirely out of leather), harnesses, boats, can­teens (leather can hold water without leaking, and it won&#39;t break when you drop it like pottery does), whips (fun fact: a whip-crack is actually the sound of a small sonic boom when the tip of the whip exceeds the speed of sound, so technically you&#39;re already inventing supersonic technology), and protective armor.\n &#34;If you prepare your skin but don&#39;t tan it, you&#39;ll produce rawhide, which soft­ens when wet but which has the useful property of hardening and contracting when dry. You can exploit that for binding: to attach a blade to a stick and make an ax, just wrap a strip of wet rawhide securely around both and let it dry. Besides making a delicious treat for your dogs (which we can only assume you&#39;ve already started breeding...), rawhide is useful in making drum skins, lampshades, and primitive horseshoes, and has  even been used for casts. If you&#39;re doing that, though, be sure to leave some room for it to contract: wrapping limbs in too-tight rawhide has been used for torture. That&#39;s right: while rawhide contracting around hands and feet won&#39;t produce enough pressure to break bones, it will produce enough pressure to move those bones to places they don&#39;t normally go.&#34;", "posttime": "2021-06-19 11:55:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "动物,animal,皮肤", "title": "晒黑动物皮肤 ", "title_en": "Tanning an Animal Skin", "transed": 1, "url": "https://www.delanceyplace.com/view-archives.php?4351", "via": "", "real_tags": ["动物", "animal", "皮肤"]}, {"category": "", "categoryclass": "", "imagename": "84d43a86d7f453d06fe4fb5dfb1f2e92.jpg", "infoid": 1066829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代表Revlon的去年花旗集团试图为Revlon＆＃39;贷款人提交780万美元的利息支付。相反，他们不小心发送了8.93亿美元 - 贷款的整个余额，这不是2023年。\n 当他们意识到他们的错误时，他们试图拿回钱。一些贷款人拒绝了，让花旗集团超出了大约5亿美元。案件去了审判，本周美国的小区法官在曼哈顿统治着花旗集团的Jesse Furman。\n 这可能发生这种错误吗？事实证明，可怕的糟糕的UI设计。首先，我们需要了解还款安排的机制，该机制通过一块名为FlexCube的金融软件执行。弗曼法官总结了：\n  在FlexCube上，最简单的（或许只是）执行交易的方式 - 支付Angelo Gordon贷款人份额截至2020年8月11日截至8月11日，然后将2016年期限贷款与剩余的贷款人重组 - 在系统中进入它，仿佛全部支付贷款，从而触发应计的利息支付给所有贷方，而是将支付的主要部分指向A＆＃34;洗账户＆＃34;  - ＆＃ 34;一个内部花旗银行账户......帮助确保金钱不会离开银行。＆＃34;\n ARS Technica在案例中获得了屏幕截图，显示了螺旋发生的位置：\n 将此交易进入FlexCube的实际工作落到印度的分包商。他出现了一个看起来像这样的柔性屏幕：\n   分包商认为检查＆＃34;校长＆＃34;复选框并输入花旗银行洗车账户的数量，确保本金支付将留在花旗银行。他错了。为防止支付校长，实际上需要分包商设置＆＃34;前面＆＃34;和＃34;基金＆＃34;田地到洗涤账户以及＆＃34;校长。＆＃34;分包商没有做到这一点。 \n花旗银行和＃39;■程序要求三人在此大小的交易中签字。在这种情况下，这是他在印度的同事，以及特拉华州的一位高级花旗银行官员。所有三人都认为设定＆＃34;校长＆＃34;内部洗涤账号的现场将防止校长付款。当他批准交易时，特拉华州主管写道：＆＃34;看起来不错，请继续。校长会洗。＆＃34;\n  它看起来＆＃34;好＆＃34;对于高级主管，因为没有设计规定，使它看起来很糟糕。您会认为，在可能的情况下，软件设计人员将组合某些按钮，提供警告提示，将颜色从绿色变为红色，或这些东西的组合。而是该程序似乎是由＆＃39; 90s的工程师设计的。\n 为您提供UI设计师的结果：银行肯定会在未来寻找更好的软件，并愿意为此付出代价。这里有一个真正的机会。\n      他们＆＃39;实际上只是继续支付一次性的离岸承包商，因为它是美国银行所做的一员。\n  我们还应该分出去什么？哦，让我们的心脏在印度的一家公司分包给我们的心脏跳动，而我们＆＃39;重新开始。是的，是什么，一种可怕的软件UI，但是大多数工业软件接口看起来像10093，并在可怕的开放系统和10个加上历史的操作系统上运行。 ", "note_en": "Last year Citigroup, representing Revlon, attempted to make a $7.8 million interest payment to Revlon&#39;s lenders. Instead they accidentally sent  $893 million--the entire balance of the loan, which was not due until 2023.\n When they realized their mistake, they tried to get the money back. Some of the lenders refused, leaving Citigroup out of roughly $500 million. The case went to trial, and  this week U.S. District Judge Jesse Furman in Manhattan ruled against Citigroup.\n How could an error like this possibly happen? Terrible, terrible UI design, as it turns out. First off we need to understand the mechanisms of the repayment arrangement, which is executed through a piece of financial software called Flexcube. As Judge Furman summarized:\n  On Flexcube, the easiest (or perhaps only) way to execute the transaction—to pay the Angelo Gordon Lenders their share of the principal and interim interest owed as of August 11, 2020, and then to reconstitute the 2016 Term Loan with the remaining Lenders—was to enter it in the system as if paying off the loan in its entirety, thereby triggering accrued interest payments to all Lenders, but to direct the principal portion of the payment to a &#34;wash account&#34;—&#34;an internal Citibank account... to help ensure that money does not leave the bank.&#34;\n Ars Technica got ahold of a screenshot used in the case, which shows where the screw-up occurred:\n The actual work of entering this transaction into Flexcube fell to a subcontractor in India. He was presented with a Flexcube screen that looked like this:\n   The subcontractor thought that checking the &#34;principal&#34; checkbox and entering the number of a Citibank wash account would ensure that the principal payment would stay at Citibank. He was wrong. To prevent payment of the principal, the subcontractor actually needed to set the &#34;front&#34; and &#34;fund&#34; fields to the wash account as well as &#34;principal.&#34; The subcontractor didn&#39;t do that.\n Citibank&#39;s procedures require that three people sign off on a transaction of this size. In this case, that was the subcontractor, a colleague of his in India, and a senior Citibank official in Delaware. All three believed that setting the &#34;principal&#34; field to an internal wash account number would prevent payment of the principal. As he approved the transaction, the Delaware supervisor wrote: &#34;looks good, please proceed. Principal is going to wash.&#34;\n  It looked &#34;good&#34; to the senior supervisor because there are no design provisions to make it look bad. You would think, where an error of this magnitude was possible, the software designers would group certain buttons together, provide warning prompts, change colors from green to red, or a combination of these things. Instead the program appears to have been designed by an engineer in the &#39;90s.\n The upshot for you UI designers out there: Banks will certainly be looking for better software in the future, and willing to pay top dollar for it. There&#39;s a real opportunity here.\n      They&#39;ll actually just continue paying as little as humanly possible for disposable offshore contractors because that&#39;s what American banks do.\n  What else should we sub out? ooh, Let&#39;s subcontract the management of our heart beating to a company in India while we&#39;re at it. And yes, what a horrible software UI, however, most industrial software interfaces look like1993 and run on terrifyingly open systems and on 10 plus-year-old Operating Systems.", "posttime": "2021-06-19 11:55:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,ui,支付", "title": "UI设计的屏幕截图，LED花旗集团不小心发送$ 893M ", "title_en": "Screenshot of the UI Design That Led Citigroup to Accidentally Send $893M", "transed": 1, "url": "https://www.core77.com/posts/105540/Screenshot-of-the-Horrific-UI-Design-That-Led-Citigroup-to-Accidentally-Send-893-Million#", "via": "", "real_tags": ["设计", "ui", "支付"]}]