[{"category": "", "categoryclass": "", "imagename": "7f2da5c408ae8be1605238538d50e1c1.jpg", "infoid": 1070305, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "国会的一项两党基础设施​​法案提议通过向交易所和其他各方应用新的信息报告要求，从加密投资者那里筹集 280 亿美元。根据与 CoinDesk 共享的法案草案副本，任何转让任何数字资产的经纪人都需要根据修改后的信息报告制度提交申报表。该草案将数字资产定义为“任何价值的数字表示……记录在加密安全的分布式账本上”或相关技术。它还在经纪人的定义中包括去中心化交易所和点对点市场。该法案的单独摘要进一步阐明，加密货币被视为更广泛的数字资产保护伞的一部分。注册后，您将收到有关 CoinDesk 产品的电子邮件，并且您同意我们的条款和条件以及隐私政策。该文件称：“该条款包括更新经纪人的定义，以反映数字资产收购和交易方式的现实。” “该条款进一步明确，经纪人对经纪人的报告适用于第 6045(g)(3) 条所指的所有涵盖证券的转让，包括数字资产。”根据也与 CoinDesk 共享的一份情况说明书，这可能会为该法案的“支付费用”带来高达 300 亿美元的资金。 “此外，数字资产被添加到当前的规则中，要求企业报告超过 10,000 美元的现金支付，”情况说明书说。\n加密报告要求是该法案中包含的 14 项新“付费”清单之一，其中还包括重新利用 COVID-19 救济基金、拍卖、超级基金费用、燃料销售和其他收入来源。区块链协会执行董事克里斯汀史密斯告诉 CoinDesk，草案语言可能意味着许多与加密货币互动的个人可能不得不开始报告他们的交易。 “我们将其解释为软件钱包开发商、硬件钱包制造商、多重签名服务提供商、流动性提供商、DAO 代币持有者，甚至可能是矿工，”她说。 1 万亿美元的基础设施法案还包括为公共交通，特别是客运铁路提供资金的条款；对桥梁、清洁饮用水和废水基础设施的投资；根据白宫的一份情况说明书，为所有美国人提供高速互联网接入，以及其他规定。参议院多数党领袖查克舒默 (DN.Y.) 表示，美国参议院最早可能在周三进行测试投票。在一份声明中，美国总统乔拜登赞扬了谈判该法案的团队，称双方都没有 100% 得到他们想要的。 “从工会到商业领袖和经济学家，左、右和中间的每个人都认为，从长远来看，这笔交易的公共投资将意味着更多的就业机会、更高的生产力和更高的经济增长。专家认为，这笔交易的大部分好处将流向工薪家庭，”他在一份声明中说。\n披露 作为有关加密货币、数字资产和货币未来的新闻和信息的领导者，CoinDesk 是一家致力于达到最高新闻标准并遵守一套严格的编辑政策的媒体机构。 CoinDesk 是 Digital Currency Group 的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "A bipartisan infrastructure bill in Congress proposes to raise $28 billion from crypto investors by applying new information reporting requirements to exchanges and other parties.\n According to a draft copy of the bill shared with CoinDesk, any broker that transfers any digital assets would need to file a return under a modified information reporting regime. The draft defined digital assets as “any digital representation of value … recorded on a cryptographically secured distributed ledger” or related technology. It also includes decentralized exchanges and peer-to-peer marketplaces in its definition of brokers.\n A separate summary of the bill further clarified that cryptocurrencies are treated as a subsection of the broader digital asset umbrella.\n By signing up, you will receive emails about CoinDesk products and you agree to our  terms &amp; conditions and  privacy policy.\n “The provision includes updating the definition of broker to reflect the realities of how digital assets are acquired and traded,” the document said. “The provision further makes clear that broker-to-broker reporting applies to all transfers of covered securities within the meaning of section 6045(g)(3), including digital assets.”\n This could bring up to $30 billion into the bill’s “pay-fors,” according to a fact sheet also shared with CoinDesk.\n “Additionally, digital assets are added to the current rules requiring businesses to report cash payments over $10,000,” the fact sheet said.\n  The crypto reporting requirements are among a list of 14 new “pay-fors” included in the bill, which also includes repurposing COVID-19 relief funds, auctions, Superfund fees, fuel sales and other sources of revenue.\n Kristin Smith, executive director of the Blockchain Association, told CoinDesk the draft language could mean a number of individuals interacting with crypto may have to start reporting their transactions.\n “We interpret this to mean software wallet developers, hardware wallet manufacturers, multisig service providers, liquidity providers, DAO token holders and potentially even miners,” she said.\n The $1 trillion infrastructure bill also includes provisions for funding public transit, particularly passenger rail; investments in bridges, clean drinking water and wastewater infrastructure; and high-speed internet access for all Americans, among other provisions, according to a White House fact sheet.\n The U.S. Senate may conduct a test vote as early as Wednesday, Senate Majority Leader Chuck Schumer (D-N.Y.)  said.\n In a statement, U.S. President Joe Biden praised the team that negotiated the bill, saying neither side got 100% of what it wanted.\n “Everyone from unions to business leaders and economists left, right and center believe the public investments in this deal will mean more jobs, higher productivity, and higher growth for our economy over the long term. Experts believe that the majority of the deal’s benefits will flow to working families,” he said in a statement.\n      Disclosure The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2021-07-29 22:15:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,新税,infrastructure,加密", "title": "国会新的两党基础设施​​法案旨在通过对交易所交易数字资产（包括加密货币）征收新税来筹集约 30B 美元", "title_en": "New bipartisan infrastructure bill in Congress aims to raise ~$30B by imposing new taxes on exchanges trading digital assets including crypto", "transed": 1, "url": "https://www.coindesk.com/new-infrastructure-bill-looks-to-raise-30b-through-crypto-taxes", "via": "", "real_tags": ["交易", "新税", "加密"]}, {"category": "", "categoryclass": "", "imagename": "2f76e716f3ff1dd52bdd87d69a280d1d.jpeg", "infoid": 1070303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Robinhood Markets Inc. 将其首次公开募股定价为每股 38 美元，处于预期的低端，此前这个受欢迎的交易平台满足了其备受期待的首次公开募股的不温不火的需求。该公司及其承销商选择的价格处于他们一直瞄准的每股 38 至 42 美元区间的底部。它将 Robinhood 的估值定为约 320 亿美元，远高于一年前在一轮融资中获得的近 120 亿美元，但低于一些投资者和银行家此前的崇高预期。 Robinhood 已经表示，一些高管将出售 5500 万股，因此此次发行的收益应该会超过 20 亿美元。价格反映了一些投资者的犹豫，他们对 Robinhood 寻求的高估值感到愤怒，以及该公司及其承销商有意识地决定保守，以帮助建立一个成功的第一个 -据知情人士透露，当日交易。 Robinhood 的下一步是首次交易，该公司将于周四在纳斯达克证券交易所上市，交易代码为 HOOD。这是一次与传统 IPO 截然不同的首次公开募股。虽然大多数公司在 IPO 时只向个人投资者分配少量股票，但 Robinhood 通过其新平台向个人投资者出售了大部分 IPO 股票，该平台使用户可以在开始交易之前访问 IPO。个人投资者的高配置是周四首次亮相的 X 因素。个人投资者手中的大部分资金——以及其他未在 IPO 中获得股票的个人投资者围绕 Robinhood 的嗡嗡声——导致一些承销大型 IPO 的银行的交易员表示，很难预测股票将开放。 Robinhood 今年早些时候决定阻止用户在此类股票的狂热高峰期购买像 GameStop GME 这样的模因股票 -0.64%，这激怒了一些投资者，并可能促使一些人避开此次发行。\n过去将很大比例的股份分配给个人投资者的首次公开募股一直在挣扎。 2012 年，Facebook FB -3.96% 将其 IPO 的约 25% 出售给了个人投资者。该股在震荡的第一天收盘略高于 38 美元的 IPO 价格，然后在第二天暴跌，部分原因是许多个人投资者获得的股票比他们想要的多。 Facebook 花了一年多的时间才再次收于 IPO 价格之上。 2006 年，Vonage Holdings VG 1.26% 允许长期客户购买其 IPO。它的股票在早盘交易中也出现了波动。 Robinhood 的上市是 IPO 历史性繁荣的又一个里程碑，因为股市上涨和投资者热情高涨，吸引了大量成功的私营公司转向公有制。据 Dealogic 称，今年每周约有 20 家公司上市。截至周二，传统 IPO 已筹集超过 980 亿美元，即将超过 1999 年和 2000 年全年，成为美国上市 IPO 有史以来规模最大的一年。在推出应用程序的近七年里，Robinhood 已经从一家小型初创公司发展成为美国最大的零售经纪公司之一。这家推广零佣金交易的公司表示，其使命是使投资民主化。这是 Robinhood 周六通过为个人投资者举办的现场直播路演演示而得到强化的理念。截至 6 月底，该公司拥有 2250 万个资金账户，其用户在 Robinhood 平台上持有约 1000 亿美元的资产。今年早些时候，当数百万业余投资者下载其应用程序以参与 GameStop 等模因股票的爆炸性反弹时，该公司迅速走红。突破时刻几乎打破了 Robinhood，因为该公司不得不限制购买一些飞速发展的股票并筹集数十亿美元的紧急资金以满足因交易量增加而开始的监管要求。 Robinhood 反弹并继续吸引新用户，但最近，它表示其增长正在放缓。该公司上周在一份证券文件中表示，预计其第三季度收入将比第二季度下降，部分原因是交易活动减少。它的受欢迎程度也增加了监管审查。在过去的九个月里，该公司已同意支付超过 1.3 亿美元，以解决对其一系列商业行为的调查。未来可能还有更多：Robinhood 本周透露，它收到了华尔街自律机构 Finra 的新信息请求。\nRobinhood IPO 由高盛集团 GS 0.63% 和摩根大通公司牵头。", "note_en": "Robinhood Markets Inc. priced its initial public offering at $38 a share, at the low end of expectations, after the popular trading platform met tepid demand for its highly anticipated debut.\n    The price chosen by the company and its underwriters is at the bottom of the range of $38 to $42 a share they had been targeting. It pegs Robinhood’s valuation at about $32 billion, far higher than the nearly $12 billion it fetched in a funding round a year ago but below the  lofty prior expectations of some investors and bankers.\n  Robinhood has said it and some executives would sell 55 million shares, so the offering should yield more than $2 billion.\n  The price reflects both hesitation on the part of some investors, who bristled at what they saw as the high valuation Robinhood sought, as well as a conscious decision by the company and its underwriters to be conservative in order to help set up a successful first-day of trading, according to people familiar with the matter.\n      Next up for Robinhood is its trading debut, which the company will make Thursday on the Nasdaq stock exchange under the symbol HOOD. It is a markedly different debut than the traditional IPO. While most companies only allocate a small amount of stock to individual investors at the time of their IPOs, Robinhood sold a big chunk of its IPO shares to individual investors over its new platform that gives users  access to IPOs before they start trading.\n  That  high individual investor allocation is an X factor for Thursday’s debut. The large chunk in the hands of individual investors—as well as the buzz around Robinhood by other individual investors who didn’t receive shares in the IPO—has led some traders at banks that underwrite big IPOs to say it is hard to predict how the stock will open.\n    Robinhood’s decision earlier this year to  stop users from buying meme stocks like  GameStop    GME  -0.64%  during the height of the  frenzy for such shares rankled some investors and could prompt some to eschew the offering.\n  Past IPOs in which a significant percentage of shares were allocated to individual investors have struggled. In 2012,  Facebook    FB  -3.96%   sold about 25% of its IPO to individual investors. The stock closed slightly above its $38 IPO price in a rocky first day of trading before tumbling the next day, in part because many individual investors received more stock than they wanted. It took more than a year for Facebook to close above its IPO price again. In 2006,  Vonage Holdings    VG  1.26%  allowed longtime customers to buy into its IPO. Its stock also  wobbled in early trading.\n  The Robinhood listing is another landmark in a historic boom in IPOs as a rising stock market and hearty investor appetite entice a slew of successful private companies to shift to public ownership. Some 20 companies are going public each week this year, according to Dealogic. Traditional IPOs had raised more than $98 billion as of Tuesday, on the cusp of surpassing all of 1999 and 2000 as the biggest year ever for U.S.-listed IPOs.\n  In the nearly seven years since it launched its app, Robinhood has gone from a tiny startup to one of the largest U.S. retail brokerages. The firm, which popularized zero-commission trades, says its mission is to democratize investing. It is a philosophy Robinhood reinforced Saturday by hosting a live-streamed roadshow presentation for individual investors.\n  As of the end of June, the firm had 22.5 million funded accounts and its users held about $100 billion of assets on the Robinhood platform.\n  The company went viral earlier this year when millions of amateur investors downloaded its app to participate in the explosive rally in meme stocks like GameStop. The breakout moment nearly broke Robinhood, as the company had to restrict purchases of some high-flying stocks and raise billions of dollars in emergency capital to meet regulatory requirements that kicked in because of the increased trading volumes.\n  Robinhood bounced back and continued to attract new users, but, more recently, it flagged that its growth is slowing. The company said in a securities filing last week that it expects its third-quarter revenue to fall relative to the second quarter, partially due to decreased trading activity.\n  Its popularity has brought increased regulatory scrutiny too. In the past nine months, the company has agreed to pay more than $130 million to settle investigations into a range of its business practices. There could be more on the way: Robinhood disclosed this week that it got a new request for information from Wall Street’s self-regulatory body, Finra.\n  The Robinhood IPO is being led by  Goldman Sachs Group    GS  0.63%  and  JPMorgan Chase   &amp; Co.", "posttime": "2021-07-29 22:14:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "华尔街,华尔街日报,street", "title": "华尔街日报", "title_en": "Wall Street Journal", "transed": 1, "url": "https://www.wsj.com/articles/robinhood-ipo-prices-at-38-a-share-11627515866?mod=djemalertNEWS", "via": "", "real_tags": ["华尔街", "华尔街日报", "street"]}, {"category": "", "categoryclass": "", "imagename": "468b9309ee5f6ba990fb5cb4d86dab63.jpg", "infoid": 1070302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透社 7 月 28 日 - Robinhood Markets Inc 是交易应用程序的所有者，该应用程序已成为散户投资者投机今年“meme”股票交易狂潮的首选目的地，周三在其首次公开募股中筹集了 21 亿美元。该公司正寻求利用个人投资者对加密货币和 GameStop Corp (GME.N) 等股票的迷恋，这些股票在成为 Reddit 等社交媒体网站上的交易投机对象后出现剧烈波动。Robinhood 的月活跃用户从12 月底为 1170 万，截至 6 月底为 2130 万。此次 IPO 对 Robinhood 的估值为 318 亿美元，使其收入高于其许多传统竞争对手，如嘉信理财 (SCHW.N) ，但本次发行定价在公司指示区间的底部。一些投资者保持观望，理由是担心估值泡沫、监管机构打击 Robinhood 的风险。当 meme 股票交易狂潮在 1 月底爆发时，公司实施的交易限制令公司感到愤怒，甚至挥之不去。阅读更多 Robinhood 表示，它在 IPO 中以每股 38 美元的价格出售了 5500 万股，这是其 38 美元至 42 美元价格区间的低端。这使得它成为今年迄今为止上市的最有价值的美国公司之一，因为新上市的市场炙手可热。 Robinhood 表示将为其用户保留 20% 至 35% 的股份，这是一个不寻常的举动。 Robinhood 的平台允许用户对股票、交易所交易基金、期权和加密货币进行无限制的免佣金交易。其简单的界面使其在 COVID-19 大流行期间在家中交易的年轻投资者中很受欢迎。\n今年早些时候，Robinhood 在清算所的存款要求提高了 10 倍之后，限制了一些热门股票的交易，这激怒了一些投资者和美国立法者。它一直是许多监管调查的中心。该公司本周披露，已收到美国监管机构的询问，调查其员工是否在 1 月底实施交易限制之前交易了 GameStop 和 AMC Entertainment Holdings, Inc (AMC.N) 的股票。 6 月，Robinhood 同意支付近 7000 万美元，以解决华尔街自己的监管机构金融业监管局对“系统性”故障的调查，包括系统中断、提供“虚假或误导性”信息以及期权交易控制薄弱。该券商还因其大部分收入依赖“订单流支付”而受到批评，根据这种方式，它从做市商那里收取费用以将交易路由给他们，并且不向用户收取个人交易费用。批评人士认为，这种被许多其他经纪商采用的做法会造成利益冲突，理由是它会激励经纪商向支付更高费用的人发送订单。 Robinhood 争辩说，它根据用户最便宜的价格安排交易，收取佣金会更贵。美国证券交易委员会正在审查这种做法。 Robinhood 由斯坦福大学的室友 Vlad Tenev 和 Baiju Bhatt 于 2013 年创立。这些文件显示，在发行后，他们将拥有多数投票权，Bhatt 拥有约 39% 的流通股投票权，而 Tenev 将持有约 26.2% 的投票权。该公司的股票定于周四在纳斯达克开始交易，股票代码为“HOOD”", "note_en": "July 28 (Reuters) - Robinhood Markets Inc, the owner of the trading app which emerged as the go-to destination for retail investors speculating on this year&#39;s &#34;meme&#39; stock trading frenzy, raised $2.1 billion in its initial public offering on Wednesday.\n The company was seeking to capitalize on individual investors&#39; fascination with cryptocurrencies and stocks such as GameStop Corp  (GME.N), which have seen wild swings after becoming the subject of trading speculation on social media sites such as Reddit. Robinhood&#39;s monthly active users surged from 11.7 million at the end of December to 21.3 million as of the end of June.\n The IPO valued Robinhood at $31.8 billion, making it greater as a function of its revenue than many of its traditional rivals such as Charles Schwab Corp  (SCHW.N), but the offering priced at the bottom of the company&#39;s indicated range.\n Some investors stayed on the sidelines, citing concerns over the frothy valuation, the risk of regulators cracking down on Robinhood&#39;s business, and even lingering anger with the company&#39;s imposition of trading curbs when the meme stock trading frenzy flared up at the end of January.   read more\n Robinhood said it sold 55 million shares in the IPO at $38 apiece, the low end of its $38 to $42 price range. This makes it one of the most valuable U.S. companies to have gone public year-to-date, amid a red-hot market for new listings.\n In an unusual move, Robinhood had said it would reserve between 20% and 35% of its shares for its users.\n Robinhood&#39;s platform allows users to make unlimited commission-free trades in stocks, exchange-traded funds, options and cryptocurrencies. Its simple interface made it popular with young investors trading from home during the COVID-19 pandemic.\n Robinhood enraged some investors and U.S. lawmakers earlier this year when it restricted trading in some popular stocks following a 10-fold rise in deposit requirements at its clearinghouse. It has been at the center of many regulatory probes.\n The company disclosed this week that it has received inquiries from U.S. regulators looking into whether its employees traded shares of GameStop and AMC Entertainment Holdings, Inc  (AMC.N) before the trading curbs were placed at the end of January.\n In June, Robinhood agreed to pay nearly $70 million to settle an investigation by Wall Street&#39;s own regulator, the Financial Industry Regulatory Authority, for &#34;systemic&#34; failures, including systems outages, providing &#34;false or misleading&#34; information, and weak options trading controls.\n The brokerage has also been criticized for relying on &#34;payment for order flow&#34; for most of its revenue, under which it receives fees from market makers for routing trades to them and does not charge users for individual trades.\n Critics argue the practice, which is used by many other brokers, creates a conflict of interest, on the grounds that it incentivizes brokers to send orders to whoever pays the higher fees. Robinhood contends that it routes trades based on what is cheapest for its users, and that charging a commission would be more expensive. The U.S. Securities and Exchange Commission is examining the practice.\n Robinhood was founded in 2013 by Stanford University roommates Vlad Tenev and Baiju Bhatt. They will hold a majority of the voting power after the offering, these filings showed, with Bhatt having around 39% of the voting power of outstanding stock while Tenev will hold about 26.2%.\n The company&#39;s shares are scheduled to start trading on Nasdaq on Thursday under the ticker &#34;HOOD&#34;", "posttime": "2021-07-29 22:13:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "低端,giving,交易", "title": "Robinhood 在其 38 美元至 42 美元范围的低端出售 5500 万股后，在其 IPO 中筹集了 2.1B 美元，估值为 31.8B 美元", "title_en": "Robinhood raises $2.1B in its IPO after selling 55M shares at the low end of its $38 to $42 range, giving it a valuation of $31.8B", "transed": 1, "url": "https://www.reuters.com/business/finance/robinhood-gateway-meme-stocks-raises-21-billion-ipo-source-2021-07-28/", "via": "", "real_tags": ["低端", "giving", "交易"]}, {"category": "", "categoryclass": "", "imagename": "ace9ba85ebaa75e31b248350f2dc3b3a.jpg", "infoid": 1070299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Android 内置恶意软件防御系统 Google Play Protect 在检测到超过 20,000 个恶意应用程序中的三分之二后，未能通过防病毒测试实验室 AV-TEST 的实际测试。 Google 的 Android 移动威胁防护每天自动扫描超过 1000 亿个应用程序，于 2017 年 5 月在 Google I/O 2017 期间推出，并于 2017 年 7 月开始向所有 Android 设备推出。从那时起，Google Play Protect 已部署到数十亿台设备，现在是超过 25 亿台活跃 Android 设备的内置恶意软件防护。根据 AV-TEST 的结果，在 6 个月（即 2021 年 1 月至 2021 年）期间测试的 15 个 Android 安全应用程序中，谷歌的移动威胁防护解决方案排在最后。耐久性测试表明，该服务并没有提供特别好的安全性：其他所有安全应用程序都提供比 Google Play Protect 更好的保护。”在为期 5 个月的持久性测试中，Google Play Protect 检测到测试实验室在三轮测试中使用的近 20,000 个受感染应用程序中的三分之二多一点。每轮测试都将安全应用程序与 3,000 多个新发现的恶意软件样本（最多 24 小时）和 3,000 多个其他最多一个月的样本进行对比。\nAV-TEST 发现：“在实时测试和参考集测试中，总共有 5 个应用程序始终 100% 检测到所有攻击者。” “排在最后，Google Play Protect 在实时测试中仅检测到 68.8%，在参考集的测试中检测到 76.6%。”在所有测试的移动安全应用程序中，Bitdefender、G DATA、McAfee、NortonLifeLock 和 Trend Micro 的检测率达到了完美的 100%。 Google Play Protect 还错误地将 AV-TEST 从 Play 商店和第三方 Android 应用程序商店安装的近 10,000 个无害应用程序中的 70 个应用程序检测为潜在恶意应用程序。鉴于 Android 内置的恶意软件防护解决方案未能检测到测试期间抛出的 20,000 个恶意软件样本中的三分之一以上，AV-TEST 建议用户使用第二个安全应用程序来阻止恶意软件通过 Play Protect 的防御。去年，Google Play Protect 在 Android 保护测试中也获得了 6 分的零分，但这次仅检测到 3,300 个新发现样本（最多 24 小时）中的 37% 和 3,300 个恶意软件参考集中的 33.1%样品（循环最多 4 周）。一年前，谷歌与 ESET、Lookout 和 Zimperium 合作建立了应用防御联盟，作为改进 Android 恶意软件提交检测和阻止恶意应用在 Play 商店上发布之前所做的努力的一部分。\nBleepingComputer 已联系谷歌对 AV-TEST 的结果发表评论，但在本文发布时尚未收到回复。", "note_en": "Google Play Protect, the Android built-in malware defense system, has failed the real-world tests of antivirus testing lab AV-TEST after detecting just over two thirds out of more than 20,000 malicious apps it was pitted against.\n Google&#39;s Android mobile threat protection, which automatically scans  over 100 billion apps every day, was introduced during the Google I/O 2017 in May 2017, with rollout to all Android devices starting in July 2017.\n Since then, Google Play Protect has been deployed to billions of devices and is now the built-in malware protection on  over 2.5 billion active Android devices.\n According to  AV-TEST&#39;s results, Google&#39;s mobile threat protection solution ranked last out of 15 Android security apps tested over a span of six months, between January to June 2021.\n While always running and scanning every app installed and launched on the device, &#34;the endurance test revealed that this service does not provide particularly good security: every other security app offers better protection than Google Play Protect.&#34;\n   During this 5-month long endurance test, Google Play Protect detected a little over two-thirds of nearly 20,000 infected apps the testing lab used as part of three rounds of tests.\n Each of these testing rounds pitted the security apps against over 3,000 newly-discovered malware samples (up to 24 hours old) and a reference set of more than 3,000 other up to one-month-old samples.\n &#34;A total of 5 apps always detected all the attackers 100 percent in the real-time test and in the test with the reference set,&#34; AV-TEST found.\n &#34;Finishing in last place, Google Play Protect only detected 68.8 percent in the real-time test and 76.6 percent in the test with the reference set.&#34;\n Out of all mobile security apps tested, Bitdefender, G DATA, McAfee, NortonLifeLock, and Trend Micro were the ones that hit a perfect 100% detection rate.\n Google Play Protect also mistakenly detected 70 apps as potentially malicious out of almost 10,000 harmless ones installed by AV-TEST from the Play Store and third-party Android app stores.\n Given that the Android built-in malware protection solution failed to detect over a third of the 20,000 malware samples thrown at it during the tests, AV-TEST advises users to use a second security app to block malware slipping through Play Protect&#39;s defenses.\n  Last year, Google Play Protect also scored  zero out of six points in Android protection tests but, this time, detecting only 37% of 3,300 newly discovered samples (up to 24 hours old) and 33.1% of those from the reference set of 3,300 malware samples (circulating for up to 4 weeks).\n One year earlier, Google joined efforts with ESET, Lookout, and Zimperium to establish the  App Defense Alliance as part of an effort to improve Android malware detection on submission and block malicious apps before getting published on the Play Store.\n BleepingComputer has reached out to Google for comment on AV-TEST&#39;s results but had not heard back at the time of this publication.", "posttime": "2021-07-29 22:12:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,android,google,应用,apps", "title": "研究人员：Android 内置恶意软件检测工具 Google Play Protect 仅识别 20K+ 恶意应用的 68.8%，在 15 个安全应用中排名倒数", "title_en": "Researchers: Google Play Protect, Android's built-in malware detection tool, identified only 68.8% of 20K+ malicious apps, ranking last out of 15 security apps", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/google-play-protect-fails-android-security-tests-once-more/", "via": "", "real_tags": ["软件", "android", "google", "应用", "apps"]}, {"category": "", "categoryclass": "", "imagename": "5815a0d0fd35eb91e85212293e6f90cf.jpg", "infoid": 1070298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，谷歌发布了一些对其 Play 政策的更改，并在精确的法律改进和一些广告 ID 调整之间进行了调整，这对某些类型的约会人群来说是一个重磅炸弹。谷歌更新了其不当内容政策，以禁止“有偿性关系”——即糖爹或甜蜜约会应用程序。我不得不承认，我并不积极地知道傍大款应用程序是一回事，但显然，它们绝对是。事实上，我提出的符合该类别的应用程序的下载量远远超过一百万。尽管大多数人的评分出奇地高，但在某些情况下，评论的质量可能意味着正在发生一些操纵。尽管如此，很多人显然都在使用这些应用程序。除非您通过应用程序进行性交易，否则 Google 不会禁止这样做。那么它可能会禁止该应用程序。如果不知何故你不熟悉这个词，“糖爹”不仅仅是一根棒子上的焦糖糖果。在更常见的白话中，傍大款是一个人——通常是一个年长的男人，但你可以有一个“糖妈”或者一个性别中立的“糖父母”？ - 在通常的交易关系中花钱或给钱，通常是为了性方面的好处。我不评判，不同的人享受不同的东西，如果各方都完全知情同意，我看不出这样的安排对任何人有什么真正的伤害。但是，谷歌似乎确实在乎，尽管该公司明确表示并不反对这种关系的性质，只是他们经常是性关系，而且公司全面禁止色情内容——似乎忽略了这种关系的主要冲动Tinder 和 Hinge 等更通用的约会应用程序背后的许多客户，以及甚至主流约会应用程序用户交换的许多消息。我们已与 Google 联系以获取更多信息，了解禁令背后的更多信息，以及针对甜蜜约会应用程序而忽略其他潜在色情约会应用程序的确切逻辑。但是，与此同时，从 9 月 1 日开始，所有类型的爱吃糖的人都必须要么坚持访问网站，要么旁加载他们的甜蜜约会应用程序——这是 Android，与 iPhone 不同，您仍然可以从任何地方获取应用程序。", "note_en": "Today, Google published a handful of changes to its Play policies, and nestled among precise legalese refinements and some advertising ID tweaks is a bombshell for a  certain type of dating crowd. Google&#39;s updated its inappropriate content policy to ban &#34;compensated sexual relationships&#34; — i.e., sugar daddy or sugar dating apps.\n  I have to admit, I didn&#39;t actively know that sugar daddy apps were a thing,  but  apparently,  they  absolutely  are. In fact, the apps I&#39;ve pulled up that would qualify under that category have well over a million downloads. While most have a surprisingly high rating, the quality of reviews in some cases might imply a little manipulation is occurring. Still, a lot of people are clearly using these apps.\n  Google&#39;s not banning this unless you&#39;re trading one for sex via an app. Then it&#39;s probably banning that app.\n If somehow you aren&#39;t familiar with the term, a &#34;sugar daddy&#34; is more than a  caramel candy on a stick. In the more common vernacular, a sugar daddy is a person — usually an older man, but you could have a &#34;sugar mommy&#34; or maybe a gender-neutral &#34;sugar parent?&#34; — that spends or gives money in what is typically a transactional relationship, often for sexual favors.\n    I don&#39;t judge, different people enjoy different things, and if all parties are consenting with full knowledge, I don&#39;t see how an arrangement like that really harms anyone. But, it seems Google  does care, though the company is clear it&#39;s not objecting to the nature of the relationship, merely the fact that they&#39;re often  sexual relationships and the company has a blanket ban on sexual content — seemingly ignoring the primary impulse for many customers behind more generalized dating apps like Tinder and Hinge, as well as many of the messages that even mainstream dating app users swap.\n We&#39;ve reached out to Google for more information behind the ban and the precise logic that targets sugar-dating apps while ignoring other potentially sexualized dating apps. But, in the meantime,  starting on September 1st, sugar people of all types will have to either stick to websites or sideload their sugar-dating apps — this is Android, you can still get your apps from wherever, unlike iPhones.", "posttime": "2021-07-29 22:12:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,谷歌,google,应用程序,apps", "title": "谷歌更新 Play 商店政策，禁止提供“有偿性关系”的应用程序，这可能会影响糖爹约会应用程序，从 9 月 1 日开始", "title_en": "Google updates Play Store policies to ban apps offering “compensated sexual relationships”, likely impacting sugar daddy dating apps, beginning September 1", "transed": 1, "url": "https://www.androidpolice.com/2021/07/28/google-bans-sugar-daddy-apps-from-play-store/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["程序", "谷歌", "google", "应用程序", "apps"]}, {"category": "", "categoryclass": "", "imagename": "581893b0445556a15496066b38deb6bf.jpeg", "infoid": 1070297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使命召唤和守望先锋发行商动视暴雪的员工兑现了昨天的罢工威胁，今天约有 200 名员工在暴雪位于加利福尼亚尔湾的主要总部前抗议。抗议发生在暴雪园区外，刚走出办公室的员工举着标语。 “不负责任的企业官僚正在将最好的员工赶出动视暴雪，”一个标志说。在加利福尼亚州提起诉讼，指控“兄弟会男孩”内部文化经常剥削和针对女性和有色人种之后，公司经历了一周的动荡之后，这一时刻是最新的升级。这起诉讼激怒了该公司的员工，并引发了有关游戏公司状况的最新全行业讨论。罢工的前一天晚上，动视暴雪首席执行官鲍比·科蒂克（Bobby Kotick）——这位首席执行官最近获得了 1.55 亿美元的奖金，这位首席执行官在 2018 年公开吹嘘公司“历史上最好的”财务业绩，同时解雇了 800 名员工——发表声明称该公司对诉讼的回应“充耳不闻”。 “我想承认并感谢过去和最近几天挺身而出的所有人，”科蒂克在声明中说。 “我非常欣赏你的勇气。每一个声音都很重要——我们现在和将来都会做得更好。” Kotick 宣布将聘请律师事务所 WilmerHale 来“对我们的政策和程序进行审查”，并将员工指向 WilmerHale 的联系人，以提出“您认为违反我们的政策或以任何方式让您在工作场所感到不舒服的经历” .”它还含糊地承诺了“员工支持”、“倾听会议”、“人事变动”、承诺招聘更多样化的候选人，以及对动视暴雪发布的各种游戏中的“不当”内容进行更改。然而，科蒂克没有承诺的是满足罢工的许多不同和具体要求，包括终止雇佣合同中的强制性仲裁条款。\n“虽然我们很高兴看到我们的集体声音——包括一封有数千名现任员工签名的公开信——说服领导层改变他们沟通的基调，但这种回应未能解决员工关注的核心问题，”阅读正在进行的罢工背后的组织者的声明。具体来说，组织者希望员工参与挑选审计动视暴雪和“监督招聘和晋升政策”的第三方。他们的论点是，将这些决定留给公司是导致这一紧张时刻的首要原因。声明继续说：“这是一项持久运动的开始，旨在为所有员工，尤其是女性，尤其是有色人种和跨性别女性、非二元性人群和其他边缘化群体提供更好的劳动条件。”动视暴雪作为一家公司，在这场动荡中一直相当安静。魔兽世界的官方推特账号确实发表了一份声明，支持“为确保我们提供一个包容、热情和安全的环境所必需的行动”。", "note_en": "Employees at Call of Duty and  Overwatch publisher Activision Blizzard made good on  yesterday&#39;s threat to stage a walkout today, with around 200 workers protesting in front of Blizzard&#39;s main headquarters in Irvine, California.\n  The protest took place right outside Blizzard&#39;s campus, where employees who had just walked out of the office held up signs. “Unaccountable corporate bureaucrats   are driving the best employees out of Activision Blizzard,” one sign said.\n    This moment was the latest escalation after a week of turmoil at the company, following a lawsuit by the state of California alleging a &#34;frat boy&#34; internal culture  that routinely exploited and targeted women and people of color. The lawsuit has roiled the company&#39;s employees, and set off the latest industry-wide conversation about the conditions at game companies.\n   The night before the walkout, Activision Blizzard CEO Bobby Kotick—the same CEO who  recently pocketed a $155 million payout, and the same CEO who, in 2018, openly bragged about the company&#39;s &#34;best in our history&#34; financial results  while laying off 800 employees—issued a statement calling the company&#39;s response to the lawsuit &#34;tone deaf.&#34;\n  &#34;I want to recognize and thank all those who have come forward in the past and in recent days,&#34; said Kotick in the statement. &#34;I so appreciate your courage. Every voice matters—and we will do a better job of listening now, and in the future.&#34;\n    Kotick announced it would hire the law firm WilmerHale to &#34;conduct a review of our policies and procedures&#34; and pointed employees towards a contact at WilmerHale to come forward with experiences &#34;you believe violates our policies or in any way made you feel uncomfortable in the workplace.&#34; It also, vaguely, promised &#34;employee support,&#34; &#34;listening sessions,&#34; &#34;personnel changes,&#34; a promise to have more diverse hiring candidates, and changes to &#34;inappropriate&#34; content in various games published by Activision Blizzard.\n  What Kotick did not promise, however, was to make good on many of the walkout&#39;s various and specific demands, including ending mandatory arbitration clauses in hiring contracts.\n    &#34;While we are pleased to see that our collective voices—including an open letter with thousands of signatures from current employees—have convinced leadership to change the tone of their communications, this response fails to address critical elements at the heart of employee concerns,&#34; reads a statement from the organizers behind the ongoing walkout.\n   Specifically, the organizers want employees to be part of picking the third-party who audits Activision Blizzard and &#34;oversight in hiring and promotion policies.&#34; Their argument is that leaving those decisions to the company is what led to this tense moment in the first place.\n  &#34;This is the beginning of an enduring movement in favor of better labor conditions for all employees, especially women, in particular women of color and transgender women, nonbinary people, and other marginalized groups,&#34; continued the statement.\n  Activision Blizzard, as a company, has otherwise been fairly quiet, amidst this turmoil. The  official Twitter account for World of Warcraft did issue a statement supporting &#34;the actions necessary to ensure we are providing an inclusive, welcoming, and safe environment.&#34;", "posttime": "2021-07-29 22:12:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "员工,staff", "title": "动视暴雪员工罢工，要求更公平地对待代表性不足的员工，并终止员工合同中的仲裁条款", "title_en": "Activision Blizzard staffers stage a walkout, demanding fairer treatment for underrepresented staff and an end to arbitration clauses in staff contracts", "transed": 1, "url": "https://www.vice.com/en/article/qj8npd/activision-blizzard-employees-are-walking-out-in-protest-of-exploitative-work-conditions", "via": "", "real_tags": ["员工", "staff"]}, {"category": "", "categoryclass": "", "imagename": "90ae964e8ed98c6ac3e89cb692657bad.jpeg", "infoid": 1070296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司周三表示，Facebook 将要求返回办公室的美国员工接种疫苗。谷歌周三早些时候表示，它还将要求返回办公室的员工接种疫苗。该公司周三表示，Facebook 将要求返回办公室的美国员工接种疫苗。 “随着我们的办公室重新开放，我们将要求任何来我们美国校园工作的人都必须接种疫苗，” People 副总裁 Lori Goler 在一份声明中说。 “我们如何实施这项政策将取决于当地的条件和法规。” Goler 说，Facebook 将为那些因医疗或其他原因无法接种疫苗的人制定流程。 Goler 补充说，该公司将继续评估其在美国以外的方法。 Facebook 已经告诉全职员工，如果他们的工作可以远程完成，他们中的大多数人可以在大流行之后继续在家工作。这一消息是在谷歌首席执行官桑达尔·皮查伊当天早些时候告诉员工的，谷歌将其重返办公室计划推迟一个月，理由是快速传播的三角洲变体。皮查伊还表示，返回的工人必须接种疫苗。\n苹果公司早些时候推迟了重返办公室的计划，尽管它尚未公开要求员工接种疫苗。一位知情人士告诉 CNBC 的 Josh Lipton，从周四开始，无论是否接种疫苗，该公司都将要求客户和员工在其许多美国零售店戴口罩。尽管几周前雇主强制要求的疫苗要求似乎很少见，但 delta 变体的兴起和疾病控制与预防中心的新指南似乎在改变一些高管的想法方面发挥了作用。周二，美国疾病控制与预防中心 (CDC) 撤回了早先对已接种疫苗的人的口罩指南，称他们应该再次在室内 Covid-19 传播率高的地方戴口罩。 CDC 主任罗谢尔·瓦伦斯基 (Rochelle Walensky) 表示，这一变化是由于有关 delta 变体的新信息，表明一些被该菌株感染的接种疫苗的人可能会继续将其传播给其他人。", "note_en": "Facebook will require U.S. workers returning to its offices to be vaccinated, the company said on Wednesday.\n  Google said earlier Wednesday it would also require vaccinations for workers returning to the office.\n Facebook will require U.S. workers returning to its offices to be vaccinated, the company said on Wednesday.\n &#34;As our offices reopen, we will be requiring anyone coming to work at any of our US campuses to be vaccinated,&#34; VP of People Lori Goler said in a statement. &#34;How we implement this policy will depend on local conditions and regulations.&#34;\n  Facebook will create processes for those who can&#39;t be vaccinated for medical or other reasons, Goler said. The company will continue to evaluate its approach outside the U.S., Goler added.\n Facebook had already told full-time employees that most of them could  continue working from home beyond the pandemic if their jobs could be done remotely.\n The news comes after  Google CEO Sundar Pichai  told employees earlier the same day that  Google would delay its return to office plans by one month, citing the fast-spreading delta variant. Pichai also said returning workers would have to be vaccinated.\n Apple earlier delayed its return to office plans, though it has not come out publicly with a vaccine requirement for workers. The company will  require customers and staff to wear masks in many of its U.S. retail stores regardless of vaccination status beginning on Thursday, a person familiar with the matter told CNBC&#39;s Josh Lipton.\n Though employer-mandated vaccine requirements seemed rare just a few weeks ago, the rise of the delta variant and  new guidance from the Centers for Disease Control and Prevention seem to have played a role in shifting some executives&#39; thinking.\n  On Tuesday, the CDC walked back its earlier mask guidance for fully vaccinated people, saying that they should again wear masks indoors in  places with high Covid-19 transmission rates. CDC Director Rochelle Walensky said the change was due to new information on the delta variant, showing that some vaccinated people infected by the strain could continue to spread it to others.", "posttime": "2021-07-29 22:12:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,美国,疫苗,vaccine,员工", "title": "Facebook 表示将要求其美国员工在今年秋季返回办公室之前接种疫苗，并将解决医疗或其他疫苗豁免问题", "title_en": "Facebook says it will require its US staff be vaccinated before returning to offices this fall, and will work around medical or other vaccine exemptions", "transed": 1, "url": "https://www.cnbc.com/2021/07/28/facebook-requiring-us-employees-to-be-vaccinated-to-return-to-work.html", "via": "", "real_tags": ["facebook", "美国", "疫苗", "vaccine", "员工"]}, {"category": "", "categoryclass": "", "imagename": "2933e0ad31952070a5b377fb254b1692.jpg", "infoid": 1070295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位发言人说，该决定是“在仔细考虑了 CDC 的更新指南后，并根据当前情况”做出的。 “Twitter 已决定关闭我们在纽约和旧金山开设的办事处，并暂停未来的办事处重新开业，立即生效。我们将继续密切关注当地情况，并做出必要的改变，优先考虑我们 Tweeps 的健康和安全，”发言人补充说。该公司最初于 7 月 12 日重新开放了这些办公室。它拒绝透露每个办公室的人数。由于担心具有高度传染性的 Delta 变体，CDC 本周建议完全接种疫苗的人在 Covid 传播率高的地方再次开始在室内戴口罩。在给 TechCrunch 的消息中，Facebook 的人脉副总裁 Lori Goler 确认了针对社交媒体巨头的类似政策。亚马逊还回应了 TechCrunch 对此事的询问，并指出：“我们强烈鼓励亚马逊员工和承包商在获得 COVID-19 疫苗后立即接种疫苗。”", "note_en": "The decision came “after careful consideration of the CDC’s updated guidelines, and in light of current conditions,” a spokesperson said.\n “Twitter has made the decision to close our opened offices in New York and San Francisco as well as pause future office reopenings, effective immediately. We’re continuing to closely monitor local conditions and make necessary changes that prioritize the health and safety of our Tweeps,” the spokesperson added.\n  The company initially just reopened those offices on July 12. It declined to reveal headcount per office.\n The CDC this week  recommended that fully vaccinated people begin wearing masks indoors again in places with high Covid transmission rates amid concerns about the highly contagious Delta variant.\n  In a message to TechCrunch, Facebook’s VP of People, Lori Goler,  confirmed a similar policy for the social media behemoth.\n Amazon also responded to TechCrunch’s inquiry on the matter, noting, “We strongly encourage Amazon employees and contractors to be vaccinated as soon as COVID-19 vaccines are available to them.”", "posttime": "2021-07-29 22:11:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旧金山,纽约,closes,考虑", "title": "Twitter 在重新开放两周后关闭其纽约和旧金山办事处，并在“考虑了 CDC 的更新指南”后暂停了进一步的办公室重新开放", "title_en": "Twitter closes its NY and SF offices, two weeks after reopening, and pauses further office reopenings, after “consideration of the CDC's updated guidelines”", "transed": 1, "url": "https://techcrunch.com/2021/07/28/twitter-shuttering-ny-sf-offices-in-response-to-new-cdc-guidelines/", "via": "", "real_tags": ["旧金山", "纽约", "closes", "考虑"]}, {"category": "", "categoryclass": "", "imagename": "4ed3b248a224a19a08561de94c919e83.jpeg", "infoid": 1070293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook 用户花更多的时间观看视频，像 Instagram Reels 这样的短视频正在快速增长。在公司第二季度财报电话会议上，首席执行官马克·扎克伯格 (Mark Zuckerberg) 表示，“视频现在几乎占 Facebook 上所有时间的一半。”在 Instagram 上，TikTok 的竞争对手 Reels 是“参与度增长的最大贡献者”。尽管他没有分享更具体的统计数据，但新的细节表明，随着公司争夺创作者人才，Instagram 的 Reels 可能会获得更多关注。扎克伯格还指出，该公司对创作者和购物的关注也将有助于其实现成为“元节公司”的长期目标。 Facebook 本周早些时候透露，它正在聘请一位 Instagram 高管来组建一个专注于创建元宇宙的新团队。扎克伯格说：“你可以把它想象成一个你身处其中的实体互联网，而不仅仅是看着。” “你基本上可以做今天在互联网上能做的一切，以及一些今天在互联网上没有意义的事情，比如跳舞。”扎克伯格发表上述言论之际，该公司报告了多年来最强劲的增长，收入超过 290 亿美元，比去年增长 56%。该公司还报告称，“每月活跃人数”超过 35 亿，尽管美国的用户增长再次持平。尽管本季度数据强劲，但该公司警告称，2021 年剩余时间可能会大不相同。首席财务官戴夫·韦纳 (Dave Wehner) 表示，Facebook 预计下半年的收入和增长将“显着放缓”。他还指出，苹果的 iOS 14.5 更新允许用户选择退出社交网络的广告跟踪，这将在下个季度产生“更大的影响”。 Engadget 推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果您通过这些链接之一购买商品，我们可能会赚取会员佣金。由于您的隐私偏好，此内容不可用。在此处更新您的设置，然后重新加载页面以查看它。", "note_en": "Facebook users are spending a lot more time watching video, and short-form video like Instagram Reels is growing fast. Speaking during the company’s second-quarter earnings call, CEO Mark Zuckerberg said that “video now accounts for almost half of all time spent on Facebook.” And on Instagram, TikTok competitor Reels is the “largest contributor to engagement growth.”\n Though he stopped short of sharing more specific stats, the new details suggest Instagram’s Reels may be gaining more traction as the company vies  for creator talent. Zuckerberg also noted that the company’s focus on creators and shopping would also help it reach its longer term goal of becoming a “metaverse company.”\n  Facebook revealed earlier this week that it was tapping an Instagram exec to start a new team focused on creating a metaverse. “You can kind of think about this as an embodied internet that you&#39;re inside of rather than just looking at,” Zuckerberg said. “You&#39;re basically gonna be able to do everything that you can on the internet today, as well as some things that don&#39;t make sense on the internet today like dancing.”\n Zuckerberg’s comments come as the company reported some of its strongest growth in years, with revenue of more than $29 billion, an increase of 56 percent from last year. The company also reported more than 3.5 billion “monthly active people,” though user growth in the US once again remained flat.\n Despite the strong numbers this quarter, the company warned that the rest of 2021 could look very different. Facebook expects revenue and growth to “decelerate significantly” in the second half of the year, said CFO Dave Wehner. He also noted that Apple’s iOS 14.5 update, which allows users to opt out of the social network’s ad tracking, would have a “greater impact” next quarter.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2021-07-29 22:10:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,参与度,zuckerberg", "title": "马克扎克伯格表示，视频现在几乎占 Facebook 用户使用时间的一半，而 Reels 是“参与度增长的最大贡献者”", "title_en": "Mark Zuckerberg says video now accounts for almost half the time spent on Facebook, and that Reels is the “largest contributor to engagement growth”", "transed": 1, "url": "https://www.engadget.com/facebook-q2-2021-earnings-214311750.html", "via": "", "real_tags": ["facebook", "参与度"]}, {"category": "", "categoryclass": "", "imagename": "b159a01484d6ef1e83dc4242ade5f5aa.jpeg", "infoid": 1070291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook 股价在周三盘后交易中下跌了 5%，此前这家社交媒体公司呼吁未来几个季度的收入增长放缓，尽管第二季度业绩超出预期。收益：根据 Refinitiv 的数据，调整后每股收益为 3.61 美元，而分析师预期为每股 3.03 美元。根据 StreetAccount 的数据，每日活跃用户 (DAU)：19.1 亿，而分析师预期为 19.1 亿。 StreetAccount 的数据显示，每月活跃用户 (MAU)：29.0 亿，而分析师预期为 29.1 亿。 StreetAccount 的数据显示，每位用户的平均收入 (ARPU)：10.12 美元，而分析师预期为 9.66 美元。根据一份声明，Facebook 第二季度的收入同比增长 56%。这是自 2016 年以来最快的增长，高于上一季度 48% 的增长。该公司指出，每条广告的平均价格上涨了 47%，投放的广告数量增加了 6%。 Facebook 其他部门（包括 Oculus 虚拟现实耳机等消费硬件）的收入总计 4.97 亿美元，增长 36%，低于 StreetAccount 普遍预期的 6.855 亿美元。\n该公司 85.1 亿美元的自由现金流低于 StreetAccount 共识的 90.8 亿美元。关于下半年的指导，Facebook 表示，它预计“随着我们处于增长日益强劲的时期，同比总收入增长率将连续显着放缓。”这实际上与 Facebook 三个月前的指导没有变化。 Refinitiv 调查的分析师此前预计第三季度收入为 282.2 亿美元，这意味着增长 31%。 Facebook 在第二季度表示，其应用系列的月用户数为 35.1 亿，高于第一季度的 34.5 亿。该指标用于衡量 Facebook 在其主要应用、Instagram、Messenger 和 WhatsApp 上的总用户群。在美国和加拿大，Facebook 的每用户平均收入高于其他地区，该公司报告的每日活跃用户为 1.95 亿，与第一季度相同。在欧洲，这一数字从第一季度的 3.09 亿连续下降至 3.07 亿。在与分析师的电话会议上，首席执行官马克扎克伯格谈到了公司帮助开发元宇宙的目标，他将其描述为“一个虚拟环境，您可以在其中与数字空间中的人一起出现”。这些评论是在 Facebook 宣布组建一个将在元宇宙上工作的团队后两天发表的。 “在未来几年，我预计人们将从主要将我们视为一家社交媒体公司转变为将我们视为一家元界公司，”扎克伯格说。他说，广告可能是元宇宙的一个有意义的部分，Facebook 的目标不会是高价销售设备。扎克伯格对元宇宙的愿景需要在虚拟世界中的存在感，这就是该公司大力投资其 Oculus 部门以构建必要硬件的原因。扎克伯格表示，他认为 Facebook 也将能够通过销售数字商品和体验从元宇宙中赚钱。\nFacebook 在周三的声明中表示，它仍预计“2021 年监管和平台变化，尤其是最近的 iOS 更新，会增加广告定位的阻力。” Snap 和 Twitter 已经解决了 Apple iOS 14.5 更新的挑战，这让人们可以更好地控制想要跟踪他们的应用程序，而不会遇到太多麻烦。两家公司都警告说，iOS 14.5 的长期影响仍有待观察，但到目前为止，早期回报是有希望的。 Facebook 财务主管大卫·韦纳 (David Wehner) 表示，该公司预计第三季度 iOS 14.5 的影响将大于第二季度。 Wehner 说，选择加入的程度符合 Facebook 的预期。 “我们还没有完全推出这些变化，但第三季度或多或少会对那些有意义的推出产生影响，”他说。 Facebook 在本季度还与华盛顿发生了一些摩擦。联邦法院驳回了联邦贸易委员会针对该公司的反垄断投诉，以及 48 位州检察长提起的单独案件。美国联邦贸易委员会必须在 8 月 19 日之前更改其投诉，并且各州周三表示将反对法院的决定。然而，本月早些时候，Facebook 受到拜登政府的审查，当时白宫指责这家社交媒体公司没有采取足够的措施来打击其服务上的错误信息，这些信息阻止人们接种 Covid-19 疫苗。有一次，乔·拜登总统对 Facebook 上的错误信息表示“他们在杀人”。另外，Facebook 的人事副总裁 Lori Goler 表示，该公司将要求员工在进入其美国办事处之前接种疫苗。截至周三收盘，Facebook 股价自年初以来上涨了 37%。同期标准普尔 500 指数上涨了 17%。", "note_en": "Facebook shares fell as much as 5% in extended trading on Wednesday after the social media company called for revenue growth to slow in the quarters ahead, even as second-quarter results came in ahead of estimates.\n  Earnings: $3.61  per share, adjusted, vs. $3.03 per share as expected by analysts, according to Refinitiv.\n  Daily active users (DAUs): 1.91 billion, vs. 1.91 billion as expected by analysts, according to StreetAccount.\n Monthly active users (MAUs): 2.90 billion, vs. 2.91 billion as expected by analysts, according to StreetAccount.\n Average revenue per user (ARPU): $10.12, vs. $9.66 as expected by analysts, according to StreetAccount.\n  Facebook&#39;s revenue grew by 56% year over year in the second quarter, according to a  statement. It&#39;s the fastest growth since 2016, accelerating from a 48% increase in  the prior quarter. The company pointed to a 47% rise in average price per ad, along with a 6% increase in the number of ads it delivered.\n Revenue from Facebook&#39;s Other segment, including consumer hardware such as Oculus virtual reality headsets, totaled $497 million, up 36% and less than the $685.5 million StreetAccount consensus estimate.\n The company&#39;s free cash flow of $8.51 billion fell short of the $9.08 billion StreetAccount consensus.\n  With respect to guidance for the second half of the year, Facebook said it expects &#34;year-over-year total revenue growth rates to decelerate significantly on a sequential basis as we lap periods of increasingly strong growth.&#34; That&#39;s effectively unchanged from  Facebook&#39;s guidance three months earlier. Analysts polled by Refinitiv had expected $28.22 billion in revenue for the third quarter, which implies 31% growth.\n Facebook said in the second quarter it had 3.51 billion monthly users across its family of apps, up from 3.45 billion in the first quarter. This metric is used to measure Facebook&#39;s total user base across its main app, Instagram, Messenger and WhatsApp.\n  In the U.S. and Canada, where Facebook generates more average revenue per user than in other regions, the company reported 195 million daily active users, the same as in the first quarter. In Europe the count declined sequentially to 307 million from 309 million in the first quarter.\n During a conference call with analysts, CEO Mark Zuckerberg talked about the company&#39;s goal to help develop the metaverse, which he described as &#34;a virtual environment where you can be present with people in digital spaces.&#34;\n The comments came two days after Facebook  announced the formation of a team that would work on the metaverse.\n &#34;In the coming years, I expect people will transition from seeing us primarily as a social-media company to seeing us as a metaverse company,&#34; Zuckerberg said. Advertising will probably be a meaningful part of the metaverse, and Facebook&#39;s goal won&#39;t be to sell devices at a high premium, he said. Zuckerberg&#39;s vision for the metaverse requires a sense of presence in a virtual world, which is why the company is investing heavily in its Oculus division to build the necessary hardware. Zuckerberg said he thinks Facebook will also be able to make money from the metaverse through the sale of digital goods and experiences.\n  Facebook said in Wednesday&#39;s statement that it still expects &#34;increased ad targeting headwinds in 2021 from regulatory and platform changes, notably the recent iOS updates.&#34;  Snap and  Twitter have  navigated the challenges of  Apple&#39;s iOS 14.5 update, which  gives people more control over apps that want to track them,  without much trouble. Both companies did warn that the long-term impacts of iOS 14.5 remain to be seen, but so far, the early returns have been promising.\n David Wehner, Facebook&#39;s finance chief, said the company expects a larger impact from iOS 14.5 in the third quarter than in the second quarter. The degree of opting in is in line with Facebook&#39;s expectations, Wehner said.\n &#34;We&#39;re not fully rolled out with those changes, but Q3 will have the impact more or less of those meaningfully rolled out,&#34; he said.\n Facebook also had some run-ins with Washington during the quarter. A federal court  dismissed an antitrust complaint from the Federal Trade Commission against the company, along with a separate case brought by 48 state attorneys general. The FTC has until Aug. 19 to change its complaint, and the group of states said Wednesday it will  fight the court&#39;s decision.\n However, Facebook came under the scrutiny of the Biden administration earlier this month when the White House scolded the social media company for  not doing enough to combat misinformation on its services that discourage people from taking Covid-19 vaccines. At one point, President  Joe Biden said &#34; they&#39;re killing people&#34; in regard to misinformation on Facebook.\n Separately, Facebook&#39;s vice president of people, Lori Goler,  said the company will require employees to be vaccinated before entering its U.S. offices.\n As of Wednesday&#39;s close, Facebook shares were up 37% since the start of the year. The S&amp;P 500 index has risen 17% over the same period.", "posttime": "2021-07-29 22:10:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,美国全国广播公司,cnbc,facebook", "title": "美国全国广播公司财经频道", "title_en": "CNBC", "transed": 1, "url": "https://www.cnbc.com/2021/07/28/facebook-fb-earnings-q2-2021.html", "via": "", "real_tags": ["美国", "美国全国广播公司", "cnbc", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州门洛帕克，2021 年 7 月 28 日/美通社/ -- Facebook, Inc.（纳斯达克股票代码：FB）今天公布了截至 2021 年 6 月 30 日的季度财务业绩。“随着我们继续帮助企业发展，我们的季度表现强劲人们保持联系，”Facebook 创始人兼首席执行官马克·扎克伯格 (Mark Zuckerberg) 说。 “我很高兴看到我们围绕创作者和社区、商业和构建下一个计算平台的主要举措聚集在一起，开始将 Metaverse 的愿景变为现实。” Facebook 每日活跃用户 (DAU) – 2021 年 6 月的平均 DAU 为 19.1 亿，同比增长 7%。 Facebook 月活跃用户 (MAU) – 截至 2021 年 6 月 30 日，MAU 为 29 亿，同比增长 7%。家庭日常活跃人数 (DAP) – 2021 年 6 月，DAP 平均为 27.6 亿，同比增长 12%。家庭月活跃人数 (MAP) – 截至 2021 年 6 月 30 日，MAP 为 35.1 亿，同比增长 12%。资本支出——包括融资租赁本金在内的 2021 年第二季度的资本支出为 47.4 亿美元。\n现金和现金等价物和有价证券——截至 2021 年 6 月 30 日，现金和现金等价物和有价证券为 640.8 亿美元。 员工人数——截至 2021 年 6 月 30 日，员工人数为 63,404 人，同比增长 21%。 2021 年第二季度的广告收入增长是由每条广告的平均价格同比增长 47% 和投放的广告数量增长 6% 推动的。与第二季度类似，我们预计广告收入增长将主要由 2021 年剩余时间的广告价格同比上涨推动。在 2021 年第三和第四季度，我们预计总收入将同比增长随着我们经历越来越强劲的增长时期，利率将在连续的基础上显着下降。在查看两年的增长以排除 COVID-19 复苏的影响时，我们预计与第二季度的增长率相比，2021 年下半年的同比总收入增长将小幅放缓。我们继续预计 2021 年由于监管和平台变化，特别是最近的 iOS 更新，广告定位的阻力会增加，我们预计与第二季度相比，第三季度的影响更大。这已被纳入我们的展望。正如最近的财报电话会议所指出的那样，我们将继续监控有关跨大西洋数据传输可行性及其对我们欧洲业务的潜在影响的发展。我们预计 2021 年的总支出将在 70-730 亿美元之间，与我们之前的预期持平。费用的同比增长主要是由对技术和产品人才、基础设施和消费硬件相关成本的投资推动的。我们的费用前景反映了我们在产品组合中看到的引人注目的长期增长机会之前进行投资的承诺。\n我们预计 2021 年的资本支出将在 19-210 亿美元之间，与我们之前的估计持平。我们的资本支出主要由我们对数据中心、服务器、网络基础设施和办公设施的投资驱动。 Facebook 将于今天太平洋时间下午 2 点/美国东部时间下午 5 点召开电话会议，讨论结果。 Facebook 财报电话会议的实时网络广播可以在 Investor.fb.com 上访问，以及财报新闻稿、财务表格和幻灯片演示。 Facebook 使用 Investor.fb.com 和 about.fb.com/news/ 网站以及马克·扎克伯格的 Facebook 页面 (https://www.facebook.com/zuck) 和 Instagram 帐户 (https://www.instagram。 com/zuck) 作为披露重要非公开信息和遵守法规 FD 规定的披露义务的手段。通话结束后，将在同一网站上提供重播。电话会议结束后一周内将提供电话重播，电话 +1 (402) 977-9140 或 +1 (800) 633-8284，会议 ID 21995877。今天与出版股票研究分析师举行的电话会议的记录也将发布到investor.fb.com网站。 Facebook 成立于 2004 年，其使命是赋予人们建设社区的力量，让世界更紧密地联系在一起。人们使用 Facebook 的应用程序和技术与朋友和家人联系、寻找社区和发展业务。本新闻稿包含有关我们未来业务计划和预期的前瞻性陈述。这些前瞻性陈述只是预测，由于多种因素，可能与实际结果存在重大差异，包括： COVID-19 大流行对我们的业务和财务结果的影响；我们保留或提高用户和参与度的能力；我们对广告收入的依赖；我们对数据信号和移动操作系统、网络和我们无法控制的标准的依赖；与新产品和现有产品变更以及其他新业务计划相关的风险；我们强调社区发展和参与以及用户体验而不是短期财务结果；维护和提升我们的品牌和声誉；我们正在进行的隐私、安全、安保和内容审查工作；竞赛;与可能限制访问我们的产品或损害我们在某些国家/地区销售广告的能力的政府行为相关的风险；诉讼和政府调查；隐私和监管问题；与收购相关的风险；安全漏洞；以及我们管理增长和地理分散运营的能力。这些和其他可能导致实际结果与预测结果不同的潜在风险和不确定性在我们于 2021 年 4 月 29 日向美国证券交易委员会提交的 10-Q 表格季度报告中的“风险因素”标题下进行了更详细的说明，该报告是可在我们的投资者关系网站 Investor.fb.com 和美国证券交易委员会网站 www.sec.gov 上获得。其他信息也将在我们截至 2021 年 6 月 30 日的季度的 10-Q 表季度报告中列出。此外，请注意，本新闻稿的发布日期为 2021 年 7 月 28 日，其中包含的任何前瞻性陈述此处基于我们认为截至该日期合理的假设。我们不承担因新信息或未来事件而更新这些声明的义务。为了补充我们根据美国公认会计原则 (GAAP) 编制和呈报的简明合并财务报表，我们使用以下非 GAAP 财务指标：不包括外汇影响的收入、不包括外汇影响的广告收入和自由现金流。这些财务指标的列报不应被单独考虑，也不能替代或优于根据 GAAP 编制和列报的财务信息。提醒投资者注意，使用非 GAAP 财务指标作为分析工具存在重大限制。此外，这些指标可能与其他公司使用的非 GAAP 财务指标不同，限制了它们用于比较目的的实用性。我们通过提供有关从这些非 GAAP 财务指标中排除的 GAAP 金额的具体信息来补偿这些限制。\n我们相信这些非 GAAP 财务指标为投资者提供了有关我们业务财务业绩的有用补充信息，能够在某些项目可能独立于业务业绩而变化的时期之间比较财务业绩，并允许在使用的关键指标方面提高透明度由管理层经营我们的业务。外汇对收入的影响。我们使用美元以外的结算或结算货币的上一年月度汇率换算了截至 2021 年 6 月 30 日的三个月和六个月的收入，我们认为这是一个有用的指标，有助于与我们的历史业绩进行比较。购买财产和设备；融资租赁的本金付款。我们在计算自由现金流时减去购买的财产和设备以及融资租赁的本金付款，因为我们认为这两项共同代表我们需要采购以支持我们的业务的财产和设备的数量，无论我们是否采购融资租赁的此类财产或设备。我们相信这种方法可以提供有用的补充信息，帮助投资者更好地了解我们业务的潜在趋势。自由现金流并不代表我们可用于可自由支配支出的剩余现金流。有关我们的非 GAAP 财务指标以及 GAAP 与非 GAAP 指标对账的更多信息，请参阅本新闻稿中的“GAAP 与非 GAAP 结果的对账”表。 2020 年第二季度和前六个月的自由现金流反映了 2020 年 4 月支付的 50 亿美元 FTC 结算。", "note_en": "MENLO PARK, Calif., July 28, 2021 /PRNewswire/ -- Facebook, Inc. (Nasdaq: FB) today reported financial results for the quarter ended June 30, 2021.\n  &#34;We had a strong quarter as we continue to help businesses grow and people stay connected,&#34; said Mark Zuckerberg, Facebook founder and CEO. &#34;I&#39;m excited to see our major initiatives around creators and community, commerce, and building the next computing platform coming together to start to bring the vision of the metaverse to life.&#34;\n        Facebook daily active users (DAUs) – DAUs were 1.91 billion on average for June 2021, an increase of 7% year-over-year.\n  Facebook monthly active users (MAUs) – MAUs were 2.90 billion as of June 30, 2021, an increase of 7% year-over-year.\n  Family daily active people (DAP) – DAP was 2.76 billion on average for June 2021, an increase of 12% year-over-year.\n  Family monthly active people (MAP) – MAP was 3.51 billion as of June 30, 2021, an increase of 12% year-over-year.\n  Capital expenditures – Capital expenditures, including principal payments on finance leases, were $4.74 billion for the second quarter of 2021.\n  Cash and cash equivalents and marketable securities – Cash and cash equivalents and marketable securities were $64.08 billion as of June 30, 2021.\n  Headcount – Headcount was 63,404 as of June 30, 2021, an increase of 21% year-over-year.\n    Advertising revenue growth in the second quarter of 2021 was driven by a 47% year-over-year increase in the average price per ad and a 6% increase in the number of ads delivered. Similar to the second quarter, we expect that advertising revenue growth will be driven primarily by year-over-year advertising price increases during the rest of 2021.\n  In the third and fourth quarters of 2021, we expect year-over-year total revenue growth rates to decelerate significantly on a sequential basis as we lap periods of increasingly strong growth. When viewing growth on a two-year basis to exclude the impacts from lapping the COVID-19 recovery, we expect year-over-two-year total revenue growth to decelerate modestly in the second half of 2021 compared to the second quarter growth rate.\n  We continue to expect increased ad targeting headwinds in 2021 from regulatory and platform changes, notably the recent iOS updates, which we expect to have a greater impact in the third quarter compared to the second quarter. This is factored into our outlook.\n  As noted in recent earnings calls, we continue to monitor developments regarding the viability of transatlantic data transfers and their potential impact on our European operations.\n  We expect 2021 total expenses to be in the range of $70-73 billion, unchanged from our prior outlook. The year-over-year growth in expenses is driven primarily by investments in technical and product talent, infrastructure, and consumer hardware-related costs. Our expense outlook reflects our commitment to invest ahead of the compelling long-term growth opportunities we see across our product portfolio.\n  We expect 2021 capital expenditures to be in the range of $19-21 billion, unchanged from our prior estimate. Our capital expenditures are driven primarily by our investments in data centers, servers, network infrastructure, and office facilities.\n      Facebook will host a conference call to discuss the results at 2 p.m. PT / 5 p.m. ET today. The live webcast of Facebook&#39;s earnings conference call can be accessed at  investor.fb.com, along with the earnings press release, financial tables, and slide presentation. Facebook uses the  investor.fb.com and  about.fb.com/news/ websites as well as Mark Zuckerberg&#39;s Facebook Page ( https://www.facebook.com/zuck) and Instagram account ( https://www.instagram.com/zuck) as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD.\n  Following the call, a replay will be available at the same website. A telephonic replay will be available for one week following the conference call at +1 (402) 977-9140 or +1 (800) 633-8284, conference ID 21995877.\n  Transcripts of conference calls with publishing equity research analysts held today will also be posted to the  investor.fb.com website.\n    Founded in 2004, Facebook&#39;s mission is to give people the power to build community and bring the world closer together. People use Facebook&#39;s apps and technologies to connect with friends and family, find communities and grow businesses.\n          This press release contains forward-looking statements regarding our future business plans and expectations. These forward-looking statements are only predictions and may differ materially from actual results due to a variety of factors including: the impact of the COVID-19 pandemic on our business and financial results; our ability to retain or increase users and engagement levels; our reliance on advertising revenue; our dependency on data signals and mobile operating systems, networks, and standards that we do not control; risks associated with new products and changes to existing products as well as other new business initiatives; our emphasis on community growth and engagement and the user experience over short-term financial results; maintaining and enhancing our brand and reputation; our ongoing privacy, safety, security, and content review efforts; competition; risks associated with government actions that could restrict access to our products or impair our ability to sell advertising in certain countries; litigation and government inquiries; privacy and regulatory concerns; risks associated with acquisitions; security breaches; and our ability to manage growth and geographically-dispersed operations. These and other potential risks and uncertainties that could cause actual results to differ from the results predicted are more fully detailed under the caption &#34;Risk Factors&#34; in our Quarterly Report on Form 10-Q filed with the SEC on April 29, 2021, which is available on our Investor Relations website at  investor.fb.com and on the SEC website at  www.sec.gov. Additional information will also be set forth in our Quarterly Report on Form 10-Q for the quarter ended June 30, 2021. In addition, please note that the date of this press release is July 28, 2021, and any forward-looking statements contained herein are based on assumptions that we believe to be reasonable as of this date. We undertake no obligation to update these statements as a result of new information or future events.\n    To supplement our condensed consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (GAAP), we use the following non-GAAP financial measures: revenue excluding foreign exchange effect, advertising revenue excluding foreign exchange effect and free cash flow. The presentation of these financial measures is not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. Investors are cautioned that there are material limitations associated with the use of non-GAAP financial measures as an analytical tool. In addition, these measures may be different from non-GAAP financial measures used by other companies, limiting their usefulness for comparison purposes. We compensate for these limitations by providing specific information regarding the GAAP amounts excluded from these non-GAAP financial measures.\n  We believe these non-GAAP financial measures provide investors with useful supplemental information about the financial performance of our business, enable comparison of financial results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management in operating our business.\n    Foreign exchange effect on revenue. We translated revenue for the three and six months ended June 30, 2021 using the prior year&#39;s monthly exchange rates for our settlement or billing currencies other than the U.S. dollar, which we believe is a useful metric that facilitates comparison to our historical performance.\n  Purchases of property and equipment; Principal payments on finance leases. We subtract both purchases of property and equipment and principal payments on finance leases in our calculation of free cash flow because we believe that these two items collectively represent the amount of property and equipment we need to procure to support our business, regardless of whether we procure such property or equipment with a finance lease. We believe that this methodology can provide useful supplemental information to help investors better understand underlying trends in our business. Free cash flow is not intended to represent our residual cash flow available for discretionary expenditures.\n  For more information on our non-GAAP financial measures and a reconciliation of GAAP to non-GAAP measures, please see the &#34;Reconciliation of GAAP to Non-GAAP Results&#34; table in this press release.\n            Free cash flow in the second quarter and the first six months of 2020 reflects the $5.0 billion FTC settlement that was paid in April 2020.", "posttime": "2021-07-29 22:09:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,员工,revenue,业务", "title": "Facebook 报告第二季度收入为 $29.08B，同比增长 56%，MAU 为 2.9B，同比增长 7%，员工人数为 63,404，同比增长 21%；因收入放缓警告股价下跌约 3%", "title_en": "Facebook reports Q2 revenue of $29.08B, up 56% YoY, MAUs of 2.9B, up 7% YoY, headcount of 63,404, up 21% YoY; stock down ~3% on warning of revenue slowdown", "transed": 1, "url": "https://investor.fb.com/investor-news/press-release-details/2021/Facebook-Reports-Second-Quarter-2021-Results/default.aspx", "via": "", "real_tags": ["facebook", "员工", "revenue", "业务"]}, {"category": "", "categoryclass": "", "imagename": "ed3d7987b7a68c78405d9ab0bfd6d392.png", "infoid": 1070289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用易于使用的 API 和工具在几分钟内构建令人惊叹的实时协作体验 创建出色的创意工具极其困难。用户可以选择成千上万条路径，用户体验的每个方面都必须仔细考虑并优化性能。当您尝试在此基础上添加实时协作时，您可以确保几乎没有时间专注于产品的核心用户体验。这就是我们创建 Liveblocks 的原因，这是一组工具和 API，可帮助您创建令人惊叹的实时协作体验。使用 Liveblocks，您可以在几分钟内进行任何协作，从而使您的核心产品得到应有的关注。在过去十年中，我们的合作方式发生了重大变化。大流行大大加速了向远程工作的转变。现在有数百万人在家工作，不再需要花几个小时通勤到办公室。但随着向远程工作的转变，建立有意义的关系和与人合作变得更加困难。 Buffer 对 2,300 名远程工作者的调查发现，16% 的人表示他们在协作和沟通方面遇到困难，另有 16% 的人表示他们在孤独中挣扎。当我们在同一个物理空间一起工作时，协作会自然地发生在白板前、会议室中，或者只是走到某人的办公桌前。随着越来越多的人开始远程工作，我们开始看到视频会议解决方案，只有通过共享屏幕的低质量图像才能真正实现协作。一个很好的改进，但并不理想。大多数在线表单、仪表板和工具仍需要您刷新页面以查看其他人已更改的内容。当你的互联网连接中断，你有机会打“保存”按钮之前，你知道你刚刚失去了工作时间。\n这是为什么？构建和维护高性能、可靠且可扩展的实时协作基础在技术上是困难的，而且成本极其高昂。只有少数拥有高度专业化工程师的公司能够做到这一点。我们认为，大规模解决远程协作问题的最佳方法是提供世界一流的基础设施，公司可以利用这些基础设施为他们为用户创造的数字体验提供动力。使用 Liveblocks，您可以轻松构建高性能的多人创意工具，使您的表单实时协作，甚至将实时光标添加到您现有的产品中。 Liveblocks 使我们能够在数小时而不是数周内为我们的应用程序添加实时状态，而且我们不必担心维护。对于任何构建协作体验的人来说，这都是轻而易举的事情。为此，我们为您提供了无缝协作的不同构建块：存在块、存储块和评论块。它们的设计考虑了特定的用例，可帮助您以最快的方式创建完全可定制的协作体验。另外，您可以决定使用哪个块，这样您就不会因为不需要的功能而使代码库膨胀。今天，我们很高兴向您介绍我们的第一个构建块：存在块。这非常适合让人们感觉好像他们在同一个房间里一样。只需几行代码，您就可以轻松地将实时光标和实时头像等内容集成到您的产品中。下面是一个示例，展示了我们的 React API 的外观。存在块现在可供所有人使用。存储和评论块目前处于私人测试阶段，并将在今年晚些时候更广泛地提供。\n只需几行代码就可以将实时光标添加到我的网站，这很神奇，而且非常有趣。设置起来非常简单快捷。 Liveblocks 使每个开发人员都可以构建实时体验。使用 Liveblocks 构建不仅可以提高产品的质量和用户体验，还可以帮助公司更快地发货并每年节省数十万美元的开发和维护成本。如果不是开源社区、研究人员以及 Figma 和 Google 等公司铺平了道路并向世界展示了创造令人难以置信的协作体验实际上是可能的，Liveblocks 就不会存在今天。他们都帮助我们取得了今天的成就，对此我们深表感谢。我们非常高兴能够解决这个问题并在完成这一使命中发挥我们的作用。如果这是您想参与的工作，我们正在招聘！请申请并将其发送给您认为愿意为此工作的任何人。", "note_en": "Build amazing real‑time collaborative experiences in minutes with easy‑to‑use APIs and tools\n  Creating great creative tools is extremely difficult. There are thousands of paths a user could take, and every aspect of the user experience has to be carefully considered and optimized for performance. And when you try to add real‑time collaboration on top of that, you can be sure that you’re left with almost no time to focus on the core user experience of your product.\n That’s why we created Liveblocks, a set of tools and APIs that helps you create amazing real‑time collaborative experiences. With Liveblocks, you can make anything collaborative in minutes so that you can give your core product the attention it deserves.\n    The way we work together has gone through a major change in the past decade. The pandemic accelerated the shift to remote work significantly. Millions of people now work from home and no longer have to spend hours commuting to an office.\n But with that shift to remote work, building meaningful relationships and collaborating with people became a lot more difficult.  Buffer’s survey of 2,300 remote workers found that 16% of people reported they had difficulties with collaboration and communication, and another 16% reported they struggled with loneliness.\n  When we all worked together in the same physical space, collaboration would happen naturally in front of a whiteboard, in a meeting room, or simply by walking over to someone’s desk. As more people started working remotely, we then started to see video conferencing solutions where collaboration could only really happen by sharing a low-quality image of your screen. A good improvement, but not ideal.\n Most online forms, dashboards, and tools still require you to refresh the page to see what other people have changed. And when your internet connection drops before you’ve had a chance to hit the &#34;Save&#34; button, you know you’ve just lost hours of work.\n Why is that? Building and maintaining a performant, reliable, and scalable real‑time collaborative foundation is technically difficult and extremely expensive. Only a few companies with highly specialized engineers have been able to pull this off.\n   We believe the best way to solve the remote collaboration problem at scale is by providing a world-class infrastructure that companies can leverage to power the digital experiences they create for their users.\n With Liveblocks, you can easily build a performant multiplayer creative tool, make your forms real‑time collaborative, or even add live cursors to your existing product.\n Liveblocks enabled us to add real‑time presence to our application in hours instead of weeks and we don’t have to worry about maintenance. This is a no‑brainer for anyone building collaborative experiences.\n To do that, we provide you with different building blocks that work seamlessly together: the presence block, the storage block, and the comment block. They’re designed with specific use cases in mind to help you create fully customizable collaborative experiences in the fastest way possible. Plus, you can decide which block to use so you’re not bloating your codebase with features you don’t need.\n  Today, we’re excited to introduce you to our first building block: the presence block. It’s great for making people feel as if they were together in the same room. You can easily integrate things like  real‑time cursors and  live avatars to your product with just a few lines of code. Below is an example showing how our React APIs look like.\n  The presence block is now available for everyone. The storage and comment blocks are currently in private beta and will be available more broadly later this year.\n Adding real‑time cursors to my website with just a few lines of code was magic, and just plain fun. It was so easy and fast to set up. Liveblocks makes building real‑time experiences accessible to every developer.\n Building with Liveblocks not only improves a product’s quality and user experience but also helps companies ship faster and save hundreds of thousands of dollars in development and maintenance costs every year.\n Liveblocks wouldn’t exist today if it wasn’t for the open‑source community, researchers, and companies like Figma and Google who have paved the way and showed the world that creating incredible collaborative experiences was actually possible. They all helped us get to where we are today, and we’re truly thankful for that.\n We couldn’t be more excited to solve this problem and play our part in fulfilling this mission. If this is an endeavor you’d like to be a part of,  we’re hiring! Please apply and send this along to anyone that you think would be jazzed to work on this.", "posttime": "2021-07-29 22:09:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产品,add,协作", "title": "Liveblocks：在几分钟内为您的产品添加实时协作", "title_en": "Liveblocks: Add real‑time collaboration to your product in minutes", "transed": 1, "url": "https://liveblocks.io/blog/introducing-liveblocks", "via": "", "real_tags": ["产品", "add", "协作"]}, {"category": "", "categoryclass": "", "imagename": "832a6c756d867847f0d64d1b0226727e.png", "infoid": 1070288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我一直在探索一种用于发布网站的架构模式，我称之为“烘焙数据”模式。它提供了静态站点生成器的许多优点，同时避免了它们的大部分限制。我认为它值得被更广泛地使用。烘焙数据：将数据的只读副本与应用程序的代码捆绑在一起，作为同一部署的一部分 大多数动态网站将其代码和数据分开：代码在应用程序服务器上运行，数据以某种形式独立存在外部数据存储——比如 PostgreSQL、MySQL 或 MongoDB。使用烘焙数据，数据被部署为应用程序包的一部分。每当内容发生更改时，都会部署包含这些更新的站点的全新副本。为此，我主要使用 SQLite 数据库文件，但许多其他格式也可以在这里使用。这对于所谓的“无服务器”部署平台特别有效——支持无状态部署并且只对用于服务传入请求的资源收费（“缩放到零”）的平台。由于对数据的每次更改都会导致全新部署，因此这种模式不适用于经常更改的站点——但根据我的经验，许多面向内容的站点每天最多更新几次内容。考虑博客、文档网站、项目网站——任何内容由一小群作者编辑的地方。\n主机便宜。任何可以运行应用程序代码的地方都可以托管烘焙数据应用程序——无需为托管数据库系统支付额外费用。将无服务器主机（例如 Cloud Run、Vercel 或 AWS Lambda）扩展到零，每月只需为低流量部署收取几美分的费用。易于扩展。需要处理更多流量？运行应用程序及其捆绑数据的更多副本。水平扩展烘焙数据应用程序是微不足道的。它们也非常适合在 Cloudflare 或 Fastly 等缓存代理 CDN 后面运行——当您部署新版本时，您可以清除整个缓存。很难打破。在 VPS 上托管服务器端应用程序总是令人不安，因为可能出错的地方太多了——服务器可能受到威胁，或者流氓日志文件可能导致磁盘空间不足。对于烘焙数据，最糟糕的情况是您需要重新部署应用程序——完全没有数据丢失的风险，并且可以自动重启代码的提供者可以自动从错误中恢复。支持服务器端功能。静态站点生成器提供了许多上述优点，但存在任何动态功能都需要在客户端 JavaScript 中实现的限制。使用烘焙数据应用程序，您也可以执行服务器端代码。模板化页面。对静态站点生成器的另一个改进：如果您有 10,000 个页面，则静态站点生成器将需要生成 10,000 个 HTML 文件。使用烘焙数据，这 10,000 个页面可以作为单个 SQLite 数据库文件中的行存在，并且可以在运行时使用服务器端模板生成这些页面。易于支持多种格式。由于您的内容位于动态数据存储中，因此以替代格式输出相同的内容很容易。我为此使用了 Datasette 插件：datasette-atom 可以从 SQL 查询生成 Atom 提要，而 datasette-ics 对 iCalendar 提要执行相同的操作。与版本控制很好地集成。我喜欢将我的网站内容置于版本控制之下。烘焙数据模式适用于从 git 存储库读取内容并使用它来构建与部署捆绑在一起的资产的构建脚本。\n我对烘焙数据的最初实现都使用了 SQLite。它是此类应用程序的理想格式：一个二进制文件，可以存储任何可以表示为关系表、JSON 文档或二进制对象的东西——基本上是任何东西。任何可以由您的动态服务器端代码从磁盘读取的格式也可以使用：YAML 或 CSV 文件、Berkeley DB 文件或任何其他可以由磁盘文件中的只读字节存储桶表示的任何格式。 [我有一种预感，你甚至可以使用 PostgreSQL、MySQL 或 Elasticsearch 之类的东西，通过打包它们的磁盘表示并将它们作为 Docker 容器的一部分发送，但我自己还没有尝试过。] 一旦你的数据在文件中可用，您的应用程序代码可以从该文件中读取并使用它来生成和返回网页。您可以使用任何服务器端语言编写执行此操作的代码。我使用 Python，通常与我的 Datasette 应用程序服务器一起使用，它可以从 SQLite 数据库文件中读取并使用 Jinja 模板生成页面。最后一块拼图是构建和部署脚本。我为此使用 GitHub Actions，但任何 CI 工具都可以在这里很好地工作。该脚本将站点内容构建为可部署资产，然后将该资产与应用程序代码一起部署到托管平台。我自己发布的最复杂的 Baked Data 站点是我的 Datasette 项目的官方网站，datasette.io——这个 repo 中的源代码。\n该站点是使用 Cloud Run 部署的。它实际上是一个高度自定义的 Datasette 实例，使用主页的自定义模板、站点其他部分的自定义页面和 datasette-template-sql 插件来执行 SQL 查询并显示来自这些模板的结果。 content.db 包含大部分站点内容。它是通过 build.sh 脚本在 GitHub Actions 中构建的，它执行以下操作：使用 markdown-to-sqlite 将 for/ 文件夹（Datasette 的用例）中的 markdown 文件导入到 uses 表中。使用来自更多 YAML 文件的数据填充 plugin_repos 和 tool_repos 单列表。这些将在下一步中使用。运行 build_directory.py Python 脚本。这使用 GitHub GraphQL API 来获取有关所有这些插件和工具存储库的信息，包括它们的 README 文件和它们最近的标记版本。使用所有 Datasette 生态系统 PyPI 包的最新下载统计信息填充统计表。该数据是从我的 simonw/package-stats 存储库中的 stats.json 文件导入的，该存储库本身由在 GitHub Actions 中运行的这个 git 抓取脚本填充。我也将它用于我的 Datasette Downloads Observable 笔记本。 blog.db 包含来自我的博客的内容，这些内容带有任何数据集、dogsheep 或 sqliteutils 标签。这是由 fetch_blog_content.py 脚本获取的，该脚本为我的博客内容点击分页的每个标签 Atom 提要，在 Django 中实现。 docs-index.db 是一个数据库表，包含最新稳定 Datasette 版本的文档，按部分分解。这个数据库文件是从一个单独的站点 stable-docs.datasette.io 下载的，它是作为 Datasette 发布过程的一部分构建和部署的。\ndogsheep-index.db 是支持站点搜索的搜索索引（例如，此搜索 dogsheep）。搜索索引由 dogsheep-beta 使用从此 YAML 文件配置的其他数据库文件中的表中提取的数据构建。该站点每天通过计划操作自动部署一次，如果我想确保新的软件版本反映在主页上，我也可以手动触发该操作。 Niche Museums 是关于我参观过的小型博物馆的博客。同样，它是带有自定义模板的 Datasette。大部分内容来自这个museums.yaml 文件，但我也运行了一个脚本来确定每个项目是何时从 git 历史记录中创建或更新的。我的 TILs 站点在 Vercel 上运行，并通过此构建脚本（填充此 tils 表）从我的 simonw/til GitHub 存储库构建。它使用 GitHub API 将 GitHub Flavored Markdown 转换为 HTML。我还运行了一个脚本，该脚本生成每个页面的小屏幕截图，并将它们存放在 SQLite 的 BLOB 列中，以提供社交媒体预览卡，请参阅我的 TIL 的社交媒体卡。在一个我自己没有工作过的站点中，我最喜欢的这种模式的例子是 Mozilla.org。他们于 2018 年开始在他们称为 Bedrock 的系统中使用 SQLite——Paul McLanahan 详细描述了其工作原理。他们的网站内容存在于一个约 22MB 的 SQLite 数据库文件中，该文件被构建并上传到 S3，然后定期下载到他们的每个应用程序服务器。\n您可以查看他们的健康检查页面以查看上次下载数据库的时间，并自己获取 SQLite 文件的副本。使用 Datasette 探索这一点很有趣：静态站点生成器在过去十年中大受欢迎。它们将托管站点的成本降低到几乎为零，提供出色的性能，与 CDN 配合良好，并生成极不可能损坏的站点。谨慎使用，烘焙数据保留了大部分这些特征，同时仍然支持服务器端代码执行。 datasette.io 提供 1,588 种不同内容的搜索，以及在插件和工具页面上更简单的搜索。所有三个站点都提供使用服务器端 SQL 查询配置的 Atom 提要：Datasette、Niche Museums、TIL。 Niche Museums 提供了一个“使用我的位置”按钮，然后可以使用利用 datasette-haversine 插件的 SQL 查询为您附近的博物馆提供服务。当用于大型站点时，对静态站点生成器的一个常见抱怨是，如果构建器必须生成数万个页面，则构建时间会变得很长。\n使用烘焙数据，单个模板文件和 SQLite 数据库表中的 10,000 行可以生成 10,000 个页面。这也使得开发过程中的迭代周期更快：您可以编辑模板并点击“刷新”以立即查看新模板呈现的任何页面，而无需重建任何页面。如果您想尝试烘焙数据模式，我建议您开始使用 Datasette、GitHub Actions 和 Vercel 的组合。希望我上面提供的示例是一个很好的起点——如果有任何问题，也可以随时在 Twitter 或 Datasette 讨论论坛上与我联系。", "note_en": "I’ve been exploring an architectural pattern for publishing websites over the past few years that I call the “Baked Data” pattern. It provides many of the advantages of static site generators while avoiding most of their limitations. I think it deserves to be used more widely.\n  Baked Data: bundling a read-only copy of your data alongside the code for your application, as part of the same deployment\n Most dynamic websites keep their code and data separate: the code runs on an application server, the data lives independently in some kind of external data store—something like PostgreSQL, MySQL or MongoDB.\n With Baked Data, the data is deployed as part of the application bundle. Any time the content changes, a fresh copy of the site is deployed that includes those updates.\n I mostly use SQLite database files for this, but plenty of other formats can work here too.\n This works particularly well with so-called “serverless” deployment platforms—platforms that support stateless deployments and only charge for resources spent servicing incoming requests (“scale to zero”).\n Since every change to the data results in a fresh deployment this pattern doesn’t work for sites that change often—but in my experience many content-oriented sites update their content at most a few times a day. Consider blogs, documentation sites, project websites—anything where content is edited by a small group of authors.\n   Inexpensive to host. Anywhere that can run application code can host a Baked Data application—there’s no need to pay extra for a managed database system. Scale to zero serverless hosts such as  Cloud Run,  Vercel or  AWS Lambda will charge only cents per month for low-traffic deployments.\n Easy to scale. Need to handle more traffic? Run more copies of your application and its bundled data. Horizontally scaling Baked Data applications is trivial. They’re also a great fit to run behind a caching proxy CDN such as Cloudflare or Fastly—when you deploy a new version you can purge that entire cache.\n Difficult to break. Hosting server-side applications on a VPS is always disquieting because there’s so much that might go wrong—the server could be compromised, or a rogue log file could cause it to run out of disk space. With Baked Data the worst that can happen is that you need to re-deploy the application—there’s no risk at all of data loss, and providers that can auto-restart code can recover from errors automatically.\n Server-side functionality is supported. Static site generators provide many of the above benefits, but with the limitation that any dynamic functionality needs to happen in client-side JavaScript. With a Baked Data application you can execute server-side code too.\n Templated pages. Another improvement over static site generators: if you have 10,000 pages, a static site generator will need to generate 10,000 HTML files. With Baked Data those 10,000 pages can exist as rows in a single SQLite database file, and the pages can be generated at run-time using a server-side template.\n Easy to support multiple formats. Since your content is in a dynamic data store, outputting that same content in alternative formats is easy. I use Datasette plugins for this:  datasette-atom can produce an Atom feed from a SQL query, and  datasette-ics does the same thing for iCalendar feeds.\n Integrates well with version control. I like to keep my site content under version control. The Baked Data pattern works well with build scripts that read content from a git repository and use it to build assets that are bundled with the deployment.\n  My initial implementations of Baked Data have all used SQLite. It’s an ideal format for this kind of application: a single binary file which can store anything that can be represented as relational tables,  JSON documents or  binary objects—essentially anything at all.\n Any format that can be read from disk by your dynamic server-side code will work too: YAML or CSV files, Berkeley DB files, or anything else that can be represented by a bucket of read-only bytes in a file on disk.\n [I have a hunch that you could even use something like PostgreSQL, MySQL or Elasticsearch by packaging up their on-disk representations and shipping them as part of a Docker container, but I’ve not tried that myself yet.]\n Once your data is available in a file, your application code can read from that file and use it to generate and return web pages.\n You can write code that does this in any server-side language. I use Python, usually with my  Datasette application server which can read from a SQLite database file and use  Jinja templates to generate pages.\n The final piece of the puzzle is a build and deploy script. I use GitHub Actions for this, but any CI tool will work well here. The script builds the site content into a deployable asset, then deploys that asset along with the application code to a hosting platform.\n  The most sophisticated Baked Data site I’ve published myself is the official website for my Datasette project,  datasette.io—source code  in this repo.\n  The site is deployed using Cloud Run. It’s actually a heavily customized Datasette instance, using  a custom template for the homepage,  custom pages for other parts of the site and the  datasette-template-sql plugin to execute SQL queries and display their results from those templates.\n  content.db has most of the site content. It is built inside GitHub Actions by the  build.sh script, which does the following: Import the markdown files from the  for/ folder (use-cases for Datasette) into the  uses table using  markdown-to-sqlite.\n Populate the  plugin_repos and  tool_repos single-column tables using data from more YAML files. These are used in the next step.\n Runs the  build_directory.py Python script. This uses the GitHub GraphQL API to fetch information about all of those plugin and tool repositories, including their README files and their most recent tagged  releases.\n Populates a  stats table with the latest download statistics for all of the Datasette ecosystem PyPI packages. That data is imported from a  stats.json file in my  simonw/package-stats repository, which is itself populated by this  git scraping script that runs in GitHub Actions. I also use this for my  Datasette Downloads Observable notebook.\n blog.db contains content from my blog that carries any of the  datasette,  dogsheep or  sqliteutils tags. This is fetched by the  fetch_blog_content.py script, which hits the paginated per-tag Atom feed for my blog content,  implemented in Django here.\n docs-index.db is a database table containing the documentation for the most recent stable Datasette release, broken up by  sections. This database file is downloaded from a separate site,  stable-docs.datasette.io, which is built and deployed as  part of Datasette’s release process.\n dogsheep-index.db is the search index that powers site search (e.g.  this search for dogsheep). The search index is built by  dogsheep-beta using data pulled from tables in the other database files, as configured by  this YAML file.\n The site is automatically deployed once a day by  a scheduled action, and I can also manually trigger that action if I want to ensure a new software release is reflected on the homepage.\n   Niche Museums is my blog about tiny museums that I’ve visited. Again, it’s Datasette with custom templates. Most of the content comes from this  museums.yaml file, but I also run  a script to figure out when each item was created or updated from the git history.\n My TILs site runs on  Vercel and is built from my  simonw/til GitHub repository by  this build script (populating  this tils table). It uses the GitHub API to convert GitHub Flavored Markdown to HTML. I’m also running  a script that generates small screenshots of each page and stashes them in a BLOB column in SQLite in order to provide social media preview cards, see  Social media cards for my TILs.\n My favourite example of this pattern in a site that I haven’t worked on myself is  Mozilla.org.\n They started using SQLite back in 2018 in a system they call Bedrock—Paul McLanahan provides  a detailed description of how this works.\n Their site content lives in a ~22MB SQLite database file, which is built and uploaded to S3 and then downloaded on a regular basis to each of their application servers.\n You can view  their healthcheck page to see when the database was last downloaded, and grab a copy of the SQLite file yourself. It’s fun to explore that using Datasette:\n   Static site generators have exploded in popularity over the past ten years. They drive the cost of hosting a site down to almost nothing, provide excellent performance, work well with CDNs and produce sites that are extremely unlikely to break.\n Used carefully, the Baked Data keeps most of these characteristics while still enabling server-side code execution.\n  datasette.io  provides search across 1,588 different pieces of content, plus  simpler search on the plugins and tools pages.\n  All three sites provide Atom feeds that are configured using a server-side SQL query:  Datasette,  Niche Museums,  TILs.\n Niche Museums offers a “Use my location” button which then serves  museums near you, using  a SQL query that makes use of the  datasette-haversine plugin.\n A common complaint about static site generators when used for larger sites is that build times can get pretty long if the builder has to generate tens of thousands of pages.\n With Baked Data, 10,000 pages can be generated by a single template file and 10,000 rows in a SQLite database table.\n This also makes for a faster iteration cycle during development: you can edit a template and hit “refresh” to see any page rendered by the new template instantly, without needing to rebuild any pages.\n  If you want to give the Baked Data pattern a try, I recommend starting out using the combination of  Datasette,  GitHub Actions and  Vercel. Hopefully the examples I’ve provided above are a good starting point—also feel free to reach out to me  on Twitter or in  the Datasette Discussions forum with any questions.", "posttime": "2021-07-29 22:08:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,data,datasette", "title": "烘焙数据架构模式", "title_en": "The Baked Data architectural pattern", "transed": 1, "url": "https://simonwillison.net/2021/Jul/28/baked-data/", "via": "", "real_tags": ["数据", "data", "datasette"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "喜欢数组语言 APL、J 和 k/q 的理由有很多！聆听并了解更多信息。阅读更多", "note_en": "There are lots of reasons to like the array languages APL, J and k/q! Listen and find out more.\n Read More", "posttime": "2021-07-29 22:08:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,播客,编程,cast,array", "title": "The Array Cast：关于数组编程语言的播客", "title_en": "The Array Cast: A podcast about the array programming languages", "transed": 1, "url": "https://www.arraycast.com/episodes/", "via": "", "real_tags": ["播客", "编程", "cast", "array"]}, {"category": "", "categoryclass": "", "imagename": "0e2b48fb7f64e905c8766e883336998d.jpg", "infoid": 1070286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在第一次世界大战期间，听证会被重新定义为一种战术活动——一种可以决定人类甚至国家生存的活动。根据第一次世界大战期间美国助理战争部长委托撰写的一份高耸报告的前言“战争的结束：图形记录”，第一次世界大战不是以一声巨响结束，而是如著名诗句中的呜咽声.这张照片在幻灯片上显示了六条水平线，描绘了 1918 年 11 月 11 日上午 11:00 停战前一分钟和后一分钟，摩泽尔河附近美国前线的炮兵活动。左侧描绘停战前一分钟的炮兵活动并显示出一连串锯齿状的线条（“全枪射击”）。在右侧，描绘了停战后一分钟的炮兵活动，只有流畅的线条（“所有枪声”）。 11:01:01 左右两次小幅下跌归因于一个面团男孩为庆祝停火开了两次手枪。除了这些枪声之外，炮兵的活动似乎完全停止了，战场上的枪声顿时变得空荡荡的。 “战争结束”的标题说，这是美国前线炮兵活动的最后记录，图像是从美国测距仪发出的。 “测距，”它写道，“是定位敌方火炮位置和口径的重要手段。”当该图像在《电力杂志》(Journal of Electricity) 上被转载时，有关它的声明甚至更为宏大：“真正的历史在这里是用电写成的！” “战争的终结”是通过第一次世界大战期间发明的众多声学防御方法之一制作的。在战争开始时，声学防御的概念几乎无人知晓。没有一支主要军队拥有通过跟踪敌人发出的声音来跟踪敌人位置的可靠手段。然而，到战争结束时，每个人都开发了新的技术和声音定位技术，通常是为了应对新技术的进攻，并且每个人都在无数场合使用过这些方法——从而产生了新的“声学防御”模式。然而，一种新的进攻武器的出现，并不意味着新的防御方法就容易获得。据皇家海军志愿预备役中校阿尔弗雷德·罗林森 (Alfred Rawlinson) 称，敌人很容易躲在云层后面。防御的枪应该如何击中他们看不到的物体？他说，答案“非常简单——即，虽然我们看不到它，但我们可以听到它。因此，我们不能用眼睛瞄准，如果我们要射击，就不得不用耳朵瞄准。”尽管如此，他写道，“理论无论多么正确，要转化为实践，还有很长的路要走。”直到 20 世纪早期，空间听觉几乎都是从声音物理学或听觉生理学和心理学的角度进行研究的。在战争期间，它被重新塑造为一种从战略角度理解的战术活动——可以决定人类甚至国家的生存。听觉空间感知曾经被认为是视觉空间感知的附属，现在被新理解为一项至关重要的技能，“听觉”突然映射到民族国家的权力上。\n第一次世界大战中使用的第一个声音定位器在很大程度上依赖于“看到”声音的想法。有些是基于视觉技术，并将源自光学科学的原理转移到声学领域。 1916 年，一位法国陆军中尉设计了一种 viseur acoustique（“声学面罩”），这是一种由镜子和指南针组成的手持设备。一名士兵使用该仪器将他的脸在镜子中的反射居中，这样他就可以同样清楚地看到自己的耳朵。罗盘然后大概会给出声音的方向。在英格兰进行了使用试听盘的实验，该技术基于这样一种想法，即当隔音盘面向声源时，声像将在圆盘中心与隔音盘相对的一侧形成。声音。这个想法被提出作为光学中阿拉戈光斑的声学模拟，由于光的波动性，一个亮点出现在圆形物体的阴影中心。虽然诸如声学遮阳板和听音盘之类的技术既不是特别有效也不实用，但作为战争中出现的最持久的声学防御技术之一，Baillaud 抛物面也是基于视觉技术的。尽管历史上有声学反射器的例子，但第一个专门为军事用途设计的抛物面声学反射器是由 René Baillaud 在 1915 年发明的，并具有盘子或碗的形式。 Baillaud 是图卢兹天文台的一位天文学家，他在牛顿望远镜上模拟了他的设备。他的设计基于这样一个前提，即抛物面镜无论是反射光还是反射声音，都必须具有相同的反射特性。在贝约的回忆录中，一系列照片展示了声学抛物面经过大约一年的密集实验的发展。我们发现了越来越大的乐器，直径从 60 厘米到 3 米不等；形状各异，使盘子看起来不像凹盘，而更像深碗；和不同的配置，其中包括四个抛物面堆叠成两排。在最大焦点上使用类似听诊器的设备收听的单个审计员变成了两个审计员，他们串联收听，而每个人都坐在设备的两端，使用手轮旋转盘子。我们还发现引入了自动航向绘图仪，这是一种跟踪审计员运动的成像技术，从而产生飞机轨迹的视觉记录。第一次世界大战的军用飞机产生了几种声音：螺旋桨的节拍声、发动机声音以及空气与运动飞机机身之间的摩擦引起的振动。然而，最响亮且最容易识别的声音是所谓的“排气音”。各种飞机的排气音在 80 赫兹到 130 赫兹之间，虽然这个音调在飞机运动时有所不同，但始终是低频声音。为了反射飞机的低频声音，各主力军都研制了喇叭声定位器（也称为喇叭声定位器），用可以反射低频声音的大锥形喇叭代替了火炮测距装置的小喇叭。据剑桥大学生理学教授、20世纪初英国防空实验组主任AV希尔介绍，英国陆军研制的第一种小号声音定位器只有一对大号角，其口部直径约 40 英寸。该设备于 1917 年首次用作伦敦防空系统的一部分，只能确定敌机的水平方位。几乎立即开发的第二种型号有两对号角，有时被称为“四小号”或“四号角”声音定位器。一对喇叭用于确定飞机的仰角（高度），而另一对用于确定其水平方位（方位角）。喇叭的“alt-azimuth”安装需要两名审计员，他们从事可能被认为是“双双耳”聆听模式的工作。每个审计员都通过一个类似听诊器的双耳听筒听，该听筒只连接到一组喇叭。一名审计员只听了飞机的高度，而另一名则听了它的水平方位。因此，使用审计员的综合听觉印象来跟踪飞机，这是通过平衡两个耳朵的声级来确定的，这个过程被称为“包围声音”。\n四喇叭声音定位器是重型、劳动密集型的设备，需要相当大的努力来运输和使用。此外，通过喇叭声音定位器收听几乎总是在任何实验室都无法复制的不利条件下进行。军事审计员几乎总是在黑暗中运作，这已经是一项艰巨的任务，他们经常在恶劣的天气和混乱可怕的战斗条件下倾听。众所周知，士兵在战斗中会瞬间耳聋；士兵们回忆说“看到枪手的耳朵在流血”。通过声音定位器收听时，听力受损和听者疲劳是司空见惯的。听众不仅要在陌生和不可预测的环境中从事一项艰巨而繁重的活动，而且几乎可以肯定他有死亡的危险。在这种情况下，“加强倾听”是一个极端的命题。鉴于在这种极端条件下聆听的不稳定性质，军事审计员接受了广泛的培训，以培养他们的定向聆听技能。关于声学测角仪（一种法国设备）的军事手册包含有关“声音观察者的培训”和“听众的耳朵培训”的段落。这些段落详细描述了军事审计员必须进行的各种耳朵训练练习才能获得操作声学测角仪的资格- 喇叭声音定位器。声学测角仪听力练习分五个阶段进行。在第一阶段，审计员聆听大约 100 米外的固定声源。助手通过数数、拍手或吹喇叭来提供声音。助理然后侧身移动到另一个点，而审计员则将仪器重新对准他。第一个练习用于消除不可靠的听众。如果审核员的“声学目标”偏离太多，审核员将不被允许进入第二阶段。在第二阶段，助手模仿移动的声源，在以大约每秒一米的速度连续行走时产生连续的声音，距离审计员大约 150 到 200 米。审计员试图通过不断地将测角仪重新对准助手来跟踪声音。一位站在旁听者和助教之间的教官随意吹口哨。在这些点上，助手停止移动，审核员的声学瞄准得到验证。在第三和第四阶段，审核员跟踪实际飞机的声音，首先跟踪其水平方位，然后跟踪其高度。在第五阶段也是最后阶段，两名审计员同时跟踪一架飞机，一名审计员监听飞机的水平方位，另一名监听飞机的仰角。决定审计员“应该每天系统地接受培训”，每天的听力练习“绝对不可或缺”。如果审计师不每天练习，人们认为他“很快就会失去所获得的效率”。战争中机械上最复杂的声音定位器之一是佩兰远距望远镜 (télésitemètre Perrin)，它以法国物理学家让·巴蒂斯特·佩兰 (Jean Baptiste Perrin) 的名字命名。其前提是锥形喇叭所能达到的声音放大量必然受到喇叭尺寸和长度的限制。为了增加声音定位器的放大功率而不是其尺寸，Perrin 设计了一个接收器，该接收器将数十个基本喇叭聚集在六角形蜂窝状巢穴中。这些“主号角”通过一套管子连接到中央号角，两名审计员分别通过额外长度的管子进行双耳收听。这个想法是，被称为“myriaphones”的多细胞喇叭组合将使设备能够收集大量声能，而仪器本身可以保持相对较小，因此在运动战的背景下是可行的。\n根据 AV Hill 的说法，许多人认为 Perrin 遥测仪比小号声音定位器提供了“更确定的中心位置”，并且使用遥测仪，声音在两只耳朵之间传递的感觉似乎“更加明显”。第一次世界大战期间，出现了一支军事审计专家级，他们感知声音位置和方向的能力成为军事行动中的一项关键资产。在法国，军事审计员每天都接受培训，定向聆听被理解为可以通过听力训练来培养的技能。在声学防御的背景下，“好的倾听者”不一定是听得好的人。相反，一个好的倾听者是能够使用他们的空间听觉来定位和追踪声音来源的人。在战争过程中，声学防御技术变得更加复杂，不仅在其日益复杂的设计方面，而且在它们所需的聆听类型方面。出现了合作和协作的聆听模式，其中涉及几个审计员 - 以及其他团队 - 他们协同工作以感知和解释声学活动。尤其是在战争后期，在声学防御环境中进行聆听显然是一种集体努力。几乎每一种防御性倾听行为都涉及一系列复杂的程序，需要专业知识、多位审计员和其他观察员之间的合作以及人员团队之间的沟通。通过这种方式，聆听变成了一个分散的过程，由许多人分配，每个人都被分配到“聆听行为”的不同部分。同时，倾听行为本身也从个人在日常环境中进行的单一、连续、连贯的行为重新配置为一组由审计人员在极端战争条件下进行的系统化、离散的行为。由于军事审计员的作用是倾听并不断报告他的发现，因此进一步将倾听重新配置为数据收集行为。军事审计员通常不会像声学传感器那样解释声音的含义，而他的角色基本上是观察和报告物理声学数据。从这个意义上说，军事聆听本质上是一项机械任务，预示着当代形式的机器聆听。人类审计师通过制定功能性和高度合理化的聆听模式来执行机器今天执行的功能：声音研究学者乔纳森·斯特恩称之为“听觉技术”的军事化形式。通过声学防御，听力同样被重新配置为感知、观察或视觉绘制声能，而不是仅仅“听到”声音。在一些声学防御方法中，声音的视觉表示以及与声学活动相关的计算——例如确定风和温度等大气条件对特定日期声音传播的影响——取代了听觉。换句话说，在声学防御中，声音“听起来”的方式并不总是很重要。相反，在许多情况下，声音的物理行为才是听力方程式中最重要的部分。如果声音不是被理解为可以听到的东西，而是可以被感知的东西——或者实际上是被观察到的——那么它的定义也必须改变。在战争开始时，声音通常被理解为“某些振动运动对听觉神经产生的影响”，希尔引用了这一定义作为标准。然而，这个定义并不总是适用于声学防御的背景，因为有时需要考虑声音，正如一位军事领导人所写的那样，“不考虑通过耳朵的最终检测。”因此，希尔建议对声音更合适的定义是“听觉器官对其作出反应的那种物质的振动运动”。虽然这当然符合关于声音的成熟想法，但声学防御技术使以有形的方式体验声音作为“物质的振动运动”成为可能。\n声学防御同样使“声音传播”的想法具体化。成千上万的人——包括军事审计员，以及许多生活在空中轰炸威胁下的平民——不是面向可见的声音来源，而是面向声音的路径。声学防御使声音移动的想法变得合理，并且通过将自己定位于它的移动，人们可以重新定位历史本身。 Gascia Ouzounian 是牛津大学音乐系副教授，着有《立体声：科学、技术和艺术中的声音与空间》一书，本文改编自该书。", "note_en": "During WWI the act of hearing was recast as a tactical activity — one that could determine human and even national survival.\n   According to “The End of the War: A Graphic Record,” the frontispiece of  a towering report commissioned by the U.S. Assistant Secretary of War during WWI, the Great War ended not with a bang, but, as in the famous verse, a whimper.\n The image, which showed six horizontal lines on a filmstrip, depicted artillery activity at the American front near the Moselle River exactly one minute before and one minute after the time of armistice, 11:00 a.m. on November 11, 1918. The left side depicted artillery activity at one minute before armistice and showed a flurry of jagged lines (“All guns firing”). On the right side, which depicted artillery activity at one minute after armistice, there were only smooth lines (“All guns silent”). Two small dips around 11:01:01 were attributed to the exuberance of a doughboy who fired his pistol twice in celebration of the ceasefire. Apart from these gunshots, it appeared that artillery activity had ceased entirely, and that the battlefield had been suddenly drained of the throttling sounds of gunfire.\n  The caption for “The End of the War” stated that it was the last record of artillery activity at the American front, and that the image issued from an American sound ranging apparatus. “Sound ranging,” it read, “was an important means of locating the positions and calibers of enemy guns.” When the image was reproduced in the  Journal of Electricity the claims made about it were even grander: “Truly history has here been written electrically!”\n “The End of the War” was produced through one of numerous methods of acoustic defense that were invented during the First World War. At the outset of the war the concept of acoustic defense was mostly unknown. None of the principal armies possessed reliable means for tracking the position of the enemy by following the sounds it made. By the end of the war, however, each had developed new technologies and techniques for sound location, typically in response to new technologies of offense, and each had employed these methods on countless occasions — thereby generating new modes of “acoustic defense.”\n  The appearance of a new offensive weapon, however, did not mean that new methods of defense were easily come by. According to Alfred Rawlinson, Lieutenant Commander of the Royal Naval Volunteer Reserve, the enemy was prone to hiding behind clouds. How should the guns of the defense hit an object they could not see? The answer, he said, was “childishly simple — namely, though we can’t  see it, yet we can  hear it. Therefore, as we cannot aim by using our  eyes, we shall be obliged to shoot, if we are to shoot at all, by using our  ears to aim with.” Still, he wrote, there was “a terribly long way to go before theory, however correct, could be turned into practice.”\n Until the early 20th century, spatial hearing had been studied almost exclusively in terms of the physics of sound or the physiology and psychology of hearing. During the war it was recast as a tactical activity that was understood in strategic terms — as something that could determine human and even national survival. Auditory space perception, once considered subordinate to visual space perception, was newly understood as a vital skill, with “powers of hearing” suddenly mapped onto the powers of nation states.\n  The first sound locators used in the First World War relied heavily on the idea of “seeing” sound. Some were based on technologies of vision and transposed principles derived from optical science onto the acoustic domain. In 1916 a Lieutenant in the French Army designed a  viseur acoustique (“acoustic visor”), a handheld device that comprised a mirror and compass. A soldier used the instrument by centering the reflection of his face in the mirror such that he could  see his ears equally well. The compass would then presumably give the direction of the sound.\n  Experiments were undertaken in England with listening discs, a technology that was based on the idea that, when a soundproof disc was oriented towards the source of sound, an acoustic image would form at the center of the disc on the side opposite to that of the sound. The idea was proposed as an acoustic analogue to the Arago spot in optics, whereby a bright point appears at the center of the shadow of a circular object due to the wave nature of light.\n While technologies like acoustic visors and listening discs were neither particularly effective nor practicable, one of the most enduring acoustic defense technologies to emerge from the war, the Baillaud paraboloid, was also based on a technology of vision. Although there are examples of acoustic reflectors throughout history, the first parabolic acoustic reflector designed expressly for military use was invented by René Baillaud in 1915, and given the form of a dish or a bowl. Baillaud, an astronomer based at the Toulouse Observatory, modeled his device on the Newtonian telescope. His design was based on the premise that parabolic mirrors must share the same properties of reflection whether they were reflecting light or sound.\n  In Baillaud’s memoirs a series of photographs shows the development of the acoustic paraboloid over an intensive, approximately year-long period of experimentation. We find instruments of increasing size, ranging from 60 centimeters to 3 meters in diameter; of varying shapes, whereby the dish appears less like a concave dish and more like a deep bowl; and of varying configurations, including one in which four paraboloids were stacked in rows of two. A single auditor listening using a stethoscope-like device at the point of greatest focus becomes two auditors, who listen in tandem while each one is seated at opposite ends of the device, using hand wheels to rotate the dish. We also find the introduction of an automatic course plotter, an imaging technology that traced the auditors’ movements, thereby producing a visual record of the trajectory of the aircraft.\n  Military aircraft of the First World War produced several kinds of sounds: the beat of the propeller, engine sounds, and vibrations caused by friction between the air and the body of the moving airplane. The loudest and most easily identifiable sound, however, was what was called the “exhaust note.”\n The exhaust notes of various aircraft ranged between 80 hertz and 130 hertz, and although this pitch varied somewhat when the aircraft was in motion, it was invariably a low-frequency sound. In order to reflect the low-frequency sounds of aircraft, each of the principal armies developed trumpet sound locators (also called horn sound locators) that replaced the small trumpets of artillery ranging devices with large conical trumpets that could reflect low frequency sounds. According to A. V. Hill, professor of physiology at the University of Cambridge and director of the Anti-Aircraft Experimental Section in England in the early 20th century, the first type of trumpet sound locator developed by the British Army had only a single pair of large horns, which measured approximately 40 inches in diameter at the mouth. This device, which was first used as part of the Anti-Aircraft Defense of London in 1917, could determine only the horizontal bearing of enemy aircraft. A second model, which was developed almost immediately, had two pairs of horns, and was sometimes called the “four-trumpet” or “four-horn” sound locator. One pair of horns was used to determine the elevation of the aircraft (its altitude), while the other pair was used to determine its horizontal bearing (azimuth).\n  The “alt-azimuth” mounting of the horns necessitated two auditors, who engaged in what might be thought of as a “double binaural” mode of listening. Each auditor listened via a stethoscope-like binaural earpiece that was connected only to one set of horns. One auditor listened only to the aircraft’s elevation, while another listened to its horizontal bearing. It was therefore the auditors’  combined auditory impressions that were used to track the aircraft, which was ascertained by equalizing the sound level at the two ears, a process that was called “bracketing the sound.”\n Four-trumpet sound locators were heavy, labor-intensive devices that required considerable effort to transport and use. Moreover, listening through trumpet sound locators was almost always done in adverse conditions that could not be replicated in any laboratory. Military auditors almost always operated in the dark, already a difficult task, and they often listened in poor weather and in the chaotic and terrifying conditions of battle. Soldiers were known to have suffered instantaneous deafness in battle; and soldiers recalled “seeing gunners’ ears bleeding.”\n Hearing damage and listener fatigue were commonplace when listening through sound locators. Not only was the listener engaged in a difficult and taxing activity in unfamiliar and unpredictable settings, but he was almost certainly at risk of death. In this context, “heightened listening” was an extreme proposition.\n  Given the precarious nature of listening in such extreme conditions, military auditors received extensive training to develop their directional listening skills. A military manual on the acoustic goniometer, a French device, contains passages on the “Training of Sound Observers” and “Ear Training for Listeners.” These passages describe in detail the various ear-training exercises a military auditor was required to undertake to qualify for operating the acoustic goniometer, an alt-azimuth sound locator in which two sets of ten small, clustered horns replaced the large conical horns of the four-trumpet sound locator.\n Listening exercises with the acoustic goniometer were conducted in five stages. In the first stage an auditor listened to a fixed sound source approximately 100 meters away. An assistant provided the sound either by counting, clapping his hands, or sounding a trumpet. The assistant then moved sideways to another point while the auditor reoriented the instrument towards him. This first exercise served to eliminate unreliable listeners. If an auditor’s “acoustic aimings” deviated too much, the auditor would not be permitted to pass to the second stage.\n  During the second stage an assistant mimicked a moving sound source, producing a continuous sound while walking continuously at a rate of approximately one meter per second, at a distance of approximately 150 to 200 meters from the auditor. The auditor attempted to follow the sound by continuously reorienting the goniometer towards the assistant. An instructor who stood between the auditor and the assistant whistled at random. At these points the assistant stopped moving and the auditor’s acoustic aiming was verified.\n For the third and fourth stages the auditor followed the sound of an actual airplane, first tracking its horizontal bearing and then its elevation. In the fifth and final stage, two auditors followed an airplane simultaneously, with one listening for its horizontal bearing and the other for its elevation. It was decided that auditors “should be trained every day systematically” and that daily listening practice was “absolutely indispensable.” If an auditor did not practice every day, it was believed that he “would quickly lose the efficiency acquired.”\n   One of the most mechanically complex sound locators of the war was the Perrin telesitemeter ( télésitemètre Perrin), named after the French physicist Jean Baptiste Perrin. It was based on the premise that the amount of sound amplification that could be achieved by a conical horn was necessarily limited by the size and length of the horn. In seeking to increase the sound locator’s amplifying power but not its size, Perrin designed a receiver that clustered dozens of elementary horns in hexagonal, honeycomb-like nests. These “primary horns” were connected to a central horn by a suite of tubes, and two auditors each listened binaurally via an additional length of tubing. The idea was that the multicellular horn assemblages, called “myriaphones,” would enable the device to collect a substantial amount of acoustic energy while the instrument itself could remain relatively small and therefore practicable in the context of mobile warfare.\n According to A.V. Hill, many people believed that the Perrin telesitemeter gave a “more decided position of centrality” than trumpet sound locators, and that the sensation of passage of sound between the two ears seemed “more pronounced” with the telesitemeter.\n  During the First World War an expert class of military auditor emerged, one whose ability to sense the location and direction of sounds became a key asset in military operations. In France, military auditors were trained on a daily basis, and directional listening was understood as a skill that could be developed through ear training. In the context of acoustic defense, a “good listener” was not necessarily someone who could hear well. Rather, a good listener was one who could use their spatial hearing sense to locate and track the source of a sound.\n Over the course of the war acoustic defense technologies became more complex, not only in terms of their increasingly elaborate designs, but also in the kinds of listening they required. Cooperative and collaborative modes of listening emerged that involved several auditors — and teams of others — who worked in tandem to sense and interpret acoustic activity. Especially in the later years of the war, listening in the context of acoustic defense was a distinctly group effort.\n Almost every act of defensive listening involved a complex sequence of procedures that required specialist knowledge, cooperation between several auditors and other observers, and communication between teams of people. In this way, listening became a fragmented process that was divided between many people, each of whom was assigned to a different part of the “listening act.” Meanwhile, the listening act itself was reconfigured from a single, continuous, coherent act carried out by individuals in everyday contexts to a set of systematized, discrete actions carried out by groups of auditors under the extreme conditions of warfare.\n Since the role of the military auditor was both to listen and to continuously report his findings, listening was further reconfigured as an act of data collection. The military auditor did not typically interpret the  meaning of sounds so much as he acted as an acoustic sensor, one whose role was fundamentally to observe and report physical acoustic data. In this sense, military listening was essentially a mechanical task that prefigured contemporary forms of machine listening. Human auditors performed the function that machines perform today, by enacting functional and highly rationalized modes of listening: militarized forms of what sound studies scholar Jonathan Sterne has called “audile technique.”\n Through acoustic defense, listening was equally reconfigured as sensing, observing, or visually plotting acoustic energy versus merely “hearing” sound. In some acoustic defense methods, the visual representation of sound, and calculations relating to acoustic activity — determining the influence of atmospheric conditions like wind and temperature on the propagation of sound on a particular day, for example — superseded the sense of hearing. In other words, it was not always how the sound “sounded” that mattered in acoustic defense. Rather, in many cases it was the physical behavior of sound that was the most consequential part of the listening equation.\n  If sound is understood not as something to be heard but rather as something to be sensed — or indeed, observed — then its definition must also change. At the start of the war sound was commonly understood as “the effect produced upon the auditory nerve by certain vibratory motions,” a definition that was cited as standard by Hill. However, this definition was not always applicable in the context of acoustic defense, since it was sometimes necessary to consider sound, as one military leader wrote, “without reference to its ultimate detection by the ear.” Hill therefore suggested that a more appropriate definition of sound would be that of “a vibratory motion of matter of the type to which the organ of hearing responds.” While this certainly corresponded to well-established ideas about sound, technologies of acoustic defense made it possible to experience sound as “a vibratory motion of matter” in a tangible way.\n Acoustic defense equally made concrete the idea that “sound travels.” Thousands of people — including military auditors, as well as the many civilians living under the threat of aerial bombardment — oriented themselves not towards the visible source of sound but towards the path of sound. Acoustic defense made sensible the idea that sound moves, and that, by orienting oneself towards its movements, one might reorient history itself.\n  Gascia Ouzounian is Associate Professor of Music at the University of Oxford and the author of   “Stereophonica: Sound and Space in Science, Technology, and the Arts,”  from which this article is adapted.", "posttime": "2021-07-29 22:08:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "力量,hearing,声音", "title": "听觉的力量：声音定位的军事科学", "title_en": "Powers of Hearing: The Military Science of Sound Location", "transed": 1, "url": "https://thereader.mitpress.mit.edu/powers-of-hearing-the-military-science-of-sound-location/", "via": "", "real_tags": ["力量", "hearing", "声音"]}]