[{"category": "", "categoryclass": "", "imagename": "ff4fb97831ce523c7b775a217e659303.jpg", "infoid": 1009082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该国交通部今天宣布，将在8月份之前开始允许电动滑板车通过电动滑板车租赁公司在全国范围内合法运营，初步处于试验阶段。包括伦敦和其他主要城市在内的大约50个议会和其他当局正在努力进行可能长达12个月的审判。\nDFT表示，这些规定将于7月4日生效，预计第一次审判将在一周后开始。\n英国交通部长雷切尔·麦克林在一份声明中表示：“随着我们摆脱封锁，我们在交通方面有了一个独特的机会，可以用更绿色、更可持续的方式重建，这可能会导致英国各地更清洁的空气和更健康的社区，”交通大臣雷切尔·麦克林(Rachel Maclean)在一份声明中表示。他说：“电动滑板车或可提供方便、清洁及具成本效益的出行潜力，亦有助减轻交通网络的负担，提供另一种绿色出行选择，并容许社交距离。”这些试验将让我们测试他们是否做了这些事情。“。\n这里有一些限制：电动滑板车的时速不能超过15英里，它们只能使用道路和自行车道，不能使用人行道或其他为行人保留的区域。用户将需要驾驶执照(完整的或临时的)。滑板车本身不需要登记为车辆，但需要保险。就像骑自行车一样，建议用户戴头盔，但不是必需的。\n私人拥有的电动滑板车似乎不会被包括在放松规则的范围内，但目前尚不清楚监管机构将采取什么措施-如果有的话-以避免我们在一些城市看到的那种混乱，人行道上挤满了太多的无码头滑板车。\n电动滑板车的候选名单很长。从一开始，那些希望在英国运营的公司包括Bird，Bolt(爱沙尼亚的拼车初创公司)，Tier，Neuron Mobility，Lime，Voi和Zipp Mobility。\n我们正在联系DFT提出我们的问题，并将在了解到更多信息时更新此帖子。\n电动滑板车现在将加入包括自行车和电动自行车在内的其他共享交通选择的行列，作为对公共交通的补充，当然还有步行或使用自己的非自动车轮作为使用汽车的替代方案。电动滑板车既被视为短距离(1至5英里之间)的替代方案，也被视为最后一英里的解决方案，与\n今天的新闻取消了之前实施的限制，这些限制将电动滑板车归类为机动车，因此要求电动滑板车必须获得许可和征税，运营商也必须拥有使用它们的许可证。\n这些规定还意味着，在人行道上使用电动滑板车是非法的，唯一的例外是在私人土地上选定的(非常有限的)校园内合法使用电动滑板车。\n在此之前，3月份就在英国三个地区试点使用电动滑板车进行了咨询，以及其他一些举措，包括电子货运运营商和使用无人机运输医疗用品-目的是快速探索一些新技术，以扩大消费者以及基本企业和在这些企业工作的人可用的交通选择。\n更大的趋势是，其他城市也在寻求放松规定，为那些希望进行社交距离但仍然需要以比步行更快的方式在城市地区出行的人提供更好的交通选择。纽约市预计也将在不久的将来公布自己的电动滑板车飞行员路线图。\n今天正式公布的消息在某种程度上是一个保守不力的秘密，特别是在交通初创企业中，这些企业的业务一直处于控股模式，等待监管机构放松已经实施的限制。\n一周多来，几乎所有这些初创公司都在向记者发出警报，对政府广泛预期的公告发表评论。\nNeuron Mobility首席执行官扎卡里·王(Zachary Wang)在一份声明中表示：“我们欢迎DFT的声明，并为能离开始电动滑板车试验又近了一步而感到兴奋。”“我们已经在与多个议会进行讨论，因为没有两个小镇或城市是我们所期待的，我们期待与他们合作，以最适合他们个人需求的方式安全地推出电动滑板车。”新冠肺炎从根本上重新思考了我们的出行方式，电动滑板车有可能从根本上改善我们在城镇中的出行方式。我们很高兴英国人很快就能从共享电动滑板车中受益，它们将让人们继续保持社交距离，同时也提供了比耗油的替代产品更高效的出行选择。\nTier Mobility首席运营官罗杰·哈桑(Roger Hassan)在一份声明中表示：“我们欢迎政府今天的声明，因为它希望让城市再次以安全和环保的方式搬迁。”“我们在英国的仓库里已经有1000多辆我们行业领先的滑板车，随时准备部署，我们很快就会发货更多。Tier的每个人都期待着与政府和地方当局合作，让我们的电动滑板车在英国取得巨大的成功。”\n虽然之前有过一些限制，但我应该指出，这些限制往往执行不力：在伦敦，总是有一些私人电动滑板车车主在路上与自行车和汽车并驾齐驱，我甚至会在自行车上的红灯前停下来，一边是一辆电动滑板车，另一边是一名警察，一言不发，只是简单地耸了耸肩：“你能做什么？”因此，非刑事化，就像它在其他行业所做的那样，有望意味着更好的监管，以及为用户提供更好的选择。", "note_en": "The country’s Department for Transportation today  announced that it would start allowing e-scooters, by way of e-scooter rental companies, to legally operate across the country initially in a trial phase starting no later than August. Some 50 councils and other authorities, including across London and other major cities, are working on putting together trials that could run for as long as 12 months.\n The regulations come into force on July 4, the DfT said with the first trials expected to begin a week later.\n  “As we emerge from lockdown, we have a unique opportunity in transport to build back in a greener, more sustainable way that could lead to cleaner air and healthier communities across Great Britain,” said Transport Minister Rachel Maclean in a statement. “E-scooters may offer the potential for convenient, clean and cost-effective travel that may also help ease the burden on the transport network, provide another green alternative to get around and allow for social distancing. The trials will allow us to test whether they do these things.”\n There are some restrictions in place: e-scooters will not be able to go faster than 15 miles per hour, and they will only be able to use roads and cycle lanes, not sidewalks or other areas reserved for pedestrians. Users will need a drivers license (full or provisional). The scooters themselves will not need to be registered as vehicles but will need insurance. And as with bicycles, u sers will be recommended — but not required — to wear helmets.\n It seems that privately-owned e-scooters will not be included in the rule relaxation, but it’s not clear what steps regulators will take — if any — to  avoid the cluttering that we have seen in some cities overrun with too many dock-less scooters crowding sidewalks.\n The list of e-scooter hopefuls is long. From the word go, those that are looking to operate in the UK include Bird, Bolt (the ridesharing startup out of Estonia), Tier, Neuron Mobility, Lime, Voi, and Zipp Mobility.\n We’re contacting the DfT with our questions and will update this post as we learn more.\n Electric scooters will now join the ranks of other shared transportation options that include bikes and e-bikes, as a complement to mass transit and of course walking or using your own non-autonomotive wheels as an alternative to using cars. E-scooters have been seen both as an alternative for short distances (between  1 and 5 miles) but also as a last-mile solution in combination with\n The news today lifts restrictions that had previously been in place that classified e-scooters as motor vehicles and therefore required the e-scooters to be licensed and taxed, and for operators to have licenses to use them.\n Those rules also meant that the e-scooters were illegal to use on sidewalks, with the only exception to all that being legal usage across select (and very limited) campuses on private land.\n The moves comes on the heels of a  consultation in March to pilot e-scooter use in three regions of the UK, along with a number of other initiatives including e-cargo carriers and using drones to transport medical supplies — the aim being to explore in quick order a number of new technologies to expand transportation options available to consumers, as well as essential businesses and the people who work in them.\n The bigger trend has seen other cities also looking to relax rules to improve transportation options to people who wish to socially distance but still need to get around urban areas in ways that are quicker than walking. New York City is also  expected to unveil its own roadmap for e-scooter pilots in the near future.\n The news made official today had been something of a badly-kept secret, specifically among transportation startups whose businesses have been in a holding pattern waiting for the regulator to ease up on restrictions that had been in place.\n Just about all of those startups have been sending out alerts to journalists for over a week now with comments on government’s widely-expected announcements.\n “We welcome the DfT’s announcement and are excited to be one step closer to the starting the e-scooter trials,” said Zachary Wang, CEO of Neuron Mobility, in a statement. “We are already in discussions with quite a few councils, as no two towns or cities are the same we look forward to partnering with them to safely introduce e-scooters in a way that best suits their individual needs. COVID-19 has led to a fundamental rethink of the way we travel and e-scooters have the potential to radically improve how we get around our towns and cities. We are delighted that people in the UK will soon be able to benefit from shared e-scooters, they will allow people to continue social distancing while also providing a more efficient travel option than gas-guzzling alternatives.”\n  “We welcome today’s announcement from the Government as it looks to get cities moving again safely and in an environmentally friendly way,” said Roger Hassan, COO of TIER Mobility, in a statement. “We already have more than 1,000 of our industry leading scooters in our UK warehouse, ready to be deployed and we will be shipping more over very soon. Everyone at TIER is looking forward to working with the Government and with local authorities to make e-scooters in the UK a huge success story.”\n While there had been restrictions in place before now, I should point out that they were often badly enforced: in London there have always been some private e-scooter owners zooming around alongside bikes and cars on the roads, and I’ve even stopped at red lights on my bike, with an e-scooter on one side of me, and a policeman on the other, and not a word gets exchanged, just a simple shrug of “what can you do?” So decriminalising, as it has done in other industries, will hopefully mean better oversight, alongside better choice for users.", "posttime": "2020-07-01 00:43:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "滑板车,firms", "title": "\n电动滑板车公司获准在英国街头开始长达一年的试验", "title_en": "\n\t\t\t\tE-scooter firms get the green light to start trials of up to one year on UK streets\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/e-scooter-firms-get-the-green-light-to-start-trials-of-up-to-one-year-on-uk-streets/", "via": "", "real_tags": ["滑板车", "firms"]}, {"category": "", "categoryclass": "", "imagename": "3d61ef70babe251a6adeca419becb4a3.jpg", "infoid": 1009081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "收看五位初创公司的早期创始人(你会发现他们都会在Disrupt2020期间在数字创业大道上展出)走上投手丘，带来热度。翻译：他们将向评委小组提供他们最好的60秒电梯演讲-并受益于来自行业专家的实时批评、反馈和建议，这些专家知道如何制作一个获胜的演讲。\n评判这次会议，我们有精通推销的TechCrunch编辑乔丹·克鲁克(Jordan Crook)和柯尔斯滕·科洛塞克(Kirsten Korosec)，以及两位风险投资人-Betaworks Ventures的马修·哈特曼(Matthew Hartman)和Construct Capital的戴娜·格雷森(Dayna Grayson)。是的，来自初创公司投资者的重要反馈-正是创始人需要给人留下最深刻印象的人。\n这五位投手创始人不仅会拿到更好的演示文稿，其中一位还会拿到相当酷的奖金。观众(可能是你)决定谁能赢得与CELA的咨询会，CELA是一家将初创企业与加速器和孵化器联系起来的公司，可以帮助他们扩大业务规模。\n注意：只有购买了Disrupted Digital Startup Alley套餐的公司才有资格进行推销。即使你不面对评委，你仍然会学到有价值的技巧和策略。观看、倾听并应用专家的提示和策略来加强您的推销-您与初创企业世界的握手。这是你让它变得坚定和令人印象深刻的机会。\nCognidna-提供关于认知特征的DNA见解，帮助父母为他们的孩子做出更有见地的教育决定。\nFlexane-一家在线批发市场，改变了亚洲当地零售商为其门店购买商品的方式。\nEvertracker-一个中立平台，可在项目级别提供全球供应链的端到端可见性和可预测性。\n别错过这次大师班。注册投球和安培投手，并在明天，7月1日下午4点收看。美国东部时间/下午1点。PT.。如果您想在定于7月22日举行的投手和安培投球会议期间尝试投球，请务必先购买您的Disrupt Digital Startup Alley套餐才有资格。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "Tune in as five early-stage startup founders (all of whom you’ll find  exhibiting in Digital Startup Alley during  Disrupt 2020) step to the mound to bring the heat. Translation: They’ll deliver their best 60-second elevator pitch to a panel of judges — and benefit from real-time critique, feedback and advice from industry experts who know how to craft a winning pitch.\n Judging this session we have pitch-savvy TechCrunch editors, Jordan Crook and Kirsten Korosec, plus two VCs —  Matthew Hartman of Betaworks Ventures and  Dayna Grayson of Construct Capital. Yes, essential feedback from startup investors — the very people founders need to impress most.\n  Not only will the five pitching founders come away with a stronger presentation, one of them will walk away with a pretty cool prize. The viewing audience (that would be you) decides who wins a consulting session with  cela, a company that connects early-stage startups to accelerators and incubators that can help scale their businesses.\n Note: Only companies that  purchase a  Disrupt Digital Startup Alley Package are eligible to pitch. You’ll still learn valuable tips and strategies — even if you’re not facing the judges. Watch, listen, and apply the expert tips and strategies to power up your pitch — your handshake to the startup world. This is your chance to make it firm and impressive.\n  Cognidna – provides DNA insights on cognitive traits, helping parents make more informed educational decisions for their children.\n  Flexlane – an online wholesale marketplace that transforms the way local retailers in Asia buy for their stores.\n  Evertracker – a neutral platform that provides end-to-end visibility and predictability along global supply chains on an item-level.\n Don’t miss this masterclass.  Register for Pitches &amp; Pitchers and tune in tomorrow, July 1 at 4 p.m. ET / 1 p.m. PT. If you want a shot at pitching during the Pitchers &amp; Pitches session scheduled on July 22, be sure to  buy your Disrupt Digital Startup Alley Package first to be eligible.\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by  filling out this form.", "posttime": "2020-07-01 00:42:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "投手,pitch", "title": "\n明天在投手和投手那里调整你的投球", "title_en": "\n\t\t\t\tTune-up your pitch tomorrow at Pitchers & Pitches\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/tune-up-your-pitch-tomorrow-at-pitchers-pitches/", "via": "", "real_tags": ["投手", "pitch"]}, {"category": "", "categoryclass": "", "imagename": "3584c30b18d0c9e1d7cd4a0349801ed4.jpg", "infoid": 1009080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "例如：Summit Partners是一家处于初创企业成长期、专注于北美和欧洲生态系统的受人尊敬的投资者，它筹集了两个新的巨型基金。该公司还宣布，已聘请曾担任SoulCycle首席执行官的梅勒妮·惠兰(Melanie Whelan)担任新的董事总经理。她目前是该公司的EIR。\nSummit募集了10亿美元的增长股票基金，专注于北美初创企业，还募集了11亿欧元(12.4亿美元)的基金，专注于欧洲初创企业。该公司表示，这些基金将瞄准成长型股票型投资，北美初创企业的支票金额在1000万至6000万美元之间，欧洲初创企业的支票金额略大。\n据Crunchbase称，近几个月来，该公司投资了网络安全平台RiskIQ、工作流自动化初创公司AppWay、互动管理服务平台Podium、消费者床上用品品牌Brooklinen和网络技能平台沉浸式实验室(Immersive Labs)等公司。\n虽然Summit传统上以企业投资而闻名，但该公司似乎希望通过聘用惠兰来加倍吸引消费者。根据Summit的说法，她将专注于“高增长的消费者和技术支持的服务”。\n惠兰在SoulCycle有很长的职业生涯，2012年加入公司担任首席运营官，然后在2015年担任首席执行官。在那里，她推动了市场扩张，并努力为这个有点邪教的健身品牌公开市场做好准备，计划于2018年年中进行首次公开募股(IPO)。那次IPO最终被该公司取消，该公司面临着来自peloton和其他健身新贵的阻力，惠兰在2019年底辞去了首席执行官一职(考虑到面对面健身工作室几乎完全关闭，这似乎是非常幸运的时机)。她于2月份正式加入顶峰，担任EIR，就在新型冠状病毒的传播减缓了大部分风投世界的速度之前。\n如今，该公司拥有100名员工，分散在其无数的办公室里，管理着210亿美元的资产。", "note_en": "Case in point:  Summit Partners, a venerable investor at the growth stage for startups and focused on the ecosystems in North America and Europe, has raised two new megafunds. The firm also announced that it has hired Melanie Whelan, who formerly was CEO of SoulCycle, as a new managing director. She is currently an EIR at the firm.\n Summit raised a $1 billion growth equity fund focused on North American startups, and also raised a €1.1 billion ($1.24 billion) fund focused on European startups. The firm said that the funds will target growth equity-style investments with a check size of between roughy $10 million and $60 million for North American startups, and a bit larger for their European counterparts.\n  In recent months, the firm has invested in companies like cyber security platform  RiskIQ,   workflow automation startup AppWay, interaction management service Podium, consumer bedding brand Brooklinen, and cyber-skills platform Immersive Labs,  according to Crunchbase.\n While Summit is traditionally known for its enterprise investments, it appears the firm wants to double down on consumer with the hiring of Whelan. She will focus on “high-growth consumer and technology-enabled services,” according to Summit.\n Whelan had a long career at SoulCycle, joining the company as COO in 2012 and then took the CEO title in 2015. There, she drove market expansion and worked to ready the somewhat cultish fitness brand for the public markets, with an IPO that was scheduled in mid-2018. That IPO ended up  being pulled by the company, which  faced headwinds from Peloton and other fitness upstarts, and Whelan left the CEO job near the end of 2019 (which, given the near complete shutdown of in-person fitness studios, seems incredibly fortuitously timed).  She officially joined Summit as an EIR in February, right before the spread of the novel coronavirus slowed down much of the venture world.\n The firm today has 100 people scattered across its myriad of offices, and has $21 billion under management.", "posttime": "2020-07-01 00:42:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "soulcycle,pulls", "title": "\nSummit跨越两个百万基金筹集了22亿美元，并吸引了SoulCycle的前首席执行官作为最新的投资者", "title_en": "\n\t\t\t\tSummit raises $2.2B across two megafunds, and pulls in ex-CEO of SoulCycle as newest investor\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/summit-raises-2-2b-across-two-megafunds-and-pulls-in-ex-ceo-of-soulcycle-as-newest-investor/", "via": "", "real_tags": ["soulcycle", "pulls"]}, {"category": "", "categoryclass": "", "imagename": "1323418f1c3d793d3f16c050c0454617.jpeg", "infoid": 1009079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊公司(Amazon.com Inc.)。正在加大努力吸引军事和商业太空组织作为其云计算服务的主要用户，希望从不断增加的政府支出和蓬勃发展的私人投资中受益。\n这家在线零售巨头的云计算部门亚马逊网络服务公司(Amazon Web Services)此举正值美国军方和民用机构在太空项目上的支出多年激增之际，美国国家航空航天局(NASA)、五角大楼及其最大的承包商-包括洛克希德·马丁公司(Lockheed Martin Corp.)-受益于巨额拨款或提议.", "note_en": "Amazon.com Inc. is boosting efforts to lure military and commercial space organizations as major users of its cloud-computing services, hoping to benefit from rising government spending and burgeoning private investment.\n  The move by Amazon Web Services, the online retail giant’s cloud-computing arm, comes during a multiyear surge in U.S. military and civilian agency spending on space projects, with NASA, the Pentagon and their largest contractors—including Lockheed Martin Corp.—benefiting from hefty appropriated or proposed...", "posttime": "2020-07-01 00:41:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,云计算,亚马逊,推动,launches", "title": "亚马逊推出空间推动以推动云计算增长", "title_en": "Amazon Launches Space Push To Drive Cloud-Computing Growth", "transed": 1, "url": "https://www.wsj.com/articles/amazon-launches-space-push-to-drive-cloud-computing-growth-11593489660", "via": "", "real_tags": ["amazon", "云计算", "亚马逊", "推动", "launches"]}, {"category": "", "categoryclass": "", "imagename": "31018020d73c2290b3b40351af84e729.jpg", "infoid": 1009078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛罗里达州杰克逊维尔。-据杰克逊维尔警长办公室称，周一下午，一名在杰克逊维尔亚马逊仓库排队求职的20岁男子被枪杀。\n下午2点前，两名嫌疑人在杰克逊维尔北区的亚马逊履行中心外开枪，另有两人受轻伤。\n根据JSO的说法，被打死的男子是开着一辆银色汽车逃离现场的枪手的目标。JSO目前正在搜寻三名嫌疑人，其中包括逃跑汽车的司机。\nJSO说，警察在电话接到三分钟后就赶到了山核桃公园路的枪击现场。\nJSO说，嫌犯开始开枪时，这名20岁的受害者正和其他大约6人在设施外排队等待工作申请。JSO相信嫌犯认识受害者。\n“我们正在试图确定他们追捕这名受害者的动机是什么。我们有大约10名目击者在设施内外，“JSO助理局长Brian Kee说。“这似乎不是你通常会将其与工作场所暴力或大规模枪击联系在一起的工作场所暴力事件。”\nFacebook Live的一段视频捕捉到了一名女子在说自己与其中一名枪手面对面后奔跑的瞬间。在视频中，可以听到这名女子说：“他撞了我，让我让开。”\n这名女子后来告诉News4Jax：“当我开始返回亚马逊大门时，我的头稍微向右转了一下，我看到持枪歹徒就站在那里，手里拿着枪，然后你知道他就开始开枪了。”“他只是放了大约五六发子弹。我站在那里完全震惊，因为我不敢相信在我面前实际发生的事情。“\n枪击事件中，一名29岁的男子手臂被擦伤，一名22岁的男子脚部被擦伤。JSO说，两人都接受了治疗，不需要住院。\n一张由亚马逊员工拍摄并发送给News4Jax的照片似乎显示，其中一间休息室的玻璃破碎。这名员工说这是由子弹造成的。\n枪击事件发生后，紧急救援人员和犯罪现场录像带挤满了履行中心的停车场。可以看到似乎是一架JSO直升机在设施和附近的林区上空盘旋。\n自称是亚马逊员工家属的人在社交媒体上表示，员工被封锁在里面。几名员工也向News4Jax证实，他们被困在里面几个小时。\n“我们的经理过来说，每个人都需要呆在我们的位置上，不要动，我们不允许和任何人交谈。”我们不得不呆在自己的岗位上，“员工希瑟·古德里奇(Heather Goodrich)说。\n古德里奇说，她担心目睹枪击事件的同事的福祉。\n“出于高度谨慎，我们决定取消今晚的夜班，”这条信息说，部分原因是。\n“这是一场可怕的悲剧。我们的思念和祈祷与遇难者和他们的家人，以及所有受这一事件影响的人在一起。我们正在与警长密切合作，让他们展开调查。“\nJSO要求任何可能看到这辆银色车的人或有关于枪击事件的信息的人打电话给警长办公室，电话是904-630-0500。", "note_en": "JACKSONVILLE, Fla. – A 20-year-old man who was standing in line to apply for a job at an Amazon warehouse in Jacksonville was shot and killed Monday afternoon, according to the Jacksonville Sheriff’s Office.\n Two other people suffered minor injuries when two suspects opened fire outside the Amazon Fulfillment Center on Jacksonville’s Northside shortly before 2 p.m.\n According to JSO, the man who was killed was targeted by the shooters who fled from the scene in a silver car. JSO is now searching for three suspects, including the driver of the getaway car.\n JSO said officers were on the scene of the shooting on Pecan Park Road three minutes after the call came in.\n The 20-year-old victim was standing in line for job applications with about six others outside of the facility when the suspects began firing, JSO said. JSO believes the suspects knew the victim.\n “We’re trying to determine what the motive was why they were after this victim. We have about 10 eyewitnesses that were both inside and outside of the facility,” said JSO Assistant Chief Brian Kee. “This does not appear to be a workplace violent incident that you would normally associate with workplace violence or mass shootings.”\n  A Facebook Live video captured the moments a woman ran after she said she came to face to face with one of the shooters. In the video, the woman can be heard saying: “He bumped me, told me to get out of the way.”\n “As I started to go back inside the Amazon doors, I turned my head slightly to the right, I saw the gunman standing right there with a gun in his hand and next thing you know he just started shooting,” the woman later told News4Jax. “He just let off about five or six rounds. I stood there in complete shock because I couldn’t believe what was actually happening in front of my face.”\n A 29-year-old man was grazed in the arm and a 22-year-old man was grazed in the foot during the shooting. Both were treated and did not require hospitalization, JSO said.\n A photo that was taken by an Amazon employee and sent to News4Jax appears to show shattered glass in one of the break rooms. The employee said it was caused by a bullet.\n   Emergency crews and crime scene tape filled the parking lot of the fulfillment center following the shooting. What appeared to be a JSO helicopter was seen circling above the facility and the wooded area nearby.\n People claiming to be family members of Amazon employees at the facility said on social media that employees were placed on lockdown inside. Several employees also confirmed to News4jax who were stuck inside for hours.\n “Our managers came around and said that everybody needs to stay in our positions and not move, we’re not allowed to talk to anybody. We had to stay in our stations,” said employee Heather Goodrich.\n Goodrich said she is worried about the wellbeing of her coworkers who witnessed the shooting.\n   “Out of an abundance of caution, we’ve decided to cancel the nightshift tonight,” the message said, in part.\n  “This is a terrible tragedy. Our thoughts and prayers are with the victims and their families, and all those who have been impacted by this incident. We are working closely with the Sheriff as they investigate.”\n JSO is asking anyone that may have seen the silver vehicle or has information about the shooting to call the Sheriff’s Office at 904-630-0500.", "posttime": "2020-07-01 00:41:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,仓库,shot,员工", "title": "杰克逊维尔亚马逊仓库外1人死亡，2人中弹", "title_en": "1 Killed, 2 Shot Outside Amazon Warehouse In Jacksonville", "transed": 1, "url": "https://www.news4jax.com/news/local/2020/06/29/1-person-shot-outside-amazon-warehouse-in-jacksonville/", "via": "", "real_tags": ["amazon", "亚马逊", "仓库", "shot", "员工"]}, {"category": "", "categoryclass": "", "imagename": "51233cf06a24b30704eb1e3f572d1bad.jpg", "infoid": 1009077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他会让我看看他的域名组合。不是他拥有和停放的名字，而是他拥有和开发的域名。这是他的另一个早期项目-一个专门关注牧场行业的求职委员会。方方面面--牛、装饰商、花花公子/客人、狩猎，甚至相关的生意，如骑马。他在1998年推出了它，并在开发品牌和建立受众方面做了令人钦佩的工作。但其他项目抢走了他的注意力，网站变得有点陈旧。它的收入已经蒸发了。\n我是在DudeRanch.com(当时是我的)和amp；GuestRanches.com(他的)的合作伙伴关系中认识大卫的。我们把他们聚在一起卖广告。握手协议。我们猜想，大家一起变得更强大。我们是对的。多年来，通过将我们网站的权威作为一个实体(而不是两个实体)来利用，我们的收入(超过)翻了一番。\n我们合作的越多，彼此分享的商机就越多。他一度与我分享了他的作品集，就在那时，我发现了RanchWork.com。\n当时，我一直在四处寻找第二个项目进行开发，经过一年左右的寻找，我一无所获。我通常的收购途径，即将到期的域名市场，没有产生任何有价值的东西，所以我走神的想法把我带到了大卫那里。\n当我发现RanchWork时，它让我想起了一位朋友--谢恩·派克(Shane Pike)--他在几年前建造、开发并成功地卖出了一块护理工作板。据我所知，他是一个人干的。求职公告栏的直截了当的性质很吸引人--直接、简单，而且毫无意义。\n这个壁龛很吸引人，所以我在上面睡了一觉后，就给大卫发了个ping。看看他能不能让我在上面测试一个项目。我在男子牧场行业已经根深蒂固，所以这看起来是一个自然的延伸。粗略的想法是这样的：\n把RanchWork.com的域名服务器指给我看，我会承担重新开发的费用，外加监督和维护费用。\n一旦开发完成，我将允许牧场主免费发布工作清单，以鼓励定期发布帖子。\n我也会允许付费列表(这会以更快的速度发布，并在更长的一段时间内保持活跃)。\n为简单起见，我会避免任何类型的登录或帐户创建。如果牧场主正在招聘，他们只需填写一张表格，输入信用卡信息(如果需要)，然后提交即可。成交了。\n大卫将获得该网站所有招聘板块收入的25%，其余75%将落入我的口袋。广告出版商的收入也在我的控制之下。\n和大卫一起工作很容易(&amp；有趣)是因为他的“去他妈的，让我们做吧”的态度。我非常钦佩他这一点，因为我倾向于遵循同样的人生观。他也把这种精神带到了这个项目中。\n现在，当然，从一开始，我就可以从失败主义的态度来看待这个想法，那就是，“什么？我要试着和“真的”、“简单头发”、“怪兽”之类的竞争吗？他们是风投支持的重量级企业…。我没有机会。“。\n我很少用这种心态来处理项目。我倾向于从“我有什么可失去的”的角度来对待他们。通常，答案是“不多”。然后，这个想法变成了“让我们看看我能挑起什么狗屎”。\n因此，首先，我购买了一个60美元的求职板主题，花了整整一周的时间来为移动设备和SEO恰当地构建网站。我研究过竞争对手。25美元似乎是有偿招聘的平均价格，所以这成了我的底价。另一位密友布莱恩·克拉普(Brian Clapp)建议我为寻找牧场工作的人添加一份“招聘工作”清单。我对这种需求的存在表示怀疑，但还是添加了它。然后，我很高兴地多付了钱，买了我能找到的最快、最可靠的WordPress主机。\n起初，所有的工作都是我自己安排的。然后牧场主开始提交他们自己的。然后我转到了管理和验证领域。\n从几乎为零的流量，该网站每月的访问量增加到大约4万到50000人。通常每30天有20万的页面浏览量。我不得不开始和我的主机提供商一起管理超额费用。\n作为唯一的策展人，我确保他们遵循我定义的单一轨迹。总体而言，他们做到了。\n像这样的工作，你必须骑着骡子从你在大峡谷的工作地点去&amp；。\n或者，这位是山地许可证骑手，负责怀俄明州科迪附近私人牧场和山林放牧配额的一岁牛护理和管理的方方面面。\n甚至是文章开头的那个。(不，不需要向后滚动，它又在这里了)。\n我们列出的职位(和招聘职位)越多，我们收到的正面反馈就越多。我们为一个雇佣资源有限的偏远牧场提供了很大的帮助。他们陷入了财务困境，而我们的免费服务使他们能够聘请合适的经理来扭转他们的经营状况。而我最怀疑的途径-招聘职位-最终帮助了那些渴望逃离城市，进入农场工作生活的人(同时贡献了我们总收入的30%)。&gt；&gt；谢谢，克莱普先生。\n这种感觉很熟悉。感觉就像我的维达利亚项目。我正在产生积极的影响。作为一个单独的操作者，巧妙地满足了一个独特的痛点。\n这个项目--最初只是昙花一现--成了我的迷你主力。这是一部如此令人自豪的作品，以至于我最终在2017年从大卫手中买下了整个项目。我在2019年加倍投资了10K美元，打造了更华丽的后端和更新的设计。这个网站是当之无愧的--一个合适的身份。\n我倾向于用这种方式来处理网上交易。不是故意的-我只是发现自己走上了这条路。找到一个好的域名；建立一个产品/服务；看看它是否能解决问题&让人们高兴；只有到那时*才会尝试让它盈利。目标永远是第一位的。满足感也是如此。收入总是排在第二位。当然，这种方法以前也让我吃了一顿苦头，但我不在乎。当它奏效时，结果是令人惊叹的。这个项目勾选了这些方框。\n虽然RanchWork.com不是一家由风投投资的华而不实的公司，甚至也不是什么高达6位数的收入来源，但我并不是不在乎。该网站并不在意。因为太忙了。在工作。安静。\n我的推特朋友伊恩·纳托尔(Ian Nutall)恰如其分地将这些类型的项目定义为美好、谦逊的互联网企业。\n…。我很自豪能成为这个求职委员会的老板。\n虽然我拥有并运营RanchWork.com，但我并不拥有这个利基行业的.com名称。那就是RanchJobs.com。它属于第三方所有，而且还没有开发。\n所以在2018年，我联系了店主。我很幸运，在这方面--他回答说。我们有共同的朋友，所以这很有帮助。电子邮件：\n他知道我的RanchWork项目，价位反映了这一点。他不会再往下走了。我无法理解这个价格，所以我把它搁置了。\n直到2020年，也就是两年后。当新冠肺炎击球的时候。金融界出现了横盘走势。我也有点累了。不过，这个域名突然浮现在我的脑海里。这可能是一个机会。\n所以我利用了一个第三方域名市场平台，在那里我可以保持某种程度的匿名。我提交了2500美元的报价。\n市场上的一位经纪人打来电话。好人。他像域名经纪人应该做的那样进行了调查。他问他们是否会降到5000美元，如果这是一个我们会考虑的范围。我不确定。\n我明白，我正处在一个光环之中，这个价格可能会像它出现的那样迅速消失，所以我继续前进，接受了它。\n不过，看看这个域名在浏览器中被输入了多少次是很有趣的(每月238次，通过重定向进行跟踪)。如果我从广告的角度来看，对每次访问收取0.50美元的CPC，这个域名到2023年应该会有回报。🤠", "note_en": "He’d let me look at his domain name portfolio. Not names he owned and parked, but domains he owned &amp; developed. This was another early project of his – a job board solely focused on the ranching industry. All aspects – cattle, outfitters, dude/guest, hunting, and even associated businesses like horseback riding. He’d launched it in 1998, and done an admirable job developing the brand and building an audience. But other projects had hijacked his attention, and the site had become a bit stale. Its revenue had evaporated.\n I knew David from a partnership between DudeRanch.com (mine, at the time) &amp; GuestRanches.com (his). We had grouped them together to sell advertising. A handshake deal. Stronger together, we assumed. And we were right. Over the years, we were able to (more than) double revenue by leveraging the authority of our sites as one entity, versus two.\n The more we worked together, the more we shared business opportunities with one another. At one point he shared his portfolio with me,  and that’s when I discovered  RanchWork.com .\n At that time, I’d been poking around for a second project to develop, and came up empty after a year or so of searching. My usual avenue for acquisition, the  expiring domain name market, hadn’t yielded anything of value, so my wandering mind lead me to David.\n When I uncovered RanchWork, it reminded me of a friend –  Shane Pike – who’d built, developed, and successfully sold a nursing job board several years before. And from what I remember, he did it solo. The straightforward nature of job boards was attractive – direct, simple, &amp; sans-fluff.\n The niche was compelling, so after I slept on it, I pinged David. To see if he’d let me test a project on it. I was already deeply entrenched in the dude ranching industry, so it seemed like a natural extension. The rough idea was this:\n Point the RanchWork.com nameservers to me, and I’ll cover the costs of re-development, plus oversight &amp; maintenance.\n Once developed, I’d allow  free job listings for ranchers to encourage a regular stream of postings.\n I’d also allow  paid listings (which would post at a faster clip, and remain active for a longer period.\n To ensure simplicity, I’d avoid any type of login or account creation. If a rancher was hiring, they’d simply fill out a form, enter credit card info (if needed), and submit. Done deal.\n David would receive 25% of all job board revenue the site collected; the remaining 75% would fall into my pocket. Ad publisher revenue was also under my wing.\n What makes it easy (&amp; fun) to work with David is his ‘ screw it, let’s do it‘ attitude. I very much admire that about him, as I tend to follow the same outlook on life. And he brought that spirit into this project as well.\n   Now, sure, from the outset, I could have viewed this idea from a defeatist attitude, that being, “What? I’m gonna try to compete with Indeed, SimplyHired, Monster, and the like? They’re VC backed heavyweights… I have no chance.”\n I rarely approach projects from this mindset. I tend to approach them from the perspective, “what do I have to lose”. And usually, the answer is “not much”. And then that thought morphs into “let’s see what kinda shit I can stir up”.\n So to start, I purchased a $60 job board theme, and took a full week to properly architect the site for mobile devices and seo. I researched competitors. $25 seemed like the average rate for paid job postings, so that became my base price. Another close friend,  Brian Clapp, suggested I add a ‘Job Wanted’ listing for folks searching for ranch employment. I was skeptical that need existed, but added it anyway. And then I happily overpaid for the fastest, most reliable WordPress host I could find.\n       At first, I seeded all the jobs myself. Then ranchers started submitting their own. Then I shifted into curation &amp; verification.\n   From virtually zero traffic, the site ramped up to roughly 40k-50k visitors a month. Typically 200,000 pageviews every 30 days. I had to start managing overage fees with my hosting provider.\n  As the sole curator, I made sure they followed the singular track I defined. And overall, they did.\n Jobs like this, where you  had to ride a mule to &amp; from your work location at the Grand Canyon.\n Or this one, for a  Mountain Permit Rider, responsible for all for all aspects of yearling cattle care &amp; management in private ranch pastures and mountain forest grazing allotments near Cody, Wyoming.\n             And even that one at the beginning of the essay. ( nyeh, no need to scroll back up, here it is again).\n  The more jobs (and job wanted) postings we listed, the more positive feedback we’d receive. That we were a great help for a remote ranch with limited hiring resources. That they were in financial straits, and our Free offering allowed them to hire the right Manager to turn their operation around.  And the avenue I was most skeptical about – Job Wanted postings – wound up assisting individuals who craved an escape from the city into life on a working ranch (as well as contributing 30% of our overall revenue). &gt;&gt;  gracias, Mr. Clapp\n The feeling was familiar. It felt like my  Vidalia project. That I was making a positive impact. Satisfying a unique pain point, subtly, as a solo operator.\n This project – originally a passing glance – became my mini workhorse. And such a proud production that I wound up buying the whole project from David in 2017. I doubled down in 2019 by investing $10k into a fancier backend and refreshed design. The site deserved that – a proper identity.\n  I tend to approach online businesses this way. Not intentionally – I just found myself on this path. Find a good domain name; build a product/service; see if it solves a problem &amp; makes people happy;  *and only then* attempt to make it profitable. Purpose always comes first. As does contentment. Revenue always comes second. Sure, this approach has bitten me in the ass before, but I don’t care. When it’s worked, the results are wondrous. And this project checked those boxes.\n And while RanchWork.com isn’t a flashy VC funded endeavor, or even some high flying 6-figure revenue generator, it’s not that I don’t care. The  site doesn’t care. Cause it’s too busy. Working. Quietly.\n My Twitter friend  Ian Nuttall identifies these types of projects aptly; as nice,  humble internet businesses.\n  … and I’m quite proud to be this job board’s proprietor.\n      While I owned and operated RanchWork.com, I didn’t own the .com name of this niche industry. That being  RanchJobs.com. It was owned by a 3rd party, and undeveloped.\n  So in 2018, I reached out to the owner. I got lucky, in that – – he responded. We had mutual friends, so that helped. The email:\n  He was aware of my RanchWork project, and the price point reflected that. And he wouldn’t go lower. I couldn’t wrap my head around the price, so I shelved it.\n Until 2020, two years later. When COVID-19 hit. The financial world went sideways. I was a bit frazzled as well. This domain name bubbled up into my brain, though. That this might be an opportunity.\n So I leveraged a 3rd party domain marketplace platform where I could remain somewhat anonymous. I submitted an offer of $2,500.\n   A broker from the marketplace called. Nice guy. He probed like a domain broker should do. He asked if they got down to $5k, if it’d be a range we’d consider. I wasn’t sure.\n  I understood I was in a halo of time where this price could disappear as quickly as it appeared, so I went ahead &amp; accepted it.\n  It’s fun to see how many times this domain is typed into a browser, though (238 times per month, tracked via re-direct). If I look at it from an advertising perspective, &amp; apply a $0.50  CPC to each visit, this domain should pay for itself by 2023. 🤠", "posttime": "2020-07-01 00:33:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "骡子,mule,项目", "title": "必须骑骡子(往返)工作地点", "title_en": "Must ride mule (to and from) work location", "transed": 1, "url": "https://www.deepsouthventures.com/must-ride-mule-to-from-work-location/", "via": "", "real_tags": ["骡子", "mule", "项目"]}, {"category": "", "categoryclass": "", "imagename": "f670f104db8c5ea30232dec77c5c066d.jpg", "infoid": 1009076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高管们告诉Axios，从今天开始，Facebook将更新其News Feed中新闻故事的排名方式，以优先考虑原创报道。它还将降级那些对谁写的故事不透明的故事。\n重要原因：这家科技巨头长期以来一直被批评没有采取足够的措施来提升高质量的新闻，而不是超党派的噪音。现在，随着2020年大选的日益临近，它正试图领先于这一说法。\n细节：Facebook表示，为了确定要推广哪些原创故事，它将使用人工智能来分析特定故事主题的文章组，并找出最常被引用为原创来源的文章。\n这不会显著改变大多数用户的新闻订阅体验，因为Facebook仍然只会展示他们或他们的朋友关注的新闻媒体的故事。但这家科技巨头将在这一子集内推动更具原创性的故事。\n该公司一直在与出版业高管在商业和编辑方面进行积极对话，以帮助定义原创报道，这样它就可以在进行用户研究的同时，将信号纳入其算法，以提振原创故事。\n算法的改变只适用于新闻故事。目前，这家科技巨头正专注于英文故事。它希望在未来扩展到其他语言。\n字里行间：除了这些变化，Facebook还将开始在其算法中对没有署名的新闻进行降级，或者在出版商的网站上展示该公司编辑人员的信息。\n它说，在某些市场，这可能更难执行，因为匿名是用来保护记者的。\n大局：新闻聚合在过去几年里发生了巨大变化，因为平台面临着清理内容的压力。\nFacebook和竞争对手谷歌(Google)的算法过去常常奖励那些制作快速、热闹、易于聚合的内容的出版商，现在正在调整算法，奖励更有想法、更具原创性的内容。\n谷歌去年表示，它调整了算法和对其搜索结果进行评级的人使用的指导方针，以提升原创报道。\n下一步是什么：Facebook表示，出版商可以从原创报道中看到流量的增长，但它预计大多数新闻出版商在News Feed中的分发不会因为这些变化而发生重大变化。\n归根结底：这是一个微小但具体的调整，Facebook可以指出这是在做一些事情，将错误信息降至最低。", "note_en": "Beginning today, Facebook will be updating the way news stories are ranked in its News Feed to prioritize original reporting, executives tell Axios. It will also demote stories that aren&#39;t transparent about who has written them.\n Why it matters: The tech giant has long been criticized for not doing enough to elevate quality news over hyper-partisan noise. Now, it&#39;s trying to get ahead of that narrative as the 2020 election inches closer.\n Details: Facebook says that in order to identify which original stories to promote, it will use artificial intelligence to analyze groups of articles on a particular story topic and identify the ones most often cited as the original source.\n This won&#39;t change the News Feed experience dramatically for most users, because Facebook will still only showcase stories from news outlets that they or their friends follow. But the tech giant will boost the more original story within that subset.\n The company has been having active conversations with publishing executives, on both the business and editorial sides, to help define &#34;original reporting&#34; so that it can build signals into its algorithms to boost original stories, along with conducting user research.\n The algorithm changes only apply to news stories. For now, the tech giant is focusing on stories in English. It hopes to expand to other languages in the future.\n Between the lines: In conjunction with those changes, Facebook will also begin to down-rank news in its algorithm that doesn&#39;t have bylines, or present information about the company&#39;s editorial staff on the publishers&#39; website.\n It says that in certain markets, this may be tougher to enforce because anonymity is used to protect journalists.\n The big picture: News aggregation has changed dramatically over the past few years as platforms face pressure to clean up their content.\n Algorithms at Facebook and rival Google, which used to reward publishers that produced quick, buzzy content that was easy to aggregate, are now being adjusted to reward more thoughtful, original content.\n  Google  said last year that it adjusted its algorithms and the  guidelines used by the people that rate its search results to elevate original reporting.\n What&#39;s next: Facebook says publishers could see a traffic boost from original reports, but it anticipates that most news publishers won’t see significant changes to their distribution in News Feed due to the changes.\n The bottom line: It&#39;s a minor but concrete tweak that Facebook can point to as doing something to minimize misinformation.", "posttime": "2020-07-01 00:32:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,facebook,改变,algorithm,新闻", "title": "Facebook改变算法以促进原创报道", "title_en": "Facebook changes algorithm to boost original reporting", "transed": 1, "url": "https://www.axios.com/facebook-algorithm-original-reporting-e127c8b7-c749-4120-a65e-239b55d18758.html", "via": "", "real_tags": ["算法", "facebook", "改变", "algorithm", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "8ca8a4ea7e1e2b09fd15c3cbd192acff.jpg", "infoid": 1009075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "iOS 14中有一项新功能，当应用程序读取剪贴板时会提醒用户，事实证明，一些应用程序一直在过度读取剪贴板数据。\n例如，升级到‌IOS 14‌的Jeremy Burge TikTok用户很快就会注意到持续不断的警报，警告他们TikTok每隔几秒钟就会访问剪贴板。被抓后，TikTok现在表示将删除该功能。\n好的，TikTok每1-3次击键就会抓取我剪贴板上的内容。‌IOS 14‌发布了新的粘贴通知pic.twitter.com/osxp43t5sz-Jeremy Burge(@jeremyburge)。\nTikTok在给“每日电讯报”的一份声明中表示，它访问剪贴板是为了识别垃圾邮件行为。\n6月22日，‌iOS14‌测试版发布后，用户在使用一些流行的应用程序时看到了通知。\n对于TikTok来说，这是由一项旨在识别重复的垃圾邮件行为的功能触发的。我们已经向App Store提交了应用程序的更新版本，删除了反垃圾邮件功能，以消除任何潜在的混淆。\nTikTok致力于保护用户隐私，并对我们的应用程序的工作方式保持透明。\n删除该功能的更新已经提交给TikTokApp Store‌，新更新的下载证实TikTok似乎不再访问剪贴板。\nTikTok没有说明是否会从Android设备上删除这项功能，也没有说明剪贴板数据是否曾经从用户设备上存储或移动过。其他应用程序也被调用来阅读剪贴板，包括星巴克(Starbucks)、Overstock、AccuWeather、几个新闻应用程序等等。\n在‌iOS14‌发布之前，就有一对开发者敲响了警钟，让用户和苹果知道，苹果和苹果的应用程序正在悄悄访问剪贴板。作为回应，苹果似乎增加了新的‌iOS14‌功能，在用户不知道到底发生了什么的情况下，应用程序不再能够读取剪贴板。\n目前，‌iOS14‌仅限开发者使用，但苹果计划在该软件秋季发布前的下个月发布公开测试版。剪贴板报告只是‌IOS 14‌众多新隐私功能中的一个，我们的iOS 14综述中提供了完整的列表。\n这就是我留在苹果的原因。隐私是他们真正关心的东西，是他们的核心。\n我的一个问题是，为什么应用程序可以访问剪贴板？难道剪贴板不应该只在你粘贴东西的时候使用吗？应用程序会有API在未经许可的情况下抓取剪贴板内容，这似乎很荒谬，但显然一直都是这样。\n如果有一款应用因为侵犯用户隐私而需要从应用商店启动，那就是TikTok。太糟糕了，它变得太受欢迎了，苹果再也不能在没有强烈反弹的情况下把它解雇了。TikTok基本上是对Vine的抄袭。为什么该死的Vine没有流行起来，而TikTok却流行起来了？叹气。\n如果这是合法的反垃圾邮件功能，他们为什么要删除它？哦，因为它不是一家公司，而TikTok是一家肮脏的*公司。\niOS 14中有一项新功能，当应用程序读取剪贴板时会提醒用户，事实证明，一些应用程序一直在过度读取剪贴板数据。例如，升级到iOS 14的Jeremy Burge TikTok用户很快就会注意到持续不断的警报，警告他们TikTok每隔几秒钟就会访问剪贴板。被抓后，TikTok现在表示将删除该功能。好的那么..。\n在MacRumors获得的一份研究报告中，分析师郭明志(音译)今天表示，iPhone12机型将不包括EarPods或盒子中的电源适配器。这与巴克莱(Barclays)分析师本周早些时候分享的预测一致。郭说，苹果将转而发布一款新的20W电源适配器，作为iPhone的可选附件，并停止生产现有的5W和18W电源适配器…。\n据一位可靠的手机泄密者透露，苹果即将推出的iPhone12Pro和iPhone12Pro Max将配备刷新率高达120 Hz的显示屏，从而提供更流畅的屏幕体验。可靠的消息来源，如果没有意外，iPhone 12 Pro和iPhone 12 Pro Max已经基本确定了最大120 Hz的刷新率。-Ice宇宙(@Universal seIce)2020年6月26日&#34；A…。\n人们普遍预计苹果将在今年晚些时候发布四款新的iPhone 12，英国巴克莱银行(Barclays)的分析师根据与多家苹果供应商的讨论，提前概述了他们对这些设备的预期。在MacRumors获得的一份研究报告中，巴克莱分析师表示，iPhone12机型将不会附带EarPods，这与预测一致…。\n微软今天宣布将永久关闭其全球实体店。该公司的零售员工将继续通过微软的公司办公室和远程为客户提供服务，提供销售、培训和支持。微软将继续运营其在线店面，它还计划为纽约市的客户重新打造体验中心。\nWWDC今年在网上举行，但仍然充斥着公告，包括iOS 14，iPadOS 14，MacOS Big Sur，WatchOS 7，TVOS 14，以及苹果确认了长期传言的计划，将为未来的Mac过渡到自己定制的处理器。遗憾的是，没有看到重新设计的iMac，但这仍然是今年晚些时候的事情。每周都有这么多谣言流传，这.。\n苹果公司今天发布了AirPods Pro的新固件更新，将现有的2D15固件升级到2D27。目前还没有关于更新后的固件中包含哪些内容的详细信息，但是AirPods Pro用户一直在抱怨有源噪音消除和爆裂或爆裂的声音问题。苹果公司还为……增加了一项新的空间音频功能。\n苹果计划在2020年下半年推出新的10.8英寸iPad，随后在2021年上半年推出新的8.5英寸iPad，经常可靠的分析师郭明志今天在MacRumors获得的一份研究报告中表示。郭台铭没有具体说明10.8英寸的iPad型号将是现有10.2英寸iPad的新版本，还是10.5英寸iPad Air的新版本，但他之前曾表示，8.5英寸的iPad Air将会是10.8英寸iPad的新版本，而10.5英寸的iPad Air将是10.5英寸iPad Air的新版本.。\n苹果的iOS14更新为Photos应用程序增加了几个新功能，包括直接从iPhone为图片添加字幕的选项，这是Photos用户很长一段时间以来一直想要的。Mac版的Photos应用程序之前通过Description字段支持字幕，但在iPhone上，还没有添加类似信息的方法。在iOS 14中，输入一个.\n苹果软件首席执行官克雷格·费德里吉(Craig Federighi)经常在WWDC活动之后接受一系列采访，2020年也不例外。费德里吉与Dling Fireball的约翰·格鲁伯一起参加了脱口秀节目，他还采访了科技YouTuber马奎斯·布朗利(Marque Brownlee)。在今天发布的一段视频中，费德里吉和布朗利讨论了iOS14的一些新功能，并回答了苹果粉丝的问题。在.。", "note_en": "A new feature in  iOS 14  alerts users when apps read the clipboard, and it turns out some apps have been reading clipboard data excessively.\n Image via Jeremy Burge TikTok users who upgraded to ‌iOS 14‌, for example, quickly noticed constant alerts warning them that TikTok was accessing the clipboard every few seconds. After being caught, TikTok now says that it&#39;s removing the feature.\n Okay so TikTok is grabbing the contents of my clipboard every 1-3 keystrokes. ‌iOS 14‌ is snitching on it with the new paste notification  pic.twitter.com/OSXP43t5SZ— Jeremy Burge (@jeremyburge)  June 24, 2020\n In a statement to   The Telegraph, TikTok said that it accessed the clipboard to identify spammy behavior.\n &#34;Following the beta release of ‌iOS 14‌ on June 22, users saw notifications while using a number of popular apps.\n &#34;For TikTok, this was triggered by a feature designed to identify repetitive, spammy behavior. We have already submitted an updated version of the app to the  App Store removing the anti-spam feature to eliminate any potential confusion.\n &#34;TikTok is committed to protecting users&#39; privacy and being transparent about how our app works.&#34;\n An update to remove the feature has already been submitted to the ‌App Store‌, and a download of the new update confirms that TikTok no longer appears to be accessing the clipboard.\n TikTok did not say whether the feature would be removed from Android devices, nor whether clipboard data was ever stored or moved from user devices. Other apps have also been called out for reading the clipboard, including Starbucks, Overstock, AccuWeather, several news apps, and more.\n Prior to when ‌iOS 14‌ was released, a pair of developers  sounded an alarm letting users and Apple know that  iPhone and  iPad apps were quietly accessing the clipboard. Apple&#39;s new ‌iOS 14‌ feature appears to have been added in response, and apps are no longer able to read the clipboard without users knowing exactly what&#39;s going on.\n ‌iOS 14‌ is limited to developers at the current time, but Apple plans to release a public beta version next month ahead of the software&#39;s fall launch. Clipboard reporting is just one of the many new privacy features in ‌iOS 14‌, with a full list  available in our iOS 14 roundup.\n Exactly why I stay with Apple. Privacy is something they truly care about; to their core.\n One question I have is why do apps have access to the clipboard AT ALL?  Shouldn&#39;t the clipboard only be used when you PASTE something? It seems absurd that there&#39;d be an API for an app to grab the clipboard contents without permission, and yet apparently it&#39;s been the case all along.\n If there were ever an app that needed to be booted from the app store for compromising user privacy, it&#39;s Tiktok. It&#39;s too bad it&#39;s gotten too popular and Apple can no longer give it the boot without massive backlash.  Tiktok is basically a ripoff of Vine. Why the HELL didn&#39;t Vine catch on, but Tiktok did? Sigh.\n  If this was a legitimate anti-spam feature, why would they remove it? Oh, because it wasn&#39;t and TikTok is a slimey, ****** company.\n  A new feature in iOS 14 alerts users when apps read the clipboard, and it turns out some apps have been reading clipboard data excessively. Image via Jeremy Burge TikTok users who upgraded to iOS 14, for example, quickly noticed constant alerts warning them that TikTok was accessing the clipboard every few seconds. After being caught, TikTok now says that it&#39;s removing the feature. Okay so ...\n iPhone 12 models will not include EarPods or a power adapter in the box, analyst Ming-Chi Kuo said today in a research note obtained by MacRumors. This lines up with a prediction shared by analysts at Barclays earlier this week.\rKuo said that Apple will instead release a new 20W power adapter as an optional accessory for iPhones and end production of its existing 5W and 18W power adapters...\n Apple&#39;s upcoming &#34;iPhone 12 Pro&#34; and &#34;iPhone 12 Pro Max&#34; will feature displays capable of up to 120Hz refresh rates, allowing for a smoother on-screen experience, according to a reliable mobile leaker. A reliable source, if there is no accident, iPhone 12 Pro and iPhone 12 Pro Max have basically determined the maximum 120Hz refresh rate.— Ice universe (@UniverseIce) June 26, 2020 &#34;A...\n Apple is widely expected to release four new iPhone 12 models later this year, and ahead of time, analysts at British bank Barclays have outlined their expectations for the devices based on discussions with multiple Apple suppliers.\rIn a research note obtained by MacRumors, the Barclays analysts said that iPhone 12 models will not come with EarPods in the box, in line with a prediction...\n Microsoft today announced that it is permanently closing its physical stores worldwide. The company&#39;s retail employees will continue to serve customers through Microsoft&#39;s corporate offices and remotely, providing sales, training, and support. Microsoft will continue to operate its online storefront, and it also has plans for reimagined &#34;Experience Centers&#34; for customers in New York City,...\n WWDC was held online this year, but it was still packed with announcements, including iOS 14, iPadOS 14, macOS Big Sur, watchOS 7, tvOS 14, and Apple confirming its long-rumored plans to transition to its own custom-designed processors for future Macs. Sadly, there was no sight of a redesigned iMac, but that is still on the table for later this year.\rWith so many rumors shared every week, it ...\n Apple today released a new firmware update for the AirPods Pro, upgrading the existing 2D15 firmware to 2D27.\rNo details are available on what&#39;s included in the refreshed firmware at this time, but there have been ongoing complaints from AirPods Pro users about issues with Active Noise Cancellation and crackling or popping sounds.\rApple is also adding a new spatial audio feature to the...\n Apple plans to launch a new 10.8-inch iPad in the second half of 2020, followed by a new 8.5-inch iPad in the first half of 2021, oft-reliable analyst Ming-Chi Kuo said today in a research note obtained by MacRumors.\rKuo did not specify if the 10.8-inch iPad model will be a new version of the existing 10.2-inch iPad or the 10.5-inch iPad Air, but he has previously said that the 8.5-inch...\n Apple&#39;s iOS 14 update adds several new features to the Photos app, including an option to add captions to images right from the iPhone, which is something that Photos users have been wanting for quite some time.\rThe Photos app for Mac previously supported captions through the Description field, but on the iPhone, there has been no method for adding similar information. In iOS 14, entering a...\n Apple&#39;s software chief Craig Federighi often does a series of interviews following WWDC events, and 2020 has been no exception. Federighi was on the The Talk Show with Daring Fireball&#39;s John Gruber, and he also spoke with tech YouTuber Marques Brownlee.\rIn a video published today, Federighi and Brownlee discussed some of the new features in iOS 14 and answered questions from Apple fans.\rOn...", "posttime": "2020-07-01 00:31:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,苹果", "title": "TikTok App被抓后停止访问用户剪贴板", "title_en": "TikTok App to Stop Accessing User Clipboards After Being Caught in the Act", "transed": 1, "url": "https://www.macrumors.com/2020/06/25/tiktok-clipboard-access-ios-14-caught/", "via": "", "real_tags": ["app", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大衰退始于2008年，每个人都受到了影响-互联网档案馆雇佣了146名失业父母，利用奥巴马的刺激福利到工作计划，为视障人士扫描书籍。我让员工调查他们的财务状况，答案是…。坏的。\n这是一个关键：他们大约30-60%的收入花在了租金上。是的，事实证明这在全国都是典型的。所以我开始寻找解决这个问题的方法，至少对非营利性工作者来说是这样。我读了格雷伯的书“债务”(太棒了，必读的书)，然后开始做实验。\n在过去的10年里，我亲自尝试了6种方法，并看到了另一种方法，以下是简短的版本：\n1.基础住房：这是永久负担得起的员工公寓--每月约900-1000美元，约为旧金山基于市场的租金的1/2-1/3。我们做到这一点的方式是让它永久无债务(没有抵押贷款)，并有费用住在一套公寓里，覆盖所有其他费用。由于这就像是教职员工的住房或修道院，人们离开住房就像他们离开非营利性部门一样。我们在旧金山买了一栋有11个单元的公寓楼(作为捐赠的一种形式)，进行了试用。现在11套公寓中有3套都有非营利性工作人员。他说它运行得很好，但没有节省档案馆的很多钱，但却给人们带来了保障。另一方面，一名员工说，他们感觉有点被困住了，因为他们负担不起搬出去留在旧金山的费用。但大多数员工不想搬进来，因为他们已经有了自己满意的公寓，所以它不能满足巨大的需求。这可以通过谨慎的投资策略来完成，所以购买这些建筑的成本不会很高。新闻报道。\n2.无声贷款：借给某人足够的钱，让他们可以支付首付，我没有改变利息。*没有文书工作，在他们找到房子之前已经在他们的银行账户上好几年了。*所以它帮助了他们，他们很感激，但这是不可扩展的。\n3.20%的抵押贷款帮手：我是一家非营利性组织的董事会成员，该组织做了这个项目，其中拨出100万美元，帮助人们在办公室骑自行车的范围内获得抵押贷款-20%的帮助在他们在那里工作期间是零利率，但当他们离开非营利组织时，利率会上升到市场利率。当他们离开时，预计他们会通过再融资来偿还。“随着房价的上涨，这一切都很好。不知道什么时候会下跌。”当它开始的时候，人们非常热情，因为它让许多人在旧金山购物，并感到得到了支持。但最近一直有人抱怨，不知道为什么。\n4.成立信用社，成立一家“不烂”的银行(这是我们最初的非官方座右铭)，并帮助为可持续的住房提供资金。嗯，我们花了5年，一年半的时间才让最初的章程通过了这个系统，然后监管机构花了三年半的时间把我们赶尽杀绝，他们真的不想在银行领域出现新的信用社或新的想法，全国信用社协会应该被关闭--美国信用社行业在1972年NCUA成立之前就已经蓬勃发展起来了。纽约时报报道。\n5.在互联网档案馆旁边建一座大楼。“我们有空地可以做，我们雇了一位建筑师，但出来的费用太高了，我们推迟了。”\n6.共同拥有一套房子--这与贷款不同，它更像是一份所有权，分担风险和回报。高达一半的评估价值，以现金形式给予业主，这样他们就可以继续负担得起留在该地区的费用。当他们最终出售时，那么这部分收益就会返还。这已经和几个亲密的朋友一起尝试过了，他们用它来偿还抵押贷款，所以他们完全拥有自己的一半。到目前为止，这个项目运作良好，但还没有人卖出他们的房子。对于居民业主来说，在房屋价值下降的情况下，或者如果他们失去偿还贷款的能力，这比抵押贷款更安全，在这种共同拥有的情况下，他们没有抵押贷款，所以他们不会被取消抵押品赎回权，不得不离开他们的房子。但这样做对我来说是有财务风险的。\n7.异地办公：互联网档案馆在湾区外积极招聘，鼓励群众不搬迁。旧金山的许多员工现在已经搬走了，但仍然保住了自己的工作。“这种做法经常奏效。”过去3年来，我们一直在雇佣远程员工，现在大多数人都不在旧金山湾区。“随着令人愉悦的流行病，我们正在”远程优先“，所以我们都是远程的，旧金山的员工是个例外。”我们一直在适应远程管理，这并不容易。\n在所有的方法中，效果最好的是#7：远程工作。如果我们熟练使用它，我们就不会有旧金山那样的住房压力。\n我预计其他人正在尝试不同的方法-请分享它们-我们需要找到让非营利组织员工快乐、高效和经济安全的方法。", "note_en": "The Great Recession started in 2008 and everyone suffered– the Internet Archive hired 146 out-of-work parents, leveraging an Obama stimulus welfare-to-work program to scan books  for the visually impaired.   I had employees polled as to how they were doing financially, and the answer was… Bad.\n This was the kicker:  30-60% of their income went to rent.  Yikes, and turns out to be typical across the country.  So I set out to find a way to fix this, at least for non-profit workers. I read Graeber’s book  Debt (fabulous, must read book), and started on experiments.\n Over the last 10 years, I have personally tried 6 approaches, and seen another, here are the short versions:\n  1.  Foundation Housing:  this is permanently affordable employee apartments– about $900-$1000 a month which is about 1/2-1/3 of market based rent in San Francisco. The way we did this is to have it be permanently debt-free (no mortgage), and have the fee to live in an apartment covering all other costs. Since this is like faculty housing or a monastery, people leave the housing as they leave the non-profit sector. We bought an apartment building (as a form of endowment) in San Francisco with 11 units, trying it out.  Three out of 11 apartments now have non-profit workers.  It is working pretty well, but not saving the Archive much money but giving security to people.  On the other hand, one employee said they felt a bit trapped because they can not afford to move out and stay in San Francisco.  Most employees don’t want to move in because they already have apartments they are happy with, so it is not serving a huge need.  But still, I think we should do more of these. It can be done with a careful investment strategy so it does not cost much to buy the buildings.  News report.\n 2. Silent loan: lent someone enough money so they could make a down payment, and I changed no interest.  There was no paperwork, and was in their bank account for years before they found their house.  So it helped them out, and they are thankful but it is not scalable.\n 3. 20% mortgage helper: I am on the board of a non-profit that has done this program where $1m was set aside to help people with getting a mortgage on a house within biking range of the office– the 20% help is 0 interest while they work there, but then it goes up to market rate when they leave the non-profit. When they leave, they are expected to pay it back by refinancing.  It has worked out well as housing prices have gone up.  Unknown when things go down. When it started there was great enthusiasm as it allowed many to buy in San Francisco and feel supported.  Recently there has been grumbles about it, not sure why.\n  4. Made a credit union to make a bank “that doesn’t suck.”  (that was our original unofficial motto) and to help finance sustainable housing. Well, we worked at it for 5 years, one and a half years to get the initial charter through the system, and then the regulators spent three and half years  crushing us out of existence.   They really really do not want new credit unions or new ideas in the banking area.  The National Credit Union Association should be shut down– the US credit union industry blossomed and grew before the NCUA was started in 1972.  NYtimes report.\n 5. Build a building next to the Internet Archive.  We have the empty lot to do it in and we hired an architect but it came out to cost so much we postponed.\n 6. Co-owning a house– this is different from a loan, it is more like a share of ownership and sharing the risk and reward. Up to half of the appraised value, in cash, is given to the owner so they continue to afford to be in the area. When they eventually sell, then that proportion of the proceeds is returned. This has been tried with a couple of close friends and they used it to pay off their mortgage, so they own their half outright. This is working well so far, but have not had any sell their house yet. This is more secure for the resident owner than a mortgage in the case of the value of the house declining, or if they lose the ability to pay the loan, in this co-owning case they do not have a mortgage so they do not get foreclosed on and have to leave their house. But there is financial risk to me in doing this approach.\n 7. Remote work.  The Internet Archive actively recruits outside of the bay area and encourages people to not relocate. Many San Francisco employees have now moved away but kept their jobs.  This has worked more often than not.  We have been hiring remote workers for the last 3 years and now a majority of people are not in the Bay Area.  And with the covid pandemic, we are going “remote first” so we are all remote, and the exception is the ones that are in San Francisco.  We have been adapting to remote management, which is not easy.\n Of all the approaches, the one working the best is #7: Remote Work.  Get good at it, and we won’t have the housing stresses of San Francisco.\n I expect others are trying different approaches– please share them– we need to find ways to keep non-profit workers happy, productive and financially secure.", "posttime": "2020-07-01 00:31:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,providing,员工", "title": "为非营利性工作者提供经济适用房的途径", "title_en": "Approaches to providing affordable housing for non-profit workers", "transed": 1, "url": "http://brewster.kahle.org/2020/06/28/results-of-7-approaches-to-affordable-housing-for-non-profit-workers/", "via": "", "real_tags": ["提供", "providing", "员工"]}, {"category": "", "categoryclass": "", "imagename": "3a90569d9582633c6e6555e4fcb33690.jpg", "infoid": 1009073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两家领先的盒式磁带存储制造商之一富士胶片声称，他们的技术路线图一直持续到2030年，它建立在当前磁带范例的基础上，实现每盘磁带400 TB。\n正如Block and Files的Chris Mellor所报告的那样，Fujifilm指出使用锶铁氧体颗粒是为了在磁带上实现224 Gbit/平方英寸的区域数据密度，这将支持400 TB驱动器。IBM和索尼已经在2017年展示了每平方英寸201Gbit的技术，该技术可能会在2026年发布，用于大规模生产。目前的驱动器要小一个数量级以上，仅为每平方英寸8千兆位，但研究和批量生产之间的延迟相当大。\n锶铁氧体将取代目前LTO盒体中的钡铁氧体。在元素周期表中，锶位于钡的上方，这表明它是一个小得多的原子。这使得更小的颗粒可以被放入轨道，值得庆幸的是，根据富士胶片的说法，锶铁氧体表现出与钡铁氧体相同的特性，但更多，能够实现更高的性能，同时增加颗粒密度。\n在标准的LTO命名体系中，我们当前使用的是LTO-8，其中驱动器具有12 TB的原始容量。最近几代LTO的增长往往会使容量翻一番，因此我们将LTO-13用于384 TB驱动器。Mellor指出，连续的LTO驱动器标准的商业化间隔似乎平均为2.5年，这导致了下表：\n当前一代的LTO-8墨盒至少需要9小时16秒才能装满，预计未来驱动器的速度甚至会进一步提高。当前的LTO规格已上升到LTO-12，因此LTO-13一代将提供400 TB的容量。\n富士胶片表示，400TB是锶铁氧体的极限，这表明需要新的材料才能超越。这就是说，我们谈论的存储容量只有224Gbit/平方英寸，与今天超过1000Gbit/平方英寸的机械硬盘相比，如果技术能够融合，顶层似乎有足够的空间。\n当前LTO-8磁带的价格是所有存储介质中最低的。根据容量的不同，每GB 0.8-1美分左右的价格相当常见。目前，只有索尼和富士胶片是LTO-8媒体的授权商，而其他公司，如HPE和IBM，则以自己的品牌转售模型。\n发表评论很高兴看到原始容量被引用，而不是压缩。我们可以为&gt；100 TB使用更好形式的存储技术。可能是基于光学的，希望是可重写的。磁带、硬盘和NAND都有恼人的缺点。是的，甚至一些消费者/家庭用户也可以使用100 TB或更大的驱动器。回覆\n在224Gbit/英寸时，位小到54 nm。基于光学的技术必须有一个数量级的波长才能获得这些密度。54纳米是极端的紫外光，会腐蚀掉大多数材料，更不用说聚焦这种光有多难了。你根本不可能有一个UV浸没式光刻介质来储存。一台阅读器将花费数百万美元，而且和一辆汽车一样大。光存储未来主义科幻小说的最后时刻是翻拍TRON电影。很抱歉用无聊的现实毁了一个好的科幻幻想。回覆。\n诚然，光存储在2D中是不可行的。但它仍然是一个可行的3D竞争者。只有一个很小的问题要做到这一点：D回答。\n也就是说，我希望有更便宜的LTO-6-8作家。LTO-6介质(原始容量为2.5 TB)的成本不到25美元。回覆。\nhttps://en.wikipedia.org/wiki/Holographic_data_sto.。https://en.wikipedia.org/wiki/5D_optical_data_stor.。https://www.5dmemorycrystal.com/technology/我使用的是尽可能广泛的光学技术，因为我们不知道哪种特定技术会在便携式数据存储领域胜出。但很明显，在&gt；100TB范围内有很多光驱可供选择。回覆。\n我相信四层BD-RE XL已经在推动光学介质的边界。这些是10美元/0.1TB。LTO为25美元/2.5TB。数量级的差异。回覆。\n也许可以把话题改成“存储磁带”，这样人们就不会认为他们很快就会看到那么大的硬盘。回覆。\n我喜欢LTO不断发展的方式，也因为这意味着老一辈人变得负担得起家庭/消费者使用的费用。LTO-4和LTO-5驱动器相当便宜(注意：LTO-5本机容量是1.5 TB，而不是1.6 TB)。回覆", "note_en": "One of the two leading manufacturers of tape cartridge storage, FujiFilm, claims that they have a technology roadmap through to 2030 which builds on the current magnetic tape paradigm to enable 400 TB per tape.\n  As reported by  Chris Mellor of Blocks and Files, Fujifilm points to using Strontium Ferrite grains in order to enable an areal data density on tape of 224 Gbit-per-square-inch, which would enable 400 TB drives. IBM and Sony have already demonstrated 201 Gbit-per-square-inch technology in 2017, with a potential release of the technology for high volume production in 2026. Current drives are over an order of magnitude smaller, at 8 Gbit-per-square-inch, however the delay between research and mass production is quite significant.\n    Strontium Ferrite would replace Barium Ferrite in current LTO cartridges. Strontium sits on a row above Barium in the periodic table, indicating a much smaller atom. This enables for much smaller particles to be placed into tracks, and thankfully according to Fujifilm, Strontium Ferrite exhibits properties along the same lines as Barium Ferrite, but moreso, enabling higher performance while simultaneously increasing particle density.\n  In standard LTO nomenclature, we are currently on LTO-8 where the drives have 12 TB raw capacity. Recent generational increases in LTO tend to double the capacity, so we’re looking at LTO-13 for 384 TB drives. Mellor indicates that there seems to be an average 2.5 years between commercialization of successive LTO drive standards, which leads to the following table:\n    Current generation LTO-8 cartridges take at least 9h16 to fill, with predicted speeds on future drives increasing that even further. Current LTO specifications go up to LTO-12, and so 400 TB would thus come in the LTO-13 generation.\n    Fujifilm states that 400 TB is the limit of Strontium Ferrite, indicating that new materials would be needed to go beyond. That said, we are talking about only 224 Gbit-per-square-inch for storage, which compared to mechanical hard disks going beyhind 1000 Gbit-per-square-inch today, there would appear to be plenty of room at the top if the technologies could converge.\n  Prices for current LTO-8 tape are the lowest out of all storage media. Depending on volume, prices around 0.8-1 cent per gigabyte is fairly common. Currently only Sony and Fujifilm are licencees to create LTO-8 media, however other companies such as HPE and IBM resell models under their own brand.\n  POST A COMMENT      Nice to see raw capacity being quoted and not compressed.  We could use a better form of storage technology for &gt;100 TB. Probably optical-based, hopefully rewritable. Tape, HDD, and NAND all have annoying downsides. Yes, even some consumers/home users could use a 100 TB or larger drive.  Reply\n  At 224 Gbit/inch the bits are as small as 54 nm. Optical based technologies must have a wavelength of that order to get those densities. 54 nm is extreme UV light that would etch away most materials, not to mention how hard it would be to focus that light. You simply cant have a UV immersion lithography medium for storage. A reader would cost millions and be as large as a car. The optical storage futurism scifi had its last moments with the remake of the Tron movie.  Sorry for destroying a good scifi fantasy with boring reality.  Reply\n  True, optical storage is not viable in 2D. But it is still a viable 3D contender. There is just a tiny little problem of making it :D   Reply\n  That said, I would love to have much cheaper LTO-6-8 writers. LTO-6 media (2,5 TB raw) cost less then 25 USD.  Reply\n  https://en.wikipedia.org/wiki/Holographic_data_sto...  https://en.wikipedia.org/wiki/5D_optical_data_stor...  https://www.5dmemorycrystal.com/technology/  I am using &#34;optical&#34; in the broadest sense possible, since we don&#39;t know what specific technology would win out for portable data storage. But it is clear that there are &#34;optical&#34; options in the &gt;100 TB range.  Reply\n  I believe quad layer BD-RE XL already are pushing the boundaries of optical media. Those are 10 USD/0.1TB. LTO are 25 USD/2.5TB. An order of magnitude difference.  Reply\n  Maybe change the topic to &#34;storage tapes&#34; so people don&#39;t click on it thinking they&#39;ll see hard drives that big anytime soon.   Reply\n  I love how LTO keeps evolving - also, because that means that older generations become affordable for home/prosumer use. LTO-4 and LTO-5 drives are pretty cheap (Note: LTO-5 native capacity is 1.5 TB, not 1.6 TB).  Reply", "posttime": "2020-07-01 00:30:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "存储,storage,lto", "title": "我们未来的400 TB存储驱动器：富士胶片", "title_en": "400 TB Storage Drives in Our Future: Fujifilm", "transed": 1, "url": "https://www.anandtech.com/show/15888/400-tb-storage-drives-in-our-future-fujifilm", "via": "", "real_tags": ["存储", "storage", "lto"]}, {"category": "", "categoryclass": "", "imagename": "fe87a6d8d4468840ff2185af02eb4b65.jpg", "infoid": 1009072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月，面对冠状病毒大流行造成的混乱，互联网档案馆(IA)推出了国家紧急图书馆(NEL)。\n在现有开放图书馆的基础上，NEL为用户提供了100多万册图书的无限制借阅，IA希望这能帮助受隔离措施限制的“流离失所的学习者”。\n在大声疾呼反对开放图书馆和紧急图书馆之后，出版商阿歇特、哈珀柯林斯、约翰·威利和企鹅兰登书屋对互联网档案馆提起了大规模的版权侵权诉讼。\n出版商宣称这些图书馆不过是“盗版”服务，没有权利扫描和出借图书，即使是以受控的方式也是如此，出版商哀叹这对他们业务的直接威胁，并要求数百万美元的法定损害赔偿。\n本月早些时候，IA宣布提前关闭NEL，IA创始人布鲁斯特·卡勒(Brewster Kahle)呼吁结束诉讼，开始合作。这两个都没有公开的标志。事实上，敌对双方正在为采取行动做准备。\n昨晚，EFF宣布将与总部位于加州的Durie Tangri律师事务所联手为互联网档案馆辩护，他们称这是对IA受控数字借贷(CDL)计划的威胁。\nCDL计划允许人们检出图书的扫描副本，IA及其合作伙伴可以为这些图书制作实体拥有的副本。出版商显然对系统有很大的问题，但根据IA和EFF的说法，这项服务与其他图书馆提供的服务没有什么不同。\nEFF法律主任Corynne McSherry说：“EFF为能与档案馆站在一起并保护这项重要的公共服务而感到自豪。\n“在比以往任何时候都更需要、更困难的时候，受控的数字借阅有助于将书籍提供给教师、儿童和普通公众。这对任何出版商的利润都不构成威胁。“。\nDurie Tangri合伙人乔·格拉茨(Joe Gratz)对此表示赞同，他指出，互联网档案馆一次借书给一位赞助人是没有问题的。\n“这是图书馆几个世纪以来一直在做的事情，我们很自豪能代表互联网档案馆在数字时代捍卫图书馆的权利，”他补充道。\n有了格拉茨的加入，IA和EFF显然正在认真对待此事。他的个人资料写道，他“在法庭上站稳了脚跟，就像他和一群工程师讨论源代码一样”，并补充说，他在谷歌图书搜索(Google Book Search)版权案中代表谷歌。\n根据诉讼记录，团队中还有哈佛法学院毕业生阿迪·卡姆达尔(Adi Kamdar)，他曾是伯克曼·克莱恩互联网与社会中心(Berkman Klein Center for Internet&Amp；Society)的成员。在此之前，卡姆达尔是一名EFF活动家，倡导隐私、言论和知识产权政策等问题。\n例如，马修·简·奥本海姆(Matthew Jan Oppenheim)在音乐行业针对考克斯通信公司(Cox Communications)的创纪录的10亿美元陪审团裁决中担任首席律师，在出版业针对Book Dog Books的3400万美元裁决中担任首席律师。\n奥本海姆曾是音乐产业律师事务所Jenner&Amp；Block的合伙人，此前曾在RIAA工作，处理针对Napster和Grokster的里程碑式的案件。\n梅雷迪斯·桑塔纳(Meredith Santana)代表麦莉·赛勒斯(Miley Cyrus)提起“我们无法阻止”的版权侵权诉讼，而琳达·斯坦曼(Linda Steinman)则代表内容提供商，并就如何保护他们的作品免受“从聚合器到广告拦截器的各种挑战”提供咨询。\n现在双方通过谈判达成和解还不算太晚，但考虑到目前双方都在集结法律力量，这一前景正变得更加遥远。\n对于所有各方和其他各方来说，赌注都很高，任何一方都有可能影响公众未来如何消费扫描和借来的内容。", "note_en": "In March and faced with the chaos caused by the coronavirus pandemic, the Internet Archive (IA) launched its  National Emergency Library (NEL)\n Built on its existing  Open Library, the NEL provided users with unlimited borrowing of more than a million books, something which the IA hoped would help “displaced learners” restricted by quarantine measures.\n  After making a lot of noise in opposition to both the Open and Emergency libraries, publishers Hachette, HarperCollins, John Wiley and Penguin Random House  filed a massive copyright infringement lawsuit against the Internet Archive.\n Declaring the libraries little more than ‘pirate’ services that have no right to scan books and lend them out, even in a controlled fashion, the publishers bemoaned the direct threat to their businesses and demanded millions of dollars in statutory damages.\n Earlier this month the IA announced the  early closure of the NEL, with IA founder Brewster Kahle calling for an end to litigation and the start of cooperation. There are no public signs of either. Indeed, the opposing sides are preparing for action.\n  Last evening the EFF announced that it is joining forces with California-based law firm Durie Tangri to defend the Internet Archive against a lawsuit which they say is a threat to IA’s Controlled Digital Lending (CDL) program.\n The CDL program allows people to check out scanned copies of books for which the IA and its partners can produce physically-owned copies. The publishers clearly have a major problem with the system but according to IA and EFF, the service is no different from that offered by other libraries.\n “EFF is proud to stand with the Archive and protect this important public service,” says EFF Legal Director Corynne McSherry.\n “Controlled digital lending helps get books to teachers, children and the general public at a time when that is more needed and more difficult than ever. It is no threat to any publisher’s bottom line.”\n Durie Tangri partner Joe Gratz agrees, noting that there is no issue with the Internet Archive lending books to one patron at a time.\n “That’s what libraries have done for centuries, and we’re proud to represent Internet Archive in standing up for the rights of libraries in the digital age,” he adds.\n With Gratz on the team, the IA and EFF are clearly taking matters seriously. His  profile states that he’s as “comfortable on his feet in court as he is hashing over source code with a group of engineers”, adding that he represented Google in the Google Book Search copyright cases.\n Also on the team, according to the lawsuit docket, is Harvard Law School graduate  Adi Kamdar, who was an affiliate with the Berkman Klein Center for Internet &amp; Society. Before that, Kamdar was an EFF activist advocating on issues of privacy, speech, and intellectual property policy.\n   Matthew Jan Oppenheim, for example, served as lead counsel in the record-breaking $1 billion jury  verdict against Cox Communications for the music industry, and the $34 million  verdict against Book Dog Books for the publishing industry.\n A former partner at the music industry law firm Jenner &amp; Block, Oppenheim previously worked at the RIAA, handling landmark cases against Napster and Grokster.\n Meredith Santana represented Miley Cyrus in the “We Can’t Stop’ copyright infringement  lawsuit while  Linda Steinman represents and counsels content providers on how to protect their work from “challenges ranging from aggregators to ad blockers.”\n  It’s still not too late for the parties to reach a negotiated settlement but given the legal forces now massing on both sides, that is becoming a more distant prospect.\n The stakes are high for all parties and beyond, with either side coming out on top having the potential to affect how the public can consume scanned and borrowed content in the future.", "posttime": "2020-07-01 00:30:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "对抗,heavyweight,ia", "title": "EFF和重量级法律团队将为互联网档案辩护，对抗出版商", "title_en": "EFF and Heavyweight Legal Team Will Defend Internet Archive Against Publishers", "transed": 1, "url": "https://torrentfreak.com/eff-heavyweight-legal-team-will-defend-internet-archives-digital-library-against-publishers-200626/", "via": "", "real_tags": ["对抗", "ia"]}, {"category": "", "categoryclass": "", "imagename": "aba8a0ce8a542426daa653414358608d.jpeg", "infoid": 1009070, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几千年来，黄金在人类社会中扮演着重要的角色。从古代文明到现代，黄金一直被用来展示邻国之间的地位，展示统治者的权力，并促进国家之间的贸易。\n然而，尽管它外表闪闪发光，但它本质上是毫无价值的。除了在电子产品和牙科方面的有限用途外，黄金在人类社会中只有价值，因为它是黄金，而不是其他东西。这就解释了为什么全球每年80%以上的黄金需求是用于珠宝和投资目的，而不是用于工业用途。我们大部分时间都将黄金用作黄金，而不是作为导体，也不是作为珍珠白色的替代品。\n与世界各地发现的许多其他金属不同，黄金之所以保持并保持较高的地位，是因为它具有三种特殊的特性：稀缺性、耐久性和延展性。\n如果黄金不像地壳中储量最丰富的金属铝那样容易获得，它就不会是现在这样的黄金。然而，如果它像铑一样不常见，它也不会是黄金。铑是一种稀土金属，年产量是黄金的十分之一。正如沃伦·巴菲特(Warren Buffett)在2011年致股东的信中所说：\n今天，世界黄金库存约为17万吨。如果所有这些黄金都熔化在一起，它将形成一个每边约68英尺的立方体。(想象一下，它可以舒适地放在棒球内场。)。\n黄金的库存和流动之间的这种关系，使其成为比喻的地球金属的“金发碧眼”--稀有到值得珍视，但又足够普遍，可以在世界各地被发现和利用。“如果没有这种相对稀缺，黄金可能只是另一块闪闪发光的石头。\n然而，仅靠稀缺性还不足以让黄金拥有很高的地位，黄金还具有作为地球上最耐用的金属之一的独特属性，它不会生锈，也不会失去光泽，而且只有在非常特殊的情况下才能被腐蚀。\n你可以把你的黄金埋起来，50年后(或5万年)回来，它基本上不会变。这就是为什么彼得·伯恩斯坦在《黄金的力量》中写道：\n在开罗，你会发现一座4500年前埃及人用黄金做的牙桥，它的状况很好，可以放进你今天的嘴里。\n黄金的巨大耐用性使它成为自然界中为数不多的能够真正储存价值的东西之一。这就是为什么黄金在历史上一直被用作一种货币-它在日常使用中不会分解。\n在一个我们知道的一切都退化的世界里，这就是为什么黄金确实能够经受住时间的考验。\n即使黄金稀缺耐用，如果不是因为它无与伦比的延展性，黄金成为全球现象的难度会大得多。事实上，黄金是所有金属中最具延展性的。它非常灵活，可以把一盎司制成大约100平方英尺的连续薄片，也可以伸展成超过50英里长的金属丝。纯金非常柔软(对于一种金属来说)，这使得它可以相对容易地重塑。\n想想看，这种品质对于价值储存是多么有用。你可以很轻松地将它分开、藏起来，或者从一个地方运到另一个地方。你还能对一种材料提出更多要求吗？\n当结合黄金的稀缺性和虚拟的不可破坏性时，难怪人们在世界各地追逐了几个世纪。除了钉住稀缺性、耐用性和延展性三位一体之外，黄金的真正价值来自于体现工作证明的概念。\n尽管上面强调了黄金有益的化学性质，但它的真正价值来自于获得黄金的难度。正如乔·韦森塔尔(Joe Weisenthal)在2018年5月的一次演讲中所说：\n黄金最引人注目的一点是，要获得黄金是多么的困难(一旦你拥有了它，你就会坚持下去)，而且你必须掌握不同的东西才能获得黄金。\n为了获得黄金，你-必须擅长战争-能够派遣大量的人力劳动力来开采黄金-掌握全球供应和物流路线-能够指挥看守你的黄金，而不是偷走黄金-拥有技术知识-如何将黄金从地下开采出来，这是昂贵和繁琐的。…等。\n换句话说，当你拥有黄金时，你就是在传达你所能做的所有不同的事情(掌握补给路线、指挥军队、科学努力、组织劳动力等等)。\n因此，黄金是工作的一个非常具体的证明。如果你能拿到金牌，你就证明了你有能力管理一个州或一些类似国家的实体。\n虽然你今天不需要有能力“经营一个类似国家的实体”来获得黄金，但这个想法仍然有效。历史上让黄金有价值的(以及今天让它变得有价值的)不是它的显性所有权(即我有一块稀有的、闪闪发光的金属)，而是这种所有权的隐含信息(即我有技能/能力/资源来获得一块稀有的、闪亮的金属)。\n我能提供的最好的例子是铝的历史，当铝在18世纪末首次被发现时，最初比黄金更有价值，因为它很难获得。事实上，当华盛顿纪念碑在1880年第一次完工时，铝就被用来封顶了。\n然而，随着精炼工艺的改进和提铝变得更容易，这种曾经稀有的金属变得不那么稀有了。由于铝的可用性增加，它的工作证明减少了，因此相对于黄金来说，它的价值降低了。最初是美国最珍贵的地标之一的顶峰，最终变成了糖水的首选容器。\n这就是工作证明的不可否认的力量。有了它，你就会被钦佩，没有它，你就会被忽视。黄金的故事也是如此。\n既然我们已经讨论了为什么黄金对社会有价值，让我们来看看黄金对你可能有什么价值。\n在现代历史的大部分时间里，黄金都以某种形式或方式被用作一种货币。这就是为什么威廉·伯恩斯坦(William Bernstein)说：\n…。在莎士比亚时代，一盎司黄金可以买到一套精美的男式西装，今天也是如此。\n因为黄金从字面上来说就是货币，所以拥有它不会带来任何固有的收益。\n然而，自从美国在1973年放弃金本位制，并在1974年8月再次允许美国公民私人拥有黄金后，这一切都改变了。\n从那时起，黄金的价值从每盎司156美元上涨到今天的1750美元左右。经通胀调整后，黄金的购买力自与美元脱钩以来翻了一番：\n然而，同期经通胀调整后的标准普尔500指数(S&P；500)(含股息)的涨幅与黄金的涨幅并不相提并论：\n你可能会看到这样的图表，问为什么有人会长期投资黄金。然而，这忽略了一个更大的问题，即投资组合中黄金的价值。在我们开始之前，让我们看看不应该投资黄金的投资者类型。\n那么，你想长期持有黄金吗？如果是这样的话，你最好对数十年的缩水感到满意：\n如果你不是，那么欢迎加入这个俱乐部。我自己曾经是黄金投资者，但在意识到在这么长时间内持有一项资产是多么困难后，我就卖光了它。即使近几个月来金价一直在上涨，金价仍比2011年的历史高点低了5%以上。\n此外，与许多其他类似风险的资产类别(即股票、REITs等)相比，黄金的波动性要大得多，回报也低得多。例如，如果我们看一下各种资产类别的风险与回报的曲线图，你就可以更清楚地看到这种区别：\n如你所见，黄金似乎打破了“更多风险=更多回报”的模式。\n最后，黄金似乎也经历了繁荣和萧条的时期，这可能会让许多投资者难以忍受。例如，如果你从1975年开始按十年来看回报，你会发现黄金有挣扎的时期，也有飙升的时期：\n正因为如此，许多投资者可能会认为，当涉及到黄金时，榨取的果汁根本不值得榨取。\n然而，上述所有不利因素都是基于黄金的个人表现，而不是它在投资组合中的表现。因此，如果你是一个专注于个人头寸(高于投资组合回报)的人，那么黄金不太可能适合你。\n但是，如果你可以忽略投资组合中的个别部分，着眼于更大的图景，那么黄金会增值吗？\n虽然包括我在内的大多数投资者都因为黄金的高风险低回报记录而被吓跑，但也有理由持有黄金，因为它有能力在投资组合层面增值。\n例如，假设一个投资组合平均分为三个资产类别：标准普尔500指数(33.3%)、美国长期债券(33.3%)和新兴市场股票(33.3%)，现在想象一下，把这个投资组合加上黄金，使每一个资产类别的比例都达到25%，比如：标准普尔500指数(25%)、美国长期债券(25%)、新兴市场股票(25%)和黄金(25%)。\n如果你比较这两个投资组合的增长，黄金投资组合的表现会更好：\n而且，通常情况下，它会在总体投资组合风险(标准差)较小的情况下这样做：\n这提供了证据，表明黄金可以成为投资组合中有用的组成部分，即使它是一个单独持有的可怕的资产类别。\n黄金能够在投资组合层面增值的理由是，它与其他传统风险资产类别(即股票)的相关性较低，例如，黄金和标准普尔500指数的月收益平均相关性基本为零，尽管它在历史上有所变化：\n此外，在其他风险资产类别受到挤压时，黄金似乎有能力降低投资组合的风险，例如，通过今年早些时候的冠状病毒崩盘，比较黄金相对于标准普尔500指数的表现：\n在那段时间里，黄金似乎正在随波逐流，但后来随着股市的持续下沉，黄金重新浮出水面。与我们之前的例子不同，专注于黄金可能会损害典型投资者的利益，这是一个例子，说明关注黄金可能是让人保持理智的精神救生筏。\n当然，这总是说起来容易做起来难。我要记住，这种超越标普500指数的表现，正值金价仍在从2011年高点(9年前)回落之际！然而，如果你能够抛开这段表现平平的时期(双关语)，那么你可能会考虑在组合中加入一些黄金。\n那么，为什么黄金如此有价值？是它工作证明的历史证明？还是它的化学性质让它一开始就变得如此突出？或者可能是它作为全球投资者投资组合多元化的现代用途？\n也许不是，也可能是全部。我在研究黄金的过程中学到的最主要的一件事是，价值在旁观者的眼中。\n你们中的一些人会将黄金视为拥有大量枪支和罐头食品的疯子和阴谋论者的过时工具，或者你们中的一些人会将黄金视为美元肯定会内爆的世界中最后的希望堡垒。\n如果让我猜测，我会说真相在中间的某个地方。随着我们将我们的世界数字化，寻找其他储存价值的方式，黄金的竞争比以往任何时候都要激烈。然而，如果你认为人类社会中展示工作证据的最长寿命的信号之一很快就会被丢弃，那就再想一想。\n这是192次班机。我与这篇文章相关的任何代码都可以在这里找到，编号相同：https://github.com/nmaggiulli/of-dollars-and-data", "note_en": "For millennia gold has played a significant role in human society.  From ancient civilizations to modern times, it has been used to showcase status among neighbors, to display power among rulers, and to facilitate trade among nations.\n Yet, despite its shiny exterior, it is intrinsically worthless.  Outside of its limited uses in electronics and dentistry, gold only has value in human society  because it is gold and not something else.  This explains why  over 80% of annual global gold demand is for jewelry and investment purposes and not for industrial use.  We spend most of our time using gold as gold and not as a conductor of electricity or as a replacement for your pearly whites.\n     Unlike the many other metals found around the globe, gold has held and retained a high status because of three specific properties: scarcity, durability, and malleability.\n  Gold wouldn’t be what it is if it were as readily available as aluminum, the most abundant metal in Earth’s crust.  However, it also wouldn’t be gold if it was as uncommon as rhodium, a rare Earth metal with one-tenth of gold’s annual production.  As Warren Buffett stated in  his 2011 letter to shareholders:\n Today the world’s gold stock is about 170,000 metric tons. If all of this gold were melded together, it would form a cube of about 68 feet per side. (Picture it fitting comfortably within a baseball infield.)\n  This relationship between gold’s stock and its flow makes it the metaphoric “goldilocks” of Earthly metals— rare enough to be prized, but common enough to be found and utilized  throughout the world.  Without this relative scarcity, gold might have been just another glittering rock.\n  However, scarcity alone isn’t enough to give gold its high status.  Gold also has the unique property of being one of the most durable metals on the planet.  It doesn’t rust.  It doesn’t tarnish.  And it can only be corroded under very specific circumstances.\n You can bury your gold and come back in 50 years (or 50,000 years) and it would be basically unchanged.  This is why Peter Bernstein wrote in  The Power of Gold:\n In Cairo, you will find a tooth bridge made of gold for an Egyptian 4,500 years ago, its condition good enough to go into your mouth today.\n The immense durability of gold makes it one of the few things in nature that can act as a true store of value.  This is why gold has been used as a currency throughout history—it doesn’t break down through daily use.\n In a world where everything we know degrades, this is why gold is literally able to stand the test of time.\n  Even with its scarcity and durability, gold would have had a much harder time becoming a global phenomenon if not for its unsurpassed malleability.  In fact, gold is the most malleable of all metals.  It’s so flexible that one ounce can be made into a  thin continuous sheet measuring roughly 100 square feet or stretched into a wire over 50 miles long.  Pure gold is incredibly soft (for a metal), which allows it to be reshaped with relative ease.\n Think about how useful of a quality this is for a store of value.  You can divide it, hide it, or transport it from place to place with very little effort.  What more could you ask for in a material?\n When combined with gold’s scarcity and virtual indestructibility, it’s no wonder that people chased it the world over for centuries.  Outside of nailing the trifecta of scarcity, durability, and malleability, gold’s true value comes from embodying the concept of proof of work.\n  Despite the beneficial chemical properties of gold highlighted above, its real value comes from the difficulty of its acquisition.  As  Joe Weisenthal stated in  a speech from May 2018:\n One of the striking things about gold is just how incredibly hard it is to attain (and hold onto once you have it) and the different things you have to master to get gold.\n To get gold you — Have to be good at warfare — Be able to marshall an extensive human workforce to mine it — Mastery of global supply and logistics routes — Be able to command guards who will watch your gold, and not steal it — Have the technical know-how to get gold out of the ground, which is expensive and cumbersome. And so on…\n In other words, when you have gold you’re communicating all the different things you’re capable of (mastering supply routes, commanding an army, scientific endeavor, marshalling labor, etc.)\n Gold, then, is a very specific proof of work. If you can get gold, you’ve proven that you have the ability to run a state or some state-like entity.\n While you don’t need to the ability to “run a state-like entity” today to acquire gold, the idea still holds.  What made gold valuable historically (and what makes it valuable today) is not its explicit ownership (i.e. I have a rare, shiny piece of metal), but the  implicit  message of that ownership (i.e. I have the skills/ability/resources  to acquire a rare, shiny piece of metal).\n The best example I can provide to illustrate this is the history of aluminum.  When aluminum was first discovered in the late 1700s,  it was initially more valuable than gold because of how difficult it was to obtain.  In fact,  aluminum was used to cap the Washington Monument, when it was first completed in 1880.\n However, as the refining process improved and aluminum extraction became easier, the once rare metal became much less rare.  The increased availability of aluminum decreased its proof of work and, thus, reduced its value relative to gold.  What started as the capstone to one of America’s most treasured landmarks eventually became the go-to container for sugar water.\n This is the undeniable strength of proof of work.  With it, you are admired and, without it, you are ignored.  So goes the story of gold.\n Now that we have discussed why gold is valuable to  society, let’s examine how gold might be valuable to  you.\n  For most of modern history gold was used as a currency in some form or fashion.  This is why  William Bernstein remarked that:\n …an ounce of gold bought a fine men’s suit in the time of Shakespeare, and so it does today.\n Because gold literally was money, there was no inherent gains to be made from owning it.\n However, this all changed after the United States abandoned the gold standard in 1973 and allowed American citizens to, once again, privately own gold  in August 1974.\n Since then, gold has increased in value from $156 an ounce to around $1,750 today.  Adjusting for inflation, gold has doubled its purchasing power since it was decoupled from the U.S. dollar:\n   However, gold’s growth has been no match for the inflation-adjusted growth of the S&amp;P 500 (with dividends) over the same time period:\n    You might see a chart like this and ask why someone would ever invest in gold for the long term.  However, this misses a bigger point about the value of gold within a portfolio.  Before we get to that let’s examine the type of investor who should  not invest in gold.\n  So, you want to own gold for the long run?  If so, you better be comfortable with multi-decade drawdowns:\n   If you aren’t, then welcome to the club.  I used to be a gold investor myself, but  sold out of it after I realized how difficult it would be to hold an asset over such long periods of time.  Even with its price run in recent months, gold is still more than 5% off of its 2011 all time highs.\n Additionally, gold has much more volatility with much lower returns than many other similarly-risky asset classes (i.e. equities, REITs, etc.).  For example, if we look at a plot of risk versus return for various asset classes, you can see this distinction more clearly:\n   As you can see, gold seems to break the pattern of “more risk =&gt; more reward.”\n Lastly, gold also seems to go through periods of boom and bust, which can be hard for many investors to stomach.  For example, if you look at the returns by decade starting in 1975, you can see that there are periods where gold struggles and periods where it surges:\n   Because of this, many investors may decide that, when it comes to gold, the juice just isn’t worth the squeeze.\n However, all of the downsides stated above are based on gold’s  individual performance, not its performance within a  portfolio.   Therefore, if you are someone that focuses on individual positions (over portfolio returns) then gold is not likely to be for you.\n But, if you can ignore the individual pieces of your portfolio and look at the bigger picture, does gold add value then?\n  While most investors, myself included, have been scared away from gold because of its high risk-low reward track record, there are arguments to be made for owning gold due to its ability to add value at the portfolio level.\n For example, imagine a portfolio with an equal split into three asset classes: the S&amp;P 500 (33.3%), long-term U.S. bonds (33.3%), and emerging market stocks (33.3%).  Now imagine taking that portfolio and adding in gold so that the split went to 25% each, such as: S&amp;P 500 (25%), long-term U.S. bonds (25%), emerging market stocks (25%), and gold (25%).\n If you were to compare the growth of these two portfolios, the one with gold would have outperformed:\n   And it would have done so while, generally, having less overall portfolio risk (standard deviation):\n   This provides evidence that gold can be a useful component of a portfolio even if it is a scary asset class to hold on its own.\n The reasoning for gold’s ability to add value at the portfolio level is its low correlation to other traditional risky asset classes (i.e. stocks).  For example, the average correlation of monthly returns between gold and the S&amp;P 500 is basically zero though it has varied historically:\n   In addition, gold seems to have the ability to de-risk the portfolio when other risky asset classes are getting crushed.  For example, compare how gold performed relative to the S&amp;P 500 through the coronavirus crash earlier this year:\n   For some of that time gold seemed to be going down with the ship, but then it righted itself and resurfaced as equities continued sinking.  Unlike our prior example where focusing on gold can be a detriment to the typical investor, this is an example when focusing on gold could be the mental life raft that keeps someone sane.\n Of course, this is always easier said than done.  Remember that this outperformance over the S&amp;P 500 comes at a time when gold is still in a drawdown from its 2011 highs (9 years ago)!  However, if you are able to look past this such periods of lackluster performance (pun intended), then you might want to consider adding some gold into the mix.\n  So why is gold valuable?  Is it its historical demonstration of proof of work?  Or its chemical properties that allowed it to rise to such prominence in the first place?  Or maybe it’s its modern usage as a portfolio diversifier for global investors?\n Maybe it is none of them or maybe it is all of them.  The main thing that I learned while researching gold is that value is in the eye of the beholder.\n Some of you will see gold as an outdated tool of crazies and conspiracy theorists who own lots of guns and canned goods.  Some of you will see gold as the last bastion of hope in a world where the U.S. dollar is certain to implode.\n If I had to guess, I would say that the truth is somewhere in the middle.  As we digitize our world and find other ways of storing value, gold has more competition than ever before.  However, if you think that one of the longest-lived signals demonstrating proof of work in human society is going to be discarded anytime soon, think again.\n   This is post 192. Any code I have related to this post can be found here with the same numbering:  https://github.com/nmaggiulli/of-dollars-and-data", "posttime": "2020-07-01 00:28:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黄金,gold", "title": "为什么黄金很值钱？", "title_en": "Why Is Gold Valuable?", "transed": 1, "url": "https://ofdollarsanddata.com/why-is-gold-valuable/", "via": "", "real_tags": ["黄金", "gold"]}, {"category": "", "categoryclass": "", "imagename": "f9e1f119ac31cb5dd3efc2d2fd515e74.jpeg", "infoid": 1009066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于旧金山湾区的机器人初创公司Rios今天宣布获得500万美元的融资。这轮融资由Valley Capital Partners和Morpheus Ventures牵头，包括GRIT Ventures、Motus Ventures、MicroVentures、Alumni Ventures Group、富士公司(Fuji Corporation)和NGK火花塞公司(NGK Spark Plug Co.)在内的一长串投资者参与其中。\n这一举措正值人们对工厂自动化的兴趣日益浓厚之际。许多不同的初创公司最近都获得了巨额资金，包括伯克希尔格雷(Berkshire Grey)在1月份筹集了2.63亿美元的巨额资金。当然，里奥斯的加薪幅度要小得多，但这家年轻的公司还需要证明更多。\n即便如此，在一场持续的全球大流行中，投资者显然怀着极大的兴趣关注着自动化，这场大流行既导致许多行业陷入停滞，也导致许多人寻找替代生产要素，以消除病毒传播的人为因素。\nRios成立于2018年，是斯坦福大学(Stanford University)剥离出来的，在多名施乐帕洛阿尔托分校(Xerox Parc)工程师的帮助下成立。这家初创公司在过去一年半的时间里一直在秘密运营，同时与选定的合作伙伴一起测试其技术。\n该公司的第一款产品是DX-1，这是一款专为各种工业任务设计的机器人，包括静态拣箱和传送带操作。该系统由该公司的AI堆栈提供动力，包括一个感知系统和安装在机械手上的各种触觉传感器。\n该计划是对机器人系统收取月费，其中包括各种服务，包括编程、维护、监控和定期更新。", "note_en": "Bay Area-based robotics startup  RIOS is coming out of stealth today to announce $5 million in funding. The round is being led by Valley Capital Partners and Morpheus Ventures, with participation from a long list of investors, including Grit Ventures, Motus Ventures, MicroVentures, Alumni Ventures Group, Fuji Corporation and NGK Spark Plug Co.\n The move comes during a time of increased interest in factory automation. A number of different startups have received massive funding of late, including  Berkshire Grey’s massive $263 million raise in January. RIOS’s raise is considerably smaller, of course, but the young company has more to prove.\n Even so, investors are clearly eyeing automation with great interest amid an ongoing global pandemic that has both screeched many industries to a halt and led many to look to alternative production elements that remove the human element of virus transmission.\n   RIOS was founded in 2018, as a spin-out of Stanford University, with help from a number of Xerox PARC engineers. The startup has operated in stealth for the past year and a half while testing its technologies with a select group of partners.\n The company’s first product is DX-1, a robot designed for a variety of industrial tasks, including static bin picking and conveyor belt operations. The system is powered by the company’s AI stack, including a perception system and a variety of tactile sensors mounted on the robotic hand.\n The plan is to charge a monthly fee for the robotic system that includes a variety of services, including programming, maintenance, monitoring and regular updates.", "posttime": "2020-07-01 00:02:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,ios,秘密,stealth,包括", "title": "\nRios从秘密状态中走出来，宣布为“行业不可知”机器人技术提供500万美元的资金", "title_en": "\n\t\t\t\tRIOS comes out of stealth to announce $5M in funding for ‘industry-agnostic’ robotics\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/rios-comes-out-out-stealth-to-announce-5m-in-funding-for-industry-agnostic-robotics/", "via": "", "real_tags": ["机器人", "ios", "秘密", "stealth", "包括"]}, {"category": "", "categoryclass": "", "imagename": "32d79861ae61f4f00eb20c5a6c7e3ded.png", "infoid": 1009065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Osterloh还强调了谷歌在构建“环境计算”方面的现有工作，即淡入用户生活背景的计算，作为此次收购背后的战略推理。根据Osterloh的说法，North将加入Google在Kitchener-Waterloo地区的现有团队，该地区已经是North的总部所在地，它将帮助公司的“硬件努力和环境计算的未来”。\n在另一篇博客文章中，诺斯的联合创始人斯蒂芬·莱克(Stephen Lake)、马修·贝利(Matthew Bailey)和艾伦·格兰特(Aaron Grant)讨论了他们对收购的看法。他们说，这笔交易是有意义的，因为它将有助于“显著推进我们的共同愿景”，但他们接着指出，这将意味着逐步减少对Focals 1.0的支持，这是北方去年发布的第一代智能眼镜产品，并取消了任何发货Focals 2.0的计划。Focals 2.0是该公司在过去几个月里一直在取笑并准备发布的第二代版本。\nFocals在发布后受到了媒体的极大关注，并提供了有史以来推出的最适合消费者的可穿戴眼镜计算界面。它们与普通光学眼镜非常相似，尽管有更大的手臂来容纳活跃的计算组件，并将透明的显示屏覆盖在一个框架上，显示信息和导航方向等内容。\n在Focals 1.0首次亮相时，North联合创始人兼首席执行官Stephen Lake告诉我，该公司最初已经开始开发其首款产品Myo手势控制臂章，以创造一种与未来环境智能计算平台自然互动的方式。当你移动手臂时，Myo读取身体产生的电脉冲，并将其转换为计算机输入。在意识到包括VR耳机和谷歌眼镜(Google Glass)等可穿戴电脑在内的设计设备不足以让其新的控制模式起飞后，他们转向了解决Focals问题的根源。\n然而，Focals有一些主要的限制，包括最初要求任何想要购买它们的人都要去一个物理位置进行试穿，然后在它们准备好后再回来进行调整。它们也相当昂贵，而且不支持许多现有眼镜佩戴者所需的全系列处方。软件限制，包括访问苹果iMessage平台的限制，也阻碍了苹果移动设备用户的体验。\n诺斯(以及之前的Myo)总是聘用才华横溢、出类拔萃的机械电子工程师，这些工程师来自附近的滑铁卢大学(University Of Waterloo)，但它的想法通常无法吸引消费者的兴趣，而这种兴趣是持续独立运营所必需的。该公司自成立以来已经筹集了近2亿美元的资金；如上所述，谷歌支付的总金额没有消息，但这似乎不太可能是一次轰动一时的退出。\n在发给北方客户的一封电子邮件中，该公司还表示，将全额退还购买任何Focals的费用-可能会支付任何关于软件支持终止的投诉，这将在2020年7月31日相对较快地发生。", "note_en": "Osterloh also emphasizes Google’s existing work in building “ambient computing,” which is to say computing that fades into the background of a user’s life, as the strategic reasoning behind the acquisition.  North   will join Google’s existing team in the Kitchener-Waterloo area, where North is already based, and it will aid with the company’s “hardware efforts and ambient computing future,” according to Osterloh.\n In a  separate blog post, North’s co-founders Stephen Lake, Matthew Bailey and Aaron Grant discuss their perspective on the acquisition. They say the deal makes sense because it will help “significantly advance our shared vision,” but go on to noted that this will mean winding down support for Focals 1.0, the first-generation smart glasses product that North released last year, and cancelling any plans to ship Focals 2.0, the second-generation version that the company had been teasing and preparing to release over the last several months.\n  Focals received significant media attention following their release, and provided the most consumer-friendly wearable glasses computing interface ever launched. They closely resembled regular optical glasses, albeit with larger arms to house the active computing components, and projected a transparent display overlay onto one frame which showed things like messages and navigation directions.\n Around the Focals 1.0 debut, North co-founder and CEO  Stephen Lake   told me that the company had originally begun developing its debut product, the  Myo   gesture control armband, to create a way to interact naturally with the ambient smart computing platforms of the future. Myo read electrical pulses generated by the body when you move your arm and translated that into computer input. After realizing that devices it was designed to work with, including VR headsets and wearable computers like Google Glass, weren’t far enough along for its novel control paradigm to take off, they shifted to addressing the root of the problem with Focals.\n Focals had some major limitations, however, including initially requiring that anyone wanting to purchase them go into a physical location for fitting, and then return for adjustments once they were ready. They were also quite expensive, and didn’t support the full range of prescriptions needed by many existing glasses-wearers. Software limitations, including limited access to Apple’s iMessage platform, also hampered the experience for Apple mobile device users.\n North (and Myo before it) always employed talented and remarkable mechanical electronics engineers sources from the nearby University of Waterloo, but its ideas typically failed to attract the kind of consumer interest that would’ve been required for sustained independent operation. The company had raised nearly $200 million in funding since its founding; as mentioned, no word on the total amount Google paid, but it doesn’t seem likely to have been a blockbuster exit.\n In an email to North customers, the company also said it would be refunding the full amount paid for any Focals purchases – likely to defray any complaints about the end of software support, which occurs relatively soon on July 31, 2020.", "posttime": "2020-07-01 00:01:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,收购,acquires,计算", "title": "\n谷歌收购智能眼镜公司North，后者的Focals 2.0不会发货", "title_en": "\n\t\t\t\tGoogle acquires smart glasses company North, whose Focals 2.0 won’t ship\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/google-acquires-smart-glasses-company-north-whose-focals-2-0-wont-ship/", "via": "", "real_tags": ["google", "谷歌", "收购", "acquires", "计算"]}, {"category": "", "categoryclass": "", "imagename": "62500e62999f59168dd1992d25f2d316.jpg", "infoid": 1009064, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家初创公司此前曾从达芙尼(Daphni)、基马风险投资公司(Kima Ventures)、XAnge和各种商业天使那里总共筹集了1080万欧元(约合1220万美元)。\n如果你不熟悉Shine，那么这家初创公司一直在为法国的自由职业者和小公司建立一个挑战者银行。它可以让你创建一个商业账户，获得一张借记卡，并处理一些最无聊的管理任务。\n例如，Shine可以帮助你合并你的公司，还可以让你直接从应用程序创建发票。您可以向您的客户发送一个链接，当您的客户打开发票时，您会收到通知，他们可以直接在发票上查看您的Shine IBAN。\n由于发票工具与您的商业银行账户集成在一起，因此您的发票会在应用程序中自动标记为已支付。\n当涉及到收据时，您还可以打开信用卡交易并将收据附加到该交易。这样，所有会计信息都保留在同一个应用程序中。如果您与会计一起工作，您可以设置每月自动导出一次收据、发票和交易记录。\n但Shine的最大特点是它能帮助你处理好文书工作。你会收到提醒你应该缴税的通知，你可以看到一旦你交了税还会剩下多少钱，甚至更多。\n它在7万名自由职业者和非常小的公司使用Shine作为银行账户的情况下运行良好。但Shine是建立在Treezor之上的，Treezor是一家银行即服务公司，为其他金融科技公司提供金融服务和借记卡。在这样的规模下，Shine建立自己的基础设施是有意义的。\n肖恩做出了不同的决定，正在加入法国兴业银行(SociétéGénérale)，该公司恰好也是几年前收购Treezor的公司。\nShine将独立于法国兴业银行运营，仍将接受新客户--两位联合创始人将继续执掌Shine。但这两家公司都计划交叉推广各自的产品。\n法国兴业银行(SociétéGénérale)可以向其商业客户提供Shine。随着自由职业者开始与其他人合作，并将他们的小独立企业变成一家成熟的公司，Shine还可以告诉客户选择法国兴业银行(SociétéGénérale)作为他们的商业银行账户。\nShare还将利用法国兴业银行的银行牌照和产品。作为Shine客户，您可以想象从法国兴业银行获得信用额度。有一家银行业巨头做后盾，可以极大地提高Shine的产品质量。现在，让我们看看法国兴业银行(SociétéGénérale)是否成功提升了Shine的潜力。", "note_en": "The startup had previously raised €10.8 million ($12.2 million) in total from Daphni, Kima Ventures, XAnge and various business angels.\n If you’re not familiar with Shine, the startup has been building a challenger bank for freelancers and small companies in France. It lets you create a business account, get a debit card and take care of some of the most boring administrative tasks.\n  For instance, Shine helps you incorporate your company and also lets you create invoices directly from the app. You can send a link to your client, you get a notification when your client opens the invoice and they can view your Shine IBAN directly on the invoice.\n And because the invoicing tool is integrated with your business bank account, your invoices are automatically marked as paid in the app.\n When it comes to receipts, you can also open a card transaction and attach a receipt to that transaction. This way, all accounting information remains in the same app. If you’re working with an accountant, you can set up an automatic export of receipts, invoices and transactions once per month.\n But the best feature of Shine is that it helps you stay on top of paperwork. You receive notifications to remind you that you should pay your taxes, you can see how much money will be left once you paid your taxes and more.\n And it’s been working well with 70,000 freelancers and very small companies using Shine for their bank account. But Shine is built on top of  Treezor, a banking-as-a-service company that provides financial services and debit cards to other fintech companies. At this scale, it would make sense for Shine to build its own infrastructure.\n Shine has taken a different decision and is joining Société Générale, which also happens to be the company that acquired Treezor a few years ago.\n Shine will operate independently from Société Générale and will still accept new customers — the two co-founders are staying at the helm of Shine. But the two companies have plans to cross-promote their respective offerings.\n Société Générale could offer Shine to its business customers. And as freelancers start working with other people and turn their small independent business into a full-fledged company, Shine could also tell its customers to choose Société Générale for their business bank account.\n Shine will also take advantage of Société Générale’s banking license and products. As a Shine customer, you could image getting a credit line from Société Générale. Having a banking giant behind you could greatly improve Shine’s offering. Now, let’s see if Société Générale manages to boost the potential of Shine.", "posttime": "2020-07-01 00:01:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "兴业银行,rale,shine", "title": "\n法国兴业银行正在收购自由职业者挑战者Bank Shine", "title_en": "\n\t\t\t\tSociété Générale is acquiring freelancer challenger bank Shine\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/societe-generale-is-acquiring-freelancer-challenger-bank-shine/", "via": "", "real_tags": ["兴业银行", "rale", "shine"]}]