[{"category": "", "categoryclass": "", "imagename": "74cf04022c5030455dc657726350bfd0.jpg", "infoid": 1011443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Claure也是软银集团(SoftBank Group)的首席运营官，根据Claure在10月份的一次全体员工会议上泄露的评论，软银集团在联合办公空间投资了185亿美元。\n软银4月时曾表示，将在投资上亏损240亿美元，其中一个主要原因是WeWork去年破产。根据CNBC 5月份的一份报告，该公司的财务和管理问题使其估值从2019年初的高达470亿美元降至3月份的29亿美元。\n除了裁员外，WeWork还出售了熨斗学校(Flatiron School)、TEM及其在The wing的股份等业务。克劳尔告诉英国“金融时报”，WeWork还将员工人数从去年的1.4万人削减至5600人。\nNeumann于9月辞去执行长一职，据报导是在软银的要求下，因担心公司财务状况和他的行为。然后该公司推迟了首次公开募股(IPO)申请。次月，软银将WeWork的所有权作为融资方案的一部分。\nClaure被誉为策划了Sprint的扭亏为盈，在被软银收购三年后的2015年，削减了亏损，提高了股价。自2018年以来，他一直担任软银集团的首席运营官。\n尽管受到新冠肺炎疫情的影响，迫使许多人在家工作，但克劳尔表示，公司一直在从WeWork租赁空间，作为靠近员工居住地的卫星办公室。但他也表示，第二季营收持平，因许多租户终止租约或停止支付租金。", "note_en": "Claure is also chief operating officer of SoftBank Group, which invested $18.5 billion in the co-working space, according  to leaked comments made by Claure during an October all-hands meeting.\n SoftBank said in April that it  would lose $24 billion on investments, with one of the main reasons being WeWork’s implosion last year. The company’s financial and management issues brought its valuation down from  as much as $47 billion at the beginning of 2019 to $2.9 billion in March, according to a May report by CNBC.\n  In addition to the layoffs, WeWork sold off businesses including Flatiron School, Teem and its share of The Wing. Claure told the Financial times that WeWork also cut its workforce from a high of 14,000 last year to 5,600.\n Neumann  resigned as CEO in September, reportedly at the  behest of SoftBank, over concerns about the company’s  financial health and  his behavior. Then the company  postponed its IPO filing. The next month, SoftBank  took ownership of WeWork as part of a financing package.\n Claure is  credited with orchestrating a turnaround at Sprint, cutting losses and increasing its stock price in 2015, three years after it was acquired by SoftBank. He has served as SoftBank Group’s COO since 2018.\n Despite the impact of the COVID-19 pandemic, which forced many people to work from home, Claure said that companies have been leasing spaces from WeWork to serve as satellite offices close to where employees live. But he also said that revenues were flat during the second-quarter because many tenants terminated their leases or stopped paying rent.", "posttime": "2020-07-13 11:04:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "董事长,chairman,软银", "title": "\nWeWork董事长表示，预计2021年将有正现金流", "title_en": "\n\t\t\t\tWeWork’s chairman says it expects to have positive cash flow in 2021\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/12/weworks-chairman-says-it-expects-to-have-positive-cash-flow-in-2021/", "via": "", "real_tags": ["董事长", "chairman", "软银"]}, {"category": "", "categoryclass": "", "imagename": "32228a7a967bd25b3ade0662f12cf307.png", "infoid": 1011441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，Signal一直在推出一系列新功能，以使其应用程序更易于使用。其中一项功能最近在用户中引起了一些争议。这是一种基于称为安全价值恢复(SVR)的新系统的联系人列表备份功能。SVR功能允许Signal将您的联系人上传到Signal的服务器，而表面上甚至Signal本身都无法访问它。\n新的信号方法在安全人员中造成了一些创伤，因为它最近在没有特别明确的解释的情况下被启用。有关该问题的简短摘要，请参阅本文。在这篇文章中，我想更深入地探究为什么这些决定让我如此担忧，以及正在采取哪些信号来试图缓解这些担忧。\n对于那些不熟悉它的人来说，Signal是由Moxie MarlinkSpike的Signal Technology Foundation开发的一个开源应用程序。Signal受到了安全界的厚爱。这基本上有两个原因。首先：Signal应用程序已经成为Signal协议的一种技术演示，Signal协议是Facebook Messenger和WhatsApp等流行应用程序以及它们的数十亿用户所依赖的基本密码学基础。\n其次，Signal应用程序本身在注重安全的人中很受欢迎，主要是因为该应用程序的用户基础相对较小，技术含量更高，在安全体验方面倾向于采取毫不妥协的方式。与WhatsApp等更商业化的替代方案相比，Signal历来选择了更谨慎、更安全的方法，无论在哪里，可用性问题都与安全发生冲突。作为一种获得大规模采用的战略，这是一个糟糕的战略。如果您的目标是构建一个真正安全的消息传递产品，那么它会给人留下非常深刻的印象。\n像WhatsApp和苹果的iMessage这样的加密信使会定期将你的短信内容和联系人列表备份到远程云服务器上。这些备份在很大程度上破坏了端到端加密提供的强大安全性-因为它们使黑客和政府更容易获得您的明文内容。您可以禁用这些备份，但要将其做好却出人意料地不明显(至少对我来说是这样)。较大的服务通过指出其技术含量较低的用户往往更担心丢失的消息历史记录，而不是理论上的云黑客，来证明这种备份默认是合理的。\n相比之下，Signal在备份方面采取了谨慎得多的方法。今年6月，他们终于增加了一种手动将消息历史记录从一部iPhone转移到另一部iPhone的方式，现在这种转移涉及扫描二维码。对于Android，如果用户愿意写下30位数的加密密钥，云备份是可能的。这对许多用户来说可能真的很烦人，但对于安全性来说绝对是非常棒的。同样，由于Signal完全依赖于您联系人数据库中的电话号码(诚然，许多用户讨厌这一点)，因此它永远不需要将您的联系人列表备份到服务器。\n最近的变化是，Signal已经开始吸引更多的用户。当怀有传统期望的用户进入画面时，他们已经对Signal的局限性感到不满。作为回应，Signal开发人员已经开始探索在不损害安全性的情况下提供这些功能的方法。这真的很有挑战性，我很同情开发人员。\n他们试图解决问题的一个领域是他们新的联系人备份解决方案：一种名为“安全价值恢复”的系统。\nSignal的Secure Value Recovery(SVR)是一个基于云的系统，允许用户将加密数据存储在Signal的服务器上-这样即使Signal也无法访问它-而不会出现传统加密密钥管理带来的可用性问题。目前，SVR被用来存储用户的联系人列表，而不是消息内容，尽管这些数据可能会出现在菜单上以备将来备份。\n存储加密备份数据的挑战在于，高度加密需要强(或“高熵”)密钥和密码。由于我们中的大多数人都不善于选择，更不用说记住强密码了，这就带来了一个具有挑战性的问题。此外，这些密钥不能只存储在您的设备上-因为备份的全部目的是处理丢失的设备。\nSVR的目标是允许用户使用人类实际上可以记住的更弱的密码来保护他们的数据，例如4位PIN。使用传统的基于密码的加密，这样的密码将是完全不安全的：从信号服务器获得加密数据的有动机的攻击者可以简单地运行字典攻击-在几秒钟或几分钟内尝试所有10,000个这样的密码，从而获得您的数据。\nSignal的SVR以一种由来已久的方式解决了这个问题：它引入了一台即使Signal也无法破解的计算机。更具体地说，Signal利用了英特尔处理器的一个新扩展，称为软件保护扩展，或SGX。SGX允许用户编写在特殊虚拟化处理器模式下运行的称为“Enclaves”的程序。在此模式下，飞地对于计算机上的所有其他软件(包括操作系统)是不可见和不可触及的。如果需要存储，Enclaves可以永久存储(或“密封”)数据，这样任何篡改程序的尝试都将使数据无法访问。(更新：需要注意的是，SVR并不持久地存储数据。)。\nSignal的SVR在信号服务器上部署了这样一个Enclave程序。这个程序执行一个简单的功能：对于每个用户，它生成并存储一个随机的256位密码秘密“种子”以及用户PIN的散列。当用户联系服务器时，它可以向飞地提供其PIN，并请求将PIN与服务器上的密码值混合在一起。Enclave检查PIN是否与散列匹配，如果匹配，则将种子和PIN纠缠在一起。结果是可用于加密或解密备份数据的加密强加密密钥。\n此方法的关键在于，加密密钥现在既取决于用户的密码，也取决于由SGX飞地存储在服务器上的强加密秘密。如果SGX完成了它的工作，那么即使是侵入信号服务器的用户-这里我们包括信号开发商本身，可能是在胁迫下操作-也将无法检索到该用户的密码值。访问备份加密密钥的唯一方法是实际运行Enclave程序并输入用户的PIN(或其派生的PIN)。为了防止暴力猜测，Enclave会跟踪不正确输入PIN的次数，并且在完全锁定该用户的帐户之前只允许有限的次数。\n这是一种优雅的方法，在概念上与苹果和谷歌已经部署的系统非常相似，这两家公司使用专用的硬件安全模块(Hardware Security Modules)来实现可信组件，而不是SGX。\nSVR方法的主要缺点是它强烈依赖于SGX执行的安全性和完整性。正如我们稍后将讨论的那样，新交所的记录并不是一尘不染的。\n任何时候，当您遇到从根本上依赖于某个组件(特别是存在于商用硬件中的组件)可信性的系统时，您的第一个问题应该是：“如果该组件实际上不值得信任会发生什么？”\n让我们退后一步。回想一下，SVR的目标是确保三件事：\n备份加密密钥至少部分基于用户选择的密码。强密码意味着强加密密钥。\n即使使用弱密码，加密密钥仍将具有密码强度。这来自于SGX选择和存储的随机种子的集成。\n任何攻击者都不能暴力破解密码空间。这是由新交所通过猜测限制强制执行的。\n请注意，只有第一个目标真正由密码术本身强制实现。并且只有在用户选择强(高熵)密码的情况下才能实现该目标。有关其外观的示例，请参见右侧的图片。\n剩下的目标完全取决于新交所的诚信。因此，让我们扮演魔鬼的代言人，想想如果SGX不安全，SVR会发生什么。\n如果攻击者能够转储正在运行的信号SGX Enclave的内存空间，他们将能够暴露秘密种子值和用户密码散列。有了这些值，攻击者就可以运行基本的脱机字典攻击来恢复用户的备份密钥和密码。完成此攻击的难度完全取决于用户密码的强度。如果是BIP39短语，那就没问题了。如果它是一个4位数的PIN，就像Signal应用程序的UI强烈建议的那样，你就不会是这样的了。\n(如果您的PIN恰好与您的手机密码相同，则此数据的敏感度将变得更差。确保它不是！)。\n同样，如果攻击者能够破坏SGX执行的完整性：例如，使用陈旧的“状态”而不是新数据导致Enclave运行，则他们可能能够突破错误密码(“重试”)尝试的次数限制。这将允许攻击者在飞地上运行主动猜测攻击，直到他们恢复您的PIN。(编辑：这与SVR无关，因为数据只存储在RAM中，从不写入磁盘。)。\n最后，也是更微妙的问题是，Signal的SVR还允许“复制”备份数据库。这解决了Signal方面真正关心的问题，即备份服务器可能会出现故障-导致所有用户备份数据丢失。这将是一场UX噩梦，可以理解的是，Signal不希望用户接触到它。\n为了解决这个问题，Signal的操作员可以在云提供商上启动Signal服务器的新实例。新实例将拥有SGX Enclave软件的第二个副本，此软件可以从原始Enclave请求完整种子数据库的副本。(甚至还有一个复杂的共识协议，以确保在复制此副本后，两个副本在重试计数器的状态方面保持一致。)。\n需要记住的重要一点是，此复制过程的安全性完全取决于这样一种想法，即原始Enclave只会将其数据移交给在支持SGX的安全处理器上运行的同一Enclave软件的另一个实例。如果有可能在新飞地的状态上欺骗原始飞地-例如，说服它将数据库移交给仅在正常执行模式下模拟SGX飞地的系统-那么受攻击的信号操作员将能够使用此机制渗出数据库的明文副本。这将彻底破坏这个系统。\n对此攻击的预防是通过Intel SGX的另一项称为“远程证明”的功能来实现的。本质上，每个英特尔处理器都包含一个唯一的数字签名密钥，该密钥允许它证明它是合法的英特尔处理器，并且它正在运行特定的Enclave软件。这些签名可以在英特尔的帮助下进行验证，英特尔允许飞地验证他们是否直接与另一块合法飞地对话。\n该系统的强大也包含其脆弱性：如果从支持SGX的单个处理器中提取单个SGX证明密钥，这将为任何能够危害信号开发人员的实体提供后门。\n考虑到这些担忧，值得问的是，新交所将达到使该系统正常工作所需的高安全门槛，这有多现实。\n老实说，不太好。维基百科上给出了新加坡交易所妥协的清单，但这并不能说明全部情况。\n针对SGX的各种攻击多种多样，但很大程度上都有一个共同的原因：SGX的设计目的是在复杂的通用处理器上提供程序的虚拟化执行，并表示处理器有许多奇怪和未被探索的行为。如果攻击者可以让处理器行为不正常，这反过来又会破坏SGX的安全性。\n这导致了诸如“掠夺式电压”之类的攻击，恶意软件能够实时篡改处理器的电压电平，从而导致泄漏关键数据的故障。它包括利用飞地加载方式中的故障的攻击，这可能允许攻击者在适当的飞地的位置注入恶意代码。\n针对SGX的最可怕的攻击依赖于“投机性执行”侧通道，这可让攻击者从SGX提取机密-最高可达并基本上包括飞地使用的所有工作内存。这可以允许提取Signal的SVR使用的种子密钥或密封密钥(用于加密磁盘上的数据)等值。更糟糕的是，这些攻击不是一次而是两次成功地提取了用于执行密码证明的密码签名密钥。最近的一个是几周前打的补丁。这些都是非常活生生的攻击，你可以打赌会有更多的攻击即将到来。\n最后一部分对SVR不利，因为如果攻击者甚至可以提取一个处理器的证明签名密钥的单个副本，并且可以泄露信号管理员的机密，他们可能会强制Signal将他们的数据库复制到模拟的SGX飞地上，而该飞地实际上并不在SGX内部运行。一旦SVR将其数据库复制到系统中，每个人的秘密种子数据都将以明文形式可用。\n但真正让我害怕的是，我在上面列出的这些攻击只是对该系统进行学术探索的结果。在过去两年中的任何时候，我都能与密歇根大学的丹尼尔·根金(Daniel Genkin)或特拉华州大学格拉茨分校(TU Graz)的丹尼尔·格拉斯(Daniel Gruss)这样的人喝过啤酒，我知道这两位教授(或他们的团队)至少在新交所存在一个灾难性的未打补丁的漏洞。他们都是非常聪明的人。但他们并不是世界上唯一的聪明人。而且有一些聪明人拥有更多的资源，他们非常想要访问备份的信号数据。\n值得一提的是，上面的大多数攻击都是纯软件攻击-也就是说，它们假定攻击者只能获得对服务器的逻辑访问权限。这些攻击之所以受到如此限制，是因为SGX实际上并不是为了防御复杂的物理攻击者而设计的，这些攻击者可能会试图窃听系统总线，或者直接试图解包并将探测器附加到处理器本身。虽然这些攻击代价高昂且具有挑战性，但肯定有一些机构会毫不费力地执行它们。\n最后，我还应该提到，SVR方法的安全性假设英特尔是诚实的。坦率地说，这可能是我们已经在做的一个假设。那我们就赌一把吧。\n我对SVR的主要问题是它基本上是我不想要的，也是不信任的。我很高兴Signal将它作为一个选项提供给用户，只要允许用户选择不使用它。不幸的是，直到本周，Signal还没有给用户提供这样的选择。\n更具体地说：几周前，Signal开始喋喋不休地要求用户创建PIN码。应用程序本身并没有很好地解释设置此PIN会启动SVR备份。我采访过的许多人说，他们认为PIN是为了保护本地存储，或者是为了保护他们的账户不被劫持。\n信号不只是要这个密码。它遵循了硅谷诞生的一个常见的“黑暗模式”，即基本上迫使用户添加PIN，首先通过反复唠叨他们，然后最终通过一个巨大的模式对话框阻止访问整个应用程序。\n就其优点而言，这是一种不好的行为，更严重的是：它可能不会产生好的PIN选择。为了让它消失，我选择了应用程序允许的最简单的PIN，也就是9512。我想很多其他用户只是简单地输入了他们的手机密码，这本身就是一个令人讨厌的安全风险。\n有些人会说这没什么大不了的，因为SVR目前只保护用户的联系人列表-而这些联系人列表已经以明文形式存储在竞争对手的消息传递系统上。事实上，这是莫克西提出的论点之一。\n但我不相信这个。没有人会仅仅为了存储联系人列表而设计像Signal的SVR这样复杂的东西。一旦你有了像SVR这样的锤子，你就会想用它来敲掉其他的钉子。您将发现用户厌倦了丢失的其他关键数据，并且您将应用SVR来备份该数据。由于消息内容备份是Signal用户体验中最大的痛点之一，您迟早也会想要应用SVR来解决这个问题。\n在过去，我的观点是这很好-因为Signal肯定会给用户提供选择加入或退出邮件备份的能力。最近信号的决定动摇了我的信心。\n这已经是一篇很长的帖子了，但我认为分享Signal的观点才是公平的。\n我已经和Moxie谈过我对SVR的担忧，他有两个坚实的观点要表达。此外，对于不放心的用户来说，还有一个有点复杂的解决办法，目前正在推出。\n正如上面提到的，Moxie的第一点是，SVR目前只用于存储联系人列表，这是必要的，因为Signal现在不再只使用电话号码来识别联系人-因此它不再依赖于您手机的联系人数据库。他指出，许多竞争对手的应用程序只是在他们的服务器上以明文备份联系人列表，而SVR要比这好得多。这几乎肯定是真的。\nMoxie还建议，用户可以通过设置一个强大的、高熵的密码，然后(如果他们讨厌备份)忘记它，从而绕过SVR的任何可察觉到的弱点。他特别建议我应该生成一个BIP39密码短语，在我看来，这对于非技术用户来说并不容易。他还向我承诺，只要我没有打开Signal的“注册锁定”功能，扔掉这个代码不会给我带来任何不良影响，除了无法恢复我的联系人列表。我很高兴听到这件事，因为这对我来说一点也不明显。\n我问莫西，为什么Signal可以为我做这项工作，他说他们可以。事实上，截至本周，Signal在其最新的测试版中增加了“禁用PIN”功能。加密的数据仍然会传输到信号服务器，但现在加密的方式是没有人能访问的。Moxie还承诺，Signal在没有给用户选择的情况下，永远不会启用消息数据备份。我希望让他信守诺言。\n最后，我们对SVR数据库中的复制漏洞进行了长时间的技术讨论。冒着错误陈述他的观点的风险：莫西的观点是，这种复制是运行功能服务所必需的，保留持久备份数据的需要超过了潜在的安全问题。我建议用户只需在服务器发生故障时重新上传数据，这样做的好处是通知用户潜在的复制事件正在发生。莫西认为，让用户参与这个决定是糟糕的用户体验，也是一种反功能。\n在我看来，这将填补这个系统中的一个非常大的漏洞。我希望信号能考虑一下。", "note_en": "Over the past several months, Signal has been rolling out a raft of new features to make its app more usable. One of those features has recently been raising a bit of controversy with users. This is a contact list backup feature based on a new system called  Secure Value Recovery, or SVR. The SVR feature allows Signal to upload your contacts into Signal’s servers without — ostensibly — even Signal itself being able to access it.\n The new Signal approach has created some trauma with security people, due to the fact that it was recently enabled without a particularly clear explanation. For a shorter summary of the issue,  see this article. In this post, I want to delve a little bit deeper into why these decisions have made me so concerned, and what Signal is doing to try to mitigate those concerns.\n  For those who aren’t familiar with it, Signal is an open-source app developed by Moxie Marlinkspike’s  Signal Technology Foundation. Signal has received a lot of love from the security community. There are basically two reasons for this. First: the Signal app has served as a sort of technology demo for the  Signal Protocol, which is the fundamental underlying cryptography that powers popular apps like  Facebook Messenger and  WhatsApp, and all their billions of users.\n Second, the Signal app itself is popular with security-minded people, mostly because the app, with its relatively smaller and more technical user base, has tended towards a no-compromises approach to the security experience. Wherever usability concerns have come into conflict with security, Signal has historically chosen the more cautious and safer approach — as compared to more commercial alternatives like WhatsApp. As a strategy for obtaining large-scale adoption, this is a lousy one. If your goal is to build a really secure messaging product, it’s very impressive.\n  Encrypted messengers like WhatsApp and Apple’s iMessage routinely back up your text message content and contact lists to remote cloud servers. These backups undo much of the strong security offered by end-to-end encryption — since they make it much easier for hackers and governments to obtain your plaintext content. You can disable these backups, but it’s  surprisingly non-obvious to do it right (for me, at least). The larger services justify this backup default by pointing out that their less-technical users tend be more worried about lost message history than by theoretical cloud hacks.\n Signal, by contrast, has taken a much more cautious approach to backup. In June of this year, they finally added a way to  manually transfer message history from one iPhone to another, and this transfer now involves  scanning QR codes. For Android, cloud backup is possible, if users are willing to write down a  thirty-digit encryption key. This is probably really annoying for many users, but it’s  absolutely fantastic for security. Similarly, since Signal relies entirely on phone numbers in your contacts database (a point that, admittedly, many users hate), it never has to back up your contact lists to a server.\n What’s changed recently is that Signal has  begun to attract a larger user base. As users with traditional expectations enter the picture, they’ve been unhappy with Signal’s limitations. In response, the signal developers have begun to explore ways by which they can offer these features without compromising security. This is just plain challenging, and I feel for the developers.\n One area in which they’ve tried to square the circle is with their new solution for contacts backup: a system called “ secure value recovery.”\n  Signal’s Secure Value Recovery (SVR) is a cloud-based system that allows users to store encrypted data on Signal’s servers —  such that even Signal cannot access it — without the usability headaches that come from traditional encryption key management. At the moment, SVR is being used to store users’ contact lists and  not message content, although that data may be on the menu for backup in the future.\n The challenge in storing encrypted backup data is that strong encryption requires  strong (or “high entropy”) cryptographic keys and passwords. Since most of us are terrible at selecting, let alone remembering strong passwords, this poses a challenging problem. Moreover, these keys can’t just be stored on your device — since the whole point of backup is to deal with  lost  devices.\n The goal of SVR is to allow users to protect their data with much weaker passwords that humans can actually can memorize, such as a 4-digit PIN. With traditional password-based encryption, such passwords would be completely insecure: a motivated attacker who obtained your encrypted data from the Signal servers could simply run a  dictionary attack — trying all 10,000 such passwords in a few seconds or minutes, and thus obtaining your data.\n Signal’s SVR solves this problem in an age-old way: it introduces a computer that even Signal can’t hack. More specifically, Signal makes use of a new extension to Intel processors called  Software Guard eXtensions, or SGX. SGX allows users to write programs, called “enclaves”, that run in a special virtualized processor mode. In this mode, enclaves are invisible to and untouchable by all other software on a computer, including the operating system. If storage is needed, enclaves can persistently store (or “seal”) data, such that any attempt to tamper with the program will render that data inaccessible. ( Update: as a note, SVR does not store data persistently.)\n Signal’s SVR deploys such an enclave program on the Signal servers. This program performs a simple function: for each user, it generates and stores a random 256-bit cryptographic secret “seed” along with a hash of the user’s PIN. When a user contacts the server, it can present its PIN to the enclave and ask for the PIN to be mixed together with the secret value on the server. The enclave checks that the PIN matches the hash, and if so, tangles together the seed and PIN. The result is a cryptographically strong encryption key that can be used to encrypt or decrypt backup data.\n The key to this approach is that the encryption key now depends on  both the user’s password and a strong cryptographic secret stored by an SGX enclave on the server.  If SGX does its job, then even a user who hacks into the Signal servers — and here we include the Signal developers themselves, perhaps operating under duress — will be unable to retrieve this user’s secret value. The only way to access the backup encryption key is to actually run the enclave program and enter the user’s PIN (or a derivative of it). To prevent brute-force guessing, the enclave keeps track of the number of incorrect PIN-entry attempts, and will only allow a limited number before it locks that user’s account entirely.\n This is an elegant approach, and it’s conceptually quite similar to systems already deployed by  Apple and  Google, who use dedicated  Hardware Security Modules to implement the trusted component, rather than SGX.\n The key weakness of the SVR approach is that it depends strongly on the security and integrity of SGX execution. As we’ll discuss in just a moment, SGX does not exactly have a spotless record.\n  Anytime you encounter a system that relies fundamentally on the trustworthiness of some component — particularly a component that exists in commodity hardware — your first question should be: “what happens if that component isn’t actually trustworthy?”\n  Let’s step back. Recall that the goal of SVR is to ensure three things:\n The backup encryption key is based, at least in part, on the user’s chosen password. Strong passwords mean strong encryption keys.\n Even with a  weak password, the encryption key will still have cryptographic strength. This comes from the integration of a random seed that gets chosen and stored by SGX.\n No attacker will be able to brute-force their way through the password space. This is enforced by SGX via guessing limits.\n  Note that  only the first goal is really enforced by cryptography itself. And this goal will only be achieved if the user selects a strong ( high-entropy) password. For an example of what that looks like, see the picture at right.\n The remaining goals rely entirely on the integrity of SGX. So let’s play devil’s advocate, and think about what happens to SVR if SGX is not secure.\n If an attacker is able to dump the memory space of a running Signal SGX enclave, they’ll be able to expose secret seed values as well as user password hashes. With those values in hand, attackers can run a basic offline dictionary attack to recover the user’s backup keys and passphrase. The difficulty of completing this attack depends  entirely on the strength of a user’s password. If it’s a  BIP39 phrase, you’ll be fine. If it’s a 4-digit PIN, as strongly encouraged by the UI of the Signal app, you will not be.\n (The sensitivity of this data becomes even worse if your PIN happens to be the same as your phone passcode. Make sure it’s not!)\n Similarly, if an attacker is able to compromise the integrity of SGX execution: for example, to cause the enclave to run using stale “state” rather than new data, then they might be able to defeat the limits on the number of incorrect password (“retry”) attempts. This would allow the attacker to run an  active guessing attack on the enclave until they recover your PIN. ( Edit: This shouldn’t be relevant in SVR because data is stored only in RAM, and never written to disk.)\n A final, and more subtle concern comes from the fact that Signal’s SVR also allows for “replication” of the backup database. This addresses a real concern on Signal’s part that the backup server could fail — resulting in the loss of all user backup data. This would be a UX nightmare, and understandably, Signal does not want users to be exposed to it.\n To deal with this, Signal’s operators can spin up a new instance of the Signal server on a cloud provider. The new instance will have a second copy of the SGX enclave software, and this software can request a copy of the full seed database from the original enclave. (There’s even a sophisticated consensus protocol to make sure the two copies stay in agreement about the state of the retry counters, once this copy is made.)\n The important thing to keep in mind is that the security of this replication process depends  entirely on the idea that the original enclave will only hand over its data to another instance of the  same enclave software running on a secure SGX-enabled processor. If it was possible to trick the original enclave about the status of the new enclave — for example, to convince it to hand the database over to a system that was merely emulating an SGX enclave in normal execution mode — then a compromised Signal operator would be able to use this mechanism to exfiltrate a plaintext copy of the database. This would break the system entirely.\n Prevention against this attack is accomplished via another feature of Intel SGX, which is called “ remote attestation“. Essentially, each Intel processor contains a unique digital signing key that allows it to  attest to the fact that it’s a legitimate Intel processor, and it’s running a specific piece of enclave software. These signatures can be verified with the assistance of Intel, which allows enclaves to verify that they’re talking directly to another legitimate enclave.\n The power of this system also contains its fragility: if a single SGX attestation key were to be extracted from a single SGX-enabled processor, this would provide a backdoor for any entity who is able to compromise the Signal developers.\n With these concerns in mind, it’s worth asking how realistic it is that SGX will meet the high security bar it needs to make this system work.\n  Not well, to be honest. A list of SGX compromises is given on Wikipedia  here, but this doesn’t really tell the whole story.\n The various attacks against SGX are many and varied, but largely have a common cause: SGX is designed to provide virtualized execution of programs on a complex general-purpose processor, and said processors have a lot of weird and unexplored behavior. If an attacker can get the processor to misbehave, this will in turn undermine the security of SGX.\n This leads to attacks such as “ Plundervolt“, where malicious software is able to tamper with the voltage level of the processor in real-time, causing faults that leak critical data. It includes attacks that leverage glitches in the way that enclaves are loaded, which can allow an attacker to  inject malicious code in place of a proper enclave.\n The  scariest  attacks against SGX rely on “ speculative execution” side channels, which can allow an attacker to extract secrets from SGX — up to and including basically all of the working memory used by an enclave. This could allow extraction of values like the seed keys used by Signal’s SVR, or the sealing keys (used to encrypt that data on disk.) Worse, these attacks have  not once but twice been successful at extracting cryptographic signing keys used to perform cryptographic attestation. The most recent one was patched just a few weeks ago. These are very much live attacks, and you can bet that more will be forthcoming.\n This last part is bad for SVR, because if an attacker can extract even  a single copy of  one processor’s attestation signing keys, and can compromise a Signal admin’s secrets, they can potentially force Signal to replicate their database onto a simulated SGX enclave that isn’t actually running inside SGX. Once SVR replicated its database to the system, everyone’s secret seed data would be available in plaintext.\n But what really scares me is that these attacks I’ve listed above are simply the result of academic exploration of the system. At any given point in the past two years I’ve been able to have a beer with someone like Daniel Genkin of U. Mich or Daniel Gruss of TU Graz, and know that either of these professors (or their teams) is sitting on at least one catastrophic unpatched vulnerability in SGX. These are very smart people. But they are not the only smart people in the world. And there are smart people with more resources out there who would very much like access to backed-up Signal data.\n It’s worth pointing out that most of the above attacks are  software-only attacks — that is, they assume an attacker who is only able to get logical access to a server. The attacks are so restricted because SGX is not really  designed to defend against sophisticated physical attackers, who might attempt to tap the system bus or make direct attempts to unpackage and attach probes to the processor itself. While these attacks are costly and challenging, there are certainly agencies that would have no difficulty executing them.\n Finally, I should also mention that the security of the SVR approach assumes Intel is honest. Which, frankly, is probably an assumption we’re already making. So let’s punt on it.\n  My major issue with SVR is that it’s something I basically don’t want, and don’t trust. I’m happy with Signal offering it as an option to users, as long as users are allowed to choose  not to use it. Unfortunately, up until this week, Signal was not giving users that choice.\n More concretely: a few weeks ago Signal began nagging users to create a PIN code. The app itself didn’t really explain well that setting this PIN would start SVR backups. Many people I spoke to said they believed that the PIN was for protecting local storage, or to  protect their account from hijacking.\n  And Signal didn’t just ask for this PIN. It followed a common “dark pattern” born in Silicon Valley of basically forcing users to add the PIN, first by nagging them repeatedly and then ultimately by  blocking access to the entire app with a giant modal dialog.\n This is bad behavior on its merits, and more critically: it probably doesn’t result in good PIN choices. To make it go away, I chose the simplest PIN that the app would allow me to, which was 9512. I assume many other users simply entered their phone passcodes, which is a nasty security risk all on its own.\n Some will say that this is no big deal, since SVR currently protects only users’ contact lists — and those are already stored in cleartext on competing messaging systems. This is, in fact, one of the arguments Moxie has made.\n But I don’t buy this. Nobody is going to engineer something as complex as Signal’s SVR just to store contact lists. Once you have a hammer like SVR, you’re going to want to use it to knock down other nails. You’ll find other critical data that users are tired of losing, and you’ll apply SVR to back that data up. Since message content backups are one of the bigger pain points in Signal’s user experience, sooner or later you’ll want to apply SVR to solving that problem too.\n In the past, my view was that this would be fine — since Signal would surely give users the ability to opt into or out of message backups. The recent decisions by Signal have shaken my confidence.\n  This has already been a long post, but I think it’s only fair to share Signal’s point of view.\n I’ve spoken with Moxie about my concerns around SVR, and he has two solid points to make. Plus a somewhat complicated workaround for users who are not mollified, which is rolling out right now.\n As noted above, Moxie’s first point is that SVR is  currently only used to store contact lists, and that this is needed because Signal is now moving away from using only phone numbers to identify contacts— and so it can no longer rely on your phone’s contact database. He points out that many competing apps simply back up contact lists  in plaintext on their servers, and that SVR is massively better than this. This is almost certainly true.\n Moxie also suggested that users could bypass any perceived weaknesses of SVR by setting a strong, high entropy passcode, and then (if they hate backups) forgetting it. He specifically suggested that I should generate a  BIP39 passphrase, something that (in my opinion) isn’t that easy for non-technical users. He also promised me that throwing this code away would cause me no ill effects, beyond the inability to recover my contact list, as long as I didn’t turn on Signal’s “registration lock” feature. I was glad to hear this, because it was not obvious to me at all.\n I asked Moxie why Signal could just do this work for me, and he said that they could. In fact, as of this week, Signal has added a “disable PINs” feature into its latest beta. Encrypted data still goes to Signal servers, but it’s now encrypted in a way that nobody can access. Moxie also promised that Signal would never enable message data backups without giving users the choice. I hope to hold him to that promise.\n Finally, we had a long technical discussion about the vulnerability of replication in SVR databases. At the risk of misstating his side: Moxie’s perspective is that this kind of replication is needed in order to operate a functional service, and that the need to retain persistent backup data trumps the potential security issues. I suggested that users could simply re-upload their data in the event of a server failure, and that this would have the benefit of notifying users that a potential replication event was happening. Moxie felt that involving users in this decision was bad UX, and an anti-feature.\n From my perspective, that would close a very big hole in this system. I hope Signal will think about it.", "posttime": "2020-07-13 10:22:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安全,signal", "title": "关于信号安全价值恢复的几点思考", "title_en": "A few thoughts about Signal’s Secure Value Recovery", "transed": 1, "url": "https://blog.cryptographyengineering.com/2020/07/10/a-few-thoughts-about-signals-secure-value-recovery/", "via": "", "real_tags": ["安全", "signal"]}, {"category": "", "categoryclass": "", "imagename": "8ebbb54563196e7dda8479c0a0aee54b.jpeg", "infoid": 1011440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我经常被问到是否可以评论一下别人关于一切的理论。这可能是加勒特·利西的E8理论，或者是埃里克·温斯坦的几何统一性，或者是斯蒂芬·沃尔弗拉姆的宇宙只是一个大图形的观点，等等。那就好。让我告诉你我对这件事的看法。但恐怕这不是你想听的。在我们开始之前，让我提醒你们物理学家所说的“万物理论”是什么意思。就我们目前所知，宇宙和宇宙中的一切由四个基本的相互作用维系在一起。这就是电磁力，强核力和弱核力，以及重力。你所熟悉的所有其他力量，比如范德华力，或肌肉力，或将你拉向维基百科上无限链接序列的力，这些都是源自四个基本互动的非基本力。至少在原则上是这样。现在，三种基本的相互作用，电磁力和强核力和弱核力，属于同一类型。它们被收集在粒子物理的标准模型中。标准模型中的三种力由量子场论来描述，简而言之，这意味着所有的粒子都遵守量子力学的原理，比如测不准原理，它们可以纠缠等等。然而，引力是由爱因斯坦的广义相对论描述的，对量子力学一无所知，因此它有别于其他三种力。这是个问题，因为我们知道标准模型中的所有量子粒子都有引力。但我们不知道这是如何运作的。我们只是没有一个理论来描述基本粒子是如何引力的。为此，我们需要一个关于重力量子行为的理论，一个被称为“量子引力”的理论。我们需要量子引力理论，因为广义相对论和标准模型在数学上是不相容的。到目前为止，这只是一个纯粹的理论问题，因为根据我们目前所能做的实验，我们不需要使用量子重力。在目前所有可能的实验中，我们要么测量量子效应，要么测量粒子质量太小，以至于我们无法测量它们的引力。或者我们可以观察到一些物体的引力，但是它们没有量子行为。所以，目前我们不需要量子引力来描述任何观测。然而，这种情况有望在未来几十年内改变。我在之前的一段视频中谈到了这一点。除了缺失的量子引力理论，物理学家对标准模型还有其他各种问题。最值得注意的是，虽然标准模型中的三种力都属于同一类型，但它们也都不同，因为每种力都属于不同的对称类型。物理学家更愿意将所有这些力统一为一个，这意味着它们都将来自相同的数学结构。在许多情况下，该结构是一个大的对称群。因为我们没有观察到这一点，所以我们的想法是，大对称性只会在能量高到我们还无法测试它们的时候才会显现出来。在我们到目前为止测试过的能量下，对称性必须被打破，这就产生了标准模型。这种标准模范力量的统一，叫做“大统一”或“大统一理论”，简称“大一统”。那么，物理学家所说的万物理论就是一种理论，所有四种基本的相互作用都是从这个理论派生出来的。这意味着它既是一个大统一理论，也是一个量子引力理论。这听起来是个好主意，是的。但。没有理由实际上应该用万物理论来描述自然。虽然我们*确实需要量子引力理论来避免自然规律中的逻辑不一致，但标准模型中的力并不一定要统一，它们也不一定要与引力统一。会很漂亮的，是的，但是没有必要。标准模型在没有统一的情况下工作得很好。所以这个万物理论的整个想法是建立在一个不科学的前提之上的。有些人希望自然规律以一种非常具体的方式变得漂亮。他们希望它简单，他们希望它是对称的，他们希望它是自然的，在这里我必须警告你，“自然”是一个技术术语。所以他们知道他们想要什么是真的。然后，他们偶然发现了一些让他们印象特别深刻的数学，他们开始确信，它肯定对自然规律起到了作用。简而言之，他们发明了一种他们认为的宇宙应该是什么样子的理论。这根本不是发展科学理论的好策略，当然也不是标准的方法论。事实上，情况恰恰相反。在理论发展中依靠美，从历史上看是行不通的。", "note_en": "I get constantly asked if I could please comment on other people’s theories of everything. That could be Garrett Lisi’s E8 theory or Eric Weinstein’s geometric unity or Stephen Wolfram’s idea that the universe is but a big graph, and so on. Good, then. Let me tell you what I think about this. But I’m afraid it may not be what you wanted to hear.    Before we start, let me remind you what physicists mean by a “Theory of Everything”. For all we currently know, the universe and everything in it is held together by four fundamental interactions. That’s the electromagnetic force, the strong and the weak nuclear force, and gravity. All other forces that you are familiar with, say, the van der Waals force, or muscle force, or the force that’s pulling you down an infinite sequence of links on Wikipedia, these are all non-fundamental forces that derive from the four fundamental interactions. At least in principle.  Now, three of the fundamental interactions, the electromagnetic and the strong and weak nuclear force, are of the same type. They are collected in what is known as the standard model of particle physics. The three forces in the standard model are described by quantum field theories which means, in a nutshell, that all particles obey the principles of quantum mechanics, like the uncertainty principle, and they can be entangled and so on. Gravity, however, is described by Einstein’s theory of General Relativity and does not know anything about quantum mechanics, so it stands apart from the other three forces. That’s a problem because we know that all the quantum particles in the standard model have a gravitational pull. But we do not know how this works. We just do not have a theory to describe how elementary particles gravitate. For this, we would need a theory for the quantum behavior of gravity, a theory of “quantum gravity,” as it’s called.   We need a theory of quantum gravity because general relativity and the standard model are mathematically incompatible. So far, this is a purely theoretical problem because with the experiments that we can currently do, we do not need to use quantum gravity. In all presently possible experiments, we either measure quantum effects, but then the particle masses are so small that we cannot measure their gravitational pull. Or we can observe the gravitational pull of some objects, but then they do not have quantum behavior. So, at the moment we do not need quantum gravity to actually describe any observation. However, this will hopefully change in the coming decades. I talked about this in an earlier video.   Besides the missing theory of quantum gravity, there are various other issues that physicists have with the standard model. Most notably it’s that, while the three forces in the standard model are all of the same type, they are also all different in that each of them belongs to a different type of symmetry. Physicists would much rather have all these forces unified to one, which means that they would all come from the same mathematical structure.   In many cases that structure is one big symmetry group. Since we do not observe this, the idea is that the big symmetry would manifest itself only at energies so high that we have not yet been able to test them. At the energies that we have tested it so far, the symmetry would have to be broken, which gives rise to the standard model. This unification of the forces of the standard model is called a “grand unification” or a “grand unified theory”, GUT for short.  What physicists mean by a theory of everything is then a theory from which all the four fundamental interactions derive. This means it is both a grand unified theory and a theory of quantum gravity.   This sounds like a nice idea, yes. But. There is no reason that nature should actually be described by a theory of everything. While we *do need a theory of quantum gravity to avoid logical inconsistency in the laws of nature, the forces in the standard model do not have to be unified, and they do not have to be unified with gravity. It would be pretty, yes, but it’s unnecessary. The standard model works just fine without unification.  So this whole idea of a theory of everything is based on an unscientific premise. Some people would like the laws of nature to be pretty in a very specific way. They want it to be simple, they want it to be symmetric, they want it to be natural, and here I have to warn you that “natural” is a technical term. So they have an idea of what they want to be true. Then they stumble over some piece of mathematics that strikes them as particularly pretty and they become convinced that certainly it must play a role for the laws of nature. In brief, they invent a theory for what they think the universe *should be like.   This is simply not a good strategy to develop scientific theories, and no, it is most certainly not standard methodology. Indeed, the opposite is the case. Relying on beauty in theory development has historically worked badly. In physics, breakthroughs in theory-development have come instead from the resolution of mathematical inconsistencies. I have literally written a book about how problematic it is that researchers in the foundations of physics insist on using methods of theory development that we have no reason to think should work, and that as a matter of fact do not work.   The search for a theory of everything and for grand unification began in the 1980s. To the extent that the theories which physicists have come up with were falsifiable they have been falsified. Nature clearly doesn’t give a damn what physicists think is pretty math.   Having said that, what do you think I think about Lisi’s and Weinstein’s and Wolfram’s attempts at a theory of everything? Well, scientific history teaches us that their method of guessing some pretty piece of math and hoping it’s useful for something is extremely unpromising. It is not impossible it works, but it is almost certainly a waste of time. And I have looked closely enough at Lisi’s and Weinstein’s and Wolfram’s and many other people’s theories of everything to be able to tell you that they have not convincingly solved any actual problem in the existing fundamental theories. And I’m not interested to look any closer, because I don’t also want to waste my time.  But I don’t like commenting on individual people’s theories of everything. I don’t like it because it strikes me as deeply unfair. These are mostly researchers working alone or in small groups. They are very dedicated to their pursuit and they work incredibly hard on it. They’re mostly not paid by tax money so it’s really their private thing and who am I to judge them? Also, many of you evidently find it entertaining to have geniuses with their theories of everything around. That’s all fine with me.  I get a problem if theories that despite having turned out to be useless grow to large, tax-paid research programs that employ thousands of people, as it has happened with string theory and supersymmetry and grand unification. That creates a problem because it eats up resources and can entirely stall progress, which is what has happened in the foundations of physics.   People like Lisi and Weinstein and Wolfram at least remind us that the big programs are not the only thing you can do with math. So, odd as it sounds, while I don’t think their specific research avenue is any more promising than string theory, I’m glad they do it anyway. Indeed, physics can need more people like them who have the courage to go their own way, no matter how difficult.   The brief summary is that if you hear something about a newly proposed theory of everything, do not ask whether the math is right. Because many of the people who work on this are really smart and they know their math and it’s probably right. The question you, and all science journalists who report on such things, should ask is what reason do we have to think that this particular piece of math has anything to do with reality. “Because it’s pretty” is not a scientific answer. And I have never seen a theory of everything that gave a satisfactory scientific answer to this question.", "posttime": "2020-07-13 10:01:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "万物,theory,理论", "title": "我们需要万物理论吗？", "title_en": "Do We Need a Theory of Everything?", "transed": 1, "url": "http://backreaction.blogspot.com/2020/07/do-we-need-theory-of-everything.html", "via": "", "real_tags": ["万物", "theory", "理论"]}, {"category": "", "categoryclass": "", "imagename": "7e9a18c4d33d3e3ab9b8500888cba7c9.jpg", "infoid": 1011439, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "神经联觉是一个人工智能艺术项目，旨在用人工智能创造新的和独特的视听体验。它通过人类和生殖网络之间的合作来做到这一点。结果给人的感觉几乎像是有机艺术。当面孔、风景、物体和建筑转变成音乐时，色彩和图像的漩涡融合在一起。有一种感觉是，事情在感觉独特和同时又奇怪地熟悉之间摇摆。\n神经联觉是由Xander Steenbrugge创建的，他是一位在线内容创建者，他在从事脑机接口工作时开始了他的数据科学。在他的硕士论文期间，他帮助建立了一个通过大脑信号对想象的运动进行分类的系统。这个系统允许患有闭锁综合症的患者用他们的头脑操纵物理物体。这一经历给Steenbrugge留下了深刻的印象，即机器学习的重要性，以及人工智能技术建造令人惊叹的东西的潜力。\n除了神经联觉，Steenbrugge还与一家使用机器学习进行药物发现的初创公司合作，并运营着一个广受欢迎的YouTube频道。他还在开发wzrd.ai，这是一个通过人工智能的工作用身临其境的视频来增强音频的平台。在这次采访中，我们谈到了神经联觉的灵感，它是如何工作的，并讨论了人工智能和创造力。\n我一直对美学着迷。例如山地全景，独立游戏设计，在珊瑚礁潜水，迷幻体验，以及塔尔科夫斯基的电影。美丽的视觉场景有一种无需言语就能传达意义的力量。它几乎就像是一种我们都凭直觉说的原始的视觉语言。\n当我看到生成性模型(特别是Gans)令人印象深刻的进步时，我开始想象这会导致什么结果。就像相机和放映机带来了电影业一样，我想知道在深度学习革命的基础上可以建立什么样的叙事。要做到这一点，我的第一个想法是简单地调整Gans现有的代码库，以允许直接可视化音频。神经联觉就是这样诞生的。\n你为第一部神经联觉作品做了多少工作？你有没有遇到过任何独特的挑战？\n我想为第一个渲染的视频编码花了六个多月的时间，因为我是在业余时间做的。最大的挑战是如何使用从音轨中提取的特征来操纵Gans潜在输入空间。我想为观众在视觉和听觉之间创造一个令人满意的匹配。\n下面是对我所做工作的一点了解：我应用傅立叶变换从音频中提取时变频率分量。我还执行和声/打击乐分解，基本上将旋律与轨道的节奏成分分开。然后将这三个信号(瞬时频率内容、旋律能量和节拍)组合以操纵甘斯潜在空间，从而产生由音频直接控制的视觉效果。\n是否每个图像数据集都是唯一的？您如何收集这些数据集的图像，需要多少图像？\n我花了很多时间收集大量不同的图像数据集，以创建有趣的生成性模型。这些数据集的首要目标是美学，而不是像大多数Gans那样的现实主义。实验各种图像集合的混合是很耗时的，因为GAN培训需要大量的计算，而且我并没有完全可用的数据中心。\n我使用的大多数数据集都是我多年来遇到的图像集。我救他们是因为我知道总有一天我会用上他们。我一直对美学感兴趣，所以当我发现能激发第六感的东西时，我会把它保存起来。\n大多数GAN论文使用超过50,000张图像的数据集，但在实践中，您可以使用较少的示例。第一步是从已经在大数据集上训练过的预先训练的GaN模型开始。这意味着模型中的卷积滤光片已经具有良好的形状，并且包含有关视觉世界的有用信息。其次是数据增强，它基本上是翻转或旋转图像，以有效地增加训练数据量。因为我并不真正关心样本真实感，所以我实际上可以负担得起非常积极的图像增强。这导致比实际源图像多得多的训练图像。例如，我最近在泰特现代美术馆的一次表演中使用的模型只有3000张真实图像，大大增加到了大约7万张的训练集。\n最近，许多新的研究明确解决了GAN的低数据机制(例如，您可以在此处、此处和此处找到)。我目前的代码库利用这些技术来训练只有几百个图像的GAN。\n你把神经联觉说成是你自己和人工智能之间的合作。你认为利用人工智能技术的创意项目的未来有什么潜力？\n这实际上是整个项目中最有趣的部分。我通常会带着具体的意图出发，即我想要创造什么样的视觉效果。然后，我整理我的数据集，调优训练脚本的参数，并开始训练模型。一次完整的训练通常需要几天时间才能汇合。不过，模型很快就开始返回经常出乎意料和令人惊讶的样本。这就启动了一个有趣的反馈循环，我更改了模型的代码，模型用不同的样本进行响应，我做出反应，然后继续进行。创作过程不再完全在我的控制之下；我正在有效地与人工智能系统合作创作这些作品。\n我真的相信这是这种方法最大的优势：你不受自己想象力的限制。有一个完全不同的系统也在以意想不到和有趣的方式影响着相同的思想空间。这会把你作为一个创造者引导到你从未涉足过的领域。\n看着人工智能领域的巨大进步速度，强烈地激励我想象10年后可能会发生什么。毕竟，现代深度学习才8岁！我预计摩尔定律将继续带来更强大的计算能力，AI模型将继续随着更多的计算而扩展，这种媒介的可能性将遵循这一指数趋势。\n目前形式的神经联觉是一个原型。它是一个更宏伟的想法的0.1版，利用深度学习作为未来先进互动媒体体验的核心组件。\n您对神经联觉的未来有何创造性的规划？你有什么目标或未来的计划吗？\n我一直对这种概观效果着迷，宇航员们描述了从太空看到整个地球是如何深刻地改变了他们的世界观，点燃了人们的意识，即我们都是同一个脆弱的生态系统的一部分，悬浮在黑暗的太空中。\n对我来说，这是深刻的、疏远的经历可以对人们的选择和行为产生壮观影响的很好的证据。我们需要的是观念上的转变，不再是部落对我们和他们的感觉。我们要朝着目标共同、挑战共同的全球化社会迈进。\n我们的世界面临着越来越多的全球性问题，这些问题深深植根于我们以当地为中心的世界观。这些观点根深蒂固地植根于我们的基因；我们在小部落中进化，只需要关注他们当地的环境。然而，世界正在朝着一个全球互联的事件网络发展，在这个网络中，现在不能再与整个系统断开联系。例如，看看气候变化，人们为人为划定的国籍、种族甚至性别的边界而斗争。\n因此，我的长期愿景是创造丰富的、身临其境的体验，并具有改变视角的能力。如果你愿意的话，可以说是电影院2.0。我想象一种互动体验，在那里，一群人可以进入一个人工智能生成的世界(例如使用虚拟现实耳机)，在那里，视觉场景是如此完全陌生和令人惊叹，以至于迫使大脑暂时停止通常描述正在发生的事情的叙述。这就是冥想的本质目标：体验世界的本来面目，强调当下的体验，而不是我们围绕它构建的叙事。\n因此，我们的目标是模仿一个人可以从积极的迷幻体验、冥想洞察力或太空之旅中体验到的知觉转变。认识到我们的“正常”世界观只是我们可能体验到的一小部分。我相信这种感性的转变可能是人类最独特的特征。它让想象力的巨大奇迹为我们的世界提供动力，是我们应对世界上最大挑战的最强大的工具。\n从技术的角度来看，我们离创造这些基本的“影院2.0”体验还有多远？\n我想说，从技术角度看，我们已经非常接近了。最新的生成模型(例如StyleGANv2或BigGanDeep)能够创建非常逼真的样本，并允许非常高的多样性。目前所缺乏的是让非编码者使用这项技术来获得创造性的创造性工具。主要的挑战，至少对我来说，是创造一个令人信服的故事。\n你可以在Steenbrugge的专门主页上看到更多Steenbrugge的神经联觉工作，并在这里尝试wzrd.ai。他在YouTube和Twitter上也很活跃，并愿意与其他有类似想法和抱负的创意人员合作。你可以通过neralsynenssia@gmail.com联系他。\nLionbridge AI作为可信的培训数据源拥有20多年的经验，可帮助大大小小的企业构建、测试和改进机器学习模型。我们拥有超过1,000,000名合格贡献者的社区位于全球各地，全天候可用，提供对各种语言和文件类型的海量数据的访问。今天就联系吧。", "note_en": "Neural Synesthesia is an AI art project that aims to create new and unique audiovisual experiences with artificial intelligence. It does this through collaborations between humans and generative networks. The results feel almost like organic art. Swirls of color and images blend together as faces, scenery, objects, and architecture transform to music. There’s a sense of things swinging between feeling unique and at the same time oddly familiar.\n  Neural Synesthesia was created by Xander Steenbrugge, an online content creator who made his start in data science while working on brain-computer interfaces. During his master thesis, he helped build a system that classified imagined movement through brain signals. This system allowed patients suffering from Locked-in syndrome to manipulate physical objects with their minds. The experience impressed upon Steenbrugge the importance of machine learning, and the potential for AI technology to build amazing things.\n Outside of Neural Synesthesia, Steenbrugge works with a startup using machine learning for drug discovery and runs a popular YouTube channel. He’s also working on  wzrd.ai, a platform that augments audio with immersive video through the work of AI. In this interview, we talk about Neural Synesthesia’s inspiration, how it works, and discuss AI and creativity.\n    I’ve always had a fascination for aesthetics. Examples are mountain panoramas, indie game design, scuba diving in coral reefs, psychedelic experiences, and films by Tarkovsky. Beautiful visual scenes have the power to convey meaning without words. It’s almost like a primal,  visual language we all speak intuitively.\n When I saw the impressive advances in generative models (especially GANs), I started imagining where this could lead. Just like the camera and the projector brought about the film industry, I wondered what narratives could be built on top of the deep learning revolution. To get hands on with this, my first idea was to simply tweak the existing codebases for GANs to allow for direct visualization of audio. This was how Neural Synesthesia was born.\n  How much work did you do for the first Neural Synesthesia piece? Did you face any unique challenges?\n I think coding for the first rendered video took over six months because I was doing it in my spare time. The biggest challenge was how to manipulate the GANs latent input space using features extracted from the audio track. I wanted to create a satisfying match between visual and auditory perception for viewers.\n Here’s a little insight into what I do: I apply a Fourier Transform to extract time varying frequency components from the audio. I also perform harmonic/percussive decomposition, which basically separates the melody from the rhythmic components of the track. These three signals (instantaneous frequency content, melodic energy, and beats) are then combined to manipulate the GANs latent space, resulting in visuals that are directly controlled by the audio.\n  Is every image dataset unique? How do you collect images for these datasets, and how many images do you need?\n I spent a lot of time collecting large and diverse image datasets to create interesting generative models. These datasets have aesthetics as their primary goal rather than realism, like most GANs. Experimenting with various blends of image collections is time consuming, since GAN training requires lots of compute and I don’t exactly have a data center at my disposal.\n Most of the datasets I use are image sets I’ve encountered over the years. I saved them because I knew one day I’d have a use for them. I’ve always had an interest in aesthetics so when I discover something that triggers that sixth sense, I save it.\n Most GAN papers use datasets of more than 50,000 images, but in practice you can get away with fewer examples. The first step is to start from a pre-trained GAN model that has already been trained on a large dataset. This means the convolutional filters in the model are already well-shaped and contain useful information about the visual world. Secondly, there’s  data augmentation, which is basically flipping or rotating an image to effectively increase the amount of training data. Since I don’t really care about sample realism, I can actually afford to do very aggressive image augmentation. This results in many more training images than actual source images. For example, the model I used for a recent performance at Tate Modern had only 3,000 real images, aggressively augmented to a training set of around 70,000.\n Recently, a lot of new research explicitly addresses the low-data regime for GANs (such as what you can find  here,  here, and  here). My current codebase leverages these techniques to train GANs with as little as a few hundred images.\n  You talk about Neural Synesthesia as a collaboration between yourself and AI. What kind of potential do you see for the future of creative projects utilizing AI technology?\n This is actually the most interesting part of the entire project. I usually set out with specific intentions as to what type of visual I want to create. I then curate my dataset, tune the parameters of the training script, and start training the model. A full training run usually requires a few days to converge. Very quickly though, the model starts returning samples that are often unexpected and surprising. This sets an intriguing feedback loop into motion, where I change the code of the model, the model responds with different samples, I react, and it goes on. The creative process is no longer fully under my control; I am effectively collaborating with an AI system to create these works.\n I truly believe this is the biggest strength of this approach: you are not limited by your own imagination. There’s an entirely alien system that is also influencing the same space of ideas, often in unexpected and interesting ways. This leads you as a creator into areas you never would have wandered by yourself.\n Looking at the tremendous pace of progress in the field of AI strongly motivates me to imagine what might be possible 10 years from now. After all, modern Deep Learning is only 8 years old! I expect that Moore’s law will continue to bring more powerful computing capabilities, that AI models will continue to scale with more compute, and that the possibilities of this medium will follow this exponential trend.\n Neural Synesthesia in its current form is a prototype. It’s a version 0.1 of a grander idea to leverage deep learning as the core component of the advanced interactive media experiences of the future.\n  What kind of creative works do you have planned for the future of Neural Synesthesia? Do you have any goals or future plans?\n I’ve always been fascinated by the  overview effect, where astronauts describe how seeing the Earth in its entirety from space profoundly changes their worldview, kindling the awareness that we are all part of the same, fragile ecosystem, suspended in the blackness of space.\n To me, this is great evidence that profound, alienating experiences can have spectacular effects on people’s choices and behaviors. And what we need is a shift in perception away from tribal feelings of us versus them. We need to move towards a global society with common goals and common challenges.\n Our world is increasingly facing global issues that are deeply rooted in our locally-centered world views. These views are deeply rooted in our genes; we evolved in small tribes that only needed to attend to their local environments. However, the world is evolving towards a globally connected web of events, where the present can no longer be disconnected from the system as a whole. For example, look at climate change, and people fighting over artificially drawn borders of nationality, race, or even gender.\n As such, my long-term vision is to create rich, immersive experiences with the power to shift perspectives. Cinema 2.0, if you will. I imagine an interactive experience, where a group of people can enter an AI-generated world (e.g. using Virtual Reality headsets) where the visual scenery is so utterly alien and breathtaking that it forces the mind to temporarily halt its usual narrative of describing what’s going on. This is essentially the goal of meditation: to experience the world as it is, emphasizing the experience of the present moment rather than the narrative we construct around it.\n The goal then, is to mimic the perceptual shift one can experience from a positive psychedelic experience, meditative insight, or a trip to space. To realize that our ‘normal’ world view is just a tiny sliver of what it is possible to experience. I believe this perceptual shift is probably the most unique human characteristic. It allows the great wonder of imagination to power our world, and is the most powerful tool we have to tackle the world’s largest challenges.\n  From a technology standpoint, how far away are we from creating these basic “cinema 2.0” experiences?\n I would say that from a technical point of view, we’re getting very close. The latest Generative models (e.g. StyleGANv2 or BigGanDeep) are able to create very realistic samples and allow for very high diversity. What is lacking at present are creative tools that let non-coders use this technology to get creative. The main challenge, at least for me, is to create a compelling narrative.\n   You can see more of Steenbrugge’s Neural Synesthesia work at its  dedicated homepage, and try out  wzrd.ai here. He’s also active on  YouTube and  Twitter, and open to collaborating with other creatives who have similar ideas and aspirations. You can contact him at neuralsynesthesia@gmail.com.\n   With over 20 years of experience as a trusted training data source, Lionbridge AI helps businesses large and small build, test, and improve machine learning models. Our community of 1,000,000+ qualified contributors is located across the globe and available 24/7, providing access to a huge volume of data across all languages and file types.  Get in touch today.", "posttime": "2020-07-13 09:41:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,人工智能,艺术,scientist", "title": "数据科学家尝试将人工智能/人类协作用于视听艺术", "title_en": "Data Scientist Tries AI/Human Collaboration For Audio-Visual Art", "transed": 1, "url": "https://lionbridge.ai/articles/neural-synesthesia-when-art-meets-gans/", "via": "", "real_tags": ["科学家", "人工智能", "艺术", "scientist"]}, {"category": "", "categoryclass": "", "imagename": "c1378babd63b453c7f4e086f00f711c3.png", "infoid": 1011438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "允许我发行和控制一个国家的货币，我不在乎是谁制定了这个国家的法律。-卡尔·梅耶尔·罗斯柴尔德(1744-1812)。\n我们的数据是众包的，请帮助让它变得更好！尽管互联网上没有可靠的金融犯罪数据来源，但它往往被锁在付费墙后面，或者是以PDF等不可搜索的格式，或者干脆被遗忘。我们由您提供支持，因为任何人都可以通过下面的表格提交我们的所有信息，一旦核实，这些信息将被添加到主页中。谢谢!。\n国民不了解我们的银行体系和货币体系已经足够好了，因为如果他们了解了，我相信在明天早上之前就会有一场革命。--​-Henry Ford", "note_en": "&#34;Permit me to issue and control the money of a nation, and I care not who makes its laws&#34; - Mayer Amschel Rothschild (1744–1812)\n Our data is crowdsourced, help make it better!    There is no solid source of data on the internet for financial crimes, it is often locked behind paywalls, or in non-searchable formats like PDFs or just plain forgotten about. We are powered by you as all our information can be submitted by anyone via the form below and it will be added to the main sheet once verified. Thanks!\n          It is well enough that people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.  ​-Henry Ford", "posttime": "2020-07-13 09:40:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "追踪,laundry,发行", "title": "洗钱：追踪银行业的犯罪行为", "title_en": "The Money Laundry: Tracking Criminality of the Banking Industry", "transed": 1, "url": "https://www.thelaundry.money/", "via": "", "real_tags": ["追踪", "laundry", "发行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在世界的某个地方打开一扇新窗", "note_en": "Open a new window somewhere in the world", "posttime": "2020-07-13 09:00:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,查看,view,地方", "title": "WindowSwp：查看世界上某处某人的窗口", "title_en": "WindowSwap: View someone's window somewhere in the world", "transed": 1, "url": "https://window-swap.com/", "via": "", "real_tags": ["windows", "查看", "view", "地方"]}, {"category": "", "categoryclass": "", "imagename": "dd644852f42df8f32621398b460d9f60.png", "infoid": 1011436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我经常被问到是否可以评论一下别人关于一切的理论。这可能是加勒特·利西的E8理论，或者是埃里克·温斯坦的几何统一性，或者是斯蒂芬·沃尔弗拉姆的宇宙只是一个大图形的观点，等等。那就好。让我告诉你我对这件事的看法。但恐怕这不是你想听的。\n在我们开始之前，让我提醒你们物理学家所说的“万物理论”是什么意思。就我们目前所知，宇宙和宇宙中的一切由四个基本的相互作用维系在一起。这就是电磁力，强核力和弱核力，以及重力。你所熟悉的所有其他力量，比如范德华力，或肌肉力，或将你拉向维基百科上无限链接序列的力，这些都是源自四个基本互动的非基本力。至少在原则上是这样。\n现在，三种基本的相互作用，电磁力和强核力和弱核力，属于同一类型。它们被收集在粒子物理的标准模型中。标准模型中的三种力由量子场论来描述，简而言之，这意味着所有的粒子都遵守量子力学的原理，比如测不准原理，它们可以纠缠等等。然而，引力是由爱因斯坦的广义相对论描述的，对量子力学一无所知，因此它有别于其他三种力。这是个问题，因为我们知道标准模型中的所有量子粒子都有引力。但我们不知道这是如何运作的。我们只是没有一个理论来描述基本粒子是如何引力的。为此，我们需要一个关于重力量子行为的理论，一个被称为“量子引力”的理论。\n我们需要量子引力理论，因为广义相对论和标准模型在数学上是不相容的。到目前为止，这只是一个纯粹的理论问题，因为根据我们目前所能做的实验，我们不需要使用量子重力。在目前所有可能的实验中，我们要么测量量子效应，要么测量粒子质量太小，以至于我们无法测量它们的引力。或者我们可以观察到一些物体的引力，但是它们没有量子行为。所以，目前我们不需要量子引力来描述任何观测。然而，这种情况有望在未来几十年内改变。我在之前的一段视频中谈到了这一点。\n除了缺失的量子引力理论，物理学家对标准模型还有其他各种问题。最值得注意的是，虽然标准模型中的三种力都属于同一类型，但它们也都不同，因为每种力都属于不同的对称类型。物理学家更愿意将所有这些力统一为一个，这意味着它们都将来自相同的数学结构。\n在许多情况下，该结构是一个大的对称群。因为我们没有观察到这一点，所以我们的想法是，大对称性只会在能量高到我们还无法测试它们的时候才会显现出来。在我们到目前为止测试过的能量下，对称性必须被打破，这就产生了标准模型。这种标准模范力量的统一，简称为“大统一”或“大统一理论”。\n那么，物理学家所说的万物理论就是一种理论，所有四种基本的相互作用都是从这个理论派生出来的。这意味着它既是一个大统一理论，也是一个量子引力理论。\n这听起来是个好主意，是的。但。没有理由实际上应该用万物理论来描述自然。虽然我们确实需要量子引力理论来避免自然规律中的逻辑不一致，但标准模型中的力不一定要统一，它们也不一定要与引力统一。会很漂亮的，是的，但是没有必要。标准模型在没有统一的情况下工作得很好。\n所以这个万物理论的整个想法是建立在一个不科学的前提之上的。有些人希望自然规律以一种非常具体的方式变得漂亮。他们希望它简单，他们希望它是对称的，他们希望它是自然的，在这里我必须警告你，“自然”是一个技术术语。所以他们知道他们想要什么是真的。然后，他们偶然发现了一些让他们印象特别深刻的数学，他们开始确信，它肯定对自然规律起到了作用。简而言之，他们发明了一种他们认为的宇宙应该是什么样子的理论。\n这根本不是发展科学理论的好策略，当然也不是标准的方法论。事实上，情况恰恰相反。在理论发展中依靠美，从历史上看是行不通的。在物理学中，理论发展的突破来自于数学矛盾的解决。我真的写了一本书，关于物理学基础的研究人员坚持使用理论发展的方法是多么有问题，我们没有理由认为这些方法应该奏效，而且事实上是不起作用的。我写了一本书，内容是关于物理学基础的研究人员坚持使用我们没有理由认为应该奏效的理论发展方法。\n对万物理论和大统一的探索始于20世纪80年代。物理学家提出的理论在某种程度上是可证伪的，它们已经被证伪了。自然界显然对物理学家们认为的数学问题不屑一顾。\n话虽如此，你认为我对利西、温斯坦和沃尔夫拉姆试图建立万物理论有何看法？嗯，科学史告诉我们，他们猜测一些漂亮的数学并希望它对某些东西有用的方法是非常没有前途的。这并不是不可能的，但几乎可以肯定这是浪费时间。我已经足够仔细地研究了利西、温斯坦、沃尔夫勒姆和其他许多人的万物理论，能够告诉你，他们没有令人信服地解决现有基本理论中的任何实际问题。我不想再仔细看了，因为我也不想浪费时间。\n但我不喜欢评论个人对一切的理论。我不喜欢它，因为它让我觉得非常不公平。这些人大多是单独工作或以小组形式工作的研究人员。他们非常专注于自己的追求，并为此付出了令人难以置信的努力。他们大多不交税，所以这真的是他们的私事，我凭什么评判他们呢？此外，你们中的许多人显然发现，有天才对周围的一切都有理论是一件很有趣的事情。我觉得没问题。\n我有一个问题，如果理论，尽管被证明是无用的，成长为大型的，纳税的研究项目，雇用了数千人，就像弦理论，超对称和大统一所发生的那样。这就产生了一个问题，因为它会消耗资源，并可能完全阻碍进展，这就是在物理学基础上发生的事情。\n像利西、温斯坦和沃尔夫拉姆这样的人至少提醒我们，大程序并不是你能用数学做的唯一事情。所以，听起来很奇怪，虽然我不认为他们的具体研究途径比弦理论更有前途，但我很高兴他们还是这么做了。事实上，物理学需要更多像他们这样的人，无论多么困难，他们都有勇气走自己的路。\n简要的总结是，如果你听到一些关于新提出的万物理论的东西，不要问这个数学是否正确。因为许多从事这方面工作的人都很聪明，他们知道自己的数学，这可能是对的。你和所有报道这类事情的科学记者应该问的问题是，我们有什么理由认为这段特殊的数学与现实有关。“因为它很漂亮”不是一个科学的答案。我从来没有见过一种能给这个问题提供令人满意的科学答案的万事万物的理论。\n萨宾·霍森费尔德是法兰克福高级研究院的高级研究员，她在那里从事超越标准模型、现象学量子引力和广义相对论修正的物理研究，如果你想更多地了解物理学基础出了什么问题，请阅读她的书《迷失在数学中：美如何引领物理学迷失方向》。\n这篇文章最初发表在霍森菲尔德的博客Backaction上，经许可转载。", "note_en": "I get constantly asked if I could please comment on other people’s theories of everything. That could be Garrett Lisi’s  E8 theory or Eric Weinstein’s  geometric unity or Stephen Wolfram’s idea that the universe is but a  big graph, and so on. Good, then. Let me tell you what I think about this. But I’m afraid it may not be what you wanted to hear.\n  Before we start, let me remind you what physicists mean by a “Theory of Everything.” For all we currently know, the universe and everything in it is held together by four fundamental interactions. That’s the electromagnetic force, the strong and the weak nuclear force, and gravity. All other forces that you are familiar with, say, the van der Waals force, or muscle force, or the force that’s pulling you down an infinite sequence of links on Wikipedia, these are all non-fundamental forces that derive from the four fundamental interactions. At least in principle.\n  Now, three of the fundamental interactions, the electromagnetic and the strong and weak nuclear force, are of the same type. They are collected in what is known as the standard model of particle physics. The three forces in the standard model are described by quantum field theories which means, in a nutshell, that all particles obey the principles of quantum mechanics, like the uncertainty principle, and they can be entangled and so on. Gravity, however, is described by Einstein’s theory of General Relativity and does not know anything about quantum mechanics, so it stands apart from the other three forces. That’s a problem because we know that all the quantum particles in the standard model have a gravitational pull. But we do not know how this works. We just do not have a theory to describe how elementary particles gravitate. For this, we would need a theory for the quantum behavior of gravity, a theory of “ quantum gravity,” as it’s called.\n We need a theory of quantum gravity because general relativity and the standard model are mathematically incompatible. So far, this is a purely theoretical problem because with the experiments that we can currently do, we do not need to use quantum gravity. In all presently possible experiments, we either measure quantum effects, but then the particle masses are so small that we cannot measure their gravitational pull. Or we can observe the gravitational pull of some objects, but then they do not have quantum behavior. So, at the moment we do not need quantum gravity to actually describe any observation. However, this will hopefully change in the coming decades. I talked about this in an earlier video.\n Besides the missing theory of quantum gravity, there are various other issues that physicists have with the standard model. Most notably it’s that, while the three forces in the standard model are all of the same type, they are also all different in that each of them belongs to a different type of symmetry. Physicists would much rather have all these forces unified to one, which means that they would all come from the same mathematical structure.\n In many cases that structure is one big symmetry group. Since we do not observe this, the idea is that the big symmetry would manifest itself only at energies so high that we have not yet been able to test them. At the energies that we have tested it so far, the symmetry would have to be broken, which gives rise to the standard model. This unification of the forces of the standard model is called a “grand unification” or a “grand unified theory,” GUT for short.\n What physicists mean by a theory of everything is then a theory from which all the four fundamental interactions derive. This means it is both a grand unified theory and a theory of quantum gravity.\n This sounds like a nice idea, yes. But. There is no reason that nature should actually be described by a theory of everything. While we  do need a theory of quantum gravity to avoid logical inconsistency in the laws of nature, the forces in the standard model do not have to be unified, and they do not have to be unified with gravity. It would be pretty, yes, but it’s unnecessary. The standard model works just fine without unification.\n So this whole idea of a theory of everything is based on an unscientific premise. Some people would like the laws of nature to be pretty in a very specific way. They want it to be simple, they want it to be symmetric, they want it to be natural, and here I have to warn you that “natural” is a technical term. So they have an idea of what they want to be true. Then they stumble over some piece of mathematics that strikes them as particularly pretty and they become convinced that certainly it must play a role for the laws of nature. In brief, they invent a theory for what they think the universe  should be like.\n  This is simply not a good strategy to develop scientific theories, and no, it is most certainly not standard methodology. Indeed, the opposite is the case. Relying on beauty in theory development has historically worked  badly. In physics, breakthroughs in theory-development have come instead from the resolution of mathematical inconsistencies. I have literally written a book about how problematic it is that researchers in the foundations of physics insist on using methods of theory development that we have no reason to think should work, and that as a matter of fact do not work.\n The search for a theory of everything and for grand unification began in the 1980s. To the extent that the theories which physicists have come up with were falsifiable they have been falsified. Nature clearly doesn’t give a damn what physicists think is pretty math.\n Having said that, what do you think I think about Lisi’s and Weinstein’s and Wolfram’s attempts at a theory of everything? Well, scientific history teaches us that their method of guessing some pretty piece of math and hoping it’s useful for something is extremely unpromising. It is not impossible it works, but it is almost certainly a waste of time. And I have looked closely enough at Lisi’s and Weinstein’s and Wolfram’s and many other people’s theories of everything to be able to tell you that they have not convincingly solved any actual problem in the existing fundamental theories. And I’m not interested to look any closer, because I don’t also want to waste my time.\n But I don’t like commenting on individual people’s theories of everything. I don’t like it because it strikes me as deeply unfair. These are mostly researchers working alone or in small groups. They are very dedicated to their pursuit and they work incredibly hard on it. They’re mostly not paid by tax money so it’s really their private thing and who am I to judge them? Also, many of you evidently find it entertaining to have geniuses with their theories of everything around. That’s all fine with me.\n I get a problem if theories that despite having turned out to be useless grow to large, tax-paid research programs that employ thousands of people, as it has happened with  string theory and supersymmetry and grand unification. That creates a problem because it eats up resources and can entirely stall progress, which is what has happened in the foundations of physics.\n People like Lisi and Weinstein and Wolfram at least remind us that the big programs are not the only thing you can do with math. So, odd as it sounds, while I don’t think their specific research avenue is any more promising than string theory, I’m glad they do it anyway. Indeed, physics can need more people like them who have the courage to go their own way, no matter how difficult.\n The brief summary is that if you hear something about a newly proposed theory of everything, do not ask whether the math is right. Because many of the people who work on this are really smart and they know their math and it’s probably right. The question you, and all science journalists who report on such things, should ask is what reason do we have to think that this particular piece of math has anything to do with reality. “Because it’s pretty” is not a scientific answer. And I have never seen a theory of everything that gave a satisfactory scientific answer to this question.\n Sabine Hossenfelder is a Research Fellow at the   Frankfurt Institute for Advanced Studies  where she works on physics beyond the standard model, phenomenological quantum gravity, and modifications of general relativity. If you want to know more about what is going wrong with the foundations of physics, read her book  Lost in Math: How Beauty Leads Physics Astray.\n  This post was originally published on   Backreaction , Hossenfelder’s blog, and his reprinted with permission.", "posttime": "2020-07-13 09:00:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "万物,theory,理论", "title": "我们需要万物理论吗？", "title_en": "Do We Need a Theory of Everything?", "transed": 1, "url": "http://nautil.us/blog/do-we-need-a-theory-of-everything", "via": "", "real_tags": ["万物", "theory", "理论"]}, {"category": "", "categoryclass": "", "imagename": "df42481d73ea94e4a28bc577b301bec0.jpeg", "infoid": 1011433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "半导体制造商ADI公司。正在洽谈收购竞争对手Maxim集成产品公司(Maxim Integrated Products Inc.)。据知情人士透露，收购价格约为200亿美元，这将是今年规模最大的合并交易之一。\nAnalog和Maxim正在讨论一项全股票交易，最快可能在周一敲定，尽管这不能保证，谈判仍有可能破裂。", "note_en": "Semiconductor maker Analog Devices Inc. is in talks to buy rival Maxim Integrated Products Inc. for roughly $20 billion in what would be one of the largest merger deals of the year, according to people familiar with the matter.\n  Analog and Maxim are discussing an all-stock deal that could be finalized as soon as Monday, though it isn’t guaranteed and discussions could still fall apart.", "posttime": "2020-07-13 08:38:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "devices,maxim", "title": "ADI公司将收购Maxim集成公司", "title_en": "Analog Devices to acquire Maxim Integrated", "transed": 1, "url": "https://www.wsj.com/articles/analog-devices-in-talks-to-buy-maxim-integrated-for-more-than-17-billion-11594593796", "via": "", "real_tags": ["devices", "maxim"]}, {"category": "", "categoryclass": "", "imagename": "c6f19bb39d9f2abe11c3d9cc41e0d4e4.jpg", "infoid": 1011432, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是直截了当的。拿上我的行李包，开车到树林里的一间小屋，然后蹲在地板下，通过防毒面具上的阀门吃罐头食品，等待核弹落下。\n但在参观了我的第一个真正的核掩体后，我的世界末日计划升级了。现在，我的需求清单包括地下游泳池和末日后的攀岩墙。我对如何度过地球上垂死的呼吸已经变得挑剔起来。我的袋子被探伤了。我已经看到了世界上最高科技的掩体，我想加入。\n欢迎来到生存公寓。这个前阿特拉斯导弹筒仓改造而成的豪华公寓综合体为世界上有钱人和有权势的人提供了一个购买终极人寿保险的机会：一个承诺将庇护所和风格完美结合的末日掩体。\n生存公寓有很多你们标准的尘埃掩体的特征。它位于地下(地下200英尺，位于堪萨斯州乡村中心，距离堪萨斯城200英里)。它建于冷战期间(作为核导弹发射设施)。它还改装了9英尺厚的钢筋混凝土墙，设计用来抵御从龙卷风到半英里外坠落的12000吨核弹头的一切。\n但是，如果这句谚语让你着迷，而你需要一个地方去的话，那就别打算来这里。即使你能找到它(位置是秘密的)，这个掩体也是一天24小时守卫的。此外，这甚至不是你的主要问题。你进入的最大障碍是什么？这种安全是要付出代价的。\n这个建筑群的一个单元的起价是100万美元，外加每月额外2500美元的会费，以支付你的生活费：水电，互联网，所有你梦寐以求的鸡蛋罐头。\n然而，对于超级富豪和偏执狂来说，你不能给安全定价。当核战争就在我们家门口时，你认为世界上的有钱有势的人会在街上颤抖吗？见鬼，没有。他们正在转入地下。我决心加入他们。\n《黑客天启》是CNET的最新纪录片系列，深入挖掘可以将我们从世界末日拯救出来的科学技术。你可以查看我们关于大流行、核冬天、全球干旱、海啸、Cryonics和逃离星球的剧集，并在YouTube上查看完整的系列剧。\n核冬天不喜欢在北部过圣诞节。这是一个全球性的噩梦王国，冰河时代那样的温度持续多年，人口灭绝，我们所知的生命变成了科幻噩梦的素材。\n科罗拉多大学(University Of Colorado)大气和海洋科学教授、世界知名的核战争全球影响专家布赖恩·图恩(Brian Toon)至少是这么认为的。\n我在科罗拉多州博尔德市的办公室会见了图恩，了解当一枚100千吨的核武器坠落时到底会发生什么。\n图恩说，如果你走进一英里左右，压力波是如此强烈，以至于混凝土建筑都会被吹倒。而在那个区域的某个地方，有一股辐射爆炸。基本上，暴露在这种环境中的人中，有一半会在一到两周内死于皮肤的辐射烧伤和辐射中毒。\n图恩说，核爆炸就像是将一片太阳带到地球上，而这种爆炸的后果会引发巨大的火灾--想想全市的大火。这些大火将大量烟雾推入平流层。由于平流层从不下雨，阳光无法到达地球。欢迎来到核冬天。\n图恩说，气温变得比上一个冰河时代要冷。所以我们在整个星球上有大约10年的亚冰河时期的温度。\n这就是生存公寓存在的原因--保护巨富免受全球核战争的破坏，并确保世界上最有权势的人能够舒适地生存，而不是在荒原上颤抖，等待他们的亿万富翁的大脑被饥饿的人群吃掉。\n从堪萨斯城机场到幸存者公寓花了三个小时，尽管你的里程可能会有所不同(全市范围的疏散和炸毁的桥梁会增加旅行时间)。但在经过广阔的田野和鲜红的谷仓后，我找到了我要找的东西：世界上最好的高科技世界末日准备。\n从外面看，它看起来不怎么样。在带刺铁丝网后面的警卫。一台风力涡轮机在微风中静静地转动。精心摆放的监控摄像头。还有两扇8吨重的门，安放在我们面前那座不起眼的小山上。但这可不是什么荒无人烟的散兵坑。里面是你可能会找到的最豪华、最不同寻常的公寓建筑群之一。\n在我穿过围栏后，山上巨大的大门打开了，幸存公寓的主人拉里·霍尔(Larry Hall)迎接了我。他身材魁梧，握手有力，堪萨斯的好客形象--他邀请我进入掩体，就像邻居邀请我周日下午来喝啤酒一样。\n但是当我们走进去的时候，我意识到这不是一次普通的房屋参观。尽管外面阳光灿烂，但里面的空气凉爽而静止。我的脚步声在冰冷的混凝土上回荡。当8吨重的门在我身后砰的一声关上时，我突然意识到我实际上被困住了。我不可能一个人离开这里。\n我在一个地下15层200英尺深的地堡的最顶端。在这一上层，一个宽阔的圆顶设在山上，容纳了主要的入口和公共娱乐设施。那里有宠物公园、攀岩墙和游泳池(配有水上滑梯)。\n在圆顶下面，圆柱形的筒仓又有14层--最上面的三层是机械室、医疗设施和食品店(完整的水培和水产养殖设施)，紧随其后的是七层的住宅公寓。在底部，最后四层是教室和图书馆，一个电影院和酒吧，以及一个健身房(带桑拿)。\n当我们穿过主入口室(如果居民在封锁期间需要打开他们的全地形车辆，这里就是一个受保护的停车场)时，霍尔和我讨论了一下布局，滔滔不绝地说出了一系列令人费解的特征，比如防弹墙和防弹门。我们从诱捕区域开始。\n霍尔说，如果发生骚乱或食物短缺，那是很正常的事情，他指的是你可能在世界末日中发现的那种普通紧急情况。\n但是如果因为脏弹而有辐射怎么办？你得走进这间房间，这是一间去污的洗手间。这里的化学物质可以解决所有问题。我们有碘片治疗你们的辐射，我们有检测辐射的盖革计数器，我们有特殊的化学品来擦洗你们体内的生物和放射性污染物。但是你会失去你的衣服。你会赤身裸体，感到害怕。\n当我们蜿蜒穿过“生存公寓”时，它就像“克里布兹”一集中的我，背景设在一个黑暗的、另类的现实中。这是我们存放迷彩服的地方！这是射击场！这就是我们如何在超级火山爆发时清除空气中的火山灰！\n乘一小段电梯到电影院楼层，我们停下来滚动浏览生存公寓内部数据库中的2000部电影(我们最终选择了世界末日)。我去健身房试试健身车和桑拿房。我们突然走进教室，走过一排光滑的iMac电脑，仍然用塑料袋包装着，等待着可能永远不会来的学生们的教室。\n这里的电脑也可以上网……。说大也大吧。每个在Survival Condo买了一套公寓的人也都提供了他们的兴趣清单：木工、编织、末日末日后的生存主义。霍尔和他的团队将这些关键字输入到爬行互联网的软件中，下载并缓存每个居民的信息和网站。\n霍尔说：因此，如果我们遇到互联网崩溃的灾难，我们会为我们的居民下载大量的医疗信息、生存信息和爱好信息，这样他们就可以继续使用他们的搜索引擎了。\n参观完共享设施后，我们就可以看看公寓本身了。这些不是我期待中的小型惊慌室--它们感觉像是旧金山或曼哈顿新公寓楼里的单元。厨房里摆满了不锈钢电器，这里是零度以下的冰箱，那里是沃尔夫炉灶。这里有崭新的沙发、原封不动的咖啡桌和床，坦率地说，它们比我老家的床舒服得多。\n在浴室里，一个自动坐浴盆正等着你。虽然这不是我对沐浴后清新的第一偏好(我试过一次，但有很多人尖叫)，拉里·霍尔告诉我们，这个建筑群的设计考虑到了长达五年的时间。在五年内，75人的最大入住率所需的厕纸数量将占满整个公寓的楼层。原来每个人都会大便，但在世界末日里，你将不得不在没有TP的情况下大便。\n撇开厕所不谈，我可以想象自己住在这里。它并不觉得狭小，这很可能是因为风景的缘故。在“回到未来2”的装饰风格中，每个共管公寓墙壁上的电视面板都是高科技的窗户，向居民展示真实世界。\n额外的好处是，如果世界真的要毁灭了，这些窗口可以实时显示外面的大屠杀，这要归功于幸存者公寓的外部监控摄像头。所有人都到厨房来！地面居民现在正在成群结队地狩猎！\n沿着生存公寓的这条路走下去，霍尔已经获得了第二个导弹发射井，他计划将其改造成一个更大的掩体。目前，这个空间仅仅是一个混凝土外壳，但它让我对我刚刚参观过的装备齐全的掩体的规模有了一个感觉。深筒仓已经用新的混凝土地板隔开了，但从中间切下来的电梯竖井让我看到了这个地方到底有多深，令人眼花缭乱。\n沿着一条侧道走下去，与主要筒仓被巨大的防爆门隔开，我们找到了20世纪60年代在这个设施工作的军事人员的原始生活区，他们一次在狭窄的房间里生活和工作两个星期。这个地方看起来就像游戏“半条命”中的场景：油漆剥落，金属生锈，陈旧的浴室隔间看起来绝对是闹鬼的。\n这个地方现在是冷战时期的遗迹，但霍尔计划在未来两年对其进行翻新，以创建另一个豪华掩体。考虑到它的面积是原来的“生存公寓”的三倍，他预计这座建筑的价格在5000万至6000万美元之间，但他已经有了一份有兴趣购买新单元的人的等待名单。显然，生意正在蓬勃发展。\n然而，在这些掩体中找到一个螺栓孔并不便宜。最初的Survival Condo中最小的半层单元售价为100万美元，而大的整层单元售价高达300万美元。\n霍尔告诉我，我们所有的人都是白手起家的百万富翁。他们非常成功：医生、工程师、律师、国际商人……。他们几乎都有孩子。他们担心的是如果发生了什么情况。\n霍尔滔滔不绝地说出了一系列可能发生的事情：超级风暴桑迪、海啸、太平洋地震、德克萨斯州的飓风、全球气候变化、食品短缺、经济崩溃、陨石撞击、太阳耀斑……。\n他说，如果这些都是让你烦恼的事情，那么这类设施就不会让你担心。\n这些都是让我烦恼的事情，拉里。但坦率地说，我正在认识到我真的不能担心。我没有钱在堪萨斯州买一套临时住所，以防万一。\n我没有一辆防弹的长程车送我去那里，你最好相信我没有私人飞机在车库里等着。\n我带着一种冰冷的、不可避免的恐惧意识到，我生来就有核恐惧和微不足道的预算。\n我想这是一个残酷的讽刺，即使当核武器下降，社会结构已经解体到面目全非的时候，有钱人和有权势的人仍然会比我们其他人过得更好。\n我们仍将是一个由富人和穷人组成的社会。除了这种情况，富人们将在他们舒适的空调地下电影院观看世界末日。而那些没有钱的人将在荒野中，经历核冬天的严寒，捡起我们所爱的人的骨头，试图在真正的东西上生存下来。", "note_en": "It&#39;s been straightforward. Grab my go bag, drive out to a shack in the woods, then hunker down under the floorboards eating canned food through the valve in my gas mask, waiting for the nukes to drop.\n But after visiting my first real nuclear bunker, my apocalypse plan has been upgraded. Now my list of needs includes &#34;underground swimming pool&#34; and &#34;postapocalyptic rock-climbing wall.&#34; I&#39;ve become fussy about how I&#39;ll spend time during the planet&#39;s dying breaths. My bug-out bag has gotten bougie. I&#39;ve seen the world&#39;s most high-tech bunker, and I want in.\n  Welcome to the  Survival Condo. This former  Atlas Missile silo turned luxury condominium complex offers the world&#39;s rich and powerful a chance to buy into the ultimate life insurance: an apocalypse bunker that promises the perfect combination of shelter and style.\n The Survival Condo has a lot of the hallmarks of your standard fallout shelter. It&#39;s underground (200 feet underground, in the middle of rural Kansas, 200 miles from Kansas City). It was built during the Cold War (as a nuclear missile launch facility). It&#39;s also been retrofitted with nine-foot-thick reinforced concrete walls designed to survive everything from tornadoes to 12-kiloton nuclear warheads dropping half a mile away.\n  But if the proverbial hits the fan and you need a place to go, don&#39;t plan on coming here. Even if you could find it (the location is secret), the bunker is guarded 24 hours a day. Besides, that&#39;s not even your main problem. Your biggest barrier to getting in? This kind of security comes at a price.\n The starting cost for a unit in this complex is $1 million, plus an extra $2,500 per month in dues to cover your living expenses: electricity, water, internet, all the tinned eggs you could dream of.\n For the ultra-rich and paranoid, though, you can&#39;t put a price on safety. When nuclear war is on our doorstep, do you think the world&#39;s rich and powerful will be quaking in the streets? Hell no. They&#39;re going underground. And I&#39;m determined to join them.\n Hacking the Apocalypse is CNET&#39;s new documentary series digging into the science and technology that could save us from the end of the world. You can check out our episodes on  Pandemic,  Nuclear Winter,  Global Drought,  Tsunamis,  Cryonics and  Escaping the Planet and see the full series on  YouTube.\n   Nuclear winter isn&#39;t like spending Christmas upstate. It&#39;s a global nightmare realm, where Ice Age-like temperatures last for years, populations perish and life as we know it becomes the stuff of sci-fi nightmares.\n At least that&#39;s according to Brian Toon, professor of atmospheric and oceanic sciences at the University of Colorado and world-renowned expert on the global effects of nuclear war.\n I met with Toon in his offices in Boulder, Colorado, to learn about exactly what happens when a 100-kiloton nuclear weapon falls.\n  &#34;If you get within a mile or so, the pressure wave is so intense it will blow down concrete buildings,&#34; says Toon. &#34;And somewhere in that zone, there&#39;s a blast of radiation ... and basically half of the people exposed to that would die over a week or two from radiation burns on their skin and radiation poisoning.&#34;\n Toon says a nuclear explosion is like &#34;bringing a piece of the sun down to the Earth,&#34; and the aftermath of that kind of explosion causes huge fires -- think citywide infernos. Those fires push huge amounts of smoke up into the stratosphere. And because it never rains in the stratosphere, sunlight can&#39;t reach Earth. Welcome to nuclear winter.\n  &#34;The temperatures become colder than the last Ice Age,&#34; says Toon. &#34;So we have sub-Ice Age temperatures over the whole planet for about 10 years.&#34;\n That&#39;s exactly why the Survival Condo exists -- to protect the mega-rich from the devastation of global nuclear war, and to make sure the world&#39;s most powerful people can survive in comfort, rather than shivering in the wasteland, waiting to have their billionaire brains eaten by hungry hordes.\n    It took three hours to get to the Survival Condo from the Kansas City airport, though your mileage may vary (citywide evacuations and blown-out bridges will add travel time). But after passing broad fields and bright red barns, I&#39;ve found what I came for: The best the world has to offer in high-tech apocalypse prepping.\n From the outside it doesn&#39;t look like much. A guard behind a barbed-wire fence. A wind turbine quietly turning in the breeze. Carefully placed surveillance cameras. And two eight-ton doors set into the nondescript hill in front of us. But this isn&#39;t some foxhole in the middle of nowhere. Inside is one of the most luxurious and unusual apartment complexes you&#39;re likely to find.\n After I&#39;m ushered through the perimeter fence, the massive doors in the hill open and I&#39;m greeted by Larry Hall, the owner of the Survival Condo. He&#39;s a burly man with a firm handshake, and he&#39;s the picture of Kansas hospitality -- he invites me into the bunker like a neighbor having me over for Sunday afternoon beers.\n  But as we step inside, I realize this is no ordinary house tour. Despite the glaring sun outside, the air inside is cool and still. My footsteps echo on cold concrete. And as the eight-ton doors slam behind me with a resounding bang, it occurs to me I&#39;m essentially trapped. There&#39;s no way I&#39;d be able to get out of here on my own.\n I&#39;m at the very top of a bunker that descends 15 floors and 200 feet underground. On this upper level, a wide dome set into the hill houses the main entry and communal recreation facilities. That&#39;s where you&#39;ll find the pet park, climbing wall and swimming pool (complete with a water slide).\n Beneath the dome, the cylindrical silo houses a further 14 floors -- the top three floors are where you&#39;ll find the mechanical rooms, medical facilities and a food store (complete with a full hydroponics and aquaculture setup), followed beneath by seven levels of residential condos. At the bottom, the final four floors house the classroom and library, a cinema and bar, and a workout room (with a sauna).\n As we make our way through the main entry chamber (which acts as a protected car park if residents need to unpack their all-terrain vehicle during lockdown), Hall talks me through the layout, rattling off a baffling array of features like ballistic walls and bulletproof doors. We kick things off in the &#34;entrapment area.&#34;\n &#34;If there&#39;s rioting or food shortages, that&#39;s a normal thing,&#34; Hall says, referring to the kind of run-of-the-mill emergencies you might find in the apocalypse.\n &#34;But what if there&#39;s radiation because of a dirty bomb? You would have to go in this room, which is a decontamination scrub room. The chemicals in here can take care of everything. We have iodine pills to treat you for radiation, we have Geiger counters that detect radiation, and we have special chemicals to scrub both biological and radioactive contaminants from you. But you would lose your clothes. You&#39;d be naked and afraid.&#34;\n As we wind our way through the Survival Condo, it&#39;s like I&#39;m in an episode of Cribz, set in a dark, alternate reality. This is where we keep the camo gear! This is the gun range! Here&#39;s how we scrub the volcanic ash out of the air in the event of a supervolcano!\n  A short elevator ride down to the cinema level, and we stop to scroll through the 2,000 films on the Survival Condo&#39;s internal database (we settle on Armageddon). I head to the gym and try out the exercise bike and sauna room. We pop into the school room and walk past a row of sleek iMacs, still in their plastic wrapping, awaiting the classroom of students that may never come.\n The computers here are also equipped with internet... sort of. Everyone who has bought a unit in the Survival Condo has also provided a list of their interests: woodworking, knitting, post-apocalyptic survivalism. Hall and his team feed those keywords into software that crawls the internet, downloading and caching information and websites for each resident.\n &#34;So in the event that we had a catastrophe where the internet went down, we would have downloaded a lot of medical information and survival and hobby information for our residents so that they could still use their search engine,&#34; Hall says.\n After touring the shared facilities, we get a look inside the condos themselves. These aren&#39;t the tiny panic rooms I&#39;d been expecting -- they feel like units in a new apartment complex in San Francisco or Manhattan. The kitchens are full of stainless steel appliances, a Sub-Zero fridge here, a Wolf cooktop there. There are brand-new couches, untouched coffee tables and beds that are, frankly, way more comfortable than my bed back home.\n  In the bathroom, an automated bidet awaits. While it&#39;s not my first preference in post-ablution freshness (I tried once, there was a lot of shrieking), Larry Hall tells us the complex was designed with long stays in mind -- up to five years. The amount of toilet paper required for the maximum occupancy of 75 people over five years would fill an entire floor of the condo. Turns out everybody poops, but in the apocalypse, you&#39;re going to have to do it without TP.\n  Toilets aside, I could see myself living here. It doesn&#39;t feel cramped, and that&#39;s probably because of the view. In a decorating touch straight out of Back to the Future II, TV panels built into the walls of each condo act as high-tech &#34;windows&#34; to show residents the real world.\n As a bonus, if the world is really ending, these windows display a real-time view of the carnage outside, thanks to the Survival Condo&#39;s external surveillance cameras. Everyone come to the kitchen! The surface-dwellers are hunting in packs now!\n   Down the road from the Survival Condo, Hall has secured a second missile silo he plans to convert into an even bigger bunker. Right now this space isn&#39;t much more than a concrete shell, but it gives me a sense of the scale of the kitted-out bunker I&#39;ve just visited. The deep silo has been divided up with new concrete floors, but an elevator shaft cut down the middle gives me a giddying view of just how deep this place goes.\n  Down a side passage, separated from the main silo by massive blast doors, we find the original living quarters for the military personnel who staffed this facility during the 1960s, living and working in cramped rooms for two weeks at a time. The place looks like a scene from the game Half-Life: peeling paint, rusted metal, old bathroom stalls that definitely look haunted.\n  This place is a Cold War relic now, but Hall plans to spend the next two years retrofitting it to create another luxury bunker. Given that it&#39;s three times the size of the original Survival Condo, he&#39;s expecting a price tag of $50 million to $60 million on the build, but he already has a waiting list of people interested in buying the new units. Clearly, business is booming.\n Getting a bolt-hole in one of these bunkers doesn&#39;t come cheap, however. The smallest half-floor unit in the original Survival Condo sells for $1 million, while the large, full-floor units go for up to $3 million.\n  &#34;All of our people are self-made millionaires,&#34; Hall tells me. &#34;They&#39;re very successful: doctors, engineers, lawyers, international business people... almost all of them have children. And they&#39;re concerned about the &#39;what if&#39; scenario.&#34;\n Hall rattles off a list of potential &#34;what ifs&#34;: Superstorm Sandy, tsunamis, Pacific earthquakes, hurricanes in Texas, global climate change, food shortages, economic collapse, meteorite impact, solar flares...\n &#34;If those are the kind of things that bother you, this is the kind of facility it takes to not worry,&#34; he says.\n   Those are the kinds of things that bother me, Larry. But frankly, I&#39;m learning that I can&#39;t really afford to be worried. I don&#39;t have the money to buy a pied-à-terre in Kansas, just in case.\n I don&#39;t own a bulletproof, extended-range vehicle to get me there, and you&#39;d better believe I don&#39;t have a private jet waiting in the garage.\n I realize with a kind of cold, inevitable terror that I&#39;ve been blessed with nuclear fears and a tin-foil-hat budget.\n I guess there&#39;s a grim irony in the idea that even when the nukes drop and the very fabric of society has disintegrated beyond recognition, the rich and powerful will still have it better off than the rest of us.\n We&#39;ll still be a society of haves and have-nots. Except in this case, the haves will be watching Armageddon from the comfort of their air-conditioned, underground cinema. And the have-nots will be out in the wilderness, freezing through nuclear winter and picking over the bones of our loved ones, trying to survive the real thing.", "posttime": "2020-07-13 08:17:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "世界末日,nuclear,公寓", "title": "在豪华的核掩体里保护巨富们免受世界末日的侵扰", "title_en": "Inside the luxury nuclear bunker protecting the mega-rich from the apocalypse", "transed": 1, "url": "https://www.cnet.com/features/inside-the-survival-condo-nuclear-bunker-protecting-the-ultrarich-hacking-the-apocalypse/", "via": "", "real_tags": ["世界末日", "nuclear", "公寓"]}, {"category": "", "categoryclass": "", "imagename": "df42481d73ea94e4a28bc577b301bec0.jpeg", "infoid": 1011428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "半导体制造商ADI正在洽谈收购竞争对手Maxim集成产品公司(Maxim Integrated Products Inc.)。据知情人士透露，收购金额超过170亿美元，这将是今年规模最大的合并交易之一。\n一些知情人士说，Analog和Maxim正在讨论一项全股票交易，这将使Maxim的估值超过其目前约170亿美元的市值。交易最快可能在周一敲定，但不能保证，谈判仍有可能破裂。\n在一个从汽车到洗衣机的日常用品越来越多地融入芯片以连接互联网的世界里，随着芯片制造商寻求规模和扩大产品组合，半导体行业出现了一系列活动。\nMaxim的半导体用于各种环境，包括工业、汽车和医疗保健。该公司成立于1983年，总部设在加利福尼亚州圣何塞。\nAnalog的市值约为460亿美元，总部设在马萨诸塞州的诺伍德。几年来，这些公司断断续续地进行了谈判。", "note_en": "Semiconductor maker  Analog Devices    ADI  0.20%  is in talks to buy rival  Maxim Integrated   Products Inc. for more than $17 billion in what would be one of the largest merger deals of the year, according to people familiar with the matter.\n  Analog and Maxim are discussing an all-stock deal that would value Maxim at more than its current market value of roughly $17 billion, some of the people said. A deal could be finalized as soon as Monday, though it isn’t guaranteed and discussions could still fall apart.\n  There has been a flurry of activity in the semiconductor industry as chip makers seek scale and expand their product portfolios in a world in which everyday items from cars to washing machines are increasingly incorporating chips to link to the internet.\n  Maxim’s semiconductors are used in a variety of settings including industrial, automotive and health care. The company was founded in 1983 and is based in San Jose, Calif.\n    Analog, with a market value of roughly $46 billion, is based in Norwood, Mass. The companies have held talks on and off for years.", "posttime": "2020-07-13 07:55:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,股票,半导体,semiconductor,maxim", "title": "消息人士：半导体制造商ADI正在洽谈以170亿美元以上的全股票交易收购竞争对手Maxim Integrated", "title_en": "Sources: semiconductor manufacturer Analog Devices is in talks to buy rival Maxim Integrated for $17B+ in an all-stock deal", "transed": 1, "url": "https://www.wsj.com/articles/analog-devices-in-talks-to-buy-maxim-integrated-for-more-than-17-billion-11594593796?mod=djemalertNEWS", "via": "", "real_tags": ["交易", "股票", "半导体", "maxim"]}, {"category": "", "categoryclass": "", "imagename": "d04ff3624329a936d4f049758ef4771a.jpeg", "infoid": 1011427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上世纪80年代，当我还是耶鲁大学物理和天文学的年轻教授时，解构主义在英语系盛行。我们科学部门会嘲笑人文学科缺乏客观的知识标准，集中体现在一场反对客观真理本身存在的运动中，认为所有这些对知识的主张都被由于种族、性别或经济主导地位而产生的意识形态偏见所玷污。", "note_en": "In the 1980s, when I was a young professor of physics and astronomy at Yale, deconstructionism was in vogue in the English Department. We in the science departments would scoff at the lack of objective intellectual standards in the humanities, epitomized by a movement that argued against the existence of objective truth itself, arguing that all such claims to knowledge were tainted by ideological biases due to race, sex or economic dominance.", "posttime": "2020-07-13 07:54:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思想,corruption,知识", "title": "论科学的思想腐败", "title_en": "The Ideological Corruption of Science", "transed": 1, "url": "https://www.wsj.com/articles/the-ideological-corruption-of-science-11594572501", "via": "", "real_tags": ["思想", "知识"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011426, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近的一篇论文对版本控制提出了一种新的数学观点。我最初是从pijul了解到这一点的，pijul是一种新的版本控制系统(VCS)，它的灵感来自于那篇论文。但是如果你浏览pijul主页，你不会发现它与现有的VCS有什么不同的细节。所以我做了一点挖掘，这一系列的博客帖子就是结果。\n在第一部分(即这一部分)，我将回顾一下论文中发展起来的一些理论。具体地说，我将描述一种考虑补丁和合并的方法，它保证永远不会有合并冲突。在第二部分，我将展示pijul如何将该理论付诸实践，在第三部分，我将深入研究pijul的实现。\n在进入补丁理论之前，有一个简短的警告：任何真正的VCS都需要处理很多繁琐的细节(目录、二进制文件、文件重命名等)。为了直截了当地谈到有趣的新想法，我将跳过所有这些。对于这些帖子而言，VCS只需要跟踪单个文件，您应该将其视为行列表。\n补丁是两个文件之间的区别。在本系列的后面部分，我们将探讨一些疯狂的新想法，所以让我们从一些熟悉的、令人欣慰的东西开始吧。我们在这里讨论的补丁类型可以追溯到Unix的早期：\n为了真正拥有有用的VCS，您还需要能够删除行。但是删除行会增加一些复杂性，所以我们稍后再处理它们。\n举个例子，让我们从一个简单的文件开始：我今天早上的待办事项列表。\n回过头来看清单，我意识到我忘了一些重要的东西。这是新的一条：\n为了从原来的待办事项清单转到新的待办事项清单，我增加了袜子这一行。在原始Unix“diff”实用程序的格式中，补丁程序将如下所示：\n“1a2”行是一个代码，它告诉我们要在输入文件的第1行之后添加一些东西，下一位显然告诉我们要插入什么。\n由于本博客不是命令行工具，我们将用漂亮的图表而不是平面文件来表示补丁。下面是我们将如何绘制上面的面片：\n希望它是不言而喻的，但以防万一：一个箭头从左边到右边，表示右边的线与左边的线相同。右边没有箭头的线是添加的线，因为补丁不允许重新排列线，所以保证线不会交叉。\n在我们的符号中确实有一些隐含的东西需要大声说出来：对我们来说，补丁绑定到特定的输入文件。这是我们与经典Unix方式不同的第一点：我们使用“diff”生成的经典Unix补丁原则上可以应用于任何输入文件，并且它仍然会在第一行之后插入“*穿上袜子”。在很多情况下，这并不是你想要的，但有时是你想要的。\n补丁最棒的地方在于，它们可以让多个人编辑同一个文件，然后合并他们所做的更改。假设我的妻子也决定将一些事情放在我的待办事项列表中：她提取原始文件并添加一行：\n现在我的待办事项清单有两个新版本：我穿袜子的和我妻子扔垃圾的。让我们把它们都画在一起：\n这就带来了合并：因为我更喜欢将我的待办事项列表作为一个单一文件，所以我想合并我妻子的更改和我自己的更改。在这个例子中，结果应该是什么是非常明显的，但是让我们来看一下合并的一般问题。我们将缓慢而谨慎地完成此操作，我们的端点可能与您习惯的不同。\n首先，我需要为一个显而易见的概念介绍一些符号：两个补丁的组合是通过应用一个补丁，然后应用另一个补丁而得到的补丁。因为我们的“补丁”还包括原始文件，所以您不能只组合两个旧补丁。如果p是从文件O到文件A的补丁，r是从A到B的补丁，那么您可以合成这两个补丁(但只能按一个顺序！)。为了获得从O到B的补丁，我将这篇作文写成pr：首先应用p，然后应用r。\n使用我们的图表可视化面片合成相当容易：要计算两条路径的合成，只需“跟着箭头走”\n我将从补丁组成的角度仔细定义什么是合并。我将以一种非常数学教授的方式来定义：我会给出一个精确的定义，然后是一些例子，只有在后面我才会解释为什么这个定义是有意义的。所以定义是这样的：如果p和q是两个不同的补丁，将文件O分别定位到文件A和B，则p和q的合并是一对补丁r和s，使得。\nR和s分别将A和B带到公共输出文件M，并且。\n我们可以用一个简单的图表来说明这个定义，其中大写字母表示文件，小写字母是它们之间的补丁：\n数学家(或任何想听起来很花哨的人)不会说pr=qs，而是会说上图是通勤的。\n这不是合并，因为它不符合条件pr=qs：沿着顶部路径合成面片给出。\n具体地说，两个补丁在最终列表中的哪一双鞋来自原始文件的问题上存在分歧。这就是条件pr=qs背后的真正含义：这意味着对于哪条线来自哪里永远不会有任何模棱两可的地方。如果您习惯于对您最喜欢的VCS使用责备或注释命令，您可能可以想象为什么这种模棱两可是不好的。\n当然，合并补丁是一个古老的想法，所以我只想简单地解释一下上面的表示与“传统”合并有何不同：传统上，合并是由算法定义的(有很多算法)。这些算法将尝试自动找到一个好的合并；如果它们找不到，您将被要求提供一个。\n我们将采取一种不同的方法：不是从算法开始，而是从我们希望良好的合并满足的属性列表开始。最后，我们会发现有一个唯一的合并可以满足所有这些属性(对我们来说幸运的是，还会有一个有效的算法来找到它)。\n合并的主要问题是它们不是唯一的。这本身并不是一个大问题：许多伟大的事情并不是独一无二的。问题是，我们通常希望自动合并，而自动系统需要一个明确的答案。最后，我们将通过定义一个特殊的合并类(称为完美合并)来处理这个问题，它将是唯一的。在此之前，我们将通过一些例子来探讨这个问题。\n让我们从一个愚蠢的示例开始，在该示例中，我们的合并工具决定添加一些额外的废话：\n当然，任何理智的合并工具都不会这样做，但根据我们在上一节中的规则，它仍然是有效的合并。显然，我们必须收紧规则才能排除这种情况。\n根据上面的规则，这两个合并都是有效的，但您需要实际了解这些行的含义，才能确定第一个合并更好(特别是如果外面下雨的话)。任何合理的自动合并工具都会拒绝选择，而是要求用户手动进行合并。\n上面的例子非常简单，但是一般情况下，您如何确定合并是否明确并且可以自动执行呢？在现有的工具中，细节取决于合并算法。既然我们从一种非算法的方法开始，让我们看看这会导致什么结果：我们将不再明确指定我们可以做哪些合并，而是描述理想的合并应该具有的属性。\n我即将给出的定义背后的主要思想是，它永远不会引起任何遗憾。也就是说，无论将来发生什么，我们总是可以通过合并来表示历史，就像我们可以使用原始分支一样。显然，这是一个很好的属性；就我个人而言，我认为为什么它是理想合并的定义属性的好选择并不明显，但我们稍后会谈到这一点。\n现在假设补丁p和q的原始创建者继续在他们自己的个人分支上工作，这些分支在将来的某个时候合并到文件F：\n我们说合并(r，s)是完美合并，如果对于合并(u，v)的每个可能的回声，存在唯一的补丁w，使得u=rvand v=sw。(在数学术语中，图是交换的。)我们将称w为延续，因为它告诉我们如何从合并的文件继续工作。重复一遍，如果对于每一个可能的未来，都有唯一的延续，那么合并就是完美的。\n让我们举几个例子来探索我们定义的各个方面。首先，一个完美合并的例子：\n要真正证明这是一个完美的合并需要付出一些努力；我将把它留作练习。看到一些不完美的例子会更有趣。\n让我们从一个愚蠢的合并示例开始，它引入了一个不必要的行：\n事实证明(令人惊讶，令人惊讶)这并不是完美的合并。为了理解我们对合并完美的定义如何排除这样的合并，下面是一个没有延续的可能未来的示例：\n因为我们的补丁不能删除线条，所以没有办法从合并到未来。\n下面是另一个示例，合并文件中两行的顺序有歧义的情况：\n这不是一个完美的合并，因为有一个没有有效延续的未来：假设我和我的妻子手动创建了所需的合并。\n现在，在合并和未来之间放置什么补丁(称为w)才能使一切通勤呢？唯一的可能性是。\n这不是合法的补丁，因为补丁不允许交换线路。\n如果您一直在偶然阅读有关pijul的内容，您可能会遇到“推出”这个词。事实证明，我们用来定义完美合并的模式在数学中非常常见。具体地说，在范畴论中，假设您有以下图表(其中大写字母是对象，小写字母是态射)：\n如果对于每个u和v，存在唯一的w使得图可交换，则(r，s)称为(p，q)的推出。换句话说，我们上面所说的“完美合并”也可以称为“将文件作为对象，将补丁作为态射的类别中的推出”。在本文的大部分时间里，我们将忽略一般的数学术语，而偏爱更直观、更具体于文件和补丁的语言。\n完美合并的主要问题是它们并不总是存在的。事实上，我们已经看到一个例子：\n上面的一对面片没有完美的融合。我们还没有实际证明这一点，但直觉上这是相当清楚的，我们前面也讨论了为什么一个潜在的合并不是完美的。好的，所以不是每一对补丁都能完美地出现。您可能已经知道这一点，因为Mergecconflicts就是这样产生的：VCS不知道如何自行合并补丁，所以您需要手动解决一些冲突。\n现在我们来看论文中最酷的部分：处理合并冲突的一个完全不同的想法。关键部分是，我们不是凑合不完美的合并，而是扩大合并可以产生的对象集。也就是说，不是每一对补丁都可以完美地合并到一个文件中，但也许它们可以合并到其他文件中。这个想法在数学中非常常见，甚至有一些一般性的抽象废话表明它总是可以做到的：有一种抽象的方法来泛化文件，以便每对泛化文件的补丁都可以完美地合并。这里的神奇之处在于，在这个特殊的案例中，抽象的胡言乱语凝聚成了完全明确和可管理的东西。\n文件是行的有序列表。拼图1(“图形”和“文件”的混合体)是线条的有向图形。(是的，我知道这是一个糟糕的名字，但它比“文件和补丁类别的自由有限补全中的对象”要好得多，这是论文的称呼。)换句话说，文件坚持让它的行按严格的线性顺序排列，而拼图允许它们是任何有向图。很容易看出放松行的严格顺序是如何解决我们前面的合并问题的。例如，下面是之前给我们带来问题的那种完美的合并：\n回想起来，这是一个非常明显的解决方案：如果我们不知道应该放什么订单和垃圾，我们应该只产生一个不指定订单的输出。有一点不太明显(但在论文中得到了证明)的是，当我们在Graggles世界而不是文件世界工作时，每一对补丁都有一个独特的完美合并。更酷的是，完美的合并很容易计算。稍后我将对其进行描述，但首先我必须说明补丁是如何推广到Graggles的。\n两个图(例如，A和B)之间的面片是从A的直线到B的直线的函数(称为p)，它尊重偏序，因为如果A中存在从x到y的路径，则B中也存在从p(X)到p(Y)的路径。在这个意义上，如果A中存在从x到y的路径，那么在B中也存在从p(X)到p(Y)的路径。(此条件是两个文件之间的补丁不允许更改顺序这一事实的延伸。)下面是一个示例：\n现在来看合并算法：假设我们有一个从曲线图A到曲线图B的面片p和从A到C的另一个曲面片q。为了计算p和q的完美合并，\n每当B中的一行和C中的一行共享A中的“父”时，将它们折叠成一行。\n就这样：两个步骤。以下是上一个示例的算法：我们希望合并这两个面片：\n对于第二步，我们看到这两个“待办事项”行都来自原始文件中的同一行，因此我们将这两行合并为一个。对“work”行执行相同的操作后，我们将获得所需的输出：\n通过将文件推广到Graggles，我们得到了一个非常好的好处：每对补丁都有一个(唯一的)完美合并，我们可以很容易地计算它。但是有一个明显的缺陷：我们使用的所有工具(编辑器、编译器等)。在文件上工作，而不是在Graggles上。这就是本文停止提供指导的地方，但有一个简单的解决方案：每当合并产生不是文件的东西时，只需制作一个新的补丁将其转换为文件即可。我们将其称为展平，下面是一个示例：\n如果你的眼睛现在还没有变得呆滞(抱歉，这是一篇很长的帖子)，你可能觉得有点被骗了：我向你承诺了一个新的框架，它可以避免手动合并解决方案的陷阱，但是平坦化看起来非常像手动合并解决方案。我将在下一篇文章中更详细地回答这一批评，在那里我将演示pijul工具以及它与git的不同之处。但是这里有一个小问题：扁平化和手动合并解决方案之间的区别在于，扁平化对VCS是完全透明的：它和其他任何补丁一样都是普通的补丁。这意味着我们可以做一些有趣的事情，比如重新排序或还原补丁，即使在存在冲突的合并的情况下也是如此。关于这一点的更多信息将在下一篇文章中介绍。\n现在终于到了解决我在这篇文章一开始就搁置的问题的时候了：我描述的系统基于不能删除行的补丁，我们显然需要在任何实际的系统中允许删除。不幸的是，这篇论文在这里帮不上忙：它声称您可以将删除合并到我描述的系统中，而不需要进行任何真正的更改，但是这篇论文中存在一个错误。具体地说，如果您调整定义以允许删除，则Graggles类别将不再在推送下关闭。以下是本文中的合并算法不完美的一个示例：\n(由于这篇帖子已经拖得够久了，我把它留作练习，看看问题出在哪里)。\n幸运的是，在我们最初的补丁系统中有一个模仿行删除的技巧。我是从Pijul那里得到这个想法的，但我会用稍微不同的方式来表达它。其想法是允许“重影”行，而不是实际删除它们。也就是说，我们将拼图中的每一条线都标记为“活动的”或“幽灵的”，然后我们在补丁中添加一条额外的规则：一条活动的线可以变成鬼线，但不能反之亦然。我们将画灰色的幻影线，并且指向幻影线的箭头将被虚线。这是一个删除“鞋”行的补丁。\n剩下的最后一步是扩展完美的合并算法，用虚线覆盖新的Graggles。事实证明，这很简单；以下是新的算法：\n对于具有共同父级的每一对线，将它们“折叠”成一条线，如果其中一条线是重影，则将折叠的线设置为重影。\n斜体字是唯一的新部分，它几乎不会增加任何额外的复杂性。\n我(非常详细地)向您展示了一种思考VCS中补丁的数学方法，尽管我还没有表现出很大的动机。不过，至少下次有人开始喋喋不休地谈论“补丁理论”时，你会对他们在说什么有所了解。\n在下一篇文章中，我将讨论pijul，这是一个松散地基于我在这篇文章中描述的算法的VCS。在那里，你将看到几个(玩具)例子，其中pijul坚实的数学基础帮助它避免了一些更成熟的VCS绊倒的角落案例。\n我要感谢Pierre-Étienne Meunier对这篇帖子草稿的评论和更正。当然，剩下的任何错误都是我自己的责任。\n他说：这篇文章的早期版本称它们为“digles”(用于有向图文件)，但几年后我觉得“graggles”听起来好一点。另外，如果你把它念错了一点，它就符合皮朱尔的整个鸟类主题。", "note_en": "A  recent paper suggested a new mathematicalpoint of view on version control. I first found out about it from  pijul,a new version control system (VCS) that is loosely inspired by that paper. Butif you poke around the  pijul  home page, you won’t findmany details about what makes it different from existing VCSes. So I did a bitof digging, and this series of blog posts is the result.\n In the first part (i.e. this one), I’ll go over some of the theory developed inthe paper. In particular, I’ll describe a way to think about patches andmerging that is guaranteed to never, ever have a merge conflict. In the secondpart, I’ll show how  pijul puts that theory into action, and in the third partI’ll dig into  pijul’s implementation.\n Before getting into some patch theory, a quick caveat: any real VCS needs todeal with a lot of tedious details (directories, binary files, file renaming,etc.). In order to get straight to the interesting new ideas, I’ll be skippingall that. For the purposes of these posts, a VCS only needs to keep track ofa single file, which you should think of as a list of lines.\n  A patch is the difference between two files. Later in this series we’ll belooking at some wild new ideas, so let’s start with something familiar andcomforting. The kind of patches we’ll discuss here go back to the early days ofUnix:\n  In order to actually have a useful VCS, you need to be able to delete linesalso. But deleting lines turns out to add some complications, so we’ll dealwith them later.\n For an example, let’s start with a simple file: my to-do list for this morning.\n  Looking back at the list, I realize that I forgot something important. Here’s the new one:\n  To go from the original to-do list to the new one, I added the line with thesocks. In the format of the original Unix “diff” utility, the patch would look like this:\n  The “1a2” line is a code saying that we’re going to add something after line 1 of theinput file, and the next bit is obviously telling us what to insert.\n Since this blog isn’t a command line tool, we’ll represent patches with pretty diagramsinstead of flat files. Here’s how we’ll draw the patch above:\n  Hopefully it’s self-explanatory, but just in case: an arrow goes from left toright to indicate that the line on the right is the same as the one on theleft. Lines on the right with no arrow coming in are the ones that got added.Since patches aren’t allowed to re-order the lines, the lines are guaranteednot to cross.\n There’s something implicit in our notation that really needs to be said outloud: for us,  a patch is tied to a specific input file. This is the first pointwhere we diverge from the classic Unix ways: the classic Unix patch that weproduced using “diff” could in principle be applied to  any input file, and itwould still insert “* put on socks” after the first line. In many cases thatwouldn’t be what you want, but sometimes it is.\n  The best thing about patches is that they can enable multiple people to editthe same file and then merge their changes afterwards. Let’s suppose that mywife also decides to put things on my to-do list: shetakes the original file and adds a line:\n  Now there are two new versions of my to-do list: mine with the socks, and mywife’s with the garbage. Let’s draw them all together:\n  This brings us to merging: since I’d prefer to have my to-do list as a singlefile, I want to merge my wife’s changes and my own. In this example, it’spretty obvious what the result should be, but let’s look at the general problemof merging. We’ll do this slowly and carefully, and our endpoint might bedifferent from what you’re used to.\n  First, I need to introduce some notation for an obvious concept: the composition of two patches is the patch that you would get by applying onepatch and then applying the other. Since a “patch” for us also includes theoriginal file, you can’t just compose any two old patches. If  p is a patchtaking the file  O to the file  A and  r is a patch taking  A to  B, thenyou can compose the two (but only in one order!) to obtain a patch from  O to B. I’ll write this composition as  pr: first apply  p, then  r.\n It’s pretty easy to visualize patch composition using our diagrams: to computethe composition of two paths, just “follow the arrows”\n    I’m going to define carefully what a merge is in terms of patch composition.I’ll do this in a very math-professor kind of way: I’ll give a precisedefinition, followed by some examples, and only afterwards will I explainwhy the definition makes sense.So here’s the definition: if  p and  q are two different patchestaking the file  O to the files  A and  B respectively, a  merge of  p and  qis a pair of patches  r and  s such that\n r and  s take  A and  B respectively to a common output file  M, and\n We can illustrate this definition with a simple diagram, where the capitalletters denote files, and the lower-case letters are patches going betweenthem:\n  Instead of saying that  pr = qs, a mathematician (or anyone who wantsto sound fancy) would say that the diagram above  commutes.\n     This is not a merge because it fails the condition  pr = qs: composing thepatches along the top path gives\n    Specifically, the two patches disagree on which of the shoes in the final listcame from the original file. This is the real meaning underlying the condition pr = qs: it means that there will never be any ambiguity about which linescame from where. If you’re used to using  blame or  annotate commands withyour favorite VCS, you can probably imagine why this sort of ambiguity would bebad.\n  Merging patches is an old idea, of course, and so I just want to brieflyexplain how the presentation above differs from “traditional” merging:traditionally, merging was defined by algorithms (of which there are many). These algorithms would try to automatically find a good merge; ifthey couldn’t, you would be asked to supply one instead.\n We’ll take a different approach: instead of starting with an algorithm, we’llstart with a list of properties that we want a good merge to satisfy. At the end,we’ll find that there’s a unique merge that satisfies all these properties(and fortunately for us, there will also be an efficient algorithm to find it).\n  The main problem with merges is that they aren’t unique. This isn’t a hugeproblem by itself: lots of great things aren’t unique. The problem is that weusually want to merge automatically, and an automatic system needs anunambiguous answer. Eventually, we’ll deal with this by defining a specialclass of merges (called perfect merges) which will be unique. Before that,we’ll explore the problem with some examples.\n  Let’s start with a silly example, in which our merge tool decides toadd some extra nonsense:\n  No sane merge tool would ever do that, of course, but it’s still a validmerge according to our rule in the last section. Clearly, we’ll haveto tighten up the rules to exclude this case.\n    Both of these merges are valid according to our rules above, but you need toactually know what the lines  mean in order to decide that the first merge isbetter (especially if it’s raining outside). Any reasonable automatic mergingtool would refuse to choose, instead requiring its user to do the mergemanually.\n The examples above are pretty simple, but how would you decide in generalwhether a merge is unambiguous and can be performed automatically? In existingtools, the details depend on the merging algorithm. Since we started off witha non-algorithmic approach, let’s see where that leads: instead of specifyingexplicitly which merges we can do, we’ll describe the properties that an idealmerge should have.\n  The main idea behind thedefinition I’m about to give is that it will never cause any regrets. That is,no matter what happens in the future, we can always represent the history justas well through the merge as we could using the original branches. Obviously,that’s a nice property to have; personally, I think it’s non-obvious why it’sa good choice as the  defining property of the ideal merge, but we’ll get tothat later.\n   And now suppose that the original creators of patches  p and  qcontinued working on their own personal branches, which merged sometime inthe future at the file  F:\n  We say that the merge  (r, s) is a  perfect merge if for  every possiblechoice of the merge  (u, v), there is a unique patch  w so that  u = rwand  v = sw. (In math terms, the diagram commutes.)We’re going to call  w a  continuation, since it tells us how to continueworking from the merged file. To repeat, a merge is perfect if for everypossible future, there is a unique continuation.\n  Let’s do a few examples to explore the various corners of our definition.First, an example of a perfect merge:\n  It takes a bit of effort to actually  prove that this is a perfect merge;I’ll leave that as an exercise. It’s more interesting to see some examplesthat fail to be perfect.\n  Let’s start with the silly example of a merge that introduced an unnecessaryline:\n  This turns out (surprise, surprise) not to be a perfect merge.To understand how our definition of merge perfection excludes merges like this,here is an example of a possible future without a continuation:\n  Since our patches can’t delete lines, there’s no way to get from  mergedto  future.\n  Here’s another example, the case where there is an ambiguity in the orderof two lines in the merged file:\n  This one fails to be a perfect merge because there is a future withno valid continuation: imagine that my wife and I manually created the desired merge.\n  Now what patch (call it  w) could be put between  merged and  future to makeeverything commute?The only possibility is\n  which isn’t a legal patch because patches aren’t allowed to swap lines.\n  If you’ve been casually reading about pijul, you might have encountered theword “pushout.” It turns out that the pattern we used for defining a perfectmerge is very common in math. Specifically, in category theory, suppose youhave the following diagram (in which capital letters are objectsand lowercase letters are morphisms):\n  If for every  u and  v there is a unique  w such that the diagram commutes,then  (r, s) is said to be the  pushout of  (p, q). In other words, what wecalled a “perfect merge” above could also be called a “pushout in the categorywith files as objects and patches as morphisms.”For most of this article, we’ll ignore the general math terminology in favorof language that’s more intuitive and specific to files and patches.\n  The main problem with perfect merges is that they don’t always exist. In fact,we already saw an example:\n  The pair of patches above has no perfect merge. We haven’t actually proved it,but intuitively it’s pretty clear, and we also discussed earlier why onepotential merge fails to be perfect. Ok, so not every pair of patches can bemerged perfectly. You probably knew that already, since that’s where mergeconflicts come from: the VCS doesn’t know how to merge patches on its own, soyou need to manually resolve some conflicts.\n Now we come to the coolest part of the paper: a totally different idea fordealing with merge conflicts. The critical part is that instead of making dowith an imperfect merge, we enlarge the set of objects that the merge canproduce. That is, not every pair of patches can be perfectly merged toa  file, but maybe they can be merged to something else.This idea is extremely common in math, and there’s even some general abstractnonsense showing that it can always be done: there’s an abstract way togeneralize files so that every pair of patches of generalized files can beperfectly merged. The miraculous part here is that in this particular case,the abstract nonsense condenses into something completely explicit and manageable.\n  A file is an ordered list of lines. A  graggle  1(a mixture of “graph” and “file”)is a directed graph of lines. (Yes, I know it’sa terrible name, but it’s better than “object in the free finite cocompletionof the category of files and patches,” which is what the paper calls it.)In other words, whereas a file insists on having its lines in a strict linear order,a graggle allows them to be any directed graph. It’s pretty easy to see how relaxingthe strict ordering of lines solves our earlier merging issues.For example, here’s a perfect merge of the sort that caused us problems before:\n  In retrospect, this is a pretty obvious solution: if we don’t know what ordershoes and garbage should go in, we should just produce an output that doesn’tspecify the order. What’s a bit less obvious (but is proved in the paper)is that when we work in the world of graggles instead of the world of files, every pair of patches has a unique perfect merge. What’s even cooler isthat the perfect merge is easy to compute. I’ll describe it in a second,but first I have to say how patches generalize to graggles.\n A patch between two graggles (say,  A and  B) is a function (call it  p) fromthe lines of  A to the lines of  B that respects the partial order, in thesense that if there is a path from  x to  y in  A then there is a path from p(x) to  p(y) in  B. (This condition is an extension of the fact thata patch between two files isn’t allowed to change the order.)Here’s an example:\n   And now for the merge algorithm: let’s say we have a patch  p going from thegraggle  A to the graggle  B and another patch  q going from  A to  C. Tocompute the perfect merge of  p and  q,\n whenever a line in  B and a line in  C share a “parent” in  A, collapse them into a single line.\n That’s it: two steps. Here’s the algorithm at work on our previous example: wewant to merge these two patches:\n    For the second step, we see that both of the “to-do” lines came from the sameline in the original file, so we combine those two into one. After doing thesame to the “work” lines, we get the desired output:\n   By generalizing files to graggles, we got a very nice benefit: every pair ofpatches has a (unique) perfect merge, and we can compute it easily. But there’san obvious flaw: all the tools that we use (editors, compilers, etc.) work onfiles, not graggles. This is where the paper stops providing guidance, but thereis an easy solution: whenever a merge results in something that isn’t a file,just make a new patch that turns it into a file. We’ll call this  flattening,and here’s an example:\n   If your eyes haven’t glazed over by now (sorry, it’s been a long post), youmight be feeling a bit cheated: I promised you a new framework that avoids thepitfalls of manual merge resolution, but flattening looks an awful lot likemanual merge resolution. I’ll answer this criticism in more detail in the nextpost, where I demonstrate the  pijul tool and how it differs from  git. Buthere’s a little teaser: the difference between flattening and manual mergeresolution is that flattening is completely transparent to the VCS: it’s justa patch like any other. That means we can do fun things, like re-ordering orreverting patches, even in the presence of conflicting merges. More on thatin the next post.\n  It’s time to finally address something I put off way at the beginning of thepost: the system I described was based on patches that can’t delete lines, andwe obviously need to allow deletions in any practical system. Unfortunately,the paper doesn’t help here: it claims that you can incorporate deletion intothe system I described without really changing anything, but there’s a bug inthe paper. Specifically, if you tweak the definitions to allow deletion thenthe category of graggles turns out not to be closed under pushouts any more.Here’s an example where the merge algorithm in the paper turns out not to beperfect:\n  (Since this post has dragged on long enough, I’ll leave it as an exercise tofigure out what the problem is).\n  Fortunately, there’s a trick to emulate line deletion in our original patchsystem. I got this idea from pijul, but I’ll present it in a slightlydifferent way. The idea is to allow “ghost” lines instead of actually deletingthem. That is, we mark every line in our graggle as either “live” or “ghost.”Then we add one extra rule to our patches: a live line can turn into a ghostline, but not the other way around. We’ll draw ghost lines in gray, and arrowspointing to ghost lines will be dashed. Here’s a patch that deletes the “shoes”line.\n  The last remaining piece is to extend the perfect merge algorithm to coverour new graggles with ghost lines. This turns out to be easy; here’s the newalgorithm:\n For every pair of lines with a common parent, “collapse” them into a single line,  and if one of them was a ghost, make the collapsed line a ghost.\n The bit in italics is the only new part, and it barely adds any extra complexity.\n  I showed you (in great detail) a mathy way of thinking about patches in a VCS,although I haven’t shown a whole lot of motivation for it yet. At the veryleast, though, next time someone starts droning on about “patch theory,” you’llhave some idea what they’re talking about.\n In the next post, I’ll talk about  pijul, a VCS that is looselybased around the algorithms I described in this post. There you’ll get to seesome (toy) examples where pijul’s solid mathematical underpinnings help it toavoid corner cases that trip up some more established VCSes.\n  I’d like to thank Pierre-Étienne Meunier for his comments and corrections ona draft of this post. Of course, any errors that remain are my ownresponsibility.\n 1:An earlier version of this post called them “digles” (for  directed graph fi le), but a couple years later I decided that “graggles” sounds abit better. Plus, if you mispronounce it a little, it fits inthe pijul’s whole bird theme.", "posttime": "2020-07-13 07:10:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "合并,merging", "title": "合并与修补(2017)", "title_en": "Merging and Patches (2017)", "transed": 1, "url": "https://jneem.github.io/merging/", "via": "", "real_tags": ["合并", "merging"]}, {"category": "", "categoryclass": "", "imagename": "a8a3be6574761f46599f46dbd2b11903.png", "infoid": 1011425, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "RGBDS(RedneX游戏男孩开发系统)是一个用于游戏男孩和游戏男孩颜色的免费汇编/链接软件包。它包括：\n这是原始RGBDS的一个分支，旨在使程序更像其他UNIX工具。\n此工具链的文档可以在此处在线查看，它是从此存储库中的手册页生成的。\n或者，可以简单地将RGBDS可执行文件放到使用它们的项目的文件夹中。\n如果您需要开发中的最新版本，应该可以按照说明在UNIX系统上使用MinGW或Cygwin编译RGBDS。\n您可以按照下面的说明构建RGBDS。但是，如果您不想自己构建RGBDS，您也可以使用HomeBREW安装它。\n要使用开发中的所有当前更改安装RGBDS(如GitHub上的主分支所示)，请使用：\n没有为这些系统分发正式的RGBDS二进制文件，您必须遵循下面的简单说明来编译和安装它。\n您可以通过运行pkg-config--cflag libpng来测试是否安装了libpng和pkg-config：如果输出是路径，则说明您是正确的，如果输出错误，则需要通过软件包管理器安装它们。\n然后，要安装编译后的程序和手册页，请运行(使用适当的权限，例如，使用sudo)：\nMakefile中有一些用户可以重新定义的变量。在Make命令行上给出以下变量时，可能会影响安装行为。例如，要将RGBDS安装在您的主目录中而不是系统范围内，请运行以下命令：\nDESTDIR：在安装过程中，此参数优先于所有路径。它主要用于包装。\n问：是否使构建静默。要使构建更详细，请清除此变量。默认为@。\n大约在1999年，Justin Lloyd(又名Otaku no Zoku)采用ASMotor来读取和生成GBZ80汇编/机器代码，并以RGBDS的形式发布了这个版本。\n2009年，Vegard Nossum对代码进行了修改，使其更类似于UNIX，并在GitHub上以rgbds-linux的形式发布了这个版本。", "note_en": "RGBDS (Rednex Game Boy Development System) is a free assembler/linker packagefor the Game Boy and Game Boy Color. It consists of:\n  This is a fork of the original RGBDS which aims to make the programs more likeother UNIX tools.\n  The documentation of this toolchain can be viewed online here, it is generated from the man pagesfound in this repository.\n        Alternatively, the RGBDS executables can be simply dropped in the folder of the project they&#39;re used in.\n If you require the latest version in development, it should be possible tocompile RGBDS with MinGW or Cygwin by following the instructions to build it onUNIX systems.\n   You can build RGBDS by following the instructions below. However, if you wouldprefer not to build RGBDS yourself, you may also install it using Homebrew.\n   To install RGBDS with all of the current changes in development (as seen on the master branch on GitHub), use:\n        No official binaries of RGBDS are distributed for these systems, you must followthe simple instructions below to compile and install it.\n           You can test if libpng and pkg-config are installed by running  pkg-config--cflags libpng: if the output is a path, then you&#39;re good, and if it outputsan error then you need to install them via a package manager.\n     Then, to install the compiled programs and manual pages, run (with appropriateprivileges, e.g, with  sudo):\n    There are some variables in the Makefile that can be redefined by the user. Thevariables described below can affect installation behavior when given on themake command line. For example, to install RGBDS in your home directory insteadof systemwide, run the following:\n     DESTDIR: This is prepended to all paths during the installation. It ismainly used for packaging.\n Q: Whether to quiet the build or not. To make the build more verbose,clear this variable. Defaults to  @.\n   Around 1999, Justin Lloyd (AKA Otaku no Zoku) adapts ASMotor to read andproduce GBZ80 assembly/machine code, and releases this version as RGBDS.\n 2009, Vegard Nossum adapts the code to be more UNIX-like and releasesthis version as rgbds-linux on GitHub.", "posttime": "2020-07-13 07:09:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,开发,游戏机,game,rgbds", "title": "RedneX游戏机开发系统", "title_en": "Rednex Game Boy Development System", "transed": 1, "url": "https://github.com/rednex/rgbds", "via": "", "real_tags": ["游戏", "开发", "游戏机", "game", "rgbds"]}, {"category": "", "categoryclass": "", "imagename": "e9167b8ad17c74f3b70724ca13fd109a.jpg", "infoid": 1011424, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，我在Facebook上发布了我的乳腺癌诊断。从那时起，我的Facebook订阅就有了“另类癌症治疗”的广告。这些广告对我的时间表来说都是新的，宣传从孜然种子到胶体银等各种癌症治疗方法。一些广告承诺在墨西哥的海滩上提供豪华诊所，甚至是“无毒癌症疗法”。\n我永远不会被这些广告迷住是有原因的：我是反对伪科学的倡导者。作为监督组织Bad Science Watch的顾问和反对虚假自闭症治疗运动的创始人，我已经学会了认识到伪科学营销的特点：未经证实的、有时甚至是危险的治疗方法，承诺过于简单化的解决方案和支持。像“漂白疗法”这样的东西承诺可以治疗从新冠肺炎到自闭症的各种疾病。\n当我看到这些广告时，我知道Facebook很可能已经给我贴上了接收它们的标签。有趣的是，我没有在我的新闻源中看到任何合法的癌症治疗广告，只有伪科学。这可能是因为伪科学公司在某种程度上依赖社交媒体，这是其他形式的医疗保健所不具备的。伪科学公司利用Facebook的社交和支持环境，将他们的产品与身份联系起来，并围绕他们的产品建立社区。他们使用有影响力的人和病人的推荐信。一些公司还通过Facebook的“支持小组”招募会员，以传销的方式销售他们的产品。\n通过所有这些社交媒体，患者开始有归属感，这使得他们更难质疑产品。癌症患者特别容易受到这种隐形营销的影响。很难接受癌症诊断带来的失控。作为癌症患者，我们被告知去哪里，怎么坐，吃什么。这可能是痛苦的、可怕的和疲惫的--然后我们所有的头发都会脱落。在大流行期间，我们中的许多人也处于孤立状态。我们的亲人不能来我们的约会，甚至不能去医院看望我们。现在，谁比以往任何时候都更能牵着我们的手？\n伪科学公司直接利用我们的恐惧和孤立，给我们一种控制感，同时声称他们的产品可以结束我们的痛苦。他们利用我们的情绪来提供虚假的选择，比如“细胞加速”公司在Facebook上宣称：“仅仅为了治疗乳腺癌的症状而殴打和擦伤身体并不一定是你可用的最好或唯一的选择。”你有选择！“。\n最近做完手术后，当我看着自己的身体时，我希望还有另一个选择。为了能在墨西哥的海滩上，我几乎愿意付出任何代价。但我目睹了这些公司的虚假承诺。我和一个人谈过，她飞到海滩诊所，回到家却发现她的肿瘤不能手术。证据很清楚：选择替代疗法而不是标准治疗的癌症患者的死亡率要高得多。\nFacebook在我们的许多生活中无处不在，人们使用这个平台搜索与健康相关的支持团体和信息。因此，我们可能会认为，Facebook在保持其内容不受欺诈和错误信息影响方面具有道德利害关系。但Facebook在“伪科学”这个术语上有一段奇怪的历史。直到去年四月，Facebook才将“伪科学”这个关键词从其定向广告类别中删除，而且直到科技刊物The Markup报道称，Facebook的广告门户网站上有7800万用户被列为对该类别有“兴趣”之后，“伪科学”才被删除。\n自从大流行开始以来，Facebook面临着越来越大的压力，要求其删除与冠状病毒相关的错误信息。脸书承诺，将在新冠肺炎相关广告上增加警示标签，并将删除用户举报的伪科学广告。问题是，伪科学内容在被读者标记之前可能会运行几个月，这一点就连Facebook也承认了。Facebook的主要广告筛选系统是自动的。在我们等待其人工智能系统赶上人类评论家的辨别能力的同时，一个拥有数十亿用户的平台上已经出现了源源不断的伪科学广告。\n会不会是Facebook变得太大了，无法对其内容进行充分的监管？也许我们需要的改变已经没有希望了？一些广告商似乎在暗示情况就是这样。他们正在用脚投票，然后干脆离开讲台。响应倡导组织停止仇恨牟利的呼吁，星巴克(Starbucks)、本田(Honda)、帝亚吉欧(Diageo)和巴塔哥尼亚(Patagonia)等广告商暂停了在Facebook上的广告，这是对该平台处理仇恨言论和错误信息方式的广泛抵制的一部分。本周，Facebook会见了“停止仇恨牟利”的代表。在组织者看来，会议进行得并不顺利。“Facebook把我们今天的会议当做一次公关活动，”组织者之一、非营利性媒体倡导组织自由新闻(Free Press)的杰西卡·J·冈萨雷斯(Jessica J.González)说。\n如果Facebook不改变，个人能做什么呢？最快的行动是暂停、删除甚至减少在Facebook(以及Facebook旗下的Instagram)上的时间。我决定加入这股潮流。\n我退出Facebook可能意味着更少的在线连接，也许是在我最需要它们的时候。但我宁愿离开，也不愿看到另一位癌症朋友所说的“打耳光”广告。\n我的手术团队没有带来虚假的希望，也没有把我送到海滩。他们站在一家满是砂砾的城市医院明亮的灯光下，给我做剖腹手术，修复我的身体，让我可以再次呼吸。他们提供的解决方案并不简单；我前面还有几个月的挑战。但在整个旅程中，我会从最亲近的人那里找到支持。不是从脸谱网上来的。\n安妮·博登(@AantistCures)是反对虚假自闭症治疗运动的执行董事，该运动致力于政府监管，以阻止自闭症伪科学。她也是监督组织“坏科学观察”(Bad Science Watch)的顾问，并主持了一个关于神经多样性的播客“不顺从”(Non-Compliance)。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "Last week, I posted about my breast cancer diagnosis on Facebook. Since then, my Facebook feed has featured ads for “alternative cancer care.” The ads, which were new to my timeline, promote everything from cumin seeds to  colloidal silver as cancer treatments. Some ads promise luxury clinics — or even “nontoxic cancer therapies” on a beach in Mexico.\n There’s a reason I’ll never fall for these ads: I’m an advocate against pseudoscience. As a consultant for the watchdog group  Bad Science Watch and the founder of the Campaign Against Phony Autism Cures, I’ve learned to recognize the hallmarks of pseudoscience marketing: unproven and sometimes dangerous treatments, promising simplistic solutions and support. Things like  “bleach cures” that promise to treat everything from Covid-19 to autism.\n When I saw the ads, I knew that Facebook had probably tagged me to receive them. Interestingly, I haven’t seen any legitimate cancer care ads in my newsfeed, just pseudoscience. This may be because pseudoscience companies  rely on social media in a way that other forms of health care don’t. Pseudoscience companies  leverage Facebook’s social and supportive environment to connect their products with identities and to build communities around their products. They use  influencers and patient testimonials. Some companies also recruit members through Facebook “support groups” to sell their products in  pyramid schemes.\n Through all this social media, patients begin to feel a sense of belonging, which makes it harder for them to question a product. Cancer patients are especially vulnerable to this stealth marketing. It’s hard to accept the loss of control that comes with a cancer diagnosis. As cancer patients, we are told where to go, how to sit and what to take. It can be painful and scary and tiring — and then all our hair falls out. During the pandemic, many of us are also isolated. Our loved ones can’t come to our appointments or even visit us in the hospital. Now, more than ever, who is there to hold our hand?\n Pseudoscience companies tap directly into our fears and isolation, offering us a sense of control, while claiming their products can end our pain. They exploit our emotions to offer phony alternatives, like the “cell quickening” company that proclaims on Facebook: “Battering and bruising the body just to treat the symptoms [of] breast cancer is not necessarily the best or only option available to you. You have choices!”\n When I looked at my body after my recent surgery, I wished there was another choice. I would have given just about anything to be on a beach in Mexico. But I’ve witnessed the false promises of these companies. I’ve spoken to someone who flew to that beach clinic, only to return home and discover that her tumor was inoperable. The evidence is clear:  Death rates are much higher for people with cancer who choose alternative therapies instead of standard care.\n Facebook is ubiquitous in many of our lives, and people use the platform to search for health-related support groups and information. So we might assume that Facebook has an ethical stake in keeping its content free of scams and misinformation. But Facebook has an odd history with the term “pseudoscience.” It was only last April that Facebook  removed “pseudoscience” as a keyword from its categories for targeted advertising, and only after the tech publication The Markup  reported that 78 million users were listed in Facebook’s ad portal as having an “interest” in the category.\n Since the pandemic started, there has been  increasing pressure on Facebook to  remove coronavirus-related misinformation. Facebook  pledged that it would add a warning label to Covid-19-related ads and would remove pseudoscience ads that were reported by its users. The problem, which even Facebook  acknowledged, is that pseudoscience content can run for months before being flagged by readers. Facebook’s main ad-screening system is  automated. While we wait for its artificial intelligence system to catch up with the discernment abilities of human reviewers, a steady flow of pseudoscience advertising has already slipped through on a platform with billions of users.\n Could it be that Facebook has gotten too big to adequately regulate its content? That maybe there’s no hope for the change we need? Some advertisers seem to be suggesting this is the case. They are voting with their feet and leaving the platform altogether. Responding to a call by the advocacy group Stop Hate for Profit, advertisers such as Starbucks, Honda, Diageo and Patagonia have  paused their advertising on Facebook as part of a broad boycott over how the platform is handling hate speech and misinformation. This week, Facebook met with representatives from Stop Hate for Profit. In the view of the organizers, the meeting did not go well. “Facebook approached our meeting today like it was nothing more than a PR exercise,”  said one of the organizers, Jessica J. González of Free Press, a nonprofit media advocacy group.\n If Facebook won’t change, what can individuals do? The quickest action is to suspend, delete or even just spend less time on Facebook (and on Instagram, which is owned by Facebook). I’ve decided to join that trend.\n My retreat from Facebook may mean fewer online connections, perhaps at a time when I need them the most. But I’d rather leave than see what another friend with cancer calls the “slap in the face” ads.\n My surgery team didn’t deliver false hope or send me to the beach. They stood under bright lights in a gritty urban hospital to open me up and repair me so I could breathe again. The solutions they offer aren’t simple; I have months of challenges ahead. But throughout this journey, I’ll find support from the people closest to me. Not from Facebook.\n  Anne Borden (  @AgainstCures ) is the executive director of the   Campaign Against Phony Autism Cures , which works for government regulation to stop autism pseudoscience. She is also a consultant to the watchdog group   Bad Science Watch  and the host of “  Noncompliant ,” a podcast about neurodiversity.\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-07-13 06:49:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,广告,医疗,patient", "title": "癌症患者抱怨：我的Facebook Feed里全是“另类医疗”广告", "title_en": "Cancer Patient Complains: My Facebook Feed Is Full of 'Alternative Care' Ads", "transed": 1, "url": "https://www.nytimes.com/2020/07/10/opinion/facebook-cancer-ads.html", "via": "", "real_tags": ["facebook", "广告", "医疗", "patient"]}, {"category": "", "categoryclass": "", "imagename": "59ef07e7edec0b9426960c17c2dc8146.jpg", "infoid": 1011423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着《星际迷航：发现》和《皮卡德》的成功，哥伦比亚广播公司继续扩大其在《星际迷航》宇宙中的放映范围，这一次推出了一部新的动画喜剧系列：《星际迷航：下层甲板》。然而，这部电视剧拥有一个独特的角度：它专注于讲述较低级别剧组成员的故事，典型的《星际迷航》一集的所有重大戏剧性事件都发生在背景中。正如海军少尉贝克特·水手(Tawny Newome，太空部队)在新预告片中所说，我们并不是真正的精英。我们更像是冷酷、斗志旺盛的失败者。这听起来像是“星际迷航”系列，粉丝们可以看。\n这是自1973年至1974年上映的艾美奖获奖影片《星际迷航：动画系列片》(TAS)以来，首部动画片《星际迷航》。这部剧是真人版《星际迷航：原创系列》(TOS)的续集，实际上是第四季，许多原班人马都回来为角色配音。在新引入的角色中，有一个名叫阿雷克斯的三臂三条腿的外星人机组成员，还有一个名叫M&#39；Ress的彩天(一种类似猫的外星人)机组成员。这22集包括TOS著名的“摩擦物的麻烦”一集的续集，在这一集中，这个品种被基因改造为不能繁殖--但代价是它们长得非常大(或者更确切地说，一簇簇的摩擦物能够作为一个整体发挥作用)。在这22集中，人们对它进行了基因改造，使其不能繁殖，但代价是它们长得非常大(或者更确切地说，一簇簇的摩擦物可以作为一个整体发挥作用)。\n“星际迷航：下层甲板”是一种不同的野兽。这是探索频道为期五年的整体协议的一部分，该协议的联合创作者兼节目制作人亚历克斯·库兹曼(Alex Kurtzman)与哥伦比亚广播公司(CBS)签署了扩大特许经营权的协议。库兹曼邀请了里克和莫蒂的主编迈克·麦克马汉来领导这个项目。“迈克用他的第一句话赢得了我们的心：‘我想做一个节目，讲述那些把黄色墨盒放进食物复制器的人，这样香蕉就可以从另一端出来了。’”库兹曼在2018年10月告诉“综艺”杂志。“他的猫叫瑞克。他儿子的名字叫萨根。这个男人是忠心耿耿的。他非常有趣，对“迷航记”的每一集都了如指掌，这就是他的秘诀：他用一颗真正粉丝的纯洁、快乐的心写作。\n库兹曼从一开始就坚定地认为，“星际迷航：下层甲板”不会像里克和莫蒂那样属于限制级影片，尽管它会比塔斯队略微偏向成年人。自3月下旬以来，由于冠状病毒大流行，制作一直在远程进行-这在动画系列中更容易做到。佩尔·麦克马汉说，最大的挑战是找出如何在演员的私人家中用远程设备录制配音演员。\n库兹曼形容“下层甲板”是一封写给“星际迷航”的情书。按照时间顺序，它发生在2002年电影“星际迷航：复仇女神”的事件之后；这个名字是对“星际迷航：下一代”(TNG)其中一集的致敬。根据官方假设，这部时长半小时的新动画喜剧系列聚焦于2380年在星际舰队最不重要的船只之一塞里托斯号(USS Cerritos)上服务的支援船员。水手少尉、博伊姆勒少尉、卢瑟福少尉和坦迪少尉必须跟上他们的职责和社交生活，这通常是在这艘船被众多科幻反常现象震撼的时候。\n纽瑟姆的《水手》在遵守规则方面采取了松懈的方式，这与海军少尉布拉德·博伊姆勒(杰克·奎德，The Boys)的态度形成鲜明对比，后者坚持规则，梦想有一天能成为自己的星际飞船的船长。尤金·科德罗(Tacoma FD饰)为少尉卢瑟福配音，卢瑟福戴着一个机器人植入物，与TNG中的Geordi La Forge有些相似。甲板下的主要船员是海军少尉滕迪(诺埃尔·威尔斯，“无为大师”)，这是医疗舱的新成员。\n演员阵容还包括道恩·刘易斯(Dawnn Lewis，饰演卡罗尔·弗里曼[Carol Freeman])；杰里·O·康奈尔(Jerry O&39；Connell，滑翔机)饰演杰克·兰瑟姆(Jack Ransom)，麦马汉这个角色与TNG的威廉·赖克(William Riker)相比，如果他速度快，羞耻感更小；弗雷德·塔特克里奥雷(弗雷德·塔塔斯克里奥雷，机器鸡，Bojack Horseman)饰演巴霍兰中尉沙克斯；吉莉安·维格曼(Gillian Vigman，Sons&Amp。她的角色是对TAS中M&39；Ress的回归，McMahan形容她是一名好医生，但她是一只令人不快的猫。也有传言称，一些TNG原创角色将客串角色，尽管还没有得到证实。\n预告片的开头，博伊姆勒假装保存着船长的日志，这让水手们很开心。(我真不敢相信你竟然在这上面浪费你的上岸假期。&#34；)我们遇到了坦迪，她对登上塞里托斯号充满了敬畏之情，尽管现实是在她进入医务室的那一秒，安娜递给了她一颗人类的心脏。(#34；我真不敢相信，你竟然在这件事上浪费了你的上岸假期。)我们见到了坦迪，她对登上塞里托斯号充满了敬畏之情。(拿着这个。(别晕倒！！&34；)与此同时，水手得知她被指派去清除全息影像甲板上的废物，而不是有机会探索陌生的新世界，解开太空谜团。她很兴奋能得到这份工作。(注：不要晕倒！)同时，水手得知自己被指派去清除全息甲板垃圾，而不是有机会探索陌生的新世界和解开太空谜团。", "note_en": "With the success of   Star Trek: Discovery and   Picard, CBS continues to expand its offerings within the  Star Trek universe, this time with a new animated comedy series:   Star Trek: Lower Decks.  The series boasts a unique angle: it focuses on telling the stories of the lower-ranking crew members, with all the big dramatic events of a typical  Star Trek episode happening in the background. As Ensign Beckett Mariner (Tawny Newsome,  Space Force) says in the new trailer, &#34;We&#39;re not really elite. We&#39;re more the cool scrappy underdogs.&#34; That sounds like a  Star Trek series the fans can get behind.\n This is the first animated  Star Trek series since the Emmy-award-winning   Star Trek: The Animated Series ( TAS) which ran from 1973-1974. That show served as a sequel to the live action   Star Trek: The Original Series ( TOS)—effectively a fourth season—with many of the original cast members returning to voice the characters. Among the new characters introduced were a three-armed, three-legged alien crew member named Arex, and a Caitian (a cat-like alien) crew member named M&#39;Ress. The 22 episodes included a sequel to the famous &#34; The Trouble with Tribbles&#34; episode from  TOS, in which the breed is genetically altered to not reproduce—with the tradeoff being that they grow extremely large (or rather, clusters of tribbles are able to function as a single whole).\n Star Trek: Lower Decks is a different beast. It&#39;s part of a five-year overall deal  Discovery co-creator and showrunner Alex Kurtzman signed with CBS to expand the franchise. Kurtzman tapped  Rick and Morty head writer Mike McMahan to spearhead the project. “Mike won our hearts with his first sentence: ‘I want to do a show about the people who put the yellow cartridge in the food replicator so a banana can come out the other end,’” Kurtzman  told Variety back in  October 2018. “His cat’s name is Riker. His son’s name is Sagan. The man is committed. He’s brilliantly funny and knows every inch of every  Trek episode, and that’s his secret sauce: he writes with the pure, joyful heart of a true fan.&#34;\n Kurtzman was adamant from the start that  Star Trek: Lower Decks would not be in the same R-rated vein as  Rick and Morty, although it would &#34; skew slight more adult&#34; than  TAS. Since late March, production has been taking place remotely because of the coronavirus pandemic—something that is easier to do on an animated series. The biggest challenge,  per McMahan, was figuring out how to record the voice actors with remote equipment in their private homes.\n    Kurtzman has described  Lower Decks as a &#34;love letter&#34; to  Star Trek. Chronologically, it takes place after the events of the 2002 film  Star Trek: Nemesis; the name is  an homage to an episode of  Star Trek: The Next Generation ( TNG). Per the official premise, the new half-hour animated comedy series &#34;focuses on the support crew serving on one of Starfleet&#39;s least important ships, the U.S.S.  Cerritos, in 2380. Ensigns Mariner, Boimler, Rutherford, and Tendi have to keep up with their duties and their social lives, often while the ship is being rocked by a multitude of sci-fi anomalies.&#34;\n Newsome&#39;s Mariner adopts a lax approach to following the rules, which contrasts sharply with the attitude of Ensign Brad Boimler (Jack Quaid,  The Boys), who is a stickler for the rules and dreams of being captain of his own starship one day. Eugene Cordero ( Tacoma FD) voices Ensign Rutherford, who sports a cyborg implant and bears some resemblance to Geordi La Forge from  TNG. Rounding out the main below-decks crew is Ensign Tendi (Noël Wells,  Master of None), a new addition to the medical bay.\n The cast also includes Dawnn Lewis ( A Different World) as Captain Carol Freeman; Jerry O&#39;Connell ( Sliders) as Jack Ransom, a character  McMahan compared to  TNG&#39;s William Riker &#34;if he was on speed and had less shame&#34;; Fred Tatascriore ( Robot Chicken, Bojack Horseman) as a Bajoran lieutenant named Shaxs; and Gillian Vigman ( Sons &amp; Daughters) as T&#39;Ana, a Caitian doctor who heads the medical bay on board the  Cerritos. Her character is a callback to M&#39;Ress in  TAS,  described by McMahan as &#34;a good doctor, but she&#39;s an unpleasant cat.&#34; There have also been rumors of cameos by a few original  TNG characters, although nothing has been confirmed.\n The trailer opens with Boimler pretending to keep a captain&#39;s log, much to the amusement of Mariner. (&#34;I can&#39;t believe you&#39;re wasting your shore leave on this.&#34;) We meet Tendi, who is overwhelmed with awe at being aboard the  Cerritos, although reality sets in the second she enters sick bay and T&#39;Ana hands her a human heart. (&#34;Hold this. Don&#39;t pass out!&#34;)  Meanwhile, Mariner learns she&#39;s been assigned Holodeck waste removal, rather than having the chance to explore strange new worlds and solve &#34;space mysteries.&#34; She is excited to get to check in out the new shuttle with the blast shield, though. (&#34;It comes down and it goes up, blast shield!&#34;) And it looks like Rutherford, in addition to be a handy mechanic, has some mean fighting skills", "posttime": "2020-07-13 06:28:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,广播公司,drops,星际", "title": "哥伦比亚广播公司发布新动画片“星际迷航：下层甲板”的首支预告片", "title_en": "CBS drops first trailer for new animated series, Star Trek: Lower Decks", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/cbs-drops-first-trailer-for-new-animated-series-star-trek-lower-decks/", "via": "", "real_tags": ["发布", "广播公司", "drops", "星际"]}]