[{"category": "", "categoryclass": "", "imagename": "87a88fc8bbdd35beb04e170d786e2050.jpeg", "infoid": 1028904, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "好了，网民们，我需要你们帮我个忙。这对你们来说不会有多大困难，但除非我们共同努力，否则我们不能解决这个问题。\n问题是：你们都破坏了互联网上的评分和评论系统。\n当然，审查和评级机制已经启动并运行；他们正在做自己的工作，列出人们点击的明星数量，并或多或少地确保他们不能投票两次。从技术上讲，评级系统本身没有问题。问题是我们如何使用它们。十分之十或者五分之五的星级已经不再有任何意义了。\n听着，别这么快就放弃我。通过示例场景可以更好地解释这一点。让我们想象一下，我们正在尝试寻找一款新的视频游戏来玩。\n当我们永远困在家里的时候，我们有一些时间可以消磨时间(没有出路！没有出路！)。我们已经受够了玩“死亡空间”。«我们可以上网阅读最近一两个月发布的每一款游戏的评论，但这要花很长时间。相反，对我们来说，更明智的做法是根据简单的评级标准剔除一些游戏-1-5或1-10星，或者1/10或1/100；无论有什么数字或图形系统。从那里，我们可以选择一些看起来很有前途的，并投入时间来听取人们实际上对他们的看法。\n我们滚动浏览游戏列表，立即开始遇到一些问题。这似乎发生了一些奇怪的事情，视频游戏的宇宙现在只有一些令人难以置信的游戏，人们认为这些游戏满分是9-10分，而糟糕的游戏得到了0-2分。这里发生了什么事？\n视频游戏怎么可能是十分之一的完美，或者十分之一的“有史以来最糟糕的事情”呢？亚马逊产品、Netflix电影或应用程序商店上的应用程序评级也是如此。\n仅仅根据评分和审查系统上的数字，人们就会得出结论，我们生活在一个事情要么很棒，要么很可怕的世界里。²没有什么只是“好”、“好”或“好”，这是令人担忧的，因为这意味着我们无法区分哪些东西比其他东西更好。是每个人都真的喜欢“红死队3”，还是他们真的喜欢它？这真的是他们玩过的10/10最好的游戏吗--因为考虑到他们的回顾历史显示，他们玩过的许多其他游戏也是10/10，这是很难相信的。当然，每一场比赛都不可能是你玩过的最好的比赛？\n现在，我听到你在想什么了。“达科达，你这个自命不凡、吹毛求疵、书生气十足、笨蛋的家伙，跟上程序就行了。”如果你喜欢它，你给它所有的星，如果你不喜欢它，你给它尽可能少的星。太简单了！“。\n不过，这不管用。如果您使用的系统具有5度或10度的好坏程度，那么只使用其中两个选项就会破坏其有用性。它把一切都变成了在好和坏之间的二元选择，没有任何迹象表明哪些好的东西比其他任何东西更好，哪些坏的东西比其他任何东西都差。\n这与教育中真正令人遗憾的分数膨胀趋势相似。“C”级没什么好尴尬的--它的字面意思是你和其他人一样做得很好，不是特别的，也不是糟糕的。尽管社会有不同的想法，但由于某种原因，C变成了一个“差”分。在人们的心目中，评分制度从最高的A和最低的F降低到只有A或F。\n这导致了这样一个世界，在这个世界里，全优学生并不是超级天才，他们只是做足了功课的人。如果你交上好的试卷，做完所有的家庭作业，然后出现在课堂上，那么，只要你期中和期末考试得90%的成绩，你很可能会以A的成绩脱颖而出。\n那么，我们如何确定哪些学生非常聪明呢？如果一篇关于亚伯拉罕·林肯的可接受的论文得了A，但一篇分析将林肯描绘成平等捍卫者的荒谬的现象研究论文也得到了A，那么怎么可能有人能区分“良好”和“特殊”呢？\n这在今天的在线收视率中有所体现，而且同样存在问题。如果我买了两副耳机来测试一下，那么几乎可以肯定的是，我会更喜欢其中的一副。给他们两个五星级并不能开始将这一信息传达给其他寻求推荐的买家。所有这些都告诉人们，这两副耳机都可以工作，因为如果他们不工作，他们会得到一颗星，但它没有说明哪一副听起来更好，哪一副更舒服，等等。\n以这种方式给出评级有两种看待人性的方式：\n2)人们本质上是善良的，不想伤害任何人的感情。\n很长一段时间以来，我不得不承认我认为1号才是问题所在。不过，多年来我一直在思考这个问题，我得出的结论是，实际上，它可能比其他任何东西都更有可能排在第二位。每个人都意识到星级评分在某种程度上没有太大帮助，他们只是不想刻薄-尽管我承认，考虑到网络刻薄或多或少是网络文化的主要组成部分，这种情绪对我来说似乎非常奇怪。\n解决这个问题的方法是，我们所有人都将不得不认真审视自己，承认一些大忌：只做…是完全可以接受的。好吧。\n我再说一遍：我们需要接受这样一个事实，那就是没事。\n这不是一个流行的说法，但是我们不可能在任何时候都是最好的。同样地，也不是每本书、电子游戏、电影、T恤、卷笔刀、亚马逊卖的其他任何东西都是最好的。\n相反，请允许我花几分钟来解释我们应该如何在互联网上对事情进行评级和审查，因为如果我们所有人都能共同努力，我们都会受益。想一想，能够从这些指标中收集有用的信息是多么有用，而不是仅仅用它们来衡量某个东西是否值得购买(4.5到5星)，或者它是否肯定是一种欺骗性产品，会折磨你的宠物，让你长粉刺(任何低于4.5星的东西)。\n选择如何打分的心态应该是回顾和同期审查的心态。换句话说，你在消费或使用产品之前和之后是怎么想的？\n当买东西或选择要看的电影或要听的歌曲时，理想情况下，人们应该对自己期待的东西有一个想法。对于这件商品，以这个价格，根据我对它的描述和听说的情况，会有什么可以接受的结果呢？\n让我们以一副耳机为例，因为这也说明了我所建议的方法如何与个人品味等主观因素很好地配合。当我在网上购物时，我会看看价格、功能和所有的好东西，我会根据我花了多少钱，以及它们是什么类型(过耳式、入耳式、运动型等)，对我期望的音频听起来有多“好”有一些模糊的想法。这一预期是我将用来决定我的评级的基线。\n当耳机送来时，我会插上电源，开始听一些音频。可能的结果有三个原型：³。\n如果我们使用三星评级系统，或者如果数字选项是数字1、2或3，那么我们也已经获得了可能的评级。如果他们比我预期的更糟，他们就会得到一个。如果他们是我预期的那样，他们会得到2分，如果他们比我预期的要好一些，我认为值得一提的是，那么他们就会得到3分。\n这意味着，当我给出我的评级时，人们可以从中学到东西。诚然，我对一副特定价格的耳机的期望，与其他人对该价格的期望可能略有不同。一些人想要更强的低音，另一些人对响应时间更感兴趣，等等。不过，在平均大量评论的情况下，随着时间的推移，这一点会自动解决：普遍的共识是，耳机的质量是与大多数人的预期一样好，还是更好，还是更差。\n然而，如果我们按照最常用的方式使用评级，我可能会给耳机打三颗星，即使它们只在我预期的质量范围内。我不想伤害卖家的感情，也不想因为只给他们两颗星而让他们难堪！\n但是，这再次迫使我们问这个问题：两颗星有什么问题？两颗星的意思是耳机没问题。你买的东西都拿到手了。如果我们不认为三星评级意味着耳机要么是好的，要么是特别的，我们可以假设，如果大多数人给它们三星评级，它们实际上是非常物有所值的，这不是很棒吗？那就更有信息量了！人们可以从这些信息中寻找最好的产品，而不是所有可以接受或更好的产品，永远不知道它们属于哪个级别。\n我们可以把这个范围扩大得更远。普通的五星级评级系统给了我们另一种程度的帮助。以下是可能发生的情况的新选择：\n这甚至比三星系统更能提供信息，因为现在我可以表达出事情是好是坏的一定程度，而不仅仅是它们是更好还是更坏。它为正在寻找产品的人提供了更多的数据，因为现在他们可以在很小程度上看到人们喜欢或不喜欢某样东西的程度。\n这是我们需要进行评级的方式，也是评级系统应该如何运作的方式。在统计学上，有一个概念叫做钟形曲线，其想法是，如果你对事物进行大量的抽样，你应该得到一条看起来像倒铃的曲线。最常见的事情在中间结束，而更高或更低(更好或更坏)的事情发生的频率较低，分别发生在中心的右边或左边。\n得A应该不是经常发生的事情，因为它意味着某人做了比平均水平好得多的事情。A、B应该更多地出现，但仍然不是那么普遍，因为它意味着一个人比大多数人做得更好。不过，大多数人应该得到一个C，因为大体上说，大多数人的表现与其他人大致相同。\n得到C没有什么错，在Metacritic上得到3星(满分5星)、5分(满分10分)或50分(满分100分)应该没有什么错。这些评级意味着该产品表现良好。还可以。它起作用了，它做了它应该做的事情，或者它给你带来了娱乐，但它不是你会写下狂热评论的东西。就是…。很好，这没什么不对的。\n我们应该努力使用评级系统来沟通项目的质量，而不是试图强化消极的想法，即一切都应该是例外的，否则就是失败的。\n等一下！我听到你在喊叫。你得考虑一下平均数！\n我想过平均数，但这样用起来没什么用处。似乎1000人喜欢并给出5星，1000人不喜欢并给出1星的产品平均会被评为3星，这是完全正确的。这就是难题所在。\n五星级评论中有多少来自绝对喜欢该产品的人？有多少人认为那只是我？一星级的评论家是不喜欢这个产品，还是它来了DOA，或者着火了，或者引起了过敏反应？\n有人可能会认为，这个问题的答案是阅读措辞严谨的评论，但拜托，你不可能是认真的。撇开书评的整体质量不谈，人们偏向书评的问题十分突出。与喜欢某一产品的人相比，讨厌某一产品的人更有可能出于怨恨而写一篇严厉的、可能具有误导性的评论。当你喜欢一种产品时，你宁愿花时间使用它，也不愿上网为一家有能力支付费用的公司提供免费广告服务。当你甚至对一件产品感到些许不安或失望时，没有什么比点击在线并写下它有多糟糕更令人愉快的了。\n在统计学中，数据点的分布很重要。在在线产品评级的情况下，这一点也是如此。重要的是要知道有多少五星级评价者真的被这款产品惊呆了，有多少人只是感到惊喜，有多少人只是点击了五星级评级，因为这表明它是以应有的方式启动和工作的。一星级收视率也是如此。\n如果某件事非常糟糕，那么一星的数量应该很多，但如果只是一种糟糕的情况，那么二星应该更常见。一星级评级比二星级评级更能拖累平均数跌破三星级。五星评级比四星评级更能将平均数提高到三星以上。“怪物史莱克2”真的值五星级吗，还是更像是四星级？\n考虑这一问题的另一种方式是列出清单。如果我让你给我列一张你认为人们需要看的十大电影的清单，你可能不会有太多麻烦。如果我问你其他好电影的清单，你大概可以再草草写下50部左右。如果我让你给我一张不错的、有娱乐性的电影清单，那么你也许可以开始写一段时间，而不需要做太多的思考，除了它们是否会引发糟糕的记忆。\n糟糕的电影也是如此。大多数人可以很容易地列出他们看过的10部最糟糕的电影，还可以再增加几十部糟糕但并不令人震惊的电影。\n但是如果我给你一张清单，列出你评过五星的每一部电影，并请你解释一下，会怎么样？你真的认为恐怖电影和银翼杀手是同一级别的吗？说真的，一个外星人坠毁在你的后院，当她在等待星际拖车出现的时候，她想要低调行事，Netflix，并冷静下来。⁴她想看看地球电影是什么样子的。\n好的，太好了。你会调出你的亚马逊五星级评论名单，让她随机挑选一个吗？几乎可以肯定不会。你不会仅仅因为偶然的机会就想展示她的香肠盛宴，而不是水库狗！\n这应该是五星评级的标准：你认为它是电影、音乐、文学或任何其他形式的产品的杰出典范吗？相反，一星级评级应该保留给那些非常糟糕的事情，它们会留下持久的记忆。一星级应该是你在聚会上讲的轶事；可怕的是，你买了一个烤面包机，它不知何故袭击了你的狗。\n不过，我的呼吁有一个问题，我们应该解决这个问题：在这一点上，这是一个根深蒂固的标准。这并不容易克服。\n即使迅速增加的用户明白了我的观点，悔过并改正他们的错误方式，也会有一段时间两个相互竞争的标准在起作用，平衡正确做事的好处。\n更糟糕的是：即使每个人都能在一夜之间魔术般地开始正确地进行在线评分，我们也会陷入一大堆根据旧制度进行评级的事情的积压目录中。看着一双新运动鞋的收视率，人们会想，这四颗星是否表明大多数人感到惊喜，或者认为这双鞋可以接受(或更好)的人比不喜欢它(或更糟)的人略多。\n那个…。是我不确定该如何解决的问题，但我想我有一个解决方案：\n就目前情况而言，在线评级没有太大帮助。它们没有提供太多信息，因为它们没有按照预期的方式使用。这就是我们现在的基线，所以如果我们作为一个互联网社区开始共同努力，对事情进行适当的评级，并将三星是好的这一想法正常化，实际上，那么我们就会改善事情。\n从本质上说，评级系统不可能真的比现在更少的信息，所以虽然改变我们的行为可能不会立即解决所有的问题，但它不会让事情变得更糟。在此期间，我们将朝着更美好的未来而努力。\n所以，我恳求你们，网络同志们：请适当使用收视率。当你这么做的时候，我们都会过得更好。\n»死亡空间是一款非常棒的游戏，我爱死它了。它有很好的重放价值，但大约每年只有一次。\n³从技术上讲，我们可以把它压缩下来，然后说只有两种可能的结果：音频是或不是我预期的，然后我们可以从那里决定它是更好还是更差，如果它不是我预期的情况。然而，该机制不足以传达任何有用的信息，因此我们将采用三种可能的通用结果。", "note_en": "Okay denizens of the internet, I need you to do me a favor. It won’t take much on your part, but we can’t solve this problem unless we work together.\n The thing is: y’all broke the rating and review systems on the internet.\n Sure, reviews and ratings mechanisms are up and running;  they’re doing their job in tabulating the number of stars people click and more or less making sure that they can’t vote twice. Technically speaking, there’s nothing wrong with the rating systems themselves. The problem is how we’re using them. 10/10 or five stars out of five doesn’t  mean anything anymore.\n Look, don’t give up on me just yet. This is better explained by going through an example scenario. Let’s imagine that we’re trying to find a new video game to play.\n We’ve got some time to kill while we’re stuck here in our homes for the rest of eternity (No way out! No way out!) and we’ve just about had it with playing through Dead Space.¹ We could go online and start reading the reviews for every game that’s come out in the last month or two, but thats’ going to take  forever. Instead, it would be smarter for us to weed out some games based on the simple metric of how they were rated — 1–5 or 1–10 stars, or 1/10 or 1/100; whatever numerical or graphical system there is. From there we can choose a few that look promising and invest the time in hearing what people actually have to say about them.\n We scroll through the list of games and immediately start to run into a bit of a problem though. It seems like something weird has happened and the universe of video games is now populated only by incredible titles that people think are 9–10 out of 10, and atrocious ones that get 0–2 points. What’s going on here?\n How is it possible that video games are either 10/10 perfect, or 1/10 “worst thing ever”? The same is true of Amazon products, or Netflix movies, or app ratings on the app stores.\n Just going by the numbers available on rating and review systems, one would have to conclude that we live in a world where things are either terrific or horrible.² Nothing is just “good” or “okay” or “fine” anymore, and that’s troubling because it means we have no way of telling which things are better than the others. Did everyone really really like Red Dead 3, or did they really really  really like it? Was it truly 10/10 best game they’ve ever played — because that would be difficult to believe considering their review history shows that a lot of other games they’ve played got 10/10 too. Surely every game can’t be the best game you’ve ever played?\n Now, at this point I hear what you’re thinking. “Dacoda, you pretentious, nit-picking, pedantic, nincompoop; just get with the program. If you like it you give it all the stars, if you don’t like it you give it as few stars as possible. It’s so easy!”\n That doesn’t work though. If you’re using a system with 5 or 10 degrees of good-vs-badness then only making use of two of the options destroys its usefulness. It turns everything into a binary choice between  GOOD or  BAD, with no indication of which good things are  BETTER or which bad things are  WORSE than any of the others.\n This is similar to the really unfortunate trend of grade inflation in education. A “C” grade is nothing to be embarrassed about — it literally means that you’ve done as well as just about everybody else, not exceptional, and not terrible. Society had different ideas though and for some reason a C became a “bad” grade. In people’s minds the grading system was reduced from A at the top and F at the bottom, to merely A or F.\n What this has led to is a world where a straight-A student isn’t a super-genius, they’re just someone who’s done their work adequately. If you turn in good papers and do all your homework and show up to class then, as long as you also get 90% on the midterm and final exams, you’ll probably walk away with an A.\n How then do we determine which students were like, wildly intelligent? If an acceptable paper on Abraham Lincoln gets an A, but a phenomenally researched paper analyzing the absurdity of painting Lincoln as a champion of equality also gets an A, how is anyone supposed to distinguish between “fine” and “exceptional”?\n This plays out in online ratings today and it’s equally problematic. If I buy two pairs of headphones to test them out then it’s almost guaranteed I’m going to like one of them more than the other. Giving both of them five stars doesn’t begin to convey that information to other purchasers who are seeking a recommendation. All this tells people is that both pairs of headphones work, because if they didn’t they’d get one star, but it doesn’t say which pair sounds better, is more comfortable, etc.\n There are two ways of looking at humanity for giving out ratings in this way:\n  2) People are fundamentally good and don’t want to hurt anybody else’s feelings.\n For a long time, I have to admit that I thought #1 was the problem. As I’ve pondered it more over the years though, I’ve come to conclude that, actually, it’s probably more #2 than anything else. Everyone realizes that the star ratings aren’t that helpful on some level, they just don’t want to be mean — although I will admit that sentiment seems very strange to me considering that being mean online is more or less a major part of internet culture.\n The way to resolve this problem is that we’re all going to have to take a hard look at ourselves and admit something that is a major taboo: it’s perfectly acceptable to be just … okay.\n I’ll say that again: we need to accept that it is alright to be  okay.\n It’s not a popular thing to say, but we can’t all be the best at everything all the time. In the same way, not every book, video game, movie, T-shirt, pencil-sharpener, whatever-else-Amazon-sells, etc. can be the best of all time either.\n Instead, please allow me to take a few minutes to explain how we should be rating and reviewing things on the internet, because if we can all work together to make this happen, we will all benefit. Think of how useful it will be to be able to glean useful information from those metrics, instead of just using them as a gauge of whether something might be worth buying (4.5 to 5 stars) or whether it’s definitely a scam product that will torture your pets and give you acne (anything less than 4.5 stars).\n  The mindset when choosing how to rate an item should be one of retrospective as well as contemporaneous examination. To put it another way, what did you think before and after consuming or using the product?\n When shopping for a thing or selecting a movie to watch or song to listen to, one should ideally have an idea of what they are expecting. For this item, at this price, and given what I know about it from its description and things I’ve heard, what would would be an acceptable outcome?\n Let’s take the example of a pair of headphones, because this also illustrates how the approach I’m suggesting works well with subjective things like personal taste as well. When shopping online I’m going to be looking at the prices and the features and all that good stuff and I’m going to have some vague idea of how “good” I expect audio to sound based on both how much I’m paying for them, and what sort they are (over-the-ear, in-ear, sport, etc.). That expectation is the baseline that I will use to decide on my rating.\n When the headphones come, I’ll plug them in and start listening to some audio. There are three archetypes for the possible outcomes:³\n    If we are using a three-star rating system, or if the numerical options are the numbers 1, 2, or 3, then we’ve also already got our possible ratings. If they’re worse than I was expecting then they get a one. If they were what I expected, they get a two, and if they were better than I expected by some amount that I think is worth mentioning then they get a three.\n What this means is that when I give my rating out people can learn things from it. True, what I expect of a pair of headphones at a particular price versus what others expect of them at that price are likely slightly different. Some people want stronger bass, others are more interested in response times, etc. This works itself out over time when averaging over a large number of reviews though: the general consensus will be whether the headphones are as good as, better, or worse than what the majority of people expected.\n However, if we use ratings the way they seem to be most commonly used, I would presumably give the headphones three stars even if they only fell within the range of quality that I’d been expecting. I don’t want to hurt the seller’s feelings or make them look bad by giving them only two stars!\n But again, that forces us to ask the question: what’s wrong with two stars? The meaning of two stars is that the headphones are fine. You got what you paid for. Wouldn’t it be terrific if instead of thinking that a three-star rating meant that the headphones will either be fine or exceptional, we could assume that if most people give them a three-star rating they’re actually great value for your money? That’s more informative! From that information people can look for the best products, rather than all products which are acceptable  or better, never knowing where they fall on that scale.\n We can expand this even more. The common 5-star rating system gives us another degree of helpfulness. Here are the new options for what could happen:\n      This is even more informative than the three-star system because now I can express a certain amount of  how much better or worse things are, rather than just whether they were better or worse. It provides a lot more data for people who are looking for a product because now they can see, to a small degree, how much people like or dislike something.\n  This is how we need to go about rating things, and it’s how rating systems are supposed to work. In statistics there is a  concept known as a bell-curve and the idea is that if you take a lot of samples of things, you should wind up with a curve that looks like an inverted bell. Things that were the most common wind up in the middle, and things that were higher or lower (better or worse) happen less frequently and to the right or left, respectively, of the center.\n Getting an A should be something that happens not very frequently, because it’s meant to represent someone doing something much better than average. A B should happen more often, but still not that common, because it’s meant to show that a person did better than most. Most people should get a C though, because most people perform about the same as others, broadly speaking.\n There is nothing wrong with getting a C, and there shouldn’t be anything wrong with getting a 3 out of 5 star rating, or a 5 out of 10 score, or 50 out of 100 on Metacritic. Those ratings mean that the product performed fine. It was okay. It worked and it did what it was supposed to, or it entertained you but it isn’t something you’d write a rave review about. It’s just …  fine, and there’s nothing wrong with that.\n We should be working to communicate the quality of items using rating systems, rather than trying to reinforce the negative idea that everything ought to be exceptional or else it’s a failure.\n  Hold on a second! I hear you shout.  You’ve got to think about the averages!\n I have thought about the averages, but they aren’t helpful when they’re used like this. It seems as though a product which 1,000 people liked and rated 5 stars and 1,000 people disliked and rated 1 star would average out to a 3 star rating, and that’s perfectly true. Therein lies the conundrum.\n How many of the 5-star reviews were from people who absolutely loved the product? How many thought it was just meh? Did the 1-star reviewers dislike the product, or did it come DOA, or catch fire, or cause an allergic reaction?\n One might think that the answer to that problem is to read the worded reviews but come on, you can’t be serious. The overall quality of written reviews aside, there’s the glaring problem of people’s bias towards writing reviews. People who hated a product are much more likely to write a scathing and potentially misleading review out of spite than people who loved something. When you love a product you would rather spend time using it than going online to provide free advertising services to a company that can afford to pay for them. When you’re even slightly upset or disappointed by a product there’s nothing more enjoyable than clicking online and writing about how terrible it is.\n In statistics, distribution of data points is important. In the case of online product ratings, this is equally true. It’s essential to know how many of the five-star raters were truly blown away by the product versus how many were just pleasantly surprised, and how many only clicked the five-star rating because that’s what indicates that it turns on and works the way it’s supposed to. The same is true of the one-star ratings.\n If something is phenomenally bad, then the one-stars should be large in number, but if it’s just kind of bad, then the two-stars should be more common. A one-star rating drags the average down below three-stars more than a two-star rating does. A five-star rating raises the average up above three-stars more than a four-star rating does. Was Shrek 2  really worth five stars, or was it more of a four?\n Another way of thinking about this is in terms of making lists. If I asked you to make me a list of the top ten movies you think people need to watch, you probably wouldn’t have too much trouble. If I asked you for a list of other good movies you could probably jot down another 50 or so. If I asked you to give me a list of movies that are just alright and entertaining then you could probably just start writing away for a while without having to do too much thinking other than whether they trigger bad memories or not.\n The same is true of bad movies. Most people could easily give a list of the 10 worst movies they’ve ever seen, and could add to that list a few dozen more which are bad but not appalling.\n But what if I came to you with a list of every movie you’ve rated five stars and asked you to explain yourself. You honestly think Scary Movie and Bladerunner are on the same level? Like, seriously; an alien crash-lands in your back yard and while she’s waiting for the intergalactic tow-truck to show up she wants to lay low, Netflix, and chill.⁴ She wants to see what Earth cinema is like.\n Alright great. Do you pull up your five-star Amazon reviews list and let her pick one at random? Almost certainly not. You don’t want to be showing her Sausagefest instead of Reservoir Dogs just because of chance!\n That should be the criteria for five-star ratings: is it something that you consider an outstanding example of film, music, literature, or any other form of product? Contrariwise, one-star ratings should be reserved for things that are so bad, they will leave a lasting memory. A one-star rating should be something you tell anecdotes about at parties; that horrible time you bought a toaster-oven and it somehow managed to assault your dog.\n  There is a hiccough to my appeal, though, and we should address that: this is an entrenched standard at this point. That’s not going to be easy to overcome.\n Even if a rapidly increasing number of users see the light of my argument, repent, and mend their erring ways, there will be a period of time where two competing standards are at work, counterbalancing the benefits of doing things properly.\n Worse: even if everyone were to start doing their online rating correctly overnight by magic, we’d be stuck with a huge back-catalogue of things that were rated according to the old regime. One would be left looking at the ratings for a new pair of sneakers and wondering whether the four stars indicates that most people are pleasantly surprised, or that moderately more people found the shoe acceptable (or better) than people who disliked it (or worse).\n That … is something I’m not sure how to grapple with, but I think I’ve got a solution:\n As it stands, online ratings are not very helpful. They don’t give much information because they aren’t being used in the way that they were intended. That’s the baseline we’re at right now, so if we begin to work together as an internet community to rate things properly, and normalize the idea that three-stars out of five is good, actually, then we’ll be improving things.\n In essence, ratings systems can’t really get any less informative than they are right now, so while changing our behaviors might not immediately solve all the problems, it won’t make anything worse. We’d be working towards a better future in the meantime.\n So, this I implore you, internet comrades: please use ratings appropriately. When you do, we’re  all better off.\n  ¹ Dead Space is a terrific game and I love it to death. It has wonderful replay value but only about once per year.\n  ³ Technically speaking we could compress this down and say that there are only two possible outcomes: audio is or is not what I expected, and then from there we could decide whether it was better or worse in the case of it not being what I expected. However, that regime is not adequate for conveying any useful information so we’re going with three possible generic outcomes.", "posttime": "2020-10-15 05:42:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "评分,ruined,评级", "title": "你毁了在线评分", "title_en": "You've Ruined Online Ratings", "transed": 1, "url": "https://dacodanelson.medium.com/youve-ruined-online-ratings-768e2a708c3b", "via": "", "real_tags": ["评分", "ruined", "评级"]}, {"category": "", "categoryclass": "", "imagename": "4de1487c308f0bb710044114d565ef6a.jpg", "infoid": 1028903, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，Twitter和Facebook都采取措施，进一步限制“纽约邮报”(New York Post)一篇关于亨特·拜登(Hunter Biden)的报道的传播，这篇报道引发了人们对其来源的质疑。\n周三早上发布的这篇报道包括关于民主党总统候选人乔·拜登·特朗普在集会上呼吁郊区女性的指控：你能喜欢我吗？支持特朗普的竞选广告使用来自俄罗斯的库存镜头，白俄罗斯·哈里斯在盘问巴雷特的同时就堕胎权发出警告，以及乌克兰-据报道，这封电子邮件是从2019年4月投放在特拉华州一家电脑维修店的笔记本电脑硬盘上取回的。\n据报道，一位不愿透露姓名的店主向特朗普的私人律师鲁迪·朱利安尼·萨沙·巴伦·科恩提供了硬盘的副本，据报道，这名店主无法辨认出是谁送来的电脑。与此同时，波拉特·科恩也加入了推特，嘲笑特朗普周日的节目预告片：特朗普，共和党高层从新冠肺炎那里恢复过来；朱利安尼表示，他正在服用羟基氯喹，尽管在联邦调查局查封之前，对新冠肺炎的检测结果更多为阴性，但他仍在服用羟基氯喹。\nTwitter周三采取行动，禁止用户在推文或直接消息中分享该故事的链接。\nTwitter的一位发言人告诉国会山，这一决定是基于该平台的黑客材料政策做出的。\n今年夏天也实施了同样的政策，禁止链接到名为“蓝色泄密”(BlueLeaks)的大量被黑客窃取的警方文件。\n根据这项政策，讨论黑客行为“包括报道黑客行为，或分享媒体对黑客行为的报道”并不违反规则。\n推特发言人没有立即回应为什么邮报的报道没有包括在这一豁免范围内的问题。\n这位发言人还指出，故事的聚合不会受到禁令的影响。\n周三，拜登的竞选团队对“华盛顿邮报”的报道做出了回应，称大量调查都得出结论，这位前副总统“在乌克兰问题上没有不当行为”，并表示他在任期间的官方日程安排证明了“华盛顿邮报”报道的一个关键方面是错误的。\nFacebook也采取了行动限制这篇文章的传播，但几乎没有提供有关这些步骤的细节。\n“虽然我故意不会链接到”纽约邮报“，但我想澄清的是，这篇报道有资格接受Facebook的第三方事实核查合作伙伴的事实核查。与此同时，我们正在减少它在我们平台上的分发，“政策沟通经理Andy Stone在推特上写道。\nFacebook最近宣布了一项针对病毒式错误信息的政策，该政策规定，在包括美国在内的许多国家，如果我们收到一条内容是虚假的信号，我们会暂时减少其分发，等待第三方事实核查人员的审查。\n根据Facebook旗下Crowdtangle的数据，尽管Facebook进行了干预，但“华盛顿邮报”的链接在该平台上已经收到了超过24.5万次互动。\n目前尚不清楚Facebook是否会限制聚合《华盛顿邮报》故事的文章的覆盖范围。\n周三，这位参议员给Facebook发了一封信，要求对限制这篇文章传播的举措做出解释。", "note_en": "Twitter and Facebook both took steps Wednesday to limit the spread of a New York Post story about  Hunter Biden that has sparked questions about its sourcing.\n The  story published Wednesday morning includes allegations regarding Democratic presidential nominee   Joe Biden      Trump makes appeal to suburban women at rally: &#39;Will you please like me?&#39;  Pro-Trump campaign ad uses stock footage from Russia, Belarus  Harris raises alarm on abortion rights while grilling Barrett  MORE  and Ukraine that hinge on an email reportedly retrieved from the hard drive of a laptop dropped off at a computer repair shop in Delaware in April 2019.\n An unnamed store owner, who reportedly could not identify the individual who dropped off the computer, is said to have provided a copy of the hard drive to Trump&#39;s personal lawyer   Rudy Giuliani      Sacha Baron Cohen joins Twitter as Borat to mock Trump  Sunday shows preview: Trump, top Republicans recover from COVID-19; stimulus bill remains in limbo  Giuliani says he&#39;s taking hydroxychloroquine despite testing negative for COVID-19  MORE  before it was seized by the FBI.\n  Twitter took action on Wednesday by preventing users from sharing links to the story in tweets or direct messages.\n The decision was made based on the platform’s hacked materials policy, a spokesperson for Twitter told The Hill.\n The same policy was implemented over the summer to ban links to a trove of hacked police documents called “BlueLeaks.”\n According to the policy, discussion of hacks “including reporting on a hack, or sharing press coverage of hacking” does not violate the rules.\n The Twitter spokesperson did not immediately respond to questions about why the Post’s reporting is not included under that exemption.\n The spokesperson noted that aggregations of the story will not be affected by the ban.\n  Biden’s campaign responded to the Post story on Wednesday by saying numerous investigations have all concluded there was “no wrongdoing&#34; by the former vice president regarding Ukraine, and said his official schedules from his time in office disprove a key aspect of the Post story.\n Facebook also took action to limit the article’s spread but offered few details regarding those steps.\n “While I will intentionally not link to the New York Post, I want be clear that this story is eligible to be fact checked by Facebook’s third-party fact checking partners. In the meantime, we are reducing its distribution on our platform,” policy communications manager Andy Stone tweeted.\n Facebook recently announced a policy on viral misinformation which says that &#34;in many countries, including in the U.S., if we have signals that a piece of content is false, we temporarily reduce its distribution pending review by a third-party fact-checker.&#34;\n  According to data from Crowdtangle, which is owned by Facebook, the link to the Post story has received more than 245,000 interactions on the platform despite Facebook&#39;s intervention.\n It is unclear if Facebook will restrict the reach of articles that aggregate the Post story.\n   The senator sent a letter to Facebook on Wednesday asking for an explanation of the move to limit the article&#39;s spread.", "posttime": "2020-10-15 05:42:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,报道", "title": "Twitter，Facebook取缔《纽约邮报》关于亨特·拜登的文章", "title_en": "Twitter, Facebook clamp down on New York Post article about Hunter Biden", "transed": 1, "url": "https://thehill.com/policy/technology/521072-twitter-facebook-clamp-down-on-new-york-post-article-about-hunter-biden", "via": "", "real_tags": ["facebook", "报道"]}, {"category": "", "categoryclass": "", "imagename": "a4960d882e3135d59003a233452795e7.jpg", "infoid": 1028901, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌和英特尔警告说，除了最新版本的Linux内核之外，所有版本的Linux内核都存在严重的蓝牙缺陷。虽然谷歌的一名研究人员表示，该漏洞允许攻击者在蓝牙范围内无缝执行代码，但英特尔将该漏洞描述为提供权限升级或信息泄露。\n该漏洞存在于Bluez中，该软件堆栈默认实现Linux的所有蓝牙核心协议和层。除了Linux笔记本电脑，它还用于许多消费或工业物联网设备。它适用于Linux版本2.4.6及更高版本。\n到目前为止，人们对BleedingTooth知之甚少，这是谷歌工程师Andy Nguyen给出的名字，他说“很快”就会发表一篇博客文章。Twitter线程和YouTube视频提供了最详细的信息，给人的印象是该漏洞为附近的攻击者提供了一种可靠的方式，可以在使用Bluez for Bluetooth的易受攻击的Linux设备上执行他们选择的恶意代码。\n研究人员写道：“BleedingTooth是Linux蓝牙子系统中的一组零点击漏洞，可让短距离内未经验证的远程攻击者以内核权限在易受攻击的设备上执行任意代码。”他说，他的发现受到了导致BlueBorne的研究的启发，BlueBorne是另一个概念验证漏洞，允许攻击者发送他们选择的命令，而不需要设备用户单击任何链接，连接到流氓蓝牙设备，或者采取除打开蓝牙之外的任何其他操作。\nBleedingTooth是Linux蓝牙子系统中的一组零单击漏洞，可让短距离内未经验证的远程攻击者在易受攻击的设备上使用内核权限执行任意代码。\n--Andy Nguyen(@theflow0)2020年10月13日。\n与此同时，英特尔发布了这一基本建议，将该漏洞归类为特权提升或信息泄露漏洞。该咨询给CVE-2020-12351打了8.3分(满分10分)的严重程度评分，这是构成BleedingTooth的三个不同漏洞之一。\n“Bluez中的潜在安全漏洞可能允许权限提升或信息泄露，”该咨询声明称。“Bluez正在发布Linux内核修补程序来解决这些潜在的漏洞。”\n英特尔是Bluez开源项目的主要贡献者，该公司表示，修补漏洞的最有效方法是更新到周日发布的Linux内核5.9版。那些不能升级到版本5.9的用户可以安装一系列的内核补丁，这些补丁提供了咨询链接。Bluez的维护人员没有立即回复询问有关此漏洞的更多详细信息的电子邮件。", "note_en": "Google and Intel are warning of a high-severity Bluetooth flaw in all but the most recent version of the Linux Kernel. While a Google researcher said the bug allows seamless code execution by attackers within Bluetooth range, Intel is characterizing the flaw as providing an escalation of privileges or the disclosure of information.\n The flaw resides in BlueZ, the software stack that by default implements all Bluetooth core protocols and layers for Linux. Besides Linux laptops, it&#39;s used in many consumer or industrial Internet-of-things devices. It works with Linux versions 2.4.6 and later.\n  So far, little is known about BleedingTooth, the name given by Google engineer Andy Nguyen, who said that a blog post will be published “soon.” A  Twitter thread and a  YouTube video provide the most detail and give the impression that the bug provides a reliable way for nearby attackers to execute malicious code of their choice on vulnerable Linux devices that use BlueZ for Bluetooth.\n “BleedingTooth is a set of zero-click vulnerabilities in the Linux Bluetooth subsystem that can allow an unauthenticated remote attacker in short distance to execute arbitrary code with kernel privileges on vulnerable devices,” the researcher  wrote. He said his discovery was inspired by research that led to BlueBorne, another proof-of-concept exploit that allowed attackers to  send commands of their choice without requiring device users click any links, connect to a rogue Bluetooth device, or take any other action short of having Bluetooth turned on.\n BleedingTooth is a set of zero-click vulnerabilities in the Linux Bluetooth subsystem that can allow an unauthenticated remote attacker in short distance to execute arbitrary code with kernel privileges on vulnerable devices.\n— Andy Nguyen (@theflow0)  October 13, 2020\n   Intel, meanwhile, has  issued this bare-bones advisory that categorizes the flaw as privilege-escalation or information-disclosure vulnerability. The advisory assigned a severity score of 8.3 out of a possible 10 to  CVE-2020-12351, one of three distinct bugs that comprise BleedingTooth.\n “Potential security vulnerabilities in BlueZ may allow escalation of privilege or information disclosure,” the advisory states. “BlueZ is releasing Linux kernel fixes to address these potential vulnerabilities.”\n Intel, which is a primary contributor to the BlueZ open source project, said that the most effective way to patch the vulnerabilities is to update to Linux kernel version 5.9, which was published on Sunday. Those who can’t upgrade to version 5.9 can install a series of kernel patches the advisory links to. Maintainers of BlueZ didn’t immediately respond to emails asking for additional details about this vulnerability.", "posttime": "2020-10-15 05:28:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,蓝牙,英特尔,linux", "title": "谷歌和英特尔警告Linux中存在严重的蓝牙安全漏洞", "title_en": "Google and Intel warn of high-severity Bluetooth security bug in Linux", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/google-and-intel-warn-of-high-severity-bluetooth-security-bug-in-linux/", "via": "", "real_tags": ["谷歌", "google", "蓝牙", "英特尔", "linux"]}, {"category": "", "categoryclass": "", "imagename": "00ddada7d924253facf4873767972e15.png", "infoid": 1028899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "27.。想知道你白天从来没有想过的熟人在做什么。\n每月只有1美元(一年12美元！)。对支持我们的编辑人员和投稿人，同时保持我们没有广告有很大的帮助。今天就成为麦克斯威尼的互联网趋势赞助人吧。", "note_en": "27. Wondering What Acquaintances You Never, Ever Think of During the Day Are Up To\n    As little as $1 a month ($12 a year!) goes a long way towards supporting our editorial staff and contributors while keeping us ad-free. Become a McSweeney’s Internet Tendency patron today.", "posttime": "2020-10-15 05:21:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失眠,stages", "title": "失眠的分期", "title_en": "The Stages of Insomnia", "transed": 1, "url": "https://www.mcsweeneys.net/articles/the-52-stages-of-insomnia", "via": "", "real_tags": ["失眠", "stages"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "计算之美与计算之乐", "note_en": "The Beauty and Joy of Computing", "posttime": "2020-10-15 05:21:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "一切都是,snap,计算", "title": "砰！6在这里，这一切都是关于规模的", "title_en": "Snap! 6 is here, and it's all about scale", "transed": 1, "url": "https://snap.berkeley.edu/blog", "via": "", "real_tags": ["一切都是", "snap", "计算"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造\r帐目", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-10-15 05:21:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "燃料电池,fuel,创造", "title": "菠菜让燃料电池通电", "title_en": "Spinach Gives Fuel Cells a Power Up", "transed": 1, "url": "https://spectrum.ieee.org/energywise/green-tech/fuel-cells/spinach-gives-fuel-cells-a-power-up", "via": "", "real_tags": ["燃料电池", "fuel", "创造"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特周四称，根据“黑客材料政策”，审查了一篇基于亨特·拜登(Hunter Biden)与缅甸一名高管之间电子邮件的“纽约邮报”(New York Post)文章。\n“根据我们的黑客材料政策，以及我们屏蔽URL的方法，我们正在采取行动，屏蔽Twitter上任何指向相关材料的链接或图片，”Twitter的一位发言人在被问及为什么该平台不允许用户分享“华盛顿邮报”的文章时说。\nTwitter的黑客材料政策规定，它不允许“使用我们的服务直接分发通过黑客攻击获得的内容，这些内容包含私人信息，可能会将人们置于人身伤害或危险中，或者包含商业机密”，尽管该平台目前允许共享来自其他来源(包括维基解密)的泄露和被黑客攻击的材料。\n该平台表示，之所以在此案中应用这一政策，是因为担心关于文章中所含材料的来源存在“缺乏权威报道”的问题，并随后锁定了“华盛顿邮报”的Twitter账户。推特的行动是在Facebook宣布在事实核查人员审查这篇文章期间将限制故事的分享之后采取的。\n华盛顿邮报周三上午发表了一篇文章，内容基于亨特·拜登(Hunter Biden)和缅甸顾问瓦迪姆·波扎尔斯基(Vadym Pozharski)之间的电子邮件，讨论了与乔·拜登(Joe Biden)在华盛顿特区的一次明显会晤。\n2015年4月17日，波扎斯基在给亨特·拜登的信中写道：“亲爱的亨特，感谢你邀请我来华盛顿，让我有机会见到你的父亲，并在一起度过了一段时间。”“这是房地产[原文如此]是一种荣誉和乐趣。”乔·拜登此前曾表示，他“从未与我的儿子谈论过他的海外商业交易”，亨特·拜登被任命为缅甸公司董事会成员，“因为他是一个非常聪明的人”。\n在周四下午的一份声明中，拜登竞选团队表示，该报“从未询问过”。。。关于这个故事的关键要素“，以及对”乔·拜登从那时起的官方日程安排“的审查显示，”没有像“纽约邮报”所说的那样举行过会议。“。拜登的竞选团队并没有质疑这些电子邮件的真实性，尽管到目前为止还没有其他媒体证实了邮报的报道。\n报导还提到鲁迪·朱利安尼周日向《华盛顿邮报》提供的其他文件。朱利安尼告诉该报，他的律师从特拉华州一家电脑店的老板那里收到了复制的硬盘上的文件，包括电子邮件，这名店主在一台笔记本电脑上发现了这些文件，这台笔记本电脑被带来维修，但一直没有人来取。该报报道称，FBI在2019年12月传唤了最初的笔记本电脑，并包括所谓传票的照片。当邮报要求确认时，FBI将问题提交给特拉华州联邦检察官办公室，那里的一名发言人表示，“我的办公室既不能证实也不能否认调查的存在。”\n华盛顿邮报的报道招致了推特上记者的谴责，因为他们担心这篇文章可能是源于“虚假信息”。但是推特的行为激怒了保守派，“华盛顿邮报”的观点编辑Sohrab Ahmari称此举为“数字内战”。\n我是“纽约邮报”的编辑，“纽约邮报”是美国发行量最大的报纸之一，我不能发表我们自己的报道，详细描述主要政党总统候选人拜登的腐败行为。Pic.twitter.com/BKNQmAG19H。\n我们的目标是为用户创造一个安全和吸引人的地方，让他们在兴趣和激情上建立联系。为了改善我们的社区体验，我们暂停了文章评论。", "note_en": "Twitter said Thursday that it censored a  New York Post article based on emails between Hunter Biden and a Burisma executive in accordance with its “hacked materials policy.”\n “In line with our Hacked Materials Policy, as well as our approach to blocking URLs, we are taking action to block any links to or images of the material in question on Twitter,” a Twitter spokesperson told   when asked why the platform was not allowing users to share the  Post’s article.\n Twitter’s Hacked Materials Policy  states that it does not “permit the use of our services to directly distribute content obtained through hacking that contains private information, may put people in physical harm or danger, or contains trade secrets,” though the platform does currently allow leaked and hacked material from other sources, including   Wikileaks, to be shared.\n The platform said that the policy applied in this case due to concerns about the “lack of authoritative reporting” in regards to the origins of the material included in the article, and subsequently  locked the  Post’s Twitter account. Twitter’s actions came after Facebook  announced it would limit the sharing of the story while fact-checkers reviewed the piece.\n  The  Post  published an article Wednesday morning based on emails between Hunter Biden and Burisma adviser Vadym Pozharskiy discussing an apparent meeting with Joe Biden in Washington, D.C.\n “Dear Hunter, thank you for inviting me to DC and giving an opportunity to meet your father and spent [sic] some time together,” Pozharskiy wrote to Hunter Biden on April 17, 2015. “It’s realty [sic] an honor and pleasure.” Joe Biden has  previously said that he has “never spoken to my son about his overseas business dealings” and that Hunter Biden was appointed to the board of Burisma  “cause he’s a very bright guy.”\n In a Thursday afternoon statement, the Biden campaign said the paper “never asked . . . about the critical elements of this story,” and that a review of “Joe Biden’s official schedules from the time” show that “no meeting, as alleged by the New York Post, ever took place.” The Biden campaign did not dispute the veracity of the emails, though no other media outlet has confirmed the  Post’s story so far.\n  The report also mentioned other documents that Rudy Giuliani provided to the  Post on Sunday. Giuliani told the paper that his lawyer received the files, including the emails, on a copied hard drive from a Delaware computer shop owner, who discovered them on a laptop that was brought in for repair but was never picked up. The paper reported that the FBI subpoenaed the original laptop computer in December 2019, and included pictures of the alleged subpoena. When asked for confirmation by the  Post, the FBI referred questions to the Delaware U.S. Attorney’s Office, where a spokesperson said “my office can neither confirm nor deny the existence of an investigation.”\n The  Post‘s coverage drew  condemnations from journalists on Twitter, over fears that the article could stem from “disinformation.” But Twitter’s actions outraged conservatives, with the  Post‘s opinion editor Sohrab Ahmari calling the move “digital civil war.”\n I, an editor at The New York Post, one of the nation’s largest papers by circulation, can’t post one of our own stories that details corruption by a major-party presidential candidate, Biden.  pic.twitter.com/BKNQmAG19H\n Our goal is to create a safe and engaging place for users to connect over interests and passions. In order to improve our community experience, we are temporarily suspending article commenting.", "posttime": "2020-10-15 05:21:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,twitter,华盛顿邮报", "title": "Facebook，Twitter屏蔽《纽约邮报》发帖", "title_en": "Facebook, Twitter block the NY Post from posting", "transed": 1, "url": "https://news.yahoo.com/twitter-cites-hacked-materials-policy-194403160.html", "via": "", "real_tags": ["facebook", "twitter", "华盛顿邮报"]}, {"category": "", "categoryclass": "", "imagename": "6f2dc0288910ad5155e081a0c2f368d6.jpg", "infoid": 1028895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马特·吉总是说“朱尼尔做了朱尼尔想要的”，而朱尼尔·肖在这一天想要的是死。当马特得到这个消息时，他正在出去吃早餐，在一个突发的全国性故事的断奏音符中：小肖。。。死了。。。胸部有枪伤。。。可能是自杀。\n马特很震惊。42岁的他还不习惯看着队友死去。\n朱尼尔是来自圣地亚哥的萨摩亚人。马特是一个来自堪萨斯州的乡下男孩。他们成为朋友只是因为他们都是南加州大学的后卫。是马特以入侵堪萨斯州夏天的甲虫的名字给朱尼尔起了个绰号“六月虫”。朱尼尔甚至不知道什么是六月虫。\n朱尼尔是他们南加州大学球队中最好的球员-速度、力量和敏捷如此荒谬的结合，以至于看起来他真的可以做任何他想做的事情。他经常忽视他的任务，但不管怎样，他还是对付了运球手。马特开玩笑说，朱尼尔是因为吃了这么多菠萝才有了超凡脱俗的运动天赋。有一次，两个人去太平洋游泳，朱尼尔游到一只海豚跟前，抓住了它的鳍。\n马特成为一名成功的商人，与他的大学恋人幸福地结婚，抚养了三个孩子，为他在南加州大学的职业生涯所开始的感到自豪。朱尼尔成为了职业足球名人堂成员-在19个NFL赛季中，他是一位如此巨大的明星，以至于他的大多数老队友都很少见到他。直到后来，他们才会把这些短暂的互动视为标志他衰落的圆点：1994年，在一场NFL比赛中，少年与同为特洛伊人的进攻铲球马特·威廉(Matt William)摆好架势，但未能认出他。。。2002年，朱尼尔在一家餐厅停下来和南加州大学的另一位队友卡尔文·福尔摩斯打招呼-但福尔摩斯会说，“走起路来像僵尸一样”。“我在想，哇，橄榄球把你搞成这样了。那只是他的灵魂。他的大脑。“。(Seau将在职业橄榄球比赛中再踢七年。)。。。朱尼尔在大学期间没有喝酒，在他主持的一场高尔夫球锦标赛上发表演讲时含糊其辞-“一种可悲、令人沮丧的醉酒，”前南加州大学防守后卫迈克·萨蒙(Mike Salmon)说，他对这一场景感到如此悲伤和沮丧，以至于走了出来。\n马特眼里含着泪水，从加利福尼亚州西米谷的鸡蛋“N”Things开车回家。他们不会是最后一批。\n1989年秋天，特洛伊队深度图上的12名后卫，每个人都有男人的力量和男孩的精力充沛，在南加州大学提供的一切东西中游泳：欢乐、高等教育和奉承，无休止的肾上腺素激增，酒精，可卡因(如果他们想要的话)，类固醇(如果他们需要的话)。任何让人感到无畏和鲁莽，狂野和自由的东西。\n12名球员，都试图给男人留下深刻印象，比如曾在韩国担任海军陆战队队员的后卫教练汤姆(罗格)罗格曼(Tom(Rogge)Roggeman)。1989年，铲球手被教导用头来领导。药检很容易就能通过。痛苦是弱者的专利。抱怨是针对弱者的。这个游戏就是这样玩的。\n后卫在一支队伍中组成一支队伍，每个球员都有自己的角色。苏是最有才华的。艾伦·威尔逊是最安静的。克雷格·哈特苏克(Craig Hartsuyker)是令人兴奋的技术员。斯科特·罗斯和德尔马尔·切斯利担任马特的导师，马特将在他们离开后成为首发。大卫·韦伯是这支队伍的常驻冲浪手。\n特洛伊队以9-2-1的战绩赢得了那个赛季的玫瑰杯，但足球愚弄了他们。后卫们认为他们是在实时为比赛付出代价。迈克尔·威廉姆斯在一场比赛中一枪击中头部，拦截了一名跑卫，他站起来很慢，但他留在了球场上，即使他的大脑在接下来的几场比赛中迷迷糊糊的。切斯利与一名队友相撞，感觉洛杉矶体育馆在他周围旋转；他试图呆在里面，但摔倒在地，被拉了下来。罗斯说，他会为罗格跑过一堵砖墙，他折断了一只手，继续玩。几场比赛后，他在家里的更衣室外见到了他的父母，记不清他的球队是赢了还是输了。Hartsuyker摔断了一只脚，留在了球场上。还有一次，他在开球时脑震荡，告诉教练他很好，结束了比赛，后来出现在兄弟会的争吵中，没有任何关于那天比赛的记忆。有人把他放在电视机前的地板上，像个蹒跚学步的孩子。\n在一场比赛中，布莱恩·图利奥在脚踝注射了止痛药，回来打了几场比赛，然后下场了。不过，他几乎没有考虑过自己的脑震荡，至少有六次脑震荡。甚至在一场比赛开始之前，他肯定就脑震荡了；刚刚失去首发工作的他，在练习中向每个人发泄愤怒，随着周六的临近，他的大脑不断受损。没有什么比跌落深度图更让人刺痛的了，1989年赛季开始的时候是这样的：\n十二个大学生。五个人将在50岁前死去，他们的生命永远被打上了提前到期的印记。\n安静的人先走，然后悄悄地走。艾伦·威尔逊与马特并不亲近，但他与任何人都没有那么亲近。A-Dub没有参加聚会，也没有对队友开恶作剧；他会交谈，但很少开始交谈。卡尔文·霍姆斯(Calvin Holmes)，他也曾在加州卡森(Carson)打球。威尔逊说，“他在一块岩石下面。他是个隐士。“。\n特洛伊人每天都见到艾伦，但并不是很了解他，所以他顺利地从人过渡到了记忆。球员们记得他是最厉害的击球手之一。他的白色内衣又旧又变色。那些特洛伊木马人没有看到的是：艾伦和他的家人一起欢笑，或者带他的弟弟们去看湖人队和道奇队的比赛，或者每年的母亲节给他的母亲买花。在他们玩耍的日子结束后，他们都散去了，大多数人再也没有见过艾伦。\n他们没有看到他变得沮丧，气球膨胀到超过他的玩耍体重100磅。他们不知道他患有糖尿病和肥厚性心脏病。艾伦的弟弟罗伯特经常光顾他的公寓，他看到A-Dub独自一人，周围都是饼干、甜甜圈和冰淇淋。\n2002年5月13日，罗伯特发现他的弟弟躺在床上，身体可以起床，但不愿意起床。艾伦做了一件艾伦以前从未做过的事：他骂出了他的弟弟，让他回家。罗伯特给他们的妈妈打了电话。\n艾伦保证他会起床洗个澡。他打开水龙头，罗伯特离开去做看门人的工作。\n第二天，母亲节，艾伦既没有给妈妈打电话，也没有给她送花，所以他的父亲去看他。A-Dub躺在床上，死了。淋浴还在开着。\n特洛伊人从未听说过艾伦的精神健康状况恶化。他们只听说他死于糖尿病。十年过去了，然后朱尼尔把枪指着他的胸口，在后卫中，有两个人死了。\n即使在南加州大学的男孩中，斯科特·罗斯也是一个狂野的人。他远没有朱尼尔那么有天赋，但他也是一个全美的人，一枚寻求联系并陶醉其中的导弹。在聚会上看到他打架是很常见的，看到他输了是很不寻常的。\n斯科特吓坏了人们，但他没有吓倒马特。马特太了解他了，太爱他了。\n他们在南加州大学的招聘周末相遇，并很快成为朋友，后来在1990年经典赛开球前夕偷偷溜出球队酒店，这样他们就可以看到纽约市。罗格发誓他看到他们回来了，但要么他不能证明他们已经走了，要么他决定顺其自然。相反，他说，“你们很幸运。”\n十年过去了，马特仍然很幸运。他已经想好了如何既做一个负责任的成年人，又做一个傻乎乎的孩子。他整天工作，建立自己的保险业务，但他也喜欢在自家后院炸毁百事可乐瓶子。\n斯科特就没那么幸运了。他炸毁了自己的生活。斯科特短暂地与圣徒队(Saints)打球，圣徒队是一名新秀，有着老兵饱受摧残的身体，已经在急剧衰落。到了25岁左右，他的背部有一个退变的椎间盘，髋部在骨头上摩擦，大拇指向后弯曲，手腕以一个尴尬的角度突出-但这些都不是真正的问题。他八岁时就开始拼命对付人了。人们问他得过几次脑震荡，他说他记得有12次。\n斯科特曾经是个好丈夫。一个好爸爸。他买了杂货，烤了晚餐，和他的儿子(一段婚姻中的扎克里)和女儿(第二段婚姻中的卡罗琳)一起玩耍。他的第二任妻子叫玛拉，但他称她为“公主”，并把她当公主一样对待。他是一名成功的推销员，先是为希尔蒂，然后是3M，炫耀着他的魅力和他的玫瑰碗戒指达成了交易。他跑了休斯顿马拉松。\n但是足球让他后来居上。在他30多岁的时候，斯科特变得痛苦、恐慌和沮丧。他喝得像是在为一场两分钟的演习辩护--非常激烈，不顾一切。\n如果说酗酒让生活变得模糊，那么这就是斯科特生活中的模糊：他喝醉了，翻了一辆公司的面包车，然后被重新分配到一份文书工作。一年万圣节前夕，他再次酒后驾车，撞上了另一辆车，然后逃跑，然后带着他的女儿去玩“不给糖就捣蛋”。他用拳头击穿了马拉最喜欢的一幅画，把蜡烛扔到厨房的另一边，推了马拉一把。他说他试图在浴缸里自杀。不止一次，玛拉哭着打电话给他的父母珍妮和马歇尔，他们不知道该相信什么，但最终他们全都相信了。当斯科特把玛拉的眼睛打得青一块时，她逃走了。从那里，斯科特拒绝了。\n玛拉换了锁，然后卖掉了他们在德克萨斯州蒙哥马利的房子。她和斯科特共同监护他们的女儿，但有一次玛拉去接卡罗琳，却没有人开门。最后，玛拉听到卡罗琳在喊：“妈妈，我叫醒不了爸爸。”斯科特醉倒了。\n玛拉把卡罗琳带回路易斯安那州的家。回到德克萨斯州，斯科特在湖边租了一间小房子，然后搬进了朋友的拖车里。一天，斯科特打电话给1989年南加州大学球队的防守队员杰夫·和平，斯科特哭了，他说他正用枪指着自己的嘴。\n和平做队友和兄弟做的事。他告诉斯科特来加州和他住在一起，但有一个条件：不能喝酒。斯科特走了。但他喝酒，和平就把他赶出去了。如果这是他童年时的一场街机游戏，斯科特就会只剩下最后几个季度了。\n他用一个叫马特·吉。马特给斯科特安排了文图拉的一套公寓。。。这样的循环就会重复。斯科特喝得酩酊大醉，赤身裸体地在街上奔跑，捣毁了这个地方，也被赶出了那里。\n斯科特有时睡在朋友的沙发上，有时睡在街上。他发现买奥施康定是多么容易。没有人能想出如何帮助他。尽管如此，在一个几乎没有恒定的生活中，他有马特，在他的过去，在他的现在，在那里接听电话。\n劳拉·李·菲茨杰拉德(Laura Lee Fitzgerald)永远无法完全解释为什么她把斯科特带到加州帕索罗伯斯(Paso Robles)的家中。爱情是一个令人悲哀的不充分的答案。他们在一起的生活是一出浸泡在酒精和鲜血中的闹剧喜剧。\n斯科特用闪闪发光的油漆为劳拉画画--但他也偷了她那辆栗色的切诺基吉普车。他在浴缸里刺伤了自己的腿。他在一家塔可钟和几个青少年打架。他把一个莱诺克斯糖果盘砸在头上，像草坪喷头一样把血喷得满墙都是。\n他莫名其妙地把车停在十字路口中央，坐在副驾驶座位上的劳拉尖叫道：“斯科特，你在做什么？！”\n“哦，”他平静地说，如果你忘了在杂货店买橙汁，你可能会用这种声音说，然后他又按了油门。\n他随身携带一只圣克里斯托弗吊坠和一只肮脏的兔脚，以求“保护”。他打碎了劳拉家的双层玻璃窗。他自豪地谈到了他在南加州大学的光辉岁月，谈到了马特和孩子们，但他把他的玫瑰碗戒指赠送给了他的牙医。在一次公共场合醉酒后，他试图骑着拖拉机逃离警察，只穿着他的拳击短裤。\n当劳拉最终把他踢出去时，他站在外面，尖叫着，“劳拉！我爱你!。让我进去吧！“。声音大到整个街区都能听到。\n他偷了劳拉的信用卡去买酒。他把她按在墙上，然后开始掐她。面对自己醉酒后的罪过，他说，“我从来没有那样做过，”他似乎也相信这一点。\n他卖掉了他的战利品，这样他就可以给劳拉买一枚订婚戒指，他用蓬松的颜料给她写了一封信：劳拉，我的天使，嫁给我吧。\n劳拉知道不该嫁给斯科特，但她很难抛弃他。她每天看到的斯科特是可怕的，但她认识的斯科特就在他内心的某个地方-她可爱的斯科特-她不能放手。\n斯科特喝得好像会要了他的命，就像他想要杀了他一样。Jägermeister，啤酒，外敷酒精，李斯特林-有什么不同？他试着戒毒，但从不持久。他去了一家中途之家，讨厌那里，喝了老鼠药，这让他被送进了医院。当劳拉发现他在一家酒店里，周围都是药瓶时，她终于告诉他一切都结束了。\n2011年，斯科特搬到休斯顿与珍妮和马歇尔住在一起，马歇尔为了照顾儿子提前退休。一名医生诊断斯科特患有躁郁症，患有额叶痴呆症-他强烈怀疑，这是斯科特踢足球时大脑受到冲击的一个分支。在1989年，没有人能预见到这一点。\n斯科特现在就像个小孩子，感激和父母住在一起，一直告诉他们他爱他们。但他大脑的腐烂是不可逆转的。一夜好觉变成了不可能的梦。他在卧室里装了遮光罩，但它们只遮挡光线。他们无法赶走黑暗。\n“我受不了了！让它停下来！“。斯科特对着他的父母尖叫。“当我闭上眼睛，一切都回来了，恶魔们也不会闭嘴。”\n恶魔：他们是他想成为的人和他已经成为的人之间的障碍。恶魔是他唯一没有虐待的伙伴。当斯科特喝醉的时候，他会变得暴力。但是当他没有喝醉的时候，恶魔就会靠近他。他赢不了的。\n斯科特试图在阁楼上吊自杀。他抓住母亲的胳膊尖叫道：“都是你的错！是你把我弄成这样的！“。然后问：“你为什么让我踢足球？”\n没有好的答案。斯科特·罗斯在精神上和身体上都是你能遇到的任何人中最棒的足球运动员。现在，他是任何人都害怕成为的前足球运动员。\n他把母亲掐在脖子上，一名医生告诉他的父母，他们必须把他踢出去。医生还警告说：“做好准备。斯科特不是死了就是一年内入狱。“。\n斯科特回到路易斯安那州，再次成为卡罗琳的父亲，但她是一个有自己生活的十几岁的孩子，而他有一个没有自己生活的毒瘾。一个星期天，他带卡罗琳去买甜甜圈。商店关门了，斯科特试图破门而入，尖叫着说：“我想吃甜甜圈！”我想吃甜甜圈！“。他有男子汉的力量，有男孩的精力充沛，有烦恼迷失的灵魂的头脑。\n当一名警官打开马歇尔和珍妮家的侧门，发现他们在后院时，马歇尔已经为即将到来的事情做好了准备。在警官说话之前，马歇尔问道：“斯科特现在做了什么？”\n没有人对此感到惊讶。马特希望他能救他的朋友，但是没人能救他。马特想知道斯科特是不是自杀了。斯科特确实自杀了，不管他是不是故意的。他虐待自己的身体，直到它失去功能，然后他把它倒在他的皮卡车的驾驶座上，放在教堂的停车场里。官方的死因是心力衰竭。嗯，一定是有什么原因。玛拉相信斯科特开车去教堂，希望有人能帮助他，然后喝得烂醉而死。\n马特想在斯科特的葬礼上讲话，为斯科特抬棺材，为从高中开始的友谊迈出最后的一步。但他不能。在仪式当天，马特在医院接受自己的医疗程序，所以一些南加州大学的队友过来拍摄了一段视频。\n“斯科特·罗斯。。。是个混蛋，“马特对着摄像机说，这句台词只是因为一位老朋友说这是出于爱才会笑的。马特拍完了他的视频，他的朋友们离开了病房。他听到他的妻子阿拉娜说，“我很抱歉，”他抽泣起来。\n当你不住在洛杉矶的时候，洛杉矶是一个单一的城市，当你住在那里的时候，洛杉矶是一百个城市。试着在交通拥挤的时候开车从西米谷到奥兰治县行驶80英里(而且几乎总是有交通堵塞)。两个方向都至少要两个小时。马特不在乎。到2017年初，他每周都会开车去拜访大卫·韦伯。\n大学做到了这一点：它把堪萨斯州乡村男孩马特·吉(Matt Gee)介绍给来自欧文的冲浪运动员大卫·韦伯(David Webb)，让友谊融为一体。他们是大一的室友。\n大卫留着难看的山羊胡子，在比赛中戴着巨大的黑色眼球，在举重室里碾压队友，在训练中煽动打架，并告诉洛杉矶时报，“我有很好的技术，但我更喜欢碾压他们。”然而，在赛场外，大卫很冷淡。任何寻找他的人都应该从海滩出发，这是明智之举。\n大学毕业后，大卫找到了一份装卸工的工作，马特笑着说：“对他来说，这是一份很棒的工作。”大卫的第一任妻子凯西死于乳腺癌，有一段时间，他独居一段时间，抚养他们的儿子卢克(Luke)和约书亚(Joshua)。马特认为大卫很好，只是有点失控，因为大卫从来没有像斯科特·罗斯那样失控过。大卫总是很好。\n大卫不太好。他经常失去思路，中途就不说话了。他记得生日，却忘了单词。家人学会为他捡起对话的片段，这样他就不会感到尴尬。他的保险丝变短了。他对他的儿子们因轻微的违法行为大喊大叫。他经常迟到。他喝得太多了。他的新女友莱斯利下班回家，准备出去吃他们计划好的晚餐，但大卫和他的孩子们还穿着睡衣。他不知道现在是几点。\n大卫的父亲查理认为他“喝醉了”。他的母亲卡罗琳(Carolyn)说，他正在“倒退”。他的哥哥格雷格每周都会去看大卫，他能看出来有些地方不对劲--严重的不对劲，比如早些时候的阿尔茨海默氏症(阿尔茨海默氏症)。但是格雷格不知道该说什么。你怎么告诉你弟弟他的大脑在衰竭？格雷格认为大卫将会有“人生的早期”。\n大卫的脸部，特别是耳朵周围，由于长时间暴露在阳光下太多年而出现损伤，他的家人催促他去看医生。不过，他没有医疗保险，他告诉他们不用担心。求求你，他的父母求你。我们会付钱的。但他还是不肯去。他们担心，如果他们给他太多压力，他可能会崩溃，可能会完全切断我们的关系。\n大卫最终去看了医生，并被诊断出患有鳞状细胞癌，这是一种高度可治愈的疾病。通常是这样的。但他等得太久了。癌症扩散了，他快要死了。\n马特已经从新闻中得知了朱尼尔在早餐时去世的消息；艾伦是通过口口相传得知的；斯科特正在打电话。他不会让大卫在没有他的情况下死去的。\n马特带大卫去看各种医生。也许他被误诊了；也许他没有得到正确的医疗护理。马特天生就是个修理工，他拒绝承认。最后，他终于明白了：他所能做的最好的事情就是呆在那里。\n天哪，难道不就在昨天，他们还是大学生，在大卫家闲逛，整天坐在他家的热水浴缸里，起床只为抓个热狗或上个洗手间？现在只剩几天了。几个小时。几分钟。大卫的短期记忆是模糊的，但他的长期记忆还在那里，他们笑得像过去一样。马特告诉大卫的儿子们，在堪萨斯州吃鲶鱼时，有一次他带了一只大卫大学时穿的牛仔靴子。几年前，马特把它当做笑料偷走了，他一直把它作为他们友谊的纪念品。\n马特买了卡片，大卫可以在男孩们18岁生日、高中毕业日、婚礼日为他们准备卡片-所有这些他显然会怀念的里程碑。大卫在卡片上签名：XO44。\n癌症使大卫的脸变形。哑光秀。\n.", "note_en": "Matt Gee always says that “Junior does what Junior wants,” and what Junior Seau wants on this day is to die. Matt is out for breakfast when he gets the news, in the staccato notes of a breaking national story:  Junior Seau . . . dead . . . gunshot wound to the chest . . . possible suicide.\n Matt is shocked. At 42, he is not yet used to watching his teammates die.\n Junior was a Samoan from San Diego. Matt was a country boy from Kansas. They became friends only because they were both USC linebackers. Matt was the one who gave Junior the nickname June Bug, after the beetles that invade Kansas summers. Junior didn’t even know what a june bug was.\n  Junior was the best player on their USC teams—such an absurd amalgamation of speed, strength and agility that it really did seem like he could do whatever he wanted. He often ignored his assignment but tackled the ballcarrier anyway. Matt joked that Junior got this otherworldly athleticism from eating so much pineapple. Once, the two went swimming in the Pacific, and Junior swam up to a dolphin and grabbed its fin.\n   Matt became a successful businessman, happily married to his college sweetheart, raising three kids, proud of what his USC career begat. Junior became a Pro Football Hall of Famer—such an enormous star over 19 NFL seasons that most of his old teammates rarely saw him. Only later would they see these fleeting interactions as dots marking his descent: Junior squaring off against offensive tackle Matt Willig, a fellow Trojan, in an NFL game in 1994 and failing to recognize him . . . Junior stopping to say hi to another USC teammate, Calvin Holmes, at a restaurant in 2002—but “walking like a zombie,” Holmes would say. “I’m thinking, Wow, football messed you up like that. It was just his soul. His brain.” (Seau would play pro football for seven more years.) . . . Junior, who didn’t drink in college, slurring his way through a speech at a golf tournament he was hosting—“a sad, depressing kind of drunk,” says former USC defensive back Mike Salmon, who was so saddened and depressed by the scene that he walked out.\n    Matt drives home from Eggs ‘N’ Things in Simi Valley, Calif., with tears in his eyes. They will not be the last.\n     Twelve linebackers on the Trojans’ depth chart in the fall of 1989, each with the strength of a man and the exuberance of a boy, swimming in everything USC has to offer: joy and higher education and adulation, endless adrenaline surges, alcohol, cocaine if they want it, steroids if they need them. Anything to feel fearless and reckless, wild and free.\n Twelve players, all trying to impress men like linebackers coach Tom (Rogge) Roggeman, who served as a Marine in Korea. In 1989, tacklers are taught to lead with their heads. Drug tests are easy to beat. Pain is for the weak. Complaints are for the weaker. This is how the game is played.\n The linebackers form a team within a team, each player with his own role. Seau is the most talented. Alan Wilson is the quietest. Craig Hartsuyker is the heady technician. Scott Ross and Delmar Chesley serve as mentors to Matt, who will become a starter after they leave. David Webb is the team’s resident surfer dude.\n    The Trojans go 9-2-1 and then win the Rose Bowl that season, but football fools them. The linebackers think they are paying the game’s price in real time. Michael Williams takes a shot to the head tackling a running back in one game and he is slow to get up, but he stays on the field, even as his brain fogs up for the next few plays. Chesley collides with a teammate and feels the L.A. Coliseum spinning around him; he tries to stay in but falls to a knee and gets pulled. Ross, who says he would run through a brick wall for Rogge, breaks a hand and keeps playing. After several games he meets his parents outside the home locker room and can’t remember whether his team won or lost. Hartsuyker breaks a foot and stays on the field. Another time, he gets concussed on a kickoff, tells trainers he is fine, finishes the game and later shows up on fraternity row with no recollection of playing that day. Somebody sets him on the floor in front of a television, like a toddler.\n  In one game Brian Tuliau gets a painkiller injection in his ankle, returns for a couple of plays and comes off. He barely thinks, though, about his concussions, which number at least a half-dozen. He is surely concussed before one game even  begins; having just lost his starting job, he takes out his anger on everybody in practice, steadily damaging his brain as Saturday approaches. Nothing stings quite like dropping on the depth chart, which looks at the beginning of the 1989 season like this:\n    Twelve college students. Five will die by age 50, their lives stamped forever with an early expiration date.\n   The quiet one goes first and goes quietly. Alan Wilson is not close to Matt, but he is not that close to anybody. A-Dub did not attend parties or play practical jokes on teammates; he conversed but rarely started conversations. Calvin Holmes, who also played at Carson (Calif.) High with Wilson, says, “He was up underneath a rock. He was a hermit.”\n The Trojans saw Alan every day but didn’t really know him well, and so he makes a smooth transition from man to memory. Players remember that he was one of the hardest hitters. That his white undershirts were old and discolored. What those Trojans did not see: Alan’s laughing with his family, or taking his kid brothers to Lakers and Dodgers games, or buying flowers for his mom every year on Mother’s Day. After their playing days ended and they all dispersed, most never saw Alan again.\n  They do not see him become depressed and balloon to 100 pounds over his playing weight. They do not know he has diabetes and hypertrophic heart disease. Alan’s brother Robert visits his apartment regularly, and he sees A-Dub alone, surrounded by cookies and doughnuts and ice cream.\n    On May 13, 2002, Robert finds his brother in bed, physically able to rise but unwilling to. Alan does something Alan never used to do: He cusses out his kid brother and tells him to go home. Robert calls their mom.\n   Alan promises he will get up and take a shower. He turns on the water, and Robert leaves for his janitorial job.\n The next day, Mother’s Day, Alan does not call his mom or send her flowers, and so his father goes to check on him. A-Dub is in bed, dead. The shower is still running.\n The Trojans never hear that Alan’s mental health had declined. They hear only that he died of diabetes. A decade passes, and then Junior puts that gun to his chest, and among the linebackers, that’s two dead.\n       Even among the boys at USC, Scott Ross was a wild one. He was not nearly as gifted as Junior, but he too was an All-America, a missile seeking contact and reveling in it. It was common to see him get in fights at parties and unusual to see him lose.\n Scott scared people, but he did not scare Matt. Matt knew him too well, loved him too much.\n They met on their recruiting weekend at USC and became fast friends, later sneaking out of their team hotel on the eve of the 1990 Kickoff Classic so they could see New York City. Rogge swore he saw them returning, but either he couldn’t prove they’d left or he decided to let it slide. Instead, he said, “You guys were lucky.”\n A decade later Matt is still lucky. He has figured out how to be both a responsible adult and a goofy kid. He works all day building up his insurance business, but he also loves blowing up Pepsi bottles in his backyard.\n Scott is not so lucky. He blows up his life. Scott plays briefly with the Saints, a rookie with a veteran’s battered body, already in steep decline. By his mid-20s he has a degenerative disk in his back, a hip that rubs bone on bone, a thumb that bends backward and a wrist that pops out at an awkward angle—but none of those is the real problem. He started tackling people hard when he was eight. People ask how many concussions he’s had, and he says he remembers 12.\n    Scott was a good husband, once. A good dad. He bought groceries and grilled dinner and played with his son (Zachary, from one marriage) and daughter (Caroline, from a second). His second wife was named Marla but he called her “Princess,” and he treated her like one. He was a successful salesman, first for Hilti and then for 3M, flashing his charm and his Rose Bowl ring to close deals. He ran the Houston Marathon.\n But football catches him from behind. In his 30s, Scott turns tormented, panicky and depressed. He drinks as if he’s defending a two-minute drill—intensely, desperately.\n  If alcoholism makes life a blur, this is the blur of Scott’s life: He gets drunk, flips a company van and is reassigned to a desk job. One Halloween he drives drunk again, hits another car, flees and then takes his daughter trick-or-treating. He puts a fist through one of Marla’s favorite paintings, throws a candle across the kitchen and pushes Marla. He says he tried to kill himself in a bathtub. More than once, Marla calls his parents, Janie and Marshall, crying, and they aren’t sure what to believe, but eventually they believe it all. Marla bails when Scott gives her a black eye. From there, Scott declines.\n    Marla changes the locks, then sells their house in Montgomery, Texas. She and Scott share custody of their daughter, but one time Marla goes to pick up Caroline and nobody answers the door. Finally, Marla hears Caroline calling: “Momma, I can’t wake up Daddy.” Scott is passed out drunk.\n Marla takes Caroline home to Louisiana. Back in Texas, Scott rents a little house on a lake, then moves into a friend’s trailer. One day Scott calls Jeff Peace, who played defensive line on that 1989 USC team; Scott is crying, and he says he’s pointing a gun at his mouth.\n Peace does what teammates and brothers do. He tells Scott to come to California and live with him, with one condition: no drinking. Scott goes. But he drinks, and Peace kicks him out. If this were an arcade game from his childhood, Scott would be down to his last few quarters.\n He uses one to call Matt Gee. Matt sets Scott up with an apartment in Ventura . . . and the cycle repeats. Scott gets nuclear drunk, runs naked in the streets, trashes the place and gets kicked out of there, too.\n Sometimes Scott sleeps on a friend’s couch, and sometimes he sleeps on the streets. He discovers how easy it is to buy Oxycontin. Nobody can figure out how to help him. And still, in a life with so few constants he has Matt, there in his past, there in his present, there to answer the phone.\n     Laura Lee Fitzgerald will never be able to fully explain why she takes Scott into her home in Paso Robles, Calif. Love is a woefully insufficient answer. Their life together is a slapstick comedy soaked in alcohol and drenched in blood.\n Scott makes pictures for Laura with sparkle paint—but he also steals her maroon Jeep Cherokee. He stabs himself in the leg in the bathtub. He gets into a fight with some teenagers at a Taco Bell. He smacks a Lenox candy dish over his head, spurting blood all over the walls like a lawn sprinkler.\n  He stops his car, inexplicably, in the middle of an intersection and Laura, in the passenger seat, screams, “Scott,  what are you doing?!”\n   “ Ohhh,” he says calmly, in a voice you might use if you forgot to buy orange juice at the grocery store, and he hits the gas again.\n He carries around a Saint Christopher pendant and a dirty rabbit’s foot, for “protection.” He breaks double-pane windows in Laura’s house. He speaks proudly of his glory days at USC, about Matt and the boys, but he gives away his Rose Bowl ring to his dentist. After one episode of public drunkenness, he tries to flee police on a tractor, wearing only his boxer shorts.\n    When finally Laura kicks him out, he stands outside, screaming, “Laura! I love you! Let me in!” loud enough for the whole neighborhood to hear.\n He steals Laura’s credit card to buy liquor. He pins her against a wall and starts choking her. Confronted with his drunken sins, he says, “I never did that,” and he seems to believe it.\n He sells his trophies so he can buy Laura an engagement ring, and he writes her a letter in puffy paint:  Laura, my angel, marry me.\n Laura knows better than to marry Scott, but she has a hard time ditching him. The Scott she sees every day is frightening, but the Scott she knows is somewhere inside him—her sweet Scott—and she can’t let that go.\n Scott drinks like it might kill him, like he  wants it to kill him. Jägermeister, beer, rubbing alcohol, Listerine—what’s the difference? He tries rehab but it never lasts. He goes to a halfway house, hates it and drinks rat poison, which gets him sent to a hospital. When Laura finds him in a hotel, surrounded by bottles of pills, she finally tells him it’s over.\n In 2011, Scott moves to Houston to live with Janie and Marshall, and Marshall retires early to take care of his son. A doctor diagnoses Scott as bipolar, with frontal-lobe dementia—an offshoot, he strongly suspects, of the pounding Scott’s brain took playing football. Nobody could foresee that in 1989.\n    Scott is now like a little kid, grateful to live with his parents, telling them all the time that he loves them. But his brain’s decay is irreversible. A good night’s sleep becomes an impossible dream. He puts blackout shades in his bedroom, but they block only the light. They cannot push out the darkness.\n “I can’t take this! Make it stop!” Scott screams at his parents. “When I close my eyes, it all comes back and the demons won’t shut up.”\n The demons: They are what stand between the person he wants to be and the person he has become. The demons are the only companions he doesn’t abuse. When Scott gets drunk, he gets violent. But when he  doesn’t get drunk, the demons move in closer. He cannot win.\n Scott tries to hang himself in the attic. He grabs his mother by the arms and screams, “It’s all your fault! You did this to me!” And then: “Why did you let me play football?”\n There is no good answer. Scott Ross was as much a football player—mentally and physically—as anybody you could meet. Now he is as much of an ex-football player as anybody could fear becoming.\n He puts his mother in a headlock, and a doctor tells his parents they have to kick him out. The doctor also warns: “Be prepared. Scott will be either dead or in prison within a year.”\n    Scott returns to Louisiana, to be a father to Caroline again, but she’s a teenager with her own life, and he has an addiction with no life of his own. One Sunday, he takes Caroline to get doughnuts. The shop is closed and Scott tries to break in, screaming, “I want doughnuts! I want doughnuts!” He has the strength of a man, the exuberance of a boy and the brain of a troubled and lost soul.\n When a police officer opens the side gate at Marshall and Janie’s house and finds them in the backyard, Marshall is prepared for what’s coming. Before the officer speaks, Marshall asks: “What has Scott done now?”\n  Nobody is surprised. Matt wishes he could have saved his friend, but nobody could have saved him. Matt wonders whether Scott killed himself. Scott did kill himself, whether he meant to or not. He abused his body until it was functionless, and then he left it slumped over in the driver’s seat of his pickup truck, in a church parking lot. The official cause of death is heart failure. Well, it has to be  something. Marla believes Scott drove to the church hoping somebody would help him and then drank himself to death.\n Matt wants to speak at Scott’s funeral, to carry Scott’s casket, to take the last steps of a friendship that began in high school. But he can’t. On the day of the service, Matt is in the hospital for a medical procedure of his own, so some USC teammates come by and shoot a video.\n    “Scott Ross . . . was an asshole,” Matt says into a camera, a line that gets laughs only because it is said out of love, by a longtime pal. Matt finishes his video, and his friends leave the hospital room. He hears his wife, Alana, say, “I’m so sorry,” and he sobs.\n    Los Angeles is a single city when you don’t live there, and a hundred cities when you do. Try driving the 80 miles from Simi Valley to Orange County when there’s traffic (and there is almost always traffic). It’s at least two hours, either direction. Matt doesn’t care. By the beginning of 2017, he’s making that drive every week to visit David Webb.\n College did this: It introduced Matt Gee, the Kansas country boy, to David Webb, the surfer from Irvine, and let the friendship jell. They were freshman roommates.\n David grew a nasty-looking goatee, wore huge globs of eye black during games, crushed teammates in the weight room, instigated fights at practice and told the  Los Angeles Times, “I have good technique, but I prefer to run over ’em.” Off the field, though, David was chill. Anybody looking for him was wise to start at the beach.\n     After college David finds work as a longshoreman, and Matt smiles at the fit: “A great job for him.” David’s first wife, Casey, dies of breast cancer, and for a while he keeps to himself, raising their boys, Luke and Joshua. Matt figures David is fine, just kind of out of touch, because David is never out of control as Scott Ross was. David is always fine.\n David is not fine. He frequently loses track of his thoughts and stops talking midsentence. He remembers birthdays but forgets words. Family members learn to pick up the pieces of conversations for him, so he doesn’t get embarrassed. His fuse gets shorter. He yells at his sons for minor transgressions. He shows up late a lot. He drinks too much. His new girlfriend, Leslie, comes home from work, ready to go out for the dinner they’d planned, but David and his boys are still in pajamas. He has no idea what time of day it is.\n David’s father, Charlie, thinks he is “punch drunk.” His mother, Carolyn, says he is “regressing.” His brother, Greg, sees David every week, and he can tell something is wrong—seriously wrong, like early-Alzheimer’s wrong. But Greg does not know what to say. How do you tell your brother his brain is failing? Greg thinks David will have “an early run in life.”\n    David develops lesions on his face, especially around his ears, from too many hours in the sun, for too many years, and his family pushes him to see a doctor. He doesn’t have health insurance, though, and he tells them not to worry about it.  Please, his parents beg.  We’ll pay for it. But he still won’t go. They fear that if they push him too much, he might snap, maybe cut off the relationship entirely.\n David finally sees a doctor and is diagnosed with squamous cell carcinoma, which is highly curable.  Usually. But he has waited too long. The cancer has spread, and he is dying.\n Matt has already learned about Junior’s death over breakfast, on the news; Alan’s by word of mouth; and Scott’s on a phone call. He is not going to let David die without him.\n  Matt takes David to various doctors. Maybe he has been misdiagnosed; maybe he’s not getting the right medical care. A fixer by nature, Matt is in denial. Finally, he comes to understand: The best he can do is just  be there.\n Gosh, wasn’t it just yesterday that they were college kids hanging at David’s house, sitting in his family’s hot tub all day, getting up only to grab a hot dog or go to the bathroom? They’re down to days now. Hours. Minutes. David’s short-term memory is mush, but his long-term memory is still there, and they laugh like old times. Matt tells David’s sons about noodling for catfish back in Kansas and on one visit brings along a cowboy boot that belonged to David in college. Matt had swiped it as a gag, years ago, and he has kept it all this time as a souvenir of their friendship.\n    Matt buys cards that David can prepare for the boys on their 18th birthdays, on their high school graduation days, on their wedding days—all the milestones he will clearly miss. David signs the cards:  XO 44.\n Cancer deforms David’s face. Matt show\n......", "posttime": "2020-10-15 05:20:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,dying,斯科特", "title": "南加州大学垂死的后卫", "title_en": "USC's Dying Linebackers", "transed": 1, "url": "https://www.si.com/college/2020/10/07/usc-and-its-dying-linebackers", "via": "", "real_tags": ["大学", "dying", "斯科特"]}, {"category": "", "categoryclass": "", "imagename": "c7b04824816325cc7a43d08e4ebe682b.jpg", "infoid": 1028894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "精心策划的太空新闻和链接。每周、简要和技术性的。", "note_en": "Curated space news and links. Weekly, brief, and technical.", "posttime": "2020-10-15 05:19:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,活动,starlink,太空", "title": "使用活动TLE可视化StarLink的当前覆盖范围", "title_en": "Visualize Starlink's current coverage with active TLEs", "transed": 1, "url": "http://orbitalindex.com/feature/starlink-coverage/", "via": "", "real_tags": ["可视化", "活动", "starlink", "太空"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两代人之前，90%的美国人可以预期比他们的父母挣得更多。如今，这一数字还不到50%。\n2008年，在大衰退期间，婴儿潮一代的政客们为他们这一代人的朋友和同胞带来了大规模的救助。许多银行和公司没有破产，而是从子孙后代那里拿到了钱。这使得婴儿潮时期的聚会和美好生活得以继续。如果这些公司因为他们的所有者和管理者不称职而像他们应该的那样破产，那么新的年轻一代的企业家可能会站起来建立更好的公司。\n在Covid危机期间，我们看到同样的模式重复。两党的婴儿潮一代政客都希望救助他们的朋友、公司和朋友的养老基金。他们是通过窃取后代的东西来做到这一点的。\n婴儿潮一代现在是美国历史上年龄最大、最富有的一代，不是因为他们更加努力地工作，而是因为他们不关心自己的子孙。他们自私地把尽可能多的钱据为己有，即使在他们应该在破产中失去的时候也保留了它。\n未来几代美国人将不会过上更好的生活，因为婴儿潮一代让他们背负着巨额债务，以支付他们持续的奢侈生活。", "note_en": "Two generations ago, 90% of Americans could expect to earn more than their parents. Today, that number is under 50%.\n  In 2008, during the Great Recession, Boomer politicians brought in massive bailouts for their friends and fellows in their generation. Instead of going bankrupt, many banks and companies were instead given money taken from future generations. This allowed the Boomer party and good life to continue. If those companies had gone bankrupt as they should have due to their incompetent owners and managers, then a fresh young generation of entrepreneurs could have risen to build much better companies.\n During the Covid crisis, we are seeing the same pattern repeat. Boomer politicians from both parties want to bailout their friends companies and their buddies pension funds. They do this by stealing from future generations.\n Boomers are now the oldest and richest generation in American history, not because they work harder, but because they don’t care about their children or grandchildren. They have selfishly taken as much as they can for themselves and kept it even when they should have lost it in bankruptcy.\n Future generations of Americans will not have better lives because Boomers have saddled them with enormous debts to pay for their continued high life.", "posttime": "2020-10-15 05:18:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "财富,wealth,朋友", "title": "代际财富向婴儿潮一代转移", "title_en": "Intergenerational Wealth Transfers to Boomers", "transed": 1, "url": "https://joelx.com/intergenerational-wealth-transfers-to-boomers/16060/", "via": "", "real_tags": ["财富", "wealth", "朋友"]}, {"category": "", "categoryclass": "", "imagename": "af3070542e7ad5405a918d813bcdf3e3.jpg", "infoid": 1028891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国的药物过量似乎正在恶化，部分原因是冠状病毒大流行。\n2016年，阿片类药物危机上升到接近国家议程的首位。特朗普总统和希拉里·克林顿都承诺要解决这场危机。\n然而，这个问题在2020年的竞选中一直不是一个因素，尽管有证据表明它已经变得更糟。\n疾病控制和预防中心的初步数据显示，2019年过量死亡人数上升了约5.6%，达到71,148人。在此之前，2018年服药过量死亡人数下降了4.1%。\n2019年的明显增长可能是由于非法毒品市场的变化。布法罗大学(University Of Buffalo)临床和成瘾研究所所长肯尼斯·伦纳德(Kenneth Leonard)表示，私营部门和政府限制处方阿片类药物滥用的努力在2018年成功地降低了过量死亡人数。但现在，非法阿片类药物的使用可能正在推动总死亡人数回升。\n伦纳德说，这可能是因为海洛因、芬太尼和甲基苯丙胺在这个国家的一些地区变得更容易获得，直到最近，这些地区基本上都是免费的。\n联邦国家药物滥用研究所(National Institute On Drug Abuse)副主任威尔逊·康普顿博士(Dr.Wilson Compton)表示：我们看到了几年前开始的转变，当时毒贩开始销售非常有效的芬太尼产品，这些产品的生产成本相对较低。芬太尼的效力使走私变得更容易，因为只需要少量就可以达到很高的效果。但这种效力也使芬太尼更具杀伤力。\n这场大流行似乎也使问题变得更加严重。过量检测地图应用程序是一项从救护车团队、医院和警察那里收集数据的联邦倡议，该计划发现，3月份过量死亡人数比前一年3月份跃升了18%。4月和5月的增幅更大，分别为29%和42%。\n帮助吸毒者提高服药依从性的远程健康平台emocha的首席执行官塞巴斯蒂安·塞格尔(Sebastian Seiguer)说，许多患者在美沙酮诊所接受药物治疗和咨询。他们必须亲自去诊所。但在大流行期间，你不会希望病人每天都去诊所。因此，这些患者没有受益于让他们继续接受咨询和药物治疗的常规做法。\nSeiguer指出，许多吸毒者过着与世隔绝的生活，所以参加支持小组对于避免复发至关重要。\n他说，每天都有病人参加多个互助小组。这些群体并不容易过渡到虚拟环境。\n大流行给吸毒者带来的压力也可能导致服药过量的增加。\n在个人层面上，大流行带来了很大的压力。伦纳德说，物质使用者感染COVID的风险更高，而且许多人已经存在的疾病会使他们的预后变得更糟。失业带来的经济压力，以及通过休假或减少工作时间而导致的就业不足，也增加了复发的可能性。", "note_en": "Drug overdoses in the United States appear to be worsening, in part due to the  coronavirus pandemic.\n  In 2016, the opioid crisis rose to near the top of the national agenda. Both President Trump and Hillary Clinton pledged to tackle the crisis.\n  Yet, the problem has been less of a factor in the 2020 campaign, even though the evidence suggests it has gotten worse.\n  Preliminary Centers for Disease Control and Prevention data show that overdose deaths rose about 5.6% in 2019 to 71,148. The increase follows a decline of 4.1% in overdose deaths in 2018.\n  The apparent increase in 2019 likely resulted from changes in the illegal drug market. Private-sector and government efforts to limit abuse of prescription opioids succeeded in lowering overdose deaths in 2018, said Kenneth Leonard, director of Clinical and Research Institute on Addictions at the University of Buffalo. But now, the use of illegal opioids is likely driving overall deaths back up.\n  &#34;This may be the result of heroin, fentanyl, and methamphetamines becoming more available in areas of the country that have been largely spared until recently,&#34; Leonard said.\n  &#34;We saw a shift starting a few years ago when drug dealers began selling very potent fentanyl products that are relatively cheap to produce,&#34; said Dr. Wilson Compton, deputy director at the federal National Institute on Drug Abuse. The potency of fentanyl makes it easier to smuggle because only small amounts are needed to achieve a high. But the potency also makes fentanyl more lethal.\n  The  pandemic also seems to have worsened the problem. The Overdose Detection Mapping Application Program, a federal initiative that collects data from ambulance teams, hospitals, and police, found that overdose deaths jumped 18% in March from the previous March. April and May saw even sharper increases, of 29% and 42%, respectively.\n    &#34;Many patients receive medication and counseling at methadone clinics,&#34; said Sebastian Seiguer, CEO of emocha, a telehealth platform that helps addicts improve medication adherence. &#34;They have to go in person to the clinic. But during the pandemic, you don’t want patients going to the clinic every day. So, those patients did not have the benefit of the routine that keeps them in counseling and on their medication.&#34;\n  Seiguer noted that many addicts lead isolated lives, so attending support groups is crucial to avoiding relapse.\n  &#34;You have patients attending multiple support groups every day,&#34; he said. &#34;Those groups did not easily transition to a virtual setting.&#34;\n  What may also be leading to a rise in overdose is the stress that the pandemic is putting on addicts.\n  &#34;At the individual level, there is substantial stress that has resulted from the pandemic. Substance users are at higher risk for contracting COVID, and many have preexisting conditions that would make their prognosis worse,&#34; said Leonard. &#34;The economic stress of unemployment, and under-employment through furloughs or reduced hours, also increase the likelihood of relapse.&#34;", "posttime": "2020-10-15 05:18:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人数,deaths,药物", "title": "在非法阿片类药物和大流行的推动下，过量死亡人数上升", "title_en": "Overdose deaths rise, driven by illegal opioids and the pandemic", "transed": 1, "url": "https://www.washingtonexaminer.com/news/overdose-deaths-rise-driven-by-illegal-opioids-and-the-pandemic", "via": "", "real_tags": ["人数", "deaths", "药物"]}, {"category": "", "categoryclass": "", "imagename": "10535523015c084b8c1f3fcbaa15157d.png", "infoid": 1028889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此工具使您可以更好地控制主机文件的使用。您可以拥有多个配置文件，并根据需要打开/关闭它们。\n通过手动编辑来处理HOSTS文件是一项繁琐的任务，使用此工具可以自动完成某些方面的工作，从而更干净、更快速地完成这项工作。\n直接从文本文件添加配置文件，您可以将其添加到git repo或任何VCS中。\n该工具识别您的系统并使用正确的主机文件，它将在Linux/Mac上使用/etc/hosts，在Windows上使用C：/Windows/System32/Drivers/etc/hosts。\nSudo/admin：修改主机文件的任何操作都需要权限，需要时将sudo添加到下面的命令中。如果您使用的是windows，请确保以管理员身份运行。\n警告：它应该可以在任何系统上运行。它是在Ubuntu和Windows10上测试的。如果你能确认它在其他系统上可以工作，请在这里告诉我。\n如果你喜欢这个工具，觉得值得，可以请我喝杯咖啡：", "note_en": "This tool gives you more control over the use of your hosts file.You can have multiple profiles and switch them on/off as you need.\n  It is a tedious task to handle the  hosts file by editing manually.With this tool you can automate some aspects to do it cleaner and quick.\n  Add profiles directly from a text file that you can add to your git repo or any VCS.\n           The tool recognize your system and use the right hosts file, it will use  /etc/hosts on Linux/Mac and  C:/Windows/System32/Drivers/etc/hosts on Windows.\n SUDO/ADMIN: You will need permissions for any action that modify hosts file, add  sudo to the commands below when needed. If you are on windows, make sure you run it as administrator.\n WARNING: it should work on any system. It&#39;s tested on Ubuntu and Windows 10. If you can confirm it works on other system, please let me know  here.\n         If you like this tool and think is worth it, you can invite me a coffee:", "posttime": "2020-10-15 05:00:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cli,hosts", "title": "使用CLI管理主机文件", "title_en": "Managing your hosts file with a CLI", "transed": 1, "url": "https://github.com/guumaster/hostctl", "via": "", "real_tags": ["cli", "hosts"]}, {"category": "", "categoryclass": "", "imagename": "239bb5b07a2c9f9cf3f664f649f25217.png", "infoid": 1028888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Mac上的默认野牛版本非常旧(2.3版)。你需要更换它。如果发生这种情况，则生成器会产生错误。你可以得到一头最近的野牛，就像这样：\nUbuntu系统上的默认SQLite也相当旧。某些测试(特别是查询计划测试)使用此版本中没有的功能。您将希望链接到较新的sqlite以通过所有测试。\n如果您将CGSQL_GCC添加到您的环境中，Makefile将添加CFLAGS+=-std=C99-D_NULLABLE=-D_NONULL=，以尝试提高与GCC的互操作性。\n如果您将SQLITE_PATH添加到您的环境中，Makefile将尝试从该路径编译sqlite3-all.c，并将其链接进来，而不是使用-lsqlite3。\n做同样的事情，但是它测试构建的汞合金而不是普通的构建。\n这将运行带有覆盖率标志的测试脚本，这将导致覆盖率构建。如果测试通过，将创建覆盖率报告。\n当cov.sh使用test.sh执行繁重任务时，可以使用相同的构建选项。\n这将导致创建和编译汞齐。然后，测试套件将针对该二进制文件运行。", "note_en": "The default bison on Mac is quite old (v2.3). You&#39;ll need to replace it. The Buildproduces an error if this is happening. You can get a more recent bison like this:\n  The default SQLite on Ubuntu systems is also fairly old. Some of the tests (particularlythe query plan tests) use features not available in this version. You&#39;ll want to linkagainst a newer sqlite to pass all the tests.\n  If you add  CGSQL_GCC to your environment the  Makefile will add  CFLAGS += -std=c99 -D_Nullable= -D_Nonnull=to try to be more interoperable with gcc.\n If you add  SQLITE_PATH to your environment the  Makefile will try to compile  sqlite3-all.c from that pathand it will link that in instead of using  -lsqlite3.\n     Does the same thing but it tests the built amalgam rather than the normal build\n   This will run the test scripts with the coverage flag, which causes the coverage build.If the tests pass a coverage report is created.\n The same build options are available as  cov.sh uses  test.sh to do the heavy lifting.\n     This will cause the amalgam to be created and compiled. Then the test suite will run against that binary.", "posttime": "2020-10-15 04:59:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,sqlite,存储,converts,测试", "title": "将SQL存储过程(如LANGUAGE)转换为C for SQLite的编译器", "title_en": "A compiler that converts a SQL Stored Procedure like language into C for SQLite", "transed": 1, "url": "https://github.com/facebookincubator/CG-SQL", "via": "", "real_tags": ["编译", "sqlite", "存储", "converts", "测试"]}, {"category": "", "categoryclass": "", "imagename": "5c5f91ca41df4fea4627a6fdcc0a7d7c.jpg", "infoid": 1028886, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊黄金日(Amazon Prime Day)带来了大量折扣，但事实上，其中只有一小部分值得购买。因此，我们在过去的几天里一直在努力从亚马逊的自营购物节中挑选出最值得你关注的优惠。\n不过，由于活动定于明天结束，我们认为让我们的最后一篇黄金日帖子分享Ars这里读者购买最多的商品会很有趣。需要明确的是：我们绝对不会(也不能)跟踪个人的购买习惯，但我们能够看到哪些东西在匿名的总体上受到了最多的关注。\n此外，不要将此视为一组科学数据。在我们的交易综述中，我们特别强调了特别值得注意的具体产品，整篇文章都致力于最好的亚马逊设备交易和最好的苹果设备交易。自然，一些最受欢迎的产品最终成为了最受欢迎的产品。(顺便说一句，我们感谢您对我们建议的信任。)。不要太深入零售商联盟网络的细枝末节，我们也会注意到，下面的项目只是基于周二的活动。\n无论如何，如果你一直想知道每个人实际上都从亚马逊的财源里买了什么，这里就是最受欢迎的黄金日特价。\n这不应该令人惊讶，但在亚洲人中，最受欢迎的黄金日交易本质上是免费货币。(你们一直都是一群精明的人。)。正如我们在我们50美元以下的最佳黄金日交易中所指出的那样，亚马逊正在进行一项促销活动，向获得至少40美元亚马逊礼品卡或将现有礼品卡余额至少充值40美元的Prime会员提供10美元的促销商店积分。", "note_en": "With Amazon Prime Day comes a flood of discounts, but in truth, only a fraction of those are worth buying. So we&#39;ve spent the last couple of days trying to pick out the  deals most worth your attention from Amazon&#39;s self-manufactured shopping holiday.\n With the event scheduled to end by tomorrow, though, we thought it&#39;d be fun to have our final Prime Day post share the most purchased items by readers here at Ars. To be clear: we absolutely do not (and can not) track individual buying habits, but we are able to see what&#39;s received the most attention in anonymized aggregate.\n Furthermore, don&#39;t take this as a scientific set of data. We&#39;ve highlighted specific products as especially noteworthy within our deal roundups, with entire articles dedicated to the  best Amazon device deals and the  best Apple device deals. Naturally, some of the products that got the most prominent call-outs wound up among the most popular. (We appreciate your faith in our recommendations, by the way.) Without getting too deep into the minutiae of retailer affiliate networks, we&#39;ll also note that the items below are only based on Tuesday&#39;s activity.\n Regardless, if you&#39;ve been curious to know what everyone is actually buying from Amazon&#39;s bonanza, here are the most popular Prime Day deals, according to you folks.\n  This shouldn&#39;t come as a surprise, but the most popular Prime Day deal among Arsians was, essentially, free money. (You&#39;ve always been a savvy bunch.) As we noted in our  best Prime Day deals under $50 roundup, Amazon is running a promotion that gives $10 in promotional store credit to Prime members who pick up at least $40 in Amazon gift cards or reload an existing gift card balance with at least $40.", "posttime": "2020-10-15 04:46:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,2020,读者,prime,活动", "title": "Ars读者选择的2020年最受欢迎的12笔黄金日交易", "title_en": "The 12 most popular Prime Day 2020 deals, as chosen by Ars readers", "transed": 1, "url": "https://arstechnica.com/staff/2020/10/the-12-most-popular-prime-day-2020-deals-as-chosen-by-ars-readers/", "via": "", "real_tags": ["交易", "2020", "读者", "prime", "活动"]}, {"category": "", "categoryclass": "", "imagename": "59617cbf77d95645d1e2046e3b18ef5b.jpg", "infoid": 1028885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着9月中旬iOS14的发布，数百万用户开始利用iOSwidget等新功能定制他们的iPhone主屏幕。作为这一趋势的一部分，用户还重新发现了如何使用苹果的快捷方式应用程序为他们最喜欢的应用程序创建自定义图标，以便与他们新的主屏幕美学相匹配。\n因此，在iOS 14发布后的几天和几周内，主屏幕定制应用程序一举登上了App Store的榜首。\n这一趋势似乎也不是昙花一现。今天，在撰写本文时，顶级定制小工具提供商Widgetsmith继续在App Store(非游戏)免费应用排行榜上排名第8。\n但是，虽然大多数新的定制应用程序都专注于创建你自己的iOS 14小部件，但那些帮助用户设计自己的图标集的应用程序更难找到。一些现有的应用程序进行了重组，以满足用户对图标的需求，如Launcher，而另一些应用程序则推出了付费图标市场，如Brass。\n与此同时，Mycons同时提供图标定制工具包和Option Purchase预制图标包。\n如果你想构建你自己的图标，你可以使用Mycons中的“Icon Studio”部分来开始。一些介绍性功能是免费提供的，9.99美元的一次性升级可以解锁全部功能。\nMycons开发者丹尼尔·麦卡锡解释说：“我想免费发布这款应用程序，提供一些基本的设计功能，这样用户就可以感受到东西是如何工作的，同时仍然可以让他们的主屏幕看起来很漂亮，而不会花掉他们辛辛苦苦赚来的钱，”Mycons的开发者丹尼尔·麦卡锡(Daniel McCarthy)解释说。\n一旦Icon Studio的全部定制功能被解锁，你会发现它们相当广泛。\n你可以选择实体、渐变，甚至是一张照片作为你的图标背景，也可以选择使用你购买的高级背景。\n如果您将自己的颜色设置为背景，Mycons允许您在使用颜色网格、光谱、调整滑块或输入特定的十六进制颜色编号之间进行选择，以获得准确的阴影。\n这款应用程序还包括一个可搜索的数据库，里面有数千个符号和徽标可供选择-包括你最常用的应用程序的符号，以及更难找到的通用符号，比如RSS符号。对于一些比较流行的应用程序，比如Facebook、Twitter、YouTube或Snapchat，你甚至可以找到几个不同的选择。\n然后，您可以选择将符号放置在中心、左上角或左下角，或者放置在右上角或右下角。您还可以调整元件的颜色、大小和透明度。\nMycons也使得一次创建一整套自定义图标变得很容易。\n设计图标模板样式后，可以切换选项“启用批量导出”来选择多个符号，然后将相同的背景应用于所有符号。然后点击“导出”按钮，一次将所有图标发送到您的Camera Roll。\n如果你不想建立自己的图标，Mycons也提供你可以买到的包。\n在与Icon Studio不同的一个标签中，Mycons允许你通过应用内一次性购买的方式从设计师那里购买图标包。这些图标的价格从7.99美元到9.99美元不等，并包括一套与自定义图标相匹配的背景(壁纸)。在某些情况下，这些也有多种颜色和样式可供选择。\n购买后，您可以将该样式与您自己的自定义图标设计一起使用。例如，这比从Etsy上购买图标包更有优势，在Etsy上，你只能得到一定数量的图标--但没有工具来构建自己的图标来匹配，以防你丢失了几个。\n在发布时，提供的设计仅来自三位创作者，Mycons开发商丹尼尔·麦卡锡、艺术家阿兰娜·拉内隆和画家兼摄影师詹娜·麦卡锡。\n现在这款应用程序已经上线，Mycons向其他设计师开放，他们可以通过应用程序的设置选项卡中的链接申请加入市场。\n然而，麦卡锡说，并不是所有的设计都会被接受。取而代之的是，市场将得到精心策划，以确保所有设计都是独特的和高质量的。\n麦卡锡之前曾是一名设计师，他说，他计划向Mycons的设计师合作伙伴提供他们想要的报酬：要么以具有竞争力的市场价格签订合同，要么作为销售额的百分比。\n如果图标包大受欢迎，但设计师选择了合同率选项，也会提供绩效奖金。\n麦卡锡解释说：“我总是努力做公平和正确的事情。”他说：“如果一个设计合作伙伴选择签约工作，而他们的设计最终获得了巨大的成功，我不会让他们受挫的。”\n设计师还将在这款应用中获得积分，如果他们愿意，还可以链接到自己的网站或社交媒体账户。通过这种方式，他们的Mycons Marketplace上市可以作为他们自己设计业务的领头羊。", "note_en": "With the  release of iOS 14 in mid-September, millions of users began to take advantage of new functionality like iOS widgets to customize their iPhone homescreens. As a part of this trend, users also rediscovered  how to use Apple’s Shortcuts app to create custom icons for their favorite apps in order to match their new homescreen aesthetic.\n As a result, homescreen customization apps  shot to the top of the App Store in the days and weeks following the iOS 14 launch.\n  The trend doesn’t seem to be a flash-in-the-pan, either. Today, top custom widget provider Widgetsmith continues to rank at No. 8 on the App Store’s (non-game) top free apps chart, as of the time of writing.\n But while most of the new customization apps focus on creating your own iOS 14 widgets, those that help users design their own icon sets are more difficult to find. Some existing apps have retooled to address user demand for icons, like  Launcher, while others have debuted paid icon marketplaces, like  Brass.\n Mycons, meanwhile, offers both an icon customization toolset and the option purchase premade icon packs.\n  If you want to build your own icons, you can use the “ Icon   Studio” section in Mycons to get started. Some introductory functionality is offered for free, and a one-time upgrade of $9.99 unlocks the full functionality.\n “I wanted to release the app with a handful of basic design features available for free, so users can get a feel for how things work and still be able to make their homescreens look beautiful, without coughing up their hard earned cash,” explains Mycons developer Daniel McCarthy.\n  Once the Icon Studio’s full customization capabilities are unlocked, you’ll find them to be fairly extensive.\n You can pick solids, gradients or even a photo as your icon background, or opt to use a premium background you’ve purchased.\n And if you’re setting your own color as the background, Mycons lets you choose between using a color grid, color spectrum, adjusting sliders or entering a specific Hex Color number to get exactly the right shade.\n The app also includes a searchable database with thousands of symbols and logos to choose from — including symbols for your most-used apps as well as harder-to-find generic symbols, like the RSS symbol, for instance. For some of the more popular apps — like Facebook, Twitter, YouTube or Snapchat, for example — you’ll even find a few different options to choose from.\n You can then choose to place the symbol in the center, the top or bottom left, or the top or bottom right. You can also adjust the symbol’s color, size and transparency.\n  Mycons makes it easy to create a whole set of custom icons at once, too.\n After you design your icon template style, you can toggle an option, “Enable Batch Export,” to select multiple symbols then apply the same background to all. You then tap the “Export” button to send all the icons to your Camera Roll at once.\n If you’re not up for building your own icons, Mycons also offers packs you can buy.\n In a separate tab from the Icon Studio, Mycons lets you shop icon packs from designers via one-time in-app purchases. These range in price from $7.99 to $9.99 and include a set of backgrounds (wallpapers) to match the custom icons. In some cases, these are available in multiple colors and styles, too.\n   Once purchased, you can use the style with your own custom icon designs. That’s an advantage over buying an icon pack off Etsy, for instance, where you only get a set number of icons — but no tools to build your own to match, in the case you’re missing a few.\n At launch, the designs offered come from just three creators,  Mycons developer Daniel McCarthy, artist  Alanna Ranellone, and painter and photographer  Jenna McCarthy.\n  Now that the app is live, Mycons is opening up to other designers who can apply to join the marketplace through a link in the Settings tab of the app.\n Not all designs will be accepted, however, McCarthy says. Instead, the marketplace will be curated to ensure all the designs are unique and high-quality.\n McCarthy, who previously worked as designer himself, says he plans to offer Mycons’ designer partners how they want to be paid: either as contract work at a competitive market rate or as a percentage of sales.\n A performance bonus will also be offered in the case that an icon pack becomes a hit, but the designer had opted for the contract rate option.\n “I always try to do what’s fair and right,” McCarthy explains. “If a design partner opts for contract work and their designs end up being wildly successful, I’m not going to let them get screwed,” he says.\n Designers will also be credited in the app and allowed to link out to their own websites or social media accounts, if they choose. In this way, their Mycons marketplace listing could serve as lead gen for their own design business.", "posttime": "2020-10-15 04:42:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,创建,easy,图标", "title": "\nMycons使您可以轻松地为iOS主屏幕创建和购买自定义图标", "title_en": "\n\t\t\t\tMycons makes it easy to create and buy custom icons for your iOS homescreen\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/mycons-makes-it-easy-to-create-and-buy-custom-icons-for-your-ios-homescreen/", "via": "", "real_tags": ["ios", "创建", "easy", "图标"]}]