[{"category": "", "categoryclass": "", "imagename": "0c83f00bfa02ff0e65a27e43ccd3423c.jpg", "infoid": 1069472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "波哥大，7 月 23 日（路透社） - 哥伦比亚周五批准了用于医疗和其他行业的干大麻出口，因为这个安第斯国家又迈出了一步发展其大麻产业，尽管潜力很大，但进展缓慢。伊万·杜克总统签署了一项解除大麻干花出口禁令的法令，投资者认为此举至关重要。该指令还允许扩大基于大麻的药物的销售并简化监管程序。虽然哥伦比亚被誉为监管大麻种子、植物和物质（如药用油、乳膏和提取物）的拥有、生产、分销、商业化和出口的先驱，但投资者长期以来一直抱怨他们所说的曲折的出口审批程序。 “这意味着哥伦比亚可以进入并在国际市场上发挥重要作用，”杜克在签署该法令后表示，并补充说新规则将允许哥伦比亚的大麻产业扩展到食品和饮料、化妆品等领域。大麻生产商 Khiron 负责监管问题的副总裁胡安·迭戈·阿尔瓦雷斯 (Juan Diego Alvarez) 告诉路透社：“取消对干花出口的禁令将启动一个监管程序，我们希望该程序能够非常详细地执行，达到最高的国际标准。哥伦比亚大麻产业协会 Asocolcanna 敦促该国抓住机遇，充分利用其竞争优势。\nAsocolcanna 在其网站上发表的一封信中说：“在全球大麻产业正在完善之际，哥伦比亚发挥其潜力至关重要。”在药用大麻行业监管较为成熟的国家，如美国、英国、德国和以色列，干大麻是市场最发达的部门，占所有销售额的50%以上。", "note_en": "BOGOTA, July 23 (Reuters) - Colombia on Friday gave the green light for exports of dried cannabis for medical and other industries, as the Andean country took another step to develop its marijuana industry, where progress has been slow despite high potential.\n President Ivan Duque signed a decree lifting a prohibition on exporting dried cannabis flower, a move seen as crucial by investors.\n The directive also allows for the expansion of sales of cannabis-based medicines and streamlines regulatory procedures.\n While Colombia has been hailed as a pioneer in regulating the possession, production, distribution, commercialization and export of seeds, plants and substances derived from cannabis - like oils, creams and extracts for medicinal purposes - investors have long complained about what they say is a tortuous export-approval process.\n &#34;This means Colombia can enter to play a big role in the international market,&#34; Duque said after signing the decree, adding the new rules would allow Colombia&#39;s cannabis industry to expand into food and drinks, cosmetics and other sectors.\n  &#34;Lifting the prohibition on exporting the dry flower will start a regulatory process which we hope will be performed in great detail, to the highest international standards,&#34; Juan Diego Alvarez, vice president of regulatory issues for cannabis producer Khiron, told Reuters.\n Colombian cannabis industry association Asocolcanna urged the country to seize the opportunity to make the most of its competitive advantages.\n &#34;It&#39;s crucial for Colombia to achieve its potential at a time when the global cannabis industry is being refined,&#34; Asocolcanna said in a letter published on its website.\n In countries where the medicinal cannabis industry has more mature regulation, like the United States, the United Kingdom, Germany and Israel, dried cannabis is the most developed sector of the market, accounting for more than 50% of all sales.", "posttime": "2021-07-24 23:34:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "取消,boosts,大麻", "title": "哥伦比亚通过取消干花出口禁令促进大麻产业的萌芽", "title_en": "Colombia boosts budding cannabis industry by removing ban on dry flower exports", "transed": 1, "url": "https://www.reuters.com/world/americas/colombia-boosts-budding-cannabis-industry-by-removing-ban-dry-flower-exports-2021-07-23/", "via": "", "real_tags": ["取消", "boosts", "大麻"]}, {"category": "", "categoryclass": "", "imagename": "34afa80e2a658d3608af0a50877a34f9.jpeg", "infoid": 1069471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周对 Datasette 的一个小改进：我添加了对通过 Unix 域套接字进行代理的支持。这最初是来自 Aslak Raanes 的功能请求：#1388：使用 UNIX 域套接字提供服务。我以前没有接触过这些，所以这是学习新东西的好机会。 Unix 域套接字提供了一种机制，机器上的不同进程可以通过类似于 TCP 的机制与每个进程进行通信，但通过文件路径代替。我之前在 Docker 守护进程中遇到过这些，它侦听路径 /var/run/docker.sock 并且可以像这样使用 curl 进行通信：如果单击“HTTP”选项卡，Docker 文档中有更多示例。事实证明，nginx 和 Apache 都能够将流量代理到 Unix 域套接字而不是 HTTP 端口，这使得它成为运行后端服务器而不将它们附加到 TCP 端口的有用机制。 Datasette 使用出色的 Uvicorn Python Web 服务器来提供开箱即用的流量，并且 Uvicorn 已经包含对 UDS 的支持——因此添加对 Datasette 的支持非常容易——这是完整的实现。我添加了一个新的 --uds 选项，所以现在你可以像这样运行 Datasette：\nDatasette 将在 /tmp/datasette.sock 上“监听”——这意味着您可以像这样通过 curl 运行请求：更重要的是，这意味着您可以像这样配置 nginx 或 Apache 来代理到 Datasette 服务器（nginx）： daemon off;事件 { worker_connections 1024;} http { 服务器 { 监听 80;位置 / { proxy_pass http://datasette; proxy_set_header 主机 $host; } } 上游数据集 { 服务器 unix:/tmp/datasette.sock; }} 实现只有几行代码（将 uds 选项传递给 Uvicorn）但添加测试证明更具挑战性。我使用这个 pytest 固定装置来启动服务器进程：@ pytest。夹具（范围 =“会话”）def ds_unix_domain_socket_server（tmp_path_factory）：socket_folder = tmp_path_factory。 mktemp(&quot;uds&quot;) uds = str(socket_folder / &quot;datasette.sock&quot;) ds_proc = subprocess. Popen( [ &quot;datasette&quot;, &quot;--memory&quot;, &quot;--uds&quot;, uds], stdout = subprocess.PIPE, stderr = subprocess.STDOUT, cwd = tempfile.gettempdir(), ) #给服务器时间启动时间。 sleep( 1.5) # 检查是否成功启动 assert not ds_proc.民意调查（），ds_proc。标准输出。读（）。 decode(&quot;utf-8&quot;) yield ds_proc, uds # 在 pytest 会话结束时关闭它 ds_proc. terminate() 我对其他一些测试使用了类似的模式，以练习 #1221 中添加的 --ssl-keyfile 和 --ssl-certfile 选项。测试本身看起来像这样，利用 HTTPX 对 Unix 域套接字进行调用的能力：\n@pytest。标记。串行@pytest。标记。 skipif( not hasattr( socket, &quot;AF_UNIX&quot;), reason = &quot;Requires socket.AF_UNIX support&quot;) def test_serve_unix_domain_socket(ds_unix_domain_socket_server): _, uds = ds_unix_domain_socket_server transport = httpx. HTTPTransport(uds = uds) 客户端 = httpx.客户端（传输 = 传输）响应 = 客户端。 get( &quot;http://localhost/_memory.json&quot;) assert { &quot;database&quot;: &quot;_memory&quot;, &quot;path&quot;: &quot;/_memory&quot;, &quot;tables&quot;: [], }. items() &lt;= 响应。 json()。 items() skipif 装饰器避免在不支持 Unix 域套接字的平台上运行此测试（我认为包括 Windows，请参阅此评论）。 @pytest.mark.serial 装饰器应用了一个“标记”，可用于有选择地运行测试。我这样做是因为 Datasette 的测试使用 pytest-xdist 在 CI 中运行，但这与这种启动临时服务器的方式不兼容。 Datasette 实际上在 GitHub Actions 中运行测试，如下所示： - name: Run tests run: | pytest -n auto -m &quot;not serial&quot; pytest -m &quot;serial&quot; pytest -n auto -m &quot;not serial&quot; 行使用 pytest-xdist 在自动选择的进程数上运行几乎所有测试，但跳过那些用@pytest.mark.serial 标记。然后第二行在没有任何额外并发的情况下运行剩余的串行测试。可以在代理文档后面的运行数据集中找到此功能的文档和示例配置。感谢 Aslak 提供有关 Apache 配置的注释。", "note_en": "A small enhancement to Datasette this week: I’ve added support for proxying via Unix domain sockets.\n This started out as a feature request from Aslak Raanes:  #1388: Serve using UNIX domain socket.\n I’ve not worked with these much before so it was a good opportunity to learn something new. Unix domain sockets provide a mechanism whereby different processes on a machine can communicate with each over over a mechanism similar to TCP, but via a file path instead.\n I’ve encountered these before with the Docker daemon, which listens on path  /var/run/docker.sock and can be communicated with using  curl like so:\n  Plenty more examples  in the Docker documentation if you click the ’HTTP’ tab.\n It turns out both nginx and Apache have the ability to proxy traffic to a Unix domain socket rather than to an HTTP port, which makes this a useful mechanism for running backend servers without attaching them to TCP ports.\n  Datasette uses the excellent  Uvicorn Python web server to serve traffic out of the box, and Uvicorn already  includes support for UDS—so adding support to Datasette was pretty easy—here’s  the full implementation. I’ve added a new  --uds option, so now you can run Datasette like this:\n  Datasette will “listen” on  /tmp/datasette.sock—which means you can run requests via  curl like so:\n  More importantly, it means you can configure nginx or Apache to proxy to the Datasette server like this (nginx):\n daemon  off; events {  worker_connections  1024;} http {  server {  listen  80;  location  / {  proxy_pass http://datasette;  proxy_set_header Host  $host; } }  upstream  datasette {  server unix:/tmp/datasette.sock; }}\n    The implementation was only a few lines of code (to pass the  uds option to Uvicorn) but adding a test proved a little more challenging. I used this pytest fixture to spin up a server process:\n @ pytest. fixture( scope = &#34;session&#34;) def  ds_unix_domain_socket_server( tmp_path_factory):  socket_folder  =  tmp_path_factory. mktemp( &#34;uds&#34;)  uds  =  str( socket_folder  /  &#34;datasette.sock&#34;)  ds_proc  =  subprocess. Popen( [ &#34;datasette&#34;,  &#34;--memory&#34;,  &#34;--uds&#34;,  uds],  stdout = subprocess. PIPE,  stderr = subprocess. STDOUT,  cwd = tempfile. gettempdir(), )  # Give the server time to start  time. sleep( 1.5)  # Check it started successfully  assert  not  ds_proc. poll(),  ds_proc. stdout. read(). decode( &#34;utf-8&#34;)  yield  ds_proc,  uds  # Shut it down at the end of the pytest session  ds_proc. terminate()\n I use a similar pattern  for some other tests, to exercise the  --ssl-keyfile and  --ssl-certfile options added in  #1221.\n The test itself looks like this, taking advantage of HTTPX’s ability to make calls against Unix domain sockets:\n @ pytest. mark. serial @ pytest. mark. skipif( not  hasattr( socket,  &#34;AF_UNIX&#34;),  reason = &#34;Requires socket.AF_UNIX support&#34;) def  test_serve_unix_domain_socket( ds_unix_domain_socket_server):  _,  uds  =  ds_unix_domain_socket_server  transport  =  httpx. HTTPTransport( uds = uds)  client  =  httpx. Client( transport = transport)  response  =  client. get( &#34;http://localhost/_memory.json&#34;)  assert {  &#34;database&#34;:  &#34;_memory&#34;,  &#34;path&#34;:  &#34;/_memory&#34;,  &#34;tables&#34;: [], }. items()  &lt;=  response. json(). items()\n The  skipif decorator avoids running this test on platforms which don’t support Unix domain sockets (which I think includes Windows, see  this comment).\n The  @pytest.mark.serial decorator applies a “mark” that can be used to selectively run the test. I do this because Datasette’s tests run in CI using  pytest-xdist, but that’s not compatible with this way of spinning up a temporary server. Datasette actually runs the tests in GitHub Actions  like so:\n -  name:  Run tests  run:  |  pytest -n auto -m &#34;not serial&#34;  pytest -m &#34;serial&#34;\n The  pytest -n auto -m &#34;not serial&#34; line runs almost all of the tests using  pytest-xdist across an automatically selected number of processes, but skips the ones marked with  @pytest.mark.serial. Then the second line runs the remaining serial tests without any additional concurrency.\n Documenation and example configuration for this feature can be found in the  Running Datasette behind a proxy documentation. Thanks to Aslak for contributing the notes on Apache configuration.", "posttime": "2021-07-24 23:34:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "unix,quot", "title": "Unix 域套接字的乐趣", "title_en": "Fun with Unix domain sockets", "transed": 1, "url": "https://simonwillison.net/2021/Jul/13/unix-domain-sockets/", "via": "", "real_tags": ["unix", "quot"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你让我说出 Python 最容易被误解的方面，我会毫不犹豫地回答：Python 导入系统。只要记住你使用了多少次相对导入并得到类似 ImportError 的东西：尝试相对导入而没有已知的父包；或者试图弄清楚如何构建一个项目，以便所有的导入都能正常工作；或者在找不到更好的解决方案时入侵 sys.path。每个 Python 程序员都经历过这样的事情，流行的 StackOverflow 问题，例如我们从不同文件夹导入文件（1822 票）、Python 3 中的相对导入（1064 票）和第 10 亿次相对导入（993 票），都是一个很好的指标其中。 Python 导入系统不仅看起来很复杂——它很复杂。因此，即使文档非常好，它也不能让您全面了解正在发生的事情。得到这样一张图的唯一方法是研究 Python 执行 import 语句时幕后发生的事情。这就是我们今天要做的。注意：在这篇文章中，我指的是 CPython 3.9。随着 CPython 的发展，一些实现细节肯定会发生变化。我将尝试跟踪重要更改并添加更新说明。在我们开始之前，让我向您展示我们计划的更详细版本。首先，我们将讨论导入系统的核心概念：模块、子模块、包、from &lt;&gt; import &lt;&gt; 语句、相对导入等。然后我们将对不同的导入语句进行脱糖，并看到它们最终都调用了内置的 __import__() 函数。最后，我们将研究 __import__() 的默认实现是如何工作的。我们走吧！你认为它有什么作用？您可能会说它导入了一个名为 m 的模块并将该模块分配给变量 m。你会是对的。但究竟什么是模块？什么被分配给变量？为了回答这些问题，我们需要给出更精确的解释：语句 import m 搜索名为 m 的模块，为该模块创建一个模块对象，并将模块对象分配给变量。看看我们如何区分模块和模块对象。我们现在可以定义这些术语。模块是 Python 认为是模块并知道如何为其创建模块对象的任何东西。这包括 Python 文件、目录和用 C 编写的内置模块等内容。我们将在下一节中查看完整列表。我们导入任何模块的原因是因为我们想要访问模块定义的函数、类、常量和其他名称。这些名称必须存储在某处，这就是模块对象的用途。模块对象是一个 Python 对象，它充当模块名称的命名空间。名称存储在模块对象的字典中（可用作 m.__dict__），因此我们可以将它们作为属性访问。\ntypedef struct { PyObject ob_base ； PyObject * md_dict ; struct PyModuleDef * md_def ;无效 * md_state ; PyObject * md_weaklist ; PyObject * md_name ; } PyModuleObject ; md_dict 字段存储模块的字典。其他领域对我们的讨论并不重要。 Python 为我们隐式地创建了模块对象。为了看看这个过程没有什么神奇之处，让我们自己创建一个模块对象。我们通常通过调用它们的类型来创建 Python 对象，比如 MyClass() 或 set()。模块对象的类型在 C 代码中是 PyModule_Type，但它在 Python 中不能作为内置对象使用。幸运的是，这种“不可用”的类型可以在 types 标准模块中找到： types 模块如何定义 ModuleType？它只是导入 sys 模块（任何模块都可以），然后在返回的模块对象上调用 type() 。我们也可以这样做： 无论我们如何获取 ModuleType，一旦获取，我们就可以轻松创建模块对象： 新创建的模块对象不是很有趣，但预初始化了一些特殊属性： 这些特殊属性主要是由导入系统本身使用，但有些也在应用程序代码中使用。例如，__name__ 属性通常用于获取当前模块的名称：\n请注意 __name__ 可用作全局变量。这种观察似乎很明显，但它至关重要。它来自于全局变量字典设置为当前模块的字典的事实：当前模块充当 Python 代码执行的命名空间。当 Python 导入一个 Python 文件时，它会创建一个新的模块对象，然后使用模块对象的字典作为全局变量的字典来执行文件的内容。类似地，Python 在直接执行 Python 文件时，首先会创建一个名为 __main__ 的特殊模块，然后将其字典用作全局变量的字典。因此，全局变量始终是某个模块的属性，从执行代码的角度来看，该模块被认为是当前模块。内置模块是编译成 python 可执行文件的 C 模块。由于它们是可执行文件的一部分，因此它们始终可用。这是他们的主要特点。 sys.builtin_module_names 元组存储它们的名称： $ python -q &gt;&gt;&gt; import sys &gt;&gt;&gt; sys 。内置模块名称（&#39;_abc&#39;、&#39;_ast&#39;、&#39;_codecs&#39;、&#39;_collections&#39;、&#39;_functools&#39;、&#39;_imp&#39;、&#39;_io&#39;、&#39;_locale&#39;、&#39;_operator&#39;、&#39;_peg_parser&#39;、&#39;_signal&#39;、&#39;_sre&#39;、 &#39;_stat&#39;, &#39;_string&#39;, &#39;_symtable&#39;, &#39;_thread&#39;, &#39;_tracemalloc&#39;, &#39;_warnings&#39;, &#39;_weakref&#39;, &#39;atexit&#39;, &#39;builtins&#39;, &#39;errno&#39;, &#39;faulthandler&#39;, &#39;gc&#39;, &#39;itertools &#39;, &#39;marshal&#39;, &#39;posix&#39;, &#39;pwd&#39;, &#39;sys&#39;, &#39;time&#39;, &#39;xxsubtype&#39;) 冻结模块也是 python 可执行文件的一部分，但它们是用 Python 编写的。 Python 代码被编译为代码对象，然后将编组后的代码对象合并到可执行文件中。冻结模块的示例是 _frozen_importlib 和 _frozen_importlib_external 。 Python 冻结它们是因为它们实现了导入系统的核心，因此不能像其他 Python 文件一样导入。 C 扩展有点像内置模块，也有点像 Python 文件。一方面，它们是用 C 或 C++ 编写的，并通过 Python/C API 与 Python 交互。另一方面，它们不是可执行文件的一部分，而是在导入期间动态加载。包括数组、数学和选择在内的一些标准模块是 C 扩展。许多其他的，包括 asyncio、heapq 和 json 都是用 Python 编写的，但在幕后调用了 C 扩展。从技术上讲，C 扩展是公开所谓的初始化函数的共享库。它们通常命名为 modname.so，但文件扩展名可能因平台而异。例如，在我的 macOS 上，这些扩展中的任何一个都可以使用：.cpython-39-darwin.so、.abi3.so、.so。在 Windows 上，您会看到 .dll 及其变体。 Python 字节码文件通常与常规 Python 文件一起位于 __pycache__ 目录中。它们是将 Python 代码编译为字节码的结果。更具体地说，.pyc 文件包含一些元数据，后跟模块的编组代码对象。它的目的是通过跳过编译阶段来减少模块的加载时间。 Python 导入 .py 文件时，首先会在 __pycache__ 目录中搜索对应的 .pyc 文件并执行。如果 .pyc 文件不存在，Python 会编译代码并创建文件。\n但是，如果我们不能直接执行和导入它们，我们就不会调用 .pyc 文件模块。令人惊讶的是，我们可以： $ ls module.pyc $ python module.pyc 我是 .pyc 文件 $ python -c &quot;import module&quot; 我是 .pyc 文件要了解有关 .pyc 文件的更多信息，请查看 PEP 3147 - - PYC 存储库目录和 PEP 552 - 确定性 pycs。正如我们稍后将看到的，我们可以自定义导入系统以支持更多类型的模块。所以任何东西都可以称为模块，只要 Python 可以为它创建一个模块对象给定模块名称。如果模块名称仅限于像 mymodule 或 utils 这样的简单标识符，那么它们都必须是唯一的，每次给新文件命名时，我们都必须非常认真地思考。出于这个原因，Python 允许模块有子模块和模块名称包含点。它首先导入模块 a 然后导入子模块 ab 它将子模块添加到模块的字典中并将模块分配给变量 a，因此我们可以将子模块作为模块的属性访问。可以有子模块的模块称为包。从技术上讲，包是具有 __path__ 属性的模块。这个属性告诉 Python 在哪里寻找子模块。当 Python 导入顶级模块时，它会在 sys.path 中列出的目录和 ZIP 存档中搜索该模块。但是当它导入一个子模块时，它使用父模块的 __path__ 属性而不是 sys.path。\n目录是将模块组织成包的最常见方式。如果一个目录包含一个 __init__.py 文件，它被认为是一个普通的包。当 Python 导入这样一个目录时，它会执行 __init__.py 文件，因此在那里定义的名称成为模块的属性。 __init__.py 文件通常为空或包含与包相关的属性，例如 __doc__ 和 __version__。它还可以用于将包的公共 API 与其内部实现分离。假设您开发了一个具有以下结构的库： 并且您想为库的用户提供两个函数：在 module1.py 中定义的 func1() 和在 module2.py 中定义的 func2()。如果您将 __init__.py 留空，那么用户必须指定子模块来导入函数： 这可能是您想要的，但您可能还希望允许用户导入这样的函数： 一个名为 C 扩展名的目录__init__.so 或带有名为 __init__.pyc 的 .pyc 文件也是一个常规包。 Python 可以完美地导入此类包：在 3.3 版本之前，Python 只有常规包。没有 __init__.py 的目录根本不被视为包。这是一个问题，因为人们不喜欢创建空的 __init__.py 文件。 PEP 420 通过在 Python 3.3 中引入命名空间包使这些文件变得不必要。命名空间包也解决了另一个问题。它们允许开发人员将包的内容放置在多个位置。例如，如果您有以下目录结构：\n而且mylibs和morelibs都在sys.path中，那么你可以像这样导入package1和package2：它是如何工作的？当 Python 在模块搜索期间遍历路径中的路径条目（ sys.path 或 parent 的 __path__ ）时，它会记住与模块名称匹配的没有 __init__.py 的目录。如果遍历所有条目后，找不到常规包、Python 文件或 C 扩展名，它会创建一个模块对象，其 __path__ 包含存储的目录。要求 __init__.py 的最初想法是防止名为 string 或 site 之类的目录遮蔽标准模块。命名空间包不会隐藏其他模块，因为它们在模块搜索期间的优先级较低。除了导入模块之外，我们还可以使用 from &lt;&gt; import &lt;&gt; 语句导入模块属性，如下所示： 该语句导入一个名为 module 的模块，并将指定的属性分配给相应的变量： 注意 module 变量在像被删除一样导入：当 Python 看到一个模块没有指定的属性时，它认为该属性是一个子模块并尝试导入它。因此，如果模块定义了 func 和 Class 但没有定义子模块，Python 将尝试导入 module.submodule。\n如果我们不想明确指定要从模块导入的名称，我们可以使用导入的通配符形式：此语句的工作方式就像将“*”替换为模块的所有公共名称一样。这些是模块字典中不以下划线“_”开头的名称或 __all__ 属性中列出的名称（如果已定义）。到目前为止，我们一直通过指定绝对模块名称来告诉 Python 要导入哪些模块。 from &lt;&gt; import &lt;&gt; 语句也允许我们指定相关的模块名称。下面是一些例子： .. 和 ..ab 之类的结构是相对的模块名称，但它们相对于什么？正如我们所说，Python 文件在当前模块的上下文中执行，该模块的字典充当全局变量的字典。当前模块与任何其他模块一样，可以属于一个包。这个包被称为当前包，这就是相对模块名称的相对关系。模块的 __package__ 属性存储模块所属的包的名称。如果模块是一个包，那么该模块属于它自己，而 __package__ 只是模块的名称（ __name__ ）。如果模块是子模块，则它属于父模块，并且 __package__ 设置为父模块的名称。最后，如果模块既不是包也不是子模块，那么它的包是未定义的。在这种情况下， __package__ 可以设置为空字符串（例如模块是顶级模块）或无（例如模块作为脚本运行）。相对模块名称是前面有一些点的模块名称。一个前导点代表当前包。所以，当 __package__ 被定义时，下面的语句：每个额外的点告诉 Python 从 __package__ 上移一级。如果 __package__ 设置为“ab”，则此语句：\n这是因为 Python 不会通过文件系统来解析相对导入。它只需要 __package__ 的值，去掉一些后缀并附加一个新后缀以获得绝对模块名称。显然，当 __package__ 根本没有定义时，相对导入就会中断。在这种情况下，您会收到以下错误：当您将相对导入作为脚本运行程序时，您最常看到它。由于您使用文件系统路径而不是模块名称指定要运行的程序，并且由于 Python 需要模块名称来计算 __package__，因此代码在 __main__ 模块中执行，其 __package__ 属性设置为 None。在运行具有相对导入的程序时避免导入错误的标准方法是使用 -m 开关将其作为模块运行： -m 开关告诉 Python 使用与导入期间相同的机制来查找模块。 Python 获取模块名称并能够计算当前包。例如，如果我们运行一个名为 package.module 的模块，其中 module 指的是一个常规的 .py 文件，那么代码将在 __main__ 模块中执行，其 __package__ 属性设置为“package”。您可以在文档和 PEP 338 中阅读有关 -m 开关的更多信息。好吧。这是一个热身。现在我们将看看当我们导入一个模块时到底发生了什么。如果我们对任何导入语句进行脱糖，我们将看到它最终调用了内置的 __import__() 函数。该函数接受一个模块名称和一堆其他参数，找到该模块并为其返回一个模块对象。至少，这是它应该做的。\nPython 允许我们将 __import__() 设置为自定义函数，因此我们可以完全改变导入过程。例如，这是一个破坏一切的更改： &gt;&gt;&gt; import builtins &gt;&gt;&gt;builtins 。 __import__ = None &gt;&gt;&gt; import math Traceback (最近一次调用最后一次): File &quot;&lt;stdin&gt;&quot;, line 1, in &lt;module&gt; TypeError: &#39;NoneType&#39; object is not callable 你很少看到人们因为其他原因覆盖 __import__()而不是记录或调试。默认实现已经提供了强大的自定义机制，我们将只关注它。 __import__() 的默认实现是 importlib.__import__()。嗯，这几乎是真的。 importlib 模块是一个标准模块，它实现了导入系统的核心。它是用 Python 编写的，因为导入过程涉及路径处理和其他你更喜欢用 Python 而不是 C 来做的事情。但出于性能原因，importlib 的一些函数被移植到 C 中。默认 __import__() 实际上调用了 importlib.__import__() 的 C 端口。出于我们的目的，我们可以放心地忽略差异并只研究 Python 版本。在我们这样做之前，让我们看看不同的导入语句如何调用 __import__()。要了解 import 语句的作用，我们可以查看为它生成的字节码，然后通过查看 Python/ceval.c 中的评估循环找出每个字节码指令的作用。 $ echo &quot;import m&quot; | python -m dis 1 0 LOAD_CONST 0 (0) 2 LOAD_CONST 1 (None) 4 IMPORT_NAME 0 (m) 6 STORE_NAME 0 (m)... 第一个 LOAD_CONST 指令将 0 压入值堆栈。第二个 LOAD_CONST 推送 None。然后 IMPORT_NAME 指令做了一些我们稍后会研究的事情。最后，STORE_NAME 将值堆栈顶部的值分配给变量 m。\ncase TARGET (IMPORT_NAME): { PyObject * name = GETITEM ( names , oparg ); PyObject * fromlist = POP(); PyObject * level = TOP(); PyObject * res ; res = import_name ( tstate , f , name , fromlist , level ); Py_DECREF（级别）； Py_DECREF ( fromlist ); SET_TOP ( res );如果（res == NULL）转到错误；派遣 （）;所有操作都发生在 import_name() 函数中。它调用 __import__() 来完成这项工作，但如果 __import__() 没有被覆盖，它会使用一个快捷方式并调用 importlib.__import__() 的 C 端口，称为 PyImport_ImportModuleLevelObject()。以下是代码中实现此逻辑的方式： static PyObject * import_name ( PyThreadState * tstate , PyFrameObject * f , PyObject * name , PyObject * fromlist , PyObject * level ) { _Py_IDENTIFIER ( __import__ ); PyObject * import_func , * res ; PyObject * 堆栈 [5]; import_func = _PyDict_GetItemIdWithError ( f -&gt; f_builtins , &amp; PyId___import__ ); if ( import_func == NULL ) { if ( !_PyErr_Occurred ( tstate )) { _PyErr_SetString ( tstate , PyExc_ImportError , &quot;__import__ not found&quot;);返回 NULL ； } /* 未重载 __import__ 的快速路径。 */ if ( import_func == tstate -&gt; interp -&gt; import_func ) { int ilevel = _PyLong_AsInt ( level ); if ( ilevel == - 1 &amp;&amp; _PyErr_Occurred ( tstate )) { return NULL ; res = PyImport_ImportModuleLevelObject ( name , f -&gt; f_globals , f -&gt; f_locals == NULL ? Py_None : f -&gt; f_locals , fromlist , ilevel );返回资源； } Py_INCREF ( import_func );堆栈 [0] = 名称；堆栈 [1] = f -&gt; f_globals ；堆栈 [2] = f -&gt; f_locals == NULL ？ Py_None : f -&gt; f_locals ;堆栈 [3] = 来自列表；堆栈 [4] = 级别； res = _PyObject_FastCall ( import_func , stack , 5 ); Py_DECREF ( import_func );返回资源；如果您仔细检查以上所有内容，您将能够得出以下结论： def __import__ ( name , globals = None , locals = None , fromlist = (), level = 0 ): &quot;&quot;&quot;Import a module . &#39;globals&#39; 参数用于推断从哪里发生导入以处理相对导入。&#39;locals&#39; 参数被忽略。&#39;fromlist&#39; 参数指定什么 sho ......", "note_en": "If you ask me to name the most misunderstood aspect of Python, I will answer without a second thought: the Python import system. Just remember how many times you used relative imports and got something like  ImportError: attempted relative import with no known parent package; or tried to figure out how to structure a project so that all the imports work correctly; or hacked  sys.path when you couldn&#39;t find a better solution. Every Python programmer experienced something like this, and popular StackOverflow questions, such us  Importing files from different folder (1822 votes),  Relative imports in Python 3 (1064 votes) and  Relative imports for the billionth time (993 votes), are a good indicator of that.\n The Python import system doesn&#39;t just seem complicated – it is complicated. So even though the  documentation is really good, it doesn&#39;t give you the full picture of what&#39;s going on. The only way to get such a picture is to study what happens behind the scenes when Python executes an import statement. And that&#39;s what we&#39;re going to do today.\n Note: In this post I&#39;m referring to CPython 3.9. Some implementation details will certainly change as CPython evolves. I&#39;ll try to keep track of important changes and add update notes.\n  Before we begin, let me present you a more detailed version of our plan. First, we&#39;ll discuss the core concepts of the import system: modules, submodules, packages,  from &lt;&gt; import &lt;&gt; statements, relative imports, and so on. Then we&#39;ll desugar different import statements and see that they all eventually call the built-in  __import__() function. Finally, we&#39;ll study how the default implementation of  __import__() works. Let&#39;s go!\n    What do you think it does? You may say that it imports a module named  m and assigns the module to the variable  m. And you&#39;ll be right. But what is a module exactly? What gets assigned to the variable? In order to answer these questions, we need to give a bit more precise explanation: the statement  import m searches for a module named  m, creates a module object for that module, and assigns the module object to the variable. See how we differentiated between a module and a module object. We can now define these terms.\n A  module is anything that Python considers a module and knows how to create a module object for. This includes things like Python files, directories and built-in modules written in C. We&#39;ll look at the full list in the next section.\n The reason why we import any module is because we want to get an access to functions, classes, constants and other names that the module defines. These names must be stored somewhere, and this is what module objects are for. A  module object is a Python object that acts as a namespace for the module&#39;s names. The names are stored in the module object&#39;s dictionary (available as  m.__dict__), so we can access them as attributes.\n  typedef  struct  {  PyObject  ob_base ;  PyObject  * md_dict ;  struct  PyModuleDef  * md_def ;  void  * md_state ;  PyObject  * md_weaklist ;  PyObject  * md_name ; }  PyModuleObject ;\n The  md_dict field stores the module&#39;s dictionary. Other fields are not really important for our discussion.\n Python creates module objects implicitly for us. To see that there is nothing magical about this process, let&#39;s create a module object ourselves. We usually create Python objects by calling their types, like  MyClass() or  set(). The type of a module object is  PyModule_Type in the C code but it&#39;s not available in Python as a built-in. Fortunately, such &#34;unavailable&#34; types can be found in the   types standard module:\n  How does the  types module define  ModuleType? It just imports the  sys module (any module will do) and then calls  type() on the module object returned. We can do it as well:\n  No matter how we get  ModuleType, once we get it, we can easily create a module object:\n  A newly created module object is not very interesting but has some special attributes preinitialized:\n  Most of these special attributes are mainly used by the import system itself, but some are used in the application code as well. The  __name__ attribute, for example, is often used to get the name of the current module:\n  Notice that  __name__ is available as a global variable. This observation may seem evident, but it&#39;s crucial. It comes from the fact that the dictionary of global variables is set to the dictionary of the current module:\n  The current module acts as a namespace for the execution of Python code. When Python imports a Python file, it creates a new module object and then executes the contents of the file using the dictionary of the module object as the dictionary of global variables. Similarly, when Python executes a Python file directly, it first creates a special module called  __main__ and then uses its dictionary as the dictionary of global variables. Thus, global variables are always attributes of some module, and this module is considered to be the  current module from the perspective of the executing code.\n    Built-in modules are C modules compiled into the  python executable. Since they are part of the executable, they are always available. This is their key feature. The   sys.builtin_module_names tuple stores their names:\n $ python -q &gt;&gt;&gt;  import  sys &gt;&gt;&gt;  sys . builtin_module_names (&#39;_abc&#39;, &#39;_ast&#39;, &#39;_codecs&#39;, &#39;_collections&#39;, &#39;_functools&#39;, &#39;_imp&#39;, &#39;_io&#39;, &#39;_locale&#39;, &#39;_operator&#39;, &#39;_peg_parser&#39;, &#39;_signal&#39;, &#39;_sre&#39;, &#39;_stat&#39;, &#39;_string&#39;, &#39;_symtable&#39;, &#39;_thread&#39;, &#39;_tracemalloc&#39;, &#39;_warnings&#39;, &#39;_weakref&#39;, &#39;atexit&#39;, &#39;builtins&#39;, &#39;errno&#39;, &#39;faulthandler&#39;, &#39;gc&#39;, &#39;itertools&#39;, &#39;marshal&#39;, &#39;posix&#39;, &#39;pwd&#39;, &#39;sys&#39;, &#39;time&#39;, &#39;xxsubtype&#39;)\n Frozen modules are too a part of the  python executable, but they are written in Python. Python code is  compiled to a code object and then the  marshalled code object is incorporated into the executable. The examples of frozen modules are  _frozen_importlib and  _frozen_importlib_external . Python freezes them because they implement the core of the import system and, thus, cannot be imported like other Python files.\n C extensions are a bit like built-in modules and a bit like Python files. On one hand, they are written in C or C++ and interact with Python via the  Python/C API. On the other hand, they are not a part of the executable but loaded dynamically during the import. Some standard modules including  array,  math and  select are C extensions. Many others including  asyncio,  heapq and  json are written in Python but call C extensions under the hood. Technically, C extensions are shared libraries that expose a so called  initialization function. They are usually named like  modname.so, but the file extension may be different depending on the platform. On my macOS, for example, any of these extensions will work:  .cpython-39-darwin.so,  .abi3.so,  .so. And on Windows, you&#39;ll see  .dll and its variations.\n Python bytecode files are typically live in a  __pycache__ directory alongside regular Python files. They are the result of compiling Python code to bytecode. More specifically, a  .pyc file contains some metadata followed by a marshalled code object of a module. Its purpose is to reduce module&#39;s loading time by skipping the compilation stage. When Python imports a  .py file, it first searches for a corresponding  .pyc file in the  __pycache__ directory and executes it. If the  .pyc file does not exist, Python compiles the code and creates the file.\n However, we wouldn&#39;t call  .pyc files modules if we couldn&#39;t execute and import them directly. Surprisingly, we can:\n $ ls module.pyc $ python module.pyc  I&#39;m a .pyc file $ python -c &#34;import module&#34; I&#39;m a .pyc file\n To learn more about  .pyc files, check out  PEP 3147 -- PYC Repository Directories and  PEP 552 -- Deterministic pycs.\n As we&#39;ll later see, we can customize the import system to support even more kinds of modules. So anything can be called a module as long as Python can create a module object for it given a module name.\n  If module names were limited to simple identifiers like  mymodule or  utils, then they all must have been unique, and we would have to think very hard every time we give a new file a name. For this reason, Python allows modules to have submodules and module names to contain dots.\n   it first imports the module  a and then the submodule  a.b. It adds the submodule to the module&#39;s dictionary and assigns the module to the variable  a, so we can access the submodule as a module&#39;s attribute.\n A module that can have submodules is called a  package. Technically, a package is a module that has a  __path__ attribute. This attribute tells Python where to look for submodules. When Python imports a top-level module, it searches for the module in the directories and ZIP archives listed in   sys.path. But when it imports a submodule, it uses the  __path__ attribute of the parent module instead of  sys.path.\n  Directories are the most common way to organize modules into packages. If a directory contains a  __init__.py file, it&#39;s considered to be a  regular package. When Python imports such a directory, it executes the  __init__.py file, so the names defined there become the attributes of the module.\n The  __init__.py file is typically left empty or contains package-related attributes such as  __doc__ and  __version__. It can also be used to decouple the public API of a package from its internal implementation. Suppose you develop a library with the following structure:\n  And you want to provide the users of your library with two functions:  func1() defined in  module1.py and  func2() defined in  module2.py. If you leave  __init__.py empty, then the users must specify the submodules to import the functions:\n  It may be something you want, but you may also want to allow the users to import the functions like this:\n    A directory with a C extension named  __init__.so or with a  .pyc file named  __init__.pyc is also a regular package. Python can import such packages perfectly fine:\n   Before version 3.3, Python had only regular packages. Directories without  __init__.py were not considered packages at all. And this was a problem because  people didn&#39;t like to create empty  __init__.py files.  PEP 420 made these files unnecessary by introducing  namespace packages in Python 3.3.\n Namespace packages solved another problem as well. They allowed developers to place contents of a package across multiple locations. For example, if you have the following directory structure:\n  And both  mylibs and  morelibs are in  sys.path, then you can import both  package1 and  package2 like this:\n    How does it work? When Python traverses path entries in the path ( sys.path or parent&#39;s  __path__) during the module search, it remembers the directories without  __init__.py that match the module&#39;s name. If after traversing all the entries, it couldn&#39;t find a regular package, a Python file or a C extension, it creates a module object whose  __path__ contains the memorized directories.\n The initial idea of requiring  __init__.py was to prevent directories named like  string or  site from shadowing standard modules. Namespace package do not shadow other modules because they have lower precedence during the module search.\n  Besides importing modules, we can also import module attributes using a  from &lt;&gt; import &lt;&gt; statement, like so:\n  This statement imports a module named  module and assign the specified attributes to the corresponding variables:\n  Note that the  module variable is not available after the import as if it was deleted:\n  When Python sees that a module doesn&#39;t have a specified attribute, it considers the attribute to be a submodule and tries to import it. So if  module defines  func and  Class but not  submodule, Python will try to import  module.submodule.\n  If we don&#39;t want to specify explicitly the names to import from a module, we can use the wildcard form of import:\n  This statement works as if  &#34;*&#34; was replaced with all the module&#39;s public names. These are the names in the module&#39;s dictionary that do not start with an underscore  &#34;_&#34; or the names listed in the  __all__ attribute if it&#39;s defined.\n  Up until now we&#39;ve been telling Python what modules to import by specifying absolute module names. The  from &lt;&gt; import &lt;&gt; statement allows us to specify relative module names as well. Here are a few examples:\n  The constructions like  .. and  ..a.b are relative module names, but what are they relative to? As we said, a Python file is executed in the context of the current module whose dictionary acts as a dictionary of global variables. The current module, as any other module, can belong to a package. This package is called the  current package, and this is what relative module names are relative to.\n The  __package__ attribute of a module stores the name of the package to which the module belongs. If the module is a package, then the module belongs to itself, and  __package__ is just the module&#39;s name ( __name__). If the module is a submodule, then it belongs to the parent module, and  __package__ is set to the parent module&#39;s name. Finally, if the module is not a package nor a submodule, then its package is undefined. In this case,  __package__ can be set to an empty string (e.g. the module is a top-level module) or  None (e.g. the module runs as a script).\n A relative module name is a module name preceded by some number of dots. One leading dot represents the current package. So, when  __package__ is defined, the following statement:\n   Each extra dot tells Python to move one level up from  __package__ . If  __package__ is set to  &#34;a.b&#34;, then this statement:\n       This is because Python does not move through the file system to resolve relative imports. It just takes the value of  __package__, strips some suffix and appends a new one to get an absolute module name.\n Obviously, relative imports break when  __package__ is not defined at all. In this case, you get the following error:\n  You most commonly see it when you run a program with relative imports as a script. Since you specify which program to run with a filesystem path and not with a module name, and since Python needs a module name to calculate  __package__, the code is executed in the  __main__ module whose  __package__ attribute is set to  None.\n  The standard way to avoid import errors when running a program with relative imports is to run it as a module using the  -m switch:\n  The  -m switch tells Python to use the same mechanism to find the module as during the import. Python gets a module name and is able to calculate the current package. For example, if we run a module named  package.module, where  module refers to a regular  .py file, then the code will be executed in the  __main__ module whose  __package__ attribute is set to  &#34;package&#34;. You can read more about the  -m switch in  the docs and in  PEP 338.\n Alright. This was a warm-up. Now we&#39;re going to see what exactly happens when we import a module.\n  If we desugar any import statement, we&#39;ll see that it eventually calls the built-in   __import__() function. This function takes a module name and a bunch of other parameters, finds the module and returns a module object for it. At least, this is what it&#39;s supposed to do.\n Python allows us to set  __import__() to a custom function, so we can change the import process completely. Here&#39;s, for example, a change that just breaks everything:\n &gt;&gt;&gt;  import  builtins &gt;&gt;&gt;  builtins . __import__  =  None &gt;&gt;&gt;  import  math Traceback (most recent call last): File  &#34;&lt;stdin&gt;&#34;, line  1, in  &lt;module&gt; TypeError:  &#39;NoneType&#39; object is not callable\n You rarely see people overriding  __import__() for reasons other than logging or debugging. The default implementation already provides powerful mechanisms for customization, and we&#39;ll focus solely on it.\n The default implementation of  __import__() is  importlib.__import__(). Well, it&#39;s almost true. The   importlib module is a standard module that implements the core of the import system. It&#39;s written in Python because the import process involves path handling and other things that you would prefer to do in Python rather than in C. But some functions of  importlib are ported to C for performance reasons. And default  __import__() actually calls a C port of  importlib.__import__(). For our purposes, we can safely ingore the difference and just study the Python version. Before we do that, let&#39;s see how different import statements call  __import__().\n    To see what an import statement does, we can look at the bytecode produced for it and then find out what each bytecode instruction does by looking at the  evaluation loop in   Python/ceval.c.\n  $ echo &#34;import m&#34; | python -m dis 1 0 LOAD_CONST 0 (0) 2 LOAD_CONST 1 (None) 4 IMPORT_NAME 0 (m) 6 STORE_NAME 0 (m)...\n The first   LOAD_CONST instruction pushes  0 onto the value stack. The second  LOAD_CONST pushes  None. Then the   IMPORT_NAME instruction does something we&#39;ll look into in a moment. Finally,   STORE_NAME assigns the value on top of the value stack to the variable  m.\n  case  TARGET ( IMPORT_NAME ) :  {  PyObject  * name  =  GETITEM ( names ,  oparg );  PyObject  * fromlist  =  POP ();  PyObject  * level  =  TOP ();  PyObject  * res ;  res  =  import_name ( tstate ,  f ,  name ,  fromlist ,  level );  Py_DECREF ( level );  Py_DECREF ( fromlist );  SET_TOP ( res );  if  ( res  ==  NULL )  goto  error ;  DISPATCH (); }\n All the action happens in the  import_name() function. It calls  __import__() to do the work, but if  __import__() wasn&#39;t overridden, it takes a shortcut and calls the C port of  importlib.__import__() called  PyImport_ImportModuleLevelObject(). Here&#39;s how this logic is implemented in the code:\n static  PyObject  * import_name ( PyThreadState  * tstate ,  PyFrameObject  * f ,  PyObject  * name ,  PyObject  * fromlist ,  PyObject  * level ) {  _Py_IDENTIFIER ( __import__ );  PyObject  * import_func ,  * res ;  PyObject *  stack [ 5 ];  import_func  =  _PyDict_GetItemIdWithError ( f -&gt; f_builtins ,  &amp; PyId___import__ );  if  ( import_func  ==  NULL )  {  if  ( ! _PyErr_Occurred ( tstate ))  {  _PyErr_SetString ( tstate ,  PyExc_ImportError ,  &#34;__import__ not found&#34; );  }  return  NULL ;  }  /* Fast path for not overloaded __import__. */  if  ( import_func  ==  tstate -&gt; interp -&gt; import_func )  {  int  ilevel  =  _PyLong_AsInt ( level );  if  ( ilevel  ==  - 1  &amp;&amp;  _PyErr_Occurred ( tstate ))  {  return  NULL ;  }  res  =  PyImport_ImportModuleLevelObject (  name ,  f -&gt; f_globals ,  f -&gt; f_locals  ==  NULL  ?  Py_None  :  f -&gt; f_locals ,  fromlist ,  ilevel );  return  res ;  }  Py_INCREF ( import_func );  stack [ 0 ]  =  name ;  stack [ 1 ]  =  f -&gt; f_globals ;  stack [ 2 ]  =  f -&gt; f_locals  ==  NULL  ?  Py_None  :  f -&gt; f_locals ;  stack [ 3 ]  =  fromlist ;  stack [ 4 ]  =  level ;  res  =  _PyObject_FastCall ( import_func ,  stack ,  5 );  Py_DECREF ( import_func );  return  res ; }\n If you carefully examine all of the above, you&#39;ll be able to conclude that this statement:\n     def  __import__ ( name ,  globals = None ,  locals = None ,  fromlist = (),  level = 0 ):  &#34;&#34;&#34;Import a module.  The &#39;globals&#39; argument is used to infer where the import is occurring from  to handle relative imports. The &#39;locals&#39; argument is ignored. The  &#39;fromlist&#39; argument specifies what sho\n......", "posttime": "2021-07-24 23:34:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,导入,import,模块", "title": "Python 导入系统的工作原理", "title_en": "How the Python import system works", "transed": 1, "url": "https://tenthousandmeters.com/blog/python-behind-the-scenes-11-how-the-python-import-system-works/", "via": "", "real_tags": ["python", "导入", "import", "模块"]}, {"category": "", "categoryclass": "", "imagename": "71363094c0fab8eded7016e839ed39f4.jpeg", "infoid": 1069469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "太阳能已经是最便宜的发电形式，随着技术和全球生产的更多改进，其成本将继续下降。现在，新的研究正在探索太阳能电池制造的另一个重大转折点。在澳大利亚，超过 200 万个屋顶安装了太阳能电池板（世界上人均最多）。面板中使用的主要材料是硅。硅构成了将阳光转化为电能所需的单个太阳能电池组件的大部分。但是还需要一些其他元素。我们在新南威尔士大学光伏与可再生能源工程学院的研究表明，在电池的硅中添加镓可以产生非常稳定的太阳能电池板，这些电池板在其使用寿命期间更不容易降解。这是下一代太阳能电池板的长期目标：让它们在其生命周期内产生更多的电力，这意味着从长远来看，系统产生的电力会更便宜。随着越来越多地使用镓来实现这一目标，我们的研究结果提供了可靠的数据，可以让制造商做出最终会对全球产生影响的决策。太阳能电池通过使用来自阳光的能量“脱离”硅中的负电荷或电子，将阳光转化为电能。然后将电子作为电收集。然而，将光照射在一块普通的硅上并不会产生电，因为从光中释放的电子并不都朝同一方向流动。为了使电流朝一个方向流动，我们需要创造一个电场。\n在硅太阳能电池中——目前为数百万澳大利亚家庭提供电力——这是通过向硅中添加不同的杂质原子来实现的，以创建一个比普通硅（n 型硅）具有更多负电荷的区域和一个具有更多负电荷的区域具有较少的负电荷（p 型硅）。当我们将硅的两部分放在一起时，我们就形成了所谓的“pn 结”。这允许太阳能电池运行。而在硅中加入杂质原子称为“掺杂”。形成硅 p 型部分最常用的原子是硼，负电荷比普通硅少。硼是一种很好的原子，因为它具有完成任务所需的确切电子数量。在太阳能电池所需的高纯度晶体的生产过程中，它也可以非常均匀地分布在硅中。但更残酷的是，将光线照射在硼填充的硅上会降低硅的质量。这通常被称为“光致退化”，在过去十年中一直是太阳能研究的热门话题。这种退化的原因比较好理解：我们在制作纯硅材料时，必须有目的地加入一些硼等杂质，以产生驱动电力的电场。然而，其他不需要的原子也因此被结合到硅中。其中一个原子是氧，它从坩埚中融入硅中——坩埚是提炼硅的大火锅。\n当光线照射在同时含有硼和氧的硅上时，它们会结合在一起，从而产生一个缺陷，该缺陷可以捕获电力并减少太阳能电池板产生的电量。不幸的是，这意味着为太阳能电池板供电的阳光也会在它们的生命周期中损坏它们。一种叫做镓的元素看起来可以解决这个问题。硼并不是我们可以用来制造 p 型硅的唯一元素。快速阅读元素周期表可以看到一整列元素的负电荷比硅少一个。将这些原子中的一个添加到硅中会破坏正电荷和负电荷之间的平衡，这是产生电场所必需的。在这些原子中，最合适的是镓。镓是一种非常适合制造 p 型硅的元素。事实上，多项研究表明它不会与氧气结合而导致降解。所以，你可能想知道，为什么我们一直没有使用镓？嗯，过去 20 年来我们一直坚持使用硼而不是镓的原因是用镓掺杂硅的过程被锁定在专利之下。这阻止了制造商使用这种方法。但这些专利最终在 2020 年 5 月到期。此后，行业迅速从硼转向镓制造 p 型硅。\n事实上，在 2021 年初，领先的光伏制造商韩华 Q Cells 估计，2021 年制造的所有太阳能电池板中约有 80% 使用了镓掺杂而不是硼——这是在如此短的时间内发生的巨大转变！我们研究了用掺镓硅制成的太阳能电池是否真的比用掺硼硅制成的太阳能电池更稳定。为了找到答案，我们使用“硅异质结”设计制造太阳能电池，这种方法导致迄今为止效率最高的硅太阳能电池。这项工作是与俄罗斯的 Hevel Solar 合作完成的。我们在 300,000 秒的光浸泡测试中测量了掺硼和掺镓太阳能电池的电压。由于硼与氧的结合，掺硼太阳能电池经历了显着的退化。同时，掺镓太阳能电池的电压要高得多。我们的结果还表明，使用镓制成的 p 型硅非常稳定，有助于为此类太阳能电池节省成本。考虑到制造商有可能大规模使用镓，生产更稳定且可能更便宜的太阳能电池，这是一个非常令人兴奋的前景。最好的部分是我们的发现可能会对行业产生直接影响。为我们的家庭提供更便宜的太阳能电力也意味着我们的星球更美好的未来。", "note_en": "Solar power is already the  cheapest form of electricity generation, and its cost will continue to fall as more improvements emerge in the technology and its global production. Now, new  research is exploring what could be another major turning point in solar cell manufacturing.\n In Australia, more than two million rooftops have solar panels (the most per capita in the world). The main material used in panels is silicon. Silicon makes up most of an individual solar cell’s components required to convert sunlight into power. But some other elements are also required.\n Research  from our group at the University of New South Wales’s School of  Photovoltaics and Renewable Energy Engineering shows that adding  gallium to the cell’s silicon can lead to very stable solar panels which are much less susceptible to degrading over their lifetime.\n This is the long-term goal for the next generation of solar panels: for them to produce more power over their lifespan, which means the electricity produced by the system will be cheaper in the long run.\n  As gallium is used more and more to achieve this, our findings provide robust data that could allow manufacturers to make decisions that will ultimately have a global impact.\n  A solar cell converts sunlight into electricity by using the energy from sunlight to “break away” negative charges, or electrons, in the silicon. The electrons are then collected  as electricity.\n However, shining light on a plain piece of silicon doesn’t generate electricity, as the electrons that are released from the light do not all flow in the same direction. To make the electricity flow in one direction, we need to create an electric field.\n    In silicon solar cells — the kind currently producing power for millions of Australian homes — this is done by adding different impurity atoms to the silicon, to create a region that has more negative charges than normal silicon (n-type silicon) and a region that has fewer negative charges (p-type silicon).\n When we put the two parts of silicon together, we form what is called a “p-n junction”. This allows the solar cell to operate. And the adding of impurity atoms into silicon is called “doping”.\n  The most commonly used atom to form the p-type part of the silicon, with less negative charge than plain silicon, is boron.\n Boron is a great atom to use as it has the exact number of electrons needed for the task. It can also be distributed very uniformly through the silicon during the production of the high-purity crystals required for solar cells.\n But in a cruel twist, shining light on boron-filled silicon can make the quality of the silicon degrade. This is often referred to as “light-induced degradation” and has been a hot topic in solar research over the past decade.\n The reason for this degradation is relatively well understood: when we make the pure silicon material, we have to purposefully add some impurities such as boron to generate the electric field that drives the electricity. However, other unwanted atoms are also incorporated into the silicon as a result.\n One of these atoms is oxygen, which is incorporated into the silicon from the crucible — the big hot pot in which the silicon is refined.\n When light shines on silicon that contains both boron and oxygen, they bond together, causing a defect that can trap electricity and reduce the amount of power generated by the solar panel.\n Unfortunately, this means the sunlight that powers solar panels also damages them over their lifetime. An element called gallium looks like it could be the solution to this problem.\n  Boron isn’t the only element we can use to make p-type silicon. A quick perusal of the periodic table shows a whole column of elements that have one less negative charge than silicon.\n Adding one of these atoms to silicon upsets the balance between the negative and positive charge, which is needed to make our electric field. Of these atoms, the most suitable is gallium.\n Gallium is a very suitable element to make p-type silicon. In fact, multiple studies  have shown it doesn’t bond together with oxygen to cause degradation. So, you may be wondering, why we haven’t been using gallium all along?\n Well, the reason we have been stuck using boron instead of gallium over the past 20 years is that the process of doping silicon with gallium was locked under a  patent. This prevented manufacturers using this approach.\n  But these patents finally expired in May 2020. Since then, the industry has rapidly shifted from boron to gallium to make p-type silicon.\n In fact, at the start of 2021, leading photovoltaic manufacturer Hanwha Q Cells estimated about 80% of all solar panels manufactured in 2021 used gallium doping rather than boron — a massive transition in such a short time!\n  We investigated whether solar cells made with gallium-doped silicon really are more stable than solar cells made with boron-doped silicon.\n To find out, we made solar cells using a “ silicon heterojunction” design, which is the approach that has led to the highest efficiency silicon solar cells to date. This work was done in collaboration with Hevel Solar in Russia.\n We measured the voltage of both boron-doped and gallium-doped solar cells during a light-soaking test for 300,000 seconds. The boron-doped solar cell underwent significant degradation due to the boron bonding with oxygen.\n Meanwhile, the gallium-doped solar cell had a much higher voltage. Our result also demonstrated that p-type silicon made using gallium is very stable and could help unlock savings for this type of solar cell.\n To think it might be possible for manufacturers to work at scale with gallium, producing solar cells that are both more stable and potentially cheaper, is a hugely exciting prospect.\n The best part is our findings could have a direct impact on industry. And cheaper solar electricity for our homes means a brighter future for our planet, too.", "posttime": "2021-07-24 23:33:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "光伏,excluded,太阳能", "title": "一项关于硅光伏电池的关键想法被一项专利排除了 20 年", "title_en": "A crucial idea for silicon PV cells was excluded by a patent for 20 years", "transed": 1, "url": "https://theconversation.com/the-sunlight-that-powers-solar-panels-also-damages-them-gallium-doping-is-providing-a-solution-164935", "via": "", "real_tags": ["光伏", "excluded", "太阳能"]}, {"category": "", "categoryclass": "", "imagename": "f1e8311bde09611f2b5b60abcba46aa9.jpg", "infoid": 1069467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "即使您根本不使用 Clubhouse 应用程序，您自己的号码也可能包含在泄漏中。整个会所数据库都可以在暗网上找到。至少有一位用户声称，他希望在 9 月份的私人拍卖会上出售该数据库。提供8300万个电话号码的免费样本，以便有兴趣的人可以检查数据的真实性。据提供商称，整个数据库有 38 亿个电话号码。这包括手机号码、固定电话号码、私人号码和公司电话号码。之所以出现如此大的数字，是因为 Clubhouse 讨论应用程序据称会秘密地实时同步所有用户的联系人。一旦在智能手机的通讯录中输入了新的电话号码，它也会被添加到会所数据库中。因此，Clubhouse 有许多从未安装过该应用程序或什至不知道该应用程序的人的电话号码。 Clubhouse 声称拥有超过 1000 万用户——远少于泄露的 38 亿电话号码。根据数据库卖家的说法，Clubhouse 使用这些数字作为评分系统。根据在用户智能手机上找到号码的频率，得分越高。 Clubhouse 希望确定个人和公司的网络水平。然后，这些信息可能会转售给广告和分析公司。\n从甚至不使用该服务的人那里收集数据的方法在某些国家/地区违反了数据保护法。事实上，这些数据也被用于可能出售给第三方公司的评论，这让事情变得更糟。在欧盟，通用数据保护条例 (GDPR) 禁止收集不使用该服务的个人数据。如果泄漏中的数据是真实的，欧盟将不得不进行干预并追究会所的责任。", "note_en": "Auch wenn man die Clubhouse-App gar nicht verwendet, kann die eigene Nummer im Leak enthalten sein.\n    Im  Darknet wird die gesamte Datenbank von  Clubhouse angeboten. Dies behauptet zumindest ein User, der die Datenbank im September bei einer privaten Auktion verkaufen will.\n  Damit Interessierte die Echtheit der Daten überprüfen können, wird eine  kostenlose Probe mit 83 Millionen Telefonnummern angeboten.\n  Laut dem Anbieter hat die gesamte Datenbank  3,8 Milliarden Telefonnummern. Dazu gehören Handynummern, Festnetznummer, Nummern von Privatpersonen und Firmentelefonnummer.\n    Die große Anzahl kommt zustande, weil die Diskussions-App Clubhouse angeblich  heimlich die Kontakte aller seiner User*innen in Echtzeit synchronisiert. Sobald eine neue Telefonnummer in den Kontakten am Smartphone eingetragen wird, wird auch diese in die Clubhouse-Datenbank aufgenommen.\n  Dadurch hat Clubhouse viele Telefonnummern von Personen, die die App noch nie installiert haben oder diese nicht einmal kennen. Clubhouse hat nach eigenen Angaben über  10 Millionen User*innen – also weit weniger als die geleakten 3,8 Milliarden Telefonnummern.\n    Laut dem Verkäufer der Datenbank nutzt Clubhouse die Nummern für ein  Scoring-System. Je nachdem wie oft eine Nummer auf den Smartphones der User*innen gefunden wird, desto höher das Scoring. So will Clubhouse das Level der Vernetzung für Privatpersonen und Unternehmen bestimmen. Diese Informationen sollen dann vermutlich Werbe- und Analysefirmen weiterverkauft werden.\n  Die Methode Daten von Personen zu sammeln, die den Service nicht mal nutzen, ist in einigen Ländern eine  Verletzung der Datenschutzgesetze. Dass diese Daten dann auch noch für Bewertungen genutzt werden, die womöglich Drittfirmen verkauft weren, macht die Sache noch schlimmer.\n  In der EU verbietet die Allgemeine Datenschutz-Verordnung –  General Data Protection Regulation (GDPR) – das Sammeln von Personendaten, die nicht den Dienst oder Service nutzen. Sollten sich die Daten in dem Leak als echt herausstellen, müsste die EU einschreiten und Clubhouse zur Rechenschaft ziehen.", "posttime": "2021-07-24 22:59:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "database,电话号码,source,应用程序", "title": "（外媒）整个会所电话号码库（38亿号码，包括联系人）在暗网上出售", "title_en": "(Foreign Source) The entire Clubhouse phonenumber database (3.8 billion numbers, including contacts) is up for sale on the darknet", "transed": 1, "url": "https://futurezone.at/apps/clubhouse-leakt-38-milliarden-telefonnummern-illegal/401453233", "via": "", "real_tags": ["database", "电话号码", "source", "应用程序"]}]