[{"category": "", "categoryclass": "", "imagename": "6003c74de391823d5141a450b25fecf9.jpg", "infoid": 1072564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "澳大利亚的悉尼西北数百英里的澳大利亚中央大教堂，今天由草和纤维树占主导地位。但科学家最近发现，一些地区的生锈岩石掩盖了郁郁葱葱的雨林的痕迹，这些雨林在中间时代纪念期间涵盖了1500万年前的茂密雨林。\n该网站还产生了十几个古老的arachnids。虽然昆虫具有坚固的外骨骼，迈克尔·弗雷泽，堪培拉大学的病毒学家和古生物学家以及该研究的共同作者，将蜘蛛比较“挤压袋”。因此，澳大利亚的蜘蛛化石记录几乎不存在，在麦格拉斯平坦之前。\n“研究这些化石生态系统，我们可以看到哪些物种更能够适应这些变化，”麦克拉特博士说。 “我们可以在未来的变化方面预测最多的风险。”", "note_en": "Australia’s Central Tablelands, hundreds of miles northwest of Sydney, are dominated today by grasses and spindly trees. But scientists recently discovered that some of the area’s rusted rocks conceal traces of the lush rainforests that covered the area 15 million years ago during the Miocene Epoch.\n The area, McGraths Flat, is not Australia’s only Miocene deposit, but these new fossils are a paleontological boon because of their exquisite preservation. Over the past three years paleontologists have excavated flowers, insects and even a bird’s wispy feather.\n The scientists’ discoveries,  published Friday in the journal Science Advances, help reconstruct Australia’s Miocene rainforest in extensive detail, and the site “opens a whole new area of exploration for Australian paleontology,” said Scott Hocknull, a paleontologist at Queensland Museum who was not involved in the research.\n Fifteen million years ago, a river carved through the jungle, leaving an oxbow lake (known as a billabong in Australia) in its wake at McGraths Flat. Nearly devoid of oxygen, this stagnant pool kept scavengers at bay, allowing plant material and animal carcasses to accumulate. As iron-rich runoff from nearby basalt mountains seeped into the billabong, the pool’s low pH caused the iron to precipitate and encase the organic material. As a result, the fossils at McGraths Flat are preserved in a dense, iron-rich rock known as goethite.\n  This method of fossilization is uncommon, Dr. Hocknull said. Because quality fossils are rarely found in igneous rocks, paleontologists often overlook them. However, the fossils from McGraths Flat illustrate that goethite, which is common in Australia, can yield remarkable fossils.\n “There’s no shortage of goethite,” Dr. Hocknull said. “We’re essentially a rusting country.”\n   Because of their iron-tinted origins, many of the fossils from McGraths Flat glimmer with a metallic sheen. In addition to pristine plants, the goethite is crawling with fossilized insects. As they split apart the brick-colored slabs of stone, the researchers have discovered a miniature menagerie of giant cicadas, dragonflies and parasitic wasps. And many are remarkably preserved — some ancient flies sport the detailed imprints of their compound eyes.\n The site has also yielded more than a dozen archaic arachnids. While insects have sturdy exoskeletons, Michael Frese, a virologist and paleontologist at the University of Canberra and a co-author of the study, likens spiders to “squishy bags of liquid.” As a result, Australia’s fossil record of spiders was nearly nonexistent before McGraths Flat.\n  The fossils are so well preserved that the paleontologists were able to observe relationships between species — something that is often difficult to parse from fossil sites, according to Matthew McCurry, the curator of paleontology at The Australian Museum and the study’s lead author. For example, the team observed parasites fastened to a fish’s tail and a nematode that had infiltrated a longhorn beetle.\n Dr. Frese utilized an electron microscope and microphotography techniques to examine the rainforest’s inhabitants. While imaging a fossilized sawfly, Dr. Frese discovered a clump of pollen on the bee-like insect’s head.\n “We can tell which flower was visited by this particular sawfly before it fell into the water and met its untimely end,” Dr. Frese said. “That would not be possible if the quality of preservation was not as high.”\n   The pollen also revealed that the rainforest was surrounded by drier environments, making it likely that McGraths Flat represents a remnant patch of a once larger forest. According to Dr. McCurry, this makes sense considering the climatic trends of the Miocene.\n When these insects scurried around the iron-tainted billabong, Australia was drifting northward, away from Antarctica. As it traveled, its climate drastically dried out, causing the rainforests to retract and leading to widespread extinctions.\n  The researchers believe McGraths Flat offers an intimate glimpse of how this dramatic climate transition affected particular species within the rainforest ecosystem. For instance, some insects found at McGraths Flat endured drier conditions while others are now found only in northern Australia’s remnant pockets of rainforest.\n “Studying these fossil ecosystems, we can see which species were better able to adapt to those changes,” Dr. McCurry said. “We can potentially predict which are most at risk in terms of future changes.”\n Dr. Frese said that McGraths Flat was particularly useful for reconstructing ancient ecosystems because of the breadth of species it preserved.\n “Our site is different because it’s all small fossils, but in the end, I think it will tell us more about what has happened in the ecosystem,” Dr. Frese said. “You do not need to find a one-ton terror bird to tell this story.”", "posttime": "2022-01-10 05:43:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,雨林,prehistoric,变化", "title": "史前雨林的化石在澳大利亚生锈的岩石里藏起来", "title_en": "Fossils of a Prehistoric Rainforest Hide in Australia’s Rusted Rocks", "transed": 1, "url": "https://www.nytimes.com/2022/01/07/science/fossils-australia-rainforest.html", "via": "", "real_tags": ["rust", "雨林", "变化"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1072563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我要带领技术校正线，然后解释一下：\n在90年代回来，我在大学工作，我像其他每位员工一样，在我的桌子上有一个没有壁的公共知识产权。我安装了一个web服务器和poof-instant网站。如今，从家里运行一个网站就是不可能的。您可能没有公共IP，如果您这样做，它可能会不时更改。即便如此，您的ISP可能会阻止您在其上运行服务器。\n您可以旅行地球，您的IP将跟随您：在飞机上，从大陆到大陆，无论何处。 yggdrasil会找到你。", "note_en": "I’m going to lead with the technical punch line, and then explain it:\n Yggdrasil Network is an opportunistic mesh that can be deployed privately or as part of a global-scale network. Each node gets a stable IPv6 address (or even an entire /64) that is derived from its public key and is bound to that node as long as the node wants it (of course, it can generate a new keypair anytime) and is valid wherever the node joins the mesh. All traffic is end-to-end encrypted.\n Yggdrasil will automatically discover peers on a LAN via broadcast beacons, and requires zero configuration to peer in such a way. It can also run as an overlay network atop the public Internet. Public peers serve as places to join the global network, and since it’s a mesh, if one device on your LAN joins the global network, the others will automatically have visibility on it also, thanks to the mesh routing.\n It neatly solves a lot of problems of portability (my ssh sessions stay live as I move networks, for instance), VPN (incoming ports aren’t required since local nodes can connect to a public peer via an outbound connection), security, and so forth.\n   Every device on the Internet, at one time, had its own globally-unique IP address. This number was its identifier to the world; with an IP address, you can connect to any machine anywhere. Even now, when you connect to a computer to download a webpage or send a message, under the hood, your computer is talking to the other one by IP address.\n Only, now it’s hard to get one. The Internet protocol we all grew up with, version 4 (IPv4), didn’t have enough addresses for the explosive growth we’ve seen. Internet providers and IT departments had to use a trick called NAT (Network Address Translation) to give you a sort of fake IP address, so they could put hundreds or thousands of devices behind a single public one. That, plus the mobility of devices — changing IPs whenever they change locations — has meant that a fundamental rule of the old Internet is now broken:\n  Nowadays, you can’t you host your own website from your phone. Or share files from your house. (Without, that is, the use of some third-party service that locks you down and acts as an intermediary.)\n Back in the 90s, I worked at a university, and I, like every other employee, had a PC on my desk with an unfirewalled public IP. I installed a webserver, and poof – instant website. Nowadays, running a website from home is just about impossible. You may not have a public IP, and if you do, it likely changes from time to time. And even then, your ISP probably blocks you from running servers on it.\n In short, you have to buy your way into the resources to participate on the Internet.\n I wrote about these problems in more detail in my article  Recovering Our Lost Free Will Online.\n  I already gave away the punch line at the top. But what does all that mean?\n  Every device that participates gets an IP address that is fully live on the Yggdrasil network.\n You can host a website, or a mail server, or whatever you like with your Yggdrasil IP.\n Encryption and authentication are smaller (though not nonexistent) worries thanks to the built-in end-to-end encryption.\n You can travel the globe, and your IP will follow you: onto a plane, from continent to continent, wherever. Yggdrasil will find you.\n  I’ve set up /etc/hosts on my laptop to use the Yggdrasil IPs for other machines on my LAN. Now I can just “ssh foo” and it will work — from home, from a coffee shop, from a 4G tether, wherever. Now, other tools like tinc can do this, obviously. And I could stop there; I could have a completely closed, private Yggdrasil network.\n Or, I can join the global Yggdrasil network. Each device, in addition to accepting peers it finds on the LAN, can also be configured to establish outbound peering connections or accept inbound ones over the Internet. Put a public peer or two in your configuration and you’ve joined the global network. Most people will probably want to do that on every device (because why not?), but you could also do that from just one device on your LAN. Again, there’s no need to explicitly build routes via it; your other machines on the LAN will discover the route’s existence and use it.\n This is one of many projects that are working to democratize and decentralize the Internet. So far, it has been quite successful, growing to over 2000 nodes. It is the direct  successor to the earlier cjdns/Hyperboria and BATMAN networks, and aims to be a proof of concept and a viable tool for global expansion.\n Finally, think about how much easier development is when you don’t have to necessarily worry about TLS complexity in every single application. When you don’t have to worry about port forwarding and firewall penetration. It’s what the Internet should be.", "posttime": "2022-01-10 05:42:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "互联网,instant,可能", "title": "使用即时网状网络再次使互联网成为您的互联网", "title_en": "Make the Internet Yours Again with an Instant Mesh Network", "transed": 1, "url": "https://changelog.complete.org/archives/10319-make-the-internet-yours-again-with-an-instant-mesh-network", "via": "", "real_tags": ["互联网", "instant", "可能"]}, {"category": "", "categoryclass": "", "imagename": "a5b1021ed57b979558f28e45aff8d6ab.jpg", "infoid": 1072562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "密码镜的镜子表明其创造者似乎试图因某种原因从互联网擦拭。", "note_en": "Mirror of the Cryptoland presentation that its creators seem to be trying to wipe from the Internet for some reason.", "posttime": "2022-01-10 05:42:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,removed,表明", "title": "cryptoland（从YouTube中删除）", "title_en": "Cryptoland (Removed from YouTube)", "transed": 1, "url": "https://peertube.social/videos/watch/8f7e61ed-47ab-4e82-a5c2-5a7d5e8bcb33", "via": "", "real_tags": ["youtube", "removed", "表明"]}, {"category": "", "categoryclass": "", "imagename": "8a6e23e2be414a9ea456de97aeda6d36.png", "infoid": 1072561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是时候解决了无尽的互联网辩论了。", "note_en": "It's time to settle the endless internet debates.", "posttime": "2022-01-10 05:40:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太久,debates,互联网", "title": "互联网辩论已经肆虐太久 - 让我们解决这个问题", "title_en": "Internet debates have raged for too long – Let's Settle This", "transed": 1, "url": "https://neal.fun/lets-settle-this/", "via": "", "real_tags": ["太久", "debates", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "f9e036cd5ad6e52351da07d63ac826ed.jpeg", "infoid": 1072560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个科学家团队正在航行到“世界上最难的地方”，所以他们可以更好地弄清楚，因为在南极洲的冰上脱离了全球变暖的全球变暖，海洋会崛起多少和快速。\n - 冰川的冰架碎入数百件骨折，如损坏的汽车挡风玻璃。这是Pettit表示，她担心的是六英里（10公里）长裂缝的最麻烦的是在一年内形成的。", "note_en": "A team of scientists is sailing to “the place in the world that’s the hardest to get to” so they can better figure out how much and how fast seas will rise because of  global warming eating away at Antarctica’s ice.\n Thirty-two scientists on Thursday are starting a more than two-month mission aboard an American research ship to investigate the crucial area where the massive but melting Thwaites glacier faces the Amundsen Sea and may eventually lose large amounts of ice because of warm water. The  Florida-sized glacier has gotten the nickname the “doomsday glacier” because of how much ice it has and how much seas could rise if it all melts — more than two feet (65 centimeters) over hundreds of years.\n Because of its importance, the United States and the United Kingdom are in the midst of  a joint $50 million mission to study Thwaites, the widest glacier in the world by land and sea. Not near any of the continent’s research stations, Thwaites is on Antarctica’s western half, east of the jutting Antarctic Peninsula, which used to be the area scientists worried most about.\n   “Thwaites is the main reason I would say that we have so large an uncertainty in the projections of future sea level rise and that is because it’s a very remote area, difficult to reach,” Anna Wahlin, an oceanographer from the University of Gothenburg in Sweden, said Wednesday in an interview from the  Research Vessel Nathaniel B. Palmer, which was scheduled to leave its port in Chile hours later. “It is configured in a way so that it’s potentially unstable. And that is why we are worried about this.”\n Thwaites is putting about 50 billion tons of ice into the water a year. The British Antarctic Survey says the glacier is responsible for 4% of global sea rise, and the conditions leading to it to lose more ice are accelerating, University of Colorado ice scientist Ted Scambos said from the McMurdo land station last month.\n Oregon State University ice scientist Erin Pettit said Thwaites appears to be collapsing in three ways:\n  — The land part of the glacier “is losing its grip” to the place it attaches to the seabed, so a large chunk can come off into the ocean and later melt.\n — The glacier’s ice shelf is breaking into hundreds of fractures like a damaged car windshield. This is what Pettit said she fears will be the most troublesome with six-mile (10-kilometer) long cracks forming in just a year.\n No one has stepped foot on the key ice-water interface at Thwaites before. In 2019, Wahlin was on a team that explored the area from a ship using a robotic ship but never went ashore.\n  Wahlin’s team will use two robot ships — her own large one called Ran which she used in 2019 and the more agile  Boaty McBoatface, the crowdsource named drone that could go further under the area of Thwaites that protrudes over the ocean — to get under Thwaites.\n The ship-bound scientists will be measuring water temperature, the sea floor and ice thickness. They’ll look at cracks in the ice, how the ice is structured and tag seals on islands off the glacier.\n Thwaites “looks different from other ice shelves,” Wahlin said. “It almost looks like a jumble of icebergs that have been pressed together. So it’s increasingly clear that this is not a solid piece of ice like the other ice shelves are, nice smooth solid ice. This was much more jagged and scarred.”\n      The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "posttime": "2022-01-10 05:37:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,探索,explore,冰架", "title": "科学家们探索南极洲的“世界末日”冰川", "title_en": "Scientists explore Thwaites, Antarctica's 'doomsday' glacier", "transed": 1, "url": "https://apnews.com/article/science-glaciers-antarctica-e9687077d7295e8218ba7cbcb9246ca3", "via": "", "real_tags": ["科学家", "探索", "explore", "冰架"]}, {"category": "", "categoryclass": "", "imagename": "0c392ee064aadc07432aaace074c45ff.jpeg", "infoid": 1072559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日本游戏配件公司Bauhütte拥有一个舒适的连帽衫，带有一个偎依的前袋，让人类在工作，游戏或只是放松时让人们保持近在咫尺。 Nyangaroo Gamer连帽衫将日语单词与Kangaroo的英文单词相结合 - 因此“Nyangaroo”。", "note_en": "Japanese game accessory company  Bauhütte has come up with a comfy hoodie with a snuggly front pocket that lets humans keep their cat close at hand while working, gaming, or just relaxing. The  Nyangaroo Gamer Hoodie combines the Japanese word for cat (nyan) with the English word for kangaroo – hence “nyangaroo”.\n (translated) Nyangaroo Parker® fulfills the wishes of cat-owning gamers. Equipped with a large pocket for cats, it is possible to stay together for a long time. Cats who love small and warm places and humans who can enjoy the cute appearance while playing games with both free hands can be satisfied with each other.\n The hood also sports cat ears, paw designs on the sleeves, and features a pouch that folds out to accommodate a house cat of any size. The hoodie is made of a blend of 60% cotton and 40% polyester and comes in either  gray or  black.", "posttime": "2022-01-10 05:37:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pouch,游戏", "title": "一个连帽衫，带着猫的猫，在他们的人工工作时依偎在里面", "title_en": "A Hoodie with a Pouch for Cats to Snuggle Inside While Their Human Is Working", "transed": 1, "url": "https://laughingsquid.com/hoodie-with-pouch-for-cats/", "via": "", "real_tags": ["pouch", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "©2022美国科学进步协会。版权所有。 AAAS是Hinari，Agora，Oare，合唱，钟表，十字架和柜台的合作伙伴。", "note_en": "© 2022 American Association for the Advancement of Science. All rights reserved. AAAS is a partner of HINARI, AGORA, OARE, CHORUS, CLOCKSS, CrossRef and COUNTER.", "posttime": "2022-01-10 04:40:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "涂层,coating,hinari", "title": "新的熔岩样涂层可以在轨道上停止火灾", "title_en": "New Lava-Like Coating Can Stop Fires In Their Tracks", "transed": 1, "url": "https://www.science.org/action/cookieAbsent", "via": "", "real_tags": ["涂层", "coating", "hinari"]}, {"category": "", "categoryclass": "", "imagename": "d33f0fc4936d2e42636ddd12ed07947d.jpg", "infoid": 1072557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "印度竞争委员会周五表示，谷歌占据了某些在线服务及其初步观点是谷歌已经破坏了当地的反托拉斯法，并指出了法国和澳大利亚的新规则，该公司被要求进入“公平/诚信”谈判“有新闻出版商用于支付的内容许可，以解决”两者之间的讨价还价权力不平衡，并通过谷歌的不公平条件。“\n周五的调查是印度竞赛看门狗近期订购的一系列探头的最新探针。去年年底，CCI订购了Apple如何运行App Store的调查，成为最新的国家瞄准美国技术巨头。", "note_en": "The Competition Commission of India said Friday that Google dominates certain online services and its initial view is that Google has broken the local antitrust laws and pointed to  new rules in France and Australia, where the firm  has been asked to enter into “fair/good faith negotiation” with news publishers for paid licensing of content to address the “bargaining power imbalance between the two and the resultant imposition of unfair conditions by Google.”\n “The allegations of the informant, when seen in this vertically integrated ecosystem operated by Google, makes it prima facie appear that news publishers have no choice but to accept the terms and conditions imposed by Google. Google appears to operate as a gateway between various news publishers on the one hand and news readers on the other. Another alternative for the news publisher is to forgo the traffic generated by Google for them, which would be unfavourable to their revenue generation,” the CCI said in its 21-page order.\n  The probe follows a complaint from Digital News Publishers Association, which consists of the digital arms of some of India’s biggest media firms. The association said their members get more than half of their traffic from online search engines, a category Google clearly commands, and the market-leading position has allowed Google to force the publishers into several unfavorable terms.\n In a wide-ranging complaint, the association said Google displaying snippets of news items limits the number of visitors to news outlets and impacts the ad revenue “while Google continue[s] to earn ad revenue on its result page” as well as enriches “its search algorithm resulting from the volume of search queries.”\n “It has also been averred that the terms of the agreements entered between the members of the Informant [news publishers] and the OPs [Google and its subsidiaries] for sharing the advertisement revenues are unilaterally and arbitrarily dictated by the OPs, and the members of the Informant have no other option but to accept the terms, as they are, with no bargaining power whatsoever,” the watchdog said.\n “The only alternate to the AMP system is for publishers to subscribe with Google, which benefits Google, to the detriment of the publishers,” the watchdog said. The association accused that Google is forcing them to use its  AMP format, which has implications on their revenue.\n   “In a well-functioning democracy, the critical role played by news media cannot be undermined, and it needs to be ensured that digital gatekeeper firms do not abuse their dominant position to harm the competitive process of determining a fair distribution of revenue amongst all stakeholders,” the watchdog added.\n Friday’s investigation is the latest of a series of probes the Indian competition watchdog has ordered in recent weeks. Late last year, the CCI ordered an investigation into  how Apple runs its App Store, becoming the most recent country to take aim at the American technology giant.", "posttime": "2022-01-10 04:40:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,rust,新闻,news", "title": "印度的反托拉斯看门狗在新闻出版商投诉后订购了谷歌的调查，该公司正在滥用其新闻汇总统治", "title_en": "India's antitrust watchdog orders an investigation into Google after complaints from news publishers that the company is abusing its news aggregation dominance", "transed": 1, "url": "https://techcrunch.com/2022/01/07/india-hits-google-with-antitrust-investigation-over-alleged-abuse-in-news-aggregation/", "via": "", "real_tags": ["谷歌", "google", "rust", "新闻", "news"]}, {"category": "", "categoryclass": "", "imagename": "956f7aedd5d05cc39ddff423d2817ecd.jpg", "infoid": 1072556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司普遍预计今年将从其第一个混合现实耳机中取出包装，重点是增强现实和虚拟现实体验。虽然许多公司 - 包括Meta  - 在“偏见”的想法上涨了一倍，今天的一个新报告表明苹果的重点是相反的。", "note_en": "Apple is  widely expected to take the wraps off of its first mixed reality headset this year, with a focus on augmented reality and virtual reality experiences. While many companies — including Meta — are doubling down on the idea of a “metaverse,” a new report today indicates that Apple’s focus is quite the opposite.\n  In the latest edition of his  Power On newsletter,  Bloomberg’s Mark Gurman reports that he’s been told “pretty directly” that the idea of a “metaverse” is “off limits” internally at Apple. This, of course, is a stark difference from the strategy of companies like Facebook (now Meta).\n Here’s one word I’d be shocked to hear on stage when Apple announces its headset: metaverse. I’ve been told pretty directly that the idea of a completely virtual world where users can escape to — like they can in Meta Platforms/Facebook’s vision of the future — is off limits from Apple.\n Instead, Apple’s focus is said to be on a mixed reality headset that is used for “bursts of gaming, communication and content consumption,” but it will not be “an all-day device.”\n Current rumors indicate that Apple’s first augmented reality and virtual reality headset could be announced as soon as this year. It’s  expected to feature a high-tech design with an innovative three-display configuration. It’s also expected to be more expensive than the competition, with a  rumored of around $3,000.\n What do you think of Apple’s strategy for augmented and virtual reality? Do you prefer its strategy or the strategy of companies like Meta/Facebook? Let us know down in the comments!\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2022-01-10 04:38:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,apple,现实", "title": "古尔曼：Apple即将到来的混合现实耳机不会是一家全天设备，将用于游戏，通信和内容消费爆发", "title_en": "Gurman: Apple's upcoming mixed reality headset will not be an all-day device and will be used for bursts of gaming, communication, and content consumption", "transed": 1, "url": "https://9to5mac.com/2022/01/09/apple-headset-no-metaverse/", "via": "", "real_tags": ["游戏", "apple", "现实"]}, {"category": "", "categoryclass": "", "imagename": "e393682f99e8dc906537e64b863e1109.png", "infoid": 1072555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简单明确的手工制作的SVG图标库。", "note_en": "The Simple and Definitive hand-crafted SVG Icons Library.", "posttime": "2022-01-10 04:35:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,svg,open,制作", "title": "iconoir  - 一个开源svg图标库", "title_en": "Iconoir – An Open-Source SVG Icons Library", "transed": 1, "url": "https://iconoir.com/", "via": "", "real_tags": ["开源", "svg", "open", "制作"]}, {"category": "", "categoryclass": "", "imagename": "d42c461d126c7b27e136ded7cc2dca76.png", "infoid": 1072554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Awkcc是一个awk-to-c transcompiler。它最初由Chris Ramming实施，然后在贝尔实验室，大约1988年。", "note_en": "awkcc is an awk-to-C transcompiler. It was originally implemented by Chris Ramming,then at Bell Labs, circa 1988.\n The intent of this repo is to make the source code of awkcc public for historicalpurposes. This code is not being further developed or maintained.\n  The repo contains two snapshots of the source code in the  1998 and 2011 folders. Both snapshots contain the complete codebase of awkccat the given time. The codebase includes the original documentation.", "posttime": "2022-01-10 04:34:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "awk,chris", "title": "AWKCC：AWK-TO-C Transcompiler（1988,2011）", "title_en": "awkcc: awk-to-C transcompiler (1988, 2011)", "transed": 1, "url": "https://github.com/nokia/awkcc", "via": "", "real_tags": ["awk", "chris"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "艺术家在梦想的最后一年中，一颗红色超级明星的印象在散热的气体云的最后一年中。这表明这些星星中的至少一些在持续超新星之前经历了重大的内部变化。\n“Keck是有助于提供直接证据表明，直接证据过渡到超新星爆炸，”UC伯克利天文学副教授Raffaella Margutti说。 “这就像看滴答作响时间炸弹。我们从未在垂死的红色超巨星中确认这种暴力活动，我们看到它产生这种发光发光，然后崩溃和燃烧，直到现在。“\n深度成像和多物体光谱仪（Deimos）拥有任何keck天文台仪器的最大视野（16.7arcmin到5 arcmin），以及最大的像素数（64 mpix）。它主要用于其多目标模式，获得多达130个星系或恒星的同时光谱。天文学家与Deimos研究遥远星系的领域，有效地探测宇宙最遥远的角落，具有高灵敏度。", "note_en": "an artist’s impression of a red supergiant star in the final year of its life emitting a tumultuous cloud of gas. this suggests at least some of these stars undergo significant internal changes before going supernova.\n   Haleakalā and Maunakea, Hawai ʻ i  – For the very first time, astronomers have imaged in real time the dramatic end to a red supergiant’s life, watching the massive star’s rapid self-destruction and final death throes before it collapsed into a Type II supernova.\n Using two Hawaiʻi telescopes – the University of Hawaiʻi Institute for Astronomy Pan-STARRS on Haleakalā, Maui and W. M. Keck Observatory on Maunakea, Hawaiʻi Island – a team of researchers conducting the Young Supernova Experiment (YSE) transient survey observed the red supergiant during its last 130 days leading up to its deadly detonation.\n “This is a breakthrough in our understanding of what massive stars do moments before they die,” says Wynn Jacobson-Galán, an NSF Graduate Research Fellow at UC Berkeley and lead author of the study. “Direct detection of pre-supernova activity in a red supergiant star has never been observed before in an ordinary Type II supernova. For the first time, we watched a red supergiant star explode!”\n  Pan-STARRS first detected the doomed massive star in Summer of 2020 via the huge amount of light radiating from the red supergiant. A few months later, in Fall of 2020, a supernova lit the sky.\n The team quickly captured the powerful flash and obtained the very first spectrum of the energetic explosion, named supernova 2020tlf, or SN 2020tlf, using Keck Observatory’s Low Resolution Imaging Spectrometer (LRIS). The data showed direct evidence of dense circumstellar material surrounding the star at the time of explosion, likely the same exact gas that Pan-STARRS had imaged the red supergiant star violently ejecting earlier in the summer.\n   An artist’s rendition of a red supergiant star transitioning into a Type II supernova, emitting a violent eruption of radiation and gas on its dying breath before collapsing and exploding. Credit: W. M. Keck Observatory/Adam Makarenko\n  “Keck was instrumental in providing direct evidence of a massive star transitioning into a supernova explosion,” says senior author Raffaella Margutti, an associate professor of astronomy at UC Berkeley. “It’s like watching a ticking time bomb. We’ve never confirmed such violent activity in a dying red supergiant star where we see it produce such a luminous emission, then collapse and combust, until now.”\n The team continued to monitor SN 2020tlf after the explosion; based on data obtained from Keck Observatory’s DEep Imaging and Multi-Object Spectrograph (DEIMOS) and Near Infrared Echellette Spectrograph (NIRES), they determined SN 2020tlf’s progenitor red supergiant star, located in the NGC 5731 galaxy about 120 million light-years away as seen from Earth, was 10 times more massive than the Sun.\n The discovery defies previous ideas of how red supergiant stars evolve right before blowing up. Prior to this, all red supergiants observed before exploding were relatively quiescent: they showed no evidence of violent eruptions or luminous emission, as was observed prior to SN 2020tlf. However, this novel detection of bright radiation coming from a red supergiant in the final year before exploding suggests that at least some of these stars must undergo significant changes in their internal structure that then results in the tumultuous ejection of gas moments before they collapse.\n Margutti and Jacobson-Galán conducted most of the study during their time at Northwestern University, with Margutti serving as an Associate Professor of Physics and Astronomy and member of CIERA (Center for Interdisciplinary Exploration and Research in Astrophysics), and Jacobson-Galán as a graduate student.\n The team’s discovery paves a path forward for transient surveys like YSE to hunt for luminous radiation coming from red supergiants, and gather more evidence that such behavior could signal the imminent, supernova demise of a massive star.\n “I am most excited by all of the new ‘unknowns’ that have been unlocked by this discovery,” says Jacobson-Galán. “Detecting more events like SN 2020tlf will dramatically impact how we define the final months of stellar evolution, uniting observers and theorists in the quest to solve the mystery on how massive stars spend the final moments of their lives.”\n   The Low Resolution Imaging Spectrometer (LRIS) is a very versatile and ultra-sensitive visible-wavelength imager and spectrograph built at the California Institute of Technology by a team led by Prof. Bev Oke and Prof. Judy Cohen and commissioned in 1993. Since then it has seen two major upgrades to further enhance its capabilities: the addition of a second, blue arm optimized for shorter wavelengths of light and the installation of detectors that are much more sensitive at the longest (red) wavelengths. Each arm is optimized for the wavelengths it covers. This large range of wavelength coverage, combined with the instrument’s high sensitivity, allows the study of everything from comets (which have interesting features in the ultraviolet part of the spectrum), to the blue light from star formation, to the red light of very distant objects. LRIS also records the spectra of up to 50 objects simultaneously, especially useful for studies of clusters of galaxies in the most distant reaches, and earliest times, of the universe. LRIS was used in observing distant supernovae by astronomers who received the Nobel Prize in Physics in 2011 for research determining that the universe was speeding up in its expansion.\n  The DEep Imaging and Multi-Object Spectrograph (DEIMOS) boasts the largest field of view (16.7arcmin by 5 arcmin) of any of the Keck Observatory instruments, and the largest number of pixels (64 Mpix). It is used primarily in its multi-object mode, obtaining simultaneous spectra of up to 130 galaxies or stars. Astronomers study fields of distant galaxies with DEIMOS, efficiently probing the most distant corners of the universe with high sensitivity.\n  The Near Infrared Echellette Spectrograph (NIRES) is a prism cross-dispersed near-infrared spectrograph built at the California Institute of Technology by a team led by Chief Instrument Scientist Keith Matthews and Prof. Tom Soifer. Commissioned in 2018, NIRES covers a large wavelength range at moderate spectral resolution for use on the Keck II telescope and observes extremely faint red objects found with the Spitzer and WISE infrared space telescopes, as well as brown dwarfs, high-redshift galaxies, and quasars. Support for this technology was generously provided by the Mt. Cuba Astronomical Foundation.\n  The W. M. Keck Observatory telescopes are among the most scientifically productive on Earth. The two 10-meter optical/infrared telescopes atop Maunakea on the Island of Hawaiʻi feature a suite of advanced instruments including imagers, multi-object spectrographs, high-resolution spectrographs, integral-field spectrometers, and world-leading laser guide star adaptive optics systems. Some of the data presented herein were obtained at Keck Observatory, which is a private 501(c) 3 non-profit organization operated as a scientific partnership among the California Institute of Technology, the University of California, and the National Aeronautics and Space Administration. The Observatory was made possible by the generous financial support of the W. M. Keck Foundation. The authors wish to recognize and acknowledge the very significant cultural role and reverence that the summit of Maunakea has always had within the Native Hawaiian community. We are most fortunate to have the opportunity to conduct observations from this mountain.", "posttime": "2022-01-10 04:33:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "见证,witness,deimos", "title": "天文学家见证着垂死的明星达到爆炸性的结局", "title_en": "Astronomers Witness a Dying Star Reach Its Explosive End", "transed": 1, "url": "https://keckobservatory.org/dying-star/", "via": "", "real_tags": ["见证", "witness", "deimos"]}, {"category": "", "categoryclass": "", "imagename": "eacd6db4f090f9a8c3c6d49130509437.png", "infoid": 1072552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "RSS源可用于许多GovInfo集合，通常包括发布的100个最新的文件。", "note_en": "RSS feeds are available for many govinfo collections and generally include the 100 most recent documents published.", "posttime": "2022-01-10 04:32:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "feeds,govinfo", "title": "RSS源对政府正在做什么", "title_en": "RSS Feeds about what the Government is doing", "transed": 1, "url": "https://www.govinfo.gov/feeds", "via": "", "real_tags": ["feeds", "govinfo"]}, {"category": "", "categoryclass": "", "imagename": "debde01b42432d05c75483c0372bddf7.jpeg", "infoid": 1072551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "警方可以从“派遣”到私人信使数据中的一切 - 越来越多", "note_en": "Police can access everything from “pokes” to private Messenger data — and increasingly do\n  In mid-September of 2019, Violet, a friend of mine, was jolted awake by a sound every activist dreads: the police door knock. She hoped they would just go away, but the pounding spread across the house. “One of the…", "posttime": "2022-01-10 04:30:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,2020,sans,hands,派遣", "title": "Facebook手私人聊天给我们警方，甚至是SANS担保（2020）", "title_en": "Facebook hands over private chats to US police, even sans warrant (2020)", "transed": 1, "url": "https://onezero.medium.com/cops-are-increasingly-requesting-data-from-facebook-and-you-probably-wont-get-notified-if-they-5b7a2297df17", "via": "", "real_tags": ["facebook", "2020", "sans", "hands", "派遣"]}, {"category": "", "categoryclass": "", "imagename": "62c3e3ff439b70694e05216a4abb925c.jpg", "infoid": 1072550, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在自然通信中发布的新文章描述了将IDDA手命名的设备，其重量仅为2.5磅（1.1千克），距离近8.6英寸（21.8厘米）。手工由钢和铝制成，具有20个关节，指尖力量为34次，可以在安装在商业机器人手臂上时完成各种日常任务。", "note_en": "A new article published in  Nature Communications describes the device, named the ILDA hand, which weighs just under 2.5 pounds (1.1 kilograms) and measures almost 8.6 inches (21.8 centimeters). The hand is made from steel and aluminum and has twenty joints, a fingertip force of 34 newtons, and can complete various everyday tasks when mounted on a commercial robotic arm.\n The team says the hand can hold eggs without crushing them, lift dumbbells, crush cans and pour drinks. The hand was able to grasp various objects, adjusting its fingers accordingly. It demonstrated its ability to use tools with precision, handling scissors to cut paper and manipulating tweezers to pick up and place a microchip on a circuit board.\n The team are now planning an artificial skin for the hand. You can read more from the article   here.\n   Adam grew up watching his dad play Turok 2 and Age of Empires on a PC in his computer room, and learned a love for video games through him. Adam was always working with computers, which helped build his natural affinity for working with them, leading to him building his own at 14, after taking apart and tinkering with other old computers and tech lying around. Adam has always been very interested in STEM subjects, and is always trying to learn more about the world and the way it works.", "posttime": "2022-01-10 04:29:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,能够,footage,指尖", "title": "新型机器人手的疯狂镜头，能够使用镊子和更多 -  Tweaktown", "title_en": "Insane footage of new robotic hand, able to use tweezers and more – TweakTown", "transed": 1, "url": "https://www.tweaktown.com/news/83877/insane-footage-of-new-robotic-hand-able-to-use-tweezers-and-more/index.html", "via": "", "real_tags": ["机器人", "能够", "footage", "指尖"]}]