[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000455, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章现在有越南语Bộsạc iPhone của Apple的版本。\n拆卸苹果的小巧的英寸立方体iPhone充电器，就会发现一个技术先进的反激式开关电源，超越了典型的充电器。它只需要交流输入(100到240伏之间的任何电压)就能产生5瓦的平滑5伏功率，但实现这一点的电路令人惊讶地复杂和创新。iPhone电源适配器是一种开关电源，输入电源每秒开关约7万次，以获得准确的输出电压……", "note_en": "This article is now available in Vietnamese  Bộ sạc iPhone của Apple.\nDisassembling Apple&#39;s diminutive inch-cube iPhone charger reveals a technologically advanced flyback switching power supply that goes beyond the typical charger. It simply takes AC input (anything between 100 and 240 volts) and produce 5 watts of smooth 5 volt power, but the circuit to do this is surprisingly complex and innovative. The iPhone power adapter is a switching power supply, where the input power is switched on and off about 70,000 times a second in order to get the exact output voltage  ...", "posttime": "2020-05-03 13:59:18", "tags": "iphone,app,apple,苹果,power", "title": "苹果iPhone充电器拆卸(2012)", "title_en": "Apple iPhone charger teardown (2012)", "transed": 1, "url": "http://www.righto.com/2012/05/apple-iphone-charger-teardown-quality.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["iphone", "app", "apple", "苹果", "power"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000454, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编辑此页面--返回到上一个索引是！git存储库显示了我们当前正在做的所有工作。Libreboot相当活跃。\n简短的回答是：当它出来的时候，它就出来了。如果您想帮助解决并提交补丁程序，请参阅Git页面。\n自上一版本以来，我们一直在从头开始重写整个Libreboot构建系统。这花费的时间比我们预期的要长，但是新的构建系统正在走向成熟。我们正在擦亮它。\n一旦新的构建系统稳定下来，我们的下一个优先事项就是确保当前支持的所有构建目标都能在Libreboot中正确构建。\n在此之后，首要任务是确保Libreboot中的所有当前主板都使用最新版本的coreboot，以及所有最新的修复和改进。然后，测试这些板将是一个同行评审的问题，通过alpha/beta/RC版本接触到整个社区。\n通常，在发布新版本之前，必须解决所有主要的版本阻止问题。参见：https://notabug.org/libreboot/libreboot/issues。\n当构建系统稳定时，在为所有主板构建ROM之后，进行新的改进并帮助测试。\n特别是，正如Libreboot bug跟踪器中记录的那样，coreboot中有几个我们可以添加到Libreboot中的新主板。这些还必须添加，并进行全面测试。有关设置基于硬件的刷新工具的说明，请参阅Libreboot安装指南。\n一些新的主板端口也将派上用场；)如果您有技能，我们将非常感激。先将它们移植到核心重新引导，或者使现有核心重新引导目标在没有二进制BLOB的情况下工作。\n如果您有改进文档的方法，您也可以这样做。有关向文档提交补丁程序的说明，请参阅Git页面。\n如果运行flashrom-p Internal进行基于软件的刷新，并且您收到与/dev/mem访问相关的错误，则应在运行flashrom之前使用iomem=RELAXED内核参数重新启动，或者使用未启用CONFIG_STRICT_DEVMEM和CONFIG_IO_STRICT_DEVMEM的内核。\nFlashrom v0.9.9-r1955基于Linux4.11.9-1-ARCH(X86_64)Flashrom是自由软件，获取https://flashrom.orgCalibrating延迟循环的源代码.。OK。访问高表时出错，0x000000007fb5d000/dev/mem mmap处的0x100000字节失败：不允许操作访问核心启动高表失败。访问DMI表时出错，0x000000007fb27000处的0x1000字节/dev/mem mmap失败：不允许操作。\n降低X200/T400/T500/R400的亮度时，屏幕左侧的背光较暗。\n[链接]。\n我们不知道如何在coreboot-libre中检测正确的PWM值，所以我们只在coreboot中使用默认的值，它在一些CCFL面板上有这个问题，但在LED面板上没有。\n您可以按照docs：Backlight control上的说明在您的发行版中解决此问题。\n在使用网络管理器的一些系统上观察到了这一点。这在原始BIOS和libreboot中都会发生。这是硬件上的一个怪癖。在Debian系统上，解决方法是在连接以太网电缆时重新启动网络服务：\nlibreboot 20160818、20160902和20160907都有一个缺陷：在seaBIOS中，默认情况下，pci options ROM在可用时加载。从技术上讲，这不是问题，因为可选ROM可以是免费的，也可以是非免费的。然而，在实践中，它们通常不是免费的。\n从ASUS KCMA-D8或KGPE-D16上的PIKE2008模块加载选件ROM会导致系统在引导时挂起。可以在有效负载中使用它(如果您使用Linux内核有效负载，或者postboot)，或者从常规SATA引导(使用SeaGRUB和/或SeaBIOS)，然后在GNU+Linux中使用它。Linux内核无需加载选件ROM即可使用PIKE2008模块。\nLibreboot-不稳定(或GIT)现在禁止加载PCI option ROM，但SeaGRUB(20160818-20160907)之前的版本不会这样做。您可以通过运行以下命令来解决此问题：\n您可以在您正在使用的libreboot发行版的_util归档中找到cbfstool。\n您可以安全地忽略这些错误，它们之所以存在，是因为我们无法停止libreboot的grub.cfg中for循环中的cryptomount命令。它可以在上游GRUB中通过提供补丁来修复，该补丁将为其添加静默标志。\n最简单的方法是使用内核的netconsole并重现死机。NetConsole需要两台机器，一台是死机(源)，另一台将接收崩溃日志(目标)。源必须用以太网电缆连接，目标必须在恐慌时可以到达。要设置此系统，请在源系统(source#)上以root用户身份执行以下命令，在目标系统上以普通用户身份执行以下命令.。\n挂载configfs(每次引导仅一次，您可以使用mount|grep/sys/kernel/config检查它是否已经挂载。如果不是，这将不返回任何输出)。\n查找源的以太网接口名称，应为", "note_en": "Edit this page --  Back to previous index    Yes! The  git repository shows all of the work that we’re currently doing. Libreboot is quite active.\n  Short answer: It’s out when it’s out. If you want to help out and submit patches, refer to  the Git page.\n   We’ve been re-writing the entire Libreboot build system from scratch, since the previous release. This has taken longer than we expected, but the new build system is reaching maturity. We are polishing it.\n Once the new build system is stable, our next priority is ensuring that all currently supported build targets build properly in Libreboot.\n After that, the priority is to make sure that all current boards in Libreboot use the most up to date revision of coreboot, with all of the most recent fixes and improvements. Testing those boards will then be a matter of peer review, reaching out to the entire community via alpha/beta/RC releases.\n Generally, all major release-blocking issues must be addressed before a new release can be issued. See:  https://notabug.org/libreboot/libreboot/issues\n  Work on new improvements and help with testing once ROMs build for all boards, when the build system is stable.\n In particular, there are several new boards in coreboot that we can add to Libreboot, as documented on the Libreboot bug tracker. These will also have to be added, and fully tested. Instructions for setting up hardware-based flashing tools can be found in  the Libreboot installation guides\n  A few new board ports will also come in handy ;) If you’ve got the skills, we’d really appreciate that. Port them to coreboot first, or make existing coreboot targets work without binary blobs.\n  If you have ways to improve the documentation, you can do that too. Refer to  the Git page for instructions on submitting patches to the documentation.\n    If running  flashrom -p internal for software based flashing, and you get an error related to /dev/mem access, you should reboot with  iomem=relaxed kernel parameter before running flashrom, or use a kernel that has  CONFIG_STRICT_DEVMEM and  CONFIG_IO_STRICT_DEVMEM not enabled.\n  flashrom v0.9.9-r1955 on Linux 4.11.9-1-ARCH (x86_64)flashrom is free software, get the source code at https://flashrom.orgCalibrating delay loop... OK.Error accessing high tables, 0x100000 bytes at 0x000000007fb5d000/dev/mem mmap failed: Operation not permittedFailed getting access to coreboot high tables.Error accessing DMI Table, 0x1000 bytes at 0x000000007fb27000/dev/mem mmap failed: Operation not permitted\n The backlight is darker on the left side of the screen when lowering the brightness on my X200/T400/T500/R400\n [link]\n We don’t know how to detect the correct PWM value to use in coreboot-libre, so we just use the default one in coreboot which has this issue on some CCFL panels, but not LED panels.\n You can work around this in your distribution, by following the notes at  docs: backlight control.\n  This was observed on some systems using network-manager. This happens both on the original BIOS and in libreboot. It’s a quirk in the hardware. On debian systems, a workaround is to restart the networking service when you connect the ethernet cable:\n      Libreboot 20160818, 20160902 and 20160907 all have a bug: in SeaBIOS, PCI options ROMs are loaded when available, by default. This is not technically a problem, because an option ROM can be free or non-free. In practise, though, they are usually non-free.\n Loading the option ROM from the PIKE2008 module on either ASUS KCMA-D8 or KGPE-D16 causes the system to hang at boot. It’s possible to use this in the payload (if you use a linux kernel payload, or petitboot), or to boot (with SeaGRUB and/or SeaBIOS) from regular SATA and then use it in GNU+Linux. The Linux kernel is capable of using the PIKE2008 module without loading the option ROM.\n Libreboot-unstable (or git) now disables loading PCI option ROMs, but previous releases with SeaGRUB (20160818-20160907) do not. You can work around this by running the following command:\n  You can find  cbfstool in the _util archive with the libreboot release that you are using.\n  You can safely ignore those errors, they exist because we can’t quiet down cryptomount command from  for loop in libreboot’s  grub.cfg. It could be fixed in upstream grub by contributing patch that would add quiet flag to it.\n  The easiest method of doing so is by using the kernel’s netconsole and reproducing the panic. Netconsole requires two machines, the one that is panicky (source) and the one that will receive crash logs (target). The source has to be connected with an ethernet cable and the target has to be reachable at the time of the panic. To set this system up, execute the following commands as root on the source ( source#) and normal user on the target  ...\n Mount configfs (only once per boot, you can check if it is already mounted with  mount | grep /sys/kernel/config. This will return no output if it is not).\n find source’s ethernet interface name, it should be of the form  enp* or  eth*, see  ip address or  ifconfig output.\n   Test if the logging works by e.g. inserting or removing an USB device on the source. There should be a few lines appearing in the terminal, in which you started netcat (nc), on the target host.\n  Some GM45 laptops have been freezing or experiencing a kernel panic (blinking caps lock LED and totaly unresponsive machine, sometimes followed by an automatic reboot within 30 seconds). We do not know what the problem(s) is(are), but a CPU microcode update in some cases prevents this from happening again. See the following bug reports for more info:\n       There are severe privacy, security and freedom issues with these laptops, due to the Intel chipsets that they use. See:\n  Most notably, these laptops also use the Intel FSP binary blob, for the entire hardware initialization. Coreboot does support a particular revision of one of their laptops, but most are either unsupported or rely on binary blobs for most of the hardware initialization.\n In particular, the Intel Management Engine is a severe threat to privacy and security, not to mention freedom, since it is a remote backdoor that provides Intel remote access to a computer where it is present.\n    It is unlikely that any post-2008 Intel hardware will ever be supported in libreboot, due to severe security and freedom issues; so severe, that  the libreboot project recommends avoiding all modern Intel hardware. If you have an Intel based system affected by the problems described below, then you should get rid of it as soon as possible. The main issues are as follows:\n  Introduced in June 2006 in Intel ’s 965 Express Chipset Family of (Graphics and) Memory Controller Hubs, or (G)MCHs, and the ICH8 I/O Controller Family, the Intel Management Engine (ME) is a separate computing environment physically located in the (G)MCH chip. In Q3 2009, the first generation of Intel Core i3/i5/i7 (Nehalem) CPUs and the 5 Series Chipset family of Platform Controller Hubs, or PCHs, brought a more tightly integrated  ...\n The ME consists of an ARC processor core (replaced with other processor cores in later generations of the ME), code and data caches, a timer, and a secure internal bus to which additional devices are connected, including a cryptography engine, internal ROM and RAM, memory controllers, and a   direct memory access (DMA) engineto access the host operating system ’s memory as well as to reserve a region of protected external memory to  ...\n The ME firmware is compressed and consists of modules that are listed in the manifest along with secure cryptographic hashes of their contents. One module is the operating system kernel, which is based on a   proprietary real-time operating system (RTOS) kernelcalled “ThreadX ”. The developer, Express Logic, sells licenses and source code for ThreadX. Customers such as Intel are forbidden from disclosing or sublicensing the ThreadX  ...\n The Active Management Technology (AMT) application, part of the Intel “vPro” brand, is a Web server and application code that enables remote users to power on, power off, view information about, and otherwise manage the PC. It can be   used remotely even while the PC is powered off(via Wake-on-Lan). Traffic is encrypted using SSL/TLS libraries, but recall that all of the major SSL/TLS implementations have had highly publicized vulnerabilities.  ...\n Intel Boot Guard is an ME application introduced in Q2 2013 with ME firmware version 9.0 on 4th Generation Intel Core i3/i5/i7 (Haswell) CPUs. It allows a PC OEM to generate an asymmetric cryptographic keypair, install the public key in the CPU, and prevent the CPU from executing boot firmware that isn’t signed with their private key. This means that   coreboot and libreboot are impossible to portto such PCs, without the OEM ’s  ...\n ME firmware versions 4.0 and later (Intel 4 Series and later chipsets) include an ME application for   audio and video  DRMcalled “Protected Audio Video Path ”(PAVP). The ME receives from the host operating system an encrypted media stream and encrypted key, decrypts the key, and sends the encrypted media decrypted key to the GPU, which then decrypts the media. PAVP is also used by another ME application to draw an authentication  ...\n The Intel Management Engine with its proprietary firmware has complete access to and control over the PC: it can power on or shut down the PC, read all open files, examine all running applications, track all keys pressed and mouse movements, and even capture or display images on the screen. And it has a network interface that is demonstrably insecure, which can allow an attacker on the network to inject rootkits that completely  ...\n Before version 6.0 (that is, on systems from 2008/2009 and earlier), the ME can be disabled by setting a couple of values in the SPI flash memory. The ME firmware can then be removed entirely from the flash memory space. libreboot  does this on the Intel 4 Series systems that it supports, such as the  Libreboot X200 and  Libreboot T400. ME firmware versions 6.0 and later, which are found on all systems with an Intel Core i3/i5/i7  ...\n Due to the signature verification, developing free replacement firmware for the ME is basically impossible. The only entity capable of replacing the ME firmware is Intel. As previously stated, the ME firmware includes proprietary code licensed from third parties, so Intel couldn ’t release the source code even if they wanted to. And even if they developed completely new ME firmware without third-party proprietary code and  ...\n In summary, the Intel Management Engine and its applications are a backdoor with total access to and control over the rest of the PC. The ME is a threat to freedom, security, and privacy, and the libreboot project strongly recommends avoiding it entirely. Since recent versions of it can’t be removed, this means avoiding all recent generations of Intel hardware.\n More information about the Management Engine can be found on various Web sites, including  me.bios.io,  unhuffme,  coreboot wiki, and  Wikipedia. The book    Platform Embedded Security Technology Revealed describes in great detail the ME’s hardware architecture and firmware application modules.\n If you’re stuck with the ME (non-libreboot system), you might find this interesting:  http://hardenedlinux.org/firmware/2016/11/17/neutralize_ME_firmware_on_sandybridge_and_ivybridge.html\n   On all recent Intel systems, coreboot support has revolved around integrating a blob (for each system) called the  FSP(firmware support package), which handles all of the hardware initialization, including memory and CPU initialization. Reverse engineering and replacing this blob is almost impossible, due to how complex it is. Even for the most skilled developer, it would take years to replace. Intel distributes this blob  ...\n Since the FSP is responsible for the early hardware initialization, that means it also handles SMM (System Management Mode). This is a special mode that operates below the operating system level.  It’s possible that rootkits could be implemented there, which could perform a number of attacks on the user (the list is endless). Any Intel system that has the proprietary FSP blob cannot be trusted at all.In fact, several SMM  ...\n  All modern x86 CPUs (from Intel and AMD) use what is called  microcode. CPUs are extremely complex, and difficult to get right, so the circuitry is designed in a very generic way, where only basic instructions are handled in hardware. Most of the instruction set is implemented using microcode, which is low-level software running inside the CPU that can specify how the circuitry is to be used, for each instruction. The  ...\n Microcode  updatesare proprietary blobs, uploaded to the CPU at boot time, which patches the built-in microcode and disables buggy parts of the CPU to improve reliability. In the past, these updates were handled by the operating system kernel, but on all recent systems it is the boot firmware that must perform this task. Coreboot does distribute microcode updates for Intel and AMD CPUs, but libreboot cannot, because  ...\n On some older Intel CPUs, it is possible to exclude the microcode updates and not have any reliability issues in practise. All current libreboot systems work without microcode updates (otherwise, they wouldn’t be supported in libreboot). However, all modern Intel CPUs require the microcode updates, otherwise the system will not boot at all, or it will be extremely unstable (memory corruption, for example).\n Intel CPU microcode updates are  signed, which means that you could not even run a modified version, even if you had the source code. If you try to upload your own modified updates, the CPU will reject them.\n The microcode updates alter the way instructions behave on the CPU. That means they affect the way the CPU works, in a very fundamental way. That makes it software. The updates are proprietary, and are software, so we exclude them from libreboot. The microcode built into the CPU already is not so much of an issue, since we can’t change it anyway (it’s read-only).\n  For years, coreboot has been struggling against Intel. Intel has been shown to be extremely uncooperative in general. Many coreboot developers, and companies, have tried to get Intel to cooperate; namely, releasing source code for the firmware components. Even Google, which sells millions of  chromebooks (coreboot preinstalled) have been unable to persuade them.\n Even when Intel does cooperate, they still don’t provide source code. They might provide limited information (datasheets) under strict corporate NDA (non-disclosure agreement), but even that is not guaranteed. Even ODMs and IBVs can’t get source code from Intel, in most cases (they will just integrate the blobs that Intel provides).\n  Intel is  only going to get worse when it comes to user freedom. Libreboot has no support recent Intel platforms, precisely because of the problems described above. The only way to solve this is to get Intel to change their policies and to be more friendly to the  free softwarecommunity. Reverse engineering won ’t solve anything long-term, unfortunately, but we need to keep doing it anyway. Moving forward, Intel  ...\n Basically, all Intel hardware from year 2010 and beyond will never be supported by libreboot. The libreboot project is actively ignoring all modern Intel hardware at this point, and focusing on alternative platforms.\n  It is extremely unlikely that any post-2013 AMD hardware will ever be supported in libreboot, due to severe security and freedom issues; so severe, that  the libreboot project recommends avoiding all modern AMD hardware. If you have an AMD based system affected by the problems described below, then you should get rid of it as soon as possible. The main issues are as follows:\n   This is basically AMD’s own version of the  Intel Management Engine. It has all of the same basic security and freedom issues, although the implementation is wildly different.\n The Platform Security Processor (PSP) is built in on all Family 16h + systems (basically anything post-2013), and controls the main x86 core startup. PSP firmware is cryptographically signed with a strong key similar to the Intel ME. If the PSP firmware is not present, or if the AMD signing key is not present, the x86 cores will not be released from reset, rendering the system inoperable.\n The PSP is an ARM core with TrustZone technology, built onto the main CPU die. As such, it has the ability to hide its own program code, scratch RAM, and any data it may have taken and stored from the lesser-privileged x86 system RAM (kernel encryption keys, login data, browsing history, keystrokes, who knows!). To make matters worse, the PSP theoretically has access to the entire system memory space (AMD  ...\n In theory any malicious entity with access to the AMD signing key would be able to install persistent malware that could not be eradicated without an external flasher and a known good PSP image. Furthermore, multiple security vulnerabilities have been demonstrated in AMD firmware in the past, and there is every reason to assume one or more zero day vulnerabilities are lurking in the PSP firmware. Given the  ...\n Much like with the Intel Boot Guard (an application of the Intel Management Engine), AMD ’s PSP can also act as a tyrant by checking signatures on any boot firmware that you flash, making replacement boot firmware (e.g. libreboot, coreboot) impossible on some boards. Early anecdotal reports indicate that AMD ’s boot guard counterpart will be used on most OEM hardware, disabled only on so-called “enthusiast  ...\n    Handles some power management for PCIe devices (without this, your laptop will not work properly) and several other power management related features.\n The firmware is signed, although on older AMD hardware it is a symmetric key, which means that with access to the key (if leaked) you could sign your own modified version and run it. Rudolf Marek (coreboot hacker) found out how to extract this key  in this video demonstration, and based on this work, Damien Zammit (another coreboot hacker)  partially replaced itwith free firmware, but on the relevant system  ...\n  This is responsible for virtually all core hardware initialization on modern AMD systems. In 2011, AMD started cooperating with the coreboot project, releasing this as source code under a free license. In 2014, they stopped releasing source code and started releasing AGESA as binary blobs instead. This makes AGESA now equivalent to  Intel FSP.\n  Read the Intel section practically the same, though it was found with much later hardware in AMD that you could run without microcode updates. It’s unknown whether the updates are needed on all AMD boards (depends on CPU).\n  AMD seemed like it was on the right track in 2011 when it started cooperating with and releasing source code for several critical components to the coreboot project. It was not to be. For so-called economic reasons, they decided that it was not worth the time to invest in the coreboot project anymore.\n For a company to go from being so good, to so bad, in just 3 years, shows that something is seriously wrong with AMD. Like Intel, they do not deserve your money.\n Given the current state of Intel hardware with the Management Engine, it is our opinion that all performant x86 hardware newer than the AMD Family 15h CPUs (on AMD ’s side) or anything post-2009 on Intel ’s side is defective by design and cannot safely be used to store, transmit, or process sensitive data. Sensitive data is any data in which a data breach would cause significant economic harm to  ...\n  Libreboot has support for fam15h AMD hardware (~2012 gen) and some older Intel platforms like Napa, Montevina, Eagle Lake, Lakeport (2004-2006). We also have support for some ARM chipsets (rk3288). On the Intel side, we’re also interested in some of the chipsets that use Atom CPUs (rebranded from older chipsets, mostly using ich7-based southbridges).\n  Short answer: yes. These laptops also have an Intel GPU inside, which libreboot uses. The ATI GPU is ignored by libreboot.\n These laptops use what is called  switchable graphics, where it will have both an Intel and ATI GPU. Coreboot will allow you to set (using nvramtool) a parameter, specifying whether you would like to use Intel or ATI. The ATI GPU lacks free native graphics initialization in coreboot, unlike the Intel GPU.\n Libreboot modifies coreboot, in such a way where this nvramtool setting is ignored. Libreboot will just assume that you want to use the Intel GPU. Therefore, the ATI GPU is completely disabled on these laptops. Intel is used instead, with the free native graphics initialization (VBIOS replacement) that exists in coreboot.\n   A common issue with desktop hardware is the Video BIOS, when no onboard video is present, since every video card has a different Video BIOS. Onboard GPUs also require one, so those still have to be replaced with free software (non-trivial task). Libreboot has to initialize the graphics chipset, but most graphics cards lack a free Video BIOS for this purpose. Some desktop motherboards supported  ...\n  Most likely not. First, you must consult coreboot’s own hardware compatibility list at  http://www.coreboot.org/Supported_Motherboardsand, if it is supported, check whether it can run without any proprietary blobs in the ROM image. If it can: wonderful! Libreboot can support it, and you can add support for it. If not, then you will need to figure out how to reverse engineer and replace (or remove)  ...\n For those systems where no coreboot support exists, you must first port it to coreboot and, if it can then run without any blobs in the ROM image, it can be added to libreboot. See:  Motherboard Porting Guide (this is just the tip of the iceberg!)\n Please note that board development should be done upstream (in coreboot) and merged downstream (into libreboot). This is the correct way to do it, and it is how the libreboot project is coordinated so as to avoid too much forking of the coreboot source code.\n  Libreboot has support for some ARM based laptops, using the  Rockchip RK3288 SoC. Check the libreboot  hardware compatibility list, for more information.\n      It’s possible to use a 16-pin SOIC test clip on an 8-pin SOIC chip, if you align the pins properly. The connection is generally more sturdy.\n  If you are using the GRUB payload, you can add a username and password (salted, hashed) to your GRUB configuration that resides inside the flash chip. The following guides (which also cover full disk encryption, including the /boot/ directory) show how to set a boot password in GRUB:  (Installing Debian or Devuan with FDE) and  (Installing Parabola or Arch GNU+Linux-Libre, with FDE)\n  By default, there is no write-protection on a libreboot system. This is for usability reasons, because most people do not have easy access to an external programmer for re-flashing their firmware, or they find it inconvenient to use an external programmer.\n On some systems, it is possible to write-protect the firmware, such that it is rendered read-only at the OS level (external flashing is still possible, using dedicated hardware). For example, on current GM45 laptops (e.g. ThinkPad X200, T400), you can write-protect (see  ICH9 gen utility).\n It’s possible to write-protect on all libreboot systems, but the instructions need to be written. The documentation is in the main git repository, so you are welcome to submit patches adding these instructions.\n  Libreboot actually uses the  GRUB payload. More information about payloads can be found at  coreboot.org/Payloads.\n Libreboot inherits the modular payload concept from coreboot, which means that pre-OS bare-metal  BIOS setup programs are not very practical. Coreboot (and libreboot) does include a utility called  nvramtool, which can be used to change some settings. You can find nvramtool under  coreboot/util/nvramtool/, in the libreboot source archives.\n The  -a option in nvramtool will list the available options, and  -w can be used to change them. Consult the nvramtool documentation on the coreboot wiki for more information.\n In practise, you don’t need to change any of those settings, in most cases.\n Libreboot locks the CMOS table, to ensure consistent functionality for all users. You can use:\n  This will change the default inside that ROM image, and then you can re-flash it.\n  Libreboot integrates the GRUB bootloader already, as a   payload. This means that the GRUB bootloader is actually  flashed, as part of the boot firmware (libreboot). This means that you do not have to install a boot loader on the HDD or SSD, when installing a new distribution. You’ll be able to boot just fine, using the bootloader (GRUB) that is in the flash chip.\n This also means that even if you remove the HDD or SSD, you’ll still have a functioning bootloader installed which could be used to boot a live distribution installer from a USB flash drive. See  How to install GNU+Linux on a libreboot system\n  Not anymore. Recent versions of libreboot (using the GRUB payload) will automatically switch to a GRUB configuration on the HDD or SSD, if it exists. You can also load a different GRUB configuration, from any kind of device that is supported in GRUB (such as a USB flash drive). For more information, see  Modifying the GRUB Configuration in Libreboot Systems\n           The main freedom issue on any system, is the boot firmware (usually referred to as a BIOS or UEFI). Libreboot replaces the boot firmware with fully free code, but even with libreboot, there may still be other hardware components in the system (e.g. laptop) that run their own dedicated firmware, sometimes proprietary. These are on secondary processors, where the firmware is  ...\n Note that these issues are not unique to libreboot systems. They apply universally, to most systems. The issues described below are the most common (or otherwise critical).\n   The Video BIOS is present on most video cards. For integrated graphics, the VBIOS (special kind of OptionROM) is usually embedded in the main boot firmware. For external graphics, the VBIOS is usually on the graphics card itself. This is usually proprietary; the only difference is that SeaBIOS can execute it (alternatively, you embed it in a coreboot ROM image and have coreboot  ...\n On current libreboot systems, instead of VBIOS, coreboot native GPU init is used, which is currently only implemented for Intel GPUs. Other cards with proper KMS drivers can be initialized once Linux boots, but copy of VBIOS may be still needed to fetch proper VRAM frequency and other similar parameters (without executing VBIOS code).\n In configurations where SeaBIOS and native GPU init are used together, a special shim VBIOS is added that uses coreboot linear framebuffer.\n  Most (all?) laptops have this. The EC (embedded controller) is a small, separate processor that basically processes inputs/outputs that are specific to laptops. For example:\n When you flick the radio on/off switch, the EC will enable/disable the wireless devices (wifi, bluetooth, etc) and enable/disable an LED that indicates whether it’s turned on or not\n Listen to another chip that produces temperature readings, adjusting fan speeds accordingly (or turning the fan(s) on/off).\n Alexander Couzens from coreboot (lynxis on coreboot IRC) is working on a free EC firmware replacement for the ThinkPads that are supported in libreboot. See:  https://github.com/lynxis/h8s-ec (not ready yet).\n Most (all?) chromebooks have free EC firmware. Libreboot is currently looking into supporting a few ARM-based chromebooks.\n EC is present on nearly all laptops. Other devices use, depending on complexity, either EC or variant with firmware in Mask ROM - SuperIO.\n  HDDs and SSDs have firmware in them, intended to handle the internal workings of the device while exposing a simple, standard interface (such as AHCI/SATA) that the OS software can use, generically. This firmware is transparent to the user of the drive.\n HDDs and SSDs are quite complex, and these days contain quite complex hardware which is even capable of running an entire operating system (by this, we mean that the drive itself is capable of running its own embedded OS), even GNU+Linux or BusyBox/Linux.\n SSDs and HDDs are a special case, since they are persistent storage devices as well as computers.\n Example attack that malicious firmware could do: substitute your SSH keys, allowing unauthorized remote access by an unknown adversary. Or maybe substitute your GPG keys. SATA drives can also have DMA (through the controller), which means that they could read from system memory; the drive can have its own hidden storage, theoretically, where it could read your  ...\n With proper IOMMU and use of USB instead of SATA, it might be possible to mitigate any DMA-related issues that could arise.\n  Viable free replacement firmware is currently unknown to exist. For SSDs, the  OpenSSD project may be interesting.\n Apparently, SATA drives themselves don’t have DMA but can make use of it through the controller. This  http://www.lttconn.com/res/lttconn/pdres/201005/20100521170123066.pdf (pages 388-414, 420-421, 427, 446-465, 492-522, 631-638) and this  http://www.intel.co.uk/content/dam/www/public/us/en/documents/technical-specifications/serial-ata-ahci-spec-rev1_3.pdf(pages  ...\n The following is based on discussion with Peter Stuge (CareBear\\) in the coreboot IRC channel on Friday, 18 September 2015, when investigating whether the SATA drive itself can make use of DMA. The following is based on the datasheets linked above:\n According to those linked documents, FIS type 39h is  “DMA Activate FIS - Device to Host”. It mentions  “transfer of data from the host to the device, and goes on to say: Upon receiving a DMA Activate, if the host adapter ’s DMA controller has been programmed and armed, the host adapter shall initiate the transmission of a Data FIS and shall transmit in this  ...\n Based on this, it’s safe to say that use of USB instead of SATA is advisable if security is a concern. USB 2.0 has plenty of bandwidth for many HDDs (a few high-end ones can use more bandwidth than USB 2.0 is capable of), but for SSDs it might be problematic (unless you’re using USB 3.0, which is not yet usable in freedom. See\n Use of USB is also not an absolute guarantee of safety, so do beware. The attack surface becomes much smaller, but a malicious drive could still attempt a “fuzzing ”attack (e.g. sending malformed USB descriptors, which is how the tyrant DRM on the Playstation 3 was broken, so that users could run their own operating system and run unsigned code). (you ’ ...\n   It is recommended that you use full disk encryption, on HDDs connected via USB. There are several adapters available online, that allow you to connect SATA HDDs via USB. Libreboot documents how to install several distributions with full disk encryption. You can adapt these for use with USB drives:\n  The current theory (unproven) is that this will at least prevent malicious drives from wrongly manipulating data being read from or written to the drive, since it can ’t access your LUKS key if it ’s only ever in RAM, provided that the HDD doesn ’t have DMA (USB devices don ’t have DMA). The worst that it could do in this case is destroy your data. Of  ...\n  Ethernet NICs will typically run firmware inside, which is responsible for initializing the device internally. Theoretically, it could be configured to drop packets, or even modify them.\n With proper IOMMU, it might be possible to mitigate the DMA-related issues. A USB NIC can also be used, which does not have DMA.\n  Implements an instruction set. See description. Here we mean microcode built in to the CPU. We are not talking about the updates supplied by the boot firmware (libreboot does not include microcode updates, and only supports systems that will work without it) Microcode can be very powerful. No proof that it’s malicious, but it could theoretically\n There isn’t really a way to solve this, unless you use a CPU which does not have microcode. (ARM CPUs don’t, but most ARM systems require blobs for the graphics hardware at present, and typically have other things like soldered wifi which might require blobs)\n CPUs often on modern systems have a processor inside it for things like power management. ARM for example, has lots of these.\n  Sound hardware (integrated or discrete) typically has firmware on it (DSP) for processing input/output. Again, a USB DAC is a good workaround.\n  Webcams have firmware integrated into them that process the image input into the camera; adjusting focus, white balancing and so on. Can use USB webcam hardware, to work around potential DMA issues; integrated webcams (on laptops, for instance) are discouraged by the libreboot project.\n  Doesn’t really apply to current libreboot systems (none of them have USB 3.0 at the moment), but USB 3.0 host controllers typically rely on firmware to implement the XHCI specification. Some newer coreboot ports also require this blob, if you want to use USB 3.0.\n This doesn’t affect libreboot at the moment, because all current systems that are supported only have older versions of USB available. USB devices also don’t have DMA (but the USB host controller itself does).\n With proper IOMMU, it might be possible to mitigate the DMA-related issues (with the host controller).\n  Some laptops might have a simcard reader in them, with a card for handling WWAN, connecting to a 3g/4g (e.g. GSM) network. This is the same technology used in mobile phones, for remote network access (e.g. internet).\n NOTE: not to be confused with wifi. Wifi is a different technology, and entirely unrelated.\n The baseband processor inside the WWAN chip will have its own embedded operating system, most likely proprietary. Use of this technology also implies the same privacy issues as with mobile phones (remote tracking by the GSM network, by triangulating the signal).\n On some laptops, these cards use USB (internally), so won ’t have DMA, but it ’s still a massive freedom and privacy issue. If you have an internal WWAN chip/card, the libreboot project recommends that you disable and (ideally, if possible) physically remove the hardware. If you absolutely must use this technology, an external USB dongle  ...\n Use of ethernet or wifi is recommended, as opposed to mobile networks, as these are generally much safer.\n On all current libreboot laptops, it is possible to remove the WWAN card and sim card if it exists. The WWAN card is next to the wifi card, and the sim card (if installed) will be in a slot underneath the battery, or next to the RAM.\n   Absolutely! It is well-tested in libreboot, and highly recommended. See  installing GNU+Linux and  booting GNU+Linux.\n Any recent distribution should work, as long as it uses KMS (kernel mode setting) for the graphics.\n  On Fedora, by default the grub.cfg tries to boot linux in 16-bit mode. You just have to modify Fedora’s GRUB configuration. Refer to  the GNU+Linux page.\n       Libreboot on all devices only provides host hardware init firmware images, that can be written 25XX SPI NOR Flash. But on many systems there are a lot more computers running blob firmware. Some of them are not practicable to replace due to being located on Mask ROM. Some devices have EC firmware being build as well. Additionally, besides  ...\n Notable proprietary blobs (not a complete list): * All devices * SATA/PATA Hard Drive/Optical Disc Drive Firmware ( often contain powerful ARM based computer) * Pendrives and any USB peripherals - they contain a computer with code running to at the very least handle the USB protocol * ThinkPads: * EC Firmware (H8S until including Sandy  ...\n  Basics of soldering and rework by PACE Both series of videos are mandatory regardless of your soldering skill.\n edX course on basics of electronics In most countries contents of this course is covered during middle and high school. It will also serve well to refresh your memory if you haven’t used that knowledge ever since.\n Impedance intro Stubs: Polar Instruments article on stubs With external SPI flashing we only care about unintended PCB stubs\n  Lastly the most important message to everybody gaining this wonderful new hobby -  Secret to Learning Electronics", "posttime": "2020-05-03 13:37:03", "tags": "英特尔,管理,management,libreboot", "title": "英特尔管理引擎是通过PC完全访问的后门", "title_en": "The Intel Management Engine is a backdoor with total access over the PC", "transed": 1, "url": "https://libreboot.org/faq.html#intelme", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["英特尔", "管理", "libreboot"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000453, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "希勒尔·韦恩(Hillel Wayne)最近发表的一篇关于有影响力的死语言(他指出，大部分语言已经死了)的帖子提醒我，关于APL有很多人们不知道的东西，鉴于APL在广泛的编程世界中的默默无闻，人们认为APL是一种(大部分)死语言，这是情有可原的。但是这个问题经常出现，所以我认为有必要从这个角度来审视APL，澄清现代世界对APL的理解。让我们分三部分来研究这个问题：……。\n是什么造就了一种死亡的语言呢？简而言之，缺乏生命。但是，这如何适用于编程语言呢？衡量受欢迎程度和用户基数的代理指标可以帮助我们，因为流行语言永远不会消亡。其原因是，拥有许多开发人员和用户的语言几乎总是在发展和发明新的功能、代码和界面。它们保持与现代设备和接口的连接。尽管如此，人气并不代表一切。毕竟哈斯克尔花了很多年。\n生活就是创造、运动和潜力。当一种语言停止在这些维度上提供价值时，它就会消亡。换句话说，当一种语言不再有任何贡献时，当它不再适合创造新想法时，当它不再跟上用户需求的步伐时，它就死了。\n在嵌入独特的或创新的思维和解决问题模式的同时保持可用性的语言对受欢迎程度的损失有更强的适应能力。事实上，大多数新语言之所以从默默无闻中崛起，恰恰是因为在某种意义上，可用性和新颖性/创新性的独特结合。但像APL这样的语言是一个很好的例子，说明即使是伟大的语言也可能因为市场力量和未能在合适的利基市场交付价值而变得默默无闻。格言是什么？……。\n通常情况下，一种新的语言可能会相对较快地消亡，因为新鲜感逐渐消失，其精华被吸收到其他语言中。语言的基本独特性和价值越少，语言消亡的速度就越快。这就是为什么我们看到这么多可能是遗产的语言仍然在某些利基市场上发挥作用：它们的价值高得离谱，或者被认为在这些领域是如此。\nAPL作为一种快速、准确地解决问题的超高生产力语言，在70年代和80年代蓬勃发展。它允许访问其他人无法访问的大型机。大学的计算机科学系实际上发现这太容易了，许多采用软件工程模型或正式方法模型的系开展了一场反对APL的激烈运动。\n在90年代，软件工程、个人计算机和面向对象编程(Tm)的浪潮吞噬了所有的替代品。APL供应商没有做出充分的回应，当时的时尚意味着APL以用户为中心的快速开发很快就变成了不受欢迎的角色。电子表格的日益流行意味着APL正在打一场双线战争，它很快就失去了市场份额。像J这样的努力未能获得足够的市场份额来转向.。\n尽管如此，APL继续为其现有客户提供非常高的价值，Dyalog不仅继续投资于维护这种语言，而且继续发展和发展它，以保持相关性，并在许多方面仍然领先于时代(似乎领先了大约20年)。结果是一门非常坚实的语言，拥有一些最好的工具。已故伟大的John Scholes将函数式编程引入该语言至少比主流编程中的任何人早十年(包括.。\nAPL社区愿意在快节奏和实用的商业世界中继续追逐思想工具的含义，这有助于APL免受过多时髦编程的影响。具有讽刺意味的是，它还让APL在这十年里像凤凰一样从默默无闻中崛起，拥有一个成熟、快速和经验丰富的工具和技术平台来解决当今的问题，因为当APL离开时发生了一些事情，这些事情极大地改变了APL的价值主张。\n这些年来，不仅APL不断发展和改进，编程社区的其他成员也一直在艰难地吸取教训，这些教训只会让APL在今天变得比以往任何时候都更有意义。\n事实证明，OOP和软件工程并不像我们想象的那样是天赐之物，特别是在快速变化的情况下。事实证明，组合Lego块编程方法在函数式编程和以库为中心的Python模型中都非常有效。几年前，麻省理工学院著名的课程偏离了当时(十年？)的6.001门课程，就讨论过这个问题。\n我们也看到了领域专家在编程实践中的价值。像敏捷方法之类的方法强调代码和与系统用户紧密、高效的沟通。许多APL商店使用的方法一直在使用和掌握敏捷", "note_en": "A recent post by  Hillel Wayneabout influential dead languages (well, mostly dead, he notes) has reminded me that there is a lot about APL that people do not know, and with the obscurity of APL in the wide world of programming, one must be forgiven for thinking of APL in terms of a dead (mostly) language. But this question comes up so much that I think it is worthwhile to examine APL in this light and clarify the understanding of APL in the modern world. Let us examine this question in three parts:  ...\n  What makes for a dead language? In short, lack of life. But how does this apply to programming languages? The proxy measures of popularity and userbase can help us, because popular languages are never dead. The reason for this is that the languages with many developers and users are almost always evolving and inventing new features, code, and interfaces. They maintain their connection to modern devices and interfaces. Nonetheless, popularity is not everything. After all, Haskell spent years  ...\n Life is creation and movement and potential. A language dies when it ceases to provide value in these dimensions. In other words, when a language no longer has anything to contribute, when it is no longer suitable for creating new ideas, when it no longer keeps pace with the needs of the user, it dies.\n Languages that maintain usability while embedding unique or innovative models of thinking and problem solving are much more resilient to losses in popularity. Indeed, most new languages rise from obscurity precisely because of a unique combination of usability and newness/innovation in some way that matters. But languages like APL are a great example of how even great languages may lapse into obscurity due to market forces and failures to deliver value in the right niche. What is the maxim?  ...\n Often, a new language may die relatively quickly, as newness wears off and its essence is absorbed into other languages. The less fundamental uniqueness and value in a language, the faster a language can die. That&#39;s why we see so many languages that might be legacy still kicking in certain niches: their value is insanely high, or perceived to be so in those areas.\n  APL thrived in the 70&#39;s and 80&#39;s as an ultra-high productivity language for solving a problem rapidly and accurately. It gave access to the mainframes that others could not. Universities&#39; Computer Science departments actually found it too easy, and many departments embracing the software engineering model or formal methods model a la Dijkstra ran a heavy campaign against APL.\n During the 90&#39;s, the wave of Software Engineering, Personal Computers, and Object-oriented Programming (tm), swallowed up any alternatives. The APL vendors did not adequately respond and the fashion of the day meant that the user-focused, rapid development of APL became persona non grata in short order. The growing popularity of spreadsheets meant APL was fighting a two-front war and it lost ground (mindshare) quickly. Efforts such as J failed to achieve sufficient marketshare to turn  ...\n Despite this, APL continued to provide very high value to its existing customers, and Dyalog continued to invest not only in maintaining the language, but evolving and growing it to remain relevant and in many ways still ahead of the times (by about 20 years it seems). The result is a very solid language with some of the best tooling out there. The late great John Scholes introduced functional programming into the language at least a decade before anyone in mainstream programming (including  ...\n The willingness of the APL community to continue chasing what a &#34;tool of thought&#34; means in the fast-paced and practical world of business helped to insulate APL from too much fad programming. Ironically, it has also positioned APL in this decade to emerge like a phoenix from obscurity with a mature, fast, and experienced platform of tools and techniques for solving today&#39;s problems, because a few things happened while APL was &#34;away&#34; that changed the value proposition immensely.\n Not only has APL continued to evolve and improve over the years, the rest of the programming community has been learning lessons the hard way which only serve to make APL more relevant today than ever before.\n It turns out, OOP and software engineering are not the Godsends we thought them to be, particularly in the presence of rapid change. The compositional Lego block approach to programming has proven highly effective, both in functional programming as well as in the library-centric Python models. This was discussed years ago in MIT&#39;s famous shift away from its 6.001 curriculum of the day (decade?).\n We have also come to see the value of domain experts in the programming practice. Methods like the Agile Method and the like emphasize code and a close, efficient communication with the user of a system. The methods used in many APL shops have been using and mastering &#34;agile&#34; in very tough corporate conditions since long before it was a blip on the radar of &#34;hot&#34; terms. Not only is there a cohesive culture around it, APL is one of the only languages intentionally designed  ...\n We have also had some time to learn the pitfalls of super compilation and &#34;Super High-level Declarative Programming&#34; with the sometimes insane performance hits in these systems either in usability or runtime performance or, sometimes, both. A classic example is the now standard practice of in-memory data stores instead of using an RDBMS for everything. APL applications have been maximizing in-memory database systems and high-performance queries for decades now, and the out  ...\n In a post-Ruby on Rails, big data, data-driven world, it turns out that performance does matter, long term scalability matters, but productivity also matters a great deal. And for many, the lesson has been, you cannot have it all. But there is another element to this. In a world of Lego blocks, if you can be the block designer and builder, you have tremendous power and advantage compared to people who can only slap together the big blocks/components of others.\n When it comes to performance and productivity, no other general purpose language comes close nor has as many lessons in doing just that. This is because big picture performance gains matter most as long as you can manage the low-level performance. As I show in  my thesis, APL is uniquely capable of very high-level, direct solutions that are extremely concise, yet maintaining mechanical sympathy and near byte-level performance analysis. Because of changes in modern hardware, APL is  ...\n But what about those pesky symbols? Well, ask yourself what the trend in PL is these days. How many people embrace COBOL&#39;s keyword-heavy approach? We live in an international world full of non-English scripts. You know the closest thing to an international language we have? Math notation, and heavy on the symbols. APL is designed as executable math notation. Now that Unicode and modern fonts and operating systems make it possible to use and type any symbols we want, we need  ...\n Of course, it is not all sunshine and roses. The near death of APL in the 90&#39;s still weighs heavy on the community. Most users today are young enthusiasts or old greybeards, with precious little in the middle. It is still a small, albeit passionate (sometimes too passionate), community. Many of its users are simply not present in the Internet channels so precious and vital to the view of the world for many of us.\n Sometimes this is because they are under NDA&#39;s and cannot have a presence or talk about their work. Others simply have better things to do and would not bother. Still others may not love to share, but they do not stay connected with the broader community of programmers, because they are users of APL for their passion somewhere else, and they would not identify with the open-source Internet community of programming language polyglots.\n The end result is a severe iceberg effect for APL users that only compounds. Fortunately, things are looking up, with small user groups showing up throughout the world and places like the  APL Orchard providing a chance to hang out with a passionate subset of the community who enjoy helping new users.\n Still, APL is a small community no matter how you slice it, but do not let that deter you from joining it. APL&#39;s community is still largely human, so please reach out to someone at  Dyalog or  myself or  Adam at the APL Orchard with questions you may have and we can help answer your questions and point you to the right documentation.\n Is APL dead? Not anymore. Changes in modern hardware, business needs, development methods, and our understanding of programming makes APL in its modern state perhaps more relevant and viable than ever before.\n  Solutions in many programming domains are simple to express in direct APL without complex libraries and dependency hell.\n APL is mechanically sympathetic to modern GPU and CPU architectures, leading to fast code that does not need to be hard to read or write or port.\n Dyalog APL comes with extensive tooling, examples, documentation, integrations, visualization, debugging, ingest tools/functions, libraries, serialization, and platform support.\n Idiomatic APL admits automatic or near automatic complexity analysis and is performance predictable across many architectures.\n  APL idioms are often portable across domains, meaning that techniques and strategies you learn apply in more areas (versus a library approach that restricts how applicable a given function is).\n More concise APL enables reductions in boilerplate and a more holistic analysis of systems for better whole architecture optimization.\n  APL is a language designed from the ground up on principles aligned with &#34;agile&#34; styles of programming.\n APL programs can be fundamentally simpler and more transparent, leading to better understanding the problem and better solutions.\n APL enables the benefits of data flow, functional, Lego style programming without needing to resort to large and complex sets of black-box libraries that limit your freedom and understanding as well as restrict your cross-domain transfer.\n APL is particularly suited for innovative spaces where simply leveraging off the shelf solutions can lead to sub-optimal results, while APL can allow domain experts to iterate on novel and existing solutions together in a compositional way to address complex and even not-so-complex domains with aplomb.\n APL is easy to integrate into existing or new codebases through extensive integration support for REST, JSON, .NET, Python, C/C++, shared objects, TCP, CSV, Office, HTTP, Docker, COM, R, and many other interfaces.\n APL enables you to have a single codebase that is performance portable across both CPU and GPU architectures.\n Many more common tech stacks can be fully and directly implemented in pure APL without any libraries needs, such as high-performance in-memory database query systems; this results in less code and less complexity. Often, these direct expressions are as short or shorter than the library calls to the existing implementations.\n When it comes right down to it, APL offers a unique platform in Dyalog that can often deliver the trifecta of increased runtime performance and control while reducing long term maintenance costs and increasing developer productivity on the same codebase when compared to common platforms in vogue today. In my book, such a radically value-driven language is far from dead, it&#39;s back from a long hiatus and here to show the youngsters a thing or three.", "posttime": "2020-05-03 13:36:52", "tags": "apl", "title": "APL死了吗？", "title_en": "Is APL Dead?", "transed": 1, "url": "https://www.sacrideo.us/is-apl-dead/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["apl"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000449, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-伯克希尔哈撒韦公司(BRKa.N)董事长沃伦·巴菲特(Warren Buffett)周六在公司年会上表示，伯克希尔哈撒韦公司(BRKa.N)在4月份出售了其在美国四大航空公司的全部股份，并表示航空业的“世界已经改变”。\n该集团的年报和公司备案文件显示，截至2019年底，该集团在航空公司持有相当大的股份，包括达美航空公司(Delta Air Lines)11%的股份、美国航空公司(American Airlines Co)10%的股份、西南航空公司(Southwest Airlines Co)10%的股份和联合航空公司(United Airlines)9%的股份。\n该集团是这四家航空公司最大的个人股东之一，并在2016年披露，在多年回避这四家航空公司后，它已开始投资这四家航空公司。\n在冠状病毒大流行期间，美国旅游需求几近崩溃，航空股受到重创。\n美国航空公司正在削减数十万个航班，停放数千架飞机，因为美国旅行需求下降了约95%，而且没有明确的时间表让乘客回到危机前的航班水平。\n“我们是在航空公司业务方面做出这一决定的。我们基本上是在大幅亏损的情况下将资金撤出这项业务。“巴菲特说。“我们不会资助一家我们认为未来会蚕食资金的公司。”\n伯克希尔在4月3日披露，它已经出售了大约18%的达美航空股份和4%的西南航空股份。\n巴菲特表示，伯克希尔已投资约70亿美元或80亿美元，累计持有包括美国航空集团(AAL.O)在内的四家航空公司的股份。\n“我们没有拿出70亿或80亿美元，那是我的错误，”巴菲特在直播的公司年会上说。“我是做这个决定的人。”\n达美航空在一份声明中表示，它知道这笔交易，并“非常尊重巴菲特先生和伯克希尔团队”。该航空公司补充说，它仍然“有信心，达美航空业务的核心优势-我们的员工、我们的品牌、我们的网络和我们的运营可靠性-将持久存在，并使达美航空取得成功。”\n“从根本上说，你的需求枯竭了，这是一个打击……。基本上就是我们关闭了这个国家的航空旅行。“巴菲特补充说。\n巴菲特此前表达了对航空公司财务前景的悲观情绪。他确实在1989年投资了美国航空公司。\n巴菲特在2007年的年度信函中写道：“如果有一位有远见的资本家出现在基蒂霍克，他会击落奥维尔，这对他的继任者来说是一个巨大的帮助。”“投资者被增长所吸引，把资金投入了一个无底洞，而他们本应对增长感到反感。”", "note_en": "(Reuters) - Berkshire Hathaway Inc (  BRKa.N) sold its entire stakes in the four largest U.S. airlines in April, Chairman Warren Buffett said Saturday at the company’s annual meeting, saying “the world has changed” for the aviation industry.\n  The conglomerate had held sizeable positions in the airlines, including an 11% stake in Delta Air Lines (  DAL.N), 10% of American Airlines Co (  AAL.O), 10% of Southwest Airlines Co (  LUV.N) and 9% of United Airlines (  UAL.O) at the end of 2019, according to its annual report and company filings.\n The conglomerate was one of the largest individual holders in the four airlines and in 2016 disclosed it had begun investing in the four carriers after avoiding the sector for years.\n Airline stocks have been hard hit by the near collapse U.S. travel demand amid the coronavirus pandemic.\n U.S. airlines are cutting hundreds of thousands of flights, parking thousands of planes as U.S. travel demand has fallen by about 95% and there is no clear timetable for passengers to return to flights at pre-crisis levels.\n  “We made that decision in terms of the airline business. We took money out of the business basically even at a substantial loss,” Buffett said. “We will not fund a company that — where we think that it is going to chew up money in the future.”\n Berkshire disclosed on April 3 it had sold about 18% of its Delta stake and 4% of its Southwest shares.\n Buffett said Berkshire had invested around $7 billion or $8 billion amassing stakes in the four airlines including American Airlines Group Inc (  AAL.O).\n “We did not take out anything like $7 or $8 billion and that was my mistake,” Buffett said at the company’s annual meeting which was livestreamed. “I am the one who made the decision.”\n  Delta said in a statement it was aware of the sale and has “tremendous respect for Mr. Buffett and the Berkshire team.” The airline added it remains “confident that the strengths that are core to Delta’s business – our people, our brand, our network and our operational reliability – will endure and position Delta to succeed.”\n  “It is a blow to have essentially your demand dry up.... It is basically that we shut off air travel in this country,” Buffett added.\n Buffett previously expressed grim sentiments about the financial outlook for airlines. He did invest in USAir in 1989.\n “If a farsighted capitalist had been present at Kitty Hawk, he would have done his successors a huge favor by shooting Orville down,” Buffett wrote in his 2007 annual letter. “Investors have poured money into a bottomless pit, attracted by growth when they should have been repelled by it.”", "posttime": "2020-05-03 13:14:18", "tags": "巴菲特,伯克希尔,美国航空公司,sells,股份", "title": "伯克希尔出售美国航空公司全部股份：巴菲特", "title_en": "Berkshire sells entire stakes in U.S. airlines: Buffett", "transed": 1, "url": "https://www.reuters.com/article/us-berkshire-airlines/berkshire-sells-entire-stakes-in-u-s-airlines-buffett-idUSKBN22E0VP", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["巴菲特", "伯克希尔", "美国航空公司", "sells", "股份"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000448, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代的网页是复杂的、功能齐全的应用程序，有着令人印象深刻的设计，而且有很多人对学习如何设计这些丰富的界面很感兴趣。\nWeb的好处是，即使我是一个没有经验的开发人员，在我的常规浏览过程中也很容易偶然发现大量有趣的设计。\n假设我在Airbnb主页上看到这个例子，我想在这里复制这个预订表单。\n所以你可以做的一件事就是在CSSTricks或Codrop这样的网站上搜索教程。\n但是，通常很难准确地指定您需要针对设计的哪个方面提供教程。\n但最大的问题是，教程往往过于简单化，并不完全是我们想要的。\n这是我在搜索教程时发现的一个玩具示例。你马上就可以看到，它与原作的美学不太匹配，这是不令人满意的。\nAirbnb示例使用display：table；来实现表格布局，而不使用语义错误的&lt；table&gt；元素。\n玩具示例使用了浮点和clearfix，这是一种非常过时的布局方法。\n现在专家们知道这一点，所以他们经常使用现代浏览器DevTools内置的“检查元素”功能来检查底层实现。\n其他网页如何使用教程并不总是传达的现代开发最佳实践来实现效果。\n新手在检查生产网页CSS时到底发现了什么挑战，这对检查工具的设计意味着什么。\n我将带您了解PLY，这是我们为应对这些挑战而开发的工具。\n并演示它如何帮助初学者将复制复杂设计的速度提高50%，并学习新概念。\n调查了20名本科生web开发人员，了解他们学习web开发、使用教程和查看专业示例的经历。\n对其中10人进行了面对面研究，在此期间，他们使用CDT在专业网页上复制了网络特征。\n新手依赖视觉直觉，但现有的检查工具不支持对不熟悉的代码进行视觉推理。\n根据Gross和Kelleher(2010)，Brandt et al.。(2010)，Ko，Myers和Aung(2004)。\n我们的高级发现是，新手很大程度上依赖于他们的视觉直觉来理解不熟悉的CSS，并且很难将视觉结果与负责任的代码行联系起来。\n这与终端用户程序员努力识别负责感兴趣的图形输出的代码行的先前工作是一致的。\n具体地说，我想谈谈我们在CSS检查上下文中确定的两个核心障碍。\n所以，首先，如果你使用过Chrome DevTools，你可能知道你可以点击一个属性来打开和关闭它，活在页面上。\n问题是，即使Chrome去掉了它知道不活动的属性，仍然有一些属性可以在不改变页面外观的情况下进行切换。\n如果只有一两个，这很好，但不幸的是，有很多-红色高亮显示是视觉上无效的属性，但在Chrome中似乎是相关的-你可以看到它将相关的属性以绿色推到了文件夹的底部。\n正如我们在Need finding中所观察到的，当相关代码被推到下面时，新手很难找到。\n但是，即使您删除了这些，这也是不够的-我们还在Need中发现，新手缺乏概念知识，无法理解不熟悉的示例代码。\n特别是，新手很难理解多个属性如何协同工作来产生视觉结果。\n有一件事让人们苦苦挣扎，那就是理解多个属性何时协同工作才能产生视觉效果。\n所以我们看到的是，在新手的意义构建方法和开发人员工具当前的设计方式之间存在差距。\n因此，我们在他们的指导方针的基础上，为学习者友好的网络检查员提出了新的设计指导方针。\n对检查器输出隐藏视觉上不相关的代码，以最大限度地减少信息过载，并支持新手的视觉处理。\n将上下文指南嵌入检查器输出中，以解释CSS属性如何协调以产生视觉效果。\n使用代表和语言来沟通学习者的理解(在我们的例子中是视觉直觉)。\n我们的方法受到一种称为可视化回归测试的技术的启发，该技术与统计回归无关。\n这似乎是简单的视觉比较，但它允许我们通过展示关于属性之间关系的概念性知识来帮助新手理解示例，而这些知识是他们事先不知道的。\n按照学习收益的标准测量，我们要求参与者在实施干预之前和之后执行类似的任务，这样我们就可以跟踪他们理解的变化。\n“有关z-index的某些内容将因位置n而改变", "note_en": "Modern webpages are complex, full-featured applications with really impressive designs, and there are a lot of people interested in learning to style these rich interfaces.\n The nice thing about the Web is that even if I’m an inexperienced developer, it’s really easy to stumble upon tons of interesting designs during my regular browsing sessions.\n And so let’s say I come across this example from the Airbnb homepage, and I’d like to replicate this booking form here.\n So one thing you can do is to search for tutorials on a websites like CSSTricks or Codrops.\n But it’s often difficult to specify exactly what aspect of the design you’d like a tutorial for.\n But the biggest problem is that tutorials are often  too simplistic and not exactly what we’re looking for.\n Here’s a toy example that I found when searching for tutorials. You can see right away that it doesn’t quite match the aesthetics of the original, which is dissatisfying.\n The Airbnb example uses  display: table; to achieve a tabular layout without using a semantically-incorrect  &lt;table&gt; element.\n The toy example uses floats and clearfix, which is a pretty outdated approach to layout.\n Now experts know this, so they often use the “Inspect Element” feature built into modern browser devtools to inspect the underlying implementation.\n how other webpages implement effects using modern development best practices that tutorials don’t always convey.\n  what exactly novices find challenging about inspecting production webpage CSS, and what that implies for the design of inspection tools\n I’ll walk you through Ply, the tool we built to address these challenges\n and demonstrate how it helped novices replicate a complex design 50% more quickly and learn new concepts\n Surveyed 20 undergrad web devs about their experiences learning web development, using tutorials, and inspecting professional examples\n Followed up with 10 of them for an in-person study, during which they replicated web features on professional webpages using CDT\n Novices rely on  visual intuition, but existing inspection tools do not support reasoning visually about unfamiliar code.\n In line with  Gross and Kelleher (2010),  Brandt et al. (2010),  Ko, Myers, and Aung (2004)\n Our high-level finding was that novices rely heavily on their visual intuition to comprehend unfamiliar CSS, and struggle to relate visual outcomes to responsible lines of code.\n This is consistent with prior work that end user programmers struggle to identify the lines of code responsible for graphical outputs of interest.\n In particular, I want to talk about two core obstacles we identified in the context of CSS inspection.\n  So first, if you’ve used Chrome DevTools you probably know that you can click a property to toggle it on and off, live on the page.\n The problem is that even though Chrome crosses off properties that it knows are inactive, there are  still properties left that can be toggled without changing the page’s appearance.\n This would be fine if it were only one or two, but tragically, there are a lot – the red highlights are properties that are visually ineffective but appear relevant in Chrome – and you can see that it’s pushed the relevant properties in green to the bottom of the fold.\n As we observed in needfinding, when relevant code was pushed below the fold, it was hard for novices to find\n But even if you removed these it’s not enough – we also found in needfinding that novices lacked conceptual knowledge that prevented them from making sense of unfamiliar example code.\n In particular, novices struggled to understand how multiple properties work together to produce visual outcomes.\n one thing that people struggled with is understanding when multiple properties worked together to produce a visual effect\n So what we’re seeing is that there’s a gap between novices’ approach to sense-making and how developer tools are currently designed.\n   So we build on their guidelines to propose new design guidelines for learner-friendly web inspectors.\n  Hide visually-irrelevant code from inspector output to minimize information overload and support novices’ visual approach to sense-making\n Embed contextual guidance into inspector output to explain how CSS properties coordinate to produce visual effects.\n   Use representations and language that bridge learners’ understanding (which in our case is visual intuition)\n           Our approach is inspired by a technique called visual regression testing, which is unrelated to statistical regression.\n     This seems like simple visual comparisons, but it allows us to help a novice understand the example by surfacing the conceptual knowledge about relationships between properties that they didn’t know beforehand.\n      Following standard measures of learning gain, we asked participants to perform a similar task before and after performing the intervention so we could track the change in their understanding.\n  “Something about  z-index would change as a result of  position not being fixed.  position: fixed; is  doing something beyond pinning in place while you scroll.”\n TODO: What’s more exciting is that they could explain why this was happening", "posttime": "2020-05-03 12:08:24", "tags": "可视化,web,visual", "title": "PLY：一个可视化的Web检查器", "title_en": "Ply: A Visual Web Inspector", "transed": 1, "url": "https://slim.computer/ply-uist-2018/#/title-slide", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["可视化", "web", "visual"]}, {"category": "", "categoryclass": "", "imagename": "c1628423f0f9797e8f0cf9c5624b4647.png", "infoid": 1000447, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Streams首次引入Java8是在2014年。所以，他们现在大约5岁了。然而，我们中的许多人仍然难以正确理解和解释数据流。对于一些人来说，这只是一种遍历列表的新方式，而另一些人则认为它只是减少了我们需要编写的代码量。虽然这些说法没有错，但它们高度低估了流的力量。今天我们将学习溪流，你可以在厨房里找到几样东西，比如水龙头，一些水，……。\n打开水龙头，水就开始流动了。各位，你们有一条小溪，那条水就是你们的数据。流都是关于推送给您的数据。而不是你去看数据(就像从井里提桶里的水)，数据本身就会来找你。为了从技术上跟踪事情，我们还将使用字符串流，它将在代码中表示我们的流。\n//表示含有某些杂质的水流的字符串流。Stream&lt；String&gt；water=Stream.of(&#34；water&#34；，&#34；杂质&#34；，&#34；杂质&#34；，&#34；水&#34；)；//水，杂质，杂质，水。\n水龙头里的水被认为不适合直接饮用，因为它含有杂质，就像有时我们不想让某些东西成为我们数据的一部分一样。而且，这是当过滤器(类似净水器)进入，去除任何我们不想要的东西的时候。\nStream&lt；String&gt；water=Stream.of(&#34；water&34；，&#34；杂质&34；，&#34；杂质&34；，&#34；water&34；)；//水，杂质，杂质，水//让&/让&/过滤掉杂质Stream&lt；String&&gt;；Purewater=water。filter(w-&&gt;；！w.equals(&#34；杂质&#34；)；//水，水。\n我们是脆弱的生物，除去水中的杂质对我们来说是不够的。我们还需要注入RO&和其他矿物质的水，对吗？在现实生活中，我们的净水器通常会做所有这些事情，但为了我们的示例，我们将其视为一个不同的操作，一个地图操作。\nStream&lt；String&gt；water=Stream.of(&#34；water&#34；，&#34；杂质&#34；，&#34；杂质&#34；，&#34；water&#34；)；Stream&lt；String&gt；Purewater=water。filter(w-&gt；！w.equals(&#34；杂质&#34；))；//水，水//让&#39；s添加一些矿物质Stream&lt；string&gt；roWater=pureWater.map(w-&&gt;；#34；ro&34；+w)；//rowater，rowater。\n这里需要记住的一件非常重要的事情是，映射是1对1的操作。1对1运算意味着一个输入产生一个输出。因为在这里，每一股水都被转化为一股流水。\n当你让水通过喷头时会发生什么？是的，它已经分解成小滴了。而且，这正是Flat Map对您的数据所做的事情。\n与映射不同的是，它是一对多的操作，即它为一个输入生成多个输出。\nStream&lt；String&gt；water=Stream.of(&#34；water&#34；，&#34；杂质&#34；，&#34；杂质&#34；，&#34；water&#34；)；Stream&lt；String&gt；Purewater=water。filter(w-&&gt;；！w.equals(&#34；杂质&#34；))；//water，water Stream&lt；Character&&gt;Dropets=pureWater.flat Map(w-&&gt;；w.chars().mapToObj(d-&&gt;；(Char)d))；//water().mapToObj(d-&&gt;；(Char)d)；//water water water。\n现在，想想看。你会打开水龙头、净水器或洒水器吗？除非你需要水来储存、做饭或喝水。不，对。如果你没有一个具体的目标，那么做整个过程是没有意义的。这正是Java的想法，因此它选择让流保持惰性。您在上面看到的所有代码都不会做任何事情，除非您有特定的目的，也就是我们称之为终端操作的东西。\n在我们的整个厨房，水龙头，水的情况下，你认为码头的运营会是什么？把水收集到玻璃杯里(记住，我说过你也需要一个玻璃杯)。所以，除非你想要一杯水，否则你不会打开任何东西。\n与MAP不同，Flat Map&amp；Filter没有名为TERMINAL的操作。但是，诸如Collect、forEach等各种操作被认为是终端操作。\nStream&lt；String&gt；water=Stream.of(&#34；water&#34；，&#34；杂质&#34；，&#34；杂质&#34；，&#34；water&#34；)；Stream&lt；String&gt；Purewater=water。filter(w-&&gt;；！w.equals(&#34；杂质&#34；))；//water，water Stream&lt；string&gt；roWater=pureWater.map(w-&gt；&#34；ro&34；+w)；//rowater，rowaterList&lt；string&gt；glassOfWater=roWater.Collect(Collectors.toList())；//将开始.。\n在上面的代码中，Streams water、Purewater&amp；roWater将仅在以下情况下执行。\n因为那是我们的终点站行动而被处决，", "note_en": "Streams were first introduced with Java 8 in 2014. So, they&#39;re around 5 years old now. However, many of us still struggle to understand &amp; explain Streams properly. For some, it is just a new way to loop through a list while some think it just reduces the amount of code that we need to write. Although these statements are not incorrect they highly understate the power of Streams. Today we will learn Streams with a couple of things that you all can find in your kitchen i.e a tap, some water,  ...\n  Turn that tap on and the water starts flowing. People, you have a stream and that water is your data. Streams are all about data being pushed to you. Instead of you going to the data (like pulling out water in a bucket from a well) the data itself comes to you. To keep a track of things technically, we will also work with a Stream of Strings which will represent our water stream in code.\n // a stream of string to represent our water stream with some impurities in it.Stream&lt;String&gt; water = Stream.of( &#34;water&#34;,  &#34;water&#34;,  &#34;water&#34;,  &#34;impurity&#34;,  &#34;impurity&#34;,  &#34;water&#34;);  // water, water, water, impurity, impurity, water\n  Water from the tap is not considered good to be consumed directly because of impurities just like sometimes we don&#39;t want something to be a part of our data. And, here is when a filter (something like a water purifier) comes in to remove anything that we don&#39;t want.\n Stream&lt;String&gt; water = Stream.of( &#34;water&#34;,  &#34;water&#34;,  &#34;water&#34;,  &#34;impurity&#34;,  &#34;impurity&#34;,  &#34;water&#34;);  // water, water, water, impurity, impurity, water // let&#39;s filter out impuritiesStream&lt;String&gt; pureWater = water.filter(w -&gt; !w.equals( &#34;impurity&#34;));  // water, water, water, water\n  We are delicate beings and removing impurities from water is just not enough for us. We also need the water to be injected with RO &amp; other minerals, right? In real life generally, our water purifiers do all these things but for the sake of our example here we will take it as a different operation, a  map operation.\n Stream&lt;String&gt; water = Stream.of( &#34;water&#34;,  &#34;water&#34;,  &#34;water&#34;,  &#34;impurity&#34;,  &#34;impurity&#34;,  &#34;water&#34;);Stream&lt;String&gt; pureWater = water.filter(w -&gt; !w.equals( &#34;impurity&#34;));  // water, water, water, water // let&#39;s add some ro &amp; mineralsStream&lt;String&gt; roWater = pureWater.map(w -&gt;  &#34;ro&#34; + w);  // rowater, rowater, rowater, rowater\n A very important thing to keep in mind here is that  map is a  1 to 1 operation. A  1 to 1 operation means one input produces one output. For eg: here every single  water is being converted to a single  rowater\n  What happens when you pass water through a sprinkler? Yes, it&#39;s broken down into droplets. And, that&#39;s exactly what a  flatMap does to your data.\n Unlike the  map it is a  1 to many operation i.e it produces multiple outputs for a single input.\n Stream&lt;String&gt; water = Stream.of( &#34;water&#34;,  &#34;water&#34;,  &#34;water&#34;,  &#34;impurity&#34;,  &#34;impurity&#34;,  &#34;water&#34;);Stream&lt;String&gt; pureWater = water.filter(w -&gt; !w.equals( &#34;impurity&#34;));  // water, water, water, waterStream&lt;Character&gt; droplets = pureWater.flatMap(w -&gt; w.chars().mapToObj(d -&gt; ( char) d));  // waterwaterwaterwater\n  Now, think about it. Would you turn that tap on, that water purifier on or that sprinkler on, unless &amp; until you need water to store, to cook or to drink? No, right. It does not make sense to do this whole process if you do not have a concrete purpose. That&#39;s exactly what Java thinks and thus it chose to keep the Streams lazy. All the code that you see above would do nothing unless you have a specific purpose, something that we call a  terminal operation.\n  In our whole kitchen, tap, water scenario what do you think would be the terminal operation? Collecting the water to a glass (remember, I mentioned that you would need a glass as well). So, unless you want a glass of water you wouldn&#39;t turn on anything.\n Unlike  map,  flatMap &amp;  filter there is no operation named  terminal. However, various operations like  collect,  forEach etc. are considered to be terminal operations.\n Stream&lt;String&gt; water = Stream.of( &#34;water&#34;,  &#34;water&#34;,  &#34;water&#34;,  &#34;impurity&#34;,  &#34;impurity&#34;,  &#34;water&#34;);Stream&lt;String&gt; pureWater = water.filter(w -&gt; !w.equals( &#34;impurity&#34;));  // water, water, water, waterStream&lt;String&gt; roWater = pureWater.map(w -&gt;  &#34;ro&#34; + w);  // rowater, rowater, rowater, rowaterList&lt;String&gt; glassOfWater = roWater.collect(Collectors.toList());  // a terminal operation which will kick off  ...\n In the code above, the Streams  water,  pureWater &amp;  roWater will be executed only when the line\n  gets executed because that&#39;s our terminal operation, that&#39;s our concrete purpose to even have all those streams in the first place.\n  Doing something like below is absolutely fine and even recommended. After all, your kitchen also has things attached as well, right.\n List&lt;String&gt; glassOfWater = Stream .of( &#34;water&#34;,  &#34;water&#34;,  &#34;water&#34;,  &#34;impurity&#34;,  &#34;impurity&#34;,  &#34;water&#34;)  // water, water, water, impurity, impurity, water .filter(w -&gt; !w.equals( &#34;impurity&#34;))  // water, water, water, water .map(w -&gt;  &#34;ro&#34; + w)  // rowater, rowater, rowater, rowater .collect(Collectors.toList());  // list of rowater, rowater, rowater, rowater\n  Now, that&#39;s what Streams are in all their glory. They are a lot more powerful than you think and I hope after this post you&#39;ll appreciate Streams more than just considering them as a new iterator or boilerplate remover.", "posttime": "2020-05-03 11:46:16", "tags": "app,streams,real,water", "title": "STREAMS--一种真实的方法", "title_en": "Streams – A Real-Life Approach", "transed": 1, "url": "https://isank.dev/posts/java-streams-real-life-approach/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["app", "streams", "real", "water"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000446, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章中，我展示了我在Coffee Meets、Bagel和The League应用程序逆向工程过程中的一些发现。在研究过程中，我发现了几个关键漏洞，所有这些漏洞都已报告给受影响的供应商。\n在这个前所未有的时代，越来越多的人逃往数字世界，以应对社会距离。在这些时期，网络安全比以往任何时候都更加重要。根据我有限的经验，很少有初创公司会注意到安全最佳实践。负责大量约会应用的公司也不例外。我开始了这个小小的研究项目，看看最新的约会应用有多安全。\n此帖子中披露的所有严重漏洞都已报告给供应商。到发布时，相应的补丁已经发布，我已经独立地验证了修复已经到位。\n咖啡遇见百吉饼或简称CMB，于2012年推出，以每天向用户展示有限数量的火柴而闻名。他们在2019年曾被黑客入侵过一次，600万个账户被盗。泄露的信息包括全名、电子邮件地址、年龄、注册日期和性别。近年来，中巴越来越受欢迎，是这个项目的一个很好的候选者。\n联盟应用程序的口号是“智能约会”。它于2015年推出，是一款仅限会员使用的应用，基于LinkedIn和Facebook个人资料进行接受和匹配。这款应用程序比它的替代品更贵，更有选择性，但安全性与价格持平吗？\n对于逆向工程，我采用静态分析和动态分析相结合的方法。对于静态分析，我主要使用apktool和jadx对APK进行反编译。对于动态分析，我使用具有SSL代理功能的MITM网络代理。\n大部分测试都是在一个运行Android 8 Oreo的带根的Android模拟器中完成的。需要更多功能的测试是在运行Lineage OS16(基于Android Pie)、根植于Magisk的真实Android设备上进行的。\n这两款应用都有很多跟踪器和遥测功能，但我想这就是行业现状。不过，招商银行的跟踪器比联盟还多。\n该接口在每个百吉饼对象中都包含一个Pair_action字段，它是一个具有下列值的枚举：\n有一个API可以在给定百吉饼ID的情况下返回百吉饼对象。百吉饼ID显示在每日百吉饼批次中。因此，如果您想查看是否有人拒绝了您，您可以尝试以下操作：\n在打电话获取每日推荐的百吉饼之后，保存你喜欢的人的百吉饼ID。\n这是一个无害的漏洞，但有趣的是，此字段通过API公开，但不能通过应用程序使用。\nCMB显示其他用户的经度和纬度，小数点后最多2位，约为1平方英里。幸运的是，这些信息不是实时的，只有当用户选择更新他们的位置时才会更新。(我想这一定是应用程序用于配对的目的。我还没有验证这一假设。)。\n该应用程序发送一个POST请求，其中包含电话号码、动态口令和持有者值，后者是一个16字节的UUID。\n服务器接收请求，如果动态口令与电话号码匹配，则持有者将成为用户的登录令牌。\n从这一点来看，对需要身份验证的端点的后续请求将包括头Authorization：承载SMS：{THE_UUID}。\n成为承载的UUID完全由客户端生成。更糟糕的是，服务器没有验证承载器值是否为实际有效的UUID。它可能会导致碰撞和其他问题。\n我建议更改登录模型，以便在服务器从客户端接收到正确的OTP后，在服务器端生成承载令牌并将其发送到客户端。\n在联盟中，存在一个接受电话号码作为查询参数的未经验证的API。API会泄漏HTTP响应代码中的信息。当电话号码注册时，它返回200OK，但当号码未注册时，它返回418I&#39；m一个茶壶。它可能会以几种方式被滥用，例如，将所有号码映射到一个区号下，以查看谁在联盟，谁不在联盟。或者，当你的同事发现你在……时，可能会导致潜在的尴尬。\n此后，当向供应商报告该错误时，该问题已得到修复。现在API只为所有请求返回200。\n该联盟与LinkedIn集成，在用户的个人资料中显示用户的雇主和职称。有时候收集信息有点过头了。Profile API返回从LinkedIn抓取的详细职位信息，如开始年、结束年等。\n虽然这款应用确实会要求用户允许阅读LinkedIn个人资料，但用户可能并不希望详细的职位信息包含在他们的个人资料中，供其他所有人查看。我不认为这类信息是应用程序运行所必需的，而且很可能可以从个人资料数据中排除这些信息。\n通常用于图片", "note_en": "In this post I show some of my findings during the reverse engineering of the apps  Coffee Meets Bagel and  The League. I have identified several critical vulnerabilities during the research, all of which have been reported to the affected vendors.\n  In these unprecedented times, more and more people are escaping into the digital world to cope with social distancing. During these times cyber-security is more important than ever. From my limited experience, very few startups are mindful of security best practices. The companies responsible for a large range of dating apps are no exception. I started this little research project to see how secure the latest dating apps are.\n  All high severity vulnerabilities disclosed in this post have been reported to the vendors. By the time of publishing, corresponding patches have been released, and I have independently verified that the fixes are in place.\n     Coffee Meets Bagel or CMB for short, launched in 2012, is known for showing users a limited number of matches every day. They have been hacked once in 2019, with 6 million accounts stolen. Leaked information included a full name, email address, age, registration date, and gender. CMB has been gaining popularity in recent years, and makes a good candidate for this project.\n  The tagline for  The League app is “date intelligently”. Launched some time in 2015, it is a members-only app, with acceptance and matches based on LinkedIn and Facebook profiles. The app is more expensive and selective than its alternatives, but is security on par with the price?\n  I use a combination of static analysis and dynamic analysis for reverse engineering. For static analysis I decompile the APK, mostly using  apktool and  jadx. For dynamic analysis I use an MITM network proxy with SSL proxy capabilities.\n The majority of the testing is done inside a rooted Android emulator running Android 8 Oreo. Tests that require more capabilities are done on a real Android device running Lineage OS 16 (based on Android Pie), rooted with Magisk.\n  Both apps have a lot of trackers and telemetry, but I guess that is just the state of the industry. CMB has more trackers than  The League though.\n  The API includes a  pair_action field in every  bagel object and it is an enum with the following values:\n  There exists an API that given a bagel ID returns the bagel object. The bagel ID is shown in the batch of daily bagels. So if you want to see if someone has rejected you, you could try the following:\n After the call to get daily suggested bagels, save the bagel ID of someone you liked.\n This is a harmless vulnerability, but it is funny that this field is exposed through the API but is not available through the app.\n  CMB shows other users’ longitude and latitude up to 2 decimal places, which is around 1 square mile. Fortunately this information  is not real-time, and it is only updated when a user chooses to update their location. (I imagine this must be used by the app for matchmaking purposes. I have not verified this hypothesis.)\n     The app sends a POST request with the phone number, the OTP, and a  bearer value, which is a 16 byte UUID.\n Server receives the request, and if the OTP matches the phone number, the  bearer becomes user’s login token.\n From this point, subsequent requests to endpoints that require authentication would include the header  authorization: bearer sms:{the_uuid}\n The UUID that becomes the  bearer is entirely client-side generated. Worse, the server did not verify that the  bearer value is an actual valid UUID. It might cause collisions and other problems.\n I recommend changing the login model so the bearer token is generated server-side and sent to the client once the server receives the correct OTP from the client.\n  In  The League there exists an unauthenticated API that accepts a phone number as query parameter. The API leaks information in HTTP response code. When the phone number is registered, it returns  200 OK, but when the number is not registered, it returns  418 I&#39;m a teapot. It could be abused in a few ways, e.g. mapping all the numbers under an area code to see who is on  The Leagueand who is not. Or it can lead to potential embarrassment when your coworker finds out you are on the  ...\n This has since been fixed when the bug was reported to the vendor. Now the API simply returns 200 for all requests.\n  The League integrates with LinkedIn to show a user’s employer and job title on their profile. Sometimes it goes a bit overboard gathering information. The profile API returns detailed job position information scraped from LinkedIn, like the start year, end year, etc.\n  While the app does ask user permission to read LinkedIn profile, the user probably does not expect the detailed position information to be included in their profile for everyone else to view. I do not think that kind of information is necessary for the app to function, and it can probably be excluded from profile data.\n  Typically for pictures or other asserts, some type of Access Control List (ACL) would be in place. For assets such as profile pictures, a common way of implementing ALC would be:\n Server puts the URL to the image with the key in user’s profile\n The key would serve as a “password” to access the file, and the password would only be given users who need access to the image. In the case of a dating app, it will be whoever the profile is presented to.\n I have identified several misconfigured S3 buckets on  The League during the research.  All pictures and videos are accidentally made public, with metadata such as which user uploaded them and when. Normally the app would get the images through Cloudfront, a CDN on top of the S3 buckets. Unfortunately the underlying S3 buckets are severely misconfigured.\n The photo and video buckets are unauthenticated and  even allow ListObjects. The keys in the bucket are in the format  {profile_uuid}-{timestamp}-{filename}, so there is plenty of abuse potential. For one, a competitor can dump the keys and find out the exact number of users on the app. Or an attacker can see all the photos uploaded by a victim once the profile UUID is known.\n Side note: As far as I can tell, the profile UUID are randomly generated server-side when the profile is created. So that part is unlikely to be so easy to guess. The filename is controlled by the client; the server accepts any filename, however the in the client app it is hardcoded to  upload.jpg.\n The vendor has since disabled public ListObjects. However, I still think there should be some randomness in the key. A timestamp cannot serve as secret.\n  Link preview is one thing that is hard to get right in a lot of messaging apps. There are typically three strategies for link previews:\n Sender-side link previews When a message is composed, the link preview is generated under the sender’s context.\n Recipient-side link previews Note that this method could leak some context about the recipient, such as the IP address, user agent, and other headers.\n Server-side link previews Server can fetch the link for preview either on message sent, or when message is opened.\n An attacker controlled external server could return a different response if the request comes from the link preview server, thus sending a fake preview to recipient.\n The League uses  recipient-side link previews. When a message includes a link to an external image, the link is fetched on user’s device when the message is viewed. This would effectively allow a malicious sender to send an external image URL pointing to an attacker controlled server, obtaining recipient’s IP address when the message is opened.\n A better solution might be just to attach the image in the message when it is sent (sender-side preview), or have the server fetch the image and put it in the message (server-side preview). Server-side previews will allow additional anti-abuse scanning. It might be a better option, but still not bulletproof.\n  The app will sometimes attach the authorization header to requests that do not require authentication, such as Cloudfront GET requests. It will also gladly give out the bearer token in requests to  external domains in some cases.\n One of those cases is the external image link in chat messages. We already know the app uses recipient-side link previews, and the request to the external resource is executed in recipient ’s context. The authorization header is included in the GET request to the external image URL. So the bearer token gets leaked to the external domain. When a malicious sender sends a image link pointing to an attacker controlled server, not only do they get recipient ’s IP, they  ...\n Note that unlike phishing, this attack  does not require the victim to click on the link. When the message containing the image link is viewed, the app automatically leaks the session token to the attacker.\n It seems to be a bug related to the reuse of a global OkHttp client object. It would be best if the developers make sure the app only attaches authorization bearer header in requests to  The League API.\n  I did not find any particular interesting vulnerabilities in CMB, but that does not mean CMB is more secure than  The League. (See  Limitations and future research). I did find a few security issues in  The League, none of which were particularly difficult to discover or exploit. I guess it really is the common mistakes people make over and over. OWASP top ten anyone?\n As consumers we need to be mindful with which companies we trust with our data.\n  I did receive a prompt response from  The League after sending them an email alerting them of the findings.\n I think startups could certainly offer bug bounties. It is a nice gesture, and more importantly, platforms like HackerOne provide researchers a legal path to the disclosure of vulnerabilities. Unfortunately neither of the two apps in the post has such program.\n  This research is not comprehensive, and  should not be seen as a security audit. Most of the tests in this post were done on the network IO level, and very little on the client itself. Notably, I did not test for remote code execution or buffer overflow type vulnerabilities. In future research, we could look more into the security of the client applications.\n   Static analysis would also be possible, I could try fuzzers or automated scanning tools. However it might not be so simple if the APKs are ProGuard-obfuscated.\n   David Siu, VP of Engineering at  The League, for the quick turnaround when the vulnerabilities were reported.", "posttime": "2020-05-03 11:46:12", "tags": "app,设计,逆向,engineered", "title": "所以我逆向设计了两个约会应用", "title_en": "So I reverse engineered two dating apps", "transed": 1, "url": "https://push32.com/post/dating-app-fail/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["app", "设计", "逆向"]}, {"category": "", "categoryclass": "", "imagename": "05aabe37dfc9c2b1ade87de6a4091612.jpg", "infoid": 1000445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名躲藏在俄罗斯暗杀阴谋指控中的捷克政客表示，他相信针对他的威胁是可信的，他担心自己的生命安全。\n三名布拉格政客因涉嫌密谋毒死他们而受到24小时警察看守-莫斯科断然否认这一指控。\n布拉格第六区市长翁德雷·科勒(Ondrej Kole)在一个戒备森严的秘密地点接受BBC采访时说，这非常困难。\n我很久没见我的孩子了，他们也没见过我。就连我的家人也不知道我在哪里，他通过Skype告诉我，现在Skype是他与外界沟通的唯一手段。\n我隐约认识科勒先生。我们都曾在布拉格的纽约大学工作过。\n他明亮的蓝色纸板背景，上面写着布拉格6区，看起来很眼熟。然后我想起来了。\n我们最后一次见面是在布拉格6区议会投票决定移动苏联元帅伊万·科涅夫的青铜雕像前不久。这位二战指挥官有很多优点，但历史学家一致认为，他并不像基座曾经宣称的那样，是布拉格的解放者。\n雕像竖立于1980年，但科涅夫是一个有争议的人物，他监督了苏联对1956年匈牙利起义的残酷镇压，并帮助粉碎了1968年的布拉格之春。\n俄罗斯政府对移除纪念碑表示愤怒，甚至威胁要采取法律行动。\n科勒市长主持了理事会会议，我不得不等待。我坐在接待室里--在一块明亮的大屏幕下。显然，他已经把屏幕带到了他的秘密藏身之处。\n有些事情我不能评论。但我能说的是，捷克警方和特勤局确实都有一些情报，可能直接来自俄罗斯方面的威胁，他告诉我。\n这一威胁的性质最早是在捷克调查性周刊Respekt的一篇简短但爆炸性的文章中阐明的，它直接出自一本间谍小说。\n该刊物援引匿名情报来源的话说，三周前，一名持俄罗斯外交护照旅行的男子带着一个装有致命蓖麻毒素的行李箱抵达布拉格机场。\n据报道，他被一辆印有俄罗斯外交牌照的汽车接走，并被带到离翁德雷·科勒在布拉格6号办公室不远的俄罗斯大使馆。\n雷斯佩特声称，捷克情报机构认为，这名男子对近几个月来激怒莫斯科的两名城市政客构成了直接威胁：翁德雷·科勒(Ondrej Kole)和首都市长兹德内克·赫里布(Zdenek Hrib)。\n赫里布最近监督将俄罗斯大使馆前的区域更名为鲍里斯·涅姆佐夫广场(Boris Nemtsov Square)，以纪念2015年被谋杀的俄罗斯总统弗拉基米尔·普京(Vladimir Putin)的著名反对者。\n第二天，另一份出版物Denik N声称，莫斯科的第三位批评者-当地市长帕维尔·诺沃特尼(Pavel Novotny)-也得到了警方的保护。\n来自俄罗斯的否认是迅速和毫不含糊的。大使馆说，这份报告完全没有根据。普京的发言人德米特里·佩斯科夫(Dmitry Peskov)驳斥了这则新闻报道，称其是假的。\n一名外交部女发言人告诉BBC，他们不会对媒体公布的泄密事件发表评论，尽管她确实证实了一名经认可的俄罗斯外交官已经抵达机场，估计是在冠状病毒封锁期间仍在运行的为数不多的航班之一。\n随着这些令人瞠目结舌的指控在世界各地闪现，引发了愤怒、怀疑和嘲笑的混合情绪，记者和外交官们开始打起电话来。有-持续的怀疑，包括经验丰富的俄罗斯观察家。\n暗杀欧洲首都的市长将等同于战争行为。这对克里姆林宫来说会适得其反，简直是疯了。\n来自捷克反情报部门的一个消息来源是…。不能完全确认。但这远非否认。这位消息人士告诉我，媒体的报道是以事实信息为基础的。\n他告诉BBC，我们知道过去俄罗斯特勤局及其特工试图用神经毒剂毒死斯克里帕尔时发生了什么。\n2018年，俄罗斯前间谍谢尔盖·斯克里帕尔(Sergei Skripal)和他的女儿在索尔兹伯里被毒死，据信是由俄罗斯情报机构派遣的特工。\n当他们有勇气在英国做这件事的时候，为什么不在布拉格做呢？", "note_en": "A Czech politician in hiding amid allegations of a Russian assassination plot says he believes the threat against him is credible and he fears for his life.\n Three Prague politicians are under 24-hour police guard because of the alleged plot to poison them - claims categorically denied by Moscow.\n &#34;It&#39;s very difficult,&#34; said Ondrej Kolar, mayor of Prague&#39;s sixth district, speaking to the BBC from an undisclosed location under heavy police guard.\n &#34;I haven&#39;t seen my children for quite a long time, and they haven&#39;t seen me. Even my family doesn&#39;t know where I am,&#34; he told me via Skype, now his only means of communication with the outside world.\n I vaguely know Mr Kolar. We both once worked at New York University in Prague.\n  His bright blue cardboard backdrop, with the words &#34;Prague 6 Municipal District&#34;, looked familiar. Then I remembered.\n The last time we met was shortly before a vote at Prague 6 district council to move the bronze statue of Soviet Marshal Ivan Konev. That World War Two commander was many things, but historians agree he was not, as the plinth once claimed, the &#34;liberator of Prague&#34;.\n The statue was erected in 1980, but Konev was a controversial figure who oversaw the Soviets&#39; brutal suppression of the 1956 Hungarian Uprising and helped crush the Prague Spring of 1968.\n  The Russian government has reacted angrily to the monument&#39;s removal and has even threatened legal action.\n Mayor Kolar was leading the council meeting and I had to wait. I sat in an antechamber - under a large, bright blue screen. He had apparently taken the screen to his undisclosed hiding place.\n &#34;There are things I cannot comment on. But what I can say is that both the Czech police and the secret service do have some intel that there might be a threat directly from the Russian side,&#34; he told me.\n   The nature of that threat, first elucidated in a brief but explosive piece in the investigative Czech weekly Respekt, is straight out of a spy novel.\n Three weeks ago, claimed the publication, citing unnamed intelligence sources, a man travelling on a Russian diplomatic passport arrived at Prague airport carrying a suitcase containing the deadly poison ricin.\n According to the report, he was picked up by a car bearing Russian diplomatic plates and taken to the Russian embassy, not far from Ondrej Kolar&#39;s office in Prague 6.\n Czech intelligence services, Respekt claimed, deemed the man to be a direct threat to two city politicians who had angered Moscow in recent months: Ondrej Kolar, and Zdenek Hrib, the capital&#39;s mayor.\n Mr Hrib recently oversaw the renaming of the area in front of the Russian embassy as Boris Nemtsov Square, honouring a prominent opponent of President Vladimir Putin murdered in 2015.\n  The following day another publication, Denik N, claimed a third critic of Moscow - local mayor Pavel Novotny - was also receiving police protection.\n   The denials from Russia were swift and unequivocal. The report, said the embassy, had &#34;absolutely no basis&#34;. Mr Putin&#39;s spokesman Dmitry Peskov dismissed the news report as &#34;fake&#34;.\n  A foreign ministry spokeswoman told the BBC they would &#34;not comment on the leaks published in the media&#34;, although she did confirm that an accredited Russian diplomat had arrived at the airport, presumably on one of the few flights still running during the coronavirus lockdown.\n As the jaw-dropping allegations flashed around the world, prompting a mixture of outrage, disbelief and ridicule, journalists and diplomats began working their phones. There was - there is - persistent scepticism, including amongst seasoned Russia-watchers.\n  Assassinating the mayor of a European capital would be tantamount to an act of war. It would be so counter-productive to the Kremlin it would be simply insane.\n  From a source within Czech counter-intelligence, there was… not confirmation exactly. But far from a denial. The media reports, the source told me, were grounded in factual information.\n  &#34;We know what happened in the past with the Russian secret service and its agents trying to poison Mr Skripal with a nerve agent,&#34; he told the BBC.\n  Russian former spy Sergei Skripal and his daughter were poisoned in Salisbury in 2018, by agents thought to have been sent by Russian intelligence.\n &#34;When they have the guts to do this in the United Kingdom, why not do it in Prague?&#34;", "posttime": "2020-05-03 11:46:01", "tags": "阴谋,poison,俄罗斯,russian", "title": "神秘的“毒害阴谋”让捷克市长们躲了起来", "title_en": "Mystery 'poison plot' sends Czech mayors into hiding", "transed": 1, "url": "https://www.bbc.com/news/world-europe-52500865", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["阴谋", "poison", "俄罗斯", "russian"]}, {"category": "", "categoryclass": "", "imagename": "c237e40c5b6f52cf489de306234d0296.jpg", "infoid": 1000444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1883年8月27日，地球发出了比此后任何时候都大的噪音。\n当声音从位于印度尼西亚爪哇和苏门答腊岛之间的喀拉喀托亚岛传出时，已经是当地时间上午10点02分了。1300英里外的安达曼和尼科巴群岛(“听到了异常响亮的枪声”)；2000英里外的新几内亚和西澳大利亚(“一系列响亮的报告，类似于西北方向的炮声”)；甚至3000英里外毛里求斯附近的印度洋罗德里格斯岛*(“来自……。\n想一想，这有多疯狂。如果你在波士顿，有人告诉你他们听到从纽约市传来的声音，你可能会给他们一个滑稽的眼神。但是波士顿距离纽约只有200英里。我们在这里谈论的就像是在波士顿，清楚地听到从爱尔兰都柏林传来的噪音。以音速旅行(每小时766英里或1233公里)，噪音需要大约4个小时才能走完这段距离。这是最..。\n那么，是什么可能产生如此惊天动地的巨响呢？据一位目睹了喀拉喀托火山1的地质学家说，喀拉喀托的一座火山刚刚喷发，威力如此之大，将该岛撕裂，冒出的浓烟高达17英里(约合17公里)。你可以利用这一观测结果来计算出火山喷出的东西是以每小时1600英里(约合每小时1600英里)的速度喷出的，也就是每秒近半英里(约合每秒0.5公里)。这是音速的两倍多。\n这次爆炸造成了致命的海啸，浪高超过100英尺(30米)。165个沿海村庄和定居点被冲走，完全被摧毁。总体而言，荷兰人(当时的印度尼西亚殖民统治者)估计死亡人数为36，417人，而其他人估计的死亡人数超过120，000人2，3人。\n爆炸发生时，英国船只诺勒姆城堡号距离喀拉喀托40英里。船长在他的日志中写道：“爆炸是如此猛烈，以至于我一半以上的船员的耳膜都被震碎了。我最后的想法是和我亲爱的妻子在一起。我相信审判的日子已经到来。“。\n一般来说，声音不是由世界末日引起的，而是由气压的波动引起的。巴达维亚天然气厂(距离喀拉喀托100英里)的气压计记录到了随后的压力峰值，超过2.5英寸的水银1，2。这会转化为超过172分贝的声压，这是一种难以想象的巨大噪音。把它放在上下文中，如果你在操作手提钻，你会受到大约100分贝的影响。人类对疼痛的阈值接近130分贝，如果你有.。\n当你哼唱一个音符或说一个词时，空气分子每秒会来回摆动几十次或数百次，导致一些地方的气压很低，而另一些地方的气压很高。声音越大，这些摆动就越剧烈，气压的波动也就越大。但是声音的响度是有限度的。在某些时候，气压的波动是如此之大，以至于低压区域达到零压力--真空--你就不能得到。\n在喀拉喀托附近，声音远远超过了这个极限，产生了一股如此强大的高压空气，以至于40英里外的水手的耳膜都破裂了。随着这一声音传播了数千英里，到达澳大利亚和印度洋，压力的摆动开始减弱，听起来更像是远处的枪声。行程超过3000英里后，压力波变得太安静，人的耳朵听不见，但它继续向前席卷，回荡了好几天……。\n到1883年，世界各地数十个城市的气象站都在使用气压计来跟踪大气压力的变化。喀拉喀托爆炸发生6小时47分钟后，加尔各答检测到气压激增。8小时后，脉搏西至毛里求斯，东至墨尔本和悉尼。到了12小时，圣彼得堡注意到了脉搏，紧随其后的是维也纳、罗马、巴黎、柏林和慕尼黑。到了18小时，脉搏已经到达纽约、华盛顿特区和多伦多。\n总体而言，来自喀拉喀托的压力波每个方向绕地球三到四圈。(每个城市都感觉到了多达7个压力峰值，因为它们经历了从火山1向相反方向传播的冲击波。)。与此同时，远至印度、英国和旧金山的潮汐观测站测量到与这种空气脉冲同步的海浪上升，这是以前从未见过的效果。这是一种再也听不到的声音，但仍在继续移动……。\n最近，一对夫妇在巴布亚新几内亚度假时拍摄的一段令人难以置信的火山喷发家庭视频开始在互联网上流传。如果你仔细观察，这段视频会让你对火山产生的压力波有一种感觉。\n当火山喷发时，它会产生突然的气压峰值；你", "note_en": "On 27 August 1883, the Earth let out a noise louder than any it has made since.\n It was 10:02 AM local time when the sound emerged from the island of Krakatoa, which sits between Java and Sumatra in Indonesia. It was heard 1,300 miles away in the Andaman and Nicobar islands ( “extraordinary sounds were heard, as of guns firing ”); 2,000 miles away in New Guinea and Western Australia ( “a series of loud reports, resembling those of artillery in a north-westerly direction ”); and even 3,000 miles away in the Indian Ocean island of Rodrigues, near Mauritius* ( “coming from  ...\n Think, for a moment, just how crazy this is. If you ’re in Boston and someone tells you that they heard a sound coming from New York City, you ’re probably going to give them a funny look. But Boston is a mere 200 miles from New York. What we ’re talking about here is like being in Boston and clearly hearing a noise coming from Dublin, Ireland. Travelling at the speed of sound (766 miles or 1,233 kilometers per hour), it takes a noise about 4 hours to cover that distance. This is the most  ...\n So what could possibly create such an earth-shatteringly loud bang? A volcano on Krakatoa had just erupted with a force so great that it  tore the island  apart, emitting a plume of smoke that reached 17 miles into the atmosphere, according to a geologist who witnessed it 1. You could use this observation to  calculate that  stuff spewed out of the volcano at over 1,600 miles per hour—or nearly half a mile per second. That’s more than twice the speed of sound.\n This explosion created a deadly tsunami with waves over a hundred feet (30 meters) in height. One hundred sixty-five coastal villages and settlements were swept away and entirely destroyed. In all, the Dutch (the colonial rulers of Indonesia at the time) estimated the death toll at 36,417, while other estimates exceed 120,000 2,3.\n The British ship Norham Castle was 40 miles from Krakatoa at the time of the explosion. The ship’s captain wrote in his log, “So violent are the explosions that the ear-drums of over half my crew have been shattered. My last thoughts are with my dear wife. I am convinced that the Day of Judgement has come.” 2\n  In general, sounds are caused not by the end of the world but by fluctuations in air pressure. A barometer at the Batavia gasworks (100 miles away from Krakatoa) registered the ensuing spike in pressure at over 2.5 inches of mercury 1,2 . That converts to over 172 decibels of sound pressure, an unimaginably loud noise. To put that in context, if you were operating a jackhammer you ’d be subject to about 100 decibels. The human threshold for pain is near 130 decibels, and if you had the  ...\n When you hum a note or speak a word, you ’re wiggling air molecules back and forth dozens or hundreds of times per second, causing the air pressure to be low in some places and high in other places. The louder the sound, the more intense these wiggles, and the larger the fluctuations in air pressure. But there ’s a limit to how loud a sound can get. At some point, the fluctuations in air pressure are so large that the low pressure regions hit zero pressure —a vacuum —and you can ’t get  ...\n Closer to Krakatoa, the sound was well over this limit, producing a blast of high pressure air so powerful that it ruptured the eardrums of sailors 40 miles away. As this sound travelled thousands of miles, reaching Australia and the Indian Ocean, the wiggles in pressure started to die down, sounding more like a distant gunshot. Over 3,000 miles into its journey, the wave of pressure grew too quiet for human ears to hear, but it continued to sweep onward, reverberating for days across  ...\n  By 1883, weather stations in scores of cities across the world were using barometers to track changes in atmospheric pressure. Six hours and 47 minutes after the Krakatoa explosion, a spike of air pressure was detected in Calcutta. By 8 hours, the pulse reached Mauritius in the west and Melbourne and Sydney in the east. By 12 hours, St. Petersburg noticed the pulse, followed by Vienna, Rome, Paris, Berlin, and Munich. By 18 hours the pulse had reached New York, Washington DC, and Toronto  ...\n In all, the pressure waves from Krakatoa circled the globe three to four times in each direction. (Each city felt up to seven pressure spikes because they experienced shock waves travelling in opposite directions from the volcano 1.) Meanwhile, tidal stations as far away as India, England, and San Francisco measured a rise in ocean waves simultaneous with this air pulse, an effect that had never been seen before. It was a sound that could no longer be heard but that continued moving  ...\n Recently, an incredible home video of a volcanic eruption taken by a couple on vacation in Papua New Guinea started making the rounds on the Internet. If you watch closely, this video gives you a sense for the pressure wave created by a volcano.\n  When the volcano erupts, it produces a sudden spike in air pressure; you can actually watch as it moves through the air, condensing water vapor into clouds as it travels. The people taking the video are (fortunately) far enough away that pressure wave takes a while to reach them. When it does finally hit the boat, some 13 seconds after the explosion, you hear what sounds like a huge gunshot accompanied by a sudden blast of air. Multiplying 13 seconds by the speed of sound tells us  ...\n   [1] Judd, John Wesley, et al.  The Eruption of Krakatoa: And Subsequent Phenomena . Trübner &amp; Company, 1888. (a comprehensive data-filled report of the Krakatoa eruption commissioned by the Royal Society, accessible for free under public domain)\n  [3] Simkin, Tom, and Richard S. Fiske.  Krakatau, 1883, the Volcanic Eruption and Its Effects . Smithsonian Inst Pr, 1983.\n Thanks to  Nicole Sharp and  Will Slaton for helpful discussions about the physics of the Krakatoa explosion.\n     Aatish Bhatia is a recent physics Ph.D. working  at Princeton University to bring science and engineering to a wider audience. He writes the award-winning science blog  Empirical Zeal, hosted at Wired , and is on Twitter as  @aatishb.", "posttime": "2020-05-03 11:23:54", "tags": "地球,loud,火山,pressure", "title": "声音如此响亮，以至于它绕地球四圈", "title_en": "The Sound So Loud That It Circled the Earth Four Times", "transed": 1, "url": "http://m.nautil.us/blog/the-sound-so-loud-that-it-circled-the-earth-four-times", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["地球", "loud", "火山", "pressure"]}, {"category": "", "categoryclass": "", "imagename": "0344c12f159721e82cdfdcfd43161517.png", "infoid": 1000443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在TextPattern 4.7.3问世一年后，TextPattern团队自豪地宣布发布TextPattern CMS 4.8.0，可立即下载。\n尽管TextPattern 4.8.0在版本号方面是一个次要版本，但TextPattern的代码已经做了800多处更改，以添加新功能、增强现有特性、解决以前TextPattern版本中的一些问题，并为将来扩展TextPattern的功能奠定更多基础。\nTextPattern的严肃标签系统已经获得了一些令人印象深刻的改进和新产品。我们将在博客帖子中告诉您更多关于这些变化的信息，包括我们的用户如何利用TextPattern的力量来实现令人惊叹的事情的例子，所以请继续关注。\nTextPattern生态系统的一个组成部分是我们的用户社区。开发人员、管理员、设计人员和最终用户合作构建TextPattern的价值和力量是不可估量的。无论是故障排除、建议和反馈方面的帮助，还是值得分享的优雅的代码诗句，推动它向前发展的都是TextPattern背后的社区力量。\n感谢为此版本做出贡献的每个人，他们提供了代码以实现新功能、报告和解决错误、提供和改进语言翻译以及对TextPattern生态系统中的代码、文档和丰富信息进行全面改进。我们感谢每一位继续在他们的专业知识、时间、注意力、语言、信号增强、布道和其他活动方面提供帮助的人。\n您可以使用以下链接从textpattern.com下载TextPattern，也可以直接从GitHub存储库下载。请花点时间在GitHub上‘星级’TextPattern的存储库。\n无论您是从textpattern.com还是从GitHub下载，各自的文件内容都是相同的。要充分利用TextPattern的多站点功能，请下载.tar.gz存档，因为它包含多站点脚手架。\nTextPattern演示已更新，可在完全安全的情况下提供TextPattern 4.8.0测试驱动。使用TextPattern自动安装程序每隔几个小时重新构建一次演示站点。\nTextPattern 4.8至少需要PHP5.5作为系统要求的一部分，不过强烈建议使用供应商支持的PHP版本(在撰写本文时，PHP7.3和PHP7.4具有积极的和持续的支持)。\n它还需要安装SimpleXML扩展。大多数服务器已经内置了此功能，因此您应该可以使用主机的PHP。\n与任何TextPattern版本一样，请确保在升级之前注销管理员端，执行并验证完整站点备份(数据库和文件，包括任何上传)，并参考下载档案中的readme.txt文件以获取详细说明。\nTextPattern 4.8.0 HISTORY.txt概述了此TextPattern版本和以前的TextPattern版本的更改。我们建议您阅读更改列表，以了解这可能会如何影响您当前的站点，特别是当您正在从旧版本升级时。\n如果您需要澄清发行说明的任何方面，我们建议您在开始站点升级之前寻求建议。TextPattern支持论坛是一个很好的起点，TextPattern用户文档会定期更新，其中包含示例、解释和背景信息。\n已更改：可以从具有无值‘EXCLUDE’属性的&lt；txp：SECTION_LIST&gt；输出中省略不可搜索的部分。\n为&lt；txp：较新的/&gt；和&lt；txp；较旧的/&gt；标记添加了‘pg’、‘Total’和‘Limit’属性。\n添加：全局“评估”、“替换”和“产出”属性。EVALUATE可以按任意顺序执行包含的内容。\n已修复：&lt；txp：CATEGORY_LIST&gt；‘Sort’Attribute尊重‘Categories’属性，而不需要Sort=“”Override。\n通过config.php文件禁用配置单元管理主题中自动扩展文本区的选项。有关说明，请参阅蜂窝主题的readme.txt文件。\n删除了过时的“无寡妇字”首选项设置。如果需要此功能，可以直接使用&lt；txp：title/&gt；标记实现。\n优化了根目录.htaccess的范围，并在/files/和/textpattern/中列出了受限制的目录，以及它们各自的.htaccess。\n如果您发现任何工作不正常或希望提出改进建议，请在GitHub上报告，并说明受影响的版本和任何重要信息。有用于功能请求和错误报告的模板。\n我们希望您喜欢这个版本，它很好地服务于您、您的网站和客户！", "note_en": "A year to the day since the arrival of Textpattern 4.7.3, Team Textpattern is proud to announce the release of Textpattern  CMS 4.8.0, available for immediate  download.\n Although Textpattern 4.8.0 is a  minor release in terms of its version number, over 800 changes have been made to Textpattern’s code to add new functionality, enhance existing features, resolve some issues from previous Textpattern releases and lay more foundations for extending the capabilities of Textpattern in future.\n Textpattern’s no-nonsense tag system has received some impressive improvements and new arrivals. We’ll tell you more about these changes in blog posts, including examples of how our users are harnessing the power of Textpattern to achieve amazing things, so please stay tuned.\n An integral part of the Textpattern ecosystem is our user community. The value and strength of developers, administrators, designers, and end users working together to build on Textpattern is incalculable. Whether it’s help with troubleshooting, advice &amp; feedback, translating, or elegant code poetry that deserves to be shared, it’s the power of community behind Textpattern that drives it forward.\n Thank you to everyone who contributed to this release with code for new functionality, reporting &amp; resolving bugs, providing &amp; improving  language translations and overall improvements to the code, documentation and the wealth of information in the Textpattern ecosystem. We’re grateful to everyone who continues to help with their expertise, time, attention, words, signal boosting, evangelism and other activities.\n  You can download Textpattern from textpattern.com using the following links, or from  the GitHub repository directly. Please take a moment to ‘star’  Textpattern’s repositories on GitHub.\n Whether you download from textpattern.com or GitHub, the respective file contents are identical. To take full advantage of Textpattern’s  multi-site capabilities, please download the  .tar.gz archive as it includes the multi-site scaffold.\n     The  Textpattern demo has been updated to offer Textpattern 4.8.0 test drives in complete safety. The demo sites are rebuilt every few hours using the Textpattern auto-installer.\n  Textpattern 4.8 requires a  minimum of  PHP 5.5 as part of the  system requirements, though a vendor-supported  PHP version is  highly recommended ( PHP 7.3 and  PHP 7.4 have active and ongoing support at the time of writing).\n It also requires the SimpleXML extension to be installed. Most servers have this built in already so you should be good to go with your host’s  PHP.\n  As with any Textpattern release, please ensure you log out of the admin side prior to upgrade, perform and verify a full site backup (database and files, including any uploads), and refer to the  README.txt file in the download archives for detailed instructions.\n  The  Textpattern 4.8.0  HISTORY.txt outlines changes for this and previous Textpattern releases. We recommend you read the list of changes to understand how this may affect your current site, especially if you’re upgrading from older versions.\n If you require clarification on any aspect of the release notes, we recommend you seek advice  before starting a site upgrade. The  Textpattern support forum is an excellent place to start, and the  Textpattern user documentation is regularly updated with examples, explanations and background information.\n     Changed: Non-searchable sections can be omitted from  &lt;txp:section_list&gt; output with valueless ‘exclude’ attribute.\n                    Added: ‘pg’, ‘total’ and ‘limit’ attributes to  &lt;txp:newer /&gt; and  &lt;txp:older /&gt; tags.\n      Added: Global ‘evaluate’, ‘replace’ and ‘yield’ attributes. Evaluate can execute contained content in arbitrary order.\n    Fixed:  &lt;txp:category_list&gt; ‘sort’ attribute respects ‘categories’ attribute instead of requiring sort=”“ override.\n      Option to disable auto-expanding text areas in Hive admin themes via  config.php file. See Hive theme’s  README.txt file for instructions.\n      Removed obsolete ‘No widowed words’ preference setting. If this feature is needed it can be implemented directly with  &lt;txp:title /&gt; tag.\n        Refined scope of root  .htaccess, and restricted directory listing in  /files/ and  /textpattern/ with their respective  .htaccess.\n        If you find anything not working correctly or wish to propose enhancements, please  report them on GitHub, stating the affected version(s) and any salient information. There are templates for feature requests and bug reports.\n We hope you enjoy this release and it serves you, your sites and clients well!", "posttime": "2020-05-03 11:01:49", "tags": "textpattern", "title": "TextPattern CMS 4.8.0", "title_en": "Textpattern CMS 4.8.0", "transed": 1, "url": "https://textpattern.com/weblog/423/textpattern-cms-480-released", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "cb2d1a540dce44787179dcc5f54abf92.jpeg", "infoid": 1000441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "宜家最新发布的产品将绿色环保提升到了一个全新的水平。事实上，新的产品设计允许用户根据人口的不同，为整个街区或社区种植食物。\n这些蓝图可在网上免费下载，旨在组装城市结构，用于种植通常只能在农村地区种植的农产品。\nGrowroom起源于一项建筑竞赛，为城市居民提供了以可持续和自然的方式种植自己的食物的能力，而不必购买大片土地。\n官方建筑是由Sine Lindholm和Mads-Ulrik Husumtoin设计的，他们是宜家创新创意实验室Space 10的建筑师。只需用胶合板、螺丝、锤子和当地的制造实验室就可以建造它，专家们强调，这一点如今非常常见。\n虽然不是每个人每天甚至每个月都会使用这些资源，但最近的技术进步使得几乎每个大城市都可以作为至少一套3D打印和激光切割工具的东道主。\n宜家在一份新闻稿中表示：“这意味着大多数人在理论上 -  - 几乎可以自己生产任何东西。”正如打印机现在无处不在；本地的和按需的，定制生产可能成为未来的标准。我们正在通过发布Growroom的剪辑文件来挖掘这一新兴的潜力。“。\n“当地食品代表着全球食品模式的一种重要选择。它减少了食物里程，减少了我们对环境的压力，并教育我们的孩子食物实际上是从哪里来的。餐桌上的结果同样令人着迷。“。\n对于担心自己健康或经历严重食物过敏或不耐症的人来说，选择批量种植自己的农产品可以显著提高他们的生活质量。\n此外，家庭食品的增长减少了对环境的压力，并教育消费者，特别是儿童，了解他们的食物实际来自哪里。随后，生产的食物质量更高，因此更富营养，更新鲜，更有机。通常情况下，它的味道甚至更好。\n最重要的是，随着人口的持续增长，像育儿室这样的建筑将有助于满足日益增长的粮食需求。\nGrowroom的工作高度为2.8x2.5米，其设计目的是让普通的城市房主可以组装和保养它。所用材料的成本也被考虑在内，以开发出尽可能负担得起的产品。\n重叠的层使其成为结构，以便在其每一层上接收光和水。\nSPACE10展望了一个未来，在那里我们更多地在当地种植我们自己的食物。引发关于我们如何将自然带回我们的城市的对话。", "note_en": "IKEA’s latest release takes going green to a whole new level. In fact, the new product design allows for users to grow food for an entire block or neighborhood, depending on population.\n Available online for free download, the blueprints are intended for the assembly of an urban structure used to grow produces that normally can only be grown in rural areas.\n The Growroom, which originated as part of an architectural competition, provides urban residents the ability to grow their own food in sustainable and natural ways, without having to purchase a large section of land.\n The official structure is designed by Sine Lindholm and Mads-Ulrik Husumtoin, architects who are part of Space 10, IKEA’s innovative idea lab. It can be built with as little as plywood, screws, a hammer and access to a local fab lab, which experts stress are very common these days.\n Although not everyone utilizes these resources daily or even monthly, recent technological advancements have allowed for the nearly every major city to serve as a host for at least one set of 3-D printing and laser cutting tools.\n “This means most people — in theory — could produce almost anything themselves,”, IKEA offered in a press release. “Just as printers are now ubiquitous; local and on-demand, customized production could become the norm of the future. We’re tapping into this emerging potential by releasing the cutting files for The Growroom.”\n   “Local food represents a serious alternative to the global food model. It reduces food miles, our pressure on the environment, and educates our children of where food actually comes from. The result on the dining table is just as fascinating.”\n For individuals concerned about their health or who experience severe food allergies or intolerances, the option to grow one’s own produce in bulk could significantly improve their quality of living.\n Additionally, home food growth reduces pressure on the environment and educates consumers, especially children on where their food actually comes from. Subsequently, the food produced is a higher quality, and therefore is more nutrient rich, fresh, and organic. It typically even tastes better.\n Most importantly, structures like The Growroom will help meet the demand for increased food as the population continues to grow.\n How It Works At 2.8 x 2.5 meters, The Growroom is designed so the average individual urban homeowner can assemble and care for it. The cost of materials used was also taken into consideration, as to develop the most affordable product possible.\n Overlapping layers make it so the structure receives light and water on each of its levels.\n SPACE10 envision a future, where we grow our own food much more locally. To spark conversations about how we can bring nature back into our cities.", "posttime": "2020-05-03 10:39:34", "tags": "发布,免费,宜家,设计,releases", "title": "宜家发布免费花园球体设计，满足整个社区的需求", "title_en": "IKEA Releases Free Design for Garden Sphere That Feeds Entire Neighborhood", "transed": 1, "url": "https://earthwithoutpoverty.com/2020/04/24/ikea-releases-free-design-for-garden-sphere-that-feeds-entire-neighborhood", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["发布", "免费", "宜家", "设计", "releases"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000439, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "传染病研究和政策中心(CIDRAP)的一组研究人员表示，冠状病毒的爆发在60%到70%的人口对该病毒具有免疫力之前不会结束，这可能需要18到24个月的时间。\n专家们就冠状病毒大流行将如何进展提出了三种情况。在这三种预测中，最糟糕的情况是今年秋季和冬季会出现第二波更大规模的感染。报告作者认为这是最有可能的结果，各州需要为此做好准备。\n报告作者、CIDRAP负责人迈克尔·奥斯特霍尔姆告诉CNN，在感染60%到70%的人之前，这种病毒是不会停止的。这个想法很快就会完成，这是对微生物学的挑战。\n奥斯特霍尔姆和他的同事们检查了预测未来冠状病毒影响的多个模型，研究了冠状病毒在人与人之间传播的情况，以及过去大流行的数据，以得出他们的结论。\n冠状病毒的爆发与大流行性流感有重要的相似之处，比如1918年的西班牙流感(导致全球5亿人死亡)，这使得这种类型的流感成为一个可靠的比较模型。\n大流行性流感和冠状病毒都是通过我们咳嗽或打喷嚏时释放的飞沫传播的，并可以在没有任何症状的感染者之间传播-称为无症状携带者。但是，即使大流行性流感可能是一个很好的模型来尝试和预测冠状病毒将如何爆发，专家们仍然不确定会发生什么。\n这是因为冠状病毒比流感更容易传播；一个冠状病毒携带者平均感染2到2.5个新的人：这一指标被称为病毒R0值。季节性流感的RO值约为1.3。\n报告的作者写道，没有水晶球可以告诉我们未来会发生什么，控制这场流行病的终局将是什么。\n这就是为什么奥斯特霍尔姆的研究小组对第一波冠状病毒感染结束后可能会发生的情况提出了三种可能的情景。\n在这个预测中，第一波冠状病毒波之后是一系列重复的、较小的波，整个夏天都会发生。这些感染人数较少的浪潮将持续一到两年的时间，并在2021年的某个时候逐渐减弱。\n作者们指出，这些较小的浪潮发生在哪里，可能取决于某些地理区域采取了什么措施来拉平曲线，包括社会疏远和非必要的企业关闭，以及这些措施是如何回滚的。\n这三种情况中最糟糕的，也是最有可能的一种情况是，第一波之后是2020年秋季或冬季的更大浪潮，以及2021年的一个或多个较小的后续浪潮。\n这与1918年西班牙流感大流行和2009年H1N1流感期间的情况如出一辙。\n作者写道，感染更多的第二波将要求美国和其他国家重新实施缓解措施，如封锁。\n最后一种情况表明，这第一波冠状病毒感染是唯一的一波。在接下来的几个月里，冠状病毒大流行将转变为正在进行的传播和新病例的缓慢燃烧。\n专家报告说，虽然这第三种模式在过去的流感大流行中没有出现，但冠状病毒仍有可能出现。\n这种可能性将意味着美国各州很可能不需要再次封锁，尽管病例和死亡事件仍将继续发生。\n但报告作者说，疫苗在大流行期间能够提供的任何帮助都将是很长一段时间的事情。疫苗最早有望在2021年问世。\n他们补充说，我们不知道疫苗开发过程中可能会出现什么样的挑战，可能会推迟时间表。", "note_en": "A group of researchers at the Center for Infectious Disease Research and Policy (CIDRAP) suggest that the COVID-19 outbreak won&#39;t end until 60% to 70% of the human population  is immune to the virus, which may take between 18 and 24 months.\n The experts laid out three scenarios for how the  coronavirus pandemic will progress. The worst-case scenario among these three projections involves a second, larger wave of infections this fall and winter. The report authors suggest this is the most likely outcome, and states need to prepare for it.\n &#34;This thing&#39;s not going to stop until it infects 60 to 70% of people,&#34; Michael Osterholm, report author and the director of CIDRAP,  told CNN. &#34;The idea that this is going to be done soon defies microbiology.&#34;\n     Osterholm and his colleagues examined multiple  models that predict future coronavirus impacts, research about how well COVID-19 spreads between people, and data from past pandemics to reach their conclusions.\n The coronavirus outbreak shares important similarities to a pandemic influenza, like the 1918 Spanish flu (which killed 500 million people worldwide), which makes this type of flu a solid model for comparison.\n Both a pandemic influenza and the COVID-19 virus spread via droplets we emit when coughing or sneezing and can pass between infected people showing no symptoms — known as  asymptomatic carriers. But even though pandemic influenza may be a good model to try and predict how the COVID-19 will outbreak will play out, experts still aren&#39;t sure what to expect.\n That&#39;s because the coronavirus spreads even more easily than the flu does; an average person with the coronavirus infects between 2 and 2.5 new people: a metric known as the virus&#39;  R0 value. Seasonal influenza&#39;s Ro value is  about 1.3.\n   &#34;There is no crystal ball to tell us what the future holds and what the &#39;end game&#39; for controlling this pandemic will be,&#34; the report authors wrote.\n That&#39;s why Osterholm&#39;s group came up with three possible scenarios about what might be coming after this first wave of coronavirus infections ends.\n    In this projection, the first COVID-19 waves is followed by a series of repetitive, smaller waves that occur through the summer. Those waves, which come with a lower number of infections with persist over a one- to two-year period, gradually diminishing sometime in 2021.\n The authors noted that where those smaller waves occur could depend on what measures certain geographic areas have in place to  &#34;flatten the curve,&#34; including social distancing and non-essential business closures, and how those measures are rolled back.\n     The worst of the three scenarios, and the most likely, is one in which the first wave is followed by a larger wave in the fall or winter of 2020, and one or more smaller subsequent waves in 2021.\n This mirrors what happened  during the 1918 Spanish influenza pandemic and the 2009 H1N1 flu.\n A second wave with more infections would require the US and other countries to reinstitute mitigation measures, like lockdowns, the authors wrote.\n      The final scenario suggests that this first wave of coronavirus infections is the only wave. In the coming months, the COVID-19 pandemic would shift into a &#34;slow burn&#34; of ongoing transmission and new cases.\n &#34;While this third pattern was not seen with past influenza pandemics, it remains a possibility for COVID-19,&#34; the experts reported.\n This possibility would mean US states likely wouldn&#39;t need to lockdown again, although cases and deaths would continue to occur.\n    But any help a vaccine could provide during the pandemic will be a long time coming, the report authors said. The earliest a vaccine is expected  is 2021.\n &#34;And we don&#39;t know what kinds of challenges could arise during vaccine development that could delay the timeline,&#34; they added.", "posttime": "2020-05-03 10:17:05", "tags": "coronavirus,病毒,冠状病毒,可能,pandemic", "title": "研究称冠状病毒大流行可能持续两年并在秋季死灰复燃", "title_en": "Coronavirus pandemic may last 2 years and resurge in fall, study says", "transed": 1, "url": "https://www.businessinsider.com/coronavirus-pandemic-could-last-2-years-resurge-in-fall-2020-5", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "可能", "pandemic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，我计划做一次演讲，主题是探索Clojure源代码的历史，寻找有趣的埋藏着的文物。为了实现该目标，我遍历了存储库中的每个提交，以查看我能找到什么。确实有一些有趣的发现，但最终我对演讲的热情消散了。然而，我最近找到了我的笔记，所以我没有让它们永远消失，而是在下面原封不动地展示它们。请原谅我写得不好。", "note_en": "Years ago I planned to give a talk centered around exploring the Clojure source history to find interesting buried artifacts. In service to that goal I walked every commit in the repository to see what I could find. There were indeed interesting discoveries, but eventually my passion for giving the talk  1 dissipated. However, I recent found my notes and so rather than let them disappear forever I present them unfiltered below. Excuse my poor handwriting.", "posttime": "2020-05-03 09:46:08", "tags": "代码,clojure,目标,talk", "title": "漫游Clojure源代码历史：一次未给出的演讲", "title_en": "Walking the Clojure source history: a talk not given", "transed": 1, "url": "http://blog.fogus.me/2020/05/01/walking-the-clojure-source-history-a-talk-not-given/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["代码", "clojure", "目标", "talk"]}, {"category": "", "categoryclass": "", "imagename": "830d6c69dd668fa1cac40d9800a464e6.jpg", "infoid": 1000437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在典型的一天里，我们会与11到16个偶然认识的人互动-例如，我们每天早上看到的咖啡师或我们在走廊上打招呼的同事。在冠状病毒大流行期间，随着我们中的许多人练习身体距离，这些曾经常见的互动已经消失，我们的社会关系仅限于与家人和亲密朋友更正式、更预定-而且往往是令人精疲力竭的签到。作者对如何重新调整非正式用法提出了建议。\n桌上的iPhone嗡嗡作响。艾希礼叹了口气。在经历了三个星期的灭火工作后，她的第一个想法是，“现在出了什么问题？”\n不过，这条短信不是来自焦虑的客户或学生。取而代之的是，一位不经意的熟人写道：“艾希礼，你好吗？在这个冠状病毒的环境里我一直在想你和你的搭档。希望你们都没事！“。艾希礼的眼睛里涌出了泪水。她比她意识到的更需要登记入住。而且，听到一位她有一段时间没有联系的同事的来信也是一个很好的惊喜。\n也许我们可以从一位熟人的这条突如其来的短信中学到一些东西。在这个情感耗尽的时间里，快速、非正式的签到能提供一种方式来满足我们对社交的需求，而不会把社交变成一件苦差事吗？\n越来越多的研究表明，与不起眼的熟人联系有着惊人的强大益处--社会学家称之为“弱关系”的关系。\n吉莉安在意识到每天在去校园的路上被热狗摊主认出，或者让当地宠物店老板巴里(Barry)叫出她的猫的名字后，开始研究弱关系。她的研究发现，人们在走廊里与同事打招呼或在杂货店与邻居简短交谈时会更快乐。在Gillian的另一项研究中，被要求“个性化.。\n可以肯定的是，我们的朋友和家人-我们牢固的纽带-在我们情绪低落的时候支持我们，让我们感到被赏识。但是弱关系也可以做这些事情：不仅仅是在电影中，人们从他们的理发师那里得到社会支持。当服务器看到我们并知道我们的“惯常”是什么时，我们会觉得自己被看到了。事实上，我们与弱关系的互动往往特别顺利，因为我们经常与我们不认识的人保持最好的行为。\n在正常的一天里，人们在上班的路上、跑腿的时候或在办公室开会的休息时间，都会与11到16个弱关系打交道。\n由于身体上的距离，这些曾经常见的互动已经被根除，我们不再有身体上的提醒，我们是更广泛的社交网络的一部分。45个州已经发布了一些变体的居家命令。当我们冒险购买必需品或散步时，我们会看到面孔半掩在面具后面，我们几乎肯定不能互动。在意大利这样的国家，你可能会因为这些而面临牢狱之灾。\n由于弱纽带相互作用不是自发发生的，我们需要改为启动它们。不过，我们不习惯这样做，所以可能会觉得有点尴尬。事实上，即使在冠状病毒之前，我们也不是自然倾向于接触薄弱的关系。这是因为我们不确定对方是否会感兴趣，我们担心这些对话会让人不舒服。幸运的是，这些担忧是没有根据的。当人们被分配到..。\n那么，我们如何才能克服我们过度的恐惧，并与薄弱的关系培养积极的、非正式的互动呢？以下是五个有科学依据的战略：\n电话可能会让人觉得有侵扰性，而电子邮件似乎没有人情味。取而代之的是，试着通过短信或Facebook联系“弱领带”。这将允许对方在他们可能的任何时候做出回应，所以你不必担心在错误的时间伸出援手。\n当向弱关系伸出援手时，拒绝率极低--在吉莉安的一项研究中，与陌生人交谈的人中，只有不到12%的人经历过拒绝。然而，在大流行期间，许多人感到不知所措，一些人可能没有反应。\n如果你得不到回应，不要往心里去。提醒自己，向弱关系伸出援手的意义在于让这个人知道你在为他们着想。重新定义你的期望：把这种互动想象成在走廊里对同事微笑。你是在向另一个人承认并打招呼。也许你会说几分钟--但如果你不说，也没问题。\n与其期待回复，不如享受这样的知识：你的信息可能会带来一些快乐，也许，就像对阿什利所做的那样，可能会让某人的一天变得真正不同。\n你的目标是让别人知道你在为他们着想，并打开机会", "note_en": "On a typical day, we interact with somewhere between 11 and 16 casual acquaintances —for example, the barista we see every morning or the colleague we greet in the hallway. During the Covid-19 pandemic, with many of us practicing physical distancing, these once-common interactions have disappeared, and our social ties have been limited to more formal, scheduled —and often exhausting —check-ins with family and close friends. The authors offer suggestions on how to repurpose the informality  ...\n  The iPhone on the table buzzed. Ashley sighed. After three weeks of putting out fires while working through feelings of  grief and  stress, her first thought was, “Now what’s wrong?”\n  Except, this text message wasn’t from an anxious client or student. Instead, a casual acquaintance had written: “Ashley, how are you? I’ve been thinking about you and your partner in this Covid-19 environment. I hope you are both okay!” Ashley’s eyes welled up. She needed that check-in more than she realized. And, it was a nice surprise to hear from a colleague she hadn’t caught up with for a while.\n  Perhaps there is something to be learned from this out-of-the-blue text message from an acquaintance. Can quick, informal check-ins provide a means to satisfy our need for social connection without turning socializing into a chore during this emotionally exhausting time?\n    A growing body of research suggests that there are surprisingly powerful benefits to connecting with casual acquaintances — relationships that sociologists call “weak ties.”\n  Gillian started studying weak ties after realizing how good it felt to be recognized by the owner of the hot dog stand that she passed on her way to campus each day, or to have Barry, the local pet store owner, ask about her cat by name.  Her research finds that people are happier on days when they say “hi” to a colleague in the hallway or have a brief conversation with a neighbor at the grocery store. In  another of Gillian’s studies, people who were asked to “personalize  ...\n         To be sure, our friends and family — our strong ties — support us when we’re feeling down and make us feel appreciated. But weak ties can do these things too: It’s not just in the movies that people get social support from their hairdresser. We feel seen when a server smiles upon seeing us and knows what our “usual” is. In fact, our interactions with weak ties tend to go  especially smoothly, since we are often  on our best behaviorwith people we don ’t know  ...\n    In a normal day, people interact with somewhere between  11 and 16 weak ties on the way to work, while running errands, or on a break between meetings at the office.\n  Due to physical distancing, these once-common interactions have been eradicated, and we no longer have physical reminders that we are part of a wider social network.  Forty-five states have issued some variation of a stay-at-home order. When we do venture out for essential supplies or to take a walk, we see faces that are half hidden behind masks, and we most definitely are not allowed to interact. In countries like Italy, you can face  jail timefor these  ...\n  Since weak-tie interactions aren’t happening spontaneously, we need to initiate them instead. However, we aren’t used to doing this, so it may feel a little awkward. In fact, even before Covid-19, it was not our natural inclination to reach out to weak ties. This is because we aren’t sure if the other person will be interested, and we worry that these conversations will be uncomfortable. Luckily, these fears are unfounded. When people  are assignedto  ...\n  So, how can we overcome our overblown fears and cultivate positive, informal interactions with weak ties? Here are five scientifically based strategies:\n      Phone calls can feel intrusive, and emails seem impersonal. Instead, try reaching out to a “weak tie” via text message or Facebook. This will allow the other person to respond whenever they can, so you don’t need to worry about reaching out at the wrong time.\n    Rejection rates when reaching out to a weak tie are extremely low — in one of Gillian’s studies fewer than 12% of people who talked to strangers experienced a rejection. However, during the pandemic, many people are feeling overwhelmed and some may not respond.\n  If you don’t get a response, don’t take it personally. Remind yourself that the point of reaching out to a weak tie is to let this person know that you are thinking about them. Reframe your expectations: Think about this interaction as smiling at a colleague in the hallway. You’re acknowledging and saying hello to the other person. Perhaps you’ll talk for a few minutes — but if you don’t that’s fine too.\n  Instead of expecting a reply, enjoy the knowledge that your message is likely to deliver a little hit of happiness, and maybe, like it did for Ashley, could make a real difference in someone’s day.\n    Your goal is to let the other person know you are thinking about them and open up the opportunity to chat,  ifthey want to. It ’s okay to keep the conversation short: In recent data one of us collected, a “just right ”conversation with a stranger was about 10 minutes long. If you set the expectation that you only have a few minutes, this lets you both off the hook, and helps you avoid the feeling that socializing is another endless “to-do.  ...\n    Expressing gratitude is a powerful way to improve mood. If you had a colleague who inspired you, or a mentor who gave you excellent career advice, let them know you are thinking of them. Or you could reach out to someone you shared fun times but have lost touch with. You’ll both enjoy the  nostalgic flashback.\n    If you aren’t sure what to write about,  share something personal about yourself — like a photo of your pet or child doing something cute and/or funny. Sharing aspects of yourself helps to build positive rapport and encourages the other person to reciprocate.\n    Now that our social interactions are often limited to strong ties, and we schedule hour-long calls and board game nights to spend quality time together, we are at risk for becoming burned out. In data that we’ve collected post-Covid-19, we found that the more time that people spent interacting with colleagues and friends online, the more stressed out they felt.\n    As these data suggest, scheduled social interactions are exhausting. Also, they do not work for everyone. People in different time zones, with bad internet connection, who are juggling demanding care-giving and work responsibilities might not have time for formal means of connection that require advanced scheduling, like family or company-mandated happy hours.\n  We can repurpose the informality and spontaneity of weak-tie interactions to help us stay connected while reducing the risk of burnout. Right now, the best social interactions are those that tell others you are thinking of them, without an expectation of a return of time, energy, or attention.\n  If studying weak ties has taught us anything, it is that we need to  practice self-compassion. We might not have the energy for 1.5 hour long social calls every day. That is perfectly alright.\n  The best research shows that even a few minutes of texting is enough to improve your mood and spread joy within your social network — perhaps more than that never-ending game of Pictionary.\n  We might be missing out on our weak tie interactions right now, but it is in our power to create them. An informal hello with a colleague — or your mother — is only a short text message away.\n  Gillian Sandstrom is a senior lecturer in psychology at the University of Essex. Her current research focuses on how to make difficult conversations a little easier (e.g., talking about cancer, miscarriage, bereavement) and how to encourage people to talk to strangers.\n    Ashley Whillans is an assistant professor in the negotiations, organizations, and markets unit at the Harvard Business School. Her research focuses on time, money, and happiness. Her first book   Time Smart: How to Reclaim Your Time &amp; Live a Happier Life will be published by Harvard Business Publishing in October 2020.", "posttime": "2020-05-03 09:23:46", "tags": "熟人,benefits,可能,people", "title": "“弱关系”的好处研究--与偶然的熟人建立联系", "title_en": "Research on the benefits of “weak ties” – connecting with casual acquaintances", "transed": 1, "url": "https://hbr.org/2020/04/why-you-miss-those-casual-friends-so-much", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["熟人", "benefits", "可能", "people"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LIT有两个模块：LIT和UTIL。它们都被设计得尽可能小，并且易于扩展。\nLIT包含框架的所有基本要素，例如响应式网格、版式和其他元素。", "note_en": "lit has two modules: lit and util. Both of them are designed to be as small as possible, and easy to extend.\n  lit contains all of the basics for a framework, such as a responsive grid, typography, and other elements.", "posttime": "2020-05-03 09:23:41", "tags": "响应,ridiculously,lit", "title": "LIT：一个小得可笑的响应性CSS框架", "title_en": "Lit: A ridiculously small responsive CSS framework", "transed": 1, "url": "https://ajusa.github.io/lit/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["响应", "lit"]}]