[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿尔茨海默氏症患者在病情出现前几年可能会经历睡眠障碍，但事实证明，究竟是一种原因导致另一种，还是更复杂的事情正在进行中，科学家一直很难确定。\n现在，美国的研究人员已经揭开了这个谜团，这项工作为新疗法带来了希望，以及“良好的睡眠卫生”如何有助于解决该疾病及其症状。\n研究结果表明，人类的24小时生物钟控制着大脑清除与阿尔茨海默病有关的任性蛋白质的能力。如果科学家们是对的，这项工作将至少部分解释昼夜节律的中断和睡眠障碍如何影响阿尔茨海默病的发病和进展，以及防止这种中断如何避免这种疾病。\n纽约伦斯勒理工学院领导这项研究的詹妮弗·赫尔利博士说：“昼夜节律的紊乱与阿尔茨海默氏症的诊断有关，有人认为睡眠的中断可能是阿尔茨海默氏症的早期预警信号。”。\n当大脑中的神经细胞之间失去联系时，阿尔茨海默氏症就会发作。这种疾病是渐进性的，与大脑中不断累积的异常斑块和蛋白质缠结有关。这种疾病是痴呆症最常见的病因，影响着英国50多万人，这个数字还将上升。\n为了保持大脑健康，被称为小胶质细胞的免疫细胞寻找并破坏可能在大脑中积累的麻烦蛋白质。细胞靶向的一种蛋白质被称为淀粉样β蛋白，这是阿尔茨海默氏症的标志。\nHurley和她的团队在《公共科学图书馆·遗传学》杂志上发表文章，描述了他们如何在小胶质细胞中发现一种日常节律，这种节律驱动着蛋白质清除的规则波。当细胞失去昼夜节律时，清除程序就开始动摇。\nHurley说：“β-淀粉样蛋白清除的适当时机的中断可能是我们看到阿尔茨海默病期间大脑中形成的斑块增多的原因之一。”。\n虽然睡眠障碍通常出现在阿尔茨海默病之前，但赫尔利和其他许多科学家怀疑两者之间存在复杂的相互作用。Hurley说，扰乱睡眠和昼夜节律会导致β-淀粉样蛋白的积累，但这反过来会破坏运行昼夜节律的脑细胞，导致β-淀粉样蛋白的进一步积累。\nHurley说：“我们已经知道大脑中β淀粉样蛋白的清除有一个节律。”。“随着年龄的增长，老年痴呆症患者的这种节律会消失。这种节律的消失可能会导致大脑中β淀粉样蛋白的增加。”\n但研究结果指出，治疗可能会降低阿尔茨海默氏症的风险或减轻症状的严重程度。Hurley说，通过简单的干预，如暴露在光下，或通过更复杂的疗法来增强免疫细胞的活性，可能会刺激大脑清除β淀粉样蛋白的能力。\n她说：“照顾好我们的睡眠或昼夜节律——有时被称为良好的睡眠卫生——可能能够在我们的一生中减轻β淀粉样蛋白的负担。”。“减少淀粉样蛋白负荷可能意味着阿尔茨海默症症状的减轻或疾病的发病或进展的延迟。”", "note_en": "People who develop Alzheimer’s disease can experience sleep disturbances years before the condition takes hold, but whether one causes the other, or something more complex is afoot, has always proved hard for scientists to determine.\n Now, researchers in the US have shed light on the mystery, in work that raises hopes for new therapies, and how “good sleep hygiene” could help to tackle the disease and its symptoms.\n  The findings show that humans’ 24-hour circadian clock controls the brain’s ability to mop up wayward proteins linked to Alzheimer’s disease. If the scientists are right, the work would explain, at least in part, how disruption to circadian rhythms and sleep disturbances might feed into the onset and progression of Alzheimer’s disease, and how preventing such disruption might stave off the condition.\n “Circadian disruption is correlated with Alzheimer’s diagnosis and it has been suggested that sleep disruptions could be an early warning sign of Alzheimer’s disease,” said Dr Jennifer Hurley, who led the research at Rensselaer Polytechnic Institute, in New York.\n Alzheimer’s takes hold when connections are lost between nerve cells in the brain. The disease is progressive and linked to abnormal plaques and tangles of proteins that steadily build up in the brain. The disease is the most common cause of dementia and affects more than half a million people in the UK, a figure that is set to rise.\n To keep the brain healthy, immune cells called microglia seek out and destroy troublesome proteins that threaten to accumulate in the brain. One type of protein targeted by the cells is called amyloid beta, a hallmark of Alzheimer’s.\n Writing in the journal  Plos Genetics, Hurley and her team describe how they found a daily rhythm in microglia, which drove regular waves of protein-clearing. When the cells lost their circadian rhythm, the clearing routine faltered.\n “The disruption of the proper timing of amyloid beta clearance could be one of the reasons we see an increase in plaques that form in the brain during Alzheimer’s disease,” Hurley said.\n While sleep disturbances often arise before Alzheimer’s disease, Hurley and many other scientists suspect there is a complex interplay between the two. Disrupting sleep and circadian rhythms allowed amyloid beta to build up, Hurley said, but this in turn damaged brain cells that ran the circadian clock, causing further accumulation of amyloid beta.\n “We have known for a while that there is a rhythm in the clearance of amyloid beta in the brain,” Hurley said. “As we age, and more so in Alzheimer’s patients, this rhythm disappears. This loss could lead to the increase of amyloid beta in the brain.”\n But the findings point to therapies that could potentially reduce the risk of Alzheimer’s or lessen the severity of the symptoms. Hurley said it may be possible to stimulate the brain’s ability to clear out amyloid beta with simple interventions, such as exposure to light, or via more sophisticated therapies that boost the activity of the immune cells.\n “Taking care of our sleep or circadian rhythms – sometimes called good sleep hygiene – may be able to reduce amyloid beta burden over our lifespan,” she said. “Reducing amyloid burden could mean a reduction in Alzheimer’s symptoms or a delay in the onset or progression of the disease.”", "posttime": "2022-02-15 08:43:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发现,finds,可能", "title": "研究发现老年痴呆症和生物钟之间存在联系", "title_en": "Study Finds Link Between Alzheimer's and Circadian Clock", "transed": 1, "url": "https://www.theguardian.com/society/2022/feb/10/study-finds-link-between-alzheimers-and-circadian-clock", "via": "", "real_tags": ["发现", "finds", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东西总是掉下来。也许你掉了个球。也许那杯咖啡从你手中溜走了。最有可能的情况是，一只猫决定从桌子上敲掉一个物体，因为&#39；猫就是这么做的。\n而且，只要情况一直在下降，人们就会对正在发生的事情（以及猫的动机）产生疑问。坠落物体是以恒定的速度移动，还是加速？如果你同时落下一个重的物体和一个轻的物体，哪个落得更快？\n这两个问题的好处在于，你几乎可以问任何人，即使他们真的错了，他们也会有答案。更重要的是它&#39；It’通过实验确定答案相当简单。你所要做的就是扔掉一些东西。\n一些最早的解释可以追溯到亚里士多德（约公元前350年），他对解释世界是如何运转的很感兴趣。亚里士多德&#39；他的答案很简单：如果你放开某件东西，它就会掉到地上。它将以恒定的速度下落。如果你同时落下两个物体，较重的物体将以比较轻物体更快的速度向下移动。那&#39；就这样。真的，这似乎是真的。我的意思是，如果我扔下一块石头和一根羽毛，很明显，石头会先撞到地面。\n但有一个问题。那里&#39；这不是检验这是否正确的实验。亚里士多德是一位哲学家，而不是科学家。和他那个时代的大多数希腊哲学家一样，他热衷于思想实验，而不是科学实验。（希腊人知道不可能有一个完美的实验，因为数据中总会引入一些错误。他们认为，寻找不完美的现实世界证据只会让他们偏离通过逻辑和推理确定宇宙终极真理的道路。）\n亚里士多德&#39；他对这种运动的推理实际上是有道理的。我们都同意，如果你推动某个东西，它就会移动。推力越大，它移动的速度就越快。这是有道理的，对吧？如果你拿着一块石头和一根羽毛，岩石上的引力显然更大。当你把两个物体举起来比较它们时，你可以感觉到这种力量。那里&#39；这并不神秘。因此，如果岩石有更大的向下拉力，那么它将有更大的向下下落速度。如果你把一块石头和一根羽毛掉到地上，石头会先掉到地上。看见物理学不是&#39；没那么难。\n尽管这个解释有道理，但它确实是错误的。事实上，唯一正确的是，通常情况下，岩石会在羽毛之前撞击地面。\n要了解原因，让&#39；让我们从力和运动之间最基本的关系开始。大多数人称之为牛顿&#39；第二定律，但如果你使用“力运动模型”，那也会很酷。对于一维运动（比如下落物体），我们可以这样写：\n也就是说，作用在物体上的总力（F net）等于物体的乘积&#39；s质量（m）和加速度（a）。\n但加速度是什么？简而言之，这是一个描述速度如何变化的值。因此，每秒0米的加速度意味着速度赢了&#39；不要改变。10米/秒2的加速度意味着在1秒内，物体#39；s的速度将以每秒10米的速度增加。重要的是力会改变物体的速度。如果某物有更大的力量，它就不会&#39；我不能走得更快。变化更大。改变是关键。\n那里&#39；不过这是个小问题。当你把一块石头从离地面齐肩的高度扔下时，只需要半秒钟就可以掉下来。那&#39；it’时间不多肯定不足以让一个人决定&#39；它在加速。看起来它落得很快。事实上，人眼很擅长检测物体是否移动，但在判断速度变化方面却不太擅长。（请观看Veritasium关于人类如何追踪物体的精彩视频。）所以它&#39；It’很难指责任何人（比如亚里士多德）说事物以恒定的速度下落。在肉眼看来确实如此。\n好吧，但是扔一块石头和一根羽毛不&#39；石头不是先击中的吗？通常，答案是肯定的。但是让我们&#39；让我们用锤子代替石头，然后换个环境，把实验搬到月球上去。这正是1971年阿波罗15号登月任务期间发生的事情。指挥官大卫·斯科特拿起一把锤子和一根鹰羽毛，把它们扔到月球表面。这里&#39；事情是这样的：\n为什么会这样？首先，即使在月球上，锤子上的引力也确实大于羽毛上的引力。我们可以用质量（m单位为千克）和引力场（g单位为牛顿每千克）的乘积来计算引力。在月球表面，引力场的值为1.6 N/kg。如果你用这个表达式来表示坠落物体上的净力，它看起来是这样的：\n由于引力和加速度都依赖于相同的质量，它&#39；方程两边都是s，然后相消。这使得加速度为-g。锤子和羽毛以相同的运动落下，同时撞击地面。老实说，我&#39；我只是有点难过宇航员没有&#39；不要用质量更高的胶卷相机代替电视相机，但是&#39；只有我。\n那么，什么&#39；把东西扔到月球和地球有什么不同？是的，月球上有不同的引力，但那&#39；这不是问题所在。它&#39；这是因为缺少空气造成的。记住牛顿&#39；s第二定律是净力和加速度之间的关系。如果你把羽毛掉到地球表面，有两种力作用在它上面。首先，向下的引力等于质量和引力场的乘积。第二，由于与空气的相互作用，有一个向上的推力，我们通常称之为空气阻力。这种空气阻力取决于几件事，但重要的是物体#39；速度和物体的大小。\n让&#39；让我们看一个简单的例子。假设羽毛的质量为0.01公斤。这将给它一个0.098牛顿的向下引力。现在想象羽毛以每秒1米的速度向下移动，这会产生0.04牛顿的向上空气阻力。这意味着净力为0.04 N-0.098 N=-0.058 N。与无空气阻力的物体相比，该物体的向下加速度为5.8 m/s 2，该物体的加速度为9.8 m/s 2。\n是的，下落的岩石也有向上推动的空气阻力。如果它的大小和羽毛一样，并且以同样的速度移动，那么它向上的阻力将是0.04牛顿。然而，如果它的质量是1公斤，那么向下的引力将是9.8牛顿。净力为9.4 N，产生9.4 m/s 2的加速度。因为岩石&#39；它的质量越大，加速度就越大，它会首先撞击地面，至少在地球上是这样。\n较重的物体总是比较轻的物体先着地吗？不。这里有一些简单的实验，你可以在家里做，以证明亚里士多德是错的。（额外奖励：你甚至不需要去月球做这些事情。）\n第一个实验使用两张纸，即从打印机上获得的普通纸。如果这些碎片是相同的，那么它们具有相同的质量和相同的向下引力。现在只拿一张床单，把它揉成一个球。这会减小对象的大小，但不会减小其质量。当你把普通纸和皱巴巴的纸扔到地上时，哪一张会先掉到地上？\n哦，你没有&#39；你没带纸吗？好吧，下面是它的样子：\n你可以看到，即使两张纸的质量完全相同，皱巴巴的纸还是会先击中。就在这里，亚里士多德被捕了。\n但是等等，这是另一个实验。这一个需要更复杂的对象。看看你能不能得到一个表面积大但质量小的东西。例如，我有一块纸板和一小片粉笔。纸板的质量确实更大（100克而粉笔为1克）。但如果我把它们扔了，哪一个会先掉到地上？让&#39；让我们来看看。\n看看这个。多亏了空气阻力，粉笔后面的纸板更大。\n亚里士多德又错了。（如果你在没有空气阻力的月球上重复这两次比较，物体会同时撞击月球表面。）\n我们真的要一路飞到月球去展示东西是如何坠落的吗？当然不是。但它&#39；它仍然是最酷的物理演示之一；我见过。我能&#39；Don’不要等到下次再来&#39；他是月球上的宇航员。希望这次他们能使用更好的摄像机。\n🏃🏽‍♀️ 想要最好的健康工具吗？查看我们的装备团队挑选的最佳健身追踪器、跑步装备（包括鞋子和袜子）和最佳耳机", "note_en": "Stuff falls all the time. Maybe you’ve dropped a ball. Perhaps that cup of coffee slipped out of your hands. The mostly likely situation is that a cat decided to knock an object off a table—because that&#39;s what cats do.\n And for as long as things have been falling, people have had questions about what is going on (and about the cat&#39;s motivation). Does a falling object move at a constant speed, or does it speed up? If you drop a heavy object and a light one at the same time, which will fall faster?\n The great thing about these two questions is that you can ask pretty much anyone and they will have an answer—even if they are actually wrong. The even greater thing is that it&#39;s fairly simple to determine the answers experimentally. All you have to do is drop some stuff.\n  Some of the earliest explanations for what happens when you drop things go all the way back to Aristotle (around 350 BC), who was interested in explaining how the world works. Aristotle&#39;s answers were quite simple: If you let go of something, it will fall toward the ground. It will fall at a constant speed. If you drop two objects at the same time, the heavier one will move downward with a greater speed than the lighter one. That&#39;s it. And really, this seems like it could be true. I mean, if I drop a rock and a feather, it seems clear that the rock will hit the ground first.\n But there is a problem. There&#39;s not an experiment to check if this is correct. Aristotle was a philosopher, not a scientist, and like most of the other Greek philosophers of his time, he was into thought experiments, not science experiments. (The Greeks knew that there couldn&#39;t be a perfect experiment, because some error would always be introduced into the data. They thought that seeking imperfect real-world evidence would just push them off the path of determining the ultimate truths of the universe through logic and reasoning.)\n  Aristotle&#39;s reasoning for this kind of motion actually makes sense. We can all agree that if you push something, it will move. The greater the pushing force, the more it will move—that means it would go faster. That makes sense, right? And if you hold a rock and a feather, the gravitational force on the rock is clearly greater. You can just feel that force when you lift the two objects up to compare them. There&#39;s no mystery there. So if the rock has a greater downward-pulling force, then it will have a greater downward falling velocity. If you drop a rock and a feather, the rock will hit the ground first. See? Physics isn&#39;t that hard.\n  Well, even though this explanation makes sense, it is indeed wrong. Really, the only thing that is correct is that normally a rock will hit the ground before a feather.\n  To understand why, let&#39;s start with the most basic idea—the relationship between force and motion. Most people call this Newton&#39;s second law, but if you go with “force-motion model,” that would be cool too. For movement in one dimension (like with a falling object), we can write this as:\n  This says that the total force on an object (F net) is equal to the product of the object&#39;s mass (m) and the acceleration (a).\n But what is the acceleration? In short, this is a value that describes how the velocity changes. So, an acceleration of 0 meters per second per second means that the velocity won&#39;t change. An acceleration of 10 m/s 2 means that in 1 second, the object&#39;s velocity will increase by 10 meters per second. The important thing is that forces  change the velocity of an object. If something has a greater force, it doesn&#39;t move faster.  It changes more. Change is the key.\n There&#39;s a small problem, though. When you drop a rock from shoulder height above the ground, it will only take about half a second to fall. That&#39;s not very much time—certainly not enough for a person to determine that it&#39;s speeding up. It just looks like it falls very fast. In fact, the human eye is pretty good at detecting if something moves, but not so great at judging changes in speed. (Check out  this awesome video from Veritasium on how humans track objects.) So it&#39;s hard to fault anyone (like Aristotle) for saying things fall at a constant speed. It really does look that way to the naked eye.\n OK, but what about dropping a rock and feather—doesn&#39;t the rock hit first? Usually, the answer is yes. But let&#39;s replace the rock with a hammer and then just take a change of scenery and move the experiment to the moon. This is exactly what happened during the  Apollo 15 lunar mission in 1971. Commander David Scott took a hammer and an eagle feather and dropped them onto the lunar regolith. Here&#39;s what happened:\n  Why did it happen? First, it is indeed true that even on the moon there is a greater gravitational force on the hammer than the feather. We can calculate this gravitational force as the product of mass (m in kilograms) and the gravitational field (g in newtons per kilogram). On the surface of the moon, the gravitational field has a value of 1.6 N/kg. If you put this expression in for the net force on a falling object, it looks like this:\n  Since both the gravitational force  and the acceleration depend on the same mass, it&#39;s on both sides of the equation and cancels. That leaves an acceleration of -g. The hammer and the feather fall down with identical motions and hit the ground at the same time. Honestly, I&#39;m just a little sad that the astronauts didn&#39;t use one of the higher-quality film cameras instead of a TV camera—but that&#39;s just me.\n  So, what&#39;s different about dropping something on the moon versus on Earth? Yes, there is a different gravitational weight on the moon—but that&#39;s not the issue. It&#39;s the lack of air that makes the difference. Remember that Newton&#39;s second law is a relationship between the net force and the acceleration. If you drop a feather on the surface of the Earth, there are  two forces acting on it. First, there is the downward-pulling gravitational force that is equal to the product of mass and the gravitational field. Second, there is an upward-pushing force due to the interaction with the air, which we often call  air drag. This air drag force depends on several things, but the important ones are the object&#39;s speed and the size of the object.\n  Let&#39;s look at a simple example. Suppose the feather has a mass of 0.01 kilograms. This would give it a downward gravitational force of 0.098 newtons. Now imagine the feather is moving downward with a velocity of 1 meter per second, and this produces an upward air drag force of 0.04 newtons. This means that the net force would be 0.04 N - 0.098 N = -0.058 N. That would give a downward acceleration of 5.8 m/s 2 compared to an object without air resistance, which would have an acceleration of 9.8 m/s 2.\n Yes, a falling rock  also has an upward-pushing air drag force. If it was the same size as the feather and moving at the same speed, it would have the same upward drag force of 0.04 N. However, if it has a mass of 1 kilogram, then its downward gravitational force would be 9.8 newtons. The net force would be 9.4 N, to produce an acceleration of 9.4 m/s 2. Because of the rock&#39;s larger mass, it would have a much greater acceleration and it would hit the ground first—at least on Earth.\n Do heavier objects  always hit the ground before lighter ones? Nope. Here are some simple experiments you can do at home to show that Aristotle was wrong. (Bonus: You don&#39;t even need to go to the moon to do them.)\n The first experiment uses two sheets of paper—just plain paper that you can get from your printer. If the pieces are identical, then they have the same mass and the same downward gravitational force. Now take just one of those sheets and crumple it up into a ball. This decreases the size of the object, but not its mass. When you drop the normal paper and the crumpled paper, which one will hit the ground first?\n Oh, you don&#39;t have any paper with you? Fine, here is what that looks like:\n  You can see that the crumpled paper hits first—even though the two pieces have the exact same mass. Right there, Aristotle is busted.\n But wait, here’s another experiment. This one requires more complicated objects. See if you can get something with a large surface area but a low mass. For example, I have a piece of cardboard and a tiny piece of chalk. The cardboard is indeed more massive (100 grams vs. 1 gram for the chalk). But if I drop them, which will hit the ground first? Let&#39;s find out.\n  Check that out. Thanks to air resistance, the more massive cardboard hits after the chalk.\n  Again, Aristotle was wrong. (And if you repeated both of those comparison drops on the moon, where there isn&#39;t air resistance, the objects would hit the surface at the same time.)\n Did we really have to go all the way to the moon to show how things fall? Of course not. But it&#39;s still one of the coolest physics demos I&#39;ve ever seen. I can&#39;t wait for a repeat the next time there&#39;s  an astronaut on the moon. Hopefully, this time they will use a better video camera.\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2022-02-15 08:38:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "演示,physics,物体", "title": "有史以来最伟大的物理学演示发生在月球上", "title_en": "The Greatest Physics Demo of All Time Happened on the Moon", "transed": 1, "url": "https://www.wired.com/story/the-greatest-physics-demo-of-all-time-happened-on-the-moon/", "via": "", "real_tags": ["演示", "physics", "物体"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他们先来下棋，现在来玩电子游戏。在21世纪，一大群人工智能竞争者很可能主宰人类玩的每一块棋盘、屏幕和控制台。像深蓝和Alpha Go这样的著名机器已经征服了世界上一些最复杂的战略难题。\n日本科技巨头索尼（Sony）周三透露，它已经为赛车模拟器Gran Turismo训练了有史以来最强大的对手。Gran Turismo是一款可以在自己的比赛中击败顶级电子竞技车手的冠军。AI racer机器人是在1000多台PlayStation 4游戏机的战场上打造而成的，它已经变得足够聪明，能够识别最佳路线，并能够执行熟练的战术机动来超越或阻挡竞争对手，即使是在车辆拥挤的情况下。索尼声称，它在这样做的同时，仍然尊重游戏中的人类礼仪。\n该公司本周在《自然》杂志上发表了关于其名为Gran Turismo Sophy的创意产品的研究。报告称，开发过程将“最先进、无模型、深度强化学习算法与混合场景训练相结合，以学习一种综合控制策略，该策略将卓越的速度与令人印象深刻的战术结合起来。”。“此外，我们还构建了一个奖励函数，使代理人能够在遵守比赛重要但不违反规定的体育道德规则的同时保持竞争力。”\n在一次媒体播放的演示中，索菲在迎头比赛中击败了四名世界顶级赛车手，证明了这项技术相对于普通人的优越性。但索菲的愿望是永远不要粉碎人类的精神，或让它感到失败。相反，这是为了在电子竞技中激发新的激情，尤其是在那些认为自己没有什么挑战可以应对的精英球员中。\n“我感到沮丧，这在与人工智能作战之前从未发生过，”四名赛车手之一山中智明在失利后说。“我开车的时候就像是要撞上一个人。这真是一件了不起的事情。”\n从这个意义上说，索菲突破了人类的极限；索尼人工智能（Sony AI）首席执行官北野博明（Hiroaki Kitano）在一份声明中表示，它可以“将玩家的技术和创造力提升到一个新的水平。”。该公司表示，正在探索将Sophy整合到Gran Turismo未来版本中的方法（该游戏的第七版将于3月发布）。\nGran Turismo现在加入了一长串人工智能击败人类的游戏，包括shogi、Go、星际争霸、经典的Atari视频游戏，以及多人系列《古代防御》，微软支持的OpenAI为这些游戏创建了一个战斗机器人。\n但Gran Turismo比其他游戏机更复杂，要求玩家平衡摩擦物理和空气动力学，同时做出瞬间判断，并通过光速反射对不断变化的地形做出反应。除此之外，专家们还表示，Sophy的成就突出表现在其行为具有攻击性，但仍然公平，并遵守玩家的行为准则，而不仅仅是法律条文，换句话说，体现了人类性格的微妙差别。\n虽然从技术上讲是合法的，但索尼不希望Sophy在赛道上欺负其他赛车手而获胜。为了确保它不会这样做，他们通过对与其他司机的碰撞施加惩罚来训练它的神经网络，例如使用一种称为强化学习的试错过程。\n“特工应该是朋友、同志、人类的伙伴，人们可以同情的特工，”Gran Turismo的创始人山内和弘（Kazunori Yamauchi）说。“此外，代理人可以激发人们的情绪，使代理人和人类能够相互尊重。”", "note_en": "First they came for chess, now they come for video games. In the 21st century, a legion of AI competitors could very well dominate every board, screen, and console played by humans. Famous machines like Deep Blue and Alpha Go have already conquered some of the world’s most complex strategy puzzles.\n   Japanese tech giant Sony  revealed Wednesday that it has trained the  toughest-ever opponent for the race-car simulator  Gran Turismo—a champion that can beat top-class esports drivers at their own games. Forged on the battlegrounds of over 1,000 PlayStation 4 consoles, the AI racer-bot has grown smart enough to identify optimal course routes and can execute skilled tactical maneuvers to pass or block competitors, even in vehicular scrum. It does so with ruthless effectiveness—while still respecting the human etiquette of the game, Sony claims.\n The company  published research on its brainchild—dubbed Gran Turismo Sophy—in  Nature journal this week. The development process paired “state-of-the-art, model-free, deep reinforcement learning algorithms with mixed-scenario training to learn an integrated control policy that combines exceptional speed with impressive tactics,” it said. “In addition, we construct a reward function that enables the agent to be competitive while adhering to racing’s important, but under-specified, sportsmanship rules.”\n   In a media-broadcast demonstration, Sophy bested four of the world’s top  Gran Turismo drivers in head-to-head contests, proving the tech’s superiority to mere mortals. But  Sophy’s aspiration was never to crush humanity’s spirits or to leave it feeling defeated. On the contrary, it was meant to spark fresh excitement in esports, especially among elite players who felt they had no challenge left to answer.\n “I feel frustrated, that never happened before battling with an AI,” Tomoaki Yamanaka, one of the four racers,  said after the loss. “I drove like I would drive against a human. That’s a really amazing thing.”\n In that sense, Sophy pushes the human limit; it can “accelerate and elevate the players’ techniques and creativity to the next level,” said Hiroaki Kitano, CEO of Sony AI, in a statement. The company has said it’s exploring ways to integrate Sophy into future versions of  Gran Turismo (the game’s seventh edition is set to launch in March).\n  Gran Turismo now joins a long list of games in which AIs have beaten people, including shogi, Go,  Starcraft, classic Atari video games, and multiplayer series  Defense of the Ancients, for which the Microsoft-backed OpenAI created a fighter bot.\n But  Gran Turismo has higher complexity than other console games, requiring players to balance the physics of friction and aerodynamics, all while making split-second judgment calls and reacting to shifting landscapes with light-speed reflex. And even beyond that, experts say Sophy’s achievements stand out in its capacity to behave aggressively, yet still fairly, and to observe the gamers’ code of conduct beyond just the letter of the law—in other words, to embody the subtle nuances of human character.\n While technically legal, Sony didn’t want Sophy to win by bullying other racers off the road. To make sure it wouldn’t, they trained its neural network by levying penalties for collisions with other drivers, for example—using a trial-and-error process referred to as reinforcement learning.\n  “The agent should be a friend, a comrade, a buddy to human beings, an agent that people can feel sympathy with,”  said Kazunori Yamauchi, the creator of  Gran Turismo. “Also, the agent can stimulate the emotion of people, so that the agent and human beings can mutually respect each other.”", "posttime": "2022-02-15 08:36:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,sony,built,人类", "title": "索尼（Sony）制造了一款AI，可以在视频游戏中击败用户，这是一种荣誉", "title_en": "Sony Built an AI That Can Beat Users at Video Games, With Honor", "transed": 1, "url": "https://www.fastcompany.com/90720719/sony-built-an-ai-that-can-beat-you-at-video-games-with-honor", "via": "", "real_tags": ["游戏", "sony", "built", "人类"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在苹果内部，你的工作分类意义重大。例如，“4级”工程师和“5级”工程师之间的差异可能意味着数十万美元的补偿差异。这些头衔有助于确定苹果员工离开公司从事其他工作时能挣多少钱。但有个问题。\n苹果公司证实，在公司用来核实工作信息的广泛使用的数据库中，每个员工的头衔都会被更改为“助理”，无论他们是计算机科学博士还是产品经理。\n就业实践专家表示，苹果的做法即使不是独特的，也是奇怪的，但直到现在，除了少数求职者，其他人基本上都没有注意到苹果的做法，他们的简历与Equifax和LexisNexis等公司运营的工作验证服务维护的官方数据库存在冲突。\n“助理”一词通常用来指更初级的角色。例如，初级零售工人通常被称为员工。律师事务所也以同样的方式提及最近法学院的招聘，在大学里，副教授的排名低于“教授”头衔\n前苹果软件工程师雪儿·斯佳丽（Cher Scarlett）对该公司涉嫌歧视和不当行为表示担忧，并向美国证券交易委员会（SEC）提起诉讼，这一做法最近曝光，据称，当苹果公司将她的工作头衔改为“助理”时，它将一位潜在雇主的招聘过程推迟了近一周，在此期间，苹果公司取消了该提议。斯佳丽说，为审核简历而雇佣的工作验证服务无法解决与苹果之间的差异。\n苹果发言人乔希·罗森斯托克证实，多年来，苹果一直将其前员工的头衔改为“助理”罗森斯托克拒绝透露苹果为什么这样做，也拒绝透露这种做法的确切时间。\n他说：“我们一直致力于创造和维护一个积极、包容的工作场所。我们认真对待所有问题，并在提出问题时进行彻底调查，出于对任何相关个人隐私的尊重，我们不讨论具体的员工事宜。”。\n思嘉是苹果安全团队的软件工程师，去年帮助创立了#AppleToo运动，该运动鼓励公司员工公开谈论工作场所的不当行为。在大部分匿名的证词中，数百名员工分享了该组织所称的“种族主义、性别歧视、不平等、歧视、恐吓、镇压、胁迫、虐待、不公平惩罚和未经检查的特权的持续模式”的故事去年，她说自己受到恐吓和报复后离开了公司。\n9月1日，斯佳丽向国家劳动关系委员会提出指控，称苹果的做法违反了联邦劳动法。案件正在调查中。去年10月，斯佳丽向美国证券交易委员会（SEC）提交了一份告密者投诉，指控苹果在向股东发表声明时误导投资者，声称苹果在与员工的离职协议或和解中没有使用隐瞒条款。斯佳丽说，她离开公司时，苹果要求她签署这样的条款。\n一些以前不知道头衔变更的前员工批评苹果的做法。另一位#AppleToo创始人詹内克·帕里什（Janneke Parrish）在批评苹果涉嫌违反劳动法后被公司解雇。他说，即使苹果更改了数据库中所有员工的头衔，也可能对某些前员工造成“毁灭性后果”，因为特定的头衔代表了技术专业水平。（帕里什已经对苹果公司提出了NLRB投诉；她说，她被告知在公司调查期间从公司手机上删除应用程序和文件而被解雇，但她认为这是因为她的行动主义。）\n她说：“这样做严重限制了前苹果员工核实过去雇佣关系的能力，尤其是如果他们以恶劣的条件离职。这基本上迫使我们对这些证明文件保持良好的声誉。”。\n苹果提供了一个电话号码，雇主可以打电话核实前苹果员工的头衔。这条线路上的语音录音会将呼叫者引导到InVerify网站，InVerify是信贷机构Equifax旗下的一家就业验证服务提供商。当《华盛顿邮报》拨打InVerify的客户支持电话时，一位客户服务代表表示，他所知道的唯一一家在员工离职时更换职称的公司是苹果。这位知情人士说，苹果还改变了请假员工的头衔。\n这位代表说，他每个月都会接到一些人打来的电话，他们试图获得苹果前员工的准确职称。如果打电话的人能够提供员工的完整社会保险号码，InVerify就可以查询该员工的旧工资信息，并通过这种方式验证职位。\n但是，即使是以核实职称为生的人，也可能会被拜占庭式的系统难倒，因为它无法核实前苹果员工的准确职称。斯佳丽和斯特林之间的电子邮件显示，斯特林的员工在1月底检查Equifax的数据库（称为工作号码）时，当她的头衔被恢复为“助理”时，他们感到困惑。斯特林是一家由她未来的雇主雇佣的就业验证公司。\n由于无法核实斯佳丽的头衔，西雅图癌症护理联盟（Seattle Cancer Care Alliance）的一名招聘人员给她发了一封电子邮件，询问她是否可以在苹果提供任何能够独立核实她的头衔的推荐人。“我希望你今天过得愉快！你能帮我解决与苹果公司的职位不符的问题吗？”招聘人员在《邮报》审阅的一条消息中写道。“你能给我提供几份苹果公司的推荐信吗？我需要提交苹果公司的推荐信来确认职位。”斯佳丽提供了她过去与之打过交道的一名人力资源员工的姓名。\n“不管他们这样做的原因是什么，这都是一种非常糟糕的、可能是非法的做法，”劳里·伯吉斯说，她是一名雇佣法律师，在帕里什针对苹果的劳工委员会案件中代表她。“在我看来，这一行动干涉了员工合理的未来经济利益。”\n雪儿·斯佳丽在9月1日而不是8月7日对苹果提出了NLRB指控。这篇文章已被更正。", "note_en": "Inside Apple, your job classification can mean a lot. The difference between a “level 4” engineer and a “level 5,” for instance, could mean a difference of hundreds of thousands of dollars in compensation. And those titles help determine how much Apple employees can make when they leave the company for another job. But there’s a hitch.\n In widely used databases that companies refer to for verification of job information, Apple changes the job title for every employee, whether they’re a PhD in computer science or a product manager, to “associate,” the company confirms.\n Apple’s approach is bizarre if not unique, experts in employment practices say, but until now has gone largely unnoticed by anybody but a handful of job applicants whose résumés conflict with official databases maintained by job verification services run by companies such as Equifax and LexisNexis.\n   The title “associate” is generally used to connote more junior roles. Entry-level retail workers, for instance, are often called associates. Law firms refer to recent law school hires in the same way, and in universities, associate professors are ranked below those with the title “professor.”\n  The practice recently came to light when Cher Scarlett, a former Apple software engineer who raised concerns about alleged discrimination and misconduct at the company, filed a complaint to the Securities and Exchange Commission, alleging that when Apple changed her job title to “associate,” it delayed the hiring process at a prospective employer by nearly a week, during which time the company rescinded the offer. Scarlett said the job verification service hired to vet her résumé was unable to resolve the discrepancy with Apple.\n Apple spokesman Josh Rosenstock confirmed that, for years, Apple has changed the job titles of its former employees to “associate.”  Rosenstock declined to say why Apple does this or precisely when the practice began.\n   “We are and have always been deeply committed to creating and maintaining a positive and inclusive workplace. We take all concerns seriously and we thoroughly investigate whenever a concern is raised and, out of respect for the privacy of any individuals involved, we do not discuss specific employee matters,” he said.\n Scarlett, a software engineer on Apple’s security team, last year  helped found the #AppleToo movement, which encourages employees at the company to speak out about workplace misconduct. In mostly anonymous testimonials, hundreds of employees have shared stories of what the group calls “persistent patterns of racism, sexism, inequity, discrimination, intimidation, suppression, coercion, abuse, unfair punishment and unchecked privilege.” She left the company last year after she said she was intimidated and retaliated against.\n On Sept. 1, Scarlett filed a charge with the National Labor Relations Board, alleging Apple’s practices violate federal labor law. The case is being investigated. In October, Scarlett  filed a whistleblower complaint with the SEC, accusing Apple of misleading investors when it issued a statement to shareholders asserting that it does not use concealment clauses in separation agreements or settlements with employees. Scarlett says Apple asked her to sign such a clause when she left the company.\n     Some former employees, previously unaware of the title changes, criticized Apple for the practice. Janneke Parrish, another #AppleToo founder,  who was fired by the company after criticizing it for alleged employment law violations, said that even if Apple changes the titles in the database for all its employees, it can have “devastating consequences” for some former employees where specific titles represent levels of technical expertise. (Parrish has filed an NLRB complaint against Apple; she said she was told she was fired for deleting apps and files from a company phone during a company investigation, but she thinks it’s because of her activism.)\n “Doing this severely limits the ability for ex-Apple employees to verify past employment, especially if they left on bad terms. It essentially forces us to stay in Apple’s good graces for those references as verification,” she said.\n   Apple offers a phone number employers can call to verify titles of former Apple employees. A voice recording on that line directs callers to the web site for InVerify, an employment verification service provider owned by credit agency Equifax. When The Washington Post called InVerify’s customer support number, a customer service representative said Apple is the only company he knew of that changes job titles of employees when they leave. Apple also changes titles for employees who have taken a leave of absence, the person said.\n The representative said he gets a few calls a month from people trying to get the accurate job titles of former Apple employees. If the caller can provide the employee’s full Social Security number, InVerify is able to look up the person’s old payroll information and verify the job title that way.\n    But even people who verify job titles for a living can be stumped by the byzantine system for verifying accurate job titles for former Apple employees. Emails between Scarlett and Sterling, an employment verification firm hired by her would-be employer, show that employees at Sterling were confused when her title came back as “associate” when they checked Equifax’s database, called the Work Number, in late January.\n Unable to verify Scarlett’s title, a recruiter from the Seattle Cancer Care Alliance, which had offered her a job, emailed her asking if she could provide any references at Apple who might be able to independently verify her title. “I hope you are having a great day! Could you help me with the job title discrepancy with Apple?” the recruiter wrote in a message reviewed by The Post. “Could you provide me with a couple of references from Apple? I’ll need to submit references from Apple confirming the job title.” Scarlett provided the name of a human resources employee she had dealt with in the past.\n  “Irrespective of the reasons why they are doing it, this is a very bad and possibly unlawful practice,” said Laurie Burgess, an employment law attorney who represents Parrish in her labor board case against Apple. “Seems to me that this action interferes with employees’ reasonable future economic interests.”\n Cher Scarlett filed an NLRB charge against Apple on Sept. 1, not on Aug. 7. This article has been corrected.", "posttime": "2022-02-15 08:30:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,leaves", "title": "每一位离开苹果的员工都会成为“员工”", "title_en": "Every Employee Who Leaves Apple Becomes an 'Associate'", "transed": 1, "url": "https://www.washingtonpost.com/technology/2022/02/10/apple-associate/", "via": "", "real_tags": ["苹果", "apple", "leaves"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三提出的一项新的两党法案可能标志着国会朝着解决有害内容的算法放大问题迈出了第一步。由Sys. Amy Klobuchar（D-MN）和Cynthia Lummis（R-WY）撰写的社会媒体推动法案，将指导美国国家科学基金会和美国国家科学院、工程和医学研究“内容中立”的方式来增加在线内容共享的摩擦。\n该法案指示研究人员找出一些方法来减缓有害内容和错误信息的传播，无论是通过要求用户在分享前阅读文章（就像Twitter所做的那样）还是其他措施。然后，联邦贸易委员会（Federal Trade Commission）将这些建议编成法典，并授权Facebook和Twitter等社交媒体平台将其付诸实施。\n“长期以来，科技公司一直在说‘相信我们，我们已经做到了’，”克洛布查尔周四在一份声明中说。“但我们知道，社交媒体平台一再把利润压在人身上，算法推送危险内容，吸引用户并传播错误信息。”\n多年来，民主党一直在寻求解决网上错误信息的方法，而共和党则批评这些努力是对言论自由的威胁。但在2020年Facebook告密者弗朗西斯·豪根（Frances Haugen）的证词的启发下，两党成员开始共同努力，寻找方法来监管解决儿童问题和错误信息的算法。卢米斯对该法案的支持标志着这一进程向前迈出了重要一步。\n卢米斯在周四的一份声明中说：“推动法案是朝着全面解决大型科技过度扩张问题迈出的良好一步。”。“通过授权[NSF]和[NASEM]研究社交媒体平台的成瘾性，我们将开始充分了解这些平台的设计及其算法对我们社会的影响。从那里，我们可以建造护栏，保护怀俄明州的儿童免受社交媒体的负面影响。”\n去年3月，销售代表。安娜·埃肖（D-CA）和汤姆·马林诺夫斯基（D-NJ）首先介绍了他们的《保护美国人免受危险算法法案》，该法案也关注算法放大。与克洛布查尔的法案不同，众议院的这项法案将修正《通讯礼仪法》第230条，使其适用于平台在被发现含有侵犯公民权利的放大内容时享有的任何法律豁免权。\n删除第230条的责任保护一直是立法者在寻求解决有害算法放大问题时面临的最大障碍。像公共知识这样的科技和公共利益团体已经站出来支持Klobuchar的措施，并指出该措施没有230项变化，这使其成为更好的算法监管模式之一。\n“公共知识支持这项立法，因为它鼓励明智的决策来解决一个已知的问题：推广错误信息，”公共知识的政府事务主管格雷格·吉斯（Greg Guice）周四在一份声明中说。“最重要的是，该法案没有将遵守第230条豁免权与所有这些联系起来。”\n在今年晚些时候中期选举升温之前，国会几乎没有时间通过科技立法。在上个月接受Verge采访时，克洛布查尔对议员们在年底前通过广泛的两党法案的能力持乐观态度。\nKlobuchar在谈到《社交媒体推动法案》时说，“这项法案将有助于解决这些做法，包括通过实施提高透明度和改善用户体验的改革。”她接着说，“现在是时候通过有意义的改革，直面社交媒体对我们社区的危害了。”", "note_en": "A new bipartisan bill, introduced on Wednesday, could mark Congress’ first step toward addressing algorithmic amplification of harmful content. The Social Media NUDGE Act, authored by Sens. Amy Klobuchar (D-MN) and Cynthia Lummis (R-WY), would direct the National Science Foundation and the National Academy of Sciences, Engineering and Medicine to study “content neutral” ways to add friction to content-sharing online.\n The bill instructs researchers to identify a number of ways to slow down the spread of harmful content and misinformation, whether through asking users to read an article before sharing it (as Twitter has done) or other measures. The Federal Trade Commission would then codify the recommendations and mandate that social media platforms like Facebook and Twitter put them into practice.\n  “For too long, tech companies have said ‘Trust us, we’ve got this,’” Klobuchar said in a statement on Thursday. “But we know that social media platforms have repeatedly put profits over people, with algorithms pushing dangerous content that hooks users and spreads misinformation.”\n For years, Democrats have pursued ways to address misinformation online, while Republicans have criticized these efforts as threats to free speech. But sparked by testimony from Facebook whistleblower Frances Haugen in 2020, members of both parties have started working together to find ways to regulate algorithms that address both children’s issues and misinformation. Lummis’ support of the bill signals a significant step forward in this process.\n “The NUDGE Act is a good step toward fully addressing Big Tech overreach,” Lummis said in a statement on Thursday. “By empowering the [NSF] and [NASEM] to study the addictiveness of social media platforms, we’ll begin to fully understand the impact the designs of these platforms and their algorithms have on our society. From there, we can build guardrails to protect children in Wyoming from the negative effects of social media.”\n Last March, Reps. Anna Eshoo (D-CA) and Tom Malinowski (D-NJ) first introduced their  Protecting Americans from Dangerous Algorithms Act, which also focused on algorithmic amplification. Unlike Klobuchar’s bill, the House measure would amend Section 230 of the Communications Decency Act to any legal immunity platforms have when they’re found to have amplified content that violates civil rights.\n Removing Section 230 liability protection has been the largest hurdle facing lawmakers seeking to address harmful algorithmic amplification. Tech and public interest groups like Public Knowledge have already come out in support of the Klobuchar measure, noting that its absence of 230 changes makes it one of the better models for algorithm regulation.\n “Public Knowledge supports this legislation because it encourages informed decision-making to address a known problem: the promotion of misinformation,” Greg Guice, director of government affairs at Public Knowledge, said in a statement on Thursday. “Most importantly, the bill does all of this without tying compliance to Section 230 immunity.”\n There’s little time left for Congress to pass tech legislation before the midterm elections heat up later this year.  In an interview with  The Verge last month, Klobuchar was optimistic in lawmakers’ abilities to pass broad, bipartisan bills before the end of the year.\n Speaking on the Social Media NUDGE Act, Klobuchar said, “This bill will help address these practices, including by implementing changes that increase transparency and improve user experience.” She continued, “It’s past time to pass meaningful reforms that address social media’s harms to our communities head-on.”", "posttime": "2022-02-15 08:28:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,算法,法案,bill", "title": "新算法法案可能会迫使Facebook改变新闻提要的工作方式", "title_en": "New Algorithm Bill Could Force Facebook To Change How the News Feed Works", "transed": 1, "url": "https://www.theverge.com/2022/2/10/22927472/klobuchar-lummis-algorithm-bill-section-230-misinformation-teenager-mental-health", "via": "", "real_tags": ["facebook", "算法", "法案", "bill"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "育碧正在进行的NFT odyssey不仅让长期粉丝感到困惑，也让自己的开发者感到沮丧。该公司最近举办了另一个研讨会，专门针对持怀疑态度的员工的担忧，但也开始向幽灵侦察队的一些成员发放特别的NFT，以“庆祝”该系列20周年。一位开发人员将其比作员工说“我们讨厌这种加密技术”，育碧则回答说，“好吧，来买一些。”\n上周，育碧战略创新实验室副总裁尼古拉斯·保德在一次采访中称，玩家对该公司NFT推出的负面反应压倒性是因为“他们不明白”据Kotaku查看的育碧软件内部通信平台的帖子显示，他的言论在社交媒体上遭到了严厉的嘲笑，但公司内部的一些人也对他的言论嗤之以鼻。除了不同意Pouard的立场外，他们还对该公司在这项备受争议的技术上持续发布拙劣的信息表示失望。\n“他们不明白”也是最近一次内部问答的基调；知情人士告诉Kotaku，与Quartz团队的合作旨在解决持怀疑态度的员工。（Quartz是育碧最近推出的专有加密平台的名称。）相反，它加剧了一些开发人员对石英技术的安全漏洞及其缺乏有趣的设计可能性的担忧。Pouard和其他区块链支持者提出了一些场景，在这些场景中，化妆品可以在游戏之间跟随玩家。然而，这并不是当前Quartz NFT的目的，据消息人士透露，Pouard在内部承认，“互操作性”问题仍然没有答案。与此同时，Quartz NFT的核心用例仍然是游戏中的帽子。\n“这对一家该死的拍卖行来说是三到四年的工作，”一位现任开发商告诉Kotaku。\n然而，玩家并不是唯一接受这些新游戏内帽子的人。育碧软件专门为Ghost Recon Breakpoint团队的开发人员准备了特殊的Quartz NFT，该技术最初是在该团队中实现的。\n据Kotaku查看的一份副本显示，公告中写道：“随着育碧石英平台在12月的开放，我们想为您创建一个专属数字，‘幽灵侦察20周年纪念帽！”。“如果您想收到这个专用数字，我们将在3月9日将其注入您的加密钱包。”（“Digit”是育碧软件对NFT的术语。）\nNFT帽子以一种奇怪的方式向一支在Breakpoint灾难性的2019年发布后，在过去两年中努力通过补丁和更新赢回粉丝的球队表示感谢。育碧软件的巴黎工作室充满了开放世界的特色和一些玩家讨厌的生存元素，重建玩家信任任重而道远。根据一项内部调查，育碧的NFT计划在宣布的第一周内就破坏了很多粉丝的好感。\n目前尚不清楚幽灵侦察周年纪念帽是否会比现有的石英NFT更受欢迎。但在国际足联（FIFA）制造商EA等竞争对手已经退出加密支持的收藏品市场的情况下，育碧似乎致力于发挥它们的潜力，即使其自己的开发者仍然不确定它是什么。", "note_en": "Ubisoft’s ongoing NFT odyssey continues to bewilder and demoralize not just longtime fans but   also its own developers. The company recently held another workshop aimed specifically at addressing the concerns of skeptical employees, yet also started giving out special NFTs to some members of the  Ghost Recon team to “celebrate” the series’ 20th anniversary. One developer likened it to the staff saying “We hate this crypto stuff,” and Ubisoft responding with, “OK, come get some.”\n  Last week, VP of Ubisoft’s Strategic Innovations Lab, Nicolas Pouard,   claimed in an interview that players’ overwhelmingly negative reaction to the company’s NFT rollout was because “they don’t get it.” His remark was roundly derided on social media, but also by some within the company, according to posts from Ubisoft’s internal communications platform viewed by  Kotaku. In addition to disagreeing with Pouard’s position, they expressed frustration over the company’s continued botched messaging around the controversial tech.\n “They don’t get it” was also the tone of a recent internal Q&amp;A with   the Quartz team aimed at addressing skeptical employees, sources familiar with the event told  Kotaku. (Quartz is the name of Ubisoft’s   recently introduced proprietary crypto platform.) Instead, it bolstered some developers’ concerns about security vulnerabilities in the Quartz technology and its lack of interesting design possibilities. Pouard and other blockchain proponents have pitched scenarios in which cosmetic items can follow players between games. That’s not something current Quartz NFTs are set up to do, however, and according to sources, Pouard admitted internally that the “interoperability” question remains unanswered. In the meantime, the core use-case for Quartz NFTs remains in-game hats.\n    “It’s three to four years of work for a fucking Auction House,” one current developer told  Kotaku.\n      Players aren’t the only ones being treated to these new in-game hats, however. Ubisoft prepared special Quartz NFTs specifically for developers on the  Ghost Recon Breakpoint team where the technology was   first implemented.\n “With the opening of the Ubisoft Quartz platform in December, we thought of creating an exclusive Digit for you, the ‘Ghost Recon 20th anniversary cap!’” the announcement read, according to a copy of it viewed by  Kotaku. “If you want to receive this exclusive Digit, we will inject it into your crypto-wallet on the 9th of March.” (“Digit” is Ubisoft jargon for NFT.)\n  The NFT hats are a strange way of saying thank you to a team that has struggled over the last two years to win back fans through patches and updates after    Breakpoint’s disastrous 2019 launch. Bloated with open-world features and survival elements some players hated, Ubisoft’s Paris studio has had a long road to travel to rebuild player trust. Ubisoft’s NFT plans,   according to an internal survey, torpedoed much of fans’ goodwill within the first week they were announced.\n  It’s unclear if the  Ghost Recon anniversary caps will end up being   any more popular than existing Quartz NFTs. But where rivals like  FIFA maker EA have retreated from the crypto-backed collectibles, Ubisoft appears committed to their potential, even if its own developers still aren’t sure what it is.", "posttime": "2022-02-15 08:27:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "育碧,骗局,latest,nft", "title": "育碧最新的Galaxy Brain行动是向员工赠送骗局NFT", "title_en": "Ubisoft's Latest Galaxy-Brain Move Is To Gift Scammy NFTs To Employees", "transed": 1, "url": "https://kotaku.com/ubisoft-nft-crypto-scam-tom-clancy-ghost-recon-breakpoi-1848484228", "via": "", "real_tags": ["育碧", "骗局", "latest", "nft"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学博物馆希望这位已故宇宙学家的同行能和参观者一起展示他的办公室杂集\n史蒂芬·霍金教授毕生致力于解决宇宙难题，在他前任办公室的折衷内容中，他留下了自己的一个谜团。\n这位剑桥宇宙学家于2018年去世，享年76岁。在1980年他安排的一次会议上，他珍视着一块被卡通画、涂鸦和方程式淹没的黑板。但所有的涂鸦和笑话意味着需要一些时间来解开。\n周四，作为伦敦科学博物馆（Science Museum in London）购买的办公用品收藏的一部分，这块黑板首次展出。这块黑板既是一件令人困惑的艺术品，也是物理学史上的一件纪念品。\n斯蒂芬·霍金办公室馆长胡安·安德烈斯·利昂的希望是，40多年前在剑桥举行的超空间和超重力会议上幸存的与会者能够路过这里，解释一些草图和评论的含义。“我们一定会设法提取他们的解释，”利昂说。\n在一个名为斯蒂芬·霍金（Stephen Hawking）的临时展示会上，与黑板一起展示的是这位物理学家1966年博士论文的罕见副本、他的轮椅、被黑洞吞噬的信息永远丢失的正式赌注，以及大量名人纪念品，包括《辛普森一家》的创作者送给他的一件个性化夹克，因为他在剧中多次亮相。\n“人们对斯蒂芬·霍金的日常生活没有多少了解，因为他是一位理论物理学家，所以很难表达他在随机的周一会做什么，”莱昂说。\n他补充道：“该办公室提供了大量材料，我认为人们知道这不仅仅是它的部件集合，它真正反映了斯蒂芬·霍金的独特之处。”。\n科学博物馆的工作人员自去年夏天抵达后，已经整理了700多件物品，而这次展览只包含其中的一小部分。随着时间的推移，所有这些都将在网上拍摄和描述，供所有人观看。\n霍金的学术作品是通过一些关键作品来描述的，这些作品都是在他1988年成为明星之前写的。在他的博士论文中，霍金采用了形成黑洞的过程——恒星的灾难性坍缩——并将其向后运行，表明宇宙必须从空间和时间的一个点爆炸形成。\n“霍金用黑洞作为工具，用它们来理解更大的东西，”利昂说。在进一步的研究中，霍金证明黑洞毕竟不是那么黑，它会向太空释放辐射，直到它们蒸发为零。\n在更不寻常的物品中，有一个小玻璃苹果——这是英特尔研究人员送给霍金的礼物，也是对霍金担任卢卡斯教授的认可，这一职位以前由艾萨克·牛顿爵士担任。装饰物被涂成了宇宙微波背景，即大爆炸的余辉。\n霍金将宇宙微波背景中的微小波动——早期宇宙中的不规则现象，后来形成了恒星和星系——描述为“造物的指纹”。他对宏大隐喻的天赋让出版商们欣喜若狂，也让不少读者看到了神干预的证据。\n这次展览并没有试图夸大霍金的地位——根据莱昂的说法，大多数物理学家会说他“非常好”，是“诺贝尔奖的竞争者”，但不是“自爱因斯坦以来最具革命性的天才”。它试图把霍金描绘成一个物理学家、一个机智的人和一个名人。\n莱昂说：“我们不希望展览是庄严的，到处都是长号和漩涡星系之类的东西。我们希望它是好玩的。”。“他没有把事情看得太严肃，我认为如果他身上没有那股欢乐的火花，他就不会成为这样的名人。”\n斯蒂芬·霍金在工作中的展览是免费的，将在伦敦的科学博物馆举行，直到6月12日，然后前往曼彻斯特的科学与工业博物馆，在布拉德福德的国家科学与媒体博物馆、约克的国家铁路博物馆和达勒姆郡希尔顿的火车站进一步停留。", "note_en": "Science Museum hopes fellow travellers of the late cosmologist will join visitors to display of his office miscellany\n    Having devoted his life to the conundrums of the cosmos, Prof  Stephen Hawking has left behind a mystery of his own amid the eclectic contents of his former office.\n The Cambridge cosmologist,  who died in 2018 at the age of 76, treasured a blackboard that became smothered with cartoons, doodles and equations at a conference he arranged in 1980. But what all the graffiti and in-jokes mean is taking some time to unravel.\n  The blackboard – as much a perplexing work of art as a memento from the history of physics – goes on display for the first time on Thursday as part of a collection of office items acquired by the Science Museum in  London.\n  The hope for Juan-Andres Leon, the curator of Stephen Hawking’s office, is that surviving attenders of the conference on superspace and supergravity held in Cambridge more than 40 years ago swing by and explain what some of the sketches and comments mean. “We’ll certainly try and extract their interpretations,” Leon said.\n Joining the blackboard in a temporary display called  Stephen Hawking at Work is a rare copy of the physicist’s 1966 PhD thesis, his wheelchair, a formal bet that information swallowed by a black hole is lost for ever, and a host of celebrity memorabilia, including a personalised jacket given to him by the creators of the Simpsons for his many appearances on the show.\n  “People don’t have much of a glimpse into what everyday life was like for Stephen Hawking, and because he was a theoretical physicist, it’s hard to convey what he might do on a random Monday,” said Leon.\n “The office provides a lot of material and I think people knew that this was more than the collection of its parts, that it really reflects what made Stephen Hawking unique,” he added.\n The display contains only a fraction of the 700-plus items that staff at the Science Museum have sorted through since they arrived last summer. In time, all will be photographed and described online for all to see.\n Hawking’s academic work is portrayed through a handful of key works all written before his ascent to stardom in 1988. For his PhD thesis, Hawking took the process that forms a black hole – the cataclysmic collapse of a star – and ran it backwards, showing that the universe must explode into being from a single point in space and time.\n “Hawking used black holes as instruments, using them to understand even bigger things,” said Leon. In further work, Hawking showed that black holes are not so black after all, shedding radiation into space until they evaporate into nothing.\n  Among the more unusual objects is a small glass apple – a gift from researchers at Intel and a nod to Hawking’s position as Lucasian professor, a post formerly held by Sir Isaac Newton. The ornament has been painted to evoke the  cosmic microwave background, the afterglow of the big bang.\n Hawking described the tiny fluctuations in the cosmic microwave background – irregularities in the early universe that later formed the stars and galaxies – as the “fingerprints of creation”. His gift for a grand metaphor delighted publishers and led more than a few readers to see proof of divine intervention.\n The display does not attempt to exaggerate Hawking’s standing – according to Leon, most physicists would say he was “very good”, a “contender for a Nobel prize”, but not “the most revolutionary genius since Einstein”. What it does attempt to do is portray a sense of Hawking as a physicist, a wit and a celebrity.\n “We didn’t want the display to be solemn, all heavy with trombones and swirling galaxies and things like that. We wanted it to be playful,” said Leon. “He didn’t take things too seriously and I don’t think he’d have been such a celebrity if he didn’t have that spark of fun about him.”\n The Stephen Hawking at Work display is free and will run until 12 June at the Science Museum in London before moving to the Science and Industry Museum in Manchester, with further stops at the National Science and Media Museum in Bradford, the National Railway Museum in York and Locomotion in Shildon, County Durham.", "posttime": "2022-02-15 08:23:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "霍金的,hawking,霍金", "title": "斯蒂芬·霍金的展览希望揭开他的黑板之谜", "title_en": "Stephen Hawking Exhibition Hopes To Unravel the Mysteries of His Blackboard", "transed": 1, "url": "https://www.theguardian.com/science/2022/feb/10/stephen-hawking-exhibition-hopes-to-unravel-the-mysteries-of-his-blackboard", "via": "", "real_tags": ["霍金的", "hawking", "霍金"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州山景城——2月10日，阿斯特拉火箭3.3运载工具的首次运行发射失败，火箭的上一级在分离后似乎失控。\n这枚由阿斯特拉公司命名为LV0008的火箭于东部时间下午3点从卡纳维拉尔角空间站46号发射场升空。由于射程问题以及2月7日前一次发射尝试中的最后一秒擦洗，发射推迟了几天。\n然而，该车的车载视频显示，在与第一级分离后不久，即升空三分钟后，上一级翻滚。视频显示了有效载荷整流罩分离的潜在问题，根据该公司提供的任务时间表，整流罩分离发生在级分离前几秒钟。\nAstra的产品管理总监卡罗莱纳·格罗斯曼在发射网络广播中说：“在飞行过程中遇到了一个问题，导致我们的客户今天无法将有效载荷送入轨道。我们对我们的客户深表歉意。”。该公司没有透露有关故障的任何其他信息。\n“我和团队一起查看数据，我们将尽快提供更多信息，”Astra首席执行官克里斯·坎普在失败几分钟后在推特上写道。\n我们今天遇到了一个问题#39；这是航班。我&#39；很抱歉，我们未能向客户提供&#39；这是有效载荷。我&#39；我和团队一起查看数据，我们将尽快提供更多信息。\n这是阿斯特拉公司第五次尝试在轨道上发射火箭3。从2020年9月到2021年8月的前三次发射都没有达到轨道。第四，在2021年11月，达到了轨道，但没有携带卫星有效载荷。\n这次发射搭载了四颗由美国宇航局赞助的立方体卫星，由美国宇航局执行一项名为纳米卫星教育发射（ELNA）41的任务。该机构于2020年12月通过其风险级发射服务（VCLS）演示2竞赛授予阿斯特拉390万美元的发射合同。\nELaNa 41上的三个立方体卫星来自大学。阿拉巴马大学的BAMA-1计划测试一种拖曳帆，旨在快速将卫星脱轨。来自新墨西哥州立大学的印加将进行测量，以改进空间天气模型。加利福尼亚大学伯克利分校的QubeSat曾计划测试量子陀螺仪如何在太空环境中工作。第四颗卫星RS-51来自美国宇航局约翰逊航天中心，本应测试一种快速且经济高效的方法来建造立方体卫星，并展示一些空间探测技术。\n阿斯特拉在去年通过SPAC合并上市后，在纳斯达克交易所上市。在上市失败几分钟后，阿斯特拉股价下跌超过5%，交易停止。恢复交易后，股价暴跌，该股收盘下跌26%。2月7日，该公司的股价在破产和后来的破产后下跌了近14%，但在接下来的两天里恢复了价值。", "note_en": "MOUNTAIN VIEW, Calif. — The first operational launch of Astra’s Rocket 3.3 vehicle failed Feb. 10 when the rocket’s upper stage appeared to tumble out of control after stage separation.\n The rocket, designated LV0008 by Astra, lifted off from Space Launch Complex 46 at Cape Canaveral Space Force Station at 3 p.m. Eastern. The launch suffered several days of delays because of a range issue as well as  a last-second scrub during the previous launch attempt Feb. 7.\n  However, onboard video of the vehicle showed the upper stage tumbling shortly after separation from the first stage, three minutes after liftoff. The video suggests a potential issue with the separation of the payload fairing, which, according to a mission timeline provided by the company, takes place seconds before stage separation.\n  “An issue has been experienced during flight that prevented the delivery of our customer payloads to orbit today. We are deeply sorry to our customers,” said Carolina Grossman, director of product management at Astra, during the launch webcast. The company did not disclose any additional information about the failure.\n “I’m with the team looking at data, and we will provide more info as soon as we can,” Chris Kemp, chief executive of Astra, tweeted minutes after the failure.\n We experienced an issue in today&#39;s flight. I&#39;m deeply sorry we were not able to deliver our customer&#39;s payloads. I&#39;m with the team looking at data, and we will provide more info as soon as we can.\n  This was the fifth orbital launch attempt by Astra of its Rocket 3 vehicle. The first three launches, from September 2020 through August 2021, all failed to reach orbit. The fourth, in November 2021, did reach orbit but did not carry a satellite payload.\n This launch was carrying four NASA-sponsored cubesats on a mission called Educational Launch of Nanosatellites (ELaNa) 41 by NASA. The agency awarded Astra a $3.9 million contract in December 2020 for the launch through its Venture Class Launch Services (VCLS) Demo 2 competition.\n Three of the cubesats on ELaNa 41 were from universities. BAMA-1, from the University of Alabama, was intended to test a drag sail designed to rapidly deorbit the satellite. INCA, from New Mexico State University, was to carry out measurements to improve space weather models. QubeSat, from the University of California Berkeley, had planned to test how quantum gyroscopes operate in the space environment. A fourth satellite, RS-51, was from NASA’s Johnson Space Center and would have tested a fast and cost-effective way to build cubesats and demonstrate some in-space inspection technologies.\n Astra, listed on the Nasdaq exchange after going public through a SPAC merger last year, had trading of its shares stopped minutes after the launch failure after dropping more than 5%. Shares plummeted when trading resumed, and the stock closed down 26%. The company’s shares dropped nearly 14% Feb. 7 after the abort and later scrub, but recovered its value over the next two days.", "posttime": "2022-02-15 08:16:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,发射,launch", "title": "Astra发射NASA赞助的立方体卫星失败", "title_en": "Astra Launch of NASA-Sponsored Cubesats Fails", "transed": 1, "url": "https://spacenews.com/astra-launch-of-nasa-sponsored-cubesats-fails/", "via": "", "real_tags": ["nasa", "发射", "launch"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据ZDNet的一份报告，苹果已经确认了一个iOS 15漏洞，该漏洞可能记录了某些设备上与Siri的交互，无论用户是否选择退出。该漏洞自动启用了改进Siri&amp；听写设置，允许苹果录制、存储和查看您与Siri的对话。\n苹果告诉Verge，它在iOS 15发布后不久就发现了该漏洞，停止审查无意中收到的任何录音，并正在删除从受影响设备收到的信息。发现漏洞后，该公司关闭了“许多”用户的功能，并在发布iOS 15.2时更正了选择加入设置。正如ZDNet所指出的，这就是为什么您可能会收到一条提示，请求您允许启用改进Siri&amp；一旦你安装了新的15.4测试版，或者最终正式发布，口述功能就会出现。\n苹果发言人凯瑟琳·富兰克林（Catherine Franklin）在一份即将发布的声明中说：“在iOS 15.2中，我们关闭了许多Siri用户的改进Siri和听写设置，同时修复了iOS 15引入的一个漏洞。”。“此错误无意中启用了一小部分设备的设置。自从识别出该错误后，我们停止审查并删除从所有受影响设备接收的音频。”\n这似乎是一个非常严重的漏洞，苹果应该明确警告用户，并敦促他们确保自己的iPhone是最新的，同时通知任何受影响的人。事实上，该公司的声明仍不清楚有多少部手机受到影响或何时受到影响。如果没有透明度，就无法判断谁的对话被苹果员工录制并聆听，尽管他们要求避免出现这种结果。如果你有iPhone，现在可能是更新到iOS 15.2或更高版本（如果你还没有）的好时机。对于尚未升级到iOS 15.2或更高版本的用户，苹果确认已停止审查录音，并继续删除收到的任何数据。\n美国东部时间2月9日下午3:00更新：更新后添加了苹果发言人的声明，并澄清苹果正在删除并不再审查尚未升级到iOS 15.2的用户的录音。\n更正东部时间2月9日下午3:00：该报道的一个旧版本引用了ZDNet的报告，即苹果在15.4的第二个测试版中修复了该漏洞。然而，苹果表示它修复了iOS 15.2中的漏洞。", "note_en": "Apple has acknowledged an  iOS 15 bug that may have recorded interactions with Siri on some devices, regardless of whether the user opted out, according to a report from   ZDNet. The bug automatically enabled the  Improve Siri &amp; Dictation setting that gives Apple permission to record, store, and review your conversations with Siri.\n  Apple tells  The Verge that it identified the bug shortly after the release of iOS 15, stopped reviewing any recordings inadvertently received, and is deleting info received from affected devices. After discovering the bug, the company turned off the feature for “many” users and corrected the opt-in setting when it released iOS 15.2. As  ZDNet points out, this is the reason why you might get a prompt asking for your permission to enable the Improve Siri &amp; Dictation feature once you install the new 15.4 beta or, eventually, its official release.\n “With iOS 15.2, we turned off the Improve Siri &amp; Dictation setting for many Siri users while we fixed a bug introduced with iOS 15,” Apple spokesperson Catherine Franklin said in a statement to  The Verge. “This bug inadvertently enabled the setting for a small portion of devices. Since identifying the bug, we stopped reviewing and are deleting audio received from all affected devices.”\n This seems like a serious enough bug that Apple should explicitly warn users and urge them to ensure their iPhones are up-to-date while notifying anyone affected. As it is, the company’s statement still leaves an unknown of how many phones were affected or when. Without transparency, there’s no way to tell who may have had their conversations  recorded and listened to by Apple employees despite asking to avoid exactly that outcome. If you have an iPhone, now might be a good time to update to iOS 15.2 or later (if you haven’t already). For users who haven’t yet upgraded to iOS 15.2 or higher, Apple confirmed it has stopped reviewing recordings and continues to delete any data received.\n Update February 9th 3:00PM ET:   Updated to add a statement from an Apple spokesperson, as well as clarify that Apple is deleting and is no longer reviewing recordings from users who haven’t yet upgraded to iOS 15.2.\n Correction February 9th 3:00PM ET:  An older version of the story cited ZDNet’s report that Apple fixed the bug in the second beta of 15.4. However, Apple says it fixed the bug in iOS 15.2.", "posttime": "2022-02-15 08:14:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,苹果,apple,记录,small", "title": "苹果表示，即使你选择退出，也有一小部分iPhone记录了与Siri的互动", "title_en": "Apple Says a 'Small Portion' of iPhones Recorded Interactions With Siri Even if You Opted Out", "transed": 1, "url": "https://www.theverge.com/2022/2/8/22924225/apple-ios-15-bug-recorded-interactions-siri", "via": "", "real_tags": ["iphone", "苹果", "apple", "记录", "small"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073326, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电击可能正是说服云层产生降雨的原因。新的研究表明，给云增压可以增加水滴之间的吸引力，帮助雨滴生长。我们终于找到制造雨水的方法了吗？\n我们周围充满了电荷。雷雨云会发出噼啪声，但即使是我们呼吸的空气中也有一些带电的气溶胶和水滴。雷丁大学的气象学家Giles Harrison和同事们一直在研究非雷雨云中的水滴电荷。\n由马丁·安巴姆领导并发表在《皇家学会学报A》上的计算表明，电荷的变化越大，液滴之间的吸引力越强。“这推进了我们对电荷如何影响液滴增长的理解，并为回答这个古老的问题带来了一个新的方面：为什么下雨？”哈里森说。\n去年，哈里森和他的同事们在阿拉伯联合酋长国的资助下进行了增雨研究，他们驾驶装有电离器的无人机进入云层，并尝试向空气中释放正电荷和负电荷。新的结果将帮助他们对这些实验进行微调，有可能找到在需要的地方加速降雨形成的方法。", "note_en": "A n electric shock might be just the thing to persuade a cloud to produce some rain. New research suggests that supercharging a cloud could increase the attractive forces between droplets and help raindrops to grow. Have we finally found the recipe for making rain?\n Electric charge is all around us. Thunderclouds literally crackle with it, but even the air we breathe has some charged aerosols and droplets in it. Giles Harrison, a meteorologist at the  University of Reading, and colleagues have been investigating the electric charge of drops in non-thunderstorm clouds.\n  In calculations led by Maarten Ambaum and published in  Proceedings of the Royal Society A, they show that the greater the variation in charges, the stronger the attraction between droplets. “This advances our understanding of how charge influences drop growth and brings a new aspect to answering the age-old question: why does it rain?” says Harrison.\n Last year Harrison and his colleagues, who have been  funded by the United Arab Emirates to research rain enhancement, flew  drones equipped with ionisers into clouds and experimented with releasing positive and negative charges into the air. The new results will help them fine-tune these experiments, potentially to find ways to hasten the formation of rain where it is needed.", "posttime": "2022-02-15 08:08:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "制造,recipe,电荷", "title": "我们终于找到制造雨水的方法了吗？", "title_en": "Have We Finally Found the Recipe for Making Rain?", "transed": 1, "url": "https://www.theguardian.com/news/2022/feb/08/have-we-finally-found-the-recipe-for-making-rain", "via": "", "real_tags": ["制造", "recipe", "电荷"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客攻击。虚假信息。监控赛博是主板&#39；它的播客和关于互联网黑暗底层的报道。\n乌克兰安全部门表示，已经关闭了利沃夫市的一个巨魔农场。\n“SSU网络专家在利沃夫发现并捣毁了两个机器人农场，总容量为18000个假账户，”SSU新闻稿称。“根据初步信息，来自俄罗斯的组织者监督了bot农场的管理人员。”\n根据新闻稿，有三人在两个不同的住宅中参与。其中两人将公寓交给了运营部门，第三人负责维护账户和设备。“机器人农场主要在社交网络中工作：分发假货以传播恐慌，”新闻稿说。“这些机器人还发布了各种设施炸弹威胁的虚假信息。”\nSSU表示，他们查获了两套GSM网关、3000张SIM卡、笔记本电脑和会计记录。GSM网关是一种允许人们使用SIM卡连接到默认网络之外的网络的设备。它们是黑客和其他网络犯罪分子常用的工具，他们可以使用它们管理多个电话号码，并连接到IP语音或VoIP网络。半身像的照片显示了数十个GSM网关，里面塞满了模糊不清的SIM卡。\n乌克兰和俄罗斯边境沿线的其他国家长期以来一直在应对来自邻国的网络犯罪和攻击。今年1月，身份不明的黑客关闭了几家乌克兰政府网站。基辅指责克里姆林宫，克里姆林宫否认其参与。\n据称俄罗斯巨魔农场被关闭之际，乌克兰和俄罗斯之间的紧张局势正在加剧。俄罗斯军队、武器和物资正在俄罗斯和白俄罗斯等邻国的乌克兰边境集结。过去八年来，俄罗斯一直支持乌克兰东顿巴斯地区的叛乱。\n注册即表示您同意使用条款和隐私政策&amp；接收来自Vice Media Group的电子通信，其中可能包括市场推广、广告和赞助内容。", "note_en": "Hacking. Disinformation. Surveillance. CYBER is Motherboard&#39;s podcast and reporting on the dark underbelly of the internet.\n  Ukraine’s Security Service said it has shut down a troll farm in the city of Lviv.\n  “The SSU cyber specialists uncovered and dismantled two bot farms in Lviv with a total capacity of 18,000 fake accounts,” an SSU   press release said. “According to preliminary information, organizers from Russia supervised the administrators of the bot farms.”\n     According to the press release, three people in two different residences were involved. Two gave over their apartments to the operation while a third took care of maintaining the accounts and equipment. “The bot farms worked mostly in social networks: distributed fakes to spread panic,” the press release said. “The bots also published false information about bomb threats at various facilities.”\n   The SSU said it seized two sets of GSM gateways, 3,000 SIM cards, laptops, and accounting records. GSM gateways are equipment that allows people to use SIM cards to connect to networks outside the default network they’re meant to be connected to. They’re popular tools for hackers and other cyber criminals, who can use them to manage several phone numbers, and to connect to Voice Over IP, or VoIP networks. The photos of the bust show dozens of GSM gateways stuffed with blurred SIM cards.\n   Ukraine and other countries along Russia’s border have long dealt with cyber crime and attacks that originate from the neighboring country. In January, unidentified hackers   disabled several Ukrainian government websites. Kiev blamed the Kremlin, and the Kremlin denied its involvement.\n   The shut down of the alleged Russian troll farm comes as tensions between Ukraine and Russia are on the rise. Russian troops, weapons, and supplies are gathering along the   border of Ukraine in Russia and neighboring countries like Belarus. For the past eight years, Russia has backed an insurgency in the eastern Donbas region of Ukraine.\n  By signing up, you agree to the  Terms of Use and  Privacy Policy &amp; to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.", "posttime": "2022-02-15 08:06:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,机器人,sim,busts,网络", "title": "乌克兰用数千张SIM卡捣毁据称的俄罗斯机器人农场", "title_en": "Ukraine Busts Alleged Russian Bot Farm Using Thousands of SIM Cards", "transed": 1, "url": "https://www.vice.com/en/article/4awq8m/video-ukraine-busts-alleged-russian-bot-farm-using-thousands-of-sim-cards", "via": "", "real_tags": ["俄罗斯", "机器人", "sim", "busts", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌&#39；美国默认启用双因素身份验证的决定似乎取得了成果。这家搜索公司透露，在自动启用2FA（Google speak中的两步验证）的用户中，账户违规率下降了50%。暴跌证明了额外的因素是&#34；有效&#34；在保护你的数据方面，谷歌说，尽管它没有&#39；不要透露泄露账户的确切数量。\n该公司没有&#39；我没说2FA预计会以多快的速度传播，但承诺将继续推广到2022年。到目前为止，已有超过1.5亿人自动注册，其中包括超过200万名YouTube创作者。\n该公司还承诺进行更多安全升级，以帮助纪念更安全的互联网日。从3月起，谷歌将允许你选择一个帐户级的安全浏览选项，防止你访问已知的有害网站。谷歌也在扩展助手&#39；在接下来的几个月里，美国将把注重隐私的来宾模式扩展到九种新语言，并承诺在美国中期选举前加强对政客的保护。\n账户违规数量的减少不是&#39；令人震惊的是，需要更多的努力才能破解一个账户，这必然会阻止一些潜在的入侵者。它没有&#39；不过，要展示2FA对安全性的切实影响，以及谷歌的规模，并不总是那么容易；s的用户群为它提供了一个其他人可以提供的代表性样本&#39；不容易匹配。\nEngadget推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果你通过其中一个链接购买东西，我们可能会获得会员佣金。\n由于您的隐私偏好，此内容不可用。在此处更新设置，然后重新加载页面以查看它。", "note_en": "Google&#39;s decision to  enable two-factor authentication by default appears to have borne fruit. The search firm has  revealed that account breaches dropped by 50 percent among those users where 2FA (two-step verification in Google-speak) was auto-enabled. The plunge was proof the extra factor is &#34;effective&#34; in safeguarding your data, Google  said, although it didn&#39;t disclose the exact number of compromised accounts.\n The company didn&#39;t say how rapidly it expected 2FA to spread, but promised to continue the rollout through 2022. More than 150 million people have been auto-enrolled so far, including more than 2 million YouTube creators.\n  The company also promised more security upgrades to help mark Safer Internet Day. As of March, Google will let you opt-in to an account-level safe browsing option that keeps you from visiting known harmful sites. Google is also expanding Assistant&#39;s privacy-minded  Guest Mode to nine new languages in the months ahead, and has promised to ramp up safeguards for politicians ahead of the US midterm elections.\n The reduced volume of account breaches isn&#39;t a shock — requiring more effort to crack an account is bound to deter some would-be intruders. It hasn&#39;t always been easy to show the tangible impact of 2FA on security, though, and the sheer scale of Google&#39;s user base gives it a representative sample others can&#39;t easily match.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2022-02-15 08:05:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,账户,cut", "title": "谷歌称默认2FA将账户违规减少一半", "title_en": "Google Says Default 2FA Cut Account Breaches In Half", "transed": 1, "url": "https://www.engadget.com/google-says-2fa-default-cut-account-breaches-193745716.html", "via": "", "real_tags": ["谷歌", "google", "账户", "cut"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克（Elon Musk）的卫星互联网服务Starlink刚刚遭受了代价高昂的打击——该公司目前估计，2月3日发射的49颗Starlink卫星中，有40颗将因地磁风暴而被毁。\n这场风暴造成了“比之前发射时高出50%的阻力”，使部署的卫星无法到达其环绕地球的正确轨道。虽然Starlink试图让它们“像一张纸一样”边缘飞行，以减少阻力，但现在看来，其中多达40颗将在地球大气层中燃烧，而不是到达目的地。\nSpaceX最近跨越了2000年的卫星发射里程碑，并计划发射12000颗卫星，如果不是更多的话——因此失去其中的40颗可能不是一件大事。不过，这是猎鹰9号火箭在大气层中燃烧的星链发射能力的绝大部分。\n2月3日星期四，美国东部时间下午1:13，“猎鹰9号”从佛罗里达州肯尼迪航天中心的发射综合体39A（LC-39A）向近地轨道发射了49颗星链卫星。猎鹰9号的第二级将卫星部署到其预定轨道上，近地点距离地球约210公里，每颗卫星都实现了受控飞行。\nSpaceX将其卫星部署到这些较低的轨道上，这样在极少数情况下，任何卫星都不会通过初始系统检查，它将通过大气阻力迅速脱离轨道。虽然低部署高度需要更多功能强大的卫星，但我们要付出相当大的代价，这是保持可持续空间环境的正确做法。\n不幸的是，周四部署的卫星受到了周五地磁风暴的严重影响。这些风暴导致大气变暖，我们低部署高度的大气密度增加。事实上，机载GPS显示，风暴造成的大气阻力的升级速度和严重程度比之前发射时高出50%。Starlink团队指挥卫星进入安全模式，在该模式下，它们将沿边缘飞行（就像一张纸），以最大限度地减少阻力，从而有效地“躲避风暴”——并继续与空间部队第18空间控制中队和LEOLAB密切合作，提供基于地面雷达的卫星更新。\n初步分析表明，低空阻力的增加阻止了卫星离开安全模式开始轨道提升操作，其中多达40颗卫星将重返或已经重返地球大气层。脱轨卫星与其他卫星的碰撞风险为零，按设计，在大气再入时即失效，这意味着不会产生轨道碎片，也不会有卫星部件撞到地面。这种独特的情况表明，Starlink团队为确保该系统处于在轨碎片缓减的前沿，付出了巨大的努力。\n正如你所见，SpaceX正借此机会吹嘘其卫星对天空的影响是多么小——这在过去一个月一直是个问题，因为一项新的研究进一步加深了人们的担忧，即Starlink卫星在绕轨道运行时会在天文学家的图像上留下条纹，并可能阻止我们识别危险的小行星。天文学家正在组建一个“保护黑暗安静的天空免受卫星星座干扰中心”，以应对这一问题。", "note_en": "Elon Musk’s satellite internet service Starlink just got dealt an expensive blow —  the company’s currently estimating that 40 of the 49 Starlink satellites it launched on February 3rd will be destroyed because of a geomagnetic storm.\n The storm caused “up to 50 percent higher drag than during previous launches,” keeping the deployed satellites from reaching their proper orbit around the Earth. And while Starlink tried to fly them “edge-on (like a sheet of paper)” to reduce that drag, it now looks like as many as 40 of them will burn up in the Earth’s atmosphere instead of reaching their destinations.\n SpaceX  recently crossed the 2,000 satellite launch milestone, and has plans to launch 12,000 if not a great many more — so losing 40 of them might not be a huge deal in the grand scheme of things. Still, that’s the vast majority of an entire Falcon 9 rocket’s Starlink launch capacity burning up in the atmosphere.\n  On Thursday, February 3 at 1:13 p.m. EST, Falcon 9 launched 49 Starlink satellites to low Earth orbit from Launch Complex 39A (LC-39A) at Kennedy Space Center in Florida. Falcon 9’s second stage deployed the satellites into their intended orbit, with a perigee of approximately 210 kilometers above Earth, and each satellite achieved controlled flight.\n SpaceX deploys its satellites into these lower obits so that in the very rare case any satellite does not pass initial system checkouts it will quickly be deorbited by atmospheric drag. While the low deployment altitude requires more capable satellites at a considerable cost to us, it’s the right thing to do to maintain a sustainable space environment.\n Unfortunately, the satellites deployed on Thursday were significantly impacted by a geomagnetic storm on Friday. These storms cause the atmosphere to warm and atmospheric density at our low deployment altitudes to increase. In fact, onboard GPS suggests the escalation speed and severity of the storm caused atmospheric drag to increase up to 50 percent higher than during previous launches. The Starlink team commanded the satellites into a safe-mode where they would fly edge-on (like a sheet of paper) to minimize drag—to effectively “take cover from the storm”—and continued to work closely with the Space Force’s 18th Space Control Squadron and LeoLabs to provide updates on the satellites based on ground radars.\n Preliminary analysis show the increased drag at the low altitudes prevented the satellites from leaving safe-mode to begin orbit raising maneuvers, and up to 40 of the satellites will reenter or already have reentered the Earth’s atmosphere. The deorbiting satellites pose zero collision risk with other satellites and by design demise upon atmospheric reentry—meaning no orbital debris is created and no satellite parts hit the ground. This unique situation demonstrates the great lengths the Starlink team has gone to ensure the system is on the leading edge of on-orbit debris mitigation.\n As you can see, SpaceX is taking this opportunity to tout how little its satellites impact the skies — something that’s been in question this past month, as  a new study furthers the concern that Starlink satellites are  leaving streaks across astronomers’ images as they orbit, and could prevent us from identifying dangerous asteroids. Astronomers are forming  a “Centre for the Protection of the Dark and Quiet Sky from Satellite Constellation Interference” to combat the issue.", "posttime": "2022-02-15 07:59:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风暴,starlink,卫星", "title": "一场地磁风暴可能已经摧毁了40颗SpaceX Starlink卫星", "title_en": "A Geomagnetic Storm May Have Effectively Destroyed 40 SpaceX Starlink Satellites", "transed": 1, "url": "https://www.theverge.com/2022/2/8/22924561/spacex-starlink-satellites-geomagnetic-storm", "via": "", "real_tags": ["风暴", "starlink", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一项小型试验中，人们在练习了两种简单易行的身体技术后，站着时感觉不那么眩晕。\n加拿大的研究人员表示，他们已经提出了两种简单的物理技术来帮助预防头晕和晕厥的常见原因。在一项小型试验中，他们发现，这些动作只需要移动下肢，就可以有效地减轻初始直立性低血压的症状，这种情况会让人站起来时暂时头晕。\n直立性低血压是一种低血压，发生在人们从坐姿或躺姿站起来时，导致头晕甚至昏厥。通常，这种情况可能与潜在的神经系统问题有关，也可能是许多药物的副作用，这些病例往往会影响老年人。但在其他情况下，血压下降的速度非常快，只需一分钟，而且可能与任何其他健康问题无关；这种形式被称为初始直立性低血压（IOH），它往往会影响年轻人。\n虽然很多人都会经历IOH，但从来没有将其视为一个大问题，一些患者可能会反复或严重地发生IOH，从而影响他们的日常功能。研究者Satish Raj是卡尔加里大学心脏节律的心脏病专家，他的同事们经常在他们的精神障碍和昏迷的诊所看到这些类型的病人。他们想知道，除了生活方式的改变，比如喝更多的水或药物，他们是否还能为这些患者提供更多的东西。\n拉杰在电话中告诉Gizmodo：“在某种程度上，每个人都可能在生活中的某个时候经历过这种情况。但也有人经常发生这种情况。这种情况可能会导致残疾。”。\n正如他所解释的，当人们站起来时，血流通常会向下转移到我们的胸部以下。但在IOH中，这种变化似乎伴随着一种反射，这种反射是由我们站立时肌肉的激活触发的，导致血管广泛开放，正是这种结合导致血压迅速但暂时的下降。基于Raj团队早期的工作以及其他研究，他们假设IOH患者可以通过早期激活反射或在站立时拉紧下肢肌肉来缩短这一过程，从而在一定程度上缓解血压下降。\n为了验证这一点，他们招募了22名IOH志愿者，尝试他们开发的两种技术。其中一种方法是从坐姿开始预激活反射后面的肌肉，每次只需抬起一个膝盖，持续30秒。另一组要求人们站立，然后交叉双腿，紧握大腿和臀部，收紧下肢。作为对照，志愿者也会正常站立。\n与对照组相比，在对志愿者的血液循环和自我报告的症状进行测量后，两种技术都改善了患者的IOH。据传闻，拉杰诊所的患者在采取这些策略后也取得了类似的成功。研究小组的研究结果周三发表在《心律》杂志上。\n“它是免费的，没有任何药物副作用，完全在他们的控制范围内，我想很多患者都喜欢，”拉杰说。\n值得注意的是，该试验的结果是基于小样本的，所有志愿者都是女性。拉杰说，这项试验的目的不仅仅是为了让女性参与，而且他们以先到先得的方式招募志愿者。女性快速志愿的事实可能反映出IOH对她们的影响更为频繁，但他认为这些技术没有理由不能帮助男性进行IOH。他指出，政府和卫生相关组织通常需要进行大规模试验，以支持某种疾病的治疗，这种试验的资金成本很高，但他的团队可能会进行较小的试验，在男性身上测试这种方法，或确定结合这些方法是否能提高其有效性。\n虽然其他人可能需要更多的研究才能广泛支持这些技术的使用，但拉杰希望他们的工作至少能提高人们对IOH的总体认识。\n拉杰说：“对我来说，这里更重要的信息是，最初的直立性低血压是存在的。这听起来可能很傻，但我已经有医生推荐了等待半年以上才来看我的患者。我认为这说明了一个事实，即这一点尚未被认识到。”。“因此，我希望通过强调这个问题，以及有一种可能的治疗方法，更多的人会认识到他们可能患有这种疾病。然后我们可以尝试简单的治疗方法。但是，除非他们意识到问题是什么，否则你无法将其传达给患者。”", "note_en": "In a small trial, people felt less dizzy when standing after practicing two easy-to-do physical techniques.\n Researchers in Canada say they’ve come up with two simple physical techniques to help prevent a common cause of dizziness and fainting. In a small trial, they found that these maneuvers, which involve nothing more than moving your lower limbs, could effectively reduce the symptoms of initial orthostatic hypotension, a condition that temporarily leaves people light headed when they stand up.\n  Orthostatic hypotension is a form of low blood pressure that happens when people stand up from sitting or lying down, leading to dizziness or even fainting. Often, this condition can be linked to underlying neurological problems, or it can happen as a side effect of many medications, and these cases tend to affect older people. But other times, this drop in blood pressure comes and goes very rapidly, within as little as a minute, and it may not be linked to any other health problems; this form is called   initial orthostatic hypotension (IOH) and it tends to affect younger people.\n Though many people can experience IOH without ever registering it as a big problem, some sufferers can have repeated or severe enough episodes of IOH that it routinely affects their daily functioning. Study author Satish Raj, a heart rhythm cardiologist at the University of Calgary, and his colleagues have often seen these sorts of patients at their dysautonomia and fainting clinic. And they wondered if there was something more they could offer these patients besides lifestyle changes like drinking more water or medications.\n    “On some level, everyone’s probably experienced this at some point in their life. But there are people in whom this happens a lot. And it can be disabling,” Raj told Gizmodo by phone.\n  As he explains it, when people stand up, blood flow normally shifts downward to below our chest. But in IOH, this change seems to be accompanied by a reflex, triggered by the activation of muscles as we stand up, that causes blood vessels to open widely—and it’s this combination that then causes the rapid but temporary drop in blood pressure. Based on Raj’s team’s earlier work, as well as other research, they hypothesized that people with IOH could short-circuit this process by activating the reflex early or by tensing the lower limb muscles as they stood, somewhat mitigating the blood pressure drop.\n   To test this out, they recruited 22 volunteers with IOH to try out both of the techniques they developed. One method involved pre-activating the muscles behind the reflex from a sitting position, done simply by raising the knees one at a time for up to 30 seconds. The other asked people to stand and then tense up their lower limbs, by crossing their legs and clenching their thighs and butt. As a control, the volunteers would also stand up normally.\n Compared to the control condition, on measures of both the volunteers’ circulation and their self-reported symptoms, people’s IOH improved after doing either technique. And Raj’s patients in the clinic have anecdotally reported similar success after adopting the strategies. The team’s findings were   published Wednesday in the journal Heart Rhythm.\n  “It’s free, it doesn’t have any drug side effects, and it’s totally within their control, which I think a lot of patients like,” Raj said.\n It’s important to note that the trial’s findings are based on a small sample size, and that all of the volunteers were women. Raj says the trial wasn’t intended to only include women and that they took on volunteers on a first-come-first-served basis. The fact that women volunteered quickly might reflect that IOH affects them more often, but he sees no reason why these techniques wouldn’t help men with IOH. He noted that large-scale trials—the kind often needed for governments and health-related organizations to endorse treatments for a condition—are expensive to fund, but his team may yet conduct smaller trials to test out the methods in men or to determine whether combining the methods boosts their effectiveness.\n  While it may take more research for others to widely support the use of these techniques, Raj hopes their work can at least raise awareness of IOH in general.\n  “To me, the bigger message here is that initial orthostatic hypotension exists. And that might sound like a silly thing to say, but I’ve had physicians referring patients that wait over half a year to see me for this problem. And I think that speaks to the fact that this isn’t recognized,” Raj said. “And so, my hope is that by highlighting the problem, and that there’s a possible treatment, some more people will recognize that they might have it. And then we can try out the simple treatment. But you can’t get that to the patient unless they realize what the problem is.”", "posttime": "2022-02-15 07:56:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "减少,movements,可能", "title": "研究发现，两个简单的动作可以减少站立时的眩晕", "title_en": "Two Simple Movements Can Reduce Dizziness When Standing Up, Study Finds", "transed": 1, "url": "https://gizmodo.com/study-how-to-prevent-dizziness-when-standing-1848507098", "via": "", "real_tags": ["减少", "movements", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "距离今年第一场预计将推出新款iPhone SE和iPad Air的活动只有几周的时间了，有关苹果计划在2022年剩余时间内推出哪些产品的传言已经沸沸扬扬。它看起来像Mac电脑，Mac电脑，还有更多的Mac电脑。\n根据马克·古尔曼（Mark Gurman）最新的开机通讯，苹果准备在2022年推出不少于四台M2 Mac电脑。首批机型可能会在今年晚些时候面世，重新设计的MacBook Air将引领潮流，紧随其后的是新的13英寸MacBook Pro、24英寸iMac和入门级MacMini。DigiTimes周二的一份报告称，13英寸的MacBook Pro可能会在苹果的春季发布会上发布，以迎接新芯片的到来。\n与2021一样，苹果将在2022发布多个不同芯片的Mac电脑。M2将是M1的继任者，可能采用相同的8核设计（四个性能核和四个效率核），M1 Pro和M1 Max将进入更高端的Mac。第一款是27英寸的iMac，可能会在苹果的春季发布会上亮相，今年晚些时候还会推出Mac mini。\n根据传闻将于2022年推出的Mac电脑，苹果硅芯片的开发周期为18个月。第一批M1 Mac是在2020年11月发布的，因此6月份发布大约需要一年半的时间。秋季发布的新24英寸iMac也是如此。\n2022年，苹果公司将推出一款新的Mac Pro，作为苹果硅芯片转型的高潮。这意味着，今年所有Mac系列和几乎所有型号都将进行更新，只有最近发布的14英寸和16英寸MacBook Pro没有更新。\n更新2/8：一份DigiTimes报告称，13英寸MacBook Pro可能是2022年推出的第一款新M2机型。\n注意：当你点击我们文章中的链接后购买物品时，我们可能会获得少量佣金。阅读我们的会员链接政策了解更多详细信息。\n自从iPod成为iWalk以来，迈克尔·西蒙一直在报道苹果。他对技术的痴迷可以追溯到他的第一台个人电脑——IBM Thinkpad，它带有提升式键盘，用于更换驱动器。他&#39；It’他仍在等待它的回归。", "note_en": "With just weeks to go until the f irst event of the year that’s expected to bring a new  iPhone SE and  iPad Air, rumors are already swirling about what Apple has planned for the rest of 2022. And it’s looking like Macs, Macs, and more Macs.\n According to Mark Gurman’s latest  Power On newsletter, Apple is preparing to launch no less than four M2 Macs throughout 2022. The first models will likely arrive later in the year, with the redesigned MacBook Air leading the way, followed by a  new 13-inch MacBook Pro,  24-inch iMac, and  entry-level Mac mini. A  DigiTimes report on Tuesday said the 13-inch MacBook Pro may launch at Apple’s spring event to usher in the new chip.\n Like 2021, Apple will be releasing Macs with several different chips in 2022. The M2 will be a successor to the M1, likely with the same 8-core design (four performance cores and four efficiency cores), and the M1 Pro and M1 Max will make their way into more high-end Macs. The first of those, the 27-inch iMac, could arrive at Apple’s spring event, with a  Mac mini coming later in the year.\n Based on the Macs rumored to launch in 2022, Apple silicon is on an 18-month cadence. The first M1 Macs were released in November 2020, so a June release would be roughly a year in a half. The same would go for a fall launch for a new 24-inch iMac.\n    There’s also a new  Mac Pro due in 2022 as the culmination of the Apple silicon transition. That would mean every Mac line is due for a refresh this year and nearly every model, with only the recently released 14-inch and 16-inch MacBook Pro escaping without a refresh.\n Update 2/8:  A  DigiTimes report says the 13-inch MacBook Pro could be the first new M2 model to launch in 2022.\n Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our   affiliate link policy  for more details.\n    Michael Simon has been covering Apple since the iPod was the iWalk. His obsession with technology goes back to his first PC—the IBM Thinkpad with the lift-up keyboard for swapping out the drive. He&#39;s still waiting for that to come back in style tbh.", "posttime": "2022-02-15 07:45:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,设计,m1,mac,苹果", "title": "每一款M1 Mac都将于2022年更新，采用更快的M2芯片和新设计", "title_en": "Every M1 Mac Is Due For a 2022 Refresh With Faster M2 Chip, New Designs", "transed": 1, "url": "https://www.macworld.com/article/612350/apple-planning-to-upgrade-every-m1-mac-in-2022.html", "via": "", "real_tags": ["芯片", "设计", "m1", "mac", "苹果"]}]