[{"category": "", "categoryclass": "", "imagename": "4aa9f52f8344185f1e589a7ac8505ef7.jpeg", "infoid": 1003869, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你在2016年3月15日下午3点34分找我，你就不会在我的办公桌前找到我。你必须蜿蜒穿过桌子、椅子、电源线和以太网电缆组成的开放平面图，最终到达一扇标有MANS的门。\n尽管上一次会议的结果是这样的，我还是设法在穿过迷宫的路上保持着一副严肃的面孔。我的演讲是平等的，因为我确信它是。没有明显的嘴唇颤动。但当我们讨论下一步并结束事情时，我笑得太多了，也笑得太宽了。人无完人。\n会议结束后，我离开了，走在大厅里，仍然面带微笑。我试着避开别人的注意，既不走得太快也不走得太慢。只是很随意，试着向每个人展示我是多么正常，我周围的一切都是多么正常，只是在这片非常正常的土地上的又一个非常正常的一天，这片土地上的东西移动得很快，也很容易崩溃。\n我走进男洗手间，一边走一边避开镜子。我不想看到那个假的鲨鱼微笑。在其中一个水槽，一个家伙正在给他的头发加发胶，使他的头发变得僵硬而竖直。他没有看我，我会永远感激他的。我想不引人注意，什么都不想，比什么都不想。\n排尾最后一个隔间的门是开着的。当我进去扭动锁时，我的手在颤抖。它发出了轻轻的咔哒声，就是这样--我再也忍不住了。眼泪从我身上流了出来。\n我在男洗手间。尽我所能轻声哭泣。但是搭便车背叛了我--听到过那些喘息和呕吐的人都不会把它们误认为是别的。因为它太丑了，太人性化了。\n我哭是因为我让我的团队失望了。现在细节已经不重要了，但我刚刚参加的会议清楚地告诉我，我犯了一些错误。大错特错。\n所以我躲在洗手间的隔间里哭了起来。但这不是第一次(或最后一次)。我在1：1的会议上哭过，在与一位固执的同事激烈争吵之后，在收到负面反馈后，…。在给出负面反馈之后也是如此。\n我不一定要伤心才能哭--年龄越大，我就越爱哭。哭泣给我一种宣泄：一种可以冲走压力和悲伤、愤怒和焦虑，甚至是压倒性的快乐的释放。\n但是，在感受所有这些感觉时，哭泣帮助我重新专注于对我真正重要的事情和人。哭泣让我感觉更坚强，因为它向我展示了我所关心的。\n我明白了：你认为我很可悲。你不是第一个(或唯一一个)这样认为的人。这是因为我们倾向于评判爱哭的人，尤其是那些在工作中哭泣的人。哭泣的人往往会严厉地评价自己--我知道我是这样做的。\n尽管如此，我的身份在一定程度上保护了我免受在工作中哭泣的负面影响：我的性别、种族、年龄和领导职位让我在公共场合哭泣要安全得多。大多数人看到、解读和回应一位年长的白人男子的眼泪时，会与其他人截然不同。因此，我的特权意味着我比其他人更不可能面临比其他人更严重的后果。\n但是，即使有这么多特权，我仍然觉得有必要躲在卫生间隔间里。我想要隐藏或逃离我真诚的感觉的冲动-这是我感受到的最强烈、最深刻的冲动之一-让我想知道其他所有人是什么样子：有色人种、LGTBQ+人群、任何已知或明显残疾的人，特别是那些认为自己是女性的人。我研究了所有这些领域，但这里我将重点介绍我所了解到的女性在工作场所的经历。\n安妮·克里默(Anne Kreamer)写道：“尽管有宣泄生理上的好处，但在工作中哭泣的女性事后会感觉很糟糕，就像她们没有通过女权主义测试一样。”这本书的作者是“永远是个人的：职场中的情感导航”(It Always‘s Personal：Naviating Emotion in the Workplace)。她指出，“(女性)在工作中哭泣后感觉更糟，而男性感觉更好。”相反，Kreamer的数据显示，41%的女性在工作时哭过，但只有9%的男性哭过。\n因此Kreamer发现，尽管哭泣会让女性感觉更糟，但她们往往会哭得更多。虽然哭泣能让男人感觉更好，但他们哭的次数更少。为什么？\n我们需要问这一点，因为当妇女(或其他任何人)被告知她们不允许哭泣时，这是一种压迫行为。这是因为哭泣是生物学的一种自然功能。科学表明，荷尔蒙的差异，甚至泪道的大小，都会影响人们哭泣的方式，以及人们对哭泣的感知方式。\n这些感知上的差异可能是由无意识的偏见引起的。男人经常被社会化，通过愤怒来表达他们的情绪--所以那些会哭的男人被认为更真实、更勇敢，甚至更坚强。对于女性则不是这样：“当女性表达情绪时，观察者更有可能做出性格归因(即，归因于一个人的先天特征)”(…)。研究人员还发现，‘在工作中表露情绪是功能失调’的信念更有可能适用于女性，而不是男性。“。\n我们需要改变这一点--有些人已经在改变了。Facebook首席运营官谢丽尔·桑德伯格(Sheryl Sandberg)指出，每个人--包括女性和男性--在工作时哭泣都是完全正常的。“我在工作时哭，”她说。“我认为我们，我们所有人，都是情绪化的存在，我们可以在工作中分享这种情感。”\n同样，专注商业研究所的创始人Manijeh Motaghy说：“(在工作中哭泣)可以让人松口气。反对者可能担心员工会陷入让她哭泣的故事中，分心于手头的工作，这是可以理解的。\n莫塔希继续说：“我认为最好的方法是训练员工更多地意识到哭泣背后的潜在感受，而不是阻止(因为这是不合适的)或允许哭泣(因为这更人性化)。”\n我们不必只把哭泣的好处留给像我这样的年长白人男性。奖励男人和惩罚女人不仅不公平，而且是一种压迫行为。我们应该承认，无意识的偏见塑造了我们如何看待哭泣的人，然后一起努力使哭泣正常化，无论人们的性别、种族或地位如何。\n最重要的是，我们应该停止评判哭泣的人，开始支持他们。\n我想指出，我既不是治疗师，也不是心理健康专家。如果你正在读这篇文章，你可能也不是这样的人。没关系，人无完人。尽你最大努力就行了。\n如果一个人在你面前哭泣，不要试图忽视它或假装它没有发生。因为这肯定会发生。\n无论是什么导致了这一时刻，通过承认他们的感受和他们正在经历的事情来尊重他们。向他们表明你在这里，随时可以为他们服务--不要高举双手后退，就好像他们带着传染病一样。没关系，你不会被烫伤的。\n你可能会感到害怕，你可能会感到尴尬，你可能会感到不舒服。即便如此，哭泣的人感受到的那种感觉比你大几个数量级。\n你所需要做的就是在场、有空，不要通过告诉他们停止或长大来否定他们。最重要的是，如果一个人在你面前哭泣，千万不要对他们或他们的处境做出任何假设或判断。\n这是你能为任何哭泣的人做的最有帮助的事。向你流泪的人--尤其是在工作中--是最脆弱的人。\n他们可能担心他们的哭泣会限制他们的职业生涯。他们可能会担心你会告诉他们的同事、经理或人力资源部的某个人。最重要的是，当他们放松警惕的时候，他们可能害怕你，害怕你会说什么或想什么。如果你总是根据这一次遭遇来判断他们呢？\n让人们知道他们没有被评判。告诉他们一切都会好起来的-他们不会相信你的，但这仍然会让他们感到更安全。让他们知道他们是安全的，得到了支持，你在这里支持他们。如果他们选择表达自己的感受，给他们自由，但也给他们离开的自由，找其他人交谈的自由，或者做他们需要做的任何事情的自由。\n支持哭泣的人最好的方法就是闭嘴倾听。听我说。你不需要解决他们的问题，不需要告诉他们怎么做错了，不需要提出解决方案，也不需要做其他任何事情。\n我知道避免解构一个人的问题并试图为他们解决问题是一件具有挑战性的事情，特别是对于像我这样在科技行业工作的人。我们如此热衷于解决问题、分析和反馈。你可能会觉得为他们解决这个人的问题来投入工作是你的责任。\n然而，人不是产品。克制住告诉哭泣的人该做什么，为什么他们错了，他们应该怎么做，或者如何解决问题的冲动。这不是你的地方，也不是他们需要你做的。你根本不知道他们在经历什么。\n所以你只要听我说。让眼泪--和那个人的话--自由流淌。\n这可能很难理解，但是哭泣的人并不欠你任何东西。他们不需要给你解释，不需要拥抱，甚至不需要谢谢你。\n他们可能还没有准备好谈论正在发生的事情-这没什么。如果他们想要独处，你不需要强迫他们说话或和其他人在一起。\n轻轻地问“我能帮上什么忙吗？”或者“你需要什么？”承认他们的感受，并给予他们选择自己前进道路所需的力量。这就是你真正需要做的一切。不过，如果你再递给他们一盒纸巾，他们可能会很感激--我当然会。\n当你能读懂情况，理解上下文，倾听他们的需求，尊重他们的需求时，你就会对他们给予最好的支持，即使这意味着你不是他们故事中的英雄。没关系，因为这给了他们更多的空间去做自己的英雄。\n我认为在工作中哭泣最难的部分是我们不应该谈论这件事。不管你有多开放和有意识，你很可能仍然有偏见，认为社会在向你灌输-我知道我是这样做的。我们大多数人都被社会化了，认为女人总是情绪化的，男人从来不哭。因此，男性创造的工作文化很可能是不接受哭泣的文化。\n相反，我们觉得我们应该让它消失，假装它没有发生，他妈的把它压下去，让它消失。虽然我相信哭是完全没问题的，但我还是会在哭的时候痛打自己。\n但任何人都不应该这样做。为了打击对哭泣的人的偏见，我们需要改变这些工作文化，即使我们不是塑造他们的人。这意味着我们需要能够谈论哭泣，公开承认这一点，并在哭泣发生时支持人们。\n因为这将会发生。当你读这篇文章的时候，它可能正在发生在你认识的某个人身上。\n随着越来越多的公司要求员工带着完整、真实的自我去工作，我们应该用他们的微笑欢迎他们的泪水，用他们的假笑欢迎他们的哭泣，用他们的大笑欢迎他们的搭便车。我们不能半途而废地打开情绪之门，特别是如果我们制定了无形的、武断的或性别歧视的规则，规定哪些情绪是可以接受的，哪些是不可以接受的。\n有些人在工作时会哭。我知道是因为我是他们中的一员。你可能也是。因此，我们需要共同努力，打破沉默的共谋。", "note_en": "If you were looking for me at 3:34pm on March 15, 2016, you wouldn’t have found me at my desk. You’d have to wind your way through an open floor plan of tables, chairs, and streams of power cords and ethernet cables until you eventually arrived at a door labeled  MEN.\n Despite the outcome of my last meeting, I’d managed to keep a straight face on my way through the maze. My speech was even because I made sure it was. No tell-tale lip quivers. But I smiled too much — and far too wide — as we discussed next steps and wrapped things up. Nobody’s perfect.\n After the meeting, I left and walked down the hall, still smiling. I was trying to avoid attention, not walking too fast or too slow. Just being casual, trying to show everyone just how normal I am, just how normal everything was around me, just another very normal day in the very normal land of Moving Fast and Breaking Things.\n  I arrived at the men’s bathroom, avoiding the mirror as I walked in. I didn’t want to see that fake shark smile. At one of the sinks, a dude was adding gel to his hair, making it stiff and upright. He didn’t look at me and I’ll always be grateful to him for that. I wanted to be unnoticeable, nothing, less than nothing.\n The door was open on the last stall at the end of the row. My hands shook as I entered and twisted the lock. It made a soft  click and that was it — I couldn’t hold it in anymore. Tears streamed out of me.\n   I was in the men’s bathroom. Crying as quietly as I could. But the hitching betrayed me — no one who’s heard those gasps and retches could mistake them for anything else. Because it’s so ugly, so human.\n  I was crying because I’d let my team down. The details don’t matter now, but the meeting I’d just been in made it clear to me that I’d made some mistakes.  Big mistakes.\n So I hid in a bathroom stall and cried. But that wasn’t the first time (or the last). I’ve cried in 1:1 meetings, after a hard argument with a stubborn colleague, after receiving negative feedback… after  giving negative feedback, too.\n I don’t have to be sad to cry — the older I get, the more weepy I become. Crying gives me catharsis: a release that washes away stress and sadness, anger and anxiety, or even overwhelming happiness.\n But in  feeling all of those feels, crying helps me refocus on the things and people that really matter to me. Crying makes me feel stronger by showing me what I care about.\n  I get it: you think I’m pathetic. You’re not the first (or only one) to think so. That’s because we tend to judge people who cry ,  especially people who cry at work. And people who cry often judge themselves harshly — I know I do.\n Even so, I’m somewhat protected from the negative impact of crying at work by my identity: my gender, race, age, and position of leadership make it a lot safer for me to cry in public. Most people will see, interpret, and respond to  the tears of an older white man very differently than they would someone else’s. So my privilege means that I’m far less likely than others to face severe consequences than others.\n But even with all that privilege, I still feel compelled to hide away in a bathroom stall. My urge to hide or run away from my honest feelings—and it is one of the strongest, deepest urges I feel—makes me wonder what it’s like for everyone else: people of color, LGTBQ+ folks, anyone with known or visible disabilities, and especially people who identify as women. I researched all of these areas, but here I’m going to focus on what I learned about the experiences of women in the workplace.\n “In spite of the cathartic physiological benefits, women who cry at work feel rotten afterward, as if they’ve failed a feminism test,” writes  Anne Kreamer, author of the book   It’s Always Personal: Navigating Emotion In The Workplace. She points out that “[Women] feel worse after crying at work, while men feel better.” Inversely, Kreamer’s data showed that  41% of women have cried at work, but only 9% of men have.\n So Kreamer found that even though crying made women feel worse, they tend to do it more. And while crying makes men feel better, they do it less.  Why?\n We need to ask this because when women (or anyone else) are told that they’re not allowed to cry,  this is an act of oppression. That’s because crying is a natural  function of biology. Science shows that  hormonal differences and even tear duct size play a role in how people cry, as well as how that crying is perceived.\n These differences in perception can be caused by  unconscious bias. Men are often socialized to  express their emotions through anger—so those men who are able to cry are perceived as being more authentic, brave, or even strong. Not so with women: “Observers are more likely to make dispositional attributions (i.e., attributions to a person’s innate characteristics) when women express emotions… Researchers have also found that the belief that ‘displaying emotion at work is dysfunctional’  is more likely to be applied to women than to men.”\n We need to change this — and some people already are. Sheryl Sandberg, Chief Operating Officer at Facebook, has pointed out that  it’s perfectly okay for everyone—both women and men—to cry at work. “I cry at work,” she’s said. “I think we are, all of us, emotional beings and it’s okay for us to share that emotion at work.”\n Likewise,  Manijeh Motaghy, founder of the  Mindful Business Institute, has said: “[Crying at work] can give a person a few moments of relief. Those who are against it perhaps fear the employee is caught up in the story that caused her to cry, and distracted from tasks at hand, which is understandable.”\n Motaghy continues: “I believe the best way is to  train employees to become more aware of the underlying feelings behind crying rather than preventing it (because it is not appropriate) or allowing it (because it is more humane).”\n  We don’t have to reserve the benefits of crying just for older white men like me. Rewarding dudes and punishing women is not only unfair, it’s an act of oppression. We should admit that unconscious bias shapes how we see people who cry and then  work together to normalize crying no matter people’s gender, race, or status.\n Most of all, we should  stop judging people who cry — and start supporting them.\n  I want to point out that I’m not a therapist or mental health professional. And if you’re reading this, you’re probably not one either. That’s all right, nobody’s perfect. Just do your best.\n  If a person is sobbing in front of you, don’t try to ignore it or pretend like it’s not happening. Because  it’s definitely happening.\n No matter what’s led to this moment, respect the person by acknowledging their feelings and what they’re experiencing. Show them that you’re here and available for them — don’t back away with your hands up as if they’re carrying a contagious disease. It’s okay, you won’t get burned.\n You may feel afraid, you may feel embarrassed, you may feel uncomfortable. Even so, the person who’s crying feels those feelings at  several orders of magnitude greater than you.\n All you need to do is be present, available, and  don’t negate the person by telling them to stop or to grow up. Most of all, if a person cries in front of you, never make any assumptions or judgments about them or their situation.\n  This is the most helpful thing you can do for anyone who’s crying. A person who shows you their tears — particularly at work — is a person at their most vulnerable.\n They might fear that their crying will be a  career-limiting move. They might worry that you’ll tell their colleagues or manager or someone in HR. Most of all, they might be afraid of  you and what you’ll say or think during this moment when their guard is down. What if you always judge them based on this one encounter?\n Let people know they’re not being judged. Tell them it’s going to be okay — they won’t believe you, but it will still help them feel safer. Let them know they’re safe and supported and that you’re here for them. Give them the freedom to express their feelings if they choose to, but also the freedom to leave, find someone else to talk with, or do whatever they need to do.\n The best way to support a crying person is to shut up and listen.  Just listen. You don’t need to solve their problem, tell them how they got it wrong, propose solutions, or do anything else.\n I know it’s challenging to avoid deconstructing a person’s problems and trying to fix it for them, especially for people like me who work in tech. We’re so wired for problem solving, analysis, and feedback. You might feel like it’s your duty to jump in and get to work by solving this person’s problem for them.\n Nevertheless,  people are not products. Resist the urge to tell a crying person what to do, why they’re wrong, how they should act, or how to fix things. It’s not your place and it’s not what they need from you. You have no clue what they’re going through.\n So just listen. Let the tears — and the person’s words — flow freely.\n  This may be hard to understand, but someone who’s crying doesn’t owe you anything. They don’t need to give you an explanation, a hug, or even a thank you.\n They may not be ready to talk about what’s going on — and that’s okay. You don’t need to force them to talk or to be with other people if they want to be left alone.\n Gently asking “How can I help?” or “What do you need?” acknowledges their feelings and gives them the power they need to choose their own path forward. That’s all you really need to do. Though they might appreciate if you hand them a box of tissues as well — I certainly do.\n You’ll support people best when you can read the situation, take in the context, listen to them, and honor their needs, even if that means that you’re not the hero of their story. That’s okay, because it gives them more space to be their own hero.\n  I think the hardest part of crying at work is that  we’re not supposed to talk about it. No matter how open and aware you are, you likely still have biases that society’s drilled into you — I know I do. Most of us are socialized to think that women are  always emotional and that men  never cry. So work cultures created by men are likely to be cultures where crying isn’t accepted.\n Instead, we feel like we’re supposed to make it disappear, pretend that it doesn’t happen,  stamp it the fuck down, make it go away. And as much as I believe that crying is totally okay, I still beat myself up when I do it.\n  But no one should have to do that. In order to fight bias against people who cry, we need to change these work cultures, even if we weren’t the ones who shaped them. That means we need to be able to talk about crying, acknowledge it openly, and support people when it happens.\n Because  it’s going to happen. It’s probably happening to someone you know right now while you read this.\n As more companies ask people to  bring their whole, authentic selves to work, we should welcome their tears with their smiles, their sobs with their smirks, and their hitching with their laughing. We can’t open the door to emotions only halfway — especially if we make invisible, arbitrary, or sexist rules about which emotions are acceptable and which ones aren’t.\n There are people who cry at work. I know because I’m one of them. You might be, too. So we need to work together to break the conspiracy of silence.", "posttime": "2020-05-27 08:18:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谈谈,crying,哭泣", "title": "我们需要谈谈工作时哭的事", "title_en": "We need to talk about crying at work", "transed": 1, "url": "https://medium.com/@jcolman/crying-at-work-8bef51ae7c47", "via": "", "real_tags": ["谈谈", "crying", "哭泣"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003868, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个专栏讲述了一个故事，它有一个寓意。它本身与J没有直接关系，J是这些专栏的表面原因，但它可以被证明是合理的，因为J的直接前身之一是A语言，这是阿瑟·惠特尼(Arthur Whitney)在摩根士丹利(Morgan Stanley)投资银行工作期间开发的。这是惠特尼一天下午在安大略省肯·艾弗森的窑场(Kiln Farm)编写的一页A类口译器的C代码，为罗杰·许(Roger Huge)提供了开始工作所需的方向，J·罗杰在艾弗森软件公司(Iverson Software Inc)出版的J&34；实现附录A中展示了这段代码。惠特尼不再在摩根士丹利工作：他开始是一名自由撰稿人，正在开发一种名为K的语言，这种语言与A和J有一定的亲和力。许仕仁现在摩根士丹利工作，故事讲述的是他冒险寻找一个大质数的故事，而许志永将A作为他瞄准大质数的武器。\n故事开始于惠氏在摩根士丹利的老板向他发起挑战，他说：“你认为你很聪明，但你甚至不知道10到10的质数是多少。”惠氏的第一反应是，你是从0开始数还是从1开始数？这位老板大吃一惊，有一分钟左右他都听不懂罗杰的问题。\n老板的挑战似乎是一个理论上可以实现但实际上不可能完成的计算任务的例子。这篇文章讲述了罗杰是如何去实现不可能的事情的。我认为它是客户端-服务器技术的胜利。本专栏与其说是一篇关于编程的文章，不如说是一篇关于计算机物流的文章。编程方面虽然很重要，但与Roger如何组织解决方案的故事相比，编程方面是次要的。\n惠的解决方案的萌芽是设想一个长度为k的布尔向量p，如果i是素数，那么p的第i个元素是1，否则是0。只需对这个非常长的向量进行求和扫描，并在其中查找1e10的索引。这样的载体应该有多长呢？素数定理说，小于1k的素数的数目大约是1k%(Logk)。在方程式1e10=k%(Log K)中求解k，得到的值约为22.63e11。罗杰出于谨慎，使用了2.7e11的值。*在计算机内存的当前状态下，由2.7E11个元素组成的向量是无法实现的，特别是因为A没有布尔类型：布尔向量需要与整数向量相同的空间。4x2.7e11或111e12字节长的向量根本不在卡片中。即使每个元素只有1位的布尔向量也必须超过3E10个字节的长度，因此显然必须对问题进行划分。\n惠的中央程序计算m和n之间的素数，使用筛子方法，消除2，3，5，7，11，13，17等的倍数。这可以在许多小间隔上独立地并行完成，这些小间隔构成了更大的感兴趣的间隔，如果分配到可以与公共中心文件通信的计算机上，将允许在比只有一台计算机处理问题的情况下在更短的时间内解决问题。\n分区的方法是由摩根士丹利惠氏部分的150多个工作站提出的。它们都是互连的Unix机器，任何机器都可以在任何其他机器上使用。只需相对较少的工作，就可以建立一个多处理器解决方案，使用这些机器并行运行。这些机器在周末不是很常用，实验是在一个周末进行的。\n策略是让机器一次处理10亿个整数。惠氏在摩根士丹利的同事塞思·布莱巴特(Seth Breitbart)建议创建271个文件，命名为0，1，2，.，270，每个文件表示命名间隔为1e9个连续数字，每个文件都是空的。\n一旦设置好，机器将做的是查看文件列表，随机挑选一个(命名为1m)，擦除它，在间隔t(1e9*m)+i.1e9上工作，一次处理一百万个数字，完成后，编写一个文件，其中包含一个记录，给出该1e9内每个百万号间隔中的质数(有一千个)。完成后，它重复该过程，仅在文件/间隔列表为空时停止。这些机器被设置为一次处理一百万个数字，因为可用的最小的机器有足够的内存一次处理这么多的数字。罗杰指出，如果两台机器意外地选择了相同的文件/间隔，不会造成很大的伤害。在灵活的Unix世界中，任何时候都可以将更多的机器投入使用。\n如果一个人是Unix系统的超级用户，你可以随意使用这些机器，比如找到所有其他机器的ID，但许志永(我认为这是明智的)不想被这样的功能玷污，所以为了得到机器的名字，他在地板上四处阅读贴在每台机器上的纸条上的机器名称，然后坐在他的机器前，询问他名单上每台机器的状态。如果它是空闲的，他就让它去解决问题。\n当他这样做的时候，有一个很好的两难境地要解决。在启动更多机器之前，他的时间应该花在改进算法上，还是应该花时间寻找更多的机器？出于新颖性的考虑，他倾向于后一种方法，最终使用了大约15个IBMRS/6000和60个Sun Sparc 2和Sparc 10。\n20个小时后，他有271个文件，每个文件有1000条记录。从这些数据中，他得出了区间1e6*i.271000中素数的271000个元素向量。因此，通过对此进行总和扫描，他知道了包含第10^10次素数的间隔。他的函数psieve返回一个布尔列表，选择m和n之间的素数。将其应用于魔术区间得到实际的第10^10个素数。\n关于他的程序的一些细节：如果一个数q不能被小于或等于1sqrt(Q)的任何数整除，则q是素数。因此，要测试一个小于2.7e11的数字的素性，只需使用小于1sqrt(2.7e11)或大致小于6e5的试除数即可。在实践中，惠递归地预计算出了所有小于1e6的78,498个素数的列表，从2 3 5 7开始自举。(这只需要几秒钟。)。当时，确定任何小于1e12的数字是否为素数是例行公事：只要看看它相对于每个小于一百万的素数的残数是否是非零；如果是，那它就是素数。\n对于好奇的人来说，这里是前10,000,000,002个素数的简明列表，以及它们的0起源序号。\n0 2 1 3 2 5 3 7 4 11.1e10-1252,097,800,623 1e10 252,097,800,629 1e10+1 252,097,800,637。\n这样做之后，许发现威廉·贾德森·列维克(William Judson Leveque)在“数论基础”第1.1节中有一张表，上面列出了少于10^3+I.8的素数数量。惠氏的表格与Leveque的表格10^3+I.7一致。然而，对于10^10，Leveque说是455,052,512，许说是455,052,511。事实证明莱维克是错的，惠曾在滑铁卢大学的李·迪基的帮助下检查了他的结果。Dickey告诉Hue，他的同事们推测Leveque可能是从D.N.Lehmer编制的列表中获得了他的数字，其中包括1作为质数，而Leveque可能没有从那个特定的数字中减去1。(1不是素数，因为它不满足素数的定义：正好有两个不同因子1和n的正整数n。)。\n现在来看看这个故事的寓意：许志永告诉我，从那以后，他也找到了一些工作，可以更容易地发现任何第n个素数。德国天文学家梅塞尔在19世纪70年代发现了一种计算pi(X)的个体值的方法，即素数t&lt；：x的计数函数。但他的方法是基于部分筛选函数的递归，他用它来计算pi(1e9)，其中，pi是一个计算小于或等于其自变量的素数的函数。D.H.Lehmer简化和扩展了Meissel的方法。最近，包括一些新的筛选技术的Meissel-Lehmer方法的进一步改进已经由Lagaria，Miller和Odlyzko在&#34；Computing pi(X)：Meissel-Lehmer method&#34；中报告，Maxims of Computation，卷44，编号170,1985年4，第537到560页。在本文中，作者给出了所得算法的渐近运行时间分析，表明对于每个e&gt；0，它最多使用O(x^(2r3)+e)算术运算，并且最多使用计算机上的O(x^(1r3)+e)个存储位置，使用长度为1+&lt；2^.x比特的字。使用并行处理器可以进一步加速算法。它们表明，有一种算法，当给定M个并行处理机时，在每个并行处理机上最多使用O(x^(1r3)+e)个存储位置来计算时间至多为O((%M)*x^(2r3)+e)的pi(X)，提供了M&lt；：x^1r3。*实现了该算法的一个变体，并将其用于计算pi(4e16)。\n他们报告称，在IBM 3081K上，pi(4e16)花了他们1730分钟；npi(2e12)花了3分钟；npi(3e12)花了4分钟。如果他知道这种方法，在相当慷慨地使用素数定理缩小搜索区间后，辉可能会使用二进制搜索技术，使用OO(2logn)技术来找到第110个素数。惠计算的值是1pi(2.52e11)，他在60-70个工作站上花了20个小时。大脑再次战胜肌肉：一个设计良好、数学知识渊博的算法击败了蛮力！", "note_en": "This column tells a story, and it has a moral. It does not concern itself directly with J, the ostensible reason for these columns, but it can be justified because one of the direct antecedents of J is the language A, developed by Arthur Whitney while he worked at the investment banking firm of Morgan Stanley. It was  one page of C code for an A-like interpreter, written one afternoon by Whitney at Ken Iverson&#39;s Kiln Farm in Ontario that gave Roger Hui the direction he needed to start work on what was to become J. Roger exhibits this code in Appendix A of &#34;An Implementation of J&#34;, published by Iverson Software Inc. Whitney no longer works at Morgan Stanley: he has set out as a free lance and is developing a language called K, which has some affinity with A and J. Hui now works at Morgan Stanley, and it is his adventure hunting down a large prime that the story is about, and Hui used A as the weapon with which he targeted the large prime.\n The story begins when Hui&#39;s boss at Morgan Stanley challenged him by saying, &#34;You think you&#39;re smart, but you don&#39;t even know what the 10-to-the-10-th prime is.&#34; Hui&#39;s immediate response was, &#34;Do you start counting from 0 or 1?&#34; The boss was so taken aback that for a minute or so he didn&#39;t understand Roger&#39;s question.\n The boss&#39;s challenge seems to have been meant as an example of a theoretically attainable but practically impossible computational task. This article tells how Roger went about achieving the impossible. I look on it as a triumph of the client-server technology. This column is not so much an article about programming as it is about computer logistics. The programming aspects, while important, are secondary to the story of how Roger went about organizing the solution.\n The germ of Hui&#39;s solution was to envision a Boolean vector  p of length  k such that the  ith element of  p is 1 if  i is prime, and 0 otherwise. Just sum-scan this very long vector and look for the index of  1e10 in it. How long should such a vector be? The Prime Number Theorem says that the number of primes less than  k is roughly  k%(log k) .  Solving for  k in the equation  1e10=k%(log k) gives a value for  k about  2.63e11 .  Roger, out of prudence, used the value  2.7e11 .  A vector of  2.7e11 elements is unrealizable in the present state of computer memories, especially since A doesn&#39;t have a Boolean type: Boolean vectors require the same space as integer vectors. A vector of  4*2.7e11 ,  or  1e12 bytes long is simply not in the cards. Even a Boolean vector taking just 1 bit per element would have to be more than  3e10 bytes long, so it was clear that the problem had to be partitioned.\n Hui&#39;s central program computes the primes between  m and  n ,  using the sieve method, eliminating multiples of 2, 3, 5, 7, 11, 13, 17, etc. This can be done independently in parallel on many small intervals that make up the larger interval of interest, and, if portioned out to computers that can communicate with a common central file, will permit the problem to be solved in shorter time than if only one computer was to tackle it.\n The method of partitioning was suggested by the presence of more than 150 workstations on the floor in Hui&#39;s part of Morgan Stanley. They are all interconnected Unix machines, and any machine can be used from any other machine. With relatively small effort a multi-processor solution could be set up, using these machines in parallel. The machines are not heavily used on the weekends, and it was on a weekend that the experiment took place.\n The strategy was to let the machines tackle the problem a billion integers at a time. Hui&#39;s colleague at Morgan Stanley, Seth Breitbart, suggested creating 271 files, named 0, 1, 2, ..., 270, each denoting the named interval of  1e9 consecutive numbers, and each one empty.\n What a machine would do once it was set going was to look at the list of files, pick one at random (named  m), erase it, work on the interval  (1e9*m)+i.1e9 ,  a million numbers at a time, and after finishing, write a file containing a record giving the number of primes in each of the million-number intervals within that  1e9 (there are a thousand of them). After finishing, it repeats that process, stopping only when the list of files/intervals are empty. The machines were set up to process a million numbers at a time since the smallest machine available had enough memory to handle that many numbers at once. Roger notes that there&#39;s no great harm if two machines accidentally happen to pick the same file/interval. In the flexible Unix universe additional machines could be brought on stream at any time.\n If one is a Unix system superuser it is possible to take all sorts of liberties with these machines, like finding the ids of all other machines, but Hui prefers (wisely, I think) not to be tainted by such capabilities, so to get the machine&#39;s names he went about the floor reading the names of the machines from strips of paper affixed to each one, then sat down at his machine and made inquiries about the state of each machine on his list. If it was idle, he set it going on the problem.\n As he was doing this, there was a nice dilemma to resolve. Should his time be spent improving the algorithm before launching more machines, or should he spend time looking for additional machines? He favored the latter approach for the novelty of it, and ended up using about 15 IBM RS/6000s and 60 Sun Sparc 2s and Sparc 10s.\n After 20 hours, he had 271 files, each with 1,000 records. From these he made a 271,000 element vector of the number of primes in the intervals  1e6*i.271000 .  By sum-scanning this he knew the interval containing the  10^10-th prime. His function  psieve returns a Boolean list selecting the primes between m and n. Applying this to the magic interval gets the actual  10^10-th prime.\n Some details about his program &#34;sieve&#34;: If a number q is not divisible by any number less than or equal to  sqrt(q) ,  then  q is prime. Therefore, to test a number less than  2.7e11 for primality one need only use trial divisors less than  sqrt(2.7e11) or roughly  6e5 .  In practice, Hui precomputed a list of all the 78,498 primes less than 1e6 recursively, bootstrapping up from 2 3 5 7. (This only takes a few seconds.) It was then a routine matter to determine for any number less than 1e12 whether or not it was prime: just see whether its residues with respect to each of the primes less than a million was nonzero; if so, it was a prime.\n For the curious, here is a condensed list of the first 10,000,000,002 primes, with their 0-origin ordinal numbers.\n 0 2 1 3 2 5 3 7 4 11 ... 1e10-1 252,097,800,623 1e10 252,097,800,629 1e10+1 252,097,800,637\n After doing this, Hui found that there is a table in William Judson LeVeque&#39;s &#34;Fundamentals of Number Theory&#34;, section 1.1, giving the number of primes less than  10^3+i.8 .  Hui&#39;s table agrees with LeVeque&#39;s for  10^3+i.7 .  For  10^10 ,  however, LeVeque says 455,052,512 and Hui says 455,052,511. It turns out that LeVeque is wrong, Hui having checked his results with some help from Lee Dickey at Waterloo University. Dickey tells Hui that his colleagues speculate that LeVeque may have gotten his numbers from lists that D.N. Lehmer compiled, which included 1 as a prime, and LeVeque may have slipped in not subtracting 1 from that particular count. (1 isn&#39;t a prime since it doesn&#39;t satisfy the definition of a prime: a positive integer n with exactly two distinct factors, 1 and  n .)\n Now for the moral of the story: Hui tells me he has also since found some work that would have made it much easier to discover the nth prime, for any n. E.D.F. Meissel, a German astronomer, found in the 1870s a method for computing individual values of  pi(x) ,  the counting function for the number of primes  &lt;:x .  His method was based on recurrences for partial sieving functions, and he used it to compute  pi(1e9) ,  where  pi is a function that computes the number of primes less than or equal to its argument. D.H. Lehmer simplified and extended Meissel&#39;s method. Recently, further refinements of the Meissel-Lehmer method which incorporate some new sieving techniques have been reported by Lagaria, Miller, and Odlyzko, in &#34;Computing pi(x): Meissel- Lehmer Method&#34;, Mathematics of Computation, Volume 44, Number 170, 1985 4, pages 537 to 560. In this article the authors give an asymptotic running time analysis of the resulting algorithm, showing that for every  e&gt;0 it computes  pi(x) using at most  O(x^(2r3)+e) arithmetic operations and using at most  O(x^(1r3)+e) storage locations on a computer using words of length  1+&lt;.2^.x bits. The algorithm can be further speeded up using parallel processors. They show that there is an algorithm which, when given  M parallel processors, computes  pi(x) in time at most  O((%M)*x^(2r3)+e) using at most  O(x^(1r3)+e) storage locations on each parallel processor, provided  M &lt;: x^1r3 .  A variant of the algorithm was implemented and used to compute  pi(4e16) .\n They report that  pi(4e16) took them 1730 minutes on an IBM 3081K;  pi(2e12) took 3 minutes;  pi(3e12) took 4 minutes. Had he known about this method, Hui could have used a binary search technique to find the  1e10th prime, using an  O(2 log n) technique, after narrowing the interval to be searched in by a reasonably generous use of the Prime Number Theorem. The value Hui computed was  pi(2.52e11) and it took him 20 hours on 60-70 workstations. Brains win again over brawn: a well-designed, mathematically knowledgeable algorithm beats brute force!", "posttime": "2020-05-27 07:47:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "素数,prime", "title": "第100,000,000,000个素数", "title_en": "The 10,000,000,000th Prime Number", "transed": 1, "url": "https://code.jsoftware.com/wiki/Doc/Articles/Play104", "via": "", "real_tags": ["素数", "prime"]}, {"category": "", "categoryclass": "", "imagename": "5e85ac2cc897d9caf2839ac90b5ea726.jpg", "infoid": 1003866, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在MacRumors上周获得的一份内部备忘录中，苹果表示将协助其全球第三方维修合作伙伴支付与新冠肺炎相关的费用，如清洁用品和个人防护装备。\n所有符合条件的苹果授权服务提供商将获得苹果的补贴，方式是增加每次完成维修的支出。这项补贴具有追溯性，提供的时间长短将取决于每个国家的全职指导方针。鼓励服务提供商联系他们的苹果代表了解更多细节。\n要查找您当地的Apple授权服务提供商，请访问Apple网站上的Get Support页面，然后按照步骤启动修复。\n他们这样做只是因为他们需要他们。他们不能不关心在这些中心工作的人。库克就是那个贪婪的人，一如既往。？\n奇怪的是，他们认为他们需要激励维修，这是完全没有道理的。也许第三方维修店正在放弃苹果。\n或者，也许不是。顺便说一句，如果你读了这篇文章，他们不是在激励修理，他们是在帮助他们的社区处理COVID。就像他们捐口罩，装面罩，捐钱一样，还有.。这些怎么会是坏事呢？\n所有符合条件的苹果授权服务提供商将获得苹果的补贴，方式是增加每次完成维修的支出。这项补贴具有追溯性，提供的时间长短将取决于每个国家的全职指导方针。\n非常酷。\n他们这样做只是因为他们需要他们。他们不能不关心在这些中心工作的人。库克就是那个贪婪的人，一如既往。？\n他们需要他们，但是他们就不能不在乎他们吗？如果你这么说就说得通了。：Rolleyes：奇怪的是，他们觉得需要激励维修。也许第三方维修店正在放弃苹果。\n也许外星人在传播新冠肺炎，也许喝漂白剂真的是治疗感染的好方法。投机是一件奇妙的事情。事实就更好了。\n[user=358123]HarryPot[/user]：他们这么做只是因为他们需要。他们不能不关心在这些中心工作的人。库克就是那个贪婪的人，一如既往。那完全说不通。\n检查您的浏览器。它似乎阻止了讽刺的HTML标记。\n应用程序漏洞导致一些iOS用户无法打开他们的应用程序，受影响的iPhone和iPad用户在尝试访问应用程序时会看到此应用程序不再与您共享的消息。在MacRumors论坛和Twitter上，遇到问题的用户对这个问题提出了多项投诉。MacRumors的一位读者描述了这个问题：还有其他人经历过.。\n在过去的几个小时里，一些MacRumors的读者报告说，他们的iOS设备上的App Store中显示了数十甚至数百个悬而未决的应用程序更新，其中包括许多用户最近已经更新的应用程序。在许多情况下，这些新的应用程序更新上列出的日期可以追溯到10天前。苹果没有分享任何信息，说明为什么要更新.。\n本周又是谣言纷至沓来的一周，关于苹果增强现实眼镜、iPhone12和苹果AirPods Studio耳机的报道纷至沓来。本周还发布了iOS13.5，为苹果的移动设备带来了大量与健康相关的更新。订阅MacRumors YouTube频道可以获得更多视频。本周感兴趣的其他话题包括……\n苹果公司旨在突出AirPods的创意广告在第99届ADC(艺术总监俱乐部)年度广告大奖中获得最高荣誉，获得最佳纪律奖以及视频和品牌内容类别的两个金立方奖。这则广告发布于2019年6月，主角是一个无聊的男人，他把AirPods从无线充电板上拉出来，然后砰地一声……。\niOS越狱工具背后的团队发布了其软件5.0.0版，该软件声称能够利用著名的iOS黑客Pwn20wnd的零日内核漏洞，越狱每台设备上的每个签名的iOS版本。这一声明是在宣布该工具将很快推出几天后发布的。UN0VER网站强调了该工具是如何..。\n我们最近听到了很多关于苹果公司传言已久的耳机的传言，据说这款耳机被称为AirPods Studio，而且看起来在不久的将来可能会推出一款新的耳机。(译注：这款耳机的名字是AirPods Studio，意思是“AirPods Studio”，意思是“AirPods Studio”，意思是“AirPods Studio，AirPods Studio”。)根据Beats Studio3传言制作的艺术家模型通常建议AirPods Studio在夏季或秋季推出，本周早些时候有报道称，越南的供应商将开始.。\n据今天的一份新报告称，苹果公司正寻求在未来几年内将光传感器集成到一款新的AirPods中，这表明它们的使用可能会成为传言中即将推出的真正无线耳机健康监测功能的一部分。在一篇有付费墙的文章中，DigiTimes报道称ASE技术可能参与传感器的制造：苹果预计将……。\n今日，“科技头版”主持人兼泄密者乔恩·普罗瑟分享了传闻中的苹果增强现实眼镜的几个据称细节，包括苹果眼镜的营销名称、499美元的起价、处方镜片选项等等。这款眼镜的营销名称将是Apple Glass，起价为499美元，可以选择处方镜片，但需要额外付费。这两款眼镜都将有显示屏。\n本周，前苹果高管、iOS首席执行官斯科特·福斯托尔罕见地在Code.org的虚拟密码破解活动上公开露面，在课间，福斯托尔分享了他是如何被史蒂夫·乔布斯聘用的耐人寻味的故事。Forstall透露，当他去NeXT面试时，他一直在考虑在微软工作，NeXT是乔布斯在离开苹果后创立的公司。福斯特..。\n我们现在距离5月25日星期一的阵亡将士纪念日只有几天了，许多零售商都开始打折来庆祝这个节日。这包括有用的苹果相关配件的销售，比如Anker的便携式电池，eBay上的Beats耳机，Incase和Incipio的iPad和iPhone保护套，Mophie的iPhone电池盒，JBL；的蓝牙扬声器等等。注：.", "note_en": "In an internal memo last week, obtained by MacRumors, Apple has indicated that it will assist its third-party repair partners around the world with COVID-19-related expenses, such as cleaning supplies and personal protective equipment.\n All eligible Apple Authorized Service Providers will receive a subsidy from Apple by way of increased payouts for each completed repair. The subsidy is retroactive and the length it is offered will depend on stay-at-home guidelines in each country. Service providers are encouraged to contact their Apple representatives for more details.\n To find an Apple Authorized Service Provider in your local area, visit the  Get Support page on Apple&#39;s website and follow the steps to initiate a repair.\n They are only doing this because they need them. They couldn&#39;t care less about the people that work at those centers. It&#39;s just Cook being the greedy person he is, as always.  ?\nThat makes absolutely no sense   Odd that they feel they need to incentivize a repair. Maybe 3rd party repair shops are bailing on Apple\nor, maybe not. BTW, if you read the article, they are not &#34;incentivizing&#34; a repair, they are assisting their community in dealing with COVID. Much like they donated masks, and assembled face shields, and donated money, and ...... How is any of that a bad thing?\n All eligible Apple Authorized Service Providers will receive a subsidy from Apple by way of increased payouts for each completed repair.  The subsidy is retroactive and the length it is offered will depend on stay-at-home guidelines in each country.\nVery cool.\n They are only doing this because they need them. They couldn&#39;t care less about the people that work at those centers. It&#39;s just Cook being the greedy person he is, as always.  ?\n&#34;they need them,&#34; but &#34;couldn&#39;t care less&#34; about them?  Makes PERFECT sense when you put it that way.  :rolleyes:   Odd that they feel they need to incentivize a repair. Maybe 3rd party repair shops are bailing on Apple\n&#34;Maybe&#34; aliens are spreading COVID-19, and &#34;maybe&#34; drinking bleach really is a great way to treat an infection. Speculation is a wonderful thing. Facts are even better.\n [USER=358123]HarryPot[/USER]:They are only doing this because they need them. They couldn&#39;t care less about the people that work at those centers. It&#39;s just Cook being the greedy person he is, as always.  That makes absolutely no sense\nCheck your browser. It seems to be blocking the Sarcasm HTML Tag\n  An app bug is causing some iOS users to be unable to open their apps, with affected iPhone and iPad users seeing the message &#34;This app is no longer shared with you&#34; when attempting to access an app.\rThere are multiple complaints about the issue on the MacRumors forums and on Twitter from users who are running into problems. A MacRumors reader describes the issue:Is anyone else experiencing...\n Over the past few hours, a number of MacRumors readers have reported seeing dozens or even hundreds of pending app updates showing in the App Store on their iOS devices, including for many apps that were already recently updated by the users. In many cases, the dates listed on these new app updates extend back as far as ten days.\rApple has not shared any information as to why updates for...\n It was another big week for rumors this week, with a flurry of reports about Apple&#39;s augmented reality glasses, the iPhone 12, and Apple&#39;s &#34;AirPods Studio&#34; over-ear headphones. This week also saw the release of iOS 13.5, bringing a number of health-related updates to Apple&#39;s mobile devices.\rSubscribe to the MacRumors YouTube channel for more videos. Other topics of interest this week included ...\n Apple&#39;s creative &#34;Bounce&#34; ad designed to highlight the AirPods took top honors in the 99th annual ADC (Art Director&#39;s Club) awards for advertising, earning the &#34;Best of Discipline&#34; award along with two Gold Cube awards in the craft in video and branded content categories.\rReleased in June 2019, the ad features a bored man who pulls his AirPods off of their wireless charging pad and then pops ...\n The team behind the &#34;unc0ver&#34; jailbreaking tool for iOS has released version 5.0.0 of its software that claims to have the ability to jailbreak &#34;every signed iOS version on every device&#34; using a zero-day kernel vulnerability by Pwn20wnd, a renowned iOS hacker. The announcement comes just days after it was announced that the tool would soon launch.\rThe unc0ver website highlights how the tool...\n We&#39;ve been hearing quite a bit recently about Apple&#39;s long-rumored over-ear headphones, said to be called &#34;AirPods Studio,&#34; and it looks like a launch may be coming in the relatively near future.\rArtist mockup based on Beats Studio3 Rumors have generally suggested a summer or fall launch for AirPods Studio, with a report earlier this week claiming that suppliers in Vietnam will begin...\n Apple is reportedly looking to integrate light sensors in a new model of AirPods in the next couple of years, according to a new report today, suggesting their use could be part of rumored upcoming health monitoring features in the true wireless earbuds. In a paywalled article, DigiTimes reports that ASE Technology could be involved in manufacturing the sensors:\rApple is expected to...\n Front Page Tech host and leaker Jon Prosser today shared several alleged details about Apple&#39;s rumored augmented reality glasses, including an &#34;Apple Glass&#34; marketing name, $499 starting price, prescription lens option, and more.\rThe marketing name will be &#34;Apple Glass&#34;\rThe glasses will start at $499 with the option for prescription lenses at an extra cost\rThere will be displays in both...\n Former Apple executive and iOS chief Scott Forstall made a rare public appearance this week at Code.org&#39;s virtual Code Break event, and in between classes, Forstall shared the intriguing story of how he was hired by Steve Jobs.\rForstall revealed that he had been considering working at Microsoft when he went to interview at NexT, the company started by Jobs after he had left Apple. Forstall...\n We&#39;re now just a few days away from Memorial Day on Monday, May 25, and numerous retailers have opened up discounts in celebration of the holiday. This includes sales on helpful Apple-related accessories like Anker&#39;s portable batteries, Beats headphones at eBay, Incase and Incipio&#39;s protective iPad and iPhone cases, Mophie&#39;s iPhone battery cases, JBL&#39;s Bluetooth speakers, and much more.\rNote:...", "posttime": "2020-05-27 07:32:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "app,apple,苹果,协助,assisting", "title": "苹果协助授权维修店支付COVID相关费用", "title_en": "Apple Assisting Authorized Repair Shops With COVID-Related Expenses", "transed": 1, "url": "https://www.macrumors.com/2020/05/25/apple-assisting-repair-shops-with-covid-expenses/", "via": "", "real_tags": ["app", "apple", "苹果", "协助", "assisting"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003865, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个设置的想法是保护小系统，就像我们保护大系统一样。\n此解决方案使用经过验证的堆栈来保护Web服务器免受现代威胁。使用OSSEC、Suricata和现代Linux系统的内置防火墙功能，可以构建维护成本低、性能影响相对较小的稳定威胁防护平台。\n它是专门设计成简单的。这个想法是，它会让你保持“需要知道的基础”，否则就会保持沉默，做好自己的工作。\n这些组件共同保护Web服务器免受黑客、机器人、垃圾邮件发送者和其他令人讨厌的网络攻击。\n然而，这个系统有一些实质性的限制。但事实并非如此：\n可能不会让您通过HIPAA/FIPS/PCI-DSS审核员-这将涉及更多。\n在这篇文章中，我将使用RFC-5737指定的公有IPv4地址。这些将代表使用的三台主机：\n这些IPv4地址是“假的”且不可路由。别用这些东西尝试任何奇怪的东西。\n由于通知的主要方式将是旧式电子邮件，所以这是最值得关注的地方。\n要发送监控电子邮件，我们需要将Mailgan设置为SMTP中继。这通过使用邮件中继的专用子域(Postfix服务器将连接到该子域)稍微简化了操作。它还可以防止服务器持有主电子邮件帐户的凭据。\nMailgan基本上是免费的，但它确实需要支付信息，以防止系统被滥用。\n设置帐户后，将验证域‘example.com’，并将所需的TXT和MX记录添加到DNS区域。我将在此项目中使用“mail.example.com”，我的主电子邮件服务器位于根“example.com”域下。\n设置完成后，向导将生成一组SMTP凭据。将这些保存到下一步。\n在服务器上，使用Postfix包设置邮件中继。这将允许服务器向管理邮箱发送电子邮件，但它将无法接收或读取其自身假脱机之外的任何邮箱。\nmyNetworks=127.0.0.0/8，[：：1]/128 inet_interface=127.0.0.1 relayhost=[smtp.mailgan.org]：587 smtp_sasl_auth_enable=yes smtp_sasl_password_map=hash：/etc/postfix/sasl_passwd smtp_sasl_security_options=no匿名SMTP_TLS_Cafile=/etc/ssl/certs/Thawte_Primary_Root_。DEFER_UNAUTH_Destination ALIAS_MAPES=hash：/etc/aliases alias_database=hash：/etc/aliases smtpd_tls_cert_file=/etc/ssl/certs/ssl-cert-snakeoil.pem smtpd_tls_key_file=/etc/ssl/private/ssl-cert-snakeoil.key smtpd_use_tls=yes。\n如果电子邮件在一两分钟内没有到达，请仔细检查配置并在系统日志中查找线索。\nSuricata是我一直以来最喜欢的安全监控工具之一。它速度快、可伸缩，使用的资源少得惊人，并且可以创建高质量的网络警报。我之前在另一个自定义防火墙/IDS设备的项目中使用过它。在此项目中，它将仅用于生成警报摘要。\n然后，可以在系统上安装软件包本身以及所有运行时依赖项。\n安装后，要进行的最重要的配置更改是禁用eve.json日志输出。虽然这在构建SIEM时非常有用，但我们正在做一些简单得多的工作，因此写入每个到达服务器的数据包的磁盘空间使用量不是一个好主意。\n则可以加载一组规则。在版本4和更高版本中，所有规则管理都是通过Suricata-update实用程序处理的。因此，可以下载并安装初始规则集(ET Open)。\nOSSEC是一个基于主机的入侵检测系统，在该领域有着良好的记录。虽然它具有很强的可扩展性，可以将数百个节点连接到一台中央服务器，但对于此部署，我们将安装单个独立系统。\nOSSEC的维护人员已经发布了一个易于安装的脚本。在设置APT存储库和密钥方面，它似乎工作得相当好。\n安装程序包和依赖项后，停止该服务，直到可以完全配置它。\nOSSEC的大多数配置部分对普通Linux用户是隐藏的，因此在本部分的其余部分中，我们必须以交互式root用户身份运行：\n主配置文件位于/var/ossec/etc/ossec.conf，结构为XML。第一个要更改的部分是“global”部分中的电子邮件通知设置。值得注意的是，ossec本身并不直接发送电子邮件，而是将其传递给localhost上的本地Postfix中继服务器。\n如果需要，您也可以将自己的IPv4地址列入白名单。如果您做了一些愚蠢的事情，这将防止被锁定在系统之外。\n接下来，根据需要修改电子邮件警报阈值。默认级别是“7”--这确实给出了很多关于完整性更改的有用的通知，虽然有点垃圾。如果这不是我们想要的，可以增加。在我的例子中，我更喜欢在我的云服务器上设置无人值守升级，这样它们就可以保持最新的安全补丁。这可能会产生许多不必要的电子邮件警报，这些警报非常烦人。与所有与安全相关的事情一样，也有权衡之处。\n主动响应是一个内置系统，它将采取行动阻止检测到的攻击。在基本的OSSEC安装中，它的配置是合理的-但是，一旦我们添加了网络警报，它就可以迅速开始阻止合法流量。因此，默认干预级别将从7增加到9。我还建议将“禁止时间”从默认的(30分钟)减少到5分钟，直到所有误报都能解决为止。\n&lt；！--活动响应配置--&gt；&lt；active-response&gt；&lt；command&gt；host-Deny&lt；/command&gt；&lt；location&gt；local&lt；/location&gt；level&gt；9&lt；/level&gt；&lt；timeout&gt；300&lt；/timeout&gt；&lt；/active-Response。/command&gt；&lt；location&gt；local&lt；/location&gt；&lt；level&gt；9&lt；/level&gt；&lt；timeout&gt；300&lt；/timeout&gt；&lt；/Active-Response&gt；\n最后，最重要的一块是指示OSSEC读取Suricata警报日志。这使监控系统能够全面了解操作系统行为和传入/传出网络活动。\n可以在启动后检查日志文件/var/ossec/logs/ossec.log中的错误。如果成功，应该会在启动后一分钟内发送一封电子邮件。\nOSSEC HID通知。2020 May 16 02：17：16接收者：my-Cool-server-&gt；ossec-monitor规则：502已触发(级别3)-&gt；&#34；Ossec服务器已启动。&#34；部分日志：ossec：ossec已启动。\n不添加自定义规则，OSSEC对网络IDS警报的理解相当基本，只在第一次触发“新的”Suricata/Snort警报时生成8级警报。幸运的是，我们可以添加一些规则来帮助理解Suricata输出。请记住，Suricata警报的范围从1到3，其中1是最严重的，而ossec警报的范围从0到15，15是最严重的。\n&lt；组名称=&#34；Snort-FAST，&#34；&gt；&lt；！--如果识别到1级威胁，则发出警报-&&gt；&lt；规则ID=&#34；300011&#34；级别=&#34；10&#34；&gt；类别&&gt;ID&lt；/类别&&gt;&lt；匹配&&gt;；[优先级：1]&lt；/匹配&/Description&gt；&lt；/规则&&gt;&lt；！--如果识别到多个1级威胁，则发出警报--&&gt;规则ID=&#34；300012&#34；规则ID=&#34；11&#34；频率=&#34；5&#34；时间范围=&#34；120&#34；忽略=&#34；90&#34；&gt；&lt；IF_MATCHED_SID&gT；300011&lt；/IF_MATCHED。SAME_SOURCE_IP/&&gt;&lt；描述&&gt;许多高严重性Suricata警报&lt；/描述&&gt;&lt；/规则&&gt;&lt；规则id=&#34；300013&#34；级别=&#34；12&#34；频率=&#34；10&#34；时间范围=&#34；120&#34；忽略=&#34；90&#34；&gt；&lt；IF_MATCHED。&lt；Same_Source_IP/&lt；说明&lt；几个严重程度很高的Suricata警报&lt；/说明&&gt;；/规则&&gt;规则id=&#34；300014&#34；级别=&#34；13&#34；频率=&#34；20&#34；时间范围=&#34；120&#34；忽略=&#34；90&#34；&gt；&lt。/IF_MATCHED_SID&&gt;&lt；Same_source_IP/&gt；&lt；description&gt；许多高严重性Suricata警报&lt；/Description&gt；&lt；/Rule&gt；&lt；规则ID=&#34；3000015&#34；Level=&#34；14&#34；频率=&#34；50&#34；TimeFrame=&#34；120&#34；忽略=&#34；90。300011&lt；/if_matching_sid&gt；&lt；Same_source_IP/&lt；&lt；description&gt；多个高严重性Suricata警报&lt；/description&gt；&lt；/RULE&&gt;；&lt；/GROUP&gt；\n&lt；组名称=&#34；Snort-FAST，&#34；&gt；&lt；！--如果识别到2级威胁，则发出警报-&&gt；&lt；规则ID=&#34；300001&#34；级别=&#34；7&#34；&gt；类别&&gt;ID&lt；/类别&&gt;&lt；匹配&&gt;；[优先级：2]&lt；/匹配&/Description&gt；&lt；/Rule&&gt;；&lt；！--如果识别到多个2级威胁，则发出警报--&&gt;规则ID=&#34；300002&#34；规则ID=&#34；8&#34；频率=&#34；5&#34；时间范围=&#34；120&#34；忽略=&#34；90&#34；&gt；&lt；IF_MATCHED_SID&gT；300001&lt；/IF_MATCHED。SAME_SOURCE_IP/&&gt;&lt；描述&&gt;许多中等严重程度的Suricata警报&lt；/描述&&gt;&lt；/规则&&gt;&lt；规则id=&#34；300003&#34；级别=&#34；9&#34；频率=&#34；10&#34；时间范围=&#34；120&#34；忽略=&#34；90&#34；&gt；&lt；IF_MATCHED。&lt；Same_Source_IP/&lt；说明&lt；几个中等严重程度的Suricata警报&lt；/说明&&gt;；/规则&&gt;规则id=&#34；300004&#34；级别=&#34；10&#34；频率=&#34；20&#34；时间范围=&#34；120&#34；忽略=&#34；90&#34；&gt；&lt。/IF_MATCHED_SID&&gt;&lt；Same_source_IP/&gt；&lt；Description&gt；许多中等严重程度的Suricata警报&lt；/Description&&gt;&lt；/Rule&gt；&lt；规则ID=&#34；300005&#34；Level=&#34；11&#34；Frequency=&#34；50&#34；Timeframe=&#34；120&#34；Ignore=&#34；90(忽略规则=&#34；&#34；级别=&#34；11&#34；频率=&#34；50&#34；时间范围=&#34；120&#34；忽略=&#34；90。300001&lt；/if_matching_sid&gt；&lt；Same_source_IP/&lt；&lt；description&gt；多个中度严重Suricata警报&lt；/Description&gt；&lt；/RULE&&gt;；&lt；/GROUP&gt；\n设置完成后，可以在系统上执行一些测试。最有可能创建警报的是简单地nmap系统：\n一两秒钟内，Suricata日志文件中将生成许多警报。然后，OSSEC将拾取这些内容并将其添加到警报假脱机。接下来，将对这些警报进行聚合和计数，这将触发严重程度更高的事件。理想情况下，这将生成如下电子邮件警报：\nOSSEC HIDS通知。2020-05-14 22：10：18接收来源：my-cool-server-&gt；/var/log/suricata/fast.logRule：300012已发射(11级)-&&gt;许多严重程度较高的Suricata警报&#34；SRCIP：192.0.2.241Dst IP：198.51.100.241：35004-&gt；198.51.100.241：35004-&gt；198.51.100.44：198.51.100.44：80.日志的部分：05/14/2020-22：10：17.391373[1：100.44：3]ET扫描可能的网络映射用户代理[**][**][分类：网络应用程序攻击][优先级：1]{tcp}192.0.2.241：192.51.100.241-&gt；198.51.100.44：80.。--通知结束。\n如果你幸运的话，这也会产生积极的反应。当这种情况发生时，OSSEC将向iptables添加防火墙阻止，以阻止与“违规”端点进行任何通信。\n在暴露在互联网上几天之后，很可能会有一两个机器人试图入侵你的服务器。因此，如果有一段时间，应该会有一两封这样的电子邮件：\nOSSEC HID通知。2020-05-17 20：16：34接收者：my-cool-server-&gt；/var/log/suricata/fast.logRule：300011已发射(10级)-&&34；Suricata Level 1警报&#34；源IP：192.0.2.241Dst IP：198.51.100.44日志的部分：05/17/2020-20：16：33.926136[**][1：2029790：3]ET SCAN ELF/MIRAI变体用户代理(入站)[**][分类：尝试的管理员权限获取][优先级：1]{tcp}192.0.2.241：47586-&gt；198.51.100.44：80--通知结束。\n由于它生成了高度严重的网络警报，因此立即阻止了入侵，并禁止了违规的IP。您可以在日志文件中找到以下内容：\n在所有部件都设置好之后，这就变成了一个维护成本相当低的系统。当然，也会发生IDS/IPS阻塞某些合法流量的事件。但这是现代安全领域生活的一部分。\n随着高调的黑客攻击和网络攻击越来越频繁，我们都有责任尽最大努力保护我们的服务器。\n由Disqus提供支持的评论", "note_en": "The idea of this setup is to protect the  Small Systems as well as we protect the  Big Systems.\n This solution uses a proven stack to protect webservers from modern threats. Using OSSEC, Suricata, and the built-in firewall capabilities of a modern Linux system it is possible to build a low maintenance and stable threat protection platform with relatively low performance impacts.\n It’s been specifically designed to be simple. The idea is that it will keep you on a ‘need to know basis’ and otherwise stay quiet and do it’s job.\n  Together, these components protect a web server from hacks, bots, spammers, and other nasty network attacks.\n    However, there are some substantial limitations of this system. Here’s what it’s not:\n Probably not going to get you past a HIPAA/FIPS/PCI-DSS auditor - that will be a lot more involved\n  Throughout this post, I will be using  RFC-5737 specified public IPv4 addresses. These will represent the three hosts used:\n  These IPv4 addresses are ‘fake’ and non-routable. Don’t try any weird stuff with these.\n  Since the primary means for notifications will be good-old-Email, that’s the staring place.\n  To send monitoring emails we’ll set up MailGun as an SMTP relay. This simplifies things slighly by using a dedicated subdomain for mail relay where the Postfix server will connect. It also prevents the server from holding credentials for the main email account.\n Mailgun is essentially free, but it does require payment information to prevent abuse of the system.\n Once the account is set up, the domain ‘example.com’ is verified, the required TXT and MX records are added to the DNS zone. I will be working with ‘mail.example.com’ for this project, and my primary email server lives under the root ‘example.com’ domain.\n After it’s set up, the wizard will produce a set of SMTP credentials. Save those for the next step.\n  On the server, a mail relay is set up using the Postfix package. This will let the server send emails to the admin mailbox, but it will not be able to receive any or read any mailboxes outside of its own spool.\n    mynetworks  =  127.0.0.0/8, [::1]/128 inet_interfaces  =  127.0.0.1 relayhost  =  [smtp.mailgun.org]:587 smtp_sasl_auth_enable  =  yes smtp_sasl_password_maps  =  hash:/etc/postfix/sasl_passwd smtp_sasl_security_options  =  noanonymous smtp_tls_CAfile  =  /etc/ssl/certs/thawte_Primary_Root_CA.pem smtp_use_tls  =  yes smtpd_relay_restrictions  =  permit_mynetworks, permit_sasl_authenticated, defer_unauth_destination alias_maps  =  hash:/etc/aliases alias_database  =  hash:/etc/aliases smtpd_tls_cert_file = /etc/ssl/certs/ssl-cert-snakeoil.pem smtpd_tls_key_file = /etc/ssl/private/ssl-cert-snakeoil.key smtpd_use_tls = yes\n             If the email doesn’t arrive within a minute or two, double check the config and look in the syslog for clues.\n  Suricata is one of my all time favourite tools for security monitoring. It’s fast, scalable, uses surprisingly few resources, and creates high quality network alerts. I’ve previously used it in another project for a custom  Firewall/IDS appliance. In this project, it will only be used to generate an alert feed.\n       Then the package itself, along with all the runtime dependancies, can be installed on the system.\n   Once installed, the most important config change to make is to disable the  eve.json log output. While this is very useful when building a SIEM, we’re working on something much simpler, so the disk space usage of writing every single packet that hits the server isn’t a great idea.\n       Then a set of rules can be loaded. With version 4 and higher, all rule management is handled through the  suricata-update utility. So, the initial set of rules (ET Open) can be downloaded and installed.\n    OSSEC is a host-based Intrusion Detection System with a proven track record in the field. While it is very scalable and can connect hundreds of nodes to a central server, for this deployment we will install a single standalone system.\n  The OSSEC mainainers have published an easy-install script. It seems to work fairly well for setting up the Apt repository and keys.\n      Once the package and dependancies are installed, stop the service until it can be fully configured.\n   Most of the configuration pieces for OSSEC are hidden from normal linux users, so for the rest of this seciton we’ll have to run as an interactive root user:\n  The main configuration file is located at  /var/ossec/etc/ossec.conf and is structured as XML. The first part to change is the email notification settings inside the ‘global’ section. The notable piece is that ossec itself is not sending email directly - instead, it’s handing it off to the local Postfix relay server on localhost.\n  If desired, you can whitelist your own IPv4 address as well. This will prevent being locked out of the system if you do  something dumb.\n  Next, modify the email alert threshold if desired. The default level is ‘7’ - Which does give a lot of useful albeit slightly spammy notifications about integrity changes. If this isn’t desired it can be increased. In my case, I prefer to set up unattended-upgrades on my cloud servers so that they stay up to date on security patches. This can generate lots of unnecessary email alerts that are just annoying. Like everything security related, there are tradeoffs.\n   Active-response is a built in system that will take action to block a detected attack. In a base OSSEC install it is configured reasonably - however once we add network alerts it can quickly start to block legitimate traffic. So, the default intervention level will be increased from 7 to 9. I also suggest decreasing the ‘ban time’ from the default (30 minutes) to 5 minutes until all the false-positives can be resolved.\n &lt;!--  Active Response Config  --&gt;  &lt;active-response &gt;  &lt;command &gt;host-deny &lt;/command&gt;  &lt;location &gt;local &lt;/location&gt;  &lt;level &gt;9 &lt;/level&gt;  &lt;timeout &gt;300 &lt;/timeout&gt;  &lt;/active-response&gt;  &lt;active-response &gt;  &lt;command &gt;firewall-drop &lt;/command&gt;  &lt;location &gt;local &lt;/location&gt;  &lt;level &gt;9 &lt;/level&gt;  &lt;timeout &gt;300 &lt;/timeout&gt;  &lt;/active-response&gt;\n   Finally, the most important piece of the puzzle is to direct OSSEC to read the Suricata alert log. This gives the monitoring system full visibility into both OS behaviour, and incoming/outgoing network activity.\n    The log file,  /var/ossec/logs/ossec.log can be checked for errors after startup. If it’s successful, there should be an email sent within a minute of startup.\n OSSEC HIDS Notification.2020 May 16 02:17:16Received From: my-cool-server-&gt;ossec-monitordRule: 502 fired (level 3) -&gt; &#34;Ossec server started.&#34;Portion of the log(s):ossec: Ossec started.\n   Without adding custom rules, OSSEC’s understanding of Network IDS alerts is fairly basic, only generating a level 8 alert the first time a ‘new’ Suricata/Snort alert is fired. Fortunately, we can add some rules to help make sense of the Suricata output. Remember, suricata alerts range from 1-3 with 1 being most severe, and ossec alerts range from 0-15 with 15 being most severe.\n    &lt;group  name= &#34;snort-fast,&#34; &gt;  &lt;!--  Alert if a level 1 threat is identified  --&gt;  &lt;rule  id= &#34;300011&#34;  level= &#34;10&#34; &gt;  &lt;category &gt;ids &lt;/category&gt;  &lt;match &gt;[Priority: 1] &lt;/match&gt;  &lt;description &gt;Suricata level 1 alert &lt;/description&gt;  &lt;/rule&gt;  &lt;!--  Alert if multiple level 1 threats are identified  --&gt;  &lt;rule  id= &#34;300012&#34;  level= &#34;11&#34;  frequency= &#34;5&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300011 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Many high-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt;  &lt;rule  id= &#34;300013&#34;  level= &#34;12&#34;  frequency= &#34;10&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300011 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Several high-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt;  &lt;rule  id= &#34;300014&#34;  level= &#34;13&#34;  frequency= &#34;20&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300011 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Numerous high-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt;  &lt;rule  id= &#34;3000015&#34;  level= &#34;14&#34;  frequency= &#34;50&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300011 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Multiple high-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt; &lt;/group&gt;\n  &lt;group  name= &#34;snort-fast,&#34; &gt;  &lt;!--  Alert if a level 2 threat is identified  --&gt;  &lt;rule  id= &#34;300001&#34;  level= &#34;7&#34; &gt;  &lt;category &gt;ids &lt;/category&gt;  &lt;match &gt;[Priority: 2] &lt;/match&gt;  &lt;description &gt;Suricata level 2 alert &lt;/description&gt;  &lt;/rule&gt;  &lt;!--  Alert if multiple level 2 threats are identified  --&gt;  &lt;rule  id= &#34;300002&#34;  level= &#34;8&#34;  frequency= &#34;5&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300001 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Many medium-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt;  &lt;rule  id= &#34;300003&#34;  level= &#34;9&#34;  frequency= &#34;10&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300001 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Several medium-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt;  &lt;rule  id= &#34;300004&#34;  level= &#34;10&#34;  frequency= &#34;20&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300001 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Numerous medium-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt;  &lt;rule  id= &#34;300005&#34;  level= &#34;11&#34;  frequency= &#34;50&#34;  timeframe= &#34;120&#34;  ignore= &#34;90&#34; &gt;  &lt;if_matched_sid &gt;300001 &lt;/if_matched_sid&gt;  &lt;same_source_ip  /&gt;  &lt;description &gt;Multiple medium-severity Suricata alerts &lt;/description&gt;  &lt;/rule&gt; &lt;/group&gt;\n     Once set up, a few tests can be performed on the system. The most likely to create an alert is to simply nmap the system:\n  Within a second or two there will be many alerts generated in the suricata log file. Then, OSSEC will pick these up and add them to the alerts spool. Next these alerts will be aggregated and counted which should trigger the higher-severity events. And, ideally this will generate an email alert like this one:\n OSSEC HIDS Notification.2020 May 14 22:10:18Received From: my-cool-server-&gt;/var/log/suricata/fast.logRule: 300012 fired (level 11) -&gt; &#34;Many high-severity Suricata alerts&#34;Src IP: 192.0.2.241Dst IP: 198.51.100.44Portion of the log(s):05/14/2020-22:10:17.391373 [**] [1:2024364:3] ET SCAN Possible Nmap User-Agent Observed [**] [Classification: Web Application Attack] [Priority: 1] {TCP} 192.0.2.241:35004 -&gt; 198.51.100.44:80.... --END OF NOTIFICATION\n If you’re lucky, this will also kick in an active response. When this happens, OSSEC will add a firewall block to IPTables preventing any communication with the ‘offending’ endpoint.\n  After a couple days of being exposed to the internet, it’s quite likely that one or two bots will try to hack your server. So, given some time there should be an email or two like this:\n OSSEC HIDS Notification.2020 May 17 20:16:34Received From: my-cool-server-&gt;/var/log/suricata/fast.logRule: 300011 fired (level 10) -&gt; &#34;Suricata level 1 alert&#34;Src IP: 192.0.2.241Dst IP: 198.51.100.44Portion of the log(s):05/17/2020-20:16:33.926136 [**] [1:2029790:3] ET SCAN ELF/Mirai Variant User-Agent (Inbound) [**] [Classification: Attempted Administrator Privilege Gain] [Priority: 1] {TCP} 192.0.2.241:47586 -&gt; 198.51.100.44:80 --END OF NOTIFICATION\n   Since it generated a high severity network alert, the intrusion was immediately blocked and the offending IP banned. You can find this in the log file:\n      After all the pieces are set up, this becomes a fairly low maintenance system. Of course, there will be incidents where the IDS/IPS blocks some legitimate traffic. But that’s part of life in the modern security landscape.\n With high profile hacks and cyberattacks more and more frequently, it’s all of our responsibility to do our best to secure our servers to the best of our abilities.\n     comments powered by  Disqus", "posttime": "2020-05-27 07:30:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务器,webserver,警报", "title": "使用OSSEC和Suricata入侵检测系统实现简单的Web服务器保护", "title_en": "Simple webserver protection with OSSEC and Suricata intrusion detection systems", "transed": 1, "url": "https://nbailey.ca/post/security-monitoring-ossec-suricata/", "via": "", "real_tags": ["服务器", "webserver", "警报"]}, {"category": "", "categoryclass": "", "imagename": "b15680be7ec8d7c6a60c4a9727890a73.jpg", "infoid": 1003862, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Jetson Xavier NX在小型机系统中为Edge带来超级计算机性能，还支持所有流行的AI框架。", "note_en": "Jetson Xavier NX Brings Supercomputer Performance to the Edge in a Small Form Factor System and  also Supports all Popular AI Frameworks.", "posttime": "2020-05-27 07:13:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xavier,ai", "title": "Jetson Xavier NX", "title_en": "Jetson Xavier NX", "transed": 1, "url": "https://www.nvidia.com/en-us/autonomous-machines/embedded-systems/jetson-xavier-nx/", "via": "", "real_tags": ["xavier", "ai"]}, {"category": "", "categoryclass": "", "imagename": "68c447bbe48129fd4e8d2b6de84c2fe0.png", "infoid": 1003861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国总统唐纳德·特朗普的一篇帖子首次被推特贴上了事实核查的标签。\n特朗普总统在推特上写道：#34；不可能(零！)。邮寄的选票不会有实质上的欺诈性。&#34；\n在过去的一周里，美国总统就邮寄选票的有效性发表了几项未经证实的声明。\n推特的通知在推文下面显示了一个蓝色感叹号，建议读者了解邮寄选票的情况。\n这家社交媒体公司曾承诺在其网站上增加虚假或误导性信息的警告标签，但它对美国总统采取行动的速度一直很慢。\n在此之前，推特决定不删除特朗普总统对2001年洛里·克劳苏蒂斯(Lori Klausutis)之死的评论。总统在推特上发布了几条信息，宣传一种阴谋论，即克劳苏蒂斯是被MSNBC主持人乔·斯卡伯勒谋杀的。\n该公司拒绝删除这些推文，但向克劳苏蒂斯表示，对总统声明造成的痛苦深表歉意。", "note_en": "A post by US President Donald Trump has been given a fact-check label by Twitter for the first time.\n President Trump  tweeted: &#34;There is NO WAY (ZERO!) that Mail-In Ballots will be anything less than substantially fraudulent.&#34;\n  The US president has made several unsubstantiated claims about the validity of mail-in ballots over the past week.\n Twitter&#39;s notification displays a blue exclamation mark underneath the tweets, suggesting readers &#34;get the facts about mail-in ballots&#34;.\n  The social media company had pledged to increase the warning labels under false or misleading information on its site but it has been slow to take steps against the US president.\n   The move comes on the heels of Twitters decision not to remove comment President Trump made about the death Lori Klausutis in 2001. The president has tweeted several messages promoting a conspiracy theory that Ms Klausutis was murdered by MSNBC host Joe Scarborough.\n  The company declined to take down those tweets but told Mr Klausutis it was &#34;deeply sorry&#34; about the pain caused by the president&#39;s statements.", "posttime": "2020-05-27 07:13:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,核查,tags,总统", "title": "推特标签特朗普的推文带有事实核查警告", "title_en": "Twitter tags Trump tweet with fact-checking warning", "transed": 1, "url": "https://www.bbc.com/news/technology-52815552", "via": "", "real_tags": ["推特", "核查", "tags", "总统"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Paseto是您喜欢Jose(JWT、JWE、JWS)的一切，没有任何困扰Jose标准的设计缺陷。\n不可能，何塞！为凡人设计密码功能过去三年的漏洞研究和密码分析对Jose互联网标准家族(通常称为JSON Web令牌，也称为JSON Web Tokens)并不友好。JWT)。这导致许多安全专家大胆宣布，不要使用JWT！但这让许多开发人员缺乏可行的替代方案。Scott更进一步，设计了一个更安全的替代方案：PASETO(平台无关的安全令牌)，目前用10种编程语言实现。", "note_en": "Paseto is everything you love about JOSE (JWT, JWE, JWS) without any of the  many design deficits that plague the JOSE standards.\n        No Way JOSE! Designing Cryptography Features for Mere Mortals    The past three years of vulnerability research and cryptanalysis has not been kind to the JOSE family of Internet standards (most commonly known as JSON Web Tokens a.k.a. JWT). This has led to many security experts declaring boldly, &#34;Don&#39;t use JWT!&#34; but has left many developers in want of a viable alternative. Scott went a step further and designed a safer alternative: PASETO (Platform-Agnostic SEcurity TOkens), which is currently implemented in 10 programming languages.", "posttime": "2020-05-27 06:57:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,jose", "title": "Paseto-Jose(JWT、JWE、JWS)，没有Jose标准中的许多设计缺陷", "title_en": "Paseto – JOSE (JWT, JWE, JWS) without the many design deficits in JOSE standards", "transed": 1, "url": "https://paseto.io/", "via": "", "real_tags": ["设计", "jose"]}, {"category": "", "categoryclass": "", "imagename": "a4e5c3589e38b0dc3e085b7c621dc308.jpeg", "infoid": 1003858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "至少有11家电视台播放了亚马逊公关团队编写和制作的相同片段。", "note_en": "At least 11 TV stations aired an identical segment written and produced by Amazon’s PR team.", "posttime": "2020-05-27 06:57:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,电台,news,团队", "title": "当地新闻电台运行由亚马逊编写和制作的宣传部分", "title_en": "Local News Stations Run Propaganda Segment Scripted and Produced by Amazon", "transed": 1, "url": "https://www.vice.com/en_us/article/4ayvwb/local-news-stations-run-propaganda-segments-scripted-and-produced-by-amazon", "via": "", "real_tags": ["amazon", "亚马逊", "电台", "news", "团队"]}, {"category": "", "categoryclass": "", "imagename": "379d408cd237b61c9d48a8b37bfacfa2.jpg", "infoid": 1003857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步(Uber)宣布了一项激进的行动计划，以缩减业务，因为在大流行停摆期间，优步的亏损激增。\n该公司表示，将再裁员3000人，使最近几周的裁员总数达到员工总数的四分之一。\n该公司还将关闭或整合40多个办事处，并逐步关闭其人工智能实验室等部门。\n首席执行官达拉·科斯罗沙希(Dara Khosrowshahi)在致员工的一封信中写道：我们必须将自己打造成一家自给自足的企业，不再依赖新资本或投资者来保持增长、扩张和创新。\n我们必须采取这些艰难的行动，才能站稳脚跟，确保我们的未来，继续我们的使命。\n甚至在疫情爆发之前，优步就在努力应对巨额亏损。但随着大流行期间活动的骤降，它面临的挑战成倍增加。\n上个月，在美国和加拿大封锁最严重的时候，优步的乘车次数下降了80%。与此同时，尽管优步Eats(Uber Eats)的外卖业务激增，但仍处于亏损状态。\n本月早些时候，优步(Uber)宣布将裁员3700人，并警告可能会进一步裁员。裁员不包括司机，优步认为司机是独立承包商。\n受影响的办事处包括旧金山和新加坡的中心，随着公司选择新的地区总部，这些中心将于明年开始关闭。\n优步表示，将重组剩余员工，并削减不属于其核心个人交通或送餐业务一部分的领域支出，包括AI实验室。\n优步的行动是病毒持续经济影响和控制努力的最新迹象。\n虽然一些地方已经开始放松限制，但许多公司-特别是旅游业的公司-警告称，公众对许多日常活动安全的信心需要时间才能恢复。\n优步规模较小的竞争对手Lyft也宣布大幅裁员，航空公司、酒店经营者和Airbnb等预订平台也宣布大幅裁员。\n考斯罗沙希表示：鉴于疫情的戏剧性影响，以及任何最终复苏的不可预测性，我们正将精力集中在我们的核心移动和交付平台上，并调整我们公司的规模，以符合我们业务的现实。", "note_en": "Uber has announced a drastic action plan to scale back its business as its losses balloon amid pandemic lockdowns.\n The firm said it would cut 3,000 more jobs, bringing the total reductions in recent weeks to a quarter of the workforce.\n It is also closing or consolidating more than 40 offices and winding down units such as its artificial intelligence lab.\n  &#34;We must establish ourselves as a self-sustaining enterprise that no longer relies on new capital or investors to keep growing, expanding and innovating,&#34; chief executive Dara Khosrowshahi wrote in a letter to staff.\n  &#34;We have to take these hard actions to stand strong on our own two feet, to secure our future and to continue on our mission.&#34;\n  Even before the pandemic, Uber was grappling with huge losses. But its challenges have multiplied as activity plunges during the pandemic.\n The number of Uber rides dropped 80% last month at the height of the lockdowns in the US and Canada. Meanwhile, although its Uber Eats food delivery business has surged, it remains loss-making.\n Earlier this month,  Uber announced it would cut 3,700 staff and  warned of possible additional reductions. The workforce cuts do not include drivers, whom Uber considers independent contractors.\n The affected offices include hubs in San Francisco and in Singapore, which will start closing over the next year as the firm selects a new regional headquarters.\n Uber said it would reorganise its remaining staff and cut back spending in areas that are not part of its core personal transport or food delivery businesses, including its AI Labs.\n   Uber&#39;s actions are the latest sign of the ongoing economic impact of the virus and efforts to control it.\n While some places have started to ease restrictions, many companies - especially those in the travel industry - have warned it will take time for public confidence in the safety of many everyday activities to be restored.\n Uber&#39;s smaller rival, Lyft, has also announced significant job cuts, as have airlines, hoteliers and booking platforms such as Airbnb.\n &#34;Given the dramatic impact of the pandemic, and the unpredictable nature of any eventual recovery, we are concentrating our efforts on our core mobility and delivery platforms and resizing our company to match the realities of our business,&#34; Mr Khosrowshahi said.", "posttime": "2020-05-27 06:41:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,关闭,close,优步", "title": "优步将关闭其人工智能实验室", "title_en": "Uber to close its AI labs", "transed": 1, "url": "https://www.bbc.com/news/business-52711649", "via": "", "real_tags": ["人工智能", "关闭", "close", "优步"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一直最喜欢的基于地图的数据可视化创建于1944年。哈罗德·菲斯克(Harold Fisk)与美国陆军工程公司合作，绘制了密西西比河的长度地图。他的视觉形象与其他人不同的是，他通过时间绘制了河流的地图，并设法以一种既美丽又令人惊讶的有效的方式做到了这一点。我想通过创建我自己的系统来程序地生成蜿蜒河流的地图来向他的系列地图致敬。\n密西西比河下游冲积河谷(pl。22，嘘。6，细节)，哈罗德·菲斯克，1944年。\n这个地图生成器系统是用胡迪尼创建的。该系统所需要的只是一条输入指南。这条线变成了河流，河流随着时间的推移而移动和演变，留下了它成长的视觉历史。这张地图是关于一个地方的，尽管是一个虚构的地方，所以需要有河流流经的地形。我生成了一个看似合理的随机地形，并用这条指引线切割出一个山谷，因为山谷控制着河流的流量：平坦平原上的慢河蜿蜒曲折，陡峭地形上的快速河流则不会。\n当河流流经地貌时，它不断侵蚀河床上的物质，并将其沉积在下游。这一过程不断重塑河流的流向，造成蜿蜒的弯道。浏览地球的卫星图像，很容易找到河流蜿蜒的例子。下面是几个示例，它们将告诉我们使用自定义代码重新创建地质过程的尝试。\n这个系统的基本动态很容易理解：河流吸收物质并将其沉积在下游，河流侵蚀曲线的外岸，在那里水流速度较快，并沉积在水流速度较慢的内岸，河流可以切断弯道，以利于形成一条更直的路径，形成被称为牛弓湖的孤立部分。\n要用代码模拟这个过程，我们可以忽略侵蚀和沉积，只考虑平面上的一条曲线。曲线上的每个点都有一个由三个向量表示的坐标框：法线、切线和双切线。由于我们处理的是平面现象(现在忽略高程的变化)，我们可以忽略法向量(在我们的例子中，法线只是垂直指向)，而只利用切线和双切向量。直线和双切线方向上的切点与切线成直角。\n需要注意的一件事是，双切向量不足以使我们的曲线弯曲。派生的双切线通常指向直线的同一侧，而我们需要我们的双切线才能知道这条线是朝哪个方向弯曲的。它应该始终指向曲线的外部，其长度应该与该点的线曲率成比例。\n使用切线和修改后的双切线，我们创建了一个混合了两者的新矢量。此新矢量将添加到曲线上每个点的位置。有了这个基本逻辑，河流中的弯道就有机地形成了。可以通过分别调整这两个向量的总体影响来影响折弯的样式，并可以通过增加最终混合向量的比例来调整折弯的强度。\n切线(蓝色)和修改的双切线(红色)在左侧重叠，新的混合方向矢量(紫色)在右侧重叠。\n如果您正在阅读这篇文章，那是因为您的浏览器不支持HTML5视频元素。\n当河流弯回自身时，曲折就会被切断，取而代之的是一条更短的路径。这一过程形成了牛弓湖，这些湖通常是位于主要河流两侧的新月形水体。为了在我们的河流中发现潜在的牛弓，我们会做距离检查，看看这条河是否有重叠的危险。如果发现接近碰撞，则会隔离两个碰撞点之间的曲线部分，并将其转换为自己的曲线段。这些新生成的湖泊表现出的唯一行为是，它们会随着时间的推移变得越来越小，直到它们从系统中被删除。(目前的系统不允许河流与牛弓湖重新相交，因此增加了一个额外的步骤，以确保湖泊删除自身有可能与河流重叠的部分。)。\n背景网格化绘图是通过在主河样条线上散布一些点和在背景平面上散布一些附加点来创建的。Voronoi断裂用于将背景平面转换为具有不规则边缘的较小多边形。然后，每个多边形被分解成不均匀的栅格。这些新多边形中的每一个都被迭代细分循环进一步拆分，该循环创建伪随机大小的曲线图。最后，从河流几何图形创建的有机形状用于沿海岸创建边界地块。计算最终多边形集的中心点，该中心点成为Plot ID Number文本图层的位置。\n公路网并不是从公路网开始的。最初的算法是试图创造一种有机的增长模式。系统从一些随机放置的点开始。每个点都有一个方向生长矢量。该点沿此增长矢量移动，并在移动时绘制一条线。如果该点遇到另一条线，它将停止。随着点的移动，方向矢量会缓慢旋转。我发现如果我把弯曲的向量和非弯曲的向量混合起来，结果就像相交的道路。我通过使线条的粗细与其长度成正比来强调这一结果。\n我创建的第一张地图图像缺乏地方感。没有任何一个地方的名字，这似乎是一个错失了做一些引人注目的事情的机会。我考虑过随机生成的无意义字符串或手动命名地点，但这两种选择似乎都不是一个很好的可伸缩解决方案。\n我和安德鲁·贝尔讨论了这个问题，他发现了一个美国地质勘探局的地理地名数据库(GNIS数据)。然后，他编写了一个python脚本来解析内容并去掉后缀(比如&#34；Lake&#34；或&#34；Summit&34；)，以生成用于我的特写的适当名称列表。我不想用已经存在的地方来命名地物，所以剪掉后缀有助于降低重现哈德逊河的可能性。取而代之的是，随机添加了新的后缀，以产生像哈德逊峰会(Hudson Summit)或哈德逊沼泽(Hudson Swamp)这样的特色名称。此外，他删除了重复的条目以及过长的名称(小西叉西支羽河出现在其中一张生成的地图上)。\n被隔离命名的地物包括主要河流、湖泊、岛屿、山峰、盆地和沼泽地。河流、湖泊和岛屿足够容易，因为这些特征是从河流系统本身的创造中出现的。通过对地形坡度的分析，将山峰和盆地分离出来。发现了平坦的部分，如果这些单位接近水位，就被认为是一个盆地。如果公寓位于高海拔，就被指定为山峰。沼泽地稍微更具挑战性。低坡度的区域被隔离并转变为轴对齐的边界框，其中心成为标签的位置。这个项目的未来迭代将找到以更像地图的方式布置文本的方法，文本沿着像山脊和细小的湖泊这样的特征流动。\n我想实现一些功能，这需要修改曲折的逻辑本身。目前的系统并不像我希望的那样健壮。我正在考虑从基于样条线的方法转向基于粒子的方法，这可能会使分支河成为可能，也可能使自然湖泊的形成成为可能。这种基于粒子的方法还可以使河流三角洲成为可能，并允许河流与现有的牛弯重新相交。\n我还想致力于使道路系统成为一种迭代的方法。第一个通道将铺设主要的高速公路，第二个通道将在第一个通道外建造次要道路，等等。我还需要研究道路应该如何避免沿着陡峭的斜坡生长的逻辑。", "note_en": "My all-time favorite map-based data visualization was created in 1944. Harold Fisk, working with the US Army Corp. of Engineers,  mapped the length of the Mississippi River. What sets his visualization apart from others is that he maps the river through  time, and manages to do so in a way that is both beautiful and surprisingly effective. I want to pay homage to his series of maps by creating my own system for procedurally generating maps of meandering rivers.\n  The Alluvial Valley of the Lower Mississippi River (pl. 22, sh. 6, detail), Harold Fisk, 1944\n    This map generator system was created with Houdini. All the system requires is an input guide line. The line becomes the river and the river moves and evolves over time and leaves behind a visual history of its growth. The map is of a place, albeit a fictional place, so there needs to be terrain on which the river flows. I generate a plausible randomized terrain and use the guide line to cut away a valley. The valley controls the flow of the river: slow rivers on flat plains meander, fast rivers on steep terrain do not.\n    As a river moves through the landscape, it is constantly eroding material from the river bed and depositing it downstream. This process continually reshapes the flow of the river causing it to create snaking bends. Browsing through satellite images of the Earth, it is easy to find examples of river meandering. Below are a few examples that will inform our attempts to recreate the geological process with custom code.\n    The underlying dynamics of this system are easy enough to understand: rivers pick up material and deposit it downstream, rivers erode the outer bank of a curve where the water speed is higher and deposit on the inner bank where the water speed is slower, and rivers can cut off meanders in favor of a straighter path which forms isolated sections called oxbow lakes.\n To simulate this process with code, we can ignore erosion and deposition and just think of a curved line on a plane. Each point on the curve has a coordinate frame which is represented by three vectors: normal, tangent, and bitangent. Since we are dealing with a planar phenominon (ignoring changes in elevation for now), we can disregard the normal vector (in our case, the normal just points straight up) and just make use of the tangent and bitangent vectors. The tangent points in the direction of the line and the bitangent is at a right angle to the tangent.\n One thing to note, the bitangent vector isn&#39;t enough to make our curve meander. A derived bitangent generally points to the same side of the line, whereas we need our bitangent to be aware of which way the line is curved. It should always point to the outside of the curve and its length should be proportional to the curvature of the line at that point.\n      Using the tangent and modified bitangent, we create a new vector that is a blend of the two. This new vector is added to the position of each point on the curve. With this basic logic, the bends in the river form organically. The style of the bends can be influenced by adjusting the overall influence of these two vectors individually, and the intensity of the bends can be adjusted by increasing the scale of the final blended vector.\n  Tangents (blue) and modified bitangents (red) overlapped on left, new blended directional vector (purple) on right\n    If you are reading this, it is because your browser does not support the HTML5 video element.\n  When a river bends back into itself, the meander bend gets cut off in favor of a shorter path. This process creates oxbow lakes which are generally crescent shaped bodies of water to the sides of the main river flow. To find potential oxbows in our river, we do distance checks to see if the river is in danger of overlapping itself. If a near collision is found, the part of the curve between the two collision points is isolated and turned into its own curve segment. The only behavior that these newly generated lakes exhibit is that they get smaller over time until they are deleted from the system.  (The current system doesn&#39;t allow for the river to reintersect the oxbow lakes, so an extra step is added to ensure that the lake deletes parts of itself that are at risk of being overlapped by the river.)\n            The background grid-based plots were created by scattering some points on the main river spline and some additional points on the background plane. Voronoi Fracture is used to turn the background plane into smaller polygons with irregular edges. Each polygon is then broken up into a non-uniform grid. Each of those new polygons is broken up further with an iterated subdivision loop which creates plots of pseudo-random sizes. Finally, an organic shape created from the river geometry is used to create boundary plots along the shore. The center point of the final set of polygons is calculated which becomes the location of the plot id number text layer.\n              The network of roads didn&#39;t begin as a network of roads. The initial algorithm was an attempt to create an organic growth pattern. The system begins with some randomly placed points. Each point is given a directional growth vector. The point moves along this growth vector and draws a line as it goes. If the point encounters another line, it stops. As the point moves, the directional vector rotates slowly. I found that if I mix curving vectors with non-curving vectors, the result ended up resembling intersecting roads. I emphasized this result by making the thickness of the lines be directly proportional its length.\n      The first map images that I created lacked a sense of place. There were no names for any of the places which seemed like a missed opportunity to do something compelling. I considered randomly generated nonsense strings, or manually naming places, but neither of these options seemed like a good scalable solution.\n I discussed the problem with  Andrew Bell and he found a USGS database ( GNIS data) of geographic place names. He then wrote a python script to parse the content and crop off the suffix (things like &#34;Lake&#34; or &#34;Summit&#34;) to produce a list of proper names to use for my features. I did not want to name features after places that already exist so cropping off the suffix helps to reduce the likelihood of recreating something called &#34;Hudson River&#34;. Instead, new suffixes were randomly added to produce feature names like &#34;Hudson Summit&#34; or &#34;Hudson Swamp&#34;. Additionally, he pulled out duplicate entries as well as excessively long names (  Little West Fork West Branch Feather River showed up in one of the generated maps).\n The features that were isolated for naming include the main river, lakes, islands, peaks, basins, and marshland. The river, lakes, and islands were easy enough since those features are present from the creation of the river system itself. The peaks and basins were isolated by analyzing the slope of the terrain. Flat sections were found and if those flats were near the water level, it was considered a basin. If the flat was at a high elevation, it was designated as a peak. The marshland was slightly more challenging. Areas with low slope were isolated and turned into axis-aligned bounding boxes whose center became the location for the label. Future iterations of this project will find ways to lay the text out in a more map-like manner with text flowing along features like ridges and thin lakes.\n          There are some features that I would like to implement which would require a rework of the meandering logic itself. The current system is not as robust as I would like it to be. I&#39;m considering moving from a spline-based approach to a particle-based one which might make branching rivers possible as well as natural lake formation. The particle based approach could also make river deltas possible as well as allowing rivers to re-intersect existing oxbows.\n I would also like to work on making the road system an iterative approach. The first pass would lay out the major highways, the second pass would build secondary roads off the first pass, etc. I also need to work on the logic for how roads should avoid growing up steep slopes.", "posttime": "2020-05-27 06:41:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "河流,maps", "title": "曲折：从来不存在的河流地图", "title_en": "Meander: Maps of rivers that never existed", "transed": 1, "url": "http://roberthodgin.com/project/meander", "via": "", "real_tags": ["河流", "maps"]}, {"category": "", "categoryclass": "", "imagename": "80f7d5a82b427f9b94efb32151e90764.png", "infoid": 1003855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Stormkit与您的GIT流完美集成。它可以无缝构建、部署和扩展您的javascript应用程序。\n您的提交已在Stormkit上成功构建。您可以单击以下链接进行预览。\n您的提交已在Stormkit上成功构建。您可以单击以下链接进行预览。\n喜欢用户体验和内置的Nuxt.js支持。到目前为止很棒的经验，保持好的工作！\n在Stormkit之前，我们管理自己的Docker工作流。在迁移之后，我们每年节省数百个小时。\n我印象深刻的是，我们使用Stormkit使我们的自定义安装工作变得如此简单，并改善了我们的开发人员体验。做得好!。\n您可以构建、部署和发布所有这些技术以及更多-我们的系统旨在支持任何Node.js或JAMStack应用程序。\nNavigesNext在Javascript应用程序的整个生命周期中简化和自动化复杂的流程。\n为什么？我们认为开发者应该能够专注于用户问题，而不是管理工具、服务和基础设施。\n什么？我们使您的工作基础设施自动化，并提供包含最先进的最佳实践和功能的套件。", "note_en": "Stormkit integrates perfectly with your git flow.   It builds, deploys and scales your javascript apps seamlessly.\n  Your commit has been built succesfully on   Stormkit. You can click the following link to preview it.\n  Your commit has been built succesfully on   Stormkit. You can click the following link to preview it.\n  Loved the user experience and built-in Nuxt.js support. Great experience so far, keep up the good work!\n Prior to Stormkit we were managing our own Docker workflow. We have saved hundreds of hours per year after the migration.\n I&#39;m impressed how easy we made our custom setup work with Stormkit and improved our developer experience. Good job!\n  You can build, deploy and publish all these technologies and more - our system is designed to support any Node.js or JAMStack application.\n  navigate_next  Simplify and automate complex processes over the entire life cycle of a Javascript application.\n  Why?   We believe that developers should be able to focus on user problems instead of managing tools, services and infrastructure.\n  What? We automate your work infrastructure and provide a kit that includes state of the art best practices and features.", "posttime": "2020-05-27 06:40:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "花费,access", "title": "无需花费数小时即可轻松访问前端的AWS基础设施", "title_en": "Getting easy access to AWS infrastructure for frontends without spending hours", "transed": 1, "url": "https://stormkit.io", "via": "", "real_tags": ["花费", "access"]}, {"category": "", "categoryclass": "", "imagename": "e46a49402fba87f8a5133c3aa2bd0a6a.jpg", "infoid": 1003854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，Twitter首次在特朗普总统的推文上贴上了事实核查的标签，以回应长期以来的批评，即该公司在监管世界领导人的错误信息和虚假信息方面过于放手。\n这一举动在大选年升级了华盛顿和硅谷之间的紧张局势，是对特朗普在过去24小时内的两条推文的回应。这些推文错误地声称邮寄选票是欺诈性的。推特的标签说，“获取邮寄选票的事实”，并将用户重定向到有关特朗普未经证实的说法的新闻文章。\n没有办法(零！)。邮寄的选票将不会有实质性的欺诈性。邮箱将被抢劫，选票将被伪造&amp；甚至非法打印出来&amp；伪造签名。加州州长正在向数以百万计的人发送选票，任何人……。\n-唐纳德·J·特朗普(@realDonaldTrump)2020年5月26日。\nTwitter发言人凯蒂·罗斯伯勒(Katie Rosborough)表示，这些推文“包含关于投票过程的潜在误导性信息，已被贴上标签，以提供有关邮寄选票的额外上下文。”\n.生活在该州，无论他们是谁，也不管他们是如何到达那里的，都会得到一份。随后，专业人士将告诉所有这些人，他们中的许多人以前从未想过投票，如何投票，以及投票给谁。这将是一场被操纵的选举。不行!。\n-唐纳德·J·特朗普(@realDonaldTrump)2020年5月26日。\n推特的行动发生在推特因特朗普的另一组推文而面临接二连三的批评的一天。周二早些时候，乔·斯卡伯勒(Joe Scarborough)的一名前员工的丈夫要求Twitter首席执行官杰克·多尔西(Jack Dorsey)删除特朗普总统的推文，进一步助长了关于这名员工妻子死亡的毫无根据的阴谋论。\n在其14年的历史中，Twitter允许世界领导人和普通公民的错误信息几乎不受控制地传播。其领导人长期以来一直表示，该平台的用户将在该平台上进行辩论，并自行纠正虚假信息。\n相比之下，其规模大得多的竞争对手Facebook在几年前推出了一项事实核查计划。Facebook资助了一支第三方事实核查人员大军来调查内容，然后这些内容会在网站上贴上标签，并在其覆盖范围内降级。\nTwitter拥有约3.3亿用户，而Facebook的用户为26亿，Twitter没有资源或机构意愿来吸引事实核查人员。\n但推特在大流行期间彻底改变了做法。今年3月，该公司修改了服务条款，表示将删除任何人的帖子，即使是世界领导人的帖子，如果这些帖子“违反了全球和公共卫生信息权威来源的指导”。例如，这包括声称社交距离无效或精油可以用来治疗疾病的评论。\n不久之后，Twitter首次将这一政策应用于世界各国领导人，删除了巴西总统贾尔·博尔索纳罗(Jair Bolsonaro)和威尼祖兰总统尼古拉斯·马杜罗(Nicolas Maduro)的推文，认为关于打破社会疏远秩序和兜售虚假治疗的推文具有如此大的潜在危害，给它们贴上标签是不够的。\n然后在本月早些时候，Twitter推出了一项新政策，称将对与Covid相关的错误信息贴上标签或提供警告信息，即使这些信息不是卫生当局的直接矛盾，也没有直接违反公司的政策。该公司当时表示，可能会将标签扩展到其他问题领域，例如其他类型的健康相关恶作剧或其他有伤害风险的情况。周二关于选举的推文代表着向与选举相关的错误信息的新领域扩张。", "note_en": "Twitter on Tuesday slapped a fact-check label on President Trump’s tweets for the first time, a response to long-standing criticism that the company is too hands-off when it comes to policing misinformation and falsehoods from world leaders.\n The move, which escalates tensions between Washington and Silicon Valley in an election year, was made in response to two Trump tweets over the past 24 hours. The tweets falsely claimed that mail-in ballots are fraudulent. Twitter’s label says, “Get the facts about mail-in ballots,” and redirects users to news articles about Trump’s unsubstantiated claim.\n There is NO WAY (ZERO!) that Mail-In Ballots will be anything less than substantially fraudulent. Mail boxes will be robbed, ballots will be forged &amp; even illegally printed out &amp; fraudulently signed. The Governor of California is sending Ballots to millions of people, anyone.....\n— Donald J. Trump (@realDonaldTrump)  May 26, 2020\n The tweets, said Twitter spokesperson Katie Rosborough, “contain potentially misleading information about voting processes and have been labeled to provide additional context around mail-in ballots.”\n  ....living in the state, no matter who they are or how they got there, will get one. That will be followed up with professionals telling all of these people, many of whom have never even thought of voting before, how, and for whom, to vote. This will be a Rigged Election. No way!\n— Donald J. Trump (@realDonaldTrump)  May 26, 2020\n Twitter’s actions come on a day when Twitter was facing a barrage of criticism over another set of Trump tweets. Earlier on Tuesday the widower of a former staffer to Joe Scarborough asked Twitter chief executive officer Jack Dorsey to delete tweets by President Trump furthering a baseless conspiracy theory about the staffer’s wife’s death.\n   For its 14-year existence, Twitter has allowed misinformation by world leaders and everyday citizens to spread virtually unchecked. Its leaders have long said that the platform’s users would engage in debate on the platform and correct false information on their own.\n Its much larger rival Facebook, by contrast, launched a fact-checking program several years ago. Facebook funds an army of third-party fact checkers to investigate content, which then gets labeled on the site and demoted in its reach.\n   Twitter, which has roughly 330 million users compared to Facebook’s 2.6 billion, has not had the resources or the institutional will to engage fact-checkers.\n But Twitter has radically changed its approach during the pandemic. In March, the company revised its terms of service to say that it would remove posts by anyone, even world leaders, if such posts went “against guidance from authoritative sources of global and public health information.&#34; That includes comments claiming that social distancing is ineffective or essential oils can be used to cure the disease, for example.\n  Soon after, for the first time, Twitter applied the policy to world leaders, removing tweets by Brazilian president Jair Bolsonaro and Venezulan President Nicolas Maduro, arguing that the tweets about breaking social distancing orders and touting false cures had such potential for harm that labeling them would be insufficient.\n  Then earlier this month, Twitter rolled out a new policy saying that it would label or provide warning messages about covid-related misinformation, even when that information is not a direct contradiction of health authorities and does not directly violate the company’s policies. The company said at the time that it may expand the labels to other issue areas, such as other types of health-related hoaxes or other situations where there is a risk of harm. Tuesday’s tweets on elections represent an expansion into a new area of election-related misinformation.", "posttime": "2020-05-27 06:39:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,核查,labels,推文", "title": "推特首次将特朗普的推文贴上事实核查的标签", "title_en": "Twitter labels Trump’s tweets with a fact-check for the first time", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/05/26/trump-twitter-label-fact-check/", "via": "", "real_tags": ["推特", "核查", "labels", "推文"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google Cloud Platform或GCP在过去两年多的时间里提升了其他云服务提供商的标准。由于GCP的参与增加，原本看起来像AWS和Azure之间的两匹马比赛的情况现在发生了变化。直到最近，随着GCP决定积极推进产品和服务，CXO一直有一个二元选择-导致了第三个选择。他们面临的第一个问题是-GCP的优势是什么？为什么会选择GCP而不是AWS或Azure？\n值得注意的是，为什么AWS over Azure或Azure over AWS只是几年前的起点。一家企业刚刚通过了这两项中的一项。\n有了云计算，企业可以满足今天的需求，并通过利用尖端和创新的产品、动态定价模式、X-as-a-a-service模式和更高的敏捷性，奠定基础，使其能够在未来的竞争中超越竞争对手。\n虽然这些都是云供应商的共同优势，但GCP在几个大的类别中将自己与其他供应商区分开来，我们将在这篇文章中详细介绍每一个。\n如果你看一看广阔的大数据/Hadoop市场，你会看到一系列的术语、工具、框架-Map/Reduce、HBase、Apache Drill、Parquet格式等等，不胜枚举。还有其他开源项目，如HTTP/2、GRPC、Protocol Buffers；机器学习产品，如TensorFlow，包含Kubernetes等管理解决方案，Anthos等混合云解决方案，甚至SRE等流程和实践--所有这些不同的工具/框架都有一个共同点--Google及其开源贡献。\n使用Google-GCP，您在竞争之前获得尖端和创新产品的机会要高得多。\n使用GCP，您可以使用计算和内存的任意组合，同时使用快速磁盘和任何实例进行联网。您需要使用网络优化实例，并发现生产中的CPU和/或RAM短缺。实例选择更简单，不会根据计算、内存、存储和网络进行细分。用户可以完全灵活地更改实例的四个功能中的任何一个-自定义RAM和CPU组合以及可配置的IPO、磁盘大小、带宽和网络。\n谷歌使用自己的光纤网络，提供超低延迟，也被第三方广泛记录。它还使用全球SDN(软件定义网络)，该网络专门为微服务和大数据工作负载提供了令人难以置信的性能。\n这个专用网络意味着-企业工作量在专用高速公路上旅行，完全绕过拥堵的互联网车道。\n没有其他供应商投资和创新产品，使企业客户可以选择避免供应商锁定。\n使用Kubernetes，它允许以与机器/操作系统/供应商无关的方式编写和管理应用程序。\n同时，通过Anthos，它允许这些应用程序在任何云平台上运行。\n根据Gartner的说法，未来是混合的，似乎只有GCP才能使其成为可能。\n这也与创新息息相关。如果2005-2014年是一个大数据时代，那么2015-2024年无疑将是一个云计算时代-在那里它将被广泛采用。未来将是一个机器学习和人工智能的时代，在这个时代，它的使用将成为商品，它将很容易使用，每个企业-无论大小-都将拥有某种形式的ML/AI。\nGCP也将在未来实现这一目标。有了TensorFlow，它使ML成为了一个任何人都可以插入的框架/工具。\nGCP的价格竞争战略是为持续使用、定制使用和承诺使用自动提供折扣。\nGCP的可抢占虚拟机或Spot实例在标价的基础上有80%的固定折扣。没有现货市场需要处理。这一固定价格使企业能够始终如一地预测成本。\n虽然没有关于哪家云提供商提供更多服务和工具的争论，但有一个问题是关于哪家提供商提供了不同的、根据全球规模量身定做的工具和服务。\nGCP提供了一个其他提供商没有的工具--它不是Kubernetes和Anthos。是扳手。它兼具-SQL和非-SQL的优点；它具有全球规模和强大的一致性保证。\n云计算不是要不要的问题，而是何时的问题。这个问题的答案是，什么时候会定义一家公司-它会成就一家企业，也会毁掉一家企业。它不再是一个成本中心，它是让企业在竞争中奋进的推动者。云支持企业的快速变化，没有人能比谷歌更好地处理快速变化。\n企业未来的与众不同之处将是他们实现目标的速度和灵活性-云实现了这一点，而谷歌云通过尖端技术和创新增强了这一点。", "note_en": "Google Cloud Platform or  GCP has raised the bar for other cloud service providers since last 2 odd years. What was increasing looking like a two horse race between AWS and Azure, has now changed due to increased participation from GCP. A CxO had a binary choice until very recently, with GCP deciding to aggressively move forward on products and services - has led to a 3rd alternative. And the first question they face is -  What are the advantages of GCP?  Why would one choose GCP over AWS or Azure?\n It is important to note that Why AWS over Azure or Azure over AWS was the starting point only few years ago. An enterprise just went ahead with one of the two.\n  With Cloud computing, an enterprise could meet today’s demand and lay a foundation that allows it to leapfrog ahead of competition in future by utilising  cutting edge and innovative products,  dynamic pricing models,  X-as-a-service model and  increased agility.\n While these are common benefits across a cloud vendor, GCP has set itself apart from others in few broad categories and we will examine each in a bit of detail in this post.\n    If you take a look at the broad Big Data/Hadoop market, you would see a range of jargons, tools, frameworks -  Map/Reduce, HBase, Apache Drill, Parquet Format and so on, the list goes on and on. Then you have other open source initiatives like  HTTP/2, gRPC, Protocol Buffers; machine learning products like  Tensorflow, contain management solutions like  Kubernetes, Hybrid cloud solution like  Anthos, even processes and practices like  SRE - all these diverse tools/frameworks has one thing in common - Google and its open source contributions.\n Your chances of getting a cutting edge and innovative product before the competition is much higher with Google - GCP.\n  With GCP, one could got with any combination of compute and memory while the fast disks and networking with any instance. One need to go with a &#34;Network Optimised Instance&#34; and discover CPU and/or RAM shortages in production.  Instance choices are simpler and not segmented based on Compute, Memory, Storage and Networking. A user has full flexibility to change any one of the four features of an instance -  Custom RAM and CPU combination with configurable IPOS, disk size, bandwidth and networking.\n   Google uses its own fiberoptic network with provides ultra low latency and has been widely documented by 3rd parties as well. It also uses a global SDN (Software Defined Network) which offers incredible performance specially for Microservices and big data work loads.\n This private network means - an enterprises workload travel on a dedicated superhighway bypassing the congested internet lanes altogether.\n  No other provider is investing and innovating in products that gives an enterprise customer option to avoid vendor lock-in.\n With  Kubernetes, it allows applications to be written and managed in a machine/os/vendor agnostic way.\n At the same time, with  Anthos, it allows those application to be run in any cloud platform.\n As per Gartner, the future is hybrid and only GCP seems to be making it possible.\n  This ties into Innovation as well. If 2005-2014 was an era of Big Data, there is no doubt that 2015-2024 would be an era of Cloud Computing - where it would be adopted widely. The future would be an era of Machine learning and AI where its usage would become commodity, it would be easy to use and every enterprise - big and small - would have some form of ML/AI.\n GCP stands to deliver on that future as well. With Tensorflow, it has made ML a framework/tool that any one could plug into.\n    GCP&#39;s strategy for competing on price is to offer discounts for sustained use, for customised use, and for committed use  automatically.\n GCP&#39;s  Preemptible VMs or Spot Instances are a fixed flat 80% off of list price. There is no spot market to deal with. This fixed price allows an enterprise to project costs consistently.\n  While there is no debate around which cloud provider gives more services and tools - there is a question around which provider gives tools and services that are different and are tailored to global scale.\n GCP provides one such tool that no other provider has -- it is not Kubernetes and Anthos. It is  Spanner. It is best of both - SQL and No-SQL worlds; it has global scale and strong consistency guarantees.\n  Cloud computing is not a question of if but when. And the answer to that when would define a company - it would make or break an enterprise. IT is no longer a cost centre, it is an enabler that allows enterprises to forge ahead of competition. Cloud enables rapid changes in enterprises and no one had been able to handle rapid changes better than google.\n The differentiator going forward for enterprises is going to be the speed and agility with which they can achieve a goal - cloud enables that and google cloud augments that with cutting edge technology and innovation.", "posttime": "2020-05-27 06:39:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "选择,gcp", "title": "为什么会选择GCP而不是其他云提供商？", "title_en": "Why would one choose GCP over other cloud providers?", "transed": 1, "url": "http://www.xmsxmx.com/gcp-advantages-benefits-over-aws-azure/", "via": "", "real_tags": ["选择", "gcp"]}, {"category": "", "categoryclass": "", "imagename": "318035ae0a295cb5a3516b0d5a8bd887.jpg", "infoid": 1003851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一系列推文中出现了一个新的警告标签，鼓励推特用户“了解邮寄选票的事实”。在这些推文中，总统毫无根据地声称，通过邮寄投票方式收到的选票是“欺诈性的”。\n在给TechCrunch的一份声明中，Twitter的一位发言人表示，总统的两条推文“包含关于投票过程的潜在误导性信息，已被贴上标签，以提供有关邮寄选票的额外背景信息。”\n“这一决定与我们本月早些时候分享的方法是一致的，”这位发言人说，并链接到该公司最近发布的关于其错误信息政策的博客文章。\n点击推特的新提示，用户会进入一个事实核查页面，突出显示CNN的一篇报道，揭穿了总统的虚假说法。该页面还提供了一个摘要，其中的要点为误导性的推文提供了有用的背景，包括邮寄投票已经在全国广泛使用的事实。\n最近几周，特朗普一直在抨击邮寄投票的努力，尽管专家们一致认为，邮寄投票是一个安全的过程-如此安全，以至于它已经被广泛用于缺席投票，并在五个州被作为主要的投票方式。", "note_en": "A new warning label encouraging  Twitter   users to “Get the facts about mail-in ballots” appeared on a series of tweets in which the president baselessly claimed ballots received through mail-in voting methods are “fraudulent.”\n   In a statement to TechCrunch, a Twitter spokesperson said the  pair of tweets from the president “contain potentially misleading information about voting processes and have been labeled to provide additional context around mail-in ballots.”\n “This decision is in line with the approach we shared earlier this month,” the spokesperson said, linking to the company’s  recent blog post on its misinformation policies.\n Clicking through the new prompt from Twitter brings users to a fact-checking page highlighting a CNN story debunking the president’s false claims. The page also offers a summary with bullet points providing useful context for the misleading tweets, including the fact that vote-by-mail is already widely in use around the country.\n Trump has railed against  vote-by-mail efforts in recent weeks, in spite of the consensus view by experts that voting through the mail is a safe process—so safe that it’s already widely used for absentee ballots and relied upon in five states as the primary method for voting.", "posttime": "2020-05-27 06:23:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,核查,adds,邮寄", "title": "推特增加警告标签事实核查特朗普的虚假投票主张", "title_en": "Twitter adds a warning label fact-checking Trump’s false voting claims", "transed": 1, "url": "https://techcrunch.com/2020/05/26/twitter-trump-labels-fact-checking-tweet/", "via": "", "real_tags": ["推特", "核查", "adds", "邮寄"]}, {"category": "", "categoryclass": "", "imagename": "bf617375b255942def3e9a107f7506aa.jpg", "infoid": 1003850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter的一位发言人在一份声明中告诉国会山：“我们对这些声明以及它们引起的关注给这家人带来的痛苦深表歉意。”\n我们一直在努力扩展现有的产品功能和政策，这样我们就可以更有效地解决像这样的事情，我们希望这些变化很快就能到位。&#34；我们一直在努力扩展现有的产品功能和政策，这样我们就可以在未来更有效地解决类似的问题，我们希望这些变化很快就能到位。\n在斯卡伯勒办公室工作的洛里·克劳苏蒂斯(Lori Klausutis)的鳏夫曾书面要求推特删除这些帖子。洛里·克劳苏蒂斯(Lori Klausutis)于2001年去世，此前她的心律异常导致她失去意识，头部撞到了佛罗里达州斯卡伯勒国会办公室的桌子上。她的死被裁定为意外。\n我是一名研究工程师，不是律师，但我审阅了Twitter的所有规则和服务条款。总统在推特上表示，洛莉是在没有证据的情况下被谋杀的，这与官方的尸检结果相反，这违反了推特的社区规则和服务条款。像我这样的普通用户会因为这样的推文而被驱逐出平台，但我只是要求删除这些推文。\n针对精神病患者乔·斯卡伯勒(Joe Scarborough)的悬案开庭并不是唐纳德·特朗普(Donald Trump)最初的想法，这已经持续了多年，早在我加入合唱团之前。2016年，当乔和他未来古怪的前妻米卡(Mika)没完没了地采访我时，我会一直在想……。\n-唐纳德·J·特朗普(@realDonaldTrump)2020年5月26日", "note_en": "“We are deeply sorry about the pain these statements, and the attention they are drawing, are causing the family,&#34; a Twitter spokesperson told The Hill in a statement.\n &#34;We&#39;ve been working to expand existing product features and policies so we can more effectively address things like this going forward, and we hope to have those changes in place shortly.&#34;\n  The widower of Lori Klausutis, the woman who worked in Scarborough&#39;s office, had asked Twitter in writing to remove the posts. Lori Klausutis died in 2001 after an abnormal heart rhythm caused her to lose consciousness and hit her head on a desk in Scarborough’s congressional office in Florida. Her death was ruled an accident.\n  &#34;I&#39;m a research engineer and not a lawyer, but reviewed all of Twitter&#39;s rules and terms of service. The President&#39;s tweet that suggests that Lori was murdered without evidence and contrary to the official autopsy is a violation of Twitter&#39;s community rules and terms of service. An ordinary user like me would be banished from the platform for such a tweet but I am only asking that these tweets be removed.&#34;\n    The opening of a Cold Case against Psycho Joe Scarborough was not a Donald Trump original thought, this has been going on for years, long before I joined the chorus. In 2016 when Joe &amp; his wacky future ex-wife, Mika, would endlessly interview me, I would always be thinking....\n— Donald J. Trump (@realDonaldTrump)  May 26, 2020", "posttime": "2020-05-27 06:07:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,推文,deeply,办公室", "title": "推特对特朗普的推文深表歉意，但不会删除这些推文", "title_en": "Twitter 'deeply sorry' about Trump's tweets, but won't remove them", "transed": 1, "url": "https://thehill.com/homenews/media/499539-twitter-deeply-sorry-about-trumps-tweets-on-scarborough-late-intern-but-wont", "via": "", "real_tags": ["推特", "推文", "deeply", "办公室"]}]