[{"category": "", "categoryclass": "", "imagename": "47c0eb942a9e144374ff55f768138d34.jpg", "infoid": 1032369, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的Zero项目表示，黑客一直在积极利用Windows Zeroday，该漏洞几乎要到两周后才能打上补丁。\n为了与长期的政策保持一致，谷歌的漏洞研究小组给了微软7天的最后期限来修复安全漏洞，因为它正在被积极利用。通常，Project Zero会在90天后或补丁程序可用时(以先到者为准)披露漏洞。\n在跟踪漏洞时，CVE-2020-117087允许攻击者提升系统权限。攻击者将针对该漏洞的攻击与针对Chrome最近修复的缺陷的单独攻击相结合。前者允许后者逃离安全沙箱，因此后者可以在易受攻击的机器上执行代码。\nCVE-2020-117087源于用于加密功能的部分视窗中的缓冲区溢出。它的输入/输出控制器可用于将数据输送到允许代码执行的Windows部分。周五发布的帖子指出，该漏洞存在于Windows7和Windows10中，但没有提及其他版本。\n周五的Project Zero帖子称：“Windows内核加密驱动程序(cng.sys)将\\Device\\CNG设备暴露给用户模式程序，并支持多种具有非平凡输入结构的IOCTL。”“它构成了可用于权限提升(如沙盒转义)的本地可访问的攻击面。”\n这篇技术文章包括一个概念验证代码，人们可以用它来使Windows10机器崩溃。\n与CVE2020-117087相结合的Chrome缺陷存在于Chrome附带的FreeType字体渲染库和其他开发者的应用程序中。FreeType漏洞已在11天前修复。目前还不清楚是否所有使用FreeType的程序都已更新以包含该补丁。\nProject Zero表示，预计微软将在11月10日修补该漏洞，这与该月的周二更新不谋而合。在一份声明中，微软官员写道：\n微软向客户承诺调查报告的安全问题并更新受影响的设备以保护客户。虽然我们努力满足所有研究人员的披露截止日期，包括本场景中的短期截止日期，但开发安全更新是及时性和质量之间的平衡，我们的最终目标是帮助确保最大限度地保护客户，同时将客户中断降至最低。\n一名代表表示，微软没有证据表明该漏洞正在被广泛利用，该漏洞不能被利用来影响加密功能。微软没有提供任何有关Windows用户在修复程序可用之前可以采取的步骤的信息。\nProject Zero技术负责人本·霍克斯(Ben Hawkes)为在Zero被积极利用后一周内披露Zero的做法进行了辩护。\n速战速决：我们认为有防御性的工具来共享这些细节，而且从现在到发布补丁之间使用这些细节的机会主义攻击是相当不可能的(到目前为止，它已经被用作利用链的一部分，并且入口点攻击已经修复)。\n野生利用的短截止日期还试图激励正在紧急开发/共享的带外补丁或其他缓解措施。这些改进可能会在更长的时期内看到。\n野生利用的短截止日期还试图激励正在紧急开发/共享的带外补丁或其他缓解措施。这些改进可能会在更长的时期内看到。\n-本·霍克斯(@benhawkes)2020年10月30日。\n除了“与任何与美国大选相关的目标无关”之外，没有任何关于积极利用漏洞的细节。", "note_en": "Google’s project zero says that hackers have been actively exploiting a Windows zeroday that isn’t likely to be patched until almost two weeks from now.\n In keeping with long-standing policy, Google’s vulnerability research group gave Microsoft a seven-day deadline to fix the security flaw because it’s under active exploit. Normally, Project Zero discloses vulnerabilities after 90 days or when a patch becomes available, whichever comes first.\n CVE-2020-117087, as the vulnerability is tracked, allows attackers to escalate system privileges. Attackers were combining an exploit for it with a separate one targeting a  recently fixed flaw in Chrome. The former allowed the latter to escape a security sandbox so the latter could execute code on vulnerable machines.\n CVE-2020-117087 stems from a  buffer overflow in a part of Windows used for cryptographic functions. Its input/output controllers can be used to pipe data into a part of Windows that allows code execution. Friday&#39;s post indicated the flaw is in Windows 7 and Windows 10, but made no reference to other versions.\n “The Windows Kernel Cryptography Driver (cng.sys) exposes a \\Device\\CNG device to user-mode programs and supports a variety of IOCTLs with non-trivial input structures,” Friday’s  Project Zero post said. “It constitutes a locally accessible attack surface that can be exploited for privilege escalation (such as sandbox escape).”\n The technical write up included a proof-of-concept code people can use to crash Windows 10 machines.\n  The Chrome flaw that was combined with CVE-2020-117087 resided in the  FreeType font rendering library that’s included in Chrome and in applications from other developers. The FreeType flaw was  fixed 11 days ago. It’s not clear if all programs that use FreeType have been updated to incorporate the patch.\n Project Zero said it expects Microsoft to patch the vulnerability on November 10, which coincides with that month’s Update Tuesday. In a statement, Microsoft officials wrote:\n Microsoft has a customer commitment to investigate reported security issues and update impacted devices to protect customers. While we work to meet all researchers’ deadlines for disclosures, including short-term deadlines like in this scenario, developing a security update is a balance between timeliness and quality, and our ultimate goal is to help ensure maximum customer protection with minimal customer disruption.\n A representative said that Microsoft has no evidence the vulnerability is being widely exploited and that the flaw can&#39;t be exploited to affect cryptographic functionality. Microsoft didn&#39;t provide any information on steps Windows users can take until a fix becomes available.\n Project Zero technical lead Ben Hawkes  defended the practice of disclosing zerodays within a week of them being actively exploited.\n The quick take: we think there&#39;s defensive utility to sharing these details, and that opportunistic attacks using these details between now and the patch being released is reasonable unlikely (so far it&#39;s been used as part of an exploit chain, and the entry-point attack is fixed)\n The short deadline for in-the-wild exploit also tries to incentivize out-of-band patches or other mitigations being developed/shared with urgency. Those improvements you might expect to see over a longer term period.\n The short deadline for in-the-wild exploit also tries to incentivize out-of-band patches or other mitigations being developed/shared with urgency. Those improvements you might expect to see over a longer term period.\n— Ben Hawkes (@benhawkes)  October 30, 2020\n There are no details about the active exploits other than it’s “not related to any US election related targeting.”", "posttime": "2020-10-31 04:00:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,0day,windows,project", "title": "谷歌的Project Zero披露Windows 0day一直处于活跃利用状态", "title_en": "Google’s Project Zero discloses Windows 0day that’s been under active exploit", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/googles-project-zero-discloses-windows-0day-thats-been-under-active-exploit/", "via": "", "real_tags": ["google", "谷歌", "0day", "windows", "project"]}, {"category": "", "categoryclass": "", "imagename": "8c6264e953721db6eb76617f67641332.jpg", "infoid": 1032367, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莱德推动创建自己的风险基金，实际上是企业更广泛趋势的一部分，这些企业利用美国新冠肺炎疫情作为开始投资初创企业的机会-尽管很大一部分人正在努力寻找工作。\n这对莱德这样的公司至关重要，据公司高管称，莱德已经在其一度沉睡的小行业60亿美元的新技术上进行了投资。在Excel电子表格曾经被认为是最先进的行业中，这是一个促进新技术开发的巨大数字。\n莱德并不是唯一一个认识到有必要在新贵到来之前抢占技术创新先机，并将成熟的企业置于后视镜中的人。\n根据行业分析提供商Global Corporate Venturing的数据，在2020年上半年，有368家公司对初创公司进行了首次投资。与20年前的上一次企业投资繁荣和萧条时期相比，这是一个广泛的转变，当时大公司是科技行业最后的投资者之一，也是第一批撤出资本的公司。\n首次进入企业风险投资的投资者数量几乎是2019年第三季度企业支持激增的两倍，当时有177家新公司首次投资于风险投资。\n莱德作为有限合伙人与风险投资公司Autotech Ventures和企业创新和加速器Plug and Play合作，但这只5000万美元的新基金是其第一个直接风险投资工具。\n这家物流公司的执行副总裁兼新产品开发负责人卡伦·琼斯(Karen Jones)说，“我们收到了董事会和首席执行官的战略指示，要求他们开始关注我们的行业面临的破坏，并更好地了解如何驾驭这些水域。”“每个人都在阅读有关区块链和自动化、电动汽车、自动驾驶汽车和资产共享的所有内容。”\n运输和物流在历史上与科技行业并没有太多交叉-但全球互联移动设备的出现；改进的微型化传感技术；不断提高的车辆自动化；以及客户不断加快的送货需求，推动了琼斯所称的一个超级采用期，这是一个“昏昏欲睡的小行业”。\n琼斯说：“在我们这个特定的行业，用现有的技术颠覆它的时机已经成熟。”“(而且)如果我们将要被颠覆，让我们站在它的前面，把它变成一个机会，而不是威胁。”\n在莱德，重点似乎是创建一个尽可能灵活的投资结构。\n这家风险投资公司对其交易承诺没有上限。唯一真正可靠的承诺是，它希望在未来五年花费5000万美元。\n琼斯说，该公司可能会投资于以下技术：最后一英里送货、资产共享、电动汽车、自动驾驶汽车，以及下一代数据、分析和机器学习技术。但即使在那里，莱德也不想限制自己。\n“我们想要娱乐其他的想法。也许我们还没有考虑到所有的事情。“琼斯说。\n该公司的投资团队中有四人与琼斯一起工作：负责船队管理的首席技术官里奇·莫尔(Rich Mohr)；负责公司供应链业务的首席技术官肯德拉·菲利普斯(Kendra Philips)；负责投资者关系和公司战略的副总裁鲍勃·布鲁恩(Bob Brunn)；以及公司财务总监迈克·普拉恩西亚(Mike Plaencia)。\n琼斯说，他们将向首席执行官和首席财务官汇报，并与不同业务部门的总裁就潜在的投资组合进行磋商。\n琼斯说，投资组合中的公司将根据它们对公司的潜在战略价值和经济回报的潜力进行评判。\n对于初创公司来说，这可能意味着接触到莱德的5万名客户。琼斯说：“有能力帮助初创公司测试和证明他们的技术，并帮助我们提高效率，这对双方都是一个巨大的好处。”", "note_en": "Ryder’s push to create its own venture fund is actually part of a broader trend among corporations who have used the COVID-19 epidemic in the US as an opportunity to start investing in startups — even as a large portion of the population struggles to find work.\n And it’s one that is vital for a company like Ryder, which has seen investments into new technology in its once sleepy little industry top $6 billion, according to company executives. That’s a massive figure promoting new tech development in a business where Excel spreadsheets used to be considered state of the art.\n  Ryder’s not alone in recognizing the need to get in front of technological innovations before an upstart comes along and puts well-established businesses in the rearview mirror.\n Over the first half of 2020, 368 corporations made their first investments into startup companies, according to data from the industry analytics provider,  Global Corporate Venturing. It’s a broad shift from the last corporate investment boom and bust period twenty years ago where large corporations were some of the last investors in the tech industry and the first to pull their capital out.\n And the amount of first time investors into corporate venturing is nearly double the previous surge in corporate backing in the third quarter of 2019, when 177 new companies made their first investments in venture capital.\n Ryder has worked with the venture firms  Autotech Ventures and the corporate innovation and accelerator Plug and Play as a limited partner, but the new $50 million fund is its first direct investment vehicle for venture.\n “We had a strategic directive from our board of directors and our CEO to begin to look at the disruption confronting our industry and to understand better how to navigate those waters,” said Karen Jones, the executive vice president and head of new product development at the logistics company. “ Everybody was reading all about blockchain and automation and electric vehicles ad autonomous vehicles and asset sharing.”\n Transportation and logistics historically didn’t cross paths much with the tech industry — but the advent of globally connected mobile devices; improved, miniaturized sensing technologies; increasing vehicular automation; and accelerating delivery demands from customers have pushed the “sleepy little industry” as Jones called into a period of hyper-adoption.\n “There’s just been a ripe opportunity in our particular industry to disrupt it with the technology that’s available,” said Jones. “[And] i f we’re going to be disrupted let’s get in front of it and turn it into an opportunity instead of a threat.”\n At Ryder, the emphasis seems to be on creating an investment structure with as much flexibility as possible.\n The venture firm doesn’t have a cap on its commitments to deals. The only real solid commitment is that it’s looking to spend $50 million over the next five years.\n The company will likely invest in technologies like: last-mile deliveries, asset sharing, electric vehicles, autonomous vehicles, and next generation data, analytics, and machine learning technologies, Jones said. But even there, Ryder doesn’t want to limit itself.\n “ We want to entertain other thoughts. Maybe we haven’t thought of everything,” Jones said.\n There are four people on the company’s investment team working alongside Jones: Rich Mohr, the chief technology officer for fleet management; Kendra Philips, the chief technology officer for the company’s supply chain business; Bob Brunn, the vice president of investor relations and corporate strategy; and Mike Plasencia, the director of finance for the company.\n They’ll report up to the CEO and CFO and confer with presidents of different business units on potential portfolio investments, Jones said.\n Companies in the portfolio will be judged both on their potential strategic value to the company and on their potential for economic returns, said Jones.\n For startups, that potentially means access to Ryder’s 50,000 customers. “The ability to help a startup test out and prove their technology and help us improve efficiencies is a great benefit to both sides,” Jones said.", "posttime": "2020-10-31 03:56:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,风险投资,卡车,venture", "title": "\n物流和卡车租赁巨头莱德(Ryder)将于2020年加入这些业务，跳入风险投资领域", "title_en": "\n\t\t\t\tLogistics and truck rental giant Ryder joins the businesses making the jump into venture capital in 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/30/logistics-and-truck-rental-giant-ryder-joins-the-businesses-making-the-jump-into-venture-capital-in-2020/", "via": "", "real_tags": ["2020", "风险投资", "卡车", "venture"]}, {"category": "", "categoryclass": "", "imagename": "2431eb39e68d0d24720ab189d1204a7d.jpg", "infoid": 1032366, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lazada&#39；的在线杂货平台RedMart已经遭受了一项数据影响1.1的漏洞百万账户，在一个过时的数据库之后包含个人信息，包括..。\n谷歌新的VPN功能旨在保护Google One用户在不安全的热点浏览时的隐私。\n如果你想擦出火花你的想象力孩子们在学校的时候同时给他们一个帮上一些忙技术技能的他们&#39；我需要作为成年人，你可以&#39；看起来不会出差错在这些产品上..。\n司法部长的部门将考虑剥离，与各州和其他国家的协调，以及澳大利亚人的删除权。\n该公司的新产品在设计时考虑到了实时保护和事件管理。\nLinux基金会的OpenSSF正在为开源程序员引入一套安全类和证书。\n面临着与……有关的问题指纹", "note_en": "Lazada&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tonline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgrocery\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplatform\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRedMart\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsuffered\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdata\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbreach\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taffected\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t1.1\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmillion\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taccounts,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tafter\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toutdated\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdatabase\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcontaining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpersonal\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinformation\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tincluding\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Google&#39;s new VPN feature is aimed at protecting Google One users&#39; privacy when browsing from insecure hotspots.\n  If\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twant\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tspark\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\timagination\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tkids\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhile\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsame\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttime\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgiving\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthem\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tleg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tup\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttech\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tskills\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthey&#39;ll\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tneed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tadults,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcan&#39;t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twrong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlooking\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tproducts\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The Attorney-General&#39;s Department will look at carve-outs, harmonisation with states and other nations, and a right to erase for Australians.\n  The company’s new offerings are designed with real-time protection and incident management in mind.\n  The Linux Foundation&#39;s OpenSSF is introducing a suite of security classes and a certification for open-source programmers.\n  Faced\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tissues\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trelated\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfingerprint\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tverification\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsuch\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tageing,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscarring,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdryness,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSingapore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbegin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttapping\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tboth\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tiris\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfacial\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbiometrics\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmain\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tidentifiers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The FBI, CISA, HHS warning comes two weeks after Microsoft&#39;s partial takedown of the Trickbot botnet.", "posttime": "2020-10-31 03:56:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,windows,披露,discloses", "title": "谷歌披露Windows零日在野外被利用", "title_en": "Google Discloses Windows Zero-Day Exploited in the Wild", "transed": 1, "url": "https://www.zdnet.com/article/google-discloses-windows-zero-day-exploited-in-the-wild/", "via": "", "real_tags": ["google", "谷歌", "windows", "披露", "discloses"]}, {"category": "", "categoryclass": "", "imagename": "cf037ebf861215c24a2a05f5af58a57d.jpg", "infoid": 1032365, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，几乎每个人都听说过柏林灾难性的预算超支、计划外的“新”机场。但很少有人知道出了什么问题的真实情况。我是DW的乔..。", "note_en": "By now, almost everyone has heard about Berlin's disastrous over-budget, off-schedule \"new\" airport. But few know the real story of what went wrong. DW's Joe...", "posttime": "2020-10-31 03:51:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dw,ber", "title": "柏林“新”BER机场：无能和腐败的故事--DW新闻", "title_en": "Berlin's 'new' BER Airport: A story of incompetence and corruption – DW News", "transed": 1, "url": "https://www.youtube.com/watch?v=gWYTnc7m9mE", "via": "", "real_tags": ["dw", "ber"]}, {"category": "", "categoryclass": "", "imagename": "358ec8b565c36520433f972ae2130006.png", "infoid": 1032364, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧盟委员会执行副总裁玛格丽特·维斯特格(Margrethe Vestager)在今天的一次演讲中表示，算法责任将是即将到来的立法数字一揽子计划的关键一环-即将出台的规则草案将要求平台解释他们的推荐系统是如何工作的，并给予用户更多的控制权。\n“我们正在准备的规则将赋予所有数字服务与监管机构合作的责任。当监管机构要求时，最大的平台将不得不提供更多关于其算法工作方式的信息，“她表示。她补充称，平台还将”不得不让监管机构和研究人员访问它们持有的数据--包括广告档案“。\n虽然Facebook等社交媒体平台在监管要求之前就已经建立了广告档案，但第三方研究人员仍在抱怨这些信息是如何构建的，以及独立研究如何(In)获取这些信息。\n佩尔·维斯特格(Per Vestager)在本周早些时候的另一次演讲中也预览了数字服务法案(Digital Services Act)和数字市场法案(Digital Markets Act)中即将出台的内容，为用户提供更多关于广告定向的信息是另一个计划中的要求，以及对平台解释内容审核决定的更高报告要求。\n对于“黑盒”算法可能会对个人和社会产生破坏性影响的担忧，地方立法者正在做出回应-这些影响来自于它们处理数据的方式以及对信息的排序和排名，带来的风险包括歧视、放大偏见和滥用针对弱势个人和群体的风险。\n欧盟委员会表示，它正在制定具有约束力的透明度规则，目的是迫使科技巨头对其平台放大和货币化的内容承担更多责任。虽然问题在于要求的细节以及它们将如何有效地执行-但计划草案将在一个月左右到期。\n维斯特格今天在非营利性研究倡导组织AlgorithmWatch组织的一次活动上发表演讲时表示：“我们将在12月提出的数字服务法案的主要目标之一将是保护我们的民主，确保平台对这些算法的工作方式是透明的-并让这些平台对他们做出的决定更加负责。”\n“我们正在研究的提案将意味着，平台必须告诉用户，他们的推荐系统是如何决定展示哪些内容的--这样我们就更容易判断是否相信他们给我们的世界图景。”\n根据计划中的规则，最强大的互联网平台-用欧盟的话说就是所谓的“看门人”-将必须定期提供报告，说明“他们使用的内容审查工具，以及这些工具的准确性和结果”，正如维斯塔格所说。\n对广告定向的具体披露要求也将超出Facebook等平台目前可能已经提供的模糊披露(在Facebook的情况下，是通过“为什么我看到这个广告？”菜单)。\n她说，必须提供“更好的信息”，比如平台告诉用户“是谁投放了某个广告，以及它为什么针对我们”。她补充说，总体目标将是确保这类平台的用户“更好地了解谁在试图影响我们-以及更好地发现算法何时歧视我们”。\n今天，由AlgorithmWatch领导的一个由46个公民社会组织组成的联盟敦促欧盟委员会确保即将出台的立法中的透明度要求是“有意义的”-呼吁它引入“全面的数据访问框架”，为监督机构提供追究平台责任所需的工具，并使记者、学者和公民社会能够“挑战和审查权力”。\n该小组的一系列建议呼吁：基于主要平台的技术功能，承担具有约束力的披露义务；建立一个“具有明确法律授权，能够获取数据并执行透明度义务”的单一欧盟机构；以及确保数据收集符合欧盟数据保护规则的条款。\n另一种重新平衡数据挖掘平台巨头与他们追踪、分析和瞄准的个人之间权力不对称的方法可能涉及要求用户如果愿意的话，完全关闭算法馈送-选择退出数据驱动的歧视或操纵的可能性。但欧盟立法者是否会在即将出台的立法提案中走那么远仍有待观察。\n维斯特格在这方面提供的唯一暗示是，计划中的规则“也将赋予用户更大的权力-因此，对于我们可以看到什么，我们没有看到什么，算法没有最终决定权”。\n她还表示，平台还必须让用户“有能力影响推荐系统代表我们做出的选择”。\n在进一步的言论中，她证实，围绕内容审查和删除，将对数字服务提出更详细的报告要求-表示，当用户删除内容时，他们将不得不告知用户，并赋予他们“挑战删除的有效权利”。尽管欧盟各国公众普遍支持重启数字巨头的游戏规则，但也有强烈的观点认为，监管不应影响在线言论自由-例如鼓励平台通过应用上传过滤器或在没有正当理由的情况下删除有争议的内容来降低监管风险。\n这些提案将需要欧盟成员国通过欧洲理事会(European Council)和欧洲议会选举产生的代表的支持。\n后者已经投票支持对广告定向实施更严格的规定。欧洲议会议员还敦促欧盟委员会拒绝对有害或非法内容使用上传过滤器或任何形式的事前内容控制，称关于内容是否合法的最终决定应由独立的司法机构做出。\n与此同时，欧盟委员会正在努力制定专门针对使用人工智能的应用程序的规则-但这一立法方案要到明年才会到期。\n维斯特格证实，该系统将于2021年初推出，目的是创建“一个信任的人工智能生态系统”。", "note_en": "In a  speech today Commission EVP Margrethe Vestager suggested algorithmic accountability will be a key plank of the forthcoming legislative digital package — with draft rules incoming that will require platforms to explain how their recommendation systems work as well as offering users more control over them.\n “The rules we’re preparing would give all digital services a duty to cooperate with regulators. And the biggest platforms would have to provide more information on the way their algorithms work, when regulators ask for it,” she said, adding that platforms will also “have to give regulators and researchers access to the data they hold — including ad archives”.\n  While social media platforms like Facebook have set up ad archives ahead of any regulatory requirement to do so there are ongoing complaints from third party researchers about how the information is structured and  how (in)accessible it is to independent study.\n More information for users around ad targeting is another planned requirement, along with greater reporting requirements for platforms to explain content moderation decisions, per Vestager — who also gave a preview of what’s coming down the pipe in the Digital Services Act and Digital Markets Act in another speech  earlier this week.\n  Regional lawmakers are responding to concerns that ‘blackbox’ algorithms can have damaging effects on individuals and societies — flowing from how they process data and order and rank information, with risks such as discrimination, amplification of bias and abusive targeting of vulnerable individuals and groups.\n The Commission has said it’s working on binding transparency rules with the aim of forcing tech giants to take more responsibility for the content their platforms amplify and monetize. Although the devil will be in both the detail of the requirements and how effectively they will be enforced — but a draft of the plan is due in a month or so.\n “One of the main goals of the Digital Services Act that we’ll put forward in December will be to protect our democracy, by making sure that platforms are transparent about the way these algorithms work – and make those platforms more accountable for the decisions they make,” said Vestager in a speech today at an event organized by not-for-profit research advocacy group AlgorithmWatch.\n “The proposals that we’re working on would mean platforms have to tell users how their recommender systems decide which content to show – so it’s easier for us to judge whether to trust the picture of the world that they give us or not.”\n Under the planned rules the most powerful Internet platforms — so-called ‘gatekeepers’ in EU parlance — will have to provide regular reports on “the content moderation tools they use, and the accuracy and results of those tools”, as Vestager put it.\n There will also be specific disclosure requirements for ad targeting that go beyond the current fuzzy disclosures that platforms like Facebook may already offer (in its case via the ‘why am I seeing this ad?’ menu).\n “Better information” will have to be provided, she said, such as platforms telling users  “who placed a certain ad, and why it’s been targeted at us”. The overarching aim will be to ensure users of such platforms have “a  better idea of who’s trying to influence us — and a better chance of spotting when algorithms are discriminating against us,” she added.\n Today a coalition of 46 civic society organizations led by  AlgorithmWatch urged the Commission to make sure transparency requirements in the forthcoming legislation are “ meaningful” — calling for it to introduce “comprehensive data access frameworks” that provide watchdogs with the tools they need to hold platforms accountable, as well as to enable journalists, academics, and civil society to “challenge and scrutinize power”.\n The group’s set of  recommendations call for binding disclosure obligations based on the technical functionalities of dominant platforms; a single EU institution “with a clear legal mandate to enable access to data and to enforce transparency obligations”; and provisions to ensure data collection complies with EU data protection rules.\n Another way to rebalance the power asymmetry between data-mining platform giants and the individuals who they track, profile and target could involve requirements to let users switch off algorithmic feeds entirely if they wish — opting out of the possibility of data-driven discrimination or manipulation. But it remains to be seen whether EU lawmakers will go that far in the forthcoming legislative proposals.\n The only hints Vestager offered on this front was to say that the planned rules “will also give more power to users — so algorithms don’t have the last word about what we get to see, and what we don’t get to see”.\n Platforms will also have to give users “the ability to influence the choices that recommender systems make on our behalf”, she also said.\n In further remarks she confirmed there will be more detailed reporting requirements for digital services around content moderation and takedowns — saying they will have to tell users when they take content down, and give them “effective rights to challenge that removal”. While there is widespread public support across the bloc for rebooting the rules of play for digital giants there are also strongly held views that regulation should not impinge on online freedom of expression — such as by encouraging platforms to shrink their regulatory risk by applying upload filters or removing controversial content without a valid reason.\n The proposals will need the support of EU Member States, via the European Council, and elected representatives in the European parliament.\n The latter has already  voted in support of tighter rules on ad targeting. MEPs also urged the Commission to reject the use of upload filters or any form of  ex-ante content control for harmful or illegal content, saying the final decision on whether content is legal or not should be taken by an independent judiciary.\n Simultaneously the Commission is working on shaping rules specifically for applications that use artificial intelligence — but that legislative package is not due until next year.\n Vestager confirmed that will be introduced early in 2021 with the aim of creating “an AI ecosystem of trust”.", "posttime": "2020-10-31 03:34:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "algorithms,算法,tech,平台", "title": "\n根据欧盟计划，大型科技公司的“黑匣子”算法面临监管监督", "title_en": "\n\t\t\t\tBig tech’s ‘blackbox’ algorithms face regulatory oversight under EU plan\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/30/big-techs-blackbox-algorithms-face-regulatory-oversight-under-eu-plan/", "via": "", "real_tags": ["算法", "tech", "平台"]}, {"category": "", "categoryclass": "", "imagename": "e8069c99a73fe11c08eabb87aee9395d.jpg", "infoid": 1032363, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Fresly成立于2015年，是一家总部位于纽约市的初创公司，提供每周订单送到你家的健康饭菜，然后通过微波炉或烤箱在几分钟内准备好，所以你可以享受到新鲜、健康的饭菜，但与签约套餐初创公司不同的是，你不需要花很多时间自己做饭。\n如果说有什么不同的话，那就是这句话现在听起来更有吸引力了，因为我们中的许多人大部分时间都呆在家里，尽我们最大的努力为自己做饭。根据雀巢的新闻稿，Fresly现在每周向48个州运送100多万份餐食，预计2020年的销售额为4.3亿美元。\n这家初创公司从包括Highland Capital Partners、White Star Capital、Insight Venture Partners和雀巢本身在内的投资者那里总共筹集了1.07亿美元，雀巢在2017年领导了C系列赛事。今天的声明将早些时候的投资描述为让这家食品和饮料巨头获得Fresly 16%的股份，并将其视为“评估和测试新兴市场的战略举措”。\n雀巢美国董事长兼首席执行官史蒂夫·普雷斯利(Steve Presley)在一份声明中表示：“消费者正以前所未有的方式拥抱电子商务和在家就餐。”“这是一种由大流行带来的进化，但从长远来看，这是一种根深蒂固的进化。Fresly是一家创新、快速增长的食品技术初创公司，将它们加入投资组合可以加快我们利用美国食品市场新现实的能力，并进一步定位雀巢在未来的制胜地位。“。\n在给客户的一份报告中，Fresly联合创始人兼首席执行官迈克尔·怀斯特拉赫(Michael Wystrach)表示，由于此次收购，他的团队计划将每周提供的菜单项目数量增加两倍。然而，除此之外，他认为情况不会发生太大变化：\n我可以向您保证，您的用餐、定价和订阅将保持您所知道的原样。Fresly将继续作为一项独立的业务运营，以完成我们的核心使命，即通过方便、营养和美味的餐饮解决方案消除健康饮食的障碍，并以雀巢的力量为后盾，为更新鲜、更快的食品送货上门。我们将继续保持我们自己的严格标准，并保持对我们产品的完全控制。我们的餐饮不会改变，也没有改变配料或将雀巢产品整合到新鲜餐食中的计划，但我们对未来的潜在机会感到兴奋。", "note_en": "Founded in 2015,  Freshly   is a New York City-based startup that offers healthy meals delivered to your home in weekly orders, then prepared in a few minutes via microwave or oven,  So you get the benefit of fresh, healthy meals but — unlike signing up with a meal kit startup — you don’t have to spend a lot of time cooking them yourself.\n If anything, this sounds even more appealing now, as so many of us are spending most of our time at home, doing our best to cook for ourselves. According to Nestlé’s press release, Freshly is now shipping more than 1 million meals per week across 48 states, with forecasted sales of $430 million for 2020.\n  The startup raised a total of $107 million from investors including Highland Capital Partners, White Star Capital, Insight Venture Partners and Nestlé itself, which  led the Series C in 2017. Today’s announcement describes the earlier investment as giving the food and beverage giant a 16% stake in Freshly and serving as “a strategic move to evaluate and test the burgeoning market.”\n “Consumers are embracing ecommerce and eating at home like never before,” said Nestlé USA Chairman and CEO Steve Presley in a statement. “It’s an evolution brought on by the pandemic but taking hold for the long term. Freshly is an innovative, fast-growing, food-tech startup, and adding them to the portfolio accelerates our ability to capitalize on the new realities in the U.S. food market and further positions Nestlé to win in the future.”\n In  a note to customers, Freshly co-founder and CEO Michael Wystrach said that as a result of the acquisition, his team has plans to triple the number of menu items offered each week. Beyond that, however, he suggested that things won’t change too dramatically:\n I can assure you that your meals, pricing, and subscription will remain just as you know them. Freshly will continue to operate as a standalone business to accomplish our core mission to remove the barriers to healthy eating with convenient, nutritious and delicious meal solutions, backed by the power of Nestlé to open new doors for a fresher, faster food delivery to your door. We will continue to maintain our own strict standards and maintain complete control of our products. Our meals will not be changing, and there are no plans to change ingredients or integrate Nestlé products into Freshly meals, but we are excited about potential opportunities for the future.", "posttime": "2020-10-31 03:34:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,acquires,雀巢", "title": "\n雀巢以高达15亿美元收购健康餐饮初创公司Fresly", "title_en": "\n\t\t\t\tNestlé acquires healthy meal startup Freshly for up to $1.5B\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/30/nestle-acquires-freshly/", "via": "", "real_tags": ["初创", "acquires", "雀巢"]}, {"category": "", "categoryclass": "", "imagename": "aea5d731c9b454342ad1428e128f608c.jpeg", "infoid": 1032362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook周五表示，将限制“拯救我们的儿童”标签的使用，因为号称反对人口贩运的运动已经被Qanon阴谋论者取代。\nFacebook的一位发言人告诉Insider，当用户在该平台上搜索“拯救儿童”时，该公司将会提供可信的儿童安全资源。\n本周早些时候，我们加强了针对Qanon的页面、事件和群组规则的执行。这位发言人在一份声明中表示，从今天开始，我们将限制“拯救我们的孩子”标签的传播，因为我们发现，与该标签相关的内容现在与QAnon有关。这份声明最先由NBC新闻的布兰迪·扎德罗兹尼(Brandy Zadrozny)报道。\n虽然标签仍然可以使用，但Facebook将不允许用户看到包含该标签的帖子的聚合结果。Facebook表示，该公司还将继续寻找Qanon逃避限制的方式。\n到目前为止，Facebook还没有对“拯救孩子”标签施加同样的限制。Insider发现，“拯救我们的孩子”和“拯救儿童”这两个之前在反人口贩卖圈子里流行的短语现在都被QAnon使用了。\nQAnon是一个毫无根据的阴谋，专注于唐纳德·特朗普(Donald Trump)总统正在与一个由撒旦恋童癖者组成的秘密深层国家阴谋作斗争的错误想法。通过将这场运动的重点转移到一场普遍的反恋童癖斗争上，这场运动成功地在网上进行了更微妙的传播，Facebook等公司表示，他们正在努力摆脱QAnon的言论。\nQanon致力于拯救儿童，这是曾经处于边缘地位的阴谋论最近迅速进入主流文化不可或缺的一部分。\n“拯救儿童组织”(Save The Children)也被称为“拯救我们的儿童”(Save Our Children)，QAnon在Facebook旗下的Instagram上以蓬松的美学传播开来，研究人员马克-安德烈·阿根廷诺(Marc-André阿根廷)称之为“粉彩Qanon”。许多女性，包括生活方式影响者、瑜伽教练和其他Instagram名人，都加入了QAnon的传播行列。\nNBC新闻之前获得的Facebook内部文件发现，在QAnon在10月初宣布禁止阴谋论之前，QAnon群已经有数百万名成员。据美国全国广播公司(NBC News)报道，在线追踪虚假信息的非营利组织First Draft在8月份进行的一项分析发现，在350万Facebook用户中，讨论拯救儿童和拯救我们的孩子的标签中，最吸引人的对话发生在Facebook群组和与Qanon相关的Instagram账户上。\n虽然人们可能会忍不住认为幕后有更黑暗的东西在发生，但QAnon的追随者们只是在重复使用数百年的阴谋论，并将其作为武器来对抗民主党人和克里西·泰根(Chrissy Teigen)等自由派名人。\n根据打击真实人口贩运的专家和团体的说法，无论意图如何，QAnon信徒的努力都是被误导的，也是没有帮助的。与QAnon有关的阴谋论，包括Wayfair阴谋论，错误地声称这家家具公司在其网站上出售人类，已经从这些组织那里拿走了资源。\n运营全国人口贩运热线的北极星公司在一份声明中告诉Insider，关于儿童性交易的未经证实的指控和指控可能会失控，弊大于利。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "Facebook will limit the use of the &#34;Save our Children&#34; hashtag, as the movement that&#39;s purportedly against human trafficking has been overtaken by QAnon conspiracy theorists, the company said Friday.\n A Facebook spokesperson told Insider that the company will be surfacing &#34;credible child safety resources&#34; when users search for &#34;saveourchildren&#34; on the platform.\n &#34;Earlier this week, we stepped up how we enforce our rules against QAnon on pages, events, and groups. Starting today, we&#39;re limiting the distribution of the &#39;save our children&#39; hashtag given we&#39;ve found that content tied to it is now associated with QAnon,&#34; the spokesperson said in a statement, which was first reported by Brandy Zadrozny of NBC News.\n While the hashtag will still be usable, Facebook will not allow users to see aggregated results of posts incorporating the hashtag. The company will also continue to seek out ways that QAnon has evaded its restrictions, Facebook said.\n   As of now, Facebook is not applying the same restrictions to the &#34;savethechildren&#34; hashtag. Both &#34;Save our Children&#34; and &#34;Save the Children,&#34; phrases that have previously been popular in anti-trafficking circles, are used by QAnon, Insider has  found.\n QAnon is a baseless conspiracy focused on the false idea that President Donald Trump is battling a secret deep-state cabal of satanic pedophiles. By shifting the emphasis of the movement to instead focus on a general anti-pedophilia battlecry, it has been successful in spreading more subtly online, as companies like Facebook say they&#39;re fighting to rid their platforms of QAnon rhetoric.\n QAnon&#39;s pivot to &#34;Save the Children&#34; has been integral to the once-fringe conspiracy theory&#39;s recent and rapid entrée into mainstream culture.\n With &#34;Save the Children,&#34; also called &#34;Save Our Children,&#34; QAnon has spread with fluffy aesthetics on Facebook-owned Instagram, in what researcher Marc-André Argentino has dubbed &#34;Pastel QAnon.&#34; Many women, including  lifestyle influencers, yoga instructors, and other Instagram personalities, have joined in spreading QAnon messaging.\n   Internal Facebook documents  previously obtained by NBC News found that QAnon groups had millions of members before the company  announced a ban on the conspiracy theory in early October. An August analysis by First Draft, a nonprofit tracking misinformation online, found that of 3.5 million Facebook users discussing &#34;Save the Children&#34; and &#34;Save Our Children&#34; hashtags, &#34;the most engaging conversations were happening in Facebook groups and on Instagram accounts related to QAnon,&#34;  NBC News reported.\n While it may be tempting to assume there&#39;s something darker going on behind the scenes, QAnon adherents are simply  recycling centuries-old conspiracy theories and weaponizing them against Democrats and liberal  celebrities like Chrissy Teigen.\n Regardless of the intent, the efforts of QAnon believers are  misguided and unhelpful, according to experts and groups fighting real human trafficking. QAnon-linked conspiracy theories, including the Wayfair conspiracy theory, which falsely alleged the furniture company was selling humans on its website, have taken resources from these organizations.\n Polaris, which operates the National Human Trafficking Hotline, told Insider in a statement, &#34;Unsubstantiated claims and accusations about child sex trafficking can spin out of control and create more harm than good.&#34;\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n          Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-10-31 03:33:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,贩运,limit,qanon", "title": "Facebook表示，在QAnon加入反人口贩运运动后，将限制使用“拯救我们的儿童”标签", "title_en": "Facebook says it will limit the use of the “Save our Children” hashtag after QAnon co-opted the anti-trafficking movement", "transed": 1, "url": "https://www.businessinsider.com/facebook-limits-qanon-save-our-children-hashtag-human-trafficking-2020-10?op=1&scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["facebook", "贩运", "limit", "qanon"]}, {"category": "", "categoryclass": "", "imagename": "b0d2b7475d6bb9d354434c62bc2d12fb.png", "infoid": 1032361, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple One是将Apple Music、Apple TV Plus和Apple Arade等服务捆绑在一起的月度订阅服务，现在可以使用。该捆绑包是在上个月的一次活动上首次宣布的，随后苹果公司昨天确认了发布日期。目前，您可以通过iOS上的App Store订阅捆绑包。打开商店，点击右上角的个人资料图标进入账户页面，点击订阅，你应该会看到订阅Apple One的选项。然而，在苹果自己的网站上，该捆绑包目前被列为“今年秋天即将推出”。\n在发布时，有三个不同的级别可供选择，价格从14.95美元的单个级别到29.95美元的Premier计划不等。使用个人套餐，您可以获得Apple Music、Apple TV Plus、Apple Arade和50 GB的iCloud存储。与此同时，升级版19.95美元的家庭计划将iCloud存储增加到200 GB，并为Apple Music增加了家庭订阅。最后，29.95美元的Premier计划将iCloud存储容量增加到2TB，并增加了Apple News Plus和苹果即将推出的Fitness Plus服务的订阅量。\n虽然Fitness Plus不能在Apple One发布的同时提供，但这项服务最终将在本季度晚些时候推出后与Premier计划一起提供。否则，它将作为每月9.99美元的独立订阅提供。\n与单独订购每项服务相比，个人计划每月可为您节省6美元，家庭计划可节省8美元，Premier计划可节省25美元。当然，只有当你计划订阅所有包含的服务时，这才适用，所以对于大多数人来说，节省的费用可能会更复杂。\n除了通过App Store注册，你目前还可以通过设置应用程序访问Apple One。打开这款应用，在菜单顶部点击你的名字，点击“订阅”，你应该会看到注册的选项。苹果公司表示，其个人和家庭计划将在100多个国家和地区提供，但其Premier级别将仅限于美国、英国、澳大利亚和加拿大，因为这些国家是目前唯一可以使用Apple News Plus的国家。", "note_en": "Apple One, a bundle combining services like Apple Music, Apple TV Plus, and Apple Arcade into one monthly subscription, is now available. The bundle was first announced at an  event last month, before Apple  confirmed the release date yesterday. Currently, you can subscribe to the bundle via the App Store on iOS. Open the store, head into the account page by tapping the profile icon on the top right, tap subscriptions, and you should see the option to subscribe to Apple One. However, on  Apple’s site itself, the bundle is currently listed as “Coming this fall.”\n At launch, there are three different tiers available, which range in price from the $14.95 Individual tier to the $29.95 Premier plans. With the Individual plan, you get Apple Music, Apple TV Plus, Apple Arcade, and 50GB of iCloud storage. The step-up $19.95 Family plan, meanwhile, increases the iCloud storage to 200GB and adds a  family subscription to Apple Music. Finally, the $29.95 Premier plan increases the iCloud storage to 2TB and adds subscriptions to Apple News Plus as well as Apple’s upcoming Fitness Plus service.\n   Although Fitness Plus isn’t available alongside the launch of Apple One, the service will eventually be available with the Premier plan after its launch later this quarter. Otherwise, it’ll be available as a $9.99-per-month standalone subscription.\n Compared to subscribing to each service individually, the Individual plan saves you $6 a month, the Family plan saves $8, and the Premier plan $25. Of course, that only applies if you were planning to subscribe to all of the included services, so for most people, the savings are likely to be  more complicated.\n As well as signing up through the App Store, you can also currently access Apple One via the Settings app. Open the app, tap your name at the top of the menu, hit “Subscriptions,” and you should see the option to sign up. Apple says its Individual and Family plans will be available in over 100 countries and regions, but its  Premier tier will be limited to the US, UK, Australia, and Canada since those are the only countries where Apple News Plus is currently available.", "posttime": "2020-10-31 03:33:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,推出,tier,订阅", "title": "苹果推出了Apple One订阅捆绑包，分为三个等级，从14.95美元的个人等级到29.95美元的Premier等级不等", "title_en": "Apple launches the Apple One subscription bundle, with three tiers ranging from the $14.95 Individual tier to the $29.95 Premier tier", "transed": 1, "url": "https://www.theverge.com/2020/10/30/21541685/apple-one-subscription-individual-family-premier-music-tv-plus-arcade-icloud-news-fitness?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["apple", "苹果", "推出", "tier", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "b4df9537a8fc5c05a73083f99ed68a16.jpg", "infoid": 1032360, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我的公司，我们都很偏远。这意味着我们写了很多东西--电子邮件、Google Docs、Github和Slake。我们努力培育以书面为主的文化。\n这对我来说很管用。因为，你看，我的听力有问题。或者就像我喜欢说的，我聋得像个柱子。\n虽然我能听到声音，但我不能把声音变成文字，日常对话要靠读唇语。\n对于我这个产品设计师来说，这种工作方式令人惊叹。集中精力的时间很长，能够决定何时以及如何最好地做好我的工作。对于听力受损的人来说，这几乎天生就创造了一个更具包容性的环境。\n尽管如此，我们仍然时不时地依赖同步沟通方法：团队同步以赶上更个人化的水平，将团队凝聚在一起，主持用户调查，并促进协作活动和研讨会。通常，同步意味着视频通话。\n视频通话对我来说一直是一个挑战。唇读在视频上效果不佳，因为唇读不仅依赖嘴唇，还依赖更多的视觉信息，而且视频通话不能轻松携带阅读唇语所需的全部视觉和情感带宽。因此，我转而使用一系列黑客工具或内置工具，通过提供实时语音到文本来帮助我解决问题。\n这些技巧和工具工作得很好，但有时会出问题，或者会落后。然后，一些简单的事情，比如有人问我对某事的看法，在我意识到有人叫到我的名字之前，可能会造成尴尬的沉默时刻，因为我依赖的是一份落后5秒的成绩单。\n谢天谢地，我有一个出色的、支持我的团队，这在我的日常工作中从来都不是问题。\n我们的团队一直在快速壮大，从只有一个产品经理扩大到一个由8名产品经理和设计师组成的团队，我们一直在考虑如何作为一个团队相互联系和支持。因此，当我们的产品副总裁提出一个想法，帮助团队建立同理心，并从依赖字幕的人的角度更好地理解视频通话体验时，我们立即采取了行动。\n当我们举行下一次产品团队同步时，整个团队都加入了SANS Audio。我们都会仅仅依靠字幕来跟踪对话。\n大多数模拟残疾人生活体验的练习都是无效的-甚至是一个好主意-因为它们永远不能真正模拟每天的生活是什么样子，而且会给人们留下对这种体验的错误想法。\n但这个想法很有说服力，因为我正在使用的黑客设置的独特性质意味着它不是关于能力的，而是关于技术的。这不是要了解在听力有问题的情况下进行视频通话是什么感觉：而是要了解依赖视频通话的字幕是什么感觉。\n这支队伍全力以赴。我们的会议文档充满了我们想要涵盖的有意义的主题，我们希望使用为同步留出的整个小时。\n我们最终使用了两种不同的视频通话平台和两种不同的字幕方法。\n第一次尝试结合了缩放和水獭。每个人都打开了一个带有文字记录的浏览器窗口，并将其定位在屏幕上的某个位置，这样他们就可以看到电话和“字幕”。这份文字记录不包括演讲者的名字，所以人们必须密切关注谁在讲话，并将其与文字记录对应起来。\n这样做效果很好，但没有奏效。不到5分钟，文字记录就落后于谈话足足5-10秒。在我自己的日常设置中，正是出于这个原因，我经常同时使用多个语音到文本的工具，所以我建议我们跳到Google Meet，它有内置的字幕。\n该团队立即发现了其中的权衡：虽然Meet的字幕是内置的，但没有历史，这意味着每个人都必须将注意力集中在字幕上，以确保他们不会错过任何东西。还有一些UI问题会造成摩擦或中断字幕。\n但从根本上说，它是有效的。每个人都可以参与通话，我们进行了同步。\n这通电话是一次令人吃惊的有效的团队合作体验。每个人都从以不同的感知和技术背景接近电话会议的经历中享受并学到了很多东西。\n对我来说，看到我们的互动在通话过程中发生了怎样的变化，这是一件令人着迷的事情。每个人在物理空间里都变得更有表现力。谈话的节奏发生了变化，从试探性的短句，变成了更长的、经过深思熟虑的思想块。我们发现，在没有声音的情况下，在说话者之间来回切换是多么困难，给彼此留出对话空间加入进来是多么重要。我们发现要被听到是多么困难。\n我们还意识到，我们计划讨论的一些事情可以更好地以书面优先的形式异步覆盖。这帮助我们将同步集中在实际需要同步对话的主题上。\n此外，虽然整个团队都很享受这种体验，但对每个人来说，这在情感上和精神上都更令人精疲力竭，部分原因是我们今天可用的语音到文本工具对参与者施加了限制和要求。\n在同步之后的一周里，我了解到产品团队的许多成员，以及我更广泛的团队中的一些成员，已经在改变他们处理视频通话的方式。\n一些人默认在Zoom上见面，因为他们知道字幕是内置的，这使得通话在默认情况下对每个人都更具包容性。\n其他人分享说，他们正在尝试更多的停顿，并更有意识地意识到他们如何用措辞来完成整个句子中的一个想法。\n甚至连句子结构也发生了变化：其他人开始在句子的开头说名字，而不是在句子的结尾。\n最令人信服的是，团队中的许多成员现在自己在通话中使用字幕-不是因为他们需要，而是为了密切关注电话中其他可能依赖他们的人对他们所说的话的接收情况。\n我们团队的另一位成员在读完这篇文章后分享了自己的精彩故事：\n顺便说一句，在我之前的团队里，我们做了几乎完全一样的事情！我雇了一位很棒的重听工程师，我们用Meet做字幕。在经历了一些问题之后，我们意识到我们已经把那个工程师甩在后面几次了，我们都决定打开字幕并注意它。\n这是很棒的，让我们了解了我们的队友正在经历的事情，但最重要的是，它给了我们一个机会，当我们“说错话”时-当字幕说了一些与我们想要的不同的东西时，我们可以改正自己。这样，我们就避免了把破译的重担加到依赖字幕的工程师身上。\n这项练习在非常个人的层面上强化了“能力”是如何属于某一光谱的，并符合包容性设计原则，即如何为某一能力的极致进行设计可以使每个人受益。\n虽然我自己的听力损失是永久性的，但一些人在应对情景挑战(如无线耳塞漏气)或临时挑战(如耳朵感染)时，可以像我一样从视频通话中的语音到文本中受益。\n我们的团队正在为开发人员进行通用代码搜索。对我们来说，通用代码搜索意味着从一开始就创造包容性体验，并始终致力于改善我们的可访问性基线。\nQuinn KEast是Sourcegraph的产品设计师，这是一家专门从事通用代码搜索的公司。他也是设计和战略咨询公司Cariou的联合创始人。", "note_en": "At my company, we’re all-remote. That means we write a lot—in emails, Google Docs, Github, and Slack. We work hard to cultivate a written-first culture.\n   And that works beautifully for me. Because, you see, I have a hearing problem. Or as I like to say, I’m deaf as a post.\n While I can hear sound, I can’t turn that sound into words, and rely on lip reading for day-to-day conversations.\n For me, a product designer, this approach to work is amazing. Long stretches of focus time and being able to decide when and how to best do my work. And for someone with hearing loss, this almost inherently creates a more inclusive environment.\n Still, from time to time, we rely on synchronous methods of communication: team syncs to catch up on a more personal level and bring teams together, moderated user research, and facilitated collaborative activities and workshops. And more often than not, synchronous means video call.\n Video calls have always been a challenge for me. Lip-reading doesn’t work well over video, because lip-reading relies on a whole lot more visual information than just the lips, and video calls don’t carry the full visual and emotional bandwidth needed to read lips easily. So instead, I use a series of hacks or built-in tools to help me out by providing real-time speech-to-text.\n These hacks and tools work well, but sometimes they’ll cut out or they’ll lag and fall behind. And then simple things like someone asking for my thoughts on something can create awkward moments of silence before I realize that someone said my name, because I was relying on a transcript that was five seconds behind.\n  Thankfully, I have a wonderful, supportive team, and this has never been a problem in my day-to-day work.\n Our team has been growing quickly, expanding from just a single product manager to a team of eight product managers and designers, and we’re always thinking of ways to connect and support each other as a team. So when our VP of Product suggested an idea to help the team build empathy and better understand the video call experience from the perspective of someone relying on captions, we jumped on it.\n When we held our next product team sync, the whole team joined sans audio. We would all depend only on captions to follow the conversation.\n  Most exercises to simulate the experience of living with a disability aren’t effective—or even a good idea—because they can never truly simulate what it’s like to live day by day, and can leave folks with a mistaken idea of the experience.\n But this idea was compelling because the unique nature of the hacky setup I’m using means that it’s not about ability, it’s about technology. It wasn’t about learning what it’s like to do video calls with a hearing problem: it was about learning what it’s like to rely on captions for video calls.\n  The team was committed. Our meeting document was stuffed with meaningful topics that we wanted to cover, and we expected to use the full hour set aside for our sync.\n  We ended up using two different video calling platforms and two different approaches to captioning.\n The first attempt combined Zoom and Otter. Each person opened a browser window with the transcript, and located it somewhere on their screen so they could see the call along with the “captions.” This transcript didn’t include speaker names, so folks had to pay close attention to who was talking and map it to the transcript.\n This worked well until it didn’t. Within five minutes, the transcript lagged a good 5-10 seconds behind the conversation. In my own day-to-day setup, I often use multiple speech-to-text tools simultaneously for this exact reason, so I suggested we jump over to Google Meet, which has captions built right in.\n The team immediately spotted the tradeoffs: while Meet’s captions were built in, there’s no history, meaning each person had to dedicate their attention to the captions to make sure they didn’t miss anything. And there’s a few UI issues that create friction or interrupt the captions.\n But fundamentally, it worked. Everyone was able to participate in the call, and we had our sync.\n  The call was a startlingly effective team bonding experience. Everyone enjoyed and learned a lot from the experience of approaching the call with a different perceptual and technological context.\n  For me, it was fascinating to see how our interactions changed over the course of the call. Everyone became more expressive in physical space. The rhythm of conversation changed, from tentative, short sentences, to longer, well-thought-through blocks of thought. We discovered how difficult it was to go back and forth between speakers without the benefit of sound, and how important it was to give each other conversational space to join in. We discovered how hard it is to be heard.\n We also realized that some of the things we planned to discuss could be better covered asynchronously in a written-first format. This helped us focus the sync on the topics that actually called for synchronous conversation.\n As well, while the whole team enjoyed the experience, it was more draining—emotionally and mentally—for everyone, in part because of the constraints and demands placed on participants by the speech-to-text tools available to us today.\n In the week following the sync, I learned that many members of the product team, as well as some members of my broader team, were already making changes to how they approached video calls.\n Some folks are defaulting to Meet over Zoom, because they know captions are built-in, making the call more inclusive for everyone by default.\n Others shared that they’re trying to pause more, and be more conscious about how they phrase things to complete an idea in a whole sentence.\n  Even sentence structure has changed: others have started to say names at the beginning of a sentence, rather than at the end.\n Most compelling of all, many members of the team are now using captions on calls themselves—not because they need them, but to keep an eye on how what they’re saying is being received by others on the call who might be relying on them.\n Another member of our team shared a wonderful story of their own after reading this article:\n Incidentally, we did something almost exactly like this on my previous team! I hired an excellent engineer who was hard of hearing, and we were using Meet for captioning. After some hiccups and realizing that we had left that engineer behind a couple of times, we all decided to turn on captioning and to pay attention to it.\n It was great for giving us an idea of what our teammate was experiencing, but the most important thing was that it gave us a chance to correct ourselves when we “misspoke”—when the captioning said something other than what we’d intended. This way, we avoided putting the burden of deciphering onto the engineer who relied on the captions.\n This exercise reinforced on a very personal level how “ability” falls on a spectrum, and in line with inclusive design principles, how designing for the extremes of a spectrum of ability can benefit everyone.\n  While my own hearing loss is permanent, someone dealing with situational challenges like a flat wireless earbud, or temporary challenges, like an ear infection, can benefit from speech-to-text during video calls just as much as I do.\n Our team is working on universal code search for developers. Universal code search, to us, means creating inclusive experiences from the beginning, and always working to improve our baseline for accessibility.\n  Quinn Keast is a product designer at  Sourcegraph, a company specializing in universal code search. He is also cofounder of  Caribou, a design and strategy consultancy.", "posttime": "2020-10-31 03:29:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "接到,zoom,字幕", "title": "我是聋子，这就是当我接到变焦电话时会发生的事情", "title_en": "I’m deaf, and this is what happens when I get on a Zoom call", "transed": 1, "url": "https://www.fastcompany.com/90565930/im-deaf-and-this-is-what-happens-when-i-get-on-a-zoom-call", "via": "", "real_tags": ["接到", "zoom", "字幕"]}, {"category": "", "categoryclass": "", "imagename": "24f5ee8e405405bddf4968b8e8e78fd6.png", "infoid": 1032359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这里可以找到包含此文档的公关SWIFT并发路线图我们的目标是让SWIFT中的并发编程变得方便、高效和安全。本文档概述了通过实现异步函数和参与者对语言进行的一些建议的添加和更改，以实现这一点。这些增加将单独提出，但在许多情况下它们将相互依赖。本文档用于将它们结合在一起。与宣言不同的是，宣言可能会描述..。", "note_en": "A PR with this document can be found here   Swift Concurrency Roadmap Our goal is to make concurrent programming in Swift convenient, efficient, and safe.  This document outlines a number of proposed additions and changes to the language to achieve this, through the implementation of asynchronous functions and actors. These additions will be proposed separately, but they will in many cases depend on each other. This document serves to join them together. Unlike a manifesto, which might describe ...", "posttime": "2020-10-31 03:28:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "并发,concurrency,文档", "title": "SWIFT并发路线图", "title_en": "Swift Concurrency Roadmap", "transed": 1, "url": "https://forums.swift.org/t/swift-concurrency-roadmap/41611", "via": "", "real_tags": ["并发", "文档"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "格劳乔·马克思？弗雷德·韦林？埃德·加德纳？古德曼·艾斯？简·艾斯？弗雷德·艾伦？厄尼·科瓦奇？迪恩·邦德？匿名的？\n尊敬的引语调查员：近年来，剧本电视节目的数量急剧增加，赢得的喝彩也越来越多。然而，从最早的时候起，这种媒介就一直招致鄙视。以下是三个撕裂人的文字游戏的例子：\n调查员引述：QI已知的最早的比赛发生在1949年5月伊利诺伊州的“芝加哥星期日论坛报”。电视的简明定义出现在一个小盒子里。歌手兼演艺界名人弗雷德·韦林(Fred Wering)因这场文字游戏而获得赞誉。QI对摘录添加的重点：1。\n1949年10月，弗雷德·瓦林在一个名为“电台恶作剧袋”的辛迪加专栏中再次获得赞誉，该专栏转载了电台广播中的笑话：2。\n下一场比赛发生在1949年11月加州“旧金山考官”的一个娱乐专栏上。这句台词是由喜剧演员埃德·加德纳说的：3。\n口号：艾德·“阿奇”·加德纳在“达菲的酒馆”中说：“电视是一种媒介，如果做得好，那也是难得的。”\n1950年7月，这个笑话被归因于“轻松王牌”(Easy Aces)，这是一个长期播出的广播节目，在电视上复兴了很短一段时间。主要明星是古德曼·艾斯和简·艾斯夫妇。\n1950年11月，著名喜剧演员弗雷德·艾伦(Fred Allen)因其长期播出的电台节目而闻名，他因这个笑话而获得赞誉。艾伦是在NBC电视网一个新的高调电视节目“大节目”中说这句话的：5\n艾伦愉快地说，NBC已经在电台和电视上试用了他，现在正在等待另一种媒体的出现。“我已经决定了为什么他们称电视为媒介。因为上面没有做好的东西。“。\n大多数喜剧演员都同意弗雷德·艾伦的观点，即电视代表可怕的冒险。因为冒险让他们害怕。这只是因为它是新的，正如凯·凯瑟所说，这是一个“挑战”。\n但它并不像艾伦所坚持的那样被称为媒介，“因为没有什么是做得好的。”\n1953年，喜剧演员古德曼·艾斯给格劳乔·马克思写了一封信，艾斯用了这个笑话：\n要不是简和我和一个电视节目混在一起--或者我们在东部称之为电视--一个源自可怕的杂耍的巧妙缩写，我早在一年前就给你回信了。然而，这是我们最新的媒介--我们称它为媒介，因为没有什么东西做得很好。\n1958年，加拿大安大略省“渥太华公民”的一位专栏作家将这个笑话归因于一位匿名女子：8。\n还有一个女孩认为电视被称为“媒介”，因为它很少是稀有的或做得很好的！\n1960年，这个笑话出现在一幅名为“小莉兹”的单幅辛迪加漫画的标题中：\n电视被称为媒介，因为它的很多东西既不稀有，也不做得好。\n1967年，“读者文摘”(Reader‘s Digest Fun&Amp；LUMP；LUMP)合集将这句话归因于另一个人：10。\n电视之所以被称为媒介，是因为它很少是稀有的，也不是做得很好的。“天主教文摘”中的迪恩·邦德夫人。\n1973年，莱斯利·哈里韦尔(Leslie Halliwell)的“电影观众语录”将这个笑话归功于喜剧演员厄尼·科瓦奇(Ernie Kovacs)，他死于大约10年前的1962年：11。\n一种中号，之所以叫它，是因为它既不稀有，也不熟透。--厄尼·科瓦奇(Ernie Kovacs)。\n总而言之，从1949年开始，这个笑话被一系列喜剧演员和名人使用了几个月，然后又是几年。QI找到的第一个引文归功于弗雷德·韦林，但这个笑话可能是为他写的。许多表演者和笑话史密斯发现这种幽默足以让人无法抗拒，他们窃取并修改了台词。更早的引用可能会被未来的研究人员发现。\n图片笔记：来自Pixabay免费照片的老式电视图片。图像已被裁剪并调整大小。\n(特别感谢比尔·穆林斯，他找到了1949年5月15日和1950年7月30日的宝贵引文。此外，非常感谢Barry Popik从1950年11月9日开始查找引文的开创性工作。)\n更新历史：2019年7月25日，文章中添加了1949年10月9日、1949年11月22日和1950年7月30日的引文。2019年7月26日，增加了1949年5月15日的引文。\n1949年5月15日，芝加哥星期日论坛报(芝加哥论坛报)，定义(填充项)，第6部分，第2节，引文第2页，第5栏，芝加哥，伊利诺伊州。(ProQuest)↩。\n1949年10月9日，明尼阿波利斯星期日论坛报，版面：特写-新闻版面，文章：拉里·沃尔特斯(辛迪加)的电台恶作剧袋，引述明尼苏达州明尼阿波利斯第4页第8栏的话。(Newspers_Com)↩。\n1949年11月22日，“旧金山考官”，日日夜夜，广播电视，德怀特·牛顿著，引用加州旧金山第16页第8栏的话。(Newspers_Com)↩。\n1950年7月30日，“密尔沃基杂志”，部分：屏幕，广播，电视，文章：有趣的商业：广播和电视的笑声，引述，第10页，第3栏，威斯康星州密尔沃基。(GenealogyBank)↩。\n1950年11月8日，圣彼得堡时报，NBC对本尼的回答以约翰·克罗斯比(John Crosby)振奋人心的开头，引用佛罗里达州圣彼得堡第28页第6栏的话。(Newspers_Com)↩。\n1950年11月26日，“匹兹堡新闻、广播和电视：新闻与观点”(The Pittsburgh Press，Radio and Television：News&Amp；Views)，作者：Si Steinhauser，引用宾夕法尼亚州匹兹堡第64页第3栏的话。(Newspers_Com)↩。\n1967年，格劳乔·马克思的“格劳乔信件：格劳乔·马克思给格劳乔·马克思的信”，章节：触动电视，信给：格劳乔·马克思，信自：古德曼·王牌，(信未注明日期，放在1953年7月17日至1953年10月16日的信之间)，引述第114页，迈克尔·约瑟夫，伦敦。(通过扫描验证)↩\n1958年9月13日，“渥太华公民报”，被加拿大安大略省渥太华引用第6页第3栏的T.D.F.轻轻掠过。(Newspers_Com)↩。\n1960年1月5日，Messenger-Inquirer，小丽兹的说明(由NEA联合)，引用第4页，第6栏，肯塔基州欧文斯伯勒。(Newspers_Com)↩。\n1967年，“读者文摘”的乐趣和大笑：幽默的宝库，题目：“在空中”，引用第19页，“读者文摘协会”，纽约普莱森特维尔。(通过扫描验证)↩。\n1974年，莱斯利·哈里韦尔(Leslie Halliwell)的电影观众语录，主题：电视，引文第178页，(1973年版格拉纳达出版公司，伦敦)，阿灵顿出版社，新罗谢尔，纽约。(纸面验证)↩", "note_en": "Groucho Marx? Fred Waring? Ed Gardner? Goodman Ace? Jane Ace? Fred Allen? Ernie Kovacs? Deane Binder? Anonymous?\n Dear Quote Investigator: The number of scripted television shows has grown dramatically in recent years and so have the plaudits. Yet, from its earliest days the medium has always attracted scorn. Here are three examples of lacerating word play:\n   Quote Investigator: The earliest match known to  QI occurred in the “Chicago Sunday Tribune” of Illinois in May 1949. A concise definition of television appeared in a small box. The singer and show business personality Fred Waring received credit for the wordplay. Emphasis added to excerpts by  QI:   1\n   In October 1949 Fred Waring received credit again in a syndicated column called “Radio Gag Bag” which reprinted jokes from radio broadcasts:   2\n  The next match occurred in an entertainment column of “The San Francisco Examiner” of California in November 1949. The line was delivered by the comic actor Ed Gardner:   3\n TAG LINES: Ed “Archie” Gardner on “Duffy’s Tavern”— “Television is a medium where if anything is well done, it’s rare.”\n In July 1950 the joke was ascribed to “Easy Aces” which was a long running radio program revived for a short period on television. The main stars were the couple Goodman Ace and Jane Ace:   4\n  In November 1950 the prominent comedian Fred Allen known for his long-running radio show received credit for the joke. Allen delivered the line during a new high-profile TV program from the NBC network called “The Big Show”:   5\n Allen remarked pleasantly that NBC had tried him on radio and tried him on television and was now waiting for another medium to come along.  “I’ve decided why they call television a medium. It’s because nothing on it is well done.”\n  Most of the comedians agree with Fred Allen that tv stands for terrible venture. Because the venture frightens them. That’s only because its new and as Kay Kyser says, a “challenge.”\n But it isn’t called a  medium as Allen insists  “because nothing is well done.”\n In 1953 comedian Goodman Ace wrote a letter to Groucho Marx, and Ace employed the jest:   7\n I would have answered your letter of a year or so ago, much sooner, had it not been that Jane and I got mixed up with a television show—or as we call it back east here, TV—a clever contraction derived from the words Terrible Vaudeville. However, it is our latest medium—we  call it a medium because nothing’s well done.\n In 1958 a columnist in “The Ottawa Citizen” of Ontario, Canada attributed the joke to an anonymous woman:   8\n And then there’s the gal who thinks  TV is called a “medium” because so little of it is either rare or well done!\n In 1960 the jest appeared in the caption of a one-panel syndicated cartoon called “Little Liz”:   9\n TV is called a medium, because so much of it is neither rare nor well done.\n In 1967 the collection “Reader’s Digest Fun &amp; Laughter” ascribed the remark to yet another person:   10\n Television is called a medium because so little of it is either rare or well-done. Mrs. Deane Binder in Catholic Digest\n In 1973 “The Filmgoer’s Book of Quotes” by Leslie Halliwell credited the joke to comedian Ernie Kovacs who had died about a decade earlier in 1962:   11\n A medium, so called because it is neither rare nor well done. – Ernie Kovacs\n In conclusion, the joke was employed by a series of comedians and personalities over a period of months and then years beginning in 1949. The first citation located by  QI credited Fred Waring, but the joke may have been written for him to deliver. Many performers and joke smiths found the humor irresistible enough to purloin and modify the line. Earlier citations may be uncovered by future researchers.\n Image Notes: Image of old-fashioned television from Free-Photos at Pixabay. Image has been cropped and resized.\n (Special thanks to Bill Mullins who located the valuable citations dated May 15, 1949 and July 30, 1950. Also, many thanks to  Barry Popik for his pioneering work locating citations starting on November 9, 1950.)\n Update History: On July 25, 2019 citations dated October 9, 1949; November 22, 1949; and July 30, 1950 were added to the article. On July 26, 2019 the citation dated May 15, 1949 was added.\n 1949 May 15, Chicago Sunday Tribune (Chicago Tribune), Definition (Filler item), Part 6, Section 2, Quote Page 2, Column 5, Chicago, Illinois. (ProQuest)  ↩\n 1949 October 9, Minneapolis Sunday Tribune, Section: Feature-News Section, Article: Radio Gag Bag by Larry Walters (Syndicated), Quote Page 4, Column 8, Minneapolis, Minnesota. (Newspapers_com)  ↩\n 1949 November 22, The San Francisco Examiner, Day and Night with Radio and Television by Dwight Newton, Quote Page 16, Column 8, San Francisco, California. (Newspapers_com)  ↩\n 1950 July 30, he Milwaukee Journal, Section: Screen, Radio, Television, Article: Funny Business: Radio and Television Chuckles, Quote Page 10, Column 3, Milwaukee, Wisconsin. (GenealogyBank)  ↩\n 1950 November 8, St. Petersburg Times, NBC’s Answer To Benny Gets Off To Rousing Start by John Crosby, Quote Page 28, Column 6, St. Petersburg, Florida. (Newspapers_com)  ↩\n 1950 November 26, The Pittsburgh Press, Radio and Television: News &amp; Views by Si Steinhauser, Quote Page 64, Column 3, Pittsburgh, Pennsylvania. (Newspapers_com)  ↩\n 1967, The Groucho Letters: Letters From and To Groucho Marx by Groucho Marx, Chapter: Touching on Television, Letter To: Groucho Marx, Letter From: Goodman Ace, (Letter is undated; it is placed between letters dated July 17, 1953 and October 16, 1953), Quote Page 114, Michael Joseph, London. (Verified with scans)  ↩\n 1958 September 13, The Ottawa Citizen, Once Over Lightly by T.D.F., Quote Page 6, Column 3, Ottawa, Ontario, Canada. (Newspapers_com)  ↩\n 1960 January 5, Messenger-Inquirer, Caption of Little Liz (Syndicated by NEA), Quote Page 4, Column 6, Owensboro, Kentucky. (Newspapers_com)  ↩\n 1967, Reader’s Digest Fun &amp; Laughter: A Treasure House of Humor, Topic: Up in the Air, Quote Page 19, The Reader’s Digest Association, Pleasantville, New York. (Verified with scans)  ↩\n 1974, The Filmgoer’s Book of Quotes by Leslie Halliwell, Topic: Television, Quote Page 178, (Reprint of 1973 edition Granada Publishing, London), Arlington House, New Rochelle, New York. (Verified on paper)  ↩", "posttime": "2020-10-31 03:28:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程度,medium,电视", "title": "它之所以叫中等程度，是因为它既不是半熟的，也不是熟透的", "title_en": "It's called Medium because it's neither rare nor well done", "transed": 1, "url": "https://quoteinvestigator.com/2019/07/24/tv/", "via": "", "real_tags": ["程度", "medium", "电视"]}, {"category": "", "categoryclass": "", "imagename": "0d19c31a8bf9f929e78fd0d8c84aecfd.png", "infoid": 1032357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们，NumFOCUS行为准则执行委员会，就我们对JupyterCon 2020报告的处理向杰里米·霍华德公开道歉。我们应该做得更好。我们感谢您分享您的经验，我们将利用它来改进我们未来的政策。\n我们承认，这是一次极其紧张的经历，在一个星期过去了，在不知道投诉性质的情况下，被传唤与一个委员会的几名成员进行面谈。我们对造成这种压力表示歉意，并将努力改进我们的流程，以避免这种情况在未来发生。\n为了澄清我们负责的一个严重的沟通错误：在面谈时，委员会并未确定存在违反行为准则的行为，只是确定有两起投诉已提交并正在审查中。我们很抱歉没有从一开始就清楚地传达这一点。我们并没有建议采取任何执法行动。我们要求推迟将谈话发布到JupyterCon共享空间，直到投诉得到解决。我们现在意识到，在讨论投诉时，我们使用了过度收费的语言，并误解了调查阶段，即说发生了违规行为。我们应该更清楚地说，已经接到多起投诉，所谓的违规调查尚未解决。\n由于该委员会的失误，我们已要求NumFOCUS董事会接管执行指南上诉程序中概述的该委员会的工作。", "note_en": "We, the NumFOCUS Code of Conduct Enforcement Committee, issue a public apology to Jeremy Howard for our handling of the JupyterCon 2020 reports. We should have done better. We thank you for sharing your experience and we will use it to improve our policies going forward.\n We acknowledge that it was an extremely stressful experience, being summoned to an interview with several members of a committee, after a week had passed, and without knowing the nature of the complaint. We apologize for causing this stress and will work to improve our process to avoid this from happening in the future.\n To clarify a crucial miscommunication that we take responsibility for: At the time of the interview, the committee had not determined that there was a violation of the code of conduct, only that there were two complaints filed and being examined. We apologize for not communicating that clearly from the beginning. We have not recommended any enforcement actions. We had asked to postpone the posting of the talk to the JupyterCon shared space until the complaints are resolved. We realize now that we used overly charged language and miscommunicated the stage of the investigation when discussing the complaints, i.e. saying a violation occurred. We should have been clearer saying multiple complaints have been made and the alleged violation investigation had not been resolved.\n Because of the missteps of this committee, we have asked the NumFOCUS Board of Directors to take over the work of the committee as outlined in the appeals process of our enforcement guide.", "posttime": "2020-10-31 03:28:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "霍华德,apology,投诉", "title": "向杰里米·霍华德公开道歉", "title_en": "Public Apology to Jeremy Howard", "transed": 1, "url": "https://numfocus.org/blog/jeremy-howard-apology", "via": "", "real_tags": ["霍华德", "apology", "投诉"]}, {"category": "", "categoryclass": "", "imagename": "6260df4e0511ff761f7be6159156bd04.jpg", "infoid": 1032356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在今天的数字时代，有时感觉硬件已经退居次要地位，而不是驱动我们设备的软件。BUTTON of the Month是一个每月专栏，探讨我们每天与之交互的手机、平板电脑和控制器的物理部件。\n你的iPhone上个月换了个新按钮，你可能还没注意到。\n不，苹果不会偷偷溜进你家，偷偷把一个按钮粘在你的智能手机上。但它确实发布了iOS14，这是其iPhone软件的最新版本，其中包括一项名为Back Tap的功能。Back Tap为您的手机添加了一个迷人的新“按钮”，模糊了硬件和软件之间的界限。\nBack Tap将iPhone的整个背面变成一个巨大的触敏按钮，您可以双击或三次点击来触发手机上的特定功能。你很可能还没有注意到这一点。苹果将Back Tap的设置滑入其可访问性菜单。\n其预期目的是为用户提供更多与其设备交互的选择。Back Tap的大多数选项都反映了这一点，通过设置可以打开应用程序切换器、通知菜单或控制中心；滚动应用程序或网页；触发Siri；或者截屏。\n但Back Tap也与苹果令人难以置信的强大快捷键应用程序捆绑在一起，这意味着你可以有效地让这些新按钮做你能想象到的几乎任何事情。这是一种令人着迷的按钮：肉眼完全看不见，在通过软件启用之前完全不起作用，但只需快速点击一下，就可以在智能手机上打开、交互或完成几乎任何任务。\n软件定制是关键。很容易想象这样一个世界，苹果将Tap限制为只有几个预置选项，专注于让iPhone UI更容易访问。但通过向快捷方式开放，该公司将Tap重新变成了一个拥有无限创造力的工具，让用户想出自己的方式来利用设备背面的新按钮。\n(不仅仅是苹果。谷歌在Android 11上试验了一个类似的功能，尽管更加有限，尽管它最终没有进入最终阶段。自那以后，一些有进取心的开发人员已经在任何Android设备上复制了这一功能。)\n这也是iOS设备几乎闻所未闻的控制级别。想象一下，如果苹果允许你重新映射iPhone12上的侧键(用于Siri和Apple Pay)，比如启动谷歌助手或向你的伴侣发送一条预设的短信。这几乎是不可想象的。\n它也运行得很好。这款软件反应灵敏，无论苹果公司做了什么来区分故意轻拍和只是定期拿着手机，它都运行得很好。我发现它对于触发控制中心快速切换系统设置特别有用。\nBack Tap使用软件重新调整iPhone上现有传感器和硬件的用途，以创建以前不可用的新硬件交互。这是一个新的物理按钮，用户可以与之交互-但几乎完全不受苹果的限制。\n当然，物理按钮是最直接的交互形式。这就是为什么三星坚持使用定制的Bixby按钮，也是Netflix为你的Roku遥控器上的一个位置付费的原因。虽然苹果可能不太愿意放弃对iPhone物理按键的控制，但Back Tap-几乎是按键-是第二好的选择。", "note_en": "In today’s digital age, it sometimes feels like hardware has taken a back seat to the software that drives our devices. Button of the Month is a monthly column that explores the physical pieces of our phones, tablets, and controllers that we interact with every day.\n Your iPhone got a new button last month, and you may not have even noticed.\n No, Apple didn’t sneak into your house and secretly superglue a button onto your smartphone. But it did release iOS 14, the latest version of its iPhone software, which includes a feature called Back Tap. Back Tap adds a fascinating new “button” to your phone that blurs the line between hardware and software.\n Back Tap turns the entire back of your iPhone into a giant touch-sensitive button that you can double or triple tap to trigger specific functions on your phone. There’s a good chance that you haven’t noticed it yet. Apple slipped the settings for Back Tap into its Accessibility menu.\n   Its intended purpose is to give users more options for interacting with their devices. Most of Back Tap’s options reflect that, with settings to open the app switcher, notification menu, or control center; scroll through an app or webpage; trigger Siri; or take a screenshot.\n But Back Tap also ties into Apple’s incredibly robust Shortcuts app, which means you can effectively make those new buttons do  almost anything you can imagine. It’s a fascinating kind of button: entirely invisible to the naked eye, completely nonfunctional until it’s enabled through software, but can be tasked to open, interact with, or accomplish nearly any task on your smartphone with just a quick tap.\n  That software customization is key. It’s easy to imagine a world where Apple limited Back Tap to just a few preset options focused on making the iPhone UI more accessible. But by opening it up to Shortcuts, the company turned Back Tap into a tool of limitless creativity, letting users come up with their own ways to take advantage of the new button on the back of their devices.\n (It’s not just Apple. Google experimented with a similar, albeit more limited, feature for Android 11, although it didn’t end up making the final cut. Some enterprising developers have since  replicated the feature for any Android device.)\n   This is also a level of control that’s almost unheard of for iOS devices. Imagine if Apple let you remap the side button (for Siri and Apple Pay) on an iPhone 12 to, say, launch Google Assistant or send a preset text message to your partner. It’s practically unthinkable.\n It works well, too. The software is responsive, and whatever Apple’s doing to differentiate between an intentional tap and just regularly holding your phone, it works well. I’ve found it particularly useful for triggering Control Center to quickly toggle system settings.\n  Back Tap repurposes the existing sensors and hardware on your iPhone with software to create a new hardware interaction that wasn’t available before. It’s a new physical button users can interact with — but one that’s almost completely free of Apple’s limitations.\n Physical buttons, of course, are the most direct form of interaction. It’s why Samsung insists on a bespoke Bixby button and why Netflix pays for a spot on your Roku remote. And while Apple may not quite be willing to give up control of the physical buttons on your iPhone, Back Tap — with its almost button — is the next best thing.", "posttime": "2020-10-31 03:28:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,iphone,added,按钮", "title": "苹果在你的iPhone上添加了一个秘密按钮，而你可能甚至没有注意到", "title_en": "Apple added a secret button to your iPhone, and you may not have even noticed", "transed": 1, "url": "https://www.theverge.com/21540028/apple-iphone-ios-14-back-tap-hidden-secret-button-gesture", "via": "", "real_tags": ["apple", "苹果", "iphone", "added", "按钮"]}, {"category": "", "categoryclass": "", "imagename": "a8be9f0d50699c418dd2165e0feb16c1.jpg", "infoid": 1032355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一种撒网的食人魔脸蜘蛛。CBG摄影组，生物多样性基因组学中心/CC BY-SA 3.0。\n就在万圣节前夕，康奈尔大学的科学家们发表了一些可怕的研究，特别是如果你是一只昆虫的话！\n周四发表在“当代生物学”上的这项研究得出结论说，这种名字可怕的食人魔脸蜘蛛可以用它的腿听到，并用这种能力捕捉在它后面飞行的昆虫。\n没有参与这项研究的康奈尔大学名誉教授查尔斯·沃尔科特博士告诉“康奈尔纪事报”，蜘蛛对空气中的声音很敏感。这才是真正重要的信息。\n正如研究合著者康奈尔大学博士后研究员杰伊·斯塔夫斯特罗姆在一段视频中解释的那样，这种网播的食人魔脸蜘蛛(Deinopis Spinosa)有一种独特的狩猎策略。\n它们只在夜间使用一种特殊的网捕猎：由非粘性丝绸制成的A型框架，支撑着一个模糊的长方形，它们用前前腿抓住这个长方形，用来诱捕猎物。\n他们通过两种方式做到这一点。在一种叫做向前打击的动作中，他们向下扑向地面上移动的猎物。这是因为它们的大眼睛是所有蜘蛛中最大的。“科学”解释说，这些眼睛给它们的夜视能力是我们的2000倍。\n不过，斯塔夫斯特罗姆解释说，蜘蛛还可以做一种叫做“向后击球”的动作，在这个动作中，它们把腿伸到身后，抓住在空中飞来飞去的昆虫。\n于是，一只会飞的虫子来了，蜘蛛不知何故获得了有关声音方向和距离的信息。如果苍蝇在它的捕获区内，蜘蛛就会计算出200毫秒的跳跃时间-很像是越过肩膀捕捉。蜘蛛得到了它的猎物。文理学院神经生物学和行为系D&D Joslovitz Merksamer教授罗纳德·霍伊(Ronald Hoy)告诉“康奈尔纪事报”(Cornell Chronicle)说，它们是准确的，合著者罗纳德·霍伊(Ronald Hoy)是文理学院神经生物学和行为系的乔斯洛维茨·默克萨默教授。\n研究人员想要了解的是，当蜘蛛没有耳朵时，它们是如何分辨出在它们身后移动的是什么。\n这不是周边视力的问题。“科学”杂志解释说，在2016年的一项研究中，同一个团队蒙住了蜘蛛的眼睛，让它们出去狩猎。这阻止了蜘蛛向前攻击，但它们仍然能够使用向后攻击来捕捉猎物。研究人员认为，这些蜘蛛是在听到它们的猎物，它们的腿尖上有传感器。所有的蜘蛛都有这些传感器，但科学家们之前认为它们只能探测到表面的振动，而不是空气中的声音。\n为了测试食人魔脸蜘蛛的实际听力有多好，研究人员进行了一个由两部分组成的实验。\n首先，他们将电极插入被移除的蜘蛛腿和完好蜘蛛的大脑。他们把蜘蛛和蜘蛛的腿放在一个防震的隔间里，并在两米(大约6.5英尺)外播放声音。蜘蛛和腿对100赫兹到10,000赫兹的声音都有反应。\n接下来，他们播放了对野外的25只蜘蛛和实验室的51只蜘蛛产生最大反应的五种声音。超过一半的蜘蛛在听到类似于昆虫翅膀节拍的低频声音时会做出向后攻击的动作。当播放较高频率的声音时，蜘蛛没有移动。这表明，较高的频率可能模仿了鸟类等捕食者的声音。\n辛辛那提大学蜘蛛行为生态学家乔治·尤茨告诉“科学”杂志，这一结果令人惊讶，表明科学对蜘蛛整体上还有很多需要研究的地方。因为所有蜘蛛的腿上都有这些感受器，所以有可能所有蜘蛛都能听到。据《康奈尔纪事报》报道，这一理论最早是由沃尔科特在60年前提出的，但当时遭到驳斥。但自那以后，对其他蜘蛛的研究又发现了进一步的证据。2016年的一项研究发现，一种跳蛛可以接收空气中的声波振动。\n尤茨告诉“科学”杂志，我们对蜘蛛知之甚少。它们比人们想象的要复杂得多。\n斯塔夫斯特罗姆告诉CNN，了解更多信息为科学家提供了一个研究他们的感觉能力的机会，以便改进生物传感器、定向麦克风和视觉处理算法等技术。\n他告诉CNN，重点是任何一个未被研究、未被赏识的群体都有令人着迷的生活，即使是一只讨厌的蜘蛛，我们也能从中学到一些东西。", "note_en": "A net-casting ogre-faced spider.  CBG Photography Group, Centre for Biodiversity Genomics /   CC BY-SA 3.0\n Just in time for Halloween,  scientists at Cornell University have published some frightening research, especially if you&#39;re an  insect!\n The ghoulishly named ogre-faced spider can &#34;hear&#34; with its legs and use that ability to catch insects flying behind it, the study published in  Current Biology Thursday concluded.\n &#34;Spiders are sensitive to airborne sound,&#34; Cornell professor emeritus Dr. Charles Walcott, who was not involved with the study, told the  Cornell Chronicle. &#34;That&#39;s the big message really.&#34;\n The net-casting, ogre-faced spider (Deinopis spinosa) has a unique hunting strategy, as study coauthor Cornell University postdoctoral researcher Jay Stafstrom explained in a video.\n  They hunt only at night using a special kind of web: an A-shaped frame made from non-sticky silk that supports a fuzzy rectangle that they hold with their front forelegs and use to trap prey.\n They do this in two ways. In a maneuver called a &#34;forward strike,&#34; they pounce down on prey moving beneath them on the ground. This is enabled by their large eyes — the biggest of any spider. These eyes give them 2,000 times the night vision that we have,  Science explained.\n But the spiders can also perform a move called the &#34;backward strike,&#34; Stafstrom explained, in which they reach their legs behind them and catch insects flying through the air.\n &#34;So here comes a flying bug and somehow the spider gets information on the sound direction and its distance. The spiders time the 200-millisecond leap if the fly is within its capture zone – much like an over-the-shoulder catch. The spider gets its prey. They&#39;re accurate,&#34; coauthor Ronald Hoy, the D &amp; D Joslovitz Merksamer Professor in the Department of Neurobiology and Behavior in the College of Arts and Sciences, told the Cornell Chronicle.\n What the researchers wanted to understand was how the spiders could tell what was moving behind them when they have no ears.\n It isn&#39;t a question of peripheral vision. In a 2016 study, the same team blindfolded the spiders and sent them out to hunt, Science explained. This prevented the spiders from making their forward strikes, but they were still able to catch prey using the backwards strike. The researchers thought the spiders were &#34;hearing&#34; their prey with the sensors on the tips of their legs. All spiders have these sensors, but scientists had previously thought they were only able to detect vibrations through surfaces, not sounds in the air.\n To test how well the ogre-faced spiders could actually hear, the researchers conducted a two-part experiment.\n First, they inserted electrodes into removed spider legs and into the brains of intact spiders. They put the spiders and the legs into a vibration-proof booth and played sounds from two meters (approximately 6.5 feet) away. The spiders and the legs responded to sounds from 100 hertz to 10,000 hertz.\n Next, they played the five sounds that had triggered the biggest response to 25 spiders in the wild and 51 spiders in the lab. More than half the spiders did the &#34;backward strike&#34; move when they heard sounds that have a lower frequency similar to insect wing beats. When the higher frequency sounds were played, the spiders did not move. This suggests the higher frequencies may mimic the sounds of predators like birds.\n University of Cincinnati spider behavioral ecologist George Uetz told Science that the results were a &#34;surprise&#34; that indicated science has much to learn about spiders as a whole. Because all spiders have these receptors on their legs, it is possible that all spiders can hear. This theory was first put forward by Walcott 60 years ago, but was dismissed at the time, according to the Cornell Chronicle. But studies of other spiders have turned up further evidence since. A 2016 study found that a kind of jumping spider can pick up sonic vibrations in the air.\n &#34;We don&#39;t know diddly about spiders,&#34; Uetz told Science. &#34;They are much more complex than people ever thought they were.&#34;\n Learning more provides scientists with an opportunity to study their sensory abilities in order to improve technology like bio-sensors, directional microphones and visual processing algorithms, Stafstrom  told CNN.\n  &#34;The point is any understudied, underappreciated group has fascinating lives, even a yucky spider, and we can learn something from it,&#34; he told CNN.", "posttime": "2020-10-31 03:28:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "需求,worldwide,蜘蛛", "title": "随着石油需求下降，埃克森美孚将在全球范围内裁员1.4万人", "title_en": "Exxon to Slash 14,000 Jobs Worldwide as Oil Demand Drops", "transed": 1, "url": "https://www.ecowatch.com/exxon-job-cuts-2648560659.html", "via": "", "real_tags": ["需求", "worldwide", "蜘蛛"]}, {"category": "", "categoryclass": "", "imagename": "2b7081061e44733001fb96bd936f3de8.jpg", "infoid": 1032354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从麦当劳到谷歌的人物：凯尔西·海托华如何成为云计算领域最受尊敬的人之一。\n凯尔西·海托华是一位自学成才的技术专家，拥有讲故事的嗓音，她挑战了企业技术部门臭名昭著的多样性问题，成为该行业的领军人物之一。现在他希望每个人的声音都能被听到。\n那是2016年3月，库伯内斯的盛会KubeCon第一次来到了伊达的家乡伦敦。海托华是Kubernetes的实际发言人，当时Kubernetes正成为企业技术领域的一股力量，他在活动上发表了讲话。\n作为一名经验丰富的工程师，伊达在YouTube上观看了海托华的许多演讲和演示，试图学习木偶和库伯内斯等新技能。现在，他想让他的儿子约万尼见见海托华，让他们看到像他们一样的黑人可以成为这个领域的领导者，这个领域已经成为现代经济背后的驱动力。\n我告诉他的是，当我第一次看到他的视频时，它触动了我的心弦，以一种我意想不到的方式触动了我，伊达告诉礼宾。真正让我吃惊的是，我从来不知道我需要它。因为我很自信；我不知道我需要见一个长得像我的人[领导那些讨论]。\n现在，Google Cloud的首席工程师HighTower是云计算和开源软件中最突出和最受尊敬的面孔之一。几年来，他一直是企业技术活动中最受欢迎的演讲者之一，他将令人敬畏的自学技术印章与讲故事的人的声音结合在一起。\n他还在企业基础设施技术领域脱颖而出，成为为数不多的黑人男性之一，这个群体的成员认为，在臭名昭著的同质化科技行业中，他们是一个更白的领域。出于应该很清楚的原因，他在这一领域获得突出地位的道路要艰难得多。\n他到那里不是偶然的。VMware的首席工程师、HighTower的朋友布莱恩·莱尔斯(Bryan Liles)说，黑人不可能是偶然来到这里的。作为一名科技行业的黑人工程师，莱尔斯也曾处理过种族主义问题。他补充说，我们不是在斯坦福附近长大的，他强调了这所独一无二的硅谷大学在推出谷歌和许多科技职业方面所发挥的作用。\n现年39岁的海托华在Docker和Kubernetes开源社区及其周边地区相当出名，因为这些技术在过去十年的中期出现，但他在2017年5月的一次技术会议上的一次演讲真正吸引了人们的注意，他打破了通常的高度技术性演示的模式，讲述了自己的人生故事。\n一年前，他与现在为后起之秀HashiCorp工作的伊达短暂相遇，给人留下了相当深刻的印象。\n海托华回忆说，他正在看YouTube，试图弄明白所有这些新东西。这就是这个长得跟他一模一样的家伙。我知道我在说什么，其他人也说他知道他在说什么。他告诉他的儿子，他只是想让他知道，我们不仅被允许参加活动，我们还可以领导他们。\n他的童年早期是在长滩度过的，但他的母亲在离婚后决定搬回家乡亚特兰大的家人和朋友那里，就在海托华即将进入高中的时候。在那之前，运动一直是他的痴迷，但他决定，他可能应该找一份工作来帮忙做家务，并支付自己的衣服。\n他开始在麦当劳工作，每小时挣4.15美元，每周工作近40个小时，大部分在周末。他在16岁时很快被提升为轮班经理，在那里他有权告诉其他员工，他们什么时候可以在清闲的夜晚打卡下班。每次轮班前，他都会从他家步行两英里到餐厅。\n儿时的朋友罗尼·乔丹(Ronnie Jordan)回忆道，他们让那个地方运转得有条不紊。他很早就想出了如何更有效率地做事情。\n海托华也是一名优秀的学生。他说，在克莱顿州立大学(Clayton State University)短暂停留了一段时间后，那里的技术课程或多或少地美化了Microsoft Word教程，他意识到自己需要一个更大的挑战。他参加了由CompTIA赞助的认证课程，获得了A+认证，这使他在19岁时获得了贝尔南方公司的一份DSL安装技术员的工作。\n在我12年级的时候，我说过，你知道吗，也许科技是一件事，对吧？你现在看到的是比尔·盖茨和史蒂夫·乔布斯的故事，他们没有上过大学。你知道，世界上最富有的人没有上过大学，海托华说。\n正是在21世纪初为贝尔南方公司工作期间，海托华有一段经历将塑造他的余生，他在2017年那次关键的演讲中讲述了这个故事。\n他被派到亚特兰大一个不错的社区去安装标准的DSL。当他走进家时，他意识到顾客是一个知名人士；他是一名建筑师和城市规划师，海托华正在安装互联网连接的办公室的墙上排列着他和几位美国总统的照片。\n这位顾客当即宣布从未有黑人踏进过他的房子，这让海托华感到震惊。但你是现在唯一能给我这项技术的人，他记得那个人说过，所以我要把这一切放在一边，因为你有一些我没有的东西。\n在这一点上，我有点想通了：这套特殊的技能就是我的超人套装，海托华说。当我穿着带工具袋的有领衬衫时，人们会因为我的才华而尊重我，而忽略了其他的东西。在这一点上，我多少知道，技术是一种我能做到的超级赋权、公平竞争的技能。\n在本世纪初，海托华作为贝尔南方公司的独立承包商工作了几年后，他意识到自己非常擅长这份工作。客户开始要求他提供超出通常技术员职责范围的帮助，比如为一家小企业建立网络。\n在某种程度上，他突然意识到，他可能会为自己工作赚更多的钱。在他20岁出头的时候，他开始了自己的IT顾问业务，最终雇佣了其他人为他工作，并在佐治亚州琼斯伯勒开了一家商店。\n事实上，如果用一个词来形容HighTower职业生涯的这一阶段，那就是在经营自己的企业几年后，他实际上短暂地在谷歌(Google)以及后来的佐治亚州金融软件公司道达尔系统(Total Systems)(现在名为TSYS，由Global Payments所有)担任了一份低级别的技术工作。\n除了这些角色，几年来他还涉足了一场演唱会，教会了他很多关于在舞台上、处理压力和赚钱的重要性的知识。\n罗尼·乔丹(Ronnie Jordan)在当地亚特兰大的开放麦克风喜剧场景中获得了一些关注，这时他和海托华意识到，他可能真的有一个让人发笑的未来。两人开始密切合作，开始一起表演，海托华-乔丹认识的唯一有一辆可靠汽车的人-开始开车带他去镇上不同的演唱会。\n当海托华意识到乔丹不仅可以在住宅区喜剧角(可以说是当时南方最有影响力的黑人喜剧俱乐部之一)驱散人群，而且他还可以让人们在吉利安(Jillian&#39；s)大笑起来，这是一个类似于戴夫与巴斯特(Dave&Buster)的郊区景点，受到白人的青睐，他知道乔丹有潜力。\n他设立了一个工作室，乔丹可以在那里练习他的表演。他拍摄了这一行为并将其发布在网络上，当时几乎没有人理解网络将不得不启动娱乐业的潜力。他还鼓励乔丹试演一个美国偶像风格的喜剧节目，该节目由喜剧之王系列的幕后团队于2004年制作。\n乔丹最终进入决赛，并在纽约麦迪逊广场花园35000人面前表演。他在激烈的竞争中获胜，获得3.5万美元-当然，减去HighTower的管理费。\n由于他的表演，乔丹收到了其他艺人的邀请，希望在全国各地的演出中开幕，但他仍然只认识一个人，有一辆可靠的车。海托华和乔丹开着雪佛兰郊区的一场又一场的演出横穿全国，即使在那些长途旅行中，海托华也抽出时间更多地了解了他在计算机科学领域萌芽中的职业生涯。\n乔丹说，他总是在巴诺书店(Barnes&Noble)停下来，为一项新兴技术拿到一些新的认证证书。在一场流行病减少了各种表演者的机会期间，乔丹继续从事喜剧业务。他能在一个晚上读完一整本书。\n他说：在娱乐业，你的报酬取决于你的观感。我想这就是我所学到的；这不是关于工作，而是关于我给工作带来了什么。\n与此同时，HighTower开始在亚特兰大开源社区引起人们的注意，这要归功于Python Meetups上的一系列演讲，当时他引起了基础设施管理先驱Puppet Labs的工程经理詹姆斯·特恩布尔(James Turnbull)的注意。\n特恩布尔对海托尔和他在道达尔系统公司的同事使用木偶、Python和一些优秀的老式黑客来改变道达尔系统公司在其服务器上部署软件更改的方式感到震惊。\n这是真正的影子IT，埃尔森·罗德里格斯(Elson Rodriguez)说，他是HighTower‘s在道达尔系统公司(Total Systems)的同事，也是他的老朋友。这家金融服务公司仍然依赖大型机，并要求员工通宵工作，以手动部署Word文档中的更改，这与HighTower和Rodriguez并非如此。因此，他们在下班后一起工作，自动部署这些变化，尽管内部存在障碍，罗德里格斯(罗德里格斯自己当时承认)过于固执的态度，最终在每次推出新软件时都为公司节省了无数个小时。\n罗德里格斯说，他的乐观简直是疯了。他是幸运的，因为有些人很乐观，没有精力去看到底，没有精力去接受这些教训。他会说一些疯狂的事情，也会尝试一些疯狂的事情，当事情没有解决时，他不会太沮丧，他只是从中吸取教训，然后继续前进。\n海托华应邀来到位于俄勒冈州波特兰的木偶公司总部，在该公司一年一度的开发者活动期间，在包括创始人兼首席执行官卢克·凯尼斯在内的全公司面前发表演讲。木偶最终为当时的系统管理员HighTower提供了一份面向客户的软件工程师的工作。\n我的猜测是，我们不能说出我们雇佣的其他同一职位的人的名字，凯尼斯告诉礼宾。他很善于与人打交道，但他更善于谈论事情，或者解释客户如何使用木偶的技术来解决他们的问题，他说。\n2013年，在亚特兰大远程工作了几个月后，海托华搬到了波特兰，这个地方在地理上、文化上和种族上都和美国的亚特兰大相去甚远。海托华在波特兰的日子还早些时候，就有人提醒他，作为一家非常白人的科技公司里唯一的黑人男性是什么感觉。\n当时，木偶决定建立一个名为“锻造”(Forge)的数字中心，员工、客户和开源贡献者可以在这里共享木偶代码包。作为从系统管理员到软件开发人员过渡的一部分，HighTower最终成为负责这项工作的团队的负责人。\n木偶的个别团队会给自己起有趣或聪明的名字；例如，致力于将木偶迁移到Windows的团队因获胜而被称为。一位木偶高级管理人员建议，海托华领导的团队应该命名为Geordi La Forge。\n如果你不熟悉这个名字，就像海托华当时的名字一样，你应该知道，在20世纪80年代末的电视连续剧“星际迷航：下一代”(Star Trek：The Next Generation)中，Geordi La Forge是企业号剧组中唯一的黑人成员，这部电视剧在X世代白人科技工作者中非常受欢迎。\n我实际上去了我的桌面，我开始搜索他的名字，它就像，等一下！这是“星际迷航”中唯一的黑人工程师！比如，你们是怎么给我的团队起这个名字的？海托华一边笑着回忆着。当时他泰然处之，甚至将他在推特上的头像改为这个人物的照片，以调整他的新同事，让他们最初感到紧张，因为他们冒犯了他。\n海托华和凯尼斯回忆起这个故事时都很幽默，而且这个名字的提出者似乎没有任何恶意。但是，凯尼斯承认，大约八年前，“微进动”这个词还没有被广泛理解。\n凯尼斯说：如果你当时回到我身边，我会说我对总体上的挣扎知之甚少。\nHighTower感谢他在Puppet的时间，这将他介绍给了更广泛的技术观众，让他更密切地参与了开源社区，并开始了他成为云巡回演讲者中更受欢迎的演讲者之一的道路。\n但在2014年左右，他意识到，Puppet当时的主要业务-向运营自己数据中心的公司销售配置管理软件-即将因基础设施技术的两项突破而发生转变：Go编程语言和Docker Containers。\n回到谷歌，该公司一直在改进围棋，将其作为当时使用最广泛的基础设施语言之一C++背后的概念的现代更新。像Rust，另一种大约在这个时候开发的编程语言，Go简化了一些任务，使程序员更难犯导致安全漏洞的内存处理错误。\n长期以来，容器一直是Unix和Linux的一部分，允许开发人员将应用程序转换为可移植的软件包，以便更快、更容易地跨不同类型的服务器(包括内部服务器和云服务器)进行部署。然而，在2013年，Docker引入了一种用户友好的方式来利用容器技术，需求呈爆炸式增长：Docker Containers成为记忆中采用最快的新企业技术之一，尽管该公司一直举步维艰，但这项技术支撑着现代的原生云运动。\n海托华从听到这个概念的那一刻起就被它迷住了。如果我们把抽象改为更少关于Linux和各种编程语言，改成称为容器的东西，会怎么样？这确实激起了我的兴趣，海托华说。我知道我想朝那个特定的方向前进。\n在波特兰一家名为季风商业的初创公司短暂工作后，他编写了他的第一个开源项目，一个名为ConfD的配置管理工具，2014年初，他加入了另一家名为CoreOS的初创公司。CoreOS开发了与Docker竞争的容器格式，并最终成为Kubernetes的关键贡献者，Kubernetes是一个诞生于谷歌的开源容器管理项目，将改变HighTower的生活。\n海托华说：我不是CoreOS的创始人，但我扮演的角色对公司的成功起到了非常重要的作用。我认为这在某种程度上巩固了我作为一个人的能力，无论环境如何，我都有能力做出改变。\nHighTower在CoreOS呆了两年多一点(该公司后来在2018年被IBM以2.5亿美元收购)，学习了运营企业技术业务所需的条件。\n在那段时间里，HighTower拥抱了Kubernetes，周游世界，在大大小小的开发者大会上发表演讲，宣传这个项目。除了联合创始人乔·贝达(Joe Beda)、布兰登·伯恩斯(Brendan Burns)和克雷格·麦卢基(Craig McLuckie)之外，他很快成为该项目最知名的面孔之一，该项目很快就获得了皈依者，认为这是大规模管理大型集装箱集群的最佳方式。\nHighTower最终与Beda和Burns合作出版了一本名为Kubernetes Up and Running的书，这本书于2017年出版，将他介绍给更广泛的技术受众，为Kubernetes成为集装箱时代最有影响力的开源项目之一和现代科技基础设施的关键构件奠定了基础。\n贝达说，整个库伯内斯和云计算的旅程充满了惊人的戏剧性，它考验了我们所有人。贝达现在是VMware的首席工程师，当他在伦敦遇到伊达时，他碰巧站在HighTower旁边。在所有这一切中，凯尔西超越了它，一直是一个直言不讳的人，这给我留下了难以置信的印象。\n起初，海托华并不完全确定是否要加入谷歌，尽管库伯内斯社区的一些著名成员恳求他加入谷歌。该项目起源于谷歌，但作为云本地计算基金会(Cloud Native Computing Foundation)的一部分，它发展迅速。云本地计算基金会由谷歌和其他合作伙伴于2015年8月创建，是Linux基金会的一个子集。\n2015年，他与美国国家航空航天局(NASA)位于南加州的喷气推进实验室(Jet Propusion Laboratory)的成员就可能在那里担任的职位进行了谈判，由于担心被关进盒子里，他对加入谷歌犹豫不决。他说：我从来没有遇到过任何一家公司，能够让一个人在人力资源、定义明确的工作定义之外做他们自己。\n海托华实际上拒绝了谷歌三次，但正如他后来了解到的那样，谷歌当然可以买得起很多东西。\n他说，谷歌刚刚经历了一个竞争激烈的故事，是长期的。我和美国宇航局的团队谈过，他们说，凯尔西，我们要花10年时间才能到达火星，可能更久。去谷歌看看。如果它不起作用，我们将很高兴你来到美国宇航局。\n海托华于2015年11月正式加入谷歌，五年后，它对双方都非常有利。\n这家公司在崛起期间建造了一些世界上最令人印象深刻的分布式计算架构，但它一直难以与普通云计算买家产生共鸣，因为他们不需要按照谷歌的方式行事。伴随着严肃的技术技能，HighTower为所有云供应商雇佣的开发者关系角色带来了更人性化的触觉，以努力让普通工程师对他们的服务感到兴奋。现在，他的大部分时间都花在与客户交谈，弄清楚他们真正需要从云提供商那里得到什么，并将这些见解带回产品开发团队，以改善谷歌的服务。\n加州大学伯克利分校(University Of California At Berkeley)教授、谷歌(Google)基础设施副总裁埃里克·布鲁尔(Eric Brewer)表示，HighTower的做法是超级真实的，这肯定会有所帮助。布鲁尔补充说：“凯尔西和我有一个共同点，那就是我们不是靠权威来领导的。”我没有直接下属，他也没有直接下属；我们靠影响力领导，这是一项很难培养的技能。\n在谷歌这样的公司里，这尤其困难，因为它拥有世界级的人才在解决该行业一些最棘手的问题。\n在大学橄榄球比赛中，你有海斯曼获胜者，但当你去NFL时，你又是一个新秀。海托华说，当你去谷歌时，仅仅是他们在处理大问题方面的丰富经验，你就必须努力工作才能有创意。\n海托华也在。\n.", "note_en": "People  From McDonald’s to Google: How Kelsey Hightower became one of the most respected people in cloud computing\n A self-taught technologist with a storyteller&#39;s voice, Kelsey Hightower defied the enterprise tech sector&#39;s notorious diversity problems to become one of the industry&#39;s leading figures. Now he wants everyone&#39;s voice to be heard.\n     It was March 2016, and the Kubernetes jamboree, KubeCon, was coming to Idah&#39;s hometown of London for the first time. Hightower, the de facto spokesperson for Kubernetes just as it was emerging as a force in enterprise tech, was speaking at the event.\n Idah had watched many of Hightower&#39;s talks and demonstrations on YouTube, as a veteran engineer trying to learn new skills like Puppet and Kubernetes. Now, he wanted his son Jovanni to meet Hightower, to see that Black people like themselves could be leaders in a field that has become the driving force behind the modern economy.\n  &#34;What I told him was, the first time I saw his video, it struck a chord in me that just touched me in a way I didn&#39;t expect,&#34; Idah told Protocol. &#34;What was really surprising to me was that I never knew I needed that. Because I was confident; I didn&#39;t know I needed to see somebody who looked like me [leading those discussions].&#34;\n  Now, Hightower, principal engineer for Google Cloud, is one of the most prominent and respected faces in cloud computing and open-source software. He has been one of the most popular speakers at enterprise tech events for several years, marrying formidable self-taught technical chops to a storyteller&#39;s voice.\n He also stands out as one of the few Black men in enterprise infrastructure tech, a group whose members feel is an even whiter domain within the notoriously homogenous tech industry. For reasons that should be clear, his path to a prominent role in this field has been that much harder.\n  &#34;He didn&#39;t get there by accident. There&#39;s no way a Black guy got there by accident,&#34; said Bryan Liles, a principal engineer at VMware and a friend of Hightower&#39;s who has also dealt with issues of racism as a Black engineer in the tech industry. &#34;We didn&#39;t grow up near Stanford,&#34; he added, underscoring the role that the exclusive Silicon Valley university played in launching Google and many a tech career.\n Hightower, 39, was fairly well-known in and around the Docker and Kubernetes open-source communities as those technologies emerged around the middle of the last decade, but really caught people&#39;s attention with  a talk at a tech conference in May 2017, in which he broke from the usual pattern of highly technical how-to presentations to tell his life story.\n  His brief encounter a year earlier with Idah, who now works for rising enterprise star HashiCorp, had left quite an impression.\n &#34;He&#39;s watching YouTube trying to figure out all this new stuff,&#34; Hightower recalled. &#34;And here&#39;s this guy that looks exactly like him. And I know what I&#39;m talking about, and other people say he knows what he&#39;s talking about. And he told his son that he wanted just to show him that not only are we allowed to attend the event, we can lead them.&#34;\n   He spent his early childhood in Long Beach, but his mother decided to move back to family and friends in their hometown of Atlanta following a divorce, right as Hightower was entering high school. Sports had been his obsession up until that point, but he decided he should probably get a job to help out around the house and pay for his own clothes.\n He began working at McDonald&#39;s, earning $4.15 an hour working nearly 40 hours a week, mostly on the weekends. He was quickly promoted to shift manager at the age of 16, where he had the authority to tell other workers when they could clock out on slow nights, and walked the two miles from his house to the restaurant before every shift.\n &#34;They had that place working like clockwork,&#34; recalled Ronnie Jordan, a childhood friend. &#34;He figured out how to do stuff way more efficient early.&#34;\n   Hightower was also an excellent student. After a brief stint at Clayton State University, where he said the technology classes were more or less glorified Microsoft Word tutorials, he realized he needed a bigger challenge. He enrolled in certification classes sponsored by CompTIA to get his A+ certification, which led to a job as a DSL installation technician for Bell South at the age of 19.\n &#34;In my 12th-grade year I said, you know what, maybe this technology thing is a thing, right? You&#39;re looking at the stories of Bill Gates and Steve Jobs, they didn&#39;t go to college. You know, the richest man in the world didn&#39;t go to college,&#34; Hightower said.\n It was while working for Bell South in the early 2000s that Hightower had an experience that would shape the rest of his life, a story he told in that pivotal 2017 talk.\n He was dispatched to a nice neighborhood in Atlanta for a standard DSL installation. When he entered the home, he realized the customer was someone prominent; he was an architect and city planner, with pictures of himself and several U.S. presidents lining the walls of the office where Hightower was installing the internet connection.\n The customer shocked Hightower by declaring right away that a Black person had never stepped foot inside his house. &#34;But you&#39;re the only person that can give me this technology right now,&#34; he remembered the man saying, &#34;so I&#39;m going to put all that aside, because you have something that I don&#39;t.&#34;\n  &#34;And at that point, it kind of clicked for me: This particular skill set was my Superman suit,&#34; Hightower said. &#34;When I&#39;m wearing the collared shirt with the tool bag, people will respect me for my talents and look past the other stuff. I kind of knew at that point that technology was this super empowering, leveling-the-playing-field skill that I could do.&#34;\n  After working as an independent contractor for Bell South for a few years in the early 2000s, Hightower realized that he was pretty good at this job. Customers began asking him for assistance that went beyond the scope of the usual technician&#39;s role, like setting up a network for a small business.\n And at a certain point it dawned on him that he could probably make more money working for himself. In his early 20s, he started a solo practice as an IT consultant, eventually hiring others to work for him and opening up a store in Jonesboro, Georgia.\n Indeed, if there&#39;s a word to characterize this stage of Hightower&#39;s career, it&#39;s &#34;hustle.&#34; After running his own business for a few years, he actually briefly took a low-level tech job at Google and later the Georgia-based financial software company Total Systems (now named TSYS and owned by Global Payments).\n And alongside those roles, for several years he also dabbled with a gig that taught him a lot about being onstage, dealing with pressure and the importance of getting paid.\n    Ronnie Jordan was getting some attention in the local Atlanta open-mic comedy scene when he and Hightower realized he might actually have a future making people laugh. The two began to work closely together on an act, and Hightower — the only person Jordan knew with a reliable car — started driving him around to different gigs around town.\n When Hightower realized that not only could Jordan slay the crowds at the  Uptown Comedy Corner — arguably one of the most influential Black comedy clubs in the South at that time — but that he could also make people howl with laughter at Jillian&#39;s, the suburban Dave-and-Buster&#39;s-like attraction favored by white people, he knew Jordan had potential.\n He set up a studio where Jordan could practice his act. He filmed that act and posted it on the web, at a time when very few people understood the potential the web would have to launch entertainment careers. And he encouraged Jordan to try out for an &#34;American Idol&#34;-style comedy show produced by the team behind the &#34;Kings of Comedy&#34; series in 2004.\n Jordan wound up making the finals and performing before 35,000 people at New York&#39;s Madison Square Garden. He won among strong competition and got $35,000 — minus Hightower&#39;s management fee, of course.\n  As a result of his performance, Jordan received offers from other acts to open at shows across the country, but he still only knew one guy with a reliable car. Hightower and Jordan drove across the country from gig to gig in a Chevy Suburban, and even during those long trips, Hightower found time to learn more about his budding career in computer science.\n &#34;He was always stopping at a Barnes and Noble&#34; to pick up some new certification book for a nascent technology, said Jordan, who  continues to practice comedy during a pandemic that has curtailed opportunities for performers of all kinds. &#34;He would read a whole book in one night.&#34;\n  &#34;In the entertainment business, you get paid based on perception,&#34; he said. &#34;And I think that&#39;s what I learned; it&#39;s not about the job, it&#39;s about what I bring to the job.&#34;\n  Meanwhile, Hightower was starting to get noticed in the Atlanta open-source community thanks to a series of talks at Python meetups when he caught the attention of James Turnbull, an engineering manager for infrastructure management pioneer Puppet Labs.\n Turnbull was struck by the way Hightower and his colleagues at Total Systems were using Puppet, Python and some good old-fashioned hacking to transform how Total Systems deployed software changes to its servers.\n &#34;This was real shadow IT,&#34; said Elson Rodriguez, a colleague of Hightower&#39;s at Total Systems and longtime friend. The financial services company still relied on mainframes and required employees to work overnight to deploy changes manually out of a Word document, which didn&#39;t sit right with Hightower and Rodriguez. So they worked together after hours to automate the deployment of those changes, and, despite internal obstacles and Rodriguez&#39;s (by his own admission, at the time) overly headstrong attitude, eventually saved the company countless hours each time new software rolled out.\n  &#34;His optimism is just crazy,&#34; Rodriguez said. &#34;He&#39;s lucky, because some people are optimistic and don&#39;t have the energy to see it through and process those lessons. He talks some crazy stuff, and tries some crazy stuff, and doesn&#39;t get too upset when it doesn&#39;t work out, he just draws a lesson from it and moves on.&#34;\n Hightower was invited out to Puppet&#39;s headquarters in Portland, Oregon, to give a talk during the company&#39;s annual developer event in front of the whole company, including founder and CEO Luke Kanies. Puppet wound up offering Hightower, at the time a systems administrator, a job as a customer-facing software engineer.\n &#34;My guess is we can&#39;t name anybody else we hired in that same position,&#34; Kanies told Protocol. &#34;He was great with people, but he was so much greater at talking about things,&#34; or explaining how customers could use Puppet&#39;s technology to solve their problems, he said.\n   After a few months of working remotely from Atlanta in 2013, Hightower made the cross-country move to Portland, a place about as geographically, culturally and racially removed from Atlanta as you can get in the U.S. It was early in his Portland days when Hightower got a reminder of what it was like to be the only Black man in a very white tech company.\n At the time Puppet decided to build a digital hub called The Forge, where employees, customers and open-source contributors could share packages of Puppet code. As part of his transition from system administrator to software developer, Hightower wound up as the leader of the team responsible for this effort.\n Individual teams at Puppet would give themselves funny or clever names; the team working on migrating Puppet to Windows was called &#34;For the Win,&#34; as an example. One senior Puppet executive suggested that the team Hightower led should be named &#34;Geordi La Forge.&#34;\n  If you&#39;re unfamiliar with that name, as Hightower was at the time, know that  Geordi La Forge was the only Black member of the crew of the Enterprise in &#34;Star Trek: The Next Generation,&#34; a late 1980s television series that was incredibly popular with white Generation X tech workers.\n &#34;I actually go to my desktop, and I start searching for his name and it&#39;s, like, wait a minute! This is the only Black engineer on &#39;Star Trek&#39;! Like, how did y&#39;all pick that name for my team?&#34; Hightower remembered, laughing as he did. At the time he took it in stride, even changing his Twitter profile picture to a picture of the character to tweak his new colleagues, making them initially nervous that they had offended him.\n  Both Hightower and Kanies recalled the story with humor, and it doesn&#39;t appear that there was any ill will on the part of the executive who suggested the name. But the term &#34;microagression&#34; was not as widely understood eight or so years ago, Kanies allowed.\n &#34;If you&#39;d gone back to me at that time, I&#39;d say I was much less aware of the struggles in general,&#34; Kanies said.\n  Hightower is grateful for his time at Puppet, which introduced him to a much wider tech audience, got him involved more closely with the open-source community, and started him down the path toward becoming one of the more sought-after speakers on the cloud circuit.\n But around 2014, he realized that Puppet&#39;s main business at the time — selling configuration management software to companies running their own data centers — was about to be transformed by two breakthroughs in infrastructure technology: the Go programming language and Docker containers.\n Back at Google, the company had been refining Go as a modern update to the concepts behind C++, one of the most widely used infrastructure languages at that time. Like  Rust, another programming language developed around this time, Go simplified some tasks and made it harder for programmers to make memory-handling mistakes that cause security holes.\n  Containers have been part of Unix and Linux for a long time, allowing developers to turn applications into portable packages for faster, easier deployment across different types of servers, both in-house and on the cloud. However, in 2013, Docker introduced a user-friendly way to take advantage of container technology, and demand exploded: Docker containers became one of the  fastest-adopted new enterprise technologies in memory, and,  while the company has struggled, the technology underpins the modern &#34;cloud native&#34; movement.\n Hightower was fascinated by the concept from the moment he heard about it. &#34;What if we changed the abstractions to be less about Linux and various programming languages to this thing called containers? That really piqued my interest,&#34; Hightower said. &#34;I knew that I wanted to head in that particular direction.&#34;\n  After a brief stint at a Portland startup called Monsoon Commerce where he wrote his first open-source project, a configuration management tool called  Confd, he joined another startup called CoreOS in early 2014. CoreOS developed a rival container format to Docker&#39;s and wound up becoming a key contributor to Kubernetes, the open-source container-management project born out of Google that would change Hightower&#39;s life.\n &#34;I wasn&#39;t a founder of CoreOS, but I played a role that became very instrumental to the company&#39;s success,&#34; Hightower said. &#34;I think that kind of cemented me as an individual, my ability to make change no matter the environment.&#34;\n  Hightower stayed at CoreOS for a little over two years (the company was later acquired in 2018 by IBM for $250 million), learning what it took to run an enterprise technology business.\n During that time, Hightower embraced Kubernetes, traveling the world speaking at developer conferences large and small evangelizing this project.  Outside of co-founders Joe Beda, Brendan Burns and Craig McLuckie, he quickly became one of the most recognizable faces of the project, which was quickly gaining converts as the best way to manage large clusters of containers at scale.\n Hightower wound up collaborating with Beda and Burns on a book called &#34; Kubernetes Up and Running,&#34; which was published in 2017 and introduced him to a wider technical audience, setting the stage for Kubernetes to become one of the most influential open-source projects of the container era and a key building block for modern tech infrastructure.\n &#34;The whole Kubernetes and cloud-native journey has been full of an amazing amount of drama, it&#39;s tested all of us,&#34; said Beda, now a principal engineer at VMware who happened to be standing next to Hightower in London when he encountered Idah. &#34;And through all of this, I&#39;ve been incredibly impressed with Kelsey rising above it and really consistently being a stand-up person.&#34;\n  At first Hightower wasn&#39;t entirely sure about joining Google, despite entreaties from some prominent members of the Kubernetes community. The project originated at Google, but it grew quickly as part of the Cloud Native Computing Foundation, created in August 2015 by Google and other partners as a subset of  the Linux Foundation.\n  In 2015, he was in talks with members of NASA&#39;s Jet Propulsion Laboratory in Southern California involving a possible role there, and he hesitated about joining Google because of &#34;the fear of being put in a box. I had never met any company that could afford to let someone be who they were outside of a HR, well-defined job definition,&#34; he said.\n Hightower actually rejected Google three times, but as he would come to learn, Google, of course, can afford lots of things.\n &#34;Google just had such a competitive story, long term,&#34; he said. &#34;I talked to the NASA team, and they said, &#39;Look, Kelsey, it&#39;s going to take us 10 years to get to Mars, probably longer. Go to Google. If it doesn&#39;t work, we&#39;ll be happy to have you here at NASA.&#39;&#34;\n Hightower officially joined Google in November 2015, and five years later, it&#39;s working out pretty well for both parties.\n The company, which built some of the most impressive distributing computing architecture in the world during its rise to prominence, has  struggled to empathize with the average cloud buyer, who doesn&#39;t need to do things Google&#39;s way. Along with serious technical skills, Hightower brought a more human touch to the developer relations role that all cloud vendors employ in an effort to get rank-and-file engineers excited about their services. Now, he spends most of his time talking to customers, figuring out what they really need from their cloud provider, and bringing those insights back to the product development team to improve Google&#39;s services.\n   Eric Brewer, a professor at the University of California at Berkeley and vice president of infrastructure at Google, says that Hightower&#39;s approach is &#34;super authentic,&#34; which surely helps. &#34;One thing Kelsey and I share is that we are not leading by authority,&#34; Brewer added. &#34;I have no direct reports, he has no direct reports; we are leading by influence, and that is a difficult skill to develop.&#34;\n That&#39;s especially difficult inside a company like Google, which has world-class talent working on some of the industry&#39;s most difficult problems.\n &#34;In college football, you&#39;ve got the Heisman winners, but when you go to the NFL, you&#39;re a rookie all over again. When you go to Google, just the sheer amount of experience they have with large problems, you have to work hard to be creative,&#34; Hightower said.\n Hightower has also played a prominent role in the\n......", "posttime": "2020-10-31 03:27:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,mcdonald,海托华", "title": "从麦当劳到谷歌", "title_en": "From McDonald's to Google", "transed": 1, "url": "https://www.protocol.com/kelsey-hightower-google-cloud", "via": "", "real_tags": ["google", "谷歌", "mcdonald", "海托华"]}]