[{"category": "", "categoryclass": "", "imagename": "3ea0c9576e3a440924153598ae6f2d84.jpg", "infoid": 1031636, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一款新的Mac正在酝酿中，它将在苹果硅(Apple Silicon)上运行--苹果正在用这个名字来形容其定制的基于ARM的芯片，并将在未来两年内过渡到这种芯片。该公司已经确认，第一款ARM Mac将在2020年底之前发布--所以我们应该很快就会看到第一款ARM MacBook或Mac，事实上有传言称，新款Apple Silicon MacBook将在11月的一场活动上发布。\n这款新的arm Mac看起来可能会采用Mac mini的形式，因为已经有苹果硅版的Mac mini可供开发人员用于测试-事实上，我们很快就会看到这款产品的消费者版本。然而，有传言称，第一款Silicon Mac将是一款新的MacBook，类似于苹果在2019年7月停产的12英寸MacBook。\n其他传言指出，MacBook Air和13英寸MacBook Pro也将很快推出苹果版本的ARM处理器。\n在这篇文章中，我们将调查苹果公司开始在其Mac电脑中使用自己的基于ARM的SoC而不是英特尔芯片的计划。我们将调查有关苹果硅片发布日期的传言，预计将是第一款使用苹果新处理器的MacBook的细节，以及这可能对其图形功能意味着什么。\n我们还将评估这款新的Mac是否能够同时运行iOS和MacOS。\n苹果已经确认，首款ARM/Silicon Mac将在2020年底之前上市。如果你想知道第一款Apple Silicon Mac或MacBook什么时候发布，那么你就是在正确的地方找到答案！\n我们认为，第一款采用苹果硅处理器的Mac将是12英寸的MacBook。大约在同一时间，我们认为苹果还将更新MacBook Air和13英寸的MacBook Pro--尽管12英寸的MacBook实际上取代13英寸的MacBook Pro是可行的。我们预计推出的情况是这样的：\n至于我们什么时候可能看到第一款搭载ARM处理器的Mac或MacBook，似乎很可能会在11月份发布--事实上，泄密者乔恩·普罗瑟(Jon Prosser)预计2020年11月17日。\n彭博社(Bloomberg)的马克·古尔曼(Mark Gurman)在10月9日的一篇文章中也暗示，苹果将在11月推出新的Mac电脑。格鲁曼写道，除其他产品外，首款搭载苹果自有处理器的Mac笔记本电脑将在11月的另一场发布会上亮相。\n对于首款硅片MacBook没有出现在苹果10月13日的发布会上，我们并不感到惊讶。我们认为，新款Mac需要的播放时间会超过这次以iPhone12为主题的发布会所允许的时间。\n早在2020年7月，推特用户小宫(Komiya)曾建议，新ARM MacBook的价格将为849美元-学生价格为799美元。\n在7月24日的一条推文中，Ihacktu(又名iHacktu Pro)声称一台新的Silicon MacBook只需800美元。他还建议，10月27日将有一场Mac活动。他的推文很快就被删除了。\n在同一条推文中，Ihacktu还建议一款新的硅片13英寸MacBook Pro起价1099美元(目前为1299美元)。更多信息请点击这里：Silicon MacBook可能于10月27日发布，售价800美元。\n从理论上讲，自己制造处理器可能意味着苹果可以省钱，并将节省的资金转嫁给消费者。\n然而，当苹果推出一款新产品时，价格往往会上涨，这是经常发生的事情。因此，第一代Apple Silicon MacBook的价格实际上可能比前几代更高。\n然而，我们认为，在这种情况下，苹果将希望使升级对消费者具有吸引力，因此我们预计价格将与现在类似。\n苹果公司宣布，它将不再使用Mac电脑内置的英特尔处理器，转而使用自己的自制处理器--苹果硅(Apple Silicon)。你可能听说过它们被称为ARM处理器，这是因为它们背后的架构被称为ARM。苹果制造自己的处理器已经有一段时间了--每一款iPhone、iPad和许多其他苹果产品都内置了苹果处理器。事实上，一些Mac电脑已经内置了苹果处理器-T1和T2是基于ARM的安全相关芯片，出现在各种Mac电脑中。\n这并不是苹果第一次进行这样的转变，在2006年，它就从PowerPC芯片转向了英特尔。就像当时的情况一样，这一最新举措不会在一夜之间发生，幕后将涉及大量工作，不仅对苹果，对需要翻译应用程序以在新架构上运行的开发人员也是如此(尽管最初应用程序将使用苹果的Rosetta系统自动翻译)。我们这里有你需要知道的所有关于苹果硅片的信息。您可能还会有兴趣在这里阅读有关Apple Silicon将如何与英特尔进行比较的内容。\n除了这款新Mac内置的苹果处理器外，我们还能看到哪些规格呢？\n这是可能的，这些第一批使用Apple Silicon的Mac不会以任何其他方式改变-例如，我们可能会看到相同的RAM和存储分配。\n小宫还在2020年8月的以下推文中泄露了苹果Silicon MacBook的细节：\nMacBook Apple Silicon RAM 8 GB、16 GB固态硬盘256 GB、512 GB、(1 TB)12英寸视网膜显示屏15小时~20小时电池续航时间720P Facetime高清摄像头单USB-C端口约2个池子第四代蝴蝶键盘849美元~(学生799美元~)。\n-Komiya(@komiya_kj)2020年8月29日。\n他建议，新款MacBook将配备A14X芯片、8 GB和16 GB内存，以及256 GB到512 GB的存储空间。最令人印象深刻的声明是：电池续航时间长达20小时。\n以消费者为中心的Mac电脑的规格与面向专业用户-尤其是专业创意人士-的规格非常不同。硅谷Mac的GPU配置是最明显的问题，也是专业用户最担心的问题。我们在这里详细介绍了苹果的硅谷图形计划。\n不过，目前大多数消费者Mac电脑都集成了英特尔显卡。新款Apple Silicon MacBook将提供哪些图形功能？\n苹果在WWDC上告诉开发者，Apple Silicon Mac将配备定制的Apple GPU。在一份开发者支持文档中，苹果建议不要低估集成的苹果GPU，称：不要认为独立的GPU意味着更好的性能……。苹果处理器中的集成GPU针对高性能图形任务进行了优化。\n至少对于消费者Mac来说，使用苹果集成的GPU是有意义的，这对公司来说不应该是一个巨大的飞跃-苹果已经为iPhone和iPad制造了自己的GPU。\n然而，当涉及到专业型Mac时，例如那些目前使用AMD GPU的Mac，过渡将更加复杂。该公司可能会继续使用这些高端图形处理器。或者，这也可以解释为什么iMac和其他专业型台式机和笔记本电脑不会很快过渡到Apple Silicon。\n当苹果能够在其Mac电脑中使用Apple Silicon时，它可能会为Mac上的面部识别铺平道路。在Big Sur测试版中有证据表明，TrueDepth摄像头将成为MacBook系列的一项功能，支持面部识别。\n我们知道第一批Apple Silicon Mac将运行MacOS Big Sur-这是为这两种Mac开发的操作系统。然而，这些新的硅谷Mac电脑将能做很多英特尔同行做不到的事情。\nWWDC的主题演讲建议，在新的硅片驱动的Mac上运行iOS应用程序将是可能的。\n这意味着开发者不必为Mac和iOS/iPad OS开发不同版本的应用程序--一个应用程序可以在所有平台上运行。\n这让我们想起了2018年5月9to5Mac的一份报告，该报告披露了一个代号为Apple Star的内部项目的细节，该项目暗示，苹果正在开发一款基于ARM的处理器，将用于一个全新的设备系列，该系列将在Mac上运行iOS的衍生品。\n据9to5Mac称，该项目与一款产品有关，该产品有触摸屏、SIM卡插槽、GPS、指南针，而且是防水的，而且还可以运行EFI，据9to5Mac介绍，这款产品拥有触摸屏、SIM卡插槽、GPS和指南针，而且还可以运行EFI。EFI(可扩展固件接口)是Mac使用的引导系统。\n如果这台新的Apple Silicon Mac有触摸屏，那不是很好吗？说到这一点，这就是我们认为苹果需要触摸屏Mac的原因。", "note_en": "A new Mac is in the pipeline and it will run on Apple Silicon - that&#39;s the name Apple is using for its custom-made ARM-based chips that it will be transitioning to over the next two years. The company has confirmed that the first ARM Mac will launch before the end of 2020 - so we should see the first ARM MacBook or Mac soon, in fact there are rumours that the new Apple Silicon MacBook will launch at an  event in November.\n  It might seem likely that this new ARM Mac would take the form of the Mac mini since there is already an Apple Silicon version of the Mac mini that is available to developers for testing purposes - and indeed we could soon see a consumer version of this. However, the rumours are pointing to the  first Silicon Mac being a new MacBook, similar to the 12in MacBook that Apple discontinued in July 2019.\n  Other rumours point to the MacBook Air and the 13in MacBook Pro also getting Apple&#39;s version of an ARM processor soon.\n  In this article we&#39;ll look into Apple&#39;s plans to start using its own ARM-based SoCs rather than Intel chips in its Macs. We&#39;ll examine the Apple Silicon release date rumours, details of the MacBook that is expected to be the first to use Apple&#39;s new processors, and what it might mean for its graphics capabilities.\n  We&#39;ll also assess whether this new Mac could be capable of running both iOS and macOS.\n    Apple has confirmed that the first ARM/Silicon Mac will arrive before the end of 2020. If you are wondering when that first Apple Silicon Mac or MacBook will launch you are in the right place to find out!\n  We think that the first Mac to get an Apple Silicon processor will be the 12in MacBook. Around the same time we think Apple will also update the MacBook Air and the 13in MacBook Pro - although it&#39;s feasible that the 12in MacBook will actually replace the 13in MacBook Pro. We anticipate the roll out being something like this:\n    As for when we are likely to see those first Mac or MacBook with ARM-based processor it seems likely that it will launch in November - in fact leaker  Jon Prosser is predicting  17 November 2020.\n      In a 9 October article Bloomberg&#39;s Mark Gurman also  suggested Apple will launch its new Macs in November. &#34;The first Mac laptop with Apple&#39;s own processor, among other products, will emerge at another launch in November,&#34; wrote Gruman.\n  We weren&#39;t surprised that the first Silicon MacBook didn&#39;t put in an appearance at Apple&#39;s 13 October event, we thought that the  new Mac would require more &#39;air time&#39; than this iPhone 12-focused event would allow.\n    Back in July 2020 tweeter Komiya suggested that the price of the new ARM MacBook would be $849 - with a $799 price for students.\n      In a tweet on 24 July, Ihacktu (aka iHacktu Pro) claimed that a new Silicon MacBook would cost just $800. He also suggested that there would be a Mac event on 27 October. His tweet was deleted soon after.\n  In the same tweet Ihacktu also suggested that a new Silicon 13in MacBook Pro would start at $1,099 (it&#39;s currently $1,299). More information here:  Silicon MacBook could launch on 27 October and cost $800.\n  Making its own processors in house could theoretically mean that Apple can save money and pass the saving onto consumers.\n  However, it&#39;s often the case that when Apple introduces a new product the price goes up. So the first generation Apple Silicon MacBooks could actually cost more than their predecessors.\n  However, we think that in this instance Apple will want to make the upgrade attractive to consumers and for that reason we expect that the pricing will be similar to what it is now.\n    Apple has announced that it will be moving away from Intel processors inside its Macs to its own home-made processors - called Apple Silicon. You may have heard them referred to as ARM processors, that&#39;s because the architecture that underlies them is known as ARM. Apple&#39;s been making its own processors for a while now - every iPhone, iPad, and many other Apple products have Apple processors inside. Indeed, some Macs already have an Apple processor inside - the T1 and T2 are ARM-based security related chips that appear in various Macs.\n  This won&#39;t be the first time Apple has made such a transition, in 2006 it moved from PowerPC chips to Intel. Just as was the case back then, this latest move won&#39;t happen overnight and there will be a lot of work involved behind the scenes, not just for Apple but also for developers who will need to translate their apps to run on the new architecture (although initially apps will be automatically translated using Apple&#39;s Rosetta system). We have  everything you need to know about Apple Silicon here. You might also be interested to read about  how Apple Silicon will compare to Intel here.\n      Aside from the Apple Processor inside this new Mac, what other specs can we expect to see?\n  It&#39;s possible that these first Macs to use Apple Silicon will not change in any other way - we may see the same RAM and storage allocation for example.\n  Komiya has also leaked details of the Apple Silicon MacBook in the below tweet from August 2020:\n  MacBook Apple Silicon  RAM 8GB,16GB SSD 256GB,512GB,(1TB) 12” Retina Display  15hr~20hr battery life 720p Facetime HD Camera  Single USB-C port About 2 ponds 4th gen Butterfly Keyboard $849~(For Students: $799~)\n — Komiya (@komiya_kj)  August 29, 2020\n    He suggests that the new MacBook will feature a A14X chip, 8GB and 16GB of RAM, and between 256GB to 512GB storage. The most impressive claim: battery life of up to 20 hours.\n    The specs of consumer focused Macs are very different to those destined for professional users - especially professional creatives. The GPU provision of Silicon Macs is the most obvious question - and the biggest concern for professional users. We have details of  Apple&#39;s Silicon graphics plans here.\n  However, most consumer Macs currently have integrated Intel graphics. What graphics will the new Apple Silicon MacBook offer?\n  Apple told developers at WWDC that Apple Silicon Macs will sport custom Apple GPUs. In a developer support document Apple advises not to underestimate an integrated Apple GPU, saying: &#34;Don&#39;t assume a discrete GPU means better performance... The integrated GPU in Apple processors is optimized for high performance graphics tasks.&#34;\n  At least for consumer Macs using an Apple integrated GPU would make sense, and it shouldn&#39;t be a huge leap for the company - Apple already makes its own GPUs for the iPhone and iPad.\n  However, when it comes to pro focused Macs, such as those that currently use AMD GPUs the transition will be more complex. The company may continue to use these high-end graphics processors. Alternatively, this may also explain why the iMac and other pro-focused desktops and laptops won&#39;t be transitioning to Apple Silicon soon.\n      When Apple is able to use Apple Silicon inside its Macs it may pave the way for  Face ID on the Mac. There is evidence in the Big Sur beta that the TrueDepth camera is going to become a feature of the MacBook range, enabling Face ID.\n    We know that the first Apple Silicon Macs will run macOS Big Sur - the operating system that is being developed for both types of Mac. However, there is a lot that these new Silicon Macs will be able to do that their Intel counterparts won&#39;t.\n  The WWDC keynote suggested that it will be possible to run iOS apps on the new Silicon-powered Mac.\n  This means that developers won&#39;t have to develop separate versions of their apps for Mac and iOS/iPad OS - one app could work on all platforms.\n  This reminds us of a 9to5Mac  report back in May 2018 that revealed details of an in-house project as Apple codenamed &#39;Star&#39; that suggested that Apple was creating an ARM-based processor to be used in a &#34;brand-new device family&#34; that would run a derivative of iOS on a Mac.\n  That &#39;Star&#39; project related to a product with that has &#34;a touchscreen, a SIM card slot, GPS, compass, is water-resistant and also runs EFI,&#34; according to 9to5Mac. EFI (Extensible Firmware Interface) is the boot system used by Macs.\n  Wouldn&#39;t it be nice if this new Apple Silicon Mac had a touch screen? Speaking of which,  this is why we think Apple needs a touchscreen Mac.", "posttime": "2020-10-28 06:40:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macbook-pro,2020,apple,苹果,macbook", "title": "苹果ARM MacBook Pro将于2020年上市", "title_en": "Apple ARM MacBook Pro coming 2020", "transed": 1, "url": "https://www.macworld.co.uk/news/macbook-silicon-arm-release-3420655/", "via": "", "real_tags": ["2020", "apple", "苹果", "macbook"]}, {"category": "", "categoryclass": "", "imagename": "2d5b49aac76df1399813def94a77f0aa.jpg", "infoid": 1031635, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于历史悠久的电池壳制造商之一的莫菲来说，这里有一个聪明的补充，该公司现在与Zagg、Braven、iFroz和InvisibleShield属于同一个智能手机配件集团的一部分。Juice Pack Connect是一种模块化的类别，带有一个可以滑动和关闭的电池组。\n只需80美元，你就可以得到一个5400mAh的电池(这应该会让你有足够的充电时间)和一个支撑手机的耳机支架。莫菲可能会在某个时候提供更多的型号，但目前，最大的卖点不是关于附加组件，而是更多的是这样一个事实，即你可以在不需要的时候将电池从设备上滑落，而仍然使用保护套。\n它与OtterBox几年前推出的模块化宇宙外壳并没有完全不同，但这里的最大优势是充电通过qi工作，所以你不必将其插入手机的端口。\n它不便宜(一般来说，莫菲不便宜)。而且，不，这不是MagSafe配件。取而代之的是，使用粘合剂将附加组件附着在您的手提箱上(请记住，需要足够薄以支持充电)。优点是，它可以在更多的手机上使用，包括多代iPhone，以及三星Galaxies和谷歌像素(Google Pixels)等具有无线功能的手机。", "note_en": "Here’s a clever addition for Mophie, one of the longstanding battery case makers, which is now a part of the same smartphone accessory conglomerate as  Zagg,   Braven, iFrogz and InvisibleShield. The Juice Pack Connect is a modular take on the category, with a battery pack that slides on and off.\n For $80 you get a 5,400mAh battery (that should get you plenty of additional charge time) and a ring stand that props the phone up. Mophie may offer additional models at some point, but right now, the biggest selling point is less about add-ons and more the fact that you can slip the battery off the device when not needed and still use the case.\n   It’s not entirely dissimilar from the modular uniVERSE case OtterBox introduced a bunch of years ago, but the big advantage here is that the charging works via Qi, so you don’t have to plug it into the phone’s port.\n It’s not cheap (Mophie isn’t, generally). And, no, it’s not a MagSafe accessory. Instead, the add-on attaches to your case (needs to be one thin enough to support the charging, mind) using adhesive. The upside is that it works with a much larger number of phones, including multiple generations of iPhones and wireless-capable handsets like Samsung Galaxies and  Google   Pixels.", "posttime": "2020-10-28 06:22:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "无线,introduces,电池", "title": "\n莫菲介绍了一个模块化的无线充电模块", "title_en": "\n\t\t\t\tMophie introduces a modular wireless charging module\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/mophie-introduces-a-modular-wireless-charging-module/", "via": "", "real_tags": ["无线", "电池"]}, {"category": "", "categoryclass": "", "imagename": "a99a94603a5f681f07f620f3dab259a0.jpeg", "infoid": 1031634, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Head-检索与GET请求相同的响应头，但没有响应体。\n&lt；自定义&gt；-某些API使用List等自定义请求方法。键入您的自定义方法。\nHTTPServer发送事件：通过📡连接从服务器接收更新流，而无需进行轮询。\n🔮GraphQL：GraphQL是API的查询语言，也是用现有数据完成这些查询的运行时。\n⏰历史记录：请求条目与云/本地会话存储同步，只需一次点击即可恢复。\nAPI集合：使用集合和文件夹组织您的📁请求。只需单击一下即可重复使用它们。\n📜Pre-Request Scriptsβ：在发送请求之前执行的与请求相关联的代码片段。\n要为世界各地的用户提供本地化体验，您可以添加您自己的翻译。\n✅请求后测试β：编写与请求相关联的测试，这些测试在请求响应之后执行。\n📝笔记：当你想到笔记、任务或任何你想要的东西时，立即记录下来。\n🌱环境：环境变量允许您存储和重用请求和脚本中的值。\n通过将值存储在变量中，您可以在整个请求节中引用该值。\n如果需要更新值，只需在一个位置进行更改。\n使用您自己的密钥更新存储库根目录中的.env.example文件，并将其重命名为.env。\n请使用GitHub Flow投稿。创建分支，添加提交，然后打开拉式请求。\n有关我们的行为准则和向我们提交拉式请求的流程的详细信息，请阅读贡献。\n这个项目是由Liyas Thomas使用语义版本规范开发的。有关可用的版本，请参阅此存储库上的版本。\n此项目在麻省理工学院的许可下获得许可-有关详细信息，请参阅许可文件。", "note_en": "HEAD - Retrieve response headers identical to those of a GET request, but without the response body.\n        &lt;custom&gt; - Some APIs use custom request methods such as  LIST. Type in your custom methods.\n              📡  Server Sent Events: Receive a stream of updates from a server over a HTTP connection without resorting to polling.\n   🔮  GraphQL: GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data.\n            ⏰  History: Request entries are synced with cloud / local session storage to restore with a single click.\n 📁  Collections: Keep your API requests organized with collections and folders. Reuse them with a single click.\n      📜  Pre-Request Scripts β: Snippets of code associated with a request that are executed before the request is sent.\n           To provide a localized experience for users around the world, you can add you own translations.\n          ✅  Post-Request Tests β: Write tests associated with a request that are executed after the request response.\n   📝  Notes : Instantly jot down notes, tasks or whatever you feel like as they come to your mind.\n  🌱  Environments : Environment variables allow you to store and reuse values in your requests and scripts.\n  By storing a value in a variable, you can reference it throughout your request section\n If you need to update the value, you only have to change it in one place\n         Update   .env.example file found in repository&#39;s root directory with your own keys and rename it to  .env.\n             Please contribute using  GitHub Flow. Create a branch, add commits, and  open a pull request.\n Please read   CONTRIBUTING for details on our   CODE OF CONDUCT, and the process for submitting pull requests to us.\n    This project is developed by  Liyas Thomas using the  Semantic Versioning specification. For the versions available, see the  releases on this repository.\n                                                  This project is licensed under the  MIT License - see the   LICENSE file for details.", "posttime": "2020-10-28 06:12:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,请求,free", "title": "Hoppscotch-一个免费、快速、漂亮的API请求构建器", "title_en": "Hoppscotch – A free, fast and beautiful API request builder", "transed": 1, "url": "https://github.com/hoppscotch/hoppscotch", "via": "", "real_tags": ["免费", "请求", "free"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031633, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据发表在西班牙国家内分泌学会临床内分泌学与代谢杂志上的一项新研究，西班牙一家公立医院的200多名新冠肺炎患者中，超过80%的人患有维生素D缺乏症。维生素D是一种由肾脏产生的激素，它控制血液中的钙浓度，并影响人体免疫系统。维生素D缺乏与各种健康问题有关，尽管维生素D缺乏为什么会影响身体的其他系统的研究仍在进行中。许多研究都指出维生素D对人体免疫系统的最大益处，特别是在防止感染方面。该研究的合著者、西班牙桑坦德南部坎塔布里亚大学的何塞·L·埃尔南德斯(JoséL.C.Hernández)博士说：“一种方法是识别和治疗维生素D缺乏症，特别是在老年人、合并症患者和疗养院居民等高危人群中，这些人是新冠肺炎的主要目标人群。”“对于血液中维生素D水平较低的新冠肺炎患者，应该推荐维生素D治疗，因为这种方法可能对人体肌肉骨骼和人体免疫系统都有有益的影响。”(译者注：维生素D在血液中循环水平较低的患者应该推荐使用维生素D治疗，因为这种方法可能对人体肌肉骨骼和人体免疫系统都有好处)。研究人员发现，在瓦尔德西亚国立大学医院的216名新冠肺炎患者中，约80%患有维生素D缺乏症，男性的维生素D水平低于女性，而维生素D水平较低的新冠肺炎患者还出现了血清铁蛋白和D-二聚体等炎症标志物水平升高的情况。这项研究的其他作者包括：丹尼尔·南、何塞·M·奥尔莫斯、哈维尔·克雷斯波和维克托·M·马丁内斯-塔博阿达，来自西班牙坎塔布里亚大学；Marta Fernandez-Ayala，来自加西亚-Unzueta；，Miguel A.；Hernández-Hernández，来自西班牙桑坦德；Marcos López-Hoyos，Manuel Gutiérrez-Cuadra，和Juan J.Ruiz-CuBillán，来自西班牙桑坦德的Servicio Cándero Tabro de Salud医院的Pedro Meduñoz Cacho。这份手稿获得了美国萨鲁德研究所和卡洛斯三世的资助，题为《SARS-CoV-2感染住院患者中的维生素D状况》的手稿在网上发表，提前印刷。\n内分泌学家是解决我们这个时代最紧迫的健康问题的核心，从糖尿病、肥胖症到不孕不育、骨骼健康和激素相关的癌症。内分泌协会是世界上历史最悠久、规模最大的组织，由致力于荷尔蒙研究的科学家和治疗荷尔蒙相关疾病的医生组成。\n该协会有18000多名成员，包括来自122个国家的科学家、医生、教育工作者、护士和学生。要了解更多关于该协会和内分泌学领域的信息，请访问我们的网站：www.endcriine.org。在Twitter上关注我们@TheEndoSociety和@EndoMedia。\n从长凳到床边，以及其间的所有阶段，荷尔蒙健康网络致力于支持患者和公众教育。\n内分泌新闻播客为您带来来自该领域专家的最新研究和临床进展，无论您是在车里、办公室里还是在外面跑步。\n我们的顶级同行评议期刊是首批发表重大发展和发现里程碑的期刊之一。", "note_en": "Over 80 percent of 200 COVID-19 patients in a hospital in Spain have vitamin D deficiency, according to a new study published in  the   Endocrine   Society ’s  Journal of Clinical Endocrinology &amp; Metabolism.   Vitamin D  is a hormone  the  kidneys produce that controls blood calcium concentration and impacts  the  immune system. Vitamin D deficiency has been linked to a variety of health concerns, although research is still underway into why  the  hormone impacts other systems of  the  body. Many studies point to  the  beneficial effect of vitamin D on  the  immune system, especially regarding protection against infections.   “One approach is to identify and treat vitamin D deficiency, especially in high-risk individuals such as  the  elderly, patients with comorbidities, and nursing home residents, who are  the  main target population for  the  COVID-19,” said study co-author José L. Hernández, Ph.D., of  the  University of Cantabria in Santander, Spain. “Vitamin D treatment should be recommended in COVID-19 patients with low levels of vitamin D circulating in  the  blood since this approach might have beneficial effects in both  the  musculoskeletal and  the  immune system.”   The  researchers found 80 percent of 216 COVID-19 patients at  the  Hospital Universitario Marqués de Valdecilla had vitamin D deficiency, and men had lower vitamin D levels than women. COVID-19 patients with lower vitamin D levels also had raised serum levels of inflammatory markers such as ferritin and D-dimer.   Other authors of  the  study include: Daniel Nan, José M. Olmos, Javier Crespo, and Víctor M. Martínez-Taboada of  the  University of Cantabria; Marta Fernandez-Ayala, Mayte García-Unzueta, Miguel A. Hernández-Hernández, Marcos López-Hoyos, Manuel Gutiérrez-Cuadra, and Juan J. Ruiz-Cubillán of  the  Hospital Marqués de Valdecilla-IDIVAL in Santander, Spain; Pedro Muñoz Cacho of  the  Servicio Cántabro de Salud in Santander, Spain.   The  manuscript received funding  from  Instituto de Salud Carlos III.   The  manuscript,   “Vitamin D Status in Hospitalized Patients With SARS-Cov-2 Infection,”   was published online, ahead of print.\n  Endocrinologists are at the core of solving the most pressing health problems of our time, from diabetes and obesity to infertility, bone health, and hormone-related cancers. The Endocrine Society is the world’s oldest and largest organization of scientists devoted to hormone research and physicians who care for people with hormone-related conditions.\n The Society has more than 18,000 members, including scientists, physicians, educators, nurses and students in 122 countries. To learn more about the Society and the field of endocrinology, visit our site at  www.endocrine.org. Follow us on Twitter at  @TheEndoSociety and  @EndoMedia.\n  From bench to bedside and all the stages in between, the Hormone Health Network is committed to supporting patient and public education.\n  The Endocrine News podcast brings you the latest research and clinical advances from experts in the field, whether you are in your car, office, or out for a run.\n  Our top-ranked peer-reviewed journals are among the first to publish major developments and discovery milestones.", "posttime": "2020-10-28 06:07:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维生素,发现,vitamin", "title": "研究发现，超过八成的新冠肺炎患者患有维生素D缺乏症", "title_en": "Study finds over 80 percent of Covid-19 patients have Vitamin D deficiency", "transed": 1, "url": "https://www.endocrine.org/news-and-advocacy/news-room/2020/study-finds-over-80-percent-of-covid19-patients-have-vitamin-d-deficiency", "via": "", "real_tags": ["维生素", "发现", "vitamin"]}, {"category": "", "categoryclass": "", "imagename": "444d759ef07609563082147df13a7e22.jpg", "infoid": 1031631, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从286年代开始，内存处理的奇特之处就一直存在于Linux的最初发行版中。\n莱纳斯·托瓦尔兹(Linus Torvalds)为世界提供了第一个Linux内核5.10版本的候选版本，并称这是他所称的历史性变化--移除了一个似乎已存在近30年的寻址工具，该工具在10年前引发了一个令人讨厌的漏洞，但后来被芯片制造商裁员。\n这种方案被称为set_fs()，它允许Linux内核覆盖地址空间，这对于英特尔的286和386 CPU来说是一件很方便的事情。\n正如Torvalds在他的每周内核更新中所解释的那样，set_fs()控制用户空间副本实际上是进入用户空间还是内核空间。这很重要，因为正如2010年CVE-2010-4258中详细描述的那样，它可以用来覆盖任意内核内存位置，并获得特权。\n这个漏洞已经修复了，同样是在2010年，随着时间的推移，芯片设计者已经转向改进内存管理技术。Torvalds写道，这种内存空间覆盖已经从x86、PowerPC、S390和RISC-V架构中消除。\n但是，Torvalds所说的set_fs()几乎可以追溯到Linux最初的发行版，它仍然存在。\n托瓦尔兹写道，这不是一个巨大的变化，但很有趣，他补充说：对于大多数人来说，所有这些都不应该有任何影响，它主要是一个小小的历史脚注，5.10不再依赖于整个set_fs()模式。&#34；托瓦尔兹写道，对大多数人来说，所有这些都不应该有任何影响，它主要是一个小小的历史脚注，不再依赖于整个set_fs()模式。\n这看起来是一个比我预期的更大的版本，虽然合并窗口比5.8的要小，但也不会小多少。他写道，5.8版是我们有史以来最大的一次发布，其中包括近1700人提交的近1.4万条承诺。\n我不能完全确定这只是一种普遍的上升趋势(我们确实似乎在那里停滞了一段时间)，还是仅仅是一种侥幸，或者可能是因为5.9延长了一周的时间。我想，我们拭目以待吧。\n此版本内核的重大变化包括停止支持PowerPC 601 CPU、支持NVIDIA的Orin旨在用于自动驾驶汽车和机器人的SOC、更好地支持Raspberry Pi 4中使用的Broadcom CPU中的图形驱动程序、修改了对ARM CPU的Spectre缓解以及为即将到来的CPU和GPU提供的通常的一系列调整、虚拟化调整以及消除2038年的漏洞。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Memory-handling oddity from the age of the 286 has been around since &#39;pretty much the original release of Linux&#39;\n  Linus Torvalds has given the world the first release candidate of version 5.10 of the Linux kernel and called out what he&#39;s labelled an historic change – the removal of an addressing tool that appears to have been around for nearly 30 years, sparked a nasty bug a decade ago but has since been made redundant by chipmakers.\n  That scheme is called  set_fs() and allows the Linux kernel to override address spaces, which was a handy thing to do with Intel&#39;s 286 and 386 CPUs.\n  As Torvalds  explained in his weekly kernel update,  set_fs() controls &#34;whether a userspace copy actually goes to user space or kernel space&#34;. That matters because, as was detailed in 2010 in  CVE-2010-4258, it could be used to &#34;overwrite arbitrary kernel memory locations, and gain privileges&#34;.\n    The bug was fixed, again way back in 2010, and over time chip-designers have moved on to improved memory management techniques. Torvalds wrote that this sort of memory space override has been banished from the x86, powerpc, s390 and RISC-V architectures.\n  But  set_fs(), which Torvalds says &#34;goes back to pretty much the original release of Linux&#34;, has persisted.\n    &#34;It&#39;s not a _huge_ change, but it&#39;s interesting,&#34; Torvalds wrote, adding: &#34;To most people that all shouldn&#39;t matter at all, and it&#39;s mainly a small historical footnote that 5.10 no longer relies on the whole set_fs() model.&#34;\n      &#34;This looks to be a bigger release than I expected, and while the merge window is smaller than the one for 5.8 was, it&#39;s not a *lot* smaller. And 5.8 was our biggest release ever,&#34; he wrote, noting that it includes almost 14,000 commits from &#34;closer to 1,700 people&#34;.\n  &#34;I&#39;m not entirely sure whether this is just a general upward trend (we did seem to plateau for a while there), or just a fluke, or perhaps due to 5.9 dragging out an extra week. We will see, I guess.&#34;\n  Big changes in this version of the kernel include end of support for PowerPC 601 CPUs, support for Nvidia&#39;s Orin SOCs intended for use in self-driving cars and robots, better support for the graphics driver in the Broadcom CPU used in the Raspberry Pi 4, revised Spectre mitigation for Arm CPUs and the usual bunch of accommodations for upcoming CPU and GPUs, virtualisation tweaks and crushing the year 2038 bug. ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-10-28 06:06:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,地址,addressing,内存", "title": "Linus Torvalds欢呼“历史性的”Linux5.10抛弃了废弃的地址artef", "title_en": "Linus Torvalds hails 'historic' Linux 5.10 for ditching defunct addressing artef", "transed": 1, "url": "https://www.theregister.com/2020/10/25/linux_5_10_rc1/", "via": "", "real_tags": ["linux", "地址", "内存"]}, {"category": "", "categoryclass": "", "imagename": "1ee0dda203e3e34b094482c0bb550712.jpg", "infoid": 1031630, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Alysson Muotri的实验室里，数百个芝麻大小的微型人脑漂浮在培养皿中，电火花闪烁。\n这些被称为脑器官的微小结构是从人类干细胞中生长出来的，已经成为许多研究大脑特性的实验室熟悉的固定装置。加州大学圣地亚哥分校(UCSD)的神经学家穆特里发现了一些不同寻常的方法来部署他的HIS。他将有机机器人与行走的机器人连接起来，用尼安德特人的基因修改了它们的基因组，将它们发射到国际空间站的轨道上，并将它们作为模型来开发更多类似人类的人工智能系统。像许多科学家一样，穆特里暂时转向研究新冠肺炎，使用脑有机化合物来测试药物对SARS-CoV-2冠状病毒的效果。\n但有一项实验比其他实验吸引了更多的关注。2019年8月，穆特里的研究小组在“细胞干细胞”上发表了一篇论文，报告了人类大脑有机体的产生，这种有机体产生了与早产儿1相似的协调波活动。这种波持续了几个月，然后研究小组关闭了实验。\n这种全脑的、协调的电活动是有意识大脑的特性之一。该团队的发现促使伦理学家和科学家提出了一系列道德和哲学问题，比如是否应该允许有机类化合物达到这种高级发展水平，“有意识的”有机类化合物是否有权获得其他细胞团块所没有的特殊待遇和权利，以及意识可以从头开始创造的可能性。\n许多神经学家和生物伦理学家已经想到了没有身体、有自我意识的大脑。就在几个月前，位于康涅狄格州纽黑文的耶鲁大学的一个研究小组宣布，他们已经至少部分恢复了几个小时前被宰杀的猪的大脑的生命。通过从猪的头骨上取出大脑，并给它们注入一种化学鸡尾酒，研究人员恢复了神经元的细胞功能和传输电信号的能力2。\n其他实验，如在老鼠大脑中添加人类神经元的努力，也引发了一些问题，一些科学家和伦理学家认为，这些实验不应该被允许。\n这些研究为那些希望避免创造意识的人和那些将复杂的有机化合物视为研究毁灭性人类疾病的手段的人之间的辩论奠定了基础。穆特里和许多其他神经学家认为，人脑有机体可能是理解自闭症和精神分裂症等独特人类疾病的关键，这些疾病不可能在小鼠模型中进行详细研究。穆特里说，为了实现这一目标，他和其他人可能需要故意创造意识。\n研究人员现在呼吁制定一套类似于动物研究的指南，以指导人性化地使用大脑有机体和其他可以实现意识的实验。6月，美国国家科学院、工程院和医学院开始了一项研究，目的是概述与脑有机化合物和人-动物嵌合体相关的潜在法律和伦理问题。\n对实验室培养的大脑的担忧也突显了一个盲点：神经科学家没有达成一致的方法来定义和测量意识。如果没有一个有效的定义，伦理学家担心，在实验越界之前，不可能停止它。\n目前的一系列实验可能会迫使这个问题。英国布赖顿附近苏塞克斯大学的认知神经学家阿尼尔·塞斯(Anil Seth)表示，如果科学家确信有机化合物已经获得意识，他们可能需要加快步伐，就如何发生这种情况的理论达成一致。但是，他说，如果一个人偏爱的理论认为是有机体意识，而另一个人则不是，那么任何关于意识已经获得的信心都会烟消云散。“信心在很大程度上取决于我们相信什么理论。这是一个循环。“。\n创建一个有意识的系统可能比定义它容易得多。研究人员和临床医生为了不同的目的，以许多不同的方式定义意识，但很难将它们综合成一个整洁的可操作的定义，用来决定实验室发育的大脑的状态。\n医生通常根据患者对疼痛或其他刺激的反应是否眨眼或退缩来评估处于植物人状态的患者的意识水平。例如，利用脑电图(EEG)读数，研究人员还可以测量大脑在被电脉冲电击时的反应。有意识的大脑将比无意识的大脑表现出更复杂、不可预测的电活动，无意识的大脑会以简单、规则的模式做出反应。\n但这样的测试可能不足以探测一个人是否缺乏意识。在对处于昏迷或植物人状态的人进行的大脑成像研究中，科学家们表明，反应迟钝的人可以表现出一些让人联想到意识的大脑活动-比如当被要求考虑走路时，运动区的活动。\n在任何情况下，标准的意识医学测试都很难应用于培养皿中生长的脑细胞或无实体的动物大脑。当穆特里暗示他的有机体的放电模式和早产儿的一样复杂时，人们不确定该如何理解这一点。一些研究人员认为早产儿的大脑活动不够复杂，不能归类为有意识。而且有机体不能因痛苦的刺激而眨眼或退缩，所以它们无法通过意识的临床测试。\n相比之下，最近杀死的猪的完整大脑更有可能具有意识所需的结构，以及动物在世时的记忆和经历所产生的联系。马萨诸塞州剑桥市哈佛大学的哲学家和神经伦理学家珍汀·伦肖夫说：“想到一个充满了所有这些的大脑，很难想象大脑会是空的。”“我不知道他们在思考方面能做些什么，但肯定不是零，”伦肖夫说。就像耶鲁大学的研究小组所做的那样，让死亡的大脑重现生机，可能有可能恢复一定程度的意识，尽管科学家们煞费苦心地通过使用阻止全脑活动的化学阻滞剂来避免这一点。\n研究人员一致认为，他们需要认真对待这些研究提出的可能性。2019年10月，UCSD与学生和公众一起召开了一次由大约十几名神经科学家和哲学家参加的会议，意在为未来的实验建立和发布伦理框架。但这篇论文已经推迟了几个月，部分原因是几位作者无法就意识的基本要求达成一致。\n几乎所有的科学家和伦理学家都同意，到目前为止，还没有人在实验室里创造意识。但他们在问自己应该注意什么，哪些意识理论可能最相关。例如，根据一种名为综合信息论的观点，意识是整个大脑神经网络紧密连接的产物。相互作用的神经元越多，意识程度就越高--这个量被称为phi。如果phi大于零，则认为有机体是有意识的。\n根据这一理论，大多数动物都达到了这个门槛。华盛顿州西雅图艾伦脑科学研究所(Allen Institute For Brain Science)所长克里斯托夫·科赫(Christof Koch)怀疑现有的任何有机体都能达到这一门槛，但他承认，更先进的有机体可能会做到这一点。\n其他相互竞争的意识理论需要感觉输入或跨多个大脑区域的协调电模式。例如，一种被称为全球工作空间理论的观点认为，大脑的前额叶皮质的功能就像一台计算机，处理感觉输入并解释它们，以形成一种存在感。因为有机体没有前额叶皮质，不能接受输入，所以它们不能变得有意识。英国剑桥大学的发展生物学家马德琳·兰开斯特说：“没有输入和输出，神经元可能会相互交谈，但这并不一定意味着与人类的思维有任何相似之处。”\n然而，将有机体与器官连接起来可能是一项相当简单的任务。2019年，兰开斯特的团队在老鼠脊柱和背部肌肉旁边种植了人脑有机化合物。当人体器官的神经与脊柱相连时，肌肉开始自发收缩。\n大多数有机体只能复制大脑的一部分--皮层。但是，如果它们发育的时间足够长，并且有合适的生长因子，人类干细胞就会自发地重建大脑的许多不同部分，然后这些部分开始协调它们的电活动。在2017年发表的一项研究中，哈佛大学分子生物学家保拉·阿洛塔(Paola Arlotta)诱使干细胞发育成由多种不同细胞类型组成的脑有机体，包括视网膜5中发现的那些对光敏感的细胞。当暴露在光下时，有机体中的神经元开始放电。但阿洛塔说，这些细胞活跃的事实并不意味着有机体可以看到和处理视觉信息。这仅仅意味着它们可以形成必要的电路。\n阿洛塔和兰开斯特认为他们的有机体太原始，没有意识，因为他们缺乏创造复杂脑电模式所需的解剖结构。尽管如此，兰开斯特承认，对于高级有机化合物，这取决于定义。她说：“如果你认为一只苍蝇是有意识的，那就可以想象有机生物可能是有意识的。”\n然而，兰开斯特和大多数其他研究人员认为，与有机体相比，像恢复活力的猪脑这样的东西更有可能实现意识。由神经学家内纳德·塞斯坦(Nenad Sestan)领导的研究小组对猪的大脑进行了研究，他们试图找到新的方法来振兴器官，而不是创造意识。研究人员能够让单个神经元或群体着火，并小心翼翼地试图避免产生广泛的脑电波。尽管如此，当Sestan的团队在其中一个大脑中发现看起来像是协调的EEG活动时，他们立即停止了该项目。即使在神经学专家确认这种模式与意识不一致之后，作为预防措施，研究小组还是对大脑进行了麻醉。\n塞斯坦还联系了美国国立卫生研究院(NIH)，寻求如何继续进行的指导。该机构的神经伦理学小组，包括伦肖夫和俄亥俄州克利夫兰凯斯西大学的生物伦理学家Insoo Hyun，对这项工作进行了评估，并同意塞斯坦应该继续对大脑进行麻醉。但该小组尚未就更一般的规定达成一致，也不会照例要求对有机类化合物的提案进行生物伦理评估，因为其成员认为意识不太可能出现。美国国立卫生研究院也没有给意识下一个定义。“它是如此灵活，每个人都声称自己的意思，”贤说。“如果不清楚我们谈论的是同一件事，那就是言论上的一个大问题。”\n一些人认为，甚至试图识别任何一种实验室维持的大脑中的意识都是徒劳的。比利时列日大学的神经学家史蒂文·劳雷斯(Steven Laureys)说，“鉴于我们不了解意识，我们不可能对这些脑细胞群的想法或感知做出有意义的评价。”他开创了一些基于成像的植物人意识测量方法。“我们不应该太傲慢。”他说，进一步的研究应该非常谨慎地进行。\nLaureys和其他人指出，有机类生物的体验很可能与早产儿、成年人或猪的体验截然不同，而且不能直接进行比较。此外，有机化合物中的结构可能太小，无法准确测量它们的活动，而有机化合物和早产儿大脑中的脑电模式之间的相似之处可能是巧合的。其他从事脑有机体研究的科学家同意劳瑞斯的观点，即一个系统是否有意识的问题可能是无法回答的。许多人完全避免这个想法。“我不知道为什么我们会试图问这个问题，因为这个系统不是人脑，”加州斯坦福大学的神经学家塞尔吉奥·帕萨(Sergiu Pasça)说。“它们是由神经元组成的，神经元有电活动，但我们必须仔细考虑如何比较它们。”\n穆特里希望他的有机体系统至少在某些方面可以与人脑相媲美，这样他就可以研究人类疾病并找到治疗方法。他的动机是个人的：他14岁的儿子患有癫痫和自闭症。“他在生活中苦苦挣扎，”穆特里说。脑有机体是一条很有希望的途径，因为它们概括了大脑连接的最早阶段，而随着人类胚胎的发育，这些阶段是不可能研究的。但是，他说，在没有一个功能齐全的大脑的情况下研究人类大脑障碍，就像研究一个不能产生胰岛素的胰腺一样。“要做到这一点，我需要一个真正像人脑的大脑器官模型。我可能需要一个能变得有意识的有机体。“。\n穆特里说，他不知道应该用什么定义来决定有机物质是否达到意识。他说，在某种程度上，有机化合物甚至可以帮助研究人员回答有关大脑如何产生意识状态的问题。例如，加州大学圣迭戈分校的数学家加布里埃尔·席尔瓦(Gabriel Silva)正在研究穆特里的有机体中的神经活动，以开发一种描述大脑如何产生意识的算法6。他的项目的部分资金来自微软，其目标是创造一个工作方式类似于人类意识的人工系统。\n目前，美国或欧洲没有任何法规可以阻止研究人员创造意识。国家科学院小组计划在明年初发布一份报告，概述最新的研究，并对是否需要监管做出判断。成员们计划就一些问题发表意见，比如是否要征得人们的同意才能将他们的细胞发展成脑器官，以及如何以人道的方式研究和处理有机物质。国际干细胞研究协会(International Society For Stem Cell Research)也在研究有机体指南，但没有涉及意识，因为它认为科学还没有到位。\nHyun说，NIH神经伦理学小组还没有看到任何创造复杂的、有意识的有机类化合物的建议，这将需要新的指导方针。穆特里说，他也不知道还有其他人故意尝试创造有意识的有机类化合物，尽管根据某些定义，足够复杂的有机类化合物可能会意外地达到这种状态。\n尽管如此，穆特里和其他人表示，他们将欢迎一些指导方针。这些措施可能包括要求科学家证明他们使用的人脑有机化合物的数量，只将它们用于任何其他方式无法完成的研究，限制可能给它们造成的痛苦的数量，并以人道的方式处理它们。\n提前准备好这样的建议将有助于研究人员权衡创建有意识实体的成本和收益。许多研究人员强调，这样的实验有可能产生重要的见解。兰开斯特说：“有一些真正有意识的人患有神经性疾病，没有任何治疗方法。”“如果我们真的因为哲学思维实验而停止所有这项研究，”她补充说，“那将对需要一些新治疗的真人非常不利。”\n然而，治疗方法仍然可以在使用小鼠干细胞制造的脑器官中进行测试，或者在常规动物模型中进行测试。这样的实验还可以为关于人类有机化合物道德使用的讨论提供信息。例如，Hyun希望看到研究人员将小鼠脑有机化合物的脑电图模式与活着的小鼠的脑电模式进行比较，这可能表明人类有机化合物对人脑的概括有多好。\n对于穆特里来说，他认为在人类有机体上工作和在实验室老鼠上工作没有什么不同。“我们研究的动物模型是有意识的，没有问题，”他说。“我们需要向前迈进，如果事实证明他们变得有意识，老实说，我不认为这是什么大不了的事。”", "note_en": "In Alysson Muotri’s laboratory, hundreds of miniature human brains, the size of sesame seeds, float in Petri dishes, sparking with electrical activity.\n These tiny structures, known as brain organoids, are grown from human stem cells and have become a familiar fixture in many labs that study the properties of the brain. Muotri, a neuroscientist at the University of California, San Diego (UCSD), has found some unusual ways to deploy his. He has connected organoids to walking robots, modified their genomes with Neanderthal genes, launched them into orbit aboard the International Space Station, and used them as models to develop more human-like artificial-intelligence systems. Like many scientists, Muotri has temporarily pivoted to studying COVID-19, using brain organoids to test  how drugs perform against the SARS-CoV-2 coronavirus.\n But one experiment has drawn more scrutiny than the others. In August 2019, Muotri’s group published a paper in  Cell Stem Cell reporting the creation of human brain organoids that produced coordinated waves of activity, resembling those seen in premature babies  1. The waves continued for months before the team shut the experiment down.\n This type of brain-wide, coordinated electrical activity is one of the properties of a conscious brain. The team’s finding led ethicists and scientists to raise a host of moral and philosophical questions about whether organoids should be allowed to reach this level of advanced development, whether ‘conscious’ organoids might be entitled to special treatment and rights not afforded to other clumps of cells and the possibility that consciousness could be created from scratch.\n The idea of bodiless, self-aware brains was already on the minds of many neuroscientists and bioethicists. Just a few months earlier, a team at Yale University in New Haven, Connecticut, announced that it had at least partially restored life to the brains of pigs that had been killed hours earlier. By removing the brains from the pigs’ skulls and infusing them with a chemical cocktail, the researchers revived the neurons’ cellular functions and their ability to transmit electrical signals  2.\n Other experiments, such as efforts to add human neurons to mouse brains, are raising questions, with some scientists and ethicists arguing that these experiments should not be allowed.\n The studies have set the stage for a debate between those who want to avoid the creation of consciousness and those who see complex organoids as a means to study devastating human diseases. Muotri and many other neuroscientists think that human brain organoids could be the key to understanding uniquely human conditions such as autism and schizophrenia, which are impossible to study in detail in mouse models. To achieve this goal, Muotri says, he and others might need to deliberately create consciousness.\n  Researchers are now calling for a set of guidelines, similar to those used in animal research, to guide the humane use of brain organoids and other experiments that could achieve consciousness. In June, the US National Academies of Sciences, Engineering, and Medicine began a study with the aim of outlining the potential legal and ethical issues associated with brain organoids and human–animal chimaeras.\n The concerns over lab-grown brains have also highlighted a blind spot: neuroscientists have no agreed way to define and measure consciousness. Without a working definition, ethicists worry that it will be impossible to stop an experiment before it crosses a line.\n The current crop of experiments could force the issue. If scientists become convinced that an organoid has gained consciousness, they might need to hurry up and agree on a theory of how that happened, says Anil Seth, a cognitive neuroscientist at the University of Sussex near Brighton, UK. But, he says, if one person’s favoured theory deems the organoid conscious whereas another’s doesn’t, any confidence that consciousness has been attained vanishes. “Confidence largely depends on what theory we believe in. It’s a circularity.”\n  Creating a conscious system might be a whole lot easier than defining it. Researchers and clinicians define consciousness in many different ways for various purposes, but it is hard to synthesize them into one neat operational definition that could be used to decide on the status of a lab-grown brain.\n Physicians generally assess the level of consciousness in patients in a vegetative state on the basis of whether the person blinks or flinches in response to pain or other stimuli. Using electroencephalogram (EEG) readings, for instance, researchers can also measure how the brain responds  when it is zapped with an electrical pulse. A conscious brain will display much more complex, unpredictable electrical activity than one that is unconscious, which responds with simple, regular patterns.\n But such tests might not adequately probe whether a person lacks consciousness. In brain-imaging studies of people who are in a coma or vegetative state, scientists have shown that unresponsive individuals can display some brain activity reminiscent of consciousness — such as activity in motor areas when asked to think about walking  3.\n  In any case, standard medical tests for consciousness are difficult to apply to brain cells grown in dishes, or disembodied animal brains. When Muotri suggested that his organoids’ firing patterns were just as complex as those seen in preterm infants, people were unsure what to make of that. Some researchers don’t consider the brain activity in a preterm infant to be complex enough to be classed as conscious. And organoids can’t blink or recoil from a painful stimulus, so they wouldn’t pass the clinical test for consciousness.\n By contrast, it’s much more likely that an intact brain from a recently killed pig has the necessary structures for consciousness, as well as wiring created by memories and experiences the animal had while it was alive. “Thinking about a brain that has been filled with all this, it is hard to imagine that brain would be empty,” says Jeantine Lunshof, a philosopher and neuroethicist at Harvard University in Cambridge, Massachusetts. “What they can do in terms of thinking I don’t know, but it’s for sure not zero,” says Lunshof. Bringing a dead brain back to a semblance of life, as the Yale team did, might have the potential to restore a degree of consciousness, although the scientists took pains to avoid this by using chemical blocking agents that prevented brain-wide activity.\n Researchers agree that they need to take the possibilities raised by these studies seriously. In October 2019, UCSD held a conference of about a dozen neuroscientists and philosophers, together with students and members of the public, with the intention of establishing and publishing an ethical framework for future experiments. But the paper has been delayed for months, partly because several of the authors could not agree on the basic requirements for consciousness.\n  Almost all scientists and ethicists agree that so far, nobody has created consciousness in the lab. But they are asking themselves what to watch out for, and which theories of consciousness might be most relevant. According to an idea called  integrated information theory, for example, consciousness is a product of how densely neuronal networks are connected across the brain. The more neurons that interact with one another, the higher the degree of consciousness — a quantity known as phi. If phi is greater than zero, the organism is considered conscious.\n Most animals reach this bar, according to the theory. Christof Koch, president of the Allen Institute for Brain Science in Seattle, Washington, doubts that any existing organoid could achieve this threshold, but concedes that a more advanced one might.\n Other competing theories of consciousness require sensory input or coordinated electrical patterns across multiple brain regions. An idea known as  global workspace theory, for instance, posits that the brain’s prefrontal cortex functions as a computer, processing sensory inputs and interpreting them to form a sense of being. Because organoids don’t have a prefrontal cortex and can’t receive input, they cannot become conscious. “Without input and output, the neurons may be talking with each other, but that doesn’t necessarily mean anything like human thought,” says Madeline Lancaster, a developmental biologist at the University of Cambridge, UK.\n Connecting organoids to organs, however, could be a fairly simple task. In 2019, Lancaster’s team grew human brain organoids next to a mouse spinal column and back muscle. When nerves from the human organoid connected with the spinal column, the muscles began to spontaneously contract  4.\n  Most organoids are built to reproduce only one portion of the brain — the cortex. But if they develop long enough and with the right kinds of growth factor, human stem cells spontaneously recreate many different parts of the brain, which then begin coordinating their electrical activity. In a study published in 2017, molecular biologist Paola Arlotta at Harvard University coaxed stem cells to develop into brain organoids composed of many different cell types, including light-sensitive cells like those found in the retina  5. When exposed to light, neurons in the organoids began firing. But the fact that these cells were active doesn’t mean the organoids could see and process visual information, Arlotta says. It simply means that they could form the necessary circuits.\n Arlotta and Lancaster think their organoids are too primitive to be conscious, because they lack the anatomical structures necessary to create complex EEG patterns. Still, Lancaster admits that for advanced organoids, it depends on the definition. “If you thought a fly was conscious, it’s conceivable that an organoid could be,” she says.\n  However, Lancaster and most other researchers think that something like a revitalized pig brain would be much more likely to achieve consciousness than an organoid. The team that did the work on the pig brains, led by neuroscientist  Nenad Sestan, was trying to find new ways to revitalize organs, not to create consciousness. The researchers were able to get individual neurons or groups to fire and were careful to try and avoid the creation of widespread brain waves. Still, when Sestan’s team saw what looked like coordinated EEG activity in one of the brains, they immediately halted the project. Even after a neurology specialist confirmed that the pattern was not consistent with consciousness, the group anaesthetized the brains as a precautionary measure.\n Sestan also contacted the US National Institutes of Health (NIH) for guidance on how to proceed. The agency’s neuroethics panel, including Lunshof and Insoo Hyun, a bioethicist at Case Western University in Cleveland, Ohio, assessed the work and agreed that Sestan should continue to anaesthetize the brains. But the panel hasn’t settled on more general regulations, and doesn’t routinely require a bioethics assessment for organoid proposals because its members think that consciousness is unlikely to arise. The NIH hasn’t arrived at a definition of consciousness, either. “It’s so flexible, everyone claims their own meaning,” Hyun says. “If it’s not clear we’re talking about the same thing, it’s a big problem for discourse.”\n   Some think it is futile to even try to identify consciousness in any sort of lab-maintained brain. “It’s just impossible to say meaningful things about what these bunches of brain cells could think or perceive, given we don’t understand consciousness,” says Steven Laureys, a neurologist at the University of Liège in Belgium, who pioneered some of the imaging-based measures of consciousness in people in a vegetative state. “We shouldn’t be too arrogant.” Further research should proceed very carefully, he says.\n Laureys and others point out that the experience of an organoid is likely to be very different from that of a preterm infant, an adult human or a pig, and not directly comparable. Furthermore, the structures in an organoid might be too small to have their activity measured accurately, and similarities between the EEG patterns in organoids and preterm baby brains could be coincidental. Other scientists who work on brain organoids agree with Laureys that the question of whether a system is conscious could be unanswerable. Many avoid the idea entirely. “I don’t know why we would try to ask that question, because this system is not the human brain,” says Sergiu Pasça, a neuroscientist at Stanford University in California. “They’re made out of neurons, neurons have electrical activity, but we have to think carefully about how to compare them.”\n Muotri wants his organoid systems to be comparable, in at least some ways, with human brains, so that he can study human disorders and find treatments. His motivation is personal: his 14-year-old son has epilepsy and autism. “He struggles hard in life,” Muotri says. Brain organoids are a promising avenue, because they recapitulate the earliest stages of brain wiring, which are impossible to study as a human embryo develops. But studying human brain disorders without a fully functioning brain, he says, is like studying a pancreas that doesn’t produce insulin. “To get there, I need a brain organoid model that really resembles a human brain. I might need an organoid that becomes conscious.”\n Muotri says he is agnostic about which definition to use to decide whether an organoid reaches consciousness. At some point, he says, organoids might even be able to help researchers answer questions about how brains produce conscious states. For instance, mathematician Gabriel Silva at UCSD is studying neural activity in Muotri’s organoids to develop an algorithm that describes how the brain generates consciousness  6. The goal of his project, which is partially funded by Microsoft, is to create an artificial system that works like human consciousness.\n  At the moment, there are no regulations in the United States or in Europe that would stop a researcher from creating consciousness. The National academies panel plans to release a report early next year, outlining the latest research and making a judgement on whether regulations are needed. Members plan to weigh in on questions such as whether to obtain people’s consent to develop their cells into brain organoids, and how to study and dispose of organoids humanely. The International Society for Stem Cell Research is also working on organoid guidelines, but is not addressing consciousness because it doesn’t think the science is there yet.\n Hyun says that the NIH neuroethics panel has not yet seen any proposals to create complex, conscious organoids that would necessitate new guidelines. And Muotri says he doesn’t know of anyone else deliberately trying to create conscious organoids either, although a sufficiently complex organoid could, by some definitions, reach that status accidentally.\n Still, Muotri and others say they would welcome some guidelines. These could include requiring scientists to justify the number of human brain organoids they use, to use them only for research that cannot be done in any other way, to restrict the amount of pain that can be inflicted on them, and to dispose of them humanely.\n Having such advice in place ahead of time would help researchers weigh up the costs and benefits of creating conscious entities. And many researchers stress that such experiments have the potential to yield important insights. “There are truly conscious people out there with neurological disorders with no treatments,” Lancaster says. “If we did stop all of this research because of the philosophical thought experiment,” she adds, “that would be very detrimental to actual human beings who do need some new treatment.”\n Treatments could still, however, be tested in brain organoids made using mouse stem cells , or in regular animal models. Such experiments could also inform discussions about the ethical use of human organoids. For instance, Hyun would like to see researchers compare the EEG patterns of mouse brain organoids with those of living mice, which might indicate how well human organoids recapitulate the human brain.\n For his part, Muotri sees little difference between working on a human organoid or a lab mouse. “We work with animal models that are conscious and there are no problems,” he says. “We need to move forward and if it turns out they become conscious, to be honest I don’t see it as a big deal.”", "posttime": "2020-10-28 06:05:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "培养,grown,大脑", "title": "实验室培养的大脑能变得有意识吗？", "title_en": "Can lab-grown brains become conscious?", "transed": 1, "url": "https://www.nature.com/articles/d41586-020-02986-y", "via": "", "real_tags": ["培养", "grown", "大脑"]}, {"category": "", "categoryclass": "", "imagename": "a5ce040108f606b498af773bb48f8c94.jpg", "infoid": 1031628, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软今天公布了2021年第一季度财报，营收为372亿美元，净收益为139亿美元。收入增长了12%，净收入增长了30%。虽然持续的流行病继续迫使许多人在经济低迷期间远程工作，但微软正受益于人们现在工作方式的转变，更多地玩游戏，并通过视频会议与他人联系。\n云服务是微软从大流行的行为转变中获得的最大收入提振。Office商业和消费者都在增长，Office 365商业收入增长了21%。随着越来越多的企业依赖云服务进行远程工作，服务器产品和云服务收入也增长了22%。Azure本身的收入增长了48%。\n从消费者的角度来看，这里最大的新闻是，微软365消费者订阅用户也增加到了4530万。这与去年同期相比跃升了27%，这可能要归功于微软今年早些时候通过Microsoft365和微软团队重新将重点放在消费者身上。\n不过，云和Office并不是推动微软增长的唯一产品。本季度地面收入跃升37%，达到15亿美元。对于没有推出任何新的Surface设备的季度来说，这是一个巨大的增长。微软本月早些时候刚刚推出了一款新的Surface Laptop Go设备，并更新了Surface Pro X，但这些都将计入下个季度的收入。\n在游戏方面，与去年同期相比，Xbox内容和服务收入也大幅增长了30%。在大流行期间，许多消费者转向了游戏和服务，如XCloud或Game Pass，显然对微软游戏服务的需求正在增加。微软指出，Xbox Game Pass的订阅量以及第三方和第一方游戏的实力帮助增加了收入。\n微软现在正准备在11月10日推出下一代Xbox Series X和Series S游戏机。这些游戏机是微软上个月推出的XCloud游戏流媒体服务的补充，也是该公司与Xbox Game Pass正在进行的努力的补充。微软透露，上个月它有1500万Xbox Game Pass用户，但该公司今天没有提供任何新的数字。\n微软今年早些时候报告称，在世界许多地区的封锁导致许多人远程工作后，Windows的使用量激增。不过，使用量的这种跃升并没有带来本季度Windows OEM收入的增加。Windows OEM收入下降了5%，微软将下降归咎于商业需求下降。\n虽然对个人电脑的商业需求可能正在疲软，但由于消费者对个人电脑的需求，Windows OEM非专业收入增长了31%。很可能是学生和家庭在大流行期间推动了这种增长，他们转向个人电脑来帮助支持远程学习。\n在其他地方，LinkedIn的收入也同比增长了16%，而搜索收入下降了10%。微软将其各种业务分成三个部分：生产力和业务流程、智能云和更多的个人计算。更个人化的计算领域包括Surface，Xbox和Windows，微软表示，游戏和Surface推动其本季度收入增长6%。\nAzure推动了智能云收入的增长，Office 365和LinkedIn帮助提升了工作效率和业务流程。很明显，这些主要的收入来源-Azure、游戏、Surface和Office-都受到了大流行的影响。\n微软首席执行官萨蒂亚·纳德拉(Satya Nadella)在这场流行病开始时表示，该公司“在两个月内见证了两年的数字化转型”。对于许多企业、学生和消费者来说，这一转变似乎仍在继续。\n微软现在将在美国东部时间下午5：30/太平洋时间下午2：30召开财报电话会议，我们将更新这篇文章，增加任何值得注意的内容。", "note_en": "Microsoft posted the first quarter of its 2021  financial results today, reporting revenue of $37.2 billion and a net income of $13.9 billion. Revenue is up 12 percent, and net income has increased by 30 percent. While the ongoing pandemic continues to force many to work remotely during an economic downturn, Microsoft is benefiting from the shift in the way people are now working, playing games more, and connecting to others through videoconferencing.\n Cloud services are the biggest boost to Microsoft’s revenues from the pandemic shift in behavior. Both Office commercial and consumer are up, with Office 365 Commercial revenue growth up by 21 percent. Server products and cloud services revenue has also increased 22 percent as more businesses rely on cloud services for remote working. Azure revenue itself grew 48 percent.\n The biggest news here from a consumer point of view is that Microsoft 365 Consumer subscribers have also increased to 45.3 million. That’s a jump of 27 percent year-over-year, and likely thanks to Microsoft’s renewed focus on consumers  with Microsoft 365 and Microsoft Teams earlier this year.\n Cloud and Office aren’t the only products driving Microsoft’s growth, though. Surface revenue has jumped by 37 percent this quarter to $1.5 billion. That’s a big increase for a quarter that hasn’t seen any new Surface devices introduced. Microsoft only just introduced a new Surface Laptop Go device and updated Surface Pro X earlier this month, but those will count to next quarter’s revenue.\n   Over on the gaming side, Xbox content and services revenue has also increased significantly by 30 percent compared to the same quarter last year. A number of consumers have turned to gaming and services like xCloud or Game Pass during the pandemic, and it’s clear there’s an increased demand for Microsoft’s gaming services. Microsoft notes that Xbox Game Pass subscriptions and strength in third-party and first-party titles helped with revenue.\n Microsoft is now gearing up to launch its next-gen Xbox Series X and Series S consoles on November 10th. The consoles complement Microsoft’s xCloud game streaming service that launched last month, and the company’s ongoing efforts with Xbox Game Pass. Microsoft revealed it has  15 million Xbox Game Pass subscribers last month, but the company hasn’t provided any fresh numbers today.\n  Microsoft reported a  jump in Windows usage earlier this year after lockdowns throughout many parts of the world led to remote working for many. This jump in usage hasn’t resulted in increased Windows OEM revenue during this quarter, though. Windows OEM revenue has dropped 5 percent, and Microsoft blames lower commercial demand for the dip.\n While commercial demand for PCs might be softening, Windows OEM non-pro revenue has grown by 31 percent, thanks to consumer PC demand. It’s likely that students and families are driving this growth during the pandemic, turning to PCs to help support remote learning.\n   Elsewhere, LinkedIn revenue has also grown by 16 percent year-over-year, and search revenue has decreased by 10 percent. Microsoft splits its various businesses into three buckets: productivity and business processes, intelligent cloud, and more personal computing. The more personal computing bucket includes Surface, Xbox, and Windows, and Microsoft says gaming and Surface drove its revenue growth of 6 percent for this quarter.\n Azure drove the intelligent cloud revenue growth, and Office 365 and LinkedIn helped the productivity and business processes bucket. It’s clear that these main revenue drivers — Azure, gaming, Surface, and Office — have been influenced by the pandemic.\n Microsoft CEO Satya Nadella said at the beginning of this pandemic that the company had witnessed “two years’ worth of digital transformation in two months.” That transformation appears to be continuing for many businesses, students, and consumers.\n Microsoft will now hold an earnings call at 5:30PM ET / 2:30PM PT, and we’ll update this article with any noteworthy additions.", "posttime": "2020-10-28 05:48:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,microsoft,微软,同比,yoy", "title": "云增长推动微软第一季度服务器产品和云服务收入同比增长22%，Azure同比增长48%，Office 365商业收入同比增长21%", "title_en": "Cloud growth drives Microsoft Q1 with server products and cloud services revenue up 22% YoY, Azure up 48% YoY, and Office 365 Commercial revenue up 21% YoY", "transed": 1, "url": "https://www.theverge.com/2020/10/27/21537015/microsoft-q1-2021-earnings-revenue-cloud-services-surface-gaming-xbox?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["商业", "microsoft", "微软", "同比", "yoy"]}, {"category": "", "categoryclass": "", "imagename": "9738cad9297210cb4da981b8c89e0fa4.png", "infoid": 1031627, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章的标题本可以是337,737,600秒，但如果隐瞒Prototyo开始于10多年前的事实，就会错过一个展示团队和我作为创始人多年来在这个项目中投入的奉献精神的机会。\n当我在法国的H.E.A.R斯特拉斯堡学习平面设计时，Prototyo作为一个学生项目开始了。作为一个不懂字体设计的人，我很沮丧不能完成我心目中的字体项目。字体是由规则和系统组成的，对吗？再来一杯！我们可以编写一些遵循规则的代码，所以我们应该能够成功地编写字体。这是接下来的10年的起点，也是过山车的开始，也就是创建一家初创公司的开始。\nPrototyo和许多其他公司一样是一家初创公司：在没有稳定可靠的商业模式之前，我们投入了大量精力为我们的用户开发创新和有用的技术。\n但在成为初创公司之前，Prototyo是一家公司。今天我们已经到了资源的尽头，没有找到预期的产品市场，所以盈亏平衡。\n经过几年的强烈奉献和对我们所建立的事业的热情，我们决定关闭公司。\n从第一秒开始，我就知道这将是一段艰难的旅程，路上有很多障碍。但我一点也不后悔。接下来的337,737,599秒充满了美好的经历，与令人惊叹的人分享。\n感谢那些一路支持我们的人，这是一次伟大的冒险。", "note_en": "This article could have been entitled 337,737,600 seconds, but hiding the fact that Prototypo started more than 10 years ago would have been a missed opportunity to show the dedication the team and I, as a founder, put in this project over the years.\n Prototypo started as a student project when I studied Graphic Design at H.E.A.R Strasbourg in France. As a non-savvy Type Designer I was frustrated to not be able to complete the typeface projects I had in mind. Typefaces are made of rules and systems, right? Catcha! We can code something that follows rules, so we should succeed in coding fonts. That was the starting point of the next 10 years, and the beginning of the Roller Coaster, a.k.a creating a startup company.\n Prototypo is a startup like many others: before having a stable and reliable business model, we put a lot of energy into developing innovative and useful technologies for our users.\n But before being a startup, Prototypo is a company. Today we have reached the end of our resources without having found the expected Product Market Fit, and so the Break-even.\n After several years of a strong dedication and passion for what we’ve built, we decided to shutdown the company.\n Since the first second, I knew that it would be a hard journey with many obstacles on the path. But I regret nothing. The next 337,737,599 seconds were full of great experiences, shared with amazing people.\n Thank you for those who supported us along the road, it was a great adventure.", "posttime": "2020-10-28 05:38:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "years,字体", "title": "10年零8个月零12天", "title_en": "10 years, 8 months and 12 days", "transed": 1, "url": "https://www.prototypo.io/blog/news/10-years-8-months-and-12-days/", "via": "", "real_tags": ["years", "字体"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1031626, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "另一天，黑客新闻(HackerNews)又一次关于招聘被打破的讨论。我最近看到的一次是由令人敬畏的Aline Lerner的一篇博客文章引发的(免责声明：Aline是我的朋友，我们去年合作写了一本招聘书)。现在，我100%同意招聘被打破了，Aline的帖子真的很贴心。事实上，很多“雇佣破裂”的文章都很有见地。\n但讨论线索是另一回事-它们没有抓住文章的要点。与招聘相比，讨论的线索甚至更不连贯。而且它们真的很重复。它们总是包含一些真相，但不可避免地会让我们得出过于简单化的结论，在我看来，这会在科技行业造成一种相当糟糕的态度。\n结论1：“招聘对应聘者来说很糟糕，但招聘经理可以为所欲为。”\n事实是，招聘对每个人来说都很难。这是毫无疑问的。这对应聘者和招聘经理来说都很难。当然，FAANGS和初创公司可能会有优势，但大多数招聘人员都试图在一家非FAANG、不性感的公司招聘员工。如果你从来没有做过，你应该在你职业生涯的某个时候尝试一下。这是一次令人难以置信的谦卑经历。或者，至少找一个花时间招聘的朋友，问他们最喜欢的战斗故事。\n是的，总的来说，权力和信息不对称有利于公司招聘。而且这种不对称性在FAANGs中要大得多。但即使是FAANG也不得不在招聘上投入大量的时间和精力。这对任何人来说都不容易。\n特别是如果你想把它做好的话。问任何一位成功的领导者(企业家、经理)，他们最多的时间花在什么上，要么是花在招聘上的一大笔钱(如果他们意识到问题并给予应有的关注)，要么是应对糟糕招聘的后果(如果他们不这样做)。\n结论2：“招聘是一件很糟糕的事--这是一次掷骰子。”\n我强烈反对这一点。在撰写“霍洛威技术招聘指南”时，我采访了几十位非常有思想的招聘经理和招聘人员。他们真的很擅长他们的工作。有一些共同的主题。他们对过程中的每一步都很周到。他们保持过程的平衡和公平，保持较高的门槛，但尊重候选人和他们的时间。他们没有追逐其他所有人都在追逐的候选人池-相反，他们找到了非传统的方式来发现真正有才华和上进心的人，而这些人并不在通常的嫌疑人池中。他们深思熟虑地考虑他们在寻找什么信号，以及如何最好地评估这些信号。而且，他们非常了解团队的需求和候选人的需求，真的很善于决定什么时候合适。但最重要的是，他们是有效的：他们建立了真正有才华的团队。\n有几家公司建造了令人惊叹的招聘引擎，证明他们能够组建真正强大的团队。你通常可以看出，如果一个人在某一特定时间在某家公司工作，那么这个人很可能非常聪明，非常有干劲(比如谷歌、Facebook、Strike、Dropbox在不同的时间点)。总会有噪音的。即使是最好的招聘经理有时也会犯招聘错误。当然，即使是最好的工程师也不一定适合每个职位或每家公司。\n再说一次，招聘很难。但我毫不怀疑，如果你考虑周到，你可以招得很好。而且真的，你不需要在这方面做到十全十美。你只需要比其他人做得更好。\n这句话有一定道理，但比“FAANGs在招聘方面差劲”要微妙得多。因为让我们面对现实吧，他们确实雇佣了非常聪明的人。我认识的一些最聪明的人现在都在FAANGS。所以让我们把这句话再去掉一点。\nFAANG确实在招聘方面做得很糟糕，比如他们的求职者经历。他们在做招聘决定时可能真的很慢。他们的招聘过程可能会很繁琐，而且看起来很武断。但他们通常可以逃脱惩罚，而你可能做不到！他们有一个强大的品牌，有趣的技术挑战(至少对一些人来说是有趣的)，还有一大笔钱。事实上，FAANG的一位工程副总裁告诉我：“我们的流程是我们可以逃脱惩罚的。”以至于他们甚至可以将其作为积极因素来处理：“我们的过程缓慢而漫长，因为我们非常有选择性。”\n听着，我敢肯定FAANG失去了一些有才华的候选人，他们对“你愿意和我们一起工作”的态度感到厌烦。他们肯定有很大的改进空间。但归根结底，他们正在运行的过程正在大规模培养大量真正聪明的人。事实上，我会争辩说，他们围绕战略、绩效管理/晋升等方面的内部流程对他们造成的损害比中断招聘造成的损害要大得令人难以置信-如果你有数千人申请为你工作，但你却失去了聘请一个有才华的人，那是一回事，但如果你雇佣了一个真正有才华、有干劲的人，他们为你工作了6到12个月，但没有发挥他们的潜力，并在痛苦的挫折感中离开，这是一回事。…。嗯，这是另一个帖子的主题)。\n“但是，”人们继续说，“FAANG也不知道怎么采访！”这就引出了我的第四个比喻。\n再说一次，这句话有一定道理，但如果你只停留在上面的陈述上，你就没有抓住要点。\nALGO/CODING面试是FAANG公司使用的主要招聘机制之一。而且他们令人难以置信地不受欢迎-至少在讨论帖子中是这样。但大公司多年来一直在研究他们的招聘数据，并将这些数据反馈到他们的招聘过程中(在此过程中创造了“人员分析”一词)。\n他们实际上只评估模式匹配技能(将问题映射到您以前见过的东西)。\n这些都是公正的批评，但这并不意味着这些采访真的很糟糕。我的意思是，如果你面试的时候得不到这份工作，他们可能会让你很难受。你可能是一位才华横溢的工程师，我同意，这些面试当然不能完全评估你的能力(或者你可能是一个狗屎工程师，我个人并不认识你)。无论如何，从“这次面试对我来说很糟糕”到“这次面试很糟糕”的飞跃仍然是相当大的。\n如果你是一家大型科技公司，拥有一个大品牌，而且薪资水平在Flevels.fyi中名列前茅，那么你可能会收到很多申请。因此，一个好的面试过程就是淘汰那些在你的公司表现不佳的人。要想在一家大型科技公司做得很好，你需要(我用的是非常宽泛的画笔，但这些公司90%的职位都是如此)：\n某种解决问题的技能，是原始智力和/或通过与您以前见过的东西进行模式匹配来解决问题的能力的混合。\n在一家知名的大公司获得/保持一份高薪工作的背景下，从事某些可能并不总是具有内在激励作用的工作的能力/承诺。\n希望你能明白我要说的是什么。基本上，正是对这类面试的批评，才是他们在这些公司工作得很好的原因。它们很好地代表了你将在那里做的工作，以及你有多愿意做这件事。如果你擅长模式匹配，并且愿意投入精力去练习以获得其中一份工作，那么你很可能会在这份工作中做得很好。\n并不是说那种类型的工作有什么不好。我在大型科技公司工作了几年，大部分时间的工作都很有启发性。但很多时候都不是。这是大量的模式匹配。查看其他人如何在代码库的不同部分解决问题，并根据我的用例进行调整。\n另一方面，如果你是一名才华横溢的工程师，正在为别人告诉你该做什么或做一些你不能立即与内在激励你联系起来的工作而苦苦挣扎，FAANG的面试只是帮了你和公司一个忙，把你排除在面试过程之外。\n所以事实是，没有单一的“最佳面试技巧”。在我们的书中，我们写了几章关于不同的面试技巧及其优缺点。白板上的面对面算法/编码面试，你在现有代码库中工作的面对面面试，带回家的面试，结对，试用期等等，这些都有优缺点。诀窍在于找到一种对公司和应聘者都有效的技术。\n而且，不同的公司和候选人的情况可能真的不同。Netflix的一位副总裁告诉我，他们是如何让一位非常有实力的候选人进来的，但当被要求进行一次白板式的面试时，他(礼貌地)告诉他们，到时候还不如拒绝他。他不擅长在白板上采访…。但是如果他们允许他回家写一些代码，他会很乐意讨论的。从那时起，许多Netflix团队为候选人提供了带回家的选择。\n真的，任何面试形式都可能很糟糕。它可能无法评估应聘者的公司需要的东西，这可能是一种负面的应聘者体验。你想要哪一种：\n一次白板面试，用繁重的算法来面试一个角色，在这个角色中，知识(或开发知识的能力)并不重要，由一个不关心自己工作的冷漠的工程师进行。\n一份设计糟糕的带回家的工作，需要你不具备也不需要的技能，而且你花了几个小时思考和工作，发送出去，但被拒绝了，没有得到任何反馈。\n多样性。我们真的，真的很不擅长多样性。我们正在好转，但我们还有很长的路要走。大多数行业都在追逐同样的候选人，并以同样的方式对他们进行评估。\n普遍不公平的做法。在公司有权力而候选人没有权力的情况下，情况可能会变得非常不公平。缺乏多样性只是其中一个副作用，其他副作用还包括糟糕的应聘者经历、不公平的薪酬以及许多其他因素。\n短期主义。招聘人员和招聘经理，他们只想不惜一切代价填补一个职位，而不考虑是否真的合适。许多招聘人员都在做应急工作，他们中的大多数都很差劲。真正好的是令人敬畏的，但井里的大部分都是毒药。当招聘经理面临招聘压力时，他们也可以是一样的。\n一般的无能。有时，公司不知道他们在寻找什么，或者在内部没有达成一致。有时他们只是有破碎的流程，他们无法跟踪他们在与谁交谈以及他们处于什么阶段。有时候，做面试的工程师根本不在乎面试或他们工作的公司。通常情况下，公司非常优柔寡断，这使得他们做出决定的速度非常慢，或者因为拿不定主意就拒绝候选人。\n作为一家公司，你所能做的最多就是对你的流程深思熟虑，做到公平。这不容易，但是可行的。作为一名候选人，如果你有这样的特权，你能做的最好的就是努力找到那些在招聘过程中考虑周到、公平的公司并与之合作。", "note_en": "Another day, another HackerNews discussion about hiring being broken. The most recent one I saw was triggered by  a blog post by the formidable Aline Lerner (disclaimer: Aline is a friend and we collaborated on a  hiring book last year). Now, I 100% agree that hiring is broken, and Aline’s post is really thoughtful. In fact, a lot of “hiring is broken” articles are thoughtful.\n But the discussion threads are something else—they miss the point of the article. The discussion threads are even more broken than hiring. And they’re really repetitive. They always do contain grains of truth, but inevitably have us reaching conclusions that are simplistic, and in my opinion, create a pretty bad attitude in the tech industry.\n Conclusion #1: “Hiring sucks for candidates, but hiring managers can do what they want“\n The truth is that hiring is hard for everyone. There’s no question about it. It’s hard for both candidates and for hiring managers. Sure, FAANGs and the startup-du-jour might have a leg up, but most people who are hiring are trying to hire at a non-FAANG, non-sexy company. If you’ve never done it, you should try it at some point in your career. It’s an  incredibly humbling experience. Or, at the very least, find a friend who’s spent time on hiring, and ask them for their favorite battle story.\n And yes, on the balance, power and information asymmetry work out in favor of the companies hiring. And that asymmetry is much larger with FAANGs. But even FAANGs have to invest a tremendous amount of time and energy into hiring. It’s not really easy for anyone.\n Especially if you want to do it  well. Ask any successful leader (entrepreneur, manager) what they spend most of their time on, and it’ll either involve a large chunk spent on hiring (if they appreciate the problem and give it the attention it deserves) or dealing with the consequences of bad hiring (if they don’t).\n Conclusion #2: “Hiring is a crap-shoot—it’s a roll of the dice“\n I strongly disagree with this one. When writing the  Holloway Guide to Technical Hiring and Recruiting, I got to interview dozens of really thoughtful hiring managers and recruiters. They were really good at their jobs. And there were some common themes. They were thoughtful about every step of their process. They kept their process balanced and fair, holding a high bar but respecting candidates and their time. They didn’t chase the same pool of candidates everyone else was chasing—instead, they found non-traditional ways to discover really talented and motivated people who weren’t in the pool of usual suspects. They were thoughtful about what signals they were looking for and how best to assess them. And, they deeply understood their team’s needs, and candidates’ needs, and were really good at deciding when there was or wasn’t a fit. But most of all, they were effective: they built really talented teams.\n There are a handful of companies that have built amazing hiring engines, and the proof is that they’ve been able to put together really strong teams. You can generally tell that if a person worked at a certain company at a certain time, that person is probably incredibly intelligent and incredibly motivated (some examples are Google, Facebook, Stripe, Dropbox at different points in time). There will always be noise. Even the best hiring managers will sometimes make hiring mistakes. And of course, even the best engineers may not be a fit for every role or every company.\n Again, hiring is hard. But there is not a shred of doubt in my mind that if you are thoughtful about it, you can hire well. And really, you don’t need to be perfect at it. You just need to be better than the rest.\n  This one has some truth to it, but it’s a lot more subtle than “FAANGs suck at hiring”. Because let’s face it, they do hire really smart people. Some of the smartest people I know are at FAANGs right now. So let’s decouple that statement a little more.\n FAANGs  do suck at parts of hiring, like their candidate experience. They can be really slow at making hiring decisions. Their hiring process might be tedious and seem arbitrary. But  they usually can get away with it,  and you probably can’t! They’ve got a strong brand, interesting technical challenges (interesting for some people, at least), and a lot of money. In fact, one FAANG VP of Engineering told me: “our process is what we can get away with”. To the point that they can even play it off as a positive: “our process is slow and long because we are  very selective”.\n And look, I’m sure FAANGs lose some talented candidates who get turned off by their “you’d-be-blessed-to-work-with-us” attitude. They definitely have a lot of room for improvement. But at the end of the day, they’re operating a process that’s delivering large quantities of really smart people at scale. In fact, I’d argue their internal processes around strategy, performance management / promotions, etc cause incredibly  more damage to them than broken hiring—if you lose out on hiring one talented person when you have thousands applying to work for you, that’s one story, but if you hire someone really talented and driven, and they work for you for 6 to 12 months but don’t meet their potential and leave in bitter frustration… well, that’s a subject for another post)\n “But”, people go on, “FAANGs  also don’t know how to interview!” Which brings me to trope #4.\n  Again, this one has some truth to it, but if you just stop at the above statement, you miss the point.\n Algo/coding interviews are one of the primary hiring mechanisms used by FAANG companies. And they are incredibly unpopular—at least in discussion threads. But big companies have spent years looking at their hiring data and feeding that back into their hiring process (coining the term “ people analytics” along the way).\n  they really only assess pattern-matching skills (map a problem to something you’ve seen before)\n These are fair criticisms, but that doesn’t mean these interviews are actually terrible. I mean, they might be terrible for you if you’re interviewing and you don’t get the job. You’re probably a brilliant engineer, and I agree, these interviews certainly don’t fully assess your ability (or maybe you’re a shit engineer, I don’t know you personally). In any case, the leap from “this interview sucked for me” to “this interview sucks” is still pretty big.\n If you’re a large tech co with a big brand and a salary scale that ranks at the top of  Levels.fyi, you probably get a lot of applications. So a good interview process is one that weeds out people who wouldn’t do well at your company. To do well at a large tech company, you need to (and I’m painting with a really broad brush, but this is true for 90% of roles at these companies):\n Some sort of problem-solving skill that’s a mix of raw intelligence and/or ability to solve problems by pattern-matching to things you’ve seen before.\n Ability/commitment to work on something that may not  always be that intrinsically motivating, in the context of getting/maintaining a well-paying job at a large, known company.\n Hopefully you can see where I’m going with this. Basically, the very criticisms thrown at these types of interviews are the reason they work well for these companies. They’re a good proxy for the work you’d be doing there and how willing you are to do it. If you’re good at pattern matching, and are willing to invest effort into practicing to get one of these jobs, you’ll probably do well at the job.\n Not that there’s anything wrong with that type of work. I spent several years at big tech co’s, and the work was intellectually stimulating most of the time. But a lot of times it wasn’t. It was a lot of pattern-matching. Looking at how someone else had solved a problem in a different part of the code-base, and adapting that to my use-case.\n On the other hand, if you’re a brilliant engineer who struggles with being told what to do or doing work that you can’t immediately connect to something intrinsically motivating to you, that FAANG interview just did both you and the company a favor by weeding you out of the process.\n So the truth is, there is no single “best interview technique”. In our book, we wrote several chapters about different interviewing techniques and their pros and cons. In-person algo/coding interviews on a whiteboard, in-person interviews where you work in an existing code base,  take-home interviews, pairing together, having a trial period, etc all have pros and cons. The trick is finding a technique that works for both the company and the candidate.\n And that can really differ from company to company and candidate to candidate. A VP at Netflix told me about how they had a really strong candidate come in, but when asked to do a whiteboard-type interview, informed them (politely) that they might as well just reject him then. He was no good at whiteboard interviews… But if they allowed him to go home and write some code, he’d be happy to talk through it. And since then, many Netflix teams have offered candidates the choice of doing a take home.\n And really, any interview format can suck. It can fail to assess a candidate for the things a company needs and it can be a negative candidate experience. Which would you rather have:\n A whiteboard interview with heavy algorithms for a role where that knowledge (or ability to develop that knowledge) isn’t critical, delivered by an apathetic engineer who doesn’t care about their job.\n A poorly-designed take-home, requiring skills that you don’t have and won’t need for the job, and that you spend hours thinking through and working on, send in, and get rejected without getting any feedback.\n    Diversity. We really, really suck at diversity. We’re getting better, but we have a long way to go. Most of the industry chases the same candidates and assesses them in the same way.\n Generally unfair practices. In cases where companies have power and candidates don’t, things can get really unfair. Lack of diversity is just one side-effect of this, others include poor candidate experiences, unfair compensation, and many others.\n Short-termism. Recruiters and hiring managers that just want to fill a role at any cost, without thinking about whether there really is a fit or not. Many recruiters work on contingency, and most of them suck. The really good ones are awesome, but most of the well is poison. Hiring managers can be the same, too, when they’re under pressure to hire.\n General ineptitude. Sometimes companies don’t knowing what they’re looking for, or are not internally aligned on it. Sometimes they just have broken processes, where they can’t keep track of who they’re talking to and what stage they’re at. Sometimes the engineers doing the interviews couldn’t care two shits about the interview or the company they work at. And often, companies are just tremendously indecisive, which makes them really slow to decide, or to just reject candidates because they can’t make up their minds.\n As a company, the best you can do is be thoughtful and fair with your process. It’s not easy, but it’s doable. And as a candidate, the best you can do is try to find and work with companies that are thoughtful and fair with their hiring processes if you have that privilege.", "posttime": "2020-10-28 05:32:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,新闻,myths,招聘", "title": "黑客新闻讨论中常见的雇佣误区", "title_en": "Hiring Myths Common in Hacker News Discussions", "transed": 1, "url": "https://somehowmanage.com/2020/10/27/4-hiring-myths-common-in-hackernews-discussions/", "via": "", "real_tags": ["黑客", "新闻", "myths", "招聘"]}, {"category": "", "categoryclass": "", "imagename": "b5d0f1167a86fdbbb8945644fc4c54f6.png", "infoid": 1031625, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们使用可选的第三方分析Cookie来了解您是如何使用GitHub.com的，这样我们就可以构建更好的产品。您始终可以通过单击页面底部的Cookie首选项来更新您的选择。有关更多信息，请参阅我们的隐私声明。\n我们使用基本Cookie来执行基本的网站功能，例如，它们用于让您登录。了解更多。\n我们使用分析Cookie来了解您如何使用我们的网站，以便我们可以改进它们，例如，它们用于收集有关您访问的页面以及完成任务需要点击多少次的信息。了解更多", "note_en": "We use  optional third-party analytics cookies to understand how you use GitHub.com so we can build better products.   You can always update your selection by clicking  Cookie Preferences at the bottom of the page. For more information, see our  Privacy Statement.\n  We use essential cookies to perform essential website functions, e.g. they&#39;re used to log you in.  Learn more\n  We use analytics cookies to understand how you use our websites so we can make them better, e.g. they&#39;re used to gather information about the pages you visit and how many clicks you need to accomplish a task.  Learn more", "posttime": "2020-10-28 05:32:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,下载,存储", "title": "通过DMCA存储库下载youtube-dl", "title_en": "Download YouTube-dl via the DMCA repository", "transed": 1, "url": "https://gist.github.com/nero/fbf6d91a3130f2ab5371db677ad102da", "via": "", "real_tags": ["youtube", "下载", "存储"]}, {"category": "", "categoryclass": "", "imagename": "669e4c00f1ad48a7e1fa251a955a720c.jpg", "infoid": 1031624, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Netflix今年在一线明星主演的备受瞩目的故事片上下了重注：首先是克里斯·海姆斯沃斯(Chris Hemsworth)出演，然后是奥斯卡获奖女演员查理兹·塞隆(Charlize Theron)出演的老卫士(The Old Guard)。这一押注在很大程度上得到了回报。现在，这家流媒体平台已经聘请了另一位奥斯卡获得者乔治·克鲁尼(George Clooney)执导并主演这部后世界末日的科幻电影“午夜天空”(The Midnight Sky)。该剧改编自莉莉·布鲁克斯·道尔顿2016年的处女作“早安，午夜”，这部小说被拿来与金·斯坦利·罗宾逊的“极光”和艾米丽·圣约翰·曼德尔的“十一号车站”相提并论。官方预告片刚刚停了下来，它给我们带来了一些强烈的客场氛围(可惜，仅仅一季之后，Netflix就取消了这部预告片)。\n在这部小说中，一位名叫奥古斯丁的杰出天文学家被派往北极，扫描夜空寻找宇宙诞生的线索。然后，一场神秘的全球末日发生了，促使他所有的科学家同事撤离。但奥古斯丁仍然留在后面，致力于继续他的研究，即使电波变得寂静。与此同时，太空船“以太”号上的一组宇航员将在完成木星任务后返回地球。在船上的是萨利，她牺牲了自己的婚姻，把女儿留在了身后，以便成为第一批在我们太阳系旅行这么远的人类之一。宇航员们没有意识到降临到地球上的灾难，奥古斯丁来警告他们不要回来。\n克鲁尼的电影改编看起来将与小说紧密相连。根据官方假设：这部后世界末日的故事讲述了北极孤独的科学家奥古斯丁(克鲁尼、辛瑞亚娜、阿尔戈饰)竞相阻止萨利(费利西蒂·琼斯，《盗贼一号：星球大战故事》)和她的宇航员同伴们返回家园，遭遇一场神秘的全球灾难。演员阵容还包括大卫·奥耶洛沃(塞尔玛，唐&39；汤姆·阿德沃尔(Tom Adewole)饰演指挥官汤姆·阿德沃尔(Tom Adewole)，伊桑·佩克(Ethan Peck)饰演“星际迷航：发现”(Star Trek：Discovery)，索菲·朗德尔(Sophie Rundle)饰演马修，蒂芙尼·布恩(Tiffany Boone)(以下饰)饰演玛雅，黛米安·比希尔(Demián Bichir)饰演桑切斯，曹琳·斯普林格尔饰演爱丽丝，奥古斯丁在北极交上了一个神秘的孩子。\n预告片的开头是一片广袤的雪地，然后切换到克鲁尼饰演的奥古斯丁试图联系太空船上的宇航员-并与年轻的爱丽丝交换了一下沮丧的眼神，然后补充道，有人在那里吗？与此同时，在深空，萨利试图与地球联系；自从以太号最后一次与任务控制中心联系以来，已经过去了三个星期。奥古斯丁告诉伊希斯，以太本应是人类未来的希望：仅在我们的银河系，就有数十亿颗恒星。它们中至少有一个具有维持生命的潜力。\n这项任务现在比以往任何时候都更加关键，这就是为什么他必须找到一种方法来警告机组人员地球上的灾难性条件。(我们没有被告知到底发生了什么，除了它是从一个错误开始的。&#34；)要做到这一点，奥古斯丁需要去一个天线更坚固的设施。既然他不能离开艾瑞斯，她就来了。至于宇航员们，他们发现自己在思考生死的重大问题，就像一个潜在的前往木星的单向任务中的人所做的那样，并怀疑所有的牺牲最终是否值得。\n《午夜天空》将于12月在部分影院上映，2020年12月23日登陆Netflix。", "note_en": "Netflix has bet heavily this year on high-profile feature films starring A-list talent: first with Chris Hemsworth in   Extraction, and then with Oscar-winning actress Charlize Theron in   The Old Guard. That  bet has largely  paid off. Now the streaming platform has tapped another Oscar winner, George Clooney, to direct and star in the post-apocalyptic science fiction film   The Midnight Sky. It&#39;s adapted from the critically acclaimed 2016 debut novel,   Good Morning, Midnight, by Lily Brooks-Dalton, which has been compared to Kim Stanley Robinson&#39;s   Aurora and Emily St. John Mandel&#39;s   Station Eleven. The official trailer just dropped, and it&#39;s giving us some strong   Away vibes (which, alas, has been  canceled by Netflix after just one season).\n In the novel, a brilliant astronomer named Augustine is posted to the Arctic, scanning the night sky for clues about the birth of the universe. Then a mysterious global apocalypse occurs, prompting all his fellow scientists to evacuate. But Augustine remains behind, dedicated to continuing his research, even as the airwaves go silent. Meanwhile, a team of astronauts aboard the spaceship  Aether is set to return to Earth after a mission to Jupiter. On board is Sully, who sacrificed her marriage and left her daughter behind in order to become one of the first humans to travel so far in our Solar System. The astronauts are unaware of the catastrophe that has befallen Earth, and it falls to Augustine to warn them not to return.\n  Clooney&#39;s film adaptation looks like it will hew closely to the novel. Per the official premise: &#34;This post-apocalyptic tale follows Augustine (Clooney,  Syriana, Argo), a lonely scientist in the Arctic, as he races to stop Sully (Felicity Jones,   Rogue One: A Star Wars Story) and her fellow astronauts from returning home to a mysterious global catastrophe.&#34; The cast also includes David Oyelowo ( Selma,  Don&#39;t Let Go) as Commander Tom Adewole, Ethan Peck (  Star Trek: Discovery), Sophie Rundle ( Peaky Blinders), Kyle Chandler ( Bloodline,  First Man) as Matthew, Tiffany Boone ( The Following) as Maya, Demián Bichir ( A Better Life) as Sanchez, and Caoilinn Springall as Iris, a mysterious child that Augustine befriends in the Arctic.\n The trailer opens on a vast snowy expanse before cutting to Clooney&#39;s Augustine attempting to contact the astronauts aboard the  Aether—and exchanging a defeated look with young Iris before adding, &#34;Is anyone out there?&#34; Meanwhile, in deep space, Sully is attempting to make contact with Earth; three weeks have passed since the  Aether&#39;s last communication with Mission Control. Augustine tells Isis that the  Aether was supposed to be the hope for mankind&#39;s future: &#34;In our galaxy alone, there are billions of stars. At least one of them has the potential to support life.&#34;\n That mission is now more critical than ever, which is why he has to find a way to warn the crew about the catastrophic conditions on Earth. (We are not told what, exactly, happened, except that &#34;it started with a mistake.&#34;) To do so, Augustine needs to get to a facility with a stronger antenna. Since he can&#39;t leave Iris, she comes along. As for the astronauts, they find themselves pondering the big questions of life and death, as one does on a potential one-way mission to Jupiter, and wondering if all the sacrifice will be worth it in the end.\n The Midnight Sky will play in select theaters in December before coming to Netflix on December 23, 2020.", "posttime": "2020-10-28 05:18:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "北极,clooney,饰演", "title": "乔治·克鲁尼在“午夜天空”预告片中是一位头发花白的北极天文学家。", "title_en": "George Clooney is a grizzled Arctic astronomer in The Midnight Sky trailer", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/george-clooney-is-a-grizzled-arctic-astronomer-in-the-midnight-sky-trailer/", "via": "", "real_tags": ["北极", "clooney", "饰演"]}, {"category": "", "categoryclass": "", "imagename": "78790afda8df88421656de83a59fc7bf.jpg", "infoid": 1031623, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据好莱坞报道，前The Daily Show主持人乔恩·斯图尔特(Jon Stewart)与Apple TV+签署了一份多年协议，将编剧、主演和制作一档时事节目，苹果和斯图尔特预计将播出多季。\n五年前，喜剧演员兼评论员乔恩·斯图尔特(Jon Stewart)辞去了主持喜剧中心“每日秀”(The Daily Show)的角色-许多人观察到，就在一年前，他的观众最想要他。\n从那时起，他偶尔会出现在他的前同事斯蒂芬·科尔伯特(Stephen Colbert)在CBS的“深夜秀”(The Late Show)中很少露面的小片段，他出现在一些媒体采访中，他执导了一部电影，他和其他热门喜剧演员戴夫·查佩尔(Dave Chapelle)一起进行了一次喜剧巡演。不过，大多数时候，他都是在新泽西州的农场过着家庭生活。\n这将是斯图尔特在2015年明显退休后的第一次定期电视合作。“好莱坞报道”将苹果与斯图尔特的协议描述为一笔非常昂贵的多年协议，这也将使苹果有权参与斯图尔特可能开发的其他项目。\n报道称，新节目将有长达一小时的版式，每集将聚焦于公众关注的特定问题。THR还表示，斯图尔特将重返主播宝座，这表明该节目将保留“每日秀”(The Daily Show)(现在由特雷弗·诺亚(Trevor Noah)主持)的新闻台模式，以及现在许多模仿者。", "note_en": "Former  The Daily Show host Jon Stewart has signed a multiyear deal with Apple TV+ to write, star in, and produce a current affairs show that Apple and Stewart expect to run for multiple seasons, according to a report from  The Hollywood Reporter.\n Five years ago, comedian and commentator Jon Stewart  departed his role hosting Comedy Central&#39;s  The Daily Show—just a year before his audience would have wanted him most, many have  observed.\n Since then, he has occasionally appeared to do  small and infrequent segments on his former colleague Stephen Colbert&#39;s  The Late Show on CBS, he&#39;s appeared in some media interviews, he directed one film, and he did a comedy tour  with fellow topical comedian Dave Chapelle. Mostly, though, he has lived the family life  at his farm in New Jersey.\n This would be Stewart&#39;s first regular TV commitment after his apparent retirement in 2015. The Hollywood Reporter describes Apple&#39;s arrangement with Stewart as &#34;an expansive, multi-year deal,&#34; which will also give Apple dibs on other projects Stewart may develop.\n According to the report, the new show will have an hour-long format, and each episode will focus on a specific issue of public concern. THR also says that Stewart will be &#34;back in the anchor&#39;s chair,&#34; suggesting that the show will retain the newsdesk format of  The Daily Show (which is now hosted by Trevor Noah) and its now-many imitators.", "posttime": "2020-10-28 05:17:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,show", "title": "The Daily Show的乔恩·斯图尔特(Jon Stewart)将在新的Apple TV+系列剧中回归", "title_en": "The Daily Show’s Jon Stewart will return in new Apple TV+ series", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/the-daily-shows-jon-stewart-will-return-in-new-apple-tv-series/", "via": "", "real_tags": ["apple", "show"]}, {"category": "", "categoryclass": "", "imagename": "bba23caceda2c6c90d802d65e55a75f2.jpg", "infoid": 1031622, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TC会议：太空提供了一个无与伦比的网络机会，可以与太空工业中最重要的人会面，涉及公共、私人和国防领域。你将能够与来自世界各地的数百名工程师、创始人、学生、投资者、高管、军方和政府官员举行会议。CrunchMatch是我们免费的人工智能平台，它将您与与您有相同特定业务兴趣和目标的人联系起来。它使联网变得更容易、更高效、更有生产力。\n在你注册了TC Sessions：Space 2020之后，你将被邀请到CrunchMatch平台，在那里你将回答几个关于你想会见谁的快速问题。然后，CrunchMatch开始寻找并推荐与你的目标一致的人。您可以发送邀请和安排1：1视频呼叫。您还可以选择手动搜索。与投资者、创始人、工程师、研发团队、制造商、学生、潜在客户或员工建立联系。CrunchMatch使它更快、更容易。\n职业提示：在11月13日晚上11点59分早鸟定价结束之前购买通行证。(PT)。我们为学生、政府、军队和非营利性组织提供折扣通行证，目前额外的Crunch订户在通行证上可以获得20%的折扣。\n这可能是我们的第一次太空会议，但不是我们的第一次竞技表演。阅读其他TC会议的与会者对CrunchMatch网络的看法。\n“TC Sessions的关系网非常棒。我们公司在美国市场的势头不断增强，有机会与所有参与者见面和交谈是非常重要的。CrunchMatch平台使连接变得容易。“--WunderMobility副总裁Melika Jahangiri说。\n“CrunchMatch基本上是技术人员的快速约会，它非常有帮助。我安排了至少10次简短而精确的会议。我了解了秘密模式下的初创企业，了解了大公司在做什么-媒体还没有注意到的事情。这很棒，我跟进了其中的三四个联系。“--SAP技术主管兼产品经理延斯·莱曼(Jens Lehmann)。\n准备好深入探讨3D打印火箭、发射服务、轨道运营、地面站网络等主题。了解创新技术，发现新兴趋势和潜在机遇。\nTC会议：太空2020将于12月16日至17日升空。今天就购买通行证，开始与空间技术社区联系，向决心深入宇宙的人学习，并与他们合作。\n贵公司是否有兴趣赞助TC Sessions：Space 2020？请单击此处与我们讨论可用的机会。", "note_en": "TC Sessions: Space offers an unparalleled networking opportunity to meet the most important people in the space industry, across public, private and defense. You’ll be able to set up meetings with hundreds of engineers, founders, students, investors, executives, military and government officials from around the world. CrunchMatch, our free, AI-powered platform connects you with the people who share your specific business interests and goals. It makes networking easier, efficient and more productive.\n After you register for  TC Sessions: Space 2020, you’ll get invited to the CrunchMatch platform where you’ll answer a few quick questions about who you want to meet. Then CrunchMatch gets to work to find and recommend people who align with your goals. You can send invites and schedule 1:1 video calls. You also have the option to search manually. Connect with investors, founders, engineers, R&amp;D teams, manufacturers, students, potential customers or employees. CrunchMatch makes it faster and easier.\n  Pro Tip:  Buy your pass before early-bird pricing ends on November 13 at 11:59 p.m. (PT). We offer discount passes for students, government, military and non-profits, and current Extra Crunch subscribers receive a 20 percent discount on passes.\n This may be our first space conference, but it’s not our first rodeo. Read what attendees from other TC Sessions say about networking with CrunchMatch.\n “The networking at TC Sessions is terrific. Our company’s building momentum in the U.S. market, and the opportunity to meet and talk with all the players is very important. The CrunchMatch platform made it easy to connect.”— Melika Jahangiri, vice president at Wunder Mobility.\n “The CrunchMatch is basically speed-dating for techies, and it was very helpful. I scheduled at least 10 short, precise meetings. I learned about startups in stealth mode, what big corporations were up to — things not yet picked up by the press. It was great, and I followed up on three or four of those connections.” — Jens Lehmann, technical lead and product manager, SAP.\n Get ready for a deep dive on topics like 3D-printed rockets, launch services, orbital operations, ground station networks and beyond. Learn about innovative tech, discover emerging trends and potential opportunities.\n TC Sessions: Space 2020 lifts off December 16-17.  Buy your pass today and start connecting with the space tech community, learn from and partner with the people determined to push deeper into the cosmos.\n Is your company interested in sponsoring TC Sessions: Space 2020?  Click here to talk with us about available opportunities.", "posttime": "2020-10-28 05:13:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,crunchmatch,level", "title": "\n在我们的TC会议上使用CrunchMatch启动下一级网络：太空活动", "title_en": "\n\t\t\t\tLaunch next-level networking with CrunchMatch at our TC Sessions: Space event\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/launch-next-level-networking-with-crunchmatch-at-our-tc-sessions-space-event/", "via": "", "real_tags": ["太空", "level"]}, {"category": "", "categoryclass": "", "imagename": "057382724503c8f439c5c2f3b2541023.jpeg", "infoid": 1031621, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TechCrunch的员工收到了这封电子邮件表格，一式两份，只有很小的改动。在电子邮件中，发件人解释说，他们代表或声援世界各地的亚美尼亚人。亚美尼亚人是一个在土耳其总统塔伊普·埃尔多安(Tayyip Erdogan)的独裁统治和地区影响下遭受苦难的民族和民族。\nSpaceX计划在未来一两个月内发射土耳其卫星Turksat-5A，这是一颗由空中客车公司制造的地球静止通信卫星，将服务于欧洲、亚洲和中东的大片地区。这笔交易已经存在很长时间了，SpaceX首席执行官兼创始人埃隆·马斯克甚至在2017年前往土耳其，就卫星问题与埃尔多安会面。\n卷入亚美尼亚、阿塞拜疆、土耳其以及周边国家和大国长期冲突的复杂性超出了本文的范围，但说埃尔多安政权和其他人统治下存在严重侵犯人权的行为几乎是没有争议的。“种族灭绝”这个词经常被使用。\n正如这封恳求邮件指出的那样，许多国家和政府选择谴责土耳其的行为，一些公司已经停止了与政府的业务往来。SpaceX会加入他们吗？\n在这个阶段-发射前一个月，有效载荷可能已经锁定-SpaceX似乎不太可能返还土耳其无疑已经支付的数百万美元，以便通过剥离那里的政府来显得更道德。\n但这场运动提出了一个合理的问题，专注于科技的新公司越来越多地面临着一个越来越多的问题，这些公司正在涵盖一个多样化的、有时很难驾驭的全球社区。像SpaceX这样的公司-或苹果(Apple)、谷歌(Google)、Facebook或空客(Airbus)-的界限在哪里？SpaceX是否应该是无私和唯利是图的，简单地向任何付费的人提供服务？还是有一些政府或个人的钱它是不会接受的？\n到目前为止，SpaceX在这方面还没有走得太窄；发射行业很大程度上倾向于军事和政府合同，所以这笔交易已经和那个魔鬼达成了。但随着它变得更加成熟，对客户可能会更加挑剔，它可能会考虑在10年前还是一个破门而入的行业中充当守门人。\n至于电子邮件活动，TechCrunch的工作人员对其避开谷歌垃圾邮件过滤器的有效性感到惊讶。我联系了Artsakh Strong，他在电子邮件中被列为活动的发起人，以获得更多信息，并将从未来的电子邮件中删除(我确实是)。\n斯特朗说，这些电子邮件是由个人发送的，而不是从中央位置发送的，尽管它们的内容重复，但这可能是它们全部进入我们的收件箱的原因。她写道：“这些人聚集在一起，发出他们统一的声音。”“。我们不隶属于任何团体，但我们的信息是每个亚美尼亚裔美国人都有的。对于给您带来的不便，我深表歉意，因为您必须删除过多的电子邮件，但我们的人每天都在被谋杀，我们需要引起人们对我们事业的关注。“。\n她建议，作为一家美国公司，SpaceX应该体现该国(应该)的价值观，拒绝与埃尔多安这样的政权做生意。此外，她指出，SpaceX从美国政府获得了大量资金和业务，这相当于对其交易的间接祝福，认为这符合公众利益。\n她写道：“有人呼吁美国和其他北约国家制裁土耳其。”“强烈敦促SpaceX公司考虑所有这些因素，在如此压倒性和明确的犯罪行为证据面前，自己决定是否要继续援助土耳其。至少，埃隆·马斯克和SpaceX可以停止发射，看看这些调查会导致什么结果。虽然这对SpaceX来说可能是利润的损失，但对世界的进步来说却是一个巨大的飞跃。“。\n斯特朗提出了一些合理的观点，即许多在国际上提供服务的公司必须解决问题，或者从他们的行动中推断出他们的意图。这不可能是第一次，也不会是最后一次，SpaceX或任何新一代太空公司都将不得不做出艰难的选择。至少，他们可能会解释为什么他们选择这样做。", "note_en": "In the form email, received by TechCrunch staff hundreds of times in duplicate and with minor variations, the senders explain that they represent or stand in solidarity with Armenians worldwide, an ethnic and national group that has suffered under the authoritarian rule and regional influence of Turkey’s President, Tayyip Erdogan.\n SpaceX is slated to launch the Turkish satellite Turksat-5A in the next month or two, a geostationary communications satellite built by Airbus that will serve a large area of Europe, Asia, and the Middle East. The deal has been on the books for a long time, and SpaceX CEO and founder Elon Musk even traveled to Turkey to meet with Erdogan regarding the satellite in 2017.\n To enter into the complexities of the  long conflict in which Armenia, Azerbaijan, Turkey, and nearby countries and powers have figured is beyond the scope of this article, but it is hardly controversial to say that there have been  serious human rights abuses under Erdogan’s regime and others. The word “genocide” is frequently used.\n  As the email plea points out, many countries and governments have opted to condemn Turkey’s behavior, and some companies have stopped doing business with the government. Will SpaceX join them?\n At this stage — a month before launch, when the payload is likely already locked in — it seems unlikely that SpaceX will return the millions of dollars Turkey has no doubt already paid it, in order to appear more ethical by deplatforming, as it were, the government there.\n But the campaign raises a legitimate question that is increasingly faced by new tech-focused companies growing to encompass a global community that is diverse and at times difficult to navigate. Where do companies like SpaceX — or Apple, or Google, or Facebook, or for that matter Airbus — draw the line? Should SpaceX be disinterested and mercenary, simply providing services to anyone who pays? Or are there some governments or people whose money it will not take?\n So far SpaceX hasn’t had to walk too narrow a path on that front; the launch industry is heavily weighted toward military and government contracts, so the deal is already made with that particular devil. But as it becomes more established and can be a bit more choosy with its customers, it may consider acting as a gatekeeper in the industry where 10 years ago it was a gatecrasher.\n  As for the email campaign, TechCrunch staff were surprised at its effectiveness in eluding Google’s spam filters. I contacted Artsakh Strong, listed in the email as the originator of the campaign, for more information and to be removed from future emails (which I was).\n Strong said that the emails were sent by individuals, not from a central location, which despite their duplicative content may account for their all making it to our inboxes. “These are people who are coming together to make their unified voice heard,” she wrote. ” We are not affiliated with any groups but our message is one shared by every Armenian American. I apologize for the inconvenience of you having to delete excessive emails but our people are being murdered on a daily basis and we need to bring attention to our cause.”\n She suggested that as an American company, SpaceX should embody the country’s (supposed) values and refuse to do business with regime’s like Erdogan’s. Furthermore, she noted that SpaceX receives a great deal of funding and business from the U.S. government, which amounts to a secondhand blessing of its deals as being in the public interest.\n “There are calls for sanctions of Turkey by the US and other NATO countries,” she wrote. “SpaceX is strongly urged to take all these factors into consideration and decide for itself whether or not it wants to continue to aid Turkey in the face of such overwhelming and clear evidence of criminal actions. At the very least, Elon Musk and SpaceX can halt the launch to see what these investigations lead to. While this may be a loss of profit for SpaceX it would be a huge leap for world progress.”\n Strong raises legitimate points that many companies providing services internationally must address or have their intentions inferred from their actions. This cannot be the first, nor will it be the last, that SpaceX or any of the new generation of space companies will have to make a difficult choice. At the very least they might explain why they choose how they do.", "posttime": "2020-10-28 05:13:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "政权,email,spacex", "title": "\n亚美尼亚电子邮件运动要求SpaceX不要帮助土耳其政权发射卫星", "title_en": "\n\t\t\t\tArmenian email campaign asks SpaceX not to aid Turkish regime with satellite launch\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/armenian-email-campaign-asks-spacex-not-to-aid-turkish-regime-with-satellite-launch/", "via": "", "real_tags": ["政权", "email", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "5ca8b45f878e45d310022003b6029e27.jpg", "infoid": 1031620, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这封致欧盟委员会的联名信已由Ecosia、DuckDuckGo、Lilo、Qwant和Seznam签署，要求欧盟高管、谷歌和这五家搜索竞争对手召开三方会议--“目标是建立一个有效的偏好菜单”。\n“我们是运营搜索引擎的公司，与谷歌竞争。如你所知，我们对谷歌为解决其在Android案中的反竞争行为带来的不利影响而创造的所谓补救措施深感不满，“他们写道。“据我们所知，谷歌会定期更新你关于付费竞价的最新消息，但看起来你可能没有收到完整或准确的信息。”\n欧盟委员会的一位女发言人证实已经收到了这封信，并表示将在适当的时候做出回应，并补充说，这是“过去看到的，选择屏幕可以是促进用户选择的有效方式”。\n这位发言人还告诉我们：“我们一直在与谷歌讨论选择屏幕机制，遵循市场的相关反馈，特别是关于选择屏幕的呈现和机制，以及竞争对手搜索提供商的选择机制。”她补充说，委员会“致力于全面和有效地执行决定”，并“将继续密切监测选择屏幕机制的实施情况”。\n早在2018年，欧盟反垄断部门就对谷歌(Google)处以50亿美元的罚款，原因是谷歌违反了与其智能手机平台运营方式相关的竞争规定，并指示该公司对发现的问题做出回应--导致谷歌向欧洲的Android用户提供搜索引擎选择屏幕，而不是简单地预加载自己的屏幕。\n谷歌最初根据竞争对手的本地市场份额提供选择，但很快转向付费拍卖模式。这似乎使较大的商业实体受益，但代价是牺牲了专注于隐私的、地区性的和非营利性的替代方案。\n例如，支持隐私的DuckDuckGo在最近的拍卖中落败，而微软旗下的必应(Bing)获得了更多的席位。前者降低了出价，称其认为无法在有利可图的情况下赢得一席之地。\n欧洲科技向善非营利性组织Ecosia-利用搜索点击收入为植树提供资金-也谴责这种模式不公平，一开始甚至完全抵制它。在看到其收入在冠状病毒危机期间遭受巨大打击后，该公司做出了让步。(尽管在最近的拍卖中未能在几乎每个市场都获得一席之地。)\n与此同时，谷歌在该地区的搜索市场份额继续保持在90%以上。\n这五个竞争对手辩称，谷歌将选择屏幕上的可用位置限制在3个(谷歌自己的搜索引擎是第四个主要选项)，这是对搜索市场的不公平限制。\n他们希望有一个合作的过程来设计一个选择屏幕，而不是允许谷歌继续设计自己的“解决方案”-支持一个免费的选择屏幕，比目前的三个(非谷歌的)选项有更多的选择空间，很可能是基于多个有利于竞争的标准进行选择。\n发出这封信的时机紧跟在美国的一项竞争调查之后，这起调查在美国本土引发了针对谷歌的类似反垄断案件。本月早些时候，美国司法部(Department Of Justice)对其提起了期待已久的诉讼，辩称这家科技巨头利用排他性商业协议网络将竞争对手拒之门外。\n在谈到DuckDuckGo希望看到Android选择屏幕如何演变时，创始人Gabe Weinberg告诉TechCrunch：“我们希望看到一个设计得当的搜索偏好菜单，为人们提供他们期望的所有搜索引擎选项，没有所有的黑暗模式，并使搜索竞争可持续地蓬勃发展。”不幸的是，目前的实施不符合这些基本标准，但我们希望，一个更具协作性的过程可以解决这一失败的补救办法。“。\n这封信的另一个签字人，法国的Qwant，也提到了欧盟委员会的地区数字主权目标-辩称，谷歌设计的拍卖有利于美国科技巨头，而牺牲了欧洲的替代方案，破坏了这位欧盟高管更广泛的科技雄心。\nQwant首席执行官让-克洛德·吉诺齐(Jean-Claude Ghinozzi)告诉TechCrunch：“经过大约三到四个季度的拍卖，我们现在的情况是，拍卖系统的价格每个季度都在上涨。”“价格不断上涨，竞争转向大型搜索引擎和全球搜索引擎--或者那些有能力在这次搜索拍卖中投入大量资金的公司。”\nGhinozzi认为，结果是回到了“不公平竞争”，因为通过谷歌拍卖获得用户的成本对于规模较小的欧洲竞争对手来说实在是太高了。随着每次点击在选择屏幕上赢得一席之地的成本不断膨胀，他表示，目前的模式实质上相当于谷歌将其欧盟反垄断处罚的成本外包给竞争对手。\n“这是写给专员的这封信。他说：“我们需要一个紧急的机会来讨论--如果谷歌(希望参与)，可能邀请谷歌--这一机制不起作用。”他补充说：“我们刚刚开始为谷歌买单，因为最终，我们(作为一个(较小的)搜索引擎)向谷歌支付如此大的费用只是为了上市，已经到了不可接受的地步了。”他补充说：“我们才刚刚开始为谷歌买单，因为到头来，我们作为一个(规模较小的)搜索引擎，向谷歌支付这么多钱只是为了上市，已经是不可接受的了。”\n他补充说：“该系统应该是开放的，与任何拍卖或支付无关，建议并提供给新的Android手机用户的搜索列表要大得多。”他呼吁欧盟竞争事务专员“紧急”审查该机制，并“为开放欧洲搜索(市场)提出一些解决方案”。\n“在拍卖系统或多或少活跃了一年之后，我们看到他们肯定应该再看一次，因为它不起作用。它没有创造一个公平的市场和一个开放的市场。因此，这就是我们现在提出这个建议的原因--我们迫切需要彻底重新考虑。“。\n考虑到谷歌要求他们签署保密协议，拍卖参与者在公开场合可以说的话受到限制。这是他们要求召开三方会议的另一个原因-竞争对手表示担心，并非参与谷歌拍卖过程的每个利益相关者都看到了与谷歌相同的数据。\nQwant首席道德和法律事务官纪尧姆·钱皮奥(Guillaume Champeau)表示：“问题在于，我们真的不知道谷歌对欧盟执委会说了什么，我们担心的是，他们对我们说了一些他们没有对欧盟执委会说的话。”“三方会议背后的想法将是确保我们所有人在谈判桌上都有相同类型的信息和对我们关切的相同类型的答案。”\n当被问及这封信提到欧盟委员会没有从谷歌收到完整和/或准确的信息时，Champeau还告诉我们：“这真的是一个确定所说的一切都是一样的问题。而且它不会因为谁坐在桌子的另一边而改变。\n“我们不明白为什么欧盟执委会不会根据我们掌握的信息要求改变选择屏幕。所以我们唯一的猜测是它是基于不准确的信息。否则，我们很可能可以肯定，欧盟委员会甚至会比今天更早地要求改变选择屏幕。“。\n“我们需要设计一些有吸引力，能引起欧洲人共鸣的东西，”Ghinozzi补充说，他重申，机制的设计不应该留给因反竞争行为而被罚款的同一家公司，这家公司在欧洲保持着高达90%的市场份额。\n我们联系了谷歌，要求对有关拍卖模式的投诉做出回应，谷歌向我们发送了这份声明，这份声明归因于一位发言人：\nAndroid为人们提供了前所未有的选择，可以决定他们在设备上安装、使用哪些应用程序并将其设置为默认应用程序。欧洲的选择屏幕在为用户提供更多选择和确保我们可以继续投资开发和长期维护开源Android平台之间取得了谨慎的平衡。选择屏幕的目标是给予所有搜索提供商平等的出价机会-而不是给予某些竞争对手特殊待遇。\n尽管欧盟委员会尚未对谷歌搜索竞争对手的持续抱怨做出任何回应，即付费选择屏幕并没有有效地重置Android的竞争格局，但欧盟委员会将于下月提出一项立法方案，更新电子商务法规，并对占据主导市场地位的所谓“看门人”平台引入一系列新的义务和要求--此举被广泛解读为试图扼杀谷歌(Google)等美国科技巨头的翅膀。", "note_en": "The joint letter to the Commission, which has been signed by Ecosia,  DuckDuckGo,   Lilo, Qwant and Seznam, requests a trilateral meeting between the EU executive, Google, and the five search rivals — with “the goal of establishing an effective preference menu”.\n “We are companies operating search engines that compete against Google. As you know, we are deeply dissatisfied with the so-called remedy created by Google to address the adverse effects of its anticompetitive conduct in the Android case,” they write. “We understand that Google regularly updates you regarding its pay-to-play auction, but it appears that you may not be receiving complete or accurate information.”\n  A Commission spokeswoman confirmed it’s received the letter and said it will respond in due course, adding that it’s “seen in the past that a choice screen can be an effective way to promote user choice”.\n “We have been discussing the choice screen mechanism with Google, following relevant feedback from the market, in particular in relation to the presentation and mechanics of the choice screen and to the selection mechanism of rival search providers,” the spokeswoman also told us, adding that t he Commission is “committed to a full and effective implementation of the decision” and “will continue monitoring closely the implementation of the choice screen mechanism”.\n Back in 2018 the  EU’s antitrust division fined Google $5BN for competition violations related to how it operates its smartphone platform and instructed the company to make good on the issues identified — leading it to offer Android users in Europe a search engine choice screen, rather than simply preloading its own.\n Google initially offered a choice based on rivals’ local market share but  quickly moved to a paid auction model. This appears to benefit larger, commercial entities at the expense of privacy-focused, regional and not-for-profit alternatives.\n Pro-privacy DuckDuckGo has, for example, lost out in recent auctions — while Microsoft-owned Bing has gained more slots. The former lowered how much it bids, saying it  believes it cannot profitably win a slot.\n European tech for good not-for-profit, Ecosia — which uses search click revenue to fund tree planting — has also  denounced the model as unfair, going so far as to boycott it entirely at first. It gave in after seeing its revenue take a massive hit during the coronavirus crisis. (Though failed to gain a slot in almost every market in the  most recent auction.)\n Google, meanwhile, continue to enjoy a search marketshare in excess of 90% in the region.\n The five rivals argue that Google is unfairly constraining the search market by limiting the number of available slots on the choice screen to three (Google’s own search engine is a staple fourth option).\n They want a collaborative process to devise a choice screen, rather than Google being allowed to continue to design its own ‘solution’ — favoring a non-paid choice screen with space for many more choices than the current three (non-Google) options, likely with selections based on multiple, pro-competition criteria.\n The timing of the letter comes hard on the heels of a competition investigation in the US that’s sparked a similar antitrust case against Google on home turf. The department of Justice filed a long-awaited case against it  earlier this month, arguing the tech giant uses a web of exclusionary business agreements to shut out competitors.\n Discussing how DuckDuckGo would like to see the Android choice screen evolve, founder Gabe Weinberg told TechCrunch: “We would like to see a properly designed search preference menu that gives people all the search engine options they expect, is free of all dark patterns, and enables search competition to sustainably flourish. Unfortunately, the current implementation meets none of these essential criteria, but we are hopeful that a more collaborative process could fix this failing remedy.”\n Another signatory to the letter, France’s Qwant, also brings up the Commission’s goal of regional digital sovereignty — arguing that the Google-devised auction favors US tech giants at the expense of European alternatives, undermining the EU executive’s wider tech ambitions.\n “After more or less three to four quarters of auction we are now in the situation where the auction system is seeing the price going up and up every quarter,”  Qwant CEO Jean-Claude Ghinozzi told TechCrunch. “The prices are going up and up and competition moves to the large search engine and the global search engine — or the ones that have the ability to invest a lot in this search auction.”\n The result is a return to “unfair competition”, argued  Ghinozzi, because the cost of acquiring users via Google’s auction is simply too high for smaller European competitors to participate. With the cost per click to win a slot on the choice screen inflating he suggested the current model essentially amounts to Google outsourcing the cost of its EU antitrust penalty to rivals.\n “That’s in this letter to the commissioner. We require an urgent opportunity to discuss — inviting potentially Google if they [wish to participate] — that this mechanism doesn’t work,” he said, adding: “We are just starting to pay the bill for Google because at the end of the day we are getting to a level where it is not acceptable anymore for us as a [smaller] search [engine] to pay such an amount to Google just to be listed.”\n “The system should be open and not related to any auction or payment and with a much larger list of search being proposed and provided to the new Android phone users,” he added, calling on the EU’s competition commissioner to “urgently” review the mechanism — and “propose some solutions for opening the European search [market]”.\n “After more or less a year of the auction system being active we see that definitely they should look again because it does not work. It does not create  a fair market and an open market. So that’s the reason we are coming now with this proposition — we urgently need to totally reconsider.”\n Auction participants are constrained in what they can say publicly given Google’s requirement that they sign an NDA. This is another reason why they’re asking for a tripartite meeting — with the rivals expressing concerns that not every stakeholder involved in Google’s auction process is seeing the same data as Google is.\n “The problem is that we don’t really know what Google says to the European Commission and what we fear is that they say some things to us that they don’t say to the European Commission,” said Guillaume Champeau, Qwant’s chief ethics and legal affairs officer. “The idea behind the tripartite meeting would be to ensure that we all have around the table the same kind of information and the same kind of answers to our concerns.”\n Asked about the letter’s reference to a concern that the Commission is not receiving complete and/or accurate information from Google, Champeau also told us: “It’s really a matter of being sure that all that’s being said is the same. And that it doesn’t change depending on who is on the other side of the table.\n “We don’t understand why the European Commission wouldn’t ask for changes to the choice screen based on the information that we have. So the only guess that we have is that it’s based on information that is not accurate. Otherwise we would be probably sure that the European Commission would have required changes to the choice screen even sooner than today.”\n “We need to design something that appeals, that resonates with Europeans in Europe,” added  Ghinozzi, reiterating that the design of the mechanism shouldn’t be left to the same company that’s been fined for anticompetitive behavior and which maintains up to 90% marketshare in Europe.\n We reached out to Google for a response to the complaints about the auction model and it sent us this statement, attributed to a spokesperson:\n Android provides people with unprecedented choice in deciding which applications they install, use and set as default on their devices. The choice screen for Europe strikes a careful balance between giving users yet more choice and ensuring that we can continue to invest in developing and maintaining the open-source Android platform for the long-term. The goal for the choice screen is to give all search providers equal opportunity to bid — not to give certain rivals special treatment.\n While the Commission has yet to offer any relief to the consistent complaints from Google’s search rivals that the paid choice screen doesn’t meaningfully reset the competitive landscape on Android it is set to introduce a legislation package next month which will update ecommerce regulations and introduce  a new set of obligations and requirements for so-called gatekeeper platforms holding dominant market positions — a move that’s being widely interpreted as a push to clip the wings of US tech giants like Google.", "posttime": "2020-10-28 05:12:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,android,公平,eu", "title": "\n搜索竞争对手表示，谷歌的欧盟Android选择屏幕不起作用，呼吁共同制定公平的补救措施", "title_en": "\n\t\t\t\tGoogle’s EU Android choice screen isn’t working say search rivals, calling for a joint process to devise a fair remedy\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/googles-eu-android-choice-screen-isnt-working-say-search-rivals-calling-for-a-joint-process-to-devise-a-fair-remedy/", "via": "", "real_tags": ["google", "谷歌", "android", "公平", "eu"]}]