[{"category": "", "categoryclass": "", "imagename": "be84bbb0590516ffac457308187f3e21.png", "infoid": 1067411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从NYC的技术到Nasik（印度）的化学品制造，这里有希望没有人需要的指南。\n      这也是我开始领导第二家公司的那一天 - 他的公司。 （注意：第一家公司是CB Insights。）\n 他的公司在印度（一个我知道的国家）在化学制造业（一个我对我不认识的行业一无所知）。\n  虽然我不认为大多数人会在类似的情况下发现自己（我当然希望没有），但我以为我会分享我的故事和一些学习＆amp;从那时到来的观察，M＆amp; A，团队，印度和各种各样的杂项。\n  注意：这可能会略微变得可靠和溪流，因为有很多想法在我的脑海里遍布。\n      正如我和家人在传统的印度葬礼中会火，我不知道的人来找我，并在印地语中说，“萨博，Humara Kya Hoga？ “\n     我记得自己思考，“为什么你现在问我这件事吗？” \n但这不是愤怒的时候或甚至想到这一点，所以我只是膝盖jerk在我的沉重的印度教中回应了“meh dekh loonga”，翻译成“我照顾它”。\n 所以在那一点上，除了CB Insights之外，我知道我会跑爸爸的生意。说实话，当医生说这种情况看起来很可怕时，我已经想到了这种可能性。\n 但无论我的年龄，爸爸都是我知道的最强大，最聪明的人，所以我认为他会通过它，事情会回到正常。与他不知疲倦地在阿特拉斯努力，他成立的公司，我回到了CB Insights。\n     在我们进一步前进之前，我父亲的一系列内容就是在阿特拉斯的业务。\n  该公司最近重新命名为Impex，但它开始和大部分生命，它被称为阿特拉斯精细化学品。行业人们知道它是阿特拉斯，我的姐妹们，我在这个名字下很明显，所以我将把它称为阿特拉斯前进。\n 阿特拉斯是一家专业风味＆amp的制造商;香味化学品，如香豆素，6-甲基香豆素，野生醛，天然香草和环形等。阿特拉斯的客户包括世界上最大的味道＆amp;香水房屋包括IFF，Givaudan，Firmenich，Takasago和Symrise等。\n 阿特拉斯距离孟买在一个叫做纳西克（14.86亿人）的城市的4小时，距离塞纳尔的小村庄距离Nasik约35分钟。 \n我不记得在4月17日之后的几周是一个家庭，传统和情感的日子，我第一次前往办事处的确切一天。\n 在办公室甚至踩到办公室之前，我已经要求团队向我发送他们发送给爸爸的报告，所以我可以熟悉这项业务。\n TBH，我不知道我对这些报道做了什么，但我认为表现得像我知道我可能正在做的事情可能会对球队提供一些信心。\n 坦率地说，我在这个时候逃跑地图集的唯一资格是我是创始人的儿子。\n 我试图成为1998  -  2000年的良好印度儿子，在阿特拉斯工作，所以在早些时候的日子里一点就知道了比目，但是18年是一个很长一段时间，我的思绪被各种各样的经历卡住了从那以后的想法。我在阿特拉斯的时间只是一个遥远的记忆。\n 1998年，从纽约的乐趣转向印度小镇，特别是因为某人在美国出生和长大。而且，尽管刚从大学毕业，但我父亲无法承认我的天才困扰我，但我就是一位拥有所有答案的人。\n   我仍然怀疑在我和爸爸一起工作的时候，我弄清楚如何更加学生和少年的联赛冲洗，那么它仍然可以成为什么。我们可能是什么样的二重奏？ \n所以，以一种奇怪而悲伤的方式，这是一个终于成为善良的印度儿子和爸爸的生意的机会。\n    我被称为先生，这是每个人都提到我父亲的人。\n  我记得当时思考这是奇怪的，在我随后对办公室的一次访问，但在很多方面，这种文化遗嘱对不合格的老板儿子的宣传是启用的阿特拉斯。\n 我想象如果在美国发生了同样的事情，就有更多关于我的资格和能力的疑问。在阿特拉斯，那些对话可能很好，但我怀疑它。或者，如果他们这样做，这些问题没有针对我。我在这里幸运了。\n 每个人都要更好或更糟，假设我有一个线索，正在寻找我制定计划。\n      当您不了解业务，科学，行业，国家，有时甚至是语言时，如何建立一个计划？ （我已经通过了印地语，但在图拉斯的大量当地对话是我不明白的马拉地赛。）\n   我娱乐选项1约6周。令人无法虐待的想法是，我弄清楚了如何运行阿特拉斯和CB洞察力，前进，与阿特拉斯作为较大的工业企业和CB见解作为大型技术手臂的第一部分。 \n在印度，您可以看到所有这些家庭（Ambani，Birla，Tata，Godrej，Hinduja等）可能是可能的。我想他们都开始在某个地方。也许这将是我的起点。\n 在大约6周后试图出现在CB Insights之后，每天早上凌晨6点打电话，每天晚上凌晨6点，每天晚上回应团队或者到阿特拉斯客户，那么明显的是，选项1是不可行的。\n 我将这个早上6点凌晨6点呼叫/晚餐常规进行过去13个月，CB Insights占据了一天中间，每隔一分钟的闲置大脑时间。毋庸置疑，我在过去的13个月里难以置信。我渴望建立一个多产业的企业集团死亡，因为这个想法太累了。\n  一秒钟，我看了公司可能会为其资产提取的内容。它的土地，植物等\n 我从来没有这样做过这样的事情，但我记得在电影华尔街谈论它的戈登壁虎时听到它，为什么不呢？\n   但这不是有史以来的真正选择，几个小时内折扣。\n 我父亲在30多年内建造了这家公司，他的许多团队一直和他在一起20+。销售公司的资产，即使是可行的，也是我失败的团队和他。 \n第三个想法是看看是否有一个可以在爸爸的团队和我的一些指导中运行阿特拉斯（假设我最终能够理解业务）。然后让这个人能够随着时间的推移赚取越来越股权。\n  这一想法很有吸引力，因为它让我的家人继续参与业务，同时也发现有能力将其带到一个新的水平。\n 这里的问题是我在印度没有网络，甚至想想找到这个角色的人。我通过介绍与几个候选人交谈，但没有任何东西对他们或我来说。搬到纳西克甚至对印度的人来说是一个挑战，但这只是没有找到合适人选的症状。\n 这对合适的人来说是一个惊人的机会，但它不在卡中。\n   然而，挑战是爸爸的业务没有太多的自然买家，被认为是一个小市场交易，使其变得更加强硬。\n 所以我没有对M＆amp的任何控制;事情的一面。\n 我专注于运行业务并希望合适的收购者出现。如果没有人出现，我会继续运行它。 \n我给了自己3年才能运行阿特拉斯和CB洞察力，思考我可以维持凌晨6点呼叫和晚间电子邮件的日常时间表，并在烧毁前每6-8周一次旅行。 3年是一个完全任意的时间表。\n 大约6个月的时间，我意识到这两者都没有因为多种原因而不是可持续的 - 健康，家庭，而且对于CB洞察力或阿特拉斯而言，这并不是最佳。\n 但我不知道买方市场，无法控制它，所以我专注于我可以控制的东西。\n    尽管阿特拉斯比CB Insights非常不同，但关于如何运行它的答案比我过去13个月的许多其他问题更容易。\n       我看着该行业的阿特拉斯与同行的财务人员，并与一些父亲的可信赖的顾问交谈，显然是阿特拉斯的利润是完善的。\n  阿特拉斯效率高，我爸爸沉迷于边缘，上述业务低保证金，以保持整体利润利润率高。\n 很明显，专注于边缘方面不是我的时间或能量的最佳位置。 \n此外，大多数才能获得的效率在制造过程中，这就是我Zero的位置 - 添加。爸爸也是最终的技术联合创始人。我是非技术性的，因为它们进入化学制造环境。\n   而且我需要画一张团队可以看到的照片。通过XX基本要点改善边际不会成为让任何人被解雇的东西。\n 所以我决定专注于增长。由于这款技术联合创始人而不是通过新产品的增长不需要爸爸。\n  这也是运营公司的唯一方法，我有机会在。\n 这也是我可以展示我们做得很好的地图集团队的方式。而且我可能会超越成为老板的儿子的价值。\n 销售是每个人都看到的东西，特别是在制造环境中。从工厂的工人到工厂的工作人员，如果他们看到卡车进入产品调度，他们知道他们正在制作的产品正在销售。如果办公室的员工正忙于生成发票和现场客户电话，他们会看到产品畅销。\n 虽然我绝不是自然的销售，但是，如果掌控着合适的产品，我可以卖。而阿特拉斯的香港林是世界上最好的。 \n在化学工业中，这是一个闻所未闻的单一产品公司30年。但阿特拉斯能够这样做，因为产品很难做出，而且它们是最好的。\n  注意：值得注意的是，在竞争激烈的化学产品中，不忽视边缘。因此，虽然增长是重点，但我确实专注于主要费用 - 原材料，运输，包装。但这只有5％的时间，因为阿特拉斯的队伍队伍专注地管理了这些时间。\n  因此，随着增长的是重点，我已经完成了我应该伸出援手的行业中的人员和公司名单。\n 我经历了父亲的电子邮件，看看他谁互动并伸出了所有人。\n 我参观了各种香水和味道协会和会议网站，并取下了他们的会员和与会者名称并向他们联系。\n 这不是一个特别结构化的过程，但我希望那些知道爸爸知道阿特拉斯仍然嗡嗡声，他们可以依靠我们的产品。\n 对于那些不认识我们的人，下次他们需要的时候，他们就知道他们可以伸向我们。 \n这是很多冷电子邮件和冷呼叫。我已经提高了在CB见解或任何地方进行的SDR尊重。这是艰苦的工作。但是当有人根据您的努力关闭时，也令人难以置信的奖励。\n 与此同时，我还专注于价格。爸爸建立了一项高利润率的业务，这为我提供了通过更具侵略性地获得市场份额的机会。\n 香豆素每年可能是6,000吨的产品。阿特拉斯大约是全球市场的10-12％，但我们在没有被用的工厂的能力，所以我知道我们可以生产和销售更多。有一些供应需求曲线，我可以在这里完成的边际成本计算，但我没有这样做。\n 我在我的头上做了一些信封数学的回报，并在Excel中制作了一个简单的，基本的成本在Excel中，以确保我们始终在销售上进行一些东西，但我在本能上跑了阿特拉斯，而不是分析。\n 阿特拉斯拥有一个伟大的团队，拥有许多经验。我假设我是否正在做一些真的真的愚蠢，他们会告诉我♥\n 在最后一个财政年度（2018年4月至2018年3月）中，阿特拉斯在历史上获得了最佳收入。 2017年11月，我们在公司历史上第一次向客户发送100吨香豆素。\n 我记得在11月底前往网站的网站，当时100吨月发生了100吨月，并与团队庆祝。这是我专业的最骄傲的日子之一。我非常自豪地为阿特拉斯队感到骄傲，他们在4月份在爸爸的死亡中看到了一个潜在的公司沉没的事件，谁一直在战斗，做好工作，然后刚刚有一个历史的月份。 \n一旦我接管了这项业务，那么呼吁就开始来自兴趣的买家或其投资银行。\n 爸爸在他去世之前已经与1家公司进行了讨论，我会和他遇见过他们一次。他们重新订婚了。\n 风味＆amp;印度的香水产业大，但同时小。\n  结果，各种买家表示兴趣。我伸出了一些大客户来感受到他们。\n  我对该空间做了一些基本研究，所以我理解球员并响起至少合理聪明。投资银行Avendus关于味道＆amp的报告;香水行业对像我这样的新手有用。阿特拉斯是一个基础成分制造商。我们可能的买家是较大的基础成分制造商或功能性成分制造商，他们对垂直整合感兴趣。\n  有5个买家，要么来找我们，要么我发现并得到了一些感兴趣的表达。\n 买方1  - 一个公开交易的印度公司，也使香豆素更小的卷 \n买家3  - 一个富裕的家庭，希望为他们的儿子从美国返回的儿子购买业务\n   在挖掘每个买家的事情挖掘出现的事情之前，值得理解的是，我有一定的标准，这是一笔交易，使得消除某些买家容易。\n  他们不得不照顾团队 - 我想找到一个成长为导向的公司，确保了帮助建立地图集的团队将得到关注至关重要。任何决定中最大的因素就是这样，因为我认为它与我父亲的遗产交织如此。他花了30年与这家团队建造这家公司。重要的是，这是维持并希望采取下一级别。当然，没有办法肯定知道这一点，这是一个人的肠道以及买方在桌子上的方式让你感觉很重要。\n 简单的交易 - 我对私营公司的库存或没有公共公司的库存或长期或其他一些复杂的结构。阿特拉斯对任何可靠的买家来说不会是一个大的交易。复杂不需要。我也没有时间教育买方的空间。\n 一个公平的价格 - 当公司的创始人/面对（我的父亲）时，一堆底部喂养寄生虫可以出现。我并没有期望获得地图集的市场价格，但我想要一个公平的地图。此外，我跑了越来越多的地图集，我更有信心的力量在我运行它的能力中。所以价格只是随着时间的推移。\n  买方1  - 一个公开交易的印度公司，也使香豆素更小的卷\n 我与投资银行一起遇到了这家公司的一个官方。 \n我在与他们共享了高级别数据，但在此之后谈话结束。由于我可以看到他们是公开的，他们掩盖了很多债务，所以没有想到他们的交易会符合我对公平价格，简单甚至能够照顾团队的标准。\n     他们对阿特拉斯感兴趣。我们谈了一下，他们提出了一笔交易，但结构很复杂，所以我让这个一个人走了。他们是一个长期的客户，我们远离任何交易都足以进一步参与。\n 买家3  - 一个富裕的家庭，希望为他们的儿子从美国返回的儿子购买业务\n  他们是一个具有大型工业业务的家庭，并且有兴趣扩展到新的线条，因为他们的儿子从美国回到印度。 （我想真的很富有的人这样做的事情）。\n  这里的挑战是，即使在投资之后也需要大量的行业教育以及成功的可能性。\n    这是我父亲已经讨论的公司。该公司已经看到了阿特拉斯的号码，并且在他去世之前曾在爸爸上给出了报价。当他们已经完成的勤奋时，他们似乎最有希望。\n   一小时，他们告诉我阿特拉斯不是一个很棒的事。我听了，因为我可能太恭敬于比我比我更老了。 \n在听一段时间后，我问了他们，​​“你告诉我阿特拉斯的所有原因是这么糟糕的公司。那么你为什么要获得它？“\n   其中一部分可能一直是文化适应，部分是PE在其身边复杂的决策中可能拥有的可能性。在讨论M＆amp时，了解买方的决策标准和过程非常重要; a。\n  我告诉他们这个过程不适用于阿特拉斯或我或我的家人。我告诉他们这个过程是我们需要运行的东西。当他们说不时，我祝你运气并继续前进。\n 我很紧张地做这个tbh。没有一个巨大的买家名单，阿特拉斯并将其中一个人关闭似乎可能是愚蠢的。但你必须和你的肠道一起去这些东西。\n    我先前收到了来自银行家的许多电话，我坚持认为他们告诉我他们代表的是谁只是钓鱼。\n    我解释了我的标准，他们解释了他们的愿景，他们把一个不合格的报价放在一起清洁/清澈，我们得到了努力。\n   5月31日，我飞回印度。这是我过去13个月的第8次旅行。 \n我降落在晚上10点。 Avendus的办公室，代表ETERNIS，买方的投资银行是第一个目的地。\n 我达到11点，我们才致力于凌晨5点到哈希出现的最终交易细节。\n 我们离开了4.5小时淋浴，睡个好觉，并于6月1日在埃特内斯的办公室恢复。那天下午4点，这笔交易已经完成。\n  这个消息很快就破裂了行业。在4小时的车程到NASIK，人们开始致电和WhatsApp Messing Me  - 客户，供应商等。\n   我希望在办公室周六（阿特拉斯在地图集6天的工作周期）告诉这支球队，所以我感到难过，其中一些人在周五晚上通过其他人听到这笔交易。\n 第二天，我去了工厂，Eternis团队的成员来了。 ETERNIS团队的Manu解决办公室和工厂员工，并欣赏到他们的目标和公司的壮丽景色。\n   6月4日，我们决定，我们的家人会在工厂正式告别整个地图集团队。我们从办公室里的每个人都上了起来。 \n我的妈妈，孩子和妻子从各州飞行。我希望我的孩子看看他们的“祖父”（祖父）在其故事中的下一章进入下一章之前建造了至少1次。\n   我准备了英语演讲，我的妻子将它翻译成印度。我的印度教不太好，如此告别的情绪，我非常害怕在印地语中提供几次讲话。我从来没有这样做。\n 我们组装在仓库里，我站在化学混合器的顶部并与团队谈话。在发言中，我几次撕裂了泪水。我的印度是足够懂的，我在阿特拉斯队上有几个其他人也哭了，所以我想我的信息被理解了。\n  我用英语发言如下。它是在印地语中交付的，视频是我希望在足够老的时候向孩子们展示我的孩子。\n  我的印度不是很好，所以如果我犯了任何错误，请原谅我。\n 爸爸29年前开始阿特拉斯。作为我的姐妹和我在成长，我们开玩笑说，阿特拉斯是他的第四个孩子。\n 但实际上，阿特拉斯少了一个第四个孩子 \n...... ", "note_en": "From tech in NYC to chemical manufacturing in Nasik (India), here&#39;s a guide that hopefully nobody ever needs.\n      It was also the day I started to lead a second company – his company. (Note: the first company is CB Insights.)\n His company was in India (a country I knew little about) in the chemical manufacturing industry (an industry I knew nothing about).\n  While I don’t think most people would ever find themselves in a similar situation (I certainly hope not), I thought I’d share the story and some of my learnings &amp; observations from that time about business, M&amp;A, teams, India, and assorted miscellaneous thoughts.\n  Notes:  This will probably be slightly rambly and stream-of-consciousness as there are lots of thoughts rolling around in my head.\n      As I was going with family to cremate my father in a traditional Hindu funeral, someone who I didn’t know came up to me and said in Hindi, “  Saab, humara kya hoga? ”\n     And I remember thinking to myself, “Why the F are you asking me about this right now?”\n But this wasn’t the time for anger or to even to think about this so I just knee-jerk responded in my heavily American-accented Hindi that “  Meh dekh loonga ” which translates to “I’ll look after it.”\n And so at that point, in addition to CB Insights, I knew I was going to run my Dad’s business. To be honest, I had already thought about this possibility when he was admitted to the hospital when the doctors said the situation was looking dire.\n But no matter my age, Dad was always the strongest, smartest person I knew, and so I assumed he’d pull through and things would go back to normal. With him tirelessly working on Atlas, the company he founded, and me going back to CB Insights.\n     Before we go further, a bit of context on Atlas, my Dad’s business.\n  The company was recently renamed AIMS Impex, but it started and for most of its life, it was known as Atlas Fine Chemicals. Industry folks know it as Atlas, and my sisters and I grew up knowing it under that name so I will refer to it as Atlas going forward.\n Atlas is a manufacturer of specialty flavor &amp; fragrance chemicals such as coumarin, 6-methyl coumarin, safranal, natural vanilla, and cyclocitral among others. Atlas’ customers include the world’s largest flavor &amp; fragrance houses including IFF, Givaudan, Firmenich, Takasago, and Symrise among others.\n Atlas is based 4 hours from Mumbai in a city called Nasik (1.486 million people) and the manufacturing facility is about 35 minutes from Nasik in a small village called Sinnar.\n        I don’t remember the exact day I went to the office for the first time as the weeks after April 17th were a blur of family, tradition, and emotion.\n Before even stepping foot in the office, I had asked the team to send me the reports they sent to Dad so I could get familiar with the business.\n TBH, I didn’t know what I’d do with these reports, but I figured that acting like I knew what I might be doing might provide some confidence to the team.\n Candidly, my only qualification to run Atlas at this time was that I was the founder’s son.\n I had tried to be the good Indian son back in 1998-2000 and work at Atlas so knew the biz a bit in its earlier days, but 18 years is a long time for a business and my mind was jammed with all sorts of other experiences and ideas since then. My time at Atlas was just a distant memory.\n In 1998, moving from the fun of NYC to small town India was tough especially as someone born and brought up in the US. Moreover, I was a know-it-all who had all the answers despite just graduating from college and so my dad’s inability to recognize my genius bothered me.\n   I still wonder what Atlas might have become if I could have figured out how to be more of a student and less of an Ivy League douche when I was working with my dad back then. What kind of duo might we have been?\n So, in a strange and sad way, this was an opportunity to finally be the good Indian son and run Dad’s business.\n    I was referred to as Sir, which is what everyone referred to my father as.\n  I remember thinking this was odd at the time, and during all my visits to the office subsequently, but in many ways, this sort of cultural deference to the unqualified boss’ son is what enabled Atlas to carry on.\n I imagine if the same had happened in the US, there would have been many more questions about my qualifications and capabilities. At Atlas, those conversations might have very well happened, but I doubt it. Or, if they did, these questions weren’t directed to me. I got lucky here.\n Everyone, for better or worse, assumed I had a clue and was looking for me to develop a plan.\n      How does one develop a plan when you don’t understand the business, the science, the industry, the country, and sometimes even the language? (I have passable Hindi but a lot of the local conversations at Atlas were in Marathi which I don’t understand.)\n   I entertained Option 1 for about 6 weeks. The ill-conceived idea was that I’d figure out how to run both Atlas and CB Insights, going forward with Atlas as the beachhead for a larger industrials business and CB Insights as the first part of a massive technology arm.\n   In India, you see all these families (Ambani, Birla, Tata, Godrej, Hinduja, etc) who are in every potential business line possible. I figured they all started somewhere. Maybe this would be my starting point.\n After about 6 weeks of trying to be present at CB Insights, but doing calls every morning at 6am with the Atlas team and emails every evening responding to the team or to Atlas customers, it became apparent that Option 1 wasn’t feasible.\n I kept this 6am morning call/evening email routine going for the last 13 months with CB Insights occupying the middle of the day and every other minute of idle brain time. Needless to say, I’ve aged immeasurably in the last 13 months. My desire to build a multi-industry conglomerate died because the idea was just too tiring.\n  For a second, I looked at what the company might fetch for its assets. Its land, plant, etc.\n I’d never done something like this but I remember hearing about it when Gordon Gecko talked about it in the movie   Wall Street  so figured, why not?\n   But this wasn’t a real option ever and was discounted in a few hours.\n My dad built this company over 30 years with many of his team having been with him for 20+. Selling the company’s assets, even if feasible, would be me failing his team and him.\n   The third idea was to see if there was someone who could run Atlas with some guidance from Dad’s team and me (assuming I could eventually understand the business). And then give this person the ability to earn more and more equity over time.\n  This idea was appealing as it’d let my family continue to be involved with the business while also finding someone capable to take it to the next level.\n The problem here was that I had no network in India from which to even think about finding someone for this role. I spoke with a couple of candidates via introductions but nothing really stuck for them or me. Moving to Nasik was a challenge even for those in India, but that was just a symptom of not finding the right person.\n This would have been an amazing opportunity for the right person, but it wasn’t in the cards.\n   The challenge, however, was that Dad’s business didn’t have too many natural buyers and was considered a small market transaction making it even tougher.\n And so I didn’t have any control on the M&amp;A side of things.\n I focused on running the business and hoped a suitable acquirer would show up. If nobody showed up, I’d keep running it.\n I gave myself 3 years to run both Atlas and CB Insights, thinking I could maintain the daily schedule of 6am calls and evening emails with India interspersed, with trips every 6-8 weeks before burning out. 3 years was a completely arbitrary timeline.\n About 6 months in, I realized doing both for that long really wasn’t sustainable for a number of reasons — health, family, and it wasn’t optimal for either CB Insights or Atlas.\n But I didn’t know the buyer market and couldn’t control it so I focused on what I could control.\n    Despite Atlas being very different than CB Insights, the answer about how to run it came to me easier than a lot of the other questions I had over the last 13 months.\n       I looked at the financials for Atlas vs peers in the industry and talked to some of my dad’s trusted advisors, and it was apparent that Atlas’ margins were best-in-industry.\n  Atlas was efficient, and my dad obsessed about margins, foregoing business that was low margin to keep overall profit margins high.\n It was clear that focusing on the margin side wasn’t the best place for my time or energy.\n Plus, most of the efficiency to be gained was in the manufacturing process and that is where I was zero value-add. Dad was also the ultimate technical co-founder. I was as non-technical as they come in a chemical manufacturing setting.\n   And I needed to paint a picture that the team could see. Improving margin by XX basis points wasn’t going to be what got anyone fired up.\n So I decided to focus on growth. Growth not via new products as that would also require Dad, the technical co-founder.\n  This was also the only way to run the company that I had a chance of being useful in.\n And it was also the way I could show the Atlas team we were doing well. And that I might have some value beyond being the boss’ son.\n Selling is something everyone sees, especially in a manufacturing setting. From the workers at the factory to the plant staff, if they see trucks coming in for product dispatches, they know the product they’re making is selling. If the staff in the office is busy generating invoices and fielding customer calls, they see the product is selling.\n And while I’m by no means a natural at selling, if armed with the right product, I can sell. And Atlas’ Coumarin was the best in the world.\n In the chemical industry, it’s unheard of to be a single product company for 30 years. But Atlas was able to do that because the product is hard to make, and they are the best at it.\n  Note: It is worth noting that in a competitive chemical product, margins cannot be ignored. So while growth was the focus, I did focus on major expenses — raw materials, shipping, packaging. But this was only 5% of my time as the very capable team at Atlas managed these expertly.\n  So with growth being the focus, I went about assembling a list of people and firms in the industry I should reach out to.\n I went through my dad’s emails to see who he’d interacted with and reached out to all of them.\n I visited various fragrance and flavor association and conference websites and took down their member and attendee names and reached out to them.\n It wasn’t a particularly structured process, but I wanted those that knew my dad to know that Atlas was still humming and they could rely on us for product.\n And for those that didn’t know us, the next time they had a need, they knew they could reach out to us.\n This was a lot of cold emailing and cold calling. I have heightened respect for what SDRs do at CB Insights or anywhere. It is hard work. But also incredibly rewarding when someone closes based on your efforts.\n At the same time, I also focused on price. Dad had built a high margin business which afforded me the opportunity to try to gain market share by being more aggressive with price.\n Coumarin is probably a 6,000 ton product per year. Atlas was about 10-12% of the global market, but we had capacity at the plant that wasn’t being used so I knew we could produce and sell more. There is some supply-demand curve, marginal cost calculation I could have done here, but I didn’t do any of that.\n I did some back of the envelope math in my head and had worked out a simple, rudimentary cost per kg formula in Excel to ensure we were always making something on a sale, but I ran Atlas on instinct a lot more than analysis.\n Atlas has a great team with lots of experience. I assumed if I was doing something really really dumb, they’d tell me 🙂\n In the last financial year (April 2017-March 2018), Atlas had its best revenue in history. In November 2017, we dispatched 100 tons of Coumarin to customers for the first time in the company’s history.\n I remember taking   mithai  (sweets) to the site at the end of November when the 100 ton month happened and celebrating with the team. It was one of the proudest days I’ve ever had professionally. I was incredibly proud of the Atlas team who had seen a potentially company-sinking event happen with my dad’s death in April and who’d kept fighting and doing good work and then just had a historic month.\n    As soon as I took over the business, the calls started coming from interested buyers or their investment banks.\n Dad had already been in discussions with 1 firm prior to his death, and I’d met them once with him. They re-engaged.\n The flavor &amp; fragrance industry in India is big, but small at the same time.\n  As a result, various buyers expressed interest. I reached out to a couple of our large customers to feel them out.\n  I had done some basic research on the space so I understood the players and sounded at least reasonably smart. A report by investment bank Avendus on the flavor &amp; fragrance industry was useful for a novice like me. Atlas was a base ingredient manufacturer. Our likely buyers were either larger base ingredient manufacturers or functional ingredient manufacturers who were interested in vertical integration.\n  There were 5 buyers that either came to us or that I’d identified and gotten some expression of interest from.\n Buyer 1 – A publicly traded Indian firm that also makes Coumarin at much smaller volumes\n  Buyer 3 – A wealthy family looking to buy a business for their son returning from the US\n   Before digging into how things went with each buyer, it is worth understanding that there were certain criteria I had for a deal which made eliminating certain buyers easy.\n  They had to take care of the team  — I wanted to find a growth-oriented company as ensuring the team that had helped build Atlas would be taken care of was critical.  The biggest factor in any decision was this as I viewed it as intertwined with my dad’s legacy. He spent 30 years building this company with this team. It was important that this be maintained and hopefully taken to the next level. There is, of course, no way to know this for sure and this is where one’s gut and how the buyer across the table makes you feel is important.\n Simple deal  — I was not interested in stock in a private company or an illiquid public company or a long earn-out or some other complex structure. Atlas wouldn’t be a big deal for any credible buyer. Complexity wasn’t required. I also didn’t have time to educate a buyer on the space.\n A fair price  — When the founder/face of a company dies (my dad), a bunch of bottom feeding parasites can show up. I wasn’t expecting to get a top of the market price for Atlas, but I wanted a fair one. Moreover, the longer I ran Atlas, the more confident I became in my ability to run it. So the price was only going to go up with time.\n  Buyer 1 — A publicly traded Indian firm that also makes Coumarin at much smaller volumes\n I met with one of the execs of this firm along with their investment bank once.\n I shared high-level data on Atlas with them but the conversation ended after that. They were saddled with lots of debt as I could see given they were public and so didn’t think a deal with them would meet the criteria I had on fair price, simplicity, or even ability to take care of the team.\n     They were interested in Atlas. We talked a bit and they proposed a deal, but the structure was complicated and so I let this one go. They are a long-standing client and we were far enough away from any deal that it didn’t make sense to engage further.\n Buyer 3 — A wealthy family looking to buy a business for their son returning from the US\n  They were a family with a large industrial business and were interested in expanding into new lines as their son was returning to India from the US. (I guess really wealthy people do things like this).\n  The challenge here was that it’d require lots of education about the industry and the probability of success even after investing would be low.\n    This was the firm my dad was already in discussions with. The firm had seen Atlas’ numbers and had actually given an offer to my dad prior to his death. They seemed the most promising at the outset given the diligence they’d already done.\n   For an hour, they told me all the reasons Atlas wasn’t a great business. I listened as I’m probably too deferential to those older than me than I should be.\n And after listening for a while, I asked them, “You’ve told me all the reasons Atlas is such a bad company. So why do you want to acquire it?”\n   Part of this may have been culture fit and part of this was likely ownership by PE which complicated decision-making on their side. It’s important to understand the decision-making criteria and process of a buyer when discussing M&amp;A.\n  I told them that process didn’t work for Atlas or me or my family. And I told them that process was what we needed to run. When they said no, I wished them luck and moved on.\n I was nervous doing this tbh. There wasn’t a huge list of buyers for Atlas and shutting one of them out seemed at times like it might be foolish. But you have to go with your gut on these things.\n    I’d received lots of calls from bankers prior and I insisted they tell me who they were representing as many were just fishing.\n    I explained my criteria, they explained their vision, they put a non-binding offer together that was clean/clear and we got moving on diligence.\n   On May 31st, I flew back to India.  It was my 8th trip in the last 13 months.\n I landed at 10pm. The offices of Avendus, the investment bank representing Eternis, the buyer, was the first destination.\n I arrived at 11pm and we worked until 5am to hash out final details of the deal.\n We went away for 4.5 hours to shower and get some sleep and resumed at Eternis’ office at 930am on June 1st. By 4pm that day, the deal was done.\n  The news broke within the industry pretty quickly. During the 4-hour drive to Nasik, folks started calling and WhatsApp messaging me — customers, vendors, etc.\n   I was hoping to tell the team on Saturday (6 day workweek at Atlas) in the office so I felt bad that some of them heard about the deal on Friday evening through others.\n The next day, I went to the factory and members of the Eternis team came. Manu of the Eternis team addressed the office and factory staff and gave a great view into their goals and their company.\n   On June 4th, we decided that our family would officially say farewell to the entire Atlas team at the factory. We had everyone from the office come up.\n My mom, kids, and wife flew in from the States. I wanted my kids to see what their “Dada” (grandfather) had built at least 1 time before it moved onto the next chapter in its story.\n   I had prepared a speech in English and my wife translated it to Hindi. My Hindi is not very good so beyond the emotion of this farewell, I was pretty scared of delivering a several minute speech in Hindi. I’d never done something like that.\n We assembled in the warehouse, and I stood on top of the chemical mixer and talked to the team. I fought back tears several times during my speech. My Hindi was intelligible enough that I had several others on the Atlas team also crying so I guess that my message was understood.\n  My speech in English is below.  It was delivered in Hindi, and the video is something I hope to show my kids when they are old enough to understand.\n  My Hindi is not very good so please forgive me if I make any mistakes.\n Dad started Atlas 29 years ago. As my sisters and I were growing up, we joked that Atlas was his 4th child.\n But in reality, Atlas was less of a 4th child \n......", "posttime": "2021-06-22 19:12:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "国家,sell", "title": "如何在行业和一个您不知道的国家管理和销售公司 ", "title_en": "How to Manage and Sell a Company in an Industry and a Country You Don’t Know", "transed": 1, "url": "https://www.cbinsights.com/research/team-blog/run-sell-company/", "via": "", "real_tags": ["国家", "sell"]}, {"category": "", "categoryclass": "", "imagename": "5eed17fcff4511246cecb99cf020f36c.gif", "infoid": 1067409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年的明星令人震惊的景观 - 许多人熟悉的是星座猎户座的“右肩” - 是由明星本身所喷出的尘埃云引起的。 Astrophysicists达到了这一结论，于6月16日在自然界中发布了1，在调光之前和之后使用BetelgeUSE的高分辨率成像，结合计算机模拟。\n 通常，Betelgeuse是夜空中最亮的星星之一。几十年来，研究人员已经知道它经历了每425天大约每425天的调光的周期，在此期间它暂时损失了其高峰亮度的四分之一。但在2020年2月，天文学家注意到明星的亮度被前所未有的三分之二的亮度下降 - 足以与肉眼引起明显。\n  未解释的调光促进了这颗明星可能会爆炸的猜测。 Betelgeuse是一个红色的超级巨星 - 一种更为巨大的明星，比太阳更短，甚至越来越短 - 它预计将在未来10万年的某个时候结束它的壮观超新星爆炸。这个活动将提供一个奇观，其中一个人在几个世纪里没有看到哪些地球：在1604年可以观察到的银河系中最后一个超新星，而Betelgeuse则靠近我们的星球，其超新星将足够亮白天在几周内可见。这颗星是大约168个Parsecs（548轻的岁月），根据最新的估计数2。\n 但许多天体物理学家警告说，超新星猜测是一厢情愿的思考。他们指出，调光可能是由更平凡的机制引起的，例如出现在恒星表面上的异常寒冷物质，在被称为对流细胞的情况下，或者穿过视线的云它。\n 现在，Astrophysicist MiguelMontargès在巴黎天文台和他的合作者发现，“伟大调光”的原因可能是两种因素的组合。\n  该团队于2019年1月，2019年12月，2019年1月20日和2020年3月占据了一系列高分辨率图像，在智利阿塔卡马沙漠中使用了非常大的望远镜。 Betelgeuse的宽度超过16倍，宽度为764倍 - 如此之大，如果它位于太阳系的中心，它将吞噬所有行星的轨道到达火星。这使得天文学家可以作为磁盘解析的少数恒星之一，而不是作为单点光线解释，蒙塔格斯（蒙塔格）曾经研究过的贝尔格斯（Betelgeuse），他们已经暂时学习了十年，因为他已经十年来对此感兴趣老，当它是他能够在天空中识别的第一个明星。\n  图像清楚地表明，从地球和＃39;北半球所看到的星形左侧部分 - 已经显着暗中，并且较暗区域的位置在成像时期没有大幅改变。这表明昏暗的斑点是由恒星本身所喷射的灰尘引起的，并且在视线方向上大致移动，而不是通过。 “如果它是一个云过境，它应该越过明星，”蒙塔尔格斯说。 \n该团队对调光的解释是一个异常酷的对流细胞导致星形气氛中的温度急剧下降。这使得星球在去年中爆发出来的气体能够迅速凝成灰尘，从恒星中堵塞光线。这一情况是一个适合数据最好的人，因为研究人员通过运行超过10,000个计算机模拟而确认。 “从建模的结论是两个事件在同一时间发生，”蒙塔尔格说。\n “仿真的事实让我更加说明”解释是正确的，马里兰州太空望远镜太空科学研究所的天体物理学家梅里迪蒂乔塞说。\n “如果我们能够知道多少天或多年的贝尔格斯应该爆炸作为超新星，这将是很棒的，”英国哈特菲尔德大学的Astrophysicist Chiaki Kobayashi说。然而，研究人员尚未充分详细了解Betelgeuse  - 或者红色超差，以便能够做出这样的预测。 ", "note_en": "Last year’s dramatic dimming of the star Betelgeuse — familiar to many as the ‘right shoulder’ of the constellation Orion — was caused by a cloud of dust spewed out by the star itself. Astrophysicists reached this conclusion, published on 16 June in  Nature  1, using high-resolution imaging of Betelgeuse before and after the dimming, combined with computer simulations.\n Normally, Betelgeuse is one of the ten brightest stars in the night sky. For decades, researchers have known that it undergoes cycles of dimming roughly every 425 days, during which it temporarily loses about one-quarter of its peak brightness. But in February 2020, astronomers noticed that the star’s brightness had dropped by an unprecedented two-thirds — enough to be noticeable with the naked eye.\n  The unexplained dimming fuelled speculation that the star could be about to explode. Betelgeuse is a red supergiant — a type of star that’s more massive and thousands of times shorter-lived than the Sun — and it is expected to end its life in a spectacular supernova explosion sometime in the next 100,000 years. This event would provide a spectacle the likes of which Earthlings have not seen in centuries: the last supernova in the Milky Way that could be observed from Earth was in 1604, and Betelgeuse is so close to our planet that its supernova will be bright enough to be visible during daytime for weeks. The star is around 168 parsecs (548 light years) away, according to the most current estimates  2.\n But many astrophysicists warned that the supernova speculation was wishful thinking. They pointed out that the dimming was likely to be caused by more mundane mechanisms, such as a blob of unusually cold matter appearing on the surface of the star in what’s known as a convective cell, or a cloud of dust crossing the line of sight to it.\n Now, astrophysicist Miguel Montargès at the Paris Observatory and his collaborators have found that the reason for the ‘great dimming’ was probably a combination of both of those factors.\n  The team took a series of high-resolution images of the star in January 2019, December 2019, January 2020 and March 2020, using the Very Large Telescope in Chile’s Atacama Desert. Betelgeuse is more than 16 times the mass of the Sun, and 764 times its width — so big that if it were located at the centre of the Solar System, it would engulf the orbits of all the planets up to Mars. This makes it one of the few stars that astronomers can resolve as a disk, rather than as a single dot of light, explains Montargès, who has been studying Betelgeuse on and off for a decade and has been interested in it since he was ten years old, when it was the first star that he was able to identify in the sky.\n  The images clearly showed that the bottom left-hand part of the star — as seen from Earth&#39;s Northern Hemisphere — had dimmed dramatically, and that the position of the darker region did not change substantially over the imaging period. This indicated that the dim spot was caused by a cloud of dust that had been spewed by the star itself, and was moving roughly in the direction of the line of sight, rather than passing by. “If it had been one cloud transiting, it should have crossed the star,” Montargès says.\n The team’s explanation for the dimming is that an unusually cool convective cell led to a drastic drop in temperature in the star’s atmosphere. This enabled gas that the star had spewed out in the previous year to condense quickly into dust, blocking out light from the star. This scenario was the one that fit the data best, as the researchers confirmed by running more than 10,000 computer simulations. “The conclusion from the modelling is that both events happened at the same time,” says Montargès.\n “The fact that a simulation was run makes me more convinced” that the explanation is correct, says Meridith Joyce, an astrophysicist at the Space Telescope Science Institute in Baltimore, Maryland.\n “It would be wonderful if we could know in how many days or years Betelgeuse should explode as a supernova,” says astrophysicist Chiaki Kobayashi at the University of Hertfordshire in Hatfield, UK. However, researchers don’t yet have a sufficiently detailed understanding of Betelgeuse — or of red supergiants in general — to be able to make such a prediction.", "posttime": "2021-06-22 19:11:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "明星,star,调光", "title": "去年，为什么超级明星Betelgeuse神秘地昏暗了 ", "title_en": "Why the supergiant star Betelgeuse went mysteriously dim last year", "transed": 1, "url": "https://www.nature.com/articles/d41586-021-01633-4", "via": "", "real_tags": ["明星", "star", "调光"]}, {"category": "", "categoryclass": "", "imagename": "b08a58dc0ed45a2e71ab87823489d23c.jpg", "infoid": 1067407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为与饮料分配器制造商Lancer合作的一部分创建的系统为您的标准快餐喷泉带来了额外的自动化水平。它有一个直接集成的销售点，它踢出了浇注，密封和推进饮料的过程。除此之外，它与更大的销售系统集成，以确保它在内部客户和交付司机之间获得订单。\n   基本上它是您在每间快餐餐厅和电影院遇到的喷泉更智能的版本。当然，该公司表示，该类别的兴趣只会在过去一年半的劳动力短缺和大流行中增加了大部分劳动力。\n “Lancer在饮料创新和未来派设计的愿景中具有脱颖而行的行业质量和股票的遗产，”Miso首席战略官员Jake Brewer在今天早上的消息中绑定了新闻稿。 “订单履行是客户满意度的主要因素，运营商在送货驾驶员或客户访问时留下了留下的饮料。我们非常兴奋地创建一个产品，不仅会使商业厨房工作的人更好，而且将成为整个行业的游戏变频器，以提供世界级客户体验。“\n  谈到掠夺时的罢工，公司也使用机会宣布计划的系列D，最近封闭了2500万美元C. ", "note_en": "The system, which is being created as part of a partnership with beverage dispenser manufacturer Lancer, brings an added level of automation to your standard fast food fountain. It has a point of sale system directly integrated, which kicks off the process of pouring, sealing and advancing the drink. Beyond that, it’s integrated with a larger sales system to ensure that it’s getting orders right, between in-person customers and delivery drivers.\n   Basically it’s a much smarter version of the fountain you encounter in every fast food restaurant and movie theater. Naturally, the company says that interest in the category has only increased amid labor shortages and a pandemic that froze much of the available workforce over the past year and a half.\n “Lancer has a legacy of stand-out industry quality and shares in our vision for beverage innovation and futuristic design,” Miso Chief Strategy Officer Jake Brewer said in a press release tied to this morning’s news. “Order fulfillment is a major factor for customer satisfaction and operators can’t afford to have a beverage left behind when a delivery driver or customer visits. We are extremely excited to create a product that will not only make the lives of those working in commercial kitchens better, but will be a game changer for the industry as a whole to deliver a world-class customer experience.”\n  Speaking of striking while the iron is hot, the company is also using the opportunity to announce a planned Series D, following up on a recently closed $25 million Series C.", "posttime": "2021-06-22 18:30:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,翻转,flipping,客户", "title": "汉堡翻转机器人公司MISO推出自动饮料分配器 ", "title_en": "\n\t\t\t\tHamburger-flipping robotics company Miso introduces an automated beverage dispenser\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/22/hamburger-flipping-robotics-maker-miso-introduces-automated-beverage-dispenser/", "via": "", "real_tags": ["机器人", "翻转", "flipping", "客户"]}, {"category": "", "categoryclass": "", "imagename": "2e2e71d180955b83e162ff9a8188e0c0.jpg", "infoid": 1067406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "融资回合，表示是最大的网络安全历史投资和一个引导公司的最高估值之一，由洞察力合作伙伴和大西洋领导，来自Cyber​​starts，Geodesic，Syn Ventures，Vintage和Artisanal的额外投资冒险。\n 传输安全称，它具有22亿美元的拨款估值，并将利用新资金扩大其覆盖范围并投资重点全球地区以发展本组织。\n 然而，最终，资金回合将有助于公司加速其使命帮助世界无密码。根据“创业板”，组织每年减少数百万美元的美元密码的身份验证;不仅弱密码占所有数据泄露的80％以上，但平均帮助台劳动力成本重置单个密码超过70美元。\n 传输表示，其生物识别的验证者是第一个本身的无密码标识和风险管理解决方案，它已被许多大型品牌采用，包括Lowes，Santander和UB。该解决方案目前每秒处理超过9,000名认证请求，可以将帐户重置为96％，并将客户认证从1分钟降至2秒。\n “通过消除密码，企业可以立即减少流失和购物车放弃并为个人数据提供卓越的安全性，”在2014年共同创立了公司的传输安全CEO米基Boodai表示。“我们的客户，无论他们是零售，银行，金融，电信或汽车部门，了解提供优化的身份经验是多米的挑战。借助来自Premier Partners的最新一轮资金，我们可以大大扩大我们的覆盖范围来帮助摆脱密码世界。“\n 传输安全性不是唯一一个在任务上杀掉密码的公司。 Microsoft宣布计划制作Windows 10无密码，Apple最近预览了iCloud keychain的Passkeys，这是由WebAuthn提供支持的无密码认证的方法，以及面部ID和触摸ID。 ", "note_en": "The funding round, said to be the largest Series A investment in cybersecurity history and one of the highest valuations for a bootstrapped company, was led by  Insight Partners and General Atlantic, with additional investment from Cyberstarts, Geodesic, SYN Ventures, Vintage, and Artisanal Ventures.\n Transmit Security said it has a pre-money valuation of $2.2 billion, and will use the new funds to expand its reach and investing in key global areas to grow the organization.\n Ultimately, however, the funding round will help the company to accelerate its mission to help the world go passwordless. Organizations lose millions of dollars every year due to “inherently unsafe” password-based authentication, according to the startup; not only do weak passwords account for more than 80% of all  data breaches, but the average help desk labor cost to reset a single password stands at more than $70.\n Transmit says its biometric-based authenticator is the first natively passwordless identity and risk management solution, and it has already been adopted by a number of big-name brands including Lowes, Santander, and UBS. The solution, which currently handles more than 9,000 authentication requests per second, can reduce account resets by 96%, the company says, and reduces customer authentication from 1 minute to 2 seconds.\n “By eliminating passwords, businesses can immediately reduce churn and cart abandonment and provide superior security for personal data,” said Transmit Security CEO Mickey Boodaei, who co-founded the company in 2014. “Our customers, whether they are in the retail, banking, financial, telecommunications, or automotive sectors, understand that providing an optimized identity experience is a multimillion-dollar challenge. With this latest round of funding from premier partners, we can significantly expand our reach to help rid the world of passwords.”\n Transmit Security isn’t the only company that’s on a mission to kill off the password. Microsoft has announced plans to make  Windows 10 password-free, and  Apple recently previewed Passkeys in iCloud Keychain, a method of passwordless authentication powered by  WebAuthn, and Face ID and Touch ID.", "posttime": "2021-06-22 18:30:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,安全性,security", "title": "传输安全性提高了543米系列A才能终止密码 ", "title_en": "\n\t\t\t\tTransmit Security raises $543M Series A to kill off the password\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/22/transmit-security-raises-543m-series-a-to-kill-off-the-password/", "via": "", "real_tags": ["密码", "安全性", "security"]}, {"category": "", "categoryclass": "", "imagename": "3e967154742b17efac2d0f4d16be0575.jpg", "infoid": 1067404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过六个月的轨道轨道轨道和校准后，Sentinel-6 Michael Freilich卫星将于6月22日向公众提供其前两个数据流。它于11月21日在加利福尼亚州的Vandenberg空军基地推出，并且是美国欧洲合作，以测量海面高度和其他关键海洋特征，如海洋表面风速和波浪高度。将释放的海面高度之一是2.3英寸（5.8厘米）的准确性，当仪器船舶寄宿in-6 Michael Freilich收集它时，将在小时内提供。第二个数据流，准确到1.4英寸（3.5厘米），将在收集后两天发布。当产品变得可用的差异，以预测和帮助监测飓风的形成等任务的交付时间余量。更多的数据集，该数据集将准确到约1.2英寸（2.9厘米），在今年晚些时候分发，旨在用于研究活动和气候科学，包括跟踪全球平均海平面上升。\n  卫星，以前NASA地球科学部主任Michael Freilich命名，收集其测量约为世界的90％＆＃39;海洋。它是撰写哥白尼Sentinel-6 / Jason-CS（服务的连续性）任务的两颗卫星之一。第二颗卫星，哨兵-6B是在2025年推出的。它们在一起，它们是一系列的航天器，于1992年以Topex / Poseidon开头，并继续持有一系列卫星，这些卫星已经收集精确的海洋高度测量近30年。\n  发布后不久，Sentinel-6 Michael Freilich进入了位置，落后于当前参考海平面卫星Jason-3到30秒。然后，科学家和工程师花费时间交叉校准两颗卫星收集的数据，以确保两者之间的测量的连续性。一旦他们确信数据质量，Sentinel-6 Michael Freilich将成为主要海平面卫星。\n  ＆＃34;它＆＃39;知道卫星正在工作，数据看起来很好，＆＃34; Josh Willis表示，美国宇航局的项目科学家＆＃39;加州南部的喷射推进实验室。 ＆＃34;几个月到现在，Sentinel-6 Michael Freilich将接管其前身jason-3，这个数据发布是该过程的第一步。＆＃34;\n      通过增加温室气体浓度，海洋吸收超过90％的热量，导致海水扩张和海平面上升。监测海洋高度很重要，因为它有助于预测员预测事物，包括海洋电流和潜在的飓风强度。\n  ＆＃34;这些初始数据显示，Sentinel-6 Michael Freilich是一个惊人的新工具，有助于改善海洋和天气预报，＆＃34;马里兰州国家海洋和大气管理局的Eric Leuliette，计划和项目科学家。 ＆＃34;在一个变化的气候，它＆＃39;这一数据准备好发布的伟大成就。＆＃34;\n  Ocean Altimetry计划经理Julia Figa Eumetsat（欧​​洲剥削气象卫星组织），补充说，来自这种独特的海洋AltiMetry Mission的第一个数据流的操作释放是大西洋飓风季节开始的重要里程碑。 \n＆＃34;在达姆施塔特的Eumesat总部正在从达姆施塔特的Eumesat总部处理，从那里，卫星也被控制，并释放到世界各地的海洋和天气预报数据用户，以获得他们的运营用法，＆＃34; Saldana说。\n  科学家们还预计使用数据来规范，因为气候变化，海平面的快速升高。温暖海水的扩张占现代海平面上涨的约三分之一，而冰川和冰床的熔融水占其余的。在过去的二十年里，海洋上升的速度加速了，研究人员希望在未来几年内加快更多地加快更多。海平面上升将改变海岸线并增加潮汐和风暴的洪水。为了更好地了解海洋如何影响人性，研究人员需要长期的气候记录 -  Sentinel-6 Michael Freilich将有助于提供。\n    Sentinel-6 / Jason-CS由ESA（欧洲航天局），Eumetsat，NASA和NOAA共同开发，来自欧洲委员会和法国的技术支持和国家空间研究中心的资金支持。\n  JPL是帕萨迪纳的CALTECH的一个部门，正在为每个Sentinel-6卫星提供三种科学仪器：先进的微波辐射计，全球导航卫星系统 - 无线电掩星和激光反向反射仪阵列。美国宇航局还在贡献发射服务，地面系统支持NASA科学仪器的运行，这两个仪器的科学数据处理器，以及对美国国际海面地形科学团队的美国成员的支持。引文：主要海洋观测卫星开始提供科学数据（2021年，6月21日）从Https://phys.org/news/2021-06-major-ocean-observing-satellite-science.html\n  本文件受版权保护。除了私人学习或研究目的的任何公平交易外，没有书面许可，没有任何部分。内容仅供参考。 ", "note_en": "After six months of check-out and calibration in orbit, the Sentinel-6 Michael Freilich satellite will make its first two data streams available to the public on June 22. It launched from Vandenberg Air Force Base in California on Nov. 21, 2020, and is a U.S.-European collaboration to measure sea surface height and other key ocean features, such as ocean surface wind speed and wave height.    One of the sea surface height   that will be released is accurate to 2.3 inches (5.8 centimeters) and will be available within hours of when the instruments aboard Sentinel-6 Michael Freilich collect it. A second stream of data, accurate to 1.4 inches (3.5 centimeters), will be released two days after collection. The difference in when the products become available balances accuracy with delivery timeliness for tasks like forecasting the   and helping to monitor the formation of hurricanes. More datasets, which will be accurate to about 1.2 inches (2.9 centimeters), are slated for distribution later this year and are intended for research activities and climate science including tracking global mean sea level rise.\n  The satellite, named after former NASA Earth Science Division Director Michael Freilich, collects its measurements for about 90% of the world&#39;s oceans. It is one of two satellites that compose the Copernicus Sentinel-6/Jason-CS (Continuity of Service) mission. The second satellite, Sentinel-6B, is slated for launch in 2025. Together, they are the latest in a series of spacecraft starting with TOPEX/Poseidon in 1992 and continuing with the Jason series of satellites that have been gathering precise ocean height measurements for nearly 30 years.\n  Shortly after launch, Sentinel-6 Michael Freilich moved into position, trailing the current reference sea level satellite Jason-3 by 30 seconds. Scientists and engineers then spent time cross-calibrating the data collected by both satellites to ensure the continuity of measurements between the two. Once they have are assured of the data quality, Sentinel-6 Michael Freilich will then become the primary sea level satellite.\n  &#34;It&#39;s a relief knowing that the satellite is working and that the data look good,&#34; said Josh Willis, project scientist at NASA&#39;s Jet Propulsion Laboratory in Southern California. &#34;Several months from now, Sentinel-6 Michael Freilich will take over for its predecessor, Jason-3, and this data release is the first step in that process.&#34;\n      The ocean absorbs more than 90% of the heat trapped in the Earth system by increasing concentrations of greenhouse gases, which causes seawater to expand and sea level to rise. Monitoring ocean height is important because it helps forecasters predict things, including ocean currents and potential hurricane strength.\n  &#34;These initial data show that Sentinel-6 Michael Freilich is an amazing new tool that will help to improve marine and weather forecasts,&#34; said Eric Leuliette, program and project scientist at the National Oceanic and Atmospheric Administration in Maryland. &#34;In a changing climate, it&#39;s a great achievement that these data are ready for release.&#34;\n  Ocean Altimetry Programme Manager Julia Figa Saldana of EUMETSAT (European Organisation for the Exploitation of Meteorological Satellites), added that the operational release of the first data streams from this unique ocean altimetry mission was a significant milestone at the start of the Atlantic hurricane season.\n  &#34;The altimetry data are now being processed at EUMESAT headquarters in Darmstadt, from where the satellite is also being controlled, and released to ocean and weather forecasting data users around the world for their operational usage,&#34; Saldana said.\n  Scientists also anticipate using the data to gauge how fast sea levels are rising because of climate change. The expansion of warm seawater accounts for about one-third of modern-day sea level rise, while meltwater from glaciers and ice sheets accounts for the rest. The rate at which the oceans are rising has accelerated over the past two decades, and researchers expect it to speed up more in the years to come. Sea level rise will change coastlines and increase flooding from tides and storms. To better understand how rising seas will impact humanity, researchers need long climate records—something Sentinel-6 Michael Freilich will help provide.\n    Sentinel-6/Jason-CS is being jointly developed by ESA (European Space Agency), EUMETSAT, NASA, and NOAA, with funding support from the European Commission and technical support from France&#39;s National Centre for Space Studies.\n  JPL, a division of Caltech in Pasadena, is contributing three science instruments for each Sentinel-6 satellite: The Advanced Microwave Radiometer, the Global Navigation Satellite System—Radio Occultation, and the Laser Retroreflector Array. NASA is also contributing launch services, ground systems supporting operation of the NASA science instruments, the science data processors for two of these instruments, and support for the U.S. members of the international Ocean Surface Topography Science Team.             Citation: Major ocean-observing satellite starts providing science data (2021, June 21) retrieved 22 June 2021 from https://phys.org/news/2021-06-major-ocean-observing-satellite-science.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2021-06-22 18:21:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "观测,ocean,海洋", "title": "主要海洋观测卫星开始提供科学数据 ", "title_en": "Major Ocean-Observing Satellite Starts Providing Science Data", "transed": 1, "url": "https://phys.org/news/2021-06-major-ocean-observing-satellite-science.html", "via": "", "real_tags": ["观测", "ocean", "海洋"]}, {"category": "", "categoryclass": "", "imagename": "546f3149ebe86f7f6051c58e2501cf9b.jpg", "infoid": 1067403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Usni News已经学会了，两个北约军舰的追踪数据被伪造了俄罗斯对照海军基地的海岸，而实际的船只已经停泊了180英里，Usni新闻已经了解到了。英国皇家海军的HMS Defender是一款45岁的Daring-Class Destroyer，以及Royal Netherlands Navy的HNLMS Evertsen，AdzevenProvinciën-Class Priatial，于6月18日在乌克兰拉入Odessa。该集团被俄罗斯战舰监测根据美国海军照片的说法，在黑海中锻炼在6月17日。\n 根据自动识别系统（AIS）信号，它传输位置细节，以提高海上安全性，这对若要在6月18日午夜之前离开了Odessa。数据显示他们直接航行到塞瓦斯托波尔，接近港湾的两海里航海入口。战略港口设有俄罗斯黑海舰队的总部。\n 尽管是AIS轨道，但有明确的证据表明这两艘军舰没有离开敖德萨。然而，Live网络摄像头饲料表明他们没有离开敖德萨。无论如何，这是国防圈和当地媒体的已知情况。敖德萨的任何人都可以看到他们没有离开。网络摄像头在Odessa Online广播为YouTube而直播。像Windy.com这样的第三方天气网站存档的屏幕截图显示了Odessa的两艘Warships过夜。\n 根据俄罗斯海军大基地入口处的入口处定位两个北约军舰将被广泛被视为一种挑衅行动，基于对主权的矛盾的主张。其中大多数国际社会，包括美国，英国和荷兰，不认为是克里米亚作为俄罗斯的一部分。\n  虽然欺骗的动机尚不清楚，但该行动提出了关于开源情报数据（例如AIS）的效果的问题，这在防御和记者中变得越来越普遍。有令人信服的证据表明AIS轨道被伪造。北约代表没有立即回应评论请求，曲目被荷兰海军战争新闻网站Marineschepen.nl。\n AIS职位与AIS聚合器Marinetraffic.com在Chornomorsk的接收站分享，靠近敖德萨。其他AIS聚合器还报告了假职位。在她目前正在使用的凭证下显示HMS后卫，IMO 4907878.HNLMS Evertsen被报告为“荷兰舰船”，MMSI 244942000。目前尚不清楚错误的AIS数据如何引入饲料。\n 载体罢工组都是CSG21的一部分，该部分后卫和evertsen都以HMS女王伊丽莎白（R08）为中心。 CSG21的主体仍然在地中海，而两艘临时部署到黑海的战舰，在那里他们一直在进行导航任务自由并与盟友锻炼身体。他们访问了土耳其和乌克兰，也将与罗马尼亚和格鲁吉亚一起锻炼身体。他们还遇到了美国海军的阿利伯克级驱逐舰USS Laboon（DDG-58）。 ", "note_en": "The tracking data of two NATO warships was faked off the coast of a Russian controlled naval base in the Black Sea while the actual ships were moored 180 miles away, USNI News has learned.   The U.K. Royal Navy’s HMS  Defender, a Type-45 Daring-class destroyer, and the Royal Netherlands Navy’s HNLMS  Evertsen, a De Zeven Provinciën-class frigate, pulled into Odessa in  Ukraine on June 18. The group had been monitored by Russian warships while exercising in the Black Sea, according to U.S. Navy photos dated on June 17.\n According to an automatic identification system (AIS) signal, which transmits position details to improve maritime safety, the pair left Odessa just before midnight on June 18. The data shows that they sailed directly to Sevastopol, approaching to within two nautical miles of the harbor entrance. The strategic port houses the headquarters of Russia’s Black Sea fleet.\n Despite the AIS track, there is clear evidence that the two warships did not leave Odessa. Live webcam feeds show that they did not leave Odessa, however. This was anyway the known situation in defense circles, and local media. Anyone in Odessa can see that they did not leave. The webcams are broadcast live  on YouTube by  Odessa Online. Screenshots archived by third party weather sites like  Windy.com show the two warships present in Odessa overnight.\n Positioning two NATO warships at the entrance at the entrance of a major Russian naval base would be widely seen as a provocative action, based on conflicting claims of sovereignty . Most of the international community, including the U.S, Britain and the Netherlands, do not recognize Crimea as part of Russia.\n  While the motives for the deception are unclear, the move raises questions about the efficacy of open-source intelligence data, such as AIS, which is becoming more common in both defense and by journalists. There is compelling evidence that the AIS tracks were faked. NATO representatives did not immediately respond to requests for comment and the tracks were confirmed as false by Dutch naval warfare news site  Marineschepen.nl.\n The AIS positions were shared with AIS aggregator MarineTraffic.com by a receiver station in Chornomorsk, close to Odessa. Other AIS aggregators also reported the false positions. HMS  Defender was shown under the credentials that she is currently using, IMO 4907878. HNLMS  Evertsen was reported as “Netherlands Warship,” MMSI 244942000. It is unclear how the false AIS data was introduced to the feed.\n Both  Defender and  Evertsen are part of CSG21, the carrier strike group centered around HMS  Queen Elizabeth (R08). The main body of CSG21 has remained in the Mediterranean, while the two warships temporarily deployed to the Black Sea, where they have been performing freedom of navigation missions and exercising with allies. They have visited Turkey and Ukraine and will also exercise with Romania and Georgia. They have also met with the U.S. Navy’s Arleigh Burke-class destroyer USS  Laboon (DDG-58).", "posttime": "2021-06-22 18:20:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,船舶,nato,ais", "title": "两个北约船舶的职位在俄罗斯黑海海军基地附近伪造 ", "title_en": "Positions of Two NATO Ships Were Falsified Near Russian Black Sea Naval Base", "transed": 1, "url": "https://news.usni.org/2021/06/21/positions-of-two-nato-ships-were-falsified-near-russian-black-sea-naval-base", "via": "", "real_tags": ["俄罗斯", "船舶", "nato", "ais"]}, {"category": "", "categoryclass": "", "imagename": "953fd3dba031d2c49dc9d6c1bcf1f10e.png", "infoid": 1067402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要查看可以使用SILICE完成的内容，请结帐示例项目（所有这些都在此回购中提供）。\n  重要提示：最新变更发生在WIP（正在进行的工作）和草案分支机构中，检查出来享受最新功能。阅读更多关于发展分支机构的信息。\n   siliice简化了FPGA上的原型化算法。它提供了一个舒适但薄的抽象以上Verilog（典型的硬件描述语言），简化了设计而不会对硬件进行精确控制。它提供＆＃34;生活质量＆＃34;分组信号的功能，定义通用接口和电路，实例化块RAM，描述管道，处理多个时钟域并自动管理Flip-flops.it给出（可选）将您的设计的部分写为操作序列，子程序可以调用，并使用诸如虽然和中断的控制流语句，描述并行运行的操作和算法，精确地in sync.silice检测组合循环以及许多其他错误易于易因的情况，并具有启用高级的Lua-pre处理器代码生成。\n Silien并不旨在成为一个高水平的合成语言：它仍然靠近硬件，让您充分利用FPGA架构，并对您的设计如何映射到硬件的粒度控制：您仍然控制每个和每个和每个架构每个时钟周期，具有可预测的流量控制规则，如何以及当执行状态出现如何以及何时，如何触发器映射到变量以及被注册的内容。事实上，如果你选择了你可以以与Verilog非常相似的方式设计，同时仍然受益于＆＃34;生活质量＆＃34; SILICE语法的改进允许从概念中优化初始原型来实现高效实现.SILICE与Verilog编译和互操作：您可以直接实例化并与现有模块绑定。\n 该语言具有完整的构建系统，许多示例和基本组件（VGA，HDMI，OLED，UART和SDRAM控制器）。构建系统允许轻松开始，并且已经支持许多热门电路板，如破冰船，ULX3S，FOMU和ICESTICK。\n 您不需要使用FPGA来开始使用SILIC：设计和它们的输出（例如VGA信号）可以模拟和可视化。 Silice与开源FGPA Toolchain（Yosys / NextPNR / ICEStorm）一起工作，请参阅ICE40和ECP5示例。\n 虽然我为自己的需求开发了愚蠢，但我希望你＆＃39; ll找到它的项目很有用！ \nSiliel不抽象硬件：程序员仍然控制并非常接近硬件功能。它提供了简化设计和重用（信号组，通用界面，流水线）的句法助手。 SILICE也可以帮助您在执行流程和操作序列方面推理。但是，这不是强制性的，您也可以完全控制并使用更直接的硬件设计风格。使用SILIES开发时，您可以将优化努力集中在关键部件上，并在设计的其他部分使用更简单的方法。\n  清洁，简单的语法，清楚地暴露了运营流程以及所花费的时钟周期的流程。\n   可选的流量控制面向设计风格（自动FSM生成），自然地集成在设计中：虽然，断裂，子程序。\n  自动考虑为变量创建触发器，具有自动修剪（例如const或绑定）。\n  Fire-V项目是一种具有RV32I处理器的图形RISCV框架，主要依赖于非顺序构造。\n    1算法主要（输出UINT8 LED）{2 UINT28计数器= 0; // A 28位无符号整数3 LED：=计数器[20,8]; // LED使用8个最高有效位4的每个时钟更新了（1）{// forever 5计数器=计数器+ 1; //增量计数器6} 7}\n      第1行是任何SILIES硬件的入口点：主要算法。第2行We Definea 28位无符号int，初始化为0.初始化器是强制性的，始终是常用项.Line 3我们请求输出LED跟踪计数器变量的八个最高有效位。语法[20,8]表示8位从位20开始。分配给LEDUSES：=运算符是一个始终分配：LED现在在每个上升时钟后用计数器自动地自动化。这样的分配必须在任何其他指令之前出现算法的顶部。 \n最后，第4-6行定义了递增计数器的无限循环。当然，28位计数器最终将溢出并返回到0，因此循环LED灯模式。在这种情况下，循环采取恰好一个循环执行：我们每次激励为50 MHz（Mojo v3的时钟频率）的一个增量）。\n 然后我们用siliice编写。 -f参数表示要使用的框架：这是ANFPGA Plateform相关包装代码。在这里，我们仅使用Mojo框架与LED。提供其他框架，很容易写自己。\n -O参数指示编写Verilog输出的位置。在此示例中，我们覆盖了预先存在的项目的主文件，然后使用Xilinx ISE Toolchain编译.Fear不是，我们还有与Yosys，NextPNR和Project Icestorm一起使用的示例！\n    1算法main（）{2 brom int12 sintbl [4096] = {...} 3 ... 4（1）{//渲染循环5 //获取cos / sin视图6 sintbl。 Addr =（VieeAngle）＆amp; 4095; 7 ++：8 SINVIEW = SINTBL。 rdata; 9 Sintbl。 Addr =（VieeAngle + 1024）＆amp; 4095; 10 ++：11 cosview = sintbl。 rdata; 12 ...\n  此代码在块ROM中存储正弦表，并访问它以获取当前视图角度的余弦和正弦。注意：++：步进操作员在第7行和10中。这明确地分割了exectutuct流程并介绍一个循环延迟，这里等待BROM输出其结果在addr.anything中的Select地址的字段RDATA中的结果被认为是组合;例如，在硬件上并行评估线8和9，因为它们产生两片独立电路。\n     请参阅“入门指南”。愚蠢在Windows，Linux和MacOS上运行很好！要开始编写编写代码，请参阅编写您的第一个设计。查看可以使用SILICE完成的内容，结帐我们的示例项目（所有在此回购中提供）。\n  siliel已经用于从一个小型RISC-V处理器到整个游戏渲染循环（访问示例页面）的非琐碎的设计。 \n然而，Siliel正在积极发展。 我决定打开回购，所以每个人都可以加入乐趣，但它远非完整：文件缺乏，一些例子已经过时或远远抛光，一些非常重要的语言功能丢失，并且存在许多知名问题（头 到问题页面）。 我有信心我可以避免主要的代码破坏语法变化，但可能需要一些调整。  我希望你＆＃39;仍然喜欢潜入它，并会发现它很有用。 请告诉我您的想法：欢迎意见和捐款！  项目包含许多演示项目（参见其中的自述文件）以及为几个板构建脚本  工具包含对SiliUs开发的工具，源或二进制表单（要安装，请参阅入门） ", "note_en": "To see what can be done with Silice, checkout the  example projects (all are available in this repo).\n  Important: Latest changes occur in the  wip (work in progress) and  draft branches, check it out to enjoy the latest features.  Read more about development branches.\n   Silice simplifies prototyping algorithms on FPGAs. It provides a comfortable yet thin abstraction above  Verilog (a typical hardware description language), simplifying design without loosing precise control over the hardware. It provides &#34;quality of life&#34; features to group signals, define generic interfaces and circuitries, instantiate block RAMs, describe pipelines, deal with multiple clock domains and automatically manage flip-flops.It gives the (optional) ability to write parts of your design as sequences of operations, subroutines that can be called, and to use control flow statements such as while and break, describing operations and algorithms that run in parallel and are precisely in sync.Silice detects combinatorial loops and many other error-prone cases, and features a Lua-preprocessor enabling advanced code generation.\n Silice does not aim to be a high level synthesis language: it  remains close to the hardware and lets you fully exploit FPGA architectures, with a fine grain control on how your design maps to the hardware: You remain in control of what happens at each and every clock cycle, with predictable rules for flow control, how and when execution states appear, how flip-flops map to variables, and what gets registered or not. In fact, if you chose so you can design in a way that is very similar to Verilog, while still benefiting from the &#34;quality of life&#34; improvements of Silice syntax.This allows to refine an initial prototype from concept to efficient implementation.Silice compiles to and inter-operates with Verilog: you can directly instantiate and bind with existing modules.\n The language comes with a complete build system,  many examples and  basic components (VGA, HDMI, OLED, UART, and SDRAM controllers). The build system allows to  get started easily, and already supports many  popular boards such as the IceBreaker, ULX3S, Fomu and IceStick.\n You do not need an FPGA to start with Silice: designs and their outputs (e.g. VGA signal) can be simulated and visualized. Silice works great with the open source FGPA toolchain (yosys/nextpnr/icestorm), see our  Ice40 and ECP5 examples.\n While I developed Silice for my own needs, I hope you&#39;ll find it useful for your projects!\n  Silice does not abstract away the hardware: the programmer remains in control and very close to hardware features. It provides syntactic helpers simplifying design and reuse (signal groups, generic interfaces, pipelining). Silice can also help you reason in terms of execution flow and operation sequences. However, this is not mandatory and you can also take full control and use a more direct hardware design style. When developing with Silice you can focus  optimization efforts on critical parts, and use a simpler approach in other parts of the design.\n  A clean, simple syntax that clearly exposes the flow of operations and where clock cycles are spent.\n   An optional flow-control oriented design style (automatic FSM generation), that naturally integrates within a design: while, break, subroutines.\n  Automatically takes care of creating flip-flops for variables, with automatic pruning (e.g. const or bindings).\n  The  fire-v project is a graphical RISCV framework with a  RV32I processor that relies mostly on non-sequential constructs.\n    1 algorithm  main(output uint8 led) {  2 uint28 counter =  0;   // a 28 bits unsigned integer 3 led := counter[ 20, 8];   // LEDs updated every clock with the 8 most significant bits  4  while ( 1) {   // forever 5 counter = counter +  1;   // increment counter 6 }  7 }\n      Line 1 is the entry point of any Silice hardware: the main algorithm. Line 2 we definea 28 bits unsigned int, initialized to 0. Initializers are mandatory and are always constants.Line 3 we request that the output led tracks the eight most significant bits of the counter variable.The syntax [20,8] means 8 bits wide starting from bit 20. The assignment to leduses the := operator which is an  always assignment: led is now automaticallyupdated with counter after each rising clock. Such assignments have to appearat the top of an algorithm, right before any other instruction.\n Finally, lines 4-6 define the infinite loop that increments the counter. Of course the28 bit counter will ultimately overflow and go back to 0, hence the cyclic LED light pattern.In this case, the loop takes exactly one cycle to execute: we have one increment per cycleat 50 MHz (the clock frequency of the Mojo v3).\n We then compile with silice. The -f parameter indicates which framework to use: this is anFPGA plateform dependent wrapper code. Here we are using the Mojo framework with LEDs only.Several other frameworks are provided, and it is easy to write your own.\n The -o parameter indicates where to write the Verilog output. In this example we overwritethe main file of a pre-existing project, which is then compiled using Xilinx ISE toolchain.Fear not, we also have examples working with yosys, nextpnr and  project icestorm!\n    1 algorithm  main() {  2 brom int12 sintbl[ 4096] = {...} 3 ... 4  while ( 1) {   // render loop 5   // get cos/sin view 6 sintbl. addr = (viewangle) &amp;  4095; 7 ++: 8 sinview = sintbl. rdata; 9 sintbl. addr = (viewangle +  1024) &amp;  4095; 10 ++: 11 cosview = sintbl. rdata; 12 ...\n  This code is storing a sine table in a block ROM and accesses it to obtain a cosine and sine for the current view angle.Note the use of the  ++:  step operator in lines 7 and 10. This explicitely splits the exectution flow and introduces a one cycle delay, here waiting for the brom to output its result in field  rdata for the select address in  addr.Anything in between is considered combinational; for instance lines 8 and 9 are evaluated in parallel on hardware, as theyeach produce two pieces of independent circuitry.\n     See the  getting started guide. Silice runs great on Windows, Linux, and macOS!To start writing code, see  writing your first design.To see what can be done with Silice, checkout our  example projects (all are available in this repo).\n  Silice can already be used to create non trivial designs, from a tiny Risc-V processor to an entire game render loop (visit the  examples page).\n However Silice is under active development. I decided to open the repo so everyone can join in the fun, but it is far from complete: documentation is lacking, some examples are outdated or far from polished, some very important language features are missing, and many known issues exist (head out to the  Issues page). I am confident I can avoid major code breaking syntax changes, but some adjustments may be necessary.\n I hope you&#39;ll nevertheless enjoy diving into it, and will find it useful. Please let me know your thoughts: comments and contributions are welcome!\n    projects contains many demo projects ( see README therein) as well as build scripts for several boards\n   tools contains tools useful for Silice development, either source or binary form (to be installed, see  getting started)", "posttime": "2021-06-22 18:20:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硬件,algorithms,language", "title": "SILICE：用于硬件硬件硬件硬件的语言 ", "title_en": "Silice: A language for hardcoding Algorithms into FPGA hardware", "transed": 1, "url": "https://github.com/sylefeb/Silice", "via": "", "real_tags": ["硬件", "language"]}, {"category": "", "categoryclass": "", "imagename": "77a5a34cb47ab9b101c09aaeb8540670.jpeg", "infoid": 1067400, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一项新的研究，银河系的中心可能是暗物而不是超大的黑洞。\n 该研究基于对最接近中心的物体的观察。\n   如果我们的星系的中心是毕竟不是超级分类的黑洞，而是巨大的暗物质？这将使我们对银河系的长期理解，但在一项新的研究中，来自意大利，阿根廷和哥伦比亚的科学家表示证据堆积起来。\n ➡你认为空间是坏事。我们也是。让我们一起探索它。\n 在银河系中心的超大分离的黑洞的想法是完全成熟的，部分地基于S0-2等特定恒星的轨道。科学家们在轨道中研究了这些物体，作为推断他们实际轨道的东西 - 在这种情况下，“超大的黑洞400万次太阳的阳光，”Sciencealert解释道。\n 超大分离的黑洞称为射手座a *。 S0-2和其他既定的恒星将在射手座A *周围的轨道上拉动，进入科学家衡量的极端轨道，以便了解超现实的黑洞所在的内容。想想肥皂苏斯如何表现如何，因为水蜿蜒到你的流失，这告诉你流失所做的事情。即使你无法直接看到排水沟，它周围的行为也会给你线索。\n  科学家们仍在进行那种研究，但是一个新的空间物体逐渐涌现在黑洞理论上。这些物体“看起来像天然气，像星星一样，”物理学家安德里亚格兹在2020年告诉科西伦特。这类物质有六个“G”对象，轨道从170到1,600年。 \n最近，他们的不良轨道导致了一个新的竞争理论来描述银河系的中心。\n 2014年，科学家观察到对象G2将其最接近的光点传递给射手座A *并延伸出来并扭曲 - 一种称为阻力的现象。这是意大利的国际相对论天体物理学中心的科学家，是一个标志，Sagittarius A *可能是除了超级分类的黑洞之外的东西。\n  在2020年，同一研究团队发表了G2和S2可能会在射手座A *附近经历同样不同的引力拉。他们说，这些物体表现的方式与特定类型的暗物质更加一致，在它们对黑洞的并排分析与暗物质中的解释中，暗物质是更好的统计契合。\n  暗物质是我们看不到的，但我们可以通过它对它周围的重力和物体的影响来衡量它。暗物质占我们宇宙质量的30％，但它是看不见的，到目前为止，没有直接观察到。但它的存在以及暗能的相关观念，占美国周围的宇宙质量的99.5％，并为物理和宇宙学中的一大问题提供了缺失的作品。\n 暗物质可以并确实变成黑洞，但科学家们指出，射手座a *代替斑点的质量，这将需要更多的材料，以便变成一个黑洞。目前，它可以成为一个密集的斑点，仍然吸引附近物体作为黑洞。如果它是一种未来的未来黑洞，可以解释一下第一名的超级分配黑洞的形式 - 几十年来的科学家们已经疑惑。\n 在这项新研究中，由Mnras字母，意大利语，阿根廷人和哥伦比亚科学家的出版物接受，不仅仅是直接影响的G2和S2空间对象与暗物质理论相结合。他们已经将他们的研究扩展到最接近的最良好的星星轨道射手座A *，发现这些恒星也与暗物质模型一致。\n 那么，这些发现意味着什么？好吧，当涉及到银河系的心中的旋转的谜团时，所有新闻都是好消息。这些科学家推出了一个雄心勃勃的新理论，随后的工作将备份或尊重不同意，引用不同的分析和观察。这将继续导致更好地了解超现实的黑洞和射手座A * *特别方案，可以帮助解决谜团。 \n此内容由第三方创建和维护，并导入本页以帮助用户提供其电子邮件地址。 您可以在Piano.io找到有关此产品和类似内容的更多信息 ", "note_en": "The center of the Milky Way  could be dark matter instead of a  supermassive black hole, according to a new study.\n The study is based on observations of the objects that orbit closest to the center.\n   What if the center of our galaxy isn’t a  supermassive black hole after all, but instead, a massive amount of  dark matter? That would flip our long-held understanding of the Milky Way, but in a new study, scientists from Italy, Argentina, and Colombia say the evidence stacks up.\n ➡  You think space is badass. So do we.  Let’s explore it together.\n The idea of a supermassive black hole at the center of the Milky Way is well-established, based partly on the orbit of   specific stars like S0-2. Scientists study these objects in orbit as a way to extrapolate what they’re actually orbiting around—in this case, “a supermassive black hole 4 million times the mass of the Sun,”  ScienceAlert   explains.\n That supermassive black hole is called  Sagittarius A*. S0-2 and other established stars are pulled every which way in their orbits around Sagittarius A*, into extreme orbits that scientists measure in order to get some idea of what the supermassive black hole is all about. Think about how soap suds behave as water swirls down your drain and what that tells you about what the drain is doing. Even if you couldn’t see the drain directly, the behaviors around it would give you clues.\n  Scientists are still conducting that kind of research, but a new-to-us class of space objects is casting a shadow over the black hole theory. These objects “look like gas but behave like stars,” physicist Andrea Ghez   told  ScienceAlert in 2020. There are six “G” objects of this kind, with orbits ranging from 170 to 1,600 years long.\n Recently, their wonky orbits have led to a new, competing theory to describe the center of the Milky Way.\n In 2014, scientists observed object G2 pass its closest point to Sagittarius A* and become stretched out and distorted—a phenomenon known as  drag. This, scientists from the International Center for Relativistic Astrophysics in Italy say, is a sign that Sagittarius A* might be something other than a supermassive black hole.\n  In 2020, the same research team   published findings that G2 and S2 might be experiencing the same different kind of gravitational pull near Sagittarius A*. They say the way these objects behave is more consistent with a specific kind of  dark matter, In their side-by-side analysis of black hole versus dark matter as the explanation, dark matter was a better statistical fit.\n  Dark matter is matter that we can’t see, but we  can measure it through its effect on gravity and objects around it. Dark matter   makes up 30 percent of the mass of our universe, yet it’s invisible and, so far, not directly observed. But its presence, along with the related idea of dark  energy, makes up a total of 99.5 percent of the mass of the universe around us and provides the missing piece to a ton of questions in physics and cosmology.\n Dark matter can and does turn into black holes, but the scientists posit that Sagittarius A* is instead a blob-like mass that will require a lot more material in order to turn into a black hole. For now, it could just be a dense blob that still attracts nearby objects as a black hole does. And if it  is a kind of proto future black hole, that could explain how supermassive black holes form in the first place—something scientists have been puzzled by for decades.\n In this  new study, accepted for publication by  MNRAS Letters, the Italian, Argentinian, and Colombian scientists explain that not just the directly affected G2 and S2 space objects line up with the dark matter theory. They’ve expanded their study to the closest, most well-understood stars orbiting Sagittarius A* and found those stars  also behave consistently with a dark matter model.\n So, what do these findings mean? Well, when it comes to the swirling mysteries at the heart of the galaxy, all news is good news. These scientists have put out an ambitious new theory, and subsequent work will either back them up or respectfully disagree, citing different analysis and observation. That will continue to lead toward a better understanding of supermassive black holes and of Sagittarius A* in particular, and could help to solve the mystery.\n     This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2021-06-22 18:19:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "中心,milky,黑洞", "title": "毕竟银河系的中心可能不是一个黑洞 ", "title_en": "The center of the Milky Way might not be a black hole after all", "transed": 1, "url": "https://www.popularmechanics.com/space/deep-space/a36530817/the-center-of-the-milky-way-might-not-be-a-black-hole-after-all/", "via": "", "real_tags": ["中心", "milky", "黑洞"]}, {"category": "", "categoryclass": "", "imagename": "9b2d8bde5eda5c21e183fb8fec3d15b3.jpg", "infoid": 1067398, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卢森堡，6月22日（路透社） - 周二的欧洲＆＃39; Sound Court表示，谷歌＆＃39; s（googl.o）YouTube和其他在线平台对用户上传的版权侵权作品不承担某些使适应。\n 案件标志着欧洲和1万亿美元创意行业和在线平台之间的长期战斗中的最新发展，前者从后者寻求赔偿或行动，以便上传的未经授权的作品。\n YouTube在码头在德国·彼得森（Brank Peterson），在德国起诉了公司和谷歌的码头，在2008年通过用户上传到YouTube，他拥有权利的几个唱片。\n 在第二个案例中，Elsevier出版集团在德国的托管服务Cyando进行了法律诉讼，在其用户上传了几个Elsevier在2013年上传的平台上未经其批准，它会在其平台上传。\n 德国法院随后寻求欧盟司法法院的建议，周二统治两种案件。\n ＆＃34;目前代表，在线平台的运营商原则上，原则上，他们本身就通过这些平台的用户在线发布的版权保护内容的公众沟通，＆＃34;欧盟司法法院说。\n ＆＃34;然而，这些运营商确实在违反版权方面进行了这种沟通，以便仅仅使得这些平台提供给公众，＆＃34提供此类内容。法官说。 ", "note_en": "LUXEMBOURG, June 22 (Reuters) - Europe&#39;s top court on Tuesday said that Google&#39;s  (GOOGL.O) YouTube and other online platforms are not liable for copyright-infringing works uploaded by users onto their platforms under certain conditions.\n The case marks the latest development in a long-running battle between Europe&#39;s $1 trillion creative industry and online platforms, with the former seeking compensation or action from the latter for unauthorised works that are uploaded.\n YouTube found itself in the dock after Frank Peterson, a music producer, sued the company and Google in Germany over the uploading to YouTube by users in 2008 of several phonograms to which he holds the rights.\n In a second case, publishing group Elsevier took legal action against file-hosting service Cyando in Germany after its users uploaded several Elsevier works on its platform Uploaded in 2013 without its approval.\n A German court subsequently sought advice from the EU Court of Justice, which ruled on both cases on Tuesday.\n &#34;As currently stands, operators of online platforms do not, in principle, themselves make a communication to the public of copyright-protected content illegally posted online by users of those platforms,&#34; the EU Court of Justice said.\n &#34;However, those operators do make such a communication in breach of copyright where they contribute, beyond merely making those platforms available, to giving access to such content to the public,&#34; judges said.", "posttime": "2021-06-22 17:32:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,上传,court,德国", "title": "欧盟司法法院称YouTube和其他平台对某些条件下用户上传的版权侵权内容不承担责任 ", "title_en": "EU Court of Justice says YouTube and other platforms are not liable for copyright-infringing content uploaded by users under certain conditions", "transed": 1, "url": "https://www.reuters.com/technology/eu-top-court-says-youtube-not-liable-user-copyright-breaches-2021-06-22/", "via": "", "real_tags": ["youtube", "上传", "court", "德国"]}, {"category": "", "categoryclass": "", "imagename": "978d9b661f650c4fbfa3928c9f111237.jpg", "infoid": 1067397, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦市长萨迪克汗宣布，截至2024年底，伦敦地下的乘客将在整个站和隧道网络上进行移动接收。包括牛津马戏团，托特纳姆法院道路，银行，尤斯通和卡姆登镇的热门站将在2022年底持续上升，覆盖在随后的几个月内在阶段扩展。\n 在2020年3月，威斯敏斯特和凯宁镇的禧年的一半汇率介绍了4G覆盖范围后，宣布截至一年以来。伦敦（TFL）的运输，该市的运输当局表示即将到来的基础设施将支持5G网络以及4G，但它将成为移动运营商本身，为下一代移动网络提供支持。\n  “I promised Londoners that if they re-elected me for a second term as mayor I would deliver 4G throughout the tube network,” London’s mayor Sadiq Khan said in a statement. “这已经在Jubilee线的东半部跑了上升，我今天很高兴地宣布，我正在履行这种承诺和完全互联网接入，将在管道上提供，其中有牛津马戏团和尤斯顿等关键的中央伦敦车站在明年年底之前设定为受益。“\n TFL正在使用白通信来提供全网络的覆盖范围。这项工作将涉及在隧道和站内铺设超过2,000公里（1242英里）的布线。除了向管乘客提供移动覆盖之外，该项目还应更普遍地对城市的移动覆盖有益。安装在伦敦地下隧道中的光纤布线还将连接到大楼和其他基础设施，如街道照明和巴士站，允许安装小型移动变送器并增加覆盖范围。\n 该公告在伦敦地下的乘客因大流行而下降，对运输当局具有巨大的财务影响。 6月份，英国政府同意提供第三个救助，以保持服务运行，使总额超过40亿英镑（约56亿美元）。 TFL表示，在网络上提供移动招待会将在20年与Bai提供更多收入。 ", "note_en": "By the end of 2024, passengers on the London Underground will have mobile reception across the entire network of stations and tunnels, London’s mayor Sadiq Khan  has announced. Popular stations, including Oxford Circus, Tottenham Court Road, Bank, Euston, and Camden Town will be hooked up by the end of 2022, with coverage expanding in phases over the ensuing months.\n The announcement comes just over a year after 4G coverage was introduced on the eastern half of the Jubilee line, between  Westminster and Canning Town, in March 2020. Transport for London (TfL), the city’s transport authority, says the upcoming infrastructure will support 5G networks as well as 4G, but that it will be up to mobile operators themselves to offer support for the next-generation mobile network.\n  “I promised Londoners that if they re-elected me for a second term as mayor I would deliver 4G throughout the tube network,” London’s mayor Sadiq Khan said in a statement. “It’s already up and running on the eastern half of the Jubilee line and I’m delighted to announce today that I am fulfilling that commitment and full internet access will be available across the tube, with key central London stations such as Oxford Circus and Euston set to benefit before the end of next year.”\n TfL is working with BAI Communications to offer coverage across the network. The work will involve laying over 2,000km (1242 miles) of cabling within tunnels and stations. As well as offering mobile coverage to tube passengers, the project should also have benefits for mobile coverage in the city more generally. The fibre cabling installed in the London Underground’s tunnels will also connect to buildings and other infrastructure like street lighting and bus stops, allowing small mobile transmitters to be installed and increase coverage.\n The announcement comes as ridership on the London Underground has plummeted as a result of the pandemic, with huge financial implications for the transport authority. In June, the UK government  agreed to give TfL a third bailout to keep services running, bringing the total to over £4 billion (around $5.6 billion). TfL says providing mobile reception across the network will bring in more revenue over the 20-year contract term with BAI.", "posttime": "2021-06-22 16:44:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "市长,popular,移动", "title": "伦敦的市长表示，地下将在整个网络上到2024年底的移动报道，到2022年底，一些流行的站 ", "title_en": "London's mayor says the Underground will have mobile coverage by the end of 2024 across the entire network, with some popular stations by the end of 2022", "transed": 1, "url": "https://www.theverge.com/2021/6/22/22544890/london-underground-tube-2024-4g-5g-mobile-signal?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["市长", "popular", "移动"]}, {"category": "", "categoryclass": "", "imagename": "080e3b0db1f05ffd1aed9f27aaae1e92.png", "infoid": 1067396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加入留下1,319,727名读者一个张贴您接受的意见可能会有缺陷，以努力了解解决问题的其他观点。 输入令人谈话的心态，而不是辩论。 更多详情  解释您的视图后面的推理，而不仅仅是该视图的（需要500多个字符）。 ▾  注意：如果您的视图是关于A＆＃34;双标准和＃34;，请参阅此处的指导方针。 [ 更多的]  您必须亲自持有视图并证明您对其变化开放.▾  不能代表他人制作的职位，用于玩魔鬼和＃39; S倡导者，作为自己以外的任何实体，或者＆＃34; SOAPBOX＆＃34; 通过重新制作账户的帖子必须通过Modmail批准。 [ 更多的]  提交标题必须充分总结您的视图并包含＆＃34; CMV：＆＃34; 在开始。 ▾  帖子无法表达中立立场，建议对特定人员造成伤害，自我促销，或讨论这种潜水员（访问R / IDEESFORCMV）。 ▾ \n根据人气或感知的攻击性，没有从CMV禁止视野，但出于实际原因，不允许上述类型的帖子。 [ 更多的]  只有帖子，如果您愿意与那些回复您的人进行对话，并且可以在发布3小时内开始这样做。 ▾  对CMV职位的直接响应必须挑战OP的说明视图（但是未成年人）的至少一个方面，或者提出澄清问题。 ▾  有利于视图OP的论据愿意改变必须仅限于对其他评论答复。 [ 更多的]  即使它的其余部分是坚实的，您的评论也会被删除。 ＆＃39;他们开始它＆＃39; 不是借口。 您应该报告，而不是报复。 [ 更多的]  避免指责OP或其他任何人不愿意改变他们的观点，或者以恶意争吵。 ▾  如果您不确定某人是否是真实的，请询问澄清问题（见：Socratic方法）。 如果您认为他们仍然表现出可怜的行为，请致电我们。 [ 更多的] \n如果您颁发了一个三角洲，请颁发＆＃39; ve承认您的观点的变化。不要为任何其他目的使用Deltas。 ▾\n 您必须包含与Delta更改的解释，所以我们知道它＆＃39; s真正的。三角洲虐待包括讽刺的Deltas，笑话Δ，超级升空Δ等[更多]\n 只有链接，笑话，或＆＃34的评论;书面上升＆＃34;将被删除。幽默和对协议的肯定可以包含在更实质性的评论中。 [ 更多的]\n  无论你＆＃39;再在OP与否，请回复到您的评论与增量更改您的视图在任何程度（下文说明）的用户（一个或多个），并且还包括变化的解释。完整的细节。\n   / U / Deltabot将维护用户Flair中的Delta计数，为每个用户的Wiki页面＆＃39; s delta历史记录，记录deltas in / r / deltalog，以及在必要时更新deltaboards。\n       在星期五，帖子可以＆＃39; t与过去一个月的任何其他人都非常相似，并在新队列中赢得了＆＃39;在新的队列中出现，直到他们被主持人检查并批准了。 FTF是一种试图减少主题疲劳。\n     任何原则上的任何帖子都是在过去24小时内发布的帖子，将被删除以减少主题疲劳。 \n我们已经编制了许多有用的信息，例如对我们的规则，CMV礼仪，档案，CMV的研究论文的完整解释，以及关于我们维基削弱的一些更多的一般信息。  对于对我们如何进行调度这一欺骗文件感兴趣的人，我们在我们的Mod标准页面上提供了我们的方法。 ", "note_en": "join leave  1,319,727  readers  A place to post an opinion you accept may be flawed, in an effort to understand other perspectives on the issue. Enter with a mindset for conversation, not debate.   More Detail\n  Explain the  reasoning behind your view, not just what that view is (500+  characters required). ▾\n Note: if your view is about a &#34;double standard&#34;, please see the  guidelines here. [ More]\n You must personally hold the view and demonstrate that you are open to it changing.▾\n A post cannot be made on behalf of others, for playing devil&#39;s advocate, as any entity other than yourself, or to &#34;soapbox&#34;. Posts by throwaway accounts must be approved through  modmail. [ More]\n Submission titles must adequately sum up your view and include &#34;CMV:&#34; at the beginning. ▾\n Posts cannot express a neutral stance, suggest harm against a specific person, be self-promotional, or discuss this subreddit (visit  r/ideasforcmv instead). ▾\n No view is banned from CMV based on popularity or perceived offensiveness, but the above types of post are disallowed for practical reasons. [ More]\n Only post if you are willing to have a conversation with those who reply to you, and are available to  start doing so  within 3 hours of posting. ▾\n  Direct responses to a CMV post must challenge at least one aspect of OP’s stated view (however minor), or ask a clarifying question. ▾\n Arguments in favor of the view OP is willing to change must be restricted to replies to other comments. [ More]\n Your comment will be removed even if the rest of it is solid. &#39;They started it&#39; is not an excuse. You should report, not retaliate. [ More]\n Refrain from accusing OP or anyone else of being unwilling to change their view, or of arguing in bad faith. ▾\n If you are unsure whether someone is genuine, ask clarifying questions (see:  socratic method). If you think they are still exhibiting poor behaviour, please  message us. [ More]\n Award a  delta if you&#39;ve acknowledged a change in your view. Do not use deltas for any other purpose. ▾\n You must include an explanation of the change along with the delta so we know it&#39;s genuine. Delta abuse includes sarcastic deltas, joke deltas, super-upvote deltas, etc. [ More]\n Comments that are only links, jokes, or &#34;written upvotes&#34; will be removed. Humor and affirmations of agreement can be contained within more substantial comments. [ More]\n  Whether you&#39;re the OP or not, please reply to the user(s) that change your view to  any degree with a delta in your comment (instructions below), and also include an explanation of the change.   Full details.\n   /u/DeltaBot will maintain delta counts in user flair, wiki pages for each user&#39;s delta history, record deltas in  /r/DeltaLog, and update  deltaboards where necessary.\n       On Fridays, posts can&#39;t be highly similar to any other in the past month, and won&#39;t show up in the new queue until they&#39;ve been checked and approved by a moderator. FTF is an attempt to reduce topic fatigue.\n     Any post that is  identical in principle to a post made in the last 24 hours will be removed to reduce topic fatigue.\n   We have compiled lots of useful information such as full explanations of our rules, CMV etiquette, archives, research papers on CMV, and some more general information about the subreddit   in our wiki.\n For anyone interested in how we moderate this subreddit, we have our approach laid out over at our   mod standards page.", "posttime": "2021-06-22 16:44:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科技,tech,视图", "title": "CMV：科技垄断应该被禁止为班级 ", "title_en": "CMV: Tech monopolies should be banned as a class", "transed": 1, "url": "https://old.reddit.com/r/changemyview/comments/o5g0wq/cmv_tech_monopolies_should_be_banned_as_a_class/", "via": "", "real_tags": ["科技", "tech", "视图"]}, {"category": "", "categoryclass": "", "imagename": "1884f8fb9738c71dd30e341464e483f9.png", "infoid": 1067394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我丢失了3周的我的生命，试图在英特尔X86-64 / AMD64手册上包装我的头，以尝试为我的爱好者操作4-KBETE页面翻译。这个小博客文章的目的是记录手册中的一些东西并不清楚。 （特别是新人）\n   您已经看到了大约十亿次的照片，如果您正在阅读此帖，您知道您需要在内存中创建这些页面表，以便硬件与操作系统建立一个明确定义的接口，以便在移动到64之前分配小块的小块-bit模式。\n    在引导过程的早期阶段期间，我想要为前10MB内存创建Identity映射页面的图像。在移动到长模式（64位）之前，这将是在内存存储器中加载内核的有用。\n         对我们为什么这样做的解释是由于预期的4-Kbyte PDE条目格式\n    但如果你仔细看，你会发现一些非常奇怪的东西。我们被导致认为页面表基地地址（0x13000）应根据上图的图片在比特51:12之间设置。\n 如果该假设是正确的，则0x13000应左移12位并变为0x13000000。因此，在设置页面标志之后，它将变为0x13000003。这意味着您之前共享的代码片段是错误的，是对的吗？\n 如果你想花3周试图弄清楚你为什么没有启动的时候，那么在质疑你的情况下你的每一职业决定都没有启动 \n思想的火车不是错误的，但X86-64设计有点不同于我们推测的东西。\n 页面数据结构表始终在4-kbyte边界上对齐，因此只有上述位11的地址位存储在翻译表基地址字段中。假设位11：0为0.（取自AMD64手册，第150页）\n 这意味着在实践中是什么，如果我们的页面在地址0x13000上，标志位是0x03 = 0x13003，我们的硬件“重新利用”12位以在当前页面地址添加0x1000时设置标志，它可以到达下一页。如果单独的是单独的，这是难以推测的是Page Tables是4096字节的整个原因（或0x1000😜）\n 问题是，虽然这是在手册中编写的，但没有强调在一个手册中间的稀疏句子，千页😫\n 好吧，我花了很长时间才能达到这个，我相信一天我会忘记我的名字，但不会忘记这场与x86-64分页的战斗。\n 我希望如果有人在努力与我可以减少那个时间的同样的问题，那就花了你来解决这个问题。 ❤️ ", "note_en": "I lost 3 weeks of my life trying to wrap my head around the Intel x86–64/AMD64 manuals to try implementing 4-Kbyte Page translation for my  hobbyist OS. The purpose of this small blog post is to document some of the things that in the manual aren’t clear at all. (especially for newcomers)\n   You have seen that picture a billion times and i  f you are reading this post you know that you need to create these Page Tables in memory so that the hardware establishes a well-defined interface with the OS for allocating small chunks of memory before moving to 64-bit mode.\n    Image that I want to create identity-mapped pages for the first 10MB of memory during the early stages of the boot process. This will be useful for loading the kernel in memory memory before moving to Long mode (64-bit).\n         The explanation to why we do that is due to the expected 4-Kbyte PDE entry format\n    But if you look closely, you will find something very very odd. We are led to believe that the Page-Table Base Address (0x13000) should be set between the bits 51:12 as per the picture above.\n If that assumption is correct, then 0x13000 should be left shifted 12 bits and become 0x13000000. So after the setting the page flags it would become effectively 0x13000003. Which means that the code snippet you shared before is wrong, is that right?\n Think like that if you want to spend 3 weeks trying to figure out why you OS doesn’t boot while questioning every career decision you’ve made in the meantime 😰\n The train of thought isn’t wrong per se, but the x86–64 design works a bit different from what we speculated.\n Page data- structure tables are  always aligned on 4-Kbyte boundaries, so only the  address bits above bit 11 are stored in the translation-table base-address field. Bits 11:0 are assumed to be 0. (Taken from the AMD64 manual, page 150)\n What this means in practice is that if our page is on address 0x13000 and flag bits are 0x03 = 0x13003, our hardware ‘re-utilises’ the 12-bits to set the flags while it knows that if it adds 0x1000 to the current page address, it can get to the next page. It’s hard not to speculate if that alone isn’t the whole reason why page tables are 4096 bytes aligned (or 0x1000 😜)\n The problem is that although this is written in the manual, no emphasis is really given to this sparse sentence in a middle of a manual with thousands of pages 😫\n Well, it took me a long time to get to this and I’m sure that I will forget my name one day but won’t forget this battle with x86–64 paging implementation.\n I hope that if someone is struggling with the same problem that I could have reduced that time it took you to figure this out. ❤️", "posttime": "2021-06-22 16:43:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,page,页面", "title": "x86-64 4kb page翻译设计：这是这个原因为4096字节对齐的原因？ ", "title_en": "x86–64 4Kb Page translation design: is this why pages are 4096 bytes aligned?", "transed": 1, "url": "https://deepdives.medium.com/x86-64-4kbyte-page-translation-design-is-this-the-reason-why-pages-are-4096-bytes-aligned-19952a0a55f4", "via": "", "real_tags": ["设计", "page", "页面"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067393, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在软件工程栈交换中看到了这个问题：防止广泛采用正式方法的障碍是什么？这个问题被关押为基于意见，大部分答案都是“太贵!!!”的东西。或“网站不是飞机!!!”这些都是真的，但不要非常解释。我写了这一点，提供了一个较大的形式方法的历史图片，为什么他们实际上是如此未使用，以及我们正在做的事情让他们使用。\n 在我们开始之前，我们需要放下一些条款。真的不是一个正式的方法社区，这是一个在草原上觅食的几个小乐队。这意味着不同的群体以不同方式使用术语。非常广泛地，FM有两个域：正式规格是研究我们如何编写精确，明确的规格，正式验证是研究如何证明事物是正确的。但“事情”包括代码和抽象系统。我们不仅使用单独的手段来指定这两种东西，我们经常使用不同的手段来验证它们。为了使事情更加令人困惑，如果有人说过正式的规范，他们通常意味着他们都指定和验证系统，如果有人说他们进行正式验证，他们通常意味着它们都意味着它们都指定和验证代码。\n 出于清晰目的，我将验证验证到代码验证（CV）和设计验证（DV），并将规范与CS和DS类似。这些不是更广泛的FM世界中使用的术语。我们首先谈论CS和CV，然后继续到DS和DV。\n 此外，我们可以进行部分验证，我们只验证规范的子集，或完全验证，我们验证整个规范。这可能是证明“它永远不会崩溃或接受错误的密码”或“如果您给出错误的密码三次，它永远不会崩溃或承认错误的密码并锁定帐户。”大多数此历史将假设我们正在进行全面验证。\n 我们还应该澄清我们正式的软件类型。大多数人将软件局面地分为高保证软件，例如医疗设备和飞机，以及其他一切。人们假设正式的方法广​​泛用于前者和后者不必要。这是，如果有的话，太乐观：大多数人在高保证软件中不使用正式方法。我们将重点关注“常规”软件。\n 最后，一位免责声明：我不是历史学家，而我试图做尽职调查，那么这里可能会有错误。此外，我专注于形式规范（DS和DV），因此我对代码验证的任何事情都有可能犯错误。如果你看到错了，请给我发电子邮件，我会修复它。 2\n   在我们证明我们的代码是正确的之前，我们需要知道什么是“正确”。这意味着具有某种形式的规范或规范，用于代码应该做什么，我们可以明确地说明特定输出是否遵循规范。只是说一个列表是“排序”尚不清楚：我们不知道我们正在排序是什么，我们正在使用什么标准，甚至是我们的意思是“排序”。相反，我们可能会说“如果对于任何两个索引I和j，则按升序排序，如果我＆l lt; j，然后l [i]＆lt; l [j]“。 \n第一个是作为独立于代码的语句编写它们。我们会写下我们的排序功能，并在单独的文件中写定理“这返回排序列表”。这是最古老的规范形式，仍然是Isabelle和ACL2做事的方式。 3.\n 第二个嵌入代码中的规格，以前/后置条件，断言和不变性的形式。我们可能会在“返回值是一个排序列表”的函数上添加一个后期位置。基于断言的规格最初是正式的，因为HOARE逻辑，并于20世纪70年代初期首次融入了一个欧几里德的编程语言。 4这种风格也被合同称为设计，是最受欢迎的工业验证形式。 5.\n 最后，我们有型系统。通过Curry-Howard对应，任何数学定理或证据都可以被编码为依赖类型。我们会定义“排序列表”的类型，并声明我们的函数具有类型签名[int]  - ＆gt;排序[int]。\n 您可以看到所有这些样子的示例，让我们证明leftpad。 HOL4和Isabelle是“独立定理”规范，火花和大夫的良好示例，Spark和Dafny具有“嵌入式断言”规格，CoQ和Agda具有“依赖式”规格。 6.\n 如果您眯着眼睛，它看起来像这三种形式的代码规范映射到自动正确性的三个主域名检查：测试，合同和类型。这不是巧合。正确性是频谱，正式验证是该频谱的一个极端。当我们减少我们验证的严格（和努力）时，我们会获得更简单和更窄的检查，无论是否使用较弱的类型限制探索的状态空间，或向运行时推动验证。然后，任何总规格的方法都成为部分规范的手段，反之亦然：许多人认为洁净室是一种正式的验证技术，主要通过推动代码检查远远超出人类可能的代码。\n  验证证明代码与其规范匹配。这提出了一个问题：我们如何知道我们有正确的规格？找到合适的规范是正式方法中最大的挑战之一。它也是最升级的反对意见之一，但怀疑论者的意思是它与倡导者的想法的方式完全相同。\n 当户外人说“你如何有正确的规格？”他们通常在考虑验证：显示一个规格实际上是客户想要的。如果您正式证明您的代码排序列表，但客户实际上希望优步进行汤™，您只浪费了一堆时间。只有通过快速迭代和短的反馈周期，人们争辩，您是否可以验证您的要求。 \n确实，验证代码无法验证代码。但是这个参数有两个问题。首先是它只是延迟了FM的价值，而不是完全消除它。一旦您完成了快速迭代，您可能会想到您的客户想要的内容。然后你开始验证代码。第二，虽然我们不知道究竟是什么客户想要的，但有些事情我们可以假设他们不想要。他们不希望软件随机崩溃。他们不想要安全漏洞。每个人都认识到这一点：毕竟，没有人说你应该在你迭代时跳过单位测试。因此，至少证明您的版本控制系统不会随机删除用户预订的章节。 7.\n 找到正确的规格的问题更为根本：我们经常不知道我们想要的规格是什么。我们考虑了人类的要求，而不是数学术语。如果我说“这应该区分公园的鸟类”，我在说什么？我可以通过给予一堆公园和鸟类的照片来解释一个人，但这只是具体的例子，而不是捕捉从鸟类区分公园的想法。为了实际翻译成正式规格要求我们能够将人类概念形式形式化，这是一个严重的挑战。\n 不要让我错了，有可能弄清楚这里的适当规格，专家一直这样做。但是写作适当的规范是您需要开发的技能，就像您需要开发编码技能一样。这就是为什么许多代码验证的最近成功的成功都是我们想要的明显地图的事情以及我们可以表达我们想要的东西。例如，Compcert是一个正式验证的C编译器。这个规范有“这绝不会误解”。\n 这一切都不是实际的验证部分。有一个规格，您仍然需要证明代码匹配规范。\n  我们看到的最早的代码验证方式是Dijkstra风格的“非常努力地思考为什么这是真实的”方法，这基本上是allol旨在帮助做的。例如，我可能会“证明”插入排序通过争论\n 基本情况：如果我们有一个空列表并将一个元素添加到它，那将是唯一的元素，因此它将被排序。\n 如果我们有一个带有k个元素的排序列表并添加一个元素，我们将插入元素，以便在所有较小的数字之后和所有更大的数字之后。这意味着列表仍然排序。 \n显然，它看起来比这更严格，但这是一般的想法。 Dijkstra等人使用这种风格来证明一堆算法是正确的，包括许多并发原语。这也是一种风格，它引起了Knuth Quote“请注意上面的代码中的错误;我只证明它是正确的，没有尝试过。“在没有人通知的方式搞定数学证明是非常容易的，并且我读到了20％的发布的数学证明的估计，它们有错误。 Peter Guttmann有一个很好的论文，就如何获得了多法代码，如果运行，那么大量的“经过验证的”代码会立即崩溃。\n 同时我们正在探索如何自动证明数学定理，这是1967年出来的第一个此类定期先驱。帕斯卡社区的研究人员正在使用定理普通的普通验证计划于20世纪70年代初期，然后通过中期编程专用验证语言进行编程。十年。人们将写一些代码的属性，然后写一个可选择的证明代码具有这些属性。早些时候定理普查只是帮助人类检查并验证证明，而更复杂的人可以自己证明定理的部分。\n   证据很难。令人讨厌的努力。 “退出编程并加入马戏团”。令人惊讶的是，正式的代码证明往往比大多数数学家写的证据更严格！数学是一个非常有创造性的活动，具有明确的答案，如果您展示您的工作，才能有效。创造力，形式主义和计算机是一个不好的组合。\n 采取上述诱导。任何数学家都可以看出它，立即知道它是什么，它是如何工作的，以及它在这种情况下如何有效。这些都是我们需要严格地形式化的东西。与矛盾的证明相同，通过互相验证等，我们还需要正规化每一个假设，甚至是大多数数学家不烦恼的东西。例如，添加是关联：A +（B + C）=（A + B）+ C.定理箴言并不是先验的真实。您要么必须证明它（硬），声明这是一个假设箴言可以作为真实（危险），或者从已经证明它（昂贵）的人那里购买定理图书馆。早期审查助理竞争内置策略策略和捆绑定理图书馆。首次广泛的校验验证员之一，Spade，将其完整的算术库作为一个关键销售点宣传。\n 接下来，你必须实际上得到证据。您可以让谚语尝试自己找到它，或自己写它。在一般情况下，自动推断出证明是不可识别的。对于极度限制的情况，如命题逻辑或HM Type-Checki，它是“只有”NP-Complete。在大多数情况下，我们都陷入了自己的大部分证据，并让计算机验证它是正确的。这意味着您需要一个强大的背景：\n 您正在使用的定理谚语的复杂性，这是一个专业\n 让事情变得更糟，电脑物业将大量的扳手扔进证明。还记得我如何说假设加法是关联是危险的？某些语言并不关联。 C ++具有INT_MAX。 （（-1）+ int_max）+ 1是INT_MAX。 -1 +（int_max + 1）未定义。如果您假设C ++中的关联添加，您的证明将是错误的，并且您的代码将被打破。您要么必须避免使这种断言，或证明为您的特定代码段，您永远不会造成溢出。 \n现在，您可以说未定义的添加是一个错误，而且您应该使用带有未绑定整数的语言。但大多数语言具有妨碍证明的积极功能。采取以下代码段：\n  这总是真的吗？依靠。也许f修改a。也许另一个线程并发修改a。也许b别传到a，因此修改它也修改了一个。 8如果您的语言中的任何一种，则必须明确证明他们不会发生在这里。在这种情况下，纯度有助于在其他情况下丢失证明，因为它迫使您使用递归和更高阶函数来完成完成的东西。顺便提及，这两者都是编写良好功能计划的基础。对于证明，编码有什么好处！ 9.\n 正式的验证者有困境：这种语言更加表达，它越难以证明它。但语言表现较少，越难以写入它。第一个生产验证语言是更具表现性语言的子集：ACL2是LISP的一个子集，Euclid是帕斯卡的一部分等。到目前为止，我们已经讨论过的东西，实际上是以证明真实世界的计划，这就是只是桌面赌注首先开始写作证明。\n 证据很难。然而，他们一直越来越好。校正助理研究人员继续添加新的启发式，定理库，预取量组件等硬件改进，以及更快的计算机意味着更快的搜索。\n  这些日子最多的人口证明自动化是SMT。 10非常广泛地说，SMT求解器可以将（一些）定理转向约束满足问题。这将创造性问题变成计算一个。您仍然需要将其中间问题（LEMMAS）作为定理中的步骤提供，但这比证明每个该死的事物更好。斯坦福德于1998年发布了第一个“现代”SMT Solver，Stanford有效性检查员。他们建立在2002年发布的CVC，这涉及轻微的生产使用。 11.\n 当Microsoft Research发布Z3时，场景发生在2006年左右。 Z3的大优势是比其他SMT更有用户友好，诚实并不是很多。 MSR在内部使用它来帮助证明Windows内核的属性，这意味着它们在UX中投入了更多比较最小的。 Z3可以说是全面的默认选择进行通用自动化证明。 CV中的许多工具现在依赖于SMT，并且默认情况下，大多数Z3都有Z3。\n 无障碍的SMT解决是裤子到正式验证社区的踢脚，因为它使得很多简单的证据琐碎和令人讨厌的证据。反过来，这意味着人们可以以更快递的语言开始证明东西，因为他们现在有能力解决表达式陈述的挑战。 Ironfleet项目中可以看到以下令人难以置信的进展：通过使用先进的SMT求解器和尖端验证语言，微软只能在3.7人中编写5,000行验证的DAFNY代码！这是一天四整行的炽热速度。 12. \n现在将是一个好时刻退后一步并问“什么是点？”我们试图证明一些程序符合某些规范。正确性是一个频谱。验证问题有两部分问题：如何客观地“正确”您的程序是，以及您严格验证了正确性。显然，更多的验证优于验证的更低，但验证成本时间和金钱。如果我们有多种约束来优化（性能，时间，成本等），则最优惠不一定是“完全证明正确”。那么问题变成了“我们需要的最小验证是什么”和“到达那里的成本是多少。”在大多数情况下，您可以逃避，如90％或95％或99％正确。你可能会更好地花时间让UX更好地获得最后1％的正确性。\n 问题，那么：“是90/95/99％正确比100％正确便宜？”答案是非常的。我们都很乐意地说，我们经过良好测试和良好类型的代码库大多是正确的Modulo在Prod中的一些修复，我们甚至一天写了四行的代码。事实上，通过略微全面的测试可以防止绝大多数分布式系统中断。这只是更全面的单元测试，无论如说都没有模糊，基于物业的测试或模型测试。您可以非常遥远，并且在不需要进行全面证明的情况下更简单的技巧。\n 如果类型的遗嘱没有让你验证怎么办？比99％到100％的90％〜99％更容易得多。如前所述，洁净室是涉及全面文档，仔细流量分析和广泛的代码审查的开发人员实践。没有证据，没有正式验证，甚至没有任何单位测试。但正常完成，洁净室在生产中将缺陷密度降低至少于1个错误/ kloc。 13个使用它的团队具有比不使用它的团队相同或更短的交货时间 - 一天肯定超过4行。洁净室本身只是坐在主流软件实践和代码验证之间的许多高保证技术之一。您不需要完整的代码验证来编写良好的软件甚至写入近乎完美的软件。有必要的情况，但对于大多数行业而言，这是浪费金钱。\n 但是，这并不意味着整体的正式方法是不经济的。许多上述高保证技术依赖于写作代码规范，您不正式证明。至于验证，有两种常见的方式在行业中受益。首先是验证设计而不是代码，我们将在下一节中介绍。第二个是部分代码验证，我们现在将覆盖。\n  在日常编程中进行全面验证真的太贵了。部分验证怎么样？我仍然可以从证明我的代码的某些部分的一些属性。而不是证明我的排序函数总是排序，而是至少证明它不会永远循环，而且从未写出过界。你仍然可以得到很多好处。例如，甚至写作关于C程序的基本证明是减少大量未定义行为的重要方法。\n 这里的限制是可用性的。大多数语言都设计用于完全验证或无验证。在前一个案例中，你以更具表现力的语言缺少了很多好的功能，在后一种情况下，你需要一种方法来证明在概念上的语言中的东西。因此，大多数关于部分验证的研究侧重于几种高优先级语言，如C和Java。您还看到很多人使用受限制的语言子集。例如，Spark是ADA的受限子集，因此您可以在Spark中编写关键的内容，并将其与较少关键的ADA代码互操作。但是大多数语言都是漂亮的利基。\n 更常见的是，人们将特定类型的验证纳入语言的核心结构。生产类型系统是一种常见形式：你可能不知道尾巴总是返回尾巴，但至少你知道它有[a]  - ＆gt; [一种]。您还有像Rust这样的案例，证明了内存安全和小马，证明了异常安全。这些与Spark和Frama-C略有不同，因为您只能进行部分验证，而不是一些部分和一些完整的验证。他们还倾向于通过编程语言专家通过正式的方法专家，两条学科有很多重叠但不相同。这可能是为什么Rust和Haskell这样的语言实际上是可用的。 \n到目前为止，我们只讨论了代码验证。 不过，正式方法还有另一面，这是一步一步抽象，并验证设计本身。 这足以让它与正式规范的代名词：如果有人说他们做正式规范，他们可能意味着他们指定和验证设计。  正如我们所谈论的，证明每一行代码是真实的  ...... ", "note_en": "I saw  this question on the Software Engineering Stack Exchange:  What are the barriers that prevent widespread adoption of formal methods? The question was closed as opinion-based, and most of the answers were things like “its too expensive!!!” or “website isn’t airplane!!!” These are sorta kinda true but don’t explain very much. I wrote this to provide a larger historical picture of formal methods, why they’re actually so unused, and what we’re doing to make them used.\n Before we begin, we need to lay down some terms. There really isn’t a formal methods community so much as a few tiny bands foraging in the Steppe.  This means different groups use terms in different ways. Very broadly, there are two domains in FM:  formal specification is the study of how we write precise, unambiguous specifications, and  formal verification is the study of how we prove things are correct. But “things” includes both code and abstract systems. Not only do we use separate means of specifying both things, we often use different means to verify them, too. To make things even more confusing, if somebody says they do formal specification, they  usually mean they both specify and verify systems, and if somebody says they do formal verification, they  usually mean mean they both specify and verify code.\n For clarity purposes, I will divide verification into  code verification (CV) and  design verification (DV), and similarly divide specification into CS and DS. These are not terms used in the wider FM world. We’ll start by talking about CS and CV, then move on to DS and DV.\n Additionally, we can do  partial verification, where we only verify a subset of the spec, or  full verification, where we verify the entire spec. This could be the difference between proving “it never crashes or accepts the wrong password” or “it never crashes or admits the wrong password and locks the account if you give the wrong password three times.” Most of this history will assume we’re doing full verification.\n We should also clarify the type of software we’re formalizing. Most people implicitly divide software into  high-assurance software, such as medical devices and aircraft, and everything else. People assume that formal methods are widely used in the former and unnecessary for the latter. This, if anything, is too  optimistic: most people in high-assurance software don’t use formal methods. We’ll focus instead on “regular” software.\n Finally, a disclaimer: I am not a historian, and while I tried to do my due diligence there are probably mistakes here. Also, I specialize in formal specification (DS and DV), so there are more likely to be mistakes in anything I say about code verification. If you see something wrong, email me and I’ll fix it.  2\n   Before we prove our code is correct, we need to know what is “correct”. This means having some form of  specification, or spec, for what the code should do, one where we can unambiguously say whether a specific output follows the spec. Just saying a list is “sorted” is unclear: we don’t know what we’re sorting, what criteria we’re using, or even what we mean by “sort”. Instead, we might say “A list of integers  l is  sorted in ascending order if for any two indices i and j, if  i &lt; j, then  l[i] &lt;=  l[j]”.\n  The first is writing them as statements independent of the code. We would write our sort function, and in a separate file write the theorem “this returns sorted lists”. This is the oldest form of spec and is still the way Isabelle and ACL2 do things.  3\n The second embeds specs in the code in the form of pre/postconditions, assertions, and invariants. We might add a postcondition on the function that “the return value is a sorted list”. Assertion-based specs were originally formalized as   Hoare Logic and were first integrated into a programming language with  Euclid in the early 1970s.  4 This style is also called  Design by Contract and is the most popular form of industrial verification.  5\n Finally, we have type systems. By  Curry-Howard correspondence, any math theorem or proof can be encoded as a dependent type. We’d define the type of “sorted lists” and declare our function has the type signature  [Int] -&gt; Sorted [Int].\n You can see examples of how all of these look at  Let’s Prove Leftpad. HOL4 and Isabelle are good examples of “independent theorem” specs, SPARK and Dafny have “embedded assertion” specs, and Coq and Agda have “dependent type” specs.  6\n If you squint a bit it looks like these three forms of code spec map to the three main domains of automated correctness checking: tests,  contracts, and types. This is not a coincidence. Correctness is a spectrum, and formal verification is one extreme of that spectrum. As we reduce the rigour (and effort) of our verification we get simpler and narrower checks, whether that means limiting the explored state space, using weaker types, or pushing verification to the runtime. Any means of total specification then becomes a means of partial specification, and vice versa: many consider   Cleanroom a formal verification technique, which primarily works by pushing code review far beyond what’s humanly possible.\n  Verification proves code matches its spec. This raises a question: how do we know we have the right spec? Finding the right spec is one of the biggest challenges in formal methods. It’s also one of the most raised objections, but the way skeptics mean it isn’t  exactly the same as the way advocates think of it.\n When outsiders say “how do you have the right spec?” they’re  usually thinking of  validation: showing a spec actually does what the client wants. If you formally prove your code sorts a list, but the customer actually wants Uber For Soups ™, you’ve just wasted a bunch of time. Only by rapid iteration and short feedback cycles, people argue, can you actually validate your requirements.\n It is true that verifying code does not validate the code. There are two problems with this argument, though. The first is that it just delays the value of FM, not eliminate it entirely. Once you’ve done your rapid iterations, you presumably have an idea of what your customer wants.  Then you start verifying code. Second, while we don’t know what exactly the customer wants, there are some things we can assume they  don’t want. They don’t want the software randomly crashing on them. They don’t want security holes. Everybody recognizes the importance of this: after all, nobody is saying you should skip unit tests while you iterate. So, at the very least, prove your version control system doesn’t randomly delete chapters of a user’s book.  7\n The problem with finding the right spec is more fundamental:  we often don’t know what we want the spec to be. We think of our requirements in human terms, not mathematical terms. If I say “this should distinguish parks from birds”, what am I  saying? I could explain to a human by giving a bunch of pictures of parks and birds, but that’s just specific examples, not capturing the  idea of distinguishing parks from birds. To actually translate that to a formal spec requires us to be able to formalize human concepts, and that is a serious challenge.\n Don’t get me wrong, it’s possible to figure out the appropriate specs here and experts do it all of the time. But writing appropriate specs is a skill you need to develop, just as you needed to develop coding skills. This is why a lot of the more recent successes with code verification have been things with an obvious map between what we want and what we can express we want. For example,  CompCert is a formally verified C compiler. The spec there is “this will never miscompile”.\n And none of this is the actual verification part. Once you  have a spec, you still need to prove the code  matches the spec.\n  The earliest means of code verification we see is the the Dijkstra-style “think really hard about why it’s true” method, which is basically what ALGOL was designed to help do. For example, I might “prove” an insertion sort works by arguing\n Base Case: if we have an empty list and add one element to it, that will be the only element, so it will be sorted.\n If we have a sorted list with  k elements and add one element, we insert the element so that it is after all smaller numbers and before all larger numbers. This means the list is still sorted.\n Obviously it’d look more rigorous than that, but that’s the general idea. Dijkstra and others used this style to prove a bunch of algorithms were correct, including many concurrency primitives. It’s also the style that gives rise to the  Knuth quote “Beware of bugs in the above code; I have only proved it correct, not tried it.” It’s pretty easy to screw up a math proof in a way nobody notices, and I’ve read  estimates that something like 20% of published math proofs have errors in them.  Peter Guttmann has a great essay on how farcical code proofs got, where tons of “proven” code would immediately crash if run.\n At the same time we were exploring how to automatically prove mathematical theorems, the first such  theorem prover coming out in  1967. Researchers in the Pascal community were using theorem provers to verify programs by the  early 1970s, then programming in dedicated verification languages by mid-decade. People would write some properties of the code and then write a checkable proof that the code had those properties. Earlier theorem provers simply helped humans check and verify proofs while more sophisticated ones could prove parts of the theorem on their own.\n   Proofs are hard. Obnoxiously hard. “Quit programming and join the circus” hard. Surprisingly, formal code proofs are often  more rigorous than the proofs most mathematicians write! Mathematics is a very creative activity with a definite answer that’s only valid if you show your work. Creativity, formalism, and computers are a bad combination.\n Take the above induction. Any mathematician could look at that and immediately know what induction is, how it works, and how it’s valid in this case. These are all things we need to rigorously formalize in the theorem prover. Same with proof by contradiction, proof by contrapositive, etc. Along with this, we also need to formalize every assumption, even the stuff that most mathematicians don’t bother to prove. For example, addition is associative:  a + (b + c) = (a + b) + c. The theorem prover doesn’t a priori know that’s true. You either have to prove it (hard), declare it an assumption the prover can take as true (dangerous), or buy a theorem library from someone who already proved it (expensive). Early proof assistants competed on the number of inbuilt proof tactics and bundled theorem libraries. One of the first widespread proof checkers, SPADE, advertised its complete arithmetic library as a key selling point.\n Next, you gotta actually get the proof. You can have the prover try to find it on its own, or write it yourself. In the general case, automatically infering a proof is undecidable. For extremely restricted cases, like propositional logic or HM type-checking, it’s “only” NP-complete. For the most part we’re stuck writing most of the proof ourselves and having the computer verify it’s correct. That means you need a strong background in:\n The intricacies of the theorem prover you’re using, which is a specialty unto itself\n To make things worse, computer properties throw a lot of wrenches into proofs. Remember how I said assuming addition was associative is dangerous? Some languages aren’t associative. C++ has  INT_MAX.  ((-1) + INT_MAX) + 1 is  INT_MAX.  -1 + (INT_MAX + 1) is undefined. If you assume associative addition in C++, your proof will be wrong, and your code will be broken. You either have to avoid making that assertion, or prove that for your specific snippet, you never cause an overflow.\n Now you could say that undefined addition is a bug, and you should be using a language with unbound integers. But most languages have positive features that impede proofs. Take the following snippet:\n  Is that always true? Depends. Maybe  f modifies  a. Maybe another thread concurrency modifies  a. Maybe  b is aliased to  a, so modifying it also modifies  a.  8 If any of these are possible in your language, you have to explicitly prove they don’t happen here. Purity helps in this case but can wreck proofs in other cases, as it forces you to use recursion and higher-order functions to get stuff done. Both of those, incidentally, are foundational to writing good functional programs. What’s good for coding is bad for proving!  9\n Formal verifiers have a dilemma: the more expressive the language, the harder it is to prove anything in it. But the less expressive the language, the harder it is to  write anything in it. The first production verification languages were very restricted subsets of more expressive languages: ACL2 was a subset of Lisp, Euclid was a subset of Pascal, etc. And nothing we’ve discussed so far gets into actually proving real-world programs, this is all just the table stakes to start writing proofs in the first place.\n Proofs are hard. They have, however, been getting better. Proof assistant researchers keep adding new heuristics, theorem libraries, preverified components, etc. Hardware improvements help, too: faster computers means faster searches.\n  These days the most population approach to proof automation is  SMT.  10 Speaking very broadly, an SMT solver can turn (some) theorems into constraint satisfaction problems. This turns a creative problem into a computational one. You may still need to feed it intermediate problems (lemmas) as steps in your theorem, but that’s better than proving every damn thing yourself. Stanford released the first “modern” SMT solver, the  Stanford Validity Checker, in 1998. They built on that to make CVC, released in 2002, which saw minor production use.   11\n The scene changed around 2006, when Microsoft Research released Z3. The big advantage of Z3 was it was a lot more user-friendly than other SMTs, which honestly wasn’t saying much. MSR used it internally to help prove properties of the Windows kernel, meaning they invested more-than-the-bare-minimum in UX. Z3 arguably made SMT the default choice for general-purpose automated proving. Many tools in CV now rely on SMT, and most of those come with Z3 by default.\n Accessible SMT solving was a kick in the pants to the formal verification community, as it makes a lot of simple proofs trivial and nasty proofs tractable. This, in turn, meant people could start proving things in more expressive languages, as they now had the power to tackle the challenges of expressive statements. The incredible progress here is evident in the  IronFleet project: by using advanced SMT solvers and a cutting-edge verification language, Microsoft was able to write 5,000 lines of verified Dafny code in only 3.7 person-years! That’s a blazing-fast rate of  four whole lines a day.   12\n   Now would be a good time to step back and ask “what’s the point?” We’re trying to prove some program conforms to some spec. Correctness is a spectrum. There are two parts of the verification question: how objectively “correct” your program is, and how much you’ve rigorously verified the correctness. Obviously, more verified is better than less verified, but verification costs time and money. If we have multiple constraints to optimize (performance, time to market, cost, etc), the optimium isn’t necessarily “fully proved correct”. Then the question becomes “what’s the minimal verification we need” and “how much does it cost to get there.” In  most cases you can get away with, like, 90% or 95% or 99% correct. You may be better off spending time making the UX better than getting that last 1% of correctness.\n The question, then: “is 90/95/99% correct significantly cheaper than 100% correct?” The answer is very yes. We all are comfortable saying that a codebase we’ve well-tested and well-typed is  mostly correct modulo a few fixes in prod, and we’re even writing more than four lines of code a day. In fact,  the vast majority of distributed systems outages could have been prevented by slightly-more-comprehensive testing. And that’s just more comprehensive unit testing, to say nothing of fuzzing, property-based testing, or model-testing. You can get really far with simpler tricks without needing to go on to full proofs.\n What if types’n’tests isn’t getting you enough verification? It’s still much easier to go from 90% to 99% than from 99% to 100%. As mentioned earlier, Cleanroom is a developer practice involving comprehensive documentation, careful flow analysis, and extensive code review. No proofs, no formal verification, not even any unit testing. But done properly, Cleanroom reduces the defect density to less than 1 bug/kLoC in production.  13 Teams using it have equal or shorter delivery times than teams that don’t use it- certainly better than 4 lines a day. And Cleanroom itself is just one of many high-assurance techniques that sit between mainstream software practices and code verification. You do not need full code verification to write good software or even to write near-perfect software. There are cases where it’s necessary, but for most of the industry it’s a waste of money.\n However, that does not mean formal methods as a whole is uneconomical. Many aforementioned high-assurance techniques rely on writing code specs that you don’t formally prove. As for verification, there are two common ways people benefit from it in the industry. The first is verifying designs instead of code, which we will cover in the next section. The second is  partial code verification, which we will cover right now.\n  It’s too expensive doing full verification in day-to-day programming. What about partial verification? I could still benefit from proving some properties of some parts of my code. Instead of proving that my sort function always sorts, I can at least prove it doesn’t loop forever and never writes out of bounds. You can still get a lot of benefit out of this. For example, writing even basic proofs about C programs is a great way to  cut out huge amounts of undefined behavior.\n The limitation here is  availability. Most languages are designed for either full verification or no verification. In the former case, you’re missing a lot of nice features in more expressive languages, and in the latter case you a need a way to prove stuff in a language hostile to the concept. For this reason, most of the research on partial verification focuses on a few high-priority languages, like  C and Java. You also see a lot of people working with restricted subsets of languages. For example, SPARK is a restricted subset of Ada, so you can write critical stuff in SPARK and have it interop with less-critical Ada code. But most languages like that are pretty niche.\n More commonly, people bake specific kinds of verification into the the core structure of languages. Production type systems are a common form of this: you may not know that  tail always returns the tail, but at  least you know that it has type  [a] -&gt; [a]. You also have cases like Rust, which proves memory safety, and Pony, which proves exception safety. These are slightly different from SPARK and Frama-C in that you can  only do partial verification, not some partial and some full verification. They also tend to be made by programming language experts over formal methods experts, two disciplines that have a lot of overlap but aren’t identical. This might be why languages like Rust and Haskell are actually-kinda-usable in practice.\n  So far we’ve only talked about code verification. There’s another side to formal methods, though, which is going one step more abstract and verifying the designs themselves. This is deep enough that it’s synonymous with  formal specification: if somebody says they do formal specification, they probably mean they specify and verify designs.\n As we talked about, proving every line of code is real\n......", "posttime": "2021-06-22 16:43:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "people,验证", "title": "人们为什么不使用正式方法？ -  2019年 ", "title_en": "Why Don't People Use Formal Methods? – 2019", "transed": 1, "url": "https://www.hillelwayne.com/post/why-dont-people-use-formal-methods/", "via": "", "real_tags": ["people", "验证"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳跃以搜索猪肉综合症是猪肉的过敏，通常在青春期后，这是由暴露在猫引起的。虽然1994年首次描述，但[1] [2] [3]首先在美国斯科特委员会和托马斯普拉斯厂在alpha-gal过敏的研究期间首次记录在美国。 [4]\n 它被称为＃34;猪肉综合症＆＃34;因为＆＃34;几乎所有条件的人都是猫主人，许多人都有多只猫。一些对猫血清白蛋白（猫肝脏蛋白质制成的蛋白质）产生过敏反应，当有人消耗它时，在猪肉中与白蛋白交叉反应，并且当猪肉消耗时可能导致严重甚至致命的过敏反应。＆＃34; [4]\n  ^ abreu，卡尔莫;戈麦斯，拉奎尔; Bartolome Borja，Bial-Arístegui;弗拉纳，海伦娜; Cunha，Leonor（2015年3月30日）。 ＆＃34;猪肉综合症？＆＃34;。临床翻译过敏。 5（3）：P164。 DOI：10.1186 / 2045-7022-5-S3-P164。 PMC 4412402。\n  ^ posthumus，乔纳森;詹姆斯，海莉·巷，查尔斯j;马托斯，路易斯;普拉斯厂，托马斯A e; Commins，Scott P（2017年3月24日）。 ＆＃34;美国猪肉综合症的初始描述。 j alerergy inlmunol。 131（3）：923-925。 DOI：10.1016 / J.Jaci.2012.12.665。 PMC 3594363.PMID 23352634。 ", "note_en": "Jump to navigation  Jump to search  Pork–cat syndrome is an  allergy to  pork, usually after  adolescence, that is caused by exposure to  cats. Although first described in 1994,  [1]  [2]  [3] it was first documented in the U.S. by Scott Commins and  Thomas Platts-Mills during their research on  alpha-gal allergy.  [4]\n It is called &#34;pork–cat syndrome&#34; because &#34;almost all people with the condition are cat owners, and many have multiple cats. Some develop an allergic response to cat  serum albumin (protein made by a cat’s  liver) that cross-reacts with albumin in pork when someone consumes it, and can lead to severe or even fatal allergic reactions when pork is consumed.&#34;  [4]\n  ^   Abreu, Carmo; Gomes, Raquel; Bartolome Borja, Bial-Arístegui; Falcão, Helena; Cunha, Leonor (30 March 2015).  &#34;Pork-cat syndrome?&#34;.  Clin Transl Allergy.  5 (Suppl 3): P164.  doi: 10.1186/2045-7022-5-S3-P164.  PMC   4412402.\n  ^    Posthumus, Jonathon; James, Hayley R; Lane, Charles J; Matos, Luis A; Platts-Mills, Thomas A E; Commins, Scott P (24 March 2017).  &#34;Initial Description of Pork-Cat Syndrome in the United States&#34;.  J Allergy Clin Immunol.  131 (3): 923–925.  doi: 10.1016/j.jaci.2012.12.665.  PMC   3594363.  PMID  23352634.", "posttime": "2021-06-22 16:42:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "猪肉,cat", "title": "猪肉综合症 ", "title_en": "Pork-Cat Syndrome", "transed": 1, "url": "https://en.wikipedia.org/wiki/Pork%E2%80%93cat_syndrome", "via": "", "real_tags": ["猪肉", "cat"]}, {"category": "", "categoryclass": "", "imagename": "08bf2195efba9e9b0f57154145ce93e9.jpg", "infoid": 1067391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "悉尼：Starlink，Elon Musk的卫星互联网单元和＃39; S Spacex，预计将能够在九月左右提供持续的全球覆盖，但随后需要寻求监管审批，其总统Gwynne Shotwel周二表示。\n ＆＃34;我们成功部署了1,800岁左右的卫星，并一旦所有这些卫星到达他们的运营轨道，我们将具有持续的全球覆盖范围，因此应该像9月的时间范围一样，＆＃34;她通过网络广播告诉了麦古维集团技术会议。\n     ＆＃34;但随后我们有监管工作进入每个国家并获得批准提供电信服务。＆＃34;\n Shotwel表示，Starlink计划计划部署12,000颗卫星，总计约为100亿美元的费用，目前在11个国家提供Beta服务。\n 5月，Musk表示，低地轨道卫星网络已收到超过500,000人的互联网服务预订，并预计不会满足需求的技术问题。\n 今年美国联邦通信委员会批准了Spacex＆＃39;计划在较低地球轨道上部署一些Starlink卫星，而不是计划为目前缺乏访问的人提供高速宽带互联网服务。\n     Starlink是越来越多的小卫星制造商之一，也包括亚马逊，英国＆＃39; S Oneweb，Venture资本支持的星球和雷神技术公司的蓝峡谷技术。 \n来源：路透社 ", "note_en": "SYDNEY: Starlink, the satellite internet unit of Elon Musk&#39;s SpaceX, expects to be able to provide continuous global coverage by around September but will then need to seek regulatory approvals, its president Gwynne Shotwel said on Tuesday.\n &#34;We&#39;ve successfully deployed 1,800 or so satellites and once all those satellites reach their operational orbit, we will have continuous global coverage, so that should be like September timeframe,&#34; she told a Macquarie Group technology conference via webcast.\n     &#34;But then we have regulatory work to go into every country and get approved to provide telecoms services.&#34;\n Starlink, which has said it plans to deploy 12,000 satellites in total at a cost of roughly US$10 billion, currently offers beta services in 11 countries, Shotwel said.\n In May, Musk said the low-Earth orbiting satellite network had received more than 500,000 preorders for its internet service and anticipates no technical problems meeting demand.\n The U.S. Federal Communications Commission this year approved SpaceX&#39;s plan to deploy some Starlink satellites at a lower earth orbit than planned to provide high-speed broadband internet services to people who currently lack access.\n     Starlink is one of a growing number of makers of small satellites that also includes Amazon.com&#39;s Kuiper, Britain&#39;s OneWeb, venture capital-backed Planet, and Raytheon Technologies Corp&#39;s Blue Canyon Technologies.\n  Source: Reuters", "posttime": "2021-06-22 16:42:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "starlink,技术", "title": "Spacex的Starlink期望它可以在9月左右提供全球覆盖范围 ", "title_en": "SpaceX's Starlink expects it can provide global coverage around September", "transed": 1, "url": "https://www.channelnewsasia.com/news/business/spacex-s-starlink-expects-it-can-provide-global-coverage-around-september-15066036", "via": "", "real_tags": ["starlink", "技术"]}]