[{"category": "", "categoryclass": "", "imagename": "d47cb7b597169dca9ce96cc8f073246e.jpeg", "infoid": 1015558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家法院发布了一项最终裁决，驳回了粉丝融资平台Patreon要求对喜剧演员欧文·本杰明(Owen Benjamin)的72名前支持者发出禁令的请求，这些支持者正在寻求仲裁，指控该公司扰乱了他们与本杰明之间的经济关系。\n在最终裁决之前，本月早些时候做出了一项对Patreon不利的暂定裁决，这意味着该公司现在必须在发票上的到期日起30天内，为72项个人仲裁索赔预付申请费。每次仲裁的费用可能高达1万美元。\n当仲裁开始时，Patreon还必须支付进一步的法律费用，并有滚动义务在30天内支付这些费用。律师、评论员和制片人迈克·切尔诺维奇(Mike Cernovich)预测，这些费用可能高达2000万美元。\n在最终裁决中，法院列举了三个理由拒绝帕特隆的禁制令请求。\n首先，法院写道，如果Patreon没有获得禁制令，它“未能证明它将遭受任何不可弥补的伤害或临时伤害”，并指出“仅仅为了参与仲裁程序而不得不招致费用并不是不可弥补的伤害”。\n其次，法院写道，“Patreon未能显示出合理的胜诉可能性”，并补充说，即使这些索赔“不可仲裁”，“这些问题也应该由仲裁员来决定，而不是由法院来决定。”\n第三，法院写道，“加州法院很少给予帕特雷恩在这里寻求的特殊救济”，并指出，一旦争议提交仲裁，“(加州仲裁法)”考虑的是有限的司法参与(如果有的话)。法院补充说，“通常情况下，那些签订仲裁协议的人希望，他们的争端将在不需要与法院进行任何接触的情况下得到解决”，“这一结论‘尤其正确’，就像这里一样，仲裁开始时不需要寻求法院命令强制仲裁。”\n这项裁决不仅意味着Patreon必须支付这些可能的巨额费用，而且根据这项加州仲裁法，这项裁决还给了用户一个合法的途径来对抗审查制度。\n根据该法，雇佣或消费者仲裁协议的起草方必须支付仲裁费，无论结果如何，都不能收回仲裁费用。这意味着，像Patreon这样通过服务条款强制仲裁的公司，当他们禁止用户时，可能会冒着巨额仲裁费的风险，因为这些用户的前支持者可以就“侵权干预”(扰乱创建者与其支持者之间的经济关系)寻求仲裁。\n对于那些在被禁止时拥有数百或数千支持者的去平台用户来说，这可能会让这些公司承担数百万美元的仲裁费。\n律师尼克·雷基塔(Nick Rekieta)表示，这起案件可能会给那些将用户平台去掉的大型科技公司敲响警钟：\n“这是一个极其重要的案件，刚刚发生的事情对大型科技公司来说是一剂强心针。你的服务条款对你有约束力，至少就这些仲裁和反集体诉讼条款而言，我们可以用它们来对付他们。\n这很重要，因为这是我们如何保护自己免受脱平台、取消文化等事情的影响，这是这一领域的一大胜利。\n即使他们(本杰明以前的支持者)最终在仲裁中败诉，威胁要将某人从平台上移除，并面临数以千计、甚至可能数以千计的仲裁索赔，这至少应该会让他们犹豫不决。\nCernovich补充说，在这个具体的案例中，由于Patreon在本杰明的前支持者发出通知后改变了服务条款，它也可能面临仲裁，因为它单方面改变了服务条款，“这种方式在加州法律下是非法的”。", "note_en": "A court has issued a final ruling denying fan-funding platform Patreon’s request for an injunction against 72 former backers of comedian Owen Benjamin who are seeking arbitration against the company for disrupting the economic relationship between themselves and Benjamin.\n  The  final ruling follows a  tentative ruling against Patreon from earlier this month and means that the company now has to pay upfront filing fees on each of the 72 individual arbitration claims within 30 days of the due date on the invoice. These fees can be upwards of $10,000 per arbitration.\n  When the arbitration commences, Patreon will also have to pay further legal fees and have a rolling obligation to pay them within 30 days. Lawyer, commentator, and producer Mike Cernovich has predicted that these fees  could be as high as $20 million.\n  In the final ruling, the court cited three reasons for denying Patreon’s request for an injunction.\n   First, the court wrote that Patreon “fails to show that it will suffer any irreparable injury or interim harm” if it’s not granted the injunction and noted that “merely having to incur expense in order to participate in arbitration proceedings is not irreparable harm.”\n  Second, the court wrote that “Patreon fails to show a reasonable likelihood of prevailing on its claims” and added that even if the claims are “not arbitrable,” “those issues are for the arbitrators, not the court, to decide.”\n  Third, the court wrote that “California courts rarely grant the extraordinary relief Patreon seeks here” and noted that once a dispute is submitted to arbitration, “the [California Arbitration Act] contemplates limited, if any, judicial involvement.” The court added that “typically, those who enter into arbitration agreements expect that their dispute will be resolved without necessity for any contact with the courts” and “that conclusion is ‘especially true’ where, as here, ‘the arbitration began without the need to seek a court order compelling arbitration.&#39;”\n Not only does the ruling mean Patreon has to pay these likely substantial fees but the ruling also gives users a legal avenue to defend against censorship under this  California arbitration law.\n Under this law, the drafting party of employment or consumer arbitration agreements has to pay the arbitration fees and they can’t reclaim the fees, regardless of the outcome. This means that companies such as Patreon, that force arbitration through their terms of service, risk potentially huge arbitration fees when they ban users because the former backers of these users can seek arbitration over “tortious interference” (disrupting the economic relationship between the creators and their backers).\n For deplatformed users that had hundreds or thousands of backers when they were banned, this could leave these companies liable for millions of dollars in arbitration fees.\n Lawyer Nick Rekieta  said that this case is likely to act as a warning to Big Tech companies that deplatform their users:\n “This is an extremely important case and what just happened is a shot across the bow of Big Tech companies. Your terms of service are binding upon you at least in so far as these arbitration and anti-class action provisions and we can use them against them.\n That is important because this is how we defend ourselves from things like deplatforming, from things like cancel culture, and it is a big win in this sphere.\n Even if they [Benjamin’s former backers] end up losing the arbitration, the threat of removing someone from the platform and facing thousands, potentially thousands of arbitrations claims coming in, that should give them pause at least.”\n Cernovich added that in this specific case, because Patreon changed its terms of service after it was put on notice by Benjamin’s former backers, it could also face arbitrations because it unilaterally altered the terms of service “in a way that’s illegal under California law.”", "posttime": "2020-08-01 11:31:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "平台,ruling,仲裁", "title": "对Patreon不利的最终裁决开辟了反对脱平台的法律途径", "title_en": "Final Ruling Against Patreon Opens Legal Avenue to Defend Against Deplatforming", "transed": 1, "url": "https://reclaimthenet.org/final-ruling-patreon-owen-benjamin-injunction-denied/", "via": "", "real_tags": ["平台", "ruling", "仲裁"]}, {"category": "", "categoryclass": "", "imagename": "3964e21457ce4337c37c748a30f11327.jpg", "infoid": 1015557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据CNBC报道，唐纳德·特朗普总统在空军一号上告诉记者，他最快将于周六采取行动，禁止TikTok进入美国。故事正在更新。", "note_en": "President Donald Trump told reporters on Air Force One that he will act as soon as Saturday to ban TikTok from the US, CNBC reported. The story is updating.", "posttime": "2020-08-01 11:08:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "告诉,told,报道", "title": "\n特朗普告诉记者，他将利用行政权禁止TikTok", "title_en": "\n\t\t\t\tTrump told reporters he will use executive power to ban TikTok\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/31/trump-ban-tiktok/", "via": "", "real_tags": ["告诉", "told", "报道"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "异步Python程序中的一种常见情况是异步初始化。某些资源必须只初始化一次才能使用，但初始化本身是异步的-例如异步数据库。让我们来谈谈几个解决方案。\n初始化=FALSE异步定义ONE_TIME_SETUP()：&#34；请勿多次调用！&#34；...。异步定义可能_Initialize()：如果未初始化，则全局初始化：等待one_time_setup()Initialized=True。\n初始化的理由是期望多次调用函数。但是，如果它可能是从并发任务中调用的，则会出现争用情况。如果第二个调用方在第一个调用方等待one_time_setup()时到达，则函数将被第二次调用。\n因为Asyncio是协作的，所以第一个调用者在等待之前不会放弃对其他任务的控制，这意味着One_Time_Setup()永远不会被调用两次。但是，第二个调用者可能会在one_time_setup()完成之前返回。我们想要的是只调用one_time_setup()一次，但是在它返回之前调用者不会返回。\n我的第一个想法是使用互斥锁。这将保护变量并防止后续调用者进行得太快。ONE_TIME_SETUP()仍在运行时到达的任务将在锁上阻塞。\nINITIALIZED=FALSE INITIALIZED_LOCK=异步。Lock()异步def可能_initialize()：使用initialized_lock全局初始化异步：如果未初始化：等待one_time_setup()initialized=True。\n不幸的是，这有一个严重的缺点：异步锁与创建它们的循环相关联。因为Lock变量是全局变量，所以只能从加载模块的同一个循环中调用PROSECT_INITIALIZE()。Run()创建了一个新循环，因此它是不兼容的。\n#创建循环：异步总是出错。Run(May_initialize())#重用循环：可能是一个错误循环=asyncio。Get_event_loop()循环。RUN_TRANSE_COMPLETE((可能_Initialize()\n(IMHO，asyncio API包含显式循环对象是一个错误。这是一个低级概念，不可避免地会在高层抽象中泄漏。)。\n解决方法是延迟创建锁。谢天谢地，创建alock本身不是异步的！\nInitialized=false initialized_lock=None异步定义可能_Initialize()：GLOBAL INITIALIZED，INITIALIZED_LOCK，如果不是INITIALIZED_LOCK：INITIALIZED_LOCK=asyncio。LOCK()与INITIALIZED_LOCK异步：如果未初始化：等待ONE_TIME_SETUP()INITIALIZED=True。\nPthreadAPI提供了pthreadonce来解决这个问题，C++11也有类似的std：：call_once。我们可以用一个类似未来的物体建造一些类似的东西。\n多次等待协程是错误的，但是任务是类似于未来的对象，可以等待不止一次。至少在CPython上，它们也可以在其他循环中等待！因此，这不仅更简单，还解决了循环问题！\nDef once(Func)：Future=None异步def once_wrapper(*args，**kwargs)：如果不是将来，则为非本地将来：Future=asyncio。Create_task(func(*args，**kwargs))返回等待将来返回ONCE_Wrapper。\n对这篇文章有什么评论吗？通过发送电子邮件至~Skeeto/public-inbox@lists.sr.ht[邮件列表礼仪]开始我的公共收件箱中的讨论，或查看现有讨论。", "note_en": "A common situation in  asyncio Python programs is asynchronousinitialization. Some resource must be initialized exactly once before itcan be used, but the initialization itself is asynchronous — such as an asyncpg database. Let’s talk about a couple of solutions.\n  initialized  =  False async  def  one_time_setup ():  &#34;Do not call more than once!&#34;  ... async  def  maybe_initialize ():  global  initialized  if  not  initialized :  await  one_time_setup ()  initialized  =  True\n The reasoning for  initialized is the expectation of calling thefunction more than once. However, if it might be called from concurrenttasks there’s a  race condition. If the second caller arrives while thefirst is awaiting  one_time_setup(), the function will be called asecond time.\n   Since asyncio is cooperative, the first caller doesn’t give up controluntil to other tasks until the  await, meaning  one_time_setup() willnever be called twice. However, the second caller may return before one_time_setup() has completed. What we want is for  one_time_setup()to be called exactly once, but for no caller to return until it hasreturned.\n  My first thought was to use a  mutex lock. This will protect thevariable  and prevent followup callers from progressing too soon. Tasksarriving while  one_time_setup() is still running will block on thelock.\n initialized  =  False initialized_lock  =  asyncio . Lock () async  def  maybe_initialize ():  global  initialized  async  with  initialized_lock :  if  not  initialized :  await  one_time_setup ()  initialized  =  True\n Unfortunately this has a serious downside:  asyncio locks areassociated with the  loop where they were created. Since thelock variable is global,  maybe_initialize() can only be called fromthe same loop that loaded the module.  asyncio.run() creates a new loopso it’s incompatible.\n # create a loop: always an error asyncio . run ( maybe_initialize ()) # reuse the loop: maybe an error loop  =  asyncio . get_event_loop () loop . run_until_complete (( maybe_initialize ()))\n (IMHO, it was a mistake for the asyncio API to include explicit loopobjects. It’s a low-level concept that unavoidably leaks through mosthigh-level abstractions.)\n A workaround is to create the lock lazily. Thank goodness creating alock isn’t itself asynchronous!\n initialized  =  False initialized_lock  =  None async  def  maybe_initialize ():  global  initialized ,  initialized_lock  if  not  initialized_lock :  initialized_lock  =  asyncio . Lock ()  async  with  initialized_lock :  if  not  initialized :  await  one_time_setup ()  initialized  =  True\n    The pthreads API provides   pthread_once to solve this problem.C++11 has similarly has   std::call_once. We can build somethingsimilar using a future-like object.\n  Awaiting a coroutine more than once is an error, but  tasks arefuture-like objects and can be awaited more than once. At least onCPython, they can also be awaited in other loops! So not only is thissimpler, it also solves the loop problem!\n   def  once ( func ):  future  =  None  async  def  once_wrapper ( * args ,  ** kwargs ):  nonlocal  future  if  not  future :  future  =  asyncio . create_task ( func ( * args ,  ** kwargs ))  return  await  future  return  once_wrapper\n        Have a comment on this article? Start a discussion in my  public inbox by sending an email to   ~skeeto/public-inbox@lists.sr.ht    [ mailing list etiquette] , or see  existing discussions.", "posttime": "2020-08-01 11:06:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,asynchronous,循环", "title": "异步Python中的精确一次初始化", "title_en": "Exactly-Once Initialization in Asynchronous Python", "transed": 1, "url": "https://nullprogram.com/blog/2020/07/30/", "via": "", "real_tags": ["python", "循环"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容在通过重新安装更新到Ubuntu20.04之后，我通过Snap安装了Clion，因为这似乎比手动下载Java安装更方便。Clion是继切片面包之后最好的东西，或者我指的是JetBrains的C/C++IDE。Ubuntu Snap是由Canonical和Pushedhard在Ubuntu中开发的打包系统。今天我费了好大劲才发现Snap自动更新，而且没有办法永久关闭它。Clion被更新了，我注意到这一点，因为进程被终止了。这次更新破坏了我工作流程的几个关键插件，主题很奇怪。在这篇文章中，我将讨论我的厌恶，作为计算机的所有者，我想要完全控制，而不是某个开发人员强迫他们的意愿，决定我需要自动更新。我最终完全删除了Snap，因此我的下一次安装将不会是Ubuntu。\n不仅截图上的插件坏了，而且用来交叉编译成ARM的插件也坏了，这是主要问题。将主题切换为德古拉，然后再切换回高对比度后，主题问题已修复。\n我确实喜欢自动更新和安全优势，但我更喜欢控制这样一个重要的系统。我每周都会仔细地进行更新和快照刷新，但只是在检查了更新中包含了哪些软件包之后，检查了更改日志，并将Clion更新推迟到它们发布两周之后。使用APT，我可以保存软件包，如果我愿意，可以禁用无人值守升级，而使用Snap，这是不可能的。\n无法禁用快照更新。是的您没看错。Ubuntu在这方面比Windows更糟糕，因为即使是微软也允许你在公司安装中禁用更新(带组策略的Windows10LTSC或带WSUS的Windows10LTSC)。\n有一个长达三年的论坛主题，但Snap开发人员没有提供任何解决方案。快照存储/后端也不是开源的，尽管客户端是开源的，但您不能配置任何其他快照存储(如不同的设备库)。因此，理论上，Canonical可以完全控制您的计算机，并且可以在没有用户干预的情况下执行恶意代码。\n你知道最糟糕的是什么吗？有一个-Of Disable选项，但Snap会忽略该选项：\n刷新后，下一次刷新最多可以延迟60天，之后将执行刷新，而不管刷新.hold值如何。\n这就是我最终要做的。我的下一次(重新)安装也可能是Linux Mint，因为它们禁用了Snap并允许用户配置更新。\n我发现的另一件事是人们在他们的主机文件中阻止Snap域，或者为Snap设置代理(为什么不遵循系统范围的设置？另一个愚蠢的开发人员重新发明轮子的例子(我猜)。\n但是，顾名思义，变通就是变通。只要给人们禁用自动更新的选项即可。即使您在默认情况下启用它们，也让我来控制事情发生的内容和时间。\n卸载Snap并通过常规的java安装方法重新安装以前版本的Clion后，我的插件再次正常工作。但这确实占用了我半个小时的宝贵时间，当我发现Snap开发团队强迫他们的Willon Everyone时，他们是绝对愚蠢的，这引起了一些挫败感。用钱包投票，停止购买/使用Ubuntu和Snap，否则只会变得更糟。\n标签：博客、c++、clion、cpp、开发、linux、security、snap、ubuntu", "note_en": "Skip to main content          After updating-by-reinstall to Ubuntu 20.04, I installed CLion via  snap sincethat seemed more convinient than manually downloading a java installation. CLion is the best thing since sliced bread, or I mean a C/C++ IDE byJetBrains. Ubuntu  snap is a packaging system made by Canonical and pushedhard in Ubuntu. Today I found out the hard way that snap auto-updates and thatthere is no way to turn that off permanently. CLion was updated, which Inoticed because the process was killed. The update broke several key pluginsfor my workflow and the theme was weird. In this article I&#39;ll discuss my disgust, I as the owner of the computer want to be in full control, not somedeveloper forcing their will, deciding I need auto updates. I ended up removing snap completely,and my next install will not be Ubuntu due to this.\n   Not just the plugins on the screenshot broke, but also the plugin used tocross compile to ARM, which was the main issue. The theme issue was fixed after switching the theme to Dracula and back to High Contrast.\n  I do love auto updates and the security benefit, but I rather prefer to be in control on such an important system. I carefully  apt update and  snaprefresh every week, but only after reviewing which packages are included inthe update, checking changelogs and holding off CLion updates until they&#39;vebeen out for two weeks. With  apt I can  hold packages and if I want,disable  unattended-upgrades, with  snap, this is impossible.\n  There is no way to disable snap updates. Yes you read that right. Ubuntu is worse than windows in this regard, because even Microsoft lets you, in companysetups, disable updates (Windows 10 LTSC with group policies, or Windows 10with WSUS).\n There is a three year long forum topic but no solution is provided by thesnap developers. The snap store / backend is also not open source, althoughthe client is, you cannot configure any other snap store (like different aptrepositories). So in theory, Canonical has full control over your computer andcan execute malicious code without user intervention.\n You know what the worst thing is? There is a sort-of disable option, but snapignores that:\n After a refresh, the next refresh can be delayed by up to 60 days, afterwhich a refresh will be performed regardless of the refresh.hold value.\n     Which is what I ended up doing. My next (re)install will also probably beLinux Mint since they disable snap and do let their users configure updates.\n One  other thing I found is people blocking the snap domains  in theirhosts file or setting up a proxy for snap (why does that not follow systemwide settings? Another example of stupid developers reinventing the wheel Iguess).\n But, workarounds are as the name suggests, workarounds. Just give people theoption to disable auto updates. Even if you enable them by default, let me bein control of what and when things happen.\n  After uninstalling snap and reinstalling the previous version of CLion via theregular java installation method, my plugins worked again. But it did takehalf an hour of my precious time and caused some frustration when I foundout the utter stupidity of the snap development team for forcing their willon everyone. Vote with your wallet, stop buying / using Ubuntu and snap, otherwise it will only get worse.\nTags:  blog,  c++,  clion,  cpp,  development,  linux,  security,  snap,  ubuntu", "posttime": "2020-08-01 11:06:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,ubuntu,snap", "title": "Ubuntu Snap自动更新损坏了我的开发设置，无法关闭它们", "title_en": "Ubuntu Snap auto updates broke my development setup, can't turn them off", "transed": 1, "url": "https://raymii.org/s/blog/Ubuntu_Snap_auto_updates_broke_my_development_setup.html", "via": "", "real_tags": ["开发", "ubuntu", "snap"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专家说，解决过度饮酒和空气污染暴露等12个因素可能会产生重大影响。\n专家在一份报告中表示，过度饮酒、暴露在空气污染中和头部受伤都会增加痴呆症的风险。报告披露，全球高达40%的痴呆症病例可以通过解决12个这样的生活方式因素来延迟或预防。\n全球约有5000万人患有痴呆症，其中英国约有85万人。据估计，到2040年，英格兰和威尔士将有超过120万人患有痴呆症。目前还没有治愈的方法。\n然而，虽然痴呆症的一些风险因素不能改变，例如特定的基因或种族，但许多因素与生活方式有关。\n伦敦大学学院(University College London)老年人精神病学教授、该报告的联合作者吉尔·利文斯顿(Gill Livingston)表示：“痴呆症可能是可以预防的--无论你处于什么人生阶段，你都可以采取措施降低患痴呆症的风险。”\n她补充说，这种生活方式的改变可以降低那些患有和没有此类疾病高遗传风险的人患痴呆症的机会。\n柳叶刀委员会关于痴呆症预防、干预和护理的这份报告建立在之前工作的基础上，报告显示，大约三分之一的痴呆症病例可以通过解决九个生活方式因素来预防，包括中年听力损失、抑郁症、较少的童年教育和吸烟。\n这项研究权衡了主要来自高收入国家的最新证据，支持在清单上再增加三个风险因素。研究表明，全球1%的痴呆症病例可归因于中年过量饮酒，3%可归因于中年头部损伤，2%可归因于老年人暴露于空气污染-尽管他们警告称，后者可能被低估了。\n利文斯顿说，虽然一些行动可以在个人层面上采取，以解决这些问题，但许多行动需要政府主导的改变。该报告列出了九项建议，其中包括改善空气质量，并敦促政策制定者“对预防抱有雄心勃勃的态度”。\n利文斯顿赞扬了鲍里斯·约翰逊为解决国家腰围问题和减少新冠肺炎死亡而开展的运动，因为肥胖和缺乏锻炼是痴呆症的风险因素之一。“这可能是有帮助的，特别是如果他们开始考虑肥胖环境，让人们骑自行车变得安全，”她说。\n虽然利文斯顿表示，40%的数字是乐观的，因为12个风险因素不太可能完全解决，但小步走可能会有所不同。研究表明，在过去的30年里，欧洲和北美的痴呆症发病率每十年下降约15%-可能是因为生活方式的改变，比如减少吸烟-尽管随着人们寿命的延长，痴呆症患者的数量正在上升。\n研究小组补充说，生活方式干预的影响可能在最贫困的个人和低收入和中等收入国家最大。\n利文斯顿说：“我认为到目前为止痴呆症患病率的下降是在高收入、受过高等教育的人群中出现的，他们对环境有更多的控制，这并不是任何巧合。”“我们预计，到2050年，如果发展趋势继续下去，三分之二的痴呆症患者将生活在低收入国家。”\n目前还不清楚是否所有的风险因素都纯粹是痴呆症的原因，而不是结果。报告指出：“抑郁可能是痴呆症的风险，但在晚年，痴呆症可能会导致抑郁。”\n阿尔茨海默氏症协会的研究和影响力主管菲奥娜·卡拉格为这项工作提供了部分资金，她呼吁推动痴呆症的研究，并警告说，由于新冠肺炎的大流行，医学研究慈善机构正面临着研究资金平均下降40%的问题。\n纽卡斯尔大学(NewCastle University)流行病学教授菲奥娜·马修斯(Fiona Matthews)没有参与这份报告，她表示，对生活方式的关注并不意味着人们应该觉得如果他们患上痴呆症就应该受到指责。\n她说：“我们可以努力降低我们的个人风险和社会风险，但即使有了这些风险因素，也只相当于所有痴呆症的不到50%。”她补充说，风险的增加并不意味着痴呆症肯定会发展成痴呆症。\n马修斯说，解决个人和社会的生活方式风险因素仍然很重要，并补充说，正如新冠肺炎所强调的那样，应该有针对性地解决人口健康方面的不平等问题。\n她说：“关键的一点是，在没有推迟或推迟痴呆症的治疗的情况下，降低每个人的风险是减缓我们将看到的由于人口老龄化而增加的痴呆症人数的最好方法。”", "note_en": "Addressing 12 factors such as excessive drinking and air pollution exposure may have significant effect, experts say\n    Excessive drinking, exposure to air pollution and head injuries all increase dementia risk, experts say in a report revealing that up to 40% of dementia cases worldwide could be delayed or prevented by addressing 12 such lifestyle factors.\n Around 50 million people around the world live with dementia, including about  850,000 people in the UK. By 2040, it has been estimated there will be more than 1.2 million people living with dementia in England and Wales. There is currently no cure.\n  However, while some risk factors for dementia cannot be changed, for example particular genes or ethnicity, many are down to lifestyle.\n “Dementia is potentially preventable – you can do things to reduce your risk of dementia, whatever stage of life you are at,” said Gill Livingston, professor of psychiatry of older people at University College London and a co-author of the report.\n She added such lifestyle changes could reduce the chances of developing dementia in both those with and without a high genetic risk for such conditions.\n The report from the  Lancet Commission on dementia prevention, intervention and care builds on previous work revealing that about a third of dementia cases could be  prevented by addressing nine lifestyle factors, including midlife hearing loss, depression, less childhood education and smoking.\n  The research weighs up the latest evidence, largely from high-income countries, supporting the addition of a further three risk factors to the list. It suggests that 1% of dementia cases worldwide are attributable to excessive mid-life alcohol intake, 3% to mid-life head injuries and 2% a result of exposure to air pollution in older age – although they caution that the latter could be an underestimate.\n While some actions can be taken on a personal level to tackle such issues, many require government-led change, Livingston said. The report includes a list of nine recommendations, including improving air quality, and urges policymakers to “be ambitious about prevention”.\n Livingston praised  Boris Johnson’s  campaign to tackle the nation’s waistlines and reduce Covid-19 deaths, as obesity and lack of exercise are among the risk factors for dementia. “That may be helpful, particularly if they are beginning to think about obesogenic environments and making it safe for people to ride bikes,” she said.\n While Livingston said the 40% figure was optimistic as the 12 risk factors are unlikely to be completely addressed, small steps could make a difference.  Research has suggested that the incidence of dementia in Europe and North America has fallen by around 15% per decade for the past 30 years – likely because of lifestyle changes such as a reduction in smoking – even though the numbers of people with dementia are rising as people live longer.\n The impact of lifestyle interventions, the team add, is likely to be greatest among the most deprived individuals and in low- and middle-income countries.\n “I don’t think it is any coincidence that the reductions in dementia prevalence to date have been in high-income, highly educated people who have more control over their environment,” said Livingston. “We are expecting by 2050 that two-thirds of people with dementia, if trajectories continue, will be in low-income countries.”\n It is not clear whether all the risk factors are purely a cause rather than an effect of dementia. The report notes: “Depression might be a risk for dementia, but in later life dementia might cause depression.”\n Fiona Carragher, director of research and influencing at Alzheimer’s Society, which part-funded the work, called for a boost to dementia research, warning that medical research charities are facing a 40% average fall in research funding because of the Covid-19 pandemic.\n Fiona Matthews, professor of epidemiology at Newcastle University, who was not involved in the report, said the focus on lifestyle did not mean people should feel they are to blame if they develop dementia.\n “We can work at reducing our personal risk and society’s risk, but still even then with these risk factors it only equates to less than 50% of all dementia,” she said, adding that an increase in risk did not mean dementia was certain to develop.\n Matthews said tackling lifestyle risk factors, personally and as a society, remained important, adding that inequalities in population health, as highlighted by Covid-19, should be targeted.\n “The crucial component is that in the absence of treatments that delay or postpone dementia, reducing everyone’s risk is the best method to slow the increasing numbers of people with dementia that we would see due to population ageing,” she said.", "posttime": "2020-08-01 10:20:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "延迟,delay,痴呆症", "title": "研究称，改变生活方式可以延迟或预防40%的痴呆症病例", "title_en": "Lifestyle Changes Could Delay Or Prevent 40% of Dementia Cases, Study Says", "transed": 1, "url": "https://www.theguardian.com/society/2020/jul/30/lifestyle-changes-could-delay-or-prevent-40-of-dementia-cases-study", "via": "", "real_tags": ["延迟", "delay", "痴呆症"]}, {"category": "", "categoryclass": "", "imagename": "879ac2f09eb904d2543c477e6801f934.png", "infoid": 1015552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人们对远程医疗的兴趣继续增加，Lemonaid Health筹集了3300万美元的B系列超额认购资金，以开发其在线获取医疗保健的按需平台。\n这家总部位于旧金山的公司成立于2013年，首席执行官保罗·约翰逊告诉Crunchbase News，该公司旨在开发一个直接面向消费者的初级保健平台，利用技术改变人们与医疗保健的互动方式。他说，用户自己支付护理费用，就诊费用与保险自付费用大致相同。\n橄榄树风险投资公司(Ove Tree Ventures)领跑了这轮融资，来自Artis Ventures、Corative Ventures、Hikma Ventures和Sierra Ventures的公司参与了这轮融资。根据Crunchbase的数据，新一轮融资总额达到5500万美元，其中包括2017年筹集的1100万美元首轮融资。\nLemonaid Health将自己与竞争对手区分开来的方式之一是经营自己的药店，以及通过与其早期投资者之一Quest Diagnostics合作提供实验室检测。它还与斯坎韦尔健康公司(Scanwell Health)合作，提供家庭尿液检测试剂盒。\n有了新的资金，Lemonaid Health将扩大其医疗专业团队，并增加向患者提供的服务的数量，包括哮喘、高血压、2型糖尿病的治疗和更多的精神健康服务。\n在确保了A系列的安全后，该公司在10个州提供服务。约翰逊说，今天，它的覆盖范围是全国的。他说，各州的远程医疗法规不同，因此一些允许视频通话和/或电话通话，而另一些只允许电话和/或安全消息传递。\n约翰逊说：“我们现在专注于拓展服务。”“到目前为止，我们已经帮助了100万名患者，我们希望在未来几年内帮助1000万人。”\n橄榄树风险投资公司的普通合伙人亚历杭德罗·温斯坦在一份书面声明中表示，莱蒙奈德健康公司正在通过提供一种面对面护理的替代方案，减轻医疗系统的一些负担，特别是那些主要管理新冠肺炎的系统。\n温斯坦说：“通过直接与有需要的患者联系，并无缝地提供咨询服务和治疗，保罗和他的团队正在采取一种前沿的方法来解决当今医疗环境中积压的需求。”我们很高兴能与Lemonaid Health合作，实现技术在重新展望医疗保健未来方面的全部潜力。“。\n与此同时，该公司的团队有75名员工，其中包括医生、护士、药剂师、药房技术人员、患者支持和手术。约翰逊计划到2022年增长到250人以上。\n他说：“我们专注于为患者提供最高水平的服务，并将把我们的护理服务扩大到慢性病。”我们还将通过提供更多服务来扩大我们的团队和平台，以满足需求。“", "note_en": "Interest in telemedicine continues to increase, and  Lemonaid Health raised an oversubscribed $33 million Series B round of funding to develop its on-demand platform for accessing health care online.\n  The San Francisco-based company was started in 2013 to develop a direct-to-consumer, primary care platform that uses technology to change the way people interact with health care, CEO  Paul Johnson told Crunchbase News. Users pay for the care themselves, and the visits cost about the same as an insurance co-pay, he said.\n Olive Tree Ventures led the round, with participation from  Artis Ventures,  Correlation Ventures,  Hikma Ventures and  Sierra Ventures. The new round brings total financing to $55 million, including an  $11 million Series A round raised in 2017 according to Crunchbase data.\n  One of the ways Lemonaid Health differentiates itself from competitors is by operating its own pharmacy, as well as offering lab testing through a partnership with  Quest Diagnostics, one of its early investors. It also partners with  Scanwell Health to provide at-home urine testing kits.\n With the new funding, Lemonaid Health will expand its team of medical professionals and increase the number of services being offered to patients, including treatment for asthma, hypertension, Type 2 diabetes and more mental health services.\n After securing its Series A, the company was offering services in 10 states. Today, its reach is nationwide, Johnson said. Telemedicine regulations differ from state-to-state, so some allow video calls and/or telephone calls, while others only allow telephone calls and/or secure messaging, he said.\n “We are now focused on expanding services,” Johnson said. “We have helped 1 million patients so far, and we want to help 10 million in the next few years.”\n  Alejandro Weinstein, general partner at Olive Tree Ventures, said in a written statement that Lemonaid Health is taking some of the burden off of health systems, especially those primarily managing COVID-19, by offering an alternative to in-person care.\n “By connecting directly with patients in need and seamlessly providing consultative services and treatments, Paul and his team are taking a cutting-edge approach to addressing the backlog of need in today’s health care environment,” Weinstein said. “We are excited to partner with Lemonaid Health to realize the full potential of technology in re-envisioning the future of health care.”\n  Meanwhile, the company has 75 employees on the team, which includes doctors, nurses, pharmacists, pharmacy techs, patient support and operations. Johnson plans to grow to more than 250 people by 2022.\n “We are focused on providing the best level of service to patients and will be expanding our care offerings to chronic conditions,” he said. “We will also build out our team and platform with additional services to meet demand.”", "posttime": "2020-08-01 10:20:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "总额,health", "title": "为在线获取医疗保健提供按需服务的Lemonaid Health筹集了3300万美元的B系列资金，使其筹资总额达到5500万美元", "title_en": "Lemonaid Health, which offers an on-demand service for accessing health care online, raises $33M Series B, bringing its total raised to $55M", "transed": 1, "url": "https://news.crunchbase.com/news/lemonaid-health-taps-into-33m-series-b-for-at-home-health-care-platform/", "via": "", "real_tags": ["总额", "health"]}, {"category": "", "categoryclass": "", "imagename": "caa7e8c6a0f91b93bb26344f40bc2add.jpg", "infoid": 1015548, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "柏林-德国正在禁止销售一次性使用的塑料吸管、棉蕾和食品容器，这符合欧盟的一项指令，该指令旨在减少污染环境的塑料垃圾的数量。\n内阁周三同意在2021年7月3日之前停止销售塑料制品，包括一次性餐具、盘子、搅拌棒和气球架，以及聚苯乙烯杯子和盒子。\n环境部长斯文贾·舒尔茨(Svenja Schulze)表示，此举是摆脱“丢弃文化”的努力的一部分。在公园和其他公共场所收集的垃圾中，高达20%是一次性塑料容器，主要是聚苯乙烯容器。\n塑料需要几十年的时间才能降解，在鱼、鸟和其他动物的体内发现了微小的颗粒。", "note_en": "BERLIN — Germany is banning the sale of single-use plastic straws, cotton buds and food containers, bringing it in line with a European Union directive intended to reduce the amount of plastic garbage that pollutes the environment.\n The Cabinet agreed Wednesday to end the sale of plastics including single-use cutlery, plates, stirring sticks and balloon holders, as well as polystyrene cups and boxes by July 3, 2021.\n Environment Minister Svenja Schulze said the move was part of an effort to move away from “throw-away culture.” Up to 20% of garbage collected in parks and other public places consists of single-use plastic, mainly polystyrene containers.\n Plastic takes  decades to degrade and microscopic particles have been found inside the bodies of fish, birds and  other animals.", "posttime": "2020-08-01 09:12:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "塑料,banning", "title": "德国禁止一次性使用塑料吸管、棉蕾和食品容器", "title_en": "Germany is Banning Single-Use Plastic Straws, Cotton Buds and Food Containers", "transed": 1, "url": "https://www.usatoday.com/story/news/world/2020/07/31/germany-bans-plastic-straws-food-containers-cotton-buds/5556621002/", "via": "", "real_tags": ["塑料", "banning"]}, {"category": "", "categoryclass": "", "imagename": "065dcf5a87c8b29475e3b45b4a395723.png", "infoid": 1015547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们正在发布一个API，用于访问OpenAI开发的新AI模型。与大多数为一种用例设计的人工智能系统不同，API今天提供了一个通用的“文本输入，文本输出”界面，允许用户在几乎任何英语任务上尝试它。您现在可以申请访问权限，以便将API集成到您的产品中，开发全新的应用程序，或者帮助我们了解这项技术的优势和局限性。\n给定任何文本提示，API将返回文本完成，尝试匹配您给出的模式。你只需向它展示几个你希望它做什么的例子，就可以对它进行编程；它的成功程度通常取决于任务的复杂程度。API还允许您通过对您提供的示例的数据集(无论大小)进行培训，或者从用户或标签员提供的人工反馈中学习，来磨练特定任务的性能。\n我们设计的API既简单易用，又足够灵活，使机器学习团队的工作效率更高。事实上，我们的许多团队现在都在使用API，这样他们就可以专注于机器学习研究，而不是分布式系统问题。如今，API使用GPT-3系列中的权重运行模型，速度和吞吐量都有许多改进。机器学习的发展非常迅速，我们正在不断升级我们的技术，以便我们的用户保持最新。\n这一领域的进展速度意味着人工智能经常出现令人惊讶的新应用，既有积极的，也有消极的。我们将针对明显有害的使用案例终止API访问，例如骚扰、垃圾邮件、激进化或占星术。但我们也知道，我们无法预测这项技术可能带来的所有后果，所以我们今天将以私人测试版而不是普遍提供的形式推出，构建工具来帮助用户更好地控制我们的API返回的内容，并研究语言技术的安全相关方面(如分析、减轻和干预有害偏见)。我们将分享我们所学到的知识，以便我们的用户和更广泛的社区能够构建更多具有人类积极性的人工智能系统。\n除了作为帮助我们支付追求使命成本的收入来源外，API还推动我们更加关注通用人工智能技术-推进技术，使其可用，并考虑其在现实世界中的影响。我们希望API将大大降低生产有益的AI驱动产品的门槛，从而产生今天很难想象的工具和服务。\n对探索API感兴趣吗？加入Algolia、Quizlet和Reddit等公司以及米德尔伯里研究所(Midlebury Institute)等机构的研究人员参与我们的私人测试版。\n归根结底，我们最关心的是确保人工通用智能造福每个人。我们认为开发商业产品是确保我们有足够资金取得成功的方法之一。\n我们还认为，在世界上安全部署强大的人工智能系统将很难做到正确。在发布API时，我们正在与我们的合作伙伴密切合作，看看人工智能系统在现实世界中使用时会出现什么挑战。这将有助于指导我们的努力，以了解部署未来的人工智能系统将如何进行，以及我们需要做些什么来确保它们对每个人都是安全和有益的。\n我们这样做的主要原因有三个。首先，将技术商业化有助于我们为正在进行的人工智能研究、安全和政策努力买单。\n其次，API底层的许多模型都非常大，需要大量的专业知识来开发和部署，这使得它们的运行成本非常高。这使得除了较大的公司之外，任何人都很难从底层技术中受益。我们希望API将使功能强大的AI系统更容易为较小的企业和组织所访问。\n第三，API模型使我们能够更容易地应对技术的滥用。由于我们的模型的下游用例很难预测，因此通过API发布它们并随着时间的推移扩大访问比发布开放源码模型更安全，因为在开源模型中，如果发现有有害的应用程序，访问将无法调整。\n鉴于您之前所说的关于GPT-2的内容，OpenAI将具体对API的滥用做些什么？\n我们将终止API的使用访问-对人们造成身体或精神伤害的情况，包括但不限于骚扰、故意欺骗、激进化、占星术或垃圾邮件；随着我们在实践中获得更多操作API的经验，我们预计将扩大和完善这些类别。\n我们还在对API提供的模型的潜在滥用进行研究，包括通过我们的学术访问计划与第三方研究人员合作。\n到目前为止，我们一直在与我们单独审查的用户进行私人测试版，这进一步降低了误用的可能性，同时我们更好地理解了API的含义和局限性。\nOpenAI将如何减轻API提供的模型的有害偏见和其他负面影响？\n减轻有害偏见等负面影响是一个极其重要的全行业难题。最终，我们的API模型确实显示出偏差(如GPT-3论文中所示)，这些偏差有时会出现在生成的文本中。我们的API模型还可能以我们还没有想到的方式造成危害。以下是我们为解决这些问题而采取的步骤：\n我们正在与用户一起制定使用指南，以帮助他们相互学习，并在实践中缓解这些问题。\n我们正在与用户密切合作，深入了解他们的使用案例，并开发工具来标记和干预有害偏见的表现。\n我们正在对有害的偏见和更广泛的公平和代表性问题进行研究，这将有助于为我们与用户的工作提供信息。\n随着时间的推移，我们的目标是彻底了解API的潜在危害，并不断改进我们的工具和流程，以帮助将其降至最低。\n我们将努力分享我们所学到的知识，这样别人才能受益。我们也希望看到其他AI开发人员也这样做，因为偏见是AI开发中的集体行动问题。", "note_en": "We’re releasing an API for accessing new AI models developed by OpenAI. Unlike most AI systems which are designed for one use-case, the API today provides a general-purpose “text in, text out” interface, allowing users to try it on virtually any English language task. You can now  request access in order to integrate the API into your product, develop an entirely new application, or help us explore the strengths and limits of this technology.\n   Given any text prompt, the API will return a text completion, attempting to match the pattern you gave it. You can &#34;program&#34; it by showing it just a few examples of what you&#39;d like it to do; its success generally varies depending on how complex the task is. The API also allows you to hone performance on specific tasks by training on a dataset (small or large) of examples you provide, or by learning from human feedback provided by users or labelers.\n We&#39;ve designed the API to be both simple for anyone to use but also flexible enough to make machine learning teams more productive. In fact, many of our teams are now using the API so that they can focus on machine learning research rather than distributed systems problems. Today the API runs models with weights from the  GPT-3 family with many speed and throughput improvements. Machine learning is moving very fast, and we&#39;re constantly upgrading our technology so that our users stay up to date.\n  The field&#39;s pace of progress means that there are frequently surprising new applications of AI, both positive and negative. We will terminate API access for obviously harmful use-cases, such as harassment, spam, radicalization, or astroturfing. But we also know we can&#39;t anticipate all of the possible consequences of this technology, so we are launching today in a private beta rather than general availability, building tools to help users better control the content our API returns, and researching safety-relevant aspects of language technology (such as analyzing, mitigating, and intervening on harmful bias). We&#39;ll share what we learn so that our users and the broader community can build more human-positive AI systems.\n In addition to being a revenue source to help us  cover costs in pursuit of  our mission, the API has pushed us to sharpen our focus on general-purpose AI technology — advancing the technology, making it usable, and considering its impacts in the real world. We hope that the API will greatly lower the  barrier to producing beneficial AI-powered products, resulting in tools and services that are hard to imagine today.\n Interested in exploring the API? Join companies like  Algolia,  Quizlet, and  Reddit, and researchers at institutions like the  Middlebury Institute in our  private beta.\n   Ultimately, what we  care about most is ensuring artificial general intelligence benefits everyone. We see developing commercial products as one of the ways to make sure we have enough funding to succeed.\n We also believe that safely deploying powerful AI systems in the world will be hard to get right. In releasing the API, we are working closely with our partners to see what challenges arise when AI systems are used in the real world. This will help guide our efforts to understand how deploying future AI systems will go, and what we need to do to make sure they are safe and beneficial for everyone.\n  There are three main reasons we did this. First, commercializing the technology helps us pay for our ongoing AI research, safety, and policy efforts.\n Second, many of the models underlying the API are very large, taking a lot of expertise to develop and deploy and making them very expensive to run. This makes it hard for anyone except larger companies to benefit from the underlying technology. We’re hopeful that the API will make powerful AI systems more accessible to smaller businesses and organizations.\n Third, the API model allows us to more easily respond to misuse of the technology. Since it is hard to predict the downstream use cases of our models, it feels inherently safer to release them via an API and broaden access over time, rather than release an open source model where access cannot be adjusted if it turns out to have harmful applications.\n What specifically will OpenAI do about misuse of the API, given what you’ve previously said about GPT-2?\n We will terminate API access for use-cases that cause physical or mental harm to people, including but not limited to harassment, intentional deception, radicalization, astroturfing, or spam; as we gain more experience operating the API in practice we expect to expand and refine these categories.\n We are also conducting research into the potential misuses of models served by the API, including with third-party researchers via our  academic access program.\n So far, we have been conducting the private beta with users who we’ve individually vetted, which further reduces the odds of misuse while we get a better understanding of the implications and limitations of the API.\n How will OpenAI mitigate harmful bias and other negative effects of models served by the API?\n Mitigating negative effects such as harmful bias is a hard, industry-wide issue that is extremely important. Ultimately, our API models do exhibit biases (as shown in the  GPT-3 paper) that will appear on occasion in generated text. Our API models could also cause harm in ways that we haven’t thought of yet. Here are the steps we’re taking to address these issues:\n We&#39;re developing usage guidelines with users to help them learn from each other and mitigate these problems in practice.\n We are working closely with users to deeply understand their use cases and develop tools to label and intervene on manifestations of harmful bias.\n We’re conducting our own research into harmful bias and broader issues in fairness and representation, which will help inform our work with our users.\n Our goal over time is to develop a thorough understanding of the API’s potential harms, and continually improve our tools and processes to help minimize them.\n We&#39;ll seek to share what we learn, so that others can benefit. We also hope to see other AI developers do the same, as bias is a  collective action problem in AI development.", "posttime": "2020-08-01 09:11:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "openai,api", "title": "OpenAI API", "title_en": "OpenAI API", "transed": 1, "url": "https://openai.com/blog/openai-api/", "via": "", "real_tags": ["openai", "api"]}, {"category": "", "categoryclass": "", "imagename": "79ae4d6fd239a674162cfa3c63261d16.jpg", "infoid": 1015545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据The Verge报道，众议院司法委员会(House Judiciary Committee)反垄断调查公布的苹果内部电子邮件披露了苹果为什么在iOS设备上阻止应用内购买Kindle图书的信息。\n史蒂夫·乔布斯(Steve Jobs)、菲尔·席勒(Phil Schiller)、埃迪·库伊(Eddy Cue)和其他苹果高管之间的两组电子邮件披露了苹果如何在iOS上接触Kindle的确切想法。目前的先例是史蒂夫·乔布斯(Steve Jobs)概述的，他说，我认为这一切都很简单--iBooks将成为iOS设备上唯一的书店。我们需要昂首挺胸。人们可以阅读从别处购买的书籍，但不能在不付钱的情况下从iOS购买/租赁/订阅，我们承认这在很多事情上都是令人望而却步的。\n最初，Kindle图书可以通过iOS应用程序购买。自2011年以来，Kindle iOS应用程序只允许用户在应用程序中阅读书籍。购买新书只能在Safari中进行，而不能在应用程序本身中进行。这使得亚马逊可以避免对应用内购买收取30%的苹果附加费。\n‌菲尔·席勒‌在其中一封电子邮件中表达了担忧，即亚马逊正在宣传这样一个事实，即用户仍然可以在安卓设备上访问在ios上购买的kindle图书，这表明从ios切换到安卓系统很方便。\n席勒解释说，苹果最初为亚马逊破例，因为用户将在Kindle设备上购买图书，然后在iPhone上访问。随着时间的推移，随着iOS设备销量的大幅上升，席勒认为是时候重新考虑这一例外了。亚马逊的电视广告对苹果来说是一个明显的争议点，并促使苹果改变了态度。\n这些讨论是在苹果计划宣布修订后的App Store订阅政策时进行的。乔布斯在他的回应中建议，亚马逊必须使用我们的支付系统来处理所有事情，并用新的订阅政策来证明这一点。乔布斯写道：如果他们想把我们与Android相提并论，那就让我们强迫他们使用我们优越得多的支付系统吧。\n亚马逊后来在iOS应用程序中删除了指向Kindle Store的链接，以符合新的App Store订阅规则。从那时起，Kindle应用程序的店面功能就完全被移除了，没有明确的去哪里买书的方向。\n昨天，美国反垄断小组委员会公布的进一步电子邮件显示，苹果向亚马逊提供较低的‌应用商店‌费用，以说服亚马逊在‌‌应用商店‌‌和苹果电视上推出Prime Video应用程序。\n苹果在2011年前的Kindle和Prime Video上为亚马逊破例的消息在一些观察家中引起了混乱，因为苹果一直声称它对每个开发者都一视同仁。‌菲尔·席勒‌在本周的反垄断调查之前表示，‌应用商店‌中的所有应用程序都得到了同等对待--每个人都有一套规则，没有特殊交易，没有特殊条款，没有特殊代码，所有的东西都适用于所有的开发者。\n就像每家公司一样，也有公众形象和私人形象。这对任何人来说都不是什么令人惊讶的事情，不是吗？\n苹果-自1977年以来一直坚守在他们的客户身上。然后明目张胆地撒谎。一遍又一遍。\n欢迎来到生意人。与每天真正在商业中发生的事情相比，这是非常平淡无奇的。\n我最喜欢的是Phil&39；s；在切换设备方面看起来并不好玩。这就好比，如果你正在制造一款卓越的设备(我相信他们确实是这么做的)，为什么这会伤害你的自尊心呢？这就像是他们专注于让人们很难故意离开生态系统。只要制造出令人惊叹的产品，人们就会蜂拥至你的产品。\n我想看看论坛上所有的反对者在最后几天会如何经营一家企业…。发表意见很容易，建立公司则是另一回事。\n随着有关iPhone12的传言在过去几个月里不断增加，最令人兴奋的一款机型是最小的5.4；机型。据信，iPhone12将有5.4&34；、6.7&34；和6.1&34；三种尺寸。虚拟模型已经表明，与iPhone的其他产品相比，5.4&34；的尺寸要小得多。即将发布的5.4&34；款iPhone的尺寸介于原版iPhone的尺寸之间。\n苹果首席财务官卢卡·马埃斯特里(Luca Maestri)今天在涵盖2020财年第三季度(第二财季)的财报电话会议上证实，苹果预计今年iPhone的发布时间将晚于往常。马埃斯特里说，苹果去年9月下旬开始销售iPhone，但今年，苹果预计几周后就会有货源供应。多个传言称……\n泄密者乔恩·普罗瑟(Jon Prosser)在预测苹果的计划方面有一些喜忧参半的记录，他今天表示，新款iPhone12和新款iPad将于10月份发布。多个传言称，今年即将推出的部分或全部iPhone12机型的发布时间将晚于正常时间。苹果通常在9月份发布和发布新款iPhone，但问题是…。\n根据DigiTimes的一份新报告，Apple Watch Series 6将在今年晚些时候发布时增加血氧监测功能。Apple Watch 6将配备生物传感器，可以监测睡眠状况，检测血氧，测量脉率、心跳和心房颤动，还将集成基于MEMS的加速计和陀螺仪，所有这些都允许...。\n据The Verge报道，MacOS8现在可以作为MacOS、Windows和Linux的应用程序使用。Sack开发者Felix Rieseberg已经将MacOS8转变为适用于现代MacOS、Windows和Linux设备的单一可下载应用程序。Rieseberg之前曾在2018年将Windows95转换为一款应用程序，之后他将注意力转向将1991年安装了MacOS8.1的整个Macintosh Quadra转换为单一的...。\n苹果首席执行官蒂姆·库克今天在美国众议院司法反垄断委员会的反垄断听证会上作证，他在听证会上被问及苹果应用商店的政策。库克受到了委员会已经交谈过的开发商的投诉。苹果被指控使其App Store规则对开发者不可用，任意执行这些规则，随意更改它们，……。\n谷歌今天宣布推出一款新的iOS版Google One应用程序，该应用程序旨在让用户存储照片、视频、联系人和日历事件，以备备份之用。使用谷歌账户附带的15 GB免费存储空间，可以将内容备份到Google One。应用程序中的存储管理器可以访问Google Drive、Gmail和Google Photos使用的存储空间。\nAppleInsider发现的一份专利申请显示，苹果已经开发出一种使用骨传导技术的混合音频系统。在今天由美国专利商标局授予的一项名为“使用音频压缩器的多路径音频刺激”的专利中，苹果公司提出了其音频设备的概念，该设备寻求克服通常与骨骼相关的问题。\n苹果预计将在今年推出全OLED iPhone系列，据悉大部分OLED面板将由三星提供，但据报道，LG Display将从额外需求中获益最多，三星的订单量仅比前几年略有增长。在今年即将推出的四款新机型中，有传言称三星将为…。\n苹果公司今天公布了2020财年第三季度的财务业绩，这相当于今年的第二个日历季度。该季度，苹果公司公布的收入为597亿美元，季度净利润为112.5亿美元，或每股稀释后收益2.58美元，而去年同期的收入为538亿美元，季度净利润为100亿美元，或每股稀释后收益2.18美元…", "note_en": "Internal Apple emails, made public by the House Judiciary Committee&#39;s  antitrust inquiry, have revealed information about why Apple blocked in-app purchases of Kindle books on iOS devices, reports   The Verge.\n  Two sets of emails between Steve Jobs,  Phil Schiller,  Eddy Cue, and various other senior Apple executives, disclose the exact thinking behind how Apple approached Kindle on iOS. The current precedent was outlined by Steve Jobs, who stated that &#34;I think this is all pretty simple —  iBooks is going to be the only bookstore on iOS devices. We need to hold our heads high. One can read books bought elsewhere, just not buy/rent/subscribe from iOS without paying us, which we acknowledge is prohibitive for many things.&#34;\n Originally, Kindle books were available for purchase via the iOS app. Since 2011, the Kindle iOS app has only allowed users to read books in the app. Purchase of new titles can only be made in Safari, not in the app itself. This allows Amazon to avoid a 30% Apple surcharge on in-app purchases.\n ‌Phil Schiller‌ expressed concern in one of the emails that Amazon was advertising the fact that users could still access Kindle books purchased on iOS on Android devices, suggesting it was convenient to switch from iOS to Android.\n  Schiller explained that Apple initially made an exception for Amazon, because &#34;users would be buying books on a Kindle device and later accessing them on  iPhone.&#34; Over time, as sales of iOS devices rose dramatically, Schiller believed that it was time to reconsider the exception. Amazon&#39;s TV advertising was a clear point of contention for Apple and prompted the change of attitude.\n  These discussions took place as Apple was planning to announce  revised App Store policies for subscriptions. Jobs suggested in his response that Amazon &#34;must use our payment system for everything,&#34; and justify this with the new subscription policies. &#34;If they want to compare us to Android, let&#39;s force them to use our far superior payment system,&#34; Jobs wrote.\n  Amazon later removed a link to the Kindle Store in the iOS app to comply with the new  App Store subscription rules. From then onwards, the Kindle app&#39;s storefront feature was removed entirely, with no overt direction as to where to buy books.\n  Yesterday,  further emails published by the U.S. antitrust subcommittee revealed that Apple offered Amazon lower ‌App Store‌ fees to convince it to launch its Prime Video app on the ‌‌App Store‌‌ and  Apple TV.\n The news that Apple made exceptions for Amazon for Kindle prior to 2011 and for Prime Video has caused confusion among some observers, as Apple has consistently claimed it treats every developer the same. ‌Phil Schiller‌  stated ahead of the antitrust inquiry this week that all apps in the ‌App Store‌ have been treated &#34;the same - one set of rules for everybody, no special deals, no special terms, no special code, everything applies to all developers the same.&#34;\n As with every company, there is the Public face and the Private face. None of this is really any surprise to anyone, is it?\n Apple - sticking it to their customers since 1977. And then blatantly lying about it. Repeatedly.\n Welcome to business guys.  This is very tame compared to what really goes on in business every day.\n My favorite is Phil&#39;s &#34;Not fun to watch&#34; in regards to switching devices. It&#39;s like if you&#39;re making a superior device (which I believe they do), why would this bruise your ego?  It&#39;s like they are focused on making it hard for people to leave the ecosystem on purpose.  Just make awesome products, and people will flock to your product.\n I would like to see how all the nay-sayers at the forums the last days would run a business...   It&#39;s very easy to have opinions, it&#39;s another to build a company.\n  As rumors of the iPhone 12 have continued to build over the past few months, the one model that has the most excitement around it is the smallest 5.4&#34; model. The iPhone 12 is believed to be coming in 5.4&#34;, 6.7&#34;, and 6.1&#34; sizes.\rDummy models have shown how much smaller the 5.4&#34; is compared to the rest of the iPhone lineup. The upcoming 5.4&#34; iPhone falls in-between the size of the original...\n During today&#39;s earnings call covering the third fiscal quarter of 2020 (second calendar quarter) Apple CFO Luca Maestri confirmed that Apple is expecting to release this year&#39;s iPhones later than usual.\rMaestri said that Apple last year started selling iPhones in late September, but this year, Apple projects supply will be &#34;available a few weeks later.&#34;\rMultiple rumors have suggested that ...\n Leaker Jon Prosser, who has a somewhat mixed track record when it comes to predicting Apple&#39;s plans, today said that new iPhone 12 models and new iPads will launch in October.\rMultiple rumors have suggested that some or all of the iPhone 12 models coming this year will see a later than normal launch. Apple typically unveils and releases new iPhones in the month of September, but problems...\n The Apple Watch Series 6 will add blood oxygen monitoring to its features list when it&#39;s launched later this year, according to a new report from DigiTimes.\rApple Watch 6 will feature biosensors that can monitor sleeping conditions, detect blood oxygen and measure pulse rates, heartbeats and atrial fibrillation, and will also incorporate MEMS-based accelerometer and gyroscope, all allowing the ...\n Mac OS 8 is now available as an app for macOS, Windows, and Linux, reports The Verge.\rSlack developer Felix Rieseberg has transformed Mac OS 8 into a single downloadable app for modern macOS, Windows, and Linux devices. Having previously transformed Windows 95 into an app in 2018, Rieseberg turned his attention to transforming an entire 1991 Macintosh Quadra with Mac OS 8.1 into a single...\n Apple CEO Tim Cook is today testifying in an antitrust hearing with the U.S. House Judiciary Antitrust Subcommittee, where he was questioned about Apple&#39;s App Store policies.\rCook was hit with complaints from developers that the committee has spoken to. Apple was accused of making its App Store rules unavailable to developers, arbitrarily enforcing those rules, changing them at will,...\n Google today announced the launch of a new Google One app for iOS, which is designed to let users store photos, video, contacts, and calendar events for backup purposes.\rContent can be backed up to Google One using the 15GB of free storage that comes with a Google Account. A Storage Manager in the app provides access to storage space used by Google Drive, Gmail, and Google Photos to make it...\n A patent filing, discovered by AppleInsider, shows that Apple has developed a hybrid &#34;combined&#34; audio system using bone conduction technology.\rIn a patent granted today by the U.S. Patent and Trademark Office titled &#34;Multipath audio stimulation using audio compressors,&#34; Apple lays out its conception of an audio device that seeks to overcome the issues usually associated with bone...\n Apple is expected to launch an all-OLED iPhone lineup this year, and while Samsung is understood to be providing the majority of the OLED panels, LG Display is reportedly poised to benefit the most from the extra demand, with Samsung&#39;s order volume rising only slightly on previous years.\rOf the four new models coming this year, rumors have indicated that Samsung will supply the displays for...\n Apple today announced financial results for the third fiscal quarter of 2020, which corresponds to the second calendar quarter of the year.\rFor the quarter, Apple posted revenue of $59.7 billion and net quarterly profit of $11.25 billion, or $2.58 per diluted share, compared to revenue of $53.8 billion and net quarterly profit of $10.0 billion, or $2.18 per diluted share, in the year-ago...", "posttime": "2020-08-01 08:47:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乔布斯,购买,reveal,苹果", "title": "电子邮件揭示为什么史蒂夫·乔布斯和菲尔·席勒阻止应用内购买Kindle", "title_en": "Emails Reveal Why Steve Jobs and Phil Schiller Blocked In-App Kindle Purchases", "transed": 1, "url": "https://www.macrumors.com/2020/07/31/emails-apple-blocked-kindle-purchases/", "via": "", "real_tags": ["乔布斯", "购买", "reveal", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "6cecca500a8c1686c708aad077e38612.png", "infoid": 1015544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在你有额外的一周时间(由拖延者的守护神圣埃克斯佩图斯提供)，来获得早起的储蓄，以扰乱于9月14-18日举行的2020年。在新的也是最后的最后期限之前购买通行证-8月7日晚上11：59。(PT)-节省高达300美元。谁说祈祷(或世俗的恳求)得不到回应？\n您的通行证开启了为期五天的中断之门-有史以来规模最大、持续时间最长的TechCrunch会议。吸引数以千计的与会者和数百家来自世界各地的创新型早期创业公司，您将找不到更好的时间、地点或机会来加快您的业务发展。\n世界级的演讲者。在颠覆阶段倾听并参与技术、业务和投资领域的主要声音。红杉资本(Sequoia Capital)的罗洛夫·博塔(Roelof Botha)、尤里卡(Ureeka)的梅丽莎·布拉德利(Melissa Bradley)和斯拉克(Slake)的塔马尔·耶霍舒亚(Tamar。这是你到目前为止在舞台上看到的东西。\n世界级初创企业。探索数百家在数字创业巷展出的创新创业公司-包括TC Top Pick。这位精英干部通过了我们严格的筛选过程，获得了梦寐以求的称号，你很难找到一组更多样化、更有趣的创业公司。\n世界级的网络。我们的人工智能网络平台CrunchMatch简化了与创始人、潜在客户、研发团队、工程师或投资者的联系。时间表1：1视频会议，并举行招聘或延长推介会议。CrunchMatch在中断前几周推出，让你有更多的时间去侦察、审查和安排日程。\n世界级的投手。不要错过Startup Battlefield，这场总是史诗般的推介比赛已经推出了900多家初创公司，其中包括TripIt、Mint、Dropbox等许多大牌公司。今年的一大批初创公司承诺要为吹嘘的权利和10万美元的现金奖金而不惜重金。\n还需要另一个去的理由吗？借鉴辛巴连锁店创始人乔尔·内迪格的做法：\n我们的主要目标是让人们了解Simba Chain平台的功能。参加Disrupt是让你的名字传开并建立你的客户基础的好方法。\n现在是时候让你们所有最后一刻的棒棒糖们行动起来，利用这第二次，也是最后一次机会，节省高达300美元的费用了。在8月7日晚上11：59之前购买通行证。(PT)。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "You now have an extra week (courtesy of  Saint Expeditus, the patron saint of procrastinators), to score early-bird savings to  Disrupt 2020, which takes place September 14-18.  Buy your pass before the new and final deadline —  August 7 at 11:59 p.m. (PT) — and  save up to $300. Who says prayers (or secular entreaties) go unanswered?\n Your pass opens the door to five days of  Disrupt — the biggest, longest TechCrunch conference ever. Drawing thousands of attendees and hundreds of innovative early-stage startups from around the world, you won’t find a better time, place or opportunity to accelerate the speed of your business.\n   World-class speakers. Hear and engage with  leading voices in tech, business and investment across the Disrupt stages. Folks like Sequoia Capital’s Roelof Botha, Ureeka’s Melissa Bradley and Slack’s Tamar Yehoshua — to name just a few.  Here’s what you can see onstage so far.\n World-class startups. Explore hundreds of innovative startups  exhibiting in Digital Startup Alley — including the TC Top Picks. This elite cadre made it through our stringent screening process to earn the coveted designation, and you’ll be hard-pressed to find a more varied and interesting set of startups.\n World-class networking.  CrunchMatch, our AI-powered networking platform, simplifies connecting with founders, potential customers, R&amp;D teams, engineers or investors. Schedule 1:1 video meetings and hold recruitment or extended pitch sessions. CrunchMatch launches weeks before Disrupt to give you more time to scout, vet and schedule.\n World-class pitching. Don’t miss  Startup Battlefield, the always-epic pitch competition that’s launched more than 900 startups, including big-time names like TripIt, Mint, Dropbox and many others. This year’s crop of startups promises to throw down hard for bragging rights and the $100,000 cash prize.\n Need another reason to go? Take a page out of SIMBA Chain founder Joel Neidig’s playbook:\n Our primary goal was to make people aware of the SIMBA Chain platform capabilities. Attending Disrupt is great way to get your name out there and build your customer base.\n It’s time for all you last-minute lollygaggers to get moving and take advantage of this second, final chance to save up to $300.  Buy your pass before  August 7 at 11:59 p.m. (PT).\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by   filling out this form .", "posttime": "2020-08-01 08:24:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,储蓄,bird", "title": "\n扰乱2020年早鸟储蓄延长至下周", "title_en": "\n\t\t\t\tDisrupt 2020 early-bird savings extended until next week\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/31/disrupt-2020-early-bird-savings-extended-until-next-week/", "via": "", "real_tags": ["2020", "储蓄", "bird"]}, {"category": "", "categoryclass": "", "imagename": "bae296f2e4e5e98a41bd6474920f97d9.jpg", "infoid": 1015543, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在重新考虑其Cortana助手，宣布将从2021年开始关闭目前的iOS和Android应用程序，结束Cortana对Harman Kardon Invoke智能扬声器的支持，并从第一代Surface耳机中删除最初的Cortana功能。\n这些变化还需要几个月的时间，但这标志着微软又迈出了一大步，将Cortana从谷歌助手(Google Assistant)或Alexa转向更专业、更注重工作效率的助手-微软今年早些时候已经开始对Windows 10版本的Cortana进行改变。(为此，微软还将已经宣布的Windows第三方Cortana Skills的日落日期定在9月7日。)。\n取而代之的是，微软将专注于其生产力功能，这些功能将Cortana重新定位为Microsoft 365软件套件的一部分，并以Outlook和Teams应用程序中改进的Windows 10功能和集成的Cortana功能作为替代。它没有最初的Cortana功能齐全-后者提供了智能家居控制和音乐集成等额外功能-但通过提供不那么广泛的功能，微软希望创造出一种更好地补充现有软件、减少与谷歌(Google)和亚马逊(Amazon)等老牌公司直接竞争的产品。\n微软还为Harman Kardon Invoke用户提供了一张价值50美元的礼品卡作为安慰，他们将受到Cortana移除的最大影响-这实际上将在明年固件更新到来时将这款以前的智能设备变成一个昂贵的蓝牙扬声器。最初的Surface耳机的所有者(他们也将看到他们的Cortana体验被移除)也被提供了一张价值25美元的礼品卡，以弥补缺失的服务。", "note_en": "Microsoft is rethinking its Cortana assistant, announcing that  it will shut down the current iOS and Android apps, end Cortana support for the  Harman Kardon Invoke smart speaker, and remove the original Cortana functionality from the first-generation  Surface Headphones starting in 2021.\n These changes are still a few months away, but it marks another big step for Microsoft in pivoting Cortana away from a Google Assistant or Alexa alternative to a more specialized, productivity-focused assistant —  changes the company has already started making on the Windows 10 version of Cortana earlier this year. (To that end, Microsoft also put a September 7th date on the already-announced sunsetting of third-party Cortana skills for Windows.)\n  Instead, Microsoft will be focusing on its productivity features that repurpose Cortana as a part of the Microsoft 365 suite of software, citing the revamped Windows 10 functions and integrated Cortana features in the Outlook and Teams apps as replacements. It’s not as full-featured as the original Cortana — which offered additional functions like smart home controls and music integration — but by offering a less broad set of features, Microsoft is hoping to create a product that better complements its existing software and competes less directly with established players like Google and Amazon.\n Microsoft is also offering a consolation offer of a $50 gift card for Harman Kardon Invoke owners, who’ll be most impacted by the removal of Cortana — which effectively will turn the formerly smart device into a pricey Bluetooth speaker when the firmware update arrives next year. Owners of the original Surface Headphones (who will also see their Cortana experience removed) are also being offered a $25 gift card to make up for the missing service.", "posttime": "2020-08-01 08:23:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,android,ios,微软,关闭", "title": "微软正在关闭包括iOS和Android在内的多个设备上的Cortana", "title_en": "Microsoft Is Shutting Down Cortana On Multiple Devices, Including iOS and Android", "transed": 1, "url": "https://www.theverge.com/2020/7/31/21349827/microsoft-cortana-shutdown-devices-ios-android", "via": "", "real_tags": ["microsoft", "android", "ios", "微软", "关闭"]}, {"category": "", "categoryclass": "", "imagename": "e13fc985615e254926d53d89e24b13b2.jpeg", "infoid": 1015542, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，博物馆一直在寻求改变他们在数字时代的使命。冠状病毒的大流行把这种转变放在了最重要的位置。\n今年春天，当博物馆被迫关闭实体大门时，他们同时增强了在线产品，为公众创造了新的方式，让公众虚拟地体验他们的藏品和空间。事实上，内部人士和顾问说，博物馆的行为越来越像媒体制作公司，试图以既能娱乐又能教育的方式讲述他们的藏品和展品背后的故事。他们的目标是继续与传统观众联系-那些经常参观博物馆并经常成为会员和捐赠者的观众-同时通过播客、虚拟旅游、YouTube视频和社交媒体帖子接触到新的观众。\n“我们是内容提供商，”纽约现代艺术博物馆馆长格伦·劳里(Glenn Lowry)说，内容是“我们收藏的物品，这些物品的历史，以及人们对它们的反应的历史。”\n这种新的数字内容最终是否会为博物馆带来额外的收入还有待观察。但一些专家表示，博物馆如果想保持相关性，就必须进化。\n“他们必须与其他类型的媒体竞争--电影、电视，”里奇·切里(Rich Cherry)说，他是加州卡尔弗城咨询公司博物馆运营公司(Museum Operations)的管理合伙人。“这是他们的竞争对手。”\n当然，许多机构实际上早在大流行开始之前就已经与人们接触了。\n许多博物馆在其网站上提供当前展览和空间的虚拟之旅，以及为儿童提供游戏和互动功能。一些博物馆允许在线参观者上传他们最喜欢的作品的图片，并“策划”他们自己的私人展品，而另一些博物馆则有可下载的应用程序，允许面对面的参观者将手机对准艺术品，并听取关于这件作品的讨论。\n但这场大流行让人们清楚地意识到，与他们所在的地方接触的重要性-这一点越来越多地在网上-并为他们提供定期提供的新内容。\n大都会艺术博物馆(Metropolitan Museum Of Art)最出名的可能是它庞大的美术馆风格的建筑，里面藏有百科全书式的文物，但它也为世界各地的观众制作内容。大都会博物馆馆长马克斯·霍林(Max Hollein)说，博物馆的网站“是这种参与的主要平台”。\n大都会博物馆于3月13日关闭，计划于8月29日重新开放。在关闭期间，大都会博物馆推出了一种增强现实体验，允许拥有iOS设备的在线游客将一个名为泽米科霍巴(Zemícohoba)的古老雕塑投影到自己的家中或他们可能在的任何地方。当大都会博物馆馆长描述加勒比海塔伊诺人如何在仪式上使用这些物品时，用户可以旋转展台。大都会博物馆还在其网站上推出了一个分享工具，供想要将大都会博物馆的艺术品融入到他们在任天堂(Nintendo)广受欢迎的视频游戏“动物穿越：新地平线”(Animal Crossing：New Horizons)中创建的空间的游戏玩家使用。\n大都会博物馆表示，在关闭对公众开放的一周后，其MetKids页面的流量增加了九倍，孩子们可以在那里观看有关如何从德加画作中重新创造舞蹈场景、创建沾满污渍的玻璃窗或做日本折纸等内容的视频。其Met 360系列短视频的流量飙升了4000%以上，这些视频提供大都会博物馆一些最受欢迎的音乐空间的虚拟游览。\n尽管访问量较最初的高峰有所放缓，但大都会博物馆的一位女发言人说，3月12日至5月14日期间，约有550万游客访问了博物馆的网站和社交媒体页面，比1月8日至3月11日期间增长了34%。\n周四重新开放的芝加哥艺术学院(Art Institute Of Chicago)在关闭期间增加了网站上提供的视频数量，每周都会上传关于永久收藏品的新互动功能。5月21日重新开放的休斯顿美术馆(Museum Of Fine Arts)于3月和4月在其Facebook Live页面上举办了免费的虚拟瑜伽课。(在过去的几年里，博物馆与健康合作伙伴合作，在一些户外空间提供免费锻炼课程，作为社区健康倡议的一部分。)。\n纽约的古根海姆博物馆(Guggenheim Museum)和华盛顿特区的国家自然历史博物馆(National Museum Of Natural History)都表示，在3月份关闭后的头几周里，他们看到在线参与度大幅增加，对各自网站上提供的虚拟旅游的兴趣尤其浓厚。\n古根海姆博物馆说，从3月13日到6月底，其可搜索艺术品数据库的页面浏览量几乎比前一年翻了一番，而其博客的页面浏览量增加了72%。\n据博物馆顾问切里说，虽然许多博物馆报告说，自关闭的头几周以来，他们的在线流量已经放缓，但仍然高于Covid之前的水平。随着文化机构欢迎公众回来，挑战将是保持这些在线游客的长期兴趣，并理顺实体博物馆和虚拟博物馆之间的关系。\n现代美术馆的劳里说，这是一项正在进行的工作。但“我们不会倒退，”他说。“我们不会回到以前的样子。”\n大都会博物馆的霍林说，当博物馆重新开放时，他们将欢迎在过去几个月里变得更加精通数字技术的人回来。“他们将学会如何进行虚拟交流，如何获取信息，以及如何在不在场的情况下体验事物，”他说。展望未来，他认为，博物馆衡量其使命成功的标准，不仅是通过门前参观的人数和他们创造了多少收入，还将通过数据分析-“跟踪人口统计数据，某人在网站上停留的时间，他们从哪里访问网站，以及他们在网站上寻找的信息类型。”\n业内人士说，到目前为止，几乎没有博物馆创造了基于数字内容的新商业模式，但一些博物馆正在探索这一想法。\n印第安纳波利斯艺术博物馆(Indianapolis Museum Of Art)的首席财务官杰里·怀斯(Jerry Wise)表示：“我们肯定已经开始讨论这个问题了。”该博物馆位于一个还包括自然保护区和正式花园的校园里。“这种教育信息有没有可以瞄准和传递的消费领域？有足够的人想要这个吗？这会是可持续的吗？这一切都很新鲜，但我们在这里进行这些对话，其他博物馆的人也在进行这些对话。“。\n不过，就目前而言，博物馆正在谨慎行事，认为他们的主要工作仍然是让人们通过实体博物馆的大门。\n休斯顿美术馆(Museum Of Fine Arts)馆长加里·廷特罗(Gary Tinterow)表示：“在博物馆领域，关于虚拟参观者是否等同于实体博物馆的实际参观者的争论由来已久，答案是他们并不等同，”休斯顿美术馆馆长加里·廷特罗(Gary Tinterow)表示。人们来到实体博物馆购买入场券，也许是会员卡；他们可能会在咖啡馆吃点东西，或者从礼品店买些东西。“网上的大众想要免费的内容，”他说。“一旦他们到达付费墙，他们就会消失。”\n许多博物馆馆长认为，实体博物馆和虚拟博物馆是平行的，而不是相互竞争的实体，他们认为，即使在线内容的数量增加，普通公众也会继续想要参观这些机构。\n“博物馆是有使命的社交空间，”劳里先生说。“艺术品与其他人存在于一个空间中”，这表明那些欣赏艺术品的人希望在体验过程中有其他人在他们身边。他说，社交媒体是“创建社区的有效方式”。你可以让谈话继续进行下去。“\n你虚拟地参观过任何博物馆吗？与此相比，这种体验如何？它可能会如何改进？加入下面的对话。", "note_en": "For years, museums have been seeking to transform their missions for the digital age. The coronavirus pandemic has put that transformation front and center.\n  When museums were forced to shut their physical doors this spring, they simultaneously enhanced their online offerings, creating new ways for the public to experience their collections and spaces virtually. In fact, say insiders and consultants, museums increasingly are behaving almost like media-production companies, seeking to tell the stories behind their collections and exhibits in ways that entertain, as well as educate. Their goal is to continue to connect with traditional audiences—those who regularly visit museums and often become members and donors—while reaching out to new audiences via podcasts, virtual tours, YouTube videos and social-media posts.\n  “We are content providers,” says Glenn Lowry, director of New York’s Museum of Modern Art, with the content being “the objects in our collection, the history of those objects and the history of how people reacted to them.”\n  Whether this new digital content eventually generates additional revenue for museums remains to be seen. But some experts say museums have to evolve if they want to stay relevant.\n    “They have to compete with other types of media out there—films, television,” says Rich Cherry, managing partner at Museum Operations, a Culver City, Calif., consulting firm. “That’s their competition.”\n    Of course, many of the institutions were already engaging with people virtually well before the pandemic took hold.\n  Many museums offer virtual tours of their current exhibitions and spaces on their websites, as well as games and interactive features for children. Some museums allow online visitors to upload images of their favorite works and “curate” their own private exhibits, while others have downloadable apps that allow in-person visitors to point their phones at artwork and listen to a discussion about the piece.\n  But the pandemic drove home the importance of engaging with people where they are—which increasingly is online—and offering them a regular supply of new content.\n  The Metropolitan Museum of Art may be best known for its sprawling beaux-arts-style building housing an encyclopedic collection of cultural objects, but it also produces content for a world-wide audience. The museum’s website “is a major platform for that engagement,” says Met director Max Hollein.\n    The Met, which closed on March 13 and plans to reopen Aug. 29, launched an  augmented-reality experience during the shutdown that allows online visitors with iOS devices to project an ancient sculpture known as a zemí cohoba stand into their own homes or wherever they might be. Users can rotate the stand as a Met curator describes how such objects were used in ceremonies by the Taíno people of the Caribbean. The Met also launched a  share tool on its website for gamers who want to incorporate artwork from the Met into the spaces they create in “Animal Crossing: New Horizons,” a popular videogame from Nintendo.\n  The Met said that the week after it closed its doors to the public, there was a ninefold increase in traffic on its MetKids pages, where children can watch videos on how to re-create a dance scene from a Degas painting, create a stain-glassed window or do Japanese Origami, among other things. Traffic for its Met 360 series of short videos that provide virtual tours of some of the Met’s most popular spaces set to music surged more than 4,000%.\n  While traffic has slowed from that initial spike, a Met spokeswoman says about 5.5 million visitors came to the museum’s website and social-media pages between March 12 and May 14, up 34% from the period between Jan. 8 and March 11.\n  The Art Institute of Chicago, which reopened on Thursday, stepped up the number of videos it offers on its website during the shutdown, uploading new interactive features about objects in its permanent collection each week. The Museum of Fine Arts, Houston, which reopened May 21, hosted free virtual yoga classes on its Facebook Live page in March and April. (Over the past several years, the museum has teamed up with health partners to offer free exercise sessions in some of its outdoor spaces as part of a community-wellness initiative.)\n  Both the Guggenheim Museum in New York and the National Museum of Natural History in Washington, D.C., say they saw huge increases in online engagement in the first few weeks after they closed in March, with interest especially strong for the virtual tours each offers on its website.\n  The Guggenheim says page views within its searchable database of artwork almost doubled from March 13 through the end of June compared with the preceding year, while page views on its blogs increased 72%.\n  While many museums report that their online traffic has slowed since the early weeks of the shutdowns, it remains higher than pre-Covid, according to Mr. Cherry, the museum consultant. As cultural institutions welcome the public back, the challenge will be to keep those online visitors interested over the long haul and to sort out the relationship between the physical and virtual museum.\n  That is a work in progress, says the Modern’s Mr. Lowry. But “we won’t go backward,” he says. “We won’t revert to what we were before.”\n  The Met’s Mr. Hollein says that when museums reopen, they will be welcoming back people who have become more digitally savvy over the past few months. “They will have learned how to communicate virtually, how to access information and how to experience things without being there,” he says. Going forward, he believes museums will measure the success of their missions not just by the number of visitors coming through their doors and how much revenue they generate, but by data analytics—“tracking demographics, how long someone stays on a site, where they are accessing the website from, what type of information they are looking for on the site.”\n    So far, few if any museums have created new business models based on digital content, but some are exploring the idea, insiders say.\n  “We definitely have started to talk about this,” says Jerry Wise, chief financial officer at the Indianapolis Museum of Art, which is located on a campus that also includes a nature preserve and formal gardens. “Is there a consumer landscape that this educational information can target and deliver? Are there enough people who want this? Will it be sustainable? This is all so new, but we are having these conversations here, and people at other museums are having them, too.”\n  For now, though, museums are moving cautiously, assuming that their principal job is still to get people through the doors of the physical museum.\n  “There has been a longstanding debate within the museum field over whether virtual visitors are equivalent to actual visitors to the physical museum, and the answer is that they aren’t equivalent,” says Gary Tinterow, director of the Museum of Fine Arts, Houston. People coming to the physical museum purchase admissions, perhaps memberships; they may eat something at the cafe or buy something from the gift shop. The “masses online want free content,” he says. “Once they reach a paywall, they’re gone.”\n  Many museum directors see the physical and the virtual museum as parallel, not competing, entities, believing that the general public will continue to want to visit these institutions even if the volume of online content grows.\n  “Museums are social spaces with a mission,” Mr. Lowry says. “Artworks exist in a space with other people,” suggesting that those who look at art want other people around them during the experience. Social media, he says, is “an effective way to create community. You get a conversation going.”\n    Have you visited any museums virtually? How does the experience compare, and how might it be improved? Join the conversation below.", "posttime": "2020-08-01 08:23:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,内容,museums,博物馆", "title": "新冠肺炎敦促博物馆改进其在线服务，包括虚拟旅游，因为它们正在探索基于数字内容的潜在商业模式", "title_en": "COVID-19 has pushed museums to improve their online offerings, including virtual tours, as they explore potential business models based on digital content", "transed": 1, "url": "https://www.wsj.com/articles/pandemic-pushes-museums-further-into-digital-age-11596196801?mod=djemalertNEWS", "via": "", "real_tags": ["商业", "内容", "museums", "博物馆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015541, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "好的名字是很难想出来的。如果你找到了一个：你有没有考虑过你的潜在名字在另一种语言中可能意味着什么？如果是淫秽的东西怎么办？\nWordSafety.com在19种语言中检查您的单词是否有脏话和不想要的联想。我们还做语音匹配，这样你就可以找出可能有问题的发音。", "note_en": "Good names are difficult to come up with. And if you&#39;ve found one: have you considered what your potential name might mean in another language? What if it&#39;s something obscene?\n  WordSafety.com checks your word against swear words and unwanted associations in  19 languages. We also do phonetic matching, so you can catch pronounciations that might be problematic.", "posttime": "2020-08-01 08:22:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "检查,check,可能", "title": "WordSafety：检查名称是否有外语中不需要的含义", "title_en": "WordSafety: Check a name for unwanted meanings in foreign languages", "transed": 1, "url": "http://wordsafety.com/", "via": "", "real_tags": ["检查", "check", "可能"]}, {"category": "", "categoryclass": "", "imagename": "52d430c916f0e0a98ceaf9855a1a8043.jpg", "infoid": 1015538, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "检察官宣布逮捕了一名坦帕青少年，据信他是黑客攻击知名Twitter账户的幕后黑手，还有另外两名嫌疑人。\n17岁的格雷厄姆·伊万·克拉克(Graham Ivan Clark)于7月31日在坦帕被捕，他面临30项重罪指控，罪名是在美国各地诈骗人们，延续7月15日比尔·盖茨(Bill Gates)、巴拉克·奥巴马(Barack Obama)和埃隆·马斯克(Elon Musk)等知名推特账户遭受的“比特欺骗”(bit-Con)黑客攻击。\n与此同时，来自英国博格诺雷吉斯的19岁的梅森·谢泼德和来自奥兰多的22岁的尼玛·法泽利在加州联邦法院被起诉。\n尽管联邦调查局和美国司法部也对这名青少年的案件进行了调查，但希尔斯堡州检察官办公室正在起诉克拉克，因为佛罗里达州的法律允许在适当的时候将未成年人作为成年人在这样的金融欺诈案中起诉。联邦调查局和司法部将在整个起诉过程中继续与该办公室合作。\n“这名被告住在坦帕，他在这里犯罪，他将在这里被起诉，”沃伦说。\n7月15日，黑客攻击导致巴拉克·奥巴马、乔·拜登、迈克·布隆伯格和一些科技亿万富翁的账户发出虚假推文，其中包括亚马逊首席执行官杰夫·贝佐斯、微软联合创始人比尔·盖茨和特斯拉首席执行官埃隆·马斯克。名人坎耶·韦斯特(Kanye West)和他的妻子金·卡戴珊·韦斯特(Kim Kardashian West)也遭到黑客攻击。\n这些推文提出，每向匿名比特币地址发送1000美元，就会寄出2000美元。\n“这些罪行是以名人和名人的名义犯下的，但他们并不是这里的主要受害者。这个“比特骗局”的目的是从全国各地的普通美国人那里偷钱，包括佛罗里达州的这里。这场大规模的诈骗就是在我们的后院策划的，我们不会容忍的。“沃伦说。\n调查显示，克拉克是最近Twitter黑客事件的策划者。据希尔斯堡州检察官办公室称，克拉克的诈骗计划窃取了知名人士的身份，以他们的名义发布信息，指导受害者将比特币发送到与克拉克有关的账户，仅一天就收获了超过10万美元的比特币。作为一种加密货币，比特币如果在骗局中被盗，很难追踪和追回。\n“我要祝贺我们的联邦执法伙伴-加州北区联邦检察官办公室、联邦调查局、美国国税局和特勤局-以及佛罗里达州执法部门。他们迅速开展工作，调查并查明复杂而广泛的欺诈行为的肇事者，“州检察官沃伦说。\n克拉克被控一项有组织欺诈罪、17项通信欺诈罪、一项欺诈使用个人信息罪、10项欺诈使用个人信息罪和一项未经授权访问计算机或电子设备的罪名。\n“共同努力，我们将追究这名被告的责任，”沃伦说。“骗取人们的血汗钱总是错误的。无论你是当面还是在互联网上利用某人，试图窃取他们的现金或加密货币--这是欺诈，这是非法的，你不会逍遥法外的。“。\n推特此前表示，黑客利用这部手机愚弄了这家社交媒体公司的员工，让他们获得了访问权限。它说，目标是“通过电话鱼叉式网络钓鱼攻击的一小部分员工”。\n该公司在推特上写道：“这次攻击有赖于一次重大而协调的尝试，目的是误导某些员工，并利用人类的漏洞进入我们的内部系统。”\n该公司表示，在窃取员工凭证并进入Twitter系统后，黑客能够攻击其他有权使用账户支持工具的员工。\n黑客的目标是130个账户。他们设法从45个账户发推文，访问36个账户的直接消息收件箱，并从7个账户下载Twitter数据。", "note_en": "Prosecutors announced the arrest of a Tampa teenager believed to be the mastermind behind the  hacking of prominent Twitter accounts, along with two other suspects.\n  Graham Ivan Clark, 17, was arrested in Tampa on July 31 and faces 30 felony charges for scamming people across America, perpetuating the “Bit-Con” hack of prominent Twitter accounts including Bill Gates, Barack Obama, and Elon Musk on July 15.\n      Meanwhile, Mason Sheppard, 19, of Bognor Regis, U.K., and Nima Fazeli, 22, of Orlando, were charged in California federal court.\n Although the case against the teen was also investigated by the FBI and the U.S. Department of Justice, the Hillsborough State Attorney’s Office is prosecuting Clark because Florida law allows minors to be charged as adults in financial fraud cases such as this when appropriate. The FBI and the Department of Justice will continue to partner with the office throughout the prosecution.\n      “This defendant lives here in Tampa, he committed the crime here, and he’ll be prosecuted here,” Warren said.\n    The hacks led to bogus tweets being sent out July 15 from the accounts of Barack Obama, Joe Biden, Mike Bloomberg and a number of tech billionaires including Amazon CEO Jeff Bezos, Microsoft co-founder Bill Gates and Tesla CEO Elon Musk. Celebrities Kanye West and his wife, Kim Kardashian West, were also hacked.\n The tweets offered to send $2,000 for every $1,000 sent to an anonymous Bitcoin address.\n  “These crimes were perpetrated using the names of famous people and celebrities, but they’re not the primary victims here. This ‘Bit-Con’ was designed to steal money from regular Americans from all over the country, including here in Florida. This massive fraud was orchestrated right here in our backyard, and we will not stand for that,” Warren said.\n The investigation revealed Clark was the mastermind of the recent hack of Twitter. Clark’s scheme to defraud stole the identities of prominent people, posted messages in their names directing victims to send Bitcoin to accounts associated with Clark, and reaped more than $100,000 in Bitcoin in just one day, according to the Hillsborough State Attorney’s Office. As a cryptocurrency, Bitcoin is difficult to track and recover if stolen in a scam.\n  “I want to congratulate our federal law enforcement partners—the US Attorney’s Office for the Northern District of California, the FBI, the IRS, and the Secret Service—as well as the Florida Department of Law enforcement. They worked quickly to investigate and identify the perpetrator of sophisticated and extensive fraud,” State Attorney Warren said.\n Clark has been charged with one count of organized fraud, 17 counts of communications fraud, one count of fraudulent use of personal information, 10 counts of fraudulent use of personal information and one count of access computer or electronic device without authority.\n “Working together, we will hold this defendant accountable,” Warren said. “Scamming people out of their hard-earned money is always wrong. Whether you’re taking advantage of someone in person or on the internet, trying to steal their cash or their cryptocurrency—it’s fraud, it’s illegal, and you won’t get away with it.”\n  Twitter previously said hackers used the phone to fool the social media company&#39;s employees into giving them access. It said targeted “a small number of employees through a phone spear-phishing attack.”\n “This attack relied on a significant and concerted attempt to mislead certain employees and exploit human vulnerabilities to gain access to our internal systems,” the company tweeted.\n After stealing employee credentials and getting into Twitter&#39;s systems, the hackers were able to target other employees who had access to account support tools, the company said.\n The hackers targeted 130 accounts. They managed to tweet from 45 accounts, access the direct message inboxes of 36, and download the Twitter data from seven.", "posttime": "2020-08-01 07:52:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,重罪,teen,账户", "title": "坦帕青少年因黑客攻击知名Twitter账户而面临30项重罪指控", "title_en": "Tampa teen faces 30 felony charges for hacking prominent Twitter accounts", "transed": 1, "url": "https://www.foxla.com/news/tampa-teen-faces-30-felony-charges-for-hacking-prominent-twitter-accounts-2-others-charged", "via": "", "real_tags": ["黑客", "重罪", "teen", "账户"]}, {"category": "", "categoryclass": "", "imagename": "73cab548e3abe6d184da534693d0891d.jpg", "infoid": 1015537, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国人口普查局的一项调查显示，随着增加的失业救济金和联邦暂缓驱逐令到期，2,400万美国人表示，他们几乎没有机会支付下个月的租金。\n处于危险中的人中，来自黑人和西班牙裔家庭的比例不成比例，这两个群体首当其冲地承受了新冠肺炎大流行对健康和经济的负面影响。\n虽然国会正在努力谈判新的冠状病毒救济立法，但专家警告称，避免驱逐和丧失抵押品赎回权危机的时间几乎已经不多了。\n城市研究所(Urban Institute)负责住房金融政策的副总裁阿兰娜·麦卡戈(Alanna McCargo)表示：“我们即将从巨大的悬崖上坠落，驱逐事件将大幅增加。”\n美国人口普查局的家庭脉搏调查(Household Pulse Survey)数据显示，本月，近28%的黑人租房者表示，他们没有支付上个月的房租，约46%的人表示，他们对自己有能力支付下个月的房租略有信心或没有信心；而拉美裔租房者面临着类似的经济压力：22%的人表示，他们错过了上个月的房租，46%的人担心下个月交不到房租。\n这些数字大约是白人租房者报告的两倍。约13%的人表示，他们上个月交不起房租，23%的人担心他们没有钱支付下个月的房租。\n专家说，这种差距反映了自大衰退以来不断加剧的经济适用房危机。在相对稳健的经济时期，将收入的30%-50%或更多花在住房成本上的人正被推到边缘。\n“我们的住房系统反映了巨大的种族差异。而有色人种被驱逐的风险最大，“全国低收入住房联盟主席黛安·延特尔(Diane Yentel)说。“新冠肺炎加剧了这些不平等。”\n涵盖居住在拥有联邦支持抵押贷款的建筑物中的租户的驱逐禁令已于周五到期，大多数州每周额外发放的600美元大流行失业援助于7月25日结束。\n麦卡戈说：“我们真的面临的情况不仅是健康危机，而且当你开始看到人们在一场大流行中失去屋顶时，这不仅是一个健康危机，而且还会变成一场重大的住房危机，这是呼吁你呆在家里作为处方之一的情况。”\n尽管随着各州开业，经济开始略有反弹，但失业申请的增加表明，一些重返工作岗位的人可能再次失业。\n根据人口普查数据，在全国范围内，62%的西班牙裔和57%的黑人受访者报告说，自疫情开始以来，他们失去了就业收入，相比之下，白人的这一比例为45%。\n这场大流行肆虐了酒店业和零售业，以及其他工资较低的行业，在这些行业，黑人和拉丁裔工人在劳动力中所占的比例可能不成比例。\n麦卡戈说：“我们看到的就业领域与黑人和西班牙裔家庭之间有着巨大的联系，黑人和西班牙裔家庭基本上整体上都在遭受重创，不仅是在住房付款方面，而且在经济生活中的所有方面都是如此。”", "note_en": "As enhanced unemployment benefits and a federal eviction moratorium expire, 24 million Americans say they have little to no chance of being able to pay next month’s rent, a U.S. Census Bureau survey shows.\n   A disproportionate share of those in danger come from Black and Hispanic households, two groups who have borne the brunt of  negative health and economic effects from the COVID-19 pandemic.\n   While Congress works to negotiate new coronavirus relief legislation, experts warn the time to ward off an eviction and foreclosure crisis has almost run out.\n “We&#39;re about to fall off a massive cliff and see a major spike in evictions,” says Alanna McCargo, vice president of housing finance policy at the Urban Institute.\n This month, nearly 28% of Black renters say they haven’t paid last month’s rent, and about 46% say they have slight or no confidence they’ll be able to pay next month’s rent, according to figures from the Census Bureau’s  Household Pulse Survey. Hispanic renters face similar economic strain: 22% say they missed last month’s rent and 46% fear they won’t make rent next month.\n    Those figures are roughly double what white renters report. About 13% say they couldn’t make rent last month, and 23% fear they won’t have the money for next month’s rent.\n The disparities reflect an affordable housing crisis that has grown since the Great Recession, experts say. People who were spending 30%-50% or more of their income on housing costs in relatively solid economic times are being pushed to the brink.\n “Our housing system reflects tremendous disparities in race. And people of color are most at risk for evictions,” says Diane Yentel, president of the National Low Income Housing Coalition. “These inequities are being compounded by COVID-19.”\n An  eviction moratorium that covers renters living in buildings with federally backed mortgages expired Friday, and the additional $600 per week in pandemic unemployment aid for most states ended July 25.\n “We&#39;re really facing a situation that is not only a health crisis but becomes a major housing crisis when you start to see people losing their roofs in a pandemic that&#39;s calling for you to stay at home as one of the prescriptions,” McCargo says.\n Though the economy began to bounce back slightly as states opened for business, an  uptick in unemployment filings indicates some people who went back to work may again be out of a job.\n Nationwide, 62% of Hispanic and 57% of Black survey respondents report losing employment income since the start of the pandemic, compared with 45% for whites, according to the census figures.\n The pandemic ravaged the hospitality and retail sectors, as well as other lower-wage sectors where Black and Latino workers make up a disproportionate share of the workforce.\n “There&#39;s a huge connection between that sector of employment that we&#39;re seeing hardest hit with Black and Hispanic households who are basically being devastated overall, not only in their housing payments but just sort of everything in their economic lives,” McCargo says.", "posttime": "2020-08-01 07:52:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,担心,fear,住房", "title": "2400万美国人担心错过下一次租金支付，因为福利枯竭", "title_en": "24M Americans fear missing next rent payment as benefits dry up", "transed": 1, "url": "https://www.usatoday.com/in-depth/graphics/2020/07/24/24-million-americans-say-they-have-little-no-chance-being-able-pay-next-months-rent-eviction/5497764002/", "via": "", "real_tags": ["美国", "担心", "fear", "住房"]}]