[{"category": "", "categoryclass": "", "imagename": "52d43a56990ef4c5a0997b197747e930.jpg", "infoid": 1066575, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据Lawstreet的一份报告，WD已搬迁到与其SMR WD红色硬盘相关的虚假广告的持续的类行动诉讼。拟议的解决方案追求WD＆＃39的普遍批评的批评。在某些硬盘中的一些硬盘上的偷区使用较慢的凸起的磁记录（SMR）技术，而不披露营销材料或规格表。值得注意的是，这一解决方案仅适用于对西方数码上的多个诉讼行动之一。随着解决的，WD将同意与SMR技术的WD Red NAS HDDS＆＃39; T适合NAS和RAID使用。谈判术语达到270万美元，投诉人每次购买的每次驱动器收到4美元至7美元的现金，最高税款调整为85％的零售价格。这意味着在160美元的范围内每个驱动器的最大损坏（尽管由于持续的硬盘短缺导致的价格膨胀，但这很难计算）。你赢得了＆＃39; t需要购买证明来制定索赔。 WD之前披露于TOM＆＃39;硬件2到6TB WD红色硬盘，其中包括SMR技术。该技术能够提高能力并导致较低的制造成本，但它以牺牲性能为代价，特别是随机写入活动。除了一般的性能较慢，这也可能导致目标NAS使用情况的过度重建时间（重新定义），特别是如果它们使用ZFS RAID阵列。结算价值为10周的谈判的高潮以及律师＆＃39;费用和其他费用。 WD还同意在接下来的四年内完全披露其驱动器中使用的录制技术，包括在包装及其网页上。针对WD的原始虚假广告索赔涉及一波类动作诉讼，甚至呼吁禁止销售NAS使用的SMR驱动器。该公司澄清了该驱动器使用SMR技术，甚至发布了新的驱动器来解决问题。 WD ISN＆＃39; T唯一的HDD制造商在没有完整披露的情况下运送较慢的SMR技术 - 东芝和希捷也在没有完整披露的情况下发货。我们不了解对这些公司的任何待处理诉讼。我们确实知道在不同地区的WD上提交了多个类行动诉讼。法律报告称，在原告修改投诉时，一项此类诉讼已被驳回。\n      律师将在汉普顿享受夏季住宅。你得到4美元到7美元。听起来很愉快。 / s.\n   回复\n 当故事破裂时，我是一个买了一些未解决的阵列的驱动器的驱动器。我添加了ZFS插头并用垃圾填充它，然后强制阵列重建奇偶校验磁盘。它在6GB驱动器上深入缓慢。我将用Ryzen 2400g CPU服用5天。当另一个失败可能意味着死亡时不完全安慰。由于我在我的1个月内窗口中，我将他们送回亚马逊，因为WD支持Didn＆＃39; T向我提供了一个升级选项（我会支付的）我以来已经离开了希捷Ironwolf和Haven＆＃39;看起来背部。我有点担心奇偶校验检查（57c）上的temps（std运行为55c max），但我的驱动器笼可能只需要良好的风扇流清洁。或者我可能需要调整风扇曲线。到目前为止，只有警告＆＃39;我看到的，由于振动，已经看过头调，这是漂亮的标准票价。\n   回复 ", "note_en": "WD has moved to settle one of its ongoing class-action lawsuits for false advertising associated with its SMR WD Red hard drives, according to a report from   LawStreet. The proposed settlement comes after widespread criticism from WD&#39;s customers about its  surreptitious use of slower shingled magnetic recording (SMR) technology in some of its hard drives without disclosing that fact in marketing materials or specification sheets. Notably, this settlement is only proposed for one of the multiple litigation actions against Western Digital on the matter.   With the settlement, WD would agree that the WD Red NAS HDDs with SMR tech aren&#39;t suitable for NAS and RAID usage. The negotiated terms come to $2.7 million, with complainants receiving $4 to $7 in cash for each drive purchased with a maximum pro-rata adjustment of 85% of the retail price possible. That means the maximum damages per drive in the ~$160 range (although this is hard to calculate due to inflated pricing due to ongoing HDD shortages). You won&#39;t need proof of purchase to make a claim.  WD previously  disclosed to Tom&#39;s Hardware that the 2 to 6TB WD Red hard drives, among others, use SMR technology. This tech boosts capacity and results in a lower manufacturing cost, but it comes at the expense of performance, particularly in random write activity. Aside from generally slower performance, that can also  cause excessive rebuild times (resilvering) in the targets NAS use cases, particularly if they use ZFS RAID arrays.  The settlement value comes as the culmination of 10 weeks of negotiations and also includes lawyers&#39; fees and other costs. WD also agrees to fully disclose the recording technology used in its drives, both on the packaging and its web pages, for the next four years.  The original false advertising claims against WD touched off a  wave of class-action lawsuits, with one even  calling for a ban to block WD from selling SMR drives for NAS usage. The company has since  clarified which drives use SMR technology and even  released new drives to address the issue.  WD isn&#39;t the only HDD manufacturer to ship the slower SMR tech without full disclosure —  Toshiba and Seagate also shipped drives without full disclosure. We aren&#39;t aware of any pending litigation against those companies. We do know that multiple class-action lawsuits have been filed against WD in different regions.  LawStreet reports that one such lawsuit has been  dismissed while the plaintiff amends the complaint.\n      Lawyers will get summer homes in the Hamptons. You get $4 to $7. Sounds fare to me.   /s\n   Reply\n I was one that bought a couple of those drives for my UNRAID array just when the story broke.  I added the ZFS plug in and filled it with garbage and then forced the array to rebuild the parity disk. It was abysmally slow on 6GB drives. I would have taken over 5 days with a Ryzen 2400g CPU. Not exactly comforting when another failure could mean death.  Since I was within my 1 month window, I returned them to amazon as defective because WD support didn&#39;t offer me an upgrade option (which I would have paid for)  I since have gone Seagate Ironwolf and haven&#39;t looked back. I&#39;m a little concerned about temps on parity checks (57C) (std operating is 55C max) But my drive cage may just need a good cleaning for fan flow. Or I may need to adjust the fan curve up. So far only post warning&#39;s I&#39;ve seen have been about head realignment due to vibration which is pretty standard fare.\n   Reply", "posttime": "2021-06-18 05:03:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,smr,settle,wd", "title": "WD将SMR HDD虚假广告课程诉讼诉讼为160美元 ", "title_en": "WD to Settle SMR HDD False Advertising Class Action Lawsuit at $160 per Drive", "transed": 1, "url": "https://www.tomshardware.com/news/wd-moves-to-settle-smr-hdd-false-advertising-class-action-lawsuit", "via": "", "real_tags": ["广告", "smr", "settle", "wd"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究表明，人类不能减缓因生物限制而变老的速度\n    不朽和永恒的年轻人是神话的东西，根据新的研究，这可能终于最终结束了无论我们是否可以住的永恒的辩论。\n 由政府，商业，学者，投资者的投资者支持价值110亿美元（82.5亿英镑） - 估计到2025年的价值610亿美元 - 科学家们花了几十年，试图利用基因组学和人工智能的力量找到一种方法预防甚至逆转老化。\n  但现在，一个前所未有的研究已经证实，由于生物限制，我们可能无法减缓我们年龄较大的速度。\n 该研究，通过来自14个国家的科学家的国际合作，包括牛津大学的专家，并列出了测试“老龄化的不变率”假设，该假设表明，某种物种从成年期具有相对固定的衰老率。\n “我们的调查结果支持理论，而不是减缓死亡，由于年龄较小的死亡率降低，莫斯曼·穆尔姆·赫科特（JoséManuel）为特定年龄诞生和跨越几个世纪和大陆的死亡数据。\n  “我们将出生和死亡数据与人类和非人的灵长类动物进行了比较，发现这一般的死亡率在所有这些中都是相同的，”Aburto说。 “这表明生物学，而不是环境因素，最终最终控制寿命。 \n“统计数据确认，个人生活在健康和生活条件的改善方面，这导致整个人口的寿命增加。尽管如此，随着年龄的历史升级，死亡率的陡峭升高，在所有物种中都很清楚。“\n 辩论多年来，我们能够延长多年的学术界，几十年来，在英国寻求延长的生活和健康特别活跃，至少260家公司，250家投资者，10个非营利性和10个研究实验室使用最先进的技术。\n 英国政府甚至在四个工业战略中的两个工业战略中的两个工业战略中都是优先考虑的艾美和长寿的独立部门，这旨在让英国在未来行业的最前沿。\n 但是，辩论中缺少的是研究比较了多种动物人群与人类的寿命，以解决驱动死亡率的原因。\n 这项研究插在一起，说话。 “这使我们可以在物种内部和之间的死亡率进行比较。”\n 宇州健康衰老研究所的生物激素学教授大卫宝石表示，该报告的摘要表明，该研究是“非常高兴的研究证明了一些争议且肯定的权利”。\n 阿布托团队审查的所有数据集揭示了相同的死亡格相制：婴儿期的高风险，在未成熟和青少年迅速下降，仍然低至成年早期，然后在推进年龄持续上升。 \n“我们的调查结果证实，在历史人口中，预期寿命低，因为许多人死于年轻人，”Aburto说。 “但作为医疗，社会和环境改善持续，预期寿命增加。  “越来越多的人现在越来越长。 然而，老年死亡的轨迹没有改变，“他补充道。 “这项研究表明进化生物学胜过一切，到目前为止，医疗进步一直无法击败这些生物制约因素。” ", "note_en": "Research suggests humans cannot slow the rate at which they get older because of biological constraints\n    Immortality and everlasting youth are the stuff of myths, according to  new research which may finally end the eternal debate about whether we can live for ever.\n Backed by governments, business, academics and investors  in an industry worth $110bn (£82.5bn) – and estimated to be worth $610bn by 2025 – scientists have spent decades attempting to harness the power of genomics and artificial intelligence to find a way to prevent or even reverse ageing.\n  But an unprecedented  study has now confirmed that we probably cannot slow the rate at which we get older because of biological constraints.\n The study, by an  international collaboration of scientists from 14 countries and including experts from the University of Oxford, set out to test the “invariant rate of ageing” hypothesis, which says that a species has a relatively fixed rate of ageing from adulthood.\n “Our findings support the theory that, rather than slowing down death, more people are living much longer due to a reduction in mortality at younger ages,” said  José Manuel Aburto from Oxford’s  Leverhulme Centre for Demographic Science, who analysed age-specific birth and death data spanning centuries and continents.\n  “We compared birth and death data from humans and non-human primates and found this general pattern of mortality was the same in all of them,” said Aburto. “This suggests that biological, rather than environmental factors, ultimately control longevity.\n “The statistics confirmed, individuals live longer as health and living conditions improve which leads to increasing longevity across an entire population. Nevertheless, a steep rise in death rates, as years advance into old age, is clear to see in all species.”\n The debate over how much longer we can live has divided the academic community for decades, with the search for extended life and health particularly active in the UK, where at least 260 companies, 250 investors, 10 non-profits, and 10 research labs are using the most advanced technologies.\n The UK government has even prioritised the separate sectors of AI and longevity by including both of them in the  four industrial strategy grand challenges, which aim to put Britain at the forefront of the industries of the future.\n But what has been missing from the debate is research comparing lifespans of multiple animal populations with humans, to work out what is driving mortality.\n This study plugs that gap, said Aburto. “This extraordinarily diverse collection of data enabled us to compare mortality differences both within and between species.”\n David Gems, a professor of biogerontology at UCL’s Institute of Healthy Ageing, said that the summary of the report suggested the research was “a very high-powered study proving something contentious and surely right”.\n All the datasets examined by Aburto’s teams revealed the same general pattern of mortality: a high risk of death in infancy which rapidly declines in the immature and teenage years, remains low until early adulthood, and then continually rises in advancing age.\n “Our findings confirm that, in historical populations, life expectancy was low because many people died young,” said Aburto. “But as medical, social, and environmental improvements continued, life expectancy increased.\n “More and more people get to live much longer now. However, the trajectory towards death in old age has not changed,” he added. “This study suggests evolutionary biology trumps everything and, so far, medical advances have been unable to beat these biological constraints.”", "posttime": "2021-06-18 05:03:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "过程,process,研究", "title": "老化过程是不可阻挡的，发现前所未有的研究 ", "title_en": "Ageing process is unstoppable, finds unprecedented study", "transed": 1, "url": "https://www.theguardian.com/science/2021/jun/17/ageing-process-is-irreversible-finds-unprecedented-study", "via": "", "real_tags": ["过程", "process", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很乐意宣布出版我们的政策简报＆＃34;如何签发隐私保留的央行数字货币＆＃34; 由欧洲金钱和金融论坛。  许多中央银行目前正在调查中央银行数字货币（CBDC）和可能的设计。 欧洲央行最近进行的一项调查发现，公民和专业人员认为隐私是CBDC最重要的特征。 我们展示中央银行如何发布CBDC，这将很容易扩展，并允许保存物理现金的关键特征：交易隐私。 与此同时，拟议的设计将达到监管要求，从而在隐私和法律遵从性之间提供适当的平衡。 ", "note_en": "We are happy to announce the publication of our policy brief on &#34;How to issue a privacy-preserving central bank digital currency&#34; by  The European Money and Finance Forum.\n Many central banks are currently investigating Central Bank Digital Currency (CBDC) and possible designs. A recent survey conducted by the European Central Bank has found that both citizens and professionals consider privacy the most important feature of a CBDC. We show how a central bank could issue a CBDC that would be easily scalable and allow the preservation of a key feature of physical cash: transaction privacy. At the same time the proposed design would meet regulatory requirements and thus offer an appropriate balance between privacy and legal compliance.", "posttime": "2021-06-18 05:03:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "央行,privacy,中央银行", "title": "如何签发隐私保留的央行数字货币 ", "title_en": "How to issue a privacy-preserving central bank digital currency", "transed": 1, "url": "https://taler.net/en/news/2021-06.html", "via": "", "real_tags": ["央行", "privacy", "中央银行"]}, {"category": "", "categoryclass": "", "imagename": "ae66f2e7f52b220e39235254f6c80d07.jpg", "infoid": 1066572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们在本周早些时候突出了Nintendo交换机在线会员的优秀交易，今天＆＃39; S Dealmaster由一系列折扣在任天堂交换机游戏中，包括我们过去推荐的几个标题。该交易目前可在几个零售商 - 包括亚马逊，目标，沃尔玛，Gamestop，百思买和任天堂＆＃39;自己的eShop-并且主要适用于数字代码，而不是物理盒。\n 销售和＃39; S亮点是哈比斯折扣为17.49美元，符合我们的最低价格与时尚roguelike的开关版本的最低价格我们被命名为2020年的最佳游戏.Mario + Rabbids王国之战，可爱的Xcom - 在过去一周在E3宣布的续集的风格RPG是下降到10美元，而塞尔达的传说：野外的呼吸，现代经典续集在E3上也戏弄，低至42美元。\n 像纸马里奥这样的其他第一派游戏：折纸王和火灾会徽：三个房屋也折扣，如罗格里克的死单一样，像罗格里克里克·鲁纳·咕噜声，拼图游戏/拖钓模拟器无标题鹅游戏，以及硬核Metroidvania空心骑士，其中许多其他人。您可以查看以下销售的全部推荐优惠;不是一切都是最便宜的它＆＃39;我们的每一个选择都比其交换机上的典型速率低。\n 虽然这里的一些交易仅在任天堂＆＃39; eShop，我们也请注意，我们还要注意从外部零售商出售的数字游戏将网上拿出你的金点 - 任天堂＆＃39;奖励货币可以用于未来的ESHOP购买 - 直接从任天堂购买，因为ESHOP将这些代码视为在全MSRP上购买。通过Eshop本身，您的黄金积分是您支付给定游戏的任何价格的5％，所以以折扣购买给予更少的点。\n 在任何情况下，我们的交易综述都有充足的报价，包括各种亚马逊服务和呼应设备的早期优质日优惠，​​飞利浦色调智能灯泡和无线耳机，苹果＆＃39;最新的后勤销售，以及最新的后勤销售多得多。您可以查看下面的完整策划列表。\n 注意：ARS Technica可以通过联盟计划获得从本帖子的链接销售的赔偿。\n Dealmaster推出了自己的新闻通讯！注册以获得更短，紧密策划列表的最佳技术优惠，直接到您的收件箱，通常在他们将其交给ARS主页之前。 \nMario + Rabbids王国战斗（交换机，数字）在亚马逊，目标和任天堂eShop（金版为15美元 - 常上30美元）的9.99美元。  任天堂在线交换机12个月的家庭成员资格（数字代码）+ Nintendo开关的Sandisk MicroSDXC卡（128GB），以34.99美元在亚马逊和目标（通常为60美元）。  仅限亚马逊队员：Amazon Echo Dot（2020,2包）智能扬声器，可在亚马逊49.98美元（使用代码：PDDOT2PK  - 通常$ 85）。  Eufy Indoor Cam 2K室内安全摄像头在亚马逊29.99美元（剪辑$ 4优惠券和使用代码：EUFY1080-常上40美元）。  瓷砖性能包：1x Tile Pro（2020）+ 1x瓦片修身（2020）蓝牙物品跟踪器，以$ 43.99在瓷砖（通常为60美元）。  Anova Precision炊具纳米Sous Vide Machine在亚马逊，目标和沃尔玛（沃尔玛）以99美元（通常为120美元）。  Anker Soundcore Life Q30蓝牙降噪耳机，亚马逊59.99美元（剪辑$ 20优惠券 - 通常$ 80）。 \nApple回到校售：通过购买Apple购买Select Mac和iPad产品，获得Apple Airpods真实无线耳塞+ 20％的折扣。  任天堂在线交换机12个月的家庭成员资格（数字代码）+ Nintendo开关的Sandisk MicroSDXC卡（128GB），以34.99美元在亚马逊和目标（通常为60美元）。  塞尔达的传说：野外（交换机，数字）的呼吸，可在亚马逊，沃尔玛和任天堂eShop（以13美元的扩张通行证）的价格为41.99美元。  Mario + Rabbids王国战斗（交换机，数字）在亚马逊，目标和任天堂eShop（金版为15美元 - 常上30美元）的9.99美元。  纸马里奥：亚马逊，目标和任天堂eShop的41.99美元的折纸王（交换机，数字）（通常为55美元）。  消防徽章：三栋房屋（交换机，数字）$ 41.99在亚马逊，目标和任天堂eShop（通常50美元）。  ORI和WISPS的意志（交换机，数字）在Nintendo Eshop $ 14.99（通常为30美元）。 \n亚马逊仅适用于27.80美元（6.95 /月/月）的Amakible Premium加4个月的会员资金（前四个月的每月14.95美元 - 通常$ 60）。\n 仅限新订户+ Prime成员：Amazon Music无限4个月的亚马逊可免费为4个月（前四个月的8个月/月以8美元，三个月免费为非奖金 - 通常为24美元）。\n 亚马逊Kindle无限6个月的成员资格为47.86美元（243.80美元，12个月为80.30美元 - 通常$ 60）。\n 仅限亚马逊队员：Amazon Echo Dot（2020,2包）智能扬声器，可在亚马逊49.98美元（使用代码：PDDOT2PK  - 通常$ 85）。\n 仅限亚马逊（亚马逊Echo（第4 Gen，2-Pack）智能扬声器在亚马逊119.98美元（使用代码：Echoprime  - 通常$ 180）。\n 仅限亚马逊（2019年）亚马逊Echo Show 5（2019）智能展示$ 44.99在亚马逊（通常为65美元）。\n 仅限亚马逊（Amazon Echo Buds）在亚马逊79.99美元（通常为120美元），亚马逊回声芽无线降噪耳机。 \n亚马逊仅限0.99美元/月的各种流媒体服务的2个月成员资格（通过购买启用自动续订）。  50英寸东芝C350 Fire TV（2021型号）4K LED电视为359.99美元，亚马逊（通常为470美元）。  ori和Wisps的意志（Xbox，PC，Digital）在GameStop（数字副本以15美元）的游戏通行证 - 通常$ 30）。  ori：Microsoft $ 17.49的集合（Xbox，PC，Digital）（也是游戏通行证 - 通常$ 35）。  齿轮5（Xbox）在亚马逊和游戏赛中的9.99美元（数字副本16美元，也可以在游戏通行证 - 通常$ 25）。  aramon和exply买入的齿轮策略（xbox）以9.99美元的价格为9.99美元（数字副本24美元，也可以在游戏通行证 - 通常$ 30）。  盗贼（Xbox）的海洋（Xbox）在GameStop $ 9999（数字副本20美元，也可以在游戏通行证 - 通常$ 30）。 \nMLB Show 21（Xbox系列，Digital）在Microsoft $ 59.49（XB1版本为50美元，也可以在游戏通过 - 通常$ 70）。  控制：Ultimate Edition（Xbox，Digital）在Microsoft $ 15.99（游戏通过游戏通行证 - 通常$ 40）。  Titanfall 2：Microsoft和Amazon的Ultimate Edition（Xbox，Digital）$ 2.99（也是游戏通行证 - 通常$ 10）。  巫师3：年度版（Xbox，Digital）的野生狩猎游戏，Microsoft $ 9.99（通常为25美元）。  Microsoft $ 4.99的倦怠天堂（Xbox，Digital）（Xbox，Digital）（也是游戏通行证 - 通常为20美元）。  HellBlade：Senua＆＃39; S牺牲（Xbox，PC，Digital），Microsoft $ 7.49（也可以在游戏通行证 - 通常$ 20）。  Microsoft $ 23.99的厄运永恒（Xbox，PC，Digital）（也是游戏通行证 - 通常$ 40）。 \nMicrosoft的4.99美元的日落Overdrive（Xbox，PC，Digital）$ 4.99（也可以在游戏通行证 - 通常$ 15）。  金属齿轮固体V：Microsoft $ 5.99的幻影疼痛（Xbox，Digital）（通常为15美元）。  使命召唤：黑色OPS冷战 - 交叉Gen Bundle（Xbox，Digital）在Microsoft $ 45.49（XB1版本为36美元 - 通常$ 60）。  金属齿轮固体高清版：MGS2 + MGS3（Xbox，Digital）Microsoft $ 9.99（通常为20美元）。  Microsoft 6.99美元的Playerunknown＆＃39;战场（Xbox，Digital）（Xbox，Digital）（也可以在游戏通行证 - 通常为20美元）。  Microsoft 7.49美元的罕见重播（Xbox，Digital）（也可以在游戏通行证 - 通常$ 20）。  中地：Microsoft 4.99美元的年度版本（Xbox，Digital）的摩西游戏的影子（通常为15美元）。 \n历史破坏者：Microsoft的5.99美元的巫师故事（Xbox，Digital）（也是游戏通行证 - 通常为20美元）。  Microsoft的两点医院（PC，Digital）以8.74美元（也可以在游戏通行证 - 通常为30美元）。  Yakuza：亚马逊和沃尔玛的29.99美元的龙（PS5，Xbox）（也是游戏通行证 - 通常$ 60）。  金属齿轮固体V：Playstation商店的5.99美元的幻影疼痛（PS4，Digital）（通常为15美元）。  PlayStation Store和Microsoft的9.99美元的Rain 2（PS4，Xbox，Digital）风险（XBL金 - 通常$ 25）。  Ubisoft Forward：Ubisoft的各种PC，Switch，PS4 / PS5和Xbox Games额外10美元（仅限15 +购买，使用代码：转发）。  任天堂游戏＆amp; 观看：Super Mario Bros.手持式游戏控制台以39.99美元，畅销购买（通常为50美元）。 \n仅限新订阅者：Xbox游戏通过Ultimate（Digital）3个月的3个月成员，以便在Microsoft $ 1（通常为31美元）。  Xbox游戏通过Ultimate（Digital）3个月成员39.99美元，亚马逊和沃尔玛（通常为45美元）。  Razer Huntsman Mini 60％的机械游戏键盘-RAZER咔哒声光开关，亚马逊和最佳购买$ 89.99（通常为115美元）。  Razer Basilisk Ultimate无线游戏鼠标+充电码头在亚马逊99.99美元（通常为140美元）。  Razer Blackwidow V3机械游戏键盘-RAZER绿色开关$ 101.99在亚马逊（通常为130美元）。  联想瑜伽9i 2-In-1笔记本电脑 - 英特尔酷睿I5-1135G7，14英寸1080p，8GB RAM，256GB SSD，沃尔玛以799.99美元（通常为950美元）。  Apple Mac Mini（2020）迷你台式PC-Apple M1，8GB RAM，256GB，可在亚马逊599.99美元（结账 - 通常670美元）。 \n32英寸LG 32GK650F-B游戏监视器-2560x1440，VA，144 Hz，FreeSync在Amazon和Buydig为296美元（通常为350美元）。  三星SSD 980（500GB）NVME M.2 PCIe 3.0内部SSD $ 59.99在三星，亚马逊和adorama（通常为71美元）。  AMD Ryzen 7 5800X 8-Core / 16线桌面处理器，以399美元的亚马逊和B＆amp; H（通常为440美元）。  Apple回到校售：通过购买Apple购买Select Mac和iPad产品，获得Apple Airpods真实无线耳塞+ 20％的折扣。  Roku Express 4K + 4K HDR媒体媒体拖带媒体为$ 29.99，在亚马逊和目标（通常为40美元）。  Roku Ultra（2020）4K HDR媒体拖斯特69美元，亚马逊和目标（通常90美元）。  48英寸LG CX（2020型号）4K HDR OLED电视以1,249.99美元，亚马逊和百思买（我最畅销的账户所必需的 - 通常$ 1,450）。 \n48英寸LG C1（2021型号）4K HDR OLED电视，可在亚马逊1,399.99美元（通常为1,600美元）。  55英寸LG C1（2021型号）4K HDR OLED电视，亚马逊和目标$ 1,599.99（通常为1,800美元）。  65英寸LG GX（2020型号）4K HDR OLED电视，亚马逊$ 2,096（通常为2,400美元）。  75英寸索尼X950H（2020型号）4K HDR LED电视+ 100美元的签证礼品卡为1,998美元，在Buydig和Amazon（亚马逊没有GC  - 通常$ 2,650）。  Anker Soundcore Life Q30蓝牙降噪耳机，亚马逊59.99美元（剪辑$ 20优惠券 - 通常$ 80）。  Canakit Raspberry PI 4（4GB）Starter Pro Kit-Raspberry PI 4（4GB RAM），铝壳，三星EVO +（64GB）MicroSD卡，电源，USB-C电源开关，Micro-HDMI到HDMI电缆（6FT），可满$ 94.99 在亚马逊（剪辑$ 15优惠券 - 通常$ 110）。  Eufy Indoor Cam 2K室内安全摄像头在亚马逊29.99美元（剪辑$ 4优惠券和使用代码：EUFY1080-常上40美元）。 \n飞利浦色调白色和彩色氛围E26（3包）LED智能灯泡在飞利浦色调99.99美元（通常为125美元）。  联想智能时钟必需智能数字时钟+扬声器，价格为$ 29.99＆＃39; s（通常50美元）。  亚马逊309.99美元的Roborock S4 Max Robot Ruavum（剪辑20美元优惠券 - 通常410美元）。  Roborock S6纯机器人真空359.99亚马逊（剪辑$ 20优惠券 - 通常$ 500）。  TP-Link Kasa HS103亚马逊7.49美元的智能Wi-Fi插座（剪辑50％优惠券，4-Pack 25美元 - 通常$ 15）。  购买两本，在亚马逊和目标上获得各种书籍，游戏，电影等免费销售。  瓷砖性能包：1x Tile Pro（2020）+ 1x瓦片修身（2020）蓝牙物品跟踪器，以$ 43.99在瓷砖（通常为60美元）。 \nAnova Precision炊具纳米Sous Vide Machine在亚马逊，目标和沃尔玛（沃尔玛）以99美元（通常为120美元）。  即时锅DUO NOVA（6QT）7合1电动压力锅，可达69美元，售价$ 69（通常90美元）。  亚马逊79.99美元的iPad（8th +第7 Gen）的Logitech Slim Folio键盘案例（通常为90美元）。  IOTIE EASY ONE TOLD WIRETIOW 2（仪表板）汽车手机座+无线充电器-10W ANDROID / 7.5W iPhone在亚马逊34.95美元（通常为50美元）。 ", "note_en": "After we highlighted an  excellent deal on Nintendo Switch Online memberships earlier in the week, today&#39;s Dealmaster is headlined by a range of  discounts on Nintendo Switch games, including several titles we&#39;ve recommended in the past. The deals are currently available at several retailers—including Amazon,  Target,  Walmart,  GameStop,  Best Buy, and  Nintendo&#39;s own eShop—and primarily apply to digital codes, not physical cartridges.\n Among the sale&#39;s highlights is   Hades discounted to $17.49, which matches the lowest price we&#39;ve tracked for the Switch version of the stylish roguelike we named  the best game of 2020.  Mario + Rabbids Kingdom Battle, the  adorable  XCOM-style RPG whose  sequel was announced at E3 this past week,  is down to $10, while  The Legend of Zelda: Breath of the Wild, the  modern classic whose  sequel was also teased at E3,  is down to $42.\n Other first-party games like   Paper Mario: The Origami King and  Fire Emblem: Three Houses are also discounted, as are notable indies like  the roguelike  Dead Cells, the  hard-as-nails run-and-gunner  Cuphead, the  puzzle game/trolling simulator  Untitled Goose Game, and the  hardcore Metroidvania  Hollow Knight, among many others. You can see our full list of recommended offers from the sale below; not everything is the cheapest it&#39;s ever been, but each of our picks is priced lower than their typical going rates on the Switch.\n While some of the deals here are only available on Nintendo&#39;s eShop, we&#39;ll also note that buying a digital game on sale from an outside retailer will net you more  Gold Points—Nintendo&#39;s rewards currency that can be used towards future eShop purchases—than buying from Nintendo directly, since the eShop treats those codes as if they were purchased at full MSRP. Through the eShop itself, your Gold Points are 5% of whatever price you paid for a given game, so buying at a discount gives fewer points back.\n In any event, our deals roundup has plenty more on offer, including early Prime Day deals for various Amazon services and Echo devices, discounts on Philips Hue smart bulbs and wireless headphones, Apple&#39;s latest back-to-school sale, and much more. You can check out our full curated list below.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.\n   Mario + Rabbids Kingdom Battle (Switch, digital) for  $9.99 at Amazon,  Target, and  Nintendo eShop ( Gold Edition for  $15—normally $30).\n Nintendo Switch Online 12-month Family Membership (digital code) + SanDisk microSDXC Card for Nintendo Switch (128GB) for  $34.99 at Amazon and  Target (normally $60).\n Prime members only:  Amazon Echo Dot (2020, 2-pack) smart speaker for  $49.98 at Amazon (use code:  PDDOT2PK—normally $85).\n Eufy Indoor Cam 2K indoor security camera for  $29.99 at Amazon ( clip $4 coupon and use code:  EUFY1080—normally $40).\n  Tile Performance Pack: 1x Tile Pro (2020) + 1x Tile Slim (2020) Bluetooth item trackers for  $43.99 at Tile (normally $60).\n Anova Precision Cooker Nano sous vide machine for  $99 at Amazon,  Target, and  Walmart (normally $120).\n Anker Soundcore Life Q30 Bluetooth noise-canceling headphones for  $59.99 at Amazon ( clip $20 coupon—normally $80).\n Apple Back to School Sale: get Apple AirPods true wireless earbuds + 20% off AppleCare with purchase of select Mac and iPad products at Apple.\n   Nintendo Switch Online 12-month Family Membership (digital code) + SanDisk microSDXC Card for Nintendo Switch (128GB) for  $34.99 at Amazon and  Target (normally $60).\n The Legend of Zelda: Breath of the Wild (Switch, digital) for  $41.99 at Amazon,  Walmart, and  Nintendo eShop ( Expansion Pass for  $13—normally $50).\n  Mario + Rabbids Kingdom Battle (Switch, digital) for  $9.99 at Amazon,  Target, and  Nintendo eShop ( Gold Edition for  $15—normally $30).\n  Paper Mario: The Origami King (Switch, digital) for  $41.99 at Amazon,  Target, and  Nintendo eShop (normally $55).\n Fire Emblem: Three Houses (Switch, digital) for  $41.99 at Amazon,  Target, and  Nintendo eShop (normally $50).\n  Ori and the Will of the Wisps (Switch, digital) for  $14.99 at Nintendo eShop (normally $30).\n   Prime members only:  Audible Premium Plus 4-month membership for  $27.80 ($6.95/month) at Amazon (auto-renews at $14.95/month after first four months—normally $60).\n New subscribers + Prime members only:  Amazon Music Unlimited 4-month membership for  free at Amazon (auto-renews at $8/month after first four months,  three months free for non-Prime members—normally $24).\n Amazon Kindle Unlimited 6-month membership for  $47.86 at Amazon (24-month for  $143.80, 12-month for  $80.30—normally $60).\n Prime members only:  Amazon Echo Dot (2020, 2-pack) smart speaker for  $49.98 at Amazon (use code:  PDDOT2PK—normally $85).\n Prime members only:  Amazon Echo (4th gen, 2-pack) smart speaker for  $119.98 at Amazon (use code:  ECHOPRIME—normally $180).\n Prime members only:  Amazon Echo Show 5 (2019) smart display for  $44.99 at Amazon (normally $65).\n Prime members only:  Amazon Echo Buds wireless noise-canceling earphones for  $79.99 at Amazon (normally $120).\n Prime members only:  2-month memberships for various streaming services for  $0.99/month at Amazon (auto-renew enabled with purchase).\n 50-inch Toshiba C350 Fire TV (2021 model) 4K LED TV for  $359.99 at Amazon (normally $470).\n   Ori and the Will of the Wisps (Xbox, PC, digital)  $6.99 at GameStop ( digital copy for  $15, also on Game Pass—normally $30).\n Ori: The Collection (Xbox, PC, digital) for  $17.49 at Microsoft (also on Game Pass—normally $35).\n Gears 5 (Xbox) for  $9.99 at Amazon and  GameStop ( digital copy for  $16, also on Game Pass—normally $25).\n Gears Tactics (Xbox) for  $9.99 at Amazon and  Best Buy ( digital copy for  $24, also on Game Pass—normally $30).\n Sea of Thieves (Xbox) for  $9.99 at GameStop ( digital copy for  $20, also on Game Pass—normally $30).\n MLB The Show 21 (Xbox Series, digital) for  $59.49 at Microsoft ( XB1 version for  $50, also on Game Pass—normally $70).\n  Control: Ultimate Edition (Xbox, digital) for  $15.99 at Microsoft (base game also on Game Pass—normally $40).\n Titanfall 2: Ultimate Edition (Xbox, digital) for  $2.99 at Microsoft and  Amazon (also on Game Pass—normally $10).\n  The Witcher 3: Wild Hunt—Game of the Year Edition (Xbox, digital) for  $9.99 at Microsoft (normally $25).\n Burnout Paradise Remastered (Xbox, digital) for  $4.99 at Microsoft (also on Game Pass—normally $20).\n Hellblade: Senua&#39;s Sacrifice (Xbox,  PC, digital) for  $7.49 at Microsoft (also on Game Pass—normally $20).\n   Doom Eternal  (Xbox,  PC, digital) for  $23.99 at Microsoft (also on Game Pass—normally $40).\n  Sunset Overdrive (Xbox,  PC, digital) for  $4.99 at Microsoft (also on Game Pass—normally $15).\n  Metal Gear Solid V: The Phantom Pain (Xbox, digital) for  $5.99 at Microsoft (normally $15).\n Call of Duty: Black Ops Cold War—Cross-Gen Bundle (Xbox, digital) for  $45.49 at Microsoft ( XB1 version for  $36—normally $60).\n  Metal Gear Solid HD Edition:  MGS2 +  MGS3 (Xbox, digital) for  $9.99 at Microsoft (normally $20).\n PlayerUnknown&#39;s Battlegrounds (Xbox, digital) for  $6.99 at Microsoft (also on Game Pass—normally $20).\n   Rare Replay (Xbox, digital) for  $7.49 at Microsoft (also on Game Pass—normally $20).\n  Middle-earth: Shadow of Mordor—Game of the Year Edition (Xbox, digital) for  $4.99 at Microsoft (normally $15).\n Thronebreaker: The Witcher Tales (Xbox, digital) for  $5.99 at Microsoft (also on Game Pass—normally $20).\n  Two Point Hospital (PC, digital) for  $8.74 at Microsoft (also on Game Pass—normally $30).\n   Yakuza: Like a Dragon (PS5, Xbox) for  $29.99 at Amazon and  Walmart (also on Game Pass—normally $60).\n  Metal Gear Solid V: The Phantom Pain (PS4, digital) for  $5.99 at PlayStation Store (normally $15).\n  Risk of Rain 2 (PS4, Xbox, digital) for  $9.99 at PlayStation Store and  Microsoft (XBL Gold required—normally $25).\n    Ubisoft Forward: Extra  $10 off various PC, Switch, PS4/PS5, and Xbox games at Ubisoft ($15+ purchases only, use code:  FORWARD).\n   Nintendo Game &amp; Watch:  Super Mario Bros. handheld game console for  $39.99 at Best Buy (normally $50).\n New subscribers only:  Xbox Game Pass Ultimate (digital) 3-month membership for  $1 at Microsoft (normally $31).\n Xbox Game Pass Ultimate (digital) 3-month membership for  $39.99 at Amazon and  Walmart (normally $45).\n Razer Huntsman Mini 60 percent mechanical gaming keyboard—Razer Clicky Optical switches for  $89.99 at Amazon and  Best Buy (normally $115).\n Razer Basilisk Ultimate wireless gaming mouse + charging dock for  $99.99 at Amazon (normally $140).\n Razer BlackWidow V3 mechanical gaming keyboard—Razer Green switches for  $101.99 at Amazon (normally $130).\n   Lenovo Yoga 9i 2-in-1 laptop—Intel Core i5-1135G7, 14-inch 1080p, 8GB RAM, 256GB SSD for  $799.99 at Walmart (normally $950).\n Apple Mac Mini (2020) mini desktop PC—Apple M1, 8GB RAM, 256GB for  $599.99 at Amazon (discount seen at checkout—normally $670).\n 32-inch LG 32GK650F-B gaming monitor—2560x1440, VA, 144 Hz, FreeSync for  $296 at Amazon and  BuyDig (normally $350).\n Samsung SSD 980 (500GB) NVMe M.2 PCIe 3.0 internal SSD for  $59.99 at Samsung,  Amazon, and  Adorama (normally $71).\n AMD Ryzen 7 5800X 8-core/16-thread desktop processor for  $399 at Amazon and  B&amp;H (normally $440).\n Apple Back to School Sale: get Apple AirPods true wireless earbuds + 20% off AppleCare with purchase of select Mac and iPad products at Apple.\n   Roku Express 4K+ 4K HDR media streamer for  $29.99 at Amazon and  Target (normally $40).\n Roku Ultra (2020) 4K HDR media streamer for  $69 at Amazon and  Target (normally $90).\n 48-inch LG CX (2020 model) 4K HDR OLED TV for  $1,249.99 at Amazon and  Best Buy (My Best Buy account required—normally $1,450).\n 48-inch LG C1 (2021 model) 4K HDR OLED TV for  $1,399.99 at Amazon (normally $1,600).\n 55-inch LG C1 (2021 model) 4K HDR OLED TV for  $1,599.99 at Amazon and  Target (normally $1,800).\n 65-inch LG GX (2020 model) 4K HDR OLED TV for  $2,096 at Amazon (normally $2,400).\n 75-inch Sony X950H (2020 model) 4K HDR LED TV + $100 Visa gift card for  $1,998 at BuyDig and  Amazon (no GC at Amazon—normally $2,650).\n   Anker Soundcore Life Q30 Bluetooth noise-canceling headphones for  $59.99 at Amazon ( clip $20 coupon—normally $80).\n        CanaKit Raspberry Pi 4 (4GB) Starter Pro Kit—Raspberry Pi 4 (4GB RAM), aluminum case, Samsung EVO+ (64GB) microSD card, power supply, USB-C power switch, micro-HDMI to HDMI cable (6ft) for  $94.99 at Amazon ( clip $15 coupon—normally $110).\n   Eufy Indoor Cam 2K indoor security camera for  $29.99 at Amazon ( clip $4 coupon and use code:  EUFY1080—normally $40).\n Philips Hue White and Color Ambiance E26 (3-pack) LED smart bulbs for  $99.99 at Philips Hue (normally $125).\n  Lenovo Smart Clock Essential smart digital clock + speaker for  $29.99 at Lowe&#39;s (normally $50).\n   Roborock S4 Max robot vacuum for  $309.99 at Amazon ( clip $20 coupon—normally $410).\n Roborock S6 Pure robot vacuum for  $359.99 at Amazon ( clip $20 coupon—normally $500).\n TP-Link Kasa HS103 smart Wi-Fi outlet for  $7.49 at Amazon ( clip 50% coupon,  4-pack for  $25—normally $15).\n   Buy two, get one free sale on various books, games, movies, etc. at Amazon and  Target.\n Tile Performance Pack: 1x Tile Pro (2020) + 1x Tile Slim (2020) Bluetooth item trackers for  $43.99 at Tile (normally $60).\n Anova Precision Cooker Nano sous vide machine for  $99 at Amazon,  Target, and  Walmart (normally $120).\n Instant Pot Duo Nova (6qt) 7-in-1 electric pressure cooker for  $69 at BuyDig (normally $90).\n  Logitech Slim Folio keyboard case for iPad (8th + 7th gen) for  $79.99 at Amazon (normally $90).\n  iOttie Easy One Touch Wireless 2 (Dashboard) car phone mount + wireless charger—10W Android/7.5W iPhone for  $34.95 at Amazon (normally $50).", "posttime": "2021-06-18 04:27:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,任天堂,recommended", "title": "今天出售了许多推荐的任天堂交换机游戏 ", "title_en": "A number of recommended Nintendo Switch games are on sale today", "transed": 1, "url": "https://arstechnica.com/staff/2021/06/nintendo-switch-sale-discounts-mario-zelda-more-games/", "via": "", "real_tags": ["游戏", "任天堂"]}, {"category": "", "categoryclass": "", "imagename": "c453acd8114378b7ce1a8bef1e51e88c.jpeg", "infoid": 1066571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一种不寻常的搬迁冠状病毒疾病（Covid-19）疫苗犹豫不决，省政府在巴基斯坦的省政府犹豫不决，现在已经决定阻止乌鸦疫苗公民的SIM卡，周五报告。根据ary新闻，在拉合尔的会议上被省去的决定，由省份主持的卫生部长Yasmin Rashid博士。这一举动似乎旨在强迫所有拒绝让自己接种接种的公民，最早才能接种疫苗。\n 巴基斯坦省卫生部长拉希德博士＆＃39;旁遮普邦，表示已经有A＆＃34;相当大的减少＆＃34;在Covid-19案件中由于大规模疫苗接种。但是，旁遮普邮政卫生部门编制的报告表明，该省仍未实现Covid-19疫苗接种的设定目标，提出了Ary新闻，并补充说，在第二剂量的第一剂疫苗的疫苗中约有30,000名接受者自巴基斯坦的开始以来，2月2日的大规模接种驱动。\n 国家卫生服务部（NHS）官方官员表示，政府当局正在识别和分类从未出现在其应税日期的第二剂COVID-19疫苗的人员。 ＆＃34;有可能在获得第二剂之前，其中一些可能已经死亡，＆＃34; ani报价了这官方。他指出，虽然这些人的一部分可能在接受第一次剂量后收缩冠状病毒并决定不再得到第二个，但其他人可能只是对疫苗的负宣传造成牺牲品。\n  与此同时，巴基斯坦＆＃39; S财务部长Shaukat Tarin将在周五下午举行该国伊斯兰堡的预算演讲，因为他面临在COVID后经济复苏的消费之间走路之间的罚款挑战作为巴基斯坦从冠状病毒疾病的更传染性的第三波（Covid Pandemic）中，将预算赤字保持支票中的预算赤字出现\n  如果您通过本文中的推荐链接购买某些内容，可以赔偿微软和合作伙伴。\n          在新窗口中打开打开外部站点在新窗口中打开外部站点 ", "note_en": "In what comes as an unusual move to tackle coronavirus disease (Covid-19) vaccine hesitancy, the provincial government in Pakistan&#39;s Punjab has now decided to block the SIM cards of unvaccinated citizens, news agency ANI reported on Friday. The decision, as per ARY News, was taken at a meeting in Lahore presided over by the province&#39;s health minister Dr. Yasmin Rashid. The move is seemingly aimed at forcing all those citizens who refuse to get themselves vaccinated to do so at the earliest.\n Dr. Rashid, the provincial health minister in Pakistan&#39;s Punjab, said that there has been a &#34;considerable decrease&#34; in Covid-19 cases in the province due to mass vaccinations. However, a report compiled by the Punjab primary health department shows that the province still failed to achieve its set target for Covid-19 vaccination, reports ARY News, adding that around 300,000 recipients of the first dose of the vaccine never returned for the second dose since the start of Pakistan&#39;s mass inoculation drive on February 2.\n An official of Pakistan&#39;s ministry of national health services (NHS) said that the administration is identifying and categorising the people who never showed up for the second dose of the Covid-19 vaccine on their due dates. &#34;There is a possibility that some of them might have died before getting the second dose,&#34; ANI quoted the official as saying. He noted that while a section of these people might have contracted the coronavirus after receiving the first dose and decided not to get the second, others might simply have fallen prey to negative propaganda regarding the vaccine.\n  Meanwhile, Pakistan&#39;s finance minister Shaukat Tarin is set to present the country&#39;s budget speech in capital Islamabad on Friday afternoon, as he faces a challenge in walking the fine line between spending big over post-Covid economic recovery and keeping the budget deficit in check as Pakistan emerges from the more infectious third wave of the coronavirus disease (Covid pandemic.\n  Microsoft and partners may be compensated if you purchase something through recommended links in this article.\n          Opens in a new window  Opens an external site  Opens an external site in a new window", "posttime": "2021-06-18 04:20:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "公民,province,疫苗", "title": "巴基斯坦省可能会阻止没有得到Covid-19疫苗的公民的SIM卡 ", "title_en": "Pakistan Province May Block SIM Cards of Citizens Who Didn't Get Covid-19 Vaccines", "transed": 1, "url": "https://www.msn.com/en-in/news/world/pakistans-punjab-to-block-sim-cards-of-citizens-not-vaccinated-against-covid-19-report/ar-AAKVEKW", "via": "", "real_tags": ["公民", "province", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "a15c83e7e8abc15a76ac2b5c4fb126b3.png", "infoid": 1066570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（Thomson Reuters Foundation） - 从深脑刺激到可穿戴扫描仪的科学进步正在制造人类思想的人类越来越多的，创造了对规范新工具的法律和保护的需求，顶部神经痛士周四表示。\n 纽约哥伦比亚大学哥伦比亚大学和伦理学家组织者的神经科学教授拉斐尔·埃斯特（Rafael Yuste）表示，应将一套“神经权利”增加到联合国通过的人权宣言。\n 该小组说，五个权利将防止新技术免受新技术的滥用权利，自由意志和精神隐私以及平等获得脑增强的进步和保护算法偏差的权利。\n “如果您可以录制和改变神经元，您可以原则上读写人们的思想，”Yuste在全球技术会议上的网上峰会的在线小组中说。\n “这不是科幻小说。我们在实验动物成功地在实验室中这样做。“\n  他补充说，神经技术有可能改变让人类人类的机制，因此将其放入“人权框架”是合适的。\n 1948年第二次世界大战后，通过了奠定了国际人权基础的宣言。 \n神经科学家说，随着发展的需求将增长，因为发展变得更加流行和商业化。\n 到目前为止，这些技术中的许多技术都有医学的应用，例如脑电脑接口帮助患者在脑损伤后移动假肢或沟通。\n 但在马里兰州约翰霍普金斯大学的神经学和神经科学教授John Krakauer表示，这些神经技术越来越多地提供。\n   美国食品和药物管理局已经批准了深脑刺激手术 - 植入脑中的电极 - 将来自帕金森病的一系列疾病治疗癫痫。\n 一些私营公司销售可穿戴设备，以监测声称能够跟踪情绪和情绪的大脑活动。\n Krakauer将最新的神经技术与社交媒体和群众广告等更新的进步相比，可以在未经他们的同意下改变人们的偏好。\n “现在发生了变化的是，科技可以在头骨下拿到骷髅下，并享受我们的神经元，”他说。 \n在全球范围内，一些法律措施是针对这些进展的，包括智利的立法，如果通过，那将是第一批建立公民的神经权利的法律。  Yuste表示，11月，西班牙政府提出了规范人工智能的新规则，包括针对神经权利的具体规定。  “这是历史上第一次人类能够获得人们思想的内容，”他说。  “我们必须仔细考虑我们将如何将其带入社会。” ", "note_en": "(Thomson Reuters Foundation) - Scientific advances from deep brain stimulation to wearable scanners are making manipulation of the human mind increasingly possible, creating a need for laws and protections to regulate use of the new tools, top neurologists said on Thursday.\n A set of “neuro-rights” should be added to the Universal Declaration of Human Rights adopted by the United Nations, said Rafael Yuste, a neuroscience professor at New York’s Columbia University and organizer of the Morningside Group of scientists and ethicists proposing such standards.\n Five rights would guard the brain against abuse from new technologies - rights to identity, free will and mental privacy along with the right of equal access to brain augmentation advances and protection from algorithmic bias, the group says.\n “If you can record and change neurons, you can in principle read and write the minds of people,” Yuste said during an online panel at the Web Summit, a global tech conference.\n “This is not science fiction. We are doing this in lab animals successfully.”\n  Neurotechnology has the potential to alter the mechanisms that make people human, so putting it in a “human rights framework” is appropriate, he added.\n The U.N.’s declaration, which laid the groundwork for international human rights, was adopted after World War II in 1948.\n A need for neuro-rights will grow as the developments become more popular and commercialized, the neurologists said.\n Many of these technologies so far have applications in medicine, such as brain-computer interfaces helping patients move prosthetic limbs or communicate after a brain injury.\n But those neurotechnologies increasingly will be available outside of the medical context, said John Krakauer, a professor of neurology and neuroscience at Johns Hopkins University in Maryland.\n   The U.S. Food and Drug Administration has approved deep brain stimulation procedures - implanting electrodes in the brain - to treat a range of disorders from Parkinson’s disease to epilepsy.\n Some private companies sell wearable devices to monitor brain activity that claim to be capable of tracking moods and emotions.\n Krakauer compared the latest neurotechnologies to advances such as social media and mass advertising that can be utilized to alter people’s preferences without their expressed consent.\n “What’s changed now is that the tech can get under the skull and get at our neurons,” he said.\n  Globally, a number of legal measures are aimed at these advances, including legislation in Chile that if passed would be the first law to establish neuro-rights for citizens.\n In November, the Spanish government proposed new rules for regulating artificial intelligence that includes specific provisions for neuro-rights, Yuste said.\n “This is the first time in history that humans can have access to the contents of people’s minds,” he said.\n “We have to think very careful about how we are going to bring this into society.”", "posttime": "2021-06-18 04:20:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,提出,propose,技术", "title": "科学家们提出了“神经权利”来保护大脑从未来的操纵 ", "title_en": "Scientists Propose 'Neuro-Rights' to Protect Brains From Future Manipulation", "transed": 1, "url": "https://www.reuters.com/article/us-global-tech-rights-idUSKBN28D3HK", "via": "", "real_tags": ["科学家", "提出", "propose", "技术"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。 您的浏览器将很快重定向到所要求的内容。 ", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2021-06-18 04:20:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,广告,谷歌,新闻,traffic", "title": "研究：48％的“假”新闻出版商的广告交通和32％的广告交通“低信誉站点”，如Breitbart，谷歌服务于Google ", "title_en": "Study: 48% of ad traffic on “fake” news publishers and 32% of ad traffic on “low credibility sites” like Breitbart is served by Google", "transed": 1, "url": "https://www.morningbrew.com/marketing/stories/2021/06/16/nearly-half-ads-fake-news-sites-come-google-study-finds", "via": "", "real_tags": ["google", "广告", "谷歌", "新闻", "traffic"]}, {"category": "", "categoryclass": "", "imagename": "bc93baf52cb3ba5b498cff03590afc51.png", "infoid": 1066568, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了防止考试中的作弊，许多国家在关键考试时间内限制甚至关闭互联网接入。 6月大部分时间，叙利亚在关键考试期间正在计划互联网停机。考试时间表如下：\n  我很感激Twitter用户，用于原来的阿拉伯语和整理数据。\n CloudFlare Radar允许任何人跟踪世界各地的互联网流量模式，它具有特定于国家的页面。 CloudFlare看到的叙利亚过去七天的最后七天的图表显示了两滴到几乎零的时间表对应于计划的前两次考试。\n  互联网中断距离0100 UTC左右（0400本地时间）开始，并在0530 UTC（0830 UTC）之后大约四个半小时结束。这涵盖了考试开始明显以防止任何辨别答案的时期。\n 如果要遵循其他中断剩余的七个考试，您可以在CloudFlare Radar叙利亚页面上看到实时数据。\n  CloudFlare雷达互联网使用 ", "note_en": "To prevent cheating in exams many countries restrict or  even shut down Internet access during critical exam hours. For most of June Syria is having planned Internet shutdowns during critical exam periods. The exam schedule is as follows:\n  I’m grateful to a  Twitter user for the translation from the  original Arabic and collating the data.\n Cloudflare Radar allows anyone to track Internet traffic patterns around the world, and it has country-specific pages. The chart for the last seven days of  Internet use in Syria as seen by Cloudflare shows two drops to almost zero corresponding to the first two exams on the schedule.\n  The Internet outage starts at around 0100 UTC (0400 local time) and ends about four and a half hours later at 0530 UTC (0830 UTC). This covers the period before the exams start apparently to prevent any figuring out the answers.\n If you want to follow the other outages for the remaining seven exams you can see live data on the  Cloudflare Radar Syria page.\n  Cloudflare Radar  Internet Usage", "posttime": "2021-06-18 04:19:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "考试,exam,互联网", "title": "叙利亚的考试相关互联网停工 ", "title_en": "Syria’s exam-related Internet shutdowns", "transed": 1, "url": "https://blog.cloudflare.com/syria-exam-related-internet-shutdowns/", "via": "", "real_tags": ["考试", "exam", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "97ffe19a4e608f46b3485a5d62dc7b69.png", "infoid": 1066567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有机地图是Maps.me，Android＆amp的更好的叉子。 iOS离线地图席位，基于人群源的OpenstreetMap数据的顶级，并通过Maps.me创始人策划与爱情策划。  加入我们的俄语小组在电报中进行反馈和帮助。 ", "note_en": "Organic Maps is a better fork of MAPS.ME, an Android &amp; iOS offline maps appfor travelers, tourists, hikers, and cyclists based on top of crowd-sourced OpenStreetMap data and curated with love by  MAPS.ME founders.\n                              Присоединяйтесь к нашей  русскоязычной группе в Telegram для обратной связи и помощи.", "posttime": "2021-06-18 04:19:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,ios,程序,游客,地图", "title": "有机方法：Android和iOS离线地图应用程序，游客，游客，徒步旅行者 ", "title_en": "Organicmaps: Android and iOS offline maps app for travelers, tourists, hikers", "transed": 1, "url": "https://github.com/organicmaps/organicmaps", "via": "", "real_tags": ["android", "ios", "程序", "游客", "地图"]}, {"category": "", "categoryclass": "", "imagename": "76850fef489a51b5344e47374d862189.jpg", "infoid": 1066566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "利用您所有计算机的资源，将Visual Studio缩放到最大的项目和复杂的工作负载，而不会耗尽内存。您可以继续运行和调试32位应用程序。\n 使用.NET 6和.NET MAUI框架开发跨平台和云应用程序。在Linux环境中构建，调试和测试.NET应用程序。\n Intellicode现在自动完成更大的代码块，一次直到一整行，通过更好地了解您的编码上下文，并利用近五百万个开源repos的代码模式的智慧。\n Visual Studio社区是一个免费，全面的IDE，用于学生，开源贡献者和个人开发人员。\n Visual Studio Professional是一种强大，全功能的IDE，可为开发人员设计，建设和部署任何平台的创新应用程序。\n Visual Studio Enterprise是一种强大，全面的IDE，可为开发人员设计，构建，测试和部署复杂应用程序，包括Microsoft Stack。\n 此预览未许可以构建生产应用程序。对于生产应用，请从下载页面下载稳定的Visual Studio版本。 \nVisual Studio 2022 RoadMap向您展示了我们正在处理的关键功能和功能的高级概述。  Visual Studio 2022路线图  Developer Division CVP Amanda Silver在Visual Studio 2022背后的大想法分享，并在我们未来的计划中瞥见。  阅读我们的Visual Studio 2022的愿景  Microsoft Program Managers Mads Kristensen和Andy Sterland深入了解64位Visual Studio对您意味着什么。  观看YouTube.  随着您评估Visual Studio 2022预览，您可以在开发人员社区中直接与Microsoft工程师进行互动。 您的错误报告，功能建议，升值和评论都帮助我们构建了我们可能的最佳IDE。 ", "note_en": "Take advantage of all your computer’s resources to scale Visual Studio to the largest of projects and complex workloads without running out of memory. You can continue to run and debug your 32-bit apps.\n Develop cross-platform and cloud apps with .NET 6 and .NET MAUI frameworks. Build, debug, and test .NET apps in Linux environments.\n IntelliCode now automatically completes larger chunks of code, up to a whole line at a time, by understanding your coding context better, and leveraging the wisdom of nearly half a million open source repos’ code patterns.\n Visual Studio Community is a free, fully-featured IDE for students, open-source contributors, and individual developers.\n Visual Studio professional is a powerful, fully-featured IDE for developers designing, building, and deploying innovative applications for any platform.\n Visual Studio Enterprise is a powerful, comprehensive IDE for developers designing, building, testing, and deploying complex applications for any platform—including the Microsoft stack.\n This Preview is not licensed to build production applications. For production applications please download stable release of Visual Studio from our  downloads page.\n The Visual Studio 2022 roadmap shows you a high-level overview of the key capabilities and features that we’re working on.\n   Visual Studio 2022 roadmap\n Developer Division CVP Amanda Silver shares the big ideas behind Visual Studio 2022 and offers a glimpse at our plans for the future.\n   Read our vision for Visual Studio 2022\n Microsoft program managers Mads Kristensen and Andy Sterland take a deep dive into what the 64-bit Visual Studio will mean to you.\n   Watch on YouTube\n As you evaluate Visual Studio 2022 Preview, you can interact directly with Microsoft engineers in our Developer Community. Your bug reports, feature suggestions, upvotes, and comments all help us build the best IDE that we possibly can.", "posttime": "2021-06-18 04:19:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "下载,visual,studio", "title": "Visual Studio 2022预览可供下载 ", "title_en": "Visual Studio 2022 Preview is available for download", "transed": 1, "url": "https://visualstudio.microsoft.com/vs/preview/vs2022/", "via": "", "real_tags": ["下载", "visual", "studio"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如我在我的时事通讯中所说的那样，我订阅了一堆废话，这对我来说非常吝啬，也不能为我提供任何价值。 这让我很长时间努力看看我订阅的180 +通讯，并将其归零到20表示我精心读取的。  级别.IO  - 只需点击博客帖子，你应该看到底部的订阅按钮....他的帖子非常罕见，但值得！ ", "note_en": "As I said in my newsletter, I subscribed to bunch of crap that didn&#39;t really mean much to me nor could provide me any value. This lead me to take a long hard look at the 180+ newsletters I subscribed to and zeroed that number down to 20 that I meticulously read.\n  Levels.io - Just click on a blog post and you should see a subscribe button at the bottom also....his post are very infrequent, but worth it!", "posttime": "2021-06-18 04:18:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "废话,bullshit,通讯", "title": "非废话通讯 ", "title_en": "Non-Bullshit Newsletters", "transed": 1, "url": "https://nic.bearblog.dev/20-no-bullshit-newsletters/", "via": "", "real_tags": ["废话", "bullshit", "通讯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "异步生锈是强大的，但是难以学习的声誉。有关如何解决最棘手的方面的各种想法，尽管焦点焦点在Tokio 1.0上，我已经能够致力于这些主题的很多焦点。然而，Niko的异步努力再次开始讨论，所以我以为我会花一些时间toparticipate。\n 在这篇文章中，我收集了一些先前提出的想法并提供了一些新那，将他们绑在一起，探索可能是什么。这种探索不是墨迹，但思想实验：如果我们不必担心现状，我们可以做些什么。对生锈进行重大变化将是破坏性的。我们需要一种严格的方式来确定利弊，以确定流失是值得的。我也敦促您使用OpenMind接近文章。我期待一些方面会产生立即不良反应。尝试将其妥善处理并用开放的思维方式接近它。\n 在探索不同的路径之前，异步生锈可能需要，我们应该先使用异步编程样式。毕竟，异步编程比使用线程更具挑战性。所以有什么好处？有些人可能会说原因是性能，并且异步代码是迅速的，因为线程太重了。现实更细致。根据详细信息，使用基于线程的Fori / O应用程序可以更快。例如，当存在少于约100个并发连接时，AthReaded Echo Server比AnaSynchronous版本更快。在此时，线程版本开始丢弃，但不会急剧上。\n 我相信异步的更好原因是它能够有效地建模复杂流控制。例如，暂停或取消Anin-Flight操作的模式是在没有异步编程的情况下具有挑战性。用线程，带有线程，连接之间的协调，并开始添加争用。使用异步编程，我们避免通过在同一线程上的多重连接上操作同步。\n Rust的异步模型是使我们能够建模复杂流控制的现象工作。例如，迷你redis的订阅者非常简洁而优雅。然而，这不是所有的阳光和rainbows。入门后，异步生锈的用户报告困惑的曲线。虽然入门感觉很直接，但很容易在意想不到的锋利边缘上倾斜。 Niko和其他人一直在做一个梦幻般的剧目，作为Async Visioneffort的一部分。虽然有几个前沿的人诊所，但我相信异步生锈的最大问题是它可以违反最小的原则。\n 让我们从一个例子开始。 Alanis学习锈，已阅读生锈书和Tokio指南，并希望Writea玩具聊天服务器。他选择了一个简单的基于线路的协议，并用长度前缀编码每个线。他的线路解析功能如下所示：\n 异步FN Parse_line（插座：＆amp; tcpstream） - ＆gt;结果＆lt;字符串，错误＆gt; {让Len =套接字。 read_u32（）。等待？ ;让mut线= vec！ [0; len];插座 。 read_exact（＆amp; mut线）。等待？ ;让Line = str :: from_utf8（行）？ ;好的（线）} \n除了异步和等待关键字之外，此代码看起来非常像阻止生锈代码。即使艾伦以前从未写过过生锈，他也可以阅读这个功能并了解它的行为方式，否则他的想法。当测试本文时，他的聊天服务器似乎工作，所以他发送了一个链接到Barbara.unfortonation），在聊天后，服务器崩溃了“Invalidutf-8”错误。艾伦陷入困惑;他检查了他的代码并发现没有明显的错误。\n 那有什么问题？事实证明，任务使用选择！更高的Inthe Call Stack：\n 循环{选择！ {line_in = parse_line（＆amp; socket）=＆gt; {如果让某些（line_in）= line_in {bascastring_line（line_in）; } else {//连接关闭，退出循环中断; line_out = channel。 recv（）=＆gt; {write_line（＆amp; socket，line_out）。等待; }}}\n 假设在频道上收到消息，同时Parse_Line正在等待Formore数据，选择！声明中止了PARSE_LINE操作，因此丢失了LOSEIN-进度解析状态。在以下循环迭代中，再次调用PARSE_LINE并从帧的中间开始，从而导致Gibberish。\n 其中有问题：任何异步生锈功能可能会在呼叫者取消它的任何一个时都可以停止运行，并且与阻塞生锈不同，取消是非典型异步操作。更糟糕的是，没有能力指导新用户努力这个行为。\n  如果我们可以解决这个问题，以便异步生锈会符合每一步的学习者屏所？如果行为必须偏离期望，那必须是指向学习者在正确的方向上指向学习者的承受。提出，我们希望尽量减少学习过程中的惊喜，特别是早期。\n 让我们首先来解决意外的取消问题，通过说始终运行到完成（首次提出）。使用完成保证的文件，Alan学习异步生锈表现类似于阻止生锈，但添加了异步和等待关键字。产卵任务AddScurcurency，以及任务之间的频道坐标。而不是选择！收入异步语句，它适用于频道和相同的频道类型（例如，JoinHandle）。 \nasync fn handle_connection（套接字：tcpstream，频道：频道）{让reader = arc :: new（套接字）;让作家=读者。克隆（）;让read_task = task :: spawn（异步移动{虽然让一些（line_in）在parse_line（＆amp; reader）中。等待{bascess_line（line_in）;}}）;循环{//`clion`和joinhandle都是＆＃34;频道＆＃34;类型。选择 ！ {res = read_task。加入（）=＆gt; {//连接关闭，退出循环中断; line_out =通道。 recv（）=＆gt; {write_line（＆amp; writer，line_out）。等待; }}}}}\n 代码类似于前面的示例，但是因为所有的异步分类都完成并选择！只接受类似频道的类型，调用parse_line（）移动到生成的任务。此更改可防止具有当今异步生锈的错误alanencounter。应该试着在选择中调用parse_line（）！声明，他将获得一个编译器错误，arecenceation才能产生任务。选择的频道等要求可确保中止丢失分支是安全的。通道可以存储值，并接收值是原子的。失败选择分支不会丢失取消数据。\n  如果撰写遇到错误，会发生什么？今天，Read_Task一直运行.Instead，Alan希望出错导致优雅地关闭连接和所有任务。不幸的是，这就是我们开始营运到设计挑战的地方。当我们随时丢弃任何异步声明时，取消是微不足道的：降低未来。我们需要一种方法来取消飞行中的运行，因为这种能力是使用异步编程的主要原因。为此，JoinHandle提供了取消（）方法：\n async fn handle_connection（套接字：tcpstream，频道：频道）{让reader = arc :: new（套接字）;让作家=读者。克隆（）;让read_task = task :: spawn（异步移动{同时让一些（line_in）在parse_line（＆amp; reader）中。等待？{bascast_line（line_in）？;}确定（（））}）;循环{//`clion`和joinhandle都是＆＃34;频道＆＃34;类型。选择 ！ {_ = read_task。加入（）=＆gt; {//连接关闭或我们遇到错误，//退出循环中断; line_out =通道。 recv（）=＆gt; {如果write_line（＆amp; writer，line_out）。等待。 is_err（）{read_task。取消 （）; read_task。加入 （）; }}}}}}\n 但取消（）做什么？它不能立即中止任务，因为现在保证了异步才能完成。我们确实希望消除的任务尽快停止处理和返回。相反，所有资源类型都是已取消的任务将停止运行并返回“中断”错误。使用它们的备份也将导致错误。除了kotlin之外，这种策略类似于Kotlin，jotlin提出了一个例外。如果在取消时read_task在parse_line（）中等待socket.read_u32（），则read_u32（）函数使用err（io :: errkdrind ::中断）返回默认。这  ？操作员泡起来的任务并导致任务终止。\n 乍一看，这种行为也可能看起来像任务任意停止，但这不是这种情况。对于Alan，当前的异步生锈Abortbehavior出现，因为任务无限期地悬挂。通过迫使资源，此类购物，返回取消错误，Alan可以遵循CleanationFlow。 Alan可以选择添加Println！语句或使用其他调试程序进行更好地了解已取消的任务如何终止。\n  Ubbeknst到Alan，他的聊天服务器正在避免使用大多数Syscalls。异步生锈可以透明地利用IO-URING API Chinkensto完成保证的期货和异步。当Alan在Handle_Connection（）末尾的TCPStream值下降时，套接字是同步关闭的。为此，TCPStream包括以下异步实现。 \nNIKO已经拥有使用ASYNC FN内部的PLAusibleProposal。剩下的开放问题是如何处理隐式.awaitPoint。目前，异步等待未来需要.await呼叫。当Avalue超出异步上下文中的范围时，Asyncdrop特性将添加编译器添加的隐藏产量点。这种行为将违反令人遗憾的是最不令人惊讶的。如果有互相明确的话，为什么会有隐含的等待点？\n 解决“有时隐式丢弃”问题的一个提议需要一个显式功能调用来异步执行丢弃。\n  当然，如果用户忘记异步丢弃呼叫会发生什么？毕竟，Thecompiler处理掉落带阻塞生锈，这是一个强大的功能。还清，注意上面的片段有一个微妙的错误：the？操作员在读取错误上跳过ASYNC_DROP呼叫。 Rust编译器可以提供警告当Acatch这个问题，但是修复了什么？有没有办法制作？兼容一个显式的异步_drop？\n  如果，而不是要求显式调用异步丢弃，我们删除了await关键字？在调用Anasync函数之后，ALAN将不再需要使用.Await（例如，Socket.read_u32（）。等待）。调用异步上下文中的异步函数时，.await成为隐含。\n 这看起来可能像今天的生锈一样大，而且它是。但是，我们要质疑我们的假设是好的。在亚伦的“推理特写”博客中布局的标准，它很有意思。隐式的.Await通过唯一在异步语句内闭塞的适用性和上下文依赖性。艾伦只能看看函数虚构，以知道他在异步上下文中。此外，它将容易突出显示屈服点。\n 删除.await有另一种好处：它带来了异步生锈，符合伯爵锈。阻止的概念已经隐含。通过阻止锈，我们不写my_socket.read（缓冲区）.block ?.当他写入Asynchronouschat服务器时，对ALAN的唯一明显的差异成为有必要使用ASYNC关键字函数的函数。艾伦可以在执行TheAnc代码的情况下。 “懒惰期货”的问题消失了，艾伦不能偶然下行并想知道为什么“两个”打印。\n async fn my_fn_one（）{println！ （＆＃34;一个＆＃34;）; } async fn my_fn_two（）{println！ （＆＃34;两个＆＃34;）; } async fn mixup（）{let一个= my_fn_one（）;让两个= my_fn_two（）;加入 ！ （二，一）; } \n“.await”RFC确实包括一些关于隐性等待的讨论。此时，对隐式等待的最引人注目的争论是，可以中止ASYNC语句的等待呼叫annotated积分。这参数使用完成保证的期货申请更少。当然，对于abort-safeAsync语句，应该保留await关键字吗？这个问题需要回答。无论如何，删除“.await”将是一个很大的变化，需要小心翼翼地接近。可用性研究需要证明该专业人员占缺点。\n  到目前为止，Alan可以使用异步生锈构建他的聊天服务器，没有学习的新概念或命中意外行为。他了解了选择！但是编译器强制选择在类似频道的类型上。除此之外，Alanadded Async对他的职能，它刚刚工作。他将代码显示为Barbaraand要求将套接字带有弧形。芭芭拉建议Helook进入范围任务作为一种避免分配的方法。\n 范围任务是CrossBeam的ScopedThreads的异步等效项：Taskthat可以借用Spawner拥有的数据。艾伦可以使用范围任务来避免在他的连接处理程序中的弧。\n 异步fn handle_connection（套接字：tcpstream，channel：channel）{task :: scope（异步| scope | {ver read_task = scope。spawn（async || {artew_in）parse_line（＆amp; socket）？{bascestr_line （line_in）？;}确定（（））}）;循环{//`clion`和joinhandle都是＆＃34;频道＆＃34;类型。选择！{_ = read_task。join（）=＆gt; {//连接关闭或我们遇到一个错误，//退出循环破;}。LINE_OUT =信道的recv（）=＆GT; {如果write_line（安培;写入器，LINE_OUT）。is_err（）{断裂;}}} }}）; }\n 确保安全的关键是保证范围在范围内所有任务所有的任务，或者换句话说，确保异步统计数据库。有一个缺点。支持范围的任务需要使“未来::民意调查”不安全，因为轮询完成将来成为必需的素质安全（在Matthias'RFC中覆盖）。加入不安全的不会用手实施未来更困难。作为缓解，我们需要消除几乎所有用户的需求，以便手动实施未来，包括在实现asyncread和asynciterator等特征时。 Ibelieve这是一个可实现的目标。\n 除了范围任务之外，确保Async语句完成可以在使用IO-Uraing或IntegratingWith C ++期货时从任务值到内核的传递点。在一些情况下，也可以避免产卵子任务的分配，这可能有助于嵌入的上下文，尽管它需要略有不同的API。\n  使用当今的异步生锈，应用程序可以通过使用SELECT来加入重新生物任务来添加并发性！或futuresundered。到目前为止，我们已经讨论了，选择了！我建议删除FuturiteUnOrdered，因为它是一个令人难题的错误。使用FututesUnOrdered时，它很容易产生任务，期待他们将在后台运行，然后在不发出任何进展时感到惊讶（请参阅状态Quostory）。 \n让问候=＆＃34;你好＆＃34; taxo_string（）; task :: scope（async | scope | {let mut task_set = scope.task_set（）;对于i在0..10 {task_set.spawn（async { Println！（＆＃34; {}从任务{}}}}}}}}}}}}}}}}}}}}}）;}在task_set中的resync for resync {println！（＆＃34;任务完成{：？}＆＃34 ;，res）;}}）;\n 每个生成的任务同时运行，来自产卵任务的借用数据，而taskset实用程序提供类似的API作为未经危险的FuturiteUnOrdered。其他基元，例如缓冲流，也可以实现方向op的范围任务。\n 有机会探索这些探索这些产品的新并发原语。例如，类似于kotlin的结构化并发性，现在将无法解决。 Matthias先前已经探索了这个空间，但是Butsynchronouse Rust的当前模型使得无法实现。通过SwitchPringAsynchronous Rust保证完成，我们解锁了这整个区域。\n  在文章的开头，我声称，使用异步程序化，我们有效地模拟复杂的流量控制。我们今天最有效的是我们选择！我还提出在本文中减少选择！仅接受类似频道的基元，强制alan将每次连接的Twotasks产卵同时读写。在产卵时，任务在取消读取操作时会阻止错误，它也可以是可以重写读取操作以容忍意外的取消。 forexample，当在迷你redis中解析帧时，我们首先存储在缓冲区中的接收数据。取消读取操作时，Nodata丢失，因为它位于缓冲区中。下一个读取的呼叫将恢复我们离开的地方。迷你redis读取操作是abort-safe。\n 如果，而不是限制选择！向频道相同的类型，我们限制它toabort安全操作。从频道接收的是中止 - 安全，但是读取了缓冲的I / O句柄。这里的点是，而不是假设AllaseNous操作是中止 - 安全的，我们要求开发人员选择将＃[abort_safe]（或异步（中止））替换为其函数定义。本文策略有一些优势。首先，当ALAN正在学习异步时，他不需要知道任何关于中止安全的东西。通过产卵来获得并发的情况，可以在没有概念的情况下实现一切。\n ＃[abort_safe]异步fn Read_line（＆amp; mut self） - ＆gt; IO ::结果＆lt;选择＆lt;字符串＆gt;＆gt; {循环{//如果让某些（行）= self，则使用缓冲区中的全行。 parse_line（）？ {返回OK（线）;如果0 == self，则缓冲已缓冲全线的数据被缓冲到了。插座 。 read_buf（＆amp; mut self。缓冲区）？ {//远程关闭连接。如果是自我。缓冲 。 is_empty（）{返回OK（无）; }否则{返回错误（＆＃34;通过对等＆＃34重置连接;进入（））; }}}}}\n 它而不是默认成为安全的语句，而是选择选择。本文策略遵循展开安全的现有模式。当NewDeveloper跳入代码时，注释会通知它们函数秉承中止安全保证。 Rust编译器甚至可以提供使用＃[abort_safe]注释的函数的DirectEdal检查和警告。 \n现在，ALAN可以从带有“选择！”的循环中的read_line（）函数。\n 循环{选择！ {line_in =连接。 read_line（）？ =＆gt; {如果让某些（line_in）= line_in {bascastring_line（line_in）; } else {//连接关闭，退出循环中断; line_out = channel。 recv（）=＆gt; {    联系 。 write_line（line_out）？ ; }}}\n  ＃[abort_safe]注释引入了两个异步的两个变体。与非中止安全陈述的混合中止保险箱需要专项。始终可以调用中止安全功能，无论是来自中止 - 安全还是非中止安全的上下文。但是，Rust编译器将防止来自中止安全上下文的非中止安全功能，并提供Ahelpful错误消息。\n async fn mescplete（）{...}＃[abort_safe] async fn can_abort（）{//无效呼叫=＆gt; compiler错误must_complete（）; }\n async fn mescplete（）{...}＃[abort_safe] async fn can_abort（）{//有效调用spawn（async {must_complete（）}）\n...... ", "note_en": "Asynchronous Rust is powerful but has a reputation for being hard to learn.There have been various ideas on how to fix the trickiest aspects, though withmy focus being on  Tokio 1.0, I hadnot been able to dedicate much focus to those topics. However, Niko’s  asyncvision effort hasrecently started the discussion again, so I thought I would take some time toparticipate.\n In this article, I collect some previously proposed ideas and offer some newones, tying them together to explore what could be. This exploration isn’t aproposal but a thought experiment: what could we do if we didn’t have to worryabout the status quo. Making a significant change to Rust would be disruptive.We would need a rigorous way to determine the pros and cons to determine thatthe churn is worth it. I also urge you to approach the article with an openmind. I expect some aspects will generate an immediate adverse reaction. Try tosuppress it and approach it with an open mind.\n Before exploring different paths asynchronous Rust could take, we should firstunderstand when to use asynchronous programming styles. After all, asynchronousprogramming is more challenging than just using threads. So what is the benefit?Some might say the reason is performance and that asynchronous code is fasterbecause threads are too heavyweight. Reality is more nuanced. Using threads forI/O based application can be faster depending on details. For example, athreaded  echo server is faster than anasynchronous version when there less than about 100 concurrent connections.After that, the threaded version starts dropping off, but not drastically.\n I believe that the better reason for asynchronous is it enables modeling complexflow control efficiently. For example, patterns like pausing or canceling anin-flight operation are challenging without asynchronous programming.Furthermore, with threads, coordinating between connections requiressynchronization primitives and starts adding contention. With asynchronousprogramming, we avoid adding synchronization by operating on multipleconnections on the same thread.\n Rust’s asynchronous model does a phenomenal job of enabling us to model complexflow control. For example,  mini-redis’ subscribecommandimplementation is very concise and elegant. Yet, it isn’t all sunshine andrainbows. When getting started, users of asynchronous Rust report a confusinglearning curve. While getting started feels straightforward, it is easy tostumble on unexpected sharp edges. Niko and others have been doing a fantasticjob cataloging the sharp edges as part of the  async visioneffort. While there areopportunities to improve on several fronts, I believe that the biggest issuewith asynchronous Rust is that it can violate the principle of least surprise.\n Let’s start with an example. Alanis learning Rust, has read the Rust book and the Tokio guide, and wants to writea toy chat server. He opts for a simple line-based protocol and encodes eachline with a length prefix. His line parsing function looks like this:\n async   fn  parse_line ( socket:  &amp; TcpStream )  -&gt;  Result &lt; String ,   Error &gt;   {    let   len   =   socket . read_u32 (). await ? ;    let   mut   line   =   vec ! [ 0 ;   len ];    socket . read_exact ( &amp; mut   line ). await ? ;    let   line   =   str:: from_utf8 ( line ) ? ;    Ok ( line )   }\n This code looks very much like blocking Rust code except for the  async and await keywords. Even though Alan has never written Rust before, he can readthis function and understand how it behaves, or so he thinks. When testinglocally, his chat server appears to work, so he sends a link to Barbara.Unfortunately, after chatting for a bit, the server crashes with an “invalidUTF-8” error. Alan is baffled; he inspects his code and finds no apparent bugs.\n So what is the problem? It turns out that the task uses a  select! higher up inthe call stack:\n loop   {    select !   {    line_in   =   parse_line ( &amp; socket )   =&gt;   {    if   let   Some ( line_in )   =   line_in   {    broadcast_line ( line_in );    }   else   {    // connection closed, exit loop    break ;    }    }    line_out   =   channel . recv ()   =&gt;   {    write_line ( &amp; socket ,   line_out ). await ;    }    }   }\n Suppose a message is received on  channel while  parse_line is waiting formore data, the  select! statement aborts the  parse_line operation, losingin-progress parsing state as a result. In the following loop iteration, parse_line is called again and starts from the middle of a frame, resulting inreading gibberish.\n Therein lies the problem: any async Rust function may stop running at any timeif the caller cancels it, and unlike with blocking Rust, cancellation is atypical asynchronous operation. Worse, no affordance guides new users todiscover this behavior.\n  What if we could fix this so that asynchronous Rust meets the learner’sexpectations at each step? If behavior must deviate from expectations, thenthere must be an affordance to point the learner in the right direction.Additionally, we want to minimize surprises during the learning process,especially early on.\n Let’s start by fixing the unexpected cancellation problem by saying that asyncfunctions always run to completion (first proposed here). With completion-guaranteedfutures, Alan learns that asynchronous Rust behaves like blocking Rust, but withthe addition of the  async and  await keywords. Spawning tasks addsconcurrency, and channels coordinate between tasks. Instead of  select! takingarbitrary async statements, it works with channels and channel-like types (e.g., JoinHandle).\n  async   fn  handle_connection ( socket:  TcpStream ,   channel:  Channel )   {    let   reader   =   Arc:: new ( socket );    let   writer   =   reader . clone ();      let   read_task   =   task:: spawn ( async   move   {    while   let   Some ( line_in )   in   parse_line ( &amp; reader ). await   {    broadcast_line ( line_in );    }    });      loop   {    // `channel` and JoinHandle are both &#34;channel-like&#34; types.    select !   {    res   =   read_task . join ()   =&gt;   {    // The connection closed, exit loop    break ;    }    line_out   =   channel . recv ()   =&gt;   {    write_line ( &amp; writer ,   line_out ). await ;    }    }    }   }\n The code is similar to the earlier example, but because all async statementsmust complete and  select! only accepts channel-like types, the call to parse_line() moves to a spawned task. This change prevents the error Alanencounters with today’s asynchronous Rust. Should Alan try to call parse_line() in the  select! statement, he would get a compiler error with arecommendation to spawn a task. Select’s channel-like requirement ensures thatit is safe to abort losing branches. Channels can store values, and receivingthe value is atomic. Losing select branches does not lose data on cancelation.\n  What happens if writing encounters an error? Today,  read_task keeps running.Instead, Alan wants an error to result in gracefully closing the connection andall tasks. Unfortunately, this is where we start running into design challenges.When we can drop any async statement at any time, cancellation is trivial: dropthe future. We need a way to cancel an in-flight operation as this ability isone of the primary reasons to use asynchronous programming. To achieve this, JoinHandle provides a  cancel() method:\n async   fn  handle_connection ( socket:  TcpStream ,   channel:  Channel )   {    let   reader   =   Arc:: new ( socket );    let   writer   =   reader . clone ();      let   read_task   =   task:: spawn ( async   move   {    while   let   Some ( line_in )   in   parse_line ( &amp; reader ). await ?   {    broadcast_line ( line_in ) ? ;    }      Ok (())    });      loop   {    // `channel` and JoinHandle are both &#34;channel-like&#34; types.    select !   {    _   =   read_task . join ()   =&gt;   {    // The connection closed or we encountered an error,    // exit the loop    break ;    }    line_out   =   channel . recv ()   =&gt;   {    if   write_line ( &amp; writer ,   line_out ). await . is_err ()   {    read_task . cancel ();    read_task . join ();    }    }    }    }   }\n But what does  cancel() do? It cannot immediately abort the task because asyncstatements are now guaranteed to complete. We do want the canceled task to stopprocessing and return as soon as possible. Instead, all resource types withinthe canceled task will stop operating and return an “interrupted” error. Furtherattempts to use them will also result in errors. This strategy is similar to Kotlin, exceptthat Kotlin raises an exception. If  read_task is awaiting  socket.read_u32()in  parse_line() when canceled, then the  read_u32() function returnsimmediately with  Err(io::ErrorKind::Interrupted). The  ? operator bubbles upthe task and results in the task terminating.\n At first glance, this behavior may also seem like the task arbitrarily stopsrunning, but this is not the case. To Alan, the current async Rust abortbehavior appears as the task hangs indefinitely. By forcing resources, such assockets, to return an error on cancellation, Alan can follow the cancelationflow. Alan may choose to add  println! statements or use other debuggingstrategies to understand better how the canceled task terminates.\n  Unbeknownst to Alan, his chat server is avoiding most syscalls by usingio-uring. Asynchronous Rust can transparently leverage the io-uring API thanksto completion-guaranteed futures and  AsyncDrop. When Alan drops the TcpStream value at the end of  handle_connection(), the socket isasynchronously closed. To do this, the  TcpStream includes the following AsyncDrop implementation.\n  Niko already has a  plausibleproposal for using  async fn intraits. The remaining open question is how to handle the implicit  .awaitpoint. Currently, asynchronously awaiting a future requires an  .await call. An AsyncDrop trait would add a hidden yield point added by the compiler when avalue goes out of scope within an async context. This behavior would violate theprinciple of least surprise. Why would there be implicit await points if othersare explicit?\n One proposal to solve the “sometimes implicit drop” problem requires an explicitfunction call to perform the drop asynchronously.\n  Of course, what happens if the user forgets the async drop call? After all, thecompiler handles dropping with blocking Rust, and this is a powerful feature.Also, note how the snippet above has a subtle bug: the  ? operator skips the async_drop call on a read error. The Rust compiler could provide warnings thatcatch the problem, but what is the fix? Is there a way to make  ? compatiblewith an explicit  async_drop?\n  What if, instead of requiring explicit calls to async drop, we remove the await keyword? Alan would no longer have to use  .await after calling anasync function (e.g.,  socket.read_u32().await). When calling an async functionwithin an async context, the  .await becomes implicit.\n This may seem like a big departure from today’s Rust, and it is. But it is goodfor us to question our assumptions. It’s interesting to look at .await in lightof the criteria laid out in Aaron’s “ Reasoningfootprint” blogpost. Implicit  .await has limited applicability and context-dependence by onlyoccurring within async statements. Alan only has to look at the functiondefinition to know he is within an async context. Additionally, it would be easyfor an IDE to highlight yield points.\n Removing  .await has another benefit: it brings async Rust in line withblocking Rust. The concept of blocking is already implicit. With blocking Rust,we don’t write  my_socket.read(buffer).block?. When he writes his asynchronouschat server, the only noticeable difference to Alan becomes the need to annotatehis functions with the  async keyword. Alan can intuit the execution of theasync code. The issue of “lazy futures” goes away, and Alan cannot accidentallydo the following and wonder why “two” prints first.\n async   fn  my_fn_one ()   {    println ! ( &#34;one&#34; );   }    async   fn  my_fn_two ()   {    println ! ( &#34;two&#34; );   }    async   fn  mixup ()   {    let   one   =   my_fn_one ();    let   two   =   my_fn_two ();      join ! ( two ,   one );   }\n The “.await” RFC did include some discussion of implicit await. At that time,the most compelling argument against implicit awaits was that the await callsannotated points at which the async statement could be aborted. This argumentwould apply less with completion-guaranteed futures. Of course, with abort-safeasync statements, should the await keyword remain? This question would need tobe answered. Regardless, removing “.await” would be a big change and would needto be approached cautiously. Usability studies would need to demonstrate thatthe pros outweigh the cons.\n  So far, Alan can build his chat server with asynchronous Rust without learningmany new concepts or hitting unexpected behavior. He learned about  select! butthe compiler enforces selecting over channel-like types. Besides that, Alanadded  async to his functions, and it just worked. He shows his code to Barbaraand asks about needing to wrap the socket with an  Arc. Barbara suggests helooks into scoped tasks as a way to avoid the allocation.\n A scoped task is the asynchronous equivalent of crossbeam’s  scopedthreads: a taskthat can borrow data owned by the spawner. Alan can use a scoped task to avoidthe Arc in his connection handler.\n async   fn  handle_connection ( socket:  TcpStream ,   channel:  Channel )   {    task:: scope ( async   | scope |   {    let   read_task   =   scope . spawn ( async   ||   {    while   let   Some ( line_in )   in   parse_line ( &amp; socket ) ?   {    broadcast_line ( line_in ) ? ;    }     Ok (())    });      loop   {    // `channel` and JoinHandle are both &#34;channel-like&#34; types.    select !   {    _   =   read_task . join ()   =&gt;   {    // The connection closed or we encountered an error,    // exit the loop    break ;    }    line_out   =   channel . recv ()   =&gt;   {    if   write_line ( &amp; writer ,   line_out ). is_err ()   {    break ;    }    }    }    }    });   }\n The key to ensuring safety is guaranteeing that the scope outlives all tasksspawned within the scope, or, in other words, ensuring that async statementscomplete. There is a downside. Enabling scoped tasks requires making“Future::poll” unsafe as polling the future to completion becomes required formemory safety (covered in Matthias’ RFC). The addition of unsafe wouldmake implementing  Future by hand much more difficult. As a mitigation, we needto remove the need for virtually all users to implement  Future by hand,including when implementing traits like  AsyncRead and  AsyncIterator. Ibelieve this is an achievable goal.\n Besides scoped tasks, ensuring async statement completion enables passingpointers from the task value to the kernel when using io-uring or integratingwith C++ futures. In some cases, it may also be possible to avoid the allocationwhen spawning sub-tasks, which could be helpful in embedded contexts, though itwould require a slightly different API than above.\n  With today’s asynchronous Rust, applications can add concurrency by spawning anew task, using  select! or  FuturesUnordered. So far, we have discussedspawning and  select!. I propose removing  FuturesUnordered as it is a commonsource of bugs. When using  FuturesUnordered, it is easy to spawn tasks intoit, expecting they will run in the background, then be surprised when they don’tmake any progress (see  status quostory).\n  let greeting = &#34;Hello&#34;.to_string();task::scope(async |scope| { let mut task_set = scope.task_set(); for i in 0..10 { task_set.spawn(async { println!(&#34;{} from task {}&#34;, greeting, i); i }); } async for res in task_set { println!(&#34;task completed {:?}&#34;, res); }});\n Each spawned task runs concurrently, borrows data from the spawning task, andthe  TaskSet utility provides a similar API as  FuturesUnordered without thehazard. Other primitives, such as buffered streams, can also be implemented ontop of scoped tasks.\n There is an opportunity to explore new concurrency primitives on top of theseprimitives. For example, structured concurrency, similar to Kotlin, would now bepossible. Matthias has  previouslyexplored this space, butasynchronous Rust’s current model makes it impossible to achieve. By switchingasynchronous Rust to guarantee completion, we unlock this whole area.\n  At the beginning of the article, I claimed that using asynchronous programmingenables us to model complex flow control efficiently. The most effectiveprimitive we have today is  select!. I also proposed in this article to reduce select! only to accept channel-like primitives, forcing Alan to spawn twotasks per connection to read and write concurrently. While spawning a task doeshelp prevent bugs when canceling the read operation, it also would have beenpossible to rewrite the read operation to tolerate unexpected cancellation. Forexample, when parsing frames in mini-redis,we first store received data in a buffer. When canceling the read operation, nodata is lost because it is in the buffer. The next call to read will resume fromwhere we left off. The Mini-Redis read operation is abort-safe.\n What if, instead of limiting  select! to channel-like types, we restrict it toabort-safe operations. Receiving from a channel is abort-safe, but so is readingfrom a buffered I/O handle. The point here is, instead of assuming that allasynchronous operations are abort-safe, we require the developer to opt-in byadding  #[abort_safe] (or  async(abort)) to their function definition. Thisopt-in strategy has a few advantages. First, when Alan is learning asynchronousRust, he doesn’t need to know anything about abort safety. It is possible toimplement everything without the concept by spawning to get concurrency.\n #[abort_safe]   async   fn  read_line ( &amp; mut   self )  -&gt;  io:: Result &lt; Option &lt; String &gt;&gt;   {    loop   {    // Consume a full line from the buffer    if   let   Some ( line )   =   self . parse_line () ?   {    return   Ok ( line );    }     // Not enough data has been buffered to parse a full line    if   0   ==   self . socket . read_buf ( &amp; mut   self . buffer ) ?   {    // The remote closed the connection.    if   self . buffer . is_empty ()   {    return   Ok ( None );    }   else   {    return   Err ( &#34;connection reset by peer&#34; . into ());    }    }    }   }\n Instead of having the default be abort-safe statements, it becomes opt-in. Thisopt-in strategy follows the existing pattern around unwind safety. When a newdeveloper jumps into the code, the annotation informs them that the functionmust uphold the abort safety guarantees. The rust compiler may even provideadditional checks and warnings for functions annotated with  #[abort_safe].\n Now Alan can use his  read_line() function from a loop with “select!”.\n loop   {    select !   {    line_in   =   connection . read_line () ?   =&gt;   {    if   let   Some ( line_in )   =   line_in   {    broadcast_line ( line_in );    }   else   {    // connection closed, exit loop    break ;    }    }    line_out   =   channel . recv ()   =&gt;   {    connection . write_line ( line_out ) ? ;    }    }   }\n  The  #[abort_safe] annotation introduces two variants of asynchronousstatements. Mixing abort-safe with non-abort-safe statements requires specialconsideration. Calling an abort-safe function is always possible, whether froman abort-safe or non-abort-safe context. However, the Rust compiler will preventcalling non-abort-safe functions from an abort-safe context and provide ahelpful error message.\n async   fn  must_complete ()   {   ...   }    #[abort_safe]   async   fn  can_abort ()   {    // Invalid call =&gt; compiler error    must_complete ();   }\n async   fn  must_complete ()   {   ...   }    #[abort_safe]   async   fn  can_abort ()   {    // Valid call    spawn ( async   {   must_complete ()   })\n......", "posttime": "2021-06-18 04:18:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,生锈,async,任务", "title": "使异步生锈更容易六种方法 ", "title_en": "Six ways to make async Rust easier", "transed": 1, "url": "https://carllerche.com/2021/06/17/six-ways-to-make-async-rust-easier/", "via": "", "real_tags": ["rust", "生锈", "async", "任务"]}, {"category": "", "categoryclass": "", "imagename": "737a134a6ce5ce33e5af302ce0d43c80.jpg", "infoid": 1066562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple调整了AppleCare + MacBook Air和MacBook Pro用户计划的定价，第一次具有英特尔和M1动力机器的显着区别。从今天开始，选择其他国家，AppleCare +现在比英特尔MacBook Pro更便宜，而不是英特尔MacBook Pro。\n  正如Macrumors所发现的第一次，AppleCare +对于MacBook Air现在比以前更便宜50美元，并将苹果降低到249美元至199美元的价格。此更改适用于英特尔和M1供电的MacBook Air模型。\n 同时，MacBook Pro的事情更有趣。 Apple现在已将13英寸MacBook Pro分为两个单独的列表。 13英寸M1 MacBook Pro的AppleCare +现在可以使用249美元，从以前的价格为269美元。 13英寸MacBook Pro的AppleCare +带Intel的售价为269美元。\n  AppleCare +对于Mac将您的覆盖范围扩展到您的AppleCare +购买日期三年，每12个月增加了两次意外损坏保护，每12个月，屏幕损坏或外部机箱损坏的服务费为99美元，或其他损害299美元，加上适用的税。此外，您还可以通过聊天或电话获得24/7优先权访问Apple专家。\n 看到Apple让AppleCare +略便宜，看起来很有趣，看看这一趋势是否持续到苹果芯片。 Apple概述了在Mac购买的60天内购买AppleCare +的多种方式：\n 在Apple Store（如果AppleCare +从Mac分开购买，则需要检查MAC和购买证明）\n  您正在阅读9To5MAC  - 在日复一日的日复一日地打破苹果及其周围生态系统的新闻的专家。请务必查看我们的主页，以了解所有最新消息，然后在Twitter，Facebook和LinkedIn上关注9to5Mac以留在循环中。不知道从哪里开始？查看我们的独家故事，评论，How-TO，以及订阅我们的YouTube频道 ", "note_en": "Apple has adjusted the pricing of AppleCare+ plans for MacBook Air and MacBook Pro users, with a notable distinction between Intel and M1-powered machines for the first time. Starting today in the United States and select other countries, AppleCare+ is now cheaper for the 13-inch M1 MacBook Pro than for the Intel MacBook Pro.\n  As first spotted by   MacRumors , AppleCare+ for the MacBook Air is now $50 cheaper than before, with Apple lowering the price from $249 to $199. This change applies to both Intel and M1-powered MacBook Air models.\n Meanwhile, things are more interesting for the MacBook Pro. Apple has now split the 13-inch MacBook Pro into two separate listings. AppleCare+ for the 13-inch M1 MacBook Pro is now available for $249, down from the previous pricing of $269. AppleCare+ for the 13-inch MacBook Pro with Intel remains priced at $269.\n  AppleCare+ for Mac extends your coverage to three years from your AppleCare+ purchase date and adds up to two incidents of accidental damage protection every 12 months, each subject to a service fee of $99 for screen damage or external enclosure damage, or $299 for other damage, plus applicable tax. In addition, you’ll get 24/7 priority access to Apple experts via chat or phone.\n It’s notable to see Apple making AppleCare+ slightly cheaper, and it will be interesting to see if this trend  continues as more Macs are transitioned to Apple Silicon. Apple outlines multiple ways to buy AppleCare+ for your Mac within 60 days of your Mac purchase:\n At an Apple Store (if AppleCare+ is purchased separately from Mac, inspection of Mac and proof of purchase are required)\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-06-18 04:17:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,电脑,降价,drops,applecare", "title": "Apple降价AppleCare +的笔记本电脑价格，额外折扣M1 ", "title_en": "Apple drops price of AppleCare+ for laptops, with an extra discount for M1", "transed": 1, "url": "https://9to5mac.com/2021/06/17/applecare-plus-price-drop-details/", "via": "", "real_tags": ["apple", "电脑", "降价", "drops", "applecare"]}, {"category": "", "categoryclass": "", "imagename": "8e2e2f771764a0390f823b93e60325d8.jpg", "infoid": 1066560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过多年的调情，谷歌上个月宣布了首次永久零售地点。今天，6月17日，是官方的盛大开幕，谷歌庆祝博客帖子，详细说明商店的样子。\n 正式，这是＆＃34;谷歌商店切尔西，＆＃34;它在15日和9日，又名Chelsea Market大厦，又名谷歌和＃39;纽约市校园的总部。与谷歌追逐的斯塔克白苹果商店不同，谷歌商店有一个天然的外观，温暖的木墙和家具。异想天开的Bendy Rods从地板上射出并装饰商店，看起来像一个来自儿科医生＆＃39; S办公室的巨型版本。该商店是由常见的硬件设计副总裁常春藤罗斯设计的。\n  你能在谷歌商店买什么？它基本上是Store.Google.com的脱机版本。这意味着它将出售像素手机，耳塞，PixelBook笔记本电脑，Chromecast，Google TV，Stadia控制器和嵌套品牌扬声器，智能显示器，恒温器，烟雾探测器，摄像机，Wi-Fi路由器和门铃。谷歌还指出它将＆＃34;有专家帮助访问者充分利用他们的设备，例如故障排除问题，修复破解的像素屏幕，或帮助安装。＆＃34; ＆＃34;沙盒＆＃34;像素，体育群岛和巢穴的区域将以各种产品线的优势支持客户。像素区域展示了通过各种照明效果的手机＆＃39; S相机技术; Stadia地区是公众实际上可以尝试游戏流服务的唯一一个地方之一;巢部分是一个装满智能家居设备的大客厅。 A＆＃34;研讨会＆＃34;空间将举办常规活动和课程。 ＆＃39;也是一个旋转展览，称为＆＃34;谷歌想象空间，＆＃34; A＆＃34; 17英尺高的圆形玻璃结构＆＃34;围绕着几个垂直屏幕的访客。现在，它＆＃39;谷歌翻译和游客可以＆＃34;经验同时发生你的演讲的实时翻译成24种语言，然后使用多个谷歌技术了解这一切都会发生这种情况。＆＃34 ;\n     它很难说，如果这是谷歌＆＃39; s nyc hq的一次性虚荣店，或者谷歌越来越认真地了解零售店。博客文章的共同作者之一是＆＃34;储存设计头部的Nathan Allen;特殊项目，＆＃34;这是一家零售店的一家公司的人的一个非常有趣的头衔。据艾伦＆＃39;领英，他举行了＆＃34的标题;体育和amp的设计负责人;特殊项目＆＃34;直到两个月前，但＆＃34;商店设计和＃34负责人;显然提供了足够的工作，现在是他的全职工作。博客帖子还指出，在商店的开发期间，谷歌＆＃34;在山景中建立了零售机库的空间的全面样机。＆＃34;再次，拥有一个＆＃34;零售机库＆＃34;试验声音，如过程的一部分而不是一次性的东西。\n  Apple拥有500多家物理苹果商店，但该公司也是一个硬件Juggernaut。如果谷歌和＃39; L有限和不一致的硬件选择可以支持零售商店，它＆＃39 Microsoft在类似的船上作为谷歌，运输低批量，在生态系统中的抱负硬件淹没了受妥协的合作伙伴设备。微软于2009年开始零售商店的想法，并最终在2020年离开了空间。无论谷歌＆＃39;未来的未来零售计划，这个谷歌商店将成为一个特殊的案例。谷歌拥有整个建筑物，所以它与零售商业的风险不足，因为无论如何都是财产成本。谷歌正在从可能是办公空间进入公共零售店的地面5000平方英尺。如果想法备受出答，也许公司将建造更多商店。如果没有，商店可以作为虚荣项目粘附，或者可以返回办公空间。 ", "note_en": "After  years of flirting with the idea of opening a physical store, Google announced its first-ever permanent retail location last month. Today, June 17, is the official grand opening, and Google celebrated with  a blog post detailing what the store is like.\n Officially, this is &#34;The Google Store Chelsea,&#34; and it lives in New York City on 15th and 9th, aka the Chelsea Market building, aka the headquarters of Google&#39;s New York City campus. Unlike the stark white Apple Stores that Google is chasing after, the Google Store has a natural look, with warm wood walls and furniture. Whimsical bendy rods shoot out of the floor and decorate the store, looking like a giant version of a  bead maze from a pediatrician&#39;s office. The store was designed by Ivy Ross, Google’s VP of hardware design.\n  What can you buy in a Google Store? It&#39;s essentially an offline version of  store.google.com. That means it will sell Pixel phones, earbuds, Pixelbook laptops, Chromecasts, Google TVs, Stadia controllers, and Nest-branded speakers, smart displays, thermostats, smoke detectors, cameras, Wi-Fi routers, and doorbells. Google also notes that it will &#34;have experts on hand to help visitors get the most out of their device, such as troubleshooting an issue, fixing a cracked Pixel screen, or helping with installations.&#34; &#34;Sandbox&#34; areas for Pixel, Stadia, and Nest will pitch customers on the benefits of each product line. The Pixel area shows off the phone&#39;s camera technology with various lighting effects; the Stadia area is one of the only places the public can actually try the game streaming service; and the Nest section is a big living room full of smart home devices. A &#34;workshop&#34; space will host regular events and lessons. There&#39;s also a rotating exhibit called the &#34;Google Imagination Space,&#34; a &#34;17-foot-tall circular glass structure&#34; that surrounds a visitor with several vertical screens. Right now, it&#39;s pitching Google Translate, and visitors can &#34;experience real-time translation of your speech into 24 languages simultaneously and then learn how this all happens on the back end using several Google technologies.&#34;\n     It&#39;s hard to say if this is a one-off vanity store for Google&#39;s NYC HQ or if Google is  getting serious about retail. One of the co-authors of the blog post is &#34;Nathan Allen, Head of Store Design &amp; Special Projects,&#34; which is a very interesting title for someone at a company with a single retail store. According to  Allen&#39;s LinkedIn, he held the title of &#34;Head of Design for Experiential &amp; Special Projects&#34; until two months ago, but &#34;Head of Store Design&#34; apparently provides enough work to be his full-time job now. The blog post also notes that during the development of the store, Google &#34;built a full-scale mockup of the space at our retail hangar in Mountain View.&#34; Again, having a &#34;retail hangar&#34; to experiment with sounds like part of a process rather than a one-off thing.\n  Apple has over 500 physical Apple Stores, but the company is also a hardware juggernaut. It&#39;s not clear if Google&#39;s limited and inconsistent hardware selection can support a retail store. Microsoft is in a similar boat as Google, shipping low-volume, aspirational hardware in an ecosystem flooded with compromised partner devices. Microsoft started its retail store idea in 2009 and ended up  getting out of the space in 2020. Regardless of Google&#39;s future retail plans, this Google Store is going to be a special case. Google owns this entire building, so it&#39;s not risking much as a retail venture since the property costs are accruing anyway. Google is turning 5,000 square feet of the ground floor from what could be office space into a public retail store. If the idea works out, maybe the company will build more stores. If not, the store can either stick around as a vanity project or can go back to being office space.", "posttime": "2021-06-18 03:40:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,retail", "title": "这是谷歌首次零售店内的内容 ", "title_en": "Here’s what’s inside Google’s first-ever retail store", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/heres-whats-inside-googles-first-ever-retail-store/", "via": "", "real_tags": ["google", "谷歌", "retail"]}, {"category": "", "categoryclass": "", "imagename": "cd9a25ed5b0bc35dd6ab228151e8cec0.jpg", "infoid": 1066559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "遵守量子力学规则的对象与我们周围熟悉的世界的行为相同。那个差异导致一个明显的问题：是否有可能获得日常项目开始表现出像量子对象？\n 但看到量子行为需要限制对象和＃39;互动与其环境变得越来越困难，因为物体变大。尽管如此，在增加我们可以以量子状态放置的物体的大小，具有进展的进展，具有小振荡器，甚至是砂粒是显着的例子。\n 到目前为止，研究人员很大程度上通过缩放相对容易使用的系统来实现这一挑战。但在今天的科学问题中，研究人员报告说，他们靠近将一个大物体放入其量子地面，这是一个真正的大物体：被称为Ligo的40千克镜子的重力观测所。\n  镜子是利加乐的功能的核心。它们＆＃39;重新放置在长隧道的相对端上，允许激光多次沿着隧道来回弹跳。这使得光的光远程远远较大，因此更有可能在通过引力波来体验可测量的影响。\n 镜子中的任何噪音都会导致探测器的功能出现问题，因此它们以各种方式稳定＆＃39。首先，它们＆＃39;重沉，称重40千克（88.2磅）。它们＆＃39; RE也悬挂在刚性电缆上，使镜子变成类似于摆锤的东西。最后，阻尼系统读取镜子的位置并施加力以使其保持在其预期的位置。\n    阻尼系统是目前实验的关键。该设置包括一些金电极，它们本身偏振镜子。这允许控制电压赋予镜子的力。处理镜子的位置和运动的测量和计算的补偿力，并且产生适当的信号以通过电气系统施加该力。\n 该系统具有必要的延迟，因为控制回路中涉及的计算竞争效果效果＆＃39; t瞬间执行。并且，由于系统充当摆锤，所以施加到它的任何力可以用于减慢其电流摆动或加速它以在不同的频率上摆动。 \n幸运的是，这里涉及的延迟旨在抑制系统，而不是改变其频率。 （这在技术上仅为单一模式或频率范围，摆动的单一模式或频率范围;）随着时间的推移，随着系统的持续调整，效果是从系统中排出能量，有效地冷却它。在一段时间内，研究人员估计其有效温度仅为77纳米 - 开尔文，或者非常接近绝对零。\n 研究人员还在声子方面，振动的量子单位。在过程结束时，40千克镜子中可能有11个声子。那个＆＃39; s不是量子地面状态，这将涉及排空声子系统。但它非常接近，并且可能已经有助于研究大物体上的量子现象;如果没有，它会＆＃39; t act uply改进了。\n 作者认为最令人兴奋的前景是摆动的运动也取决于引力效应，我们＆＃39; ve无法与量子力学协调。新的工作，他们建议，＆＃34;暗示在巨型量子系统上研究引力脱机的诱惑前景。＆＃34;而且，与一粒沙子相比，40公斤肯定有资格与巨大一样。 ", "note_en": "Objects that obey the rules of quantum mechanics behave very differently from those in the familiar world around us. That difference leads to an obvious question: is it possible to get an everyday item to start behaving like a quantum object?\n But seeing quantum behavior requires limiting an object&#39;s interactions with its environment, which becomes increasingly difficult as objects get larger. Still, there has been progress in increasing the size of the objects we can place in a quantum state, with  small oscillators and even  grains of sand being notable examples.\n So far, researchers have approached this challenge largely by scaling up systems that were relatively easy to work with. But in today&#39;s issue of Science, researchers report that they&#39;ve gotten close to putting a big object into its quantum ground state —a really big object: the 40 kilogram mirrors of the gravitational-wave observatory known as LIGO.\n  Mirrors are central to the function of LIGO. They&#39;re placed on opposite ends of long tunnels, allowing laser light to bounce back and forth along the tunnels many times. This makes the distance traveled by the light far larger and therefore more likely to experience a measurable influence from a passing gravitational wave.\n Any noise in the mirrors would cause problems for the function of the detector, so they&#39;ve been stabilized in various ways. To begin with, they&#39;re heavy, weighing in at 40 kilograms (88.2 lbs). They&#39;re also suspended from rigid cables, which turns the mirror into something similar to a pendulum. Finally, a damping system reads the position of the mirror and exerts force in order to keep it in its intended location.\n    That damping system was the key to the current experiment. The setup includes some gold electrodes that polarize the mirrors themselves. This allows control voltages to impart a force to the mirror. Measurements of the location and motion of the mirror are processed and compensatory forces calculated, and the appropriate signals are generated to apply that force via the electrical system.\n This system has a necessary delay, as the calculations involved in the control loop aren&#39;t performed instantaneously. And, since the system acts as a pendulum, any force applied to it can either act to slow down its current swinging or accelerate it to swing on a different frequency.\n  Fortunately, the delay involved here turned out to dampen the system, rather than changing its frequency. (This is technically true for only a single mode, or frequency range, of the pendulum&#39;s swing.) Over time, as the system was constantly tweaked, the effect was to bleed energy off the system, effectively cooling it. By the end of a period of operation, the researchers estimate that its effective temperature was only 77 nano-Kelvin, or very close to absolute zero.\n The researchers also put that in terms of phonons, a quantum unit of vibration. At the end of the process, there were likely 11 phonons in the 40 kilogram mirror. That&#39;s not the quantum ground state, which would involve emptying the system of phonons. But it&#39;s quite close and could potentially already be useful for studying quantum phenomena on large objects; if not, it wouldn&#39;t take much improvement to get it there.\n The most exciting prospect the authors see is that the motion of the pendulum is also dependent upon gravitational effects, which we&#39;ve not been able to reconcile with quantum mechanics. The new work, they suggest, &#34;hints at the tantalizing prospect of studying gravitational decoherence on massive quantum systems.&#34; And, compared to a grain of sand, 40 kg certainly qualifies as massive.", "posttime": "2021-06-18 03:40:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冷却,object,量子", "title": "研究人员将40公斤的物体冷却至靠近其量子的地面状态 ", "title_en": "Researchers cool a 40 kg object to near its quantum ground state", "transed": 1, "url": "https://arstechnica.com/science/2021/06/researchers-cool-a-40-kg-object-to-near-its-quantum-ground-state/", "via": "", "real_tags": ["冷却", "object", "量子"]}]