[{"category": "", "categoryclass": "", "imagename": "d20bca6585736ef8a9ea6d66723e6556.jpg", "infoid": 1034721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在意大利一座山下隐蔽的实验室里，物理学家重现了宇宙大爆炸后两到三分钟内发生的核反应。\n他们对反应速率的测量发表在今天的《自然》(Nature)杂志上，确定了一系列步骤中最不确定的因素，即大爆炸核合成，这一步骤锻造了宇宙中的第一个原子核。\n英国达勒姆大学(Durham University)的天体物理学家瑞安·库克(Ryan Cooke)没有参与这项研究，他表示，研究人员对这一结果感到“欣喜若狂”。他说：“会有很多人对粒子物理、核物理、宇宙学和天文学感兴趣。”\n这个反应涉及氘，一种氢的形式，由一个质子和一个中子组成，在宇宙的前三分钟内聚变。大多数的氘很快就会聚变成更重、更稳定的元素，比如氦和锂。但也有一些活到了今天。伊利诺伊大学厄巴纳-香槟分校(University of Illinois，Urbana-Champaign)的天体物理学家布莱恩·菲尔兹(Brian Fields)说，“你体内有几克的氘，它们来自宇宙大爆炸。”\n剩余的氘的精确数量揭示了最初几分钟的关键细节，包括质子和中子的密度，以及它们被宇宙膨胀分开的速度。在意大利国家核物理研究所工作的核天体物理学家卡洛·古斯塔维诺(Carlo Gustavino)说，氘是“那个时代的特殊超级见证者”。\n但物理学家只有在知道氘与质子聚变形成同位素氦-3的速率后才能推断出这些信息。地下核天体物理实验室(露娜)合作的新测量就是这个速度。\n氘的产生是大爆炸核合成的第一步，大爆炸核合成是一系列核反应，发生在宇宙是一个由质子和中子组成的超热但迅速冷却的汤汤时。\n从20世纪40年代开始，核物理学家开发了一系列相互关联的方程，描述了氢、氦和锂的各种同位素如何聚集成原子核，并融合和吸收质子和中子。(更重的元素在恒星内部形成的时间要晚得多。)。自那以后，研究人员通过在实验室中复制原始核反应来测试方程式的大部分方面。\n在这样做的过程中，他们取得了根本性的发现。这些计算提供了上世纪70年代暗物质存在的第一批证据。大爆炸核合成还使物理学家能够预测不同类型中微子的数量，这有助于推动宇宙膨胀。\n但近十年来，关于氘吸收质子并转变为氦-3的可能性的不确定性，使宇宙最初几分钟的景象变得模糊起来。最重要的是，这种不确定性使物理学家无法将这张照片与38万年后的宇宙相提并论，当时宇宙冷却到足以让电子开始绕原子核运行。这一过程释放了被称为宇宙微波背景的辐射，提供了当时宇宙的快照。\n宇宙学家希望根据他们的宇宙演化模型，检查宇宙密度是否如预期的那样从一个时期变化到另一个时期。库克说，如果这两张照片不一致，“这将是一件非常非常重要的事情。”解决顽固宇宙学问题的办法--比如暗物质的性质--可以在这个空隙中找到，就像奇异新粒子的最初迹象一样。库克说：“在宇宙大爆炸后的一两分钟和宇宙大爆炸后的几十万年之间，可能会发生很多事情。”\n但是，让研究人员进行这类比较的最重要的氘反应速率是很难测量的。菲尔兹说：“你是在实验室里以一种受控的方式模拟宇宙大爆炸。”\n物理学家上一次尝试测量是在1997年。从那时起，对宇宙微波背景的观测变得越来越精确，这给研究大爆炸核合成的物理学家带来了压力，要求他们与这一精度相匹配--从而可以对这两个时代进行比较。\n2014年，库克和他的合著者通过观测遥远的气体云，精确测量了宇宙中氘的丰度。但为了将这种丰度转化为对原始物质密度的精确预测，他们需要一个更好的氘反应速率测量方法。\n让情况进一步混乱的是，2016年发布的对这一比率的纯理论估计与1997年的实验室测量结果不一致。\n“这是一个非常混乱的场景，”古斯塔维诺(Gustavino)说，他是露娜合作项目的成员。在这一点上，我对Collaboration…变得咄咄逼人。因为露娜可以准确地衡量这种反应。“\n测量氘与质子聚变的难易程度的部分挑战在于，在实验室条件下，这种反应并不经常发生。露娜的实验每秒都会向一个氘目标发射100万亿质子。一天只有几个会融合。\n增加难度的是，不断落在地球表面的宇宙射线可以模仿氘反应产生的信号。弗朗西丝卡·卡凡纳(Francesca Cavanna)和桑德拉·扎瓦塔雷利(Sandra Zavatarelli)共同领导了露娜的数据收集和分析工作，她说：“因此，我们在一个地下实验室里，多亏了岩石的覆盖，我们可以从宇宙的沉默中受益。”\n在三年多的时间里，科学家们轮流在意大利格兰萨索山脉深处的一个实验室里轮班工作一周。卡凡纳说：“这很令人兴奋，因为你真的感觉自己置身于科学之中。”随着他们逐渐收集数据，来自更广泛的物理界的压力越来越大。团队成员玛丽亚卢萨·阿里奥塔(Marialuisa Aliotta)说，“人们有很大的期待，有很多期待。”\n事实证明，该团队最新公布的测量结果可能会让宇宙学家失望，因为他们正在寻找宇宙如何运作的模型中的裂痕。\n测得的速率介于2016年的理论预测和1997年的测量之间。测得的速率表明，在原始核合成时代发现的温度范围内，氘与质子融合形成氦-3的速度有多快。更重要的是，当物理学家将这个速率输入到大爆炸核合成方程中时，他们预测了原始物质密度和宇宙膨胀率，这与38万年后对宇宙微波背景的观测结果非常一致。\n阿利奥塔说：“它本质上告诉我们，到目前为止，宇宙学的标准模型是相当正确的。”\n这本身就挤压了下一代宇宙模型必须填补的空白。专家表示，一些暗物质理论甚至可能会被结果排除在外。\n这比支持奇异的新宇宙成分或效应的证据更令人兴奋。但阿利奥塔说，在这个精密天文学的时代，科学家们“从小步开始”。菲尔兹对此表示赞同：“我们一直在努力在预测方面、测量方面和观察方面做得更好。”\n即将到来的是下一代宇宙微波背景测量。与此同时，随着人们对氘的行为有了更好的理解，其他原始核反应和元素丰度的不确定性也变得更加紧迫。\n根据菲尔兹的说法，一个由来已久的“大爆炸核合成药膏中的苍蝇”是，根据氘和宇宙微波背景计算出的物质密度预测，宇宙中的锂应该比我们实际观察到的多三倍。\n“还有很多未知数，”阿利奥塔说。“未来会带来什么，这将是非常有趣的。”", "note_en": "In a secluded laboratory buried under a mountain in Italy, physicists have re-created a nuclear reaction that happened between two and three minutes after the Big Bang.\n Their measurement of the reaction rate,  published today in  Nature, nails down the most uncertain factor in a sequence of steps known as Big Bang nucleosynthesis that forged the universe’s first atomic nuclei.\n Researchers are “over the moon” about the result, according to  Ryan Cooke, an astrophysicist at Durham University in the United Kingdom who wasn’t involved in the work. “There’ll be a lot of people who are interested from particle physics, nuclear physics, cosmology and astronomy,” he said.\n The reaction involves deuterium, a form of hydrogen consisting of one proton and one neutron that fused within the cosmos’s first three minutes. Most of the deuterium quickly fused into heavier, stabler elements like helium and lithium. But some survived to the present day. “You have a few grams of deuterium in your body, which comes all the way from the Big Bang,” said  Brian Fields, an astrophysicist at the University of Illinois, Urbana-Champaign.\n  The precise amount of deuterium that remains reveals key details about those first minutes, including the density of protons and neutrons and how quickly they became separated by cosmic expansion. Deuterium is “a special super-witness of that epoch,” said Carlo Gustavino, a nuclear astrophysicist at Italy’s National Institute for Nuclear Physics.\n But physicists can only deduce those pieces of information if they know the rate at which deuterium fuses with a proton to form the isotope helium-3. It’s this rate that the new measurement by the Laboratory for Underground Nuclear Astrophysics ( LUNA) collaboration has pinned down.\n  Deuterium’s creation was the first step in Big Bang nucleosynthesis,  a sequence of nuclear reactions that occurred when the cosmos was a super hot but rapidly cooling soup of protons and neutrons.\n Starting  in the 1940s, nuclear physicists developed a series of interlocking equations describing how various isotopes of hydrogen, helium and lithium assembled as nuclei merged and absorbed protons and neutrons. (Heavier elements were forged much later inside stars.) Researchers have since tested most aspects of the equations by replicating the primordial nuclear reactions in laboratories.\n In doing so, they made radical discoveries. The calculations offered some of the first evidence of dark matter in the 1970s. Big Bang nucleosynthesis also enabled physicists  to predict the number of different types of neutrinos, which helped drive cosmic expansion.\n But for  almost a decade now, uncertainty about deuterium’s likelihood of absorbing a proton and turning into helium-3 has fogged up the picture of the universe’s first minutes. Most importantly, the uncertainty has prevented physicists from comparing that picture to what the cosmos looked like 380,000 years later, when the universe cooled enough for electrons to begin orbiting atomic nuclei. This process released radiation called the cosmic microwave background that provides a snapshot of the universe at the time.\n  Cosmologists want to check whether the density of the cosmos changed from one period to the other as expected based on their models of cosmic evolution. If the two pictures disagree, “that would be a really, really important thing to understand,” Cooke said. Solutions to stubbornly persistent cosmological problems — like the nature of dark matter — could be found in this gap, as could the first signs of exotic new particles. “A lot can happen between a minute or two after the Big Bang and several hundred thousand years after the Big Bang,” Cooke said.\n But the all-important deuterium reaction rate that would allow researchers to make these kinds of comparisons is very difficult to measure. “You’re simulating the Big Bang in the lab in a controlled way,” said Fields.\n Physicists last  attempted a measurement in 1997. Since then, observations of the cosmic microwave background have become increasingly precise, putting pressure on physicists who study Big Bang nucleosynthesis to match that precision — and so allow a comparison of the two epochs.\n In 2014, Cooke and co-authors  precisely measured the abundance of deuterium in the universe through observations of faraway gas clouds. But to translate this abundance into a precise prediction of the primordial matter density, they needed a much better measure of the deuterium reaction rate.\n Confounding the situation further, a purely  theoretical estimate for the rate, published in 2016, disagreed with the 1997 laboratory measurement.\n “It was a very confused scenario,” said Gustavino, who is a member of the LUNA collaboration. “At this point I became pushy with the collaboration … because LUNA could measure this reaction exactly.”\n  Part of the challenge in measuring how readily deuterium fuses with a proton is that, under laboratory conditions, the reaction doesn’t happen very often. Every second, the LUNA experiment fires 100 trillion protons at a target of deuterium. Only a few a day will fuse.\n Adding to the difficulty, cosmic rays that constantly rain down on Earth’s surface can mimic the signal produced by deuterium reactions. “For this reason, we’re in an underground laboratory where, thanks to the rock cover, we can benefit from cosmic silence,” said  Francesca Cavanna, who led LUNA’s data collection and analysis along with  Sandra Zavatarelli.\n Over three years, the scientists took turns spending weeklong shifts in a lab deep inside Italy’s Gran Sasso mountain. “It’s exciting because you really feel you are inside the science,” Cavanna said. As they gradually collected data, pressure mounted from the wider physics community. “There was a lot of anticipation; there was a lot of expectation,” said  Marialuisa Aliotta, a team member.\n As it turns out, the team’s newly published measurement may come as a disappointment to cosmologists looking for cracks in their model of how the universe works.\n  The measured rate — which says how quickly deuterium tends to fuse with a proton to form helium-3 across the range of temperatures found in the epoch of primordial nucleosynthesis — landed between the 2016 theoretical prediction and the 1997 measurement. More importantly, when physicists feed this rate into the equations of Big Bang nucleosynthesis, they predict a primordial matter density and a cosmic expansion rate that closely square with observations of the cosmic microwave background 380,000 years later.\n “It essentially tells us that the standard model of cosmology is, so far, quite right,” said Aliotta.\n That in itself squeezes the gap that next-generation models of the cosmos must fit into. Experts say some theories of dark matter could even be ruled out by the results.\n That’s less exciting than evidence in favor of exotic new cosmic ingredients or effects. But in this era of precision astronomy, Aliotta said, scientists proceed “by making small steps.” Fields agreed: “We are constantly trying to do better on the prediction side, the measurement side and the observation side.”\n  On the horizon is the  next generation of cosmic microwave background measurements. Meanwhile, with deuterium’s behavior now better understood, uncertainties in other primordial nuclear reactions and elemental abundances become more pressing.\n A longstanding “fly in the Big Bang nucleosynthesis ointment,” according to Fields, is that the matter density calculated from deuterium and the cosmic microwave background predicts that there should be three times more lithium in the universe than we actually observe.\n “There are still lots of unknowns,” said Aliotta. “And what the future will bring is going to be very interesting.”", "posttime": "2020-11-12 13:53:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "锁定,pin,宇宙", "title": "物理学家在宇宙大爆炸后的瞬间锁定了核反应", "title_en": "Physicists Pin Down Nuclear Reaction from Moments After the Big Bang", "transed": 1, "url": "https://www.quantamagazine.org/physicists-pin-down-nuclear-reaction-from-moments-after-the-big-bang-20201111/", "via": "", "real_tags": ["锁定", "pin", "宇宙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "什么是英特尔利奇墨水芯片。爱普生贴合\r小电路板的墨盒最多。这些\r记录下估计在\r弹药筒。我读到爱普生的官方台词是\r消费者从中受益，而不是一个反加注装置。不管你\r信不信由你，他们对任何想要\r重新装满墨盒或使用散装墨水。它还能阻止人们\r使用装满溶剂的旧墨盒清洗头部。\r另一个问题是早期型号的打印机没有检查\r已在通电时更换了墨盒。这是件好事，如果\r你想欺骗打印机复制一份“完整的”\r切碎和清空一个，然而反过来也是正确的，你\r可以很容易地将其复制并“清空”到您的满页中\r一。它们只是一个存储32字节的小型存储设备\r数据，它们不测量实际墨水量，也不测量\r打印机。据估计，打印机在启动时读取芯片\r(有时很糟糕)应该使用多少墨水和书写\r这又回到了关门的时候。它们还保存着其他数据。所以爱普生\r不厌其烦地将芯片安装到墨盒上，并构建所有\r将额外的插座、布线、电子设备和软件\r打印机，这样您就可以使用计算机查看预测的液位\r如果它认为你用了足够的墨水，它会停止你的打印。\r另一方面，高端佳能让墨水箱变得清晰\r你可以看到，并有光学传感器来探测空白。这\r这样做更有意义--除非你在做一个\r那就是防充气装置。佳能差点抢走了我的生意\r时间，但我找不到一个人在里面涂过颜料--也没人在里面涂过颜料。\r太冒险了。为了解决芯片问题，通常会有人\r生产始终读满的只读芯片(用于\rCis)和芯片重整器，为那些想要重新灌装的人提供服务。这些是\r在我写这篇文章的时候，2100便士还不能买到。\r告诉。在点我的2100便士之前，我做了功课，看起来\r芯片重置器很有可能在某一时刻变得可用\r以及只读芯片。我也很自大，以为我\r我可以自己破解它，我已经破解了。它并没有像预期的那样进行。\r尽管如此。我想做什么？\r我想要最简单的方法\r要欺骗打印机，使其相信打印机已装满墨盒\r这样我就可以建立我的独联体了。我还指望什么呢？\r合乎逻辑的\rIntellidge的接口是I2C(i为c的平方)或TWI(双线\r接口)。那么芯片可能只是一些标准的i2c EEPROM。\r英特尔里奇有太多的垫子，但我对此抱有希望。\r在那之后，可能是SPI或Microwire-这也是可能的\r使用货架上的零件。如果这些芯片是微控制器，那么\r纯异步串口将是我的选择。我有一个\r看。为此，我使用了AVR mega323微型机，但我拒绝了\r提供逻辑分析器是自制类型的家伙。323\r内置2K内存，足以存储一些极简主义数据\r伐木。它的制造成本约为50澳元(约合30美元)。我打了一封电报给\r带出信号的墨盒，并用一个\r电压表。没什么!\r那里什么都没有。我\r预计会有一些电力，但不是，芯片只有短暂的电力供应\r当访问时。我用LED粗略地了解了一下\r并将微孔电阻连接起来，以提供一定程度的\r如果我搞砸了，可以保护打印机。微观世界里的密码\r编写的是汇编程序，捕获的数据通过RS232发送到我的\r我在PC上编写了一个Delphi程序来显示和处理\r数据。", "note_en": "What is a Intellidge ink chip.   Epson fit\r\t\t\t\tsmall circuit boards to most of their ink cartridges. These\r\t\t\t\trecord the amount of ink that is estimated to be in the\r\t\t\t\tcartridge. I read that the official epson line is that it is for\r\t\t\t\tthe customers benefit and not an anti-refill device. Whether you\r\t\t\t\tbelieve this or not they are a bloody nuisance to anyone wanting\r\t\t\t\tto refill the cartridges or use bulk ink. It also stops people\r\t\t\t\tusing old cartridges full of solvent for cleaning the heads.\r\t\t\t\tAnother problem was early printer models didn&#39;t check if the\r\t\t\t\tcartridge had been changed while power was on. This was good if\r\t\t\t\tyou wanted to trick the printer into copying a “full”\r\t\t\t\tchip to and empty one, however the reverse was also true and you\r\t\t\t\tcould easily copy and “empty” one into your full\r\t\t\t\tone. \rThey are just a small memory device holds 32 bytes of\r\t\t\t\tdata, they do not measure real ink level and nor does the\r\t\t\t\tprinter. The printer reads the chips on startup, estimates\r\t\t\t\t(sometimes badly) how much ink should have been used and writes\r\t\t\t\tthis back at shutdown. They hold other data as well. \rSo epson\r\t\t\t\tgo to the trouble of fitting chips to cartridges and building all\r\t\t\t\tthe extra sockets, wiring, electronics and software into the\r\t\t\t\tprinter so you can use the computer to see the predicted level\r\t\t\t\tand it can stop you printing if it think you&#39;ve used enough ink.\r\t\t\t\tHigh-end Canon&#39;s on the other hand make the inks tank clear so\r\t\t\t\tyou can see and have optical sensor to detect emptiness. This\r\t\t\t\tmake a lot more sense – unless you are making an\r\t\t\t\tanti-refill device that is. Canon almost got my business this\r\t\t\t\ttime but nobody I could find has run pigment in them – too\r\t\t\t\trisky. \rTo get around the chip problems someone usually end up\r\t\t\t\tproducing read-only chip which always read full (for use with\r\t\t\t\tCIS) and chip reseters for those who want to refill. These are\r\t\t\t\tnot available for 2100p at the time of writing as far as I can\r\t\t\t\ttell. \rBefore ordering my 2100p I did my homework and it seemed\r\t\t\t\tfairly likely a chip reseter would become available at some point\r\t\t\t\tand read-only chips as well. I was also cocky enough to think I\r\t\t\t\tcould crack it myself and I have. It didn&#39;t go quite as expected\r\t\t\t\tthough.   What do I want to do? \rI want the easiest way\r\t\t\t\tto fool the printer into believing it has full cartridges present\r\t\t\t\tso I can build my CIS.   What did I expect? \rA logical\r\t\t\t\tinterface for Intellidge is i2c (i squared c) or TWI (two wire\r\t\t\t\tinterface). Then the chip could just be some standard i2c eeprom.\r\t\t\t\tThe Intellidge have too many pads for this but I was hopeful.\r\t\t\t\tAfter that would could SPI or microwire – again this could\r\t\t\t\tuse off the shelf parts. If the chips were micro-controllers then\r\t\t\t\tplain asynchronous serial would be my choice.   I had a\r\t\t\t\tlook. \rTo do this I use a AVR mega323 micro, I declined\r\t\t\t\toffers of logic analyzers being a homebrew type of guy. The 323\r\t\t\t\thas 2K of internal ram which is enough for some minimalist data\r\t\t\t\tlogging. It was about $50AUS in parts ($30US) to make. I wired a\r\t\t\t\tcartridge to bring the signals out and took a quick look with a\r\t\t\t\tvoltmeter.   Nothing! \rThere was nothing there. I\r\t\t\t\texpected some power but no, the chips are only powered briefly\r\t\t\t\twhen the are accessed. I used leds to get a rough idea what was\r\t\t\t\twhat and hooked up the micro via resistors to give some degree of\r\t\t\t\tprotection to the printer if I screwed up. The code in the micro\r\t\t\t\twas written is assembler and captured data sent via rs232 to my\r\t\t\t\tPC where I wrote a delphi program to display and process the\r\t\t\t\tdata.", "posttime": "2020-11-12 13:14:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,芯片,墨水,ink", "title": "埃迪的墨水芯片黑客(2002)", "title_en": "Eddie's Ink Chip Hack (2002)", "transed": 1, "url": "http://www.eddiem.com/photo/CIS/inkchip/chip.html", "via": "", "real_tags": ["黑客", "芯片", "墨水", "ink"]}, {"category": "", "categoryclass": "", "imagename": "bf325a8079b09593a09594df3bdb4393.jpeg", "infoid": 1034718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Google Photos提供无限量免费存储“高质量”压缩图片的五年后，谷歌周三宣布，其政策正在改变。从明年6月开始，你上传的任何新照片都将计入提供给每个谷歌账户的15G免费存储空间。(你的旧照片不会。)。在此之后，你必须为其云存储服务Google One支付订阅费。\n从某种意义上说，对于一款自最初提供免费存储服务以来广受欢迎的产品来说，这是一个完全合理的政策变化。毕竟，存储空间并不是真正免费或无限的，15G仍然是很大的空间。一些人甚至辩称，直接向谷歌支付谷歌照片等服务代表着一种更健康的长期商业关系，而不是通过你的数据或关注度付费。\n但从另一个角度来看，这是一个令人恼火的诱饵和开关，是一家大型科技公司反竞争行为的实物教训。无限制的免费存储可以说是Google Photos的最大卖点，几乎没有竞争对手能与之匹敌。该公司可能愿意在其服务上赔钱，以换取照片在培训其人工智能系统方面的价值，以及让用户留在其更广泛的软件生态系统中的价值。\n现在，谷歌已经吸引了超过10亿用户使用这项服务，使其成为他们数字生活中不可或缺的一部分(更不用说转换起来会带来巨大的麻烦)，最初的卖点已经消失了。\n不过，正如Platform的凯西·牛顿在推特上指出的那样，真正的输家并不是Google Photos的用户。从很多方面来说，它仍然是一款很棒的产品。输家都是Google Photos在登顶过程中击败的竞争对手，包括Everpix、Loom和Picturelife等初创公司。(牛顿在2015年为The Verge报道了照片存储初创公司的挣扎。)。\n这个曾经竞争激烈、充满创新的领域现在主要由谷歌和其他几家巨头(如苹果)控制。这指向了另一组输家，尽管是一个模糊的输家：每个人都可能从从未开发过的新想法和新功能中受益，因为初创公司没有机会与谷歌竞争。\n在这里很容易找到一个讽刺的“不要作恶”的提法。但谷歌在这里做了什么，为什么它如此重要，从道德角度来说，人们并不能很好地理解这一点。在每一步，它都只是在做成功公司做的事情。它免费提供了一款很棒的产品，因为它负担得起，它击败了竞争对手，很大程度上是因为它是市场上的最佳选择，现在它正在提价，因为免费存储服务已经达到了它的目的。\n相反，这一举动最好从竞争和反垄断的角度来理解。正是谷歌巨大的规模和覆盖范围--其产品在不同市场的互补和交叉补贴--使其相对于规模较小的竞争对手具有无与伦比的优势。回想起来，免费存储服务看起来很像掠夺性定价，不管这是不是谷歌的意图。但更大的图景是，谷歌和其他占主导地位的平台一样，涉足了如此多不同的、相辅相成的业务领域，以至于它总是会受到激励，以反竞争的方式利用这些业务。从某种角度--利润和股东价值最大化的角度--不这样做将是愚蠢的。\n美国众议院反垄断小组委员会上个月发布了一份篇幅庞大的报告，建议采取一系列新措施来遏制大型科技公司，试图解决数字平台的这种杂乱无章、多种多样的性质。谷歌照片事件只是为什么需要采取此类措施的最新例证。\n有一种普遍的误解认为，拆分大型科技公司的呼声是出于对成功的敌意或嫉妒。毫无疑问，这种敌意和嫉妒是存在的，但这并不是严肃的反垄断倡导者认为我们需要采取行动的原因。正如我在8月份解释的那样，摆在桌面上的“拆分大型科技公司”的严肃提议并不是要报复性地将这些公司粉碎成碎片。它们是为了限制最大的平台在不同业务线上利用其权力的自由发挥作用。\n我们需要为大型科技公司制定新的反垄断法，不是因为大型科技公司是邪恶的，而是因为它们无法自救。他们是在他们被给予的比赛场地上比赛。如果这一切都是在他们这边走下坡路，那么答案不是责怪他们，羞辱他们，而是修复这个领域。", "note_en": "After five years of Google Photos offering unlimited, free storage of “high-quality” compressed images, Google  announced on Wednesday that its policy is changing. Starting next June, any new photos you upload will count toward the 15 gigabytes of free storage offered to every Google account. (Your old photos won’t.) After that, you’ll have to pay a subscription fee for Google One, its cloud storage service.\n In one sense, that’s a totally reas onable policy change for a product that has become wildly popular since the initial free-storage offer. Storage isn’t really free or unlimited, after all, and 15 gigabytes is still a lot of space.  Some even argue that paying Google directly for services such as Google Photos represents a healthier business relationship long-term than paying with your data or attention.\n  But viewed from another lens, it’s a galling bait-and-switch and an object lesson in anticompetitive behavior by a Big Tech firm. The unlimited free storage offer was arguably Google Photos’ top selling point, one that few, if any, competing providers could match. The company was likely willing to lose money on its service in exchange for the photos’ value in training its A.I. systems and for the value of keeping users in its broader software ecosystem.\n Now that Google has lured  more than 1 billion users to the service, making it an integral part of their digital lives (not to mention a huge hassle to switch), that original selling point is gone.\n As  Platformer’s Casey Newton  pointed out on Twitter, though, the real losers here are not Google Photos users. It’s still a great product in many ways. The losers are all the rival photo apps that Google Photos crushed on its way to the top, including startups such as Everpix, Loom, and Picturelife. (Newton reported on  the struggles of photo storage startups for  The Verge in 2015.)\n What was once a hotly competitive and innovative space is now largely controlled by Google and a few other giants, such as Apple. And this points to another set of losers, albeit a nebulous one: everyone who might have benefited from the new ideas and fresh features that were never developed because startups didn’t stand a chance against Google.\n It would be easy to reach for a sardonic “ don’t be evil” reference here. But what Google is doing here, and why it matters, isn’t best understood in moral terms. At every step, it was just doing what successful companies do. It offered a great product for free because it could afford to, it crushed competitors largely by virtue of being the best option on the market, and now it’s raising prices because the free storage offer has served its purpose.\n Instead, this move is best understood from the standpoint of competition and antitrust. It’s Google’s vast size and scope — the way its products in different markets complement and cross-subsidize each other — that gave it unmatchable advantages over smaller rivals. In retrospect, the free storage offer looks a lot like predatory pricing, whether that was Google’s intent or not. But the bigger picture is that Google, like other dominant platforms, has its hand in so many different, mutually reinforcing lines of business that it will  always be incentivized to leverage them in anticompetitive ways. From a certain standpoint — the standpoint of maximizing profit and shareholder value — it would be foolish not to.\n It’s that sprawling, multifarious nature of digital platforms that the U.S. House of Representatives antitrust subcommittee sought to address with  its hefty report last month recommending a suite of new measures to rein in Big Tech. The Google Photos episode is just the latest example of why such measures are needed.\n There’s a common misconception that calls to break up Big Tech are motivated by enmity or jealousy of success. No doubt such enmity and jealousy exist, but those aren’t why serious antitrust advocates believe we need to act. And the serious proposals on the table to “break up Big Tech” aren’t about vengefully smashing the companies to bits as I  explained in August. They’re about restricting the largest platforms’ free rein to leverage their power across different business lines.\n We need new antitrust laws for Big Tech not because big tech firms are evil but because they can’t help themselves. They’re playing on the playing field they’ve been given. And if it’s all downhill from their side, then the answer is not to blame and shame them but to fix the field.", "posttime": "2020-11-12 12:37:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "onezero", "title": "OneZero", "title_en": "OneZero ", "transed": 1, "url": "https://onezero.medium.com/google-photos-just-made-the-case-for-breaking-up-big-tech-420dc6b5d375", "via": "", "real_tags": ["onezero"]}, {"category": "", "categoryclass": "", "imagename": "1177a4cf7a92ae004d68a44247d4e45e.jpg", "infoid": 1034717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "配备新的Apple Silicon M1芯片的Mac电脑都有新的端口配置和比以往更强的处理能力，但显示器配置发生了变化。以下是你可以连接到新的Mac电脑上的显示器，以及它们与被取代的英特尔Mac电脑的比较。\n苹果在运行M1处理器的新Mac电脑上安装了迅雷3/USB 4端口。新发布的Mac包括MacBook Air、13英寸MacBook Pro和Mac mini。\n配备M1处理器的Mac mini可以使用Thunderbolt3规格中的DisplayPort 1.4等级运行单个外部显示器。这意味着您可以随时通过USB-C端口连接一台6K显示器(如Pro Display XDR)或一台4K显示器。\nM1 Mac mini可以通过支持高达4K连接的HDMI 2.0端口运行第二个显示器。\n英特尔Mac mini通过迅雷3支持最多两个4K显示屏，通过HDMI支持一个4K显示屏，或者通过迅雷3支持一个5K显示屏，通过HDMI支持一个4K显示屏。英特尔Mac mini无法运行6K显示器，因为它缺乏以该分辨率运行外部显示器所需的控制器。\n配备M1处理器的MacBook Air一次只能连接一个外部显示器，与内部显示器并行。它支持高达6K的60赫兹，所以像Pro Display XDR这样的显示器将工作得很好。\n除内置显示屏外，2020款搭载英特尔的MacBook Air最多可以连接两个4K显示屏、一个5K显示屏或一个使用迅雷3端口的6K显示屏。\n配备M1处理器的13英寸MacBook Pro一次只能连接一个外置显示器和笔记本电脑的屏幕。它和MacBook Air一样，在60赫兹的频率下最高支持6K。\n英特尔13英寸MacBook Pro支持两个4K显示屏、一个5K显示屏或一个使用四个迅雷3端口的6K显示屏，与内置显示屏配合使用。\n苹果的M1是外置显示器数量有限的原因，因为MacOS可以在英特尔机型上运行多个外置显示器。因此，基本上每台搭载Apple Silicon的Mac都只能通过Thunderbolt3端口运行一台外部显示器，而Mac mini是个例外，因为它有一个额外的HDMI端口。\nAppleInsider与会员有合作关系，通过会员链接购买的产品可能会赚取佣金。这些合作关系不会影响我们的编辑内容。", "note_en": "The Macs with the new Apple Silicon M1 chip each have new port configurations and more processing power than ever, but monitor configurations have changed. Here&#39;s what monitors you can connect to the new Macs, and how they compare to the Intel Macs that they replaced.\n  Apple has included  Thunderbolt 3/ USB 4 ports in their new Macs running  M1 processors. The new Macs released include the  MacBook Air,  13-inch MacBook Pro, and the  Mac mini.\n   The Mac mini with an M1 processor can run a single external display using the DisplayPort 1.4 rating in the Thunderbolt 3 spec. This means you can have a single 6K monitor like the Pro Display XDR or a single 4K monitor attached at any time through the USB-C ports.\n The M1 Mac mini can run a second monitor via the HDMI 2.0 port which supports up to 4K connections.\n The Intel Mac mini has support for up to two 4K displays via Thunderbolt 3 and one 4K display via HDMI, or one 5K display via Thunderbolt 3 and one 4K display via HDMI. The Intel Mac mini was unable to run 6K displays, as it lacked the necessary controller for running external displays at that resolution.\n  The MacBook Air with an M1 processor can connect only a single external display at a time, in parallel with the internal display. It supports up to 6K at 60Hz so monitors like the Pro Display XDR will work fine.\n The 2020 MacBook Air with Intel could connect up to two 4K displays, one 5K display, or one 6K display using the Thunderbolt 3 ports, beyond the internal display.\n  The 13-inch MacBook Pro with an M1 processor can connect only a single external display at a time in conjunction with the laptop&#39;s screen. It supports up to 6K at 60Hz just like the MacBook Air.\n The Intel 13-inch MacBook Pro allowed two 4K displays, one 5K display, or one 6K display using the four Thunderbolt 3 ports, in conjunction with the built-in display.\n Apple&#39;s M1 is the reason for the number of external display limitations, since macOS can run multiple external displays on Intel variants. So, essentially each Mac with Apple Silicon can only run one external monitor via a Thunderbolt 3 port, and the Mac mini is the exception due to having an additional HDMI port.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2020-11-12 12:31:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macbook,macbook-pro,显示器", "title": "M1 MacBook Pro和Air只能驱动1个外置显示器", "title_en": "M1 MacBook Pro and Air can only drive 1 external display", "transed": 1, "url": "https://appleinsider.com/articles/20/11/11/how-apple-silicon-on-a-m1-mac-changes-monitor-support-and-what-you-can-connect", "via": "", "real_tags": ["macbook", "显示器"]}, {"category": "", "categoryclass": "", "imagename": "79e2dde7ebaf4c5659a7e70bd4e424ca.jpg", "infoid": 1034716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的五年里，我所有的软件开发都是在虚拟机(VM)中完成的。我的每个项目都有一个专用的VM，省去了依赖冲突和TCP端口冲突的麻烦。\n三年前，我构建了自己的家庭实验室服务器来托管我所有的虚拟机，从而使事情更上一层楼。这是一项非常棒的投资，因为它加快了无数的开发任务，并提高了可靠性。\n在过去的几个月里，我开始达到我的虚拟机服务器的极限。我的项目变得更加需要资源，而且我在第一次构建时犯的错误又回来咬我了。我决定在2020年打造一台全新的家庭实验室虚拟机服务器。\n如果你对这个项目的“为什么”不感兴趣，你可以直接跳到构建。\n最初，我使用VirtualBox从我的Windows桌面运行虚拟机。这在一段时间内还不错，但重新启动成了一个巨大的麻烦。\n在从Windows更新强制重启、自愿重启以完成软件安装，以及偶尔出现操作系统崩溃之间，我不得不每月重启我的整个开发虚拟机套件三到五次。\n一台专用的虚拟机服务器让我不必重启。虚拟机主机运行的软件最少，因此很少出现崩溃和强制重启的情况。\n云服务器可以提供相同的功能，省去了我的麻烦(有趣！)。维护我自己的硬件，但它贵得令人望而却步。对于与我的家庭实验室服务器类似的虚拟机资源，AWS EC2实例每年的成本将超过6000美元：\n我可以根据需要打开和关闭云实例，从而大幅降低成本，但这会给我的工作流程带来摩擦。使用本地VM服务器，我可以随时保持10-20个VM可用和就绪，而无需担心微观管理我的成本。\n我2017年的版本对我很有帮助，但在使用它的三年中，我逐渐认识到了几个亟待改进的关键领域。\n我的Synology NAS有10.9TB的存储容量。有了这么多的网络存储空间，我想，“为什么要在服务器上投入比启动主机操作系统所需的最少空间更多的磁盘空间呢？”\n首先，在网络存储上运行虚拟机会对磁盘服务器产生严格的依赖关系。Synology每隔几个月发布一次操作系统升级，他们的补丁总是需要重新启动。由于我的虚拟机运行在Synology的存储上，在应用Synology的任何更新之前，我不得不关闭我的整个虚拟机群。这与我在Windows桌面上运行虚拟机时遇到的重启问题相同。\n其次，网络上的随机磁盘访问速度很慢。在我第一次构建的时候，我的大部分开发工作都是在后端的Python和Go应用程序上进行的，它们并没有执行大量的磁盘I/O。从那时起，我就扩展到了前端Web开发。现代的Web框架都使用Node.js，所以每个项目的依赖树中都有10k-200k的随机JavaScript文件。Js构建涉及大量的随机磁盘访问，这对网络存储来说是最糟糕的情况。\n对于我的第一台服务器，我评估了两种虚拟机管理选项：泡菜和VMWare ESXi。VMware要完美和成熟得多，但泡菜以其斗志和开源的本质迷住了我。\n随着时间的推移，泡菜的缺点变得越来越明显。我经常不得不多次点击虚拟机的“克隆”或“关机”按钮才能与其合作。还有一些令人恼火的用户界面错误，按钮在我点击之前消失或移动了位置。\n如果你读了上面的文章，你会想，“泡菜只是个软件而已。”为什么迈克尔必须建造一台全新的服务器，才能安装一个不同的虚拟机管理器？这是因为我没有预见到远程管理的重要性。\n我的虚拟机服务器只是一台放在办公室角落里的PC，没有连接显示器或键盘。当我可以通过SSH登录或使用Web界面时，99%的时间都可以。但在1%的时间里，当服务器启动失败或我想安装新的主机操作系统时，这是一个巨大的痛苦。我必须把服务器拖到我的办公桌上，断开我的桌面键盘和显示器，修复任何需要修复的东西，然后将我办公室里的一切恢复到原来的配置。\n在我的下一次构建中，我想要一个虚拟控制台，只要机器一开机，它就可以进行物理级访问。我想的是戴尔的iDRAC或惠普的iLO。\n我的第一台VM服务器的CPU是Ryzen 7 1700。它拥有8个内核和16个线程，是当时炙手可热的新CPU。但是，当我展示我在Reddit的HomeLab子社区/r/HomeLab上的构建时，他们嘲笑我是一个肮脏的休闲者，因为我使用了消费者部件。酷孩子们用的是企业用具。\n我决心再也不让/r/homelab取笑我了，于是我冒险进入了企业服务器硬件领域。我甚至想入非非，选择构建一个有两个物理CPU的系统。\n为了让我的钱物有所值，我把搜索范围限制在四到八年前发布的二手CPU。对于每个候选人，我在PassMark上查找基准分数，然后在eBay上查看该CPU型号在二手状态下最近的销售情况。\n性价比最高的似乎是英特尔至强E5 v3系列，尤其是2600机型。我选择了E5-2680 v3。它的平均基准是15618，在eBay上使用的价格约为130美元。\n作为背景，我之前构建的Ryzen 7的基准测试是14,611。因此，有了双E5-2680，我的处理能力将比我的旧服务器高出一倍以上。\n双CPU系统的缺点是限制了我对主板的选择。只有少数主板支持双英特尔2011-v3 CPU。它们的价格从300美元到850美元不等，这远远超过了我在主板上的预期花费。\n我选择了超微MBD-X10DAL-I-O，它的价格比同类主板低320美元，但仍然是我上一块主板价格的五倍。\n对于服务器内存，似乎有很多不那么知情的选择。对于消费类硬件，很多网站都会发布对不同内存条的评论和基准测试，但我没有看到任何类似的服务器内存条。\n我选择了关键的CT4K16G4RFD4213 64 GB(4x16 GB)，因为我信任这个品牌。我之所以选择64 GB，是因为我之前的版本是32 GB，而我的一些工作流正在接近这个限制，所以我想在接下来的几年里，将RAM翻一番就可以满足我的需求。\n我喜欢M.2固态硬盘，因为它们体积小，性能出众，而且整齐地藏在主板上，没有任何线缆。遗憾的是，MBD-X10DAL不支持M.2接口。\n取而代之的是，我坚持使用传统的SATA。我买了一台1TB的三星860EVO。我通常为每个虚拟机分配40 GB的空间，因此1 TB会给我足够的空间。如果我以后需要升级，我总是可以买更多的磁盘。\n选择电源单元(PSU)并不是那么有趣，所以我再次选择了主要受信任的品牌，海盗船CX550M 550W 80加青铜。\n我所有组件的功率加起来是400W，所以450W就足够了。但550瓦版本的价格只高出10美元，对于额外100瓦的呼吸空间来说，这似乎是一个公平的价格。\n对我来说，唯一的另一个重要特征是半模块化布线。在我的上一次构建中，我犯了一个错误，使用了非模块化布线，这意味着所有的PSU电缆都保持永久连接。我的服务器几乎没有任何内部组件，所以多余的电源线造成了混乱。使用半模块化布线，我可以通过从PSU上移除不用的电缆来保持东西整洁。\n双CPU版本使得冷却成为一个意想不到的挑战。MBD-X10DAL在两个CPU插座之间没有留下太多空间，所以我仔细寻找了足够薄的风扇，以便并行工作。一双更酷的Master Hyper 212正好符合要求。\n我的服务生不显眼地坐在办公室的角落里，所以我不想要一个面板清晰或灯光耀眼的箱子。\nFractal Design Meshify C Black得到了积极的评价，似乎是一个简单、安静的案例。\n对于无头服务器来说，显卡并不重要。它仍然是必要的，这样我就可以在初始安装和偶尔的调试过程中看到屏幕，所以我选择了MSI GeForce GT 710，作为一个便宜、简单的选择。\n我研究了远程管理解决方案，他们的昂贵让我大吃一惊。起初，我想我应该使用戴尔iDRAC，但远程控制台需要300美元的企业许可证，并且将我的构建限制在戴尔组件上。我研究了KVM over IP解决方案，但它们甚至更贵，从600美元到1000美元不等。\n为了实现远程管理，我采用了一种不同寻常的方法，用Raspberry PI构建我自己的KVM over IP设备。我叫它TinyPilot。\nTinyPilot捕获HDMI输出，并从浏览器转发键盘和鼠标输入。它提供的访问权限与物理连接真正的键盘、鼠标和显示器时的访问权限相同。该软件是完全开源的，如果你想自己构建一个，我可以提供一体机工具包。\n在泡菜烧了我的最后一个版本之后，我不愿意尝试另一个免费的解决方案。Proxmox已经存在12年了，所以我觉得他们是一个足够安全的赌注。在图形方面，它比泡菜有了很大的进步，但在流畅度上落后于ESXi。\n我最欣赏的Proxmox部分是它的脚本化。我经常执行的任务之一是从模板创建一个新的虚拟机，然后使用Ansible安装其他软件。使用ESXi时，如果不是每次都手动点击web用户界面中的按钮，我无法找到一种方法来做到这一点。有了Proxmox，他们的CLI就足够强大，我可以把它写成./create-vm Whatgodo-dev，我的脚本可以创建一个全新的完成了什么的开发VM。\n我最大的抱怨是Proxmox不直观。我甚至不知道如何安装它，直到我找到了Craft Computing的安装教程。但是一旦你熟悉了你的方法，它就很容易使用了。\n在我停用旧的VM服务器之前，我收集了常见工作流的简单基准来衡量性能提升。\n我的大多数旧虚拟机都运行在网络存储上，因为它的本地SSD只有几个虚拟机的空间。在下面的基准测试中，我比较了三种不同场景下的性能：\n2020服务器：所有虚拟机都在本地固态硬盘上运行，因此没有NAS与固态硬盘。\n我采用的第一个基准测试是配置一个新的虚拟机。我有一个标准的Ubuntu 18.04 VM模板，我几乎所有的VM都使用它。每次需要新的虚拟机时，我都会运行一个执行以下步骤的Shell脚本：\n我的新服务器为这个工作流程带来了巨大的加速。克隆一个虚拟机在我的旧服务器上只用了15分钟，而在新服务器上只用了不到4分钟。\n如果我跳过包升级步骤，加速效果就不那么令人印象深刻了。新服务器在NAS存储上的性能仍然令人叹为观止，从8分钟降至略低于2.5分钟。固态硬盘到固态硬盘，它的性能逊于我之前的服务器。克隆一个虚拟机可能是受磁盘限制的，而且我的旧M.2固态硬盘比我的新SATA固态硬盘更快。\n从我打开虚拟机的那一刻起，我需要多长时间才能看到登录提示？\n我的旧虚拟机在48秒内启动。我的旧系统上的几个SSD虚拟机做得稍好一些，在32秒内就显示了登录提示。我的新服务器在18秒内就启动了一台虚拟机。\n我每周一次的日志应用What Good Done已经完成了自动测试，可以端到端地运行它的功能。这是我最多样化的工作流程之一--它包括编译Go后端、编译Vue前端、构建一系列Docker容器，以及自动化Chrome来运行我的应用程序。这是耗尽我的旧虚拟机上资源的工作流之一，所以我预计这里会有很大的收益。\n令人惊讶的是，这两台服务器之间没有显著的性能差异。冷启动(下载所有Docker基础镜像)，新服务器比旧服务器慢2%。当基本Docker镜像在本地可用时，我的新服务器比我的旧服务器好，但仅高出6%。看起来瓶颈主要是磁盘和浏览器的交互，所以新的服务器没有太大的不同。\n我有一个经常使用的工作流程，那就是为酮类节食者提供的资源是不是Keto？我使用Gridome(Vue的静态站点生成器)生成站点。\n我预计这里会有显著的加速，所以当我的构建速度变慢时，我感到很惊讶。在我的旧服务器上，构建似乎主要是受CPU限制的，但是在我的新服务器上加倍CPU资源并没有起到任何作用。我的下一个猜测是它是受磁盘限制的，所以我尝试将文件移动到RAM磁盘，但构建速度保持不变。\n我的假设是，工作流是受CPU限制的，但是并行性很差。我的旧服务器的CPU核心较少，但每个核心都更快。如果构建被限制为五六个线程，它就不能利用我的新服务器的48个核心。\nZestful是我的基于机器学习的API，用于解析食谱成分。每隔几个月，我就会根据新的数据对其进行培训。这是我的CPU最密集的工作流，所以我很想看看新系统将如何处理它。\n最后，我的48个CPU内核大放异彩！新的服务器彻底颠覆了旧的服务器，只用了不到一半的时间就训练好了模型。不幸的是，这是一个我一年只运行几次的工作流程。\n尽管/r/homelab可能永远不会尊重我，但在我的下一次构建中，我计划回到消费类硬件。\n我认为服务器组件的最大优势是它们与服务器软件有更好的兼容性。早在2017年，我就无法安装ESXi，直到我禁用了CPU上的多线程，这大大降低了性能。但这是Linux内核中的一个限制，后来的更新修复了它。\n服务器硬件因其更高的可靠性而备受推崇。对于面向用户的服务，此特性很有意义，但在开发服务器上就没那么重要了。开发服务器上偶尔出现的崩溃或位翻转不应该毁了您的一天。\n这是我第一次建造双CPU计算机。这是一次有趣的经历，但我认为不值得这么麻烦。\n根据我的基准，CPU很少是我工作流程中的限制因素。最确凿的证据是Proxmox的CPU使用率随时间变化的图表。在过去的几个月里，我从未将CPU负载提升到11%以上，所以我被过度配置了。\n对双CPU的要求大大提高了主板的成本，限制了我的选择。只有为数不多的Mobos支持英特尔2011-v3双CPU，所以我在其他主板功能上没有太多选择。\n在我使用TinyPilot管理我的服务器之前，我并没有意识到我是多么厌恶改变。更改任何BIOS或网络设置都有可能损失我生命中接下来的几个小时，因为我需要在机器上四处走动，并重新连接外围设备来调试和修复问题。知道这一点后，我再也不想修改这些设置了。\n拥有虚拟控制台让我有了失败的自由，也让我更愿意尝试不同的操作系统。安装和学习一个新的操作系统总是需要付出巨大的努力，但知道我不必来回拖拽机器，这让我对它更加开放。如果我没有创建TinyPilot，我可能会坚持认为ESXi“足够好”，而不是冒险选择Proxmox。", "note_en": "For the past five years, I’ve done all of my software development in virtual machines (VMs). Each of my projects gets a dedicated VM, sparing me the headache of dependency conflicts and TCP port collisions.\n Three years ago, I took things to the next level by  building my own homelab server to host all of my VMs. It’s been a fantastic investment, as it sped up numerous dev tasks and improved reliability.\n In the past few months, I began hitting the limits of my VM server. My projects have become more resource-hungry, and mistakes I’d made in my first build were coming back to bite me. I decided to build a brand new homelab VM server for 2020.\n    If you’re not interested in the “why” of this project, you can jump  directly to the build.\n  Originally, I used VirtualBox to run VMs from my Windows desktop. That was fine for a while, but reboots became a huge hassle.\n Between forced reboots from Windows Update, voluntary restarts to complete software installs, and the occasional OS crash, I had to restart my entire suite of development VMs three to five times per month.\n A dedicated VM server spares me most reboots. The VM host runs a minimal set of software, so crashes and mandatory reboots are rare.\n   Cloud servers could serve the same function and save me the trouble (fun!) of maintaining my own hardware, but it’s prohibitively expensive. For VM resources similar to my homelab server, AWS EC2 instances  would cost over $6k per year:\n   I could substantially reduce costs by turning cloud instances on and off as needed, but that would introduce friction into my workflows. With a local VM server, I can keep 10-20 VMs available and ready at all times without worrying about micromanaging my costs.\n  My 2017 build served me well, but in three years of using it, I’ve come to recognize a few key areas begging for improvement.\n  My Synology NAS has 10.9 TB of storage capacity. With all that network storage space, I thought, “why put more disk space on the server than the bare minimum to boot the host OS?”\n    First, running VMs on network storage creates a strict dependency on the disk server. Synology publishes OS upgrades every couple of months, and their patches always require reboots. With my VMs running on top of Synology’s storage, I had to shut down my entire VM fleet before applying any update from Synology. It was the same reboot problem I had when I ran VMs on my Windows desktop.\n   Second, random disk access over the network is  slow. At the time of my first build, most of my development work was on backend Python and Go applications, and they didn’t perform significant disk I/O. Since then, I’ve expanded into frontend web development. Modern web frameworks all use Node.js, so every project has anywhere from 10k-200k random JavaScript files in its dependency tree. Node.js builds involve tons of random disk access, a worst-case scenario for network storage.\n  For my first server, I evaluated two options for VM management:  Kimchi and  VMWare ESXi. VMWare was far more polished and mature, but Kimchi charmed me with its scrappy spirit and open-source nature.\n      Over time, Kimchi’s shortcomings became more and more apparent. I often had to click a VM’s “clone” or “shutdown” button multiple times before it cooperated. And there were infuriating UI bugs where buttons disappeared or shifted position right before I clicked on them.\n    If you read the above and thought, “Kimchi is just software. Why did Michael have to build a whole new server just to install a different VM manager?” It’s because I failed to anticipate the importance of remote administration.\n My VM server is just a PC that sits in the corner of my office with no monitor or keyboard attached. That’s fine 99% of the time when I can SSH in or use the web interface. But for the 1% of the time when the server fails to boot or I want to install a new host OS, it’s a huge pain. I have to drag the server over to my desk, disconnect my desktop keyboard and monitor, fix whatever needs fixing, then restore everything in my office to its original configuration.\n For my next build, I wanted a virtual console with physical-level access to the machine as soon as it powered on. I was thinking something like  Dell’s iDRAC or  HP’s iLO.\n     My first VM server’s CPU was a  Ryzen 7 1700. At eight cores and 16 threads, it was  the hot new CPU at the time. But when I showed off my build on  /r/homelab, reddit’s homelab subcommunity, they mocked me as a filthy casual because I used  consumer parts. The cool kids used enterprise gear.\n  Resolved never to let /r/homelab make fun of me again, I ventured into the world of enterprise server hardware. I even got fancy and chose to build a system with two physical CPUs.\n To get the best performance for my dollar, I restricted my search to used CPUs, released four to eight years ago. For each candidate, I  looked up benchmark scores on PassMark and then checked eBay for recent sales of that CPU model in used condition.\n The most cost-efficient performance seemed to be in the  Intel Xeon E5 v3 family, especially the 2600 models. I settled on the  E5-2680 v3. It had an average benchmark of 15,618 and cost ~$130 used on eBay.\n  For context, my previous build’s Ryzen 7 had a benchmark of 14,611. So with dual-E5-2680s, I’d more than double the processing power from my old server.\n    The downside of a dual-CPU system was that it limited my options for motherboards. Only a handful of motherboards support dual Intel 2011-v3 CPUs. Their prices ranged from $300 to $850, which was far more than I expected to spend on a motherboard.\n I chose the  SuperMicro MBD-X10DAL-I-O, which at $320 was lower in price than similar motherboards, but it was still  five times what I paid for  my last one.\n    There seems to be a lot less informed choice for server memory. With consumer hardware, plenty of websites publish reviews and benchmarks of different RAM sticks, but I didn’t see anything like that for server RAM.\n I went with  Crucial CT4K16G4RFD4213 64 GB (4 x 16 GB) because I trusted the brand. I chose 64 GB because  my previous build had 32 GB, and some of my workflows were approaching that limit, so I figured doubling RAM would cover me for the next few years.\n    I love M.2 SSDs, as they’re small, perform outstandingly, and neatly tuck away in the motherboard without any cabling. Sadly, the MBD-X10DAL doesn’t support the M.2 interface.\n Instead, I stuck with traditional old SATA. I bought a  1 TB Samsung 860 EVO. I typically allocate 40 GB of space to each VM, so 1 TB would give me plenty of room. If I need to upgrade later, I can always buy more disks.\n    Choosing a power supply unit (PSU) isn’t that interesting, so I again chose mainly by trusted brand, the  Corsair CX550M 550W 80 Plus Bronze.\n The wattage on all of my components added up to 400 W, so 450 W would have been sufficient. But the 550 W version was only $10 more, which seemed like a fair price for an extra 100 W of breathing room.\n The only other important feature to me was semi-modular cabling. In my last build, I made the mistake of using non-modular cabling, which meant that all of the PSU cables stay attached permanently. My server barely has any internal components, so the extraneous power cables created clutter. With semi-modular cabling, I can keep things tidy by removing unused cables from the PSU.\n    The dual-CPU build made cooling an unexpected challenge. The MBD-X10DAL doesn’t leave much space between the two CPU sockets, so I looked carefully for fans thin enough to work side-by-side. A pair of  Cooler Master Hyper 212s fit the bill.\n    My server sits inconspicuously in the corner of my office, so I didn’t want a case with clear panels or flashy lights.\n The  Fractal Design Meshify C Black had positive reviews and seemed like a simple, quiet case.\n    For a headless server, the graphics card doesn’t matter much. It’s still necessary so I can see the screen during the initial install and the occasional debugging session, so I went with the  MSI GeForce GT 710 as a cheap, easy option.\n  I looked into remote administration solutions and was blown away by how expensive they were. At first, I thought I’d use a Dell iDRAC, but the remote console requires a  $300 enterprise license and constrains my build to Dell components. I looked at KVM over IP solutions, but those were even more expensive, ranging from $600 to $1,000.\n   To achieve remote administration, I took the unusual approach of  building my own KVM over IP device out of a Raspberry Pi. I call it  TinyPilot.\n  TinyPilot captures HDMI output and forwards keyboard and mouse input from the browser. It provides the same access you’d have if you physically connected a real keyboard, mouse, and monitor. The software is  fully open source, and I offer all-in-one kits if you’d like to build one for yourself.\n              After  Kimchi burned me on my last build, I was reluctant to try another free solution.  Proxmox has been around for 12 years, so I felt like they were a safe enough bet. Graphics-wise, it’s a huge step up from Kimchi, but it lags behind ESXi in slickness.\n The part of Proxmox that I most appreciate is its scriptability. One of my frequent tasks is creating a new VM from a template and then using  Ansible to install additional software. With ESXi, I couldn’t find a way to do this without manually clicking buttons in the web UI every time. With Proxmox,  their CLI is powerful enough that I can script it down to just  ./create-vm whatgotdone-dev and my scripts create a fresh  What Got Done development VM.\n My biggest complaint is that Proxmox is unintuitive. I couldn’t even figure out how to install it until I found  Craft Computing’s installation tutorial. But once you learn your way around, it’s easy to use.\n  Before I decommissioned my old VM server, I collected simple benchmarks of my common workflows to measure performance improvements.\n Most of my old VMs ran on network storage because its local SSD only had room for a couple of VMs. In the benchmarks below, I compare performance in three different scenarios:\n 2020 Server: All VMs run on local SSD, so there’s no NAS vs. SSD\n   The first benchmark I took was provisioning a new VM. I have a standard Ubuntu 18.04 VM template I use for almost all of my VMs. Every time I need a new VM, I run a shell script that performs the following steps:\n   My new server brought a huge speedup to this workflow. Cloning a VM went from 15 minutes on my old server to less than four minutes on the new one.\n If I skip the package upgrade step, the speedup is a little less impressive. The new server still blows away performance on NAS storage, dropping from eight minutes to just under two and a half. SSD to SSD, it underperforms my previous server. Cloning a VM is likely disk-bound, and my old M.2 SSD was faster than my new SATA SSD.\n  From the moment I power on a VM, how long does it take for me to see the login prompt?\n  My old VMs booted in 48 seconds. The few SSD VMs on my old system did a little better, showing the login prompt in 32 seconds. My new server blows both away, booting up a VM in only 18 seconds.\n  My weekly journaling app,  What Got Done, has automated tests that exercise its functionality end-to-end. This is one of my most diverse workflows — it involves compiling a Go backend, compiling a Vue frontend, building a series of Docker containers, and automating Chrome to exercise my app. This was one of the workflows that exhausted resources on my old VM, so I expected substantial gains here.\n   Surprisingly, there was no significant performance difference between the two servers. For a cold start (downloading all of the Docker base images), the new server is 2% slower than the old one. When the base Docker images are available locally, my new server beats my old, but only by 6%. It looks like the bottleneck is mainly the disk and browser interaction, so the new server doesn’t make much of a difference.\n  One frequent workflow I have is building  Is It Keto, my resource for keto dieters. I generate the site using  Gridsome, a static site generator for  Vue.\n  I expected a significant speedup here, so I was surprised when my build got slower. The build seemed to be mostly CPU-bound on my old server, but doubling CPU resources on my new server did nothing. My next guess was that it was disk-bound, so I tried moving the files to a RAMdisk, but build speeds remained the same.\n My hypothesis is that the workflow is CPU-bound but parallelizes poorly. My old server has fewer CPU cores, but each core is faster. If the build is limited to five or six threads, it can’t take advantage of my new server’s 48 cores.\n  Zestful is my machine-learning-based API for parsing recipe ingredients. Every few months, I train it on new data. This is my most CPU-intensive workflow, so I was interested to see how the new system would handle it.\n  Finally, a case where my 48 CPU cores shine! The new server blows the old one away, training the model in less than half the time. Unfortunately, it’s a workflow I only run a few times per year.\n   Even though /r/homelab may never respect me, on my next build, I’m planning to return to consumer hardware.\n The biggest advantage I see with server components is that they have  better compatibility with server software. Back in 2017, I  couldn’t install ESXi until I disabled multithreading on my CPU, degrading performance substantially. But that was a limitation in the Linux kernel, and later updates  fixed it.\n Server hardware commands a premium because of its greater reliability. For user-facing services, this characteristic is meaningful, but it matters much less on a development server. An occasional crash or bit flip on a dev server shouldn’t ruin your day.\n  This was the first time I’d ever built a dual-CPU computer. It was an interesting experience, but I don’t think it was worth the trouble.\n Based on my benchmarks, the CPU was so rarely the limiting factor in my workflows. The most damning evidence is Proxmox’s graph of my CPU usage over time. In the past few months, I’ve never pushed CPU load above 11%, so I’m crazy overprovisioned.\n   The requirement for dual CPUs drove up the cost of a motherboard substantially and limited my options. Only a scant few mobos support dual Intel 2011-v3 CPUs, so I didn’t have many choices in terms of other motherboard features.\n  Before I used TinyPilot to manage my server, I didn’t realize how change-averse I was. Changing any BIOS or network settings brought a risk of losing the next few hours of my life physically moving around machines and reconnecting peripherals to debug and fix the problem. Knowing that, I never wanted to modify any of those settings.\n Having a virtual console gives me the freedom to fail and makes me more open to experimenting with different operating systems. It’s always going to be a substantial effort to install and learn a new OS, but knowing that I don’t have to drag machines back and forth makes me much more open to it. Had I not built TinyPilot, I might have stuck with ESXi as “good enough” rather than taking a chance on Proxmox.", "posttime": "2020-11-12 12:10:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,构建,homelab,服务器", "title": "构建Homelab虚拟机服务器", "title_en": "Building a Homelab VM Server", "transed": 1, "url": "https://mtlynch.io/building-a-vm-homelab/", "via": "", "real_tags": ["虚拟机", "构建", "homelab", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "b97b383cc5ae2cb3a7bdee260f9524f6.jpg", "infoid": 1034715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊希望让照顾者更容易照看他们年迈的亲戚。\n它有一项名为“关爱中心”的新功能，可以帮助家庭成员安心。\n亚马逊Alexa推出了一项名为Care Hub的新功能，旨在帮助人们照顾年迈的家庭成员。\n该公司表示，多年来一直有客户表示，他们使用Alexa的语音助手来监控年迈的亲属，他们越来越多地希望住在自己的住所，而不是搬到养老院。根据消费者技术协会(Consumer Technology Association)的数据，这种转变为辅助技术创造了一个价值超过300亿美元的市场。\n自周三起，拥有Alexa语音助手的用户可以将他们的账户链接到年迈的爱人的Alexa账户。如果家庭成员接受了邀请，他们的照顾者可以发送警报，并查看他们亲戚的活动订阅。这条信息更像是一个高层次的摘要，其中包括一些基本信息，比如家里使用的灯，而不是监视父母的一种方式。\n还有一个紧急联系功能，爱人可以简单地说，亚历克莎，打电话求救。亚历克莎会立即向照顾者发送推送通知。\nAlexa Experience and Echo Devices副总裁托尼·里德(Toni Reid)表示，一旦建立了这种联系，接受护理的人就不需要做任何事情，就可以像往常一样过一天了。照顾者得到的是心灵的安宁。\n亚马逊多年来一直在关注老龄化领域，一度与代表50岁以上人群利益的游说团体美国退休人员协会(AARP)讨论了潜在的合作事宜。里德承认，亚马逊进入这一领域的第一天就开始了，而且该公司还可以做更多的事情来帮助老年人就地养老。\n里德说，该公司研发这款产品已经有大约18个月了，但考虑到有这么多人和新冠肺炎呆在家里，不能亲自看望亲人，这款产品变得更加重要。在过去的几个月里，该公司一直在与亚马逊员工和他们自己的亲人一起对这款产品进行测试版测试，然后才向更广泛的用户开放。", "note_en": "Amazon wants to make it easier for caregivers to check in on their aging relatives.\n It has a new feature called &#34;Care Hub&#34; to help provide some peace of mind to family members.\n Amazon Alexa is introducing a new feature called  Care Hub, designed to make help people to care for aging family members.\n The company said it has been hearing from customers for years about using Alexa&#39;s voice assistant to monitor aging relatives, who are increasingly looking to stay in their residences rather than move to a nursing home. The shift has created a more than $30 billion market for assistive technology,  according to the Consumer Technology Association.\n  As of Wednesday, customers with an Alexa voice assistant can link their account to an aging loved one&#39;s Alexa account. If the family member accepts the invitation, their caregiver can send alerts and view their relative&#39;s activity feed. That feed is more of a high-level summary that includes basic information such as lights being used in the home rather than a way to spy on parents.\n There&#39;s also an emergency contact feature where the loved one can simply say &#34;Alexa, call for help.&#34; Alexa will then send an immediate push notification to the caregiver.\n &#34;Once that connection is established, the care recipient doesn&#39;t need to do anything and can go about their day as normal,&#34; said Toni Reid, vice president of Alexa Experiences and Echo Devices. &#34;What the caregiver gets is some peace of mind.&#34;\n Amazon has been looking into the aging space for years, at one point discussing  a potential collaboration with AARP, a lobbying group that represents the interests of people over 50. Reid acknowledged that it&#39;s &#34;day one&#34; for Amazon moving into the space, and that there&#39;s a lot more the company can do to help seniors age in place.\n Reid said the company has been working on the product for about 18 months, but it has taken on a new importance given that so many people are staying at home with Covid-19 and unable to see their relatives in person. The company has been beta testing the product with Amazon employees and their own loved ones in the past few months, before opening it up to its broader population of users.", "posttime": "2020-11-12 11:52:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,照顾,care,alexa", "title": "亚马逊推出Alexa Care Hub，帮助人们照顾年迈的亲戚，提供照顾者可以查看的活动馈送，以及紧急联系功能", "title_en": "Amazon unveils Alexa Care Hub, which helps people care for aging relatives, offering an activity feed caregivers can review, and an emergency contact feature", "transed": 1, "url": "https://www.cnbc.com/2020/11/11/amazon-alexa-care-hub-update-helps-in-caring-for-family-members.html", "via": "", "real_tags": ["亚马逊", "amazon", "照顾", "care", "alexa"]}, {"category": "", "categoryclass": "", "imagename": "3f414c3e6edd9acd2d31160b665ffd7f.jpg", "infoid": 1034713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与埃莉诺·罗斯福(Eleanor Roosevelt)的问答环节中，她讨论了联合国、妇女选举权、她的叔叔西奥多·罗斯福(Theodore Roosevelt)总统……", "note_en": "A question and answer session with Eleanor Roosevelt during which she discusses the United Nations, women's suffrage, her uncle President Theodore Roosevelt,...", "posttime": "2020-11-12 11:48:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗斯福,eleanor,roosevelt", "title": "与埃莉诺·罗斯福(Eleanor Roosevelt，1959)的对话[视频]", "title_en": "A Conversation with Eleanor Roosevelt (1959) [video]", "transed": 1, "url": "https://youtube.com/watch?v=tAe2olgJPcI", "via": "", "real_tags": ["罗斯福", "eleanor", "roosevelt"]}, {"category": "", "categoryclass": "", "imagename": "63a87934fcfb7b4d886dc6021a25921c.jpg", "infoid": 1034712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一艘星际方舟将地球上最后的人类运送到一个新家，无意中带来了一个变形的外星人偷渡者突破，这是一部由布鲁斯·威利斯主演，约翰·西蒙斯执导的新科幻动作片。预告片刚刚落下，这部电影看起来就像是《异形》、《X档案》和《事件地平线》中非常普通的元素的混合体。但任何能让威利斯在太空中从外星人手中拯救人类的方式，我都可以接受。\n《套装》最出名的是2016年的大流行，本质上是一部僵尸恐怖惊悚片，完全是从第一人称的角度拍摄的，就像电子游戏一样。他还执导了最近上映的短片Diehard Is Back，这是一部由威利斯主演的有趣的顽固电池广告，向该系列表达了开玩笑的敬意，其中包括几个应该会让粉丝高兴的客串角色。(从争先恐后地发展汽车零部件，到争分夺秒地安装新的顽固电池--麦克莱恩将不惜一切代价重新启动他的汽车。)因此，我希望西装能将悬念、动作和幽默完美地结合在一起，让威利斯成为威利斯。\n这部名为《反生命》的电影以一场毁灭性的瘟疫摧毁了地球上的大部分人口为前提，幸存者正通过星际方舟被疏散到新地球。威利斯饰演的克莱·杨被描述为一名经验丰富的机械师，他是船员中的一员，他们被选中保持清醒，并在为期六个月的旅程中维护方舟。但后来他发现一个变形外星人(根据早期的媒体材料，这是一种邪恶的宇宙恐怖)也藏在方舟上，它似乎打算杀死船上的所有人。\n科迪·科尔斯利(《Riverdale》、《破晓》)饰演即将为人父的初级机械师诺亚，并与克莱联手保护方舟免受外星人入侵。演员阵容还包括瑞秋·尼科尔斯(她也主演过《大流行病》)：钱伯斯、托马斯·简、卡兰·穆尔维、卡桑德拉·克莱门蒂、亚历山大·凯恩、蒂莫西·V·墨菲、拉尔夫·默勒和科里·拉格。\n预告片的开头是方舟的成功起飞，每个人都在庆祝登上最后一艘前往新地球的船。一名机组人员宣称，在接下来的六个月里，我们将满怀希望地穿越时空，这就是他们所说的天堂。但随后，一名男子开始从嘴里流出黑色的粘液，开始横冲直撞。当他的情绪低落，钱伯斯有机会检查他的时候-她似乎接受过科学和/或医学培训-情况是可怕的。她说，似乎有什么东西从里到外在吞噬他。\n计算机分析表明，无论它是什么，它都不是人类。而且它仍然逍遥法外，捕食被感染的人类，变成某种狂暴的僵尸。(我感觉到西装的工作是一个主题。)这是克莱的暗示，拿出重炮，向外星生命形式宣战。(我感觉到了一个主题，那就是穿着西装工作。)这是克莱发出的一个信号，那就是拿出重炮，向外星生命形式宣战。考虑到船上有30万个灵魂，方舟正以光速驶向新地球，船上有一种饥饿的传染性外星生命，赌注很高。\n《突破》在部分影院上映，并将于2020年12月18日通过视频点播。威利斯的一些最好的电影都是科幻动作片，所以很高兴看到他重返这一类型。失陪一下，我把《12只猴子》、《第五元素》和《环路》排在一起，等待周末的重播。", "note_en": "An interstellar ark transporting the last humans on Earth to a new home inadvertently brings along a shape-shifting alien stowaway in   Breach, a new sci-fi action film starring Bruce Willis and directed by John Suits. The trailer just dropped, and the film looks like a fairly generic mix of elements from  Alien, The X-Files, and  Event Horizon. But anything that lets Willis &#34; yippee-ki-yay&#34; his gun-toting way to saving humanity from aliens in space is okay by me.\n Suits is best known for 2016&#39;s   Pandemic, essentially a zombie horror thriller shot entirely from a first person point of view, like a video game. He also directed the recently released short   Diehard is Back, a fun Willis-starring commercial for Diehard batteries that pays tongue-in-cheek homage to the franchise, including a few cameos that should delight fans. (&#34;From fighting his way to Advance Auto Parts to racing against the clock to install his new DieHard Battery—McClane will stop at nothing, to start his car again.&#34;) So I&#39;m hopeful that Suits can bring a fitting mix of suspense, action, and humor to  Breach, and just let Willis be Willis.\n Originally titled  Anti-Life, the film&#39;s premise is that a devastating plague has wiped out much of Earth&#39;s population, and the survivors are being evacuated via an interstellar ark to &#34;New Earth.&#34; Willis plays Clay Young, described as a hardened mechanic who is part of the crew selected to stay awake and maintain the ark for the six-month journey. But then he discovers a shapeshifting alien (or &#34;a malevolent cosmic terror,&#34; per the early press materials) has also stowed away on the ark, and it seems to be intent on killing everyone on board.\n Cody Kearsley ( Riverdale,  Daybreak) co-stars as Noah, a junior mechanic who is about to become a father, and teams up with Clay to protect the ark from the alien invader. The cast also includes Rachel Nichols (she also starred in  Pandemic) as Chambers, Thomas Jane, Callan Mulvey, Kassandra Clementi, Alexander Kane, Timothy V. Murphy, Ralf Moeller, and Corey Large.\n The trailer opens with the ark&#39;s successful take-off, and everyone celebrates being on the last ship to New Earth. &#34;For the next six months we will blaze across space and time with high hope it&#39;s the paradise they said it would be,&#34; one of the crew members declares. But then one dude starts oozing black goo from his mouth and going on a rampage. By the time he&#39;s subdued and Chambers has a chance to check him out—she appears to have scientific and/or medical training—the situation is dire. &#34;Something appears to be eating him from the inside out,&#34; she says.\n The computer analysis reveals that whatever it is, it isn&#39;t human. And it&#39;s still out there, preying on the humans, who become infected and turn into some kind of rage zombies. (I&#39;m sensing a theme with Suits&#39; work.)  That&#39;s Clay&#39;s cue to bring out the heavy artillery and declare war on the alien life form.  The stakes are high, given that there are 300,000 souls on board the ship, and the ark is speeding toward New Earth at the speed of light with a ravenous infectious alien life form on board.\n Breach opens in select theaters and will be available via video on demand on December 18, 2020. Some of Willis&#39; best films have been science fiction action movies, so it&#39;s nice to see him return to the genre. Excuse me while I queue up  12 Monkeys, The Fifth Element, and  Looper for a weekend re-watch.", "posttime": "2020-11-12 11:33:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,willis,方舟", "title": "布鲁斯·威利斯返回太空踢破预告片中的外星人臀部", "title_en": "Bruce Willis returns to space to kick some alien derriere in Breach trailer", "transed": 1, "url": "https://arstechnica.com/gaming/2020/11/bruce-willis-returns-to-space-to-kick-some-alien-derriere-in-breach-trailer/", "via": "", "real_tags": ["太空", "willis", "方舟"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Volt是一个反应式的web框架，你的Ruby代码可以同时运行在服务器和客户端(通过OPAL)。", "note_en": "Volt is a reactive web framework where your Ruby code runs both on the server and the client (via opal).", "posttime": "2020-11-12 11:07:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,代码,web,reactive", "title": "Volt：一个反应式Web框架，您的Ruby代码可以同时运行服务器和客户端", "title_en": "Volt: A reactive web framework where your Ruby code runs both server and client", "transed": 1, "url": "http://www.voltframework.com/", "via": "", "real_tags": ["ruby", "代码", "web", "reactive"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "针对搭载苹果硅片处理器的MacBookAir10.1的基准测试结果。", "note_en": "Benchmark results for a MacBookAir10,1 with an Apple Silicon processor.", "posttime": "2020-11-12 11:06:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macbook-air,macbook,air,苹果", "title": "MacBook Air M1 Geekbench", "title_en": "MacBook Air M1 Geekbench", "transed": 1, "url": "https://browser.geekbench.com/v5/cpu/4651056", "via": "", "real_tags": ["macbook", "air", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "d0e0f22be6b3d2920755bebf8a347ebe.jpg", "infoid": 1034708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我不知道有多少40岁以下的人明白这个问题的意义。如果你不到40岁，当你学会阅读的时候，罗德·麦昆已经开始淡出舞台了。他不再是电视综艺节目的常客-部分原因是电视综艺节目在70年代末已经淡出舞台。他仍然在现场表演，但他的大部分观众都是多年来一直去看他的演出的人。在20多年来源源不断地出版诗集和歌词之后，他的作品-在那段时间的大部分时间里使他成为世界上销量最大的诗人-最终告吹了。在1986年的《间隔时间》和《情人节》之后，只有两本书出版于本世纪初。\n但有一段时间，从1967年到20世纪70年代中期，你走进书店或唱片店，打开电视或收音机，都会遇到罗德·麦昆(Rod McKuen)。如果他不像披头士那样高大，他就像赫伯·阿尔伯特和提华纳铜管乐队或者杰奎琳·苏珊一样高大，而且肯定更多产。\n这在现在看来似乎很奇怪，但曾经有一段时间，正如2002年发表在《旧金山纪事报》(San Francisco Chronicle)上的一篇简介所说，“每个开明的郊区双层住宅都有罗德·麦昆(Rod McKuen)的那一份。”在《今夜秀》和黛娜·肖尔的综艺节目中，他那醇厚的诗歌放在桌子上(听着温暖的声音)，他动人的音乐和有声录音放在高保真音响里，他和蔼的面孔出现在片场。(在我们家，这是他与安妮塔·克尔(Anita Kerr)合作的作品之一《海》(The Sea)。)。在弗兰克·西纳特拉漫长的职业生涯中，罗德·麦昆是他唯一一位用整张专辑创作的词曲作者。男人买他的书是为了向他们的女朋友展示他们有多敏感，女人买给他们的男朋友是为了让他们知道什么是敏感。1967年，《沃斯堡星报》(Fort Worth Star-Telegram)在一篇侧写中宣称：“对罗德·麦昆(Rod McKuen)的狂热崇拜突飞猛进。”\n同年，“芝加哥论坛报”的娱乐编辑滔滔不绝地说：“Rod McKuen很棒，很棒，绝对很棒！他是一位诗人，除了自己的歌曲和诗歌，他几乎什么都不唱，什么都不读。听起来不像夜总会表演吗？嗯，他不只是阅读和演唱他们-他生活在他们，并让你呼吸和感受他们。他把你拖过各种情绪，前一分钟还让你哽咽，下一分钟又让你哈哈大笑。", "note_en": "I wonder how many people under the age of 40 understand the point of this question. If you’re under 40, by the time you learned to read, Rod McKuen had already begun to fade from the scene. He was no longer a regular on television variety shows — in part because television variety shows had themselves faded from the scene by the end of the Seventies. He was still performing live, but much of his audience were people who’d been going to his shows for years. After pumping out a steady stream of books of poetry and lyrics for over two decades, his output — having made him the biggest selling poet in the world for much of that time — fizzled out. After  Intervals and  Valentines in 1986, there would only be two more books, published in the early 2000s.\n But there was a time — from 1967 to around the mid-1970s — when you couldn’t walk into a bookstore or record store or turn on a TV or radio without bumping into Rod McKuen. If he wasn’t as big as the Beatles, he was as big as Herb Alpert and the Tijuana Brass or Jacqueline Susann and certainly more prolific.\n  It make seem odd now, but there was a time when, as a profile that appeared in  The San Francisco Chronicle  in 2002 put it, “every enlightened suburban split-level home had its share of Rod McKuen.” “His mellow poetry was on the end table ( Listen to the Warm), his lovestruck music and spoken-word recordings were on the hi-fi and his kindly face was on the set, on  The Tonight Show and Dinah Shore’s variety hour.” (In our house, it was  The Sea, one of his collaborations with  Anita Kerr.) In Frank Sinatra’s long career, Rod McKuen was the only songwriter he ever devoted an entire album to. Guys bought his books to show their girlfriends how sensitive they were and women bought them for their boyfriends to show them what sensitive was. “The cult of Rod McKuen grows by leaps and bounds,” proclaimed a 1967 profile in the  Fort Worth Star-Telegram.\n  The same year,  The Chicago Tribune’s entertainment editor gushed, “Rod McKuen is great, great, absolutely great! His is a poet, and he sings and reads practically nothing but his own songs and poems. Doesn’t sound like a night club act? Well, he doesn’t just read and sing them — he lives them and makes you breathe and feel them. He drags you through the gamut of emotions, putting a lump in your throat one minute and making you chortle the next.”  1", "posttime": "2020-11-12 10:45:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "麦昆,rod,出版", "title": "对罗德·麦昆有什么看法？", "title_en": "What to Make of Rod McKuen?", "transed": 1, "url": "https://neglectedbooks.com/?p=7339", "via": "", "real_tags": ["麦昆", "rod", "出版"]}, {"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1034706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的基本理论是，在今年的全球数据中心的主题演讲中宣布，苹果最终是 -  - ，将Mac平台从英特尔的x86架构转移到他们自己的定制硅片，而不只是使用A系列芯片来实现这一点。Mac电脑不会与iPhone和iPad共享芯片。在性能方面，苹果本可以走这条路，至少在消费级设备上是这样，但在我看来，WWDC主题演讲中的苹果硅片似乎是在暗示一项雄心勃勃得多的努力。我是对的。这就是在台式机上使用他们令人惊叹的移动芯片和利用他们的芯片专业知识设计台式机专用芯片之间的不同之处。\n苹果公司称昨天的发布会是“又一件事”，虽然他们宣布了三款新的Mac电脑，但它实际上是关于一件新的东西：M1。基于M1的新MacBook Air、13英寸MacBook Pro和Mac Mini最好不要被认为是三台不同的电脑，而是同一台电脑的三种不同表现形式。\n无论从哪个角度来看，这些电脑都比他们要取代的基于英特尔的Mac电脑快得多。但最大的胜利，也是苹果明确的关注点，不是速度，而是电池续航时间。苹果称，自今年3月起，搭载英特尔处理器的MacBook Air在“无线网页浏览”和“Apple TV应用程序电影播放”方面的电池续航时间分别为11小时和12小时。新款M1 MacBook Air将这两种时间分别延长至15小时和18小时。这一差异在苹果新款M1 MacBook Pro的规格上更加明显，它声称在网页浏览和电影播放方面的电池续航时间分别为17小时和20小时。目前基于英特尔的13英寸MacBook Pro每次测试只有10个小时。这几乎是电池寿命的两倍。双倍!。\n对于不知道“苹果硅”是什么意思的大众市场消费者来说，这是一个很好的卖点：电池续航时间现在真的是全天候。为你的MacBook Air或Pro充电一整晚，你就可以整天辛苦地使用它，而不需要靠近电源插座。在这一点上，你显然希望能够像iPad一样使用这些新的MacBook，在 - 上，充电和使用它们是完全不同的行为。在我看来，毫无疑问，苹果在几年前就可以实现向Apple Silicon的转变，但他们显然想等到优势压倒性和不可否认的时候再做。这一点在电池寿命数据中表现得最为明显。\nM1实际上是一个芯片上的整个系统。所有东西都在M1上。当然是各种处理器：CPU核心、GPU核心、神经引擎核心。但其他一切也都在M1上：存储控制器、安全飞地、内存控制器，是的，还有内存本身。基于M1的Mac的DRAM在封装上(我相信“在基板上”是技术行话)。\n这种设计的缺点是，DRAM不是您可以事后配置的东西。但多年来，从消费者机型到高端16英寸Pro机型，苹果的整个MacBook产品阵容都是如此。但有了M1，存储器不仅仅是焊接在电路板上，它还集成到了SoC - 中，就像它在A系列SoC中所做的那样。苹果称其为“统一内存架构”(UMA)：\nM1还采用了我们的统一内存架构(UMA)。M1将其高带宽、低延迟内存统一到一个定制包内的单个池中。因此，SoC中的所有技术都可以访问相同的数据，而无需在多个内存池之间进行复制。这极大地提高了性能和能效。视频应用程序更快。游戏内容更丰富、更详细。图像处理速度非常快。而且你的整个系统反应更灵敏。\n - 没有单独的“视频内存”和“系统内存”，只有内存。“共享内存”和“集成显卡”在历史上声名狼藉，因为它们意味着廉价的低性能妥协。苹果的芯片团队真的为这款UMA系统和M1上的集成GPU感到自豪。这是一种提高性能和能效的设计。\n根据苹果公布的数据，这些系统运行速度很快。在这一点上，他们已经赢得了我们的信任。事实上，我们知道，iPhone 12和新款iPad Air中的A14芯片比除最高端的英特尔和AMD x86笔记本电脑芯片以外的所有芯片都要快得多，能效也要高得多。AnandTech昨日发布了一份详细的对比报告，显示了这一点。我们还知道，苹果承诺M1的高性能内核比A14的 - 更快，M1有四个高性能内核，而A14只有两个。每个高性能内核的速度都更快，而且其数量是高性能内核的两倍。\n因此，如果A14的表现明显好于除最新、最棒的x86笔记本电脑芯片 - 之外的所有产品，并保住自己的地位，即使是与那些 - 相比，如果苹果吹嘘M1是市场上速度最快的CPU的说法是不正确的，那将是相当令人震惊的。\n所有这一切令人震惊的部分是，M1只用于苹果价格较低的消费者Mac电脑。\n等等，等等，你可能会说，MacBook Pro是专业的。但正如我已经写过无数次的那样，在苹果的产品命名术语中，PRO并不总是代表专业的。很多时候，它只是意味着更好或更好。新的M1 13英寸MacBook Pro只是在某种程度上是专业的，比如说AirPods Pro。自从四年前著名的Macbook“Escape”被建议作为当时仍然失踪的视网膜MacBook Air的替代品以来，苹果的入门级13英寸MacBook Pro - 就一直是这样，这款机型只有两个USB接口的 - 。\n新的M1 MacBook Pro是与M1 MacBook Air相同的基本电脑，但增加了：\nM1 13英寸的MacBook Pro将在持续性能上超过MacBook Air，这不是因为它有更好的CPU或GPU，而是因为它有一个风扇，可以让高性能内核在更长的时间内运行得更快。(M1 Mac Mini的散热余地更大，因为它的外壳更大，不是由电池供电的，因此是三款机器中速度最快的。但由于它不是由电池驱动的，它似乎比同等的英特尔前身优势最小。)。同样值得注意的是，售价999美元的入门级MacBook Air只有7个GPU核心，而不是8个。可以得出这样的结论：这是芯片堆积的结果，但苹果对此不予置评，这一点也就不足为奇了。\n但从根本上说，这两款Macbook是一样的， - 专业版只是因为它的冷却系统而更有吸引力。而M1 Mac Mini则与台式机外壳中的电脑一模一样。\n这些机器都有相同的限制，以及 - 最高16 GB的内存和2TB的固态硬盘存储 - ，这一事实绝不表明苹果在专业内存和存储需求上有丝毫的倒退。基于英特尔技术的13英寸MacBook Pro支持高达32 GB的RAM和4TB的存储空间。英特尔Mac Mini支持高达64 GB的RAM。还有16英寸的MacBook Pro，它支持高达64 GB的RAM和8 TB的固态硬盘存储。\n唯一完全被M1机型取代的基于英特尔的Mac是Macbook Air - ，英特尔的机型从未提供过新的M1机型无法达到或超过的任何规格。苹果继续销售基于英特尔系统的13英寸MacBook Pro和Mac Minis。这并不是说人们对苹果的硅芯片缺乏信心，而是因为按照苹果公司的主旨，M1只适用于“低功耗系统或小尺寸、高能效”。苹果尚未推出专业级M系列芯片。(我猜“M1x”是第一代高功率Mac SoC的名字。想想看，M2应该是下一代用于MacBook Air、低端MacBook Pro和Mac Mini的SoC的名字。我认为Mac Pro和iMac Pro可能会有自己的SoC系列，比如“X1”。)。\n我不知道即将推出的更高端的苹果Silicon MacBook Pro是否会配备四个USB/迅雷接口 - 这家公司多年来一直在销售只有一个接口的12英寸半高价位MacBook，但我非常肯定它们将支持超过16 GB的内存和2TB的存储空间。我真诚地希望，我认为技术上合理的是，13英寸的高端MacBook Pro将达到与16英寸机型相当的规格，支持高达64 GB的RAM和8TB的固态硬盘存储，或许还能提供同等的图形性能。但在未来的苹果硅基13英寸MacBook Pro中，32G的RAM和4TB的存储空间应该被认为是既定的。\n苹果昨天发布的是一款基于硅片的苹果MacBook Pro，而不是唯一一款基于硅片的苹果MacBook Pro。我敢打赌，未来的高端配置将有四个usb/迅雷接口 - ，两边各有两个 - 接口。\n在更大的技术领域，苹果M1发布的最初报道 - 跨平台的视角，如果你愿意的话， - 似乎想把Mac向苹果硅的过渡放在与基于ARM的Windows笔记本电脑相同的背景下。我认为这样看待问题是错误的， - ，这只会直接导致糟糕的假设。与高通(Qualcomm)等公司的ARM芯片相比，苹果硅芯片属于完全不同的类别，它们的背景都是手机。问M1 Mac是否会面临与基于ARM的Windows笔记本电脑相同的问题，就像问特斯拉是否会达到电动滑板车的极限一样。基于ARM的Windows PC需要进行巨大的权衡 - 您可以获得高效率和小巧的外形尺寸，但您会损失性能，并且软件兼容性受到严重限制。Apple Silicon的承诺是，多亏了Rosetta，Mac用户获得了更高的性能、更长的电池续航时间、大量的本地软件以及与传统软件的高性能兼容性。这就像拥有你的蛋糕，也吃它，并与你的朋友分享你的蛋糕。\n苹果仍然比许多Mac发烧友更迷恋Touch Bar。有很多Mac用户鄙视Touch Bar，但如果你想要一台带风扇的M1 MacBook，你唯一的选择就是MacBook Pro。没有配备风扇但没有触摸栏 - 的M1 MacBook，如果有的话，很多人都会买。\n新的M1 Mac Mini只有Silver版本。目前仍在销售的英特尔Mac Mini仅在Space Gray发售。\n这些最初的苹果硅谷Mac没有触摸屏支持。这正是我所期待和希望的。然而，这令人失望，似乎也让其他人大吃一惊。毫无疑问，Big Sur确实有一些元素看起来更像iOS-y，但我不知道为什么这么多人认为它们看起来是为触摸而设计的。他们不是，也不是 - ，我认为他们不应该是。\n归根结底，十多年来，iPhone和iPad的芯片都是苹果设计的，竞争对手无法匹敌，现在仍然无法匹敌。现在，Mac电脑也开始这么做了。", "note_en": "My basic theory since the announcement during  this year’s WWDC keynote that Apple was — finally — moving the Mac platform from Intel’s x86 architecture to their own custom silicon, has been that they would not merely be using A-series chips for this. That Macs wouldn’t be sharing chips with iPhones and iPads. Apple  could have gone this route, performance-wise, at least for the consumer grade devices, but the Apple Silicon segment of the WWDC keynote sounded to me like they were suggesting a far more ambitious endeavor. I was right. It’s the difference between using their amazing mobile chips in desktops, and using their chip expertise to design desktop-focused chips.\n Apple billed  yesterday’s event as “One More Thing”, and while they announced three new Macs, it really was about  one new thing: the M1. The new M1-based MacBook Air, 13-inch MacBook Pro, and Mac Mini are best thought of not as three different computers, but rather three different manifestations of the same computer.\n These are, by all accounts and measures, far faster machines than the Intel-based Macs they’re replacing. But the big win, and clear focus from Apple, isn’t speed but battery life. Apple’s quoted battery life times for  the Intel-based MacBook Air from March of this year for “wireless web browsing” and “Apple TV app movie playback” were  11 and 12 hours, respectively. The  new M1 MacBook Air pushes those times to 15 and 18 hours. The difference is even more striking with Apple’s  specs for the new M1 MacBook Pro, which claim battery life of 17 and 20 hours for web browsing and movie playback. The current Intel-based 13-inch MacBook Pro gets just 10 hours on each of those tests. That’s very close to double the battery life. Double!\n This is the sellable bullet point for the mass market consumer who has no idea what “Apple Silicon” means: battery life is now truly all-day. Charge your MacBook Air or Pro overnight, and you can use it hard all day without ever once being near a power outlet. You’re clearly intended to be able to use these new MacBooks like iPads in that regard — where  charging them and  using them are entirely different actions. There’s no question in my mind that Apple could have made this transition to Apple Silicon a few years ago, but they clearly wanted to wait until the advantages were overwhelming and undeniable. And nowhere is that more evident than with these figures for battery life.\n The M1 really is an entire system on a chip.  Everything is on the M1. The various processors, of course: the CPU cores, the GPU cores, the Neural Engine cores. But everything else is on the M1 too: the storage controller, the Secure Enclave, the memory controller, and, yes, the memory itself. The DRAM for M1-based Macs is on the package (“on the substrate”, I believe is the technical lingo).\n The downside of this design is that DRAM is not something you can configure after the fact. But this has been true for Apple’s entire MacBook lineup, from consumer Airs to high-end 16-inch Pro models, for years. But with the M1, memory isn’t just soldered onto a board, it’s integrated into the SoC — just like it has been for A-series SoCs. Apple calls this “unified memory architecture”,  or UMA:\n M1 also features our unified memory architecture, or UMA. M1unifies its high‑bandwidth, low‑latency memory into a single poolwithin a custom package. As a result, all of the technologies inthe SoC can access the same data without copying it betweenmultiple pools of memory. This dramatically improves performanceand power efficiency. Video apps are snappier. Games are richerand more detailed. Image processing is lightning fast. And yourentire system is more responsive.\n There’s no separate “video memory” and “system memory” — just memory. “Shared memory” and “integrated graphics” have gotten a bad name historically, because they signified cheap low-performance compromises. Apple’s chip team is really  proud of this UMA system and the integrated GPU on the M1. It’s a design that increases performance and power efficiency.\n These systems are, according to Apple’s stated numbers, fast. They’ve more than earned our trust on that. We know, for a fact, that the A14 chip in the iPhones 12 and new iPad Air is both faster and far more power efficient than all but the very highest end Intel and AMD x86 laptop chips.  AnandTech published a detailed comparison yesterday showing just that. And we also know that Apple has promised that the M1’s high-performance cores are faster than the A14’s —  and the M1 has four high performance cores, while the A14 only has two. Each high-performance core is faster, and it has twice the number of them.\n So if the A14 clearly outperforms all but the latest and greatest x86 laptop chips — and holds it own even against those — it would be rather shocking if Apple’s boasting that the M1 is the fastest CPU on the market is  not true.\n The mind-blowing part of all this is that the M1 is only being used in Apple’s less expensive consumer Macs.\n Wait, wait, wait, you might be saying, the MacBook Pro is  pro. But as I’ve written numerous times,  pro, in Apple’s product-naming parlance, doesn’t always stand for  professional. Much of the time it just means  better or  nicer. The new M1 13-inch MacBook Pro is  pro only in the way, say, AirPods Pro are. This has been true for Apple’s entry-level 13-inch MacBook Pros — the models with only two USB ports — ever since the famed  MacBook “Escape” was suggested as a stand-in for the then-still-missing retina MacBook Air four years ago.\n The new M1 MacBook Pro is the same basic computer as the M1 MacBook Air, but adds:\n  The M1 13-inch MacBook Pro will outperform the MacBook Air in sustained performance, not because it has a better CPU or GPU, but because it has a fan that allows the high performance cores to run faster for longer stretches. (The M1 Mac Mini has even more thermal headroom, because it’s a bigger enclosure and isn’t battery-powered, and thus is the fastest machine of the three. But because it isn’t battery powered, it seemingly has the fewest advantages over its equivalent Intel predecessor.) Also noteworthy: the $999 entry-model MacBook Air only has 7 GPU cores, not 8. It’s logical to conclude that this is the result of  chip binning, but Apple, unsurprisingly, has no comment on the matter.\n But fundamentally these are the same two MacBooks — the Pro version just has a bit more  oomf thanks to its cooling system. And the M1 Mac Mini is just the same computer in a desktop enclosure.\n The fact that these machines all share the same limitations, as well — a maximum of 16 GB of RAM and 2 TB of SSD storage — is not in any way an indication that Apple is regressing an iota on professional memory and storage needs. Intel-based 13-inch MacBook Pros  support up to 32 GB of RAM and 4 TB of storage. Intel Mac Minis  support up to 64 GB of RAM. And then there’s the 16-inch MacBook Pro, which  supports up to 64 GB of RAM and  8 TB of SSD storage.\n The only Intel-based Macs that have been completely replaced by M1 models are the MacBook Airs — the Intel models of which have never offered specs of any kind that aren’t met or exceeded by the new M1 models. Apple continues to sell Intel-based 13-inch MacBook Pros and Mac Minis. That doesn’t betray a lack of confidence in Apple Silicon; it’s simply the result of the M1 only being intended for “low-power systems or small size and power efficiency”, per Apple’s keynote. Apple hasn’t yet unveiled its professional-grade M-series chips. (I’m guessing “M1X” as the name for the first  high-power Mac SoC. The “M2”, when you think about it, would be the name of the next-generation SoC for MacBook Airs and lower-end MacBook Pros and Mac Minis. And I’m thinking the Mac Pro and iMac Pro might get their own series of SoCs, say, the “X1”.)\n I don’t know if the upcoming higher-end Apple Silicon MacBook Pros are going to include four USB/Thunderbolt ports — this  is the company that sold a 12-inch semi-premium-priced MacBook with just one port for years — but I’m damn certain that they’ll support more than 16 GB of RAM and 2 TB of storage. My sincere and I think technically reasonable hope is that the 13-inch high-end MacBook Pros will reach spec-parity with the 16-inch models, supporting up to 64 GB of RAM and 8 TB of SSD storage, and perhaps offering equivalent graphics performance. But 32 GB of RAM and 4 TB of storage in future Apple Silicon-based 13-inch MacBook Pros should be considered a given.\n What Apple announced yesterday was  an Apple Silicon-based MacBook Pro, not the  only Apple Silicon-based MacBook Pro. And I would bet that future high-end configurations  will have four USB/Thunderbolt ports — two on each side — as well.\n  Initial coverage of Apple’s M1 announcement  in the greater tech sphere — the cross-platform perspective, if you will — seems to want to place the Mac’s transition to Apple Silicon in the same context as ARM-based Windows laptops. I think that’s the wrong way to look at it — and it’s only going to lead to bad assumptions right out of the gate. Apple Silicon is in an entirely different class than the ARM chips from companies like Qualcomm, with a phone-focused background. Asking if M1 Macs are going to face the same problems as ARM-based Windows laptops is like asking if Teslas are going to hit the same limits as electric scooters. ARM-based Windows PCs necessitate significant trade-offs — you get high efficiency and small form factors, but you lose performance and suffer from severely limited software compatibility. The promise of Apple Silicon is that Mac users get higher performance, longer battery life,  and lots of native software and high-performance compatibility with legacy software thanks to  Rosetta. It’s like having your cake, eating it too,  and getting to share your cake with your friends.\n Apple remains more enamored with the Touch Bar than many Mac enthusiasts are. There are a lot of Mac users who  despise the Touch Bar, but if you want an M1 MacBook with a fan, your only choice is the MacBook Pro. There is no M1 MacBook with a fan but without a Touch Bar — and a lot of people would buy one if there were.\n The new M1 Mac Mini is only available in Silver. The current Intel Mac Mini that remains available for sale is only available in Space Gray.\n No touchscreen support in these initial Apple Silicon Macs. That’s what I both expected  and hoped for. However, this is a disappointment and seemingly a surprise  to others. There are certainly elements of Big Sur that look more iOS-y, no question, but I don’t know why so many people think they look designed for touch. They don’t and they aren’t — and, says me, they shouldn’t be.\n The bottom line is that for over a decade, iPhones and iPads have had Apple-designed chips the competition could not and still cannot match. Now the Mac does too.", "posttime": "2020-11-12 10:26:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大胆,daring,苹果", "title": "大胆的火球", "title_en": "Daring Fireball", "transed": 1, "url": "https://daringfireball.net/2020/11/one_more_thing_the_m1_macs", "via": "", "real_tags": ["大胆", "daring", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "4cdc98cfe23137c7cfb937652c6989fc.jpg", "infoid": 1034705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天，苹果推出了首款搭载M1苹果硅芯片的MacBook Air、MacBook Pro和Mac mini，截至今天，新芯片的第一个基准似乎出现在Geekbench网站上。\nM1芯片属于‌MacBook Air‌，内存为8 GB，单核得分为1,687分，多核得分为7,433分。根据基准，M1的基频为3.2 GHz。\n与现有设备相比，‌MacBook Air‌中的M1芯片表现优于所有iOS设备。相比之下，iPhone12 Pro的单核得分为1584分，多核得分为3898分，而Geekbench排行榜上排名最高的iOS设备A14 iPad Air的单核得分为1585分，多核得分为4647分。\n与Mac相比，单核的性能比其他任何Mac都要好，多核性能也超过了所有2019年16英寸MacBook Pro机型，包括第10代高端2.4 GHz英特尔酷睿i9机型。这款高端的16英寸MacBook Pro单核得分为1096分，多核得分为6870分。\n尽管在原始CPU基准测试方面，M1芯片的表现优于16英寸MacBook Pro，但16英寸MacBook Pro在其他领域的性能可能会更好，比如GPU，因为这些型号配备了高功率的独立GPU。\n值得一提的是，尽管‌MacBook Air‌和‌MacBook Pro使用的是相同的M1芯片，但它们的性能可能会有所不同，因为苹果MacBook Air‌采用的是无风扇设计，而MacBook Pro则采用了苹果设计的新冷却系统。不过，Mac mini也有一个基准，得分大致相同。\n我们期望极客替补席得分对Air和Pro是一样的吗？\n可能是在一个相对较短的基准上，比如Geekbench，除非在时钟速度上有不同的情况，我对此表示怀疑。在较长时间的任务中，会感觉到无风扇设计。\n在测试新款iPhone的摄像头功能时，摄影师奥斯汀·曼的详细评论是首屈一指的。IPhone 12 Pro Max的评论今天早上上线了，曼恩的深度摄像头测试现在也可以使用了。\r对于任何对iPhone12 Pro Max摄像头感兴趣的人来说，曼恩的评论都是必读的评论，因为这是苹果公司一段时间以来的第一次……。\n苹果的虚拟活动还有一件事今天上午10点开始。太平洋时间，苹果预计将推出其首批基于苹果硅芯片的Mac机型。有传言称，13英寸的MacBook Air和13英寸的MacBook Pro将是第一批转型的机型，而16英寸的MacBook Pro也是可能的。\r目前还不清楚我们是否还会看到其他……。\n苹果公司今天举行了第三次秋季发布会，这一次的焦点是Mac电脑。苹果宣布推出新款MacBook Air、MacBook Pro和Mac迷你机型，所有这些机型都配备了苹果第一款硅芯片M1。\r订阅MacRumors YouTube频道可以观看更多视频。在这次发布会上，苹果花了不到一个小时的时间介绍了所有的新设备，但我们已经回顾了所有的情况。\n苹果公司今天举办了一场虚拟活动，推出其首批三款Mac电脑，配备了定制设计的M1芯片，承诺将CPU性能提高3.5倍，显卡速度提高6倍，机器学习能力提高15倍，电池续航时间提高2倍。\r有趣的是，活动以约翰·霍奇曼(John Hodgman)的简短露面结束，他在苹果标志性的广告中被称为PC男，从……获得一台Mac电脑。\n苹果公司今天宣布的新发布的MacBook Air和MacBook Pro配备了相同的8核M1芯片，也提供了集成的GPU，苹果没有提供CPU升级。不过，MacBook Air也可以升级GPU。默认情况下，MacBook Air配备的M1芯片配备7核GPU，而MacBook Pro配备的M1芯片配备8核GPU。\r..。\n苹果公司今天推出了一款新的MacBook Air，这是它的第一款Mac电脑，配备了被称为M1芯片的定制苹果硅处理器。新的MacBook Air比上一代MacBook Air快3.5倍，图形性能快5倍。\r全新MacBook Air的主要特点：苹果设计的M1芯片，配备8核CPU和8核GPU\r一种完全安静、无风扇的设计\r高达3.5倍的CPU速度，...。\n据韩国网站The Elec报道，苹果将在2021年为至少两款iPhone采用采用低功耗LPTO背板技术的OLED显示屏。\r从报告中可以看出：\r据The Elec获悉，LG Display将提高其专为苹果生产的有机发光二极管(OLED)面板生产线的生产率。\rLG Display正计划将低温多晶氧化物。\n有传言称，苹果即将推出的AirTags蓝牙物品追踪器将配备各种配件，以便将它们连接到物品上。现在，一个所谓的AIRTAG钥匙链已经在推特上浮出水面。\r泄密者软糖(@choco_bit)分享了一个可能是AIRTAG携带的鞍褐色配件。正如福吉指出的那样，这枚戒指的设计是……这是一项AIRTAG&39；配件的专利。\n本周，苹果正式推出了搭载苹果定制M1芯片的13英寸MacBook Pro、MacBook Air和Mac迷你机型，从而正式开始在Mac电脑上取代英特尔(Intel)处理器，而这三个系统只是个开始。\r在周二的虚拟活动之后，苹果重申，向苹果硅片的过渡将需要大约两年的时间才能完成。\n在iPhone 12 Mini和iPhone 12 Pro Max于周五发布之前，苹果的禁令解除了对这两款产品的评论。除了我们更详细的评论综述之外，我们还收集了一些拆箱视频和对以下设备的评论。此外，还有苹果即将推出的MagSafe充电器和皮革袖子配件的拆箱视频。\r图片：安德鲁·爱德华兹第一件事……", "note_en": "Apple introduced the first  MacBook Air, MacBook Pro, and  Mac mini with M1  Apple Silicon chips yesterday, and as of today, the first benchmark of the new chip appears to be  showing up on the Geekbench site.\n The M1 chip, which belongs to a ‌MacBook Air‌ with 8GB RAM, features a single-core score of 1687 and a multi-core score of 7433. According to the benchmark, the M1 has a 3.2GHz base frequency.\n When compared to existing devices, the M1 chip in the ‌MacBook Air‌ outperforms all iOS devices. For comparison&#39;s sake, the  iPhone 12 Pro earned a single-core score of 1584 and a multi-core score of 3898, while the highest ranked iOS device on Geekbench&#39;s charts, the A14  iPad Air, earned a single-core score of 1585 and a multi-core score of 4647.\n In comparison to Macs, the single-core performance is better than any other available Mac, and the multi-core performance beats out all of the 2019 16-inch MacBook Pro models, including the 10th-generation high-end 2.4GHz Intel Core i9 model. That high-end 16-inch MacBook Pro earned a single-core score of 1096 and a multi-core score of 6870.\n Though the M1 chip is outperforming the 16-inch MacBook Pro models when it comes to raw CPU benchmarks, the 16-inch MacBook Pro likely offers better performance in other areas such as the GPU as those models have high-power discrete GPUs.\n It&#39;s worth noting that there are likely to be some performance differences between the MacBook Pro and the ‌MacBook Air‌ even though they&#39;re using the same M1 chip because the ‌MacBook Air‌ has a fanless design and the MacBook Pro has an new Apple-designed cooling system. There&#39;s also a  benchmark for the Mac mini, though, and it has about the same scores.\n Do we expect the geek bench score to be the same for the Air and the Pro?\nOn a relatevely short benchmark like Geekbench probably, unless there is a different in clock speeds which I doubt. On longer tasks the fanless design will be felt.\n  When it comes to testing the camera features in new iPhone models, photographer Austin Mann&#39;s detailed reviews are second to none. iPhone 12 Pro Max reviews went live this morning, and Mann&#39;s in-depth camera test is also now available.\rMann&#39;s review a must-read review for anyone who is interested in the iPhone 12 Pro Max for its camera, because this is the first year in some time that Apple...\n Apple&#39;s virtual &#34;One More Thing&#34; event kicks off today at 10:00 a.m. Pacific Time, with Apple expected to debut its first Mac models based on its own Apple Silicon chips. Rumors have indicated that the 13-inch MacBook Air and 13-inch MacBook Pro will be the first models to make the transition, while the 16-inch MacBook Pro is a possibility.\rIt&#39;s not clear whether we&#39;ll see any other...\n Apple today held a third fall event, this time focused on Macs. Apple announced new MacBook Air, MacBook Pro, and Mac mini models, all of which are equipped with the first Apple Silicon chip, the M1.\rSubscribe to the MacRumors YouTube channel for more videos. It took Apple a little bit under an hour to introduce all of the new devices during the &#34;One More Thing&#34; event, but we&#39;ve recapped all...\n Apple today hosted a virtual event to introduce its first three Macs with its custom-designed M1 chip, promising up to 3.5x faster CPU performance, up to 6x faster graphics, up to 15x faster machine learning capabilities, and up to 2x as long battery life.\rHumorously, the event ended with a brief appearance from John Hodgman, known as the PC guy in Apple&#39;s iconic &#34;Get a Mac&#34; ads from...\n The newly announced MacBook Air and MacBook Pro models that Apple announced today are equipped with the same 8-core M1 chip that also offers an integrated GPU, with Apple offering no CPU upgrades. There is, however, a GPU upgrade available for the MacBook Air. By default, the MacBook Air ships with an M1 chip with a 7-core GPU, while the MacBook Pro has the same M1 chip with an 8-core GPU.\r...\n Apple today introduced a new MacBook Air as its first Mac with a custom Apple Silicon processor known as the M1 chip. The new MacBook Air is up to 3.5x faster than the previous-generation MacBook Air, with up to 5x faster graphics performance.\rKey features of the new MacBook Air:Apple-designed M1 chip with 8‑core CPU and 8‑core GPU\rA completely silent, fanless design\rUp to 3.5x faster CPU, ...\n Apple will adopt OLED displays with low-power LPTO backplane technology for at least two iPhone models in 2021, according to Korean website The Elec.\rFrom the report:\rLG Display will expand the production rate of its organic light emitting diode (OLED) panel factory lines dedicated to Apple, TheElec has learned.\rLG Display is planning to put in low-temperature polycrystalline oxide...\n Rumors have suggested Apple&#39;s upcoming AirTags Bluetooth item trackers will come with various accessories to allow them to be attached to items, and now an alleged AirTag keychain has surfaced on Twitter.\rLeaker Fudge (@choco_bit) shared what might be an AirTag carrying accessory in a Saddle Brown color. A patent for an &#39;AirTag&#39; accessory As Fudge points out, the design of the ring is...\n Apple&#39;s transition away from Intel processors in Macs is officially underway with this week&#39;s introduction of new 13-inch MacBook Pro, MacBook Air, and Mac mini models with Apple&#39;s custom-designed M1 chip, and these three systems are just the beginning.\rFollowing its virtual event on Tuesday, Apple reiterated that the transition to Apple Silicon will take about two years to be completed....\n Apple&#39;s embargo has lifted on reviews for the iPhone 12 mini and iPhone 12 Pro Max ahead of the devices launching on Friday. In addition to our more detailed review roundups, we&#39;ve gathered a handful of unboxing videos and reviews of the devices below. There are also unboxing videos for Apple&#39;s upcoming MagSafe Duo Charger and Leather Sleeve accessories.\rImage: Andru Edwards The first thing...", "posttime": "2020-11-12 10:25:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "macrumors,苹果", "title": "MacRumors", "title_en": "MacRumors", "transed": 1, "url": "https://www.macrumors.com/2020/11/11/m1-macbook-air-first-benchmark/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["macrumors", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "a6d5c2227b178abe27d895a449d823f2.jpg", "infoid": 1034704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司昨天有一件大事。他们开始转向自己的处理器，推出了三款新的Mac，并宣布即将发布Big Sur。(好的，我们马上就会准备好Mac Mini。我们昨天订购了600多台。你可以报名成为第一批获得签证的人之一。)。\n在我们继续之前，请注意：在我布莱恩·斯塔基(Brian Stucki)的意见下提交这篇帖子。我不代表MacStadium的法律部门、MacStadium未来服务或苹果的法律团队发言。我从来不为苹果公司的法律辩护。嗨，朋友们。\n所有这些都是大新闻，但对我个人来说，还有一些更重大的消息。苹果更新了Big Sur的MacOS软件许可协议。这种情况并不经常发生。它从15个部分变成了16个部分。我记得的上一个重大变化是在2012年，当时他们确认，你可以购买Mac OS X升级版，并将其安装在你拥有的所有Mac电脑上。(是的，我们过去是为操作系统更新付费的。)。\n比简单的协议变更更重要的是，整个章节如此直接地指向了我在工作中深切关心的事情。\n到目前为止，我已经在数据中心与Mac电脑合作了16年。我读过了很多关于Mac mini/Xserve/Mac Pro已经死了的评论，还有为什么你想让MacOS出现在数据中心里呢？我的苹果客户代表非常热切地想把我介绍给他们的大客户，结果却被苹果系统工程师斥为灰色地带。好吧，租赁许可开发者服务的这一新部分感觉就像是在大力拍拍我的背，我为我在苹果的所有朋友们感到高兴，他们看到了这一需求，并一直在推动这一更新。\nMacOS托管现在已经被批准，并以一种非常苹果的方式以简单明了的方式写成。难以置信!。这是对开发商需求的认可，也是对未来巨大增长的市场的认可。这将显著提高所有苹果平台的软件质量。\n苹果运行的软件和硬件必须全部租赁给个人或组织。在此之前，我们在MacStadium和Macminicolo一直都是这样做的。然而，其他来来去去的公司就不是这样了。\n其他托管公司将尝试拆分Mac电脑，同时向许多客户提供规格较低的虚拟MacOS机器。这通常是你在Windows或Linux主机公司得到的，但在MacOS上是不允许的。这不仅会降低苹果想要的性能体验，而且要记住，苹果主要是一家硬件公司，这是明智之举。他们想卖Mac电脑。一台机器只有一个客户。\n租赁期必须至少是连续二十四个小时。我无法告诉你写下来有多好。我们总是谨慎行事，每隔一个月举办一次。顾客经常要求按小时收费--亚马逊就是这么做的--但我们从来不觉得这是对的。(顺便说一句，它通常也更贵。享受统一费率生活。)。我很高兴从苹果那里得到了一个绝对的指导方针，所以我们知道怎么做才是正确的。\n客户，也就是苹果所称的承租人，需要审查并接受所有已安装软件的软件协议。这包括Xcode和任何其他苹果或第三方软件。这一直是正确的做法。在Mac上预装你需要的所有开发工具是很方便的。Xcode并不是世界上下载速度最快的。但是，客户应该知道他们的系统上正在运行什么，以及他们应该保留哪些参数。\n所有这些只能提供给获得许可的开发者服务。这被定义为持续集成服务，包括但不限于软件开发、从源代码构建软件、软件开发过程中的自动化测试以及运行必要的开发者工具来支持这些活动。(我仍然不敢相信这一切都被如此清晰地表述出来。)。我无法告诉你知道这件事有多棒。)。\n开发者可以在虚拟操作系统环境中安装、使用和运行苹果软件的其他副本或实例。我们提供的ORKA完全按照开发者喜欢的方式简化了这一过程。(阅读：使用Docker和Kubernetes快速、轻松和自动化。)。\n出租方(又名MacStadium)负责确保客户遵守所有这些要求，并为其服务。有些人可能会认为这是一种负担，但我认为这是一个巨大的好处。我们在安全性、证书、协议和人员方面投入了大量资金，以确保这一点能够正确完成。我们与主要的云计算公司不相上下，甚至领先。\n世界上最大和最具安全意识的公司可以走进我们的大门，知道他们正在与一家做得对的托管公司合作，并能够信守诺言。这是一个漫长而昂贵的过程，但财富100强公司几年前认为不可能外包他们的MacOS需求，现在却拿着空白支票和短时间。他们需要知道苹果对这种设置没有意见，现在所有人都清楚了。\n最后，所有这一切都要与苹果和他们令人难以置信的苹果开发者关系团队协调完成。我爱死它了。多年来，我一直担心这个领域的坏演员会把它推到一个地步，让苹果把整个事情都吹走。相反，苹果希望与那些做得对的公司合作。(嗨！)。任何对苹果软件感兴趣的人在租赁或转租苹果软件之前必须事先通知苹果公司。\n如果不清楚的话，所有这一切对我来说都是令人难以置信的兴奋。他们本可以把这一区命名为我深爱的布莱恩，这一点也不会让人觉得格格不入。不用谢。\n如果您运行的是Big Sur，您可以随时阅读“关于这个Mac-&&gt;支持”中的许可协议。苹果可能也会把它加到这个页面上。如果你想聊聊这件事，请在推特上发邮件到@brianstucki来找我。\n有关MacStadium将如何提供服务和产品的最新消息，请在Twitter上关注MacStadium。", "note_en": "Apple had a  big event yesterday. They started the process of moving to their own processors, introduced three new Macs, and announced the imminent release of  Big Sur. (Yes, we’ll have Mac minis available right away. We ordered 600+ units yesterday. You can  sign up to be among the first to get one.)\n A note before we carry on: File this post under &#34;opinion&#34; from me,   Brian Stucki .  I don’t speak for MacStadium&#39;s legal department, MacStadium future services, or Apple&#39;s legal team. I never speak for Apple legal. Hi, friends.\n All of this is big news, but for me personally, there was some even more massive news. Apple has updated the macOS software license agreement for Big Sur. This doesn’t happen very often. It went from 15 sections to 16 sections. The last significant change I can remember was in 2012 when they confirmed that you could buy a Mac OS X upgrade and install it on all the Macs you own. (Yes, we used to pay for OS updates.)\n More significant than a simple agreement change is that the whole section is so directly pointed at what I care deeply about with my work.\n I have been working with Macs in data centers for sixteen years now. I’ve pushed through many of the &#34;Mac mini/Xserve/Mac Pro is dead&#34; comments and &#34;why would you want macOS in a data center&#34; insults. I’ve had Apple account reps very eager to introduce me to their large clients only to have Apple system engineers shoot down the whole idea as a &#34;gray area.&#34; Well, this new section of &#34;Leasing for Permitted Developer Services&#34; feels like a massive pat on the back and I’m so happy for all my friends at Apple who saw the need and have been pushing for this update.\n macOS hosting is now approved and written out in plain terms in a very Apple way. Incredible! It is a recognition of a need for developers and a market that has huge growth ahead. This will significantly improve software quality for all of the Apple platforms.\n   Apple software and the hardware on which it runs must be leased &#34;in its entirety to an individual or organization.&#34; We have always done this at MacStadium and at Macminicolo before that. However, this is not the case with other companies that come and go.\n Other hosting companies will try to slice up Macs, offering virtual macOS machines with lower specs to many customers at once. This is often what you get with Windows or Linux hosting companies but it’s just not allowed with macOS. Not only does this take away from the performance experience Apple wants, but it is wise to remember that Apple is primarily a hardware company. They want to sell Macs. One customer to one machine.\n  A &#34;lease period must be for a minimum period of twenty-four (24) consecutive hours.&#34; I can’t tell you how good it is to have this in writing. We have always landed on the side of caution by making it a one-month interval for hosting. Customers often ask for hourly rates - &#34;the way Amazon does it&#34; - but that never felt right to us. (By the way, it’s often more expensive as well. Enjoy the flat rate life.) I’m happy to have an absolute guideline from Apple, so we know how to do it right.\n  Customers, or &#34;lessees&#34; as Apple refers to them, need to review and accept software agreements for all installed software. This includes Xcode and any other Apple or third-party software. This has always been the right thing to do. It’s convenient to have a Mac delivered with all the developer tools that you’d need pre-installed. Xcode isn’t exactly the fastest download in the world. However, customers deserve to know what is running on their systems and what parameters they are expected to keep.\n  All of this can only be offered for &#34;Permitted Developer services.&#34; This is defined as &#34;continuous integration services, including but not limited to software development, building software from source, automated testing during software development, and running necessary developer tools to support such activities.&#34; (I still can’t believe this is all so clearly spelled out. I can’t tell you how great this is to know.)\n  The developers &#34;may install, use, and run additional copies or instances of the Apple Software within virtual operating system environments.&#34; We offer  Orka built to streamline precisely this process in exactly the way developers prefer it. (Read: quick, easy, and automated with Docker and Kubernetes.)\n  The Lessor (aka MacStadium) is responsible for ensuring all of these requirements are complied with, by, and for customers. Some might see this as a burden, but I see this as a huge benefit. We have invested heavily in  security, certificates, protocols, and people to be sure this can be done right. We’re on par with or ahead of the major cloud players.\n The biggest and most security-aware companies in the world can walk in our door and know that they are working with a hosting company that does it right and can stand by it. This has been a long and expensive process, but Fortune 100 companies that didn’t think it was possible to outsource their macOS needs a few years ago are now coming with blank checks and short timelines. They need to know that Apple is all right with this setup, and now it’s crystal clear for all.\n  And finally, all of this is to be done in coordination with Apple and their incredible Apple Developer Relations team. I love it. I’ve worried for years that the bad actors in this space will push it to a point where Apple blows the whole thing away. Instead, Apple wants to work with those that are doing it right. (Hi!) Anyone interested &#34;must provide Apple with advance notice before leasing or subleasing the Apple Software.&#34;\n  In case it’s not clear, all of this is incredibly exciting for me. They could have named this section &#34;To my Beloved Brian&#34; and that wouldn’t have felt out of place at all. Not at all.\n If you’re running Big Sur, you can read the license agreement in “About this Mac -&gt; Support” anytime. Apple will probably add it to  this page as well. If you want to chat about any of this, find me on Twitter at  @brianstucki.\n For updates on how MacStadium will go forward with services and offerings,  follow MacStadium on Twitter.", "posttime": "2020-11-12 10:03:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "博客,macstadium,苹果", "title": "MacStadium博客", "title_en": "MacStadium Blog", "transed": 1, "url": "https://blog.macstadium.com/blog/developers-big-sur-and-vindication", "via": "", "real_tags": ["博客", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因此，您希望xcreensaver调用解锁对话框程序并等待响应。解锁器将使用一个图形用户界面工具包，并将与各种安全库相关联。也许它的工作方式是，根据输入的密码是否正确，它将在标准输出上打印&#34；yes&34；或&#34；no&34；。如果它崩溃了，这个守护程序就会认为这意味着不会。事实上，这种方法实际上会减少守护进程本身中的库(从而减少代码行)的数量，因为守护进程不需要链接到PAM和Crypto之类的东西。这是一件好事。因此，到目前为止，这听起来并不难，只是xcreensaver守护程序抓取了键盘。按住抓取非常重要，因为否则击键往往会穿过xcreensaver窗口，到达下面随机桌面窗口。这就引出了这样一个问题：按键到底是如何到达解锁对话框的？这是一个很难回答的问题。理解如何正确操作需要大量关于X的知识(我有)，但可能还需要大量关于外语输入法、屏幕阅读器和其他辅助工具的知识(我没有)。调任抢夺？由于xcreensaver使用覆盖-重定向窗口(即不在窗口管理器控制下的窗口)来消隐屏幕，因此它有必要抓取键盘和鼠标。否则，窗口管理器将继续向上次获得焦点的任何窗口发送事件。这显然是一件坏事，因为这会导致人们在IRC频道上输入密码。在当前系统中，屏幕消隐窗口和解锁对话框的创建者都是同一个进程，这不是问题：该进程可以获得它想要的所有事件。但当它们处于不同的进程中时，我们需要一种方法让键盘和鼠标事件到达驱动解锁对话框的进程。因此，您想要将抓取从xcreensaver守护程序转移到解锁对话框中，然后再将它们转移回来。不幸的是，没有办法在X中自动转移抓取。你能做的最好的事情是：这里有两个争用条件：在步骤3和4之间，以及在步骤6和7之间。在这些时期，键盘和鼠标(短暂地)根本不被抓取。那里可能会发生两件坏事。首先，键盘或鼠标可能会被某个第三个程序抓取(例如，桌面上其他东西的弹出窗口)。其次，用户可能在错误的时间键入击键。然后，该击键既不会进入xcreensaver，也不会进入解锁对话框，而是会进入桌面上的其他窗口。\n人工合成项目？另一种可能是xcreensaver守护进程保留它的抓取，这意味着所有键盘和鼠标事件都将交给它；但随后它会使用XSendEvent()在锁定对话框窗口上生成合成事件。也就是说，xcreensaver守护进程将读取一个KeyPress，然后在锁定对话框窗口中模拟与该KeyPress完全相同的副本。这种方法有几个潜在的问题：应用程序有可能区分真实事件和合成事件，作为一种安全措施，工具包忽略合成事件并不少见。我不知道GTK是否做到了这一点(尽管我想，这很容易找到)。\n我不知道当前流行的输入法和辅助工具是如何工作的；如果它们嵌入到解锁对话框本身，这不会成为问题。然而，如果它们通过弹出第二个窗口(例如，在您键入的一侧的另一个窗口，或者屏幕上的键盘或其他东西)来工作，那么我们就有问题要找出将事件发送到哪个窗口。请记住，当屏幕被锁定时，窗口管理器根本不参与其中：它看不到这些窗口中的任何一个。这些窗口没有标题栏。你不能点击并拖拽它们。您不能通过单击来更改焦点。你最喜欢的窗口管理按键不起作用。如果需要对任意窗口进行完全的窗口管理才能使辅助工具发挥作用，那么，这就是一个大问题……。\n总而言之：让xcreensaver解锁对话框安全地使用工具包是很困难的，但如果是一个有知识的人来做这项工作是可能的。如果这项工作做得很好(我的意思是：有清晰的注释和文档，并明显注意到安全方面的影响)，我很乐意将这些更改合并到xcreensaver发行版中。让解锁对话框也能够利用辅助工具可能要困难得多。我不知道有多难，因为我不是可访问性专家。但任何想要实现这一点的人最好既是可访问性方面的专家，又精通", "note_en": "So, you want xscreensaver to invoke the &#34;unlock dialog&#34; program and wait for a response. The unlocker would use a GUI toolkit, and would be linked against the various security libraries. Perhaps the way it would work is that it would print either  &#34;yes&#34; or  &#34;no&#34; on stdout, depending on whether a password was correctly entered. Were it to crash, the daemon would take that that to mean  &#34;no&#34;...  In fact, this approach would actually  reduce the number of libraries (and thus, lines of code) in the daemon itself, since the daemon would not need to link against things like PAM and crypto. That&#39;s a good thing.  So that doesn&#39;t sound hard so far, except that the xscreensaver daemon has the keyboard grabbed. It&#39;s pretty important that it hold that grab, because otherwise keystrokes tend to go &#34;through&#34; the xscreensaver window and reach random desktop windows underneath.  This begs the question of, how do the keystrokes get to the unlock dialog at all? That&#39;s a difficult question. Understanding how to do that right requires a lot of knowledge about X (which I have) but also probably a lot of knowledge about foreign-language input methods and screen readers and other accessibility-ware (which I do not have.)  Transfer grabs?    Since xscreensaver blanks the screen using an override-redirect window (that is, a window that is not under window manager control) it is necessary for it to grab the keyboard and mouse. Without that, the window manager would continue to send events to whatever window last had focus. That&#39;s obviously a bad thing, as it results in people typing their passwords into IRC channels.  In the current system, where the same process is the creator of both the screen-blanking window and the unlock dialog, this is not a problem: that process gets all the events it wants. But when they are in different processes, we need a way for the keyboard and mouse events to get to the process driving the unlock dialog. So you&#39;d like to transfer the grabs from the xscreensaver daemon to the unlock dialog, and then transfer them back afterward. Unfortunately, there is no way to transfer grabs atomically in X. The best you could do is this:  There are two race conditions here: between steps 3 and 4, and between steps 6 and 7. In those periods the keyboard and mouse are (briefly) not grabbed at all. There are two bad things that could happen there. First, the keyboard or mouse might become grabbed by some third program (a popup window from something else on the desktop, for example.) Or second, the user might type a keystroke at just the wrong time. That keystroke would then go to neither xscreensaver nor the unlock dialog, but instead to some other window on the desktop.\n  Synthetic events?    Another possibility is for the xscreensaver daemon to keep its grabs, meaning that all keyboard and mouse events would go to it; but then for it to use XSendEvent() to generate synthetic events on the lock dialog window. That is, the xscreensaver daemon would read a KeyPress, and then would simulate an exact duplicate of that KeyPress on the lock dialog window.  There are a few potential problems with this approach:  It&#39;s possible for applications to tell &#34;real&#34; and &#34;synthetic&#34; events apart, and it&#39;s not unusual for toolkits to ignore synthetic events, as a security measure. I don&#39;t know whether GTK does this or not (though it&#39;s easy to find out, I guess.)\n I don&#39;t know how the currently-popular input methods and accessibility tools work; if they are embedded in the unlock dialog itself, this won&#39;t be a problem. If, however, they work by popping up a second window (e.g., another window off to the side that you type in to, or an on-screen keyboard or something) then we have the problem of figuring out which window to send the events to.  Remember, when the screen is locked, the window manager is not involved at all: it doesn&#39;t see any of these windows. The windows do not have title bars. You can&#39;t click and drag them around. You can&#39;t click to change focus. Your favorite window-management keystrokes don&#39;t work.  If it&#39;s necessary to have full window management of arbitrary windows in order for the accessibility tools to work, well, that&#39;s a big problem...\n  In summary:   Making the xscreensaver unlock dialog securely use a toolkit is difficult, but possible, were a knowledgeable person to do the work. If the work were done well (by which I mean: clearly commented and documented, and with obvious attention paid to the security implications) I would be happy to incorporate those changes into the xscreensaver distribution.  Making the unlock dialog also be able to take advantage of accessibility tools is probably a  lot harder. I don&#39;t know how much harder, because I&#39;m not an accessibility expert. But anyone intending to implement that had better be both an expert on accessibility, and well versed in secure X11 programming, because the security implications of getting it wrong would be dire indeed.\n  Epilogue, 2016: I told you so.   I wrote this document in 2004, explaining the approach to privilege separation that xscreensaver has taken since 1991. Of course,   the people doing needless rewrites of xscreensaver have ignored it for that whole time, and have then gone on to introduce  exactly the bug that I described in this document as a hypothetical strawman! And -- this would be hilarious if it weren&#39;t so sad -- have introduced it  multiple times. As I   said in 2015:  If you are not running xscreensaver on Linux, then it is safe to assume that your screen does not lock. Once is happenstance. Twice is coincidence. Three times is enemy action. Four times is Official GNOME Policy.\n  Update, 2019: Almost two decades ago, the engineers at Sun read all of the above, and then said to themselves, &#34;Well that&#39;s all very interesting, but we really,  really want to link the entire GNOME library stack into xscreensaver, so we&#39;re gonna go ahead and do that anyway.&#34; Surprise, the thing that I said would happen happened, and in 2019 a   privilege escalation was discovered in their forked version of xscreensaver.  Also I remind you that   the Turing Police say you have more than two problems, and   we live in a magical future where  &#34;strings&#34; is exploitable.", "posttime": "2020-11-12 09:59:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工具包,toolkit,xcreensaver", "title": "XScreenSaver：工具包对话框上", "title_en": "XScreenSaver: On Toolkit Dialogs", "transed": 1, "url": "https://www.jwz.org/xscreensaver/toolkits.html", "via": "", "real_tags": ["工具包", "toolkit"]}]