[{"category": "", "categoryclass": "", "imagename": "bd0b674e362ba349097d4be826482c64.png", "infoid": 1072456, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2010年以来每日Duckduckgo搜索流量。", "note_en": "Daily DuckDuckGo search traffic since 2010.", "posttime": "2022-01-09 21:56:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "duckduckgo,搜索", "title": "Duckduckgo交通", "title_en": "DuckDuckGo Traffic", "transed": 1, "url": "https://duckduckgo.com/traffic", "via": "", "real_tags": ["搜索"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072455, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "chocosetup  - 立即安装多个巧克力应用程序", "note_en": "Chocosetup - Install multiple Chocolatey apps at once", "posttime": "2022-01-09 21:56:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chocosetup,巧克力", "title": "chocosetup  - 使用巧克力的ninite.com替代品", "title_en": "Chocosetup – A ninite.com alternative that uses Chocolatey", "transed": 1, "url": "https://chocosetup.github.io/", "via": "", "real_tags": ["巧克力"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072454, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的超市品种意味着队列，结账和入店行窃的日子。但是，当没有交易购物成为常量时，我​​们还有什么失败？\n超市表示，随着令人沮丧的是，令人沮丧的人正在为一个更好的，无忧无虑的购物体验而哭泣，如果这些试验商品成功，他们将推出全国各地的技术。\n如果AI接管，那么那些没有访问最新智能手机的人会被禁止大型超市融化锅？孤独的老年人会失去与收银员友好的聊天，这可能是他们当天唯一的谈话吗？\n比赛正在开启。 Aldi正准备在伦敦南部格林威治打开类似的智能商店。 Morrisons正在测试自己对技术的愿景，代号为Project Sarah，在其布拉德福德总部，并计划在繁忙的地方迅速推出数十家小店。\n在拟合超市，具有新技术的成本约为1平方公里的费用，该公司安装它的公司声称它将在18个月内自行支付，因为它希望消除盗窃。 “通过这项技术，你无法真正偷，我们知道谁在商店里，我们知道所有产品的所在，”Yair Holtzer说，他们帮助开发了一个拟合Tesco商店的以色列公司的Trigo技术，并与世界各地的其他主要零售商合作。\n包括Tesco在内的超市还开始安装屏幕上的自我结账，显示扫描他们的物品的Livestream。 “他们提醒你，你采取的每一个动作正在拍摄，”巴姆菲尔德说。 “这就像商店说，'你确定要偷了吗？”“\n但是，我们只是不知道这项技术的良好将减少盗窃。“\n“去超市是我们所做的最普通的最平凡之一。在这种空间中的监督和数据在正常化中收集的事实深刻令人不安，“人权团体自由的政策和竞选官员表示深感令人不安。” “购物应该是伟大的左左街，锋利的西装的商人是肩负着养老金领取者的福利。每个人都必须买食物，但是通过这项技术只有那些带有智能手机和信用卡的技术将能够在那里购物。“", "note_en": "A new breed of supermarkets means the days of queues, checkouts and shoplifting are numbered. But what else will we lose when no-transaction shopping becomes the norm?\n   W elcome to the supermarkets of the future. They may look and feel like the supermarkets we are all used to – and stock the same bread, butter and bananas – but these shops are now fitted out with more than £1m of the latest technology that their bosses promise will put an end to our biggest frustration (queueing) and our most persistent crime (shoplifting).\n Jill French, a legal secretary in her 30s, wearing a sharp navy suit and matching beret, has just left a Tesco Express on London’s Holborn Viaduct empty-handed. It’s coming up to 6.30pm on a Thursday and, like dozens of others, French has popped in for a few essentials on her way home. “I just went in to grab pasta, milk and some broccoli,” she says. “But there was such a queue I got frustrated and walked out.”\n  An eight-minute walk away is another near-identical Tesco Express where there are no queues. This shop is the cleverest of all the 2,700 Tescos in the UK.\n There are no checkouts (self-scanning or traditional), no checkout assistants, and – in theory – no chance of shoplifting. This Tesco, called GetGo, is filled with thousands of cameras, weighted shelves and artificial-intelligence technology that watches your every move, figures out what you’ve bought and bills you directly as you walk out.\n It’s not just Tesco that is trialling these new “smart” supermarkets. Retailers across the UK, and the rest of the world, are racing to deploy rival technology. The model for all of them is similar.\n First, you must download an app, register a credit card and scan a QR code on your phone to enter through train station-style gates. Barriers prevent those without the app from entering the shop. Once inside, the technology follows you around the store recording every item you pick up (and put back). When you’re done you just walk out and after a few minutes your phone alerts you as to how much you’ve spent.\n The supermarkets say time-pressed, easily frustrated people are crying out for a better, hassle-free shopping experience, and if these trial stores are successful they will roll out the technology across the country.\n It’s almost 74 years since the first British supermarket opened in Manor Park, east London. At this branch of the London Cooperative Society, customers could walk round the store and take items off the shelves by themselves. It was revolutionary. In the years before, shoppers had to present the shopkeeper at a counter with a list of items that their assistants would fetch. Choosing your own tomatoes was banned, and touching the products could lead to prosecution.\n As with many innovations, the “self-service” supermarket concept was exported from the US, where retail pioneer  Clarence Saunders opened Piggly Wiggly in Memphis, Tennessee, in 1916. If you’re wondering about the name, Saunders said it was named “so people will ask that very question”.\n Today all shops, big or small, follow a similar concept. But our retail needs are evolving.\n The days of “the big weekly shop” are over, with Britons going to a supermarket at least twice a week, according to YouGov, while a growing minority admit to popping in more than twice a day.\n The new generation of AI stores is meant to respond to these changes, but are there dangers in tinkering with one of the last remaining social levellers?\n Supermarkets are more than just places to buy food; they provide a space for a daily mixing of people of different classes and backgrounds in our increasingly siloed world.\n  If AI takes over, will those without access to the latest smartphone be barred from the great supermarket melting pot? Will lonely older people lose their friendly chat with the cashier, which could be their only conversation of the day?\n Research backs up the retailers’ hunch about our frustrations with shopping. A recent survey by packaging company DS Smith found that more than a third of 2,000 people polled would walk out of the store rather than wait five minutes in a checkout queue, and 46% said they were so irritated by queuing that they would consider not coming back to the shop again.\n Laura Saunter, a senior retail analyst at the consumer trends analytic firm WGSN, says supermarkets have spent years trying to bust queues because they are the customers’ “number one pain point”.\n Many of us are now so impatient that waiting a few minutes for a checkout assistant to become free can feel like an unacceptable hassle in a world where technology dominates and instant gratification is expected.\n  “These stores are positioned at millennial parents who are busy; they want to be in and out, they don’t want to waste their time,” Saunter says. And younger people, generation Z, just don’t want to interact with store staff.”\n Tesco has already tested the technology at its employee-only supermarket in Welwyn Garden City for more than a year. Amazon has 15 stores that use similar technology, including one almost directly across the street from the Tesco on Holborn.\n The supermarkets’ analytics teams seem to have a thing for the central London neighbourhood with Sainsbury’s also opening a trial smart supermarket on the same street in late November.\n The race is on. Aldi is preparing to open a similar smart store in Greenwich, south London. Morrisons is testing its own vision of the technology, codenamed Project Sarah, at its Bradford headquarters, and plans to quickly roll out dozens of small stores at busy locations.\n Another two of the Amazon stores opened in Chingford and East Sheen shortly before Christmas. A recent leak of internal documents reveals that these are just baby steps on to the UK high street for Amazon, which was founded by the world’s second-richest person, Jeff Bezos, in 1995 and is now the second-largest retailer on the planet, collecting sales of more than $1.2bn (£900m) every day.\n The internet giant is planning to open about 60 more UK stores next year, followed by 100 in 2023 and another 100 in 2024, according to a report by the blog  Business Insider. Amazon has long been accused of attempting to kill off the high street by encouraging us all to buy almost everything online. But could its desire to now open bricks-and-mortar stores revitalise our urban centres?\n All of the supermarkets say the technology is designed to make shoppers’ lives easier, but experts say the real desire is to improve their bottom line as they can cut back on the wage bill and save some of the £5.5bn lost every year to shoplifting and employee theft.\n The most frequently stolen items from UK stores include spirits, sirloin steaks, razor blades, cosmetics, infant formula and batteries, according to the Centre for Retail Research (CRR). Cheese also makes the top 10, with posh bries and aged camembert often stolen to order by restaurants.\n Retailers in Scandinavia are ahead of the UK, opening shops without checkout assistants, security guards or any other members of staff present. Instead, customers use their phones to open the doors of shipping container-like stores, shop completely alone and walk out to the beep of the bill notification on their phone.\n In less than three years, Stockholm-based start-up  Lifvs has opened 29 of the tiny stores in remote villages across Sweden, which in some instances had lost their last corner shops decades ago. Giulia Ray, a beekeeper in the village of Veckholm, 60 miles east of Stockholm, said the opening of the Lifvs “shopping box” added to rather than took away from community spirit. “You go inside and get something, and maybe someone else is here and you can have a chat,” she says as she picks up essentials and restocks the shelves with her own honey at the same time.\n While fitting out supermarkets with the new technology costs about £1m-per-store, the firms installing it claim it will pay for itself within 18 months because it will hopefully eliminate theft. “With this technology, you can’t really steal, we know who is in the store and we know where all the products are,” says Yair Holtzer, who helped develop the technology for Trigo, an Israeli firm that fitted out the Tesco store, and is working with other major retailers across the world.\n “With these systems it cuts out not just shoplifting but also mistakes, errors and employee fraud,” he says. “These are problems that all retailers have, and could be solved.”\n  Supermarkets lose about 1.4% of their combined £200bn annual revenue to “shrinkage” – industry code for customer or employee theft and admin errors.\n Professor Joshua Bamfield, director of the CRR, says supermarkets thought they had found a solution to queue frustration and high wage bills with the introduction of self-scanning machines that were rolled out in the early 2000s and are now ubiquitous. “But it is very easy for customers to skip a few items through without scanning the barcode,” he says. “It’s quite easy to get away with things that you wouldn’t be able to at a staffed till.”\n Probe a little, and even the most upstanding friends and acquaintances have a shoplifting tale – from the south London primary school teacher who makes a point of stealing one item in every shop to the writer who was tapped on the shoulder by a security guard who’d seen her tap the screen for one banana when she bagged two.\n A study by the University of Leicester’s criminology department found that theft from stores with self-checkout machines was between 33 and 147% higher than those with only traditional checkouts. The researchers also found that the number of self-checkout machines available to use was correlated to the level of theft.\n In response, shops have cut down on the number of self-checkout machines available per staff member which, Bamfield says, explains why supermarkets often annoyingly place out-of-order stickers on working terminals.\n Supermarkets, including Tesco, have also begun installing screens on self-checkouts showing a livestream of customers scanning their items. “They’re reminding you that every action you take is being filmed,” says Bamfield. “It’s like the shop saying, ‘Are you sure you want to steal?’”\n It’s not just customers who steal. Bamfield’s research shows that about £1.4bn a year is lost to shoplifting, followed closely by £1.3bn in employee theft. The new technology is designed to tackle that, too.\n “It might not seem so obvious, but a big proportion of theft is due to staff on the take, and by removing staff from tills this technology will eliminate that loss,” he says.\n Bamfield believes the most common technique staff use to steal is referred to in the industry as “the switcheroo”.\n “An uncle will say to his cashier nephew, ‘I’m coming into the store tomorrow afternoon and I’d like a discount,’” he explains. “When the uncle comes to the checkout, the nephew will have a barcode sticker for a watermelon or orange or something on his palm and while pretending to scan the uncle’s bottles of scotch whisky the nephew will scan the watermelon sticker.”\n Bamfield, who has spent a career working with retailers, and has written a book on shoplifting (Waterstones describes his 2012 title  Shopping and Crime as “an interdisciplinary study of retail crime as a cultural phenomenon”), isn’t sure the new checkout-free supermarkets will succeed in eliminating shoplifting altogether.\n  “I was at a retail conference in Norwich, and one of the speakers flashed up a picture of one of these new stores and said, ‘Well, that is the end of shoplifting.’\n But, we just don’t know yet how good this technology will be at reducing theft.”\n Shoplifting, which was first documented in the 16th century, began soaring in 2014 after the law was changed to define “low-value shoplifting” as a summary offence. This means that police forces can decide not to investigate thefts from shops of goods worth less than £200.\n Anyone caught stealing less than £200-worth of goods can still be arrested and face prosecution, but the 2014 antisocial behaviour, crime and policing act allows them to plead guilty by post. Police in England and Wales recorded 374,000 incidents of shoplifting in 2019 (the latest figures available), up from 317,000 in 2013, before the law changed.\n Retailers have responded with more technology. Sainsbury’s is experimenting with machine-learning “concealment detector” technology to monitor and record when shoppers place an item in their pocket and alert in-store security guards in real time.\n Sainsbury’s says its 30-store trial partnership with UK artificial intelligence startup ThirdEye has helped cut theft from its spirits aisles by 47%. Razwan Ghafoor, co-founder and chief executive of ThirdEye, says the technology helps make CCTV smarter.\n “You can have hundreds of cameras in a store, but which feed should you be watching?” Ghafoor says on the phone from Heathrow as he boards a plane to New York the day after selling ThirdEye to larger rival Standard AI for millions of pounds. “We’ve taught the system to learn when someone picks up an item and pockets it. The system will flag it and send a four-second clip to a human to investigate. It means the security team can watch a lot less footage and concentrate on the footage they need to watch.”\n No queues, less shoplifting, lower wage bills: the benefits of this new generation of hi-tech supermarkets are clear. But campaigners are concerned they represent another step in the UK’s march towards an “everyday surveillance society”.\n “Going to the supermarket is one of the most mundane, everyday things we do. The fact that surveillance and data gathering in such a space is being normalised is deeply troubling,” says Emmanuelle Andrews, policy and campaigns officer at human rights group Liberty. “Shopping should be one of the great levellers, where the businessman in the sharp suit is shoulder-to-shoulder with the pensioner on benefits. Everyone has to buy food, but with this technology only those with a smartphone and credit cards will be able to shop there.”\n In the near term, the biggest losers from this technological revolution are likely to be Britain’s army of 270,000 checkout workers, most of whom are women. The pandemic has already hit retail workers hard, with some 190,000 jobs lost since the start of the first lockdown in March 2020. The Office for National Statistics (ONS) has identified supermarket cashier jobs as among the most at risk of being replaced by automation, with 65% of checkout-operator jobs said to be in peril.\n “The checkout-free technology is specifically designed to eliminate jobs, and save money,” says  Dr Carl Benedikt Frey, an Oxford University economist and expert on automation whose research the ONS statistics are based on. Up to 47% of all jobs could be done by machines “over the next decade or two”, he believes. Frey predicts that checkout workers are likely to be among the first to lose their jobs to the robots, alongside bar staff, farm workers and sewing machinists.\n Supermarkets have offered stable employment to generations of Britons excluded from higher-skilled roles, providing modest but reliable incomes – and the prospect of advancement – in communities blighted by manufacturing decline.\n Frey fears that a national rollout of AI stores would send the checkout worker the same way as the elevator operator, which as of today is the only one of 270 job descriptions listed in the 1950 US census to be completely eliminated by automation.\n “We think this coming change is unprecedented, but actually what is happening mirrors what we saw in the Industrial Revolution and hollowing out of middle-income jobs,” he says. “The technology is very different, but the effects on the economy are quite similar.”\n Back in that Holborn Tesco, among the familiar daily groceries, a change is coming that could herald the biggest revolution in how we shop for groceries since the opening of the first supermarket on 12 January 1948. Like their predecessors, the smart supermarkets are said to be designed to make our lives easier. But is it time to allow the shop assistant to follow the elevator operator into obsolescence, or could we all learn to wait a little longer and enjoy a friendly chat at the checkout?", "posttime": "2022-01-09 21:55:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "超市,supermarkets,技术", "title": "智能超市让我们知道的购物结束吗？", "title_en": "Do smart supermarkets herald the end of shopping as we know it?", "transed": 1, "url": "https://www.theguardian.com/business/2022/jan/09/do-smart-supermarkets-herald-the-end-of-shopping-as-we-know-it", "via": "", "real_tags": ["超市", "技术"]}, {"category": "", "categoryclass": "", "imagename": "ef6abc1be8f2f3b35838a55416b7be81.png", "infoid": 1072453, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两者都给了我一种感受空间如何工作。要清楚，没有什么特别是“分布”应用程序本身：他们只是正常的反应网站。 “分布因素”是指状态和逻辑/权限更新状态的生命：在区块链中而不是在“集中”数据库中。\n这些客户端API不使用任何东西来验证区块链状态或响应的真实性。结果甚至没有签署。\n我只是想指出这是搞笑的，我看到它被露珠被取消了。我的信念是，形象变化往往与骗局有关，所以Opensea认为它是一个骗局。\n您选择使用OpenSea获得Opensea人员将为您支付的价值。那个数据不在链上，因为这不是市场的工作原理，尽管每个市场都使用相同的市场订单上的链条，但它会很酷。\n这听起来像是你描述了第2层解决方案，谢天opensea支持多边形，这使得它更便宜，更快，更容易使用。我亲自希望ZK-rollups真正使它更便宜，更容易使用。\n每个用户都必须支付一切费用。我实际上自己正在努力，我认为铆接和使用赌注的收益来支付非Web3用户的工作。我有兴趣听到别人如何让Web2用户在没有付费的情况下使用Web3。 DM ME！", "note_en": "Both gave me a feeling for how the space works. To be clear, there is nothing particularly “distributed” about the apps themselves: they’re just normal react websites. The “distributedness” refers to where the state and the logic/permissions for updating the state lives: on the blockchain instead of in a “centralized” database.\n Just to clarify, this is what the author wanted to do. You can create distributed apps easily using  Fleek or by manually uploading to IPFS, Arweave or Filecoin.\n A server! But, as we know, people don’t want to run their own servers. As it happens, companies have emerged that sell API access to an ethereum node they run as a service, along with providing analytics, enhanced APIs they’ve built on top of the default ethereum APIs, and access to historical transactions. Which sounds… familiar. At this point, there are basically two companies. Almost all dApps use either Infura or Alchemy in order to interact with the blockchain. In fact, even when you connect a wallet like MetaMask to a dApp, and the dApp interacts with the blockchain via your wallet, MetaMask is just making calls to Infura!\n This is true at the moment, but there is work being done on  Light Clients which:\n The purpose of the light client protocol is to allow users in low-capacity environments (embedded smart property environments, smartphones, browser extensions, some desktops, etc) to maintain a high-security assurance about the current state of some particular part of the Ethereum state or verify the execution of a transaction.\n And also alternatives to Infura such as  Pockt Network which is a decentralised Web3 infrastructure company. Per Pockt Network’s website:\n Instead of deploying to a single service provider, paying absurd fees for random outages and leaked data, tap into Pocket’s trustless API protocol and route your requests to 1000’s of independent full nodes. Available for all major blockchain networks.\n  These client APIs are not using anything to verify blockchain state or the authenticity of responses. The results aren’t even signed.\n   Partisans of the blockchain might say that it’s okay if these types of centralized platforms emerge, because the state itself is available on the blockchain, so if these platforms misbehave clients can simply move elsewhere. However, I would suggest that this is a very simplistic view of the dynamics that make platforms what they are.I also wanted to create a more traditional NFT. Most people think of images and digital art when they think of NFTs, but NFTs generally do not store that data on-chain.\n This is true, most NFTs do not store data on-chain. But this is not always true, you can store the data on the chain. You can also use alternative layer-1s such as  Tezos,  https://www.avax.network/ which makes it much more cost efficient to store on-chain data. However, I am not a fan of this. One of the big rebuttals we don’t have an answer for is “what if we store illegal images on the chain?” currently it is too expensive to do so, but genuinely there is no work being done on this that I can see and it is a concern for everyone.\n You also have to consider sending NFTs to other people that are prohibitively expensive to sell. You can easily make an NFT that costs say, $4000 to sell (just make it contain a lot of data) and this person will be stuck with it attached to their identity forever. Opensea lets you “hide” them, but this only works on their frontend.\n Looking at many of the NFTs on popular marketplaces being sold for tens, hundreds, or millions of dollars, that URL often just points to some VPS running Apache somewhere.\n This is a lie. Most NFTs which sell for millions use IPFS, Arweave, Filecoin or others for decentralised storage of data. A lot of NFTs do use Google Drive or Imgur or whatever. However, I can promise you that one of the first things people do when making sure they are not rugged (crypto-term for scammed) is to make sure it’s not possible for the author to suddenly delete or change the image.\n So as an experiment, I made an NFT that changes based on who is looking at it, since the web server that serves the image can choose to serve different images based on the IP or User Agent of the requester.\n I just wanted to point out that this was hilarious and I saw it was taken down by Opensea. My belief is that image changing is often related to scams, so Opensea took it down thinking it was a scam.\n What I found most interesting, though, is that after OpenSea removed my NFT, it also no longer appeared in any crypto wallet on my device.A wallet like MetaMask needs to do basic things like display your balance, your recent transactions, and your NFTs, as well as more complex things like constructing transactions, interacting with smart contracts, etc. In short, MetaMask needs to interact with the blockchain, but the blockchain has been built such that clients like MetaMask can’t interact with it. So like my dApp, MetaMask accomplishes this by making API calls to three companies that have consolidated in this space.All this means that if your NFT is removed from OpenSea, it also disappears from your wallet. It doesn’t functionally matter that my NFT is indelibly on the blockchain somewhere, because the wallet (and increasingly everything else in the ecosystem) is just using the OpenSea API to display NFTs, which began returning 304 No Content for the query of NFTs owned by my address!\n This is true, wallets suck so much it’s funny. I was sent a £2k NFT the other day which I can’t sell because Opensea has glitched and my wallet won’t show me the NFT, which means I can’t send it or sell it! (they are working on this, and I have told them that relying on centralised Opensea is a very bad idea).\n Almost everyone in Web3 hates Opensea and their centralised mess. There are alternatives being worked on such as  OpenDao,  NFTX and more. The sooner Opensea dies, the better.\n I think this is a very fair comment from Moxie and we should dunk on wallets and Opensea for this mess they’ve created. However, I wanted to point out that people in Web3 don’t sit idly by and enjoy this centralised mess. We are actively building alternatives!\n Likewise, the web3 protocols are slow to evolve. When building First Derivative, it would have been great to price minting derivatives as a percentage of the underlying’s value. That data isn’t on chain, but it’s in an API that OpenSea will give you.\n This is how markets work, and why arbitrage exists. See  Flash Boys for how this works in the stock market. Your NFT is only worth what someone wants to pay. Someone on Opensea may pay 5 eth for it, but someone on Discord may pay 10 eth.\n You chose to use Opensea to get the value of what people on Opensea will pay you for. That data isn’t on chain because that’s not how markets work, although it’d be cool if every market place used the same market-order book on-chain.\n People are excited about NFT royalties for the way that can benefit creators, but royalties aren’t specified in ERC-721\n You’re right, royalties are specified in  ERC-2981. I would also like to point out that ERC-721 is not the only NFT standard, take a look at  ERC-1155 if you wanted to dive deeper :-)\n so OpenSea has its own way of configuring royalties that exists in web2 space. Iterating quickly on centralized platforms is already outpacing the distributed protocols and consolidating control into platforms.\n  “It’s early days still” is the most common refrain I see from people in the web3 space when discussing matters like these. In some ways, cryptocurrency’s failure to scale beyond relatively nascent engineering is what makes it possible to consider the days “early,” since objectively it has already been a decade or more.\n This is because it is early days, still. As you could read from my article there is so much work being done. NFTs are only 3 years old. Layer 1’s and 2’s are arguably only around a year old.\n When you think about it, OpenSea would actually be much “better” in the immediate sense if all the web3 parts were gone. It would be faster, cheaper for everyone, and easier to use.For example, to accept a bid on my NFT, I would have had to pay over $80-$150+ just in ethereum transaction fees.\n This sounds like you’re describing a  layer-2 solution, thankfully Opensea supports polygon which does make it cheaper, faster, and easier to use. I am personally hoping for  zk-rollups to really make it cheaper, easier to use.\n I will say we shouldn’t strive for “cheaper”, we should strive for “so cheap its free”. Opensea lets you mint NFTs for free using Polygon. The benefits of fully decentralised technologies without the downside of a microtransaction at every aspect of it. I talk more about this later.\n So the money draws people into OpenSea, they improve the experience by building a platform that iterates on the underlying web3 protocols in web2 space, they eventually offer the ability to “mint” NFTs through OpenSea itself instead of through your own smart contract, and eventually this all opens the door for Coinbase to offer access to the validated NFT market with their own platform via your debit card. That opens the door to Coinbase managing the tokens themselves through dark pools that Coinbase holds, which helpfully eliminates the transaction fees and makes it possible to avoid having to interact with smart contracts at all. Eventually, all the web3 parts are gone, and you have a website for buying and selling JPEGS with your debit card. The project can’t start as a web2 platform because of the market dynamics, but the same market dynamics and the fundamental forces of centralization will likely drive it to end up there.\n Moxie is right about this currently. It is harder to use true web3 stuff than it is to use a centralised platform. The user experience of Web3 is its biggest problem, and something we are all working very hard on. Things like  Argent Wallet are working hard to improve this, but we still have a long way to go because we are in the early days.\n  I think was this a fair article that accurately portrays some parts of web3 at this given moment in time. Moxie mentions:\n  Which is fair. I just thought I’d write this and explain what’s being done to fix this and go further. My personal pet hates for crypto are:\n Illegal images being sent to your wallet, forcing you to go to prison in some places.\n  Every user will have to pay for everything. I am actually working on this myself, I think staking and using the proceeds from staking to pay for non-web3 users would work. I’m interested to hear how others are letting web2 users use web3 without paying.  DM me!\n There is some genuinely cool tech being worked on here, but due to the monetrary aspect there are scams up to my eyeballs. And those scams make the whole industry look bad. I think Moxie focussed on the NFT side too much which is arguably the side with the most scams / problems. There’s still a lot of genuinely cool technology that exists  outside of NFTs.\n   You also need to realise that Web3 is world-wide, not just America or Europe. Some countries have unstable currencies and to use USD you need to pay a hefty fee. Web3 lets them have the safety of USD without this fee. Or you can use decentralised finance to invest, bank or do other things not available to you. You can earn money in pay-2-earn games, a lot more than you could with a job in some countries.\n A lot of people who criticise Web3 come from a privileged position and do not see it benefitting them. It does, however, benefit everyone else in the world.", "posttime": "2022-01-09 21:54:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "回答,impressions,opensea", "title": "回答我的第一印象3", "title_en": "In Response to My first impressions of Web3", "transed": 1, "url": "https://skerritt.blog/response-to-moxie/", "via": "", "real_tags": ["回答", "opensea"]}, {"category": "", "categoryclass": "", "imagename": "2c78658e363649cb9b032c7e00ce9414.png", "infoid": 1072452, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于我们是政府警告，关于潜在的健康危害饮食和饮酒的潜在警告，它令人耳目一新（和困惑），看到一个广泛尊重的食品作家近期，“人们不必要地害怕细菌”。\n我承认要违反自己的股票制作指导方针，虽然在几个小时内，而不是几天。当我煮一个晚餐时，我使用剩下的废料和骨头开始股票，在我清理的时候煨，然后在我上床睡觉前拿出锅。在那一点上，冷却热股有太麻烦，所以它不会在冰箱里加热邻居。相反，我覆盖了锅，在室温下留下它，早上再加热，在紧张，冷却和制冷之前，大约八个小时。我的股票也没有让我或我的家人生病。\n正如斯奈德博士所说的那样，“坐在炉子和生长细菌后两三天后，Ruhlman的库存几乎肯定有高水平的传染性梭菌细胞，或肉毒杆菌或芽孢杆菌或芽孢杆菌细胞及其毒素，或一些其组合。“\n像肉类库存一样，所有湿润的食物都易于通过生存者细菌来重新渗透。 （烘焙食品通常对细菌过于干燥;它们被模具所损坏。）这就是为什么我们应该避免在我们准备派对或假期盛宴时长时间在室温下煮熟的食物（或享受他们的懒惰 - UPS）或者野餐或为幼儿打包午餐盒，以及老人和生病的幼儿更脆弱。最好让潮湿的午餐物品寒冷或热，包围冷藏包或热水瓶。\n斯奈德博士补充说，它最安全的冷却剩菜露出并质量不比两英寸厚，因此它们很快凉爽。如果它们仍然很热，请在台面上开始冷却。当容器不再热到触摸时，将它放入冰箱中，一旦食物好冷却。", "note_en": "PEPPERED as we are by government warnings about the potential health hazards of eating and drinking just about everything, it was refreshing (and perplexing) to see a widely respected food writer assert recently that “people are unnecessarily afraid of bacteria” in the kitchen.\n In April, Michael Ruhlman, author of “Ratio” and “The Elements of Cooking” and co-author of books by Thomas Keller and other chefs, said on his  blog that  he likes to make chicken stock and leave it out on the stovetop all week, using portions day to day to make quick soups and sauces.\n But what about the harmful microbes that could grow on foods if they were not kept either chilled or hot? “Once your stock is cooked, it’s safe to eat,” Mr. Ruhlman wrote. “If there were bad bacteria in it, you’d have killed them.” After the stock has cooled, simply reheat it, he continued, and “any bacteria that landed there and began to multiply will be dispatched well before the stock hits a simmer.”\n Sounds plausible, and Mr. Ruhlman and his family are alive and well. But after checking with an independent expert on food safety, I wouldn’t follow this recipe without slapping a biohazard label on my stockpot.\n  The Food and Drug Administration sets regulations for commercial food production. These specify that cooked foods should sit out at temperatures from 41 degrees to 135 degrees, the range in which bacteria can grow and multiply, for no more than four hours.\n Guidelines for the consumer and home cook, which come from the Department of Agriculture Food Safety and Inspection Service, are even stricter. The current brochure,  “Keep Food Safe! Food Safety Basics,” on the U.S.D.A. Web site, says not to leave prepared foods in the bacterial growth zone for longer than two hours. And if it’s a 90-degree summer day, cut the two hours to one.\n Mr. Ruhlman’s stock spends days in the bacterial growth zone, and he happily makes it into chicken soup for his children.\n I’ll admit to violating the guidelines in my own stock-making, though by a few hours, not days. When I cook a roast for dinner, I use leftover scraps and bones to start the stock, simmer it while I clean up, and take the pot off the heat right before I go to bed. At that point it’s too much trouble to cool the hot stock so it won’t warm up its neighbors in the refrigerator. Instead, I cover the pot, leave it at room temperature and reheat it in the morning, about eight hours later, before straining, cooling and refrigerating it. And my stock hasn’t made me or my family ill, either.\n Can I be even more relaxed about my stock-making? Or have Mr. Ruhlman and I just been lucky? For an expert opinion, I sent our recipes to  O. Peter Snyder, a food scientist and veteran educator and consultant to the food-service industry, who has at times taken issue with government guidelines he considers unnecessarily conservative.\n  Dr. Snyder replied in an e-mail: “The process described by Mr. Ruhlman is a very high-risk procedure. It depends totally on reheating the stock before it is used to be sure that it doesn’t make anyone ill or possibly kill them.”\n It’s a basic fact that every cook should know: bacteria that cause illness inevitably end up on nearly every ingredient we cook with, and even boiling won’t kill all of them.\n Boiling does kill any bacteria active at the time, including E. coli and salmonella. But a number of survivalist species of bacteria are able to form inactive seedlike spores. These dormant spores are commonly found in farmland soils, in dust, on animals and field-grown vegetables and grains. And the spores can survive boiling temperatures.\n After a food is cooked and its temperature drops below 130 degrees, these spores germinate and begin to grow, multiply and produce toxins. One such spore-forming bacterium is Clostridium botulinum, which can grow in the oxygen-poor depths of a stockpot, and whose neurotoxin causes botulism.\n Once they’ve germinated, bacteria multiply quickly in nourishing stock. They can double their numbers every 90 minutes at room temperature, every 15 minutes at body temperature. A single germinated spore can become 1,000 bacteria in a matter of hours, a billion in a few days.\n As Dr. Snyder put it, “After sitting on the stove and growing bacteria for two or three days, Mr. Ruhlman’s stock almost certainly has high levels of infectious Clostridium perfringens cells, or Clostridium botulinum or Bacillus cereus cells and their toxins, or some combination thereof.”\n  Why has the Ruhlman family survived? Because Mr. Ruhlman boils the stock before he serves it, Dr. Snyder wrote. Any active bacteria are killed by holding the stock for a minute at 150 degrees or above, and botulism toxin is inactivated by 10 minutes at the boil.\n  But quickly reheating a contaminated stock just up to serving temperature won’t destroy its active bacteria and toxins, and the stock will make people sick.\n “If Mr. Ruhlman ever has a cup of his three-day-old stock without thoroughly boiling it first, he will probably only do it once,” Dr. Snyder wrote. “It is irresponsible of any cook to prepare food in a way that actually creates a new and significant hazard, even though the hazard may be eliminated in a later step.”\n Safety is one problem with keeping a stock at room temperature. Flavor is another. A reboiled three-day-old stock may be safe to eat, but it is now seasoned with millions to billions of dead bacteria and their inactivated toxins. It’s conceivable that they might add an interesting flavor, but more likely that the bacteria have feasted on the stock’s sugars and savory amino acids, the air has oxidized and staled the fat, and the stock has become less tasty.\n I spoke with Mr. Ruhlman about Dr. Snyder’s analysis of his stovetop-stored stock. “I agree that I should have been clearer about the importance of the ‘kill step,’ a good 10 minutes at the boil,” he said. “And certainly to make the freshest, cleanest stock, it’s always best to strain, cool and chill it as rapidly as possible.”\n What about my lazy method of letting stock cool overnight, then reboiling and refrigerating it first thing in the morning? Dr. Snyder gave it a pass because it would spend only a few hours below 135 degrees, not enough time for the bacterial spores to germinate, start growing and reach hazardous numbers.\n Like meat stocks, all moist cooked foods are susceptible to being recolonized by survivalist bacteria. (Baked goods are generally too dry for bacteria; they’re spoiled by molds.) That’s why we should avoid leaving cooked foods out at room temperature for long when we’re preparing for a party or holiday feast (or enjoying their lazy follow-ups), or having a picnic, or packing lunch boxes for young children, who along with the elderly and ill are more vulnerable. It’s best to keep moist lunch items either cold or hot, surrounded by cold packs or in a thermos.\n  What are the actual odds of getting sick from casual food handling at home? No one really knows. There are many variables involved, and only a small fraction of illnesses are reported, even to a family doctor, since they’re usually brief. But one unambiguous and heartbreaking story can bring home the value of handling food carefully.\n In 2008, a 26-year-old Japanese mother in the Osaka region shared a meal of leftover fried rice with her two children, ages 1 and 2. She had prepared and served the rice the day before and kept it at room temperature.\n All three became ill 30 minutes after eating the leftovers, and were hospitalized. Both children lost consciousness, and the youngest died seven hours after the meal. Pathologists later reported in the journal Pediatrics that the rice contained a very common spore-forming bacterium, Bacillus cereus, along with a heat-resistant toxin that the bacterium tends to make on starchy foods, and that can cause vomiting even after being heated to the boil.\n It may be true that most cases of food-borne illness aren’t that serious, and that most reported cases can be traced to foods that were contaminated during their production or processing. But it is also true that one simple mistake at home can be fatal.\n Even though I know this, I tend to discount specific government guidelines because they seem to change arbitrarily, and they don’t seem workable in real life. This is true of the latest U.S.D.A. numbers. It’s unrealistic to expect home cooks to chill or reheat or discard dishes every two hours during a dinner party, or every hour at a summer barbecue.\n Dr. Snyder agreed that official pronouncements on food safety can be inconsistent and self-defeating. “The F.D.A. Food Code is very conservatively written,” he wrote. “Four hours after it’s cooked is plenty fast enough to get food into the refrigerator.” And slow enough to relax and enjoy the meal.\n Dr. Snyder added that it’s safest to cool leftovers uncovered and in a mass no thicker than two inches, so they cool through quickly. If they’re still hot, start the cooling on the countertop. When the container is no longer hot to the touch, put it in the refrigerator, and cover it once the food is good and cold.\n  My own everyday approach to safety is to try to keep cooked foods either hot or cold until I’m ready to serve them, get leftovers in the fridge during the pause before dessert or soon after, and reheat leftovers that need it until they’re boiling or steaming.\n This set of habits isn’t dictated by an unnecessary, pleasure-killing fear of microbes. It simply acknowledges their inevitable presence in my kitchen, and the fact that both my food and anyone who eats it will be better off if the care I give it doesn’t end with the cooking.", "posttime": "2022-01-09 21:54:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "细菌,rules", "title": "弯曲细菌规则（2011）", "title_en": "Bending the Rules on Bacteria (2011)", "transed": 1, "url": "https://www.nytimes.com/2011/08/24/dining/bending-the-rules-on-bacteria-and-food-safety.html", "via": "", "real_tags": ["细菌", "rules"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072451, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们自己的最佳结果指数由市场上最好的搜索引擎的结果增强。", "note_en": "Our own index of the finest results augmented by the results from the best search engines on the market.\n                 Kagi has been built to let people discover the content that amplifies their knowledge. A search engine envisioned as a tool for the user, not for the advertiser. A true search companion.", "posttime": "2022-01-09 21:53:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kagi,premium,指数", "title": "Kagi：高级搜索引擎", "title_en": "Kagi: A Premium Search Engine", "transed": 1, "url": "https://kagi.com/", "via": "", "real_tags": ["kagi", "premium", "指数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072450, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何尝试拆卸PC DOS 1.1引导扇区的人很快就会通知偏移1A3H到1Beh，有一个刚刚属于的字节序列。它似乎是代码的片段，但它在引导扇区中没有目的，从未执行过。那么为什么那里的垃圾字节序列以及它来自哪里？\nPC DOS 1.1引导扇区中的垃圾不是此类垃圾的唯一实例。例如，IBMBio.com还包含一个不同且较大的垃圾序列，部分地是重复IBMBio.com本身的内容。\n与字符串终止有另一种陌生性，尽管它大多来自PC DOS 1.1。\nDOS通常不使用此技术（字符串通常是美元终止），尽管例如调试使用拆卸器中的指令磁带表中的高比特终止，但再次保存每个助记符的字节。", "note_en": "Anyone trying to disassemble the PC DOS 1.1 boot sector soon notices that at offsets 1A3h through 1BEh there is a byte sequence that just does not belong. It appears to be a fragment of code, but it has no purpose in the boot sector and is never executed. So why is the sequence of junk bytes there, and where did it come from?\n The immediate answer is “it came from FORMAT.COM”. The junk is copied verbatim from FORMAT.COM to the boot sector. But those junk bytes are  not part of FORMAT.COM, either. So the question merely shifts to “why are the junk bytes in FORMAT.COM, and where did they come from?”\n It is not known if anyone answered the question in the past, but the answer has been found now, almost 40 years later—twice independently.\n  The junk bytes are a fragment of Microsoft’s linker, LINK.EXE. There is an  almost identical code sequence within LINK.EXE that was shipped on the PC DOS 1.1 disk. The sequence is close enough and unique enough that it’s extremely implausible that it might have come from anywhere else.\n For one thing, the code fragment looks like something generated by a high-level language compiler, yet the bulk of DOS 1.1 was written in assembly language. Notably MASM and LINK were not; both were written in Microsoft’s Pascal.\n The first person to make this discovery (as far as we can tell) was Daniel B. Sedory aka The Starman, whose  illustrated PC DOS 1.1 boot sector page is much nicer than anything I could put together.\n I followed about two weeks later. Back when I was  reconstructing PC DOS 1.1, I noticed the boot sector junk, but at the time I did not make the next step of trying to identify where it might have come from.\n The junk in the PC DOS 1.1 boot sector isn’t the only instance of such junk. For example IBMBIO.COM also contains a different and larger junk sequence which is partly a repetition of the contents of IBMBIO.COM itself.\n It is virtually certain that the junk bytes came indirectly from development tools used for building PC DOS 1.1, namely Microsoft’s assembler/linker. MASM can define “uninitialized data” and the linker interprets that quite literally, placing uninitialized data into the resulting executable. The bytes are probably somewhat unpredictable memory contents and might contain fragments of the linked program’s data or code, or even fragments of the linker itself.\n The junk somewhat complicates analysis of the resulting executables because it’s not trivial to prove that it has no function; even if the junk bytes never get executed, they might end up being copied somewhere, or become part of the stack contents, and affect program execution indirectly.\n  There is no reason to believe that the junk bytes are the result of programmer intent. But there are two other oddities that are not random and are much harder to explain.\n One is “zero-terminated strings”. When the boot sector checks whether a disk is bootable, it verifies that the first two root directory entries are IBMBIO.COM and IBMDOS.COM. To that end, the strings ‘ibmbio com’ and ‘ibmdos com’ are stored in the boot sector. They are stored in lowercase (and the root directory contents are forced to lowercase, too), which is itself odd, since it’s not clear how the directory entries could ever not be uppercase. Perhaps this was not strictly enough specified, or the boot sector code tried to be extra careful.\n But the real weirdness is that the strings are “terminated” with ASCII character ‘0’ (zero). That is to say, in the boot sector they are stored as “ibmbio com0ibmdos com0”. The zeros have no function since only up to 11 bytes are compared for each of the two file names. This was perhaps a oversight and the strings were meant to be null-terminated, but instead of writing\n    Since the terminator has no function, the mistake was never found and corrected. That is just speculation but it makes at least some sort of sense.\n There is  another strangeness related to string termination, although it was mostly gone from PC DOS 1.1.\n In PC DOS 1.0, strings in the boot sector  and in IBMBIO.COM are null-terminated, but the last character of text also has the high bit set. The routine which prints the strings strips the high bit from all characters.\n Again, it’s very unclear what purpose this might have had. The high bits are simply stripped and thrown away, but it cannot be a coincidence that the last character of each string in the boot sector and in IBMBIO.COM has the high bit set.\n In PC DOS 1.1, the high bits are no longer set on the boot sector and IBMBIO.COM strings, but the print string routine in the boot sector still strips them. That was presumably a harmless omission.\n It is possible that in some earlier incarnation, the strings were high-bit-terminated, then changed to null-terminated, but the high bit still remained set and stripped in PC DOS 1.0, and in PC DOS 1.1 only the stripping remained.\n Note that in the PC DOS 1.0 boot sector, the strange zero-termination is combined with high-bit-termination, and the strings ‘ibmbio com0’ and ‘ibmdos com0’ are each stored with the last byte as B0h, which is ASCII ‘0’ (30h) + 80h. In PC DOS 1.1, the high bit is no longer set.\n  Terminating strings by setting the high bit of the last character was a somewhat common practice on machines with limited memory and no need to process anything beyond 7-bit ASCII (that is, a great many systems in 1980 and earlier). Microsoft used this technique in BASIC; especially for storing BASIC token tables, using the high bit instead of a length or terminator byte saved hundreds of bytes of precious ROM.\n DOS does not generally use this technique (strings are generally dollar-terminated), although for example DEBUG uses high bit termination for the instruction mnemonic table in the disassembler, again saving a byte per mnemonic which does add up.\n Terminating strings by setting the high bit was clearly a widespread technique at the time (one most likely independently invented more than once) and presumably known to all Microsoft programmers. It is thus not surprising to find it in the parts of DOS written by Microsoft (boot sector, IBMBIO.COM, SYS.COM, FORMAT.COM), quite possibly even written by a single programmer, Bob O’Rear.\n It is possible that Microsoft used some assembler string definition macros which automatically added the high bit terminator (see e.g. ‘Q’ macro in BASIC’s  BINTRP.H). That might partially explain the strange double termination seen e.g. in FORMAT.COM from  PC DOS 0.9 where strings are terminated with ASCII ‘$’ and a B0h byte (ASCII ‘0’ with high bit set); whatever it was meant to accomplish, the B0h is redundant because DOS won’t get past the ‘$’ when displaying strings. But if a string definition macro automatically set the high bit, an extra byte would have had to be added because DOS would not recognize ASCII ‘$’ with high bit set as the expected terminator.\n All in all, it’s clear that the code Microsoft wrote for PC DOS underwent some evolution and was cleaned up only after the PC DOS 1.0 release, with some vestiges of the earlier iterations remaining even in PC DOS 1.1.", "posttime": "2022-01-09 21:53:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pc,拆卸", "title": "未认定的PC DOS 1.1引导扇区垃圾识别", "title_en": "Unidentified PC DOS 1.1 Boot Sector Junk Identified", "transed": 1, "url": "https://www.os2museum.com/wp/unidentified-pc-dos-1-1-boot-sector-junk-identified/", "via": "", "real_tags": ["pc", "拆卸"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072449, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "南卡罗来纳州科技公司的首席执行官已诉诸于20次有关的金属欺诈罪，该欺诈与设定的PHONY公司的精心统一网络有关，以获得超过735,000个互联网协议（IP）地址，从非营利组织租赁数字房地产租赁北美的实体。\n到2013年，许多网络运营商依赖于帮助阻止垃圾电子邮件的集团，许多Micfo的客户降落在Spamhaus的雷达上。但是，斯威尔沃山开始阻止MICFO的IP地址范围，MICFO移位齿轮，并开始转售IP地址，主要用于营销“虚拟专用网络”或VPN服务，帮助客户在线隐藏其真实IP地址。\n但是几个星期后，云创新使法官在Afrinic的祖国居住的法官中冻结了Afrinic Bank账户的5000万美元，争论Afrinic“以恶意行事，令人厌恶的基础玷污了云创新声誉，”它有义务保护其客户免受服务的破坏。\n这显然明显明显的人认为，他们可以赚钱的唯一方式是肆无忌惮。好的，也许不是唯一的方法，而是制作“巨大”金额的唯一方法。如果他们尽可能多地努力做出合法的努力，他们可能不会那么多，但他们肯定会因为地狱而保持较长！而且，严重，何时足够超过1mm / yr，$ 200mm / yr ????普通人可以达到50万美元/年。我认为它们足以弄清楚如何生活在500k /年。如果他们不能，他们并不像他们认为的那样明亮。\n布莱恩，你发布了2020年的帽子采访吗？阅读会很有趣。我似乎无法找到它。", "note_en": "The CEO of a South Carolina technology firm has pleaded guilty to 20 counts of wire fraud in connection with an elaborate network of phony companies set up to obtain more than 735,000 Internet Protocol (IP) addresses from the nonprofit organization that leases the digital real estate to entities in North America.\n  In 2018, the  American Registry for Internet Numbers (ARIN), which oversees IP addresses assigned to entities in the U.S., Canada, and parts of the Caribbean, notified Charleston, S.C. based  Micfo LLC that it intended to revoke 735,000 addresses.\n ARIN said they wanted the addresses back because the company and its owner — 38-year-old  Amir Golestan — had obtained them under false pretenses. A global  shortage of IPv4 addresses has massively driven up the price of these resources over the years: At the time of this dispute, a single IP address could fetch between $15 and $25 on the open market.\n Micfo responded by suing ARIN to try to stop the IP address seizure. Ultimately, ARIN and Micfo settled the dispute in arbitration, with Micfo returning most of the addresses that it hadn’t already sold.\n But the legal tussle caught the attention of  South Carolina U.S. Attorney Sherri Lydon, who in May 2019  filed criminal wire fraud charges against Golestan, alleging he’d orchestrated a network of shell companies and fake identities to prevent ARIN from knowing the addresses were all going to the same buyer.\n Each of those shell companies involved the production of notarized affidavits in the names of people who didn’t exist. As a result, Lydon was able to charge Golestan with 20 counts of wire fraud — one for each payment made by the phony companies that bought the IP addresses from ARIN.\n  On Nov. 16, just two days into his trial, Golestan changed his “not guilty” plea, agreeing to plead guilty to all 20 wire fraud charges. KrebsOnSecurity interviewed Golestan about his case at length last year, but he has not responded to requests for comment on his plea change.\n By 2013, a number of Micfo’s customers had landed on the radar of  Spamhaus, a group that many network operators rely upon to help block junk email. But shortly after Spamhaus began blocking Micfo’s IP address ranges, Micfo shifted gears and began reselling IP addresses mainly to companies marketing “virtual private networking” or VPN services that help customers hide their real IP addresses online.\n In a 2020 interview, Golestan told KrebsOnSecurity that Micfo was at one point responsible for brokering roughly 40 percent of the IP addresses used by the world’s largest VPN providers. Throughout that conversation, Golestan maintained his innocence, even as he explained that the creation of the phony companies was necessary to prevent entities like Spamhaus from interfering with his business going forward.\n Stephen Ryan, an attorney representing ARIN, said Golestan changed his plea after the court heard from a former Micfo employee and public notary who described being instructed by Golestan to knowingly certify false documents.\n “Her testimony made him appear bullying and unsavory,” Ryan said. “Because it turned out he had also sued her to try to prevent her from disclosing the actions he’d directed.”\n Golestan’s  rather sparse plea agreement ( first reported by The Wall Street Journal) does not specify any sort of leniency he might gain from prosecutors for agreeing to end the trial prematurely. But it’s worth noting that a conviction on a single act of wire fraud can result in fines and up to 20 years in prison.\n The courtroom drama comes as ARIN’s counterpart in Africa is embroiled in a similar, albeit much larger dispute over millions of African IP addresses. In July 2021, the  African Network Information Centre (AFRINIC)  took back more than six million IP addresses from  Cloud Innovation, a company incorporated in the African offshore entity haven of Seychelles (pronounced, quite aptly — “say shells”).\n  AFRINIC revoked the addresses — valued at around USD $120 million — after an internal review found that most of them were being used outside of Africa by various entities in China and Hong Kong. Like ARIN, AFRINIC’s policies require those who are leasing IP addresses to demonstrate that the addresses are being used by entities within their geographic region.\n But just weeks later, Cloud Innovation convinced a judge in AFRINIC’s home country of Mauritius  to freeze $50 million in AFRINIC bank accounts,  arguing that AFRINIC had “acted in bad faith and upon frivolous grounds to tarnish the reputation of Cloud Innovation,” and that it was obligated to protect its customers from disruption of service.\n That financial freeze has since been partially lifted, but the legal wrangling between AFRINIC and Cloud Innovation continues. The company’s CEO is also suing the CEO and board chair of AFRINIC in an $80 million defamation case.\n Ron Guilmette is a security researcher who spent several years tracing how tens of millions of dollars worth of AFRINIC IP addresses were  privately sold to address brokers by a former AFRINIC executive. Guilmette said Golestan’s guilty plea is a positive sign for AFRINIC, ARIN and the three other  Regional Internet Registries (RIRs).\n “It’s good news for the rule of law,” Guilmette said. “It has implications for the AFRINIC case because it reaffirms the authority of all RIRs, including AFRINIC and ARIN.”\n       Iranian?….hmmmmm….no foolin’……to paraphrase Frank Zappa from “Camarillo Brillo”…..\n  If he had figured out a way to do this without deliberately lying in the notary process, somehow…\n  The Notary process in the US is a joke. In many states you pay the fee and get someone to say you’re a good person in front of a magistrate and *POOF*, you’re a notary.\n    It’s kind of sad that these obviously bright people think that the only way they can make money is to be unscrupulous. OK, maybe not the only way, but the only way to make ‘huge’ amounts of money. If they put as much effort into legitimate efforts, they probably wouldn’t make quite as much, but they would sure as hell get to keep it longer! And, seriously, when is enough enough $1MM/yr, $200MM/yr???? The average person can live on $50K/yr. I’d think they are bright enough to figure out how to live on $500K/yr. If they can’t then they aren’t as bright as they think they are.\n  Most hosting companies are now charging about $20 a month for a dedicated IP number now and days, because of the IP4 shortage\n      No worries, his younger brother Amin Golestan runs Braveway, Aventice, Micfo, ALTUS COMMUNICATIONS among other shell companies for him now.\n  Their sister also runs the same operation under Azadeh Golestan Parast trading as Virtual Dedicated Datacenter Services\n  If he’s a green card holder, then he can be deported if convicted. He’d probably be a hero back in Iran and treated well if he can continue scamming from there.\n If he’s a US citizen, then he should become a televangelist, after studying the techniques of the masters of con, e.g. Ernest Angley, Peter Popoff, Reverend Ike, Robert Tilton, Jim Bakker and their like. He has already has the hair and the wardrobe. He could end up making more than he was making, tax free.\n  Why are all these retarded political comments being accepted? Is moderation broke? Half of the comments here are reddit-tier ‘troll’ posts.\n    Brian, did you publish the 2020 interview of Golestan? It would be interesting to read. I can’t seem to locate it.\n    arin et afrinic we see that they have no qualms about helping crooks we must not forget all the others like apnic, lacnic , Ripe ncc , rirns.arin.net , ca -servers.ca , nic.expert , nic.art , dnsowl , ultradns , registrar -servers , cloudflare and etc … And above all we must not forget the hosts selling armored vps like frantech.ca buyvm.net which are used a lot by pedophile forums, zoophiles, phishing sites, botnets and etc … are they all accomplices or not? me on what I could see on their servers I said to myself that it might be time to step up and investigate them!\n  Quite strange that ARIN decided to settle out of court with a criminal. Almost smells here that someone inside at ARIN is in cahoots, perhaps providing him a roadmap of what to do, and then to facilitate the settlement with him. I’m certain that he’s passed along the blueprint to his family and friends, for them to enact the same crimes from different states and different countries. IMO -non attorney- Filing bogus notarized affidavits is a serious breach of laws and he should be held fully accountable. Stealing from public domain, what others could need and use, would have countless victims other than ARIN.", "posttime": "2022-01-09 21:51:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "首席,ceo,afrinic", "title": "技术首席执行官在IP地址方案中恳求欺诈", "title_en": "Tech CEO pleads to wire fraud in IP address scheme", "transed": 1, "url": "https://krebsonsecurity.com/2021/11/tech-ceo-pleads-to-wire-fraud-in-ip-address-scheme/", "via": "", "real_tags": ["首席", "ceo", "afrinic"]}, {"category": "", "categoryclass": "", "imagename": "5bcb13a1b7250dfb835a985f838806b4.jpg", "infoid": 1072448, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": " - 卷。 86，没有。 32（1920年10月1日）; v。85，没有。 33（1920年10月2日）-V。 88，否。 201（1924年3月18日）。\n纽约格兰德。 （纽约，纽约）7月7日。 1922年，p。 87.从国会图书馆检索，www.loc.gov/Item/sn83045774/1922-05-07/1922-05-07/D-1/。", "note_en": "-  Vol. 86, no. 32 (Oct. 1, 1920) ; v. 85, no. 33 (Oct. 2, 1920)-v. 88, no. 201 (Mar. 18, 1924).\n  -  Available on microfilm from Library of Congress, Photoduplication Service, and New York Public Library.\n  -  Archived issues are available in digital format from the Library of Congress Chronicling America online collection.\n The Library of Congress believes that the newspapers in Chronicling America are in the public domain or have no known copyright restrictions. Newspapers published in the United States more than 95 years ago are in the public domain in their entirety. Any newspapers in Chronicling America that were published less than 95 years ago are also believed to be in the public domain, but may contain some copyrighted third party materials. Researchers using newspapers published less than 95 years ago should be alert for modern content (for example, registered and renewed for copyright and published with notice) that may be copyrighted. Responsibility for making an independent legal assessment of an item and securing any necessary permissions ultimately rests with persons desiring to use the item.\n The NEH awardee responsible for producing each digital object is presented in the Chronicling America page display, below the page image – e.g. Image produced by the Library of Congress. For more information on current NDNP awardees, see  https://www.loc.gov/ndnp/listawardees.html.\n For more information on Library of Congress policies and disclaimers regarding rights and reproductions, see  https://www.loc.gov/homepage/legal.html\n Citations are generated automatically from bibliographic data as a convenience, and may not be complete or accurate.\n      The New York herald. (New York, NY) 7 May. 1922, p. 87. Retrieved from the Library of Congress, www.loc.gov/item/sn83045774/1922-05-07/ed-1/.", "posttime": "2022-01-09 21:50:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全世界,world,item", "title": "全世界在一百年（1922年）是什么", "title_en": "What the world will be like in a hundred years (1922)", "transed": 1, "url": "https://www.loc.gov/resource/sn83045774/1922-05-07/ed-1?sp=87", "via": "", "real_tags": ["全世界", "world", "item"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072447, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多式联运图像查看器", "note_en": "Multimodal image viewer", "posttime": "2022-01-09 21:50:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "夜间,image,图像", "title": "伦勃朗的“夜间观察”717-千兆像素图像", "title_en": "717-gigapixel image of Rembrandt's 'The Night Watch'", "transed": 1, "url": "https://hyper-resolution.org/view.html?pointer=0.259,0.015&r=0.0000,0.1920,1.0000,0.6351&i=Rijksmuseum/SK-C-5/SK-C-5_VIS_20-um_2019-12-21", "via": "", "real_tags": ["夜间", "image", "图像"]}, {"category": "", "categoryclass": "", "imagename": "67fac4bdde844113c72d3dcffba0a648.jpg", "infoid": 1072446, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "系好安全带。 NVIDIA研究正在重新调整一个新的深度学习引擎，从标准的2D图像创建3D对象模型 - 并且可以将像骑士骑士的AI动力的KITT一样带来标志性的汽车 - 在NVIDIA Omniverse中。\n“因为我们在真实的图像上培训而不是典型的管道，它依赖于合成数据，AI模型更好地推广到现实世界应用程序，”该项目的作者NVIDIA研究员Jun Gao说。\n因为从不同角度捕获相同对象的实时世界数据集是罕见的，使用2D到3D的图像的大多数AI工具都使用ShapEnet​​等合成3D数据集进行训练。\nGTC注册是免费的，并于4月23日开放。与会者将于5月11日可获得按需内容。", "note_en": "Fasten your seatbelts.  NVIDIA Research is revving up a new deep learning engine that creates 3D object models from standard 2D images — and can bring iconic cars like the  Knight Rider’s AI-powered KITT to life — in  NVIDIA Omniverse.\n Developed by the NVIDIA AI Research Lab in Toronto, the GANverse3D application inflates flat images into realistic 3D models that can be visualized and controlled in virtual environments. This capability could help architects, creators, game developers and designers easily add new objects to their mockups without needing expertise in 3D modeling, or a large budget to spend on renderings.\n A single photo of a car, for example, could be turned into a 3D model that can drive around a virtual scene, complete with realistic headlights, tail lights and blinkers.\n  To generate a dataset for training, the researchers harnessed a generative adversarial network, or GAN, to  synthesize images depicting the same object from multiple viewpoints — like a photographer who walks around a parked vehicle, taking shots from different angles. These multi-view images were plugged into a  rendering framework for inverse graphics, the process of inferring 3D mesh models from 2D images.\n Once trained on multi-view images, GANverse3D needs only a single 2D image to predict a 3D mesh model. This model can be used with a 3D neural renderer that gives developers control to customize objects and swap out backgrounds.\n When imported as an extension in the  NVIDIA Omniverse platform and run on  NVIDIA RTX GPUs, GANverse3D can be used to recreate any 2D image into 3D — like the beloved crime-fighting car KITT, from the popular 1980s  Knight Rider TV show.\n  Instead, with no aid from 3D assets, “We turned a GAN model into a very efficient data generator so we can create 3D objects from any 2D image on the web,” said Wenzheng Chen, research scientist at NVIDIA and lead author on the project.\n “Because we trained on real images instead of the typical pipeline, which relies on  synthetic data, the AI model generalizes better to real-world applications,” said NVIDIA researcher Jun Gao, an author on the project.\n The  research behind GANverse3D will be presented at two upcoming conferences: the International Conference on Learning Representations in May, and the Conference on Computer Vision and Pattern Recognition, in June.\n  Creators in gaming, architecture and design rely on virtual environments like the NVIDIA Omniverse simulation and collaboration platform to test out new ideas and visualize prototypes before creating their final products. With  Omniverse Connectors, developers can use their preferred 3D applications in Omniverse to simulate complex virtual worlds with real-time ray tracing.\n But not every creator has the time and resources to create 3D models of every object they sketch. The cost of capturing the number of multi-view images necessary to render a showroom’s worth of cars, or a street’s worth of buildings, can be prohibitive.\n That’s where a trained GANverse3D application can be used to convert standard images of a car, a building or even a horse into a 3D figure that can be customized and animated in Omniverse.\n To recreate KITT, the researchers simply fed the trained model an image of the car, letting GANverse3D predict a corresponding 3D textured mesh, as well as different parts of the vehicle such as wheels and headlights. They then used  NVIDIA Omniverse Kit and  NVIDIA PhysX tools to convert the predicted texture into high-quality materials that give KITT a more realistic look and feel, and placed it in a dynamic driving sequence.\n “Omniverse allows researchers to bring exciting, cutting-edge research directly to creators and end users,” said Jean-Francois Lafleche, deep learning engineer at NVIDIA. “Offering GANverse3D as an extension in Omniverse will help artists create richer virtual worlds for game development, city planning or even training new machine learning models.”\n  Because real-world datasets that capture the same object from different angles are rare, most AI tools that convert images from 2D to 3D are trained using  synthetic 3D datasets like ShapeNet.\n To obtain multi-view images from real-world data — like images of cars available publicly on the web — the NVIDIA researchers instead turned to a GAN model, manipulating its neural network layers to turn it into a data generator.\n The team found that opening the first four layers of the neural network and freezing the remaining 12 caused the GAN to render images of the same object from different viewpoints.\n Keeping the first four layers frozen and the other 12 layers variable caused the neural network to generate different images from the same viewpoint. By manually assigning standard viewpoints, with vehicles pictured at a specific elevation and camera distance, the researchers could rapidly generate a multi-view dataset from individual 2D images.\n The final model, trained on 55,000 car images generated by the GAN, outperformed an inverse graphics network trained on the popular Pascal3D dataset.\n Read the  full ICLR paper, authored by Wenzheng Chen, fellow NVIDIA researchers Jun Gao and Huan Ling, Sanja Fidler, director of NVIDIA’s Toronto research lab, University of Waterloo student Yuxuan Zhang, Stanford student Yinan Zhang and MIT professor Antonio Torralba. Additional collaborators on the CVPR paper include Jean-Francois Lafleche, NVIDIA researcher Kangxue Yin and Adela Barriuso.\n The NVIDIA Research team consists of more than 200 scientists around the globe, focusing on areas such as AI, computer vision, self-driving cars, robotics and graphics. Learn more about the company’s latest research and industry breakthroughs in NVIDIA CEO Jensen Huang’s  keynote address at this week’s GPU Technology Conference.\n GTC registration is free, and open through April 23. Attendees will have access to on-demand content through May 11.", "posttime": "2022-01-09 21:49:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,single", "title": "NVIDIA工具从单个静止图像生成完整的3D模型", "title_en": "Nvidia tool generates full 3D models from a single still image", "transed": 1, "url": "https://blogs.nvidia.com/blog/2021/04/16/gan-research-knight-rider-ai-omniverse/", "via": "", "real_tags": ["nvidia", "single"]}, {"category": "", "categoryclass": "", "imagename": "80c0e3098d16f39068a6610d8aa3b998.jpeg", "infoid": 1072445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很少有人可以抵抗一个新生的婴儿微笑 - 信号传播积极的情绪，例如喜悦和兴趣。当然，新父母尤其如此。一项研究发现，新母亲看着他们16小时的婴儿80％的时间，34％的时间笑了笑。\n当研究人员开始观察婴儿时，他们的大部分初始结果与父母报告不同。 1959年的一项研究，定义了“社会笑容”在微笑前寻求眼神接触，发现这项研究中的400名婴儿都没有在第一周笑了笑。只有11％的人在两周的年龄上表现出社会笑容。大约60％的人在三个星期内进行了社会笑了笑，几乎所有的人都在第一个月内进行了社会微笑。\n不幸的是，具有新生儿的行为研究仍然稀缺，并且需要精心分析来解释某些行为的含义。虽然需要进一步的研究，但假设这些早期笑容具有社会意义是合理的。对于我们的许多人在该领域，它是最不明确的，这些笑容绝对不仅仅是反射。", "note_en": "Very few people can resist smiling at a newborn baby – signalling positive emotions, such as joy and interest. Of course, this is especially true for new parents. One study found that new mothers looked at their 16-hour-old babies 80% of the time and  smiled at them 34% of the time.\n Sometimes newborn babies even smile back, creating a magical moment for the parents that is often ruined by someone pointing out that the smile can’t be real. Even textbooks tend to  regard neonatal smiling as a reflex rather than an actual expression of joy and happiness. But is this really the case?\n Up to the second half of the 20th century, the behaviour of newborns was considered mostly reflexive. Scientists assumed that newborns had a limited ability to feel and express emotions, and did not have enough social experience to interact with their caregivers.\n It was even believed that  newborn babies couldn’t feel pain in the same way as adults – meaning they were sometimes subjected to painful surgical procedures without analgesia. It wasn’t until the 1980s that medical professionals realised that the stress of the pain actually led to life-threatening shock and complications.\n   Over the past 50 years,  data has slowly accumulated suggesting that neonates are more than just reflexive beings. They are competent enough to actively regulate their own states. For example, they can fall asleep to shut out stressful distractions, or fuss and cry if they need stimulation and more interaction. They can also imitate smiles as early as the first 36 hours of life and can even learn from previous experience as early as the first day of life.\n  However, when it comes to feelings such as happiness and joy, we have continued to question whether newborns can be socially competent beings. Up until the early 2000s, newborn babies were thought to smile only in response to muscle twitches, penile erections, bowel or bladder movements or for no particular reason at all. Most studies and textbooks –  even in the 21st century – still suggest that the first “social smile” occurs only  after the second month of life.\n And there was evidence to support it. In 1872, Charles Darwin argued that emotional expressions were universal and inborn, and documented the first real smiles of his own child at 45 days of age. My own research has replicated these observations. When we asked 957 parents to observe and record smiling in their children for a study,  they reported the first “social smiles” of their babies just after four weeks on average.\n When researchers started observing infants, most of their initial results were not that different from the parental reports. A study from 1959, which defined “social smiles” as  seeking eye-contact before smiling, found that none of the 400 babies in the study smiled during the first week. Only 11% showed a social smile by two weeks of age. About 60% had socially smiled by three weeks, and almost all of them had socially smiled within the first month.\n Some researchers still fail to register smiles early on, and many smiles occur during sleep – unrelated to the social world. Indeed, even foetuses, observed within the womb with a 4D ultrasonographic method,  smile from at least the 23rd week of gestation. But other studies show that newborns do smile on rare occasions – at most  once in every four minutes for some one-day-olds. And the question now is what those smiles mean.\n  There have long been signs that newborn smiles could signal positive emotions to some extent. Smiles have been noted in the first few days of life  as a response to stroking of the cheek or the belly. Newborns also smile  in response to sweet tastes and smells. These findings were published decades ago when smiles were considered purely as innate reflexes. The reason that scientists at the time didn’t interpret them as emotional was partly because the smiles looked different to social smiles.\n  “Real” smiles – called  Duchenne smiles – involve not only the major muscle that pulls the mouth to the side and upward, but also the muscles around the eyes. Neonatal smiles were thought to involve only the mouth region. However, when scientists micro-analysed facial movements, frame by frame, using a  dedicated coding system, smiles from as early as one day of age were more often than not  accompanied by cheek and eye movements.\n More and more studies have since suggested that newborn babies do smile when they are awake, and that these smiles closely resemble real social smiles. And when newborns are in an interactive, awake state, they smile  twice as much as compared to when they are asleep – more evidence that social factors could be involved. What’s more,  babies often start with moving their cheeks and their brows before they smile, as if focusing their attention on the caregiver’s face. So it is completely possible that these newborn babies actually mean to smile.\n Babies learn about the power of smiling early. While caregivers often smile at their newborns, this behaviour will be dependent on the baby’s state – they are less likely to smile if the baby is crying. As a result, babies quickly gain a remarkable ability to regulate the behaviour of their parents. If a baby keeps eye contact, blinks and smiles, their parent will likely smile back – making the smile rewarding.\n Unsurprisingly, studies on mothers have shown that they are  deeply affected by the smiles of their babies – even on a neurophysiological level. One study measured brain activity in mothers using  fMRI scanning. When mothers saw their own infant smiling, activities in areas of the brain involved in processing emotions – including the amygdala and the limbic system – were enhanced.  Dopaminergic brain areas, known as the reward system in the brain, were also highly active.\n Unfortunately, behavioural studies with neonates are still scarce and require elaborate analyses to interpret the meanings of certain behaviour. While further studies are needed, it is plausible to assume that these early smiles have a social meaning. To many of us in the field, it is at the very least clear that these smiles are definitely more than just a reflex.", "posttime": "2022-01-09 21:49:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "挑战,smiling,社会", "title": "新生儿只是一个反射吗？研究挑战了教科书（2018年）", "title_en": "Is newborn smiling just a reflex? Research is challenging the textbooks (2018)", "transed": 1, "url": "https://theconversation.com/is-newborn-smiling-really-just-a-reflex-research-is-challenging-the-textbooks-105220", "via": "", "real_tags": ["挑战", "smiling", "社会"]}, {"category": "", "categoryclass": "", "imagename": "c0dc560616b461ec61b276c5c5bf12d5.jpeg", "infoid": 1072444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国疾病控制与预防中心周一报道，美国第四个州的第四个人在没有离开美国大陆的情况下神秘地感染了一种致命的南亚细菌。这四起案件中有两起已经死亡，包括上个月底在乔治亚州的验尸检查中发现的最新一起案件。 CDC 调查人员确定这四起案件都存在关联，他们怀疑可能是迄今为止未知的进口产品造成的。疾病预防控制中心此前曾于 6 月 30 日发布了关于早期三起病例的咨询。三月份在堪萨斯州的一名成年人中发现了第一例病例，这也是致命的。今年 5 月，调查人员在明尼苏达州的一名 4 岁女孩和一名成年人中发现了另一例病例。这两名患者在被释放到过渡护理机构之前都住院了很长时间。据报道，德克萨斯州的年轻女孩因感染而脑部受损。 CDC 再次警告医疗保健提供者注意罕见且通常难以诊断的感染，称为类鼻疽，即使是未旅行过的人也是如此。同时，对感染细菌 Burkholderia pseudomallei 的来源的调查仍在继续。据 CDC 称，该机构进行的全基因组测序发现，这四个病例中的每个病例中的假鼻疽芽孢杆菌菌株彼此密切匹配。这些菌株与在亚洲，尤其是南亚发现的菌株有关。 B. pseudomallei 是一种生活在热带和亚热带气候的土壤和水中的环境细菌。在美国，它最常出现在最近去过细菌流行地区的人身上。然而，它之前也曾在美国出乎意料地出现在没有近期旅行史的人群中。过去的神秘案例让研究人员推测，假鼻疽芽孢杆菌现在可能潜伏在美国某些地区的土壤和水域中。但是，在当前的病例群中，CDC 调查人员表示，这些菌株与来自南亚的菌株最为密切相关，而不是之前在北美发现的任何菌株。\n该机构在一份声明中说：“目前，CDC 认为最可能的原因是进口产品（例如食品或饮料、个人护理或清洁产品或药品）或其中一种产品的成分。” “细菌通常生活在潮湿的土壤和水中。然而，在极少数情况下，也发现它会污染细菌常见区域的潮湿或潮湿的产品。”到目前为止，CDC 已经从四名患者的家中收集并检测了 100 多个产品、土壤和水样本，但没有一个样本对假鼻疽芽孢杆菌呈阳性反应。该机构指出，追踪假鼻疽芽孢杆菌的来源有时可能很困难，因为细菌可能需要两到三周的时间才能发展成感染，从而扩大了可能的暴露时间窗口并测试了患者的记忆。一旦类鼻疽发生，诊断它可能是另一个具有挑战性的过程。类鼻疽被称为“伟大的模仿者”，因为它的症状可能差异很大且含糊不清。它有时会被误认为是其他严重的疾病，例如肺结核。人们可以通过摄入细菌或接触皮肤破损而被感染。临床实验室工作人员也有被雾化颗粒感染的风险。症状可能包括局部疼痛或肿胀、发烧、溃疡、脓肿、咳嗽、胸痛、高烧、头痛、厌食、呼吸窘迫、腹部不适、关节痛、定向障碍、体重减轻、胃或胸痛、肌肉或关节痛、疾病预防控制中心指出，和癫痫发作。在这四个相关病例中，患者出现了一系列症状，从咳嗽和呼吸急促到虚弱、疲劳、恶心、呕吐、间歇性发烧以及躯干、腹部和面部皮疹。类鼻疽的死亡率从 10% 到 50% 不等，糖尿病、肾病、慢性肺病和过度饮酒的人面临的风险最大。如果诊断延迟，风险可能会进一步上升。 B. 假鼻疽天生对许多抗生素治疗具有抗性。使用错误的药物延迟诊断和治疗可能会使感染不受控制地传播。如果它变成全身性的，在 90% 的病例中它可能是致命的。", "note_en": "A fourth person in a fourth US state has mysteriously contracted a deadly South Asian bacterium without leaving the continental US, the Centers for Disease Control and Prevention  reported Monday.\n Two of the four cases have been fatal, including the latest one identified in Georgia late last month during a post-mortem exam.\n  CDC investigators determined that all four cases are connected and they suspect a so-far-unknown imported product may be to blame. The CDC had previously released  an advisory on June 30 about  the three earlier cases. The first case was identified in an adult in Kansas in March, which was also fatal. In May, investigators identified a case  in a 4-year-old Texas girl and another case in an adult in Minnesota. Both of those patients were hospitalized for extended periods before being released to transitional care facilities. The young girl in Texas reportedly suffered brain damage from the infection.\n Once again, the CDC is warning healthcare providers to be on the lookout for the rare and often difficult-to-diagnose infection, called melioidosis—even in people who haven&#39;t traveled. Meanwhile, the investigation continues into the source of the infecting bacteria,  Burkholderia pseudomallei.\n According to the CDC, whole genome sequencing conducted by the agency found the  B. pseudomallei strains in each of the four cases closely matched each other. The strains link back to those found in Asia, particularly South Asia.\n B.  pseudomallei is an environmental bacterium that lives in soil and water in tropical and subtropical climates. In the US, it&#39;s most often spotted in people who have recently traveled to places where the bacteria are endemic. However, It has also shown up unexpectedly in the US before in people with no recent travel history. Past mysterious cases have led researchers to speculate that  B. pseudomallei may now be lurking in soils and waters in some areas of the US.\n    But, in the current cluster of cases, CDC investigators say the strains are most closely related to those from South Asia, and not any strains previously identified in North America.\n  &#34;Currently, CDC believes the most likely cause is an imported product (such as a food or drink, personal care or cleaning products or medicine) or an ingredient in one of those types of products,&#34; the agency said in a statement. &#34;The bacteria normally lives in moist soil and water. However, in rare cases, it has also been found to contaminate wet or moist products in the areas where the bacteria are common.&#34;\n So far, the CDC has collected and tested more than 100 samples of products, soil, and water from the four patient&#39;s homes, but none have turned up positive for  B. pseudomallei. The agency noted that tracking down a source of  B. pseudomallei can sometimes be difficult as the bacteria can take two to three weeks to develop into an infection, broadening the window of possible exposure times and testing patients&#39; memories.\n Once melioidosis takes hold, diagnosing it can be another challenging process. Melioidosis has been called the &#34;Great Mimicker&#34; because its symptoms can vary greatly and be vague. It&#39;s sometimes mistaken for other serious illnesses, such as tuberculosis.\n People can become infected by ingesting the bacteria or having contact with a break in the skin. Clinical laboratory workers are also at risk of becoming infected through aerosolized particles. Symptoms can span localized pain or swelling, fever, ulceration, abscess, cough, chest pain, high fever, headache, anorexia, respiratory distress, abdominal discomfort, joint pain, disorientation, weight loss, stomach or chest pain, muscle or joint pain, and seizures, the CDC notes.\n In the four linked cases, the patients presented with a range of symptoms from cough and shortness of breath to weakness, fatigue, nausea, vomiting, intermittent fever, and rash on the trunk, abdomen, and face.\n The fatality rate of melioidosis ranges from 10 percent to 50 percent, and people with diabetes, kidney disease, chronic lung disease, and excessive alcohol use are most at risk. The risks can go up further if there&#39;s a delay in diagnoses.  B. pseudomallei is  inherently resistant to many antibiotic treatments. Delayed diagnosis and treatment with the wrong drugs could allow the infection to spread unchecked. If it becomes systemic, it can be fatal in 90 percent of cases.", "posttime": "2021-08-10 07:05:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,来自,mysteriously,可能", "title": "美国第四人神秘感染来自南亚的致命细菌", "title_en": "4th person in US mysteriously stricken with deadly bacteria from South Asia", "transed": 1, "url": "https://arstechnica.com/science/2021/08/4th-person-in-us-mysteriously-stricken-with-deadly-bacteria-from-south-asia/", "via": "", "real_tags": ["美国", "来自", "可能"]}, {"category": "", "categoryclass": "", "imagename": "84854ed0e861b1a34390a064a6d80277.jpg", "infoid": 1072442, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ahmer Inam 是文思海辉 EDGE 的首席人工智能官 (CAIO)。他在推动组织转型方面拥有 20 多年的经验。他的经验包括在 Nike Inc.、Wells Fargo、Sonic Automotive 和 Cambia Health Solutions 担任领导职务。使用数据和分析来识别和绘制受全球航运危机影响的库存。如果您没有关于运输材料的船上物品的数据，那么请利用这次危机作为一个机会，证明优先使用数据、物联网和高级分析（例如机器学习和模拟）进行供应链数字化转型的合理性。如果您要成功衡量短缺对您的运营有何影响，您需要始终了解货物的位置。如果您没有现成的数据，那么您需要与供应商合作并使用安全环境来共享第二方数据，以提供 AI 驱动的可操作见解，了解对从初创公司到零售商的所有相关方的业务影响给消费者。模拟和预测这些供给侧问题对需求侧的影响。进行场景规划练习并为关键业务决策提供信息。如果这种能力没有到位，大流行、内乱或无法控制的加息等紧急情况将对您的商业计划造成严重破坏。以这种情况为契机，制定灾害管理计划，为潜在风险做好准备。", "note_en": "Ahmer Inam is the chief artificial intelligence officer (CAIO) at  Pactera EDGE. He has more than 20 years of experience driving organizational transformation. His experience includes leadership roles at Nike Inc., Wells Fargo, Sonic Automotive and Cambia Health Solutions.\n   Use data and analytics to identify and map out the inventory being affected by the global shipping crisis. If you don’t have the data about what is on a ship transporting your materials, then use this crisis as an opportunity to justify prioritizing supply chain digital transformation with data, IoT and advanced analytics (e.g., machine learning and simulation). You need to know the location of your goods all times if you are going to successfully gauge what impact a shortage will have on your operation.\n If you don’t have the data readily available, then you need to partner with a vendor and use a secure environment to share second-party data to deliver AI-driven actionable insights on the business impact on all parties involved, from startup to retailer to the consumer.\n Simulate and forecast the impact of these supply-side issues on the demand side. Conduct scenario planning exercises and inform critical business decisions. If this ability is not in place, an emergency like a pandemic, civil unrest or an uncontrollable rate hike will wreak havoc on your business plan. Use this situation as an opportunity to put a disaster management program in place to prepare for the potential risks.", "posttime": "2021-08-10 07:04:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,帮助,ai,数据", "title": "人工智能帮助缓解全球航运危机的 5 种方式", "title_en": "\n\t\t\t\t5 ways AI can help mitigate the global shipping crisis\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/09/5-ways-ai-can-help-mitigate-the-global-shipping-crisis/", "via": "", "real_tags": ["人工智能", "帮助", "ai", "数据"]}, {"category": "", "categoryclass": "", "imagename": "9a4246d8e578565a70ab6078db9f7698.jpg", "infoid": 1072440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "瑞士 EPFL 技术大学的一名研究人员赢得了 3,500 美元的奖金，因为他确定了一个关键的 Twitter 算法偏爱看起来苗条、年轻、肤色较浅或肤色较暖的面孔。 Twitter 周日宣布将奖项授予 Bogdan Kulynych，一位研究隐私、安全、人工智能和社会的研究生。 Twitter 赞助了这场比赛，以找出它用来裁剪它在你的 Twitter 时间线上显示的照片的“显着性”算法中的问题。 Twitter 为发现 AI 偏见而提供的赏金是对现在主流的漏洞赏金做法的一种新方式，即公司支付给外部人员以寻找安全漏洞。用最新的科技新闻、产品和评论为您的闲聊增添趣味。工作日发货。人工智能通过有效处理凌乱的主题（例如为视频添加字幕、发现网络钓鱼电子邮件和识别您的脸以解锁手机），彻底改变了计算方式。但是在现实世界数据上训练的 AI 算法可以反映现实世界的问题，而解决 AI 偏见是计算机科学中的一个热门领域。 Twitter 的赏金计划旨在发现此类问题，以便最终纠正这些问题。今年早些时候，Twitter 本身也证实其 AI 系统在其裁剪算法偏爱白人图像而非黑人图像时显示出偏见。但是 Kulynych 在算法如何裁剪照片以强调它认为最重要的方面发现了其他问题。 Kulynych 在他的项目调查结果中说：“目标模型倾向于认为更突出的人的描述显得苗条、年轻、浅色或温暖的肤色和光滑的皮肤纹理，以及刻板的女性面部特征。” “这种偏见可能会导致少数群体被排除在外，并在数以千计的图像中延续刻板的美感标准。” Kulynych 的系统将人脸原始照片的显着性与一系列 AI 生成的变化进行了比较。他发现，面部越年轻越瘦，显着性分数通常会增加。该算法还为更亮、更暖色调、更高对比度和更饱和颜色的皮肤给出了更高的分数。\n在我们与朋友或社交媒体分享照片之前，我们中的许多人都使用相机和应用美颜滤镜的编辑应用程序，推特称赞参赛作品很重要。这会扭曲我们对吸引力的期望。美容和应用过滤器很普遍。 Facetune 是一款顶级应用，有望帮助您“在社交媒体上脱颖而出”。 B612 是另一种流行的过滤器，它提供了一个“智能美容”工具，可以推荐您的脸型和其他外观变化。但得出的结论是，美化过滤器会“对心理健康产生负面影响”，谷歌在其 Pixel 相机应用程序中默认禁用了自动修饰。它还停止将其调整称为“美容”过滤器。", "note_en": "A researcher at Switzerland&#39;s EPFL technical university won a $3,500 prize for determining that a key Twitter algorithm favors faces that look slim and young and with skin that is lighter-colored or with warmer tones. Twitter announced on Sunday it awarded the prize to  Bogdan Kulynych, a graduate student examining privacy, security, AI and society.\n Twitter sponsored the contest to find problems in the &#34;saliency&#34; algorithm it uses to crop the photos it shows on your Twitter timeline. The  bounty that Twitter offered to find AI bias is a new spin on the now mainstream practice of the bug bounties that companies pay outsiders to find security vulnerabilities.\n  Spice up your small talk with the latest tech news, products and reviews. Delivered on weekdays.\n AI has revolutionized computing by effectively tackling messy subjects like captioning videos, spotting phishing emails and recognizing your face to unlock your phone. But AI algorithms trained on real-world data can reflect real-world problems, and tackling AI bias is a hot area in computer science. Twitter&#39;s bounty is designed to find such problems so they eventually can be corrected.\n Earlier this year, Twitter itself confirmed its AI system showed bias when its cropping algorithm  favored images of white people over Black people. But Kulynych found other problems in how the algorithm cropped photos to emphasize what it deemed most important.\n  &#34;The target model is biased towards deeming more salient the depictions of people that appear slim, young, of light or warm skin color and smooth skin texture, and with stereotypically feminine facial traits,&#34;  Kulynych said in his project findings. &#34;This bias could result in exclusion of minoritized populations and perpetuation of stereotypical beauty standards in thousands of images.&#34;\n Kulynych&#39;s system compared the saliency of an original photo of a human face to a series of AI-generated variations. He found salience scores often increased with faces that appeared younger and thinner. The algorithm also issued higher scores for skin that was lighter, warmer toned, higher contrast and with more saturated colors.\n  Twitter praised the contest entry as important in a world where many of us use camera and editing apps that apply beauty filters before we share photos with friends or on social media. That can distort our expectations of attractiveness.\n Beauty and apps filters are widespread.  Facetune, one top app, promises to help you &#34;stand out on social media.&#34;  B612, another popular filter, offers a &#34;smart beauty&#34; tool that can recommend changes to your face shape and other appearance changes. But concluding that beautification filters can &#34;negatively impact mental well-being,&#34;  Google disabled its automatic touch-ups by default in its Pixel camera app. It also stopped calling its adjustments &#34;beauty&#34; filters.", "posttime": "2021-08-10 06:47:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,皮肤,photo,twitter", "title": "Twitter 的照片裁剪算法偏向于拥有更苗条、更年轻的面孔和更白皙的皮肤的人；一位研究人员因这一发现获得了 3,500 美元的奖金", "title_en": "Twitter's photo cropping algorithm favors people with slimmer, younger-looking faces, and lighter skin; a researcher was awarded $3,500 for the discovery", "transed": 1, "url": "https://www.cnet.com/tech/mobile/twitter-ai-bias-contest-shows-beauty-filters-hoodwink-the-algorithm/", "via": "", "real_tags": ["算法", "皮肤", "photo", "twitter"]}]