[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1070652, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十几岁时，我阅读了大量质量参差不齐的科幻小说。黄金时代的东西尤其擅长思想和稍微挥手的科学。对人类的工作方式没有那么强烈。无论如何，多年来，人们获得了一些很酷的科学知识的个人词汇（有时来自其他来源 - 我也阅读了很多流行科学），这些词汇可以影响一个人的世界观。这是我的一些摘录。如果这些中的任何一个为您触发了幸运 10,000 时刻，那么这就是我所要求的。如果您想列出自然界的恩赐清单，核反应堆可能不是您的首要考虑。这有点令人费解，因此第一次发现全天然的、绝不是人造的核裂变反应堆是存在的。在地球上。在奥克洛，加蓬，确切地说是中非。绝对清楚，这不是科幻小说。据任何人所知，它只发生在 17 亿年前的那个地方，尽管“奔跑”（那里的正确词是什么？）几十万年。将具有正确地下水特征的矿石并置。太惊人了。更重要的是，由于维持反应所需的适当同位素的比例自然下降，因此它不可能发生得更晚。到目前为止，没有人建造过太空电梯，也没有人希望很快建造。然而，阻止它发生的是工程，而不是物理学，而且鉴于我们作为一个物种解决重大工程挑战的倾向，如果我们不首先消灭自己，我们似乎也将不可避免地解决这个问题。一般的想法是，如果将重物系在绳子上并绕着重物旋转，绳子就会拉紧。通过将一些具有史诗般抗拉强度和长度的绳子一端连接到地球，另一端连接到空间站，地球确实会在空间站周围鞭打并拉紧绳子。然后就可以爬上绳子了。或者，更确切地说，在它上面附加一个升降机并让它爬上绳子。\n虽然这听起来很可笑，但物理原理是可行的。有一些棘手的地方，字符串的必要强度可能是其中最少的，但理论上它确实加起来了。更好的是，它不受火箭方程式的束缚，很快就会为电力支付美元，而不是为进入太空的火箭燃料支付数百万美元。至少现在当我们发射火箭时，我们并不总是把整个东西都扔掉。在数学的更直接可及的一端，我仍然认为你可以拥有一个真正的物理事物，它有一个表面和一个边缘，这真是太神奇了。令人欣慰的是，当您在其中进行各种削减时，您会得到相应令人惊讶的结果。由于莫比乌斯带实际上是一个二维物体（就像任何一张纸一样），考虑一个人是否可以用三维物体做同样的事情自然很有趣。结果只能在概念上完成，因为我们无法自由访问第四空间维度。然而结果，如果可以的话，看起来有点像一个克莱因瓶。早在 1989 年，当我还是一个崭露头角的计算机书呆子（以及科幻书呆子）时，有一本很棒的书，写的是一位业余爱好者在他的网络中追踪计算机黑客。那本书是克利福德斯托尔的布谷鸟蛋。除了是互联网的官方珍品之一，他现在还以销售玻璃克莱因瓶为副业。我有一个（我妻子的礼物）并且很喜欢它。购买过程充满了来自 Cliff 的可爱的个人风格，因此将我的计算和科学热情结合在一起是令人愉快的。没有什么能比光走得更快。一些科幻书籍对此进行了掩饰，而他们的太空船无论如何都会这样做。其他人把它作为一个基本的情节点（因此，即使是靠近恒星的旅行也需要几十年的时间）。我不认为我是星球大战时代唯一觉得极限有点令人沮丧的孩子。\n然而，发现其中一个警告有点令人惊讶。在真空中不可能比光速快（即通用常数 c），但在其他介质中比光速快是可能的。当这种情况发生时，会产生类似于音爆的效果并发出辐射。特别是，如果用水屏蔽放射性砖，一些发射的 β 粒子将超过光在水中传播的速度并因此辐射光。这是一种相当不错的蓝色阴影。如果你把两块金属靠得足够近，就会有一股力量把它们推到剩下的地方。奇怪的是，这真的是从无到有。具体来说，真空，空旷的空间，同时充满了粒子和反粒子，它们可能会突然出现，然后彼此湮灭，就好像他们对整个事情感到遗憾一样。然而，将两块金属放在一起足够近，它们之间就不会有空间让其中一些粒子突然存在。更具体地说，某些波长较长的粒子将没有空间。内部空间和外部空间之间由此产生的差异迫使它们走到一起。兴趣是激起的，特别是对于科幻读者，因为最后一个与一堆不可信但显然可能可能的选项相关，这些选项允许虫洞和曲速驱动器。 Theloopier 科幻小说只是说“哇，自由能源”，并将其用作几乎任何事情的技术借口。\n这个有点深奥。著名数学家约翰康威在生命游戏中提出了一个聪明的想法。在这个遵循（或最好有一个计算机遵循）非常简单的规则，结果是一个非常复杂的世界完全从这些规则中形成，并允许其中的各种惊人的复杂结构。稍微玩一下它会激发各种关于一些终极基础简单物理学与我们周围物理世界令人震惊的复杂性之间可能联系的模糊想法。另一方面，它是一个网格。这导致了首选方向。事物在某些方向上比其他方向更自然地移动。但是可观测宇宙没有这样的首选方向。所以宇宙不是基于网格的。或六边形（向棋盘玩家挥手）或其他任何具有先天首选方向的东西。它似乎齐头并进，不知何故，假设我们在宇宙中的位置并不特别。虽然这与人择原理有轻微的冲突。计算机书呆子对计算机安全有一定的了解。特别是我们通常对加密略知一二。我们大多数人（希望如此）都知道我们不够聪明，无法设计自己的产品，但我们确实掌握了这些功能。此外，一般来说，以正确的方式使用正确的库是一个问题。有一千种方法可以搞砸，但我们尽量不这样做。获取数据，对其进行解密，对其进行一些处理，重新加密，然后将其发送回或继续发送。\n获取一些散列数据，将其与一些存储的散列数据进行比较，并使用结果做出决定但是如果人们不信任对数据进行工作的人怎么办？你当然不能保证安全——他们需要解密数据才能对其进行任何有用的工作，对吗？ … 对？获取加密数据，不要（不能）解密它，在不确切知道该工作是什么或结果是什么的情况下对其进行一些工作，将加密的结果发回给我一种令人兴奋的感觉，尽管我收集它目前也非常低效，所以你不能做很多这样的实际工作。但是我们都知道计算机变得更快了，我们还没有完全完成那段疯狂的旅程，所以谁知道呢？我打赌它很快就会有实际用途。最后，有一个递归的概念，它允许您以非常密集和自我参照的方式表达某些事物。我最初是在大学课程中通过这个完全非技术性的例子向我介绍的：A：嗯，我的祖先是我的妈妈和爸爸，然后是我双方的祖父母，然后是我的曾祖父母，等等在。这是一个相当松散的定义，最后的“等等”不是很令人满意，但这很难在日常英语中有效地表达。但递归定义是这样的：", "note_en": "As a teenager I read an unholy quantity of sci fi  of variable quality. Thegolden age stuff in particular is strong on ideas and slightly hand-waving science. Not so strong on how humans work.Anyway, over the years one acquires a little personal vocabulary of cool sciencey stuff (sometimes from other sources - I read a lotof pop science too) that colours one’s view of the world. Here are a few excerpts from mine.\n If any of these trigger a  Lucky 10,000 moment for you then that’s all I ask.\n  If you’re trying to come up with a list of the natural world’s bounty, a nuclear reactor is probably not to theforefront of your mind. It’s a bit brain-bending therefore the first time one discovers that an all-natural in no way man-made nuclear fission reactoris a thing that existed. On Earth. In Oklo, Gabon, central Africa to be exact. To be absolutely clear, this is  notscience fiction.\n As far as anyone knows it only happened in that one place 1.7 billion years ago albeit “running” (what’s eventhe right word there?) for several hundred thousand years.\n That juxtaposition of an ore with the right groundwater characteristics. It’s astonishing. Even more so as it couldn’thappen much later due to the naturally declining proportion of the appropriate isotope necessary to sustain the reaction.\n  So far nobody has built a  space elevator or expects to any time soon. It’sengineering, rather than physics that prevents it from happening though, and given our propensity as a species for solvingbig engineering challenges, it seems inevitable we’ll solve this one too if we don’t wipe ourselves out first.\n The general idea is that if one ties a weight to a string and whirls the weight around and around, the string is held taut. Bytying some string of epic tensile strength and length at one end to earth and the other end to a space station the earth will indeed whip thespace station around and around and hold the string taut. One can then climb up the string. Or, rather, attacha lift to it and have that climb the string.\n Farcical though this sounds, the physics work out. There are tricky bits, and the necessary strength of the string is possiblythe  least of them, but it does all add up in theory. Even better, it’s not subject to  the tyranny of the rocket equation soone would pay dollars for electricity instead of millions for rocket fuel to get into space.\n At least nowadays when we launch a rocket  we don’t always throw the whole thing away.\n  Down on the more immediately accessible end of mathematics, I still think it’s kind of amazing that you can have a real physical thing thathas  one surface and one edge. It’s kind of satisfying that when you then make various cuts in it you getcorrespondingly  surprising results.\n Since a Möbius strip is effectively a 2 dimensional object (in the same way that any piece of paper is) it’snaturally fun to think about whether one could do the same thing with a three dimensional object. The resultcan, alas, only be done  conceptually as we don’t have free access to a fourth spacial dimension. Howeverthe result, if one could, would look a bit like a  Klein Bottle.\n Back in 1989 when I was a budding computer nerd (as well as a sci fi nerd) there was a terrific book written aboutan amateur tracking down a computer hacker in his network. That book was  The Cuckoo’s Egg by Clifford Stoll. Aside from being one of the internet’sofficial treasures he nowadays has a sideline in selling  glass Klein Bottles.\n I have one (a gift from my wife) and adore it. The purchasing process was full of lovely personal touchesfrom Cliff so the whole tying together of my computing and scientific enthusiasms was delightful.\n  Nothing can go faster than light. Some sci fi books rather gloss over this and their space ships just do anyway. Othersmake it a fundamental plot point (travel to even close stars thus takes decades). I don’t suppose I’m the only childof the Star Wars era who finds the limit a bit frustrating.\n It’s a bit surprising, though, to discover one of the caveats; it’s not possible to go faster than light’s speedin a vacuum (i.e. the universal constant  c) but it  is possible to go faster than the speed of light in some othermedium.  When this happens an effect analagous to a sonic boom occurs and radiation is emitted.\n In particular, if you shield a radioactive brick with water, some of the emitted beta particles will exceed the speedthat light travels at in water and radiate light as a consequence. It’s a rather nice shade of blue.\n  If you put two pieces of metal close enough together there’s a  force that will push them the rest of the way.Bizarrely this comes, literally, out of nothing.\n Specifically, the vacuum, empty space, is simultaneously teeming with particles and antiparticles that probabilisticallypop into existence and then annihilate each other as if they regretted the whole thing.\n Put two pieces of metal close enough together, however, and there won’t be room between them for some of those particles to pop intoexistence. More specifically, there won’t be room for some of the particles with longer wavelengths. Theresulting discrepancy between the inner and outer spaces is what forces them together.\n The interest is piqued, particularly for sci fi readers, by the fact that it’s\n  That last one is relevant to a bunch of implausible-but-apparently-maybe-possible options inrelativity that allow for  wormholes and  warp drives. Theloopier sci fi just goes “whoo, free energy,” and uses it as a technobabble excuse for pretty much anything.\n  This one’s a bit more esoteric. There’s a clever idea from the famous mathematician  John Conway ofthe  Game of Life. In this one follows (or preferably has a computer follow) terrifically simple rules and the result is asuperbly complicated world springing fully formed out of those rules and allowing for all sortsof  astoundingly complex constructions within it.\n Playing around with it for a bit inspires all sorts of fizzy ideas about the possible connections between some ultimate underlying simple physicsand the astounding complexity of the physical world around us.\n On the other hand it’s a grid. That results in preferred directions. Things move more naturally in some directions rather than others. But the  observable universe has no such preferred direction. So theuniverse is not based on a grid. Or hexagons ( waves to the board-gamers) or likely anything else with innate preferred directions.\n It seems to go hand in hand, somehow, with the assumption that where we are in the universe isn’t anywhere special. Though that is  very mildly inconflict with the  anthropic principle.\n  Computer nerds have a passing familiarity with computer security. In particular we usually know a bit about encryption. Most ofus (hopefully) know we’re not smart enough to design our own, but we do have a good grip on the capabilities.\n   Also, in general, it’s a matter of using the right library the right way. There are a thousand ways to screw it up, but we try not to.\n  Get the data, decrypt it, do some work on it, re-encrypt it, and send it back or onward.\n Get some hashed data, compare it against some stored hashed data, and use the result to make a decision\n But what if one doesn’t trust the person doing the work on the data? Surely you can’t keep that safe - they’ll need to decrypt thedata in order to do any useful work on it, right? … Right?\n  Get the encrypted data, don’t (can’t) decrypt it, do some work on it without knowing exactly what that work is or what the result is, send the encrypted results back\n Kind of mind-blowing to me, though I gather that it’s currently also mind-blowingly inefficient so you can’t do much practical work like this. But weall know how rapidly computers got faster and we’re not quite done with that wild ride yet so who knows? I’d bet on it having practicaluses some time soon.\n  Finally, there is a notion of  recursion which allows you to express certain things in a very denseand self-referential way. I was originally introduced to it with this entirely non-technical example in a college course:\n A: Well, my ancestors are my Mum and Dad and then my grandparents on both sides, and then my great-grandparents for all of them, and so on.\n It’s a rather loose definition and not very satisfying with that “ and so on” at the end, but that’s hard to express  efficiently inevery day English. But the  recursive definition is this:", "posttime": "2021-07-30 23:32:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书呆子,cool,可能", "title": "书呆子酷杂项", "title_en": "A Nerd Cool Miscellanea", "transed": 1, "url": "https://paperstack.com/nerd_cool/", "via": "", "real_tags": ["书呆子", "cool", "可能"]}, {"category": "", "categoryclass": "", "imagename": "0ac35385bc22ee9eaf2981d956bbf644.jpeg", "infoid": 1070651, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想谈谈多年来一直对我有用的简单经验法则：“如果您的数据依赖于其他数据，请尽量不要存储它。”如果你遵循这个规则，你可以更快地交付你的代码，主要是因为你避免了漫长而痛苦的数据迁移。回到上面的引述，“静止的数据比运动的数据更危险。” “静态数据”通常是指存储在磁盘上的数据，但它也可以是通过代码更新保留在系统中的任何数据。例如，在 Web 应用程序的上下文中，PostgreSQL 数据库中的行将是“静止的”。或者，当数据从数据库中获取、转换和提供时，我们可以说它在应用程序的内存中“处于运动中”。它不容易版本化。您主动运行的 Web 应用程序的数据库可能存储了一些快照，但它不像您的代码那样递增版本化。更新代码应该比手动弄乱数据库更危险。它的格式不容易改变。当您决定更改数据库列的字段时，或者当您决定在 ElasticSearch 中使用 float 而不是 int 时，进行这些更改可能会非常痛苦。您可能需要编写自定义脚本或执行昂贵的重新索引工作。相反，更改处理内存中数据的代码通常既简单又安全。希望它甚至有单元和集成测试。数据具有依赖性。您的代码依赖于数据，而不是相反。因此，当您更新数据格式时，您需要将该更改与依赖它的代码同步。您可能还需要一个数据回滚计划，以防出现问题。通常，当您的应用程序运行时，存储在内存中的数据是短暂的——您不会依赖于它在那里的任何时间长度。设备和服务器重启将清除所有内存数据，这没关系。\n由于您的代码主动处理的数据是短暂的，因此我们可以不受惩罚地进行代码更改。只要新版本的代码与其自身（以及它所依赖的危险持久数据）一致，那么更改就很容易了。规则：“当您拥有依赖于其他数据的数据时，请尽量不要存储它” 例如，假设您正在构建一个电影评论应用程序。在您的数据库中，对于每个评论，您存储一个名为 num_stars 的字段，它只是一个介于 1 和 5 之间的整数。然后，在开发后期，产品团队要求一个新功能，该功能根据评论的数量在评论上显示颜色星星。 1 星和 2 星将显示为红色，3 星将显示为黄色，而 4 和 5 星将显示为绿色。有几种方法可以构建此功能。您可以在数据库中创建一个名为 color 的新字段。每当创建评论时，您只需检查星星的数量，并基于此生成颜色字段并存储它。现在，当用户从数据库中提取该评论时，它已准备好使用生成的颜色字段！每当从数据库请求评论时，应用程序代码都会提取评论数据，然后通过进行事后计算生成颜色。这两个选项可能同样容易编码和发布。选项 1 的问题只会在稍后出现。让我们来看看一些潜在的问题。我们决定需要五种颜色。 2 星的评论现在是橙色的，而 4 星的评论是黄绿色的。因为存储了颜色数据，所以我们需要编写一个脚本来根据依赖（num_stars）更新数据库中的所有颜色。如果我们采用选项 2，它将像更新和部署一些代码一样简单。\n部署了一个错误。一个新的开发人员误解了在数据库中生成和插入颜色字段的代码的用途。因此，他们部署了一个小错误，无论 num_stars 字段如何，都将颜色设置为始终为绿色。再次发现错误后，我们将需要编写一个潜在危险的脚本或查询来修复错误的历史数据。我们是否使用了选项 2，这将是一个简单的代码修复。存储直接依赖于其他数据的内容是否是个好主意？例如，有时出于性能原因需要这样做。假设您有一些原始播客音频数据，并且您希望能够向用户显示转录内容。每次用户想要查看转录内容时，重新转录音频都太慢且成本太高。在这种情况下，我们只需要硬着头皮存储计算出的文本数据。如果您有任何问题或意见，请在 Twitter @q_vault 上关注我。如果我在文章中犯了错误，请告诉我，以便我改正！", "note_en": "I want to talk about a simple rule of thumb that has served me well over the years: “ If you have data that depends on other data, try not to store it.” If you follow this rule, you can deliver your code faster, mainly because you avoid lengthy and painful data migrations.\n Back to the quote above, “Data at rest is more dangerous than data in motion.” By “data at rest” I typically mean data stored on disk, but it can also be any data that persists within your system through code updates.\n For example, in the context of a web application, the rows in a PostgreSQL database would be “at rest”. Alternatively, when data is fetched from the database, transformed, and served we can say it’s “in motion” while in the app’s memory.\n   It’s not easily versioned. The database of your actively running web app might have some snapshots stored, but it’s not as incrementally versioned as your code. It should be less dangerous to update code than it is to manually muck with a database.\n It’s format isn’t easily changed. When you decide to change the field of a database column, or when you decide to use a  float instead of an  int in ElasticSearch, it can be a significant pain to make those changes. You might need to write a custom script or do an expensive reindexing job. On the contrary, changing your code that deals with data in memory is typically easy and safe. Hopefully, it even has unit and integration tests.\n Data has dependencies. Your code is dependent on the data, not the other way around. As such, when you do update your data’s format, you need to synchronize that change with the code that depends on it. You’ll also probably need a rollback plan for the data in case something goes wrong.\n  Conventionally, data stored in memory, while your application is running, is ephemeral – you won’t depend on it being there for any length of time. Device and server restarts will wipe all in-memory data out, and that’s okay.\n Since data being actively acted in by your code is ephemeral, we can make code changes with impunity. As long as the new version of the code is consistent with itself (and the dangerous persistent data it relies on) then changes are easy.\n The rule: “When you have a piece of data that’s dependent on other data, do your best not to store it”\n Let’s say for example, that you’re building a movie review app. In your database, for each review, you store a field called  num_stars, which is just an integer between 1 and 5. Then, later in development the product team asks for a new feature that shows a color on the review depending on the number of stars. 1 and 2 stars will be shown as red, 3 as yellow, and 4 and 5 are green. There are a couple ways you can build this feature.\n  You  could create a new field in your database called  color. Whenever a review is created, you simpy check the number of stars, and based on that you generate the  color field and store it. Now when a user pulls that review from the database it’s ready to go with the  color field generated!\n  Whenever a review is requested from the database, the application code pulls the review data, then generates the  color by doing a  post-hoc calculation.\n  Both options are probably equally easy to code and ship. The problems with option 1 will only show up later. Let’s look at a few potential issues.\n We decide we want five colors. Reviews with 2 stars will now be orange, while 4-star reviews will be a yellow-green mush. Because the color data is  stored, we need to write a script to go update all the colors in the database based on the dependency ( num_stars). Had we taken option 2, it would be as simple as updating and deploying some code.\n A bug is deployed. A new developer misunderstood the purpose of the code that generates and inserts the  color field in the database. As such, they deployed a small bug that sets the color to always be  green regardless of the  num_stars field. Once the bug is discovered, again, we’ll need to write a, potentially dangerous, script or query to fix bad historical data. Has we used option 2, it would be a simple fix in code.\n Is it ever a good idea to store something that’s directly dependent on other data?\n  For example, sometimes it’s necessary for performance reasons. Say you have some raw podcast audio data, and you want to be able to show users the transcript. It would be far too slow and expensive to re-transcribe the audio each time a user wants to look at the transcript. In cases like this, we need to just bite the bullet and store the calculated text data.\n Follow and hit me up on Twitter  @q_vault if you have any questions or comments. If I’ve made a mistake in the article, please  let me know so I can get it corrected!", "posttime": "2021-07-30 23:32:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "保持,raw,数据", "title": "让您的数据保持原始状态", "title_en": "Keep Your Data Raw at Rest", "transed": 1, "url": "https://qvault.io/clean-code/keep-your-data-raw-at-rest/", "via": "", "real_tags": ["保持", "raw", "数据"]}, {"category": "", "categoryclass": "", "imagename": "1d6f379179e7eb946aa4c41932814ad5.jpeg", "infoid": 1070650, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，该县的病例继续增加，但速度较慢。过去一周，每日原始病例数增加了 17%，达到 3,248。尽管洛杉矶县的人口仅占该州居民的 25% 左右，但这大约是周四加利福尼亚州记录的 7,458 例病例的一半。根据洛杉矶县公共卫生主任芭芭拉·费雷尔的说法，推动这一增长的是西区更富裕的社区，包括比佛利山庄、贝莱尔、比佛利克雷斯特、威尼斯、Studio City、谢尔曼奥克斯和恩西诺。洛杉矶中部地区较高的病例率推动了冬季激增 见下图。根据公共卫生数据，洛杉矶的平均每日病例率已上升至每 10 万人 15.7 例。据县官员称，这一上升主要是由于洛杉矶白人居民的病例率增加了五倍多，从 6 月 19 日的每 10 万例 18 例上升到 7 月 17 日的每 10 万例 83 例。相比之下，该县白人居民的病例率增加了四倍。黑人和亚洲人口，拉丁裔居民增加了近三倍。 “白人居民——传统上的病例率低于拉丁裔和亚裔居民——现在仅次于黑人居民（按原始病例率计算），”费雷尔说。根据费雷尔的说法，该市更富裕地区的增长是由更年轻、接种疫苗较少的人口推动的。 “这些社区的传播主要是在年轻人中传播，”她说，然后推测增加背后的其他因素。她大胆地说，这些人是“有资源的人，现在可以出去走走更多”，去餐馆、社交聚会或大型聚会，即使他们没有接种疫苗。当被问及该县大约 150 万未接种疫苗但即将开始上学的儿童面临的危险时，费雷尔称赞了学校管理人员和教师在夏季所做的努力，并说：“没有考虑关闭学校。”", "note_en": "cases continued to rise in   County on Thursday, albeit more slowly. The raw number of daily cases rose 17% in the past week, to 3,248. That’s roughly half of the 7,458 cases recorded in California on Thursday, even though Los Angeles County’s population accounts for only roughly 25% of the state’s residents.\n Driving this rise, according to Los Angeles County Public Health Director Barbara Ferrer, have been more affluent communities on the West Side including Beverly Hills, Bel-Air, Beverly Crest, Venice, Studio City, Sherman Oaks, Encino. The winter surge was driven by higher case rates in Central L.A. See map below.\n    L.A.’s average daily case rate had risen to 15.7 per 100,000, according to Public Health Data. That rise, according to County officials has been driven chiefly by a more than fivefold rise in case rates among white residents of L.A., from 18 per 100,000 on June 19 to 83 per 100,000 on July 17. That’s compared with a fourfold increase among the county’s Black and Asian populations and a nearly threefold increase among Latino residents.\n  “White residents — who have traditionally experienced lower case rates than LatinX and Asian residents — are now second (in raw case rate) only to Black residents,” said Ferrer.\n     According to Ferrer, the increase in more affluent areas of the city is being driven by a younger, less-vaccinated population. “Transmission in these neighborhoods is mostly being spread among young adults,” she said, before speculating on other factors behind the increase. She ventured that these are “people with resources who can now go out and about more,” to restaurants, social gatherings or large parties, even if they are not vaccinated.\n Asked about the danger to the county’s approximately 1.5 million children below 12, who are not cleared for vaccination but about to start school, Ferrer lauded the efforts of school administrators and teachers over the summer and said, “There’s no consideration for closing schools.”", "posttime": "2021-07-30 23:32:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推动,angeles,居民", "title": "白人富裕社区推动洛杉矶 Covid 激增", "title_en": "Los Angeles Covid Surge Being Driven by White, Affluent Neighborhoods", "transed": 1, "url": "https://deadline.com/2021/07/los-angeles-covid-surge-driven-by-white-affluent-neighborhoods-1234802675/", "via": "", "real_tags": ["推动", "angeles", "居民"]}, {"category": "", "categoryclass": "", "imagename": "b6ea67c39681ae8b2244e3b1c40a798a.jpg", "infoid": 1070649, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下个月，在因大流行病推迟一年后，联合国政府间气候变化专门委员会 (IPCC) 将开始发布自 2013 年以来对人为全球变暖的首次重大评估。该报告的第一部分将于8 月 9 日，世界将在 8 年内发生翻天覆地的变化，升温超过 0.3°C，比工业化前水平高出近 1.3°C。天气变得更加恶劣，海平面明显升高，山地冰川和极地冰层急剧缩小。经过多年的有限行动，许多国家在相关公众和企业的推动下，似乎愿意遏制其碳排放。但随着气候科学家面对这一令人震惊的现实，帮助他们预测未来的气候模型变得有点过于危言耸听了。许多世界领先的模型现在都在预测变暖速度，大多数科学家，包括模型制作者自己，都认为这种速度快得令人难以置信。在联合国报告发布之前，科学家们争先恐后地了解出了什么问题，以及如何将这些在其他方面比其前辈更强大、更值得信赖的模型转变为对决策者有用的指导。美国宇航局戈达德太空研究所所长加文施密特说：“在过去一年左右的时间里，我们无法避免这种情况变得很明显。”在 IPCC 的每份重要报告之前，世界气候建模中心都会运行一组未来情景，计算不同的全球排放路径将如何改变气候。这些原始结果在耦合模型比对项目 (CMIP) 中编译，然后直接输入 IPCC 报告。在其他科学家使用它们来评估气候变化的影响、保险公司和金融机构预测对经济和基础设施的影响以及经济学家计算碳排放的真实成本时，这些结果仍然存在，首席气候建模师 Jean-François Lamarque 说。国家大气研究中心 (NCAR) 和 CMIP 的新主任。 “这不是象牙塔式的锻炼。”过去，大多数模型预测的“气候敏感性”——当大气二氧化碳 (CO 2) 比工业化前时期翻倍时所预期的变暖——在 2°C 到 4.5°C 之间。去年，一篇具有里程碑意义的论文在很大程度上避开了模型，而是使用了包括持续变暖趋势在内的已记录因素，计算出可能的气候敏感性在 2.6°C 到 3.9°C 之间。但是来自主要中心的许多新模型显示升温超过 5°C——超出这些范围令人不舒服。这些模型也与过去的气候记录不一致。例如，科学家们使用 NCAR 的新模型来模拟 20,000 年前最近一次冰河时代的最冷点。广泛的古气候记录表明，与工业化前时代相比，地球冷却了近 6°C，但该模型在冰河时代 CO 2 水平较低的情况下，温度下降了近两倍，这表明它对 CO 的起伏过于敏感2. “这显然超出了地质数据所表明的范围，”亚利桑那大学古气候学家、该作品的合著者杰西卡蒂尔尼说，该作品发表在地球物理研究快报上。 “它完全在那里。”为了找出原因，建模人员探索了模拟的本质，重点是它们对云的表示，长期是气候变化的通配符。这些模型不能直接模拟云，因此它们依靠已知的物理学和观测来估计云的属性和行为。在之前的模型中，冰晶在南太平洋和其他地方的中纬度地区构成的低云比卫星观测似乎证明的要多。与水滴相比，冰晶反射的阳光更少，因此随着这些云被加热和冰融化，它们变得更具反射性并导致冷却。新模型从包含更多过冷水的更逼真的云开始，这允许由变暖驱动的其他动态——干燥空气从上方的渗透和湍流的抑制——使云变薄。但这一修复让科学家们发现了先前被错误的冷却趋势所抵消的另一个偏见。根据劳伦斯利弗莫尔国家实验室云科学家蒂莫西迈尔斯的一项研究，在旧的和新的气候模型中，热带地区形成的片状积云会随着变暖而变薄，从而产生比卫星观测显示的更多的热量. “尽管气候的一个特征现在更加真实，但另一个一直存在偏见的特征已经被揭示出来，”迈尔斯说。\n低 中 高 到 2081–2100 (˚C) 0 1 2 3 4 5 6 7 排放情景 受限的原始 2021 模型 受限的原始 2013 模型 当建模者暴露这种偏差时，超级计算运行已经完成，IPCC 报告即将发布完成。此外，许多热模型在整体上非常好地模拟了气候，在捕捉偏远海洋盆地之间的大气联系和降雨分布方面比它们的前辈做得更好。 “你想要一种方法，你可以将这些模型用于他们所拥有的东西，而不会被他们的气候敏感性所困扰，”施密特说。因此，IPCC 团队可能会使用现实——过去几十年世界实际变暖——来限制 CMIP 的预测。几篇论文已经展示了这样做如何可以将模型预测的不确定性降低一半，并降低其最极端的预测。对于 2100 年，在最坏的情况下，这将使预计比工业化前水平升高 5°C 的原始温度降低至 4.2°C。法国国家气象研究中心的气候科学家 Aurélien Ribes 说，这对建模人员来说是个好消息，但同时也是一个明显而令人沮丧的迹象，表明全球变暖已经持续了足够长的时间，可以帮助他们绘制自己的路径。 “现在的观察结果为气候变化提供了一个清晰的视角。” IPCC 报告还可能会呈现不同升温幅度（2°C、3°C、4°C）的空间影响，而不是说明这些影响的感受速度。这种基于热量的技术在 2018 年的 IPCC 临时报告中运作良好，关于升温 1.5°C 的影响，并且会保留来自热模型的良好信息，即使他们认为这些阈值来得太早。建模者希望下次做得更好。 Lamarque 说，他们可能会在构建它们时针对最近的古气候测试新的模拟，而不仅仅是历史变暖。他还建议开发过程可以从更多的时间中受益，每十年左右更新一次，而不是每 7 年的当前报告间隔。将建模过程分为两个部分可能会有所帮助，一个方向专注于科学实验——当大量气候敏感性有帮助时——另一个方向是为政策制定者提供最佳估计。 “在一个实体下协调这两种方法并不容易，”Lamarque 说。康奈尔大学气候科学家安吉琳·彭德格拉斯 (Angeline Pendergrass) 帮助开发了一种通过模型结果的准确性和独立性对其进行加权的技术，她说，一群致力于将模型转化为有用预测任务的研究人员也可以提供帮助。 “在基础科学和我正在使用的工具之间切换是一项实际工作，”她说。太平洋西北国家实验室的气候科学家、CMIP 气候预测的负责人之一克劳迪娅·特巴尔迪 (Claudia Tebaldi) 表示，目前，政策制定者和其他研究人员需要避免对最新模型预测的无限制极端变暖投入过多的关注。将这一信息传达出去将是一个挑战。 “这些问题在实践中不能很好地转化，”她说。 “对于希望对西部水域进行一些投影的人来说，这将很难理解。”\n已经出现了使用 CMIP 对 2100 年不受约束的最坏情况情景的科学论文，加剧了已经有充分理由的恐惧。但这种做法需要改变，施密特说。 “即使是近期的数字也非常可怕——而且是错误的。” *更正，7 月 30 日，上午 9 点：这个故事的先前版本错误地陈述了受观测限制的预计变暖的基线；这是前工业时代，而不是 1986—2005 年。", "note_en": "Next month, after a yearlong delay because of the pandemic, the U.N. Intergovernmental Panel on Climate Change (IPCC) will begin to release its first major assessment of human-caused global warming since 2013. The report, the first part of which will appear on 9 August, will drop on a world that has starkly changed in 8 years, warming by more than 0.3°C to nearly 1.3°C above preindustrial levels. Weather has grown more severe, seas are measurably higher, and mountain glaciers and polar ice have shrunk sharply. And after years of limited action, many countries, pushed by a concerned public and corporations, seem willing to curb their carbon emissions.\n But as climate scientists face this alarming reality, the climate models that help them project the future have grown a little too alarmist. Many of the world’s leading models are now projecting warming rates that most scientists, including the modelmakers themselves,  believe are implausibly fast. In advance of the U.N. report, scientists have scrambled to understand what went wrong and how to turn the models, which in other respects are more powerful and trustworthy than their predecessors, into useful guidance for policymakers. “It’s become clear over the last year or so that we can’t avoid this,” says Gavin Schmidt, director of NASA’s Goddard Institute for Space Studies.\n Ahead of each major IPCC report, the world’s climate modeling centers run a set of scenarios for the future, calculating how different global emissions paths will alter the climate. These raw results, compiled in the Coupled Model Intercomparison Project (CMIP), then feed directly into the IPCC report. The results live on as other scientists use them to assess the impacts of climate change, insurance companies and financial institutions forecast effects on economies and infrastructure, and economists calculate the true cost of carbon emissions, says Jean-François Lamarque, a lead climate modeler at the National Center for Atmospheric Research (NCAR) and CMIP’s new director. “This is not an ivory tower type of exercise.”\n In the past, most models projected a “climate sensitivity”—the warming expected when atmospheric carbon dioxide (CO 2) is doubled over preindustrial times—of between 2°C and 4.5°C. Last year, a landmark paper that largely  eschewed models and instead used documented factors including ongoing warming trends calculated a likely climate sensitivity of between 2.6°C and 3.9°C. But many of the new models from leading centers showed warming of more than 5°C—uncomfortably outside these bounds.\n The models were also out of step with records of past climate. For example, scientists used the new model from NCAR to simulate the coldest point of the most recent ice age, 20,000 years ago. Extensive  paleoclimate records suggest Earth cooled nearly 6°C compared with preindustrial times, but the model, fed with low ice age CO 2 levels, had temperatures plummeting  by nearly twice that much, suggesting it was far too sensitive to the ups and downs of CO 2. “That is clearly outside the range of what the geological data indicate,” says Jessica Tierney, a paleoclimatologist at the University of Arizona and a co-author of the work, which appeared in  Geophysical Research Letters. “It’s totally out there.”\n To find out why, modelers  probed the guts of the simulations, focusing on their representation of clouds, long the wild card of climate change. The models can’t simulate clouds directly, so they rely on known physics and observations to estimate cloud properties and behavior. In previous models ice crystals made up more of the low clouds in the midlatitudes of the southern Pacific Ocean and elsewhere than satellite observations seemed to justify. Ice crystals reflect less sunlight than water droplets, so as these clouds heated and the ice melted, they became more reflective and caused cooling. The new models start with more realistic clouds containing more supercooled water, which allows other dynamics driven by warming—the penetration of dry air from above and a subduing of turbulence—to thin the clouds.\n But that fix has allowed scientists to spy another bias previously countered by the faulty cooling trend. In both the old and new climate models, the patchy cumulus clouds that form in the tropics thin out in response to warming, allowing in more  heat than satellite observations suggest, according to a study by Timothy Myers, a cloud scientist at Lawrence Livermore National Laboratory. “Even though one feature of the climate is now more realistic, another that’s persistently biased has been revealed,” Myers says.\n  Low                                          Medium                                          High       Warming by 2081–2100 (˚C)    0  1  2  3  4  5  6  7    Emission scenarios            Constrained       Raw    2021 models           Constrained       Raw    2013 models\n  By the time modelers exposed that bias, the supercomputing runs were already done and the IPCC report was nearing completion. And many of the hot models otherwise simulate the climate extremely well overall, doing a better job than their predecessors at capturing atmospheric connections between remote ocean basins and the distribution of rainfall. “You want a way you can use those models for what they have without getting stuck with their climate sensitivity,” Schmidt says.\n So the IPCC team will probably use reality—the actual warming of the world over the past few decades—to constrain the CMIP projections. Several papers have shown how doing so can reduce the  uncertainty of the model projections by half, and  lower their most extreme projections. For 2100, in a worst-case scenario, that would reduce a raw 5°C of projected warming over preindustrial levels to 4.2°C. It’s good news for the modelers—but also a clear, and dismaying, sign that global warming has gone on long enough to help chart its own path, says Aurélien Ribes, a climate scientist at France’s National Centre for Meteorological Research. “Observations now provide a clear view for what climate change will be.”\n The IPCC report is also likely to present the spatial impacts of different amounts of warming—2°C, 3°C, 4°C—rather than saying how quickly those impacts will be felt. That heat-based technique worked well in an interim IPCC report in 2018, on the impacts of 1.5°C of warming, and would preserve good information from the hot models, even if they suggest these thresholds will come too soon.\n The modelers hope to do better next time around. Lamarque says they may test new simulations against recent paleoclimates, not just historical warming, while building them. He also suggests that the development process could benefit from more time, with updates every decade or so rather than the current report interval of every 7 years. And it could be helpful to divide the modeling process in two, with one track focused on scientific experimentation—when a large range of climate sensitivities is helpful—and the other on providing a best estimate to policymakers. “It’s not easy to reconcile these two approaches under a single entity,” Lamarque says.\n A cadre of researchers dedicated to the task of translating the models into useful projections could also help, says Angeline Pendergrass, a climate scientist at Cornell University who helped develop one technique for  weighting the model results by their accuracy and independence. “It’s an actual job to go between the basic science and the tools I’m messing around with,” she says.\n For now, policymakers and other researchers need to avoid putting too much stock in the unconstrained extreme warming the  latest models predict, says Claudia Tebaldi, a climate scientist at Pacific Northwest National Laboratory and one of the leaders of CMIP’s climate projections. Getting that message out will be a challenge. “These issues don’t translate very well in practice,” she says. “It’s going to be hard for people looking to make some projection of a water basin in the West to make sense of it.”\n Already scientific papers are appearing using CMIP’s unconstrained worst-case scenarios for 2100, adding fire to what are already well-justified fears. But that practice needs to change, Schmidt says. “You end up with numbers for even the near-term that are insanely scary—and wrong.”\n *Correction, 30 July, 9 a.m.: A previous version of this story misstated the baseline for projected warming constrained by observations; it is preindustrial, not 1986— 2005.", "posttime": "2021-07-30 23:31:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "气候,panel,模型", "title": "联合国气候小组面临令人难以置信的未来变暖预测", "title_en": "U.N. climate panel confronts implausibly hot forecasts of future warming", "transed": 1, "url": "https://www.sciencemag.org/news/2021/07/un-climate-panel-confronts-implausibly-hot-forecasts-future-warming", "via": "", "real_tags": ["气候", "panel", "模型"]}, {"category": "", "categoryclass": "", "imagename": "8e2982f947bd901eb9654e7858ce08c3.jpg", "infoid": 1070647, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "神圣的乐队：詹姆斯·罗姆（James Romm）着为拯救希腊自由而战的三百个底比斯情人； Scribner，320 页，28 美元 在柏拉图的座谈会中，一场酒会的戏剧化，每位客人都发表了赞美爱的演讲。第一个，某个斐德罗，描述了爱神（爱神和性爱的原始力量的希腊名字）如何成为不可战胜的男性恋人军队的基础（本杰明乔维特翻译）：如果有只有通过某种方式使一个国家或一支军队应该由情人和他们的爱人组成，他们才会成为自己城市最好的统治者，避免所有的耻辱，并在荣誉上互相效仿；并肩作战，虽然寥寥无几，却能胜过天下。晚上发生在公元前 416 年，在伯罗奔尼撒战争期间，但柏拉图在几十年后，即斯巴达击败雅典之后创作了他的作品。虽然斐德罗的演讲似乎描述了一支假想的军队，但即使对于柏拉图的早期读者来说，这似乎也不是时代错误或预言。他们会知道一个真正的精英军事单位，底比斯圣乐队，由 150 对结合的男性夫妇组成。三个辉煌的十年不败，乐队“虽然少数”确实“克服了”，打破了欺凌斯巴达的铁腕束缚，解放了被奴役的人口。雅典作家嘲笑底比斯和维奥蒂亚人是乡巴佬，但底比斯神话丰富，产生了赫西奥德和品达等诗人，并吹嘘两个神是土生土长的儿子：狄俄尼索斯，底比斯公主的儿子和赫拉克勒斯/赫拉克勒斯，谁努力了他的不朽之路。在民主的帝国雅典和寡头的极权主义斯巴达之间，底比斯和维奥蒂亚代表了第三种方式，这是民主联邦制的大胆试验，其城市甚至使用共同的铸币。然而，底比斯犯了“调解”的罪行，在波斯入侵期间站在波斯人一边。雅典和斯巴达从未让他们忘记这一点。也许底比斯正在获得第二次成为众人瞩目的机会。底比斯本身有一个新的最先进的博物馆，保罗卡特利奇最近出版了底比斯：古希腊被遗忘的城市。现在是詹姆斯罗姆对神圣乐队的敏感描述。在雅典和斯巴达，男人之间的浪漫、色情和性关系在很大程度上是被认可的和传统的：一对夫妇由 erastes（情人）、年长的伴侣和 eromenos（心爱的人）组成，后者是处于青春期的青年。男子气概; “爱人和他们的爱。”亲斯巴达的雅典历史学家色诺芬似乎不赞成男性与男性的性关系。在古希腊，“酷儿”可以说是坚定不移的异性恋。\n但是，如果正如罗姆指出的那样，在雅典和斯巴达，“男性情欲是&#39;复杂的&#39;”，那么在底比斯和维奥蒂亚，它受到了国家的制裁。男性夫妇可以在赫拉克勒斯自己心爱的伊奥劳斯 (Iolaus) 的坟墓前宣誓，作为 syzygentes——轭伴侣——这个词在别处表示终生的婚姻纽带。它在词源上与“夫妻”有关。 （“配偶”的现代希腊词仍然是 syzygos。）在公元前 379 年将斯巴达军政府赶出底比斯后，底比斯人将注意力转向了防御。底比斯需要一支自己的精英小队来阻止斯巴达的重装步兵（重装步兵）。因此诞生了 300 人的神圣乐队，它的夫妇在 Iolaus 的墓前宣誓了“神圣的”誓言。带领神圣乐队走向伟大的人是伊巴密浓达。他出身低贱的贵族家庭，师从哲学家 Lysis，他是最后一位毕达哥拉斯学派之一。伊巴密浓达不迷信，对世俗财富漠不关心，精通文学，是一位多才多艺的音乐家。他从未结婚或生过孩子。公元前 371 年，在留克特拉之战中，神圣乐队打破了斯巴达至高无上的神话。希腊重装步兵战争是一种正式的事情：每支军队中最强大的部分位于右翼，首先面对对方军队较弱的左翼。伊巴密浓达将他的圣戒放在左边，从上到下打破斯巴达人的力量。溃败是如此彻底，以至于斯巴达国王在战斗中丧生，这是几代人以来第一个这样做的人。伊巴密浓达证明斯巴达是可以打败的；它再也不会上升到军事主导地位。伊巴密浓达和神圣乐队深入斯巴达领土，解放了阿卡迪亚和美西尼亚。后者是希洛人的传统家园，他们是几个世纪以来一直被斯巴达奴役的土著居民。伊巴密浓达不仅释放了该地区的希洛人并邀请散居国外的美西尼亚人返回，而且还为他们建造了一座拥有巨大石墙和公共建筑的城市，建造时间惊人，耗时 85 天。离他们的城市如此近的一座由自由希洛人组成的城墙激怒了斯巴达人，并帮助他们控制住了。但是伊巴密浓达辉煌的职业生涯被打断了；他在胜利中倒下，在公元前 362 年的曼蒂尼亚战役中被斯巴达长矛击中。临终前他没有孩子，他宣布他的胜利，Leuctra 和 Mantinea，是他不朽的女儿。他被埋葬在田野上，旁边是他自己的“挚爱”卡菲索多鲁斯。底比斯几乎立即陷入衰退。公元前 338 年，马其顿的菲利普和他的儿子亚历山大（即将成为大帝）在喀罗尼亚战役中歼灭了神圣乐队。菲利普在底比斯度过了他的青年时代作为人质，据说看到乐队全都破碎并混在一起时哭了。普鲁塔克引用他的话说：“消灭所有那些认为这些人做过或忍受过任何可耻之事的人。”喀罗尼亚战役标志着亚历山大崛起的开始，他最终将底比斯从地图上抹去，除了诗人品达的房子外，所有建筑物都被夷为平地。底比斯在阳光下的时刻已经过去了。罗姆的书不仅详细描述了神圣乐队的历史，而且还阐明了希腊历史上这段阴暗而凶残的自相残杀时期。他还提供了后来对乐队接待的一瞥（例如，维多利亚时代密室同性恋者的灯塔）。罗姆对有趣的角色有着敏锐的洞察力——比如反社会的暴君菲莱的杰森，他把他的长矛变成了神。或者是维奥蒂亚的妓女和传奇美女弗莱恩，她提出用她应得的收益重建亚历山大已经推倒的底比斯城墙，只要城墙上有这样的铭文。 （没有人接受她的提议。）古希腊旅行作家保萨尼亚斯描述了在喀罗尼亚战场的 polyandrion（万人坑）上为纪念神圣乐队而竖立的纪念碑：\n当一个人接近喀罗尼亚时，有一座在与菲利普的战斗中阵亡的底比斯人的坟墓。没有铭文装饰它，但是一座狮子形的纪念碑矗立在它上面，这是这些人精神的最好象征。战斗的确切地点已经被现代遗忘了。 1818 年，一位年轻的英国旅行者在该地区骑行时，以保萨尼亚斯为指南，偶然发现了一块大理石。事实证明，它是一头巨大的大理石狮子的碎片——一块仅重三吨的头部和颈部。半个多世纪后的 1880 年，随着希腊成为一个独立的国家，一位雕刻家被派去重建和安装这头破碎的狮子，他测试了它下面的地面，看看它是否能承受重压。相反，他发现的是一个乱葬坑。一位年轻的希腊考古学家 Panagiotis Stamatakis 从事现代救援考古工作，发现并记录了 254 具骷髅，这一发现使《纽约时报》成为了电报。坟墓被重新覆盖； Stamatakis 在挖掘过程中生病并死亡，他从未发表过他的发现，他的笔记本也被推定丢失了。因为这些骷髅并没有凑足三百左右，甚至有学者怀疑这里是否真的是圣族的墓地。罗姆这本令人大开眼界的故事书中最令人惊讶的地方也许是附录。在雅典学者兼翻译家布雷迪·基斯林 (Brady Kiesling) 的帮助下，罗姆发现这些笔记本仍然存在于希腊考古局的档案中。 Stamatakis 不仅进行了详细的测量，而且还绘制了每一具骨骼的位置和伤口。很难高估这项工作的超前性——例如，考虑一下施利曼在同一个十年中进行的激进挖掘，冲破平淡的历史层级，找到镀金史诗的宝藏。尸体不是用武器或盔甲埋葬的，而是用祭酒杯和柱子埋葬的——体育馆的吸汗器，男性爱的集结地。骷髅，动人的个体，装饰着这本书，在书页上跳舞。在 Stamatikis 的笔记本和一位数字艺术家的帮助下，Romm 能够重建所有骨骼的位置和姿态，这些骨骼排列成六、七行方阵，仿佛是在对抗死亡本身。有几对骷髅，令人动容的是，一个似乎有一只胳膊搭在另一个上面；其他一些似乎在肘部相连。 Panagiotis Stamatakis 笔记本中的草图之一（由希腊文化和体育部、国家古迹档案管理局、古物和修复历史档案部提供）", "note_en": "The Sacred Band: Three Hundred Theban Lovers Fighting to Save Greek Freedom  by James Romm; Scribner, 320 pp., $28\n In Plato’s  Symposium, a dramatization of a drinking party, each guest delivers a speech in praise of Love. The first, a certain Phaedrus, describes how  Eros, the Greek name for the god of love and for the primal force of erotic attraction, could be the basis for an invincible army of male lovers (translated by Benjamin Jowett):\n And if there were only some way of contriving that a state or an army should be made up of lovers and their loves, they would be the very best governors of their own city, abstaining from all dishonour, and emulating one another in honour; and when fighting at each other’s side, although a mere handful, they would overcome the world.\n The evening is set in 416 BCE, during the Peloponnesian War, but Plato composed his work decades later, after Sparta’s defeat of Athens. While Phaedrus’s speech seems to describe a  hypothetical army, even for Plato’s early readers, it would have seemed either an anachronism or a prophecy. They would have been aware of an actual elite military unit, the Sacred Band of Thebes, made up of 150 pair-bonded male couples. Undefeated for three shining decades, the Band, “though a handful,” did indeed “overcome,” breaking the iron stranglehold of bullying Sparta, and freeing an enslaved population.\n Athenian writers mocked the people of Thebes and Boeotia for being country bumpkins, but Thebes was rich in mythology, had produced poets such as Hesiod and Pindar, and boasted two gods as native sons: Dionysus, son of a Theban princess, and Heracles/Hercules, who labored his way to immortality. Between democratic, imperial Athens and oligarchic, totalitarian Sparta, Thebes and Boeotia represented a third way, a bold experiment in democratic federalism, its cities even sharing a common coinage. Thebes, however, had committed the sin of “medizing,” siding with the Persians during the Persian invasion. Athens and Sparta never let them forget it.\n Perhaps Thebes is getting a second chance in the limelight. There is a new state-of-the-art museum in Thebes itself, and Paul Cartledge has recently published  Thebes: The Forgotten City of Ancient Greece. Now comes James Romm’s sensitive account of the Sacred Band.\n In Athens and Sparta, romantic, erotic, and sexual relationships between men were largely countenanced and conventional: a couple was composed of an  erastes (the lover), the older partner, and the  eromenos (the beloved), a youth on the cusp of manhood; “lovers and their loves.” The pro-Spartan Athenian historian Xenophon seems to have been atypical in his disapproval of male-male sexual relationships; in ancient Greece it was arguably unwavering heterosexuality that was “queer.”\n But if, as Romm points out, in Athens and Sparta “male erôs was ‘complicated,’” in Thebes and Boeotia it was sanctioned by the state. Male couples could take an oath at the grave of Iolaus, Hercules’s own beloved, to live together as  syzygentes—yoke mates—a term that elsewhere indicates a lifelong marital bond. It is etymologically related to “conjugal.” (The modern Greek word for “spouse” is still  syzygos.) After running a junta of Spartans out of Thebes in 379 BCE, the Thebans turned their attention to defense. What Thebes needed to keep Sparta’s hoplites (heavily armed infantry) at bay was an elite squad of its own; thus was born the Sacred Band of 300, its couples having sworn the “sacred” oath at Iolaus’s tomb.\n The man who would lead the Sacred Band to greatness was Epaminondas. From a down-at-heel aristocratic family, he had been taught by the philosopher Lysis, one of the last Pythagoreans. Epaminondas was unsuperstitious, indifferent to worldly wealth, well-versed in literature, and an accomplished musician. He never married or had children.\n In 371 BCE, at the Battle of Leuctra, the Sacred Band shattered the myth of Sparta’s supremacy. Greek hoplite warfare was a formalized affair: the strongest part of each army, placed on the right flank, first faced the weaker left flank of the opposing army. Epaminondas instead placed his Sacred Band on the  left, to break the might of the Spartans from the top down. The rout was so complete that a Spartan king perished in the battle, the first to do so in generations. Epaminondas proved that Sparta was beatable; never again would it rise to military dominance.\n Epaminondas and the Sacred Band pushed deep into Spartan territory, liberating Arcadia and Messenia. The latter was the traditional homeland of the helots, an indigenous population that had been enslaved by Sparta for centuries. Epaminondas not only freed the helots of the area and invited diaspora Messenians to return, but he built a city for them with massive stone walls and public buildings, constructed in an astonishing 85 days. A walled city of free helots so near to their city enraged the Spartans and helped to keep them in check. But the brilliant career of Epaminondas was cut short; he fell in the midst of victory, struck by a Spartan spear at the Battle of Mantinea in 362 BCE. Confronted on his deathbed with his childlessness, he declared his victories, Leuctra and Mantinea, to be his immortal daughters. He was buried on the field, beside his own “beloved,” Caphisodorus.\n Thebes almost immediately went into a decline. In 338 BCE, the Sacred Band was annihilated at the Battle of Chaeronea by Philip of Macedon and his son, Alexander (soon to be the Great). Philip, who had spent his youth in Thebes as a kind of hostage, is said to have wept at seeing the Band lying all broken and jumbled together. Plutarch quotes him as saying “Perish all those who suggest that these men did or endured anything shameful.” The Battle of Chaeronea marked the beginning of the rise of Alexander, who would eventually wipe Thebes off the map, razing every building except the house of the poet Pindar. Thebes’s moment in the sun had passed.\n Romm’s book not only details the history of the Sacred Band, but illuminates this murky and murderously internecine period of Greek history. He also offers glimpses into reception of the Band (a beacon for closeted Victorian homosexuals, for instance) in later eras. Romm has an eye for interesting characters—such as the sociopathic tyrant Jason of Pherae, who made his spear into a god. Or the Boeotian courtesan and legendary beauty Phryne, who offered, with her well-gotten gains, to rebuild the walls of Thebes that Alexander had knocked down so long as they bore an inscription to that effect. (No one took her up on her offer.)\n Pausanias, the ancient Greek travel writer, described the monument that was erected to the memory of the Sacred Band on the polyandrion (mass grave) at the battlefield of Chaeronea:\n As one approaches Chaeronea, there is a tomb of the Thebans who died in the battle with Philip. No inscription adorns it, but a monument stands over it in the form of a lion, the best emblem of the spirit of those men.\n The precise site of the battle had been forgotten by the modern era; in 1818, a young British traveler out riding in the area, with Pausanias as his guidebook, literally stumbled on a chunk of marble. It proved to be the fragment of a monumental marble lion—a chunk of head and neck that alone weighed three tons.\n Over a half century later, in 1880, with Greece now an independent nation, a sculptor sent to reconstruct and set up the broken lion tested the ground beneath it to see if it could hold up under the weight. What he found instead was a mass grave. A young Greek archaeologist, Panagiotis Stamatakis, performing modern rescue archaeology, discovered and made notes on 254 skeletons, an electric discovery that made  The New York Times. The graves were re-covered; Stamatakis, who took ill and died during the excavation, never published his findings, and his notebooks were presumed lost. Because the skeletons did not make up a round 300, some scholars even doubted whether this was indeed the gravesite of the Sacred Band.\n Perhaps the most surprising thing in Romm’s book of eye-opening stories is in an appendix. With the help of a scholar and translator in Athens, Brady Kiesling, Romm discovered that the notebooks still existed in the archives of the Greek Archaeological Service. Stamatakis had not only taken detailed measurements, but had drawn every skeleton with its position and wounds. It is hard to overestimate how ahead of its time this work was—consider, for instance, Schliemann’s aggressive excavations of the same decade, crashing through prosaic historical layers to get to treasure gilded with epic poetry.\n Rather than being buried with weapons or armor, the bodies were buried with libation cups and strigils—the sweat-scrapers of the gymnasium, that staging ground of male eros. The skeletons, touchingly individual, ornament the book, dancing through its pages. With the help of Stamatikis’s notebooks and a digital artist, Romm was able to reconstruct the positions and attitudes of all the skeletons, which are arranged as a phalanx of six or seven rows, as if in a last stand against death itself.\n With some pairs of skeletons, movingly, one seems to have an arm over the other; some others appear to be linked at the elbows.\n  One of the sketches from Panagiotis Stamatakis’s notebooks (courtesy of the Hellenic Ministry of Culture and Sports, Directorate of the Management of the National Archive of Monuments, Department of the Historical Archive of Antiquities and Restorations)", "posttime": "2021-07-30 23:28:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "战士,warrior,底比斯", "title": "战士爱神", "title_en": "Warrior Eros", "transed": 1, "url": "https://theamericanscholar.org/warrior-eros/", "via": "", "real_tags": ["战士", "warrior", "底比斯"]}, {"category": "", "categoryclass": "", "imagename": "72b8cf5f2d9f94c17aea625cf0b814ce.jpg", "infoid": 1070646, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到 Equity，TechCrunch 专注于风险投资的播客，我们将在其中解开头条新闻背后的数字。本周我们是一个较小的团队，娜塔莎和亚历克斯与格蕾丝和克里斯一起整理了一个星期，这个星期汇集了本季度的收益周期和第三季度的 IPO 热潮。所以，只是有点忙！然而，在我们开始讨论主题之前，请注意我们在 Twitter Spaces 上实时录制这些内容很有趣。我们找到了一种捕获本地音频并实时分享聊天内容的方法。所以，在 Twitter 上联系我们，这样你就可以和我们一起出去玩。这很有趣——我们甚至可以带你上台扮演嘉宾主持人。罗宾汉上市了！是的，终于，它完成了。该公司的定价为每股 38 美元，是其区间的低端，并且在开始浮动后交易日处于中等疲软状态。简而言之，Robinhood 似乎巧妙地为其 IPO 定价，将零脂肪摆在桌面上。所以，它现在比以往任何时候都更富有，而且是公开的。更多在这里。收益！我们花点时间聊了聊 Alphabet、微软和 Shopify 的收益报告。为什么？因为我们非常关心云和平台公司。因此，我们花了一分钟时间讨论公共云的结果，以及 Shopify 做了什么。电池！特斯拉正在转向铁基电池，并正在寻求直接采购其他材料。与此同时，电池回收正在筹集大量现金，尼古拉还没有死。我们称之为两个真理和一个谎言。独角兽和即将成为的公司：Contentful 以 3B 美元的估值从 Tiger 为其内容交付服务 Squire 筹集了 1.75 亿美元，这是一个理发店技术平台，其估值（再次）与 Tiger Global（再次）翻了三倍，Class 压制了收购传闻有了软银愿景基金 II 的资金，\n更多风险投资！为了结束我们的风险投资，有两项健康技术投资脱颖而出，即来自 Oova 和 Peppy 的投资。两家初创公司都同意荷尔蒙健康是一个巨大而新生的机会的观点。 （如果你感兴趣的话，我们做了一个关于荷尔蒙初创公司不平衡世界的完整节目）。我们以一个音符结束，这对你们所有人来说都很幸运，但我们没有唱歌：与早期音乐初创公司的四重奏会面 PDT 每周一上午 7:00、周三和周五早上 7:00 股票下跌PDT，所以订阅我们的 Apple 播客、阴天、Spotify 和所有演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast, where we unpack the numbers behind the headlines.\n We were a smaller team this week, with  Natasha and  Alex together with  Grace and  Chris to sort through a week that brought together both this quarter’s earnings cycle, and the Q3 IPO rush. So, it was just a little busy!\n Before we get to topics, however, a note that we are having a lot of fun recording these live on Twitter Spaces. We’ve found a hacky way to capture local audio and also share the chats live. So,  hit us up on Twitter so you can hang out with us. It’s fun – and we may even bring you up on stage to play guest host.\n  Robinhood went public! Yep, at long last, it is done. The company priced at $38 per share,  the low end of its range, and had a medium-weak day of trading once it started to float. In short, Robinhood seems to have deftly priced its IPO, leaving zero fat on the table. So, it is now richer than ever, and public.  More here.\n Earnings! We took a moment to chat about earnings reports  from Alphabet,  and Microsoft,  and Shopify. Why? Because we care lots about the cloud and platform companies. So, we took a minute to chat about public cloud results, and what Shopify got up to.\n Batteries! Tesla is  moving towards iron-based batteries, and is  looking to source other materials direct. At the same time  battery recycling is raising lots of cash, and  Nikola is Not Dead. We call it two truths and a lie.\n Unicorns and soon-to-be’s: Contentful  raised $175M at a $3B valuation from Tiger for its content delivery service, Squire, a barbershop tech platform,  tripled its valuation (again) with Tiger Global (again), and Class squashed acquisition rumors  with SoftBank Vision Fund II funding,\n More venture rounds! To cap off our venture roundup, two neat healthtech investments stood out, namely rounds  from both Oova  and Peppy. Both startups agree with the idea that  hormonal health is a massive yet nascent opportunity. (We did an entire show about  the imbalanced world of hormone startups if you’re interested).\n We ended on a musical note, which lucky for you all, didn’t include us singing: meet   a quartet of early-stage music startups\n Equity drops every Monday at 7:00 a.m. PDT, Wednesday, and Friday morning at 7:00 a.m. PDT, so subscribe to us on  Apple Podcasts,  Overcast,  Spotify and all the casts.", "posttime": "2021-07-30 22:46:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "增长,growth", "title": "增长还不够", "title_en": "\n\t\t\t\tGrowth is not enough\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/growth-is-not-enough/", "via": "", "real_tags": ["增长", "growth"]}, {"category": "", "categoryclass": "", "imagename": "6b57cb773589e29af369eb667acc8136.jpg", "infoid": 1070645, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，切尔滕纳姆似乎正在采取行动，以更密切地瞄准企业家、投资者和初创企业，尤其是现在 Covid 大流行已经看到人才被四风掀起，寻找更好的生活方式和更多地接触大自然。聪明的是，它将利用其与面向网络安全的 GCHQ 的关联。 2019 年，切尔滕纳姆自治市议会斥资 3750 万英镑购买了 GCHQ 附近的 45 公顷土地。这个想法是利用新兴的网络安全和技术社区。经过一年的选择过程，委员会现在选择了主要合作伙伴作为交付它的“首选投标人”——工厂和 HBD（原亨利靴开发）。目标是将该地区扩大到 200 公顷，这将使其成为欧洲最大的科技创业园区之一。工厂在柏林和里斯本开发了非常大规模的科技园区，将与英国开发商 HBD 和理事会合作创建目前被称为“黄金谷”的项目。该开发项目预计将增加 12,000 个新工作岗位、200 万平方英尺的办公室和 3,700 套新住宅，并将以“花园城市”的地位为基础，以埃比尼泽霍华德于 19 世纪后期建立的花园城市运动为基础。将在当地领导 Factory 项目的 Jeremy Bamberg 说：“这是一生一次的项目——这是前所未有的。通过拥抱科技、自然和创新，我们正在努力将该地区转变为欧洲最智能的花园区——为混乱的城市生活创造一个理想的替代品。”该项目的第一步将是建设切尔滕纳姆工厂。与工厂在柏林和里斯本的项目一样，建筑和设计将由 Julian Breinersdorfer 领导，他最近加入了工厂，为类似的建筑和地区创建内部产品。\n切尔滕纳姆自治市议会的蒂姆·阿特金斯 (Tim Atkins) 说：“我们正在寻找合作伙伴来帮助理事会实现我们雄心勃勃的计划。 HBD 和 Factory 向我们展示了他们如何共享这些目标，更重要的是，这些目标将如何在切尔滕纳姆转变为一个活生生的实体，在当地产生积极影响，同时成为全球网络部门的重要组成部分。", "note_en": "Now it appears that Cheltenham is getting its act together to more closely target entrepreneurs, investors and startups, especially now that the Covid-pandemic has seen talent thrown to the four winds, looking for better lifestyles and more access to nature. Smartly, it will be leveraging its association with the cyber-security-oriented GCHQ.\n In 2019, Cheltenham Borough Council spent £37.5m purchasing 45 hectares of land adjacent to GCHQ. The idea being to capitalize on the burgeoning cybersecurity and technology community.\n   After a year-long selection process the Council has now selected key partners as ‘preferred bidders’ to deliver it – Factory and HBD (formerly Henry Boot Developments). The ambition is to grow the area to 200 hectares, which would make it one of the biggest tech startup campuses in Europe.\n Factory, which developed the very large scale tech campuses in Berlin and Lisbon, will partner with UK developer  HBD and the council to create the project currently dubbed ‘ Golden Valley’.\n The development is projected to add 12,000 new jobs, 2 million square feet of offices, and 3,700 new homes, and will be drawn on the ‘Garden City’ status, building upon the Garden City Movement established in the late 19th Century by Ebenezer Howard.\n Jeremy Bamberg, who will be leading the project locally for Factory said: “This is a once in a lifetime project – it’s unprecedented. By embracing tech, nature, and innovation we’re working to transform the area into Europe’s most intelligent Garden District – creating an ideal alternative to chaotic city life.”\n The first step of the project will be building, Factory Cheltenham. As with Factory’s projects in Berlin and Lisbon, the architecture and design will led by Julian Breinersdorfer, who recently joined Factory to create an in-house offering for similar buildings and districts.\n Tim Atkins from Cheltenham Borough Council said: “We were looking for a partner to help the Council make our ambitious plans a reality. HBD and Factory have shown us how they share these goals and more importantly, how these will be transformed into a living breathing entity right here in Cheltenham that has a positive impact locally, whilst being a key part of the global cyber sector.", "posttime": "2021-07-30 22:46:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,网络,gchq,项目", "title": "切尔滕纳姆的 GCHQ 将在隔壁建立一个庞大的、面向网络的科技创业园区", "title_en": "\n\t\t\t\tCheltenham’s GCHQ to get a massive, cyber-oriented tech startup campus right next door\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/cheltenhams-gchq-to-get-a-massive-cyber-oriented-tech-startup-campus-right-next-door/", "via": "", "real_tags": ["创业", "网络", "gchq", "项目"]}, {"category": "", "categoryclass": "", "imagename": "e10c180fa1d620e06ec49fd0fd8d340b.jpg", "infoid": 1070644, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "拉丁美洲风险基金 Kaszek Ventures 牵头融资的股权部分，其中还包括 DST Global 的合作伙伴以及许多其他公司和创始人/天使投资者的参与。拉丁美洲和美国的资产管理公司和对冲基金——包括智利养老基金——提供了信贷便利。在其整个生命周期中，Xepelin 总共筹集了超过 3600 万美元的股权和 2.5 亿美元的资产支持设施。参与本轮融资的还有 Picus Capital；皮划艇风险投资公司；国泰创新； MSA资本；阿玛瑞娜； FJ实验室；吉尔伽美什和卡瓦克创始人兼首席执行官卡洛斯·加西亚； Square Financial Services 执行主席 Jackie Reses； Justo 创始人兼首席执行官 Ricardo Weder； Tiger Global 管理合伙人 John Curtius； GGV的Hans Tung；和 Clara 的创始人兼首席执行官 Gerry Giacman 等。 Nicolás de Camino 和 Sebastian Kreis 于 2019 年年中创立了 Xepelin，其使命是改变“所有拉美国家只有 5% 的公司可以获得经常性金融服务”的事实。 “我们希望拉丁美洲的所有中小企业都能以公平有效的方式获得金融服务和资本，”两人说。 Xepelin 建立在 SaaS 模型之上，旨在为中小企业提供一种实时组织其财务信息的方法。该公司声称，嵌入在其软件中的是公司“只需点击三下，即可在几个小时内收到资金”申请短期营运资金贷款的一种方式。它开发了一种人工智能驱动的承销引擎，高管们表示，这使其能够做出实时贷款批准决策。 “拉丁美洲的任何公司都可以在几分钟内加入并立即访问一个免费软件，该软件可以帮助他们实时组织信息，包括现金流、收入、销售、税收、机构信息——有点像免费的 CFO SaaS，”de卡米诺说。 “循环是良性的：中小企业使用Xepelin改善财务习惯，获得更有效的融资，履行义务，并与客户和供应商有效协作，在其行业产生相关影响。”\n这家金融科技公司目前在智利和墨西哥拥有 4,000 多个客户，目前的增长率是 Xepelin 在智利开始时的“四倍”。在过去的 22 个月中，它已向两国的中小企业提供了超过 4 亿美元的贷款。它目前拥有 1.2 亿美元的主动贷款组合和超过 2.5 亿美元的资产支持贷款。创始人表示，总体而言，该公司的月增长率为 30%。它拥有 110 名员工，而一年前为 20 名。 Xepelin 与中型企业公司建立了 60 多个合作伙伴关系（该数字每周都在增加），允许他们的供应商免费加入其平台，并获得应付账款、基于收入的融资。该公司还向金融合作伙伴出售其无追索权贷款组合，称其降低了信用风险敞口并增强了其平台和数据发挥作用。 “当我们谈论为拉丁美洲的中小企业创建最大的数字银行时，我们并不是说我们的目标是创建一家银行；也许我们永远不会要求获得许可证，老实说，我们所做的一切都与银行不同，就像非银行一样，这是今天用来证明重点的概念，”创始人说。 de Camino 和 Kreis 都表示，他们都热衷于让拉丁美洲的中小企业更容易获得金融服务，并且在不同的金融领域有着深厚的背景。 “我们的目标是扩展一个可以解决拉丁美洲所有中小企业真正痛苦的平台，所有这些都在一个地方，将它们与整个生态系统连接起来，最重要的是，以每个人都可以访问它的方式进行民主化，”Kreis说，“不管你是一家销售数十亿美元还是仅仅一千美元的公司，获得相同的服务和条件。”目前，该公司几乎只专注于 B2B 领域，但在未来，它相信其多项服务“将对拉丁美洲的所有中小企业和公司非常有用”。\nKaszek Ventures 的联合创始人兼管理合伙人 Nicolas Szekasy 在一份声明中表示：“Xepelin 开发了技术和数据科学引擎，以无缝方式为拉丁美洲的中小企业提供融资。” “该团队在该领域拥有丰富的经验，并已证明其用户友好型产品与市场需求完美契合。”本周早些时候，智利获得了另一笔大笔资金。 NotCo 是一家生产植物性牛奶和肉类替代品的食品技术公司，完成了 2.35 亿美元的 D 轮融资，估值为 15 亿美元。", "note_en": "LatAm venture fund  Kaszek Ventures led the equity portion of the financing, which also included participation from partners of DST Global and a slew of other firms and founders/angel investors. LatAm- and U.S.-based asset managers and hedge funds — including Chilean pension funds — provided the credit facilities. In total over its lifetime,  Xepelin has raised over $36 million in equity and $250 million in asset-backed facilities.\n Also participating in the round were Picus Capital; Kayak Ventures; Cathay Innovation; MSA Capital; Amarena; FJ Labs; Gilgamesh and Kavak founder and CEO Carlos Garcia; Jackie Reses, executive chairman of Square Financial Services; Justo founder and CEO Ricardo Weder; Tiger Global Management Partner John Curtius; GGV’s Hans Tung; and Gerry Giacoman, founder and CEO of Clara, among others.\n  Nicolás de Camino and  Sebastian Kreis founded Xepelin in mid-2019 with the mission of changing the fact that “only 5% of companies in all LatAm countries have access to recurring financial services.”\n “We want all SMEs in LatAm to have access to financial services and capital in a fair and efficient way,” the pair said.\n Xepelin is built on a SaaS model designed to give SMEs a way to organize their financial information in real time. Embedded in its software is a way for companies to apply for short-term working capital loans “with just three clicks, and receive the capital in a matter of hours,” the company claimed.\n It has developed an AI-driven underwriting engine, which the execs said gives it the ability to make real-time loan approval decisions.\n “Any company in LatAm can onboard in just a few minutes and immediately access a free software that helps them organize their information in real time, including cash flow, revenue, sales, tax, bureau info — sort of a free CFO SaaS,” de Camino said. “The circle is virtuous: SMEs use Xepelin to improve their financial habits, obtain more efficient financing, pay their obligations, and collaborate effectively with clients and suppliers, generating relevant impacts in their industries.”\n  The fintech currently has over 4,000 clients in Chile and Mexico, which currently has a growth rate “four times faster” than when Xepelin started in Chile. Over the past 22 months, it has loaned more than $400 million to SMBs in the two countries. It currently has  a portfolio of active loans for $120 million and an asset-backed facility for more than $250 million.\n Overall, the company has been seeing a growth rate of 30% per month, the founders said. It has 110 employees, up from 20 a year ago.\n Xepelin has more than 60 partnerships (a number that it said is growing each week) with midmarket corporate companies, allowing for their suppliers to onboard to its platform for free and gain access to accounts payable, revenue-based financing. The company also sells its portfolio of non-recourse loans to financial partners, which it says mitigates credit risk exposure and enhances its platform and data play.\n “When we talk about creating the largest digital bank for SMEs in LatAm, we are not saying that our goal is to create a bank; perhaps we will never ask for the license to have one, and to be honest, everything we do, we do it differently from the banks, something like a non-bank, a concept used today to exemplify focus,” the founders said.\n Both de Camino and Kreis said they share a passion for making financial services more accessible to SMEs all across Latin America and have backgrounds rooted deep in different areas of finance.\n “Our goal is to scale a platform that can solve the true pains of all SMEs in LatAm, all in one place that also connects them with their entire ecosystem, and above all, democratized in such a way that everyone can access it,” Kreis said, “regardless of whether you are a company that sells billions of dollars or just a thousand dollars, getting the same service and conditions.”\n For now, the company is nearly exclusively focused on the B2B space, but in the future, it believes several of its services “will be very useful for all SMEs and companies in LatAm.”\n “Xepelin has developed technology and data science engines to deliver financing to SMBs in Latin America in a seamless way,” Nicolas Szekasy, co-founder and managing partner at Kaszek Ventures, said in a statement.  “ The team has deep experience in the sector and has proven a perfect fit of their user-friendly product with the needs of the market.”\n Chile was home to another large funding earlier this week.  NotCo, a food technology company making plant-based milk and meat replacements, closed on a $235 million Series D round that gives it a $1.5 billion valuation.", "posttime": "2021-07-30 22:45:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "kaszek,fintech", "title": "智利金融科技公司 Xepelin 从知名天使 Kaszek 那里获得了 2.3 亿美元的债务和股权", "title_en": "\n\t\t\t\tChilean fintech Xepelin secures $230M in debt and equity from Kaszek, high-profile angels\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/chilean-fintech-xepelin-secures-230m-in-debt-equity-from-kaszek-high-profile-angels/", "via": "", "real_tags": ["kaszek", "fintech"]}, {"category": "", "categoryclass": "", "imagename": "52515e9d4a99bd82ed39d82131ecd3bf.jpeg", "infoid": 1070643, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卢森堡国家数据保护委员会表示，亚马逊对个人数据的处理不符合欧盟通用数据保护条例。伦敦——亚马逊因违反欧盟的数据保护法而被一家欧洲隐私监管机构处以 7.46 亿欧元（8.87 亿美元）的罚款。亚马逊周五在一份证券文件中披露的罚款是两周前由卢森堡的隐私监管机构发布的。卢森堡国家数据保护委员会表示，亚马逊对个人数据的处理不符合欧盟的通用数据保护条例。欧洲总部位于卢森堡的亚马逊否认存在任何违反 GDPR 规则的违规行为。 “维护我们客户信息的安全性和他们的信任是重中之重，”亚马逊发言人告诉 CNBC。他们补充说：“没有数据泄露，也没有客户数据暴露给任何第三方。”\n“这些事实是无可争议的。我们强烈不同意 CNPD 的裁决，我们打算提出上诉。关于我们如何向客户展示相关广告的决定依赖于对欧洲隐私法的主观和未经检验的解释，提议的罚款完全不成比例即使是这样的解释。”据报道，在法国隐私权组织 La Quadrature du Net 对亚马逊提起诉讼后，CNPD 的调查于 2018 年开始。据彭博社报道，La Quadrature du Net 没有立即回应评论，但 La Quadrature 诉讼团队成员 Bastien Le Querrec 对这一决定持谨慎态度。据报道，他说：“这是看到具有劝阻性的罚款的第一步，但我们需要保持警惕，看看该决定是否还包括纠正侵权行为的禁令。”根据 GDPR，欧洲的数据保护监管机构有能力对公司进行高达其年度全球销售额 4% 的罚款。虽然亚马逊的罚款高达数亿美元，但从总体上看，这相对较小。亚马逊周四连续第三个季度公布了 1000 亿美元的收入，收入同比增长 27% 至 1130.8 亿美元。\n更正：此故事的标题已更新，以更准确地反映开出罚款的组织。", "note_en": "The Luxembourg National Commission for Data Protection said Amazon&#39;s processing of personal data did not comply with the EU General Data Protection Regulation.\n LONDON —  Amazon has been issued with a fine of 746 million euros ($887 million) by a European privacy watchdog for breaching the bloc&#39;s data protection laws.\n The fine, disclosed by Amazon on Friday in a securities filing, was issued two weeks ago by Luxembourg&#39;s privacy regulator.\n  The Luxembourg National Commission for Data Protection said Amazon&#39;s processing of personal data did not comply with the  EU&#39;s General Data Protection Regulation.\n  Amazon, which has its European headquarters in Luxembourg, denied that there had been any kind of breach that would violate the GDPR rules.\n &#34;Maintaining the security of our customers&#39; information and their trust are top priorities,&#34; an Amazon spokesperson told CNBC.\n &#34;There has been no data breach, and no customer data has been exposed to any third party,&#34; they added.\n  &#34;These facts are undisputed. We strongly disagree with the CNPD&#39;s ruling, and we intend to appeal. The decision relating to how we show customers relevant advertising relies on subjective and untested interpretations of European privacy law, and the proposed fine is entirely out of proportion with even that interpretation.&#34;\n  CNPD&#39;s investigation reportedly commenced in 2018 after French privacy rights group La Quadrature du Net filed a complaint against Amazon.\n La Quadrature du Net did not immediately respond to comment but Bastien Le Querrec, a member of La Quadrature&#39;s litigation team, cautiously welcomed the decision, according to Bloomberg.\n &#34;It&#39;s a first step to see a fine that&#39;s dissuasive, but we need to remain vigilant and see if the decision also includes an injunction to correct the infringing behavior,&#34; he reportedly said.\n  Under the GDPR, data protection watchdogs in Europe have the ability to fine companies as much as 4% of their annual global sales.\n While the Amazon fine is in the hundreds of millions, it&#39;s relatively small in the grand scheme of things.\n Amazon posted its  third $100 billion quarter in a row on Thursday, with revenue growing by 27% year over year to $113.08 billion.\n Correction: The headline of this story has been updated to more accurately reflect the organization that issued the fine.", "posttime": "2021-07-30 22:35:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,机构,fine,数据保护", "title": "亚马逊被欧洲隐私监管机构罚款 8.87 亿美元", "title_en": "Amazon Hit With $887 Million Fine by European Privacy Watchdog", "transed": 1, "url": "https://www.cnbc.com/2021/07/30/amazon-hit-with-fine-by-eu-privacy-watchdog-.html", "via": "", "real_tags": ["amazon", "亚马逊", "机构", "fine", "数据保护"]}, {"category": "", "categoryclass": "", "imagename": "b6fa6a1151fb184642a1b28dedb8d65d.png", "infoid": 1070642, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由 Mark Cuban 资助和共同创立的音频应用程序 Fireside 尚未公开发布，但它已经在向其平台上的有限创作者索要金钱。在昨晚发送给用户并由 The Verge 查看的电子邮件中，联合创始人兼首席执行官 Falon Fatemi 表示，她和该团队正在接受任何感兴趣的人在 8 月之前的投资。 “如果您相信我们的愿景，那么您就有机会参与其中，”她写道。 “把你的钱放在嘴边:)（我们做到了。）”这封电子邮件说更多细节即将到来，但没有透露交易条款、投资将如何运作、应用程序的估值是多少，或者团队有多少希望提高。但是这封电子邮件还发布了一些关于应用程序的未来及其愿景的公告。下周，在播客运动会议上，法特米说她和库班将登台宣布与播客托管服务 Libsyn 建立合作伙伴关系。正如 The Verge 在 3 月份报道的那样，Fireside 与 Clubhouse 类似地主持实时音频聊天，并允许用户记录这些对话。该团队告诉创作者，它计划允许他们将文件作为基于 RSS 的播客分发，而 Libsyn 合作伙伴关系似乎是实现该目标的解决方案。 Fatemi 表示，用户可以通过“轻轻一按”选择将他们的节目作为播客分发。此外，她表示该团队已与音频硬件公司 Rode 达成协议，为用户提供各种设备的折扣。同样，没有提供任何细节。炉边发言人拒绝发表评论。我们还联系了 Libsyn 和 Rode，如果我们收到回复，我们会更新。与此同时，Fireside 应用上周在 iOS 上推出了内测。下载该应用程序的用户可以使用他们的电话号码和电子邮件进行注册，以尝试摆脱候补名单。 Fatemi 在她的电子邮件中写道，该应用程序与 Clubhouse、Facebook Live Audio Rooms 或 Twitter Spaces 非常不同。\n“正如你们许多人所知，早期的媒体猜测将我们错误地归类为社交音频——正如你们许多人所说，我们正在创建一个全新的类别，”她写道。这个新类别究竟是什么，我不清楚。您可以在下方看到该应用的预告片，其中重点介绍了拥有自己作品的数字创作者。尽管如此，尽管 Fireside 的所有权目标，播客时事通讯 Podnews 上周指出，该应用程序的某些条款因对创作者不友好而脱颖而出。值得注意的是，Fireside 和相关方可以将“包括您的姓名和肖像在内的录音用于任何商业和非商业目的（包括创建 NFT），包括根据 Fireside 的使用、复制、分发和许可给他人。服务条款，以现在或以后已知的任何媒体形式，无需进一步补偿或许可。”这些条款似乎还赋予 Fireside 对应用程序中发生的录音的最终所有权，并且还包括仲裁条款。其中一些细节可能是标准的，但同样，由于 Fatemi 明确表示有兴趣将创作者从具有约束力的所有权协议中解放出来，因此它们脱颖而出。目前尚不清楚 Fireside 何时公开发布，可以说是每个人都想听到的细节。", "note_en": "The Mark Cuban-funded and co-founded audio app  Fireside has yet to publicly launch, but already it’s asking the limited creators on its platform for money. In an email sent to users late last night and viewed by  The Verge, co-founder and CEO Falon Fatemi says she and the team are accepting investments through the month of August from anyone who’s interested.\n “If you believe in our vision, this is your chance to be part of it,” she writes. “Put your money where your mouth is :) (We did.)”\n The email says more details are to come and doesn’t disclose the deal terms, how the investments will work, what the app’s valuation is, or how much the team is hoping to raise. But the email does also make a couple other announcements about the future of the app and its vision.\n  Next week, at the conference Podcast Movement, Fatemi says she and Cuban will take the stage to announce a partnership with podcast hosting service Libsyn. As  The Verge reported  in March, Fireside hosts live audio chats similarly to Clubhouse and allows users to record those conversations. The team had told creators it planned to allow them to distribute their files as RSS-based podcasts, and the Libsyn partnership appears to be the solution for that goal. Fatemi says users will be able to optionally distribute their shows as a podcast with “one tap.”\n Additionally, she says the team has arranged a deal with audio hardware company Rode to offer users discounts on various equipment. Again, no details were provided.\n A Fireside spokesperson declined to comment. We’ve also reached out to Libsyn and Rode and will update if we hear back.\n Meanwhile, the Fireside app launched on iOS last week in a closed beta. Users who download the app can sign up with their phone number and email to try to get off the waitlist. Fatemi writes in her email that the app is very much not like  Clubhouse, Facebook  Live Audio Rooms, or  Twitter Spaces.\n “As many of you know the early media speculation miscategorized us as social audio — as many of you have stated we are creating an entirely new category,” she writes. What exactly that new category is, I’m unclear. You can see a teaser trailer for the app below, which focuses on digital creators owning their work.\n  Still, despite Fireside’s ownership goals, podcasting newsletter  Podnews  flagged last week that some of the app’s terms stood out as not creator friendly. Notably, Fireside and associated parties may use the “recordings, including your name and likeness, for any commercial and non-commercial purposes (including the creation of NFTs), including to use, reproduce, distribute, and license to others in accordance with Fireside’s Terms of Service, in any manner of media whatsoever now or hereafter known, without further compensation or permissions.”\n The terms also seem to give Fireside ultimate ownership of recordings that happen in the app, and an arbitration clause is included, as well. Some of these details might be standard, but again, they stand out because of Fatemi’s stated interest in freeing creators from binding ownership agreements.\n It’s unclear when Fireside will publicly launch, arguably the detail everyone wants to hear.", "posttime": "2021-07-30 22:34:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "cuban,creators,fireside", "title": "在给创作者的一封电子邮件中，由 Mark Cuban 资助的音频应用 Fireside 表示，它正在接受任何有兴趣的人的投资，直到 8 月", "title_en": "In an email to creators, audio app Fireside, funded by Mark Cuban, says it is accepting investments through August from anyone who is interested", "transed": 1, "url": "https://www.theverge.com/2021/7/30/22601191/fireside-app-mark-cuban-falon-fatemi-libsyn-rode-invest?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["cuban", "creators", "fireside"]}, {"category": "", "categoryclass": "", "imagename": "2fb1181236ddab448ee0a806ea006fcc.jpg", "infoid": 1070640, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一些用户报告称，他们的新 M1 MacBook 的屏幕在“正常使用”期间出现破裂——包括 M1 MacBook Air 和 MacBook Pro。我 6 个月前买了一台 MacBook Air M1，屏幕无故破裂。我晚上把电脑放在桌子上，第二天我打开它，屏幕右​​侧有 2 个小裂缝，损坏了屏幕的功能。我联系了授权的苹果中心，它告诉我苹果保修不包括它，因为它是接触点裂纹；好像我在屏幕和键盘之间留下了米浆果大小的东西……这很荒谬，因为我的桌子上没有类似的东西，而且电脑像往常一样正确关闭，整晚都没有动。除了修理它的价格之外，令人沮丧的是苹果不相信它的客户。 – 用户 laura8lx 对同一线程的回复似乎表明这种情况已经发生在相当多的用户身上。截至今天早上，我也有同样的问题。像往常一样打开我的 M1 MacBook Pro，屏幕明显破裂。我没有做任何事情来导致这种情况。 – User Truth42 我刚刚经历了同样的事情。 7 月 28 日，我关闭了我的笔记本电脑，带狗出去。我回来打开笔记本电脑，发现有裂缝。\n– 用户 CanadaM1 Reddit 上的另一位用户声称，他们没有跌落或对屏幕施加压力，但仍然打开 MacBook 发现显示屏已损坏。值得注意的是，对于其中一些用户，Apple 继续免费更换了整个 MacBook。然而，对于一些人来说，他们不得不自掏腰包让苹果公司收集机器进行维修。我不得不支付 570 英镑，然后 Apple 才会收回机器进行维修。他们告诉我他们的技术人员会决定我是否得到退款。不开心。 – 用户真相 42 尽管我非常喜欢“我的 MacBook Pro 无缘无故”的标题，但我很难相信这些裂缝确实是“无缘无故”发生的。当笔记本电脑关闭时，灰尘通常会被夹住并压入显示屏，而在其他时候，这可能完全取决于用户打开或关闭设备的方式。\n我敢打赌，其中一些“报告”来自将 MacBook 屏幕关闭到键盘上，键盘上粘有一堆 Doritos 碎屑的用户，这是一个非常安全的赌注。如果你也遇到了与 Doritos 相关的 MacBook Pro 屏幕事件，那么值得将那个傻瓜直接带到 Apple Store 并板着脸说它的发生“没有明显的原因”。祝你好运。", "note_en": "There have been a few reports popping up from users claiming that the screens in their new M1 MacBooks have been cracking during “normal usage” — that includes M1 MacBook Air and MacBook Pro.\n  I bought a MacBook Air M1 6 months ago and the screen cracked for no apparent reason. I left my computer on the top of my desk during the night and the next day I opened it the screen had 2 small cracks on the right which damaged the functioning of the screen. I contacted an authorized apple center which told me apple warranty would not cover it as it is a contact point crack; as if I have left something the size of a rice berry between the screen and the keyboard… It is absurd as I have nothing like it on my desk and the computer was properly closed as usual and didn’t move the whole night. More than the price of repairing it , it is frustrating that apple doesn’t believe its costumers.\n  – User laura8lx\n Replies to that same thread seem to indicate that this has been happening to quite a few users.\n As of this morning I, too, have the same issue. Turned my M1 MacBook Pro on as usual and the screen was obviously cracked. I have done nothing to cause this.\n – User Truth42\n I have just experienced the same thing. On July 28th I closed my laptop to take the dog outside. I came back in and opened up the laptop and there was a crack.\n – User CanadaM1\n Another user on  Reddit claims that they had not dropped or applied pressure to their screen and still opened their MacBook to find the display had been busted.\n  It’s worth noting that for some of these users, Apple went ahead and replaced the entire MacBook, at no cost. For some, however, they had to pay out of pocket for Apple to collect the machine for repair.\n I had to pay £570 before Apple would collect the machine for repair. They tell me their technicians will decide if I get a refund. Not happy.\n – User Truth42\n As much as I love a good “ My MacBook Pro for NO REASON” headline, I have a hard time believing that these cracks are indeed happening for “no reason”.\n Often dirt can get caught and press into the display when the laptop is closed, and other times, it can happen purely based on how a user may have opened or closed the unit.\n I’d say it’s a pretty safe bet that some of these “reports” are from users who shut their MacBook screen onto a keyboard with a bunch of Doritos crumbs stuck in it.  And if you, too, had a Doritos-related MacBook Pro screen incident, it’s worth driving that sucker right to the Apple Store and saying — with a straight face — that it happened for “no apparent reason”. Good luck.", "posttime": "2021-07-30 22:33:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macbook,屏幕", "title": "M1 MacBook 用户称他们的屏幕“无明显原因”破裂", "title_en": "M1 MacBook Users Say Their Screens Are Cracking for “No Apparent Reason”", "transed": 1, "url": "https://www.frontpagetech.com/2021/07/30/m1-macbook-users-say-their-screens-are-cracking-for-no-apparent-reason-lol/", "via": "", "real_tags": ["macbook", "屏幕"]}, {"category": "", "categoryclass": "", "imagename": "2253d2ee9cd5244717bd79eb167e4a74.png", "infoid": 1070639, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "音频和 Rust 开发人员交流和分享的地方", "note_en": "A place for audio & Rust developers to talk & share", "posttime": "2021-07-30 22:33:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,rust,音频,audio", "title": "Rust 音频开发论坛", "title_en": "Rust Audio Development Forum", "transed": 1, "url": "https://rust-audio.discourse.group/", "via": "", "real_tags": ["开发", "rust", "音频", "audio"]}, {"category": "", "categoryclass": "", "imagename": "4105cf7d92dcdac58a1e813d2838874c.png", "infoid": 1070637, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周五，当夏季奥运会在东京开幕时，将在 300 多个项目中颁发金牌、银牌和铜牌。先前使用人类编码的研究表明，铜牌得主似乎比银牌得主更快乐。然而，多年来，学者们一直在争论其中的原因。根据发表在《实验心理学杂志》上的卡尔森管理学院的新研究，面部表情软件——几乎消除了可能的偏见——提供了重要的洞察力。该研究由明尼苏达大学卡尔森管理学院营销学副教授威廉·赫奇科克 (William Hedgcock) 领导。 Hedgcock 和他的团队编译了有史以来用于研究这种现象的最大数据集，并且是第一个使用面部表情软件的人。总的来说，他们研究了 2000 年至 2016 年五届夏季奥运会上来自 67 个国家的 142 项体育赛事的 413 名运动员的奖牌台照片。他们使用商业面部表情软件将所有三名奖牌获得者的面部外观与他们完成的位置进行了比较以及他们如何被预测完成。结果在先前发现的基础上进行了复制和扩展：铜牌得主比银牌得主更容易露出微笑，而金牌得主比其他奖牌得主更快乐。该研究支持的两种解释都是基于科学家所说的反事实思维：银牌得主与金牌得主形成了向上的比较，并带有“我几乎赢得金牌”的想法，而铜牌得主则形成了与第四名的向下比较- 以“至少我赢得了一枚奖牌”的想法排名完赛者。奖牌获得者根据他们参加比赛的期望形成他们的想法，银牌获得者更失望，因为他们之前对表现的期望高于铜牌获得者。 “现在我们有了更好的想法，为什么客观上表现更好的运动员，比如赢得银牌对铜牌，可能看起来不那么开心，”Hedgcock 解释说。 “上下比较的概念不仅适用于奥运奖牌获得者，也适用于生活的许多方面，例如工作、学校或购物时的表现。 “我们在这项研究中的经验表明，该软件主要用于受控环境，也可用于控制较少的现实世界应用中的大规模面部表情研究，”Hedgcock 在谈到这项研究时评论道。进行更多此类研究。", "note_en": "This Friday, when the Summer Olympics begin in Tokyo, gold, silver and bronze medals will be handed out in more than 300 events. Prior research, using human coding, has revealed that bronze medalists appeared happier than silver medalists. However, scholars have debated the reasons why for years.  According to new research from the Carlson School of Management  published in the Journal of Experimental Psychology, facial expression software — which nearly eliminates possible bias — offers important insight. The research was led by  William Hedgcock, an associate professor of marketing at the University of Minnesota’s  Carlson School of Management.  Hedgcock and his team compiled the largest dataset ever used to study this phenomenon and are the first to use facial expression software. Altogether, they studied medal stand photographs of 413 athletes from 142 sporting events, representing 67 countries, across five Olympic Summer Games between 2000 and 2016. Using commercial facial expression software, they compared the facial appearance of all three medalists both to what position they finished and how they were predicted to finish.  The results replicated and expanded on what was previously found: bronze medalists were more likely to exhibit a smile than silver medalists, while gold medalists were happier than other medalists. Two explanations supported by the study, both based on what scientists refer to as counterfactual thinking, are:\n Silver medalists formed an upward comparison to the gold medalists with thoughts of “I almost won gold,” while bronze medalists formed a downward comparison to a fourth-place finisher with thoughts of “at least I won a medal.”\n  Medalists form their thoughts based on what their expectations were entering the event, with silver medalists being more disappointed because their prior expectations for performance were higher than bronze medalists.\n “Now we have a better idea why athletes who did objectively better, as in won silver versus bronze, might appear less happy,” explained Hedgcock. “The notion of making upward and downward comparisons not only applies to Olympic medalists, but also to many aspects of life such as performance at work, school or when making purchases, for example.  “Our experience with this study suggests the software, which has primarily been used in controlled settings, is also useful for large-scale facial expression studies in less-controlled, real-world applications,&#34; commented Hedgcock in regards to this study opening the door for more research of this kind.", "posttime": "2021-07-30 22:33:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发现,medalists,研究", "title": "研究发现铜牌得主似乎比银牌得主更快乐", "title_en": "Research found bronze medalists appeared happier than silver medalists", "transed": 1, "url": "https://twin-cities.umn.edu/news-events/facial-expression-software-knows-which-olympic-medal-makes-you-happier-and-why", "via": "", "real_tags": ["发现", "medalists", "研究"]}, {"category": "", "categoryclass": "", "imagename": "1f5523faf6c75df2a33abdac1f9fd05f.png", "infoid": 1070636, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的名字是属于我的吗？我的脸吗？我的生活呢？我的故事？为什么我的名字用来指代我没有参与的事件？我回到这些问题是因为其他人继续在未经我同意的情况下从我的名字、面孔和故事中获利。最近，电影《静水》。这部由导演汤姆·麦卡锡 (Tom McCarthy) 执导、马特·达蒙 (Matt Damon) 主演的新电影“基于”或“直接受到”“阿曼达·诺克斯传奇”的启发，正如《名利场》在一篇宣传营利性电影的营利性文章中所说的那样，两者都不是我隶属于其中。我想在这句话上暂停一下：“阿曼达诺克斯传奇。”那是指什么？它指的是我所做的任何事情吗？不是。它指的是由名叫鲁迪·盖德的窃贼谋杀梅雷迪思·克彻所导致的事件。它指的是警察工作以次充好、检察机关的狭隘视野以及拒绝承认自己的错误导致意大利当局两次错误地对我定罪。在那四年的非法监禁和 8 年的审判中，我的代理权几乎为零。那个“传奇”中的其他人对事件的影响都比我大。意大利当局对我的错误关注导致媒体对我的错误关注，这影响了我向世界展示的方式。在监狱里，我无法控制自己的公众形象，在我的故事中没有发言权。这种对我的关注导致许多人抱怨梅雷迪思被遗忘了。但是，当然，他们怪谁呢？不是意大利当局。不是新闻。我！不知何故，警察和媒体以梅雷迪思为代价来关注我是我的错。这样做的结果是，15年后，我的名字是与这一系列悲惨事件相关联的名字，我对这些事件的影响为零。 Meredith 的名字经常被省略，Rudy Guede 的名字也是如此。当他最近出狱时，这是《纽约邮报》的头条新闻。在#metoo 之后，越来越多的人开始了解权力动态如何塑造故事。谁在比尔克林顿和莫妮卡莱温斯基之间的关系中拥有权力？总裁还是实习生？你称之为什么很重要。称该事件为“莱温斯基丑闻”未能承认巨大的权力差异，我很高兴现在更多人将其称为“克林顿事件”，以该系列事件中最具影响力的人命名.我只希望人们将佩鲁贾的事件称为“鲁迪·盖德谋杀梅雷迪思·克彻”，这会让我成为我应该成为的边缘人物，无辜的室友。但我知道，我的错误定罪和随后的审判，成为了人们痴迷的故事。我知道他们将在未来称其为“阿曼达诺克斯传奇”。既然如此，我有几个小要求：不要因为别人把注意力放在我身上而不是梅雷迪斯身上而责怪我。当您提到这些事件时，请了解您谈论它的方式会影响相关人员：Meredith 的家人、我的家人、Raffaele Sollecito 和我。\n不要像皮特·哈蒙德（Pete Hammond）在审查斯蒂尔沃特的截止日期时所做的那样，将我称为被判有罪的凶手，同时方便地忽略了我的无罪释放。我请他改正。没有反应。如果你一定要提到“阿曼达诺克斯传奇”，也许不要像《纽约时报》在对马特达蒙进行剖析时那样称它为“肮脏的阿曼达诺克斯传奇”。肮脏：道德败坏。放在你的名字旁边不是一个很好的形容词。经常重复一些事情，人们相信它。现在，斯蒂尔沃特绝不是第一个在未经我同意的情况下以牺牲我的声誉为代价剽窃我的故事的人。当然，我起诉他们的是一部糟糕的终生电影，导致他们剪掉了一个梦中的场景，我被描绘成谋杀了梅雷迪思。几年前，有福克斯系列证明无辜，它被开发和销售为“如果阿曼达诺克斯成为一名律师会怎样？”我从节目制作人那里听到的第一个消息是，他们大胆地要求我在首映前夕帮他们宣传。马尔科姆·格拉德威尔 (Malcolm Gladwell) 的最后一本书《与陌生人交谈》(Talking to Strangers) 有一整章分析了我的案例。他在出版前夕伸出手，询问他是否可以在他的有声读物中使用我的有声读物的摘录。在对我做出结论之前，他没想过要接受采访。值得称赞的是，格拉德威尔通过电子邮件回应了我的批评，并很客气地加入了我的播客，迷宫。我向 Tom McCarthy 和 Matt Damon 发出同样的邀请，我希望他们能听到我将要说的关于 Stillwater 的内容。斯蒂尔沃特“直接受到阿曼达诺克斯传奇的启发”。导演汤姆·麦卡锡告诉《名利场》，“他忍不住想象穿上诺克斯的鞋子会是什么感觉。” ……但这并没有激发他问我穿上鞋子的感觉如何。他对“阿曼达诺克斯传奇”的家庭动态产生了兴趣。 “访问[她]的人是谁，这些关系是什么？比如，这个故事的故事是什么？”我和我的家人对此有很多话要说，并且会告诉麦卡锡……如果他曾经伸出援手的话。 “我们决定，&#39;嘿，让我们把阿曼达诺克斯的案子抛在脑后，&#39;”麦卡锡告诉名利场。 “但是让我把这个故事的一部分——一个在国外留学的美国女人卷入某种耸人听闻的犯罪，最终入狱——并虚构了它周围的一切。”让我在那里阻止你。那个故事，我的故事，不是关于一个在国外留学的美国女人“参与了某种耸人听闻的犯罪”。这是关于一个美国女人没有参与耸人听闻的罪行，但被错误地定罪。\n如果你打算“把阿曼达诺克斯案抛在脑后”，“把它周围的一切都虚构化”，也许不要用我的名字来宣传它。如果每条评论都提到我，你就不会很好地离开阿曼达诺克斯案。当我的脸出现在关于这部电影的简介和文章中时，你不会把阿曼达·诺克斯案抛在脑后。但是，这一切我大多都原谅了。我得到它。有钱可以赚，你没有义务接近我。我更烦恼的是这部电影“直接受到阿曼达诺克斯传奇的启发”如何“虚构”我和这个故事。当我与梅雷迪思只是柏拉图式的朋友时，我被指控参与了一场死亡狂欢，一场出错的性游戏。但是在斯蒂尔沃特虚构的我确实与她被谋杀的室友发生了性关系。在影片中，以我为原型的角色给她父亲一个提示，以帮助她找到真正杀死她朋友的人。马特达蒙追踪他。这种虚构抹杀了当局的腐败和无能。更疯狂的是，实际上，当局已经拘留了凶手。他甚至在我的审判开始之前就被定罪了。他们不需要找到他。即便如此，他们还是继续迫害我，因为他们不想承认自己错了。麦卡锡告诉名利场，“斯蒂尔沃特的结局不是受到诺克斯案的结果的启发，而是受到他和他的合作者创作的剧本的要求。”酷，所以我想知道，以我为基础的角色真的是无辜的吗？事实证明，她要求凶手帮助她摆脱她的室友。她并不是要他杀她，而是她的要求间接导致了谋杀。你认为这会如何影响我的声誉？\n我继续被指责“知道我没有透露的事情”，“以某种方式参与其中，即使我没有插刀。”所以汤姆麦卡锡的虚构版本的我只是小报阴谋罪人版本的我。通过虚构我的清白，我完全没有参与，通过消除当局在我错误定罪中的作用，麦卡锡强化了我作为一个有罪和不值得信任的人的形象。凭借马特·达蒙 (Matt Damon) 的明星影响力，两人肯定会从这部虚构的“阿曼达·诺克斯传奇”(Amanda Knox saga) 中获利丰厚，这肯定会让很多观众想知道，“也许现实生活中的阿曼达 (Amanda) 以某种方式参与其中。”这让我想到了我的剧本创意！它的灵感直接来自马特·达蒙 (Matt Damon) 的生平。他是演员、名人等等。除了我要虚构周围的一切，而我电影中类似达蒙的角色卷入了一起谋杀案。他本身并没有插刀，但不知何故他肯定有错。他的名字是达米安马修斯，他出演了杰克逊伯恩的间谍电影。他与蒂姆·麦克拉奇 (Tim McClatchy) 合作，后者属于哈维·韦恩斯坦 (Harvey Weinstein) 类型。它松散地基于现实。不应该打扰马特或汤姆，对吧？我开玩笑，但当然，我明白汤姆麦卡锡和马特达蒙在通过讲述一个以负面方式歪曲我的声誉的故事来获利时没有道德义务咨询我。我重申我愿意在迷宫中采访他们。我敢打赌，我们可以就身份和公众认知展开一场引人入胜的对话，以及谁应该利用已经进入公众想象的名字、面孔和故事。我从未要求成为公众人物。意大利当局和全球媒体为我做出了这个选择。当我被无罪释放后，媒体和公众不会让我再次成为一个普通公民。我回到学校，同学们偷偷给我拍照，住在我公寓楼的人为小报编造故事，我在旧书店做最低工资的工作，结果在柜台遇到了跟踪狂。我被狗仔队追捕，我的故事和创伤被（并且正在）无休止地循环用于娱乐，在此过程中，我被指责将注意力从梅雷迪思·克彻的记忆中转移开，因为我是一名媒体妓女。我没有被允许恢复在佩鲁贾之前的相对匿名状态。我唯一的选择是坐视别人继续歪曲我的性格，或者为恢复我被错误破坏的良好声誉而奋斗。这是一场艰苦的战斗。我可能不会成功。但我以前来过这里。我知道面对不可能的可能性是什么感觉。", "note_en": "Does my name belong to me? Does my face? What about my life? My story? Why is my name used to refer to events I had no hand in? I return to these questions because others continue to profit off my name, face, and story without my consent. Most recently, the film  Stillwater.\n This new film by director Tom McCarthy, starrin  g Matt Damon, is “loosely based” or “directly inspired by” the “Amanda Knox saga,” as  Vanity Fair put it in a for-profit article promoting a for-profit film, neither of which I am affiliated with. I want to pause right here on that phrase: “the Amanda Knox saga.” What does that refer to? Does it refer to anything I did? No. It refers to the events that resulted from the murder of Meredith Kercher by a burglar named Rudy Guede. It refers to the shoddy police work, prosecutorial tunnel vision, and refusal to admit their mistakes that led the Italian authorities to wrongfully convict me, twice.\n In those four years of wrongful imprisonment and 8 years of trial, I had near-zero agency. Everyone else in that “saga” had more influence over the course of events than I did. The erroneous focus on me by the Italian authorities led to an erroneous focus on me by the press, which shaped how I was presented to the world. In prison, I had no control over my public image, no voice in my story.\n This focus on me led many to complain that Meredith had been forgotten. But of course, who did they blame for that? Not the Italian authorities. Not the press. Me! Somehow it was my fault that the police and media focused on me at Meredith’s expense. The result of this is that 15 years later, my name is the name associated with this tragic series of events, of which I had zero impact on. Meredith’s name is often left out, as is  Rudy Guede’s. When he was released from prison recently, this was the  NY Post headline.\n  In the wake of #metoo, more people are coming to understand how power dynamics shape a story. Who had the power in the relationship between Bill Clinton and Monica Lewinsky? The president or the intern? It matters what you call a thing. Calling that event the “Lewinsky Scandal” fails to acknowledge the vast power differential, and I’m glad that more people are now referring to it as “the Clinton Affair” which names it after the person with the most agency in that series of events.\n I would love nothing more than for people to refer to the events in Perugia as “The murder of Meredith Kercher by Rudy Guede,” which would place me as the peripheral figure I should have been, the innocent roommate. But I know that my wrongful conviction, and subsequent trials, became the story that people obsessed over. I know they’re going to call it the “Amanda Knox saga” into the future. That being the case, I have a few small requests:\n Don’t blame me for the fact that others put the focus on me instead of Meredith. And when you refer to these events, understand that how you talk about it affects the people involved: Meredith’s family, my family, Raffaele Sollecito, and me.\n Don’t do what Pete Hammond did when reviewing  Stillwater for  Deadline, referring to me as a convicted murderer while conveniently leaving out my acquittal. I asked him to correct it. No response.\n  And if you must refer to the “Amanda Knox saga,” maybe don’t call it, as the The New York Times did in profiling Matt Damon, “the sordid Amanda Knox saga.” Sordid: morally vile. Not a great adjective to have placed next to your name. Repeat something often enough, and people believe it.\n Now,  Stillwater is by no means the first thing to rip off my story without my consent at the expense of my reputation. There was of course the terrible Lifetime movie that I sued them over, resulting in them cutting a dream sequence where I was depicted as murdering Meredith.\n A few years ago, there was the Fox series   Proven Innocent, which was developed and marketed as “What if Amanda Knox became a lawyer?” The first I heard from the show’s makers was when they had the audacity to ask me to help them promote it on the eve of its premiere.\n  Malcolm Gladwell’s last book, Talking to Strangers, features a whole chapter analyzing my case. He reached out on the eve of publication to ask if he could use excerpts of my audiobook in his audiobook. He didn’t think to ask for an interview before forming his conclusions about me. To his credit, Gladwell responded to my critiques over email, and was gracious enough to join me on my podcast,   Labyrinths. I extend the same invitation to Tom McCarthy and Matt Damon, who I hope hear what I’m about to say about  Stillwater.\n Stillwater was “directly inspired by the Amanda Knox saga.” Director Tom McCarthy tells Vanity Fair, “he couldn’t help but imagine how it would feel to be in Knox’s shoes.” …but that didn’t inspire him to ask me how it felt to be in my shoes. He became interested in the family dynamics of the “Amanda Knox saga.” “Who are the people that are visiting [her], and what are those relationships? Like, what’s the story  around the story?” My family and I have a lot to say about that, and would have told McCarthy…if he’d ever reached out.\n “We decided, ‘Hey, let’s leave the Amanda Knox case behind,’” McCarthy tells Vanity Fair. “But let me take this piece of the story — an American woman studying abroad involved in some kind of sensational crime and she ends up in jail — and fictionalize everything around it.” Let me stop you right there. That story,  my story, is  not about an American woman studying abroad “involved in some kind of sensational crime.” It’s about an American woman  NOT involved in a sensational crime, and yet wrongfully convicted.\n And if you’re going to “leave the Amanda Knox case behind,” and “fictionalize everything around it,” maybe don’t use my name to promote it. You’re not leaving the Amanda Knox case behind very well if every single review mentions me. You’re not leaving the Amanda Knox case behind when my face appears on profiles and articles about the film.\n But, all this I mostly forgive. I get it. There’s money to be made, and you have no obligation to approach me. What I’m more bothered by is how this film, “directly inspired by the Amanda Knox saga, “fictionalizes” me and this story.\n I was accused of being involved in a death orgy, a sex-game gone wrong, when I was nothing but platonic friends with Meredith. But the fictionalized me in  Stillwater does have a sexual relationship with her murdered roommate.\n In the film, the character based on me gives a tip to her father to help find the man who really killed her friend. Matt Damon tracks him down. This fictionalizing erases the corruption and ineptitude of the authorities.\n What’s crazier is that, in reality, the authorities already had the killer in custody. He was convicted before my trial even began. They didn’t need to find him. And even so, they pressed on in persecuting me, because they didn’t want to admit they had been wrong.\n McCarthy told Vanity Fair that “ Stillwater’s ending was inspired not by the outcome of Knox’s case, but by the demands of the script he and his collaborators had created.” Cool, so I wonder, is the character based on me actually innocent?\n Turns out, she asked the killer to help her get rid of her roommate. She didn’t mean for him to kill her, but her request indirectly led to the murder. How do you think that impacts my reputation?\n I continue to be accused of “knowing something I’m not revealing,” of “having been involved somehow, even if I didn’t plunge the knife.” So Tom McCarthy’s fictionalized version of me is just the tabloid conspiracy guilter version of me.\n By fictionalizing away my innocence, my total lack of involvement, by erasing the role of the authorities in my wrongful conviction, McCarthy reinforces an image of me as a guilty and untrustworthy person. And with Matt Damon’s star power, both are sure to profit handsomely off of this fictionalization of “the Amanda Knox saga” that is sure to leave plenty of viewers wondering, “Maybe the real-life Amanda was involved somehow.”\n Which brings me to my screenplay idea! It’s directly inspired by the life of Matt Damon. He’s an actor, celebrity, etc. Except I’m going to fictionalize everything around it, and the Damon-like character in my film is involved in a murder. He didn’t plunge the knife per se, but he’s definitely at fault somehow. His name is Damien Matthews, and he starred in the Jackson Burne spy films. He works with Tim McClatchy, who’s a Harvey Weinstein type. It’s loosely based on reality. Shouldn’t bother Matt or Tom, right?\n I joke, but of course, I understand that Tom McCarthy and Matt Damon have no moral obligation to consult me when profiting by telling a story that distorts my reputation in negative ways. And I reiterate my offer to interview them on  Labyrinths. I bet we could have a fascinating conversation about identity, and public perception, and who should get to exploit a name, face, and story that has entered the public imagination.\n I never asked to become a public person. The Italian authorities and global media made that choice for me. And when I was acquitted and freed, the media and the public wouldn’t allow me to become a private citizen again. I went back to school and fellow students photographed me surreptitiously, people who lived in my apartment building invented stories for the tabloids, I worked a minimum wage job at a used bookstore, only to be confronted by stalkers at the counter. I was hounded by paparazzi, my story and trauma was (and is) endlessly recycled for entertainment, and in the process, I’ve been accused of shifting attention away from the memory of Meredith Kercher, of being a media whore.\n I have not been allowed to return to the relative anonymity I had before Perugia. My only option is to sit idly by while others continue to distort my character, or fight to restore my good reputation that was wrongfully destroyed.\n It’s an uphill battle. I probably won’t succeed. But I’ve been here before. I know what it’s like facing impossible odds.", "posttime": "2021-07-30 22:32:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拥有,owns", "title": "谁拥有我的名字？", "title_en": "Who Owns My Name?", "transed": 1, "url": "https://amandamarieknox.medium.com/who-owns-my-name-93561f83e502", "via": "", "real_tags": ["拥有", "owns"]}, {"category": "", "categoryclass": "", "imagename": "15e3f3f00e41caf71ce177e436afb1d0.jpg", "infoid": 1070635, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州理工学院的独立研究员 James Meador 发现了证据表明阿波罗 11 号上升阶段可能仍在绕月运行。他写了一篇论文概述了他的研究和发现，并将其发布在 arXiv 预印本服务器上。 1969 年，美国宇航局宇航员尼尔·阿姆斯特朗和巴兹·奥尔德林成功将飞船降落在 .在地面上停留超过 21 个小时后，宇航员在鹰着陆器的一部分称为上升阶段中被炸飞。此后不久，他们在指挥舱中与迈克尔·柯林斯会合，后者将他们带回了地球。在前往地球之前，上升阶段被抛弃到太空中——美国宇航局的工程师认为它会在稍后的某个时候撞回月球表面。 Meador 报告说，上升阶段可能根本没有撞到月球，事实上，它可能仍在绕月球运行。米多尔开始他的调查，考虑是否有可能找到他认为会在月球上的上升阶段。他指出，作为 GRAIL 项目的一部分，美国宇航局已于 2012 年将航天器送入月球周围，以绘制月球引力场图。这表明他应该能够使用美国宇航局创建的称为通用任务分析工具的工具跟踪上升阶段下降到月球的过程，该工具可用于在已知引力场时绘制行星或卫星周围的航天器轨迹。从 GRAIL 添加后，Meador 使用不同的参数多次运行模拟，以模拟从放弃上升到现在可能存在的条件。他还包括考虑来自太阳和其他行星（水星除外）的重力的数据以及描述太阳辐射力的数据。他发现他的所有模拟都显示上升阶段保持稳定的轨道。 Meador 承认，其他因素也可能导致飞行器的消亡——它的剩余燃料可能会随着飞行器性能下降而爆炸，例如改变其轨道。但他也指出，如果该机构选择寻找它，美国宇航局拥有找到仍在轨道上的飞行器所需的技术。更多信息：James Meador，阿波罗 11 号鹰式登月舱上升台的长期轨道稳定性，arXiv:2105.10088v1 [physics.space-ph] arxiv.org/abs/2105.10088 引文：阿波罗 11 号登月台可能仍在轨道上运行月亮（2021 年，7 月 30 日）于 2021 年 7 月 30 日从 https://phys.org/news/2021-07-apollo-ascent-stage-orbiting-moon.html 检索到本文档受版权保护。除了出于私人学习或研究目的的任何公平交易外，未经书面许可，不得复制任何部分。内容仅供参考。", "note_en": "James Meador, an independent researcher at the California Institute of Technology, has found evidence that suggests the Apollo 11 ascent stage may still be orbiting the moon. He has written a paper outlining his research and findings and has posted it on the arXiv preprint server.    In 1969, NASA astronauts Neil Armstrong and Buzz Aldrin made history when they landed a craft successfully on the  . After more than 21 hours on the surface, the astronauts blasted off the surface in a part of the Eagle lander called the ascent stage. They soon thereafter rendezvoused with Michael Collins in the command module which carried them back to Earth. Before departing for Earth, the ascent stage was jettisoned into space—NASA engineers assumed that it would crash back to the moon&#39;s surface sometime later. Meador reports that the ascent stage may not have crashed into the moon after all and might, in fact, still be orbiting the moon.\n  Meador began his investigation by considering whether it might be possible to find the ascent stage, which he assumed would be on the   of the moon. He noted that NASA had sent spacecraft into   around the moon in 2012 as part of the GRAIL project to map the moon&#39;s gravitational field. That suggested he should be able to track the ascent stage&#39;s descent to the moon using a tool created by NASA called the General Mission Analysis Tool, which can be used to map spacecraft trajectories around planets or moons when their gravitational field is known.\n  After adding   from GRAIL, Meador ran the simulation multiple times using different parameters to simulate conditions that likely existed from the time when the ascent was jettisoned on up to the present. He also included data to take into account gravity from the sun and the other planets (except Mercury) and data describing forces due to solar radiation. He found that all of his simulations showed the ascent stage maintaining a steady orbit.\n  Meador acknowledges that other factors could have led to the demise of the craft—its remaining fuel could have exploded as the craft degraded, for example, changing its orbit. But he also notes that if the agency chooses to look for it, NASA possesses the technology needed to find the craft if it is still in orbit.        More information:\t\t\t\t\t\t\t\t\t\t\t\tJames Meador, Long-term Orbit Stability of the Apollo 11 Eagle Lunar Module Ascent Stage, arXiv:2105.10088v1 [physics.space-ph]  arxiv.org/abs/2105.10088\n     Citation: Apollo 11 ascent stage may still be orbiting the moon (2021, July 30) retrieved 30 July 2021 from https://phys.org/news/2021-07-apollo-ascent-stage-orbiting-moon.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2021-07-30 22:32:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阶段,stage,月球", "title": "阿波罗 11 号上升阶段可能仍在绕月运行", "title_en": "Apollo 11 ascent stage may still be orbiting the moon", "transed": 1, "url": "https://phys.org/news/2021-07-apollo-ascent-stage-orbiting-moon.html", "via": "", "real_tags": ["阶段", "stage", "月球"]}]