[{"category": "", "categoryclass": "", "imagename": "6e4cc7b8f451009921c3373dd5895d24.jpg", "infoid": 1069670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分布在美国东南部的 100 多个植物标本馆网络最近完成了一项艰巨的任务，即将植物学家和博物学家在 200 年的时间里收集的超过 300 万个标本完全数字化。该项目由美国国家科学基金会资助，是世界各地自然历史机构正在进行的更大范围的持续努力的一部分，目的是让研究广泛的进化、灭绝、范围变化和气候变化模式的研究人员能够轻松获取他们的生物收藏。在发表在《植物科学应用》杂志上的一项新研究中，参与该项目的研究人员分析了可以可靠地拍摄、数字化和数据库化的速度，以评估未来类似的努力可能会花费多少。 “对此感兴趣的每个人都很早就意识到我们谈论的劳动力和金钱有多少，”资深作者、田纳西大学查塔努加分校生物学副教授兼植物标本馆馆长乔伊·肖说。 Shaw 指出，尽管自世纪之交以来，大型机构一直在进行数字化工作，但迄今为止，还没有人制定出一个强大的框架来确定将一组馆藏带到网上的成本。 “没有人真正以任何规模进行过研究，以了解每分钟可以编录多少标本。”对于依赖越来越少的行政资金来维护其馆藏的小型机构而言，此类信息可能至关重要。在大学和文理学院，这些努力也严重依赖于学生，他们为大学研究学分或作为雇员进行工作，这带来了一系列相关的好处和陷阱。数字化标本通常是学生对自然历史的第一次直接体验，并且对许多人来说，它会成为对生物学的终生欣赏。对于某些人来说，正如该研究的四位作者的情况一样，这种欣赏后来在研究生学习和自然科学领域的职业生涯中达到顶峰。然而，学生就业本质上是短暂的，在学生毕业或转到其他项目时，用于培训学生的资源通常会重复。因此，在项目构思之初，Shaw 和他的同事希望将与学生培训相关的滞后以及随着学生获得经验而随后生产力的提高纳入他们的分析中。\n由此产生的估计非常精确，以至于 Shaw 和他的同事可以通过分析样本照片的上传率来准确确定课程何时放学。肖说：“学生们最终变得如此高效，以至于当课程放假、拿起手机的人数激增时，计算机和互联网的速度实际上开始减慢进程。”现在有成千上万的标本可以在线免费访问，Shaw 希望他​​们的数据能够帮助其他植物标本馆的工作人员了解他们的结果。本研究中的所有合作机构都是东南地区专业知识和收藏网络 (SERNEC) 的成员，该网络支持该地区的 200 多个植物标本馆，这些标本馆共容纳 1500 万个标本，其中大部分尚未数字化。随着城市化和森林砍伐导致栖息地丧失的数量不断增加，植物标本馆为研究人员提供了一个了解长期开发或拆除的生态系统的宝贵窗口。许多收藏品包括现已在野外灭绝的标本，而其他收藏品则发现了全新的物种。随着全球平均气温持续上升，科学家们越来越多地利用植物标本收集数据来分析气候变化已经对植物群落产生的影响。 “至少从文艺复兴时期开始，生物学家就以生物标本的形式积累了来自世界各地的物种数据，我们今天继续这种做法，”肖说。 “我们最近的工作是将这些生物标本的数据转换成一个可免费访问的在线数据库。这将是地球生物多样性中最大的数据集，而我们才刚刚开始构思研究、保护和土地管理问题这将用这个数据库来回答。”更多信息：Caleb Powell 等人，估计植物标本馆标本数字化率：考虑人类经验，植物科学中的应用（2021 年）。 DOI：10.1002/aps3.11415", "note_en": "A network of over 100 herbaria spread out across the southeastern United States recently completed the herculean task of fully digitizing more than three million specimens collected by botanists and naturalists over a span of 200 years. The project, which was funded by the National Science Foundation, is part of a larger, ongoing effort by natural history institutions worldwide to make their biological collections easily accessible to researchers studying broad patterns of evolution, extinction, range shifts, and climate change.    In a new study published in the journal  Applications in Plant Sciences, researchers involved in the project analyzed the rate at which   could be reliably photographed, digitized, and databased to assess how much similar efforts might cost in the future.\n  &#34;Everybody who was interested in this recognized very early on just how much labor and money we were talking about,&#34; said senior author Joey Shaw, associate professor of biology and herbarium curator at the University of Tennessee at Chattanooga.\n  Although digitization efforts had been underway at large institutions since the turn of the century, to date, no one had developed a robust framework for determining how much it cost to bring a set of collections online, noted Shaw.\n  &#34;No one had really been doing it at any sort of scale to understand how many specimens you could catalog per minute.&#34;\n  Such information can be vitally important for smaller institutions that rely on a dwindling fraction of administrative funding to maintain their collections. At universities and liberal arts colleges, these efforts are also heavily reliant on students, who perform the work for college research credit or as   employees, which comes with its own associated set of benefits and pitfalls.\n  Digitizing specimens is often the first direct experience students have with natural history, and, for many, it blossoms into a lifelong appreciation for biology. For some, as was the case for four authors on the study, this appreciation later culminates in graduate studies and careers in the natural sciences.\n  Student employment, however, is by nature transient, and resources invested in training students is often duplicated when they graduate or move on to other projects. So, at the outset of the project&#39;s conception, Shaw and his colleagues wanted to integrate into their analyses the lag associated with student training along with the subsequent increase in productivity as students gained experience.\n  The resulting estimates were incredibly precise, to the extent that Shaw and his colleagues could pinpoint exactly when classes let out by analyzing the rates at which specimen photographs were uploaded.\n  &#34;The students ended up being so efficient that the computer and internet speed actually starting slowing down the process when classes let out, when there&#39;s a surge of people picking up their phones,&#34; Shaw said.\n  With hundreds of thousands of specimens now freely accessible online, Shaw hopes that their data will help inform workers at other herbaria hoping to replicate their results. All of the partnering institutions in this study are members of the SouthEast Regional Network of Expertise and Collections (SERNEC), which supports more than 200 herbaria in the region that house a combined 15 million specimens, the majority of which have yet to be digitized.\n  With increasing amounts of habitat loss due to urbanization and deforestation, herbaria offer researchers a valuable window into ecosystems long-since developed or demolished. Many collections include specimens that are now extinct in the wild, while others have yielded the discovery of entirely new species. And as average global temperatures continue to rise, scientists are increasingly turning to herbaria collection data to analyze the effects climate change has already had on plant communities.\n  &#34;Biologists have accumulated species data from all over the world, in the form of biological specimens, since at least the Renaissance, and we continue this practice today,&#34; Shaw said. &#34;Our recent work has been to convert the data of these biological specimens into a freely accessible online database. It will be the largest dataset assembled on Earth&#39;s biodiversity, and we are only at the beginning of dreaming up research, conservation, and land management questions that will be answered with this database.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tCaleb Powell et al, Estimating herbarium specimen digitization rates: Accounting for human experience,  Applications in Plant Sciences (2021).  DOI: 10.1002/aps3.11415", "posttime": "2021-07-25 21:54:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,标本,digitize", "title": "植物标本馆将 300 万份标本数字化，现在可在线免费获取", "title_en": "Herbariums digitize three million specimens, now freely available online", "transed": 1, "url": "https://phys.org/news/2021-07-southeastern-herbaria-digitize-million-specimens.html", "via": "", "real_tags": ["免费", "标本", "digitize"]}, {"category": "", "categoryclass": "", "imagename": "f13c9189c83bbeeffd999a3c2f8afa4d.jpg", "infoid": 1069668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周六（7 月 24 日），这架小型直升机在其 Jezero Crater 家中的一个名为“凸起的山脊”的岩石区域上空翱翔时，超过了其总飞行距离的 1 英里（1.6 公里）标记。这次出动是 Ingenuity 的第 10 次也是最高的一次旅行，它于 2 月与 NASA 的毅力漫游者一起抵达火星。 Ingenuity 的首次飞行发生在 4 月。美国宇航局位于加利福尼亚州帕萨迪纳的喷气推进实验室的官员在周六晚间的 Instagram 更新中写道：“随着火星直升机今天的飞行成功，我们迄今为止的总飞行距离超过了 1 英里。” JPL 是 Perseverance 和 Ingenuity 任务控制中心。飞行 10 对 Ingenuity 来说是最具挑战性的，当直升机飞越“凸起的山脊”目标时，有 10 个不同的航路点可供直升机击中。它达到了 40 英尺（12 米）的最大高度，创下了新的高度记录，飞行了大约 310 英尺（95 米）。从起飞到降落，整个飞行持续了165.4秒。这只是不到3分钟。在飞行过程中，Ingenuity 预计将拍摄一系列图像，其中包括可以帮助科学家创建凸起山脊岩石立体图像的图像。这些山脊是科学家们正在考虑向 Perseverance 漫游车发送的区域任务。 JPL 任务经理在 7 月 23 日的状态更新中说：“我们将对凸起的山脊进行成像，因为它是毅力科学家发现有趣的领域，并且正在考虑在未来的某个时候访问。”当任务科学家检查飞行中的遥测和图像时，Ingenuity 现在停在它在火星上的第七个机场。 Ingenuity 直升机最初设计用于在火星上进行四次飞行，是第一款尝试在另一个世界进行动力飞行的飞行器。 4磅。 （1.8 公斤）直升机抵达火星时折叠在毅力号漫游车的腹部，最初预计在 30 火星天（称为 sols）内仅飞行四次，作为概念证明。\n这架太阳能直升机于 4 月完成了其主要任务，美国宇航局扩大了其运营范围。在这个扩展阶段，Ingenuity 被用于侦察，为 Perseverance 漫游车寻找有趣的地点。 “空中侦察有助于毅力火星探测器团队决定下一步采取什么行动，”喷气推进实验室官员在周六的更新中写道。通过 tmalik@space.com 给 Tariq Malik 发送电子邮件或关注他@tariqjmalik。关注我们@Spacedotcom、Facebook 和 Instagram。加入我们的太空论坛，继续谈论有关最新任务、夜空等的太空话题！如果您有新闻提示、更正或评论，请通过以下方式告诉我们：community@space.com。", "note_en": "The small chopper surpassed the 1-mile (1.6 km) mark of its total flight distance on Saturday (July 24) when soared over a rocky region called &#34;Raised Ridges&#34; at its Jezero Crater home. The sortie was the 10th and highest trip yet for Ingenuity, which arrived on Mars with NASA&#39;s  Perseverance rover in February. Ingenuity&#39;s  first flight occurred in April.\n  &#34;With the Mars Helicopter&#39;s flight success today, we crossed its 1-mile total distance flown to date,&#34; officials with NASA&#39;s Jet Propulsion Laboratory in Pasadena, California wrote in an  Instagram update late Saturday. JPL is home to the mission control for Perseverance and Ingenuity.\n    Flight 10 was the most challenging yet for Ingenuity, with 10 different waypoints for the helicopter to hit as it flew over its &#34;Raised Ridges&#34; target. It reached a maximum altitude of 40 feet (12 meters), a new record height, and flew about 310 feet (95 m). From take off to landing, the entire flight lasted 165.4 seconds. That&#39;s just under 3 minutes.\n  During the flight, Ingenuity was expected to snap a series of images, including ones that could help scientists create stereo images of the Raised Ridges rocks. The ridges are an area mission scientists are considering to send the Perseverance rover.\n &#34;We will be imaging Raised Ridges because it&#39;s an area that Perseverance scientists find intriguing and are considering visiting sometime in the future,&#34; JPL mission managers in a  July 23 status update.\n  Ingenuity is now parked on its seventh airfield on Mars as mission scientists examine telemetry and images from the flight.\n  Originally designed to fly four flights on Mars, the Ingenuity helicopter is the first vehicle to ever attempt powered flight on another world. The 4-lb. (1.8 kilograms) chopper arrived on Mars folded up in the belly of the Perseverance rover and was initially expected to fly only four flights over 30 Martian days (called sols) as a proof of concept.\n The solar-powered helicopter completed its primary mission in April, with NASA  extending its operations. In this extended phase, Ingenuity is being used for reconnaissance to seek out interesting spots for the Perseverance rover.\n &#34;Aerial scouting aids the Perseverance Mars rover team in deciding what moves to make next,&#34; JPL officials wrote in Saturday&#39;s  update.\n Email Tariq Malik at tmalik@space.com or follow him @tariqjmalik. Follow us @Spacedotcom, Facebook and Instagram.\n  Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:  community@space.com.", "posttime": "2021-07-25 21:53:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,火星,美国,美国宇航局,red", "title": "美国宇航局的火星直升机在第 10 次飞越红色星球时飞越 1 英里大关", "title_en": "NASA's Mars helicopter soars past 1-mile mark in 10th flight over Red Planet", "transed": 1, "url": "https://www.space.com/mars-helicopter-ingenuity-completes-first-mile-10th-flight", "via": "", "real_tags": ["nasa", "火星", "美国", "美国宇航局", "red"]}, {"category": "", "categoryclass": "", "imagename": "6b7cb75a2de9b1067aacdf349b13f2cc.jpg", "infoid": 1069667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对我们中的许多人来说，玩乐高是一种很棒的消遣，但随着学校和工作等现实世界的责任使我们年轻的精神变得迟钝，最终被搁置了。尽管如此，任何人用乐高拼搭仍然是合法的，而且有许多铁杆粉丝在成年后继续创作。 YouTuber BigPlanes 就是这样一位建造者，他最近通过忠实地重建空客 A380 而超越了自己。正如 AutoEvolution 所分享的那样，无论是在所涉及的工作量还是成品的实际物理尺寸方面，构建都是一个重要的构建。该模型拥有 7 英尺的翼展，6 英尺长，垂直稳定器本身足足有 3 英尺高。超过 40,000 个零件用于制造飞机，包括用于驱动控制面和转动发动机的几个乐高电机。这架飞机采用正宗的阿联酋航空公司制服，注重细节。这架飞机不仅外观好看，整个内部也建模。拆下飞机的车顶，可以看到驾驶舱和上层甲板，这里是头等舱和商务舱的所在地。在下方，下层甲板包含经济舱座椅，采用适当的沙漠主题配色方案，就像您在真正的阿联酋航空航班上看到的那样。就连空姐也符合主题，头戴阿联酋航空制服特有的帽子和围巾。如果它是阿联酋航空 A380 的一部分，您可以在这里找到它。船员宿舍、一流酒吧和豪华套房等细节都在场。还有一些不错的装饰，如可折叠起落架、货舱以及进入飞机的整整 16 扇门，就像真实的东西一样。在乐高世界中被称为小人仔的小雕像也都具有丰富的个性。有几个祖母，一个看起来可疑的闯入者，还有一个显然是从 19 世纪旅行后登机的人。后者的胡子确实是一个值得一看的景象。我们更习惯于看到来自乐高世界的令人印象深刻的汽车制造，包括丹麦积木制造商本身以及更多非官方来源。无论如何，它表明如果您掌握乐高工艺，您可以实现多少。当然，在零件和时间上的投资都是巨大的。在数以千计的街区之上，这座建筑花了整整 10 个月的时间来建造。但是，如果您在接下来的一年左右没有做任何事情，那么您当然可以自己进行这样的构建。只要确保你在房子里有空间。", "note_en": "For many of us, playing with Lego was a great pastime that eventually fell by the wayside as real-world responsibilities like school and work dulled our youthful spirit. Despite this, it remains legal for anyone to build with Lego, and there are many diehard fans that continue to create well into adulthood. YouTuber  BigPlanes is one such builder, who has recently outdone himself  by faithfully recreating the Airbus A380.\n As shared by  AutoEvolution, the build is a substantial one both in the effort involved and the actual physical size of the finished product. The model boasts a seven-foot wingspan, is six feet long, and the vertical stabilizer itself is a full three feet high. Over 40,000 parts went into constructing the plane, including several Lego motors for actuating the control surfaces and turning the engines.\n   The plane is finished in an authentic Emirates airline livery, with attention down to the finest details. The plane doesn&#39;t just look good on the outside either, with the entire interior modeled as well. Removing the roof of the plane reveals the cockpit and upper deck, home to first and business class. Underneath, the lower deck contains the economy class seats, in a suitably desert-themed color scheme just as you might see on a real Emirates flight. Even the flight attendants fit the theme, wearing the characteristic hat and scarf of the Emirates uniform.\n   If it&#39;s a part of an Emirates A380, you&#39;ll find it here. Details like the crew sleeping quarters, first-class bars, and luxury suites are all present. There&#39;s also nice touches like the foldable landing gear, the cargo hold, and a full 16 doors to access the aircraft, just like the real thing. The figurines, known as minifigs in the Lego world, all have plenty of personality, too. There&#39;s a couple of grandmas, a suspicious-looking interloper in coach, and one man who apparently boarded the flight after time traveling from the 19th Century. The latter&#39;s mustache is truly a sight to behold.\n  We&#39;re more used to seeing  impressive car builds from the Lego world, both from  the Danish blockmaker itself as well as from  more unofficial sources. Regardless, it goes to show just how much you can achieve if you master the Lego craft. Of course, the investment in both parts and time are significant, though; on top of the thousands of blocks, the build took a full 10 months to construct. If you&#39;re not doing anything for the next year or so, though, you could certainly take on such a build yourself. Just make sure you&#39;ve got room in the house.", "posttime": "2021-07-25 21:52:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现场,airbus,乐高", "title": "乐高空中客车 A380 是世界上最大的客机的现场娱乐", "title_en": "Lego Airbus A380 Is a Spot-On Recreation of the World’s Largest Airliner", "transed": 1, "url": "https://www.thedrive.com/news/41628/lego-airbus-a380-is-a-spot-on-recreation-of-the-worlds-largest-airliner", "via": "", "real_tags": ["现场", "airbus", "乐高"]}, {"category": "", "categoryclass": "", "imagename": "bb359590e3f20d309716d5ca20827b8a.jpeg", "infoid": 1069666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "单击“注册”，即表示您同意接收来自 Insider 的营销电子邮件以及其他合作伙伴的优惠，并接受我们的服务条款和隐私政策。一位前雇员告诉 Insider，特斯拉的太阳能部门 Tesla Energy 要求一个由 20 多名员工组成的团队在社交媒体和评论网站上搜索客户投诉。这位今年离开公司并要求匿名的人士表示，该团队在解决客户问题的同时，还试图让客户删除他们的帖子。这位前雇员说，一个由 9 人组成的单独团队专门寻找针对首席执行官埃隆马斯克的职位。这与特斯拉能源公司 1 月份为“客户支持专家”发布的招聘广告相呼应——该广告称，求职者将解决针对马斯克的“社交媒体升级”。一位不愿透露姓名的特斯拉能源公司前经理还表示，有一个专门的团队在寻找社交媒体投诉。 “他们基本上只会查找#TeslaEnergy、#Elon，以及任何与特斯拉、能源和埃隆有关的内容，”他们说。除了解决客户的问题外，两名员工还表示，工作人员被指示礼貌地要求客户删除他们在社交媒体上的投诉。 Insider 核实了两名前雇员的身份和就业情况。第一位前员工表示，他们没有在任何一个社交媒体投诉团队工作，通常处理通过特斯拉客户服务渠道提出的投诉。\n但他们也被期望在“停机”期间在互联网上搜索不满意的客户。据这位前员工估计，他们每天平均要处理来自常规客户服务渠道的 18 条客户投诉，因此他们不得不抽出时间在社交媒体上寻找愤怒的帖子。他们说：“几乎没有停机时间，这就是困难的原因，”他们补充说，他们在休息时间工作以避免被截止日期淹没。这位前经理表示，与通过客户服务相比，在社交媒体上发帖有时是客户让公司解决投诉的更快方式。一位不愿透露姓名的特斯拉能源客户告诉 Insider，当他们的太阳能屋顶合同出现问题时，他们从专门的项目经理那里得到了确切的建议。 “她让我上网投诉……在 Twitter 或 Facebook 上，因为她说这家公司唯一听的就是社交媒体情绪，”该客户说。这位客户在 Twitter 上发帖，但表示他们不知道这是否有影响，因为特斯拉从未就此事专门联系过他们。特斯拉能源的客户在 5 月份告诉 Insider，该公司已经连续数周让他们陷入困境。 Insider 为该报告采访的一位潜在客户表示，特斯拉代表在他在 Twitter 上抱怨后给他打电话。同一位客户在一封电子邮件中告诉 Insider，特斯拉没有人要求他撤下这条推文。你在特斯拉能源公司工作吗？通过 ihamilton@insider.com、iahamilton@protonmail.com 或 acooban@insider.com 联系这些记者。始终使用非工作电子邮件地址。\n注册接收来自 Insider 的通知！随时了解您想知道的内容。形成“X”的两条​​交叉线。它指示一种关闭交互或关闭通知的方式。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n    Tesla&#39;s solar-power unit,  Tesla Energy, asks a team of more than 20 employees to scour social media and reviews sites for customer complaints, a former employee told Insider.\n The person, who left the company this year and asked not to be named, said that as well as solving customers&#39; issues, the team tried to get customers to delete their posts.\n A separate team of nine people looked specifically for posts aimed at CEO Elon Musk, the ex-employee said. This chimes with a job ad Tesla Energy  put out in January for a &#34;Customer Support Specialist&#34; — the advert said applicants would address &#34;social media escalations&#34; aimed at Musk.\n A former manager at Tesla Energy, who worked at the company until last year and asked not to be named, also said a dedicated team searched for social-media complaints. &#34;They would basically just look up #TeslaEnergy, #Elon, just anything that has to do with Tesla and energy and Elon,&#34; they said.\n     On top of resolving the customer&#39;s issue, both employees said staff were instructed to politely ask customers to delete their social media complaints. Insider verified the identities and employment of both former employees.\n  The first former employee said they did not work on either of the social media complaint teams, and usually dealt with complaints that came through Tesla&#39;s customer-service channels.\n But they were also expected to scour the internet for unhappy customers in their &#34;downtime.&#34; The ex-employee estimated they dealt with an average of 18 complaints from customers from the regular customer service pipeline every day, so they had to find time around these to look for angry posts on social media.\n     &#34;There&#39;s almost no downtime and that&#39;s what makes it difficult,&#34; they said, adding that they worked during breaks to avoid getting swamped by deadlines.\n The former manager said that posting on social media was sometimes a faster way for customers to get the company to address complaints than going through customer service.\n A Tesla Energy customer, who asked not to be named, told Insider they received this exact advice from their dedicated project manager when they had problems with their solar roof contract.\n &#34;She told me to go online and complain ... on Twitter or Facebook, because she said the only thing this company listens to is social media sentiment,&#34; the customer said. The customer posted on Twitter, but said they didn&#39;t know if it made a difference as they were never specifically contacted by Tesla about it.\n     Tesla Energy customers told Insider in May that the company had ghosted them for weeks on end. One prospective customer that Insider spoke to for that report said a Tesla rep called him after he complained on  Twitter. The same customer told Insider in an email that nobody from Tesla asked him to take the tweet down.\n   Do you work at Tesla Energy? Contact these reporters at   ihamilton@insider.com,   iahamilton@protonmail.com, or  acooban@insider.com.  Always use a non-work email address.\n  Sign up for notifications from Insider! Stay up to date with what you want to know.\n            Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-07-25 21:14:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,部门,employees,客户", "title": "特斯拉的太阳能部门要求员工在社交媒体上搜索关于公司和埃隆马斯克的投诉，试图让客户删除他们的帖子，前雇员说", "title_en": "Tesla's solar division asks employees to scour social media for complaints about both the company and Elon Musk, trying to get customers to delete their posts, former employees say", "transed": 1, "url": "https://www.businessinsider.com/tesla-solar-energy-elon-musk-complaints-social-media-panels-roof-2021-7", "via": "", "real_tags": ["特斯拉", "部门", "employees", "客户"]}, {"category": "", "categoryclass": "", "imagename": "7abe909c21c5470fe8e846f1e78d8acd.jpg", "infoid": 1069665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据最近的招聘信息，亚马逊的支付团队正在招聘一名数字货币和区块链专家。该帖子表明亚马逊可能会更认真地看待比特币等加密货币。亚马逊正在寻求为其支付团队增加一名数字货币和区块链专家，这表明该公司可能会更认真地研究比特币等加密货币。根据最近的招聘信息，亚马逊的支付受理和体验团队正在寻求聘请“经验丰富的产品负责人来制定亚马逊的数字货币和区块链战略和产品路线图”。 “您将利用您在区块链、分布式账本、中央银行数字货币和加密货币方面的专业知识，为应该开发的功能开发案例，推动整体愿景和产品战略，并获得领导者对新功能的支持和投资， “根据Insider之前报道的招聘信息。亚马逊发言人在一份声明中表示：“我们受到加密货币领域创新的启发，并正在探索这在亚马逊上的样子。我们相信未来将建立在新技术之上，这些新技术能够实现现代、快速和廉价付款，并希望尽快为亚马逊客户带来未来。”该公司的云计算部门 Amazon Web Services 提供一种称为托管区块链的服务。但亚马逊不接受任何加密货币作为其产品的付款。亚马逊首席执行官 Andy Jassy（当时的 AWS 首席执行官）在 2017 年表示，该公司并不是特别关注区块链技术，尽管他承认亚马逊正在“仔细观察”。\n近年来，像比特币这样的数字货币越来越受欢迎，导致更多机构采用。科技公司也对加密货币热身，包括 Facebook，它支持了一个名为 Diem 的数字货币项目。今年 5 月，苹果公司表示，它正在寻找一名首席谈判代表，与“替代支付”合作伙伴建立合作伙伴关系，将加密货币列为潜在工作专长的一个领域。", "note_en": "Amazon&#39;s payments team is looking to hire a digital currency and blockchain expert, according to a recent job posting.\n The posting signals that Amazon may be taking a more serious look at cryptocurrencies, such as bitcoin.\n Amazon is looking to add a digital currency and blockchain expert to its payments team, suggesting the company could be taking a more serious look at cryptocurrencies such as bitcoin.\n According to  a recent job posting, Amazon&#39;s payments acceptance and experience team is seeking to hire an &#34;experienced product leader to develop Amazon&#39;s Digital Currency and Blockchain strategy and product roadmap.&#34;\n  &#34;You will leverage your domain expertise in Blockchain, Distributed Ledger, Central Bank Digital Currencies and Cryptocurrency to develop the case for the capabilities which should be developed, drive overall vision and product strategy, and gain leadership buy-in and investment for new capabilities,&#34; according to the job posting, which was  previously reported by Insider.\n  An Amazon spokesperson said in a statement: &#34;We&#39;re inspired by the innovation happening in the cryptocurrency space and are exploring what this could look like on Amazon. We believe the future will be built on new technologies that enable modern, fast, and inexpensive payments, and hope to bring that future to Amazon customers as soon as possible.&#34;\n The company&#39;s cloud-computing unit, Amazon Web Services, offers a service called  managed blockchain. But Amazon doesn&#39;t accept any cryptocurrencies as payment for its products. Amazon CEO Andy Jassy (then CEO of AWS)  said in 2017 that the company wasn&#39;t particularly focused on blockchain technology, though he acknowledged Amazon was &#34;watching it carefully.&#34;\n Digital currencies like bitcoin have grown in popularity in recent years, leading to more institutional adoption. Technology companies have also warmed up to cryptocurrency, including  Facebook, which has backed a digital currency project called Diem. In May,  Apple  said it was looking to hire a lead negotiator to strike partnerships with &#34;alternative payments&#34; partners, listing cryptocurrency as one area of potential job expertise.", "posttime": "2021-07-25 21:06:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "区块链,amazon,亚马逊,数字,hiring", "title": "亚马逊聘请“数字货币和区块链”负责人，确认对“现代”支付感兴趣", "title_en": "Amazon's Hiring a 'Digital Currency and Blockchain' Lead, Confirms Interest in 'Modern' Payments", "transed": 1, "url": "https://www.cnbc.com/2021/07/23/amazon-is-hiring-a-digital-currency-and-blockchain-expert.html", "via": "", "real_tags": ["区块链", "amazon", "亚马逊", "数字", "hiring"]}]