[{"category": "", "categoryclass": "", "imagename": "528432c491e7e7092ba03128585b69f6.jpg", "infoid": 1001042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软选择Linux而不是Windows10来支持物联网安全平台，现在它向黑客提供10万美元(约合8.1万GB)的赔偿，如果他们能攻破这个平台的话。\n首先，这并不是入侵任何旧Linux操作系统的挑战。相反，它是微软心目中非常具体的Linux操作系统：一种为其物联网(IoT)端到端安全平台提供动力的操作系统。\nAzure Sphere操作系统是基于Linux的定制高级且非常紧凑的操作系统，并结合安全的应用程序环境进行额外的强化。把这些放到硬件、软件和不可避免的云的混合中，你就会得到微软的物联网端到端安全平台。\nAzure Sphere旨在帮助降低物联网方程式中的大部分风险，这也是微软于5月5日宣布其Azure Sphere安全研究挑战赛进入新阶段的原因。\n这项新挑战将从6月1日开始，为期三个月。然而，要申请参加黑客赏金计划，安全研究人员需要在5月15日之前提交申请。\n被接受进入挑战池的50名黑客将获得进行基于场景的漏洞发现测试所需的所有资源。资源，包括对Azure Sphere开发工具包的完全访问权限，以及对研究期间可能使用的其他Microsoft产品和服务的完全访问权限。\n作为微软正在采取的整体风险方法的一部分，希望这一挑战能让安全研究黑客社区参与到发现任何本来可能不会被注意到的关键漏洞。\n不被注意，也就是说，直到威胁行为者发现并利用它们。微软希望没有这样的漏洞能够在Azure Sphere的Pluton root信任安全子系统上执行代码，但如果有，那么可能就是10万美元。\n找到一个漏洞，允许在自定义Linux内核下面的Secure World上执行代码，只有Microsoft提供的代码才能运行安全监视器，而且还可能带来10万美元的额外损失。\n安全是一项团队运动，微软安全响应中心的安全项目经理Sylvie Liu说，安全研究人员对于确保技术尽可能安全非常重要。", "note_en": "Microsoft chose Linux instead of Windows 10 to power an IoT security platform, and now it&#39;s offering hackers $100,000 (£81,000) if they can break it.\n    For a start, this isn&#39;t a challenge to hack into any old Linux OS. Instead, it&#39;s a very specific Linux OS that Microsoft has in mind: one that powers its Internet-of-Things (IoT) end-to-end security platform.\n    The Azure Sphere operating system is a customized high-level and very compact Linux-based one, combined with a secure application environment for additional hardening. Throw this into a mix of hardware, software, and the inevitable cloud, and you get Microsoft&#39;s IoT end-to-end security platform.\n     Azure Sphere is designed to help take much of the risk out of the IoT equation, and that&#39;s why Microsoft has announced, May 5, a new phase in its  Azure Sphere Security Research Challenge.\n         This new challenge will only run for a three-month period starting June 1. However, to apply to take part in the hacking bounty program, security researchers will need to  submit their applications before May 15.\n  The 50 hackers who are accepted into the challenge pool will get all the resources they need to take on the scenario-based vulnerability discovery test. Resources that will include full access to the Azure Sphere development kit as well as to other Microsoft products and services that could be used during their research.\n       As part of the holistic approach to risk that Microsoft is adopting, it is hoped that the challenge will engage the security research hacking community to uncover any critical vulnerabilities that might otherwise go unnoticed.\n  Unnoticed, that is, until threat actors find and exploit them. Microsoft would hope that there are no such vulnerabilities that could enable the execution of code on the Pluton root of trust security subsystem for Azure Sphere, but if there are, then that could be $100,000 right there.\n  Find a vulnerability that would enable code execution on Secure World, situated below the custom Linux kernel, and where only Microsoft-supplied code should be able to run courtesy of the Security Monitor, and there&#39;s another potential $100,000.\n  &#34;Security is a team sport,&#34; Sylvie Liu, the security program manager at the Microsoft Security Response Center, said, &#34;and security researchers are so important to making technology as secure as possible.&#34;", "posttime": "2020-05-07 19:53:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,linux,操作系统,破解,微软", "title": "如果你能破解这个Linux操作系统，微软会给你10万美元", "title_en": "Microsoft Offers $100k If You Can Hack This Linux Operating System", "transed": 1, "url": "https://www.forbes.com/sites/daveywinder/2020/05/06/microsoft-offers-100000-if-you-can-hack-this-linux-operating-system/", "via": "", "real_tags": ["microsoft", "linux", "操作系统", "破解", "微软"]}, {"category": "", "categoryclass": "", "imagename": "d40b93c330d0c98284324f47733a083e.jpg", "infoid": 1001041, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "摘要：一项新的研究报告称，双语能力可能对大脑老化有积极影响，特别是在执行功能方面。这项研究的发现与其他研究相矛盾，表明双语确实对老年人的认知能力下降有保护作用。\n下次当你在用另一种语言交谈时想要说英语时，尽量不要这样做，你的大脑会为此感谢你的。\n新加坡科技与设计大学(SUTD)的研究人员研究发现，积极的双语能力-定期平衡使用两种语言和语言转换-将提供保护，防止大脑老化。这篇论文发表在“老年学期刊：心理科学”上。\n目前关于双语对成人大脑影响的文献并不一致，也缺乏明确的趋势-一些报告称，熟练掌握第二语言意味着更高的神经效率，而另一些文献则得出结论，这根本没有什么不同。因此，SUTD的研究人员开始探索在正常衰老过程中，双语可以作为防止认知衰退的保护源的执行控制机制和背景。\n执行功能是大脑执行的复杂的、更高层次的过程。这些功能主要允许人们通过关注相关信息而忽略干扰来保持注意力，在执行之前保持信息，以及运动规划。\n在新加坡进行的这项研究中，60到84岁的认知健康的老年人被要求完成一系列计算机化的执行控制任务，他们会说中文和英语。\n选定的任务通常在以前的研究中使用，并参考涉及老年人的成熟理论来确定，这些理论表明，随着年龄的增长，表现会下降。为了进行更全面的检查，研究人员使用四项不同的任务测量了六个不同的执行控制领域，所有这些任务之前都与双语能力有关，同时控制了年龄、处理速度和流体智力等个人变量。\n研究发现，在执行控制的目标保持和冲突监控方面，积极使用两种语言且语言转换频率较低，预示着更好的表现。这表明，在正常衰老过程中，双语能力可能是防止认知衰退的一个保护源。重要的是，活跃的双语能力可以被视为一种生活方式因素，可以缓冲与正常衰老相关的认知衰退。\n不在两种语言之间转换并“保持”在目标语言中的努力比在积极使用两种语言的情况下在两种语言之间转换对认知的要求更高。我们的研究表明，高年级学生在与语言控制相关的大脑区域发展出了更有效的神经组织，这也与涉及执行控制的区域重叠，“SUTD的首席首席研究员、通讯作者邱伟副教授解释道。\n来源：新加坡科技设计大学媒体联系方式：Jessica Sasayiah-新加坡科技设计大学图片来源：图片属于公共领域。\n原始研究：封闭访问“老年中积极的双语能力：平衡的双语使用和较少的语言转换与更好的冲突监控和目标保持能力有关”。作者：Clara G H Chan，PhD，W Quin Yow，PhD，Adam Oei，PhD。老年学期刊：心理科学DOI：10.1093/geronb/gbaa058。\n老龄化中的积极双语：平衡的双语使用和较少的语言转换与更好的冲突监控和目标保持能力有关。\n目的经验相关神经可塑性研究表明，积极掌握两种语言的双语者在与语言控制相关的脑区会形成更有效的神经组织，这些脑区也与执行控制相关的区域重叠。我们的目的是研究活跃的双语能力-表现为两种语言的定期平衡使用和语言转换-可能与高度熟练的健康老年双语者的执行控制的不同领域有关，控制年龄、处理速度和流畅的智力。\n方法参与者是76名居住在社区的老年人，他们报告身心健康，没有表现出认知障碍的迹象。他们完成了一份关于他们语言背景的自我报告问卷，两项先前确定的协变量的计算机测量(由双选项反应时间(RT)任务衡量的处理速度和由乌鸦的进步矩阵衡量的流体智力)，以及一系列计算机化的执行控制任务(颜色-形状任务切换，Stroop，Fanker和Spatial 2-back任务)，以及一组计算机化的执行控制任务(Color-Shape Task Switching，Stroop，Fanker和Spatial 2-Back任务)。\n结果回归分析表明，即使在控制了年龄、加工速度和流畅智力之后，双语使用越平衡和语言转换频率越低，目标维持性(颜色-形状任务转换中的非转换实验RT)和冲突监控能力(颜色-形状任务转换和侧翼任务中的全局RT)也会更高。\n讨论结果表明，积极的双语能力可能有助于老年人双语者在自然年龄相关的下降中保持特定的执行控制能力。", "note_en": "Summary: A new study reports bilingualism may have a positive effect on brain aging, specifically when it comes to executive function. The findings of this study contradict other research, suggesting bilingualism does have a protective effect against cognitive decline in aging.\n  The next time you get the urge to lapse into English while conversing in your other language, try not to and your brain will thank you for it.\n Researchers from the Singapore University of Technology and Design (SUTD) examined and found that active bilingualism – the regular balanced use of two languages and language switching – will offer protection against the brain’s aging process. The paper was published in the  Journals of Gerontology: Psychological Sciences.\n Current literature on the effects of bilingualism on the adult brain were inconsistent and lacking in clear trends – some reported that second language proficiency meant greater neural efficiency, whereas others concluded that it made no difference whatsoever. So the researchers from SUTD set out to explore the executive control mechanisms and context under which bilingualism can be a protective source against cognitive decline in the normal aging process.\n Executive functions are complex, higher order processes that the brain performs. These functions mainly allow people to maintain their attention by focusing on relevant information and ignoring distractors, maintain information until execution as well as motor planning.\n In the study that was conducted in Singapore, cognitively healthy seniors aged between 60 to 84 years old who were bilingual in Chinese and English were tasked to complete an array of computerized executive control tasks.\n Tasks selected were commonly used in previous studies and identified with reference to well-established theories involving older adults that showed decreased performance with aging. For a more holistic examination, the researchers measured six different domains of executive control using four different tasks, all of which had been previously associated with bilingualism, while controlling for individual variables such as age, processing speed and fluid intelligence.\n It was found that active usage of two languages with less frequent language switching predicted better performance in the goal maintenance and conflict monitoring aspects of executive control. This suggests that bilingualism can be a protective source against cognitive decline in the normal aging process. Importantly, active bilingualism can be seen as a lifestyle factor that could buffer against cognitive declines that are associated with normal aging.\n “The effort involved in not switching between languages and “staying” in the target language is more cognitively demanding than switching between languages while actively using both languages. Our study shows that the seniors developed more efficient neural organization at brain regions related to language control, which also overlap with areas involved in executive control,” explained lead principal investigator and corresponding author Associate Professor Yow Wei Quin from SUTD.\n  Source:   Singapore University of Technology and Design   Media Contacts:   Jessica Sasayiah – Singapore University of Technology and Design   Image Source:  The image is in the public domain.\n Original Research: Closed access   “Active Bilingualism in Aging: Balanced Bilingualism Usage and Less Frequent Language Switching Relates to Better Conflict Monitoring and Goal Maintenance Ability”. by Clara G H Chan, PhD, W Quin Yow, PhD, Adam Oei, PhD.   Journals of Gerontology: Psychological Sciences doi: 10.1093/geronb/gbaa058\n   Active Bilingualism in Aging: Balanced Bilingualism Usage and Less Frequent Language Switching Relates to Better Conflict Monitoring and Goal Maintenance Ability\n Objectives  Experience-related neuroplasticity suggests that bilinguals who actively manage their two languages would develop more efficient neural organization at brain regions related to language control, which also overlap with areas involved in executive control. Our aim was to examine how active bilingualism—manifested as the regular balanced use of two languages and language switching—may be related to the different domains of executive control in highly proficient healthy older adult bilinguals, controlling for age, processing speed, and fluid intelligence.\n Methods  Participants were 76 community-dwelling older adults who reported being physically and mentally healthy and showed no signs of cognitive impairment. They completed a self-report questionnaire on their language background, two computer measures for previously identified covariates (processing speed as measured by two-choice reaction time (RT) task and fluid intelligence as measured by the Raven’s Progressive Matrices), as well as a battery of computerized executive control tasks (Color-shape Task Switching, Stroop, Flanker, and Spatial 2-back task).\n Results  Regression analyses showed that, even after controlling for age, processing speed, and fluid intelligence, more balanced bilingualism usage and less frequent language switching predicted higher goal maintenance (non-switch trials RT in Color-shape Task Switching) and conflict monitoring abilities (global RT in Color-shape Task Switching and Flanker task).\n Discussion  Results suggest that active bilingualism may provide benefits to maintaining specific executive control abilities in older adult bilinguals against the natural age-related declines.", "posttime": "2020-05-07 19:52:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语言,linguists,任务", "title": "会说两种语言的人有更好的头脑", "title_en": "Bi-linguists have better brains", "transed": 1, "url": "https://neurosciencenews.com/bilingual-brain-aging-16340/", "via": "", "real_tags": ["语言", "linguists", "任务"]}, {"category": "", "categoryclass": "", "imagename": "64f68ae74af564cf1c8d0459ee4ea768.gif", "infoid": 1001040, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管鼠标指针不是苹果发明的，但历史已经巩固了它在将其从默默无闻中拖入主流用途的地位。它的日常用途由施乐公司首创，后来与苹果公司的苏珊·卡雷的一些标志性工作相结合，使指针成为我们在数字空间的化身已有近40年的时间。\n箭头在屏幕上等待。略微倾斜，有一条笔直的边和45度的坡度，通向逐个像素的锐利的点。它是一种精确的仪器，可以在几英尺远的屏幕上点击微小的目标。最初的光标是一个点，然后是一条笔直向上的线。它在“所有演示之母”中得到了展示--大约一个半小时的演示，其中不仅包含了世界上第一次看到鼠标，还包含了超级链接、文档协作、视频会议等。\n不过，这场表演的明星是组成鼠标光标的一小段像素。这是机器里的人性--机器里的人性。*不像以前的文本输入模型，在打字机的传真机中一个接一个地放置字符，这是一条系绳，将我们胚胎连接到Aleph。我们第一次在屏幕上尴尬地看到自己。\n我们不清楚道格·恩格尔巴特最初设想的“直立箭头”为什么会呈现我们今天所知的精确角度。关于这一变化有许多自信的猜测，但实际答案很少-我们唯一能确定的是，就像一名准备好的运动员一样，箭头指针几十年来一直在那里，等待着向我们的目标飞跃。但在过去的几年里，多亏了触控设备，我们有了一个新的、更丰满的短跑运动员：我们的手指。\niPhone和后来的iPad并没有立即重新发明光标。取而代之的是，它完全移除了它。用你的肉食空间指尖替换机器中的数字幽灵。触摸互动带来了“粘性”--意图和行动的1：1交配。如果你碰了什么东西，它就做了些什么。如果你拖着手指，内容就会随之而来。最后，这是以人为中心的计算。\n然后，几周前，苹果推出了一种新的指针--这是像素和推送这两个世界的混合体。我认为，iPad的光标值得仔细研究。这是一个开创性的混合，来自地球上最受关注的创意工厂之一。\n为了更深入地研究这款全新的光标和它的交互模式，我与苹果高级副总裁克雷格·费德里吉(Craig Federighi)谈到了它的开发，以及苹果团队做出的一些选择。首先，让我们讨论一些使光标与…之前的游标有很大不同的东西。却又出奇的熟悉。\niPad光标呈现出一个小圆圈的形状，这是屏幕触摸传感器读取指尖的方式的归一化版本。这已经不一样了。它将让你置身于机器内部的想法更上一层楼，将触摸的物理本质与一步即可移除的触控板体验融为一体。\n它的大小和形状也是对iPad用户界面本质的认可。它是从头开始设计的，是一种触摸先行的体验。以至于当一款应用程序没有针对该模式进行适当的优化时，它会感到笨拙、笨拙。光标作为你手指的头像，无论它落在哪里都会产生同样的影响。\n老实说，这种想法本可以止步于此，这将是完全足够的。作为指针的粗糙的手指传真。但这个概念被推向了更远的地方。当你接近一个交互元素时，圆圈就会伸出来，平滑地接触，然后拥抱并封装按钮。\n可变光标速度的想法在这里也得到了进一步的推广。当你靠近屏幕上的一个物体时，它会改变它的旅行速度，以更快地到达你想要的地方，但它是根据上下文来实现的，而不是像MacOS或Windows那样是线性的。\n预测数学被应用到你要去的地方，而你不必精确地降落在那里，然后应用一点惯性来让你保持在你需要的地方，而不会过度射击。一旦你在图标上，手指的小动作就会抖动图标，这样你就知道你还在那里。\n当你停止移动光标时，光标甚至会消失，就像你把它从屏幕上移走时手指的压力消失一样。在某些情况下，光标拥有元素本身，成为按钮，并在其周围投射出一种轻盈的空灵光芒。\n这道混合了路径预测、动画、物理和有趣调味料的炒菜都被烹制成一道菜，尽最大努力复制我们不假思索地做的事情的感觉：伸手直接触摸什么东西。\n用设计术语来说，这些都是“可负担性”。他们在触摸板上进行的操作比用手指要难得多，而且让人感觉同样简单。要在Crystal中渲染这一点，您只需观察一个整天使用iPad的孩子，尝试使用鼠标来完成同样的任务。\n光标可以在上下文中根据需要流畅地变化的想法并不是什么新鲜事。I型梁(当您将光标悬停在可编辑文本上时显示的光标类型)就是一个很好的例子。在施乐帕洛阿尔托实验室(Xerox Parc)--老鼠的出生地--也进行了早期实验，也利用了一个变换光标。他们甚至尝试了颜色改变，但从来没有完全理解屏幕元素作为交互对象的概念-选择模仿键盘的功能。\n但从来没有像这样的光标。设计用来模仿你的手指，但也用来伸展、挤压、团状、匆忙和休息。这是风景中独一无二的一道亮点。\n考虑到苹果的每一次发布都受到如此严格的审查，iPad光标没有被破坏是一个小小的奇迹。当它作为现有iPad和未来iPad的软件更新发布时，人们立即开始测试它，并发现它的行为方式与其前身截然不同。*。\n在苹果内部，团队乐于看到外界的猜测，即苹果将追求一条相对标准的道路-在iPad屏幕上显示指针-并将其作为动力，提供更丰富的东西，这是一种与魔术键盘搭配的解决方案。有传言称，苹果将在iPadOS上增加光标支持，但直到最后一刻，人们都认为我们会看到一个传统的指针，让iPad尽可能接近“笔记本”的行为。\n自从2018年iPad Pro带有智能连接器首次亮相以来，我们这些每天使用iPad Pro的人一直在等待苹果为这款设备发货一个“真正的”键盘。在我对新iPad Pro和魔术键盘的评论中，我回顾了我使用智能键盘对开本的体验，但我可以说，新设计对于笨重的打字员来说是令人难以置信的。当然，它还带来了世界级的触摸板。\n当团队着手开发新的光标时，规范要求某种感觉像是真正的指针体验，但这在哲学上与iPad的本质融为一体。\n在某些方面，新的iPadOS光标的研发工作始于2015年苹果电视更新的界面。如果你已经注意到iPadOS上光标的行为方式和苹果电视上光标的工作方式之间有一些相似之处，那么你并不是唯一一个这样做的人。例如，有熟悉的从一个兴趣点到另一个兴趣点的“跳跃”，以及当你将手指“悬停”在按钮上时，按钮的轻微光泽。\n费德里吉说：“有一个过程可以准确地找出各种元素是如何协同工作的。”“我们知道我们想要的是一个非常以触摸为中心的光标，它不会传达不必要的精确度。我们知道我们有一种类似于Apple TV的焦点体验，我们可以以一种令人愉快的方式利用这一体验。我们知道，在处理文本时，我们希望提供更多的回馈感。“。\n“我如此喜欢iPadOS所发生的事情的部分原因是我们从如此多的来源汲取了经验。这一经验来自我们在TVOS上的工作、多年在Mac上的工作，以及iPhone X和早期iPad的起源，创造出让iPad感觉非常自然的新东西。“\n苹果电视的界面不仅“激发”了光标的灵感--负责的核心设计团队跨部门工作，包括苹果电视、iPadOS和其他产品。\n但要理解这一过程，你必须更广泛地了解用户在与苹果设备交互时拥有的选项。\n这些模式中的每一种都有各自的优势或劣势。当然，手指是一种不精确的仪器。该团队知道，他们必须将手指的不精确性质告知用户，但也要尊重需要精确的上下文。\n苹果接近了干净的体验。团队知道他们拥有实现这一目标的原始要素。他们必须有一个触敏的光标，他们知道Apple TV光标显示出了希望，他们知道当涉及到文本时，更多的互动反馈是重要的。\n费德里吉说：“当我们第一次考虑光标时，我们需要它来反映在不需要高精度的情况下使用手指的自然和轻松的体验，比如访问主屏幕上的图标时，但它也需要非常自然地缩放到高精度的任务中，比如编辑文本。”\n所以我们想出了一个圆圈，优雅地变形来完成手头的任务。例如，它会变形成按钮周围的焦点，或者跳到另一个按钮上，或者在有意义的时候会变形成更精确的东西，比如用于文本选择的I型梁。\n光标的预测性本质就是他们提出的“如何将触摸模拟缩放到高精度？”的答案。\n但团队需要弄清楚哪些情况需要精确度。例如，在附近的另一个元素上与一个元素交互。这就是惯性和折断的用武之地。具体地说，iPad是一台多功能计算机，因此它比任何单一输入设备都要复杂得多。平台上的任何光标实现都有多个模态可供服务。他们必须在不破坏你用一个主要的触摸界面让数百万用户经历的所有学习的情况下受到尊重。\n费德里吉说：“我们开始设计光标的方式是，在不从根本上改变用户界面的情况下，保留触摸优先的体验。”“因此，那些可能永远不会在iPad上使用触控板的客户将不必学习新的东西，而对于那些可能在触摸板和触控板之间来回切换的人来说，这是一件很棒的事情。”\n该团队知道，它需要给光标注入同样的流畅感，而这种流畅感已经成为iOS工作方式的支柱。所以他们对它进行了动画制作，从点到I型光束再到斑点。如果放慢动画的速度，您可以看到它萌发出一条贝塞尔曲线，并流入其新外观。这达到了“取悦”用户的目的--只是好玩--但它也讲述了一个关于光标走向的故事。这使用户与blob的操作保持同步，每当您在用户头像中引入哪怕是少量的自治性时，这始终是一个危险。\n一旦在图标上，光标就会以一个小的视差移动图标，但这种图标移动是模拟的-这里没有像Apple TV那样的层，但有它们会很有趣。\n文本编辑也得到了升级，i-Beam与你正在编辑的文本的大小一致，可以非常清楚地表明光标将插入哪里，以及当你开始打字时，它将生成多大的文本。\n网络提出了自己的挑战。开放标准意味着许多站点都有自己的悬停元素和行为。团队必须解决的问题是，在多大程度上符合iPadOS和光标的“规则”。答案不是一成不变地应用上述要素。它必须尊重网络的整体要素。\n“精确地将这些元素应用于何处是一次有趣的旅程。例如，网站可以做各种各样的事情--有时它们有自己的悬停体验，有时元素的可点击区域与用户认为的可选择区域不匹配，“他说。“因此，我们仔细研究了在哪里推送什么样的反馈，以实现与网络和第三方应用程序的真正高水平的兼容性。”\n当然，任何使用标准iPadOS元素的第三方应用程序都可以免费获得所有这些工作。只是起作用了。而且，使用自定义元素的应用程序的实现非常简单。轻触开关并不简单，但也不是一件沉重的事情。\n到目前为止，对光标支撑的反应非常积极，这种热情创造了动力。如果有一套主要的生产力工具在iPad Pro上有坚实的用户基础，你可以打赌它会得到更新。例如，微软正在致力于iPad光标支持，预计将于今年秋天在Office for iPad中发布。\n即使在距离较远的触摸板上，系统手势也会感觉新鲜和灵敏。在某些方面，与屏幕本身相比，水平方向上的轻弹和滑动实际上感觉更有效、更有用。我可以根据个人经验告诉你，上下文在屏幕和键盘之间来回切换，在工作空间之间切换会带来很多认知损耗。即使是连续举起手臂，在离桌子一英尺的工作空间之间来回滑动，也会带来长期的疲劳问题。\n当手势在触摸板上时，它们更直接，总体物理空间更小，执行起来不那么累。\n“触控板上的许多iPad手势与Mac上的手势类似，所以你不必去想它们，也不用重新学习任何东西。然而，他们在iPad上的反应方式不同，更直接，让一切都感觉连接在一起，毫不费力，“费德里吉说。\n请记住，iPad的第一个多任务手势感觉就像是一个奇怪的分支。这个实验往坏里说似乎毫无用处，但往好里说却是一种有趣的好奇心。现在，在没有Home键的iPad Pro上，制造iPhone X的团队所做的工作闪耀着光芒。非常了不起的是，他们建造了一个可用的系统，它甚至可以在触摸板上工作-一个不需要立即触摸的元素。\n费德里吉说，他们考虑过重新考虑总共3个手指手势。但他们发现，它们按原样工作得很好。在任何偏离边缘的情况下，你都达到了一个极限，然后再次超越它来确认，你就会得到同样的结果。\niPad的光标模式仍然存在空白。iPad不支持光标锁定，这使得它不能在第一人称游戏等3D应用程序中相对移动鼠标。毫无疑问，未来还会有更多，但当我问到这一点时，苹果公司不予置评。\n新的iPad光标是以前的产品，但它是混合的，而不是分层的，这使得它在实践中取得了成功。产品团队在Apple TV、Mac和iPad上所学知识的融合。混合使用触摸、鼠标和触摸板模式。当然，还有一种渴望创造新东西和创造性的愿望，以及它还必须让人感觉熟悉和开箱即用的约束。这是苹果在其最好的时候继续保持其开发理念核心的一个特长。", "note_en": "Even though Apple did not invent the mouse pointer, history has cemented its place in dragging it out of obscurity and into mainstream use. Its everyday utility,  pioneered at Xerox Parc and later combined with a bit of iconic * work from Susan Kare at Apple, has made the pointer our avatar in digital space for nearly 40 years.\n The arrow waits on the screen. Slightly angled, with a straight edge and a 45 degree slope leading to a sharp pixel-by-pixel point. It’s an instrument of precision, of tiny click targets on a screen feet away. The original cursor was a dot, then a line pointing straight upwards. It was demonstrated in the ‘ Mother of all demos’ — a presentation roughly an hour-and-a-half long that contained not only the world’s first look at the mouse but also hyper linking, document collaboration, video conferencing and more.\n The star of the show, though, was the small line of pixels that made up the mouse cursor. It was hominem in machina — humanity in the machine. * Unlike the text entry models of before, which placed character after character in a facsimile of a typewriter, this was a tether that connected us, embryonic, to the aleph. For the first time, we saw ourselves awkwardly in a screen.\n   We don’t know exactly why the original ‘ straight up arrow’ envisioned by Doug Engelbart took on the precise angled stance we know today. There are many self-assured conjectures about the change, but few actual answers — all we know for sure is that, like a  ready athlete, the arrow pointer has been there, waiting to leap towards our goal for decades. But for the past few years, thanks to touch devices, we’ve had a new, fleshier, sprinter: our finger.\n The iPhone and later the iPad didn’t immediately re-invent the cursor. Instead, it removed it entirely. Replacing your digital ghost in the machine with your physical meatspace fingertip. Touch interactions brought with them “stickiness” — the 1:1 mating of intent and action. If you touched a thing, it did something. If you dragged your finger, the content came with it. This, finally, was human-centric computing.\n Then, a few weeks ago,  Apple   dropped a new kind of pointer — a hybrid between these two worlds of pixels and pushes. The iPad’s cursor, I think, deserves closer examination. It’s a seminal bit of remixing from one of the most closely watched idea factories on the planet.\n In order to dive a bit deeper on the brand new cursor and its interaction models, I spoke to Apple SVP  Craig Federighi   about its development and some of the choices by the teams at Apple that made it. First, let’s talk about some of the things that make the cursor so different from what came before…and yet strangely familiar.\n  The iPad cursor takes on the shape of a small circle, a normalized version of the way that the screen’s touch sensors read the tip of your finger. Already, this is different. It brings that idea of placing you inside the machine to the next level, blending the physical nature of touch with the one-step-removed trackpad experience.\n  Its size and shape is also a nod to the nature of iPad’s user interface. It was designed from the ground up as a touch-first experience. So much so that when an app is not properly optimized for that modality it feels awkward, clumsy. The cursor as your finger’s avatar has the same impact wherever it lands.\n Honestly, the thinking could have stopped there and that would have been perfectly adequate. A rough finger facsimile as pointer. But the concept is pushed further. As you approach an interactive element, the circle reaches out, smoothly touching then embracing and encapsulating the button.\n The idea of variable cursor velocity is pushed further here too. When you’re close to an object on the screen, it changes its rate of travel to get where you want to go quicker, but it does it  contextually, rather than  linearly, the way that macOS or Windows does.\n Predictive math is applied to get you to where you’re going without you having to land precisely there, then a bit of inertia is applied to keep you where you need to be without over shooting it. Once you’re on the icon, small movements of your finger jiggle the icon so you know you’re still there.\n The cursor even disappears when you stop moving it, much as the pressure of your finger disappears when you remove it from the screen. And in some cases the cursor  possesses the element itself, becoming the button and casting a light ethereal glow around it.\n  This stir fry of path prediction, animation, physics and fun seasoning is all cooked into a dish that does its best to replicate the  feel of something we do without thinking: reaching out and touching something directly.\n These are, in design parlance, affordances. They take an operation that is at its base level  much harder to do with a touchpad than it is your finger, and make it feel just as easy. All you have to do to render this point in crystal is watch a kid who uses an iPad all day try to use a mouse to accomplish the same task.\n The idea that a cursor could change fluidly as needed in context isn’t exactly new. The I-Beam (the cursor type that appears when you hover over editable text) is a good example of this. There were also  early experiments at Xerox Parc — the birthplace of the mouse — that also made use of a transforming cursor. They even tried color changes, but never quite got to the concept of on-screen elements as interactive objects — choosing to emulate functions of the keyboard.\n But there has never been a cursor like this one. Designed to emulate your finger, but also to spread and squish and blob and rush and rest. It’s a unique addition to the landscape.\n  Given how highly scrutinized Apple’s every release is, the iPad cursor not being spoiled is a minor miracle. When it was released as a software update for existing iPads — and future ones — people began testing it immediately and discovering the dramatically different ways that it behaved from its pre-cursors. *\n Inside Apple, the team enjoyed watching the speculation externally that Apple was going to pursue a relatively standard path — displaying a pointer on screen on the iPad — and used it as motivation to deliver something more rich, a solution to be paired with the Magic Keyboard. The scuttlebutt was that Apple was going to add cursor support to iPadOS, but even down to the last minute the assumption was that we would see a traditional pointer that brought the iPad as close as possible to ‘laptop’ behavior.\n Since the 2018 iPad Pro debuted with the smart connector, those of us that use the iPad Pro daily have been waiting for Apple to ship a ‘real’ keyboard for the device. I went over my experiences with the Smart Keyboard Folio in my  review of the new iPad Pro here, and the  Magic Keyboard here, but suffice to say that the new design is incredible for heavy typists. And, of course, it brings along a world class trackpad for the ride.\n  When the team set out to develop the new cursor, the spec called for something that felt like a real pointer experience, but that melded philosophically with the nature of iPad.\n   In some ways, the work on the new iPadOS cursor began with the Apple TV’s refreshed interface back in 2015. If you’ve noticed some similarities between the way that the cursor behaves on iPadOS and the way it works on Apple TV, you’re not alone. There is the familiar ‘jumping’ from one point of interest to another, for instance, and the slight sheen of a button as you move your finger while ‘hovering’ on it.\n “There was a process to figure out exactly how various elements would work together,” Federighi says. “We knew we wanted a very touch-centric cursor that was not conveying an unnecessary level of precision. We knew we had a focus experience similar to Apple TV that we could take advantage of in a delightful way. We knew that when dealing with text we wanted to provide a greater sense of feedback.”\n “Part of what I love so much about what’s happened with iPadOS is the way that we’ve drawn from so many sources. The experience draws from our work on tvOS, from years of work on the Mac, and from the origins of iPhone X and early iPad, creating something new that feels really natural for iPad.”\n And the Apple TV interface didn’t just ‘inspire’ the cursor — the core design team responsible works across groups, including the Apple TV, iPadOS and other products.\n  But to understand the process, you have to get a wider view of the options a user has when interacting with an Apple device.\n   Each of these modalities has situational advantages or disadvantages. The finger, of course, is an imprecise instrument. The team knew that they would have to telegraph the imprecise nature of a finger to the user, but also honor contexts in which precision was needed.\n  Apple approached the experience going in clean. The team knew that they had the raw elements to make it happen. They had to have a touch sensitive cursor, they knew that the Apple TV cursor showed promise and they knew that more interactive feedback was important when it came to text.\n  “ When we were first thinking about the cursor, we needed it to reflect the natural and easy experience of using your finger when high precision isn’t necessary, like when accessing an icon on the home screen, but it also needed to scale very naturally into high precision tasks like editing text,” says Federighi.\n “So we came up with a circle that elegantly transforms to accomplish the task at hand. For example, it morphs to become the focus around a button, or to hop over to another button, or it morphs into something more precise when that makes sense, like the I-beam for text selection.“\n  The predictive nature of the cursor is the answer that they came up with for “How do you scale a touch analogue into high precision?”\n But the team needed to figure out the what situations demanded precision. Interacting with one element over another one close by, for example. That’s where the inertia and snapping came in. The iPad, specifically, is multipurpose computer so it’s way more complex than any single-input device. There are multiple modalities to service with any cursor implementation on the platform. And they have to be honored without tearing down all of the learning that you’ve put millions of users through with a primary touch interface.\n “ We set out to design the cursor in a way that retains the touch-first experience without fundamentally changing the UI,” Federighi says. “So customers who may never use a trackpad with their iPad won’t have to learn something new, while making it great for those who may switch back and forth between touch and trackpad.”\n The team knew that it needed to imbue the cursor with the same sense of fluidity that has become a pillar of the way that iOS works. So they animated it, from dot to I-beam to blob. If you slow down the animation you can see it sprout a bezier curve and flow into its new appearance. This serves the purpose of ‘delighting’ the user — it’s just fun — but it also tells a story about where the cursor is going. This keeps the user in sync with the actions of the blob, which is always a danger any time you introduce even a small amount of autonomy in a user avatar.\n  Once on the icon, the cursor moves the icon in a small parallax, but this icon shift is simulated — there are not layers here like on Apple TV, but they would be fun to have.\n Text editing gets an upgrade as well, with the I-Beam conforming to the size of the text you’re editing, to make it abundantly clear where the cursor will insert and what size of text it will produce when you begin typing.\n The web presented its own challenges. The open standard means that many sites have their own hover elements and behaviors. The question that the team had to come to grips with was how far to push conformity to the “rules” of iPadOS and the cursor. The answer was not a one-size application of the above elements. It had to honor the integral elements of the web.\n  “ Perfecting exactly where to apply these elements was an interesting journey. For instance, websites do all manner of things – sometimes they have their own hover experiences, sometimes the clickable area of an element does not match what the user would think of as a selectable area,” he says. “So we looked carefully at where to push what kind of feedback to achieve a really high level of compatibility out the gates with the web as well as with third party apps.”\n Any third-party apps that have used the standard iPadOS elements get all of this work for free, of course. It just works. And the implementation for apps that use custom elements is pretty straightforward. Not flick-a-switch simple, but not a heavy lift either.\n The response to the cursor support has been hugely positive so far, and that enthusiasm creates momentum. If there’s a major suite of productivity tools that has a solid user base on iPad Pro, you can bet it will get an update.  Microsoft,   for instance, is working on iPad cursor support that’s expected to ship in Office for iPad this fall.\n  System gestures also feel fresh and responsive even on the distanced touchpad. In some ways, the flicking and swiping actually feel  more effective and useful on the horizontal than they do on the screen itself. I can tell you from personal experience that context switching back and forth from the screen to the keyboard to switch between workspaces introduces a lot of cognitive wear and tear. Even the act of continuously holding your arm up and out to swipe back and forth between workspaces a foot off the table introduces a longer term fatigue issue.\n When the gestures are on the trackpad, they’re more immediate, smaller in overall physical space and less tiring to execute.\n  “ Many iPad gestures on the trackpad are analogous to those on the Mac, so you don’t have to think about them or relearn anything. However, they respond in a different, more immediate way on iPad, making everything feel connected and effortless,” says Federighi.\n Remember that the  first iPad multitasking gestures felt like a weird offshoot. An experiment that appeared useless at worst but an interesting curiosity at best. Now, on the home button free iPad Pro, the work done by the team that built the iPhone X shines brightly. It’s pretty remarkable that they built a system so usable that it even works on trackpad — one element removed from immediate touch.\n Federighi says that they thought about rethinking 3 finger gestures altogether. But they discovered that they work just fine as is. In the case of anything that goes off of the edge you hit a limit and just push beyond it again to confirm and you get the same result.\n There are still gaps in the iPad’s cursor paradigms. There is no support for cursor lock on iPad, making it a non starter for relative mouse movement in 3D apps like first person games. There’s more to come, no doubt, but Apple had no comment when I asked about it.\n The new iPad cursor is a product of what came before, but it’s blending, rather than layering, that makes it successful in practice. The blending of the product team’s learnings across Apple TV, Mac and iPad. The blending of touch, mouse and touchpad modalities. And, of course, the blending of a desire to make something new and creative and the constraint that it also had to feel familiar and useful right out of the box. It’s a speciality that Apple, when it is at its best, continues to hold central to its development philosophy.", "posttime": "2020-05-07 19:52:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,苹果,apple,reinvented,光标", "title": "苹果如何为iPad重新发明光标", "title_en": "How Apple Reinvented the Cursor for iPad", "transed": 1, "url": "https://techcrunch.com/2020/05/06/how-apple-reinvented-the-cursor-for-ipad/", "via": "", "real_tags": ["app", "苹果", "apple", "光标"]}, {"category": "", "categoryclass": "", "imagename": "5c2a20cfe0d4d3986f43e597f809589b.png", "infoid": 1001039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自动驾驶汽车需要看看世界，就像我们人类司机偶尔会从手机上抬起头来用雨刷偷看前面的大车窗一样。目前，所有具有半自动驾驶功能的量产汽车(请记住，今天没有完全自动驾驶的汽车出售)都使用可见光摄像头和大量的计算能力来处理图像。其他技术，如LiDAR(光方向和测距)已经存在，并已在原型AV上使用，但到目前为止还没有在量产汽车上使用过。看起来沃尔沃正计划改变这一点。\n激光雷达是一项有趣的技术；如果你忘记了它的全部内容，让我引用我们对自动汽车传感技术的简要介绍来提醒你：\n激光雷达使用低强度、无害和不可见的激光束(对于我们肉眼来说)，这些激光束被脉冲照射到一个目标上(或者，对于大多数自动驾驶汽车，周围是一个完整的360°圆顶)，反射的脉冲被测量返回时间和波长，以计算物体与发送者的距离。\n在实践中，激光雷达可以生成一些非常详细的、高分辨率的自动驾驶汽车周围环境的可视化效果。你可以在上面看到这个是什么样子的。\n令人印象深刻，对吧？激光雷达通常足够详细，可以分辨出过往汽车的不同表面纹理和相当小的细节，甚至可以分辨出道路上的坑洞和井盖。\n激光雷达没有在生产车辆上使用，主要有两个原因：第一，这项技术非常昂贵，也许更重要的是，车顶上有看起来笨重的大圆顶的汽车真的很难销售。\n埃隆·马斯克(Elon Musk)对LiDAR不屑一顾，并称其丑陋，这是出了名的，但它确实提供了一些非常令人印象深刻的360度传感技术，真的不值得解雇。\n沃尔沃已经投资了一家总部位于佛罗里达州的公司，该公司似乎已经开发出了足够便宜和足够小的LiDAR，可以集成到生产车辆中。\n沃尔沃在新闻稿中展示的LiDAR外壳肯定比我见过的任何LiDAR装置都要小，尽管它似乎不能感知360度的全景；也许后面有一个配套的装置，结合起来他们可以全方位地看到这辆车？\n沃尔沃宣称的目标是使用该系统实现有效的3级自动驾驶：不需要人工干预，但只在特定的地理围栏区域内进行，在沃尔沃的情况下，这些区域将是高速公路，“经核实，对个别地理位置和条件是安全的”。\n沃尔沃称之为高速公路飞行员，这将比目前的二级系统有很大优势，目前的二级系统要求司机准备好在接到通知后立即接手，这是人类臭名昭著的糟糕之处，我在书中花了整整一章来说明这一点。\n沃尔沃计划在2022年开始生产集成了这种LiDAR技术的汽车，作为他们即将推出的SP2模块化汽车架构的一部分。\n更多的传感器对自动驾驶汽车来说总是更好的，而LiDAR提供了很多巨大的潜力。对于一项昂贵而笨重的技术来说，这可能是一个重大突破，所以我很好奇这一切会有多好的结果。\n高级编辑，Jalopnik·正在运行：1973 VW Beetle，2006 Scion xB，1990 Nissan Pao，1991 Yugo GV Plus·不那么运行：1973 Reliant Scimitar，1977 Dodge Tioga RV(也请购买我的书！)", "note_en": "Autonomous cars will need to see the world, just like we human drivers do occasionally when we glance up from our phones to peek out the big window up front with the wipers. Currently, all production cars with semi-autonomous features (remember, there are   no completely self-driving cars for sale today) use visible light cameras and a lot of computing power to process the images. Other technologies, like LiDAR (Light Direction and Ranging) exist and have been used on prototype AVs, but so far never on a production car. It looks   like Volvo is planning to change that.\n   LiDAR is interesting technology; just in case you forgot what it’s all about, let me remind you with quotes from our rundown of autonomous car sensing tech:\n Lidar uses low-intensity, non-harmful, and invisible (to our meaty eyes) laser beams, which are pulsed at a target (or, in the case of most autonomous cars, all around, in a full 360° dome) and the reflected pulses are measured for return time and wavelength to compute the distance of the object from the sender.\n In practice, lidar can produce some very detailed, high-resolution visualizations of the environment around a self-driving car. You can see what this looks like above there.\n Impressive, right? The lidar is often detailed enough to make out different surface textures and fairly small details on passing cars, and even things like potholes and manhole covers in the road.\n    LiDAR hasn’t been used on production vehicles for two main reasons: first, the technology is very expensive, and, perhaps even more importantly, it’s really hard to sell cars with big, clunky-looking domes on their roofs.\n   Elon Musk has famously dismissed LiDAR and   called it ugly, but it does offer some very impressive 360 degree sensing technology, and really doesn’t merit dismissal.\n Volvo has invested in a Florida-based company called Luminar that appears to have developed LiDAR cheap enough and small enough to be integrated into a production vehicle.\n  The LiDAR housing Volvo is showing with their press release certainly is smaller than any LiDAR setup I’ve seen, though it doesn’t appear to be capable of sensing a full 360 degrees; perhaps there’s a matching unit at the rear, and combined they get an all-around view of the car?\n Volvo’s stated goal is to use the system to implement what would be effectively Level 3 autonomy: no human intervention needed, but only within specific geo-fenced areas, which, in Volvo’s case, would be highways, “   verified to be safe for individual geographic locations and conditions.”\n  Volvo is calling this Highway Pilot, and would have a big advantage over current Level 2 systems that require the driver to be ready to take over at a moment’s notice, something humans are so notoriously bad at, I   devoted a whole chapter to it in my book.\n Volvo plans to start producing cars with this LiDAR technology integrated in 2022, as part of their upcoming SP 2 modular vehicle architecture.\n  More sensors are always better for autonomous vehicles, and LiDAR offers a lot of great potential. This could be a big breakthrough for what has always been an expensive and bulky technology, so I’m curious to see how well this all plays out.\n Senior Editor, Jalopnik • Running: 1973 VW Beetle, 2006 Scion xB, 1990 Nissan Pao, 1991 Yugo GV Plus • Not-so-running: 1973 Reliant Scimitar, 1977 Dodge Tioga RV (also, buy my book!)", "posttime": "2020-05-07 19:52:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "沃尔沃,plans,汽车", "title": "沃尔沃计划率先在量产汽车上安装LiDAR", "title_en": "Volvo Plans to Be the First to Include LiDAR on a Production Car", "transed": 1, "url": "https://jalopnik.com/volvo-plans-to-be-the-first-to-include-lidar-on-a-produ-1843290085", "via": "", "real_tags": ["沃尔沃", "plans", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "f0e049306bbb96f2037dc43e33357086.png", "infoid": 1001037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenRA是一个重新创建和现代化经典Command&Amquer实时战略游戏的项目。我们已经开发了一个灵活的开源游戏引擎(OpenRA引擎)，它为重新构建和重新想象经典的2D和2.5D RTS游戏(OpenRA MODS)提供了一个公共平台。这意味着OpenRA不受原始封闭源代码游戏的技术限制：它包括对现代操作系统和屏幕分辨率(包括Windows10、MacOS和大多数Linux发行版)的本地支持，不依赖于仿真或二进制黑客，并且具有集成的在线多人游戏功能。\n虽然我们喜欢经典的RTS游戏，但自20世纪90年代以来，多人游戏设计已经有了很大的发展。OpenRA MOD包括了新功能和游戏改进，将它们带入了现代：可以在“右键单击”和经典的“左键单击”控制方案之间进行选择。\n模糊了你部队视线外战场的“战争迷雾”\n为了支持活跃的多人社区，这些核心变化和不断的平衡优化意味着OpenRA游戏已经从经典版本演变而来，并受到后来的C&A；C游戏的严重影响。\nOpenRA是100%免费的，并且捆绑了三个不同的MOD。当您第一次运行mod时，游戏可以自动下载原始游戏资产，也可以使用原始游戏光盘。\n一个国家联盟为保护欧洲和北非免受神秘恐怖组织和正在缓慢蔓延到世界各地的贵重但有毒的外星人矿物泰矿的伤害而战。\n泰伯利亚黎明模式专注于快速和流畅的游戏，从现代RTS游戏中获得了很大的影响，比如多队列生产。\n在一个希特勒被暗杀，第三帝国从未存在的世界里，苏联寻求对整个欧洲的权力。联合起来对抗这个邪恶的帝国，自由世界面临着一场变红了的冷战。\n红色警报模式侧重于战略，提供了一系列征服陆地、海洋和空中的单位和战术。\n三大家族争夺珍贵的香料混血儿。谁控制了香料，谁就控制了宇宙！在沙漠星球阿拉基斯建立立足点，在那里你最大的威胁是环境。\n沙丘2000模式目前的重点是提供一种体验，这是真实的原始游戏。\nOpenRA的下一个主要目标是支持第二代Command&Amquer游戏，从泰伯利亚太阳开始。\n支持泰伯利亚太阳的游戏引擎功能仍在开发中。MOD没有包含在OpenRA安装程序中，但是源代码可以在我们的GitHub存储库中找到。请注意，我们不为不完整的开发版本提供支持。\nOpenRA Mod SDK提供了开发和发布您自己的项目的工具。每个新的OpenRA版本都会带来许多针对建模社区以及由建模社区创建的改进和修复。", "note_en": "OpenRA is a project that  recreates and modernizes the classic  Command &amp; Conquer real time strategy games. We have developed a flexible  open source game engine (the  OpenRA engine) that provides a common platform for rebuilding and reimagining classic 2D and 2.5D RTS games (the  OpenRA mods). This means that OpenRA is not restricted by the technical limitations of the original closed-source games: it includes  native support for modern operating systems and screen resolutions (including Windows 10, macOS, and most Linux distros) without relying on emulation or binary hacks, and features  integrated online multiplayer.\n  While we love the classic RTS gameplay, multiplayer game design has evolved significantly since the 1990&#39;s. The OpenRA mods include  new features and gameplay improvements that bring them into the modern era:  A choice between “right click” and classic “left click” control schemes\n      The “fog of war” that obscures the battlefield outside your units&#39; line of sight\n These core changes and continuous balance refinements to support the active multiplayer community mean that the OpenRA gameplay has evolved from the classic releases, with heavy influences from the later C&amp;C titles.\n OpenRA is  100% free, and comes bundled with three distinct mods. When you run a mod for the first time the game can  automatically download the original game assets, or you can use the original game disks.\n An alliance of nations fights to protect Europe and northern Africa from a mysterious terrorist organization and the valuable but toxic alien mineral, Tiberium, that is slowly spreading over the world.\n  The Tiberian Dawn mod focuses on  fast and fluid play, taking heavy influences from modern RTS games with features like multiple-queue production.\n In a world where Hitler was assassinated and the Third Reich never existed, the Soviet Union seeks power over all of Europe. Allied against this Evil Empire, the free world faces a Cold War turned red hot.\n  The Red Alert mod focuses on  strategy, providing a range of units and tactics to conquer the land, sea, and air.\n Three great houses fight for the precious spice melange.  He who controls the spice controls the universe!  Establish a foothold on the desert planet Arrakis, where your biggest threat is the environment.\n  The Dune 2000 mod currently focuses on providing an experience that is  authentic to the original game.\n  The next major goal for OpenRA is to support the second generation of Command &amp; Conquer games, starting with Tiberian Sun.\n  The game engine features to support Tiberian Sun are still  in development. The mod is not included with the OpenRA installer, but the source code is available in  our GitHub repository. Please note that we do not provide support for incomplete development builds.\n The  OpenRA Mod SDK provides tools to develop and release your own projects. Each new OpenRA release brings many improvements and fixes created for, and by, the modding community.", "posttime": "2020-05-07 19:51:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "改造,project,游戏", "title": "OpenRA是一个对经典的Command and Conquer进行现代化改造的项目", "title_en": "OpenRA is a project that modernizes the classic Command and Conquer", "transed": 1, "url": "https://www.openra.net/about/", "via": "", "real_tags": ["改造", "project", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "ffb8f86f5df2631a196c97872c374562.jpg", "infoid": 1001036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一晚上，一位受人爱戴的交通倡导者、推特员工和旧金山湾区复兴男子的超大生活不幸缩短，22岁的考特尼·布鲁索(Courtney Brousseau)三天前在任务区被枪击身亡。\n周末，家人和朋友聚集在旧金山进行最后的告别，推特上充斥着朋友们发自内心的轶事，以及陌生人的同情和悲痛之情。\n他的朋友、推特同事萨凡娜·巴达利奇(Savannah Badalich)说，“他对这么多社区有着如此强烈的同情心。”“他想有所作为，他做到了。”\n布鲁索的聪明才智和干劲从很小就很明显，当时他和主编格雷斯·奥图尔(Grace O‘Toole)在千橡市(文图拉县)的纽伯里公园高中(Newbury Park High School)经营他们的学生报纸“黑豹漫步者”(The Panther Prowler)。高三学生想为报纸的特刊尝试一些不同的东西。\n“我们聊谈性吧，”“流浪者”的标题尖叫着。随附的照片没有那么微妙：一名妇女的手，指甲涂上了青绿色的抛光剂，在香蕉上滚了一个消防车红色的避孕套。\n这些青少年没有预料到随后会引起轩然大波，当时一些惊恐的家长指控他们性骚扰，学校董事会要求进行反驳。\n但是孩子们已经准备好了。布鲁索和奥图尔拥有新闻自由的法律术语和对学生权利的热情，他们与董事会针锋相对-几乎没有让步就赢得了胜利。\n没有反驳，没有道歉，只有编辑们的一封公开信，解释他们的决定，并鼓励社区阅读这篇文章。\n布鲁索和奥图尔的教师顾问米歇尔·萨雷米(Michelle Saremi)说：“他们真的改变了关于高中学生新闻和学生权利的讨论。”“考特尼只是那些孩子中的一个；他将成为总统。我本来要投票给他的。“。\n接受“纪事报”采访的朋友和同事描述了一个有着无限能量和无与伦比的原则的年轻人。他的朋友们说，他的自信和干劲很有感染力。他是一位天生的领导者，并推动他人变得更好，敢于冒险。\n布鲁索最近从加州大学伯克利分校(UC Berkeley)毕业，拥有一份明星云集的简历，可以打开任何一扇门。他开朗有力的个性通常会推动他通过它们。\n他曾是马萨诸塞州参议员伊丽莎白·沃伦(Elizabeth Warren)的实习生，Code.gov的公民数字研究员，加州副州长埃莱尼·库纳拉基斯(Eleni Kounalakis)的顾问，以及微软的项目经理实习生。\nBadalich说，Brousseau在9月份获得了Twitter副产品经理的工作，从事通知项目，着眼于让技术更容易获得和包容。\n巴达利奇说，他正在开发将影响全球人民的新产品，他以公民的心态处理每个项目。\n她说：“他一天中的每一个时刻都必须在倡导。”“他对这么多社区有如此强烈的同理心；他想要有所作为，他做到了。”\n布鲁索对社区的承诺指导了他在Twitter的工作，以及他的个人生活和其他副业项目，如Gay for Transportation，布鲁索在他的网站上将其描述为“为热爱公共交通的同性恋人士举办的每月一次的SF聚会”。\n随着冠状病毒的爆发开始控制旧金山湾区，他提出帮助人们进行自己的项目。\n布鲁索3月13日在推特上发帖称：“为了我自己的心理健康，我昨晚在乐高积木上花了很多钱。”“现在我想帮助其他可能因冠状病毒而苦苦挣扎的人们。如果您认识需要帮助的人、正在帮助的组织或您希望我匹配的捐款，请回复信息。我最多捐400美元。“。\n在接下来的几周里，布鲁索评论了对最初帖子的回复，并强调了促使他捐款的每个组织。受益者包括为无家可归者提供食物的团体，向交通乘客捐赠口罩，以及为LGBT青少年倡导。\n为了我自己的心理健康，我昨晚在乐高上花了很多钱。现在我想帮助其他可能因冠状病毒而苦苦挣扎的人们。如果您认识需要帮助的人、正在帮助的组织或您希望我匹配的捐款，请回复信息。我将捐赠至多400美元。\n-Courtney Brousseau(@cbrewsayso)2020年3月13日。\n萨雷米和奥图尔说，布鲁索从小就是一个很有成就的人。当他被告知校报没有网页设计项目的资金时，他为校报创建了一个社交媒体形象，并在萨雷米的房子里组织了一次车库义卖。\n萨雷米说：“他总是有一个我还不能完全看到的景象。”“他总是很有说服力，而且他通常是对的。”\n学生报特刊出版时，萨雷米正在休产假，奥图尔和布鲁索被迫在很大程度上独自面对学校董事会。\n“他只是泰然处之，”奥图尔说，他在高中时和布鲁索约会过，也是大学的一部分。“我们遇到了所有这些文字上有说服力的人物，我继续为此感到自豪。”\n布鲁索周五晚上出去买了一个玉米煎饼，并在晚上8点17分上传了一张他晚餐的照片，背景是多洛雷斯·帕克(Dolores Park)。\n他写道：“我刚刚在多洛雷斯公园吃了一个美味的玉米煎饼，有那么一瞬间一切都很好。”\n我刚刚在多洛雷斯公园吃了一个美味的玉米煎饼，有那么一会儿一切都很好pic.twitter.com/bTyWotvXDF。\n-Courtney Brousseau(@cbrewsayso)2020年5月2日。\n布鲁索晚上8点22分从多洛雷斯公园步行回家。据旧金山警方称，周五，在罗莎公园巷和格雷罗街的交叉口开了50到60枪。枪火使他受了重伤，对一名18岁的受害者造成了无生命危险的伤害。\n布鲁索的同事和朋友确认他是遇难者，他们说布鲁索周日正在维持生命。他在晚上7点左右去世。旧金山总医院发言人布伦特·安德鲁(Brent Andrew)说，周一。\n29岁的密友克里斯·阿尔文(Chris Arvin)说，枪击事件发生时，布鲁索正步行回他位于杜博斯大道(Duboce Avenue)的家中，他和其他几个朋友计划在周五晚上进行例行的视频通话和游戏之夜。\n旧金山警方发言人罗伯特·鲁卡警官表示，目前还没有逮捕与枪击事件有关的人。\n他说：“这项积极和正在进行的凶杀案调查正在全面调查。”他指出，警察在现阶段“没有确认或排除任何可能性”。\n巴达里奇说，接下来的几周将充满虚拟的守夜活动和欢乐时光，以纪念布鲁索。她说，其中一人将包括Twitter首席执行官杰克·多尔西(Jack Dorsey)。\n在通过电子邮件发送给“纪事报”的一份声明中，Twitter的一位发言人表示：“我们确认一名参与上周枪击案的Twitter员工去世，我们感到心碎。在这个困难的时刻，我们与他的家人、朋友和队友在一起。“。\n巴达利奇将失去布鲁索描述为双管齐下。失去了他已经付出的一切，失去了他和他的社区的未来。\n“他刚拿到，”巴达里奇说。“他懂得如何创造改变。”", "note_en": "The outsize life of a beloved transit advocate, Twitter employee and Bay Area renaissance man was tragically cut short Monday evening, when 22-year-old Courtney Brousseau succumbed to his injuries after being struck by gunfire three days earlier in the Mission District.\n  Family and friends gathered in San Francisco over the weekend to say their final goodbyes, and Twitter lit up with heartfelt anecdotes from friends, as well as sympathy and outpourings of grief from strangers.\n  “He just had such fierce empathy for so many communities,” said Savannah Badalich, a friend and Twitter co-worker. “He wanted to make a difference, and he did.”\n  Brousseau’s intellect and drive were evident from a young age, when he and co-editor in chief Grace O’Toole ran their student newspaper, the Panther Prowler , at Newbury Park High School in Thousand Oaks (Ventura County). The high school seniors wanted to try something different for the paper’s special edition.\n  “Let’s talk about sex,” the  Prowler’s headline screamed. The accompanying photo was less subtle: A woman’s hand, nails lacquered in turquoise polish, rolled a fire-engine red condom over a banana.\n     The teens didn’t anticipate the uproar that followed, when a few horrified parents accused them of sexual harassment and the school board demanded a rebuttal.\n  But the kids were ready. Armed with freedom-of-press legalese and a passion for student rights, Brousseau and O’Toole went toe-to-toe with the board — and won with few concessions.\n  There was no rebuttal, no apology, just an open letter from the editors, explaining their decisions and encouraging the community to read the piece.\n  “They really changed the conversation about student journalism and student rights in high schools,” said Michelle Saremi, Brousseau and O’Toole’s faculty adviser. “Courtney was just one of those kids; he was going to be president. I was going to vote for him.”\n  Friends and co-workers who spoke to The Chronicle describe a young man of boundless energy and unrivaled principles. His confidence and drive were contagious, his friends said. He was a natural leader and pushed others to be better and take risks.\n  Brousseau recently graduated from UC Berkeley and had the type of star-studded resume that could open any door. His bright, powerful personality usually pushed him through them.\n  He was an intern for Massachusetts Sen. Elizabeth Warren, a civic digital fellow for  Code.gov, a consultant for  California Lt. Gov. Eleni Kounalakis and a program manager intern at Microsoft.\n  Brousseau landed a job as an associate product manager at Twitter in September, working on notifications projects with an eye toward making technology more accessible and inclusive, Badalich said.\n  He was building new products that would impact people across the globe, and he tackled every project with a civic mind-set, Badalich said.\n  “Every moment of his day had to be advocating,” she said. “He just had such fierce empathy for so many communities; he wanted to make a difference and he did.”\n  Brousseau’s commitment to the community guided his work at Twitter, as well as his personal life and side projects like Gay for Transit, which Brousseau described on his website as “a monthly SF meetup for queer folks who love public transit.”\n  As the coronavirus outbreak was beginning to take hold of the Bay Area, he offered to help people with their own projects.\n  “I spent a lot of $ on LEGO last night for my own mental health,” Brousseau posted to Twitter on March 13. “Now I want to help other folks who might be struggling due to COVID-19. If you know someone who needs help, an organization that is helping, or a donation you want me to match, reply w/ info. I’ll donate up to $400.”\n  In the following weeks, Brousseau commented on replies to the original post and highlighted each organization that moved him to donate. Beneficiaries included groups feeding the homeless, donating masks to transit riders and advocating for LGBT teens.\n  I spent a lot of $ on LEGO last night for my own mental health. Now I want to help other folks who might be struggling due to COVID-19. If you know someone who needs help, an organization that is helping, or a donation you want me to match, reply w/ info. I&#39;ll donate up to $400\n— Courtney Brousseau (@cbrewsayso)  March 13, 2020\n   Saremi and O’Toole said Brousseau was a high achiever from an early age. He created a social media presence for his school newspaper and organized a garage sale — at Saremi’s house — when he was told the paper didn’t have the funding for a web design program.\n  “He always had a vision that I couldn’t quite see yet,” Saremi said. “He was always very convincing and he was usually right.”\n  Saremi was out on maternity leave when the special edition of the student newspaper was published, and O’Toole and Brousseau were forced to largely face the school board on their own.\n  “He just took it in stride,” said O’Toole, who dated Brousseau in high school and part of college. “We went up against all these textually powerful figures, and I continue to be proud of that.”\n  Brousseau went out to get a burrito Friday night and posted a picture of his dinner at 8:17 p.m., with Dolores Park in the background.\n  “I just ate a delicious burrito in Dolores park and for a brief moment everything felt okay,” he wrote.\n  I just ate a delicious burrito in Dolores park and for a brief moment everything felt okay  pic.twitter.com/bTyWotvXDF\n— Courtney Brousseau (@cbrewsayso)  May 2, 2020\n   Brousseau was walking home from Dolores Park at 8:22 p.m. Friday when 50 to 60 shots were fired at the intersection of Rosa Parks Lane and Guerrero Street, according to San Francisco police. The gunfire left him critically wounded and caused non-life-threatening injuries to an 18-year-old victim.\n    Colleagues and friends of Brousseau, who identified him as the victim who was killed, said he was on life support Sunday. He died around 7 p.m. Monday, said Brent Andrew, a San Francisco General Hospital spokesman.\n  Chris Arvin, 29, a close friend, said the shooting occurred as Brousseau was walking back to his home on Duboce Avenue, where he and several other friends were scheduled to have their regular Friday night video call and game night.\n  San Francisco police spokesman Officer Robert Rueca said no arrests have been made in connection to the shooting.\n  “This active and ongoing homicide investigation is looking into all aspects,” he said, noting that officers at this stage “are not confirming or ruling anything out,” he said.\n  Badalich said the following weeks will be filled with virtual vigils and happy hours in Brousseau’s honor. One of them will include Twitter CEO Jack Dorsey, she said.\n  In a statement emailed to The Chronicle, a Twitter spokesperson said, “We are heartbroken to confirm the passing of a Twitter employee involved in a shooting last week. Our thoughts are with his family, friends, and teammates at this difficult time.”\n  Badalich described the loss of Brousseau as two-pronged. There’s the loss of everything he already gave, and the loss of what the future held for him and his community.\n  “He just got it,” Badalich said. “He understood how to create change.”", "posttime": "2020-05-07 19:50:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,sf,employee,布鲁索", "title": "推特员工，交通倡导者在SF枪战中被捕后死亡", "title_en": "Twitter employee, transit advocate dies after getting caught in SF shootout", "transed": 1, "url": "https://www.sfchronicle.com/crime/article/Twitter-employee-transit-advocate-dies-after-15248295.php", "via": "", "real_tags": ["推特", "sf", "employee", "布鲁索"]}, {"category": "", "categoryclass": "", "imagename": "ecd85a4f37d06f9b8d89694c911a644c.jpg", "infoid": 1001035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PatmanQC YouTube频道最近发布了一篇关于传奇平台游戏Joust的整齐回顾。\n视频：PatmanQC的《Joust的历史-街机游戏机纪录片》-街机游戏纪录片的历史，YouTube。\n1982年由威廉姆斯电子公司(Williams Electronics)发布，作为一款街机游戏，该公司今天被称为“WMS”(博彩业的关键参与者--科学游戏公司的一个部门)。\n这款游戏的首席设计师是约翰·纽科默(John Newcomer)，他随后参与了其他经典游戏的开发，如《X革命》(Revsion X)和《NBA果酱》(NBA Jam)。\n玩家从第三人称的角度控制骑着飞行鸵鸟或鹳(由此得名)的骑士。你与其他同样骑着巨型鸟形生物的骑士战斗。\n它绝对有一种奇幻/反乌托邦的感觉(Flash Gordon是一个灵感来源)。\n与那个时代的其他平台游戏相反，这款游戏不涉及任何射击。取而代之的是你用你的长矛杀死其他骑士。\n这款游戏最初卖出了两万五千多个机柜，这在当时是一个相当大的壮举。\n1986年，一部名为“Joust2：适者生存”的续集上映了，游戏玩法类似，画面也更先进。\nAtari 2600、Atari Lynx和Apple II提供了许多家庭对话，仅举几例。", "note_en": "The  PatmanQC YouTube channel recently published a neat retrospective on the legendary platform game Joust.\n  Video: “The History of Joust – arcade console documentary” by PatmanQC - History of arcade game documentaries,  YouTube.\n   Released in 1982 as an arcade game by Williams Electronics, which is known today as “ WMS” (a division of Scientific Games Corporation, a key player in the gambling industry).\n The game’s lead designer was  John Newcomer who subsequently worked on other classic titles such as “Revolution X” and “NBA Jam”.\n The player controls a knight riding a flying ostrich or a stork (hence the name), from a third-person perspective. You fight other knights who are also riding giant bird-like creatures.\n There is definitely a fantasy / dystopian feel to it ( Flash Gordon was an inspiration).\n Contrary to other platform games of the era, the gameplay does not involve any shooting. Instead you kill the other knights with your lance.\n The game initially sold more than 25,000 cabinets; which was quite a feat back then.\n  In 1986, a follow up called “Joust 2: Survival of the Fittest” was released with a similar gameplay and more advanced graphics.\n Many home conversations were made available for the Atari 2600, Atari Lynx and Apple II just to name a few.", "posttime": "2020-05-07 19:50:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,偏向,early", "title": "赛马：一款早期的、偏向类型的视频游戏[视频]", "title_en": "Joust: An early, genre-bending video game [video]", "transed": 1, "url": "https://nuadox.com/post/617424244562903040/joust-video-game", "via": "", "real_tags": ["游戏", "偏向", "early"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获得WirtBot®并在WireGuard®之上创建您自己的VPN", "note_en": "Get a WirtBot® and create YOUR own VPN on top of WireGuard®", "posttime": "2020-05-07 19:50:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "private,wirtbot", "title": "Wirt：使用WireGuard的所有设备的专用网络", "title_en": "Wirt: A private network for all your devices using WireGuard", "transed": 1, "url": "https://wirt.network/", "via": "", "real_tags": ["private", "wirtbot"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个标题有点谎话连篇。我认为Python是一种很好的、实用的语言，而且相对容易学和教。其庞大的库集合让您可以拼凑一个程序，几乎可以做任何您想做的事情。它没有APL或LISP的美感，当然也没有Julia的速度和表现力，但它是一个任何人都可以用来制作在一两天内解决现实世界中不平凡的问题的工具。如果您正在编写使用表单和数据库的网站，那么它就有Django web框架，这本身就可能是学习这门语言的一个足够好的理由。\n对我来说，有时让Python头疼的是它是一种“面向对象”的语言。这些不是最初在Smalltalk中设想和实现的令人敬畏的消息传递对象。这些“对象”是基于类的，并且漂亮地配备了多重继承。作为单独的程序员，您永远不需要编写单个类。我当然不会。我把Python用作函数式语言。我从许多作用于列表、元组和字典的小的、可组合的函数创建了一个程序。这不是批评。Python是在20世纪80年代设计的，当时大多数人认为类是大势所趋。它们可能仍然是解决某些类型问题的最佳选择，但现在越来越多的人感到遗憾的是，需要忍受和维护由成堆的类构建的大型系统，这些类都保密并相互继承。\n我心爱的姜戈就是一个很好的例子。如果我想自定义它的行为，我需要在神奇的框架代码迷宫中漫步，最终导致我自己的代码中充斥着对这个和那个、超级和元的不透明引用。我不再费心了，只需编写我自己的代码来替换我想要改变的Django部分，从而绕过框架中越来越大的部分。尽管如此，Django是一个如此成熟和坚实的工程，以至于我不愿放弃它。\n正如我所说的，Python的强大之处在于能够利用它的库，包括多年来由这么多人添加的库。对于可能想要避免基于类的范例而编写函数代码的语言用户来说，这就是问题所在。这些库是由真正的Python程序员编写的，这意味着它们是面向对象的。它们通常与以函数样式编写的代码不能很好地配合，修改起来很麻烦，而且会做一些您可能没有预料到的事情。\n这里有一个小例子，我希望它能向你展示我的一些意思。我需要编写一个读取、解析和写入bibtex文件的程序。这些是任何使用LaTeX文档准备系统的人都熟悉的出版物的纯文本数据库。该数据库存储有关某些出版物列表的书目信息；您只需在LaTeX文档中提到它的位置，您就可以获得所需样式的引文和参考章节排版。当然，有一个用于解析bibtex的Python库：它称为bibtexparser。我有没有提到过什么都有图书馆？这就是我们使用Python的原因。该库可以读取文件并将其解析为一个特殊的对象，即BibDatabase。该对象有一个名为Entries的属性；条目是一个字典列表，其中每个字典都包含一个出版物的书目信息，具有诸如作者、标题等关键字。有一个名为ID的特殊关键字唯一地标识每个出版物。它被作者选为引用中使用的助记符。坦率地说，这个库的文档不是很好，我不得不进行实验，看看它是如何工作的。我发现我可以修改条目，或者从列表中删除或添加到列表中，并且在将新的bibtex文件写回磁盘时会反映我所做的更改。到现在为止还好。\nBibDatabase对象有另一种表示数据的方式。它还有一个ENTRIES_DICT属性，这是一个字典字典。每个出版物都显示为一个字典，其关键字是出版物的ID。换句话说，它与条目列表几乎相同，但数据的排列略有不同。它不是字典列表，而是一个值是字典、键是ID的字典。这是有意义的，也是表示该数据的最自然的方式。\n在我的程序中的某个时候，使用数据的Entries_dict版本而不是数据的Entries视图变得很方便。我发现我可以更改任何字典的内容，当我将BibDatabase转换为磁盘上的文件时，更改再次被忠实地保留下来。但是随后我尝试通过向Entries_dict字典添加一个条目来添加一个新出版物。新发布未出现在输出文件中。\n文档没有任何帮助。我开始阅读源代码，毫不奇怪，它是基于类的。不是转换数据结构的透明函数，而是不透明的c\n这是一个典型的Python库，这就是使用Python会如此烦人的原因。如果您想以与其创建者的预期稍有不同的方式使用库，您可能会被令人惊讶的行为绊倒，并且将不得不费力地通过错综复杂的基于类的源代码(有时这个库恰好非常简单)来找出所有的秘密方法都在做什么。这可能是一个品味问题，但我发现在Clojure或Julia中使用和理解库是一种令人耳目一新的对比。\n评论通过电子邮件处理。如果您希望我将其包括在这里，请发送邮件至pythonhart__Comment@lee-Phillips.org。我永远不会暴露你的电子邮件地址。如果你想让我把你的名字也藏起来，请告诉我。\nLee-Phillips.org是亚马逊服务有限责任公司联合计划(Amazon Services LLC Associates Program)的参与者，该计划是一项联合广告计划，旨在为网站提供一种通过广告和链接到Amazon.com赚取广告费的手段。", "note_en": "The title is a bit of a lie. I think Python is a good, practical, language, and relatively easy to learn and to teach. Its vast collection of libraries let you slap together a program to do virtually anything you want. It doesn’t have the beauty of APL or lisp, and certainly nothing like the speed or expressive power of Julia, but it’s a tool anyone can use to make something that solves a real-world, non-trivial problem in a day or two. And if you’re programming the kind of website that uses forms and a database, it has the Django web framework, which alone might be a good enough reason to learn the language.\n For me, what sometimes makes Python a pain in the neck is that it is an “object oriented” language. These are not the awesome message-passing objects as they were originally envisioned and implemented in Smalltalk. These “objects” are class based, and are attractively outfitted with multiple inheritance. As an individual programmer, you never need to write a single class. I certainly don’t. I use Python as a functional language. I create a program from many small, composable functions acting on lists, tuples, and dictionaries. This is not a criticism. Python was designed in the 1980s, when most people thought that classes were the way to go. They may still be the best choice for certain types of problems, but now there is growing regret directed at the need to live with and maintain large systems built from piles of classes all keeping secrets and inheriting from each other.\n My beloved Django is a good example. If I want to customize its behavior, I need to wander though a maze of magical framework code, and end up littering my own code with opaque references to  this and  that and  super and  meta. I don’t bother any more, and just write my own code to replace the parts of Django that I want to be different, bypassing larger and larger parts of the framework. Despite all this, Django is such a mature and solid piece of engineering that I am loathe to abandon it.\n As I said, the power of Python is the ability to leverage its libraries, including the ones added by so many people over the years. And here is the problem for the user of the language who might want to avoid the class-based paradigm and write functional code. The libraries are written by real Python programmers, which means that they are object oriented. They often don’t mesh well with code written in the functional style, are a pain to modify, and do things you might not expect.\n Here is a little example that, I hope, shows you some of what I mean. I needed to write a program that reads, parses, and writes bibtex files. These are plain-text databases of publications familiar to anyone who uses the LaTeX document preparation system. The database stores the bibliographic information about some list of publications; you just mention its location in your LaTeX document, and you can get citations and a reference section typeset in any style you need. Naturally, there’s a Python library for parsing bibtex: it’s called  bibtexparser. Did I mention that there is a library for everything? That’s why we’re using Python. This library can read the file and parse it into a special object, the BibDatabase. This object has a property called  entries; the  entries is a list of dictionaries, where each dictionary contains the bibliographic information for one publication, with keys like  author,  title, etc. There is a special key called  ID that uniquely identifies each publication. It’s chosen by the author as a mnemonic tag for use in citations. The documentation of this library is, frankly, not very good, and I had to experiment to see just how it works. I found that I could modify the  entries, or delete from or add to the list, and my alterations were reflected when writing the new bibtex file back to disk. So far, so good.\n The BibDatabase object has another way to represent the data. It has an  entries_dict property, too, which is a dictionary of dictionaries. Each publication appears as a dictionary with a key that is the publication’s  ID. In other words, it’s almost the same as the  entries list, but with the data arranged a little differently. Instead of a list of dictionaries, it’s a dictionary whose values are dictionaries and whose keys are the  IDs. This makes sense, and is the most natural way to represent this data.\n At some point in my program, it became convenient to use the  entries_dict version of the data rather than the  entries view of it. I found that I could alter the contents of any of the dictionaries, and the changes, again, were faithfully preserved when I converted the BibDatabase into a file on disk. But then I tried to add a new publication by adding an entry to the  entries_dict dictionary. The new publication did  not appear in the output file.\n The documentation was no help. I started reading the source code, and, no surprise, it was based on classes. Not transparent functions transforming data structures, but opaque classes with super-secret methods for doing everything. When the user asks for the  entries or the  entries_dict, or adds items to them, private code is run behind the scenes, as is common in class-based systems. These secret methods and  properties add a publication to the object when you append to its  entries, but not when you enlarge its  entries_dict. It was easy to modify my code to take this into account. But I wished I had known about it in advance and not wasted an hour or two puzzling over it.\n This is a typical Python library, and this is why using Python can be so annoying. If you want to use the library in a way a little differently from how its creator intended, you may trip over surprising behavior, and will have to wade through a maze (sometimes—this library happens to be quite simple) of class-based source code to figure out what all the secret methods are doing. It may be a matter of taste, but I find that using and understanding libraries in Clojure or Julia to be a refreshing contrast.\n Comments are handled through email. Please send mail to  pythonhate__comment@lee-phillips.org if you would like me to include it here. I will never expose your email address. Let me know if you want me to hide your name, as well.\n   lee-phillips.org is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com.", "posttime": "2020-05-07 19:50:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,喜欢,don,字典", "title": "我不喜欢Python", "title_en": "I Don’t Like Python", "transed": 1, "url": "https://lee-phillips.org/pythonhate/", "via": "", "real_tags": ["python", "喜欢", "don", "字典"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我偶然在Facebook上看到一篇关于它的推广帖子，我想知道是否有人有过使用它的经验？\n为什么要给顾客一个“以后付款”的选择呢？在日益增长的电子商务“先购物，后付款”趋势中，Klarna只是其中一个选择。但是，对客户来说，有这个选择真的有什么不同吗？毕竟，信用卡也允许网购者“稍后付款”。\n这种“以后付款”的趋势有点像实体店的“预付”传统。就像分期付款一样，它真的不是针对那种拥有信用卡财务灵活性的消费者。\n取而代之的是，它为那些没有资格使用信用卡的购物者或信用卡余额已满的购物者提供了一种类似信用卡的选择。不用说，这并不能培养负责任的消费习惯。但品牌的责任从来不是确保人们明智消费(可以说，恰恰相反)。\n与分期付款不同的是，“现在购物，稍后付款”的选项允许人们在分期付款之前立即获得购买的商品。这对今天不耐烦的在线消费者有着明显的吸引力，他们希望自己的商品尽快送到手中。\n“稍后付款”选项也并不总是涉及利息支付，所以即使是信用卡持有者也可能选择它们而不是用卡购物。(如果有利息，利率往往比信用卡低得多。)。这些选项中的大多数将购买的总成本分成四笔付款，这对客户来说是可以管理的，而不会在一段荒谬的时间内拖延付款。\n所有这一切都表明，如果消费者在你的网站上看到“稍后付款”选项，他们可能更愿意从你那里购买，而不是从竞争对手那里购买。你给了那些没有预付资金的人仍然可以成为客户的选择，这显然有增加销售的潜力。你也为信用卡持卡人提供了一个不涉及高利率的有吸引力的选择。\n这些“稍后付款”选项也会加快结账过程。长时间结账是消费者放弃购物车的一个重要原因，因此商家明智地尽其所能加快速度。\n作为一个更吸引人的奖励，你的“稍后付款”解决方案承担了错过付款的风险。他们在向购物者收取最终付款的同时，确保你作为商家立即获得全额付款。这意味着没有理由不在您的站点上包含此选项。\n“以后付款”真的能增加销售额吗？这些选择的逻辑很清楚，但让我们看看这些数字是否也支持它们推动销售的能力。\n首先，考虑一下这个令人惊讶的统计数据：截至2016年，只有三分之一的千禧一代购物者拥有信用卡。这意味着，如果你的客户大多是年轻人，他们会特别寻找“稍后付款”的选择。不出所料，千禧一代已经构成了“以后付款”消费者的大多数。\n但除了千禧一代之外，其他消费者对这个想法也很感兴趣。RFI集团全球数字银行理事会的一项研究发现，绝大多数消费者对信任数字支付提供商感到满意或非常满意，这也表明了“稍后付款”选项的承诺。\n更令人信服的是，澳大利亚“稍后付费”品牌Afterpay仅用了两年时间就获得了200多万澳大利亚客户，这些客户的Afterpay支出超过9亿澳元。\n因此，正如数字所显示的那样，消费者已经渴望使用“稍后付费”服务。BigCommerce的一项调查还发现，45%的在线消费者表示，融资选择影响了他们的购买决定。\n近三分之一的人表示，如果不是因为“稍后付款”选项，他们会跳过购买。类似的调查发现了同样的事情：购物者，特别是年轻人，报告说“以后付款”的选择使他们更有可能购物。\n然而，很难找到报告使用“稍后付款”选项的确切销售影响的品牌。虽然许多品牌肯定已经衡量了这种影响，但他们还没有公开发表他们的发现。但可以肯定地说，对于拥有千禧一代或Z世代受众的品牌来说，可能会产生重大的积极影响。\n“稍后付费”最佳实践EConsulting上的这篇有用的帖子回顾了几个使用“稍后付费”的不同网站，看看它们是如何堆积起来的。他们发现的一个关键问题是，某些类型的措辞可能会让消费者反感。\n很重要的一点是要清楚地突出你的“稍后付款”选项(特别是对于移动用户)，同时保持信息和结账过程的简短和甜蜜。此外，在主页和每个产品页面上推广“稍后付款”会让消费者及早考虑这个选项，所以他们不会在结账时在最后一刻做出决定。\n最后，避免像“免息信贷”这样的术语描述，而倾向于简单的“现在购买，稍后付款”的文字，这是消费者已经认识到的。\n“以后付款”选项的缺点使用“稍后付款”是有缺点的，但对你来说好消息是：它们影响最大的是消费者，而不是零售商。\n例如，不付款的消费者最终可能会将他们的信息掌握在收债人手中。但由于“稍后付款”选项以不像信用卡公司那么可怕的术语重新塑造债务品牌，许多消费者可能没有意识到潜在的风险。\n消费者权益倡导者已经公开批评“以后付款”的公司利用脆弱的消费者。与此同时，他们也认识到，与发薪日贷款等其他掠夺性做法相比，这是一个更好的选择。总体而言，所有的批评都是针对“以后付费”的服务，而不是使用它们的商家。金融风险落在消费者身上，而不是商家身上。\nKlarna评论考虑到这一切，“稍后付款”对商家的好处远远大于坏处。让我们来看看卡拉纳是如何与流行的替代品相提并论的。\nKlarna实际上是一家银行，但通过专注于“以后付款”选项，它与传统银行和贷款人展开了竞争。\n对于商家来说，卡拉纳有很大的吸引力。结账过程超级简单，商家提前全额付款，交易手续费合理。然而，Klarna并没有为商家提供很好的客户支持。对于消费者来说，这些问题更加重要。\n消费者对Klarna的评论报告了不完整的购买问题、客户服务问题、未能处理退货等。这些负面评论意义重大，因为它们意味着消费者在使用Klarna之前在谷歌上进行快速搜索可能会被吓跑。如果他们真的使用它，并遇到类似的问题，他们可能会放弃你的网站，转而选择一个更好的“稍后付款”选项。\n考虑到这一点，我不会推荐Klarna，尽管它已经存在了很长一段时间，并得到了相当广泛的使用。以下是一些替代方案，各有优缺点：\nSetle-与Klarna不同的是，Setle有来自消费者的很好的评论。该服务还报告说，使用它的商家的销售额增长了10%。而且，像卡拉纳一样，他们预先付钱给商家。\nQuadPay-QuadPay的在线评论不像其他服务那么多，但现有的评论是令人担忧的负面评论。它还获得了更好的商业局(Better Business Bureau)的C级评级(这不是基于客户的评论)，所以最好避免使用。\nFuturePay-FuturePay面临着与QuadPay相同的问题，消费者对FuturePay的许多公开评价都很低。虽然这些服务是掠夺性的，这一事实是不可否认的，但在你的网站上提供一个让消费者更满意的服务会更好。\nAfterpay-Afterpay已经成功地让商家和消费者都感到高兴，因为你会希望从你的网站上的服务中获得积极的在线提及。他们为消费者提供良好的客户服务，而且不收取利息或费用来按时付款。他们还报告说，商家的转化率提高了22%。\n确认-这项服务有点不同，因为它向不能或不想使用信用卡的消费者提供带息贷款。不过，消费者的评价千差万别，所以你最好选择更受欢迎的产品。\nSplitit-这个超级方便的选项让消费者无需创建账户或使用应用程序即可付款。它的简洁性很吸引人，该公司获得了BBB认证，评级为A+。虽然网上关于它的评论很少，但现有的评论都是积极的。\n这些服务作为商家在设置和使用方面都相当类似，但有些服务比其他服务更受消费者欢迎。考虑到这一点，我们推荐比Klarna和这里列出的其他竞争对手更好的Sezy、Afterpay和Splitit。\n尽管消费者承担了这些服务的真正风险，但没有理由选择一项让消费者的生活变得更加困难的服务。考虑到所有其他的积极因素，没有理由不在你的网站上加入一个广受好评的“稍后付款”选项。\n回答这个问题", "note_en": "I came across a promoted post on Facebook about it and was wondering if anyone has experience with it?\n       Why Give Customers a “Pay Later” Option?   Klarna is just one choice in the growing ecommerce “shop now, pay later” trend. But does it really make a difference for customers to have this option? After all, credit cards also allow online shoppers to “pay later.”\n  This “pay later” trend is kind of like the “ layaway” tradition in brick-and-mortar stores. Like layaway, it’s really not aimed at the kind of consumer who has the financial flexibility of a credit card.\n  Instead, it offers a credit-like alternative to those shoppers who don’t qualify for a credit card, or who have maxed-out card balances. Needless to say, it doesn’t foster  responsible spending habits. But a brand’s responsibility has never been to make sure people spend wisely (arguably, it’s the opposite).\n  And unlike layaway, “shop now, pay later” options allow people to get their purchases right away, before paying them off in installments. This has clear appeal for today’s impatient online consumers, who want their purchases in their hands as soon as possible.\n  “Pay later” options also don’t always involve interest payments, so even credit card holders may choose them over making a purchase on a card. (And if there is interest, the rates tend to be far lower than those of credit cards.) Most of these options split the total cost of the purchase into four payments, which is manageable for customers without dragging out the payments over an absurd period of time.\n  All of this adds up to the fact that if consumers see a “pay later” option on your site, they might be more likely to buy from you than from a competitor. You’re giving people who don’t have the money up front the option to still become customers, which has clear potential for increasing sales. And you’re also giving credit card holders an attractive alternative that doesn’t involve high interest rates.\n  These “pay later” options also tend to  speed up the checkout process.  Long checkouts are a significant reason consumers abandon shopping carts, so merchants are wise to do what they can to speed things up.\n  As one more appealing bonus, your “pay later” solution assumes the risk for missed payments. They make sure you, the merchant, get the full amount of the purchase right away, while they collect the eventual payments from the shopper. This means that there’s really no reason not to include this option on your site.\n Does “Pay Later” Really Increase Sales?   The logic of these options is clear - but let’s see if the numbers also support their ability to drive sales.\n  First, consider this surprising statistic: as of 2016, just  one-third of millennial shoppers owned a credit card. This means that if your clientele is mostly younger, they’ll particularly be looking for “pay later” alternatives. And, unsurprisingly, millennials make up  the majority of “pay later” consumers already.\n  But other consumers besides millennials are warm to the idea.  A study by the RFi’s Group’s Global Digital Banking Council found that the vast majority of consumers are comfortable or very comfortable with trusting digital payment providers, which also suggests promise for “pay later” options.\n  Even more compelling is the fact that it took Australian “pay later” brand Afterpay  just two years to acquire over two million Australian customers, whose Afterpay spending amounted to more than $900 million Australian dollars.\n  So, as the numbers show, consumers are already eager to use “pay later” services. A BigCommerce survey also found that  45 percent of online consumers said financing options influenced their buying decisions.\n  Almost a third of them stated that if it weren’t for the “pay later” option, they’d have skipped a purchase. Similar surveys find the same thing: shoppers, especially young ones, report that “pay later” choices make them more likely to make a purchase.\n  However, it’s hard to find brands that report the exact sales impact of using “pay later” options. While many brands have surely measured this impact, they haven’t publicly published their findings. But it’s safe to say that for brands that have a millennial or gen Z audience, a significant positive impact is likely.\n    “Pay Later” Best Practices   This helpful post on Econsultancy reviews a few different sites that use “pay later” to see how they stack up. One crucial thing they found was that certain types of wording may be off-putting to consumers.\n  It’s important to highlight your “pay later” option clearly (especially for mobile users), while keeping the information and checkout process short and sweet. Also, promoting “pay later” on the homepage and every product page will get consumers thinking about the option early, so they aren’t making a last-minute decision at checkout.\n  Finally, avoid jargon-y descriptions like “interest-free credit” in favor of the simple “buy now, pay later” text that consumers have come to recognize.\n  Drawbacks of “Pay Later” Options   There are drawbacks to using “pay later,” but the good news for you is this: they most affect consumers, not retailers.\n  For example, consumers who fail to make payments might end up with their information in the hands of debt collectors. But because “pay later” options rebrand debt in less-scary terms than credit card companies, many consumers may not be aware of the potential risks.\n  Consumer advocates have already  openly criticized “pay later” companies for taking advantage of vulnerable consumers. At the same time, they also recognize that this is a better alternative than other predatory practices, like payday loans. Overall, all of the criticism is aimed at the “pay later” services, not the merchants who use them. And the financial risk lands on consumers, not merchants.\n    Klarna Reviews   With all of that in mind, the benefits of “pay later” for merchants far outweigh the drawbacks. Let’s take a look at how Klarna stacks up against popular alternatives.\n  Klarna is actually a bank, but by focusing on “pay later” options, it competes with traditional banks and lenders.\n  For merchants, Klarna has a lot of appeal. The checkout process is super-simple, merchants get paid in full up front, and the  transaction fees are reasonable. However, Klarna doesn’t offer great customer support for merchants. And for consumers, the issues are even more significant.\n  Consumer reviews of Klarna report incomplete purchase issues, customer service issues, failure to process returns, and more.  These negative reviews are significant, because they mean that a consumer who does a quick Google search of Klarna before using it might get scared away. And if they do use it and run into similar issues, they might give up on your site in favor of one with a better “pay later” option.\n  Other Options   With that in mind, I wouldn’t recommend Klarna, even though it’s been around for a long time and is fairly widely used. Here are some alternatives, with their pros and cons:\n  Sezzle - Unlike Klarna, Sezzle has  great reviews from consumers. The service also reports a  10 percent increase in sales for merchants that use it. And, like Klarna, they pay merchants up front.\n QuadPay - QuadPay doesn’t boast as many online reviews as other services, but  what reviews exist are concerningly negative. It also has a  C rating from the Better Business Bureau (which is not based on customer reviews), so is probably best avoided.\n FuturePay - FuturePay faces the same issues as QuadPay, with many  public low ratings from consumers. While the reality that these services are predatory can’t be denied, you’re better off featuring one that makes consumers happier on your site.\n Afterpay - Afterpay has managed to make  both merchants and consumers happy, with the type of  positive online mention you’ll want from a service on your site. They offer good customer service for consumers, plus no interest or fees for on-time payments. They also report  22 percent higher conversion rates for merchants.\n Affirm - This service is a bit different, in that it offers  loans with interest to consumers who can’t or don’t want to use credit cards. The consumer reviews  vary wildly, though, so you may be best off with something more well-received.\n Splitit - This  super-convenient option lets consumers pay without having to create an account or use an app. The simplicity is appealing, and the company is BBB accredited  with an A+ rating. While there are few reviews about it online,  the ones that exist are positive.\n  These services are all fairly comparable in terms of how easy they are to set up and use as a merchant, but some are much better-received by consumers than others. With that in mind, we recommend Sezzle, Afterpay, and Splitit above Klarna and the other competitors listed here.\n  Although consumers bear the real risks of these services, there’s no reason to choose a service that makes consumers’ lives more difficult than necessary. And with all of the other positives in mind, there’s no reason not to include a well-reviewed “pay later” option on your site.\n  Answer this question", "posttime": "2020-05-07 19:49:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电商,pay,消费者", "title": "卡拉纳的“稍后付款”对电商销售的影响", "title_en": "Klarna's “Pay Later” Impact on Ecommerce Sales", "transed": 1, "url": "https://capitalandgrowth.org/answers/2981368/What-kind-of-sales-impact-can-we-expect-from-using-Klarna-s-Pay-Later-Shopify-plugin", "via": "", "real_tags": ["电商", "pay", "消费者"]}, {"category": "", "categoryclass": "", "imagename": "1706064a800be75bc9cc78c891fb6b40.jpg", "infoid": 1001031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专家警告说，僵尸鹿病分布在24个州，每年有数千只受感染的鹿被吃掉。\n一种致命于鹿的传染病已经蔓延到24个州，一些专家警告说，这种疾病-非正式地被称为“僵尸病”-有朝一日可能会袭击人类。\n美国疾病控制和预防中心(Centers For Disease Control And Prevention)表示，截至今年1月，慢性消耗性疾病(CWD)已困扰着24个州和加拿大两个省的一只自由放养的鹿、麋鹿和/或驼鹿。\n明尼苏达大学传染病研究和政策中心主任迈克尔·奥斯特霍尔姆(Michael Osterholm)周五告诉“今日美国”(USA Today)：“我们正处于一个未知的领域。”\n他说，与食用受污染的肉类有关的人类慢性消耗性疾病病例很可能在未来几年被记录在案。人类病例的数量可能会很多，而且不会是孤立的事件。\n奥斯特霍尔姆将这种情况与20世纪80年代和90年代英国的疯牛病相提并论，当时公众怀疑这种疾病是否会传播到人类。据英国新闻媒体“独立报”报道，20世纪90年代，英国有156人死于疯牛病。\n根据疾控中心的说法，目前还没有人类CWD病例的报告，但研究表明，它可以传播给鹿以外的动物，包括灵长类动物。\n疾控中心说，对人类来说，吃受感染的鹿肉将是它最有可能传播给人的方式。\n根据公共野生动物联盟(Alliance For Public Wildlife)的数据，每年大约有7000到1.5万只感染CWD的动物被食用，这个数字可能会以每年20%的速度上升。奥斯特霍尔姆在证词中引用了该联盟的话。\n奥斯特霍尔姆说，科学家们还不能确定慢性萎缩性胃病是否会跨界感染人类，但随着时间的推移，人们食用更多受感染的肉类，这种可能性就会增加。\n奥斯特霍尔姆告诉立法者，如果斯蒂芬·金能写一部传染病小说，他会写一部关于朊病毒的小说。\nCDC说，在鹿身上，CWD通过受污染的体液、组织、饮用水和食物传播疾病。\n疾控中心说，这种疾病通过异常的朊病毒蛋白影响鹿的大脑和脊髓，这些蛋白破坏了正常的朊病毒蛋白。根据北卡罗来纳州野生动物委员会(North Carolina Wildlife Commission)的说法，神经细胞聚集并最终破裂，在大脑物质中留下微观的空白空间，使其看起来像海绵一样。\n症状可能需要一年多的时间才能发展出来，包括体重急剧下降，缺乏协调，无精打采，流口水，过度口渴或排尿，耳朵下垂，缺乏对人的恐惧和攻击性。\nCDC说，这种疾病于20世纪60年代末在科罗拉多州的圈养鹿中首次发现，在1981年在野鹿中发现。根据卫生机构的说法，CWD可能比24个州更普遍。\n一旦在一个地区建立了CWD，风险可能会在环境中保持很长一段时间。疾控中心在其网站上表示，受影响的地区可能会继续扩大。\n许多州的法规都是为了防止人类食用受感染的肉类。\n在北卡罗来纳州，任何人运输鹿科动物的身体进入该州都必须遵守严格的加工和包装规定。印第安纳州加强了监测工作，尽管测试不是强制性的。\n如果你把这个放进肉类加工厂.。奥斯特霍尔姆告诉立法者，这是一种最糟糕的噩梦。\n奥斯特霍尔姆说，在检测鹿肉方面需要做更多的工作。他说，虽然一些州进行了测试，但需要更快地进行测试，并建立更强大的基础设施，以防止受感染的鹿被食用。\n疾控中心建议猎人在受影响地区进食肉类之前对鹿进行测试。卫生机构说，如果鹿看起来生病或行为奇怪，猎人不应该射杀或处理它，也不应该吃它的肉。\n奥斯特霍尔姆说，如果猎人在受影响的地区，他们应该谨慎行事，并遵守州政府的规定。他说，没有人要求任何人停止狩猎。\n人们必须理解这件事的重要性。奥斯特霍尔姆告诉立法者，我们不能等到第一批案件到来。", "note_en": "&#39;Zombie&#39; deer disease is in 24 states and thousands of infected deer are eaten each year, expert warns\n    An infectious disease deadly in deer has spread to 24 states, and experts warned that the ailment – unofficially dubbed &#34;zombie&#34; deer disease – could one day hit humans.\n Chronic wasting disease, or CWD, has afflicted free-ranging deer, elk and/or moose in 24 states and two Canadian provinces as of January, the  Centers for Disease Control and Prevention said.\n &#34;We are in an unknown territory situation,&#34; Michael Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota, told USA TODAY on Friday.\n   &#34;It is probable that human cases of chronic wasting disease associated with consumption with contaminated meat will be documented in the years ahead,&#34; he said. &#34;It’s possible the number of human cases will be substantial and will not be isolated events.&#34;\n   Osterholm compared the situation to &#34;mad cow&#34; disease in the 1980s and 1990s in the United Kingdom, when there was public doubt that it could spread to humans. According to  British news outlet the Independent, 156 people died in the U.K. in the 1990s because of &#34;mad cow&#34; disease.\n  No cases of CWD have been reported in humans, but studies have shown it can be  transmitted to animals other than deer, including primates, according to the CDC.\n For humans, eating infected deer meat would be the most likely way for it to spread to people, the CDC says.\n About 7,000 to 15,000 animals infected with CWD are eaten each year, and that number could rise by 20 percent annually, according to the Alliance for Public Wildlife, which Osterholm cited in his testimony.\n Scientists can&#39;t say for sure that CWD will cross over and infect humans, but as time goes on and more infected meat is consumed, the likelihood increases, Osterholm said.\n    &#34;If Stephen King could write an infectious disease novel, he&#39;d write it about prions,&#34; Osterholm told lawmakers.\n In deer, CWD spreads through contaminated bodily fluids, tissue, drinking water and food, the CDC says.\n The disease affects deer&#39;s brains and spinal cords through abnormal prion proteins that damage normal prion proteins, the CDC said. The cells collect and eventually burst, leaving behind microscopic empty spaces in the brain matter that give it a “spongy” look, according to the North Carolina Wildlife Commission.\n  Symptoms, which can take more than a year to develop, include drastic weight loss, lack of coordination, listlessness, drooling, excessive thirst or urination, drooping ears, lack of fear of people and aggression.\n The disease was first identified in captive deer in the late 1960s in Colorado and in wild deer in 1981, the CDC said. According to the health agency, CWD could be more widespread than 24 states.\n &#34;Once CWD is established in an area, the risk can remain for a long time in the environment. The affected areas are likely to continue to expand,&#34; the  CDC says on its website.\n Many state regulations are in place aimed at preventing humans from eating the infected meat.\n In North Carolina, anyone transporting cervid (animals from the deer family) carcass parts into the state must follow strict processing and packaging regulations. Indiana stepped up its monitoring efforts, though testing is not mandatory.\n &#34;If you put this into a meat processing plant ... this is kind of a worst case nightmare,&#34; Osterholm told lawmakers.\n Osterholm said more needs to be done in the way of testing deer meat. Though some states test, it needs to be done quicker and with a more robust infrastructure to prevent infected deer from being consumed, he said.\n The CDC recommended that hunters test deer before eating meat in affected areas. If a deer looks sick or acts strangely, hunters should not shoot or handle it or eat its meat, the health agency said.\n Osterholm said hunters should be cautious and follow state regulations if they&#39;re in an affected area. &#34;No one is asking anyone to stop hunting,&#34; he said.\n &#34;People have to understand the significance of this. We can&#39;t wait until we have the first cases coming,&#34; Osterholm told lawmakers.", "posttime": "2020-05-07 19:49:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "传染给,deer,可能", "title": "美国24个州可传染给灵长类的僵尸鹿病(2019年)", "title_en": "Zombie Deer Disease, transmittable to primates, in 24 US states (2019)", "transed": 1, "url": "https://www.usatoday.com/story/news/health/2019/02/16/zombie-deer-chronic-wasting-disease-could-affect-humans/2882550002/", "via": "", "real_tags": ["传染给", "deer", "可能"]}, {"category": "", "categoryclass": "", "imagename": "5444139498f4f443cb1be0cd6c7644e1.jpg", "infoid": 1001030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不过，她没有去医院。取而代之的是，这位华盛顿州居民等了近一周。\n当Abhineet Chowdhary医生最终见到她时，他发现她有一个没有得到治疗的脑出血。\n华盛顿州贝尔维尤奥弗莱克神经科学研究所所长乔杜里说，结果，她多次中风，最终去世。这是我们大多数时候都能防止的事情。\nChowdhary说，这名患者是一名55岁左右的中风幸存者，她告诉他，她害怕医院。\n这种恐惧的后果让美国医生担心了几个星期，同时他们追踪到了一个令人担忧的趋势：随着大流行的蔓延，中风和心脏病发作等严重心血管紧急情况出现在医院的患者数量大幅减少。\n在全美，医生们称这种下降是令人震惊的，这与他们见过的任何情况都不同。他们担心新一波病人正朝着他们的方向前进-那些延误了治疗的人，当他们最终到达急诊室时，他们的病情会更重，伤势会更重。\n它已经引起了某些医学组织的警觉，比如美国心脏病学院和美国心脏协会。后者正在投放广告，敦促人们在出现心脏病发作或中风症状时拨打911。\n美国急诊医师学院院长威廉·贾基斯(William Jaquis)博士说，在全国范围内，急诊室的数量下降了大约40%到50%。\n加州格伦代尔南加州大学Verdugo Hills医院急诊室主任大卫·塔什曼(David Tashman)博士在谈到疫情爆发的早期时说，这非常可怕，因为那里太安静了。\n我们通常一天要看100个病人，然后你知道，一夜之间，我们就降到了30或40个。\n随着医院准备应对冠状病毒患者的激增，官员们建议人们如果可能的话，尽量避开急诊室。塔什曼说，看到更少的创伤病人，他并不感到惊讶，因为道路变得空荡荡的。但很快，他和其他急诊室医生注意到，即使是真正紧急的病例也没有进来。\n我们知道心脏病发作的数量不会在大流行中下降。塔什曼说，它真的不应该。\n加州兰开斯特市羚羊谷医院的急诊室医生拉里·斯托克(Larry Stock)也有同样的想法。\n我的意思是，我们都在挠头--这些病人都到哪里去了？斯托克说。他们都在家里，我们开始有了。这只是这一现象的冰山一角。\n一项研究收集了全国九家医院的数据，重点是心脏病发作后用于重新打开堵塞的心脏动脉的关键程序。与前几个月相比，这些医院在3月份进行的此类手术减少了38%。\n在西雅图的哈博维尤医疗中心，马尔维卡·夏尔马(Malveeka Sharma)博士追踪到，与前一年相比，4月上半月中风入院人数下降了60%。\n根据紧急医疗服务机构使用的软件公司ESO收集的数据，在全国范围内，3月份至4月初，中风和心脏病发作的911呼叫量下降了。\n耶鲁大学医学院(Yale School Of Medicine)神经危重护理和急诊神经病学部主任谢斯(Sheth)说，几乎所有地方的这一数字都大幅下降。从公共卫生的角度来看，这是一件大事。\n谢斯说，临床中风中心发现接受治疗的中风患者数量出现了前所未有的下降，降幅从50%到70%不等。\n今年4月，美国心脏和美国中风协会发布了紧急指导，以确保医疗保健提供者保持中风团队的活跃状态，并准备在大流行期间治疗患者。\n谢斯说，他担心照顾所有在推迟治疗后最终出现在医院的情况更糟的患者可能是具有挑战性的。\n他表示：当这些中风次数回升时，我们可能会遇到严重的产能问题。我们已经挤得水泄不通了。\n洛杉矶锡达斯-西奈医学中心(Cedars-Sinai Medical Center)的心脏病专家、美国心脏协会洛杉矶分会董事会主席约翰·哈罗德(John Harold)博士说，人们正处于这种恐惧状态。\n哈罗德说，人们避免住院的全部公共健康后果还不清楚。\n已经处于经历医疗紧急情况的较高风险的患者描述了关于如何获得安全和足够的护理的恐惧和困惑的混合。\n这位来自华盛顿州贝灵汉的35岁男子在联系他的医生(他通常会亲自去看医生)续杯时遇到了困难。\n在没有服用药物的几天内，他在淋浴时发作了一次严重的癫痫。他的护理员叫了一辆救护车，把他送到了急诊室。\n我醒来后问我在哪里，发生了什么事，董扎尔斯基说。我隔壁房间的那个家伙一直在咳嗽，做着各种各样的事情。\n这段经历非常令人不安，如果可能的话，董扎尔斯基现在计划避开医院。\n他说：我不去医院，除非我癫痫发作，伤到自己。我宁愿呆在这里，也不愿潜在的病毒问题。\n迈阿密居民斯泰克·辛普森(Stayc Simpson)回忆起3月中旬她去急诊室时的一次可怕的磨难。\n辛普森是一位患有心力衰竭的癌症幸存者，她醒来时心跳加速，她担心这可能是心脏病发作。\n在医院，她接受了冠状病毒筛查，并很快被转移到疑似病例病房，因为她咳嗽，尽管这也是心力衰竭的症状。\n辛普森说：当现实降临，我在COVID部门工作时，我想，如果我以前没有过这种经历，那么现在我很可能会这样做。\n她在那里呆了一天，焦急万分。六天后，回到家里，她得知自己的病毒检测呈阴性。\n辛普森知道，自大流行初期以来，医院已经做出了许多改变，但拨打911的想法仍然让她感到害怕。\n我看过新闻报道，说现在更安全了。..。她说：我不知道我现在是否对此完全有信心。COVID的风险是可怕的。\n在洛杉矶，60岁的杰奎琳·阿里卡尼(Jacqueline Alikhaani)也有同样的恐惧。她患有糖尿病和一种罕见的心脏病，几年前她中风了。\n几周前，她开始感到胸口疼痛。她说，在大流行之前，她会毫不犹豫地去当地的急诊室。\n她说：我现在觉得这不是一件很舒服的事情。这是一个艰难的抉择，艰难的抉择。\n洛杉矶市中心的急诊室医生安德里亚·奥斯汀(Andrea Austin)说，我从来没有见过过去一个月左右延误的次数。\n她正在治疗更严重的病例，因为病人正在等待。奥斯汀说，这真的是冠状病毒的悲剧之一。他们呆在家里，试图诊断自己，或者真正淡化自己的症状。\n来自华盛顿州贝尔维尤的神经外科医生乔杜里(Chowdhary)说，他的一些中风患者已经看到了改变生活的后果。\n一名年长的男子注意到他左侧身体虚弱，但四天没有去医院。\n乔杜里说，现在，在这一点上，我们无法做任何事情来逆转中风。这种弱点是永久性的。\n由于中风的损害，患者不能再照顾他的妻子，他的妻子有认知问题。最终，这对夫妇不得不离开他们的家，搬进了一家疗养院。\n贝尔维尤奥弗莱克中风项目协调员詹妮弗·库尔茨(Jennifer Kurtz)表示，一些推迟治疗的患者现在正在努力应对身体和情感上的损失。\n她说，他们感到非常内疚和后悔，以至于没有早点来医院。\n一名照顾者向库尔茨承认，当她第一次注意到中风的症状时，她没有带丈夫来医院。\n她甚至不能告诉她的女儿……。库尔茨说，因为她太羞愧了。\n患者必须驾驭来自公共官员的有时相互矛盾的信息，以及对他们日常医疗的干扰。\n从3月份开始，随着公共卫生部门研究预测模型并做好最坏的准备，关于即将到来的冠状病毒患者洪流的警告在全国范围内流传。有报道称，医护人员生病了，并乞求更多的个人防护装备，如口罩、长袍和手套。\n美国心力衰竭协会主席、休斯敦贝勒医学院心脏病专家Biykem Bozkurt博士说，在纽约市和新奥尔良等热点地区，冠状病毒患者的激增导致人们感到医疗保健系统不堪重负，没有能力。\nBozkurt说，这可能造成了一种错误的情绪，认为常规护理将被推迟，或者没有能力容纳非COVID患者-事实并非如此。我们希望我们的病人寻求治疗，而不是等待。\n医院也在努力让患者放心，他们正在采取预防措施，以确保患者的安全。许多医院已经制定了收治疑似冠状病毒患者的方案，例如急诊室内的单独筛查区和医院专门为冠状病毒住院患者设立的区域。\n塔什曼是南加州大学Verdugo Hills医院的急诊医生，他恳求有心脏病和中风症状的患者立即前来寻求帮助：不要拖延。你没有打扰我们。你没有强加于我们。\n随着居家命令在美国部分地区生效，医生们正试图在他们的信息中取得平衡：他们仍然希望患者避免去医院，但如果有紧急迹象，就毫不犹豫地去医院。\n加利福尼亚州兰开斯特市的急诊医生斯托克说，信息必须稍微细微差别，人们才能正确理解，这样他们就不会因为只听一条信息而受伤，那就是呆在家里，加利福尼亚州兰开斯特市的急诊医生斯托克说。我们需要让人们感觉到……。[急诊室]对他们来说是安全、干净的地方。\n这篇报道是NPR与KPCC和Kaiser Health News健康报道伙伴关系的一部分。", "note_en": "She didn&#39;t go to the hospital though. Instead, the Washington state resident waited almost a week.\n  When  Dr. Abhineet Chowdhary finally saw her, he discovered she had a brain bleed that had gone untreated.\n    &#34;As a result, she had multiple other strokes and ended up passing away,&#34; says Chowdhary, director of the Overlake Neuroscience Institute in Bellevue, Wash. &#34;This is something that most of the time we&#39;re able to prevent.&#34;\n  Chowdhary says the patient, a stroke survivor in her mid-50s, had told him she was frightened of the hospital.\n    The fallout from such fear has concerned U.S. doctors for weeks while they have tracked a worrying trend: As the pandemic took hold, the number of patients showing up at hospitals with serious cardiovascular emergencies such as strokes and heart attacks has shrunk dramatically.\n  Across the U.S., doctors call the drop-off staggering, unlike anything they&#39;ve seen. And they worry a new wave of patients is headed their way — people who have delayed care and will be sicker and more injured when they finally arrive in emergency rooms.\n    It has alarmed certain medical groups such as the  American College of Cardiology and the American Heart Association. The latter is running ads to urge people to call 911 when they&#39;re having symptoms of a heart attack or stroke.\n    Across the country, ER volumes are down about 40% to 50%, says  Dr. William Jaquis, president of the  American College of Emergency Physicians.\n      &#34;It was very scary, because it was so quiet,&#34; says  Dr. David Tashman, medical director of the ER at USC Verdugo Hills Hospital in Glendale, Calif., about the early days of the outbreak.\n  &#34;We normally see 100 patients a day, and then you know, overnight, we were down to 30 or 40.&#34;\n    As hospitals prepared for a surge of COVID-19 patients, officials advised people to avoid emergency rooms if at all possible. Tashman says he wasn&#39;t surprised to see fewer trauma patients, because the roads were emptier. But soon he and other ER physicians noticed that even truly urgent cases were not coming in.\n  &#34;We know the number of heart attacks isn&#39;t going to go down in a pandemic. It really shouldn&#39;t,&#34; Tashman says.\n  Dr. Larry Stock, an ER doctor at Antelope Valley Hospital in Lancaster, Calif., wondered the same thing.\n  &#34;I mean, we&#39;ve all been scratching our heads — where are all these patients?&#34; Stock says. &#34;They&#39;re at home, and we&#39;re starting to get ... the tip of the iceberg of this phenomenon.&#34;\n  One  study collected data from nine hospitals across the country, focusing on a crucial procedure used to reopen a blocked cardiac artery after a heart attack. The hospitals performed 38% fewer of those procedures in March, compared with previous months.\n  At Harborview Medical Center in Seattle,  Dr. Malveeka Sharma has tracked a 60% decline in stroke admissions in the first half of April compared with the previous year.\n  Nationally, 911 call volumes for strokes and heart attacks declined in March through early April, according to data collected by ESO, a software company used by emergency medical service agencies.\n      &#34;The numbers had dramatically plummeted almost everywhere,&#34; says Sheth, chief of the division of neurocritical care and emergency neurology at Yale School of Medicine. &#34;This is a big deal from a public health perspective.&#34;\n  Sheth says clinical stroke centers have seen an &#34;unprecedented&#34; drop in stroke patients being treated, with decreases ranging from 50% to 70%.\n  In April, the American Heart and American Stroke associations put out  emergency guidance to ensure health care providers keep stroke teams active and ready to treat patients during the pandemic.\n  Sheth says he worries it could be challenging to care for all the patients who eventually show up at hospitals in even worse shape after delaying care.\n  &#34;When those stroke numbers come back, we could have serious capacity issues,&#34; he says. &#34;We were already bursting at the seams.&#34;\n  &#34;People are in this fear mode,&#34; says  Dr. John Harold, a cardiologist at Cedars-Sinai Medical Center in Los Angeles and board president of the Los Angeles chapter of the American Heart Association.\n  Harold says the full public health consequences of people avoiding the hospital aren&#39;t yet clear.\n      Patients who are already at higher risk of experiencing medical emergencies describe a mix of fear and confusion about how to get safe and adequate care.\n    The 35-year-old from Bellingham, Wash., had trouble reaching his doctor, whom he would normally see in person, to get a refill.\n  Within a few days of not taking the medication, he had a major seizure while in the shower. His caregiver called an ambulance, which took him to the ER.\n  &#34;I woke up and asked where I was and what happened,&#34; Domzalski says. &#34;The guy in the next room to me was coughing and doing all kinds of stuff.&#34;\n  The experience was so unnerving that Domzalski now plans to avoid the hospital, if at all possible.\n  &#34;I am not going to the hospital unless I have a seizure and injure myself,&#34; he says. &#34;I&#39;d rather stay here than potentially have problems from the virus.&#34;\n  Miami resident Stayc Simpson recalls a frightening ordeal when she went to the ER in mid-March.\n  Simpson, who&#39;s a cancer survivor with heart failure, woke up with a pounding heart rate that she worried could be a heart attack.\n  At the hospital, she was screened for the coronavirus and was soon moved to a unit for suspected cases because she had a cough, even though that is also a symptom of heart failure.\n  &#34;When the reality hit that I was in the COVID unit, I thought, if I didn&#39;t have it before, then I probably will now,&#34; Simpson says.\n  She spent a day there, wracked with anxiety. Six days later, back at home, she learned she had tested negative for the virus.\n  Simpson knows the hospitals have made many changes since the early days of the pandemic, but the thought of calling 911 still scares her.\n  &#34;I have seen news reports that tell me it&#39;s safer now. ... I don&#39;t know if I have full confidence in that right now,&#34; she says. &#34;The risk of COVID is terrifying.&#34;\n  In Los Angeles, Jacqueline Alikhaani, 60, has the same fear. She has diabetes and a rare form of heart disease, and she suffered a stroke several years ago.\n  A few weeks ago she started experiencing chest pains. She says that before the pandemic, she wouldn&#39;t hesitate to go to her local ER.\n  &#34;That&#39;s just not something I feel very comfortable with right now,&#34; she says. &#34;It&#39;s a tough call, tough decisions.&#34;\n      &#34;I&#39;ve never seen the number of delays that I have in the last month or so,&#34; says  Dr. Andrea Austin, an ER physician in downtown Los Angeles.\n  She&#39;s treating more serious cases because patients are waiting. &#34;That&#39;s really one of the tragedies of COVID-19,&#34; Austin says. &#34;They&#39;re staying at home and trying to diagnose themselves or really playing down their symptoms.&#34;\n    Chowdhary, the neurosurgeon from Bellevue, Wash., says some of his stroke patients have already seen life-altering consequences.\n  One older man noticed weakness on the left side of his body but avoided the hospital for four days.\n  &#34;Now, at that point, we couldn&#39;t do anything to reverse the stroke,&#34; Chowdhary says. &#34;That weakness is permanent.&#34;\n  Because of the stroke damage, the patient could no longer take care of his wife, who has cognitive issues. Eventually, the couple had to leave their home and move into a nursing home.\n  Jennifer Kurtz, stroke program coordinator at Overlake in Bellevue, says some patients who delayed care are now grappling with the physical and emotional toll.\n  &#34;They feel so much guilt and regret that they didn&#39;t come to the hospital earlier,&#34; she says.\n  One caregiver confessed to Kurtz that she didn&#39;t bring her husband to the hospital when she first noticed symptoms of a stroke.\n  &#34;She can&#39;t even tell her daughter [that] ... because she is so ashamed,&#34; Kurtz says.\n    Patients must navigate the sometimes-conflicting messages from public officials as well as disruptions to their routine medical care.\n  Beginning in March, warnings about a coming flood of COVID-19 patients circulated around the country as public health departments studied predictive models and braced for the worst. Stories emerged of health care workers falling ill and begging for more personal protective equipment such as masks, gowns and gloves.\n    The surge of COVID-19 patients in hot spots such as New York City and New Orleans led to &#34;the sense of an overstretched health care system without capacity,&#34; says  Dr. Biykem Bozkurt, president of the  Heart Failure Society of America and a cardiologist at Baylor College of Medicine in Houston.\n  &#34;This may have created a false sentiment that routine care is to be deferred or that there is no capacity for non-COVID patients — this is not the case,&#34; Bozkurt says. &#34;We would like our patients to seek care, not wait.&#34;\n  Hospitals are also trying to reassure patients that they are taking precautions to keep patients safe. Many have set up protocols for admitting suspected COVID-19 patients such as separate screening areas inside the ER and dedicated areas of the hospital for coronavirus inpatients.\n  Tashman, the emergency physician at USC Verdugo Hills Hospital, is pleading with patients to come in for help immediately for heart attack and stroke symptoms: &#34;Don&#39;t delay. You&#39;re not bothering us. You&#39;re not imposing on us.&#34;\n    With stay-at-home orders in effect in parts of the country, physicians are trying to strike a balance in their messaging: They still want patients to avoid hospitals yet not hesitate to go if there are signs of an emergency.\n  &#34;The message has to be slightly more nuanced for people to get it right, so they don&#39;t get hurt by just listening to one message, which is stay home,&#34; says Stock, the emergency physician in Lancaster, Calif. &#34;We need to make people feel ... that [emergency rooms] are safe, clean places for them to come.&#34;\n  This story is part of NPR&#39;s health reporting partnership with   KPCC  and   Kaiser Health News .", "posttime": "2020-05-07 06:46:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "空虚,emptiness,患者", "title": "急诊室令人毛骨悚然的空虚令医生担忧：心脏病发作和中风在哪里？", "title_en": "Eerie Emptiness of ERs Worries Doctors: Where Are the Heart Attacks and Strokes?", "transed": 1, "url": "https://www.npr.org/sections/health-shots/2020/05/06/850454989/eerie-emptiness-of-ers-worries-doctors-where-are-the-heart-attacks-and-strokes", "via": "", "real_tags": ["空虚", "emptiness", "患者"]}, {"category": "", "categoryclass": "", "imagename": "5007608adbef9762f00316da62cca4c2.png", "infoid": 1001029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很高兴地宣布，虚幻引擎4.25现在可以下载，为所有行业提供了一系列新的和增强的功能。对于游戏开发商来说，这是第一个最初支持索尼的PlayStation 5和微软的Xbox Series X作为一流平台的版本，全年我们将更新4.25-Plus分支，提供优化、修复和认证要求，以支持在下一代游戏机上启动的开发人员。特性包括特定于平台的功能，例如新的音频改进、对在线子系统的初始支持以及对TRC和XR认证要求的早期支持。无论您的目标平台有多强大，您都会想要从中榨取每一分性能，这就是性能分析的用武之地。Unreal Insights独立评测应用程序现在提供了改进的用户体验，并引入了Networking Insights，可帮助您优化、分析和调试网络流量；我们还在虚幻编辑器中添加了单独的Animation Insights插件，以实现游戏状态和实时动画行为的可视化。堡垒之夜团队一直在对尼亚加拉特效和混沌物理进行战斗测试，这些功能集现在已经在游戏的当前发货季节使用。尼亚加拉现在已经为生产做好了准备，拥有精致的新UI以及显著的性能和稳定性改进。还有许多新功能，包括能够创建复杂的大规模粒子效果，如群集和链，以及让粒子对音乐或其他音频源做出反应-所有这些都是实时的。同时，我们还在继续发展混沌物理和破坏系统，我们很高兴地说，在这个版本中，混沌支持破坏、碰撞的静态网格动力学、布料、头发、诸如马尾辫等项目的刚体骨骼控制，以及场景查询。在未来的版本中还会有更多内容。如果您希望制作高质量的电影和剧照，用于电影学、营销材料或线性娱乐，只需看看我们全新的媒体输出管道就可以了，该管道可让您使用累积的抗锯齿和运动模糊进行渲染。该管道还支持平铺渲染，因此您可以直接从虚幻引擎生成极高分辨率的图像，而无需后处理。可以将多个渲染作业排队并渲染，而无需用户干预。对于模拟有色车窗和拉丝金属等材质，有一个新的薄透明着色模型和一个新的各向异性材质输入属性。\n最常用于模拟多层车漆的透明涂层着色模型也得到了改进；它现在对平行光、聚光灯和点光源显示了更精确的物理响应。视觉保真度是一回事，但音频保真度也很重要。为了获得更逼真、更逼真的实时体验，虚幻音频引擎现在支持声场渲染和卷积混响处理，使您能够使用详细的捕获或设计的声场(球形包裹您的听众)，以及模拟真实声音空间的采样混响脉冲。对于任何想要使用LiDAR数据的人，虚幻引擎现在都内置了对导入、可视化、编辑和与点云交互的支持。这些真实世界的捕捉对于可视化位置或将新设计的元素放入上下文非常有用。该插件的初始版本之前已在Marketplace上提供；除了包括在虚幻引擎4.25中之外，最新的插件还提供了新的支持，可以在保持帧性能的同时使用多个点云段，还可以选择删除隐藏点，以及各种其他小的增强功能。此次发布的另一个达到生产就绪的功能是对HoloLens 2的支持。除了性能改进之外，还新增了对从第三人称摄像头视图进行混合现实捕捉的支持、通过命令行从打包的虚幻引擎应用程序启用HoloLens远程处理的新功能，以及对Azure Spatial Anchors的初始支持。\n最后，随着这个版本的发布，实时光线跟踪现在也正式为生产做好了准备！从游戏、电影和广播到汽车和建筑可视化，光线跟踪使您能够在实时项目中达到新的可信度水平。\n这些只是虚幻引擎4.25中的几个亮点。请查看发行说明以了解更多信息并查看完整的功能列表。请参阅发行说明，其中一些功能是测试版或试验性的，不应被视为生产就绪。有关详细信息，请参阅发行说明。\n如果你是虚幻引擎的现有用户，你可以从史诗游戏启动器下载虚幻引擎4.25。如果您是第一次潜水，请单击下面的链接开始。无论哪种方式，我们都希望您喜欢所有的新功能", "note_en": "We’re pleased to announce that Unreal Engine 4.25 is now available for download, with a host of new and enhanced features for industries across the board.  For game developers, this is the first release with initial support for Sony’s PlayStation 5 and Microsoft’s Xbox Series X as first-class platforms, and throughout the year we will be updating the 4.25-Plus branch with optimizations, fixes, and certification requirements to support developers launching on the next generation of consoles. Features include platform-specific functionality, such as new audio advancements, initial support for online subsystems, and early support for TRC and XR certification requirements.   No matter how powerful your target platform, you’ll want to squeeze every ounce of performance out of it, which is where profiling comes in. The Unreal Insights standalone profiling application now offers an improved user experience and introduces Networking Insights, which helps you optimize, analyze, and debug network traffic; we’ve also added a separate Animation Insights plugin to the Unreal Editor, enabling the visualization of gameplay state and live animation behavior.  The Fortnite team has been battle-testing Niagara VFX and Chaos physics, and these feature sets are now in use in currently shipping seasons of the game. Niagara is now production-ready, with a polished new UI and signficant performance and stability improvements. There are also a host of new features, including the ability to create complex, large-scale particle effects such as flocking and chains, and to have particles react to music or other audio sources—all in real time.   Meanwhile, we’re continuing to progress the Chaos physics and destruction system, and we’re happy to say that with this release, Chaos supports destruction, static mesh dynamics with collisions, cloth, hair, rigid-body skeletal control for items such as ponytails, and scene queries. There’s still more to come in future releases.   If you’re looking to produce high-quality movies and stills for uses like cinematics, marketing materials, or linear entertainment, look no further than our brand-new media output pipeline that lets you render with accumulated anti-aliasing and motion blur. The pipeline also supports tiled rendering, so you can produce extremely high-resolution images directly from Unreal Engine without post-processing. Multiple render jobs can be queued and rendered without user intervention.  For simulating materials like tinted car windows and brushed metal, there’s a new Thin Transparency shading model, and a new Anisotropy material input property.\n   The Clear Coat shading model, most commonly used to simulate multilayered car paint, has also been improved; it now exhibits a much more physically accurate response to directional, spot, and point lights.   Visual fidelity is one thing, but audio fidelity is also important. For more immersive, realistic real-time experiences, the Unreal Audio Engine now supports sound field rendering and convolution reverb processing, enabling you to use detailed captured or designed sound fields that spherically envelop your listeners, and sampled reverb impulses that simulate real-life acoustic spaces.  For anyone wanting to work with LiDAR data, there’s now built-in support in Unreal Engine for importing, visualizing, editing, and interacting with point clouds. These real-world captures are great for visualizing locations, or for putting newly designed elements in context. The initial version of the  plugin was previously made available on MarketPlace; in addition to being included in Unreal Engine 4.25, the latest plugin also offers new support for working with multiple point cloud segments while still maintaining frame performance, an option to delete hidden points, and various other small enhancements.   Another feature to reach production-readiness with this release is support for HoloLens 2. As well as performance improvements, there’s new support for mixed reality capture from a third-person camera view, the new ability to enable HoloLens remoting from packaged Unreal Engine applications via a command line, and initial support for Azure Spatial Anchors.\n Finally, with this release, real-time ray tracing is now also officially production-ready! From games, films, and broadcast to automotive and architectural visualization, ray tracing enables you to achieve new levels of believability in your real-time projects.\n These are just a few of the highlights in Unreal Engine 4.25. Check out the release notes to find out more and see the full feature list.   See the release notes    Some features are beta or experimental, and should not be considered production-ready. See the release notes for details.\n  If you’re an existing Unreal Engine user, you can download Unreal Engine 4.25 from the Epic Games launcher. If you&#39;re looking to dive in for the first time, click the link below to get started. Either way, we hope you enjoy all the new features and upgrades, and as always, we encourage your feedback!", "posttime": "2020-05-07 06:19:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,虚幻,unreal,支持", "title": "虚幻引擎4.25发布", "title_en": "Unreal Engine 4.25 Released", "transed": 1, "url": "https://www.unrealengine.com/en-US/blog/unreal-engine-4-25-released", "via": "", "real_tags": ["发布", "虚幻", "unreal", "支持"]}, {"category": "", "categoryclass": "", "imagename": "0ada828b5929119b69dbdd962e6d4b1d.jpeg", "infoid": 1001028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当有人问我如何进入数据科学领域时，我给出的建议。转而成为一名软件工程师。\n这是一篇评论文章。我很想听听你下面的反驳意见。\n每个人和他们的祖母都想成为一名数据科学家。但是，虽然数据科学可能是21世纪最性感的工作，但这打折了另一个回报丰厚的高薪职业--软件工程师。\n我经常收到应届毕业生和转行人士的信息，询问我如何进入数据科学领域。我告诉他们去做一名软件工程师。\n两者都有经验，我会试着说服你成为后者。\n与数据科学相比，软件工程领域的工作岗位多了一个数量级。\n以下是在谷歌上搜索“数据科学家”和“软件工程师”工作后的几张截图。\n这是7616个数据科学工作岗位，而软件工程工作岗位为53，8893个。这只是美国的就业情况，但其他国家也出现了类似的结果。\n根据GlassDoor的说法，数据科学家赚的钱更多，但我未经检验的假设是，数据科学的工作平均也更高级。\n也就是说，如果Open AI给你100万美元的薪水，我建议你接受它。\n管理层通常对“数据科学”的含义没有达成共识。考虑到业务限制，他们也有可能没有严格遵循角色框架的奢侈品。\n这意味着“数据科学家”的职责因公司而异。\n虽然软件工程师和数据科学家之间可能存在一个理想的角色范围，但在现实中不太可能遵循。对于仍在建设基础设施的初创企业来说，这一点尤其适用。\n被录用的应聘者最终会致力于公司目前需要解决的问题，而不是他们可能被录用的“角色”。\n来自该领域同事的轶事证据是，许多数据科学家发现自己像软件工程师一样编写后端代码。我还认识其他“数据科学家”，他们用excel处理金融数据。\n这与你在Kaggle比赛中长大的预期形成了鲜明的对比。\n大多数公司不需要像软件工程师那样多的数据科学家。其他公司现在正在招聘他们的第一位数据科学家。\n出于这个原因，许多数据科学家最终独自工作，即使他们与开发人员坐在同一张桌子上。\n这可能会使获得反馈和第二意见变得困难。软件工程师要么不了解预测建模，要么忙于处理完全不同的问题。\n相反，加入软件工程团队的好处之一是能够对同事说，“我认为我们应该以XYZ的方式实现ABC。你觉得怎么样？“。\n准备好与管理层进行尴尬的对话，讨论为什么你花了两周的时间买的东西不能使用。\n处理已解决的问题和未解决的问题是软件开发和人工智能之间的根本区别之一。\n撇开错误和限制不谈，在开始任何工作之前，您应该知道大多数软件工程项目是否可行。对于ML就不能这么说了，因为您只有在构建模型之后才知道模型是否有效。\n即使在每个公司都是人工智能公司的时代，大多数公司也没有支持它的基础设施，甚至不需要它。\n最近，一家规模迅速扩大的初创公司的数据科学负责人在喝咖啡时分享了一些建议。\n首先，你要找出问题所在，然后建立基础设施，然后再请来数据科学家。这不是一个快速的过程。(我转述)。\n最近，另一家知名公司的第一个数据科学招聘人员向我发泄了自己的想法。她被迫在笔记本电脑上培训人工智能模型，而不是在云中。\n如果你没有具体的问题需要解决，或者公司没有做好数据科学的准备，你可能会发现自己很难增加价值。\n成为一名初级软件工程师就像获得技术MBA学位一样。每件事你都能学到一点。\n您将通过观察您的Scrum领导者、高级开发人员或PM来学习管理构建软件。\n如果你进入了一家拥有成熟工程团队的公司，几乎可以保证你会迅速提升自己的技能，并建立一个多面手的背景。\n通过提供更全面的技术体验，软件工程在您决定进行更改时提供了更好的退出机会。\nDevOps，安全，前端，后端，分布式系统，商业智能，数据工程，数据科学…。\n我认识一些从软件转到数据科学的开发人员。如果你浏览一下数据科学的职位描述，你会立即注意到他们到处都是核心的软件开发技能。\n如果您可以构建端到端项目，那么您还可以做的不仅仅是为Kaggle构建模型。您可以采用该模式，将其产品化，设置授权和条带化，然后开始向用户收取访问费用。那是你自己的创业公司。\n我从不认为数据科学不能转让。根据数据做出决策是一项杀手级技能。但随着我们变得更加数据驱动，这也将成为每项工作中更加重要的东西。\n随着人工智能变得商品化和更容易使用，软件工程师将开始使用它来解决他们的问题。\n我可以教一个开发人员在一个下午构建SkLearning分类器。这并不意味着他们可以构建下一个AlphaGo，但它确实为他们提供了一种替代基于用户输入的硬编码条件逻辑。\n数据科学家拥有统计学等专业知识，并对模型如何工作有一种直觉。但是DevOps和安全工程师也有他们自己的专业知识。\n我会争辩说，这些都是普遍的，而不是不同的。一位经验丰富的软件专业人士可以在不同的专业之间移动，其速度比新进入者掌握专业的速度快一个数量级。\n虽然我认为我们不会看到数据科学与软件工程的完全合并，但它确实感觉数据科学可以成为另一个软件工程专业。\n尽管听起来很傻，但我在2014年进入软件工程行业，因为我担心人工智能会让其他所有工作都过时。\n然而，从那时起，表盘几乎没有移动到特定环境之外。技术采用缓慢，人工智能的范围比媒体希望你相信的要小。\n与其他职业相比，机器学习离自动化软件工程更远。虽然我们有初创公司开发了像支持人工智能的代码完成这样的很酷的产品，但编写代码并不是真正的工作。这项工作是用技术解决问题。\n首先，这是轶事。其次，我意识到我把数据科学家、ML工程师和人工智能研究人员混为一谈。但我认为这些论点仍然值得考虑，因为这是你的职业。\n别看得那么严重。我更希望你研究一下，自己做决定。毕竟，这是作为一名数据科学家的一部分：)。", "note_en": "The advice I give when someone asks me how to get into data science. Become a software engineer instead.\n   This is an opinion piece. I’d love to hear your counter arguments below.\n Everyone and their grandmother wants to be a data scientist. But while data science may be the  sexiest job of the 21 century, that discounts another rewarding and highly paid profession, the software engineer.\n I often get messages from new grads and career changers asking me for advice on getting into data science. I tell them to become a software engineer instead.\n Having experience in both, I’ll try to convince you to become the latter.\n  There’s an order of magnitude more jobs in software engineering compared to data science.\n Below are couple screenshots after googling “ data scientist” and  “software engineer” jobs.\n   Thats  7616 data science jobs compared with  53,8893 software engineering jobs. This is just jobs in the US but other countries showed similar results.\n According to Glassdoor, data scientists make more money, but my untested hypothesis is that data science jobs are also on average more senior.\n   That said, if you’re offered a  $1 million salary at Open AI, I recommend you take it.\n  Management often doesn’t have a consensus on what “data science” means. It’s also possible that given business constraints, they don’t have the luxury of rigidly following a framework of roles.\n This means the responsibilities of a “data scientist” varies a lot from company-to-company.\n  While an ideal spectrum of roles between software engineer to data scientist may exist, it‘s unlikely that it’s followed in reality. This particularly goes for scaling startups still building infrastructure.\n Hired candidates end up working on the problems a company currently needs solved, rather than the “role” they may have been hired for.\n  Anecdotal evidence from colleagues in the field is that many data scientists find themselves writing the backend code like software engineers. I’ve known other “data scientists” who crunched financials in excel.\n This is in stark contrast to what you’d expect if you grew up on Kaggle competitions.\n  Most companies don’t need as many data scientists as software engineers. Other companies are hiring their first data scientist right now.\n For this reason, many data scientists end up working alone, even if they sit at the same table as developers.\n This can make it difficult to get feedback and second opinions. Software engineers either don’t understand predictive modelling, or are too busy working on completely different problems.\n In contrast, one of the perks of being on a software engineering team is being able to say to colleagues, “I think we should implement ABC in XYZ way. What do you think?”.\n  Be prepared for awkward conversations with management regarding why something you spent 2 weeks on cannot be used.\n Working on solved vs un-solved problems is one of the fundamental differences between software development and AI.\n Bugs and constraints aside, you know whether most software engineering projects are possible before beginning any work. The same can’t be said about ML where you don’t know if a model will be effective until after you build it.\n  Even in an era when  every company is an AI company, most don’t have the infrastructure to support it or even need it.\n The Head of Data Science for a rapidly scaling startup recently shared some advice over coffee.\n First you figure out the problem, then you build the infrastructure, then you bring in the data scientists. This is not a quick process. (I paraphrase)\n Another 1st-data-science-hire at a well-known company recently vented to me. She was forced to train AI models on big data on her laptop rather than in the cloud.\n If you’re brought in without specific problems to solve, or the company isn’t prepared for data science, you may find yourself struggling to add value.\n  Becoming a junior software engineer is like getting an MBA in technology. You learn a little bit of everything.\n  You’ll learn to manage building software by watching your scrum leader, senior developer or PM.\n  If you land in a company with an established engineering team, it’s almost guaranteed that you’ll level up your skills quickly and build a generalist background.\n  By providing a more holistic experience with technology, software engineering provides better exit opportunities when you’ve decided it’s time for a change.\n DevOps, Security, Front End, Back End, Distributed Systems, Business Intelligence, Data Engineering, Data Science…\n I’ve know a number of developers who moved from software to data science. If you skim data science job descriptions you’ll immediately notice they’re littered with core software development skills.\n  If you can build end-to-end projects you can also do more than build a model for Kaggle. You can take that model, productionize it, setup authorization and Stripe, then start charging users for access. That’s your own startup.\n I’d never argue that data science isn’t transferrable. Making decisions based on data is a killer skill. But it’s also something that will become more of every job as we become more data driven.\n  As AI becomes commoditized and easier to use, software engineers will begin using it to solve their problems.\n I can teach a developer to build Sklearn classifiers in an afternoon. This doesn’t mean they can build the next AlphaGo, but it does give them an alternative to hard coded conditional logic based on user input.\n Data scientists have specialized knowledge like statistics and an intuition for how models work. But DevOps and Security engineers have their own specialized knowledge as well.\n I’d argue that these are more common than different. A seasoned software professional could move between specialties an order of magnitude faster than a new entrant could pick one up.\n While I don’t think we’ll see a complete merger of data science into software engineering, it does feel like data science could become another software engineering specialty.\n  As silly as it sounds, I got into software engineering in 2014 because I worried AI would render every other job obsolete.\n  Yet since then, the dial barely moved outside specific environments. Technology adoption is slow and AI is narrower than the media would have you believe.\n Compared to other professions, machine learning is even further from automating software engineering. While we have startups building cool products like  AI enabled code completion, writing code isn’t the real job. The job is solving problems using technology.\n  Firstly, this is anecdotal. Secondly, I realize I conflated data scientists, ML engineers and AI researchers. But I think these arguments are still worth considering, given this is your career.\n Don’t take it too seriously. I’d prefer you research and make your own decision. That’s part of being a data scientist after all :).", "posttime": "2020-05-07 06:18:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,数据,data", "title": "不要成为数据科学家", "title_en": "Don’t Become a Data Scientist", "transed": 1, "url": "https://towardsdatascience.com/dont-become-a-data-scientist-ee4769899025", "via": "", "real_tags": ["科学家", "数据", "data"]}, {"category": "", "categoryclass": "", "imagename": "04f150c8a5e748732f8fde30f3d02f39.png", "infoid": 1001026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇博文实际上是一篇将近四千字的文章。当我开始写它的时候，我并不打算这样做。如果我知道会有那么长的时间，我可能会使用不同的风格。但在我写的时候，它就一直在增长。这是因为我认为这是至关重要的，因为我所解决的问题是无法避免的。\n我的意思是，无论我们怎么想或怎么做，我们都在走向最强大的经济崩溃。我们一直视为价值储存的东西-主要是股票以及商业和住宅物业-现在被严重高估了。我们无法阻止它们的价值崩盘，因为过去40年来困扰西方经济体(尤其是美国和英国)的庞氏金融化一直在走向大规模崩盘，现在它已经到来。精灵已经从瓶子里出来了，它不会再回到瓶子里了。\n但这并不是说我们的政府(和其他政府)在面对这一问题时无能为力。他们不是。他们仍然可以决定在即将到来的危机中偏袒哪一种生产要素-劳动力、企业(企业)、银行(资本)或房东。\n如果他们偏袒个人和企业，牺牲房东(他们的资产会存活下来，尽管价值会大大降低)和银行(银行不可避免地需要国有化)，那么更多的人和更多的企业可能会度过即将到来的危机。如果他们偏爱房东和银行-就像英国政府目前的情况一样-那么许多企业存活下来的机会就相当渺茫了。到头来，银行和房东也不会。这是我悲观的预测。无论哪种方式，养老基金和养老金领取者都陷入了深深的困境：大多数现在将依赖于国家，这意味着现在必须考虑比我们之前想象的更慷慨的供应。\n我不喜欢写这篇文章。我并不是说这是一本有趣的书。但事实并非如此。然而，我确实看到了希望。我们的经济受到了金融化的诅咒。我不会选择以它将要发生的方式结束它。但明智的政府将意识到，金融化的结束现在已经迫在眉睫，并采取了相应的行动。\n我希望我能相信我们的政府能做出正确的选择。时间会告诉我们他们是否会这样做。\n2020年5月初，很明显，生活并没有恢复正常。据英国“金融时报”报道，解除封锁的计划包括交错工作时间；要求工作场所和商店保持社交距离的规定；禁止工作场所食堂；要求雇主提供额外的停车场(似乎是一夜之间)，这样员工就不需要共乘电梯上班；减少允许共乘电梯的人数等等，这显然表明，封锁后无论工作是什么样子，都将与之前完全不同。\n政府这么说很容易。而且，这些规定可能会得到执行。但其后果需要深思熟虑，因为它们是令人震惊的。\n当然，从理论上讲，一些公司实际上可以挺过这种工作方式将带来的巨额新成本。但我要强调的是，“理论上”这个词在这句话里做了很多工作。这是因为现实情况是，几乎没有人能够或愿意这样做。我们的经济并不适合以这种方式运作。我所说的装备并不是指身体上的，很明显，我们的适应能力已经相当惊人了。相反，我指的是广义解释的金融杠杆率。\n像许多家庭一样，很多企业都背负着沉重的债务负担。他们既有大量的金融借款，也有大量的租金支付承诺。这是因为他们在许多情况下都资本不足，也没有自己的房产，在这种情况下，租金几乎相当于一笔昂贵贷款的利息，如果他们购买了自己的房产，可能不得不接受这笔贷款的利息。\n重要的是，这些义务目前是固定的。政府可能已经将官方利率降至接近于零的水平，但现实情况是，在实际经济中，情况并非如此。目前，企业偿还贷款的负担、这些贷款的利息和租金可能会在严格有限的期限内受到一些微小的让步，然后只有一些幸运的企业才会这样做，但对许多企业来说，这些义务将会持续下去。到目前为止，还没有迹象表明在这些问题上会提供长期的支持。相反，冠状病毒计划下新的政府支持贷款只会增加这些债务堆积如山。\n这将意味着，在需求将会减少的市场中，效率降低、成本增加的公司将面临巨大的压力。他们的交易活动将不可避免地降低盈利能力，但仍将面临在完全不同的时代和市场创造的固定财务义务，而且相当关键的是，在大多数情况下，这些义务在法律上是不可重新谈判的。\n即使不是一个金融天才也会意识到，这是一种从字面上看是行不通的情况。如果要履行这些财务义务，绝大多数企业现在都无法生存。我们已经在商业街上看到了这种情况，拒绝支付租金正变得司空见惯，但这个问题现在将延伸到全国每一个工业区、写字楼和车间。\n极少数没有借款的企业和他们自己的、付费的、永久保有的房产可能会度过这场危机。此外，在家工作、几乎没有员工的微型企业也可能这样做。但随着即将实施的封锁条件的实施，其他人就不能了。事情就是这么简单。我再直截了当地说：在这种情况下，基于明显的启发式结论的推断的评论既是必要的，也是真实的，这些结论将对情况的分析减少到最基本的本质。\n在这种情况下，如果是政府的计划让我们度过这场危机，那么在未来的经济中，我们必须做出一些相当严峻的决定，这也是事实。在这些问题中，最重要的(一如既往地面对这些情况的现实)是谁的利益应该优先考虑？\n还是企业，意味着保护贸易实体成为核心目标？\n或者，假设这是可以做到的，那么银行业是否会在防止崩盘方面处于领先地位？换句话说，保本了吗？\n回到这个最基本的经济问题上来，哪个生产要素优先？当然，不可避免的是，这个问题确实有隐含的阶级内涵。\n目前看来，很明显，政府正在按照上述清单的相反顺序设定优先事项。\n准确地说，到目前为止，房东并没有被要求做出任何牺牲：他们的利益和收入流似乎几乎毫发无损地幸存了下来。\n另一方面，银行已经受到了它们没有支付的大量支持，而且现在还享受着大量有效的额外贷款资金，它们将从中赚钱。量化宽松也帮助了他们，它又回到了议事日程上。\n商业贷款，尤其是对大公司的贷款正在通过，但作为贷款资本，这些资金只是推迟了即将到来的清算日，因为到目前为止，政府还完全无法区分现金流、流动性和偿付能力，更不用说贷款和资本了。因此，提供了错误的支持，结果是压力越来越大。\n而休假只是掩盖了一个事实，即英国现在可能有600多万人失业。如果把倒闭的个体户也算进去，这个数字可能会高得多。\n我的观点是，这种优先顺序-对于一个为支持不劳而获的财富利益而成立的政党来说是如此自然-现在从根本上被误判了。\n与此同时，我们还需要尽我们所能保留银行业的运营方面，因为我们离不开它：这些系统是经济运行的管道。而且，自2008年以来，我们没有进行过真正的银行改革，这些改革可能会要求整个银行业国有化，但随着房地产市场的崩溃，银行大约85%的贷款账簿所依赖的所有抵押品都会失败。\n不过，我要强调，即使我们担心地产界可能会倒闭，也不能以此作为优先照顾业主利益的理由。他们现在必须站在这堆东西的底部才能得到支持。换句话说，政府把一切都搞错了。\n这是有实际原因的。正如我自这场危机开始以来所说的那样，即使现在每个房东都倒闭了，他们拥有的房产仍将存在：换句话说，即使他们的金融资本消失了，他们的实物资本也不会消失。这意味着，与其他任何事情相比，经济更能在房东倒闭的情况下幸存下来，因为无论这些房产的现任所有者发生什么事情，他们都将仍然存在。我们不能说经济的任何其他部分都是这样的。\n在这种情况下，现在需要的是法定的租金假期。至少今年剩下的时间应该是必需的。此后，租金应该根据法律大幅降低，而且应该是全面的。80%的削减可能是合适的。可能会更多。为了确保企业能够生存，必须做任何必要的事情。\n不过，我要强调，我并不是要消灭食利者：我亦曾辩称，如果在我认为适当的情况下，应实施长期的法定豁免租金期限，然后强制减租，我会将此与享有银行贷款假期的权利，以及法定减低贷款负债的权利相配合，使物业的抵押金额不会超过其市值，不论日后的情况如何。随着时间的推移，为了对所有相关人员都公平，这将不得不接受定期审查。这几乎不是房东不熟悉的概念。食利者资不抵债不是我的目的：减租是为了让企业和人民能够生存下来。\n我要补充一点，由於这样的债务减免计划，单对业主来说是没有意义的，如果不配合为业主自住人士而设的类似计划，我预测他们的房屋价值会在不久的将来暴跌，因为很明显，以最近的价格计算，他们是没有市场的，因此，他们亦必须有法定权利，在按揭贷款上所欠的款额，不得超过其物业的合理市值。这可能会再次受到定期审查，但关键的一点是，抵押贷款利息免税期(在出售时发生)可以用于拖欠超过这笔款项的金额。同样，我的目标很简单：它是让人们呆在家里，并保持偿付能力。\n而且，推迟这些必要的调整也是没有意义的。必须决定自己是否有偿付能力的企业现在必须知道这样的安排。再少也不行。\n法定银行(和其他)贷款延期安排至少两年，现在也必须混合在一起才能生存下去。在此期间，必须允许仅限利息的安排。即使是这样，如果借款人有必要通过这一点，也必须有权将其作为余额的一部分。再说一次，如果政府想让人民和企业生存下去，什么都做不了。\n我很清楚如果我所说的话的含义。没有人需要在这里发帖说‘你对贫穷诚实的房东如此不公平’。我是说，现在这样的上诉毫无价值。因为除非发生这样的事情，否则房东无论如何都会面临灾难。这是因为，重申已经提出的一点，目前英国大多数企业都无法盈利，除非立即从管理费用中扣除主要成本和现金流支出。由于很少有人有资本承受任何重大亏损，现实情况是，除非首先冻结租金，然后再削减租金，再加上银行推迟偿还贷款，否则大多数(我是说，大多数)英国企业将会倒闭。\n在这种情况下，我们今天看到的30%的有效失业率既会成为永久性的，也会增长。这将是不可避免的。我向你保证，无论结果如何，房东和银行都会损失惨重。\n工作和企业必须在救生艇上-银行家和房东必须留在后面。\n因此，回到我的主题，政府面临的主要挑战是选择优先事项。它可以选择房东，然后选择银行作为优先事项，结果将是实体经济几乎完全崩溃，付出灾难性的代价。\n或者，它可以选择人员，然后再选择业务作为优先事项，从而减少欠房东和银行的款项。在这种情况下，随着危机的展开，许多企业可能会幸存下来，因为它们面临的压力将大大减轻。实际上，如果他们能够弥补他们的边际成本，他们可能会处于更好的生存地位，而且许多人会这样做。因此，他们提供的就业机会也将得到保留。但如果租金和银行债务继续存在，这将是不可能的。\n我们的选择似乎是，要么寻求保留目前过度膨胀的房地产价值中隐含的价值和财富的外观，这也是英国所有银行业的基础，要么寻求保持这个国家的谋生能力。这两个选择似乎都是在寻求保持我们目前过高的房地产价值所隐含的价值和财富的外观，这也是英国所有银行业的基础。\n但是，我再怎么强调这一点也不为过，这个选择是虚幻的。实际上，土地隐含的价值已经消失了。假装并非如此是愚蠢的。至今还没有人开始意识到这一点的唯一原因是，我们目前的房地产市场已经完全冻结。事实上，当它重新开放时，价格将会暴跌。新的租金也将如此。我要说的是，老银行必须效仿：如果我们想要一个在未来产生收入的经济体，那么直截了当的事实是，我们现在必须扔掉我们的资产负债表。或者更确切地说，我们必须接受它已经被扔掉了，现在要处理后果。\n那么房东会变成什么样子呢？对于小的，我主张国家支持，就像我对其他失业者的支持一样。我看不出现时这类业主会有甚麽特别的情况，特别是因为我的建议可以保住他们的部分资产价值和收入来源，虽然收入来源已大为减少。\n对于较大的房东来说，建议的安排将大幅降低企业的资产负债表价值。但由于匹配的贷款建议，它并不保证资不抵债。这些房东很可能会生存下来，但市值要小得多，而且他们未来的重点是服务供应，而不是资产积累。在这种情况下，再一次，我看不出有什么特殊待遇的理由。\n因此，真正的问题不是房东的问题，而是银行的问题，没有银行我们就无法生存。85%的英国银行贷款由房地产抵押品支持。无论发生什么(这一点我怎么强调都不为过)，房地产价值很快就会全面崩溃。商业财产可能比私人财产更糟糕，因为工作模式的变化，以及无论发生什么，英国都将遭受商业倒闭的数量，但这将是普遍的。\n因此，银行资产负债表将会崩溃。这只是一个何时的问题，而不是是否的问题。支撑它们的价值已经消失。我们不要假装不是这样。这只会推迟不可避免的计划。\n让我们也清楚一点，银行业无法以目前的形式生存下去。损失比他们拥有的任何资本都要大很多，很多倍。它们在很大程度上也很可能超过这个国家的GDP，而且在某种程度上也是如此。因此，这不是私营部门要处理的问题。这个国家的每一家银行，甚至世界各地的每一家银行，都有可能资不抵债。没有国有化，任何银行都无法生存。而管理损失的唯一方法是通过发行我今天在博客上提到的那种永久债券来消除它们，然后这些债券将受到量化宽松的影响，此后将永远被遗忘。\n我强调这是可以做到的。银行的资产负债表可以重组。这是可能的。但只有那些愿意采取行动的国家，以及那些意识到现在有必要这样做的国家才能这样做。重新安排看起来会很激烈，但它们是可以管理的。\n然而，这将是真正的成本。首先，不可能为所有银行存款提供担保。富人中的一些人会理发(指的是价值被冲销)。\n此外，还应拒绝就无法证明其实益所有权的银行提出的索赔进行和解。而且，如果申报来自避税天堂，无论发生什么，也应该有相当大的减记。\n但最大的减记不会发生在银行业。这些资金将进入养老基金。这才是真正感受到危机的地方。\n我曾多次写过这样的经济愚蠢之处：逐月发送大量现金储蓄到金融资产中，创造显然永无止境的庞氏风格的价值增长，因为当资产存量(股票和商业土地)受到刻意限制时，流入的资金总是超过流出的资金。不可避免的是，有一天，这个体系中有任何价值的伪装将消失，整个大厦将倒塌。那一天已经到来了。\n据推测，目前英国有6万亿英镑的养老金财富。我怀疑其中很大一部分现在将消失。我还强调，如果我建议的事情没有发生，那么几乎所有的资产都可能会消失：如果我建议的做法得到实施，只有银行和土地资产需要消失得无影无踪。在任何一种情况下，减记都将是大规模的，而且肯定会反映在当前和未来老年人的养老金中。\n毫不夸张地说，这是无法避免的。再一次，金融资本主义大厦赖以建立的价值幌子再次破灭：冠状病毒将杀死它。\n那么，为养老金领取者做些什么呢？我恐怕他们会象这麽多直到最近还在工作的人一样，不得不依靠政府：根本没有其他选择。但是，我强调这一点，它不能要求人们沦落到只能依靠国家基本退休金过活：这是一个低得令人难以置信的金额，我们目前支付这笔钱是令人反感的。但对于其他许多人来说，养老金领取者的收入在很多情况下都会下降。他们希望留给下一代的金额可能会崩溃。但是，如果(我必须不断重申，这是一场巨大的灾难)政府现在采取行动保住工作，养老金领取者就有了生存的希望。如果政府不这样做，那么养老金领取者将成为众多其生存风险将面临风险的人之一。\n最后，让我更具前瞻性地总结一下。在这场危机及其造成的冲击波得到处理后，将会有恢复价值的时候。\n这场危机最终将突显的问题是，我们将注意力集中在过去40年来实际上创造的资产负债表财富上。这不是从工作中产生的，也不是从创造实际价值的资源投资中产生的。取而代之的是g。\n..", "note_en": "This blog post is, in effect, an essay of almost four thousand words. I did not intend that when I started to write it. If I had known it would be that long I might have used a different style. But as I wrote it just kept growing. That is because what I think it is about is vital, in the sense that the issues I address cannot be avoided.\n What I am suggesting is that whatever we think or do we are heading for the most almighty economic crash. The things that we have treated as stores of value - which are mainly shares and both commercial and residential property - are massively overvalued now. And there is nothing we can do to prevent the value of them crashing because the Ponzi style financialisation that has gripped western economies - and those of the US and UK in particular - for the last forty years was always heading for a massive crash, and now it has arrived. The genie is out of the bottle and it will not go back in again.\n But that is not to say that our government (and other governments) are left powerless in the face of this. They are not. They can still make a decision about which factor of production - labour, business (enterprise), banks (capital) or landlords they wish to favour in the crisis to come.\n If they favour people and business and sacrifice landlords (whos assets will survive, come what may, albeit at considerably less worth) and banks (which will inevitably need to be nationalised) then more people and many more businesses might make it through the coming crisis. If they favour landlords and banks - as the UK government is at present - then the chance that much business at all will survive this is pretty remote. And in the end, nor will the banks or the landlords either. That&#39;s my bleak prognosis. And either way, pension funds and pensioners are in deep trouble: most will now be dependent on the state, which means much more generous provision has to be thought about now than we have ever previously imagined.\n I didn&#39;t enjoy writing this post. I&#39;m not suggesting it&#39;s a fun read. It is not. And yet, I do see hope. Our economies have been blighted by the curse of financialisation. I would not have chosen to end it the way that it&#39;s going to happen. But wise governments will realise that the end of financialisation is now nigh, and act accordingly.\n   I wish I thought I could rely on our government to make the right choice. Time alone will tell if they will.\n  At the beginning of May 2020 it is very apparent that life is not returning to normal. Plans to end lockdown do, according to the Financial Times, include staggered working hours; rules to require social distancing in the workplace and shops; a ban on workplace canteens; a requirement that employers provide extra car parks (seemingly overnight) so that employees need not share lifts to work; a reduction in the number of people allowed to share lifts and a great deal more that makes it apparent that whatever work might be like after lockdown it will be nothing like what it was before it.\n It is easy for the government to say this. And the rules could, possibly, be enforced. But the consequences need to be thought through, because they are staggering.\n Of course it is theoretically possible that some companies could actually survive the substantial new costs that this way of working will impose. But I stress that the word ‘theoretically’ is doing a lot of work in that sentence. That is because the reality is that in all likelihood almost none can, or will. Our economy is not geared to work in this way. And by geared I do not mean physically, where it is apparent that our capacity for adaptation is already quite phenomenal. Instead I refer to financial gearing, interpreted broadly.\n  Like many households, a great many businesses are massively debt-burdened. They have both significant financial borrowings and / or substantial rent payment commitments.  That is because they are both under-capitalised in many cases and do not own their own properties, with rent in that case pretty much representing interest on an expensive loan that they might have had to take if they were to have bought their property instead.\n Importantly, these obligations are fixed at present. The government might have shrunk official interest rates to near enough zero, but the reality is that in the actual economy that is not the case. The burden on businesses to repay loans, interest on those loans, and rents, might have been subject to some minor concessions for strictly limited periods at present, and then only for some lucky businesses, but for many the obligations will be ongoing.  And there has been not a hint, so far, of long term support on these issues. Instead new government-backed loans under coronavirus schemes will just add to these debt mountains.\n What this will mean is that companies working with reduced efficiency and increased costs in markets where demand will be reduced will be under enormous stress. They will, absolutely inevitably, suffer reduced profitability from their trading activities, but will nonetheless be facing fixed financial obligations created in an entirely different era and market and, quite crucially, legally these obligations are not re-negotiable in most cases.\n It does not take a financial genius to realise that this is a situation that literally cannot work. The vast majority of businesses cannot now survive if they are to meet those financial obligations. We are seeing this on High Streets already, where refusal to pay rents is becoming commonplace, but the problem will now extend to every industrial estate, office block and workshop in the country.\n The tiny minority of businesses with no borrowings and their own, paid for, freehold premises might make it through this crisis. In addition, micro-enterprises working at home and with almost no employees might also do so. But with the lockdown conditions that are going to be imposed, the rest cannot. It will be as simple as that. I cannot be more blunt: on this occasion comments based on the extrapolation of obvious heuristically derived conclusions that reduce analysis of a situation to its barest essentials are both necessary and true.\n  In that case it is also true that in the economy to come some fairly stark decisions have to be made if it is the plan of the government that we survive this crisis. Of these the most important (as ever when the reality of these situations is faced) is whose interests are to be prioritised?\n  Or is it enterprise, meaning that the preservation of trading entities becomes the core goal?\n Alternatively, assuming that this can be done, is banking to be pre-eminent to prevent a crash? In other words, is capital preserved?\n  To go right back to this most basic of economic questions, which factor of production is to have priority? Unavoidably, that question does, of course, have implicit class connotations attached to it.\n Right now it seems quite clear that the government is setting its priorities in the reverse ordering of the above list.\n To be precise, landlords have not really been asked to make any sacrifices to date: their interests and income streams appear to have survived almost unscathed to date.\n Banks on the other hand are already subject to massive support for which they did not pay and are also now enjoying significant effective additional funding for loans from which they will make money. Quantitative easing has also helped them, and it&#39;s back on the agenda.\n Business loans, most especially to larger companies are getting through, but as loan capital those funds simply defer the day of reckoning that is to come because, as yet, the government is quite unable to differentiate cash flow, liquidity and solvency, let alone loans from capital. As such the wrong support is being provided, and the stress is growing as a result.\n And furlough just disguises the fact that more than 6 million people are now likely to be unemployed in the UK. When the self-employed whose businesses have failed are added in it could be much higher.\n My point is that this ranking of priorities - so natural to a political party established to support the interests of unearned wealth - is fundamentally misjudged now.\n    At the same time we also need to preserve the operational aspects of banking, as best we are able, because we cannot survive without it: those systems are the plumbing on which the economy runs. And because we have done no real banking reforms since 2008 that may yet require nationalisation of the whole banking sector fails as the property market collapses, and with it all the collateral on which banks have relied for around 85% of their loan books.\n But I stress, even if we are concerned that the property sector might collapse that is not a reason to priorities the interests of landlords. They have to be at the bottom of the pile for support right now. In other words, the government has everything the wrong way round.\n  There are practical reasons for this. As I have said since this crisis began, even if every landlord fails now, the properties that they own will still be there: in other words, even if their financial capital disappears, their physical capital does not. What that means is that the economy can survive the failure of landlords more than it can survive anything else because whatever happens to the current owners of these properties they  will still exist. We cannot say that of any other part of the economy.\n In that case what is required now are statutory rent holidays. The rest of this year should be required, at least. And thereafter rents should be reduced, drastically, and by law, and right across the board. Eighty per cent cuts may be appropriate. It may be more. Whatever is necessary to ensure business can survive must be done.\n I stress though that I am not seeking to wipe out the rentier: I have also argued, and repeat that argument now, that if, as I think appropriate, there should be long-term statutorily enforced rent holidays and then mandatory rent reductions I would match that with a right to bank loan holidays, and a right to a statutory reduction in loan liabilities so that the sum secured on a property cannot exceed its market value, whatever that might be in the future. To be fair over time to all involved, this would have to be subject to periodic reviews. This is hardly a concept landlords are unfamiliar with. Rentier insolvency is not my aim: rent reduction is so that businesses and people might survive.\n I should add that because such a programme of liability reduction would make no sense for landlords alone if not matched by a similar scheme for owner-occupiers, who I predict will see the value of their houses crash in the near future as it becomes apparent that there is no market for them at anything like recent prices, then they too must have a statutory right to owe no more on a mortgage than can reasonably exceed the market worth of their property. This might again be subject to periodic review, but the key point is that mortgage interest holidays (with waiver happening on sale) could be made available on sums owing in excess of this sum. Again, my aim is simply: it is to keep people in their homes, and solvent.\n And there is no point putting off these essential adjustments. Businesses that must decide if they are solvent or not must know about such arrangements now. Nothing less will do.\n  Statutory bank (and other) loan deferral arrangements of two years, at least, have also to now be in the mix for survival now. Interest only arrangements must be allowed in the meantime. And even that must be subject to the right to roll it up as part of the balance if it is necessary for the borrower to get through this. Again, nothing less will do if the government wants people and business to survive.\n I am well aware if the implications of what I am saying. No one need post here and say ‘you’re being so unfair to poor, honest landlords’. I am saying that such appeals count for nothing now. That is because unless something like this happens then landlords are going to face a disaster in any case. That is because, to reiterate a point already made, right now most businesses in the UK cannot be profitable unless major costs and cash flow outgoings are immediately removed from their overheads. And since very few have the capital to survive any significant losses the reality is that unless rents are firstly frozen and then cut, alongside bank loan payment deferrals, then most (and I mean, the majority) of UK businesses are going to fail.\n In that case the 30% effective unemployment that we see today is both going to become permanent, and grow. That would be unavoidable. And I promise you, landlords and banks are both going to lose heavily, come what may whatever happens as a result.\n Jobs and businesses have to be in the lifeboat – bankers and landlords have tp be left behind\n So, to return to my theme, the essential challenge facing government is to choose priorities. It can choose landlords and then banks as the priority and the result will be the real economy will almost completely fail, at catastrophic cost.\n Or it can choose people and then business as the priority instead and as a result reduce the payments due to landlords and banks. In that case a great many businesses might survive the crisis as it unfolds, because the pressure on them will be greatly reduced. Effectively, if they could then just cover their marginal costs they might be in a vastly better position to survive, and many will. As a result the jobs that they provide will also be retained.  But that will be impossible if rent and bank obligations continue.\n The choice appears to be between seeking to preserve the appearance of value and wealth that is implicit in our overinflated property values at present, which also underpin all UK banking, or seeking to preserve the ability of this country to make a living.\n But, and I cannot stress the point enough, the choice is illusory. In reality, the value implicit in land has already disappeared. It is folly to pretend otherwise. The only reason no one has yet begun to realise this is that we have a completely frozen property market at present. When that reopens prices will, as a matter of fact, tumble. And so too will new rents. All I am saying is that old ones have to follow suit: if we want an economy that generates income in the future then the blunt fact is that we now have to trash our balance sheet. Or rather, we have to accept that it has already been trashed and now deal with the consequences.\n  So what will become of landlords? For small ones, I have argued for state support, just as I have other unemployed people. I can see no special case that might be made for such landlords now, especially since what I suggest will preserve some of their asset value, and an income stream, albeit a much reduced one.\n For larger landlords, the suggested arrangement will massively reduce the balance sheet value of the enterprise. But because of the matching loan suggestions it does not guarantee insolvency. It is very likely that these landlords will survive, but with vastly smaller market worth, and with their focus in the future being upon service supply, rather than asset accumulation. In that case, again, I see little reason for special treatment.\n  The real issue is, then, not for landlords but for banking, without which we cannot survive. 85% of UK bank loans are supported by property collateral. Whatever happens (and I cannot stress this enough) property values are going to collapse across the board very soon. It may be worse for business property than private property because of changes in work patterns and the number of business failures that the UK is going to suffer come what may, but it is going to be universal.\n And so bank balance sheets are going to collapse. It’s just a case of when, and not if. The value that underpinned them has gone. Let’s not pretend otherwise. That just puts off planning for the inevitable.\n Let&#39;s also be clear that banking cannot survive this in its current form. The losses are many, many times greater than any capital that they possess. They are greater too than GDP of the country in all likelihood, and by some way. This is not, then, a matter for the private sector to deal with. Every single bank in this country, and across the world in all likelihood, will be insolvent. No bank will survive without nationalisation. And the only way the losses can be managed is by wiping them out by the issue of perpetual bonds of the type that I have referred to on the blog today, which will then be subject to QE and thereafter be forgotten forever.\n I stress that can be done. The balance sheets of the banks can be restructured. That is possible. But only by states willing to act, and who appreciate the need to do so now. The rearrangements will look to be drastic, but they can be managed.\n There will, however, be real costs. First, it will not be possible to guarantee all bank deposits. Some amongst the wealthy will take a haircut (which refers to a writing off of value).\n There should also be a refusal to settle claims against banks where the beneficial ownership it  arises from cannot be proven. And if the claim is from a tax haven there should also be a considerable haircut, come what may.\n  But it is not in banking where the biggest haircuts will occur. Those will be in pension funds. This is where the crisis will really be felt.\n I have written, many times, on the economic stupidity of sending vast sums of cash to be saved in financial assets, month in and month out, creating an apparently never ending Ponzi style growth in value because the money coming in always exceeded the money going out when the stock of assets (shares and commercial land) is deliberately constrained. It was inevitable that one day the pretence that there was any value in this system would disappear, and the whole edifice would collapse. That day has arrived.\n There is, supposedly,  £6 trillion of pension wealth in the UK at present. I suspect that a very great deal of that will now disappear. I also stress that if what I suggest does not happen then it is likely that almost all of it will disappear: only the bank and land based assets need vanish into thin air if what I suggest is done. In either case, the haircut is going to be massive and is bound to be reflected in the pensions of current and future old people.\n There is, quite literally, no way to avoid this. Yet again, the pretence of value on which the whole edifice financial capitalism has been built has been shattered: coronavirus will have killed it.\n So what to do for pensioners? I am afraid that they, like so many who have until recently been in work, will have to fall back on the state: there is simply no alternative.  But, and I stress this, it cannot require that people be reduced to living on the basic state pension: that is an impossibly low sum which it is repugnant that we pay at present. But as for so many others, incomes of pensioners will fall in a great many cases. And the sums that they hoped to leave to next generations may collapse. But if (and I have to keep repeating that this is a massive &#39;if&#39;) the government acts to preserve jobs now pensioners have a hope of surviving. If the government does not act in that way pensioners will then be amongst the many whose literal risk of survival will be at risk.\n  Finally, let me be a little more forward looking to conclude. There will be a time to restore value after this crisis and the shockwaves it creates are dealt with.\n The problem that this crisis will have eventually highlighted is the fact that we have focused our attention on what has, in effect, been the creation of balance sheet wealth during the course of the last 40 years. This has not been generated from work, or from the investment of resources in the creation of real value. It has instead been g\n......", "posttime": "2020-05-07 06:04:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "优先,decide,银行", "title": "人和工作？还是财富？政府必须决定优先考虑哪一个", "title_en": "People and jobs? Or wealth? The government has to decide which to prioritise", "transed": 1, "url": "https://www.taxresearch.org.uk/Blog/2020/05/05/people-and-jobs-or-wealth-the-government-has-to-decide-which-to-prioritise-and-there-is-only-one-right-answer/", "via": "", "real_tags": ["优先", "decide", "银行"]}]