[{"category": "", "categoryclass": "", "imagename": "b2b077dcfce8d6d026abcba0d2aa42c6.jpg", "infoid": 1067704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在电影中，我在专利骗局中有一些细节造成了专利拖曲。\n 今天我将简要介绍一下这个主题的巨魔现在由巨魔练习：版权拖钓！\n 例如，版权拖钓的一个例子可以在房屋的平面图上取出数千个版权。 （“噢！这个有一个带卧室的起居室！这个厨房毗邻一个餐厅！这个窗户在前门有一个窗户，所以人们可以看到它！”）\n 然后，一旦你的版权保护了几千楼计划，你就可以自由地向施工公司发送出来（现在他们可能会被使用！）...然后开始拖息互联网，寻找实际使用一些变化的人你发出的模糊计划......并起诉他们偷你的想法！轻松的钱：只是勾勒出几千楼的计划，你认为房子可能看起来像，发送'em out，然后开始提交诉讼，如果有人建造一个靠近你勾勒的房子！\n  让我们看一家名为Design基础知识的公司。 （https://www.designbasics.com，https://www.facebook.com/designbasics）\n   “以妇女为中心的”平面图......其中748个......“CORTER”......这是一个厨房连接到餐厅！\n “Shelton Farm”......这是一个厨房连接到餐厅！ \n“crandall”... oooo！这款厨房配有连接到一间用餐室！谁能想到这一点？\n 此列表继续和开启。这些落地计划模糊不清，因为它们不是建筑设计！只有这些计划实际上没有人能够建造房子！他们只是基本的楼层计划，任何人都可以在餐巾纸上梦想和素描！\n 所以，一旦设计基础梦想着几千个模糊和简单的楼层计划......他们在他们的网站上发布它们，并将其送到大规模邮寄到国家自主交会协会。\n 现在，用这些简单，模糊的落地计划（不是完整的架构图纸！）在那里为每个人看......他们寻找有人实际建立一个有类似布局的房子，然后跳上诉讼！\n  这些案件中的每一个都代表了无数的小时和美元，即人们被迫花钱捍卫他们使用共同和明显的楼层计划......或面对摘要判断，并被迫将资金交给版权巨魔。想象一下，运行一个企业，他们的目标是从人们提取资金，破坏他们的业务和生活，基于这种脆弱的工作，因为模糊的地板计划草图。\n  事实证明Patrick Carmichael和Myles Sherman购买的设计基础作为“投资”，现在正在使用诉讼作为其核心商业模式（http://media.ca7.uscourts.gov/cgi-bin/rssexec.pl?submit=显示＆amp; PATH = Y2021 / D04-23 / C：19-2716：J：Sykes：AUT：T：FNOP：N：2694335：S：0 Page 4）。 2014年，在Paul Everesman，为设计基础工作，用主题线为主题线为主题线为“礼物”......“礼物”成为某人可能建造了一个与设计基础设计基础梦想的计划之一的房屋向上。\n 请记住，在美国，我们不允许申请利润：诉讼旨在收回对某人所做的赔偿金......不是作为“礼物”，如获奖彩票。 \n我曾经相信，虽然专利（你声称拥有整个想法）是非感性的，但版权应该是安全的这种行为，因为他们保护实际的特定工作......但正如我们在这样的情况下看到的那样， 甚至版权甚至可以用一个借口拖钓......你只需要画一些容易而显而易见的东西，任何人都可以梦想......然后向自己索取那个简单的绘画的所有权！  我是一个令人惊讶的是，设计基础（https://www.designbasics.com，https://www.facebook.com/designbasics）仍在业务中......我认为转到他们网站的人只是不完全理解 他们实际上正在与那里交易谁。 ", "note_en": "I’ve covered Patent Trolling in some detail in the movie The Patent Scam.\n Today I’ll briefly go over a variation on this theme being practiced by trolls now: Copyright Trolling!\n One example of Copyright Trolling could be, for example, taking out thousands of copyrights on the floor plans of houses. (“Ooo! This one has a living room connected to bedrooms! This one has a kitchen next to a dining room! This one has a window in the front door so people can see though it!”)\n Then, once you’ve copyrighted a few thousand floor plans, you freely send out them out to construction companies (now they’re likely to be used!)… and then start trolling the internet, looking for anyone that has actually used some variation of the vague plans you sent out.. and sue them for stealing your idea! Easy money: Just sketch out a few thousand floor plans of what you think a house might look like, send ‘em out, and then start filing the lawsuits if anyone builds a house close to what you sketched!\n  Let’s look at a company called Design Basics. (  https://www.designbasics.com ,  https://www.facebook.com/DesignBasics )\n   “Women-centric” floor plans… 748 of them… the “ Cotter”… this one has a kitchen connected to a dining room!\n The “ Shelton Farm”… this one   has a kitchen connected to a dining room!\n The “ Crandall”… Oooo! This one has a kitchen connected to a dining room! Who could have thought of that?\n And this list goes on, and on, and on. These floor-plans are vague because they’re NOT architectural designs! Nobody could actually BUILD a house with just these plans! They’re just basic floor plans that anyone could dream up and sketch on a napkin!\n So, once Design Basics has dreamed up a few THOUSAND vague and simple floor plans… they post them at their web site, and send them in mass mailings to the National Association of Homebuilders.\n Now, with these simple, vague floor-plans (not full architectural drawings!) out there for everyone to see… they look for someone to actually build a house that has a similar layout, and then jump in with the lawsuit!\n  Each of these cases represents countless hours and dollars that people have been forced to spend to defend their right to use a common and obvious floor plan… or face summary judgement and be forced to turn over money to a copyright troll. Imagine running a business whose goal is extract money from people, ruining their business and lives, based on such flimsy work as vague floor-plan sketches.\n  As it turns out Patrick Carmichael and Myles Sherman purchased Design Basics as an ‘investment’ and are now using lawsuits as their core business model (  http://media.ca7.uscourts.gov/cgi-bin/rssExec.pl?Submit=Display&amp;Path=Y2021/D04-23/C:19-2716:J:Sykes:aut:T:fnOp:N:2694335:S:0 page 4). In 2014 Paul Foresman, working for Design Basics, emailed Patrick Carmichael with the subject line “A gift for you”… the “gift” being that someone had perhaps built a house with a floor plan similar to one of the plans that Design Basics dreamed up.\n Remember, in the United States, we are not allowed to sue for PROFIT: A lawsuit is designed to  recoup damages that have been done to a person… not act as a “gift”, like a winning lottery ticket.\n   I used to believe that while PATENTS (where you claim to own AN ENTIRE IDEA) were non-sensical, but COPYRIGHTS should be safe from this type of behavior, since they protect an ACTUAL SPECIFIC WORK… but as we see in cases like this, even copyrights can be used an an excuse for trolling… you just need to draw something that is easy and obvious enough that anyone could dream up… and then claim ownership of that simple drawing for yourself!\n What amazes me is that Design Basics (  https://www.designbasics.com ,  https://www.facebook.com/DesignBasics ) is still in business… I think the people that go to their site just don’t fully understand who they are actually dealing with there.", "posttime": "2021-06-23 22:03:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拖车,trolling,计划", "title": "专利拖车的双胞胎：版权拖钓 ", "title_en": "Patent Trolling’s twin: Copyright trolling", "transed": 1, "url": "https://austinmeyer.com/now-copyright-trolling/", "via": "", "real_tags": ["拖车", "trolling", "计划"]}, {"category": "", "categoryclass": "", "imagename": "f115ff9b79aa70a38c9a3874ff72df8e.jpeg", "infoid": 1067702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄罗斯军舰周三的俄罗斯军舰被解雇警告射击和战线炸弹炸弹队在俄罗斯国防部说，在黑海附近的克里米亚附近的海域中，声称这些水域属于俄罗斯。\n  这一事件是自冷战以来的第一次，莫斯科使用了现场弹药来阻止北约军舰，反映俄罗斯与西方之间的飙升。\n  该部表示，俄罗斯军舰发射警告镜头后，英国导弹驱逐舰后卫忽略了俄罗斯领海侵入的通知。它说，俄罗斯SU-24轰炸机在英国船之前还落下了炸弹，说服它改变课程。\n  U.K.国防部在推文中回复，声称皇家海军船舶在乌克兰水域依照国际法。\n    俄罗斯在2014年吞并了乌克兰的克里米亚半岛，这是世界上大多数国家都无法承认的举动。俄罗斯经常在克里米亚附近的北约军舰活动中烹调，铸造它们是不稳定的。\n    北约成员土耳其，希腊，罗马尼亚和保加利亚都在黑海上，但美国，U.K.和其他北约盟国的战舰也在对乌克兰的支持表现日益频繁访问。\n    西部领导人在上周的G-7和北约峰会期间批评了俄罗斯，以获得其侵略性行为和人权滥用。 \n周三莫斯科国际安全会议由该国的国防部经营，由长期驻军牧师塞吉·索··索··索··索··索··牧师发表讲话。  Shoigu表示，俄罗斯面临着西方越来越多的威胁，美国轰炸机在俄罗斯边境附近飞行，北约的北约军舰和北约的越来越大的练习。 经济学家杂志周三报道，俄罗斯从其轨道上寻求窥探白俄罗斯，并将乌克兰更接近北约。 ", "note_en": "A Russian warship fired warning shots and a warplane dropped bombs Wednesday to force a British destroyer from waters near Crimea in the Black Sea, the Russian Defense Ministry said, claiming those waters belonged to Russia.\n  The incident marked the first time since the Cold War that Moscow used live ammunition to deter a NATO warship, reflecting soaring tensions between Russia and the West.\n  The ministry said the Russian warship fired warning shots after the British missile destroyer Defender ignored a notice against intrusion in Russia’s territorial waters. It said that a Russian Su-24 bomber also dropped bombs ahead of the British ship to persuade it to change course.\n  The U.K. Ministry of Defense responded in a tweet, claiming the Royal Navy ship was in Ukrainian waters in accordance with international law.\n    Russia  annexed Ukraine’s Crimean Peninsula in 2014, a move that was not recognized by most countries in the world. Russia has frequently chafed at NATO warship activity near Crimea, casting them as destabilizing.\n    NATO members Turkey, Greece, Romania and Bulgaria all are on the Black Sea, but warships from the U.S., U.K. and other NATO allies also have made increasingly frequent visits in a show of support to Ukraine.\n    Western leaders criticized Russia during the G-7 and NATO summits last week for its aggressive behavior and human-rights abuses.\n  On Wednesday the Moscow Conference on International Security, run by the country’s defense ministry, opened with a speech by Sergei Shoigu, the long-standing defense minister.\n  Shoigu has said it is Russia that faces a growing threat from the West, with American bombers flying near Russia’s borders, NATO warships in the Black Sea and ever-larger exercises by NATO. Russia is of the view that the West is seeking to pry Belarus from its orbit and draw Ukraine closer to NATO, the  Economist magazine reported Wednesday.", "posttime": "2021-06-23 22:02:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,警告,warning", "title": "俄罗斯在克里米亚附近的黑海水域中发射警告射击。克里米亚附近的黑海水域 ", "title_en": "Russia fires warning shots at U.K. warship in Black Sea waters near Crimea", "transed": 1, "url": "https://www.marketwatch.com/story/russian-ship-fires-warning-shots-at-uk-warship-in-black-sea-01624448797", "via": "", "real_tags": ["俄罗斯", "警告", "warning"]}, {"category": "", "categoryclass": "", "imagename": "80014bc0afc44b9f3bbeeb052cfc7d53.jpeg", "infoid": 1067701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄罗斯军舰周三的俄罗斯军舰被解雇警告射击和战线炸弹炸弹队在俄罗斯国防部说，在黑海附近的克里米亚附近的海域中，声称这些水域属于俄罗斯。\n  事件标志着自莫斯科使用现场弹药来阻止北约军舰，反映俄罗斯 - 西方紧张局势飙升。\n  该部表示，俄罗斯军舰发射警告镜头后，英国导弹驱逐舰后卫忽视了俄罗斯领土水域入侵的通知。它说，俄罗斯SU-24轰炸机在英国船之前还落下了炸弹，说服它改变课程。\n  U.K.国防部在推文中回复，声称皇家海军船舶在乌克兰水域依照国际法。\n  俄罗斯在2014年吞并了乌克兰的克里米亚半岛，这是世界上大多数国家都无法承认的举动。俄罗斯经常在米西亚附近的北约战舰访问，铸造它们是不稳定的。\n  北约成员土耳其，希腊，罗马尼亚和保加利亚都在黑海上，但美国，U.K.和其他北约盟国的战舰也在对乌克兰的支持表现日益频繁访问。\n  西部领导人上周在G7和北约峰会期间批评了俄罗斯，以其积极的行为和人权侵犯。周三莫斯科国际安全会议由该国的国防部经营，由长期驻军牧师塞吉·索··索··索··索··索··牧师发表讲话。 \nShoigu认为是俄罗斯面临着西方越来越多的威胁，美国轰炸机在俄罗斯边界附近飞行，北约战舰在黑海和北约的越来越大的练习。 经济学家杂志周三报道，俄罗斯认为西方正在寻求比白俄罗斯奖，并将乌克兰更接近北约。  如果您通过本文中的推荐链接购买某些内容，可以赔偿微软和合作伙伴。  在新窗口中打开打开外部站点在新窗口中打开外部站点 ", "note_en": "A Russian warship fired warning shots and a warplane dropped bombs Wednesday to force a British destroyer from waters near Crimea in the Black Sea, the Russian Defense Ministry said, claiming those waters belonged to Russia.\n  The incident marked the first time since the Cold War when Moscow used live ammunition to deter a NATO warship, reflecting soaring Russia-West tensions.\n  The ministry said the Russian warship fired warning shots after the British missile destroyer Defender had ignored a notice against intrusion in Russia’s territorial waters. It said that a Russian Su-24 bomber also dropped bombs ahead of the British ship to persuade it to change course.\n  The U.K. Ministry of Defense responded in a tweet, claiming the Royal Navy ship was in Ukrainian waters in accordance with international law.\n  Russia annexed Ukraine’s Crimean Peninsula in 2014, a move that was not recognized by most countries in the world. Russia has frequently chafed at NATO warships visits near Crimea, casting them as destabilizing.\n  NATO members Turkey, Greece, Romania and Bulgaria all are on the Black Sea, but warships from the U.S., U.K. and other NATO allies also have made increasingly frequent visits in a show of support to Ukraine.\n  Western leaders criticised Russia during the G7 and NATO summits last week for its aggressive behaviour and human-rights abuses. On Wednesday the Moscow Conference on International Security, run by the country’s defence ministry, opened with a speech by Sergei Shoigu, the long-standing defence minister.\n Shoigu believes it is Russia that faces a growing threat from the West, with American bombers flying near Russian borders, NATO warships in the Black Sea and ever-larger exercises by NATO. Russia believes that the West is seeking to prise Belarus from its orbit and draw Ukraine closer to NATO, the  Economist magazine reported Wednesday.\n  Microsoft and partners may be compensated if you purchase something through recommended links in this article.\n                Opens in a new window  Opens an external site  Opens an external site in a new window", "posttime": "2021-06-23 22:02:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,警告,ship", "title": "俄罗斯船在黑海的英国军舰发射警告射击 ", "title_en": "Russian ship fires warning shots at UK warship in Black Sea", "transed": 1, "url": "https://www.msn.com/en-us/news/world/russian-ship-fires-warning-shots-at-uk-warship-in-black-sea/ar-AALlGq8", "via": "", "real_tags": ["俄罗斯", "警告", "ship"]}, {"category": "", "categoryclass": "", "imagename": "e1348b18e921d94cb6f08a5f4df3f0a7.jpeg", "infoid": 1067700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "假冒软件包从官方Python存储库下载大约5,000次包含的密码，该代码安装了在受感染的机器上安装了加密软件，这是一个安全研究员。\n 在PYPI存储库中可用的恶意软件包，在许多情况下，使用安全公司Sonatype的研究员已经使用了类似于那里的合法性和经常广泛使用的包装的名称。所谓的键入攻击当目标意外地错误地键入键入“mplatlib”或“maratlib”而不是合法和流行的包matplotlib时成功。\n Sharma表示，他发现了六个包装安装了加密软件，这些软件将使用受感染的计算机的资源来挖掘加密和存放在攻击者的钱包中。所有六人都由使用PYPI USERNAME Nedog123的某人发布，在某些情况下，在某些情况下，于4月份。包和下载号码是：\n     恶意代码包含在每个包中的每个包的setup.py文件中。它导致感染的计算机使用UBQminer或T-Rex Cryptominer来挖掘数字硬币并将其存放在以下地址：0x510AEC7F266557B71B13EB31B57。\n  自2016年大学生欺骗了17,000名编码者运行他发布的速写脚本以来，PYPI一直是频繁滥用的存储库。不是那个PyPi被滥用，而不是其他存储库。去年，软件包从RubyGems安装了数千次，安装了试图拦截比特币付款的恶意软件。两年前，有人回到了NPM中托管了200亿用户代码库。 Sonatpe自2019年以来追踪了超过12,000个恶意NPM软件包。\n 它诱人觉得认为在这些事件中计算的公平数量是自动完成的，从未导致计算机被感染，但大学生＆＃39;在上面相关的实验否则。他的假冒Python模块在超过17,000个单独的域名，一些属于美国政府和军事组织的域名。这种滥交从来都不是一个好主意，但应该严格禁止前进。 ", "note_en": "Counterfeit packages downloaded roughly 5,000 times from the official Python repository contained secret code that installed cryptomining software on infected machines, a security researcher has found.\n The malicious packages, which were available on the PyPI repository, in many cases used names that mimicked those of legitimate and often widely used packages already available there, Ax Sharma, a researcher at security firm Sonatype  reported. So-called typosquatting attacks succeed when targets accidentally mistype a name such as typing “mplatlib” or “maratlib” instead of the legitimate and popular package  matplotlib.\n Sharma said he found six packages that installed cryptomining software that would use the resources of infected computers to mine cryptocurrency and deposit it in the attacker’s wallet. All six were published by someone using the PyPI username  nedog123, in some cases as early as April. The packages and download numbers are:\n     The malicious code is contained in the setup.py file of each of these packages. It causes infected computers to use either the  ubqminer or  T-Rex cryptominer to mine digital coin and deposit it in the following address:  0x510aec7f266557b7de753231820571b13eb31b57.\n  PyPI  has been a  frequently abused  repository since 2016 when a college student tricked 17,000 coders into running the sketchy script he posted there. Not that PyPI is abused any more than other repositories are. Last year, packages downloaded thousands of times from  RubyGems installed malware that attempted to intercept Bitcoin payments. Two years before that, someone backdoored a 2-million-user code library hosted in NPM. Sonatpe has  tracked more than 12,000 malicious NPM packages since 2019.\n It&#39;s tempting to think that a fair number of the downloads counted in these events were done automatically and never resulted in computers getting infected, but the college student&#39;s experiment linked above argues otherwise. His counterfeit Python module was executed more than 45,000 times on more than 17,000 separate domains, some belonging to US governmental and military organizations. This kind of promiscuity was never a good idea, but it should be strictly forbidden going forward.", "posttime": "2021-06-23 21:25:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "repos,malice", "title": "Ahoy，在你的repos-pypi中有恶意是最被滥用的 ", "title_en": "Ahoy, there’s malice in your repos—PyPI is the latest to be abused", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/counterfeit-pypi-packages-with-5000-downloads-installed-cryptominers/", "via": "", "real_tags": ["repos", "malice"]}, {"category": "", "categoryclass": "", "imagename": "56fddda511409f8e405ad9addd9a8e24.jpeg", "infoid": 1067699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿姆斯特丹（AP） - 伦勃朗梵江最大的绘画之一刚刚变得更大。 艺术和人工智能的婚姻使阿姆斯特丹的RIJKSMuseum凭据重新创建了雷姆朗特70年后剪掉了70年的标志性的“夜间观察”的部分。 ", "note_en": "AMSTERDAM (AP) — One of Rembrandt van Rijn's biggest paintings just got a bit bigger. A marriage of art and artificial intelligence has enabled Amsterdam's Rijksmuseum to recreate parts of the iconic “Night Watch” painting that were snipped off 70 years after Rembrandt finished it. ", "posttime": "2021-06-23 21:24:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "观察,huge,阿姆斯特丹", "title": "Rembrandt的巨大的“夜间观察”感谢AI变得更大 ", "title_en": "Rembrandt's huge 'Night Watch' gets bigger thanks to AI", "transed": 1, "url": "https://apnews.com/article/europe-lifestyle-travel-technology-arts-and-entertainment-d9312050e505c720b8870f0ad0608609", "via": "", "real_tags": ["观察", "huge", "阿姆斯特丹"]}]