[{"category": "", "categoryclass": "", "imagename": "b7b9042bed0a5bb8c816bc80edfa6d8d.jpg", "infoid": 1034250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这里的总体目标显然是通过投资于能够建设必要基础设施的广泛公司，帮助启动企业以及消费者的5G使用案例。\n高通(Qualcomm)高级副总裁、高通风险投资(Qualcomm Ventures)全球主管奎恩·李(Quinn Li)告诉我：“我们在全球投资无线移动生态系统，目标是扩大我们的客户和合作伙伴基础-而我们特别兴奋的领域之一就是5G领域，”高通风险投资公司(Qualcomm Ventures)高级副总裁兼全球主管奎恩·李(Quinn Li)告诉我。“在5G范围内，我们希望投资的领域有三个：一是在用例方面，二是在网络改造方面，三是在企业中应用5G技术。”\n到目前为止，高通风险投资公司已经在5G生态系统中投资了超过1.7亿美元，包括这一批。不过，该公司没有透露对这四家新创业公司的投资金额。\n总体而言，这组新公司触及了高通风险投资公司正在关注的核心领域，李解释说。例如，Celona的目标是让企业能够像今天部署Wi-Fi一样轻松地部署私有蜂窝基础设施。\n李解释说：“他们用基于云的控制器构建了这个平台，该控制器利用可用的频谱-CBRS-能够将蜂窝技术，无论是LTE还是5G，带入企业。”“这些企业的使用案例可能是在制造业环境中，可能是在学校，可能是在医院，也可能是在大学的校园里。”\n与此同时，Cellwize帮助实现无线网络的自动化，使其更加灵活和易于管理，这在一定程度上是通过使用机器学习来根据收集的数据调整网络。李告诉我，该基金的主要投资主题之一是无线技术将变得越来越软件化，而Cellwize正好符合这一趋势。不过，这里的潜在客户不一定是个别企业，而是无线和移动运营商。\nAzion和Pensando所在的边缘计算显然也是目前的热门类别，5G在这一领域具有一些明显的优势，因此，高通风险投资公司(Qualcomm Ventures)今天投资Azion和Pensando，将重点放在这些领域可能也就不足为奇了。\n“随着我们的发展，[你会]看到很多计算从云移动到网络边缘，这允许在网络边缘进行处理，这使得低延迟应用可以运行得更快、更高效，”李说。\n自2000年成立以来，高通风险投资公司(Qualcomm Ventures)总共部署了15亿美元，进行了360项投资。该公司投资的一些比较成功的公司包括Zoom、Cloudflare、小米、Cruise Automation和Fitbit等独角兽公司。", "note_en": "The overall goal here is obviously to help jumpstart 5G use cases in the enterprise and — by extension — for consumers by investing in a wide range of companies that can build the necessary infrastructure to enable these.\n “We invest globally in the wireless mobile ecosystem, with a goal of expanding our base of customers and partners — and one of the areas we’re particularly excited about is the area of 5G,”  Quinn Li,   a Senior VP at Qualcomm and the global head of  Qualcomm Ventures, told me. “Within 5G, there are three buckets of areas we look to invest in: one is in use cases, second is in network transformation, third is applying 5G technology in enterprises.”\n  So far,  Qualcomm Ventures   has invested over $170 million in the 5G ecosystem, including this new batch. The firm did not disclose how much it invested in these four new startups, though.\n Overall, this new set of companies touches upon the core areas Qualcomm Ventures is looking at, Li explained. Celona, for example, aims to make it as easy for enterprises to deploy private cellular infrastructure as it is to deploy Wi-Fi today.\n “They built this platform with a cloud-based controller that leverages the available spectrum — CBRS — to be able to take the cellular technology, whether it’s LTE or 5G, into enterprises,” Li explained. “And then these enterprise use cases could be in manufacturing settings could be in schools, could be to be in hospitals, or it could be on campus for universities.”\n Cellwize, meanwhile, helps automate wireless networks to make them more flexible and manageable, in part by using machine learning to tune the network based on the data it collects. One of the main investment theses for this fund, Li told me, is that wireless technology will become increasingly software-defined and Cellwize fits right into this trend. The potential customer here isn’t necessarily an individual enterprise, though, but wireless and mobile operators.\n Edge computing, where Azion and Pensando play, is obviously also a hot category right now and when where 5G has some obvious advantages, so it’s maybe no surprise that Qualcomm Ventures is putting a bit of a focus on these today with its investments in Azion and Pensando.\n “As we move forward, [you will] see a lot of the compute moving from the cloud into the edge of the network, which allows for processing happening at the edge of the network, which allows for low latency applications to run much faster and much more efficiently,” Li said.\n In total, Qualcomm Ventures has deployed $1.5 billion and made 360 investments since its launch in 2000. Some of the more successful companies the firm has invested in include unicorns like Zoom, Cloudflare, Xiaomi, Cruise Automation and Fitbit.", "posttime": "2020-11-10 21:02:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "5g,初创,ventures,投资", "title": "\n高通风投投资四家5G初创企业", "title_en": "\n\t\t\t\tQualcomm Ventures invests in four 5G startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/10/qualcomm-ventures-invests-in-four-5g-startups/", "via": "", "real_tags": ["5g", "初创", "ventures", "投资"]}, {"category": "", "categoryclass": "", "imagename": "c22f60912d5c9312b25e3d75ba97fd61.jpg", "infoid": 1034249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "起泡是大自然让啤酒变得更美味的方式。然而，并不是所有的泡沫都被理解，因为它们似乎并不遵守解释其余大部分的模型。了解这些非典型泡沫非常重要，因为它们经常应用于食品加工和石化行业。因此，有一篇新的论文告诉我们是什么让这些泡沫存活下来，这可能不仅仅是学术上的兴趣。\n当两种不同的液体与一种气体(如空气)混合时，就会形成泡沫和泡沫。但并不是所有的液体混合物都能形成泡沫，不管你打得多狠--我看着你，正在试验的黑巧克力蛋白酥皮。虽然泡沫实际上是一种相当复杂的野兽，但基本的物理原理并不太难。\n泡沫基本上是一组气泡，由薄膜包裹，形成一个自给自足的网络。这些薄膜受到两种相互竞争的力量的影响。由于重力作用，滞留在界面中的液体慢慢排出。这会导致包裹空气的层变薄，这将导致泡沫最终崩溃。但体液流失通常会因为两个因素而减慢(甚至完全阻止)。\n让我们来看一个简单的例子。肥皂和水的混合物可以支撑泡沫。肥皂是一种表面张力很低的表面活性剂，而水是一种表面张力相当高的液体。当包含它们的气泡周围的薄膜变薄时，会导致表面活性剂分子(肥皂)相互排斥，从而扩大薄膜的宽度。这会产生一种毛细作用力，将液体(在本例中为水)拉回到胶片中。\n在某些情况下，界面变薄还会产生表面张力的梯度。基本上，水会排出，留下更高的肥皂浓度。但是肥皂的表面张力较低，所以在肥皂浓度较高和较低的地区，表面张力是不同的。这会把水拖回胶片里。这使得它所包裹的泡沫保持稳定。\n这些解释依赖于表面活性剂，而关于表面活性剂的主要观点是，它们并不真的喜欢与被放入其中的液体混合。表面活性剂分子排列在薄膜的表面，形成一种三明治结构，这是保持泡沫稳定的作用力的关键。\n这使得在酒精混合物中观察到的泡沫变得有点神秘，因为它们会完全混合在一起。更令人费解的是，烷烃(不同重量的油)的混合物根本不会起泡。但是，把像癸烷这样的烷烃和像甲苯这样的环状分子混合在一起，混合物就会起泡。这些液体都不起表面活性剂的作用，那么它们如何支撑泡沫呢？\n一组法国研究人员发现，这仍然取决于液体表面的行为。想象一下：想象一下两种轻质油各占一半的情况。你应该问的问题是，表面的成分是什么？直接而直观的答案是，在50/50的情况下，它应该几乎是一样的。如果真是这样，那么混合物的表面张力应该正好是两种油的表面张力的平均值。\n对于石油来说，情况确实如此。但对于其他混合物(如醇，或甲苯和癸烷)，这两种液体在表面上的比例与体积相比是不同的。起初，这并不重要。但当气泡形成时，液体开始从薄膜中排出。然而，随着薄膜厚度的变化，表面的成分也会发生变化。本质上，一种液体比另一种液体离开表面的速度更快(这是由于表面积与体积比的变化)。这就产生了表面张力的梯度，将液体拉回薄膜中，稳定了泡沫。然而，只有当表面张力随两种液体的体积比呈非线性变化时，才能形成这种梯度。\n值得注意的是，这也意味着，对于这些混合物的薄膜，表面张力(对于任何给定的混合物通常是一个常数)取决于薄膜的厚度。这是我没有预料到的--或者至少在纳米厚的薄膜上我可能预料到了这一点。但这些薄膜只有微米厚。\n我知道我有点忘乎所以，因为我就是喜欢精妙的物理。为什么起泡很重要？嗯，搅拌和起泡是工业过程中必须考虑的因素。工程师可能不得不设定一个稳定时间，或者改变流速来解释泡沫的形成(考虑一下拉啤酒和倒可乐之间的区别)。通过更好地了解泡沫形成和稳定的原因和方式，可以更好地优化这些过程。", "note_en": "Foaming is nature’s way of making beer even more delicious. Yet not all foams are understood because they don’t seem to obey the model that explains most of the rest. Understanding these atypical foams is important, because they often apply in the food-processing and petrochemical industries. So having  a new paper that tells us what allows these foams to survive may be of more than academic interest.\n  Foams and froths form when two different liquids are mixed with a gas such as air. But not all liquid combinations will allow a foam to form, no matter how much hard you beat it—I’m looking at you, experimental dark chocolate meringues. While a foam is actually a rather complex beast, the basic physics is not too difficult.\n A foam is basically a set of air bubbles, enclosed by thin films that form a self-supporting network. The thin films are subject to two competing forces. The liquid trapped in the interface slowly drains away due to gravity. This causes the layer enclosing the air to thin, which will lead to the eventual collapse of the foam. But the loss of fluid is often slowed (or even entirely prevented) by two factors.\n Let&#39;s look at a simple example. A mixture of soap and water will support a foam. Soap is a surfactant with a low surface tension, while water is a liquid with quite a high surface tension. As the film around the air bubble that contains them thins, it can cause surfactant molecules (the soap) to repel each other, expanding the width of the film. This sets up a capillary force that draws liquid (water, in this case) back up into the film.\n In some cases, the thinning of the interface also generates a gradient in surface tension. Essentially, the water drains out, leaving a higher soap concentration. But soap has a lower surface tension, so there is a difference in surface tension between the areas of high and low soap concentration. This drags the water back into the film. That keeps the bubble it encases stable.\n These explanations rely on surfactants, and the main point about surfactants is that they don’t really like to mix with the fluid that they are put in. The surfactant molecules line the surfaces of thin films, creating a kind of sandwich structure that is key to the forces that keep the foam stable.\n  This has made the foam observed in mixtures of alcohols a bit of a mystery, since those will mix thoroughly. Even more baffling, mixtures of alkanes (oils of different weights) will not foam at all. But, mix an alkane like decane with a ringed molecule like toluene and the mixture will foam. None of these liquids act as surfactants, so how do they support a foam?\n A group of French researchers has discovered that it still comes down to how the liquid surface behaves. Picture it like this: imagine a 50/50 mixture of two light oils. The question you should ask is, &#34;What is the composition of the surface?&#34; The immediate and intuitive answer is that it should be almost the same at 50/50. If this is truly the case, then the surface tension of the mixture should be exactly the average of the surface tension of the two oils.\n For oils, that is indeed the case. But for other mixtures (like alcohols, or toluene and decane), the ratio of the two liquids is different on the surface compared to the bulk. Initially, this doesn’t matter. But when bubbles form, the liquids start to drain from the films. However, as the thickness of the film changes, the composition of the surface also changes. Essentially, one liquid leaves the surface faster than the other (this is due to the change in surface area to volume ratio). That creates a gradient in surface tension, which pulls liquid back into the the film, stabilizing the foam. However, this gradient can only form if the surface tension changes nonlinearly with the bulk ratio of the two liquids.\n Remarkably, this also means that, for thin films of these mixtures, the surface tension (normally a constant for any given mixture) depends on the thickness of the film. That is something I would not have expected—or at least I might have expected it for nanometer-thick films. But these films are micrometers thick.\n  I know I get carried away because I just like the nice physics. Why does foaming matter? Well, agitation and foaming are things that have to be taken into account in industrial processes. An engineer may have to build in a settling time or change the rate of a flow to account for foam formation (consider the difference between pulling a beer and pouring a coke). With a better understanding of why and how a foam is formed and stabilized, these processes can be better optimized.", "posttime": "2020-11-10 20:43:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "foam,泡沫", "title": "解释没有肥皂时的泡沫：这是一种张力梯度", "title_en": "Explaining foam in the absence of soap: It’s a tension gradient", "transed": 1, "url": "https://arstechnica.com/science/2020/11/explaining-foam-in-the-absence-of-soap-its-a-tension-gradient/", "via": "", "real_tags": ["foam", "泡沫"]}, {"category": "", "categoryclass": "", "imagename": "709307d1f2897fb08d8df5c1b5da568c.png", "infoid": 1034248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在此之前，Taara和Econet专门在肯尼亚进行了一系列小规模试点，但现在，Taara和Econet准备开始增加高速无线光纤链路，以补充和增强更广泛的Econet服务覆盖范围，首先是从肯尼亚的Liquid Telecom客户开始。TAARA是将宽带网络的覆盖范围扩展到地球上通常没有接入或高速连接的地区的另一种方法，这主要是由于基础设施方面的挑战。\nX的Taara本质上是一根没有电缆的光纤网络电缆-它使用一束窄而不可见的光束在两个终端之间传输数据，跨度可达近12.5英里，同时提供高达20Gbps的传输速度，这意味着它们可以用来连接成千上万的客户或家庭，同时提供足够高的速度来传输高质量的视频。\n塔拉的技术基本上可以用来修补传统光纤网络的缺口，跨越河流或穿越那些使用地下或地上电缆很难或不可能跨越的地形。它们确实需要不间断的视线，所以X将它们安装在高层建筑的顶部，以帮助确保实现这一目标，这也意味着它们最适合堵塞传统网络中的漏洞，而不一定要建造全新的网络。但与Alphabet的Loon平流层气球或SpaceX的Starlink卫星网络等努力相比，启动和运行这一网络并与现有的网络基础设施合作相对容易和廉价。\nX已经在世界各地试用了Taara，但这是一个迹象，表明它正在走向成熟的商业化阶段，很快就会在更多的地方作为现有网络的补充投入使用。", "note_en": "This deployment follows a series of small pilots in  Kenya   specifically, but now Taara and Econet are ready to start adding high-speed wireless optical links to supplement and enhance Econet service reach more broadly, starting with  Liquid Telecom   customers in Kenya. Taara is yet another approach to extending the reach of broadband networks to parts of the Earth that have typically not had access or high-speed connections, due primarily to infrastructure challenges.\n X’s Taara is essentially a fiber optic network cable without the cable – it uses a narrow, invisible beam of light to transmit data between two terminals that can span up to nearly 12.5 miles, while providing transfer speeds up to 20 Gbps, which means they can be used to connect thousands of customers or households while providing speeds high enough for streaming high quality video.\n   Taara’s technology can essentially be used to patch gaps in traditional fiber optic networks, spanning rivers or crossing terrain that would be hard or impossible to span using either under or aboveground cable. They do require unbroken line of sight, so X sets them atop tall structures to help ensure that’s achieved, and it also means they’re best suited to plugging holes in traditional networks, not necessarily building out entirely new ones. But contrasted to efforts like Alphabet’s Loon stratospheric balloons or  SpaceX’s   Starlink satellite-based network, it’s relatively easy and cheap to get this up and running and working with existing network infrastructure.\n X has been piloting Taara in a number of deployments around the world, but this is a sign that it’s maturing towards a commercialization stage that could see it in service as a supplement to existing networks in a lot more places relatively soon.", "posttime": "2020-11-10 20:38:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "非洲,partners,taara", "title": "\nAlphabet的X公司与Econet Group合作在非洲推出Taara无线光束宽带项目", "title_en": "\n\t\t\t\tAlphabet’s X partners with Econet Group to roll out Project Taara wireless light-beam broadband in Africa\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/10/alphabets-x-partners-with-econet-group-to-roll-out-project-taara-wireless-light-beam-broadband-in-africa/", "via": "", "real_tags": ["非洲", "partners", "taara"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无法往返http请求到上游：拨号tcp4 131.252.208.59：80：I/O超时", "note_en": "Unable to round-trip http request to upstream: dial tcp4 131.252.208.59:80: i/o timeout\u0000\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0002\u0001\u0001\u0017\u0011\u0000", "posttime": "2020-11-10 20:32:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,面向,functional,往返", "title": "电子表格：面向大众的函数式编程(2014)", "title_en": "Spreadsheets: Functional Programming for the Masses (2014)", "transed": 1, "url": "http://web.cecs.pdx.edu/~black/S3S/PeytonJones.ppt", "via": "", "real_tags": ["编程", "面向", "往返"]}, {"category": "", "categoryclass": "", "imagename": "0709611487f11e8fdbc8d77840c0ac05.jpg", "infoid": 1034245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "凭借强大的图像，动人的乐谱和诗意的叙述，这部由帕尔·洛伦茨(Pare Lorentz)制作的开创性的新政委托纪录片探索了自然的边界……", "note_en": "With powerful imagery, a moving score, and poetic narration, this pioneering New Deal commissioned documentary, made by Pare Lorentz, explores the natural bount...", "posttime": "2020-11-10 20:32:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "平原,broke,动人", "title": "破平原的犁头[视频](1936年)", "title_en": "The Plow that broke the plains [video] (1936)", "transed": 1, "url": "https://www.youtube.com/watch?v=hzaV5FdZMUQ", "via": "", "real_tags": ["平原", "broke", "动人"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年9月22日第18卷第4期基于SMS的多因素身份验证的挑战，包括蜂窝安全缺陷、SS7漏洞和SIM交换。\n90年代中后期，互联网开始成为家庭PSTN(公共交换电话网)线路忙碌的主要原因。在接下来的十年里，一些在线服务彻底改变了社会与技术的互动。从电子邮件到电子商务的曙光，这些服务越来越多地将人们与技术和互联网联系在一起。\n虽然密码的概念在许多技术学科和领域都很流行，但普通公众对它知之甚少，除了借记卡的个人识别码。是互联网向他们介绍了密码安全的概念。从那时起，人们意识到他们必须记住密码才能访问自己的电子邮件账户、喜爱的电子商务网站等。\n当时，只需要一个密码就可以解锁一个账户，而且密码要求非常宽松。网络安全格局远没有现在这样具有挑战性，特别是在消费者账户安全方面。某些行业也有例外，比如银行业，那里的密码要求稍微严格一些，在成为其他网站的选项之前，主要基于IP地理位置的隐藏形式的双因素身份验证已经被使用。尽管如此，普通消费者通常只需要一个简单的密码就可以访问高度关键的数据存储库，而且相同的密码经常被多个帐户重复使用。\n今天，互联网安全需要更多的关注。《连线》(Wire)的一名科技记者详细描述了黑客的磨难，他没有对自己的电子邮件账户使用双因素身份验证，这就是可能出错的一个很好的例子。多年来，8个电子邮件账户不仅成为高度敏感和隐私数据的大型储存库，而且还成为互联网上数字足迹的单点故障。例如，大多数在线服务允许通过向用户的主电子邮件帐户发送电子邮件来重置密码。因此，如果一个电子邮件账户被攻破，其他许多账户也可能在短时间内被攻破。\n随着安全威胁环境的变化，密码的使用方式及其复杂性要求也发生了变化。虽然许多在线服务并没有真正遵守最佳实践，但人们普遍认为，密码应该非常复杂，以便最大限度地增加其熵，从而大大增加破解密码所需的时间。\n然而，最终，一些科学研究12，29和一幅病毒式的在线卡通30认为，增加密码的复杂性并不是正确的解决方案。密码短语被证明具有更高的熵，并且更容易记忆。另一方面，强制密码轮换，再加上严格的密码复杂性策略，已被证明会导致更弱的密码。此外，作为一个经验法则，现在人们承认，如果密码不存在于任何公开的泄露凭证储存库中，那么它可能不一定需要轮换。10个。\n除了使密码安全但仍可使用和易于记忆这一持续不断的挑战之外，安全行业认识到，在线账户的安全不应该只由你知道的东西(你的密码)来保护。与要求用户拥有某些东西(例如借记卡)和一些用户知道的东西(例如卡的PIN)的银行方法有点类似，在线账户开始支持，在某些情况下还强制使用双因素身份验证。第二个因素必须是用户拥有的东西--显而易见且简单的选择从一开始就很清楚：用户的智能手机。\n启用在线帐户的双因素身份验证对其安全性至关重要。每个人都应该(至少)在自己的电子邮件帐户以及其他存储关键和敏感数据(如信用卡号码)的帐户中启用此功能。加密货币兑换账户通常是网络罪犯的目标，也应该通过多种形式的身份验证来保护。这些帐户所保护的内容的潜在高货币价值使它们成为一个有趣的案例，研究什么可能是第二种身份验证的最佳选择。例如，虽然短信(短消息服务)作为第二种身份验证形式对于某些类型的在线账户来说是一个好主意，但对于那些在在线交易中拥有大量加密货币的人来说却不是最佳选择。3个。\n基于SMS的身份验证令牌是保护在线帐户的流行选项，它们肯定比只使用密码更安全。然而，蜂窝网络安全的历史表明，SMS不是一种安全的通信方法。从流氓基站和黄貂鱼到更复杂的攻击，有许多已知的方法可以窃听和暴力破解短信，无论是本地还是远程。因此，对于存储具有高财务价值的资产(如加密货币)的账户来说，这种方法并不是最可靠的。\n本文提供了一些基于SMS的多因素身份验证的安全挑战：主要是蜂窝安全缺陷、SS7(7号信令系统)协议中的漏洞，以及被称为SIM(订户身份模块)交换的危险的简单而高效的欺诈方法。基于这些见解，读者可以判断他们的在线账户是否应该使用短信令牌。本文不是对多因素身份验证方法的实际分析，也不是对第二种(或第三种、第四种)身份验证方法的实际分析。身份验证因素；对于这样的讨论，作者建议阅读安全专家特洛伊·亨特(Troy Hunt)关于这一主题的报告。9个。\n(全面披露：作者使用短信来保护一些相当普通的在线账户，主要是那些不需要存储信用卡号码或其他敏感金融信息的账户。)。\n对于标准的消费者在线账户，提供第二个身份验证因素的两个主要选择通常是通过短信或利用用户智能手机上的应用程序生成的一次性令牌。后者更安全，应该用于高度安全和敏感的账户，但前者是使用最广泛的选项，在某些情况下可能是一个有效的选择。然而，除了安全性之外，这两种选择在便利性和可用性方面各有不同的优势和劣势，这是设计安全系统时需要考虑的重要因素。图1总结了这两种身份验证的优缺点。\n如本文通篇所述，由用户设备上的应用程序生成的一次性令牌是实现在线帐户双因素身份验证的最安全方式，而不需要消费者使用非标准硬件(例如，RSA令牌、YubiKey等，它们在企业环境中更为常见)。除此之外，还有很多优点和缺点。\n这两种选择的主要考虑因素之一是网络连接。应用程序生成的令牌的便利性(不需要网络连接)与通过SMS接收令牌时需要连接的严格要求形成了鲜明对比。虽然网络连接被认为是一种无处不在的商品，但在许多情况下，用户可能需要在超出范围时访问帐户。\n基于APP的代币交付的另一个优势是，这些APP通常可以注册并使用多个在线账户。然而，使用智能手机应用程序生成令牌的主要可用性挑战是，管理这样的应用程序-以及它所利用的加密材料-需要付出一些额外的努力。一般来说，将智能手机备份到云端是最常见的方法，不会将此类加密材料保存为备份数据的一部分。这些材料也不会保存在计算机上未加密的本地备份中。即使使用密码锁定本地备份，也不是所有种子都与密码一起存储。例如，如果用户的智能手机丢失或被盗，或者即使他们买了一部新手机，这可能会导致用户被锁定在他们的账户之外。在这些情况下，所谓的备份代码非常重要。根据经验，在新的智能手机完全设置好并重置双因素身份验证应用程序之前，用户永远不应该擦除旧手机。\n通过短信接收的双因素身份验证令牌往往适合标准消费者使用，因为它们对用户来说很容易。不需要在用户的设备上安装应用程序，也不需要对备份代码或备份计划进行任何管理来处理丢失或被盗的设备。当用户获得新设备时，不需要重置双因素身份验证系统，因为短信与电话号码捆绑在一起，而电话号码在新设备上通常保持不变。\n缺点是，基于SMS的身份验证需要与蜂窝网络建立活动连接。尽管大多数基于文本消息的通信都是通过IP(如iMessage、WhatsApp等)进行的，但SMS第二要素身份验证令牌通常是通过蜂窝网络标准SMS传递的。因此，仅有Wi-Fi连接是不够的，还需要活动的蜂窝连接。在蜂窝服务参差不齐或不存在或者连接限制在802.11个网络的某些情况下，这可能是具有挑战性的。\n尽管存在安全挑战，基于SMS的身份验证令牌仍是一种广泛使用的选项，目前正得到设备制造商的积极支持。例如，苹果最近在iOS14中宣布了一项新功能，可以强化短信代码，防止应用程序试图诱骗用户在恶意应用程序(https://developer.apple.com/news/?id=z0i801mg).)中输入代码。\n尽管它的便利性和被大量在线服务使用，但通过文本消息进行的双因素身份验证面临着巨大的安全挑战。本部分概述了使用SMS进行双因素身份验证令牌传递的主要安全挑战。这些威胁从一些复杂的威胁到蜂窝网络协议(要求对手在目标受害者附近)，到低挂果技术(尽管技术上简单得多，但没有射程限制，并且可以几乎零成本实施)不一而足。例如，移动通信系统中最大的安全威胁之一是SIM卡交换，这是一个与移动运营商如何在其客户关怀平台中对用户进行身份验证相关的系统性问题。18岁。\n图2总结了三种不同的SMS拦截方法的主要优势和挑战。\n第一代移动网络(1G)缺乏对加密的支持。传统的2G GSM(全球移动通信系统)网络缺乏相互认证，并实施过时的加密算法。结合GSM协议栈的开源实现的广泛可用性，这导致在过去十年中发现了GSM无线链路上的许多可能的漏洞23(如图3所示)。具体地说，部署恶意GSM基站和对GSM连接实施全面MITM(中间人)攻击所需的技术和工具都是商品，尽管它们要求对手在物理上接近给定的目标。可以使用低成本的软件无线电和GSM协议栈的开源实现来拦截移动通信，包括SMS消息。22，24。\n在过去的几年里，研究人员还演示了如何在不那么严格的邻近限制的情况下，通过在回复给另一个用户的寻呼消息时触发竞争条件来拦截SMS流量。6为了对给定的目标受害者进行地理定位以通过SMS拦截令牌，还在传统GSM网络的上下文中调查了隐私和位置泄漏。17.。\n加强3G和LTE(长期演进)移动网络的机密性和认证，在这两个标准中都实施了更强大的加密算法和相互认证。正因为如此，考虑到LTE的相互认证和强大的加密方案，LTE通常被认为是安全的。因此，机密性和认证被错误地认为得到了充分的保障。然而，研究人员在几年前证明，LTE移动网络仍然容易受到协议漏洞、位置泄漏和恶意基站的攻击。14、27\n尽管对用户业务和相互认证有很强的密码保护，但是大量的控制面(信令)消息在LTE无线链路上以明文方式定期交换。在执行连接的认证和加密步骤之前，移动设备与用正确的广播信息宣传其自身的任何LTE基站(真实的或欺诈的)进行实质性的对话。从移动设备的角度来看，这导致了对来自基站的消息的隐含信任所造成的严重威胁。当这些隐式信任的消息中的一些消息触发时，许多具有严重安全隐患的操作都会被执行，这些消息既没有经过身份验证，也没有经过验证。\n在大规模网络攻击的时代，最大的民用通信系统之一必须依赖更复杂的隐私协议，而不仅仅是固定在看起来像合法基站的基站上的基本隐含信任。请注意，这同样适用于相反的情况，基站隐含地信任来自移动设备的所有预认证消息。\n尽管恶意的LTE基站不能发动全面的MITM攻击，但几项研究已经证明了可以悄悄地将现代智能手机降级到易受攻击的GSM连接的技术和原型。13、26、27所有这些技术的共同点是它们利用和滥用这种预认证消息。\n随着该行业准备迎接5G的到来，这类下一代移动网络的安全架构正受到密切关注。过去一年的几项研究强调了这样一个事实，即LTE中的大多数基于预认证消息的协议漏洞仍然适用于5G网络。因此，考虑到这种移动通信系统的当前规范，静默地将智能手机的连接降级到GSM链路仍然是可能的。28通过利用这些漏洞，攻击者可以成功拦截通过SMS传送的双因素身份验证令牌。\n然而，重要的是要注意，通过截取GSM流量来截取SMS消息中的令牌是技术上最复杂的选择。尽管这类攻击可以通过低成本的软件无线电和对开源工具的微小修改来实施，但绝大多数通过拦截通过SMS传递的身份验证令牌进行的欺诈都利用了SS7或SIM交换中的漏洞。\nSS7是30多年前开发的遗留架构和协议。它为PSTN中的许多功能执行带外信令支持，即呼叫建立、计费、路由和信息交换。自1988年移动运营商开始利用它进行带外信令以来，该协议的安全性主要依赖于运营商之间的隐性信任。它被认为是一个封闭的可信网络，并且仅限于没有内置身份验证。因此，该网络和协议的安全功能微乎其微，并且依赖于全球范围内的少数运营商，这些运营商要么是国家控制的，要么是大公司。现在情况不再是这样了，因为由于移动使用量的急剧增加，以及过去十年全球移动虚拟网络运营商(MVNO)数量的增长，运营商的数量要多得多。\n3GPP(第三代合作伙伴计划)在20世纪90年代和21世纪头10年为七号信令增加了两个新协议：MAP(移动应用部分)和CAMEL(移动网络增强逻辑定制应用)。这些服务旨在支持移动网络提供的一些新服务，以及为移动运营商提供的新功能。19除其他功能外，CAMEL还允许实现运营商级增值服务，如欺诈控制和预付费服务。同时，MAP向全球范围内的地理定位设备提供服务，例如anyTimeInterrogation服务和LCS(位置服务)。令人沮丧的是，这些新的SS7子协议都没有添加身份验证或安全功能。\n研究人员已经确定了SS7中的一些关键安全漏洞，这些漏洞可以被利用来对用户进行地理定位，并从几乎任何地方拦截他们的流量。5在某些情况下，唯一的要求是能够接入七号信令网络，尽管现在比过去更加受限，但仍然可以很容易地在暗网上购买。研究人员还通过黑客入侵的毫微微蜂窝获得了接入SS7网络的权限，在某些罕见的情况下，他们实际上是从移动运营商那里购买了接入。\n更糟糕的是，研究人员还通过利用CAMEL协议中的缺陷，展示了远程拦截电话和短信的技术。图4说明了此过程。当一名德国研究人员在黄金时段的电视新闻报道中展示了这些攻击时，移动通信网络中的此类安全威胁引起了公众的广泛关注。1个。\n一旦攻击者访问了SS7网络的入口点，在GSM的情况下，只需要一条消息来修改MSC(移动交换中心)中给定目标的注册。从那一刻起，MSC将转而联系攻击者。\n现代LTE网络在很大程度上将大多数基于SS7的服务迁移到Diameter协议。这个新协议虽然有了一些改进，但仍然存在一些漏洞，其中大部分是从SS7继承而来的缺陷。因此，在LTE中，类似的远程拦截呼叫和文本消息也是可能的。无论如何，正如前面讨论的那样，考虑到距离目标足够近，悄悄地将智能手机降级到安全程度低得多的GSM连接是很简单的。\n利用SS7网络及其协议中的安全漏洞是拦截通过SMS传递的双因素身份验证令牌的一种相当有效的方式。总体而言，这是一种攻击载体，以被黑客组织使用而闻名，而且已经变得如此重要，以至于它甚至被认为是MITRE ATT&amp；CK框架的一部分，该框架已被许多科技公司广泛采用，作为其安全姿态的一部分。20个。\n尽管利用蜂窝网络协议和传统SS7网络中的缺陷的SMS拦截技术是有效的，但SIM交换可以说是针对SMS通信的头号安全威胁，SMS通信被用来传递用于多因素身份验证的一次性令牌。\n如图5所示，SIM卡交换攻击包括欺骗移动运营商(通常是通过与客户服务人员的电话)，使其认为手机订阅的合法所有者需要将帐户移植到新的SIM卡。例如，呼叫者可能声称手机在海外丢失，需要尽快恢复对新购买的手机和新SIM卡的访问。这样一个故事的可信度实际上并不那么重要；SIM体育攻击。\n.", "note_en": "September 22, 2020   Volume 18, issue 4    The challenges of multifactor authentication based on SMS, including cellular security deficiencies, SS7 exploits, and SIM swapping\n  The Internet started becoming the main reason that household PSTN (public switched telephone network) lines stayed busy sometime in the mid to late &#39;90s. Over the next decade, a number of online services completely changed the interaction of society with technology. From email to the dawn of e-commerce, these services increasingly tied people to technology and the Internet.\n Although the concept of a password was prevalent in many technology disciplines and domains, the general public had little knowledge of it, with the exception of PINs for their debit cards. It was the Internet that introduced the concept of password security to them. From that point on, people realized they had to remember passwords to access their email accounts, favorite e-commerce sites, etc.\n At that time, a password was all it took to unlock an account, and password requirements were very loose. The cybersecurity landscape was nowhere near as challenging as it is now, particularly when it comes to the security of consumer accounts. There were exceptions for certain industries, such as banking, where password requirements were slightly more stringent and a hidden form of two-factor authentication, based mainly on IP geolocation, was used before it became an option for other sites. Nevertheless, the average consumer generally needed just a simple password to access even highly critical repositories of data, and the same password was often reused for multiple accounts.\n Today Internet security requires much more attention. A good example of what can go wrong is the hacking ordeal detailed by a technology reporter for  Wired who was not using two-factor authentication for his email account. 8 Email accounts have become, over the years, not only large repositories of highly sensitive and private data, but also single points of failure for digital footprints on the Internet. For example, the majority of online services allow for the resetting of a password by sending an email to the user&#39;s main email account. As a result, if an email account gets compromised, many other accounts can also be compromised in short order.\n As the security-threat landscape has changed, so too have the way passwords are used and their complexity requirements. Although many online services did not really adhere to best practices, it became widely acknowledged that passwords should be highly complex in order to maximize their entropy and, thus, substantially increase the amount of time it would take to crack them.\n Eventually, though, some scientific studies 12,29 and a viral online cartoon 30 argued that increasing password complexity was not the right solution. Passphrases are proven to have much higher entropy and are much easier to remember. On the other hand, forcing password rotation, in combination with a strict password complexity policy, has been shown to result in much weaker passwords. Moreover, as a rule of thumb, it is now acknowledged that a password might not necessarily have to be rotated if it is not present in any of the public repositories of leaked credentials in the wild. 10\n Along with the ongoing challenge of making passwords secure but still usable and easy to remember, the security industry recognized that the security of an online account should not be protected only by something you know (your password). Somewhat similar to the banking approach, which requires something the user  has (e.g., a debit card) and something the user  knows (e.g., the card&#39;s PIN), online accounts started to support, and in some cases mandate, the use of two-factor authentication. The second factor needed to be something the user has—the obvious and simple choice was clear from the beginning: the user&#39;s smartphone.\n Enabling two-factor authentication for online accounts is critical to their security. Everyone should enable this feature in (at the very least) their email accounts, as well as other accounts that store critical and sensitive data such as credit card numbers. Cryptocurrency exchange accounts, which are commonly the target of cybercriminals, should also be secured by multiple forms of authentication. The potentially high monetary value of what these accounts protect makes them an interesting case study of what might be the best choice for a second form of authentication. For example, while SMS (short message service) as a second form of authentication is a good idea for certain types of online accounts, it is not the best option for those who own a large amount of cryptocurrency in an online exchange. 3\n SMS-based authentication tokens are popular options for securing online accounts, and they are certainly more secure than using a password alone. The history of cellular network security, however, indicates that SMS is not a secure method of communication. From rogue base stations and stingrays to more sophisticated attacks, there are a number of known methods to eavesdrop on and brute-force text messages, both locally and remotely. As such, this method is not the most reliable for accounts that store assets with a high financial value, such as cryptocurrencies.\n This article provides some insight into the security challenges of SMS-based multifactor authentication: mainly cellular security deficiencies, exploits in the SS7 (Signaling System No. 7) protocol, and the dangerously simple yet highly efficient fraud method known as SIM (subscriber identity module) swapping. Based on these insights, readers can gauge whether SMS tokens should be used for their online accounts. This article is not an actual analysis of multifactor authentication methods and what can be considered a second (or third, fourth, etc.) factor of authentication; for such a discussion, the author recommends reading security expert Troy Hunt&#39;s report on the topic. 9\n (Full disclosure: the author uses SMS to secure some rather vanilla online accounts, mainly those that do not require storing a credit card number or other sensitive financial information.)\n   For standard consumer online accounts, the two main options for providing a second factor of authentication are generally via SMS or leveraging a one-time token generated by an app on the user&#39;s smartphone. The latter is more secure and should be used for highly secure and sensitive accounts, but the former is the most widely used option and could be a valid choice in certain circumstances. Aside from their security, however, these two options have very different advantages and disadvantages in the context of convenience and usability—important factors to consider when designing a secure system. The pros and cons of both types of authentication are summarized in figure 1.\n    As noted throughout this article, a one-time token generated by an application on the user&#39;s device is the most secure way of implementing two-factor authentication for online accounts without requiring nonstandard hardware to be used by the consumer (e.g., an RSA token, a YubiKey, etc., which are more common in an enterprise context). Aside from that, there are a number of advantages and disadvantages.\n One of the main considerations for either option is network connectivity. The convenience of an app-generated token, which requires no network connectivity, contrasts with the strict requirement of connectivity to receive a token via SMS. Although network connectivity is considered a ubiquitous commodity, there are a number of scenarios in which a user could require access to an account while out of range.\n Another advantage of app-based token delivery is that these apps can generally be registered and used with multiple online accounts. The main usability challenge with generating tokens with a smartphone app, however, is that administering such an app—and the cryptographic material it leverages—requires some extra effort. In general, backing up a smartphone to the cloud, the most common method, does not save such cryptographic material as part of the backup data. Nor does this material get saved on an unencrypted local backup on a computer. Even when locking a local backup with a password, not all seeds are stored with it. This can lead to users getting locked out of their accounts if their smartphones are lost or stolen, for example, or even if they get a new phone. In these scenarios, the so-called &#34;backup codes&#34; are important. As a rule of thumb, users should never wipe their old smartphones until the new ones have been fully set up and two-factor authentication apps have been reset.\n   Two-factor authentication tokens received via text message tend to work well for standard consumer use because they&#39;re easy for the user. There is no requirement to install an application on the user&#39;s device, and it doesn&#39;t require any management of backup codes or a backup plan to deal with a lost or stolen device. When a user gets a new device, there is no need to reset the two-factor authentication system, as text messaging is tied to the phone number, which generally remains unchanged on a new device.\n On the downside, SMS-based authentication requires an active connection to the cellular network. Even though the majority of text message-based communication occurs over IP (e.g., iMessage, WhatsApp, etc.), SMS second-factor authentication tokens are generally delivered over cellular networks&#39; standard SMS. Therefore, Wi-Fi connectivity alone is not sufficient; an active cellular connection is necessary. This can be challenging in certain situations where cell service is spotty or nonexistent or connectivity is constrained to 802.11 networks.\n Despite their security challenges, SMS-based authentication tokens are a widely utilized option, which is currently receiving active support from device manufacturers. As an example, Apple recently announced a new feature in iOS 14 to harden SMS codes against applications attempting to trick the user into inputting the code in a malicious app ( https://developer.apple.com/news/?id=z0i801mg).\n   Despite its convenience and use by a large number of online services, two-factor authentication via text message has significant security challenges. This section presents an overview of the main security challenges of using SMS for two-factor authentication token delivery. These range from somewhat sophisticated threats to cellular network protocols, which require an adversary to be in the vicinity of the target victim, to low-hanging fruit techniques that, despite being much less technically complex, have no range constraints and can be implemented at near-zero cost. For example, one of the biggest security threats in mobile communication systems is SIM swapping, a systemic problem related to how mobile operators authenticate users in their customer care platforms. 18\n The main advantages and challenges of three different methods of SMS interception are summarized in figure 2.\n    The first generation of mobile networks (1G) lacked support for encryption. Legacy 2G GSM (Global System for Mobile Communications) networks lack mutual authentication and implement an outdated encryption algorithm. Combined with the wide availability of open source implementations of the GSM protocol stack, this resulted in the discovery of many possible exploits on the GSM radio link over the past decade 23 (illustrated in figure 3). Specifically, both the techniques and the tools necessary to deploy a malicious GSM base station and implement a full MITM (man-in-the-middle) attack against a GSM connection are commodities, although they require the adversary to be in physical proximity to a given target. Low-cost software radios and open source implementations of the GSM protocol stack can be used to intercept mobile traffic, including SMS messages. 22,24\n  Over the past few years, researchers have also demonstrated how to intercept SMS traffic with less strict proximity constraints by triggering a race condition when replying to paging messages intended for another user. 6 In order to geolocate a given target victim to intercept a token over SMS, privacy and location leaks have also been investigated in the context of legacy GSM networks. 17\n Specific efforts were made to enhance confidentiality and authentication in 3G and LTE (Long-term Evolution) mobile networks, with stronger cryptographic algorithms and mutual authentication implemented in both standards. Because of this, LTE has generally been considered secure, given its mutual authentication and strong encryption scheme. As such, confidentiality and authentication were wrongly assumed to be sufficiently guaranteed. Researchers demonstrated a few years ago, however, that LTE mobile networks are still vulnerable to protocol exploits, location leaks, and rogue base stations. 14,27\n Despite the strong cryptographic protection of user traffic and mutual authentication, a large number of control-plane (signaling) messages are regularly exchanged over an LTE radio link in the clear. Before the authentication and encryption steps of a connection are executed, a mobile device engages in a substantial conversation with any LTE base station (real or rogue) that advertises itself with the correct broadcast information. This results in a critical threat caused by the implicit trust placed—from the mobile device&#39;s point of view—in the messages coming from the base station. Many operations with critical security implications are executed when triggered by some of these implicitly trusted messages, which are neither authenticated nor validated.\n In the age of large-scale cyberattacks, one of the largest civilian communication systems must rely on privacy protocols far more sophisticated than just basic implicit trust anchored in the base station looking like a legitimate station. Note that the same applies in reverse, with the base station implicitly trusting all preauthentication messages coming from mobile devices.\n Although a malicious LTE base station is incapable of launching a full MITM attack, several studies have demonstrated and prototyped techniques to silently downgrade a modern smartphone to a vulnerable GSM connection. 13,26,27 What all these techniques have in common is that they leverage and abuse such preauthentication messages.\n As the industry prepares to embrace the advent of 5G, the security architecture for such next-generation mobile networks is being put under scrutiny. Several studies over the past year have highlighted the fact that most preauthentication message-based protocol exploits in LTE still apply to 5G networks. 11,15,16,26 As a result, silently downgrading the connection of a smartphone to a GSM link is still possible, given the current specifications for such mobile communication systems. 28 By abusing these vulnerabilities, an adversary could successfully intercept a two-factor authentication token delivered over SMS.\n It is important to note, however, that intercepting tokens from SMS messages by intercepting GSM traffic is the most technologically complex option. Even though such attacks can be carried out with low-cost software radios and minor modifications to open source tools, the vast majority of fraud conducted by intercepting authentication tokens delivered via SMS leverages vulnerabilities in either SS7 or SIM swapping.\n   SS7 is a legacy architecture and protocol developed more than 30 years ago. It performs out-of-band signaling support for a number of functions in the PSTN, namely call establishment, billing, routing, and information exchange. 25 From its inception in 1988, when mobile operators started leveraging it for out-of-band signaling, this protocol&#39;s security mostly relied on the implicit trust among operators. It was regarded as a closed trusted network and had limited to no authentication built in. As a result, the security features of this network and protocol were minimal and depended on a small number of operators globally that were either state-controlled or large corporations. This is not the case anymore, as the number of operators is much larger as a result of the steep increase in mobile usage, as well as the growth in the number of MVNOs (mobile virtual network operators) around the globe over the past decade.\n 3GPP (3rd Generation Partnership Project) added two new protocols to SS7 in the 1990s and 2000s: MAP (Mobile Application Part) and CAMEL (Customized Applications for Mobile Networks Enhanced Logic). These were aimed at supporting some of the new services that mobile networks provide, as well as new features for mobile operators. 19 Among other functionality, CAMEL allows the implementation of carrier-grade value-added services such as fraud control and prepaid services. In parallel, MAP provides services to geolocate devices globally, such as the anyTimeInterrogation service and LCS (Location Service). Discouragingly, none of these new SS7 subprotocols added authentication or security features.\n Researchers have identified a number of critical security vulnerabilities in SS7 that could be exploited to geolocate users and intercept their traffic from nearly anywhere. 5 In some cases, the only requirement is to have access to the SS7 network, which, despite being more restricted now than in the past, can still easily be purchased on the dark web. Researchers have also gained access to the SS7 network via hacked femtocells and, in some scarce cases, actually purchasing access from mobile operators.\n To make matters worse, researchers were also able to demonstrate techniques to intercept phone calls and text messages remotely by means of exploiting flaws in the CAMEL protocol. Figure 4 illustrates this process. Such security threats in mobile communication networks came to wide public attention when a German researcher demonstrated these attacks in a news report on primetime TV. 1\n  Once the attacker has access to an entry point to the SS7 network, all it takes is one message to modify the registration for a given target in the MSC (mobile switching center), in the case of GSM. From that moment on, the MSC will reach out to the attacker instead.\n Modern LTE networks largely migrated most SS7-based services over to the Diameter protocol. This new protocol, despite providing some improvements, still suffers from a number of vulnerabilities, most of which are flaws inherited from SS7. 2 As a result, similar remote interception of calls and text messages could be possible in LTE. Regardless, as discussed earlier, silently downgrading a smartphone to a much less secure GSM connection is simple, given enough proximity to the target.\n Exploiting security flaws in SS7 networks and their protocols is a fairly efficient way to intercept two-factor authentication tokens delivered over SMS. In general, this is an attack vector that is known for being used by hacker groups and has become so relevant that it is even considered within the MITRE ATT&amp;CK framework, which has been widely adopted by many technology companies as part of their security postures. 20\n   Despite the effectiveness of the SMS interception techniques that exploit flaws in cellular network protocols and in legacy SS7 networks, SIM swapping is arguably the number-one security threat against SMS communications being used to deliver one-time tokens for multifactor authentication.\n As illustrated in figure 5, a SIM swap attack consists of fooling a mobile operator, usually over a phone call with customer service, that the legitimate owner of a cellular subscription needs the account to be ported to a new SIM card. The caller may claim, for example, that the phone was lost overseas and access needs to be recovered as soon as possible on a newly acquired phone and a new SIM card. The credibility of such a story is actually not that important; SIM porting attacks a\n......", "posttime": "2020-11-10 20:09:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "身份,analysis,密码", "title": "短信作为身份认证第二要素的安全性分析", "title_en": "Security Analysis of SMS as a Second Factor of Authentication", "transed": 1, "url": "https://queue.acm.org/detail.cfm?id=3425909", "via": "", "real_tags": ["身份", "analysis", "密码"]}, {"category": "", "categoryclass": "", "imagename": "7fc0009c9095bdb53453d77ccb5e9498.jpg", "infoid": 1034243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃德蒙·菲茨杰拉德号(SS Edmund Fitzgerald)是一艘美国五大湖货轮，1975年11月10日在苏必利尔湖(Lake Superior)风暴中沉没，29名船员全部遇难。1958年6月7日下水时，这艘船是北美五大湖上最大的船，现在仍然是在那里沉没的最大船。\n17年来，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)从明尼苏达州德卢斯(Duluth)附近的矿山向底特律、托莱多和其他五大湖港口的铁厂运送塔可石铁矿石。作为一匹主力马，她六次创下季节性拖网纪录，经常打破自己之前的纪录。[5][6]彼得·普尔切尔船长以在通过圣克莱尔河和底特律河(休伦湖和伊利湖之间)时，不分昼夜地在船上的对讲机上播放音乐而闻名，并在苏船闸(苏必利尔湖和休伦湖之间)用关于这艘船的实时评论来娱乐观众。[5]她的身材，破纪录的表演，以及DJ船长埃德蒙·菲茨杰拉德深受船民的喜爱。[7]。\n1975年11月9日下午，在船长欧内斯特·M·麦克索利(Ernest M.McSorley)的指挥下，这艘船满载着矿球，从威斯康星州的苏必利尔市(Superior)出发，开始了她不幸的航程。在前往底特律附近的一家钢铁厂的途中，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)加入了第二艘塔康货轮--党卫军阿瑟·M·安德森(Arthur M.Anderson)。第二天，这两艘船在苏必利尔湖遭遇了一场严重的风暴，接近飓风强度的风浪高达35英尺(11米)。晚上7点10分过后不久，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)突然在加拿大(Ontario)530英尺(88英尺；160米)深的水域沉没，距离双子城索尔斯特(Soult Ste)附近的怀特菲什湾(Whitefish Bay)约17英里(15海里；27公里)。密歇根州玛丽市和苏尔街。安大略省玛丽--埃德蒙·菲茨杰拉德(Edmund Fitzgerald)以最高时速本可以在一个多小时内跑完这段距离。\n埃德蒙·菲茨杰拉德之前曾向亚瑟·M·安德森报告说，他遇到了很大的困难。我有一份糟糕的清单，两部雷达都丢了。正在甲板上掀起波涛汹涌的大海。这是我经历过的最糟糕的海域之一。然而，在它沉没之前没有发出求救信号；麦克索利船长的最后一次(晚上7点10分)。给亚瑟·M·安德森的信息是，我们坚持自己的立场。她的29名船员遇难，没有发现任何身体。沉没的确切原因尚不清楚，尽管许多书籍、研究和探险都对其进行了研究。埃德蒙·菲茨杰拉德(Edmund Fitzgerald)可能已经被淹没，遭受了结构故障或顶部损坏，经历了波浪浅滩，或者遭受了这些情况的综合影响。\n这场灾难是五大湖航运史上最著名的灾难之一。戈登·莱特福特在读了1975年11月24日出版的《新闻周刊》上的一篇文章《最残酷的一个月》后，把这句话写进了他1976年的热门歌曲《埃德蒙·菲茨杰拉德的残骸》(The Wreck Of The Edmund Fitzgerald)。沉船事件导致五大湖航运法规和做法发生变化，包括强制救生衣、测深仪、定位系统、增加干舷，以及更频繁地检查船只。\n威斯康星州密尔沃基的西北互惠人寿保险公司大规模投资于钢铁和矿产行业，包括建造埃德蒙·菲茨杰拉德(Edmund Fitzgerald)，这是美国寿险公司首次进行此类投资。[8]1957年，他们与密歇根州鲁日河的五大湖工程公司(Glew)签订了合同，在即将完工的圣劳伦斯海峡允许通过的最大长度一英尺内设计和建造这艘船。[9]当时这艘船的价值为700万美元(相当于2019年的4970万美元)。埃德蒙·菲茨杰拉德(Edmund Fitzgerald)是第一个达到圣劳伦斯海道最大尺寸的湖人，长730英尺(222.5米)，宽75英尺(22.9米)，吃水25英尺(7.6米)。[12]模制深度(粗略地说，船体的垂直高度)为39英尺(12米)。[4]货舱深度(货舱内部高度)为33英尺4英寸(10.16米)。[4][5]格劳于同年8月7日铺设了第一块龙骨板。[13]。\n埃德蒙·菲茨杰拉德号的载重量为26,000长吨(29,120短吨；26,417吨)，船体长达729英尺(222米)，是五大湖上最长的船，直到1959年9月17日，长达730英尺(222.5米)的SS Murray Bay号下水前，埃德蒙·菲茨杰拉德号一直是五大湖中最长的船。[14]埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的三个中央货舱[15]是通过21个水密舱口装载的，每个舱口都是11×48英尺(3.4x14.6m)的5⁄16英寸厚(7.9m)钢。[16]她的锅炉最初是燃煤的，在1971-72年冬季期间被改装成燃油。[17]1969年，通过安装柴油动力船头推进器，这艘船的操纵性得到了改善。[18]。\n按照矿石运输船的标准，埃德蒙·菲茨杰拉德号的内饰相当豪华。她的J.L.哈德逊公司设计的家具[19]包括厚厚的地毯，瓷砖浴室，\n西北互惠银行以其总裁兼董事会主席埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的名字命名了这艘船。菲茨杰拉德自己的祖父曾是一名湖长，他的父亲拥有密尔沃基干船坞公司，该公司负责建造和维修船只。[21]1958年6月7日，超过15,000人参加了埃德蒙·菲茨杰拉德的洗礼和启动仪式。这项活动充满了不幸。当埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的妻子伊丽莎白·菲茨杰拉德(Elizabeth Fitzgerald)试图用一个香槟酒瓶砸向船头为这艘船洗礼时，她花了三次努力才打破了它。随后延迟了36分钟，当时船厂船员正在努力释放龙骨积木。这艘船侧身下水时，掀起了巨浪，冲走了观众，然后撞上了码头，然后又恢复了原状。一名观看发射的男子心脏病发作，后来死亡。其他目击者后来表示，他们发誓这艘船正试图爬出水面。[22]1958年9月22日，埃德蒙·菲茨杰拉德完成了为期9天的海上试航。[23]。\n西北互惠银行的正常做法是购买船只供其他公司运营。[24]在埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的案例中，他们与奥格尔贝·诺顿公司(Oglebay Norton Corporation)签署了一份为期25年的合同，负责运营这艘船。[15]奥格尔贝·诺顿立即指定埃德蒙·菲茨杰拉德(Edmund Fitzgerald)为其哥伦比亚运输船队的旗舰。[20]。\n埃德蒙·菲茨杰拉德(Edmund Fitzgerald)是一匹创纪录的主力马，经常打破自己的里程碑。[5]1969年，这艘船的单程载重纪录是27,402长吨(30,690短吨；27,842吨)。[5]17年来，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)从明尼苏达州德卢斯(Duluth)附近的铁岭矿山向底特律、托莱多和其他港口的铁厂运送塔可石。她创造了六次不同的季节性拖网记录。[6]她的昵称包括《美国方面的骄傲》、《伟大的菲兹》、《托莱多快递》、《大菲兹》、《五大湖的泰坦尼克号》等。[6]她的昵称包括《美国方面的骄傲》(Pride Of The American Side)、《伟大的菲茨》(Might Fitz)、《托莱多快递》(Toledo Express)、《大菲兹》(Big Fitz)和《五大湖的泰坦尼克号》。[28]把埃德蒙·菲茨杰拉德装上玉米粒大约花了四个半小时，而卸货花了大约14个小时。威斯康星州苏必利尔市和密歇根州底特律之间的往返旅行通常需要她5天的时间，她平均每个赛季有47次类似的旅行。[29]这艘船通常的航线是威斯康星州的苏必利尔市和俄亥俄州的托莱多市之间，尽管它的目的地可能会有所不同。[26]到1975年11月，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)已经在五大湖上记录了大约748次往返旅行，行程超过100万英里，大致相当于绕世界44圈。\n直到她遇难的前几周，乘客都是作为公司客人乘坐飞机的。弗雷德里克·斯通豪斯写道：\n乘务员招待客人参加整个贵宾例行公事。据报道，那里的菜肴很棒，休息室里总是有零食供应。一间小厨房供应饮料，虽然不大，但储备充足。每次旅行，机长都会为客人举办一次烛光晚宴，包括穿着餐服的乘务员和特制的挖掘机潘趣酒。[31][31]。\n埃德蒙·菲茨杰拉德(Edmund Fitzgerald)因其体型、外貌、一系列唱片和DJ船长，在她的职业生涯中成为了观船人士的最爱。尽管彼得·普尔塞尔船长是埃德蒙·菲茨杰拉德的船长，当时他的货运记录被刷新，但人们对他印象最深的是……。在通过圣克莱尔河和底特律河时，无论白天还是黑夜，都可以在船上的对讲机系统上播放音乐。[5]在苏洛克岛航行时，他经常走出驾驶舱，用扩音器为游客解说埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的详细情况。[5]。\n1969年，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)获得了一项安全奖，表彰他在八年的运营中没有发生一起工伤事故。[5]该船于1969年搁浅，并于1970年与SS Hochelaga相撞。同年晚些时候，她撞上了一堵锁的墙，1973年和1974年再次发生了同样的事故。1974年，她在底特律河里失去了原来的船头锚。[32]然而，这些事故都不被认为是严重或不寻常的。[33]淡水船只的建造寿命超过半个世纪，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)在沉没时应该还有很长的职业生涯等着她。[8]。\n埃德蒙·菲茨杰拉德(Edmund Fitzgerald)于下午2点15分离开威斯康星州苏必利尔市。1975年11月9日下午，在欧内斯特·M·麦克索利上尉的指挥下。她当时正在前往密歇根州底特律附近祖格岛(Zug Island)的钢铁厂的途中[35]，装载了26,116长吨(29,250短吨；26,535吨)的塔可石矿石球团，很快就达到了16.3英里/小时(14.2公里/小时；26.2公里/小时)的全速。[36]下午5点左右，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)加入了第二艘货轮，船长杰西·伯尼·库珀(Jesse B.；Bernie)和阿瑟·M·安德森(Arthur M.Anderson)从明尼苏达州的两个港口开往印第安纳州的加里(Gary)。[37]11月份的天气预报并不罕见\nSS Wilfred Sykes在伯灵顿北方码头1号码头与埃德蒙·菲茨杰拉德(Edmund Fitzgerald)对峙，下午4点15分离开，比埃德蒙·菲茨杰拉德(Edmund Fitzgerald)晚了大约两个小时。与国家气象局的预测相反，Wilfred Sykes的船长达德利·J·帕奎特(Dudley J.Paquette)预测，一场大风暴将直接横跨苏必利尔湖。从一开始，他就选择了一条利用湖泊北岸提供的保护的路线，以避免暴风雨带来的最坏影响。威尔弗雷德·赛克斯号的机组人员在旅行的第一阶段跟踪了埃德蒙·菲茨杰拉德和亚瑟·M·安德森之间的无线电通话，无意中听到他们的船长们决定走湖航母协会的常规下行路线。[39]国家气象局在晚上7点改变了预报，发布了苏必利尔湖全湖的大风警告。[40]亚瑟·M·安德森(Arthur M.Anderson)和埃德蒙·菲茨杰拉德(Edmund Fitzgerald)改变航线，沿着安大略省海岸向北寻找避难所[37]，凌晨1点，他们在那里遇到了一场冬季风暴。11月10日，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)报告风速为52节(96公里/小时；60公里/小时)，海浪高达10英尺(3.0米)。[41]Wilfred Sykes的船长帕奎特报告说，凌晨1点过后，他无意中听到麦克索利说，由于恶劣的环境，他已经降低了船的航速。帕奎特说，后来他听到麦克索利说我们要试着从皇家岛买一些李，这让他感到震惊。麦克索利并不以掉头或减速著称。不管怎样，你还是要离开我们，…。我不能和你呆在一起。\n凌晨2点。11月10日，国家气象局将警告从大风升级为风暴，预测风速为35-50海里/小时(65-93公里/小时；40-58公里/小时)。[42]在此之前，埃德蒙·菲茨杰拉德一直跟随着亚瑟·M·安德森，后者以稳定的14.6英里/小时(12.7公里/小时；23.5万公里/小时)的速度行驶，[37]但速度更快的埃德蒙·菲茨杰拉德在凌晨3点左右领先。[43]当风暴中心经过船只时，它们经历了风向的变化，风向从东北转向南方，然后是西北，风速暂时下降。[41]下午1点50分过后，阿瑟·M·安德森(Arthur M.Anderson)记录到的风速为50节(93公里/小时；58公里/小时)，风速再次迅速加快，下午2点45分开始下雪，能见度降低；阿瑟·M·安德森失去了埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的视线，当时埃德蒙·菲茨杰拉德(Edmund Fitzgerald)在前方约16英里(26公里)。[44][44]。\n下午3点30分过后不久，麦克索利船长用无线电通知亚瑟·M·安德森(Arthur M.Anderson)说，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)进水了，丢失了两个通风口盖和一个围栏栏杆。该船还制定了一份清单。[45]埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的六个舱底泵中有两个连续运行，以排放装运的水。[46]麦克索利说，他会让他的船慢下来，这样亚瑟·M·安德森就能缩小他们之间的差距。[45]在不久之后的一次广播中，美国海岸警卫队(USCG)警告所有船只，苏船闸已经关闭，他们应该寻求安全锚地。下午4点10分过后不久，麦克索利再次打电话给亚瑟·M·安德森(Arthur M.Anderson)，报告了一起雷达故障，并要求亚瑟·M·安德森跟踪他们。[47]埃德蒙·菲茨杰拉德(Edmund Fitzgerald)实际上是失明的，他放慢了速度，让阿瑟·M·安德森(Arthur M.Anderson)进入10英里(16公里)的范围内，这样她就可以接受另一艘船的雷达制导。[48][48]。\n有一段时间，阿瑟·M·安德森(Arthur M.Anderson)指挥埃德蒙·菲茨杰拉德(Edmund Fitzgerald)前往相对安全的白鱼湾(Whitefish Bay)；然后，在下午4点39分，麦克索利联系密歇根州大马莱斯(Grand Marais)的美国海军陆战队(USCG)车站，询问白鱼点(Whitefish Point)的灯光和导航信标是否正常工作。USCG答复说，他们的监测设备显示这两台仪器都处于非活动状态。[49]麦克索利随后召唤白鱼角地区的任何船只报告助航设备的状况，并在下午5点至5点30分之间收到了阿瓦福斯船长塞德里克·伍达德(Cedric Woodard)的回复。白鱼角的灯亮了，但无线电灯没有亮。[43]伍达德向海军委员会作证说，他无意中听到麦克索利说，不要让任何人上甲板，还说了一些伍达德听不懂的通风口。[51]一段时间后，麦克索利告诉伍达德，我有一个糟糕的清单，我失去了两部雷达，正在甲板上颠簸，这是我所经历过的最糟糕的海域之一。\n截至11月10日下午晚些时候，东部苏必利尔湖的船只和观测点记录到的持续风速超过50节(93公里/小时；58公里/小时)。[53]亚瑟·M·安德森(Arthur M.Anderson)在下午4点52分记录的持续风速高达58海里(107公里/小时；67英里/小时)，[47]而到下午6点，海浪增加到25英尺(7.6米)。[54]阿瑟·M·安德森还遭受了70到75海里(130到139公里/小时；81到86英里/小时)的阵风和高达35英尺(11米)的无赖海浪的袭击。[15]。\n这艘船的最后一次通信发生在晚上7点10分左右，当时亚瑟·M·安德森(Arthur M.Anderson)通知埃德蒙·菲茨杰拉德(Edmund Fitzgerald)有一艘正在上行的船，并询问她情况如何。麦克索利回购\n尽管搜寻工作找到了包括救生艇和救生筏在内的残骸，但没有发现任何船员。[63]在最后一次航行中，埃德蒙·菲茨杰拉德(Edmund Fitzgerald)的29名船员包括船长、一、二、三副、五名工程师、三名加油工、一名厨师、一名雨刷、两名维修员、三名值班员、三名水手、三名舵手、两名搬运工、一名学员和一名乘务员。大多数船员来自俄亥俄州和威斯康星州；[64]他们的年龄从20岁的看守人卡尔·A·佩科尔(Karl A.Peckol)到63岁计划退休的麦克索利船长不等。[65][font=宋体]。\n埃德蒙·菲茨杰拉德(Edmund Fitzgerald)是在五大湖失踪的最大和最知名的船只之一[66]，但她并不是唯一在该地区苏必利尔湖(Lake Superior)海床上失踪的船只。从1816年无敌号沉没到1975年埃德蒙·菲茨杰拉德号沉没之间的几年里，白鱼角地区至少有240艘船只被夺走。[67][中英文摘要]。\n1975年11月14日，一架美国海军洛克希德P-3猎户座飞机被发现，该飞机由乔治·康纳中尉驾驶，装备用于探测通常与潜艇有关的磁异常。埃德蒙·菲茨杰拉德(Edmund Fitzgerald)位于安大略省死人湾以西约15英里(24公里)处，距离东南部白鱼湾入口处17英里(15英里；27公里)，位于加拿大靠近国际边界的水域，深度为530英尺(160米)。[50]11月14日至16日，美国地质调查局使用侧扫声纳进行了进一步的调查，发现湖底有两个大物体紧挨着躺在一起。美国海军还与Sewards公司签约，在11月22日至25日之间进行第二次调查。[68][中英文摘要]。\n1976年5月20日至28日，美国海军使用其无人潜水器CURV-III潜入沉船，发现埃德蒙·菲茨杰拉德躺在530英尺(160米)深的水中，身体分成两大块。海军估计，船头部分的长度为276英尺(84米)，船尾部分的长度为253英尺(77米)。船头部分直立在泥泞中，距离船尾部分约170英尺(52米)，船尾部分与船头成50度角倾覆。在两个破碎的部分之间躺着一大块塔康石贝壳。\n.", "note_en": "SS  Edmund Fitzgerald was an American  Great Lakes freighter that sank in a  Lake Superior storm on November 10, 1975, with the loss of the entire crew of 29. When launched on June 7, 1958, she was the largest ship on North America&#39;s  Great Lakes, and she remains the largest to have sunk there.\n For 17 years,  Edmund Fitzgerald carried  taconite  iron ore from mines near  Duluth, Minnesota, to iron works in  Detroit,  Toledo, and other Great Lakes ports. As a workhorse, she set seasonal haul records six times, often breaking her own previous record.  [5]  [6] Captain Peter Pulcer was known for piping music day or night over the ship&#39;s intercom while passing through the  St. Clair and  Detroit rivers (between lakes  Huron and  Erie), and entertaining spectators at the  Soo Locks (between Lakes Superior and Huron) with a running commentary about the ship.  [5] Her size, record-breaking performance, and &#34; DJ captain&#34; endeared  Edmund Fitzgerald to boat watchers.  [7]\n Carrying a full cargo of ore pellets with Captain  Ernest M. McSorley in command, she embarked on her ill-fated voyage from  Superior, Wisconsin, near Duluth, on the afternoon of November 9, 1975. En route to a steel mill near Detroit,  Edmund Fitzgerald joined a second taconite freighter,  SS  Arthur M. Anderson. By the next day, the two ships were caught in a  severe storm on Lake Superior, with near  hurricane-force winds and waves up to 35 feet (11 m) high. Shortly after 7:10 p.m.,  Edmund Fitzgerald suddenly sank in Canadian (Ontario) waters 530 feet (88 fathoms; 160 m) deep, about 17 miles (15 nautical miles; 27 kilometers) from  Whitefish Bay near the twin cities of  Sault Ste. Marie, Michigan, and  Sault Ste. Marie, Ontario—a distance  Edmund Fitzgerald could have covered in just over an hour at her top speed.\n Edmund Fitzgerald previously reported being in significant difficulty to  Arthur M. Anderson: &#34;I have a bad list, lost both radars. And am taking heavy seas over the deck. One of the worst seas I&#39;ve ever been in.&#34; However, no distress signals were sent before she sank; Captain McSorley&#39;s last (7:10 P.M.) message to  Arthur M. Anderson was, &#34;We are holding our own.&#34; Her crew of 29 perished, and no bodies were recovered. The exact cause of the sinking remains unknown, though many books, studies, and expeditions have examined it.  Edmund Fitzgerald may have been swamped, suffered structural failure or topside damage, experienced  wave shoaling, or suffered from a combination of these.\n The disaster is one of the best-known in the history of Great Lakes shipping.  Gordon Lightfoot made it the subject of his 1976 hit song  &#34;The Wreck of the  Edmund Fitzgerald&#34; after reading an article, &#34;The Cruelest Month&#34;, in the November 24, 1975, issue of   Newsweek. The sinking led to changes in Great Lakes shipping regulations and practices that included mandatory survival suits, depth finders, positioning systems, increased  freeboard, and more frequent inspection of vessels.\n     Northwestern Mutual Life Insurance Company of  Milwaukee, Wisconsin, invested in the iron and minerals industries on a large-scale basis, including the construction of  Edmund Fitzgerald, which represented the first such investment by any American life insurance company.  [8] In 1957, they contracted  Great Lakes Engineering Works (GLEW), of  River Rouge, Michigan, to design and construct the ship &#34;within a foot of the maximum length allowed for passage through the soon-to-be completed  Saint Lawrence Seaway.&#34;  [9] The ship&#39;s value at that time was $7 million (equivalent to $49.7 million in 2019  [10]).  Edmund Fitzgerald was the first  laker built to the  maximum St. Lawrence Seaway size,  [11] which was 730 feet (222.5 m) long, 75 feet (22.9 m) wide, and with a 25 foot (7.6 m) draft.  [12] The  moulded depth (roughly speaking, the vertical height of the hull) was 39 ft (12 m).  [4] The hold depth (the inside height of the cargo hold) was 33 ft 4 in (10.16 m).  [4]  [5] GLEW laid the first  keel plate on August 7 the same year.  [13]\n With a  deadweight capacity of 26,000  long tons (29,120 short tons; 26,417 t),  [5] and a 729-foot (222 m) hull,  Edmund Fitzgerald was the longest ship on the Great Lakes, earning her the title  Queen of the Lakes  [11] until September 17, 1959, when the 730-foot (222.5 m) SS  Murray Bay was launched.  [14]  Edmund Fitzgerald &#39;s three central cargo holds  [15] were loaded through 21 watertight hatches, each 11 by 48 feet (3.4 by 14.6 m) of   5⁄ 16-inch-thick (7.9 mm) steel.  [16] Originally coal-fired, her boilers were converted to burn  oil during the 1971–72 winter layup.  [17] In 1969, the ship&#39;s maneuverability was improved by the installation of a diesel-powered  bow thruster.  [18]\n By ore freighter standards, the interior of  Edmund Fitzgerald was luxurious. Her  J.L. Hudson Company-designed furnishings  [19] included deep pile carpeting, tiled bathrooms, drapes over the  portholes, and leather swivel chairs in the guest lounge. There were two guest staterooms for passengers. Air conditioning extended to the crew quarters, which featured more amenities than usual. A large  galley and fully stocked pantry supplied meals for two dining rooms.  Edmund Fitzgerald &#39;s  pilothouse was outfitted with &#34;state-of-the-art nautical equipment and a beautiful map room.&#34;  [20]\n  Northwestern Mutual named the ship after its president and chairman of the board, Edmund Fitzgerald. Fitzgerald&#39;s own grandfather had himself been a lake captain, and his father owned the Milwaukee Drydock Company, which built and repaired ships.  [21] More than 15,000 people attended  Edmund Fitzgerald &#39;s  christening and launch ceremony on June 7, 1958. The event was plagued by misfortunes. When Elizabeth Fitzgerald, wife of Edmund Fitzgerald, tried to christen the ship by smashing a champagne bottle over the bow, it took her three attempts to break it. A delay of 36 minutes followed while the shipyard crew struggled to release the keel blocks. Upon sideways launch, the ship created a large wave that &#34;doused&#34; the spectators and then crashed into a pier before righting herself. One man watching the launching had a heart attack and later died. Other witnesses later said they swore the ship was &#34;trying to climb right out of the water&#34;.   [22] On September 22, 1958,  Edmund Fitzgerald completed nine days of  sea trials.  [23]\n   Northwestern Mutual&#39;s normal practice was to purchase ships for operation by other companies.  [24] In  Edmund Fitzgerald &#39;s case, they signed a 25-year contract with Oglebay Norton Corporation to operate the vessel.  [15] Oglebay Norton immediately designated  Edmund Fitzgerald the  flagship of its Columbia Transportation fleet.  [20]\n Edmund Fitzgerald was a record-setting workhorse, often beating her own milestones.  [5] The vessel&#39;s record load for a single trip was 27,402 long tons (30,690 short tons; 27,842 t) in 1969.  [5] For 17 years,  Edmund Fitzgerald carried  taconite from  Minnesota&#39;s Iron Range mines near Duluth, Minnesota, to iron works in Detroit, Toledo, and other ports. She set seasonal haul records six different times.  [6] Her nicknames included &#34;Fitz&#34;, &#34;Pride of the American Side&#34;,  [25] &#34;Mighty Fitz&#34;, &#34;Toledo Express&#34;,  [26] &#34;Big Fitz&#34;,  [27] and the &#34; Titanic of the Great Lakes&#34;.  [28] Loading  Edmund Fitzgerald with taconite pellets took about four and a half hours, while unloading took around 14 hours. A round trip between  Superior, Wisconsin, and Detroit, Michigan, usually took her five days and she averaged 47 similar trips per season.  [29] The vessel&#39;s usual route was between Superior, Wisconsin, and Toledo, Ohio, although her port of destination could vary.  [26] By November 1975,  Edmund Fitzgerald had logged an estimated 748 round trips on the Great Lakes and covered more than a million miles, &#34;a distance roughly equivalent to 44 trips around the world.&#34;  [30]\n Up until a few weeks before her loss, passengers had traveled on board as company guests. Frederick Stonehouse wrote:\n Stewards treated the guests to the entire VIP routine. The cuisine was reportedly excellent and snacks were always available in the lounge. A small but well stocked kitchenette provided the drinks. Once each trip, the captain held a candlelight dinner for the guests, complete with mess-jacketed stewards and special &#34;clamdigger&#34; punch.  [31]\n Because of her size, appearance, string of records, and &#34;DJ captain,&#34;  [5]  Edmund Fitzgerald became a favorite of boat watchers throughout her career. Although Captain Peter Pulcer was in command of  Edmund Fitzgerald on trips when cargo records were set, &#34;he is best remembered ... for piping music day or night over the ship&#39;s intercom system&#34; while passing through the  St. Clair and  Detroit Rivers.  [5] While navigating the  Soo Locks he would often come out of the pilothouse and use a bullhorn to entertain tourists with a commentary on details about  Edmund Fitzgerald.  [5]\n In 1969,  Edmund Fitzgerald received a safety award for eight years of operation without a time-off worker injury.  [5] The vessel ran aground in 1969, and she collided with SS  Hochelaga in 1970. Later that same year, she struck the wall of a  lock, an accident repeated in 1973 and 1974. During 1974, she lost her original bow anchor in the Detroit River.  [32] None of these mishaps, however, were considered serious or unusual.  [33]  Freshwater ships are built to last more than half a century, and  Edmund Fitzgerald should still have had a long career ahead of her when she sank.  [8]\n    Edmund Fitzgerald left Superior, Wisconsin, at 2:15 p.m. on the afternoon of November 9, 1975,  [34] under the command of Captain  Ernest M. McSorley. She was en route to the steel mill on  Zug Island, near Detroit, Michigan,  [35] with a cargo of 26,116 long tons (29,250 short tons; 26,535 t) of taconite ore pellets and soon reached her full speed of 16.3 miles per hour (14.2 kn; 26.2 km/h).  [36] Around 5 p.m.,  Edmund Fitzgerald joined a second freighter under the command of Captain Jesse B. &#34;Bernie&#34; Cooper,   Arthur M. Anderson, destined for  Gary, Indiana, out of  Two Harbors, Minnesota.  [37] The weather forecast was not unusual for November and the  National Weather Service (NWS) predicted that a storm would pass just south of Lake Superior by 7 a.m. on November 10.  [38]\n SS  Wilfred Sykes loaded opposite  Edmund Fitzgerald at the Burlington Northern Dock #1 and departed at 4:15 p.m., about two hours after  Edmund Fitzgerald. In contrast to the NWS forecast, Captain Dudley J. Paquette of  Wilfred Sykes predicted that a major storm would directly cross Lake Superior. From the outset, he chose a route that took advantage of the protection offered by the lake&#39;s north shore to avoid the worst effects of the storm. The crew of  Wilfred Sykes followed the radio conversations between  Edmund Fitzgerald and  Arthur M. Anderson during the first part of their trip and overheard their captains deciding to take the regular Lake Carriers&#39; Association  downbound route.  [39] The NWS altered its forecast at 7:00 p.m., issuing  gale warnings for the whole of Lake Superior.  [40]  Arthur M. Anderson and  Edmund Fitzgerald altered course northward seeking shelter along the Ontario shore  [37] where they encountered a winter storm at 1:00 a.m. on November 10.  Edmund Fitzgerald reported winds of 52 knots (96 km/h; 60 mph) and waves 10 feet (3.0 m) high.  [41] Captain Paquette of  Wilfred Sykes reported that after 1 a.m., he overheard McSorley say that he had reduced the ship&#39;s speed because of the rough conditions. Paquette said he was stunned to later hear McSorley, who was not known for turning aside or slowing down, state that &#34;we&#39;re going to try for some  lee from  Isle Royale. You&#39;re walking away from us anyway … I can&#39;t stay with you.&#34;  [39]\n At 2:00 a.m. on November 10, the NWS upgraded its warnings from gale to storm, forecasting winds of 35–50 knots (65–93 km/h; 40–58 mph).  [42] Until then,  Edmund Fitzgerald had followed  Arthur M. Anderson, which was travelling at a constant 14.6 miles per hour (12.7 kn; 23.5 km/h),  [37] but the faster  Edmund Fitzgerald pulled ahead at about 3:00 a.m.  [43] As the storm center passed over the ships, they experienced shifting winds, with wind speeds temporarily dropping as wind direction changed from northeast to south and then northwest.  [41] After 1:50 p.m., when  Arthur M. Anderson logged winds of 50 knots (93 km/h; 58 mph), wind speeds again picked up rapidly, and it began to snow at 2:45 p.m., reducing visibility;  Arthur M. Anderson lost sight of  Edmund Fitzgerald, which was about 16 miles (26 km) ahead at the time.  [44]\n Shortly after 3:30 p.m., Captain McSorley radioed  Arthur M. Anderson to report that  Edmund Fitzgerald was taking on water and had lost two vent covers and a fence railing. The vessel had also developed a  list.  [45] Two of  Edmund Fitzgerald &#39;s six  bilge pumps ran continuously to discharge shipped water.  [46] McSorley said that he would slow his ship down so that  Arthur M. Anderson could close the gap between them.  [45] In a broadcast shortly afterward, the  United States Coast Guard (USCG) warned all shipping that the  Soo Locks had been closed and they should seek safe anchorage. Shortly after 4:10 p.m., McSorley called  Arthur M. Anderson again to report a radar failure and asked  Arthur M. Anderson to keep track of them.  [47]  Edmund Fitzgerald, effectively blind, slowed to let  Arthur M. Anderson come within a 10-mile (16 km) range so she could receive radar guidance from the other ship.  [48]\n For a time,  Arthur M. Anderson directed  Edmund Fitzgerald toward the relative safety of  Whitefish Bay; then, at 4:39 p.m., McSorley contacted the USCG station in  Grand Marais, Michigan, to inquire whether the  Whitefish Point light and navigation  beacon were operational. The USCG replied that their monitoring equipment indicated that both instruments were inactive.  [49] McSorley then hailed any ships in the Whitefish Point area to report the state of the navigational aids, receiving an answer from Captain Cedric Woodard of  Avafors between 5:00 and 5:30 p.m. that the Whitefish Point light was on but not the radio beacon.  [43] Woodard testified to the Marine Board that he overheard McSorley say, &#34;Don&#39;t allow nobody on deck,&#34;  [50] as well as something about a vent that Woodard could not understand.  [51] Some time later, McSorley told Woodard, &#34;I have a &#39;bad list&#39;, I have lost both radars, and am taking heavy seas over the deck in one of the worst seas I have ever been in.&#34;  [52]\n By late in the afternoon of November 10, sustained winds of over 50 knots (93 km/h; 58 mph) were recorded by ships and observation points across eastern Lake Superior.  [53]  Arthur M. Anderson logged sustained winds as high as 58 knots (107 km/h; 67 mph) at 4:52 p.m.,  [47] while waves increased to as high as 25 feet (7.6 m) by 6:00 p.m.  [54]  Arthur M. Anderson was also struck by 70-to-75-knot (130 to 139 km/h; 81 to 86 mph) gusts  [53] and  rogue waves as high as 35 feet (11 m).  [15]\n The last communication from the ship came at approximately 7:10 p.m., when  Arthur M. Anderson notified  Edmund Fitzgerald of an  upbound ship and asked how she was doing. McSorley reported, &#34;We are holding our own.&#34; She sank minutes later. No distress signal was received, and ten minutes later,  Arthur M. Anderson lost the ability either to reach  Edmund Fitzgerald by radio or to detect her on radar.  [50]\n   Captain Cooper of  Arthur M. Anderson first called the USCG in  Sault Ste. Marie at 7:39 p.m. on channel 16, the radio distress frequency. The USCG responders instructed him to call back on channel 12 because they wanted to keep their emergency channel open and they were having difficulty with their communication systems, including antennas blown down by the storm.  [55] Cooper then contacted the upbound saltwater vessel  Nanfri and was told that she could not pick up  Edmund Fitzgerald on her radar either. Despite repeated attempts to raise the USCG, Cooper was not successful until 7:54 p.m. when the officer on duty asked him to keep watch for a 16-foot (4.9 m) boat lost in the area.  [56] At about 8:25 p.m., Cooper again called the USCG to express his concern about  Edmund Fitzgerald  [57] and at 9:03 p.m. reported her missing.  [58] Petty Officer Philip Branch later testified, &#34;I considered it serious, but at the time it was not urgent.&#34;  [59]\n Lacking appropriate search-and-rescue vessels to respond to  Edmund Fitzgerald &#39;s disaster,  [59] at approximately 9:00 p.m., the USCG asked  Arthur M. Anderson to turn around and look for survivors. Around 10:30 p.m., the USCG asked all commercial vessels anchored in or near Whitefish Bay to assist in the search.  [60] The initial search for survivors was carried out by  Arthur M. Anderson, and a second freighter,  SS  William Clay Ford. The efforts of a third freighter, the  Toronto-registered  SS  Hilda Marjanne, were foiled by the weather. The USCG sent a  buoy tender,   Woodrush, from Duluth, Minnesota, but it took two and a half hours to launch and a day to travel to the search area. The  Traverse City, Michigan, USCG station launched an  HU-16 fixed-wing search aircraft that arrived on the scene at 10:53 p.m. while an  HH-52 USCG helicopter with a 3.8-million- candlepower searchlight arrived at 1:00 a.m. on November 11.  [61]  Canadian Coast Guard aircraft joined the three-day search and the  Ontario Provincial Police established and maintained a beach patrol all along the eastern shore of Lake Superior.  [62]\n Although the search recovered debris, including lifeboats and rafts, none of the crew were found.  [63] On her final voyage,  Edmund Fitzgerald &#39;s crew of 29 consisted of the  captain, the  first,  second and  third mates, five  engineers, three  oilers, a cook, a  wiper, two maintenance men, three watchmen, three  deckhands, three  wheelsmen, two porters, a cadet and a  steward. Most of the crew were from Ohio and Wisconsin;  [64] their ages ranged from 20-year-old watchman Karl A. Peckol to Captain McSorley, 63 years old and planning his retirement.  [65]\n Edmund Fitzgerald is among the largest and best-known vessels lost on the Great Lakes  [66] but she is not alone on the Lake Superior seabed in that area. In the years between 1816, when  Invincible was lost, and 1975, when  Edmund Fitzgerald sank, the  Whitefish Point area had claimed at least 240 ships.  [67]\n    A U.S. Navy  Lockheed P-3 Orion aircraft, piloted by Lt. George Conner and equipped to detect  magnetic anomalies usually associated with submarines, found the wreck on November 14, 1975.  Edmund Fitzgerald lay about 15 miles (13 nmi; 24 km) west of Deadman&#39;s Cove, Ontario, 17 miles (15 nmi; 27 km) from the entrance to Whitefish Bay to the southeast, in Canadian waters close to the international boundary at a depth of 530 feet (160 m).  [50] A further November 14–16 survey by the USCG using a  side scan sonar revealed two large objects lying close together on the lake floor. The U.S. Navy also contracted Seaward, Inc., to conduct a second survey between November 22 and 25.  [68]\n  From May 20 to 28, 1976, the U.S. Navy dived on the wreck using its unmanned  submersible,  CURV-III, and found  Edmund Fitzgerald lying in two large pieces in 530 feet (160 m) of water. Navy estimates put the length of the bow section at 276 feet (84 m) and that of the stern section at 253 feet (77 m). The bow section stood upright in the mud, some 170 feet (52 m) from the stern section that lay capsized at a 50-degree angle from the bow. In between the two broken sections lay a large mass of taconite pell\n......", "posttime": "2020-11-10 20:09:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "今天,edmund,fitzgerald", "title": "埃德蒙·菲茨杰拉德号(45年前的今天沉没)", "title_en": "SS Edmund Fitzgerald (sank 45 years ago today)", "transed": 1, "url": "https://en.wikipedia.org/wiki/SS_Edmund_Fitzgerald", "via": "", "real_tags": ["今天", "edmund"]}, {"category": "", "categoryclass": "", "imagename": "ce20134e5de6cf2433f0ad4d26d1dc21.jpg", "infoid": 1034242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果一切按计划进行，2024年美国国家航空航天局将启动欧罗巴快艇计划，该计划旨在进行多次穿越，以研究这颗富含水分的卫星是否有可能存在生命。这项任务将面临的最大挑战是，任何液态水都很可能远远低于木卫二冰冷的表面。充其量，我们可以根据困在冰中的任何物质的成分，或者可能存在的间歇泉，将冰层内部的碎片释放到太空中，希望能看到一些迹象表明冰层正在发生什么。\n这使得理解可能存在的遥感类型变得至关重要。为此，美国国家航空航天局(NASA)的一些科学家研究了木星高辐射环境中冰的行为。科学家们发现，木卫二的冰很可能在黑暗中发光，这种发光可能携带了一些关于冰中存在什么的信息。\n让木卫二的冰光发光的机制有点像黑光海报所使用的机制。在那里，可见光以外的光激发分子，然后分子释放出我们能看到的波长的能量。在木卫二的情况下，激发能量不是来自光，而是间接由木星的磁场提供动力。这些磁场吸收行星本身(或其卫星之一)释放出的带电粒子，并对其进行加速。(木星高辐射区的大部分物质都被其卫星木卫一上的火山喷到了太空中。)。\n其中一些带电粒子将撞击木星的卫星，并将能量储存在木星表面的物质中。其中一些能量无疑会以光子的形式出现；问题是光子拥有什么能量，这将决定我们探测它们的难易程度。\n因此，美国宇航局的Murthy Gudipati和Brana Henderson和弗雷德·贝特曼在国家标准与技术研究所(National Institute Of Standards And Technology)聚在一起，他们做了任何其他能接触到合适玩具的人都会做的事情：他们把冰冻结到100开尔文(Kelvin)，并用电子轰击它。然后他们冷冻了里面的各种盐的组合，并试图看看这是否会改变什么。\n古迪帕蒂等人使用只含水的样本。确定在这些条件下，冰将在黑暗中以可见波长发光。虽然峰值位于蓝色和绿色波长的边缘，但它是一个非常宽的峰，在光谱的较红端有一个宽肩。这意味着样品发出的光芒看起来相当白。一旦辐射停止，光就会消失，如果电子辐射增加到更高的能量，光就会变得更强。\n与盐的对比主要表明，盐干扰了这种发光。但是盐并不能均匀地干扰它的所有部分。例如，硫酸钠会使光谱中较蓝的一端消失，而使红端略有增强。相比之下，氯化钠会导致整个光谱均匀下降。碳酸钠几乎可以消除除红外线以外的所有排放物。最大的例外是硫酸镁，它似乎增强了大部分光谱，特别是在绿色到红色的区域。\n盐分含量的这些差异表明，或许可以通过读取木卫二的发光来推断木卫二冰层(以及木卫二下方的海洋)的组成。\n作为第一步，研究人员查看了一些由地球上的望远镜拍摄的图像，其中包括木卫二无光的一面。不幸的是，这些图像主要是被辐射到稀薄气体中的光芒所主导，这些气体被木卫二的引力微弱地保持着。这对于从地球上成像来说是一个问题，但事实证明，辐射对欧罗巴快艇来说不是问题，它将在辐射源和月球表面之间进行一些轨道穿越。\n因此，这三名研究人员得到了欧罗巴快艇将携带的所有仪器的所有信息，他们试图估计欧罗巴快艇是否能探测到表面的夜光冰层。\n他们认为广角相机是最好的选择。虽然它的每像素分辨率相对较低(这意味着相机将很难将特定的构图与风景特征联系起来)，但代价是，Clipper将能够在每个像素收集更多光线。研究人员计算出，在给定环境中典型的辐射功率的情况下，木卫二上的一个区域应该产生多少光，以及其中有多少光子将到达相机。这相当于纯水冰每秒产生10万个光子，大约是木卫二轨道上辐射物质产生的光子的100倍。\n这是我们引入一大堆警告的时候。首先，相机切割器上的一些滤光片意味着，原本可以帮助确定成分的一些波长最终会集中在同一个数据框中。另一件事是，这些测试案例中的冰是由异常纯净的水制成的，里面只有一种盐。现实世界的木卫二可能会有不止一种盐存在，它可能会有一种复杂的有机物质混合物，统称为索林存在。因此，或许值得研究一下这些因素是否会以任何方式影响排放。\n作者们自己提到的最后一件事是，电子并不是唯一轰击冰层的东西。如上所述，许多被木星磁场移动的物质包括硫、氧和氢离子。这些可能会以不同的方式影响冰层，人们可能也想要探索。\n尽管如此，这项任务甚至在几年内都不会启动，所以现在有足够的时间开始解决这个问题。而且，当相机距离木卫二的黑暗面只有50公里的时候，可能很难拍摄到其他图像，所以收集我们想要分析的数据没有明显的坏处，即使我们还没有完全理清它可能告诉我们的信息。", "note_en": "If everything goes according to plan, 2024 will see NASA launch the Europa Clipper program, which is designed to make multiple passes to study the water-rich moon&#39;s potential to host life. The big challenge the mission will face is that any liquid water is likely to be far below Europa&#39;s icy surface. At best, we can hope for some indication of what&#39;s going on based on the composition of any material trapped in the ice itself or the possible  presence of geysers that release bits of its interior to space.\n That makes understanding the sorts of remote sensing that might be possible critical. And, to that end, some NASA scientists have looked into how ice behaves in Jupiter&#39;s high-radiation environment. The scientists found out that Europa&#39;s ice probably glows in the dark, and that glow may carry some information about what&#39;s present in the ice.\n  The mechanism that can make Europa&#39;s ice glow is a bit like what&#39;s used by a  black light poster. There, light outside of the visible wavelengths excites molecules that then release the energy at wavelengths we can see. In the case of Europa, the excitation energy doesn&#39;t come from light, but that energy is indirectly powered by Jupiter&#39;s magnetic fields. These fields pick up charged particles liberated by the planet itself (or one of its moons) and accelerate them. (Much of the material in Jupiter&#39;s high-radiation areas was expelled into space by volcanoes on its moon Io.)\n Some of these charged particles will strike Jupiter&#39;s moons and deposit energy in the material at their surface. Some of that energy will undoubtedly come out as photons; the question is what energy the photons have, which will determine how readily we can detect them.\n So, Murthy Gudipati and Bryana Henderson of NASA got together with Fred Bateman at the National Institute of Standards and Technology, and they did what anyone else with access to the right toys would do: they froze ice down to 100 Kelvin and bombarded it with electrons. And then they froze various combinations of salts in it and tried to see if that changed anything.\n  Using the water-only sample, Gudipati et al. determined that ice will glow in the dark at visible wavelengths under these conditions. While the peak is on the border of blue and green wavelengths, it&#39;s a very broad one with a wide shoulder on the redder end of the spectrum. That means the glow from the samples looks fairly white-ish. The light dies out as soon as the radiation is stopped, and it grows in intensity if the electron radiation is ramped up to higher energies.\n Comparing that to salts mostly showed that salts interfered with this glow. But salts didn&#39;t interfere with all parts of it evenly. For example, sodium sulfate causes the bluer end of the spectrum to drop out while enhancing the red end slightly. Sodium chloride, in contrast, causes the whole spectrum to drop evenly. Sodium carbonate pretty much eliminates all emissions except those near the infrared. The big exception was magnesium sulfate, which seemed to enhance most of the spectrum, especially in the green-to-red region.\n  These differences between the salt content suggests that it might be possible to infer things about the composition of Europa&#39;s ice (and thus the ocean beneath it) by reading its glow.\n As a first step, researchers look at some of the images made by Earth-based telescopes that include the unlit side of Europa. Unfortunately, these images are dominated by the glow of radiation slamming into the tenuous gasses that are held weakly by Europa&#39;s gravity. That&#39;s a problem for imaging from Earth, but it turns out that the radiation won&#39;t be a problem for the Europa Clipper, which will be making some orbital passes that take it between the source of this radiation and the moon&#39;s surface.\n So, the three researchers got all the information available on the instruments that the Europa Clipper will be carrying, and they tried to estimate whether the Clipper could pick up the glow-in-the-dark ices at the surface.\n They decided that the Wide Angle Camera was the best bet. While it has relatively poor resolution per pixel (meaning the camera will struggle to associate specific compositions to landscape features), the trade-off is that the Clipper will be able to gather more light in each pixel. The researchers calculate how much light an area on Europa should generate given the typical power of radiation in the environment and how many of those photons would reach the camera. This works out to be in the area of 100,000 photons a second for pure water ice, which is about 100 times higher than the photons produced by radiation striking material in Europa&#39;s orbit.\n This is when we introduce a whole bunch of caveats. For one, some of the filters on the camera cut mean that some wavelengths that could otherwise help determine composition will end up lumped together in the same data bin. The other thing is that the ice in these test cases is made from unusually pure water, with just a single salt in it. The real-world Europa will likely have more than one salt present, and it is likely to have a complicated mix of organic materials collectively called  tholins present. So, it&#39;s probably worth looking into whether these affect the emissions in any way.\n  The final thing, which the authors themselves mention, is that electrons are hardly the only things bombarding the ice. As mentioned above, a lot of the material being shifted around by Jupiter&#39;s magnetic field includes sulfur, oxygen, and hydrogen ions. Those might impact the ice in distinct ways, which people might also want to explore.\n Still, the mission isn&#39;t even expected to launch for a few years, so there&#39;s plenty of time to start sorting this out. And, since it could be difficult to image anything else when the camera is just 50 km above the dark side of Europa, there&#39;s no obvious harm in gathering the data we want to analyze, even if we don&#39;t quite have what it might tell us fully sorted out yet.", "posttime": "2020-11-10 19:55:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可能,glows,木卫二", "title": "木卫二可能会在黑暗中发光，这可能会告诉我们里面有什么", "title_en": "Europa probably glows in the dark, and that may tell us what’s in it", "transed": 1, "url": "https://arstechnica.com/science/2020/11/europa-probably-glows-in-the-dark-and-that-may-tell-us-whats-in-it/", "via": "", "real_tags": ["可能", "glows", "木卫二"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我为Godot4.0所做的复杂文本布局工作的第二部分，重点是字体和用户界面镜像。\n有关CTL建议和反馈的详细信息，请参见GitHub上的戈多-提案#1180、戈多-提案#1181、戈多-提案#1182和戈多-提案#1183。\n自从字体处理转移到TextServer后，Godot Font和相关类做了一些实质性的更改：\nBitmapFont、DynamicFont和DynamicFontData被移除，取而代之的是由TextServer支持的通用字体和字体数据资源。这为自定义文本服务器提供了更清晰的字体后备/替换，并且可以在不更改界面的情况下公开不同类型的字体，例如直接访问系统字体。\n新的Font类提供了绘制和测量多行文本以及应用对齐方式的新函数。\n字体和轮廓大小是Font实例的属性，它们被移到绘图函数和主题常量的参数中。这允许更改RichTextLabel控件中单个绘制调用、控件或文本跨度的字体大小，而无需创建新的Font实例。\n从内存缓冲区加载字体数据的函数向GDScript和GDNative公开。\n每个FontData都有一个支持的脚本(书写系统)和语言的关联列表。对于TrueType/OpenType字体，脚本列表是从OS2表自动填充的，但它并不总是精确的。\n对于具有特定脚本和语言的每个文本串，TextServer将尝试按以下顺序使用字体：\n许多拉丁字体在科学文本中只有一组有限的希腊字符(这些字体通常在OS2表格中设置了希腊文字支持标志)，但它并不总是足以显示希腊文本。添加完全支持希腊语的单独字体，并在主字体中禁用希腊语支持，将防止TextServer混合不同字体的字符。\nTrueType/OpenType字体表格没有稀有/古老文字(例如埃及象形文字)的标志，手动启用脚本支持将加快字体替换速度。\n一些语言使用相同的文字，但字体风格不同(例如，Kufic、Naskh和Nastaʼlīq书写风格首选用于书写不同的阿拉伯语；或者在不同地区使用繁体中文和中日韩变体-繁体中文、简体中文、日语和韩语)。通过设置语言覆盖，可以无缝地对不同语言的文本使用相同的字体堆栈，并获得所需的样式。\n用于&#34；μ&#34；的字体不正确：用于&#34；μ&#34；的字体正确：设置了Language属性的标签使用相同的字体实例：cjk变体，使用相同字体实例的标签：\n此外，新的字体和文本服务器的BiDi和Shape功能可以使用可变字体(有关可变字体支持PR，请参阅Godot#43030)：\n在Theme、Control和Window类中添加了控制字体大小的函数：\n主题函数：CLEAR_FONT_SIZE、GET_FONT_SIZE、GET_FONT_SIZE_LIST、HAS_FONT_SIZE、SET_FONT_SIZE以与现有字体函数类似的方式控制字体大小。特定值-1可用作取消设置/默认设置(与字体的NULL效果相同)。\n为了确保内容易于理解，从右到左的书面语言的用户界面应该从右到左排列。UI&34；镜像提供了一种方便的方式来实现这一点，而无需为RTL和LTR语言设计单独的接口。\n在大多数情况下，用户界面镜像应该自动发生，不需要用户执行任何操作，也不需要了解RTL编写系统。\n每个控件都有一个Layout_Direction属性来控制镜像。它可以设置为继承(使用与父控件相同的方向，与根控件的自动相同)、自动(方向根据当前区域设置确定)或强制设置为RTL或LTR。\n在上面的屏幕截图上，绿色和蓝色的指南针控件分别被强制为LTR和RTL布局，红色容器被设置为AUTO，而UI的其余部分使用继承的(默认设置)方向。\n映射子控件在容器中的水平顺序，以及树/项列表控件中的项。\n使用内部控件元素的镜像顺序(例如，OptionButton下拉按钮、复选框对齐、列表列顺序、树项目图标和连接线对齐等)，在某些情况下，镜像控件使用单独的主题样式。\nUnicode BiDi算法是为处理自然文本而设计的，它不能处理具有更高级别顺序的文本，如文件名、URI、电子邮件地址、正则表达式或源代码。\nSTRUCTED_TEXT_BIDI_OVERRIDE属性和_STRUCTED_TEXT_PARSER回调被添加到All Text控件以处理此问题。\n例如，上面屏幕截图中目录结构的路径将显示错误(顶行编辑控件)。文件类型结构化文本覆盖将文本分割成多个片段，然后分别对每个片段应用BiDi算法，以正确显示任何语言的目录名，并保留正确的文件夹顺序(底线编辑控件)。\n自定义回调提供了覆盖其他类型结构化文本的BiDi的方法。例如，下面的代码使用：作为分隔符拆分文本，对每个部分应用BiDi，并以相反的顺序显示它们。BiDi覆盖可以与任何控件一起使用，包括输入域(LineEdit、TextEdit)。\nFunc_Structed_text_parser(args，text)：var range=[]；var Offset=0，for t in text。Split(&#34；：&#34；)：var var text_Offset=Offset+t.long()，在文本范围内添加文本。Push_front(Vector2i(Offset，Text_Offset)#Add text for Text range。ush_front(Vector2i(Text_Offset，Text_Offset+1)#。\nLanguage属性(仅适用于带有文本的控件)：覆盖该节点的区域设置：控制特定于语言的换行规则、OpenType本地化形式、形状和字体替换。\nOpenType_Feature属性(仅适用于带有文本的控件)：控制节点的OpenType字体功能，例如要使用的连字类型、数字样式、小型大写等。(完整的标准标签列表，字体也可以有自定义功能)。\n用户界面镜像、字体、主题和控件更改：Godot#41100(提交5到8个，PR会定期调整基数以跟上上游的更改，确切的提交散列可能会有所不同)。\n下一部分将重点介绍对特定控件和RichTextLabel BBCode的更改。", "note_en": "This is the second part of my work on Complex Text Layouts for Godot 4.0, focusing on Fonts and UI mirroring.\n See  godot-proposals#1180,  godot-proposals#1181,  godot-proposals#1182, and  godot-proposals#1183 on GitHub for detailed information on  CTL proposals and feedback.\n   Since font handling was moved to  TextServer, some substantial changes were made to the Godot  Font and related classes:\n BitmapFont,  DynamicFont and  DynamicFontData were removed and replaced with universal  Font and  FontData resources which are backed by  TextServer. This provides cleaner font fallback/substitution and possibility for custom text servers to expose different types of fonts without interface changes, for example direct access to the system fonts.\n The new  Font class provides new functions to draw and measure multiline text, and apply alignment.\n Font and outline size, that were properties of the  Font instance, are moved to the arguments of the draw functions and theme constants. This allows changing font size for individual draw calls, controls, or spans of text in the  RichTextLabel control without creating new  Font instances.\n Functions for loading font data from the memory buffer are exposed to GDScript and GDNative.\n   Each  FontData has an associated list of supported scripts (writing systems) and languages. For a TrueType/OpenType fonts, a script list is populated automatically from the OS2 table, but it&#39;s not always precise.\n  For each run of text with a specific script and language,  TextServer will try to use fonts in the following order:\n  Many Latin fonts have a limited set of Greek characters for use in scientific texts (and such fonts usually have Greek script support flag set in the OS2 table), but it&#39;s not always enough to display Greek text. Adding a separate font with full Greek support, and disabling Greek support in the main font will prevent  TextServer from mixing characters form different fonts.\n TrueType/OpenType font tables do not have flags for rare/ancient scripts (e.g. Egyptian hieroglyphs), enabling script support manually will speed up font substitution.\n Some languages use the same script, but different font styles (e.g. Kufic, Naskh and Nastaʼlīq writing styles preferred for writing different Arabic languages; or the use of traditional Chinese characters in different regions and CJK variants - Traditional Chinese, Simplified Chinese, Japanese, and Korean). Setting language overrides allows to seamlessly use the same font stack for the text in different languages and get the desired style.\n Incorrect font used for &#34;μ&#34;:   Correct font used for &#34;μ&#34;:    Labels with  language property set, using the same  Font instance:   CJK variants,  Labels using same font instance:\n  Additionally, the new  Font and  TextServer&#39;s  BiDi and shaping features can work with variable fonts (see  godot#43030 for the variable font support PR):\n  Functions to control the font size were added to the  Theme,  Control, and  Window classes:\n Theme functions:  clear_font_size,  get_font_size,  get_font_size_list,  has_font_size,  set_font_size to control the font size in a similar manner to existing functions for  Font. The special value  -1 can be used as unset/default (have the same effect as  null for the font).\n  To ensure that the content is easy to understand, user interfaces for the right-to-left written languages should flow from right-to-left. UI &#34;mirroring&#34; provides a convenient way to achieve this without designing separate interfaces for the  RTL and  LTR languages.\n  In most cases, UI mirroring should happen automatically, and do not require any actions from the user or knowledge of the RTL writing systems.\n Each  Control has a  layout_direction property to control mirroring. It can be set to  inherited (use the same direction as the parent control, same as  auto for the root control),  auto (direction is determined based on the current locale), or forced to RTL or LTR.\n On the above screenshots, the green and blue &#34;compass&#34; controls are forced to LTR and RTL layout respectively, the red container is set to  auto and the rest of the UI uses  inherited (default setting) direction.\n  Mirror horizontal order of the child controls in the containers, and items in  Tree/ ItemList controls.\n Use mirrored order of the internal control elements (e.g.  OptionButton dropdown button, checkbox alignment,  List column order,  Tree item icons and connecting line alignment, etc.), in some cases mirrored controls use separate theme styles.\n  The Unicode  BiDi algorithm is designed to work with natural text and it&#39;s incapable of handling text with a higher level order, like file names, URIs, email addresses, regular expressions or source code.\n The  structured_text_bidi_override property and the  _structured_text_parser callback are added to the all text controls to handle this.\n  For example, the path for the directory structure in the above screenshot will be displayed incorrectly (top  LineEdit control). The  File type structured text override splits text into segments, then the BiDi algorithm is applied to each of them individually to correctly display directory names in any language and preserve correct order of the folders (bottom  LineEdit control).\n Custom callbacks provide a way to override BiDi for the other types of structured text. For example, the following code splits a text using  : as separator, applies BiDi to each part, and displays them in reversed order. The BiDi override can be used with any control, including input fields ( LineEdit,  TextEdit).\n func _structured_text_parser(args, text):    var ranges = []    var offset = 0    for t in text.split(&#34;:&#34;):        var text_offset = offset + t.length()        ranges.push_front(Vector2i(offset, text_offset) # Add text        ranges.push_front(Vector2i(text_offset, text_offset + 1)) # Add &#34;:&#34;        offset = text_offset + 1    return ranges\n   language property (only for controls with text):Overrides the locale for that node: controls language specific line breaking rules, OpenType localized form, shaping, and font substitution.\n  opentype_features property (only for controls with text):Controls OpenType font features for the node e.g. ligature types to use, number styles, small caps, etc. ( Full list of standard tags, fonts can have custom features as well).\n   UI mirroring, Font, Theme, and control changes:  godot#41100 (commits 5 to 8, the PR is regularly rebased to keep up with upstream changes, exact commit hashes may vary).\n    The next part will focus on the changes to the specific controls and  RichTextLabel BBCode.", "posttime": "2020-11-10 19:46:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,text,字体", "title": "Godot游戏引擎中复杂的文本布局进度报告", "title_en": "Complex text layouts progress report in Godot game engine", "transed": 1, "url": "https://godotengine.org/article/complex-text-layouts-progress-report-2", "via": "", "real_tags": ["游戏", "text", "字体"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创始人惠普(Hewlett&amp；Packard)在文化方面给我们(高科技企业的管理者)上了很好的一课。我甚至在我关于工程团队管理的令人敬畏的榜单中引用了他们的话。--👨‍💼。\n惠普公司(HP Inc.)糟糕透了。至少他们的打印机部门的商业模式是这样的。他们最近推出了固件更新，禁止第三方兼容的墨盒。--💔。\n2020年3月：全面封锁。🦠，我需要一间家庭办公室。科学家也是如此，她把时间花在打印论文以备审查上。给她买了一台惠普彩色激光喷气机M254dw，以保持她的工作流程(要么出版，要么灭亡！)。\n2020年11月：我的打印机自动升级。我很高兴看到这个供应问题的死亡屏幕：\n好的。这是我的疏忽。我应该花更多的钱购买经过认证的™设备。--😑。\n解决方案是回到事情运行得很好的时候，并降级到以前的固件。\n我们将从永远停止这种疯狂开始，并阻止打印机在我们背后下载固件。\n在控制面板中，转到设置&&gt;服务&&gt;LaserJet更新&&gt;管理更新：\n我很惊讶评级被允许下调。🤔这似乎不符合他的性格。因此，带着我的邪恶产品经理帽子，我建议惠普在每月的企业订阅Sort中将这一功能货币化。-😈。\n在那里，您将获得.rfu文件(远程固件更新)的直接链接：http://ftp.hp.com/pub/networking/software/pfirmware/HP_Color_LaserJet_Pro_M254_dw_Printer_series_20200612.rfu。\n以防它从原址消失，这里有一份HP_Color_LaserJet_Pro_M254_dw_Printer_series_20200612.rfu的副本。\n$lpstat-p-d打印机HP_Color_LaserJet_M254dw_0处于空闲状态。自Firi Nov 6 17：47：06 2020启用系统默认目标：HP_COLOR_LaserJet_M254dw_0。\n我不知道这里发生了什么，但似乎.rfu文件被推送到打印机的队列中，然后像任何其他可打印文档一样被使用。看，RFU文件格式是一个Matryoshka玩偶，其中嵌入了打印命令、编码数据和原始NAND代码。\n通过Setup&gt；Service&&gt;Firmware Datecode Menu(设置&&gt;服务&&gt;固件数据代码菜单)绕道确认我们正在运行以前的固件：\n在为本文做研究的过程中，我了解到了打印机开发工具包Pret。这是一个绝妙的工具，以一种恶毒的方式。它允许笔测试和黑客攻击，使用与固件更新相同的向量。-🤫。\n我以后可能会玩它。为了好玩，也是为了提高打印机的安全性。同时，我想密码是最低限度的。如果我的打印机被网络团伙绑架，我现在有办法恢复我的打印机固件！-😬", "note_en": "Hewlett   &amp;  Packard, the founders, had great lessons to teach us (managers in high-tech) about culture. I even   quoted them  in my   awesome list on engineering team management  . 👨‍💼\n  HP  Inc., the company, sucks. At least their printer division’s business model. They recently pushed a   firmware update to ban third-party compatible ink cartridges  . 💔\n    2020, March: general lockdown. 🦠 I need a home office.   SO  is a scientist and spend her time printing papers for review. Got her an     HP  Color LaserJet M254dw  to keep her productive workflow (   publish or perish!  ).\n    2020, November: my printer auto-upgrade. I’m welcomed with this   Supply Problem   Screen of Death   :\n        OK  . It’s my fault. I should have spent more money buying certified™ gear. 😑\n    The solution is to travel back in time when things were working just great, and downgrade to the previous firmware.\n    We will start by stopping this madness for good, and prevent the printer from downloading a firmware behind our back.\n  In the control panel, go to   Setup  &gt;   Service  &gt;   LaserJet Update  &gt;   Manage Updates  :\n        I’m quite surprised downgrades are allowed. 🤔 It seems out of character. Therefor, with my   Evil Product Manager  hat, I advise   HP  to monetize this feature under a monthly Enterprise Subscription of sort. 😈\n      There you’ll get a direct link to the   .rfu  file (Remote Firmware Update):     http://ftp.hp.com/pub/networking/software/pfirmware/HP_Color_LaserJet_Pro_M254_dw_Printer_series_20200612.rfu   .\n  And just in case it disappear from its original location, here is a   copy of   HP_Color_LaserJet_Pro_M254_dw_Printer_series_20200612.rfu   .\n          $ lpstat -p -d  printer HP_Color_LaserJet_M254dw_0 is idle. enabled since Fri Nov 6 17:47:06 2020  system default destination: HP_Color_LaserJet_M254dw_0\n        I don’t know what happens here but it seems the   .rfu  file is pushed to the printer’s queue and then gets consumed as any other printable document. See,   the   RFU  file format is a matryoshka doll  embedding printing commands, encoded data and raw   NAND  code.\n        A detour via   Setup  &gt;   Service  &gt;   Firmware Datecode  menu confirm we’re running the the previous firmware:\n      In my research for this article, I found out about     PRET  , a printer exploitation toolkit  . It’s a brilliant tool, in a malignant way. It allows for pen-testing and hacking, using the same vectors as the firmware update. 🤫\n  I’ll probably play with it in the future. For fun, but also to try enhance the security of the printer. In the mean time, I guess a password is the bare minimum. And if my printer get kidnapped by a cyber gang, I now have a way to restore my printer’s firmware! 😬", "posttime": "2020-11-10 19:46:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,打印机,ink", "title": "HP打印机固件升级禁止第三方墨盒", "title_en": "HP printer firmware upgrade ban 3rd-party ink cartridges", "transed": 1, "url": "https://kevin.deldycke.com/2020/11/revert-hp-printer-ban-on-third-party-ink-cartridges/", "via": "", "real_tags": ["打印", "打印机", "ink"]}, {"category": "", "categoryclass": "", "imagename": "e423f5f3553289bec9057dae1c601eb3.jpg", "infoid": 1034238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着保守派人士在美国大选后蜂拥至这款自封的言论自由应用，Twitter Alternative Parker成为美国下载量最大的应用。\n在此之前，Twitter和Facebook最近几天对选举错误信息的传播进行了打击。\n该服务的所有者丹·邦吉诺(Dan Bongino)表示，周日，该服务每分钟的用户数量增加了数千英镑。\n一些人报告说，在服务器试图应对大量涌入的情况下，注册出现了问题，应用程序的运行速度变慢了。\nParler创始人约翰·马茨(John Matze)表示，该应用程序在一天内增加了200万新用户，周末期间其日活跃用户增加了四倍。\n尽管特朗普本人不是用户，但在今年早些时候的增长之后，该平台已经有几位知名贡献者。\n德克萨斯州参议员特德·克鲁兹在该平台上拥有260万粉丝，而福克斯新闻的主持人马克·莱文和肖恩·汉尼蒂各有200多万粉丝。\n与此同时，倾向于保守派的新闻媒体Newsmax也在排行榜上爬升至接近榜首的位置。\nParler于2018年推出，事实证明，它在特朗普的支持者和右翼保守派中特别受欢迎。这类团体经常指责Twitter和Facebook不公平地审查他们的观点。\n它是少数几家初创社交网络之一，比如Mewe或Gab，它们试图吸引最大平台上心怀不满的用户。\n特朗普一直是Twitter上最直言不讳的批评者之一，在选举期间，他的许多推文都被隐藏起来，并被贴上了误导性的标签。\n这款应用以法语动词命名，功能与Twitter非常相似。帖子可以用评论来回复，以类似于转发的方式回响，并且可以获得好评，而不是点赞。\n然而，帕勒确实禁止了一些东西，包括色情、暴力威胁和支持恐怖主义。\n在乔·拜登(Joe Biden)预计将在总统大选中获胜，以及特朗普未经证实的舞弊指控之后，许多保守派人士相互鼓励离开Twitter和Facebook，转而与人谈判。\n在Facebook上，有数千名成员的多个活动和小组正在鼓励从11月13日星期五开始从Facebook大规模退出谈判者。\n左倾推特用户嘲笑这一计划中的外逃是为了逃离一个没有挑战和批评的安全空间。\n对内容审核的轻描淡写意味着，与那些规则更严格的平台相比，虚假信息更容易在平台上传播。\n第一次右翼用户从主要社交网络转向谈判者的大规模迁移发生在6月份，此前一些发布关于新冠肺炎和乔治·弗洛伊德(George Floyd)抗议活动的误导性内容的账户在较大的社交媒体网站上被封。\n在Facebook、Instagram和YouTube于10月初对QAnon阴谋论采取全面行动后，数千名QAnon阴谋论的支持者在过去几周加入了进来。追随者认为，特朗普总统正在对崇拜撒旦的恋童癖精英发动一场秘密战争。\nFacebook对宣扬暴力的组织的禁令也迫使骄傲男孩和Boogaloo Bois等组织在谈判桌上重建。\n然而，像parler这样的平台已经成为相对有限的志同道合的用户的回音室。这就是为什么许多迁移到parler的用户反复尝试创建新账户以重返主流网络的原因--因为他们知道，他们的内容在这一点上可以获得广泛的吸引力。\n虽然parler上发布的内容通常不像Gab和Mewe等其他自称言论自由的平台那样极端，但它是许多帖子的发源地，这些帖子要么被标记为误导性，要么被主要平台删除--话题包括选举、新冠肺炎、拐卖儿童和疫苗。\n参议员克鲁兹最近在国会委员会听证会上猛烈抨击推特老板杰克·多尔西，他在6月份表示，他之所以加入Parler，是因为社交网络利用他们的权力让保守派保持沉默，并推动他们激进的左翼议程。\n周日，莱文在Twitter上鼓励他的追随者赶紧加入讨论小组，因为如果他们继续审查我，我可能就不会留在Facebook或Twitter了。\n有多少特朗普核心选民现在会认为福克斯太左翼，Twitter或Facebook太受控制？他说。\n即使人数众多，这些人会坚持下去吗？或者主流网络的规模效应会把他们拉回来吗？", "note_en": "Twitter alternative Parler has become the most-downloaded app in the United States as conservatives flock to the self-styled &#34;free speech&#34; app after the US election.\n It follows a clampdown on the spread of election misinformation by Twitter and Facebook in recent days.\n Owner Dan Bongino said the service was adding &#34;thousands to users per minute&#34; on Sunday.\n  Some reported problems registering and a slowdown of the app as its servers attempted to deal with the influx.\n Parler founder John Matze said the app had added two million new users in a day, and increased its daily active users four-fold over the weekend.\n   While Mr Trump himself is not a user, the platform already features several high-profile contributors following earlier bursts of growth this year.\n Texas Senator Ted Cruz boasts 2.6 million followers on the platform, while Fox News hosts Mark Levin and Sean Hannity each have more than two million.\n Newsmax, a conservative-leaning news outlet, also crept near the top of the charts at the same time.\n  Launched in 2018, Parler has proved particularly popular among Trump supporters and right-wing conservatives. Such groups have frequently accused Twitter and Facebook of unfairly censoring their views.\n It is one of a handful of start-up social networks - such as MeWe or Gab - trying to appeal to disgruntled users of the biggest platforms.\n  Mr Trump has been among Twitter&#39;s most vocal critics and has seen  many of his tweets hidden and labelled as misleading during the election period.\n Named after the French verb &#34;to speak&#34;, the app has very similar functions to Twitter. Posts can be replied to with comments, &#34;echoed&#34; in a way similar to retweeting, and upvoted instead of liked.\n   Parler does, however, ban some things, including pornography, threats of violence, and support for terrorism.\n  Following Joe Biden&#39;s projected win in the presidential election - and Mr Trump&#39;s unsubstantiated claims of fraud - many conservatives encouraged each other to leave Twitter and Facebook for Parler.\n On Facebook, multiple events and groups with thousands of members are encouraging a &#34;mass exit&#34; from Facebook to Parler from Friday 13 November.\n The planned exodus has been mocked by left-leaning Twitter users as an escape to a &#34;safe space&#34; devoid of challenge or criticism.\n The light-touch approach to content moderation means that misinformation can spread more easily on the platform than on those with stricter rules.\n    The first &#34;mass migration&#34; of right-wing users from major social networks to Parler happened in June, after a number of accounts that posted misleading content about Covid-19 and George Floyd protests got banned from the bigger social media sites.\n Thousands of supporters of the QAnon conspiracy theory have joined in in the last few weeks, after Facebook, Instagram and YouTube took sweeping action against them in early October. Followers believe President Trump is waging a secret war against a &#34;deep state&#34; elite of Satan-worshipping paedophiles.\n Facebook&#39;s ban on organisations that promote violence has also forced groups such as the Proud Boys and Boogaloo Bois to rebuild on Parler.\n  However, platforms like Parler have become an echo-chamber for a relatively limited group of like-minded users. That&#39;s why many users who have migrated to Parler make repeated attempts to create new accounts to return to major networks - as they know that&#39;s where their content can get widespread traction.\n While the content posted on Parler is usually not as extreme as other self-proclaimed &#34;free speech&#34; platforms like Gab and MeWe, it is the home of many posts that would either be flagged as misleading or removed by major platforms - on topics like the election, Covid-19, child trafficking and vaccines.\n  Senator Cruz,  who recently lambasted Twitter boss Jack Dorsey at a congressional committee hearing,  said in June that he had joined Parler because social networks use their power &#34;to silence conservatives and promote their radical left-wing agenda&#34;.\n  Tweeting on Sunday, Mr Levin encouraged his followers to &#34;hurry&#34; and join Parler because &#34;I may not stay at Facebook or Twitter if they continue censoring me&#34;.\n  &#34;How many core Trump voters will now think that Fox is too left-wing and Twitter or Facebook too controlled?&#34; he said.\n &#34;And even if that&#39;s a lot of people, will these stick - or will the scale effect of the mainstream networks pull them back?&#34;", "posttime": "2020-11-10 19:25:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,另类,single", "title": "推特另类谈话者在一天内增加了200万用户", "title_en": "Twitter alternative Parler adds 2M users in a single day", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-54873800", "via": "", "real_tags": ["推特", "另类", "single"]}, {"category": "", "categoryclass": "", "imagename": "8aa7f19929bb3b39c711156b5ec670af.jpg", "infoid": 1034235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数播客的付费墙解决方案都相当笨重或有限。这就是为什么Acast去年推出了一项技术，允许出版商发布付费剧集，听众可以在任何播客应用程序上观看。\n与此同时，Patreon已经支持创建仅限赞助人使用的RSS订阅源，该公司创作者Success总监布莱恩·凯勒(Brian Keller)表示，“独家内容是播客(Podcaster)能为其会员提供的最大、最有效的好处。”\n尽管如此，他说Patreon上的许多播客都在寻求更好的解决方案，这就是Acast合作的用武之地。\n通过整合，播客可以在他们的公共播客节目笔记中链接到他们的Patreon账户。如果有人点击了链接，而他们还不是赞助人，他们就可以注册。如果他们是赞助人，他们的会员级别将被认证，他们将被引导到一个收听体验，允许他们通过自己选择的播客应用程序订阅一个订阅源，该订阅源结合了他们应该获得的任何赞助者专用内容，以及公共订阅源中包括的所有免费内容。\n因此，从顾客/听众的体验来看，你应该只需要注册一次，然后你就可以不需要任何额外的工作就可以获得你的优质剧集。与此同时，播客可以在一个仪表盘上管理他们的公共和私人订阅源，同时还可以从Acast获得详细的听众数据。\nAcast的首席战略和商务官Leandro Saucedo指出，这些公司并没有强迫任何Patreon的创造者走这条路。他们仍然可以使用他们以前使用的任何平台或工具来分发他们的播客。\n索塞多说：“有了这种合作关系，我们希望使用率会尽可能高，但我们不会强迫任何人这样做。”\n同时，他建议任何转向Acast的播客都应该有一个无缝的迁移过程，而不需要任何听众订阅新的订阅源。\nPatreon和Acast已经在测试这种与精选播客的集成，包括《与我共眠》和《90天同性恋者》。\n“我喜欢Acast的整合！”《与我共眠》的德鲁·阿克曼在一份声明中说。“这些分析让我知道顾客正在收听这些内容，并让我清楚地了解他们到底在消费什么，以及他们是如何消费这些内容的。”顾客建立起来安全又容易，而且只有一个链接可以分享，这让听众很容易找到内容，并为我们的会员带来了新的赞助人！“(译者注：这句话的意思是：”只有一个链接可以分享，这让听众很容易找到内容，并为我们的会员带来新的顾客！“", "note_en": "Most paywall solutions for podcasts are pretty clunky or limited. That’s why  Acast launched technology last year that allows publishers to release paywalled episodes that listeners can access on any podcast app.\n Patreon,   meanwhile, already supports the creation of a patron-only RSS feed, and Brian Keller, the company’s director of creator success said that “exclusive content is the biggest and most effective benefit that [podcasters] can offer to their members.”\n  Still, he said that many of the podcasters on Patreon are asking for a better solution, which is where the  Acast   partnership comes in.\n Through  the integration, a podcaster can link to their Patreon account in their public podcast show notes. If someone clicks on the link and they aren’t already a patron, they can sign up. If they are a patron, their membership level will be authenticated and they’ll be directed to a listening experience allows them to subscribe, via the podcast app of their choice, to a feed that combines whatever patron-only content they should have access to, plus all the free content included in the public feed.\n  So from the patron/listener experience, you should only need to sign up once, then you’ll can get your premium episodes without any extra work. The podcaster, meanwhile, can manage their public and private feeds from a single dashboard, while also getting access to detailed listener data from Acast.\n Leandro Saucedo, Acast’s chief strategy and business officer, noted that the companies aren’t forcing any Patreon creators to go down this route. They can still distribute their podcasts with whatever platform or tool they were using before.\n “With this partnership in place, we hope that usage will be high as possible, but we’re not forcing anybody into it,” Saucedo said.\n At the same time, he suggested that there should be a seamless migration process for any podcasters making the switch to Acast, without requiring any listeners to subscribe to a new feed.\n Patreon and Acast have already been beta testing this integration with select podcasts, including   Sleep With Me and  90 Day Gays.\n “I love the  Acast integration!” said Sleep With Me’s Drew Ackerman in a statement. “The analytics let me know that patrons are listening to the content and give me clear insight into exactly what and how they’re consuming it. It’s secure and easy for patrons to get set up, and the fact that there is only one link to share makes it simple for listeners to find the content and brings new patrons to our membership!”", "posttime": "2020-11-10 19:08:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,acast", "title": "\nPatreon和Acast合作伙伴提供仅限赞助人的播客分发", "title_en": "\n\t\t\t\tPatreon and Acast partner for patron-only podcast distribution\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/10/patreon-and-acast-partner-for-patron-only-podcast-distribution/", "via": "", "real_tags": ["播客", "acast"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "固态激光器是一种奇特的物种。它是第一个被发现的\r在所有的激光中。但是后来他们发现了许多其他的激光器，这些激光器具有更高的\r效率，更高的平均功率和更有用的波长。光束\r固体激光器的发散性略好于半导体激光器。\r激光或液体激光器，但比大多数气体激光器或光纤激光器更差。\r无论是价格还是设计的简单性都不能区分坚固的\r积极意义上的状态激光。(是的，如果您已经有激光晶体和\r激光灯，把它们放在一起并用铝包起来很简单\r陪衬。但是晶体需要生长和加工，并且要有一盏好的激光灯。\r并不比气体激光管简单。)。\n然而，这两种激光都不能把SSL挤出来。\r为什么它们这么有用？因为固体激光是最直接的\r获得非常短而强大的光脉冲。这种脉冲通常被称为巨型脉冲，其产生过程被称为调Q。\r由于上激光能级的寿命相对较长，以及由于\r在泵浦机构中没有瓶颈，固态激光器\r&#34；累计&#34；类型。这意味着如果一个人强迫激光不点火\r在一定时间之前，能量可以在激光材料中积累，\r然后，当一个人让激光振荡时，它可以在非常短的时间内发射出来。\r做爱。通常是10..20纳秒。\n它能给我们带来什么？所以强大的光很容易转化为光\r其他波长。例如，http://www.milankarakas.org/pub/KDP/HomegrownKDP.html教授如何使用\r国产晶体将看不见的钕激光转化为\r清晰可见的绿灯。\n当聚焦时，强大的激光脉冲可能会损坏\r一块完全透明的玻璃--这一现象被用来在内部进行3D绘制。\r透明的玻璃块。是的，激光火花，我们都很喜欢，\r也需要短而强大的激光脉冲。\n兆瓦固体激光器是一种小型设备(1 mW=20mJ/20 ns)，由\r一根细铅笔大小的激光棒，一盏同样大小的灯，一个Q开关\r还有一个带有谐振镜的框架。它的电源允许使用\r电解电容器，因此也可以很小。关键要素是\r获得高功率是调Q开关。直到某一时刻\r通过阻止光在两个光之间自由传播来保持谐振器关闭\r镜子。然后它立即打开，为雪崩让路，就像\r光放大过程。\nQ开关可以是无源类型和有源类型。主动Q开关由外部控制力驱动。主要是他们\r可以是电光、机械和声光的。机械式的\r(带转镜或棱镜)需要带软盘的异国高速电机\r动议。非光学的需要非常复杂的控制电路。控制\r电光Q开关的电路要简单得多，但是\r这种类型的开关利用偏振旋转和激光的效应\r需要在谐振器中安装一个偏振器。偏振器必须能够抵抗光学损伤，并且必须针对所需的波长进行设计。这很奇怪，但人们可以很容易地在&lt；e6@y&gt；上找到Pockel电池(很难说它便宜，但仍然可以买到。)。但几乎没有机会在那里得到所需的偏振器。还存在利用破碎的全内反射效应的Q开关。然而，它们的生产需要将光学部件精细地装配在一起--这是你最可能想要避免的步骤。\n对DIYer来说，做一个被动调Q更简单。那扇门会自动打开\r当谐振器中的光开始增强时(例如，当微弱的自由振荡开始时)。被动Q开关通常是由所谓的光致材料制成的，这种材料的透明度随着偶然光线的强度而增加。它可能是一些染料、某些半导体、掺杂玻璃或晶体。\n被动调Q染料很少见。他们用来做红宝石激光的那些\r最不为人所知的名字--例如氯铝酞菁。调Q用染料\r钕激光器的数量主要是通过它们的数量而为人所知的。在红宝石激光调Q的固体介质中，存在一种KS-19玻璃和\r对于钕激光器，存在四价掺杂的铝钇石榴石。\r铬。这些对专业人士来说是众所周知的，但仍然很难获得。\r为DIYER准备的。\n有没有更实惠的东西？\r是。人们发现，有几种调Q方案可以\r完全是用容易获得的材料建造的。在第一个订单中\r这些谐振器通过改变它们的稳定性来改变它们的损耗。\r因数(基于自聚焦现象)，改变损耗的谐振器\rWafefront反转反射和一个更有趣的方案，该方案基于\r恢复全内反射现象。此外，还发现，\r对于红宝石激光，可以使用一种常见的医用防腐染料亮绿色。\r对于调Q取得了一定的成功。不过，让我们继续讨论这个问题吧。\nA)红宝石激光器。该激光器是用一台老式激光器的半椭圆形泵浦腔组装而成的。\r商用激光。红宝石棒直径6 mm，长75 mm。它是粉红色的。\r鲁比。灯具为FXQ-1302，氙气充气，灯管内径为4毫米的二氧化硅灯管。\r直径，外径6毫米，电极间距75毫米。\n泵浦腔被放置在由两个扁平介质形成谐振器中\r从DVD刻录机磁头获得的镜子。一面具有不可阻挡的透射性的镜子\r背面选用红色光谱，反射镜约占30%。\r红色的传输被认为是最前面的。\n灯具由自制的基于六电的电源供电。\r1000mcf x 450V电容器，连接到具有\r总容量为1500 mcf。馈电回路如图2.1所示。\n图2.1。红宝石激光馈电电路。《变形金刚1》是一部商业广告。\r闪光灯点火变压器。另一种方法可以缠绕在铁氧体上。\r直径6毫米，长30毫米，磁导率400的棒材。\r在这种情况下，二次绕组应包含360圈漆包线。\r0.1毫米的导线，分3层，中间有很强的绝缘性。初级\r缠绕在副线上方，包含4圈钢丝。SG1\r是具有触发功能的NSR或GDT类型的避雷器火花隙\r电压为470伏。可以使用具有其他触发功能的放电器\r电压，但需要重新计算R5：R6分压。\n当存储体上的电压达到770V时，火花间隙SG1\r触发并点燃激发激光的手电筒。充电电压受到火花隙点火的限制。但是，由于电解电容器的泄漏电流很大，当每个电容器的电压接近400V时，泄漏电流就会大大增加，所以不能将其提高到更高的水平。因此，能量累积到手电筒触发的那一刻。\r是440焦耳。激光器的设计如图2.2所示。闪光管点火脉冲直接作用在泵腔的金属体上。\n在自由运行模式(无Q开关)下，输出能量达到\r大约1焦耳。它是用古老的激光家的方法--数字--来测量的\r可被聚焦光束穿透的刀片的数量相等\r以焦耳为单位的能量。\nB)掺钕石榴石激光器。用的是掺钕的铝钇石榴石晶体。\r(YAG：Nd)，直径8 mm，长度110 mm。手电筒是一种\r本网站已经介绍过的航空信号频闪管\r在一个专门介绍染料激光的栏目中。手电筒是充氙气的\r内径8毫米，外径10毫米，电极间距110毫米。\n泵腔完全是自制的-灯和杆被包裹在一起。\r由抛光的厚铜箔制成。原则上，人们可以获得工作的激光器\r使用普通的厨房铝箔，但这是糟糕的方式。铝材\r普通(最多1400万厘米)厚度的铝箔会碎成碎片\r灯闪了几下就会落下灰尘。从外面看，它看起来像是渐进式的。\r以及令人费解的脉搏间输出能量的下降。\n后镜采用介质镀膜，在1064 nm处的反射率超过90%。\r这种镜子很容易在互联网上买到。输出耦合器\r是由两张显微镜盖片拼在一起并粘在一起形成的\r用胶枪(热胶)绕过他们的周界。\n馈电回路类似于红宝石激光器的馈电回路(见图2.1)。\r但使用的是单一纸质金属KBG-M电容器，而不是一组电解液\r一个。它的电压为100mcf x 2000V。充电电压也是2千伏。闪光灯\r点火脉冲可以直接放在泵腔的包覆箔上。\n所使用的激光晶体具有楔形端面和研磨的侧面。\r这会带来额外的损失，并使对齐变得更加困难，但它允许\r在不启动激光的情况下，在较高的激光能级上积累更多的能量\r从杆子末端反射出来的光。此外，杆子上有大量狭窄的\r它的一张脸上有划痕(毛发稀疏的划痕)，但它不能防止\r并且在所获得的功率水平上不会引起光学损伤。\n谐振器的长度为45厘米，这使得激光器不会那么小。\r就像它可能的那样，但允许通过插入透镜来折磨谐振器，\r任何类型的过滤器、试管和针孔。激光的照片如图所示\r见图2.3。\n图2.4。钕激光器的电源电路。变压器TR1和火花隙SG1的参数类似于图2.1所示。\n获取信息的最直接方式，也就是说已经发生了Q切换，就是使用快速光电二极管和示波器。如果反之亦然\r与示波器的通带宽度相比，示波器的通带宽值较小\r脉冲的预期持续时间，可以记录脉冲的时间形状\r并测量它的宽度。如果没有-一个人只能记录存在的事实\r宽度小于示波器分辨率的峰值。\n例如，对于20 ns脉冲宽度的测量，需要一个装置\r具有150 MHz带宽。但如果只需要检测到\r出现巨大脉冲时，可以使用带宽只有几个的示波器\r兆赫。因为有用的信号是单一的(或以很长的周期重复)，所以需要有存储型示波器。或者是数码的。在过去的一段时间里\r第一种情况不仅需要注意带宽，还需要注意\r采样率，通常以每秒千兆采样(GSA/s)或\r单位：兆样/秒(msa/s)。样本之间的时间间隔(采样率的反向值)也应该至少比您要观察的过程的持续时间短几倍。要测量巨型脉冲的宽度，需要不低于200msa/s。如果你只想检测脉冲，你只需要几msa/s。\n能够快速分辨巨脉冲形状的示波器是一种稀有而昂贵的设备。DIYer通常买不起这样的设备。因此，让我们假设这个方法只允许检测\r巨脉冲的存在和巨脉冲数的计算\r是在一次闪光灯爆裂期间产生的。(与激光不同\r在主动调Q的情况下，被动调Q经常会产生\r一个脉冲串中有几个脉冲。脉冲数越高，情况越差。\r因为每个脉冲都有较低的峰值功率。)。在这种测量过程中，\r我几乎不担心饱和-使光电二极管过载并驱动\r它深入到了非线性领域。图3.1。演示如何使用光电二极管。\n图3.1。显示光电二极管用于测量的采样电路。\rR1和C3应尽可能靠近光电二极管。C3\r是陶瓷圆盘型或SMD型电容器。R1-是镀金属电阻器。\r两者都应该是低ESL类型。C2是陶瓷高频电容器。C1可以\r保持电解性。与示波器的连接应由\r特性阻抗为50欧姆的同轴电缆。如果没有风险的话\r在光电二极管的长功率光曝光的情况下，R2电阻器可以是\r缺席。在这种情况下，将电池直接连接到缓冲电容器。\n第二种广为人知(但几乎没有在文献中描述)方法\r是激光光斑在卤化银感光材料表面的对准。\r它可以是照相胶片、照相底片或相纸。光材料应该是\r曝光的但没有显影的。它还需要激光波长长于光材料的护照红边。否则就会\r将很难区分巨型脉冲和自由运行模式。\n该方法是基于高强度激光辐射下的多光子吸收。它会产生与材料曝光时波长比实际短的光线类似的变黑现象。(工业和信息化部电子科学技术情报研究所陈皓)。大多数黑白感光材料对蓝绿色很敏感。\r光谱范围广，适用于钕和稀土元素的配准。\r红宝石激光斑点。绿色和蓝色激光能有效地使感光乳剂变黑。\r即使在连续波浪模式下也是如此。另一方面，TEA CO_2激光器不能提供\r即使在功率如此之高的情况下，光材料的表面也会变黑\r被明亮的激光等离子体完全覆盖。有些彩色胶片有感光度。\r覆盖694纳米的范围。它们在自由运转的红宝石激光下会变黑\r斑点。\n通常，在曝光和未显影的感光材料上识别巨星斑点并不困难。自由运转的激光辐射\r要么根本不会产生黑斑，要么(在高能量密度下)\r形成烧焦和/或流动的表面。中等强度调Q激光辐射\r能量密度以黑斑的形式打印出来，没有\r任何燃烧或融化的痕迹。在高能量密度下，\r燃烧肯定会出现，但在有疑问的情况下，它是可以解决的。\r通过减少光材料上的能量负载。例如，将\r胶片距离激光更远，光斑会更宽，这是因为\r自然的分化。图3.2显示了上的黑点示例\r一种由调Q钕激光产生的照相胶片。\n该方法简单有效。它可以让用户快速了解激光是否发出巨大脉冲。它还允许对输出能量做出粗略的估计。然而，这种方法永远不会让你想到，你的激光每个脉冲都会产生几个脉冲，而不是一个脉冲，正因为这个事实，即使总能量很大，你也不能获得激光火花。此外，数码照片的普及使得获取卤化银光材料变得越来越困难。\r它可以达到这一点，当它将成为现实，为其制定指南\r在家里做照相底片。\n另一种有用的现象是空气击穿和介质击穿。\r如果你在你的激光聚焦光束中观察到一个激光火花，那就是\r显然，这种Q转换已经发生了。根据[1]的分类\r具有波长的激光辐射下大气压下的空气\r当功率密度大于W0=300GW/平方厘米时，产生约100万立方米的能量。\r如果你不能抵抗高误差，它允许估计你的激光器的输出功率W：\nθ是激光的发散度，以弧度为单位，f-是焦距\r以厘米为单位的聚焦镜头。\n例如，假设光束在1米处发散1毫米。这意味着发散度是1mrad。让我们假设当激光与焦距为1厘米的镜头一起使用时会产生火花。然后：\n如果我们假设脉冲宽度为10 ns，输出能量似乎为\r最小为235kW*10 ns=2.35兆焦耳。\n如果你的激光束聚焦到一块透明的玻璃砖上，然后留在那里\r一道以白星形式出现的光学损伤，可以说威力\r电平高到足以说明Q-Switchng确实发生了。\r然而，对于定量估计，这种方法的使用率较低。因为玻璃的类型和质量不同，损坏的强度也会有很大的不同。一\r应该记住，有机玻璃和透明塑料很容易\r在它们的体积内被自由运转的激光辐射打破。所以\r这些材料不适合这些测试。\n图4.1。基于腔内自聚焦的调Q方案。\r1-谐振器后镜，2-密封试管，3-工作\r液体，带灯和激光棒的4泵浦腔体，5输出耦合器，\r6度镜头，7度镜头。\n类似的方案早些时候发表在文献[2]中，像往常一样，只给出了方案的想法，并且只对最好的结果做了简要的描述。不出所料，所有故障处理细节都被省略了。只是在那里说，当镜片被放置在与高激光门槛相对应的位置时，\r发生了调Q过程。当镜头设置为较低的激光阈值时，没有Q开关效应。这项工作的另一个事实是，在几十个脉冲之后，试管就被摧毁了。也没有任何关于如何选择镜片位置细节，这与高门槛和好的镜片位置相对应\rQ开关，也没有任何关于对准困难的信息。工作[3]中实施了另一个类似的方案，\r但作者指出，引起Q开关的主要现象是液体中的动态反射全息图，也就是说：SBS镜。这篇文章也不包含关于效果稳定性的信息。\r或对齐困难。\n他们制作了一套试管，它们的端壁都是镜片。选择这种设计是为了避免光束狭窄处附近的玻璃墙出现光学损伤的风险。真的，在实验期间(超过百分之一\r每个试管的脉冲)没有观察到损坏。试管有(D)\r放大比例为1：1，即前后镜片焦距相同\r长度。焦距紧随其后：\n需要特别注意的是，当透镜的一侧被空气包围，另一侧被异丙醇包围时，焦距是从液体一侧测量的。当镜片变干或完全浸入液体中时，镜片的焦距会完全不同。\n以异丙醇和汽油为工质。水也是\r试用过，但没有任何明显的Q开关。\n一些成功工作的Q开关是用固定透镜间距的试管制成的，但它对材料加工的精度要求太高，特别是对短FL透镜。更好的结果\r当试管由两个螺纹部分(管)拧紧时得到\r一个接一个。这使得调整镜头之间的间距成为可能。\r螺纹连接通过添加氟塑料丝带而变得紧密。\n用圆珠笔笔身的部件制成的小圆珠笔是坚固耐用的。更大的试管是用下水道/水管和配件制成的。用热胶(胶枪、黑色棒)粘合用于等差分切盘的镜片。\n.", "note_en": "Solid State laser is a curious specie. It was the first to be discovered \r\t\t among all lasers. But then they discovered many other lasers, that have higher\r\t\t efficiency, higher average power and more usefull wavelengthes. The beam \r\t\t divergency of the solid state laser is a bit better than one of semiconductor \r\t\t lasers or liquid ones, but worse than one for most gas lasers or fiber lasers.\r\t\t Neither price nor the simplicity of the design do distinguish the solid \r\t\t state lasers in a positive sense. (Yes if You already have laser crystal and \r\t\t laser lamp, it is very simple to put them together and wrap with an aluminium \r\t\t foil. But the crystal need to be grown and processed, and a good laser lamp\r\t is not simplier than a gas laser tube.)\n  And nevertheless neither type of lasers was able to squeeze the SSL&#39;s out.\r\t\t Why are they so usefull? Because solid state laser is the most direct way to \r\t\t get very short and powerfull pulses of light. Such pulses are often called as &#34;giant pulses&#34; and the process of their production is called &#34;q-switching&#34;.\rDue to comparatively long lifetime of the upper laser level and due to the \rabsence of bottlenecks in the pumping mechanism the solid state lasers are\rof &#34;accumulative&#34; type. It means that if one forces the laser not to light  \rbefore certain time, the energy can be accumulated in the laser material and\rthen, when one lets the laser to oscillate, it can be emitted during a very\rshort time. 10..20 nanoseconds usually.\n  What it gives? So powerfull light is easy to be transformed into light of \r\t\t other wavelength. E.g.  http://www.milankarakas.org/pub/KDP/HomegrownKDP.html teaches how to use a \r\t\t homegrown crystal to transform the invisible light of neodymium laser into \r\t well visible green light.\n      When focused the powerfull laser pulse can damage\r\t\t a completely transparent glass - this phenomena is used for 3D-drawing inside\r\t\t transparent blocks of glass. And, yes, the laser spark, we all love so much, \r\t\t does also require short and powerfull laser pulses.\n  A megawatt solid state laser is a small device (1 MW=20mJ/20ns) consisting \r\t\t of a laser rod as small as a thin pencil, a lamp of the same size, a q-switch\r\t\t and a frame with resonator mirrors. Its power supply allows to use of \r\t\t electrolytic capacitors and therefore can be small too. The key elemrnt for\r\t\t obtaining the high power is the q-switch. Until a certain moment of time it \r\t\t keeps the resonator closed by preventing the light from free travelling between \r\t\t mirrors. And then it opens instantly, giving the way for the avalanche like \r\t\t process of light amplification.\n  The q-switches can be of passive and active types. \r\t\t Active q-switches are actuated by external controlling force. Mainly they\r\t\t can be electrooptical, mechanical and acoustooptical. The mechanical ones \r\t\t (with rotating mirror or prism) require exotic high speed motors with soft\r\t\t motion. Acustoopitcal ones require very complicated control circuits. Control\r\t\t circuits for the electrooptical q-switches are significantly simplier, but \r\t\t switches of that type utilize effect of polarization rotation and the laser\r\t\t requires a polarizer to be installed into the resonator. The polarizer has to be resistant to optical damage and has to be designed for the desired wavelength. It is rather strange but one can easily find a Pockel cell on the &lt;e6@y&gt; (Hard to say that it is cheap, but still obtainable.) but almost no chances to get the needed polarizers there. There also exist q-switches utilizing the effect of broken full internal reflection. However their production requires fine fitting of the optical parts together - the procedure You most probably want to avoid.\n  For DIYer it is simplier to make a passive q-switch. That one opens itself\r\t\t when the light in resonator begins to build up (e.g. when a weak free running oscillation starts). Passive q-switches are usually made of the so called phototropic materials, the ones, where transparency grows with the intensity of accidental light. It may be some dyes, certain semiconductors, doped glasses or crystals.\n  Passive Q-switching dyes are rare. The ones used for ruby laser they are at\r\t\t least humanly named - e.g. chloroaluminium phtalocyanine. Dyes for q-switching \r\t\t of neodymium lasers are mainly known only by their numbers. \r\t\t Among solid media for ruby laser q-switching there exists a KS-19 glass and \r\t\t for neodymium laser there exists aluminium-yttrium garnet doped by four valent\r\t\t chromium. Those are well known for professionals but still are hard to obtain \r\t for DIYer.\n  Is there something more affordable? \r\t\t Yes. It was found out that there exist a few schemes of q-switching that can\r\t\t be build completelely with readily obtainable materials. In the first order \r\t\t these are resonators which change their losses by changing their stability \r\t\t factor (bases on self-focusing phenomenon), resonators that change losses due\r\t\t to wafefront reversal reflection and one more interesting scheme based on a \r\t\t phenomenon of restored full internal reflection. Moreover it was found out that\r\t\t for ruby laser a common medical antiseptic dye &#34;brilliant green&#34; can be used\r\t for q-switching with a certain success. But let&#39;s discuss it successively.\n      a) Ruby laser. \r\t\t The laser is assembled with the use of semielliptic pump cavity of an old \r\t\t commercial laser. Ruby rod has 6 mm diameter and 75 mm length. It is a pink \r\t\t ruby. The lamp is FXQ-1302, xenon filled, with a silica tube having 4 mm inner\r\t\t diameter, 6 mm outer diameter and 75 mm of spacing between its electrodes.\n  The pump cavity is placed into a resonator formed by two flat dielectric \r\t\t mirrors obtained from a DVD-writer head. A mirror that has neglible transmission\r\t\t in red spectrum was choosen as the back one, and mirror having about 30% \r\t\t transmission in red was taken as a front one.\n  The lamp is fed by a homemade power supply based on six electrolytic  \r\t\t capacitors 1000 mcf x 450V, connected into series-parallel circuit that has  \r\t\t total capacity of 1500 mcf. The feeding circuit is shown on fig 2.1.\n    Fig 2.1. Ruby laser feeding circuit. Transformer Tr1 is a commercial \r\t\t flashlamp ignition transformer. An alternative can be wound on a ferrite \r\t\t rod having 6 mm diameter, 30 mm length and magnetic permeability of 400.\r\t\t The secondary winding in this case should contain 360 turns of enameled \r\t\t 0.1 mm wire in 3 layers with strong insulation between them. The primary\r\t\t is to be wound above the secondary and contain 4 turns of wire. The SG1\r\t\t is a surge arrestor spark gap of NSR or GDT type having the triggering \r\t\t voltage of 470 volt. One can use a discharger with other triggering \r\t\t voltage, but it requires recalculation of R5:R6 divider.\n    When the voltage on the storage bank reaches 770 Volt the spark gap SG1\r\t\t triggers and ignites the flashlamp that pumps the laser. The charging voltage is limited by a sparg gap firing. However one can not increase it much higher due to huge leaking current of the electrolytic capacitors, which rises greatly when the voltage approaches to 400 volt per capacitor. \r\t\t Therefore the energy accumulated up to the moment of flashlamp triggering \r\t\t is 440 Joules. The design of laser is shown on fig 2.2. Flashtube ignition pulse is put directly onto the metal body of pump cavity.\n  In the free running mode (without Q-switching) the output energy reaches \r\t\t about 1 Joule. It was measured by ancient laserists method - the number\r\t\t of rathorblades that can be punched through by the focused beam is equal\r\t\t to its energy in Joules.\n        b) Neodymium Doped Garnet Laser. \r\t\t There is used a crystal of aluminium-yttrium garnet doped by neodimium\r\t\t (YAG:Nd) that has 8 mm diameter and 110 mm length. The flashlamp is an \r\t\t aviation signal strobe tube that has already been described at this site \r\t\t in a section devoted to the dye lasers. The flashlamp is xenon filled and\r\t\t has 8 mm bore, 10 mm outer diameter and 110 mm between its electrodes.\n  The pump cavity is totally homemade - the lamp and rod are wrapped together\r\t\t by polished thick copper foil. In principle one can obtain a working laser\r\t\t using the common kitchen aluminium foil but it is lousy way. The aluminium\r\t\t foil of common (up to 14 mcm) thickness becomes broken into pieces and \r\t\t dust after several flashes of lamp. From the outside it looks like gradual\r\t\t and mystifying drop of output energy from pulse to pulse.\n  The back mirror has dielectric coating with reflection over 90% at 1064 nm.\r\t\t Mirrors of that kind are easy to obtain over the internet. The output coupler\r\t\t is formed by two microscope coverslips, having been put together and glued\r\t\t by a glue-gun (thermal glue) over their perimeter.\n  The feeding circuit is similar to the one of the ruby laser (see fig 2.1)\r\t\t but uses a single paper metal KBG-M capacitor instead of a bank of electrolytic\r\t\t ones. It has 100 mcf x 2000 V value. Charging voltage is also 2 kv. Flashtube\r\t\t ignition pulse can be put directly onto the wrapping foil of the pump cavity.\n  The laser crystal being used has wedged ends and grinded side surface.\r\t\t It gives additional losses and makes the alignment more difficult but it allows\r\t\t to accumulate more energy on the upper laser level without starting of lasing\r\t\t on the reflections from the rod&#39;s ends. Moreover the rod has plenty of narrow\r\t\t scratches (hair-thin-scratches) on one of its faces, but it does not prevent \r\t\t lasing and does not provoke an optical damage at the obtained power levels.\n  The length of the resonator is 45 cm, that makes the laser to be not as small\r\t\t as it could be, but allows to torture the resonator by inserting lenses, \r\t\t filters, cuvettes and pinholes of any kind. The photo of the laser is shown\r\t\t on fig 2.3.\n          Fig 2.4. The power supply circuit of the neodymium laser. Parameters of transformer Tr1 and spark gap SG1 are similar to those shown on Fig. 2.1.\n      The most direct way to obtain information, that allows to say that q-swithing has taken place - is to use a fast photodiode and oscillosope. If the reverse \r\t\t value of the oscilloscope&#39;s passband width is small when compared to the \r\t\t expected duration of pusle, one can register the time shape of the pulse\r\t\t and measure its width. If not - one can only register the fact of presence of \r\t\t a peak that has width less than the resolution of the oscilloscope.\n  For example for measrements of width of a 20 ns pulse, one needs a device \r\t\t with 150 MHz bandwidth. But if it is only needed to detect the fact of the\r\t\t giant pulse appearing, one can use an oscilloscope with bandwidth of a few \r\t\t megahertz. Because the usefull signal is single (or repeating with a very long period) one needs to have a storage type oscilloscope. Or a digital one. In the last\r\t\t case one needs to pay attention not only to the bandwidth, but also to the \r\t\t sampling rate, that is usually measured in gigasamples per second (GSa/s) or\r\t\t in megasamples per second (MSa/s). The interval of time between the samples (the reverse value of the sampling rate) should also be at least several times less than the durations of processes that You want to observe. To measure the width of the giant pulse it will take not less than 200 MSa/s. If You only want to detect the pulse, You will need only several MSa/s.\n  An oscilloscope fast enough to resolve the shape of giant pulse is a piece of rare and expensive equipment. DIYer usually can not afford such a device. \r\t\t Therefore let&#39;s assume that this method allows only to detect the fact of \r\t\t the giant pulse presence and to calculate the number of the giant pulses \r\t\t having been produced during one flashtube burst. (Differently from the lasers \r\t\t with active q-switching, the ones with passive q-switching do often produce\r\t\t several pulses in one burst. And the higher is number of pulses the worse.\r\t\t Because each pulse has lowe peak power.) During that kind of measurements one\r\t\t can barely bother about saturation - overloading the photodiode and driving\r\t\t it deep into area of non-linearity. Fig 3.1. shows how to use the photodiode.\n    Fig 3.1. The sample circuit that shows photodiode usage for measurements.\r\t\t R1 and C3 should be connected as close to the photodiode as possible. C3\r\t\t is a ceramic disc type or SMD type capacitor. R1 - is metal plated resistor.\r\t\t Both should be low ESL type. C2 is ceramic high frequency capacitor. C1 can\r\t\t be electrolytic. The connection to the oscilloscope should be made by a \r\t\t coaxial cable having characteristic impedance of 50 Ohm. If there&#39;s no risk\r\t\t of long powerfull light exposure of the photodiode the R2 resistor may be \r\t\t absent. In this case connect the batterry directly to the buffer capacitors.\n    The second widely known (but almost not described in literature) method \r\t\t is registration of the laser spot on the surface of silver-halide photomaterial.\r\t\t It can be photofilm, photoplate or photopaper. The photomaterial should be \r\t\t exposured but not developed. It also needs the laser wavelength be longer than the passport red border of the photomaterial. Otherwise it \r\t\t will be hard to distinguish giant pulse from free running mode.\n  The method is based on multi-photon absorption in high intensity laser radiation. It gives the similar blackening as it would be if the material was exposured with the light having its wavelength shorter than it is in the reality. Most black-and-white photomaterials are sensitive in blue-green \r\t\t range of spectrum, so they are suitable for registration of neodymium and\r\t\t ruby laser spots. Green and blue lasers blacken the photoemulsion effectively\r\t\t even in continious wave mode. On the other hand TEA CO2-laser does not provide\r\t\t blackening of the photomaterial even when the power is so high that its surface\r\t\t is fully covered by bright laser plasma. Some color films have sensitivity \r\t\t range that covers 694nm. That ones blacken under the free running ruby laser\r\t\t spot.\n  Usually it is not difficult to recognize the spot of giant on an exposured and undeveloped photomaterial. The free running laser radiation \r\t\t either does not produce black spot at all, or (at high energy densities) \r\t\t gives burned and/or flowed surface. Q-switched laser radiation at moderate\r\t\t energy densities gives nice print in the form of blackened spot without\r\t\t any traces of burning or melting. At high energy densities the traces of \r\t\t burning will certainly appear, but in doubtfull cases it can be resolved \r\t\t by reduction of energy load on the photomaterial. For example place the\r\t\t film further apart from the laser, where the spot will be wider due to \r\t\t the natural divergency. Fig 3.2 shows an example of blackened spots on\r\t\t a photofilm produced by q-switched neodymium laser.\n        The method is easy and effective. It allows user to quickly understand whether the giant pulse comes out from the laser or not. It also allows to make a rude estimations of output energy. \r\t\t However this method will never give You an idea that instead of a single pulse Your laser produces several ones per burst, and exactly due to this very fact You can not obtain the laser spark even when the total energy is significant. \r\t\t Besides, the victorious spreading of digital photo makes it more and more difficult to obtain silver-halide photomaterials.\r\t\t It can reach that point when it will become actual to make a guide for \r\t\t making photoplates at home.\n  Another pair of usefull phenomena is air breakdown and dielectric breakdown.\r\t\t If You observe a laser spark in the focused beam of Your laser, it is \r\t\t obvious, that q-switching has taken place. According to  [1] the breakdown  \r\t\t of the air at athmospheric pressure under laser radiation having wavelength \r\t\t of about 1 mcm takes place when the power density is above w0=300GW/sq.cm.\r\t\t If You have nothing against high errors, it allows to estimate the output power W of Your laser:\n    theta is the divergency of Your laser taken in radians, f - is a focal length\r\t\t of the focusing lense taken in centimeters.\n  For example, lets assume that the beam diverges by 1mm at 1 meter. It means that the divergency is 1 mrad. And lets take that the laser gives sparks when used with lense having 1 cm focal length. Then:\n    If we take that the pulse duration was 10 ns, the output energy appears to\r\t\t be as little as 235kW*10ns=2.35 mJ.\n  If Your laser beam was focused into a transparent glass brick and left there\r\t\t a trace in the form of white star of optical damage, one can say that the power\r\t\t level is high enough to state that q-switchng has definitely taken place.\r\t\t However for the quantitive estimation this method is of low use. Because the damaging intensity varies greatly dependently on the glass type and quality. One \r\t\t should keep in mind that organic glasses and transparent plastics can easily\r\t\t be broken inside their volume by radiation of a free running laser. So\r\t\t these materials arent suitable for these tests.\n          Fig 4.1. Scheme of the q-switch based on the intracavity self focusing.\r\t\t 1 - back mirror of the resonator, 2 - tightly sealed cuvette, 3 - working\r\t\t liquid, 4 - pump cavity with lamp and laser rod, 5 - output coupler, \r\t\t 6 - lense, 7 - lense.\n    Similar scheme was earlier published in article  [2], where, as usual, only the idea of the scheme wass given, and only brief description of the best results was done. All troublewatching details are omitted as expected. It was only said there, that when the lenses were placed correspondently to the high lasing threshold, the \r\t\t q-switching process took place. And when lenses were set for the low lasing threshold, there was no q-switching effect. Another fact from that work is that after a few tens of pulses the cuvette was destructed. Neither there exist any details how to select that position of the lenses, &#34;correspondent to high threshold&#34; and good \r\t\t q-switching, nor any information about the alignment difficulties. Another similar scheme was implemented in work  [3],\r\t\t but its authors state that the main phenomenon causing the q-switching is a dynamic reflecting hologram in liguid, or in other words: &#34;SBS mirror&#34;. This article also contains no information on stability of the effect\r\t\t or alignment difficulties.\n  A set of cuvettes was made, that have lenses as their end walls. This design was choosen to avoid the risk of optical damage of a glass wall near the narrow place of the beam. And really, during the experiments (more than a hundreed\r\t\t of pulses with each cuvette) no damage was observed. The cuvettes have(d) \r\t\t magnification ratio of 1:1 i.e. front and back lenses have the same focal \r\t\t length. The focal lengthes were the next:\n    It should be specially noted, that the focal length was measured from the side of liquid, when one side of the lense was surrounded by air and the other side was surrounded by isopropanol. When dry or fully drown into liquid the lenses would have completely different focal lengthes.\n  Isopropyl alcohol and petrol were used as working liquids. Water was also \r\t\t tried out but without any noticeable q-switching.\n  Some successfully working q-switches were made of cuvettes with fixed spacing between lenses, but it required too high precision of material processing, especially for short FL lenses. Better results\r\t\t were obtained when the cuvettes consisted of two threaded parts (tubes) screwed\r\t\t one into another. It made it possible to adjust the spacing between lenses.\r\t\t The thread connections were made tight by addition of a fluoroplastic ribbon.\n  Small cuvettes are robust to be made of parts of ballpoint pen bodies. Larger cuvettes were made using sewer/water pipes and fittings. \r\t\t Lenses were glued by thermal glue (glue gun, black colored rod) for the cuvetters intended for isopro\n......", "posttime": "2020-11-10 18:44:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "激光器,switch,激光", "title": "自制固体激光器调Q开关", "title_en": "Homemade Q-Switch for Solid State Lasers", "transed": 1, "url": "http://laserkids.sourceforge.net/eng_ssl_qswitch.html", "via": "", "real_tags": ["激光器", "switch", "激光"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，我在Twitter上做了一项民意调查，看看人们对Unix和Linux系统中“pwd”的含义有什么看法。结果各不相同，或许是出于很好的原因。\n2020年10月底，我在Twitter上进行了一次简短的民意调查，有82人参加了投票。这是那次民意调查，以及结果。它们是混杂在一起的，乍一看可能会令人惊讶。但这是有原因的，我们会发现这一点的。\n最受欢迎的选项是“打印工作目录”。乍一看，这似乎是合乎逻辑的：“打印出当前的工作目录，即我现在所在的位置”。此外，不同版本的PWD手册中的描述有助于阐明这一概念。通常，我们会看到类似“打印当前/工作目录的名称”或“打印当前目录”之类的语句。\n但是有很多命令可以打印东西，而且也是这样描述的。使用id命令。其中一个手册页是这样写的：“打印真实有效的用户和组ID”。又来了“印刷品”。但命令不是PID，而是ID。仔细想想，Unix中有许许多多的命令将信息发送到STDOUT，即发送到终端。这在某种程度上是他们中的许多人的观点。\n这一次，维基百科的词条似乎只是表面上的确定，在pwd页面上写道：“pwd命令(打印工作目录)将当前工作目录的完整路径名写入标准输出”。似乎是为了强调这一声明充满希望的权威性，这里有五个(！)。应该链接到支持这一观点的资源的脚注。\n遗憾的是，第一个脚注指向Wayback Machine的《UNIX程序员手册》(第七版，第一卷-1979年1月)的副本，其中实际上没有提到PWD(打印工作目录)的缩写：\n我不知道你怎么想，但这份历史性的文件比我遇到的其他来源更有份量，它只会破坏维基百科词条的可信度。\n其余的脚注链接充其量看起来是可疑的，除了一个指向关于PWD的GNU Coreutils手册的链接，它的名称是“打印工作目录”。但到目前为止，我所看到的其他一切都让我认为，这是一个出于明显而无辜的原因而传播的误解。此外，维基百科页面上没有用来支持这一说法的一个脚注是一个指向开放组织基础规范第7期2018年版关于pwd的信息的指针，几乎看起来它实际上完全避免了使用“打印”这个词：“返回工作目录名”…。Pwd实用程序应将当前工作目录的绝对路径名写入标准输出，该路径名不包含文件名点或点。非常具体，非常不公开。\n所以我认为“打印工作目录”不是pwd的意思。事实上，“打印工作目录”可能在某些手册页中很常见，但在这台继承了BSD的MacOS机器上，我们使用的是：“pwd-返回工作目录名”。此外，它还说“pwd实用程序将当前工作目录的绝对路径名写入标准输出”。\n因此，它可能真的是“工作目录的路径名”。至少对我来说，这会更有意义。它不仅避免了“print”的冗余，而且更具体地说明了输出-例如，如果我在/home/dja/中，那么调用pwd就会告诉我我所在的位置，包括整个路径，而不仅仅是dja：\n至于其他选项，我确实喜欢“进程工作目录”，主要是因为它对我来说很有意义；Unix中的每个进程都有当前工作目录的概念，这正是我在Shell进程中进入pwd时所要求的-在视频Unix终端和Shell中有一部分很好地解释了这一点。\n我很想指出一些旧的Unix资源来明确地解释这个问题，但不幸的是，搜索结果很少--Unix第5版和第6版中的PWD源代码都没有提供任何关于这方面的信息。\n那么“当前工作目录”呢？嗯，这个选项似乎有腿，以Korn壳的形式出现。虽然有一个来源暗示答案很可能是“当前工作目录的路径名”，因为pwd只发出$pwd环境变量的值(而名为“打印工作目录”的变量根本没有意义)…。至少在ksh-land中，“当前工作目录”似乎是pwd所代表的。例如，以ksh手册页为例，它指出“pwd-由cd命令设置的当前工作目录”。\n在这个问题上，有大量的直接和间接的讨论。以Unix&amp；Linux Stack Exchange论坛上的这两个条目为例：$pwd的词源和什么是$pwd？(VS当前工作目录)。当然，也许永远也找不到明确的答案，因为计算历史是千变万化的，而且容易出现分叉。\n谈到历史，我们可以进一步追溯到Unix出现之前的根源，即Multics的形式，它间接地产生了Unix(最初的Unics)。在Multics命令列表中，我们看到，在其他类似名称的命令中，有一些东西让我们眼前一亮：\nPrint_mail(Pm)显示邮箱中的邮件print_Messages(Pm)显示邮箱中的交互消息print_motd(Pmotd)显示当日消息(源)print_proc_auth(PPA)显示进程的敏感度级别和分区print_request_type(PRT)显示I/O守护程序请求类型的列表print_search_path(PSP)显示搜索路径print_search_ules(PSR)显示就绪消息print_wsr\n这里有pwd，实际上，就像它的兄弟pmotd一样，例如，它是print_motd的缩写，它是print_wdir的缩写。现在，考虑到最初的民意调查被设置为Unix和Linux的上下文，也许我们必须忽略这一信息。但是，作为一个对Unix历史非常着迷的人，我怎么能这样做呢？\n我想没有什么可以下结论的。历史是丰富多彩的，也许我们永远不会确切地知道。也许，事实上，答案将取决于我们问的是谁。从大局来看，…真的无关紧要。但对于那些喜欢细枝末节的人来说，这是一个值得探索的有趣话题。", "note_en": "Last week I ran a poll on Twitter to see what people considered with respect to the meaning of ‘pwd’ in Unix and Linux systems. The results were varied, for perhaps good reason.\n At the end of Oct 2020 I ran a  brief poll on Twitter, on which 82 people voted. Here’s that poll, and the results. They’re quite mixed, which at first might seem surprising. But there are reasons for that, as we’ll find out.\n   The most popular option was “print working directory”. At first sight it seems logical: “print out the current working directory, i.e. where I am right now”. Moreover, the description in various versions of the manual for  pwd help to drive home that notion. Typically we see sentences like “ print name of current/working directory” or “ print the current directory”.\n But there are lots of commands that print stuff, and are described in that way too. Take the  id command. Here’s what one man page says: “ print real and effective user and group IDs”. There’s “print” again. But the command isn’t  pid, it’s  id. When you think about it, many, many commands in Unix send information to STDOUT, i.e. to the terminal. That’s sort of the point of many of them.\n This time arguably only superficially definitive, it would seem, the Wikipedia entry states, on the  page for  pwd: “the pwd command (print working directory) writes the full pathname of the current working directory to the standard output”. As if to underline the hopeful authority of this statement, there are five (!) footnotes that supposedly link to resources that back this up.\n Unfortunately, the first footnote points to a Wayback Machine copy of the  UNIX PROGRAMMERS MANUAL - Seventh Edition, Volume 1 - January, 1979, wherein there are actually zero references to  pwd being short for “print working directory”:\n  I don’t know about you, but this historic document carries more weight for me than other sources I’ve come across, and it only serves here to undermine the credibility of the Wikipedia entry.\n The rest of the footnote links seem dubious at best, except for the one pointing to the  GNU Coreutils manual on pwd which has it as “print working directory”. But everything else I’ve seen so far makes me think that this is a misunderstanding that has spread for obvious and innocent reasons. In addition, the one footnote in the Wikipedia page that is not used to back this claim up is a pointer to  The Open Group Base Specifications Issue 7, 2018 edition’s information on pwd, which almost seems like it’s actually avoiding using the word “print” at all: “return working directory name” … “The pwd utility shall write to standard output an absolute pathname of the current working directory, which does not contain the filenames dot or dot-dot.”. Very specific, very not-print.\n So I’m thinking that “print working directory” isn’t what  pwd stands for. In fact, “print working directory” may be common to some man pages, but on this macOS machine, with its  BSD heritage, we have, instead: “pwd – return working directory name”. Moreover, it goes on to say “The pwd utility writes the absolute pathname of the current working directory to the standard output”.\n  So perhaps it really is “pathname of working directory”. That would, at least to me, make more sense. Not only does it eschew the redundancy of “print”, it also is more specific about the output - if I’m in  /home/dja/ for example, then invoking pwd will tell me that, i.e. where I am, including the whole path, and not just  dja:\n   As for the other options, I do favour “process working directory”, mostly because it makes a lot of sense to me; every process in Unix has the concept of a current working directory, and that’s exactly what I’m asking for when I’m in my shell process and enter  pwd - there’s a part in the video  Unix terminals and shells that explains this very well.\n I’d love to be able to point to some old Unix sources that definitively explain the answer, but unfortunately that search has come up with very little - the  pwd source in both the  5th and  6th Editions of Unix shed no light on this whatsoever.\n  What about “present working directory”? Well, that option seems to have legs, in the form of the Korn shell. While  one source implies that the answer might well be “pathname of current working directory”, in that  pwd just emits the value of the  $PWD environment variable (and a variable called “print working directory” makes no sense at all) … it would seem that in ksh-land, at least, “present working directory” is what  pwd represents. Take, for example, the  ksh man page which states “PWD - The present working directory set by the cd command”.\n There’s a ton of discussion, both direct and indirect, on this very question. Take for example these two entries in the Unix &amp; Linux Stack Exchange forum:  Etymology of $PWD and  What is $PWD? (vs current working directory). Of course, perhaps the definitive answer will never be found, as computing history is nothing if not varied and prone to forking.\n  Talking of history, we could go further back to pre-Unix roots, in the form of Multics, which indirectly gave rise to Unix (originally “Unics”). In the  list of Multics Commands, we see, nestled amongst other similarly named commands, something that jumps out at us:\n print_mail (pm)\tdisplay mail in a mailboxprint_messages (pm)\tdisplay interactive messages in a mailboxprint_motd (pmotd)\tdisplay message of the day (source)print_proc_auth (ppa)\tdisplay process&#39;s sensitivity level and compartmentsprint_request_types (prt)\tdisplay list of I/O daemon request typesprint_search_paths (psp)\tdisplay search pathsprint_search_rules (psr)\tdisplay ready messagesprint_wdir (pwd)\tdisplay working directory\n There’s  pwd, and in fact, just like its sibling  pmotd, for example, which is short for  print_motd, it’s short for  print_wdir. Now, given the context of the original poll being set to Unix and Linux, perhaps we must discount this information. But as someone who is fascinated with Unix history in general - how can I?\n I guess there are few things to conclude. The history is rich and diverse, and maybe we’ll never know for sure. Perhaps, in fact, the answer will depend on whom we ask. In the grand scheme of things, it doesn’t really matter … but to those who delight in minutiae, it’s a fun topic worth exploring.", "posttime": "2020-11-10 18:44:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "系统,meanings,pwd", "title": "Unix系统中PWD的多种含义", "title_en": "The myriad meanings of pwd in Unix systems", "transed": 1, "url": "https://qmacro.org/2020/11/08/the-meaning-of-pwd-in-unix-systems/", "via": "", "real_tags": ["系统", "meanings", "pwd"]}, {"category": "", "categoryclass": "", "imagename": "93724ab2e02ae14ffb4b1c80a05e7b41.jpg", "infoid": 1034230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "反法西斯主义不是一场游戏。你不能装模作样，说你反对独裁和暴徒的力量，然后屈服于暴徒，任意诽谤无辜的人。你不能说你相信正义，然后又宽恕不公正。而且，这应该是基本的，你不能说你支持言论自由和持不同政见者的权利，然后以最虚伪和懦弱的理由审查言论自由允许争议的理由。这件事注定会引起争议。如果它不是，那么拥有它就没有意义了。\n对育碧来说，反法西斯主义是一种游戏，准确地说，是一种电脑游戏。这家游戏公司最新推出的玩具是《看门狗：军团》(Watch Dog：Legion)。在“不久的将来”的伦敦，一家名为Albion的私人保安公司利用恐怖袭击的余波建立了独裁政权。玩家必须招募抵抗战士并进行反击。制作人解释说，你看到的每个人都有独特的背景、个性和技能。有了它们，你就可以“破解武装无人机，部署蜘蛛机器人，并使用增强现实斗篷击倒敌人”。\n即使你喜欢这类游戏，看狗军团也会是一款标准的血枪游戏，包裹在标准的偏执情节中，很久以前就失去了震惊甚至惊喜的能力。然而，它确实有一个独创的特点，那就是让它超越平庸。育碧允许玩家调谐到抵抗播客，并听到真正的记者谈论法西斯主义如何回到英国。育碧招募了Politics.co.uk的伊恩·邓恩和大西洋月刊的海伦·刘易斯。他们很好地将当代对民粹主义和科技巨头的担忧融入到反乌托邦的故事中。我将引用海伦·刘易斯(Helen Lewis)的全部言论，理由如下：\n“‘我认为，在危机前的英国，我们的想法是，当法西斯主义到来时，它会再次看起来像20世纪30年代。它看起来就像是一位极具魅力的领导人。它看起来就像街上的长筒靴和巨大的旗帜。但事实并非如此：它看起来像是社交媒体集团。这看起来像是在井里下毒，这样信息就不能被信任了。\n为了让它变得更好，你可以在这里听海伦的。我会敦促你这样做，因为这将是你得到的最后机会。\n在我看来，刘易斯是美国最有趣的自由派记者之一。她是独立的，以她自己的方式无所畏惧。当我说许多左翼作家远离关于跨性别者权利的恶毒争论时，我说的是经验。他们要么口口声声表示辩论已经解决，要么什么都不说。做其他任何事都是自找麻烦。\n近年来，刘易斯对经典的建制派缝合提出了异议。她批评时任妇女与平等特别委员会主席的玛丽亚·米勒同意极端的跨性别者立场，却忽视了女性的关切。米勒呼吁政府允许男性自我认同为女性。她们只要说自己是女人就能变成女人。在包括刘易斯在内的女权主义者和霍华德刑事改革联盟的压力下，政府最终被迫撤退，后者担心性犯罪者会以自我认同为借口进入女子监狱，事实证明这是理所当然的。\n反对自我认同并不是否认跨性别者需要帮助和支持，他们和其他人一样有尊重和平等待遇的权利。这仅仅是为了保护女性免受有毒男性的伤害。为此，刘易斯被指责为偏执狂和TERF(跨性别排他性激进女权主义者)，如果有什么不同的话，她是一名排外男性的激进女权主义者，试图将男性排除在女性专用空间之外。\n她的名字出现在推特上时，一群专业的嘲笑者就会紧随其后，高喊“TERF”。果不其然，一些推特用户和一个游戏论坛的撰稿人告诉育碧，给她一个平台太离谱了。我不想夸大他们的人数。与其说是推特风暴，不如说是推特阵雨。但是淋浴就足够了。\n在这场比赛中，刘易斯从来没有谈论过跨性别者的问题。但育碧勇敢的反法西斯主义者并不在意。该公司说，它已经意识到刘易斯发表的有争议的言论。由于没有具体说明他们是什么，育碧不仅未经审判就谴责刘易斯，而且没有让她知道对她的指控。在推特上，她的指控者所能找到的最糟糕的是一篇文章，她在文章中说，古代对女性的仇恨被披上了现代用“TERF”作为侮辱的外衣，就像古代对犹太人的仇恨被披上了现代“犹太复国主义”的外衣一样。我对此深表同情。我叫科恩，我见过足够多的反犹太主义者交换“犹太人”和“犹太复国主义者”，足以让我一辈子，也有足够多的左翼男性在虐待女权主义女性时得到一种再熟悉不过的快感。我承认我可能错了，但如果你认为我错了，如果你能解释一下为什么这种比较是错误的，而刘易斯是错的，我会很感激。推特(Twitter)和育碧(Ubisoft)上没有人为此而烦恼。事实和证据不是必需的。正如刘易斯在《看门狗：军团》一书中所预言的那样，社交媒体已经毒害了井水，没有任何信息是可信的，也不是真正需要的。\n育碧适时地向所有人道歉，因为它让争议通过了它的大门，并宣布将清除刘易斯在游戏中的贡献。我们将在未来加强背景调查，尤其是这一点。\n育碧的行为既虚伪，又可悲，又危险。它不能推动一场呼吁抵制暴政的游戏，然后崩溃成一堆颤抖的游戏。刘易斯并不孤单。我收到艺术家和作家发来的电子邮件，他们为不合时宜的发言付出了代价。他们的委托被撤回，露面也被取消，原因很简单，就像刘易斯一样，他们是“有争议的”。\n取消文化的捍卫者假装他们只针对强大的目标。这根本不是真的。怨恨得到了解决，歇斯底里的指责得到了毫无根据的信任，因为当权的懦夫一看到争议的迹象就崩溃了。摧毁一个人所需要的只是几条谴责他们的推文。正如刘易斯发现的那样，没有人检查，没有人为自己辩护，关心的人太少，跑的人太多。", "note_en": "Anti-fascism isn’t a game. You can’t preen yourself and say you oppose dictatorship and the power of the mob, then give into mobs and arbitrarily slander innocent people. You can’t say you believe in justice, and then condone injustice. And, this should be basic, you can’t say you support freedom of speech and the right to dissent, and then censor for that most mulish and cowardly of reasons that free speech allows controversy. It&#39;s meant to be controversial. There&#39;s no point in having it if it isn&#39;t.\n To Ubisoft, anti-fascism is a game: a computer game to be precise. The latest plaything from the gaming corporation is  Watch Dogs: Legion. In a ‘near-future London,’ a private security company called Albion has used the fallout from terrorist attacks to establish a dictatorship. The players must recruit resistance fighters and strike back. ‘Everyone you see has a unique backstory, personality, and skill set,’ the makers explain. With them, you can ‘hack armed drones, deploy spider-bots, and take down enemies using an Augmented Reality Cloak’.\n   Even if you like that sort of thing,  Watch Dogs: Legion would be a standard blood-and-guns game, wrapped in the standard paranoid plotline that long ago lost the power to shock or even surprise. It does have one original feature, however, that lifts it above the mediocre. Ubisoft allows players to tune into resistance podcasts and hear real journalists talking about how fascism returned to Britain. Ubisoft recruited Ian Dunt of  Politics.co.uk and Helen Lewis of the  Atlantic. They do a decent job of weaving contemporary concerns about populism and tech giants into the dystopian story. I will quote what Helen Lewis says in full for reasons we will get to:\n “ ‘I think in pre-crisis Britain, we had an idea that when fascism came, it would look again like the 1930s. It would look like a single charismatic leader. It would look like jackboots in the street and huge flags. And it didn’t look like that: it looked like social media groups. It looked like poisoning the well so that no information could be trusted.’\n To make it better, you can listen to Helen  here. I would urge you to do so because it will be the last chance you get.\n  Lewis is, in my view, one of the most interesting liberal journalists in the country. She is independent and, in her own way, fearless. I speak from experience when I say many leftish writers run a mile from the poisonous arguments about trans rights. They either mouth the approved position that the debate is settled or say nothing. It’s asking for trouble to do anything else.\n In recent years, Lewis took issue with a classic establishment stitch-up. She  criticisedMaria Miller, then chair of the women and equalities select committee, for agreeing with an extreme trans position while dismissing women’s concerns. Miller called on the government to allow men to self-identify as women. They would just have to say they were a woman to become women. The government was eventually forced to retreat under pressure from feminists, Lewis included, and the Howard League for Penal Reform, which feared sex offenders would use self-identification as an excuse to get into women’s prisons, rightly as  eventswere to prove.\n To oppose self-identification was not to deny that transgender people needed help and support, and had the same right to respect and equal treatment as everyone else. It was merely to protect women against toxic men. For this, Lewis was denounced as a bigot and a TERF (‘trans-exclusionary radical feminist’) when if anything she was a male-exclusionary radical feminist trying to keep men out of women-only spaces.\n Claques of professional scorners follow her, and shout ‘TERF’ whenever her name appears on Twitter. Sure enough, a handful of Twitter users and  contributorsto a gaming forum told Ubisoft it was outrageous to give her a platform. I don’t want to exaggerate their number. It was more a Twitter shower than a Twitter storm. But the shower was enough.\n Nowhere in the game does Lewis talk about trans issues. But the brave anti-fascists of Ubisoft didn’t care. The company said it had become ‘aware of controversial remarks’ Lewis had made. As it did not specify what they were, Ubisoft was not only condemning Lewis without a trial but without letting her know the charges against her. The worst her accusers on Twitter could  findwas an article in which she said that ancient hatred of women was clothed in the modern use of ‘TERF’ as an insult, just as ancient hatred of Jews was clothed in the modern use of ‘Zionist’. I sympathise. I’m called Cohen, and have seen enough anti-Semites swap ‘Jews’ and ‘Zionists’ to last me a lifetime, and enough left-wing men get an all-too-familiar pleasure when they abuse feminist women. I accept I could be wrong, but if you think I am, I’d be grateful if you could explain why the comparison is false and Lewis is mistaken. No one on Twitter or at Ubisoft bothered. Facts and evidence weren&#39;t required. As Lewis predicted in  Watch Dogs: Legion, social media had so poisoned the well ‘no information could be trusted’ or indeed needed.\n  Ubisoft duly apologised to one and all for letting controversy through its doors, and announced it was purging Lewis&#39;s contributions from the game. We will ‘reinforce our background checks’ in future, it  addedominously.\n Ubisoft’s behaviour is simultaneously hypocritical, pathetic and dangerous. It cannot promote a game urging resistance to tyranny and then collapse into a trembling heap. Lewis is hardly alone. I receive emails from artists and writers who have paid the price for speaking out of turn. They have had commissions withdrawn and appearances cancelled simply because, like Lewis, they are ‘controversial’.\n Cancel culture’s defenders pretend they only go after powerful targets. It is simply not true. Grudges are settled and hysterical accusations given unwarranted credence because cowards in authority crumble at the first hint of controversy. All that is needed to destroy someone is a few tweets denouncing them. As Lewis found, no one checks, no one justifies, too few care, and too many run.", "posttime": "2020-11-10 18:43:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子游戏,游戏,anti,刘易斯", "title": "“反法西斯”电子游戏公司的懦弱--《旁观者》", "title_en": "The cowardice of an ‘anti-fascist’ video game company – The Spectator", "transed": 1, "url": "https://www.spectator.co.uk/article/the-cowardice-of-an-anti-fascist-video-game-company", "via": "", "real_tags": ["电子游戏", "游戏", "anti", "刘易斯"]}]