[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1031600, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Dipscam行动是由联邦调查局(FBI)、[2]总问责局、[3]教育和劳动力委员会以及其他美国机构从1980年到1991年进行的一系列独立调查[1]。这导致20多人被定罪[1]，39家文凭工厂关闭。[4]。\nDipscam最初始于1980年联邦调查局夏洛特外地办事处对南加州格林维尔东南大学的调查[5]，后来演变成对全美和国外文凭工厂的多次调查。在Dipscam期间，购买了40份带有成绩单的文凭，执行了16份联邦搜查令，退还了19份联邦大陪审团起诉书，拆除了40所学校，并获得了20多项定罪。联邦调查局从学校记录中确认了超过12,500名这些机构的毕业生，包括联邦、州和县的雇员。查获的学校记录显示，许多毕业生受雇于商业、教育、执法和医药行业。\n一些调查是单人操作，而另一些调查则有很多员工。对于几项调查，联邦调查局与美国邮政检查局和国税局联手处理此案的邮政和税收相关方面。每项调查的信息都与适当的联邦当局分享，并成为几次国会听证会的主题。\n对于老龄化特别委员会住房和消费者权益小组委员会的听证会，[6]美国法警将Dipscam之前的一名被告从联邦监狱带去作证。证人在经营西南大学、亚利桑那州图森市和俄亥俄州哥伦布市期间总收入超过200万美元。在这些听证会之前，委员会调查人员代表参议员克劳德·佩珀(Claude Pepper)从加州的一所学校购买了一张博士文凭，然后他开玩笑地称自己为胡椒博士(Dr.Pepper)，显然是指与其同名的饮料。[7]。\n参众两院政府事务委员会[8]以及教育和劳动力委员会21世纪竞争力小组委员会[9]后来都就此问题举行了其他听证会。政府问责局(GAO)为政府事务委员会调查了几所学校，甚至从列克星敦大学(Lexington University)为参议员苏珊·柯林斯(Susan Collins)购买了几个文凭。[3]至少有一次，一名委员会调查员在其中一所学校登记为学生；在听证会期间播放了她的几段电话录音。\n^a b Ryan Singel(2004年3月18日)。文凭工厂没有第三个学位。窃听。\n请不要将其与佛罗里达州莱克兰东南大学混淆，后者是一所经认证的私立大学。\n罗莎·索尔特(1987年1月8日)。在证书至上的美国，邮购文凭是伦理学的最新课程。早晨的叫醒服务。宾夕法尼亚州的艾伦敦。\n参议员苏珊·柯林斯(Susan Collins)，国会议员汤姆·戴维斯(Tom Davis)，5/11-12/04；虚假的学位和未实现的期望：纳税人的钱在补贴文凭工厂吗？\n国会议员霍华德·P·巴克(Howard P.34；Buck&34；McKeon，2004年9月23日)目前的保障措施是不是保护纳税人免受文凭磨坊的影响？\n“文凭磨坊：欺诈的程度”，作者：大卫·伍德·斯图尔特和亨利·A·斯皮尔。纽约市：麦克米伦出版公司，1988年。教育资源信息中心摘要", "note_en": "Jump to navigation  Jump to search  Operation Dipscam was a series of separate investigations  [1] conducted by the  Federal Bureau of Investigation (FBI),  [2] the  General Accountability Office,  [3] the  Committee on Education and the Workforce, and other United States agencies from 1980 to 1991. It led to more than 20 convictions  [1] and the closing of 39  diploma mills.  [4]\n Dipscam began from an initial 1980 investigation by the  Charlotte Field Office of the FBI into Southeastern University of Greenville, SC  [5] and evolved into multiple investigations of diploma mills throughout the United States and abroad. During Dipscam, 40 diplomas with transcripts were purchased, 16 federal search warrants were executed, 19 Federal grand jury indictments were returned, 40 schools were dismantled, and over 20 convictions were obtained. The FBI identified over 12,500 &#34;graduates&#34; of these institutions from school records, including federal, state, and county employees. Seized school records indicated that many &#34;graduates&#34; were employed in business, education, law enforcement, and medicine.\n Some investigations were one-person operations, while others had numerous employees. For several investigations, the FBI joined forces with the  U.S. Postal Inspection Service and the  Internal Revenue Service to handle postal and tax-related aspects of the case. Information from each investigation was shared with appropriate federal authorities and was the subject of several  Congressional hearings.\n For the hearing by the Subcommittee on Housing and Consumer Interests of the Select Committee on Aging,  [6] a prior Dipscam defendant was brought to testify from federal prison by the U.S. Marshals. The witness had earned over $2,000,000 in gross income while operating Southwestern University, Tucson, Arizona, and Columbus, Ohio. Before these hearings, committee investigators purchased a Ph.D. diploma from a California school on behalf of Senator  Claude Pepper, who then jokingly called himself &#34;Dr. Pepper,&#34; apparently referring to the  beverage of the same name.  [7]\n Both the House and Senate Committees on Government Affairs,  [8] as well as the Subcommittee on 21st Century Competitiveness of the Committee on Education and the Workforce,  [9] later held other hearings on the subject. The Government Accountability Office (GAO) investigated several schools for the Committees on Government Affairs, even purchasing several diplomas from Lexington University for Senator  Susan Collins.  [3] In at least one instance, a committee investigator registered as a student at one of these schools; several of her recorded telephone conversations were played during these hearings.\n    ^     a     b   Ryan Singel (18 March 2004).  &#34;No Third Degree for Diploma Mills&#34;.   Wired.\n  ^  Not to be confused with  Southeastern University of Lakeland, Florida, an accredited private university.\n  ^   Salter, Rosa (January 8, 1987).  &#34;In Credential-happy America, Mail-order Diplomas Are The Latest Lesson In Ethics&#34;.  The Morning Call. Allentown, Pennsylvania.\n ^  Senator  Susan Collins, Congressman  Tom Davis, 5/11-12/04, &#34;Bogus Degrees and Unmet Expectations: Are Taxpayer Dollars Subsidizing Diploma Mills?&#34;\n ^  Congressman Howard  P. &#34;Buck&#34; McKeon, 9/23/04, &#34;Are Current Safeguards Protecting Taxpayers Against Diploma Mills?&#34;\n  Diploma Mills: Degrees of Fraud by David Wood Stewart and Henry A. Spille.  New York City:  Macmillan Publishing Company 1988. Abstract, Education Resources Information Center", "posttime": "2020-10-28 04:16:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dipscam,operation,委员会", "title": "Dipscam行动", "title_en": "Operation Dipscam", "transed": 1, "url": "https://en.wikipedia.org/wiki/Operation_Dipscam", "via": "", "real_tags": ["dipscam", "operation", "委员会"]}, {"category": "", "categoryclass": "", "imagename": "46b3175c4c844dbc882f9fa3adb00fc5.jpg", "infoid": 1031599, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一般情况下，运动的癌症患者比不活动的患者预后更好。现在，瑞典卡罗林斯卡研究所(Karolinska Institutet)的研究人员发现了一个可能的解释，解释了为什么运动有助于减缓小鼠的癌症生长：体育活动改变了免疫系统细胞毒性T细胞的新陈代谢，从而提高了它们攻击癌细胞的能力。这项研究发表在“电子生活”杂志上。\n这项研究的通讯作者、卡罗林斯卡学院细胞和分子生物学系教授兰德尔·约翰逊说：“运动积极效应背后的生物学原理可以为人体如何保持健康提供新的见解，并帮助我们设计和改进抗癌治疗。”\n先前的研究已经表明，体育锻炼可以预防不健康，还可以改善包括各种形式的癌症在内的几种疾病的预后。然而，运动究竟如何起到预防癌症的作用仍不清楚，特别是当涉及到生物学机制时。一个看似合理的解释是，体育活动激活了免疫系统，从而增强了身体预防和抑制癌症生长的能力。\n在这项研究中，卡罗林斯卡研究所(Karolinska Institutet)的研究人员通过检查免疫系统的细胞毒性T细胞(即专门杀死癌细胞的白细胞)对运动的反应，扩大了这一假设。\n他们将患有癌症的小鼠分成两组，让一组定期在旋转轮子里运动，而另一组则保持不活动。结果表明，与未训练的动物相比，经过训练的动物肿瘤生长缓慢，死亡率降低。\n接下来，研究人员通过注射抗体在训练和未训练的小鼠中移除细胞毒性T细胞来检查细胞毒性T细胞的重要性。这些抗体消除了运动对癌症生长和存活率的积极影响，根据研究人员的说法，这表明了这些T细胞对于运动诱导的癌症抑制的重要性。\n研究人员还将细胞毒性T细胞从受过训练的小鼠转移到未受过训练的患有肿瘤的小鼠身上，与那些从未受过训练的动物身上获得细胞的小鼠相比，这改善了它们的前景。\n为了研究运动是如何影响癌症生长的，研究人员在训练结束后分离了T细胞、血液和组织样本，并测量了肌肉中产生的常见代谢物的水平，这些代谢物在运动过程中高水平地排入血浆。其中一些代谢物，如乳酸，改变了T细胞的新陈代谢，提高了它们的活性。研究人员还发现，与静息动物的T细胞相比，从运动动物中分离的T细胞表现出代谢变化。\n此外，研究人员还检查了这些代谢物如何在人体内对运动做出反应。在30分钟的高强度骑行后，他们从8名健康男性身上采集了血液样本，并注意到同样的训练诱导的代谢物也在人体内释放。\n卡罗林斯卡研究所实验室医学部的高级研究员、该研究的第一作者海琳·伦德奎斯特(Helene Rundqvist)说：“我们的研究表明，锻炼会影响几种分子和代谢物的产生，这些分子和代谢物可以激活抗癌的免疫细胞，从而抑制癌症的生长。”“我们希望这些结果有助于更深入地了解我们的生活方式如何影响我们的免疫系统，并为抗癌新免疫疗法的开发提供信息。”\n研究人员得到了克努特和爱丽丝·瓦伦伯格基金会、瑞典研究理事会、瑞典癌症协会、瑞典儿童癌症基金会、瑞典医学会、英国癌症研究机构和惠康信托基金的资助。\n“细胞毒性T细胞介导运动诱导的肿瘤生长减少”，Helene Rundqvist，Pedro Veliça，Laura Barbieri，Paulo A.Gameiro，David Bargiela，Milos Gojkovic，Sara Mijwel，Stefan Reitzner，David Wullimann，Emil Ahlstedt，Jernej Ule，Arne Ostman and Randall S.Johnson，eLife，2020年10月23，在线，DOI：10.7554/eLife.59996", "note_en": "People with cancer who exercise generally have a better prognosis than inactive patients. Now, researchers at Karolinska Institutet in Sweden have found a likely explanation of why exercise helps slow down cancer growth in mice: Physical activity changes the metabolism of the immune system’s cytotoxic T cells and thereby improves their ability to attack cancer cells. The study is published in the journal eLife.\n  “The biology behind the positive effects of exercise can provide new insights into how the body maintains health as well as help us design and improve treatments against cancer,” says  Randall Johnson, professor at the  Department of Cell and Molecular Biology, Karolinska Institutet, and the study’s corresponding author.\n  Prior research has shown that physical activity can prevent unhealth as well as improve the prognosis of several diseases including various forms of cancer. Exactly how exercise exerts its protective effects against cancer is, however, still unknown, especially when it comes to the biological mechanisms. One plausible explanation is that physical activity activates the immune system and thereby bolsters the body’s ability to prevent and inhibit cancer growth.\n In this study, researchers at Karolinska Institutet expanded on this hypothesis by examining how the immune system’s cytotoxic T cells, that is white blood cells specialized in killing cancer cells, respond to exercise.\n  They divided mice with cancer into two groups and let one group exercise regularly in a spinning wheel while the other remained inactive. The result showed that cancer growth slowed and mortality decreased in the trained animals compared with the untrained.\n Next, the researchers examined the importance of cytotoxic T cells by injecting antibodies that remove these T cells in both trained and untrained mice. The antibodies knocked out the positive effect of exercise on both cancer growth and survival, which according to the researchers demonstrates the significance of these T cells for exercise-induced suppression of cancer.\n The researchers also transferred cytotoxic T cells from trained to untrained mice with tumors, which improved their prospects compared with those who got cells from untrained animals.\n  To examine how exercise influenced cancer growth, the researchers isolated T cells, blood and tissue samples after a training sessions and measured levels of common metabolites that are produced in muscle and excreted into plasma at high levels during exertion. Some of these metabolites, such as lactate, altered the metabolism of the T cells and increased their activity. The researchers also found that T cells isolated from an exercised animal showed an altered metabolism compared to T cells from resting animals.\n In addition, the researchers examined how these metabolites change in response to exercise in humans. They took blood samples from eight healthy men after 30 minutes of intense cycling and noticed that the same training-induced metabolites were released in humans.\n “Our research shows that exercise affects the production of several molecules and metabolites that activate cancer-fighting immune cells and thereby inhibit cancer growth,” says  Helene Rundqvist, senior researcher at the  Department of Laboratory Medicine, Karolinska Institutet, and the study’s first author. “We hope these results may contribute to a deeper understanding of how our lifestyle impacts our immune system and inform the development of new immunotherapies against cancer.”\n The researchers have received financing from the Knut and Alice Wallenberg Foundation, the Swedish Research Council, the Swedish Cancer Society, the Swedish Childhood Cancer Foundation, the Swedish Society of Medicine, Cancer Research UK and the Wellcome Trust.\n  “ Cytotoxic T-cells mediate an exercise-induced reduction in tumor growth,”  Helene Rundqvist, Pedro Veliça, Laura Barbieri, Paulo A. Gameiro, David Bargiela, Milos Gojkovic, Sara Mijwel, Stefan Reitzner, David Wullimann, Emil Ahlstedt, Jernej Ule, Arne Östman and Randall S. Johnson,  eLife, online October 23, 2020, doi: 10.7554/eLife.59996", "posttime": "2020-10-28 04:16:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,shows,细胞", "title": "研究表明运动是如何通过免疫系统延缓癌症生长的", "title_en": "Study shows how exercise stalls cancer growth through the immune system", "transed": 1, "url": "https://news.ki.se/study-shows-how-exercise-stalls-cancer-growth-through-the-immune-system", "via": "", "real_tags": ["表明", "shows", "细胞"]}, {"category": "", "categoryclass": "", "imagename": "ca53241672ace6561f8ad80dc615dfd3.jpg", "infoid": 1031598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉(TSLA)-GET报告(GET Report)本周将推出全自动驾驶模式，尽管软件错误在意料之中，但该功能应该是一代人以来最重要的汽车开发。\n投资者可能错过了自动驾驶的揭晓。这条推文是在10月20日发布的，当时恰好是该公司公布第三季度收益的前一天晚上。\n自主性是汽车行业的圣杯。自20世纪60年代初以来，汽车和卡车仅由智能软件和传感器引导在高速公路上疾驰的想法一直是白日做梦。当时美国人痴迷于月球和太空时代。不知何故，带来免提地球导航的技术从未离开发射台。\n有一个很好的理由：把它做好是一项艰巨的工作。对于计算机系统来说，安全驾驶车辆是非常复杂的。我们理所当然地认为，我们的眼睛和情感可以如此迅速地分辨出虫子和石头冲向我们挡风玻璃的致命性。传感器和软件处理信息的效率几乎没有那么高。\n特斯拉首席执行官埃隆·马斯克(Elon Musk)自2016年以来一直承诺推出自动驾驶汽车。他非常有信心，承诺为每一辆新的特斯拉配备FSD所需的所有传感器和计算机处理设备。一篇公司博客文章承诺，当软件准备就绪时，只需将开关切换到免提驾驶即可。\n公平地说，已经取得了进展。5月份的空中软件更新带来了无人协助的车道变更。几周后，马斯克证实其车辆正在获得自动导航绿灯的能力。这两个进步都离自治又近了一步。\n上周的测试版更新包含了车道改变、绿灯导航和该公司自2016年以来一直在热衷于开发的其他一切功能。从车主在限量测试版中的反应来看，特斯拉走上了正轨。\n许多测试版测试人员已经证明，它可以完全自动导航通过拥挤的城市街道和蜿蜒的乡村道路。乘客可以进入目的地，然后坐下来看着汽车完成所有的驾驶过程。\n这一战略是特斯拉更大的AV计划的重要组成部分。它的一大批愿意进行测试版测试的人最接近于苹果公司((AAPL)-Get Report)推出操作系统升级，然后等待用户发现软件错误。这是开发代码的最有效方式。\n特斯拉还有一个额外的优势，那就是能够在这些错误实时发生时看到它们。每辆车都一直处于开机状态，并连接到公司的服务器，上传数兆字节的可用数据。网络学习意味着，当一辆车学习如何在马里布的一条蜿蜒道路上导航时，每一辆支持自动驾驶的车辆都会获得这些信息。\n特斯拉项目经理在4月份指出，车队规模达到100万辆。YouTube的演示强调了在自动驾驶下行驶的30亿英里，其中包括20万条自动变道。随着FSD软件被植入额外的Beta测试器，这些数字肯定会激增。\n自动化是特斯拉的一个明显优势，它正在引起车主的共鸣。然而，这一战略也存在相当大的风险。虽然更新后的iPhone可能会遭遇恼人的电池耗尽或数据丢失，但FSD特斯拉的软件故障可能会导致死亡。\n据“汽车与司机”报道，特斯拉FSD软件包最终将涨价2000美元。老实说，这个数字未来可能会更高，而且增长的是纯粹的利润率。此外，由于老款特斯拉配备了必要的硬件，它们的售后市场价值也应该会大幅上升。很难说AV功能可能值多少钱，但可能是相当可观的。\n目前股价在400美元区间深陷泥潭。市值已膨胀至3,960亿美元，超过福特((F)-GET REPORT)、通用汽车((GM)-GET REPORT)、菲亚特克莱斯勒((FCAU)-GET REPORT)和本田((HMC)-GET REPORT)的总和。特斯拉股票并不便宜。\n尽管如此，投资者低估了FSD软件对该行业的影响。在接近350美元的回调时买入特斯拉。\n资深科技专栏作家乔恩·马克曼(Jon Markman)是“战略优势”(Strategic Advantage)的出版人，这是一份颇受欢迎的每日时事通讯，内容是商业、娱乐和社会的伟大数字化转型-以及如何对其进行投资。*点击此处进行为期两周的免费试用。", "note_en": "Tesla (  ( TSLA) - Get Report) is rolling out a full self-driving mode this week, and although software bugs are to be expected, the feature should be the most important automotive development in a generation.\n Investors might have missed the self-driving reveal. It was unceremoniously  tweeted October 20. That happened to be the night before the company reported third quarter earnings.\n  Autonomy is the Holy Grail for the automotive sector. The idea of cars and trucks zipping down the highway guided only by smart software and sensors has been a pipedream since the early 1960s. Then Americans were obsessed with the moon and the space age. Somehow, the tech to bring handsfree earthly navigation never made it off the launch pad.\n There is a good reason: getting it right is hard work. Driving a vehicle safely is enormously complicated for a computer system. We take for granted how quickly our eyes and emotions distinguish between the lethality of bugs and stones hurtling toward our windshields. Sensors and software don’t process information nearly as efficiently.\n Elon Musk, Tesla’s chief executive, has been promising self-driving vehicles since 2016. He was so confident that he pledged to equip every new Tesla with all of the necessary sensors and computer processing equipment for FSD. When the software was ready, a corporate  blog post promised, it would simply be a matter of flipping the switch to handsfree driving.\n  In fairness, there has been progress. An over-the-air software update in May brought unassisted lane changes. A few weeks later Musk  confirmed that its vehicles were getting the ability to automatically navigate green lights. Both of these advances were one step closer to autonomy.\n The beta update last week incorporates lane changes, green light navigation and everything else that the company has been feverishly working on since 2016. Judging by the  reaction of owners in the limited release beta, Tesla is on the right track.\n Numerous beta testers have shown the can completely self-navigate through crowded city streets and winding country roads. Passengers are able to enter their destination, then sit back and watch as the car does all of the driving.\n The strategy is a big part of Tesla’s larger AV plan. Its large fleet of willing beta testers is the closest thing to  Apple (  ( AAPL) - Get Report ) rolling out an operating system upgrade, then waiting for users to uncover software bugs. It’s the most efficient way to develop code.\n Tesla has the added advantage of being able to see those bugs as they are occurring in real-time. Every vehicle is always on and connected to the company’s servers, uploading terabytes of useable data. Network learning means that when one vehicle learns how to navigate a winding road in Malibu, every Autopilot enabled vehicle gets that information.\n Tesla project managers noted in April that the fleet size reached 1 million vehicles. The YouTube  presentation highlighted 3 billion miles driven under Autopilot, including 200,000 automated lane changes. These numbers are certain to surge as FSD software is seeded with additional beta testers.\n Automation is a clear Tesla advantage, and it is resonating with owners. However, the strategy also carries considerable risks. While updated iPhones may suffer annoying battery drain or lost data, a software glitch for a FSD Tesla might result in death.\n  Car and Driver  reported the Tesla FSD software package will eventually get a $2,000 price bump. To be honest, that figure might be even more going forward, and the increase is pure profit margin. Also, because older Teslas are equipped with the necessary hardware, their aftermarket value should jump, too. It’s hard to say how much AV capabilities might be worth, but it’s probably substantial.\n Shares are currently mired in the $400 range. The market capitalization has swollen to $396 billion, more than the combined value of  Ford (  ( F) - Get Report ),  General Motors (  ( GM) - Get Report ),  Fiat Chrysler (  ( FCAU) - Get Report ) and  Honda (  ( HMC) - Get Report). Tesla stock is not cheap.\n Still, investors are underestimating the impact of FSD software for the sector. Buy Tesla on pullbacks toward $350.\n  Veteran tech columnist  Jon Markman is the publisher of Strategic Advantage, a popular daily newsletter about the great digital transformation of business, entertainment and society -- and how to invest in it.    Click here for a free two-week trial.", "posttime": "2020-10-28 04:16:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,突破,breakthrough,软件", "title": "特斯拉突破：全速行驶", "title_en": "Tesla Breakthrough: Going Full Auto", "transed": 1, "url": "https://www.thestreet.com/tech/news/teslajdm102620", "via": "", "real_tags": ["特斯拉", "突破", "软件"]}, {"category": "", "categoryclass": "", "imagename": "458ab6bdc94b29d145857f747e29597b.jpg", "infoid": 1031595, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，共和党占多数的联邦通信委员会在总统选举前的最后一次会议上再次投票反对网络中立规则，这可能会使联邦通信委员会重新转向民主党。\n今天的投票是在联邦上诉法院维持联邦通信委员会主席阿吉特·派(Ajit Pai)废除网络中立规则和放松宽带行业监管一年后进行的。虽然PAI在这场官司中大获全胜，但法官们将部分废止发回FCC，因为FCC未能审查其决定对公共安全的影响，未能充分解释(ISP)的重新分类对电杆附件监管意味着什么，也没有解决人们对放松管制将对FCC生命线项目产生影响的担忧，该项目为低收入美国人提供电话和互联网接入补贴。\n联邦通信委员会今天以3比2的投票结果批准了对法院还押指令的回应，但没有做出任何重大改变。FCC在声明中表示，在彻底审查了为回应其要求对这些问题发表更多评论而编制的记录后，FCC发现没有理由改变FCC在恢复互联网自由秩序中的结论。Remand令发现，恢复互联网自由令促进了公共安全，促进了互联网服务提供商的宽带基础设施部署，并允许FCC继续为宽带互联网接入服务提供生命线支持。&#34；该决定的草案版本可在此处获得。\n联邦通信委员会民主党人杰西卡·罗森沃塞尔和杰弗里·斯塔克斯今天持不同意见，称联邦通信委员会的多数派没有提供足够的理由坚持废除法案。罗森沃塞尔称这一命令是三个拼凑而成的论点，旨在告诉最高法院滚开，告诉公众我们对他们的意见不感兴趣，告诉历史我们缺乏承认错误的谦逊。斯塔克斯表示，他怀疑FCC对还押的回应能否让美国哥伦比亚特区巡回上诉法院的法官满意，如果FCC面临另一起诉讼，该法院可能会再次审理此案。\n联邦通信委员会多数人声称，监管确定性意味着放松监管，这将导致创新和投资的增加，这将增强公共安全。联邦通信委员会还表示，废除这一规定不太可能损害公共安全通信，任何影响都将是有限的，因为宽带互联网接入服务虽然重要，但只是更广泛的公共安全通信生态系统的一部分。虽然联邦通信委员会放弃了对宽带提供商的第二条授权，但该委员会声称，其他监管机构执行的反垄断和消费者保护法将确保公共安全机构能够适当地获得通信服务。", "note_en": "The Republican-majority Federal Communications Commission took another vote against net neutrality rules today in its last meeting before a presidential election that could swing the FCC back to the Democratic party.\n Today&#39;s vote came a year after a federal appeals court  upheld FCC Chairman Ajit Pai&#39;s repeal of net neutrality rules and deregulation of the broadband industry. Though Pai was mostly victorious in the case, the judges remanded portions of the repeal back to the FCC because the commission &#34;failed to examine the implications of its decisions for public safety,&#34; failed to &#34;sufficiently explain what reclassification [of ISPs] will mean for regulation of pole attachments,&#34; and did not address concerns about the effect deregulation would have on the FCC&#39;s Lifeline program, which subsidizes phone and Internet access for low-income Americans.\n The FCC approved its response to the court&#39;s remand instructions in a 3-2 vote today, but didn&#39;t make any significant changes. &#34;After thoroughly reviewing the record compiled in response to its request for additional comment on these issues, the FCC found no basis to alter the FCC&#39;s conclusions in the Restoring Internet Freedom Order,&#34; the commission said in its  announcement. &#34;The Order on Remand finds that the Restoring Internet Freedom Order promotes public safety, facilitates broadband infrastructure deployment by Internet service providers, and allows the FCC to continue to provide Lifeline support for broadband Internet access service.&#34; A draft version of the decision is  available here.\n  FCC Democrats Jessica Rosenworcel and Geoffrey Starks dissented today, saying the FCC majority didn&#39;t provide a good enough justification for sticking with the repeal as is. Rosenworcel called the order &#34;a set of three cobbled-together arguments designed to tell the court to go away, the public that we are not interested in their opinion, and history that we lack the humility to admit our mistake.&#34; Starks said he doubts that the FCC&#39;s response to the remand will satisfy judges at the US Court of Appeals for the District of Columbia Circuit, which could take up the case again if the FCC faces another lawsuit.\n The FCC majority claimed that &#34;regulatory certainty,&#34; meaning deregulation, results in increased innovation and investment that &#34;will enhance public safety.&#34; The FCC also said the repeal &#34;is unlikely to harm public safety communications,&#34; and that any impact &#34;would be limited because broadband Internet access service, while important, is only a part of the broader public safety communications ecosystem.&#34; While the FCC gave up its Title II authority over broadband providers, the commission claims that antitrust and consumer-protection laws enforced by other regulators will ensure that public safety agencies have appropriate access to communications services.", "posttime": "2020-10-28 04:01:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "fcc", "title": "PAI的FCC在选举前再挤出一票反对网络中立", "title_en": "Pai’s FCC squeezes in one more vote against net neutrality before election", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/pais-fcc-squeezes-in-one-more-vote-against-net-neutrality-before-election/", "via": "", "real_tags": ["fcc"]}, {"category": "", "categoryclass": "", "imagename": "b70de89986a0fd36954432fa9824193a.jpeg", "infoid": 1031594, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦(路透社)-周二的一项研究发现，英国人群中针对这种新型冠状病毒的抗体在夏季迅速下降，这表明感染后的保护可能不会持续很长时间，并增加了社区免疫力减弱的可能性。\n伦敦帝国理工学院的科学家在3月和4月的第一波新冠肺炎感染后跟踪了英国人口中的抗体水平。\n他们的研究发现，抗体流行率下降了四分之一，从6月底左右占总人口的6%下降到9月份的4.4%。这增加了在最近几周第二波感染之前人口免疫力下降的可能性，这迫使当地封锁和限制。\n尽管对这种新型冠状病毒的免疫是一个复杂而模糊的领域，可能会得到T细胞和B细胞的帮助，这些细胞可以在再次接触病毒后刺激抗体的快速产生，但研究人员表示，其他冠状病毒的经验表明，免疫可能不会持久。\n伦敦帝国理工学院传染病系主任温迪·巴克利告诉记者：“我们可以看到抗体，我们可以看到它们在下降，我们知道抗体本身具有相当强的保护性。”\n“根据证据的权衡，我想说，根据我们对其他冠状病毒的了解，免疫力的下降速度似乎与抗体下降的速度相同，这是人群免疫力下降的一个迹象。”他说，“根据我们对其他冠状病毒的了解，免疫力的下降速度与抗体下降的速度是一样的，这是人群免疫力下降的一个迹象。”\n与那些没有症状、没有意识到自己最初感染的人相比，那些被金标准聚合酶链反应确认为新冠肺炎的人的抗体下降得不那么明显。\n医护人员的抗体水平没有变化，可能是由于反复接触病毒所致。\n这项研究支持了德国类似调查的结果，该调查发现，绝大多数人没有新冠肺炎抗体，即使在疾病的热点地区也是如此，而那些有抗体的人体内的抗体可能会消退。\n世界卫生组织发言人塔里克·贾萨雷维奇(Tarik Jasarevic)表示，免疫能持续多久的不确定性，以及大多数人从一开始就没有抗冠状病毒抗体的事实，表明有必要打破传播链。\n他在日内瓦的一次联合国简报会上说：“仅仅通过让病毒在人群中传播来获得这种集体免疫力并不是一个真正的选择。”\n帝国理工学院的这项研究基于对365,000名随机选择的成年人的调查，是作为印刷前论文发布的，尚未经过同行评议。\n帝国理工学院的巴克莱说，抗体的迅速减弱并不一定会影响目前正在进行临床试验的候选疫苗的疗效。", "note_en": "LONDON (Reuters) - Antibodies against the novel coronavirus declined rapidly in the British population during the summer, a study found on Tuesday, suggesting protection after infection may not be long lasting and raising the prospect of waning immunity in the community.\n  Scientists at Imperial College London have tracked antibody levels in the British population following the first wave of COVID-19 infections in March and April.\n Their study found that antibody prevalence fell by a quarter, from 6% of the population around the end of June to just 4.4% in September. That raises the prospect of decreasing population immunity ahead of a second wave of infections in recent weeks that has forced local lockdowns and restrictions.\n Although immunity to the novel coronavirus is a complex and murky area, and may be assisted by T cells, as well as B cells that can stimulate the quick production of antibodies following re-exposure to the virus, the researchers said the experience of other coronaviruses suggested immunity might not be enduring.\n  “We can see the antibodies and we can see them declining and we know that antibodies on their own are quite protective,” Wendy Barclay, head of the Department of Infectious Disease at Imperial College London told reporters.\n “On the balance of evidence I would say, with what we know for other coronaviruses, it would look as if immunity declines away at the same rate as antibodies decline away, and that this is an indication of waning immunity at the population level.”\n Those for whom COVID-19 was confirmed with a gold standard PCR test had a less pronounced decline in antibodies, compared to people who had been asymptomatic and unaware of their original infection.\n  There was no change in the levels of antibodies seen in healthcare workers, possibly due to repeated exposure to the virus.\n The study backs up findings from similar surveys in Germany which found the vast majority of people didn’t have COVID-19 antibodies, even in hotspots for the disease, and that antibodies might fade in those who do.\n World Health Organisation spokesman Tarik Jasarevic said that uncertainty over how long immunity would last and the fact most people had never had antibodies against the coronavirus in the first place showed the need to break transmission chains.\n  “Acquiring this collective immunity just by letting virus run through the population is not really an option,” he told a U.N. briefing in Geneva\n Imperial’s study, based on a survey of 365,000 randomly selected adults, was released as a pre-print paper, and has not yet been peer-reviewed.\n The rapid waning of antibodies did not necessarily have implications for the efficacy of vaccine candidates currently in clinical trials, Imperial’s Barclay said.", "posttime": "2020-10-28 03:56:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "研究,study,抗体", "title": "英国研究发现新冠肺炎抗体免疫力随时间推移而减弱的证据", "title_en": "UK Study Finds Evidence of Waning Antibody Immunity To COVID-19 Over Time", "transed": 1, "url": "https://uk.reuters.com/article/uk-health-coronavirus-britain-antibody/uk-study-finds-evidence-of-waning-antibody-immunity-to-covid-19-over-time-idUKKBN27C005", "via": "", "real_tags": ["研究", "study", "抗体"]}, {"category": "", "categoryclass": "", "imagename": "0171b1711c0cd0c17e14a1d388488895.jpeg", "infoid": 1031592, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在看似没完没了的新冠肺炎疫情的刺激下-毫无疑问，推特等公司也采取了类似的举措-Reddit今天宣布了为员工提供远程工作机会的计划。该公司今天在一篇博客文章中宣布了这一举措，并指出了该规则的一些实际例外，包括那些工作设施和IT支持角色。\n“展望未来，”雷迪特写道，“我们希望满足员工的需求，这样他们才能尽力而为，尤其是在一个不确定的时期。当我们实现为世界上每个人创造归属感的使命时，我们希望Reddit定位为一支多样化的劳动力队伍，就像它的社区和用户生态系统一样。“。\n该公司表示，它将继续提供在办公室工作(或远程和办公室工作相结合)的能力，尽管物理空间将被“重新想象”-这一举措可能会受到褒贬不一的反应，具体取决于员工对办公室空间的期待。\n“想象一下：休闲和咖啡馆式的座椅，低头集中注意力的私人空间，更大的可预订资源和团队战略上满足IRL的协作空间，”它写道，“没有更多的固定办公桌-我们将有供团队聚集的社区，以及供在办公室工作的员工预订的办公桌。”\n从声音上看，它更像是一个联合办公空间，而不是传统的办公室。此举还意味着Reddit将重新考虑薪酬，为纽约和旧金山等生活成本较高的地方提供预留的薪酬，而不考虑员工的位置。", "note_en": "Spurred on by the seemingly endless COVID-19 pandemic — and no doubt inspired by similar moves from companies like Twitter —  Reddit   today announced plans to offer its staff the opportunity to work remotely, going forward. The company announced the move in  a blog post today, noting some practical exceptions to the rule, including those working facilities and IT support roles.\n “Looking ahead,” Reddit writes, “we want to meet the needs of our employees so they can do their best work, especially in a time of uncertainty. And as we deliver on our mission of creating belonging for everyone in the world, we want Reddit to be positioned as a workforce that’s as diverse as its ecosystem of communities and users.”\n  The company says it will continue to offer the ability to work from its office (or a combination of remote and office work), though the physical spaces will be “reimagined” — a move that likely will be met with a mixed reception depending on what employees look for in an office space.\n “Imagine: casual and coffee shop-style seating, private space for heads-down focusing, larger bookable resources and collaboration spaces for teams to strategically meet IRL,” it writes, “and no more fixed desks—we’ll have neighborhoods for teams to gather and bookable desks for employees working in the office.”\n It’s more akin to a co-working space than a traditional office from the sound of it. The move also means Reddit will be rethinking salaries, offering salaries reserved for places with high cost of living like New York and San Francisco, regardless of the employee’s location.", "posttime": "2020-10-28 03:54:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,员工,work", "title": "Reddit表示，未来它将允许员工在家工作，但有一些例外，而且美国员工无论在哪里工作，他们的工资都是一样的", "title_en": "Reddit says that moving forward it will let employees work from home, with some exceptions, and that US staff will be paid the same, wherever they work from", "transed": 1, "url": "https://techcrunch.com/2020/10/27/reddit-will-allow-employees-to-work-from-anywhere-going-forward/", "via": "", "real_tags": ["美国", "员工", "work"]}, {"category": "", "categoryclass": "", "imagename": "3f63dd74cd861f1efc9abcb14a5d063d.jpg", "infoid": 1031591, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一项研究，冠状病毒幸存者可能面临永久性认知损伤的风险，该研究发现，在最糟糕的情况下，感染可能会导致智力下降，相当于智商下降8.5点或大脑老化10年。\n科学家说，许多人在从病毒中恢复几周或几个月后报告的“大脑迷雾”可能是更严重的认知缺陷的症状。\n对84,285名确诊或疑似新冠肺炎康复的人进行的研究发现，根据感染的严重程度，大脑受到了不同程度的损伤。然而，需要更多的工作来确定这种情况会持续多久。\n受影响最严重的患者，那些在重症监护病房接受治疗或需要通气的患者，遭受的变化相当于智商下降8.5分或大脑老化10年。\n伦敦帝国理工学院(Imperial College London)脑科学系医学院的亚当·汉普希尔(Adam Hampshire)是这项研究的主要作者，他表示，“令人震惊”的结果不仅适用于那些住院的患者。那些没有呼吸困难但检测呈阳性的人也表现出认知能力下降。在家中康复的人平均缺陷相当于衰老5岁或智商下降4分。\n汉普希尔博士说：“这是一个足够大的差异，作为一个人，你会注意到这对你处理正常工作和日常生活的能力产生了影响。”“这一结果与许多人报告的‘大脑迷雾’相一致，即使在康复几个月后，他们也表示无法像以前那样专注于工作或专注于工作。”\n来自帝国理工学院、剑桥大学、芝加哥大学和伦敦国王学院的研究小组还发现，与没有感染病毒的人相比，幸存者在逻辑和词义、空间方向、保持注意力和处理情绪的测试中得分较低。\n他们的论文说，这一结果应该是对冠状病毒如何影响大脑进行进一步研究的“号角”。\n“从疑似或确诊的新冠肺炎中康复的人在多个领域的认知测试中的表现比预期的要差，考虑到他们详细的年龄和人口统计特征，”报告说。\n“这一缺陷与症状严重程度成正比，在那些没有住院治疗的人中表现得尤为明显。”\n这项研究的参与者被要求做九项任务来评估他们的认知功能，结果由一个专家小组进行分析。为了避免偏见，直到研究结束后，受试者才被告知研究正在评估冠状病毒的影响。\n在84,285名参与者中，60人表示他们已经安装了呼吸机，147人在没有呼吸机的情况下在医院接受治疗。\n另有176人因呼吸困难而需要在家治疗，3466人呼吸困难但没有接受医疗援助，9201人报告生病但没有表现出呼吸症状。\n作者确实注意到，为任何疾病在重症监护或呼吸机上花费的时间都会对认知功能产生影响。\n到目前为止，几乎没有收集到关于冠状病毒认知影响的临床数据。然而，坊间传闻，幸存者和他们的医生报告了“长时间昏厥”的症状，最常见的是无法动摇的疲惫和疲倦。\n最初的研究是在5月份进行的，目前正在进行更多的工作，以评估康复几个月后对相同受试者的认知影响。为了更深入地了解对大脑的损害，研究小组将交叉参考来自行为研究的结果，并进行详细的成像。\n这些数据取自“英国大智商测试”，并鼓励参与者加入正在进行的研究。\n由于担心这种病毒会对健康产生持久的影响，英格兰各地的诊所现在都在为有“长Covid”症状的人提供专家帮助。\n全科医生、呼吸顾问、理疗师和其他专家将帮助评估、诊断和治疗数以千计的患者，这些患者报告的症状包括呼吸困难、慢性疲劳、“脑雾”、焦虑和压力。\n越来越多的医学证据和患者证词表明，相当一部分冠状病毒幸存者在生病几个月后无法摆脱影响。\n一些估计表明，10%的冠状病毒患者可能在感染三周后仍有症状，可能有6万人在三个多月后出现长期Covid症状。", "note_en": "Coronavirus survivors may be at risk of lasting cognitive damage, according to a study that found that in the worst cases the infection can cause mental decline equivalent to an 8.5-point fall in IQ or the brain ageing ten years.\n The “brain fog” reported by many people weeks and months after their recovering from the virus may be a symptom of more serious cognitive deficits, scientists have said.\n Research involving 84,285 people who had recovered from confirmed or suspected Covid-19 found that damage to the brain had happened to varying extents, depending upon the severity of the infection. However, more work is needed to identify how long this lasts.\n  The worst-affected patients, those who were treated in intensive care or needed ventilation, suffered changes equivalent  to an 8.5-point drop in IQ or the brain ageing ten years.\n  Adam Hampshire, of the faculty of medicine, department of brain sciences at Imperial College London, who was lead author of the study, said the “shocking” results applied to more than only those patients who had been in hospital. Those who had had no breathing difficulties but had tested positive also exhibited cognitive decline. People who had recovered at home had an average deficit equivalent to ageing five years or dropping four IQ points.\n  “This is a large enough difference that as an individual you would notice an impact on the ability to cope with your normal job and everyday life,” Dr Hampshire said. “The results align with the ‘brain fog’ reported by many people who, even months after recovery, say they are unable to concentrate on work or focus how they did before.”\n The team, from Imperial College, the University of Cambridge, the University of Chicago and King’s College London, also found that compared to people who had not had the virus survivors scored poorly on tests for logic and the meaning of words, spatial orientation, maintaining attention and processing their emotions.\n The results should be a “clarion call” for further work to be carried out on how the coronavirus affects the brain, their paper said.\n “Individuals who recovered from suspected or confirmed Covid-19 perform worse on cognitive tests in multiple domains than would be expected given their detailed age and demographic profiles,” it said.\n “This deficit scales with symptom severity and is evident among those without hospital treatment.”\n Participants in the study were asked to do nine tasks to assess their cognitive function, and the results were analysed by a team of experts. To avoid bias, the subjects were not told that the study was assessing the effects of the coronavirus until after they had finished.\n   Of the 84,285 people who took part, 60 said that they had been put on a ventilator and 147 were cared for in hospital without a ventilator.\n Another 176 had needed medical care at home for breathing difficulties, 3,466 had had breathing difficulties but received no medical aid, and 9,201 reported having been ill but without showing breathing symptoms.\n The authors did note that time spent in intensive care or on a ventilator for any disease would have an impact on cognitive function.\n Until now there has been little clinical data gathered on the cognitive effects of the coronavirus. Anecdotally, however, survivors and their doctors have reported symptoms of “long Covid”, the most common being unshakeable fatigue and weariness.\n  The initial study was done in May and more work is being carried out to assess the cognitive effects on the same subjects several months after recovery. To get a deeper understanding of the damage to the brain, the team will cross reference results from the behavioural study with detailed imaging.\n The data was taken from the Great British Intelligence Test and participants are being encouraged to join the ongoing research.\n People who have “long Covid” symptoms are now being offered specialist help at clinics across England because of concerns that the virus will have lasting effects on health.\n GPs, respiratory consultants, physiotherapists and other specialists will help to assess, diagnose and treat thousands of sufferers who have reported symptoms ranging from breathlessness, chronic fatigue, “brain fog”, anxiety and stress.\n There is increasing medical evidence and patient testimony that a significant minority of coronavirus survivors cannot shake off the effects months after falling ill.\n Some estimates suggest that 10 per cent of coronavirus patients may still be experiencing symptoms more than three weeks after infection, and perhaps 60,000 people could be suffering from long Covid symptoms after more than three months.", "posttime": "2020-10-28 03:40:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,智商,age", "title": "冠状病毒可能使大脑老化10年或导致智商下降。", "title_en": "Coronavirus could age the brain by 10 years or cause IQ to fall", "transed": 1, "url": "https://www.thetimes.co.uk/article/coronavirus-could-age-the-brain-by-10-years-or-cause-iq-to-fall-v9s273rbs?shareToken=2efeacb323b9b69bade9b36df9c8c0b2&fbclid=IwAR22OeLx7BEsttvG0GYZhk7l6QZ622uAdUDWNFNBRBwTI-hP6nqbYkRN1E0", "via": "", "real_tags": ["病毒", "冠状病毒", "智商", "age"]}, {"category": "", "categoryclass": "", "imagename": "9e0f7dd112e98930aeeb0d94706afd07.jpg", "infoid": 1031590, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近年来，太阳能和风能的成本急剧下降，这加速了这些可再生能源技术的增长。公用事业公司现在越来越多地规划以太阳能和风能为主的未来电网。这将需要改变电网管理和传输升级，以及增加存储，以平滑来自可变发电机的供应。\n网格存储仍处于早期阶段，但随着该行业的成熟，我们已经看到成本大幅降低。美国能源情报署(EIA)最近强调了这一点，显示美国电网规模的电池项目成本在短短几年内下降了70%。\n2015至2018年间，平均项目成本从每千瓦时储存2152美元下降到625美元。要扩大电网电池的规模，成本还需要进一步降低，但这在短时间内是一个巨大的进步。\n截至2018年底，美国电池发电能力为869兆瓦，能源能力为1236兆瓦时。(电力是电池可以供电的速率，而能量是电池从充满到空时可以提供的总电量。)。EIA还拥有2019年的安装数据，其中又增加了150兆瓦/450兆瓦时。仅在2020年的前7个月，又安装了300兆瓦的电力装机容量。\nEIA并不认为这一趋势会放缓。该公司预计，“未来几年”，电池存储装机容量将增加6900兆瓦--这个数字很模糊，足以让计划中的项目迅速飙升。\n虽然你可能会认为一个电池和另一个电池大同小异，但在最近项目的平均成本中隐藏着地区差异。例如，在PJM管理的电网的中西部至大西洋中部地区，2013至2018年间的平均成本为每千瓦时1,946美元。夏威夷的项目平均每千瓦时只有947美元。\n这种差异很大程度上可以用电池有很多不同的用途这一事实来解释。例如，在PJM地区，如果计算每千瓦而不是每千瓦时，这一成本将降至1004美元。按照这个标准，夏威夷的平均成本高达1498美元。", "note_en": "In recent years, the cost of solar and wind energy has declined precipitously, which has accelerated the growth of these renewable energy technologies. Increasingly, utilities are now planning for a future grid dominated by solar and wind. That will require changes in grid management and transmission upgrades as well as the addition of storage to smooth out the supply from variable generators.\n Grid storage is still pretty early days, but we’re already seeing huge cost reductions as the industry matures. The US Energy Information Administration (EIA)  highlighted this recently, showing that grid-scale battery-project costs in the United States dropped 70 percent in just a few years.\n Between 2015 and 2018, average project costs decreased from $2,152 per kilowatt-hour of storage to $625. Costs will need to drop much more for grid batteries to scale, but that’s a huge improvement in a short period of time.\n  By the end of 2018, the US had 869 megawatts of battery power capacity and 1,236 megawatt-hours of energy capacity. (Power is the rate at which the batteries can supply electricity, while energy is the total amount it can supply when going from full charge to empty.) EIA also has installation data for 2019, which saw the addition of another 150 megawatts/450 megawatt-hours. And in just the first seven months of 2020, yet another 300 megawatts of power capacity were installed.\n EIA doesn’t see this slowing down. It expects installed battery storage to increase by 6,900 megawatts “in the next few years”—a figure ambiguous enough to allow for a rapid spike in planned projects.\n While you might think that one battery is more or less the same as another, there are regional differences hidden within the average costs of recent projects. In in the Midwest-to-mid-Atlantic region of the grid managed by PJM, for example, the average cost between 2013 and 2018 was $1,946 per kilowatt-hour. Projects in Hawaii averaged just $947 per kilowatt-hour.\n  Much of this difference can be explained by the fact that batteries are serving many different purposes. In the PJM region, for example, that cost drops to $1,004 if you calculate it per kilowatt rather than per kilowatt-hour. And by that metric, Hawaii’s average cost goes up to $1,498.", "posttime": "2020-10-28 03:26:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,电网,battery,电池", "title": "美国电网电池成本在3年内下降了70%", "title_en": "US grid-battery costs dropped 70% over 3 years", "transed": 1, "url": "https://arstechnica.com/science/2020/10/us-grid-battery-costs-dropped-70-over-3-years/", "via": "", "real_tags": ["美国", "电网", "battery", "电池"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031589, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我曾在几个拥有大量Linux系统的地方工作过。我说的是远远超过一百万的。当你有那么多需要放牧的猫时，有时你必须立即对一大群猫做点什么。偶尔，你甚至需要一次触摸所有的东西。\n我的经验是，拥有如此庞大船队的公司往往会制造工具，让他们做到这一点。这些工具的名称不同，但其要点大致相同：以root身份使用SSH登录，运行一些命令，并可能返回退出代码和/或输出。\n在某些情况下，这正是扑灭大火所需要的，而这正是你庆幸它存在的时候。\n然而，这篇帖子并不是关于这个的。这篇帖子是关于硬币的另一面，在那里有人使用了这些工具之一，并制造了一个问题。也许他们决定以这种方式推出翻转旗帜，而不是使用最佳实践(测试、金丝雀、百分比推出，诸如此类)。也许他们决定一次将一个新的二进制文件推送到每台机器上，因此他们同时退出，没有能力运行实际的站点。\n我已经要求人们把一些东西放进他们的工具中，以防止某些类型的灾难。它的目的是解决某些特定情况，即有人运行命令并以太多的计算机为目标。也许他们想触摸一架测试主机(40台左右)，但却意外地选择了所有主机。\n我的要求很简单：如果您要生成确认提示作为健全性检查，*不要将其设置为Y/N类型。取而代之的是，让他们读一个数字，然后把它插回去。\n胡说八道，123456台机器将受此影响。继续吗？输入要确认的计算机数量：\n然后，您的选择是准确地键入123456&34；以放手，或者键入任何其他内容以中止。\n这个想法是迫使你通过你常用的输入设备(我会说眼睛，但有些人正在使用文本到语音的东西或类似的东西，他们也算在内)输入这个数字，用你的湿器咀嚼它，然后以某种方式将它反馈到电脑中。增加几个这样的额外步骤有望激活你足够的大脑，让你在用巨型脚枪炸掉你的整条腿之前停下来。\n当然，如果您经常遇到这种情况，并且您实际上打算使用那么多机器，那么可能会有人开始剪切和粘贴数字。在这种情况下，我会说您使用该工具的频率太高了，应该考虑一下改变做事的方式，以避免不得不如此依赖它。\n现在，现实就是这样，在一家特定的公司里，停止使用它可能不是一件容易的事。如果这就是正在进行的事情，那么稍微拆分一下数字可能会很有趣，这样它就不会被粘贴进去，不得不在做这项工作的人之间来回往返了一遍。\n这可能很简单，只需用您所在地区的数字分隔符(如123,456&34；或123.456&34；或123#34；123,456&34；或您可能使用的任何其他分隔符)打印数字即可。然后，诀窍是不接受它作为输入，而是要求他们移除分隔符，并将其作为数字插入。\n胡说八道123,456台机器将受到影响。继续吗？输入要确认的机器数量：123456确定！还在继续。\n我在多个场合见过这种技术救人，并在这里分享，希望它能帮助他人。如果你正在设计一些相当强大的东西，可以考虑让它变得安全。\n试想一下：数字从屏幕上跳出来，跳到人身上，在他们的脑袋里跳来跳去，然后回到电脑里。除了网什么都没有。", "note_en": "I&#39;ve worked at a few places that had a large number of Linux boxes. I&#39;m talking about well over a million. When you have that many cats which need herding, sometimes you have to do things to big groups of them at once. Once in a while, you even have to touch all of them at once.\n It&#39;s been my experience that companies which possess such massive fleets tend to create tooling which will let them do exactly that. These tools have different names, but the gist of it is about the same: ssh in as root, run some command, and maybe return the exit code and/or output.\n For certain situations, this is exactly what is needed to put out a fire, and that&#39;s when you&#39;re thankful it exists.\n This post, however, is not about that. This post is about the other side of the coin which is where someone uses one of these tools and  creates a problem. Maybe they decide to roll out a &#34;flag flip&#34; this way instead of using best practices (tests, canaries, percentage rollouts, that kind of thing). Perhaps they decide to push a new binary to every machine at once and so they all drop out at the same time, leaving no capacity to run the actual site.\n There&#39;s something I&#39;ve asked people to put into their tools to prevent certain kinds of disasters. It&#39;s intended to address the specific situation where someone runs the command and targets far too many machines. Maybe they wanted to touch a rack of test hosts (40 or so), but accidentally selected  all of them.\n  My request is simple enough: if you&#39;re going to generate a confirmation prompt as a sanity check, *don&#39;t* make it a Y/N type of thing. Instead, ask them to read a number and plug it back in.\n  Blah blah blah 123456 machines will be affected by this. Proceed? Enter number of machines to confirm:\n Your options are then to type in exactly &#34;123456&#34; to let it go, or anything else to abort.\n The idea is to force you to take in that number through your usual input devices (I&#39;d say eyes, but some people are using text-to-speech stuff or similar, and they count too), chew on it with your wetware, and then feed it back into the computer somehow. Adding a few extra steps like this will hopefully activate enough of your brain to make you stop short before blowing off your entire leg with a giant foot-gun.\n Of course, if you run into this a lot and you actually intend to hit that many machines, someone might start cutting and pasting the number. In that case, I would say that you&#39;re using that tool far too often, and should take a look at changing the way things are done to avoid having to rely on it this much.\n Now, reality being what it is, &#34;stop using it&#34; might not be easily done in a given company. If that&#39;s what&#39;s going on, then it might be interesting to split up the number a bit so it can&#39;t just be pasted in and has to make a round-trip through the human doing the work.\n This might be as simple as printing the number with your locale&#39;s version of numerical separators, like &#34;123,456&#34; or &#34;123.456&#34; or &#34;123 456&#34; or whatever else you might use where you are. The trick is then to NOT accept that as input, but instead demand that they remove the separator and jam it in as just digits.\n Blah blah blah 123,456 machines will be affected. Proceed? Enter number of machines to confirm: 123456OK! Continuing.\n I&#39;ve seen this technique save people on multiple occasions, and share it here in the hopes it helps others. If you&#39;re designing something rather powerful, consider making it safe this way.\n Just think: the numbers come off the screen, leap into the person, bounce around the inside of their head, and go back into the computer. Nothing but net.", "posttime": "2020-10-28 03:14:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "继续,exact,数字", "title": "键入要继续操作的确切计算机数量", "title_en": "Type in the exact number of machines to proceed", "transed": 1, "url": "https://rachelbythebay.com/w/2020/10/26/num/", "via": "", "real_tags": ["继续", "exact", "数字"]}, {"category": "", "categoryclass": "", "imagename": "d08b14e69c46ce57333633f19d119787.png", "infoid": 1031588, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "&lt；-其他新闻GitHub今天我们发布Deno 1.5.0。此版本包含一些新功能、许多功能稳定和大量错误修复。以下是一些亮点：\n新的和改进的捆绑：Deno捆绑Nowhas树抖动，比1.4快15倍。\n对REPL的改进：制表符完成、代码语法突出显示和顶级等待现在可用。\n如果您已经安装了Deno，您可以通过运行Deno Upgrade升级到1.5。如果您是第一次安装Deno，您可以使用下面列出的方法之一：\n自从上次发布以来，我们一直在努力重构我们的整个TypeScript编译器基础设施。正因为如此，我们才能够用基于SWC的新捆绑器取代鼓励捆绑的基础设施。\n当我们键入--检查您的代码时，这将导致性能提高3倍，如果您使用--no-check标志，性能将提高15倍。\n除了性能改进之外，捆绑程序现在还能够对您的代码进行树形共享。这意味着它将从捆绑包中删除您实际不使用的代码。这导致捆绑包的大小大幅减小。例如，与1.4相比，FILE_SERVER示例的捆绑包在1.5版中要小35%。\n捆绑包现在也作为标准ES模块发出，这意味着dynamic icimport现在可以正常工作了，并且port.meta.url也设置正确了。如果您使用Deno为浏览器捆绑代码，请确保现在将捆绑包作为ES模块加载(&lt；脚本&gt；标记上的type=&#34；module&#34；属性)。\n此版本添加了Web平台API警报、确认和提示。这些功能与浏览器中的功能相同：\n报警将一条消息记录到终端，然后同步阻止，直到您确认为止(用[Enter]键)。\n确认向用户提示一条消息，然后同步阻止，直到用户回复y或n(表示是或否)。\n提示要求用户输入一些内容，并同步阻止，直到用户输入文本并按下[Enter]。\n下面是这些功能的实际运行的一个小演示。您可以通过运行Deno Run https://deno.land/posts/v1.5/alert_confirm_prompt.js.来试用它。\nREPL进行了重大重构，启用了几个新功能。以下是一些亮点：\n按Tab键完成对象属性和方法：要使用此功能，只需按Tab键在属性和方法列表之间循环。\n代码语法突出显示：如果您的终端支持颜色，您输入的代码现在语法突出显示。您可以使用NO_COLOREnvironment变量禁用此功能。\n顶级等待支持：您现在可以只等待REPL中的承诺，而不必将您的呼叫包装在异步生活中。\n此版本默认情况下为所有用户启用solatedModules typecript编译器选项。在1.4版中，使用--unstant的用户启用了此标志。此选项在TypeScript编译器中启用了一些更严格的检查，这些检查可能会导致一些您以前从未见过的新错误：\n错误TS1205：提供&#39；--solatedModules&#39；标志时重新导出类型需要使用&#39；导出类型&#39；。\n重新导出接口或类型别名时会出现这些错误。要修复该错误，请将您的重新导出更改为使用导出类型。示例：\n我们已经稳定了Deno.fsync()、Deno.fdatync()和它们的同步副本。这些低级方法用于确保修改后的文件数据写入磁盘驱动器。\nSleepSync()-此函数可用于同步休眠。这将阻塞事件循环，阻塞所有异步操作和JavaScriptExecution。在大多数情况下，您需要使用setTimeout来休眠，因为这不会阻塞事件循环。\nDeno.systemCpuInfo()-此函数可用于获取有关机器中可用内核数量以及CPU速度的信息。\nDeno lint在这个版本中得到了一些新的规则。主要的是CamelCase：它检查您的所有变量声明是否使用CamelCase格式。我们希望在Deno 1.6中稳定Deno皮棉。\n除了新的规则之外，我们还引入了皮棉诊断提示，这些提示将建议如何修复皮棉错误。\n最后，Deno lint现在有了一个网站，您可以用它来查看规则的文档和解释。你可以在https://lint.deno.land.上找到它。\nDeno fmt--Ignore标志现在可用，但不带--不稳定标志。此标志可用于忽略格式化程序格式化或检查的某些文件或文件夹。\nStd/test/asserts.ts中的assertStringContaines和assertArrayConcludes方法已分别重命名为assertStringIncludes和assertArrayIncludes，以便与字符串和数组上的IncludesMethod的命名相匹配。要更新代码，只需重命名导入的方法：", "note_en": "&lt;- Other News   GitHub      Today we are releasing Deno 1.5.0. This release contains a few new features,many feature stabilizations, and a ton of bug fixes. Here are some highlights:\n New and improved bundling:  deno bundle nowhas tree shaking, and is up to 15x faster than 1.4\n  Improvements to the REPL: tab completion,code syntax highlighting and top level await are now available\n If you already have Deno installed you can upgrade to 1.5 by running deno upgrade. If you are installing Deno for the first time, you can use oneof the methods listed below:\n      Since the last release we have been hard at work to refactor our entireTypeScript compiler infrastructure. Because of this we were able to replace ouraging bundling infrastructure with a new bundler based on swc.\n This has led to a  3x performance improvement when we type-check your code,and up to a  15x improvement if you use the  --no-check flag.\n In addition to the performance improvements the bundler is now capable of treeshaking your code. This means it will remove code from the bundle that you arenot actually using. This leads to a major size reductions in bundles. Forexample a bundle of the file_server example is  35%smaller in 1.5 when comparing to 1.4.\n Bundles are now also emitted as a standard ES module, which means that dynamicimport will work correctly now, and  import.meta.url is also set correctly. Ifyou were using Deno to bundle code for the browser, make sure to load the bundleas an ES module now ( type=&#34;module&#34; attribute on your  &lt;script&gt; tag).\n   This release adds the web platform APIs  alert,  confirm, and  prompt. Thesehave the same functions as they do in the browser:\n alert logs a message to the terminal, and then synchronously blocks untilyou confirm (with  [Enter]).\n confirm prompts the user with a message, and then synchronously blocks untilthe user responds with either  y or  n (to signal  yes or  no).\n prompt requests some input from the user, and blocks synchronously until theuser has entered the text and pressed  [Enter].\n Here is a little demo of these functions in action. You can try it out byrunning  deno run https://deno.land/posts/v1.5/alert_confirm_prompt.js.\n     The REPL has had a major refactor enabling several new features. Here are someof the highlights:\n Tab completion of object properties and methods: to use this, just press Tab to cycle through the list of properties and methods.\n Code syntax highlighting: code that you enter is now syntax highlighted ifyour terminal supports colors. You can disable this with the  NO_COLORenvironment variable.\n Top level await support: you can now just  await promises in the REPLwithout having to wrap your call in an async IIFE.\n    This release enables the  isolatedModules TypeScript compiler option for allusers by default. In the 1.4 release this flag was enabled for users using --unstable. This option enables some stricter checks in the TypeScriptcompiler that will likely lead to some new errors you have not seen before:\n ERROR TS1205: Re-exporting a type when the &#39;--isolatedModules&#39; flag is provided requires using &#39;export type&#39;.\n These errors occur when interfaces or type aliases are re-exported. To fix theerror, change your re-exports to use  export type. Example:\n     We have stabilized  Deno.fsync(),  Deno.fdatasync(), and their synchronouscounterparts. These low-level methods are for ensuring modified file data iswritten to the disk drive.\n  Deno.sleepSync() - This function can be used to synchronously sleep. Thiswill block the event loop, blocking all async operations, and JavaScriptexecution. In most cases you will want to use  setTimeout to sleep as thisdoes not block the event loop.\n Deno.systemCpuInfo() - This function can be used to get information aboutnumber of cores available in the machine as well as the speed of the CPU.\n   deno lint has gotten some new rules this release. The main one is  camelcase:it checks that all of your variable declarations use  camelCase formatting. Weare hoping to stabilize  deno lint for Deno 1.6.\n In addition to the new rules, we have introduced hints for lint diagnostics.These hints will suggest how the lint errors can be fixed.\n Finally  deno lint has a website now that you can use to view documentation andexplanations for the rules. You can find it at  https://lint.deno.land.\n   The  deno fmt --ignore flag is now available without the  --unstable flag.This flag can be used to ignore some files or folders from being formatted orchecked by the formatter.\n   The  assertStringContains and  assertArrayContains methods in std/testing/asserts.ts have been renamed to  assertStringIncludes and assertArrayIncludes respectively, to match the the naming of the  includesmethod on strings and arrays. To update your code, simply rename the importedmethods:", "posttime": "2020-10-28 03:10:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "deno,捆绑", "title": "Deno 1.5", "title_en": "Deno 1.5", "transed": 1, "url": "https://deno.land/posts/v1.5", "via": "", "real_tags": ["deno", "捆绑"]}, {"category": "", "categoryclass": "", "imagename": "1a7043e793fc66b6b19c490439b68d22.jpeg", "infoid": 1031586, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PyTorch 1.7版本包括许多新的API，包括支持与NumPy兼容的FFT操作、评测工具以及对基于分布式数据并行(DDP)和远程过程调用(RPC)的分布式培训的重大更新。此外，几个功能已经稳定下来，包括自定义C++类、内存分析器、创建自定义类张量对象、RPC中的用户异步函数以及Torch.Distributed中的许多其他功能，如每RPC超时、DDP动态分组和RRef帮助器。\n对Autograd分析器中的RPC、TorchScript和堆栈跟踪的分析和性能进行了更新和添加。\n再次重申，从PyTorch1.6开始，特性现在分为稳定、测试版和原型。你可以在这里看到详细的公告。请注意，此博客中列出的原型功能已作为此版本的一部分提供。\n与FFT相关的功能通常用于各种科学领域，如信号处理。虽然PyTorch过去一直支持一些与FFT相关的函数，但1.7版本添加了一个新的torch.fft模块，该模块使用与NumPy相同的API实现与FFT相关的函数。\n这个新模块必须导入才能在1.7版本中使用，因为它的名称与历史悠久(现已弃用)的torch.fft函数冲突。\n&gt；&gt；&gt；导入手电筒。FFT&gt；&gt；&gt；t=火炬。Arange(4)&gt；&gt；&gt；t张量([0，1，2，3])&gt；&gt；火炬。快速傅立叶变换。FFT(T)张量([6.+0.j，-2.+2.j，-2.+0.j，-2.-2.j])&gt；&gt；&gt；t=张量([0.。+1.j，2.+3.j，4.+5.j，6.+7.j])&gt；&gt；&gt；火炬。快速傅立叶变换。FFT(T)张量([12.+16.j，-8.+0.j，-4.-4.j，0.。-8.j])。\n从PyTorch1.5开始，我们继续保持Python和C++前端API之间的一致性。此更新允许开发人员使用C++前端的nn.former模块抽象。此外，开发人员不再需要将模块从python/JIT保存并加载到C++中，因为它现在可以在C++中直接使用。\n再现性(逐位确定性)可能有助于在调试或测试程序时识别错误。为了便于重现性，PyTorch 1.7添加了torch.set_defiristic(Bool)函数，该函数可以指导PyTorch操作符选择确定性算法(如果可用)，并在操作可能导致不确定性行为时抛出运行时错误。默认情况下，此函数控制的标志为false，并且行为没有变化，这意味着默认情况下PyTorch可能不确定地实现其操作。\n具有确定性变体的操作使用这些变体(与非确定性版本相比，通常会降低性能)；以及。\n请注意，对于PyTorch程序的单次运行中的确定性而言，这是必要的，但不是充分的。其他随机性来源，如随机数生成器、未知操作、异步或分布式计算，仍可能导致不确定行为。\n用户现在不仅可以看到分析器输出表中的操作员名称/输入，还可以看到操作员在代码中的位置。工作流程只需极少的更改即可利用此功能。用户像以前一样使用自动评分探查器，但带有可选的新参数：WITH_STACK和GROUP_BY_STACK_n。注意：常规分析运行不应使用此功能，因为它会增加大量开销。\nTorchelastic提供了当前Torch.Distributed的严格超集。启动CLI时增加了容错和弹性功能。如果用户对容错不感兴趣，他们可以通过设置max_restarts=0获得精确的功能/行为奇偶校验，同时增加了自动分配RANK和MASTER_ADDR|PORT的便利性(而不是在torch.Distributed.Launch中手动指定)。\n通过将Torchelastic捆绑在与PyTorch相同的底座图像中，用户可以立即开始尝试Torchelastic，而不必单独安装Torchelastic。除了方便之外，当在现有Kubeflow的分布式PyTorch操作符中添加对弹性参数的支持时，这项工作也是非常有用的。\nPyTorch1.7引入了一个新的上下文管理器，该管理器将与使用torch.nn.parallel.DistributedDataParallel训练的模型结合使用，以支持跨不同进程使用不均匀的数据集进行训练。此功能在使用DDP时提供了更大的灵活性，使用户不必手动确保不同流程中的数据集大小相同。使用此上下文管理器，DDP将自动处理不均匀的数据集大小，这可以防止培训结束时出现错误或挂起。\n在过去，NCCL的训练运行会因为集体卡住而无限期地挂起，给用户带来了非常不愉快的体验。如果检测到潜在的挂起，此功能将中止挂起的集合，并抛出异常/使进程崩溃。当与torchelastic(它可以从最后一个检查点恢复训练过程)之类的东西一起使用时，用户可以获得更高的分布式训练可靠性。此功能完全是选择加入的，并且位于需要显式设置才能启用此功能的环境变量之后(否则用户将看到与以前相同的行为)。\n在早期版本中，Torch.Distributed.rpc.rpc_async已在TorchScript中提供。对于PyTorch1.7，此功能将扩展到剩下的两个核心RPCAPI：torch.Distributed.rpc.rpc_sync和torch.Distributed.rpc.remote。这将完成计划在TorchScript中支持的主要RPC API，它允许用户在TorchScript中使用现有的python RPC API(在脚本函数或脚本方法中，这将释放python全局解释器锁)，并可能提高多线程环境中的应用程序性能。\nPyTorch提供了一系列用于训练算法的优化器，这些优化器已作为python API的一部分重复使用。然而，用户通常希望使用多线程训练而不是多进程训练，因为它在大规模分布式训练(例如，分布式模型并行)或任何基于RPC的训练应用程序的上下文中提供了更好的资源利用率和效率。用户以前不能使用分布式优化器做到这一点，因为我们需要摆脱python全局解释器锁(GIL)的限制才能实现这一点。\n在PyTorch1.7中，我们启用了分布式优化器中的TorchScript支持来删除GIL，并使优化器能够在多线程应用程序中运行。新的分布式优化器具有与以前完全相同的接口，但是它会自动将每个Worker中的优化器转换为TorchScript，从而使每个GIL空闲。这是通过利用功能优化器概念并允许分布式优化器将优化器的计算部分转换为TorchScript来实现的。这将有助于使用分布式模型并行训练等用例，并使用多线程提高性能。\n目前，唯一支持使用TorchScript进行自动转换的优化器是Adagrad，所有其他优化器在没有TorchScript支持的情况下仍然可以像以前一样工作。我们正在努力将覆盖范围扩大到所有PyTorch优化器，并期待在未来的版本中提供更多内容。启用TorchScript支持的用法是自动的，与现有的python API完全相同，下面是一个如何使用的示例：\n导入手电筒。分布式的。自动分级为dist_autograd导入手电筒。分布式的。RPC作为来自TORCH的RPC从TORCH导入Optim。分布式的。Optim import DistributedOptimizer with dist_autograd。Context()as context_id：#转发。Rref1=RPC。远程(&#34；工人1&#34；，手电筒。ADD，args=(手电筒。1(2)，3))rref2=RPC。远程(&#34；工人1&#34；，手电筒。ADD，args=(手电筒。1(2)，1))损耗=rref1。To_here()+rref2。To_here()#向后传递。Dist_autograd。向后(context_id，[丢失。Sum()])#Optimizer，传入Optim.Adagrad，DistributedOptimizer会#自动将其转换/编译为TorchScript(GIL-free)dist_optim=DistributedOptimizer(Optim.。Adagrad，[rref1，rref2]，LR=0.05，)dist_optim。步骤(Context_Id)。\nPyTorch 1.6首次引入了对结合使用PyTorch分析器和RPC框架的支持。在PyTorch 1.7中，进行了以下增强：\n用户现在可以使用熟悉的性能分析工具，比如torch.autograd.profiler.profile()和torch.autograd.profiler.record_function，这可以透明地与RPC框架配合使用，这些RPC框架具有全功能支持、配置文件异步函数和TorchScript函数。\nPyTorch1.7为Windows平台上的DistributedDataParallel和集合通信提供了原型支持。在此版本中，仅支持基于Gloo的ProcessGroup和FileStore。要跨多台计算机使用此功能，请在init_process_group中提供来自共享文件系统的文件。\n#初始化进程组dist。INIT_PROCESS_GROUP(&#34；GLOO&#34；，#多机示例：#共享文件需要六个&#34；/&#34；#INIT_METHOD=`&#34；file:/{machine}/{share_folder}/file&#34；`#本地文件需要三个&#34；/&#34；INIT_METHOD=&#34；file:///{your本地文件路径}&#34；，RANK=RANK，WORLD_SIZE=WORLD_SIZE)model=DistributedDataParallel(LOCAL_MODEL，DEVICE_ID=[RANK])\nPyTorch Mobile支持iOS和Android，CocoaPods和J Center分别提供二进制软件包。您可以在这里了解有关PyTorch-Mobile的更多信息。\n在一些移动平台上，比如Pixel，我们观察到内存被更积极地归还给系统。这导致频繁的页面错误，因为作为功能框架的PyTorch不维护操作符的状态。因此，对于大多数操作，每次执行操作时都会动态分配输出。为了改善由此造成的性能损失，PyTorch1.7为CPU提供了一个简单的缓存分配器。分配器按张量大小缓存分配，目前只能通过PyTorch C++API使用。缓存分配器本身归客户端所有，因此分配器的生命周期也由客户端代码维护。这样的客户端拥有的缓存分配器然后可以与作用域保护c10：：WithCPUCachingAllocatorGuard一起使用，以允许在该作用域内使用缓存分配。\n#include&lt；c10/mobile/CPUCachingAllocator.h&gt；.c10：：CPUCachingAllocator CACHING_ALLOCATOR；//客户端代码拥有。可以是某个客户端类的成员，以便//将缓存分配器的生存期与类的生存期捆绑在一起.{c10：：optional&lt；c10：：WithCPUCachingAllocatorGuard&gt；CACHING_ALLOCATOR_GROUDE；IF(FLAGS_USE_CACHING_ALLOCATOR){CACHING_ALLOCATOR_GROUTE。Emplace(&amp；cachingallocator)；}....。模特。前进(……)；}……。\n注意：缓存分配器仅在移动版本上可用，因此在移动版本之外使用缓存分配器将不会有效。\n以前，torch.conj和Tensor.conj正在为real dtype的张量创建克隆。它现在按原样返回张量以提高性能。可以通过为实张量添加.clone()来恢复原始行为。注意，此行为与numpy不同，在numpy中，np.conj返回新的ndarray，而ndarray.conj按原样返回ndarray。\nTorch.tensor、torch.as_tensor和torch.parse_coo_tensor现在使用未指定的输入张量设备(#41984)。\n这将更改在其上创建张量的设备，因此用户可以开始看到设备不匹配错误。这也意味着对于稀疏张量，如果未指定设备，则提供的两个张量必须位于同一设备上。您可以通过传递设备参数来恢复原始行为。\n&gt；&gt；&gt；t设备设备(type=‘cuda：0’)&gt；&gt；&gt；#张量构造函数&gt；&gt；火炬。张量(t，dtype=火炬。浮动32)。设备设备(type=‘cpu’)&gt；&gt；&gt；#稀疏构造函数&gt；&gt；火炬。稀疏Coo张量(手电筒。张量(([0]，[2])，设备=&#34；CPU&#34；)，手电筒。张量(([1.]，)，设备=&#34；Cuda&#34；)，大小=(3，3，1))。设备设备(type=&#39；cuda&#39；，index=0)\n&gt；&gt；&gt；t设备设备(type=‘cuda：0’)&gt；&gt；&gt；#张量构造函数&gt；&gt；火炬。张量(t，dtype=火炬。浮动32)。Device device(type=‘cuda：0’)&gt；&gt；&gt；#指定设备以获得与1.6&gt；&gt；&gt；Torch相同的行为。张量(t，dtype=火炬。Flat32，device=&#39；cpu&#39；)。设备设备(type=‘cpu’)&gt；&gt；&gt；#稀疏构造函数&gt；&gt；火炬。稀疏Coo张量(手电筒。张量(([0]，[2])，设备=&#34；CPU&#34；)，手电筒。张量(([1.]，)，设备=&#34；Cuda&#34；)，大小=(3，3，1))。设备运行错误：索引后端(CPU)必须与值后端(CUDA)&gt；&gt；&gt；#指定设备以获得与1.6&gt；&gt；&gt；Torch相同的行为。稀疏Coo张量(手电筒。张量(([0]，[2])，设备=&#34；CPU&#34；)，手电筒。张量(([1.]，)，Device=&#34；Cuda&#34；)，大小=(3，3，1)，Device=&#34；Cuda：0&#34；)。设备设备(type=&#39；cuda&#39；，index=0)。\n在进行此更改之前，当使用Keepdim=True和p=&#39；fro&#39；或p=number调用torch.norm时，将所有其他可选参数保留为其默认值时，Keepdim参数将被忽略。它现在受到了适当的尊重。此外，任何时候使用p=#39；nuc&39；和Keepdim=True调用torch.norm时，结果都会比输入少一个维度，并且维度可能会乱序，具体取决于要减少的维度。它现在正确地保留了所有的维度。您可以通过设置Keepdim=False来恢复原始行为。注意：该函数现在已弃用(见下文)，我们建议您使用torch.linalg.norm，它遵循NumPy的约定。\n&gt；&gt；&gt；T.size()手电筒。Size([4，4])&gt；&gt；&gt；t.norm(p=‘fro’，Keepdim=True)。大小()手电筒。Size([])&gt；&gt；&gt；t.norm(p=3，Keepdim=True)。大小()手电筒。Size([])&gt；&gt；&gt；t.norm(p=‘nuc’，Keepdim=True)。大小()手电筒。大小([1])。\n&gt；&gt；&gt；T.size()手电筒。Size([4，4])&gt；&gt；&gt；t.norm(p=‘fro’，Keepdim=True)。大小()手电筒。Size([1，1])&gt；&gt；&gt；t.Norm(p=3，Keepdim=True)。大小()手电筒。Size([1，1])&gt；&gt；&gt；t.norm(p=‘nuc’，Keepdim=True)。大小()手电筒。大小([1，1])。\n自动分级系统能够通过显式跟踪已知的视图操作来正确地处理通过张量的视图的修改。在以前的版本中，torch.plit和torch.chunk没有被标记为已知的视图操作，这可能会导致静默错误的渐变。\n请注意，从V1.5开始，不建议对返回多个视图的函数创建的视图进行就地修改。自动分级器没有正确处理这种情况，可能会导致内部错误或错误的渐变。因此，作为此视图修复的副作用，就地修改torch.plit和torch.chunk的输出现在将引发警告，并可能导致内部错误或错误的渐变，而它们以前是静默地计算错误的渐变。如果您看到这样的警告，您应该将就地操作替换为不适当的操作。您可以使用新的torch.unsafe_plit和torch.unsafe_chunk恢复原始行为。请注意，此处的这些函数只是为了简化过渡，在将来的版本中也将删除。\nTorch.argmin(torch.argmax)现在总是返回第一个最小(最大)元素的索引。此选择与NumPy一致。以前，如果存在多个最小值(最大值)，则返回的索引可能是其中任何一个的索引。您无法恢复原始行为，因为它依赖于平台且不能保证。如果您的代码依赖于特定平台的特定索引，则应将其更新为使用第一个索引，此新代码将在所有平台上运行。\n如果未指定尺寸，则执行完全缩减，并且渐变现在将均匀地向实现输出值的所有输入回流。旧的行为是只为任意选择的一个这样的输入传播梯度。这应该会通过梯度下降来提高训练的稳定性。要恢复之前的行为，可以使用dim=参数执行缩减。它将确保渐变仅针对其索引被返回的输入回流。\n这是该OP的弃用周期的结束，以确保它与PyTorch代码库中所有其他地方使用的numpy的广播语义相比没有不同的广播语义。您需要确保所有输入的大小相同，以避免错误。\n&gt；&gt；&gt；bceloss=nn.。BCELoss()&gt；&gt；&gt；a=手电筒。兰德(25)&gt；&gt；b=火炬。Rand(25，1)&gt；&gt；bceloss(a，b)UserWarning：使用目标大小(手电筒。尺寸([25，1]))与输入尺寸(手电筒)不同。大小([25]))已弃用。请确保它们的尺寸是一样的。张量(1.0604)。\n&gt；&gt；&gt；bceloss=nn.。BCELoss()&gt；&gt；&gt；a=手电筒。兰德(25)&gt；&gt；b=火炬。Rand(25，1)&gt；&gt；&gt；bceloss(a，b)值错误：使用目标大小(手电筒。尺寸([25，1]))与输入尺寸(手电筒)不同。大小([25]))已弃用。请确保它们的尺寸是一样的。&gt；&gt；&gt；b=B.重塑(25)&gt；&gt；&gt；bceloss(a，b)张量(1.0604)。\n为了提高性能，当输入是可微的，但用户的Backup函数没有为其返回None时，定制的autograd.Function将不会创建一个满是零的张量。这意味着.backward()或autograd.grad()最终结果现在将为None，而它过去是一个满是零的张量。您可以通过自定义自动分级来恢复以前的行为。函数使用torch.zeros_like(输入)实体化零张量，以替换向后方法的None输出。\nImport torch#为渐变类GetTwos(Torch.。自动升级。函数)：@staticmethod def ward(ctx，inp)：返回inp。克隆()。Fill_(2)@staticmethod def back(ctx，grad_out)：#要恢复1.6行为，请将下面一行替换为`Return torch.zeros_like(Grad_Out)`return NONE a=torch。Rand(10，Requires_grad=True)b=GetTwos。申请(A)B.sum()。Backward()print(a.grad)#在PyTorch 1.6中，这将打印#tensor([0.，0.，0.，0.，0.，0.，0.，0.，0.，0.，0.，0.])#在PyTorch 1.7中，这将打印#NONE。\n我们修复了就地检测代码中的一个错误，该错误阻止检测一些不可微的输出就地操作(如整型张量)。这可能会导致过去运行良好的代码抛出错误“在原地操作中修改了向后所需的张量”。这种故障是真实的，必须修复用户代码才能计算正确的梯度。通常，这涉及在就地修改张量之前克隆张量，以确保可以安全地进行后向传递。\n导入手电筒a=手电筒。带手电筒的RAND(10，Requires_grad=True)。No_grad()：a[2]=10b，ind=A。max(dim=0)#ind在手电筒中为2。No_grad()：t=手电筒。兰德(10)t[4]=10 RES=手电筒。MAX(t，Dim=0，Out=(手电筒。Tensor()，ind)#ind在这里变成4#这个向后运行在1.6中运行，但在1.7B.sum()中会失败。Backward()print(a.grad)#tensor([0.，0.，0.，0.，1.，0.，0.，0.，0.，0.])#错误的值在索引4处，而它应该在索引2处#通过将上面的行#替换为：#res=torch.max(t，dim=0，out=(torch.张量器()，ind.clone()可以避免这个问题。\n可以恢复“子类上的任何操作都会产生火炬。张量器而不是子类”的旧行为\n.", "note_en": "The PyTorch 1.7 release includes a number of new APIs including support for NumPy-Compatible FFT operations, profiling tools and major updates to both distributed data parallel (DDP) and remote procedure call (RPC) based distributed training. In addition, several features moved to  stable including custom C++ Classes, the memory profiler, the creation of custom tensor-like objects, user async functions in RPC and a number of other features in torch.distributed such as Per-RPC timeout, DDP dynamic bucketing and RRef helper.\n  Updates and additions to profiling and performance for RPC, TorchScript and Stack traces in the autograd profiler\n To reiterate, starting  PyTorch 1.6, features are now classified as stable, beta and prototype. You can see the detailed announcement  here. Note that the prototype features listed in this blog are available as part of this release.\n   FFT-related functionality is commonly used in a variety of scientific fields like signal processing. While PyTorch has historically supported a few FFT-related functions, the 1.7 release adds a new torch.fft module that implements FFT-related functions with the same API as NumPy.\n This new module must be imported to be used in the 1.7 release, since its name conflicts with the historic (and now deprecated) torch.fft function.\n  &gt;&gt; &gt;  import  torch. fft &gt;&gt; &gt;  t  =  torch. arange( 4) &gt;&gt; &gt;  t tensor([ 0,  1,  2,  3]) &gt;&gt; &gt;  torch. fft. fft( t) tensor([  6. + 0.j,  - 2. + 2.j,  - 2. + 0.j,  - 2. - 2.j]) &gt;&gt; &gt;  t  =  tensor([ 0. + 1.j,  2. + 3.j,  4. + 5.j,  6. + 7.j]) &gt;&gt; &gt;  torch. fft. fft( t) tensor([ 12. + 16.j,  - 8. + 0.j,  - 4. - 4.j,  0. - 8.j])\n   Since  PyTorch 1.5, we’ve continued to maintain parity between the python and C++ frontend APIs. This update allows developers to use the nn.transformer module abstraction from the C++ Frontend. And moreover, developers no longer need to save a module from python/JIT and load into C++ as it can now be used it in C++ directly.\n   Reproducibility (bit-for-bit determinism) may help identify errors when debugging or testing a program. To facilitate reproducibility, PyTorch 1.7 adds the  torch.set_deterministic(bool) function that can direct PyTorch operators to select deterministic algorithms when available, and to throw a runtime error if an operation may result in nondeterministic behavior. By default, the flag this function controls is false and there is no change in behavior, meaning PyTorch may implement its operations nondeterministically by default.\n  Operations with deterministic variants use those variants (usually with a performance penalty versus the non-deterministic version); and\n Note that this is necessary,  but not sufficient, for determinism  within a single run of a PyTorch program. Other sources of randomness like random number generators, unknown operations, or asynchronous or distributed computation may still cause nondeterministic behavior.\n     Users can now see not only operator name/inputs in the profiler output table but also where the operator is in the code. The workflow requires very little change to take advantage of this capability. The user uses the  autograd profiler as before but with optional new parameters:  with_stack and  group_by_stack_n. Caution: regular profiling runs should not use this feature as it adds significant overhead.\n    Torchelastic offers a strict superset of the current  torch.distributed.launch CLI with the added features for fault-tolerance and elasticity. If the user is not be interested in fault-tolerance, they can get the exact functionality/behavior parity by setting  max_restarts=0 with the added convenience of auto-assigned  RANK and  MASTER_ADDR|PORT (versus manually specified in  torch.distributed.launch).\n By bundling  torchelastic in the same docker image as PyTorch, users can start experimenting with torchelastic right-away without having to separately install  torchelastic. In addition to convenience, this work is a nice-to-have when adding support for elastic parameters in the existing Kubeflow’s distributed PyTorch operators.\n   PyTorch 1.7 introduces a new context manager to be used in conjunction with models trained using  torch.nn.parallel.DistributedDataParallel to enable training with uneven dataset size across different processes. This feature enables greater flexibility when using DDP and prevents the user from having to manually ensure dataset sizes are the same across different process. With this context manager, DDP will handle uneven dataset sizes automatically, which can prevent errors or hangs at the end of training.\n   In the past, NCCL training runs would hang indefinitely due to stuck collectives, leading to a very unpleasant experience for users. This feature will abort stuck collectives and throw an exception/crash the process if a potential hang is detected. When used with something like torchelastic (which can recover the training process from the last checkpoint), users can have much greater reliability for distributed training. This feature is completely opt-in and sits behind an environment variable that needs to be explicitly set in order to enable this functionality (otherwise users will see the same behavior as before).\n   torch.distributed.rpc.rpc_async has been available in TorchScript in prior releases. For PyTorch 1.7, this functionality will be extended the remaining two core RPC APIs,  torch.distributed.rpc.rpc_sync and  torch.distributed.rpc.remote. This will complete the major RPC APIs targeted for support in TorchScript, it allows users to use the existing python RPC APIs within TorchScript (in a script function or script method, which releases the python Global Interpreter Lock) and could possibly improve application performance in multithreaded environment.\n   PyTorch provides a broad set of optimizers for training algorithms, and these have been used repeatedly as part of the python API. However, users often want to use multithreaded training instead of multiprocess training as it provides better resource utilization and efficiency in the context of large scale distributed training (e.g. Distributed Model Parallel) or any RPC-based training application). Users couldn’t do this with with distributed optimizer before because we need to get rid of the python Global Interpreter Lock (GIL) limitation to achieve this.\n In PyTorch 1.7, we are enabling the TorchScript support in distributed optimizer to remove the GIL, and make it possible to run optimizer in multithreaded applications. The new distributed optimizer has the exact same interface as before but it automatically converts optimizers within each worker into TorchScript to make each GIL free. This is done by leveraging a functional optimizer concept and allowing the distributed optimizer to convert the computational portion of the optimizer into TorchScript. This will help use cases like distributed model parallel training and improve performance using multithreading.\n Currently, the only optimizer that supports automatic conversion with TorchScript is  Adagrad and all other optimizers will still work as before without TorchScript support. We are working on expanding the coverage to all PyTorch optimizers and expect more to come in future releases. The usage to enable TorchScript support is automatic and exactly the same with existing python APIs, here is an example of how to use this:\n import  torch. distributed. autograd  as  dist_autograd import  torch. distributed. rpc  as  rpc from  torch  import  optim from  torch. distributed. optim  import  DistributedOptimizer with  dist_autograd. context()  as  context_id:  # Forward pass.  rref1  =  rpc. remote( &#34;worker1&#34;,  torch. add,  args =( torch. ones( 2),  3))  rref2  =  rpc. remote( &#34;worker1&#34;,  torch. add,  args =( torch. ones( 2),  1))  loss  =  rref1. to_here()  +  rref2. to_here()  # Backward pass.  dist_autograd. backward( context_id, [ loss. sum()])  # Optimizer, pass in optim.Adagrad, DistributedOptimizer will  # automatically convert/compile it to TorchScript (GIL-free)  dist_optim  =  DistributedOptimizer(  optim. Adagrad, [ rref1,  rref2],  lr = 0.05, )  dist_optim. step( context_id)\n   Support for using the PyTorch profiler in conjunction with the RPC framework was first introduced in PyTorch 1.6. In PyTorch 1.7, the following enhancements have been made:\n  User are now able to use familiar profiling tools such as  with torch.autograd.profiler.profile() and  with torch.autograd.profiler.record_function, and this works transparently with the RPC framework with full feature support, profiles asynchronous functions, and TorchScript functions.\n   PyTorch 1.7 brings prototype support for  DistributedDataParallel and collective communications on the Windows platform. In this release, the support only covers Gloo-based  ProcessGroup and  FileStore. To use this feature across multiple machines, please provide a file from a shared file system in  init_process_group.\n # initialize the process group dist. init_process_group(  &#34;gloo&#34;,  # multi-machine example:  # Shared files need six &#34;/&#34;  # init_method = `&#34;file://////{machine}/{share_folder}/file&#34;`  # Local file need three &#34;/&#34;  init_method = &#34;file:///{your local file path}&#34;,  rank = rank,  world_size = world_size) model  =  DistributedDataParallel( local_model,  device_ids =[ rank])\n   PyTorch Mobile supports both  iOS and  Android with binary packages available in  Cocoapods and J Center respectively. You can learn more about PyTorch-Mobile  here.\n  On some mobile platforms, such as Pixel, we observed that memory is returned to the system more aggressively. This results in frequent page faults as PyTorch being a functional framework does not maintain state for the operators. Thus outputs are allocated dynamically on each execution of the op, for the most ops. To ameliorate performance penalties due to this, PyTorch 1.7 provides a simple caching allocator for CPU. The allocator caches allocations by tensor sizes and, is currently, available only via the PyTorch C++ API. The caching allocator itself is owned by client and thus the lifetime of the allocator is also maintained by client code. Such a client owned caching allocator can then be used with scoped guard,  c10::WithCPUCachingAllocatorGuard, to enable the use of cached allocation within that scope.\n  # include   &lt;c10/mobile/CPUCachingAllocator.h &gt;.....c10::CPUCachingAllocator caching_allocator;   // Owned by client code. Can be a member of some client class so as to tie the   // the lifetime of caching allocator to that of the class......{ c10::optional&lt;c10::WithCPUCachingAllocatorGuard&gt; caching_allocator_guard;  if (FLAGS_use_caching_allocator) { caching_allocator_guard. emplace(&amp;caching_allocator); } .... model. forward(..);}.....\n NOTE: Caching allocator is only available on mobile builds, thus the use of caching allocator outside of mobile builds won’t be effective.\n     Previously,  torch.conj and  Tensor.conj were making a clone for Tensors of real dtype. It now returns the Tensor as-is to improve performance. You can recover the original behavior by adding a  .clone() for real Tensors. Note that this behavior is different from  numpy for which  np.conj returns a new ndarray and  ndarray.conj returns the ndarray as-is.\n    torch.tensor,  torch.as_tensor, and  torch.sparse_coo_tensor now use the input Tensor’s device when it is not specified ( #41984)\n This will change the device on which the Tensor is created and so the user can start seeing device mismatch errors. It also means for sparse Tensors that both of the provided Tensors must be on the same device if the device is not specified. You can recover the original behavior by passing the  device argument.\n  &gt;&gt; &gt;  t. device device( type =‘ cuda: 0’) &gt;&gt; &gt;  # tensor constructor &gt;&gt; &gt;  torch. tensor( t,  dtype = torch. float32). device device( type =‘ cpu’) &gt;&gt; &gt;  # sparse constructor &gt;&gt; &gt;  torch. sparse_coo_tensor(  torch. tensor(([ 0], [ 2]),  device = &#34;cpu&#34;),  torch. tensor(([ 1.],),  device = &#34;cuda&#34;),  size =( 3,  3,  1)). device device( type = &#39;cuda&#39;,  index = 0)\n  &gt;&gt; &gt;  t. device device( type =‘ cuda: 0’) &gt;&gt; &gt;  # tensor constructor &gt;&gt; &gt;  torch. tensor( t,  dtype = torch. float32). device device( type =‘ cuda: 0’) &gt;&gt; &gt;  # Specify the device to get the same behavior as 1.6 &gt;&gt; &gt;  torch. tensor( t,  dtype = torch. float32,  device = &#39;cpu&#39;). device device( type =‘ cpu’) &gt;&gt; &gt;  # sparse constructor &gt;&gt; &gt;  torch. sparse_coo_tensor(  torch. tensor(([ 0], [ 2]),  device = &#34;cpu&#34;),  torch. tensor(([ 1.],),  device = &#34;cuda&#34;),  size =( 3,  3,  1)). device RuntimeError:  backend  of  indices ( CPU)  must  match  backend of  values ( CUDA) &gt;&gt; &gt;  # Specify the device to get the same behavior as 1.6 &gt;&gt; &gt;  torch. sparse_coo_tensor(  torch. tensor(([ 0], [ 2]),  device = &#34;cpu&#34;),  torch. tensor(([ 1.],),  device = &#34;cuda&#34;),  size =( 3,  3,  1),  device = &#34;cuda:0&#34;). device device( type = &#39;cuda&#39;,  index = 0)\n   Before this change, when calling  torch.norm with  keepdim=True and  p=&#39;fro&#39; or  p=number, leaving all other optional arguments as their default values, the keepdim argument would be ignored. It is now properly respected. Also, any time  torch.norm was called with  p=&#39;nuc&#39; and  keepdim=True, the result would have one fewer dimension than the input, and the dimensions could be out of order depending on which dimensions were being reduced. It is now properly keeping all the dimensions. You can recover the original behavior by setting  keepdim=False.  NOTE: this function is now deprecated (see below) and we recommend you use  torch.linalg.norm, which follows NumPy’s conventions.\n  &gt;&gt; &gt;  t. size() torch. Size([ 4,  4]) &gt;&gt; &gt;  t. norm( p =‘ fro’,  keepdim = True). size() torch. size([]) &gt;&gt; &gt;  t. norm( p = 3,  keepdim = True). size() torch. size([]) &gt;&gt; &gt;  t. norm( p =‘ nuc’,  keepdim = True). size() torch. size([ 1])\n  &gt;&gt; &gt;  t. size() torch. Size([ 4,  4]) &gt;&gt; &gt;  t. norm( p =‘ fro’,  keepdim = True). size() torch. size([ 1,  1]) &gt;&gt; &gt;  t. norm( p = 3,  keepdim = True). size() torch. size([ 1,  1]) &gt;&gt; &gt;  t. norm( p =‘ nuc’,  keepdim = True). size() torch. size([ 1,  1])\n   The autograd system is able to correctly handle modifications through views of Tensors by explicitly tracking known view operations. In prior releases,  torch.split and  torch.chunk were not marked as known view operations, which could lead to silently wrong gradients.\n Note that since v1.5, inplace modification of views created by functions that return multiple views is deprecated. Such case is not properly handled by the autograd and can lead to internal errors or wrong gradients. So, as a side effect of this view fix, inplace modifications of the outputs of  torch.split and  torch.chunk will now raise a warning and can lead to internal errors or wrong gradients while they were previously silently computing wrong gradients. If you see such a warning, you should replace the inplace operation with an out of place one. You can recover the original behavior by using the new  torch.unsafe_split and  torch.unsafe_chunk. Note that these functions are only here to ease the transition and will also be removed in a future version.\n  torch.argmin ( torch.argmax) now always returns the index of the first minimum (maximum) element. This choice is consistent with NumPy. Previously if there were multiple minima (maxima) the index returned could be the index of any of them. You cannot recover the original behavior as it was platform dependent and not guaranteed. If your code was relying on a specific index for your specific platform, you should update it to work with the first index and this new code will work on all platforms.\n  When no dimension is specified, full reduction is performed and the gradient will now flow back evenly towards all the input that realized the output value. The old behavior was to propagate the gradient only for one of such input selected arbitrarily. This should improve stability of training by gradient descent. To recover the previous behavior, you can perform the reduction with the  dim= argument. It will ensure that the gradient only flows back for the input whose index was returned.\n     This is the end of the deprecation cycle for this op to make sure it does not have different broadcasting semantic compared to numpy’s broadcasting semantic used everywhere else in PyTorch’s codebase. You need to make sure all inputs are the same size to avoid the error.\n  &gt;&gt; &gt;  bceloss  =  nn. BCELoss() &gt;&gt; &gt;  a  =  torch. rand( 25) &gt;&gt; &gt;  b  =  torch. rand( 25,  1) &gt;&gt; &gt;  bceloss( a,  b) UserWarning:  Using  a  target  size ( torch. Size([ 25,  1])) that  is  different  to  the  input  size ( torch. Size([ 25])) is  deprecated.  Please  ensure  they  have  the  same  size. tensor( 1.0604)\n  &gt;&gt; &gt;  bceloss  =  nn. BCELoss() &gt;&gt; &gt;  a  =  torch. rand( 25) &gt;&gt; &gt;  b  =  torch. rand( 25,  1) &gt;&gt; &gt;  bceloss( a,  b) ValueError:  Using  a  target  size ( torch. Size([ 25,  1])) that  is  different  to  the  input  size ( torch. Size([ 25])) is  deprecated.  Please  ensure  they  have  the  same  size. &gt;&gt; &gt;  b  =  b. reshape( 25) &gt;&gt; &gt;  bceloss( a,  b) tensor( 1.0604)\n   To improve performance, the custom  autograd.Function will not create a Tensor full of zeros when an input is differentiable but the user’s  backward function returns  None for it. This means that code for which the  .backward() or  autograd.grad() final result will now be  None while it used to be a Tensor full of zeros. You can recover the previous behavior by having your custom  autograd.Function materialize the zero Tensor with  torch.zeros_like(input) to replace the  None output for the  backward method.\n import  torch # Custom Function that returns None for the gradient class  GetTwos( torch. autograd. Function):  @ staticmethod  def  forward( ctx,  inp):  return  inp. clone(). fill_( 2)  @ staticmethod  def  backward( ctx,  grad_out):  # To recover the 1.6 behavior, replace the line below with `return torch.zeros_like(grad_out)`  return  None a  =  torch. rand( 10,  requires_grad = True) b  =  GetTwos. apply( a) b. sum(). backward() print( a. grad) # In PyTorch 1.6 this will print # tensor([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.]) # In PyTorch 1.7 this will print # None\n  We fixed a bug in the inplace detection code that was preventing the detection of some inplace operations for output that are not differentiable (like integer type Tensors). This can lead to code that used to run fine to throw the error “a Tensor that was needed for backward was modified in an inplace operation”. Such failure is true and the user code must be fixed to compute proper gradients. In general, this involves cloning the Tensor before modifying it inplace to make sure the backward pass can happen safely.\n import  torch a  =  torch. rand( 10,  requires_grad = True) with  torch. no_grad():  a[ 2]  =  10 b,  ind  =  a. max( dim = 0) # ind is 2 here with  torch. no_grad():  t  =  torch. rand( 10)  t[ 4]  =  10  res  =  torch. max( t,  dim = 0,  out =( torch. Tensor(),  ind))  # ind becomes 4 here # This backward runs in 1.6 but will fail in 1.7 b. sum(). backward() print( a. grad) # tensor([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.]) # The value is wrong is at index 4 while it should be at index 2 # The issue is avoided by not modifying ind inplace by replacing the line # above with: # res = torch.max(t, dim=0, out=(torch.Tensor(), ind.clone()))\n    The old behavior of “any operations on your subclass produces a torch.Tensor instead of the subclass” can be recover\n......", "posttime": "2020-10-28 03:09:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,赢得,ffts", "title": "随CUDA 11发布PyTorch 1.7，FFT新API，赢得分布式培训", "title_en": "PyTorch 1.7 Released with CUDA 11, New APIs for FFTs, Win Distributed Training", "transed": 1, "url": "https://github.com/pytorch/pytorch/releases/tag/v1.7.0", "via": "", "real_tags": ["发布", "赢得", "ffts"]}, {"category": "", "categoryclass": "", "imagename": "2f6345dbb3db08d51c058d4e8e284bd8.jpg", "infoid": 1031585, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的使命是支持创始人和公司打造令人惊叹的互联网产品，关心互联网的健康。成长，但不是不惜一切代价。打造令人愉悦的产品并留住你的用户，但不是因为你利用了某人令人上瘾的诱因。隐私、可持续性、包容性，这些不是以后要考虑的问题，但它们是公司文化的核心。\n我们希望我们所有的创始人都能建立大型的产品和公司。希望能和Mozilla Firefox一样大。我们只是希望每个人都能合乎道德地做这件事。\n自今年春天启动以来，我们已经在孵化器中资助了50个令人惊叹的团队，并在我们的开放实验室中指导了300多个不同的项目。所有这些团队都在努力建设更好的互联网。\n我们非常高兴地宣布，本周四，10月29日，太平洋时间上午11：00-下午12：30，首届Mozilla Builders修复互联网展示会。\n👩‍🏫莫兹拉的首席执行官米切尔·贝克用她对互联网现状和需要建设的东西的看法开始了我们的讨论。\n🔥热点取自MozillaBuilder和导师(包括。烂番茄创始人帕特里克·李(Patrick Lee)和其他人)在“如何建设更好的互联网”(How To Build A Better Internet)！\n👥我们将展示我们通过孵化器资助的顶级项目，并通过我们的开放实验室提供帮助。\n特色公司包括为碳抵消建造蜂蜜，为个人数据建造Swiffer，通过加密节省高息，为浏览器建造超人，下一代DNS解析器，顶级技术出版物Hacker Noon，分散的农业网络，等等。\n我们如何将权力平衡从中央集权部队转移回个人、公民和社区？\n我们能建立一种有利于隐私和人的新的在线交流方式吗？我们如何在保护用户个人和职业利益的同时，确保平台对用户声音的安全？需要发展的是什么？\n我们能为消息、社交网络、新闻和信息建立新的商业模式，而不依赖过度的数据挖掘或劫持我们的注意力吗？\n互联网体系结构和基础设施的下一步发展将是什么样子？分散的技术如何将互联网进一步推向边缘和人民？\n任务这么大，我们可能觉得需要重新布线……。但开始并不一定非得是压倒性的。\n因此，如果你想向我们出色的导师和创始人学习，或者如果你是一家初创企业，想要更多地了解我们75000美元和16000美元的融资机会，请加入我们的活动！\n如果你也是一名忧心忡忡的网民，请与你的一两个朋友分享这一活动，帮助我们传播这一信息。\n我们还在Twitter上赠送我们的Mozilla Builders修复互联网包装盒。你所需要做的就是发这条推文，然后回复就有资格获胜。\n附：这篇帖子是在我们夏季批次中最牛的产品之一--Ttalium.co上写的！", "note_en": "Our mission is to support founders and companies building amazing internet products that care about the health of the internet. Grow, but not at all costs. Build delightful products and retain your users, but not because you&#39;ve exploited someone&#39;s addictive triggers.  Privacy, sustainability, inclusivity, are not something to &#34;figure out later&#34;, but are core in the company culture.\n We want all of our founders building big, massive products and companies. Hopefully as big as Mozilla Firefox. We just want everyone to do it ethically.\n Since our launch this Spring, we’ve funded 50 amazing teams in our Incubator, and we’ve mentored over 300 different projects in our Open Lab. All of these teams are working on building a better internet.\n We&#39;re  thrilled to announce the  Inaugural Mozilla Builders Fix The Internet Showcase this Thursday, October 29 from 11:00am-12:30pm PDT.\n  👩‍🏫 Mozilla’s CEO Mitchell Baker kicking us off with her thoughts on the state of the internet and What Needs Building\n  🔥 Hot takes from Mozilla builders and mentors (incl. Rotten Tomatoes founder Patrick Lee, and others) on “How To Build A Better Internet”!\n 👥 We’ll be showing off the top projects we’ve funded through our Incubator and helped along through our Open Lab.\n Featured companies are building  Honey for carbon offsets,   Swiffer for personal data , high interest savings through crypto,  Superhuman for the browser ,  next-gen DNS resolvers, top tech publication  Hacker Noon, decentralized farming networks, and  so much more.\n  How do we shift the balance of power from centralized forces back towards individuals, citizens and communities?\n Can we build a new way to communicate online that favors privacy and people? How do we make platforms safe for users’ voices while protecting their personal and professional interests? What needs to evolve?\n Can we build new business models for messaging, social networking, news and information that don’t rely on excessive data mining or hijacking our attention?\n What will the next evolution of the internet network’s architecture and infrastructure look like? How can decentralized technologies move the internet further towards the edge and the people?\n With missions that large, it may feel like we need to rewire everything... but getting started doesn’t have to be overwhelming.\n So if you want to learn from our  amazing mentors and founders, or if you&#39;re a startup and want to learn more about our $75k and $16k funding opportunities,  come join us at the event!\n If you&#39;re also a concerned internet citizen, help us spread the word by sharing the event with one or two of your friends.\n We&#39;re also doing a giveaway on Twitter of our  Mozilla Builders Fix-The-Internet swag box . All you need to do is  tweet this tweet, and  RSVP for the showcase  to be eligible to win.\n  p.s. this post was written on  talium.co, one of the awesome products from our Summer batch!", "posttime": "2020-10-28 03:09:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fix,互联网", "title": "Mozilla‘s Fix the Internet Showcase", "title_en": "Mozilla's Fix the Internet Showcase", "transed": 1, "url": "https://talium.co/doc/xboZza/s/", "via": "", "real_tags": ["fix", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "911555231654585d806c668cbc3c3375.png", "infoid": 1031584, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们要求谷歌、欧盟委员会和另类搜索引擎召开三方会议，以改善在欧盟激活Android手机时向消费者显示的搜索偏好菜单。我们对这一偏好菜单中的缺陷进行了广泛的研究，相信我们的见解可以确保谷歌和欧盟委员会(European Commission)实施有效的补救措施，纠正欧盟委员会在安卓(Android)案中确立的谷歌反竞争行为。\n回复：请求召开谷歌、欧盟委员会和替代搜索引擎之间的三方会议，以改善搜索偏好菜单(谷歌安卓40099)。\n我们是运营搜索引擎的公司，与谷歌竞争。如你所知，我们对谷歌在Android案中为解决其反竞争行为的不利影响而创造的所谓补救措施深感不满。我们了解到谷歌会定期更新您关于付费竞价的最新信息，但似乎您收到的信息可能不完整或不准确。\n我们写信要求与您的办公室、我们和谷歌召开三方会议，目的是建立一个有效的偏好菜单。我们各自的指定人员可以提前工作，为这次会议制定紧凑的议程，以确保会议富有成效和协作性。\n我们是欧盟委员会补救谷歌根深蒂固的竞争伤害的雄心壮志的衷心支持者。我们现在要求将这些意图付诸实践，充分利用你们现有的工具。\n你可以在这里下载这封信的PDF版本。(注：目前正在等待上传)", "note_en": "Today we are requesting a trilateral meeting among Google, the European Commission, and alternative search engines to improve  the search preference menu displayed to consumers when they activate Android phones in the European Union. We have conducted extensive research on flaws in this preference menu and believe our insights can ensure Google and the European Commission implement an effective remedy to correct Google&#39;s anticompetitive conduct as established in the  Commission&#39;s Android case.\n   RE: Request for Trilateral Meeting among Google, the European Commission, and Alternative Search Engines to Improve Search Preference Menu (Google Android 40099)\n  We are companies operating search engines that compete against Google. As you know, we are deeply dissatisfied with the so-called remedy created by Google to address the adverse effects of its anticompetitive conduct in the Android case. We understand that Google regularly updates you regarding its pay-to-play auction, but it appears that you may not be receiving complete or accurate information.\n We are writing to request a trilateral meeting with your office, ourselves, and Google, with the goal of establishing an effective preference menu. Our respective designees could work in advance to create a tight agenda for this meeting to ensure it is productive and collaborative.\n We are heartfelt supporters of the Commission&#39;s ambition to remediate entrenched Google competition harms. We are asking to put these intentions into practice now, making full use of your existing tools.\n        You can download the  PDF version of this letter here. (Note: Currently waiting for upload)", "posttime": "2020-10-28 03:08:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "欧盟委员会,european,谷歌", "title": "鸭鸭GO给欧盟委员会写了一封公开信", "title_en": "Duck Duck Go wrote an open letter to European Commission", "transed": 1, "url": "https://spreadprivacy.com/trilateral-search-meeting/", "via": "", "real_tags": ["欧盟委员会", "european", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "f089f6c7ac7e4ea7ec2af4352c94f7e4.png", "infoid": 1031583, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "即时制作社交视频：使用自定义模板为您的企业讲述合适的故事。", "note_en": "Make social videos in an instant: use custom templates to tell the right story for your business.", "posttime": "2020-10-28 03:08:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,做好,webflow,社交", "title": "Guy用Webflow和无代码在25分钟内做好了网站", "title_en": "Guy makes website in 25 min with Webflow and No-code", "transed": 1, "url": "https://vimeo.com/465151200", "via": "", "real_tags": ["代码", "做好", "webflow", "社交"]}, {"category": "", "categoryclass": "", "imagename": "21ededac314d85399d5606f786c2d456.jpg", "infoid": 1031582, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一款键盘智能手机，专为功能和生产力而设计，运行Lineage或Ubuntu。", "note_en": "A keyboard smartphone purposely designed for functionality & productivity running Lineage or Ubuntu.", "posttime": "2020-10-28 03:08:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,硬件,ubuntu,键盘,手机", "title": "Pro1 X智能手机配有硬件键盘，专为运行LineageOS或Ubuntu而设计", "title_en": "Pro1 X Smartphone with hardware keyboard, designed to run LineageOS or Ubuntu", "transed": 1, "url": "https://www.indiegogo.com/projects/pro1-x-smartphone-functionality-choice-control#/", "via": "", "real_tags": ["设计", "硬件", "ubuntu", "键盘", "手机"]}]