[{"category": "", "categoryclass": "", "imagename": "75e751a32966d76a722808ac8a2b6248.jpeg", "infoid": 1004423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "浮点数对于科学编程非常有用，但微处理器只直接支持整数。1虽然早在20世纪50年代和60年代，浮点在大型机中就很常见，但直到1980年，英特尔才为微型计算机引入了8087浮点协处理器。2将此芯片添加到IBMPC等微型计算机上，浮点运算的速度最高可达100倍，这对AutoCAD、电子表格或飞行模拟器等应用程序来说是一个巨大的好处。3缺点是8087芯片的价格高达数百美元。4.。\n实现浮点运算很困难，所以它们的计算速度很快、很准确。溢出、舍入、超越运算和大量边缘情况都可能会出现问题。在8087之前，每个制造商都有自己不兼容的浮点临时实现。然而，英特尔聘请了数值分析专家威廉·卡汉(William Kahan)根据严格的原则设计精确的浮点。5结果是8087的浮点体系结构。这成为几乎所有现代计算机使用的IEEE754标准，所以我认为8087是有史以来设计的最有影响力的芯片之一。\nIntel8087浮点单元芯片的裸片，标有主要功能块。模具尺寸为5 mm×6 mm。变速箱的轮廓用红色标出。单击查看大图。\n为了探索8087是如何工作的，我打开了一块8087芯片，用显微镜拍摄了硅晶片的照片。8087包含40,000个晶体管，将芯片制造推向了极限；相比之下，与之配套的8086微处理器只有29,000个晶体管。为了使芯片成为可能，英特尔开发了新技术。在这篇文章中，我重点介绍了高速二进制移位器(上面的红色轮廓)。移位器占据了芯片面积的很大一部分，所以最小化它的面积对于制造高速二进制移位器是至关重要的。在这篇文章中，我重点介绍了高速二进制移位器(上面的红色轮廓)。移位器占据了芯片面积的很大一部分，所以最小化它的面积对于制造高速二进制移位器至关重要。\n浮点数由分数(也称为有效数或尾数)、指数和符号位组成。(这些以二进制表示，但对于以10为基数的类比，数字6.02×10 23的分数为6.02，指数为23。)处理分数的电路位于芯片照片的底部。从左到右，分数电路由常量ROM、移位器(高亮显示)、加法器/减法器和寄存器堆栈组成。在其上方，微码引擎和ROM控制芯片。\n移位器的作用是向左或向右移位二进制数，这是一项在浮点运算中具有几个关键作用的任务。当两个浮点数相加或相减时，必须将数字移位以使二进制点对齐。(二进制点类似于小数点，但对于二进制数。)8087的先验指令是围绕移位和加法运算构建的，使用一种称为CORDIC的算法。移位器还用于从16位块汇编浮点数。8个。\n由于移位对性能如此重要，8087使用桶形移位器，它可以在单个步骤中将一个数字移位任意位数。6英特尔采用两级移位器设计，在保持其大小可控的同时仍提供高性能。第一级将值移位0至7位，而第二级将值移位0至7字节。两级合计可将值移位0至63位。\n我将首先描述位移位器，它执行0到7位位置的移位。下图概述了位移位器的结构，显示了5个输入和输出；全移位器支持68位。其概念是通过激活特定的列，输入移位所需的量，每个圆圈表示一个晶体管，它可以充当输入线和输出线之间的开关。例如，图中显示了移位选择线3被激活，打开相关联的晶体管(绿色)。高亮显示的输入20(橙色)指向输出23(蓝色)。类似地，其他输入连接到相应的输出，产生移位3。通过激活不同的移位选择线，输入将在0和7位之间移位不同的量。例如，通过激活不同的移位选择线，输入将在0和7位之间被移位不同的量。例如，通过激活不同的移位选择线，输入将在0和7位之间被移位不同的量。例如，被高亮显示的输入20(橙色)被引导到输出23(蓝色)。通过激活不同的移位选择线，输入将被移位0和7位之间的不同的量\n位移位器的结构。通过激励移位选择线，输入连接到具有所需位移位的输出。\n为了解释移位器的内部结构，我将从描述8087芯片中使用的NMOS晶体管开始。晶体管是通过在硅衬底上掺杂杂质区域来创建具有不同电气特性的扩散区域来构建的。晶体管可以被认为是一个开关，控制源极和漏极两个区域之间的电流流动。晶体管由栅极激活，栅极由一种名为多晶硅的特殊类型的硅构成，位于衬底硅的上方。向栅极施加电压使电流在源极和漏极之间流动，否则电流就会被阻塞。晶体管由顶部的金属层布线连接在一起，形成一个复杂的集成电路。\n下面的照片显示了8087中的一个晶体管，如显微镜下所示。它的结构与上图相符，尽管它的形状更复杂。源极、栅极和漏极都在照片之外继续，连接到其他晶体管。此外，金属层中的布线通过圆形通孔连接到硅上。(在这张照片中，金属层用酸去除了。)。\n缩小后，下图显示了芯片上实现的移位器的一部分。这张照片中约有48个晶体管，与上图类似。橙色和黄色的对角线对应于其中一个输入：橙色区域显示通过硅连接的晶体管，而黄色线条显示金属层中的连接。(金属层用于跳过多晶硅选择线。)绿色突出显示的是移位3的多晶硅线。在中心，这条多晶硅栅极线接通晶体管，连接多晶硅选择线。将高亮显示的输入移位三个位置。(其他非高亮显示的输入也进行类似的移位。)因此，此电路实现了本节开头描述的移位器。照片显示了68个输入中的6个，因此完整的移位器要高得多。\n位移位器的硅电路特写。如图所示，一个信号的路径由移位三控制(绿色)控制。\n字节移位器将其输入移位8位的倍数，而不是1位。它的设计类似于位移位器，不同之处在于每一个输入连接到每八个输出。例如，输入20连接到输出20、28、36，依此类推，按字节移位。因此，对角线连接陡峭且紧密排列，每台交换机之间有8条线路。在下图中，选择了四次移位的线路，并突出显示了从输入0到输出32的连接。请注意，图的右半部分缺少导线，因为从输入0以外移位的任何位都会变为零。例如，当向左移位4字节时，低位31及以下变为零。\n下面的芯片照片显示了位移位器和字节移位器的一部分。这张照片被缩小以显示整体结构；单个晶体管几乎看不见。位移位器的区域密密麻麻地堆满了晶体管，但是字节移位器主要由布线组成，中间有几列晶体管。9还要注意，字节移位器的顶部部分是空的，向底部填充了更多的布线。布线布局不像上图中那样有序，但其布置是为了获得最高效率。\n到目前为止，位移位器和字节移位器只在一个方向上移位。然而，位需要双向移位。8087移位器的关键创新之一是它的双向设计：数据可以反向通过移位器来进行相反方向的位移位。这是可能的，因为移位器是由通过晶体管而不是逻辑门构成的。传递晶体管逻辑将晶体管用作传递或阻止信号的开关，因此信号可以在任一方向上传播。(相反，常规逻辑门，如NOR门，具有特定的输入和输出。)\n移位器左侧和右侧的特殊驱动电路允许移位器双向操作。为了从左到右发送数据，左侧驱动器从分数总线读取数据并将其发送到移位器。右侧驱动器电路接收移位后的数据，将其临时锁存，然后将其写回分数总线。为了反向发送数据，驱动器电路颠倒角色：右侧驱动器将数据从分数总线发送到移位器，而左侧电路接收移位后的数据。10个。\n我将描述的最后一个特征是控制移位器的电路。有三个不同的来源控制要移位的位置。首先，微码引擎可以直接指定数字。第二，数字可以来自循环计数器；这是CORDIC先验算法的一部分。最后，数字可以来自前导零计数器；这允许通过移位消除前导零来归一化数字。这些来源中的每一个都提供6位移位数字；6个多路复用器。12个。\n接下来，解码器激活八条位移位线中的一条和八条字节移位线中的一条，以控制移位器中的适当通过晶体管。(每个解码器接受3位输入并激活8条输出线中的一条。)因为每条解码器线控制移位器中的一大列通过晶体管，所以解码器使用相对较大的功率晶体管。13在底部，16条控制线退出电路。\n8087是一款功能丰富的复杂芯片。然而，通过仔细检查芯片，可以理解8087的电路。这篇博客文章描述了8087的快速桶形移位器，一次最多能移位63位。14英特尔获得了这种创新的可编程双向移位器的专利。\n移位器只是使8087计算浮点运算的速度比8086处理器快得多的功能之一。8087一次操作80位，而不是16位。8087有80位宽的寄存器，减少了计算期间的内存访问。8087将超越操作的常量存储在ROM中，也避免了内存访问。8087中的硬件检查NaN、下溢、上溢等，避免代码中的缓慢检查。8087的硬件使多个。我不知道这些因素的相对贡献，但它们结合在一起，极大地提高了浮点性能，最高可达100倍。\n浮点硬件的好处如此之大，以至于英特尔从1989年的80486开始将浮点单元集成到处理器中，现在大多数处理器都包括浮点单元，购买单独的浮点协处理器的费用已经成为过去。\n去除金属层的8087模具照片。颜色是由于剩余的一些氧化层造成的。单击查看大图。\n有关8087的更多信息，请参阅我的其他文章：从8087中提取ROM常量、每晶体管2位ROM和衬底偏置生成器。我在Twitter上发布了我最新的博客文章，请关注me@kensheriff以阅读后续文章。我还有一个RSS订阅源。\n即使没有浮点硬件，早期的微型计算机也可以执行浮点运算。这些运算会被分解成许多整数运算，根据需要处理指数和分数。换句话说，浮点支持并没有使浮点运算成为可能，它只是使浮点运算变得更快。(另一种表示非整数的方式是定点数，它在小数之后有固定的位数。定点数比浮点数简单，但不能表示大范围的浮点数。\n8087不是第一个浮点芯片。美国国家半导体公司在1977年引入了MM57109数字计算器单元(也就是真名)。它本质上是一个重新打包的12位科学计算器芯片，对二进制编码的十进制值进行运算，数值以反向波兰语表示。这个芯片速度慢得离谱；例如，正切可以代替一秒。AMD在1978年推出了他们的浮点芯片AM9511(详细说明)。这款芯片支持32位浮点数，正切最多需要1.4毫秒。(英特尔最终从AMD获得AM9511的授权，并将其作为8231出售。)相比之下，10-MHz8087可以在54微秒内实现正切，运算在80位浮点数上。因此，8087&#39；\n最初的IBM PC(1981)在其主板上有一个空插槽，用于添加8087协处理器。这对AutoCAD等应用程序是一个巨大的好处。大的空插槽在8088微处理器上方的左上角可见。支持8087的应用程序列表在此。\n我找不到8087的原价，但它很贵。起初，由于8087的时序不稳定，英特尔只出售8087与8088的配对和测试。到1982年，英特尔将8087的价格降至230美元，相当于当前美元约500美元。与如今的开源世界相比，客户还要支付软件支持费用似乎很奇怪：使用带有BASIC语言的8087还要多花150美元，而英特尔的8087开发库是1,250美元。--↩。\n8087的设计者评论了卡汉教授提供的指导：我们没有做得像他想要的那样好，但我们做得比他预期的要好。卡汉后来因为他在浮点方面的工作而获得了图灵奖。-↩。\n处理器通常包括各种移位指令，包括将位从字的一端移位到另一端的旋转操作.8087只执行直接移位，不执行旋转.-↩。\n移位器处理8087&#39；的64位小数，还有三个额外的位用于舍入精度，因此它支持67位。除非我算错了，否则移位器在最重要的位置还有一个额外的位，使它变得68位宽。-↩。\n乘法和除法大量使用移位；乘法使用移位和加法，而除法使用移位和减法。但是，8087不使用通用移位器进行这些操作，而是有专门的移位器为这些操作进行优化。-↩\n为了尽可能紧密地包装布线，移位器交替使用扩散硅导线和多晶硅导线。在下面的照片中，扩散硅线是粉红色的，而多晶硅是黄色的。8087是用英特尔的HMOS III工艺制造的，多晶硅需要4µm的间距和5µm的扩散间距，这可能是因为光刻实践的分辨率。但是，扩散线和多晶硅线之间的间距可以是。\n字节移位器中的布线由交替的紧密堆积的硅线和多晶硅线组成。两边的大矩形是由垂直多晶硅线控制的晶体管对。\n驱动器电路有一些微妙之处。不是直接将数据发送到移位器，而是分两步传输比特。首先，移位器线路预充电到高电平。换言之，移位器线路是低有效的，低电压代表1。由于任何未使用的输出保持其高电压(0位)，0位被自动移位到低位位置。我认为预充电技术对于NMOS电路也是更好的匹配，其更好地将信号拉低而不是拉高，因此对线路进行预充电有助于提高性能。我认为预充电技术对于NMOS电路来说也是更好的匹配，NMOS电路在拉低信号方面比拉高信号更好，所以预充电有助于提高性能。我认为预充电技术对于NMOS电路来说也是更好的匹配，NMOS电路在拉低信号方面比拉高信号更好，所以预充电线路有助于性能，特别是考虑到移位器和分数总线之间的相对较高的容量。移位器和分数总线之间的锁存器防止了不需要的循环，移位的数据立即回流到移位器并被重新移位。-↩。\n此脚注将阐明物理移位与逻辑移位的区别。在芯片上，小数电路的最高有效位位于底部。通过移位器从左到右将数据物理下移。这相当于二进制数的左移，将位移到更高的位置。在相反的方向上，通过移位器的数据从右到左执行数据的右移。↩。\n左/右方向也需要从三个移位源中选择一个，但我还没有找到用于该移位源的电路。-↩。\n每个译码器本质上由八个或非门组成：七个门将被拉低，只有所有输入为低的门才是高的。但是，它并不是作为一个简单的逻辑门来实现的。相反，所有输出都预充电为高电平，然后将七个不需要的输出拉低。这种动态预充电逻辑仍在现代电路中使用；请参阅同步预充电逻辑一书。多路复用器也是用预充电逻辑实现的。-↩。\n直到1985年的80386，英特尔的x86处理器才包括桶式移位器，它提供了64位桶式移位器。在此之前，8086及其后代每次移位一位，因此许多位位置的移位速度要慢得多。--↩", "note_en": "Floating-point numbers are very useful for scientific programming, butearly microprocessors only supported integers directly.  1Although floating-point was common in mainframes back in the 1950s and 1960s,it wasn&#39;t until 1980 thatIntel introduced the 8087 floating-point coprocessor for microcomputers.  2Adding this chip to a microcomputer such as the IBM PC made floating-point operations up to 100 times faster.This was a huge benefit for applications such as AutoCAD, spreadsheets, or flight simulators.  3The downside was the 8087 chip cost hundreds of dollars.  4\n It&#39;s hard to implement floating-point operations so they are computed quickly and accurately.Problems can arise from overflow, rounding, transcendental operations, and numerous edge cases.Prior to the 8087, each manufacturer had their own incompatible ad hoc implementation of floating point.Intel, however, enlisted numerical analysis expert  William Kahan to design accurate floating pointbased on rigorous principles.  5The result was the floating-point architecture of the 8087. This became the  IEEE 754 standard used in almostall modern computers, so I consider the 8087 one of the most influential chips ever designed.\n  Die of the Intel 8087 floating point unit chip, with main functional blocks labeled. The die is 5mm×6mm. The shifter is outlined in red. Click for a larger image.\n  To explore how the 8087 works, I opened up an 8087 chip and took photos of the silicon die with a  microscope.Containing 40,000 transistors, the 8087 pushed chip manufacturing to the limit; in comparison, the companion 8086 microprocessor only had 29,000 transistors.To make the chip possible, Intel developed new techniques.In this article, I focus on the high-speed binary shifter (outlined in red above).The shifter takes up a large fraction of the chip&#39;s area, so minimizing its area was vital to making the 8087 possible.\n A floating-point number consists of a fraction(also called significand or mantissa), an exponent, and a sign bit.(These are expressed in binary, but for a base-10 analogy, the number 6.02×10 23 has 6.02 as the fraction and 23 as the exponent.)The circuitry to process the fraction is at the bottom of the die photo.From left to right, the fraction circuitry consists of a constant ROM, a shifter (highlighted), adder/subtracters, and the register stack.The exponent processing circuitry is in the middle of the chip. Above it, the microcode engine and ROM control the chip.\n  The role of the shifter is to shift binary numbers left or right,a task withseveral critical roles in floating-point operations.When two floating-point numbers are added or subtracted, the numbers must be shifted so the binary points line up.(The binary point is like the decimal point, but for a binary number.)The 8087&#39;s transcendental instructions are built around shift and add operations, using an algorithm called  CORDIC.The shifter is also used to assemble a floating-point number from 16-bit chunks read from memory.  8\n Since shifts are so essential to performance, the 8087 uses a &#34;barrel shifter&#34;, which can shift a number by any number of bits in a single step.  6Intel used a two-stage shifter design that kept its size manageable while still providing high performance.The first stage shifts the value by 0 to 7 bits, while the second stage shifts by 0 to 7 bytes.In combination, the two stages shift a value by any amount from 0 to 63 bits.\n  I&#39;ll start by describing the bit shifter, which performs a shift of 0 to 7 bit positions.The diagram below outlines the structure of the bit shifter, showing five of the inputs and outputs; the full shifter supports 68 bits.  7The concept is that by activating a particular column, the input is shifted by the desired amount.Each circle indicates a transistor that can act as a switch between an input line and an output line. The vertical select lines are used to activate thedesired transistors.Each input line is connected diagonally to eight transistors, allowing it to be directed to one of eight outputs.For example, the diagram shows shift select line 3 activated, turning on the associated transistors (green).The highlighted input 20 (orange) is directed to output 23 (blue).Similarly, the other inputs are connected to the corresponding outputs, yielding a shift by 3.By activating a different shift select line, the input will be shifted by a different amount between 0 and 7 bits.\n  Structure of the bit shifter. By energizing a shift select line, the inputs are connected to outputs with the desired bit shift.\n  To explain the internal construction of the shifter, I&#39;ll start by describing the NMOS transistors used in the 8087 chip.Transistors are built by doping areas of the silicon substrate with impurities to create &#34;diffusion&#34; regions with different electrical properties.The transistor can be considered a switch, controlling the flow of current between two regions called the source and drain. The transistor is activated by the gate, made of a special type of silicon called polysilicon, layered above the substrate silicon.Applying voltage to the gate lets current flow between the source and drain, which is otherwise blocked.Transistors are wired together by a metal layer on top, building a complex integrated circuit.\n    The photo below shows a transistor in the 8087 as it appears under the microscope.Its structure matches the diagram above, although its shape is more complex.The source, gate, and drain all continue out of the photo, connected to other transistors.In addition, wiring in the metal layer is connected to the silicon at the circular vias.(The metal layer was removed with acid for this photo.)\n    Zooming out, the diagram below shows part of the bit shifter as implemented on the chip.About 48 transistors, similar to the one above, are in this photo.The orange and yellow diagonal corresponds to one of the inputs:the orange regions show transistors connected through the silicon, while the yellow lines show connections in the metal layer.(The metal layer is used to jump over the polysilicon select lines.)The green highlight shows the polysilicon line for shift-by-three.In the center, this polysilicon gate line turns on a transistor, connecting the input to the long yellow output line, shifting the highlighted input by three positions.(The other non-highlighted inputs are shifted similarly.)Thus, this circuit implements the shifter as described at the beginning of the section.The photo shows six of the 68 inputs, so the complete shifter is much taller.\n  Closeup of the silicon circuitry for the bit shifter. The path of one signal is shown, as controlled by the shift-by-three control (green).\n   The byte shifter shifts its inputs by multiples of eight bits, rather than one bit.Its design is similar to the bit shifter, except each input connects to every eighth output. For instance, input 20 connectsto outputs 20, 28, 36, and so forth, shifting by bytes. As a result, the diagonal connections are steep and packed tightly, with eight lines between each switch.In the diagram below, the line for shift-by-four is selected, with the connection from input 0 to output 32 highlighted.Note the lack of wires in the right half of the diagram becauseany bit shifted from beyond input 0 becomes zeroed. For instance, when shifting left by 4 bytes, low-order bits 31 and below become zero.\n    The die photo below shows part of the bit shifter and the byte shifter.This photo is zoomed-out to show the overall structure; individual transistors are barely visible.The bit shifter&#39;s area is densely packed with transistors, but the byte shifter consists mostly of wiring, with columns of transistors in between.  9Also note that the byte shifter is partially empty at the top, filling in with more wiring towards the bottom.The wiring layout isn&#39;t as orderly as in the diagram above, but is arranged for maximum efficiency.\n     So far, the bit and byte shifters only shift bits in one direction.  11However, bits need to be shifted in both directions.One of the key innovations of the 8087&#39;s shifter is its bidirectional design:data can be passed through the shifter in reverse to shift bits the opposite direction.This is possible because the shifter is constructed with pass transistors, not logic gates. Pass transistor logicuses transistors as switches that pass or block signals, so signals can travel in either direction.(In contrast, regular logic gates such as NOR gates have specific inputs and outputs.)\n Special driver circuitry on the left and right sides of the shifter allows the shifter to operate in either direction.To send data from left to right, the left-hand driver reads data from the fraction bus and sends it into the shifter.The right-hand driver circuit receives this shifted data, latches it temporarily, and then writes it back to the fraction bus.To send data in the opposite direction, the driver circuits reverse roles: the right-hand driver sends data from the fraction bus into the shifterwhile the left-hand circuit receives the shifted data.  10\n  The final feature I&#39;ll describe is the circuitry that controlled the shifter.Three different sources control how many positions to shift.First, the microcode engine can specify the number directly.Second, the number can come from a loop counter; this is used as part of the CORDIC transcendental algorithms.Finally, the number can come from a leading zero counter; this allows numbers to be normalized by eliminating leading zeroes through shifting.Each of these sources provides a 6-bit shift number; the six multiplexers each select one bit from the desired source.  12\n    Next, decoders activate one of eight bit-shift lines and one of eight byte-shift lines to control the appropriate pass transistors in the shifter.(Each decoder takes a 3-bit input and activates one of 8 output lines.)Because each decoder line controls a large column of pass transistors in the shifter, the decoder uses relatively large power transistors.  13At the bottom, the 16 control lines exit the circuitry.\n  The 8087 is a complex chip with many functional units. However, by examining the die closely, the circuits of the 8087 can be understood.This blog postdescribed the 8087&#39;s fast barrel shifter, capable of shifting by up to 63 bits at a time.  14Intel received a patent on this innovative  programmable bidirectional shifter.\n The shifter was just one of the features that letthe 8087 compute floating-point operations much faster than the 8086 processor could.The 8087 operates on 80 bits at a time instead of 16. The 8087 has 80-bit wide registers, reducing memory accesses during computations.The 8087 stores constants for transcendental operations in a ROM,also avoiding memory accesses.Hardware in the 8087 checked for NaN, underflow, overflow, etc., avoiding slow checks in code.The 8087&#39;s hardware made multiplication and division faster.I don&#39;t know the relative contributions of these factors, but in combination, they improved floating-point performance dramatically, by up to a factor of 100.\n The benefits of floating point hardware are so great that Intel started integrating the floating-point unit into the processor with the 80486 (1989).Now, most processors include a floating-point unit and the expense of purchasing a separate floating-point coprocessor is a thing of the past.\n  Die photo of the 8087 with the metal layer removed. The colors are due to some of the oxide layer remaining. Click for a larger image.\n  For more information on the 8087, see my other articles:  Extracting ROM constants from the 8087,  The two-bit-per-transistor ROM and  The substrate bias generator.I announce my latest blog posts on Twitter, so follow me  @kenshirriff for future articles. I also have an  RSS feed.\n  Even without floating-point hardware, early microcomputers could perform floating-point operations.The operations would be broken down into many integer operations, manipulating the exponent and fraction as necessary.In other words, floating-point support didn&#39;t make floating-point operations possible, it just made them much faster.(Another way to represent non-integers is fixed-point numbers, which have a fixed number of digits after the decimal.Fixed-point numbers are simpler than floating-point, but can&#39;t represent as large a range.)  ↩\n The 8087 wasn&#39;t the first floating-point chip.National Semiconductor introduced the  MM57109 Number Cruncher Unit (that is the real name) in 1977.It was essentially a repackaged 12-digit scientific calculator chip, operating on binary-coded decimal values with values entered in Reverse Polish Notation.This chip was absurdly slow; a tangent, for instance, could take over a second.AMD introduced their floating-point chip, the  Am9511, in 1978 ( details).This chip supported 32-bit floating-point numbers and took up to 1.4 milliseconds for a tangent.(Intel ended up licensing the Am9511 from AMD and selling it as the  8231.)A 10-MHz 8087 in comparison, could do a tangent in 54 microseconds, operating on an 80-bit floating-point number.Thus, the 8087&#39;s performance and accuracy were far superior to previous chips.  ↩\n The original IBM PC (1981) had an empty socket on its motherboard for adding an 8087 coprocessor.a huge benefit for applications such as AutoCAD.The large empty socket is visible in the upper left below, above the 8088 microprocessor.A list of applications with support for the 8087 is  here.\n I couldn&#39;t find the original price for the 8087, but it was expensive.At first, Intel only sold the 8087 as a matched and tested pair with an 8088, due to timing flakiness with the 8087.By 1982, Intel dropped the price of the 8087 to  $230,equivalent to about $500in current dollars. Compared to today&#39;s open-source world, it seems strange that customers also had to pay for software support: using the 8087 with the BASIC language cost another $150, while Intel&#39;s 8087 development library was $1250.  ↩\n The designers of the 8087 commented on the guidance offered by Professor Kahan: &#34;We did not do as well as he wanted, but we did better than he expected.&#34; Kahan later received a Turing Award for his work on floating point.  ↩\n Processors often include a variety of shift instructions, including rotate operations that shift bits from one end of the word to the other.The 8087 only performs straight shifts, not rotates.  ↩\n The shifter handles the 8087&#39;s 64-bit fraction, along with three extra bits for rounding accuracy, so it supports 67 bits.Unless I miscounted, the shifter also has an extra bit in the most significant position, making it 68 bits wide.  ↩\n Multiplication and division make heavy use of shifting; multiplication is performed by shifts and adds, while division uses shifts and subtracts.However, the 8087 does not use the general-purpose shifter for these operations, but has specialized shifters optimized for these operations.  ↩\n In order to pack the wiring as close together as possible, the shifter alternated wires of diffused silicon and wires of polysilicon.In the photo below, the diffused silicon wires are pinkish, while the polysilicon is yellowish.The 8087 was built with Intel&#39;s HMOS III process, which required a 4µm spacing for polysilicon and 5µm for diffusion, probablydue to the resolution of the photolithography practice.However, the spacing between a diffusion line and a polysilicon line could be much smaller, probably because they were created with separate masks and wereon separate layers.Thus, alternating diffusion and polysilicon lines could be packed together tightly, saving space.\n  Wiring in the byte shifter consists of alternating, tightly-packed silicon and polysilicon lines. The large rectangles on either side are pairs of transistors, controlled by vertical polysilicon lines.\n The driver circuitry has a few subtleties. Instead of sending data directly into the shifter, bits are transferred in two steps.First, the shifter lines are pre-charged to a high level. Then, any 1-bit inputs cause the corresponding shifter lines to be pulled low.In other words, the shifter lines are active-low, with a low voltage representing a 1.Since any unused outputs keep their high voltage (a 0 bit), 0 bits are shifted into low bit positions automatically.I think the pre-charge technique also was a better match for NMOS circuitry, which was better at pulling a signal low than pulling it high,so pre-charging the lines helped performance, especially given their relatively high capacitance.The latch between the shifter and the fraction bus prevents an unwanted cycle with the shifted data immediately flowingback into the shifter and getting re-shifted.  ↩\n This footnote will clarify the physical shift versus the logical shift.On the die, the fraction circuitry is arranged with the most-significant bit at the bottom.Passing data through the shifter from left to right shifts bits physically downward.This corresponds to a left-shift of a binary number, moving bits to a higher position.In the opposite direction, passing data through the shifter from right to left performs a right-shift of the data.  ↩\n The left/right direction also needs to be selected from one of the three shift sources, but I haven&#39;t located the circuitry for that yet.  ↩\n Each decoder essentially consists of eight NOR gates: seven will be pulled low and only the one with all inputs low will be high.However, it&#39;s not implemented as a straightforward logic gate. Instead, all outputs are precharged high, and then the seven undesired outputs are pulled low.This sort of  dynamic precharge logic is still used in modern circuits;see the book Synchronous Precharge Logic.The multiplexers are also implemented with precharge logic.  ↩\n Intel&#39;s x86 processors didn&#39;t include a barrel shifter until the 80386 (1985), which provided a 64-bit barrel shifter. Before that, the 8086 and descendants shifted one bit at a time,so shifts by many bit positions were much slower.  ↩", "posttime": "2020-05-31 01:54:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芯片,coprocessor,移位", "title": "8087数学协处理器快速移位器芯片分析", "title_en": "Die analysis of the 8087 math coprocessor's fast bit shifter", "transed": 1, "url": "http://www.righto.com/2020/05/die-analysis-of-8087-math-coprocessors.html", "via": "", "real_tags": ["芯片", "移位"]}, {"category": "", "categoryclass": "", "imagename": "01d591549cc6ae9510dd3f3591a7ab08.jpg", "infoid": 1004422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有人提到FreePBX主页变了，我就去看了看。我认为它看起来不错，除了奇怪的狗蛙代替了探戈，但他们也删除了所有的(所有！)。我的博客帖子。相当于15年。还有所有的tm1000&#39；s(他担任了8年多的领导)，以及任何提到他的帖子。\n我很生气。我能想到他们这么做的唯一原因是，他们正准备关闭FreePBX源代码，并鼓励人们转向他们的商业服务(Switchvox)。\n我在推特上发布了一些关于这件事的咆哮，我猜这意味着我最终真的要开始开发PhoneBo.cx了！\n级别1我一直对目前Switchvox的功能集如此有限感到不满(不能做我10年前能做的事情，他们的支持也不会对sip.conf做任何改变，即使我提出支付他们的小时费用)。当这份支持合同在大约18个月后到期时，我将寻找一个在开源方面表现得更好的人。\n级别1我认为关闭源代码违反了GPL许可证，对吗？如果我正确理解许可问题，只要Sangoma继续使用GPLed项目的源代码，他们就有义务在GPL下提供FreePBX。\n是的，我比我应该更清楚地知道，他们为任何试图从源代码构建到生产级级别的FreePBX的人做事情有多难。\n附注：如果这里的任何人对涉及的许可有更好的理解，请纠正我。\n第2级，Samgoma不拥有的Freepbx只有极少数部分是按照GPL授权的。其他部分要么是麻省理工学院的，要么是BSD的，要么就是微不足道地重写了。如果我还在那里，我可以在几周内关闭它的来源。这些天他们可能需要几个月的时间，但从技术上讲这是可以实现的。\n作为Sangoma负责开源的副总裁，我可以毫不含糊地声明，正如Rob所说，我们根本没有准备关闭FreePBX源代码。\n是的，我们的营销团队搞砸了一些旧的博客帖子，并将其存档。自那以后，他们已经修复了它们。但请不要认为这会以某种方式转化为在FreePBX上关闭源代码。这绝对不是我们的意图。\n级别2&#34；已存档&#34；与已删除不同。博客帖子已被删除。试图声称不是这样的说法是胡说八道。为什么其他以前的开发者在那里留下了帖子，而Andrew、Bryan和我的帖子却从历史中删除了？\n为什么菲利普斯向安德鲁道别的帖子被删除了，而他所有的其他帖子都保留了下来？\n这又是一次有针对性的攻击，但这是一根稻草。我厌倦了这种走回头路的做法，这也是一个错误。有人故意而明确地选择删除那些文章。\n第1级，您和您的同事是否明确要分叉代码并继续执行？\n一级嗯..。天哪，我希望不是这样的。我*每天*都在使用FreePBX，自从它被命名为Asterisk@Home以来，我一直是它的长期支持者。我永远也不想搬到Switchvox去，它看起来就像旧的Trixbox叉子和失败。我理解FreePBX的商业模块和对它的支持，以及你们归类的任何东西(对我来说，这只是在猪身上涂上商业服装/口红的FreePBX)，我很高兴地会继续支持这些模块和支持。Jared Smith也刚刚发布了一篇关于Sangoma开源领导力的博客文章……。太奇怪了：https://blogs.asterisk.org/2020/05/26/collaborating-for-success-in-open-source/?utm_source=twitter&amp；utm_medium=social。\n他们对待你的方式真差劲，罗布。我不明白。这就像开放源码通信的人们都站在同一阵营一样，那么为什么要打这场仗呢？\n级别1，再加上微软收购Metaswitch和思科收购Broadsoft，这让我们有点紧张。\n第1级FreePBX是开源的，并且永远是开源的。此外，Sangoma 100%致力于保持FreePBX开源。欢迎大家加入我们的https://community.freepbx.org/。\n至于博客帖子的问题，我们更新了整个freepbx.org网站，一些博客帖子被不知道安德鲁和罗布是谁的人错误地遗漏了。这就是当你成长并让没有历史背景的新人加入时会发生的事情。\n因此，它可以被解读为邪恶的，但也可以被视为一个诚实的错误。我们找出问题所在后，花了一天时间恢复博客帖子。\n第二层把它列在这里，但让我感到不安(并让我在Twitter上咆哮)的并不是我的帖子都被删除了。我的帖子都被删除了，菲利普写给我永别的帖子也被删除了(请注意，菲利普的其他帖子都没有被删除)。如果只是我所有的帖子(或所有其他帖子)，我可以很容易地将其归因于一场意外，但事实是，这是我所有的帖子，而且菲利普给我写了一个告别博客，这让我认为这是另一回事。\n请注意，在我的帖子被移除期间，摩西的帖子也保留了下来。你知道摩西是谁吗？桑戈马的人知道摩西是谁吗？诚实的问题，因为摩西在2013年离开了FreePBX。那么，如果人们不知道安德鲁和罗伯是谁，那么他们为什么/怎么/谁知道摩西是谁呢？为什么是摩西而不是我？还是罗伯？只是好奇而已。\n我没有声称FreePBX是封闭源代码。我唯一的要求是我的博客帖子和菲利普关于我的告别帖子一起被删除了。\n奇怪的是，去年这一次我的账号也被停用了，在我把它放到Twitter上后，它也被修复了。\n如果我告诉你这件事没有让我心情不好，那我就是在撒谎。\n第二级如果它们被错误地省略了，为什么菲利普斯的告别安德鲁的帖子被删除了，而他所有的其他帖子都保留了下来？\n如果Samgoma注定要成为开源的指路明灯，你们生产了哪些新的开源模块？我所知道的最后一个新的开源模块是防火墙，我把它写了下来(然后有人从sysadmin-rpm中删除了我的密钥，这样我就不能一直更新它了)。\n这是胡说八道，你知道的。你似乎对我怀恨在心。承认这一点，或者至少编造一些更好的、内部连贯的借口。", "note_en": "Someone mentioned that the FreePBX homepage has changed, and I went and had a look. I think it looks good, apart from the strange dogfrog thing that have replaced Tango with, but they&#39;ve ALSO gone through and deleted all (ALL!) of my blogposts. 15 years worth. Also all of tm1000&#39;s (who was the lead for 8 odd years), AND any posts referencing him.\n I&#39;m pissed. The only reason I can think of them doing this, is that they&#39;re preparing to close the FreePBX source, and encourage people to move to their commercial offering (SwitchVox).\n I posted a bit of a  rant about this on twitter, and I guess this means that I really do have to start work on PhoneBo.cx finally!\n   level 1  I&#39;ve been unhappy with how limited the featureset is in Switchvox these days anyways (can&#39;t do things I used to be able to do 10 years ago, and their support won&#39;t make any changes to sip.conf even when I offer to pay their hourly rate). When this support contract is up in ~18 months I&#39;ll be looking to move on to someone that plays nicer with open source...\n level 1  I think that closing the source breaks the GPL license, right? As long as Sangoma continues to use source code from GPLed projects they are under obligation to provide FreePBX under GPL as well, if I understand the licensing issue correctly.\n And yeah, I know it better than I should how hard they made things for anyone that tries to build FreePBX from source up to a production-grade level.\n PS: if anyone around here has a better understanding of the involved licensing please correct me.\n level 2  There are very few parts of freepbx that are licensed under the GPL that Samgoma doesn&#39;t own. The other parts are either MIT, BSD or trivially rewritten. If I was still there, I could close source it within a couple of weeks. It may take them a few months these days, but it&#39;s technically achievable.\n  level 1  As the Vice President of Open Source at Sangoma, I can state unequivocally that we&#39;re not at all preparing &#34;to close the FreePBX source&#34; as Rob put it.\n Yes, our Marketing team messed up and archived some old blog posts. They&#39;ve since restored them. But please don&#39;t think that somehow that translates into use closing the source on FreePBX. That is absolutely not our intention.\n level 2  &#34;Archived&#34; is not the same as Deleted. The blog posts were deleted. Trying to claim otherwise is bullshit. Why were posts left there by OTHER previous developers, but Andrew, Bryan, and my posts were removed from history?\n Why was Philippes post saying goodbye to Andrew deleted, but all of his other posts remained?\n This was, yet again, a targeted attack, but this was the straw. I&#39;m sick of the &#34;it was a mistake&#34; backpedaling, too. Someone deliberately and explicitly chose to delete those articles.\n  level 1  Are you and the folks at Clearly going to fork the code and continue over there?\n  level 1  hmm... gosh i hope that&#39;s not the case. I use FreePBX *daily* and have been a long time supporter since when it was  Asterisk@Home. I&#39;d never want to move to SwitchVox, it looks like the old trixbox fork and failure. I understand the commercial modules and support for FreePBX and whatever you&#39;d categorize &#34;PBXAct&#34; (which to me is just FreePBX with a commercial costume / &#34;lipstick on a pig&#34;) and happily will continue to support those. Jared Smith also just posted this blog post about Sangoma open source leadership... so weird:  https://blogs.asterisk.org/2020/05/26/collaborating-for-success-in-open-source/?utm_source=twitter&amp;utm_medium=social\n Sucks how they have treated you Rob. I don&#39;t get it. It&#39;s like the open-source communication folks are all on the same side, so why this fighting.\n level 1  This along with Microsoft acquiring Metaswitch and Cisco buying Broadsoft has us a bit on edge.\n  level 1  FreePBX is open source and will ALWAYS be open source. Furthermore, Sangoma is 100% committed to keeping FreePBX open source. Everyone is welcome to join us at  https://community.freepbx.org/\n As for the blog post issue, we updated the whole freepbx.org site, and some blog posts were erroneously omitted by people that have no idea who Andrew and Rob were. That is what happens when you grow and get new people onboard that have no historical context.\n So it could be interpreted at as nefarious but it could also be seen as an honest mistake. It took one day to restore the blog posts once we figured out what the problem was.\n level 2  Laying it out here but what upset me (and made me go on a twitter &#39;rant&#39;) about the missing posts was not so much that mine were all removed. It was that mine were all removed AND the one from Philippe saying &#34;farewell&#34; to me was removed (note none of Philippe&#39;s other posts were removed). I can chalk it up to an accident easily if it was ONLY all of my posts (or all of other&#39;s posts) but the fact that it was all of my posts and the ONE where Philippe gave me a farewell blog made me think this was something else.\n Note that &#34;Moshe&#34;&#39;s posts also remained during the time mine were removed. Do you know who Moshe is? Does anyone at Sangoma know who Moshe is? Honest questions because Moshe left FreePBX in 2013. So if &#34;people have no idea who Andrew and Rob&#34; are then why/how/who did they know who Moshe was? Why Moshe and not me? Or Rob? Just curious.\n I have made no claims to FreePBX being closed source. My only claims were about my blog posts being removed along with Philippe&#39;s farewell post about me.\n Strangely last year this time my account was inactivated as well, which was also fixed after I brought it out on Twitter.\n I&#39;d be lying if I told you this didn&#39;t put me in a terrible mood.\n level 2  If they were &#34;erroneously omitted&#34; why was Philippes post saying goodbye to Andrew deleted, but all of his other posts remained?\n If Samgoma is meant to be the beacon of open source, what new open source modules have you guys produced? The last new open source module that I know of is firewall, and I wrote that (and &#34;someone&#34; then removed my key from sysadmin-rpm so I couldn&#39;t keep updating it)\n This is bullshit, and you know it. You seem to have some sort of vendetta against me. Own up to it, or at least make up some better, and internally coherent, excuses.", "posttime": "2020-05-31 01:53:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "freepbx,retcon", "title": "Sangoma刚刚让我退出了FreePBX，我有点生气", "title_en": "Sangoma just retcon'ed me out of FreePBX, and I'm kinda pissed", "transed": 1, "url": "https://www.reddit.com/r/VOIP/comments/gsl04i/sangoma_just_retconed_me_out_of_freepbx_and_im/", "via": "", "real_tags": ["freepbx", "retcon"]}, {"category": "", "categoryclass": "", "imagename": "79b9feb72e26403ca8d15017cf21dd54.jpg", "infoid": 1004421, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在5月27日星期三停止发射后，SpaceX现在的目标是5月30日星期六发射猎鹰9号，这是Crew Dragon的第二次演示(de.", "note_en": "After standing down from launch on Wednesday May 27, SpaceX is now targeting Saturday, May 30 for Falcon 9’s launch of Crew Dragon’s second demonstration (De...", "posttime": "2020-05-31 01:12:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,发射", "title": "SpaceX和NASA：Crew Demo-2", "title_en": "SpaceX and NASA: Crew Demo-2", "transed": 1, "url": "https://www.youtube.com/watch?v=bIZsnKGV8TE", "via": "", "real_tags": ["nasa", "发射"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在处理需要以最快速度向最终用户显示内容的Rust应用程序或CLI时，我经常发现，大量时间通常不是花在做任何计算上，而是花在删除函数末尾的大型数据结构上。\n例如，假设您有一个函数，该函数获取一些较重的对象并返回其大小：\n弄到a的大小是非常便宜的。它大约需要0.01ms，但是整个函数在返回任何东西之前可能需要1000ms，这是因为Rust需要丢弃a的值并释放它在返回之前使用的所有内存。\n如果HeavyThing是一个非常复杂的数据结构，那么释放它正在使用的所有内存可能需要一段时间。\n对于UI和交互式CLI来说，这真的很糟糕。我们已获得响应用户请求所需的所有数据，但在我们完成清理之前，无法对其执行任何操作！\n解决此问题的方法之一是推迟丢弃该值，方法是将其移动到另一个线程，让它来处理它。\n在本例中，我们生成另一个线程，将繁重的数据结构移入其中，然后开始执行。该函数立即返回，并且在将来的某个地方，另一个线程将开始执行删除数据结构和释放所有已用内存的工作。\n这里是一个使用具有1M个密钥的HashMap&usize，Vec&lt；usize；&&gt;数据结构的小示例。延迟放置到另一个therad的功能执行速度大约快10K倍。这是一个使用HashMap&lt；usize，Vec&lt；usize&&gt;数据结构的小示例，该数据结构有1M个密钥", "note_en": "When working on Rust applications or CLIs that need to show something to the end user as fast as possible I often find that a significant chunk of the time is usually spent not in doing any computations, but in dropping large data structures at the end of the function.\n For example, imagine you have a function that takes some heavy object and returns its size:\n  Getting  size of  a is extremely cheap. it takes about  0.01ms, hovever the entire function can take  1000ms before it returns anything.This is because Rust needs to drop the value of  a and deallocate all memory it was using before it can return.\n  And if  HeavyThing is a very complex data structure it might take a while to deallocate all memory it&#39;s using.\n This really sucks for UIs and interactive CLIs. We got all needed data to respond to a user request, but can&#39;t do anything with it until we finish cleaning things up!\n One of the workarounds for this problem is to defer dropping the value by moving it to another thread and letting it take care of it.\n  In this example, we spawn another thread, move the heavy data structure into it and froget about it. The function returns right away and somewhere in the future the other thread will start doing the work of dropping the data structure and deallocating all used memory.\n Here&#39;s a small example of working with a  HashMap&lt;usize, Vec&lt;usize&gt;&gt; data structure that has 1M keys.The function that defers dropping to another therad performs about 10K times faster", "posttime": "2020-05-31 01:11:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,rust,线程,速度,dropping", "title": "生锈：将较重的东西放入另一个线程可以使您的代码速度提高10000倍", "title_en": "Rust: Dropping heavy things in another thread can make your code 10000x faster", "transed": 1, "url": "https://abramov.io/rust-dropping-things-in-another-thread", "via": "", "real_tags": ["代码", "rust", "线程", "速度", "dropping"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果我说，我只需要你的电子邮件ID就可以接管你在你最喜欢的网站或应用程序上的账户。听起来很可怕，对吧？这就是苹果登录的一个bug允许我做的事情。\n在4月份，我发现苹果的零日登录影响了使用它的第三方应用程序，这些应用程序没有实施他们自己的额外安全措施。此漏洞可能导致该第三方应用程序上的用户帐户被完全接管，而不管受害者是否拥有有效的Apple ID。\n由于这个漏洞，苹果公司根据他们的苹果安全赏金计划向我支付了10万美元。\n苹果的登录功能类似于OAuth 2.0。通过使用JWT(JSON Web Token)或Apple服务器生成的代码对用户进行身份验证有两种可能的方式。然后使用该代码生成JWT。下图显示了JWT创建和验证的工作原理。\n在第二步中，在授权的同时，苹果给用户一个选择，要么与第三方应用程序共享苹果电子邮件ID，要么不共享。如果用户决定隐藏电子邮件ID，Apple将生成自己的特定于用户的Apple中继电子邮件ID。根据用户选择，在成功授权后，Apple会创建包含此电子邮件ID的JWT，然后第三方应用程序将使用该ID登录用户。\n{&#34；ISS&#34；：&#34；https://appleid.apple.com&#34；，&#34；Aud&#34；：&#34；com.XXXX.weblogin&#34；，&#34；exp&#34；：158XXXXXXX，&#34；iat&#34；：158XXXXXXX，&#34；sub&#34；：&#34；XXXX.XXXXX.XXXX&#34；，&#34；c_hash&#34。，&#34；电子邮件&#34；：&#34；[电子邮件受保护]&#34；，//或&#34；[电子邮件受保护]&#34；&#34；电子邮件_验证&#34；：&#34；true&#34；，&#34；auth_time&#34；：158XXXXXXX，&#34；NONCE_SUPPORTED&#34；：true}。\n我发现我可以向苹果请求JWTs的任何电子邮件ID，当使用苹果的公钥验证这些令牌的签名时，它们显示为有效。这意味着攻击者可以通过将任何电子邮件ID链接到JWT并获得对受害者帐户的访问权限来伪造JWT。\n在这里，当传递任何电子邮件时，Apple为该特定电子邮件ID生成一个有效的JWT(Id_Token)。\n{&#34；授权&#34；：{&#34；id_Token&#34；：&#34；eyJraWQiOiJlWGF1bm1MIiwiYWxnIjoiUlMyNTYifQ.XXXXX.XXXXX&#34；，&#34；授权代码&#34；：&#34；XXX.0.nzr.XXXX&#34；，&#34；范围&#34；：[&#34；名称&#34；，&#34；电子邮件&#34；]}，&#34；授权数据&#34；：{&#34；userid&#34；：&#34；XXX.XXXXX.XXXX&#34；}，&#34；consentRequired&#34；：false}。\n此漏洞的影响相当严重，因为它可能会允许完全接管帐户。很多开发者已经集成了苹果的登录，因为支持其他社交登录的应用程序是强制性的。举几个使用苹果Sign-in的例子-Dropbox，Spotify，Airbnb，Giphy(现在被Facebook收购)。这些应用程序没有经过测试，但如果在验证用户时没有任何其他安全措施，则可能容易受到完全帐户接管的攻击。\n苹果还对他们的日志进行了调查，确定没有因为这个漏洞而误用或泄露账户。", "note_en": "What if I say, your Email ID is all I need to takeover your account on your favorite website or an app. Sounds scary, right? This is what a bug in  Sign in with Apple allowed me to do.\n In the month of April, I found a zero-day in  Sign in with Apple that affected third-party applications which were using it and didn’t implement their own additional security measures. This bug could have resulted in a  full account takeover of user accounts on that third party application irrespective of a victim having a valid Apple ID or not.\n For this vulnerability, I was paid $100,000 by Apple under their Apple Security Bounty program.\n  The  Sign in with Apple works similarly to OAuth 2.0. There are two possible ways to authenticate a user by either using a  JWT (JSON Web Token) or a  code generated by the Apple server. The code is then used to generate a JWT. The below diagram represents how the JWT creation and validation works.\n  In the 2nd step, while authorizing, Apple gives an option to a user to either share the Apple Email ID with the 3rd party app or not. If the user decides to hide the Email ID, Apple generates its own user-specific Apple relay Email ID. Depending upon the user selection, after successful authorization, Apple creates a JWT which contains this Email ID which is then used by the 3rd party app to login a user.\n  {  &#34;iss&#34;:  &#34;https://appleid.apple.com&#34;,  &#34;aud&#34;:  &#34;com.XXXX.weblogin&#34;,  &#34;exp&#34;: 158XXXXXXX,  &#34;iat&#34;: 158XXXXXXX,  &#34;sub&#34;:  &#34;XXXX.XXXXX.XXXX&#34;,  &#34;c_hash&#34;:  &#34;FJXwx9EHQqXXXXXXXX&#34;,  &#34;email&#34;:  &#34; [email protected]&#34;, // or  &#34; [email protected]&#34;  &#34;email_verified&#34;:  &#34;true&#34;,  &#34;auth_time&#34;: 158XXXXXXX,  &#34;nonce_supported&#34;:  true }\n  I found I could request JWTs for any Email ID from Apple and when the signature of these tokens was verified using Apple’s public key, they showed as valid. This means an attacker could forge a JWT by linking any Email ID to it and gaining access to the victim’s account.\n   Here on passing any  email, Apple generated a valid JWT (id_token) for that particular Email ID.\n  {  &#34;authorization&#34; :  {  &#34;id_token&#34; :  &#34;eyJraWQiOiJlWGF1bm1MIiwiYWxnIjoiUlMyNTYifQ.XXXXX.XXXXX&#34;,  &#34;grant_code&#34; :  &#34;XXX.0.nzr.XXXX&#34;,  &#34;scope&#34; :  [  &#34;name&#34;,  &#34;email&#34;  ]  },  &#34;authorizedData&#34; :  {  &#34;userId&#34; :  &#34;XXX.XXXXX.XXXX&#34;  },  &#34;consentRequired&#34; :  false }\n The impact of this vulnerability was quite critical as it could have allowed full account takeover. A lot of developers have integrated  Sign in with Apple since it is mandatory for applications that support other social logins. To name a few that use  Sign in with Apple - Dropbox, Spotify, Airbnb, Giphy (Now acquired by Facebook). These applications were not tested but could have been vulnerable to a full account takeover if there weren’t any other security measures in place while verifying a user.\n Apple also did an investigation of their logs and determined there was no misuse or account compromise due to this vulnerability.", "posttime": "2020-05-31 00:24:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,apple,苹果", "title": "使用Apple Zero Day登录", "title_en": "Sign in with Apple Zero Day", "transed": 1, "url": "https://bhavukjain.com/blog/2020/05/30/zeroday-signin-with-apple/", "via": "", "real_tags": ["app", "apple", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请不要理会这个盒子。", "note_en": "Ignore this box please.", "posttime": "2020-05-31 00:08:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生成,randomly,理会", "title": "DuckDuckGo：随机生成的人", "title_en": "DuckDuckGo: Randomly Generated Person", "transed": 1, "url": "https://duckduckgo.com/?t=ffab&q=random+person+name+generator&ia=answer", "via": "", "real_tags": ["生成", "randomly", "理会"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些人强烈认同他们的星座，而另一些人则认为占星术完全是胡说八道。如果你点击这个网站，你可能属于第二阵营。当然，仅仅因为明星们不能告诉你任何关于你个性的事情，并不意味着你应该错过一个表面的身份标签。这就是数学史的用武之地。点击下面的一个表面，看看你的数学算术符号是怎么说你的！", "note_en": "While some people strongly identify with their astrological sign, others think astrology is complete bullsh*t. If you clicked on this website, you&#39;re probably in the second camp. Of course, just because the stars can&#39;t tell you anything about your personality doesn&#39;t mean that you should miss out on having a surface level identity label. That&#39;s where Math-strology comes in. Click on a surface below to find out what your Math-strological sign says about you!", "posttime": "2020-05-31 00:08:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学家,astrology,认为", "title": "数学家的占星术", "title_en": "Astrology for Mathematicians", "transed": 1, "url": "https://mathstrology.com/", "via": "", "real_tags": ["数学家", "astrology", "认为"]}, {"category": "", "categoryclass": "", "imagename": "f4355f9d1baba163ae0dcf6d423a1cd4.jpg", "infoid": 1004412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多知名且经常使用的网站都在使用防欺诈脚本，该脚本通过端口扫描您的本地计算机以查找远程访问程序。\n上周末，有大量新闻称，eBay.com在访问者浏览其网站时，会对他们的电脑进行端口扫描。\n此端口扫描是由ThreatMetrix的欺诈保护脚本执行的，该脚本用于检测进行欺诈性购买的潜在被黑客攻击的计算机。\n执行时，此产品的一项功能使用WebSockets扫描访客计算机上的14个不同的TCP端口。\n所有这些端口都用于远程访问程序，通常出于合法原因使用，但也已知用于恶意目的。下面列出了这些端口、它们的标识符和关联的应用程序。\n嘟嘟计算机仍无法识别端口63333上的目标程序。根据名称，我们认为这是测试的参考端口。\n虽然每个电子商务网站都应该使用各种方法来检测欺诈行为，但许多网站发现，在未经许可的情况下通过端口扫描访问者的计算机上的程序太具侵入性。\n为了了解其他网站可能正在使用这个脚本，BleepingComputer联系了专门从事web域名和DNS威胁情报的网络安全公司DidainTools。\n当网站加载ThreatMetrix的反欺诈脚本时，它们会通过客户名为online-metrix.net的主机名加载脚本。\n例如，eBay的网站从www.src.ebay-us.com加载ThreatMetrix脚本文件，这是一个CNAME DNS记录，内容是.h-ebay.online-metrix.net。\nDomainTools能够向beepingcomputer提供387个名称相似的唯一在线metrix.net主机名列表。\n使用这份名单，beepingcomputer访问了许多大公司的网站，并在访问时检查他们是否在扫描我们的计算机。\n虽然没有一家网站的访问量像eBay那样大，但许多使用ThreatMetrix反欺诈脚本的网站都是知名品牌。\n在我们测试的网站中，我们看到花旗银行、TD银行、美国企业、Chick-Fill-A、Lendup、Beachbody、Equifax IQ connect、TIAA-CREF、Sky、Gumtree和WePay端口扫描我们的计算机。\n例如，花旗银行、美国企业和TIAA-CREF在访问网站主页时，立即对我们的计算机进行端口扫描。\nTD银行、Chick-Fill-A、Lendup、Equifax IQ Connect、Sky、Gumtree和WePay仅对试图登录的访问者进行端口扫描。\n根据我们收到的域名列表，其他知名公司也在使用ThreatMetrix脚本。\n这份名单包括Netflix、Target、沃尔玛、ESPN、劳埃德银行、HSN、Telecharge、Ticketmaster、TripAdvisor、PaySafeCard，甚至可能还有微软。\n我们无法在这些网站上触发端口扫描功能，但它可能已在我们没有访问的页面上使用。\n虽然我们有一种很好的感觉，即这些端口扫描正在被用来检测潜在的黑客电脑，但我们联系了NexisLexis公司和上面列出的一些公司进行确认。\n不幸的是，在本文发表时，我们没有收到他们任何人的回复。\n如果你发现这些端口扫描具有侵扰性和隐私风险，你可以利用Firefox中的uBlock Origin广告阻止程序来阻止它们。\n在我们的测试中，uBlock无法阻止新的Microsoft Edge或Google Chrome中的端口扫描，因为扩展没有足够的权限来揭开DNS CNAME记录的面纱。\n我们还测试了Brave浏览器，端口扫描被允许通过，如下所示。", "note_en": "Many well-known and heavily used web sites are using a fraud protection script that port scans your local computer for remote access programs.\n Last weekend, news heavily circulated that  eBay.com was port scanning visitors&#39; computers when they browsed their site.\n This port scanning was conducted by the LexisNexis&#39;  ThreatMetrix fraud protection script used to detect potentially hacked computers making fraudulent purchases.\n When executed, a feature of this product uses WebSockets to scan 14 different TCP ports on a visitor&#39;s computer.\n  All of these ports are for remote access programs commonly used for legitimate reasons but are also known to be used for malicious purposes. These ports, their identifiers, and associated applications are listed below.\n  BleepingComputer has still not been able to identify the targeted program on port 63333. Based on the name &#39;REF,&#39; we believe this is a reference port for tests.\n While every e-commerce site should use methods to detect fraud, many found that it was too intrusive to port scan a visitor&#39;s computer for programs without permission.\n  To see what other sites may be using this script, BleepingComputer reached out to  DomainTools, a cybersecurity company specializing in web domain and DNS threat intelligence.\n When web sites load ThreatMetrix&#39;s anti-fraud scripts, they load the script via a customer-named online-metrix.net hostname.\n For example, eBay&#39;s site loads the ThreatMetrix script from src.ebay-us.com, a CNAME DNS record for h-ebay.online-metrix.net.\n DomainTools was able to provide BleepingComputer with a list of 387 unique online-metrix.net hostnames that are named similarly.\n Using this list, BleepingComputer visited the sites for many of the larger companies and checked if they were port scanning our computers when visiting.\n While none are as large as eBay in terms of visitors, many of the sites using ThreatMetrix&#39;s anti-fraud scripts are well-known brands.\n Of the sites we tested, we saw Citibank, TD Bank, Ameriprise, Chick-fil-A, Lendup, BeachBody, Equifax IQ connect, TIAA-CREF, Sky, GumTree, and WePay port scanning our computers.\n   For example, Citibank, Ameriprise, and TIAA-CREF immediately port scanned our computers when visiting the main page of the site.\n TD Bank, Chick-fil-A, Lendup, Equifax IQ connect, Sky, GumTree, and WePay only port scanned visitors who tried to log in.\n  Based on the list of domains we received, other well-known companies are using the ThreatMetrix script.\n This list includes Netflix, Target, Walmart, ESPN, Lloyd Bank, HSN, Telecharge, Ticketmaster, TripAdvisor, PaySafeCard, and possibly even Microsoft.\n We could not get the port scan feature to trigger on these sites, but it may have been used on a page we did not visit.\n While we have a good feeling that these port scans are being used to detect potentially hacked computers, we reached out to NexisLexis and to some of the companies listed above to confirm.\n Unfortunately, we did not hear back from any of them at the time of this publishing.\n  If you find these port scans to be intrusive and a privacy risk, you can utilize the uBlock Origin adblocker in  Firefox to block them.\n In our tests, uBlock is unable to block the port scans in the new Microsoft Edge or Google Chrome as the extension does not have adequate permissions to uncloak the DNS CNAME records.\n We also tested the Brave Browser, and the port scans were allowed through, as seen below.", "posttime": "2020-05-31 00:07:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "访问者,web,网站", "title": "端口扫描其访问者的知名网站列表", "title_en": "List of well-known web sites that port scan their visitors", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/list-of-well-known-web-sites-that-port-scan-their-visitors/", "via": "", "real_tags": ["访问者", "web", "网站"]}, {"category": "", "categoryclass": "", "imagename": "e8a7b94a60fca5b91fec8e869f94ccc1.png", "infoid": 1004411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是那个胖孩子。然后青春期来临，我就跳起来了。我开始打篮球，在这个过程中瘦了下来。就在我的身体习惯了这一点的时候，我进入了全天学习进入大学阶段。再加上舒适的进食，我又回到了胖乎乎的自己。\n我的身体是怎么运作的？为什么？是不是就像少吃多锻炼那么简单？\n事实证明并非如此，但这个问题让我了解了系统论。我可以应用于我的身体来理解肥胖的实际过程。最精彩的部分？这些想法不仅仅适用于这个单一的人体。\n不管怎么说，什么是系统？它是一起工作的部件的集合。这是相当广泛的：它包括地球、政府、海滩和我们。\n那么，什么不是系统呢？任何单独的部分。这包括：一颗螺丝，一粒沙子，一个原子 - ，这取决于你看到的分辨率。我们可以争辩说，螺丝也是一个系统，因为它是原子的集合，一起工作，保持正确的形状来制造螺丝。\n因为几乎所有的东西都是一个系统，我们可以利用系统论中的概念来解决几乎任何问题。\n让我们深入到系统中去吧。以下是吸引我注意的 - 反馈循环。\n反馈是将信息发送回系统的一种机制。反馈会影响系统。如果A导致B，那么B也可能导致A。\n新年伊始，你的产品比你的竞争对手好1%。因此，您获得的客户比您的竞争对手多1%。今年你赢了。\n反馈的是更多的客户，这等于更大的收入。有了更多的收入，您就有了更多的资源来改进您的产品。\n第二年，多亏了额外的资源，你的产品比你的竞争对手好了2%。所以，你多赢得了2%的客户。你又赢了。\n反馈的是更多的收入来进一步改进你的产品。很快，你的竞争对手为了跟上竞争对手而破产，而你，赢家，夺走了所有的市场份额。\n更多的收入可以创造更好的产品，就像更好的产品可以创造更多的收入一样。\n如果您可以看到这些反馈循环并使用它们来解决问题，会怎么样？欢迎来到系统思维的世界。\n首先， - 构建块。只有两个。它们共同构成了所有可以想象到的系统。\n他们试图使一个系统达到平衡状态。它们提供负反馈，因此，也称为负反馈环。\n他们试图对系统求幂。它们提供正反馈，因此，也称为**正反馈循环。**每一个可以自我繁殖的系统都有可能创造一个加强环。\n这就是系统的全部意义所在。那么，在处理自创建的系统时，是什么让连Mark都哭了呢？\n以Facebook为例。您有一个算法来决定提要中显示的内容。如果它是人们喜欢的东西，人们就会坚持使用Facebook，告诉他们的朋友Facebook有多棒。一个加强环。这会导致在Facebook上花费更多的时间，从而为Facebook带来更多的收入。更好的收益季度给了股东更多的信心，推动股价上涨 - 又一个强化循环。对于股市，人们担心 - 会崩溃，这是一个平衡的循环，使投资变得温和。\n更好的股价，更高的收入将更多的科技人才吸引到Facebook。这导致了…的出现。更好的馈送算法。最终的加强环。如果故事在这里结束，那就都是彩虹和蝴蝶了，对吧？另一方面，循环是双向的， - 在算法上犯了错误，或者将数据出售给第三方，而世界发现了这一点，人们开始不信任facebook，人们开始删除facebook，收购的初创公司创始人开始离开facebook，这压低了收入，从而压低了股价和招聘人数。这导致了…的出现。一个更糟糕的饲料。因此，加强环继续。\n多内拉·梅多斯(Donella Meadows)在“在系统中思考：\n系统行为的决定因素是它的功能或目的。就像查理·芒格说的那样-。\n这是一个系统的框架。有关更完整的介绍，请查看“系统中的思考”。我怎么推荐这本书都不为过！\n在每种情况下，我们都有两个或更多的循环将我们的系统拉向不同的方向，朝着不同的目标。\n平衡环路和强化环路都是寻找目标的。区别在于目标的类型。两者都有相反的目标，因此才会有竞争。\n在任何时候，系统都在朝着一个目标前进，或者处于平衡状态。将整个系统移向其目标的回路是主导回路。\n如果有足够的时间，占主导地位的循环会不断变化。这种改变循环的概念正在改变主导地位。\n有了这些定义，我们就可以进入 - 实际探索系统的有趣部分了！\n更多的出生导致更高的人口 - ，从而导致更多的出生！一个加强环。\n更多的死亡导致更少的人口 - ，从而导致更少的死亡人数！一个平衡圈。\n如果人口在增加，出生率就是主导循环。如果人口在减少，死亡就是主导循环。如果人口是恒定的，则系统处于平衡状态。\n这会导致复杂性，因为现在您正试图了解系统的趋势。在货币市场，这一切都是关于循环主导地位的， - 市场是在上涨还是在下跌？主导地位什么时候会改变？什么时候的月亮，什么时候的兰博？\n谁在控制这个系统？你对这个系统了解得越好，你就能更好地回答这个问题。你越了解系统在一段时间内是如何运行的，你就会过得越好。\n又一次思维实验。想象一下你是一名汽车销售经理。你每周订购新车的数量是根据你每周总共需要30辆车的数量而定的。这就是你的平衡反馈回路。\n你从30辆车开始。第一周卖出20只，订购20只。第二周卖出5只，订购5只。下一周卖出15只，订购15只。你每周有30只，这是你的预期库存。一切都很好。\n然而，在现实生活中，事情并不是这样的。从你点的车到你要的车之间会有一段时间的延误。假设汽车需要一周的时间才能送到你身边。然后会发生什么呢？\n你从30辆车开始。第一周卖出20辆，订购20辆。总共10辆。下周卖5辆，订购25辆，因为你只剩下5辆车了。你的20批订单货到了，总共是25批。你卖了15辆，总数降到10辆，你订购了20辆。下个星期，这25辆车就到了。现在你有35辆车。\n你会因为调整浴缸里的冷热水平仪而感到沮丧吗？这是一个有延迟的系统。你得等水从间歇泉流到淋浴喷头后再做下一个决定。\n你对系统和身体的输入就是你吃什么和不吃什么。\n结果是大便和汗水。因为这很难测量，所以我们用身体的重量作为健康的衡量标准。在过去的几个月里，我每天都在跟踪我的体重。\n深入的分析，通过这个反馈循环，如何理解一个复杂的系统，我将离开到另一个帖子。\n在过去的一年里，我仍然在用我的身体 - 解决问题，我得到了4包，换了国家，又回到了家庭包，现在，用普通的2包 - ，我认为体重不是判断健康的最好指标。\n最后，这里有一些值得思考的东西，将反馈循环和80/20原则联系起来，作者是理查德·科赫(Richard Koch)。\n在没有反馈回路的情况下，现象的自然分布将是50/50--给定频率的输入将导致相称的结果。只是因为有正反馈和负反馈循环，才会导致不同的结果。然而，强大的正反馈循环似乎只影响一小部分投入，这似乎也是真的。\n每个月我都会选择一种新的思维模式来探索。每个月，我都会写一篇新文章，囊括我所学到的一切和我使用过的资源。我将此作为掌握心智模型的终极指南。你也可以。以下是剩下的内容：", "note_en": "I was the fat kid. Then puberty hit and I shot up. I started playing basketball, slimming down in the process. Just as my body got used to that, I entered the study-all-day-to-get-into-college phase. Mixed with comfort feeding, I was back to my chubby self.\n How does my body work? Why? Is it as simple as eating less and exercising more?\n Turns out, it isn’t. But this question introduced me to  Systems Theory. Practical processes I could apply to my body to understand fat-ness. The best part? The ideas apply to so much more than this single human body.\n   What’s a system, anyway? It’s a collection of parts working together. That’s rather broad: it includes the earth, the government, the beach and us.\n What’s not a system, then? Anything that’s a part standing alone. This includes: A screw, a grain of sand, an atom — depending on the resolution you’re looking at. We can argue, that a screw is a system as well, since it’s a collection of atoms working together, staying in the correct shape to make a screw.\n Since almost everything is a system, we can leverage concepts from System Theory to solve almost any problem.\n  Let’s descend into systems. Here’s what caught my attention — feedback loops.\n Feedback is a mechanism to send information back to the system. The feedback affects the system. If A causes B, it becomes possible that B causes A too.\n  You begin the year with a product that is 1% better than your competitors. So, you gain 1% more customers than your competitors. You win this year.\n The feedback is more customers, which equals a greater revenue. With the greater revenue, you have more resources to improve your product.\n The next year, thanks to extra resources, your product becomes 2% better than your competitors. So, you gain 2% more customers. You win again.\n The feedback is a lot more revenue to further improve your product. Soon, your competitor goes bankrupt trying to keep up, and you, the winner, takes all the market share.\n Greater revenue can create a better product, as much as a better product can create greater revenue.\n What if you could see these feedback loops and use them to solve problems? Welcome to the world of Systems Thinking.\n  First off — the building blocks. There are only two. Together, they make up every system imaginable.\n  They attempt to bring a system to an equilibrium state. They provide negative feedback, and hence, also known as  negative feedback loops.\n   They attempt to exponentiate a system. They provide positive feedback, and hence, also known as **positive feedback loops. **Every system which can multiply itself has potential for creating a reinforcing loop.\n   That is all there is to systems. What then makes even Mark cry when dealing with self-created systems?\n  Consider Facebook. You have an algorithm which decides what shows up in the feed. If it’s something people love, people will stick to Facebook and tell their friends about how awesome facebook is. A reinforcing loop. This leads to more time spent on Facebook, hence more revenue for Facebook. A better earnings quarter gives more confidence to shareholders, driving the stock price up — another reinforcing loop. With the stock market, there is a fear of crashing down — a balancing loop, moderating investment.\n A better share price, higher revenue attracts more tech talent to Facebook.  And that results in … a better feed algorithm. The ultimate reinforcing loop. Would be all rainbows and butterflies if the story ended here, right? The flip side, is that the loop works both ways — make a mistake with the algorithm, or sell data to a third party which the world finds out about, and people start distrusting Facebook, people start deleting Facebook, acquired start up founders start leaving Facebook, which drives down revenue, which drives down share price and drives down hiring.  And that results in … a worse feed. Thus, the reinforcing loop continues.\n  What makes learning about systems worthwhile is this key insight by Donella Meadows in  Thinking in Systems:\n  The determinant of a system’s behaviour is its function or purpose. As Charlie Munger would put it —\n  Here’s a framework of systems. For a more complete introduction, check out  Thinking in Systems. I can’t recommend this book enough!\n  In every case, we have two or more loops pulling our system in different directions, towards different goals.\n Both balancing and reinforcing loops are goal-seeking. The difference is the type of goal. Both have goals in opposite directions, hence the competition.\n At any point, the system is moving towards one goal, or is in equilibrium. The loop moving the entire system to its goal is the  dominant loop.\n Given enough time, the dominant loop keeps changing. This concept of changing loops is  shifting dominance.\n With the definitions out of the way, we can get into the interesting parts — actually exploring a system!\n     More births leads to a higher population — which leads to even more births! A reinforcing loop.\n More deaths lead to a smaller population — which leads to a smaller number of deaths! A balancing loop.\n  If the population is moving up, births are the dominant loop. If the population is moving down, deaths are the dominant loop. If the population is constant, the system is in equilibrium.\n       It leads to complexities, since now you’re trying to understand the trend of the system. In money markets, it’s all about the loop dominance — is the market going up or down? When will the dominance change?  When moon, when lambo?\n Who is in control of the system? The better you understand the system, the better you can answer that. The better you know how the system behaves over time, the better off you’ll be.\n   Another thought experiment. Imagine you’re a car sales manager. You order new cars every week based on how many cars you need to make 30 total every week. That’s your balancing feedback loop.\n You start with a 30 cars. Sell 20 the first week, order 20. Sell 5 the next week, order 5. Sell 15 the next week, order 15. You end up with 30 every week, your expected stock. All’s good.\n Things don’t work that way in real life though. There’s a delay between when you order and when the cars come to you. Let’s say it takes a week for the cars to come to you. What happens then?\n You start with 30 cars. Sell 20 the first week, order 20. Total cars at 10. Sell 5 the next week, order 25, since you only have 5 cars left. Your 20 order shipment comes in, total at 25. You sell 15, total goes down to 10 and you order 20. The next week, your shipment comes in for the 25 cars. Now you have 35 cars.\n    Do you get frustrated with fixing the hot-cold level in the bath? That’s a system with delays. You’ve got to wait for the water to get from the geyser to the shower head before making the next decision.\n   Your inputs to the system, the body, is what you eat  and what you don’t eat.\n The output is poop and sweat. Since that’s hard to measure, we use a proxy, the weight of the body as a metric for healthiness. I’ve been tracking my weight everyday for the past few months.\n    The in-depth analysis, working through this feedback loop, how to understand a complex system,  I’ll leave for another post.\n I’m still figuring things out with my body — over the past year, I got a 4 pack, changed countries, went back to a family pack, and now, with a homely 2 pack — I think weight isn’t the best metric to judge health.\n  To end, here’s something to think about, linking feedback loops and the 80/20 principle, by  Richard Koch.\n In the absence of feedback loops, the natural distribution of phenomena would be 50/50–inputs of a given frequency would lead to commensurate results. It is only because of positive and negative feedback loops that causes do not have equal results. Yet it also seems to be true that powerful positive feedback loops only affect a small minority of the inputs.\n        Every month I choose a new mental model to explore. Every month, I create a new article encompassing all I learnt and the resources I used. I use this as my ultimate guide to mastering mental models. You can too. Here’s the rest:", "posttime": "2020-05-31 00:06:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "查看,systems,系统", "title": "如何查看系统", "title_en": "How to See Systems", "transed": 1, "url": "https://neilkakkar.com/How-to-see-Systems-in-everyday-life.html", "via": "", "real_tags": ["查看", "systems", "系统"]}, {"category": "", "categoryclass": "", "imagename": "05275ddf887f6eff1d8ca5b3af4acefd.png", "infoid": 1004410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PermalLink GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\n忘掉垃圾邮件、广告邮件、黑客攻击机器人吧。保持您真实邮箱的清洁和安全。垃圾邮件提供临时(或永久)、安全、匿名、免费、一次性的电子邮件地址。想来一杯吗？此处：@trashemail_bot。\n一次性电子邮件-是一项服务，允许在某个特定时间后自毁的临时地址(这里的临时因素取决于您)接收电子邮件。它也被称为：临时邮件、10分钟邮件、一次性电子邮件、假邮件或垃圾邮件。许多论坛、Wi-Fi所有者、网站和博客要求访问者在查看内容、发布评论或下载之前进行注册。\n垃圾邮件不是最先进的一次性电子邮件服务，但它是一项可靠的服务，可以帮助您避免垃圾邮件，确保安全，并将电子邮件直接发送到您的@trashemail_bot Telegram机器人。如果您收到的此类邮件太多，只需单击一下(Oops命令，因为这是电报机器人)即可删除电子邮件ID：)。\n有些网站提供此类功能(如https://temp-mail.org/en/等)，但此类平台存在某些问题：\n每次你必须访问网站才能获得一封，你不可能长时间保留相同的临时邮件。\n考虑到这一切，我决定根据我的爱好做一个开源项目，并考虑将其作为一种服务提供给其他人：)我的服务如何比他们的更好：\n整个源代码都是公开的，我对你的数据一点也不感兴趣。\n现在我拥有一个域trashemail.in，您将只能从该域获得电子邮件ID。(您很容易记住)。\n您的电子邮件ID的临时有效时间在您身上，而不是在服务器上，您也可以永久保存它，或者只要我能够维护@trashemail_bot。\n这个项目是出于激情，所以我没有任何赚取任何东西的动机，所以没有广告。(我是认真的，我也讨厌他们，就像你一样)。\nTrashEmail是Java Spring-Boot微服务，任何人当前都可以在本地构建它，只需很少的设置进行调整，然后在本地运行整个安装程序。您只需拥有邮件服务器(SMTP和IMAP)、电报bot令牌和MVN就可以在本地构建它。对邮件服务器有以下几个要求：\n所有您需要做的就是克隆源代码，构建并运行，然后告诉电报您正在监听这里。\ngit克隆https://github.com/r0hi7/Trashemail.git cd垃圾邮件#根据您的邮件服务器更新应用程序.yml文件#mvn全新安装#如果成功ljava-jar目标/垃圾邮件目标/teldot-0.0.1-SNAPSHOT.jar。\n#Email Server imap和smtp配置#smtp服务器应支持创建和删除别名#imap服务器应支持空闲电子邮件Server：host：trashemail.in admin：Email：Contact@trashemail.in密码：changeme API：Aliases：add_url：https://trashemail.in/admin/mail/aliases/add Remove_url：https://trashemail.in/admin/mail/aliases/remove imap：host：trashemail.in端口：993Email：Contact@trashemail.in密码：changeme。#Telegram BOT专用设置Telegram：url：https://api.telegram.org/bot botToken：Telegram-BOT-Token#用于开发目的，使用H2。#我更喜欢文件中持久的H2。Spring：dataSource：url：jdbc：h2：file：./appdb；DB_CLOSE_ON_EXIT=FALSE；AUTO_RECONNECT=TRUE Driver-Class-Name：org.h2.驱动程序用户名：SA Password：Password JPA：Database-Platform：org.hibernate.Dialt.H2Dialect Hibernate：DDL-AUTO：UPDATE H2：Console：Path：/H2-控制台设置：Web-Allow-Other：True Application：Name：Trashemail#Tomcat服务器设置服务器：端口：9090#记录器设置日志记录：Level：IO：giHub：trashemail：debug\n现在必须将此服务公开到互联网上，并且有如下选项：ngrok、dataplicity、localnel等。\nDB是由H2负责的，在一个文件中(我认为这就足够了，它需要非常轻的DB表)。\n它欺骗了用户，它创建了一个电子邮件ID，而不是创建了一个退出ID。为什么Alais，因为IMAP需要正确轮询接收的邮件？这就是它是如何设计的。\n一旦邮件被取回，就会识别目标并发送电报消息。\n我已经尝试设计这项服务是可靠的，如果你发现任何问题的可靠性(或任何其他)，请随时下降公关。我很乐意审查和合并。", "note_en": "Permalink     GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n       Forget about spam, advertising mailings, hacking and attacking robots. Keep your real mailbox clean and secure.Trashemail provides temporary(or permanent), secure, anonymous, free, disposable email address. Want to get one ? its here :  @trashemail_bot\n  Disposable email - is a service that allows to receive email at a temporary(Here in case, the temporary factor is upto you) address that self-destructed after a certain time elapses. It is also known by names like : tempmail, 10minutemail, throwaway email, fake-mail or trash-mail. Many forums, Wi-Fi owners, websites and blogs ask visitors to register before they can view content, post comments or download something.\n Trashemail is not most advanced throwaway email service but a reliable service that helps you avoid spam, stay safe and get emails delivered directly to your  @trashemail_bot  Telegram bot. And in case you are getting too many such mails, just delete the email Id :) with one click(oops command, since this is telegram bot).\n There are websites that offers such sort of functionalities (like  https://temp-mail.org/en/ etc) but the certain issues with such platforms:\n Everytime you have to visit site to get one, you cant keep the same temporary mail for long.\n Considering all of this, I decided to make a open source project out of my hobby and thought of offering it as a service to others :)How my service is  better than theirs:\n The entire source code is open for audit, I am not interested in your data at all.\n Right now I own a domain trashemail.in and you will get emailIds from this domain only. (Easy for you to remember).\n The temporary time for your emailId to be alive is on you, not on the server, you can keep it permamently as well, or as long as I am able to maintaint the  @trashemail_bot.\n This project is out of passion, so I dont have motive of earning anything, so  No Ads.(I am serious, I hate them too, like you)\n  TrashEmail is Java spring-boot microservice that anyone can build locally currently with few setting to tune in and then have the entire setup running locally.All you need to own is mail server(SMTP and IMAP), telegram bot token and  mvn locally to build it.Few requirements with the mailserver:\n  All you need to do is clone the source, build and run, and just tell telegram that you are listening here.\n git clone https://github.com/r0hi7/Trashemail.git cd Trashemail  # Update the application.yml file  # according to your mail servermvn clean install  # If successfulljava -jar target/trashemail target/teledot-0.0.1-SNAPSHOT.jar\n  # Email Server IMAP and SMTP configuration  # SMTP server should support Alias creation and deletion  # IMAP server should support IDLE emailServer:  host:  trashemail.in  admin:  email:  contact@trashemail.in  password:  changeme  api:  aliases:  add_url:  https://trashemail.in/admin/mail/aliases/add  remove_url:  https://trashemail.in/admin/mail/aliases/remove  imap:  host:  trashemail.in  port:  993  email:  contact@trashemail.in  password:  changeme  # Telegram bot specific settings telegram:  url:  https://api.telegram.org/bot  botToken:  telegram-bot-token  # For development purpose, H2 is used.  # I prefer H2 persistent in file. spring:  datasource:  url:  jdbc:h2:file:./AppDB;DB_CLOSE_ON_EXIT=FALSE;AUTO_RECONNECT=TRUE  driver-class-name:  org.h2.Driver  username:  sa  password:  password  jpa:  database-platform:  org.hibernate.dialect.H2Dialect  hibernate:  ddl-auto:  update  h2:  console:  path:  /h2-console  settings:  web-allow-others:  true  application:  name:  Trashemail  # Tomcat server settings server:  port:  9090  # Logger settings logging:  level:  io:  github:  trashemail:  debug\n Now will have to expose this service to internet, and there are options like :  ngrok,  dataplicity,  localtunnel etc.\n DB is taken care by  h2, in a file, (I think that is sufficient, It need very light DB table).\n  It fools the user, that it created an email Id rather it creates an alais to exiting ID. Why Alais, as IMAP needs to poll right, for incoming mails? This is how it is engineered.\n  As soon as mail is fetched, the target is identified and telegram message is sent.\n I have tried to engineer this service to be reliable, in case if you find any issues with the reliability(or with anything else), please feel free to drop in a PR. I would be happy to review and merge.", "posttime": "2020-05-31 00:06:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,telegram,trashemail", "title": "TrashEmail：用Java Spring boot编写的基于电报的一次性邮件服务", "title_en": "TrashEmail: Telegram based disposable mail service written in Java Spring boot", "transed": 1, "url": "https://github.com/r0hi7/Trashemail/blob/master/README.md", "via": "", "real_tags": ["java", "telegram"]}, {"category": "", "categoryclass": "", "imagename": "e241609e31a7926046ad060fd7d51077.jpg", "infoid": 1004409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我还记得当我还在学校的时候，第一次被介绍到“荒原”的确切词汇。“这不是你读的诗。这是一首你会永远记住的诗。“。此后几年的一切都证明了这些话是正确的。不仅是这项工作，而且还有T.S.艾略特的所有人-最重要的是四个四重奏。这对很多人来说似乎都是一样的。他是最常出现在脑海中的现代诗人。当我们希望在事物中找到意义时，我们就会去寻找它。当然，当我们考虑生命的目的或结束时，我们首先会称它为非圣经的地方。\n相比之下，他的同代人似乎都变小了。W·H·奥登(W.H.Auden)的声誉可能仍有四分之三。但在上个世纪主导英国诗歌的大多数其他人物在后视镜中显得黯然失色。更让人吃惊的是艾略特似乎长高了。思考为什么会这样，不仅仅是考虑我们的时代，也不是他的时代，而是关于时间的性质和文化的目的的东西。\n人们通常认为，伟大的艺术家在某种程度上反映或总结了他们的时代。的确，从“普鲁弗洛克”(1915年)开始，艾略特似乎在谈论现代生活的特殊的、支离破碎的本质。但艾略特的许多同时代人，包括温德姆·刘易斯和埃兹拉·庞德，也做到了这一点。艾略特继续被阅读而不被阅读肯定是有原因的。其一，在他的诗歌生涯中，艾略特不仅反映了他所处的时代，而且指明了一条走出时代的道路。确实是一条走出历史的出路。\n他不像其他诗人那样写作。这不仅仅是因为他写信的频率降低了。在别人倒出东西的地方，艾略特似乎把一切都压下来了，只有当它再也压不住的时候才会爆发。除了如此深厚的基础，“空心人”或“来自岩石的合唱团”从何而来？\n正是奥登在他1949年的“文化定义注释”中指出，艾略特不是一个人，而是一个至少有三个永久居民的家庭。第一个是执事，一本正经，很有学问。他被判与“一位暴力而热情的老农民祖母”住在一起，她目睹了各种各样的战争、强奸、饥荒和瘟疫。她“往深渊里看”，可以“把房子喊倒”。家里的第三个人是个喜欢恶作剧的小男孩，所以除了应付老妇人的尖叫之外，执事还得提防苹果派床或爆炸的雪茄。\n自从费伯的艾略特书信出版以来，我们可以看到奥登是多么接近这位老诗人的核心。在第一卷和第二卷之间间隔了20年之后，这些信件集在过去的十年里定期出现，所以我们现在已经达到了第八卷和1938年。这些信件很全面，包括艾略特所有最平凡的商务信件。《精选书信》一出，应该会找到不错的受众。但他们将不能像这些巨大而浮夸的书卷那样，展示关于他的更大的真相。因为这些信清楚地表明，艾略特一生都是站在地窖的地板门上度过的，因为他知道地窖里的力量随时可能爆发。他压低它的能力，试图在他知道正在增长的基本力量中幸存下来的能力有时令人恐惧。\n在1925年的一封可怕的信中，他描述了在过去的十年里，在他的第一次婚姻中，他是如何努力让自己成为一个人的。“我故意扼杀了自己的感官--我故意去死--为了继续生活的外在形式--这是我在1915年所做的。”在接下来的几卷书中，在数以千计的礼貌回报中，偶尔也会有类似的尖叫声从地下室爆发出来。有时还夹杂着男生的笑声，比如在日常商务活动中，他与邦纳米·多布雷(Bonamy Dobrée，“Buggamy”)进行的愚蠢、“幽默”的通信。但是，即使门闩发出轻微的嘎嘎声，也可能会令人毛骨悚然。在1926年写给康拉德·艾肯(Conrad Aiken)的一封信的脚注中，我们了解到，艾略特在回应艾肯(当时在医院)发出的一封赞扬他的诗歌的信时，发出了一页印刷页，从《助产士公报》上撕了下来，用墨水划出了某些词-“血，粘液，碎屑粘液，化脓性攻击性分泌物。”就是这样。没有签名，没有评论。\n信件越多，我们就越清楚地看到艾略特不仅仅是凝视深渊，还是在深渊上保持平衡。他对个人和文化崩溃的了解达到了极致，这意味着他不仅学会了如何粉碎一个人或文化，还学会了如何将它们重新组合在一起。对于所有对艾略特的传记批评-这可能是为什么，正如他在1930年给他兄弟的一封信中所说的那样，他想“尽可能少地留下传记”。\n首先，他不仅对他的时间说话，而且找到了一种回收时间的方法。“燃烧的诺顿”的开篇可能是他在这方面最著名的调解，但从他的一些早期诗歌中，就有了永远存在的对所有时间的呈现。“普鲁弗洛克和其他观察”(1917年)包括一首令人震惊的、充满情调的诗，名为“波士顿晚间记录”(The Boston Evening Transcript)。当被困在诗歌标题的扁平世界中时，这首九行诗中紧凑的三行是这样写的：\n我走上台阶，按响了门铃，疲倦地转过身来，就像一个人会转身向拉罗什福科点头道别，如果街道就是时间，而他在街道的尽头。\n为什么La Rochefoucauld会在那里？出于同样的原因，在“埋葬死者”中流过伦敦桥的人群中，可以找到斯特森-迈莱船上的同志-的身影。因为他是可以的。\n在艾略特早期，这似乎不仅仅是一种怪癖，或者仅仅是为了震撼读者。这似乎已经是可能的，尽管没有试图解释为什么会这样。读者可能会认为这仅仅是对万事万物崩溃的又一例证，以至于人物甚至在时间里徘徊，如此之多的东西已经分崩离析。只有当艾略特在四个四重奏中对时间的性质进行冥想时，他才完全发现并扩展了基督教形而上学，证明了他关于时间的潜在可恢复性的早期直觉是合理的：所有的时间都可能是永恒的，并且是可以救赎的。\n我在“艾略特”的读者中经常看到，这种时间观有一个实际的后果，以及由此产生的一个实际效用。第一次阅读的读者，特别是他早期作品的读者，经常被“荒原”中大量的参考文献所打击。有可能--就像卢西亚诺·贝里奥(Luciano Berio)的“小交响乐团”(Sinfonia)的第三乐章一样--这一切都可以被视为一种文化的巧妙浪费：一切都已经分崩离析后留下的东西。但艾略特并不只是呈现混乱，他让读者挖掘并希望知道更多。他邀请-实际上是展示-人们如何从废墟中取出东西。\n我能想到的最清楚的例子是，今天在说英语的人中，几乎可以肯定的是，如果他们对但丁·阿利戈里有所了解的话，那要归功于艾略特。他们最有可能知道的台词要么是伦敦桥上流动的人群中使用的那句(“我没想到死亡毁掉了这么多人”)，要么是瓦莱丽·艾略特(Valerie Eliot)在她1971年的评论版“荒原”(The Waste Land)的脚注中包括的那句。在那里，她暗示，在“国际象棋游戏”(A Game Of Chess)主人公的痛苦中(手稿中的主人公记得前一乐章中的“风信子花园”--可能有点太清楚了，因为后来它被切除了)，艾略特可能想到了弗朗西丝卡在“地狱”中对但丁说的话：“没有比在悲惨中回忆快乐时光更痛苦的了。”这句话的意思是，艾略特可能想到了弗朗西丝卡在地狱里对但丁说的话：“没有比在悲惨中回忆快乐时光更痛苦的了。”这不仅是一条通往但丁的路线，而且是一条回到但丁的路线。\n当其他艺术家展示了文化是如何被炫耀、散布或彻底摧毁的时候，艾略特展示了它是如何被回收的。他展示了残余物是如何在另一个时间或地点变成幼苗并再次发芽的。在反复证明他有伟大艺术家的创新能力的同时，他还表演了伟大艺术家的第二个功能，并展示了文化是如何传播的。他不仅展示了大火，还向他的读者展示了如何从大火中拯救事物。\n在考虑这一成就时，你必须不断提醒自己，他的作品的主体是多么的严酷。艾略特的“诗集”比拉金还要简短，总共有200页。对于这一点一直存在一些困惑，因为这一成就似乎太伟大了，不可能如此简短。据说，荒岛光盘上的一些客人要求拿走T·S·艾略特(T.S.Eliot)的作品，因为他们在岛上的书被拒绝了，因为这本书必须是单卷的。当然，完整的诗歌和戏剧(包括老负鼠的实用猫书)可以轻松地编入一卷-2015年，费伯决定出版两本有用但笨拙的巨型批评版诗歌，略微掩盖了这一事实。但是，这么短的诗意之旅，怎么会有这么大的影响呢？\n在我看来，最终的答案在于艾略特从最早的诗歌到四个四重奏的结束所完成的旅程的方向，当时的短语与圣约翰福音的开篇一样引起强烈共鸣。现在清楚的是，艾略特不仅凝视着深渊或站在深渊上的程度，而且他是如何设法穿越深渊的：穿过有可能激励他的咆哮大火，就像它对每个人一样。即使在皈依圣公会之后，艾略特的道路也并非畅通无阻。但当他完成“四个四重奏”时，无论你是从昨天开始读他，还是一辈子都在想他，他的成就都可以从正确的角度和清晰的角度来看待，事实证明这一点是显而易见的。在上个世纪的艺术家中，他仍然几乎是独一无二的，因为他不仅成功地走过了那个世纪，而且偶尔滑倒，非凡的镇定和极大的勇气，带着高高举起的愿景出现在火行道的另一边。\n本文取自2020年5/6月期的《观点》。要订阅印刷版和数字版，包括完整的数字档案馆，请单击此处。", "note_en": "I  remember the exact words with which I was first introduced to “The Waste Land” while still at school. “This isn’t a poem you read. It is a poem you will live with.” Everything in the years since has proved those words true. And not just with that work, but with all of T.S. Eliot—the  Four Quartets above all. It seems to be the same for many people. He is the modern poet whose lines come to mind most often. The one we reach for when we wish to find sense in things. And certainly the first non-scriptural place we call when we consider the purpose or end of life.\n His contemporaries, by contrast, all seem to have grown smaller. W.H. Auden has perhaps three-quarters of his reputation still. But most of the other figures who dominated English poetry in the last century look diminished in the rear-view mirror. Which makes it even more striking that Eliot seems to grow. To consider why that should be is to consider something not just about our time, or his, but something about the nature of time, and the purpose of culture.\n It is often thought that great artists in some way reflect or sum-up their age. And it is true that from “Prufrock” (1915) onwards Eliot seemed to speak to the particular, fractured nature of modern life. But many of Eliot’s contemporaries, including Wyndham Lewis and Ezra Pound, managed that too. There must be reasons why Eliot continues to be read and they are not. One is that through the course of his poetic career Eliot did not merely reflect his times, but showed a way out of them. Indeed a way out of all time.\n H e didn’t write like other poets. And it wasn’t just that he wrote less frequently. Where others poured the stuff out, Eliot seemed to keep everything down, erupting only when it could not be suppressed any longer. Where did “The Hollow Men” or “Choruses from the Rock” come from but that deep fundament?\n It was Auden, in his 1949 review of  Notes Towards the Definition of Culture, who observed that Eliot was not a single figure but a household in which there were at least three permanent residents. The first was an archdeacon, prim and intellectual. He was condemned to share the abode with “a violent and passionate old peasant grandmother” who had witnessed every variety of war, rape, famine and pestilence. She had “looked into the abyss” and could “scream the house down”. The third person in the household was a young boy who enjoyed practical jokes, so that as well as coping with the old woman’s screams, the archdeacon also had to watch out for an apple-pie bed or exploding cigar.\n Since the publication of Eliot’s letters by Faber, we can see how close Auden came to getting to the core of the older poet. After a 20-year hiatus between the first and second volumes, these collections of letters have been emerging regularly over the last decade, so that we are now up to volume eight and the year 1938. They are comprehensive, including all the most mundane of Eliot’s business correspondence. When it comes out, the “selected letters” should find a good audience. But they will not be able to show, as these huge, turgid volumes do, the greater truth about him. For what the letters make clear is the extent to which Eliot spent his life standing on the trapdoor of the cellar, knowing that the forces inside could blow out at any moment. His ability to keep it down, to try just to survive the elemental forces he knew were growing is at times terrifying.\n There is a terrible letter from 1925 in which he describes how he has tried to hold himself together as a person over the previous ten years, during his first marriage. “I have deliberately killed my senses—I have deliberately died—in order to go on with the outward form of living—This I did in 1915.” Throughout the succeeding volumes, in the midst of the thousands of polite reciprocals there are very occasional moments when similar screaming breaks out from the basement. Sometimes it is mixed in with the laughter of the schoolboy, such as in the silly, “humorous” correspondence he conducts with Bonamy Dobrée (“Buggamy”) amid everyday business matters. But when the latch rattles even slightly it can be horrifying. In a footnote to a 1926 letter to Conrad Aiken, we learn that in response to one letter praising his poems sent by Aiken (then in hospital), Eliot responded by sending a printed page ripped out of  The Midwives’ Gazette with certain words underlined in ink—“Blood, mucous, shreds of mucous, purulent offensive discharge.” Just that. No signature, no comment.\n T he more letters emerge, the clearer we see how Eliot did more than stare into, or balance over the abyss. The extremity of his knowledge of personal and cultural breakdown meant that he learned not just how a person or culture can be shattered, but how also they might be put back together. For all the biographical criticisms that can be made of Eliot—which may be one reason why, as he said in a letter to his brother in 1930, he wanted “to leave as little biography as possible”—there is a conspicuous bravery in the process by which he achieved at least three things that none of his contemporaries did.\n The first is that he didn’t just speak to his time, but found a way to reclaim time. The opening of “Burnt Norton” might be his most famous mediation on this, but the presentation of all time as eternally present was there from some of his earliest poems.  Prufrock and Other Observations (1917) includes a startling, bathetic poem titled “The Boston Evening Transcript”. While stuck in the flat-lining world of the poem’s title, three of the nine-line poem’s tightly-packed lines read:\n I mount the steps and ring the bell, turning  Wearily, as one would turn to nod good-bye to La Rochefoucauld,  If the street were time and he at the end of the street.\n Why is La Rochefoucauld there? For the same reason that Stetson—the comrade from the ships at Mylae—can be found among the crowds flowing over London Bridge in “The Burial of the Dead”. Because he can be.\n In early Eliot this already seems to be more than a quirk, or mere attempt to jolt the reader. Already it seems something that is possible, though with no attempt to explain how that might be so. A reader might take this as simply one more demonstration of the breakdown of everything, so that characters even wander in and out of time, so much have things fallen apart. It is only once Eliot meditates on the nature of time in  Four Quartets that he fully finds, and expands, a Christian metaphysics that justifies this early intuition of his about the potential recoverability of time: that all time might be eternally present, and redeemable.\n There is a practical consequence of this view of time, and a practical utility which follows on from it that I have often seen in readers of Eliot. First-time readers, especially of his early work, often feel battered by the number of references packed into “The Waste Land” in particular. It is possible that—like the third movement of Luciano Berio’s  Sinfonia—this could all be seen as a skilful waste-tip of a culture: what has been left over after everything has come apart. But Eliot does not just present the jumble, he causes the reader to dig and wish to know more. He invites—in fact shows—people how to take things from the ruins.\n The clearest example I can think of is the fact that today among English-speakers it is almost certain that if they have any awareness at all of Dante Alighieri it is thanks to Eliot. The lines they are most likely to know are either the one used of the crowds flowing over London Bridge (“I had not thought death had undone so many”), or the one Valerie Eliot included in her footnote to her 1971 critical edition of “The Waste Land”. There she suggests that in the misery of the protagonist of “A Game of Chess” (who in the manuscript remembers “the hyacinth garden” from the previous movement—perhaps a little too clearly, for it was later excised) Eliot may have had in mind what Francesca says to Dante in the  Inferno: “There is no greater pain than to recall a happy time in wretchedness.” It is a route not just into Dante, but back to Dante.\n W hile other artists showed how culture could be either shown off, strewn about or destroyed utterly, Eliot demonstrated how it could be reclaimed. He showed how the remnants could become seedlings and sprout again, in another time or place. While repeatedly proving that he had a great artist’s ability to innovate, he also performed that second function of the great artist and demonstrated how culture can be transmitted. He didn’t just show the fire; he showed his readers how things could be saved from it.\n In considering this achievement you have to keep reminding yourself how stark the main body of his work is. Briefer even than Larkin, Eliot’s  Collected Poems can be found on 200 pages, all told. There has always been some confusion about this, because the achievement seems too great for such brevity. It is said that some guests on  Desert Island Discs had their request to take the works of T.S. Eliot as their island book turned down because the book had to be a single volume. Of course the complete poems and plays altogether (including  Old Possum’s Book of Practical Cats) fit comfortably into a single volume—a fact that Faber obscured slightly in 2015 by deciding to publish two useful but unwieldy huge critical editions of the poems. But how could such a comparatively short poetic journey have ended up having such an impact?\n It seems to me that the final answer lies in the direction of the journey Eliot accomplished from the earliest poems to the conclusion of the  Four Quartets, by then, with phrases that resonate as forcefully as the opening of St. John’s gospel. What is clear now is the extent to which Eliot not only stared into the abyss or stood over it, but how he managed to cross through it: through the howling fire that threatened to galvanise him, as it does everyone. Even after the conversion to the Anglican church it is not as though Eliot’s path was carefree or smooth. But by the time he finished the  Four Quartets his achievement can be seen in its proper perspective and with a clarity that turns out to be evident, whether you started reading him yesterday or have been thinking about him all your life. He remains nearly unique among artists in the last century for having managed not just to walk through that century but, with occasional slips, extraordinary poise and a great deal of bravery, emerged at the other side of the fire-walk with a vision held aloft.\n   This article is taken from the May/June 2020 issue of Standpoint.    To subscribe to the print and digital editions, including a full digital archive, click here .", "posttime": "2020-05-30 23:50:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艾略特,eliot", "title": "为什么T.S.艾略特仍然重要", "title_en": "Why T.S. Eliot still matters", "transed": 1, "url": "https://standpointmag.co.uk/issues/may-june-2020/why-t-s-eliot-still-matters/", "via": "", "real_tags": ["艾略特", "eliot"]}, {"category": "", "categoryclass": "", "imagename": "e4ee9bd9c030f69af15664dd53b02e78.jpg", "infoid": 1004407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AMD在游戏笔记本电脑领域处于令人羡慕的地位。可以说，红色团队不仅在其Ryzen 4000系列中生产了一些速度最快的主流移动CPU，而且在同一阵营中还拥有令人敬畏的图形马力。因此，如果制造商选择使用这些组件，AMD可以通过其CPU、GPU和配套芯片组控制PC中的整个平台、硬件和驱动程序堆栈。第一款采用全AMD的游戏笔记本电脑来自戴尔。G515SE今天发布，其功能集、性能目标和价位为游戏者提供了一个非常有吸引力的解决方案。由于其单一供应商硬件配置，G5 15 SE是AMD&#39；SmartShift电源管理技术的第一个主机平台。SmartShift会自动在笔记本电脑的CPU和GPU之间分配功率预算，以实现特定任务的最佳性能，我们稍后一定会深入研究这一点。第一台搭载AMD Ryzen 4000 CPU的游戏笔记本电脑是华硕Zephyrus G14。当然，我们很喜欢这款笔记本电脑，它将AMD在移动市场上推向了更强大的地位。这款机器非常轻薄，重量只有3磅左右，但标价接近1500美元。相比之下，G515SE的外形尺寸更大，价格更实惠。没有更多的麻烦，下面是我们的视频回顾，然后我们将深入检查系统的规格。AMD Ryzen 4800H(8核、16线程、2.9 GHz基础、4.2 GHz最大升压、8 MB三级高速缓存)。\n1x USB 3.2 Gen 1超高速端口1x迷你DisplayPort 1x HDMI 2.0 1x交流适配器桶接头1x USB C型DisplayPort备用模式端口(仅限视频，无USB设备)。\nG5 15 SE的彩虹般的外观为原本低调的设计增添了些许活力。\n显然，作为AMD的展示，CPU选项包括Ryzen 5、Ryzen 7和Ryzen 9移动CPU。我们的回顾单元附带了中间的子Ryzen 74800H，它与速度更快的Ryzen 9 4900H具有相同的8个内核、16个线程和8MB的L3缓存。不同之处在于，4800H将仅200 MHz的最大升压时钟让给了其速度更快的兄弟机型。基本时钟速度是2.9 GHz，最大turbo达到4.2 GHz，还是相当快的，而且G5 15 SE内部的Ryzen处理器有8 GB或者16 GB的RAM作为后盾，我们的测试配置有更大的容量。这是双通道模式下的普通老式DDR4-3200 SO-DIMM。戴尔表示，G5可以单独升级到32 GB内存。因为内存是用户可更换的，所以可以从戴尔获得最低限度的内存，并在以后进行升级，尽管购买16 GB内存是一个非常可靠的开始，无需进行任何调整。一对M.2插槽在G5 15 SE中提供存储选项。我们的测试单元配备了一个512 GB的M.2驱动器，第二个插槽可用，正在等待另一个驱动器。在任何游戏笔记本电脑中，明星都是图形处理器。在这个全AMD系统中，恰好是RADEON RX 5600M。这款GPU拥有跨越36个计算单元的2,304个流处理器，以及用于6 GB GDDR6内存的192位总线。这实际上是与更大的RX5700M相同的CU数量，但只有可用VRAM和带宽的75%。与台式机RX 5600 XT相比，这是与台式机对应的相同数量的CU和VRAM。当游戏在1080p时应该是相当强大的。有两种无线联网选项可供选择，但我们的设备配备了增强型杀手无线1650x。天线配置为2x2 MIMO设置，可处理Killer网卡的802.11ax Wi-Fi和蓝牙5.1功能。机身侧面还有一个可折叠的千兆位以太网端口，由Realtek以太网控制器供电。在经济型游戏笔记本电脑中，电池续航时间往往是事后才考虑的问题，但戴尔G5 15 SE在默认情况下仍包含一个标准的51瓦时三芯电池。如果这还不够，可以在购买时更换一个可选的68瓦时电池来额外充电。我们的审查单元电池更大，所以我们在讨论电池续航时间时会牢记这一点。G5 15 SE采用超新星银色表面处理，表面下有彩虹般的材料斑点。因此，G5在合适的照明条件下会闪闪发光，彩虹般的光泽会根据视角的不同而变化。这种外观在设备顶部的戴尔徽标中最为明显，但整个盖子上都有。整个身体是由聚碳酸酯制成的，但只有盖子有华丽的处理。显示屏的铰链两侧是一对大的输出通风口，当G5 15 SE在游戏时，我们肯定能感受到从后面散发出来的温暖。G5 15 SE是一个相当笨重的单元，重5.5磅，充电器又增加了2.2磅的旅行重量。", "note_en": "AMD is in an enviable position in the gaming laptop world. Not only does the red team arguably produce some of the fastest mainstream mobile CPUs around in its  Ryzen 4000  series, there&#39;s also formidable graphics horsepower in the same camp. As a result, AMD can control the whole platform, hardware and driver stack in a PC with its CPU, GPU, and accompanying chipset, if a manufacturer chooses to use those components.   The first of these gaming laptops to hit the lab with an all-AMD bent  comes from Dell. The G5 15 SE launches today with a feature set, performance target, and price point that makes for a very attractive solution for gamers on the go. Because of its single-vendor hardware configuration, the G5 15 SE is the first host platform for AMD&#39;s  SmartShift power management technology. SmartShift automatically splits the power budget between the CPU and GPU in a notebook, for the best performance for a given task, and we&#39;ll definitely dig into that later.  The first gaming laptop with an  AMD Ryzen 4000 CPU was the  ASUS Zephyrus G14. We enjoyed that laptop, for sure, and it propelled AMD into a much stronger position in the mobile market. That machine fit into a pretty thin and light 14&#34; form factor that only weighed around three pounds, but carries a premium price tag approaching $1,500. The G5 15 SE, by contrast, comes in a larger 15.6&#34; form factor and offers more affordable pricing. Without further ado, our video review is below, and then we&#39;ll check out the system specs in deep dive detail...      AMD Ryzen 4800H (8 cores, 16 threads, 2.9 GHz base, 4.2 GHz max boost, 8 MB L3 cache)\n        1x USB 3.2 Gen 1 Super Speed port 1x Mini DisplayPort 1x HDMI 2.0 1x AC Adapter barrel connector 1x USB Type-C DisplayPort Alternate Mode port (video only, no USB devices)\n  The iridescent finish of the G5 15 SE adds a little pizzazz to an otherwise-understated design\n Obviously, as an AMD showcase, CPU options include Ryzen 5, Ryzen 7, and Ryzen 9 mobile CPUs. Our review unit came with the middle child  Ryzen 7 4800H, which has the same eight cores, 16 threads, and 8 MB of L3 cache as the faster Ryzen 9 4900H. The difference is that the 4800H gives up a mere 200 MHz of maximum boost clock to its faster sibling. The base clock speed is 2.9 GHz and maximum turbo hits 4.2 GHz, which is still pretty dang fast.   The Ryzen processor inside the G5 15 SE is backed by 8 GB or 16 GB of RAM, and our test configuration has the larger amount. This is plain old  DDR4-3200 SO-DIMMs in dual-channel mode. Dell says the G5 can be upgraded to 32 GB of memory separately. Because the RAM is user-replaceable, it&#39;s possible to get the bare minimum from Dell and upgrade it later, though buying 16 GB is a pretty solid start without any tinkering. A pair of M.2 slots provide storage options in the G5 15 SE. Our test unit came with a single 512 GB M.2 drive with the second slot available and waiting for another drive.   In any gaming notebook, the star is the graphics processor. In this all-AMD system, that happens to be the Radeon RX 5600M. This GPU has 2,304 stream processors across 36 compute units and a 192-bit bus for 6 GB of GDDR6 memory. That&#39;s actually the same number of CUs as the bigger RX 5700M, but only 75% of the available VRAM and bandwidth. Compared to the desktop  RX 5600 XT, that&#39;s the same number of CUs and amount of VRAM as the desktop counterpart. It should be pretty potent when gaming at 1080p.    A pair of wireless networking options are available, but our unit came with the enhanced Killer Wireless 1650x. The antenna configuration is a 2x2 MIMO setup, which handles the 802.11ax Wi-Fi and Bluetooth 5.1 capabilities of the  Killer networking card. There&#39;s also a fold-down Gigabit Ethernet port on the side of the unit powered by a Realtek Ethernet controller.   Battery life is more often than not an afterthought in budget gaming notebooks, but  Dell still includes a standard 51 Watt-hour three-cell battery by default in the G5 15 SE. If that&#39;s not enough, an optional 68 Watt-hour battery can be substituted at the time of purchase for an additional charge. Our review unit has the bigger battery, so we&#39;ll keep that in mind when talking about battery life.   The G5 15 SE comes in a Supernova Silver finish, which has flecks of iridescent material just under the surface. As a result, the G5 sparkles a bit under the right lighting conditions, and the iridescent finish&#39;s color changes depending on the viewing angle. That look is most apparent in the Dell logo on top of the unit, but the whole lid has it. The entire body is made of polycarbonate, but only the lid has the flashy treatment. The display hinge is flanked by a pair of large output vents, and when the  G5 15 SE is gaming, we could definitely feel the warmth radiating from the back. The G5 15 SE a fairly hefty unit, weighing in at 5.5 pounds, and the charger adds another 2.2 pounds to the travel weight.     The rest of the G5 is silver with a black palm rest. Inside that palm rest we find a keyboard complete with a ten-key number pad on the right. The keyboard has a four-zone RGB backlight that work with  Alienware Command Center. There&#39;s an adequate amount of travel, and typing is comfortable, and gamers will probably appreciate that the WASD block has an outline, but they don&#39;t feel any different from the other keys. Below the keyboard is a modestly-sized touch pad with integrated buttons. The touch pad is fine for navigating in Windows, but we would definitely choose an external mouse for gaming.   Above the keyboard is the 15.6&#34; 1920x1080 display panel. This is a high refresh rate unit that maxes out at 144 Hz. Having such a high refresh display in a laptop this inexpensive is pretty rare, even if it&#39;s an optional upgrade like it is here (which is already factored into the price), so kudos to Dell for hitting a price point while simultaneously providing a nice gaming display.    The maximum brightness rating is a relatively tame 300 nits, but we found it to be sufficient for indoor use. The top bezel of the display holds a 720p HD web cam that&#39;s plenty for the typical Skype,  Zoom, or Google Meet session. There&#39;s also a multi-microphone noise canceling array for input and stereo speakers with Nahimic 3D audio. The speakers put out plenty of sound heavy in mid-range and highs, but lacking in bass, which is typical of the small drivers found in a notebook. There&#39;s a four-pole headset jack for folks who value audio quality, so the speaker situation is fine.    A wide variety of ports flank both sides of the G5. On the left, we can find all sorts of ports. There&#39;s one each of Super Speed USB 3.2 Gen 1 port,  HDMI 2.0, mini DisplayPort, Ethernet, charger input, and a  USB Type-C connector. That USB Type-C connection only carries DisplayPort Alternate Mode video signals, not data. We do like the inclusion of a Type-A port, since so many brand new peripherals even today only come with the older form factor. Wired Ethernet is a good choice for online gaming, too.   The USB-C port also threw us for a loop since my portable hard drive with our test installers has a USB-C cable and didn&#39;t power up. A quick review of the spec sheet and a cable swap later and all was good. This is really unfortunate since there are so many USB 3 docks that use USB Type-C ports. Obviously this wouldn&#39;t work for power delivery on a thirsty  gaming laptop since that only supports up to 100W. Still, adding a bunch of ports, including full-size DisplayPort, USB 3.0 Type-A, and extra audio options, would have been quite nice.     Around the right side we find a pair of USB 3.0 ports, a full-sized SD reader, and the headset jack. The full-sized SD card reader is handy, since micro SD cards usually come with a full-sized adapter, where the larger cards won&#39;t magically shrink to fit a micro SD reader.   AMD  announced SmartShift along with the Ryzen 4000 family at CES in January. SmartShift dynamically splits up the thermal and power budget to give more oomph to the component that needs it, depending on a given task. Normally, the CPU and GPU consume electricity from separate power budgets. SmartShift can pool those separate resources into a single power budget for both components.   In the case of the G5 15 SE, this is important for gaming. More often than not, performance bottlenecks are caused by the graphics processor pumping out frames as fast as it can. In that situation, the  CPU doesn&#39;t have to work as hard to present frames to the GPU and therefore isn&#39;t consuming its entire budget. SmartShift gives those extra watts to the GPU so that it can work harder and generate more heat to be dissipated by the PC&#39;s cooling system.     This can also work in reverse if the  GPU is idle while the CPU pumps away at a big encoding job or other heavy task. Some of the GPU&#39;s power budget can be given to the CPU to keep boost clocks high and get the job done more quickly. Because the drivers and firmware for both pieces of this puzzle know what the other is doing, that enables the system to use more power just on one side or the other (never to exceed the total power budget) to provide better performance.   The great thing is that this is all automatic, but it requires an all-AMD setup. AMD&#39;s hardware components can talk to each other over the Infinity Fabric controllers found in  Navi GPUs and Ryzen 4000 CPUs. That means it wasn&#39;t available to the ASUS Zephyrus G14, because that has an NVIDIA  GeForce RTX 2060 Max-Q along with its Ryzen 9 4900HS. That&#39;s not necessarily bad, of course; performance on the G14 was great. However, using a Radeon GPU with a Ryzen processor gives a full-AMD implementation the advantage of maximizing performance when possible.   Dell took the &#34;shift&#34; idea a step farther with Game Shift. The F7 key on the keyboard also functions as a Game Shift toggle when pressed with the Fn key. Dell&#39;s Game Shift cranks up the fans to their maximum settings without leaving a game. This enables what Dell calls a &#34;dynamic performance&#34; mode that will let the CPU and GPU work harder, and should have a measurable impact on frame rates. We&#39;ll be testing this out for sure.   The software experience on the G5 is pretty standard for Windows 10. However, Dell includes a handful of apps that should come in handy, and that starts with system utilities. Alienware Command Center is present on the G5 15 SE to provide control over power, thermal, and cooling control. Command Center can control Game Shift with the click of a button. The  RGB LED-backlit keyboard configuration and other thermal and cooling controls are here, too.     Alienware Command Center&#39;s Game Shift settings has a pair of configurations: Rapid Cool and High Performance. Selecting High Performance here merely applies the High Performance power profile by pressing the Game Shift hotkey. On the other hand, Rapid Cool cranks the fans up to 100% and tweaks the CPU speed further. This is the mode we tested since it seemed to have the most dramatic impact. Folks who have a real need for speed can play with the OC tools, too.   Beyond just system control, Dell included several other apps on the G5 15 SE.  Dell Mobile Connect interfaces with iOS and Android phones for text messaging, notifications, phone calls, and screen mirroring. It&#39;s a really handy app that we&#39;ve covered in-depth previously in the  2020 XPS 13 review, and everything from that applies. The G5 15 SE also includes its Support Assist software as a direct line to Dell support and a one-year subscription to Dropbox with 20 GB of space.   We know how the G5 15 SE looks and feels, so let&#39;s find out how it performs next.", "posttime": "2020-05-30 23:35:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电脑,游戏,重磅,amd", "title": "戴尔的全AMD游戏笔记本电脑被誉为“预算重磅炸弹”", "title_en": "Dell's All-AMD Gaming Laptop Hailed as a 'Budget Blockbuster'", "transed": 1, "url": "https://hothardware.com/reviews/dell-g5-15-se-review", "via": "", "real_tags": ["电脑", "游戏", "重磅", "amd"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我知道，这份清单不是为了这个，但我就是忍不住。请原谅我。\n作为一名Oracle DBA已经有20年了(当时从Oracle 8.0.5开始)，并且从10.3版开始才开始使用PostgreSQL，我觉得有必要与他们分享我的一些经验。\n除Oracle Data Guard和Patroni with etcd之外，所有安装都在同一台主机上执行，这两种安装都需要至少三个节点(或分别为奇数个&gt；2)才能建立民主，以确定主/主数据库和副本/备用数据库。但是，所有计算机都具有相同的硬件和操作系统：\n操作系统：openSUSE Leap 15.1(服务器设置，非台式机)CPU：英特尔i7-7700T CPU RAM：32 GB磁盘硬件：固态硬盘。\n此外，Oracle还需要安装161个额外的软件包，其中许多是32位软件包，用于假定仅限64位的软件！这会导致需要150MB的额外磁盘空间，并让32位软件包使系统不堪重负！\nPostgreSQL只需要安装几个软件包，具体取决于您选择用来编译源代码的选项。无论如何，这些软件包都不需要32位版本！\n软件：$du-sh/data/postgres/12.3/data/oracle/product/19.6 62M/data/postgres/12.3 8.5G/data/oracle/product/19.6数据库：$du-sh/data/oradb/*3.3G/data/oradb/cdb01#Oracle Container w/1 PDB 1.8G/data/oradb/sdb01#Oracle独立数据库$du-sh/data/pgdb/sdb01 6。\n所有数据库都是干净的设置，没有模式、用户、表、数据等，只是一个空库。\n安装：ORACLE 19c：~2h解压缩到ORACLE_HOME运行时安装程序解压缩最新的OPatch p6880880_200000_linux-x86-64应用p307938_190000_linux-x86-64(19.6.1)PostgreSQL12.3从源编译：~3m30s bunzip postgresql-12.3.tar.bz2 to PGHOME make install-world。\nCREATE DATABASE：ORACLE：创建独立数据库：~30M CREATE CONTAINER DATABASE(CDB$ROOT)：~47M CREATE PARGABLE DATABASE(PDB)：~26S内存以相当好地运行数据库：独立数据库至少1 GB SGA对于容器数据库PostgreSQL：initdb：&lt；1s CREATE DATABASE：&lt；200ms内存：128 MB db_Buffers。\n启动/停止数据库：Oracle：启动(标准，1 GB SGA)：约15s立即关闭(标准，1 GB SGA)：~21s启动(容器，4 GB SGA)：~16s立即关闭(容器，4 GB SGA)：~23s PostgreSQL：pg_ctl start：0.1s pg_ctl stop：0.2s其他发现/体验：Oracle：设置Data Guard(2个节点)与观察者(3.节点)：~4h应用PSU。迁移主要版本通常需要60M-90M的停机时间。迁移新的主要版本需要提前做大量工作。交换Data Guard需要大约1M的时间。PostgreSQL：使用etcd(3个节点)设置Patroni(2个节点)：~30M应用新的次要版本需要停机&lt；2s。迁移新的主要版本需要停机&lt；20秒。迁移新的主要版本需要提前几分钟的工作。转换守护神需要~1秒。\n甲骨文有一些很好的概念。我喜欢单独的撤销和临时表空间的概念，而不必关心清理。此外，我喜欢全局容器/集群范围视图(如CDB_TABLES等)的想法，这是我对PostgreSQL绝对且严重怀念的一件事。\n我特别讨厌Oracle(当然，尽管有许可证费用)，因为它有如此多的错误，甚至更多的错误，其中一个整天都在搜索补丁，产生了大量的停机时间。应用PSU或RU通常是不够的。\n所以归根结底，在我看来，PostgreSQL远远超过了Oracle，至少在安装和大小方面是这样。\n那么，猜猜在与甲骨文合作了20年之后，我认为甲骨文出了什么问题……", "note_en": "I know, this list is not for this, but I just couldn&#39;t resist. Please forgive me.\n Being an Oracle DBA for two decades now (back then starting with Oracle 8.0.5) and only doing PostgreSQL since version 10.3, I feel compelled to share some of my experiences with both.\n  All installations were performed on the same host except for Oracle Data Guard and Patroni with etcd, which both require at least three nodes, or an odd number &gt;2 respectively) to establish a democracy to determine the master/primary and replica/standby databases. However, all machines have the same hardware and operating system:\n OS: openSUSE Leap 15.1 (server setup, not desktop)  CPU: Intel i7-7700T CPU  RAM: 32 GB  Disk Hardware: SSD\n Also, Oracle requires 161 additional packages to be installed, many of which are 32-bit packages, for a supposedly 64-bit only software! This results in 150 MB additional disk space needed and swamps the system with 32-bit packages!\n PostgreSQL only requires a few packages to be installed depending on the options one chooses to compile the source with. Anyway, none of these packages require a 32-bit version!\n  Software:  $ du -sh /data/postgres/12.3 /data/oracle/product/19.6  62M /data/postgres/12.3  8.5G /data/oracle/product/19.6  Databases:  $ du -sh /data/oradb/*  3.3G\t/data/oradb/cdb01 # Oracle Container w/ 1 PDB  1.8G\t/data/oradb/sdb01 # Oracle stand alone database  $ du -sh /data/pgdb/sdb01  659M\t/data/pgdb/sdb01 # PostgreSQL 12.3 database cluster\n All databases are a clean setup, no schemas, users, tables, data, etc. Just an empty base.\n Installation:  Oracle 19c: ~2h  unzip to ORACLE_HOME  runInstaller  unzip newest OPatch p6880880_200000_Linux-x86-64  apply p30797938_190000_Linux-x86-64 (19.6.1)  PostgreSQL 12.3 compiled from source: ~3m30s  bunzip postgresql-12.3.tar.bz2 to PGHOME  make install-world\n Create database:  Oracle:  create stand alone database: ~30m  create container database (cdb$root): ~47m  create pluggable database (pdb): ~26s  Memory to run a database reasonably well:  at least 1 GB SGA for a stand alone database  at least 4 GB SGA for a container database  PostgreSQL:  initdb: &lt;1s  create database: &lt;200ms  Memory: 128 MB db_buffers\n Start/stop database:  Oracle:   startup (standard, 1 GB SGA): ~15s  shutdown immediate (standard, 1 GB SGA): ~21s  startup (container, 4 GB SGA): ~16s  shutdown immediate (container, 4 GB SGA): ~23s  PostgreSQL:  pg_ctl start: 0.1s   pg_ctl stop: 0.2s   Other discoveries/experiences:  Oracle:  Set up Data Guard (2 nodes) with observer (3. node): ~4h  Applying a PSU or RU often requires downtime of 60m-90m.  Migrating a major version often requires downtime of 60m-90m.  Migrating a new major version requires a lot of work in advance.  Switching Data Guard takes ~1m.  PostgreSQL:  Set up Patroni (2 nodes) with etcd (3 nodes): ~30m  Applying a new minor version requires downtime of &lt;2s.  Migrating a new major version requires downtime of &lt;20s.  Migrating a new major version requires a few minutes work in advance.  Switching Patroni takes ~1s.\n Oracle has some good concepts. I like the conecpt of separate UNDO and TEMP tablespaces and not having to care about vacuuming. Also, I like the idea of global container/cluster-wide views such as CDB_TABLES, etc., a thing which I definitely and seriously miss about PostgreSQL.\n What I especially hate about Oracle (despite the license costs, of course) is that it has so many bugs, bugs and even more bugs and one keeps on searching for patches all day, generating lot of downtime. Applying a PSU or RU is mostly not enough.\n So bottom line, PostgreSQL beats Oracle by far in my opinion, at least as far as installing it and sizes are concerned.\n So, guess what I think is wrong with Oracle after 20 years of working with it...", "posttime": "2020-05-30 23:17:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,oracle", "title": "Oracle与PostgreSQL-评论", "title_en": "Oracle vs. PostgreSQL – A Comment", "transed": 1, "url": "https://www.postgresql.org/message-id/flat/0959C81A-5B07-4D04-A6B1-57AA78A9A553%40gmail.com", "via": "", "real_tags": ["oracle"]}, {"category": "", "categoryclass": "", "imagename": "b5cffceb6084918e896b388d03760a20.jpg", "infoid": 1004404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于冠状病毒的爆发，购物习惯发生了变化，公司正在迅速做出反应。百事可乐PEP正在削减杂货店，通过本月推出的两个新网站直接向消费者销售。\n消费者可以在百事公司的PantryShop.com和Snacks.com上购买食品和饮料。PantryShop.com提供不同类别的工具包，如零食、补水、家庭最爱和蛋白质。每个套装都有百事公司的各种产品，价格从29.99美元到49.95美元不等。Snacks.com有100多种不同的产品，不需要捆绑购买。\n菲多利北美公司首席转型和战略官迈克尔·林赛表示：在这段时间里，我们看到人们对我们零食的需求非常强劲，Snacks.com为消费者提供了另一种购买他们喜欢的产品的方式，并直接送货上门。\n在冠状病毒爆发期间，消费者一直在囤积零食和其他保质期较长的不易腐烂的物品。他们也一直在转向舒适的食物，因为限制迫使更多的人在家里做饭和吃饭。\n百事可乐(PepsiCo)高级副总裁兼电子商务主管吉布·托马斯(Gibu Thomas)表示，在这个不确定的时期，随着越来越多的消费者使用电子商务渠道购买食品和饮料，PantryShop.com和Snacks.com为购物者提供了另一种选择，让他们可以轻松快速地获得他们喜欢的产品。\n百事可乐(PepsiCo)新的直接面向消费者的网站消除了消费者从杂货店购买零食的需要，同时延续了越来越多品牌转向网购替代品的趋势。谨慎的购物者正在推动这一趋势，因为越来越多的人更喜欢让人送货，而不是冒险去商店。\nPantryShop.com和Snacks.com是利用百事公司的技术、洞察力、资源和库存相结合，在不到30天的时间内从概念发展到执行的，以快速满足消费者不断变化的需求。百事公司在一份新闻稿中表示，除了为自己购物外，消费者还可以通过这两个平台将产品作为礼物发货给朋友和家人，PantryShop.com和Snacks.com上的大部分订单将在两个工作日内送达。\n百事公司表示，它计划在未来扩大网站上可用的产品线。在疫情结束很长一段时间后，消费者可能会继续偏爱电商选择。", "note_en": "Shopping habits have changed because of the coronavirus outbreak, and companies are responding quickly. PepsiCo    PEP  is cutting out the grocery stores and selling directly to consumers through two new websites it launched this month.\n  Consumers can shop on PepsiCo&#39;s PantryShop.com and Snacks.com for food and beverages. PantryShop.com offers kits in different categories, such as snacking, hydration, family favorites and protein. Each kit has a variety of PepsiCo products and ranges in price from $29.99 to $49.95. Snacks.com has more than 100 different products that do not have to be purchased in a bundle.\n  &#34;We&#39;ve seen incredibly strong demand for our snacks during this time, and Snacks.com offers consumers another way to purchase the products they love, delivered right to their door,&#34;  Michael Lindsey, chief transformation and strategy officer for Frito-Lay North America, said.\n     During the coronavirus outbreak, consumers have been stocking up on snacks and other nonperishable items with a longer shelf life. They have also been turning to  comfort foods as restrictions force more people to cook and eat at home.\n      &#34;In these uncertain times, as more and more consumers are using e-commerce channels to purchase food and beverage products, PantryShop.com and Snacks.com offer shoppers another alternative for easy and fast access to products they love,&#34;  Gibu Thomas, senior vice president and head of e-commerce at PepsiCo, said.\n  PepsiCo&#39;s new direct-to-consumer websites eliminate the need for consumers to obtain their snacks from a grocery store while continuing the trend of more brands turning to online shopping alternatives. Wary shoppers are driving the trend as more people prefer to have their groceries delivered instead of risking a trip to the store.\n  &#34;PantryShop.com and Snacks.com were developed from concept to execution in less than 30 days by leveraging a combination of PepsiCo&#39;s technology, insights, resources and inventory to quickly meet consumers&#39; evolving needs. In addition to buying for themselves, consumers can ship products as gifts to friends and family via both platforms and the majority of orders on PantryShop.com and Snacks.com will arrive within two business days,&#34; PepsiCo said in a  press release.\n  PepsiCo indicates it plans to expand its line of available products on the websites in the future. Consumers may continue to prefer e-commerce options long after the outbreak is over.", "posttime": "2020-05-30 23:02:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "削减,cuts,消费者", "title": "百事公司削减杂货店，直接向消费者销售", "title_en": "PepsiCo cuts out grocery stores and sells directly to consumers", "transed": 1, "url": "https://www.forbes.com/sites/lanabandoim/2020/05/16/pepsico-cuts-out-grocery-stores-and-sells-directly-to-consumers-through-new-websites/", "via": "", "real_tags": ["削减", "cuts", "消费者"]}, {"category": "", "categoryclass": "", "imagename": "915459bd5e1b42b6825327be59164a5d.jpeg", "infoid": 1004403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最后，一些好的环境消息：座头鲸的数量正在从几近灭绝的状态中恢复，预计本繁殖季节澳大利亚东海岸将有4万头座头鲸，同时帮助世界抗击气候变化。\n在正常的一年里，5月份标志着观鲸季节的开始，船只和船只争先恐后地寻找最好的观赏位置，因为它们从南极洲迁徙到大堡礁产下鲸鱼。\n南十字星大学海洋生态研究中心的沃利·富兰克林博士说，东澳座头鲸现在正以每年10%的速度增长。20世纪60年代，在国际压力导致捕鲸禁令之前，海洋生物学家认为这是一项“不可能”的壮举，因为在这一数字暴跌至150只之后。\n他说，座头鲸和其他鲸鱼数量的恢复在平衡海洋生态系统和地球氧气水平方面扮演着鲜为人知的角色。\n海洋中被称为浮游植物的微小单细胞植物产生的氧气比所有森林的总和还要多，海洋生物学家估计它贡献了地球氧气水平的50%到85%。\n浮游植物以磷虾为食，这是一种形似虾的甲壳类动物，构成座头鲸的食物。当海洋中没有足够的鲸鱼时，磷虾以不可持续的速度消耗浮游植物，并威胁到全球的氧气供应。\n悉尼鲸鱼观察组织的乔纳斯·莱布施纳(Jonas Leibschner)表示，大流行损害了该行业，但他希望他们能在6月中旬之前恢复旅行。\n观鲸悉尼通常从5月初开始每天有两艘船出动两次，寻找鲸鱼。第一艘船可载250人，另一艘可载50人。\n在目前新冠肺炎的限制下，大船上的客户数量限制在50人以内，小船上的客户数量限制在10人以内，这将导致在本已拥挤的季节里出现巨大的收入损失。\n莱布施纳表示，他正以坚定的乐观态度应对挑战。“这些都是我们拿到的牌，事情终于开始好转了，希望如此，”他说。\n对于富兰克林博士来说，座头鲸是一个成功的故事，它应该提醒人类，我们有能力“重新纠正环境错误，展望一个可持续的未来”。\n富兰克林博士说，他希望捕鲸禁令背后的精神能重新点燃，以应对海洋温度上升和气候变暖威胁到最大灭绝的问题。\n获取我们的冠状病毒最新时事通讯的关键发展一览表，您需要知道的数字和我们的读者正在说什么。在这里订阅“悉尼先驱晨报”的最新时事通讯，在这里订阅“时代”杂志。", "note_en": "Finally, some good environment news: the humpback whale population is recovering from near extinction with 40,000 expected off the Australian east coast this breeding season, while helping the world fight climate change.\n  In a normal year, May marks the start of the whale watching season with ships and boats jostling for best viewing positions in search of the East Australian Humpback as they migrate from Antarctica to give birth in the Great Barrier Reef.\n  Dr Wally Franklin, from Southern Cross University&#39;s Marine Ecology Research Centre, said the East Australian Humpback is now growing 10 per cent annually. This is a feat marine biologists thought “impossible” after numbers had crashed to 150 during the 1960s, before international pressure led to whaling bans.\n  He said the recovery of humpback and other whale populations was playing a little known role in balancing the ocean’s ecosystem and the planet&#39;s oxygen levels.\n The ocean&#39;s microscopic, single-celled plant known as phytoplankton produces more oxygen than all forests combined, with marine biologists estimating it contributes between 50 per cent and 85 per cent of the Earth’s oxygen levels.\n Phytoplankton is consumed by &#34;krill&#34;, a shrimp-like crustacean which makes up the diet of Humpback whales. When there are not enough whales in the ocean, krill consume phytoplankton at an unsustainable rate and threaten the global oxygen supply.\n Jonas Leibschner, of Whale Watching Sydney, said the pandemic had hurt the industry, but he is hopeful they will resume their trips by mid-June.\n  Whale Watching Sydney usually has two boats going out twice a day from the beginning of May in search of whales. The first boat can carry 250 people and another has 50.\n Under the current COVID-19 restrictions, the numbers are limited to 50 clients on the larger boat and 10 on the smaller, which will result in a massive loss of income in an already squashed season.\n Mr Leibschner said was approaching the challenge with a resolved optimism. “These are the cards we have been dealt and things are finally beginning to look up again, here’s hoping,” he said.\n For Dr Franklin, the humpback whale is a success story and should remind humans of our ability to “re-correct&#34; environmental mistakes and look towards a sustainable future.\n  Dr Franklin said he hoped the same ethos behind the whaling bans will be reignited to tackle the rising sea temperatures and a warmer climate threatening max extinctions.\n  Get our Coronavirus Update newsletter for the day&#39;s crucial developments at a glance, the numbers you need to know and what our readers are saying. Sign up to  The Sydney Morning Herald&#39;s newsletter  here and  The Age&#39;s  here.", "posttime": "2020-05-30 23:01:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帮助,bounce,鲸鱼", "title": "座头鲸从濒临灭绝中反弹，帮助抗击气候变化", "title_en": "Humpbacks bounce back from near extinction to help fight climate change", "transed": 1, "url": "https://www.smh.com.au/environment/sustainability/superheroes-of-the-deep-humpbacks-bounce-back-from-near-extinction-to-help-fight-climate-change-20200528-p54xhq.html", "via": "", "real_tags": ["帮助", "bounce", "鲸鱼"]}]