[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1005656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "RocketLab不以任何方式对读者使用此处提供的信息或由此产生的设备承担任何责任。麻省理工学院、LCS和在W3上提供这些信息的志愿者同样对读者对这些信息的任何用途不负任何责任。本文档在严格的信息基础上提供。", "note_en": "ROCKETLAB cannot assume responsibility, in any mannerwhatsoever, for the use readers make of the information presentedherein or the device resulting therefrom.  MIT, LCS, and the volunteers who have made this informationavailable on the W3 likewise disclaim all responibility for whateveruse readers make of this information. This document is provided on astrictly informational basis.", "posttime": "2020-06-08 11:31:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,设计,制造,build,信息", "title": "如何设计、制造和试验小型液体燃料火箭发动机", "title_en": "How to Design, Build and Test Small Liquid-Fuel Rocket Engines", "transed": 1, "url": "http://www.risacher.org/rocket/", "via": "", "real_tags": ["火箭", "设计", "制造", "build", "信息"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005655, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "鼠标：拖动-平移滚轮，DBL单击-缩放项目-链接键盘：PgDn、PgUp-缩放箭头-平移", "note_en": "Mouse:   \t\t\t\t\tDrag - pan   \t\t\t\t\tWheel,   \t\t\t\t\tDbl Click - zoom   \t\t\t\t\tItems - links    \t\t\t\t\tKeyboard:   PgDn, PgUp\t\t\t\t\t- zoom   arrows - pan", "posttime": "2020-06-08 11:15:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,内核,map,平移", "title": "Linux内核的交互映射", "title_en": "Interactive Map of Linux Kernel", "transed": 1, "url": "https://makelinux.github.io/kernel/map/", "via": "", "real_tags": ["linux", "内核", "map", "平移"]}, {"category": "", "categoryclass": "", "imagename": "d0882b57899eb60199d4e75407fdd295.jpg", "infoid": 1005654, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我需要改变一下。就在几年前，我站在沼泽的边缘，站在一棵巨大的空心柏树下，给一群5、6岁的孩子读“小熊维尼”。作为一名州立公园的博物学家，我的目标是向这些孩子介绍他们自家后院的大自然。我放了一盘猫头鹰叫声的录音带来配合这个故事。就在这时，一只猫头鹰从我们头上扑了下来，吓了我们一跳，让我们又高兴又高兴。“我真不敢相信我真的能拿到钱来享受这么多乐趣！”我心里想。但随着时间的推移，我的工作变了。坐在我的办公桌前，盯着电脑屏幕上的环境影响报告和批准申请，我开始想，“他们给我的工资不足以让我做这份工作。”这是曲折道路上的另一个转折点，让我在66岁时获得了博士学位。\n我的第一个职业是听力学-这是一个基于农村地区工作机会的务实选择，允许我在照顾日益壮大的家庭的同时兼职。但是，当我的孩子们长大离开家后，我发现自己渴望在外面，而不是在医院地下室的隔音室里。\n我开始参加当地大学的鸟类学课程，希望这能让我有新的职业前景。我还去看了一位职业顾问，这是一个面向非传统学生的大学项目的一部分。“当你还是个孩子的时候，是什么给了你乐趣？”辅导员问道。我想了一会儿，然后回答说：“在外面的树林里玩。”\n我们的讨论最终导致了第二个硕士学位，这个是动物学的，并在一个州立公园担任博物学家的工作。这是一个入门级的职位。我当时44岁。我很高兴能再一次体验到我小时候在户外的快乐。\n但当我在我所在的州自然资源部(Department Of Natural Resources)攀登职业阶梯时，从博物学家到授权合规官，再到管理公共资助的保护项目的环境审查，我在现场的时间减少了，最终消失了。我被锁在电脑屏幕上。在我的脑海里，职业辅导员的问题阴燃着。“当你还是个孩子的时候，是什么给了你乐趣？”\n随着我不满情绪的增长，生活还在继续。在一次晚宴上，我和朋友们讨论了完美的退休生活。我们一致认为，如果钱不是问题，我们将各自在世界不同的地方买一套房子，并在他们之间轮换。不久之后，一个机会出现了：作为实地研究项目的一部分，在荷兰的一所大学进行了为期4个月的休假。这并不完全是房屋共享计划，但它有一种新地方的吸引力。\n我发现田野调查让我再次可以在树林里玩耍，但有了新的目标。我能够将童年时对大自然的愉悦与理清事物带来的智力刺激结合起来--这些愉悦在我的工作中变得太罕见了。\n在我逗留的最后，我被邀请参加“三明治”博士项目，在那里，学生们在他们的祖国做研究，同时在荷兰接受支持和指导。我当时60岁。我没想到拿到博士学位会让我的事业更上一层楼。但我想追随我的新激情。\n我想我可以在州政府全职工作，在晚上和周末进行研究。尽管如此，我的同事们还是扬起了眉毛。“你打算拿博士学位做什么？”他们问。“这一切都是关于旅途的，”我回答说。\n6年后，也就是我从政府职位退休3年后，我成功地为我的论文辩护。\n在我工作的40年里，我的职业道路经历了一些曲折。在当时，我做的每一个决定都是正确的。但当他们不再正确时，我改变了方向。职业生涯的任何决定都不一定是最终的。正如我最喜欢的作家之一乌苏拉·K·勒金(Ursula K.Le Guin)所写的那样，“有一个终点是好的，但最终重要的是旅程。”", "note_en": "I needed a change. Just a few years earlier, I stood at the edge of the swamp under a massive hollow cypress tree reading  Winnie-the-Pooh to a group of 5- and 6-year-olds. As a naturalist at a state park, my goal was to introduce these children to the nature found in their own backyard. I played a tape of owl calls to accompany the story. Just then, an owl swooped down over our heads, startling and delighting us. “I can’t believe I’m actually getting paid to have this much fun!” I thought to myself. But over time, my job changed. Sitting at my desk, staring at environmental impact reports and grant applications on my computer screen, I began to think, “They cannot pay me enough to do this job.” It was another turning point in the winding road that led me, at age 66, to earn a Ph.D.\n My first career had been audiology—a pragmatic choice based on job opportunities in a rural area, and one that allowed me to work part time while tending my growing family. But when my children grew up and left home, I found myself longing to be outside, not in a soundproof room in the hospital basement.\n    I began attending ornithology classes at the local university, hoping that might lead me to new career prospects. I also went to see a career counselor, offered as part of a university program for nontraditional students. “What gave you pleasure as a child?” the counselor asked. I thought for a while before responding, “Playing outside in the woods.”\n Our discussion eventually led to a second master’s degree, this one in zoology, and the job as a naturalist at a state park. It was an entry-level position. I was 44 years old. And I was delighted to once again experience the joy of being outdoors that I had felt as a child.\n But as I climbed the career ladder at my state’s Department of Natural Resources, from naturalist to grant compliance officer to managing environmental reviews of publicly funded conservation projects, my time in the field diminished and finally disappeared. I was chained to a computer screen. In the back of my mind, the career counselor’s question smoldered. “What gave you pleasure as a child?”\n As my discontent grew, life went on. At a dinner party, my friends and I discussed the perfect retirement. We agreed that, if money were not an issue, we would each purchase a home in a different part of the world and rotate among them. Shortly thereafter, an opportunity presented itself: a 4-month sabbatical at a university in the Netherlands as part of a field research project. It wasn’t quite the house-share plan, but it had the appeal of being someplace new.\n    I found that field research allowed me to play in the woods again, but with a new purpose. I was able to combine my childhood delight in nature with the intellectual stimulation that comes with figuring things out—pleasures that had become all too rare in my job.\n At the end of my stay, I was invited to participate in the “sandwich” Ph.D. program, in which students do research in their home country while receiving support and instruction in the Netherlands. I was 60 years old. I didn’t think that earning a Ph.D. would further my career. But I wanted to follow my new passion.\n I figured that I could work full time at my day job in the state government and conduct my research during evenings and weekends. Still, my colleagues raised their eyebrows. “What do you intend to do with a Ph.D.?” they asked. “It is all about the journey,” I responded.\n I successfully defended my dissertation 6 years later, 3 years after retiring from my government position.\n My career path has taken some sharp zigs and zags over my 40 years in the workforce. And each decision I made was the right one for me at the time. But when they were no longer right, I changed direction. No career decision has to be final. As one of my favorite authors, Ursula K. Le Guin, wrote, “It is good to have an end to journey towards, but it is the journey that matters in the end.”", "posttime": "2020-06-08 11:15:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "获得,ph,职业", "title": "我在66岁(2018年)获得了博士学位。", "title_en": "I got a Ph.D. at age 66 (2018)", "transed": 1, "url": "https://www.sciencemag.org/careers/2018/07/its-never-too-late-stretch-your-wings-why-i-got-phd-age-66", "via": "", "real_tags": ["获得", "ph", "职业"]}, {"category": "", "categoryclass": "", "imagename": "cdbb77ddbb1503ed56eed81ddc4bbae2.jpeg", "infoid": 1005653, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周五是我在莫哈韦工作的最后一天。当我离开一个地方时，我通常会最后一次光顾我最喜欢的餐厅。莫哈韦菜肴并不完全值得注意，所以去的地方反而是航空航天港的遗产公园。我会在大部分的午休时间去公园欣赏(一点点)绿色植物。不过马上吸引眼球的是这个扶轮火箭。\n当我第一次来公园的时候，我的一位同事给我看了这段扶轮火箭试飞的视频。我们笑着说，怎么会有人愚蠢到认为它能行得通，我相信大多数人都是这样做的。\n我是说，看看它，就像一座灯塔和一架直升机交叉。但多年来，我开始有了不同的想法。旋转式火箭就在太空船一号的复制品旁边。最初的宇宙飞船现在陈列在国家航空航天博物馆，这几乎是航空航天领域所能获得的最高荣誉。如果你不熟悉，“太空船一号”进行了第一次载人私人太空飞行，并在两周内两次飞向太空，获得了安萨里X奖(Ansari X Award)。另一方面，旋转式火箭进行了三次试飞，最高高度达到75英尺，在进行全面测试的两周前就耗尽了资金。\n但是如果你看看飞船的设计，它肯定也不是最传统的。它基本上在带羽毛的重返大气层时将自己折叠成两半。我毫不怀疑，如果成功逆转，人们会嘲笑宇宙飞船，想知道怎么会有人想出这样一个明显不好的主意。正如扶轮火箭的创办人之一加里·亨德森(Gary Hundson)在努力开始时写的一篇很棒的文章中所写的那样：\n精神错乱和精神错乱之间的区别往往仅仅是观念转变的问题。\n在你看到结果之后，你很容易就能听起来很明智的想法。我并不是在说什么新的东西，但我认为提醒自己鼓励所有的想法是很好的，特别是那些“坏”的想法。至少，它们为世界增添了色彩，并激励他人以新的方式思考。即使这个想法失败了，他们也会以我们无法想象的方式推动我们前进。在扶轮火箭的案例中，它使莫哈韦成为像太空船一号这样的私人太空企业的中心，这一点被认为是功不可没的。\n只有当个人敢于尝试看似不可能的事情时，我们才会扩大可能的领域。换句话说，几乎所有重要的事情都是从坏主意开始的。(在这一点上，我想我只是试图证明我将会有的所有糟糕的想法是合理的)。我会把莫哈韦扶轮火箭前面的牌匾留给你们。\n绘画练习3.如果你错过了，这就是我学习绘画的原因。\n最后，快速编程注意事项：在接下来的几周里，随着我的移动，帖子可能会有点零星。请原谅我。", "note_en": "This past Friday was my last day working in Mojave. When I’m leaving a place, I usually like to visit my favorite restaurants one last time. Mojave cuisine is not exactly noteworthy, so instead the place to go was the Air &amp; Space Port’s Legacy Park. I would go to the park on most of my lunch breaks to take in the (little bit of) greenery. Though what draws the eyes immediately is this thing, the  Rotary Rocket.\n   When I first started coming to the park, one of my coworkers showed me this video of a test flight of the Rotary Rocket. We laughed about how anybody could be dumb enough to think that it could work, like I’m sure most do.\n  I mean, look at it, it’s like a lighthouse crossed with a helicopter. But over the years, I started to think differently about it. The Rotary Rocket is right next to a replica of  SpaceShipOne. The original spaceship now sits in the National Air and Space Museum, just about the highest honor something in aerospace can have. If you’re not familiar, SpaceShipOne had the first crewed private spaceflight and won the  Ansari X Prize by flying to space twice within two weeks. On the other hand, the Rotary Rocket flew three test flights and reached a maximum altitude of 75 feet, running out of funding two weeks before a full-scale test.\n   But if you look at the spaceship’s design, it’s certainly not the most conventional either. It basically folds itself in half during its  feathered re-entry. I have no doubt if the successes were reversed, people would be scoffing at the spaceship wondering how someone could have come up with such an obviously bad idea. As one of the founders of Rotary Rocket, Gary Hundson,  wrote in a great article at the start of the endeavor:\n The difference between &#34;insane&#34; and &#34;insanely great&#34; is often only a matter of shifting perceptions\n It’s so easy to sound wise about ideas after you have the benefit of seeing the results. I’m not really saying anything new, but I think it’s good to remind ourselves to encourage all ideas, especially the “bad” ones. If nothing else, they add color to the world and inspire others to think in new ways. Even if the idea fails, they push us forward in ways we couldn’t imagine. In the case of the Rotary Rocket, it’s credited with making Mojave a center for private space ventures, like SpaceShipOne.\n We only expand the realm of the possible when individuals dare to try things that seem impossible. In other words, almost everything important starts life as a bad idea. (At this point, I think I’m just trying to justify all the terrible ideas I’m going to have). I’ll leave you with the plaque that sits in front of the Rotary Rocket in Mojave.\n    Drawing exercise #3. If you missed it, here’s  why I’m learning to draw.\n   And finally, a quick programming note: posts will probably be a bit sporadic over the next few weeks as I get moved. Please bear with me.", "posttime": "2020-06-08 10:41:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "坏主意,bad,莫哈韦", "title": "为坏主意辩护", "title_en": "In Defense of Bad Ideas", "transed": 1, "url": "https://surjan.substack.com/p/12-in-defense-of-bad-ideas", "via": "", "real_tags": ["坏主意", "bad", "莫哈韦"]}, {"category": "", "categoryclass": "", "imagename": "c736791d1bbcf868373f1af71f6d6357.jpg", "infoid": 1005652, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最后一个活跃的新冠肺炎病例已经康复，新西兰已经连续17天没有新病例。\n最近康复的是一名50多岁的人，与圣玛格丽特医院和疗养院集群有关。\n卫生署署长阿什利·布卢姆菲尔德博士说：“这对当事人来说真的是个好消息，也是新西兰其他地区可以振作起来的事情。”\n“自2月28日以来首次没有活跃病例，这在我们的旅程中肯定是一个重要的标志，但正如我们之前所说的，对Covid-19病毒的持续警惕将继续是至关重要的。\n他们已经48小时没有任何症状，并已从隔离中释放。他们最初被列为可能的病例，但检测呈阴性。然后，在以后的日期，当他们变得不舒服时，检测呈阳性。他们於五月二十二日被确诊为一宗霍乱个案。\n奥塔哥大学(University Of Otago)的公共卫生专家迈克尔·贝克(Michael Baker)教授表示，这一里程碑标志着该国正在摆脱大流行，但未来仍有可能出现病例。\n尾部病例和潜在的未知传播链仍可能令人担忧。\n&#34；正在处理的案件.。所有人都应该安全地隔离在家里，这样他们就不会传染给任何人。\n迄今为止，全国已有1504例确诊和可能病例-其中1482例已康复。\n目前没有人接受医院级别的病毒治疗，死亡人数仍为22人。\n卫生部表示，检测能力仍然很高，该国的检测方法正在不断接受审查。边境和社区内的测试将继续进行。\n在全国报道的16个重要星团中，有8个已经正式关闭。剩下的集群包括布拉夫婚礼、红宝石公主邮轮和马里斯特学院集群，奥克兰、克赖斯特彻奇和怀卡托的老年护理设施集群，Matamata接待场所集群，以及奥克兰的社区集群。\n当从所有病例完成隔离起的28天-或两个潜伏期-没有任何新病例报告时，群集被归类为关闭。\n该部已经记录了52.2万名新西兰COVID Tracer应用的注册人数，比周日的5000名有所增加。37504家企业制作了海报，扫描次数为734415次。", "note_en": "The  last remaining active Covid-19 case has recovered and New Zealand has marked 17 days in a row without a new case.\n The recent recovery is a person in their 50s linked to the St Margaret&#39;s Hospital and Rest Home cluster.\n “This is really good news for the person concerned, and it’s also something the rest of New Zealand can take heart from,” says Director-General of Health Dr Ashley Bloomfield.\n “Having no active cases for the first time since February 28 is certainly a significant mark in our journey but as we’ve previously said, ongoing vigilance against Covid-19 will continue to be essential.&#34;\n     They have been symptom-free for 48-hours and have been released from isolation. They were originally listed as a probable case but tested negative. Then, at a later date, test positive when they became unwell. They were made a  confirmed case on May 22.\n   Public health expert Professor Michael Baker from the University of Otago  said the milestone was a sign the country was emerging from the pandemic, but there was still a chance of cases emerging in the future.\n &#34;Tail end&#34; cases and potentially unknown chains of transmission could still be cause for concern.\n &#34;The active cases ... should all be safely in isolation at home, and so they&#39;re not [going to] be infecting anyone.&#34;\n   To date, there have been 1504 confirmed and probable cases across the country - 1482 of whom have recovered.\n There is no-one currently receiving hospital-level care for the virus, and the death toll remains at 22.\n    The Ministry of Health said testing capacity remains high and the country&#39;s testing approach is constantly under review. Testing at the border and within communities will continue.\n Of the 16 significant clusters reported around the country, eight have officially closed. The remaining clusters include the  Bluff wedding,  Ruby Princess Cruise Ship, and  Marist College clusters, aged care facility clusters in  Auckland,  Christchurch, and  Waikato, the  Matamata hospitality venue cluster, and a community cluster in Auckland.\n A cluster is categorised as closed when there haven&#39;t been any new cases reported for 28 days - or two incubation periods - from when all cases finished isolating.\n The ministry has recorded 522,000 registrations for the  NZ COVID Tracer app, an increase on 5000 from Sunday. Posters have been created by 37,504 businesses, which have been scanned 734,415 times.", "posttime": "2020-06-08 10:41:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新冠,officially,病例", "title": "新西兰正式释放新冠肺炎，终审病例已痊愈", "title_en": "New Zealand is officially Covid-19 free, final case has recovered", "transed": 1, "url": "https://www.stuff.co.nz/national/health/coronavirus/121752568/coronavirus-new-zealand-is-covid19free-last-remaining-active-case-has-recovered", "via": "", "real_tags": ["新冠", "病例"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005651, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "轮子是Python发行版的新标准，旨在取代鸡蛋。支持在pip&&gt;；=1.4和setuptools&&gt;；=0.8中提供。\n安装C扩展不需要Linux、Windows或MacOS上的编译器。\n创建.pyc文件作为安装的一部分，以确保它们与使用的Python解释器匹配。\n该站点显示了PyPI上下载次数最多的360个软件包，显示了哪些软件包已作为车轮档案上传。\n已知已弃用的软件包不包括在内。(例如，分发)。如果您的套餐列表不正确，请创建票证。\n这是用来显示历史上下载次数最多的软件包的。所有时间列表不再可用，过去365天列表中的包将发生变化，以更准确地反映Python社区正在使用的包。这不是车轮的官方网站，只是一个很好的视觉方式来衡量采用率。要查看有关控制盘和Python打包其他方面的权威指南，请参阅《Python打包用户指南》。\n如果您有一个纯Python包，并且没有使用2to3来支持Python3，那么您就很容易做到这一点。确保轮子已安装…。\n…。当您正常运行python setup.py sdist时，请改为运行python setup.py sdist bdist_round。要获得更深入的解释，请参阅这份关于分享你的爱的劳动的指南。\n注意：如果您的项目与Python2和3兼容，则可以创建通用轮子分发。使用以下内容创建一个名为setup.cfg的文件，并上传您的包。\n警告：如果您的项目有可选的C扩展，建议不要发布通用的轮子，因为PIP更喜欢轮子而不是源安装。\n注意：要在控制盘分发中包含项目的许可证文件，请在[METADATA]部分中指定LICENSE_FILES密钥。这有助于遵守许多开放源码许可证，这些许可证要求将许可证文本包含在项目的每个可分发构件中。此选项需要控制盘0.32或更高版本。\nPyPI目前允许上传适用于Windows、MacOS和Linux的特定于平台的轮子。为这些平台创建轮子非常有用，因为这样可以避免用户在安装时编译软件包。\n注意：对打包工具本身进行行为更改的请求应该直接提交给distutils-sig和Python打包机构。\n感谢Python3超级大国之墙的概念并使他们的代码开放源代码，感谢Donald Stufft在IRC上的帮助，感谢James Turnbull的介绍副本，感谢George Hickman一如既往地为我指明了正确的方向。", "note_en": "Wheels are  the new standard of Python distribution and are intended to replace eggs. Support is offered in  pip &gt;= 1.4 and  setuptools &gt;= 0.8.\n    Installation of a C extension does not require a compiler on Linux, Windows or macOS.\n    Creates .pyc files as part of installation to ensure they match the Python interpreter used.\n    This site shows the top 360 most-downloaded packages on  PyPI showing which have been uploaded as wheel archives.\n    Packages that are known to be deprecated are not included. (For example distribute). If your package is incorrectly listed, please  create a ticket.\n  This used to show the all-time most-downloaded packages. The all-time list is no longer available, and the packages in  the last-365-days list will change to reflect more closely what the Python community is using.  This is not the official website for wheels, just a nice visual way to measure adoption. To see the authoritative guide on wheels and other aspects of Python packaging, see the  Python Packaging User Guide.\n      If you have a pure Python package that is not using 2to3 for Python 3 support, you&#39;ve got it easy. Make sure Wheel is installed…\n    …and when you&#39;d normally run  python setup.py sdist, run instead  python setup.py sdist bdist_wheel. For a more in-depth explanation, see this guide on  sharing your labor of love.\n  Note: If your project is Python 2 and 3 compatible you can create a universal wheel distribution. Create a file called  setup.cfg with the following content and upload your package.\n    Warning: If your project has optional C extensions, it is recommended not to publish a universal wheel, because pip will prefer the wheel over a source installation.\n  Note: To include your project&#39;s license file in the wheel distribution, specify the  license_files key in the  [metadata] section. This helps comply with many open source licenses that require the license text to be included in every distributable artifact of the project. This option requires wheel 0.32 or newer.\n      PyPI currently allows uploading platform-specific wheels for Windows, macOS and Linux. It is useful to create wheels for these platforms, as it avoids the need for your users to compile the package when installing.\n          Note: Requests for behavioural changes in the packaging tools themselves should be directed to  distutils-sig and the  Python Packaging Authority.\n    Thanks to the  Python 3 Wall of Superpowers for the concept and making their code open source,  Donald Stufft for his help on IRC,  James Turnbull for the intro copy, and  George Hickman for pointing me in the right direction as usual.", "posttime": "2020-06-08 09:53:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,车轮,wheels", "title": "巨蟒车轮跨越90%", "title_en": "Python Wheels Crosses 90%", "transed": 1, "url": "https://pythonwheels.com/", "via": "", "real_tags": ["python", "车轮", "wheels"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005650, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-06-08 09:20:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太阳光,dots,创建", "title": "量子点变换太阳光光谱加速植物生长", "title_en": "Quantum Dots Shift Sunlight's Spectrum to Speed Plant Growth", "transed": 1, "url": "https://spectrum.ieee.org/view-from-the-valley/at-work/start-ups/quantum-dots-shift-sunlights-spectrum-to-speed-plant-growth", "via": "", "real_tags": ["太阳光", "dots", "创建"]}, {"category": "", "categoryclass": "", "imagename": "a4551cfd945c0a57642ef72da0f9b42b.jpg", "infoid": 1005648, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在一周前，SpaceX首次发射了宇航员，但首席执行官埃隆·马斯克不希望公司固步自封。\n相反，马斯克敦促SpaceX员工立即戏剧性地加快下一代星际飞船火箭的研发进度。周六，马斯克在CNBC看到的一封全公司范围内的电子邮件中写道。\n马斯克在电子邮件中写道，请考虑SpaceX的首要任务(除了任何可以降低龙的返还风险的事情)是星际飞船。\n他的太空公司于5月30日发射了两名美国国家航空航天局(NASA)宇航员，这标志着SpaceX历史性的第一次发射，也是美国太空计划向前迈出的关键一步。SpaceX猎鹰9号火箭和机组人员龙太空舱将宇航员送入轨道，然后前往国际空间站。正如马斯克指出的那样，这项任务仍在进行中，航天器将在未来几个月内将宇航员送回地球。\n发射宇航员飞船的猎鹰9号火箭是SpaceX公司业务的中流砥柱，过去10年执行了85次任务。但这艘星际飞船代表了该公司的目标，即使是其猎鹰9号舰队节省成本的进步也要过时。它的猎鹰9号火箭是部分可重复使用的，因为该公司经常降落火箭的大型助推器级，并回收火箭的鼻锥。但马斯克的目标是让星际飞船完全可重复使用-设想一种更类似于商用飞机的火箭，两次飞行之间的周转时间很短。\n马斯克去年揭开了“星际飞船”原型的面纱，该原型由不锈钢制成，使该公司现有的宇宙飞船相形见绌。SpaceX正在开发星际飞船，目标是一次发射多达100人执行登月和火星任务。\n到目前为止，该公司在德克萨斯州博卡奇卡的星际飞船开发计划已经遭遇了四次戏剧性的挫折。虽然SpaceX在每一次迭代中都取得了进展，但最新的原型在5月29日的发动机测试后不久就爆炸了。\n九个月前，美国宇航局局长吉姆·布里登斯廷在SpaceX公司公布最新原型前发表了一篇有争议的评论，九个月后，马斯克强调了“星际飞船”的重要性。这位美国宇航局局长宣布，他的机构希望看到SpaceX发射NASA宇航员的热情达到与星际飞船计划相同的水平，并表示现在是交付的时候了。\n当时，马斯克表示，SpaceX&34；的资源压倒性地集中在完成“乘员龙”飞船的开发上。现在，随着SpaceX公司兑现了让NASA宇航员飞行的承诺的第一部分，马斯克将公司的注意力转向了星际飞船。\n据CNBC消息人士称，自2019年初以来，SpaceX已经筹集了近17亿美元，其估值升至360亿美元左右。该公司一直在稳步筹集资金，因为它开发了三个雄心勃勃的项目：Crew Dragon航天器，其StarLink互联网卫星和巨大的星际飞船火箭。\n星际飞船计划已经看到原型通过了几个关键里程碑，但SpaceX尚未开始对其最新设计进行飞行测试。之前的一次迭代，被称为StarHopper，在8月份完成了一次短暂的发射和着陆飞行测试。\nSpaceX继续在德克萨斯州美国和墨西哥边境最南端的墨西哥湾沿岸的博卡奇卡(Boca Chica)建立设施。马斯克指出，他最近经常出现在博卡奇卡的现场，并将继续这样做。周六，他在推特上发布了该建筑群的鸟瞰图，展示了越来越多的生产帐篷和火箭制造机舱。\n在他的电子邮件中，马斯克要求SpaceX的员工考虑在博卡奇卡投入大量时间，以帮助进一步加快星际飞船的开发。SpaceX约有8000名员工，其中大部分在该公司洛杉矶地区总部或位于佛罗里达州卡纳维拉尔角或德克萨斯州奥斯汀附近的设施中。尽管SpaceX在洛杉矶港有一些土地正在出租，用于开发星际飞船，但马斯克的电子邮件暗示，该公司正在寻求激励员工从加利福尼亚州和佛罗里达州搬到德克萨斯州。\n马斯克写道，对于那些考虑搬家的人，我们将始终提供一架专用的SpaceX飞机来接送人们。\nSpaceX拥有并运营至少一架私人喷气式飞机，因为该公司最近在2020年第一季度向特斯拉收取了使用这架飞机的费用。但这一非同寻常的搬迁提议突显了马斯克对星际飞船项目的重要性。该公司的博卡雪卡团队已经在几乎夜以继日地工作，但马斯克还想要更多，他敦促SpaceX的员工帮助星际飞船的开发进程更快。\n订阅CNBC PRO，获得独家见解和分析，以及来自世界各地的实时工作日节目。", "note_en": "SpaceX launched astronauts for the first time barely a week ago but CEO  Elon Musk does not want the company resting on its laurels.\n Instead, Musk urged SpaceX employees to accelerate progress on its next-generation Starship rocket &#34;dramatically and immediately,&#34; writing Saturday in a company-wide email seen by CNBC.\n  &#34;Please consider the top SpaceX priority (apart from anything that could reduce Dragon return risk) to be Starship,&#34; Musk wrote in the email.\n  His space company launched a pair of NASA astronauts on May 30, marking  a historic first for SpaceX and a crucial step forward for the U.S. space program. A SpaceX Falcon 9 rocket and Crew Dragon capsule carried the astronauts to orbit and on to the International Space Station. That mission is ongoing, as Musk noted, with the spacecraft set to return the astronauts to Earth in the next couple months.\n  The Falcon 9 rocket that launched the astronauts is the mainstay of SpaceX&#39;s business, with 85 missions over the past decade. But Starship represents the company&#39;s aim to make obsolete even the cost-saving advances of its Falcon 9 fleet. Its Falcon 9 rockets are partially reusable, as the company often lands the large &#34;booster&#34; stage of the rocket and recovers the rocket&#39;s nosecone. But Musk&#39;s goal is to make Starship fully reusable — envisioning a rocket that is more akin to a commercial airplane, with short turnaround times between flights.\n Musk last year  unveiled the Starship prototype, built of stainless steel and dwarfing the company&#39;s existing spacecraft. SpaceX is developing Starship with the goal of launching as many as 100 people at a time on missions  to the moon and Mars.\n  So far, the company&#39;s Starship development program in Boca Chica, Texas has suffered four dramatic setbacks. While SpaceX has made progress on each iteration,  the most recent prototype exploded shortly after an engine test on May 29.\n  Musk&#39;s emphasis on Starship comes nine months after a controversial comment by NASA Administrator Jim Bridenstine, just before SpaceX unveiled the latest prototype. The NASA chief declared his agency wanted &#34;to see the same level of enthusiasm&#34; for SpaceX launching NASA astronauts as there was for the Starship program, saying it was &#34;time to deliver.&#34;\n  At the time, Musk said that SpaceX &#34;resources are overwhelmingly&#34; focused on finishing development of the Crew Dragon spacecraft. Now, with SpaceX having delivered on the first part of its commitment to fly NASA astronauts, Musk is turning the company&#39;s attention to Starship.\n SpaceX  has raised nearly $1.7 billion since the beginning of 2019, with its  valuation rising to around $36 billion according to CNBC sources. The company has steadily raised funding as its developed three ambitious programs: the Crew Dragon spacecraft, its Starlink internet satellites and the massive Starship rocket.\n The Starship program has seen prototypes pass several critical milestones but SpaceX has yet to begin flight testing its most recent design. A previous iteration, known as Starhopper, completed a short launch and landing flight test in August.\n  SpaceX continues to build up its facility in Boca Chica, an area along the Gulf of Mexico at the most southern part of the U.S. and Mexico border in Texas. Musk noted that he&#39;s often been on site at Boca Chica recently and continues to do so. On Saturday he tweeted an aerial view of the complex, showing its growing array of production tents and rocket manufacturing bays.\n  In his email, Musk asked SpaceX employees to &#34;consider spending significant time&#34; in Boca Chica to help further accelerate Starship development. SpaceX has about 8,000 employees, most of whom are at the company&#39;s Los Angeles area headquarters or its facilities at Cape Canaveral, Florida or near Austin, Texas. Although SpaceX has some  land under lease in the Port of Los Angeles for Starship development, Musk&#39;s email implied that the company is seeking to incentivize employees to move to Texas from California and Florida.\n &#34;For those considering moving, we will always offer a dedicated SpaceX aircraft to shuttle people,&#34; Musk wrote.\n SpaceX owns and operates at least one private jet, as the company has charged  Tesla  for use of the aircraft as recently as the first quarter of 2020. But the extraordinary relocation offer underlines how crucial Musk sees the Starship project. The company&#39;s Boca Chica team is already working nearly around the clock but Musk wants more, urging SpaceX employees to help Starship development progress even more quickly.\n Subscribe to CNBC PRO  for exclusive insights and analysis, and live business day programming from around the world.", "posttime": "2020-06-08 09:03:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,埃隆·马斯克,马斯克,musk,spacex", "title": "埃隆·马斯克告诉SpaceX员工，其星际飞船火箭是目前的首要任务", "title_en": "Elon Musk tells SpaceX employees that its Starship rocket is top priority now", "transed": 1, "url": "https://www.cnbc.com/2020/06/07/elon-musk-email-to-spacex-employees-starship-is-the-top-priority.html", "via": "", "real_tags": ["火箭", "埃隆·马斯克", "马斯克", "musk", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "5c715d31fa3da360fc3154ec5967b37a.jpeg", "infoid": 1005647, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊提供了ICE的技术支柱，并密谋抹黑一名被解雇的黑人组织者。亚马逊表示，在“反对种族主义和不公正的斗争”中，它“与黑人社区站在一起”。而这仅仅是个开始。", "note_en": "Amazon, which provides the technical backbone of ICE and plotted to smear a fired Black organizer, says it 'stands in solidarity with the Black community' in the 'fight against racism and injustice.' And that's just the beginning. ", "posttime": "2020-06-08 08:47:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "剥削,stand,黑人", "title": "企业与他们剥削的社区团结一致", "title_en": "Corporations Stand in Solidarity with the Communities They Exploit", "transed": 1, "url": "https://www.vice.com/en_us/article/bv8nv3/brave-corporations-stand-in-solidarity-with-the-communities-they-exploit", "via": "", "real_tags": ["剥削", "stand", "黑人"]}, {"category": "", "categoryclass": "", "imagename": "1ab9856bae662c0528c01b566cb246ad.png", "infoid": 1005646, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Prologue是一个全栈Web框架，旨在构建优雅、高性能的Web服务。\n首先，您应该安装NIM语言，这是一种优雅的高性能语言。按照说明操作，正确设置环境变量。\n#app.nim import prologue proc hello*(ctx：context){.。异步.}=resp&#34；&lt；h1&gt；Hello，Prologue！&lt；/h1&gt；&34；let settings=newSettings()var app=newApp(settings=settings)app。addRoute(&#34；/&#34；，hello)APP。运行()。\n#app.nim import prologue import prologue/中间件/中间件#异步函数过程主页*(ctx：context){。异步}=Resp&#34；&lt；h1&gt；Home&lt；/h1&gt；&34；proc helloName*(CTX：Context){。异步。}=响应#34；&lt；h1&gt；您好，&34；&amp；CTX。getPathParams(&#34；Name&#34；，&#34；Prologue&#34；)&amp；&#34；&lt；/h1&gt；&#34；proc doRedirect*(ctx：context){。异步。}=响应重定向(&#34；/hello&#34；)进程登录*(ctx：context){。Async.}=resp loginPage()proc do_login*(ctx：context){。异步.}=resp redirect(&#34；/hello/nim&#34；)let settings=newSettings(appName=&#34；Starlight&#34；)var app=newApp(settings=settings，midleware=@[debugRequestMiddleware()])app。addRoute(&#34；/&#34；，home，@[HttpGet，HttpPost])APP。addRoute(&#34；/home&#34；，home，HttpGet)应用程序。addRoute(&#34；/redirect&#34；，doRedirect，HttpGet)应用程序。addRoute(&#34；/login&#34；，login，HttpGet)应用程序。addRoute(&#34；/login&#34；，do_login，HttpPost，@[debugRequestMiddleware()])APP。addRoute(&#34；/hello/{name}&#34；，helloName，HttpGet)应用程序。运行()", "note_en": "Prologue is a Full-Stack Web Framework which isideal for building elegant and high performanceweb services.\n            First you should install  Nim language which is an elegant and high performance language.Follow the  instructions and set environment variables correctly.\n     #  app.nim import prologue proc  hello *(ctx:  Context) {. async.}  =  resp  &#34;&lt;h1&gt;Hello, Prologue!&lt;/h1&gt;&#34; let settings =  newSettings() var app =  newApp(settings = settings)app. addRoute( &#34;/&#34;, hello)app. run()\n   #  app.nim import prologue import prologue/middlewares/middlewares  #  Async Function proc  home *(ctx:  Context) {. async.}  =  resp  &#34;&lt;h1&gt;Home&lt;/h1&gt;&#34; proc  helloName *(ctx:  Context) {. async.}  =  resp  &#34;&lt;h1&gt;Hello, &#34;  &amp; ctx. getPathParams( &#34;name&#34;,  &#34;Prologue&#34;)  &amp;  &#34;&lt;/h1&gt;&#34; proc  doRedirect *(ctx:  Context) {. async.}  =  resp  redirect( &#34;/hello&#34;) proc  login *(ctx:  Context) {. async.}  =  resp  loginPage() proc  do_login *(ctx:  Context) {. async.}  =  resp  redirect( &#34;/hello/Nim&#34;) let settings =  newSettings(appName =  &#34;StarLight&#34;) var app =  newApp(settings = settings, middlewares = @[ debugRequestMiddleware()])app. addRoute( &#34;/&#34;, home, @[ HttpGet,  HttpPost])app. addRoute( &#34;/home&#34;, home,  HttpGet)app. addRoute( &#34;/redirect&#34;, doRedirect,  HttpGet)app. addRoute( &#34;/login&#34;, login,  HttpGet)app. addRoute( &#34;/login&#34;, do_login,  HttpPost, @[ debugRequestMiddleware()])app. addRoute( &#34;/hello/{name}&#34;, helloName,  HttpGet)app. run()", "posttime": "2020-06-08 08:30:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全栈,编写,stack,ctx", "title": "用NIM编写的全栈Web框架", "title_en": "Full-Stack Web Framework Written in Nim", "transed": 1, "url": "https://github.com/planety/prologue", "via": "", "real_tags": ["全栈", "编写", "stack", "ctx"]}, {"category": "", "categoryclass": "", "imagename": "34d7ba5a5c2fd0e94d09231f1706540c.jpg", "infoid": 1005645, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "袁国勇教授透露沙田沥源村绿泉楼爆发疫情的调查结果，周四有多达100人从家中疏散。", "note_en": "Professor Yuen Kwok-yung reveals findings into outbreak at Luk Chuen House at Lek Yuen Estate, in Sha Tin, where up to 100 people were evacuated from homes on Thursday.", "posttime": "2020-06-08 08:29:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,排气扇,exhaust", "title": "厨房排气扇可能是香港最新冠状病毒集群的幕后黑手", "title_en": "Kitchen exhaust fans could be behind latest Hong Kong coronavirus cluster", "transed": 1, "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3087709/coronavirus-kitchen-fans-could-be-behind-latest", "via": "", "real_tags": ["病毒", "冠状病毒", "排气扇", "exhaust"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005643, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "彩盒-电子游戏中一个有争议的元素-可能会被重新归类为赌博产品，因为担心它们正在训练儿童赌博。\n英国数字、文化、媒体和体育部(Department for Digital，Culture，Media and Sports)本周将发起一项呼吁，要求提供证据，证明足球特许经营国际足联(FIFA)等游戏越来越常见的特征。\n这一举动是因为越来越多的人担心，抢劫箱的机械装置正在鼓励儿童的赌博式行为，可能会导致他们在以后的生活中上瘾。\n奖品盒允许玩家把钱花在游戏中的奖励上，比如特殊角色或装备，而不知道他们会得到什么。\n据估计，它们对视频游戏行业的价值每年为230亿GB，而且还在上升，这要归功于即使在最初购买游戏之后，收入仍在源源不断地滚滚而来。\n如果部长们选择对奖品盒进行重新分类，这一决定将对游戏开发商产生重大影响，他们可能会被迫撤回一些游戏或重新设计，以便将它们出售给18岁以下的人。\n虽然它们涉及机会的因素，但它们并不受现行赌博法例的规管，因此不受赌博事务监察委员会规管，因为“中奖”的物品并不被视为有金钱价值。\n然而，DCMS特别委员会去年听到的证据表明，在第三方网站上可以很容易地将中彩盒的奖金兑换成现金，游戏开发商使用这些奖金可能会“促进从问题赌徒那里获利”。\n在随后的一份报告中，这个有影响力的委员会建议，它们应该被视为赌博产品。\n工党议员卡罗琳·哈里斯(Carolyn Harris)表示：“它们实际上是一种投机性商品，只会帮助年轻人正常化并鼓励他们冒险。”她是一个跨党派议员小组的主席，该小组正在调查与赌博相关的伤害。\n“这往往会导致青少年沉迷赌博。”\n在包括比利时在内的国家，奖品盒已经被认为是赌博产品，在那里，一些公司不得不将他们的游戏从市场上撤下。\n约克大学(University Of York)学者去年发表的研究发现，奖品盒越来越普遍，在游戏门户网站Steam上最受欢迎的游戏中，约有71%出现在奖品盒中，而10年前这一比例为4%。\n英格兰儿童事务专员安妮·朗菲尔德(Anne Longfield)对儿童最终花费的金额表示担忧，并担心他们会像赌徒追逐损失一样，不断投入资金以获得自己想要的东西。\n对奖品盒监管方式的任何改变，都可能出现在更广泛的博彩法改革中。博彩法是工党在2005年起草的，活动人士已将其贴上了不适合数字时代的标签。", "note_en": "Loot boxes – a  controversial element of video games – could be reclassified as gambling products over concern they are training children to gamble.\n The Department for Digital, Culture, Media and Sport will this week launch a call for evidence on the increasingly common feature of games such as the football franchise Fifa.\n The move has been spurred by mounting concern that the mechanics of loot boxes are  encouraging gambling-style behaviour among children, potentially leading them into addiction in later life.\n Loot boxes allow players to spend money on in-game rewards such as special characters or equipment, without knowing what they will get.\n Their value to the video games industry has been  estimated at £23bn a year and rising, thanks to revenues that keep rolling in even after the initial purchase of the game.\n If ministers opt to reclassify loot boxes, the decision would have a significant impact on game developers, who could be forced to withdraw some titles or redesign them so that they can be sold to people under 18.\n Although they involve an element of chance, they are not covered by existing gambling legislation – and therefore not regulated by the  Gambling Commission – because the items “won” are not considered to have monetary value.\n However, the DCMS select committee heard evidence last year that loot box winnings can be easily exchanged for cash on third-party websites and that their use by game developers was likely to “facilitate profiting from problem gamblers”.\n In a subsequent report, the influential committee  advised that they should be considered gambling products.\n “They are a virtually speculative commodity that only help to normalise and encourage young people to take a chance,” said the Labour MP Carolyn Harris, who chairs a cross-party group of MPs investigating gambling-related harm.\n “All too often this will lead to youngsters developing an addiction to gambling.”\n Loot boxes are already deemed gambling products  in countries including Belgium, where some companies have had to  pull their games from the market.\n Research by academics at the University of York published last year found that loot boxes are increasingly prevalent, featuring in about 71% of the most popular titles on the gaming portal Steam, compared with 4% a decade ago.\n The children’s commissioner for England, Anne Longfield, has expressed concern about the  amount of money that children end up spending and the danger that they will keep feeding money in to get the items they want, like a gambler chasing losses.\n Any change to how loot boxes are regulated could feature in a  broader overhaul of gambling legislation, which was drawn up by Labour in 2005 and has been labelled unfit for the digital age by campaigners.", "posttime": "2020-06-08 07:40:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,class,游戏", "title": "英国可能将赃物盒归类为赌博以保护儿童", "title_en": "UK could class loot boxes as gambling to protect children", "transed": 1, "url": "https://www.theguardian.com/games/2020/jun/07/uk-could-class-loot-boxes-as-gambling-to-protect-children", "via": "", "real_tags": ["可能", "class", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "b6f721a442b978269de2c58320a8b38b.jpg", "infoid": 1005641, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年开发人员调查结果出炉了，在参与调查的6.5万名程序员中，铁锈再一次成为最受欢迎的语言。自2016年以来，铁锈一直位居榜首，这表明它有一些开发人员喜欢的东西。在那些表示目前使用Rust的调查受访者中，有86.1%的人希望明年继续使用它。这是“铁锈”连续第五年蝉联这一榜首，所以我们认为它一定有什么特别之处。\n几个月前，我们采访了Stack Overflow的头号Rust贡献者杰克·古尔丁(又名Sepmaster)，解释是什么让Rust在使用它的程序员中如此受欢迎。以下是他不得不说的话的一个样本：\n“简短的答案是，Rust解决了许多其他语言中存在的痛点，提供了坚实的前进一步，同时也带来了有限的负面影响。”\n整篇文章非常值得一读，因为他介绍了Rust对于来自其他语言的程序员的好处(以及痛点)。不过，尽管杰克口若悬河，很有说服力，但我们还是希望听到更多用户的意见。所以我在我们的铁锈聊天室和铁锈论坛上寻求评论。Ruust用户是一群热情的人，我在一些友好的辩论中获得了一些迷人的见解。\n(为了长度、清晰度和概念性分组，对下面的引语进行了编辑。它们中的许多都来自Rust用户论坛上的这个帖子，所以如果您想要完整地和上下文地阅读它们，请随意阅读。)。\n无需多说，这就是为什么Rust获得了如此多的爱，直接来自Rustaceans自己(包括Rust核心团队的两名成员)。\n虽然有些语言只是对现有概念进行了改进和简化，但一些用户觉得Rust实际上是在用编程语言做新的事情。而且，做新东西不仅仅是为了炫耀；他们觉得这些设计选择用现代编程解决了难题。\nZiCog：“在我专业使用了大约40年的十几种语言中，铁锈是唯一一种真正引入了新功能的语言。也就是说，在没有垃圾收集或复杂运行时系统的编译的真实系统编程语言中，内存使用安全的整个概念。“\nDenys Séguret：“当我们发现一个相当强大的功能(如在env变量的掩饰下读取编译上下文元素)可以如此优雅地完成时，甚至可以在编译时解决，而没有任何丑陋的不一致时，我们经常会有这样的热情。”\nJanriemer：“NPM的工程师克里斯·迪金森(Chris Dickinson)的一句话完美地概括了这一点，因为我当时在不知道这句话的情况下也有同样的想法：‘我对拉斯特最大的赞美是它很无聊，这是一个令人惊叹的赞美。’\nRust是一种编程语言，看起来像是由用户体验设计师开发的。他们对这门语言有一个清晰的愿景(一个原因)，并仔细选择在语言中添加什么和修改什么，同时倾听社区真正想要的是什么。没有任何悬而未决的问题，它们都是一个连贯的整体，完美地支持了开发人员的工作流程。“。\nSkysch：“我从Haskell来到Rust，我觉得Haskell是一门非常优雅和安全的语言。对我来说，最大的不同之处在于Haskell中的高性能代码和惯用的“干净”代码之间的差异比Rust中的更大。大多数Rust代码看起来像大多数其他Rust代码，即使它执行得很好。如果有人在与您通常所做的不同的库和目标下操作，Haskell可能会很快变得陌生。语法上的微小差异可能会导致行为上的巨大差异，而拉斯特在这一轴上的一致性更强。\n也许是世界上最好的依赖管理和构建工具，它实际上已经解决了“依赖地狱”的问题；\n目标裸机(例如，编写操作系统内核或设备驱动程序；将Rust用作‘高级汇编器’)“。\ndboross：“编译时间保证：当我想到”静态类型语言“时，我会想到Java或C#，或类似TypeScript的东西。它们在编译时保证您的代码具有正确的类型，并将一组错误从运行时移到编译时。在这一点上，生锈的程度要高出一个数量级！编译时检查扩展到线程安全、所有权语义和验证。\n枚举意味着，在编译时，我可以声明我的数据可以作为的变量集，当我访问该数据时，我被迫考虑所有的可能性。特征意味着，当我的代码是模板化/泛型时，我具有所需的确切功能。\n铁锈具有极强的向后兼容性。我可以运行为Rust1.0编写的代码。同样，我可以编写我知道下次更新Rust时不必更新的代码。\n而且不仅仅是Rust本身-该语言使库拥有同样的保证。请考虑两个事实：\n在类型检查中，只考虑函数的签名。不需要依赖实现来确定调用者是否正确(就像在Scala或Haskell中可以做的那样)。\n扩展类型系统意味着接口的不正确使用会变成类型错误，而不是运行时错误。\n由于这两件事，库可以100%确定它们在发布新接口时保持向后兼容性。在Python、Java、Javascript、甚至Scala或Haskell中，如果您想确保保持向后兼容性，则需要格外注意实现。在Rust中，它是免费的：如果您没有更改函数签名，它将保持不变。“。\nPeter Varo：“Rust找到了一个最佳点：它和C或C++一样低级，具有所有这些优点(例如，控制、大小、速度等)。同时，它与Haskell一样高水平，拥有令人惊叹的功能遗产。它仍然是势在必行的，所以对大多数人来说都很容易理解，而且它和Python一样灵活。例如，像“鸭子类型”这样的概念发生在编译时(即特征界限)，但是它没有过时的、面向对象的编程模型及其所有众所周知的问题。\n最后但并非最不重要的一点是，所包含的电池：简洁的语法、语言提供的少量功能、标准库的完整性以及文档的一致性和质量，包括为初学者和高级用户提供的学习材料，都是促成因素。“。\nBonk：“使用Rust/Cargo，我可以专注于实际代码，而不是构建系统。不需要花一整天的时间阅读另一个构建系统。与Rust的交叉编译是如此简单和轻松，以至于当您阅读如何进行交叉编译时，您会忍不住想“等等，我肯定遗漏了什么。”\n当你在铁锈之外的时候，有些东西听起来像是空洞的口号，但当你开始使用它时，你会惊喜地意识到其中有很多真相：\n当您花费时间编译代码时，您不必调试代码，从而节省了时间。\n您不再害怕重大重构。一旦您的重构代码编译完成，它就可以按预期工作。\n它确实迫使您进行适当的多线程(当然，您仍然可以死锁，但是崩溃类型的bug要难得多)。\n我发现自己做的样板代码要少得多。无论我需要什么样板代码，我通常可以隐藏在不同的模块中，这样它就不会妨碍实际的应用程序逻辑代码。(最常见的例子是错误类型转换)。“。\n当前的许多编程讨论都围绕着是使用允许您处理内存管理的快速、低级语言，还是使用具有更高安全防范措施的高级语言。对于铁锈的粉丝们来说，他们喜欢它兼而有之。\nPubNub的建筑师杰伊·奥斯特(Jay Oster)说：“这类似于在完全黑暗的环境中游荡了整个职业生涯，然后突然领悟到两个事实：\n你并不完美。你会犯错的。那些错误会给你带来很多问题。\n我看到一种常见的异议，有些人宣称他们实际上是完美的，他们确实写出了完美的代码，一切都很棒，他们不能理解为什么其他人都对铁锈感兴趣。但这位老山羊很清楚，这些人还没有认识到问题不是严格地说是他们自己的问题，而是其他人的问题。这是一个规模经济的问题。\n换句话说，如果我有时间和精力关注每一分钟的细节，并精心手工制作每一行漂亮的代码，而不考虑语言或实现细节，我自己就可以独立编写完美无缺陷的代码。但那并不重要。一旦我开始依赖其他人编写的代码，或者新的贡献者出现并进行修改，我所有所谓的完美保证现在都与现实不符。“惯例的正确性”并不具有可比性。\n传统将会有缺陷，不切实际的大量时间和精力将被花费在试图自动化一开始就不应该存在的创可贴上。“啊哈！”Moment意识到，通过将这些相同的约定直接放入语言和编译器中，实际上可以获得更强有力的保证。\n最重要的是，如果您愿意，您还可以获得与微调手写程序集相当的性能。你可以既吃蛋糕又吃蛋糕！“。\ndboross：“作为一名库作者，复杂的特性/通用系统意味着我可以制作复杂而又易于使用的界面。这些接口不能被错误地使用，这意味着我不必执行运行时检查，我的用户甚至不必考虑问题用例，因为他们不会编写它们。\n作为一名图书馆消费者，丰富而广泛的板条箱生态系统使我能够在广泛的不同领域编写代码，而无需深入研究每个领域的细节。我不需要知道JSON解析器或编写器如何使用serde-而且我的知识匮乏永远不会成为bug的来源，因为我得到的是编译时错误，而不是运行时错误。\n当我使用铁锈的时候，我感觉自己真的受到了照顾。有这么多琐碎的事情，从包升级，到类型错误，再到传递接口不期望的字符串，并得到一个随机的运行时错误，这在Rust中是完全没有的。我只要想想算法就行了！“。\n还记得我提到的那场辩论吗？我看到的一些反反复复的情况是因为我想知道最受欢迎的标题是否来自Rust，因为Rust的用户群很小，他们大多选择使用这种语言。虽然这是事实，在我们的调查中，只有5.1%的受访者在过去一年中使用过Rust，但这些用户希望继续使用Rust。\nCAD97：“非常坦率地说：我认为铁锈在这里的好处是很少有人被迫使用铁锈。尽管如此，大多数人仍在选择性地使用铁锈。\n我并不是说Rust配不上这个标签(我非常肯定它配得上！)，我只是认为Rust处于非常有利的地位，可以“玩弄”这一指标，所以实际上是在这里衡量，因为它有大量的爱好者选择性采用，但那些强制人们使用他们不愿继续使用的语言的人(呃)采用率很低。“。\nZiCog：“如果你使用任何编程语言的时间足够长，你就会觉得它很烂。用太多，用了很多年，它们都很烂。\n那些用各种语言进行大量编程并拥有技能和天赋的人，最终发明并实现了自己的新编程语言，以修复他们过去遭受的所有痛苦。正如你所知道的那样，新的语言就像杂草一样如雨后春笋般涌现。\n鉴于上述情况，如果您问程序员他们喜欢哪种语言，答案将不是他们正在使用的语言，也不是他们过去使用过的任何语言。\n到目前为止，几乎没有程序员必须长期使用Rust，所以他们当然会说他们喜欢Rust。“。\nPubNub的建筑师杰伊·奥斯特(Jay Oster)：“几十年来，我对各种语言都有类似的‘草总是更绿’的偏见。但我认为这不是造成这一现象的主要因素之一。如果是这样的话，我们可能会认为一些较新的语言会在这些调查中脱颖而出，对吗？“。\nH2CO3：“到目前为止，Rust是我最喜欢的语言，尽管我已经使用它4年了(出于性能的需要，对于个人项目，以及”真正的“代码)。当我有了这么多使用C和C++的经验时，我已经发现了它们捆绑在一起的严重缺陷。\n见鬼，即使是Haskell，最优秀的优雅语言，也在大约一年后显示出不可避免的丑陋，当时我不得不开始摆弄语言扩展和方言，以获得一个有点高级的库来编译。\n这根本没有发生在铁锈地区。装满了步枪和设计错误的东西从未从迷雾中浮现出来。\nasafigan：“我相信铁锈学起来很有挑战性，但用起来很有价值。我认为，只要回报足够好，人们有多么喜欢接受挑战，这实际上是令人惊讶的。\n我发现Rust很难学，但很容易使用。我认为很多人是从不同的语言来到Rust的，他们惊讶于它有如此大的不同(因此很难学习)。但他们忘记了一开始学习编程有多难。在大学里，我们有两门Java面向对象编程的课程。到最后，大多数人仍然没有真正理解。锈语与其他语言有很大的不同，很难学。如果您所知道的都是面向对象的，那么学习函数式编程是很困难的。如果您所知道的一切都是功能性的，那么很难学习OOP。如果您只知道GC或手动内存管理，那么很难了解所有权。特征也很奇怪。但为了更好的软件，这是值得的。“。\ncfsamson：“在Rust，我发现很多工作都是前置的。这会使简单的问题更难开始，但不会在以后产生困难的问题。如果有问题，最常见的是问题域本身比我想象的要难，而且与我使用的工具无关。我发现我预先支付的价格绝对物有所值。一旦你熟悉了这门语言，我也会发现价格很低。“。\n从与粉丝的交谈中，我发现他们对这种语言的热爱很难闪耀出来，即使他们不同意。铁锈用户blonk认为这是一个社区范围的特征。\n布朗克：很明显，整个“要尊重”的做法运作得很好。有几个案例中，IMHO，人们恶意提问，但社区成员没有对情况做出巨大的回应，而是真诚地回答，这缓和了局势。\n如果你想知道是什么造就了一个忠实的支持者，那就去和最忠诚的人谈谈，对吗？我联系了“铁锈”核心团队，想找出为什么他们认为“铁锈”年复一年地受到如此多的爱戴。格式略有不同，我保留了问答布局。\n艾琳·鲍尔(Erin Power)是柏林的一家铁锈开发商。从2015年的1.0开始，她就一直在使用Rust。她是Rust治理工作组的负责人之一，也是“Tokei”的创建者，“Tokei”是用Rust编写的流行的开源代码计数器。\n问：使用铁锈的人似乎真的很喜欢它，你认为这是为什么？\n答：我想这是因为拉斯特做出了很大的承诺，并兑现了这些承诺。与任何其他高级语言一样，RUST提供了自动内存管理，但它是在编译时完成的，因此没有隐藏的成本或行为需要考虑。\n生锈一直是为我们在现代硬件中期望的东西而设计的。线程安全和数据竞争，在其他语言中可能是常见的步枪，在语言级别上被考虑在内。因此，您可以非常轻松地充分利用工作站的功能，而无需进行大量更改，也不会出现令人头疼的问题。我一直印象深刻的是，rayon(Rust中的一个受欢迎的库)可以通过只更改一行代码来并行化您的整个工作负载。\n因此，使用Rust编写了许多高质量、快速的实现，而且由于有了Cargo和crates.io(Rust的包管理器和社区运行包注册中心)，在内部和与整个世界重用和共享代码从未像现在这样容易。\nCargo处理包含几到几十个包的大型存储库就像处理一个包一样好，您不需要花几天时间编写构建文件就可以拥有您想要的配置。\n不仅可以轻松地管理和更新Rust依赖项，Rust本身也非常容易使用Rustup在不同版本的语言之间进行升级和切换；默认情况下，Rustup是一个工具链版本管理器。\n上面的任何一点都足以让人喜欢Rust，但总的来说，它使Rust成为一种令人难以置信的令人信服的语言，用它编写和创建项目都会让人感到耳目一新。\n问：Rust团队计划让用户对它保持喜爱的是什么？\n答：嗯，我不能说所有的团队都计划了什么，因为Rust有几十个团队，主要由志愿者组成，他们都是半自主的，都在努力改善Rust语言和周围的生态系统。你可以在GitHub上找到该项目今年的路线图(不过我会注意到，它是在新冠肺炎之前提出和编写的)。\n答：自从Rust在2015年发布1.0版以来，我就一直在编写它，从那以后，我一直试图把我的编程时间花在它上面。我编写并维护了相当多的开源应用程序和库，这些应用程序和库都是我维护的，并且自2018年以来我一直在专业地与Rust合作。\n问：我看到一些评论说铁锈很难掌握，在我们的调查中，只有一小部分人(~5%)使用过铁锈。你认为进入铁锈有很高的门槛吗？为什么或者为什么不？\n答：我认为“铁锈”中确实有一些特定的概念，学习和使用的门槛很高。虽然说是轶事，但我在Rust之前的背景是全栈web开发和设计；我以前没有“系统”或“函数”语言经验，我发现用Rust学习这些概念比其他现有语言容易得多，所以我不同意Rust整体上有很高的门槛。\n我觉得很大的障碍来自于Rust是一种相对较新的编程语言，目前还没有来自其他角度的丰富资源来适合不同人的心理模型来学习，就像您使用更成熟的语言所拥有的那样。希望随着时间的推移，我们会有更多样化的学习材料来帮助教授和提高对这些概念的理解。\n虽然只有一小部分人编写了Rust，但它的采用是如此成功，人们日常使用的许多关键软件已经在Rust中被重写或创建。铁锈已经在五大科技公司中的每一家都采用了，而且不仅仅是企业感兴趣。Dropbox或OneSignal等规模较小的科技公司在Rust有很多核心基础设施提供服务。\n弗洛里安·吉尔彻(Florian Gilcher)自2013年以来一直在Rust编程。他从社区团队一开始就是成员，目前是核心团队的一员。弗洛里安共同组织了前五届RustFest，并共同组织了OxidizeConf。在此之前，他活跃在Ruby社区。\n问：使用铁锈的人似乎真的很喜欢它，你认为这是为什么？\n答：简单的第一个反应是：因为它在很多方面都是好产品。杰克·古尔丁已经做了一个很好的概述，我不想在你的博客上重复了。\n我将详细说明为什么这很重要：许多编程语言和工具都是以对抗性和可比性的方式销售的。“比X好”、“X是新的Y”等。拉斯特一直采取的做法是让好的特征脱颖而出。例如，一种构建Rust的廉价方法是说所有权和借用权是C和C++问题的修复。然而，这产生了一个可怕的论点：它们对许多其他事情都有好处，而这个论点是我。\n..", "note_en": "The 2020 Developer Survey results are in, and once again, Rust is the number one most loved language among the 65,000 programmers who participated. Rust has taken the number one spot since 2016, showing that it’s got something that the developers who use it love. 86.1% of those survey respondents who said they currently use Rust want to continue using it next year. This is the fifth year in a row that Rust has taken this top spot, so we figured it’s got to have something special.\n A few months ago, we asked Stack Overflow’s top Rust contributor, Jake Goulding (aka  Shepmaster), to explain  what makes Rust such a hit with the coders who used it. Here’s a sample of what he had to say:\n “The short answer is that Rust solves pain points present in many other languages, providing a solid step forward with a limited number of downsides.”\n The full article is well worth a read, as he covers the benefits (as well as the pain points) of Rust for coders coming from other languages. But as eloquent and persuasive as Jake is, we wanted to hear from more users. So I reached out for comment in our  Rust chatroom and on the  Rust forums. Rust users are a passionate bunch, and I got some fascinating insights along with some friendly debates.\n (The quotes below are edited for length, clarity, and to group them conceptually. Many of them come from  this thread on the Rust user forums, so if you want to read them all in full and in context, feel free.)\n Without further ado, here’s why Rust gets so much love, straight from the Rustaceans themselves (including two members of the Rust core team.)\n  While some languages just add polish and ease to existing concepts, several users feel that Rust is actually doing new things with a programming language. And it’s not doing new things just to be showy; they feel these design choices solve hard problems with modern programming.\n ZiCog: “Rust is the only language of the dozen or so I have used professionally for four decades that actually introduces genuinely new features. Namely the whole idea of safety of memory usage in a compiled, real systems programming language with no garbage collection or complicated run-time system.”\n Denys Séguret: “We frequently have such enthusiasm when we discover that a quite powerful feature like reading a compilation context element under the disguise of an env variable can be done so elegantly, and even be solved at compile time, without any ugly inconsistency.”\n janriemer: “A quote from Chris Dickinson, engineer at npm, sums it up perfectly for me, because I have thought the same, without knowing the quote at that time: ‘My biggest compliment to Rust is that it’s boring, and this is an amazing compliment.’\n Rust is a programming language that looks like it has been  developed by user experience designers. They have a clear vision (a  why) of the language and  carefully choose what to add to the language and what to rework, while listening to what the community really wants. There are no loose ends, it’s all a coherent whole that perfectly supports a developer’s workflow.”\n skysch : “I came to Rust from Haskell, and I feel that Haskell is a very elegant and safe language. The biggest differentiator for me is that there is a greater difference between high-performance code and idiomatic ‘clean’ code in Haskell than in Rust. Most Rust code looks like most other Rust code, even when it performs well. Haskell can become unfamiliar real quick if someone is operating under different libraries and goals from what you are typically doing. Small differences in syntax can result in huge differences in behavior, and Rust has more uniformity on that axis.”\n  perhaps the world’s best dependency management and build tool, which has practically solved the ‘dependency hell’ problem;\n  Targets bare-metal (e.g. write an OS kernel or device driver; use Rust as a ‘high level assembler’)”\n daboross: “Compile time guarantees: When I think of a “statically typed language”, I think of Java, or C#, or something like TypeScript. They give compile-time assurances that your code has the correct types, and move a set of errors from runtime to compile time. Rust goes one magnitude further in this! Compile time checking extends to thread safety, to ownership semantics, to validation.\n Enums mean that, at compile time, I can declare the set of variants my data can exist as, and when accessing that data I’m forced to consider all possibilities. Traits mean that when my code is templated/generic, I have exact capabilities I can require.\n Rust is  extremely backwards compatible. I can run code written for Rust 1.0. Equally, I can write code which I know I won’t have to update next time I update Rust.\n And it’s not just Rust itself – the language enables libraries to have the same guarantees. Consider two facts:\n In type checking,  only the signature of functions are considered. There’s no relying on the implementation for determining if callers are correct (like you can do in Scala, or Haskell)\n The extensive type system means  incorrect usages of interfaces become type errors, not runtime errors.\n Because of these two things, libraries can be 100% sure that they maintain backwards compatibility when releasing a new interface. In Python, or Java, or Javascript, or even Scala or Haskell, you need to pay extra attention to implementations of things if you want to ensure you maintain backwards compatibility. In Rust, it’s free: if you haven’t changed the function signature, it remains the same.”\n Peter Varo: “Rust found a sweet spot: it is just as low-level as C or C++ with all the advantages of these (e.g. control, size, speed, etc.) At the same time, it is as high-level as Haskell with an amazing amount of functional heritage. It is still imperative, so quite accessible to most people, and it is just as flexible as Python. For example, concepts like “duck-typing” are happening at compile time (i.e. trait bounds), yet it does not have the dated, object-oriented programming model and all of its well known problems.\n Last but not least, the batteries which are included: the small and concise syntax, the small number of features the language provides, the integrity of the standard library as well as its consistency and the quality of its documentation, including the learning materials for both beginners and advanced users are all contributing factors.”\n blonk: “With Rust/cargo I can focus on the actual code rather than the build system. No need to spend whole days reading up on Yet Another Build System. Cross-compilation with Rust is so incredibly simple and painless that when you read up on how to do it, you can’t help but think “Wait, I must be missing something.”\n When you’re outside of Rust, there are things that sound like empty slogans, but when you start using it you’ll become pleasantly surprised to realize there’s a lot of truth to:\n While you spend time fighting to compile your code, you save that time in not having to debug your code.\n You’re no longer afraid of major refactoring. Once your refactored code compiles, it works as intended.\n It really does force you to do proper multithreading (well, you can still deadlock, but the crashy types of bugs are far more difficult to do).\n I find myself doing far less boilerplate code. And what boilerplate code I do need, I can often hide in a different module so it doesn’t get in the way of the actual application logic code. (Most common example of this is the error type conversions).”\n  Many current programming discussions revolve around whether to use a fast, low-level language that lets you handle memory management or a higher-level language with greater safety precautions. For fans of Rust, they like that it does both.\n Jay Oster, Architect at   PubNub: “It’s akin to wandering around in complete darkness for an entire career, and suddenly being enlightened to two facts:\n You are not perfect. You will make mistakes. Those mistakes will cause you a lot of problems.\n I see a common dissent where some proclaim that they  are in fact perfect, and that they do write flawless code, and everything is peachy, and they can’t understand why everyone else is so interested in Rust. But it’s clear to this old goat that these are the people who haven’t yet learned that the problem is not  strictly themselves; it’s everyone else. It’s a problem of economy of scale.\n In other words, I myself could write flawless and bug-free code in isolation if I had the time and energy to pay attention to every minute detail and meticulously hand-craft every beautiful line regardless of the language or implementation details.  But that doesn’t matter. Once I start depending on code written by other people or new contributors come along and make modifications, all of my so-called guarantees of perfection are now incompatible with reality. ‘Correctness by convention’ does not scale.\n Conventions will have faults and impractical amounts of time and energy will be spent trying to automate a bandaid that should not exist in the first place. The “aha!” moment is realizing that one can actually get much stronger guarantees by baking those same conventions directly into the language and compiler.\n To top it off, you can also get performance equivalent to that of finely tuned hand-written assembly, if you so desire. You can have your cake and eat it too!”\n daboross: “As a library author, the complex trait/generic system means I can craft intricate, yet easy to use interfaces. These interfaces  cannot be used incorrectly, which means I don’t have to perform runtime checks, and my users don’t have to even  think about problem cases, because they  can’t write them.\n As a library consumer, the rich and extensive  crates ecosystem enables me to write code in vast different domains without needing to dig into the specifics of every one. I don’t need to know how a JSON parser or writer works to use serde – and my lack of knowledge won’t ever be a source of bugs, because I get compile time errors rather than runtime ones.\n I just feel really taken care of when I’m using Rust. There are  so many trivial things, from package upgrades, to type errors, to passing in a string which an interface doesn’t expect and getting a random runtime error which I’m  completely free of in Rust. I can just think about the algorithms!”\n  Remember that debate I mentioned? Some of the back and forth I saw came from wondering if the Most Loved title comes from Rust having a small user base that mostly use the language by choice. While it’s true, only 5.1% of our survey respondents had used Rust in the past year, those users want to keep on using Rust.\n CAD97 : “To be perfectly frank: I think Rust benefits here that very few people are being forced to use Rust. Most people are electively using Rust, still.\n I’m not saying Rust doesn’t deserve the label (I’m pretty sure it does!), I’m just arguing that Rust is in a  very good position to “game” the metric SO is actually measuring here, because it has a large elective adoption from enthusiasts but a low(er) adoption by those who would mandate people to use a language they would rather not continue to use.”\n ZiCog: “If you use any programming language long enough you will come to think it sucks. Use many, over many years, they all suck.\n Those that do a lot of programming in all kinds of languages and have the skill and talent, end up inventing and implementing their own new programming language to fix all the pains they have suffered in the past. As you know, new languages sprout like weeds as a result.\n Given the above, if you ask programmers what language they love it will not be the one they are using or any they have used in the past.\n As almost no programmers have had to use Rust for the long haul so far of course they will say they love Rust.”\n Jay Oster, Architect at   PubNub: “I had a similar ‘grass is always greener’ bias toward various languages over the decades. But I think this isn’t one of the primary contributing factors to this phenomenon. If it were, we might expect some of the newer languages to come out on top in these surveys, right?”\n H2CO3 : “Rust is currently my favorite language by far, despite the fact that I’ve been using it for 4 years now (for personal projects, as well as “real” code, out of need for performance). By the time I had this much experience with C and C++, I had already discovered their bundle of serious shortcomings.\n Heck, even Haskell, the most elite of elegant languages, showed its inevitable ugliness after about a year or so, when I had to start fiddling with language extensions and dialects in order to get a somewhat advanced library to compile.\n This simply didn’t happen in Rust. The bag of footguns and design errors just never emerged from the mist.”\n asafigan: “I believe that Rust is challenging to learn but rewarding to use. I think it is actually surprising how much people enjoy being challenged as long as the reward is good enough.\n I found Rust hard to learn but pretty easy to use. I think a lot of people come to Rust from a different language and are surprised how much different (and therefore hard to learn) it is. But they forget how hard it was to learn to program in the first place. In college, we had two courses on Object Oriented Programming in Java. By the end, most people still didn’t really get it. Rust is different enough from other languages to be hard to learn. It’s hard to learn say Functional Programming if all you know is OOP. It’s hard to learn OOP if all you know is Functional. It’s hard to learn Ownership if all you know is GC or manual memory management. Traits are pretty weird too. But it’s worth it for better software.”\n cfsamson : “In Rust, I find that a lot of the effort is front loaded. It makes easy problems somewhat harder to get started on, but it doesn’t create hard problems later on. If there are problems it’s most often the problem domain itself that is harder than I thought, and not related to the tools I use. I find the price I pay up front is definitely worth what I get. I also find the price low once you get to know the language well.”\n  From talking to fans, I found that their love of the language shines through pretty hard, even when they disagree. Rust user blonk identifies this as a community-wide characteristic.\n blonk: It’s pretty clear that this whole “be respectful” is working very well. There have been a few cases where people have, imho, asked questions in bad faith, but rather than coughing up a giant hairball over the situation, community members reply in good faith, and it defuses the situation.\n  If you want to know what makes a devoted supporter, talk to the most devoted, right? I reached out to the Rust core team to find out why they think Rust gets so much love, year over year. The format is a little different, I’ve kept the question and answer layout.\n  Erin Power is a Rust developer based in Berlin. She has been using Rust since 1.0 in 2015. She is one of the leads of Rust’s Governance WG, and is the creator of “ Tokei” a popular open source code counter written in Rust.\n Q: People who use Rust really seem to like it; why do you think that is?\n A: I think it’s because Rust makes big promises, and delivers on them. Rust provides automatic memory management like any other high level language, but it’s done at compile time so there’s no hidden cost or behavior to account for.\n Rust has always been designed for what we expect in modern hardware. Thread safety and data races, which can be a common footgun in other languages, were accounted for at the language level. As a result it can be incredibly easy to take full advantage of your workstation’s capabilities without a lot of changes or headaches. It’s always been impressive to me how  rayon (a popular library in Rust) can parallelize your entire workload by changing just a single line of code.\n As a result there’s been a lot of high quality and fast implementations being written in Rust, and thanks to cargo and  crates.io (Rust’s package manager and community run package registry), it’s never been easier to reuse and share that code both internally and with the world at large.\n Cargo handles a large repository with several to dozens of packages just as well as it handles one, you don’t need to spend days writing a build file to have the configuration you want.\n Not only is it easy to manage and update your Rust dependencies, Rust itself is incredibly easy to upgrade and switch between different versions of the language with Rustup; a toolchain version manager that is included by default.\n Any of the above points would be enough for somebody to like Rust, but taken altogether it makes Rust an incredibly compelling language that feels refreshing to write and create your projects in.\n Q: What’s the Rust team planning to keep users in love with it?\n A: Well I can’t speak for what all the teams have planned, as Rust has dozens of teams consisting mostly of volunteers who are semi-autonomously all trying to improve the Rust language and the surrounding ecosystem. You can find out about  the project’s roadmap for the year on GitHub (though I will note that it was proposed and written before COVID-19).\n  A: I’ve been writing Rust since it went 1.0 in 2015 and have tried to spend as much of my programming time writing in it since. I write and maintain quite a few open source applications and libraries that I maintain and I’ve been working with Rust professionally since 2018.\n Q: I’ve seen some comments that Rust is difficult to get the hang of, and in our survey, only a small (~5%) number of people had used Rust. Do you think there’s a high barrier to entry to Rust? Why or why not?\n A: I think there are certainly specific concepts in Rust that have a high barrier to learn and use. Though speaking anecdotally, my background before Rust was in fullstack web dev and design; I had no previous “systems” or “functional” language experience, and I found it way easier to learn those concepts in Rust than other existing languages, so I wouldn’t agree that Rust as whole has a high barrier.\n I feel that a lot of the high barrier comes from Rust being a relatively new programming language and there is not currently a wealth of resources coming from other perspectives that fit different people’s mental models to learn from like you have with the more well established languages. Hopefully, as time goes on we’ll have more diverse learning materials that help teach and improve understanding these concepts.\n While only a small portion of people have written Rust, it’s adoption has been such a success, a lot of critical pieces of software people use everyday have already been rewritten or created in Rust. Rust has already seen adoption in every single one of the big five tech corporations, and it’s not just enterprises that are interested. Smaller tech firms like Dropbox or OneSignal have a lot of their core infrastructure for their services in Rust.\n  Florian Gilcher has been programming in Rust since 2013. He’s a member of the community team since its inception and is currently part of the core team. Florian co-organised the first five RustFests and co-organises OxidizeConf. Before that, he was active in the Ruby community.\n Q: People who use Rust really seem to like it; why do you think that is?\n A: The simple first response is: because it’s a good product in many aspects.  Jake Goulding already gave a good overview that I don’t want to repeat on your blog.\n   I’ll go a bit into detail why that matters: Many programming languages and tools are marketed in a confrontational and comparative matter. “Better than X”; “X is the new Y”; etc. Rust has always taken the approach of making good features stand out by themselves. For example, a cheap way of framing Rust would be to say that Ownership and Borrowing are fixes for C and C++ problems. This makes for a terrible argument, though: they are good for many other things, and this argument im\n......", "posttime": "2020-06-08 07:23:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,rust", "title": "为什么使用Rust的开发者如此喜欢它", "title_en": "Why the developers who use Rust love it so much", "transed": 1, "url": "https://stackoverflow.blog/2020/06/05/why-the-developers-who-use-rust-love-it-so-much/?cb=1", "via": "", "real_tags": ["开发", "rust"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005640, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Linux中，系统调用(Syscall)是一切的核心。它们是应用程序与内核交互的主要接口。因此，他们的速度是至关重要的。特别是在后幽灵/熔毁的世界里，这一点变得更加重要。\n系统调用的主要部分处理I/O，因为大多数应用程序都是这样做的。对于网络I/O，我们有EPOLL系列的syscall，它们为我们提供了相当快的性能。但是在文件系统I/O部门，还缺少一些东西。我们使用Async_io已经有一段时间了，但是除了一小部分应用程序之外，它没有什么好处。主要原因是，只有在使用O_DIRECT标志打开文件时，它才起作用。这将使内核绕过任何操作系统缓存，并尝试直接从设备读取/写入设备。当我们试图让事情进行得更快时，这不是一种非常好的I/O方式。在缓冲模式下，它将同步运行。\n所有这些都在缓慢地改变，因为现在我们有了一个全新的接口来使用kernel-io_uring执行I/O。有很多关于它的议论。这是理所当然的，因为它给了我们一个与内核交互的全新模型。让我们潜入其中，试着了解它是什么，它是如何解决问题的。然后，我们将构建一个带有围棋的小型演示应用程序。", "note_en": "In Linux, system calls (syscalls) are at the heart of everything. They are the primary interface through which an application interacts with the kernel. Therefore, it is vital that they are fast. And especially in a post-Spectre/Meltdown world, this is all the more important.\n A major chunk of the syscalls deal with I/O, because that’s what most applications do. For network I/O, we’ve had the  epoll family of syscalls which have provided us with reasonably fast performance. But in the filesystem I/O department, things were a bit lacking. We’ve had  async_io for a while now, but apart from a small niche set of applications, it isn’t very beneficial. The major reason being that it only works if the file is opened with the  O_DIRECT flag. This will make the kernel bypass any OS caches and try to read/write from/to the device directly. Not a very good way to do I/O when we are trying to make things go fast. And in buffered mode, it would behave synchronously.\n All that is changing slowly, because now we have a brand new interface to perform I/O with the kernel -  io_uring. There’s a lot of buzz happening around it. And rightly so, because it gives us an entirely new model to interact with the kernel. Let’s dive into it and try to understand what it is and how it solves the problem. And then we will construct a small demo application with Go to play with it.", "posttime": "2020-06-08 07:23:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "获取,io", "title": "使用GO获取实际操作(_U)", "title_en": "Getting Hands-on with io_uring using Go", "transed": 1, "url": "https://developers.mattermost.com/blog/hands-on-iouring-go/", "via": "", "real_tags": ["获取", "io"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005639, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1.阿西·汤普森(Arcy Thompson)，“成长与形式”(On Growth And Form)。剑桥大学，I，II，第二版。出版社，剑桥，1952年。\n2.M.N.Bleicher和L.Fejes Tóth，二维蜂巢，Amer.。数学课。每月(将出现)。\n3.L.Fejes Tóth，Über das kürzust Kurvennetz，das eine Kugeloberfläche in flächengleiche konvexe Teile zerlegt，Mat.。学期。-图德。Elrtesitö62(1943)，349-354。\n4.L.Fejes Tóth，关于镶嵌的等周问题，数学学报。阿卡德。SCI。亨加。14(1963)，343-351。\n5.L.Fejes Tóth，在等面积网格的最短网上，数学学报。阿卡德。SCI。亨加。11(1960)，363-370。\n6.L.Fejes Tóth，一种二维细胞的排列，AN.。大学。SCI。布达佩斯。Eötvös教派。数学课。2(1959)，61-64。\n7.L.Fejes Tóth，等周圆盘填充区域，Publ.。数学课。德布勒森5(1957)，119-127。\n8.L.Fejes Tóth，拉格伦根在德尔埃本，Auf der Kugel und im Raum，Springer，柏林，1953年。\n9.L.Fejes Tóth和A.Heppes，Fill of a domain by EquialarealDisks，Publ.。数学课。“德布勒森7号”(1960)，198-203页。", "note_en": "1. W. D&#39;Arcy Thompson,  On growth and form. I, II, 2nd ed., Cambridge Univ. Press, Cambridge, 1952.\n 2. M. N. Bleicher and L. Fejes Tóth,  Two-dimensional honeycombs, Amer. Math. Monthly (to appear).\n 3. L. Fejes Tóth,  Über das kürzeste Kurvennetz, das eine Kugeloberfläche in flächengleiche konvexe Teile zerlegt, Mat. Term.-tud. Értesitö 62 (1943), 349-354.\n 4. L. Fejes Tóth,  Isoperimetric problems concerning tessellations, Acta Math. Acad. Sci. Hungar. 14 (1963), 343-351.\n 5. L. Fejes Tóth,  On shortest nets with meshes of equal area, Acta Math. Acad. Sci. Hungar. 11 (1960), 363-370.\n 6. L. Fejes Tóth,  An arrangement of two-dimensional cells, Ann. Univ. Sci. Budapest. Eötvös Sect. Math. 2 (1959), 61-64.\n 7. L. Fejes Tóth,  Filling of a domain by isoperimetric discs, Publ. Math. Debrecen 5 (1957), 119-127.\n 8. L. Fejes Tóth,  Lagerungen in der Ebene, auf der Kugel und im Raum, Springer, Berlin, 1953.\n 9. L. Fejes Tóth and A. Heppes,  Filling of a domain by equiareal discs, Publ. Math. Debrecen 7 (1960), 198-203.", "posttime": "2020-06-08 07:23:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蜜蜂,bees,fejes", "title": "蜜蜂知道什么，不知道什么(1964)[pdf]", "title_en": "What the Bees Know and What They Do Not Know (1964) [pdf]", "transed": 1, "url": "https://projecteuclid.org/download/pdf_1/euclid.bams/1183526078", "via": "", "real_tags": ["蜜蜂", "bees", "fejes"]}]