[{"category": "", "categoryclass": "", "imagename": "b13decfe5ed31dedb246f4d97703a878.png", "infoid": 1009816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Gitqlite是一个用于在Git存储库上运行SQL查询的工具。它实现SQLite虚拟表并使用Go-Git。它用于通过公共接口(SQL)临时查询磁盘上的Git存储库，作为将各种shell命令拼凑在一起的替代方案。\n将输出您的CLI版本的最新用法说明。通常，第一个参数是SQL查询字符串：\n默认情况下，您的当前工作目录将用作要查询的git存储库的路径。使用--repo标志指定替代路径，甚至指定远程存储库引用(http(S)或ssh)。在执行查询之前，Gitqlite会将远程存储库克隆到临时目录。\n默认情况下，输出将是ASCII表。使用--format json或--format csv可供选择。有关所有选项，请参阅-h。\n与git日志类似，COMMITS表包括当前签出的COMMIT历史记录中的所有COMMIT。\n文件表迭代提交历史记录中的所有文件，默认情况下从存储库中签出的文件开始。完整的表是提交历史记录的每个树中的每个文件。使用Commit_id列可以筛选属于特定提交的工作树的文件。\n这将返回回购的当前检出分支/提交的历史记录中的所有提交。\nSELECT AUTHER_EMAIL，COUNT(*)FROM COMMITS WHERE PARENT_COUNT&lt；2 GROUP BY AUTHER_EMA。\n这是一个代价高昂的查询，它将迭代当前历史中每个提交的每个树中的每个文件：\n返回已添加/删除行的作者电子邮件，按历史记录中的提交总数排序：\n选择COUNT(*)作为提交、SUM(添加)作为添加、SUM(删除)作为删除、AUTHER_EMAIL FROM COMMITS GROUP BY AUTHER_EMAIL ORDER BY COMMITS。\n选择COUNT(*)作为提交，COUNT(Case When strftime(&#39；%w&#39；，Author_When)=&#39；0&#39；THEN 1 END)作为星期天，COUNT(Case When When strftime(&#39；%w&#39；，Author_When)=&#39；1&#39；THEN 1 END)作为星期一，COUNT(Case When When strftime(&#39；%w&#39；，Author_When)=&#39；2&#39。然后1结束)作为星期二，计数(当strftime(&#39；%w&#39；，Author_When)=&#39；3&#39；然后1 End)作为星期三，计数(当strftime(&#39；%w&#39；，Author_When)=&#39；4&#39；然后1结束)作为星期四，计数(当strftime(&#39；%w&#39；，Author_When)=&#39；5&#39；时，计数(当strftime(&#39；%w&#39；，Author_When)=&#39；5&#39；然后1个结束)作为星期五，计数(当strftime(&#39；%w&#39；，Author_When)=&#39；6&#39；然后1个结束)作为星期六，Author_Email from Comments Group by Author_Email ORDER BY COMMITS", "note_en": "gitqlite is a tool for running SQL queries on git repositories.It implements SQLite  virtual tables and uses  go-git.It&#39;s meant for ad-hoc querying of git repositories on disk through a common interface (SQL), as an alternative to patching together various shell commands.\n         Will output the most up to date usage instructions for your version of the CLI.Typically the first argument is a SQL query string:\n  Your current working directory will be used as the path to the git repository to query by default.Use the  --repo flag to specify an alternate path, or even a remote repository reference (http(s) or ssh). gitqlite will clone the remote repository to a temporary directory before executing a query.\n   By default, output will be an ASCII table.Use  --format json or  --format csv for alternatives.See  -h for all the options.\n   Similar to  git log, the  commits table includes all commits in the history of the currently checked out commit.\n   The  files table iterates over  ALL the files in a commit history, by default from what&#39;s checked out in the repository.The full table is every file in every tree of a commit history.Use the  commit_id column to filter for files that belong to the work tree of a specific commit.\n     This will return all commits in the history of the currently checked out branch/commit of the repo.\n       SELECT author_email,  count( *)  FROM commits  WHERE parent_count  &lt;  2  GROUP BY author_email  ORDER BY  count( *)  DESC\n This is an expensive query.It will iterate over every file in every tree of every commit in the current history:\n      Returns author emails with lines added/removed, ordered by total number of commits in the history:\n SELECT  count( *)  AS commits,  SUM(additions)  AS additions,  SUM(deletions)  AS deletions, author_email  FROM commits  GROUP BY author_email  ORDER BY commits\n  SELECT  count( *)  AS commits,  count(case when strftime(  &#39;%w &#39;,author_when) =  &#39;0 &#39; then  1 end)  as sunday,  count(case when strftime(  &#39;%w &#39;,author_when) =  &#39;1 &#39; then  1 end)  as monday,  count(case when strftime(  &#39;%w &#39;,author_when) =  &#39;2 &#39; then  1 end)  as tuesday,  count(case when strftime(  &#39;%w &#39;,author_when) =  &#39;3 &#39; then  1 end)  as wednesday,  count(case when strftime(  &#39;%w &#39;,author_when) =  &#39;4 &#39; then  1 end)  as thursday,  count(case when strftime(  &#39;%w &#39;,author_when) =  &#39;5 &#39; then  1 end)  as friday,  count(case when strftime(  &#39;%w &#39;,author_when) =  &#39;6 &#39; then  1 end)  as saturday, author_email FROM commits  GROUP BY author_email  ORDER BY commits", "posttime": "2020-07-04 22:17:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sql,git,查询", "title": "使用SQL查询Git存储库", "title_en": "Query Git Repositories with SQL", "transed": 1, "url": "https://github.com/augmentable-dev/gitqlite", "via": "", "real_tags": ["sql", "git", "查询"]}, {"category": "", "categoryclass": "", "imagename": "4fcfc60c35f1d6fea97de7383012dac6.jpg", "infoid": 1009815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与其他富裕国家相比，美国每年在医疗保健上的人均支出高出约5000美元。然而，它的人民并没有变得更健康。所有的钱都去哪里了？一种解释是浪费，患者狼吞虎咽地吃下太多的药片，管理人员大量制造繁文缛节。还有一些服务的成本，这些服务可能是受欢迎的和合法的，但对改善医疗结果毫无作用。曼哈顿的医院拥有豪华的接待台和菜单，与伦敦漂白的维多利亚式建筑相比，它们看起来就像酒店。\n然而，最具争议的过度支出来源是医疗保健公司的寻租行为。这是指公司赚取相对于其部署的资本和承担的风险而言的超高利润。熊彼特估计了整个医疗保健系统的欺诈规模。尽管这并不能解释美国大部分的超支现象，但以任何其他标准来衡量，这个数额都是很大的，医疗保健公司每年赚取650亿美元的超额利润。令人惊讶的是，最严重的违规者不是制药公司，而是一大群企业医疗中间商。\n粗略地说，医疗保健迷宫由六层组成，每一层都涉及国家、互助组织和私营公司。人们和雇主付钱给保险公司，保险公司付钱给不透明的聚合者，即药房福利经理和首选提供者组织者。他们反过来付钱给医生、医院和药店，后者又付钱给批发商，批发商又付钱给设备和药品制造商。一些企业集团跨越了几个层次。例如，3月8日，信诺保险公司出价670亿美元收购福利管理公司Express Scripts。回扣制度意味着资金双向流动，从而使产品和服务的真实价格(扣除回扣后)变得模糊不清。\n为了找出谁在欺骗谁，熊彼特调查了美国最大的200家上市医疗保健公司。超额利润的计算标准是超过10%的资本回报率(不包括商誉)，这是任何完全竞争的行业应该达到的最高水平。对于制药商来说，这些数字将研发(R&amp；D)视为一项超过15年的折旧资产，大致相当于他们在发现过程中利用专利的时间。数据来自彭博社。\n超额利润总额仅占美国医疗保健超支的4%左右。但这仍然使医疗保健成为主导经济部分的大型寻租行业中的第二大行业。医疗保健公司的超额利润相当于每个美国人每年200美元，相比之下，电信和有线电视行业的超额利润为69美元，航空公司寡头垄断的超额利润为25美元。只有价值250美元的五大科技“平台”公司是更肆无忌惮的骗子。\n每个人都讨厌制药公司，但他们在医疗寻租中所占的份额相对较小，特别是当你把许多大举投资的中小型公司包括在内的时候。在整个经济中，扣除回扣，药品制造商收到的平均价格每年上涨约5%。但他们的成本也上升了。因此，即使是15家最大的全球制药公司，自20世纪90年代末的辉煌时期以来，资本回报率也下降了一半，现在仅略高于资本成本。随着雇主计划变得越来越吝啬，员工被迫支付更多的药费；他们对价格很敏感。\n与此同时，研发效率似乎有所下降。研究公司SSR的理查德·埃文斯(Richard Evans)跟踪了制药公司每一美元研发产生的高质量专利(定义为其他专利申请中引用的专利)的数量。这一指标在过去十年里大幅下降。股东们可能会抱怨，但对于整体经济而言，这一体系似乎正在发挥作用。大型制药公司仍然在研发上大肆挥霍，但并不像土匪那样赚钱。\n随着医药行业的回归，榜单上的46家中间商的回报飙升。15年前，他们占行业利润的五分之一；现在他们的份额是41%。健康保险公司产生了异常高的回报，但批发商、福利经理和药店也是如此。每个美国人每年总共获得126美元的超额利润，约占整个行业超额利润的三分之二。Express Scripts赚取了数十亿美元的利润，同时拥有不到10亿美元的实体工厂，而且没有披露研发投资。今年，三家鲜有外人听说过的批发商的利润总和预计将超过星巴克(Starbucks)。\n悲观的观点是，寻租行为已经成为美国经济的地方病。哪里的产品过于复杂，客户无法理解，哪里的补贴和复杂的监管增加了混乱，哪里就能不透明地赚取巨额利润。还记得抵押贷款支持证券吗？\n就医疗保健而言，合并可能会削弱竞争，从而使情况变得更糟。现在有五家大型保险公司，三家大型批发商，三家大型连锁药店和三家大型福利经理。目前流行的是“垂直合并”，即公司扩展到不同的层次。除了信诺和Express Scripts，另一家保险公司安泰保险(Aetna)和药房和福利管理公司CVS也在合并。所有这些公司都坚持认为，竞争将会增强。但他们也预计，这些交易将使他们的总利润增加14亿美元。\n然而，也许资本主义并没有被打破，新的竞争者最终会受到诱惑。亚马逊已经在多个州获得了批发药店牌照。它还与摩根大通(JPMorgan Chase)和伯克希尔哈撒韦(Berkshire Hathaway)合作，为其员工创建一个新的医疗体系。这些举措还处于早期阶段，但投资者充分担心，他们对中介机构的估值是以异常低的利润倍数计算的，这表明收益可能会下降。当传统行业受到数字竞争的打击时，人们经常会感到不安。在医疗中间商的情况下，很少有人会对此感到遗憾。\n这篇文章发表在印刷版的商业版上，标题是医疗保健利润#34；", "note_en": "EVERY year America spends about $5,000 more per person on health care than other rich countries do. Yet its people are not any healthier. Where does all the money go? One explanation is waste, with patients wolfing down too many pills and administrators churning out red tape. There is also the cost of services that may be popular and legitimate but do nothing to improve medical outcomes. Manhattan’s hospitals, with their swish reception desks and menus, can seem like hotels compared with London’s bleached Victorian structures.\n The most controversial source of excess spending, though, is rent-seeking by health-care firms. This is when companies extract outsize profits relative to the capital they deploy and risks they take. Schumpeter has estimated the scale of gouging across the health-care system. Although it does not explain the vast bulk of America’s overspending, the sums are big by any other standard, with health-care firms making excess profits of $65bn a year. Surprisingly, the worst offenders are not pharmaceutical firms but an army of corporate health-care middlemen.\n  In crude terms, the health-care labyrinth comprises six layers, each involving the state, mutual organisations and private firms. People and employers pay insurance companies, which pay opaque aggregators known as pharmacy-benefit managers and preferred provider organisers. They in turn pay doctors, hospitals and pharmacies, which in turn pay wholesalers, who pay the manufacturers of equipment and drugs. Some conglomerates span several layers. For example on March 8th Cigna, an insurance firm, bid $67bn for Express Scripts, a benefit manager. A system of rebates means money flows in both directions so that the real price of products and services (net of rebates) is obscured.\n To work out who is stiffing whom, Schumpeter has examined the top 200 American listed health-care firms. Excess profits are calculated as those earned above a 10% return on capital (excluding goodwill), a yardstick of the maximum that should be possible in any perfectly competitive industry. For drugmakers the figures treat research and development (R&amp;D) as an asset that is depreciated over 15 years, roughly the period they have to exploit patents on discoveries. The data are from Bloomberg.\n Total excess profits amount to only about 4% of America’s health-care overspending. But this still makes health care the second biggest of the giant rent-seeking industries that have come to dominate parts of the economy. The excess profits of the health-care firms are equivalent to $200 per American per year, compared with $69 for the telecoms and cable TV industry and $25 captured by the airline oligopoly. Only the five big tech “platform” firms, with a figure of $250, are more brazen gougers.\n Everyone hates pharmaceutical firms, but their share of health-care rent-seeking is relatively trivial, especially once you include the many midsized and small firms that are investing heavily. Across the economy, average prices received by drug manufacturers have risen by about 5% per year, net of the rebates. But their costs have risen, too. As a result, even for the 15 biggest global drugs firms, returns on capital have halved since the glory days of the late 1990s, and are now barely above the cost of capital. As employer schemes get stingier, employees are being forced to pay more of their drug costs; they are price-conscious.\n  Meanwhile the effectiveness of R&amp;D seems to have fallen. Richard Evans of SSR, a research firm, tracks the number of high-quality patents (defined as those cited in other patent applications) that drug firms generate per dollar of R&amp;D. This metric has dropped sharply over the past decade. Shareholders may groan, but for the economy overall the system seems to be working. Big pharma is still splurging on R&amp;D but not making out like a bandit.\n As the drug industry has come back down to earth, the returns of the 46 middlemen on the list have soared. Fifteen years ago they accounted for a fifth of industry profits; now their share is 41%. Health-insurance companies generate abnormally high returns, but so do the wholesalers, the benefit managers and the pharmacies. In total middlemen capture $126 of excess profits a year per American, or about two-thirds of the whole industry’s excess profits. Express Scripts earns billions while having less than $1bn of physical plants and no disclosed investment in R&amp;D. This year the combined profits of three wholesalers that few outsiders have heard of are expected to exceed those of Starbucks.\n The dark view is that pockets of rent-seeking have become endemic in America’s economy. Wherever products are too complex for customers to understand, and where subsidies and complex regulation add to the muddle, huge profits can opaquely be made. Remember mortgage-backed securities?\n In the case of health care, consolidation has probably made things worse by muting competition. There are now five big insurance companies, three big wholesalers, three large pharmacy chains and three big benefit managers. The current vogue is for “vertical mergers” in which firms expand into different layers. As well as Cigna and Express Scripts, Aetna, another insurer, and CVS, a pharmacy and benefits manager, are merging. All these firms insist competition will be boosted. But they are also projecting the deals will boost their combined profits by $1.4bn.\n  Yet perhaps capitalism is not broken and new contenders will eventually be tempted in. Amazon has acquired wholesale pharmacy licences in multiple states. It is also teaming up with JPMorgan Chase and Berkshire Hathaway to create a new health system for their staff. These initiatives are at an early stage, but investors are sufficiently worried that they value the intermediaries on abnormally low multiples of profits, suggesting earnings may fall. People often get upset when conventional industries are hit by digital competition. Few would lament it in the case of health-care middlemen.\n This article appeared in the Business section of the print edition under the headline &#34;Health-care profits&#34;", "posttime": "2020-07-04 21:57:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,profit", "title": "哪些公司从美国的医疗保健系统中获益最多(2018年)", "title_en": "Which firms profit most from America’s health-care system (2018)", "transed": 1, "url": "https://www.economist.com/business/2018/03/15/which-firms-profit-most-from-americas-health-care-system", "via": "", "real_tags": ["美国", "profit"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是的，Maxx交互式桌面是IRIX上伟大的SGI桌面的弟弟！\nMaxx交互式桌面(又名Maxx Desktop或MID)是多年前发布的5dwm.org项目的延续。顺便说一句，5dwm.org网站不再与我们有关联，我们也不认可其内容，尽管它是我们的，并且在几年前从我们这里被盗用了。回到我们的常规计划：)所以不要搞错了，IRIX Interactive Desktop(IID)只有一个真正的实现，就是它的Maxx Desktop！\n我们的使命是带回这种专注于性能、稳定性和生产力的伟大用户体验，同时展示流畅、干净、极简主义的外观和感觉，以及低资源消耗。一款智能桌面，将用户的应用程序放在最前面。让您拥有更多的创造力！\n因此，这并不令人意外，Maxx Desktop是一个高度调优的工作站环境，它可以利用多核和工作负载处理、强大的异步多线程POSIX消息传递、硬件加速和特定于GPU的优化，这些都使Maxx Desktop变得如此快速、轻巧和可靠。\nMaxx Desktop是SGI Desktop的真正重新实现，同时尊重经典/复古SGI的外观和感觉(这对我们来说非常重要)，但也是在这些坚实的基础上扩展和构建，提供更现代的用户体验。我认为它是桌面的经典或原始外观和新的现代风格。我们希望现代外观/感觉像经典SGI外观的自然演变，就好像SGI自己花了几年时间来完善一个已经相当棒的食谱一样。现代的外观仍然支持SGI配色方案，并引入了UTF-8支持、抗锯齿字体渲染、更多的硬件加速和一个新的虚拟桌面管理器。\n我们相信一个高性能的桌面环境，它提供正确的工具集来最大限度地提高创造力和工作效率，而不会牺牲您的系统资源来获得一些令人眼花缭乱的无稽之谈。再说一次，少即是多……。它能让你集中精力！\n我们的团队有着相同的愿景，那就是利用一套正确的技术，使用业界公认的最佳实践和指导方针，以正确的方式构建正确的软件。我们的目标是提供始终如一、令人愉快的用户体验，这些用户体验建立在现代稳定的基础之上，但又具有灵活性。每一项好的、有用的技术都应该是面向未来的……这就是几十年来在构建经过战斗验证的任务关键型系统和高性能企业级应用程序方面的经验所在。如果它的架构设计得当，它就可以在不拆分的情况下发展起来。这就是几十年来构建久经考验的任务关键型系统和高性能企业级应用程序的用武之地。如果它的架构设计得当，它就可以在不拆分的情况下发展。\nMaxx Desktop的典型用户有：2D/3D计算机图形艺术家、电影和特效工作室、软件/游戏开发人员、可视化/仿真、虚拟现实高级用户或石油和天然气研究等。Maxx Desktop也适合那些想要在每天驾驶酷炫司机的同时创作东西的人！然后，Maxx Desktop也适合你！\n此站点由BookStack(一种维基引擎)提供支持，您可以使用右上角的货架和图书链接进行导航。您可以使用顶部的搜索栏或下面的便捷链接进行导航。", "note_en": "Yes the MaXX Interactive Desktop is the little brother of the great SGI Desktop on IRIX!\n      The MaXX Interactive Desktop a.k.a.  MaXX Desktop or MID is the continuation of the 5dwm.org project released many years back.   BTW, the 5dwm.org website is not associated with us anymore and we do not endorse its content, although it&#39;s ours and was miss-appropriated from us a few years ago.  Back to our regular program :)  So don&#39;t be mistaken, there is only one other real implementation of the IRIX Interactive Desktop(IID) and  it&#39;s MaXX Desktop!\n       Our mission is to bring back this great user experience which focused on performance, stability and productivity while sporting a smooth-clean-minimalism look and feel  with low-resources consumption. A smart desktop that puts the user&#39;s application in the forefront.    More for you creativity!\n  So there is no surprises here, MaXX Desktop is a highly tuned Workstation Environment which can leverage  multi-core  workload processing, robust asynchronous multi-threaded POSIX Messaging, hardware acceleration and GPU specific optimizations that  makes the MaXX Desktop so fast, light-weight and dependable.\n  MaXX Desktop is a true re-implementation of the SGI Desktop while respecting the classic/retro SGI look and feel (which is very important for us to get it right), but also to expand and build on top of those solid foundations with a more modern user experience.  See it as the  classic or  original  look and feel of the desktop and a new  modern take.  We want the modern look to be/feel like a natural evolution of the classic SGI look, as if SGI did it themselves throughout several years perfecting an already pretty awesome recipe.   The modern look still supports SGI Color Schemes and introduce UTF-8 support, anti-aliased font rendering, more hardware acceleration and a new virtual-desktop manager.\n  We believe in a High Performance Desktop Environment that provides the right set of tools to maximize creativity and productivity without sacrificing  your system resources to some eye candy non-sense.    Again, less is more... And it keeps you focused!\n    Our team is sharing the same vision of making use of the right set of technologies, using industry proven best practices and guide lines to build the right software, the right way.  We aim at providing a consistent and pleasant user experience built on top of modern and stable foundations but yet flexible.  Every good and useful piece of tech deserves to be future-proof...  This is where  several decades of experience in building battle-proven mission critical systems and high performance Enterprise class applications comes in.  If it&#39;s architect-ed properly,  it can evolve without breaking apart!\n    MaXX Desktop&#39;s typical users are: 2D/3D Computer Graphics Artists, Motion Pictures and Special Effects Studios, Software/Game Developers, Visualization/Simulation, Virtual Reality power-users or Oil and Gas research to name a few.  MaXX Desktop is also for anyone who wants to create stuff while sporting a very cool daily driver!    Then, MaXX  is for you too!\n     This site is powered by   BookStack (a type of Wiki engine) and you can navigate it by using the upper-right links &#39;Shelves and Books&#39;.  You may use the search bar on top or the convenient links below.", "posttime": "2020-07-04 21:57:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交互式,interactive,桌面", "title": "Maxx交互式桌面：IRIX交互式桌面的重新实现", "title_en": "MaXX Interactive Desktop: A Re-Implementation of the IRIX Interactive Desktop", "transed": 1, "url": "https://maxxinteractive.com/", "via": "", "real_tags": ["交互式", "桌面"]}, {"category": "", "categoryclass": "", "imagename": "5b9030b402d6758962a2fe96a215a651.png", "infoid": 1009813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于国际象棋棋盘上的每一个棋子只有一个角色，所以在国际象棋比赛的每一轮中，理论上都有一个正确的走法。\n我们喜欢国际象棋。国际象棋很容易理解。这是可以预见的，因为每个人都必须遵守同样的规则。但是生活不是那样的。生活更像是扑克。\n虽然一个好的扑克玩家可以研究策略，但没有一种策略可以完全消除运气、机会或时机。扑克玩家撒谎，称之为虚张声势。他们并不总是告诉你他们有什么牌。而且，即使他们看起来很真诚，你也会想，“是吗？”\n你可以有4.0的平均绩点，成为一名全美6英尺5英寸250磅的怪物后卫，但仍然不会去你梦寐以求的学校，因为教练组还有其他需求。\n几个月来，你都听不到你梦想中的学校的任何消息，然后在季前赛前一个月突然，首发球员撕裂了他们的ACL，你接到一个疯狂的电话，问你是否还感兴趣(当然你还感兴趣)。\n你可以参加所有的夏令营，支付所有的培训费用，拥有所有最好的人脉，但事情仍然不会像你最初想象的那样发展。\n玩家为招募服务付费，理论上是为了在游戏中带来好运。但你永远不能剥夺任何人类努力的机会。人并不完美。人是会犯错的，只要人性不变，运气的作用也不会改变。\n认为努力工作会有回报的想法是五分之一的美国价值--这就是美国梦。我们之所以被体育运动所吸引，是因为在如此复杂的生活中，体育运动的外表令人耳目一新。你不是赢就是输，中间没有毛茸茸的东西。\n如果运气在我们的生活中扮演着重要的角色，这将意味着在某个时候你可能得到了一些不公平的东西，这意味着你没有完全遵守规则。\n当你看到一名来自德克萨斯州的球员得到你梦想的学校的高价录取时，新英格兰的新兵很容易看到“他只是运气好-每个人都在招募德克萨斯”\n这是德克萨斯球员的错吗？他的祖先100年前搭上了一辆马车搬到了德克萨斯吗？新英格兰甚至在一些招生地图上都不存在，这公平吗？\n就像一个好的扑克玩家知道的那样，你永远不可能完全创造运气，但是你的基本面越好，你的运气就越有可能被你吸引。招聘工作也是如此。\n平均绩点为4.0并不能保证教练感兴趣，但更有可能做到这一点。\n通过眼球测试，看起来你可以击败一名NFL回归者，这并不能保证教练会录用你，但会让你更有可能被录取。\n参加所有的培训和夏令营并不能保证你会得到一份工作，但他们可以让你更有可能得到工作机会。", "note_en": "Since every piece on a chess board has only one role there is a theoretically correct move at each round of a chess match.\n We like chess. Chess is simple to understand. It is predictable because everyone has to play by the same rules. But life is not like that. Life is more like poker.\n While a good poker player can study strategy there is no strategy that entirely eliminated lucky, chance or timing. Poker players lie and call it bluffing. They don’t always tell you what cards they have. And, even if they seem sincere you’re left to wonder, “Are they?”\n  You can have a 4.0 GPA, be an All American 6’5 250lbs monster linebacker and still not end up at the school of your dreams because the coaching staff had  other needs.\n You can hear nothing from your dream school for months, then suddenly the starter tears their ACL a month before preseason and you receive a frantic phone call asking if you’re still interested (of course you are).\n You can attend all the camps, pay for all the training, have all the best connections and  still not have things work out the way you had initially thought they would.\n Players pay for recruiting services to theoretically take luck out of the game. But you never can take chance out of any human endeavor. People aren’t perfect. People make mistakes and as long as human nature remains the same, so shall too the role of luck remain.\n  The idea that hard work pays off is the quintisential American value - it’s  the American Dream. We are attracted so much to sports because their veneer of merit is refreshing in a life so complex. You either win or you lose, no fluffy stuff in between.\n If luck plays a large role in our lives it will mean that at somepoint you  might have gotten something unfairly and that means you didn’t completely play by the rules.\n When you see a player from Texas get a big time offer to the school of your dreams it’s easy for a New England recruit to seeth with “He just got  lucky - everyone recruits Texas”\n Is it that Texas player’s fault his forefathers hitched a wagon to move out to Texas 100 years ago? Is it fair that New England doesn’t even exist on some recruiting maps?\n Like a good poker player knows, you can never totally create luck, but the better your fundamentals the more likely luck will be attracted to you. And so it is with recruiting.\n Having a 4.0 GPA doesn’t guarantee a coach is interested, but makes it more likely.\n Passing the eyeball test and looking like you can crush an NFL returner doesn’t guarantee a coach will recruit you, but makes it more likely.\n Going to all the training and camps doesn’t guarantee you get an offer, but they can make it more likely.", "posttime": "2020-07-04 21:57:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "招募,poker,运气", "title": "招募是扑克而不是国际象棋", "title_en": "Recruiting Is Poker – Not Chess", "transed": 1, "url": "https://recruithacker.substack.com/p/recruiting-is-poker-not-chess?r=7dfq1&utm_campaign=post&utm_medium=web&utm_source=hackernews", "via": "", "real_tags": ["招募", "poker", "运气"]}, {"category": "", "categoryclass": "", "imagename": "5fdc88d49ff3760d3437a954ac99e9e2.jpg", "infoid": 1009812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "叫车巨头优步(Uber)在全球范围内受到冠状病毒大流行的严重影响。在全球范围内，由于冠状病毒大流行，优步在今年前三个月亏损了29亿美元。信息报的一份报告称，现在，为了通过将工程工作转移到印度来削减成本，该公司采取了一项措施。根据这份报告，优步首席执行官Dara Khosrowshahi渴望将工程创新转移到印度，因为这样对公司来说更便宜。优步印度对此未予置评。广告Khosrowshahi早些时候曾表示，新冠肺炎对公司的影响将是巨大的。我不会美化它的。新冠肺炎对骑行业务产生了戏剧性的影响，4月份全球业务下降了约80%，“他在公布收益的电话会议上说。早些时候，作为全球6700名员工大规模裁员的一部分，优步印度公司在印度解雇了600名员工。“新冠肺炎的影响和复苏的不可预见性让优步印度公司别无选择，只能缩减员工规模。大约600个全职职位，包括司机和骑手支持，以及其他功能，都受到了影响。这些裁员是此前宣布的本月全球裁员计划的一部分，“优步印度和南亚地区总裁PraDeep Parameswaran在2020年5月裁员期间曾表示。然而，优步希望将其工程技术转移到印度并不是什么新鲜事。Khosrowshahi在2019年访问印度期间曾表示，印度将成为他们创新的一大来源。他说：“优步(Uber Lite)应用就是一个例子，它是在印度设计和制造的，后来转移到了世界上30多个国家。”当时担任优步首席产品官的马尼克·古普塔(Manik Gupta)曾表示，优步为来自孟加卢市和海得拉巴的工程和产品人才感到自豪。他曾表示：“我们的目标是将这些办事处的员工人数增加一倍，并让1000人在印度制造创新产品。”另见：只有现金才能将沃达丰的想法从缓慢消亡的⁠中拯救出来-它需要大量的现金-广告信实联合从英特尔资本获得₹1894.5 CRE-这是11周内的第12笔投资", "note_en": "Ride hailing giant Uber has been severely impacted by the coronavirus pandemic across the world. Globally, Uber lost  $2.9 billion in the first three months of the year because of the coronavirus pandemic.   And now, in a step to cut costs by shifting its engineering jobs to India, said a report by  The Information. According to the report, Uber CEO Dara Khosrowshahi is eager to shift engineering innovation to India as it will be cheaper for the company.    Uber India didn’t comment on the same.    Advertisement   Khosrowshahi had earlier said that the impact of COVID-19 would be drastic for the company.    &#34;I won&#39;t sugarcoat it. COVID-19 has had a dramatic impact on rides, with the business down globally around 80% in April,” he  said during the conference call for its earnings.   Earlier, as a part of its massive global layoff of 6,700 employees, Uber India had laid off 600 employees in India. “The impact of Covid-19 and the unpredictable nature of the recovery has left Uber IndiaSA with no choice but to reduce the size of its workforce. Around 600 full time positions across driver and rider support, as well as other functions, are being impacted. These reductions are part of previously announced global job cuts this month,” Pradeep Parameswaran, President, Uber India and South Asia had said during the layoffs in May 2020.        However, Uber’s wish to shift its engineering to India is not something new. During his visit to India in 2019, Khosrowshahi had said that India is going to be a big source of innovation for them. “One example is the Uber Lite app, was designed and built in India and moved to over 30 countries around the world,” he had said.  Manik Gupta who was then the Chief Product Officer of Uber had said that Uber is proud of the engineering and product talent based out of Bengaluru and Hyderabad. “We have a goal to double the headcount in these offices and have 1,000 people to build innovative products out of India,” he had said.   SEE ALSO:  Only cash can save Vodafone Idea from a slow death⁠— and it needs a lot of it  Advertisement     Reliance Jio gets ₹1894.5 crore from Intel Capital – the 12th investment in 11 weeks", "posttime": "2020-07-04 21:38:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "希望,struggling,优步", "title": "优步正在苦苦挣扎-它希望通过将工程技术转移到印度来削减成本", "title_en": "Uber Is Struggling – It Wants to Cut Costs by Shifting Engineering to India", "transed": 1, "url": "https://www.businessinsider.in/business/news/uber-is-struggling-due-to-covid19-now-it-wants-to-cut-costs-by-shifting-its-engineering-to-india/articleshow/76768028.cms", "via": "", "real_tags": ["希望", "优步"]}, {"category": "", "categoryclass": "", "imagename": "0d2f9d70d4307a73fc38e872de9b530d.png", "infoid": 1009809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，万代Namco宣布为投资新的Namco博物馆档案馆第一卷的切换玩家提供特别奖金。除了10款模仿Namco经典游戏外，这款游戏在任天堂官方商店的页面上注明，其中包括一个新创建的8位去激活版Pac-Man冠军版(重点增加了)。\n这款奖金游戏结合了2007年Xbox360冠军版发布的游戏性与NES标题的图形和音效，带来了双重怀旧的欣赏。这也不是假的复古版本；在发布后不久，黑客设法从Namco博物馆的收藏品中提取了Pac-Man CE ROM，并发现它实际上可以在真实的NES硬件上工作。\n然而，事实证明，游戏中新创建的部分促销并不十分准确。万代Namco已经向Ars Technica证实，其广受赞誉的冠军版Demake实际上是直接基于十多年前由一位名为Coke774的日本球迷创建的一个鲜为人知的NES/Famicom ROMhack。\n开发团队在提供给Ars Technica的一份声明中表示，在吃豆人40年的历史中，他激励了无数粉丝将游戏开发作为一种爱好或职业。在可口可乐774的案例中，他的工作得到了我们团队的高度赞赏，我们与他正式合作，将他的设计应用到我们的游戏中。\n为了发现万代Namco最新复古款待的隐藏来源，我们欠吸引模式博客的马特·霍金斯一大笔钱。大约一周前，霍金斯公开收集了多个截然不同的证据，这些证据表明，Pac-Man CE Demake可能不像Bandai Namco在营销材料中暗示的那样新颖和原创。\n这些证据包括两个现存的视频，一个是2017年发布到YouTube上的，另一个是2008年发布到Vimeo上的。这两款游戏都显示了与Pac-Man CE标签为FC版本(家庭版的缩写)的基本相同的游戏玩法。(#34；Fc Ver.&#34；(Famicom Version&#34；)的缩写是家庭版(Famicom Version)。两者都与上个月最终发布的迪梅克·万代·纳姆科(Demake Bandai Namco)有着惊人的相似之处。\n可以肯定的是，较旧的视频与万代Namco官方发布的Switch之间存在一些差异。一方面，开关版本标题屏幕上的FC版本已被删除，1980年NAMCO BANDAI游戏公司2007年的版权声明已被替换为2020 Bnei。另一方面，开关版本包含比FC版本更好的音乐和更真实的音效。(##34；FCVer.&#34；Fc Ver.&#34；，&#34；2007 NAMCO BANDAI Game Inc.&#34；版权声明已被替换为&#34；2020 Bnei.&#34；；开关版本包含比#34；FC版本更好的音乐和更真实的音效。\n除了这些变化之外，这些视频和万代Namco后来发布的视频看起来完全一样。从吸引模式到字体，再到最小的动画，一切都完美匹配。\n不过，真正能说明问题的是，FC版本和Switch Demake的特点都是鬼魂，当它们朝上看时，眼睛就会消失(几乎就像鬼魂从等距相机旁转过身来一样)。这种行为非常具体--在Xbox360的原版中并不明显--要让它在两个不相关的Demake中自然出现，需要一个令人难以置信的巧合(FWIW，已经有一个风扇制作的补丁可以修复解压出来的ROM的这种行为)。\n抛开视频不谈，关于早先的“吃豆人CE”的FC版本的真实信息是很难获得的。关于它起源的最有力的初步线索来自用户warax5在YouTube视频上的一条评论：\n没有人有光盘/补丁，因为创建者可口可乐774从未发布过它，只有镜头。他做了一些在盗版时发现的小补丁，但不是很多。我怀疑它不是因为法律原因而发布的。\n从那里可以相对容易地找到可口可乐在ROMhacking.net上的主页。该页面包括PC-8801动作RPG巫师的NES端口，以及NES版本Lode Runner的改进补丁。但是没有提到吃豆人。\n不过，稍微在网上搜索一下，就会发现可口可乐的Twitter页面，该页面号称在撰写本文时拥有932名追随者，并描述了人们的兴趣，包括针对老式游戏机的自制游戏。我倒查了一下可口可乐的订阅源，发现了这条日语推文，翻译过来就是“阅读”。我已经有一段时间没有收到外国人要吃豆人ROM的邮件了。(。\n而Twitter页面则提供了可口可乐YouTube页面的链接。虽然上面没有提到吃豆人，但2018年的一份互联网档案馆副本包括一个缩略图，上面是10年前的NES吃豆人CE(点击量近15万次)。\nTwitter还提供了一个指向可口可乐日语Niconico视频页面的链接，该页面包括两个被设置为私人视频的视频。第一个视频于2008年首次发布在互联网档案馆(Internet Archive)的副本中，其中包括一段说明，翻译过来就是(某人)为NES制作的Xbox360 Pac-Man CE。已经很接近了。音乐是借来的。它使用MMC3。它已经确认可以在真实的硬件上工作。\n2012年发布的第二个私人视频的存档副本中，有一个缩略图，上面有一个在CRT上播放的FC版本。翻译后的说明提到了我让自己在真实硬件上运行的Famicom软件的演示。然而，因为播放视频很孤单，我慢慢地添加了评论，就像声音一样。&#34；(不幸的是，互联网档案馆没有捕捉到视频本身)。\n似乎这还不是足够的证据，Niconico的页面上还包含了一个指向可口可乐个人网站的链接。虽然该页面目前已关闭，但该页面的存档版本包含了FC Ver.Demake的截图，其中一个成就页面看起来与万代Namco官方Demake中的页面一模一样。\n但是，虽然可口可乐774提供了下载他的巫师和Lode Runner黑客的直接链接，但他的个人主页似乎从来没有包括过指向Pac-Man CE Demake的链接。记者试图通过Twitter联系他，但可口可乐774没有回应。\n即使万代Namco没有承认可口可乐在其交换机降级事件中扮演的角色，这些证据也足以表明，问题ROM实际上在很大程度上是十多年前一名孤独的Famicom黑客所为。那么，令人困惑的是，在此之前，万代Namco和支持开发人员M2在多大程度上淡化了这种联系。\n以M2局长Horii Naoki为例，他上个月在Twitter上阐述了这次地震(SiliconEra翻译)。在那里，Horii谈到了五年前第一次开发这款游戏的3DS版本时，团队基本上还没有进一步更换和重新制作许多东西，甚至不仅仅是Switch版本的配乐。\n他写道：我们努力让这款游戏成为任天堂Switch上的Famicom游戏，你可以随着音乐和图形的节奏移动。虽然有些人事先就知道这个项目，但我打赌即使是他们也会对完成的游戏感到惊讶！\nHorii没有提到他们合作的游戏最初是由一个在M2之外工作的孤独黑客在2008年创建的(M2没有回应Ars Technica的置评请求)。\n或者以万代Namco自己的新闻稿为例，它将Pac-Man CE Demake描述为一个令人兴奋的新标题，这是专门为Namco博物馆档案馆开发的一个新标题。尽管万代Namco在新的声明中使用了吓人的引号，但这份声明完全暗示了这是一个特定的Namco创作，而不是对它的润色。\n在任何情况下，随着万代Namco现在公开承认可口可乐的工作，这位孤独的黑客终于可以因为创造了一个精湛的复古港口而获得应有的公众赞誉。整个事件让人想起去年的Genesis Mini，其中包括一个类似授权的扇形港口大流士(Darius)，以完善其产品。或者，你可以回到“吃豆人”本身，最初是粉丝制作的“疯狂的奥托”(Crazy Otto；)，后来变成了官方授权的续集(现在陷入了一些混乱的法律纠纷)。“吃豆人”最初是粉丝制作的“疯狂的奥托”(Crazy Otto；)，后来变成了官方授权的续集(现在陷入了一些混乱的法律纠纷)。\n当我们在做这件事的时候，我们想知道更多关于最近Switch Namco博物馆档案馆藏品中包括的新的NES港口Gaplus的起源的信息。在这里，我们想了解更多关于最近Switch Namco博物馆档案馆收藏品中新的NES港口Gaplus的起源。万代Namco尚未回复我们对此发表评论的请求。\n希望“吃豆人CE”的曝光能让更多的粉丝游戏更受欢迎，尽管经常受到法律威胁，但这些游戏还是突破了广受欢迎的复古游戏属性的界限。", "note_en": "Last month, Bandai Namco announced a special bonus for Switch players who invested in the new  Namco Museum Archives Vol. 1. In addition to 10 emulated Namco classics, the  game&#39;s official Nintendo store page notes it includes &#34;a  newly created 8-bit demastered version of  Pac-Man Championship Edition&#34; (emphasis added).\n That bonus game combines the gameplay of  the 2007 Xbox 360  Championship Edition release with the graphics and sound effects of an NES title for a doubly nostalgic dose of retro appreciation. And this was no faux-retro  demake either; shortly after release, hackers managed to extract the  Pac-Man CE ROM from the  Namco Museum collection and  found it actually works on real NES hardware.\n As it turns out, though, the &#34;newly created&#34; part of the game&#39;s promotion isn&#39;t quite accurate. Bandai Namco has confirmed to Ars Technica that its much-lauded  Championship Edition demake is actually based directly on an obscure NES/Famicom ROMhack created over a decade ago by a Japanese fan going by the handle Coke774.\n &#34;Throughout Pac-Man&#39;s 40-year history, he has inspired countless fans to take on game development as either a hobby or a career,&#34; the development team said in a statement provided to Ars Technica. &#34;In the case of Coke774, his work was highly appreciated by our team and we worked with him officially to implement his design into our game.&#34;\n  In discovering the hidden source of Bandai Namco&#39;s latest retro treat, we owe a huge debt to Matt Hawkins over at the Attract Mode blog. About a week ago, Hawkins  publicly gathered together multiple disparate bits of evidence that suggested the  Pac-Man CE demake might not be quite as new and original as Bandai Namco implied in its marketing materials.\n That evidence includes two extant videos, one  posted to YouTube in 2017, the other  posted to Vimeo way back in 2008. Both show largely identical gameplay on what&#39;s labeled as an &#34;FC Ver.&#34; (short for &#34;Famicom version&#34;) of  Pac-Man CE. And both bear an uncanny resemblance to the demake Bandai Namco would eventually release last month.\n  To be sure, there are some differences between the older videos and Bandai Namco&#39;s &#34;official&#34; Switch release. For one, the &#34;FC Ver.&#34; has been removed from the Switch release title screen, and a &#34;1980 2007 NAMCO BANDAI Game Inc.&#34; copyright notice has been replaced with &#34;2020 BNEI.&#34; For another, the Switch release includes  much better music and more authentic sound effects than the &#34;FC Ver.&#34;\n Aside from those changes, though, the videos and Bandai Namco&#39;s later release look utterly identical. Everything from the attract mode to the fonts to the smallest animations matches up perfectly.\n The real tell, though, is the way both the &#34;FC Ver.&#34; and the Switch demake feature ghosts whose eyes disappear when they&#39;re facing upwards (almost as if the ghost had turned away from an isometric camera). That behavior is so specific—and not apparent in the Xbox 360 original—that it would take an incredible coincidence for it to occur naturally in two unrelated demakes (FWIW, there is  already a fan-made patch that &#34;fixes&#34; this behavior for the extracted ROM).\n  Videos aside, actual information about the earlier &#34;FC Ver.&#34; demake of  Pac-Man CE is hard to come by. The strongest initial clue to its provenance came from  a comment on the YouTube video from user wartax5:\n Nobody has the rom/patch because the creator, Coke774, never released it, just the footage. He did some minor patches found over at romhacking but not a lot. I suspect it wasn’t released for legal reasons.\n From there, it is relatively easy to find  Coke774&#39;s page on ROMhacking.net. That page includes an NES port of the PC-8801 action RPG  Sorcerian as well as an improvement patch for the NES version of  Lode Runner. But there&#39;s no mention of  Pac-Man.\n    A little more Web digging, though, turns up  Coke774&#39;s Twitter page, which boasts 932 followers as of this writing and describes interests including &#34;homebrew games for older consoles.&#34; A bit of backwards searching through Coke774&#39;s feed finds  this Japanese tweet, which translates to read &#34;It&#39;s been a while since I got a mail from a foreigner asking for the  Pac-Man ROM.&#34; (Thanks to Andrew Vestal for the translation help throughout this piece).\n The Twitter page in turn brings up links to Coke774&#39;s YouTube page. Though there are no  Pac-Man mentions on there,  an Internet Archive copy from 2018 includes a thumbnail for &#34;Pac-Man CE for NES&#34; from 10 year prior (and with nearly 150,000 views).\n Twitter also includes a link to  Coke774&#39;s Japanese Niconico video page, which includes two videos that have been set to &#34;private.&#34; An  Internet Archive copy of the first video, first posted in 2008, includes a description that translates to &#34;Looks like (someone) made Xbox 360  Pac-Man CE for the NES. It&#39;s pretty close. The music is borrowed. It uses MMC3. It&#39;s confirmed working on real hardware.&#34;\n An  archived copy of the second private video, posted in 2012, features a thumbnail with the &#34;FC Ver.&#34; running on a CRT. The translated description mentions a &#34;Demonstration of Famicom software I made myself running on real hardware. However, since it was lonely to play the video, I slowly add commentary like voice.&#34; (Unfortunately, the Internet Archive did not capture the videos themselves).\n As if that wasn&#39;t enough evidence, the Niconico page also includes a link to Coke774&#39;s personal website. Though it&#39;s currently down,  archived versions of that page include screenshots from the &#34;FC Ver.&#34; demake, including  an Achievements page that looks exactly like the one found in Bandai Namco&#39;s official demake.\n But while Coke774 provided direct links to download his  Sorcerian and  Lode Runner hacks, his personal page appears to have never included a link to the &#34;FC Ver.&#34;  Pac-Man CE demake. Coke774 did not respond to attempts to contact him through Twitter.\n  Even if Bandai Namco hadn&#39;t acknowledged Coke774&#39;s role in its Switch demake, this would all be more than enough evidence to show that the ROM in question was actually largely the work of a lone Famicom hacker working over a decade ago. What&#39;s baffling, then, is how much Bandai Namco and supporting developer M2 downplayed that association before now.\n  Take M2 director Naoki Horii, who  expounded on the demake on Twitter last month (as  translated by SiliconEra). There, Horii talks about first working on a 3DS version of the game five years ago, before the team &#34;basically further replaced and remade many things even beyond just the soundtrack&#34; for the Switch version.\n &#34;We worked hard to make this a Famicom game on Nintendo Switch where you can move to the rhythm of the music and the graphics,&#34; he writes. &#34;While there are some people who knew about this project beforehand, I bet even they will still be surprised at the finished game!&#34;\n Nowhere in there does Horii mention that the game they worked on was originally created by a lone hacker working outside of M2 back in 2008 (M2 did not respond to a request for comment from Ars Technica).\n Or take  Bandai Namco&#39;s own press release for the collection, which describes the  Pac-Man CE demake as &#34;an exciting &#39;new&#39; title developed specifically for  Namco Museum Archives.&#34; Despite the Bandai Namco&#39;s use of scare quotes around &#34;new,&#34; that announcement gives every implication that this was a &#34;specific&#34; Namco creation, not a touch-up to a decade-old unauthorized fan work acquired by the company years later.\n In any case, with Bandai Namco now publicly acknowledging Coke774&#39;s work, this solitary hacker can finally get his due public credit for the creation of a masterful retro port. The whole affair brings to mind  last year&#39;s Genesis Mini, which included a similarly licensed fan-made port of  Darius to round out its offerings. Or you could go back to the creation of  Ms. Pac-Man itself, which started as the fan-made hack &#34;Crazy Otto&#34; before  becoming an officially licensed sequel (that is now caught up in  some messy legal battles).\n While we&#39;re at it, we&#39;d like to know more about the origins of  the &#34;new&#34; NES port of  Gaplus included in the recent Switch  Namco Museum Archives collection. Bandai Namco has not yet responded to our request for comment on that one.\n Hopefully, the  Pac-Man CE revelation will lead to a greater appreciation of the wider community of fan games that push the boundaries of what&#39;s possible for well-loved retro game properties, despite  frequent  legal  threats.", "posttime": "2020-07-04 21:19:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "man,namco,游戏", "title": "我们追踪了Namco的“新”Pac-Man Demake的来源：一个2008年的粉丝ROMhack", "title_en": "We traced Namco’s “new” Pac-Man demake to its source: A 2008 fan ROMhack", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/we-traced-namcos-new-pac-man-demake-to-its-source-a-2008-fan-romhack/", "via": "", "real_tags": ["man", "namco", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么水银在室温下是液体？如果你在学校教室里问这个问题，你可能会被告知，相对论会影响重金属的轨道，收缩它们并改变它们的结合方式。然而，证明这一解释是正确的第一个证据才刚刚公布。\n由新西兰奥克兰梅西大学的Peter Schwerdtfeger领导的一个国际研究小组使用量子力学计算了金属的热容，包括或排除了相对论效应。他们表明，如果他们在计算时忽略了相对论，那么汞的预测熔点是82摄氏度，但如果他们考虑了相对论效应，他们的答案与-39摄氏度的实验值非常接近。\n相对论认为，物体移动得越快，就会变得越重。在原子中，最里面电子的速度与核电荷有关。原子核越大，静电吸引就越大，电子必须移动得越快，才能避免落入其中。所以，当你沿着元素周期表往下走时，这些1s电子越来越快，因此更重，导致原子半径缩小。这稳定了一些轨道，这些轨道本身也具有相对论性质，同时也破坏了其他轨道的稳定。这种相互作用意味着，对于像汞和金这样的重元素，外层电子是稳定的。在汞的情况下，电子与自己的原子核保持联系，而不是在相邻的汞原子之间形成键，而较弱的原子间作用力，如范德华键，将原子保持在一起。\n20世纪60年代，现供职于芬兰赫尔辛基大学的Pekka Pyykkö发现黄金的颜色是相对论效应的结果。他指出，金的6s轨道的较低能级意味着从5d波段激发电子所需的能量位于可见光而不是紫外光的范围内。这意味着黄金吸收蓝光，同时反射黄色和红色的光，正是这一点赋予了金属特有的色调。如果在不考虑相对论效应的情况下计算这两个带的能量，所需的能量要大得多。随后进一步的计算表明，相对性对重金属化合物的颜色和键长的影响，以及它在催化中的重要性。然而，汞的低熔点仍然只能被描述为“可能”是由于相对论效应。\n没有参与这项研究的Pyykkö解释说，“在挥手、推测的层面上，这个(相对论影响水银熔点)的观点自20世纪70年代末就已经存在了，但这是第一个定量证据。”\n特别是Schwerdtfeger的团队，几十年来一直在研究这个问题。他解释说，延迟的原因是直到最近，计算机还不能完成团队进行的强大计算。他补充说，这需要大量的计算机时间，而且现在使用的算法效率更高。\n但是，除了这项工作肯定会进入教科书之外，Schwerdtfeger希望通过展示他的方法是有效的，它可以被用来计算其他金属系统的熔点。\n但更重要的是，下次老师被问及相对论最显著的例子之一时，他们会知道有证据支持他们的解释。", "note_en": "Why is  mercury a liquid at room temperature? If you ask that question in a school classroom you will probably be told that relativity affects the orbitals of heavy metals, contracting them and changing how they bond. However,  the first evidence that this explanation is correct has only just been published.\n  An international team led by  Peter Schwerdtfeger of Massey University Auckland in New Zealand used quantum mechanics to make calculations of the heat capacity of the metal either including or excluding relativistic effects. They showed that if they ignored relativity when making their calculations, the predicted melting point of mercury was 82°C. But if they included relativistic effects their answer closely matched the experimental value of -39°C.\n  Relativity states that objects get heavier the faster they move. In atoms, the velocity of the innermost electrons is related to the nuclear charge. The larger the nucleus gets the greater the electrostatic attraction and the faster the electrons have to move to avoid falling into it. So, as you go down the periodic table these 1s electrons get faster and faster, and therefore heavier, causing the radius of the atom to shrink. This stabilises some orbitals, which also have a relativistic nature of their own, while destabilising others. This interplay means that for heavy elements like mercury and  gold, the outer electrons are stabilised. In mercury’s case, instead of forming bonds between neighbouring mercury atoms, the electrons stay associated with their own nuclei, and weaker interatomic forces such as van der Waals bonds hold the atoms together.\n    In the 1960s,  Pekka Pyykkö, now at University of Helsinki, Finland, discovered that gold’s colour was the result of relativistic effects. He showed that the lower energy levels of the 6s orbital of gold means that the energy required to excite an electron from the 5d band lies in the visible rather than UV range of light. This means that gold absorbs blue light, while reflecting yellow and red light, and it is this that gives the metal its characteristic hue. If the energies of the two bands were calculated without including relativistic effects, the energy required is much greater. Further calculations have subsequently shown the influence of relativity on the colour and bond lengths of heavy metal compounds, as well as its importance in catalysis. However, the low melting point of mercury could still only be described as ‘probably’ due to relativistic effects.\n  ‘At a hand-waving, speculative level, this idea [that relativity affects the melting point of mercury] has been around since the late 1970’s,’ explains Pyykkö, who was not involved in the work, ‘but this is the first quantitative proof.’\n  Schwerdtfeger’s team, in particular, have been working on the problem for couple of decades. The reason for the delay, he explains, was that until recently computers could not complete the powerful calculations the team performed. ‘A lot of computer time was required,’ he adds, ‘and the algorithms used are more efficient nowadays.’\n  But beyond making it into the textbooks, which this work will definitely do, Schwerdtfeger hopes that by showing that his approach works it can be used to calculate the melting points of other metallic systems.\n  But more importantly, next time a teacher gets asked about one of the most conspicuous examples of relativity, they’ll know there’s evidence to back up their explanation.", "posttime": "2020-07-04 20:59:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "水星,mercury,相对论", "title": "水星流动性背后的相对性(2013年)", "title_en": "Relativity behind mercury's liquidity (2013)", "transed": 1, "url": "https://www.chemistryworld.com/news/relativity-behind-mercurys-liquidity/6297.article", "via": "", "real_tags": ["水星", "mercury", "相对论"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是的，Maxx交互式桌面是IRIX上伟大的SGI桌面的弟弟！\nMaxx交互式桌面(又名Maxx Desktop或MID)是多年前发布的5dwm.org项目的延续。顺便说一句，5dwm.org网站不再与我们有关联，我们也不认可其内容，尽管它是我们的，并且在几年前从我们这里被盗用了。回到我们的常规计划：)所以不要搞错了，IRIX Interactive Desktop(IID)只有一个真正的实现，就是它的Maxx Desktop！\n我们的使命是带回这种专注于性能、稳定性和生产力的伟大用户体验，同时展示流畅、干净、极简主义的外观和感觉，以及低资源消耗。一款智能桌面，将用户的应用程序放在最前面。让您拥有更多的创造力！\n因此，这并不令人意外，Maxx Desktop是一个高度调优的工作站环境，它可以利用多核和工作负载处理、强大的异步多线程POSIX消息传递、硬件加速和特定于GPU的优化，这些都使Maxx Desktop变得如此快速、轻巧和可靠。\nMaxx Desktop是SGI Desktop的真正重新实现，同时尊重经典/复古SGI的外观和感觉(这对我们来说非常重要)，但也是在这些坚实的基础上扩展和构建，提供更现代的用户体验。我认为它是桌面的经典或原始外观和新的现代风格。我们希望现代外观/感觉像经典SGI外观的自然演变，就好像SGI自己花了几年时间来完善一个已经相当棒的食谱一样。现代的外观仍然支持SGI配色方案，并引入了UTF-8支持、抗锯齿字体渲染、更多的硬件加速和一个新的虚拟桌面管理器。\n我们相信一个高性能的桌面环境，它提供正确的工具集来最大限度地提高创造力和工作效率，而不会牺牲您的系统资源来获得一些令人眼花缭乱的无稽之谈。再说一次，少即是多……。它能让你集中精力！\n我们的团队有着相同的愿景，那就是利用一套正确的技术，使用业界公认的最佳实践和指导方针，以正确的方式构建正确的软件。我们的目标是提供始终如一、令人愉快的用户体验，这些用户体验建立在现代稳定的基础之上，但又具有灵活性。每一项好的、有用的技术都应该是面向未来的……这就是几十年来在构建经过战斗验证的任务关键型系统和高性能企业级应用程序方面的经验所在。如果它的架构设计得当，它就可以在不拆分的情况下发展起来。这就是几十年来构建久经考验的任务关键型系统和高性能企业级应用程序的用武之地。如果它的架构设计得当，它就可以在不拆分的情况下发展。\nMaxx Desktop的典型用户有：2D/3D计算机图形艺术家、电影和特效工作室、软件/游戏开发人员、可视化/仿真、虚拟现实高级用户或石油和天然气研究等。Maxx Desktop也适合那些想要在每天驾驶酷炫司机的同时创作东西的人！然后，Maxx Desktop也适合你！\n此站点由BookStack(一种维基引擎)提供支持，您可以使用右上角的货架和图书链接进行导航。您可以使用顶部的搜索栏或下面的便捷链接进行导航。", "note_en": "Yes the MaXX Interactive Desktop is the little brother of the great SGI Desktop on IRIX!\n      The MaXX Interactive Desktop a.k.a.  MaXX Desktop or MID is the continuation of the 5dwm.org project released many years back.   BTW, the 5dwm.org website is not associated with us anymore and we do not endorse its content, although it&#39;s ours and was miss-appropriated from us a few years ago.  Back to our regular program :)  So don&#39;t be mistaken, there is only one other real implementation of the IRIX Interactive Desktop(IID) and  it&#39;s MaXX Desktop!\n       Our mission is to bring back this great user experience which focused on performance, stability and productivity while sporting a smooth-clean-minimalism look and feel  with low-resources consumption. A smart desktop that puts the user&#39;s application in the forefront.    More for you creativity!\n  So there is no surprises here, MaXX Desktop is a highly tuned Workstation Environment which can leverage  multi-core  workload processing, robust asynchronous multi-threaded POSIX Messaging, hardware acceleration and GPU specific optimizations that  makes the MaXX Desktop so fast, light-weight and dependable.\n  MaXX Desktop is a true re-implementation of the SGI Desktop while respecting the classic/retro SGI look and feel (which is very important for us to get it right), but also to expand and build on top of those solid foundations with a more modern user experience.  See it as the  classic or  original  look and feel of the desktop and a new  modern take.  We want the modern look to be/feel like a natural evolution of the classic SGI look, as if SGI did it themselves throughout several years perfecting an already pretty awesome recipe.   The modern look still supports SGI Color Schemes and introduce UTF-8 support, anti-aliased font rendering, more hardware acceleration and a new virtual-desktop manager.\n  We believe in a High Performance Desktop Environment that provides the right set of tools to maximize creativity and productivity without sacrificing  your system resources to some eye candy non-sense.    Again, less is more... And it keeps you focused!\n    Our team is sharing the same vision of making use of the right set of technologies, using industry proven best practices and guide lines to build the right software, the right way.  We aim at providing a consistent and pleasant user experience built on top of modern and stable foundations but yet flexible.  Every good and useful piece of tech deserves to be future-proof...  This is where  several decades of experience in building battle-proven mission critical systems and high performance Enterprise class applications comes in.  If it&#39;s architect-ed properly,  it can evolve without breaking apart!\n    MaXX Desktop&#39;s typical users are: 2D/3D Computer Graphics Artists, Motion Pictures and Special Effects Studios, Software/Game Developers, Visualization/Simulation, Virtual Reality power-users or Oil and Gas research to name a few.  MaXX Desktop is also for anyone who wants to create stuff while sporting a very cool daily driver!    Then, MaXX  is for you too!\n     This site is powered by   BookStack (a type of Wiki engine) and you can navigate it by using the upper-right links &#39;Shelves and Books&#39;.  You may use the search bar on top or the convenient links below.", "posttime": "2020-07-04 20:40:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "interactive,桌面", "title": "欢迎使用Maxx Interactive Desktop", "title_en": "Welcome to MaXX Interactive Desktop", "transed": 1, "url": "https://maxxinteractive.com/books/misc/page/welcome-to-maxx-interactive-desktop", "via": "", "real_tags": ["桌面"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下是Maxx Interactive Desktop成为伟大IRIX Interactive Desktop的真正继任者的详细说明，它只能在SGI系统上找到，而不仅仅是现有窗口管理器上的主题或皮肤。根据下面的详细信息，您将认识到实现真正的IRIX交互式桌面体验并继续其发展所需的程度，就像SGI仍在运营一样。\n任何SGI系统的核心都是IRIX操作系统，即IRIX交互式桌面(又名IRIX Interactive Desktop)。IID及其4Dwm窗口管理器，它是Motif™窗口管理器的增强版本。同样，Maxx Interactive Desktop位于操作系统之上，拥有自己的4Dwm兼容窗口管理器，称为5Dwm，并且基于OpenMotif窗口管理器。*5Dwm的开发早在2000年3月就开始了，完全是埃里克·马森在业余时间做的。5Dwm提供与4Dwm相同的用户体验，甚至与4Dwm支持文件和配置兼容。5Dwm是精简、快速和反应超灵敏的。它支持多屏幕，HiDPI分辨率，UTF-8，如果用户需要，可以使用FreeType字体呈现清晰的文本。\n独特的SGI外观由SGI方案提供支持，在Maxx Desktop之前，它仅特定于SGI系统。SGI方案基于X11资源机制，允许在整个用户体验中定义标准化的颜色、大小、字体和其他行为。这些设置会在启动时自动注入到每个X11/XT/Motif应用程序中。支持此注入所需的更改深入X Toolkit Intrinsics Library(LibXt)，因此需要我们自己的名为libXt-Maxx的libXt版本。我们甚至在实现中重用了IRIX方案文件。\n在SGI系统上找到的SGI-Motif库提供了比常规Motif更好+更流畅的外观和感觉。这导致了我们自己的SGI-Motif库版本2.1.32和2.3.8的创建，允许在大多数Linux发行版上插入二进制替换，而不会牺牲稳定性和兼容性。\nViewkit SGI Motif C++应用程序开发框架是许多商业™应用程序的核心，甚至是实际SGI Desktop的一部分。最初的计划是向ICS&#39；Viewkit提供™许可证(收费)，但遗憾的是，在新加坡政府投资公司宣布破产并多次试图重振公司之后，这一计划未能实现。ICS是一家非常酷的公司，我一直保持联系……“Enters ViewKlass”是一个从零开始的实现，最初由克里斯·托肖克编写，起源于“饥饿的ViewKit”项目。它的目标是最终实现与微软ViewKit™库的一个大子集兼容的源代码。“我们打算将ViewKlass扩展并带到现代计算时代，这是我们战略的重要组成部分。”\nMaxx Interactive Desktop在Linux系统上运行，展示了具有现代外观的ViewKlass。\n其他SGI技术，如Open Inventor和OpenGL Performer都是Maxx Interactive Desktop的一部分。*大部分代码来自oss.sgi.com(Open Inventor、OpenGL Performer和其他OSS项目)。", "note_en": "Here&#39;s the breakdown of what makes The MaXX Interactive Desktop a true successor of the great IRIX Interactive Desktop only found on SGI systems and not just a theme or skin on top of an existing window manager. As per the detail below, you will realize the extent of which it took to implement a true IRIX Interactive Desktop experience and to continue its evolution as if SGI was still in business...\n   At the heart of any SGI system is the  IRIX operating system, the  IRIX Interactive Desktop a.k.a.  IID and its  4Dwm window manager which was an enhanced version of Motif  ™window manager. Similarly the MaXX Interactive Desktop sits on top of the operating system, has its own 4Dwm compatible window manager called 5Dwm and is based on OpenMotif window manager.   The development of 5Dwm started as early as March 2000 and was entirely done by Eric Masson in his free time. 5Dwm provides an identical user experience to 4Dwm and is even compatible with 4Dwm support files and configuration.  5Dwm comes with its own  tellwm and  telldesktop command tools also found on IRIX.   5Dwm is lean, fast and ultra responsive. It supports multi-screens, HiDPI resolutions, UTF-8 and can use FreeType font rendering for crisp texts if the user desires.\n     The distinct  SGI look and feel is powered by SGI Schemes and it was specific to SGI systems only until the MaXX Desktop.  SGI Schemes are based on X11 Resources mechanism allowing the definition of standardized colors, sizes, fonts and other behaviors throughout the user experience. Those settings are auto-magically injected into every X11/Xt/Motif application at startup. The changes required to support this &#34;injection&#34; goes deep into the X Toolkit Intrinsics Library (libXt) and therefore required our own version of libXt called libXt-maxx.  BTW, this is how SGI did their own implementation and this is how we did it too. We even reuse the IRIX scheme files in our implementation.\n    The  SGI-Motif library found on SGI system offers a nicer+smoother look and feel than the regular Motif.  This lead to the creation of our own SGI-Motif libraries version 2.1.32 and 2.3.8 allowing a drop-in binary replacements on most Linux Distributions without sacrificing stability and compatibility.\n   The  Viewkit ™ Motif C++ application development framework is at the heart of many commercial SGI applications and even part of the actual SGI Desktop. The initial plan was to offer ICS&#39;s Viewkit  ™ license (for a fee) but sadly it failed to realized right after SGI declared bankruptcy and the several attempts to resurrect the company.  ICS is a really cool company and I keep contact...  Enters  ViewKlass, a from scratch implementation derived from the Hungry ViewKit project originally written by Chris Toshok. It aims eventually to be source code compatible with a large subset of SGI&#39;s ViewKit  ™ library.  We intend to extend and bring ViewKlass to the modern age of computing and is a big part of our strategy.\n  MaXX Interactive Desktop running on a Linux system demonstrating ViewKlass in modern look and feel.\n   Other SGI technologies like Open Inventor and OpenGL Performer are part of MaXX Interactive Desktop.  Most of the code came from oss.sgi.com (Open Inventor, OpenGL Performer and other OSS projects).", "posttime": "2020-07-04 20:40:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交互式,interactive,sgi", "title": "Maxx交互式桌面：IRIX交互式桌面的重新实现", "title_en": "MaXX Interactive Desktop: A Re-Implementation of the IRIX Interactive Desktop", "transed": 1, "url": "https://maxxinteractive.com/books/misc/page/not-just-a-theme", "via": "", "real_tags": ["交互式", "sgi"]}, {"category": "", "categoryclass": "", "imagename": "276d9f85913d6822bba0f3c6af5974d4.png", "infoid": 1009804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这段摘自1971年BBC电视节目“明日世界”(Tomorrow‘s World)的片段对我来说有很多吸引人的细节，其中最引人注目的是一辆可爱的1962年英国规格的大众甲壳虫(Volkswagen Beetle)，但它真正的明星是甲壳虫配备的极具前瞻性的导航系统。它使用了一些时代的尖端技术，但仍然相当简单，甚至看起来是有限的。让我们来看看这项奇妙但几乎被遗忘的技术。\n要想知道我到底在说什么，你可能应该自己看看这段视频：\n看看这个；它的操作方式非常类似于语音导航通过谷歌地图或苹果地图或任何其他方式的工作方式；司机根据汽车的具体位置获得关于下一步行动的语音指令-去哪里或转弯。这个有47年历史的系统不知何故在没有任何卫星或蜂窝通信，甚至没有真正的计算机的情况下做到了这一点。\n当然，它比现代GPS系统要有限得多，但在它的参数范围内，它真的很聪明。该系统的工作原理是将各个行程的驾驶指令记录在盒式磁带上--或者，主持人古怪地称之为“盒式磁带”。请记住，盒式磁带本身还是相当新的；卡式磁带播放机直到1964年左右才问世，仪表式汽车盒式磁带播放机直到1968年左右才广泛使用。\n仅仅播放某人告诉你驾驶指令的录音带是没有用的，甚至可能不如音乐，所以这里必须有其他组件。这就是事情变得非常有趣的地方。\n录音的口头指令也会播放不同长度的嘟嘟声。这些嘟嘟声的持续时间由仪表盘下的一个电子盒检测，嘟嘟声的长度被转换为汽车在播放下一条指令之前必须行驶多少英里。\n为了计算这一点，电子盒通过一种看起来像是物理/机械电缆的连接连接到汽车的里程表上，该电缆连接在盒内驱动基于齿轮的机械装置，允许将里程数记录在表格中，当里程数等于音调持续时间提供的值时，播放下一条指令。\n这是一个聪明的系统，盒子里的东西形成了我认为是一台简单的模拟计算机。它正在做的真正创新的事情是从盒式磁带中读取数据-这可能是第一批使用这样的标准盒式磁带来存储和读取计算机数据的例子之一，比这种做法在第一波家用计算机中变得普遍早了五六年。\n同样有趣的是，该系统如何处理轮胎大小的校准：本质上是通过一个弹药筒进行校准。将盒子配置为知道给定汽车轮胎尺寸(这会影响里程计算)的组件安装在一个小电路板上，电路板插在内部插槽中。你可以看到视频中使用的那辆车实际上被贴上了“V W房车”的标签：\n这一想法，一块盒式电路板，不是包含一个存储在ROM芯片中的程序，而是一系列跳线或其他组件，旨在改变主“程序”上的一些参数，也在同年出现在第一台家用视频游戏机Magnvox Odysey中。\n那么，让我们来看看这个原始导航系统能做些什么：根据你开车的距离，给你提供到选定地点的逐个转弯方向。这真的很好，真的。当然，如果你走弯路或者犯了一个错误，你就会筋疲力尽；如果系统有某种“暂停里程计数”或“返回最后一步并重新校准里程”按钮，这两个按钮似乎都是完全可能的。\n这玩意儿用相当有限的一套硬件就能做很多事情。我印象深刻。这就是为什么我还没有找出是谁制造了这件东西的事实如此令人抓狂；我想给某人或一些公司信任，但这个装置似乎是一个原型，没有提到或标记表明是谁或什么制造的。我无法确定那盒磁带上写的是什么。如果有人知道什么，我很想知道。\n高级编辑，Jalopnik·跑步：1973 VW Beetle，2006 Scion xB，1990 Nissan Pao，1991 Yugo GV Plus，2020 Changli EV·不太跑：1973 Reliant Scimitar，1977 Dodge Tioga RV(也请购买我的书！)", "note_en": "This clip from a 1971 episode of the BBC television show    Tomorrow’s World has so many appealing details to me, most notably the featuring of a lovely UK-spec 1962 Volkswagen Beetle, but the true star of it is the remarkably forward-thinking navigation system the Beetle is fitted with. It uses some cutting-edge technology of the era, yet is still quite simple, and it even seems to work, in a limited way. Let’s look at this wonderful and mostly forgotten bit of tech.\n    To know what the hell I’m going on about here, you should probably watch the clip for yourself:\n  Look at that; it operates an awful lot like how voice navigation works via Google Maps or Apple Maps or whatever; the driver gets voice instructions about their next, upcoming move—where to go or turn—based on the specific location of the car. This 47-year old system somehow manages to do this without any satellite or cellular communication or even a real computer.\n  Of course, it’s far, far more limited than modern GPS systems, but within its parameters, it’s really clever. The system works by having individual trip driving instructions recorded on cassette tape—or, as the host quaintly calls it, a “cassette of tape.” Keep in mind that cassettes themselves were still fairly new; cassette players didn’t come out until around 1964, and in-dash automotive cassette players weren’t widely available until about 1968.\n Just playing the cassette of someone telling you driving instructions would be pretty useless, and probably not even good as music, so there have to be other components here. This is where things get really interesting.\n    The taped verbal instructions also play beeps of varying lengths. The duration of these beeps is detected by a box of electronics under the dash, and the length of beep is translated into how many miles the car must travel until the next instruction is played.\n  To calculate this, the electronics box is connected to the car’s odometer via what looks to be a physical/mechanical cable connection that drives a gear-based mechanism inside the box, which allows the number of miles to be tabulated, and, when the number of miles equals the value provided by the tone duration, the next instruction is played.\n This is a clever system, and the contents of that box form what I think is a simple analog computer. The really innovative thins it’s doing here is reading  data from a cassette tape—this just might be one of the first examples of a standard cassette tape like this being used to store and read computer data, a good five or six years before the practice became common in the very first wave of home computers.\n  Also interesting is how the system handles calibration of tire sizes: via what is, essentially, a cartridge. Components that configure the box to know a given car’s tire size (which affects mileage calculations) are housed on a small circuit board, which is plugged into an internal slot. You can see the one used in the video is actually labeled “V W SALOON”:\n    This idea, a cartridge-like circuit board containing not a stored program in a ROM chip but a series of jumpers or other components designed to alter some parameters on a main “program” also shows up the same year in the first home videogame console, the Magnavox Odyssey.\n  So, let’s look at what this proto-nav system can do: give you turn-by-turn directions to a selected location based on the distance you’ve driven. That’s pretty good, really. Of course, if you take any detours or make a mistake, you’re pretty boned; it’d be good if the system had a sort of “pause mileage count” or “return to last step and re-calibrate mileage” buttons, both of which seem entirely possible.\n This thing does a lot with a pretty limited set of hardware. I’m impressed. That’s why the fact that I have yet to find out who made this thing is so maddening; I want to give someone or some company credit, but the unit seems to be a prototype, and there’s no mention or markings to suggest who or what made it. I can’t determine what’s written on that cassette. If anyone knows anything, I’d love to know.\n Senior Editor, Jalopnik • Running: 1973 VW Beetle, 2006 Scion xB, 1990 Nissan Pao, 1991 Yugo GV Plus, 2020 Changli EV • Not-so-running: 1973 Reliant Scimitar, 1977 Dodge Tioga RV (also, buy my book!)", "posttime": "2020-07-04 20:40:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "盒式磁带,tape", "title": "1971年以来的盒式磁带导航系统", "title_en": "Cassette tape-based navigation system from 1971", "transed": 1, "url": "https://jalopnik.com/this-cassette-tape-based-navigation-system-from-1971-is-1826459978", "via": "", "real_tags": ["盒式磁带", "tape"]}, {"category": "", "categoryclass": "", "imagename": "25a90e2d2729d09da80d411d53af3c9a.jpeg", "infoid": 1009802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在对许多骚扰和不当行为指控展开调查一周后，育碧首席执行官公布了该公司正在采取哪些措施来改变局面的最新情况。Yves Guillemot在其网站上发布并通过电子邮件发送给员工的一封信中表示，“我们最近了解到的那种不恰当的行为是不能也不会被容忍的。”\n这与员工的报告和内部发布的声明形成了鲜明对比，他们引用了过去向人力资源部提出的投诉，称这些投诉被忽视了。即使在今天，被吹捧为公司导师计划成功案例的切尔西·奥哈拉(Chelsea O‘Hara)也写了大量关于她在育碧工作的现实经历，在那里她感到被边缘化和被剥削。\n育碧表示，除了正在进行的调查外，它还建立了一个在线机密警报平台，人们可以在这个平台上举报骚扰或其他不当行为，这是由第三方运营的。Guillemot还表示，他们将改组负责监督创意决策的编辑小组，Kotaku指出，该小组的花名册完全由白人男性组成。\n否则，育碧将增加一名多样性和包容性主管，直接向首席执行官汇报，项目总监Lidwin Sauer已被重新任命为职场文化主管，她将“检查我们公司文化的方方面面”，并提出改革建议。其他变化包括进一步审查其政策，举行一系列听证会议，并进行全球调查，以帮助确定需要解决的其他领域。", "note_en": "A week after launching investigations into many claims of harassment and misconduct, Ubisoft’s CEO gave an update on what the company is doing to change things. In a letter posted on its website and emailed to employees, Yves Guillemot said “the types of inappropriate behavior we have recently learned about cannot and will not be tolerated.”\n That’s sharply in contrast to reports from employees and statements posted internally, citing complaints made to HR in the past that they said have been ignored. Even today, Chelsea O’Hara, touted as a success story of the company’s mentorship program,  wrote extensively about the reality of her experience at Ubisoft where she felt marginalized and exploited.\n  Beyond the ongoing investigations, Ubisoft says it has set up an online confidential alert platform where people can report harrasment or other inappropriate behavior, that’s run by a third party. Guillemot also said they will shake up the Editorial Group that oversees creative decisions, which   Kotaku notes has a roster made up exclusively of white males.\n Otherwise, Ubisoft is adding a Head of Diversity and Inclusion that reports directly to the CEO, and Projects Director Lidwine Sauer has been reassigned as the Head of Workplace Culture where she will “examine all aspects of our company’s culture” and suggest changes. Other changes include further review of its policies, a series of listening sessions and a global survey to help identify other areas that need to be addressed.", "posttime": "2020-07-04 20:04:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "育碧,首席,ceo", "title": "育碧首席执行官制定计划改变公司的有毒文化", "title_en": "Ubisoft CEO Lays Out a Plan To Change the Company's Toxic Culture", "transed": 1, "url": "https://www.engadget.com/ubisoft-sexual-harassment-yves-guillemot-013025034.html", "via": "", "real_tags": ["育碧", "首席", "ceo"]}, {"category": "", "categoryclass": "", "imagename": "4860c2eb40d64c3a9c669860a9c225a6.jpeg", "infoid": 1009801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注意：仅用于测试目的，请勿针对生产执行，鲁莽使用会导致问题。\n免责声明：本软件按原样提供，与您的数据库无关。使用风险自负。", "note_en": "ATTENTION: Use only for testing purposes, don&#39;t execute against production, reckless usage will cause problems.\n DISCLAIMER: THIS SOFTWARE PROVIDED AS-IS WITH NO CARES AND GUARANTEES RELATED TO YOU DATABASES. USE AT YOUR OWN RISK.", "posttime": "2020-07-04 19:45:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,负载,workload", "title": "PostgreSQL有害工作负载生成器", "title_en": "Harmful Workload Generator for PostgreSQL", "transed": 1, "url": "https://github.com/lesovsky/noisia", "via": "", "real_tags": ["负载", "workload"]}, {"category": "", "categoryclass": "", "imagename": "8afd141fbc81c9593e41ccc0b61c3d13.png", "infoid": 1009800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章中，我们将设计一个破玻璃程序，以便在紧急情况下使用可以离线存储的安全密钥联系SSH主机。这只是一种方法，但您可以根据您的情况进行调整。我们将在硬件安全密钥上存储脱机SSH证书颁发机构，并让我们的主机信任该CA。这几乎可以在任何OpenSSH设置上工作，包括我们的单点登录SSH。\n你为什么想要这个？只是作为最后的选择。一个后门进入您的服务器，无论出于什么原因，其他东西都不起作用。\n被动撤销。证书过期；公钥不过期。您可以创建有效期为1分钟甚至5秒的SSH证书。一旦过期，证书将无法用于新连接。这非常适合偶尔进行紧急访问。\n您将能够为主机上的任何帐户创建证书，并根据需要将短期证书发送给同事。\n支持驻留密钥的硬件安全密钥。驻留密钥是完全存储在安全密钥上的加密密钥-有时受字母数字PIN保护。驻留密钥的公共部分可以在需要时与私钥句柄一起从安全密钥导出。Yubikey 5系列密钥支持常驻密钥。最好将这些密钥专用于紧急主机访问。在这篇文章中，我将只使用一个密钥，但是您应该有一个备用密钥。\n在本地计算机和要紧急访问的服务器上安装OpenSSH 8.2或更高版本。Ubuntu20.04附带OpenSSH8.2。\n(可选)检查证书的步骤CLI-在MacOS上使用BREW安装步骤进行安装(此处有Linux安装说明)。\n对于注释(-C)，我提供了Yubikey-9-512-742@mall step.com来提醒我该CA引用的是哪个安全密钥(在Yubikey上，序列号打印在密钥本身上)。\n除了将密钥添加到Yubikey之外，这还将在本地生成两个文件：\n但别担心，Yubikey上存储着另一个无法提取的真正的私钥。\n作为主机上的root用户，如果您还没有sshd配置(/etc/ssh/sshd_config)，请将其添加到sshd配置中：\n然后，将CA公钥(sk-user-ca.pub)的内容附加到主机上的/etc/ssh/ca.pub。\n现在我们可以尝试访问主机了。但是我们首先需要一张证书！\n人们很容易将SSH证书视为公钥/私钥对的替代品，但仅有证书并不足以对用户进行身份验证。每个SSH证书还具有与其关联的专用密钥。这就是我们在给自己颁发证书之前需要生成这个紧急密钥对的原因。重要的是向服务器提供了一个签名证书，该证书指向您拥有私钥的密钥对。我们实际上不需要Emergency.pub来运行这些命令中的任何一个，但是无论如何，我们都可以从ssh-keygen获得一个。\n因此，即使有证书，公钥交换仍然有效。证书只是消除了服务器存储公钥的需要。\n现在创建证书本身；它将允许用户ubuntu在5分钟前开始的10分钟窗口内登录(以解决时钟偏差问题)。您可以根据需要更改这些值。\n紧急证书pub类型：ecdsa-sha2-nistp256-cert-v01@openssh.com用户证书公钥：ecsa-cert SHA256:EJSfzfQv1UK44/LOKhBbuh5oRMqxXGBSr+UAzA7cork签名CA：sk-ecdsa SHA256:kLJ7xfTTPQN0G/IF2cq5TB3EitaV4k3XczcBZcLPQ0E密钥ID：&#34；测试密钥&#34；序列号：0有效期：2020-06-24T16：53：03至2020-06-24T16：03：03主体：ubuntu关键选项：(无)扩展：允许-x11-转发许可-代理-转发。\n这里，公钥是您创建的紧急密钥，签名CA是sk-user-ca。\n就是这样！🥳您现在可以为信任您的紧急证书颁发机构的主机上的任何用户创建ssh证书。\n您现在可以删除紧急情况*。您可以保留sk-user-ca*，但不需要这样做，因为它也驻留在安全密钥上。您可能还希望从主机中删除原始的PEM公钥(例如，在ubuntu用户的~/.ssh/AuthorizedKEYS中)，如果您一直在使用它进行紧急访问的话。\n为任何用户创建有效期为一小时或更短时间的证书(如果需要)：\n$ssh-keygen-t ecdsa-f紧急$ssh-keygen-us sk-user-ca.pub-i test-key-n[用户名]-V-5M：+60M紧急$chmod 600紧急-cert.pub。\n如果现有的.ssh/config文件在连接时导致任何问题，您可以运行ssh并使用-F NONE来绕过它。\n如果您需要向同事发送证书，Magic Wormhole是一个简单而安全的选择。他们唯一需要的文件就是紧急情况和紧急情况-cert.pub。\n我喜欢这种方法的原因是它的硬件是有后盾的。你可以把安全钥匙放在保险箱里，除非你需要它们，否则它们哪儿也不会去。", "note_en": "In this post we&#39;ll design a  break glass procedure for reaching SSH hosts in an emergency, using security keys that you can store offline. This is just one approach, but you can adapt it to your circumstances. We will store an offline SSH Certificate Authority on a hardware security key, and have our hosts trust that CA. This will work on pretty much any OpenSSH setup, including our  single sign-on SSH.\n Why would you want this? Only as an option of last resort. A backdoor into your servers when, for whatever reason, nothing else works.\n  Passive revocation. Certificates expire; public keys don&#39;t. You can mint an SSH certificate valid for 1 minute, or even 5 seconds. Once it expires, the certificate will become unusable for new connections. This is perfect for occasional emergency access.\n You&#39;ll be able to create a certificate for  any account on your hosts and send short-lived certificates to colleagues as needed.\n  Hardware security keys that support  resident keys. Resident keys are crypto keys that are stored completely on the security key—sometimes protected by an alphanumeric PIN. The public part of a resident key can be exported from the security key when needed, along with a private  key handle. The Yubikey 5 series keys support resident keys. Preferably, you&#39;ll dedicate these keys to emergency host access only. For this post I&#39;ll just use one key, but you should have an extra for backup.\n  OpenSSH 8.2 or higher on your local machine and on the servers you want emergency access to. Ubuntu 20.04 ships with OpenSSH 8.2.\n (optional) The  step CLI to inspect certificates — install it with  brew install step on MacOS ( Linux install instructions are here)\n  For the comment ( -C), I supplied  yubikey-9-512-742@smallstep.com to remind me which security key this CA refers to (on Yubikeys, the serial number is printed on the key itself).\n In addition to adding a key to the Yubikey, this will generate two files locally:\n  But don&#39;t worry, there&#39;s another  really private key stored on the Yubikey, that cannot be extracted.\n As  root on your hosts, add the following to your SSHD config ( /etc/ssh/sshd_config) if you don&#39;t already have it:\n  Then, append the contents of your CA public key ( sk-user-ca.pub) to  /etc/ssh/ca.pub on the host.\n   Now we can try accessing the host. But we&#39;re going to need a certificate first!\n   It&#39;s tempting to think of an SSH certificate as a replacement for a public/private key pair.But a certificate alone is not enough to authenticate a user. Every SSH certificate also has aprivate key associated with it. That&#39;s why we need to generate this  emergency key pairbefore we issue ourselves a certificate. What matters is that a signed certificate ispresented to the server, pointing to a key pair for which you have the private key.We don&#39;t actually need  emergency.pub to run any of these commands, but we get onefrom  ssh-keygen anyway.\n So, public key exchange is still alive and well, even with certificates. Certificates justeliminate the need for the server to store public keys.\n Now create the certificate itself; it will allow logins within a 10 minute window that started 5 minutes ago (to account for clock skew), for the user  ubuntu. You can change these values as needed.\n         emergency-cert.pub Type: ecdsa-sha2-nistp256-cert-v01@openssh.com user certificate Public key: ECDSA-CERT SHA256:EJSfzfQv1UK44/LOKhBbuh5oRMqxXGBSr+UAzA7cork Signing CA: SK-ECDSA SHA256:kLJ7xfTTPQN0G/IF2cq5TB3EitaV4k3XczcBZcLPQ0E Key ID: &#34;test-key&#34; Serial: 0 Valid: from 2020-06-24T16:53:03 to 2020-06-24T16:03:03 Principals: ubuntu Critical Options: (none) Extensions: permit-X11-forwarding permit-agent-forwarding permit-port-forwarding permit-pty permit-user-rc\n Here, the public key is the  emergencey key you created, and the signing CA is  sk-user-ca.\n   That&#39;s it! 🥳 You can now create SSH certificates for  any user on a host that trusts your emergency Certificate Authority.\n You can now delete  emergency*. You can keep  sk-user-ca* around, but you don&#39;t need to because it also resides on the security key.You may also want to remove the original PEM public key from your hosts (eg. in  ~/.ssh/authorized_keys for the  ubuntu user), if you have been using that for emergency access.\n        Create a certificate for any user that will last an hour—or less, if you want:\n $ ssh-keygen -t ecdsa -f emergency$ ssh-keygen -Us sk-user-ca.pub -I test-key -n [username] -V -5m:+60m emergency$ chmod 600 emergency-cert.pub\n   If your existing  .ssh/config file causes any trouble when connecting, you can run ssh with  -F none to bypass it.\n If you need to  send a certificate to a colleague,  Magic Wormhole is a simple and secure option. The only files they&#39;ll need are  emergency and  emergency-cert.pub.\n What I love about this approach is that it&#39;s hardware backed. You can put the security keys in a safe, and they aren&#39;t going anywhere until you need them.", "posttime": "2020-07-04 19:45:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ssh,emergency,密钥", "title": "SSH紧急访问", "title_en": "SSH Emergency Access", "transed": 1, "url": "https://smallstep.com/blog/ssh-emergency-access/", "via": "", "real_tags": ["ssh", "emergency", "密钥"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正在进行分析此漏洞当前正在进行分析，并不是所有信息都可用。请立即返回查看完整的漏洞摘要。\nPuTTY 0.68到0.73之间存在可观察到的差异，导致算法协商中的信息泄漏。这使得中间人攻击者能够瞄准初始连接尝试(客户端没有缓存服务器的主机密钥)。\nCVSS 3.x严重性和度量：NVD分析师使用公开可用的信息将向量字符串与CVSS分数相关联。我们还会显示CNA的CVE列表中提供的任何CVSS信息。注意：NVD分析师目前尚未发布此CVE的CVSS分数。NVD分析师在分析时使用公开可用的信息来关联CVSS矢量字符串。\nCVSS 2.0严重性和度量：NVD分析师使用公开可用的信息将向量字符串与CVSS分数相关联。我们还会显示CNA的CVE列表中提供的任何CVSS信息。注意：NVD分析师目前尚未发布此CVE的CVSS分数。NVD分析师在分析时使用公开可用的信息来关联CVSS矢量字符串。\n通过选择这些链接，您将离开NIST网站空间。我们提供了这些指向其他网站的链接，因为它们可能包含您感兴趣的信息。不应从本页引用或不引用其他站点的情况下得出任何推论。可能还有其他网站更适合您的目的。NIST不一定认可这些网站上表达的观点，或同意这些网站上提出的事实。此外，NIST不支持任何可能在这些网站上提及的商业产品。请将有关此页面的意见发送至nvd@nist.gov。", "note_en": "Undergoing Analysis    This vulnerability is currently undergoing analysis and not all information is available. Please check back soon to view the completed vulnerability summary.\n    PuTTY 0.68 through 0.73 has an Observable Discrepancy leading to an information leak in the algorithm negotiation. This allows man-in-the-middle attackers to target initial connection attempts (where no host key for the server has been cached by the client).\n   CVSS 3.x Severity and Metrics:    NVD Analysts use publicly available information to associate vector strings and CVSS scores. We also display any CVSS information provided within the CVE List from the CNA.   Note: NVD Analysts have not published a CVSS score for this CVE at this time. NVD Analysts use publicly available information at the time of analysis to associate CVSS vector strings.\n  CVSS 2.0 Severity and Metrics:        NVD Analysts use publicly available information to associate vector strings and CVSS scores. We also display any CVSS information provided within the CVE List from the CNA.   Note: NVD Analysts have not published a CVSS score for this CVE at this time. NVD Analysts use publicly available information at the time of analysis to associate CVSS vector strings.\n  By selecting these links, you will be leaving NIST webspace.\r\t\t\t\t\t\t\t\t\t\t\tWe have provided these links to other web sites because they\r\t\t\t\t\t\t\t\t\t\t\tmay have information that would be of interest to you. No\r\t\t\t\t\t\t\t\t\t\t\tinferences should be drawn on account of other sites being\r\t\t\t\t\t\t\t\t\t\t\treferenced, or not, from this page. There may be other web\r\t\t\t\t\t\t\t\t\t\t\tsites that are more appropriate for your purpose. NIST does\r\t\t\t\t\t\t\t\t\t\t\tnot necessarily endorse the views expressed, or concur with\r\t\t\t\t\t\t\t\t\t\t\tthe facts presented on these sites. Further, NIST does not\r\t\t\t\t\t\t\t\t\t\t\tendorse any commercial products that may be mentioned on\r\t\t\t\t\t\t\t\t\t\t\tthese sites. Please address comments about this page to  nvd@nist.gov.", "posttime": "2020-07-04 19:44:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,观察,observable,cvss", "title": "PuTTY：可观察到的差异导致算法协商中的泄漏", "title_en": "PuTTY: Observable Discrepancy leading to a leak in the algorithm negotiation", "transed": 1, "url": "https://nvd.nist.gov/vuln/detail/CVE-2020-14002", "via": "", "real_tags": ["算法", "观察", "cvss"]}, {"category": "", "categoryclass": "", "imagename": "5732702e7aaabfadfbf7c9f935db83c4.jpg", "infoid": 1009798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着数万亿美元在世界各地印制，是时候让我们来看看货币是如何创造的了。(我不得不删掉最后的喜剧部分)--.", "note_en": "With trillions of dollars being printed around the world, it's time we take a look into how money is created. (I had to cut the comedy section at the end) --...", "posttime": "2020-07-04 19:44:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创造,money,印制", "title": "钱是怎么创造的？-你需要知道的一切", "title_en": "How Is Money Created? – Everything You Need to Know", "transed": 1, "url": "https://www.youtube.com/watch?v=mzoX7zEZ6h4", "via": "", "real_tags": ["创造", "money", "印制"]}]