[{"category": "", "categoryclass": "", "imagename": "96dbf4e0ec5ae30f4059f4962e8c38d6.png", "infoid": 1066509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，微软和Bethesda确认，星际域将在明年完全来到Xbox系列X / S和PC。虽然这种独家交易被微软自微软自获暗示和重视许多人的暗示和严重疑问。Subs公司的母公司，该公告仍然是PlayStation 5个业主希望发挥即将发挥的悲伤新闻空间史诗。 Bethesda营销和通信Pete Hines高级副总裁表示，他肯定可以了解PS5业主必须感受到的。在周三与GameSpot的视频采访中，他向PS5业主提供了同情和道歉，对此移动感到不满。\n ＆＃34;我不知道如何淘汰消费者和Playstation 5球迷的担忧，除了说i＆＃39; Ma Playstation 5玩家也是＆＃39;在那个控制台和那里的游戏玩游戏39; S＆＃39; M继续播放它，＆＃34; Hines说。 ＆＃34;但如果你想玩Starfield [它＆＃39; s] xbox和pc。对不起。我只能说的是，我道歉，因为我敢于对人们令人沮丧，但是在那里令人沮丧，但是在那里，我不是一个整个我能做的。＆＃34;\n  与此同时，Hines似乎表明Xbox Cloud Gaming可以为Don＆＃39; T有一个Xbox或游戏PC来通过＆＃34访问Starfield的玩家提供一种方法。＆＃34; Hines提到了Xbox首席菲尔斯宾塞＆＃34;谈到了它们如何展开展开，我们希望扩展到......希望将Xbox游戏带到Don＆＃39; t拥有s或x甚至a的人PC但想玩我们＆＃39;重新带到游戏通行证。＆＃34; ＆＃39;最近宣布的宣布计划将Xbox Cloud Gaming扩展到许多智能电视和通用Web浏览器，如Chrome，Safari和Edge等Xbox Cloud Gaming。\n    Hines还表示Starfield＆＃39; S的排他性可以帮助其开发人员专注于游戏体验，而不是与其他平台的兼容性。 ＆＃34;我在这里告诉你，任何[开发人员]会告诉你这个，[当]你去更少的平台，你的发展变得更加精简，＆＃34;他说。 ＆＃34;您＆＃39;重新担心，＆＃39;嗯，这盒子如何与该框之间的工作如何...＆＃39;我们＆＃39;重新在该盒子上，所以它只需要在PC上的[和]上运行。狭隘的焦点总是有助于...＆＃34;\n    那个陈述呼应评论Bethesda Producer Todd霍华德本周在他说＆＃34的时候向电报罗德·霍华德致敬对于那些系统。＆＃34;\n 在那次采访中，霍华德也说他有＆＃34;一点点＆＃34;关于没有PS5版的Starfield的预订。 ＆＃34;你永远不想把人留出去，吧？＆＃34;但霍华德还建议Xbox云游戏手段＆＃34;我们看到它实际上越来越开放，使人们能够通过游戏通行证和其他事情 - 他们玩游戏的能力不会去下。它急剧上升......我只想说我希望每个人都有能力以某种方式扮演它。＆＃34;\n  10月回到10月，霍华德说这是＆＃34;很难想象＆＃34;像即将推出的过长的滚动仪一样，vi是Microsoft＆＃39的平台。但是，在微软之前，在3月份最终确定了Bethesda的收购之前，霍华德录取了两家公司Hadn＆＃39; T完全讨论了任何多平台发布协议的细节。 ＆＃34;我们已经完成了所有这些，诚实，＆＃34;他当时说。 ", "note_en": "This week, Microsoft and Bethesda confirmed that  Starfield will be  coming exclusively to Xbox Series X/S and PC next year. And while that kind of exclusivity deal had been  hinted at and  heavily suspected by many since  Microsoft&#39;s $7.5 billion acquisition of Bethesda&#39;s parent company, the announcement still came as sad news for PlayStation 5 owners hoping to play  the upcoming space epic. Bethesda Senior Vice President of Marketing and Communications Pete Hines said he can certainly understand how PS5 owners must feel. In  a video interview with GameSpot Wednesday, he offered his sympathy and an apology to PS5 owners upset about the move.\n &#34;I don&#39;t know how to allay the concerns of consumer and PlayStation 5 fans other than to say I&#39;m a PlayStation 5 player as well and I&#39;ve played games on that console and there&#39;s games I&#39;m going to continue to play on it,&#34; Hines said. &#34;But if you want to play  Starfield [it&#39;s] Xbox and PC. Sorry. All I can say is I apologize because I&#39;m certain that that&#39;s frustrating to folks, but there&#39;s not a whole lot I can do about it.&#34;\n  At the same time, Hines seemed to suggest that Xbox Cloud Gaming could provide a way for players who don&#39;t have an Xbox or a gaming PC to access  Starfield through the &#34;Xbox ecosystem.&#34; Hines mentioned that Xbox chief Phil Spencer &#34;has talked about how they&#39;re looking to expand that and... looking to bring Xbox games to folks who don&#39;t own a Series S or X or even a PC but want to play the games that we&#39;re bringing to Game Pass.&#34; That&#39;s an apparent reference to  Microsoft&#39;s recently announced plans to expand Xbox Cloud Gaming to many Smart TVs and generic web browsers like Chrome, Safari, and Edge.\n    Hines also said  Starfield&#39;s exclusivity could help its developers focus on the gameplay experience rather than compatibility with additional platforms. &#34;I&#39;m here to tell you, and any [developer] will tell you this, [when] you go to fewer platforms, your development gets more streamlined,&#34; he said. &#34;You&#39;re not worrying about, &#39;Well, how does it work on this box versus how does it work on that box...&#39; We&#39;re not making it on that box, so it just needs to run as well as possible on this one [and] on a PC. A narrow focus always helps...&#34;\n    That statement echoes comments Bethesda producer Todd Howard  made to The Telegraph this week, when he said that &#34;by focusing on those platforms [Xbox and PC], you really get to lean in a lot on making it the best it can be for those systems.&#34;\n In that interview, Howard also said he had &#34;a little bit&#34; of reservation about not having a PS5 version of  Starfield. &#34;You don’t ever want to leave people out, right?&#34; But Howard also suggested that Xbox Cloud Gaming means &#34;we see it actually opening up more and more and more so that people’s ability to play our games—via Game Pass and other things—their ability to play our games doesn’t go down. It goes up dramatically... I will just say I want everybody to have the ability to play it in some fashion.&#34;\n  Back in October, Howard  said it was &#34;hard to imagine&#34; a game like the upcoming  Elder Scrolls VI being exclusive to Microsoft&#39;s platforms. But that was before Microsoft&#39;s acquisition of Bethesda was  finalized in March, at a time when Howard admitted the two companies hadn&#39;t fully discussed the details of any multiplatform publishing agreements. &#34;We haven&#39;t gone through all of that, to be honest,&#34; he said at the time.", "posttime": "2021-06-18 00:29:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "vp,xbox", "title": "Bethesda vp为Starfield缺席PS5提供道歉 ", "title_en": "Bethesda VP offers apology for Starfield’s absence on PS5", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/bethesda-vp-offers-apology-for-starfields-absence-on-ps5/", "via": "", "real_tags": ["vp", "xbox"]}, {"category": "", "categoryclass": "", "imagename": "5ac13ea09f2a094c69a891d482f9d85d.jpg", "infoid": 1066508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌声称Tau家族“跨越”现有云VM。该系统具有各种配置，每个VM高达60Vcpus，每个VCPU为4GB内存。网络带宽高达32 Gbps，它们可以与各种不同的网络连接存储器耦合。\n “各行业的客户正在处理更加苛刻和数据密集型的工作量，并寻找加速性能和降低成本的战略方式，”Google Cloud Ceo Thomas Kurian在新闻稿中表示。 “我们与AMD这样的关键战略合作伙伴的工作使我们能够拓宽我们的产品，并为客户提供最优惠的商业关键申请 - 所有在行业中最清洁的云端。”\n   谷歌已经签署了一些高调客户的早期试用，包括Twitter，Snap和Doit。\n “在正确的价格点的高性能是我们努力服务全球公共对话的关键考虑因素”Twitter Platform Lead Nick Tornow在博客文章中表示。 “我们被初始测试兴奋，显示了两位数性能改进的潜力。我们正在与Google Cloud进行合作，更深入地评估价格和性能的优惠，以便通过使用新的Tau VM系列来实现。“\n  TAU VMS将于今年第四季度到达谷歌云。该公司已将该系统开放到客户预先注册的客户。定价取决于配置。例如，32VCPU VM Sporting 128GB RAM将达到每小时1.35美元。 ", "note_en": "Google claims the Tau family “leapfrogs” existing cloud VMs. The systems come in a variety of configurations, ranging up to 60vCPUs per VM, and 4GB of memory per vCPU. Networking bandwidth goes up to 32 Gbps, and they can be coupled with a variety of different network attached storage.\n “Customers across every industry are dealing with more demanding and data-intensive workloads and looking for strategic ways to speed up performance and reduce costs,” Google Cloud CEO Thomas Kurian said in a press release.  “Our work with key strategic partners like AMD has allowed us to broaden our offerings and deliver customers the best price performance for compute-heavy, business-critical applications– all on the cleanest  cloud in the industry.”\n   Google has already signed up some high-profile customers for an early trial, including Twitter, Snap and DoIT.\n “High performance at the right price point is a critical consideration as we work to serve the global public conversation,” Twitter Platform Lead Nick Tornow said  in a blog post. “We are excited by initial tests that show potential for double digit performance improvement. We are collaborating with Google Cloud to more deeply evaluate benefits on price and performance for specific compute workloads that we can realize through use of the new Tau VM family.”\n  The Tau VMs will be arriving for Google Cloud in Q3 of this year. The company has already opened the system up to clients for pre-registration. Pricing is dependent on the configuration. For example, a 32vCPU VM sporting 128GB RAM will run around $1.35 an hour.", "posttime": "2021-06-18 00:29:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "虚拟机,google,谷歌,announces,客户", "title": "谷歌宣布基于EPYC的TAU虚拟机 ", "title_en": "\n\t\t\t\tGoogle announces EPYC-based Tau virtual machines for Cloud\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/google-announces-epyc-based-tau-virtual-machines-for-cloud/", "via": "", "real_tags": ["虚拟机", "google", "谷歌", "announces", "客户"]}, {"category": "", "categoryclass": "", "imagename": "0223f202b73879d152923092f3658ca8.jpg", "infoid": 1066507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因此，当新数据库提供障碍并重新定义企业时，这是出色的。\n Neo4j提供了一种以图形为中心的数据库和相关产品，今天宣布，它在由Eurazeo领导的F款项（FERaze）领导的F系列估值中筹集了3.25亿美元，其中来自字母的风险翼GV的额外资金。 Eurazeo董事总经理Nathalie Kornhoff-Brüls将加入公司的董事会。\n  这笔资金在历史上最具资助的数据库公司中制作了Neo4J，其中集体筹款Haul超过了半十一美元。对于比较，M​​ongoDB，纳斯达克交易，总共筹集了311万美元，总数在其首次公开募股前克里宁巴队筹码。与此同时，蟑螂蟑螂的名望现已筹集了3.55亿美元的资金，包括今年早些时多百万美元，估值同比为1.6亿美元。\n 过去十年已经看到了一系列新的下一代数据库模型，从Scale-out SQL到记录到键值存储到时间序列和打开和打开。像Neo4J唯一这样的图形数据库是他们关注各个数据实体之间的连接。基于图形的数据模型已成为现代机器学习和人工智能应用的核心，现在通过应用程序中的数据分析师广泛使用，作为销售到欺诈检测的营销。\n 首席执行官和联合创始人Emil Eifrem表示，在2007年建立回来的Neo4J近年来鉴于基于图形的分析的普及不断上升，近年来达到了增长步幅。 “我们在任何特定的月份积极建立了与Neo4j的应用程序的数十万名开发人员，但我们也有一个非常深刻的数据科学界。”\n 在过去，大多数业务分析都是基于关系数据库而建立的。然而，连接间的复杂性在任何地方都爬行，这就是Eifrem认为Neo4J的耐用边缘。作为一个例子，“任何船舶的公司都在跨越大陆的全球精细谷物网格，”他建议。 “突然突然船长在苏伊士运河中......睡着了，然后他们挡住了一周的苏伊士运河，然后你必须弄清楚这将如何影响我的企业，如何在整个整体上级联供应链。”使用图形模型，该分析是Cinch。\n Neo4J表示，800家企业是客户，75％的财富100是公司产品的用户。 \n我们在2020年推出了4.0次，我们最后在2020年签到了4.0，这提供了无限的缩放。今天，Neo4J有几种不同的口味。这是一个可以自托管或购买的数据库，或者作为云服务提供的云服务，它配给光环。这是数据存储人员。对于数据科学家来说，该公司提供Neo4J图数据科学库，这是一组用于分析图形数据的综合工具。该公司提供免费（或“社区”层），价格实惠的起始层和全面的企业定价选项，具体取决于需求。\n  开发继续在数据库上。今天早上在它的开发人员会议上，Neo4J在其中展示了它在2000亿个节点图上被称为“超级缩放技术”，它们之间的关系超过了一万亿的关系，展示了其工具在如此大的情况下如何提供“实时”查询规模。\n 卓越的骄傲，EIFREM表示，新的风险投资将用于继续向下递增“产品，产品，产品”，但强调了对公司至关重要的一些主要战略举措。首先，他希望继续深化公司与公共云提供商的伙伴关系。它已经与Google Cloud有一个深厚的关系（GV毕竟在这一轮的投资者），并希望继续与其他提供者建立关系。\n 它也看到了亚太地区区域兴趣的主要涨幅。 Eifrem表示，该公司最近在新加坡开设了办事处，以加速其在更广泛的IT市场销售。\n 总体而言，“我们认为图形可以是现代数据景观的重要组成部分。事实上，我们认为它可能是现代数据景观的最大部分。我认为，这一轮，发出明确的信号[那]我们要为它而来，“他说。\n Erik Nordlander和GV的Tom Hulme是该公司的领导者。此外，DTCP和Lightrock新投资和以前的投资者一个峰，Creandum和Greenbridge Partners加入了这一轮。 ", "note_en": "So it’s exceptional when a new database offering breaks through the barriers and redefines the enterprise.\n Neo4j, which offers a graph-centric database and related products, announced today that it raised $325 million at a more than $2 billion valuation in a Series F deal led by Eurazeo, with additional capital from Alphabet’s venture wing GV. Eurazeo managing director Nathalie Kornhoff-Brüls will join the company’s board of directors.\n  That funding makes Neo4j among the most well-funded database companies in history, with a collective fundraise haul of more than half a billion dollars. For comparison, MongoDB, which trades on Nasdaq,  raised $311 million in total according to Crunchbase before its IPO. Meanwhile, Cockroach Labs of CockroachDB fame has  now raised $355 million in funding, including  a $160 million round earlier this year at a similar $2 billion valuation.\n The past decade has seen a whole new crop of next-generation database models, from scale-out SQL to document to key-value stores to time series and on and on and on. What makes graph databases like Neo4j unique is their focus on the connections between individual data entities. Graph-based data models have become central to modern machine learning and artificial intelligence applications, and are now widely used by data analysts in applications as diverse as marketing to fraud detection.\n CEO and co-founder Emil Eifrem said that Neo4j, which was founded back in 2007, has hit its growth stride in recent years given the rising popularity of graph-based analysis. “We have a deep developer community of hundreds of thousands of developers actively building applications with Neo4j in any given month, but we also have a really deep data science community,” he said.\n In the past, most business analysis was built on relational databases. Yet, inter-connected complexity is creeping in everywhere, and that’s where Eifrem believes Neo4j has a durable edge. As an example, “any company that ships stuff is tapping into this global fine-grain mesh spanning continent to continent,” he suggested. “All of a sudden the ship captain in the Suez Canal … falls asleep, and then they block the Suez Canal for a week, and then you’ve got to figure out how will this affect my enterprise, how does that cascade across my entire supply chain.” With a graph model, that analysis is a cinch.\n Neo4j says that 800 enterprises are customers and 75% of the Fortune 100 are users of the company’s products.\n We last checked in with the company in 2020 when it launched 4.0, which offered unlimited scaling. Today, Neo4j comes in a couple of different flavors. It’s a database that can be either self-hosted or purchased as a cloud service offering which it dubs Aura. That’s for the data storage folks. For the data scientists, the company offers Neo4j Graph Data Science Library, a set of comprehensive tools for analyzing graph data. The company offers free (or “community” tiers), affordable starting tiers and full-scale enterprise pricing options depending on needs.\n  Development continues on the database. This morning at its developers conference, Neo4j demonstrated what it dubbed its “super-scaling technology” on a 200 billion node graph with more than a trillion relationships between them, showing how its tools could offer “real-time” queries on such a large scale.\n Unsurprisingly, Eifrem said that the new venture funding will be used to continue doubling down on “product, product, product” but emphasized a few major strategic initiatives as critical for the company. First, he wants to continue to deepen the company’s partnerships with public cloud providers. It already has a deep relationship with Google Cloud (GV was an investor in this round after all), and hopes to continue building relationships with other providers.\n It’s also seeing a major uptick in interest from the APAC region. Eifrem said that the company recently opened up an office in Singapore to accelerate its sales in the broader IT market there.\n Overall, “We think that graphs can be a significant part of the modern data landscape. In fact, we believe it can be the  biggest part of the modern data landscape. And this round, I think, sends a clear signal [that] we’re going for it,” he said.\n Erik Nordlander and Tom Hulme of GV were the leads for that firm. In addition, DTCP and Lightrock newly invested and previous investors One Peak, Creandum, and Greenbridge Partners joined the round.", "posttime": "2021-06-18 00:29:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据分析,raises,数据", "title": "Neo4j为基于图形的数据分析占据了企业的数据分析，提出了Neo $ 325米 ", "title_en": "\n\t\t\t\tNeo4j raises Neo$325m as graph-based data analysis takes hold in enterprise\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/neo4j-series-f/", "via": "", "real_tags": ["数据分析", "raises", "数据"]}, {"category": "", "categoryclass": "", "imagename": "0003ba6d46152c7a4619befe691dc58a.jpg", "infoid": 1066506, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该计划的结构类似于Apple的App Store小型商业计划，在2020年代末宣布，苹果减少到15％的开发人员达到了100万美元的门槛，之后他们的标准率较高了30％。然后，此速度继续在次年进入。谷歌，最近，通过每年通过播放结算系统获得的前100万美元的开发人员收入将佣金降至15％略有不同的课程。\n 亚马逊的削减仍然大于20％，但这是因为它提供了开发人员一种不同类型的Perk：AWS学分。\n  该公司表示，在日历年度的Appstore收入中少于100万美元的开发商将获得其收入的10％，作为AWS服务的促销信贷。这包括基础设施技术，如Compute，Storage和Databases  - 新兴技术，例如机器学习和人工智能，数据湖泊和分析以及物联网，Notes Amazon。亚马逊表示，这使得总计划的福利高达90％的收入。\n 如果开发商的收入在本年度的收入超过100万美元，他们将恢复标准版税税率，并不再收到今年剩余时间的AWS学分。\n 如果开发商在未来年度的收入下降超过100万美元，他们将在下一个日历年内再次享受小型商业计划的资格。\n “通过帮助小企业通过学分开始，我们更轻松地建立和发展他们的应用程序业务，”亚马逊Appstore Director，Palanidaran Chidambaram，在一个公告中。 “AWS为开发人员提供了广泛的技术，因此他们可以更快地创新，并且几乎可以想象的任何东西，”他补充道。\n App Store委员会结构的变化是在科技巨头看到对其业务本质上的监管压力越来越大的，其中大型应用程序出版商，包括Basecamp，Spotify，Epic Games和其他人认为是反竞争的。史诗还可以在潜在的先例设定案例中使用App Store费用来起诉Apple。作为响应，苹果和谷歌降低了较小企业的费用作为善意的姿态 - 以及一个不会显着影响自己的应用商店平台收入。 \n亚马逊表示，新计划将在第4季度推出，并在此时提供有关如何参加的更多细节。 ", "note_en": "This program’s structure is similar to Apple’s App Store Small Business Program,  announced in late 2020, which reduced Apple’s cut to 15% for developers who earn up to a $1 million threshold, after which they’re moved to the higher 30% standard rate. This rate then continues as they enter the following year. Google, more recently, took  a slightly different course, by lowering the commissions to 15% on the first $1 million of developer revenue earned through the Play billing system each year.\n Amazon’s cut remains larger at 20%, but that’s because it’s offering developers a different type of perk: AWS credits.\n  The company says developers with less than $1 million in Appstore revenue in a calendar year will receive 10% of their revenue as promotional credit for AWS services. This includes infrastructure technologies like compute, storage, and databases–to emerging technologies, such as machine learning and artificial intelligence, data lakes and analytics, and Internet of Things, notes Amazon. This brings total program benefits up to an equivalent of 90 percent of revenue, Amazon says.\n If the developer’s revenue exceeds $1 million during the current year, they’ll revert to the standard royalty rate and no longer receive the AWS credits for the rest of the year.\n And if the developer’s revenue in a future year drops below $1 million, they’ll become eligible for the Small Business program again in the next calendar year.\n “By helping small businesses get started with AWS through credits, we are making it easier for them to build and grow their app businesses,” noted Amazon Appstore Director, Palanidaran Chidambaram, in an  announcement. “AWS gives developers easy access to a broad range of technologies so they can innovate faster and build nearly anything they can imagine,” he added.\n The changes to app store commission structures come at a time when tech giants are seeing increasing regulatory pressure over the nature of their businesses, which larger app publishers, including Basecamp, Spotify, Epic Games and others have  argued are anticompetitive. Epic is  also suing Apple over its app store fees, in a potentially precedent-setting case. In response, Apple and Google lowered fees for smaller businesses as a gesture of goodwill — and one that wouldn’t significantly impact their own app store platform revenues.\n Amazon says the new program will launch in Q4 2021, and more details about how to participate will be provided at that time.", "posttime": "2021-06-18 00:28:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,开发,降低,aws", "title": "亚马逊的Appstore降低了Small Business的开发人员收入，增加了AWS学分 ", "title_en": "\n\t\t\t\tAmazon’s Appstore lowers its cut of developer revenue for small businesses, adds AWS credits\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/amazons-appstore-lowers-its-cut-of-developer-revenue-for-small-businesses-adds-aws-credits/", "via": "", "real_tags": ["亚马逊", "amazon", "开发", "降低", "aws"]}, {"category": "", "categoryclass": "", "imagename": "509421dea42b58bcaf6bab12c6a499b6.jpg", "infoid": 1066504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lordstown Motors Insim Ceo Angela Strand和富裕的施密特总统在一系列的汽车新闻协会活动中发表了一系列陈述，该活动在公司开展了一股股份，包括从客户拥有足够的“约束订单”，以资助其电动拾取卡车的有限生产。到2022年5月。在执行康复后，这些评论仅仅是本公司首席执行官和首席财务官的辞职。\n 根据美国证券交易委员会提交的文档Lordstown，看来，这些似乎是租赁或购买的“绑定订单”更像是租赁或购买。该申请使Lordstown的股份造成超过4％。\n   为了澄清6月15日汽车新闻协会在线媒体活动的公司高管的最新评论，尽管这些车辆购买协议为我们提供了一项重要的需求指标，但这些协议不代表拟订采购订单或其他公司购买承诺。如前所述，截至2020年12月31日的截至2020年12月31日的截至2002年12月31日的第10 k / A形式，我们迄今为止，我们从事有限的营销活动，我们没有约束品购买订单或来自客户的承诺。\n 在SEC提出的情况下，销售和营销策略的一个重要方面涉及与专业富有舰队管理公司的关系。例如，在2021年3月，Lordstown宣布与霍尔曼企业的舰队管理联盟有达成协议。根据协议，ARI“将使用合理的努力，以促进其租赁客户的订单，以持续三年期间的持久性符合协议所规定的条款。”\n 该公司解释说，Lordstown还与其他专业富有习得和舰队管理公司签订了汽车购买协议。这可能听起来像一个绑定顺序，但是，因为SEC Doc中的以下语言更明确。\n “这些车辆购买协议一般包括预计买方订单计划，超过了该协议的3年至5年的生活，并可以为30天通知的任何一方终止，”来自Lordstown读的文件。 “他们不致力于购买车辆的交易对手，但我们认为他们为我们提供了一个重要的耐力需求指标。”\n 来自Lordstown的逆转只是新上市公司一系列问题的最新问题。 Lordstown Motors是现代首席执行官Steve Burns'其他公司，Workhors Group，这家电池集团的电池集团也是公开交易的。 Workhorse在Lordstown Motors拥有10％的股份。 Lordstown Motors与专用采集公司Diamondpeak Holdings Corp.合并后公开 \n3月份，寒宗堡研究，尼古拉电机的报告的截止卖家公司导致仲裁裁扣和创始人的辞职，表示，它在罗德斯敦电机上采取了短暂的职位，造成股票的股票21％。 Hindenburg在其短地位基于公司的时间内有“无收入，无销售产品，我们认为我们认为误导了投资者的需求和生产能力。”\n Hindenburg争议该公司已预订了100,000个电动拾取卡车的预订，这是一款由1月份的Lordstown Motors共享的统计数据。卖空卖方表示，“广泛的研究表明，该公司的订单主要出现了虚构，并用作筹集资金和合法性的道具。”该公司进一步走得进一步，并声称Lordstown创始人兼首席执行官Steve在2016年担任2016年时，他在主导的主教前后为每辆卡车预先订购了付费顾问。\n 两个月后，由于缺乏资金，守卫在第一季度盈利中报告了第一季度的盈利，这可能是一半 - 从大约2,200辆车到1,000  - 由于缺乏资金。 Hordstown Execs Tuesday的陈述似乎是一个尝试，它被退回到缓和投资者。 ", "note_en": "Lordstown Motors interim CEO Angela Strand and President Rich Schmidt made a series of statements Tuesday at an Automotive Press Association event that drove up shares in the company, including that it has enough “binding orders” from customers to fund limited production of its electric pickup truck through May 2022. Those comments came just a day after an executive shakeup that included the  resignation of the company’s CEO and CFO.\n It appears those “binding orders” were more like agreements to maybe lease or buy,  according to a document Lordstown filed with the U.S. Securities and Exchange Commission. The filing has caused shares of Lordstown to fall more than 4%.\n   To clarify recent remarks by company executives at the Automotive Press Association online media event on June 15, although these vehicle purchase agreements provide us with a significant indicator of demand for the Endurance, these agreements do not represent binding purchase orders or other firm purchase commitments. As previously disclosed in our Form 10-K/A for the year ended December 31, 2020, filed with the Securities and Exchange Commission on June 8, 2021, to date, we have engaged in limited marketing activities and we have no binding purchase orders or commitments from customers.\n Lordstown notes in the SEC filing that an important aspect of its sales and marketing strategy involves pursuing relationships with specialty upfitting and fleet management companies. For instance, in March 2021 Lordstown announced an agreement with ARI, a fleet management affiliate of Holman Enterprises. Under the agreement, ARI “would use reasonable efforts to facilitate orders from its leasing clients for the Endurance over a three-year time period on the terms set forth in the agreement.”\n Lordstown has also entered into vehicle purchase agreements with additional specialty upfitting and fleet management companies as a component of that strategy, the company explained. This might sound like a binding order, but it’s not,  as the following language in the SEC doc makes more clear.\n “These vehicle purchase agreements generally include a projected buyer order schedule over the 3- to 5-year life of the agreement, and may be terminated by either party at will on 30 days’ notice,” the filing from Lordstown reads. “They do not commit the counterparties to purchase vehicles, but we believe that they provide us with a significant indicator of demand for the Endurance.”\n The reversal from Lordstown is just the latest in a string of issues at the newly public company. Lordstown Motors is an offshoot of the now former CEO Steve Burns’ other company, Workhorse Group, a battery-electric transportation technology company that is also publicly traded. Workhorse holds a 10% stake in Lordstown Motors. Lordstown Motors went public after merging with special-purpose acquisition company DiamondPeak Holdings Corp.\n In March, Hindenburg Research, the short-seller firm whose report on Nikola Motor led to an SEC investigation and the resignation of its founder, said it had  taken a short position on Lordstown Motors, causing shares to plummet 21%. Hindenburg said at the time that its short position was based on a company has “no revenue and no sellable product, which we believe has misled investors on both its demand and production capabilities.”\n Hindenburg disputes that the company has booked 100,000 pre-orders for its electric pickup truck, a stat shared by Lordstown Motors in January. The short seller says that “extensive research reveals that the company’s orders appear largely fictitious and used as a prop to raise capital and confer legitimacy.” The firm goes further and alleges that Lordstown founder and CEO Steve Burns paid consultants for every truck pre-order as early as 2016 while he was leading Workhorse.\n Two months later, Lordstown reported in its first-quarter earnings that production volumes of the Endurance would likely be half — from around 2,200 vehicles to just 1,000 — due to a lack of funding. The statements made by Lordstown execs Tuesday appeared to be an attempt, which backfired, to assuage investors.", "posttime": "2021-06-18 00:28:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "motors", "title": "Lordstown Motors逆转电动拾取卡车关于“装订订单”的声明 ", "title_en": "\n\t\t\t\tLordstown Motors reverses claims about “binding orders” for electric pickup truck\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/lordstown-motors-reverses-claims-about-binding-orders-for-electric-pickup-truck/", "via": "", "real_tags": ["motors"]}]