[{"category": "", "categoryclass": "", "imagename": "0e0de3f00807be4a0c7d4e040dd46d7f.jpg", "infoid": 1011068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周三，Google宣布了一项新的开源计划--Open use Commons，这是一种开源商标的管理项目。此举立即招致IBM的批评，该公司声称对Istio感兴趣，Istio是谷歌在发布时向OUC提供的三个项目之一。\n在我们真正了解IBM的问题之前，我们首先需要花一些时间调查开放使用共享空间到底想做些什么。来自其自身的常见问题解答：\nOpen Usage Commons为开源项目提供了一个中立、独立的项目商标之家，并在一致性测试、建立标记使用指南以及处理项目遇到的商标使用问题方面提供帮助。\nOpen Usage Commons不提供超出使用范围的服务，例如技术指导、社区管理、项目活动或项目营销。\n在某些方面，这听起来像是开放源码剧本中的一个标准项目：建立一个中立的管理机构，让所有人都可以自由使用。但到目前为止，商标在很大程度上是开源项目一直保留着的一件事，而且有很好的理由-玷污项目的品牌以难以或不可能修复的方式损害项目本身。\nIBM旗下的Red Hat本身就是世界上最大的开源公司之一，它的Red Hat Enterprise Linux是一个有趣的案例研究。RHEL的所有源代码都是开源的，可以免费下载、复制和重用。如果你想从自己的源代码构建整个操作系统并将其作为自己的源代码分发，你可以这样做--但有一件事你是不能做的，那就是叫它Red Hat Linux。\nDebian Linux与Mozilla在Firefox徽标上长达十年的口角是开放代码和专有商标之间冲突的另一个有趣的例子。简而言之，Mozilla保留了Firefox徽标的全部版权-这给Debian带来了一个问题，因为Debian的政策不允许重新分发非免费的知识产权。所以Debian删除了徽标，但浏览器保持完好-导致Mozilla拒绝项目许可，不允许在生成的版本中使用Firefox名称。与此同时，Debian简单地将其内部版本重新命名为Iceweasel&34；。\n不过，很容易理解为什么一个开放源码项目会想要保护它的商标。如果你不保护你的商标，没有什么能阻止甲骨文公司决定创造一种完全不同的产品，叫做火狐，这充其量只会导致严重的混乱。\n到目前为止，很难看出谷歌试图在这里实现什么--品牌实际上是开源项目唯一需要保护的东西，这样做至关重要。那为什么要放弃呢？答案是再往下走几段：\n[C]希望提供这些项目的托管版本的公司.。可以投资于提供“项目即服务”，因为这是他们可以使用这个标志的保证；它不会在他们围绕它建立了一个产品后，突然被突然拿走。\n不清楚的是，谷歌的“开放使用共享”实际上是如何向“项目即服务”公司提供担保的--因为它实际上似乎并没有设定任何硬性政策。其常见问题解答中给出的每个有关使用托管商标的示例都归结为您必须按照该项目的商标使用指南使用商标，并且项目本身将继续设置这些指南。\nIstio是一个独立于平台的服务网，提供流量管理、策略执行和遥测收集。它是由来自Google、IBM和Lyft的团队在GitHub上开发的开源项目，是目前在GitHub上发现的增长最快的项目之一。\n谷歌拥有Istio的商标，但它公开推出了Istio，这是谷歌内部项目与IBM自己的开源Amalgam8项目的合并。当时，IBM称合并是有意义的，因为谷歌与Kubernetes-Istio的创始开发者地位本身就实现并促进了可以说是在库伯内斯海洋中游泳的集装箱之间的大规模通信。\n但根据IBM研究员Jason McGee的说法，最初的合作伙伴关系包括一项谅解，即一旦足够成熟，Istio将移交给云本地计算基金会(Cloud Native Computing Foundation)。CNCF基金会是Linux基金会的一个供应商中立的非盈利子组织；将开源项目移交给CNCF可以确保没有一家公司能够利用不适当的杠杆作用来影响使用并依赖该项目的另一家公司。\nIBM认为Open use Commons直接与Google捆绑在一起，而不是像CNCF那样真正独立于供应商和供应商中立。很难或不可能剖析Linux基金会或CNCF，并找出任何看起来像是由一家公司拥有的东西。\n也很难想象开放使用共享空间的未来会是什么样子--它是由一个六人董事会创建的，其中只有两个人在谷歌工作。但所有最初捐赠给下议院的项目都来自谷歌本身-这显然表明，在下议院推出之前，并没有广泛的行业购买积累起来。", "note_en": "This Wednesday, Google announced a new open source initiative—the  Open Usage Commons, a sort of stewardship project for open source trademarks. The move drew immediate criticism from IBM, which claims an interest in  Istio, one of the three projects Google seeded the OUC with at launch.\n  Before we can really get into IBM&#39;s beef, we need to spend some time investigating what the Open Usage Commons is trying to do in the first place. From its own  FAQ:\n The Open Usage Commons gives open source projects a neutral, independent home for their project trademarks, and provides assistance with conformance testing, establishing mark usage guidelines, and handling issues around trademark usage that projects encounter.\n The Open Usage Commons does not provide services that are outside the realm of usage, such as technical mentorship, community management, project events, or project marketing.\n In some ways, this sounds like a standard item from the open source playbook: establish a conservancy to manage things neutrally and keep them free for all. But so far, trademarks have largely been the one thing that open source projects have kept to themselves, and for good reason—tarnishing a project&#39;s brand damages the project itself in difficult or impossible to repair ways.\n IBM-owned Red Hat itself is one of the largest open source companies in the world, and its Red Hat Enterprise Linux makes for an interesting case study. All of the source code of RHEL is open source and may be freely downloaded, copied, and reused. If you want to build the entire operating system from its own source code and distribute it as your own, you may—but the one thing you  can&#39;t do is call it &#34;Red Hat Linux.&#34;\n Debian Linux&#39;s decade-long  spat with Mozilla over the Firefox logo is another interesting example of the conflict between open code and proprietary trademarks. The short version is, Mozilla retained full copyright on the Firefox logo—and this created a problem for Debian, whose policies don&#39;t permit redistribution of non-free intellectual property. So Debian pulled the logo but left the browser intact—causing Mozilla to refuse the project permission to use the Firefox name on the resulting build. Debian, meanwhile, simply renamed its build &#34;Iceweasel&#34; instead.\n It&#39;s easy to understand  why an open source project would want to protect its trademarks, though. If you don&#39;t protect your trademark, there&#39;s nothing stopping—for example—Oracle from deciding to create an entirely different product called &#34;Firefox,&#34; leading to severe confusion at best.\n So far, it&#39;s difficult to see what Google is trying to accomplish here—branding is literally the only thing an open source project has left to protect, and doing so is critically important. So why give that up? The answer is a few paragraphs farther down:\n [C]ompanies that want to offer managed versions of these projects... can invest in offering “Project as a Service” because it&#39;s a guarantee that they can use that mark; it won’t be suddenly taken away on a whim after they’ve built up an offering around it.\n What isn&#39;t clear is how Google&#39;s Open Usage Commons actually provides that guarantee to &#34;Project as a Service&#34; companies—because it doesn&#39;t actually seem to set any hard policies. Each of the examples given in its FAQ about usage of managed trademarks boils down to &#34;you have to use the trademark in accordance with that project&#39;s trademark usage guidelines&#34;—and that the projects themselves will continue to set those guidelines.\n  Istio is a platform-independent service mesh providing traffic management, policy enforcement, and telemetry collection. It was developed as an open source project by teams from Google, IBM, and Lyft on GitHub and is currently one of the fastest growing projects to be found there.\n Google owns the trademark to Istio, but it  launched publicly as a merger of Google&#39;s internal project by that name and IBM&#39;s own open source Amalgam8 project. At the time, IBM described the merger as making sense due to Google&#39;s founding developer position with Kubernetes—Istio itself enables and facilitates communication at scale between the containers swimming in the Kubernetes ocean, so to speak.\n But  according to IBM fellow Jason McGee, the original partnership included an understanding that Istio, once sufficiently mature, would be handed over to the Cloud Native Computing Foundation. The  CNCF is a vendor-neutral, non-profit child organization of the Linux Foundation; handing an open source project over to the CNCF ensures that no single company can use undue leverage to influence another company that uses and becomes dependent on that project.\n IBM sees the Open Usage Commons as tied directly to Google, rather than being truly vendor-independent and vendor-neutral like the CNCF. It&#39;s difficult or impossible to dissect the Linux Foundation or CNCF and come up with anything that looks like ownership by a single company.\n It&#39;s also difficult to see what the future for the Open Usage Commons will truly look like—it&#39;s been founded with a six-person board of directors, only two of whom work for Google. But all of the projects initially donated to the Commons come from Google itself—making it apparent that there was no wide industry buy-in accumulated prior to the Commons&#39; launch.", "posttime": "2020-07-11 03:08:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,problem,项目", "title": "IBM对Google的Open Usage Commons有问题", "title_en": "IBM has a problem with Google’s Open Usage Commons", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/07/google-says-trademarks-should-be-open-source-too-ibm-disagrees/", "via": "", "real_tags": ["google", "problem", "项目"]}, {"category": "", "categoryclass": "", "imagename": "c145978555b4ab42b1a560dc0bd7175b.jpg", "infoid": 1011066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马克·庞萨克(Mark Pundsack)将加入该公司，因为该公司正在扩大业务规模。在GitLab，Pundsack见证了公司通过其内部服务扩展业务，从70名员工增长到1300名员工。\n公司首席执行官格兰特·米勒(Grant Miller)表示，Replicate希望为广泛的企业客户带来同样的内部服务。\n最初是在与CircleCI合作时引入复制的，但正是该公司自推出Kubernetes部署管理工具包以来获得的新吸引力促使他重新审视。\nPundsack在一份声明中说：“他们最新的上市所创造的势头是巨大的，真的改变了公司的发展轨迹。”“当我能够接近产品、团队和客户时，我知道这是我想要成为的一部分。这家公司在整个企业软件生态系统中处于如此独特的位置来创造价值；这种覆盖范围是令人难以置信的罕见的。这种潜力让我想起了GitLab早期的许多日子。“。\n米勒说：“马克在GitLab创建了核心产品战略；将GitLab从一家源代码控制公司转变为一个完整的DevOps平台，并对Kubernetes提供了难以置信的支持。”对于Replicate公司的产品负责人来说，确实没有比这更好的背景了；马克见证了GitLab从传统的本地安装到基于Kubernetes的安装和管理体验的演变。这与我们的许多客户正在经历的过渡是一样的，Mark已经用最好的客户之一完成了这一过渡。我非常有信心，他参与我们的产品将为我们的客户带来更大的成功。“。\nPundsack是六个月内复制的第二位新招聘的高管，该公司希望为其高管团队带来更多实力，并扩大业务。", "note_en": "Mark Pundsack is joining the company as it moves to scale its business. At  GitLab   Pundsack saw the company grow from 70 employees to 1,300 as it scaled its business through its on-premise offerings.\n Replicated   is hoping to bring the same kind of on-premise services to a broad array of enterprise clients, according to company chief executive Grant Miller.\n  First introduced to Replicated while working with   CircleCI but it was the company’s newfound traction since the launch of its  kubernetes deployment management toolkit that caused him to take a second look.\n “The momentum that Replicated has created with their latest offering is tremendous; really changing the trajectory of the company,” said Pundsack in a statement. “When I was able to get close to the product, team, and customers, I knew this was something that I wanted to be a part of. This company is in such a unique position to create value throughout the entire enterprise software ecosystem; this sort of reach is incredibly rare. The potential reminds me a lot of the early days of GitLab.”\n  “Mark created the core product strategy at GitLab; transforming GitLab from a source control company to a complete DevOps platform, with incredible support for Kubernetes,” said Miller. “There really isn’t a better background for a product leader at Replicated; Mark has witnessed GitLab’s evolution from a traditional on-prem installation towards a Kubernetes-based installation and management experience. This is the same transition that many of our customers are going through and Mark has already done it with one of the best. I have so much confidence that his involvement with our product will lead to more success for our customers.”\n Pundsack is the second new executive hire from Replicated in six months as the company looks to bring more muscle to its c-suite and expand its operations.", "posttime": "2020-07-11 03:06:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "产品,product", "title": "\n总部位于洛杉矶的Replicated增加了前GitLab产品主管担任首席产品官", "title_en": "\n\t\t\t\tLA-based Replicated adds former GitLab head of product as its chief product officer\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/10/la-based-replicated-adds-former-gitlab-head-of-product-as-its-chief-product-officer/", "via": "", "real_tags": ["产品", "product"]}, {"category": "", "categoryclass": "", "imagename": "50bc2fc606e7f7cee2bfc289cb6471ca.jpg", "infoid": 1011065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在该公司的合作伙伴计划中，YouTube的创建者可以通过一系列不同的方式赚钱-通过广告、订阅、捐赠、直播功能和YouTube高级收入。有很多变数，现在YouTube终于将所有这些数字收集到一个地方，并将这些信息以一种名为RPM的新货币化指标的形式提供给创建者。\nRPM，即每百万美元的收入，是YouTube创建者已经使用的标准指标的基础，被称为CPM，即每百万美元的成本(有时被称为每千美元的成本)。虽然这两个听起来很相似，但它们做的是两件不同的事情。RPM对于那些试图扩大他们的频道并弄清楚他们的月收入来自哪里的创作者来说要有用得多。\nCPM在YouTube收取其收入份额之前衡量每1000次广告印象的成本，但RPM在YouTube收取分成后显示创建者的总收入(包括广告和其他货币化领域)。这并不代表创作者赚了多少钱。相反，它帮助创作者更好地了解他们在哪里赚钱，以及收入份额是如何细分的。\n前YouTube创建者马特·科瓦尔(Matt Koval)现在是该平台的首席创建者联络人，他在Twitter上说，“这有点像你每个月都能拿到工资，但你不太确定它是如何得出这个数字的。”\n“RPM是你在YouTube上赚钱速度的快照。”\n基本上，如果CPM是广告商关注的指标，那么RPM就是为创作者量身定做的。例如，RPM包括视频观看总数，包括未货币化的视频。这是为了向创作者表明，他们可能会错过多少收入方面的视频，这些视频产生了点击量，但没有资格货币化，他们可以做出改变，以确保未来的视频货币化。\n谷歌支持页面上的一个新博客写道：“RPM是你在YouTube上赚钱的速度的快照。”“无论RPM是上升还是下降，都很好地表明了你的营收策略中哪些方面是有效的，哪些是无效的。”\nYouTube引入RPM并不意味着CPM数字无关紧要。CPM越高，广告商为该广告支付的费用就越高，创作者在视频上赚的钱就越多。如果创作者有较高的CPM，这可能是一个很好的指标，可以很好地表明特定的广告商对该创作者的频道及其视频的价值有多高。YouTube的新RPM统计数据不会显示同样类型的广告指标。\nRPM指标让创建者放心的是，它承认了平台上的货币化程度发生了多少变化，即使是在过去的几年里也是如此。在VidCon 2019年，YouTube开始引入另类货币化，包括频道会员(订阅)、超级聊天(捐赠)等Livechat功能，以及创作者频道上的商品货架，以帮助这些频道所有者在平台上存在多年的更深层次的广告问题中实现收入多元化。\n创建者：你现在可以看到你在YouTube上赚了多少钱，相对于你在YouTube Analytics中收到的RPM浏览量。https://t.co/fxtdmawpJP=每1,000次查看获得的总收入使用它来跟踪收入表现，并做出更明智的货币化战略决策→rpm pic.twitter.com/oSF81ITKgv。\n-TeamYouTube(@TeamYouTube)2020年7月9日。\nYouTube正在进行其他改变，似乎是为了让创作者更容易获得更多的广告收入，包括从本月晚些时候开始，允许创作者在8分钟的视频上播放中间滚动广告。以前，一段视频必须达到10分钟(因此YouTube上10：01的表情包才能播放中档广告)。\n首席执行官苏珊·沃西基(Susan Wojcicki)在给创作者社区的多封公开信中指出，透明度是她和她的团队想要努力的事情。这包括创作者薪酬的透明度。因此，引入像RPM这样的新指标-有望为创作者细分每个收入流，以便他们更好地制定战略-是朝着正确方向迈出的坚实一步。", "note_en": "YouTube  creators in the company’s Partner Program can earn money a bunch of different ways — through advertising, subscriptions, donations, live-streaming features, and YouTube Premium revenue. There are a lot of variables, and now YouTube is finally gathering all of those numbers in one place and giving that information to creators in the form of a new monetization metric called RPM.\n RPM, or revenue per mille, is a take on the standard metric YouTube creators already use  referred to as CPM, or cost per mille (sometimes referred to as cost per thousand). Although the two sound similar, they do two different things. RPM is much more useful for creators who are trying to grow their channels and figure out where their monthly income is coming from.\n CPM measures the cost of every 1,000 ad impressions before YouTube takes its share of revenue, but RPM shows a creator’s total revenue (both from ads and other monetization areas) after YouTube takes the cut. This doesn’t represent a change to how much creators are making. Rather, it helps creators better understand where they’re making their money and how the revenue share breaks down.\n “It’s kinda been like you get a paycheck every month, but you’re not exactly sure how it came to that number,” Matt Koval, a former YouTube creator who now works as the platform’s head creator liaison, said on Twitter.\n “RPM is a snapshot of the rate at which you’re earning money on YouTube.”\n Basically, if CPM is an advertiser-focused metric, RPM is tailor-made for creators. For example, RPM includes the total number of video views, including videos that weren’t monetized. This is designed to show creators how much they might be missing out on revenue-wise from videos that generate views but aren’t eligible for monetization and changes they can make to ensure future videos are monetized.\n “RPM is a snapshot of the rate at which you’re earning money on YouTube,” a new  blog on Google’s support pages reads. “Whether RPM goes up or down, it’s a good indication of things that are working or not working in your revenue strategy.”\n YouTube introducing RPM doesn’t mean CPM numbers are irrelevant. The higher the CPM, the more an advertiser is paying for that ad, and the more money a creator makes on a video. If a creator has a higher CPM, it can be a pretty good indicator of how valuable a specific advertiser finds that creator’s channel and its videos. YouTube’s new RPM stat won’t show that same kind of advertisement indicator.\n What’s reassuring to creators about the RPM metric is that it acknowledges how much monetization has changed on the platform, even in just the last few years. At VidCon 2019, YouTube began  introducing alternative monetization, including channel memberships (subscriptions), livechat features like Super Chat (donations), and merchandise shelves on creators’ channels to help those channel owners diversify revenue amid deeper advertising issues that have existed for years on the platform.\n Creators: You can now see how much you make on YouTube relative to views you receive w/ RPM in YouTube Analytics.  RPM = total revenue earned per 1,000 views  Use it to track revenue performance &amp; make more informed monetization strategy decisions →  https://t.co/fxtdmawpJP  pic.twitter.com/oSF81ITKgv\n— TeamYouTube (@TeamYouTube)  July 9, 2020\n YouTube is making other changes to seemingly try to make it easier for creators to earn more ad revenue, including giving creators access to mid-roll ads on eight-minute videos  starting later this month. Previously, a video had to reach 10 minutes (hence the  10:01 meme that took off on YouTube) to enable mid-roll ads.\n CEO Susan Wojcicki has noted in a number of open letters to the creator community that transparency is something she and her team want to work on. That includes transparency around how creators are paid. So introducing a new metric like RPM — one that hopefully breaks down each revenue stream for creators so they can better strategize — is a solid step in the right direction.", "posttime": "2020-07-11 03:05:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,创作者", "title": "YouTube终于让创建者确切地知道他们是如何在YouTube上赚钱的，使用一种名为RPM的衡量标准，该指标显示了YouTube被削减后的总营收", "title_en": "YouTube is finally letting creators know exactly how they're making money on YouTube, using a metric called RPM that shows total revenue, after YouTube's cut", "transed": 1, "url": "https://www.theverge.com/2020/7/10/21319938/youtube-monetization-metric-ad-revenue-cpm-rpm-alternative-memberships-premium?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["youtube", "创作者"]}, {"category": "", "categoryclass": "", "imagename": "55cb68b40089d8ae25b42b4e9914e2a6.png", "infoid": 1011064, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国不再统一，它几乎不是一个州。他们已经从失败的国家直接坠落到一个瘟疫国家，在世界各地都不受欢迎。这已经被预测到了，包括这里。现在它已经实现了。只要看一下地图就可以了。\n美国人已经从可以进入世界大部分地区变成了被禁止进入大部分地区。今天，美国人只被允许进入少数加勒比海岛屿和巴尔干半岛。美国护照现在一文不值。比一文不值更糟糕的是，这是一场瘟疫。\n在缺乏人道政府的情况下，美国现在由新冠肺炎统治。欢迎来到美国的瘟疫之州。\n我认为美国人很难理解，用流行病学的术语来说，他们完全完蛋了。新冠肺炎本可以在2021年1月或2月，甚至现在，但不是一整年后的1月被管理。考虑到你需要一个正常运作的政府来控制这场流行病，这是美国人最快能拿到的。\n最可靠的预测是，到11月选举日，20万人死亡，5000万人感染。即使是这些预测也很难解释联邦政府完全不理性的行为，比如诋毁面具，推动提前重新开学，以及迫使学生重返学校。这不是没有公共卫生，这是它的对立面。\n即使在选举日之后，唐纳德·特朗普(Donald Trump)仍将掌权近3个月，直到1月20日。除了弹劾一位死鸭总统之外，美国别无选择，只能等待，而新冠肺炎却在变得越来越强大。变得完全失控。在大流行中，天很重要，小时很重要。一年太晚了。\n美国将幸运地退出这场大流行，死亡人数不到100万人，感染人数不到1亿人。活着的人将很幸运地在未来五年内离开他们的国家。\n欢迎来到俱乐部。多年来，后殖民时代的废话和种族主义让我的斯里兰卡护照一文不值。现在美国护照更糟了。美国已经直接从第三世界跌入第四世界。\n这里总共列出了美国人可以去的所有地方。它们大多是加勒比海的小岛。\n所有你能去的地方1.阿尔巴尼亚|15.黎巴嫩2.安提瓜和巴布达|16.马尔代夫3.阿鲁巴|17.墨西哥4.巴哈马|18.马其顿北部5.巴巴多斯|19.圣卢西亚6.伯利兹|20.圣马丁岛7.百慕大|21.。圣文森特和安大略省8.克罗地亚|22.。塞尔维亚9.多米尼加共和国|23.。坦桑尼亚10.厄瓜多尔*|24.。土耳其11.法属波利尼西亚|25.。土耳其和安大略省12。爱尔兰*|26。乌克兰13.牙买加|27.。阿联酋*14.科索沃|28.。英国**需要14天的检疫，不包括在地图中。\n美国人现在正好可以进入24个州，如果他们想在最后忍受14天的隔离，就可以再进入4个州(*)。在几个月的时间里，美国人从世界强国变成了厄瓜多尔的旁观者。目前，只有在墨西哥的偏远岛屿或围栏度假村才真正欢迎美国人，在那里他们可以与其他所有人隔绝。\n并不是其他国家不想欢迎美国人，他们就是不能。护照的意义在于主权国家为持有者担保，但美国根本不能担保本国公民的健康。美国的公共卫生制度远不如利比里亚的可靠(这实际上相当不错)。它的君主疯了。\n同时，你也不能相信美国人。美国人的卫生状况很差(蒙面率低)，至少有四成的人甚至不能相信新冠肺炎的存在，更不用说认真对待了。他们很可能拒绝检测，不报告症状，违反隔离，通常遵守规则。美国人既无知又傲慢，这使他们成为不受欢迎的旅行者。\n他们有很多问题，他们带来了这些问题。我想，他们中的一些人是好人，但这无关紧要。这是一本瘟疫护照。退回给发件人。\n那是美国不久的将来。一种在明年之前基本上不受控制地传播的流行病。一群没有保护和无知的人不能被允许去其他任何地方。从蒙古到加纳，再到特立尼达和多巴哥，这个世界在很大程度上抑制了这种病毒，但它不得不让美国处于孤立状态。\n最终，特朗普言行一致。他在美国周围筑起了一堵墙，让全世界为此付出了代价。他只是从来没有告诉美国人他们会被困在里面。欢迎来到美国的瘟疫之州。你可以退房，但你永远不能离开。", "note_en": "America is not united anymore and it’s barely a state. They have crashed right through failed state into a plague state, unwelcome across the world. This  has been predicted, including  here. Now it has come to pass. Just look at the map.\n Americans have gone from having access to most of the world to being banned from most of it. Today, Americans are only allowed in a few Caribbean islands and the Balkans. An American passport is now worthless. Worse than worthless, it’s a plague.\n In the absence of a humane government, America is now ruled by COVID-19. Welcome to the Plague States of America.\n   I think it is difficult for Americans to understand that they are, to use an epidemiological term, completely fucked. COVID-19 could have been managed in January, or February, or even now, but  not a full year later, in January 2021. Given than you need a functioning government to manage this pandemic, that’s the soonest Americans can get one.\n  The  most reliable projections are saying 200,000 dead and 50  million infected by election day in November. Even these projections struggle to account for completely irrational federal actions like denigrating masks, pushing to reopen early, and pushing students back into schools. This is not the absence of public health, this is its opposite.\n  Even after election day, Donald Trump will  still be in power for nearly 3 months, until January 20th. Besides impeaching a dead-duck President, there’s nothing America can do but wait, while COVID-19 grows ever stronger. Grows completely out of control. In a pandemic, days matter, hours matter. A year is entirely too late.\n America will be lucky to exit this pandemic with less than a million dead and 100 million infected. The living will be lucky to exit their country within the next five years.\n   Welcome to the club. Post-colonial bullshit and racism have made my  Sri Lankan passport worthless for years. Now the American passport is worse. America has crashed straight through the third world into the fourth.\n Here is a list, in total, of all the places Americans can go. Most of them are small Caribbean islands.\n  ALL THE PLACES YOU CAN GO 1. Albania | 15. Lebanon 2. Antigua and Barbuda | 16. Maldives 3. Aruba | 17. Mexico 4. The Bahamas | 18. North Macedonia 5. Barbados | 19. St. Lucia 6. Belize | 20. St. Maarten 7. Bermuda | 21. St. Vincent &amp; 8. Croatia | 22. Serbia 9. Dominican Republic | 23. Tanzania 10. Ecuador* | 24. Turkey 11. French Polynesia | 25. Turks &amp; 12. Ireland* | 26. Ukraine 13. Jamaica | 27. UAE* 14. Kosovo | 28. UK*  *14 day quarantine required, not included in map.\n American now have access to exactly two dozen states, four more (*) if they want to endure a 14-day quarantine on the end. Americans have gone from world power to getting the side-eye from Ecuador in a matter of months. Right now Americans are only really welcome on remote islands or at corralled resorts in Mexico, where they can be isolated from everyone else.\n It’s not that other nations don’t want to welcome Americans, they just can’t. The point of a passport is that a sovereign power vouches for its bearer, but America can’t vouch for the health of their citizens at all. America’s public health regime is  far less trustworthy than Liberia’s (which is actually  quite good). Its sovereign is mad.\n At the same time, you can’t trust Americans. Americans have poor hygiene (low masking rate) and at least 40% of the population can’t be trusted to even believe that COVID-19 exists, let alone to take it seriously. They’re likely to refuse testing, not report symptoms, break quarantine, and generally follow rules. Americans have a toxic combination of ignorance and arrogance that makes them unwelcome travelers.\n They have a lot of problems, and they’re bringing those problems with them. Some of them, I assume, are good people, but it doesn’t matter. It’s a plague passport. Return to sender.\n   That’s the near future of the United States. An epidemic that spreads largely unchecked until next year. A population to unprotected and ignorant to be allowed anywhere else. A world that largely suppresses the virus — from  Mongolia to  Ghana to  Trinidad &amp; Tobago — but which has to keep America in isolation.\n In the end, Trump did what he said. He built a wall around America and made the world pay for it. He just never told Americans that they’d be stuck inside. Welcome to the Plague States of America. You can check out, but you can never leave.", "posttime": "2020-07-11 03:05:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,sports,护照,passports", "title": "美国护照现在一文不值了", "title_en": "US passports are worthless now", "transed": 1, "url": "https://medium.com/@indica/the-plague-states-of-america-53b20678a80e", "via": "", "real_tags": ["美国", "sports", "护照", "passports"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011063, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罗宾·米尔纳(Robin Milner)的具有参数多态性的类型系统比罗素和丘奇的系统有了显著的进步。这是使用类型变量的能力，使高阶Logica成为证明非平凡定理的实用工具。Hindley-Milner算法用于在定理证明器和其他几种函数式编程语言中自动推断类型。本教程将解释算法、类型系统和一些逻辑背景，并用标准ML实现。此实现纯粹是功能性的，旨在尽可能清楚地展示算法。上图旨在说明函数式语言可以用来表达数学和逻辑，使得数学表达式和程序表达式之间的对应关系可以像人们希望的那样精确。这有实际的后果。在实现算法iNML时，我在数学表达式中发现了几个错误和歧义。在构造算法的力学表达式的过程中，对这些问题进行了澄清。错误将通过编译器的语法和类型检查来检测，而歧义通过标准ML语义的规范来解决，这比我所见过的任何数学表示法的非正式描述都要精确得多。因为ML同样具有表现力，但是更精确，所以我认为ML程序比数学程序更好地描述了算法。标准ML是米尔纳的语言，它使用这种参数多态类型系统。类型推断算法实现的核心在于大约250行代码。它根本不包括任何显式类型注释，但是每个表达式的类型都是由编译器中的相同算法推断(并因此检查)的。该算法在1982年被Damas和Milner证明是可靠和完整的，并且证明在函数式程序的原则型方案中概述，我重新键入了这些证明，因为这篇论文写得很好，值得更广泛地阅读。源代码以纯文本SML源文件和html格式的标准ML格式提供。", "note_en": "Robin Milner&#39;s type system with parametric polymorphism was asignificant advance over the systems of Russell and Church. Arguablyit is the ability to use type-variables that makes higher order logica practical vehicle for proving non-trivial theorems. TheHindley-Milner algorithm is used to automatically infer types intheorem provers and in several other functional programing languages. The algorithm, the type system, and some of the logical background are explainedin  this tutorial, along with an implementationin standard ML. This implementation is purely functional and is intended to showthe algorithm as clearly as possible. The image above is meant to showthat functional languages can be used to express mathematics and logicin such a way that the correspondence between the mathematical and theprogrammatic expressions may be as exact as one wishes.  This has practical consequences. In implementing the algorithm inML I found several errors and ambiguities in the mathematicalexpression. These were cleared up in the process of constructing themechanical expression of the algorithm. The errors would have beendetected by the syntax and type-checking of the compiler, and theambiguity is resolved by the specification of standard ML semanticswhich is more precise than any informal description of mathematicalnotation that I have ever seen. Because ML is equally expressive butmore exact, I argue that the ML program is a a  betterdescription of the algorithm than the mathematical one. Standard ML is Milner&#39;s language which uses this parametricpolymorphic type system. The core of the implementation of the typeinference algorithm consists in some 250 lines of code. It does notinclude any explicit type annotation at all, yet the type of each andevery expression is inferred (and thereby checked) by the samealgorithm which is part of the compiler. The algorithm was proved sound and complete by Damas and Milner in1982 and the proof is outlined in  Principaltype-schemes for functional programs which I have re-keyed becausethe paper is so well-written and deserves to be more widely read. The source code is available asa  plain text SML source file andas  html formatted standard ML.", "posttime": "2020-07-11 03:04:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hindley,milner,算法", "title": "Hindley-Milner型推理", "title_en": "Hindley-Milner Type Inference", "transed": 1, "url": "http://steshaw.org/hm/", "via": "", "real_tags": ["hindley", "milner", "算法"]}, {"category": "", "categoryclass": "", "imagename": "b71d04db6fbc079dd8f33ea8b3454efe.jpg", "infoid": 1011062, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们将利用这个空间来探讨与多样性、公平和包容性、工作的未来、与薪酬平等相关的问题、引人注目的人事变动等问题。\n本周，我们关注脸书的民权审计，一项新的临时工收入研究，关于加州投票措施22号提案和新冠肺炎裁员的最新研究。\n警方击毙乔治·弗洛伊德还不到两个月。虽然科技行业继续进行融资、并购，但在种族正义方面仍有工作要做。下面我们来看一下过去几周的一些发展情况。\n正如美国公民自由联盟(ACLU)前律师劳拉·墨菲(Laura Murphy)在Facebook的最终民权审计报告中看到的那样，这家社交网络巨头仍需采取更多措施，增加其高级领导职位和高管的多样性。报告指出，黑人、土著和有色人种的这些角色也不能“像美国企业界经常出现的那样，局限于多样性官员的职位”。\n根据审计，全公司还必须认识到，多样性、公平性和包容性的努力不应仅仅落在代表性不足的群体中，而是落在高级领导班子和经理的所有成员身上。审计还强调了员工对“URM员工花在指导和招募其他少数族裔在Facebook工作的时间缺乏认可”的担忧。", "note_en": "We’ll use this space to explore topics related to diversity, equity and inclusion, the future of work, issues relating to pay equality, notable personnel changes and much more.\n This week, we’re looking at Facebook’s civil rights audit, a new gig worker earnings study, the latest on California ballot measure Proposition 22 and layoffs amid COVID-19.\n   It’s been less than two months since the police killing of George Floyd. While the tech industry has continued on with its funding rounds, mergers and acquisitions, there is still work to be done on the racial justice front. Here’s a look at some developments over the last couple of weeks.\n  As seen in Facebook’s final civil rights audit report conducted by former ACLU attorney Laura Murphy, the social networking giant still must do more to increase diversity in its senior leadership roles and C-suite. These roles for Black, indigenous and people of color must also not be “limited to diversity officer positions as is often the case in corporate America,” the report states.\n According to the audit, there must also be company-wide recognition that diversity, equity and inclusion efforts are not to fall solely on those in underrepresented groups, but rather on all members of the senior leadership team and managers. The audit also highlighted employee concerns around “a lack of recognition for the time URM employees spend mentoring and recruiting other minorities to work at Facebook.”", "posttime": "2020-07-11 02:45:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,worker,多样性", "title": "\n工作中的科技：Facebook的De&I，22号提案和零工收入", "title_en": "\n\t\t\t\tTech at Work: DE&I at Facebook, Prop 22 and gig worker earnings\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/10/tech-at-work-dei-at-facebook-prop-22-and-gig-worker-earnings/", "via": "", "real_tags": ["facebook", "worker", "多样性"]}, {"category": "", "categoryclass": "", "imagename": "f264850e341bdaba919267891884df5d.jpg", "infoid": 1011059, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近几周，特朗普总统和美国国家气象局(National Weather Service)之间的飓风之争又上演了一些戏剧性事件。上周，商务部监察长对领导层阻挠发布她关于这场骚乱引发的任何法律问题的报告表示不满。这份报告现在已经出来了，它给这个故事带来了一些解决方案。\n如果你不熟悉背景，当飓风多里安逼近美国海岸时，特朗普总统在推特上表示，阿拉巴马州“很可能受到(比预期)更严重的袭击”-这一说法是不真实的，因为风暴将转向北部并向上东海岸。然而，他的声明引发了阿拉巴马州忧心忡忡的人的呼吁，他们想知道预测是否发生了变化。作为回应，伯明翰国家气象局办公室在推特上写道，“阿拉巴马州不会看到#多里安的任何影响。”\n这条推文扰乱了白宫，最终导致NOAA发布了一份有争议的未签名声明，基本上是说总统在技术上是正确的，伯明翰办公室应该对他们的推文进行限定。(还有一起事件，椭圆形办公室的飓风预报地图被修改为黑色记号笔，使其看起来像是阿拉巴马州可能已经处于危险之中。)。\nNOAA的声明反过来引发了正式的投诉，这引发了对此事的几项调查。所发生事件的大致轮廓早已为人所知：白宫感到不安，打电话给商务部长威尔伯·罗斯(Wilbur Ross)，罗斯的办公室与NOAA领导层合作，推动了这份声明。美国国家海洋和大气局(NOAA)的科学诚信官员上个月发布的一份报告强化了这一观点，指责NOAA领导层玩弄作风，但指出商业工作人员操纵了这场秀。\n这份报告背后的小组无法接触到商务工作人员，但商务监察长佩吉·古斯塔夫森(Peggy Gustafson)却接触到了。虽然事件的轮廓是已知的，但古斯塔夫森的报告中的一些细节是值得注意的。\n这份报告包括对参与声明的每个人的采访，以及一些电子邮件和短信。这允许一步一步地描述事件-即使不同的人提出的版本存在差异。\n一切都始于白宫代理幕僚长米克·马尔瓦尼(Mick Mulvaney)给商务部长罗斯的一封电子邮件。马尔瓦尼解释说，特朗普是根据他们看到的最新信息发推文的，不理解为什么伯明翰办公室会发推文更正。“就目前的情况而言，”马尔瓦尼写道，“(国家气象局)似乎故意与总统相矛盾。我们需要知道为什么。他要么想要改正，要么想要解释，或者两者兼而有之。“。\n罗斯联系了NOAA代理局长尼尔·雅各布斯(Neil Jacobs)，询问预测的时间表是什么，看看这两条推文适合哪里。第二天，他委托他的幕僚长迈克尔·沃尔什(Michael Walsh)和代理副总法律顾问大卫·德惠斯特(David Dewhirst)跟进信息收集，并与NOAA的尼尔·雅各布斯(Neil Jacobs)和他的公关总监朱莉·凯·罗伯茨(Julie Kay Roberts)一起撰写了声明。\n罗伯茨说，沃尔什告诉她，“有工作要做。可能是伯明翰的预报办公室打来的。也可能是比这更高的人。而且越高越不容易让人接受。“。\n这四人对起草声明的会议给出了不同的描述。Dewhirst声称，他或多或少只是在打声明，但NOAA的人是口述的。其他人似乎都在暗示，声明的内容是由Dewhirst负责的。\n美国国家海洋和大气局的雅各布斯和罗伯茨研究了预测的时间表，发现阿拉巴马州的重大影响在周六上午的预测之前就已经消失了-早在特朗普周日上午晚些时候的推文之前。国家安全委员会正在实时收到最新的预测，这意味着总统应该已经得到了这方面的简报。雅各布斯解释说“阿尔从来不在赛道锥体里..。艾尔看到热带风暴强风的可能性为%，“这里没有人会说艾尔会有15%的可能性看到每小时39英里的风速。这只是一个刮风的日子，即使是百分之百的可能性也是如此。“。\n但这最终恰恰是为特朗普的推文辩护的理由，特朗普在推特上表示，阿拉巴马州“最有可能受到(比预期)更严重的打击”-一张预测地图显示，阿拉巴马州的一小片地区有可能风速超过每小时39英里。声明的后半部分是最具争议性的：\n伯明翰国家气象局(Birmingham National Weather Service)周日上午的推文绝对值与当时最好的预测产品的概率不一致。\n美国国家海洋和大气局领导层显然反对这一举动，雅各布斯称其为“一个糟糕的主意”。但商务工作人员否决了这些提议。朱莉·凯·罗伯茨(Julie Kay Roberts)说，她“记得有人明确告诉她，我相信是戴夫·德惠斯特(Dave Dewhirst)告诉她，如果伯明翰部分不留下来，它就不能满足需要。不管那是什么意思。“。\n报告还说，“当时与罗斯部长同行并参加了一次关于这一声明的电话的(商务部)当时的政策主任认为，‘总统没有错，伯明翰也没有错。它们是夜里经过的船只。但声明需要略微对NWS伯明翰‘倾斜’，以抵消‘媒体’对‘总统’的‘倾斜’。“。\n接受采访的伯明翰办事处的预报员当然不同意这一警告。报告说：“(一位)预报员解释说，热带风暴风力的风概率图不是他们‘宣传’的东西，也不是他们预测的基础--他们已经向州和地方决策者通报了情况，他们已经决定不再需要关于多里安飓风的任何简报。”\n该报告的结论--早些时候在摘要备忘录发布时公之于众--突显出商务人员指示的声明“没有进一步促进NOAA或国家气象局的利益”，它“没有考虑到国家气象局伯明翰推文的公共安全意图”。\n即使伯明翰的推文值得更正，五天过去了，飓风已经向前移动了。很明显，这份声明与正确预测或澄清公众困惑无关。\n这份报告对相关的商务工作人员并不友好，他们说，“沃尔什先生和德惠斯特先生没有行使适当的判断力，也没有适当的科学背景，无法代表一家科学机构在这些活动中发挥领导作用。”\n希望这一事件不会对公众的信任产生持久的影响，接受采访的NOAA工作人员似乎对此持乐观态度。正如伯明翰的一位预报员所说，“我认为在这一点上，我们已经准备好推进…。我认为这是最重要的事情，这样我们才能回到工作岗位上，保护生命和财产。“", "note_en": "Recent weeks have seen some additional drama over last September’s hurricane dust-up between President Trump and the National Weather Service. Last week, the Commerce Department’s inspector general was crying foul over leadership stonewalling the release of her report on any legal issues arising from the dustup. That  report is now out, and it brings some resolution to the tale.\n  If you’re unfamiliar with the background, as Hurricane Dorian approached the US coast, President Trump tweeted that Alabama would “most likely be hit (much) harder than anticipated”—a statement that was untrue, as the storm was set to turn north and up the Eastern Seaboard. His statement, however, prompted calls from concerned people in Alabama, who wondered if the forecast had changed. In response, the Birmingham National Weather Service office tweeted, “Alabama will NOT see any impacts from #Dorian.”\n  This tweet perturbed the White House, eventually resulting in a controversial, unsigned statement released by NOAA that essentially said the president was technically right and the Birmingham office should have qualified their tweet. (There was also  an incident in which a hurricane forecast map in the Oval Office was modified with a black marker to make it look like Alabama might have been in danger.)\n  The NOAA statement in turn prompted formal complaints, which set off several investigations into the matter. The broad outlines of what happened have been known for a long time: the White House was upset and called Commerce Secretary Wilbur Ross, whose office worked with NOAA leadership to push out the statement. A report released last month by NOAA’s Scientific Integrity officer reinforced that picture, faulting NOAA leadership for playing along but noting that Commerce staff had run the show.\n The panel behind that report had no access to the Commerce staff, but Commerce Inspector General Peggy Gustafson did. And although the outline of events was known, some of the details in Gustafson&#39;s report are remarkable.\n The report includes interviews with everyone involved in the statement, as well as some emails and text messages. And that allows for a step-by-step description of events—even though there are discrepancies in the versions presented by different people.\n Everything started with an email from acting White House Chief of Staff Mick Mulvaney to Commerce Secretary Ross. Mulvaney explained that Trump tweeted based on the latest info they had seen and did not understand why the Birmingham office would tweet a correction. “As it currently stands,” Mulvaney wrote, “it appears as if the [National Weather Service] intentionally contradicted the president. And we need to know why. He wants either a correction or an explanation or both.”\n  Ross reached out to acting NOAA Director Neil Jacobs to ask what the timeline of forecasts was to see where the two tweets fit in. The next day, he tasked his Chief of Staff Michael Walsh and acting Deputy General Counsel David Dewhirst with following up on the information gathering, which turned into statement writing with NOAA’s Neil Jacobs and his director of communications, Julie Kay Roberts.\n Roberts said that Walsh told her that “there are jobs on the line. It could be the forecast office in Birmingham. Or it could be someone higher than that. And the higher is less palatable.”\n These four gave different accounts of the meeting in which the statement was drafted. Dewhirst claims he was more or less just typing up the statement but that the NOAA folks were dictating it. Everyone else seems to indicate that it was Dewhirst who was responsible for the contents of the statement.\n NOAA’s Jacobs and Roberts went through the timeline of forecasts, finding that significant effects in Alabama had dropped out by the Saturday morning forecast—long before Trump’s tweet late Sunday morning. The National Security Council was receiving updated forecasts in real time, meaning the president should have been briefed of this already. Jacobs had explained that “AL was never in the track cone... AL was in the percent probability of seeing tropical storm force winds” and that “[n]obody here would have said that AL was going to have impacts with a 15 percent chance of seeing 39 mph winds. That’s just a windy day, even if it was 100 percent chance.”\n  But that ended up being exactly the justification used to defend Trump’s tweet that Alabama would “most likely be hit (much) harder than anticipated”—a forecast map showing a sliver of Alabama with a chance of winds over 39 miles per hour. The latter half of the statement was the most controversial:\n The Birmingham National Weather Service’s Sunday morning tweet spoke in absolute terms that were inconsistent with probabilities from the best forecast products available at the time.\n NOAA leadership apparently pushed back on this move, with Jacobs calling it “just a bad idea.” But Commerce staff overruled them. Julie Kay Roberts said she “remember[ed] being specifically told, and I believe it was by Dave Dewhirst, I think it was Dave, that if the Birmingham part didn’t stay in, it wouldn’t meet the need. Whatever that meant.”\n  The report also says, “The [Commerce] Department’s then-Director of Policy, who was traveling with Secretary Ross and participated in one call about the Statement, opined that ‘the President wasn’t wrong, and Birmingham wasn’t wrong. They were ships passing in the night.’ But the statement needed to ‘tilt’ slightly against NWS Birmingham to counteract ‘the press folks’ who have tilted the story ‘against the President.’”\n Forecasters from the Birmingham office who were interviewed certainly disagreed with the admonition. The report states, “[One] forecaster explained that the wind probability map for tropical-storm-force winds is not something they ‘advertise’ or were basing the forecast on—and the state and local decision makers they had been briefing had already decided that they did not need any more briefings on Hurricane Dorian.”\n The report’s conclusions—which were made public earlier when the summary memo was posted—highlight that the statement Commerce staff directed “did not further NOAA’s or the National Weather Service&#39;s interests,” and it “failed to account for the public safety intent of the National Weather Service Birmingham tweet.”\n Even if the Birmingham tweet had deserved correction, five days had gone by and the hurricane had moved on. Obviously, the statement had nothing to do with getting a forecast right or clarifying public confusion.\n And the report is not kind to the Commerce staff involved, saying, “Mr. Walsh and Mr. Dewhirst did not exercise the appropriate judgment or have the appropriate science background to have leading roles in navigating these events on behalf of a science agency.”\n The hope is that this episode did not have a lasting effect on public trust, and the NOAA workers interviewed seemed optimistic about that. As one of the Birmingham forecasters put it, “I think at this point, we’re ready to move forward… I think that’s the biggest thing, so we can get back to our jobs, protection of life and property.”", "posttime": "2020-07-11 02:23:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,发布,sharpiegate,noaa", "title": "商业“Sharpiegate”报告最终未经编辑发布", "title_en": "Commerce “Sharpiegate” report finally released without redaction", "transed": 1, "url": "https://arstechnica.com/science/2020/07/commerce-sharpiegate-report-finally-released-without-redaction/", "via": "", "real_tags": ["商业", "发布", "noaa"]}, {"category": "", "categoryclass": "", "imagename": "6c90389d2883b8fda47661faf920364c.jpg", "infoid": 1011058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据Stop The Cap报道，Charge Communications将从8月份开始将有线电视套餐的广播电视费从每月13.50美元提高到16.45美元。\n查特说，广播电视费包括向广播电视台(如CBS、NBC、ABC和福克斯的附属公司)支付的转播权。但对于消费者来说，这本质上是一项隐藏的费用，因为Charge的广告电视价格不包括它。\nCharge一再提高费用-在一系列涨价之前，它在2019年初为9.95美元。费用为每月16.45美元，客户每年将额外花费197.40美元。Charge以其频谱品牌销售电视、宽带和电话服务，是仅次于康卡斯特的美国第二大有线电视公司。\nStop The Cap写道，Charge对其流媒体电视计划征收较低的广播电视费，但将从每月6美元提高到8.95美元。Charge也在提高其电视服务的底价。Stop the Cap写道，Spectrum最受欢迎的电视精选套餐预计将增加1.50美元/月，至73.99美元/月。在促销定价到期之前，促销定价计划中的客户不会看到此费率的增加。&#34；\n今天，当ARS与查特公司联系时，查特公司的一位发言人证实了广播电视和电视精选的涨价。广播电视费用的变化显然将适用于即使是正在进行促销交易、在一定时间内锁定价格的客户。查特告诉我们，促销价适用于套餐价格，在促销期结束前不会改变。但查特说，广播电视服务费与电视套餐价格是分开的，所以无论客户是否仍在进行促销交易，它都可以上涨。\nCharge给ARS的声明称，程序员每年都会提高节目费用以提供相同的内容，从而导致整个行业的成本上升。我们转嫁给观众的增长是这些不断上涨的节目成本的直接结果。\n有线电视客户没有获得体育频道的折扣，尽管各大体育联盟在冠状病毒大流行期间在过去的几个月里暂停了比赛。正如我们在前面的故事中解释的那样，消费者是否获得退款将取决于有线电视公司、体育联盟和广播公司的谈判。\n查特今天向我们重申，它将把我们在新冠肺炎期间因失去实况转播体育赛事而获得的任何回扣转嫁给[客户]。\nCharge不收取地区体育网络费用，而康卡斯特(Comcast)、美国电话电报公司(AT&amp；T)旗下的DirecTV和威瑞森(Verizon)等公司同时收取广播电视和体育费。体育费用只是查特一揽子计划的一部分，而不是放在单独的费用中，而且还不清楚与大流行相关的退款会有多大。\n查特面临诉讼，指控广播电视费具有误导性。2020年5月，美国康涅狄格州地区法院对查特提起集体诉讼，称：\n在其所有广告渠道中，Charge一贯和显著地宣传其电视服务和包括电视服务在内的有线服务套餐的固定月费。\n多年来，Charge没有披露它实际上通过多个计划提高了承诺的固定月费率。在其他遗漏中，Charge在签约之前没有全面或准确地披露其广播电视附加费的存在或金额，也没有披露它可以自行决定定期增加附加费(从而提高客户的月费)。\n诉讼称，包机客户服务代表错误地告诉来电投诉的客户，附加费是税收或政府费用。诉讼指出，查特支付的运营本地频道的费用是查特提供电视服务业务的固有成本的一部分。诉讼称，广播电视收费是查特每月收取更高基本服务费用的一种方式，而不必宣传实际更高的价格。\n披露：拥有Charge 13%股份的Advance/Newhouse伙伴关系是Advance Publications的一部分。Advance Publications拥有康泰纳仕(CondéNast)，康泰纳仕拥有Ars Technica。", "note_en": "Charter Communications is raising the &#34;Broadcast TV&#34; fee it imposes on cable plans from $13.50 to $16.45 a month starting in August, Stop the Cap  reported.\n Charter says the Broadcast TV fee  covers the amount it pays broadcast television stations (e.g. affiliates of CBS, NBC, ABC, and Fox) for the right to carry their channels. But for consumers, it is essentially a hidden fee because Charter&#39;s advertised TV prices don&#39;t include it.\n Charter has raised the fee repeatedly—it stood at $9.95  in early 2019 before a series of price  increases. At $16.45 a month, the fee will cost customers an additional $197.40 per year. Charter sells TV, broadband, and phone service under its Spectrum brand name and is the second largest cable company in the US after Comcast.\n Charter imposes a smaller Broadcast TV fee on its  streaming TV plans, but is raising that charge from $6 to $8.95 a month, Stop the Cap wrote. Charter is also raising the base price of its TV service. &#34;Spectrum&#39;s most popular TV Select package is expected to increase $1.50/month to $73.99/month,&#34; Stop the Cap wrote. &#34;Customers on a promotional pricing plan will not see this rate increase until their promotional pricing expires.&#34;\n  A Charter spokesperson confirmed the Broadcast TV and TV Select price increases when contacted by Ars today. The Broadcast TV fee change will apparently apply even to customers who are on promotional deals that lock in a price for a set amount of time. Charter told us that promotional prices apply to the &#34;package price,&#34; which &#34;will not change until the end of their promotional period.&#34; But Charter said that the &#34;Broadcast TV Service Charge is separate from the TV package price,&#34; so it can go up regardless of whether a customer is still on a promotional deal.\n Charter&#39;s statement to Ars said that &#34;programmers annually raise programming fees to deliver the same content, leading to higher costs across the entire industry. The increase we are passing through to viewers is a direct result of these rising programming costs.&#34;\n   Cable customers haven&#39;t gotten discounts for sports channels even though major sports leagues suspended play over the past few months during the coronavirus pandemic. As we explained in a  previous story, whether consumers get refunds will depend on negotiations involving cable companies, sports leagues, and broadcasters.\n Charter reiterated to us today that it &#34;will pass through [to customers] any rebates we receive from the loss of live sports during COVID-19.&#34;\n Charter does not charge a Regional Sports Network fee, while companies including Comcast, AT&amp;T-owned DirecTV, and Verizon charge both the Broadcast TV and sports fees. Sports costs are simply part of the package with Charter instead of being put into a separate fee, and it isn&#39;t clear how big any pandemic-related refunds will be.\n  Charter has faced  lawsuits alleging that the Broadcast TV fee is misleading.  A class-action lawsuit filed in May 2020 against Charter in US District Court for the District of Connecticut says:\n Across all its advertising channels, Charter consistently and prominently advertises a flat, fixed monthly rate for its television service and cable service packages which include television service.\n For years, Charter has not disclosed that it actually increases those promised fixed monthly rates through multiple schemes. Among other omissions, Charter does not fully or accurately disclose the existence or amount of its Broadcast TV Surcharge prior to sign-up, and does not disclose that it periodically increases that surcharge (and thus customers&#39; monthly rates) at its discretion.\n Charter customer-service reps have falsely told customers who call to complain &#34;that the Surcharge is a tax or government fee,&#34; the lawsuit said. The lawsuit points out that &#34;[a]ny costs Charter pays to carry local channels are part of the inherent cost of Charter&#39;s business of providing television services.&#34; The Broadcast TV charge is thus &#34;a way for Charter to charge more per month for its basic service without having to advertise the actual, higher price,&#34; the lawsuit said.\n Disclosure: The Advance/Newhouse Partnership, which owns 13 percent of Charter, is part of Advance Publications. Advance Publications owns Condé Nast, which owns Ars Technica.", "posttime": "2020-07-11 02:23:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广播电视,cable,电视", "title": "查特隐藏的“广播电视”费用现在每年增加197美元的有线电视账单", "title_en": "Charter’s hidden “Broadcast TV” fee now adds $197 a year to cable bills", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/07/charter-raises-spectrum-prices-again-boosting-broadcast-tv-fee-to-16-50/", "via": "", "real_tags": ["广播电视", "cable", "电视"]}, {"category": "", "categoryclass": "", "imagename": "2ff5e7c286edeb9c349e5210240215ee.jpg", "infoid": 1011057, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "向谷歌的下一代智能扬声器问好，它有望取代最初的谷歌家庭版(Google Home)。本周早些时候，这款扬声器在日本联邦通信委员会(FCC)的测试中泄露(该机构的名字更酷，名为内务通信省，或MIC&34；)，由于MIC拍摄了一些相当不讨人喜欢的照片，谷歌决定澄清事实，并向多家媒体发送官方新闻截图。\n9to5Google之前在6月份提到过这款设备的存在。报道称，这款扬声器的代号是王子，将取代最初的谷歌主页。据报道，这款扬声器配备了一款带有2英寸驱动器的高偏移扬声器，这应该是对目前谷歌主页的一次音质升级。\n新款音箱采用全布料设计，正面有四个灯，与Nest Mini/Google Home Mini和Google Home Max相匹配。旧的谷歌主页是谷歌产品阵容中的一个异类，它有一个坚硬的塑料顶盖和12个灯。除了布料外观外，这个设计没什么特别之处。在背面，你会发现一个直流电桶连接器，一个徽标和一个静音开关。谷歌发送给XDA开发人员的一段简短视频显示，一个人坐在一对扬声器之间，这表明扬声器可以作为立体声设备配对，这一功能以前只为Google Home Max保留。\n我们实际上并不知道这款产品的名字，但它将从谷歌Nest开始，这是谷歌正在转型的智能家居品牌。这些智能扬声器过去被称为谷歌主页(Google Home)，现在在谷歌商店你会发现两款带有旧品牌的产品：最初的谷歌主页扬声器和谷歌家庭扬声器。对于新的Nest产品，你有Nest Mini(升级到Google Home Mini)、Nest Hub(以前的Google Home Hub智能显示屏)和Nest Hub。这个新的小玩意儿会不会叫成类似“鸟巢之家”的名字呢？Nest议长？没有什么能真正与较小的Nest Mini扬声器相匹配，它听起来像一个小型恒温器。\n谷歌还没有计划何时推出这款产品，但我们开始看到有一大堆产品可能会引发一场硬件活动。还有Pixel4a，这款产品在5月份未能满足谷歌I/O发布窗口的预定要求后，至今仍未投入使用。我们距离谷歌通常发布一款新的旗舰智能手机(今年将是Pixel 5)只有大约3个月的时间。现在是Sabrina Android电视加密狗，听起来像是Android TV和Chromecast的合并，还有这款扬声器。", "note_en": "Say hello to Google&#39;s next smart speaker, which is expected to be a replacement for the original Google Home. Earlier this week, the speaker  leaked via testing at Japan&#39;s FCC equivalent (which has the way-cooler name of &#34;Ministry of Internal Affairs and Communications&#34; or &#34;MIC&#34;), and because MIC took some pretty unflattering pictures, Google decided to set the record straight and send an official press shot to various press outlets.\n 9to5Google previously mentioned the existence of this device in June. The report said the speaker was codenamed &#34;Prince&#34; and would be a replacement for the original Google Home. According to the report, the speaker had a &#34;high excursion speaker with 2-inch driver&#34; which would supposedly be a sound upgrade over the current Google Home.\n The new speaker has an all-cloth design, with four lights on the front, which matches the Nest Mini/Google Home Mini and the Google Home Max. The old Google Home is the one outlier in Google&#39;s lineup, with a hard plastic top and 12 lights. There&#39;s not much to the design other than the cloth exterior. On the back, you&#39;ll find a DC barrel connector for power, a &#34;G&#34; logo, and a mute switch. A brief video Google sent to  XDA Developers features a person sitting between a pair of speakers, which suggests the speakers can be paired as stereo devices, a feature previously reserved only for the Google Home Max.\n  We don&#39;t actually know the name of this thing, but it will start with &#34;Google Nest,&#34; a smart home brand Google is in the middle of transitioning to. These smart speakers used to be called &#34;Google Home,&#34; and currently in the Google Store you&#39;ll find two products with the old branding: the original &#34;Google Home&#34; speaker and the &#34;Google Home Max.&#34; For the new Nest stuff, you have the &#34;Nest Mini&#34; (an upgrade to the Google Home Mini), the Nest Hub (formerly the Google Home Hub smart display), and the Nest Hub Max (a bigger Home Hub). Will this new gizmo be called something like the &#34;Nest Home&#34;? The &#34;Nest Speaker&#34;? Nothing really matches with the smaller &#34;Nest Mini&#34; speaker, which sounds like a tiny thermostat.\n Google doesn&#39;t have an event planned for when this might launch, but we are starting to see a pile of products out there that could create a hardware event. There&#39;s  the Pixel 4a, which is still missing-in-action after failing to meet its presumed  Google I/O launch window in May. We&#39;re also only about three months away from when Google typically launches a new flagship smartphone, which this year would be the Pixel 5. There&#39;s the  &#34;Sabrina&#34; Android TV dongle, which sounds like the merger of Android TV and Chromecast, and there&#39;s this speaker.", "posttime": "2020-07-11 02:23:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌", "title": "谷歌展示下一代智能扬声器，谷歌家庭的替代品", "title_en": "Google shows off next-gen smart speaker, the Google Home replacement", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/google-shows-off-next-gen-smart-speaker-the-google-home-replacement/", "via": "", "real_tags": ["google", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "8b31d089e0fa33bfe7da96d8414b4b36.png", "infoid": 1011055, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司将其业务描述为“多云技术服务”供应商，帮助其客户“设计、构建和运营”云环境。Rackspace突出了对服务的关注，这对于理解其财务状况非常有用，我们稍后会看到这一点。\n但首先，我们要讲一些基础知识。该公司提交的S-1文件显示，该公司可能在公开募股中筹集多少资金的占位符数字为1亿美元。这一数字将会改变，但确实告诉我们，该公司的目标可能是出售股票，使其净收入接近1亿美元，而不是另一个受欢迎的占位符数字5亿美元。\nRackspace将在纳斯达克上市，股票代码为“RXT”。高盛、花旗、摩根大通、加拿大皇家银行资本市场(RBC Capital Markets)和其他银行正在帮助承销其(第二次)首次公开募股(IPO)。\n与后来作为上市公司再次上市的其他私有化公司类似，Rackspace也负债累累。\n截至2020年3月31日，该公司的资产负债表报告的现金和等价物为1.252亿美元。在账簿的另一边，Rackspace的债务为39.9亿美元，其中包括28.2亿美元的定期贷款安排，以及11.2亿美元的优先票据，这让公司损失了8.625%的票面利率，以及其他债务。这笔定期贷款的利率较低，为4%，来自将Rackspace私有化的最初交易(20亿美元)，以及后来“与收购Datapipe有关”的另外8亿美元。\n这些优先票据最初总价值12亿美元或12.亿美元，也来自于2016年交易期间对该公司的收购；私募股权能够用借来的钱收购公司，后来让它们再次上市，并用这些收益来限制由此产生的债务状况，同时保持财务控制，这是有利可图的，尽管有点厚颜无耻。\nRackspace打算利用IPO募集的资金来降低债务负担，包括定期贷款和优先票据。Rackspace到底能拿出多少债务作为抵押品，将取决于其IPO定价。\n这些债务让一家在运营基础上轻松盈利的公司陷入困境，而在净利润基础上则严重无利可图。请注意：\n图片字幕：SEC看一看最右栏，我们可以看到一家收入丰厚的公司，尽管对于一家假想的科技公司来说，毛利率微乎其微。2020年第一季度，该公司营收为6.527亿美元，营业利润为2150万美元。然而，该季度7200万美元的利息支出导致Rackspace严重净亏损4820万美元。\n然而，并不是所有的都失去了，因为Rackspace在相同的三个月期间确实有正的运营现金流。尽管如此，该公司数十亿美元的债务负担仍然很高，负担沉重。\n回到我们对Rackspace业务的讨论，回想一下，它说它销售“多云技术服务”，这告诉我们它的毛利将以服务为重点，也就是说，它们不会是软件级的。但事实并非如此。2020年第一季度，Rackspace的毛利率为38.2%，低于去年第一季度的41.3%。这一趋势令人担忧。\n该公司的增长概况也略有参差不齐。从2017年到2018年，Rackspace的收入从21.4亿美元扩大到24.5亿美元，增长了14.4%。该公司在2019年略有萎缩，营收从2018年的24.5亿美元降至次年的24.4亿美元。考虑到那一年的经济，以及云在2019年的重要性，这个结果有点令人惊讶。\n然而，Rackspace在2020年第一季度确实出现了增长。该公司第一季度营收为6.527亿美元，轻松击败了2019年第一季度6.069亿美元的业绩。该公司在2020年第一季度增长了7.6%。这不算多，特别是在毛利率下降的时期，但恢复增长可能仍然是受欢迎的。\nTechCrunch在今天阅读文件时没有在S-1中看到2020年第二季度的业绩，所以我们假设该公司很快就会重新提交文件，包括更多最近的财务业绩；我们估计，如果不分享第二季度的数据，该公司将很难在新冠肺炎时代以一个有吸引力的价格上市。\n如何评估Rackspace是一个谜。该公司是一家科技公司，这意味着它将找到一些兴趣。但其缓慢的增长速度、沉重的债务和低迷的利润率使得它很难确定一个合理的倍数。我们有的时候会更多。", "note_en": "The company describes its business as a “multicloud technology services” vendor, helping its customers “design, build and operate” cloud environments. That  Rackspace   is highlighting a services focus is useful context to understand its financial profile, as we’ll see in a moment.\n But first, some basics. The company’s S-1 filing denotes a $100 million placeholder figure for how much the company may raise in its public offering. That figure will change, but does tell us that firm is likely to target a share sale that will net it closer to $100 million than $500 million, another popular placeholder figure.\n Rackspace will list on the Nasdaq with the ticker symbol “RXT.” Goldman, Citi, J.P. Morgan, RBC Capital Markets and other banks are helping underwrite its (second) debut.\n  Similar to other companies that went private,  only later to debut once again as a public company, Rackspace has oceans of debt.\n The company’s balance sheet reported cash and equivalents of $125.2 million as of March 31, 2020. On the other side of the ledger, Rackspace has debts of $3.99 billion, made up of a $2.82 billion term loan facility, and $1.12 billion in senior notes that cost the firm an 8.625% coupon, among other debts. The term loan costs a lower 4% rate, and stems from the initial transaction to take Rackspace private ($2 billion), and another $800 million that was later taken on “in connection with the Datapipe Acquisition.”\n The senior notes, originally worth a total of $1,200 million or $1.20 billion, also came from the acquisition of the company during its 2016 transaction; private equity’s ability to buy companies with borrowed money, later taking them public again and using those proceeds to limit the resulting debt profile while maintaining financial control is lucrative, if a bit cheeky.\n Rackspace intends to use  IPO   proceeds to lower its debt-load, including both its term loan and senior notes. Precisely how much Rackspace can put against its debts will depend on its IPO pricing.\n Those debts take a company that is comfortably profitable on an operating basis and make it deeply unprofitable on a net basis. Observe:\n Image Credits: SECLooking at the far-right column, we can see a company with material revenues, though slim gross margins for a putatively tech company. It generated $21.5 million in Q1 2020 operating profit from its $652.7 million in revenue from the quarter. However, interest expenses of $72 million in the quarter helped lead Rackspace to a deep $48.2 million net loss.\n Not all is lost, however, as Rackspace does have positive operating cash flow in the same three-month period. Still, the company’s multi-billion-dollar debt load is still steep, and burdensome.\n Returning to our discussion of Rackspace’s business, recall that it said that it sells “multicloud technology services,” which tells us that its gross margins will be service-focused, which is to say that they won’t be software-level. And they are not. In Q1 2020 Rackspace had gross margins of 38.2%, down from 41.3% in the year-ago Q1. That trend is worrisome.\n The company’s growth profile is also slightly uneven. From 2017 to 2018, Rackspace saw its revenue expand from $2.14 billion to $2.45 billion, growth of 14.4%. The company shrank slightly in 2019, falling from $2.45 billion in revenue in 2018 to $2.44 billion the next year. Given the economy that year, and the importance of cloud in 2019, the results are a little surprising.\n Rackspace did grow in Q1 2020, however. The firm’s $652.7 million in first-quarter top-line easily bested in its Q1 2019 result of $606.9 million. The company grew 7.6% in Q1 2020. That’s not much, especially during a period in which its gross margins eroded, but the return-to-growth is likely welcome all the same.\n TechCrunch did not see Q2 2020 results in its S-1 today while reading the document, so we presume that the firm will re-file shortly to include more recent financial results; it would be hard for the company to debut at an attractive price in the COVID-19 era without sharing Q2 figures, we reckon.\n How to value Rackspace is a puzzle. The company is tech-ish, which means it will find some interest. But its slow growth rate, heavy debts and lackluster margins make it hard to pin a fair multiple onto. More when we have it.", "posttime": "2020-07-11 02:22:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ipo,preps", "title": "\nRackspace在2016年私有化后准备IPO，价格为43亿美元", "title_en": "\n\t\t\t\tRackspace preps IPO after going private in 2016 for $4.3B\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/10/rackspace-preps-ipo-after-going-private-in-2016-for-4-3b/", "via": "", "real_tags": ["ipo", "preps"]}, {"category": "", "categoryclass": "", "imagename": "9ec0c48ae80433883dee1aeb53e103fb.jpg", "infoid": 1011054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "进入资本重组活动，初创企业重组整个市值表格，以排挤旧投资者，引入新投资者，并改变股票和债务的管理方式。对于投资者来说，这是以比平常更友好的条件进入一家公司的杀手锏(阅读：绝望)，也是从你押注的初创公司获得流动性的好方法。\n对于创始人来说，这很少是好消息，因为离开投资者并不是他们要添加到推销平台上的一个衡量标准。正如一位投资者在背景节目中所说，冠状病毒相关资本重组事件的刺激显示出“绝望时期的赫拉稀释”。\n这就是WorkHuman最近资本重组活动的透明度变得更加诱人的原因。\n去年，这个人力资源平台从领英(LinkedIn)、思科(Cisco)、强生(J&amp；)等客户那里获得了5.8亿美元的收入。4月份，业务增长了40%。联合创始人兼首席执行官埃里克·莫斯利表示，自从该公司退出2014年的IPO计划以来，业务规模已经增长了五倍。WorkHuman自2004年以来就没有筹集过一轮风险投资(短期内也不打算这样做)。\n保守的态度得到了回报；尽管WorkHuman已经运营了近20年，但莫斯利表示，他认为公司仍处于“冰山一角”。该公司最近举行了一次资本重组活动，出售其最早投资者的股份，这些投资者在20多年前开出了一张20万美元的支票。", "note_en": "Enter recapitalization events, where startups restructure their entire cap table to squeeze out old investors, bring on new ones and shift the way equity and debt is managed. For investors, it’s a killer way to enter a company on friendlier terms than normal (read: desperation), and a nice way to get liquidity on a startup you’re betting on.\n For founders, it’s rarely good news, as departing investors is not a metric they’re going to add to the pitch deck. As one investor said on background, the spur of coronavirus-related recapitalization events shows “hella dilution for desperate times.”\n That’s what makes  Workhuman’s transparency with its recent recapitalization event all the more enticing.\n Last year, the human-resources platform brought in $580 million in revenue from customers like LinkedIn, Cisco, J&amp;J and other clients. In April, business grew 40%. Co-founder and CEO  Eric Mosley says business has grown five times in size since the company pulled back from its 2014 plans to IPO. Workhuman hasn’t raised a single venture round since 2004 (and doesn’t plan to any time soon).\n Being conservative has paid off; although  Workhuman   has operated for nearly two decades, Mosley says he thinks the company is still at the “tip of the iceberg.” The company recently had a recapitalization event to sell the stakes of its earliest investors, who cut a $200,000 check more than 20 years ago.", "posttime": "2020-07-11 02:22:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "重组,recapitalization,投资者", "title": "\n资本重组的推算", "title_en": "\n\t\t\t\tA recapitalization reckoning\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/10/a-recapitalization-reckoning/", "via": "", "real_tags": ["重组", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "71c0266505582d54379a7d63a7482c88.jpg", "infoid": 1011051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了成长和创新，组织必须想出创造性的想法。在员工层面，创造力来自于专业知识、动力和思维技能的结合。在团队层面，它来自团队成员之间的协同作用，这使得团队能够创造出比其各部分之和更大的东西。\n最广泛使用的激发团队创造力的方法是头脑风暴，这是一种由现实生活中的“广告狂人”亚历克斯·奥斯本(Alex Osborne)在20世纪50年代首次引入的技术。头脑风暴基于四个规则：(A)产生尽可能多的想法；(B)优先考虑不同寻常或原创的想法；(C)结合和改进产生的想法；以及(D)在练习过程中避免批评。这个过程应该是非正式的和无结构的，它是基于两个古老的心理前提。首先，仅仅是其他人的在场就可以对个人的表现产生激励作用。其次，数量(最终)会导致质量。\n奥斯本有一个著名的论断，即集思广益可以使创造性表现比单独工作的人提高近50%。然而，经过60年的独立科学研究，几乎没有证据表明，头脑风暴产生的想法比同样数量的个人独立工作产生的想法更多或更好。事实上，大量证据表明，头脑风暴实际上损害了创造性表现，导致集体表现损失，这与协同效应恰恰相反。\n一项对800多个团队的元分析审查表明，当个人不与他人互动时，他们更有可能产生更多的原创想法。集思广益尤其可能损害大型团队的生产力，因为团队受到密切监督，而且绩效是口头的，而不是书面的。另一个问题是，当团队注意到他们的努力没有产生太多成果时，他们往往会放弃。\n社交游手好闲：有一种趋势--也被称为搭便车--人们在团队中工作时比单独工作时付出的努力更少。就像旁观者效应一样，当我们知道其他人可能会做某事时，我们感觉不那么有动力去做某事。\n社交焦虑：人们担心其他团队成员对自己想法的看法。这也被称为评估忧虑。类似地，当团队成员发现其他人拥有更多专业知识时，他们的表现也会下降。这对于内向和不太自信的人来说尤其成问题。\n回归均值：这是一个向下调整的过程，在这个过程中，最有才华的团队成员最终会与才华较差的团队成员的表现持平。这种效应在体育界是众所周知的--如果你和能力不如你的人一起练习，你的能力水平就会下降，你就会沦落到对手的平庸水平。\n生产阻隔：无论团队规模有多大，如果想让其他团队成员听到，个人一次只能表达一个想法。研究发现，建议的数量停滞不前，团队成员超过6到7个，而人均想法数量随着团队规模的增加而下降。\n主要有两个原因。首先，随着劳动力专业化程度的提高，组织会看到专业知识在员工之间分配。如果解决问题得益于不同类型的知识，从理论上讲，集合正确的人员组合应该会增加房间里的专业知识数量，并导致提出更好的解决方案。然而，在实践中，这种方法需要仔细挑选个人，并艰苦地协调他们的努力。其次，尽管团队不会产生更多或更好的想法，但集思广益可以说比替代方案更民主，因此它可以增强对产生的想法的接受和随后的实施，而不管这些想法的质量如何。\n最终，头脑风暴法继续被使用，因为它直觉上觉得这样做是正确的。因此，这是人才管理内阁中的又一个安慰剂，尽管没有明显的证据，但据信是有效的。所以去吧，安排那次集思广益的会议。除了让你的团队感觉良好之外，别指望它能完成很多事情。", "note_en": "To grow and innovate, organizations have to come up with creative ideas. At the employee level, creativity results from a combination of expertise, motivation, and thinking skills. At the team level, it results from the synergy between team members, which allows the group to produce something greater than the sum of its parts.\n  The most widely used method to spark group creativity is brainstorming, a technique first introduced by Alex Osborn, a real life “Mad Man,” in the 1950s. Brainstorming is based on  four rules: (a) generate as many ideas as possible; (b) prioritize unusual or original ideas; (c) combine and refine the ideas generated; and (d) abstain from criticism during the exercise. The process, which should be informal and unstructured, is based on two old psychological premises. First, that the mere presence of others can have  motivating effects on an individual’s performance. Second, that quantity (eventually)  leads to quality.\n  Osborn famously claimed that brainstorming should enhance creative performance by  almost 50% versus individuals working on their own. Yet after six decades of independent scientific research, there is very little evidence for the idea that brainstorming produces more or better ideas than the same number of individuals would produce working independently. In fact, a great deal of evidence indicates that brainstorming actually harms creative performance, resulting in a collective performance loss that is the very opposite of synergy.\n         A  meta-analytic review of over 800 teams indicated that individuals are more likely to generate a higher number of original ideas when they  don’t interact with others. Brainstorming is particularly likely to harm productivity in large teams, when teams are closely supervised, and when performance is oral rather than written. Another problem is that teams tend to  give up when they notice that their efforts aren’t producing very much.\n    Social loafing: There’s a tendency – also known as free riding – for people to make less of an effort when they are working in teams than alone. As with the bystander effect, we feel less propelled to do something when we know other people might do it.\n  Social anxiety: People worry about other team members’ views of their ideas. This is also referred to as  evaluation apprehension. Similarly, when team members perceive that others have  more expertise, their performance declines. This is especially problematic for introverted and less confident individuals.\n  Regression to the mean: This is the process of downward adjustment whereby the most talented group members end up matching the performance of their less talented counterparts. This effect is well known in sports – if you practice with someone less competent than you, your competence level declines and you sink to the mediocrity of your opponent.\n  Production blocking: No matter how large the group, individuals can only express a single idea at one time if they want other group members to hear them. Studies have found that the number of suggestions plateaus with more than six or seven group members, and that the number of ideas per person declines as group  size increases.\n    There are  two main reasons. First, with the increased specialization of labor, organizations see that expertise is distributed among their employees. If problem-solving benefits from different types of knowledge, assembling the right combination of people should, in theory, increase the amount of expertise in the room and result in better solutions being proposed. However, in practice, this approach would require careful selection of individuals and painstaking coordination of their efforts. Second, even though groups don’t generate more or better ideas, brainstorming is arguably more democratic than the alternatives, so it can enhance buy-in and subsequent implementation of the ideas generated, regardless of the quality of those ideas.\n  Ultimately, brainstorming continues to be used because it feels intuitively right to do so. As such, it is one more placebo in the talent management cabinet, believed to work in spite of the clear absence of evidence. So go ahead, schedule that brainstorming meeting. Just don’t expect it to accomplish much, other than making your team feel good.", "posttime": "2020-07-11 02:20:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "集思广益,brainstorming,团队", "title": "为什么集体集思广益是浪费时间(2015)", "title_en": "Why Group Brainstorming Is a Waste of Time (2015)", "transed": 1, "url": "https://hbr.org/2015/03/why-group-brainstorming-is-a-waste-of-time", "via": "", "real_tags": ["集思广益", "团队"]}, {"category": "", "categoryclass": "", "imagename": "19f2eaf0b14fdd1b69ad149257a1d4fd.jpg", "infoid": 1011050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本演示文稿涵盖了作为计算机安全基础的神奇数学。它以图形化的方式呈现，因此所有人都可以理解复杂的主题。现在..。", "note_en": "This presentation covers the magical math that underlies computer security. It is presented graphically so complex topics can be understood by all. Presentat...", "posttime": "2020-07-11 02:20:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,魔力,math,呈现", "title": "现代密码学中的数学魔力[视频]", "title_en": "The Magic of Math in Modern Cryptography [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=mSMQ-xowqAg", "via": "", "real_tags": ["密码", "魔力", "math", "呈现"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您有任何问题、意见或疑虑，请填写下表。我们期待着您的回音！", "note_en": "If you have any questions, comments, or concerns, please fill out the form below. We look forward to hearing from you!", "posttime": "2020-07-11 02:20:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "北美,indigenous,意见", "title": "谁的土地(北美土著民族)", "title_en": "Whose Land (Indigenous Nations of North America)", "transed": 1, "url": "https://www.whose.land/en/", "via": "", "real_tags": ["北美", "意见"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011048, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果Linux运行在每种体系结构上，为什么要有另一种操作系统挡住它的路呢？\nCollaboration Linux是第一个在Microsoft Windows本机上优化运行Linux的免费开放源码方法。更广泛地说，Cooperative Linux(简称coLinux)是Linux内核的一个端口，它允许它在一台机器上与另一个操作系统协同运行。例如，它允许用户在Windows 2000/XP/Vista/7上自由运行Linux，而无需使用商业PC虚拟化软件(如VMware)，这种方式比使用任何通用PC虚拟化软件都要优化得多。在目前的条件下，它允许我们在Windows上运行KNOPPIX日语版(见屏幕截图)。\nSVN存储库已移至SourgeForge。请使用新的URL。请参阅我们的公共源码控制部分。现有的存储库可以通过以下命令切换到新的URL：SourceForge在这里有更多文档。\n这只是coLinux用户关于英国版Linux Pro Magazine上的一篇文章的说明：&#34；.。我想提一下最新的Linux杂志2012年3月第136期38-41页上的一篇很棒的文章，这是一篇很棒的教程，它将这个下载与colinux、vming和Pulsdio结合使用，以获得在Windows上运行的声音和图形Linux GUI。&#34；\n我们有赞助商愿意完成64位端口，请看oDesk。\n与其他Linux虚拟化解决方案(如用户模式Linux(或前述VMware))不同，主机操作系统上的特殊驱动程序软件用于在特权模式(称为环0模式或管理模式)下执行coLinux内核。\n通过不断地在主机OS状态和和coLinux内核状态之间切换机器的状态，coLinux在其自己专门分配的地址空间中被给予对物理机的MMU的完全控制(即，分页和保护)，并且能够像本地内核一样工作，实现几乎与在同一机器上独立运行的常规Linux所期望的相同的性能和功能。\n由于coLinux对用户空间可执行文件使用与原生Linux相同的二进制格式，因此coLinux可以与主机操作系统并发加载和运行现有的未经修改的Linux发行版。\n为了与主机操作系统协同共享硬件，coLinux不直接访问I/O设备。相反，它与主机操作系统中的coLinux驱动程序提供的仿真设备交互。例如，Windows中的常规文件可以用作coLinux中的块设备。所有实际硬件中断都会透明地转发到主机操作系统，因此主机操作系统对实际硬件的控制不会受到干扰，从而继续平稳运行。\n与用户模式Linux不同，coLinux始终只对其所有Linux进程使用主机操作系统的一个进程，以一种包含且完全独立于主机操作系统实现方式的方式私下管理它们的调度、资源和故障。事实上，coLinux只需要非常小的一组通常从主机OS内核导出的原语就可以工作，因此，可以相当容易地将其移植到任何操作系统(如Solaris，甚至Linux本身)下运行。\n有关此项目的问题可以发送给开发团队成员或列表。", "note_en": "... &#34;If Linux runs on every architecture, why should another operating system be in its way? &#34; ...\n Cooperative Linux is the first working  free and  open source method for optimally running Linux on Microsoft Windows natively. More generally,  Cooperative Linux (short-named coLinux) is a port of the  Linux kernel that allows it to run cooperatively alongside another operating system on a single machine. For instance, it allows one to  freely run Linux on Windows 2000/XP/Vista/7,  without using a commercial PC virtualization software such as  VMware, in a way which is much more optimal than using any general purpose PC virtualization software. In its current condition, it allows us to run the  KNOPPIX Japanese Edition on Windows (see  Screenshots).\n    The SVN repository was moved on SourgeForge. Please use the new URL. Plesse see our section  Public source control.  An existing repository can switch to new URL by this command: SourceForge has more documentation  here\n   Just a  note from coLinux userabout an article in UK version of  Linux Pro Magazine:  &#34;... I would like to mention an excellent article in the current Linux Magazine, issue 136, March 2012, pp 38-41,which is an excellent tutorial that uses this download together with colinux, vming, and pulsaudio to get asound-and-graphics linux gui running on Windows.&#34;\n   We got a sponsor who is willing to complete the port for 64 bit.Please have a look at  oDesk.\n             Unlike in other Linux virtualization solutions such as  User Mode Linux (or the forementioned VMware), special driver software on the host operating system is used to execute the coLinux kernel in a privileged mode (known as ring 0 or supervisor mode).\n By constantly switching the machine&#39;s state between the host OS state and and the coLinux kernel state, coLinux is given full control of the physical machine&#39;s MMU (i.e, paging and protection) in its own specially allocated address space, and is able to act just like a native kernel, achieving almost the same performance and functionality that can be expected from a regular Linux which could have ran on the same machine standalone.\n Since coLinux uses the same binary format for user-space executables as native Linux, coLinux can load and run an existing unmodified Linux distribution concurrently with the host OS.\n   To cooperatively share hardware with the host operating system, coLinux does not access I/O devices directly. Instead, it interfaces with emulated devices provided by the coLinux drivers in the host OS. For example, a regular file in Windows can be used as a block device in coLinux. All real hardware interrupts are transparently forwarded to the host OS, so this way the host OS&#39;s control of the real hardware is not being disturbed and thus it continues to run smoothly.\n  Unlike  User Mode Linux, coLinux always utilizes only one process of the host OS for all its Linux processes, privately managing their scheduling, resources, and faults in a manner which is contained and entirely independent of the way the host OS is implemented. In fact, coLinux only requires a very small set of commonly exported primitives from the host OS kernel in order to work, thus, it can be rather easily ported to run under any operating system, such as Solaris, or even Linux itself.\n    Questions about this project can be sent to a  member of development team or to the  list.", "posttime": "2020-07-11 02:19:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,程序,linux", "title": "协作Linux-将Linux作为Windows驱动程序运行(2011)", "title_en": "Cooperative Linux – running Linux as a Windows driver (2011)", "transed": 1, "url": "http://colinux.org/", "via": "", "real_tags": ["windows", "程序", "linux"]}]