[{"category": "", "categoryclass": "", "imagename": "b0dc082148c781168fc3ce2c5b0291a1.jpg", "infoid": 1004384, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(美国有线电视新闻网)研究人员在绘制了首张生物及其运动的大尺度地图后表示，随着气候变化导致气温上升，南极半岛由藻类大量繁殖产生的绿色积雪可能会蔓延。\n2017年至2019年期间收集的卫星数据，结合南极洲两个夏天的地面测量，使科学家能够绘制出这些微小的藻类在南极半岛的雪地上开花时的地图。\n研究人员告诉CNN，变暖的温度可能会为藻类创造更多的宜居环境，因为藻类需要湿雪才能生长。\n研究人员在周三发表在“自然通讯”(Nature Communications)杂志上的一项研究中表示，单独测量绿色雪藻时，绿色雪藻是微小的，但当这些有机体同时生长时，它们会把雪变成鲜艳的绿色，甚至可以从太空中发现。\n来自剑桥大学和英国南极调查局的研究人员利用欧洲航天局的卫星数据，对南极洲的莱德湾、阿德莱德岛、菲尔德斯半岛和乔治王岛进行了测量。\n沿着南极海岸线可以发现成片的绿色雪藻，通常是在较温暖的地区，在南半球11月至2月的夏季月份，那里的平均气温略高于零摄氏度。\n研究人员说，南极半岛是上个世纪后半叶经历气候变暖最快的地区。\n2月份的气温异常高，而今年早些时候，一股持续9天的热浪烧焦了欧洲大陆的北端。\n科学家们确定了1679种不同的绿藻在雪面上繁殖，面积为1.9平方公里-相当于每年约479吨的碳汇。碳汇是吸收的碳多于释放的碳的储存库。\n这篇论文的主要作者、剑桥大学研究员安德鲁·格雷博士在一份声明中说，随着南极洲变暖，我们预测雪藻的总量将会增加，因为向地势更高的地方扩散将大大超过小岛上小片藻类的损失。\n然而，虽然积雪融化的增加可能会导致更多的藻类生长，但格雷告诉CNN，这些生物的分布与鸟类种群密切相关，鸟类的粪便充当了加速生长的肥料。\n他说，由于鸟类--尤其是企鹅--的数量会受到气温变暖的影响，雪藻可能会失去生长所需的营养来源。\n他解释说，这里非常暗--绿色的雪藻开花将反射大约45%的光线，而新雪将反射大约80%的光线，所以它会增加局部地区的积雪融化速度。\n研究人员发现，近三分之二的水华位于低洼的小岛屿上，并表示，随着全球气温上升导致南极半岛变暖，这些岛屿可能会失去夏季的积雪和藻类-尽管就质量而言，大多数雪藻都是在积雪融化时可以扩散到地势较高的地区发现的。", "note_en": "(CNN)Green snow created by blooming algae in the Antarctic Peninsula is likely to spread as temperatures increase as a result of  climate change, researchers have said, after creating the first large-scale map of the organisms and their movements.\n Satellite data gathered between 2017 and 2019, combined with on-the-ground measurements over two summers in Antarctica, allowed scientists to map the microscopic algae as they bloomed across the snow of the  Antarctic Peninsula.\n Warming temperatures could create more &#34;habitable&#34; environments for the algae, which need wet snow to grow in, researchers told CNN.\n   Green snow alga is microscopic when measured individually, but when the organisms grow simultaneously, they turn the snow bright green, and can even be spotted from space, researchers said in a study published in the  Nature Communications journal on Wednesday.\n  Researchers from the University of Cambridge and the British Antarctic Survey used European Space Agency satellite data with measurements from Antarctica&#39;s Ryder Bay, Adelaide Island, the Fildes Peninsula and King George Island.\n  Patches of green snow algae can be found along the Antarctic coastline, usually in &#34;warmer&#34; areas, where average temperatures are a little above zero degrees Celsius during the Southern Hemisphere&#39;s summer months of November to February.\n  The Antarctic Peninsula is the part of the region that has experienced the most rapid warming in the latter part of the last century, researchers say.\n Unusually high temperatures were  recorded in February, while  a nine-day heatwave scorched the continent&#39;s northern tip earlier this year.\n Scientists identified 1,679 separate blooms of green algae on the snow surface, covering an area of 1.9 km2 -- which equates to a carbon sink of around 479 tons per year. A carbon sink is a reservoir that absorbs more carbon than it releases.\n   &#34;As Antarctica warms, we predict the overall mass of snow algae will increase, as the spread to higher ground will significantly outweigh the loss of small island patches of algae,&#34; Dr Andrew Gray, lead author of the paper, and a researcher at the University of Cambridge, said in a statement.\n  However, while an increase in snow melt could lead to more algae growing, Gray told CNN that the distribution of the organisms is heavily linked to bird populations, whose excrement acts as a fertilizer to accelerate growth.\n As bird -- particularly penguin -- populations are affected by warming temperatures, &#34;the snow algae could lose sources of nutrients to grow,&#34; he said.\n    &#34;It&#39;s very dark -- a green snow algal bloom will reflect about 45% of light hitting it whereas fresh snow will reflect about 80% of the light hitting it, so it will increase the rate of snow melt in a localized area,&#34; he explained.\n Researchers found that almost two thirds of the blooms were on small, low lying islands, and said that as the Antarctic Peninsula warms due to rising global temperatures, these islands could lose their summer snow cover and algae -- although in terms of mass the majority of snow algae is found in areas where they can spread to higher ground when snow melts.", "posttime": "2020-05-30 17:41:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变得,turning,藻类", "title": "南极洲的雪正在变绿-气候变化将使情况变得更糟", "title_en": "Snow is turning green in Antarctica – and climate change will make it worse", "transed": 1, "url": "https://edition.cnn.com/2020/05/21/world/green-snow-antarctica-climate-change-intl-scli-scn/index.html", "via": "", "real_tags": ["变得", "turning", "藻类"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004383, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1976年初，22岁的加里·格林(Gary Green)刚从大学毕业不久，就和父母住在长岛郊区。在周末，他会前往曼哈顿观看魅力摇滚老手、纽约玩偶和有抱负的朋克诗人帕蒂·史密斯(Patti Smith)等人的表演。那年夏天，他在西村租了一套公寓，开始做一名商业摄影师的助理，这份工作让他可以“每晚出门拍照”。\n那年4月，雷蒙斯夫妇发布了他们的同名首张专辑，这是流行文化朋克巨变的第一个信号。格林是一个精明的乐迷，他在正确的时间在正确的地点安装了相机。他开始在鲍威街的CBGB这样的场所拍摄，那里的一个场景正在围绕雷蒙斯、电视、金发女郎和会说话的人头等团体联合起来。格林说，他把自己的照片带到了音乐报纸“纽约摇滚乐”(New York Rocker)上。“编辑艾伦·贝特洛克(Alan Betrock)给了我第一个任务，那就是拍摄这位年轻的摇滚迷歌手罗伯特·戈登(Robert Gordon)。一切都是从那里开始的。“。\n格林的纽约朋克和后朋克场景的单色照片花了44年的时间才随着“当午夜来临”的出版而公之于众。这是一本充满熟悉面孔的书-史密斯，乔伊·雷蒙，理查德·地狱，约翰尼·雷德斯-现在是传奇的和早已消失的地方，如CBGB，麦克斯的堪萨斯城和底线。让它与众不同的是，格林既是一个局内人-有一段时间，他与纽约玩偶的西尔万·西尔万(Sylvain Sylvain)共住一套公寓-也是一个敏锐的社会观察家，他明白自己正在见证一个由局外人和不合群的人推动的重要流行文化时刻。\n他为即将成名的人拍摄的照片不时被匿名个人的肖像所打断，这些人的风格或态度吸引了他的眼球。其结果是一幅民主的肖像，描绘了一个新兴的纽约朋克场景，看起来既遥远又永恒。\n“我以为我在做的是一部社会纪录片。我看过黛安·阿不思的作品，后来会跟教过阿不思的丽赛特·莫德一起上一堂课。我认为这解释了我的直截了当的方式，也解释了我想要射杀那些不出名的人的愿望。“他说。“而且，我从来都不是现场摄影的粉丝。我宁愿转身离开舞台，看看我周围发生了什么。“。\n这本书的开头有两个场景镜头：一对看起来波西米亚式的女人在曼哈顿东村的人行道上卖二手衣服，另一张是曾经散布在时代广场街道上的肮脏色情电影院的地面景色。这是另一个纽约，更加坚韧不拔，一座濒临金融破产的城市。它更被忽视的街区，租金低，犯罪率高，吸引了艺术家和音乐家，他们适应了一种新兴的朋克美学，这种审美以周围的花草为食，并被周围的花草所激发。“下东区现在很时髦，但那时候除非迫不得已，否则我是不会去的。即使是那里的小孩子也很顽强，很有威胁性。“。\n格林1976/77年的早期照片唤起了当时小而不断演变的市中心场景的临时气氛，就像他后来的照片反映了随着朋克变异为后朋克，音乐变得更加艺术和棱角，向更有意识的时尚环境的转变。除了Mudd Club的联合创始人安雅·菲利普斯(Anya Phillips)等纽约编剧外，格林还在底线拍摄了年轻、衣冠楚楚的汤姆·韦茨(Tom Waits)，CBGB中看起来孤单的亚历克斯·切尔顿(Alex Chilton)，以及卢·里德(Lou Reed)和安迪·沃霍尔(Andy Warole)在底线举行的一场早期个人秀。\n“人们在那些俱乐部里是为了引起注意，”他说，“所以进入俱乐部从来没有那么困难。尽管每个人看起来都很酷、超然、强硬，但这是一个相当友好的场景。“\n最耐人寻味的是那些不为人知的面孔。他清楚地记得，有些人，比如切尔西酒店的巴贝特(Babette)和卡特里娜(Katrina)，“他们都是法国人，以‘跳舞’为生。”其他人的名字，他记不起来了。在一张看起来像是在某人厨房里拍摄的照片中，年轻的格林穿着一件干脆的白色衬衫，看起来很聪明，站在西尔万·西尔万(Sylvain Sylvain)和他的后纽约玩偶组合“罪犯”(The Violls)的两名成员旁边。我知道是他，因为格林告诉我了；书中没有明确的说明。\n他解释说：“考虑到许多身份不明的人并不出名，这部电视剧给了每个人同等的待遇，从而使这部电视剧大众化。”“我宁愿人们得到的信息太少，而不是太多。这意味着这些照片是独立存在的。“。\n80年代初，格林曾短暂担任音乐摄影师，为罗伯特·戈登(Robert Gordon)和林克·雷(Link Wray)拍摄专辑封面，并为滚石(Rolling Stone)、DOWNBEST和SOHO周刊新闻(SoHo Weekly News)撰写社论。1986年，他离开这座城市，在城市以北几个小时车程的研究生院就读，试图“真正重新思考和重新调查摄影”。他的老师之一是斯蒂芬·肖尔(Stephen Shore)，在他的影响下，他的实践转向了景观和建筑环境。\n格林现在是一名学者，也是一名老牌摄影师，他还有另外三本摄影集和他的作品被几家美国艺术机构购买。他带着喜爱和一定程度的忧郁回顾自己的朋克照片。“书中有这么多人去世或变老，”他说。“那是我的青春，那是我的音乐，我有太多的时间沉浸在那份工作中，让自己沉浸在其中是一个相当大的挑战。”\n然而，他声称，对那段时间只有一个遗憾：“为什么我没有拍下CBGB里真正破旧的卫生间？”", "note_en": "In early 1976 Gary Green, aged 22 and not long out of college, was living with his parents in the suburbs of Long Island. On weekends he would travel into Manhattan to watch shows by the likes of glam-rock veterans the New York Dolls and aspiring punk poet  Patti Smith. That summer, he rented an apartment in the West Village and began working as an assistant to a commercial photographer, a job that allowed him to “go out every night and take photographs”.\n  That April, the  Ramones released their eponymous debut album, the first signal of the seismic shift in pop culture that was punk. Green was a clued-up music fan with a camera in the right place at exactly the right time. He began shooting in venues like  CBGB  on  the Bowery, where a scene was coalescing around groups such as the Ramones, Television, Blondie and Talking Heads. Green took his photos to the music paper New York Rocker, he says. “The editor, Alan Betrock, gave me my first assignment, which was to photograph this young rockabilly-obsessed singer, Robert Gordon. It all started from there.”\n It has taken 44 years for Green’s monochrome photographs of New York’s punk and post-punk scene to see the light of day with the publication of  When Midnight Comes Around. It is a book filled with familiar faces – Smith,  Joey Ramone,  Richard Hell,  Johnny Thunders – and now legendary and long-gone places such as CBGB, Max’s Kansas City and the Bottom Line. What sets it apart is the sense that Green was both an insider – for a time, he shared an apartment with Sylvain Sylvain of the  New York Dolls – and an acute social observer who understood that he was witnessing an important pop-cultural moment driven by outsiders and misfits.\n His photographs of the soon-to-be-famous are punctuated by portraits of anonymous individuals who caught his eye with their style or attitude. The result is a democratic portrait of an emerging  New York punk scene that looks both distant and timeless.\n “I thought what I was doing was a kind of social documentary. I had seen  Diane Arbus’s work and would later take a class with Lisette Model, who had taught Arbus. I think this accounts for my straight-on approach, but also my desire to shoot people who weren’t famous,” he says. “Also, I was never a fan of live photography. I preferred to turn away from the stage and look at what was going on around me.”\n   The book opens with two scene-setting shots: a pair of bohemian-looking women selling secondhand clothes on a sidewalk in Manhattan’s East Village and a ground-level view of the sleazy porn cinemas that once dotted the streets on Times Square. This is another New York, grittier and edgy, a city close to financial bankruptcy. Its more neglected neighbourhoods, where rents were low and crime rates high, drew artists and musicians attuned to an emerging punk aesthetic that fed off and was energised by the surrounding seediness. “The lower East Side is trendy now, but back then I didn’t go there unless I really had to. Even the little kids there were tough and threatening.”\n Green’s early photographs from 1976/77 evoke the ad-hoc atmosphere of what was then a small, evolving downtown scene, just as his later ones reflect the shift towards a more self-consciously stylish milieu as punk mutated into post-punk, the music becoming more arty and angular. Alongside New York scenesters such as Anya Phillips, co-founder of the Mudd Club, Green also snapped a young, dapper Tom Waits, a lonesome-looking  Alex Chilton in CBGB, and Lou Reed with Andy Warhol at an early solo show by erstwhile New York Doll David Johansen at the Bottom Line.\n  “People were there in those clubs to be noticed,” he says, “so it was never that difficult to get access. Despite the look of everyone – cool, detached, tough – it was a fairly friendly scene.”\n It is the unknown faces that most intrigue. Some, like Babette and Katrina, denizens of the Chelsea Hotel, he remembers well: “They were both French and ‘danced’ for a living.” The names of others, he cannot recall. In one photo, taken in what looks like someone’s kitchen, a young Green, looking smart in a crisp white shirt, stands next to Sylvain Sylvain and two members of his post-New York Dolls group, the Criminals. I know it’s him, because Green told me; there are no identifying captions in the book.\n  “Given that many of the people who can’t be identified were not famous, it democratises the series by giving everyone the same treatment,” he explains. “I would rather people have too little information than too much. It means the pictures stand up on their own.”\n For a short time in the early 80s, Green worked as a jobbing music photographer, shooting album covers for Robert Gordon and  Link Wray as well as editorials for Rolling Stone, Downbeat and SoHo Weekly News. In 1986, he left the city and attended graduate school a few hours north of the city in an attempt “to really rethink and reinvestigate photography anew”. One of his teachers was  Stephen Shore, under whose influence his practice shifted towards landscape and the built environment.\n Green is now an academic and an established photographer, with three other photobooks and his work bought by several US art institutions. He looks back on his punk photographs with fondness and a degree of melancholy. “So many people in the book have died or grown so much older,” he says. “It was my youth, it was my music, and so much of me is tied up in that work that it was quite a challenge to immerse myself in it.”\n Yet he claims to only have one regret about that period: “Why the hell didn’t I photograph the really seedy bathroom in CBGB?”", "posttime": "2020-05-30 16:57:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "格林,leather,照片", "title": "垃圾，皮革，肮脏：加里·格林是如何拍摄纽约朋克场景的", "title_en": "Trash, leather, sleaze: how Gary Green shot New York's punk scene", "transed": 1, "url": "https://www.theguardian.com/artanddesign/2020/may/28/gary-green-photograph-new-york-punk-scene", "via": "", "real_tags": ["格林", "leather", "照片"]}, {"category": "", "categoryclass": "", "imagename": "c94cf70f4708ecc960f2b521749491d4.jpeg", "infoid": 1004382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-Alphabet Inc的谷歌(GOOGL.O)周六表示，鉴于美国的抗议和动荡，该公司推迟了原定下周发布其最新Android 11移动操作系统测试版的计划。\n谷歌在其Android开发者网站上发布的一条消息中表示：“我们很高兴能告诉你们更多关于Android 11的信息，但现在不是庆祝的时候。”\n据该网站称，该活动原定于周三举行。在一条推文中，该公司表示将“很快”宣布新版Android的更多细节，但没有具体说明日期。\n针对明尼阿波利斯黑人乔治·弗洛伊德(George Floyd)被杀一事的抗议活动已经蔓延到美国各地。弗洛伊德是一名白人警察，他的脖子被压在一名白人警察的膝盖下后死亡。", "note_en": "(Reuters) - Alphabet Inc’s (  GOOGL.O) Google on Saturday said it has postponed next week’s planned unveiling of the beta version of its latest Android 11 mobile operating system in light of protests and unrest in the United States.\n “We are excited to tell you more about Android 11, but now is not the time to celebrate,” Google said in a message posted on its Android developers website.\n The event was originally scheduled to take place virtually on Wednesday, according to the website. In a tweet, it said that it will announce more details on the new version of Android “soon,” without specifying any dates.\n Protests have spread across the United States over the killing of George Floyd, a Minneapolis black man who died after being pinned by the neck under a white police officer’s knee.", "posttime": "2020-05-30 16:57:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,android,谷歌,发布,美国", "title": "谷歌在美国的抗议中推迟Android 11的发布", "title_en": "Google postpones Android 11 unveiling amid U.S. protests", "transed": 1, "url": "https://www.reuters.com/article/us-minneapolis-police-google-android/google-postpones-android-11-unveiling-amid-u-s-protests-idUSKBN2360AS", "via": "", "real_tags": ["google", "android", "谷歌", "发布", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该软件计算并显示具有圆锥或多项式表面的光学器件的光线跟踪分析，具有反射、透射、停止和图像质量分析。还有一个优化模块可以增强您的光学设计！\n代码源是GPL，使用Qt，随时发送补丁和请求。GitHub上托管的来源：https://github.com/edeforas/Astree。\n最新版本：版本1.22(2020年5月28日)：-新的现代UI-次要示例修复-添加了Plossl示例(感谢Arnaud Gaillon)", "note_en": "This software computes and shows the ray-tracing analysis of optical devices, having conical or polynomial surfaces, having reflections, transmissions, stops, analysis of the image quality. There is a also an optimization module to enhance your optical designs!\n The code sources are GPL, using Qt, feel free to send patches and request. Source hosted at GitHub :  https://github.com/edeforas/Astree\n Latest build: version 1.22 (05/28/2020): - New modern UI - Minor samples fixes - Added Plossl sample (thanks Arnaud Gaillon)", "posttime": "2020-05-30 16:35:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,软件,射线,ray,光学", "title": "ASTREE 1.22-光学射线跟踪和设计软件", "title_en": "Astree 1.22 – optical ray tracing and design software", "transed": 1, "url": "http://edeforas.free.fr/?p=305", "via": "", "real_tags": ["设计", "软件", "射线", "ray", "光学"]}, {"category": "", "categoryclass": "", "imagename": "23ad5b40eef90674a0218d5452c0c245.jpg", "infoid": 1004380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转要在几何学中搜索，圆填充是研究给定曲面上(大小相等或不同)的圆的排列，使其不会发生重叠，并且不会在不产生重叠的情况下放大圆。排列的相关堆积密度η是圆圈覆盖的表面的比例。可以将其推广到更高的维度--这就是所谓的球体填充，它通常只处理相同的球体。\n虽然圆在欧几里得平面上的最大堆积密度相对较低，为0.9069，但它不是可能的最低密度。最差的形状打包到平面上是未知的，但平滑的八角形的堆积密度约为0.902414，这是已知的任何中心对称凸形中最低的最大堆积密度。[1]诸如星形的凹形的堆积密度可以任意小。\n通常被称为圆填充的数学分支涉及任意大小圆的填充的几何和组合学：这些引起保角映射、黎曼曲面等的离散类似物。\n在二维欧几里德空间中，约瑟夫·路易斯·拉格朗日(Joseph Louis Lagrange)于1773年证明了密度最高的圆的格子排列是六边形排列，即圆的中心排列在一个六边形的格子上(交错排列，就像蜂窝一样)，每个圆被另外6个圆包围。对于直径为D的圆，该排列的密度为。\nηh=(3π4 D 2？3 3 2 D 2)=π3 6≈0.9069.。{\\displaystyle{\\Begin{Alignment}\\eta_{h}&amp；=\\Left({\\frac{3\\pi}{4}}D^{2}\\div{\\frac{3{\\sqrt{3}{2}}D^{2}\\right)\\\\&amp；={\\frac{\\pi{\\sqrt{3}{6}}\\约0.9069。\nD也是第一个图形中六边形的边。上述比例中的第一项3π4D2{\\displaystyle{\\frac{3\\pi}{4}}D^{2}}是所有圆和被六边形包围的部分圆的面积之和。第二项3 3 2 D 2{\\displaystyle{\\frac{3{\\sqrt{3}{2}}D^{2}}是六边形本身的面积。\n发现等圆的六边形堆积可以填满分数。π12≈0.9069{\\fRAC{\\pi}{\\sqrt{12}\\约0.9069}的面积-这是卡尔·弗里德里希·高斯在1831年证明的周期性包装的最大面积。[3]后来，阿克塞尔·图(Axel Thue)在1890年提供了第一个证据，证明这是最优的，表明六边形格子是所有可能的圆形填充中密度最高的，无论是规则的还是不规则的。然而，一些人认为他的证明是不完整的。第一个严格的证明归因于LászlóFejes Tóth在1940年。[2][4]。\n在另一个极端，Böröczky证明了刚性堆积圆圈的任意低密度排列是存在的。[5][6]\n基于飞机的11个均匀平铺，有11个圆形填料。[7]在这些填料中，每个圆可以通过反射和旋转映射到其他圆。六边形的空隙可以用一个圆填充，十二角的空隙可以用7个圆填充，形成3-均匀的填料。具有这两种间隙的截断三角形瓷砖可以作为4-均匀填料填充。缓冲六角形瓷砖有两种镜像形式。\n一个相关的问题是确定被约束在给定曲面内的相同交互点的最低能量排列。汤姆森问题涉及球体表面相同电荷的最低能量分布。Tammes问题是这方面的推广，处理最大化球面上圆之间的最小距离。这类似于在球体上分布非点电荷。\n在休闲数学中，简单有界形状的包装圆是一种常见的问题。容器壁的影响很重要，六角形填料通常不是最优的，对于较少的圆圈。\n还有一系列问题允许圆的大小不均匀。一种这样的扩展是找出具有两个特定大小的圆的系统(双星系统)的最大可能密度。只有九个特定的半径比允许紧密堆积，这是当接触的每一对圆与另外两个圆相互接触时(当线段从接触的圆心绘制到圆心时，它们将对曲面进行三角剖分)。[7]对于所有这些半径比，已知对于具有该半径比的盘的混合物，实现最大可能的堆积分数(高于尺寸均匀的盘的堆积分数)的紧凑填料是已知的。[9]所有9种填料都比均匀三角形填料密度高，一些没有紧密填料的半径比也是如此。[10]。\n还已知，如果半径比大于0.742，则二元混合物不能比大小均匀的盘包装得更好。[8]还得到了在这种二元包装中可以以较小比率获得的密度的上界。[11]。\n正交幅度调制的基础是在相位-幅度空间内将圆圈打包成圆圈。调制解调器将数据作为二维相幅平面中的一系列点进行传输。点之间的间距决定了传输的噪声容限，而外接圆直径决定了所需的发射机功率。当码点星座位于有效圆打包的中心时，性能最大化。在实践中，次优的矩形填充经常被用来简化解码。\n圆圈包装已经成为折纸设计中必不可少的工具，因为折纸人物上的每个附属物都需要一圈纸。[12]罗伯特·J·朗(Robert J.Lang)利用圆包装的数学开发了计算机程序，帮助设计复杂的折纸人物。\n张海洲；王立中(2010)。图厄关于圆包装定理的一个简单证明。arxiv：1009.4322[数学.MG].\n斯蒂芬·沃尔夫勒姆(2002)。一种新的科学。Wolfram Media，Inc.。电话号码是985。ISBN电话：1-57955-008。\n拉兹洛·费耶斯·托斯(1940)。Kugellagerung和Dichteste Kugellagerung；数学课。赞美诗48：676-684。\n^Böröczky，K.(1964)。稳定的Kreis-und Kugelsysteme&#34；年鉴大学布达佩丁科学馆de Rolando Eötvös Nominatae，数学部分。7：79-82。\n^Kahle，Matthew(2012)。稀疏的局部卡住的磁盘填料&#34；。组合学年鉴。16(4)：773-780。DOI：10.1007/s000260121590.。\n^a b汤姆·肯尼迪(2006)。飞机的紧凑包装，有两种尺寸的圆盘。离散几何和计算几何。35(2)：255-267。arxiv：数学/0407145。电话：10.1007/s004541172-4.。\n^a b Heppes，ALADár(2003年8月1日)。飞机上一些密度最高的两个尺寸的圆盘填料。离散几何和计算几何。30(2)：241-262。电话：10.1007/s00454-0030007-6.。\n^Bédaride，Nicolas；Fernique，Thomas(2020年2月17日)。二进制光盘包装的密度&#34；。Arxiv：2002.07168。引用日记账需要|日记账=(帮助)。\n德莱特，大卫；德奥利维拉·菲略，费尔南多·马里奥；瓦伦丁，弗兰克(2012年6月12日)。几个半径的球体填充的上界。数学论坛，西格玛。2.arxiv：1206.2608。doi：10.1017/fms.2014.24.\nD井(1991)。“企鹅奇趣几何词典”(The Penguin Dictionary Of Currical And Interest Geometry)。纽约：企鹅图书。第30-31页，167页。ISBN电话：0-14-011813-6。\n斯蒂芬森，肯尼斯(2003年12月)。圆形包装：数学故事(PDF)。美国数学学会通告。50(11)。", "note_en": "Jump to navigation  Jump to search  In  geometry,  circle packing is the study of the arrangement of circles (of equal or varying sizes) on a given surface such that no overlapping occurs and so that no circle can be enlarged without creating an overlap. The associated  packing density,  η, of an arrangement is the proportion of the surface covered by the circles. Generalisations can be made to higher dimensions – this is called  sphere packing, which usually deals only with identical spheres.\n While the circle has a relatively low maximum packing density of 0.9069 on the  Euclidean plane, it does not have the lowest possible. The &#34;worst&#34; shape to pack onto a plane is not known, but the  smoothed octagon has a packing density of about 0.902414, which is the lowest maximum packing density known of any centrally-symmetric convex shape.  [1]Packing densities of concave shapes such as  star polygons can be arbitrarily small.\n The branch of mathematics generally known as &#34;circle packing&#34; is concerned with the geometry and combinatorics of packings of arbitrarily-sized circles: these give rise to discrete analogs of  conformal mapping,  Riemann surfaces and the like.\n     In two dimensional Euclidean space,  Joseph Louis Lagrange proved in 1773 that the highest-density lattice arrangement of circles is the  hexagonal packing arrangement,  [2] in which the centres of the circles are arranged in a  hexagonal lattice (staggered rows, like a  honeycomb), and each circle is surrounded by 6 other circles. The density of this arrangement for circles of diameter  D, is\n η    h         =    (          3  π   4      D    2    ÷        3      3     2      D    2     )             =        π      3     6    ≈  0.9069.        {\\displaystyle {\\begin{aligned}\\eta _{h}&amp;=\\left({\\frac {3\\pi }{4}}D^{2}\\div {\\frac {3{\\sqrt {3}}}{2}}D^{2}\\right)\\\\&amp;={\\frac {\\pi {\\sqrt {3}}}{6}}\\approx 0.9069.\\end{aligned}}}\n D is also the side of the hexagon in the first figure. The first term                  3  π   4      D    2      {\\displaystyle {\\frac {3\\pi }{4}}D^{2}}   in the ratio above is the sum total of the area of all the circles and partial circles enclosed by the hexagon. The second term                  3      3     2      D    2      {\\displaystyle {\\frac {3{\\sqrt {3}}}{2}}D^{2}}   is the area of the hexagon itself.\n Hexagonal packing of equal circles was found to fill a fraction.                π    12     ≈  0.9069    {\\displaystyle {\\frac {\\pi }{\\sqrt {12}}}\\approx 0.9069}   of area—which was proved maximal for periodic packings by  Carl Friedrich Gauss in 1831.  [3] Later,  Axel Thue provided the first proof that this was optimal in 1890, showing that the hexagonal lattice is the densest of all possible circle packings, both regular and irregular. However, his proof was considered by some to be incomplete. The first rigorous proof is attributed to  László Fejes Tóth in 1940.  [2]  [4]\n At the other extreme, Böröczky demonstrated that arbitrarily low density arrangements of rigidly packed circles exist.  [5]  [6]\n  There are 11 circle packings based on the 11  uniform tilings of the plane. [7] In these packings, every circle can be mapped to every other circle by reflections and rotations. The  hexagonal gaps can be filled by one circle and the  dodecagonal gaps can be filled with 7 circles, creating 3-uniform packings. The  truncated trihexagonal tiling with both types of gaps can be filled as a 4-uniform packing. The  snub hexagonal tiling has two mirror-image forms.\n   A related problem is to determine the lowest-energy arrangement of identically interacting points that are constrained to lie within a given surface. The  Thomson problem deals with the lowest energy distribution of identical electric charges on the surface of a sphere. The  Tammes problem is a generalisation of this, dealing with maximising the minimum distance between circles on sphere. This is analogous to distributing non-point charges on a sphere.\n    Packing circles in simple bounded shapes is a common type of problem in  recreational mathematics. The influence of the container walls is important, and hexagonal packing is generally not optimal for small numbers of circles.\n   There are also a range of problems which permit the sizes of the circles to be non-uniform. One such extension is to find the maximum possible density of a system with two specific sizes of circle (a  binary system). Only nine particular radius ratios permit  compact packing, which is when every pair of circles in contact is in mutual contact with two other circles (when line segments are drawn from contacting circle-center to circle-center, they triangulate the surface).  [7] For all these radius ratios a compact packing is known that achieves the maximum possible packing fraction (above that of uniformly-sized discs) for mixtures of discs with that radius ratio.  [9] All nine have ratio-specific packings denser than the uniform triangular packing, as do some radius ratios without compact packings.  [10]\n It is also known that if the radius ratio is above 0.742, a binary mixture cannot pack better than uniformly-sized discs.  [8] Upper bounds for the density that can be obtained in such binary packings at smaller ratios have also been obtained.  [11]\n   Quadrature amplitude modulation is based on packing circles into circles within a  phase-amplitude space. A  modem transmits data as a series of points in a 2-dimensional phase-amplitude plane. The spacing between the points determines the noise tolerance of the transmission, while the circumscribing circle diameter determines the transmitter power required. Performance is maximized when the  constellation of code points are at the centres of an efficient circle packing. In practice, suboptimal rectangular packings are often used to simplify decoding.\n Circle packing has become an essential tool in  origami design, as each appendage on an origami figure requires a circle of paper.  [12]  Robert J. Lang has used the mathematics of circle packing to develop computer programs that aid in the design of complex origami figures.\n    ^     a     b   Chang, Hai-Chau; Wang, Lih-Chung (2010). &#34;A Simple Proof of Thue&#39;s Theorem on Circle Packing&#34;.  arXiv:  1009.4322 [ math.MG].\n ^   Wolfram, Stephen (2002).    A New Kind of Science. Wolfram Media, Inc. p.  985.  ISBN   1-57955-008-8.\n ^   Tóth, László Fejes (1940). &#34;Über die dichteste Kugellagerung&#34;.  Math. Z.  48: 676–684.\n ^   Böröczky, K. (1964). &#34;Über stabile Kreis- und Kugelsysteme&#34;.  Annales Universitatis Scientiarum Budapestinensis de Rolando Eötvös Nominatae, Sectio Mathematica.  7: 79–82.\n ^   Kahle, Matthew (2012). &#34;Sparse locally-jammed disk packings&#34;.  Annals of Combinatorics.  16 (4): 773–780.  doi: 10.1007/s00026-012-0159-0.\n ^     a     b   Tom Kennedy (2006). &#34;Compact packings of the plane with two sizes of discs&#34;.  Discrete and Computational Geometry.  35 (2): 255–267.  arXiv:  math/0407145.  doi: 10.1007/s00454-005-1172-4.\n ^     a     b   Heppes, Aladár (1 August 2003). &#34;Some Densest Two-Size Disc Packings in the Plane&#34;.  Discrete and Computational Geometry.  30 (2): 241–262.  doi:  10.1007/s00454-003-0007-6.\n ^   Bédaride, Nicolas; Fernique, Thomas (17 February 2020). &#34;Density of Binary Compact Disc Packings&#34;.  arXiv:  2002.07168.   Cite journal requires  |journal= ( help)\n  ^   de Laat, David; de Oliveira Filho, Fernando Mario; Vallentin, Frank (12 June 2012). &#34;Upper bounds for packings of spheres of several radii&#34;.  Forum of Mathematics, Sigma.  2.  arXiv:  1206.2608.  doi: 10.1017/fms.2014.24.\n  Wells D (1991).   The Penguin Dictionary of Curious and Interesting Geometry. New York: Penguin Books. pp.  30–31, 167.  ISBN   0-14-011813-6.\n Stephenson, Kenneth (December 2003).  &#34;Circle Packing: A Mathematical Tale&#34;  (PDF).   Notices of the American Mathematical Society.  50 (11).", "posttime": "2020-05-30 16:34:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "圆形,circle,数学", "title": "圆形填料", "title_en": "Circle Packing", "transed": 1, "url": "https://en.wikipedia.org/wiki/Circle_packing", "via": "", "real_tags": ["圆形", "circle", "数学"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "古腾堡项目的无线电工程师给他儿子的信，约翰·米尔斯这本电子书是供任何人在任何地方免费使用的，几乎没有任何限制。您可以根据本电子书附带的古腾堡项目许可条款复制、分发或重新使用它，也可以在线访问www.gutenberg.net标题：无线电工程师致其子的信函作者：John Mills发布日期：2009年12月16日[ebook#30688]语言：英语字符集编码：ISO-8859-1*本项目的开始古腾堡电子书信函--无线电工程师致儿子*由Roger Frank，Robert Cicconetti和在线分布式校对制作。\n西方电气公司工程部，著有“无线电通信”、“现代科学的现实”和“原子内部”。\n通用无线电公司的磁变仪和可变电容器。韦斯顿仪器公司的伏安表。\n西方电子高音接收器。通用无线电公司通用电气公司可听力仪的晶体探测器装置。\n广播设备，由美国电话电报公司和西方电气公司开发。\n美国电话电报公司广播站，位于纽约市沃克-利斯彭纳德大厦屋顶，长途电话线就是在这里终止的。\n你对无线电话感兴趣，想让我给你解释一下。我将用我能想出的最快捷、最简单的方法来做这件事。这将是我能给出的最简单的解释，但仍然可以让你建造和操作你自己的设备，并理解你将听到的大型商业设备的操作。\n我会给你们写一系列的信，其中只会包含当今广播中最重要的内容，以及如果你们想跟上广播的飞速发展，那些似乎是必要的想法。你会发现有些信件需要重新阅读和学习。在少数情况下，你可能会推迟第二次阅读，直到你读完那些你最感兴趣的东西。我将用这种方式在字母上做记号省略。\n所有的信都会像我对你说的那样写好，因为我会边走边画一些小草图。他们中的一个会告诉你如何亲身体验。这将是所有活动中最有趣的。你可以找到很多书来告诉你收音机是如何操作的，应该怎么做，但是除了一些高级学生以外，很少有书告诉你如何亲身体验。不过，不要把时间浪费在你自己的实验上，你需要非常熟悉其他字母的想法。\n什么是收音机？铜线、锡箔、玻璃板、云母片、金属和木材。它的工作能力是从哪里来的--也就是说，运行布景的“能量”来自哪里？来自电池或发电机。你已经知道这么多了，但是我们可以使用铜线、金属板、音频、水晶和电池来发送和接收信息的真正原因是什么呢？\n原因是，所有这些东西都是由微小的斑点组成的，这些斑点太小了，看不见，我们可以称之为电斑点。斑点只有两种，为了节省时间，我们最好马上给它们取正确的名字。一种叫“电子”，另一种叫“质子”。它们有什么不同？它们的大小可能不同，但我们还不太清楚它们的大小。他们在懒惰方面差别很大。一个人的懒惰程度大约是另一个人的1845倍。也就是说，它的惯性是另一个的1,845倍。启动是困难的，但一旦启动就让它停止，或者改变方向去不同的方向也是同样困难的。质子有更大的惯性。电子更容易启动或停止。\n它们还有什么不同之处呢？他们的行动各不相同。质子不喜欢与其他质子结合，但对电子却相当敏感。还有电子，它们和质子在一起，但是它们不会相互联系。电子总是喜欢靠近质子。当一个是电子，另一个是质子时，两个是相伴的，但三个永远是一群人。\n只要质子是一个电子，而不是另一个质子，那么它与哪个电子相伴并没有什么不同。据我们所知，所有的电子都是一样的，质子也是一样的。这意味着我们世界上所有的东西或物质都是由两种积木组成的，而每种积木都是一样的。你当然不能把这些积木想成砖头，因为我们不知道它们的形状。\n还有另一个原因，你不能把它们当成砖头，那是因为当你用砖头盖房子的时候，每一块砖都必须放在另一块砖上。在一个电子和任何其他电子之间，或者在两个质子之间，或者在一个电子和一个质子之间，通常有一个相对较大的距离。只要它们愿意靠得那么近，就有足够的空间可以把许多其他电子或质子装进它们之间。\n有时他们确实走得很近。我可以告诉你，如果你想象四个小男孩在玩捉迷藏。假设汤姆和迪克不喜欢互相玩耍，如果可以的话，他们会逃跑的。现在假设比尔和山姆如果可以的话不会互相玩耍，但只要有机会，他们中的任何一个都会和汤姆或迪克一起玩耍。现在假设汤姆和比尔看到对方，他们开始跑向对方，准备玩个游戏。但是山姆同时看到了汤姆，所以他开始跑去和他一起，尽管比尔也会在那里。与此同时，迪克看到比尔和山姆在奔跑，因为他们是他天生的玩伴，他就跟着他们。他们马上都聚在一起，玩着一场很棒的游戏；尽管有些男孩不喜欢在一起玩。\n每当有一群质子和电子在一起玩耍时，我们就有了我们所说的“原子”。电子和质子可以玩的游戏大约有九十种，也就是九十种不同的原子。这些游戏在发挥作用的电子和质子的数量以及它们自身的排列方式上有所不同。如果一些原子结合在一起，就可以形成更大的游戏。然后是一个“分子”。在分子中，世界上有多少种物质，就有多少种分子。需要许多分子在一起才能形成足够大的东西才能看得见，因为即使是最大的分子，淀粉分子，也太小了，用最好的显微镜自己也看不见。\n形成什么样的分子将取决于有多少和什么样的原子聚集在一起玩更大的游戏。每当有一场大游戏时，并不意味着进入游戏的小原子基团都会发生变化。他们聚在一起，就像一群童子军在一次有很多军队参加的盛大野餐中一样。不管怎样，它们保持足够的距离，这样我们仍然可以称它们为一个群，也就是一个原子，即使它们确实在一定程度上调整了它们的游戏规则，以便与其他群--即与其他原子--相适应。\n这种原子依赖于什么呢？这将取决于有多少电子和质子聚集在一起玩他们的小游戏。到目前为止，任何原子与其他基团或原子的结合行为将取决于它自己的电子和质子在玩什么样的游戏。\n现在可以玩的最简单的一种游戏，也是电子和质子数量最少的一种，就是由一个质子和一个电子来玩的游戏。我不知道这是怎么玩的，但我猜他们有点像是在绕圈子追逐对方。不管怎样，我知道被称为“氢”的原子只由一个质子和一个电子组成。假设它们被放大到与月球和地球一样大。那么它们之间的距离就差不多了，但较小的是质子。\n那个氢原子负责许多有趣的事情，因为它是一个很好的与其他原子结合的原子。我们通常不会自己找到它，尽管我们可以让它改变伙伴，很容易地从一个分子变成另一个分子。这就是每次你用酸玷污任何东西时都会发生的事情。氢原子离开一个酸分子，然后它就不再是酸了。剩下的也不是一个快乐的群体，因为它失去了一些玩伴。氢气会和被污染的物质结合在一起。但它不会与整个分子结合；它会挑出一部分与之结合，剩下另一部分来取代原来酸分子中氢的位置，而氢就是来自于酸的原始酸分子中的氢原子。我们称之为化学的许多行为仅仅是原子从一个分子到另一个分子的这种变化的结果。\n氢原子不仅喜欢在更大的博弈中与其他类型的原子联系，而且还喜欢与自己的同类原子联系在一起。当它出现时，我们就会有一种氢气分子，这种气体与气球中使用的气体是一样的。\n我们似乎还没有在无线电方面取得很大进展，但当我下次告诉你们的时候，你们可以看到我们将如何去做，我将写到更复杂的游戏，比如在铜原子中玩的游戏，它构成了收音机的导线，以及这些导线是如何做到我们所说的“携带电流”的。\n你们已经了解到，由质子和电子组成的最简单的群，是一个质子和一个电子在快速游戏中相互追逐。这个基团被称为氢原子。氢分子是这些基团中的两个在一起。\n所有其他可能的群体都更为复杂。其次最简单的是氦原子。氦是一种气体，从某些油井中可以获得少量的氦，而且可以获得的量不是很多。正如我们所说的，它是一种惰性气体，因为它不会燃烧，也不会与其他任何东西结合。它不在乎进入更大的分子群游戏。它满足于它的现状，所以它在化学中没有太大的用处，因为你不能用它做任何其他的东西。这就是为什么它被强烈推荐给气球或飞艇充气的原因，因为它不会燃烧或爆炸。它不像氢气那么轻，但它能很好地使气球在空中漂浮。\n这个氦原子由四个电子和四个质子组成。就在中心，有一个紧密拥挤的小群，包含所有的质子10和两个电子。另外两个电子在离这个内部群不远的地方玩耍。如果我们学会把这个内部基团称为原子的“原子核”，我们的解释就更容易了。它是原子的中心，另外两个电子围绕它旋转，就像地球、火星和其他行星以太阳为中心旋转一样。这就是为什么我们称这两个电子为“行星电子”。\n大约有90种不同的原子，它们都有名字。其中一些比氢和氦更熟悉。例如，有铁原子、铜原子、硫原子等等。其中一些原子你们应该知道，所以，在告诉你们更多关于原子是如何由质子和电子形成的之前，我要写下我们在地球和地球上的岩石、海洋的水和上面的空气中拥有的一些原子的名字。\n先从空气开始。它是几种气体的混合物。每种气体都是一种不同的原子。只有一小部分氢和非常少量的氦和其他一些气体，我不会打扰你们学习的。然而，大部分空气是氮气，实际上约占78%，其余几乎所有都是氧气。大约20.8%是氧气，所以除了这两种气体之外，所有的气体只占我们生活的大气的1.2%。\n地球和岩石也含有大量的氧；形成地球和岩石的原子中约有47.3%是氧原子。其余大约一半的原子是一种叫做硅的原子。沙子是由硅和氧原子组成的，你知道有多少沙子。大约27.7%的地球和岩石是硅。地球上第二种最重要的原子是铝，其次是铁，然后是钙。它们的百分比如下：铝7.8%；铁4.5%；钙3.5%；钠2.4%；钾2.4%；镁2.2%。除了最重要的这些，还有大约0.2%的氢和等量的碳。然后还有少量的磷，少量的硫，少量的氟，以及少量的其他不同种类的原子。\n海水主要是氧和氢，大约85.8%的氧和10.7%的氢。这就是你所期望的，因为水是由分子组成的，而分子又是由两个氢原子和一个氧原子组成的。氧原子的重量大约是氢原子的16倍。然而，每个氧原子有两个氢原子，所以水中每磅氢大约有8磅氧。这就是为什么海水中的氧含量是氢含量的8倍。\n因此，大部分海水只是水，也就是纯净水。但它也含有其他一些物质，其中最著名的是盐。盐是一种物质，其分子含有钠原子和氯原子。这就是为什么海水中约有1.1%的钠和2.1%的氯。正如你所预料的那样，海水中还有一些其他种类的原子，因为它得到地球水溶解并带到它身上的所有物质，但它们的数量并不重要。\n现在我们知道了一些重要原子的名称，可以再次讨论它们是如何由质子和电子形成的问题。不管我们处理的是哪种原子，我们总是有一个原子核或中心，一些电子围绕着那个原子核旋转，就像小行星一样。一种原子和其他任何一种原子之间的唯一区别是原子核的不同，以及围绕原子核运动的行星电子的数量和排列的不同。\n不管我们考虑的是哪种原子，它里面总是有和质子一样多的电子。例如，铁原子是由一个原子核和围绕它运动的26个电子组成的。铜原子有29个电子作为其原子核的小行星。那它的核心是什么意思呢？原子核中的质子比电子多29个。银星有更多的行星电子，因为它有47个。镭有88个原子，所有原子中最重的铀原子有92个。\n如果我们想这样做，我们可以用数字来表示不同种类的13个原子，而不是名称。我们可以通过说出原子中有多少行星电子来描述任何一种原子。例如，氢是1号，氦是2号，锂是你可能从未听说过的3号，以此类推。氧是8，钠是11，氯是17，铁是26，铜是29。每种原子都有一个数字。让我们称这个数为它的原子数。\n现在让我们看看原子序数告诉我们什么。以铜为例，它排在第29位。在每个铜原子中，有29个电子在原子核周围运动。原子核本身是一个由电子和质子组成的小内部群，但是它里面的质子比电子多，实际上比电子多29个。在原子中，每个行星电子在原子核中总有一个额外的质子。这使得质子和电子的总数是相同的。\n关于铜原子的原子核，有29个电子在运行，就好像这个原子核是一个老师，负责照看29个在操场上玩耍的孩子。不过，其中有一件很有趣的事，那就是我们必须把所有的学者都想得一模一样，这样老师才不会把他们区分开来。你还记得吗，电子都是一样的。老师或核心所关心的就是在她周围应该有合适的数字在玩。你可以把一个男孩从别的操场带进来，老师看不出他是陌生人，但她会知道事情不对劲，因为她的小组里会多一个人。她只负责29名学者，铜原子核只负责29个电子。只要始终只有29个电子在原子核周围运动，这些电子从哪里来就没有什么不同。如果超过或少于29个，就会发生一些奇怪的事情。\n我们稍后会看到可能发生的事情，但首先让我们想一想，在铜线上会有大量的原子。一根小铜线中将有数十亿个铜原子，每个原子都带有行星电子，围绕着自己的原子核玩着看不见的游戏。在任何原子中，原子核和它负责的任何电子之间都有相当小的距离。通常一个原子基团与另一个原子基团之间仍有较大的距离。\n总体而言，电子围绕自己的原子核保持着相当接近的圆周。总是有一些逃跑的倾向，然后在其他小组里打球。由于有29个电子，难怪有时会有人走神，最终进入另一个原子核的游戏。当然，另一个原子的电子可能会四处游荡，占据刚刚空置的位置，从而使原子核感到满意。\n关于电子是如何在铜线内从一个原子游走到另一个原子的，我们并不都知道，但我们确实知道，在原子之间的空间里，总是有很多电子在游动。他们中的一些人走这条路，另一些人走另一条路。\n当电池连接到铜线上时，受影响的正是这些漂移的电子。每个离开其原基团并四处游荡的单个电子被送往连接到电池的正极板或端子的导线的末端，远离负极板。这就是电池对他们离家出走所做的事情；它会驱动他们沿着电线行驶。它们会有规律的从导线的负端流向正端。当我们有像这样的电子流时，我们说我们有一股电流。\n我们稍后需要学习更多关于电流的知识，但我们首先应该知道的一件事是电池是如何制造的，以及为什么它会影响铜线上的这些漂移电子。这就是我在下一封信中要告诉你的。[1]\n[1]希望以最短路径建造和操作收音机的读者应省略接下来的两个字母。\n当我还是个孩子的时候，我们常常为我们的实验制造我们自己的电池。那是在蓄电池像今天一样被广泛使用之前，当时每个人的汽车起动系统中都有一个蓄电池。那也是在小型干电池问世的前一天，比如我们在袖珍手电筒中使用的干电池。我们制造的电池类似于他们在电报系统中使用的电池，有时被称为“重力”电池。当然，我们尝试了几种，我相信我有时会在房子周围弄得很酸。我只告诉你们一种，但我会用“电子”、“质子”、“核”、“原子”和“分子”这些词，其中一些在我还是个孩子的时候是一无所知的。\n我们用的是直边玻璃瓶，大约能装一加仑。在底部，我们设置了一个星形排列。\n..", "note_en": "Project Gutenberg&#39;s Letters of a Radio-Engineer to His Son, by John Mills\r\rThis eBook is for the use of anyone anywhere at no cost and with\ralmost no restrictions whatsoever. You may copy it, give it away or\rre-use it under the terms of the Project Gutenberg License included\rwith this eBook or online at www.gutenberg.net\r\r\rTitle: Letters of a Radio-Engineer to His Son\r\rAuthor: John Mills\r\rRelease Date: December 16, 2009 [EBook #30688]\r\rLanguage: English\r\rCharacter set encoding: ISO-8859-1\r\r*** START OF THIS PROJECT GUTENBERG EBOOK LETTERS--RADIO-ENGINEER TO SON ***\r\r\r\r\rProduced by Roger Frank, Robert Cicconetti and the Online\rDistributed Proofreading Team at http://www.pgdp.net\n            Engineering Department, Western Electric Company, Inc., \rAuthor of “Radio-Communication,” “The Realities of \rModern Science,” and “Within the Atom”\n                          Variometer and Variable Condenser of the General Radio Company. Voltmeter and Ammeter of the Weston Instrument Company\n        Western Electric Loud Speaking Receiver. Crystal Detector Set of the General Electric Co. Audibility Meter of General Radio Co.\n    Broadcasting Equipment, Developed by the American Telephone and Telegraph Company and the Western Electric Company\n  Broadcasting Station of the American Telephone and Telegraph Company on the Roof of the Walker-Lispenard Bldg. in New York City where the Long-distance Telephone Lines Terminate\n            You are interested in radio-telephony and want me to explain it to you.\rI’ll do so in the shortest and easiest way which I can devise. The\rexplanation will be the simplest which I can give and still make it possible for\ryou to build and operate your own set and to understand the operation of the\rlarge commercial sets to which you will listen.\n  I’ll write you a series of letters which will contain only what is\rimportant in the radio of to-day and those ideas which seem necessary if you are\rto follow the rapid advances which radio is making. Some of the letters you will\rfind to require a second reading and study. In the case of a few you might\rpostpone a second reading until you have finished those which interest you most.\rI’ll mark the letters to omit in this way.\n  All the letters will be written just as I would talk to you, for I shall draw\rlittle sketches as I go along. One of them will tell you how to experiment for\ryourself. This will be the most interesting of all. You can find plenty of books\rto tell you how radio sets operate and what to do, but very few except some for\radvanced students tell you how to experiment for yourself. Not to waste time in\ryour own   4experiments,\rhowever, you will need to be quite familiar with the ideas of the other\rletters.\n  What is a radio set? Copper wires, tinfoil, glass plates, sheets of mica,\rmetal, and wood. Where does it get its ability to work–that is, where does\rthe “energy” come from which runs the set? From batteries or from\rdynamos. That much you know already, but what is the real reason that we can use\rcopper wires, metal plates, audions, crystals, and batteries to send messages\rand to receive them?\n  The reason is that all these things are made of little specks, too tiny ever\rto see, which we might call specks of electricity. There are only two kinds of\rspecks and we had better give them their right names at once to save time. One\rkind of speck is called “electron” and the other kind\r“proton.” How do they differ? They probably differ in size but we\rdon’t yet know so very much about their sizes. They differ in laziness a\rgreat deal. One is about 1845 times as lazy as the other. That is, it has\reighteen hundred and forty-five times as much inertia as the other. It is harder\rto get it started but it is just as much harder to get it to stop after it is\ronce started or to change its direction and go a different direction. The proton\rhas the larger inertia. It is the electron which is the easier to start or\rstop.\n  How else do they differ? They differ in their actions. Protons don’t\rlike to associate with other protons but take quite keenly to electrons. And\relectrons–they go with protons but they won’t associate   5with each other. An electron\ralways likes to be close to a proton. Two is company when one is an electron and\rthe other a proton but three is a crowd always.\n  It doesn’t make any difference to a proton what electron it is keeping\rcompany with provided only it is an electron and not another proton. All\relectrons are alike as far as we can tell and so are all protons. That means\rthat all the stuff, or matter, of our world is made up of two kinds of building\rblocks, and all the blocks of each kind are just alike. Of course you\rmustn’t think of these blocks as like bricks, for we don’t know\rtheir shapes.\n  Then there is another reason why you must not think of them as bricks and\rthat is because when you build a house out of bricks each brick must rest on\ranother. Between an electron and any other electron or between two protons or\rbetween an electron and a proton there is usually a relatively enormous\rdistance. There is enough space so that lots of other electrons or protons could\rbe fitted in between if only they were willing to get that close together.\n  Sometimes they do get very close together. I can tell you how if you will\rimagine four small boys playing tag. Suppose Tom and Dick don’t like to\rplay with each other and run away from each other if they can. Now suppose that\rBill and Sam won’t play with each other if they can help it but that\reither of them will play with Tom or Dick whenever there is a chance. Now\rsuppose Tom and Bill see   6each other; they start running toward each other to get\rup some sort of a game. But Sam sees Tom at the same time, so he starts running\rto join him even though Bill is going to be there too. Meanwhile Dick sees Bill\rand Sam running along and since they are his natural playmates he follows them.\rIn a minute they are all together, and playing a great game; although some of\rthe boys don’t like to play together.\n  Whenever there is a group of protons and electrons playing together we have\rwhat we call an “atom.” There are about ninety different games which\relectrons and protons can play, that is ninety different kinds of atoms. These\rgames differ in the number of electrons and protons who play and in the way they\rarrange themselves. Larger games can be formed if a number of atoms join\rtogether. Then there is a “molecule.” Of molecules there are as many\rkinds as there are different substances in the world. It takes a lot of\rmolecules together to form something big enough to see, for even the largest\rmolecule, that of starch, is much too small to be seen by itself with the best\rpossible microscope.\n  What sort of a molecule is formed will depend upon how many and what kinds of\ratoms group together to play the larger game. Whenever there is a big game it\rdoesn’t mean that the little atomic groups which enter into it are all\rchanged around. They keep together like a troop of boy scouts in a grand picnic\rin which lots of troops are present. At any rate they keep together enough so\rthat we   7can still call\rthem a group, that is an atom, even though they do adapt their game somewhat so\ras to fit in with other groups–that is with other atoms.\n  What will the kind of atom depend upon? It will depend upon how many\relectrons and protons are grouped together in it to play their little game. How\rany atom behaves so far as associating with other groups or atoms will depend\rupon what sort of a game its own electrons and protons are playing.\n  Now the simplest kind of a game that can be played, and the one with the\rsmallest number of electrons and protons, is that played by a single proton and\ra single electron. I don’t know just how it is played but I should guess\rthat they sort of chase each other around in circles. At any rate I do know that\rthe atom called “hydrogen” is formed by just one proton and one\relectron. Suppose they were magnified until they were as large as the moon and\rthe earth. Then they would be just about as far apart but the smaller one would\rbe the proton.\n  That hydrogen atom is responsible for lots of interesting things for it is a\rgreat one to join with other atoms. We don’t often find it by itself\ralthough we can make it change its partners and go from one molecule to another\rvery easily. That is what happens every time you stain anything with acid. A\rhydrogen atom leaves a molecule of the acid and then it isn’t acid any\rmore. What remains isn’t a happy group either for it has lost some of its\rplayfellows. The hydrogen goes and joins with the stuff which gets stained. But\rit doesn’t join with the   8whole molecule; it picks out part of it to associate\rwith and that leaves the other part to take the place of the hydrogen in the\roriginal molecule of acid from which it came. Many of the actions which we call\rchemistry are merely the result of such changes of atoms from one molecule to\ranother.\n  Not only does the hydrogen atom like to associate in a larger game with other\rkinds of atoms but it likes to do so with one of its own kind. When it does we\rhave a molecule of hydrogen gas, the same gas as is used in balloons.\n  We haven’t seemed to get very far yet toward radio but you can see how\rwe shall when I tell you that next time I shall write of more complicated games\rsuch as are played in the atoms of copper which form the wires of radio sets and\rof how these wires can do what we call “carrying an electric\rcurrent.”\n        You have learned that the simplest group which can be formed by protons and\relectrons is one proton and one electron chasing each other around in a fast\rgame. This group is called an atom of hydrogen. A molecule of hydrogen is two of\rthese groups together.\n  All the other possible kinds of groups are more complicated. The next\rsimplest is that of the atom of helium. Helium is a gas of which small\rquantities are obtained from certain oil wells and there isn’t very much\rof it to be obtained. It is an inert gas, as we call it, because it won’t\rburn or combine with anything else. It doesn’t care to enter into the\rlarger games of molecular groups. It is satisfied to be as it is, so that it\risn’t much use in chemistry because you can’t make anything else out\rof it. That’s the reason why it is so highly recommended for filling\rballoons or airships, because it cannot burn or explode. It is not as light as\rhydrogen but it serves quite well for making balloons buoyant in air.\n  This helium atom is made up of four electrons and four protons. Right at the\rcenter there is a small closely crowded group which contains all the protons\r  10and two of the\relectrons. The other two electrons play around quite a little way from this\rinner group. It will make our explanations easier if we learn to call this inner\rgroup “the nucleus” of the atom. It is the center of the atom and\rthe other two electrons play around about it just as the earth and Mars and the\rother planets play or revolve about the sun as a center. That is why we shall\rcall these two electrons “planetary electrons.”\n  There are about ninety different kinds of atoms and they all have names. Some\rof them are more familiar than hydrogen and helium. For example, there is the\riron atom, the copper atom, the sulphur atom and so on. Some of these atoms you\rought to know and so, before telling you more of how atoms are formed by protons\rand electrons, I am going to write down the names of some of the atoms which we\rhave in the earth and rocks of our world, in the water of the oceans, and in the\rair above.\n  Start first with air. It is a mixture of several kinds of gases. Each gas is\ra different kind of atom. There is just a slight trace of hydrogen and a very\rsmall amount of helium and of some other gases which I won’t bother you\rwith learning. Most of the air, however, is nitrogen, about 78 percent in fact\rand almost all the rest is oxygen. About 20.8 percent is oxygen so that all the\rgases other than these two make up only about 1.2 percent of the atmosphere in\rwhich we live.\n    11The earth and\rrocks also contain a great deal of oxygen; about 47.3 percent of the atoms which\rform earth and rocks are oxygen atoms. About half of the rest of the atoms are\rof a kind called silicon. Sand is made up of atoms of silicon and oxygen and you\rknow how much sand there is. About 27.7 percent of the earth and its rocks is\rsilicon. The next most important kind of atom in the earth is aluminum and after\rthat iron and then calcium. Here is the way they run in percentages: Aluminum\r7.8 percent; iron 4.5 percent; calcium 3.5 percent; sodium 2.4 percent;\rpotassium 2.4 percent; magnesium 2.2 percent. Besides these which are most\rimportant there is about 0.2 percent of hydrogen and the same amount of carbon.\rThen there is a little phosphorus, a little sulphur, a little fluorine, and\rsmall amounts of all of the rest of the different kinds of atoms.\n  Sea water is mostly oxygen and hydrogen, about 85.8 percent of oxygen and\r10.7 percent of hydrogen. That is what you would expect for water is made up of\rmolecules which in turn are formed by two atoms of hydrogen and one atom of\roxygen. The oxygen atom is about sixteen times as heavy as the hydrogen atom.\rHowever, for every oxygen atom there are two hydrogen atoms so that for every\rpound of hydrogen in water there are about eight pounds of oxygen. That is why\rthere is about eight times as high a percentage of oxygen in sea water as there\ris of hydrogen.\n  Most of sea water, therefore, is just water, that is, pure water. But it\rcontains some other substances as well and the best known of these is salt. Salt\ris a   12substance the\rmolecules of which contain atoms of sodium and of chlorine. That is why sea\rwater is about 1.1 percent sodium and about 2.1 percent chlorine. There are some\rother kinds of atoms in sea water, as you would expect, for it gets all the\rsubstances which the waters of the earth dissolve and carry down to it but they\rare unimportant in amounts.\n  Now we know something about the names of the important kinds of atoms and can\rtake up again the question of how they are formed by protons and electrons. No\rmatter what kind of atom we are dealing with we always have a nucleus or center\rand some electrons playing around that nucleus like tiny planets. The only\rdifferences between one kind of atom and any other kind are differences in the\rnucleus and differences in the number and arrangement of the planetary electrons\rwhich are playing about the nucleus.\n  No matter what kind of atom we are considering there is always in it just as\rmany electrons as protons. For example, the iron atom is formed by a nucleus and\rtwenty-six electrons playing around it. The copper atom has twenty-nine\relectrons as tiny planets to its nucleus. What does that mean about its nucleus?\rThat there are twenty-nine more protons in the nucleus than there are electrons.\rSilver has even more planetary electrons, for it has 47. Radium has 88 and the\rheaviest atom of all, that of uranium, has 92.\n  We might use numbers for the different kinds of   13atoms instead of names if we wanted to do\rso. We could describe any kind of atom by telling how many planetary electrons\rthere were in it. For example, hydrogen would be number 1, helium number 2,\rlithium of which you perhaps never heard, would be number 3, and so on. Oxygen\ris 8, sodium is 11, chlorine is 17, iron 26, and copper 29. For each kind of\ratom there is a number. Let’s call that number its atomic number.\n  Now let’s see what the atomic number tells us. Take copper, for\rexample, which is number 29. In each atom of copper there are 29 electrons\rplaying around the nucleus. The nucleus itself is a little inner group of\relectrons and protons, but there are more protons than electrons in it;\rtwenty-nine more in fact. In an atom there is always an extra proton in the\rnucleus for each planetary electron. That makes the total number of protons and\relectrons the same.\n  About the nucleus of a copper atom there are playing 29 electrons just as if\rthe nucleus was a teacher responsible for 29 children who were out in the play\ryard. There is one very funny thing about it all, however, and that is that we\rmust think of the scholars as if they were all just alike so that the teacher\rcouldn’t tell one from the other. Electrons are all alike, you remember.\rAll the teacher or nucleus cares for is that there shall be just the right\rnumber playing around her. You could bring a boy in from some other play ground\rand the teacher couldn’t tell that he was a stranger but she would   14know that something was the\rmatter for there would be one too many in her group. She is responsible for just\r29 scholars, and the nucleus of the copper atom is responsible for just 29\relectrons. It doesn’t make any difference where these electrons come from\rprovided there are always just 29 playing around the nucleus. If there are more\ror less than 29 something peculiar will happen.\n  We shall see later what might happen, but first let’s think of an\renormous lot of atoms such as there would be in a copper wire. A small copper\rwire will have in it billions of copper atoms, each with its planetary electrons\rplaying their invisible game about their own nucleus. There is quite a little\rdistance in any atom between the nucleus and any of the electrons for which it\ris responsible. There is usually a greater distance still between one atomic\rgroup and any other.\n  On the whole the electrons hold pretty close to their own circles about their\rown nuclei. There is always some tendency to run away and play in some other\rgroup. With 29 electrons it’s no wonder if sometimes one goes wandering\roff and finally gets into the game about some other nucleus. Of course, an\relectron from some other atom may come wandering along and take the place just\rleft vacant, so that nucleus is satisfied.\n  We don’t know all we might about how the electrons wander around from\ratom to atom inside a copper wire but we do know that there are always a lot of\rthem moving about in the spaces between   15the atoms. Some of them are going one way and some\ranother.\n  It’s these wandering electrons which are affected when a battery is\rconnected to a copper wire. Every single electron which is away from its home\rgroup, and wandering around, is sent scampering along toward the end of the wire\rwhich is connected to the positive plate or terminal of the battery and away\rfrom the negative plate. That’s what the battery does to them for being\raway from home; it drives them along the wire. There’s a regular stream or\rprocession of them from the negative end of the wire toward the positive. When\rwe have a stream of electrons like this we say we have a current of\relectricity.\n  We’ll need to learn more later about a current of electricity but one\rof the first things we ought to know is how a battery is made and why it affects\rthese wandering electrons in the copper wire. That’s what I shall tell you\rin my next letter.   [1]\n  [1]  The reader who wishes the shortest path to the construction and\roperation of a radio set should omit the next two letters.\n          When I was a boy we used to make our own batteries for our experiments. That\rwas before storage batteries became as widely used as they are to-day when\reverybody has one in the starting system of his automobile. That was also before\rthe day of the small dry battery such as we use in pocket flash lights. The\rbatteries which we made were like those which they used on telegraph systems,\rand were sometimes called “gravity” batteries. Of course, we tried\rseveral kinds and I believe I got quite a little acid around the house at one\rtime or another. I’ll tell you about only one kind but I shall use the\rwords “electron,” “proton,” “nucleus,”\r“atom,” and “molecule,” about some of which nothing was\rknown when I was a boy.\n  We used a straight-sided glass jar which would hold about a gallon. On the\rbottom we set a star shaped arrange\n......", "posttime": "2020-05-30 16:11:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "儿子,radio,原子", "title": "无线电工程师给他儿子的信(1922年)", "title_en": "Letters of a Radio-Engineer to His Son (1922)", "transed": 1, "url": "https://www.gutenberg.org/files/30688/30688-h/30688-h.htm", "via": "", "real_tags": ["儿子", "radio", "原子"]}, {"category": "", "categoryclass": "", "imagename": "a52d79cf12a6fb2044595d7dee967f16.jpg", "infoid": 1004377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据CNN新闻的尼克·瓦伦西亚报道，在亚特兰大CNN中心内，抗议乔治·弗洛伊德遇害的示威活动已经演变成暴力事件。#弗洛伊德#CNN..。", "note_en": "CNN's Nick Valencia reports live from inside the CNN Center in Atlanta where demonstrations over the killing of George Floyd have turned violent. #Floyd #CNN...", "posttime": "2020-05-30 16:11:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,cnn,attacking", "title": "攻击CNN的示威者在YouTube上直播", "title_en": "Demonstrators attacking CNN streamed live on YouTube", "transed": 1, "url": "https://www.youtube.com/watch?v=Yve9DhT8Nt4", "via": "", "real_tags": ["youtube", "cnn", "attacking"]}, {"category": "", "categoryclass": "", "imagename": "d5ac22b6724f715986d70f6c316f3742.jpg", "infoid": 1004375, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "即使Windows NT在内部使用UTC，BIOS时钟仍保持在本地时间。为什么会这样呢？\n早期，人们经常在Windows NT和MS-DOS/Windows 3.1之间进行双引导。MS-DOS和Windows 3.1在当地时间运行，因此Windows和NT也是如此，这样你就不必每次更换操作系统时都要不停地更换时钟。\n随着人们从Windows NT升级到Windows 2000，再到Windows XP，必须保留这种时区选择，以便人们可以在以前的操作系统和新操作系统之间进行双引导。\n将BIOS时钟保持在本地时间的另一个原因是为了避免让通过BIOS本身设置时间的人感到困惑。如果您在开机自检期间按下魔术键，BIOS将进入其配置模式，您可以在此配置的内容之一是时间。想象一下，如果您将时间设置为下午3点，然后当您启动Windows时，时钟显示为上午11点，那会有多混乱。\n“愚蠢的电脑。如果它会搞砸，让我再改一次，为什么还要让我改时间呢？“。\n如果你向他们解释，“不，你看，那个时间是世界标准时间，不是当地时间，”他们的反应很可能是“这是什么彻头彻尾的胡说八道？”你是说当电脑问我几点的时候，我必须告诉它伦敦的几点？(除了在北半球的夏天，我必须告诉它雷克雅未克的时间！)。为什么我必须记住我的时区并手动减去四个小时？还是夏天是五点？或许我得加上一句。为什么我还要考虑这件事呢？愚蠢的微软。我的表是三点钟。我打三点。故事结束了。“。\n(更重要的是，一些BIOS内置了闹钟，你可以对它们进行编程，让电脑在特定的时间自动开机。是否每次要设置唤醒呼叫时都要将所有这些时间转换为UTC？)。\n在x86机器上，Windows选择4K的页面大小，因为这是该体系结构在设计操作系统时唯一支持的页面大小。(4MB。\n我没有亲自调试过它，但我认识做过调试的人。在Windows-XP开发期间，一个错误出现在一款电脑游戏上，该游戏在您到达一点后才崩溃", "note_en": "Even though Windows NT uses UTC internally, the BIOS clock stays on local time. Why is that?\n  In the early days, people often dual-booted between Windows NT and MS-DOS/Windows 3.1. MS-DOS and Windows 3.1 operate on local time, so Windows NT followed suit so that you wouldn’t have to keep changing your clock each time you changed operating systems.\n As people upgraded from Windows NT to Windows 2000 to Windows XP, this choice of time zone had to be preserved so that people could dual-boot between their previous operating system and the new operating system.\n Another reason for keeping the BIOS clock on local time is to avoid confusing people who set their time via the BIOS itself. If you hit the magic key during the power-on self-test, the BIOS will go into its configuration mode, and one of the things you can configure here is the time. Imagine how confusing it would be if you set the time to 3pm, and then when you started Windows, the clock read 11am.\n “Stupid computer. Why did it even ask me to change the time if it’s going to screw it up and make me change it a second time?”\n And if you explain to them, “No, you see, that time was UTC, not local time,” the response is likely to be “What kind of totally propeller-headed nonsense is that? You’re telling me that when the computer asks me what time it is, I have to tell it what time it is in   London? (Except during the summer in the northern hemisphere, when I have to tell it what time it is in   Reykjavik!?) Why do I have to remember my time zone and manually subtract four hours? Or is it five during the summer? Or maybe I have to add. Why do I even have to think about this? Stupid Microsoft. My watch says three o’clock. I type three o’clock. End of story.”\n (What’s more, some BIOSes have alarm clocks built in, where you can program them to have the computer turn itself on at a particular time. Do you want to have to convert all those times to UTC each time you want to set a wake-up call?)\n On x86 machines, Windows chooses a page size of 4K because that was the only page size supported by that architecture at the time the operating system was designed. (4MB\n I didn&#39;t debug it personally, but I know the people who did. During Windows XP development, a bug arrived on a computer game that crashed only after you got to one o", "posttime": "2020-05-30 15:49:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,ios,时钟,bios,时间", "title": "为什么Windows使您的BIOS时钟保持在本地时间？", "title_en": "Why does Windows keep your BIOS clock on local time?", "transed": 1, "url": "https://devblogs.microsoft.com/oldnewthing/20040902-00/?p=37983", "via": "", "real_tags": ["windows", "ios", "时钟", "bios", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004373, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我第一次听说Deno 1的时候，我以为它会失败。更好的Node听起来不错，但我看不出它为什么会流行起来。当它达到1.0并在黑客新闻上爆炸时，我既惊讶又有点兴奋。也许它的蒸汽比我想象的要多。节点有疣，打字稿毕竟很棒。读了这篇声明的博客文章，有两点让我印象深刻：\n尽管熟悉Node生态系统，但我仍然对必须阐明我对标准库提供的所有绝对基本需求的依赖关系感到恼火。这对于大型、成熟的项目来说并不是很重要。但是，当您编写大量一次性的、无关的脚本时，痛苦就会累积起来。我发现使用流特别困难，并且惊讶于有这么多不兼容的方式来做同样的事情。当溪流起作用时，它们是很棒的。当他们不这样做的时候-这是非常令人困惑的。\n因此，对于日常脚本，也许ts-node或go会是更好的选择。但是我有一个一次性脚本可以解决的小问题-所以我想我会带Deno试驾一下。\n在介绍我的简单问题之前，我设置了一个hello world脚本。我使用安装页面中的安装说明：\nBREW安装Deno mkdir rename-files&amp；&amp；rename-files&39；console.log(&#34；hello，World！&#34；)&#39；&gt；hello-world.tsdeno运行index.tsCompile file:/hello-world.tshello，World。\n环顾四周，我原本希望从库中提取的许多方法都暴露在Deno全局(例如：deno.cwd()-这些方法列在runtime API下面。标准库是独立的，并且有有趣的文档。它似乎大部分是注释源代码，偶尔的readme.md呈现为HTML。我喜欢这种简约，但不会逗留太久。安装页面提供了用法示例：\n从&#34；https://deno.land/std@0.50.0/http/server.ts&#34；导入{SERVE}；const s=SERVE({port：8000})；控制台。日志(&#34；http://localhost:8000/&#34；)；等待(%s的常量请求){请求。Response({body：&#34；Hello World\\n&#34；})；}。\n如果您熟悉Node，那么import语句可能最为突出。这是来自url的导入行为，被吹捧为npm和Package.json的替代方案。指定标准库的版本对我来说似乎很奇怪--我本以为它会自动(神奇地)绑定到我使用脚本运行的Deno的任何版本(并随脚本一起下载)。感觉很奇怪，但我可能没有足够的上下文来理解。稍后会详细介绍这一点。\n经过反复试验，我让脚本使用Deno run--allow-net example.ts运行。与Node不同，deno要求您授予各种io工具的权限；可以使用deno run-h列出它们。这是直截了当的解决办法。\n基本设置就绪后，我想我已经准备好解决手头的问题了。\n我写日记已经有几年了，4-5年前我决定用一种特定的格式来存储文件：\n在此之前，我有几个使用各种其他约定的日记帐，但它们始终是分组到命名文件夹中的标记文件：\n我想把它们批量转换成其他格式。我可以通过以下方式做到这一点：\n读取文件目录，向下过滤到标记-我们可以使用Node中的readDir来实现这一点，但我通常使用Klaw。当我涉足围棋时，我想起这是它的标准库(Walk)的一部分，所以我去Deno‘s搜索同等的东西，我很惊讶地发现了它。页面本身被注释为源代码…。某些页面呈现标记(如果有Readme.md)。我不会纠结于这种风格的持久性，但我欣赏今天的简约。果然，WALK在Deno标准库中。在标准库页面中：\n这些模块根据DENO版本进行标记。因此，例如，保证v0.3.0标记可以与Deno v0.3.0一起使用。您可以使用网址https://deno.land/std@v0.3.0/.链接到v0.3.0。不指定标记将链接到主分支。\n我按照指令导入Walk，然后使用异步迭代器syntnax编写一个简单的循环：\n从&#34；https://deno.land/std@v1.0.0/fs/mod.ts&#34；；异步函数Readin(srcDir：String){Const Proceded=New&lt；String，String&&gt;；()；导入{WALK}等待(WALK(srcDir，{IncluddeDir：False，EXTS：[&#34；MD&#34；，&#34；mdown&#34；]，})){控制台。日志(条目)；}}。\n编译file:/Users/cloverich/code/scripts/convert-ls-chron-deno/index.tsDownload https://deno.land/std@v1.0.0/fs/mod.tserror：未捕获错误：导入&#39；https://deno.land/std@v1.0.0/fs/mod.ts&#39；失败：在异步进程导入($Deno$/编译器.ts：736：23)的Object.sendAsync($Deno$/ops/Dispatch_json.ts：98：10)的UnwrapResponse($Deno$/ops/Dispatch_json.ts：43：11)中找不到404异步进程导入($Deno$/编译器.ts：753：7)的异步进程导入($Deno$/Compiler.ts：753：7)中的UnwrapResponse($Deno$/ops/Dispatch_json.ts：43：11)中的unwrapResponse($Deno$/ops/Dispatch_json.ts：98：10)。\n就这么多了。我一定是把进口写错了。经过一番挖掘之后，我很不情愿地删除了该版本并链接了主分支。但这会导致另一个错误，并且非常令人困惑：\n编译file:/Users/cloverich/code/scripts/hello-world.tserror：TS2339[错误]：属性&#39；uTime&#39；不存在于&#39；Typeof Deno&#39；等待Deno.utime(DEST，statInfo.atime，statInfo.mtime)；~位于https://deno.land/std/fs/copy.ts:90:16#.。更多的错误。\n以下所有模块都在mod.ts中公开此功能当前不稳定。要启用它，请使用Deno Run-Ustant。\neno run--不稳定的hello-world.ts编译文件：///Users/cloverich/code/scripts/convert-ls-chron-deno/hello-world.ts{路径：&#34；/Users/cloverich/wiki/notes/2013-07-11.md&#34；，名称：&#34；2013-07-11.md&#34；，isFile：True，isDirectory：False，isSymlink：False}#.。等。\n在Node中，我可以使用fs.readFile读取文件。我通常会把这个用util.promisify包起来，这样会更好吃。德诺有点不一样：\n有趣的是，这不需要进口。Deno在其全局名称空间中公开了一些WebAPI(我需要更多地了解这一点)；TextEncoding似乎是编码API的一部分。无论如何，在Node中，编码可以在对readFile的调用中指定。经过一些搜索之后，Deno在STD(Read_File_Str)中提供了一个方便的帮助器。\n继续编写，我天真地在if/Else中写出文件，假设我会在Deno中找到与appendFile fs等价的文件。\nDeno通过write_file_str提供了进一步的增强，但是它不接受用于切换追加文件模式的选项对象。哎呀。\n嗯，我可以解释我所有的想法，但这并不有趣。下面是最后的简短脚本：\n从&#34；https://deno.land/std/fs/mod.ts&#34；；const{读文件，写文件}=取消；//查看读文件/写文件调用常量解码器=NEW(&#34；UTF-8&#34；)；常量编码器=NEW()；导入{WALK，ENURREDIR}。/*使用My Folder/FileName约定将目录内容合并到另一个目录中**@param dateToContents-截断日期字符串(YYYY-MM-DD)到文件内容的字典*@param dir-输出目录*/async函数mergeInto(dateToContents：map&lt；string，string&gt；，dir：string){for(const[dateStr，Contents]of dateToContents){for(const[dateStr，Contents]of dateToContents)。Entries()){//生成文件夹+文件名：yyyy/MM/YYYY-MM-DD.md//ex：2020/03/2020-03-15.md const ymdir=`${dir}/${dateStr。Slice(0，4)}/${dateStr.。Slice(5，7)}`；const outfile=ymdir+&#34；/&#34；+dateStr+&#34；.md&#34；；等待保证目录(Ymdir)；等待WriteFile(输出文件，编码器。Encode(Contents)，{append：true})；}}/*遍历源目录，收集所有文件内容。*@param srcDir*/异步函数readin(srcDir：string){const Processing=new&lt；string，string&gt；()；for AWait(等待)(WAIT(srcDir，{include deDir：false，exts：[&#34；md&#34；，&#34；mdown&#34；]，}){const fileInfo=await stat(entry.path)；//i。我将根据上次修改时间Const dateStr=fileInfo.mtime！将文件重命名为yyyy-mm-dd。toISOString()。切片(0，10)；常量内容=解码器。DECODE(等待readFile(entry.path))；IF(已处理。Has(DateStr)){//追加常量现有=已处理。Get(DateStr)；已处理。set(dateStr，Existing+&#34；\\n&#34；+Contents)；}否则{已处理。set(dateStr，Contents)；}}返回已处理；}const wikiLogs=等待读取(&#34；/Users/cloverich/wiki&#34；)；等待mergeInto(wikiLogs，&#34；/Users/cloverich/Notes/Some-Journal&#34；)；\n该程序简单易懂，在我阅读时只需添加即可进一步简化；当我意识到这一脚本即将完成时，我才意识到这一点。所以我会把这项工作留到下次拜访时再做。\n我喜欢用德诺写这个小剧本。除了关于导入和使用标准库的一些混乱之外，它相对来说是一帆风顺的。不必为琐碎的任务(如mkdirp和walk)引入第三方依赖项是一件令人耳目一新的事情，我可以想象自己会使用Deno来完成更多这样的一次性脚本。\n虽然德诺现在人气飙升，但这是昙花一现吗？如果运行库和标准库继续成熟，我认为对于熟悉javascript但想要更少样板的人来说，deno可能是比ts-node更实用的选择。这会演变成一个成熟的生态系统吗？我不确定，但看起来不像一年前那么牵强了。我认为熟悉Node编程的人在Deno领域不会是一条离水的鱼，所以我认为没有必要“跟上”它的变化；我认为您应该使用感觉更实用或更令人愉快的任何一种。\n一个更难回答的问题(至少对我来说)是，为什么选择Deno而不是Go？我在这里更矛盾。如果Deno的优势是从Go借来的标准库-为什么要麻烦呢？我已经试过几次了，发现它大多是直觉的。我记得字符串解析和JSON操作稍微复杂一些，甚至令人沮丧。当您习惯于将JSON作为一级动态对象操作时，很难想象还有什么比这更实用的了。尤其是对于一次性脚本编写需求。\nRyan Dahl在2018年6月发表了关于Node.js的10件我后悔的事情，他在会上反思了自己在Node早期开发中所犯的错误。最后，他介绍了迪诺，这是他正在做的一个玩具项目。\n↩", "note_en": "When I first heard about Deno   1, I thought it would fizzle. A better Node sounded nice but I couldn’t see why it would take off. When it hit 1.0 and  blew up on hackernews, I was surprised and a little excited. Maybe it had more steam than I thought. Node has warts and Typescript is great after all. Reading the announcement  blog post, two points stood out to me:\n  Despite being familiar with the Node ecosystem, I’m no less annoyed at having to spell out my dependencies for all the utterly basic needs a standard library provides. Its not very important for large, established projects. But when you write a lot of one-off, unrelated scripts, the pain adds up. I found working with streams particularly difficult and was surprised at how many incompatible ways there were to do the same thing. When streams work they are great. When they don’t — its awfully confusing.\n So for day-to-day scripts, maybe  ts-node or Go would be a better option. But I have a small problem a one-off script can solve — so figured I’d take Deno for a test drive.\n  Before laying out my simple problem, I setup a hello world script. I use the installation instructions from the  install page:\n brew  install deno mkdir rename-files  &amp;&amp;   rename-files   &#39;console.log(&#34;hello, world!&#34;)&#39;  &gt; hello-world.tsdeno run index.tsCompile file:///hello-world.tshello, world\n Poking around, many methods I’d expected to pull from a library are exposed on the  Deno global (ex:  Deno.cwd() — these are listed under the r untime API. The  standard library is separate and has interesting documentation. It appears to be mostly commented source code, with the occassional  README.md rendered as HTML. I like the simplicity but don’t linger long. The installation page provides example usage:\n import  { serve  }  from  &#34;https://deno.land/std@0.50.0/http/server.ts&#34; ; const s  =  serve ( { port :  8000  } ) ; console . log ( &#34;http://localhost:8000/&#34; ) ; for  await  ( const req  of s )  { req . respond ( { body :  &#34;Hello World\\n&#34;  } ) ; }\n If you are familiar with Node, the import statement might stand out the most. This is the import from url behavior touted as an alternative to npm and  package.json. Specifying the version of the standard library seems odd to me — I’d expected it to be auto(magically) tied to whatever version of Deno I was running with the script (and, downloaded along side it). Feels odd, but I may not have enough context to understand. More on this later.\n After some trial and error, I get the script to run with  deno run --allow-net example.ts. Unlike Node, Deno requires you to grant permissions for various io facilities; they can be listed with  deno run -h. This was straight forward to figure out.\n With the basic setup out of the way, I think I am ready to tackle the problem at hand.\n  I’ve been journaling for years, and 4-5 years ago settled on a certain format for storing files:\n  I have a couple journals prior to that using various other conventions but they are always markdown files grouped into a named folder:\n  I’d like to convert them in bulk to the other format. I can do this by:\n   Reading a directory of files, filtering down to markdown — we can do this with  readDir in Node, but I usually use  klaw. When I dabbled in Go I remembered this was part of its standard library ( walk), so I go searching the equivalent in Deno’s. I was pleasantly surprised  to find it. The page itself is commented source code… some pages render markdown (if there is a README.md). I don’t linger on the longevity of this style but appreciate the simplicity today. Sure enough,  walk is in the Deno standard library. From the standard library page:\n These modules are tagged in accordance with Deno releases. So, for example, the v0.3.0 tag is guaranteed to work with deno v0.3.0. You can link to v0.3.0 using the URL  https://deno.land/std@v0.3.0/. Not specifying a tag will link to the master branch.\n I import walk per the instructions, then write a simple loop using  async iterator syntnax:\n import  { walk  }  from  &#34;https://deno.land/std@v1.0.0/fs/mod.ts&#34; ; async  function  readIn ( srcDir :  string )  {  const processed  =  new   &lt; string ,  string &gt; ( ) ;  for  await  ( const entry  of  walk (srcDir ,  { includeDirs :  false , exts :  [ &#34;md&#34; ,  &#34;mdown&#34; ] ,  } ) )  {  console . log (entry ) ;  } }\n  Compile file:///Users/cloverich/code/scripts/convert-ls-chron-deno/index.tsDownload https://deno.land/std@v1.0.0/fs/mod.tserror: Uncaught Error: Import  &#39;https://deno.land/std@v1.0.0/fs/mod.ts&#39; failed:  404 Not Found at unwrapResponse  ( $deno$/ops/dispatch_json.ts:43:11 ) at Object.sendAsync  ( $deno$/ops/dispatch_json.ts:98:10 ) at async processImports  ( $deno$/compiler.ts:736:23 ) at async processImports  ( $deno$/compiler.ts:753:7 ) at async compile  ( $deno$/compiler.ts:1316:31 ) at async tsCompilerOnMessage  ( $deno$/compiler.ts:1548:22 ) at async workerMessageRecvCallback  ( $deno$/runtime_worker.ts:74:9 )\n So much for that. I must have written the import incorrectly. After some digging I reluctantly remove the version and link the master branch. But this results in another error, and it is quite confusing:\n Compile file:///Users/cloverich/code/scripts/hello-world.tserror: TS2339  [ERROR ]: Property  &#39;utime&#39; does not exist on    &#39;typeof Deno&#39;  await Deno.utime (dest, statInfo.atime, statInfo.mtime ) ; ~~~~~ at https://deno.land/std/fs/copy.ts:90:16 # ... many more errors\n  All the following modules are exposed in mod.ts This feature is currently unstable. To enable it use deno run —unstable\n  eno run  --unstable hello -world .ts Compile file : / //Users/cloverich/code/scripts/convert-ls-chron-deno/hello-world.ts { path :  &#34;/Users/cloverich/wiki/notes/2013-07-11.md&#34; , name :  &#34;2013-07-11.md&#34; , isFile :  true , isDirectory :  false , isSymlink :  false }#  ... etc\n    In Node I could read a file with  fs.readFile. I would usually wrap this w/ util.promisify to make it more palatable. Its a bit different in Deno:\n  Interestingly, there’s no imports required for this. Deno exposes some Web APIs in its global namespace (I need to learn more about this);  TextEncoder seems part of the  Encoding API. At any rate, in Node the encoding could be specified in the call to readFile. After some searching, Deno provides a convenience helper in std (  read_file_str.)\n Moving on to writing, I naively write out the file in an if / else, assuming I’ll find an  appendFile fs equivalent in Deno.\n    Deno provides a further enhancement with   write_file_str but it does not accept an options object to toggle append file mode. Shucks.\n  Well, I could explain all of my thinking but its not interesting. So here’s the final short script:\n import  { walk , ensureDir  }  from  &#34;https://deno.land/std/fs/mod.ts&#34; ; const  { readFile , writeFile  }  = Deno ; // See readFile / writeFile calls const decoder  =  new   ( &#34;utf-8&#34; ) ; const encoder  =  new   ( ) ; /** * Merge a directories content into another, using my folder / filename conventions * * @param dateToContents - Dictionary of truncated date strings (YYYY-MM-DD) to file contents * @param dir - The output directory */ async  function  mergeInto ( dateToContents : Map &lt; string ,  string &gt; , dir :  string )  {  for  ( const  [dateStr , contents ]  of dateToContents . entries ( ) )  {  // Generate folders + filename: YYYY/MM/YYYY-MM-DD.md  // ex: 2020/03/2020-03-15.md  const ymdir  =   `  ${dir } /  ${dateStr . slice ( 0 ,  4 ) } /  ${dateStr . slice ( 5 ,  7 ) } ` ;  const outfile  = ymdir  +  &#34;/&#34;  + dateStr  +  &#34;.md&#34; ;  await  ensureDir (ymdir ) ;  await  writeFile (outfile , encoder . encode (contents ) ,  { append :  true  } ) ;  } } /** * Walk a source directory and collect all file contents. * @param srcDir */ async  function  readIn ( srcDir :  string )  {  const processed  =  new   &lt; string ,  string &gt; ( ) ;  for  await  ( const entry  of  walk (srcDir ,  { includeDirs :  false , exts :  [ &#34;md&#34; ,  &#34;mdown&#34; ] ,  } ) )  {  const fileInfo  =  await  stat (entry .path ) ;  // I&#39;ll rename file to yyyy-mm-dd based on last modified time  const dateStr  = fileInfo .mtime ! . toISOString ( ) . slice ( 0 ,  10 ) ;  const contents  = decoder . decode ( await  readFile (entry .path ) ) ;  if  (processed . has (dateStr ) )  {  // append  const existing  = processed . get (dateStr ) ; processed . set (dateStr , existing  +  &#34;\\n&#34;  + contents ) ;  }  else  { processed . set (dateStr , contents ) ;  }  }  return processed ; } const wikiLogs  =  await  readIn ( &#34;/Users/cloverich/wiki&#34; ) ; await  mergeInto (wikiLogs ,  &#34;/Users/cloverich/notes/some-journal&#34; ) ;\n The program is straight foward, and could be further simplified by simply appending as I read; by the time I realized that this one off script was nearly done. So I’ll save that work for my next visit.\n  I enjoyed writing this small script in Deno. Other than some confusion around importing and using the standard library, it was relatively smooth sailing. Not having to pull in 3rd party dependencies for trivial tasks (like  mkdirp and  walk) was refreshing, and I could see myself using Deno for more one off scripts like this.\n While Deno spiked in popularity now, is it a flash in the pan? If the runtime and standard library continue to mature, I think there’s a valid argument that Deno may be a more practical choice than something like  ts-node for people who are familiar with javascript but want less boilerplate. Will that evolve into a mature ecosystem? I’m not sure, but it doesn’t seem as far fetched as it did a year ago. I think someone familiar with Node programming wouldn’t be a fish out of water in Deno land, so I don’t think there’s a need to “keep up” with its change; I’d argue you should use whichever one feels more practical or pleasant.\n A more difficult question to answer (for me anyways), is why choose Deno over Go? I am more conflicted here. If an advantage of Deno is the standard library borrowed from Go — why bother? I’ve dipped my toes into it a few times, and found it mostly intuitive. I remember string parsing and JSON manipulation to be a bit more involved, even frustrating. When you are used to manipulating JSON as first class dynamic objects, its difficult to imagine anyting else being more practical. Particularly for one-off scripting needs.\n Ryan Dahl’s  10 Things I regret about Node.js in June 2018, where he reflected on mistakes he made in Node’s early development. At the end he introduced Deno as a toy project he was working on.\n ↩", "posttime": "2020-05-30 15:26:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "德诺,deno", "title": "带德诺去兜风", "title_en": "Taking Deno for a Spin", "transed": 1, "url": "https://pinecoder.dev/blog/2020-05-23/deno-test-drive", "via": "", "real_tags": ["德诺", "deno"]}, {"category": "", "categoryclass": "", "imagename": "37ab47c02176bcc3f903faf794518d91.jpg", "infoid": 1004372, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊将停止生产Echo Look相机，这是一款使用人工智能和机器学习为用户提供时尚建议的独立设备。Look的配套应用程序和设备本身将于7月24日停止运行。从现在到2021年7月24日，Look用户可以通过创建一个免费的亚马逊照片账户来备份他们的图片和视频。(拥有现有照片帐户的用户将自动备份其媒体。)。任何想要删除所有现有照片和视频的人都必须在2020年7月的最后期限之前删除这些照片和视频；否则，他们将不得不打电话给亚马逊的客服，让他们删除这些照片和视频。他们目前可以通过Look应用程序删除它们。\n亚马逊指出，Echo Look的大部分功能现在都包括在亚马逊购物应用程序中，包括Alexa的Style，其中包括提供时尚指针的人工智能。该公司表示，人们应该下载这款应用程序，继续向亚马逊咨询，他们还应该通过亚马逊的计划回收他们的外观。\nEcho Look于2017年首次推出，多年来收到了新功能，包括一个收藏工具，来自Vogue和GQ的精选内容，以及语音档案支持。将Look的功能添加到亚马逊购物应用中是有意义的，因为它可以让更多的人获得亚马逊的时尚建议。此外，它还简化了整个流程，允许人们使用一台设备购物和拍照。", "note_en": "Amazon  is discontinuing its Echo Look camera, a standalone device that gave owners fashion advice using artificial intelligence and machine learning. The Look’s companion app and the device itself will stop functioning on July 24th. Between now and July 24th, 2021, Look users can back up their images and videos by making a free Amazon Photos account. (People with existing Photos accounts will have their media backed up automatically.) Anyone who wants to delete all their existing photos and videos will have to do so before the July 2020 deadline; otherwise, they’ll have to call Amazon’s customer service to have them deleted. They can currently delete them through the Look app.\n Amazon points out that much of the Echo Look’s functionality is now included in the Amazon Shopping app, including Style by Alexa, which involves the AI offering fashion pointers. The company says people should download the app to keep consulting with Amazon, and they should also recycle their Look  through Amazon’s program.\n The Echo Look first came out in 2017 and  received new features over the years, including a collections tool, curated content from  Vogue and  GQ, and voice profile support. Putting the Look’s functionality into the Amazon Shopping app makes sense, given that it allows more people access to Amazon’s fashion advice. Plus, it streamlines the entire process, allowing people to use one device to shop and take photos of themselves.", "posttime": "2020-05-30 15:05:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,echo,longer,应用程序", "title": "亚马逊将不再支持Echo外观，鼓励所有者回收他们的", "title_en": "Amazon Will No Longer Support the Echo Look, Encourages Owners To Recycle Theirs", "transed": 1, "url": "https://www.theverge.com/2020/5/29/21274805/amazon-echo-look-discontinue-gadget-shopping-recycle-fashion-camera", "via": "", "real_tags": ["amazon", "亚马逊", "echo", "longer", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004371, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想做$件事。通常我使用Python进行黑客攻击，这是可以的，但有很多问题。我的朋友告诉我，语言更适合做事情。看过在线教程之后，我就知道为什么了。也许我会为这个项目尝试$Language！只有几件事我需要先弄清楚：\n我怎么安装它？医生说要安装BREW，但我用的是Windows。\n我该怎么写这些呢？我要下载IDE吗？有Vim插件吗？这是否表面上与编辑无关，但实际上应该使用Emacs？哎呀，有两个相互竞争的插件。社区之间互相憎恨。我该选哪一个呢？\n我如何从文件中读取？如何解析JSON？如何拉取环境变量？我该如何做一些不是核心语法/语义的一部分，但却是人们每天面临的超级常见问题的事情呢？\n我还得记住另外100个函数和它们的参数，不是吗？\n我需要一个小时才能发现哪些语言怪癖？有什么东西与我习惯的完全不同，会让我感到困惑？每次我切换回一种不同的语言时，什么会让我绊倒？\n帮助是如何组织的？有官方网站吗？场地是怎么布置的？除了“完全的新手”和“语言维持者”之外，它还为人们提供文档吗？\n我可以下载官方文档吗，或者我必须在线才能阅读任何参考资料？\n哦，等等，我应该向$book学习，它只提供实物形式。\n我遇到了问题X。我应该在官方文档、常见问题解答或社区中寻求帮助，还是应该将随机的东西放到Google中？哦，看起来有人在2007年回答了这个问题！那是八个版本之前的事了。他们是仍然正确，还是他们的建议已经过时了？\n我发现了2011年的一些东西，说2007年的那个人是错的。我应该按照2011年的花花公子说的做，还是应该假设他的建议也已经过时了？\n我如何调试？除了“闯入爬虫”之外，做其他事情会不会像拔牙一样？这是否属于那些认为调试器适用于n00b的社区之一，您应该编写大量的打印语句？\n测试。单元测试是核心库的一部分，还是需要安装第三方框架？或者Ruby如何拥有Minitest、RSpec和Test：：Unit，人们会为哪一个最好而争论不休。\n试跑者是如何工作的？在放弃并在单独的终端中运行它之前，我应该尝试将其与我的开发环境集成多长时间？\n我该如何建造呢？我该怎么包装呢？我如何管理我的环境？由于各种原因，我应该使用的非默认命令标志有哪些？\n包裹管理。我怎样才能找到我需要的包裹呢？如果有多个相互竞争的软件包，我如何决定应该使用哪一个？\n社会上有甚麽“规范”方案是有共识的呢？我是否必须深入社区才能找到我需要安装的内容？\n所以…。语言社区。他们在哪里？我还得加入另一个“松弛”吗？是否还要安装另一款消息传送应用程序？我是否必须设置一台专用机器才能保持与IRC通道的连接？\n哪些看似无伤大雅的话题总是会变成火药桶？我的问题问得安全吗？\n现在他们在解释一些我无法理解的事情。这是必要的吗，还是他们只是被知识诅咒了？\n他们对其他编程语言有什么看法？他们会因为我写了很多Python而看不起我吗？\n我在我的时事通讯上分享了这篇文章的初稿。如果你喜欢我的作品，为什么不订阅呢？", "note_en": "I want to do $THING. Normally I do my hacking in Python, which is  okay but has lots of frustrations. My friends tell me $LANGUAGE is better for doing $THING. After going through the online tutorial, I can see why. Maybe I’ll try $LANGUAGE for this project! Just a few things I need to figure out first:\n How do I install it? The docs say  brew install, but I’m on Windows.\n How am I supposed to be writing this? Do I download an IDE? Is there a Vim plugin? Is this ostensibly editor-agnostic but  really supposed to use Emacs? Uh oh, there’s two  competing plugins. The communities hate each other. Which do I choose?\n How do I read from a file? How do I parse JSON? How do I pull environment variables? How do I do any of the things that aren’t part of the core syntax/semantics but are super common problems people face every day?\n I’m going to have to memorize another 100 functions and their parameters, aren’t I?\n What are the language quirks that will cost me an hour to discover? What are the things that are  just different enough from what I’m used to that will confuse me? What will trip me up every time I switch back to a different language?\n How is the help organized? Is there an official site? How’s the site laid out? Does it have documentation for people  besides “complete newbies” and “language maintainers”?\n Can I download the official docs, or will I have to be online to read any of the references?\n  Oh wait, I’m supposed to learn from $BOOK, which is only available in physical form.\n I hit problem X. Should I look for help in the official docs, or the FAQ, or the community, or should I be putting random stuff into Google? Oh, looks like someone answered this in 2007! Which was eight versions ago. Are they still right or is their advice obsolete?\n I found something from 2011 that said the 2007 person was wrong. Do I do what 2011 dude says or should I assume his advice is  also obsolete?\n How do I debug? Will doing anything other than “break into repl” be like pulling teeth? Is this one of those communities which think debuggers are for n00bs and you should write a lot of print statements?\n Testing. Is unit testing part of the core library, or do I need to install a third party framework? Or how Ruby has  Minitest,  rspec,  and  Test::Unit, and people get into fights about which is best.\n  How does the test runner work? How long should I try to integrate it with my dev environment before giving up and running it in a separate terminal?\n How do I build? How do I package? How do I manage my environment? What are all the command flags I  should be using that aren’t default for various reasons?\n Package management. How do I find the packages I need? If there are multiple competing packages, how do I decide which one I should use?\n   What are the “canonical” packages the community has consensus on? Am I going to have to dive into the community to find out what I need to install?\n So… the language community. Where are they? Will I have to join Yet Another Slack? Install Yet Another Messaging App? Do I have to set up a dedicated machine just to keep connected to an IRC channel?\n    What innocuous-seeming topics always turn into a flamewar? Is my question even safe to ask?\n Now they’re explaining something way above my head. Is this necessary to get, or are they just  cursed with knowledge?\n What opinions do they have on  other programming languages? Are they going to look down on me for writing a lot of Python?\n  I shared the first draft of this essay on my  newsletter. If you like my writing, why not subscribe?", "posttime": "2020-05-30 15:04:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学习,part,应该", "title": "学习一门语言的难点", "title_en": "The Hard Part of Learning a Language", "transed": 1, "url": "https://www.hillelwayne.com/post/learning-a-language/", "via": "", "real_tags": ["学习", "part", "应该"]}, {"category": "", "categoryclass": "", "imagename": "5987a0123b9c8e9a7fa6c0d639646f76.jpeg", "infoid": 1004370, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔纳森·博卡拉(Jonathan Boccara)写的，但就像一位同时也是超级英雄叔叔的哲学家曾经说过的那样，权力越大，责任就越大。\n翻译成C++，这意味着如果您不小心，一些让您编写富于表现力的代码的C++功能可能会掉头并产生错误代码，而这些代码并没有做它应该做的事情。\n一个很好的例子(美丽的一些定义)是逗号操作符的重载。正如我们将要看到的，工作代码中一个非常细微的变化就会使它变得非常错误。\n首先，逗号操作符是一个东西。它对所有类型的默认实现都是这样做的：a，b计算a，然后计算b，然后返回b。例如，1，2返回2。\n通常不推荐这样做，但是C++允许重载逗号操作符。下面是一篇关于重载逗号操作符的详细文章，您可以阅读该文章以更好地了解该主题。\n重载逗号操作符可以让我们做一些好事。例如，这是Boost Assign用来允许我们将数据追加到现有向量中的内容：\n如果不重载逗号运算符，我们就不能用标准C++编写此表达式，即使在C++20中也是如此。一旦构造了向量，我们只能使用PUSH_BACK成员函数逐个添加元素。\n前面的代码允许我们用非常有表现力的代码向现有向量添加元素。\n下面是Boost Assign的一个非常简化的实现，它允许我们编写前一行代码(感谢此实现的Nope)：\nTemplate&lt；TypeName Vector&gt；struct{Vector&amp；vec；Template&lt；TypeName T&gt；Appder&lt；Vector&gt；Operator，(const T&amp；e){vec.Push_back(E)；return*this；}}；Template&lt；TypeName T&gt；Appder&lt；std：：Vector&lt；T&gt；&gt；Operator+=(STT。e){v.push_back(E)；return{v}；}int(){auto data=std：：Vector&lt；int&gt；{}；data+=1，2，3，4，5；对于(auto&amp；&amp；e：data)std：：cout&lt；&lt；&#39；&lt；&lt；e；std：：cout&lt；&lt；&#39；\\n。\n附加器重载逗号运算符。当此附加器与2关联时，它会将其添加到向量中并返回自身。\n然后，附加器与3相关联并将其添加，然后是4，然后是5。\n现在，让我们对我们的代码做一点小小的修改。让我们将逗号操作符定义为自由函数，而不是将其定义为成员函数。例如，这可能是可取的，因为它允许隐式转换，如Efficient C++的第24项中所述。\nTemplate&lt；TypeName Vector&gt；struct{Vector&amp；vec；}；Template&lt；TypeName Vector，TypeName T&gt；Appder&lt；Vector&gt；&amp；Operator，(Appder&lt；Vector&gt；&amp；v，Const T&amp；e){v.vec.Push_back(E)；return v；}Template&lt；TypeName T&gt；Appder&lt；ST.。v，const T&amp；e){v.ush_back(E)；return{v}；}int(){auto data=std：：Vector&lt；int&gt；{}；data+=1，2，3，4，5；对于(auto&amp；&amp；e：data)std：：cout&lt；&lt；&#39；&39；&lt；&lt；e；std：：cout&lt；&ld。\n如果你和我一样，你会难以置信地盯着屏幕。如果你想亲眼看看，就运行能运行的程序和不能运行的程序。\n也许最糟糕的是它会编译，而不是它没有我们自然期望的行为。你能明白为什么会发生这种事吗？\n说真的，试着自己找出哪里出了问题。我稍后会告诉你，但你自己去找会更有趣、更有价值。\n你在用手机，不方便吗？请不要担心，请将此页面加入书签或通过电子邮件发送给您自己，这样您可以稍后在计算机上返回该页面。\n这个问题与左值和右值有关。如果我们再看一下自由函数运算符，它会将左值引用作为输入：\n数据+=1是右值。左值引用不能绑定到它。因此，不会调用逗号运算符的此重载。\n如果它是任何其他运算符，代码就不会编译。但是，正如我们在本文开头看到的，逗号操作符对所有类型都有一个默认实现。因此，执行默认实现-返回第二个元素，这里是2。然后返回3，然后是4，然后是5。而且它实际上没有做任何事情。\n不正确地重载逗号运算符会导致静默失败。代码可以编译、运行，但不会执行您想要的操作。\n要使此实现正常工作，我们需要提供可以接受r值的逗号操作符的重载：\nTemplate&lt；TypeName Vector，TypeName T&gt；Appder&lt；Vector&gt；&amp；Operator，(Appder&lt；Vector&gt；&amp；v，const T&amp；e){v.Vector_back(E)；return v；}Template&lt；TypeName Vector，TypeName T&gt；Appder&lt；Vector&gt；&amp；Operator，(Appder&lt；Vector&gt(E)；return v；}Template&lt；TypeName Vector，TypeName T&gt；Appder&lt；Vector&gt；&amp；Operator，(Appder&lt；Vector&gt。返回v；}\n要在我们的示例中使用它，我们需要返回附加器的副本，以便常量引用可以绑定到它。在我们的示例中，这仍然会附加到向量中，因为附加器的各种副本将包含对同一向量的引用(感谢Patrice Dalesme向我展示了这个解决方案)：\n第一个是，如果我们重载逗号操作符，我们需要格外小心地涵盖所有情况，并考虑左值和右值。否则，我们最终会得到错误代码。\n第二个独立于逗号运算符。我们看到，在C++中，成员函数比自由函数更容易定义。默认情况下，成员函数是为类型的左值和右值引用定义的，而接受引用的自由函数可能只适用于一种情况。\n也存在相反的情况(为左值或右值显式定义的成员函数，以及通过复制或常量引用获取的自由函数)，但最常见的原型具有我们前面讨论过的属性。\nJonathan Boccara是C++软件工程负责人、博客作者和作家，专注于如何使代码具有表现力。他的博客是流畅的C++。\n布尔玛是一位多才多艺的自由插画家，风格古怪，五颜六色。布尔玛热爱动画，主要为运动图形做插图，利用她的创造力帮助品牌讲述故事。布尔马来自立陶宛，曾在英国学习和工作，现在马耳他享受着岛屿生活。在那里，她学会了游泳，并更深入地从事插图工作。布尔玛一直在寻找新的挑战和机遇。", "note_en": "By Jonathan Boccara         But like a philosopher who was also the uncle of a superhero once said, with great power comes great responsibility.\n Translated in C++, this means that if you&#39;re not careful, some C++ features that let you write expressive code can turn around and create buggy code that doesn&#39;t do what it&#39;s supposed to.\n One beautiful example (of some definition of beautiful) is overloading of the comma operator. As we&#39;re going to see, a very subtle change in working code can make it go horribly wrong.\n   First, the comma operator is a thing. Its default implementation for all types does this: a,b evaluates a, then evaluates b, then returns b. For example, 1,2 returns 2.\n It&#39;s generally not recommended, but C++ allows for overloading the comma operator. Here is a  detailed article on overloading the comma operator, which you can read to get more familiar with the topic.\n Overloading the comma operator allows us to do nice things. For example, this is what  Boost Assign uses to allow us to append data to an existing vector:\n  Without overloading the comma operator, we can&#39;t write this expression with standard C++, even in C++20. Once the vector is constructed, we can only add elements one by one by using the push_back member function.\n The preceding code allows us to add elements to an existing vector with very expressive code.\n Here is a very simplified implementation of Boost Assign, which allows us to write the preceding line of code (thanks to Nope for this implementation):\n template &lt; typename Vector&gt;  struct  { Vector&amp; vec;  template&lt; typename T&gt; appender&lt;Vector&gt;&amp;  operator,( const T&amp; e) { vec.push_back(e);  return * this; }}; template &lt; typename T&gt;appender&lt; std:: vector&lt;T&gt;&gt;  operator+=( std:: vector&lt;T&gt;&amp; v,  const T&amp; e){ v.push_back(e);  return {v};}  int   (){  auto data =  std:: vector&lt; int&gt;{}; data +=  1, 2, 3, 4, 5;  for ( auto&amp;&amp; e: data)  std:: cout &lt;&lt;  &#39; &#39; &lt;&lt; e;  std:: cout &lt;&lt;  &#39;\\n&#39;;}\n  The appender overloads the comma operator. When this appender is associated with 2, it adds it to the vector and returns itself.\n The appender is then associated with 3 and also adds it, and then 4, and then 5.\n      Now let&#39;s make a small change in our code. Instead of defining the comma operator as a member function, let&#39;s define it as a free function. For example, this could be desirable as it allows implicit conversions, as explained in item 24 of  Effective C++.\n template &lt; typename Vector&gt;  struct  { Vector&amp; vec;}; template &lt; typename Vector,  typename T&gt;appender&lt;Vector&gt;&amp;  operator,(appender&lt;Vector&gt;&amp; v,  const T&amp; e){ v.vec.push_back(e);  return v;} template &lt; typename T&gt;appender&lt; std:: vector&lt;T&gt;&gt;  operator+=( std:: vector&lt;T&gt;&amp; v,  const T&amp; e){ v.push_back(e);  return {v};}  int   (){  auto data =  std:: vector&lt; int&gt;{}; data +=  1, 2, 3, 4, 5;  for ( auto&amp;&amp; e: data)  std:: cout &lt;&lt;  &#39; &#39; &lt;&lt; e;  std:: cout &lt;&lt;  &#39;\\n&#39;;}\n    If you&#39;re like me, you&#39;re staring at the screen in disbelief. Run the program that works and the one that doesn&#39;t work if you&#39;d like to see it with your own eyes.\n Maybe the worst thing is that it compiles, not that it doesn&#39;t have the behavior we would naturally expect. Can you see why this is happening?\n   Seriously, try to find what&#39;s wrong on your own. I&#39;ll tell you in a bit, but it&#39;s more fun and rewarding to find it yourself.\n  You&#39;re on mobile and it&#39;s not convenient? No worries, bookmark this page or send it to yourself by email so you can come back to it later on your computer.\n      The problem has to do with lvalues and rvalues. If we look again at the free function operator, it takes an lvalue reference as an input:\n    data += 1 is an rvalue. An lvalue reference cannot bind to it. Therefore, this overload of the comma operator is not called.\n If it were any other operator, the code would not have compiled. But like we saw at the beginning of this post, the comma operator has a default implementation for all types. Therefore, the default implementation is executed—the one that returns the second element, here 2. Then it returns 3. Then 4 and then 5. And it doesn&#39;t really do anything.\n Incorrectly overloading the comma operator results in a  silent failure. The code compiles, runs, but doesn&#39;t do what you want.\n To make this implementation work, we need to provide an overload of the comma operator that can accept rvalues:\n template &lt; typename Vector,  typename T&gt;appender&lt;Vector&gt;&amp;  operator,(appender&lt;Vector&gt;&amp; v,  const T&amp; e){\tv.vec.push_back(e);\t return v;} template &lt; typename Vector,  typename T&gt;appender&lt;Vector&gt;&amp;  operator,(appender&lt;Vector&gt;&amp;&amp; v,  const T&amp; e){\tv.vec.push_back(e);\t return v;}\n  To use this in our case, we need to return a copy of the appender so that a const reference can bind to it. In our case, this would still append to the vector because the various copies of the appender would contain a reference to the same vector (thanks to Patrice Dalesme for showing me this solution):\n    The first one is that if we overload the comma operator, we need to be extra careful to cover all cases and think about lvalues and rvalues. Otherwise we end up with buggy code.\n The second one is independent from the comma operator. We see that in C++, member functions are easier to define than free functions. Member functions are, by default, defined for both lvalues and rvalue references of a type, whereas free functions taking references may work for only one case.\n The opposite also exists (member functions explicitly defined for lvalues or rvalues, and free functions taking by copy or const reference), but the most common prototypes have the properties we discussed earlier.\n    Jonathan Boccara is a C++ software engineering lead, blogger and writer focusing on how to make code expressive. His blog is  Fluent C++.\n Bulma is multi-talented, freelance illustrator with a quirky, colourful style. Bulma loves animation and predominantly illustrates for motion graphics, using her creativity to help tell stories for brands. Originally from Lithuania, and having studied and worked in the UK, Bulma now enjoys island life on Malta. There, she learned to swim and dove even deeper into illustrating. Bulma is always looking for new challenges and opportunities.", "posttime": "2020-05-30 15:03:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,运算符,dangers", "title": "逗号运算符(C++)的微妙危险", "title_en": "The Subtle Dangers of the Comma Operator (C++)", "transed": 1, "url": "https://humanreadablemag.com/issues/3/articles/the-subtle-dangers-of-the-comma-operator", "via": "", "real_tags": ["c++", "运算符", "dangers"]}, {"category": "", "categoryclass": "", "imagename": "dffd92477f4b34023447847c6ddbbb0b.jpg", "infoid": 1004369, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“物理学家喜欢探索极端，”卡内基梅隆大学的物理学家加勒特·古恩(Garrett Goon)说。“事实是，你不能走得更远，有些东西正在改变，有些东西挡住了你--那里正在发生一些有趣的事情。”\n几十年来，黑洞在物理学家用来探索自然极端的思维实验中一直扮演着重要角色。这些看不见的球体形成时，物质变得如此集中，以至于一定距离内的一切东西，即使是光，也会被它的引力捕获。阿尔伯特·爱因斯坦将重力等同于时空连续体中的曲线，但曲率在黑洞中心附近变得如此极端，以至于爱因斯坦的方程式破裂。因此，几代物理学家都在黑洞中寻找关于引力真正的量子起源的线索，这必须在他们的心中完全揭示出来，并与爱因斯坦在其他任何地方的近似图景相匹配。\n探测黑洞以获得量子引力知识的起源于斯蒂芬·霍金(Stephen Hawking)。1974年，这位英国物理学家计算出，黑洞表面的量子抖动导致它们蒸发，随着它们辐射热量而缓慢收缩。从那时起，黑洞蒸发就为量子引力研究提供了信息。\n最近，物理学家们研究了极端中的极端--被称为极端黑洞的实体--并发现了一个富有成效的新问题。\n当带电的物质落入黑洞中时，黑洞就会带电。物理学家计算出黑洞有一个“极端极限”，即一个饱和点，在这个饱和点上，黑洞可以储存与其大小相符的尽可能多的电荷。当一个带电黑洞以霍金描述的方式蒸发和收缩时，它最终会达到这个极端极限。然后，考虑到它的充电程度，它就是它能得到的最小的。它不能再蒸发了。\n但加州大学伯克利分校的物理学家格兰特·雷曼(Grant Remmen)表示，认为极端黑洞“停止辐射，只是坐在那里”的想法是不可信的。在这种情况下，遥远未来的宇宙将散落着微小的、坚不可摧的黑洞残留物-任何携带哪怕是一丝电荷的黑洞的残余物，因为它们在蒸发足够多后都会变得极端。没有保护这些黑洞的基本原理，所以物理学家认为它们不应该永远存在。\n所以“有一个问题，”利哈伊大学的塞拉·克雷莫尼尼(Sera Cremonini)说：“所有这些极端的黑洞会发生什么？”\n物理学家强烈怀疑极端黑洞一定会衰变，从而解决了悖论，但途径不是霍金蒸发。近年来，对这种可能性的研究使研究人员获得了关于量子引力的主要线索。\n四位物理学家在2006年意识到，如果极端黑洞可以衰变，这意味着引力肯定是任何可能的宇宙中最弱的力，这是关于量子引力与其他量子力关系的有力声明。这一结论让人们对极端黑洞的命运进行了更严格的审视。\n然后，两年前，雷曼及其合作者加州理工学院(California Institute Of Technology)的Clifford Cheung和Junyu Liu发现，极端黑洞是否能够衰变直接取决于黑洞的另一个关键属性：它们的熵-衡量一个物体的组成部分可以以多少种不同的方式重新排列。熵是黑洞研究最多的特征之一，但人们认为它与黑洞的极端极限没有任何关系。“这就像是，哇，好吧，两个非常酷的东西是联系在一起的，”张说。\n在最新的惊喜中，这种联系证明了一个关于自然的普遍事实。在3月份发表在“物理评论快报”(Physical Review Letters)上的一篇论文中，古恩和里卡多·彭科(Riccardo Penco)通过证明一个简单、普遍的公式，将能量和熵联系起来，从而拓宽了早期工作的教训。新发现的公式不仅适用于黑洞，也适用于气体等系统。\n通过最近的计算，“你真的在学习量子引力，”古恩说。“但也许更有趣的是，你正在学到更多关于日常生活的东西。”\n物理学家很容易看到带电黑洞达到了极端极限。当他们将爱因斯坦的重力方程和电磁学方程结合起来时，他们计算出，当两者转换成相同的基本单位时，黑洞的电荷Q永远不会超过它的质量M。黑洞的质量和电荷共同决定了它的大小--视界半径。同时，黑洞的电荷还创造了隐藏在事件视界后面的第二个“内”视界。随着Q的增加，黑洞的内视界扩大，而事件视界收缩，直到Q=M时，这两个视界重合。\n如果Q进一步增加，事件视界的半径将变成复数(涉及负数的平方根)，而不是实数。这是非物质的。因此，根据詹姆斯·克莱克·麦克斯韦尔(James Clerk Maxwell)19世纪的电磁学和爱因斯坦引力理论的简单混合，Q=M肯定是极限。\n当黑洞到达这一点时，进一步衰变的一个简单选择是分裂成两个较小的黑洞。然而，为了发生这种分裂，能量守恒定律和电荷守恒定律要求其中一个子物体最终的电荷必须多于质量。根据爱因斯坦-麦克斯韦的说法，这是不可能的。\n但正如尼玛·阿卡尼-哈米德、卢伯斯·莫特尔、阿尔贝托·尼科利斯和卡姆伦·瓦法在2006年指出的那样，极端黑洞最终可能会一分为二。他们指出，爱因斯坦和麦克斯韦的组合方程对小而强弯曲的黑洞并不适用。在较小的尺度上，与重力的量子力学属性相关的额外细节变得更加重要。这些细节修正了爱因斯坦-麦克斯韦方程，改变了对极端极限的预测。这四位物理学家表明，黑洞越小，修正就变得越重要，导致极端极限从Q=M移动得越来越远。\n研究人员还指出，如果修正有正确的符号-正的而不是负的-那么小黑洞可以携带更多的电荷而不是质量。对他们来说，Q&gt；M正是大型极端黑洞衰变所需要的。\n如果是这样的话，那么不仅黑洞可以衰变，而且阿卡尼-哈米德、莫特尔、尼科利斯和瓦法也证明了关于自然界的另一个事实也随之而来：引力肯定是最弱的力。物体的电荷Q是它对重力以外的任何力的敏感度。它的质量M是它对重力的敏感度。因此，Q&gt；M意味着重力是两者中较弱的一个。\n根据他们认为黑洞应该能够衰变的假设，这四位物理学家做出了一个更全面的猜想，即引力肯定是任何有生命的宇宙中最弱的力。换句话说，对于任何一种电荷Q，具有Q&GT；M的物体总是存在的，无论这些物体是电子(实际上，它的电荷远远大于质量)这样的粒子，还是小黑洞。\n这一“弱引力猜想”已经变得非常有影响力，支持了其他一些关于量子引力的观点。但是Arkani-Hamed，Motl，Nicolis和Vafa并没有证明Q&gt；M，或者极端黑洞可以衰变。对极端极限的量子重力修正可能是负的，在这种情况下，小黑洞每单位质量携带的电荷甚至比大黑洞更少。极端黑洞不会衰变，弱引力猜想也不成立。\n这一切都意味着研究人员需要弄清楚量子重力校正的真正符号是什么。\n在另一个看似无关的黑洞研究领域中，量子重力修正的问题以前也曾出现过。\n大约50年前，已故物理学家雅各布·贝肯斯坦(Jacob Bekenstein)和斯蒂芬·霍金(Stephen Hawking)独立发现，黑洞的熵与其表面积成正比。熵通常被认为是一种无序的衡量标准，它计算在不改变物体整体状态的情况下，物体内部部分可以重新排列的方式的数量。(例如，如果房间很乱，或者熵很高，你可以随意移动物体，它会保持混乱；相比之下，如果房间很整洁，或者熵很低，移动东西会让它变得不那么整洁。)。通过在黑洞的熵(与黑洞的内部微观成分有关)和它的几何表面积之间架起一座桥梁，贝肯斯坦和霍金的熵区定律已经成为物理学家研究黑洞和量子引力的最有力的立足点之一。\n贝肯斯坦和霍金将爱因斯坦的重力方程(连同热力学定律)应用到黑洞表面，从而推导出他们的定律。他们认为这个表面很光滑，忽略了短距离内存在的任何结构。\n1993年，芝加哥大学的物理学家罗伯特·沃尔德(Robert Wald)表明，有可能做得更好。沃尔德在不知道更深层次的现实的完整描述的情况下，找到了推断来自更微观的现实层面的微小影响的聪明技巧。他的策略由凝聚态物理学家肯尼思·威尔逊(Kenneth Wilson)在不同的背景下首创，他的策略是写下每一个可能的物理效应。在爱因斯坦的方程式中，沃尔德展示了如何添加一系列额外的项-任何具有正确尺寸和单位的项，由所有物理相关变量构成-可能描述黑洞表面未知的短距离属性。克雷莫尼尼说：“你可以写下原则上描述(黑洞)一定大小的曲率的最一般的一组术语。”\n幸运的是，该系列在前几项之后可以截断，因为由许多变量组成的日益复杂的组合对最终答案的贡献很小。甚至该系列中的许多主要术语都可以被划掉，因为它们具有错误的对称性或违反了一致性条件。这就只剩下修改爱因斯坦引力方程的几个有意义的项了。求解这些新的、更复杂的方程会产生更精确的黑洞性质。\n沃尔德在1993年经历了这些步骤，计算了短距离量子引力效应如何修正贝肯斯坦-霍金熵区定律。这些修正改变了黑洞的熵，使其与面积不完全成正比。虽然不可能直接计算熵移-涉及未知值的变量-但很明显的是，修正变得越明显，黑洞越小，熵移也就越大。\n三年前，张、刘和雷曼将沃尔德相同的基本方法应用到带电黑洞和极值极限的研究中。他们修改了爱因斯坦-麦克斯韦方程，加入了一系列来自短距离效应的额外项，并求解了新的方程，以计算新的、修正后的极值极限。令他们惊讶的是，他们认识到了答案：带电黑洞极端极限的修正与根据沃尔德公式计算的熵的修正完全一致；量子引力出人意料地以同样的方式移动了这两个量。\n雷曼记得他们完成计算的日期-2017年11月30日-“因为那太令人兴奋了，”他说。“我们证明了这是一件非常深刻和令人兴奋的事情，这些(额外的)项带来了熵和极值的转变，这些熵和极值是相等的。”\n但是，与之相匹配的班次是否朝着正确的方向前进呢？这两个修正都取决于不确定的变量，因此原则上它们可能是正的，也可能是负的。在他们2018年的论文中，Cheung和他的公司计算出，在量子引力的一大类场景和模型中，熵移是正的。他们认为，熵变应该是正的，这也是有直觉的。回想一下，熵测量黑洞所有不同可能的内部状态。考虑到黑洞表面的更多微观细节将揭示新的可能状态，从而导致更多的熵，而不是更少，这似乎是合理的。“更真实的理论会有更多的微态，”雷曼说。\n如果是这样，那么极端极限的移动也是正的，从而允许较小的黑洞每质量储存更多的电荷。在这种情况下，“黑洞总是可以衰变成更轻的黑洞，”张说，“弱引力猜想是正确的。”\n但其他研究人员强调，这些发现并不构成弱引力猜想的直接证据。威斯康星大学麦迪逊分校(University of Wisconsin，Madison)的理论物理学家加里·肖(Gary Shiu)表示，当你考虑到量子引力时，熵应该总是增加的信念是“一些人可能有的直觉，但并不总是正确的。”\n邵逸夫发现了反例：不切实际的量子引力模型，在该模型中，通过抵消，短程效应降低了黑洞的熵。这些模型违反了因果关系或其他原理，但根据Shiu的说法，重点是新发现的与熵的联系本身并不能证明极端黑洞总是可以衰变的，或者引力总是最弱的力。\n“能够证明(弱引力猜想)将是非常棒的，”邵逸夫说。“这在很大程度上是我们仍在考虑这个问题的原因。”\n引力是我们宇宙中四种基本力中最弱的一种。弱引力猜想说，不可能不是这样的。除了我们的宇宙，这个猜想似乎也适用于从弦理论衍生的所有可能的理论宇宙。作为量子引力理论的候选者，弦理论假设粒子不是点，而是延伸的物体(绰号弦)，而且时空特写也有额外的维度。当弦理论家写下可能定义宇宙的不同弦集合时，他们总是发现引力--由一种弦产生--是这些模型宇宙中最弱的力。新泽西州普林斯顿高等研究院和剑桥大学的物理学家豪尔赫·桑托斯(Jorge Santos)说，“在一个又一个案例中，看到这件事是如何收场的，这是非常令人震惊的，”豪尔赫·桑托斯是新泽西州普林斯顿高等研究院和剑桥大学的物理学家。\n弱引力猜想是物理学家在过去20年里提出的“沼泽猜想”网络中最重要的猜想之一-基于思维实验和例子，关于什么类型的宇宙是可能的，什么类型的宇宙不可能的投机性声明。通过排除可能性(把不可能的宇宙放在禁止进入的“沼泽地”中)，沼泽地理论家们的目标是澄清为什么我们的宇宙是这样的。\n根据桑托斯的说法，如果研究人员能够证明引力不可避免地是最弱的(黑洞总是可以衰变的)，那么最重要的含义是，这意味着量子引力“必须是一种统一性理论”。也就是说，如果Q和M必须有一个固定的比率，那么它们的关联力必须是同一统一数学框架的一部分。桑托斯指出，将基本力统一在单一框架中的“唯一理论”是弦理论。与之竞争的方法，如环路量子重力，试图通过将时空分割成碎片来量化重力，而不是将重力与其他力联系起来。桑托斯说：“如果弱引力猜想是正确的，那么像环圈量子引力这样的东西就死了。”\n路易斯安那州立大学(Louisiana State University)的环路量子引力理论家豪尔赫·普林(Jorge Pullin)认为，“死亡”这个词太过强烈了。这种方法本身可能是一个更大的统一理论的一部分，他说：“环路量子引力不排除统一结构，但我们还没有追求它。”\n弱引力猜想还相互加强了其他几个沼泽猜想，包括关于对称性和距离在量子引力中的作用的陈述。邵逸夫认为，这些猜想之间的逻辑联系“给了我们一些信心，即使这些说法是在猜测的意义上做出的，但它们背后可能存在普遍的真理。”\n邵逸夫将我们目前对量子引力的猜想理解与量子力学的早期相提并论。他说：“关于亚原子世界的正确理论是什么，有很多猜测，有很多信念的飞跃。”“最终，这些猜测中的许多最终被证明是这个大得多的图景的一部分。”\n在他们3月份的论文中，Goon和Penco重新计算了黑洞熵和极值修正。他们没有使用重力和黑洞表面几何的语言，而是纯粹根据能量和温度等普遍热力学参数来计算修正。这使得他们能够发现能量和熵之间的热力学关系，这种关系在自然界中普遍适用。\n在黑洞的例子中，二人组的公式说明了张、雷曼和刘已经证明的：量子引力改变了黑洞的极端极限(允许它们每质量储存更多的电荷)，并按比例改变了它们的熵。另一种描述来自量子引力的额外存储容量的方式是，固定电荷的黑洞可以有更少的质量。质量是能量的一种形式，因此这种质量的下降可以更普遍地认为是能量的转移--与熵的转移成反比。\n对于黑洞来说，能量和熵的相等和相反的移动来自未知的量子引力细节，而对于任何接近其极端极限的物理系统来说，都存在同样的情况。\n例如，气体在冷却到绝对零度时就会变得极端。Goon和Penco的热力学公式说，气体微观物理的任何变化，例如组成气体的原子类型，都会导致气体的能量和熵发生相等和相反的变化。古恩推测，能量和熵之间的关系在研究超低温气体和其他低温实验中可能很有用，“因为有时一种比另一种更容易计算。”\n无论这种熵-能量关系在地球物理领域是否有用，研究人员仍有很多工作要做，以探索在黑洞背景下新发现的联系，以及它对引力性质的意义。\n“能够回答‘为什么引力很弱？’”张说。“这个问题甚至在黑板上，这是一个人们可以在哲学领域之外合法回答的问题，以及它通过这条通往熵的漫长道路联系在一起的事实，这就像是关于黑洞的经验证的、最令人着迷的事情，…。看起来很疯狂。“", "note_en": "“Physicists like to probe the extreme,” said  Garrett Goon, a physicist at Carnegie Mellon University. “The fact that you can’t go further, that something is changing, something is blocking you — something interesting is happening there.”\n For decades, black holes have played the headlining role in the thought experiments that physicists use to probe nature’s extremes. These invisible spheres form when matter becomes so concentrated that everything within a certain distance, even light, gets trapped by its gravity. Albert Einstein equated the force of gravity with curves in the space-time continuum, but the curvature grows so extreme near a black hole’s center that Einstein’s equations break. Thus generations of physicists have looked to black holes for clues about the true, quantum origin of gravity, which must fully reveal itself in their hearts and match Einstein’s approximate picture everywhere else.\n Plumbing black holes for knowledge of quantum gravity originated with Stephen Hawking. In 1974, the British physicist calculated that quantum jitter at the surfaces of black holes cause them to evaporate, slowly shrinking as they radiate heat. Black hole evaporation has informed quantum gravity research ever since.\n More recently, physicists have considered the extreme of the extreme — entities called extremal black holes — and found a fruitful new problem.\n Black holes become electrically charged when charged stuff falls into them. Physicists calculate that black holes have an “extremal limit,” a saturation point where they store as much electric charge as possible for their size. When a charged black hole evaporates and shrinks in the manner described by Hawking, it will eventually reach this extremal limit. It’s then as small as it can get, given how charged it is. It can’t evaporate further.\n But the idea that an extremal black hole “stops radiating and just sits there” is implausible, said  Grant Remmen, a physicist at the University of California, Berkeley. In that case, the universe of the far future will be littered with tiny, indestructible black hole remnants — the remains of any black holes that carry even a touch of charge, since they’ll all become extremal after evaporating enough. There’s no fundamental principle protecting these black holes, so physicists don’t think they should last forever.\n  So “there is a question,” said  Sera Cremonini of Lehigh University: “What happens to all these extremal black holes?”\n Physicists strongly suspect that extremal black holes must decay, resolving the paradox, but by some other route than Hawking evaporation. Investigating the possibilities has led researchers in recent years to major clues about quantum gravity.\n Four physicists  realized in 2006 that if extremal black holes can decay, this implies that gravity must be the weakest force in any possible universe, a powerful statement about quantum gravity’s relationship to the other quantum forces. This conclusion brought greater scrutiny to extremal black holes’ fates.\n Then, two years ago, Remmen and collaborators  Clifford Cheung and  Junyu Liu of the California Institute of Technology  discovered that whether extremal black holes can decay depends directly on another key property of black holes: their entropy — a measure of how many different ways an object’s constituent parts can be rearranged. Entropy is one of the most studied features of black holes, but it wasn’t thought to have anything to do with their extremal limit. “It’s like, wow, OK, two very cool things are connected,” Cheung said.\n In the latest surprise, that link turns out to exemplify a general fact about nature. In  a paper published in March in  Physical Review Letters, Goon and  Riccardo Penco broadened the lessons of the earlier work by proving a simple, universal formula relating energy and entropy. The newfound formula applies to a system such as a gas as well as a black hole.\n  With the recent calculations, “you really are learning about quantum gravity,” Goon said. “But maybe even more interesting, you’re learning something about more everyday stuff.”\n  Physicists see very easily that charged black holes reach an extremal limit. When they combine Einstein’s gravity equations and the equations of electromagnetism, they calculate that a black hole’s charge,  Q, can never surpass its mass,  M, when both are converted into the same fundamental units. Together, the black hole’s mass and charge determine its size — the radius of the event horizon. Meanwhile, the black hole’s charge also creates a second, “inner” horizon, hidden behind the event horizon. As  Q increases, the black hole’s inner horizon expands while the event horizon contracts until, at  Q =  M, the two horizons coincide.\n If  Q increased further, the radius of the event horizon would become a complex number (involving the square root of a negative number), rather than a real one. This is unphysical. So, according to a simple mashup of James Clerk Maxwell’s 19th-century theory of electromagnetism and Einsteinian gravity,  Q =  M must be the limit.\n When a black hole hits this point, a simple option for further decay would be to split into two smaller black holes. Yet in order for such splitting to happen, the laws of conservation of energy and conservation of charge require that one of the daughter objects must end up with more charge than mass. This, according to Einstein-Maxwell, is impossible.\n  But there might be a way for extremal black holes to split in two after all, as Nima Arkani-Hamed, Lubos Motl, Alberto Nicolis and Cumrun Vafa pointed out in 2006. They noted that the combined equations of Einstein and Maxwell don’t work well for small, strongly curved black holes. At smaller scales, additional details related to the quantum mechanical properties of gravity become more important. These details contribute corrections to the Einstein-Maxwell equations, changing the prediction of the extremal limit. The four physicists showed that the smaller the black hole, the more important the corrections become, causing the extremal limit to move farther and farther away from  Q =  M.\n  The researchers also pointed out that if the corrections have the right sign — positive rather than negative — then small black holes can pack more charge than mass. For them,  Q &gt;  M, which is exactly what’s needed for big extremal black holes to decay.\n If this is the case, then not only can black holes decay, but Arkani-Hamed, Motl, Nicolis and Vafa showed that another fact about nature also follows: Gravity must be the weakest force. An object’s charge,  Q, is its sensitivity to any force other than gravity. Its mass,  M, is its sensitivity to gravity. So  Q &gt;  M means gravity is the weaker of the two.\n From their assumption that black holes ought to be able to decay, the four physicists made a more sweeping conjecture that gravity must be the weakest force in any viable universe. In other words, objects with  Q &gt;  M will always exist, for any kind of charge  Q, whether the objects are particles like electrons (which, indeed, have far more electric charge than mass) or small black holes.\n This “weak gravity conjecture” has become hugely influential, lending support to a number of other ideas about quantum gravity. But Arkani-Hamed, Motl, Nicolis and Vafa didn’t prove that  Q &gt;  M, or that extremal black holes can decay. The quantum gravity corrections to the extremal limit might be negative, in which case small black holes can carry even less charge per unit mass than large ones. Extremal black holes wouldn’t decay, and the weak gravity conjecture wouldn’t hold.\n This all meant that researchers needed to figure out what the sign of the quantum gravity corrections actually is.\n  The issue of quantum gravity corrections has come up before, in another, seemingly unrelated line of black hole study.\n Almost 50 years ago, the late physicists Jacob Bekenstein and Stephen Hawking  independently  discovered that a black hole’s entropy is directly proportional to its surface area. Entropy, commonly thought of as a measure of disorder, counts the number of ways an object’s internal parts can be rearranged without any change to its overall state. (If a room is messy, or high entropy, for instance, you can move objects around at random and it will stay messy; by contrast, if a room is tidy, or low entropy, moving things around will make it less tidy.) By building a bridge between a black hole’s entropy, which concerns its inner microscopic ingredients, and its geometric surface area, Bekenstein and Hawking’s entropy area law has become one of physicists’ strongest footholds for studying black holes and quantum gravity.\n Bekenstein and Hawking deduced their law by applying Einstein’s gravity equations (together with the laws of thermodynamics) to the black hole’s surface. They treated this surface as smooth and ignored any structure that exists over short distances.\n In 1993, the physicist Robert Wald of the University of Chicago  showed that it’s possible to do better. Wald found clever tricks for inferring the small effects that emanate from more microscopic levels of reality, without knowing what the complete description of that deeper level of reality is. His tactic, pioneered in a different context by the condensed matter physicist Kenneth Wilson, was to write down every possible physical effect. To Einstein’s equations, Wald showed how to add a series of extra terms — any terms that have the right dimensions and units, constructed of all physically relevant variables — that might describe the unknown short-distance properties of a black hole’s surface. “You can write down the most general set of terms that you could have in principle that describe [black hole] curvatures of a certain size,” said Cremonini.\n  Fortunately, the series can be truncated after the first several terms, since increasingly complicated composites of many variables contribute little to the final answer. Even many of the leading terms in the series can be crossed out because they have the wrong symmetries or violate consistency conditions. This leaves just a few terms of any significance that modify Einstein’s gravity equations. Solving these new, more complicated equations yields more exact black hole properties.\n Wald went through these steps in 1993, calculating how short-distance quantum gravitational effects correct the Bekenstein-Hawking entropy area law. These corrections shift a black hole’s entropy so that it’s not exactly proportional to area. And while it’s not possible to calculate the entropy shift outright — variables with unknown values are involved — what’s clear is that the corrections grow more significant the smaller the black hole, and therefore so does the entropy shift.\n Three years ago, Cheung, Liu and Remmen applied Wald’s same basic approach to the study of charged black holes and the extremal limit. They modified the Einstein-Maxwell equations with a series of extra terms coming from short-distance effects, and they solved the new equations to calculate the new, corrected extremal limit. To their surprise, they recognized the answer: The corrections to the extremal limit of a charged black hole exactly match the corrections to its entropy, as calculated from Wald’s formula; quantum gravity unexpectedly shifts both quantities in the same way.\n Remmen remembers the date when they completed the calculation — November 30, 2017 — “because it was that exciting,” he said. “That’s a very deep and exciting thing that we proved, that these [extra] terms give a shift in entropy and extremality that are equal to each other.”\n  But do the matching shifts go in the right direction? Both corrections depend on undetermined variables, so they could in principle be either positive or negative. In their 2018 paper, Cheung and company calculated that the entropy shift is positive in a large class of scenarios and models of quantum gravity. They argue that it also makes intuitive sense that the entropy shift should be positive. Recall that entropy measures all the different possible internal states of a black hole. It seems reasonable that accounting for more microscopic details of a black hole’s surface would reveal new possible states and thus lead to more entropy rather than less. “The truer theory will have more microstates,” Remmen said.\n If so, then the shift in the extremal limit is also positive, allowing smaller black holes to store more charge per mass. In that case, “black holes can always decay to lighter ones,” Cheung said, and “the weak gravity conjecture is true.”\n But other researchers stress that these findings do not constitute an outright proof of the weak gravity conjecture.  Gary Shiu, a theoretical physicist at the University of Wisconsin, Madison, said the belief that entropy should always increase when you take quantum gravity into account is “an intuition that some might have, but it’s not always true.”\n Shiu has identified counterexamples: unrealistic models of quantum gravity in which, through cancellations, short-distance effects decrease black holes’ entropy. These models violate causality or other principles, but the point, according to Shiu, is that the newfound connection to entropy doesn’t prove all by itself that extremal black holes can always decay, or that gravity is always the weakest force.\n “To be able to prove [the weak gravity conjecture] would be fantastic,” Shiu said. “That’s a lot of why we’re still thinking about this problem.”\n   Gravity is the weakest of the four fundamental forces in our universe. The weak gravity conjecture says it couldn’t have been otherwise. Aside from our universe, the conjecture also appears to hold in all possible theoretical universes derived from string theory. A candidate for the quantum theory of gravity, string theory posits that particles aren’t points but rather extended objects (nicknamed strings), and that space-time, close-up, also has extra dimensions. When string theorists write down different sets of strings that might define a universe, they invariably find that gravity — which arises from a type of string — is the weakest force in these model universes. “Seeing how this ends up panning out in case after case after case after case is very striking,” said  Jorge Santos, a physicist at the Institute for Advanced Study in Princeton, New Jersey, and the University of Cambridge.\n The weak gravity conjecture is one of the most important in a network of “ swampland conjectures” posed by physicists in the last two decades — speculative statements, based on thought experiments and examples, about what kinds of universes are and are not possible. By ruling out possibilities (putting impossible universes in a no-go “swampland”), swampland theorists aim to clarify why our universe is the way it is.\n If researchers could prove that gravity is inevitably weakest (and that black holes can always decay), the most important implication, according to Santos, is that it means quantum gravity “has to be a theory of unification.” That is, if  Q and  M must have a fixed ratio, their associated forces must be part of the same unified mathematical framework. Santos noted that “the only theory out there” that unifies the fundamental forces in a single framework is string theory. Rival approaches such as loop quantum gravity attempt to quantize gravity by dividing space-time into pieces, without connecting gravity with the other forces. “If the weak gravity conjecture is correct, things like loop quantum gravity are dead,” said Santos.\n Jorge Pullin, a loop quantum gravity theorist at Louisiana State University, sees “dead” as far too strong a word. The approach could itself be part of a larger unified theory, he said: “Loop quantum gravity doesn’t rule out a unification structure, but we haven’t pursued it yet.”\n  The weak gravity conjecture also mutually reinforces several other swampland conjectures, including statements about the roles of symmetry and distance in quantum gravity. According to Shiu, the logical connection between these conjectures “gives us some confidence that even though these statements are made on a conjectural sense, there may be universal truth behind them.”\n Shiu compared our current, conjectural understanding of quantum gravity to the early days of quantum mechanics. “There were a lot of conjectures, a lot of leaps of faith about what is the right theory of the subatomic world,” he said. “Eventually many of these guesses turned out to be part of this much bigger picture.”\n   In their March paper, Goon and Penco redid the calculation of the black hole entropy and extremality corrections. Rather than using the language of gravity and black hole surface geometry, they calculated the corrections purely in terms of universal thermodynamic quantities like energy and temperature. This allowed them to discover a thermodynamic relation between energy and entropy that applies generally in nature.\n  In the case of black holes, the duo’s formula says what Cheung, Remmen and Liu already proved: that quantum gravity shifts the extremal limit of black holes (allowing them to store more charge per mass), and it shifts their entropy by a proportional amount. Another way of describing the extra storage capacity coming from quantum gravity is that a black hole of fixed charge can have less mass. Mass is a form of energy, and so this drop in mass can be thought of more generally as a shift in energy — one that is inversely proportional to a shift in entropy.\n Whereas for a black hole, the equal and opposite shifts in energy and entropy come from unknown details of quantum gravity, an equivalent situation exists for any physical system near its extremal limit.\n  A gas, for instance, becomes extremal when cooled to absolute zero. Goon and Penco’s thermodynamic formula says that any changes to the microscopic physics of the gas, such as the type of atoms that comprise it, produce equal and opposite shifts in its energy and entropy. Goon speculated that the relation between energy and entropy might be useful in studies of ultracold gases and other cryogenic experiments, “because sometimes one is easier to calculate than the other.”\n Whether this entropy-energy relation ever proves useful in earthly domains of physics, researchers still have plenty more work to do to explore the newfound link in the context of black holes and what it means for the nature of gravity.\n “Being able to answer, ‘Why is gravity weak?’” Cheung said. “The fact that that question is even on the board, the fact that that’s a question that one can legitimately answer outside the realm of philosophy, and the fact that it’s connected through this long path to entropy, which is like the tried-and-true, most fascinating thing about black holes, … seems crazy.”", "posttime": "2020-05-30 14:41:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "悖论,hole,黑洞", "title": "黑洞悖论揭示了能量与秩序之间的根本联系", "title_en": "Black Hole Paradoxes Reveal a Fundamental Link Between Energy and Order", "transed": 1, "url": "https://www.quantamagazine.org/black-hole-paradoxes-reveal-a-fundamental-link-between-energy-and-order-20200528/", "via": "", "real_tags": ["悖论", "hole", "黑洞"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004368, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们不能仅使用我们在博客第1部分中看到的基本矩阵演算规则来计算非常复杂函数的偏导数。例如，我们不能直接求出像sum(w+x)这样的嵌套表达式的导数，而不将其简化为它的标量等价物。我们需要能够使用向量链规则组合我们的基本向量规则。\n当我们需要由嵌套子表达式组成的表达式的派生时，链规则就开始发挥作用。链式规则通过将复杂的表达式分解成导数容易计算的子表达式来帮助解决问题。\n链条规则是根据嵌套函数定义的，例如单变量链条规则的y=f(g(X))。\n让我们看嵌套公式y=f(X)=ln(sin(x³)²)的示例。\n但单变量链规则只适用于单变量只以一种方式影响产出的情况。正如我们在示例中看到的，只有当x通过单个数据流路径影响y时，才能使用此链规则处理单变量x的嵌套表达式。\n如果我们对y=f(X)=x+x²应用单变量链规则，我们会得到错误的答案，因为导数算子不适用于多元函数。方程式中x的变化，既影响y作为加法操作数，也影响y作为平方操作数。因此，我们显然不能套用单变量链式规则。所以…。\n也就是计算(dy/dx)，我们需要求出x的变化对y的变化的所有可能的贡献。\n总导数假设所有变量潜在地相互依赖，而偏导数假设所有变量，但x是常数。\n当你对x求总导数时，其他变量也可能是x的函数，所以也要加上它们的贡献。方程的左边看起来像一个典型的偏导数，但右边实际上是全导数。\n总导数公式总是求和，也就是导数中的各项求和。例如，在给定y=x×x²而不是y=x+x²的情况下，全导数链规则公式仍会添加偏导数项，有关更多详细信息，请参阅论文中的演示。\n当所有中间变量都是单一变量的函数时，这种考虑总导数的链式规则退化为单变量链式规则。\n样本向量函数关于标量的导数，y=f(X)。\n引入两个中间变量g1和g2，每个fi一个，这样y看起来更像y=f(g(X))。\n如果我们拆分这些项，将这些项分离成一个向量，我们就可以得到一个由向量组成的矩阵。\n这就完成了链规则。在下一篇博客中，也就是第3部分，我们将看到如何应用神经激活和丧失函数的梯度，并总结。\n在写博客时很难转换成上标和下标，所以我在下面列出了，你可以在你的标记中使用(复制粘贴)\n超级脚本⁰²³⁴⁵⁶⁷⁸⁹ᵃᵇᶜᵈᵉᶠᵍʰᶦʲᵏˡᵐⁿᵒᵖʳˢᵗᵘᵛʷˣʸᶻ。\n下标₀₁₂₃₄₅₆₇₈₉ₐᵦ𝒸𝒹ₑ𝒻𝓰ₕᵢⱼₖₗₘₙₒₚᵩᵣₛₜᵤᵥ𝓌ₓᵧ𝓏", "note_en": "We can’t compute partial derivatives of very complicated functions using just the basic matrix calculus rules we’ve seen  Blog part 1. For example, we can’t take the derivative of nested expressions like sum( w +  x) directly without reducing it to its scalar equivalent. We need to be able to combine our basic vector rules using the vector chain rule.\n   The chain rule comes into play when we need the derivative of an expression composed of nested subexpressions. Chain rule helps in solving problem by breaking complicated expressions into subexpression whose derivatives are easy to compute.\n  Chain rules are defined in terms of nested functions such as  y=f(g(x)) for single variable chain rule.\n     Lets see example of nested equation y = f (x) =  ln(sin(x³ ) ² )\n   But single variable chain rule is applicable only when a single variable can influence output in only one way. As we see in example we can handle nested expression of single variable  x using this chain ruleonly when x can effect y through single data flow path.\n  If we apply single variable chain rule to  y = f (x) = x + x² we get wrong answer, because derivative operator doesnot apply to multivariate functions. change in x in the equation , affects y both as operand og addition and as operand of square. so we clearly cant apply single variable chain rule. so…\n  which is to compute (dy/dx) , we need to sum up all possible contributions from changes in x to the change in y.\n   Total derivative assumes all variables are potentially co-dependent where as partial derivative assumes all variables but  x are constants.\n when you take the total derivative with respect to x, other variables might also be functions of  x so add in their contributions as well. The left side of the equation looks like a typical partial derivative but the right-hand side is actually the total derivative.\n   total derivative formula always  sums, that is sums up terms in the derivative. For example, given y = x × x² instead of y = x + x² , the total-derivative chain rule formula still adds partial derivative terms, for more detail see demonstration in paper.\n   This chain rule that takes into consideration the total derivative degenerates to the single-variable chain rule when all intermediate variables are functions of a single variable.\n  derivative of a sample vector function with respect to a scalar,  y =  f (x).\n  introduce two intermediate variables, g 1 and g 2 , one for each f i so that y looks more like  y =  f ( g(x))\n  If we split the terms, isolating the terms into a vector, we get a matrix by vector.\n  This completes chain rule. In next blog that is part3 we will see how we can apply this gradient of neural activation and loss function and wrap up.\n   It is difficult while writing blog in markdown to convert to superscript and subscript so I have listed down , which you can use ( copy paste) in your markdown\n super script ⁰ ¹ ² ³ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ᵃ ᵇ ᶜ ᵈ ᵉ ᶠ ᵍ ʰ ᶦ ʲ ᵏ ˡ ᵐ ⁿ ᵒ ᵖ ʳ ˢ ᵗ ᵘ ᵛ ʷ ˣ ʸ ᶻ\n subscript ₀ ₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₐ ᵦ 𝒸 𝒹 ₑ 𝒻 𝓰 ₕ ᵢ ⱼ ₖ ₗ ₘ ₙ ₒ ₚ ᵩ ᵣ ₛ ₜ ᵤ ᵥ 𝓌 ₓ ᵧ 𝓏", "posttime": "2020-05-30 14:41:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,学习,calculus,导数", "title": "深度学习的矩阵演算(下)", "title_en": "Matrix Calculus for Deeplearning Part2", "transed": 1, "url": "https://kirankamath.netlify.app/blog/matrix-calculus-for-deeplearning-part2/", "via": "", "real_tags": ["深度学习", "学习", "calculus", "导数"]}, {"category": "", "categoryclass": "", "imagename": "3d73336b328062562a53f194dedf4efb.jpg", "infoid": 1004366, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于你们当中的单板计算(SBC)爱好者来说，这里有一条令人振奋的消息：Raspberry Pi4现在有8 GB的内存。\n是的，8 GB。这是到目前为止可用的最大内存的两倍。\n树莓派4在不到一年前发布，引用我们当时的标题，它是一款SBC的野兽。现在，它的内存翻了一番，可以发挥刚刚大幅增加的潜在可能性和能力。\n8 GB内存的覆盆子PI 4Model B售价75美元起。这使它成为有史以来发布的最昂贵的覆盆子PI。但还是相当便宜的。\n“我们提供更大内存变种的真正障碍是缺乏8 GB的LPDDR4封装。这些不存在[…]。但令人高兴的是，我们美光的合作伙伴在今年早些时候提供了一个合适的角色，“PI首席执行官埃本·厄普顿(Eben Upton)解释说。\nRaspberry PI 4中使用的处理器总共可以支持高达16 GB的内存，因此，虽然8 GB是一个受欢迎的恩惠，但…。这不是绝对的最大值。\n我想不出还有哪台电脑的价格在100美元以下，它拥有8 GB的内存--见鬼，大多数Chromebook现在仍然没有！\n感兴趣吗？您可以在下面找到新型号的链接。可用性可能/将根据您所在的位置而有所不同(如果它们的销售速度与4 GB机型一样快，则您需要快速)：\n现在的问题是…。内存为16 GB的机型会不会矫枉过正？请在下面的空白处告诉我！", "note_en": "Here’s a slice of juicy news for single-board computing (SBC) fans amongst you: the Raspberry Pi 4 is  now available with 8GB RAM.\n Yes,  8GB. That’s double the max memory that had, until now, been available.\n The  Raspberry Pi 4 launched just under a year ago and is, to quote our own headline of the time, it’s a beast of a SBC. Now it boasts double the memory to play with the potential possibilities and capabilities provided just increased substantially.\n   The  Raspberry Pi 4 Model B with 8GB RAM costs from $75. This makes it  the most expensive Raspberry Pi ever released. But still pretty cheap.\n  “The real barrier to our offering a larger-memory variant was the lack of an 8GB LPDDR4 package. These didn’t exist […] in 2019, but happily our partners at Micron stepped up earlier this year with a suitable part,” explains Pi chief Eben Upton.\n The processor used in the Raspberry Pi 4 can support up to 16GB of memory in total, so while 8GB is a welcome boon …It’s not the absolute max.\n I can’t think of a single other computer available for under $100 that boasts 8GB RAM — heck, most Chromebooks still don’t!\n Interested? You’ll find a link to the new model below. Availability may/will vary depending on your location (and if they sell as fast as the 4GB model, you’re going to need to be quick):\n   Question now is …would a model with 16GB RAM be overkill? Let me know in the space below!", "posttime": "2020-05-30 13:55:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,raspberry-pi,gb,raspberry", "title": "Raspberry PI 4现已提供8 GB内存", "title_en": "The Raspberry Pi 4 Is Now Available with 8GB RAM", "transed": 1, "url": "https://www.omgubuntu.co.uk/2020/05/raspberry-pi-4-8gb-ram", "via": "", "real_tags": ["内存", "gb", "raspberry"]}]