[{"category": "", "categoryclass": "", "imagename": "93bf6599c8c1523b0e0ea7ffbab0cd5e.png", "infoid": 1006514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，我一直对认知科学和有效的学习方法感兴趣。在阅读了多篇和文章，并对许多想法进行了测试之后，我收集了很多笔记。所以我想我可以把它们合成一个。\n精心设计的询问(测验和回忆)：问自己问题，并用你学到的材料来回答这些问题。\n自我解释和费曼技巧：用简单的术语解释你刚刚学到的东西。\n我没有认知科学或神经科学的正式背景，这更多的是我的副业。我的理解是有限的，我仍然需要学习如何有效地、始终如一地将所有这些想法应用到实践中。\n话虽如此，我发现本文中描述的一些方法非常有用。例如，在为期两年的MBA课程中，我用它们学习了外语、编程基础知识和各种学科。\n简而言之，把修行分散在一段时间内总比把它塞进一天要好。\n当立即测试时，第二组表现最好。但当测试延迟两天时，第三组表现最好。\n制定一个学习时间表，或者找出时间每天练习一点，而不是一次坐下来做更多的事情。\n如果您想了解更多，请阅读关于分布式实践的维基百科文章。\n主动找回你已经学过的信息可能比被动地重读或尝试再次学习要更有效。\n一项研究比较了强调学习过程的方法和强调测试的方法，发现后者对延迟回忆更有效。\n即使想象你可能会对你正在学习的材料进行测试，也可能有助于提高记忆力。\n如果几天前你学习了西班牙语中过去时是如何工作的，试着记住规则，甚至测试一下你的知识--而不是简单地再读一遍同样的材料。\n间隔检索实践基本上就是上述两种思想的结合。您经常测试自己，并根据您对材料的熟悉程度修改测试间隔。\n许多应用程序通过跟踪一个人的表现并自动调整间隔来简化这一过程。Anki是一款免费的、受欢迎的应用程序，可以用来学习外语词汇和其他东西。\n与上面列出的方法不同，这个方法还没有得到广泛使用。想法很简单：同时练习多种技能。这可能会使练习变得更加困难，但最终会得到回报。\n2007年的一项研究表明，学生混合不同的任务在练习过程中表现较差，但在随后的技能测试中表现较好。\n这项研究的重点是数学任务-寻找各种几何实体的体积-但在其他领域也发现了类似的效果，如羽毛球、篮球和医学。\n精心设计的审问是一个花哨的术语，指的是在学习时问自己问题。有时也被称为“测验和回忆”。\n一项研究发现，提问有助于获取科学事实。另一项研究表明，当你对这个主题已经有了一定的先验知识时，这种方法特别有效。但是，即使你不这样做，精心设计的审问似乎仍然比简单地阅读来理解更有效。\n问自己一个以“为什么”或“如何”开头的问题，并试着根据你所学的材料来回答。\n这个方法是建立在相同的想法之上的。学完新东西后，试着用你自己的话来解释。如果你有一个搭档或任何愿意听你讲解的人，你可以和他们一起练习，但自己解释也是有效的。\n正如一些教授和教师所指出的那样，他们不仅教授知识，而且更好地理解了这门学科。\n这种方法类似于诺贝尔奖获得者、物理学家理查德·费曼(Richard Feynman)提出的所谓费曼(Feynman)技术。除了自我解释，费曼还强调，你应该简单地解释事情，这样即使是六年级的学生也能理解。\n深思熟虑的练习和组块：将大的主题分解成需要学习的较小的、可管理的“组块”。\n休息一下，让你的大脑四处走动--“集中”和“分散”模式都很重要。\n我对“生物黑客”这个词有复杂的感觉，但我在这里会用它，因为没有更好的词了。真正的问题是，我们是否可以通过改变我们的生理来做任何事情来使学习变得更容易和更有效。\n不足为奇的是，研究最多、最安全、最有效的“生物黑客”让我们中的一些人想起了我们中的一些人从祖母那里得到的建议。\n这对任何人来说都不是什么新闻。关于睡眠剥夺对认知表现和记忆的影响，即使不是几百项，也有几十项研究。它们都指向同一个方向。睡眠需要时间，但它是一件秘密武器。\n一项研究调查了睡眠剥夺对注意力、工作记忆、执行功能、处理速度和情绪的影响。你可能会猜到发生了什么，但这些图表真正将结论带到了人们的脑海中：\n你可以在加州大学伯克利分校教授马修·沃克的播客节目中了解更多关于睡眠和深度剥夺对认知和健康的影响。\n睡眠过后，又多了一件免费的、非常有效的、经过深入研究的秘密武器。是的，锻炼身体。\n发表在“自然”杂志上的这项研究只是众多结论中的一个，这些结论认为锻炼可以改善多种任务类型的认知能力。\n不同类型的运动有不同的效果，所以最好将阻力训练(举重训练)、高强度间歇性有氧训练(HIIT)和低强度稳态心脏训练(LISS)很好地结合起来。\n如果你想了解更多关于锻炼对认知能力的影响，请查阅维基百科上关于体育锻炼的神经生物学效应的文章。\n就像睡眠和锻炼一样，营养可能听起来很乏味，但它是令人难以置信的有效的。回顾健康营养的原则超出了本文的范围，但这里有一些研究可能会让你对健康饮食更感兴趣。\n整个饮食方法和个别食物对认知的影响已经被研究过了。\n与更好的认知表现相关的食物和营养素包括绿茶、鱼、蓝莓、坚果、橄榄油和许多其他食物。\n鱼油中的omega-3-尤其是二十二碳六烯酸(DHA)可能会改善认知，延缓与年龄相关的认知衰退。这项随机对照试验发现了DHA对工作记忆分数的有益影响：\n要了解更多营养和认知之间的联系，请查看维基百科上关于营养和认知的文章、心灵饮食摘要、克里斯·克雷瑟的文章和朗达·帕特里克的播客。\n喝咖啡和绿茶-它们含有咖啡因和l-茶氨酸，它们有促性欲作用。\n打开窗户和/或使用空气净化器，确保呼吸到干净的空气。二氧化碳和颗粒物(PM2.5)已被证明会降低认知能力。\n考虑研究促性腺激素补充剂，但请谨慎行事--这里列出的方法要有效得多，也更安全。\n如果没有流行但无效的方法列表，这篇文章是不完整的。因此，这里有一个非详尽的列表：\n寻找你独特的“学习风格”--视觉、听觉或动觉学习背后的理论没有强有力的证据支持。", "note_en": "I’ve been interested in cognitive science and effective learning methods for years. After reading multiple and articles and putting many ideas to test, I’ve collected many notes. So I thought I’d synthesize them into a\n   Elaborative interrogation (quiz-and-recall): ask yourself questions and use the material you’ve learned to answer them\n Self-explanation and the Feynman technique: explain what you’ve just learned in simple terms\n    I have no formal background in cognitive science or neuroscience and this has been more of a side interest. My understanding is limited and I still need to learn how to effectively and consistently apply all these ideas to practice.\n That being said, I found some of the methods described in this article very useful. For example, I’ve used them to learn foreign languages, the basics of programming, and various disciplines covered during the two-year MBA program.\n   In short, it’s better to distribute one’s practice over a period of time than cram it into one day.\n   When tested immediately, the second group performed best. But when tested with a delay of two days, the third group performed best.\n    Create a learning schedule or find time to practice a little bit every day instead of doing more in one sitting.\n If you’d like to learn more, read  the Wikipedia article on distributed practice.\n  It might be more effective to  actively retrieve the information you’ve already learned than passively  re-read or try to learn it once again.\n One study that compared a method that emphasized study sessions with a method that emphasized tests and found the latter to be more effective for delayed recall.\n   Even imagining that you might be tested on the material you’re learning might help improve the recall.\n  If a few days ago you learned how past tense works in the Spanish language, try to remember the rules or even test yourself on your knowledge — instead of simply re-reading the same material once again.\n   Spaced retrieval practice is basically a combination of the two ideas above. You test yourself frequently and modify the test intervals depending on how familiar you’re with the material.\n  Many apps simplify the process by tracking one’s performance and adjusting the intervals automatically.  Anki is a free and popular app that can be used for learning foreign language vocabulary as well as other things.\n  Unlike the methods listed above, this one is not as widely used yet. The idea is simple: practice multiple skills at the same time. This can make practice more difficult but it pays off at the end.\n A 2007 study showed that students mixed different tasks performed worse during the practice session but better in the subsequent test of their skills.\n This study focused on math tasks — finding the volume of various geometric solids — but similar effects were found in other domains, such as  badminton,  basketball, and  medicine.\n      Elaborative interrogation is a fancy term for asking yourself questions while studying. Sometimes it’s also called “quiz-and-recall”.\n One study found that asking questions is useful for acquiring science facts.  Another one showed that this method is particularly effective when you already have certain prior knowledge about the subject. But even if you don’t,  elaborative interrogation still appears to be more effective than simply reading to understand.\n  Ask yourself a question that starts with “Why” or “How” and try to answer it based on the material you’ve learned.\n  This method is built on the same idea. After learning something new, try to explain it in your own words. If you have a partner or anyone willing to listen to your explanations, you can practice with them but explaining things to yourself works too.\n   As some professors and teachers note, they not only teach to share knowledge but also to understand the subject better.\n The method is similar to the so-called  Feynman Technique attributed to the Nobel prize-winning physicist Richard Feynman. In addition to self-explanation, Feynman also emphasized that you should explain things simply so that even a sixth-grade student would understand them.\n    Deliberate practice and chunking: break the big subject down into smaller manageable “chunks” that need to be learned.\n  Take breaks and let your mind wander — both “focused” and “diffused” modes are important.\n  I have mixed feelings about the term “biohacking’ but I’ll use it here for the lack of a better word. The real question is whether we can do anything to make learning easier and more effective by changing our physiology.\n Not surprisingly, the most studied, the safest, and the most effective “biohacks” are reminiscent of the advice some of us received from our grandmas.\n  This is hardly news to anyone. There are dozens if not hundreds of studies on the effects sleep deprivation has on cognitive performance and memory. And they all point in the same direction. Sleep takes time but it’s a secret weapon.\n One study examined the effects of sleep deprivation on attention, working memory, executive function, speed of processing, and mood. You can probably guess what happened but these charts really bring the conclusions home:\n  You can learn more about the effects of sleep and deep deprivation on cognition and health in  the podcast episode with Matthew Walker, a professor at UC Berkeley.\n  After sleep, there is one more secret weapon that is free, very effective, and thoroughly studied. Yes, exercise.\n The study published in Nature is only one of many that concluded that exercise can improve cognition across multiple task types.\n       Different types of exercise have different effects so that it’s better to do a nice mix of resistance training (weight-training), high-intensity interval cardio training (HIIT), and low-intensity steady-state cardio training (LISS).\n If you’d like to learn more about the effects of exercise on cognitive performance, check out  the Wikipedia article on neurobiological effects of physical exercise.\n  Just like sleep and exercise, nutrition might sound boring but it’s incredibly effective. Reviewing the principles of healthy nutrition is beyond the scope of this article but here are a few studies that might get you more excited about eating healthy.\n Entire dietary approaches and individual foods have been studied in terms of their effects on cognition.\n Foods that and nutrients that have been associated with better cognitive performance include green tea, fish, blueberries, nuts, olive oil, and many others.\n     Omega-3 in fish oil — and in particular docosahexaenoic acid (DHA) — might  improve cognition and  delay age-related cognitive decline. And  this randomized, controlled trial found beneficial effects of DHA on working memory scores:\n  To learn more about the link between nutrition and cognition, check out  the Wikipedia article on nutrition and cognition,  the summary of the MIND diet,  Chris Kresser’s article, and  Rhonda Patrick’s podcast.\n  Drink coffee and green tea — they contain caffeine and l-theanine that  have nootropic effects.\n Ensure you’re breathing clean air by opening windows and/or using an air purifier.  CO2 and Particulate Matter (PM2.5) have been shown to reduce cognitive performance.\n Consider researching nootropic supplements but err on the side of caution — the methods outlined here are much more powerful and safer.\n  This post wouldn’t be complete without the list of popular yet ineffective methods. So here is a non-exhaustive list:\n Finding your unique “learning style” — the theory behind Visual, Auditory, or Kinesthetic learning  isn’t backed up by strong evidence.", "posttime": "2020-06-14 16:49:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学习,learning", "title": "文章：学习如何学习(附20篇研究参考文献)", "title_en": "Article: Learning How to Learn (With 20 Study References)", "transed": 1, "url": "https://max2c.com/learning-how-to-learn/", "via": "", "real_tags": ["学习", "learning"]}, {"category": "", "categoryclass": "", "imagename": "d3fa3acec1e7d17b21ed664984b28e97.jpg", "infoid": 1006513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "隔离已经改变了我们的连接方式，无论是在线还是离线。随着我们越来越多地依赖互联网来满足工作、社会关系和基本需求，是时候讨论有意义的在线体验的未来，以及对新互联网架构的需求。我们需要一个以用户为中心、本地化的互联网。这种具有竞争力的架构将提供一种比单向广告更看重实时连接的体验，并将控制权交给用户，而不是大型技术平台。\n这个范例将颠覆这个模型，让人们从完全的隐私和安全开始，并从那里开始允许他们根据信任级别打开他们的渠道。它颠倒了服务条款，不是任何平台将它们强加给用户，而是用户将他们的条款强加给平台。\n丹尼尔·伯宁格(Daniel Berninger)是VoIP的早期先驱，也是新架构基金会(New Architecture Foundation)的创始人。杰夫·普尔弗(Jeff Pulver)是一位互联网企业家和VoIP先驱，他创立了包括Vonage在内的企业。\n一个与“公共”互联网竞争的新架构是完全可能的，它从一种政策方法开始，这种方法促进了必要的创新和投资，同时允许灵活性和试验性。\n修复互联网并不根植于将其视为公用事业；它不存在于政府的微观管理中。事实上，这些非常落后的政策只会通过保护现状来加剧伤害，这可能就是为什么大型科技平台一直在如此热心地推动这些政策。\n在过去的十年里，进步人士越来越多地转向政府干预市场，以此作为解决一些神秘问题的办法。这个放错地方了。正如我们在挑战2015年联邦通信委员会(Federal Communications Commission)基于公用事业的网络中立规则时所说的那样，这也扼杀了投资、初创企业和新的创新。公用事业不会使价值主张增加一千倍；相反，公用事业会提高利率并冻结价值。\n任何新的架构覆盖都至关重要的是底层基础设施。有了这一点，这个故事就相当积极了。美国已经成功地解决了容量问题；弹性宽带网络在大流行期间表现良好。这在很大程度上是由于历史上的监管方式，拒绝自上而下的政府控制，允许私营部门、基于设施的竞争和投资。自90年代中期以来，数万亿美元的私人资金被投入到我们的互联网基础设施中。这使得互联互通的价值主张增加了一千倍。\n是的，我们今天经历的公共互联网创造了价值万亿美元的技术平台，但它允许硅谷的一些实体殖民整个星球，扼杀消费者的选择。六家公司控制着43%的互联网流量。在这六家公司中，有三家-谷歌、Facebook和亚马逊-获得了美国所有数字广告收入的70%。\n根据皮尤研究中心(Pew Research)最近的一项研究，“大约十分之六的美国成年人表示，他们认为，如果没有公司或政府收集的关于他们的数据，他们不可能过上日常生活。”此外，与五年前相比，“70%的成年人表示他们的个人数据不那么安全”。\n目前的模式导致了应用程序垄断的兴起，它们的唯一目的是挖掘和出售尽可能多的个人数据，同时控制你在网上看到和做的事情。没有双向的关系发生，如果有的话，这些平台会有客户服务线路，实际上是到了某个地方。\n虽然互联网安全和弹性在新冠肺炎期间一直是成功的故事，但随着政府为了“公共利益”抛弃个人隐私，转向硅谷以全面跟踪的形式寻求神奇的解决办法，大型科技公司的规模不断扩大，最常见的情况是无法选择退出。\n新架构的重点放在本地控制和实时交互通信上，放弃了控制/审查/利用的权力，排除了主导互联网流量的少数平台的权力积累。\n这种模式还应该鼓励互联网的采用，这与价值主张息息相关。在无线出现之前，地球上只有8亿有线连接(相对于当时的世界人口，大约有15%的普及率)。无线的价值主张如此之高，以至于采用率达到了顶峰。现在几乎每个人都有智能手机，因为采用与价值捆绑在一起，随着本地化的互联网价值通过信任呈指数级增长。\n下一个是什么？我们建立试验台和协作机制，并集体记录实验。我们在网上实现地方主义，这是个人控制的最后堡垒，通过当地社区、选择和竞争来扩大规模。我们奉行明智的政策。\n我们可以继续使用不为居住者服务的建筑，比如监狱，或者建造一个服务于居住者的建筑，比如酒店。新架构始于这样的假设，即人类在任何情况下都更喜欢自决，并服务于道格拉斯·恩格尔巴特(Douglas Engelbart)在互联网早期倡导的人类增强事业。塑造当前互联网体验的算法设计假装这两个假设都不存在，因为自决需要地方控制，而扩大涉及到考虑个人需求的反规模经济义务。\n日常生活的私密方面远远超出了公众的范畴，并延伸到更多的话题。互联网的现状只解决了适合在公共场合锻炼的微小的人类活动。为了销售广告而把每个人都暴露在等同于无家可归的网络环境中，已经超出了我们大多数人的容忍范围。与使用不断扩大的表演模式和令人毛骨悚然的监控来推动广告收入相比，连接在支持人类生产力方面存在更有价值的用途。缩小现有沟通方式和面对面交流之间的差距，是后大流行经济的事业，也是约翰·佩里·巴洛(John Perry Barlow)设想的互联网的最高目的。当我们在Covid之后重置时，我们需要重置互联网架构，以便连接的程度与用户控制和赢得的信任捆绑在一起。\n《连线观点》发表外部撰稿人的文章，代表了广泛的观点。点击此处阅读更多观点。提交一篇专栏文章，电子邮件地址为：tOptions@wired.com。\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Quarantine has changed the way we connect, online and off. As we rely on the internet more and more for work, social connections, and basic needs, it is time to talk about the future of meaningful online experiences, and the need for a new internet architecture. We need a user-focused, localized internet. This competitive architecture would deliver an experience that values real-time connectivity over one-way advertising and puts control with the user, not with big tech platforms.\n This paradigm would flip the model on its head, letting people start with complete privacy and security, and from there allow them to open their channels depending on trust level. It inverts the terms of service, where instead of any platform imposing them on users, users impose theirs terms on the platform.\n Daniel Berninger is an early VoIP pioneer and founder of the New Architecture Foundation.  Jeff Pulver is an internet entrepreneur and VoIP pioneer who founded ventures including Vonage.\n  A new architecture that competes with the “public” internet is completely possible, and it begins with a policy approach that fosters the necessary innovation and investment, while allowing for flexibility and experimentation.\n Fixing the internet is not rooted in treating it like a public utility; it is not to be found in micromanagement by government. In fact, those very backward-looking policies only fuel more harm by protecting the status quo, which is likely why big tech platforms have been so fervently pushing for them.\n Over the past decade, progressives have increasingly turned to government intervention in the market as a solution to some mythical problem. This is misplaced. As we argued in challenges to the 2015 Federal Communications Commission’s public-utility-based Net Neutrality rules, this also kills investment, startups, and new innovation. Utility doesn’t increase the value proposition a thousand-fold; rather, utility raises rates and freezes value in place.\n  Crucial to any new architectural overlay is the underlying infrastructure. With that, the story is rather positive. The United States has successfully solved for capacity; resilient broadband networks have fared well during the pandemic. This is in large part due to a historically regulatory approach, which rejected top-down government control and allowed for private-sector, facilities-based competition and investment. Since the mid-’90s trillions of private dollars have been plowed into our internet infrastructure. And that  has increased the value proposition of connectivity a thousand-fold.\n  Yes, the public internet we experience today created the trillion-dollar tech platforms, but it allows for a few entities in Silicon Valley to colonize the entire planet and kill consumer choice. Six companies control 43 percent of all internet traffic. Of those six,  three—Google, Facebook, and Amazon—receive 70 percent of all digital ad revenue in the US.\n According to a  recent Pew Research study, “roughly six in ten U.S. adults say they do not think it is possible to go through daily life  without having data collected about them by companies or the government.” Further, “70 percent of adults say their personal data is less secure” than it was five years ago.\n The current model has resulted in the rise of application monopolies, which have the sole purpose of scooping and selling as much personal data as possible, while controlling what you see and do online. There is no two-way relationship occurring, and if there were, these platforms would have customer service lines that actually went somewhere.\n While internet security and resilience have been success stories during Covid-19, Big Tech keeps getting bigger, as governments toss out personal privacy for “public good” and turn to Silicon Valley for magical fixes in the form of comprehensive tracking, most often with no way to opt out.\n The focus of new architecture on localized control and real-time interactive communication surrenders the power to control/censor/exploit, precluding the accumulation of power by the few platforms that dominate internet traffic.\n This model should also encourage internet adoption, which is tied to value proposition. Before wireless arrived, there were only 800 million wireline connections on the planet (roughly a 15 percent penetration rate relative to the world&#39;s population then). The value proposition was so much higher with wireless that adoption rates went through the roof. Just about everyone has a smartphone now, as adoption is tied to value, and with a localized internet value increases exponentially through trust.\n  What’s next? We build test beds and a collaboration mechanism, and we collectively document experiments. We enable localism online, which is the last bastion of individual control, building scale through local communities, choice, and competition. And we pursue smart policy.\n  We can continue to with an architecture that doesn’t serve occupants, like a prison, or build one that does, like a hotel. New architecture starts with the assumption humans prefer self-determination in any context, and serves the cause of human augmentation that Douglas Engelbart championed in the earlier days of the internet. The design of algorithms shaping the current experience of the internet pretend neither assumption exists, because self-determination requires local control and augmentation involves the anti-economy of scale obligation to contemplate individual needs.\n The private aspect of daily life far exceeds the public and extends to far more topics. The internet status quo addresses only the tiny body of human activities suitable for exercising in public. Exposing everyone to the equivalent of homelessness online for the purposes of selling advertising already exceeds the tolerance of most of us. There exist more valuable uses of connectivity in support of human productivity than conjuring ever expanding modes of performance and creepy surveillance to drive advertising revenues. Reducing the gap between available means of communication and meeting in-person serves the cause of the post-pandemic economy and the great and gathering conversation John Perry Barlow imagined as the highest purpose of the internet. As we reset after Covid, we need to reset internet architecture so the extent of connectivity is tied to user control and trust—trust that is earned.\n  WIRED Opinion  publishes articles by outside contributors representing a wide range of viewpoints. Read more opinions  here. Submit an op-ed at opinion@wired.com.\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-06-14 15:43:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "是否,architecture,互联网", "title": "互联网是否需要一个以用户为本的新架构？", "title_en": "Does the Internet Need a New Architecture that Puts Users First?", "transed": 1, "url": "https://www.wired.com/story/opinion-the-internet-needs-a-new-architecture-that-puts-users-first/", "via": "", "real_tags": ["是否", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "dddef8917724a3b9dbc999f627035ebf.png", "infoid": 1006512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个轻量级的纯Python模块，用于基于VTK和Numpy的3D对象和点云的科学分析和可视化。\n受vpython“普通人3D编程宣言”的启发，Vedo使得使用三维对象、创建显示和动画只需几行代码，即使对于那些编程经验较少的人也是如此。在Vpython宣言的启发下，Vedo使处理三维对象、创建显示和动画变得容易，即使对于那些编程经验较少的人也是如此。\nWindows-10用户可以将该文件vedo.bat放在桌面上拖放文件进行可视化(需要编辑本地python安装路径)。\n📌需要帮助吗？有任何问题，或者想要建议或询问缺少的功能吗？请不要犹豫，打开问题或发送电子邮件。\nVedo模块包括一大组适用于各种功能的工作示例：\n-从VTK格式、STL格式、Wavefront OBJ格式、3DS格式、Dolfin-XML格式、中性格式、GMSH格式、OFF格式、PCD(PointCloud)格式导入网格；-将网格作为ASCII或二进制格式导出到VTK、STL、OBJ、PLY.。格式。-分析工具，如移动最小二乘法、网格变形等。-可视化和编辑网格的工具(用另一个网格剪切网格、切片、规格化、移动顶点位置等)。-基于曲面连通性分割网格。提取最大的连通区域。-计算面积、体积、质心、平均大小等。-计算顶点和面法线、曲率、特征边。填充网孔。-细分网格面，增加顶点数量。网格简化。-基于相关的标量或矢量数据对网格进行着色和阈值处理。-点-表面操作：查找最近的点，确定一个点是位于网格内部还是外部。-创建基本形状：球体、箭头、立方体、圆环、椭球体…-生成字形(将网格与源网格的每个顶点相关联)。-只需设置3D场景中显示对象的位置，即可轻松创建动画。支持向移动对象添加拖尾线和阴影。-在同一窗口中直接支持多个同步或独立的渲染器。-使用不同技术注册(对齐)网格。-网格平滑。-2D和3D中的Delaunay三角剖分。-通过连接空间中邻近的线来生成网格。-查找从一点到另一个点的最近路径，沿网格的边缘行进。-查找网格与线的交点，平面或其他网格。-使用径向基函数和薄板样条插值标量和矢量场。-添加滑块和按钮以与场景和单个对象交互。-张量的可视化。-点云分析：-移动最小二乘平滑2D、3D和4D云-拟合空间中的线、平面、球体和椭圆-标识点分布中的异常值-将云减少到均匀分布。\n-从VTK格式的体积TIFF堆栈、DICOM、SLC、MHD等导入数据-以PNG、JPEG、BMP格式导入2D图像-体积的等值面处理-复合和最大投影体积渲染-从输入曲面网格生成体积有符号距离数据-使用直线和平面探测体积-从矢量场生成流线和流管-切片和裁剪体积-支持其他体积结构(结构化和网格数据)。\n-完全可自定义的轴样式-圆环图和饼图-二维和三维散点图-表面函数绘制-一维可自定义直方图-二维六边形直方图-极坐标图、球形图和柱状图-在渲染窗口中绘制乳胶格式的公式。-抖动图-流线图-类似于matplotlib的点标记\n使用K3D将3D渲染嵌入到Jupyter笔记本中(可以在此处导出交互式3D快照页面)。\n要可视化多个文件或文件时间序列，请尝试-n或-s选项。使用-h查看完整的选项列表。\n应用移动最小二乘算法从空间中的散乱点云获得平滑曲面(脚本)。\n用10行代码(脚本)创建一个简单的3D动画。轨迹和阴影可以很容易地添加到移动的对象。\n用四阶龙格-库塔方法积分薛定谔方程的量子隧穿效应。动画显示了长方体中的粒子撞上正弦势垒的演化过程。(剧本)。\n支持FENICS/Dolfin平台以可视化PDE和有限元解决方案(请参见此处)。\nM.Musy，G.Dalmasso，J.Sharpe和N.Sime，&34；Vedo：Plot in FENICS with Python&34；，(Link).发帖于2019年会议，卡内基科学研究所地磁系，华盛顿特区，2019年6月。\nG.Dalmasso，&#34；三维体图像在空间和时间上的演变&#34；在基于图像的形态发生建模和仿真会议上的演讲。马克斯·普朗克复杂系统物理研究所，德国德累斯顿，2019年3月。\nX.Diego等人：图灵系统的主要功能完全由网络拓扑确定，物理评论X，2018年6月20日。\nM.Musy，K.Flaherty等：&#34；一种基于肢体形态测量的小鼠肢体胚胎分期的定量方法&#34；“发育”，2018年4月5日，doi：10.1242/dev.154856。\nG.Dalmasso等人，3D体积图像在空间和时间上的演变，正在准备中。\n书名/作者The Healthology of the the BrainRender，and the the BrainRender.。一款基于蟒蛇的神经解剖学和形态学数据可视化软件。BioRxiv2020.02.23.961748；doi：https://doi.org/10.1101/2020.02.23.961748。\n你觉得这个软件对你的研究有用吗？请引用它作为：M.Musy等人&#34；vedo，一个用于基于Vtk(可视化工具包)的3D对象和点云的科学可视化和分析的Python模块，泽诺多，2019年2月10日，doi：10.5281/zenod.2561402。", "note_en": "A lightweight pure python module for scientific analysis and visualization of 3D objectsand  point clouds based on  VTK and  numpy.\n    Inspired by the  vpython  manifesto &#34;3D programming for ordinary mortals&#34;,  vedo makes it easy to work wth three-dimensional objects, create displays and animationsin just a few lines of code, even for those with less programming experience.\n      Windows-10 users can place this file vedo.baton the desktop to  drag&amp;drop files to visualize.(Need to edit the path of the local python installation).\n   📌  Need help? Have any question, or wish to suggest or ask for a missing feature?Do not hesitate to open a   issueor send an  email.\n  The  vedo module includes a   large set of working examplesfor a wide range of functionalities:\n   - Import meshes from VTK format, STL, Wavefront OBJ, 3DS, Dolfin-XML, Neutral, GMSH, OFF, PCD (PointCloud),- Export meshes as ASCII or binary to VTK, STL, OBJ, PLY ... formats.- Analysis tools like Moving Least Squares, mesh morphing and more..- Tools to visualize and edit meshes (cutting a mesh with another mesh, slicing, normalizing, moving vertex positions, etc..).- Split mesh based on surface connectivity. Extract the largest connected area.- Calculate areas, volumes, center of mass, average sizes etc.- Calculate vertex and face normals, curvatures, feature edges. Fill mesh holes.- Subdivide faces of a mesh, increasing the number of vertex points. Mesh simplification.- Coloring and thresholding of meshes based on associated scalar or vectorial data.- Point-surface operations: find nearest points, determine if a point lies inside or outside of a mesh.- Create primitive shapes: spheres, arrows, cubes, torus, ellipsoids...- Generate glyphs (associate a mesh to every vertex of a source mesh).- Create animations easily by just setting the position of the displayed objects in the 3D scene. Add trailing lines and shadows to moving objects is supported.- Straightforward support for multiple sync-ed or independent renderers in the same window.- Registration (alignment) of meshes with different techniques.- Mesh smoothing.- Delaunay triangulation in 2D and 3D.- Generate meshes by joining nearby lines in space.- Find the closest path from one point to another, travelling along the edges of a mesh.- Find the intersection of a mesh with lines, planes or other meshes.- Interpolate scalar and vectorial fields with Radial Basis Functions and Thin Plate Splines.- Add sliders and buttons to interact with the scene and the individual objects.- Visualization of tensors.- Analysis of Point Clouds: - Moving Least Squares smoothing of 2D, 3D and 4D clouds - Fit lines, planes, spheres and ellipses in space - Identify outliers in a distribution of points - Decimate a cloud to a uniform distribution.\n   - Import data from VTK format volumetric TIFF stacks, DICOM, SLC, MHD and more- Import 2D images as PNG, JPEG, BMP- Isosurfacing of volumes- Composite and maximum projection volumetric rendering- Generate volumetric signed-distance data from an input surface mesh- Probe a volume with lines and planes- Generate stream-lines and stream-tubes from vectorial fields- Slice and crop volumes- Support for other volumetric structures (structured and grid data)\n   - Fully customizable axis styles- &#39;donut&#39; plots and pie charts- Scatter plots in 2D and 3D- Surface function plotting- 1D customizable histograms- 2D hexagonal histograms- Polar plots, spherical plots and histogramming- Draw latex-formatted formulas in the rendering window.- Quiver plots- Stream line plots- Point markers analogous to matplotlib\n  Embed the 3D rendering in a  jupyter notebook with  K3D (can export an interactive 3D-snapshot page  here).\n      To visualize multiple files or files time-sequences try  -n or  -s options. Use  -h for the complete list of options.\n      Apply a  Moving Least Squares algorithm to obtain a smooth surface from a to a large cloud of scattered points in space ( script)\n Create a simple 3D animation in exactly 10 lines of code ( script). Trails and shadows can be added to moving objects easily.\n  Quantum-tunnelling effect integrating the Schroedinger equation with 4th order Runge-Kutta method. The animation shows the evolution of a particle in a box hitting a sinusoidal potential barrier. ( script)\n  Support for the  FEniCS/Dolfin platform for visualization of PDE and finite element solutions ( see here)\n       M. Musy, G. Dalmasso, J. Sharpe and N. Sime, &#34; vedo : plotting in FEniCS with python&#34;, ( link).Poster at the  FEniCS&#39;2019 Conference,Carnegie Institution for Science Department of Terrestrial Magnetism, Washington DC, June 2019.\n G. Dalmasso,  &#34;Evolution in space and time of 3D volumetric images&#34;. Talk at the Conference for  Image-based Modeling and Simulation of Morphogenesis.Max Planck Institute for the Physics of Complex Systems, Dresden, Germany, March 2019.\n  X. Diego  et al.: &#34;Key features of Turing systems are determined purely by network topology&#34;, Physical Review X, 20 June 2018.\n M. Musy, K. Flaherty  et al.: &#34;A Quantitative Method for Staging Mouse Limb Embryos based on Limb Morphometry&#34;,Development, 5 April 2018,  doi: 10.1242/dev.154856.\n G. Dalmasso  et al.,  &#34;Evolution in space and time of 3D volumetric images&#34;, in preparation.\n F. Claudi, A. L. Tyson, T. Branco,  &#34;Brainrender. A python based software for visualisation of neuroanatomical and morphological data.&#34;bioRxiv 2020.02.23.961748; doi:  https://doi.org/10.1101/2020.02.23.961748\n Have you found this software useful for your research? Please cite it as: M. Musy  et al.&#34; vedo , a python module for scientific visualization and analysis of 3D objectsand point clouds based on VTK (Visualization Toolkit)&#34;,Zenodo, 10 February 2019,  doi: 10.5281/zenodo.2561402.", "posttime": "2020-06-14 15:42:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,python,科学,class,网格", "title": "用VTK实现3D对象科学可视化的Python类", "title_en": "A Python class for scientific visualization of 3D objects with VTK", "transed": 1, "url": "https://github.com/marcomusy/vedo", "via": "", "real_tags": ["可视化", "python", "科学", "class", "网格"]}, {"category": "", "categoryclass": "", "imagename": "056592ad196154b59150a796e8a03414.jpg", "infoid": 1006510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "戴夫：通常我不会给你看这么粗俗的东西，我希望你能理解更多关于如何支持平等正义倡议的问题……", "note_en": "From Dave: Normally I wouldn't show you something so unrefined, I hope you understand To find out more about how you can support the Equal Justice Initiative...", "posttime": "2020-06-14 15:40:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,戴夫,dave,希望", "title": "戴夫·查佩尔8：46", "title_en": "Dave Chappelle 8:46", "transed": 1, "url": "https://www.youtube.com/watch?v=3tR6mKcBbT4", "via": "", "real_tags": ["app", "戴夫", "dave", "希望"]}, {"category": "", "categoryclass": "", "imagename": "9715938b5c8be4880cc0a7a197180551.jpg", "infoid": 1006509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两名贝塔地中海贫血患者和一名镰状细胞疾病患者在他们的骨髓干细胞经过CRISPR基因编辑后，不再需要输血，而输血通常用于治疗这些严重形式的遗传性疾病。\n这项正在进行的试验是第一次使用CRISPR治疗遗传性遗传疾病，其结果今天在欧洲血液学协会的一次虚拟会议上公布。\n“初步结果…。田纳西州纳什维尔萨拉·坎农研究所的团队成员Haydar Frangul在一份声明中说：“从本质上讲，这是一种针对β地中海贫血病和镰状细胞疾病患者的功能性治疗方法。\nβ地中海贫血症和镰状细胞是由影响血红蛋白的突变引起的疾病，血红蛋白是一种在红细胞中携带氧气的蛋白质。那些病情严重的人需要定期输血。\n然而，少数携带致病突变的人从来没有表现出任何症状，因为他们在成年后一直会产生胎儿血红蛋白。正常情况下，胎儿血红蛋白在出生后不久就会停止产生。\n这一发现启发了以提高胎儿血红蛋白为基础的治疗方法的发展。在这项由CRISPR治疗公司和Vertex合作进行的试验中，骨髓干细胞被从人体中移除，而关闭胎儿血红蛋白产生的基因被CRISPR禁用。\n剩余的骨髓细胞被化疗杀死，然后被编辑后的细胞取代。这样做是为了确保编辑后的干细胞产生新的血细胞，但化疗可能会产生严重的副作用，包括不孕不育。\n自从15个月和5个月前接受治疗以来，前两名β地中海贫血症患者不再需要输血。治疗9个月后，镰状细胞病患者也没有。\n法国巴黎Necker-Enfants Malades医院的Marina Cavazzana说，结果非常好，他们的团队用不同的方法治疗了一名患有镰状细胞疾病的13岁男孩。\n虽然这三名患者确实因化疗而出现了一些不良反应，但CRISPR基因编辑似乎是安全的。然而，Cavazzana说，患者可能需要在他们的余生中进行监测，以确保它没有不良影响。\n目前共有五人接受治疗。由于冠状病毒大流行，试验被搁置，但现在已经恢复。\n订阅我们的免费健康检查时事通讯，每月综合您需要了解的所有健康和健身新闻", "note_en": "Two people with beta thalassaemia and one with sickle cell disease no longer require blood transfusions, which are normally used to treat severe forms of these inherited diseases, after their bone marrow stem cells were gene-edited with  CRISPR.\n Result of the ongoing trial, which is the first to use CRISPR to treat inherited genetic disorders, were announced today at a virtual meeting of the European Hematology Association.\n “The preliminary results… demonstrate, in essence, a functional cure for patients with beta thalassaemia and sickle cell disease,” team member Haydar Frangoul at Sarah Cannon Research Institute in Nashville, Tennessee,  said in a statement.\n   Beta thalassaemia and sickle cell are diseases caused by  mutations that affect haemoglobin, the protein that carries oxygen in red blood cells. Those with severe forms require regular blood transfusions.\n However, a few people with the disease-causing mutations never show any symptoms, because they keep producing fetal haemoglobin in adulthood. Normally, fetal haemoglobin stops being produced soon after birth.\n  This discovery has inspired the development of treatments based on boosting fetal haemoglobin. In this trial, run by collaborating companies CRISPR Therapeutics and Vertex, bone marrow stem cells are removed from people and the gene that turns off fetal haemoglobin production is disabled with CRISPR.\n The remaining bone marrow cells are killed by chemotherapy, then replaced by the edited cells. This is done to ensure new blood cells are produced by the edited stem cells, but the chemotherapy can have serious side effects including infertility.\n The first two patients with beta thalassaemia no longer need blood transfusions since being treated 15 and 5 months ago. Nor does the patient with sickle cell disease, 9 months after treatment.\n  The results are excellent, says Marina Cavazzana at the Necker-Enfants Malades Hospital in Paris, France, whose team  has treated a 13-year-old boy with sickle cell disease using a different approach.\n While the three patients did suffer some adverse effects due to the chemotherapy, the CRISPR gene editing appears safe. However, the patients may need to be monitored for the rest of their lives to be sure it has no adverse effects, says Cavazzana.\n Altogether five people have now been treated. The trial was put on hold because of the coronavirus pandemic, but has now resumed.\n Sign up to our free  Health Check newsletter for a monthly round-up of all the health and fitness news you need to know", "posttime": "2020-06-14 14:34:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "遗传性,inherited,治疗", "title": "CRISPR成功治疗3例遗传性疾病患者", "title_en": "Three people with inherited diseases successfully treated with CRISPR", "transed": 1, "url": "https://www.newscientist.com/article/2246020-three-people-with-inherited-diseases-successfully-treated-with-crispr", "via": "", "real_tags": ["遗传性", "inherited", "治疗"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "荣格写这篇文章是为了介绍海因里希·齐默写的一本关于拉马纳·马哈希的书。1段编号取自荣格的作品集。\n海因里希·齐默尔多年来一直对提鲁万纳马莱的马哈西感兴趣，我从印度回来后，他问我的第一个问题是关于这位来自印度南部的最新圣洁而明智的人。我不知道我的朋友认为我没有找到什莉·拉马纳是不可饶恕的罪过还是难以理解的罪过。我有一种感觉，他肯定不会忘记去拜访他，他对圣人的生活和思想是如此热情。这并不令人惊讶，因为我知道齐默尔已经深深地渗透到了印度的精神中。不幸的是，他最热切的愿望是看到现实中的印度从未实现，而他唯一做到这一点的机会在第二次世界大战爆发前的最后几个小时破灭了。似乎作为补偿，他对精神印度的愿景更加宏伟。在我们的合作中，他不仅通过他渊博的技术知识，而且最重要的是通过他对印度神话的含义和内容的出色把握，给了我对东方心灵的宝贵洞察力。不幸的是，众神所爱的人的早逝在他身上实现了，我们仍然要哀悼失去了一种精神，这种精神克服了这位专家的局限，转向人性，赋予它“不朽的果实”这一欢乐的礼物。在印度，神话和哲学智慧的载体自古以来就是“圣人”--这是一个西方的称谓，它并没有完全呈现出东方平行人物的本质和外观。这个人物是精神印度的化身，我们在文学作品中一次又一次地见到他。因此，难怪齐默尔对这一类型的最新、最好的化身--史瑞·拉马纳这位非凡的人物--抱有浓厚的兴趣。他在这位瑜伽修行者身上看到了瑞士、先知和哲学家形象的真实化身，这一形象跨越了千百年来的历史，既是传奇的，也是传奇的。也许我应该去拜访什莉·拉马纳。然而，我担心，如果我第二次去印度旅行，以弥补我的疏漏，我仍然会遇到同样的情况：尽管这一场合很独特，但我根本不能亲自拜访这位无疑是杰出的人。因为事实是，我怀疑他的独特性；他是那种过去一直是，将来也会是的类型。因此，没有必要去找他。我在印度各地看到他，在罗摩克里希纳的照片中，在罗摩克里希纳的弟子中，在佛教僧侣中，在印度日常场景中的无数其他人物中，他智慧的话语是印度精神生活的源泉。从某种意义上说，什里·拉马纳是一个人类，是印度大地上真正的“人类之子”。他是“真实的”，最重要的是，他是一种“现象”，在欧洲人的眼中，他声称自己是独一无二的。但在印度，他仅仅是白色表面上最白的一点(人们之所以提到他的白色，只是因为有太多同样黑色的表面)。总而言之，人们在印度看到的东西太多了，最终只希望自己能看到更少的东西：种类繁多的国家和人类创造了一种对完全简单的渴望。这种简约也在那里；它像一种令人愉悦的香水或旋律一样弥漫在印度的精神生活中。它无处不在，但绝不单调，千变万化。要了解它，只需阅读一本奥义书或任何有关佛陀的论述就足够了。在那里听到的声音无处不在；它用一百万只眼睛说话，它用无数的手势来表达自己，没有一个村庄或乡村的道路上找不到那棵枝繁叶茂的树，在它的树荫下，小我为自己的废除而奋斗，将这个多元的世界淹没在宇宙存在的全部和全一体中。这个音符一直在我耳边回响，很快我就摆脱不了它的魔力了。当时我绝对确信，没有人可以超越这一点，尤其是印度圣人本人；如果什里拉马纳说出任何与这段旋律不符的话，或者声称知道任何超越这段旋律的东西，他的启发肯定是错误的。圣人唱印度古老的圣歌时是对的，但当他吹奏任何其他曲调时，他就错了。这不费吹灰之力的单调辩论，如此适合印度南部的炎热，让我毫不遗憾地克制住不去Tiruvannamalai参观。然而，深不可测的印度决定了我终究会遇到圣人，而且是以一种更适合我的方式，而不是我去找他：在特拉万科尔的首府特里万德勒姆，我遇到了一位马哈西的门徒。他是一个谦逊的小个子男人，有着我们可以形容为小学教师的社会地位，他最生动地让我想起了", "note_en": "Jung wrote this essay as the introduction to a \r book about Ramana Maharshi by Heinrich Zimmer. 1 \r Paragraph numbers are from Jung’s  Collected Works.\n      Heinrich Zimmer had been interested for years in the Maharshi of\rTiruvannamalai, and the first question he asked me on my return from India\rconcerned this latest holy and wise man from southern India. I do not know\rwhether my friend found it an unforgivable or an incomprehensible sin on\rmy part that I had not sought out Shri Ramana. I had the feeling that he\rwould certainly not have neglected to pay him a visit, so warm was his\rinterest in the life and thought of the holy man. This was scarcely\rsurprising, as I know how deeply Zimmer had penetrated into the spirit of\rIndia. His most ardent wish to see India in reality was unfortunately never\rfulfilled, and the one chance he had of doing so fell through in the last\rhours before the outbreak of the second World War. As if in compensation,\rhis vision of the spiritual India was all the more magnificent. In our work\rtogether he gave me invaluable insights into the Oriental psyche, not only\rthrough his immense technical knowledge, but above all through his\rbrilliant grasp of the meaning and content of Indian mythology. Unhappily,\rthe early death of those beloved of the gods was fulfilled in him, and it\rremains for us to mourn the loss of a spirit that overcame the limitations of\rthe specialist and, turning towards humanity, bestowed upon it the joyous\rgift of “immortal fruit.”\r\r \r\rThe carrier of mythological and philosophical wisdom in India has\rbeen since time immemorial the “holy man”—a Western title which does\rnot quite render the essence and outward appearance of the parallel figure\rin the East. This figure is the embodiment of the spiritual India, and we\rmeet him again and again in the literature. No wonder, then, that Zimmer\rwas passionately interested in the latest and best incarnation of this type in\rthe phenomenal personage of Shri Ramana. He saw in this yogi the true\ravatar of the figure of the rishi, seer and philosopher, which strides, as\rlegendary as it is historical, down the centuries and the ages.\r\r \r\rPerhaps I should have visited Shri Ramana. Yet I fear that if I\rjourneyed to India a second time to make up for my omission, it would fare\rwith me just the same: I simply could not, despite the uniqueness of the\roccasion, bring myself to visit this undoubtedly distinguished man\rpersonally. For the fact is, I doubt his uniqueness; he is of a type which\ralways was and will be. Therefore it was not necessary to seek him out. I\rsaw him all over India, in the pictures of Ramakrishna, in Ramakrishna’s\rdisciples, in Buddhist monks, in innumerable other figures of the daily\rIndian scene, and the words of his wisdom are the sous-entendu of India’s\rspiritual life. Shri Ramana is, in a sense, a hominum homo, a true “son of\rman” of the Indian earth. He is “genuine,” and on top of that he is a\r“phenomenon” which, seen through European eyes, has claims to\runiqueness. But in India he is merely the whitest spot on a white surface\r(whose whiteness is mentioned only because there are so many surfaces\rthat are just as black). Altogether, one sees so much in India that in the end\rone only wishes one could see less: the enormous variety of countries and\rhuman beings creates a longing for complete simplicity. This simplicity is\rthere too; it pervades the spiritual life of India like a pleasant fragrance or a\rmelody. It is everywhere the same, but never monotonous, endlessly varied.\rTo get to know it, it is sufficient to read an Upanishad or any discourse of\rthe Buddha. What is heard there is heard everywhere; it speaks out of a\rmillion eyes, it expresses itself in countless gestures, and there is no village\ror country road where that broad-branched tree cannot be found in whose\rshade the ego struggles for its own abolition, drowning the world of\rmultiplicity in the All and All-Oneness of Universal Being. This note rang\rso insistently in my ears that soon I was no longer able to shake off its\rspell. I was then absolutely certain that no one could ever get beyond this,\rleast of all the Indian holy man himself; and should Shri Ramana say\ranything that did not chime in with this melody, or claim to know anything\rthat transcended it, his illumination would assuredly be false. The holy man\ris right when he intones India’s ancient chants, but wrong when he pipes\rany other tune. This effortless drone of argumentation, so suited to the heat\rof southern India, made me refrain, without regret, from a visit to\rTiruvannamalai.\r\r \r\rNevertheless, the unfathomableness of India saw to it that I should\rencounter the holy man after all, and in a form that was more congenial to\rme, without my seeking him out: in Trivandrum, the capital of Travancore,\rI ran across a disciple of the Maharshi. He was an unassuming little man, of\ra social status which we would describe as that of a primary-school teacher,\rand he reminded me most vividly of the shoemaker of Alexandria who (in\rAnatole France’s story) was presented to St. Anthony by the angel as an\rexample of an even greater saint than he. Like the shoemaker, my little holy\rman had innumerable children to feed and was making special sacrifices in\rorder that his eldest son might be educated. (I will not enter here into the\rclosely allied question as to whether holy men are always wise, and\rconversely, whether all wise men are unconditionally holy. In this respect\rthere is room for doubt.) Be that as it may, in this modest, kindly, devout,\rand childlike spirit I encountered a man who had absorbed the wisdom of\rthe Maharshi with utter devotion, and at the same time had surpassed his\rmaster because, notwithstanding his cleverness and holiness, he had\r“eaten” the world. I acknowledge with deep gratitude this meeting with\rhim; nothing better could have happened to me. The man who is only wise\rand only holy interests me about as much as the skeleton of a rare saurian,\rwhich would not move me to tears. The insane contradiction, on the other\rhand, between existence beyond Māyā in the cosmic Self, and that amiable\rhuman weakness which fruitfully sinks many roots into the black earth,\rrepeating for all eternity the weaving and rending of the veil as the ageless\rmelody of India—this contradiction fascinates me; for how else can one\rperceive the light without the shadow, hear the silence without the noise,\rattain wisdom without foolishness? The experience of holiness may well be\rthe most painful of all. My man—thank God—was only a little holy man;\rno radiant peak above the dark abysses, no shattering sport of nature, but an\rexample of how wisdom, holiness, and humanity can dwell together in\rharmony, richly, pleasantly, sweetly, peacefully, and patiently, without\rlimiting one another, without being peculiar, causing no surprise, in no way\rsensational, necessitating no special post-office, yet embodying an age-old\rculture amid the gentle murmur of the coconut palms fanning themselves in\rthe light sea wind. He has found a meaning in the rushing phantasmagoria\rof Being, freedom in bondage, victory in defeat.\r\r \r\rUnadulterated wisdom and unadulterated holiness, I fear, are seen to\rbest advantage in literature, where their reputation remains undisputed.\rLao-tzu reads exquisitely, unsurpassably well, in the Tao Teh Ching; Laotzu with his dancing girl on the Western slope of the mountain, celebrating\rthe evening of life, is rather less edifying. But even less can one approve of\rthe neglected body of the “unadulterated” holy man, especially if one\rbelieves that beauty is one of the most excellent of God’s creations.\r\r \r\rShri Ramana’s thoughts are beautiful to read. What we find here is\rpurest India, the breath of eternity, scorning and scorned by the world. It is\rthe song of the ages, resounding, like the shrilling of crickets on a\rsummer’s night, from a million beings. This melody is built up on the one\rgreat theme, which, veiling its monotony under a thousand colourful\rreflections, tirelessly and everlastingly rejuvenates itself in the Indian spirit,\rwhose youngest incarnation is Shri Ramana himself. It is the drama of\rahamkāra, the “I-maker” or ego-consciousness, in opposition and\rindissoluble bondage to the atman, the self or non-ego. The Maharshi also\rcalls the atman the “ego-ego”—significantly enough, for the self is indeed\rexperienced as the subject of the subject, as the true source and controller\rof the ego, whose (mistaken) strivings are continually directed towards\rappropriating the very autonomy which is intimated to it by the self.\r\r \r\rThis conflict is not unknown to the Westerner: for him it is the\rrelationship of man to God. The modern Indian, as I can testify from my\rown experience, has largely adopted European habits of language, “self” or\r“atman” being essentially synonymous with “God.” But, in\rcontradistinction to the Western “man and God,” the Indian posits the\ropposition (or correspondence) between “ego and self.” “Ego,” as\rcontrasted with “man,” is a distinctly psychological concept, and so is\r“self”—to our way of thinking. We might therefore be inclined to assume\rthat in India the metaphysical problem “man and God” has been shifted on\rto the psychological plane. On closer inspection it is clear that this is not so,\rfor the Indian concept of “ego” and “self” is not really psychological but—\rone could well say—just as metaphysical as our “man and God.” The\rIndian lacks the epistemological standpoint just as much as our own\rreligious language does. He is still “pre-Kantian.” This complication is\runknown in India and it is still largely unknown with us. In India there is\rno psychology in our sense of the word. India is “pre-psychological”: when\rit speaks of the “self,” it posits such a thing as existing. Psychology does\rnot do this. It does not in any sense deny the existence of the dramatic\rconflict, but reserves the right to the poverty, or the riches, of not knowing\rabout the self. Though very well acquainted with the self’s peculiar and\rparadoxical phenomenology, we remain conscious of the fact that we are\rdiscerning, with the limited means at our disposal, something essentially\runknown and expressing it in terms of psychic structures which may not be\radequate to the nature of what is to be known.\r\r \r\rThis epistemological limitation keeps us at a remove from what we\rterm “self” or “God.” The equation self = God is shocking to the European.\rAs Shri Ramana’s statements and many others show, it is a specifically\rEastern insight, to which psychology has nothing further to say except that\rit is not within its competence to differentiate between the two. Psychology\rcan only establish that the empiricism of the “self” exhibits a religious\rsymptomatology, just as does that category of assertions associated with the\rterm “God.” Although the phenomenon of religious exaltation transcends\repistemological criticism—a feature it shares with all manifestations of\remotion—yet the human urge to knowledge asserts itself again and again\rwith “ungodly” or “Luciferian” obstinacy and wilfulness, indeed with\rnecessity, whether it be to the loss or gain of the thinking man. Sooner or\rlater he will place his reason in opposition to the emotion that grips him\rand seek to withdraw from its entangling grasp in order to give an account\rof what has happened. If he proceeds prudently and conscientiously, he will\rcontinually discover that at least a part of his experience is a humanly\rlimited interpretation, as was the case with Ignatius Loyola and his vision\rof the snake with multiple eyes, which he at first regarded as of divine, and\rlater as of diabolical, origin. (Compare the exhortation in I John 4:1: “Do\rnot believe every spirit, but test the spirits to see whether they are of God.”)\rTo the Indian it is clear that the self as the originating ground of the psyche\ris not different from God, and that, so far as a man is in the self, he is not\ronly contained in God but actually is God. Shri Ramana is quite explicit on\rthis point. No doubt this equation, too, is an “interpretation.” Equally, it is\ran interpretation to regard the self as the highest good or as the goal of all\rdesire and fulfilment, although the phenomenology of such an experience\rleaves no doubt that these characteristics exist a priori and are\rindispensable components of religious exaltation. But that will not prevent\rthe critical intellect from questioning the validity of these characteristics. It\ris difficult to see how this question could be answered, as the intellect lacks\rthe necessary criteria. Anything that might serve as a criterion is subject in\rturn to the critical question of validity. The only thing that can decide here\ris the preponderance of psychic facts.\r\r \r\rThe goal of Eastern religious practice is the same as that of Western\rmysticism: the shifting of the centre of gravity from the ego to the self,\rfrom man to God. This means that the ego disappears in the self, and man\rin God. It is evident that Shri Ramana has either really been more or less\rabsorbed by the self, or has at least struggled earnestly all his life to\rextinguish his ego in it. The Exercitia spiritualia reveal a similar striving:\rthey subordinate “self-possession” (possession of an ego) as much as\rpossible to possession by Christ. Shri Ramana’s elder contemporary,\rRamakrishna, had the same attitude concerning the relation to the self, only\rin his case the dilemma between ego and self seems to emerge more\rdistinctly. Whereas Shri Ramana displays a “sympathetic” tolerance\rtowards the worldly callings of his disciples, while yet exalting the\rextinction of the ego as the real goal of spiritual exertion, Ramakrishna\rshows a rather more hesitant attitude in this respect. He says: “So long as\rego-seeking exists, neither knowledge (jñāna) nor liberation (mukti) is\rpossible, and to births and deaths there is no end.” 2 All the same, he has to\radmit the fatal tenacity of ahamkāra (the “I-maker”): “Very few can get rid\rof the sense of ‘I’ through samādhi.… We may discriminate a thousand\rtimes, but the sense of ‘I’ is bound to return again and again. You may cut\rdown the branches of a fig-tree today, but tomorrow you will see that new\rtwigs are sprouting.” 3\rHe goes so far as to suggest the indestructibility of\rthe ego with the words: “If this sense of ‘I’ will not leave, then let it stay on\ras the servant of God.” 4\rCompared with this concession to the ego, Shri\rRamana is definitely the more radical or, in the sense of Indian tradition,\rthe more conservative. Though the elder, Ramakrishna is the more modern\rof the two, and this is probably to be attributed to the fact that he was\raffected by the Western attitude of mind far more profoundly than was Shri\rRamana.\r\r \r\rIf we conceive of the self as the essence of psychic wholeness, i.e., as\rthe totality of conscious and unconscious, we do so because it does in fact\rrepresent something like a goal of psychic development, and this\rirrespective of all conscious opinions and expectations. The self is the\rsubject-matter of a process that generally runs its course outside\rconsciousness and makes its presence felt only by a kind of long-range\reffect. A critical attitude towards this natural process allows us to raise\rquestions which are excluded at the outset by the formula self = God. This\rformula shows the dissolution of the ego in the atman to be the unequivocal\rgoal of religion and ethics, as exemplified in the life and thought of Shri\rRamana. The same is obviously true of Christian mysticism, which differs\rfrom Oriental philosophy only through having a different terminology. The\rinevitable consequence is the depreciation and abolition of the physical and\rpsychic man (i.e., of the living body and ahamkāra) in favour of the\rpneumatic man. Shri Ramana speaks of his body as “this clod.” As against\rthis, and taking into consideration the complex nature of human experience\r(emotion plus interpretation), the critical standpoint admits the importance\rof ego-consciousness, well knowing that without ahamkāra there would be\rabsolutely no one there to register what was happening. Without the\rMaharshi’s personal ego, which, as a matter of brute experience, only exists\rin conjunction with the said “clod” (= body), there would be no Shri\rRamana at all. Even if we agreed with him that it is no longer his ego, but\rthe atman speaking, it is still the psychic structure of consciousness in\rassociation with the body that makes speech communication possible.\rWithout this admittedly very troublesome physical and psychic man, the\rself would be entirely without substance, as Angelus Silesius has already\rsaid:\r\r I know that without me \rGod can no moment live; \rWere I to die, then he \rNo longer could survive.\n  \r\rThe intrinsically goal-like quality of the self and the urge to realize\rthis goal are, as we have said, not dependent on the participation of\rconsciousness. They cannot be denied any more than one can deny one’s\rego-consciousness. It, too, puts forward its claims peremptorily, and very\roften in overt or covert opposition to the needs of the evolving self. In\rreality, i.e., with few exceptions, the entelechy of the self consists in a\rsuccession of endless compromises, ego and self laboriously keeping the\rscales balanced if all is to go well. Too great a swing to one side or the\rother is often no more than an example of how not to set about it. This\rcertainly does not mean that extremes, when they occur in a natural way,\rare in themselves evil. We make the right use of them when we examine\rtheir meaning, and they give us ample opportunity to do this in a manner\rdeserving our gratitude. Exceptional human beings, carefully hedged about\rand secluded, are invariably a gift of nature, enriching and widening the\rscope of our consciousness—but only if our capacity for reflection does not\rsuffer shipwreck. Enthusiasm can be a veritable gift of the gods or a\rmonster from hell. With the hybris which attends it, corruption sets in, even\rif the resultant clouding of consciousness seems to put the attainment of the\rhighest goals almost within one’s grasp. The only true and lasting gain is\rheightened and broadened reflection.\r\r \r\rBanalities apart, there is unfortunately no philosophical or\rpsychological proposition that does not immediately have to be reversed.\rThus reflection as an end in itself is nothing but a limitation if it cannot\rstand firm in the turmoil of chaotic extremes, just as mere dynamism for its\rown sake leads to inanity. Everything requires for its existence its own\ropposite, or else it fades into nothingness. The ego needs the self and vice\rversa. The changing relations between these two entities constitute a field\rof experience which Eastern introspection has exploited to a degree almost\runattainable to Western man. The philosophy of the East, although so\rvastly different from ours, could be an inestimable treasure for us too; but,\rin order to possess it, we must first earn it. Shri Ramana’s words, which\rHeinrich Zimmer has bequeathed to us, in excellent translation, as the last\rgift of his pen, bring together once again the loftiest insights that the spirit\rof India has garnered in the course of the ages, and the individual life and\rwork of the Maharshi illustrate once again the passionate striving of the\rIndian for the liberating “Ground.” I say “once again,” because India is\rabout to take the fateful step of becoming a State and entering into a\rcommunity of nations whose guiding principles have anything and\reverything on the programme except detachment and peace of the soul.\r\r The Eastern peoples are threatened with a rapid collapse of their spiritual values, and what replaces them cannot always be counted among the best that Western civilization has produced. From this point of view, one could regard Ramakrishna and Shri Ramana as modern prophets, who play the same compensatory role in relation to their people as that of the Old Testament prophets in relati\n......", "posttime": "2020-06-14 14:34:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "印度,men", "title": "“印度的圣人”，卡尔·荣格著", "title_en": "The Holy Men of India by Carl Jung", "transed": 1, "url": "https://realization.org/p/misc/jung.holy-men-of-india.html", "via": "", "real_tags": ["印度", "men"]}, {"category": "", "categoryclass": "", "imagename": "b58dfb1ea072a6b54d0a0c22c9b04fd4.jpg", "infoid": 1006507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔安娜·霍夫曼(Joanna Hoffman)曾是已故苹果首席执行官史蒂夫·乔布斯(Steve Jobs)的亲密顾问，她批评Facebook的领导层对该社交媒体平台对社会产生的一些有害影响不负责任。\n在周二举行的2020年CogX大会上，霍夫曼是在回答一个问题，该问题涉及科技行业的领导力崇拜，以及人们如何将自我与工作脱钩。\n例如，当我看着脸书时，我一直在想，他们真的那么无知吗，或者这是出于某种…的动机。她在与苹果旗下分支科技公司General Magic的前同事举行的座谈会上说，这比表面上看起来更黑暗。\n虽然霍夫曼说她非常尊重Facebook所取得的成就，但她暗示，这家社交媒体巨头的某些方面正在破坏民主的结构，破坏人际关系的结构，并兜售一种名为愤怒的上瘾药物。\n你知道，它就像烟草一样，和阿片类药物没有什么不同，她补充道。我们知道愤怒会让人上瘾，我们知道如果我们让人们获得足够的P-D，我们就可以把他们吸引到我们的平台上，并获得参与。因此，我们每次都应该利用这一点吗？&#34；\nFacebook最近因决定不缓和或删除唐纳德·特朗普(Donald Trump)总统的一篇帖子而受到抨击，特朗普在帖子中表示，当抢劫开始时，枪击就开始了，这指的是乔治·弗洛伊德(George Floyd)的抗议活动。\n民权领袖表示，马克·扎克伯格(Mark Zuckerberg)上周与Facebook首席执行官兼首席运营官谢丽尔·桑德伯格(Sheryl Sandberg)进行了一次Zoom电话会议，之后马克·扎克伯格(Mark Zuckerberg)对保留特朗普帖子的行为做出了令人费解的解释，他们对此感到失望和震惊。\n扎克伯格和他的妻子普莉希拉·陈(Priscilla Chan)在推特上分享的一封信中表示，他们对特朗普总统的分裂和煽动性言论深感震惊和厌恶。他们的评论是为了回应由他们的“陈·扎克伯格倡议”(CZI)资助的科学家对Facebook对特朗普帖子的处理方式的批评。\n霍夫曼还说，领导力极其重要，个人对一家公司的影响是巨大的，如果没有一位领导者把所有的东西结合在一起，那么最终就不会有真正富有成效的成果。\n然而，她补充说，我们必须接受领导人是人，因此会有缺陷。\n她认为，今天存在的许多领导人在他们所取得的成就以及他们在非常年轻的时候所做的事情上都是天才，但她补充说，她发现他们对自己在这个世界上播下的种子非常无知。\n霍夫曼于1980年加入苹果，担任Macintosh项目(Mac电脑的第一代)团队的第五名成员，专注于产品营销。然后，她加入了史蒂夫·乔布斯自己的软件公司NeXT，该公司最终被苹果公司收购。\n在与乔布斯共事期间，霍夫曼成为为数不多的能够挑战这位苹果联合创始人的人之一。凯特·温斯莱特(Kate Winslet)在2015年的电影“史蒂夫·乔布斯”(Steve Jobs)中饰演霍夫曼，强化了她作为乔布斯得力助手的形象。\n霍夫曼后来成为General Magic的营销副总裁，于1995年离职。她现在西班牙人工智能机构Sherpa工作。", "note_en": "Joanna Hoffman, once a close advisor to the late Apple CEO Steve Jobs, has criticized leadership at Facebook for not being accountable for some of the harmful effects the social media platform has had on society.\n Hoffman was responding to a question, at the 2020 CogX conference on Tuesday, about the cult of leadership in the technology industry and how people can decouple ego from their work.\n  &#34;As I look at Facebook, for example, I keep thinking are they really that ignorant or is this motivated by something … darker than what appears?&#34; she said on a panel with former colleagues of Apple&#39;s offshoot technology company General Magic.\n While Hoffman said she had &#34;enormous respect&#34; for what Facebook had achieved she suggested certain aspects of the social media giant were &#34;destroying the very fabric of democracy, destroying the very fabric of human relationships and peddling in an addictive drug called anger.&#34;\n  &#34;You know it&#39;s just like tobacco, it&#39;s no different than the opioids,&#34; she added. &#34;We know anger is addictive, we know we can attract people to our platform and get engagement if we get them p----d off enough. So therefore what, we should capitalize on that each and every time?&#34;\n  Facebook has most recently come under fire for its  decision not to moderate or take down a post by President Donald Trump, in which he said &#34;when the looting starts, the shooting starts,&#34; in reference to the George Floyd protests.\n  Civil rights leaders said they were  &#34;disappointed and stunned&#34; by Mark Zuckerberg&#39;s &#34;incomprehensible explanations&#34; for keeping Trump&#39;s post up, after a Zoom call with the Facebook CEO and COO Sheryl Sandberg last week.\n Zuckerberg and his wife Priscilla Chan have since said they were &#34;deeply shaken and disgusted by President Trump&#39;s divisive and incendiary rhetoric,&#34; in a  letter shared on Twitter. Their comments were in response to criticism from scientists funded by their Chan Zuckerberg Initiative (CZI) over Facebook&#39;s handling of Trump&#39;s post.\n   Hoffman also said that &#34;leadership is extremely important,&#34; that &#34;individuals make a huge difference&#34; to a company and that without a &#34;leader to bring it all together, then nothing really productive results in the end.&#34;\n However, she added that we have to accept that leaders are human beings and are therefore going to be flawed.\n  She believed there were a lot of leaders who existed today who were &#34;genius in what they&#39;ve accomplished and what they have done at a very young age&#34; but added that she found they were &#34;remarkably ignorant on what they are sowing in the world.&#34;\n Hoffman joined Apple in 1980, as the fifth member of the team working on the Macintosh project — the first iteration of the Mac computer — and focused on product marketing. She then joined Steve Jobs at his own software business NeXT, which was eventually bought by Apple.\n During her time working with Jobs, Hoffman became known as one of the few people who could challenge the Apple co-founder. Kate Winslet&#39;s portrayal of Hoffman in the 2015 movie &#34;Steve Jobs&#34; reinforced this image of her as Jobs&#39; &#34;right-hand woman.&#34;\n Hoffman later became vice president of marketing at General Magic, leaving in 1995. She now works for Spanish artificial intelligence agency Sherpa.", "posttime": "2020-06-14 14:16:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,愤怒,hoffman,霍夫曼", "title": "乔安娜·霍夫曼(Joanna Hoffman)：Facebook正在兜售“一种名为愤怒的上瘾药物”", "title_en": "Joanna Hoffman: Facebook is peddling 'an addictive drug called anger'", "transed": 1, "url": "https://www.cnbc.com/2020/06/12/joanna-hoffman-facebook-is-peddling-an-addictive-drug-called-anger.html", "via": "", "real_tags": ["facebook", "愤怒", "hoffman", "霍夫曼"]}, {"category": "", "categoryclass": "", "imagename": "81bf5e040828749ba03f06d9e734c486.png", "infoid": 1006506, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "假设您有一个脚本(script.py)，您希望在每次该文件中的编解码器更改时运行该脚本。\n如果__name__==&#34；__main__&#34；：日志记录，则从Hotreload导入加载器导入时间导入日志记录。basicConfig(Level=日志记录。Info)script=Loader(&#34；script.py&#34；)而True：#检查自上次轮询以来脚本是否已修改。IF脚本。has_change()：#如果脚本已被修改，则执行脚本中的函数。剧本。main()时间。睡眠(1)", "note_en": "Say you have script ( script.py) that you want to run every time the codechanges in that file.\n  import  time import  logging from  hotreload  import  Loader if  __name__  ==  &#34;__main__&#34;:  logging. basicConfig( level = logging. INFO)  script  =  Loader( &#34;script.py&#34;)  while  True:  # Check if script has been modified since last poll.  if  script. has_changed():  # Execute a function from script if it has been modified.  script. main()  time. sleep( 1)", "posttime": "2020-06-14 13:59:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,app,python,swapping,脚本", "title": "热插拔Python 3代码", "title_en": "Hot-swapping Python 3 code", "transed": 1, "url": "https://github.com/say4n/hotreload", "via": "", "real_tags": ["代码", "app", "python", "swapping", "脚本"]}, {"category": "", "categoryclass": "", "imagename": "83f892be2c28e021b245ab71372fb0ce.jpeg", "infoid": 1006505, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1989年12月31日T20：00：27-05：00罗格斯大学英语教授威廉·卢茨(https://images.c-span.org/Files/4fe/19891231200933001_hd.jpg William Lutz)讨论了他的t书“双重演讲：使用语言欺骗你”(Double-Speech：The Use of Language to Decogge You)。根据美式英语的独特分析，双语的例子有用“人的动力”代替“体育”，用“路面缺陷”代替“坑坑洼洼”。口是心非是有意识地用来操纵的。卢茨指出，他的使命不是根除双重话语，而是将双重话语从最危险的重要问题的话语中消除。他说，政府中最普遍的是双重话语，紧随其后的是广告业。罗格斯大学(Rutgers University)英语教授威廉·卢茨(William Lutz)讨论了他的t书“双重演讲：使用语言欺骗你”。美国英语的独特分析，…的例子。阅读更多。\n报告视频问题。\n现任众议院议长托马斯·福利(Thomas Foley)在一次回顾…的采访中反思了1968年的事件", "note_en": "1989-12-31T20:00:27-05:00 https://images.c-span.org/Files/4fe/19891231200933001_hd.jpg William Lutz, professor of English at Rutgers University, discussed his t book  Double-Speak: The Use of Language to Deceive You. A unique analysis of American English, examples of double-speak are “human kinetics” in place of “physical education,” and “pavement deficiencies” instead of “potholes.” Double-speak is consciously used to manipulate. Lutz points out that his mission is not to eradicate double-speak, but to eliminate double-speak from the discourse of important issues where it is most dangerous. He states that double-speak is most prevalent in government, followed closely by the advertising industry. William Lutz, professor of English at  Rutgers University, discussed his t book  Double-Speak: The Use of Language to Deceive You. A unique analysis of American English, examples of…  read more\n Report Video Issue   \n   Current Speaker of the House Rep. Thomas Foley reflected on the events of 1968 in an interview during a retrospective…", "posttime": "2020-06-14 13:59:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语言,lutz,英语", "title": "威廉·卢茨(William Lutz)，讨论他的著作“双重语言：使用语言欺骗你”", "title_en": "William Lutz, Discuss His Book Double-Speak: The Use of Language to Deceive You", "transed": 1, "url": "https://www.c-span.org/video/?10449-1/doublespeak", "via": "", "real_tags": ["语言", "lutz", "英语"]}, {"category": "", "categoryclass": "", "imagename": "f61a6a9224da26f221ab58e09190fceb.jpg", "infoid": 1006502, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新闻：一款名为TextFooler的软件可以欺骗自然语言处理(NLP)系统，只需将句子中的某些单词替换为同义词就可以误解文本。在测试中，它能够大幅降低三个最先进的NLP系统的准确性。例如，在识别Yelp上的评论是正面的还是负面的方面，谷歌强大的Bert神经网络的表现差了5到7倍。\n他们在NLP系统上测试了这种攻击，这些系统经过训练，可以完成识别新闻主题、检测假新闻和分析情绪等任务。在所有情况下，人工智能都变得明显更糟。\n工作原理：该软件由麻省理工学院的一个团队开发，它在句子中寻找对NLP分类器最重要的单词，并用人类会觉得自然的同义词取代它们。例如，把“人物在不可能的人为情况下，完全与现实隔绝”改为“人物在不可能的工程环境中，完全与现实隔绝”，这对我们的理解没有什么实质上的区别。但这些调整让人工智能对句子的解释完全不同。\n重要原因：我们已经看到了许多这种对抗性攻击的例子，最常见的是图像识别系统，在图像识别系统中，输入的微小变化都会让人工智能感到困惑，并使其对所看到的内容进行错误分类。TextFooler显示，这种攻击风格也破坏了NLP，虚拟助手背后的人工智能-如Siri，Alexa和Google Home-以及其他语言分类器，如垃圾邮件过滤器和仇恨言论检测器。研究人员说，像TextFooler这样的工具可以通过暴露它们的弱点，帮助NLP系统变得更健壮。", "note_en": "The news: Software called TextFooler can trick  natural-language processing (NLP) systems into misunderstanding text just by replacing certain words in a sentence with synonyms. In tests, it was able to drop the accuracy of three state-of-the-art NLP systems dramatically. For example, Google’s powerful BERT neural net was worse by a factor of five to seven at identifying whether reviews on Yelp were positive or negative.\n They tested the attack on NLP systems trained to do tasks such as identify news topics, detect fake news, and analyze sentiment. In all cases, the AI  became significantly worse.\n How it works: The software, developed by a team at MIT, looks for the words in a sentence that are most important to an NLP classifier and replaces them with a synonym that a human would find natural. For example, changing the sentence “The characters, cast in impossibly contrived situations, are totally estranged from reality” to “The characters, cast in impossibly engineered circumstances, are fully estranged from reality” makes no real difference to how we read it. But the tweaks made an AI interpret the sentences completely differently.\n Why it matters: We have seen many examples of such  adversarial attacks, most often with image recognition systems, where tiny alterations to the input can flummox an AI and make it misclassify what it sees. TextFooler shows that this style of attack also breaks NLP, the AI behind virtual assistants—such as Siri, Alexa and Google Home—as well as other language classifiers like spam filters and hate-speech detectors. The researchers say that tools like TextFooler can help make NLP systems more robust, by revealing their weaknesses.", "posttime": "2020-06-14 13:57:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,软件,alexa,swaps,nlp", "title": "交换文字的软件现在可以愚弄Alexa和Siri背后的人工智能", "title_en": "Software that swaps out words can now fool the AI behind Alexa and Siri", "transed": 1, "url": "https://www.technologyreview.com/2020/02/07/349027/software-that-swaps-out-words-can-now-fool-the-ai-behind-alexa-and-siri/", "via": "", "real_tags": ["人工智能", "软件", "alexa", "swaps", "nlp"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006501, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我偶然发现了一个独特的漏洞(或者从运营商的角度来看)，它与短信中似乎被列入黑名单的关键字有关：根据我有限的测试，来自T-Mobile网络上一些设备的出站短信如果在内容中的任何地方包含验证码，都会被静默屏蔽，但只有当它们被发送到运营商和设备的特定组合时才会被屏蔽。我在这里发帖，是想看看对移动网络和平台有更多了解的用户是否能提供一些洞察力，或者插话说这是否是已知/预期的行为。我为后面的长篇大论道歉(你可以看看表格和tl；dr以了解问题的主旨)，但我的目标是尽可能地描述性地帮助其他人重现这个问题。\n简要背景：我是朋友和家人的常驻技术人员，我经常帮助解决各种在线服务的问题。这样做时，我偶尔需要直接从我的电脑登录到他们的帐户，对于那些拥有通过SMS发送的基于OTP的2FA的帐户，我只需要让他们将他们收到的包含验证码的短信转发到我的手机上，这样我就可以完成身份验证过程。在过去的一周里，我遇到了两个不同的例子，我在帮助某人使用SMS 2FA保护帐户时，在沟通必要的代码时遇到了很大的困难，以至于它激起了我的兴趣，并开始了我的故障排除之路。\n在第一个例子中，一位朋友说他们已经将服务上的代码信息转发给了我，但我这一端什么也没有出现。我让服务商给他们发送了一个新的动态口令代码，他们再次说他们已经把它转发给我了，但是我仍然没有看到我那端的任何东西。我们尝试了系统重新发送和转发的相同循环，结果相同。在这一点上，我把它归结为一些一般性的短信问题，让他们直接打电话给我，让他们给我代码，这样我就可以完成登录过程，然后继续前进。唯一让我感到奇怪的是，他们关于给我发送密码的短信发送得很好，尽管带有密码的短信显然没有到达。他们给我发了一张他们那一边的对话截图，确实显示了他们那一端成功地发出了信息，但我仍然将其归因于某种暂时的故障，当时没有进一步考虑这一点。\n然而，昨天我发生了同样的事情：当我给一位家庭成员发了一条短信，让他们把验证码交给我时，他们根本没有回复，当我问他们这件事时，他们说他们从来没有收到过我的短信。回忆起本周早些时候发生的事情，我回顾了短信的截图，并思考了两次对话之间有哪些共同之处。这位朋友试图转发的消息和我发送的请求代码的消息都相对较短，而且据我所知没有任何独特的字符，所以我无法想象这是短信长度上限触发彩信转换的问题，或者是我历史上见过的任何驱动器传输问题。我能在这些消息中识别出的唯一一致因素是，它们都包含确切的短语验证码。\n我认为特定的词语不太可能对文本传递产生影响，但由于我没有其他假设，我认为至少值得进行一次快速测试。我给同一个家庭成员发了一条信息，简单地说这是验证码测试。让他们告诉我它是否到了。他们收到了我的短信，要求他们回复，但包含验证码的原始消息从未到达。在等待了几分钟以确保不只是延迟之后，我试着发送了一条带有短语Test message.的普通短信，它立即就到了。我又试了两次原来的短语，两次都没能到达相反的地方。然后我让对方试着把原始短语发回给我，消息马上就到了，所以这个问题看起来不是双向的。回顾本周早些时候的对话截图，我看到我给朋友的包含验证码的消息成功到达，所以在那个例子中，问题同样是单向的，尽管是在对话的另一端。\n在建立了基本行为之后，我的下一个本能是测试排列，看看是否可以确定阻塞的范围/形状。我发了一系列类似的信息，结果如下：\n成功和失败的模式让我相信，无论是什么导致了这个问题，都是在执行\n因为我的手机是T-Mobile网络上的Pixel3aXL，而我在这些测试中与之沟通的家庭成员使用的是Verizon上的iPhone，所以我下一步要尝试确定这个问题是否与特定的设备、平台/操作系统、运营商或上述因素的组合有关。我联系了几个我认识的人，他们不介意在周五晚上抽出时间来解决一个奇怪的移动网络故障，并要求他们执行一项基本测试，试图发送短语这是一个验证码测试。这是双向的。我很快排除了具体的设备型号是一个因素，这就根据运营商/操作系统的组合留下了以下几点：\n&#34；S&#34；表示短语&#34；已成功传输。这是通过文本消息进行的验证码测试。&#34；S&#34；表示短语&#34；这是通过文本消息进行的验证码测试。\n&#34；x&34；表示无法到达收件人端的邮件，即使它在发件人端显示成功。\n表的大部分显然是不完整的，但当我收集进一步的结果或从这里的其他用户接收数据时，我将尝试回填它。基于我能在短时间内汇编的有限数据集，我的第一个解释是它是T-Mobile和Verizon网络之间的障碍，因为故障似乎只发生在T-Mobile到Verizon的方向，与设备平台/操作系统无关。然而，当我发现T-Mobile iPhone无法发送到T-Mobile Android系统时，我的网络假说就大打折扣。在配对中只有一个样本(尽管是可重复的)就能做出最终判断，这让我感到不舒服，所以我希望至少再有一个人拥有T-Mobile iPhone，可以验证T-Mobile Android的单向传输失败。编辑：另一个用户已经成功地从T-Mobile iPhone到T-Mobile Android进行了同样的测试，所以我倾向于认为配对失败是偶然的，这将把焦点重新放回从T-Mobile到Verizon的定向通信上。\n我对此行为唯一能冒险的猜测是，这是欺诈保护机制(试图保护用户免受短信诈骗)的结果，该机制正受到过于狂热的规则集的影响，但我很难理解为什么它只会影响某些设备和网络的组合(如果是这样的话)。\n如果有人的朋友/家人/同事使用的设备组合我无法获取数据(或者我缺少多个样本)，而您不介意在一天中抽出几分钟来运行一些快速测试，请在评论中发布您的结果，我会尽量保持表格的更新。\nTL；DR：似乎包含短语验证码的SMS消息(以及任何带有非字母数字分隔符的排列)在从T-Mobile传输到某些网络和设备组合时被静默阻止(所有Verizon无法接收是最明显的例子)。我希望从任何可以提供数据的人那里收集更多的数据，或者从专家那里获得关于这是否是已知的、预期的行为的反馈。\n编辑：根据进一步的测试(来自u/DJB719的报告)，从T-Mobile iPhone到T-Mobile Android的故障样本似乎只是一个侥幸，这意味着唯一可以重现的错误是从T-Mobile到Verizon。这表明这个问题可能是Verizon终端从T-Mobile网络执行入站消息过滤时出现的错误。如果进一步的结果指向这个方向，可能也值得让Verizon的一名订户打电话给他们的技术支持人员。", "note_en": "I&#39;ve stumbled upon a unique bug (or perhaps feature, from the carriers&#39; perspective) relating to what appears to be keyword blacklisting in SMS messages: From what I can tell in my limited testing, outbound text messages from some devices on the T-Mobile network are being silently blocked if they contain the phrase &#34;verification code&#34; anywhere in their content, but  only when they are sent to certain combinations of carriers and devices. I&#39;m posting here to see if users with more knowledge surrounding mobile networks and platforms can provide any insight, or chime in to say if this is known/expected behavior. I apologize for the wall of text that follows (you can just look at the tables and tl;dr for the gist of the matter), but I&#39;m aiming to be as descriptive as possible to help others reproduce the issue.\n Brief background: I&#39;m the resident techie for friends and family, and I frequently help troubleshoot issues with various online services. When doing so, I&#39;ll occasionally need to log into their accounts directly from my computer, and for the accounts that have an OTP-based 2FA that&#39;s sent out via SMS, I just ask them to forward the text message they receive containing the verification code to my phone so I can complete the authentication process. This past week, I ran into two separate instances where I was helping someone with an account secured with SMS 2FA and there was significant difficulty communicating the requisite code, to the point that it piqued my interest and started me down the path of troubleshooting.\n In the first instance, a friend said they had forwarded me the code message from the service, but nothing appeared on my end. I had the service send a new OTP code to them, and they once again said they had forwarded it to me , but I still didn&#39;t see anything on my end. We tried the same loop of the system re-sending and them forwarding once more, with the same result. At this point, I chalked it up to some generic SMS issues and had them just call me with the code so I could complete the login process and move forward. The only thing that struck me as odd was that their text messages about  sending me the codes were coming through just fine, even though the messages with the codes were apparently failing to arrive. They sent me a screenshot of their side of the conversation, and it did indeed show the messages successfully going out on their end, but I still chalked it up to some sort of temporary glitch and didn&#39;t devote further thought to it at the time.\n Yesterday, however, I had an inversion of the same behavior occur: When I sent an SMS to a family member asking them to pass on their verification code to me, they didn&#39;t respond at all, and when I asked them about it, they said they never received my text. Recalling what had happened earlier in the week, I looked back at the screenshots of the texts and considered what commonalities there were between the two conversations. The messages that the friend had attempted to forward and those I sent requesting the code were all relatively short and did not contain any unique characters so far as I could tell, so I couldn&#39;t imagine it being an issue with SMS length cap triggering MMS conversion or anything else that I had historically seen drive transmission issues. The sole consistent factor I could identify among the messages was that they all contained the exact phrase &#34;verification code&#34; somewhere within them.\n I didn&#39;t think it was likely that specific words would have an impact on text delivery, but since I had no other hypotheses, I decided it was worth at least performing a quick test. I sent the same family member a message with the simple phrase  This is a verification code test. and asked them to tell me if it arrived. They received my text asking them to respond, but the original message containing the words &#34;verification code&#34; never arrived. After waiting a couple of minutes to ensure it wasn&#39;t just a delay, I tried sending a generic text with the phrase  Test message., which arrived immediately. I tried the original phrase twice more, with it failing to arrive on the opposite end both times. I then had the other party try sending the original phrase back to me, and the message arrived immediately, so the issue didn&#39;t appear to be bi-directional. Looking back at the screenshots of the conversation from earlier in the week, I saw that my message to the friend containing the words &#34;verification code&#34; arrived successfully, so the issue similarly appears unidirectional in that instance, although on the other end of the conversation.\n Having established the basic behavior, my next instinct was to test permutations to see if I could determine the scope/shape of the blockage. I sent a series of similar messages, with the following results:\n    The pattern of successes and failures leads me to believe that whatever is causing the issue is performing a regex match along the lines of:  /v[^a-z\\d]*e[^a-z\\d]*r[^a-z\\d]*i[^a-z\\d]*f[^a-z\\d]*i[^a-z\\d]*c[^a-z\\d]*a[^a-z\\d]*t[^a-z\\d]*i[^a-z\\d]*o[^a-z\\d]*n[^a-z\\d]*[^a-z\\d]*c[^a-z\\d]*o[^a-z\\d]*d[^a-z\\d]*e/gi\n Essentially, it&#39;s blocking the specific phrase &#34;verification code&#34; with any permutation of non-alphanumeric characters intermingled.\n  Since my phone is a Pixel 3a XL on the T-Mobile network, and the family member I was communicating with for these tests has an iPhone on Verizon, my next steps were to attempt to determine whether the issue was correlated with a specific device, platform/OS, carrier, or combination of the above. I contacted the few people I knew who wouldn&#39;t mind taking time out of a Friday evening to troubleshoot an odd mobile network glitch and asked them to perform a basic test, attempting to send the phrase &#34;This is a verification code test.&#34; in both directions. I quickly ruled out the specific device model being a factor, which left the following based on carrier/OS combinations:\n    &#34;S&#34; represents a successful transmission of the phrase &#34;This is a verification code test.&#34; via text message.\n &#34;x&#34; represents the message failing to arrive on the recipient&#39;s end, even if it shows success on sender&#39;s end.\n  Most of the table is obviously incomplete, but I will try to back-fill it as I gather further results or receive data from other users here. Based on the limited data set I was able to compile on short notice, my first interpretation was that it was a block between the T-Mobile and Verizon networks, because the failures appeared to occur only in the direction of T-Mobile to Verizon, agnostic of the device platform/OS. However, when I hit the outlier of a T-Mobile iPhone failing to send to T-Mobile Android, that threw a wrench in my network hypothesis. I&#39;m not comfortable making a final judgment with only a single sample (albeit repeatable) in that pairing, so I&#39;d like to get at least one other person with a T-Mobile iPhone that can verify the unidirectional failure of transmission to T-Mobile Android.  EDIT: Another user has run the same tests of T-Mobile iPhone to T-Mobile Android successfully, so I&#39;m inclined to discount the pairing that&#39;s failing as a fluke, which would turn the focus back solely to the directional communications from T-Mobile to Verizon.\n The only guess I&#39;m able to venture about this behavior is that it&#39;s the result of a fraud protection mechanism (attempting to protect users from SMS scams) that is suffering from an over-zealous ruleset, but I&#39;m stumped as to why it would only affect certain combinations of devices and networks if that is the case.\n If anyone has friends/family/colleagues with combinations of devices for which I haven&#39;t been able to procure data (or for which I lack multiple samples), and you don&#39;t mind taking a couple minutes out of your day to run a some quick tests, please post your results in the comments and I&#39;ll try to keep the table updated.\n  tl;dr: It appears that SMS messages containing the phrase &#34;verification code&#34; (and any permutations with non-alphanumeric separators) are being silently blocked when transmitting from T-Mobile to certain combinations of networks and devices (with all of Verizon failing to receive being the most conspicuous example). I&#39;m looking to gather more data from anyone who can provide it, or to get feedback from an expert on whether this is known, expected behavior.\n  EDIT: With further testing (report from  u/DJB719), it appears that the one sample of failure from T-Mobile iPhone to T-Mobile Android may be a fluke, meaning the only reproducible errors are from T-Mobile to Verizon. That suggests that this issue could be an error on Verizon&#39;s end performing inbound message filtering from the T-Mobile network. If further results point in that direction, it may be worth having one of the Verizon subscribers call to speak with their tech support, as well.", "posttime": "2020-06-14 13:07:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "屏蔽,blocking,mobile", "title": "T-Mobile屏蔽包含短语“验证码”的出站短信", "title_en": "T-Mobile blocking outbound SMS containing the phrase “verification code”", "transed": 1, "url": "https://www.reddit.com/r/tmobile/comments/h8cotr/tmobile_silently_blocking_outbound_sms_messages/", "via": "", "real_tags": ["屏蔽", "blocking", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "5e274873563d8a1f5237d50dfce71f83.jpg", "infoid": 1006500, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是牦牛集体在接下来的几个月里进行的一系列研究中的第二个。如果您对此报告感兴趣，请务必先查看我们的“不要浪费重启”。我们的目标是产生一个新冠肺炎重启智能的身体，它从根本上不同于你在其他任何地方看到的任何东西，不仅在内容上，而且在到达它的过程中也是如此。\n就像你在这副牌上看到的 的碎片一样？欢迎直接联系一个或多个个人投稿人！牦牛集体既不是中介机构，也不是中介机构。我们的成员合作是因为他们想合作，我们每个人都保持着自己的独立咨询业务。我们为您提供一个可供选择的想法和人员目录，而不是捆绑在一起。\n喜欢你看到的很多东西吗？联系帕梅拉·霍巴特(Pamela Hobart)，让Yak Collective参与您的重启工作。我们将组建合适的小团队和一系列想法，以最有效的方式与您合作。这可能是一项研究或报告。它可能是为您的管理团队举办研讨会或一系列对话提供便利。或者，这可能只是与我们中的一个或多个人正在进行的对话。\n想在我们解决这些问题时和我们一起现场直播吗？加入我们的不和谐服务器。我们的工作流程确实是公开的。欢迎来自世界各地的任何有想法的独立顾问加入我们的努力，为合作项目做出贡献并领导合作项目。我们也欢迎任何潜在客户来这里闲逛。", "note_en": "This deck is the  second in a series of studies the Yak Collective is undertaking over the coming months. If you find this report interesting, be sure to check out our first,   Don’t Waste the Reboot. We aim to generate a body of Covid-19 reboot intelligence that is fundamentally different from anything you might see anywhere else, not just in terms of content, but in terms of the process of getting to it.\n   Like bits and pieces of what you saw in this deck? Feel free to contact one or more individual contributors directly! The Yak Collective is not an agency or intermediary. Our members collaborate because they want to, and each of us maintains their own independent consulting practice. We offer you a catalog of ideas and people to choose from, not a bundle.\n Like a lot of what you see? Contact  Pamela Hobart to loop The Yak Collective into your reboot efforts. We will assemble the right small team and set of ideas to work with you, in whatever way is most effective. It might be a study or report. It might be facilitating a workshop or series of conversations for your executive team. Or it might just be an ongoing conversation with one or more of us.\n Want to hang out with us  live as we work on these problems?  Join our Discord server. Our working process is literally open. Any independent consultant from anywhere in the world who has ideas is welcome to join our efforts, contribute to and lead collaborative projects. Any prospective client is welcome to hang out as well.", "posttime": "2020-06-14 12:50:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新旧,home,重启", "title": "新旧家", "title_en": "The New Old Home", "transed": 1, "url": "https://www.yakcollective.org/projects/the-new-old-home", "via": "", "real_tags": ["新旧", "home", "重启"]}, {"category": "", "categoryclass": "", "imagename": "93a803539cd4d160b9611f6c71835a6a.jpg", "infoid": 1006499, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山--就在Facebook本月努力应对内部反抗和因拒绝对特朗普总统的煽动性帖子采取行动而引发的一系列批评之际，这家社交网络正在积极地在幕后进行其他押注。\n周二晚些时候，当人们的注意力集中在Facebook可能如何应对特朗普时，这家硅谷公司在一篇简短的博客文章中表示，它已经投资了东南亚的“超级应用程序”Gojek。这笔交易让Facebook在这个快速增长的地区获得了更大的立足点，此前该公司最近向印度电信巨头信实工业(Reliance Jio)注入了57亿美元的投资。\n这些举措是这家社交网络疯狂支出的一部分，该公司上个月还斥资4亿美元收购了一家动画GIF公司，并正在花费数百万美元修建一条近2.3万英里长的环绕非洲的海底光缆。周四，Facebook证实，它还在开发一只风险投资基金，投资于有前途的初创企业。\n其他科技巨头也在采取类似的行为。苹果今年至少收购了四家公司，并发布了新款iPhone。微软已经收购了三项云计算业务。亚马逊正在就收购一家自动驾驶汽车初创企业进行谈判，已经租赁了更多飞机交付，自3月份以来已经额外雇佣了17.5万人。谷歌推出了新的信息和视频功能。\n尽管全球经济在大流行引发的经济衰退中摇摇欲坠，数十家企业申请破产，但科技行业最大的公司--仍然利润丰厚，从企业多年的主导地位中获得了数十亿美元--正在刻意为它们将比以往任何时候都更大、更强大的未来奠定基础。\n亚马逊(Amazon)、苹果(Apple)、Facebook、谷歌(Google)和微软(Microsoft)正大举押注，因为冠状病毒大流行已使它们成为近乎必要的服务，人们转向它们在网上购物，娱乐自己，并与亲人保持联系。随着其他行业的紧缩，飙升的使用量给了这些公司新的投资动力。\n这种扩张正在展开之际，华盛顿和欧洲的立法者和监管机构正在就科技巨头的权力集中以及这可能如何伤害竞争对手并导致传播虚假信息等其他问题敲响警钟。本周，欧盟官员正在准备对亚马逊提出反垄断指控，因为亚马逊利用其电商主导地位排挤了规模较小的竞争对手，而英国则开始对Facebook收购这家GIF公司进行调查。\n一些科技巨头毫不掩饰他们在经济衰退中奋进的意图，这场衰退已导致超过4400万美国人失业，官员们警告称，这场衰退将持续很长时间。\nFacebook首席执行官马克·扎克伯格(Mark Zuckerberg)上个月在一次投资者电话会议上表示：“我一直认为，在经济低迷时期，正确的做法是继续投资建设未来。”“当世界瞬息万变时，人们就有了新的需求，这意味着有更多的新事物需要建设。”\n在经济不景气的情况下，最大的科技公司在加倍增长的同时，也在延续一种模式。在之前的衰退中，那些在经济最脆弱的时候投资的人往往会变得更强大。在20世纪90年代，IBM利用经济衰退将自己从一家硬件公司重新定位为一家软件和服务公司。大约20年前，谷歌和Facebook都从互联网泡沫破灭中崛起。", "note_en": "SAN FRANCISCO — Even as Facebook grappled this month with  an internal revolt and  a cascade of criticism over its refusal to take action on President Trump’s inflammatory posts, the social network was actively making other bets behind the scenes.\n Late one Tuesday, as attention was focused on how Facebook might handle Mr. Trump, the Silicon Valley company said in  a brief blog post that it had invested in Gojek, a “super app” in Southeast Asia. The deal, which gave Facebook a bigger foothold in the rapidly growing region, followed  a $5.7 billion investment it recently pumped into Reliance Jio, a telecom giant in India.\n The moves were part of a spending spree by the social network, which also shelled out $400 million last month to buy an animated GIF company and which is spending millions of dollars to build a nearly 23,000-mile undersea  fiber-optic cable encircling Africa. On Thursday, Facebook  confirmed that it was also developing a venture capital fund to invest in promising start-ups.\n Other technology giants are engaging in similar behavior. Apple has bought at least four companies this year and released a new iPhone. Microsoft has purchased three cloud computing businesses. Amazon is in talks to acquire an autonomous vehicle start-up, has leased more airplanes for delivery and has hired an additional 175,000 people since March. Google has  unveiled new messaging and video features.\n Even with the global economy  reeling from a pandemic-induced recession and dozens of businesses filing for bankruptcy, tech’s largest companies — still wildly profitable and flush with billions of dollars from years of corporate dominance — are deliberately laying the groundwork for a future where they will be bigger and more powerful than ever.\n Amazon, Apple, Facebook, Google and Microsoft are aggressively placing new bets as the coronavirus pandemic has made them  near-essential services, with people turning to them to shop online, entertain themselves and stay in touch with loved ones. The skyrocketing use has given the companies new fuel to invest as other industries retrench.\n The expansion is unfolding as lawmakers and regulators in Washington and Europe are sounding the alarm over the tech giants’ concentration of power and how that may have hurt competitors and led to other issues, such as spreading disinformation. This week, European Union officials were preparing  antitrust charges against Amazon for using its e-commerce dominance to box out smaller rivals, while  Britain began an inquiry into Facebook’s purchase of the GIF company.\n Some of the tech behemoths have made little secret of their intention to forge ahead in a recession that has put  more than 44 million Americans out of work and that officials warn  will be protracted.\n  “I’ve always believed that in times of economic downturn, the right thing to do is keep investing in building the future,” Mark Zuckerberg, Facebook’s chief executive, said in an investor call last month. “When the world changes quickly, people have new needs, and that means there are more new things to build.”\n In doubling down on growth in a time of economic pain, the largest tech companies are continuing a pattern. In previous recessions, those that invested while the economy was at its most vulnerable often emerged stronger. In the 1990s, IBM used a recession to reorient itself from a hardware company into a software and services company. Google and Facebook both rose out of the dot-com bust about 20 years ago.", "posttime": "2020-06-14 12:49:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "giants,facebook", "title": "经济正在摇摇欲坠。科技巨头的间谍机会", "title_en": "The Economy Is Reeling. The Tech Giants Spy Opportunity", "transed": 1, "url": "https://www.nytimes.com/2020/06/13/technology/facebook-amazon-apple-google-microsoft-tech-pandemic-opportunity.html", "via": "", "real_tags": ["giants", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "4783215a8954d55d370b2c231d44269f.png", "infoid": 1006498, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "mental s是一个基于Devuan ASCII的无系统的GNU/Linux操作系统，但它是为所有年龄段的逆转录病毒患者量身定做的。它配有软件和脚本，可提供更轻松、开箱即用的用户体验。\n-自定义的.bashrc，用于在高潮不够时在命令行中快速执行操作。\n单击以在DISTROWATCH上为精神病投票如果您看到此消息，则表明您的Web浏览器不支持视频标签。.-.|_|\\_||__/\\/__|_)/__|/__|&#39；_\\|\\__\\|__/\\__\\||(__|__)|__/\\__，|\\__|_||_|\\__/|_/|__/3.4.6 by TheOuterLinux|`-&#39；通常情况下，视频应该在这里，但看起来您可能正在使用较旧的Web浏览器或基于文本的浏览器，这是可以的。如果您想观看视频并将其安装在GNU/LINUX操作系统上，您可以通过运行：mpv--vo=x11，drm，tct，caca--ao=PULSE，alsa，jack https://psychoslinux.gitlab.io/Video.mp4查看视频，或者单击URL下载并播放您所拥有的任何内容。最糟糕的情况是，您可以阅读文档部分中的一些文件，或者单击此处找到一些ASCII渲染。\n目前，我的主要关注点是32位计算机上GNU/Linux的精神病，因为似乎越来越少的人关心这件事；然而，我不会等到20年后下一波逆流浪潮到来时才做出一些酷的东西。所以，我的计划是尽可能长时间地保持基于32位GNU/Linux的操作系统。\n然而，我认为使用FreeDOS或KolibriOS等其他操作系统制作精神病口味是很不错的。我也想拿一些定制的软件，让他们的版本为20年以上的系统，如那些由橡子，Atari，Amiga，准将，等等，尽管他们将非常有限的相比，他们的GNU/Linux的对应物。在我学习这类项目时，这或多或少会是一种分享。[更多]", "note_en": "PsychOS is a  systemd-free,  GNU/Linux operating system based on  Devuan ASCII but tailored towards  retrophiles of all ages. It is packed with software and scripts for an easier, out-of-the-box user experience.\n    -  Customized .bashrc for quickly doing things in the command-line for when  CLIMax isn&#39;t enough\n  CLICK TO VOTE FOR PSYCHOS ON DISTROWATCH      If you are seeing this, your web browser does not support the video tag. .------------------------------------------------. | | | ____ _ ___ ____ | | | _ \\ ___ _ _ ___| |__ / _ \\/ ___| | | | |_) / __| | | |/ __| &#39;_ \\| | | \\___ \\ | | | __/\\__ \\ |_| | (__| | | | |_| |___) | | | |_| |___/\\__, |\\___|_| |_|\\___/|____/ | | |___/ 3.4.6 by TheOuterLinux | `------------------------------------------------&#39; Normally, a video is supposed to be here, but it seems as though you may be either be using an older web browser or a text-based one, which is fine. If you would like to view the video and have &#39;mpv&#39; installed on a GNU/Linux operating system, you can view it by running: mpv --vo=x11,drm,tct,caca --ao=pulse,alsa,jack  https://psychoslinux.gitlab.io/Video.mp4 Or click the URL to download and play with whatever you do have. Worst case scenario, you can read some files in the Documentation section or perhaps find some ASCII renderings by clicking here.\n  Currently, my main focus is PsychOS for\t\t\t\t\tGNU/Linux on 32-bit computers as it seems that fewer and fewer\t\t\t\t\tpeople seem to care; however, I&#39;m not waiting until 20 years from\t\t\t\t\tnow when the next wave of &#34;retrophilia&#34; comes about to make\t\t\t\t\tsomething &#34;cool.&#34; So, the plan is to try to maintain a 32-bit\t\t\t\t\tGNU/Linux-based operating system for as long as I can.\n  However, I think it would be neat to\t\t\t\t\tmake flavors of PsychOS using other operating systems such as\t\t\t\t\t FreeDOS or  KolibriOS. I would also like to take some of the\t\t\t\t\tcustom-made software and have versions of them made for 20+ year\t\t\t\t\told systems such as those made by  Acorn,  Atari,  Amiga,  Commodore,\t\t\t\t\tand so forth, though of course they would be very limited by\t\t\t\t\tcomparison to their GNU/Linux counter-parts. It would be more or\t\t\t\t\tless of a &#34;share while I learn&#34; sort of project.  [More]", "posttime": "2020-06-14 12:32:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "患者,psychos,视频", "title": "精神病患者 / 变态人格者 / 心理分析", "title_en": "PsychOS", "transed": 1, "url": "https://psychoslinux.gitlab.io/", "via": "", "real_tags": ["患者", "psychos", "视频"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006497, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自1988年以来，“数据库系统读物”(通常被称为“红皮书”)为读者提供了对数据管理领域经典和前沿研究的见解。在这里，我们介绍红皮书的第五版-这是十多年来的第一版。", "note_en": "Readings in Database Systems (commonly known as the &#34;Red Book&#34;) has offered readers an opinionated take on both classic and cutting-edge research in the field of data management since 1988. Here, we present the Fifth Edition of the Red Book — the first in over ten years.", "posttime": "2020-06-14 12:15:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,数据库系统,红皮书", "title": "数据库系统读物，第5版", "title_en": "Readings in Database Systems, 5th Edition", "transed": 1, "url": "http://www.redbook.io/", "via": "", "real_tags": ["数据库", "database", "数据库系统", "红皮书"]}]