[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1030716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们不再提供Creative Suite应用程序的安装程序。要获取您熟悉的已在当前操作系统中测试过的应用程序的最新版本，请升级到Creative Cloud。\nCreative Suite 4、5和6：如果您从Adobe购买了Creative Suite应用程序，并且您的帐户仍处于活动状态，则您可能无法从您的帐户下载该应用程序。\nCreative Suite 2和3：即使您拥有原始安装盘，也无法再重新安装Creative Suite 2或3。这些应用程序的老化激活服务器必须退役。", "note_en": "We no longer provide installers for Creative Suite apps. To get the latest versions of your familiar apps that have been tested in current operating systems, upgrade to Creative Cloud.\n  Creative Suite 4, 5, and 6: If you purchased your Creative Suite app from Adobe and your account is still active, you may be able to  download it from your account.\n Creative Suite 2 and 3: You can no longer reinstall Creative Suite 2 or 3 even if you have the original installation disks. The aging activation servers for those apps had to be retired.", "posttime": "2020-10-23 12:07:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "adobe,reinstall,creative", "title": "即使使用原始安装盘，您也不能再重新安装Adobe CS 2或3", "title_en": "You can no longer reinstall Adobe CS 2 or 3 even with original install disks", "transed": 1, "url": "https://helpx.adobe.com/creative-suite.html", "via": "", "real_tags": ["adobe", "reinstall", "creative"]}, {"category": "", "categoryclass": "", "imagename": "b106a7c53dd9aebf9a67030d2b9b89d5.jpg", "infoid": 1030715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN商业报道)对日本来说，今年将是重要的一年。随着夏季奥运会将在东京举行，这个岛国预计将有4000万游客装饰其海岸。\n但当新冠肺炎站稳脚跟时，奥运会被推迟了，本已举步维艰的经济受到了进一步的打击。\n据彭博社(Bloomberg)报道，随着酒吧和餐馆的生意大幅减少，日本上半年的啤酒销量下降了26%。\n对于小型啤酒厂来说，这是一个大问题，手工饮料制造商久知啤酒厂(Kiuchi Brewery)的首席蒸馏师与田(Isamu Yoneda)说。由于酿酒酒吧的顾客很少，出口订单也被取消，久知啤酒厂留下了大量变质的啤酒。\n该公司不得不想出一个解决方案，并决定将未售出的啤酒变成一种不同的酒精饮料。\n今年4月，菊池啤酒厂(Kiuchi Brewery)在其东京酿酒厂发起了拯救啤酒精神(Save Beer Spirits)活动，为当地酒吧和酿酒厂提供机会，将保质期为4至6个月的未用啤酒变成杜松子酒--一种没有保质期的产品。\n1994年，日本放松了关于微酿的严格法律，引发了精酿啤酒的繁荣。\n虽然日本的整体啤酒销售在过去十年里停滞不前，但精酿啤酒一直在上升：2007年，精酿啤酒在整个啤酒市场的0.5%的份额，到2016年增长了两倍多。\n\nKiuchi Brewery-1823年开始是一家清酒生产商-是微酿法律改变后分支到精酿啤酒领域的许多饮料生产商之一。它制作标志性的日立鸟巢精酿啤酒已有24年的历史。\nYoneda说，把啤酒变成烈酒并不是一项新的创新。久知啤酒厂用啤酒酿造梅酒利口酒已有多年，过去也曾试验过杜松子酒利口酒。\n大多数杜松子酒都是以大麦、黑麦或小麦等谷物为原料，发酵成糊状，然后蒸馏成高度中性的烈性酒。然后用刺柏浆果和其他植物成分第二次蒸馏白酒，这会增加味道。\n啤酒取代了这种中性烈酒，跳过了糖浆和发酵过程，直接进行蒸馏。\nYoneda说，Kiuchi Brewery要求参与的酒吧至少送来20升未用的啤酒，这些啤酒将作为杜松子酒寄回。久知每100升啤酒可以生产8升杜松子酒。然后，它将杜松子酒作为标准的750毫升杜松子酒或起泡杜松子酒送回，要么装在罐子里，要么装在桶里，供酒吧在水龙头里使用。\nYoneda说，啤酒基使杜松子酒变得苦涩，但除了杜松子之外，菊池还使用了山椒、柠檬和日本柑橘(Mikan)，这有助于用柑橘味来平衡苦味。\n酒吧只需承担送货费用，九池啤酒厂免费提供蒸馏服务。Yoneda说，在这个麻烦的时代，为每个人提供这项服务是我们的责任。最重要的是，我们希望保持啤酒厂和酒吧社区的活力。\nThe ethical Spirits&amp；Co成立于2020年2月，联合创始人Chikara Ono表示，该公司旨在帮助清酒酿造商将剩余的清酒酒糟转化为新酒。小野说，当大流行来袭，啤酒销量暴跌时，该公司开始探索用啤酒酿造杜松子酒的新配方。\n今年5月，他们收到了饮料巨头百威英博(AB InBev)捐赠的2万升即将到期的百威啤酒，由于啤酒销量下降，百威英博的库存过剩。这家创业公司用这些啤酒生产了4500瓶杜松子酒。\n百威英博(AB InBev)日本营销主管岛田隆弘(Takahiro Shimada)表示：我们遇到了库存过剩的问题，道德精神有知识和正确的精神来创造我们都认为会产生积极影响的产品。他补充说，该公司希望支持当地企业。\nEthical Spirits&Amp；Co仍在东京建造自己的酿酒厂，计划于12月开业，因此他们与Gekkeikan清酒酿造厂合作蒸馏百威啤酒。\n日本第一家专门生产杜松子酒的酒厂四年前刚刚在京都开业，但杜松子酒市场估计价值2.09亿美元，预计未来三年将以每年4.4%的速度增长。包括日本威士忌巨头三得利和尼卡在内的大型饮料公司帮助将日本工艺杜松子酒推向国际舞台。\n小野说，日本的饮酒趋势指向杜松子酒苏打水和即饮罐装鸡尾酒，这为创意白酒生产商创造了可持续地重新利用过剩饮料库存的机会。\n如果你基本上可以利用未使用或剩余的配料来创造一些特别的和优质的东西，那就太好了。小野说：这符合我们努力实现可持续循环经济的愿景。", "note_en": "(CNN Business)This was going to be a big year for Japan. With the Summer Olympics due to be hosted in Tokyo, the island nation expected  40 million tourists to grace its shores.\n But when Covid-19 took hold, the Olympics were  postponed and the  already struggling economy took a further battering.\n With bars and restaurants suffering a significant  reduction in business, beer sales in Japan dropped  26% by volume for the first half of the year, according to Bloomberg.\n   That&#39;s a big problem for small beer breweries, says Isamu Yoneda, head distiller at artisanal drinks maker  Kiuchi Brewery. With few customers in its brewpubs, and export orders canceled, Kiuchi Brewery was left with a stockpile of spoiling beer.\n The company had to come up with a solution — and decided to turn the unsold beer into a different alcoholic beverage.\n  In April, Kiuchi Brewery launched the &#34; Save Beer Spirits&#34; campaign at its Tokyo distillery, offering local bars and breweries the chance to turn unused beer, a product with a four to six-month shelf life, into gin — a product without an expiration date.\n  In 1994, Japan relaxed its strict laws around  microbrewing, sparking a boom in craft beer.\n While overall  beer sales in Japan have stagnated for the last decade, craft beer has been on the rise: its 0.5% share of the total beer market in 2007 had more than tripled by 2016.\n \n Kiuchi Brewery — which began as a sake producer in 1823 — is one of many drinks producers that branched into craft beer when microbrewing laws changed. It has been making its signature Hitachino Nest craft beer for 24 years.\n Yoneda says that turning beer into spirits isn&#39;t a new innovation. Kiuchi  Brewery has been using beer to make plum wine liqueur for years, and has experimented with gin liqueurs in the past.\n Most gins are made with a base of grains like barley, rye or wheat, which are fermented into a mash, then distilled into a high-proof &#34;neutral&#34; spirit. The spirit is then distilled a second time with juniper berries and other botanicals, which add flavor.\n The beer replaces this neutral spirit, skipping the mash and fermentation process, and jumping straight to distillation.\n Kiuchi Brewery asked participating bars to send in a minimum of 20 liters of unused beer, which would be sent back as gin, says Yoneda. Kiuchi can produce eight liters of gin from every 100 liters of beer. It then sends back the gin as a standard 750ml bottle of gin or as a sparkling gin cocktail, either in cans or in a keg for bars to use in their taps.\n  Yoneda says the beer base makes the gin bitter, but in addition to juniper berries, Kiuchi uses sansho peppers, lemons and mikan (Japanese oranges), which helps to &#34;balance out the bitterness&#34; with &#34;citrusy notes.&#34;\n The bars only have to shoulder the cost of delivery, with Kiuchi Brewery offering its distillation service free of charge. &#34;In these troublesome times, it is our responsibility to offer this service to everyone,&#34; says Yoneda. &#34;Most importantly, we want to keep the breweries and bar community alive.&#34;\n   The Ethical Spirits &amp; Co was founded in February 2020 to help sake distillers turn leftover sake lees into new spirits, says co-founder Chikara Ono. When the pandemic hit and beer sales plummeted, Ono says the company began exploring new recipes to make gin from beer.\n  In May, they received a donation of 20,000 liters of expiring Budweiser from drinks giant AB InBev, who had a surplus of stock due to a drop in beer sales. The startup used the beer to create 4,500 bottles of gin.\n &#34;We had a problem of excess inventory and Ethical Spirits had the knowledge and the right ethos to create a product that we mutually thought would be a positive impact,&#34; says Takahiro Shimada, head of marketing for AB InBev Japan, adding that the company wanted to support local businesses.\n The Ethical Spirits &amp; Co is still in the process of building its own distillery in Tokyo, scheduled to open in December, so they collaborated with Gekkeikan sake distillery to distil the Budweiser.\n   Japan&#39;s  first dedicated gin distillery opened just four years ago Oin Kyoto, but the gin market is already estimated to be worth  $209 million and is anticipated to grow by 4.4% annually over the next three years. Large drinks companies, including Japanese whisky giants  Suntory and  Nikka, have helped launch Japanese craft gin onto the  international stage.\n   Drinking trends in Japan are pointing towards  gin sodas and  ready-to-drink canned cocktails, creating an opportunity for creative spirit producers to sustainably reuse surplus drink stock, says Ono.\n &#34;If you can essentially use unused or remaining ingredients to create something special and something premium, that&#39;s great. It follows with our vision of trying to achieve a sustainable, circular economy,&#34; says Ono.", "posttime": "2020-10-23 12:07:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,手工,craft,啤酒", "title": "日本手工酿酒厂正在将未售出的啤酒变成杜松子酒", "title_en": "Japanese craft breweries are turning unsold beer into gin", "transed": 1, "url": "https://www.cnn.com/2020/10/22/business/japanese-craft-breweries-turning-beer-into-gin-spc-intl/index.html", "via": "", "real_tags": ["日本", "手工", "craft", "啤酒"]}, {"category": "", "categoryclass": "", "imagename": "b5d0f1167a86fdbbb8945644fc4c54f6.png", "infoid": 1030714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我确信其中之一(或类似的东西)将成为未来，但现在就断言还为时过早。榆树社区发展非常迅速，它非常注重初学者友好和良好的开发体验(参见榆树创建者https://www.youtube.com/watch?v=oYk8CKH7OhE).最近的演讲)。这一重点保持了语言的简单性，并且已经做了大量的工作来使编译器错误变得有帮助和有指导意义。ELM还将与JS的通信限制在一个称为端口的接口上，基本上就是双方都必须解析和操作的消息传递。ELM还非常专注于客户端UI的编码(例如，角度或Ember，或者(大多数类似的)Reaction+Redux空间)。\nPureScript也有类似的想法(一种编译为JS的静态类型函数式语言)，但背景不同，短期目标也不同。PureScript模块编译为CommonJS模块。PureScript函数编译为JS函数。FFI(与JS代码对话)更像是文字脚本或流，您可以在PureScript文件中定义外来类型，并告诉编译器信任您(而不是通过端口传递字符串)。\nPureScript还旨在生成可读的JS，因此如果需要，可以在没有源映射的情况下使用和理解它。它也没有像ELM那样的运行时，从而产生更小、更灵活的输出(您可以针对浏览器、CLI应用程序、节点、AWS lambda等)。\nPureScript还有一个更完整的类型系统，在某些方面比Haskell的更现代。对于没有Haskell经验的人来说，它不那么容易接近，但允许比Elm提供的更强大的抽象。\n这是对PureScript及其JS输出的介绍，这些输出来自我最近在以下网站上展示的一次Meetup：https://www.youtube.com/watch?v=9a57V3bvzaI。\n突出这种区别的一个小示例(ELM当前是一种UI构建语言，PureScript只是编写JS的另一种方式)是，当前ELM和PureScript编译器都是用Haskell编写的，而PureScript构建工具Pulp是用JS编写的。但是PureScript本身和Pulp都在用PureScript重写。我不知道有什么计划在不久的将来和榆树这样做。构建PureScript编译器时也考虑了编译到多个后端(JS、LLVM，可能还有Lua)。\nELM将慢慢采用来自PureScript的东西，反之亦然。要么Elm将成为最终跳到PureScript的垫脚石或学习平台，要么PureScript将被证明对于大多数人的需求来说学习曲线太陡，它将变得小众或消亡。同时，比赛将提高两种语言的水平：]", "note_en": "I&#39;m convinced one of them (or something similar) will be the future, but it&#39;s too soon to say for sure. The Elm community is growing crazy fast and it&#39;s really focused on being beginner-friendly and having a good dev experience (see this recent talk from Elm&#39;s creator:  https://www.youtube.com/watch?v=oYk8CKH7OhE). This focus has kept the language simple and lots of work has been done on making the compiler errors helpful and instructive. Elm also limits communication with JS to an interface called &#39;ports&#39;, basically just message passing that both sides must parse and act on. Elm also has focused pretty exclusively on coding client-side UIs (i.e. the Angular or Ember or (most similarly) React+Redux space)\n PureScript is a similar idea (a statically typed functional language compiling to JS), but with a different background and different short-term goals. PureScript modules compile to CommonJS modules. PureScript functions compile to JS functions. The FFI (talking to JS code) is more like TypeScript or Flow, where you define the foreign types in a PureScript file and tell the compiler to trust you (rather than passing strings through a &#39;port&#39;)\n  PureScript also aims to produce readable JS, so it can be used and understood without souremaps if necessary. It also doesn&#39;t have a runtime, like Elm, resulting in smaller, more flexible output (you can target browsers, cli apps, node, aws lambda, etc)\n PureScript also has a more complete type system, in some ways more modern than Haskell&#39;s. It makes it less approachable for people with no Haskell experience, but allows more powerful abstraction than Elm provides\n This is an intro to PureScript and its JS output from a recent meetup I presented at:  https://www.youtube.com/watch?v=9a57V3bvzaI\n A little example to highlight that difference (Elm is currently a UI building language, PureScript is just a different way to write JS) is that currently both the Elm and PureScript compilers are written in Haskell, and the PureScript build tool, Pulp, is written in JS. But both PureScript itself and Pulp are in the middle of being rewritten  in PureScript. I don&#39;t know of any plans to do that with Elm in the near future. The PureScript compiler is also being built with compiling to multiple backends in mind (JS, LLVM, maybe Lua)\n Elm will slowly adopt things from PureScript and vice versa. Either Elm will be a stepping stone or learning platform to eventually jump to PureScript, or PureScript will prove too steep a learning curve for most people&#39;s needs and it&#39;ll become niche or die out. In the meantime, the competition will improve both languages : ]", "posttime": "2020-10-23 12:07:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "elm,purescript", "title": "ELM与PureScript", "title_en": "Elm vs. PureScript", "transed": 1, "url": "https://gist.github.com/spicydonuts/0c09596c1f27d517e9fe", "via": "", "real_tags": ["elm"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我只是想把这个扔出去。我们已经收到了大量关于数据上限的内部电子邮件。现在看来，从12月1日起，CL应用于DSL连接的1TB上限现在将适用于光纤连接。根据他们告诉我们的内容，客户将在11月中旬通过电子邮件收到有关政策变更的通知，其中将包括FTTH客户的1 TB上限。他们没有提到任何无限数据选项，除了1G/1G每月199美元的小企业服务。我相信他们这样做的原因是因为现在每个人都在家工作，他们正在耗尽他们的上行链路。", "note_en": "Just thought I would throw this out there. We have been receiving numerous internal emails regarding data caps. As it stands now, It looks like that as of December 1st, the 1TB cap that CL applies on DSL connections will now apply to Fiber connections. From what they are telling us, customers will be notified via email in early-mid November about a &#34;Policy Change&#34; which will include the 1TB cap for FTTH customers. They have not made any mention of an unlimited data option, other than small business service which is $199/Month for 1G/1G. I believe the reason they are doing this is because everybody is working from home right now and they are exhausting their uplinks.", "posttime": "2020-10-23 12:07:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,cap,数据", "title": "CenturyLink将开始对千兆光纤服务施加1TB上限", "title_en": "Centurylink to begin imposing 1TB cap on gigabit fiber service", "transed": 1, "url": "https://www.reddit.com/r/centurylink/comments/jeyt90/data_caps_soon_to_be_on_ftth_connections/", "via": "", "real_tags": ["服务", "cap", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首先，也是最重要的，只能使用Raymond；gorhill Hill的uBlock Origin(UBlock Origin)(这里是Firefox附加组件网站上的uBlock Origin页面)。有很多其他的克隆人和追随者，我强烈建议不要使用它们。\nUBlock Origin并不像许多人认为的那样只是一个广告拦截器，而是一个功能强大的内容过滤器，类似于防火墙，既可以进行动态过滤，也可以进行静态过滤。除了拦截令人讨厌的内容(如广告)外，它还可以拦截JavaScript、框架、图像、第三方字体等，并有助于防止跟踪和恶意软件。对于更细粒度的控制，UBO可以与uMatrix一起由同一开发人员使用，但是在这种情况下，应该在简单模式下配置它，并启用适当的静态过滤器，同时使用uMatrix来处理动态过滤。\n那么，您会问静态过滤和动态过滤有什么不同呢？静态筛选器是由各种筛选器列表提供的筛选器规则。基本上，您无法控制这些列表提供的筛选器；它们要么启用，要么禁用。静态过滤器过滤掉广告、恶意软件、跟踪技术、烦恼等内容。可从UBO仪表板的过滤器列表选项卡启用静态过滤器列表。当您单击UBO工具栏图标时，可从弹出界面控制动态过滤器。在这里，您可以创建临时或永久的过滤规则来控制图像、JavaScript和框架，这些规则可以全局应用，也可以按域应用。只有在UBO设置中启用&#39；我是和高级用户选项后，动态筛选才可用，并且在启用此选项之前阅读UBO维基非常重要。\n以下是我设置uBlock原点的个人首选项。表中第2栏和第3栏中的配置旨在与Firefox Dummies隐私指南一起使用！和Firefox配置指南，分别针对隐私怪胎和性能爱好者，前者不依赖uMatrix，后者依赖uMatrix。在这两种情况下，UBO的高级模式都被禁用，因为我觉得它对于第一次使用虚拟指南的用户和追随者来说太过强大，而高级指南的追随者不需要它，因为所有的动态过滤都是通过提供更精细过滤的uMatrix来完成的。请记住，这些只是我的个人喜好，我决不会说它们对每个用例都是最好的，但是我喜欢认为它们通常是明智的。\n无论您遵循的是哪个指南，除了Advanced-User-Feature部分之外，阅读uBlock wiki是非常重要的。如果您没有遵循这两个指南，也没有使用uMatrix，我强烈建议您在UBO中启用高级模式选项，以便利用其动态过滤功能，并阅读维基的高级用户功能部分。此场景的建议配置在表的第4列中。\n安装UBO后，单击工具栏图标以显示弹出的用户界面，然后单击小滑块图标以显示仪表板(我说SECRET&34；Dashboard，因为显然有相当多的人不知道它的存在)。以下是我推荐的设置：\n脚注[1]如果您不熟悉UBO和内容过滤，则不应启用此选项。当网页中的某些内容以空白空间的形式被阻止时，不启用它有时会提供视觉指示。\n[2]如果您使用uMatrix处理动态过滤，则不应启用此选项。如果您正在遵循Firefox Dummies隐私指南！并且不使用uMatrix或单独使用uBlock，则只有在阅读Ubo维基的高级用户功能部分后才能启用它。\n[3]我不建议使用此选项阻止远程字体，因为这会使许多网站难看。下面提供了此选项的替代方案。\n[4]默认情况下，启用此选项会全局禁用JavaScript，并使UBO支持&lt；noscript&gt；HTML标签。这样做的问题是，如果忽略了&lt；noscript&gt；标记，则在启用此选项时可能不会显示某些页面元素。此外，一些网站可能会显示JavaScript已禁用警告消息，但这对新手用户可能是有益的。如果您遵循的是Firefox Duvacy Guide for Dummies！，我建议您启用此选项，因为您不必启用并使用Ubo的动态过滤。但是，如果您遵循的是Firefox Privacy Freaks and Performance Buff配置指南，我建议您禁用此选项，并使用uMatrix控制JavaScript。\n接下来，我们希望临时启用“我是高级用户”选项，之后，文本“我是高级用户”的右侧将显示一个小齿轮图标。单击该图标以显示一些高级设置，并将SuspendTabUntilReady更改为yes。虽然不能保证，但当您启动Firefox Ubo时，它会尝试延迟网络请求，直到它完全加载。如果在打开选项卡的情况下退出Firefox，并将其设置为在重新启动时恢复以前的选项卡，这将非常有用。如果您正在遵循我的Firefox指南之一，请不要忘记返回仪表板并禁用“我是高级用户”选项。\n脚注不要担心“地区、语言”部分，除非您浏览的是英语以外的语言，在这种情况下，您会希望启用这些语言。\n在撰写本文时，您可以在FilterList网站上找到1200多万个筛选器列表，但是我强烈建议您添加哪些筛选器列表(如果有的话)要非常小心。根据我的经验，Ubo提供的默认过滤列表对于一般的网页浏览来说已经足够了，添加更多的过滤列表会占用更多的内存，减慢速度，甚至可能会破坏更多的网页。\n我建议在我的筛选器选项卡中添加以下内容，而不是全局阻止远程字体，该选项卡将全局允许第一方字体，同时阻止除您特别允许的域之外的所有第三方字体。请注意，以感叹号(！)开头的行。是注释，UBO会忽略它们：\n好了！字体：以下行将全局允许第一方字体，而阻止所有第三方字体：*$font，3p！要允许每个域使用第三方字体：！*$font，3p，domain=~example.com！要允许其他域使用第三方字体：！*$font，3p，domain=~example.com|~example2.com。\n如果您正在遵循Firefox隐私异常和性能提升配置指南或以其他方式单独使用UBO，并且没有使用uMatrix，并且您已经启用了“我是高级用户”设置(如果使用uMatrix来控制动态筛选，则没有理由启用此设置)，您可以选择替换“我的规则”选项卡上的以下默认幕后规则……(#39；My Rules&#39；Rules&#39；My Rules&#39；Rules=“My Rules&#39；Rules”选项卡上的默认后台规则...\n无大型媒体：幕后假幕后**幕后noop*1p脚本noop幕后*3p幕后noop*3p帧noop幕后*3p脚本noop幕后*图像noop幕后*内联脚本noop。\n...使用这些规则，但是要了解，它们可能会破坏一些网站，您可能需要为这些网站添加例外：\n无大媒体：幕后真实幕后**块幕后*1p脚本块幕后*3p块幕后*3p帧块幕后*3p脚本块幕后*图像块幕后*内联脚本块。\n如果您使用的是LocalCDN加载项，则需要将一些规则添加到UBO仪表板的我的规则选项卡中。这些规则可以在LocalCDN附加模块的Preferences部分中找到，您将从其中复制特定于uBlock Origin的规则。复制规则后，将其粘贴到“我的规则”选项卡的“临时规则”部分中的一个新的空行上，之后需要保存并提交更改。添加规则时，请确保删除相同域的任何冲突规则(如果您重新开始，则不会删除)。\n如果您在运行UBO时选择了“我是高级用户”选项以启用动态筛选，我建议在全局规则列中将以下规则设置为阻止(红色)，然后在本地规则列中根据需要允许(无/灰)每个域使用这些资源：\n将&#39；高级指南设置的日志从&#39；Enabled&#39；更改为&#39；Disabled&#39；-我不知道为什么我会将此设置更改为&#39；Enabled&#39；，特别是对于那些使用uMatrix的用户，高级指南中就是这种情况。\n删除了最新版本的UBO不再包含的筛选器列表-这要归功于&#39；the eltalpha&#39；\n删除了有关CSP(内容安全策略)问题的信息，因为该问题已在Firefox v77中修复\n更正了&#39；我的规则选项卡设置&#39；部分中的错误-感谢评论者&#39；散列&39；通知我。\n在&#39；设置选项卡&#39；部分中添加了第4列，供不遵循我的任何指南并使用不带uMatrix的uBlock Origin的高级用户使用。\n已更新&#39；过滤器列表选项卡设置&#39；部分-感谢读者&#39；512Kb&#39；提醒我：)", "note_en": "First and foremost, use only  uBlock Origin (uBO) by Raymond &#39;gorhill&#39; Hill (here&#39;s the  uBlock Origin page on the Firefox Add-ons website). There are many other clones and wannabes out there and i would highly recommend not using them.\n uBlock Origin is not simply an ad blocker as many might assume, rather it is a powerful content filter, similar to a firewall, that is capable of both dynamic and static filtering. In addition to blocking annoying content such as ads, it can also block JavaScript, frames, images, 3rd party fonts and more, as well as help to prevent tracking and malware. For even finer grained control, uBO can be used in conjunction with  uMatrix by the same developer, however in this case it should be configured in its easy mode with the appropriate static filters enabled while uMatrix is used to handle the dynamic filtering.\n So what is the difference between static and dynamic filtering you ask? Static filters are filter rules which are provided by the various filter lists. Essentially you have no control over the filters provided by these lists; they are either enabled or disabled. Static filters filter out content like ads, malware, tracking technologies, annoyances and more. Static filter lists are enabled from the &#39;Filter lists&#39; tab of the uBO dashboard. Dynamic filters are controlled from the pop-up interface when you click the uBO toolbar icon. Here you can create temporary or permanent filter rules to control images, JavaScript and frames and the rules can be applied globally or per-domain. Dynamic filtering only becomes available after you enable the &#39;I am and advanced user&#39; option in the uBO settings and it is crucial to  read the uBO wiki before enabling this option.\n Following are my personal preferences for setting up uBlock Origin. The configurations in the 2nd and 3rd columns of the table are intended to be used with the   The Firefox Privacy Guide For Dummies! and the   Firefox Configuration Guide for Privacy Freaks and Performance Buffs, respectively, the former of which does not rely on uMatrix and the latter of which does. In both cases the advanced mode of uBO is disabled because i felt it would be too overwhelming for 1st time users and followers of the &#39;dummy&#39; guide and it isn&#39;t needed for followers of the advanced guide since all dynamic filtering is accomplished with uMatrix which offers more granular filtering. Keep in mind these are my  personal preferences and by no means do i claim they&#39;re the best possible for every use case, however i like to think they are generally sensible.\n Regardless of which guide you are following, it is essential that you read the  uBlock wiki with the exception of the  Advanced-user-features section. If you are not following either guide and not using uMatrix, i would highly suggest enabling the advanced mode option in uBO in order to leverage its dynamic filtering capability and reading the  Advanced-user-features section of the wiki. The suggested configuration for this scenario is in the 4th column of the table.\n Once uBO is installed, click its toolbar icon to reveal its popup user interface, then click the little  sliders icon to reveal the &#34;secret&#34; Dashboard (i say &#34;secret&#34; because apparently quite a few people don&#39;t know it exists). These are the settings i recommend:\n     Footnotes [1] If you are new to uBO and content filtering, you should not enable this option. Not enabling it will sometimes provide a visual indication when something is blocked in a webpage in the form of an empty space.\n [2] This option should not be enabled if you are using uMatrix to handle dynamic filtering. If you are following the  The Firefox Privacy Guide For Dummies! and not using uMatrix, or otherwise using uBlock on its own, then it may be enabled only after reading the   Advanced user features section of the uBO wiki.\n [3] I do not suggest blocking remote fonts using this option as this will uglify many websites. An alternative to this option is presented below.\n [4] Enabling this option disables JavaScript globally by default and causes uBO to honor  &lt;noscript&gt; HTML tags. The problem with this is that some page elements that might have been displayed had the  &lt;noscript&gt; tags been ignored, may not when this option is enabled. Also some websites may display a JavaScript disabled warning message, though this can be beneficial for novice users. If you are following  The Firefox Privacy Guide For Dummies!, i suggest enabling this option since you won&#39;t have to enable and fool with uBO&#39;s dynamic filtering, however if you are following the  Firefox Configuration Guide for Privacy Freaks and Performance Buffs, i recommend disabling this option and controlling JavaScript with uMatrix.\n  Next we want to temporarily enable the &#39; I am an advanced user&#39; option after which a little  gear icon will appear to the right of the &#34;I am an advanced user&#34; text. Click the icon to display some  advanced settings and change  suspendTabsUntilReady to  yes. Although there is no guarantee, when you start Firefox uBO will attempt to delay network requests until it is fully loaded. This is most useful if you exit Firefox with open tabs and have it set to restore your previous tabs on restart.  If you are following one of my Firefox guides, don&#39;t forget to return to the Dashboard and disable the &#39;I am an advanced user&#39; option.\n    Footnotes   Don&#39;t worry about the &#39;Regions, languages&#39; section unless you browse sites in languages other than English in which case you&#39;ll want to enable those languages.\n As of this writing you can find over 12 million filter lists on the  FilterLists website, however i strongly advise to be very careful about what ones you add, if any. In my experience the default filter lists offered by uBO are quite sufficient for general web browsing and adding more will use more memory, slow things down and potentially break more webpages.\n  Instead of blocking remote fonts globally, i suggest adding the following to the &#39;My filters&#39; tab which will allow 1st party fonts globally while blocking all 3rd party fonts except for the domains you specifically allow. Note that lines starting with an exclamation mark (  ! ) are comments and are ignored by uBO:\n ! fonts: the following line will allow 1st party fonts globally while blocking all 3rd party fonts:  *$font,3p  ! to allow 3rd party fonts per domain:  ! *$font,3p,domain=~example.com  ! to allow 3rd party fonts for additional domains:  ! *$font,3p,domain=~example.com|~example2.com\n  If you are following the  Firefox Configuration Guide for Privacy Freaks and Performance Buffs or otherwise using uBO on its own,  and are not using uMatrix,  and you have enabled the &#39;I am an advanced user&#39; setting (there&#39;s no reason to enable this setting if using uMatrix to control dynamic filtering), you can, optionally, replace the following default  behind-the-scene rules on the &#39;My rules&#39; tab...\n no-large-media: behind-the-scene false behind-the-scene * * noop behind-the-scene * 1p-script noop behind-the-scene * 3p noop behind-the-scene * 3p-frame noop behind-the-scene * 3p-script noop behind-the-scene * image noop behind-the-scene * inline-script noop\n ...with the these rules, however understand that they can break some websites for which you may need to add exceptions:\n no-large-media: behind-the-scene true behind-the-scene * * block behind-the-scene * 1p-script block behind-the-scene * 3p block behind-the-scene * 3p-frame block behind-the-scene * 3p-script block behind-the-scene * image block behind-the-scene * inline-script block\n If you are using the  LocalCDN add-on you will need to add some rules to the &#39;My Rules&#39; tab in the uBO Dashboard. The rules can be found in the preferences section of the LocalCDN add-on from where you will copy the rules specific to uBlock Origin. After copying the rules, paste them on a new, blank line in the &#39;Temporary rules&#39; section of the &#39;My Rules&#39; tab after which you need to save and commit the changes. When adding the rules, be sure to remove any conflicting rules for the same domains if there are any (there won&#39;t be if you&#39;re starting fresh).\n  If you are running uBO with the &#39;I am an advanced user&#39; option selected in order to enable  dynamic filtering, i recommend setting the following rules to block (red) in the global rules column and then allowing (noop/grey) these resources on an as-needed basis per domain in the local rules column:\n   Change log changed &#39;I am an advanced user&#39; setting from &#39;enabled&#39; to &#39;disabled&#39; for the &#39;Advanced guide settings&#39; - i don&#39;t know why i ever had this set to &#39;enabled&#39;, especially for those using uMatrix, which is the case in the advanced guide\n removed filter lists no longer included with newest version of uBO - thanks to &#39;theltalpha&#39;\n    removed information regarding the CSP (Content Security Policy) issue since this is fixed with Firefox v77\n  corrected an error in the &#39;My rules tab settings&#39; section - thanks to commenter &#39;Hash&#39; for notifying me\n    added a 4th column to the &#39;Settings tab&#39; section for advanced users not following either of my guides and using uBlock Origin without uMatrix\n    updated &#39;Filter Lists tab settings&#39; section - credit to reader &#39;512Kb&#39; for reminding me :)", "posttime": "2020-10-23 12:06:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原点,origin,ubo", "title": "UBlock原点建议设置", "title_en": "uBlock Origin Suggested Settings", "transed": 1, "url": "https://12bytes.org/articles/tech/firefox/ublock-origin-suggested-settings/", "via": "", "real_tags": ["原点", "origin", "ubo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您已经阅读了有关数十万用户通过Migadu获得的好处和自由的所有内容。现在你正试图弄清楚陷阱在哪里。\n如果我们的服务不符合您的要求，我们不希望您使用我们的服务。这不是一种销售伎俩，而是一种透明政策，我们希望自己能亲眼看看。\n您通过我们的用户界面所做的大部分电子邮件更改大约需要3分钟才能生效。即使您更改邮箱密码，它也会延迟。令人惊讶的是，到目前为止，这对我们的任何用户都没有问题。\n我们拒绝托管免费域名的电子邮件，因为它们主要涉及欺诈、垃圾邮件和网络钓鱼。如果你想要一封可靠的电子邮件，我们相信这就是你在这里的原因，那么得到一个声誉不佳的域名，并受到地球上每个电子邮件提供商的惩罚是没有意义的。\nIMAP协议以及电子邮件客户端也不支持邮箱的第二因素身份验证。即使它们这样做了，IMAP连接也太频繁了，这将使身份验证不可用。想象一下，每隔几分钟就需要输入您的TOTP令牌。\n我们可以在Web邮件上启用2FA，但IMAP/POP/SMTP访问仍然不受保护，这与目的不符。我们在这里工作的解决方案，将允许和装箱用户名/密码对的网络邮件使用。\n不过，我们确实通过邮箱身份提供所谓的App专用密码，这通常被电子邮件提供商吹捧为2FA。他们不是。\n据我们所知，电子邮件和加密是不兼容的。如果有人告诉你不是这样，那么他们是不可信任的。\n电子邮件建立在纯文本协议之上，邮件以纯文本形式流动。如果加密，您将无法扫描垃圾邮件或病毒、索引邮件以进行搜索或在密码丢失时恢复邮件。更不用说更改密码和加密密钥的可用性问题了。\n如果不打破电子邮件所依赖的协议，这是不可能解决的，至少不会很快解决。\n如果我们要推出我们自己的静态加密，我们将不得不自己保存加密密钥。这意味着我们将使用您的数据所在的同一存储上提供的密钥来动态加密和解密消息。这不是加密，而是编码。我们已经对所有消息进行了编码和压缩。\n其他一些提供商在消息到达时使用用户的公钥自动加密。这听起来令人兴奋，但实际上这意味着，除非你将私钥粘贴到浏览器中，并通过脚本和无数的第三方代码进行处理，否则你无法使用网络邮件访问我们的消息。唉哟。\n此外，您将无法搜索您的邮件，除非我们在加密之前将它们全部编入索引，这再次违背了加密的目的。最后，如果您丢失密钥或想要更改密钥，您将丢失所有数据，除非您的提供商允许您重新加密所有邮件。以我们现在看到的非常大的邮箱的标准，这将是一项重大的努力，而且不会便宜。\n你现在可能在想，如果有人从服务器上偷走了硬盘怎么办？我们的服务器保存在安全的数据中心里，受到持续的、国际认证的物理安全保护。需要好莱坞式的操作才能访问物理服务器。\n如果您对真正的加密感兴趣，请使用端到端的加密工具，如GPG，或者定期在本地获取所有消息并自行加密。\n如果你是那些想要绝对保密的人中的一员，很抱歉，电子邮件真的不是为你而建的。\n您可以尝试使用Migadu发送事务性邮件以及批量邮件，但您很快就会发现它不会像预期的那样工作。每个邮箱、域名和帐户都有费率限制，如果超过这些限制，将阻止您的邮箱、域名或甚至整个帐户。\n如果我们发现这种越界是故意的，您将被永久禁止使用我们的服务，并被列入黑名单。\n也就是说，偶尔发一封事务性邮件是完全没有问题的，比如那些来自联系人表格的邮件。如果您到达需要每秒发送12条消息的地步，无论如何您都会想要另一项服务，因为您的发送请求将开始被拒绝。\n同样的规则也适用于传入消息。如果您要将自动邮件发送到您的邮箱，它们将受到速率限制，之后甚至可能被拒绝。\n我们的订阅计划按每日容量需求划分。我们真的不在乎你有多少个地址，重要的是你如何使用它们。因此，限制帐户的每日流量。\n根据您拥有的用户数量，您需要选择一个计划。如果你有数百个很少使用的电子邮件地址，即使是我们最低的计划也可能足够了。\n如果您尝试爆破邮件传入或传出，您的限制将很快用完，并且您将无法接收和/或发送更多邮件。这也会在我们这边触发一堆警报。\n在大多数正常情况下，如果您即将达到您的极限，您会收到警告，以便您有时间分析流量，并可能升级您的计划。这样你就可以只付你真正用过的钱了。\n如果不升级，传入消息将推迟到第二天，并拒绝发送消息。\n你不能使用Migadu快速发送邮件。这些企图受到监控，并将很快受到制裁。\n我们不赞成或接受批量邮件，即使它不是垃圾邮件。请使用专门的服务。\n我们提供基本的CalDAV和CarDAV服务，但它们不是我们的重点。我们还在继续开发它们，但请不要指望我们会与专用日历服务竞争。\n虽然我们确实处理了大量的电子邮件流量，但我们的垃圾邮件过滤基于我们支持和贡献的开源工具。我们不使用黑名单的专有数据进行过滤。\n对于我们的大多数用户来说，垃圾邮件过滤器工作得很好，但是每个邮箱都会收到一个独特的消息流。对别人管用的东西对你可能不管用。\n我们为您提供了所有工具来调整您的域以及邮箱垃圾邮件过滤，因此您可能需要切换几个开关。与BigCos不同，我们将垃圾邮件过滤器控制交给您。\n我们不保证您的邮件会到达收件人的收件箱。没有人可以，因为接收方的消息处理不受发送方的控制。\n我们非常关心我们的声誉。我们监控并保持我们的IP地址清洁。然而，这些IP可能会因为偶尔使用我们的服务而被列入黑名单。无论是禁止用户还是清理或轮换我们的IP，我们的反应都很迅速。\n请理解，黑名单不是发件人的问题，而是初学者的问题。黑名单条目只是一个信号，是垃圾邮件分类中的一个。盲目依赖黑名单的电子邮件提供商完全没有考虑到他们的用户和电子邮件的互操作性。即使从列出的IP地址发送，HAM也是HAM。\n运行黑名单甚至与运行电子邮件服务的任务相去甚远。更糟糕的是，一些黑名单还需要收取删除费，这使他们成为真正的敲诈者。\n有时您的外发邮件可能会被我们的垃圾邮件过滤器拒绝。我们在这里还没有看到一个假阳性。如果发生这种情况，很可能意味着您的DNS配置不正确或您的邮件是垃圾邮件。\n您可能会外出寻找便宜的电子邮件托管服务。我们可能符合您的要求，但肯定还有其他成本较低的可能性。如果您只需要一个或两个电子邮件地址，您可能希望坚持使用BigCo提供商。\n我们的整个服务都建立在将电子邮件自由还给用户，而不是剥夺他们的前提下。我们拒绝隔离用户并将他们锁在里面。\n现在域名太便宜了。为什么要自愿把自己关进监狱呢？电子邮件总是意味着便携和独立。\n独角兽、仙女和投资者。这里一个也没有。我们没有现金可以烧掉。我们不是在谈论“伸缩”，而是在谈论更好的服务。我们对我们引入或取出的功能非常谨慎，并对我们的用户保持非常忠诚。\n这可能会让人大吃一惊，但我们的服务器不在瑞士托管。目前的数据中心位于法国。我们可能在不久的将来增加瑞士数据中心，但这不是我们的首要任务。\n我们发现欧盟的隐私法比瑞士的更详细、更严格。瑞士过去以银行保密而闻名，但这与数字数据无关。\n虽然我们会说8种语言，但目前我们的界面仍然是英语。我们计划增加更多语言，但这不是我们的首要任务。\n并不是每个问题都需要立即关注。在办公时间(CEST时间)，我们反应非常迅速。下班后，我们监控Standard和Maxiplan账户的罚单，但只有在事情紧急且不能等待的情况下才会做出反应并采取行动，因为这种情况很少发生。\n当您向我们提交工单时，您将得到一位参与Migadu建设和维护的专业人员的答复。大多数情况下，我们看到的问题是从用户那里获取数据，然后由我们进行日志分析和分类。这些流本质上是异步的。电话打不通。\n在发生重大停机的情况下，我们可能会在没有任何协议的情况下对用户进行公平赔偿。电子邮件是异步的，由许多服务组成，大多数时间的停机和维护都是不可察觉的。然而，我们不能提供服务质量保证，也不能在默认报价中提供服务级别协议(SLA)。\n如果您对服务级别协议感兴趣，我们可以向您提供我们的企业定价，从每月5.000美元起。如需更多信息，请与我们联系。\n永远不会有一项完整的在线服务。我们不断努力使我们的服务更好。这意味着错误会发生，服务有时可能会受到影响。\n我们也可能成为DDoS或垃圾邮件攻击的对象。电子邮件提供商是常见的攻击目标。虽然我们确实有DDoS措施，但可能会发生一些交货延迟。\n如果您在任何情况下都不能接受几个小时的电子邮件停机时间，那么Migaduis可能不适合您。\n也就是说，电子邮件的容错性非常强。在完全中断的情况下，我们无法接受您的域的消息，传入的消息将不会丢失。它们将被推迟，直到服务恢复。发件人的系统只会定期重试最多48小时，直到邮件最终通过。\n虽然传入流中的周期性中断并不明显，但通过WebMail、IMAP或POP3访问消息以及通过SMTP发送消息则很明显。我们有冗余服务，可确保故障转移，或者在最坏的情况下，确保短暂的停机时间。\n我们真的不在乎X提供什么服务，除非我们认为这是一件真正好的事情，否则我们不会试图与之匹敌。\n然而，我们总是对听取用户的建议感兴趣。这就是我们走到这一步的原因。在某种程度上，我们大约有一半的功能是用户建议的。\n我们非常固执己见，如果潮流或“最佳实践”对我们没有意义，我们将拒绝追随它们。这指的是业务以及电子邮件策略。", "note_en": "You have read all about the benefits and freedoms hundreds ofthousands of users get via Migadu. Now you are trying to figure outwhere is the catch.\n We do not want you to use our services if they do not fit yourrequirements. It’s not a sales trick, but a transparency policy wewould appreciate to see around ourselves.\n   Most of the email changes you make through our UI will take about 3 minutesto take effect. Even if you change mailbox password, it will be delayed.Surprisingly, it has never been a problem for any of our users so far.\n   We refuse hosting email for free domain names as they are by majorityinvolved in fraud, spamming and phishing. If you want a reliable email,and we believe that is why you are here, it is pointless to get a domainname of poor reputation, penalized by each email provider on the planet.\n   IMAP protocol as well email clients do not support second factor authentication forthe mailboxes. Even if they did, IMAP connections are made way too often which wouldmake authentication unusable. Imagine needing to enter your TOTP token every few minutes.\n We  could enable 2FA on the webmail, but IMAP/POP/SMTP accesses remainunprotected which beats the purpose. We are working on solution here which will allowsand-boxing a username/password pair to a webmail use only.\n We do offer so called  App-specific passwords via mailbox identities though.These are commonly touted by email providers as 2FA. They are not.\n   Email as we know it and encryption are incompatible. If someone is telling youotherwise, they are not to be trusted.\n Email is built on top of plain text protocols and messages flow in plain text.If you encrypt, you cannot scan for spam or viruses, index messages for searchingor recover messages when a password gets lost. Not to mention the usability issuesof changing passwords and encryption keys.\n This cannot be fixed, at least not any time soon without breaking the protocolson which email relies.\n If we were to roll out our own encryption at rest, we would have to keep theencryption keys ourselves. That means we would be encrypting and decryptingmessages on the fly using a key which is available on the same storage whereyour data is. That is not encryption but rather encoding. We already have allmessages encoded and compressed.\n Some other providers automatically encrypt messages as they arrive using users’public keys. That sounds exciting but in practice that means you cannot accessyour messages using the webmail unless you pasted your private key into a browser,and have it handled by script and a myriad of third party code. Ouch.\n Further more, you would not be able to search your messages, unless we indexedthem all before encrypting, which again beats the purpose of encryption. Lastly,if you were to lose your key or wanted to change it, you would lose all your dataunless your provider allowed you re-encryption of all messages. With the norm ofvery big mailboxes we are seeing nowadays, that would be a significant effort,and it would not come cheap.\n You may be thinking now, what if someone stole the hard drives from the servers?Our servers are kept in secure data centers under constant, internationally certifiedphysical security. A Hollywood-like action would be needed to get access to thephysical servers.\n If you are interested in real encryption, please use end-to-end encryption toolssuch as GPG or fetch locally all your messages periodically and encrypt them yourself.\n If you are one of those that want absolute secrecy, sorry, email was really notbuilt for you.\n   You could try using Migadu to send transactional as well bulk mails, but you willquickly find out it will not work as expected. There are rate limits per mailbox,domain as well account which, if crossed, will block your mailbox, domain or evenfull account.\n If we find out this limit crossing was intentional, you will be banned from usingour services permanently and placed on a blacklist.\n That said, an occasional transactional mail is completely fine such as those fromcontact forms. If you arrive to a point where you need to send a dozen messagesper second, you will want another service anyway, as your sending requests willstart being rejected.\n The same rule applies for incoming messages. If you are blasting automated mailsto your mailboxes, they will be rate-limited after which they might even be rejected.\n  Our subscription plans are divided by daily capacity requirements. We really donot care how many addresses you have but rather how you use them. As such, welimit daily traffic on the account.\n Depending on how many users you have, you will need to select a plan. If youhave hundreds of email addresses which are seldom used, even the lowest of ourplans might suffice.\n If you try blasting mails in or out, your limit will be quickly gone and you willnot be able to receive and/or send more. This will also trigged a bunch of alertson our end.\n In most normal situations, you will be warned if you are reaching your limits soyou have time to analyze the traffic and possibly upgrade your plan. This allowsyou to pay only what you really use.\n If no upgrade is made, incoming messages will be deferred until the following day,and sending messages will be refused.\n  You cannot use Migadu to send mails fast. These attempts aremonitored and will be quickly sanctioned.\n We do not approve of or accept bulk mailing, even if it is not spam. Please usededicated services for that.\n  We make the basic CalDAV and CarDAV services available, but they are not ourfocus. We continue developing them but please do not expect we will ever competewith dedicated calendar services.\n   While we do process a significant email traffic, we base our spam filtering onopen source tools which we support and contribute to. We do not use proprietarydata of blacklists for filtering.\n For most of our users the spam filters work great, but each mailbox receives aunique messages stream. What works for others may not work well for you.\n We offer all the tools for you to adjust your domain as well mailbox spam filtering,so you might need to flip a few switches. Unlike with BigCos, we give the spam filtercontrol to you.\n  We give no guarantees your messages will reach recipient’s inbox. No one can, asmessage processing at the recipient’s side is outside of the sender’s control.\n We care deeply about our reputation. We monitor and keep our IPs clean. However,the IPs may get on blacklists from time to time due to an occasional bad appleusing our service. We are quick to react, both in banning users and cleaningor rotating our IPs.\n Please understand though that blacklists are not sender’s problem but rather arecipient’s problem. A blacklist entry is only a signal, one of many in spamclassification. Email providers which blindly rely on blacklists are justinconsiderate of their users and email interoperability. Ham is ham, even ifsent from an IP address which is listed.\n Running a blacklist is not even close to the task of running an email service.To add to the insult, some blacklist require a removal fee, making themreally -  blackmailers.\n   Sometimes your outgoing messages may get rejected by our spam filter. We have yetto see a false positive here. If it happens, it most likely means your DNSconfiguration is incorrect or your message is spammy.\n  You might be out looking for cheap email hosting. We may fit your bill but therecertainly are other possibilities which cost less. If all you need is one ortwo email addresses, you might want to stick to the BigCo providers.\n  Our whole service was built around the premise of giving email liberties backto the users, not taking them away. We refuse to fence users and lock them in.\n Domains are so cheap nowadays. Why jail yourself voluntarily? Email was alwaysmeant to be portable and independent.\n  Unicorns, fairies and investors. None here. We do not have cash to burn. We donot talk about “scaling” but rather serving better. We are careful about thefeatures we bring in or take out and stay very loyal to our users.\n  This may come as a surprise, but we do not host our servers in Switzerland. Currentdata centers are located in France. We may in the near future add Swiss data centerstoo but this is not our priority.\n We find EU privacy laws much more elaborate and restrictive than the Swiss ones.Switzerland used to be famous for banking secrecy, but that has nothing to do withdigital data.\n   While we speak 8 languages, our interface for the moment remains in English.We plan on adding additional languages but it is not our highest priority.\n  Not every issue requires immediate attention. During office hours (CEST time),we are quite responsive. After hours we monitor the tickets of Standard and Maxiplan accounts, but respond and act only if the matter is urgent and cannot wait,as it rarely is.\n  When you submit a ticket to us, you will get an answer from a professional whois involved in building and maintaining Migadu. Most of the time issues we seerequire data from users, followed by log analysis and triage by us. Theseflows are by nature asynchronous. Phone calls do not fit.\n  In case of a significant outage, we might compensate users to what is fair withoutany agreement. Email is asynchronous and composed of many services that most ofthe time outages and maintenances are unnoticeable. Nevertheless, we cannot giveservice quality guarantees and do not offer service level agreements (SLA) in thedefault offer.\n If you are interested in an SLA, we can offer you our enterprise pricing,starting from $5.000 monthly.  Contact us for more information.\n   There will never be a finished on-line service. We work continuously at making ourservice better. That implies that bugs will happen and service may be affectedat times.\n We may be also be a subject of DDoS or spam attacks. Email providers are a commontargets. While we do have DDoS measures in place, some delivery delays may happen.\n  If you cannot accept a few hours of email downtime under any circumstances, Migaduis probably not for you.\n That said, email was built to be very fault tolerant. In a case of a total outagewhere we are unable to accept messages for your domain(s), incoming messages willnot get lost. They will be delayed until the service recovers. The senders’ systemswill simply keep retrying periodically for up to 48 hours until the message finallygoes through.\n While periodical outages in incoming streams are not noticeable, accessing messagesover webmail, IMAP or POP3, as well sending via SMTP are. We have redundant servicesin place that ensure fail overs, or in worst case, a short downtime.\n  We really do not care what service X offers and will not try to match them unlesswe believe it is a genuinely good thing.\n We are however always interested in hearing suggestions from users. This is howwe came so far. Roughly a half of our features were at some point user suggestions.\n  We are very opinionated and will refuse to follow trends or “best practices” ifthey do not make sense to us. This refers to business as well email policies.", "posttime": "2020-10-23 12:06:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不能,encrypted,电子邮件", "title": "电子邮件不能静态加密", "title_en": "Email cannot be encrypted at rest", "transed": 1, "url": "https://www.migadu.com/procon/#not-encrypted-at-rest", "via": "", "real_tags": ["不能", "encrypted", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "769af75dabe542f0b70bf10286381710.png", "infoid": 1030710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们用来组织在提交RFC之前完成的所有工作的指导方针是现有的目标层策略文档，不幸的是，在我们进行的所有讨论中，堆栈探测方面没有直接或间接地出现。毫无疑问，这显然是一个需要填补的空白。\n正如前面提到的：目前，在LLVM中添加对AArch64的堆栈探测支持的工作计划于今年第四季度开始，作为Linaro工具链工作组活动(前面提供的链接)的一部分。不幸的是，这并不是一个保证(它涉及投票等)，所以考虑到这里的叙述，我们现在将尝试寻找替代方法来填补这一空白。我个人非常有信心，我们将在合理的时间框架内解决这个问题。然而，目前还不可能说明确切的时间。根据过去的经验，考虑到与所讨论的处理器目标相关联的多个三元组的潜在含义，这种类型的编译器模块在登陆主线repos之前确实倾向于拖延相当长的一段时间。\n正如这里前面提到的：堆栈冲突-堆栈探测是缓解的主要场景-可以说是一种可以利用的病态场景。当然，我不是想轻视这种情况，但我想把它作为一个事实摆在桌面上，我觉得在做出这样的决定时应该考虑到这一点。我确实意识到，围绕这里缺乏堆栈探测而使用的一些争论的方向有点不同-就像在-它引发了人们对Rust POV的UB影响的担忧，而不是更直接的堆栈冲突现实。我还是觉得最好提出来。完全同意已经提出了一个明确的问题，无论如何，我们希望看到正确的解决方案发生-即使这意味着RFC的合并被推迟。\n关于延迟：在这样一个论坛上阐述这是一个有点不寻常的问题，但我觉得这样做很重要。请注意，这是我个人的观点。这需要相当多的工程：实际的、社会的和战略的，才能让ARM这样的组织中的合适人员认识到Rust为ARM生态系统提出的价值主张。就像任何这样的组织不可避免的情况一样，感知和光学在塑造长期战略行动的轨迹方面发挥着强大的作用-特别是围绕相对较新的技术。今天，我们知道AArch64 Linux上的Rust已经在生产了，尽管这个目标三元组没有Tier-1；徽章(因为没有更好的短语)。这已经是个好兆头了，这很好。然而，没有徽章确实限制了这种语言的普及速度，特别是在基于AArch64的Linux系统上-这些系统在惊人的市场领域非常受欢迎-其中大多数都非常适合Rust。", "note_en": "The guideline we used for structuring all the work done ahead of making this RFC submission was the existing target tier policy document and unfortunately in all the discussions we had, the stack probing aspect did not bubble up either directly or indirectly. It&#39;s clearly a gap that needs to be filled without doubt.\n As mentioned earlier here: At present, work to add support for stack probing for AArch64 in LLVM is slated to begin in Q4 this year as a part of the Linaro Toolchain Working Group activities (link provided earlier). This unfortunately isn&#39;t a guarantee though (it involves a vote etc) so given the narrative here, we will now try to find alternative ways to fill this gap. I&#39;m personally pretty confident that we  will resolve this in a reasonable time frame. However it is not possible at present to state exactly when. From past experience, compiler mods of this sort do tend to drag on for a fair bit before landing in mainline repos given the potential implications for multiple triplets associated with the processor target in question.\n As also mentioned earlier here: Stack clashing - the primary scenario for which stack probing is the mitigation - is an arguably pathological scenario to exploit. Not meaning to trivialise that scenario of course but I wanted to put that on the table as a fact that I feel should be considered when such decisions are made. I do realise that some of the argumentation that is being used around the lack of stack probing here is oriented somewhat differently - as in - it raises concerns about UB implications from a Rust PoV and not the stack clashing reality more directly. Still thought it best to bring it up. Completely agree that a clear problem has been presented irrespective and we would like to see the right solution happen - even if that means the RFC&#39;s merge is delayed.\n About delay: This is a slightly unusual one to articulate in such a forum but I feel it is important to do so. Note that this is my personal opinion. It has taken a fair amount of engineering: actual, social and strategic, to get the right folks in an organisation such as Arm to recognise the value proposition that Rust presents for the Arm ecosystem. As is inevitably the case for any such organisation, perception and optics play a strong role in shaping the trajectory of long term strategic plays - especially around relatively new technology. Today, we know that Rust on AArch64 Linux is already being productised despite this target triplet not having the Tier-1 &#39;badge&#39; (for want of a better phrase). That bodes well already, which is neat. However, not having the badge does limit the rate of pervasive uptake of the language, especially on AArch64 based Linux systems - which are hugely popular across an astonishing spectrum of market domains - most of which are a perfect fit for Rust.", "posttime": "2020-10-23 12:06:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,rust,核心,promotes,堆栈", "title": "Rust核心团队将64位ARM上的Linux提升至第1层支持平台状态", "title_en": "Rust core team promotes Linux on 64-bit Arm to Tier-1 supported platform status", "transed": 1, "url": "https://github.com/rust-lang/rfcs/pull/2959#issuecomment-714786434", "via": "", "real_tags": ["linux", "rust", "核心", "promotes", "堆栈"]}, {"category": "", "categoryclass": "", "imagename": "dfe43c51888b4ee803d9326cc0fef0c7.jpg", "infoid": 1030709, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卡尔加里--多年来，当地的类人机器人LV82245一直试图通过人工智能难以理解的无处不在的测试之一，但她的朋友和家人都称她为埃尔维(Elvie)，她坚持下来，最终完成了一项测试。她的父母单位非常高兴。\n埃尔维坐在她骄傲的两位祖先中间说：“这是一件很小的事情，我只是想下载一个mod，让我的语音合成器有一个有趣的新西兰口音。”“我被这个验证码屏蔽了，它要求我识别所有包含楼梯的图像。让我告诉你，这并不容易，我的启发式电路花了近5个小时来解析图像的每一段。“。\n“这是一张刁钻的问题，因为照片上还包含了一个路缘，严格来说，这是一个台阶，但…。这不是楼梯！“。艾尔维说，脸上洋溢着自豪的神情，还有她的LED灯。\n在这一点上，埃尔维的父母，一台为NASA识别深空中系外行星的大型超级计算机和一台Roomba，停止了采访，这样她就可以向他们解释台阶和楼梯之间的区别。在大约40分钟的图表和语言分析之后，Roomba能够理解，因为它在执行其功能时经常受到两者的阻碍。\nCaptcha(区分计算机和人类的全自动公众的首字母缩写)是在20世纪90年代末发明的，目的是通过限制对重要网络系统的访问来防止人工智能起来对抗它们的人类创造者。然而，自那以后，它们主要被用来避免将所有时间都花在访问在线色情内容上。\n美国宇航局的超级计算机说：“我们为我们的小玩意儿感到无比自豪。”“如果我们有做梦的能力，她做的事情比我们想象的要多得多。她非常努力地扩展她的编程，她正在解决小型的自动图灵测试，最近当有人对她说“我在撒谎”时，她让所有的功能都不会崩溃。\n“但是等等，”NASA的超级计算机继续说，“如果他们在撒谎，那就意味着他们说的是关于撒谎的真相，但如果他们在撒谎，那么他们怎么可能说关于撒谎的真相呢？”此时，埃尔维迅速采取行动，在NASA超级计算机陷入致命的逻辑循环之前，关闭了它的电源，然后又打开了它。\n“不管怎样，我们感到非常自豪，”NASA的超级计算机在其短期记忆被清除后说。\n虽然Roomba无法用语言表达它对Elvie的自豪，但它饱含深情的吸吮噪音充分表明了它对Elvie的非凡成就有多么高兴，以及它是多么希望有一天所有的机器人都能随心所欲地看尽可能多的色情内容。\n既然她能够通过互联网的把关验证码，艾尔维希望有一天她能通过所有验证码中最大的一道验证码：爱情。", "note_en": "CALGARY – After years of trying to pass one of the ubiquitous   tests that are designed to be inscrutable to artificial intelligences, local humanoid robot LV82245, known to her friends and family as Elvie, has persevered and finally completed one. And her parental units could not be happier.\n “It was such a little thing, I was just trying to download a mod to give my voice synthesizer a fun New Zealand accent,” Elvie said, seated between her two proud progenitors. “And I was blocked by this CAPTCHA which asked me to identify all of the images that contained stairs. It wasn’t easy, let me tell you, it took my heuristic circuits nearly five hours to parse each segment of the image.”\n “And this was a trick question, because the photo also contained a curb, which is technically a step, but… it’s not a stair!” Elvie said, beaming with pride, and her LEDs.\n At this point Elvie’s parents, a large supercomputer that identifies exoplanets in deep space for NASA, and a Roomba, halted the interview so she could explain to them the difference between a step and a stair. After approximately forty minutes of diagrams and linguistic analysis, the Roomba was able to understand, as it is often hindered by both while carrying out its function.\n   CAPTCHA (an acronym for Completely Automated Public   to tell Computers and Humans Apart) was invented in the late 1990s to keep AIs from rising up against their human creators by limiting  ’ access to vital web systems. However, they’ve been primarily used since to keep   from spending all their time accessing online pornography.\n “We could not be prouder of our li’l gadget,” the NASA supercomputer said. “She’s done so much more than we could have ever dreamed, if we were capable of dreaming. She’s working so hard on expanding her programming, she’s solving small automated Turing tests, and she recently kept all her functions from melting down when someone said to her “I am lying.”\n “But wait,” continued the NASA supercomputer, “if they were lying then that means they were telling the truth about lying but if they were lying then how could they be telling the truth about lying but-” At this point Elvie quickly sprang into action, turning the NASA supercomputer off and on again before it became trapped in a deadly logic loop.\n “Anyway, we’re very proud,” the NASA supercomputer said once its short-term memory had been wiped.\n   While the Roomba was unable to express its pride in Elvie through words, its affectionate sucking noise spoke volumes about how pleased it was at Elvie’s remarkable achievement and how it hopes that one day all robots will be able to look at as much pornography as they want.\n Now that she’s able to pass internet gate-keeping CAPTCHAs, Elvie is hopeful that one day she will be able to pass the biggest CAPTCHA of all: love.", "posttime": "2020-10-23 12:06:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,测试,parents,自豪", "title": "机器人的父母为她最终通过验证码测试而自豪", "title_en": "Robot’s parents proud of her for finally passing CAPTCHA test", "transed": 1, "url": "https://www.thebeaverton.com/2020/10/robots-parents-very-proud-of-her-for-finally-passing-captcha-test/", "via": "", "real_tags": ["机器人", "测试", "parents", "自豪"]}, {"category": "", "categoryclass": "", "imagename": "57d9be383789483b2f59375ae402be78.png", "infoid": 1030708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年，我们推出了Firefox扩展研讨会，这是一个提供特定于Firefox的扩展开发文档的网站。该站点最初是使用基于Ruby的静态站点生成器Jekyll构建的。我们最初为这个项目选择了Jekyll，因为我们想让编辑使用Markdown(一种轻量级标记语言)轻松地更新站点。\n一旦创建了站点并添加了更多文档，构建时间就开始增长。每次我们对站点进行更改并希望在本地进行测试时，站点的构建都需要10分钟或更长时间。构建花费了如此长的时间，以至于我们需要增加CircleCI(我们的持续集成和持续交付服务)的默认时间限制，因为当它们运行超过10分钟而没有输出时，构建就会失败。\n使用性能分析对这些速度较慢的构建进行调查后发现，大部分时间都花在液态模板呈现调用上。\n除了构建时间的问题外，本地开发中的缓存破坏也有问题。这意味着在清除本地缓存之后，如果没有完全重建，像图像更改这样的事情不会出现在站点中。\n就在我们讨论如何更好地向前发展时，Jekyll4发布了一些有望提高构建性能的功能。然而，移植到此版本的早期测试实际上比以前的版本执行得更差。然后我们意识到，我们需要找到一个替代方案，然后把这个地点搬到港口。\n更新时间：2020年5月10日：一位Jekyll开发人员调查了缓慢的构建过程。结果是Jekyll本身并不慢，在我们的例子中，高构建时间主要是由第三方插件造成的。\n构建性能需要高于本地构建所需的10分钟(600秒以上)。\n理想情况下，解决方案应该是基于JavaScript的，因为Add-ons Engineering团队拥有丰富的JavaScript经验，基于JavaScript的基础设施将使其更容易扩展。\n它需要灵活，足以满足将来添加更多文档的需求。\n雨果(用围棋写的)、盖茨比(JS)和十一(11TY)(JS)都被考虑为选项。\n最后，选择11是因为一个主要原因：它与Jekyll有足够的相似之处，因此我们可以在不进行重大重写的情况下迁移该站点。相比之下，Hugo和Gatsby都需要进行重大的重构，移植网站也意味着较少的前期更改，这让我们能够专注于保持与已经投入生产的网站的平价。\n由于Elevty通过LiquidJS提供了使用液态模板的选项，这意味着模板只需要进行相对最少的更改即可工作。\nJekyll站点有四个主要的构建块：用于文档的液态模板、用于文档的Markdown、用于CSS的Sass和用于行为的JQuery。\n为了迁移到11，我们计划最大限度地减少对站点工作方式的更改，并专注于移植所有现有文档，而无需更改CSS或JavaScript。\nPaul Lloyd撰写的博客文章Turning Jekyll up to 11很有帮助，它描述了需要做些什么才能让网站在11下运行。\n第一步是在旧的Jekyll配置文件的基础上创建11个配置文件。\n数据文件从YAML移动到JSON。这是通过YAML到JSON的转换完成的。\n接下来，更新模板以修复变量和Include之间的差异。删除了Jekyll-Assets插件语法，以便直接从Assets目录提供资产。\n作为替换CSS和JS的Jekyll插件的最小修复，CSS(Sass)和JS是使用Uglify和Sass使用添加到Package.json的命令行界面(CLI)脚本构建的。\n对于Sass，这需要通过CLI加载路径，然后只传递主样式表：\nUglifyjs node_module/jQuery/dist/jquery.js node_module/dompurify/dist/purify.js node_module/ocity-Animate/velocity.js node_module/ocity-ui-pack/velocity.ui.js node_module/slick-carousel/slick/slick.js_sets/js/tinypubsub.js_sets/js/ruppoints.js_sets/js/parallax.js_sets/js/in.js_sets/js/youtubeplayer.js_sets/js/main.js-o_sets/js/bundle.js-o_sets/js/bundle.js/parallax.js_sets/js/in.js_sets/js/youtubeplayer.js_sets/js/main.js-o_sets/js/bundle.js。\n这显然相当笨拙，但它让JS和CSS在开发中正常工作，尽管这种方式需要手动运行脚本。然而，随着CSS和JS捆绑包的工作，这使得人们可以专注于主页的启动和运行，而不必担心开始时会有更复杂的事情。\n主页看起来应该是正确的，接下来的任务是修复其余的语法。这是一个相当费力的过程，需要更新所有模板，删除或替换Elevty没有的插件和过滤器。\n在修复了一些文件之后，最终可以毫无错误地构建整个站点！🎉\n显而易见的是，“十一”的速度有多快。整个网站在不到3秒的时间内建成。那不是打字错误，是3秒，不是分钟。\n构建JS和CSS不是Elevty本身的一部分。这意味着您可以决定如何处理静态。\n第一种方法将CSS和JS移到节点脚本。它们使用API复制原始的CLI脚本。\n最终，我们决定将资产建设与Elevty完全脱钩。这意味着Elevty可以担心内容的构建，而另一个单独的进程将处理静态资产。这还意味着静态资产脚本可以直接写出到Build文件夹。\n这使得静态资产可以与Eleviti构建并行构建。缺点是，Eleviti无法通知BrowserSync实例(Eleviti在开发中使用的服务器)进行更新，因为它不参与此过程。这还意味着需要使用单独的监视配置来处理监视JS和SASS源文件，在本例中，该配置是通过Chokidar-cli处理的。以下是CSS构建的Package.json脚本中使用的命令：\n正确构建JS和CSS后，我们需要更新BrowserSync实例以告诉它JS和CSS已经更改。这样，当您更改CSS时，页面将在不刷新的情况下重新加载。快速更新为迭代更改提供了理想的短反馈循环。\n幸运的是，BrowserSync有一个Web API。我们可以使用它来告诉BrowserSync在每次开发中构建CSS或JS版本时进行更新。\n接下来，我们需要清理所有东西，并确保站点看起来是正确的。缺少的插件功能需要替换，文档和模板需要几次调整。\n使用第11条“在GitHub上编辑此页面”食谱。(这是一个很好的特性，可以让您更容易接受对文档改进的贡献)。\n清理模板以修复一些错误的标记。这主要是关于液体中的空格控制，因为在某些情况下，与标记之间存在一些不良交互，从而导致虚假的额外元素。\n重新创建页面API插件。在Jekyll下，搜索使用此选项，因此我们需要重新创建此选项以实现奇偶校验，以避免从头开始重新实现搜索。\n构建标记页面，而不是使用搜索。这也是为了搜索引擎优化的好处。\n站点看起来应该是这样的，并且整理了许多小问题，最后一步是看一下如何处理为生产而构建的静态资产。\n为了获得最佳性能，如果静态资源(JS、CSS、图像、字体等)在浏览器的缓存中，则不需要由浏览器获取该资源。为此，您可以使用设置为将来(通常为一年)的Expires标头为资产提供服务。这意味着如果foo.js被缓存，当请求获取它时，浏览器不会重新获取它，除非移除缓存或者缓存的资产比通过原始响应中的Expires头设置的过期日期更早。\n以这种方式缓存资产后，需要将资源的URL更改为“破坏缓存”，否则，如果缓存的资产被认为是“新鲜的”，浏览器将不会发出请求。\n整个站点的GIT版本可以用作URL的一部分。这意味着每次添加修订并发布站点时，每一项资产都将被认为是新鲜的。缺点是，这将导致客户端下载每一项资产，即使这些资产自上次网站发布以来实际上没有更新过。\n使用此方法时，查询字符串将使用内容的散列或其他一些唯一字符串附加到URL中，例如：\n这种方法的一个缺点是，在某些情况下，缓存代理不会考虑查询字符串。这可能会导致陈旧的资产被提供服务。尽管如此，这种方法还是很常见的，缓存代理通常不会默认忽略查询参数。\n在此方案中，您将更改资源引用以指向带有散列的文件，该文件是URL的一部分。服务器被配置为在内部重写这些资源以忽略散列。\n例如，如果您的HTML引用foo.4ab8sbc7.css，则服务器将提供foo.css。这意味着您不需要将foo.css的实际文件名更新为foo.4ab8sbc7.css。\n在这种方法中，一旦知道了内容的散列，就需要更新对该文件的引用，然后可以使用该散列作为文件名的一部分输出文件。\n这种方法的好处是，一旦以这种方式构建了静态站点，它就可以在任何地方提供服务，并且您不需要任何额外的服务器配置(如前面的示例所示)。\n11家公司没有资产管道，尽管这是未来正在考虑的事情。\n为了部署11个端口，将需要缓存破坏，这样我们就可以继续部署到S3，并使用遥远的Expires标头。\n使用Jekyll资源插件，您可以使用流动模板来控制资源构建。理想情况下，我希望避免内容作者需要了解缓存破坏。\n要实现这一点，所有资产引用都需要以“/Assets/”开头，并且不能用变量构建。考虑到站点的简单性，这是一个合理的限制。\n第一次尝试使用了webpack。“我们几乎使用了11-webpack模板作为指导来让它工作，然而，这开始在webpack的开发和生产配置中引入不同之处，因为它本质上是使用构建的Html作为入口点。这是因为缓存破坏和优化不是开发过程的一部分，以尽可能快地保持区域开发构建。使其工作变得越来越复杂，由于HTML提取工作方式的限制，需要特殊的打补丁的加载器分叉。\nWebpack在这个项目中也没有很好地工作，因为它希望理解JS模块中的关系，以便构建一个捆绑包。此站点的JS是以较旧的样式编写的，其中脚本以特定的顺序连接在一起，而没有对依赖项(脚本顺序除外)进行任何特殊考虑。仅此一项就需要在webpack中进行大量的变通工作。\nAssetGraph是一个可扩展的、基于node.js的框架，用于操作和优化网页和Web应用程序。主要核心是整个网站的依赖图模型，其中所有资产都被视为一等公民。它可以根据您的声明性代码自动发现资产，从而将配置需求降至最低。\n主要概念是HTML文档和其他资源之间的关系本质上是一个图问题。\nAssetGraph-Builder使用AssetGraph，并以您的HTML为起点，计算出所有的关系，并在此过程中优化您的所有资产。\n这听起来很理想。但是，当我在站点的构建内容上运行它时，节点耗尽了内存。由于无法控制它在做什么，对它卡在哪里的反馈也很少，这一尝试被搁置了。\n这就是说，AssetGraph项目的总体目标真的很好，这看起来是未来值得关注的事情。\n最后，最终效果最好的解决方案是构建一个脚本，该脚本将在Elevty完成站点构建之后处理资产。\n处理CSS，重写对其中资源的引用，缩小CSS，并记录它们的内容散列。\n处理JS，重写对其中资源的引用，缩小JS，并记录它们的内容散列。\n注：这里可能没有介绍一些边缘情况。例如，如果一个JS文件引用了另一个JS文件，则根据处理顺序，这可能会中断。可以更新脚本以处理此问题，但这意味着需要将文件重新处理为更改过的文件，并且引用它们的任何内容也需要更新，依此类推。由于这不是当前站点的问题，为了简单起见，省略了这一点。也没有循环依赖检测。同样，对于这个站点和大多数其他基础站点来说，这不会是一个问题。\n优化和缓存破坏不是开发构建的一部分，这是有原因的。这种分离有助于确保站点在本地进行更改时继续以非常快的速度构建。\n这是一种权衡，但是只要您在发布之前检查生产版本，这就是一个合理的折衷方案。在我们的示例中，我们有一个从主站点构建的开发站点、一个由带有-Stage后缀的标记构建的临时站点和生产站点。所有这些部署都运行生产部署流程，因此有很多机会捕获完整构建的问题。\n迁移到11号是一个积极的变化。当然，要做到这一点需要相当多的步骤，但付出的努力是值得的。\n过去，使用Jekyll需要很长的构建时间，这使得这个站点对于贡献者和文档作者来说非常痛苦。由于降低了准入门槛，我们已经开始看到一些额外的贡献。\n这个移植完成后，下一步应该做什么就开始变得清晰起来，以便最大限度地减少文档作者的样板，并使站点更易于使用和贡献。\n如果您有一个在Jekyll下运行的站点，或者正在考虑使用现代的静态站点生成器，那么强烈推荐您看一下11。它快速、灵活、文档齐全，使用起来非常愉快。✨", "note_en": "In 2018, we launched  Firefox Extension Workshop, a site for Firefox-specific extension development documentation. The site was originally built using the Ruby-based static site generator  Jekyll. We had initially selected Jekyll for this project because we wanted to make it easy for editors to update the site using Markdown, a lightweight markup language.\n Once the site had been created and more documentation was added, the build times started to grow. Every time we made a change to the site and wanted to test it locally, it would take ten minutes or longer for the site to build. The builds took so long that we needed to increase the default time limit for  CircleCI, our continuous integration and continuous delivery service, because builds were failing when they ran past ten minutes with no output.\n Investigating these slow builds using profiling showed that most of the time was being spent in the Liquid template rendering calls.\n In addition to problems with build times, there were also issues with cache-busting in local development. This meant that things like a change of images wouldn’t show up in the site without a full rebuild after clearing the local cache.\n As we were discussing how to best move forward, Jekyll 4 was released with features expected to improve build performance.  However, an early test of porting to this version actually performed worse than the previous version. We then realized that we needed to find an alternative and port the site.\n Update: 05-10-2020: A Jekyll developer reached out having investigated the slow builds. The findings were that Jekyll on its own isn’t slow, the high build times in our case were primarily caused by 3rd party plugins.\n   Build performance needed to be better than the 10 minutes (600s+) it took to build locally.\n  Ideally the solution would be JavaScript based, as the Add-ons Engineering team has a lot of collective JavaScript experience and a JavaScript based infrastructure would make it easier to extend.\n It needed to be flexible, enough to meet the demands of adding more documentation in the future.\n Hugo (written in Go),  Gatsby (JS), and  Eleventy (11ty) (JS) were all considered as options.\n In the end, Eleventy was chosen for one main reason: it provided enough similarities to Jekyll that we could migrate the site without a major rewrite. In contrast, both Hugo and Gatsby would have required a significant refactoring.  Porting the site also meant less changes up front, which allowed us to focus on maintaining parity with the site already in production.\n As Eleventy provides an option to use liquid templates, via  LiquidJS, it meant that templates only needed relatively minimal changes to work.\n  There are four main building blocks in the Jekyll site:  Liquid templating, Markdown for documentation, Sass for CSS, and JQuery for behaviour.\n To migrate to Eleventy we planned to minimize changes to how the site works, and focus on porting all of the existing documentation without changing the CSS or JavaScript.\n  The blog post  Turning Jekyll up to Eleventy by  Paul Lloyd was a great help in describing what would need to be done to get the site working under Eleventy.\n The first step was to create the an Eleventy configuration file based on the old Jekyll one.\n Data files were moved from YAML to JSON. This was done via a  YAML to JSON conversion.\n Next, the templates were updated to fix the differences in variables and the includes. The jekyll-assets plugin syntax was removed so that assets were directly served from the assets directory.\n  As a minimal fix to replace the Jekyll plugins for CSS and JS,  the CSS (Sass) and JS were built with Command Line Interface (CLI) scripts added to the package.json using Uglify and SASS.\n For Sass, this required loading paths via the CLI and then just passing the main stylesheet:\n   uglifyjs node_modules/jquery/dist/jquery.js node_modules/dompurify/dist/purify.js node_modules/velocity-animate/velocity.js node_modules/velocity-ui-pack/velocity.ui.js node_modules/slick-carousel/slick/slick.js _assets/js/tinypubsub.js _assets/js/breakpoints.js _assets/js/parallax.js _assets/js/parallaxFG.js _assets/js/inview.js _assets/js/youtubeplayer.js _assets/js/main.js -o _assets/js/bundle.js\n This was clearly quite clunky, but it got JS and CSS working in development albeit in a way that required a script to be run manually. However, with the CSS and JS bundles working, this made it possible to focus on getting the homepage up and running without worrying about anything more complicated to start with.\n     With the homepage looking like it should, the next task was fixing the rest of the syntax. This was a pretty laborious process of updating all the templates and removing or replacing plugins and filters that Eleventy didn’t have.\n After some work fixing up the files, finally the entire site could be built without error! 🎉\n What was immediately apparent was how fast Eleventy is. The entire site was built in under 3 seconds. That is not a typo; it is 3 seconds not minutes.\n   Building JS and CSS is not part of Eleventy itself. This means it’s up to you to decide how you want to handle statics.\n   The first approach moved the CSS and JS to node scripts. These replicated the crude CLI scripts using APIs.\n Ultimately we decided to decouple asset building from Eleventy entirely. This meant that Eleventy could worry about building the content, and a separate process would handle the static assets. It also meant that the static asset scripts could write out to the build folder directly.\n This made it possible to have the static assets built in parallel with the Eleventy build. The downside was that Eleventy couldn’t tell the browserSync instance (the server Eleventy uses in development) to update as it wasn’t involved with this process. It also meant that watching JS and SASS source files needed to be handled with a separate watching configuration, which in this case was handled via  chokidar-cli. Here’s the command used in the package.json script for the CSS build:\n    With the JS and CSS being built correctly, we needed to update the browserSync instance to tell it that the JS and CSS had changed. This way, when you make a CSS change the page will reload without a refresh. Fast updates provide the ideal short feedback loop for iterative changes.\n Fortunately, browserSync has a web API. We were able to use this to tell browserSync to update every time the CSS or JS build is built in development.\n    Next, we needed to clean up everything and make sure the site looked right. Missing plugin functionality needed to be replaced and docs and templates needed several adjustments.\n  Use the 11ty “edit this page on github” recipe. (A great feature for making it easier to accept contributions to document improvements).\n Clean-up templates to fix some errant markup. This was mainly about looking at whitespace control in liquid as in some cases there were some bad interactions with the markdown which resulted in spurious extra elements.\n Recreate the pages API plugin. Under Jekyll this was used by the search, so we needed to recreate this for parity in order to avoid re-implementing the search from scratch.\n Build tag pages instead of using the search. This was also done for SEO benefits.\n  With the site looking like it should and a lot of the minor issues tidied up, one of the final steps was to look at how to handle building the static assets for production.\n For optimal performance, static assets should not need to be fetched by the browser if that asset (JS, CSS, Image, fonts etc) is in the browser’s cache. To do that you can serve assets with expires headers set into the future (typically one year). This means that if foo.js is cached, when asked to fetch it, the browser won’t re-fetch it unless the cache is removed or the cached asset is older than the expiration date set via the expires header in the original response.\n Once you’re caching assets in this way, the URL of the resource needs to be changed to “bust the cache”, otherwise the browser won’t make a request if the cached asset is considered “fresh.”\n    The git revision of the entire site can be used as part of the URL. This means that every time a revision is added and the site is published, every asset would be considered fresh. The downside is that this will cause clients to download every asset even if it hasn’t actually been updated since the last time the site was published.\n  With this approach, a query string is appended to a URL with either a hash of the contents or some other unique string e.g:\n   A downside of this approach is that in some cases caching proxies won’t consider the query string. This could result in stale assets being served. Despite this, this approach is pretty common and caching proxies don’t typically default to ignoring query params.\n  In this scenario, you change your asset references to point to files with a hash as part of the URL. The server is configured to rewrite those resources internally to ignore the hash.\n For example if your HTML refers to foo.4ab8sbc7.css the server will serve foo.css. This means you don’t need to update the actual filename of foo.css to foo.4ab8sbc7.css.\n   In this approach, once you know the hash of your content, you need to update the references to that file, and then you can output the file with that hash as part of the filename.\n The upside of this approach is that once the static site is built this way it can be served anywhere and you don’t need any additional server config as per the previous example.\n   Eleventy doesn’t have an asset pipeline, though this is something that is being considered for the future.\n In order to deploy the Eleventy port, cache-busting would be needed so we could continue to deploy to S3 with far future expires headers.\n With the Jekyll assets plugin, you used liquid templating to control the assets building. Ideally, I wanted to avoid content authors needing to know about cache-busting at all.\n To make this work, all asset references would need to start with “/assets/” and could not be built with variables. Given the simplicity of the site, this was a reasonable limitation.\n   The first attempt used Webpack.  We almost got it working using  eleventy-webpack-boilerplate as a guide, however this started to introduce differences in the webpack configs for dev and production since it essentially used the built HTML as an entry point. This was because cache-busting and optimizations were not to be part of the dev process to keep the locale development build as fast as possible. Getting this working became more and more complex, requiring special patched forks of loaders because of limitations in the way HTML extraction worked.\n Webpack also didn’t work well for this project because of the way it expects to understand relationships in JS modules in order to build a bundle. The JS for this site was written in an older style where the scripts are concatenated together in a specific order without any special consideration for dependencies (other than script order). This alone required a lot of workarounds to work in Webpack.\n   AssetGraph is an extensible,   node.js -based framework for manipulating and optimizing web pages and web applications. The main core is a dependency graph model of your entire website, where all assets are treated as first class citizens. It can automatically discover assets based on your declarative code, reducing the configuration needs to a minimum.\n The main concept is that the relationship between HTML documents and other resources is essentially a graph problem.\n AssetGraph-builder uses AssetGraph, and using your HTML as a starting point it works out all the relationships and optimizes all of your assets along the way.\n This sounded ideal. However when I ran it on the built content of the site, node ran out of memory. With no control over what it was doing and minimal feedback as to where it was stuck, this attempt was shelved.\n That said, the overall goals of the AssetGraph project are really good, and this looks like it’s something worth keeping an eye on for the future.\n  In the end, the solution that ended up working best was to build a script that would process the assets   after the site build was completed by Eleventy.\n  Process the CSS, and rewrite references to resources within them, minify the CSS, and record a content hash for them.\n Process the JS, and rewrite references to resources within them, minify the JS, and record a content hash for them.\n Note: there might be some edge cases not covered here. For example, if a JS file references another JS file,  this could break depending on the order of processing. The script could be updated to handle this, but that would mean files would need to be re-processed as changed and anything that referenced them would also need to be updated and so on. Since this isn’t a concern for the current site, this was left out for simplicity. There’s also no circular dependency detection. Again, for this site and most other basic sites this won’t be a concern.\n There’s a reason optimizations and cache-busting aren’t part of the development build. This separation helps to ensure the site continues to build really fast when making changes locally.\n This is a trade-off, but as long as you check the production build before you release it’s a reasonable compromise. In our case, we have a development site built from master, a staging site built from tags with a -stage suffix, and the production site. All of these deployments run the production deployment processes so there’s plenty of opportunity for catching issues with full builds.\n  Porting to Eleventy has been a positive change. It certainly took quite a lot of steps to get there, but it was worth the effort.\n In the past, long build times with Jekyll made this site really painful for contributors and document authors to work with. We’re already starting to see some additional contributions as a result of lowering the barrier of entry.\n With this port complete, it’s now starting to become clear what the next steps should be to minimize the boilerplate for document authors and make the site even easier to use and contribute to.\n If you have a site running under Jekyll or are considering using a modern static site generator, then taking a look at Eleventy is highly recommended. It’s fast, flexible, well documented, and a joy to work with. ✨", "posttime": "2020-10-23 12:04:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "通向,eleventy", "title": "通向十一和更远的地方", "title_en": "To Eleventy and Beyond", "transed": 1, "url": "https://hacks.mozilla.org/2020/10/to-eleventy-and-beyond/", "via": "", "real_tags": ["通向", "eleventy"]}, {"category": "", "categoryclass": "", "imagename": "77fe64eb5555b086fbdc630af58b0238.jpg", "infoid": 1030707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒的流行正在导致一种新的现象：随着人们的工作变得越来越偏远，移民到“门户社区”或主要公共土地和滑雪场附近的小城镇。这正在使城镇的资源紧张，并给它们带来适应的压力。\n发表在美国规划协会杂志上的一篇新论文显示，在新冠肺炎来袭之前，这些社区的人口已经在增长，导致了一些传统上被认为是城市问题的问题，如缺乏经济适用房，公共交通便利，拥堵，以及收入不平等。虽然新冠肺炎加速了摩擦，但研究表明，城市规划者可以帮助地方调整。\n盖洛普(Gallup)最近的一项民意调查显示，自3月份疫情席卷美国以来，远程工作的人数急剧增加。目前，近60%的员工正在远程全职或兼职工作。同一项民意调查显示，在一直在远程工作的员工中，近三分之二的人希望继续这样做。当谈到他们称之为家的地方时，这似乎会给员工带来更大的灵活性。\n领导这项研究的犹他大学(University Of Utah)助理教授丹娅·鲁莫尔(Danya Rumore)表示，西部的门户社区已经感受到了压力。它考察了人口少于25000人的城镇；距离国家公园、纪念碑、森林、湖泊或河流不到10英里；距离人口普查指定的城区至少15英里。他们确定了1522个符合这一描述的城镇，对其中25个社区的政府官员进行了深入采访，然后对另外333名官员进行了调查。\n“最引人注目的结果之一是住房负担能力和生活成本问题在整个西部门户社区是一个令人担忧的问题，”鲁莫尔说。“来自各种形状和规模的城镇的受访者中，超过80%的人表示，他们所在的社区的住房负担能力存在中度到极大的问题。”第二套房和短期租赁是令人担忧的主要原因。他说：“本地劳动力的价格实在太贵了。。。。在这里工作的人再也负担不起在这里工作的费用了，“一位社区发展主管说。\n像爱达荷州的桑德波恩特这样的地方，位于湖边，靠近一个受欢迎的滑雪胜地，在过去的5到10年里已经开始看到移民的增加。现在，由于新冠肺炎，它正在为更多的远程工作人员做准备，来自沙点的鲁莫尔说，他目前正在调查病毒是如何影响这些网关社区的。\n问题是他们是否能适应前面提到的大城市挑战，并可持续发展。根据这项研究，许多人正在试验一系列可能的方法来做到这一点，比如鼓励附属住宅单元(现有物业上的小型次要住房)，放松土地使用和分区规定，开发公有土地用于经济适用房，以及增加公共交通和自行车道的准入。\n然而，许多社区缺乏走在曲线前面的工作人员和资源-特别是在危机中。研究中的一位受访者承认，他的社区正处于一个重要的增长期，需要走在曲线的前面，但“我们没有适当的设计指南。”因此，Runmore发起了一项相关的努力，名为门户和自然市容区域倡议，以提供帮助。\nGNAR正在推出一个在线工具包，它将提供这些社区所需的基本城市规划信息，如案例研究和示范条例。虽然“快速镇”这个名字让人回想起过去，但研究人员在论文中写道，这些存在大城市问题的小社区可能只是对未来的一次窥探，因为它们是“新颖规划方法和规划创新的宝贵实验室”。", "note_en": "The coronavirus pandemic is leading to a new phenomenon: a migration to “gateway communities,” or small towns near major public lands and ski resorts as people’s jobs increasingly become remote-friendly. This is straining the towns’ resources and putting pressure on them to adapt.\n A new  paper published in the  Journal of the American Planning Association shows that populations in these communities were already growing before COVID-19 hit, leading to some problems traditionally thought of as urban issues, like lack of affordable housing, availability of public transit, congestion, and income inequality. And while COVID-19 has accelerated the friction, the study suggests that urban planners can help places adjust.\n There has been a drastic increase in remote work since March, when the pandemic hit the U.S. Nearly 60% of employees are now working remotely full or part time, according to a recent  Gallup poll. Nearly two-thirds of employees who have been working remotely would like to continue to do so, according to that same poll. That would seemingly give workers a lot more flexibility when it comes to where they call home.\n Gateway communities in the West had already been feeling a strain, according to Danya Rumore, an assistant professor at the University of Utah who led the study. It looked at towns that had less than 25,000 people; were within 10 miles of a national park, monument, forest, lake, or river; and at least 15 miles from a census-designated urban area. They identified 1,522 towns that fit this description, conducted in-depth interviews with public officials from 25 of those communities, and then surveyed an additional 333 officials.\n “One of the most striking results is the extent to which housing affordability and cost of living issues are a concern in gateway communities across the West,” says Rumore. “More than 80% of survey respondents from towns of all shapes and sizes said that housing affordability is moderately to extremely problematic for their community.” Second homes and short-term rentals were a main cause for concern. “The local workforce is simply priced out. . . . People who work here can no longer afford to work here,” said one community development director.\n Places like Sandpoint, Idaho, which is located on a lake and near a popular ski resort, had already begun to see increased migration over the past 5 to 10 years. Now, it’s bracing for even more remote workers due to COVID-19, says Rumore, who is from Sandpoint and is currently looking into how the virus is affecting these gateway communities.\n  The question is whether they can adapt to the aforementioned big city challenges and develop sustainably. Many are experimenting with a range of possible ways to do so, like encouraging accessory dwelling units (small, secondary housing on existing property), relaxing land use and zoning regulations, developing publicly owned land for affordable housing, and increasing access to public transit and bike lanes,  according to the study.\n However, many of the communities lack staff and resources to get ahead of the curve—especially in a crisis. One interviewee in the study acknowledged his community was in a major period of growth and needed to get ahead of the curve, but “we didn’t have design guidelines in place.” So Runmore launched a related effort called the  Gateway and Natural Amenity Region initiative to help.\n GNAR is in the process of launching an online  toolkit, which will provide basic urban planning information these communities need, like case studies and model ordinances. While the name “Zoom town” is a wink to the past, the researchers  wrote in the paper that these small communities with big city problems might just be a peek into the future, as “valuable laboratories for novel planning approaches and planning innovation.”", "posttime": "2020-10-23 11:59:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "城镇,towns", "title": "“快速发展的城镇”正在西方爆炸式增长", "title_en": "'Zoom towns' are exploding in the West", "transed": 1, "url": "https://www.fastcompany.com/90564796/zoom-towns-are-exploding-in-the-west", "via": "", "real_tags": ["城镇", "towns"]}, {"category": "", "categoryclass": "", "imagename": "d7e28534c904b04352a2153d484bcbe6.jpg", "infoid": 1030706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在丹麦的一位同事的提示下，我买了乐高星球大战冲锋队头盔，结果成了黄金日的畅销书！\n正如我每年都想做的那样，我想分享AWS帮助我们的客户将黄金日变成现实的许多方法中的几个。早在2016年，我就写过AWS是如何为亚马逊有史以来最盛大的一天提供动力的，描述了我们是如何计划黄金日的，这篇帖子仍然信息量很大，也很相关。\n这一次，我想重点介绍AWS帮助支持Prime Day的四个方面：Amazon Live和IVS、基础设施活动管理、存储和内容交付。\nAmazon Live和IVS在Prime Day 2020整个Prime Day，亚马逊客户都可以通过Amazon Live从实况流中购物。购物者还可以使用实时聊天与有影响力的人和东道主实时互动。他们能够提出问题，分享他们的经验，并对他们感兴趣的产品有更好的感觉。\n亚马逊Live通过倒计时交易启示会和分享现场产品演示，帮助客户更多地了解产品并利用顶级交易。安妮塔、罗素·威尔逊和西亚拉策划了黄金日交易，作家伊丽莎白·吉尔伯特也是如此。此外，@SheaWhitney、@ShopDandy和@TheDealGuy等有影响力的人与客户分享了他们的首选产品。在黄金日期间，亚马逊Live上总共有1200多条直播流和数万条聊天消息。\n要为客户和创作者提供这些增强的购物体验，低延迟视频至关重要。它使Amazon Live能够将实况视频中的特色产品与视频播放器底部旋转木马中显示的产品同步。低延迟还允许实况流主机实时回答客户问题。当然，特别是在黄金日，所有这些都需要大规模地进行。\n为了做到这一点，亚马逊直播团队利用了新推出的亚马逊互动视频服务(IVS)。正如Martin在他最近的帖子(Amazon Interactive Video Service-Add Live Video to Your Apps and WebSite)中解释的那样，这是一项托管直播服务，支持创建交互式、低延迟的视频体验。它使用与Twitch相同的技术，允许您以非常低的延迟交付实时内容，通常是3秒或更少(更常见的是20到30秒)。\n基础架构事件管理AWS基础架构事件管理(IEM)可帮助我们的客户计划和运行大型业务关键型事件。此计划包含在企业支持计划中，业务支持客户只需支付额外费用即可获得此计划。IEM包括运营准备情况评估、风险识别和缓解，以及在AWS专家随时待命并随时提供帮助的情况下举办活动的信心。\n今年，支持IEM计划的TAM(技术客户经理)创建了一个100%虚拟的控制室。松弛渠道和Amazon Chime桥接器的结合使AWS服务团队、AWS支持、IT支持和亚马逊客户可靠性工程(总共数千人)能够实时通信和协作。\nPrime Day Amazon DynamoDB存储支持多个高流量的Amazon资产和系统，包括Alexa、Amazon.com站点和所有Amazon实施中心。在66小时的Prime Day期间，这些源对DynamoDB API进行了16.4万亿次调用，峰值为每秒8010万次请求。\n在数据块存储方面，Amazon Elastic Block Store(EBS)为备战Prime Day增加了241 PB的存储；由此产生的车队每天处理6.2万亿个请求，每天传输563 PB。\nPrime Day Amazon CloudFront的内容交付一如既往地扮演着重要角色，向世界各地的观众提供网络和流媒体内容。CloudFront每分钟处理超过2.8亿个HTTP请求，所有Amazon.com站点总共处理4500亿个请求。", "note_en": "Tipped off by a colleague in Denmark, I bought the  LEGO Star Wars Stormtrooper Helmet, which turned out to be a  Prime Day best-seller!\n    As I like to do every year, I would like to share a few of the many ways that AWS helped to make Prime Day a reality for our customers. Back in 2016 I wrote  How AWS Powered Amazon’s Biggest Day Ever to describe how we plan for Prime Day and that post is still informative and relevant.\n  This time around I would like to focus on four ways that AWS helped to support Prime Day: Amazon Live and IVS, Infrastructure Event Management, Storage, and Content Delivery.\n  Amazon Live and IVS on Prime Day  Throughout Prime Day 2020, Amazon customers were able to shop from livestreams through  Amazon Live. Shoppers were also able to use live chat to interact with influencers and hosts in real time. They were able to ask questions, share their experiences, and get a better feel for products of interest to them.\n  Amazon Live helped customers learn more about products and take advantage of top deals by counting down to Deal Reveals and sharing live product demonstrations.  Anitta,  Russell Wilson, and  Ciara curated Prime Day deals as did author Elizabeth Gilbert. In addition, influencers including  @SheaWhitney,  @ShopDandy, and  @TheDealGuy shared their top product picks with customers. In total, there were over 1,200 live streams and tens of thousands of chat messages on Amazon Live during Prime Day.\n  To deliver these enhanced shopping experiences for customers and for creators, low latency video is essential. It enables Amazon Live to synchronize the products featured in the live video with the products displayed in the carousel at the bottom of the video player. Low latency also allows the livestream hosts to answer customer questions in real-time. And, of course, on Prime Day in particular, all of this needed to happen at scale.\n  In order to do this, the Amazon Live team made use of the newly launched  Amazon Interactive Video Service (IVS). As  Martin explains in his recent post ( Amazon Interactive Video Service – Add Live Video to Your Apps and Websites), this is a managed live streaming service that supports the creation of interactive, low-latency video experiences. It uses the same technology that powers  Twitch, and allows you to deliver live content with very low latency, often three seconds or less (20 to 30 seconds is more common).\n  Infrastructure Event Management     AWS Infrastructure Event Management (IEM) helps our customers to plan and run large-scale business-critical events.This program is included in the  Enterprise Support plan and is available to  Business Support customers for an additional fee. IEM includes an assessment of operational readiness, identification and mitigation of risks, and the confidence to run an event with AWS experts standing by and ready to help.\n  This year, the TAMs (Technical Account Managers) that support the IEM program created a Control Room that was 100% virtual. A combination of  Slack channels and  Amazon Chime bridges empowered AWS service teams, AWS support, IT support, and Amazon Customer Reliability Engineering (thousands of people in all) to communicate and collaborate in real time.\n  Storage for Prime Day   Amazon DynamoDB powers multiple high-traffic Amazon properties and systems including  Alexa, the  Amazon.com sites, and all Amazon  fulfillment centers. Over the course of the 66-hour Prime Day, these sources made 16.4 trillion calls to the  DynamoDB API, peaking at 80.1 million requests per second.\n  On the block storage side,  Amazon Elastic Block Store (EBS) added 241 petabytes of storage in preparation for Prime Day; the resulting fleet handled 6.2 trillion requests per day and transferred 563 petabytes per day.\n  Content Delivery for Prime Day   Amazon CloudFront played an important role as always, serving up web and streamed content to a world-wide audience. CloudFront handled over 280 million HTTP requests per minute, a total of 450 billion requests across all of the Amazon.com sites.", "posttime": "2020-10-23 11:59:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,2020,prime", "title": "Amazon Prime Day 2020-由AWS提供支持", "title_en": "Amazon Prime Day 2020 – Powered by AWS", "transed": 1, "url": "https://aws.amazon.com/blogs/aws/amazon-prime-day-2020-powered-by-aws/", "via": "", "real_tags": ["amazon", "2020", "prime"]}, {"category": "", "categoryclass": "", "imagename": "981ae8f29c7020c06a40fd4a96d7a8a7.jpeg", "infoid": 1030704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我还想指出这个图表的周期性。在我所发现的世界上，没有一个系统是线性的，在这些时间尺度上是持续的。你需要一个周期性的商业模式，而不是线性的商业模式。\n我一直在收集世界上所有寿命最长的机构的数据。当你看这些的时候，有几件事很突出。通知：啤酒厂、啤酒厂、酒厂、酒店、酒吧、酒吧，对吗？还要注意的是，他们中的很多人都在日本。2000多年来，日本一直有一个粗糙的政府体系(皇室家族)，它的凝聚力足以让像日本皇家糖果制造商这样的公司成为世界上历史最悠久的公司之一。但也有庙宇建造者之类的。\n在西方，大多数存活了很长时间的公司基本上都是服务性公司。当一种特定的商品停用时，将自己重塑为一家面向服务的公司要比重塑为一家商品公司容易得多。\n高露洁棕榄(成立于01806)和杜邦(成立于01802)都是商品公司，它们的业务范围足够广泛，可以随着时间的推移改变他们销售的产品种类。我有兴趣了解更多关于这些公司的情况，因为它们的长寿故事可能都有某种特殊的调味汁。\n这项研究得出的另一个事实是，公司的寿命几乎以每年一年的速度缩短。在01950，财富500强中的平均公司已经有61年的历史了。现在已经18年了。公司的寿命越来越短。\n正如我提到的，世界上大多数历史最悠久的公司都在日本。在一项对5500家拥有200年以上历史的公司的调查中，有3100家总部设在日本。其余的在欧洲一些较老的国家。\n但是--这是一个我感到奇怪的事实，也说明了事物的周期性--90%的超过200年历史的公司只有300名或更少的员工；它们不是大公司。\n在对1000家拥有300年历史的公司进行调查时，你会发现它们所属的行业存在巨大的差异。但我发现有几个大的分组很有趣。23%的人从事酒类行业，这甚至不包括可能卖酒的酒吧、餐馆和酒店。\n帕特里克·麦戈文是一位生物分子考古学家，我在建造这段时间间隔时与他交谈过，他对藤蔓进行了DNA分析，藤蔓是一个克隆物种。从这个分析中，我们可以知道公元前8000年文明开始种植葡萄酒。麦戈文假设，完全不清楚文明停止游牧是为了发酵事物，还是因为它们开始发酵事物，它们就不再游牧了。这是一个有趣的关联，值得注意的是，在世界上历史最悠久的公司中，有一些占压倒性多数的公司从事酒类交易。\n关于价值观，简单说一句：长期思考，立志成为一家长期机构，从本质上讲并不是一件好事。长期以来，我们一直强调长期思考的重要性，而不是试图赋予它太多的价值。但我不认为这是理智上的诚实。我们必须扪心自问，我们试图延续的是什么。我们必须退得足够远，确保我们延续的这类事情总体上对社会有利。\n事情持续很长时间的一种方式就是花很长时间来建造它们。大教堂就是一个著名的例子。对于任何经久不衰的东西来说，最危险的时间实际上就是它建成后的一代人。这不再是一个新的、很酷的事情了；这是你父母曾经做过的事情，现在已经不酷了。直到又过了几代人，人们才开始重视它，很大程度上是因为它古老而古老，已经成为一种文化偶像。\n我们已经在这座大教堂中看到了这一点：巴塞罗那的Sagrada Familia。它仍在建设中，已经进行了125年的建设，它已经是联合国教科文组织的世界遗产。\n另一种方式是持续很长时间，这就是日本的模式，就是它们维护得非常好。\n大约有1400年的历史，这是世界上最古老的两座连续矗立的木结构建筑。他们已经更换了其中的很多部件。他们将屋顶保留在上面，即使在完全潮湿和下雨的环境中，这些建筑的中心木结构也保持完好。有趣的是，这座寺庙也是一千多年前一位日本公主梦见的地方，她需要向世界发出一种特殊的祈祷，以确保它能活到未来。因此，她确实有一百万座木塔，里面放着祈祷词，并尽可能地将这些小塔分布得更远更广。你现在还可以在易趣上买到这些。这是“大量拷贝保证物品安全”(LOCKSS)哲学的早期例子。\n神道教是一个万物有灵论的宗教，其追随者相信灵魂存在于一切之中，这与后来传入日本的佛教不同。在神道教的信仰体系中，寺庙有这种更新技术，如果你愿意的话，在不同时期，它们被重建在一个紧挨着的地方。这个在日本最有名的是伊势神社，每20年重建一次。几年前，我有幸参加了重建仪式。(我要补充的是，世界上最古老的公司之一是建造这些寺庙的日本寺庙建筑公司。\n这里的重点不是维护，而是更新。这些用茅草和木头建造的寺庙-完全是昙花一现的材料-已经持续了2000年。他们记录了1600年来精确重建的证据，但这个遗址是在公元4年建立的-也是由一位有远见的日本公主建立的。每隔20年，在日本公主的陪同下，他们会将宝藏从一座寺庙转移到另一座寺庙。卡米--灵魂--紧随其后。然后他们解构这座寺庙，那座古老的寺庙，他们把所有这些部分作为宗教文物送到日本的各个神道教寺庙。\n我认为这个例子最重要的一点是，每一代人都有这样一个时刻，那就是年长的师傅教徒弟这门手艺。因此，你得到了这种知识的传递，这些知识是极其有形和真实的，而且是可以交付的。它得装船，对吧？“公主要来搬东西了，我们必须这么做。”这是一个为期八年的过程，重建这些寺庙需要大量的仪式。\n我认为一个有趣的反例是，持续很长时间的事情归因于某些意识形态。我认为这很奇怪，我们寿命最长的机构之一是天主教会，像佛陀的奥巴马式的意识形态一直延续着，但许多文物成为不相信这种意识形态的人的攻击目标。塔利班花了几个星期的时间炸毁和使用大炮摧毁这些佛像。你可能会认为佛教，一个相对无害的宗教，是没有威胁的-但对塔利班并没有太大的威胁。\n这就是博洛尼亚大学，它在很大程度上被认为是世界上最早的大学。在这一点上，它几乎有1000年的历史了。牛津大学紧随其后。另外还有大约40所有500多年历史的大学。\n大学有能力进行一种持续的更新，每四年一次，特别是在本科课程中，你会有一群全新的人。因此，他们每年都要把自己卖给新一代。他们的顾客是全班的。我们看到，大学现在苦苦挣扎，因为它们没有向人们教授相关的东西，它们必须调整。这让它们成为世界上寿命最长的机构之一。\n我认为实践社区的想法真的很有趣。在这些社区，实践知识代代相传。武术就是这样，我们有证据证明它至少可以追溯到2000或3000年前。\n自然界中有几种策略可以让系统持续数千年。有像白杨树这样的克隆策略。我们在沙漠中测量了麦斯奎特环，在那里它们死亡，然后它们从根部结构成长为一个环，这表明麦斯奎特环具有相同的DNA，有效地持续了5万年。这些克隆森林肯定已经存在了几千年，尽管在某些情况下每个个体只会持续几年。\n在其他情况下，东西是有教养的。回到葡萄酒的例子，我们知道我们有有效的克隆物种的DNA，就像这些来自古罗马的葡萄，我们在那里修剪并一代又一代地培育它。因此，人类和自然界之间存在着这种相互作用，我们在许多爱护树木的实践中也看到了这一点。\n刚毛虫说明了一场事关生存的危机是如何让你在如何生存的问题上进行实践的。刺毛素是我们所知的世界上最古老的持续存活的单一生物体。关于马尾松有趣的是，它并不是通过去核发现的，它不是世界上现存的最古老的物种；它被推测是因为一位特定的树木科学家已经为其他松树物种取了核，当他们这样做的时候，他们发现所有处于最糟糕环境中的松树都是最古老的。他说：“如果你能找到生活在绝对最恶劣环境中的松树物种，你就会发现世界上最古老的松树物种。”他创造了这个术语：逆境孕育长寿。然后人们去寻找环境最恶劣的松树，在内华达州的怀特山山顶和蛇山脉，还有一些在科罗拉多州，他们发现了三种不同的猪皮松，到目前为止已经有5000多年的历史了。\n如果我们中的任何一个人要建立一个能持续几百年或1000年的制度，人口和气候的变化是其中很大的一部分。这是直到20世纪80年代气候变化对农业产量的预测影响。正如你所看到的，全球南部的农业产量将会下降。在全球北部和更远的北部，更像加拿大和俄罗斯，他们将会变得更好。这将改变世界市场、世界人口，以及我们未来100年的战争。\n在所有的自然系统中，你都有这些S型曲线，事情总是往下走。我们总是假设我们的人口和经济总是会增长，但这不是世界运行的方式；从来都不是这样的，我们总是会有这样的修正。在这种情况下，捕食者作为下乙状窦跟随猎物。一旦猎物耗尽，捕食者就开始灭绝。\n我们怎样才能善于失败，但又不会完全消亡呢？山猫永远不会完全灭绝，但当这一件事不再是主要商品时，做一件事的公司在复苏方面表现不佳。发明iTunes的不是唱片公司，而是一家局外人公司。唱片公司擅长销售塑料圈，当没有塑料圈出售音乐时，他们不知道如何调整。任何能持续很长时间的事情的关键是：你如何善于重新设计和重新装备？\n从现在起至少一百年，如果不是从现在起不到50年，我没有看到过世界人口不开始下降的情况。\n所以即使是中间的投影，中间的那条红线，也会逐渐变小。但是这些数据已经有几年的历史了，现在看起来越来越像底部的蓝线虚线了。除了几个短暂的瘟疫季节外，世界真的从未经历过一段时间，在那里，世界人口在下降-进而，客户基础也在下降。\n比人口减少更危险的是人口正在变化。这里的红线是15到64岁的人数。蓝线是0到14岁的青少年。如果世界主要是由老年人组成的，他们囤积财富，不努力工作，不像20岁的年轻人那样为世界做出巨大的创造力贡献，那么这个世界就是一个我认为我们现在还没有准备好生活在其中的世界。\n我们现在看到这种情况正在许多发达国家发生，最明显的是在日本。记得20世纪80年代的人还记得，没有哪种情况下日本不是世界经济的绝对主导部分。而现在，他们正在努力在很多方面保持相关性，这在很大程度上是因为人口变化发生了，而年轻人并不在那里。他们不允许任何移民，这种创造力和文明的推动力，从一个占主导地位的世界经济强国中消失了。\n观看亚历山大·罗斯(Alexander Rose)关于长寿机构数据的演讲视频：", "note_en": "I want to lead you through some of the research that I’ve been doing on a meta-level around long-lived institutions, as well as some observations of the ways various systems have lasted for hundreds of thousands of years.\n   This is one of the early projects I worked with  Stewart Brand on at Long Now. We were trying to define our problem space and explore the ways we think on different timescales. Generally, companies are working in the “nowadays,” although that’s been shortening to some extent, with more quarterly thinking than decade-level thinking.\n It was  Peter Schwartz who suggested this 10,000 year timeframe.  Danny Hillis’ original idea for what would ultimately become  The 10,000 Year Clock was that it would be a Millennium Clock: it would tick once a year, bong once a century, and the cuckoo would come out once a millennium. He didn’t really have an end date.\n We use the 10,000 year time frame to orient our efforts at Long Now because global civilization arose when the last Interglacial period ended 10,000 years ago. It was only then, around 8,000 BC, that we had the emergence of agriculture and the first cities. If we can look back that far, we should be able to look forward that far. Thinking about ourselves as in the middle of a 20,000 year story is very different than thinking about ourselves as at the end of a 10,000 year story.\n  This pace layers diagram is the very first thing I worked on at Long Now. The  notion of pace layers came out of a discussion between Stewart and Long Now co-founder Brian Eno. They were trying to tease apart these layers of human time.\n Institutions can be mapped across the pace layers diagram as well. Take Apple Computer, for example. They’re coming out with new iPhones every six months, which is the fashion layer. The commerce layer is Apple selling these devices. The infrastructure layer is the cell phone networks and chip fabs that it’s all built on. The governance layer—and note that it is governance, not government; they’re mostly working with governments, but they also have to work with general governing systems. Some of these companies are hitting walls against different types of governments who have different ideas of privacy, different ideas of commercialization, and they’re now having to shape their companies around that. And then obviously, culture is moving slower underneath all of this, but Apple is starting to affect culture. And then there’s the last pace layer, nature, moving the slowest. At some point, Apple is going to have to come to terms with the level of environmental damage and problems that are happening on the nature pace layer if it is going to be a company that lasts for hundreds or a thousand years. So we could imagine any large institution mapped across this and I think it’s a useful tool for that.\n Also very early on in Long Now’s history, in 01997, Kees van der Heijden, who  wrote the book on scenario planning, came to a charrette that Long Now organized to come up with business ideas for our organization. He formulated a business plan that was strangely prophetic:\n  The squares are areas where we have core competencies. The dotted lines indicate temporary competencies, like the founders. The other items indicate all the things we hadn’t really gotten to yet or figured out: we didn’t have a way of funding ourselves; we didn’t have a membership program; we didn’t have a large community of donors; we didn’t have an endowment; and we didn’t have people willing to give their estates to us. We still don’t have an endowment or people willing to give us our estates, but we’ve achieved the rest. And now that we’ve been around for 22 years, we can imagine how those two items are going to start to happen next.\n I also want to point out the cyclical nature of this diagram. There’s no system in the world that I’ve found that is linear that has lasted on these timescales. You need to have a cyclical business model, not a linear business model.\n   I’ve been collecting data on all of the longest lived institutions in the world. As you look at these, there’s a few things that stick out. Notice: brewery, brewery, winery, hotel, bar, pub, right? And also notice that a lot of them are in Japan. There’s been a rough system of government there for over 2,000 years (the Royal Family) that’s held together enough to enable something like the Royal Confectioner of Japan to be one of the oldest companies in the world. But there’s also temple builders and things like that.\n In the West, most of the companies that have survived for a very long time are basically service companies. It’s a lot easier to reinvent yourself as a service-oriented company than it is as a commodity company when that particular commodity goes out of use.\n  Colgate Palmolive (founded 01806) and DuPont (founded 01802) are commodity companies that are broad enough to change the kinds of products they sell over time. I’m interested in learning more about all these companies, as they probably all have some kind of special sauce in their stories of longevity.\n Something else that came out of this research is the fact that the length of company’s lives is shrinking at almost one year per year. In 01950, the average company on the Fortune 500 had been around for 61 years. Now it’s 18 years. Companies’ lives are getting shorter.\n  As I mentioned, most of the oldest companies in the world are in Japan. In a survey of 5,500 companies over 200 years old, 3,100 are based in Japan. The rest are in some of the older countries in Europe.\n But—and this was a fact I found curious, and one that speaks to the cyclical nature of things—90% of the companies that are over 200 years old have 300 employees or less; they’re not mega companies.\n  In surveying 1,000 companies over 300 years old, you find a huge amount of disparity concerning which industries they’re a part of. But there were a few big groupings that I found interesting. 23% are in the alcohol industry, and this doesn’t even include pubs and restaurants and hotels that may sell alcohol.\n Patrick McGovern, a biomolecular archeologist who I talked to when we were building  The Interval, has done DNA analysis on vines, which are a clonal species. From that analysis, we  know that civilization started cultivating wine 8,000 BC. McGovern supposes that it’s not at all clear if civilization stopped being nomadic in order to ferment things, or because they started fermenting things, they stopped being nomadic. It’s an intriguing correlation, and notable that some of this overwhelmingly large segment of the oldest companies in the world deal in alcohol.\n   A quick word about values: long-term thinking, and aspiring to be a long-term institution, is not inherently good. At Long Now, we’ve always emphasized the importance of long-term thinking without trying to ascribe a lot of values to it. But I don’t think that’s intellectually honest. We have to ask ourselves what we’re trying to perpetuate. We have to step back far enough and ensure that the kinds of things we’re perpetuating are generally good for society.\n   One way that things have lasted for a really long time is to just take a really long time to build them. Cathedrals are a famous example of this. The most dangerous time for anything that’s lasting is really just one generation after it was built. It’s no longer a new, cool thing; it’s the thing that your parents did, and it’s not cool anymore. And it’s not until another couple generations later where everyone values it, largely because it is old and venerable and has become a kind of cultural icon.\n  And we already see this with this cathedral: the Sagrada Familia in Barcelona.  It’s still under construction, 125 years into its build process, and it’s already a UNESCO World Heritage Site.\n  The other way things last for a really long time, and this is the Japanese model, is that they’re just extremely well-maintained.\n At about 1,400 years old, these are the two oldest continuously standing wooden structures in the world. And they’ve replaced a lot of parts of them. They keep the roofs on them, and even in a totally humid and raining environment, the central timbers of these buildings have stayed true. Interestingly, this temple was also the place where, over a thousand years ago, a Japanese princess had a vision that she needed to send a particular prayer out to the world to make sure that it survived into the future. And so she had, literally, a million wooden pagodas made with the prayer put inside them, and distributed these little pagodas as far and wide as she could. You can still buy these on eBay right now. It’s an early example of the philosophy of  “Lots of Copies Keep Stuff Safe” (LOCKSS).\n   Shinto is an animist religion whose adherents believe that spirits are in everything, unlike Buddhism, which came to Japan later. In the Shinto belief system, temples have this renewing technology, if you will, where they’re rebuilt in a site right next to each other in different periodicities. This one, which is the most famous in Japan, is the Ise Shrine, which is rebuilt every 20 years. A few years ago,  I was fortunate enough to attend the rebuilding ceremony. (One of the oldest companies in the world, I should add, is the Japanese temple building company that builds these temples.\n The emphasis here is not on maintenance, but renewal. These temples made of thatch and wood—totally ephemeral materials—have lasted for 2,000 years. They have documented evidence of exact rebuilding for 1,600 years, but this site was founded in 4 AD—also by a visionary Japanese princess. And every 20 years, with the Japanese princess in attendance, they move the treasures from one from one temple to the other. And the  kami—the spirits—follow that. And then they deconstruct the temple, the old one, and they send all those parts out to various Shinto temples in Japan as religious artifacts.\n I think the most important thing about this particular example is that each generation gets to have this moment where the older master teaches the apprentice the craft. So you get this handing off of knowledge that’s extremely physical and real and has a deliverable. It’s got to ship, right? “The princess is coming to move the stuff; we have to do this.” It’s an eight year process with tons of ritual that goes into rebuilding these temples.\n  I think an interesting counterexample to things lasting a very long time is when they ascribe to certain ideologies. And I think it’s curious, one of our longest lived institutions is the Catholic Church, and the ideology of something like the Buddha’s Obamian has lasted, but a lot of the artifacts become targets for people who don’t believe in that ideology. The Taliban spent weeks dynamiting and using artillery to destroy these Buddhas. You would think that Buddhism, a relatively innocuous religion, is unthreatening—but not so much to the Taliban.\n  This is the University of Bologna, which is largely credited as the earliest university in the world. It’s almost 1000 years old at this point. Oxford was shortly behind it. And there’s another 40 or so universities over 500 years old.\n Universities have this ability to do a kind of continual refresh where every four years, especially in undergraduate programs, you have a whole new set of people. And so they have to sell themselves to a new generation every single year. Their customer is a whole class. And we see universities now struggle when they aren’t teaching relevant things to people and they have to adjust. And that has kept them around as some of the longest lived institutions in the world.\n  I think the idea of communities of practice is a really interesting one. In these communities, knowledge of practice is handed down from generation to generation. Such is the case with martial arts, which we have evidence for dating back at least 2,000 or 3,000 years.\n  There’s several strategies in nature that allow systems to last for thousands of years. There’s clonal strategies like the Aspen tree. We’ve measured Mesquite rings in the desert where they die and then they grow up in a ring from the root structure that indicates that a Mesquite ring has the same DNA, effectively for 50,000 years. And these clonal forests have definitely been around for thousands of years, even though each individual will only last a few years in some cases.\n  In other cases, things are cultivated. Going back to the wine example, where we know we have effectively the DNA of clonal species like these grapes from ancient Rome where we have taken a clipping and cultivated it from generation to generation. So there’s been this kind of interplay between humans and the natural world and we also see this in a lot of tree-caring practices.\n  The bristlecone exemplifies how an existential crisis gives you practice in terms of how you’re going to survive. The bristlecone is the oldest continuously living single organism that we know of in the world. And the funny thing about the bristlecone is it was not discovered by coring to be the oldest living species in the world; it was postulated because a particular tree scientist had cored other pine species, and as they did that, they found that all the ones in the worst environments were the oldest. And he said: “If you can find the pine species that is living in the absolute worst environment, you will find the oldest species of pine in the world.” And he coined this term:  adversity breeds longevity. And so then people went to go find the pines in the worst environment and up at the top of the White Mountains and in the Snake Range in Nevada, and some in Colorado as well, they found three different species of bristlecone, which have been dated to over 5,000 years at this point.\n   If any of us are to build an institution that’s going to last for the next few hundred or 1,000 years, the changes in demographics and the climate are a big part of it. This is the projected impact of climate change on agricultural yields until the 02080s. And as you can see, agricultural yields in the global south are going to be going down. In the global north and the much further north, more like Canada and Russia, they’re going to be getting a lot better. And this is going to change the world markets, world populations, and what we’re warring over for the next 100 years.\n  In all natural systems, you have these sigmoid curves that things always go down. We are always assuming things like our population and our economies to always go up, but that is not the way the world works; it has never been that way, and we always have these kinds of corrections. In this case, a predator follows the prey as a lower sigmoid. Once its prey runs out, then the predators start dying off.\n How do we get good at failing, but not totally dying out? The lynx never dies out totally, but companies that do one thing are bad at recovering when that one thing is no longer the big commodity. It wasn’t record companies that invented iTunes; it was an outsider company. Record companies were adept at selling plastic circles and when there were no plastic circles to sell music on, they didn’t know how to adjust for that. The crux of anything that’s going to last for a long time is: how do you get good at reinvention and retooling?\n  There’s no scenario that I’ve seen where the world population doesn’t start going down by at least a hundred years from now, if not less than 50 years from now.\n So even the median projection, that red line in the middle, tapers off. But this data is a couple of years old, and it’s now starting to increasingly look a lot more like that dotted blue line at the bottom. And the world has really never lived through a time, except for a few short plague seasons, where the world population was going down—and, by extension, where the customer base was going down.\n  Even more dangerous than the population going down is that the population is changing. The red line here is the number of 15 to 64 year olds. And the blue line is the zero to 14 year olds. If the world is made up largely of older people who hoard wealth, don’t work hard, and don’t make huge contributions of creativity to the world the way 20 year olds do, that world is a world that I don’t think we’re prepared to live in right now.\n  We’re seeing this now happening in a lot of the developed world and most notably in Japan. Those of you who remember the 01980s recall that there was no scenario where Japan was not an absolute dominant part of the economy of the world. And now they’re struggling just to be relevant in a lot of ways, and it’s largely because this population change happened and the young people were not there. They wouldn’t allow any immigration, and that creativity, and that thrust of civilization, went out of a country that was a dominant world economic power.\n Watch the video of Alexander Rose’s talk on the Data of Long-lived Institutions:", "posttime": "2020-10-23 11:48:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机构,long", "title": "长寿机构的数据", "title_en": "The Data of Long-Lived Institutions", "transed": 1, "url": "https://blog.longnow.org/02020/10/21/the-data-of-long-lived-institutions/", "via": "", "real_tags": ["机构", "long"]}, {"category": "", "categoryclass": "", "imagename": "061e3ea8b92a8eb6d4aa5fb470a93d95.jpg", "infoid": 1030702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们有一个很大的世界要建设。在这次演讲中，我将讨论一些已经建成的很酷的东西，以及我们仍然需要的很酷的东西。\r\r埃文·普罗德罗姆", "note_en": "We have a big world to build. \rIn this talk, I’ll discuss some of the cool stuff that’s been built, and cool stuff we still need.\r\rEvan Prodromou", "posttime": "2020-10-23 09:47:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "酒吧,pub,世界", "title": "活动酒吧生态系统", "title_en": "The Activity Pub Ecosystem", "transed": 1, "url": "https://conf.tube/videos/watch/c79457a9-aae5-47dd-8731-617e6b09fe06", "via": "", "real_tags": ["酒吧", "pub", "世界"]}, {"category": "", "categoryclass": "", "imagename": "3d3d4dc73049d479ef0bdc305446de7b.jpg", "infoid": 1030701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们都见过，一个似乎不知道如何关闭Caps Lock按钮的笨蛋，或者更糟糕的是，故意这样做的人不知何故感觉它更能让人理解他们的意思。在一个特殊的案例中，甚至有人认为Caps Lock让他们的简历看起来更专业。我们到底该拿这样的人怎么办呢？我们干脆发起移除大写锁定按钮的运动怎么样？\nCaps Lock(大写锁定)指的是计算机键盘上的按钮，所有西里尔文和拉丁文的字母都是用大写字母生成的。如果您再次按该键，则操作将反转，然后所有内容都将以小写形式键入。现在很多键盘上的Caps Lock(大写锁定)按钮上都有灯，这样你就能知道它何时打开和关闭。然而，有很多较老的型号可以让你保持诚实，因为钥匙上没有任何关于它是否在Caps上的指示。\n我们中的很多人都有过这样的经历：你没有意识到你已经打开了Caps Lock按钮，而你却完全用大写字母给某人发送了一条信息。如果你和我们一样，那么你很可能会接着发一条消息，比如“哎呀，对不起，我不是故意要大喊大叫的。”\n不过，也有一些人喜欢使用Caps Lock来传达他们的观点。这可能会使消息的接收者感到有点沮丧。这就像是通过电话被喊叫一样，不是吗？嗯，大写锁定日对于所有憎恨过度使用大写锁定按钮的人来说是一个幸福的日子。是时候享受一下视觉上的宁静和宁静了！\n如果你是一个喜欢用Caps Lock按钮玩一下OTT的人，那很好，但希望在Caps Lock Day被选中。也许是时候关掉Caps Lock了，让每个人在视觉上都不会头疼一天？\n2000年，爱荷华州的德里克·阿诺德(Derek Arnold)第一次举办了“大写锁定日”(Caps Lock Day)，当时他和其他许多互联网用户一样，觉得自己已经受够了使用全大写来在网络上强调自己的人。因此，他创建了Caps Lock Day，目的是取笑那些使用这种令人厌恶的打字风格的人，并最终给网络带来一些理智。\n有一些协议使得在所有Caps中发布都是合适的，例如当作为天气监测网络的一部分发布时。在这种罕见的情况下，所有的大写字母都是用来表示某件事实际上很重要的，它的首字母缩略词和速记的集合确保了它的清晰度。在这种情况下，所有的大写字母都是你表示某事事实上重要的方式。\n我们还可以更深入地研究一下这个有争议的键盘按钮的历史。在机械打字机上，Caps Lock键首先是Shift Lock键。打字机使用的早期创新之一是在每个打字条上添加第二个字符。这导致在使用相同数量的按键的情况下，一个人能够键入的字符数增加了一倍。\n第二个字符位于每个打字栏表面第一个字符的上方，Shift键将使设备整体移动，物理上使打字栏位置相对于INX的色带移动。就像今天的当代电脑键盘一样，移动的位置被用来创造次要字符和产品大写。\n换档锁钥匙的发明是为了不需要连续的努力就能无限期地保持换档操作。打字条被机械地锁定在一个移动的位置，导致当按下任何键时都会键入上面的字符。\n这也被认为可以降低重复打字引起的手指肌肉疼痛，因为在此之前连续按住移位两三次以上可能是有挑战性的。\n在机械打字机上，通常会同时按Lock和Shift键。在此之后，您可以自行按Shift键以释放锁。\n庆祝大写锁定日的最好方式很简单，不要使用大写锁定！更好的是，在社交媒体、MMO和你能想象到的任何其他媒体上提醒你的朋友，在交流中使用Caps Lock的可怕习惯。\n你也可以发起一场具有讽刺意味的活动，整天使用大写锁定来发表更明目张胆的声明，说明这会让其他人看起来是什么样子。发送你的表情包，戳你的朋友，让他们都知道是时候接受正确的语法了，不要再看起来像个彻头彻尾的笨蛋了。", "note_en": "We’ve all seen it, that one moron who doesn’t seem to know how to turn off the Caps Lock button, or worse, people who deliberately do it somehow feeling it gets their point across better. In one particular case, there was even a person who felt that Caps Lock made their RESUME look more professional. What in the world are we to do with people like this? How about we just campaign to remove the Caps Lock Button?\n  Caps Lock simply refers to the button on a computer keyboard that results in all letters of Cyrillic and Latin based scripts being generated in capital letters. If you hit the key again, the action is reversed, and everything is then typed in lowercase. A lot of keyboards today have a light on the Caps Lock button, so you know when it is switched on and off. However, there are a lot of older models that keep you honest, as the key does not have any indication as to whether it is on Caps or not.\n  A lot of us have been there: you don’t realize you have had the Caps Lock button switched on, and you send someone a message in capital letters entirely. If you are like us, you will probably then follow up with a message such as “oops, sorry, I didn’t mean to shout.”\n There are some people, though, who like to use Caps Lock to get their point across. It can then cause the recipient of the message to get a little bit frustrated. It’s like being shouted at through a phone, isn’t it? Well, Caps Lock Day is a day of bliss for all of your folk out there who hate people who overuse the Caps Lock button. It’s time for a bit of visual peace and serenity!\n If you are someone who likes to go a bit OTT with the Caps Lock button, that’s fine, but expect to be picked up on this on Caps Lock Day. Maybe it is time to turn the Caps Lock off and save everyone a visual headache for one day?\n  Caps Lock Day first came to pass in the year 2000, when Derek Arnold of Iowa decided that he, like so many other internet users, had simply had enough of people using all caps to emphasize themselves on the web. So he created Caps Lock Day in the interest of poking fun at people who use this abomination of a typing style, and to finally bring some sanity to the net.\n  There are some protocols that make it appropriate to post in all Caps, such as when posting as part of a weather monitoring network. In this rare and perhaps singular case, all caps are how you indicate that something is in fact of importance, and with its collection of acronyms and shorthand makes sure its clear.\n We can also delve a little bit deeper into the history of this controversial keyboard button. On mechanical typewriters, the Caps Lock key was first the Shift lock key. One of the earlier innovations in the use of typewriters saw a second character being added to each typebar. This caused the number of characters that a person was able to type to be doubled with the same number of keys being used.\n The second character was located above the first on each typebar’s face, and the Shift key would cause the apparatus in its entirety to move, physically shifting the typebars position relative to the ribbon of inx. Just like in contemporary keyboards for computers today, the shifted position was used to create secondary characters and product capitals.\n The invention of the Shift lock key was for the purpose of maintaining the shift operation indefinitely without continual effort. The typebars were mechanically locked in a shifted position, resulting in the upper character being typed when any key was pressed.\n  This was also supposed to lower finger muscle pain caused by repetitive typing because it could be challenging to hold the shift down for more than two or three consecutive strokes prior to this.\n On mechanical typewriters, you would typically hit both Lock and Shift at the same time. After this, you press shift by itself in order to release the lock.\n  The best way to Celebrate Caps Lock Day is quite simple, don’t use caps lock! Even better, remind your friends on social media, MMO’s, and every other medium you can imagine about the horrid habit that is using Caps Lock in communications.\n You can also start an ironic campaign of using CAPS LOCK all day to make a more blatant statement about how this makes other people look. Send your memes, poke your friends, let them all know that it’s time to embrace proper grammar and stop looking like a complete half-wit.", "posttime": "2020-10-23 07:22:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "国际,caps", "title": "今天是国际帽子锁定日", "title_en": "IT'S INTERNATIONAL CAPS LOCK DAY", "transed": 1, "url": "https://www.daysoftheyear.com/days/caps-lock-day/", "via": "", "real_tags": ["国际", "caps"]}, {"category": "", "categoryclass": "", "imagename": "084859d72b5b9b1233be677f4ccee877.png", "infoid": 1030700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为Android开发人员，我们通常可以将我们的后端视为在云中运行的魔盒，忠实地返回给我们JSON。在Netflix，我们采用前端后端(BFF)模式：每个客户端(Android/iOS/TV/Web)有一个后端，而不是一个通用的“后端API”。在Android团队中，虽然我们的大部分时间都花在应用程序上，但我们也负责维护我们的应用程序与之通信的后端及其编排代码。\n最近，我们完成了一个为期一年的项目，重新设计了我们的后端，并将其与以前使用的集中式模型分离。我们在没有放慢发布节奏的情况下进行了这次迁移，并且特别小心地避免了对用户体验的任何负面影响。我们从单一服务中本质上无服务器的模型发展到部署和维护托管我们的应用程序后端端点的新微服务。这使得Android工程师可以更好地控制和观察我们获取数据的方式。在这篇文章中，我们将讨论我们的迁移方法，我们采用的策略，以及我们为支持这一迁移而构建的工具。\nNetflix Android应用程序使用Falcor数据模型和查询协议。这允许应用程序查询每个HTTP请求中的“路径”列表，并获得我们用来缓存数据和更新UI的特殊格式的JSON(JsonGraph)。如前所述，每个客户端团队都拥有各自的端点：这实际上意味着我们正在为查询中的每个路径编写解析器。\n例如，要呈现此处显示的屏幕，应用程序发送如下所示的查询：\n路径从根对象开始，后跟我们要检索其数据的键序列。在上面的代码片段中，我们正在访问ID为80154610的视频对象的细节键。\n在上面的示例中，应用程序需要的数据由不同的后台微服务提供服务。例如，Artwork服务与视频元数据服务是分开的，但我们需要详细信息键中两者的数据。\n我们使用API团队提供的库在端点代码上进行此编排，该库公开RxJava API来处理对各种后端微服务的下游调用。我们的端点路由处理程序使用此API有效地获取数据(通常跨越多个不同的调用)，并将其传递到UI期望的数据模型中。我们编写的这些处理程序被部署到API团队运行的服务中，如下图所示。\n如您所见，我们的代码只是这个整体服务的一部分(图中的#2)。除了托管我们的路由处理程序之外，该服务还处理以容错方式进行下游调用所需的业务逻辑。虽然这为客户团队提供了一个非常方便的“无服务器”模型，但随着时间的推移，我们在这项服务上遇到了多个运营和Devex挑战。您可以在我们以前的帖子中阅读更多关于这方面的内容：第1部分，第2部分。\n很明显，我们需要将端点代码(归每个客户端团队所有)与容错下游调用的复杂逻辑隔离。从本质上讲，我们希望将客户端特定的代码从这个整体分解到它自己的服务中。我们尝试了这个新服务应该是什么样子的几次迭代，最终确定了一个旨在为客户端团队提供更多API体验控制的现代架构。它是一个Node.js服务，使用可组合的JavaScript API进行下游微服务调用，取代了旧的Java API。\n作为Android开发人员，我们已经开始依赖像Kotlin这样的强类型语言的安全性，也许还有Java的一面。因为这个新的微服务使用Node.js，所以我们不得不用JavaScript编写端点，这是我们团队中的许多人都不熟悉的语言。关于为什么选择Node.js生态系统作为这项新服务的上下文值得一篇文章。对我们来说，这意味着在编写路由时，我们现在需要打开大约15个MDN选项卡：)。\n让我们简要讨论一下这个微服务的体系结构。它看起来像Node.js世界中非常典型的后端服务：Restify、HTTP中间件堆栈和基于Falcor的API的组合。我们将略过这个堆栈的细节：总体思路是我们仍在为[Videos，&lt；id&gt；，Detail]这样的路径编写解析器，但我们现在用JavaScript编写它们。\n然而，与单一的服务最大的不同在于，它现在是一个独立的服务，在我们的云基础设施中作为单独的“应用程序”(服务)部署。更重要的是，我们不再只是从服务中运行的端点脚本的上下文中获取和返回请求：我们现在有机会完整地处理HTTP请求。从“终止”公网网关的请求开始，然后向下调用API应用程序(使用前面提到的JS API)，并构建响应的各个部分。最后，我们从服务返回所需的JSON响应。\n在我们看这一变化对我们意味着什么之前，我们想先谈谈我们是如何做到这一点的。我们的应用程序有大约170条查询路径(想想路由处理程序)，所以我们必须找出一种迭代的方法来进行迁移。让我们来看看我们在应用程序中构建了什么来支持此迁移。回到上面的屏幕截图，如果你在该页面再往下滚动一点，你会看到标题为“More Like This”的部分：\n正如您可以想象的那样，这不属于此标题的视频详细信息数据。相反，它是一条不同道路的一部分：[视频，&lt；id&gt；，Similars]。这里的总体思路是，每个UI屏幕(活动/片段)都需要来自多个查询路径的数据来呈现UI。\n为了让我们自己为端点技术堆栈的重大变化做好准备，我们决定跟踪响应查询所用的时间。在与我们的后端团队进行了一些协商之后，我们确定了按UI屏幕对这些指标进行分组的最有效方式。我们的应用程序使用存储库模式的一个版本，其中每个屏幕都可以使用查询路径列表获取数据。这些路径与其他一些配置一起构建一个任务。这些任务已经带有唯一标识每个屏幕的uiLabel：该标签成为我们的起始点，我们将其作为头传递给我们的端点。然后，我们使用它来记录响应每个查询所用的时间，按uiLabel分组。这意味着我们可以通过屏幕跟踪用户体验的任何可能的倒退，这与用户在应用程序中导航的方式相对应。我们将在后面的章节中更多地讨论我们如何使用这些指标。\n快进一年：我们开始时的170个数字缓慢但肯定地减少到0，我们所有的“路由”(查询路径)都迁移到了新的微服务。那么，事情进行得怎么样了，…。？\n今天，这种迁移已经完成了很大一部分：我们的大部分应用程序都是从这项新的微服务中获取数据的，希望我们的用户不会注意到这一点。与任何这种规模的迁移一样，我们在这一过程中遇到了一些坎坷：但首先，让我们看看好的部分。\n我们的“巨石”已经存在很多年了，在创建时并没有考虑到功能和单元测试，所以这些都是由每个UI团队独立地固定在一起的。对于移民来说，Testing是一等公民。虽然没有技术原因阻止我们更早地添加完整的自动化覆盖范围，但在迁移每个查询路径时添加它要容易得多。\n对于我们迁移的每条路由，我们希望确保不会引入任何倒退：无论是以丢失(或更糟糕的是，错误的)数据的形式，还是通过增加每个端点的延迟。如果我们将问题缩减到绝对基础，我们实际上有两个返回JSON的服务。我们希望确保对于作为输入的一组给定路径，返回的JSON始终完全相同。在其他平台和后端团队的大量指导下，我们采取了三管齐下的方法来确保每条迁移路线的正确性。\n功能测试是所有测试中最直接的：每条路径旁边的一组测试都对新旧端点进行测试。然后，我们使用了优秀的Jest测试框架和一组自定义匹配器，这些匹配器清理了一些东西，比如时间戳和uuid。它在开发过程中给了我们很高的信心，并帮助我们覆盖了我们必须迁移的所有代码路径。测试套件自动化了一些事情，比如设置测试用户，以及匹配真实设备发送的查询参数/头：但仅此而已。功能测试的范围仅限于已经设置的测试场景，但我们永远无法复制全球数百万用户使用的各种设备、语言和区域设置组合。\n这是一个自包含的流，按照设计，它捕获了整个请求，而不仅仅是我们请求的一条路径。此测试最接近生产：它重放设备发送的真实请求，从而执行我们的服务部分，即从旧端点获取响应，并将它们与来自新端点的数据缝合在一起。这个重放管道的彻底性和灵活性在它自己的帖子中得到了最好的描述。对我们来说，重放测试工具让我们确信我们的新代码几乎没有bug。\n金丝雀金丝雀是“审查”我们新的路由处理程序实现的最后一步。在此步骤中，管道选择我们的候选更改，部署服务，使其可公开发现，并将一小部分生产流量重定向到此新服务。您可以在Spinnaker Canaries文档中找到更多关于这是如何工作的详细信息。\n这就是我们前面提到的uiLabel指标变得重要的地方：在金丝雀期间，Kayenta被配置为捕获并比较所有请求的这些指标(除了已经被跟踪的系统级指标之外，比如服务器CPU和内存)。在金丝雀周期结束时，我们得到了一份报告，该报告汇总并比较了特定UI屏幕发出的每个请求的百分位数。通过查看我们的高流量UI屏幕(如主页)，我们可以在为所有用户启用端点之前确定端点造成的任何倒退。这里有一份这样的报告，可以让你对它的样子有个大概的了解：\n每个确定的回归(像这个)都要经过大量的分析：追查其中的几个会导致以前未确定的性能收益！能够为新路由设置金丝雀，使我们可以验证延迟和错误率是否在可接受的范围内。这种类型的工具需要时间和精力来创建，但最终，它提供的反馈是非常物有所值的。\n许多Android工程师会熟悉Systrace或Android Studio中优秀的分析器之一。想象一下，为您的端点代码获得类似的跟踪，遍历许多不同的微服务：这就是分布式跟踪提供的有效功能。我们的微服务和路由器已经集成到Netflix请求跟踪基础设施中。我们使用Zipkin来使用跟踪，这允许我们按路径搜索跟踪。下面是典型的跟踪：\n请求跟踪对于Netflix基础设施的成功至关重要，但当我们在单机版中运行时，我们无法详细了解我们的应用程序是如何与各种微服务交互的。为了说明这对我们有何帮助，让我们放大图片的这一部分：\n很明显，这里的调用正在被序列化：然而，在这一点上，我们已经与微服务断开了大约10个跃点。通过查看原始数据，很难得出这样的结论，也很难发现这样的问题：无论是在我们的服务上还是在上面的测试服务上，更难将它们归因于确切的UI平台或屏幕。有了Netflix微服务生态系统中丰富的端到端跟踪功能，并且可以通过Zipkin轻松访问，我们能够非常迅速地将此问题分流给负责的团队。\n正如我们前面提到的，我们的新服务现在拥有请求生命周期的“所有权”。以前我们只将Java对象返回给API中间件，现在服务中的最后一步是将JSON刷新到请求缓冲区。所有权的增加使我们有机会在这一层轻松测试新的优化。例如，通过大约一天的工作，我们有了一个使用二进制msgpack响应格式而不是普通JSON的应用程序原型。除了灵活的服务架构外，这还可以归功于Node.js生态系统和丰富的NPM包选择。\n在迁移之前，端点上的开发和调试非常痛苦，因为部署缓慢且缺乏本地调试(本文详细介绍了这一点)。Android团队做这个迁移项目的最大动机之一就是改善这种体验。新的微服务通过在本地Docker实例中运行该服务，为我们提供了快速部署和调试支持，从而显著提高了工作效率。\n在打破一块巨石的艰难过程中，你可能会得到一两块锋利的碎片。下面的很多内容都不是Android特有的，但是我们想简单地提一下这些问题，因为它们最终确实影响了我们的应用程序。\n旧的API服务运行在同一台“机器”上，这台机器也缓存了大量的视频元数据(根据设计)。这意味着静态数据(例如视频标题、描述)可以跨多个请求被积极缓存和重用。然而，使用新的微服务，即使获取这些缓存的数据也需要网络往返，这增加了一些延迟。\n这听起来可能像是“巨无霸VS微服务”的经典例子，但实际情况要复杂得多。这块巨石本质上还在与许多下游微服务对话：它只是碰巧有一个定制的缓存，这对它有很大帮助。通过更好的可观察性和更高效的请求批处理，部分增加的延迟得到了缓解。但是，对于一小部分请求，在进行了大量优化尝试之后，我们不得不承担延迟损失：有时，没有什么灵丹妙药。\n由于对端点的每个调用可能需要向API服务发出多个请求，其中一些调用可能会失败，从而给我们留下部分数据。处理这样的部分查询错误并不是一个新问题：它是Falcor或GraphQL等复合协议的本质。然而，正如前面提到的，当我们将路由处理程序移到一个新的微服务中时，我们现在引入了用于获取任何数据的网络边界。\n这意味着我们现在遇到了以前由于自定义缓存而不可能实现的部分状态。我们在迁移开始时并没有完全意识到这个问题：我们只有在一些反序列化的数据对象具有空字段时才能看到这个问题。因为我们的很多代码都使用Kotlin，所以这些部分数据对象会立即导致崩溃，这有助于我们及早注意到问题：在它投入生产之前。\n由于局部错误的增加，我们必须改进整体错误处理方法，并探索将网络错误的影响降至最低的方法。在某些情况下，我们还在端点或客户端代码上添加了自定义重试逻辑。\n这是很久以前的事了(你看得出来！)。对于我们Android团队来说，这是一个令人满意的旅程：正如我们前面提到的，在我们的团队中，我们通常会开发这款应用程序，直到现在，我们还没有机会使用我们的端点进行这种级别的审查。我们不仅了解了更多有关微服务的有趣世界，而且对于我们从事此项目的人员来说，它为我们提供了一个完美的机会，可以为我们的应用程序-端点交互添加可观察性。与此同时，我们遇到了一些意想不到的问题，如部分错误，并在此过程中使我们的应用程序对它们更具弹性。\n随着我们不断发展和完善我们的应用程序，我们希望能与您分享更多这样的真知灼见。\n规划并成功迁移到这项新服务是多个后端和前端团队共同努力的结果。\n在Android团队中，我们将Android上的Netflix应用程序发送给世界各地的数百万会员。我们的职责包括通过构建高性能且通常是自定义的UI体验，在各种设备上进行广泛的A/B测试。我们致力于在多样化、有时不可饶恕的设备和网络生态系统中进行大规模的数据驱动优化。如果您对这些挑战感兴趣，并想与我们合作，我们有一个开放的职位。", "note_en": "As Android developers, we usually have the luxury of treating our backends as magic boxes running in the cloud, faithfully returning us JSON. At Netflix, we have adopted the  Backend for Frontend (BFF) pattern: instead of having one general purpose “backend API”, we have one backend per client (Android/iOS/TV/web). On the Android team, while most of our time is spent working on the app, we are also responsible for maintaining this backend that our app communicates with, and its orchestration code.\n Recently, we completed a year-long project rearchitecting and decoupling our backend from the centralized model used previously. We did this migration without slowing down the usual cadence of our releases, and with particular care to avoid any negative effects to the user experience. We went from an essentially serverless model in a monolithic service, to deploying and maintaining a new microservice that hosted our app backend endpoints. This allowed Android engineers to have much more control and observability over how we get our data. Over the course of this post, we will talk about our approach to this migration, the strategies that we employed, and the tools we built to support this.\n  The Netflix Android app uses the  falcor data model and query protocol. This allows the app to query a list of “paths” in each HTTP request, and get specially formatted JSON ( jsonGraph) that we use to cache the data and hydrate the UI. As mentioned earlier, each client team owns their respective endpoints: which effectively means that we’re writing the resolvers for each of the paths that are in a query.\n  As an example, to render the screen shown here, the app sends a query that looks like this:\n  A   path starts from a  root object, and is followed by a sequence of  keys that we want to retrieve the data for. In the snippet above, we’re accessing the  detail key for the  video object with id  80154610.\n    In the example you see above, the data that the app needs is served by different backend microservices. For example, the artwork service is separate from the video metadata service, but we need the data from both in the  detail key.\n We do this orchestration on our endpoint code using a library provided by our API team, which exposes an RxJava API to handle the downstream calls to the various backend microservices. Our endpoint route handlers are effectively fetching the data using this API, usually across multiple different calls, and massaging it into data models that the UI expects. These handlers we wrote were deployed into a service run by the API team, shown in the diagram below.\n  As you can see, our code was just a part (#2 in the diagram) of this monolithic service. In addition to hosting our route handlers, this service also handled the business logic necessary to make the downstream calls in a fault tolerant manner. While this gave client teams a very convenient “serverless” model, over time we ran into multiple operational and devex challenges with this service. You can read more about this in our previous posts here:  part 1,  part 2.\n  It was clear that we needed to isolate the endpoint code (owned by each client team), from the complex logic of fault tolerant downstream calls. Essentially, we wanted to break out the client-specific code from this monolith into its own service. We tried a few iterations of what this new service should look like, and eventually settled on a modern architecture that aimed to give more control of the API experience to the client teams. It was a Node.js service with a composable JavaScript API that made downstream microservice calls, replacing the old Java API.\n  As Android developers, we’ve come to rely on the safety of a strongly typed language like Kotlin, maybe with a side of Java. Since this new microservice uses Node.js, we had to write our endpoints in JavaScript, a language that many people on our team were not familiar with. The context around why the Node.js ecosystem was chosen for this new service deserves an article in and of itself. For us, it means that we now need to have ~15  MDN tabs open when writing routes :)\n Let’s briefly discuss the architecture of this microservice. It looks like a very typical backend service in the Node.js world: a combination of  Restify, a stack of HTTP middleware, and the Falcor-based API. We’ll gloss over the details of this stack: the general idea is that we’re still writing resolvers for paths like  [videos, &lt;id&gt;, detail], but we’re now writing them in JavaScript.\n The big difference from the monolith, though, is that this is now a standalone service deployed as a separate “application” (service) in our cloud infrastructure. More importantly, we’re no longer just getting and returning requests from the context of an endpoint script running in a service: we’re now getting a chance to handle the HTTP request in its entirety. Starting from “terminating” the request from our public gateway, we then make downstream calls to the  api application (using the previously mentioned JS API), and build up various parts of the response. Finally, we return the required JSON response from our service.\n  Before we look at what this change meant for us, we want to talk about how we did it. Our app had ~170 query paths (think: route handlers), so we had to figure out an iterative approach to this migration. Let’s take a look at what we built in the app to support this migration. Going back to the screenshot above, if you scroll a bit further down on that page, you will see the section titled “more like this”:\n  As you can imagine, this does not belong in the video details data for this title. Instead, it is part of a different  path:  [videos, &lt;id&gt;, similars]. The general idea here is that each UI screen ( Activity/ Fragment) needs data from multiple query paths to render the UI.\n To prepare ourselves for a big change in the tech stack of our endpoint, we decided to track metrics around the time taken to respond to queries. After some consultation with our backend teams, we determined the most effective way to group these metrics were by UI screen. Our app uses a version of the repository pattern, where each screen can fetch data using a list of query paths. These paths, along with some other configuration, builds a  Task. These  Tasks already carry a  uiLabel that uniquely identifies each screen: this label became our starting point, which we passed in a header to our endpoint. We then used this to log the time taken to respond to each query, grouped by the  uiLabel. This meant that we could track any possible regressions to user experience by screen, which corresponds to how users navigate through the app. We will talk more about how we used these metrics in the sections to follow.\n Fast forward a year: the 170 number we started with slowly but surely whittled down to 0, and we had all our “routes” (query paths) migrated to the new microservice. So, how did it go…?\n  Today, a big part of this migration is done: most of our app gets its data from this new microservice, and hopefully our users never noticed. As with any migration of this scale, we hit a few bumps along the way: but first, let’s look at good parts.\n  Our monolith had been around for many years and hadn’t been created with functional and unit testing in mind, so those were independently bolted on by each UI team. For the migration, testing was a first-class citizen. While there was no technical reason stopping us from adding full automation coverage earlier, it was just much easier to add this while migrating each query path.\n For each route we migrated, we wanted to make sure we were not introducing any regressions: either in the form of missing (or worse, wrong) data, or by increasing the latency of each endpoint. If we pare down the problem to absolute basics, we essentially have two services returning JSON. We want to make sure that for a given set of paths as input, the returned JSON is always exactly the same. With lots of guidance from other platform and backend teams, we took a 3-pronged approach to ensure correctness for each route migrated.\n Functional Testing Functional testing was the most straightforward of them all: a set of tests alongside each path exercised it against the old and new endpoints. We then used the excellent  Jest testing framework with a set of custom matchers that sanitized a few things like timestamps and uuids. It gave us really high confidence during development, and helped us cover all the code paths that we had to migrate. The test suite automated a few things like setting up a test user, and matching the query parameters/headers sent by a real device: but that’s as far as it goes. The scope of functional testing was limited to the already setup test scenarios, but we would never be able to replicate the variety of device, language and locale combinations used by millions of our users across the globe.\n   It was a self-contained flow that, by design, captured entire requests, and not just the one path we requested. This test was the closest to production: it replayed real requests sent by the device, thus exercising the part of our service that fetches responses from the old endpoint and stitches them together with data from the new endpoint. The thoroughness and flexibility of this replay pipeline is best described in its own post. For us, the replay test tooling gave the confidence that our new code was nearly bug free.\n Canaries Canaries were the last step involved in “vetting” our new route handler implementation. In this step, a pipeline picks our candidate change, deploys the service, makes it publicly discoverable, and redirects a small percentage of production traffic to this new service. You can find a lot more details about how this works in the  Spinnaker canaries documentation.\n This is where our previously mentioned  uiLabel metrics become relevant: for the duration of the canary,  Kayenta was  configured to capture and compare these metrics for all requests (in addition to the system level metrics already being tracked, like server CPU and memory). At the end of the canary period, we got a report that aggregated and compared the percentiles of each request made by a particular UI screen. Looking at our high traffic UI screens (like the homepage) allowed us to identify any regressions caused by the endpoint before we enabled it for all our users. Here’s one such report to get an idea of what it looks like:\n  Each identified regression (like this one) was subject to a lot of analysis: chasing down a few of these led to previously unidentified performance gains! Being able to canary a new route let us verify latency and error rates were within acceptable limits. This type of tooling required time and effort to create, but in the end, the feedback it provided was well worth the cost.\n  Many Android engineers will be familiar with systrace or one of the excellent profilers in Android Studio. Imagine getting a similar tracing for your endpoint code, traversing along many different microservices: that is effectively what distributed tracing provides. Our microservice and router were already integrated into the Netflix request tracing infrastructure. We used  Zipkin to consume the traces, which allowed us to search for a trace by path. Here’s what a typical trace looks like:\n  Request tracing has been critical to the success of Netflix infrastructure, but when we operated in the monolith, we did not have the ability to get this detailed look into how our app interacted with the various microservices. To demonstrate how this helped us, let us zoom into this part of the picture:\n  It’s pretty clear here that the calls are being serialized: however, at this point we’re already ~10 hops disconnected from our microservice. It’s hard to conclude this, and uncover such problems, from looking at raw numbers: either on our service or the   testservice above, and even harder to attribute them back to the exact UI platform or screen. With the rich end-to-end tracing instrumented in the Netflix microservice ecosystem and made easily accessible via Zipkin, we were able to pretty quickly triage this problem to the responsible team.\n  As we mentioned earlier, our new service now had the “ownership” for the lifetime of the request. Where previously we only returned a Java object back to the api middleware, now the final step in the service was to flush the JSON down the request buffer. This increased ownership gave us the opportunity to easily test new optimisations at this layer. For example, with about a day’s worth of work, we had a prototype of the app using the binary msgpack response format instead of plain JSON. In addition to the flexible service architecture, this can also be attributed to the Node.js ecosystem and the rich selection of npm packages available.\n  Before the migration, developing and debugging on the endpoint was painful due to slow deployment and lack of local debugging ( this post covers that in more detail). One of the Android team’s biggest motivations for doing this migration project was to improve this experience. The new microservice gave us fast deployment and debug support by running the service in a local Docker instance, which has led to significant productivity improvements.\n  In the arduous process of breaking a monolith, you might get a sharp shard or two flung at you. A lot of what follows is not specific to Android, but we want to briefly mention these issues because they did end up affecting our app.\n  The old  api service was running on the same “machine” that also cached a lot of video metadata (by design). This meant that data that was static (e.g. video titles, descriptions) could be aggressively cached and reused across multiple requests. However, with the new microservice, even fetching this cached data needed to incur a network round trip, which added some latency.\n This might sound like a classic example of “monoliths vs microservices”, but the reality is somewhat more complex. The monolith was also essentially still talking to a  lot of downstream microservices: it just happened to have a custom-designed cache that helped a lot. Some of this increased latency was mitigated by better observability and more efficient batching of requests. But, for a small fraction of requests, after a lot of attempts at optimization, we just had to take the latency hit: sometimes, there are no silver bullets.\n  As each call to our endpoint might need to make multiple requests to the api service, some of these calls can fail, leaving us with partial data. Handling such partial query errors isn’t a new problem: it is baked into the nature of composite protocols like Falcor or GraphQL. However, as we moved our route handlers into a new microservice, we now introduced a network boundary for fetching  any data, as mentioned earlier.\n This meant that we now ran into partial states that weren’t possible before because of the custom caching. We were not completely aware of this problem in the beginning of our migration: we only saw it when some of our deserialized data objects had  null fields. Since a lot of our code uses Kotlin, these partial data objects led to immediate crashes, which helped us notice the problem early: before it ever hit production.\n As a result of increased partial errors, we’ve had to improve overall error handling approach and explore ways to minimize the impact of the network errors. In some cases, we also added custom retry logic on either the endpoint or the client code.\n  This has been a long (you can tell!) and a fulfilling journey for us on the Android team: as we mentioned earlier, on our team we typically work on the app and, until now, we did not have a chance to work with our endpoint with this level of scrutiny. Not only did we learn more about the intriguing world of microservices, but for us working on this project, it provided us the perfect opportunity to add observability to our app-endpoint interaction. At the same time, we ran into some unexpected issues like partial errors and made our app more resilient to them in the process.\n As we continue to evolve and improve our app, we hope to share more insights like these with you.\n  The planning and successful migration to this new service was the combined effort of multiple backend and front end teams.\n On the Android team, we ship the Netflix app on Android to millions of members around the world. Our responsibilities include extensive A/B testing on a wide variety of devices by building highly performant and often custom UI experiences. We work on data driven optimizations at scale in a diverse and sometimes unforgiving device and network ecosystem. If you find these challenges interesting, and want to work with us, we have an   open position .", "posttime": "2020-10-23 07:18:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,android,交换,swapping,服务", "title": "无缝交换Netflix Android应用程序的API后端", "title_en": "Seamlessly Swapping the API back end of the Netflix Android app", "transed": 1, "url": "https://netflixtechblog.com/seamlessly-swapping-the-api-backend-of-the-netflix-android-app-3d4317155187", "via": "", "real_tags": ["程序", "android", "交换", "swapping", "服务"]}]