[{"category": "", "categoryclass": "", "imagename": "6d6b0c667133706b950f731f108f1c07.jpg", "infoid": 1070018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司周二宣布，Instagram 已为其青少年用户引入了保护措施，将年轻人默认为私人账户，并使“可疑”的成年人更难进行不必要的接触。 Facebook 旗下的照片共享应用 Instagram 也限制了希望向青少年用户推广其产品的广告商的定位选项。该公司在一篇宣布这些变化的博客文章中表示：“在 Instagram 上创造一种对年轻人来说既安全又私密又有趣的体验伴随着竞争挑战。” “我们希望他们轻松地结交新朋友并跟上他们的兴趣，但我们不希望他们处理不受欢迎的 DM 或陌生人的评论。”从本周开始，当 18 岁以下的人加入 Instagram 时，帐户默认为私人帐户。这意味着人们必须关注用户才能查看和评论他们的内容。该公司还将向已经拥有公共账户的用户显示一条通知，强调切换到私人账户的好处并解释如何操作。这一变化将使 Facebook 遵守英国新的适龄设计规范，这是该国数据保护机构制定的一套规则，要求所有在线平台将 18 岁以下用户的帐户默认为最严格的隐私设置。该公司表示，它还开发了一种工具，可以自动检测潜在的可疑成人帐户，并阻止这些帐户与应用程序上的青少年帐户进行交互。 Instagram 公共政策负责人卡琳娜·牛顿 (Karina Newtonin) 在单独接受采访时表示，如果一个成年人的帐户被多个青少年帐户屏蔽或举报，则该帐户可能会被标记为可疑。一旦被标记，成年人将不会在发现工具中看到青少年帐户。他们也无法关注年轻人的帐户，无法在他们的帖子上发表评论或在其他人的帐户上看到青少年的评论。 “我们正在为年轻人创造一个额外的缓冲，”牛顿说，并指出该公司已经限制成年人向未关注他们的 18 岁以下用户发送直接消息。 Instagram 已经制定了禁止主动与未成年人互动的政策，包括主动联系和索取性内容或好处。新系统旨在首先防止接触。\n“我们试图弄清楚成年人是否表现出可疑行为，”牛顿说。 “成年人可能还没有违反规则，但可能正在做一些让我们更深入地看待它们的事情。”牛顿表示，Instagram 还在自动化工具上投入了更多资金，以检测某人是否未满 18 岁或超过 18 岁，而无需他们提交真实身份的副本。 “在互联网上了解人们的年龄是一项复杂的挑战，”牛顿说。 “收集人们的身份证不是问题的答案，因为这不是一个公平、公正的解决方案。访问在很大程度上取决于你住在哪里和你的年龄。人们不一定想将他们的身份证提供给互联网服务。”牛顿表示，Instagram 正在使用人工智能通过寻找基于文本的信号来更好地了解年龄，例如关于用户生日的评论。她说，这项技术并没有试图通过分析照片中的人脸来确定年龄。 Newton 表示，该公司还在“非常早期的对话”中探索全行业的措施，比如让 Instagram 等应用程序通过设备的操作系统验证年龄——例如，如果父母将孩子的年龄添加到具有家长控制功能的手机或 iPad 上。几周后，广告商将被限制在 Instagram、Facebook 和 Messenger 上定位 18 岁以下用户的方式。他们将被允许仅根据他们的年龄、性别和位置来定位他们，而不再能够根据他们在其他应用程序和网站上的兴趣或活动来定位他们。全球行动计划是一个由儿童安全和隐私专家组成的联盟，近一年来一直呼吁社交媒体公司，包括 Facebook 和谷歌，停止在儿童身上使用“精准定向和高度操纵”的广告。\n“从表面上看，这些都是积极的发展，”全球行动计划的政策和运动负责人奥利弗海耶斯说。 “正如我们的竞选活动所证明的那样，没有充分的理由跟踪 18 岁以下青少年的每一次活动，以便在他们最脆弱的时候向他们投放广告。但是，与以往一样，细节决定成败。Facebook 是不会放弃他们的核心商业模式，这将我们的注意力货币化，以增加大量的广告收入。” Newton 说，同样的年龄检测技术可用于检测某人是否未满 13 岁、使用主 Instagram 应用程序的最低年龄，并将年轻用户引导到专为青少年设计的单独的、尚未发布的应用程序版本中。 .当 BuzzFeed News 首次报道 Instagram 计划在 3 月份为 13 岁以下用户推出该应用程序版本时，儿童保护组织普遍强烈反对。 4 月，一个由 35 个组织组成的国际联盟由总部位于波士顿的非营利组织 Fairplay（以前称为“无商业童年运动”）和 64 位专家组成，他们呼吁 Instagram 取消发布计划，因为他们担心这会让年轻用户陷入“风险很大。”该联盟在给 Facebook 首席执行官马克扎克伯格的一封信中提出了对隐私、屏幕时间、心理健康、自尊和商业压力的担忧。 5 月，40 名州检察长回应了联盟的担忧，还敦促扎克伯格放弃为 13 岁以下青少年推出 Instagram 版本的计划。 Fairplay 执行董事乔什·戈林 (Josh Golin) 表示：“这些变化中的每一项都是倡导者和监管机构一直在努力推动的事情。” “很明显，Facebook 感受到了为年轻人提供更安全、更少剥削的体验的压力。如果他们有这些工具来识别 18 岁以下和 13 岁以下的人，他们为什么不一直使用它们？”戈林补充道。 “我们担心 Facebook 只对将 13 岁以下的青少年踢出 Instagram 感兴趣，前提是他们有另一个家。对于青少年或年幼的孩子，我们仍然对 Instagram 抱有同样的担忧。”牛顿说，Instagram-for-tweens 产品仍在开发中，“与儿童发展专家和隐私倡导者进行了深入协商”，因此该产品解决了“青少年的需求”。家庭和青年。”\n“今天存在的 Instagram 是为 13 岁以上的人设计的，”牛顿说。 “我们正在寻求构建对补间有吸引力且对父母有用的东西。”", "note_en": "Instagram has introduced protections for its teenage users to default young people into private accounts and make it harder for &#34;suspicious&#34; adults to make unwanted contact, the company announced Tuesday.\n Instagram, the photo-sharing app owned by Facebook, has also restricted targeting options for advertisers who want to promote their products to teen users.\n   &#34;Creating an experience on Instagram that&#39;s safe and private for young people, but also fun, comes with competing challenges,&#34; the company said in a blog post announcing the changes. &#34;We want them to easily make new friends and keep up with their interests, but we don&#39;t want them to deal with unwanted DMs or comments from strangers.&#34;\n  Starting this week, when people under 18 join Instagram, the accounts default to private. That means people have to follow the users to see and comment on their content. The company will also show users who already have public accounts a notification highlighting the benefits of switching to a private account and explaining how to do it. The change will bring Facebook into compliance with the U.K.&#39;s new Age Appropriate Design Code, a  set of rules from the country&#39;s data protection authority that requires all online platforms to default the accounts of users under age 18 to the strictest privacy settings.\n The company said it has also developed a tool that automatically detects potentially suspicious adult accounts and stops those accounts from interacting with teens&#39; accounts on the app. An adult&#39;s account might be marked as suspicious if it has been blocked or reported by multiple teen accounts, said Instagram&#39;s head of public policy, Karina Newtonin a separate interview. Once they are flagged, adults won&#39;t be shown teen accounts in discovery tools. They also won&#39;t be able to follow young people&#39;s accounts, leave comments on their posts or see comments from teens on other people&#39;s accounts.\n &#34;We are creating an additional buffer around young people,&#34; said Newton, noting that the company had already restricted adults from sending direct messages to users under 18 who didn&#39;t follow them.\n  Instagram already has policies prohibiting unsolicited interactions with minors, including initiating contact and requesting sexual content or favors. The new system is designed to prevent contact from being made in the first place.\n &#34;We are trying to figure out if an adult is exhibiting suspicious behavior,&#34; Newton said. &#34;The adult might not have broken the rules yet, but might be doing things that make us look at them more deeply.&#34;\n Newton said Instagram has also invested more heavily in automated tools to detect whether someone was under or over 18 without requiring them to submit copies of their real-world identities.\n &#34;Understanding people&#39;s age on the internet is a complex challenge,&#34; Newton said. &#34;Collecting people&#39;s ID is not the answer to the problem as it&#39;s not a fair, equitable solution. Access depends greatly on where you live and how old you are. And people don&#39;t necessarily want to give their IDs to internet services.&#34;\n  Newton said Instagram was using artificial intelligence to better understand age by looking for text-based signals, such as comments about users&#39; birthday. The technology doesn&#39;t try to determine age by analyzing people&#39;s faces in photos, she said.\n The company is also in &#34;really early conversations&#34; exploring industrywide measures like having apps like Instagram verify ages through devices&#39; operating systems, Newton said — for example, if parents added a child&#39;s age to a phone or an iPad that had parental controls.\n Starting in a few weeks, advertisers will be restricted in how they can target users under age 18 on Instagram, Facebook and Messenger. They will be allowed to target them based only on their ages, genders and locations and will no longer be able to target them based on their interests or activities on other apps and websites.\n   Global Action Plan, a coalition of child safety and privacy experts, has been  calling for social media companies, including Facebook and Google, for almost a year to stop using &#34;precision targeted and highly manipulative&#34; advertising on children.\n  &#34;On the face of it, those are positive developments,&#34; said Oliver Hayes, policy and campaigns lead at Global Action Plan. &#34;As our campaign makes the case, there&#39;s no good reason to track every movement of under-18s in order to target them with ads when they are at their most vulnerable. But, as ever, the devil will be in the details. Facebook is not going to give up on their central business model, which is monetizing our attention to raise a huge amount of ad revenue.&#34;\n  The same age-detecting technology can be used to detect whether someone is under 13, the minimum age to use the main Instagram app, and funnel younger users into a separate, yet-to-launch version of the app designed for tweens, Newton said.\n When  BuzzFeed News first reported that Instagram planned to launch a version of the app for users under 13 in March, there was widespread backlash from child protection groups. In April an international coalition of 35 organizations led by the Boston-based nonprofit Fairplay, previously known as the Campaign for a Commercial-Free Childhood, and 64 experts  called on Instagram to scrap plans for the launch over fears that it would put young users at &#34;great risk.&#34; The coalition raised concerns about privacy, screen time, mental health, self-esteem and commercial pressure in a letter to Facebook CEO Mark Zuckerberg.\n In May, 40 state attorneys general  echoed the coalition&#39;s concerns, also urging Zuckerberg to abandon plans to launch a version of Instagram for under-13s.\n  &#34;Every one of these changes are things that advocates and regulators have been pushing hard on,&#34; said Josh Golin, executive director of Fairplay. &#34;It&#39;s clear that Facebook is feeling the pressure to provide a safer and less exploitative experience for young people.\n &#34;If they had these tools to identify under-18s and under-13s, why weren&#39;t they using them all along?&#34; Golin added. &#34;We are concerned that Facebook is only interested in kicking under-13s off Instagram if they have another home for them. We still have all the same concerns for Instagram for tweens or younger kids.&#34;\n Newton said the Instagram-for-tweens product was still in development in &#34;deep consultation with experts in child development and privacy advocates&#34; so the product addresses the &#34;needs of families and youth.&#34;\n &#34;Instagram as it exists today was designed for people older than 13,&#34; Newton said. &#34;We&#39;re looking to build something that&#39;s compelling for tweens and works for parents.&#34;", "posttime": "2021-07-27 21:44:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,限制,announces,instagram", "title": "Instagram 宣布对青少年帐户进行更改，包括默认将其设为私密、限制来自“可疑”成年人的消息以及限制广告", "title_en": "Instagram announces changes for teen accounts, including making them private by default, restricting messages from “suspicious” adults, and limiting ads", "transed": 1, "url": "https://www.nbcnews.com/tech/social-media/instagram-s-new-protections-teens-come-experts-say-tween-venture-n1275069", "via": "", "real_tags": ["广告", "限制", "announces", "instagram"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070017, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Threema Work 是组织安全消息传递应用程序的黄金标准。全球知名公司使用久经考验的瑞士聊天解决方案来保护他们的公司数据并确保完全遵守数据隐私。借助 Threema Work，员工可以享受即时消息带来的提高生产力的好处，而不必求助于不符合企业使用资格或不符合 GDPR 的可疑聊天服务。现在，Threema OnPrem 将企业消息传递的安全性和机密性提高到 11 个。新的本地解决方案允许需要卓越安全性的组织在自己的服务器上运行 Threema。这意味着完整的数据所有权以及对通信工具各个方面的完全和专有控制。不仅消息交换由公司服务器在内部进行，管理控制台也是自托管的，Threema OnPrem 涵盖了 Threema Work 的全部功能范围。 Threema 完善的安全架构与绝对数据所有权相结合，形成了一个在保密性方面首屈一指的独立聊天环境。 Threema OnPrem 实例是完全独立的，并且不会以任何方式、形状或形式连接到 Threema 的基础设施。因此，Threema OnPrem 非常适合工业公司、公共机构、执法部门以及涉及敏感数据或需要最大安全性和最高机密性的任何地方的专业用途。", "note_en": "Threema Work is the  gold standard of secure messaging apps for organizations. Renowned companies around the globe use the time-tested Swiss chat solution to protect their corporate data and to ensure full data-privacy compliance. With Threema Work, employees enjoy the productivity-boosting benefits of instant messaging without having to resort to questionable chat services that aren’t qualified for corporate use or don’t comply with the GDPR.\n Now,  Threema OnPrem turns the security and confidentiality of enterprise messaging up to eleven. The new on-premises solution allows organizations that require exceptional security to run Threema on their own server. This translates to complete data ownership along with total and exclusive control over every aspect of the communication tool. Not only the message exchange is carried out internally by the company server, the administration console is also self-hosted, with Threema OnPrem covering the full feature range of Threema Work.\n The combination of Threema’s well-established security architecture and absolute data ownership results in a self-contained chat environment that’s second to none in terms of confidentiality. Threema OnPrem instances are completely independent and in no way, shape, or form connected to Threema’s infrastructure. Thus, Threema OnPrem is perfectly suited for professional use in industrial companies, public authorities, law enforcement, and wherever sensitive data is involved or maximum security and utmost confidentiality are required.", "posttime": "2021-07-27 21:39:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "onprem,threema", "title": "Threema OnPrem：自托管带来的最大安全性", "title_en": "Threema OnPrem: Maximum Security Thanks to Self-Hosting", "transed": 1, "url": "https://threema.ch/en/blog/posts/onprem", "via": "", "real_tags": ["onprem", "threema"]}, {"category": "", "categoryclass": "", "imagename": "77bed9cc7b2c5f1238eb53d1e6029634.png", "infoid": 1070015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注意：我们已将插件从 mopp 重命名为 jupyter-text2code。在安装新的 jupyter-text2code 版本之前卸载 mopp。对于没有 nvidia GPU 的 Mac 和其他 Ubuntu 安装，我们需要在安装时显式设置环境变量。如果安装成功，那么第一次，Universal Sentence Encoder 模型将从 tensorflow_hub 下载。从 jupyter_text2code/jupyter_text2code_serverextension/data/ner_templates.csv 中的模板列表，通过运行以下命令生成训练数据：生成训练数据。如果需要不同的生成技术或引入新实体，请修改 generate_training_data.py。有了足够的数据，训练一个语言模型像 GPT-3 那样直接做英语-&gt;代码，而不是在管道中设置单独的阶段", "note_en": "NOTE: We have renamed the plugin from mopp to jupyter-text2code. Uninstall mopp before installing new jupyter-text2code version.\n     For Mac and other Ubuntu installations not having a nvidia GPU, we need to explicitly set a environment variable at time of install.\n     If installation happened successfully, then for the first time, Universal Sentence Encoder model will be downloaded from  tensorflow_hub.\n   From a list of templates present at  jupyter_text2code/jupyter_text2code_serverextension/data/ner_templates.csv, generate training data by running the following command:\n         Generate training data. Modify  generate_training_data.py if different generation techniques are needed or if introducing a new entity.\n  With enough data, train a language model to directly do English-&gt;code like GPT-3 does, instead of having separate stages in the pipeline", "posttime": "2021-07-27 21:34:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,github,python,英文,converts", "title": "Text2Code：将英文查询转换为 Python 代码 GitHub 代码", "title_en": "Text2Code: Converts Queries in English into Python Code GitHub Code", "transed": 1, "url": "https://github.com/deepklarity/jupyter-text2code", "via": "", "real_tags": ["代码", "github", "python", "英文", "converts"]}, {"category": "", "categoryclass": "", "imagename": "33a7b4d5605a94a6b921acd6ea081a9e.png", "infoid": 1070014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位安全研究人员透露，苹果公司允许优步使用一种“强大的工具”，即使该应用程序在后台运行，它也可以记录优步用户的 iPhone 屏幕。这种强大和“私人”Apple 功能的后门允许乘车公司在他们不知情的情况下访问用户信息。 “就我所知，将如此敏感的权利授予第三方是前所未有的，没有其他应用程序开发人员能够说服 Apple 授予他们让他们的应用程序利用某些特权系统功能所需的权利，”威尔报告该问题的安全研究员 Strafach 说。在 iOS 中，应用程序开发人员使用“权利”使他们能够访问不同的 API - 使用 iCloud、访问相机、Apple Pay API、设置推送通知等等。这些权利在某种程度上确保应用程序只能访问他们提供服务实际需要的内容。 Apple 还拥有某些仅供公司自己使用的私人权利，如果发现开发人员（无论其地位如何）使用这些权利，他们会立即被 App Store 拒绝，无论其此类请求的合法性如何。以 com.apple.private 开头的名称标记，研究人员发现 Uber 使用敏感权利“com.apple.private.allow-explicit-graphics-priority”，并且显然得到了 Apple 的明确许可。移动应用程序安全分析员 Strafach 表示，他无法从包含数万个应用程序的数据库中找到任何非苹果应用程序被授予如此敏感的权利。 “将 Uber 视为唯一的应用程序（我使用来自 App Store 的公司内部数据集检查了数以万计的其他应用程序），这很奇怪，除了 Apple 自己的应用程序被授予访问这一敏感权利的权限。”这种被证明是记录用户屏幕的敏感权利并未授予优步跟踪司机或优步用户。据 Uber 称，它被用来帮助早期的 Apple Watch 渲染地图并改进 Uber Watch 应用程序的内存管理。在给 Gizmodo 的一份声明中，优步发言人证实，较新的应用程序版本不再需要这样做，这就是该公司删除此 API 的原因。 [不清楚为什么如果不再需要这个 API 就没有删除它]\n“它用于旧版本的 Apple Watch 应用程序，专门用于在手机上运行渲染图的繁重工作，然后将渲染结果发送到 Watch 应用程序。这种依赖随着之前对 Apple 操作系统和我们的应用程序的改进而被删除。因此，我们正在从我们的 iOS 代码库中删除这个 API。”如果不是 Uber 本身，屏幕录制功能可能会被犯罪黑客出于邪恶的原因使用（考虑到它的历史，这并不奇怪）。“通过小心地启用只有您需要的资源访问权限，如果恶意代码成功利用您的应用程序，您就可以最大限度地减少损害的可能性，”Apple 在谈到权利时说。这意味着虽然 Uber 可能实际上从未打算监视其用户和司机（它以前做过） ，这项权利可能让黑客有机会悄悄监控 Uber 用户的活动，包括可能窃取敏感信息。“从本质上讲，它可以让您完全控制帧缓冲区，其中包含屏幕每个像素的颜色。因此，他们可能会绘制或记录屏幕，”安全研究人员写道。“它可能会窃取密码等。” Strafach 继续表示，考虑到应用程序开发人员的敏感性，Apple 不会向应用程序开发人员授予“私人”权利，而且没有其他应用程序曾经有过“似乎没有其他第三方开发商能够让 Apple 授予他们这种性质的私人敏感权利。考虑到 Uber 过去的隐私问题，我很好奇他们是如何说服 Apple 允许这样做的.”鉴于 Uber 与苹果公司显然不太愉快的历史，之前实际上威胁要从 App Store 中撤下这家叫车公司的应用程序，确实很奇怪，为什么苹果公司会给 Uber 并且只有 Uber 可以访问私人敏感权利，这可能会使他们能够记录用户或驱动程序的屏幕。如上所述，优步发言人声称，苹果授予此权限是“因为 Apple Watch 无法处理”优步地图渲染。这家库比蒂诺科技巨头很可能在给应用程序开发人员一个四个月的窗口期后，在产品发布之前为其 Watch 开发应用程序后，必须授予此访问权限。在 2015 年的主题演讲中，优步在苹果展示其 Apple Watch 时花了很多时间。\nUber 可能意识到它作为新 Apple Watch 的一个很好的卖点的价值，可能已经推动 Apple 获得这种访问权限。然而，有些人不同意苹果只帮助大玩家的政策。我知道有兴趣在他们的应用程序中拥有一些权利的各方。但当然，“安全！！！”。当优步需要他们时，一切都很好。考虑到 Uber 对用户、司机和竞争对手进行间谍活动的历史，如果该公司确实出于恶意原因使用它也就不足为奇了，尤其是考虑到他们确实要求提供屏幕录制功能。一位 Twitter 用户写道：“在 Uber 可以要求的所有权利中，它们可以用来在应用程序处于后台时跟踪用户。” “而且 Apple 没有问题。”无论如何，该公司现在正在从其代码库中删除令人不安的 API，Strafach 表示，如果该权利确实被公司恶意使用，他无法找到任何证据。", "note_en": "Apple gave Uber access to a &#34;powerful tool&#34; that could record an Uber user&#39;s iPhone screen even if the app was running in the background, a security researcher has revealed. This backdoor to powerful and &#34;private&#34;  Apple features allowed the ride-hailing company to potentially access user information without their knowledge.\n &#34;Granting such a sensitive entitlement to a third-party is unprecedented as far as I can tell, no other app developers have been able to convince Apple to grant them entitlements they’ve needed to let their apps utilize certain privileged system functionality,&#34; Will Strafach, a security researcher who reported the issue, said.\n   In iOS, app developers use &#34;entitlements&#34; that enable them to gain access to different APIs - using iCloud, giving access to Camera, Apple Pay API, setting up push notifications, and more. These entitlements in a way ensure that apps only get access to what they actually need for offering their services.\n Apple also has certain private entitlements that are only used by the company itself and if a developer - no matter how established - is found using these, they are instantly rejected from the App Store, regardless of their legitimacy of such a request. Marked with names that start with  com.apple.private, researchers discovered Uber using a sensitive entitlement &#34;com.apple.private.allow-explicit-graphics-priority&#34; and evidently with Apple&#39;s explicit permission.\n Strafach, a mobile app security analyzer, said he couldn&#39;t find any non-Apple app to have been granted such a sensitive entitlement from a database of tens of thousands of apps.\n &#34;It is very odd to see Uber as the only app (I checked tens of thousands of other apps using my company’s internal dataset derived from the App Store) besides Apple’s own apps granted access to this sensitive entitlement.&#34;\n  This  sensitive entitlement that turned out to be recording a user&#39;s screen wasn&#39;t granted to Uber to track drivers or Uber users. According to Uber, it was used to help early Apple Watches render maps and improve memory management for Uber&#39;s Watch app. In a  statement to Gizmodo, Uber spokesperson confirmed that this is no longer required for the newer app versions, which is why the company is removing this API. [It is unclear why this API wasn&#39;t removed already if it was no longer required]\n “It was used for an old version of the Apple Watch app, specifically to run the heavy lifting of rendering maps on your phone &amp; then send the rendering to the Watch app. This dependency was removed with previous improvements to Apple’s OS &amp; our app. Therefore, we’re removing this API from our iOS codebase.&#34;\n The screen recording capability could have been potentially used for nefarious reasons by criminal hackers, if not by Uber itself ( wouldn&#39;t be surprising given its history). &#34;By carefully enabling only the resource access that you need, you minimize the potential for damage if malicious code successfully exploits your app,&#34; Apple says about entitlements. This means that while Uber may actually never have intended to spy on its users and drivers ( it did previously), this entitlement may have given hackers a chance to silently monitor an Uber&#39;s user&#39;s activity, including potentially stealing sensitive information.\n   &#34;Essentially it gives you full control over the framebuffer, which contains the colors of each pixel of your screen. So they can potentially draw or record the screen,&#34; security researcher wrote. &#34;It can potentially steal passwords etc.&#34;\n Strafach continued to say that Apple doesn&#39;t grant &#34;private&#34; entitlements to app developers considering their sensitivity and NO other app has ever been able to get that access.\n “It looks like no other third-party developer has been able to get Apple to grant them a private sensitive entitlement of this nature. Considering Uber’s past privacy issues I am very curious how they convinced Apple to allow this.&#34;\n  Given Uber&#39;s apparently not-so-happy history with Apple that has previously actually threatened to pull the ride-hailing company&#39;s app from App Store, it is indeed curious why would Apple give Uber, and only Uber, access to a private sensitive entitlement that could enable them to record a user or a driver&#39;s screen.\n As mentioned above, Uber spokesperson claims that Apple gave this permission &#34;because Apple Watch couldn’t handle&#34; Uber maps rendering. It is likely that the Cupertino tech giant had  to give this access after it gave app developers a four-month window to develop apps for its Watch before the unveiling of the product. During the keynote in 2015, Uber took a lot of stage time when Apple showcased its Apple Watch.\n Probably realizing its value as a good selling point for the new Apple Watch, Uber may have pushed Apple for this access. Some, however, don&#39;t agree with Apple&#39;s policy of only helping out big players.\n I know various parties interested in having a few entitlements in their apps. But of course, &#34;security!!!&#34;. When Uber needs em its all good.\n  Given Uber&#39;s history with spying on its users, drivers, and competitors, it wouldn&#39;t be surprising if the company did use it for nefarious reasons especially considering they did ask for screen recording capabilities. &#34;And of all the entitlements Uber could ask they go for shit that can be used to track users when app is backgrounded,&#34; a Twitter user wrote. &#34;And Apple is OK w/ it.&#34;\n For what it&#39;s worth, the company is now removing the troubling API from its codebase and Strafach says that he couldn&#39;t find any evidence if the entitlement was indeed used maliciously by the company.", "posttime": "2021-07-27 21:33:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,iphone,允许,gave,应用程序", "title": "Apple 允许 Uber 使用可以录制 iPhone 屏幕的秘密功能（2017 年）", "title_en": "Apple Gave Uber Access to a Secret Feature That Can Record iPhone Screens (2017)", "transed": 1, "url": "https://wccftech.com/apple-uber-secret-record-iphone-screen/", "via": "", "real_tags": ["apple", "iphone", "允许", "gave", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "4b85ca7438097ece72e117083ba96408.jpg", "infoid": 1070013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约州阿蒙克，2021 年 7 月 27 日/美通社/ -- IBM（纽约证券交易所代码：IBM）今天宣布推出 IBM z/OS V2.5，这是 IBM Z 的下一代操作系统 (OS)，旨在加速客户对混合云的采用和人工智能并推动应用现代化项目。根据 IBM 商业价值研究院今天发布的“大型机上的应用程序现代化”研究报告，71% 的受访高管表示基于大型机的应用程序是其业务战略的核心；三年内，在混合云环境中利用大型机资产的组织比例预计将增加 2 倍以上。 IBM z/OS V2.5 通过提供跨 AI 支持、应用程序现代化、弹性、增强的安全性和改进的开发人员体验的新功能，帮助为我们的客户创造价值。根据 IBM 委托 Morning Consult 进行的“2021 年全球人工智能采用指数”，87% 的接受调查的全球 IT 专业人士表示，他们可以在数据所在的任何地方构建和运行他们的人工智能项目，这对他们的公司来说非常或有些重要。 1]。在 z/OS V2.5 中，IBM 推出了与 z/OS 工作负载紧密集成的全新高性能 AI 功能，旨在为客户提供业务洞察力，从而做出更明智的决策。 “IBM 全力打造混合云和人工智能，我们非常专注于在 IBM Z 上提供人工智能和新安全功能等新创新，以帮助我们的客户更快地推进现代化进程，”总经理 Ross Mauri 说，IBM Z。“对于我们的客户，IBM z/OS V2.5 为平台带来了新的安全性和弹性功能，并使客户能够将 AI 实时注入每笔业务交易中——在大流行期间变得更加紧迫的当务之急。 ”在诸如 SolarWinds 和 Colonial Pipeline 勒索软件攻击等针对关键基础设施的近期威胁中，客户仍然需要进一步加强其整体网络安全和弹性态势。 IBM z/OS V2.5 通过在身份验证、授权、日志记录、系统完整性、系统和数据可用性、动态和静态数据加密以及整体数据隐私方面推出广泛的增强功能，帮助应对这些挑战，包括：将普遍加密扩展到新型数据集：现在包括顺序基本格式和大型格式 SMS 管理的数据集，使用户能够在不更改应用程序的情况下加密数据并简化合规性\n异常缓解功能利用预测性故障分析 (PFA)、运行时诊断、工作负载管理器 (WLM) 和 JES2 帮助近乎实时地进一步检测异常行为，让客户主动解决潜在问题随着客户加速他们的混合云之旅，拥有一个安全、可扩展的环境对于底层转型过程至关重要。 IBM z/OS V2.5 引入了支持应用程序现代化并在 z/OS 上提供云原生体验的新功能：新的 Java/COBOL 互操作性扩展了现有应用程序编程模型，支持并行 31 位和 64 位寻址，简化企业应用现代化。 z/OS Container Extensions (zCX) 的增强性能和易用性，可将 Linux 应用程序和实用程序集成到 z/OS 中。通过透明云分层 (TCT) 和对象访问方法 (OAM) 云层支持集成云存储的其他功能，通过将数据传输到混合云存储环境来帮助减少资本和运营费用，从而简化 IBM Z 上的数据归档和数据保护。预计 IBM z/OS V2.5 的安装和升级速度更快、更容易，一项客户端试验表明，与 IBM z/OS 2.3 和 2.4 相比，安装 z/OS 的速度提高了 30% 以上。[2]通过简化和自动化的任务提供简化的管理体验，可能不需要专业技能。 IBM z/OS V2.5 预计将于 2021 年 9 月 30 日全面上市。有关 IBM 未来方向和意图的声明如有更改或撤销，恕不另行通知，并且仅代表目标和目的。\n关于 IBM IBM 是全球领先的混合云和人工智能以及业务服务提供商，帮助超过 175 个国家/地区的客户利用其数据洞察、简化业务流程、降低成本并在其行业中获得竞争优势。金融服务、电信和医疗保健等关键基础设施领域的近 3,000 家政府和企业实体依靠 IBM 的混合云平台和红帽 OpenShift 来快速、高效和安全地影响他们的数字化转型。 IBM 在人工智能、量子计算、行业特定的云解决方案和业务服务方面的突破性创新为我们的客户提供了开放和灵活的选择。所有这一切都得到 IBM 对信任、透明、责任、包容和服务的传奇承诺的支持。", "note_en": "ARMONK, N.Y.,  July 27, 2021 / PRNewswire/ -- IBM (NYSE:  IBM) today announced  IBM z/OS V2.5, the next-generation operating system (OS) for  IBM Z, designed to accelerate client adoption of  hybrid cloud and  AI and drive application  modernization projects.\n    According to an IBM Institute for Business Value study &#34; Application modernization on the mainframe&#34; released today, 71% of executives surveyed say  mainframe-based applications are central to their business strategy; and in three years, the percentage of organizations leveraging mainframe assets in a hybrid cloud environment is expected to increase by more than 2x.\n  IBM z/OS V2.5 helps drive value for our clients by delivering new capabilities across AI enablement, application modernization,  resiliency, enhanced  security and an improved  developer experience.\n    According to the &#34; Global AI Adoption Index 2021,&#34; conducted by Morning Consult commissioned by IBM, 87% of global IT professionals surveyed report it is very or somewhat important to their company that they can build and run their AI projects wherever the data resides[1]. With z/OS V2.5, IBM is introducing new high performance AI capabilities that are tightly integrated with z/OS workloads, designed to give clients business insights for more informed decision making.\n  &#34;IBM is all-in on hybrid cloud and AI, and we are deeply focused on delivering new innovations like AI and new security capabilities on IBM Z to help our clients move forward, more quickly with their modernization journeys,&#34; said  Ross Mauri, GM, IBM Z. &#34;For our clients, IBM z/OS V2.5 brings new security and resiliency capabilities to the platform, and enables clients to infuse AI in real-time into every business transaction – imperatives that became more urgent during the pandemic.&#34;\n    Amid recent threats like SolarWinds and the Colonial Pipeline ransomware attack against critical infrastructure, there is a continued need for clients to further strengthen their overall cyber security and resiliency posture. IBM z/OS V2.5 is helping to address these challenges by unveiling a broad spectrum of enhancements across authentication, authorization, logging, system integrity, system and data availability, encryption for data in flight and at rest, and overall data privacy including:\n  Expanding pervasive encryption to new types of data sets: sequential basic format and large format SMS-managed data sets are now included, providing users with the capability to encrypt data without application changes and to simplify compliance\n  Anomaly Mitigation capabilities that leverage Predictive Failure Analysis (PFA), Runtime Diagnostics, Workload Manager (WLM), and JES2 to help further detect anomalous behavior in near real-time, letting clients proactively address potential problems\n    As clients accelerate their journey to hybrid cloud, having a secured, scalable environment is critical for the underlying transformation process. IBM z/OS V2.5 introduces new capabilities that support application modernization and provide a cloud native experience on z/OS:\n  New Java/COBOL Interoperability that extends existing application programming models with support for parallel 31-bit and 64-bit addressing, simplifying enterprise application modernization.\n  Enhanced performance and ease of use for z/OS Container Extensions (zCX) to integrate Linux applications and utilities into z/OS.\n  Additional capabilities to integrate cloud storage through transparent cloud tiering (TCT) and the Object Access Method (OAM) cloud tier support to help reduce capital and operating expenses with data transfer to hybrid cloud storage environments for simplified data archiving and data protection on IBM Z.\n  IBM z/OS V2.5 is expected to be faster and easier to install and upgrade, with one client trial demonstrating the ability to install z/OS more than 30% faster than compared with IBM z/OS 2.3 and 2.4.[2] With a simplified management experience supplied by streamlined and automated tasks, specialty skills may not be required. IBM z/OS V2.5 is expected to be generally available on  September 30, 2021.\n  Statements regarding IBM&#39;s future direction and intent are subject to change or withdrawal without notice and represent goals and objectives only.\n  About IBM \rIBM is a leading global hybrid cloud and AI, and business services provider, helping clients in more than 175 countries capitalize on insights from their data, streamline business processes, reduce costs and gain the competitive edge in their industries. Nearly 3,000 government and corporate entities in critical infrastructure areas such as financial services, telecommunications and healthcare rely on IBM&#39;s hybrid cloud platform and Red Hat OpenShift to affect their digital transformations quickly, efficiently, and securely. IBM&#39;s breakthrough innovations in AI, quantum computing, industry-specific cloud solutions and business services deliver open and flexible options to our clients. All of this is backed by IBM&#39;s legendary commitment to trust, transparency, responsibility, inclusivity, and service.", "posttime": "2021-07-27 21:33:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,操作系统,设计,os,ibm", "title": "IBM Z/OS v2.5，专为混合云和人工智能设计的下一代操作系统", "title_en": "IBM Z/OS v2.5, Next-Gen Operating System Designed for Hybrid Cloud and AI", "transed": 1, "url": "https://newsroom.ibm.com/2021-07-27-Announcing-IBM-z-OS-V2-5,-Next-Gen-Operating-System-Designed-for-Hybrid-Cloud-and-AI", "via": "", "real_tags": ["人工智能", "操作系统", "设计", "os", "ibm"]}, {"category": "", "categoryclass": "", "imagename": "91f33cc7c94c69bb6eb4af781d68a184.jpg", "infoid": 1070012, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经进入冠状病毒大流行 18 个月了，目前的情况——就像整个大流行期间的情况一样——令人困惑。重病患者的数量仍然很少，远非以色列医院系统超载的程度，但诊断出新感染的速度继续上升。", "note_en": "We are 18 months into the coronavirus pandemic and the current situation – as has generally been the case for the entire period of the pandemic – is confusing. The number of seriously ill patients is still low and far from what would overload Israel’s hospital system, but the pace at which new infections are being diagnosed continues to rise.", "posttime": "2021-07-27 21:33:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "采取,globally,情况", "title": "以色列的 Covid-19 正在采取全球独一无二的课程", "title_en": "Covid-19 in Israel is taking a globally unique course", "transed": 1, "url": "https://www.haaretz.com/israel-news/.premium.HIGHLIGHT-israeli-expert-i-believe-covid-will-catch-up-with-us-all-eventually-1.10035142", "via": "", "real_tags": ["采取", "globally", "情况"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在不同光照条件下从不同视角观察时，人物肖像呈现出不同的外观。我们可以很容易地想象面部在另一种设置中的样子，但是鉴于有限的观察，计算机算法仍然无法解决这个问题。为此，我们提出了一个用于人像视图合成和重新照明的系统：给定多个人像，我们使用神经网络来预测 3D 空间中的光传输场，并根据预测的神经光传输场 (NeLF) 生成人像从新的环境照明下的新相机视图。我们的系统在大量合成模型上进行了训练，并且可以在各种光照条件下推广到不同的合成和真实人像。我们的方法在给定多视图肖像作为输入的情况下实现了同时视图合成和重新照明，并获得了最先进的结果。纸", "note_en": "Human portraits exhibit various appearances when observed from different views under different lighting conditions. We can easily imagine how the face will look like in another setup, but computer algorithms still fail on this problem given limited observations. To this end, we present a system for portrait view synthesis and relighting: given multiple portraits, we use a neural network to predict the light-transport field in 3D space, and from the predicted Neural Light-transport Field (NeLF) produce a portrait from a new camera view under a new environmental lighting. Our system is trained on a large number of synthetic models, and can generalize to different synthetic and real portraits under various lighting conditions. Our method achieves simultaneous view synthesis and relighting given multi-view portraits as the input, and achieves state-of-the-art results.         Paper", "posttime": "2021-07-27 21:32:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经,neural,视图", "title": "NeLF：用于人像视图合成和重新照明的神经光传输场", "title_en": "NeLF: Neural Light-Transport Field for Portrait View Synthesis and Relighting", "transed": 1, "url": "http://cseweb.ucsd.edu/~viscomp/projects/EGSR21NeLF/", "via": "", "real_tags": ["神经", "neural", "视图"]}, {"category": "", "categoryclass": "", "imagename": "fc1e1c6135ca04cf12e3f39bd6065d79.jpg", "infoid": 1070010, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从远处看，与更传统的游戏相比，虚拟现实游戏可能看起来很原始和简单。当玩家在虚拟空间中跳跃时，他们的手漂浮在半空中，粗略地从一点传送到另一点。也许需要改变观点。玩家可能不知道的是，传送并不是在虚拟现实中移动的懒惰解决方案，而是对晕动病的直接反应。浮动手是一种设计选择，而不是捷径。游戏还不错。只是虚拟现实经常需要重新发明轮子。虚拟现实 (VR) 仍然是游戏设计的试验场，也是一个在控制方案和设计选择方面几乎没有标准的领域。传统开放世界游戏、角色扮演游戏和第一人称射击游戏的同质化并不存在，在控制台上按下扳机射击或按下面部按钮蹲下无处不在，VR 游戏仍在测试最佳方式让游戏变得有趣，让玩家感到舒适。虽然在游戏机上使用奇怪的按钮蹲下或攻击可能很麻烦，但 VR 中的错​​误决定可能会使玩家身体不适，导致恶心、眼睛疲劳和其他副作用。在虚拟现实中，您的整个身体都以一种不同于传统游戏的方式参与其中。从头戴设备需要适应不同的头部尺寸和形状并长时间保持舒适感，到镜片本身，VR 大大增加了变量的数量。对于许多人来说，最常见的问题是“VR 病”，这是开发者和玩家用来描述玩 VR 游戏所带来的各种痛苦的术语。恶心、头晕、迷失方向和许多其他与晕车相关的症状在许多 VR 用户中很常见，而虚拟现实的性质则加剧了这种情况：玩家的眼睛告诉他们的大脑他们在走路，而他们的身体告诉他们他们在仍然。 “你可以在日常生活中体验到这一点，比如当你在汽车后座看书时——你的视线固定在一个静止的物体上，但你的周边视觉和内耳正在检测运动，”技术程序马特迪克曼说Oculus 的健康与安全经理，这家公司领导了 VR 的发展，随后在 2014 年被 Facebook 收购。这是他和这个价值数十亿美元的行业中的许多其他人一直要解决的问题。 VR 晕眩是一些用户在使用更传统、更流畅的运动系统时摔倒或生病的原因（即你推动控制杆并向前移动，就像在标准的第一人称游戏中一样）。像素速度是导致 VR 疾病的众多问题之一。像素在视野中移动的速度与玩家的速度不同。虽然类似于在静止时看到运动的感觉，但像素速度解释了当世界在玩家周围奔波时，或者即使玩家在游戏中被表示为静止时也能提供坠落或运动的感觉。\n传送是一种常见的解决方案，它打破了错觉，但让玩家在世界中穿行，而不会欺骗他们的思想以为他们在走路。这就是为什么这么多 VR 游戏都是“体验”、铁路射击游戏和益智游戏的原因。将玩家保持在一个位置是避免晕车陷阱的简单解决方案。在开发过程中学到的简单技巧，例如调出静态图稿或控制用户将注意力集中在哪里，都有助于减轻恶心感。在“VR 运动挑战赛”中，开发者 Sanzaru 发现当玩家专注于特定事物时晕车现象有所减少。 “在我们的足球比赛中，当你接到一个足球接球时，我们实际上是在沿着轨道滑动你，但由于用户非常专注于他们正在做的事情，没有人注意到他们在移动，”技术主管埃文阿诺德说在 Sanzaru，它还开发了“Asgard&#39;s Wrath”，这是 2019 年的旗舰 Oculus 游戏之一。 “他们只是觉得沉浸在那个动作中。”其他选项，例如在屏幕边缘添加变暗效果），通过让玩家专注于他们的视觉中心并模糊他们匆忙的像素来帮助抑制像素速度的影响。像这样的技巧帮助 Sanzaru 的球员免于冲刺到附近的垃圾桶。 “一旦对运动的期望与你正在做的事情发生冲突，人们就会头晕目眩，”阿诺德说。巧妙而简单的解决方案在游戏中拯救了许多玩家，例如使用基本资产来阻止玩家生病并充当边界。 “在 [VR Sports Challenge] 中，我们有一个足够简单的解决方案，当你靠近那堵墙时，有一幅静态艺术吸引了你。”像“Asgard&#39;s Wrath”这样的游戏只使用流畅的动作，这是当前 VR 游戏的典型风格。标题是一个成熟的 RPG，支持完全自由的移动和基于动作的剑摆动。在 VR 空间中很少见，它是一种更加“典型”的游戏体验，即使使用完全渲染的玩家角色模型，也避免了 VR 游戏中常见的浮动手。 VR 开发的一个重要目标是寻找新方法让运动更舒适，并为已经通过数小时游戏获得“VR 腿”的玩家提供游戏。 VR 病是由最初的不适和缺乏硬件经验引起的，就像尝试任何新事物一样，随着时间的推移，一些用户会为此产生胃口。虽然传送是一种解决方案，但它是一种粗略的解决方案，它将玩家带出体验，提醒他们他们并不存在于游戏世界中。毕竟，VR 的梦想是让玩家熟悉并喜欢在头显中工作的传统游戏体验，以提升沉浸感。但是在“Asgard&#39;s Wrath”中做出的设计选择是有代价的：也就是说，可能会因为晕车而失去大量玩家，甚至只是害怕晕车。野心和新兴技术的顽固事实之间存在微妙的平衡。\n“作为开发人员，如果你不能四处走动，你能用传送机制做很多事情，创造这种沉浸感，VR 真正带来的沉浸感，”阿诺德说。在 Insomniac，《棘轮与叮当》和《漫威蜘蛛侠》以及许多其他游戏背后的开发者，VR 是一个诱人的命题——他们是最早加入的 AAA 开发者之一。事实上，工作室是如此热情，它围绕最初的 Oculus Kickstarter 推出成立了一个新工作室。使用这项新兴技术的开发人员不断突破界限，并随着基于触摸的控制器的出现，实现了基于运动的全身体验。 Oculus Touch 控制器和 Valve “Knuckles”（其他简单命名的 Index Controller 的一个亲切的口语名称）等输入方法允许实时跟踪玩家的手、手指和手臂。对于 Insomniac 来说，这些进步具有启发意义。 “几乎没有机会回到没有手部追踪的世界，”戴利说。但乍一看，Insomniac 2019 年的 VR 产品“Stormland”似乎是该技术的噩梦。许多 VR 的舒适规则被打破，玩家在一个开放的世界中飞行，自由移动和跳跃。首席设计师迈克·戴利 (Mike Daly) 知道，他们正在尽一切可能——并且为玩家所接受。 “Stormland 看起来更像是‘让我们尝试一堆看起来错误的东西，而且看起来真的很不舒服’，与我们仅仅建立在我们所学知识的基础上相比，广泛的探索性方法最终带来了更多的创新在《无处的边缘》和《不言而喻》中感到舒适，”戴利说，指的是工作室早期涉足 VR 领域。\n一个彻底的改变，通过愿意将传统抛到窗外（以及一丝固执）而浮出水面，是引入了一个跳跃按钮。 “在很长一段时间内，跳跃都存在阻力，我相信它会奏效，基本上我只是把它放在游戏中，人们已经习惯了，”《Stormland》的首席游戏程序员 Joel Bartley 说， ”和“无处的边缘”。办公室的舒适度各不相同，因此玩家的测试台帮助 Insomniac 迭代了“风暴之地”中最激烈的部分。游戏运动系统的原型设计在游戏开发正式开始之前就开始了。迭代将一直持续到“Stormland”开发的最后阶段。用户对 VR 的投资比以往任何时候都多，开发人员正在尝试利用这项技术。 Valve 发布了十多年来第一款作为 VR 独家产品的“半条命”游戏，并且耳机销量在预期中翻了一番。 Facebook 的收入也有所增加；该公司表示，它在 2020 年第一季度的非广告收入为 2.97 亿美元，这主要是由 Oculus 销售推动的——比去年同期高出 80%。但即使需求不断增长，VR 仍然是利基市场。像《半条命：爱丽克斯》这样的游戏在发布时就有超过 40,000 名并发 Steam 用户，这只是像《绝地求生》这样的流行游戏的一小部分，后者一度拥有超过 300 万并发用户。 VR 显然仍在增长，但它有一些巨大的障碍。耳机价格昂贵，而且消费者群体很小。说服开发者投入金钱、时间和资源来打造 AAA 级 VR 体验是一件很难的事情。尽管存在明显的障碍和缺点，但开发人员仍保持着使用 VR 的热情。摒弃传统游戏开发的正统观念，从头开始，同时制作一款让数百万已经享受游戏的人感到舒适和熟悉的软件，这是一项极具吸引力的挑战。但即使创造力将开发人员引向不同的解决方案，他们也都朝着同一个方向发展：增加工具套件，帮助玩家轻松地进入 VR 世界。 “这些设置的标准化总体上对整个行业有很大帮助，因为玩家可以在不同的游戏中习惯它们并获得他们的&#39;海腿&#39;，”戴利说。\nDerek Swinhart 是在 PC 硬件行业工作的自由作家。你可以在 Twitter @Derek_Swinhart 上关注他。当天最重要的新闻报道，由邮政编辑策划，每天早上发布。", "note_en": "From a distance, virtual reality games might seem primitive and unsophisticated compared to more traditional titles. Players’ hands float in midair as they vault across virtual space, crudely teleporting from point to point.\n  Perhaps a change in perspective is called for. What players may not know is that teleportation is not a lazy solution to moving about in virtual reality, but a direct response to motion sickness. Floating hands are a design choice, not a shortcut. The games aren’t bad. It’s just that virtual reality often has to reinvent the wheel.\n Virtual reality, or VR, is still a testing ground of game design, and one area in which there are few standards when it comes to control schemes and design choices. The homogeneity of traditional open-world titles, role-playing games, and first-person shooters does not exist, and where pressing a trigger to shoot or a face button to crouch is ubiquitous on console, VR games are still testing the best ways to make games fun and players comfortable. While using an odd button to crouch or attack may be cumbersome on consoles, the wrong decision in VR can make players physically ill, resulting in nausea, eyestrain, and other side-effects. In virtual reality, your whole body is engaged in a way unlike anything in traditional games. From the requirement of the headset needing to fit different head sizes and shapes and remain comfortable for long stretches, to the lenses themselves, VR opens up the number of variables considerably.\n  For many, the most common problem is “VR Sickness,” a term adopted by developers and players to describe the various afflictions caused by playing VR games. Nausea, dizziness, disorientation and a number of other motion-sickness related symptoms are common with many VR users and this is exacerbated by the nature of virtual reality: The player’s eyes tell their brain they are walking, while their body tells them that they are still.\n   “You can experience this in everyday life, such as when you read a book in the back of a car — your vision is fixed on a stationary object, but your peripheral vision and inner ear are detecting movement,” said Matt Dickman, technical program manager for health &amp; safety at Oculus, the company that led the VR charge and was subsequently bought by Facebook in 2014.\n It’s a problem that he — and many others in the billion dollar industry — have been tasked with solving.\n   VR sickness is the reason some users fall over or get sick with more traditional, smooth movement systems (i.e. you push a control stick and move forward, like in a standard first-person game). Pixel velocity is an example of one of the many issues that cause VR sickness. The speed of pixels moving across your field of vision is different to the speed of the player. While similar to the feeling of seeing movement while standing still, pixel velocity accounts for when the world rushes around the player, or provides a sense of falling or movement even when the player is represented as still in the game.\n   Teleportation is a common solution, which breaks the illusion but keeps players moving through the world without tricking their mind into thinking they are walking. It is why so many VR games are “experiences,” rail-shooters and puzzle games. Keeping players in one spot is an easy solution to avoiding the pitfalls of motion sickness.\n Simple tricks learned over development, such as bringing up static artwork or controlling where the user focused their attention, helped mitigate nausea. In “VR Sports Challenge,” the developer, Sanzaru, saw a decrease in motion sickness when players focused on something specific.\n “In our football game, when you are receiving a football catch, we are actually sliding you along a rail, but because the user is so focused on what they were doing, nobody noticed they were moving,” said Evan Arnold, head of technology at Sanzaru, which also developed “Asgard’s Wrath,” one of 2019’s flagship Oculus titles. “They just felt immersed in that motion.”\n   Other options, such as adding a darkening effect around the edge of the screen), help curb the effect of pixel velocity by keeping players focused on their center of vision and blurring the pixels rushing by them. Tricks like this helped save Sanzaru’s players from a sprint to a nearby trash can.\n “As soon as the expectation of movement breaks from what you’re doing, people would get woozy,” Arnold said. Clever and simple solutions saved many players in the game, like using rudimentary assets to stop players from getting sick and acting as a boundary. “In [VR Sports Challenge], we had a simple enough solution, as you approach that wall, there was a piece of static art that caught you.”\n  Games like “Asgard’s Wrath” used only smooth movement, a style atypical of current VR titles. The title, a full-fledged RPG, supports total freedom of movement and motion-based sword swinging. A rarity in the VR space, it is a much more “typical” gaming experience, even using a fully rendered player character model, eschewing the floating hands so often seen in VR titles. An important goal of VR development is to find new ways to make movement more comfortable and to provide games for players who have already gained their “VR legs” through hours of play.\n  VR sickness is caused by initial discomfort and lack of experience with the hardware, much like trying anything new, some users build a stomach for it over time. While teleportation is a solution, it is a crude one, and brings players out of the experience, reminding them that they are not physically present within the game world. The dream of VR, after all, is getting the traditional gaming experiences players know and love to work in headsets, to up the immersion. But the design choices made in “Asgard’s Wrath” come at a cost: Namely, the possibility of losing a large player base to motion sickness, or even just fear of motion sickness. There’s a delicate balance between ambition and the stubborn facts of nascent technology.\n   “As developers, there is only so much you can do with teleportation mechanics, creating this sense of immersion that VR really brings to the table, if you can’t move around,” Arnold said.\n  At Insomniac, the developers behind “Ratchet and Clank” and “Marvel’s Spider-Man,” among many other titles, VR was a tantalizing proposition — and they were among the earliest AAA developers to jump in. The studio was so enthusiastic, in fact, it formed a new studio around the initial Oculus Kickstarter launch.\n Developers working with the fledgling tech are constantly pushing boundaries, and have realized full body, motion-based experiences with the advent of touch-based controllers. Input methods like the Oculus Touch controllers and the Valve “Knuckles” (a loving, colloquial name for the otherwise plainly-named Index Controllers) allow players&#39; hands, fingers, and arms to be tracked in real time.\n   For Insomniac, these advancements were revelatory. “There is almost no chance of going back to a world without hand tracking,” said Daly.\n But at a glance, “Stormland,” Insomniac’s 2019 VR offering, would appear to be a nightmare for the technology. Many of VR’s rules of comfort are broken, with players flying around an open world, freely moving and jumping.\n  Mike Daly, the lead designer, knew that they were playing on the frontier of what was possible — and acceptable to players.\n “Stormland looked a lot more like ‘let’s try a bunch of stuff that seems wrong and seems like it’s gonna be really uncomfortable,’ and the broad explorative approach ended up with a lot more innovations than if we just built on what we had learned about comfort in ‘Edge of Nowhere’ and ‘The Unspoken,’” Daly said, referring to the studio’s earlier forays into VR.\n  One radical departure, surfaced through a willingness to throw convention out the window (along with a pinch of stubbornness), was the introduction of a jump button. “For a long time, there was resistance to a jump, and I was convinced it would work, and basically I just put it in the game, and people got used to it,” said Joel Bartley, lead gameplay programmer on “Stormland,” and “Edge of Nowhere.”\n   Comfort levels varied in the office, so the test bed of players helped Insomniac iterate on the most intense parts of “Stormland.” Prototyping on the game’s movement systems started before development on the game began in earnest. Iteration would continue up until the final stages of “Stormland’s” development.\n There is more user investment than ever into VR, and developers are taking tentative chances with the tech. Valve released its first “Half-Life” game in over a decade as a VR exclusive, and saw headset sales double in anticipation. Facebook saw an increase in revenue as well; the company says it made $297 million dollars in non-ad revenue in the first quarter of 2020 that was driven largely by Oculus sales — 80 percent higher than in the same period the year before.\n  But even with demand growing, VR remains niche. Games like “Half-Life: Alyx” saw over 40,000 concurrent Steam users at launch, which is only a fraction of popular games like “PUBG,” which at one point had over three million concurrent users. VR is still clearly growing, but it has some huge barriers. Headsets are pricey, and command a small consumer base. Convincing developers to invest money, time and resources into making a AAA experience in VR is a hard sell.\n   Despite the obvious obstacles and shortcomings, developers maintain enthusiasm for working with VR. Throwing out the orthodoxies of traditional game development and starting from scratch, all while making a piece of software that should be comfortable and familiar to the millions who already enjoy games, is an appealing challenge.\n But even as creativity leads developers to different solutions, they all trend in the same direction: growing the suite of tools that will help players slip comfortably into the world of VR.\n “The standardization of those settings has been a big help for the whole industry in general, because the player can get used to them from game to game and get their ‘sea legs,’” said Daly.\n Derek Swinhart is a freelance writer working in the PC hardware industry. You can follow him on Twitter   @Derek_Swinhart .\n     The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-07-27 21:32:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,游戏,reality", "title": "虚拟现实存在真正的问题——这是游戏开发者试图删除它们的方法", "title_en": "Virtual reality has real problems–Here’s how game developers seek to delete them", "transed": 1, "url": "https://www.washingtonpost.com/video-games/2021/01/21/virtual-reality-2021/", "via": "", "real_tags": ["开发", "游戏", "reality"]}, {"category": "", "categoryclass": "", "imagename": "5cce0bde9a929bd9d85a2c232478b2dc.jpeg", "infoid": 1070008, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于加密货币价格暴跌，特斯拉在第二季度报告了 2300 万美元的与比特币相关的减值。截至 3 月底，该汽车制造商表示，根据第一季度比特币的激增，其 15 亿美元的投资价值 24.8 亿美元。特斯拉周一表示，与比特币相关的 2300 万美元减值对其季度营业收入造成了一定的拖累。这家电动汽车公司在其第二季度的公告中只提到了一次比特币或加密货币，此前首席执行官埃隆·马斯克 (Elon Musk) 就特斯拉是否接受用于汽车购买的数字货币进行了反复讨论。这个话题在特斯拉与投资者和分析师的电话会议上根本没有出现。今年 2 月，特斯拉宣布以 15 亿美元购买比特币——超过其整个季度研发预算——并表示可能会继续投资加密货币。截至 3 月底，该公司表示，基于第一季度比特币的激增，其投资价值 24.8 亿美元。特斯拉报告称，第一季度比特币销售净收益为 1.01 亿美元，有助于将其净利润提升至历史新高。在该公司的运营报表中，这一收益表现为运营费用的减少，这表明随着该季度比特币价格上涨，该公司抛售了部分持股。但是比特币的价格在第二季度暴跌了 40% 以上，因此特斯拉持有的比特币价值将远低于第一季度末。加密货币在 4 月份达到 63,000 美元以上的峰值，然后在本月早些时候跌至 30,000 美元以下。比特币目前的交易价格略低于 40,000 美元。\n特斯拉没有将比特币视为按市值计价的资产，这意味着它只有在出售以锁定收益时才会确认收益收益。因此，只要特斯拉没有剥离其持有的任何股份，比特币价值的下跌就不会影响收益。与通过风险投资部门支持科技初创企业的公司相比，这是一种不同的投资报告方式。在这些情况下，公司通常每季度根据市场价格标记其持股，通过后续融资轮或公开股票价格确定价值。尽管有比特币费用，特斯拉的营业收入还是比去年同期翻了两番，达到 13 亿美元。根据 Refinitiv 的数据，收入为 119.6 亿美元，每股收益为 1.45 美元，均高于分析师的预期。周一盘后交易中，特斯拉股价上涨 1.4%，至 666.59 美元。该股是近年来表现最好的股票之一，自 1 月以来已下跌超过 25%。", "note_en": "Tesla reported bitcoin-related impairments of $23 million in the second quarter as crypto prices plunged.\n As of the end of March, the automaker said its $1.5 billion investment was worth $2.48 billion, based on the surge in bitcoin in the first quarter.\n Tesla said Monday that a $23 million bitcoin-related impairment caused some drag on its quarterly operating income.\n The electric auto company only referred to bitcoin or crypto one time in its second-quarter announcement, after CEO  Elon Musk went back and forth on whether Tesla would accept the digital currency for vehicle purchases. The subject didn&#39;t come at all on Tesla&#39;s conference call with investors and analysts.\n  In February, Tesla  announced a $1.5 billion purchase of bitcoin – more than its entire quarterly research and development budget – and said it may continue investing in cryptocurrencies. As of the end of March, the company said its investment was  worth $2.48 billion, based on the surge in bitcoin in the first quarter.\n Tesla reported a net gain of $101 million from sales of bitcoin during the first quarter, helping to boost its  net profits to a record high. On the company&#39;s  statement of operations, that gain shows up as a reduction in operating expenses, suggesting that it flipped some of its holdings as bitcoin prices rose that quarter.\n But the price of bitcoin plunged more than 40% in the second quarter, so Tesla&#39;s holdings  would be worth much less than at the end of the first quarter. The  cryptocurrency  peaked above $63,000 in April, and then dropped below $30,000 earlier this month. Bitcoin is currently trading just shy of $40,000.\n Tesla doesn&#39;t account for bitcoin as a mark-to-market asset, meaning it only recognizes an earnings benefit if it sells to lock in the gains. Therefore, the drop in the value of bitcoin shouldn&#39;t affect earnings as long as Tesla hasn&#39;t divested of any of its holdings.\n  That&#39;s a different way of reporting investments than companies that back tech start-ups through their venture arms. In those instances, companies typically mark their holdings every quarter based on the market price, determining the value by a follow-on financing round or a public stock price.\n  Despite the bitcoin expense, Tesla&#39;s  operating income quadrupled to $1.3 billion from the same period a year earlier.  Revenue of $11.96 billion and earnings per share of $1.45 both topped analysts&#39; estimates, according to Refinitiv.\n Shares of Tesla rose 1.4% in after-hours trading Monday to $666.59. The stock, among the best market performers in recent years, has dropped more than 25% since January.", "posttime": "2021-07-27 20:44:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "比特币,特斯拉,减值,bitcoin", "title": "特斯拉在其第二季度收益报告中表示，在比特币从 4 月份的 6.3 万美元跌至现在的 4 万美元以下之后，它遭受了 2300 万美元的比特币相关减值损失", "title_en": "In its Q2 earnings report, Tesla says it suffered $23M in bitcoin-related impairments, after bitcoin dropped from $63K in April to under $40K now", "transed": 1, "url": "https://www.cnbc.com/2021/07/26/tesla-records-23-million-in-bitcoin-related-impairments-in-q2.html", "via": "", "real_tags": ["比特币", "特斯拉", "减值", "bitcoin"]}, {"category": "", "categoryclass": "", "imagename": "bd95f2c4f41881c0df8464c41d38e245.jpg", "infoid": 1070007, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "梅赛德斯-奔驰正在宣传其即将推出的新型超高效电动汽车，该汽车制造商声称其续航里程将超过 1,000 公里（620 英里）。今天，梅赛德斯-奔驰宣布了一项更新的电气化计划，其中包括到 2030 年实现全电动的新计划。该计划于去年首次宣布，当时该汽车制造商正在谈论续航里程超过 750 英里（1200 公里） .我们的 VISION EQXX – 象征着我们打造最高效汽车的雄心。加入我们，在我们的梅赛德斯-奔驰战略更新中了解更多令人兴奋的消息。 7 月 22 日。 https://t.co/QeQIxYctGC pic.twitter.com/baiUTycuvE “VISION EQXX：梅赛德斯-奔驰目前正在开发 Vision EQXX，这是一款实际续航里程超过 1,000 公里的电动汽车，目标是个位数在正常高速公路行驶速度下，每 100 公里（每千瓦时超过 6 英里）为千瓦时。包括梅赛德斯-奔驰 F1 高性能动力总成部门 (HPP) 专家在内的多学科团队正在朝着该项目的宏伟目标快速推进。全球首演将在 2022 年举行。”虽然这听起来不像汽车制造商计划发布车辆的量产版本，但它确实确认将使用它作为开发新电动架构的平台：“Vision EQXX 取得的技术进步将被改编并应用于在新的电气架构中的潜在用途。”\n梅赛德斯-奔驰宣布，他们正在开发三个新的电动平台，将于 2025 年问世，并为该品牌的几款新电动汽车提供动力。虽然我不是非生产概念车的忠实粉丝，但我确实希望看到传统汽车制造商明确关注效率。多年来，特斯拉在这方面一直处于领先地位，但有些公司开始迎头赶上，像这样的努力和奥迪的 Artemis 计划就是很好的例子。您正在阅读 Electrek — 日复一日地发布有关特斯拉、电动汽车和绿色能源新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 Electrek 以了解最新消息。不知道从哪里开始？查看我们的 YouTube 频道以获取最新评论。", "note_en": "Mercedes-Benz is teasing its upcoming new super-efficient electric car that the automaker claims will have over 1,000 km (620 miles) of range.\n   Today, Mercedes-Benz announced an updated electrification plan that included  a new plan to go all-electric by 2030.\n   It was first announced last year, and at the time, the automaker was talking about  a range of over 750 miles (1200 km).\n   Our VISION EQXX – a symbol of our ambition to create the most efficient car. Join us for more exciting news at our Mercedes-Benz Strategy Update. July 22nd. https://t.co/QeQIxYctGC  pic.twitter.com/baiUTycuvE\n  “VISION EQXX: Mercedes-Benz is currently developing the Vision EQXX, an electric car with a real world range of more than 1,000 kilometres, targeting a single-digit figure for Kwh per 100 kilometres (over 6 miles per Kwh) at normal highway driving speeds. A multi-disciplinary team including experts from Mercedes-Benz’s F1 High Performance Powertrain division (HPP) is making rapid progress towards the project’s ambitious goals. The world premiere will be in 2022.”\n While it doesn’t sound like the automaker plans to release a production version of the vehicle, it did confirm that it will use it as a platform to develop its new  electric architectures:\n “Technological advances made with Vision EQXX will be adapted and applied for potential use in new electric architectures.”\n Mercedes-Benz announced that they are developing three new electric platforms to come out in 2025 and power several new electric vehicles for the brand.\n  While I am not a big fan of concept vehicles not meant for production, I do like to see legacy automakers putting a clear focus on efficiency.\n For years, Tesla had a clear lead on that front, but some are starting to catch up, and efforts like this and Audi’s Artemis program are good examples.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2021-07-27 20:44:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推出,efficient", "title": "梅赛德斯-奔驰推出超高效电动汽车，续航里程超过 1000 公里（620 英里）", "title_en": "Mercedes-Benz teases super-efficient EV with over 1k km (620 miles) of range", "transed": 1, "url": "https://electrek.co/2021/07/22/mercedes-benz-teases-super-efficient-electric-car/", "via": "", "real_tags": ["推出", "efficient"]}, {"category": "", "categoryclass": "", "imagename": "3bdb1399004cf61a9ad677d6ba54d724.jpg", "infoid": 1070006, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近重看了侠盗一号：星球大战的故事。除了卢卡斯影业试图使用 CGI 将凯莉·费雪的莱娅公主和彼得·库欣的大总督塔金带回大银幕外，它大部分时间都坚持了下来。这是我第一次看到它时最让我烦恼的东西。但是 Lucasfilm 的 Industrial Light and Magic 现在可能有能力让这些电影更具前瞻性，因为它聘请了一位专门制作《星球大战》和其他大预算电影的 YouTuber，展示了他们的 CGI 去老化技术。 Shamook 是将《曼达洛人》中卢克·天行者的客串“修复”到 190 万个视频的人，而《侠盗一号》中的塔金的改进是惊人的：彼得·库欣在这个角色中确实很瘦，但他看起来不再那么憔悴了。 IndieWire 现在没有命令 YouTube 删除内容或发出停止令，而是报道 Lucasfilm 决定聘请 Shamook 来做他们显然喜欢的事情。 “[工业光与魔法]一直在寻找才华横溢的艺术家，实际上已经聘请了在线角色&#39;Shamook&#39;的艺术家，”卢卡斯影业代表告诉IndieWire（通过CNET）。 “在过去的几年里，ILM 一直在投资机器学习和人工智能，作为制作引人注目的视觉效果作品的一种手段，随着技术的进步，看到这个领域的势头正在增强，真是太棒了。”在 YouTube 对最近视频的评论中，Shamook 说他们的新头衔是“高级面部捕捉艺术家”。我不确定 Shamook 的结果总是比原始结果好；许多人仍然拥有那种不可思议的、面具般的品质，这在今天的许多 Deepfake 中仍然很常见，而且他们没有从迪士尼现代电影和节目中明显使用的所有额外 CG 照明工作中受益。但也许通过结合想法，他们可以达到新的高度。 Shamook 还喜欢交换明星，著名的作品是将哈里森·福特插入到 Solo: A Star Wars Story 中。", "note_en": "I recently re-watched  Rogue One: A Star Wars Story. It mostly held up — except for Lucasfilm’s attempt to bring Carrie Fisher’s Princess Leia and Peter Cushing’s Grand Moff Tarkin back to the big screen using CGI. That’s something that only bugged me the tiniest bit the first time I watched it.\n But Lucasfilm’s Industrial Light and Magic may now have the ability to make those movies a tad more futureproof, because it’s hired a YouTuber who specializes in deepfaking Star Wars and other big-budget movies, showing up their CGI de-aging techniques.  Shamook is the one who “fixed” Luke Skywalker’s cameo in  The Mandalorian  to the tune of 1.9 million videos, and the improvements to  Rogue One’s Tarkin are phenomenal:\n  Peter Cushing was certainly thin in the role, but he no longer looks quite so emaciated.\n Instead of ordering YouTube to yank the content or sending cease-and-desists,   IndieWire now reports Lucasfilm decided to hire Shamook instead to do what they apparently love. “[Industrial Light and Magic is] always on the lookout for talented artists and have in fact hired the artist that goes by the online persona ‘Shamook,’” a Lucasfilm representative told  IndieWire (via    CNET ). “Over the past several years ILM has been investing in both machine learning and A.I. as a means to produce compelling visual effects work and it’s been terrific to see momentum building in this space as the technology advances.”\n In the YouTube comments on a recent video, Shamook says their new title is “Senior Facial Capture Artist.”\n I’m not sure Shamook’s results are always better than the originals; many still have that uncanny, mask-like quality that’s still common to a lot of deepfakes today, and they don’t have the benefit of all the additional CG lighting work that clearly went into Disney’s modern films and shows. But perhaps by combining ideas, they can reach new heights.\n Shamook also has a penchant for swapping stars, famously  inserting Harrison Ford into  Solo: A Star Wars Story.", "posttime": "2021-07-27 20:44:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,影业,hires,电影", "title": "卢卡斯影业聘请了让卢克客串蒙羞的 YouTube deepfaker", "title_en": "Lucasfilm hires the YouTube deepfaker who put its Luke cameo to shame", "transed": 1, "url": "https://www.theverge.com/2021/7/26/22595227/star-wars-lucasfilm-mandalorian-rogue-one-hire-deepfake-shamook", "via": "", "real_tags": ["youtube", "影业", "hires", "电影"]}, {"category": "", "categoryclass": "", "imagename": "20f417fed5bedf095d357e752c9d08c3.png", "infoid": 1070005, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Capsule 是一个用于网络功能开发的框架。用 Rust 编写，受 NetBricks 的启发，构建在英特尔的数据平面开发套件上。 jrugged 库允许您的代码以负责任的方式适应网络问题。 Sheens 是一个托管消息处理状态机的自动化引擎。这些机器以原子方式高效地处理和发出消息。最初的动机是实施面向物联网的家庭自动化；然而，Sheens 在其他设置中也很有用 Sirius 是一个用于在节点集群之间分发和协调数据更新的库。 Sirius 使节点集群能够使开发人员控制的内存中数据结构最终保持一致，从而允许对共享信息进行无 I/O 访问。用于构建具有 MVP 架构的 Android 应用程序的紧凑框架。 Blueprint 帮助 Android 开发人员使用 Android RecyclerView 库构建可滚动的离散组件列表。一个旨在帮助您和您的团队使用原子设计原则构建深思熟虑、模式驱动的用户界面的框架。\nSurf-N-Perf 提供了一个简单易用的 API，可以在任何浏览器中收集用户计时和其他重要的性能数据。 SpeedtestJS 是一种基于 JavaScript 的速度测试，为用户提供丰富的互联网速度视图。我们开发并开源了 SpeedTestJS 以创建一个基准解决方案，该解决方案将透明、独立并被许多人使用和贡献。分布式单调时钟 (DMC)，其时间戳可以反映因果关系，但其组件与挂钟时间保持接近。该方案建立在先前的混合逻辑时钟建议之上，通过添加重要的操作钩子和内置机制来防止单个失控的系统时钟将整个集群的逻辑时钟拖到未来。更多在 YouTube。流量控制是一种缓存服务器控制平面应用程序，用于将缓存服务器聚合到内容交付网络 (CDN) 中。为流量控制选择的 CDN 缓存软件是 Apache Traffic Server (ATS)。尽管当前版本仅支持 ATS 作为缓存，但这可能会随着未来的版本而改变。 Apache Hadoop YARN（Yet Another Resource Negotiator）是一种集群管理技术。这允许您构建一个镜像来部署 kube-yarn 工件，而无需任何本地依赖项。 Bynar 是一个开源系统，用于跨数据中心自动化服务器维护。 Bynar 建立在多年自动化服务器维修工作的经验之上。目标是让数据中心自行维护。\n在防火墙繁重的环境中，能够测试和验证您的防火墙规则至关重要。该实用程序旨在通过拥有“规则文件”来实现自动化，然后该脚本将对其进行处理，并将通过 SSH 连接到每台机器并尝试连接到指定端口上的目标主机。 Trickster 是 Prometheus HTTP APIv1 的反向代理缓存，可显着加快从 Prometheus 查询的任何系列的仪表板渲染时间。 VinylDNS 是一个与供应商无关的前端，用于支持自助服务并增强所有 DNS 服务器的管理。 Curtail 是一个实用程序，它读取标准输入并写入固定大小的文件。 Kuberhealthy 在 Kubernetes 集群内执行综合测试，以发现否则会被忽视的问题。包目前提供 AAC 解析功能。此包执行 AAC-LC 和 HE-AACv1 比特流的完整解析。尚不支持具有参数立体声 (HE-AACv2) 的比特流，但将提取 AAC 比特流数据和 SBR 数据。尚未实现从解析数据到 LPCM (.wav) 的 AAC 解码。请帮助我们扩展和测试这个库！ WebPA 是服务器和客户端的组合，它提供了一个简单的界面来访问 RDK 设备上的 TR-181 对象。 WebPA 利用 XMiDT 连接到 RDK 设备。\nWebpa 是一个非常简单的微服务和客户端，它提供了一个 REST 接口来访问 RDK 设备上的 TR-181 数据模型。 XMiDT（发音为“transmit”）是服务器集群和客户端的组合，可为部署在世界各地的设备提供高度可用的数据路径。设备通过 xmidt 客户端连接到 XMiDT 云。基于云的服务可以使用 XMiDT 云 api 从设备发送和接收消息，而无需担心设备在世界或网络中的位置。轻松地从设备推送和拉取数据。 Codex 接受传入事件，将它们存储在 postgres 数据库中，并按设备 ID 提供事件信息。该层的目标是使设备能够与集中式 Web 路由器（集群）进行交互，该路由器将消息路由到/来自另一端的各种服务。从服务的角度来看，该层提供了一个集中的机制，以可扩展的方式直接与现场数百万台授权设备交互。", "note_en": "Capsule is a framework for network function development. Written in Rust, inspired by  NetBricks and built on Intel&#39;s  Data Plane Development Kit.\n  The jrugged library allows your code to adapt to network issues in a responsible way.\n  Sheens is an automation engine that hosts message-processing state machines. These machines process and emit messages efficiently and atomically. The initial motivation was implementing IoT-oriented home automations; however, Sheens has been useful in other settings\n  Sirius is a library for distributing and coordinating data updates amongst a cluster of nodes.\n  Sirius enables a cluster of nodes to keep developer-controlled in-memory data structures eventually consistent, allowing I/O-free access to shared information.\n  A compact framework for building Android apps with an MVP architecture. Blueprint helps Android devs build scrollable lists of discrete components using the Android RecyclerView library.\n  A framework designed around helping you and your team build thoughtful, pattern-driven user interfaces using the atomic design principles.\n  Surf-N-Perf provides a simple to use API to gather User Timing and other important performance data in any browser.\n  SpeedtestJS is a JavaScript based speed test providing users with an enriched view of their Internet speed. We developed and open sourced SpeedTestJS to create a benchmark solution that would be transparent, independent and used and contributed by many.\n  Distributed monotonic clocks (DMC) whose timestamps can reflect causality but which have a component that stays close to wall clock time. This scheme builds on previous hybrid logical clock proposals by adding important operational hooks and by building in mechanisms to prevent a single runaway system clock from dragging a whole cluster&#39;s logical clocks forward into the future.  More at YouTube.\n  Traffic Control is a caching server control plane application used to aggregate caching servers into a Content Delivery Network (CDN).\n  The CDN caching software chosen for Traffic Control is Apache Traffic Server (ATS). Although the current release only supports ATS as a cache, this may change with future releases.\n  Apache Hadoop YARN (Yet Another Resource Negotiator) is a cluster management technology. This allows you to build an Image for deploying the kube-yarn artifacts without any local dependencies.\n  Bynar is an open source system for automating server maintenance across the datacenter.\t\t\tBynar builds upon many years of experience automating the drudgery of server repair.\t\t\tThe goal is to have the datacenter maintain itself.\n  In a firewall heavy environment, being able to test and validate your firewall rules is essential. This utility aims to automate that by having &#34;rules files&#34; which this script then procesess and will SSH into each machine and try connecting to the target host on the specified port.\n  Trickster is a reverse proxy cache for the Prometheus HTTP APIv1 that dramatically accelerates dashboard rendering times for any series queried from Prometheus.\n  VinylDNS is a vendor-agnostic frontend for enabling self-service and enhancing administration across all of your DNS servers.\n    Curtail is a utility program that reads stdin and writes to a fixed size file.\n  Kuberhealthy performs synthetic tests from within Kubernetes clusters in order to catch issues that would otherwise go unnoticed.\n  Package currently provides AAC parsing capabilities. This package performs a full parse of AAC-LC and HE-AACv1 bitstreams. Bitstreams with Parametric Stereo (HE-AACv2) are not yet supported, but AAC bitstream data and SBR data will be extracted. The AAC decode from the parsed data to LPCM (.wav) is not yet implemented. Please help us expand and test this library!\n  WebPA is a combination of a server and client that provides a simple interface to access the TR-181 objects on an RDK device. WebPA leverages XMiDT for the connection to the RDK device.\n  Webpa is a very simple micro service and client that provides a REST interface to access the TR-181 data model on an RDK device.\n  XMiDT (pronounced &#34;transmit&#34;) is a combination of a server cluster and client that provide a highly available data path to devices deployed all over the world.\n  A device connects to the XMiDT cloud via the xmidt client. Cloud based services can use the XMiDT cloud api to send and receive messages from the devices without needing to worry about where the device is in the world or in the network. Push and pull data from the device with ease.\n  Codex accepts incoming events, stores them in a postgres database, and provides event information by device id.\n  The goal of this layer is to enable devices to interact with a centralized web router (cluster) that routes the messages to/from various services on the other side. From the service perspective, this layer provides a centralized mechanism to directly interact with millions of authorized devices in the field in a scalable manor.", "posttime": "2021-07-27 20:43:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,大量,contributes,设备", "title": "康卡斯特贡献了大量开源", "title_en": "Comcast contributes a lot of open source", "transed": 1, "url": "https://comcast.github.io", "via": "", "real_tags": ["开源", "大量", "设备"]}, {"category": "", "categoryclass": "", "imagename": "322bab710cd9f058fca41dad8e11c05d.jpeg", "infoid": 1070004, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司已经筹集了 2 亿美元，这是一个 C 系列，它将用于其作为一项业务的下一步：在未来几个月内，它将转向 SaaS 模式——Wiliot 喜欢说这不是“软件即服务” ”，而是“感知即服务”，使用其人工智能读取和翻译连接到芯片的物体上的不同信号——以运行和销售其软件。这将与其芯片硬件向许可模式的转变相结合，以便它们可以由多个第三方生产。 Wiliot 表示，它已经就芯片许可部分达成了多项协议。反过来，该计划将导致芯片的新尺寸和外形范围。软银的 Vision Fund 2 牵头融资，之前的支持者——这是一个非常杰出的名单，说明了未来的机会——包括 83North、亚马逊网络服务公司 (AWS)、艾利丹尼森、格罗夫风险投资公司、M Ventures、 Merck KGaA、Maersk Growth、Norwest Venture Partners、NTT DOCOMO Ventures、Qualcomm Ventures LLC、三星风险投资公司、Vintage Investment Partners 和 Verizon Ventures。 Wiliot 的估值并未披露，但该初创公司的高级副总裁 Steve Statler 称其“符合”其转向 SaaS 的趋势。在更进一步的情况下，当我们上次报道 Wiliot 融资时，2019 年的 B 系列 3000 万美元，消息人士告诉我们它的价值为 1.2 亿美元，尽管从那时到现在，它也将 B 系列扩大到 7000 万美元，这意味着预融资估值接近 2 亿美元。根据基本的数学计算，这意味着现在的估值大约为 4 亿美元，尽管 SaaS 的重点以及对该技术许可的浓厚兴趣，意味着它很可能会更多。 （我会在了解更多信息时更新。）到目前为止，该公司一直专注于基于其芯片“版本 1”的业务开发，该芯片由 Wiliot 自己生产。 （很可能在 9 月正式发布的第 2 版将是第三方制造的芯片。）用 Statler 的话来说，Wiliot 的芯片是可打印的计算机，其大小和厚度与邮票一样，包含 RAM、ROM、传感器、蓝牙、ARM CPU、内存和安全通信功能，所有这些都依靠空气中的环境功率（无线电波）运行。像 RFID 标签一样薄，但功能更强大、更有用。 Statler 表示，到目前为止，Wiliot 有 30 名付费客户使用“数十万”这些芯片。但物联网的规模（和机会）是如此之大，即使在数十万个范围内，这些都不是完全部署，而是有限的测试。 Statler 告诉我，这样的一个客户是一家生产 Covid-19 疫苗的大型制药公司（名称未公开）：它将芯片连接到其疫苗瓶的一部分以监测温度、剂量（因为您可以从一个疫苗中获得几剂小瓶）和稀释，计划将来在所有疫苗中使用该系统。与 Wiliot 对话的其他行业包括消费品公司、家具公司和服装行业（一直是 RFID 的主要采用者）。在版本 2 中，环境功率方面也将扩展。在版本 1 中，芯片可以利用已经存在于空气中的无线电波的能量，以及通过提供功率提升的廉价设备来更均匀地传播无线电波。 Statler 说，现在这些助推器的范围在 1-3 米，但第 2 版将是一个“重大突破”，将扩大范围，使助推器成为更有趣的选择。值得注意的是，Wiliot 还一直在与 Sigfox 合作，后者也在开发一些非常创新的利用和使用环境能量的方法，所以也许我们应该关注这个领域。\n“这只是冰山一角，”首席执行官兼联合创始人 Tal Tamir 在 2019 年告诉我（不幸的是，这次他无法接受采访）。 “我们认为将会有许多边缘设备来收集射频能量。但问题不在于你收获了什么，而在于你需要多少。如果你获得纳瓦级的能量，而一部手机在活动时消耗 3-5 瓦特，你就可以看到它的去向。”对于像软银这样在其投资和所有权组合中围绕服务和硬件进行多次押注的公司来说，这里不仅作为财务支持者而且作为战略合作伙伴也有很多机会。 SoftBank Investment Advisers 的管理合伙人 Yanni Pipilis 在一份声明中表示：“通过发明第一台使用 AI 感知世界的超可扩展、自供电计算机，Wiliot 将数字和物理结合在一起。” “我们一直相信，有了物联网和人工智能，人们将过上更好、更健康的生活——任何食品或药物都能够了解使用是否安全并与人们进行无缝沟通。我们很高兴能够帮助 Wiliot 在全球范围内大幅扩展不断扩展的物联网应用。”", "note_en": "The company has raised $200 million, a Series C that it will use towards its next steps as a business: in the coming months, it will make a move into an SaaS model — which Wiliot likes to say refers not to “software as a service”, but “sensing as a service,” using its AI to read and translate different signals on the object attached to the chip — to run and sell its software. This will be combined with a shift to a licensing model for its chip hardware, so that they can be produced by multiple third parties. Wiliot says that it already has several agreements in place for the chip licensing part. The plan is for this, in turn, to lead to a new range of sizes and form factors for the chips down the line.\n Softbank’s Vision Fund 2 led the financing, with previous backers — it’s a pretty illustrious list that speaks of the opportunities ahead — including 83North, Amazon Web Services, Inc. (AWS), Avery Dennison, Grove Ventures, M Ventures, the corporate VC of Merck KGaA, Maersk Growth, Norwest Venture Partners, NTT DOCOMO Ventures, Qualcomm Ventures LLC, Samsung Venture Investment Corp., Vintage Investment Partners, and Verizon Ventures.\n  Wiliot’s valuation is not being disclosed but Steve Statler, the startup’s SVP, described as “in line” with its pivot to SaaS. For some further context, when we last covered Wiliot funding, a  $30 million Series B in 2019, sources told us it was valued at $120 million, although between then and now it also  extended that Series B to $70 million, implying a pre-money valuation of closer to $200 million. With basic math, that implies a valuation of more like $400 million now, although the SaaS focus, and strong interest already in licensing the tech, means it could easily be more. (I’ll update as and when I learn more.)\n Up to now, the company has been focusing on business development based on “version 1” of its chips, produced by Wiliot itself. (Version 2, which is likely to be announced officially in September, will be the chips that third parties will make.) Wiliot’s chips are, in the words of Statler, printable computers the size and thinness of postage stamps that contain RAM, ROM, sensors, Bluetooth, an ARM CPU, memory and secure communications capabilities, all running on ambient power (radiowaves) already in the air. Thin like RFID tags, these are significantly more powerful and useful.\n Statler said Wiliot has 30 paying customers so far using “hundreds of thousands” of these chips. But the scale (and opportunity) of IoT is such that even in the hundreds of thousands bracket, none of these are full deployments but limited tests.\n Statler told me that one such customer is a major pharmaceutical company (name not disclosed) that’s making Covid-19 vaccine: it’s attaching the chips to a proportion of its vaccine vials to monitor temperature, dosage amounts (since you get several doses out of one vial) and dilution, with the plan being to use the system across all of its vaccines in the future. Other industries that have been talking with Wiliot include consumer packaged goods companies, furniture companies and the apparel industry (which has been a big adopter of RFID).\n With version 2, the ambient power aspect will also expand. In version 1, the chips can harness energy from radio waves that are already in the air, as well as via inexpensive devices that provide a boost of power to spread the waves around more evenly. Right now the range of those boosters in 1-3 meters, Statler said, but version 2 will be a “major breakthrough” that will see that extended, making the booster a more interesting option. Wiliot also, notably, has been working with Sigfox, which is also developing some very innovative ways of harnessing and using ambient power, so maybe we should watch this space.\n “This is just the tip of the iceberg,” CEO and co-founder Tal Tamir told me back in 2019 (he wasn’t available for an interview this time around, unfortunately). “We think many edge devices will come that will harvest radio frequency energy. But the problem is not what you harvest but how much you need. If you get nanowatts of energy and a phone consumes 3-5 watts when active, you can see where this has to go.”\n For a company like SoftBank that is making multiple bets around services and hardware across its investment and ownership portfolios, there is a lot of opportunity here not just as a financial backer but strategic partner, too.\n “By inventing the first hyper-scalable, self-powered computer that uses AI to sense the world, Wiliot is positioned to bring together the digital and physical” said Yanni Pipilis managing partner at SoftBank Investment Advisers, in a statement. “We have always believed that with IoT and AI, people will live better and healthier lives – where any food or medicine has the ability to understand if it’s safe to use and communicate seamlessly with people. We are pleased to play a part in helping Wiliot dramatically scale the ever-expanding application of IoT globally.”", "posttime": "2021-07-27 20:04:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,技术,saas,wiliot", "title": "Wiliot 筹集了 2 亿美元，准备以 SaaS 为中心，将其超轻、环境功率芯片技术授权给第三方", "title_en": "\n\t\t\t\tWiliot raises $200M as it preps a SaaS pivot, licensing its ultra-light, ambient-power chip technology to third parties\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/wiliot-raises-200m-as-it-preps-a-saas-pivot-licensing-its-ultra-light-ambient-power-chip-technology-to-third-parties/", "via": "", "real_tags": ["芯片", "技术", "saas", "wiliot"]}, {"category": "", "categoryclass": "", "imagename": "0a69a2edf3cbf1edd883c0841a3556c4.png", "infoid": 1070003, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "密码管理平台 1Password 在 Accel 领导的一轮融资中以 20 亿美元的估值筹集了 1 亿美元。在这家加拿大公司发布一系列产品之后，加薪火热进行，包括将其扩展到机密管理以帮助企业保护其基础设施；一个新的 API，使安全团队能够将 1Password 登录数据直接汇集到 Splunk 等网络安全工具中；以及针对 DevOps 团队的新 Linux 桌面应用程序。 1Password 解决的最终问题是绝大多数数据泄露都是由于密码泄露造成的。 1Password 以 Slack、IBM 和 GitLab 等企业为目标，其平台允许用户安全地存储密码并通过单击即可登录无数在线服务。它还可以用于存储其他私人文档，例如软件许可证和信用卡详细信息。这家总部位于多伦多的公司于 2019 年筹集了其当时 14 年历史中的第一轮融资，当时它从 Accel、Slack（通过 Slack Fund）和 Atlassian 的创始人以及其他天使投资者那里获得了 2 亿美元。在此后的近两年里，该公司表示，其付费商业客户数量几乎翻了一番，达到 90,000 人，年经常性收入 (ARR) 达到 1.2 亿美元。 1Password 首席执行官 Jeff Shiner 表示，虽然多种因素推动了对密码管理工具的需求，但自上次筹款以来最大的变化是社会从办公室快速过渡到远程或混合工作。 “企业——无论大小——都被迫在一夜之间采用远程工作方式，”希纳告诉 VentureBeat。 “这种转变意味着，大多数习惯于集中办公的公司突然需要支持员工在家中使用自己的设备使用自己可能不安全的网络。随着远程混合转变，SaaS 工具大量涌现，以帮助保持人员和团队的工作效率。许多这些工具被引入以帮助特定团队解决特定问题，这意味着在整个组织中，可能有数百种不同的软件产品——所有这些都需要唯一的登录和访问权限。”帮助员工掌握所有登录凭据是 1Password 发挥作用的地方。\n许多公司正在解决所谓的“密码问题”，试图利用通过电子邮件或生物识别智能发送的“魔法链接”，试图从等式中完全删除密码。就在上周，分散式无密码身份验证平台 Magic 宣布筹集 2700 万美元，紧随其后的是 Transmit Security 以 23 亿美元的高估值筹集了 5.43 亿美元，而 Beyond Identity 锁定了 7500 万美元。在其他地方，当 Okta 以惊人的 65 亿美元收购 Auth0 时，来自身份和访问管理 (IAM) 领域的两个巨头联手。就 1Password 而言，它也接受了各种形式的无密码身份验证，包括与 Apple 的 Touch ID 和 Face ID 集成，使用户能够使用指纹或面部解锁 1Password，以及支持 Yubikey 等 2FA 硬件密钥。 Shiner 还暗示了一些可能与无密码身份验证相关的新产品，他预计将在未来几个月推出。 “我们正在密切关注无密码空间及其在未来几年的成熟度，但无论未来如何，我们都会以最安全和私密的方式为我们的客户提供支持，”他说。 “举个例子，生物识别技术在很多情况下都非常适合用于身份验证，因为它们确实传达了您独特的物理存在，”希纳说。 “但是，广泛使用生物识别技术带来了一个问题，即如果关于您的指纹或面部的数据被盗并且可能被攻击者操纵以冒充您，会发生什么情况。虽然您可以随心所欲地更改密码，但您的面部、指纹、声音或心跳却很难更换。” Shiner 说，虽然他的公司仍然非常有利可图，并且没有积极寻找新的投资，但吸引来自各行各业的无数新投资者——他称之为“合作伙伴”——的机会太好了，无法拒绝。事实上，在最近的融资中，一大批新的机构和天使投资者加入了竞争，包括 Ashton Kutcher 的 Sound Ventures、Kim Jackson 的 Skip Capital、Slack 联合创始人兼首席执行官 Stewart Butterfield、Shopify 首席执行官 Tobias Lutke、Squarespace 首席执行官 Anthony Caselana 和 Eventbrite 联合创始人凯文哈茨。从最近发布的产品中可以清楚地看出，该公司并没有满足于现状，其最新的现金注入将在一定程度上确保其继续在价值 13 亿美元的密码管理市场中获得更大份额。凭借一大批天使投资人——他们自己建立了大型科技企业——他的公司很好。 “我们的产品发生了很多事情，并将继续推进为我们的客户提供服务的新功能和应用程序，”Shiner 说。 “在这一轮中与技术领导者的合作是我们真正期待的一个方面——这些人已经接管了像 1Password 一样起步的公司，并将它们塑造成今天家喻户晓的名字。”\nVentureBeat 的使命是成为技术决策者的数字城镇广场，以获取有关变革性技术和交易的知识。我们的网站提供有关数据技术和策略的重要信息，以指导您领导您的组织。我们邀请您成为我们社区的一员，以访问：封闭的思想领袖内容和我们珍贵活动的折扣访问权限，例如 Transform 2021：了解更多 成为会员", "note_en": "Password management platform  1Password has raised $100 million in an Accel-led round of funding at a $2 billion valuation.\n The raise comes hot on the heels of a slew of product announcements from the Canadian company, including its  expansion into secrets management to help enterprises secure their infrastructure;  a new API that enables security teams to funnel 1Password sign-in data directly into cybersecurity tools such as Splunk; and  a new Linux desktop app aimed at DevOps teams.\n  The ultimate problem that 1Password is setting out solve is  that the vast majority of data breaches are due to compromised passwords. 1Password targets businesses like Slack, IBM, and GitLab with a platform that allows users to store passwords securely and log into myriad online services with a single click. It can also be used to store other private documents, such as software licenses and credit card details.\n The Toronto-based company raised its  first ever round of funding in its then 14-year history back in 2019, when it secured $200 million from Accel, Slack (via Slack Fund), and Atlassian’s founders, among other angel investors. In the nearly two years since, the company said it has almost doubled its number of paying business customers to 90,000, and hit $120 million in annual recurring revenue (ARR).\n According to 1Password CEO Jeff Shiner, while multiple factors have aligned to drive demand for password management tools, the single biggest change since its last fundraise has been society’s rapid transition from offices to  remote or hybrid working.\n “Businesses — both large and small — were forced overnight to adopt a remote way of working,” Shiner told VentureBeat. “That switch meant that companies, most of whom were used to a centralized office, suddenly needed to support employees using their own devices, at home on their own potentially insecure networks. With the remote-hybrid shift came a proliferation of SaaS tools to help keep people and teams productive. Many of these tools are brought in to help specific teams solve specific problems, which means that across an organization, there can be hundreds of different software products — all requiring unique logins and access.”\n Helping workers stay on top of all their login credentials is where 1Password comes into play.\n  Numerous companies are tackling the so-called “password problem” by trying to remove the password from the equation altogether, leveraging “magic links” that are sent by email or biometric smarts. Decentralized passwordless authentication platform Magic  announced a $27 million raise just last week, which followed shortly after Transmit Security  raised $543 million at a hefty $2.3 billion valuation and Beyond Identity  locked down $75 million. Elsewhere, two juggernauts from the identity and access management (IAM) sphere joined forces in May  when Okta acquired Auth0 for an eye-popping $6.5 billion.\n 1Password, for its part, has also embraced various forms of passwordless authentication, including integrating with Apple’s  Touch ID and  Face ID to enable users to unlock 1Password using their fingerprint or face, as well as support for 2FA hardware keys  such as Yubikey. Shiner also hinted at some possible new products that relate to passwordless authentication that he expects to launch in the coming months.\n “We are closely watching the passwordless space and how it matures over the coming years, but whatever the future holds we will be there to support our customers in the most secure and private manner possible,” he said.\n  “As an example, biometrics are ideal for authentication in many situations, as they literally convey your unique physical presence,” Shiner said. “But using biometrics widely opens up the question of what happens if data about, say, your fingerprints or face is stolen and can be manipulated by attackers to impersonate you. And while you can change your password on a whim, your face, fingerprint, voice, or heartbeat are much, much harder to swap out.”\n  Shiner said that while his company is still very much profitable and wasn’t actively looking for new investment, the opportunity to bring on board myriad new investors — which he refers to as “partners” — from across industry was too good to turn down. Indeed, for its latest fundraise, a slew of new institutional and angel investors entered the fray, including Ashton Kutcher’s Sound Ventures, Kim Jackson’s Skip Capital, Slack cofounder and CEO Stewart Butterfield, Shopify CEO Tobias Lutke, Squarespace CEO Anthony Caselana, and Eventbrite cofounder Kevin Hartz.\n It’s clear from its recent product launches that the company hasn’t been resting on its laurels, and its latest cash injection will go some way toward ensuring it continues on a trajectory to garner a bigger share of the  $1.3 billion password management market. And with a stellar lineup of angel investors on board — people who have built major technology businesses themselves — he’s in good company.\n “We have a lot happening with our product, and will continue to push forward with new features and applications that serve our customers,” Shiner said. “The partnerships with the technology leaders in this round is an aspect we are really looking forward to — these individuals have taken companies that started just like 1Password, and have shaped them into the household names they are today.”\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-07-27 19:56:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,现在,password,密码", "title": "1Password 在 2019 年筹集了 2 亿美元之后，以 2B 美元的估值筹集了由 Accel 领投的 1 亿美元，并表示它现在拥有 90,000 名商业客户", "title_en": "1Password raises $100M led by Accel at a $2B valuation, after raising $200M in 2019, and says it now has 90,000 business customers", "transed": 1, "url": "https://venturebeat.com/2021/07/27/password-management-platform-1password-raises-100m-as-business-booms/", "via": "", "real_tags": ["商业", "现在", "password", "密码"]}, {"category": "", "categoryclass": "", "imagename": "e7d5d3b9febe1c2affef700ab2987a45.jpg", "infoid": 1070001, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "打破孤岛和建立对可靠性分担责任的文化的 4 种最佳实践。 SRE 可能“拥有”可靠性工程。但是，只有在各种其他利益相关者的帮助下，他们才能成功地担任该角色。如果您不能与开发人员、IT 工程师甚至非技术团队（如公关和法律）轻松协作和沟通，您将难以优化可靠性工程。这就是为什么将组织去孤岛化是管理可靠性的关键部分。这就是为什么打破将 SRE 与其他团队分开的孤岛如此重要的原因，以及这样做的实用策略。乍一看，您可能不会认为组织孤岛（意味着不同团队或业务部门之间存在阻碍沟通和协作的部门）是 SRE 的主要挑战。毕竟，就其本质而言，SRE 角色是一种混合角色，它在开发和 IT 运营之间架起了桥梁，这是传统 IT 组织的两个主要组成部分。 SRE 应该同时具备软件工程和 IT 运营技能，以便在他们管理的系统中建立尽可能高的可靠性。然而，仅仅因为 SRE 技能集与其他学科的技能集重叠并不能自动消除 SRE 团队与其他团队之间的孤岛。这些孤岛有持续存在的趋势，原因如下： 不同的目标：SRE 与其他技术团队的目标不同。现代开发团队的主要目标是持续发布软件，而不是优化可靠性。对于 IT 运维，他们的重点是持续部署软件并在事件发生时有效响应（这与工程软件以最小化事件的方式进行设计不同）。独立的团队结构：SRE 不一定作为开发或 IT 运营团队的一部分进行组织。 SRE 往往独立存在，组织成自己的团队，这意味着他们几乎没有与其他技术团队互动的自然机会。\n在可靠性工程的 CI/CD 中没有角色：也许是因为 SRE 做不同的工作并且有不同的优先级，它们不能自然地融入指导其他团队工作的 CI/CD 流程。在 CI/CD 管道的任何阶段，SRE 都不会以某种方式将可靠性插入到代码中。除非 SRE 积极与其他利益相关者合作，将可靠性作为整个 CI/CD 管道的优先事项，否则可靠性很容易陷入自己的孤岛（有点像安全性，这也不是标准 CI/CD 管道的默认部分并且只有在您采用 DevSecOps 方法时才能集成）。不同的成功衡量标准：SRE 根据可用性、MTTR、SLO 等指标衡量成功。这些指标对开发人员和 IT 运营人员也可能有些重要。但它们通常不如其他与开发和运营工作更直接相关的指标重要，例如应用程序发布频率和性能指标。 SRE 和其他技术角色之间的脱节当然很重要，因为它阻碍了整个 IT 组织高效和有效地管理可靠性的能力。当 IT 组织的不同部门专注于不同的追求并在可靠性工程上设置不同的优先级时，您最终会组建团队，他们会为自己的个人利益而努力，而不是优化整个业务的结果。值得注意的是，不仅仅是 IT 组织内的孤岛使优化可靠性工程变得更加困难。 SRE 和非技术业务部门之间的分歧可能同样存在问题。例如，SRE 通常不会与公关和法律团队一起工作或密切合作。但是，当事件发生时，与这些团队的沟通至关重要，尤其是在事件对客户产生重大影响的情况下。法律可以帮助 SRE 确定事件的合同影响是什么，或者优先考虑哪些服务中断，以最大程度地减少 SLA 违规的后果。同样，PR 可以与 SRE 一起制定有关中断和预计恢复时间的声明。但同样，仅仅因为 SRE 应该与这些团队合作并不意味着他们这样做。这些非技术团队通常比开发人员和 IT 工程师更远离 SRE。所以，这就是问题所在。真正的问题是：你如何解决它？\n以下是在可靠性工程中加强 SRE 与其他利益相关者之间协作的四种方法。您的事件响应手册可能首先关注团队将遵循的技术程序来恢复服务。但理想情况下，剧本还将涵盖其他操作——例如公关团队的沟通工作和法律团队的合同评估——这些都是确保对事件的整体响应所必需的。当您将这些流程构建到您的剧本中时，您可以更轻松地实现 SRE 与其他利益相关者之间的密切协作。 SRE 经常执行各种测试——比如 FMEA 评估——来评估他们管理的系统的可靠性。但这些测试不必由 SRE 单独负责。来自 IT 组织内外的其他利益相关者可以而且应该在识别可靠性弱点和评估系统内潜在故障的影响方面发挥作用。当您将每个人都包括在可靠性测试中时，您就可以建立更强大的共同责任文化。理想情况下，每次开发人员编写新代码行、IT 工程师修改生产服务器或律师更改客户合同条款时，都应该考虑可靠性。但通常情况并非如此，尤其是在可靠性被视为只有 SRE 必须管理的组织中。\n为了改变这一点，要求所有利益相关者在每次做出改变时评估可靠性的后果。当考虑可靠性成为每个人的第二天性时，您最终会拥有更健康的可靠性文化，并且 SRE 与组织其他部分之间的障碍更少。最后，即使您努力让所有利益相关者承担可靠性的责任，请记住，您的文化仍然应该保持无可指责。仅仅因为每个人都参与可靠性工程并不意味着当出现问题时，任何一个团队都需要承担责任。围绕可靠性保持无可指责的文化对于确保利益相关者将可靠性不是强加给他们的负担，而是与其他团队合作并加强集体成功的机会非常重要。 SRE 可能专注于可靠性工程，但最终，企业内的每个利益相关者都在构建和管理可靠系统方面发挥作用。充分利用可靠性工程的关键是获得整个组织的支持，以与 SRE 进行协作和社区，并打破传统上将 SRE 与其他人隔离开来的孤岛。", "note_en": "4 best practices for breaking down silos and establishing a culture of shared responsibility toward reliability.\n      SREs may “own” reliability engineering. But they can succeed in that role only with help from a variety of other stakeholders. If you can’t collaborate and communicate readily with developers, IT engineers and even non-technical teams like PR and legal, you’ll struggle to optimize reliability engineering.\n That’s why de-siloing the organization is such a crucial part of managing reliability. Here’s why breaking down the silos that separate SREs from other teams is so important, and practical strategies for doing so.\n  At first glance, you may not think of organizational silos (meaning divisions between different groups or business units that hinder communication and collaboration) as a major challenge for SREs. After all, the SRE role by its very nature is a sort of hybrid one that  bridges the gap between development and IT operations , the two main components of a conventional IT organization. SREs are supposed to bring both software engineering and IT Ops skills to the table in order to build as much reliability as possible into the systems they manage.\n Yet just because the SRE skillset overlaps with that of other disciplines doesn’t automatically eliminate silos between SRE teams and other teams. Those silos have a tendency to persist, for several reasons:\n Different goals : SREs don’t share the same goals as other technical teams. The main goal of modern development teams is to release software continuously, not to optimize for reliability. As for IT ops, their focus is on deploying software continuously and responding to incidents effectively when they occur (which is not the same thing as engineering software in such a way that incidents are minimal).\n Separate team structures : SREs aren’t necessarily organized as part of development or IT ops teams. SREs tend to exist apart, organized into their own teams, which means they have few if any natural opportunities to interact with other technical teams.\n No role in CI/CD for reliability engineering : Perhaps because SREs do different work and have different priorities, they don’t fit naturally into the CI/CD processes that guide the work of other teams. There is no stage of the CI/CD pipeline where SREs somehow insert reliability into the code. Unless SREs actively collaborate with other stakeholders to make reliability a priority across the CI/CD pipeline, it’s easy for reliability to get stuck in its own silo (kind of like security, which is also not a default part of the standard CI/CD pipeline and only gets integrated if you take a DevSecOps approach).\n Different measures of success : SREs measure success in terms of metrics like availability, MTTR, SLOs. These metrics may matter somewhat to developers and IT ops, too. But they are generally not as important as other metrics that relate more directly to development and operations work, like application release frequency and performance metrics.\n The disconnect between SREs and other technical roles matters, of course, because it hampers the ability of the IT organization as a whole to manage reliability efficiently and effectively. When different parts of the IT organization focus on different pursuits and place different priority levels on reliability engineering, you end up with teams that work toward their own individual interests, rather than optimizing outcomes for the business as a whole.\n  It’s worth noting that it’s not just silos within the IT organization that make it harder to optimize reliability engineering. Divides between SREs and non-technical business units can be just as problematic.\n For instance, SREs don’t typically work alongside or in close collaboration with PR and legal teams. But when an incident occurs, communicating with these teams can be paramount, especially if the incident affects customers in a major way. Legal can help SREs determine what the contractual impact of an incident is, or which service disruptions to prioritize in order to minimize the fallout of SLA violations. Likewise, PR can work with SREs to formulate statements about disruptions and estimated recovery times.\n But again, just because SREs should collaborate with these teams doesn’t mean they do. These non-technical teams are typically even more siloed from SREs than are developers and IT engineers.\n  So, that’s the problem. The real question is: How do you fix it?\n Following are four approaches to increasing collaboration between SREs and other stakeholders in reliability engineering.\n  Your incident response playbooks probably focus first and foremost on the technical procedures that teams will follow to restore service.\n But ideally, the playbooks will also cover other operations -- like communications work by the PR team and contract assessment by the legal team -- that are necessary to ensure holistic response to incidents. When you build these processes into your playbooks, you make it easier to achieve close collaboration between SREs and other stakeholders.\n  SREs often perform various kinds of tests -- like FMEA assessments -- to evaluate the reliability of systems they manage.\n But these tests need not be the responsibility of SREs alone. Other stakeholders from across the IT organization and beyond can and should play a role in identifying reliability weak-points and assessing the impact of potential failures within the system.\n When you include everyone in reliability testing, you build a stronger culture of shared responsibility.\n  Ideally, every time a developer writes a new line of code, an IT engineer modifies a production server or a lawyer changes the terms of a customer contract, reliability should be a consideration. But it’s often not, especially within organizations where reliability is seen as something that only SREs have to manage.\n To change this, require all stakeholders to assess the consequences for reliability each time they make a change. When thinking about reliability becomes second nature for everyone, you end up with a healthier reliability culture and fewer barriers between SREs and the rest of the organization.\n  Finally, even as you work to make all stakeholders assume ownership of reliability, remember that your culture should nonetheless remain blameless. Just because everyone shares in reliability engineering doesn’t mean that any one group needs to be held responsible when something goes wrong.\n Maintaining a blameless culture surrounding reliability is important for ensuring that stakeholders see reliability not as a burden imposed on them, but as an opportunity to collaborate with other teams and reinforce collective success.\n  SREs may specialize in reliability engineering, but ultimately, every stakeholder within the business plays a role in building and managing reliable systems. The key to getting the most out of reliability engineering is gaining buy-in from across the organization for collaborating and community with SREs, and breaking apart the silos that have conventionally isolated SREs from everyone else.", "posttime": "2021-07-27 19:55:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "孤岛,siloing,可靠性", "title": "去孤岛事件管理：让可靠性工程成为每个人的工作", "title_en": "De-siloing incident management: make reliability engineering everyone's job", "transed": 1, "url": "https://rootly.io/blog/de-siloing-incident-management-how-to-make-reliability-engineering-everyone-s-job", "via": "", "real_tags": ["孤岛", "siloing", "可靠性"]}]