[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你认为Wordle是老新闻，这里有一个更古老的东西：拨号。net创建并发布了Windle，这是一个Wordle克隆，旨在运行在Windows 3.1和早期的&#39；90年代运行Windows 3.1的PC硬件。\n你可以在虚拟机或DOSBox中的现代硬件上运行Windows 3.1及其应用程序，但为了最大限度地提高其真实性，Windle是在适当的硬件和适当的工具上构建和运行的。使用的电脑是Gateway 2000 4DX2-66V，带有66 MHz Intel 80486 DX2 CPU、Windows 3.11工作组，以及Borland Delphi开发环境的第一个版本。在原始硬件上运行有助于暴露Windows 3.1虚拟化副本中可能不明显的问题，例如，当整个字典被66 MHz处理器加载到内存中时，会出现系统挂起。\nWindle的设计是为了配合微软的娱乐套装游戏，比如Chip&#39；s挑战、喷气球、扫雷艇和啮齿动物&#39；s的复仇，使它的美学立即为任何一个在早期&#39年笨重的米色PC周围长大的人所认识；90年代。和这些游戏一样，它在Windows 95和98等早期32位版本中也运行良好——我使用在DosBox-X中安装的Windows 98第二版进行了测试，以运行旧游戏和其他软件。\n如果你想运行Windle，而不需要挖掘一台古老的PC或建立一个虚拟化的&#39；90年代Windows环境，拨号。net还提供了32位版本的Windle，将在现代64位版本的Windows 10和Windows 11上运行，不过它&#34；韩元&#39；它看起来不像在Windows 3.1上那样经典&#34; 64位版本的Windows可以&#39；如果没有某种虚拟化或仿真，就不能运行16位软件。\n温德尔不是39岁；作为唯一一款复古版Wordle克隆版，这款游戏也被移植到了原版game Boy和各种掌上电脑上。硬件限制使这些端口无法使用与基于web的版本相同的字典和UI，但核心游戏玩法足够简单，甚至连Game Boy&#39；s的单色屏幕可以让你了解基本情况。", "note_en": "If you thought that  Wordle was old news, here’s something even older: Dialup.net has created and released   Windle, a Wordle clone designed to run on Windows 3.1 and the early &#39;90s PC hardware that would have been running Windows 3.1.\n You could run Windows 3.1 and its apps on modern hardware within a virtual machine or  DOSBox, but to maximize its authenticity,  Windle was built and run on period-appropriate hardware with period-appropriate tools. The PC used was a Gateway 2000 4DX2-66V with a 66 MHz Intel 80486 DX2 CPU, Windows 3.11 for Workgroups, and the very first version of the  Borland Delphi development environment. Running on the original hardware helped expose issues that may not have been evident in a virtualized copy of Windows 3.1—like a system hang that would occur as the entire dictionary was loaded into memory by a 66 MHz processor, for example.\n  Windle was designed to fit in with   Microsoft Entertainment Pack games like  Chip&#39;s Challenge,  JezzBall,  Minesweeper, and  Rodent&#39;s Revenge, making its aesthetic instantly recognizable to anyone who grew up surrounded by the bulky beige PCs of the early &#39;90s. Like those games, it also runs well in early 32-bit versions of Windows like Windows 95 and 98—I tested it using a Windows 98 Second Edition installation I set up in  DosBox-X to run old games and other software.\n If you want to run  Windle without unearthing an ancient PC or setting up a virtualized &#39;90s Windows environment, Dialup.net also provides a 32-bit build of  Windle that will run on modern 64-bit versions of Windows 10 and Windows 11, though it &#34;won&#39;t look as classic as it does on Windows 3.1.&#34; The 64-bit versions of Windows can&#39;t run 16-bit software without some kind of virtualization or emulation.\n Windle isn&#39;t the only retro  Wordle clone that exists—the game has also been ported to  the original Game Boy and  various Palm PDAs. Hardware limitations keep these ports from using the same dictionary and UI as the web-based version, but the core gameplay is simple enough that even the Game Boy&#39;s monochromatic screen can get the basics across.", "posttime": "2022-02-25 14:34:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,进入,wordle,运行", "title": "如果你仍然使用Windows 3.1，Windle是进入Wordle热潮的最佳方式", "title_en": "If you’re still on Windows 3.1, Windle is the best way to get in on the Wordle craze", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/developer-uses-90s-tools-and-a-gateway-pc-to-make-a-windows-3-1-clone-of-wordle/", "via": "", "real_tags": ["windows", "进入", "wordle", "运行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家电子游戏制造商宣布a&#34；发射装置&#34；而不是在拥挤的市场上发布另一款应用。\n由同名游戏制造商和出版商维护的Bethesda Launcher将在&#34；5月和#34日；该公司于周二宣布。谢天谢地，受影响的用户可以将每一次BL购买和许可证转移到Valve&#39；从&#34开始的蒸汽店面；四月初&#34;\n本周&#39；s的公告FAQ没有明确说明如何处理许可证转让，这让我们假设用户将使用受影响的凭据登录到网站，并收到Steam赎回代码列表。贝塞斯达坚称所有比赛&#39；只要玩家登录贝塞斯达，付费DLC和微交易货币将无缝地转移到Steam版本。在游戏中使用网络帐户。辐射尘76和39也是如此；s&#34；沉降物1号和34号；会员资格，但通过BL处理的任何定期订阅将不会在4月及以后自动续订。这些用户必须通过游戏设置新的订阅计划&#39；这是蒸汽版。\n有些保存文件可能需要手动复制，并从旧的Bethesda Launcher文件夹粘贴到新的Steam文件夹，而其他文件则会自动传输，可能是通过Bethesda。网络帐户链接。任何由BL处理的朋友名单都将通过贝塞斯达继续生效。net凭据，以及。\n当Bethesda Launcher于2016年问世时，它是一系列针对出版商的PC游戏发射器中的最新一款，旨在重定向Steam&#39；将30%的收入直接投入游戏制造商#39；保险箱。从理论上讲，此举对已经投资于游戏即服务基础设施的公司来说是有意义的；一个额外的EXE有多难？\n当然，每一个主要的Steam竞争对手都是通过摸索功能的推出和生活质量的调整来学到这一点的。但是Bethesda Launcher尤其遭受了损失，因为它要求PC游戏玩家远离对mod友好的Steam生态系统，Steam给Bethesda带来了巨大的活力；这是一对野心勃勃但充满童车的组合，由《尘埃3》和《长者卷轴》V:Skyrim组成，朝着封闭的、受控的、充满微交易的创造花园俱乐部前进。\n两年后，辐射尘76和39；在Bethesda Launcher上推出的独家PC对提高风扇的采用率几乎没有帮助。当这款游戏开始获得重要的内容更新时，它已经摆脱了BL的排他性，登陆了Steam。\n出版商&#39；在Xbox首席执行官菲尔·斯宾塞宣布他的许多公司&#39；微软的第一款PC版派对游戏将同时在Steam和Windows商店上推出。自2016年发表声明以来，所有现代微软PC游戏的发布都确实遵守了这一承诺，尽管这方面最大的例外仍然是Xbox game Pass，其PC层仍然完全围绕Windows应用商店。尽管近年来其他出版商更坚定地接受了Steam，但一些出版商这样做是出于让自己的发射器在后台运行的讨厌要求。\n无论如何，贝塞斯达可以说有一个商业头脑的理由要抛弃它的启动器：它倾向于意外地在该界面上启动无DRM版本的游戏。这并没有&#39；这并不意味着游戏制作者使用的是独家的启动器，因为老卷轴在线版将继续支持独立的启动器，就像其他流行的MMO一样。", "note_en": "In a welcome change of pace, a video game maker has announced the retirement of a &#34;launcher&#34; app for PCs, as opposed to announcing and releasing  yet  another  one to a crowded market.\n Bethesda Launcher, as maintained by the game maker and publisher of the same name, will fully shut down at some point in &#34;May,&#34; the company  announced on Tuesday. Thankfully, affected users will get to carry every BL purchase and license over to Valve&#39;s Steam storefront starting in &#34;early April.&#34;\n This week&#39;s announcement FAQ does not clarify exactly how license transfers will be handled, leaving us to assume that users will log in with their affected credentials to a website and receive a list of Steam redemption codes. In promising news, Bethesda insists that all games&#39; paid DLC and microtransaction currencies will transfer to the Steam versions seamlessly, so long as players log into a Bethesda.net account while in-game. The same goes for  Fallout 76&#39;s &#34;Fallout 1st&#34; membership, though any recurring subscriptions handled via BL will not auto-renew in April and beyond. Those users will have to set up a new subscription plan via the game&#39;s Steam version.\n Some save files may require manual copying-and-pasting from an old Bethesda Launcher folder to a new Steam one, while others will automatically transfer, likely via Bethesda.net account linking. Any friend lists handled by BL will carry over into Steam via Bethesda.net credentials, as well.\n   When Bethesda Launcher arrived in 2016, it was the latest in a series of publisher-specific PC-game launchers that aimed to redirect Steam&#39;s 30 percent cut of revenue directly into game makers&#39; coffers. On paper, the move made sense for companies that had already invested in games-as-a-service infrastructure; how hard could a single additional EXE be?\n    Of course, every major Steam competitor learned the hard way by fumbling feature rollouts and quality-of-life tweaks. But Bethesda Launcher in particular suffered because it asked PC gamers to move away from the mod-friendly ecosystem of Steam, which breathed significant life into Bethesda&#39;s ambitious-but-buggy duo of  Fallout 3 and  Elder Scrolls V: Skyrim, and toward  the closed, controlled, microtransaction-filled garden of Creation Club.\n Two years later,   Fallout 76&#39;s exclusive PC launch on Bethesda Launcher did little to jumpstart fan adoption. By the time the game began receiving  significant content updates, it had already shaken off its BL exclusivity and landed on Steam.\n The publisher&#39;s shift away from an exclusive launcher and toward Steam follows its parent company, Microsoft, making a similar move, after Xbox chief Phil Spencer announced that  many of his company&#39;s first-party games with PC versions would launch simultaneously on Steam and the Windows Store. Since that 2016 statement, all modern Microsoft PC game launches have indeed followed through on that pledge—though the biggest exception on that front remains Xbox Game Pass, whose PC tier still revolves entirely around the Windows Store. Though other publishers have embraced Steam more firmly in recent years, some have done so with  the obnoxious requirement of having their own launchers run in the background.\n Bethesda arguably has a certain business-minded reason to dump its launcher, anyway: its propensity to  accidentally launch DRM-free versions of games on that interface. And this doesn&#39;t mean the game maker is done using exclusive launchers, as  The Elder Scrolls Online will continue to support a standalone launcher, much like other popular MMOs.", "posttime": "2022-02-25 14:32:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "蒸汽,bethesda,游戏", "title": "瑞普·贝塞斯达发射装置：以下是它几乎完全转化为蒸汽的工作原理", "title_en": "RIP Bethesda Launcher: Here’s how its nearly full transfer to Steam will work", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/rip-bethesda-launcher-heres-how-its-nearly-full-transfer-to-steam-will-work/", "via": "", "real_tags": ["蒸汽", "bethesda", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司&#39；DigiTimes引用组件供应商的一份新报告称，苹果公司的混合现实耳机已经超越了原型阶段，正迅速走向生产。DigiTimes声称，苹果已经进行了&#34；第二阶段工程验证和测试（EVT 2）和#34；为了耳机。\n&#34;EVT 2和34；是苹果公司的一个阶段&#39；这就是生产之路。该公司从原型开始，然后进入第一个EVT（工程验证测试）阶段&#34;EVT 2和34；表示这是该阶段设备测试的第二阶段。\n在工程验证之后，苹果开始设计验证，然后在最终开始生产之前进行生产验证。该报告称，这款耳机将于8月或9月进入量产阶段，苹果仍将在2022年推出该产品。关于苹果的上市时间，最近出现了相互矛盾的报道；这是美国首次推出混合现实耳机。据报道，苹果最初计划在2019年上市，但已多次推迟。\n几位可靠消息人士去年曾表示，这款耳机将于2022年上市，但彭博社记者马克·古尔曼（Mark Gurman）最近警告称，这款设备可能会推迟到2023年上市。与此同时，明智国（Ming Chi Kuo）等分析人士继续预测2022年发射。\n在过去的几年里，古尔曼在预测苹果方面有着非常好的记录&#39；s的公告和产品。但他没有&#39；我们不能总是准确地预测这些公告和产品的发布时间。明智国有时也是如此&#39；这是我的分析。\nDigiTimes引用的组件供应链来源通常对苹果正在做的工作有一定的了解，但它们通常也没有完整的信息。因此，这份报告并不能确凿地证实该设备将于今年秋天投入使用。不过，它&#39；这是个好兆头。\n据说，这款首款耳机包含非常高端的规格，比如4K显示屏、多个精确传感器，或者与近期MacBook Pro机型中的M1 Pro或M1 Max芯片相当的硅芯片。这款耳机可能会被用于专业应用，并将帮助应用程序开发人员开始开发各种沉浸式体验，这些体验可能会吸引用户使用未来更主流的产品。", "note_en": "Apple&#39;s mixed reality headset has moved beyond the prototype phases and is barreling toward production, according to a new report in  DigiTimes that cites component suppliers. DigiTimes claims that Apple has already conducted &#34;second-phase engineering validation and testing (EVT 2)&#34; for the headset.\n &#34;EVT 2&#34; is a phase along Apple&#39;s path to production. The company begins with prototypes before moving on to the first EVT (engineering validation testing) phase. &#34;EVT 2&#34; indicates that this is the second phase of testing for the device during that phase.\n  After engineering validation, Apple moves on to design validation and then to production validation before production finally begins. The report claims that the headset will enter mass production in August or September and that Apple is still targeting a 2022 launch for the product. Conflicting reports have emerged lately about the timing of Apple&#39;s first mixed reality headset launch. Apple reportedly planned for a 2019 launch at first but has delayed that launch multiple times.\n    Several reliable sources were saying last year that the headset would come in 2022, but Bloomberg reporter Mark Gurman  cautioned recently that the device could be delayed to 2023. Meanwhile, analysts like Ming-Chi Kuo continued to predict a 2022 launch.\n Over the past few years, Gurman has a very strong track record in predicting Apple&#39;s announcements and products. But he doesn&#39;t always accurately predict the timing of those announcements and products. The same is sometimes true of Ming-Chi Kuo&#39;s analysis.\n Component supply chain sources like those cited by DigiTimes often do have some insight into what Apple is working on, but they also typically do not have the full picture. So this report is not a rock-solid confirmation that the device will be ready to go this fall. Still, it&#39;s a good sign.\n This first headset has been said to include very high-end specs, like 4K displays, multiple accurate sensors, or silicon equivalent to the M1 Pro or M1 Max chips found in recent MacBook Pro models. The headset will likely be used for professional applications and will help app developers begin work on the sorts of immersive experiences that may attract users to a more mainstream product down the road.", "posttime": "2022-02-25 14:31:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,vr,ar", "title": "消息人士称，苹果的AR/VR耳机不再只是一个原型", "title_en": "Apple’s AR/VR headset isn’t just a prototype anymore, sources say", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/apples-ar-vr-headset-isnt-just-a-prototype-anymore-sources-say/", "via": "", "real_tags": ["苹果", "apple", "vr", "ar"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份最新公布的警方报告彻底揭穿了密苏里州州长迈克·帕森&#39；令人费解的说法是，一名帮助政府发现并修复网站安全漏洞的记者是一名&#34；黑客&#34；而且是罪犯。\n帕森在10月要求进行调查，并要求对圣路易斯邮报的记者乔希·雷诺提出刑事指控&#34;为了检查他人而访问编码数据和系统是非法的#39；我们正在协调国家资源，以应对和利用所有可用的法律方法；帕森当时说。共和党州长声称雷诺是&#34；反对国家机构损害教师权益&#39；试图让国家难堪并为其新闻媒体出售头条的个人信息&#34；他的政府说&#34；不会让这起针对密苏里州教师的罪行逍遥法外&#34;\n但由此产生的警方报告详细证实，雷诺从一开始就完全按照他所说的做了：他通过在一个配置错误的国家网站上查看公开的HTML代码，发现了一个安全漏洞，并推迟发表一篇关于他的发现的文章，直到国家关闭了安全漏洞。\n警方报告还透露，该安全漏洞自2011年以来一直存在。这一错误暴露了教师#39；中小学教育部（DESE）网站上的社会安全号码，允许任何人搜索有关教师的信息。多达57.6万名教师&#39；该报告称，社会保障数据可能已被曝光，因为数据可追溯到2005年。\n密苏里州公路巡警报告由《邮报》昨天发布，同时附上了一篇关于该报告的文章&#34;公路巡逻队表示，他们花了大约175个小时进行调查。三名警官协助调查。没有提供成本估算，&#34；邮报写道。\n警方的报告是大约两个月前提供给科尔县检察官洛克·汤普森的。汤普森于2月11日宣布，他在没有指控的情况下结束了调查，并宣布&#34；调查的核心问题已通过非法律手段得到解决&#34;\n警方报告在十月与国家雇员Renaud和Shaji Khan，密苏里州圣·路易斯大学的网络安全教授Renaud进行了访谈，帮助Renaud证实了安全漏洞。该报告将雷诺列为&#34；嫌疑人#34；但该案已于10月29日结案。\n报告&#34；表明国家官员既知道没有犯罪，也知道他们不应该维护一个有如此重大和基本安全漏洞的公共网站，&#34；汗和#39；澳大利亚律师埃拉德·格罗斯（Elad Gross）昨天在一份声明中告诉Ars。报告&#34；清楚地表明，国家官员在这里犯下了所有的错误，&#34；他说。\nDESE的首席通信官马洛里·麦戈文告诉警方，雷诺34；在ITSD[信息技术服务部]开发应用程序时是一个错误或疏忽&#34；和&#34；声明该漏洞自2011年应用程序实现以来就一直存在&#34;\n麦戈文证实，雷诺只访问公开可用的数据&#34;她说，根据她观察到的情况，雷诺先生没有接触到任何不公开的东西，也没有进入他不应该去的地方。她说Josh Renaud似乎只访问了公开的公共数据；警方报告称。\n汤普森告诉《密苏里独立报》，调查没有发现&#34；任何犯罪意图，&#34；尽管他说了&#34；从技术上讲可能是犯罪&#34；因为一项关于篡改计算机数据的州法律#34；它看起来非常模糊，基本上描述了某人使用计算机查找某人的信息&#34; 该法律禁止访问计算机系统以故意检查另一个人的信息，但规定它&#39；这只是犯罪&#34；如果他或她在知情的情况下未经授权或没有合理理由相信他有这种授权&#34;\n虽然《邮报》在10月份报道称，该漏洞暴露了10万个社会保障号码，但显然要多得多&#34;我问麦戈文夫人数据库中有多少名教师，她说数据可以追溯到2005年，总数约为57.6万人；凯尔·西博下士在警方报告中写道。雷诺告诉警方，最初估计的10万人是根据当年的数据计算的；他说，他观察到的信息表明，其他年份的信息和可能的退休人员#39；数据库中有社会安全号码&#34;\n麦戈文也&#34；说数据库和其他州计算机服务一样，实际上是由帕森&#39；由州长控制的政府办公室&#34；邮报在昨天的报道中说。", "note_en": "A newly released police report thoroughly debunks Missouri Gov. Mike Parson&#39;s baffling claim that a journalist who helped the state identify and fix a website security flaw was a &#34;hacker&#34; and criminal.\n Parson  demanded the investigation in October and called for criminal charges against St. Louis Post-Dispatch reporter Josh Renaud. &#34;It is unlawful to access encoded data and systems in order to examine other people&#39;s personal information, and we are coordinating state resources to respond and utilize all legal methods available,&#34; Parson said at the time. The Republican governor claimed that Renaud was &#34;acting against a state agency to compromise teachers&#39; personal information in an attempt to embarrass the state and sell headlines for their news outlet&#34; and said his administration &#34;will not let this crime against Missouri teachers go unpunished.&#34;\n But the resulting police report confirms in detail that Renaud did exactly what he said from the beginning: He identified a security flaw by viewing publicly available HTML code on a misconfigured state website and delayed publishing an article on his findings until after the state closed the security hole.\n The police report also revealed that the security flaw had existed since 2011. The mistake exposed teachers&#39; Social Security numbers on a Department of Elementary and Secondary Education (DESE) website that allowed anyone to search for information about teachers. Up to 576,000 teachers&#39; Social Security numbers may have been exposed because the data goes back to 2005, the report said.\n The  Missouri State Highway Patrol police report was posted yesterday by the Post-Dispatch along with an  article about the report. &#34;The highway patrol said it spent about 175 hours on the investigation. Three officers assisted in the probe. No cost estimate was provided,&#34; the Post-Dispatch wrote.\n  The police report was provided to Cole County Prosecutor Locke Thompson about two months ago. Thompson  announced on February 11 that he closed the investigation without charges and that &#34;the issues at the heart of the investigation have been resolved through non-legal means.&#34;\n    The police report paraphrases interviews conducted in October with state employees, Renaud, and Shaji Khan, a cybersecurity professor at the University of Missouri-St. Louis who helped Renaud verify the security vulnerability. The report lists Renaud as a &#34;suspect&#34; but listed the case as closed on October 29.\n The report &#34;show[s] that state officials knew both that no crime had been committed and that they should never have maintained a public website with such a major and elementary security flaw,&#34; Khan&#39;s attorney, Elad Gross, told Ars in a statement yesterday. The report &#34;clearly shows that state officials committed all of the wrongdoing here,&#34; he said.\n  Mallory McGowin, chief communications officer for DESE, told police that the problem identified by Renaud &#34;was an error or oversight when ITSD [Information Technology Services Division] developed the application&#34; and &#34;stated the vulnerability would have been there since 2011, when the application was implemented.&#34;\n McGowin confirmed that Renaud only accessed publicly available data. &#34;She stated from what she has observed, Mr. Renaud did not access anything that was not publicly available, nor was he in a place he should not have been. She said Josh Renaud appears [to] have only accessed open public data,&#34; the police report said.\n Thompson  told the Missouri Independent that the investigation didn’t find &#34;any criminal intent,&#34; though he said it &#34;may have technically been a crime&#34; because a  state law on tampering with computer data &#34;does appear to be so vague that it basically describes someone using a computer to look up someone’s information.&#34; The law bans accessing a computer system to intentionally examine information about another person, but specifies that it&#39;s a crime only &#34;if he or she [does so] knowingly and without authorization or without reasonable grounds to believe that he has such authorization.&#34;\n While the Post-Dispatch reported in October that the flaw exposed 100,000 Social Security numbers, it was apparently a lot more. &#34;I asked Mrs. McGowin how many teachers were in the database, and she stated the data would have dated back to 2005, and the total number would be approximately 576,000,&#34; Corporal Kyle Seabaugh wrote in the police report. Renaud told police the initial estimate of 100,000 was based on the current year, &#34;and he said he observed information indicating other years of information and possibly retirees&#39; Social Security numbers were in the database.&#34;\n McGowin also &#34;said the database—like other state computer services—is actually overseen by Parson&#39;s Office of Administration, which the governor controls,&#34; the Post-Dispatch said in its report yesterday.", "posttime": "2022-02-25 14:28:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "州长,governor", "title": "密苏里州州长对记者的胡言乱语在警方报告中被揭穿", "title_en": "Missouri governor’s wild claims about journalist debunked in police report", "transed": 1, "url": "https://arstechnica.com/tech-policy/2022/02/missouri-governors-wild-claims-about-journalist-debunked-in-police-report/", "via": "", "real_tags": ["州长", "governor"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《Showtime》为即将上映的新科幻系列《坠落地球的人》发布了官方预告片，该片由奇威特尔·埃吉奥弗（Chiwetel Ejiofor）主演，他是一名外星人，来到地球，希望拯救地球上的人。它&#39；这是一个大胆的举动，考虑到该系列是基于沃尔特·特维斯1963年的经典小说改编的，该小说已经催生了一部由摇滚明星大卫·鲍伊主演的标志性电影改编。\n特维斯和#39；这部小说讲述了一个来自安西亚星球的类人外星人的故事，该星球正遭受严重干旱。外星人的名字叫托马斯·杰罗姆·牛顿，他来到地球，希望能把他的族人的遗骸运到我们这个湿漉漉的星球上。托马斯从他自己的星球上获得了一系列先进的外星技术专利，并发了财，他计划利用这些财富为他的人民建造宇宙飞船。他在一位名叫内森·布莱斯的燃料技师身上找到了一位朋友和盟友。\n托马斯也赢得了一个名叫贝蒂·乔的女人的爱，尽管他没有回报她的感情。是贝蒂·乔向他介绍了性和酒精，他对后者上瘾了。最终布莱斯发现他的朋友是外星人，虽然托马斯最初因为有人知道他的秘密而松了一口气，但自从他来到地球后，中央情报局和联邦调查局一直在跟踪他。他被监禁，并接受了许多侵入性测试，其中一项测试使他永久失明。由于无法完成他的任务，托马斯记录了最后一条信息，在完全屈服于饮酒之前向他的星球广播。\n坠入尘世的人是一个存在孤独和酗酒的悲剧。所以电影制作人尼古拉斯·罗格&#39；她决定让摇滚明星大卫·鲍伊（David Bowie）出演导演托马斯（Thomas）&#39；回想起来，1976年的电影改编本受到了启发。鲍伊已经有了一个超凡脱俗的、雌雄同体的外表，在1983年的一次采访中，他坦言在拍摄期间每天吸入10克可卡因；我不是&#39；在那个特定的时间，地球的t&#34; 罗格和#39；他的电影遵循了小说的基本情节，同时在这个项目上加入了他自己独特的艺术风格，这部电影在上映后获得了大部分积极的评价。它&#39；它现在被认为是科幻小说的经典之作（有充分的理由），在Roeg和#39；这是最好的工作。\n由Alex Kurtzman和Jenny Lumet开发和编写，这部新的电视改编剧最初是Hulu的一个项目，后来转移到CBS All Access（该公司后来被派拉蒙公司吸收）。Showtime将在美国播出该系列，派拉蒙+将在国际上播出。根据官方的日志，&#34；坠入地球的人将跟随一个新的外星人角色（Ejiofor），他在人类进化的转折点来到地球，必须面对自己的过去来决定我们的未来&#34;\n电视改编本引入了一些明显偏离原材料的内容，从Ejiofor&#39；一个名叫法拉第的外星人。比尔·尼希饰演托马斯·杰罗姆·牛顿，鲍伊饰演的角色。（他甚至戴着一顶类似的帽子。）&#34;我带你来这里是为了完成我开始的工作&#34；托马斯告诉法拉第，这是一个续集，而不是一个简单的改编。地球和他们的垂死星球在同一轨道上&#34;这就是我们所有人的生存方式；托马斯坚持。但仍有一些人宁愿消灭外星人，也不愿与他们合作，共同确保生存。\nNaomie Harris联袂主演贾斯汀·福尔斯，被称为&#34；一位杰出的科学家和工程师，她必须在拯救两个世界的竞赛中战胜自己的恶魔&#34; 她有一个年幼的儿子，他们与法拉第的关系似乎让人想起地球静止的那一天。（这可能是从几乎被遗忘的1987年电视版《坠地的人》中借用的元素。）演员阵容还包括Westworld和#39；s吉米·辛普森饰演斯宾塞·克莱；罗伯·德莱尼饰演“孵化洪水”；索尼娅·卡西迪饰演伊迪·弗劳德；乔安娜·里贝罗饰演丽莎·多明格斯；安妮尔·奥拉利饰演莫莉的倒下；乔希·埃尔德曼饰演特里；凯特·穆尔奇成长为德鲁·芬奇。\n这位坠入地球的人将于2022年4月24日在美国的Showtime和派拉蒙国际电视台首次亮相。", "note_en": "Showtime has released the official trailer for its upcoming new sci-fi series,   The Man Who Fell to Earth, starring Chiwetel Ejiofor as an alien who comes to Earth in hopes of saving the people on his home planet. It&#39;s a bold move, considering that the series is based on the  classic 1963 novel by Walter Tevis, which already spawned  an iconic film adaptation featuring rock star David Bowie.\n  Tevis&#39; novel tells the story of a humanoid alien from a planet called Anthea, which is suffering from severe drought. Going by the name Thomas Jerome Newton, the alien travels to Earth in hopes of transporting the remnants of his people to our soggy orb. Thomas patents a bunch of advanced alien technology from his own planet and makes a fortune, with plans to use that wealth to construct spaceships for his people. He finds a friend and ally in a fuel technician named Nathan Bryce.\n Thomas also earns the love of a woman named Betty Jo, although he does not reciprocate her feelings. It is Betty Jo who introduces him to sex and alcohol, and he becomes addicted to the latter. Eventually Bryce discovers his buddy is an alien, and while Thomas is initially relieved to have someone know his secret, the CIA and FBI have been tracking him since his arrival on Earth. He is imprisoned and subjected to many invasive tests, one of which permanently blinds him. Unable to complete his mission, Thomas records one last message to broadcast to his home planet before fully giving in to drink.\n  The Man Who Fell to Earth is quite the tragedy of existential loneliness and alcoholism. So filmmaker Nicolas Roeg&#39;s decision to cast rock star David Bowie as Thomas in the director&#39;s 1976 film adaptation was, in retrospect, inspired. Bowie already had an otherworldly, androgynous appearance and was frank in a 1983 interview about inhaling a good 10 grams of cocaine a day during filming: &#34;I wasn&#39;t of this Earth at that particular time.&#34; Roeg&#39;s film followed the basic plot of the novel while putting his own distinctive artistic touch on the project, and the film received mostly positive reviews upon release. It&#39;s now considered a science fiction cult classic (for good reason) and among Roeg&#39;s best work.\n    Developed and written by Alex Kurtzman and Jenny Lumet, this new TV adaptation began as a project for Hulu before moving to CBS All Access (which has since absorbed into Paramount+). Showtime will air the series in the US, with Paramount+ carrying it internationally. Per the official logline, &#34; The Man Who Fell to Earth will follow a new alien character (Ejiofor) who arrives on Earth at a turning point in human evolution and must confront his own past to determine our future.&#34;\n  The TV adaptation introduces some clear deviations from the source material, starting with Ejiofor&#39;s character, an alien named Faraday. Bill Nighy plays Thomas Jerome Newton, the character Bowie played. (He even sports a similar dashing hat.) &#34;I brought you here to finish what I started,&#34; Thomas tells Faraday, indicating that this is a sequel of sorts instead of a straightforward adaptation. Earth is on the same trajectory as their dying planet. &#34;This is how we all survive,&#34; Thomas insists. But there are still those who would prefer to take out the aliens rather than work with them for a mutually assured survival.\n Naomie Harris co-stars as Justin Falls, described as &#34;a brilliant scientist and engineer who must conquer her own demons in the race to save two worlds.&#34; She has a young son, and the relationship they have with Faraday seems reminiscent of   The Day the Earth Stood Still. (That&#39;s an element possibly borrowed from the largely forgettable 1987 made-for-TV version of  The Man Who Fell to Earth.) The cast also includes  Westworld&#39;s Jimmi Simpson as Spencer Clay; Rob Delaney as Hatch Flood; Sonya Cassidy as Edie Flood; Joana Ribeiro as Lisa Dominguez; Annelle Olaleye as Molly Falls; Josh Herdman as Terry; and Kate Mulgrew as Drew Finch.\n  The Man Who Fell to Earth will debut April 24, 2022, on Showtime in the US and on Paramount+ internationally.", "posttime": "2022-02-25 14:26:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法拉第,ejiofor,饰演", "title": "奇韦特尔·埃吉奥弗在《坠地的人》预告片中饰演一个名叫法拉第的外星人", "title_en": "Chiwetel Ejiofor plays an alien named Faraday in Man Who Fell to Earth trailer", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/chiwetel-ejiofor-plays-an-alien-named-faraday-in-man-who-fell-to-earth-trailer/", "via": "", "real_tags": ["法拉第", "ejiofor", "饰演"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对机械键盘的一个常见抱怨是它们&#39；你很贵，尤其是如果你更喜欢一个知名品牌的话。但罗技通过其新的G413 SE挑战这一点，该公司是#39；这是最便宜的机械键盘。售价80美元，几乎不属于预算范畴，还有&#39；这也是一个70美元的无钥匙版本。\n罗技带来了一种高质量、稍微不同寻常的打字体验。G413 SE和#39；微软的保守设计也将赢得那些感觉机械键盘，尤其是游戏设备，变得过于浮华的用户。\n尽管以高价著称，但如今80美元的机械键盘仍能提供很多。但是如果你&#39；重新比较一下廉价机械键盘的功能集，G413 SE的成本比它应该的要高。\n我不&#39；我不知道为什么罗技将G413 SE归类为游戏键盘，而不仅仅是通用键盘。该设备缺乏该公司令人印象深刻的功能集#39；还有其他的游戏。即使是非SE G413也提供了更多，而在编写时，其成本也降低了10-20美元。\nG413 SE没有&#39；t与罗技科技合作&#39；s G Hub软件。因此，与非SE版本不同，非SE版本允许编程F1-F12键，包括使用宏&#39；它完全没有可编程性。\n此外，2017年推出的非SE G413具有USB直通端口和电缆管理功能，用于游戏鼠标和耳机。它带有一个红色（而不是白色）背光选项，并声称支持26键翻转，与我们的评论主题#39；s 6键翻滚。它甚至还配有额外的键帽和键帽拉拔器。\n我们没有&#39；t测试了非SE G413，它有不同于SE的触觉机械开关（罗技和罗默G触觉），并使用ABS塑料键帽。G413 SE和#39；与非SE相比，PBT塑料的碰撞似乎是唯一明显的改进，尽管随着升级，它&#39；It’没什么可打喷嚏的。这有助于G413 SE&#39；s的打字经验非常突出，但是任何一款价格更高的键盘特别版都应该比标准版有更多的好处。\n一些机械键盘将醒目、复古或大胆的配色方案与按键、底盘甚至手腕上的华而不实的彩色灯光结合在一起。G413 SE似乎采取了不同的策略：它没有&#39；我不想被人看见。事实上，在你打开它的白色背光之前，很难看到它黑色键帽上的黑色图例。\n那些在微妙中发现美的用户，或者想要一个光滑的黑色外观来完成他们的设置的用户，可以欣赏G413 SE。但再加上缺乏独特的功能，这种整体设计可以最好地描述为&#34；很简单&#34;\n键盘&#39；它最耀眼的一面是它的白色背光。自从钥匙帽&#39；从我的坐姿上看，传说难以辨认，我总是需要背光。G413 SE和#39；s明亮的LED没有RGB，但它们通过黑暗的键帽发光，同时在键帽之间产生辉光&#39；它可以从自顶向下的视图中看到。\n此背光比基本背光高一步。它有五种效果：一种效果是灯光淡入淡出；在另一种情况下，按键按下后会比其他按键亮一秒钟。分别按Fn和F12以及F1和F2可控制效果和亮度（三级，加上off）。不过，将所有照明控制装置放在一起会更直观。\n底部底盘由无灵魂的轻质塑料制成，表面略微光滑。同时，铝制顶板带来了更多的想象力。排名前39位；s精致的拉丝表面赋予键盘更多质感和重量，偶尔还会出现指纹污迹。\n又一次为SE&#39；成本低吗？有线电视。它&#39；它是一个普通的橡胶部件，在与键盘连接的地方没有强制力（尽管它的连接器相当粗）。不过，廉价键盘通常感觉更便宜，而且制作质量也很差，G413 SE&#39；s的两年保修期比一些更昂贵的竞争对手更长。", "note_en": "A common complaint about mechanical keyboards is that they&#39;re expensive, especially if you prefer an established brand. But Logitech challenges that with  its new G413 SE, which is one of the company&#39;s least expensive mechanical keyboards. At $80, it barely squeaks into the budget category, and there&#39;s also a  $70 tenkeyless version.\n Logitech comes through with a quality, mildly unusual typing experience. The G413 SE&#39;s conservative design will also win over users who feel mechanical keyboards, especially gaming devices, have become too flashy.\n Despite a reputation for high prices, $80 mechanical keyboards can still offer a lot these days. But if you&#39;re comparing feature sets among budget mechanical keyboards, the G413 SE costs more than it should.\n  I don&#39;t know why Logitech categorizes the G413 SE as a gaming keyboard instead of just a keyboard for general use. The device lacks the impressive feature sets of the company&#39;s other gaming clackers. Even the  non-SE G413 offers more while costing  $10-$20 less as of writing.\n The G413 SE doesn&#39;t work with Logitech&#39;s G Hub software. So, unlike the non-SE version—which lets you program the F1-F12 keys, including with macros—there&#39;s no programmability at all.\n Additionally, the non-SE G413 from 2017 has a USB passthrough port and cable management meant for gaming mice and headphones. It comes with a red (instead of white) backlight option and claims to support 26-key rollover, which lets the keyboard register 26 simultaneous key presses, compared to our review subject&#39;s 6-key rollover. It even comes with extra keycaps and a keycap puller.\n We haven&#39;t tested the non-SE G413, which has different tactile mechanical switches (Logitech&#39;s Romer G Tactile) from the SE and uses ABS plastic keycaps. The G413 SE&#39;s bump to PBT plastic seems to be the only obvious improvement over the non-SE, although, as upgrades go, it&#39;s nothing to sneeze at. That helps the G413 SE&#39;s typing experience stand out, but the pricier special edition of any keyboard really ought to come with a greater number of benefits over the standard edition.\n     Some mechanical keyboards combine striking, retro, or daring color schemes with flashy, colorful lights in the keys, chassis, or even wrist rest. The G413 SE seems to take a different tack: it doesn&#39;t want to be seen. In fact, before you turn on its white backlight, the dark legends on its black keycaps are hard to see.\n  Users who find beauty in subtlety or who want a sleek, black look to complete their setup can appreciate the G413 SE. But combined with a lack of unique features, this overall design can best be described as &#34;plain.&#34;\n The keyboard&#39;s flashiest aspect is its white backlight. Since the keycaps&#39; legends were illegible from my seated position, I always needed the backlight. The G413 SE&#39;s bright LEDs are no RGB, but they shine through the dark keycaps while creating a glow between the keycaps that&#39;s visible from a top-down view.\n  This backlight is a step above basic. It has five effects: in one effect, the lighting fades in and out; in another, keys illuminate brighter than the rest for a second after pressed. Controls for effects as well as brightness (three levels, plus off) are reached by pressing Fn and F12 and F1 and F2, respectively. Putting all the lighting controls next to each other would be more intuitive, though.\n Soulless, lightweight plastic with a mildly glossy finish makes up the bottom chassis. Meanwhile, the aluminum top plate brings more imagination. The top&#39;s subtle brushed finish gives the keyboard more texture and weight—and the occasional fingerprint smudge.\n  Another sacrifice made for the SE&#39;s low cost? The cable. It&#39;s a plain rubber thing with no enforcement where it connects to the keyboard (although its connector is rather chunky). Budget keyboards often feel cheaper and poorly made, though, and the G413 SE&#39;s two-year warranty is longer than some more expensive rivals.", "posttime": "2022-02-25 14:22:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "键盘,g413,se", "title": "罗技G413 SE机械键盘评论：价格合理，但不够便宜", "title_en": "Logitech G413 SE mechanical keyboard review: Affordable, but not cheap enough", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/logitech-g413-se-mechanical-keyboard-review-affordable-but-not-cheap-enough/", "via": "", "real_tags": ["键盘", "g413", "se"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄罗斯最精英、最厚颜无耻的间谍机构之一的黑客已经用一种以前看不见的恶意软件感染了世界各地的家庭和小型办公室网络设备，该软件将这些设备变成了攻击平台，可以窃取机密数据并攻击其他网络。\nCyclops Blink被称为高级恶意软件，该公司周三表示，它已经感染了网络设备制造商WatchGuard生产的约1%的网络防火墙设备。该恶意软件能够滥用在受感染设备中发现的合法固件更新机制，使其具有持久性，这意味着该恶意软件能够在重新启动后存活。\nCyclops Blink已经传播了近三年，它取代了VPNFilter。2018年，研究人员发现该恶意软件感染了约50万个家庭和小型办公室路由器。VPNFilter包含一把名副其实的瑞士军刀，黑客可以通过它窃取或操纵流量，并监控工业控制系统使用的一些SCADA协议。美国司法部将黑客攻击与俄罗斯联邦武装部队总参谋部的主要情报局（通常简称GRU）联系起来。随着VPNFilter的暴露，沙虫黑客构建了一个新的恶意软件来感染网络设备。和它的前身一样，Cyclops Blink拥有专业开发的固件的所有特征，但它也有一些新的技巧，使其更隐蔽，更难移除。\n英国国家网络安全中心（National Cyber Security Center）的官员在一份咨询报告中写道：“该恶意软件本身非常复杂、模块化，具有基本的核心功能，可以将设备信息发送回服务器，并允许下载和执行文件。”。“在恶意软件运行时，还有添加新模块的功能，这使Sandworm能够根据需要实现附加功能。”\n该公告称，到目前为止，Sandworm“主要”使用该恶意软件从WatchGuard感染网络设备，但黑客可能也能将其编译为在其他平台上运行。恶意软件通过滥用设备用于接收固件更新的合法进程，在WatchGuard设备上获得持久性。\n恶意软件首先复制存储在设备上的固件映像，然后修改它们以包含恶意功能。Cyclops Blink然后操纵一个HMAC值，用于以加密方式证明图像是合法的，以便设备运行它。过程如下所示：\n该恶意软件包含一个用于C2通信的硬编码RSA公钥，以及一个硬编码RSA私钥和X.509证书。但在英国官员分析的样本中，它们似乎没有被积极使用，这使得它们有可能被单独的模块使用。\nCyclops Blink使用OpenSSL加密库对TLS提供的加密下的通信进行加密。\n每次恶意软件信标出现时，它都会从当前C2服务器IPv4地址列表和C2端口硬编码列表中随机选择一个目标。信标由包含运行模块数据的排队消息组成。每条消息都使用AES-256-CBC单独加密。OpenSSL_EVP_SealInit函数用于为每条消息随机生成加密密钥和IV，然后使用硬编码RSA公钥对其进行加密。OpenSSL_RSA_public_decrypt函数用于使用硬编码RSA公钥对响应信标的任务进行解密。\n其他新的秘密措施包括使用Tor隐私网络隐藏恶意软件使用的IP地址。英国官员写道：\n受害设备被组织成集群，Cyclops Blink的每个部署都有一个命令和控制（C2）IP地址及其使用的端口列表（T1008）。到目前为止，所有已知的C2 IP地址都已被受损的WatchGuard防火墙设备使用。Cyclops Blink客户端和服务器之间的通信受传输层安全（TLS）（T1071.001）保护，使用单独生成的密钥和证书。Sandworm通过Tor网络连接到C2层来管理独眼巨人眨眼：", "note_en": "Hackers for one of Russia’s most elite and brazen spy agencies have infected home and small-office network devices around the world with a previously unseen malware that turns the devices into attack platforms that can steal confidential data and target other networks.\n Cyclops Blink, as the advanced malware has been dubbed, has infected about 1 percent of network firewall devices made by network device manufacturer WatchGuard, the company  said on Wednesday. The malware is able to abuse a legitimate firmware update mechanism found in infected devices in a way that gives it persistence, meaning the malware survives reboots.\n   Cyclops Blink has been circulating for almost three years and replaces  VPNFilter, the malware that in 2018 researchers found infecting about 500,000 home and small office routers. VPNFilter contained a veritable Swiss Army knife that allowed hackers to steal or manipulate traffic and to monitor some SCADA protocols used by industrial control systems. The US Department of Justice  linked the hacks to the Main Intelligence Directorate of the General Staff of the Armed Forces of the Russian Federation, typically abbreviated as the GRU. With VPNFilter exposed, Sandworm hackers built a new malware for infecting network devices. Like its predecessor, Cyclops Blink has all the trappings of professionally developed firmware, but it also has new tricks that make it stealthier and harder to remove.\n “The malware itself is sophisticated and modular with basic core functionality to beacon device information back to a server and enable files to be downloaded and executed,” officials with the UK’s National Cyber Security Center wrote in an  advisory. “There is also functionality to add new modules while the malware is running, which allows Sandworm to implement additional capability as required.”\n  So far, the advisory stated, Sandworm has “primarily” used the malware to infect network devices from WatchGuard, but the hackers are likely able to compile it to run on other platforms as well. The malware gains persistence on WatchGuard devices by abusing the legitimate process the devices use to receive firmware updates.\n    The malware starts by copying firmware images stored on the device and modifying them to include malicious functionality. Cyclops Blink then manipulates an HMAC value used to cryptographically prove the image is legitimate so devices will run it. The process looks like this:\n  The malware contains a hard-coded RSA public key, which is used for C2 communications, as well as a hard-coded RSA private key and X.509 certificate. But they don’t appear to be actively used within the samples analyzed by the UK officials, making it possible that they’re intended to be used by a separate module.\n Cyclops Blink uses the OpenSSL cryptography library to encrypt communications underneath encryption provided by TLS.\n  Each time the malware beacons it randomly selects a destination from the current list of C2 server IPv4 addresses and hard-coded list of C2 ports. Beacons consist of queued messages containing data from running modules. Each message is individually encrypted using AES-256-CBC. The OpenSSL_EVP_SealInit function is used to randomly generate the encryption key and IV for each message, and then encrypt them using the hard-coded RSA public key. The OpenSSL_RSA_public_decrypt function is used to decrypt tasking, received in response to beacons, using the hard-coded RSA public key.\n Other new measures for stealth include use of the Tor privacy network to conceal the IP addresses used by the malware. UK officials wrote:\n Victim devices are organised into clusters and each deployment of Cyclops Blink has a list of command and control (C2) IP addresses and ports that it uses (T1008). All the known C2 IP addresses to date have been used by compromised WatchGuard firewall devices. Communications between Cyclops Blink clients and servers are protected under Transport Layer Security (TLS) (T1071.001), using individually generated keys and certificates. Sandworm manages Cyclops Blink by connecting to the C2 layer through the Tor network:", "posttime": "2022-02-25 14:13:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,黑客,俄罗斯,网络,cutthroat", "title": "俄罗斯最残酷的黑客用新的僵尸网络恶意软件感染网络设备", "title_en": "Russia’s most cutthroat hackers infect network devices with new botnet malware", "transed": 1, "url": "https://arstechnica.com/information-technology/2022/02/russias-most-cut-throat-hackers-infect-network-devices-with-new-botnet-malware/", "via": "", "real_tags": ["软件", "黑客", "俄罗斯", "网络", "cutthroat"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从特斯拉在2019年首次推出了带有杯头港的车内游戏以来，其&#34；特斯拉商场&#34；这个平台已经慢慢发展到只包含不到20个游戏。不过，现在特斯拉首席执行官埃隆·马斯克表示有兴趣扩大与特斯拉兼容的游戏列表，将Steam游戏平台上的数万种游戏包括在内。在真正的马斯克风格中，这些计划的非正式宣布是通过一条推文发布的，推文中的帖子表达了对CD Projekt Red&#39；s Cyberpunk 2077（一款之前在s型方格格的信息娱乐系统上运行的游戏）&#34;我们正在研究让Steam游戏在特斯拉vs特定游戏中发挥作用的一般案例，&#34；马斯克写道&#34;前者显然是我们应该长期坚持的方向&#34;\n一辆汽车&#39；对于Steam上的许多高端游戏来说，s的信息娱乐中心似乎是一个奇怪的选择。但特斯拉汽车长期以来一直在其媒体控制单元（用于信息娱乐控制台）和用于驱动汽车的电子控制单元的核心位置使用高端图形卡；自动驾驶仪自动驾驶系统。\n在去年6月的Computex大会上（据Verge报道），AMD首席执行官Lisa Su表示，公司正在与特斯拉合作，提供Ryzen APU和&#34；一种基于RDNA2的离散GPU，在运行AAA游戏时启动，提供高达10万亿次的计算能力&#34; 这将使系统与像PlayStation 5这样的现代控制台大致相称，尽管其中的10个TopFaLoP中的一些可以在其他组件（如ECU）中拆分，可以和39。不要被用来玩游戏。\n苏补充说&#34；我们期待着为玩家提供一个AAA级游戏的绝佳平台；根据马斯克&#39；s关于蒸汽的推特。特斯拉自动驾驶仪（Tesla Autopilot）分析师丹·詹姆斯（Dan James）也在5月份发推文称，有机会&#34；Linux游戏开发者将在特斯拉开发一些非常激动人心的东西&#34; 从字里行间可以看出，这也可以作为与Steam和质子动力Steam游戏系统集成的参考，该系统允许基于Windows的游戏在Steam Deck（和特斯拉汽车）等Linux平台上运行。\n虽然能够将蒸汽库导入汽车是一个不错的功能，但马斯克在做出承诺方面享有一定的声誉，而这些承诺不会&#39；我没能按计划完成。无论如何，唐&#39；当你的特斯拉（Tesla）在运行时，不要指望能玩任何Steam游戏；在一年多前为特斯拉街机游戏添加了该功能后，该公司在开始正式的NHTSA安全调查后再次关闭了该功能。", "note_en": "Since Tesla first introduced in-car gaming with  a 2019 port of  Cuphead, the list of games available on its &#34;Tesla Arcade&#34; platform has  slowly grown to include just under 20 games. Now, though, Tesla CEO Elon Musk has expressed interest in expanding that list of Tesla-compatible games to include the tens of thousands of titles available on the Steam gaming platform. In true Musk style, the informal announcement of those plans came via  a thrown-off tweet in a thread expressing admiration for CD Projekt Red&#39;s   Cyberpunk 2077 (a game that has  previously been demoed running on the infotainment system for the Model S Plaid). &#34;We’re working through the general case of making Steam games work on a Tesla vs specific titles,&#34; Musk wrote. &#34;Former is obviously where we should be long-term.&#34;\n A car&#39;s infotainment center may seem like an odd fit for many of the high-end games available on Steam. But Tesla cars  have long sported high-end graphics cards at the heart of both their Media Control Units (for the infotainment console) and the Electronic Control Units used to power the cars&#39; autopilot self-driving systems.\n    At the Computex conference last June (as  reported by The Verge), AMD CEO Lisa Su said the company was working with Tesla to provide Ryzen APUs and &#34;a discrete RDNA2-based GPU that kicks in when running AAA games, providing up to 10 teraflops of compute power.&#34; That would put the system roughly on par with a modern console like the PlayStation 5, though some of that 10 teraflops may be split among other components (like the ECU) that can&#39;t be used for gaming.\n Su added that &#34;we look forward to giving gamers a great platform for AAA gaming,&#34; a statement that takes on new meaning in light of Musk&#39;s tweet about Steam. Tesla Autopilot Analyst Dan James also  tweeted back in May about an opportunity for &#34;Linux game devs to work on something *extremely* exciting at Tesla!&#34; Reading between the lines a bit, that could also be a reference to plans for integration with Steam and  the Proton-powered Steam Play system that lets Windows-based games run on Linux platforms  such as the Steam Deck (and Tesla cars).\n  While the ability to import your Steam library to your car would be a neat feature, Musk has  something of a reputation for making promises that don&#39;t quite pan out as planned. In any case, don&#39;t expect to be able to play any Steam games while your Tesla is in motion; after  adding that capability for Tesla Arcade games over a year ago, the company  turned it off again following the start of a formal NHTSA safety investigation.", "posttime": "2022-02-25 14:04:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,特斯拉,娱乐中心,install", "title": "马斯克说他想在特斯拉的信息娱乐中心安装Steam游戏", "title_en": "Musk says he wants to install Steam games in Tesla infotainment centers", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/musk-says-he-wants-to-install-steam-games-in-tesla-infotainment-centers/", "via": "", "real_tags": ["游戏", "特斯拉", "娱乐中心", "install"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Siri已经有四种美国口音的英语语音，但苹果将在iOS 15.4中增加第五种。据Axios报道，新的voice旨在首次提供性别中立的选择。\n声音的标签是&#34；声音5和34；在当前测试版的设置面板中，开发者史蒂夫·莫斯在Twitter上指出，该声音名为&#34；奎因和#34；在引擎盖下面。苹果向Axios确认，该语音是由LGBTQ+社区的一名成员录制的。Moser还发了一个新声音的例子：\niOS 15.4 Beta 4的变化🧵: 苹果增加了第五个美国Siri语音，文件名为“Quinn”图片。啁啾com/HFQZV1oF0I\n-史蒂夫·莫斯（@SteveMoser）2022年2月22日\n自从Siri在2011年首次成为iPhone的核心功能以来，大部分时间里，女性声音都是默认的。去年，苹果改变了iPhone的设置，提示用户在首次启动iPhone时选择男性或女性声音，但没有选择默认选项，这一点发生了改变。\n苹果向Axios发送了以下关于iOS 15.4测试版新增语音的声明：\n我们&#39；我们很高兴为说英语的人推出一种新的Siri语音，为用户提供更多选择与他们说话的语音的选项。全世界数以百万计的人每天都依赖Siri来帮助完成任务，因此我们努力让体验尽可能个性化。\n去年，苹果还增加了第三个和第四个美英Siri语音，即代表非裔美国人的女性和男性语音。\n除了这五种美国英语语音，苹果还提供多种其他语言的Siri语音，包括粤语、普通话、丹麦语、荷兰语、芬兰语、法语、德语、希伯来语、意大利语、日语、韩语、马来语、挪威语、葡萄牙语、俄语、西班牙语、瑞典语、泰语和土耳其语。这些语言中也有一些地区或口音变体，如智利语、墨西哥语、西班牙语和西班牙语的美国变体。即将发布的iOS 15.4的其他变化包括戴口罩时使用人脸识别码、双sim 5G支持、设置首选音乐流服务等。", "note_en": "There are already four American-accented English voices for Siri, but Apple will add a fifth in iOS 15.4. The new voice aims to provide a gender-neutral option for the first time, as  reported by Axios.\n The voice is labeled &#34;Voice 5&#34; in the Settings panel in the current beta release, though developer Steve Moser  noted on Twitter that the voice is named &#34;Quinn&#34; under the hood. Apple confirmed to Axios that the voice is built from recordings by a member of the LGBTQ+ community. Moser also tweeted an example of what the new voice sounds like:\n iOS 15.4 Beta 4 changes 🧵: Apple adds a 5th American Siri voice with filename ‘Quinn’  pic.twitter.com/HFQZV1oF0I\n— Steve Moser (@SteveMoser)  February 22, 2022\n For most of the time since Siri first became a core iPhone feature back in 2011, a female voice was the default. That changed last year when Apple changed the iPhone setup to prompt the user to pick a male or female voice when first starting the iPhone, with no default choice selected.\n    Apple sent the following statement to Axios about the new voice added in the iOS 15.4 beta:\n We&#39;re excited to introduce a new Siri voice for English speakers, giving users more options to choose a voice that speaks to them. Millions of people around the world rely on Siri every day to help get things done, so we work to make the experience feel as personalized as possible.\n Apple also added the third and fourth US English Siri voices last year—female and male voices meant to represent the speech of African Americans.\n  In addition to these five US English voices, Apple offers Siri voices in numerous other languages, including Cantonese, Mandarin, Danish, Dutch, Finnish, French, German, Hebrew, Italian, Japanese, Korean, Malay, Norwegian Bokmål, Portuguese, Russian, Spanish, Swedish, Thai, and Turkish. There are also several regional or accent variations within those languages, such as Chilean, Mexican, Spanish, and US variants of Spanish. Other changes in the upcoming iOS 15.4 include the ability to use Face ID while wearing a face mask, dual-sim 5G support, the ability to set a preferred music-streaming service, and more.", "posttime": "2022-02-25 14:00:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,ios,apple,siri,add", "title": "苹果将在iOS 15.4中添加第五个美英Siri语音", "title_en": "Apple will add fifth US English Siri voice in iOS 15.4", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/apple-will-add-fifth-us-english-siri-voice-in-ios-15-4/", "via": "", "real_tags": ["苹果", "ios", "apple", "siri", "add"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021年2月，美国邮政局提出了一个有争议的决定，用一支新的船队来取代其老化和低效的邮车，几乎全部都是新的低效柴油邮件卡车。尽管美国邮政的绝大多数配送路线都非常适合电动汽车，但美国邮政决定，计划订单中只有10%是电动电池。\n2022年2月初，这一决定招致了美国环境保护署和白宫环境质量委员会的严厉批评，他们指责邮政服务未能按照法律要求对其决定的环境影响进行适当审查。\n本周，美国邮政发布了下一代运载工具采购的最终决策记录和环境考虑记录。它&#39；这对任何关心气候变化或空气污染的人来说都是个坏消息，因为邮政部门一直坚持并拒绝改变其计划。这意味着，在订购的50000-165000辆NGDV中，90%将使用汽油，与空调一起使用时，平均每加仑仅为8.6英里（28.86升/100公里）。\n在EPA&#39；该机构在给邮政局的信中告诉USPS，它应该开启一个新的公开评论期，并要求就NGDV的决定举行公开听证会。\nUSPS现在拒绝了EPA&#39；s的要求，声称仅仅因为&#34；EPA不同意邮政服务的结论，但这并没有改变以下事实：邮政服务的分析和假设是合理的，基于可靠的来源，并反映了邮政服务在邮政物流和采购领域的卓越专业知识和丰富经验&#34;\nUSPS还抱怨EPA和CEQ的时间安排&#39；它继续以贫困为由，声称不能订购超过5000辆电动汽车。报告还说，邮政服务部门现在已经考虑并拒绝了购买像福特&#39；他说，Ars上个月驾驶的e-Transit尚未上市。\nUSPS还抱怨EPA&#39；s对NGDV的评估&#39；它的燃油效率非常糟糕，声称只有在不运行空调的情况下比较其燃油里程才是公平的。这个数字是每加仑14.7英里（每100公里16.00升）。然而，该报告没有提及在所有NGDV投入使用后关闭空调。\n&#34;拜登政府、国会、环境和公共卫生组织以及空气监管机构已明确表示，邮政服务的电气化必须是气候和公共卫生的首要任务。拒绝就这样一个有缺陷、有争议的计划举行公开听证会，充分说明了邮政局长路易斯·德乔伊（Louis DeJoy）和#34的恶意；塞拉俱乐部的凯瑟琳·加西亚说&#39；这对所有导演来说都是干净的交通工具&#34;没有理由在2022年推进这一计划；她在一份声明中说。\n乔·拜登总统仍然无法取代邮政局长路易斯·德乔伊，原因是后者#39；来自USPS的持续支持&#39；美国董事会。", "note_en": "In February 2021, the United States Postal Service made a controversial decision to replace its fleet of aging and inefficient mail trucks with  a new fleet made up almost entirely of new, inefficient diesel mail trucks. Although the vast majority of USPS delivery routes are ideally suited for electric vehicles, the USPS decided that a mere 10 percent of the planned order would be battery electric.\n In early February 2022, that decision  resulted in severe criticism from the US Environmental Protection Agency and the White House Council on Environmental Quality, who accused the Postal Service of failing to properly examine the environmental impact of its decision, as required by law.\n This week, the USPS released its  final record of decision and record of environmental consideration for the Next Generation Delivery Vehicle purchase. And it&#39;s bad news for anyone who cares about climate change or air pollution, as the Postal Service has dug in and refuses to alter its plans. That means that 90 percent of the 50,000-165,000 NGDVs that are being ordered will use gasoline and will only average 8.6 mpg (28.86 L/100 km) when used with air conditioning.\n In the EPA&#39;s letter to the Postal Service, the agency told the USPS that it should open a new public comment period and requested a public hearing on the NGDV decision.\n    The USPS has now rejected the EPA&#39;s demands, claiming that just because the &#34;EPA disagrees with the Postal Service’s conclusions does not change the fact that the Postal Service’s analyses and assumptions are reasonable, based on credible sources, and reflect the Postal Service’s superior expertise and extensive experience in the field of postal logistics and procurement.&#34;\n The USPS also complained about the timing of the EPA and CEQ&#39;s complaints, and it continues to plead poverty as the reason that it cannot order more than 5,000 EVs. The report also says the Postal Service has now considered and rejected the idea of buying a commercial off-the-shelf alternative like Ford&#39;s new electric e-Transit van, claiming that the e-Transit— which Ars drove last month—is not yet to market.\n The USPS also complained about the EPA&#39;s assessment of the NGDV&#39;s terrible fuel efficiency, claiming that it would only be fair to compare its fuel mileage when not running air conditioning. That number is 14.7 mpg (16.00 L/100 km). The report makes no mention of disabling the air conditioning for all NGDVs once they reach service, however.\n &#34;The Biden administration, Congress, environmental and public health groups, and air regulators have made it clear that electrifying the Postal Service must be a top priority for climate and public health. Refusing to hold a public hearing on such a flawed and controversial plan speaks volumes about the ill intentions of Postmaster Louis DeJoy,&#34; said Katherine García, the Sierra Club&#39;s Clean Transportation for All director. &#34;There should be no reason this plan is moving forward in 2022,&#34; she said in a statement.\n President Joe Biden remains unable to replace Postmaster Louis DeJoy due to the latter&#39;s  continued support from the USPS&#39;s Board of Governors.", "posttime": "2022-02-25 13:56:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "卡车,sticks,邮政", "title": "USPS坚持购买低效率的8.6 mpg卡车的决定", "title_en": "USPS sticks with decision to buy inefficient 8.6 mpg trucks", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/usps-says-too-bad-its-still-not-buying-more-electric-mail-trucks/", "via": "", "real_tags": ["卡车", "sticks", "邮政"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074876, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们&#39；我已经知道几个月了，EA一直在质疑它与国际足联（FIFA）近30年的关系的价值。FIFA是一个国际足球管理机构，它的名字已经成为一个超级流行的视频游戏系列的同义词。不过，现在，EA首席执行官安德鲁·威尔逊（Andrew Wilson）最近泄露的声明详细说明了&#34；讽刺的是，国际足联的许可证实际上是一个障碍；EA想要的一些方式&#34；扩大特许经营权&#34; &#34;我们的玩家告诉我们，他们想要更多的游戏模式，不同于11和11的东西，以及不同类型的游戏，&#34；据《电子游戏纪事报》报道，威尔逊在11月的一次全体人员会议上说&#34;我想告诉你，这是一场让国际足联承认我们想要创造的东西类型的斗争，因为他们说我们的许可证只涵盖某些类别。。。国际足联只是盒子上的名字，但它们阻止了我们进入球员想要的领域&#34;\n除了游戏性，FIFA许可证还限制EA&#39；包括&#34；更多的文化和商业品牌&#34；据报道，威尔逊在比赛中说。国际足联&#39；例如，谷歌与阿迪达斯的现有关系禁止在游戏中包含任何耐克品牌的产品或图像。\n据报道，威尔逊说，即使国际足联最终批准了某件事；由于批准时间表的性质和我们国际足联许可证的各种各样的事情，这实际上非常困难，我们的行动比我们想要的慢得多&#34;\n这不会&#39；这不是令人垂涎的体育许可证第一次对游戏设计产生影响。在美式足球方面，NFL要求Midway在NFL顶级闪电战系列赛中淡化后期点击和过度庆祝等特征。当EA在2012年带回NFL闪电战时，据报道联盟要求这场比赛&#39；这是世界上最过度的暴力，需要缓和，以符合#34；他们对球员健康和安全的看法&#34; EA和#39；s的NFL许可证还禁止其他出版商制作任何&#34；模拟&#34；具有联赛资格的比赛&#39；这是官方的支持。因此，拿两个例子来说，NFL2K品牌即将复兴的标题&#34；将是非模拟足球比赛体验，&#34；不管这意味着什么。\n自1993年国际足联国际足球赛（FIFA International Soccer）在世嘉创世纪（Sega Genesis）上发布以来，EA和FIFA之间最为旷日持久的公开较量中发表了上述评论。去年10月，EA公开确认其为&#34；审查我们与国际足联的命名权协议&#34；而且它正在考虑将该系列更名。在该声明发布后不久，《纽约时报》报道称，国际足联要求EA将其每年为这些许可权支付的近1.5亿美元增加一倍。\n国际足联回应了EA&#39；该公司发表声明称其为&#34；在游戏和电子竞技中采用新的商业定位#34；和&#34；与包括开发商、投资者和分析师在内的各个行业参与者合作，建立游戏、电子竞技和互动娱乐行业的长期愿景&#34;\n国际足联&#39；s报道称，每四年世界杯周期超过10亿美元的授权要求意义重大，即使是最近仅从年度&#34；终极团队&#34；微交易销售。国际足联&#39；很明显，美国对更多资金的推动让EA怀疑它是否&#39；它从许可关系中获得了足够的价值，这是它与单个足球队、联赛和其他合作伙伴的300多个许可关系之一。\n&#34;基本上，在一个非世界杯的年份，我们从FIFA那里得到的是盒子正面的四个字母，在这个世界上，大多数人甚至不再看到盒子，因为他们以数字方式购买游戏，&#34；据报道，威尔逊说。在世界杯期间，国际赛事的数字版本增加了真实性#34；是重要的，但不是最重要的；威尔逊接着说。\n威尔逊还表示，他已直接与国际足联主席詹尼·范塔尼诺讨论了自己的投诉，并将财务和游戏设计问题结合起来&#34;我说，‘听着，钱是一件事：我们不想支付超过这个许可证价值的钱，&#39&#34; 据报道，他说&#34;但这并不是关于这一点，而是关于我们及时提供球迷想要的比赛和体验的能力&#39;&#34;\n去年10月，EA为&#34；EA体育俱乐部和#34；建议如果国际足联授权讨论失败，可能会重塑品牌。", "note_en": "We&#39;ve  known for months that EA has been questioning the value of its nearly three-decade-long relationship with FIFA, the international soccer governing body whose name has become synonymous with an ultra-popular video game series. Now, though, newly leaked statements attributed to EA CEO Andrew Wilson detail how &#34;ironically, the FIFA license has actually been an impediment&#34; to some of the ways EA wants to &#34;grow the franchise.&#34; &#34;Our players tell us they want more modes of play, different things beyond 11 vs. 11 and different types of gameplay,&#34; Wilson said in a November all-hands meeting, according to  a Video Games Chronicle report. &#34;I would tell you, it’s been a fight to get FIFA to acknowledge the types of things that we want to create because they say our license only covers certain categories... FIFA is just the name on the box, but they’ve precluded our ability to be able to branch into the areas that players want.&#34;\n Beyond gameplay, the FIFA license also limits EA&#39;s ability to include &#34;more cultural and commercial brands&#34; in the game, Wilson reportedly said. FIFA&#39;s existing relationship with Adidas bars the inclusion of any Nike-branded products or imagery in the game, for instance.\n And Wilson reportedly said that even when FIFA does end up approving something, &#34;because of the nature of the approval timetables and the various things around our FIFA licence, that’s actually been really hard, and we’re moving much slower than we want.&#34;\n  This wouldn&#39;t be the first time a coveted sports license had an impact on game design. In American football, the NFL  asked Midway to tone down features like late hits and excessive celebrations in the over-the-top  NFL Blitz series. When EA  brought back  NFL Blitz in 2012, the league  reportedly asked for the game&#39;s most excessive violence to be toned down to align with &#34;their take on player health and safety.&#34; EA&#39;s NFL license also stops other publishers from making any &#34;simulation&#34; games that bear the league&#39;s official support. Thus Take-Two says that titles in its coming revival of the  NFL2K brand &#34;will be non-simulation football game experiences,&#34;  whatever that means.\n     The comments come during the most protracted public battle between EA and FIFA since  FIFA International Soccer was released on the Sega Genesis back in 1993. Last October, EA  publicly confirmed that it was &#34;reviewing our naming rights agreement with FIFA&#34; and that it was considering renaming the series going forward. Shortly after that announcement, The New York Times  reported that FIFA was asking EA to double the nearly $150 million it pays annually for those licensing rights.\n FIFA responded to EA&#39;s move by  issuing its own statement saying it was &#34;adopt[ing] a new commercial positioning in gaming and eSports&#34; and &#34;engaging with various industry players, including developers, investors and analysts, to build out a long-term view of the gaming, eSports, and interactive entertainment sector.&#34;\n  FIFA&#39;s reported licensing ask of over $1 billion for every four-year World Cup cycle is significant, even for a series that recently  brought in $1.62 billion just from annual &#34;Ultimate Team&#34; microtransaction sales. And FIFA&#39;s push for more money apparently has EA wondering whether it&#39;s getting sufficient value from that licensing relationship, which is one of over 300 it has with individual soccer teams, leagues, and other partners for the game.\n &#34;Basically, what we get from FIFA in a non-World Cup year is the four letters on the front of the box, in a world where most people don’t even see the box anymore because they buy the game digitally,&#34; Wilson reportedly said. During World Cup years, the added authenticity of having a digital version of the international tournament &#34;is important, but it’s not the most important [thing],&#34; Wilson continued.\n Wilson also said he had discussed his complaints with FIFA President Gianni Infantino directly, wrapping the financial and game design issues together. &#34;I said, ‘Listen, the money’s a thing: We don’t want to pay more money than this license is worth,&#39;&#34; he reportedly said. &#34;But it’s not about that, it’s really about our ability to deliver games and experiences that our fans want in a timely fashion.&#39;&#34;\n Last October, EA filed for  European and  British trademarks for &#34;EA Sports FC,&#34; suggesting a potential rebranding if the FIFA licensing discussions fall through.", "posttime": "2022-02-25 13:54:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,表示,comments,国际足联", "title": "在泄露的评论中，EA表示国际足联的许可证阻碍了足球比赛的设计", "title_en": "In leaked comments, EA says FIFA license is holding back soccer game design", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/in-leaked-comments-ea-says-fifa-license-is-holding-back-soccer-game-design/", "via": "", "real_tags": ["设计", "表示", "comments", "国际足联"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074874, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众所周知，微软在Windows 8上全力以赴开发以平板电脑为中心的触摸屏界面，自那以后，该公司几乎在所有主要的Windows版本上都在慢慢放弃这一决定。这一撤退在Windows 11上达到了顶峰，它彻底清除了Windows 10中仅存的平板电脑模式的最后痕迹。\n但最近几次Windows 11 Insider预览版增强了Windows 11&#39；s的触摸屏功能。上周发布给开发者频道用户的版本包括新的手势、在平板电脑模式下对抓拍窗口工作方式的更改，以及其他一些改进。今天发布的一个新版本彻底改变了触摸屏的任务栏。\n当前形式的Windows 11在&#39；重新将您的设备用作平板电脑，但新的预览版更进一步。当你&#39；重新使用应用程序时，任务栏将缩小到屏幕底部的窄条：它&#39；它仍然足够高，可以显示时钟、网络、声音和电池状态图标，但所有固定的应用程序和其他系统托盘图标都被隐藏。从屏幕底部向上滑动或关闭应用程序窗口会显示一个新的、更大版本的任务栏，带有更大、更友好的手指图标和间距。一旦你&#39；我已经启动了你的应用程序。\n如果你想自己尝试这些功能，你&#39；我想使用触摸屏硬件Windows 11仍然不&#39；我没有像Windows 10那样的专用平板电脑模式切换。相反，操作系统依赖于来自硬件的信号来启用和禁用以平板电脑为中心的UI调整。如果&#39；例如，在平板电脑模式下重新使用Surface设备，或者在瑜伽风格的可转换笔记本电脑上翻转铰链。", "note_en": "Microsoft famously went all-in on a tablet-centric touchscreen interface with  Windows 8, and the company has spent pretty much every major Windows release since then slowly backing away from that decision. That retreat culminated in  Windows 11, which fully removed the last vestiges of Tablet Mode that had survived in Windows 10.\n But the last couple Windows 11 Insider Preview builds have augmented Windows 11&#39;s touchscreen capabilities.  The build released to Dev channel users last week included new gestures, changes to how snapping windows works when in tablet mode, and a few other improvements. And  a new build released today totally overhauls the taskbar for touchscreens.\n Windows 11 in its current form adds more space between icons when you&#39;re using your device as a tablet, but the new preview goes further. When you&#39;re using apps, the taskbar will shrink to a narrow strip across the bottom of the screen: it&#39;s still tall enough to show the clock and your network, sound, and battery status icons, but all your pinned apps and other system tray icons are hidden. Swiping up from the bottom of the screen or closing an app window brings up a new, larger version of the taskbar with larger, more finger-friendly icons and spacing. The taskbar disappears again once you&#39;ve launched your app.\n       If you want to try these features for yourself, you&#39;ll want to use touch-enabled hardware—Windows 11 still doesn&#39;t have a dedicated Tablet Mode toggle like Windows 10 did. Instead, the OS relies on signals from your hardware to enable and disable the tablet-centric UI tweaks. You should see the new taskbar automatically if you&#39;re using  a Surface device in tablet mode, for example, or if you flip the hinge on a Yoga-style convertible laptop.", "posttime": "2022-02-25 13:51:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,触摸,friendly,平板", "title": "所有新的触摸友好任务栏都是最新的Windows 11预览版", "title_en": "All-new touch-friendly taskbar comes to latest Windows 11 preview", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/all-new-touch-friendly-taskbar-comes-to-latest-windows-11-preview/", "via": "", "real_tags": ["windows", "触摸", "friendly", "平板"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于超级用户、游戏玩家和那些寻求高功能鼠标的人来说，更多的按钮是有益的。Roccat希望通过即将推出的通力XP来吸引这些人，它有15个按钮，通过软件编程后可以作为29种不同的输入。\nRoccat和#39；今天发布的通力XP描述了外设是&#34；理想&#34；用于MMO和战略游戏。但高可编程性使得通力XP也有可能成为高级通用产品。\n可编程按钮包括：左键和右键单击、滚轮（5个输入：上、下、左、右和内）、滚轮以南的按钮、左键单击按钮附近的两个按钮、四个侧键和鼠标附近的一个拇指按钮&#39；这是我们的基地。\n下载Roccat&#39；当与指定按钮一起按下时，s软件为每个按钮提供辅助功能。指定的按钮可以同时位于鼠标或Roccat键盘上。这个简单的Shift[+]功能意味着你可以用鼠标编程29种不同的输入&#39；这是15个按钮。为什么不是30岁？因为其中一个按钮必须是Easy Shift[+]按钮。\n那&#39；它有很多功能，但通力XP将不得不在专门针对MMO游戏的价格范围内与mice竞争。这些满是按钮的竞争对手包括20个按钮的罗技G600 MMO（截至本文撰写时为35 MSRP）和16个按钮的Razer Naga X（80 MSRP）。后者有剃须刀和#39；s超换档功能，其工作原理与Roccat#39；It’s Easy Shift[+]。\n我说过通力XP主要针对游戏玩家，但你可能已经从它的外观上看出了这一点。鼠标总共有22个RGB LED。在八个导光板的帮助下，LED通过鼠标发射颜色#39；它有清晰的底盘和滚轮，Roccat称之为&#34；烟熏透明设计&#34；用来分散光线。\n鼠标没有&#39；Don’不要试图仅仅靠它的颜色和按钮布局来吸引玩家。它还有一个基于PixArt PAW3370的传感器，称为Roccat猫头鹰眼，具有极高的规格，包括50-19000 DPI（每英寸点数）。那&#39；与其他一些游戏鼠标相比，它的最大DPI更小，比如25000 CPI罗技G303裹尸布版。但对大多数人来说，DPI的范围是足够的。\n同时，左键和右键点击按钮使用龟背滩子品牌#39；美国本土土卫六光开关。在Roccat Kone Pro鼠标I&#39；经过测试，我发现这些开关比许多标准的机械鼠标开关更容易启动，噪音也更柔和。但是亲&#39；s的咔哒声也感觉不那么尖锐。时间会告诉我们通力XP&#39；不同的点击方式有所不同。\n最后一次向玩家点头，Roccat&#39；s通力XP也将与英伟达合作&#39；s反射潜伏期分析仪。\nArs Technica可能会通过联盟计划从本文链接中获得销售报酬。", "note_en": "For power users, gamers, and those seeking a highly functional mouse, more buttons is beneficial. Roccat wants to appeal to such people with its upcoming Kone XP, which has 15 buttons that can serve as 29 different inputs after programming via software.\n Roccat&#39;s announcement of the  Kone XP today described the peripheral is &#34;ideal&#34; for MMOs and strategy games. But high programmability makes the Kone XP potentially appealing for advanced general use, too.\n The programmable buttons are: left- and right-click, the scroll wheel (5 inputs: up, down, left, right, and in), the button south of the scroll wheel, two buttons near the left-click button, four side buttons, and a thumb button near the mouse&#39;s base.\n  Downloading Roccat&#39;s software gives each button a secondary function when pressed alongside a designated button. The designated button could be on the mouse or a Roccat keyboard simultaneously. That Easy-Shift[+] feature means you could program 29 different inputs with the mouse&#39;s 15 buttons. Why not 30? Because one of the buttons will have to be the Easy-Shift[+] button.\n That&#39;s a lot of functionality, but the Kone XP will have to compete with mice in its price range specifically geared for MMO games. Those button-laden rivals include the 20-button  Logitech G600 MMO ($35 MSRP as of writing) and the 16-button  Razer Naga X ($80 MSRP). The latter device has Razer&#39;s HyperShift feature that works like Roccat&#39;s Easy-Shift[+].\n      I said the Kone XP primarily targets gamers, but you could probably already discern that from its appearance. The mouse has 22 RGB LEDs in total. With the help of eight light guides, the LEDs blast color through the mouse&#39;s clear chassis and scroll wheel, which has what Roccat describes as a &#34;smoky transparent design&#34; meant to diffuse the lighting.\n The mouse doesn&#39;t try to lure gamers on its colors and button layout alone. It also has a sensor based off the PixArt PAW3370, called the Roccat Owl-Eye, with extreme specs, including 50-19,000  DPI (dots per inch). That&#39;s a lesser max DPI than some other gaming mice, like the 25,000 CPI  Logitech G303 Shroud Edition, offer. But for most, that DPI range is ample.\n  Meanwhile, the left- and right-click buttons use the Turtle Beach sub-brand&#39;s homegrown Titan Optical Switches. In the  Roccat Kone Pro mouse I&#39;ve tested, I found the switches easier to actuate with a softer noise than many standard mechanical mouse switches. But the Pro&#39;s clicks also felt less sharp. Time will tell if the Kone XP&#39;s clicks differ.\n And in a last nod at gamers, Roccat&#39;s Kone XP will also work with Nvidia&#39;s Reflex latency analyzer.\n  Ars Technica may earn compensation for sales from links on this post through  affiliate programs.", "posttime": "2022-02-25 13:49:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "编程,鼠标,mouse,按钮", "title": "新的Roccat鼠标可以编程多达29种不同的输入", "title_en": "New Roccat mouse lets you program up to 29 different inputs", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/new-roccat-mouse-lets-you-program-up-to-29-different-inputs/", "via": "", "real_tags": ["编程", "鼠标", "mouse", "按钮"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074872, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当人们第一次发现快速射电爆发时，它是一个谜。起初，每一个FRB都遵循相同的模式：在无线电波长中持续不到一秒钟的巨大能量激增，然后爆炸消失了，再也不会重复。我们最初怀疑FRB可能是我们的探测器中的硬件故障，但随着时间的推移，爆发#39；反复发生使我们确信它们是真实的。\n从那时起，我们&#39；我们已经确定了重复爆发的来源，并将FRB与在无线电范围外产生能量的来源联系起来。这最终帮助我们找到了一个单一的来源：磁星，或者说是中子星，它们具有极强的磁场。\n现在，现实已经过去了，在这个漂亮而简单的解释中加入了一个猴子扳手。一个新的FRB重复来源已经被确定，它位于一个我们不知道的地方&#39；我不指望能找到磁星。这并不意味着&#39；这并不意味着来源是&#39；t来自磁星，但我们不得不求助于一些不同寻常的解释来解释它的形成。\n磁星是中子星的一种形式，即&#39；一颗质量足以产生超新星，但质量不足以形成黑洞的恒星崩塌后留下的恒星。当残余物被压缩成中子汤时，中子星的物质会收缩，直到它&#39；它只有大约20公里宽。这个紧凑的物体继承了它的母星的所有旋转能量，使它以快速的速度旋转，通常通过加入从其环境中下落的物质而进一步旋转。\n在许多情况下，这种快速旋转会产生脉冲星，即中子星，其辐射源似乎会随着恒星快速闪烁&#39；这是轮换。在另一些情况下，中子星最终会产生强磁场，成为磁星。磁星&#39；地球的强磁力线被它的旋转所缠绕，通常会与环境产生高能相互作用。\n但这些高能现象并不&#39；t往往会持续很长时间，至少从天文角度来看是这样。所有这些与环境的高能相互作用都会导致中子星释放能量，减缓其自转，并降低其产生的任何光的强度。例如，磁星通常被认为只有10000年左右的寿命，然后才进入一种更安静的存在。\n此外，形成磁星的超新星出现在相对年轻的恒星中，通常只有几百万年的历史。\n这种早期恒星死亡和短磁星寿命的结合意味着我们只希望在年轻恒星丰富的区域看到磁星。较老的恒星群体应该在数十亿年前就看到磁星的形成和消失。\n这项新工作由一个大型国际团队完成，涉及对另一个重复FRB源的发现进行跟踪，该源名为FRB 20200120E。为了确定FRB 20200120E的位置，该团队求助于欧洲甚长基线干涉测量网络的分辨率，该网络可以使用分布在世界各地的多达22台望远镜。该团队设法让足够多的望远镜指向重复源，以拍摄五个单独的FRB。\n按照从这些不同望远镜重建数据的方式，单次爆发无法为我们提供精确的位置。相反，可以确定一系列可能的位置。通过结合与每一次爆发一致的位置，研究人员能够为FRB源提供一个可能的位置。\n这个来源原来是附近星系M81中的一个球状星团。基于关于FRB 20200120E位置和M81内球状星团频率的剩余不确定性，研究团队估计FRB 20200120E不在该球状星团中的几率仅为1/10000。\n搜索该位置并没有发现持续存在的无线电信号源。根据使用X射线和伽马射线望远镜进行的搜索，也没有发现高能量来源。所以，有&#39；这不是一个明显的高能物体。\n这个位置很奇怪。球状星团最引人注目的是由老恒星群组成。数十亿年来，它们不太可能有任何形成中子星的超新星。所以这可能会排除磁星的存在，对吧？\n不完全是。少数机制可以在没有超新星的情况下或在超新星发生后很久产生磁星。这些机制主要依赖于附近的伴星。如果伴星是一颗普通恒星，它可以将物质送入白矮星，直到白矮星坍缩成中子星。或者白矮星和中子星的各种组合可以合并，也可以产生中子星。最后，我们知道一个正常的伴侣可以&#34；向上旋转&#34；一颗以前安静的中子星，通过给它提供物质。\n这些过程中的任何一个都有可能在老恒星群中产生磁星。鉴于现场明显没有任何非爆破活动，如果其中任何一个过程实际上发生在FRB 20200120E，可能很难进行分类。\n无论如何，这一发现表明，如果磁星是所有FRB的来源，那么我们可能期望在比这一发现之前预测的更广泛的环境中看到它们。我们可能还不想排除非磁性来源的考虑。", "note_en": "Fast radio bursts were an enigma when they were first spotted. At first, each FRB followed the same pattern: a huge surge of energy in radio wavelengths that lasted less than a second—and then the burst was gone, never to repeat. We initially suspected FRBs might be hardware glitches in our detectors, but over time, the bursts&#39; recurrence convinced us that they were real.\n Since then, we&#39;ve identified  sources of repeated bursts and associated the FRBs with a source that produces energy outside the radio range. This ultimately helped us point the finger  at a single source: magnetars, or neutron stars that have extremely intense magnetic fields.\n Now, reality has gone and thrown a monkey wrench in that nice and simple explanation. A new repeating source of FRBs has been identified, and it resides in a location where we wouldn&#39;t expect to find any magnetars. This doesn&#39;t mean that the source  isn&#39;t from a magnetar, but we have to resort to some unusual explanations for its formation.\n  A magnetar is a form of neutron star, which is what&#39;s left after the collapse of a star that is massive enough to generate a supernova but not massive enough to form a black hole. As that remnant is compressed into a soup of neutrons, the matter of a neutron star shrinks until it&#39;s only about 20 kilometers across. That compact object inherits all the rotational energy of its parent star, causing it to spin at a rapid rate, often furthered by the addition of matter falling in from its environment.\n    In many cases, this rapid rotation results in pulsars, neutron stars that have sources of radiation that appear to blink rapidly in time with the star&#39;s rotation. In some others, the neutron star ends up with an intense magnetic field, making it a magnetar. A magnetar&#39;s intense magnetic field lines are whipped around by its rotation, often creating high-energy interactions with its environment.\n But these high-energy phenomena don&#39;t tend to last long, at least in astronomical terms. All of these energetic interactions with the environment cause the neutron star to shed energy, slowing its rotation and reducing the intensity of any light it produces. For example, magnetars are thought to typically have life spans on the order of only 10,000 years before fading into a quieter existence.\n In addition, the supernova that form magnetars occur in relatively young stars, typically only a few million years old.\n This combination—an early stellar death and a short magnetar life span—means we only expect to see magnetars in areas with an abundance of young stars. Older star populations should have seen magnetars form and fade out billions of years earlier.\n  The new work, done by a large international team, involved following up on the discovery of another repeating FRB source, called FRB 20200120E. To identify where FRB 20200120E was located, the team turned to the resolving power of the European Very Long Baseline Interferometry Network, which can use as many as 22 telescopes  scattered throughout the world. The team managed to get enough of those telescopes pointed at the repeating source to image five individual FRBs.\n The way reconstructing data from these different telescopes work, a single burst will not get us a precise location. Instead, a range of possible locations can be identified. By combining the locations that are consistent with each of these bursts, the researchers were able to provide a likely location for the FRB source.\n    That source turned out to be a globular cluster of stars in the nearby galaxy M81. Based on the remaining uncertainty regarding the location of FRB 20200120E and the frequency of globular clusters within M81, the research team estimates that the chances of FRB 20200120E not being in this globular cluster is only about 1 in 10,000.\n Searching that location did not reveal a persistent source of radio signals. No high-energy sources, based on searches using X-ray and gamma-ray telescopes, turned up either. So, there&#39;s not an obvious high-energy object there.\n  This location is odd. Globular clusters are most notable for consisting of populations of old stars. There are unlikely to have been any neutron-star-forming supernovae in them for billions of years. So that should probably rule the presence of a magnetar out, right?\n Not entirely. A handful of mechanisms could produce a magnetar either without a supernova or long after one took place. These mechanisms mostly rely on a nearby companion star. If the companion is a normal star, it can feed matter into a white dwarf star until the dwarf collapses into a neutron star. Or various combinations of white dwarfs and neutron stars can merge, also producing a neutron star. Finally, we know that a normal companion can &#34;spin up&#34; a previously quiet neutron star by feeding it matter.\n Any of these processes could potentially produce a magnetar within a population of old stars. Which process—if any of them—has actually taken place at FRB 20200120E may be difficult to sort out, given the apparent absence of any nonburst activity from the site.\n In any case, the finding suggests that, should magnetars be the source of all FRBs, then we might expect to see them in a much broader range of environments than would have been predicted prior to this discovery. And we might not want to rule out consideration of nonmagnetar sources just yet.", "posttime": "2022-02-25 13:45:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "应该,radio,中子星", "title": "在不应该有任何辐射源的地区发现了新的快速无线电爆炸", "title_en": "New fast radio burst found in area that shouldn’t have any sources", "transed": 1, "url": "https://arstechnica.com/science/2022/02/new-fast-radio-burst-found-in-area-that-shouldnt-have-any-sources/", "via": "", "real_tags": ["应该", "radio", "中子星"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074871, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考古学家从一座西班牙坟墓中挖掘出一个5300年前的头骨，并确定左耳道附近的七个切口是治疗中耳感染的原始外科手术的有力证据。据《科学报告》杂志最近发表的一篇论文的作者称，这是迄今为止发现的最早的耳外科手术。西班牙研究小组还发现了一把可能被用作烧灼工具的燧石刀片。\n发掘地点位于西班牙布尔戈斯的埃尔潘登多尔曼，由一座巨石纪念碑的遗骸组成，可追溯到公元前4世纪，即新石器时代晚期。废墟中有一个骨瓮，里面有近100人的骨头，考古学家自2016年以来一直在挖掘这些遗骸。\n2018年7月，研究小组找到了这项最新研究的主题头骨。头骨位于右侧，面向墓室入口，虽然大部分头骨完好无损，但没有牙齿残留。牙齿缺失，加上骨密度和甲状腺软骨完全骨化，表明这是一位65岁或以上的老年女性的头骨。\n在靠近乳突骨（位于耳朵后面）的颅骨两侧发现了穿孔的证据。作者认为，这些穿孔是两次外科手术的结果，每只耳朵上各有一次，是由具有基本解剖学知识的人进行的。右耳有更多的骨重建，这表明第一次手术是为了治疗可能危及生命的疾病，考虑到这段时间内这种手术的风险。\n这名女子在第一次手术中幸存下来，并在术后一段时间接受了第二次左耳手术。作者无法确定这些程序是连续进行的，还是两个程序之间经过了几个月甚至几年。不管怎样，&#34；因此，这是对两个颞骨进行手术的最早证据，因此很可能是人类历史上已知的第一次乳突根治术；他们写道。\n根据作者的说法，到17世纪，这是一种相当常见的治疗急性耳感染的外科手术，在克罗地亚（11世纪）、意大利（18世纪和19世纪）和哥本哈根（19世纪或20世纪初）发现了有乳突切除证据的头骨。也许最古老的颅骨手术类型是颅骨钻孔术，即在头部钻一个洞，这在伊比利亚半岛已经有很好的记录。从靠近埃尔彭多的多尔曼的一个地点发现的五个头骨显示出钻孔的证据，尽管缺乏抗生素和并发症的高风险，这些人显然在这些手术中幸存下来。\n是什么情况促使了这样的干预？作者排除了胆脂瘤的可能性，胆脂瘤是一种颞骨损伤，可导致听力丧失、眩晕和其他并发症，尽管这是古代头骨病理学研究中记录最充分的疾病之一。但胆脂瘤往往会侵蚀分隔耳道和乳突的骨壁（盾牌），而该女性两侧的盾牌都完好无损；这是头骨。作者还排除了骨肿瘤或恶性外耳炎（耳道和颞骨的快速传播感染）的可能性。\n作者得出结论，最有可能的情况是急性中耳炎，也就是中耳感染，它已经扩散到下面的骨骼，特别是乳突骨（乳突炎）。这种情况本来很容易诊断，因为随着液体和粘液在耳内积聚，感染会导致可见的肿胀和发红。如果中耳感染扩散到乳突骨，骨&#39；这种蜂窝状结构也会充满液体和粘液。如果不进行治疗，这可能会导致听力损失，甚至可能导致脑膜炎。在抗生素广泛使用之前，中耳感染引起的乳突炎是儿童死亡的主要原因之一（幸运的是，这在今天是一种罕见的疾病）。\n现代乳突切除术需要去除乳突骨中的细胞#39；这是一个充满空气的中空空间。在乳突根治术中，外科医生首先在耳后切开，然后用骨钻打开进入中耳腔的通道。然后，外科医生将移除任何受感染的乳突骨或组织，缝合伤口，并包扎伤口。根据作者的说法，他们的新石器时代晚期耳外科医生将遵循类似的（尽管更粗糙）程序，移除受影响的骨头以引流中耳，然后将乳突骨与内耳骨周围的鼓室连接起来。", "note_en": "Archaeologists have excavated a 5,300-year-old skull from a Spanish tomb and determined that seven cut marks near the left ear canal are strong evidence of a primitive surgical procedure to treat a middle ear infection. That makes this the earliest known example of ear surgery yet found, according to the authors of a  recent paper published in the journal Scientific Reports. The Spanish team also identified a flint blade that may have been used as a cauterizing tool.\n The excavation site is located in the Dolmen of El Pendón in Burgos, Spain, and consists of the remains of a megalithic monument dating back to the 4th century BCE, i.e., the late Neolithic period. The ruins include an ossuary holding the bones of nearly 100 people, and archaeologists have been excavating those remains since 2016.\n In July 2018, the team recovered the skull that is the subject of this latest study. The skull was lying on its right side, facing the entrance of the burial chamber, and while most of the cranium was intact, no teeth remained. The missing teeth, plus the loss in bone density and fully ossified thyroid cartilage, indicated that this was the skull of an elderly woman aged 65 or older.\n  Evidence of perforations were found on both sides of the skull near the mastoid bones (located just behind the ear). The authors suggested that these perforations were the result of two surgical interventions, one on each ear, by someone with rudimentary anatomical knowledge. There was more bone remodeling on the right ear, indicting that the first surgery was performed to treat what was likely a life-threatening condition, given the risks associated with such a procedure during this period.\n    The woman survived the first procedure and endured a second surgery on the left ear sometime after. The authors were unable to determine whether the procedures were done back-to-back or whether months or even years passed between them. Regardless, &#34;It is thus the earliest documented evidence of a surgery on both temporal bones and therefore, most likely, the first known  radical mastoidectomy in the history of humankind,&#34; they wrote.\n This was a fairly common surgical procedure to treat acute ear infections by the 17th century, per the authors, and skulls showing evidence of a mastoidectomy have been found in Croatia (11th century), Italy (18th and 19th centuries), and Copenhagen (19th or early 20th century). Perhaps the oldest type of skull surgery is cranial  trepanation—the drilling of a hole in the head—which has been well-documented along the Iberian Peninsula. Five skulls recovered from a site close to the Dolmen of El Pendón showed evidence of trepanation, and the individuals apparently survived those procedures, despite the lack of antibiotics and a high risk of complications.\n  What condition might have prompted such an intervention? The authors ruled out a  cholesteatoma—an injury to the temporal bone that can cause hearing loss, vertigo, and other complications—even though this is one of the most well-documented diseases in pathological studies of ancient skulls. But cholesteatoma tends to erode the bony wall (scutum) separating the ear canal from the mastoid, and the scutum was intact on both sides of the woman&#39;s skull. The authors also ruled out a bone tumor or  malignant external otitis (a fast-spreading infection of the ear canal and temporal bone).\n    The authors concluded that the most likely condition was  acute otitis media, aka a middle ear infection, which had spread to the underlying bone, specifically the mastoid bone ( mastoiditis). The condition would have been easy enough to diagnose, since the infection causes visible swelling and redness as fluid and mucus build up inside the ear. If a middle ear infection spread to the mastoid bone, the bone&#39;s honeycomb-like structure would have also filled with fluid and mucus. Untreated, this would have led to hearing loss and possibly meningitis. Mastoiditis resulting from a middle ear infection was one of the leading causes of death in children prior to the wide availability of antibiotics (and it is mercifully a rare condition today).\n A modern mastoidectomy involves removing the cells in the mastoid bone&#39;s hollow air-filled spaces. In a radical mastoidectomy, the surgeon will first make a cut behind the ear and then use a bone drill to open access to the middle ear cavity. Then the surgeon will remove any infected mastoid bone or tissue, stitch up the cut, and bandage the wound. Per the authors, their late Neolithic ear surgeon would have followed a similar (albeit much cruder) procedure, removing the affected bone to drain the middle ear and then connecting the mastoid bone with the  tympanic cavity surrounding the bone of the inner ear.", "posttime": "2022-02-25 13:43:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "外科手术,skull,乳突", "title": "这具5300年前的头骨显示了已知最早的耳外科手术的证据", "title_en": "This 5,300-year-old skull shows evidence of the earliest known ear surgery", "transed": 1, "url": "https://arstechnica.com/science/2022/02/this-5300-year-old-skull-shows-evidence-of-the-earliest-known-ear-surgery/", "via": "", "real_tags": ["外科手术", "skull", "乳突"]}]