[{"category": "", "categoryclass": "", "imagename": "51a8e32a53da217b8c27ac3956fee6ee.png", "infoid": 1029978, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是对我提出的关于中情局和谷歌之间长达十年的商业交易的“信息自由法”请求的回应。中情局不仅拒绝了我的请求，而且拒绝承认或不承认与这笔交易有关的记录存在-所有这些都是以国家安全的名义进行的。\n潘多的读者可能还记得，我目前正在写一本关于监视谷的书--科技巨头们是如何建造世界上最大的私人监视网络的。在调查这本书的过程中，我一直在更深入地挖掘谷歌与美国军工复合体的关系。\n我试图尽可能准确地指出谷歌开始从一家面向消费者的互联网搜索公司转型为今天的军事情报混合承包商的那一刻。\n这种转变的首批重大里程碑之一发生在2004年11月，当时谷歌收购了一家名为Keyhole Inc的小型且鲜为人知的3-D地图初创公司。谷歌为该公司支付了一笔未披露的金额，立即将其吸收，并开始将其技术转变为我们现在所知的谷歌地球(Google Earth)。要不是因为一个不那么微小的细节，此次收购不会引起注意：Keyhole Inc由美国中央情报局(CIA)和美国国家安全局(NSA)的姊妹机构国家地理空间情报局(National Geospace-Intelligence Agency，NGA)持有部分股权。Keyhole Inc还有一个主要客户群：美国军事和情报机构。\n2003年2月，中情局代表军方和情报界运营的风险投资基金In-Q-Telel对Keyhole进行了一次“战略投资”，一个月后，美国启动了“伊拉克自由行动”。\n在几个月后宣布这项投资的新闻稿中，In-Q-tel讨论了Keyhole与军事和情报伙伴的密切合作，并解释说，在伊拉克的现役军事力量已经成功部署了Keyhole技术。\n尼玛立即向国家安全界展示了Keyhole的技术的价值，并利用该技术支持驻伊拉克的美军。在In-Q-Teletel与Keyhole接触后的两周内，我们实施了这项技术，以支持我们在五角大楼内的任务，尼玛创新公司董事罗布·齐茨(Rob Zitz)说。NIMA现在被称为NGA，是美国国家安全局的姊妹机构。[YL]“引入像Keyhole这样的技术是尼玛致力于改变智能业务和我们为客户服务的方式的一部分。”\n在谷歌收购Keyhole之后，这种活跃的公开吹嘘几乎停止了。但是，收购后，这家搜索巨头继续向五角大楼和各种美国情报机构出售Keyhole的基础技术。\n例如：2010年，谷歌敲定了一份向NGA提供“地理空间可视化服务”的非投标合同。NGA辩称，它不能向微软等竞争对手开放合同，因为它别无选择：美国政府在谷歌的地图和地理空间技术上投入了如此多的精力和资源，根据其特定需求量身定做，以至于五角大楼和情报界目前只能使用谷歌的产品。\n这只是众多此类交易中的一笔。正如我之前报道的那样，谷歌在利润丰厚的军事联系市场一直在大举扩张，以至于它已经向美国几乎每一家主要的军事和情报机构销售先进的军用数据产品。它几乎垄断了政府战场地图技术，为中央情报局(CIA)和美国国家安全局(NSA)配备了先进的搜索能力，与五角大楼共同投资间谍卫星和战场机器人，与洛克希德·马丁公司(Lockheed Martin)等传统军事承包商合作，并越来越多地由来自美国陆军、空军情报机构和中央情报局的五角大楼高级官员担任高管。\n只有一个问题：除了几个基本细节外，公众对谷歌收购Keyhole Inc.知之甚少。\n最明显的问题是：是什么促使了这笔收购？谷歌是否因为急需3D地图技术而收购了Keyhole，并承担了所有的军事合同和Natsec债务？还是谷歌将此次收购视为进入军事承包业务的便捷途径？公司内部有没有就吸收一家与中央情报局(CIA)和五角大楼关系如此密切的初创公司的利弊进行过任何讨论？\n然后是中情局的观点：鉴于Keyhole与活跃的军事和情报行动的密切合作，中情局是如何处理这笔交易的？为什么选择谷歌？中情局有什么顾虑吗？它对谷歌施加了条件吗？作为交易的一部分，它是否要求谷歌履行Keyhole之前对英特尔的承诺？如果是，这些承诺是什么？\n换句话说：谷歌--目前地球上最大的私人监控行动--与运行着最大规模政府监控行动的美国中央情报局(CIA)和美国国家安全局(NSA)达成了什么协议？\n幸运的是，我们有一个明确设计的程序，让公众了解政府在闭门造车地做什么：信息自由法请求，或称“信息自由法”(FOIA)。\n因此，早在5月份，我就向中央情报局提交了一份“信息自由法”请求，要求：\n1)“…。与Keyhole Inc.有关的所有信件(电子邮件、信件、相关文件和附件)的副本。请求的这一部分应包括中情局与Keyhole Inc代表(例如John Hanke)之间的所有通信。日期范围：2000年1月1日至2006年12月31日。“2)”…。提及或讨论谷歌收购Keyhole Inc.的所有信件(电子邮件、信件、相关文件和附件)的复印件。这部分请求应该包括中情局和谷歌代表之间关于Keyhole的所有通信，包括Keyhole软件和服务。日期范围：2003年1月1日至2014年12月31日。“。\n中情局回复我的速度出奇的快。但中情局没有给我寄来一叠高度编辑的文件，而是直接从汤姆·克兰西(Tom Clancy)的一本小说里给我发来了一份简短的两页回复：它既不能证实也不能否认“这些记录的存在”。也就是说，中情局参与向谷歌出售Keyhole的任何文件的存在或不存在本身就是一个秘密，不能因为国家安全的原因而向公众泄露。\n根据行政命令13526第3.6(A)节，中央情报局既不能确认也不能否认记录的存在或不存在，以回应您的请求。所要求的记录的存在或不存在的事实目前是适当保密的，属于情报来源和方法信息，受1949年“中央情报局法案”(修订本)第6节和1947年“国家安全法”(修订本)第102A(I)(L)节的保护，不得披露。因此，根据“信息自由法”豁免(B)(1)和(B)(3)，您的申请被拒绝。\n中央情报局的信息官员好心地包括了相关的“信息自由法”豁免的定义。他们说…。\n(B)(1)根据行政命令…，豁免披露目前和适当分类的资料。\n(B)(3)豁免披露另一联邦法规保护的信息，前提是另一联邦法规要么要求扣留有关事项，要么规定扣留的特定标准，或提及要扣留的特定类型的事项。中央情报局所依赖的(B)(3)规约包括但不限于1949年中央情报局法案…。\n这封信没有解释为什么这两个人--(B)(1)和(B)(3)--与扣留所要求的信息的决定有关。\n幸运的是，记者新闻自由委员会(RCFP)在一份方便的指南中简要介绍了这些豁免的意义和预期用途。它解释说，只有在“合理地可以预期未经授权披露信息会对国家安全造成损害”的情况下，才可以使用(B)(1)项来限制对文件的访问。目前属于这一规定的一些信息包括：军事计划和武器系统；情报活动和方法；影响国家安全的技术；与国家安全有关的系统的脆弱性和能力。\n简而言之：(B)(1)免除正在进行的军事和情报行动，或可能影响这些行动的信息。\n第二项豁免(B)(3)同样宽泛。RCFP解释说，它允许中央情报局拒绝根据“信息自由法”以外的法律免于披露的记录请求。在这种情况下，中央情报局写信给我说，至少有2个可能更多-豁免文件披露的雕像。其中之一是1949年的中情局法案-该法案基本上赋予了中情局采取最终保密行动的权力，并免除了几乎所有正常的政府要求。实质上，中情局的(B)(3)是所谓的“格洛玛回应”(Glomar Response)，以该机构在20世纪70年代中期拒绝确认或否认存在一艘名为“格洛马尔探索者号”(Glomar Explorer)的秘密船只命名，该秘密船只是为打捞一艘沉没的苏联核潜艇而建造的。\n那么，为什么中情局在被要求透露一场关于谷歌收购中情局一笔小额投资的长达十年的对话时，会援引国家机密和国家安全论点呢？Keyhole和谷歌与中央情报局(CIA)的关系是什么，对美国的军事目标如此敏感和至关重要，以至于仅仅承认这些记录的存在就对国家安全构成了严重威胁？\n目前，这些问题仍然没有答案，但希望不会持续太久。我已经对“信息自由法”的否认提出了上诉，当我听到结果时，我会更新这篇报道。\n当然，具有讽刺意味的是，谷歌一直吹嘘自己勇敢地对抗国家安全状态。在爱德华·斯诺登(Edward Snowden)之后，它资助了隐私智囊团，支持反NSA抗议活动，大张旗鼓地反对秘密窃听，反对秘密法庭命令，并尽其所能让公众相信，它真的关心隐私和网络民主，在与当今悄悄蔓延的军事监控社会的斗争中，它站在我们这边。\n就在上个月，这家搜索巨头还坚称，它曾与司法部抗争，要求谷歌允许谷歌警告维基解密活动人士雅各布·阿佩尔鲍姆(Jacob Appelbaum)政府试图访问他的Gmail记录。为此，阿佩尔鲍姆和包括美国公民自由联盟(ACLU)克里斯托弗·索戈扬(Christopher Soghoian)在内的其他隐私权活动人士对谷歌大加赞扬。\n我觉得我应该给谷歌的法律团队送花。光是这个案子，他们肯定就花了几十万美元。\n-Jacob Appelbaum(@ioerror)2015年6月19日\n可悲的讽刺是：推特从未上过法庭来解封维基解密的命令。举世瞩目的赞誉。谷歌在法庭上打了官司，花了一大笔钱，没人知道。\n-Christopher Soghoian(@csoghoian)2015年6月22日。\n这促使维基解密指出，当涉及到与政府共享数据时，谷歌实际上比Twitter糟糕得多……。\n@csoghoian谷歌交出了更多数据，因为它的商业模式是基于收集和挖掘这些数据。\n--维基解密(@WikiLeaks)2015年6月23日。\n尽管谷歌所有的姿态都是政府监视的祸害，但美国中央情报局(CIA)全面否认我的“信息自由法”(Freedom Of Information Act)的请求，非常响亮地表明了谷歌与美国军事情报机构关系的另一面。中情局希望我们相信，如果这种关系公之于众，可能会严重危害国家安全，并将我们所有人的生命置于危险之中。", "note_en": "It came in response to a FOIA request I put in regarding a decade-old business transaction between the CIA and Google. Not only did the CIA deny my request, but it refused to admit or not admit that records pertaining to this transaction even existed — all in the name of national security.\n    As Pando readers might recall, I&#39;m currently writing  a book on &#34;Surveillance Valley&#34; -- how tech giants are building the biggest private surveillance network the world has ever known. In the course of investigating the book, I&#39;ve been digging deeper into Google&#39;s relationship with US military industrial complex.\n  I&#39;m trying to pinpoint as best I can the moment when Google began transitioning from being a consumer-oriented Internet search company into the hybrid military-intelligence contractor that it is today.\n  One of the first big milestones in this transformation took place in November 2004 when Google  acquired a tiny and little-known 3-D mapping startup called Keyhole Inc. Google paid an undisclosed sum for the company, immediately absorbed it, and began turning its tech into what we now know as Google Earth. The acquisition would have gone unnoticed, had it not been for one not-so-tiny detail: Keyhole Inc was part-owned by the CIA and the &#34;National Geospatial-Intelligence Agency&#34; (NGA), a sister agency to the NSA. Keyhole Inc also had one major client base: US military and intelligence agencies.\n  In-Q-Tel, a venture capital fund run by the CIA on behalf of the military and intelligence community, made a “strategic investment” in Keyhole in February 2003, a month before the US launched Operation Iraqi Freedom.\n  In a  press release announcing the investment a few months later, In-Q-Tel discussed Keyhole’s close collaboration with military and intelligence partners and explained that Keyhole technology was already being successfully deployed by active military forces in Iraq.\n  Immediately demonstrating the value of Keyhole&#39;s technology to the national security community, NIMA used the technology to support United States troops in Iraq. &#34;Within two weeks of In-Q-Tel&#39;s engagement with Keyhole, we implemented the technology to support our mission within the Pentagon,&#34; said Rob Zitz, Director of NIMA&#39;s InnoVision directorate. [NIMA is now known as NGA, the NSA&#39;s sister agency. —YL] “Introducing technologies like Keyhole is part of NIMA&#39;s effort to transform the intelligence business, and the way we serve our customers.”\n  This kind of active public boasting pretty much stopped after Google bought Keyhole. But, post-acquisition, the search giant continued selling Keyhole&#39;s underlying tech to the Pentagon and assorted US intelligence services.\n  For instance: In 2010, Google clinched a no-bid contract to supply the NGA with “geospatial visualization services.” The NGA  argued that it couldn’t open up the contract to competitors like Microsoft because it had no choice: The US government had invested so much effort and resources into Google’s mapping and geospatial technology, tailoring it to its specific needs, that the Pentagon and Intelligence Community could at this point only use Google products.\n  This was just one of many  such deals. As I’ve  reported before, Google has been aggressively expanding in the lucrative military contacting market to the point where it has sold advanced military grade data products to just about every major military and intelligence agency in America. It has clinched a near monopoly on government battlefield mapping tech, outfitted the CIA and NSA with advanced search capabilities, co-invested in spy satellites and battlefield robots with the Pentagon, partnered with  traditional military contractors like Lockheed Martin, and has increasingly  filled its executive ranks with top Pentagon officials from the U.S. Army, Air Force Intelligence, and the CIA.\n    There&#39;s just one problem: Apart from a few basic details, the public knows very little about Google&#39;s purchase of Keyhole Inc.\n    The most obvious question is: What prompted the acquisition? Did Google buy Keyhole -- and take on all its military contracts and NatSec liabilities -- because it badly needed its 3D mapping technology? Or did Google see the acquisition as a convenient way of getting into the military contracting business? Was there any internal discussion in the company about the benefits and pitfalls of absorbing a startup so closely tied with the CIA and the Pentagon?\n  Then there’s the CIA’s perspective: Given Keyhole&#39;s close collaboration with active military and intelligence operations, how did the CIA approach the deal? Why Google? Did the Agency have any concerns? Did it impose conditions on Google? Did it require Google to honor Keyhole&#39;s previous intel commitments as part of the deal? If so, what were these commitments?\n  In other words: What deal did Google -- now the biggest private surveillance operation on planet earth -- make with the CIA and the NSA, which run the largest government surveillance operations?\n  Fortunately, we have a process explicitly designed to allow the public to find out what the government is up to behind closed doors: A Freedom of Information Act request, or FOIA.\n  And so, back in May, I submitted a FOIA request to the CIA, asking for:\n  1) “… a copy of all correspondence (emails, letters, related documents and attachments) relating to Keyhole Inc. This part of the request should include all correspondence between the CIA and representatives of Keyhole Inc (e.g. John Hanke). Date range: from 1/1/2000 through 12/31/2006.”  2) “… a copy of all correspondence (emails, letters, related documents and attachments) referring to or discussing Google’s purchase of Keyhole Inc. This part of the request should include all correspondence between the CIA and representatives of Google regarding Keyhole, including Keyhole software and services. Date range: 1/1/2003 through 12/31/2014.”\n  The CIA got back to me surprisingly quickly. But instead of sending me a stack of highly redacted documents, the Agency sent me a skimpy two page response straight out of a Tom Clancy novel: it &#34;could not confirm or deny” the existence of these records. That is, the mere existence nor non-existence of any documents relating to the Agency’s involvement in the sale of Keyhole to Google is itself a secret, and cannot be divulged to the public for reasons of national security.\n    In accordance with section 3.6(a) of Executive Order 13526, the CIA can neither confirm nor deny the existence or nonexistence of records responsive to your request. The fact of the existence or nonexistence of requested records is currently and properly classified and is intelligence sources and methods information that is protected from disclosure by section 6 of the CIA Act of 1949, as amended, and section 102A(i)(l) of the National Security Act of 1947, as amended. Therefore, your request is denied pursuant to FOIA exemptions (b)(1) and (b)(3).\n  The CIA information officer was kind enough to include definitions of the relevant FOIA exemptions. They stated that…\n  (b)(1) exempts from disclosure information currently and properly classified, pursuant to an Executive Order…\n  (b)(3) exempts from disclosure information that another federal statute protects, provided that the other federal statute either requires that the matters be withheld, or establishes particular criteria for withholding or refers to particular types of matters to be withheld. The (b)(3) statutes upon which the CIA relies include, but are not limited to, the CIA Act of 1949…\n  The letter did not explain why these two in particular — (b)(1) and (b)(3) — were relevant to the decision to withhold the requested information.\n  Luckily, the Reporters Committee for Freedom of the Press (RCFP) gives  a rundown of the meaning and intended use of these exemptions in a handy guide. It explains that (b)(1) can be used to restrict access to the documents only if “the unauthorized disclosure of the information reasonably could be expected to result in damage to the national security.” Some of the information that currently falls under this provision includes: military plans and weapons systems; intelligence activities and methods; technology that impacts national security; and vulnerabilities and capabilities of systems relating to national security.\n  Put simply: (b)(1) exempts active military and intelligence operations, or information that can affect these operations.\n  The second exemption (b)(3) is equally broad. RCFP explains that it allows the CIA to deny record requests that are exempted from disclosure by laws that are beyond FOIA. In this case, the CIA wrote to me that there are at least two -- and possibly more -- statues that exempt the documents from disclosure. One of them is the CIA Act of 1949 — which basically gave the Agency the power to act in ultimate secrecy and exempted it from just about every normal government requirement. In essence, the CIA’s (b)(3) is what&#39;s known as a GLOMAR response, named after the agency&#39;s refusal, in the mid-1970s, to confirm or deny the existence of  a secret boat called the Glomar Explorer built to retrieve a sunken Soviet nuclear submarine.\n  So why is the CIA invoking state secrets and national security arguments when asked to divulge a decade-old conversation regarding Google’s acquisition of a small CIA investment? What is it about Keyhole and Google’s relationship with the CIA that is so sensitive and so vital to the military objectives of the United States that the mere admission of existence of these records poses a grave threat to national security?\n  For now those questions remain unanswered, but hopefully not for long. I&#39;ve filed an appeal to the FOIA denial and will update this story when I hear the result.\n  The irony, of course, is that Google has always boasted about standing up to the national security state. After Edward Snowden, it funded privacy think tanks,  backed anti-NSA protests, made a big show of opposing secret wiretaps, fought secret court orders, and has done everything it can convince the public that it really really cares about privacy and cyber-democracy and  is on our side in the fight against today&#39;s creeping military-surveillance society.\n  As recently as last month, the search giant insisted that it had fought the Department of Justice to allow Google to warn Wikileaks activist Jacob Appelbaum of government attempts to access his Gmail records, for which Appelbaum and other privacy activists, including the ACLU&#39;s Christopher Soghoian, lavished heavy praise on Google...\n  I feel like I should send flowers to Google&#39;s legal team. They must have spent hundreds of thousands of dollars on this case alone.\n\r— Jacob Appelbaum (@ioerror)  June 19, 2015\n    Sad irony: Twitter never went to court to unseal Wikileaks order. Worldwide praise. Google fought in court, spent big bucks, no one knows.\n\r— Christopher Soghoian (@csoghoian)  June 22, 2015\n    Which prompted Wikileaks to point out that, when it comes to sharing data with the government, Google is in fact way worse than Twitter...\n  @csoghoian Google handed over more data, because its business model is based on collecting that data and mining it.\n\r— WikiLeaks (@wikileaks)  June 23, 2015\n   For all of Google&#39;s posturing as the scourge of governement surveillance, the CIA’s blanket GLOMAR denial of my Freedom of Information Act request speaks very loudly to a different side of Google’s relationship with US military intelligence agencies. A relationship that the CIA wants us to believe that, should it become public, could seriously harm national security and put all of our lives at risk.", "posttime": "2020-10-20 15:41:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,初创,helped", "title": "中情局帮助将一家地图初创公司出售给谷歌(2015)", "title_en": "The CIA helped sell a mapping startup to Google (2015)", "transed": 1, "url": "https://pando.com/2015/07/01/cia-foia-google-keyhole/", "via": "", "real_tags": ["谷歌", "google", "初创", "helped"]}, {"category": "", "categoryclass": "", "imagename": "ec0c4947ad7c968339ab8b93389e0707.png", "infoid": 1029977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大卫·B·史密斯(David B.Smith)是美国民事资产没收方面的顶尖专家。他协助国会起草资产没收法律，并撰写了一篇关于这一主题的法律论文。\n这位弗吉尼亚州的律师在一次采访中说，“民事没收问题的根源是将销售收益专门用于执法。一旦警察习惯了，他们就上瘾了，不得不拥有它。“。史密斯说，大衰退加深了执法对资产没收的依赖，因为警察预算被削减了。\n“公平分享计划成为联邦政府深陷困境的资产没收计划中最明显的问题之子，”他说。“随着当地警察和警长部门的预算越来越依赖公平分享资金，公然非法扣押的案件不断增加。许多只不过是对驾车者(通常是少数族裔成员)进行的几乎不加掩饰的高速公路抢劫案。\n司法部监察长2017年的一项审计批评了联邦监管缺乏保障措施，并表示司法部没有追踪缴获的物品是否有助于毒品刑事调查。\nIG表示，该部门未能开发出一种方法来“全面评估和监督他们的扣押行动，或确定扣押是否有利于刑事调查，或它们对公民自由构成潜在风险的程度”…。如果与刑事调查无关的扣押是在没有法院签发的逮捕令、没有非法毒品的存在或随后的司法介入的情况下进行的，对公民自由的风险尤其重大……“。\n警察会监视州外车牌的可疑车辆，并对轻微的交通违法行为进行拦截，比如在没有闪光灯的情况下改变车道，或者触摸道路边缘的雾线，甚至如果警察发现有可疑故事或举止的乘员，他们会要求对车辆进行搜查。如果他们发现大量现金和其他可疑情况，他们会没收与毒品有关的现金，将其送往联邦政府没收，拿回80%用于购买新设备、电脑、牢房、枪支和弹药。\n与此同时，嫌疑人通常在没有提出刑事指控或缴获毒品的情况下走上街头。如果公民试图拿回这笔钱，他们就会面临障碍。他们没有资格获得一名免费律师，也不容易找到一名有能力处理这类案件的律师。由于技术原因，许多收回资金的尝试都被拒绝了。\n通过联邦公平分享计划发送扣押的财产，官员们不必满足密苏里州等州法律要求的高标准证据。\n密苏里州的法律似乎要求对没收财产进行刑事定罪。但走联邦路线的警察可以扣押现金，释放嫌疑人，并保留这笔钱，只要有优势的证据表明它与犯罪有关。这意味着超过50%的证据，远远低于排除合理怀疑的门槛。\n一个人乘坐租车旅行，带着大量的钱，看起来很紧张，没有说实话，警方认为他符合证据标准的优势，尽管没有足够的证据提出刑事指控，更不用说定罪了。\n执法机构和特朗普政府坚决捍卫民事资产没收的重要性。他们说，这在削弱贩毒集团，警惕恐怖分子，以及为资金紧张的警察和治安部门提供资金方面发挥了重要作用，否则他们将驾驶破旧的警车，购买自己的枪支和枪套。\n凯恩县警长罗恩·海恩(Ron Hain)是伊利诺伊州没收民事资产以满足警方需求的一位直言不讳的捍卫者。2010年，他用笔名查尔斯·海恩斯(Charles Haines)写了一本关于沙漠雪的自费出版的书：“入侵：美国禁毒战争的有效解决方案。”它的主角是密苏里州菲尔普斯县的一名未透露姓名的“西西里”副手，以及拱门对面伊利诺伊州一个村庄的另一名匿名警官，并将他们庆祝为拦截努力中的英雄。\n“堪萨斯公路巡逻队发现的每一个肮脏的案件，可能有10个或更多我们从未听说过的干净案件，”史密斯说，他曾在该州处理过几起民事资产没收案件。“每一宗实际扣押现金的案件，可能会有10到20人被拦截。”\n在这本书中，海恩呼吁“将我们的警察部队变成今天的罗宾汉”，并扩大高速公路的封锁范围。他写道：“我们所有的家乡都坐在一个免税的金矿上。”\n法律专家和批评家史密斯承认，在高速公路上查获的大部分现金都是从与毒品活动有关的人手中拿走的。但他说，许多驾车者最初停了下来，因为可疑的人是无辜的。史密斯说，那些基于轻微交通违法的不正当停车的受害者是不计在内的、没有脸的受害者。\n“堪萨斯公路巡逻队发现的每一个肮脏的案件，可能有10个或更多我们从未听说过的干净案件，”史密斯说，他曾在该州处理过几起民事资产没收案件。“每一宗实际扣押现金的案件，可能会有10到20人被拦截。”\n由沙漠雪执法老兵组成的小组训练警察进行高速公路拦截，他们的徽章上有一个身穿盔甲的黑色骑士骑在马背上，手持带有十字架的盾牌。对于一种可以追溯到中世纪及之前的法律工具来说，这是一个合适的象征。\n史密斯将没收资产追溯到“圣经”中的一句话：“如果牛咬伤了人，牛就会被杀。”在中世纪，甚至有对引起瘟疫的昆虫的试验。后来，在大英帝国的鼎盛时期和美国的诞生期间，海军不得不在公海上防御海盗，把船只当作罪犯对待并扣押比关押海盗更有效。\n今天，法律小说的运作方式是将财产而不是人指定为罪犯。这就有理由没收财产，即使所有者是无辜的。\n1996年，美国最高法院接受了将财产视为违法者的古老概念。这起案件涉及一位名叫蒂娜·班尼斯(Tina Bennis)的女子，她的丈夫约翰(John)被底特律警方抓到在家里的车里与一名妓女发生性关系。当局宣布这辆车为妨害公物，并将其没收。蒂娜·班尼斯(Tina Bennis)对她丈夫的越轨行为一无所知，她声称自己不应该失去一半的车。最高法院不同意，5比4。\n首席大法官威廉·H·伦奎斯特(William H.Rehnquist)根据19世纪早期涉及巴尔米拉号(Palmyra)的先例做出了这一决定。巴尔米拉号是西班牙国王委托作为私人船只袭击美国船只的一艘船。19世纪的一家法院裁定“这件事在这里被认为是违法者。”即使船主是无辜的，这艘船也会被扣押。同样，密歇根州可以没收班尼斯家的汽车，尽管蒂娜·班尼斯并不知道她丈夫非法使用汽车欺骗她。\n最高法院中一些最保守的法官对法院接受财产是罪犯并可以从无辜所有者手中没收这一虚构事实表示疑虑。\n大法官克拉伦斯·托马斯(Clarence Thomas)在2017年写道，最高法院“不应容忍...。这是殖民时代的“严酷和不公平的历史做法”。\n他写道：“这些没收行动经常针对穷人和其他最不能捍卫自己利益的群体。”“反常的是，这些同样的群体往往是被没收的负担最重的。他们更倾向于使用现金，而不是信用卡等替代支付方式。“\n去年年底，最高法院受理了印第安纳州的一起案件，在那里，最高法院似乎准备要求各州遵守第八修正案关于禁止在资产没收案件中处以“过高罚款”的规定。\n泰森·蒂姆斯用他父亲的人寿保险单上的钱买了一辆42,000美元的路虎。他两次在贩卖少量海洛因时开车。售卖海洛英的最高罚款为一万元。蒂姆斯声称，要求他放弃这辆4.2万美元的汽车将是一笔过高的罚款，而罚款只是这个金额的一小部分。\n他写道：“这些没收行动经常针对穷人和其他最不能捍卫自己利益的群体。”“反常的是，这些同样的群体往往是被没收的负担最重的。他们更倾向于使用现金，而不是信用卡等替代支付方式。“。\n印第安纳州最高法院声称，第8修正案中的过度罚款条款从未被纳入针对各州的规定-换言之，各州不必遵守该条款。大法官尼尔·戈尔萨奇在口头辩论中嘲笑了这一观点，他说：“在2018年，我们仍然在对”人权法案“的合并提起诉讼。真的？来吧“。\n这一评论和其他人明确表示，法院将承认不受州和地方政府施加的过高罚款的权利。目前尚不清楚的是，这一权利将有多广泛，以及它是否会保护蒂姆斯的路虎(Land Rover)。\n来自最高法院自由派的法官索尼娅·索托马约尔(Sonia Sotomayor)似乎已经准备好走那么远了。“如果我们看看今天发生的这些没收，”她说，“其中许多似乎与被指控的罪行严重不相称。”\n两个保守的价值观推动了对民事资产没收改革的支持：认为法律应该保护私人财产不受政府越权的影响，以及联邦主义者认为司法部对民事资产没收的主导地位通过使州没收法律改革的有效性无效而粗暴地凌驾于联邦主义之上。\n1984年，在反犯罪、反毒品时代的鼎盛时期，在两党的支持下通过了一项专门用于执法的民事资产没收资金的法律。\n一位对通过这项法律有影响力的参议员是一位名叫乔·拜登(Joe Biden)的年轻民主党人，他是司法委员会的成员。\n国会的主要成员开始有所保留。来自伊利诺伊州的已故保守派众议员亨利·海德(Henry Hyde)后来表示，这种做法“让警方将整个美国视为一些大型的全国性K-Mart，那里的价格不仅更低，而且根本不存在--一种执法部门的挑剔--不付钱。”没收应该是打击犯罪的武器，而不是执法的赚钱机器。“。\n海德和他的盟友在2000年通过了改革立法，但这并没有阻止当地执法部门没收民用资产没收的最大份额。\n今天，肯塔基州共和党参议员兰德·保罗(Rand Paul)等自由意志主义保守派人士领导着改革努力。司法委员会主席、爱荷华州保守派共和党参议员查尔斯·格拉斯利(Charles Grassley)也发起了改革立法。\n2014年，格拉斯利在改革民事资产没收方面做出了重大努力，但民主党人没有出席听证会。史密斯和参与改革的国会助手说，加州民主党参议员黛安·范斯坦(Dianne Feinstein)等亲执法的民主党人没有努力通过这项法律。\n奥巴马司法部长埃里克·霍尔德(Eric Holder)在2015年改革了联邦公平分享计划，在许多情况下，要求联邦政府在收养没收财产之前提出刑事指控或发出逮捕令。\n但在特朗普总统当选后，改革的机会蒸发了。前司法部长杰夫·塞申斯推翻了霍尔德的说法。他说：“我们的执法伙伴会告诉你，正如特朗普总统很清楚的那样，资产没收是帮助执法部门为有组织犯罪撤资、收回非法所得并防止新的犯罪发生的关键工具，它削弱了犯罪分子和卡特尔的力量。”他说，“我们的执法伙伴会告诉你，特朗普总统很清楚，资产没收是帮助执法部门为有组织犯罪提供资金，收回非法所得，防止新的犯罪发生的关键工具。”\n据美国德克萨斯论坛报(The Texas Tribune)报道，2017年，一名德克萨斯州警长在白宫会议上向特朗普抱怨称，德克萨斯州一位未具名的州参议员希望要求定罪，然后才能没收资金，这突显了他的政府对民事资产改革的反对。\n警长哈罗德·伊文森(Harold Evenson)说，他已经告诉这位参议员，如果资产没收法案获得通过，“卡特尔将在墨西哥为他建造一座纪念碑”。\n“州参议员是谁？”特朗普予以回击。“想说出他的名字吗？”我们会毁了他的事业。“。\n威廉·弗莱弗格尔是南伊利诺伊大学卡本代尔分校的新闻学教授。他也是一名律师。南伊利诺伊大学卡本代尔大学的一个学生多媒体团队--霍莉·皮彭伯格、布莱恩·穆尼奥斯和艾比·拉图尔--协助报道和说明了这个项目。", "note_en": "David B. Smith is the nation’s leading expert on civil asset forfeiture. He assisted Congress in drafting asset-forfeiture laws and has written a legal treatise on the topic.\n The Virginia lawyer said in an interview that the root of the “problem with civil forfeiture is the earmarking of the sale proceeds for law enforcement. Once police got used to it, they became addicted to it and had to have it.” The Great Recession deepened the dependence of law enforcement on asset forfeiture, because police budgets were cut, Smith said.\n “The Equitable Sharing Program became the clearest problem child of the federal government’s deeply troubled asset-forfeiture program,” he said. “As local police and sheriffs’ department budgets grew increasingly dependent on equitable sharing money, blatantly illegal seizures mounted. Many were nothing more than thinly disguised highway robberies of motorists, usually minority group members.”\n A 2017 audit by the Justice Department’s Inspector General criticized the lack of safeguards in federal oversight and said the department wasn’t keeping track of whether the seizures were helping criminal drug investigations.\n The IG said the department had failed to develop a method to “evaluate fully and oversee their seizure operations, or to determine whether seizures benefit criminal investigations or the extent to which they pose potential risks to civil liberties … the risks to civil liberties are particularly significant when seizures that do not relate to a criminal investigation are conducted without a court-issued warrant, the presence of illicit narcotics, or subsequent judicial involvement ...”\n  Police watch for suspicious cars with out-of-state license plates and stop them for minor traffic violations, such as changing lanes without a blinker or touching the fog line on the edge of the road. If police find occupants with suspicious stories or mannerisms, they ask to search the vehicle. If they find large amounts of cash and other suspicious circumstances, they seize the cash as drug-related, send it along to the federal government for forfeiture, getting back 80 percent to buy new equipment, computers, jail cells, guns and ammunition.\n Meanwhile, the suspect usually goes down the road with no criminal charges filed or drugs seized. If citizens try to get the money back, they face obstacles. They are not entitled to a free lawyer, nor is it easy to find a lawyer equipped to handle such cases. Many attempts to get funds back are rejected for technical reasons.\n By sending property seized through the federal Equitable Sharing Program, officers don’t have to meet the high standard of proof required by state laws such as Missouri’s.\n Missouri law appears to require a criminal conviction for a forfeiture. But officers going the federal route can seize the cash, release the suspect and keep the money as long as there is a preponderance of the evidence that it is related to a crime. That means more than 50 percent of the evidence, a far lower bar than beyond a reasonable doubt.\n A person traveling in rental car with a large amount of money who seems nervous and isn’t telling a straight story is viewed by police as meeting the preponderance of the evidence standard, even though there isn’t enough evidence to file a criminal charge, much less obtain a conviction.\n  Law-enforcement agencies and the Trump administration stoutly defend the importance of civil asset forfeiture. They say it plays an important role in weakening drug cartels, watching out for terrorists and funding cash-strapped police and sheriff’s departments that would otherwise be driving old, worn-out police cars and buying their own guns and holsters.\n One vocal defender of civil asset forfeiture to fund police needs in Illinois is Kane County Sheriff Ron Hain. In 2010, he wrote a self-published book on Desert Snow, under the pseudonym Charles Haines: “Inroads: A Working Solution to America’s War on Drugs.” It featured an unnamed “Sicilian” deputy in Phelps County, Missouri, and another anonymous officer in an Illinois village across from the Arch and celebrated them as heroes in the interdiction effort.\n “For every dirty case that the Kansas Highway Patrol turns up, there may be 10 or more clean cases we don’t ever hear about,&#34; said Smith, who handled several civil asset-forfeiture cases in that state. “Ten or 20 people may be stopped for every case they actually seize cash.”\n In the book, Hain called for “turning our police forces into present-day Robin Hoods,” with expanded highway interdiction. “All of our hometowns are sitting on a tax-liberating gold mine,” he wrote.\n Smith, the legal expert and critic, acknowledged that much of the cash seized along the highway is taken from people connected with drug activity. But he said many of the motorists initially stopped as suspicious are innocent. The victims of those unjustified stops based on minor traffic violations are uncounted and faceless victims, Smith said.\n “For every dirty case that the Kansas Highway Patrol turns up, there may be 10 or more clean cases we don’t ever hear about,&#34; said Smith, who handled several civil asset-forfeiture cases in that state. “Ten or 20 people may be stopped for every case they actually seize cash.”\n  The Desert Snow group of law-enforcement veterans who train officers for highway interdictions has an insignia with a black knight in armor on horseback carrying a shield with a cross. It’s an appropriate symbol for a legal tool that goes back to medieval times and before.\n Smith traces asset forfeiture to the Biblical saying, “If an ox gore a man, the ox shall be killed.” In the Middle Ages, there were even trials of insects that had caused plagues. Later, during the height of the British Empire, and the birth of the United States, navies had to defend against pirates on the high seas; treating the ships as the criminals and seizing them was more effective than locking up pirates.\n Today, the way the legal fiction works is to designate the property, not the person, as the criminal. That justifies seizing the property even when the owner is innocent.\n In 1996, the  U.S. Supreme Court embraced the ancient notion of property as the offender. The case involved a woman named Tina Bennis, whose husband, John, had been caught by the Detroit police having sex with a prostitute in the family car. The authorities declared the car to be a public nuisance and seized it. Tina Bennis, who knew nothing of her husband’s escapades, claimed she shouldn’t lose her half of the car. The Supreme Court disagreed, 5-4.\n Chief Justice William H. Rehnquist based the decision on an early 19th-century precedent involving the Palmyra, a ship commissioned as a privateer by the King of Spain to attack U.S. vessels. A 19th-century court ruled “the thing is here considered as the offender.” The ship would be seized even if the owner was innocent of the privateering. In the same way, Michigan could seize the Bennis family auto even though Tina Bennis didn’t know about her husband’s illegal use to cheat on her.\n  Some of the most conservative justices on the Supreme Court have expressed misgivings about the court’s acceptance of the fiction that the property is the criminal and can be seized from an innocent owner.\n Justice Clarence Thomas wrote in 2017 that the court “should not tolerate ... harsh and unfair historical practice” from the colonial era.\n “These forfeiture operations frequently target the poor and other groups least able to defend their interests,” he wrote. “Perversely, these same groups are often the most burdened by forfeiture. They are more likely to use cash than alternate forms of payment, like credit cards.”\n Late last year, the Supreme Court took up a case from Indiana where it appears ready to require states to abide by the 8th Amendment’s prohibition of “excessive fines” in asset-forfeiture cases.\n Tyson Timbs had bought a $42,000 Land Rover with money from his father’s life-insurance policy. Twice he drove the car when selling a small amount of heroin. The maximum fine for the heroin sales was $10,000. Timbs claimed it would be an excessive fine to require him to give up the $42,000 car when the fine would be a fraction of that amount.\n “These forfeiture operations frequently target the poor and other groups least able to defend their interests,” he wrote. “Perversely, these same groups are often the most burdened by forfeiture. They are more likely to use cash than alternate forms of payment, like credit cards.”\n Indiana’s Supreme Court claimed the excessive fines clause of the 8th Amendment has never been incorporated against the states — in other words that the states don’t have to abide by it. Justice Neil Gorsuch ridiculed that view saying during oral argument, “Here we are in 2018 still litigating incorporation of the Bill of Rights. Really? Come on.”\n That comment and others made it clear the court will recognize the right to be free of excessive fines imposed by state and local government. What is not clear is how broad that right will be, and whether it will protect Timbs’ Land Rover.\n Justice Sonia Sotomayor, from the court’s liberal wing, seemed ready to go that far. “If we look at these forfeitures that are occurring today,” she said, “many of them seem grossly disproportionate to the crimes being charged.”\n  Two conservative values drive the support of civil asset-forfeiture reform: the belief that law should protect private property from government overreach, and the federalist belief that the Justice Department’s dominance of civil asset forfeiture runs roughshod over federalism by nullifying the effectiveness of state forfeiture-law reforms.\n The law that earmarked civil asset-forfeiture funds for law enforcement passed with bipartisan support in 1984 during the height of the anti-crime, anti-drug era.\n One senator influential in passing the law was a young Democrat named Joe Biden, who sat on the Judiciary Committee.\n Leading members of Congress came to have reservations. The late Rep. Henry Hyde, a rock-ribbed conservative from Illinois, said later that the practice “has allowed police to view all of America as some giant national K-Mart, where prices are not just lower but nonexistent — a sort of law-enforcement pick-’n-don’t-pay. Forfeiture should be a crime-fighting weapon, not a money-making machine for law enforcement.”\n Hyde and his allies passed reform legislation in 2000, but it hasn’t stopped local law enforcement from capturing the lion’s share of proceeds from civil asset forfeiture.\n Today, libertarian conservatives such as Sen. Rand Paul, R-Kentucky, lead the reform effort. Sen. Charles Grassley, the conservative Iowa Republican who chaired the Judiciary Committee, also sponsored reform legislation.\n In 2014, Grassley made a major effort to reform civil asset forfeiture, but Democrats didn’t show up for the hearings. Pro-law-enforcement Democrats such as Sen. Dianne Feinstein, D-California, made no effort to pass the law, said Smith and congressional aides who worked on the reform.\n  Obama Attorney General Eric Holder reformed the Federal Equitable sharing program in 2015 to require criminal charges or warrants before federal adoptions of forfeited property in many cases.\n But after President Trump’s election, chances for reform evaporated. Former Attorney General Jeff Sessions reversed Holder. He said, “Our law-enforcement partners will tell you, and, as President Trump knows well, asset forfeitures is a key tool that helps law enforcement defund organized crime, take back ill-gotten gains and prevent new crimes from being committed, and it weakens the criminals and the cartels.”\n Trump underlined his administration’s opposition to civil asset reform when a Texas sheriff complained to him at a White House meeting in 2017 that an unnamed state senator in Texas wanted to require a conviction before money could be forfeited, according to a  Texas Tribune report.\n Sheriff Harold Eavenson said he had told the senator that “the cartels would build a monument to him in Mexico” if the asset-forfeiture bill passed.\n “Who’s the state senator?” Trump shot back. “Want to give his name? We’ll destroy his career.”\n William Freivogel is a journalism professor at the Southern Illinois University Carbondale. He is also an attorney. A student multimedia team from Southern Illinois University Carbondale - Holly Piepenburg, Brian Munoz and Abbey LaTour - assisted in reporting and illustrating the project.", "posttime": "2020-10-20 15:41:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "crime,没收", "title": "没有毒品，没有犯罪和学校的便士：警察如何使用民事资产没收", "title_en": "No Drugs, No Crime and Pennies for School: How Police Use Civil Asset Forfeiture", "transed": 1, "url": "https://pulitzercenter.org/reporting/no-drugs-no-crime-and-just-pennies-school-how-police-use-civil-asset-forfeiture", "via": "", "real_tags": ["crime", "没收"]}, {"category": "", "categoryclass": "", "imagename": "06c6d423cc9ec3392a24dbc90757027b.png", "infoid": 1029975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，“纽约邮报”(New York Post)公布了他们所称的涉及民主党候选人乔·拜登(Joe Biden)麻烦缠身的儿子亨特·拜登(Hunter Biden)的腐败证据。\n这部“大片”的出处颇具争议。据报道，特拉华州的一家电脑修理店抢走了小拜登的一台笔记本电脑。据“华盛顿邮报”报道，它含有…", "note_en": "On Wednesday, the   New York Post  released what they claimed was “smoking gun” evidence of corruption involving Hunter Biden, troubled son of Democratic nominee Joe Biden.\n The “blockbuster” had a controversial provenance. A computer repair shop in Delaware reportedly came to possess a laptop belonging to the younger Biden. According to the  Post, it contain…", "posttime": "2020-10-20 15:22:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,twitter,biden", "title": "Facebook和Twitter的干预突显了危险的新双重标准", "title_en": "Facebook and Twitter's Intervention Highlights Dangerous New Double Standard", "transed": 1, "url": "https://taibbi.substack.com/p/facebook-and-twitters-intervention", "via": "", "real_tags": ["facebook", "twitter", "biden"]}, {"category": "", "categoryclass": "", "imagename": "7958aef17699cdef006401c863a63228.png", "infoid": 1029974, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "个人网站通常就像书架上的旧书。它们会萎靡不振，积聚灰尘，随着时间的推移，它们的皱纹和裂缝会变得更加明显。大约3年前，我开始了一个简单的实验，最终以异常大的幅度延长了我网站的保质期。\n早在2017年，对话式UI似乎就准备接管世界。我们看到Quartz将新闻变成了对话，微信被描绘成后应用世界的典范，iMessage变成了不必要的复杂混乱，聊天机器人像蘑菇一样在潮湿的森林中涌现。\n当然，任何获得如此多吸引力和兴趣的趋势都需要认真对待。因此，我决定熟悉这个话题，并把我的网站变成了一个聊天机器人。\n没有每个设计师在职业生涯的某个时候都会用到的国际标准化的问候语，而是没有醒目的、明显超大的、深黑色的无衬线文字：嗨，我是一名设计师。(公平地说，我也没有使用Proxima Nova)。\n取而代之的是，几个聊天气泡热情洋溢地出现在画布上，向用户问候，就好像我们都是老朋友一样。\n这是机智的，新鲜的，有点笨拙的。人们会发送各种各样的信息，从简单的闲聊，到深刻的哲学话题，再到彻头彻尾的令人不安和荒谬的侮辱。\n这项实验出现在黑客新闻上，丹·艾瑞里的团队进行的心理学研究使用了Medium，各种初创公司都对源代码进行了翻录和编辑，以满足他们的需求。旧金山湾区的一家企业有了一个想法，可以用它来以对话的方式出售鲜花。看起来他们已经关门大吉了。\n至少可以说，他们的反应和反馈是令人惊讶的。这是一个如此简单、如此愚蠢的想法，以至于结果在很多方面都是出乎意料的。毕竟，唯一真正关心你的网站的人，通常是你自己。\n这并没有阻止我修改我的网站，扼杀了之前让它成为小名人的那个东西。随着我的旧聊天机器人的死亡，一些学校将其作为“创意”网页设计的参考，以及此后很长一段时间的愤怒电子邮件，我想退一步澄清事实。\n所以，让我们坦诚片刻：你什么时候真正享受过与聊天机器人交谈的乐趣？我说的不是你无聊时会和哪类机器人聊天，而是那些能提供更深层次目标的机器人。\n事实证明，答案是，至少对我们大多数人来说，几乎永远不会。\n我爱你的对讲机，除了我不爱的时候。99%的时间我都不想和一个愚蠢而引人注目的化身在屏幕的某个角落突然出现，甚至在我有机会查看发生了什么之前。不知何故，我情不自禁地认为其他人也有同样的感受。\n事实上，我们确实知道其他人也有同样的感受。不假思索地向我们扑来的聊天头，是臭名昭著的售货员的典型代表，他一进商店就急切地与我们交谈。\n进一步增加挑战的是：一旦用户偏离了脚本，聊天机器人不仅会变得笨拙和不可预测-它们会变成小的反社会的人，可能会激怒用户。\n你创建聊天机器人的那一刻，就是你允许客户与你的品牌对话的那一刻。不是和你自己，不是和你的朋友，而是一个超级实体-一个象征-代表你和你的团队所代表的一切。这不是轻而易举的一步。\n这个简单的对话实体可以是一个有趣的与人互动的工具，但根据对话的进行方式，它可能很快就会变成对您的团队和公司价值观的歪曲。因此，构建聊天机器人永远不应该是默认的选择，而应该是有意的选择。\n这就是为什么在冒险进入这个领域之前，有必要问自己以下三个问题：\n对话是非常复杂的，在现实世界中保持它的正轨是很有挑战性的。如果用例不简单，聊天机器人很可能不是适合这项工作的工具。\n机器人有两种类型：一种是预编脚本的机器人，用户可以从中选择一系列默认答案；另一种是基于自然语言处理的机器人。\n选择合适的是很难的。虽然预先编写的脚本可能感觉太过有限，但NLP可能在每个角落都会中断。通常情况下，团队很快就会落入陷阱，把大量的时间花在个性和愚蠢的笑话上，而不是解决用户最初雇你来解决的问题。\n因此，在上面第一点的基础上，在对话场景中，简单总是胜出。\n聊天机器人在用户已经在的地方工作得最好。如果你的用户主要把时间花在可以无缝嵌入机器人和微应用的消息传递平台上，那就太棒了。这可以作为一种有效而自然的方式与你的受众互动，因为它符合“用户已经在的地方”的原则。\n另一方面，如果人们来到你的网站，这是一种以非线性和快速的方式提供内容的媒体，它已经取得了长足的进步，这往往会不必要地减慢用户的速度。\n我不想诋毁聊天机器人作为一种范例。它们在某些行业、中等行业中有其用途，并且对于特定的用例集很好地工作。重要的是要深思熟虑，而不是蒙着眼睛跳船。\n因此，虽然将我的网站变成聊天是一次有趣的实验，但我最终觉得它已经慢慢变成了一种时尚。我被这股潮流愚弄了，作为一种副产品，我成了这股潮流本身的一部分。时尚来来去去，随着它们被提炼和重新诠释，它们最终找到了真正的目的。留给我们的是古老的洞察力，只有通过实验，我们才能解开持久的概念和想法。", "note_en": "Personal websites are usually like old books in a shelf. They languish, accumulate dust, and their wrinkles and cracks become more apparent over time. About 3 years ago I embarked on a simple experiment that would end up prolonging the shelf-life of my website by an unusually large margin.\n Back in 2017, it seemed like Conversational UI was poised to take over the world. We saw Quartz turning news into a conversation, WeChat being featured as the poster-child of a post application world, iMessage turning into an unnecessarily complex mess, and chatbots popping up like mushrooms in moist forests.\n Of course, any trend gaining so much traction and interest needs to be taken seriously. As such, I decided to familiarize myself with the topic, and turned my website into a chatbot.\n Instead of being greeted by the internationally standardized greeting every designer used at some point in their career, there was no bold, dramatically oversized, and deep black sans-serif reading:  Hi, I’m a designer. (To be fair, I didn’t use Proxima Nova either)\n Instead, a couple of chat bubbles exuberantly ushered onto the canvas to greet users as if we had all been long time friends.\n  It was witty, new, and slightly awkward. People would send messages that ranged from simple chit chat, to deep philosophical topics, to downright disturbing and ridiculous insults.\n The experiment got featured on Hackernews, Medium, was used in psychological studies conducted by Dan Ariely’s team, and the source code was ripped and edited by various startups to fit their needs. One business in the Bay Area had an idea to use it to sell flowers in a conversational way. It looks like they went out of business.\n The reaction and feedback was surprising to say the least. It was an idea so simple, so silly, that the outcome was in many ways unexpected. After all, the only one who really cares about your website, is usually yourself.\n That didn’t stop me from revamping my website and kill the very thing that had turned it into a micro-celebrity before. With the death of my old chatbot, some angry emails by schools who are using it as a reference for “creative” web design, and a good amount of time that has passed ever since, I wanted to take a step back and set the record straight.\n   So let’s be honest with ourselves for a moment:  when did you actually ever enjoy talking to a chat bot? And I’m not talking about the type of bots you talk to when you’re bored, but about those that provide a deeper purpose.\n It turns out that the answer is, at least for most of us, almost never.\n I love you Intercom, except when I don’t. 99% of time I don’t want to talk to a silly and obtrusive avatar popping up from some corner of the screen before I even had a chance to check out what’s going on. Somehow, I can’t help but think others feel the same.\n In fact, we do know that others feel the same. Chat heads jumping at us unasked, are the quintessential equivalent of the infamous sales clerk who eagerly talks to us upon entering a store.\n To further add to the challenges: as soon as users go off-script, chat bot’s don’t just become awkward and unpredictable—they turn into little sociopaths that might rub users the wrong way.\n  The moment you create a chat bot is the moment you allow customers to have a conversation with  your brand. Not with yourself, not with your friend, but with an uber entity—a symbol—that represents everything you and your team stand for. That’s not a step to be taken lightly.\n This simple conversational entity can be a fun tool to engage with people but depending on how the conversation goes, it can quickly turn into a misrepresentation of the values of your team and your company. So building a chat bot should never be the default choice, but an intentional one.\n That’s why it’s worth asking yourself the following three questions before venturing into this space:\n  Conversation is incredibly complex and it’s challenging enough to keep it on track in the real world. If the use case isn’t simple, chances are, chat bots are not the right tool for the job.\n  There are two types of bots: pre-scripted bots with a range of default answers users can choose from, and Natural Language Processing based ones.\n Choosing the right one is hard. While pre-scripted can feel too limiting, NLP can break at every corner. Often times, teams quickly fall into the trap of spending a huge amount of time focusing on personality and silly jokes, instead of solving the problem users hired you for in the first place.\n Therefore, building on top of the first point above, within the conversational landscape, simple always wins.\n  Chat bots work best where users already are. If your users are primarily spending time in messaging platforms where bots and micro-apps can be seamlessly embedded, great. That can serve as an effective and natural way to engage with your audience because it matches the “be where users already are” principle.\n If on the other hand, people come to your website, a medium that has made great strides to provide content in a non-linear and quick way, it often unnecessarily slows users down.\n   I don’t want to discredit chat bots as a paradigm. They have their use in certain industries, medium, and work well for a specific set of use cases. The important part is being deliberate, rather than jumping ship blindfolded.\n So whereas turning my website into a chat was a fun experiment, I ultimately feel like it has slowly turned into a fad. I got fooled by the trend, and as a by-product became part of the trend itself. Fads come and go, and as they get refined and re-interpreted, they ultimately find their true purpose. What we’re left with is the age old insight that it’s only through experimentation, that we can unlock concepts and ideas that last.", "posttime": "2020-10-20 15:22:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,chatbot,聊天", "title": "我的聊天机器人死了-为什么你的也应该死", "title_en": "My chatbot is dead – Why yours should probably be too", "transed": 1, "url": "https://azumbrunnen.me/blog/my-chatbot-is-dead-%C2%B7-why-yours-should-probably-be-too/", "via": "", "real_tags": ["机器人", "chatbot", "聊天"]}, {"category": "", "categoryclass": "", "imagename": "f4e4f7f7b42390ecaad8e1da6aee43c3.jpg", "infoid": 1029972, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年，英国的假日季节将不会那么耀眼。\n三大零售商-食品杂货连锁店莫里森(Morrisons)和韦特罗斯(Waitrose)以及百货商店公司约翰·刘易斯(John Lewis)-已经宣布，他们今年将不会在自有品牌的一次性圣诞产品中使用闪光剂。这意味着圣诞卡上没有闪闪发光的雪花，贴纸上没有闪闪发光的雪人，包装纸上也没有闪烁的星星。\n莫里森在一份声明中说：“闪光是由微小的塑料颗粒制成的，如果它分散在陆地、河流和海洋上，就会对生态造成危害--在这些地方需要数百年的时间才能降解。”\n在美国，似乎没有类似的闪光清算正在进行。包括沃尔玛(Walmart)、塔吉特(Target)、沃尔格林(Walgreens)、CVS和好市多(Costco)在内的主要零售商没有立即回应有关它们是否正在努力禁止或限制闪光粉的问题。美国环境保护局(Environmental Protection Agency)没有回应有关监管机构或公司是否正在采取措施在美国禁止闪光剂的问题，也没有回应闪光剂禁令可能会如何影响环境的问题。\n闪光剂是一种美丽的物质，不仅以其在艺术和手工艺中的用途而闻名，而且以其附着在衣服、地毯和汽车座椅上的坚韧而闻名，它也(通常)是一种微塑料，或者是一块直径不超过5毫米的塑料。\n近年来，微塑料受到了越来越多的关注，科学家们发现它们无处不在。它们污染海洋，在那里它们可能被鱼和其他生物摄取。一些较小的碎片可以作为看不见的大气污染物悬浮在空气中。\n它们可以通过这种方式旅行到极远的地方，而且在偏远的荒野地区被发现，这些地区可能被认为是原始的。\n在本月的一份报告中，研究人员称这是对海底微塑料数量的首次全球估计，澳大利亚国家科学机构发现，那里埋藏了925万至1587万吨-远远超过海洋表面的数量。\n威廉玛丽学院弗吉尼亚海洋科学研究所教授罗伯特·C·黑尔(Robert C.Hale)表示，与其他微塑料相比，闪光剂的颜色和光泽表明它可能含有某些对环境特别有害的金属或其他添加剂。(很难说是哪种添加剂-这将取决于闪光剂是在哪里以及如何制造的。)。\n但就体积而言，闪光剂并不是宏伟计划中的主要污染物。黑尔博士说，它在污染环境的微塑料中所占比例远远不到1%。\n我们环境中的绝大多数微塑料并不是从一开始就这么小的，它们被制造成更大的部件，然后被分解。这就是为什么塑料包装对我们的生态系统的威胁比闪光剂大得多。\n同样重要的是我们穿的许多衣服中的合成纤维，它可以在每次洗涤周期时将微塑料纤维引入我们的水系统。\n因此，虽然像微珠去角质剂或闪闪发光的装饰品这样的消费品可能会引起我们的注意，甚至会引发立法，但它们只占堵塞我们空气和海洋的微塑料的一小部分。黑尔博士说，禁止这些食品是朝着正确方向迈出的一小步，“但这并不能真正解决问题。”\n美国国家海洋和大气管理局海洋垃圾部门的首席科学家艾米·V·乌林(Amy V.Uhrin)同意，闪光剂只是众多不同类型的微塑料污染物中的一种。“很难说闪光剂禁令会有什么影响，”她补充说。\n研究人员仍在试图了解闪光微塑料的影响范围和影响，乌林博士指出，最近的研究发现，一些环境样本中含有丰富的闪光剂，特别是在土壤中；在废水污泥中发现了大量闪光剂。\n约翰·刘易斯(John Lewis)、韦特罗斯(Waitrose)和莫里森(Morrisons)可能已经禁止在他们的假日阵容中使用闪光剂，但他们仍然销售包括塑料或塑料包装的产品。莫里森和经营Waitrose超市的John Lewis都表示，他们近年来已经大幅减少了包装和库存中塑料的使用，并承诺继续下去。", "note_en": "This year, the holiday season in the United Kingdom will be a little less sparkly.\n Three major retailers — the grocery chains  Morrisons and  Waitrose and the department store company  John Lewis — have announced that they will not use glitter in their in-house brand, single-use Christmas products this year. That means no glittery snowflakes on Christmas cards, no sparkling snowmen on stickers, and no twinkling stars on wrapping paper.\n “Glitter is made from tiny particles of plastic and is an ecological hazard if it becomes dispersed on land, rivers and oceans — where it takes hundreds of years to degrade,” Morrisons said in a  statement.\n It appears that no similar glitter reckoning is underway in the United States. Major retailers including Walmart, Target, Walgreens, CVS and Costco did not immediately respond to questions about whether they were making efforts to ban or limit glitter. The Environmental Protection Agency did not respond to questions about whether regulators or companies were taking steps to ban glitter in the United States, or how glitter bans could affect the environment.\n Glitter, a pretty substance known not only for its utility in arts and crafts but also for its tenacity in sticking to clothing, carpets and car seats, is also (often) a microplastic, or a piece of plastic that is 5 millimeters or less in diameter.\n Microplastics have come under increased scrutiny in recent years, and scientists have been  finding them everywhere. They pollute the ocean, where they can be ingested by fish and other organisms. Some of the smaller pieces can hang in the air as  invisible atmospheric pollutants.\n They can travel extreme distances that way, and  they have been found in remote wilderness areas that might have been thought to be pristine.\n In a report this month, which researchers called  the first global estimate of the amount of microplastics on the sea floor, Australia’s national science agency found that  9.25 million to 15.87 million tons were embedded there — far more than what is on the ocean’s surface.\n Compared with other microplastics, glitter’s color and shine suggest it might have certain metals or other additives that are especially harmful to the environment, said  Robert C. Hale, a professor at the Virginia Institute of Marine Science at the College of William &amp; Mary. (It is hard to say which additives — that would depend on where and how the glitter is manufactured.)\n But in terms of volume, glitter is not a major pollutant in the grand scheme of things. It makes up far less than 1 percent of the microplastics that pollute the environment, Dr. Hale said.\n The vast majority of microplastics in our environment did not start out so small; they were manufactured as larger pieces and broke down. That’s why plastic packaging is a much bigger threat to our ecosystem than glitter.\n Also significant are the synthetic fabrics in many of the clothes we wear, which can introduce microplastic fibers into our water systems every time they go through a wash cycle.\n So while consumer items like microbead exfoliants or glittery decorations may catch our attention and even  inspire legislation, they make up a tiny fraction of the microplastics clogging our air and oceans. Banning these items is a small step in the right direction, Dr. Hale said, “but it doesn’t really solve the problem.”\n Amy V. Uhrin, the chief scientist of the National Oceanic and Atmospheric Administration’s Marine Debris Division, agreed that glitter was just one of many different kinds of microplastic pollutants. “It is difficult to say what impact a glitter ban would have,” she added.\n Researchers are still trying to understand the reach and impact of sparkly microplastics, and Dr. Uhrin pointed to recent studies that found that glitter was  abundant in some environmental samples, particularly in soils; and that significant amounts of glitter had been  found in wastewater sludge.\n John Lewis, Waitrose and Morrisons may have banned glitter in their holiday lineups, but they still sell products that include plastic or come in plastic packaging. Both  Morrisons and  John Lewis, which operates Waitrose supermarkets, said they had significantly reduced the use of plastic in packaging and inventory in recent years and had pledged to continue.", "posttime": "2020-10-20 15:20:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "圣诞节,retailers,闪光", "title": "英国主要零售商对圣诞节闪闪发光说不", "title_en": "Major Retailers in Britain Say No to Glitter for Christmas", "transed": 1, "url": "https://www.nytimes.com/2020/10/15/business/glitter-ban-christmas.html", "via": "", "real_tags": ["圣诞节", "retailers", "闪光"]}, {"category": "", "categoryclass": "", "imagename": "2bac00970224bb6bf2adc02af0a1b378.png", "infoid": 1029971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与长期胜利相比，短期胜利总是更受青睐，因为它们现在是确定的，而且是赚钱的。\n长期计划需要大量的投资、耐心和承诺，这是许多组织和领导者没有耐心的。\n通过关注正确的数据来对抗短期思维，量化短期和长期权衡之间的机会成本，并将每个项目与更广泛的组织战略目标捆绑在一起。\n确保技术在第一次构建时就是正确的--让一个项目以正确的方式构建它比交付一个损坏的特性来说它是按时完成的原则要好得多。\n人类天生将短期收益置于长期投资之上。一个常见的心理学实验--如果我说我现在给你20美元，或者一周后给你25美元，你会选择现在给你20美元。为什么？这种对即时满足的需求是非常人性化的特点。我们渴望确定性。我们很难完全理解和权衡未来可能发生或不可能发生的选择。即使长期目标更有希望或更有价值，短视的观点也会让我们屈服于短期的多巴胺刺激。\n在美国企业界，短期主义是一个真正的问题。告诉我你以前有没有听过这句话。\n“Acme Inc.。在他们的季度收益低于华尔街分析师的预期，股票下跌了10%“。\n“Acme Compantor Inc.。期间将专注于股票回购，增加股东价值“。\n“Acme Three Inc.。新发布的版本平淡无奇，大多是质量修复，而不是新功能。股票下跌了10%。“。\n我花了很多时间在长期计划和短期需求的交汇点上。我的观察是，领导者更频繁地以牺牲长期目标为代价做出短期决定。\n毕竟，你难道不想胜利一圈，现在赚200万美元，而不是在不久的将来赚300万美元，这是你不能真正确定的。\n工程团队为满足短期收益而付出的最常见的机会成本是技术债务。\n因此，我一直在问自己，既然我们知道长期计划对组织来说要重要得多，也好得多，为什么我们还要继续进行这些短期行动呢？\n我在行业研究和我在苹果(Apple)、谷歌(Google)、黑莓(Blackberry)技术项目工作的经验中都看到了一些观察结果：\n投资者要求实现季度收益目标的压力-我们目前的环境是将季度胜利作为股东和公司未来的优先事项。股票回购，产品对产品，功能对功能，冲刺到冲刺；压力使得我们很难站起来说，在我们开始在基础设施或生态系统上建造房子之前，我们将以正确的方式专注于改善或建设我们的基础设施或生态系统。\n不断追求更新的功能和技术-有一种隐含的期望，即成功意味着不断推出新的东西。消费者并不真的对解决500个质量问题感到兴奋。除非由于来自媒体的外部压力或客户投诉变得太大声而无法忽视，这些质量问题是一个令人担忧的大话题，否则情况并非如此。这是被动的，总是将组织置于次要地位。\n在没有长期策略(构建与购买)的情况下，测试驱动新技术和服务(SaaS)变得更便宜、更容易，这是一个重要的策略。当技术在成本和实施方面变得更便宜时，为了满足当前的业务需求，公司只需购买现成的解决方案。为什么？要做到这一点，设计一个长期的技术路线图，组建开发团队，并为未来进行维护要容易得多。我们现在付钱请人来做这一切吧。这在小型公司可能是有意义的，但在大中型组织中就不是这样了。\n高层领导层面临的压力是，要找到哪怕是最轻微的收入增长来声称自己取得了胜利-这往往是外部压力正在内化。不利于士气，不利于长远思考，但我们现在可以做一些胜利的圈子了。\n长期投资可能需要几个月、几年、几十年--罗马不是一天建成的。平台需要数年时间才能达到临界质量。建造正确的东西需要时间。即使是初创公司也需要数年时间和几轮融资才能达到独角兽的地位。所有好的事情都需要时间、奉献、高度的专注和无可置疑的承诺。领导团队喜欢确定性。长期战略是关于进行长期押注的。没有人想被称为对某项功能说不，或者说“用正确的方式做这件事需要的时间比你想象的要长”的人。\n在一个永远由产品驱动的技术环境中，研发的耐心是有限的--研发历史上一直专注于研究；在一个永远由产品驱动的世界里，研究已经转向产品，以更好地回应客户需求。这意味着组织采用或探索可能证明对组织有益的新技术的速度很慢。事实上，研发资金投入到了产品化上，而不是投入到恶臭工厂的勘探上。\n与长期目标相比，所有的短期目标都一定是糟糕的，这并不是完全准确的。通常情况下，情况可能会发生变化，这需要重新调整长期目标，这会打开取得坚实胜利的短期机会。\n然而，从长远来看，确实需要组织将重点放在第一次以正确的方式构建正确的事情上。这最终需要领导层的耐心，适当水平的劳动力和技能投资，最重要的是研究驱动的方法，而不是功能或产品驱动的方法。\n麦肯锡全球指数(McKinsey Global Index)2017年的一项研究调查了1000名C-Suite和董事会成员，发现所有级别的短期组织表现都不如那些长期投资的组织。去想想吧。\n我们可以做一些事情来帮助领导人做出正确的决策：\n用合适的数据集(人力(员工能力和技能)和资本资源(预期收入收益、需求和美元)武装领导地位)。\n帮助组织开发受保护的研究和探索时间(Google的20%项目/Apple的代码周)。\n帮助领导层建立决策框架，不是从短期角度，而是从长期扩张的角度来决定建造或购买决策，并针对未来的竞争或事件制定更强大的护城河。只要有可能，总是建造，不要购买。\n将整个组织中的每个项目与更广泛的公司愿景或目标联系起来。这可以是OKR的形式，也可以是战略目标的形式。\n确保技术债务不作为一个项目被忽视和跟踪。许多团队都将其列为100大质量错误、错误赏金、质量黑客马拉松。\n帮助技术团队在第一时间以正确的方式构建东西，而不是偷工减料来满足最后期限。让项目以正确的方式构建要比交付一个损坏的特性说它按时完成要好得多--这不是项目的成功。\n与领导层合作，确保长期战略和计划在整个组织内与所有团队进行良好的沟通。\n如果你喜欢读这篇文章，请一定要与你的朋友、家人、同事、LinkedIn窥探、推特圈子或你知道的任何东西/任何你有的东西分享。", "note_en": "Short-term wins are always preferred over long-term because they are certain and make money now.\n   Long-term plans require massive investment, patience, and commitment which many organizations and leaders don’t have patience for.\n Fight the short-term thinking by focusing on the right data, quantify the opportunity cost between short-term and long-term trade-offs, and tie each project to the broader organizational strategic goals.\n Ensure technology is built right the first time - Slipping a project to build it the right way is a far better principal than to ship a broken feature to say it was done on time.\n  Humans are wired to prioritize short-term gains over long-term investment. A common psychology experiment - if I said I would give you $20 right now or $25 in one week, you would opt for the $20 now. Why? This need for instant gratification is a very human trait. We crave certainty. It is hard for us to completely comprehend and weigh options that are in the future that may or may not happen. Even if the long-term goals are more promising or valuable, the instant myopic point of view makes us cave on the short-term dopamine hits.\n   Within Corporate America,   short-termism is a real problem. Tell me if you have heard this line before.\n “Acme Inc. during their quarterly earnings missed the Wall Street Analyst expectations and the stock is down 10%”.\n “Acme Competitor Inc. during will focus on stock buyback stock increase shareholder values”.\n “Acme Three Inc. new release was lackluster, mostly quality fixes instead of new features. Stock is down 10%”.\n  I have spent a lot of time at the intersection of long-term plans and short-term needs. My observation has been that leaders have more frequently made short-term decisions at the cost of long-term goals.\n After all, wouldn’t you want to take victory laps of making $2,000,000 now versus $3,000,000 in a near future that you can’t really be certain of.\n Most common opportunity cost that engineering teams made to meet short-term gain in is   technical debt.\n   So, I keep asking myself,  why do we continue to make these short-term plays when we know the long-term plans are immensely more important and far better for the organization?\n  Some observations I have seen both in the industry research and my own experience working at Apple, Google, Blackberry on technology programs:\n Investor pressure to meet quarterly earnings target - Our present environment is geared towards making quarterly wins a priority for both shareholders and company future. Stock buybacks, product to product, feature to feature, sprint to sprint; the pressure makes it hard to stand up and say we will focus on improving or building our infrastructure or ecosystem the right way before we begin building the house on it.\n Constant drive for newer features and technologies - There is an implicit expectation that success means  shipping new things constantly. Consumers don’t really get excited about 500 quality issues being resolved. Not unless these quality concerns are a big topic of concern due to external pressure from media or customer complaints have become too loud to ignore. That is reactive and always places the organization on the back footing.\n It gets cheaper and easier to test drive newer technologies and services (SaaS) without a long term strategy - build vs buy - This is an important one. When technology becomes cheaper in both cost and implementation, to meet business needs of the hour, companies just buy off the shelf solutions.  Why? It’s much easier to do that then to devise a long term technology roadmap, build team(s) to develop, and maintain it for the future.  Let’s just pay someone to do all that now. This may make sense at Small sized companies but medium to large organizations it does not.\n Senior leadership pressure to find even the slightest revenue gains to claim a Win - More often than not, this is external pressure being internalized. Bad for morale, bad for long-term thinking, but we get to do some victory laps now.\n Long-term investment can take months, years, decades - Rome wasn’t built in a day. Platforms take years to hit critical mass. Building the right thing takes time. Even startups take years and several funding rounds to get to a unicorn status. All good things take time, dedication, laser focus, and unquestionable commitment. Leadership teams love certainty. Long-term strategies are about making long-term bets. No one wants to be known as the person who said no to a feature or said “it will take longer than you are thinking to do it the right way”.\n In an ever product-driven technology environment, the patience for R&amp;D is limited - R&amp;D historically has focused on research; in an ever product-driven world, research has  shifted to products to better respond to customer needs. This means that organizations are slow to adopt or explore new technologies that may prove beneficial to the organization. Money in R&amp;D is in fact being invested to productization than skunkworks exploration.\n  It’s not completely accurate that all short term goals must be bad when compared to long-term goals. Often the landscape can change that requires a recalibration of long term goals which opens short-term opportunities that are solid wins.\n Long-term however does require an organizational focus on building the right thing the right way the first time. This ultimately requires patience at the leadership level, right level of workforce and skills investment, and above all a research driven approach rather than a feature or product driven one.\n A 2017  study by McKinsey Global Index that surveyed 1,000 C-Suite and board members, short term focused organizations on all levels performed poorly than those that invested in the long term. Go figure.\n  There are a few things that we can do to help leaders make the right decisions:\n Arm leadership with the right data set -  both human (workforce capacity and skills) and capital resources (expected revenue gains, demand, and $$$)\n  Help organizations develop protected research and exploratory time (20% projects at Google / Week of Code at Apple)\n Help arm leadership with a decision framework to decide on build or buy decisions not from the short-term point of view but long-term expansion and developing stronger moats against future competition or events.  Whenever possible, always build, don’t buy.\n Tie each project across the organization to broader company vision or objectives. This can either take the shape of OKRs or Strategic Goals.\n Ensure technical debt is not ignored and tracked as a project.  Many teams have tracked this as Top 100 Quality Bugs, Bug Bounty, Quality Hackathons.\n Help technical teams build things the right way the first time instead of cutting corners to meet deadlines.  Slipping a project to build it the right way is a far better principal than to ship a broken feature to say it was done on time - that is not project success.\n Work with leadership to ensure long-term strategies and plans are well communicated across the organization with all teams bought in.\n        If you enjoyed reading this, please do share with your friends, family, colleagues, Linkedin peeps, twittersphere, or you know whatever/wherever you have.", "posttime": "2020-10-20 15:01:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思维,后果,consequences,技术", "title": "关于技术组织中短期思维后果的观察", "title_en": "Observations on Consequences of Short-Term Thinking in Technology Organizations", "transed": 1, "url": "https://buildingromes.substack.com/p/chasing-the-squirrel-consequences", "via": "", "real_tags": ["思维", "后果", "技术"]}, {"category": "", "categoryclass": "", "imagename": "2f3abca534349fd898a34b4db2c89f52.png", "infoid": 1029970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当Nano Defender在2019年上线时，它迅速成为绕过互联网网站反广告屏蔽机制的首选扩展。它使用了uBlock Origin的代码，uBlock Origin是最著名的内容拦截扩展之一，用户开始在Chrome和其他基于Chromium的浏览器上安装新的扩展。\nNano Defender和uBlock Origin的一个主要区别因素是，前者支持一个报告选项，让开发人员了解在使用该扩展时遇到的问题。*另一名开发人员为Firefox创建了一个端口，以覆盖Windows平台上的所有主要浏览器。\nNano Defender仅从Chrome网络商店就有超过20万用户安装了该扩展。\n该扩展的开发者在官方GitHub上透露，他在12天前决定将该扩展出售给两名土耳其开发者。\n社区成员和uBlock Origin的开发商雷蒙德·希尔(Raymond Hill)分享了他们对这笔交易的看法，以及提供的信息很少的事实。戈尔希尔怀疑，新业主的主要意图是以这样或那样的形式将扩建项目货币化，或者做得更糟。\n新的所有者向Chrome商店上传了一个新版本，仔细分析扩展的代码发现，它包含一个新的connect.js文件，该文件不是来自该项目的GitHub页面。\nHill对代码进行了分析，发现新代码允许开发人员向远程服务器提交用户活动和数据。\n该扩展模块现在设计为根据外部可配置的试探法从传出的网络请求中查找特定信息，并将其发送到https://def.dev-nano.com/.。\n希尔建议用户立即卸载Nano Defender/Nano广告拦截器，以阻止数据提交给新所有者。\n扩展的火狐分支不是交易的一部分，它的维护者表示有兴趣重新命名并继续维护它。所有其他版本的扩展，基本上任何基于Chromium浏览器的版本，都应该立即删除。为了安全起见，用户也应该删除Firefox扩展。\n广告", "note_en": "When Nano Defender was launched in 2019, it quickly became a go-to extension to bypass anti-adblocking mechanisms on Internet sites. It used code from  uBlock Origin, one of the most prominent content blocking extensions, and users started to install the new extension in Chrome and other Chromium-based browsers.\n One of the main differentiating factors between Nano Defender and uBlock Origin was that the former supported a reporting option to let the developer know about issues encountered while using the extension.  A port for Firefox was created by another developer to cover all major browsers on the Windows platform.\n Nano Defender has more than 200,000 users that installed the extension from the Chrome Web Store alone.\n The developer of the extension  revealed on the official GitHub that he decided to sell the extension twelve days ago to two Turkish developers.\n Community members and Raymond Hill, developer of uBlock Origin, shared their thoughts on the deal and the fact that little information was provided. Gorhill suspected that the new owners main intention was to monetize the extension in one form or another, or do worse with it.\n  The new owners uploaded a new version to the Chrome store, and careful analysis of the code of the extension revealed that it contained a new connect.js file that did not come from the project&#39;s GitHub page.\n Hill provided an analysis of the code and discovered that the new code allowed the developers to submit user activity and data to remote servers.\n The extension is now designed to lookup specific information from your outgoing network requests according to an externally configurable heuristics and send it to https://def.dev-nano.com/.\n Hill suggested that users uninstall Nano Defender / Nano Adblocker immediately to block data from being submitted to the new owners.\n The Firefox fork of the extension was not part of the deal, and the maintainer of it expressed interest to rename it and continue maintaining it. All other versions of the extension, basically any for Chromium-based browsers, should be removed immediately. Users who want to be on the safe side should remove the Firefox extension as well.\n   Advertisement", "posttime": "2020-10-20 15:01:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,详细信息,anti,扩展", "title": "广受欢迎的反广告屏蔽扩展被出售，用户详细信息受损", "title_en": "Popular anti-adblocking extension gets sold, users details compromised", "transed": 1, "url": "https://www.ghacks.net/2020/10/16/time-to-remove-nano-adblocker-and-defender-from-your-browsers-except-firefox/", "via": "", "real_tags": ["广告", "详细信息", "anti", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当有人回复您在黑客新闻上的评论时，您的用户名和电子邮件将用于向您发送电子邮件通知。\n1,942名HN用户注册了丹·格罗斯曼在过去30天内发送的7,239条回复通知", "note_en": "Your username and email will be used to send you an email notification when someone replies to one of your comments at  Hacker News.\n  1,942 HN Users Signed Up   /   7,239 Reply Notifications Sent in Past 30 Days    Created by  Dan Grossman", "posttime": "2020-10-20 13:50:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "回复,replies,电子邮件", "title": "HN回复-当有人回复您时会收到通知", "title_en": "HN Replies – Get notified when someone replies to you", "transed": 1, "url": "https://hnreplies.com/", "via": "", "real_tags": ["回复", "replies", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "7527151c7d76004b1b77a5dece86f7cf.jpg", "infoid": 1029967, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Valve Corporation首席执行官加布·纽威尔(Gabe Newell)向1新闻证实，他正在申请新西兰居留权-但他表示，有关他将其视频游戏公司的开发人员转移到新西兰的报道是没有根据的。\n多家博彩媒体昨日报道称，纽威尔曾表示，由于这家游戏公司面临新冠肺炎的挑战，他正寻求将开发商转移到新西兰。\n据报道，他正在安排与总理杰辛达·阿德恩(Jacinda Ardern)会面，讨论将开发商带到新西兰的前景。\nValve目前没有在新西兰开设办事处的计划，这并不是说这将是一个坏主意。这不是我们正在努力的事情。\n纽威尔在新冠肺炎大流行之前就一直在访问新西兰，并决定坚持到底，和一群朋友一起在原地避难。\n如果他成为一名居民，他将成为新西兰最富有的人之一，根据福布斯的数据，他的净资产约为60亿新西兰元。\n纽威尔还在重新组织一场音乐会活动，以感谢新西兰在新冠肺炎时期邀请他。由于社区的第二次复兴，最后一场活动不得不推迟。\n据1新闻报道，我们爱奥蒂亚罗亚演唱会可能会在年底前举行，但日期尚未确定。\n他还招募了一名新西兰漂流冠军参加新西兰的耐力赛车比赛，这是他的赛车之心团队的一部分，该团队为包括星际飞船在内的儿童医院筹集资金。\nNewell于1996年共同创立了Valve Corporation，该公司的在线游戏分销服务Steam估计有9000万活跃用户-Steam的年收入估计在数十亿美元。", "note_en": "Valve Corporation CEO Gabe Newell has confirmed to 1 NEWS that he is applying for New Zealand residency - but says reports of him moving developers for his video game company to New Zealand are unfounded.\n    Various gaming media outlets reported yesterday that Newell had indicated he was looking to move developers to New Zealand as the gaming company faced the challenge of Covid-19.\n  According to the reports, he was arranging a meeting with Prime Minister Jacinda Ardern to discuss the prospect of bringing developers to New Zealand.\n        &#34;Valve does not currently have plans to open an office in New Zealand, which isn&#39;t to say that it would be a bad idea. It&#39;s just not something we are working on.&#34;\n  Newell has been visiting New Zealand since before the Covid-19 pandemic took hold, and decided to stick it out and shelter in place along with a group of friends.\n    If he becomes a resident, he will be among New Zealand&#39;s wealthiest, with a net worth according to Forbes of about NZ$6 billion.\n  Newell is also in the process of re-organisating a concert event to say thank you to New Zealand for having him during the Covid-19 period, after the last event had to be postponed due to the second resurgence in the community.\n    1 NEWS understands the We Love Aotearoa concert could take place before the end of the year, but the date has not been confirmed.\n  He has also enlisted a Kiwi drift champion to race in endurance motorsport here in New Zealand as part of his Heart of Racing team, which raises money for children&#39;s hospitals including Starship.\n    Newell co-founded Valve Corporation in 1996, and the company&#39;s online game distribution service Steam has an estimated 90 million active users - Steam&#39;s annual revenue is estimated to be in the billions.", "posttime": "2020-10-20 13:50:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,游戏,newell,stranded,新西兰", "title": "Covid搁浅的美国游戏首席执行官加布·纽威尔(Gabe Newell)申请新西兰居留", "title_en": "Covid-stranded American gaming CEO Gabe Newell applies for NZ residency", "transed": 1, "url": "https://www.tvnz.co.nz/one-news/new-zealand/nzs-newest-billionaire-covid-stranded-american-gaming-ceo-gabe-newell-applies-nz-residency", "via": "", "real_tags": ["美国", "游戏", "newell", "stranded", "新西兰"]}, {"category": "", "categoryclass": "", "imagename": "95991ed392907457491c9faf34aa3907.jpg", "infoid": 1029966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着Pixel5开始进入消费者手中，我们收到了几份报告，称屏幕的塑料保险杠和手机的生物树脂涂层铝框之间存在缺口。报道各不相同，但前置摄像头周围的区域似乎是问题的热点，客户担心这个缺口可能会影响手机的IP级防水性能。\n报告的数量本身并不是特别大，但我们必须假设Pixel5在野外的有限数量与此有关，而且新报告的数量正在以稳定的速度增长。在过去的两天里，Pixel手机产品论坛和XDA论坛等场所的投诉不断增加，大量的照片不仅展示了差距本身，还展示了不同单位之间的位置和显著性有多大的不同。\n我们可以确认，我们自己的Pixel5审查单元也受到了影响，尽管程度比上图中的一些要小。大多数报告显示，它位于最靠近显示屏摄像头插口的角落，沿着手机顶部，在左侧的SIM卡托盘上方，但它也可能出现在其他区域。虽然大多数图像在纯黑色配色中显示了这个问题(可能是因为它在对比度较强的情况下最明显)，但它也会影响鼠尾草绿色。\n我们不知道这个间隙是否会影响手机的额定防水性能，但我们知道它会积灰，而且这种不规则性在高端设备上看起来不太好看。根据最近的报告，这些差距从一开始就存在，因此屏幕似乎不会随着时间的推移而分离。\n随着报道的不断增多，我们已经联系了谷歌，以获取关于这个问题的更多信息，如果我们得到任何回复，我们一定会更新的。", "note_en": "As the Pixel 5 starts to make its way into customers&#39; hands, we&#39;ve received several reports of a gap between the screen&#39;s plastic bumper and the bioresin-coated aluminum frame of the phone. Reports vary, but the area around the front-facing camera appears to be a hotspot for the problem, and customers are concerned this gap could affect the phone&#39;s IP-rated water resistance.\n    The volume of reports isn&#39;t especially large by itself, but we have to assume the limited number of Pixel 5 units in the wild has something to do with that, and the number of new reports is increasing at a consistent rate. Complaints have been picking up over the last two days at venues like the  Pixel Phone product forum and  XDA Forum, with plenty of photos showing off not just the gap itself, but how much it can vary in location and prominence between units.\n   We can confirm that our own Pixel 5 review unit is also affected, though to a lesser degree than some of those pictured above. Most reports show it in the corner closest to the display&#39;s camera cutout, along the top of the phone, and above the SIM tray on the left side, but it may also appear in other areas as well. Though most images demonstrate the problem in the Just Black colorway (probably because it&#39;s most visible with the stronger contrast), it also affects the Sage Green color.\n  We do not know if this gap affects the phone&#39;s rated water resistance, but we do know it accrues dust, and the irregularity doesn&#39;t look too nice on a premium device. Based on recent reports, these gaps are present from the start, so the screen doesn&#39;t appear to be separating over time.\n As reports continue to pick up, we&#39;ve reached out to Google for more information regarding this issue, and we&#39;ll be sure to update if we hear anything back.", "posttime": "2020-10-20 13:50:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,owners", "title": "Pixel 5用户报告手机显示屏和边框之间存在差距", "title_en": "Pixel 5 owners report gaps between phone's display and frame", "transed": 1, "url": "https://www.androidpolice.com/2020/10/19/pixel-5-owners-report-gaps-between-phones-display-and-frame/", "via": "", "real_tags": ["手机", "owners"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：在本文中，我们简要概述了Python统计建模和机器学习社区中符号计算的现状和未来潜力。我们详细介绍了MiniKanren作为术语重写和符号数学的底层框架的使用，以及它协调使用现有Python库的能力。我们还讨论了关系编程对于实现更健壮的、可移植的、特定于领域的数学级别的优化的重要性和潜力--略微侧重于贝叶斯建模。最后，我们描述了下一步的工作，并对统计建模和程序设计语言理论之间的潜在交叉提出了一些看法。\n来自：Brandon T.Willard[查看电子邮件][v1]Sun，2020 May 24 03：09：08 UTC(39 KB)[v2]Tue，2020 May 26日18：58：39 UTC(39 KB)[v3]清华，2020 May 28 20：41：06 UTC(40 KB)。\nArxivLabs是一个框架，允许合作者直接在我们的网站上开发和共享新的arxiv功能。\n与arxivLabs合作的个人和组织都接受并接受了我们开放、社区、卓越和用户数据隐私的价值观。Arxiv致力于这些价值观，只与坚持这些价值观的合作伙伴合作。\n你有一个为arxiv&39；社区增加价值的项目的想法吗？了解有关arxivLabs的更多信息以及如何参与其中。\n书目工具代码推荐器", "note_en": "Download PDF  Abstract: In this article, we give a brief overview of the current state and futurepotential of symbolic computation within the Python statistical modeling andmachine learning community. We detail the use of miniKanren as an underlyingframework for term rewriting and symbolic mathematics, as well as its abilityto orchestrate the use of existing Python libraries. We also discuss therelevance and potential of relational programming for implementing more robust,portable, domain-specific &#34;math-level&#34; optimizations--with a slight focus onBayesian modeling. Finally, we describe the work going forward and raise somequestions regarding potential cross-overs between statistical modeling andprogramming language theory.\n  From: Brandon T. Willard [ view email]     [v1] Sun, 24 May 2020 03:09:08 UTC (39 KB)    [v2] Tue, 26 May 2020 18:58:39 UTC (39 KB)  [v3]Thu, 28 May 2020 20:41:06 UTC (40 KB)\n      About arXivLabs   arXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\n  Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\n  Have an idea for a project that will add value for arXiv&#39;s community?   Learn more about arXivLabs and   how to get involved.\n    Bibliographic Tools      Code      Recommenders", "posttime": "2020-10-20 13:30:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,符号计算,tool,数学", "title": "作为Python符号计算工具的MiniKanren", "title_en": "MiniKanren as a Tool for Symbolic Computation in Python", "transed": 1, "url": "https://arxiv.org/abs/2005.11644", "via": "", "real_tags": ["python", "符号计算", "tool", "数学"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近发表在“物理评论研究”(Physical Review Research)上的一篇文章中，我们展示了深度学习如何帮助解决现实世界系统的量子力学基本方程。这不仅是一个重要的基础科学问题，而且它还可能导致未来的实际应用，使研究人员在尝试在实验室制造新材料和化学合成之前，能够在硅胶中制作新材料和化学合成的原型。今天，我们还发布了这项研究的代码，这样计算物理和化学社区就可以在我们的工作基础上继续工作，并将其应用于广泛的问题。我们已经开发了一种新的神经网络体系结构，费米神经网络或费米网络，它非常适合于对大量电子集合的量子态进行建模，这些电子集合是化学键的基本构件。FermiNet是第一个从第一性原理计算原子和分子能量的深度学习的演示，它足够精确，以至于有用，而且它仍然是迄今为止最准确的神经网络方法。我们希望我们在DeepMind的人工智能研究中开发的工具和想法能够帮助解决自然科学中的基本问题，FermiNet加入了我们在蛋白质折叠、玻璃动力学、晶格量子色动力学和许多其他项目方面的工作，将这一愿景变为现实。\n提到“量子力学”，比起其他任何事情，你更有可能引起混乱。这句话让人联想到薛定谔的猫，矛盾的是，它既可能是活的，也可能是死的，以及基本粒子，不知何故，它们也是波。在量子系统中，像电子这样的粒子并不像经典描述中的那样有确切的位置。相反，它的位置是用概率云来描述的-它被涂抹在所有它被允许的地方。这种违反直觉的状态导致理查德·费曼(Richard Feynman)宣称：“如果你认为你了解量子力学，那么你就不懂量子力学。”尽管有这种诡异之处，但该理论的实质可以归结为几个简单的方程式。其中最著名的是薛定谔方程，它描述了粒子在量子尺度上的行为，就像牛顿定律描述我们更熟悉的人类尺度上物体的行为一样。虽然对这个方程的解释可能会让人百思不得其解，但数学要容易得多，这导致了教授们在面对学生们棘手的哲学问题时，通常会告诫他们“闭嘴计算”。\n这些方程足以在原子和原子核的水平上描述我们周围所有熟悉的物质的行为。它们违反直觉的本质导致了各种各样的奇异现象：超导体、超流体、激光和半导体只有在量子效应的作用下才有可能。但是，即使是不起眼的共价键-化学的基本构件-也是电子量子相互作用的结果。当这些规则在20世纪20年代制定出来后，科学家们第一次意识到，他们对化学是如何工作的有了一个详细的理论。原则上，他们只需要为不同的分子建立这些方程，求解系统的能量，然后计算出哪些分子是稳定的，哪些反应会自发发生。但是当他们坐下来实际计算这些方程的解时，他们发现他们可以精确地计算出最简单的原子(氢)的解，其他的几乎没有。其他的一切都太复杂了。\n“因此，很大一部分物理和整个化学的数学理论所需的基本物理定律是完全清楚的，困难的只是这些定律的准确应用导致方程太复杂而无法求解。因此，发展应用量子力学的近似实用方法就变得可取了.。\n许多人接受了狄拉克的指控，很快物理学家就建立了数学技术，可以近似分子键和其他化学现象的定性行为。这些方法开始于对电子行为的大致描述，这可能是入门化学中熟悉的。在本描述中，每个电子被分配到一个特定的轨道，这给出了在原子核附近的任何点发现单个电子的概率。然后，每个轨道的形状取决于所有其他轨道的平均形状。由于这种“平均场”描述将每个电子视为只分配到一个轨道，所以它对电子实际行为的描述是非常不完整的。然而，估计一个分子的总能量就足够了，误差只有0.5%左右。\n不幸的是，0.5%的误差仍然不足以对工作的化学家有用。分子键中的能量只占系统总能量的很小一部分，并正确地预测了分子间的相互作用\n这正是我们认为深度神经网络可以提供帮助的地方。在过去的几年里，用神经网络来表示复杂的、高维的概率分布已经取得了巨大的进展。我们现在知道如何高效且可扩展地训练这些网络。我们推测，鉴于这些网络已经证明了它们在人工智能问题中拟合高维函数的能力，或许它们也可以用来表示量子波函数。我们并不是第一个想到这一点的人，朱塞佩·卡莱奥(Giuseppe Carleo)和马蒂亚斯·特罗耶(Matthias Troyer)等研究人员已经展示了现代深度学习如何用于解决理想化的量子问题。我们想使用深度神经网络来解决化学和凝聚态物理中更现实的问题，这意味着在我们的计算中包括电子。\n在处理电子时只有一条皱纹。电子必须遵守泡利不相容原理，这意味着它们不能同时处于同一空间。这是因为电子是一种被称为费米子的粒子，它包括大多数物质的构件-质子、中子、夸克、中微子等。它们的波函数必须是反对称的-如果你交换两个电子的位置，波函数就会乘以-1。这意味着如果两个电子相互叠加，波函数(以及该构型的概率)将为零。\n这意味着我们必须开发一种新型的神经网络，它相对于其输入是反对称的，我们称之为费米子神经网络，或费米网络。在大多数量子化学方法中，反对称是通过一个称为行列式的函数引入的。矩阵的行列式具有这样的特性：如果交换两行，输出将乘以-1，就像费米子的波函数一样。所以你可以取一堆单电子函数，对你系统中的每个电子求值，然后把所有的结果打包到一个矩阵中。那么该矩阵的行列式就是一个适当的反对称波函数。这种方法的主要限制是所得到的函数-称为斯莱特行列式-不是非常通用的。实际系统的波函数通常要复杂得多。改进这一点的典型方法是采用斯莱特行列式的大型线性组合-有时是数百万或更多-然后根据电子对添加一些简单的校正。即便如此，这也可能不足以准确计算能量。\n在表示复杂函数时，深度神经网络通常比基函数的线性组合更有效。在费米网中，这是通过使进入行列式的每个函数都是所有电子(1)的函数来实现的。这远远超出了只使用单电子和双电子函数的方法。对于每个电子，FermiNet都有单独的信息流。如果这些流之间没有任何交互，网络将不会比传统的斯莱特行列式更具表现力。为了超越这一点，我们将来自网络每层所有流的信息进行平均，并将此信息传递给下一层的每个流。这样，这些流具有正确的对称属性来创建反对称函数。这类似于图形神经网络在每一层收集信息的方式。与斯莱特行列式不同，费米网是通用的函数逼近器，至少在神经网络层变得足够宽的极限情况下是这样。这意味着，如果我们能够正确地训练这些网络，它们应该能够拟合薛定谔方程的近乎精确的解。\n我们通过最小化系统的能量来拟合FermiNet。为了准确地做到这一点，我们需要评估所有可能的电子构型的波函数，所以我们必须做近似的计算。我们随机选择一种电子构型，局部评估每种电子排列的能量，将每种排列的贡献相加，并将其最小化，而不是真正的能量。这被称为蒙特卡罗方法，因为它有点像赌徒一遍又一遍地掷骰子。虽然它是近似值，但如果我们需要使它更精确，我们总是可以再次掷骰子。由于波函数的平方提供了在任何位置观察粒子排列的概率，因此从波函数本身生成样本最方便-本质上是模拟观察粒子的行为。虽然大多数神经网络是从一些外部数据训练而来的，但在我们的情况下，用于训练神经网络的输入是由神经网络本身生成的。这有点像你自己自力更生，这意味着我们不需要任何训练数据，除了电子围绕着跳舞的原子核的位置。基本思想，即所谓的变分法\n请阅读此处的报纸，并在此处查看代码。感谢吉姆·金文、亚当·凯恩和多米尼克·巴洛的数字。\n(1)FermiNet也有针对每对电子的流，来自这些流的信息被传递回单电子流。为简单起见，我们选择不在博客帖子中对此进行可视化，但详细信息可以在文章中找到。", "note_en": "In an  article recently published in Physical Review Research, we show how deep learning can help solve the fundamental equations of quantum mechanics for real-world systems. Not only is this an important fundamental scientific question, but it also could lead to practical uses in the future, allowing researchers to prototype new materials and chemical syntheses in silico before trying to make them in the lab. Today we are also releasing the  code from this study so that the computational physics and chemistry communities can build on our work and apply it to a wide range of problems. We’ve developed a new neural network architecture, the Fermionic Neural Network or FermiNet, which is well-suited to modeling the quantum state of large collections of electrons, the fundamental building blocks of chemical bonds. The FermiNet was the first demonstration of deep learning for computing the energy of atoms and molecules from first principles that was accurate enough to be useful, and it remains the most accurate neural network method to date. We hope the tools and ideas developed in our AI research at DeepMind can help solve fundamental problems in the natural sciences, and the FermiNet joins our work on  protein folding,  glassy dynamics,  lattice quantum chromodynamics and many other projects in bringing that vision to life.\n  Mention “quantum mechanics” and you are more likely to inspire confusion than anything else. The phrase conjures up images of Schrödinger’s cat, which can paradoxically be both alive and dead, and fundamental particles that are also, somehow, waves.  In quantum systems, a particle such as an electron doesn’t have an exact location, as it would in a classical description. Instead, its position is described by a probability cloud - it’s smeared out in all places it’s allowed to be. This counterintuitive state of affairs led Richard Feynman to declare: “If you think you understand quantum mechanics, you don’t understand quantum mechanics.” Despite this spooky weirdness, the meat of the theory can be reduced down to just a few straightforward equations. The most famous of these, the Schrödinger equation, describes the behavior of particles at the quantum scale in the same way that Newton’s laws describe the behavior of objects at our more familiar human scale. While the interpretation of this equation can cause endless head-scratching, the math is much easier to work with, leading to the common exhortation from professors to “shut up and calculate” when pressed with thorny philosophical questions from students.\n These equations are sufficient to describe the behavior of all the familiar matter we see around us at the level of atoms and nuclei. Their counterintuitive nature leads to all sorts of exotic phenomena: superconductors, superfluids, lasers and semiconductors are only possible because of quantum effects. But even the humble covalent bond - the basic building block of chemistry - is a consequence of the quantum interactions of electrons. Once these rules were worked out in the 1920s, scientists realised that, for the first time, they had a detailed theory of how chemistry works. In principle, they could just set up these equations for different molecules, solve for the energy of the system, and figure out which molecules were stable and which reactions would happen spontaneously. But when they sat down to actually calculate the solutions to these equations, they found that they could do it exactly for the simplest atom (hydrogen) and virtually nothing else. Everything else was too complicated.\n  “The underlying physical laws necessary for the mathematical theory of a large part of physics and the whole of chemistry are thus completely known, and the difficulty is only that the exact application of these laws leads to equations much too complicated to be soluble. It therefore becomes desirable that approximate practical methods of applying quantum mechanics should be developed”\n  Many took up Dirac’s charge, and soon physicists built mathematical techniques that could approximate the qualitative behavior of molecular bonds and other chemical phenomena. These methods started from an approximate description of how electrons behave that may be familiar from introductory chemistry. In this description, each electron is assigned to a particular orbital, which gives the probability of a single electron being found at any point near an atomic nucleus. The shape of each orbital then depends on the average shape of all other orbitals. As this “mean field” description treats each electron as being assigned to just one orbital, it is a very incomplete picture of how electrons actually behave. Nevertheless, it is enough to estimate the total energy of a molecule with only about 0.5% error.\n      Unfortunately, 0.5% error still isn’t enough to be useful to the working chemist. The energy in molecular bonds is just a tiny fraction of the total energy of a system, and correctly predicting whether a molecule is stable can often depend on just 0.001% of the total energy of a system, or about 0.2% of the remaining “correlation” energy. For instance, while the total energy of the electrons in a  butadiene molecule is almost 100,000 kilocalories per mole, the difference in energy between different possible shapes of the molecule is just 1 kilocalorie per mole. That means that if you want to correctly predict butadiene’s natural shape, then the same level of precision is needed as measuring the width of a football field down to the millimeter.\n With the advent of digital computing after World War II, scientists developed a whole menagerie of computational methods that went beyond this mean field description of electrons. While these methods come in a bewildering alphabet soup of abbreviations, they all generally fall somewhere on an axis that trades off accuracy with efficiency. At one extreme, there are methods that are essentially exact, but scale worse than exponentially with the number of electrons, making them impractical for all but the smallest molecules. At the other extreme are methods that scale linearly, but are not very accurate. These computational methods have had an enormous impact on the practice of chemistry - the 1998 Nobel Prize in chemistry was awarded to the originators of many of these algorithms.\n  Despite the breadth of existing computational quantum mechanical tools, we felt a new method was needed to address the problem of efficient representation. There’s a reason that the largest quantum chemical calculations only run into the tens of thousands of electrons for even the most approximate methods, while classical chemical calculation techniques like molecular dynamics can handle millions of atoms. The state of a classical system can be described easily - we just have to track the position and momentum of each particle. Representing the state of a quantum system is far more challenging. A probability has to be assigned to every possible configuration of electron positions. This is encoded in the wavefunction, which assigns a positive or negative number to every configuration of electrons, and the wavefunction squared gives the probability of finding the system in that configuration. The space of all possible configurations is enormous - if you tried to represent it as a grid with 100 points along each dimension, then the number of possible electron configurations for the silicon atom would be larger than the number of atoms in the universe!\n This is exactly where we thought deep neural networks could help. In the last several years, there have been huge advances in representing complex, high-dimensional probability distributions with neural networks. We now know how to train these networks efficiently and scalably. We surmised that, given these networks have already proven their mettle at fitting high-dimensional functions in artificial intelligence problems, maybe they could be used to represent quantum wavefunctions as well. We were not the first people to think of this - researchers such as  Giuseppe Carleo and Matthias Troyer and others have shown how modern deep learning could be used for solving idealised quantum problems. We wanted to use deep neural networks to tackle more realistic problems in chemistry and condensed matter physics, and that meant including electrons in our calculations.\n There is just one wrinkle when dealing with electrons. Electrons must obey the Pauli exclusion principle, which means that they can’t be in the same space at the same time. This is because electrons are a type of particle known as fermions, which include the building blocks of most matter - protons, neutrons, quarks, neutrinos, etc. Their wavefunction must be antisymmetric - if you swap the position of two electrons, the wavefunction gets multiplied by -1. That means that if two electrons are on top of each other, the wavefunction (and the probability of that configuration) will be zero.\n This meant we had to develop a new type of neural network that was antisymmetric with respect to its inputs, which we have dubbed the Fermionic Neural Network, or FermiNet. In most quantum chemistry methods, antisymmetry is introduced using a function called the determinant. The determinant of a matrix has the property that if you swap two rows, the output gets multiplied by -1, just like a wavefunction for fermions. So you can take a bunch of single-electron functions, evaluate them for every electron in your system, and pack all of the results into one matrix. The determinant of that matrix is then a properly antisymmetric wavefunction. The major limitation of this approach is that the resulting function - known as a Slater determinant - is not very general. Wavefunctions of real systems are usually far more complicated. The typical way to improve on this is to take a large linear combination of Slater determinants - sometimes millions or more - and add some simple corrections based on pairs of electrons. Even then, this may not be enough to accurately compute energies.\n      Deep neural networks can often be far more efficient at representing complex functions than linear combinations of basis functions. In the FermiNet, this is achieved by making each function going into the determinant a function of all electrons (1). This goes far beyond methods that just use one- and two-electron functions. The FermiNet has a separate stream of information for each electron. Without any interaction between these streams, the network would be no more expressive than a conventional Slater determinant. To go beyond this, we average together information from across all streams at each layer of the network, and pass this information to each stream at the next layer. That way, these streams have the right symmetry properties to create an antisymmetric function. This is similar to how  graph neural networks aggregate information at each layer. Unlike the Slater determinants, FermiNets are   universal function approximators, at least in the limit where the neural network layers become wide enough. That means that, if we can train these networks correctly, they should be able to fit the nearly-exact solution to the Schrödinger equation.\n      We fit the FermiNet by minimising the energy of the system. To do that exactly, we would need to evaluate the wavefunction at all possible configurations of electrons, so we have to do it approximately instead. We pick a random selection of electron configurations, evaluate the energy locally at each arrangement of electrons, add up the contributions from each arrangement and minimise this instead of the true energy. This is known as a Monte Carlo method, because it’s a bit like a gambler rolling dice over and over again. While it is approximate, if we need to make it more accurate we can always roll the dice again. Since the wavefunction squared gives the probability of observing an arrangement of particles in any location, it is most convenient to generate samples from the wavefunction itself - essentially, simulating the act of observing the particles. While most neural networks are trained from some external data, in our case the inputs used to train the neural network are generated by the neural network itself. It’s a bit like pulling yourself up by your own bootstraps, and it means that we don’t need any training data other than the positions of the atomic nuclei that the electrons are dancing around. The basic idea, known as variational quantum Monte Carlo (or VMC for short), has been around since the ‘60s, and it is generally considered a cheap but not very accurate way of computing the energy of a system. By replacing the simple wavefunctions based on Slater determinants with the FermiNet, we have dramatically increased the accuracy of this approach on every system we’ve looked at.\n      To make sure that the FermiNet really does represent an advance in the state of the art, we started by investigating simple, well-studied systems, like atoms in the first row of the periodic table (hydrogen through neon). These are small systems - 10 electrons or fewer - and simple enough that they can be treated by the most accurate (but exponential scaling) methods. The FermiNet outperforms comparable VMC calculations by a wide margin - often cutting the error relative to the exponentially-scaling calculations by half or more. On larger systems, the exponentially-scaling methods become intractable, so instead we use the “coupled cluster” method as a baseline. This method works well on molecules in their stable configuration, but struggles when bonds get stretched or broken, which is critical for understanding chemical reactions. While it scales much better than exponentially, the particular coupled cluster method we used still scales as the number of electrons raised to the seventh power, so it can only be used for medium-sized molecules. We applied the FermiNet to progressively larger molecules, starting with lithium hydride and working our way up to bicyclobutane, the largest system we looked at, with 30 electrons. On the smallest molecules, the FermiNet captured an astounding 99.8% of the difference between the coupled cluster energy and the energy you get from a single Slater determinant. On bicyclobutane, the FermiNet still captured 97% or more of this correlation energy - a huge accomplishment for a supposedly “cheap but inaccurate” approach.\n      While coupled cluster methods work well for stable molecules, the real frontier in computational chemistry is in understanding how molecules stretch, twist and break. There, coupled cluster methods often struggle, so we have to compare against as many baselines as possible to make sure we get a consistent answer. We looked at two benchmark stretched systems - the nitrogen molecule (N2) and the hydrogen chain with 10 atoms, (H10). Nitrogen is an especially challenging molecular bond, because each nitrogen atom contributes 3 electrons. The hydrogen chain, meanwhile, is of  interest for understanding how electrons behave in materials, for instance predicting whether or not a material will conduct electricity. On both systems, coupled cluster did well at equilibrium, but had problems as the bonds were stretched. Conventional VMC calculations did poorly across the board. But the FermiNet was among the best methods investigated, no matter the bond length.\n  We think the FermiNet is the start of great things to come for the fusion of deep learning and computational quantum chemistry. Most of the systems we’ve looked at so far are well-studied and well-understood. But just as the first good results with deep learning in other fields led to a burst of follow-up work and rapid progress, we hope that the FermiNet will inspire lots of work on scaling up and many ideas for new, even better network architectures. Already, since we first put our work on arXiv last year,  other  groups have shared their approaches to applying deep learning to first-principles calculations on the many-electron problem. We have also just scratched the surface of computational quantum physics, and look forward to applying the FermiNet to tough problems in material science and condensed matter physics as well. Mostly, we hope that by releasing the source code used in our experiments, we can inspire other researchers to build on our work and try out new applications we haven’t even dreamed of.\n Read the paper  here and view the code  here. With thanks to Jim Kynvin, Adam Cain and Dominic Barlow for the figures.\n  (1) The FermiNet also has streams for every pair of electrons, and information from these streams is passed back to the single-electron streams. For simplicity, we chose not to visualise this in the blog post, but details can be found in the paper.", "posttime": "2020-10-20 13:11:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "第一性,quantum,电子", "title": "费米网：从第一性原理开始的量子物理和化学", "title_en": "FermiNet: Quantum Physics and Chemistry from First Principles", "transed": 1, "url": "https://deepmind.com/blog/article/FermiNet", "via": "", "real_tags": ["第一性", "quantum", "电子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029959, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本网站上的所有歌词，无论是出版的还是未出版的，有版权的还是无版权的，都可以以任何方式下载和使用，不需要我的任何进一步许可，也不需要向我或其他任何人支付任何费用。\n汤姆·莱勒(Tom Lehrer)为他人的版权音乐写的一些歌词也包括在这里，但当然，未经版权所有者的许可，此类音乐不得使用。(翻译后的歌曲可以在YouTube上找到其原始语言的版本。)。\n换句话说，这里的所有歌词都应该被视为公有领域。\n特别地，特此允许任何人将这些歌词中的任何一个设置为他们自己的音乐，并出版或表演他们的版本，而不用担心法律诉讼。\n此权限仅适用于本网站上的歌词。汤姆·莱勒创作的大部分音乐将在稍后逐步添加，并有进一步的免责声明。\n注：本网站将于2024年12月31日关闭，因此如果您想下载任何东西，请不要等待太久。", "note_en": "All the lyrics on this website, whether published or unpublished, copyrighted or uncopyrighted, may be downloaded and used in any manner whatsoever, without requiring any further permission from me or any payment to me or to anyone else.\n Some lyrics written by Tom Lehrer to copyrighted music by others are included herein, but of course such music may not be used without permission of the copyright owners. (The translated songs may be found in their original languages on YouTube.)\n In other words, all the lyrics herein should be treated as though they were in the public domain.\n In particular, permission is hereby granted to anyone to set any of these lyrics to their own music and publish or perform their versions without fear of legal action.\n This permission applies only to the lyrics on this website. Most of the music written by Tom Lehrer will be added gradually later with further disclaimers.\n Note: This website will be shut down on December 31, 2024, so if you want to download anything, don’t wait too long.", "posttime": "2020-10-20 12:35:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,lehrer,音乐", "title": "汤姆·莱勒向公有领域发布歌曲歌词", "title_en": "Tom Lehrer releases song lyrics to public domain", "transed": 1, "url": "https://tomlehrersongs.com/", "via": "", "real_tags": ["发布", "lehrer", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "29462690e0c5aab8f1750c80206ff0d1.png", "infoid": 1029958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "模拟和混合信号设计一直很困难，但最近的一项调查表明，由于ASIC内的模拟电路超出了容忍度，该行业在过去一年中出现了显著的故障增加。\n故障数量激增的原因是什么？这只是数据上的小故障，还是这些问题是真的？答案很复杂，而且在很大程度上依赖于模拟调谐。\n图1：导致ASIC重新旋转的缺陷。资料来源：西门子旗下的Wilson Research and Mentor。\n西门子公司Mentor的AMS验证高级产品经理萨蒂什·巴拉苏布拉米安(Sathish Balasubramian)表示：“模拟调谐意味着，考虑到整个系统的背景，您需要非常清楚地了解模拟电路的性能，这是您需要在硅中实现的。”“而这需要与你从硅中获得的相当接近。”\nMentor的首席科学家哈里·福斯特(Harry Foster)分析了威尔逊研究/Mentor调查的结果，看看这种激增是仅限于最新技术节点的设计，还是更广泛。事实证明，虽然7 nm或更低的波长是那些遇到这个问题的人最流行的答案，但它只占到了大约16%的情况。几乎所有的节点，包括150 nm和更大的节点，都出现了这种类型的故障。\n第二个探索领域是这些问题是突然出现在大设计还是小设计上。结果可以在下面的图2中看到，但它清楚地表明，虽然所有设计规模都经历了与模拟调谐相关的问题的增加，但涉及最大设计的百分比最大。\n图2：按设计大小调整模拟电路缺陷。资料来源：西门子旗下的Wilson Research and Mentor。\n这个数字可信吗？Cadence高级产品经理Art Schaldenbrand表示：“跟踪模拟设计方法论进展的一种方式是，与其他元素相比，由于模拟设计的模拟元素而导致的现场故障百分比。”“在最近的一次VLSI测试研讨会上，有报道称95%的现场故障都是由于芯片设计的模拟元件造成的。模拟很难。模拟设计的挑战越来越难，模拟元素对设计的影响也越来越棘手。此外，模拟设计师面临的压力也越来越大。缩小模拟功率比缩小数字功率需要更多时间。这是因为我们必须重新设计我们在模拟领域所做的工作，以实现这一目标。“\n各种规模和技术节点的设计都遇到了越来越多的模拟问题。“在两个主要领域的推动下，ASIC正变得越来越复杂，”Mentor的Balasubramian说。其中之一将是向高级节点的迁移。但最大的驱动因素是复杂混合信号设计的数量正在增加。这主要是由于公司试图优化区域占用面积，以便在同一技术节点中包括模拟。每个人都在试图迁移到单一的基底，或单一的技术节点。这本身就带来了很多挑战。当团队需要接触到模拟设计，或者需要接触到高级节点的一些效果时--比如更低的门槛，比如在寄生方面非常挑剔--他们不能做一个示意性仿真，然后说一切都正常。\n该行业的一个重要增长领域来自物联网设备。Synopsys的模拟和混合信号应用工程经理Farzin Rasteh说：“当你关注移动、物联网或手持设备时，你会发现更多的模拟元件。”您将获得PLL、RF和高频调制电路。你会发现充电泵和运算放大器。而且所有这些设备都有传感器，本质上是模拟的。“。\n新节点意味着更多问题。Fraunhofer IIS自适应系统工程部高级混合信号自动化组经理Benjamin Prautsch表示：“在最新的技术节点，有新的东西需要学习，完全理解它们并将这些新效应融入工具和模型需要时间。”“例如，在最新的节点，变异性很难建模。当许多根效果进入画面时，寄生提取变得困难得多，隔离依赖于布局的效果可能需要时间，这可能会加剧寄生问题。“。\n其中一个新问题就是噪音。“台积电已经发表论文说，将模拟设计移植到更高的技术节点或先进的技术节点会带来它自己的挑战，”Balasubramian说。“最好的情况是一切正常，你可能很幸运。要做到这一点，你可能有很高的利润率。在大多数情况下，这将导致性能下降。但最坏的情况是它无法发挥作用。“。\n当你把噪音和变化无常结合在一起时，情况会变得更糟。Synopsys的Rasteh说：“考虑一下电压调节器或电荷泵，它为数据路径提供电力。”“如果这里面有变化，如果上面有噪音怎么办？噪声如何在信号和时钟的计时中表现出来，进而可能导致故障？什么类型的因果关系存在，在这些小几何体上，在这些高频下，皮秒的每一小部分都很重要？这些都是通常会导致失败的事情。“。\n有些问题会导致芯片失效，但可能需要重新旋转还有其他原因。Synopsys设计组的高级员工应用工程师Haran Thanikasalam说：“当涉及到变化时，最大的挑战是产量。”“我们依靠模拟来提供准确的基于西格玛的分析，这样他们就可以将其与产量下降联系起来。工具很难将不同的sigma值应用到电路的不同部分。因此，公司发出了测试芯片，这些芯片为各种分析提供了工具。他们可以推动硅的极限，然后在模拟和实际部件之间建立关联。“。\n对模拟技术的期望更高，即使工艺技术正朝着相反的方向发展，改善模拟性能的压力依然存在。“有了芯片内集成，就不再有简单的模拟/数字边界，”Balasubramian说。他说：“我们看到这样的设计架构，模拟驱动数字的地方没有单向通信。取而代之的是反馈循环。考虑PLL的数字校准。锁相环过去是纯模拟的，但今天他们增加了数字校准，以使其更快、更容易收敛。现在，您的基本模拟模块有一个数字组件，它不再是单向流。这需要更先进的方法论。“。\n拉斯特对此表示同意。“为了检查和调整，我们需要在设计中内置更多的智能。这可能包括带有反馈回路的自我控制，以监控这些事件的条件--无论是温度、接收到的信号功率、是否是错误检查机制、是否测量抖动或变化--以及自我校正和补偿。“\n这增加了失败的可能性。Rasteh补充说：“可配置模拟已经变得非常流行。”“这是您使用数字或软件指示模拟转到高功率模式或高频模式、更改电流源的输出或更改电荷泵的输出的地方。设计必须对极端条件、天气变化或外部因素具有弹性，当您在如此小的区域中封装如此多的内容时，会受到高频电路、数字电路到模拟电路的串扰噪声，反之亦然。这并不容易模拟和建模。“。\n推送性能所有的通信都依赖于模拟。至少会有串行设备驱动信号穿过恶劣的环境，而新版本的标准通常会对串行设备有更高的要求。“速度越快，精度就越高，”巴拉苏布拉米安说。“利润率越来越小，满足某些接口要求所需的速度意味着你必须考虑更多的物理影响。这在某些设计中并不容易实现，并且需要更多的调优。他们过去在签署模拟电路时甚至不考虑技术上发生的设备噪声。但是，设备噪音可能会增加到真正影响PLL性能的程度。“。\n接口中非常小的错误可能会导致灾难性故障。Rasteh说：“工艺变化可能会在存储器的读/写过程中产生错误或延迟。”“如果与时钟边缘相差零点几皮秒，就足以使读写变得不可靠。如果每30或40个写入中就有一个是错误的，这就足以使芯片或内存控制器变得毫无用处。我们将这些问题归因于变异和更高的频率。因此，对抖动或任何错误的容忍度要小得多。工艺变化会在这些频率或时钟相位或抖动中产生更大的变化。而且因为在绝对时间上几乎没有余地，这些设计在变化下的反应更加明显。“。\n更高的质量不仅速度加快，环境变得更加极端和嘈杂，一些市场也对质量提出了更高的要求。“任何用于汽车的芯片都需要极高的精度，”巴拉苏布拉米安说。“对于汽车行业来说，这意味着至少有5-sigma，可能还有6-sigma。在合理的时间内，他们不可能使用蒙特卡罗模拟来验证模拟电路。我们正在将机器学习技术引入变异分析。有了这一点，我们可以在有限数量的模拟中实现设备验证，而不是运行数十亿次模拟。“。\n这需要在开发过程中做出改变。Synopsys的Thanikasalam说：“运行多个角(PVT)模拟永远不会发现变异问题。”“他们必须利用来自铸造厂的统计模型，他们需要扫除整个范围，才能捕捉到这些问题.”\n前沿节点上的公司意识到了这一点。Fraunhofer的Prautsch说：“当过程和模型还在发展时，测试芯片就变得非常重要，可以成为验证提取的重要一步。”这些新的流程步骤很多都是从本质上非常手动开始的，在将重复性和/或容易出错的任务整合到工具中之前需要时间。\n可以处理其中许多问题的工具正在合并。Rasteh问道：“一个工具怎么能识别出设计中对输出影响最大的部分。”“设计的哪个部分对错误的潜在影响最大？如果您有PLL，并且PLL上的抖动对您非常重要，那么控制抖动对您来说也很重要。那么，设计的哪些部分最有可能影响到这一点呢？它是压控振荡器，还是反馈回路，还是电荷泵？“。\n结论虽然调查数字代表了需要模拟调谐的ASIC的极端跃升，但结果正确地识别了模拟设计在经历许多变化的过程中。那些处于极端边缘的人正经历着来自每个节点的持续的新挑战，并且他们相继变得更加复杂。可以对模拟进行调谐的测试芯片可能只是计划的一部分。\n对于遗留节点上的设计，这些团队可能会被打乱，因为他们必须第一次处理集成问题。许多传统的方法，其中模拟和数字是分开设计和验证的，现在必须重新考虑，这会影响团队活力。\n所有节点上的所有设计都被推向速度更快、功耗更低、产量更高的方向，而每一种设计都会逐渐增加复杂性。\n相关Analog知识中心关于Analog的热门故事、特别报道、视频、博客和白皮书。7 nm及以上模拟设计中的问题和解决方案，以及在许多高级封装中，所有器件都会受到噪声和邻近效应的影响。为什么模拟设计会失败模拟电路很久以前就不再遵循摩尔定律了，但这并不总是有帮助的。当电压显著降低时，边缘设备的完整性问题在较老的节点上会成为一个严重的问题，这对于电池供电的设备来说是一个严重的问题。低功耗模拟随着数字电源的下降，模拟电路的耗电量越来越引起人们的关注，但模拟设计者几乎没有工具来帮助他们。\n非常有趣的文章，谢谢布莱恩！几年前，我们在设计具有复杂模拟/混合信号、射频功能的下一代MCU平台时也面临着同样的挑战。很明显，我们需要在所有层次级别(包括模拟)进行正式的验证，并且我们提出了一种新的方法，使我们从5-10个体系结构错误(1p0到0个体系结构错误)中脱颖而出。诀窍是正式验证数字流中的每个IP，看起来它工作得很好，🙂", "note_en": "Analog and mixed signal design has always been tough, but a resent survey suggests that the industry has seen significantly increased failures in the past year because the analog circuitry within an ASIC was out of tolerance.\n What is causing this spike in failures? Is it just a glitch in the data, or are these problems real? The answer is complicated, and to a large extent it depends heavily on analog tuning.\n Fig. 1: Flaws contributing to ASIC re-spins. Source: Wilson Research and Mentor, a Siemens Business\n “Analog tuning means you need to be very clear about the performance of the analog circuit, given the context of the entire system, that you need to achieve in silicon,” says Sathish Balasubramian, senior product manager for AMS Verification at Mentor, a Siemens Business. “And that needs to be pretty close to what you get from silicon.”\n Harry Foster, chief scientist at Mentor, analyzed the results of the Wilson Research/Mentor survey to see whether the spike was restricted to designs at the latest technology nodes, or if it was more widespread. It turns out that while 7nm or below was the most popular answer for those experiencing the problem, it only accounted for about 16% of the cases. Almost all nodes, including 150nm and larger, were seeing these types of failures.\n A second area of exploration was whether these issues cropped up on large designs or small ones. The results can be seen in figure 2 below, but it clearly shows that while all design sizes are experiencing a rise in problems associated with analog tuning, the biggest percentage involves the largest designs.\n Fig. 2: Tuning analog circuit flaws by design size. Source: Wilson Research and Mentor, a Siemens Business\n Is the number believable? “One way to track the progress of analog design methodology is the percent of field failures due to analog elements of a design compared to other elements,” says Art Schaldenbrand, senior product manager at Cadence. “At a recent VLSI Test Symposium, it was reported that 95% of field failures are due to the analog elements of the design. Analog is difficult. The challenge of analog design is getting harder, and the impact of analog elements on the design are becoming more intractable. Plus, there are increasing pressures on analog designers. It takes more time to scale down analog power than it does to scale down digital power. This is because we have to re-architect what we’re doing in analog to achieve that.”\n Designs of all sizes and technology nodes are experiencing increasing problems with analog. “ASICs are getting more complex, driven by two main areas,” says Mentor’s Balasubramian. “One is going to be the migration to advanced nodes. But the biggest driver is that the number of complex mixed signal designs is increasing. This is mainly due to companies trying to optimize the area footprint to include analog within the same technology node. Everyone is trying to migrate to a single substrate, or a single technology node. That by itself poses a lot of challenges. When teams need to get exposure to analog design, or get exposed to some of the effects of advanced nodes — such as lower threshold, such as being really finicky in terms of parasitics — they can’t do a schematic simulation and say everything is working.”\n A significant area of growth for the industry is coming from IoT devices. “When you look at mobile or IoT or handheld devices, you will find lots more analog components,” says Farzin Rasteh, analog and mixed-signal applications engineering manager at Synopsys. “You will get PLLs, RF, and high frequency modulation circuits. You will find charge pumps and op amps. And all of these devices have sensors, which are analog in nature.”\n New nodes mean more issues. “At the latest technology nodes, there are new things to learn and it takes time to fully understand them and incorporate these new effects into tools and models,” says Benjamin Prautsch, group manager of advanced mixed-signal automation at Fraunhofer IIS’ Engineering of Adaptive Systems Division. “For example, at the latest nodes, variability is very difficult to model. Parasitic extraction becomes a lot more difficult when many root effects come into the picture, and it can take time to isolate layout-dependent effects, which can exacerbate the parasitic issues.”\n One such new issue is noise. “TSMC has published papers saying that porting an analog design into a higher technology node or advanced technology node comes with its own challenges,” says Balasubramian. “The best-case scenario is going to be that everything works and you’re probably lucky. To make that happen you probably have high margins. In most cases that will result in a performance hit. But the worst-case scenario is that it does not function.”\n When you combine noise and variability, things get worse. “Consider the voltage regulator, or the charge pump, which is providing power to a datapath,” says Synopsys’ Rasteh. “What if there is variation in that and what if there’s a noise on that? How does that noise manifests itself in the timing of the signals and clocks, which in turn could lead to failure? What type of cause effect relationships exist, at these small geometries, at these high frequencies, where every fraction of picoseconds matters? These are the kinds of things that usually lead to failures.”\n Some problems cause chips to fail, but there are other reasons why re-spins may be necessary. “The biggest challenge, when it comes to variation, is yield,” says Haran Thanikasalam, senior staff applications engineer in the Design Group at Synopsys. “We depend on simulation to provide an accurate sigma-based analysis, so that they can relate that to a yield fall-out. Tools have a difficult time applying different sigma values to different parts of the circuit. As a result, companies send out a test chip, and these provide a vehicle for all kinds of analysis. They can push the limits on the silicon, and then make the correlation between the simulations and the actual part.”\n Expecting more from analog There is continued pressure to improve analog performance even when the process technology is fighting in the opposite direction. “With in-chip integration, there is no longer a simple analog/digital boundary,” says Balasubramian. “We see designs architected such that there is no one way traffic where analog is driving digital. Instead, there are feedback loops. Consider the digital calibration of a PLL. A PLL used to be purely analog, but today they are adding digital calibration to make it faster and easier to converge. Now, your basic analog block has a digital component, and it’s not a uni-directional flow anymore. This requires more advanced methodologies.”\n Rasteh agrees. “To check and adjust, we need more intelligence built into the design. This may include self control with a feedback loop to monitor the conditions for these events — whether it’s temperature, signal power that it is receiving, whether it’s an error-checking mechanism, whether it’s measuring the jitter or variation — and self-correct and compensate for it.”\n This creates additional potential for failure. “Configurable analog has become very trendy,” adds Rasteh. “This is where you use digital or software to instruct analog to go to high power mode or high frequency mode, change the output of a current source, or change the output of a charge pump. Designs have to be resilience to extreme conditions, weather variation, or external factors, and when you pack so much in such a small area, you get crosstalk noise from high frequency circuits, digital circuits to analog, or vice versa. That’s not easy to simulate and model.”\n Pushing performance All communications rely on analog. At a minimum there will be a SerDes driving the signal across a harsh environment, and new versions of standards normally come with greater demands on the SerDes. “With more speed you need to have more accuracy,” says Balasubramian. “The margins are getting smaller and the speeds necessary to satisfy some of the interface requirements mean you have to take into account many more physical effects. That’s not easy to achieve in some designs, and it requires a lot more tuning. They used to sign off analog circuits without even taking into account the device noise that happens on a technology. But device noise can increase to the point where it really affects the performance of the PLL.”\n Very small errors in interfaces can lead to catastrophic failures. “Process variation could produce errors or delays in the read/write of a memory,” says Rasteh. “If you miss that clock edge by a fraction of a picosecond, it’s enough to make read and write unreliable. If one out of every 30 or 40 writes is erroneous, that’s enough to make the chip or memory controller useless. The primary factor we attribute these problems to is variation and higher frequencies. So the tolerance for jitter or any mistakes is much less. Process variations create bigger variations in those frequencies or clock phases, or jitters. And because there is little margin in terms of absolute time, these designs react in a more pronounced way under variation.”\n Higher quality Not only are speeds going up and environments getting more extreme and noisier, some markets are demanding higher quality. “Any chip that goes into automotive requires extreme precision,” says Balasubramian. “For automotive, that means at least 5-sigma and possibly 6-sigma. There is no way in a reasonable time, that they can verify analog circuitry using Monte Carlo simulation. We are bringing machine learning technologies into variation analysis. With this we can make device verification possible in a limited number of simulations, rather than running billions of simulations.”\n This requires a change in the development process. “Running multiple corner (PVT) simulations is never going to catch variation problems,” says Synopsys’ Thanikasalam. “They have to make use of statistical models that come from the foundry, and they need to sweep the entire range in order to catch these problems.”\n Companies on the leading-edge nodes are aware of this. “When the process and the models are still evolving, test chips become highly important and can be an important step in validating extraction,” says Fraunhofer’s Prautsch. “Many of these new process steps start off being very manual in nature, and it takes time before repetitive and/or error-prone tasks can be incorporated into tools.”\n Tools are merging that can deal with many of these issues. “How could a tool identify parts of your design that have the most effect on the output,” asks Rasteh. “Which part of the design is potentially contributing most to an error? If you have a PLL, and the jitter on that PLL is extremely important to you, controlling the jitter is important to you. So which parts of the design are the most likely to impact that? Is it a VCO, is it a feedback loop, a charge pump?”\n Conclusion While the survey number represents an extreme jump in ASICs that require analog tuning, the results correctly identify that analog design in going through many changes. Those at the extreme edge are experiencing a continuation of new challenges that come with each node, and they successively get more complex. Test chips, where the analog can be tuned, may just be part of the plan.\n For designs on legacy nodes, those teams potentially are being disrupted as they have to deal with integration issues for the first time. Many of the legacy methodologies, where analog and digital were designed and verified separately, are having to be rethought and that impacts team dynamics.\n All designs at all nodes are being pushed to be faster, use less power, and achieve higher yields, and each of those incrementally adds to the complexity.\n Related  Analog Knowledge Center Top stories, special reports, videos, blogs and white papers about Analog.  Problems And Solutions In Analog Design At 7nm and beyond, and in many advanced packages, all devices are subject to noise and proximity effects.  Why Analog Designs Fail Analog circuitry stopped following Moore’s Law a long time ago, but that hasn’t always helped.  Integrity Problems For Edge Devices Noise becomes a significant issue at older nodes when voltage is significantly reduced, which is a serious issue for battery-powered devices.  Low-Power Analog The amount of power consumed by analog circuits is causing increasing concern as digital power drops, but analog designers have few tools to help them.\n          Very interesting article, thank you Brian! We faced the same challenge a few years ago when architecting the next generation MCU platform with complex analog / mixed signal, RF functionality. It was clear we needed a formal verification at all hierarchy levels, including analog and we came up with a new methodology that brought us from having 5-10 architecture bugs at 1p0 to 0 architecture bugs. The trick was to formally verify each IP within the digital flow, and it seemed it worked quite well 🙂", "posttime": "2020-10-20 12:35:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "analog,模拟", "title": "模拟问题的增加", "title_en": "Increase in Analog Problems", "transed": 1, "url": "https://semiengineering.com/increase-in-analog-problems/", "via": "", "real_tags": ["analog", "模拟"]}, {"category": "", "categoryclass": "", "imagename": "9569daa7abcf3e47a3936f09c6946e58.png", "infoid": 1029957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "弗兰克·赫伯特(Frank Herbert)1965年小说《沙丘》(Dune)的粉丝们本周失望地得知，丹尼斯·维伦纽夫(Denis Villeneuve)备受期待的根据该书改编的电影被推迟到2021年10月上映，几乎比预期晚了一年。\n“沙丘”是科幻小说的经典之作，在很多方面标志着这一类型的普及。在维伦纽夫手中，这部电影蓄势待发，从2020年9月9日发布的第一支也是唯一一支预告片中散发出的轰动之声依然清晰可见。\n但熟悉这本书的粉丝们注意到了它的宣传材料中的一个重大遗漏：没有提到这部小说受到伊斯兰教启发的框架。事实上，预告片使用了“十字军东征即将到来”这一词，使用了基督教术语来表示圣战-这种情况在原版系列的六本书中只发生了三次。他们要找的词是“圣战”，这是一个基础性的术语，也是该系列中的一个基本概念。但圣战是糟糕的品牌宣传，在好莱坞，伊斯兰教除非受到枪击，否则是不会卖出去的。\n“沙丘”是根据弗兰克·赫伯特1965年的科幻小说改编的第二部电影。故事背景设定在大约2万年后的沙漠星球Arrakis上，讲述了一场争夺其主要出口产品控制权的战争：允许瞬间太空旅行的改变思想的香料混合物。这个星球上的土著居民，弗里曼人，为了获得这种香料而受到压迫。故事开始于一座新的贵族宅邸接管了这个星球，故事的中心是公爵的儿子保罗。\n预告片中使用的“十字军东征”掩盖了这样一个事实，即该系列充斥着来自阿拉伯语、波斯语和土耳其语的伊斯兰教词汇。像“迈赫迪”、“沙伊-胡鲁德”、“努克”和“雅雅乔哈达”这样的词在整个故事中都是常用的。引用赫伯特自己1978年对蒂姆·奥莱利(Tim O‘Reilly)的一次未发表的采访，他使用了这个部分源自“口语阿拉伯语”的词汇，向读者发出这样的信号：他们“现在不在这里，但此时此刻的某些东西已经带到了那个遥远的地点和时间”。他说，语言“是塑造心灵的，也是心灵使用的”，它调解了我们对时间和地点的体验。他用沙丘的语言来展示，两万年后，当所有的宗教和语言都发生了根本性的变化时，我们世界的阿拉伯语和伊斯兰教仍然有延续的线索，因为它们与人类的过去、现在和未来是分不开的。\n快速浏览一下弗兰克·赫伯特(Frank Herbert)的“沙丘宗教”附录，就会发现在“十大古代教义”中，有一半是公开的伊斯兰教义。在宗教领域之外，他用与伊斯兰主权相关的词语填充了沙丘宇宙的术语。皇帝们被称为“帕迪沙”，源自波斯，他们的观众席被称为“selamlik”，土耳其语是奥斯曼帝国宫廷接待厅的意思，他们的军队有土耳其-波斯或阿拉伯根源的头衔，如“Sardaukar”、“Caid”和“Bashar”。赫伯特的未来是这样的：“伊斯兰教”不是属于过去的一个独立的、不变的元素，而是未来宇宙各个层面的一部分。沙丘的世界离不开它的语言，正如推特上的反应所显示的那样，电影宣传材料中没有这种语言是令人失望的。即使是圣战，赫伯特宇宙的一个复杂的基本原则，也被扁平化和基督化为十字军东征。\n可以肯定的是，赫伯特自己使用了“十字军东征”这个词来定义圣战，两次在叙述中作为圣战的同义词，一次在词汇表中作为他对圣战定义的一部分，也许是为了达到他的读者可能熟悉的一个简单的概念上的相似之处。但是，尽管他显然将十字军东征纳入了圣战，但他的大部分读者却适得其反。\n这是可以理解的。甚至在反恐战争之前，圣战就是坏人的所作所为。然而，正如赫伯特所理解的，这个词在穆斯林传统中是一个复杂的词；从根本上说，它的意思是奋斗或努力。它可以有多种形式：内部反对自己的邪恶，外部反对压迫，甚至在智力上寻求有益的知识。在伊斯兰教14个世纪的历史中，就像人类历史的任何方面一样，圣战这个词一直被使用和滥用。在研究了富勒顿加州州立大学档案馆中弗兰克·赫伯特的笔记和论文后，我发现赫伯特对伊斯兰教、圣战和人类未来的理解比他的翻译复杂得多。他对圣战的使用迎合了这一复杂的传统，既是作为一种与困难作斗争的力量(无论是对抗有知觉的人工智能还是对抗帝国本身)，也是一种挑战任何控制企图的力量。\n赫伯特对圣战的细致入微的理解在他的叙述中表现了出来。他并不打算将圣战简单地描述为一件“坏的”或“好的”事情。相反，他用它来展示救世主般的冲动，以及有时随之而来的世界末日般的暴力，是如何以无法控制和不可预测的方式改变世界的。当然，在写于20世纪50年代和60年代的文章中，弗兰克·赫伯特的圣战与我们的不同，而是借鉴了19世纪和20世纪中期苏菲领导的反对法国、俄罗斯和英国帝国主义的圣战。故事展示了苏菲主义的影响及其对圣战的解读，与十字军东征不同的是，在圣战中，领导人的精神转变决定了他的战争的合法性。\n在沙丘，保罗必须喝“生命之水”，进入(引用沙丘)“阿拉姆·米塔尔，相似的世界，所有身体限制都被消除的形而上学领域”，并解锁他的意识的一部分，成为迈赫迪，将指导圣战的救世主人物。这个过程的每一个方面的语言都是苏菲主义的技术语言。\n也许预告片中使用的“十字军东征”只是一个营销问题。也许这部电影会接受弗兰克·赫伯特(Frank Herbert)笔下宇宙特有的伊斯兰语言和美学。但是，如果我们追溯“沙丘”对“强烈的穆斯林味道”的接受，以呼应赫伯特早期草稿中的一位编辑，我们就会面临伊斯兰教在美国大众想象中的不利地位。事实上，许多人渴望通过过去来解读沙丘，渴望与这些未来的事件在历史上相提并论，因为在他们看来，伊斯兰教属于过去。然而，谁存在于未来，就会告诉我们现在谁才是最重要的。三次获得雨果奖的作家NK Jemisin写道：“”星际迷航“在我脑海中植入的神话是：像我这样的人在未来是存在的，但我们只有少数人。在接下来的几个世纪里，很明显会有什么东西会杀死数十亿有色人种和大多数女性。“。\n杰米辛提醒我们这个问题：“谁能成为未来的一部分？”\n当导演或编剧把人们从未来中剔除时，当导演把伊斯兰教从未来中剔除时，他们也暴露了自己的期望和焦虑。它们展现了一种对种族灭绝、大规模死亡和粉饰的未来的畅想，没有当代世界的任何“混乱”。那个“烂摊子”是其他人，那些反抗控制的人。\n与他或我们的许多同时代人不同，赫伯特愿意想象一个不以西方基督教神话为基础的世界。这不仅仅是他自己的利基兴趣。即使在20世纪中叶，很明显，仅根据人口统计数据，伊斯兰教就会给未来涂上浓墨重彩的一笔。今天，随着全球穆斯林人口接近人类的四分之一，这一点变得更加明显。虽然这听起来像是另类右翼的噩梦/幻想，但赫伯特并不认为伊斯兰教是“博格人”，一个不允许持不同政见的外星人蜂巢思维。赫伯特的伊斯兰教是沙哈布·艾哈迈德(Shahab Ahmed)在其不朽的著作“伊斯兰教是什么”(What Is Islamic)中最近阐述的伟大的、宽广的、经常相互矛盾的论述。赫伯特明白宗教是不会行动的。人们在行动。他们的宗教就像他们的语言一样，随着时间的推移慢慢地改变，以应对新的时间和地点的挑战。数万年后的未来，赫伯特的整个宇宙充满了未来的伊斯兰主义者，与现在和过去的伊斯兰主义者相似但又不同。\n赫伯特反驳了对伊斯兰教的单向度解读，因为他否认绝对。在一篇题为“科幻小说与危机中的世界”的文章中，他认为对绝对的信仰是“西方的特征”，对西方应对危机的方式产生了负面影响。他写道，这导致“西方传统”面临“绝对控制概念”的问题。这种对绝对控制权的渴望导致了定义我们当代世界的英雄崇拜(或“弥赛亚建设”)。正是这种冲动，他试图在沙丘上摧毁。\n在另一篇名为“其他星球上的人”的文章中，赫伯特告诫不要重复陈词滥调，提醒作家质疑他们对时间、社会和宗教的基本假设。他鼓励他们具有颠覆性，因为科幻小说“允许你超越那些被你的社会禁止的文化规范，并在享有声望的出版领域通过有意识(和无意识)的文学审查来强制执行这些规范”。\n我们应该承认赫伯特在探索伊斯兰教和宗教时没有对它们进行必要的改造，而不是将它们降格为植根于永恒的原始模式的陈词滥调，或者将它们降级到迷信的类人外星人的领域。但在同一篇文章中，他警告说，“如果它变得太有声望，科幻小说将遇到新的限制”，表达了对自我审查在面对体面时隐约可见的力量的担忧。不幸的是，他是对的，至少到目前为止，他自己作品中的颠覆性元素似乎已被纳入基督化的“十字军东征”中，这些颠覆性元素嵌入到他对“圣战”的深入探索中。让我们希望这额外的一年能让这部电影做得更好。\n本文表达的观点是作者自己的观点，不一定反映半岛电视台的编辑立场。", "note_en": "Fans of Frank Herbert’s 1965 novel, Dune, were disappointed to learn this week that the release of Denis Villeneuve’s much-anticipated film adaptation of the book has been  pushed back to October 2021, almost a year later than expected.\n Dune is a foundational classic of science fiction and marks, in many ways, the popularisation of the genre. In the hands of Villeneuve, the film is poised to be a blockbuster, and the buzz that emanated from its first and only  trailer, released on September 9, 2020, is still palpable.\n But fans familiar with the books noticed a major omission in its promotional materials: any reference to the Islam-inspired framing of the novel. In fact, the trailer uses the words, “a crusade is coming”, using the Christian term for holy war – something that occurs a mere three times in the six books of the original series. The word they were looking for was “jihad”, a foundational term and an essential concept in the series. But jihad is bad branding, and in Hollywood, Islam does not sell unless it is  being shot at.\n Dune is the second film adaptation of the popular 1965 science fiction novel by Frank Herbert. Set approximately 20,000 years in the future on the desert planet Arrakis, it tells the story of a war for control of its major export: the mind-altering spice melange that allows for instantaneous space travel. The Indigenous people of this planet, the Fremen, are oppressed for access to this spice. The story begins when a new aristocratic house takes over the planet, centring the narrative on the Duke’s son Paul.\n The trailer’s use of “crusade” obscures the fact that the series is full of vocabularies of Islam, drawn from Arabic, Persian, and Turkish. Words like “Mahdi”, “Shai-Hulud”, “noukker”, and “ya hya chouhada” are commonly used throughout the story. To quote Herbert himself, from an unpublished 1978  interview with Tim O’Reilly, he used this vocabulary, partly derived from “colloquial Arabic”, to signal to the reader that they are “not here and now, but that something of here and now has been carried to that faraway place and time”. Language, he remarks, “is mind-shaping as well as used by mind”, mediating our experience of place and time. And he uses the language of Dune to show how, 20,000 years in the future, when all religion and language has fundamentally changed, there are still threads of continuity with the Arabic and Islam of our world because they are inextricable from humanity’s past, present, and future.\n A quick look at Frank Herbert’s  appendix to Dune, “the Religion of Dune”, reveals that of the “ten ancient teachings”, half are overtly Islamic. And outside of the religious realm, he filled the terminology of Dune’s universe with words related to Islamic sovereignty. The Emperors are called “Padishahs”, from Persian, their audience chamber is called the “selamlik”, Turkish for the Ottoman court’s reception hall and their troops have titles with Turco-Persian or Arabic roots, such as “Sardaukar”, “caid”, and “bashar”. Herbert’s future is one where “Islam” is not a separate unchanging element belonging to the past, but a part of the future universe at every level. The world of Dune cannot be separated from its language, and as reactions on Twitter have shown, the absence of that language in the movie’s promotional material is a disappointment. Even jihad, a complex, foundational principle of Herbert’s universe, is flattened – and Christianised – to crusade.\n To be sure, Herbert himself defines jihad using the term “crusade”, twice in the narrative as a synonym for jihad and once in the glossary as part of his definition of jihad, perhaps reaching for a simple conceptual parallel that may have been familiar to his readership. But while he clearly subsumed crusade under jihad, much of his readership did the reverse.\n One can understand why. Even before the War on Terror, jihad was what the bad guys do. Yet as Herbert understood, the term is a complicated one in the Muslim tradition; at root, it means to struggle or exert oneself. It can take many forms: internally against one’s own evil, externally against oppression, or even intellectually in the search for beneficial knowledge. And in the 14 centuries of Islam’s history, like any aspect of human history, the term jihad has been used and abused. Having studied Frank Herbert’s notes and papers in the archives of California State University, Fullerton, I have found that Herbert’s understanding of Islam, jihad, and humanity’s future is much more complex than that of his interpreters. His use of jihad grapples with this complicated tradition, both as a power to fight against the odds (whether against sentient AI or against the Empire itself), but also something that defies any attempt at control.\n Herbert’s nuanced understanding of jihad shows in his narrative. He did not aim to present jihad as simply a “bad” or “good” thing. Instead, he uses it to show how the messianic impulse, together with the apocalyptic violence that sometimes accompanies it, changes the world in uncontrollable and unpredictable ways. And, of course, writing in the 1950s and 1960s, the jihad of Frank Herbert’s imagination was not the same as ours, but drew from the Sufi-led jihads against French, Russian, and English imperialism in the 19th and mid-20th century. The narrative exhibits this influence of Sufism and its reading of jihad, where, unlike in a crusade, a leader’s spiritual transformation determined the legitimacy of his war.\n In Dune, Paul must drink the “water of life”, to enter (to quote Dune) the “alam al-mithal, the world of similitudes, the metaphysical realm where all physical limitations are removed,” and unlock a part of his consciousness to become the Mahdi, the messianic figure who will guide the jihad. The language of every aspect of this process is the technical language of Sufism.\n Perhaps the trailer’s use of “crusade” is just an issue of marketing. Perhaps the film will embrace the characteristically Islam-inspired language and aesthetics of Frank Herbert’s universe. But if we trace the reception of “the strong Muslim flavour” in Dune, to echo an editor on one of Herbert’s early drafts, we are confronted with Islam’s unfavourable place in America’s popular imagination. In fact, many desire to interpret Dune through the past, hungering for a historic parallel to these future events because, in their minds, Islam belongs to the past. Yet who exists in the future tells us who matters in our present. NK Jemisin, the three-time Hugo award-winning author,  writes: “The myth that Star Trek planted in my mind: people like me exist in the future, but there are only a few of us. Something’s obviously going to kill off a few billion people of colour and the majority of women in the next few centuries.”\n Jemisin alerts us to the question: “Who gets to be a part of the future?”\n When a director or writer casts people of colour out of the future, when a director casts Islam out of the future, they reveal their own expectations and anxieties. They reveal an imagination at ease with genocide, with mass death, and with a whitewashed future that does not have any of the “mess” of the contemporary world. That “mess” is other people, people who defy control.\n Unlike many of his, or our, contemporaries, Herbert was willing to imagine a world that was not based on Western, Christian mythology. This was not just his own niche interest. Even in the middle of the 20th century, it was obvious that the future would be coloured by Islam based on demographics alone. This is clearer today as the global Muslim population nears a quarter of humanity. While this sounds like an alt-right nightmare/fantasy, Herbert did not think of Islam as the “borg”, an alien hive mind that allows for no dissent. Herbert’s Islam was the great, capacious, and often contradictory discourse recently expounded by Shahab Ahmed in his monumental book, What is Islam? Herbert understood that religions do not act. People act. Their religions change like their languages, slowly over time in response to the new challenges of time and place. Tens of thousands of years into the future, Herbert’s whole universe is full of future Islams, similar but different from the Islams of present and past.\n Herbert countered a one-dimensional reading of Islam because he disavowed absolutes. In an essay titled: Science Fiction and a World in Crisis, he identified the belief in absolutes as a “characteristic of the West” that negatively influenced its approach to crisis. He wrote that it led the “Western tradition” to face problems “with the concept of absolute control”. This desire for absolute control is what leads to the hero-worship (or “messiah-building”) that defines our contemporary world. It is this impulse that he sought to tear down in Dune.\n In another essay, Men on Other Planets, Herbert cautions against reproducing cliches, reminding writers to question their underlying assumptions about time, society, and religion. He encourages them to be subversive, because science fiction “permits you to go beyond those cultural norms that are prohibited by your society and enforced by conscious (and unconscious) literary censorship in the prestigious arenas of publication”.\n We should recognise Herbert for exploring Islam and religion without essentialising them, without reducing them to a cliché grounded in a timeless original model or relegating them to the domain of superstitious humanoid aliens. But in the same essay, he warned that “if it becomes too prestigious, science fiction will encounter new restraints”, expressing worry about the looming power of self-censorship in the face of respectability. Unfortunately, he was right, and it seems like the subversive elements of his own work, embedded in his deep exploration of “jihad”, have been subsumed into the Christianising “crusade”, at least so far. Let’s hope this extra year allows the film to do better.\n The views expressed in this article are the author’s own and do not necessarily reflect Al Jazeera’s editorial stance.", "posttime": "2020-10-20 12:16:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "雷季斯,paul,伊斯兰教", "title": "在沙丘，保罗·阿特雷季斯领导了一场圣战，而不是十字军东征。", "title_en": "In Dune, Paul Atreides led a jihad, not a crusade", "transed": 1, "url": "https://www.aljazeera.com/opinions/2020/10/11/paul-atreides-led-a-jihad-not-a-crusade-heres-why-that-matters/", "via": "", "real_tags": ["雷季斯", "paul", "伊斯兰教"]}]