[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1006406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎收看有关如何消除系统性种族主义的奇幻世界资源总览。\n作为对我们国家普遍存在的种族不公正的回应，我决定创建一个社区来源的数据库，以帮助我的追随者-以及整个互联网-与系统性种族主义和白人至上主义作斗争。\n我创办了帕蒂娅的“幻想世界”，作为一个私人页面，与我的密友们分享幽默，重点放在黑人文化上。最终，我将这个页面公之于众，并积累了一批追随者。在亲密的朋友和同事网络的帮助下，以及几个不眠之夜的帮助下，我创建了一份主清单指南，以帮助消除种族主义。通过我的平台，这本指南已经在互联网上流传，接触到了一些我从未想象过的人。\n由于反响热烈，我们已经将主名单变成了一个网站，我们希望这个网站将继续培养人们对黑人生命也是运动的认识和支持。\n是什么让一个社区变得健康和安全？这份文件并没有提供所有的答案，但它承认，对于我们中的许多人来说，警察不是解决方案的一部分。种族主义、性别歧视、同性恋恐惧症、变性人恐惧症和欺凌的模式太常见了。当某人有心理健康危机时，或者当邻居担心邻居时，或者当我们感到不安全时-警察是我们唯一的选择吗？当然，不同的社区有不同的需求。充满活力、充满活力、没有警察的社区不会由外部团体创建--它们将从这些空间中已经存在的土壤中茁壮成长。然而，我们在这里可以分享的是，这个过程在其他地方看起来是什么样子。以下是一些工具、想法和策略：\n1.一个简单的办法：当显然没有必要报警时，不要再报警。我们不能告诉你永远不要报警(尽管有些人确实做出了那样的选择)。然而，我们可以挑战你，让你反思这一选择，以确保打电话给他们不会是对个人不适或不确定的每一个时刻的自动反应。永远不要忘记：一个人的不便，一旦警方介入，可能会成为另一个人的死刑判决。\n2.接受急救、缓解危机、恢复性司法等方面的培训。我们与邻居和家人分享的技能越多，我们对不负责任的准军事部队的依赖就越少！找到或组织当地的培训，并分享这些知识。\n3.始终建立社区，而不仅仅是在遇到麻烦的时候。这不仅仅是关于个人能力的建设，也是关于培养有弹性的社区。对于不再需要警察的社区，我们可以采取的第一步之一就是彼此会面。我们可以知道邻居的名字。我们可以举行家常便饭，志愿帮助我们的邻居做一些简单的事情，比如铲雪或搬杂货，并建立真正的关系。这样，当危机发生时，除了警方，我们还有其他资源可以求助。\n4.如果你确实需要警察，那就去找他们，而不是叫他们来找你。从杂志上看，要做的12件事不是打电话给警察：如果你的东西被偷了，你需要出于保险或其他目的提交一份报告，考虑去警察局，而不是把警察带到你的社区。你可能会不经意间把你附近的人置于危险之中。\n5.面对心理健康危机，记住要以处于危机中的人为中心。从文章“帮助处于精神健康紧急情况下的人而无需报警的5种方法”(塔斯特罗姆)中可以看出：记住，有精神健康危机的人是一个人，他们的意愿应该尽可能安全地得到遵守。(塔斯特罗姆)(Tstrom)：记住，有精神健康危机的人是一个人，他们的意愿应该尽可能安全地遵循。最好的干预策略将是人们购买并自愿做的事情。我们这些有精神健康问题的人很可能因为医生和其他从业者不听我们的话或做违背我们意愿的事情而受到创伤。所有这一切都是与背景相关的，没有绝对的，但当你考虑采取什么行动时，请考虑一下创伤。\n6.列出你可以拨打的当地服务/热线，而不是警察。从家庭暴力危机中心，到无家可归者的庇护所，再到心理健康支持小组，再到一系列其他类型的倡导者和服务提供者，找到能够处理警察往往没有能力处理的危机的人。按照惯例，找出哪些涉及警察，哪些不会把名单挂在冰箱上。把这些联系人留在你的手机里。复印一份，交给朋友和邻居。\n7.支持那些真正让我们的社区保持健康的组织。关于这一点：在存在这些服务的地方，无论是通过志愿服务、捐赠，还是向市/县/等政府游说资金，都要予以支持。警察的一些很好的替代方案已经存在；他们只是经常资金严重不足。更进一步：我们如何才能战略性地将警察的资源重新分配给真正帮助人们的服务？在投资社区的同时从警察手中撤资的运动可能会提供一条前进的道路。\n8.放大视图，在您所在的位置找到解决方案。在全国范围内，积极分子正在想方设法改变这种说法，并做这项工作。教师和家长们正在开展“学校尊严”(Dignity In School)、“辅导员而不是警察”(Dignity In School)等活动。LGBTQ团体正在取消警察参加骄傲游行的邀请。以前被监禁的人正在组织导师网络，甚至是手无寸铁的社区调解队。像性工作者外联项目这样的组织正在努力解决污名和刑事化问题。教堂承诺不会报警。从毒品合法化，到拆除从学校到监狱的管道，到废除ICE，甚至更多-每一步都让我们更接近一个没有警察的未来。\n9.从事能预防犯罪，而不仅仅是惩治犯罪的政策工作。当我们问人们是什么让你的社区保持健康和安全的时候？我们听到的答案往往非常相似：负担得起的住房、工作、青年项目、创作和体验艺术的机会、欢迎公园等。我们可以通过参与有能力做这项预防性工作的活动组织、社区团体、学校董事会等来培育更安全、更健康的社区。\n10.有更大的梦想：警察之前有一段时间，警察之后也会有一段时间。我们需要的一些解决方案还不存在。我们现在可以做一些事情，但这项工作也是关于播种的。迈向无警察未来的重要第一步就是能够想象未来会是什么样子。我们必须打破警察是社会中不可避免的、不可替代的一部分的旧思维。他们不是。我们有更好的方法来保持我们社区的健康和安全，这些方法不包括暴力、压迫和不负责任的警察部队的包袱。查看这里提到的各种来源。做更多的研究，进行更多的对话，帮助建立你想要生活的世界。\n很多人一直在找我，看看如果他们不能站出来和这些革命者一起抗议，他们能帮上什么忙，所以我和一些朋友花时间列出了一份你可以做的事情的清单。去你适合的地方。每个人都在革命中发挥作用。\n报警往往会使局势升级，将人们置于危险之中，并导致暴力事件。每当你向警察寻求帮助时，你就是在邀请他们进入你的社区，并将那些可能已经脆弱的人置于危险的境地。有时人们觉得报警是处理问题的唯一办法。但我们可以建立值得信赖的互助网络，使我们自己能够更好地处理冲突，走向变革性的正义形式，同时让警察远离我们的社区。1.不要觉得有义务保护财产，特别是公司的私人财产。在与人对峙或联系警察之前，问问自己是否有人因财物被盗或损坏而受到伤害或危害。如果答案是否定的，那就顺其自然吧。\n2.如果你的东西被偷了，你需要为保险或其他目的报案，考虑去警察局，而不是把警察带到你的社区。你可能会不经意间把你附近的人置于危险之中。\n3.如果你观察到某人表现出在你看来很奇怪的行为，不要认为他们当众喝醉了。创伤性脑损伤或类似的医疗事件可能正在发生。询问他们是否还好，是否有健康状况，是否需要帮助。\n4.如果你看到有人因为汽车故障停在路边，停下来问问他们是否需要帮助，或者你是否可以为他们叫一辆拖车。如果警方被介绍到这种情况，他们可能会给有车问题的人开惩罚性的和不必要的罚单，把目标对准那些没有证件的人，或者更糟。\n5.保留社区资源的联系人列表，如自杀热线。当警方被联系来处理这样的情况时，患有精神疾病的人被警察杀害的可能性是那些没有精神健康问题的人的16倍。\n6.克制一下你是否有冲动去报警，因为你认为某人的长相或行为可疑。他们的种族、性别、民族、阶层或住房状况是否会影响你的选择？这样的电话对许多人来说可能是死刑。\n7.鼓励教师、同事和组织者避免邀请警察进入教室、工作场所和公共场所。相反，创造一种互相照顾的文化，而不是无意中将人们置于危险之中。如果你是正在举行集会或示威的团体中的一员，不要获得许可或以其他方式与警方合作。\n8.如果你的邻居正在开派对，噪音打扰了你，你可以走过去和他们谈谈。通过像每月街区聚会这样的社区活动来了解你的邻居是一个很好的方式，可以让要求他们安静一点的感觉不那么不舒服，或者找到另一个愿意这样做的邻居。\n9.如果你看到有人在公共场合小便，就把脸转开！例如，请记住，许多没有房子的人没有可靠的洗手间通道。\n10.在你的邻居、学校、工作场所或社区组织举办并参加降级、解决冲突、急救、志愿医生和自卫研讨会。\n11.街头艺术太美了！不要报道涂鸦和其他街头艺术家。如果你看到包含法西斯主义或仇恨言论的作品，请自己或与朋友一起涂鸦。\n12.记住，警察可能会使家庭暴力情况升级。你可以支持那些被施虐者伤害的朋友和邻居，为他们提供住宿的地方，搭车到安全的地方，或者照看他们的孩子。利用社区资源，如安全屋和热线。\n支付租金原住民应该有权控制收到的任何租金。支付租金是关于非土著人民尊重土著人民的主权。付房租是为了恢复原状。https://paytherent.net.au/https://paytherent.net.au/about-us/https://actionnetwork.org/fundraising/yes-im-going-to-pay-the-rent-every-month。\n支持澳大利亚原住民和托雷斯海峡岛民正义、权利和尊重的ANTAR全国组织和个人网络https://antar.org.au/donate-antar。\nDijrra向所有土著妇女，特别是目前正在经历家庭暴力或过去遭受过家庭暴力的土著人民提供实际支助。https://djirra.org.au/https://www.givenow.com.au/fvpls。\nGunawirra(创伤治疗)通过艺术疗法为土著和托雷斯海峡岛民妇女和儿童提供治疗。https://gunawirra.org.au/donate/\n致命联系(与土著儿童、年轻人、成年人、家庭和社区合作，打破劣势和创伤的代际循环--特别是那些受到儿童保护和/或司法系统https://www.deadlyconnections.org.au/deadlyway-donate.html影响的人。\n改变创纪录的捐款页面(努力结束对土著和托雷斯海峡岛民的监禁和家庭暴力行为。https://changetherecord.org.au/donate。\n释放人们GoFundMe(#34；释放她)由Sisters Inside Inc.运营的倡议。为被监禁并有逮捕令的土著妇女支付罚款。https://www.gofundme.com/f/bfvnvt-freethepeople?utm_source=twitter&amp；utm_medium=social&amp；utm_campaign=m_pd+share-sheet。\n文献/文章&一般资源链接页面乌鲁鲁声明资源(链接到过去十年土著和托雷斯海峡岛民宪法改革的发展。https://ulurustatement.org/resources。\n托洛茨基纲领(反资本主义的另类媒体来源)致力于建立一个消除剥削劳工、种族主义、压迫妇女和殖民征服的社会主义社会。卫报https://www.trotskyistplatform.com/racist-rich-peoples-court-whitewashes-state-killing-of-david-dungay/https://www.trotskyistplatform.com/category/anti-racism/https://www.trotskyistplatform.com/category/aboriginal-struggle/(为所有当前媒体标记在押期间死亡的文章。https://www.theguardian.com/australia-news/deaths-in-custody。\n土著语言研究股(该项目旨在提供澳大利亚每种土著语言的50个单词。https://50words.online/。\n由加里·福利教授设立。你需要的一切都在这个网页上；历史、新闻文章等。http://www.gooriweb.org/。\nAlethea Beetson@aletheaincolor非常有帮助的资源链接页面(上面已经提到了一些捐赠链接，但也有有用的阅读材料/文献和文章：https://linktr.ee/aletheaincolour\nTEDx悉尼--澳大利亚原住民的真实历史，他们是最早的农学家。演讲者：布鲁斯·帕斯科(Bruce Pascoe https://www.ted.com/talks/bruce_pascoe_a_real_history_of_aboriginal_australians_the_first_agriculturalists)。\nWord Up通过ABC Word Up播客分享澳大利亚黑人的不同语言，从安马蒂尔到阿伦特，从Bidjara到Bundjalung，从Nyungar到Ngaanyatjarra，从Yankunytjatjara到Yorta Yorta-一次一个词。https://www.abc.net.au/radionational/programs/wordup/。\n土著美貌播客BuzzFeed自豪地推出了土著美容播客-由Nakkiah Lui和米兰达·塔普塞尔主持的新播客将挑战澳大利亚土著https://www.buzzfeed.com/prettyforanaboriginal的传统看法。Podcast BuzzFeed很自豪地推出了由Nakkiah Lui和Miranda Tapsell主持的新播客，该播客将挑战对澳大利亚土著的传统看法。\n家庭/家庭暴力和性侵犯的支持联系Blak Business Access Support From Home(通过家庭/家庭暴力和性侵犯获得支持的全国和全州范围的热线和联系号码列表。https://www.instagram.com/p/B9-U-ocgAlG/?igshid=12kuaprhs2eka。\n国家本土电视台https://www.instagram.com/nitv_au/Tiddas 4 Tiddas https://www.instagram.com/tiddas4tiddas/Blak Business https://www.instagram.com/blakbusiness/共同点https://www.instagram.com/commonground/Alethea Beetson https://www.instagram.com/aletheaincolour/服装Gap https://www.instagram.com/clothingthegap/沙漠豌豆媒体https://www.instagram.com/desertpeamedia/Mundanara Bayles https://www.instagram。.com/Blackmagicemananpodcast/Blackfulla BookClub https://www.instagram.com/blackfulla_bookclub/土著商业数据库供应国(提供澳大利亚&#34；的领先的已验证土著企业数据库：按企业名称、产品、服务、地区或类别进行搜索。https://supplynation.org.au/", "note_en": "WELCOME TO THE FANTASY WORLD MASTER LIST OF RESOURCES ON HOW TO DISMANTLE SYSTEMIC RACISM\n   As a response to prevalent racial injustices around our country, I&#39;ve decided to create a community sourced database to help my followers - and the internet at large - fight systemic racism and white supremacy.\n  I started  Patia&#39;s Fantasy World as a private page to share humor, focused on black culture, with my close friends. Eventually, I made the page public and amassed a following. With help from a close network of friends and colleagues, as well as several sleepless nights, I created a master list guide to help dismantle racism. Through my platform, the guide has been circulated around the internet, reaching a number of people I never imagined.\n  Due to the overwhelming response, we have turned the master list into a website that we hope will continue to foster awareness and support for the Black Lives Matter movement.\n   What makes a community healthy and safe? This document doesn&#39;t have all the answers, but it acknowledges that for many of us, police are not part of the solution. Patterns of racism, sexism, homophobia, transphobia, and bullying are too common. When someone is having a mental health crisis, or when neighbors are concerned about a fellow neighbor, or when we feel unsafe- are the police our only option? Of course, different communities have different needs. Vibrant, dynamic, and police-free communities aren&#39;t going to be created by outside groups- they&#39;re going to bloom from the soil that already exists in those spaces. What we can share here, though, is what that process has looked like elsewhere. Here are a few tools, ideas, and strategies:\n  1. An easy one: STOP calling the police when it&#39;s clearly unnecessary. We can&#39;t tell you to never call the police (though some do make that choice). We can challenge you, however, to reflect on that choice, to make sure that calling them isn&#39;t an automatic response to each and every moment of personal discomfort or uncertainty. Never forget: an inconvenience for one person, once police are involved, can become a death sentence for another person.\n  2. Get trained in first aid, crisis de-escalation, restorative justice, etc. The more skills we have to share with our neighbors and family, the less we have to rely on unaccountable armed paramilitary forces! Find or organize local trainings, and share that knowledge.\n  3. Build community all the time, not just in times of trouble. It isn&#39;t just about building capacity as individuals; it&#39;s about cultivating resilient communities. One of the first steps we can take toward communities that no longer need police is meeting one another. We can know our neighbor&#39;s names. We can hold potlucks, volunteer to help our neighbors with simple things like shoveling snow or carrying groceries, and build real relationships. That way, when crises happen, we have other resources to call upon besides the police.\n  4. If you DO need police, go to them instead of calling them to you. From the zine, &#34;12 Things to Do Instead of Calling the Cops:&#34; If something of yours is stolen and you need to file a report for insurance or other purposes, consider going to the police station instead of bringing cops into your community. You may inadvertently be putting someone in your neighborhood at risk.\n  5. With mental health crises, remember to center the person in crisis. From the article &#34;5 Ways to Help Someone in a Mental Health Emergency Without Calling the Police&#34; (Tastrom):  Remember that the person having the mental health crisis is a person and their wishes should be followed as much as is safe. The best intervention strategies will be things that the person buys into and does voluntarily. Those of us with mental health issues have likely been traumatized by doctors and other practitioners not listening to us or doing things against our will. All of this is contextual and there are no absolutes, but think about trauma when you are considering what actions to take.\n  6. Make a list of local services/hotlines you can call instead of the police. From domestic abuse crisis centers, to shelters for people experiencing homelessness, to mental health support groups, to a range of other kinds of advocates and service-providers, find the people who can deal with the kinds of crises that police so often are not equipped to handle. Find out which ones involve the police as a matter of protocol, and which ones don&#39;t. Hang the list on your refrigerator. Keep those contacts in your phone. Make copies and give them to friends and neighbors.\n  7. Support organizations that really do keep our communities healthy. On that note: where these services exist, support them, whether by volunteering, donating, or lobbying for funding from city/county/etc. government. Some great alternatives to the police already exist; they&#39;re just often extremely underfunded. Take this a step further: how might we strategically re-allocate resources from police to services that truly help people? Campaigns to divest from police while investing in communities may offer a path forward.\n  8. Zoom in and find solutions where you are. Across the country, activists are finding ways to change the narrative and do this work. Teachers and parents are working on campaigns like Dignity in Schools&#39; &#34;Counselors Not Cops.&#34; LGBTQ groups are disinviting police to Pride parades. Formerly-incarcerated people are organizing networks of mentorship and even unarmed community mediation teams. Organizations like the Sex Workers Outreach Project are working to address stigma and criminalization. Churches are pledging to not call the police. From the decriminalization of drugs, to the dismantling of the school-to-prison pipeline, to abolishing ICE, and beyond- every step gets us closer to a police-free future.\n  9. Engage in policy work that can prevent, rather than just punish, crime. When we ask people &#34;what keeps your community healthy and safe?&#34; the answers we hear are often very similar: affordable housing, jobs, youth programs, opportunities to create and experience art, welcoming parks, etc. We can cultivate safer and healthier neighborhoods by getting involved in activist organizations, neighborhood groups, school boards, etc. that have the power to do this preventative work.\n  10. Dream bigger: there was a time before police, and there will be a time after. Some of the solutions we need don&#39;t exist yet. There are some things we can do now, but this work is also about planting seeds. A vital first step toward a police-free future is simply being able to visualize what that future will look like. We must break out of the old mindset that police are this inevitable, irreplaceable part of society. They aren&#39;t. There are better ways for us to keep our communities healthy and safe, ways that do not include the violent, oppressive, unaccountable baggage of police forces. Check out the various sources mentioned here. Do more research, have more conversations, and help build the world in which you want to live.\n  A lot of people have been reaching out to me to see how they can help if they are unable to come out and protest alongside these revolutionaries so me and some friends took the time to create a list of things you could do. Get in where you fit in. Everyone plays a role in the revolution.\n  Calling the police often escalates situations, puts people at risk, and leads to violence. Anytime you seek help from the police, you&#39;re inviting them into your community and putting people who may already be vulnerable into dangerous situations. Sometimes people feel that calling the police is the only way to deal with problems. But we can build trusted networks of mutual aid that allow us to better handle conflicts ourselves and move toward forms of transformative justice, while keeping police away from our neighborhoods.\t\t\t\t 1. Don&#39;t feel obligated to defend property-especially corporate &#34;private&#34; property. Before confronting someone or contacting the police, ask yourself if anyone is being hurt or endangered by property &#34;theft&#34; or damage. If the answer is &#34;no,&#34; then let it be.\n  2. If something of yours is stolen and you need to file a report for insurance or other purposes, consider going to the police station instead of bringing cops into your community. You may inadvertently be putting someone in your neighborhood at risk.\n  3. If you observe someone exhibiting behavior that seems &#34;odd&#34; to you, don&#39;t assume that they are publicly intoxicated. A traumatic brain injury or a similar medical episode may be occurring. Ask if they are OK, if they have a medical condition, and if they need assistance.\n  4. If you see someone pulled over with car trouble, stop and ask if they need help or if you can call a tow truck for them. If the police are introduced to such a situation, they may give punitive and unnecessary tickets to people with car issues, target those without papers, or worse.\n  5. Keep a contact list of community resources like suicide hotlines. When police are contacted to &#34;manage&#34; such situations, people with mental illness are sixteen times more likely to be killed by cops than those without mental health challenges.\n  6. Check your impulse to call the police on someone you believe looks or is acting &#34;suspicious.&#34; Is their race, gender, ethnicity, class, or housing situation influencing your choice? Such calls can be death sentences for many people.\n  7. Encourage teachers, coworkers, and organizers to avoid inviting police into classrooms, workplaces, and public spaces. Instead, create for a culture of taking care of each other and not unwittingly putting people in harm&#39;s way. If you&#39;re part of a group that&#39;s holding a rally or demonstration, don&#39;t get a permit or otherwise cooperate with the police.\n  8. If your neighbor is having a party and the noise is bothering you, go over and talk to them. Getting to know your neighbors with community events like monthly block parties is a good way to make asking them to quiet down a little less uncomfortable, or to find another neighbor who is willing to do so.\n  9. If you see someone peeing in public, just look away! Remember, for example, that many houseless people do not have reliable access to bathrooms.\n  10. Hold and attend deescalation, conflict resolution, first-aid, volunteer medic, and self-defense workshops in your neighborhood, school, workplace, or community organization.\n  11. Street art is beautiful! Don&#39;t report graffiti and other street artists. If you see work that includes fascistic or hate speech, paint over it yourself or with friends.\n  12. Remember that police can escalate domestic violence situations. You can support friends and neighbors who are being victimized by abusers by offering them a place to stay, a ride to a safe location, or to watch their children. Utilize community resources like safe houses and hotlines.\n  Pay the Rent Aboriginal people should have control of any Rent received. Paying the Rent is about non-Indigenous people honouring the Sovereignty of Aboriginal people. Paying the Rent is about restitution.  https://paytherent.net.au/  https://paytherent.net.au/about-us/  https://actionnetwork.org/fundraising/yes-im-going-to-pay-the-rent-every-month\n      ANTaR National network of organisations and individuals working in support of Justice, Rights and Respect for Aboriginal and Torres Strait Islander peoples in Australia  https://antar.org.au/donate-antar\n        Dijrra Practical support is available to all Aboriginal women and particularly to Aboriginal people who are currently experiencing family violence or have in the past.  https://djirra.org.au/ https://www.givenow.com.au/fvpls\n  Gunawirra  (Trauma treatment for Aboriginal and Torres Strait Islander women and children through art therapy.  https://gunawirra.org.au/donate/\n  Deadly Connections  (Works with Aboriginal children, young people, adults, families and communities to break intergenerational cycles of disadvantage and trauma - particularly those impacted by the child protection and/or justice systems  https://www.deadlyconnections.org.au/deadlyway-donate.html\n    Change The Record donations page  (working to end the incarceration of, and family violence against, Aboriginal and Torres Strait Islander people.  https://changetherecord.org.au/donate\n                    Free The People GoFundMe  (&#34;Free Her&#34; initiative run by Sisters Inside Inc. paying fines for Indigenous women who are incarcerated and have warrants against them.  https://www.gofundme.com/f/bfvnvt-freethepeople?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=m_pd+share-sheet\n  LITERATURE/ARTICLES &amp; GENERAL RESOURCE LINK PAGES Uluru Statement Resources (links to the developments over the past decade toward constitutional reform for Aboriginal and Torres Strait Islander Peoples.  https://ulurustatement.org/resources\n        Trotsky Platform  (Anti-Capitalist alternative media source working towards a socialist society where exploitation of labour, racism, oppression of women and colonial subjugation are eliminated.  https://www.trotskyistplatform.com/racist-rich-peoples-court-whitewashes-state-killing-of-david-dungay/ https://www.trotskyistplatform.com/category/anti-racism/ https://www.trotskyistplatform.com/category/aboriginal-struggle/ The Guardian Newspaper (tagged Deaths in Custody articles for all current media. https://www.theguardian.com/australia-news/deaths-in-custody\n    Research Unit for Indigenous Language  (project aims to provide fifty words in every Indigenous language of Australia.  https://50words.online/\n  Set up  by Prof. Gary Foley. Literally everything you need is on this webpage; history, news articles etc.  http://www.gooriweb.org/\n  EXTREMELY helpful resource link page by Alethea Beetson @aletheaincolour (with some of the donation links already mentioned but also useful reading material/literature and articles:  https://linktr.ee/aletheaincolour\n    TEDx Sydney  - &#34;A real history of Aboriginal Australians, the First agriculturalists&#34;. Speaker: Bruce Pascoe  https://www.ted.com/talks/bruce_pascoe_a_real_history_of_aboriginal_australians_the_first_agriculturalists\n    &#34;Word Up&#34; Podcast via ABC Word Up shares the diverse languages of black Australia from Anmatyerre to Arrernte, from Bidjara to Bundjalung, from Nyungar to Ngaanyatjarra, from Yankunytjatjara to Yorta Yorta-one word at a time.  https://www.abc.net.au/radionational/programs/wordup/\n  &#34;Pretty For an Aboriginal&#34; Podcast BuzzFeed is proud to introduce Pretty For An Aboriginal - the new podcast hosted by Nakkiah Lui and Miranda Tapsell that&#34;s set to challenge traditional perceptions of Indigenous Australia  https://www.buzzfeed.com/prettyforanaboriginal\n  SUPPORT CONTACT FOR DOMESTIC/FAMILY VIOLENCE AND SEXUAL ASSAULT Blak Business - Accessing Support From Home (A list of national and state wide hotline and contact numbers for support through domestic/family violence and sexual assault.  https://www.instagram.com/p/B9-U-ocgAlG/?igshid=12kuaprhs2eka\n    National Indigenous Television  https://www.instagram.com/nitv_au/  Tiddas 4 Tiddas  https://www.instagram.com/tiddas4tiddas/  Blak Business  https://www.instagram.com/blakbusiness/  Common Ground  https://www.instagram.com/commonground/  Alethea Beetson  https://www.instagram.com/aletheaincolour/  Clothing The Gap  https://www.instagram.com/clothingthegap/  Desert Pea Media  https://www.instagram.com/desertpeamedia/  Mundanara Bayles  https://www.instagram.com/blackmagicwomanpodcast/  Blackfulla Bookclub  https://www.instagram.com/blackfulla_bookclub/  INDIGENOUS BUSINESS DATABASE Supply Nation (provides Australia&#34;s leading database of verified Indigenous businesses: search by business name, product, service, area, or category.  https://supplynation.org.au/", "posttime": "2020-06-13 21:02:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "系统性,master,https", "title": "关于如何消除系统性种族主义的世界资源总目录", "title_en": "World Master List of Resources on How to Dismantle Systemic Racism", "transed": 1, "url": "http://pfw.guide/", "via": "", "real_tags": ["系统性", "master", "https"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们用综合控制法分析了口罩对新冠肺炎在德国传播的影响。我们的识别方法利用了口罩成为强制口罩的时间点上的区域差异。根据我们分析的地区，我们发现，口罩强制实施后的10天内，累计登记的新冠肺炎病例数量减少了2.3%到13%。评估各种估计的可信度，我们得出结论，口罩可将报告感染的日增长率降低约40%。", "note_en": "We use the synthetic control method to analyze the effect of face masks on the spread of Covid-19 in Germany. Our identification approach exploits regional variation in the point in time when face masks became compulsory. Depending on the region we analyse, we find that face masks reduced the cumulative number of registered Covid-19 cases between 2.3% and 13% over a period of 10 days after they became compulsory. Assessing the credibility of the various estimates, we conclude that face masks reduce the daily growth rate of reported infections by around 40%.", "posttime": "2020-06-13 20:28:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大大减少,masks,口罩", "title": "口罩大大减少了德国的新冠肺炎病例", "title_en": "Face Masks Considerably Reduce Covid-19 Cases in Germany", "transed": 1, "url": "https://www.iza.org/publications/dp/13319/face-masks-considerably-reduce-covid-19-cases-in-germany-a-synthetic-control-method-approach", "via": "", "real_tags": ["大大减少", "masks", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "bf829e1bb9ad5b85891384b16e46d1e5.jpeg", "infoid": 1006404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嗨!。我的名字格尔姆和我做的键盘真的很小很奇怪。目前在36键键盘上！这是怎么发生的？10年前，在我的高中，我发现了这个庞然大物的键盘。我对此一无所知，我只知道这东西重约5磅，声音比地狱还大。最糟糕的是，它使用起来甚至感觉真的很好。当然，我们从CS壁橱里挖出的是一台布满灰尘的旧IBM Model M。它在实验室里用了几个月，后来我弄丢了一个连接器，决定在去大学之前削减一下电子产品。在接下来的几年里，空格键被损坏了，我把它扔了出去。在接下来的几年里，这成为我的首选武器，主要是因为它被固定在该死的笔记本电脑上。而且已经足够好了。OSX有一个交换上限和控制权的小选项，这缓解了我遇到的大多数问题。它帮助我完成了学校、编程和各种项目的工作。这并不令人惊叹，只是用Karabiner(我想这就是程序)和我的M570跟踪球的软件拖动滚动几次重新映射就行了。使用Autohotkey设置和用于跨操作系统支持的Xinput/Xmodmap文件，配置是一个痛点，但可以管理。直到我遇到了大型机和ISPF。这是z/OS的主要界面，80年代的风格，对吗？不出所料，这个小小的笔记本键盘不会让人满意。见鬼，界面在某些地方需要PF24！我们需要做得更大，就在那时，我从朋友那里买了一个旧的机械键盘，并给了它5分钟的定制时间。这让我成功地通过了Master the Mainframe，甚至为带有JSON API的Cobol/DB2数据库创建了一个整齐的小Reaction前端(有趣的是，JSON Generate和JSON Parse是几年前添加的，甚至还有VSCode对COBOL：的支持)，但主要问题是如何将它移植到工作中，无论如何它都不是一个小板子！但是，使用Windows Only软件，您可以进行一些巧妙的重新映射和宏化，所以我研究了可编程键盘。事情就是这样发生的。这是一款由QMK驱动的分离式开源键盘，有空白键可供引导。这就是事情开始变得混乱的地方，QMK是一个令人惊叹的项目，它允许您编写自定义密钥映射，生成固件，并将其刷新到支持设备上。因为它是针对技术人群的，所以这是通过一些C宏恶作剧来完成的(尽管有一个Web配置器可以吐出编译后的十六进制供您刷新)。在习惯了默认布局大约一周后，我发现这是一个更针对Linux/Vim用户的布局，我给了它一个闪光灯，然后开始工作。这就是这样的键盘，修改和刷新布局只需要几分钟！自然而然地，随着我发现问题和移动，关于布局的东西变得更加个人化了。Thumbkey+图层确实改变了键盘的使用方式，允许按住拇指键来完全改变将要发送的按键(而这只是冰山一角)。但是ErgoDox存在着巨大的缺陷，拇指上的拇指按键太可怕了，一半的按钮无法使用/够不到，而且它还有这个巨大的顶部。见鬼，一旦你开始分层，那里的钥匙就太多了。在寻找一个项目时，这个小家伙发生了。太棒了，一个更小的类似ErgoDox的带一个小跟踪球的！去掉了数字行和无用的外键，将鼠标控制带到了前面，并采用了SMD重点设计，允许移除ErgoDoxes前额，并增加了对Kailh Chocs的支持。终于，我的包有了放非键盘装备的空间。选择无壳是出于人体工程学的原因，如果你看MX Switch+ErgoDox，你会注意到你需要一个手腕支撑才能正确使用它。选择去掉帐篷，改用低调的巧克力，是人体工程学和耐用性之间的折衷。目前很难制造出经久耐用的雕刻板(问问任何有Dactyl Manuform的人就知道了！)。和以前一样，布局变得更小了，并且针对编程/Vim/i3/Shell About进行了更优化。中场休息：我在每天使用Gergo的时候做了几个不同的设计，分别是Georgi(速记写入器)，Buttertick(20%正交线)，Ginni(10%Split Ergo)和BuzzSaw(60%键盘，通过一堆快速剥离的部件转换成合适的ERGO)。其中一些严重依赖于一个建立在QMK之上的自定义和弦引擎，不用说，在编写这个引擎和试图学习速记之间，我学到了很多关于和弦的奇妙之处，以及你如何真正推动键盘是什么的概念。和弦，对于那些不知道的人来说，是一个花哨的词，意思是按下多个键来发送一个动作，类似于我们知道和喜欢的组合。和弦的一个例子是Iu-&gt；Esc，当按下I+U时，键盘发送转义码。由于有大量的组合可用", "note_en": "Hi! My names Germ and I make really tiny and strange keyboards. Currently on a 36 key keyboard! How did this happen?    10 years ago, at my high school I found this behemoth of a keyboard. I didn&#39;t know anything about it all I knew is that this thing weighed about 5lbs and was louder then all hell. The worst part is that it even  felt really good to use. Of course what we had dug out of the CS closet was a old dusty IBM Model M.    It got used for a few months in the lab before I lost a connector and decided to pare down my electronics before taking off to university. Somewhere in the next few years the space bar got damaged and I pitched it. For the next few years this became my weapon of choice, mostly because it was bolted to the damn laptop.    And it was good enough. OSX had a little option for swapping caps and control and that alleviated most of the issues I had. It got me through school, programming and working on various projects. It wasn&#39;t amazing or anything but with a few remaps using Karabiner (I think that&#39;s the program) and software drag scrolling with my M570 Trackball it worked. With a Autohotkey setup and Xinput/Xmodmap file for cross OS support configuration was a pain point, but manageable. That is until I met a Mainframe and ISPF.   This is the primary interface for z/OS, straight 1980s vibe right? Unsurprisingly this isn&#39;t going to play nice with a tiny laptop keyboard. Hell the interface expects PF24 in places! We needed to go bigger, and that&#39;s when I bought a old mechanical keyboard off a friend and gave it the 5 minute custom. This managed to get me through Master The Mainframe and even make a neat little react frontend for a Cobol/DB2 database with a JSON API (fun fact JSON GENERATE and JSON PARSE were added a few years ago, and there&#39;s even VSCode support for COBOL :) But the main issue was transporting this thing to work, it&#39;s not a small board by any means! But with the Windows only software you could do some neat remapping and macroing so I looked into programmable keyboards.     This is what happened. A split open source keyboard powered by this thing called QMK with blank keys to boot. This is where things started to get messy, QMK is a amazing project that lets you write custom keymaps, generate a firmware and flash it over to a supporting device. Because it&#39;s aimed at a technical crowd this is done through some C macro shenanigans (although there is a web configurator that will spit out a compiled hex for you to flash). After about a week of getting used to the default layout, I found  this a layout more aimed at Linux/Vim users gave it a flash and got to work.  Here&#39;s the thing about a keyboard like this, it only takes a few minutes to modify and reflash a layout! Naturally as I found issues and moved stuff about the layout became more personal. Thumbkeys + Layers really change the manner in which a keyboard can be used allowing holding of a thumbkey to entirely change the keys that will be send (and that&#39;s only the tip of the iceberg).  But the ErgoDox suffers on massive flaw, the thumb cluster is horrible for the outer thumb keys, half the buttons on the cluster are unusable/reachable and it&#39;s got this giant top. Hell, once you get into layering there&#39;s   way too many keys. Looking for a project this little guy happened.     Awesome, A smaller ErgoDox-like with a little trackball! Trimmed off the number row and useless outer keys, brought mouse controls to the front and went with a SMD focused design allowing the ErgoDoxes forehead to be removed and adding support for Kailh Chocs. Finally my bag had some space for non keyboard gear. The choice to go caseless was made for ergonomic reasons, if you look at MX Switch + ErgoDox you&#39;ll notice that you need a wrist rest to use it properly. Opting to remove tenting and moving to Low profile chocs was a compromise between ergonomics and durability. Currently it is hard to manufacture sculpted boards that are durable (Ask anyone with a Dactyl Manuform!). As before the layouts got smaller and more optimized for  Programming/Vim/i3/Shelling about.   Intermission:  I ended up making a few different designs while using a Gergo daily, namely the Georgi (stenography writer), ButterStick (20% ortholinear), Ginni (10% Split Ergo) and BuzzSaw (60% keyboard that transforms to a proper ergo with a bunch of snapoff parts). A few of these heavily rely on a custom chording engine that lives on top of QMK, needless to say between writing that engine and trying to learn stenography I learned a bunch about the wonders of chording and how you can really push the notion of  what a keyboard is with it.  Chording, for those that don&#39;t know is a fancy word for pressing multiple keys to send an action, similar to combos that we know and love. An example of a chord would be IU -&gt; Esc, when I + U are depressed the escape code is sent by the keyboard. Due to the sheer number of combinations available on even a tiny board layouts are  highly personalized. A stenographer will have a custom dictionary that is full of their own briefs/snippets that&#39;s been crafted over the years and personal. And that&#39;s in addition to the entire English language fitting onto 30 keys :)  There is a issue with chording, spring force. With chording you&#39;ll sometime push two vertical keys with the same finger (applying force along the edges). A typical key has about 60-70gf of resistance, so a vertical chord is 120-140, and a edge chord (4 keys pushed by one finger such as TSDZ on a steno board) is 240-280! Needless to say that isn&#39;t very ergonomic, comfortable or fun. The solution is  very light switches. 35gf are the lightest commercial switches you can get (Gateron Clear/Kailh Choc Red Pro), but I take it even further.  12gf springs custom from Korea for Kailh Chocs. Very light typing, and only 24gf/48gf of force required in the very worst scenarios. The downside is that every other board I touch feels extremely hard.    End Intermission  Sadly, while functional those boards are just a bit too much for me. I took the lessons on chording and ran with it, including &#34;User-Hostile Design Principles&#34;, there&#39;s a bit of a write up over  here. In the interest of ergonomics the outer mod column, inner extras and outer thumb 2us were also ripped off. The idea being that you can&#39;t hurt yourself on what isn&#39;t there. To compensate dotted around the keyboard are a handful of small two-key chords powered by QMKs Combo feature. These are the game-changer for typing/vim/programming. Look at this layout, but most importantly the two finger chords. Think about how this would impact your typical workflow. If you&#39;ve never seen one of these before it&#39;ll look a little dense.  Here&#39;s the layout for Gergo:        And this here is GergoPlex       A little complex eh? The symbol/Number layers are controlled by the two thumb keys where your hands naturally rest, Vim style arrow/mouse movement and all modifiers are easily withing reach. The main downside of overloading keys with modifiers is that conflicts arise (For example, Control-A. You   must use the opposite control!) but the reduction in motion is worth it. When using this layout the fingers only ever travel 1u from homerow (with the exception of the inner thumb 1u).  The real fun comes with those chords, for many often used keys you never need to leave home row. Take a second and find the following combos and what keys would need to be pressed.  Alt-Tab, Control-Enter, Escape, :wq, Volume Up, Control-Shift-V, The_Quick_Brown_Fox  Now compare how you would do those on a traditional keyboard. How many times a day to you make these motions? That&#39;s why GergoPlex is designed in a user hostile way :)  It&#39;s  been a fun year over here, many new designs have been made and friends been met.  Here&#39;s hoping 2020 leads to more Input Device shenanigans   P.S. ButterKnife launched today,  find it over in the store!", "posttime": "2020-06-13 20:12:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,键盘,keyboards", "title": "奇怪的键盘，可编程的键盘", "title_en": "Weird Keyboards, Programmable Keyboards", "transed": 1, "url": "https://blog.gboards.ca/2020/01/weird-keyboards-programmable-keyboards.html?m=1", "via": "", "real_tags": ["编程", "键盘", "keyboards"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-06-13 20:11:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "标准,standard,网站", "title": "标准ML", "title_en": "Standard ML", "transed": 1, "url": "https://dl.acm.org/doi/abs/10.1145/3386336", "via": "", "real_tags": ["标准", "standard", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《寻找原始的Fortran编译器》刊载于2017年4-6月的IEEE计算史年鉴。如果链接不起作用，你可以在这里阅读我最终提交的版本。\n我写这篇文章是为了记录我在2003年末开始寻找IBM704的原始FORTRAN编译器的源代码的过程。很多搜索都记录在这个灰尘甲板的博客上，我在2004年7月创建了这个博客，作为一种广告。\n我要感谢伯特·格拉德鼓励我写这篇文章。伯特是一个从1954年开始从事计算机软件工作的朋友，一直没有停止-例如，请看这里和这里。", "note_en": "“In Search of the Original Fortran Compiler” appears in the  April-June 2017 issue of  IEEE Annals of the History of Computing. If that link doesn’t work, you can read my final submitted version  here.\n I wrote the article to chronicle the search I began in  late 2003 to find the source code for the original FORTRAN compiler for the IBM 704. Much of the search was documented right here on this Dusty Decks blog, which I created in  July 2004 as a sort of advertisement.\n I’d like to thank Burt Grad for encouraging me to write the article. Burt is a friend who began working on computer software in 1954 and hasn’t stopped — for example, see  here and  here and  here and  here.", "posttime": "2020-06-13 19:55:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,原始,original,编译器", "title": "搜索原始的Fortran编译器", "title_en": "In search of the original Fortran compiler", "transed": 1, "url": "https://mcjones.org/dustydecks/archives/2017/07/14/968/", "via": "", "real_tags": ["编译", "原始", "original", "编译器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006401, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "丹尼尔·H·英格斯学习研究组施乐·帕洛阿尔托研究中心字节杂志，1981年8月。(C)由纽约麦格劳-希尔公司(McGraw-Hill Companies，Inc.)提供。从http://users.ipa.net/~dwighth/smalltalk/byte_aug81/design_principles_behind_smalltalk.html复制，由德怀特休斯扫描并转换成超文本标记语言(带有重建的图形)。Smalltalk项目的目的是为每个人的创新精神提供计算机支持。我们的工作来自于一个愿景，包括一个有创造力的人和最好的可用的计算硬件。我们选择专注于两个主要的研究领域：一种是描述语言(编程语言)，它充当人类头脑中的模型和计算硬件中的模型之间的接口；另一种是交互语言(用户界面)，它将人类通信系统与计算机的交互系统相匹配。我们的工作遵循了一个两到四年的周期，可以看出这与科学方法是平行的：在当前系统内构建一个应用程序(进行观察)，基于该经验重新设计语言(制定理论)，基于新设计构建一个新系统(做出一个可以测试的预测)。\nSmalltalk-80系统标志着我们在这个周期中的第五次。在这篇文章中，我介绍了我们在工作过程中遵守的一些一般原则。虽然演示文稿经常涉及到Smalltalk&34；为人母，但这些原则本身更具一般性，在评估其他系统和指导未来的工作中应该会被证明是有用的。只是为了热身，我将从一个更具社会性而不是技术性的原则开始，这个原则在很大程度上要对Smalltalk项目的特殊偏见负责：个人掌握：如果一个系统要服务于创造精神，它必须是单个人完全可以理解的。\n这里的重点是，人的潜能在个人身上表现出来。为了实现这一潜力，我们必须提供一种个人可以掌握的媒介。用户和系统的某些部分之间存在的任何障碍最终都会成为创造性表达的障碍。系统中任何不能改变的部分或不够通用的部分都可能成为障碍的来源。如果系统的一个部分与所有其他部分的工作方式不同，则需要额外的努力来控制该部分。这种增加的负担可能会削弱最终结果，并将阻碍未来在这一领域的努力。因此，我们可以推断出一个一般的设计原则：良好的设计：一个系统应该用最少的一组不可更改的部分来构建；这些部分应该尽可能地通用；并且系统的所有部分都应该保持在一个统一的框架中。\n语言：在设计计算机使用的语言时，我们不需要花很长时间就能找到有用的提示。我们所知道的关于人们如何思考和沟通的一切都是适用的。人类思维和交流的机制已经被设计了数百万年，我们应该尊重它们，认为它们是合理的设计。此外，由于我们必须在接下来的一百万年里使用这种设计，如果我们使我们的计算机模型与大脑兼容，而不是反过来，将节省时间。图1说明了我们讨论中的主要组成部分。一个人被描述为拥有身体和心灵。身体是初级经验的场所，在这个讨论的背景下，它是感知宇宙和实现意图的物理通道。经验在头脑中被记录和处理。创造性思维(不深入其机制)可以被视为信息在头脑中的自发出现。语言是该信息的关键：两个人之间的交互在图1中表示为两条弧线。实线弧线表示明确的交流：所说和所感知的实际言语和动作。虚线表示隐含的交流：共同的文化和经验构成了显性交流的背景。在人类互动中，许多实际的交流都是通过参考共享的语境来实现的，而人类语言就是围绕着这样的典故而建立起来的。计算机也是如此。然而，计算机可以被视为图1中的参与者并不是巧合。在这种情况下，主体提供了信息的可视显示和感测来自人类用户的输入的功能。在这种情况下，计算机可以被视为图1中的参与者之一。在这种情况下，主体提供了信息的可视显示和感测来自人类用户的输入。计算机的头脑包括内部存储器和处理元件及其内容。图1显示了计算机语言设计中涉及的几个不同问题：范围：使用计算机的语言设计必须处理内部模型、外部介质，以及人和计算机两者之间的交互。\n这一事实导致了向查看co的人解释Smalltalk的困难。\n然而，就像如果显式处理对象存储会使程序变得混乱一样，如果从外部执行处理，系统中的控制就会变得复杂。让我们考虑一下数字加5的过程。在大多数计算机系统中，编译器会计算出它是什么类型的数字，并生成代码将其加5。这对于面向对象系统来说还不够好，因为编译器无法确定确切的数字类型(稍后将对此进行详细介绍)。一种可能的解决方案是调用一个通用加法例程，该例程检查参数的类型以确定近似操作。这不是一个好方法，因为这意味着这个关键例程必须由新手编辑，他们只想尝试自己的数字类别。这也是一个糟糕的设计，因为关于对象内部的深入知识散布在整个系统中。*Smalltalk提供了一个更干净的解决方案：它将所需操作的名称与任何参数一起作为消息发送给数字，并理解接收者最知道如何执行所需操作。我们有了一个行为良好的对象的宇宙，它们礼貌地要求彼此实现它们的各种愿望，而不是一个磨碎比特的处理器强奸和掠夺数据结构。消息的传输是在对象之外进行的唯一过程，这是理所应当的，因为消息在对象之间传输。语言可以重申良好设计的原则：统一隐喻：一种语言应该围绕一个可以统一应用于所有领域的强大隐喻来设计。\n这方面最成功的例子包括基于链接结构模型构建的LISP；基于数组模型构建的APL；以及基于通信对象模型构建的Smalltalk。在每种情况下，大型应用程序的查看方式都与构建系统的基本单元相同。特别是在Smalltalk中，最原始对象之间的交互被视为计算机与其用户之间的最高级别交互。Smalltalk中的每个对象(即使是最小的整数)都有一组消息和协议，用于定义该对象可以响应的显式通信。在内部，对象可以具有本地存储和对构成所有通信的隐式上下文的其他共享信息的访问。例如，消息+5(加5)带有一个隐含的假设，即该加数是接收该消息的号码的现值。组织机构：统一的比喻提供了一个框架，可以在其中构建复杂的系统。几个相关的组织原则有助于成功地管理复杂性。首先：\n模块性：复杂系统中的任何组件都不应该依赖于任何其他组件的内部细节。图2：系统复杂性。随着系统中组件数量的增加，不需要的交互机会迅速增加。正因为如此，一种计算机语言应该被设计成将这种相互依赖的可能性降到最低。\n这一原则如图2所示。如果系统中有N个组件，则它们之间存在大约N平方的潜在依赖关系。如果计算机系统要在复杂的人工任务中提供帮助，它们的设计必须将这种相互依赖降到最低。消息发送隐喻通过将消息的意图(体现在其名称中)与接收者用于实现意图的方法分离来提供模块性。结构信息也同样受到保护，因为对对象内部状态的所有访问都是通过这个相同的消息接口进行的。但是，系统的复杂性通常可以通过对相似组件进行分组来降低。这种分组是通过传统编程语言中的数据类型和Smalltalk中的类来实现的。类描述其他对象--它们的内部状态、它们识别的消息协议以及响应这些消息的内部方法。这样描述的对象称为该类的实例。甚至类本身也适合这个框架；它们只是类Class的实例，它描述了对象描述的适当协议和实现。分类：语言必须提供一种方法来对类似的对象进行分类，并在与系统的核心类平等的基础上添加新的对象类。\n分类是对无的对象化。换句话说，当一个人看到一把椅子时，这种体验既是从字面上理解的，也是抽象地理解为椅子一样的东西。这种抽象源于头脑融合相似经验的非凡能力，而这种抽象在头脑中表现为另一个对象，即柏拉图式的椅子或椅子。课程是课外活动的主要机制\n..", "note_en": "Daniel H. H. Ingalls Learning Research Group Xerox Palo Alto Research Center   BYTE Magazine, August 1981. (c) by The McGraw-Hill Companies, Inc., NY. Copied from  http://users.ipa.net/~dwighth/smalltalk/byte_aug81/design_principles_behind_smalltalk.html Scanned in and converted to HTML (with recreated graphics) by Dwight Hughes.  The purpose of the Smalltalk project is to provide computer support for the creative spirit in everyone. Our work flows from a vision that includes a creative individual and the best computing hardware available. We have chosen to concentrate on two principle areas of research: a language of description (programming language) that serves as an interface between the models in the human mind and those in computing hardware, and a language of interaction (user interface) that matches the human communication system to that of the computer. Our work has followed a two- to four-year cycle that can be seen to parallel the scientific method:  Build an application program within the current system (make an observation)  Based on that experience, redesign the language (formulate a theory)  Build a new system based on the new design (make a prediction that can be tested)\nThe Smalltalk-80 system marks our fifth time through this cycle. In this article, I present some of the general principles we have observed in the course of our work. While the presentation frequently touches on Smalltalk &#34;motherhood&#34;, the principles themselves are more general and should prove useful in evaluating other systems and in guiding future work.      Just to get warmed up, I&#39;ll start with a principle that is more social than technical and that is largely responsible for the particular bias of the Smalltalk project:  Personal Mastery:    If a system is to serve the creative spirit, it must be entirely comprehensible to a single individual.\nThe point here is that the human potential manifests itself in individuals. To realize this potential, we must provide a medium that can be mastered by a single individual. Any barrier that exists between the user and some part of the system will eventually be a barrier to creative expression. Any part of the system that cannot be changed or that is not sufficiently general is a likely source of impediment. If one part of the system works differently from all the rest, that part will require additional effort to control. Such an added burden may detract from the final result and will inhibit future endeavors in that area. We can thus infer a general principle of design:  Good Design:    A system should be built with a minimum set of unchangeable parts; those parts should be as general as possible; and all parts of the system should be held in a uniform framework.\n  Language      In designing a language for use with computers, we do not have to look far to find helpful hints. Everything we know about how people think and communicate is applicable. The mechanisms of human thought and communication have been engineered for millions of years, and we should respect them as being of sound design. Moreover, since we must work with this design for the next million years, it will save time if we make our computer models compatible with the mind, rather that the other way around.       Figure 1 illustrates the principle components in our discussion. A person is presented as having a body and a mind. The body is the site of primary experience, and, in the context of this discussion, it is the physical channel through which the universe is perceived and through which intentions are carried out. Experience is recorded and processed in the mind. Creative thought (without going into its mechanism) can be viewed as the spontaneous appearance of information in the mind. Language is the key to that information:  The interaction between two individuals is represented in  figure 1 as two arcs. The solid arc represents explicit communication: the actual words and movements uttered and perceived. The dashed arc represents implicit communication: the shared culture and experience that form the context of the explicit communication. In human interaction, much of the actual communication is achieved through reference to shared context, and human language is built around such allusion. This is the case with computers as well.      It is no coincidence that a computer can be viewed as one of the participants in  figure 1. In this case, the &#34;body&#34; provides for visual display of information and for sensing input from a human user. The &#34;mind&#34; of a computer includes the internal memory and processing elements and their contents.  Figure 1 shows that several different issues are involved in the design of a computer language:  Scope:    The design of a language for using computers must deal with internal models, external media, and the interaction between these in both the human and the computer.\nThis fact is responsible for the difficulty of explaining Smalltalk to people who view computer languages in a more restricted sense. Smalltalk is not simply a better way of organizing procedures or a different technique for storage management. It is not just an extensible hierarchy of data types, or a graphical user interface. It is all of these things and anything else that is needed to support the interactions shown in  figure 1.       Figure 1:    The scope of language design. Communication between two people (or between one person and a computer) includes communication on two levels. Explicit communication includes the information that is transmitted in a given message. Implicit communication includes the relevant assumptions common to the two beings.\n Communicating Objects      The mind observes a vast universe of experience, both immediate and recorded. One can derive a sense of oneness with the universe simply by letting this experience be, just as it is. However, if one wishes to participate, literally to  take a part, in the universe, one must draw distinctions. In so doing one identifies an object in the universe, and simultaneously all the rest becomes not-that-object. Distinction by itself is a start, but the process of distinguishing does not get any easier. Every time you want to talk about &#34;that chair over there&#34;, you must repeat the entire processes of distinguishing that chair. This is where the act of reference comes in: we can associate a unique identifier with an object, and, from that time on, only the mention of that identifier is necessary to refer to the original object.      We have said that a computer system should provide models that are compatible with those in the mind. Therefore:\n Objects:  A computer language should support the concept of &#34;object&#34; and provide a uniform means for referring to the objects in its universe.\nThe Smalltalk storage manager provides an object-oriented model of memory for the entire system. Uniform reference is achieved simply by associating a unique integer with every object in the system. This uniformity is important because it means that variables in the system can take on widely differing values and yet can be implemented as simple memory cells. Objects are created when expressions are evaluated, and they can be passed around by uniform reference, so that no provision for their storage is necessary in the procedures that manipulate them. When all references to an object have disappeared from the system, the object itself vanishes, and its storage is reclaimed. Such behavior is essential to full support of the object metaphor:  A way to find out if a language is working well is to see if programs look like they are doing what they are doing. If they are sprinkled with statements that relate to the management of storage, then their internal model is not well matched to that of humans. Can you imagine having to prepare someone for each thing you tell them or having to inform them when you are through with a given topic and that it can be forgotten?      Each object in our universe has a life of its own. Similarly, the brain provides for independent processing along with storage of each mental object. This suggests a third principle of design:  Messages:   Computing should be viewed as an intrinsic capability of objects that can be uniformly invoked by sending messages.\n    Just as programs get messy if object storage is dealt with explicitly, control in the system becomes complicated if processing is performed extrinsically. Let us consider the process of adding 5 to a number. In most computer systems, the compiler figures out what kind of number it is and generates code to add 5 to it. This is not good enough for an object-oriented system because the exact kind of number cannot be determined by the compiler (more on this later). A possible solution is to call a general addition routine that examines the type of the arguments to determine the approximate action. This is not a good approach because it means that this  critical routine must be edited by novices who just want to experiment with their own class of numbers. It is also a poor design because intimate knowledge about the internals of objects is sprinkled throughout the system.      Smalltalk provides a much cleaner solution: it sends the  name of the desired operation, along with any arguments, as a  message to the number, with the understanding that the receiver knows best how to carry out the desired operation. Instead of a bit-grinding processor raping and plundering data structures, we have a universe of well-behaved objects that courteously ask each other to carry out their various desires. The transmission of messages is the only process that is carried on outside of objects and this is as it should be, since messages travel between objects. The principle of good design can be restated for languages:  Uniform Metaphor:  A language should be designed around a powerful metaphor that can be uniformly applied in all areas.\n    Examples of success in this area include LISP, which is built on the model of linked structures; APL, which is built on the model of arrays; and Smalltalk, which is built on the model of communicating objects. In each case, large applications are viewed in the same way as the fundamental units from which the system is built. In Smalltalk especially, the interaction between the most primitive objects is viewed in the same way as the highest-level interaction between the computer and its user. Every object in Smalltalk, even a lowly integer, has a set of messages, a  protocol, that defines the explicit communication to which that object can respond. Internally, objects may have local storage and access to other shared information which comprise the implicit context of all communication. For instance, the message + 5 (add five) carries an implicit assumption that the augend is the present value of the number receiving the message.  Organization      A uniform metaphor provides a framework in which complex systems can be built. Several related organizational principles contribute to the successful management of complexity. To begin with:\n Modularity:  No component in a complex system should depend on the internal details of any other component.        Figure 2:  System complexity. As the number of components in a system increases, the chances for unwanted interaction increase rapidly. Because of this, a computer language should be designed to minimize the possibilities of such interdependence.\n This principle is depicted in  figure 2. If there are  N components in a system, then there are roughly  N-squared potential dependencies between them. If computer systems are ever to be of assistance in complex human tasks, they must be designed to minimize such interdependence. The message-sending metaphor provides modularity by decoupling the  intent of a message (embodied in its name) from the  method used by the recipient to carry out the intent. Structural information is similarly protected because all access to the internal state of an object is through this same message interface.      The complexity of a system can often be reduced by grouping similar components. Such grouping is achieved through data typing in conventional programming languages, and through  classes in Smalltalk. A class describes other objects -- their internal state, the message protocol they recognize, and the internal methods for responding to those messages. The objects so described are called  instances of that class. Even classes themselves fit into this framework; they are just instances of class  Class, which describes the appropriate protocol and implementation for object description.  Classification:  A language must provide a means for classifying similar objects, and for adding new classes of objects on equal footing with the kernel classes of the system.\n Classification is the objectification of  nessness. In other words, when a human sees a chair, the experience is taken both literally an &#34;that very thing&#34; and abstractly as &#34;that chair-like thing&#34;. Such abstraction results from the marvelous ability of the mind to merge &#34;similar&#34; experience, and this abstraction manifests itself as another object in the mind, the Platonic chair or chair ness.      Classes are the chief mechanism for extension in Smalltalk. For instance, a music system would be created by adding new classes that describe the representation and interaction protocol of  Note,  Melody,  Score,  Timbre,  Player, and so on. The &#34;equal footing&#34; clause of the above principle is important because it insures that the system will be used as it was designed. In other words, a melody could be represented as an ad hoc collection of  Integers representing pitch, duration, and other parameters, but if the language can handle  Notes as easily as  Integers, then the user will naturally describe a melody as a collection of  Notes. At each stage of design, a human will naturally choose the most effective representation if the system provides for it. The principle of modularity has an interesting implication for the procedural components in a system:      A conventional statement of this principle is that a program should never declare that a given object is a  SmallInteger or a  LargeInteger, but only that it responds to integer protocol. Such generic description is crucial to models of the real world.      Consider an automobile traffic simulation. Many procedures in such a system will refer to the various vehicles involved. Suppose one wished to add, say, a street sweeper. Substantial amounts of computation (in the form of recompiling) and possible errors would be involved in making this simple extension if the code depended on the objects it manipulates. The message interface establishes an ideal framework for such an extension. Provided that street sweepers support the same protocol as all other vehicles, no changes are needed to include them in the simulation:  There are many reasons for this principle. First of all, it saves time, effort, and space if additions to the system need only be made in one place. Second, users can more easily locate a component that satisfies a given need. Third, in the absence of proper factoring, problems arise in synchronizing changes and ensuring that all interdependent components are consistent. You can see that a failure in factoring amounts to a violation of modularity.      Smalltalk encourages well-factored designs through  inheritance. Every class inherits behavior from its superclass. This inheritance extends through increasingly general classes, ultimately ending with class  Object which describes the default behavior of all objects in the system. In our traffic simulation above,  StreetSweeper (and all other vehicle classes) would be described as a subclass of a general  Vehicle class, thus inheriting appropriate default behavior and avoiding repetition of the same concepts in many different places. Inheritance illustrates a further pragmatic benefit of factoring:  Leverage:  When a system is well factored, great leverage is available to users and implementers alike.\n    Take the case of sorting an ordered collection of objects. In Smalltalk, the user would define a message called  sort in the class  OrderedCollection. When this has been done, all forms of ordered collections in the system will instantly acquire this new capability through inheritance. As an aside, it is worth noting that the same method can alphabetize text as well as sort numbers, since comparison protocol is recognized by the classes which support both text and numbers.      The benefits of structure for implementers are obvious. To begin with, there will be fewer primitives to implement. For instance, all graphics in Smalltalk are performed with a single primitive operation. With only one task to do, an implementer can bestow loving attention on every instruction, knowing that each small improvement in efficiency will be amplified throughout the system. It is natural to ask what set of primitive operations would be sufficient to support an entire computing system. The answer to this question is called a  virtual machine specification:  The Smalltalk virtual machine establishes an object-oriented model for storage, a message-oriented model for processing, and a bitmap model for visual display of information. Through the use of microcode, and ultimately hardware, system performance can be improved dramatically without any compromise to the other virtues of the system.  User Interface      A user interface is simply a language in which most of the communication is visual. Because visual presentation overlaps heavily with established human culture, esthetics plays a very important role in this area. Since all capability of a computer system is ultimately delivered through the user interface, flexibility is also essential here. An enabling condition for adequate flexibility of a user interface can be stated as an object-oriented principle:  Reactive Principle:  Every component accessible to the user should be able to present itself in a meaningful way for observation and manipulation.\nThis criterion is well supported by the model of communicating objects. By definition, each object provides an appropriate message protocol for interaction. This protocol is essentially a microlanguage particular to just that kind of object. At the level of the user interface, the appropriate language for each object on the screen is presented visually (as text, menus, pictures) and sensed through keyboard activity and the use of a pointing device.      It should be noted that operating systems seem to violate this principle. Here the programmer has to depart from an otherwise consistent framework of description, leave whatever context has been built up, and deal with an entirely different and usually very primitive environment. This need not be so:  Operating System:  An operating system is a collection of things that don&#39;t fit into a language. There shouldn&#39;t be one.\nHere are some examples of conventional operating system components that have been naturally incorporated into the Smalltalk language:  Storage management -- Entirely automatic. Objects are created by a message to their class and reclaimed when no further references to them exist. Expansion of the address space through virtual memory is similarly transparent.  File system -- Included in the normal framework through objects such as  Files and  Directories with message protocols that support file access.  Display handling -- The display is simply an instance of class  Form, which is continually visible, and the graphical manipulation messages defined in that class are used to change the visible image.  Keyboard Input -- The user input devices are similarly modeled as objects with appropriate messages for determining their state or reading their history as a sequence of events.  Access to subsystems -- Subsystems are naturall\n......", "posttime": "2020-06-13 19:05:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,principles,系统", "title": "Smalltalk背后的设计原则", "title_en": "Design Principles Behind Smalltalk", "transed": 1, "url": "https://www.cs.virginia.edu/~evans/cs655/readings/smalltalk.html", "via": "", "real_tags": ["设计", "系统"]}, {"category": "", "categoryclass": "", "imagename": "a1c5414d4b6bb120eb46ead95fa4c04b.jpg", "infoid": 1006399, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2016年，我为纵横字谜数据设计了一种纯文本文件格式，然后花了几个月的时间建立了一条微数据管道，收集了数十个数据.", "note_en": "In 2016 I designed a plain-text file format for crossword puzzle data, and then spent a couple of months building a micro-data-pipeline, scraping tens of tho...", "posttime": "2020-06-13 18:15:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "导致,format,数据", "title": "一种文件格式导致了Crosword丑闻", "title_en": "A File Format Led to a Crossword Scandal", "transed": 1, "url": "https://www.youtube.com/watch?v=9aHfK8EUIzg", "via": "", "real_tags": ["导致", "format", "数据"]}, {"category": "", "categoryclass": "", "imagename": "7c571feb19de05a0427f36e1b23d6786.jpg", "infoid": 1006398, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考古学家正在挖掘早期视频游戏的代码，以揭开被遗忘已久的秘密，这些秘密可能与今天的情况有关联，这相当于电子铲子和铲子的数字等价物。\n“你和你的考古学家团队已经掉进了‘僵尸墓穴’。”可以肯定的是，这是一种悲惨的情况。但根据说明书，这是雅达利2600游戏Enombed玩家面临的令人不寒而栗的考验。\n地下墓穴是一个不可饶恕的地方。这是一个向下滚动的二维迷宫，玩家必须熟练地导航，才能避开僵尸敌人的“粘乎乎的、致命的抓地力”。考古学家的噩梦。\n1982年出版的“埋葬”远称不上畅销书，如今它基本上已经被遗忘了。但最近，一位计算机科学家和一位数字考古学家决定拆解这款游戏的源代码，以调查它是如何制作的。\n加拿大阿尔伯塔省卡尔加里大学的约翰·艾科克回忆说，埋葬总是有一些耐人寻味的地方。由于它已经变得默默无闻，之前没有被拆解和深入分析-这是英国约克大学的艾科克和他的合著者塔拉·科普斯通被吸引到地下作为研究对象的主要原因之一，这是为雅达利2600游戏机制作的其他500款游戏的研究对象。\n这两个人是越来越多的“视频游戏考古学家”中的一员，他们正在挖掘被遗忘已久的软件，并将它们拆开。在里面，他们正在寻找视频游戏早期是如何产生的线索，但也有一些秘密可以帮助现代程序员解决他们今天面临的一些问题。\n就像无畏的地下墓穴探险家一样，艾科克和科普斯通在墓穴里寻找奇怪的遗物。但他们得到的比他们预料的要多：他们发现了一段他们无法解释的神秘代码。它背后的逻辑似乎已经永远失去了。\n在20世纪70年代末和80年代初，迷宫导航游戏非常常见，但用于生成迷宫的方法因程序员的不同而有所不同。在雅达利时代，游戏的设计必须有令人难以置信的技巧，因为运行它们的计算机系统非常有限。(阅读更多关于迷宫建造者的思想。)\n尽管从今天的计算机图形标准来看，埋葬的块状二维迷宫看起来可能很简单，但在1982年，你不能简单地设计一套迷宫，将它们存储在游戏中，然后在屏幕上显示-游戏墨盒上没有足够的内存来做这样的事情。在许多情况下，迷宫是“程序化”生成的--换句话说，游戏在运行中随机创建了迷宫，因此玩家实际上不会两次穿越相同的迷宫。\n但是，你如何才能让计算机程序避免制造出一个有太多墙的无用迷宫，或者是无法穿透的平面图呢？\n艾科克明白问题的艰巨性。他认为他很有可能在埋藏的深处找到一些聪明的过程。\n“那是一个非常深的兔子洞，”他回忆道。“当我深入研究这个迷宫算法时，我发现这似乎是这个迷宫游戏中独一无二的东西。”\n原来，迷宫是按顺序生成的。游戏需要决定，当它绘制迷宫的每个新正方形时，它是应该画一堵墙，还是应该画一个空间让游戏角色在里面走动。因此，每个正方形应该是“墙”或“无墙”--计算机位中的“1”或“0”。游戏的算法通过分析迷宫的一部分自动决定这一点。它使用了一块看起来有点像俄罗斯方块的五个正方形的瓷砖。此平铺确定每行中下一个正方形的性质。\n多么?。这就是最吸引人的部分。决定下一个方块的基本逻辑锁定在写入游戏代码的可能值表中。根据五个正方形瓷砖的值，桌子告诉游戏是存放一堵墙，没有墙，还是在两者之间随机选择。\n这看起来很简单，但问题是，没有人能弄清楚这张桌子是怎么做的。\nAycock和Copplstone已经尝试对桌子进行逆向工程。他们在价值观中寻找模式，试图揭示它是如何设计的，但这是徒劳的。不管程序员做了什么，都是天才之举。每次游戏进行时，都会抽出一个可可靠导航的迷宫。如果桌子的值是随机的，甚至稍有不同，迷宫很可能无法通过它绘制一条可玩的路径。这似乎是不可能解释的。(阅读有关数学如何帮助您解决迷宫的信息。)\n“桌子的反常之处令人震惊，”科普尔斯通说。她说，这是考古学中一个经典难题的例子。“我认为有一种假设，当我们发现东西时，我们知道它们是什么--如果我们从地下拔出一个矛头，我们就知道它是什么，”她说。“(但)很多时候，我们不知道正在发生什么。”\n“作为一名科学家，我的奋斗是，我认为应该有一些合乎逻辑的方式，让这一切都有意义，但似乎真的没有。”\n两人最好的猜测是，迷宫算法背后的程序员一定是手动微调了表值，直到游戏按预期运行，但这仍然不能真正解释背后的逻辑。\n在他们的研究中，艾科克和科普斯通采访了参与游戏制作的人之一史蒂夫·西德利(Steve Sidley)。\n他也记得当时被桌子弄糊涂了。“我无法解读它，”他告诉研究人员。他声称这是一名程序员的作品，他在不完全清醒的情况下开发了它：“他告诉我，当他喝醉了，大脑失去知觉时，它就出现在他身上了。”Aycock试图联系有问题的程序员，但没有得到任何回应。\n也许从来没有人真正理解算法的逻辑。但在1982年的雅达利游戏中，它提出了一个似乎无法回答的问题。\n安德鲁·莱因哈德(Andrew Reinhard)也在约克大学(University Of York)撰写并实践视频游戏考古学。他说，Aycock和Copplstone在“埋葬”方面的工作是另一个暗示，一般来说，在旧游戏和旧软件中有许多宝石等待发现。\n他说：“我有一种感觉，在”埋葬“中发生的事情比没有发生得更频繁，只是我们还没有了解到哪些游戏有这种东西。”\n对于一些人来说，考古学家会对几十年前的视频游戏感兴趣的想法可能听起来很奇怪。我们更习惯于看到狂热的挖掘机扬起埋在泥土中数千年的美丽花瓶或类似的珍宝。但莱因哈德指出，电子游戏已经成为一家主要的商业企业，也是我们文化的重要组成部分。游戏手工艺品保存着它们自己的人类历史记录。\n数字考古学家可以挖掘编程进化的线索，解开旧技术的运作方式，并通过挖掘视频游戏来洞察20世纪日渐衰落的文化。另一位程序员阿列克谢·佩珀斯(Alexei Pepers)在不太可能的加拿大公司工作，他甚至将复古游戏称为考古“遗址”。\n她说，听到上世纪80年代初的一些程序员可能会莫名其妙地调整他们的代码，只是为了让他们埋头运行，这是令人振奋的-这种反复试验的摆弄在编程中是一个众所周知的过程。佩珀斯说：“我发现这很容易让人联想到，当然在我自己的工作中也是如此。”\n揭示早期游戏程序员克服他们所使用的系统的技术限制的方法不仅仅是学术上的有趣。这在今天是有意义的。\n以虚拟现实游戏和体验的编程为例。你无法想象与二维雅达利迷宫游戏在视觉上更不同的东西。但对程序员的要求在本质上是相似的。\n“你在技术上受到很大的限制，因为(虚拟现实游戏)必须以非常高的帧率运行，”佩珀斯解释说。“而且你会受到球员如何移动和他们能做什么的限制。”\n通过研究前一个时代的技巧和变通办法，也许21世纪的程序员，将今天的技术推向极限，可能会学到一些真正有用的东西。\nAycock相信，他们发现的迷宫算法是游戏程序员如何获得创造性的一个很好的例子。\n“从现代的角度来看，我认为这也是一个有趣的案例研究，研究如何在极其有限的时间和(记忆)空间内解决问题，”他补充道。\n数字考古学家梳理的不仅仅是代码。1983年，Atari在新墨西哥州阿拉莫戈多的一个垃圾填埋场掩埋了70万盒视频游戏。这是电子游戏历史上的历史性事件-被广泛传言，一些人认为这是一个城市神话。\n该公司选择埋葬的图书已经被广泛抨击，事实证明是不可能出售的。其中一款，“外星生物”，被讽刺为有史以来最糟糕的视频游戏。\n三十多年来，子弹一直躺在那里，不断退化。但在2014年，安德鲁·莱因哈德(Andrew Reinhard)和同事们对该遗址进行了挖掘。事实上，埋葬并不是一个城市神话-莱因哈德挖出了1300发子弹。eBay上售出了数百款ET游戏，总售价约为108,000美元(83,500 GB)。\n虽然这些游戏一开始似乎都不能玩，但一名玩家买了一份小行星的副本，通过清理和重新连接一些电子设备，能够让它重新工作。\n在新墨西哥州的尘土中，可能只需要几十年的时间，就会使墨盒完全无法回收。因此，在不久的将来，将电子产品视为文物的考古学家面临着一个挑战：时间可能很快就会流逝。\n事实上，电子游戏考古可能是相当紧迫的，因为大规模生产的游戏的实际物理形式是短暂的。而编写这些游戏所需的逻辑和技术诀窍很容易就会丢失。这就是为什么计算机存档项目寻求存储旧游戏的数字形式，以努力长期保存它们的部分原因。\n但电子游戏的保存只是第一步。埋葬中的神秘迷宫桌提醒我们，即使有很好的记录，完全理解一场游戏完全是另一回事。也许我们永远不会完全掌握它。有点讽刺的是，“埋葬”给我们带来了一条死胡同。\n公平地说，说明书确实警告过我们。“不知不觉中，”它写道，“你就会被埋葬！”\n通过在Facebook上为我们点赞加入100万未来粉丝，或者在Twitter或Instagram上关注我们。\n如果你喜欢这个故事，可以注册bbc.com每周专题时事通讯，名为“基本清单”(The Essential List)。精选BBC“未来”、“文化”、“资本”和“旅游”中的故事，每周五发送到您的收件箱。", "note_en": "With the digital equivalent of trowels and shovels, archaeologists are digging into the code of early video games to uncover long forgotten secrets that could have relevance today.\n “You and your team of archaeologists have fallen into the ‘catacombs of the zombies’.” A miserable situation, to be sure. But this was the chilling trial that faced players of Entombed, an Atari 2600 game, according to  the instruction manual.\n The catacombs were an unforgiving place. A downward-scrolling, two-dimensional maze that players had to navigate expertly in order to evade the “clammy, deadly grip” of their zombie foes. An archaeologist’s nightmare.\n Released in 1982, Entombed was far from a best-seller and today it’s largely forgotten. But recently, a computer scientist and a digital archaeologist decided to pull apart the game’s source code to investigate how it was made.\n   There was always something intriguing about Entombed, recalls John Aycock at the University of Calgary, in Alberta, Canada. And because it had fallen into obscurity, it hadn’t been pulled apart and analysed in depth before – one the main reasons Aycock and his co-author Tara Copplestone at the University of York, UK,  were drawn to Entombed as a subject to study over the other 500 games made for the Atari 2600 console.\n The pair are among a growing number of “video game archaeologists” who are unearthing long forgotten pieces of software and pulling them apart. Inside they are finding clues to how the early days of video gaming came about, but also secrets that can help modern programmers with some of the problems they are facing today.\n  Like intrepid explorers of catacombs, Aycock and Copplestone sought curious relics inside Entombed. But they got more than they bargained for: they found a mystery bit of code they couldn’t explain. It seems the logic behind it has been lost forever.\n  Maze-navigating games were very common back in the late 1970s and early 1980s, but the method used to generate a maze varied, depending on the programmer. In the age of Atari, games had to be designed with incredible skill because the computer systems that ran them were so limited. (  Read more about the mind of a maze-builder.)\n Although the blocky, two dimensional mazes from entombed might look simple by the standards of today’s computer graphics, in 1982 you couldn’t just design a set of mazes, store them in the game and later display them on-screen – there wasn’t enough memory on the game cartridges for something like that. In many cases, mazes were generated “procedurally” – in other words, the game created them randomly on the fly, so players never actually traversed the same maze twice.\n But how do you do get a computer program to avoid churning out a useless maze with too many walls, or an otherwise impenetrable floorplan?\n  Aycock understood the trickiness of the problem. He thought there was a good chance he’d find some clever process at work in the depths of Entombed.\n “It was a very deep rabbit hole,” he recalls. “As I dug into this maze algorithm, it became clear that this was something that seemed to be fairly unique to this maze game.”\n It turned out that the maze is generated in a sequence. The game needs to decide, as it draws each new square of the maze, whether it should draw a wall or a space for the game characters to move around in. Each square should therefore be “wall” or “no wall” – “1” or “0” in computer bits. The game’s algorithm decides this automatically by analysing a section of the maze. It uses a five-square tile that looks a little like a Tetris piece. This tile determines the nature of the next square in each row.\n How? That’s the fascinating part. The fundamental logic that determines the next square is locked in a table of possible values written into the game’s code. Depending on the values of the five-square tile, the table tells the game to deposit either wall, no wall or a random choice between the two.\n  It seems straightforward, but the thing is, no-one can work out how the table was made.\n Aycock and Copplestone have tried retro-engineering the table. They looked for patterns in the values to try and reveal how it was designed, but this was to no avail. Whatever the programmer did, it was a stroke of mild genius. Every time the game is played, a reliably navigable maze is pumped out. Were the table’s values random or even slightly different, the maze would likely fail to be drawn with a playable path through it. It just seems impossible to explain. (  Read about how maths can help you solve mazes.)\n  “The abnormality of the table was just quite striking,” says Copplestone. She says this is an example of a classic conundrum in archaeology. “I think there’s this assumption that when we find things, we know what they are – if we pull a spearhead out of the ground, we know what it is,” she says. “[But] more often than not, we have no idea what’s happening.”\n  “The struggle I have as a scientist is, I think that there should be some logical way that this will all make sense and there really doesn’t seem to be.”\n The best guess the pair have is that the programmer behind the maze algorithm must have manually fine-tuned the table values until the game worked as desired, but that still doesn’t really explain the logic behind it.\n  During their research, Aycock and Copplestone were able to interview one of the people involved in the game’s production, Steve Sidley.\n He too remembered being confused by the table at the time. “I couldn’t unscramble it,” he told the researchers. And he claimed it had been the work of a programmer who developed it while not entirely sober: “He told me it came upon him when he was drunk and whacked out of his brain.” Aycock tried to contact the programmer in question but got no response.\n Maybe no-one ever really understood the logic of the algorithm. But there it is, in a 1982 Atari game, posing a seemingly unanswerable question.\n  Andrew Reinhard, also at the University of York, writes about and practices video game archaeology. He says Aycock and Copplestone’s work on Entombed is another hint that there are many gems just waiting to be found in old games and old software, generally.\n “I have a feeling that what has happened in Entombed has happened more frequently than not, it’s just we haven’t learned what games have this stuff,” he says.\n The idea that archaeologists would be intrigued by video games from just a few decades ago may sound strange to some. We’re rather more used to seeing avid excavators dust off beautiful vases buried in mud for millennia, or similar treasures. But Reinhard points out that video games have become a major commercial enterprise and an important part of our culture. Game artefacts store up their own record of human history.\n Digital archaeologists can dig for clues about the evolution of programming, unravel the workings of old technology and gain insights to the fading culture of the 20th Century – by excavating video games. Another programmer, Alexei Pepers, at Improbable Canada, even refers to retro games as archaeology “sites”.\n  She says it was heartening to hear that some early 1980s programmer may have inexplicably tweaked their code just to get Entombed running – that sort of trial-and-error fiddling is a well-known process in programming. “I found that so relatable, certainly in my own work,” says Pepers.\n And uncovering the methods by which early game programmers overcame the technical constraints of the systems they worked with is not just academically interesting. It has relevance today.\n Take the programming of virtual reality games and experiences, for example. You couldn’t imagine something more visually different from a two-dimensional Atari maze game. But the demands on the programmer are similar in nature.\n “You’re very constrained technically because [a VR game] has to run at very high frame rates,” explains Pepers. “And you’re constrained in how the player can move and what they can do.”\n By researching tricks and work-arounds from a former era, perhaps 21st Century programmers, pushing today’s technology to its limits, might learn something genuinely useful.\n With Entombed, Aycock believes the maze algorithm they uncovered is a good example of how creative game programmers can get.\n “From a modern perspective, I think it&#39;s also an interesting case study looking at how to solve a problem in extremely constrained time and (memory) space,&#34; he adds.\n  It is not just code that digital archaeologists comb through. In 1983, Atari buried 700,000 cartridges of video games at a landfill site in Alamogordo, New Mexico. It was a historic event in video game history – widely rumoured and discredited by some as an urban myth.\n The titles the firm chose to bury had been widely panned and were proving impossible to sell. One, ET the Extra-Terrestrial, has been lampooned as  the worst video game ever.\n For more than three decades, the cartridges lay there, degrading. But in 2014, Andrew Reinhard and colleagues went on a dig at the site. The burial was not, in fact, an urban myth – Reinhard dug up 1,300 cartridges. Hundreds of the ET games  were sold on Ebay, for a total of about $108,000 (£83,500).\n  While none of the games initially seemed to be playable, one gamer bought a copy of Asteroids and,  by cleaning up and reconnecting some of the electronics, was able to get it working again.\n It may only have taken a few more decades in the New Mexico dust to make the cartridge completely unsalvageable. There’s a challenge, then, awaiting archaeologists who treat electronics as artefacts in the near future: time may be rapidly running out.\n Video game archaeology is possibly quite urgent, in fact, because the actual physical form of mass-produced games is ephemeral. And the logic and know-how that went into programming those games can so easily be lost. That’s partly why computer archiving projects  seek to store the digital form of old games, in an effort to preserve them long term.\n But the preservation of video games is only the first step. The mystery maze table in Entombed reminds us that, even with a good record, fully understanding a game is another thing entirely. Maybe we’ll never quite grasp it. Entombed presents us – somewhat ironically – with a dead-end.\n The instruction manual, to be fair, did warn us. “Before you know it,” it read, “you’ll be entombed!”\n  Join one million Future fans by liking us on    Facebook , or follow us on    Twitter  or    Instagram .\n If you liked this story,    sign up for the weekly bbc.com features newsletter , called “The Essential List”. A handpicked selection of stories from BBC Future, Culture, Capital, and Travel, delivered to your inbox every Friday.", "posttime": "2020-06-13 18:14:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,电子游戏,无懈可击,origins", "title": "一款无懈可击的电子游戏的神秘起源", "title_en": "The mysterious origins of an uncrackable video game", "transed": 1, "url": "https://www.bbc.com/future/article/20190919-the-maze-puzzle-hidden-within-an-early-video-game", "via": "", "real_tags": ["游戏", "电子游戏", "无懈可击", "origins"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006397, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章是我第一次公开宣布我的新的Linux包管理器和部署工具-Hermes。\n熟悉Nix或Guix的人会觉得很自在，或者您可能会认为Hermes有点像docker，您可以将软件包从源代码构建到可以相互引用的目录中，而不是按层构建映像。\n以下是一些简单但不全面的示例，旨在展示使用Hermes的…是什么样子。\nHermes试图创建一个简单但功能强大的包管理工具，您可以在其中维护对软件依赖性的完全控制。\n您还可以认为Hermes是我简化Nix和Guix背后的一些思想和实现的尝试，这些简化包括更少的代码、更少的命令、更少的C++、更少的monad、更少的懒惰函数编程、更少的glibc。如果这些对你来说不是很重要，也不用担心，关键是你不应该真的需要知道它们。\n我试图简化Nixos和Guix开创的打包模型。\nHermes包定义只是一些函数，当调用这些函数时，可以通过运行./configure和make等命令来构建软件。如果软件包已经安装，Hermes就不会费心再次构建它。\n与“传统的”包管理器的主要区别在于，每个包都有一个唯一的安装目录，因此不需要任何包冲突处理。\n爱马仕本身很瘦，当静态链接和压缩时，它可以放在软盘上，当省略某些功能时，它可以做得更小。\nHermes只有几个核心命令，Hermes build、Hermes cp和Hermes gc，到目前为止，这些命令足以构建软件包、执行远程部署和删除不需要的软件包。\n我不喜欢docker守护进程，也不喜欢nix和guix构建守护进程。Hermes没有使用One，而是通过其他机制工作，比如锁文件和策略setuid。\n包是用Janet编程语言编写的，带有一小部分额外的函数，这些函数在构建软件的上下文中是有意义的。\n创建Hermes包时，编写一个小函数将包安装到动态作用域变量pkg-out所指向的路径中，只需引用它们就可以自动检测和构建所有依赖项。\n(使用../PRELUDE)(IMPORT../CORE)(defsrc ed-src：url&#34；http://ftpmirror.gnu.org/ed/ed-1.16.tar.lz&#34；：hash&#34；sha256:cfc07a14ab048a758473ce222e784fbf031485bcd54a76f74acfee1f390d8b2c&#34；)(defpkg ed：Builder(fn[](core/link-/bin/sh)(os/setenv&#34；path&#34；(Join-pkg-path&#34；：&#34；&#34；/bin&#34))(os/setenv&#34；path&#34；(Join-pkg-path&#34；：&#34；&#34；/bin&#34；[core/coreutils core/sed core/grep core/awk core/GCC core/make]))(os/setenv&#34；CFLAGS&#34；*default-cflag*)(os/setenv&#34；LDFLAGS&#34；*default-ldflag*)(unpack-src ed-src)(sh/$./configure-prefix=^(dyn：pkg-out))(sh/$make。\n您应该注意到，Janet本身是一种小但功能强大的通用编程语言，所以您使用hermes学习的技能对于编写各种优秀的软件都很有用。\n如果您是一位经验丰富的Nix或Guix用户，请随时尝试Hermes，其他用户可能希望等到更多的基础工作就绪后再使用。", "note_en": "This post is the first public announcement of my new package manager anddeployment tool for linux -  hermes.\n   Those familiar with Nix or Guix will feel right at home, oryou could think of hermes a bit like docker, where instead of building images in layers,you are building software packages from source into directories thatcan reference each other.\n  The following are some simple and non comprehensive examples, designed to show what using hermes looks like…\n              Hermes is an attempt at creating a simple but powerful package managementtool where you maintain total control of your software dependencies.\n You could also consider Hermes my attempt at simplifying some of the ideas andimplementation behind  Nix and  Guix.These simplifications range from less code, fewer commands, no C++, no monads,no lazy functional programming, no glibc. Don’t worry if those don’t mean muchto you, the point is you shouldn’t really need to know about them.\n       I’ve tried to simplify the model of packagingthat Nixos and Guix have pioneered.\n Hermes packages definitions are just functions, that when called, build softwareby running commands like  ./configure and  make. If the packageis already installed, hermes doesn’t bother building it again.\n The main difference from ‘traditional’ package managers, is each packagehas a unique install directory, so there doesn’t need to be any package conflict handling.\n  Hermes itself is lean, it fits on a floppy disk when statically linked andcompressed, and can be made even smaller when omitting certain features.\n Hermes only has a few core commands, hermes build,  hermes cp, and  hermes gc, which so far are enough to build packages,do remote deployments and remove unwanted packages.\n   I am not a fan of the docker daemon, or the nix and guix build daemons. Hermes does not useone, instead working via other mechanisms such as lock files and strategic setuid.\n  Packages are written in the  Janet programming language witha small set of extra functions that make sense in the context of building software.\n When you create a hermes package you write a small function for installingthe package into the path pointed to by the dynamically scoped variable :pkg-out.All dependencies are automatically detected and built simply by referencing them.\n  (use ../prelude)(import ../core)(defsrc ed-src :url &#34;http://ftpmirror.gnu.org/ed/ed-1.16.tar.lz&#34; :hash &#34;sha256:cfc07a14ab048a758473ce222e784fbf031485bcd54a76f74acfee1f390d8b2c&#34;)(defpkg ed :builder (fn [] (core/link-/bin/sh) (os/setenv &#34;PATH&#34; (join-pkg-paths &#34;:&#34; &#34;/bin&#34; [core/coreutils core/sed core/grep core/awk core/gcc core/make])) (os/setenv &#34;CFLAGS&#34; *default-cflags*) (os/setenv &#34;LDFLAGS&#34; *default-ldflags*) (unpack-src ed-src) (sh/$ ./configure --prefix= ^ (dyn :pkg-out)) (sh/$ make -j (dyn :parallelism)) (sh/$ make install)))\n You should note that Janet itself is a small but powerfulgeneral purpose programming language, so the skills you learn usinghermes are useful for writing all sorts of great software.\n    If you are an experienced Nix or Guix user, feel free to give hermes a try, otherusers may wish to hold off until more ground work is in place.", "posttime": "2020-06-13 17:57:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "希腊神话,hermes", "title": "&lt;希腊神话&gt;赫耳墨斯", "title_en": "Hermes", "transed": 1, "url": "https://acha.ninja/blog/introducing_hermes/", "via": "", "real_tags": ["希腊神话", "hermes"]}, {"category": "", "categoryclass": "", "imagename": "373df4525cdb41f314d57445b20f452b.jpg", "infoid": 1006396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "回到我的账户&amp；隐私我们很遗憾看到你离开！如果您要删除您的帐户，请执行以下步骤：\n在文本频道中解释您要删除您的帐户，并提供您的Rainway电子邮件和用户名。", "note_en": "Back to My Account &amp; Privacy We’ll be sorry to see you go! If you want to delete your account, please follow these steps:\n Explain in the text channel that you want to delete your account and give your Rainway email and username.", "posttime": "2020-06-13 17:24:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "强制,forces,帐户", "title": "Rainway强制注册不一致以删除您的帐户", "title_en": "Rainway forces signing up to Discord in order to delete your account", "transed": 1, "url": "https://rainway.com/support/account-and-privacy/how-do-i-delete-my-account/", "via": "", "real_tags": ["强制", "forces", "帐户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着我学习更多关于钢笔和墨水的知识，我开始收集更多的信息，以了解着色剂类型和墨水特性之间的区别。\n自来水钢笔墨水基本上是含有着色剂和其他化学物质的水，这些都是正常工作所必需的。每个制造商都有自己的配方。\n到目前为止，染料墨水是最常见的。它们的维护费很低。染料是水溶性的，所以即使它们确实干燥了，你几乎总是可以用水来清洗它。你仍然应该定期清洗你的钢笔，但不这样做不会损害你的钢笔。\n着色墨水是将微小的颜料颗粒添加到墨水中以使墨水看起来更深的墨水。它们一般是快干和防水的。如果长时间放置，它们会堵塞自来水笔。\n绘图墨水、印度墨水或书法墨水都是为浸渍笔设计的，不应该用在自来水笔中，因为它们会堵塞钢笔，而且它的残留物无法清除。\n一些艺术家的油墨和颜料制造商，如温莎&牛顿公司(Winsor&amp；Newton)，将他们的一些书法墨水推销为适合制作自来水笔。他们不是！书法墨水是有色的，它们会堵塞自来水笔。\n我非常喜欢保留链接列表，所以这里有一些到生产着色墨水的品牌的官方网站的链接(按字母顺序)：\n铁胆墨水至少有1500年的历史了。它们今天仍然在使用，因为它们非常防水。随着时间的推移，它们会使纸张逐渐氧化和变黑，有时会腐蚀纸张，有时还会腐蚀钢笔。现代铁胆墨水被认为是相当安全的，但如果放置太长时间，它们可能会损坏钢笔。笔尖由不锈钢制成，钢笔由金属制成，金属与墨水接触的地方最容易受到腐蚀；由金、钛、钯、铂、银制成的笔尖一般都是耐腐蚀的。\n“防弹”油墨是由面人制作的，以结合染料和颜料油墨的最佳特性。他们使用一种特殊的配方，使它们与纸张中的纤维素纤维永久结合，这使得“防弹”油墨具有颜料油墨的持久性，而染料油墨的维护性较低。\n底纹是油墨的一种属性，它使油墨在某些区域看起来较暗，而在其他区域使其看起来较浅。当你写作时，墨水往往集中在字母的开头和结尾，以及两行相交的地方。效果是从一个字母到另一个字母的颜色强度的独特渐变。\n超细笔尖通常放不下足够的墨水来获得阴影，而弹性笔尖放得太多。平均湿度被认为是最适合着色的。欧洲的中尖和日本的宽尖往往是最佳遮阳的最佳部位。\n论文也起到了很大的作用。更平滑的纸张产生更多的阴影，因为墨水在干燥时有更多的时间汇集到不同的区域。\n光泽是一种外观，干燥的墨水闪耀着不同的颜色，从一个角度看似乎是金属的。一般来说，你的钢笔越湿，一旦墨水干了，你就会获得更多的光泽。宽而灵活的笔尖在这种情况下是最好的。\n光泽非常依赖纸张，所以光滑、吸水性较差的纸张与较湿的钢笔相结合会产生最大的光泽。\n不利的一面是，即使在墨水完全干燥之后，具有高光泽的墨水也更容易被涂抹。\n微光油墨在油墨中添加了少量微光(闪光)颗粒。微小的颗粒可以是金、银、铜、青铜、云母等。微光会落在钢笔或瓶子的底部，所以当使用微光墨水时，你需要在装满钢笔之前摇晃瓶子，并在写字时频繁旋转钢笔，以便微光保持悬浮状态。\n同样，就像在光泽的情况下，宽的，湿的笔尖会滴下更多的墨水，更好地展示闪光剂。\n一些闪亮的墨水实际上会变亮，而一些光泽很强的墨水会有一点额外的闪光。但微光比光泽更容易预测，即使用超细的笔尖也能看到。\n微光墨水很适合用在示威者的钢笔中，因为更容易看到微光何时从悬架中脱落，而且它们看起来也很酷！\n微光墨水比大多数墨水的维护性要高一些，因为闪光颗粒会堵塞钢笔，而且很难完全清除。", "note_en": "As I’m learning more about  fountain pens and inks, I’m starting to gather more info to understand what’s the difference between colorant types and ink properties.\n    Fountain pen ink is basically water with colorant and other chemicals required for proper functioning. Each manufacturer has their own formula.\n  Dye-based inks are by far the most common. They are low-maintenance. Dyes are water-soluble, so even if they do dry out, you can almost always clean it with just water. You should still clean your pens regularly, but failing to do so won’t harm your pen.\n   Pigmented inks are inks that have tiny particles of pigment added to the ink to make it look darker. They are generally quick-drying and water-resistant. They will clog the fountain pens if left sitting for a long time.\n Drawing inks, India inks, or Calligraphy inks are designed for dip pens and should not be used in fountain pens, since they will clog then pen and its residue cannot be removed.\n Some manufacturers of artists’ inks and paints, such as Winsor &amp; Newton, market some of their calligraphy inks as being suitable for fountain pens. They aren’t! Calligraphy inks are pigmented and they will clog a fountain pen.\n I’m a big fan of keeping lists of links, so here’s some links to official websites of brands producing pigmented inks (alphabetical order):\n     Iron gall inks are at least 1500 years old. They are still in use today because they are very water resistant. They oxidize and blacken the paper gradually over time, sometimes corroding both the paper and occasionally the pen. Modern iron gall inks are considered pretty safe, but they can damage the pen if left sitting for too long. The nibs made of stainless steel, and pens made from metal, where the metal touches the ink are most susceptible to be corroded; nibs made of gold, titanium, palladium, platinum, silver, are generally resistant to corrosion.\n      “Bulletproof” inks are made by  Noodler’s in order to combine the best features of dye-based and pigment-based inks. They use a special formula that causes them to bind permanently with the cellulose fibers in paper, which gives “Bulletproof” inks the permanence of pigment-based inks with the low-maintenance of dye-based inks.\n      Shading is a property of the ink that makes it looks darker in some areas and lighter in others. As you write, ink tends to pool at the beginning and end of letters, as well as where two lines intersect. The effect is a unique gradation of color intensity from letter to letter.\n Extra fine nibs generally don’t put enough ink down to get shading, and flex nibs put too much. Average wetness is considered the best for shading. European medium nibs and Japanese broad nibs tend to be the sweet spot for best shading.\n The paper also plays a big role. Smoother paper produces more shading since the ink has more time to pool into different areas when it dries.\n     Sheen is an appearance that the dry ink shines with a different color, that seems metallic when viewed at an angle. Generally, the wetter your pen, the more sheen you get once the ink dries. Broad and flex nibs are the best in this case.\n Sheen is very paper dependent, so again smooth, less-absorbent paper in combination with wetter pens will produce the most sheen.\n On the downside, inks with high amounts of sheen are more prone to smearing, even after the ink is completely dry.\n    Shimmer inks have little shimmer (glitter) particles added to the ink. The tiny particles can be either gold, silver, copper, bronze, mica, etc. The shimmer settles to the bottom of the pen or bottle, so when using shimmer inks you need to shake the bottle before filling a pen, and rotate the pen frequently when writing so the shimmer stays in suspension.\n Again like in the case of sheening, broad, wet nibs will drop more ink and show off the glitter better.\n Some shimmer inks will actually sheen and some inks with a strong sheen have a bit of added shimmer. But shimmer is much more predictable than sheen and can be seen even with extra-fine nibs.\n Shimmer inks are great for using in demonstrators pens, because it’s easier to see when the shimmer has fallen out of suspension and they also look very cool!\n Shimmer inks are a bit higher maintenance than most inks, because the glitter particles can clog the pen and can be hard to completely clean out.", "posttime": "2020-06-13 16:51:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "钢笔,pen,墨水", "title": "自来水钢笔墨迹属性", "title_en": "Fountain Pen Ink Properties", "transed": 1, "url": "https://crlf.site/log/notes/200430-inks/", "via": "", "real_tags": ["钢笔", "pen", "墨水"]}, {"category": "", "categoryclass": "", "imagename": "fa1352e11ed073d6e470e70a455cb283.jpg", "infoid": 1006394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的语言千差万别，几乎不可能找到一个或几个单词在所有语言中发音相同。根据研究，除了有一个词是所有人类语言都共有的。惊喜，惊喜……这个词是“嗯”。很奇怪，哈！嗯，事实证明，这可能是一个普遍的词。\n让我们先更详细地解释一下这个单词的用法，我们来看看下面这段虚构的对话：\n演讲者A做了发言，演讲者B紧接着问了一个问题：“在哪里？”这只针对原始陈述的一部分，即，可以推断说话人B没有困难地理解他们决定搬到某个地方的消息，但是他/她大概错过了最后一个词。因此，她/他要求重复这一信息，问“在哪里？”而说话人A在他/她的下一轮中提供了这一信息。这就是对话分析人士所说的修复。\n但是，如果由于某种原因(I.G.。极端背景噪音)，演讲者(B)未能理解整个陈述，想要求重复整个陈述？(你认为在这种情况下对话会如何展开？这就是“嗯”这个词的用武之地。请进行以下对话：\n呵呵，这是一个非常具体的修复策略，它不是针对声明的某一部分，而是针对整个声明。这就是为什么作为对一场闹剧的回应而提供的修复是相当长和详细的，通常会重申整个声明。\n现在，这里是有趣的部分。嗯，这个词很可能是一个被所有人类语言共享的通用单词。奈梅亨马克·普朗克心理语言学研究所的马克·丁格曼斯(Mark Dingemanse)、弗朗西斯科·托雷拉(Francisco Torreira)和约翰·尼克·恩菲尔德(Nick Enfield)等对话分析师进行了一项有趣的跨语言研究，他们在研究中表明，呵呵可能是一个普遍存在的词。他们录下了来自5大洲31种方言的非正式对话片段，并提出‘嗯’这个词(及其变体)可能是一种普遍的修复启动者，存在于所有语言中，执行相同的功能，在不同的语言中听起来大致相同。下面是一个粗略的插图：\n这项研究在人文学科中具有重要意义。它启发了我们，让我们了解了对话是如何跨文化进行的，并揭开了人类交流中的一些重要微妙之处。这就是为什么作者被授予搞笑诺贝尔奖并不令人惊讶。", "note_en": "Our languages are incredibly diverse and it is highly unlikely to find a word or a handful of words that sound the same in all languages. Except that there is a word that is shared by all human languages,  according to research. Surprise, surprise..the word is ‘  huh’.  Weird, huh! Well, it turns out that this is probably a universal word.\n     Let’s explain first how this word works in more detail. Consider the following made-up conversation:\n  Speaker A makes a statement, and Speaker B follows up on that by asking the question “Where?” which targets only a portion of the original statement, i.e., it is possible to infer that Speaker B had no trouble comprehending the message that they decided to move somewhere, but s/he presumably missed the final word. So, s/he requested a repetition of this information by asking “where?” and Speaker A supplied this information in his/her next turn. And this is what is termed by conversation analysts as    repair.\n    But, what if, for some reason (i.g. extreme background noise), speaker B failed to comprehend the whole statement and wanted to request the repetition of the whole statement? How do you think the dialogue would have unfolded in this case? That’s where the word  huh comes in. Take the following dialogue:\n     Huh is a very specific repair strategy that does not traget some part of the statement but rather the statement as a whole. That is why repairs that are provided as a response for a  huh are quite long and elaborate, typically reiterating the whole statement.\n Now, here is the fun part. The word  huh may very well be a universal word that is shared by all human languages. Conversation analysts Mark Dingemanse, Francisco Torreira and Nick Enfield, at the Max Planck Institute for Psycholinguistics in Nijmegen, conducted  an interesting cross-linguistic study in which they have shown that  huh is possibly a universal word. They recorded bits of informal conversation from 31 dialects across 5 continents and suggested that the word ‘  huh’ (and its variants) is possibly a universal repair initiator that exists in all languages, performs the same function and sounds roughly the same across languages. Here is a sketchy illustration:\n      This study has had great importance in the humanities. It has enlightened us with how conversations work cross-culturally and unraveled important subtleties in human communication. That is why it is not surprising that the authors have been awarded an  Ig Nobel Prize.", "posttime": "2020-06-13 16:50:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,exists,对话", "title": "根据研究，这个词存在于所有人类语言中", "title_en": "The word that exists in all human languages, according to research", "transed": 1, "url": "https://thelanguagenerds.com/this-is-the-one-word-that-exists-in-all-human-languages-according-to-research/", "via": "", "real_tags": ["人类", "exists", "对话"]}, {"category": "", "categoryclass": "", "imagename": "29e37266e4331dfaa9aefc081df4dddb.jpg", "infoid": 1006393, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "铍-8和氦-4放射性衰变的反常现象表明存在一种新的自然力。这是美国一群理论家得出的结论，他们仔细研究了匈牙利核物理学家在过去五年中进行的实验数据。研究小组发现，这两种不同同位素的结果在假设玻色子的质量和相互作用强度上都是一致的，该玻色子将携带长期寻求的第五种力。\n粒子物理的标准模型告诉我们，物质粒子通过四种力相互作用：电磁力、强力、弱力和重力。但理论家长期以来一直假设存在其他力量，包括可能调解暗物质粒子与普通物质之间相互作用的“暗光子”。\n匈牙利核研究所(ATOMKI)的阿提拉·克拉斯纳霍凯(Attila Krasznahorkay)和他的同事在进行铍实验时，就是在寻找这样的粒子。正如他们在2015年一篇鲜为人知的论文中所报道的那样，他们向锂-7制成的目标发射质子，以产生铍-8的原子核。然后，他们测量了在不稳定的铍同位素随后的衰变中发出的每个电子和正电子的轨迹之间的角度。\n如果标准模型正确地描述了这种衰变，那么随着两个粒子之间夹角的增加，发射的电子-正电子对的数量应该会逐渐减少。但Krasznahorkay和他的同事们反而发现，在大约140°的角度上，分布是增加的，或者说是凹凸不平的。他们将此解释为由于铍-8在其衰变的一小部分中衰变为以前未知的粒子(在该粒子随后解体为电子和正电子之前)，计算出新粒子的质量约为17 MeV/c2。\n仅仅一年后，加州大学欧文分校的乔纳森·冯和他的同事们发表了一份对克拉斯纳霍凯团队结果的理论分析，其他人才注意到了这一点。冯的团队得出的结论是，如果存在的话，这个有问题的粒子不是暗光子，而是他们所说的“原恐惧性”规范玻色子-一种携带力量的粒子，比质子更容易与电子和中子相互作用。\n对于其他理论家来说，这种不同寻常的相互作用让人对所宣称的发现产生了怀疑。更重要的是，自那以后，没有其他实验组重现了这一反常的结果。事实上，瑞士欧洲核子研究组织(CERN)实验室的NA64实验已经缩小了这种粒子可能相互作用强度的范围，因为它寻找了它与电子耦合的证据，但什么也没有找到。\nKrasznahorkay和他的同事们并没有被吓倒，他们继续前进。他们在2017年至2018年间重建了探测器，发现140°处的凸起仍然存在。更令人吃惊的是，他们在氦-4的衰变过程中发现115°处也有类似的隆起点。值得注意的是，他们计算出，造成这种反常的粒子质量也将约为17 MeV/c2。\n这一结果是在2019年秋季通过arxiv上的预印本报道的，并引发了耸人听闻的头条新闻，宣布诺贝尔奖可能即将到来。然而，冯意识到，要确定最新数据是否真的与旧数据一致，还需要做更多的工作。在同样在arxiv上的一份新的预印本中，他和欧文的两位理论家同事chris verhaaren和tim tait不仅检查了两个结果是否在假定的新玻色子的质量上一致，而且还计算了粒子在每种情况下的相互作用强度。\n冯、泰特和维哈伦指出，在这两个实验中，铍-8和氦-4的衰变速度相似。但他们表示，这并不一定意味着新玻色子与每个原子核中的夸克之间的相互作用强度相似，他们指出，每种情况下的激发态都有不同的量子数和不同的激发能量。他们补充说，铍-8的测量是在共振上进行的，而氦-4的测量是在两个共振之间进行的。\n在考虑了所有这些因素后，三人得出结论，在这两种情况下，新粒子确实以相同的强度相互作用。具体地说，他们发现，根据他们对铍-8数据的分析，利用原憎恶玻色子的性质计算出的氦-4衰减率与氦数据的衰减率是一致的。更重要的是，他们说，这样接近的协议是不可能与任何其他类型的假设力量载体。冯说：“对于其他被提出用来解释铍数据的新粒子，预测的氦速率可能会相差几个数量级。”“所以，坦率地说，这种和谐是非同寻常的。”\n冯和他的同事们说，为了一劳永逸地解决这个问题，其他实验者必须尝试重现结果。但他们也提出了几项新的测量方法，可以提供额外的确认。这些只需要对现有的实验装置进行简单的修改，包括收集数据以更好地理解背景过程，以及测量碳-12的衰变-他们精确地预测了碳-12的速率。他们写道：“如果预测得到证实，这些测量将提供压倒性的证据，证明已经发现了第五种力量。”\n其他理论家对新的分析表示欢迎。石溪大学(Stony Brook University)的鲁文·埃西格(Rouven Essig)同意，建立互动强度的一致性很重要，而麻省理工学院(Massachusetts Institute Of Technology)的杰西·泰勒(Jesse Thaler)也鼓励其他实验者加入竞争。事实上，他认为这是至关重要的。他说：“只有来自独立实验的确认才会让我对ATOMKI的结果有很大的信心。”\n一个计划测试异常结果的合作项目是总部设在美国的Darklight。这将通过从杰斐逊实验室的CEBAF注入器向钽目标发射电子来寻找17 MeV/c 2玻色子的证据。根据麻省理工学院的联合发言人理查德·米尔纳的说法，假设科学批准和资金即将到来，这项实验应该会在未来几年内产生结果。", "note_en": "Anomalies in the radioactive decay of beryllium-8 and helium-4 point to the existence of a new force of nature. That is the conclusion of a group of theorists in the US, who have scrutinized data from experiments carried out by nuclear physicists in Hungary over the past five years. Results from the two different isotopes agree on both the mass and interaction strength of the hypothetical boson that would carry the long-sought fifth force, the team found.\n   The Standard Model of particle physics tells us that matter particles interact with one another via four forces: electromagnetic; strong; weak; and gravity. But theorists have long hypothesized the existence of other forces, including “dark photons” that might mediate interactions between particles of dark and ordinary matter.\n It was just such a particle that  Attila Krasznahorkay of the Institute of Nuclear Research (ATOMKI) in Hungary and colleagues were hunting when carrying out experiments on beryllium. As they reported in a little-noticed paper in 2015, they fired protons at targets made from lithium-7 to create nuclei of beryllium-8. They then measured the angles between the trajectories of each electron and positron given off in the subsequent decays of the unstable beryllium isotope.\n  If the Standard Model correctly describes such decays, the number of emitted electron-positron pairs should gradually drop off as the angle between the two particles increases. But Krasznahorkay and colleagues instead found an increase, or bump, in the distribution at an angle of about 140°. They interpreted this as due to beryllium-8 decaying to a previously unknown particle in a tiny fraction of its decays (before that particle then disintegrates into an electron and positron), calculating the mass of the new particle to be about 17 MeV/c 2.\n It was only a year later when  Jonathan Feng and colleagues at the University of California, Irvine, published a theoretical analysis of Krasznahorkay’s team’s results that others took notice. Feng’s group concluded that the particle in question, if it exists, is not a dark photon but what they called a “protophobic” gauge boson – a force carrying particle that interacts more readily with electrons and neutrons than it does protons.\n For other theorists, such unusual interactions cast doubt on the claimed discovery. More importantly, no other experimental group has since reproduced the anomalous results. In fact, the NA64 experiment at the CERN laboratory in Switzerland has narrowed down the range of such a particle’s possible interaction strengths by looking for evidence of its coupling to electrons and finding nothing.\n  Undeterred, Krasznahorkay and colleagues have pressed on. They rebuilt their detector between 2017 and 2018, and found that the bump at 140° remains. More strikingly, they found a similar bump at 115° in the decay of helium-4. Remarkably, they calculated that the particle responsible for this anomaly would also have a mass of about 17 MeV/c 2.\n That result was reported in autumn 2019 via a  preprint on  arXiv and prompted sensationalist headlines declaring that a Nobel prize might be in the offing. However, Feng realized that more could be done to establish whether the latest data really do stack up consistently against the old. In a  new preprint, also on  arXiv, he and a couple of theorist colleagues at Irvine,  Chris Verhaaren and  Tim Tait, not only check whether the two results agree on the mass of a putative new boson but also calculate what the particle’s interaction strength would be in each case.\n Feng, Tait and Verhaaren point out that beryllium-8 and helium-4 decay at similar rates within the two experiments. But they say that that does not necessarily imply similar interaction strengths between the new boson and the quarks in each nucleus, noting that the excited states in each case have different quantum numbers and different excitation energies. They add that the beryllium-8 measurement was done on resonance while that of helium-4 was carried out between two resonances.\n  After factoring all these things in, the trio concluded that the new particle does indeed interact with the same strength in both cases. Specifically, they find that the helium-4 decay rate calculated using the properties of the protophobic boson from their analysis of the beryllium-8 data agrees with the rate from the helium data. What is more, they say that such close agreement is not possible with any other type of hypothetical force carrier. “For other new particles proposed to explain the beryllium data, the predicted helium rate can be orders of magnitude off,” says Feng. “So, this concordance is, frankly, remarkable.”\n To settle the issue once and for all, Feng and colleagues say that other experimentalists must try to reproduce the results. But they also propose several new measurements that could provide additional confirmation. Requiring only simple modifications of the existing experimental set-up, these include gathering data to better understand background processes as well as measuring decays from carbon-12 – whose rate they predict precisely. “If the predictions are confirrmed, these measurements will provide overwhelming evidence that a fifth force has been discovered,” they write.\n  Other theorists welcome the new analysis.  Rouven Essig of Stony Brook University agrees it is important to establish consistency of interaction strength, while  Jesse Thaler of the Massachusetts Institute of Technology also encourages other experimentalists to enter the fray. Indeed, he believes it is vital. “Only a confirmation from an independent experiment would give me significant confidence in the ATOMKI result,” he says.\n One collaboration planning to test the anomalous result is DarkLight, based in the US. This will look for evidence of the 17 MeV/c 2 boson by firing electrons from the  Jefferson Lab’s CEBAF injector at a tantalum target. According to co-spokesperson Richard Milner of MIT, the experiment should produce results within the next couple of years – assuming that scientific approval and funding are forthcoming.", "posttime": "2020-06-13 16:49:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "衰变,force,粒子", "title": "在放射性衰变测量中发现“第五种力量”的更多证据", "title_en": "More evidence for a ‘fifth force’ found in radioactive decay measurements", "transed": 1, "url": "https://physicsworld.com/a/more-evidence-for-a-fifth-force-found-in-radioactive-decay-measurements/", "via": "", "real_tags": ["衰变", "force", "粒子"]}, {"category": "", "categoryclass": "", "imagename": "b381ca50d413d7197716cf96ffb37849.jpeg", "infoid": 1006392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个参考，通过显示与JavaScript代码的比较，使开发人员更容易进入数学表示法。\n本指南尚未完成。如果您看到错误或想要贡献，请开票或发送公关。\n注意：为简洁起见，一些代码示例使用了NPM包。您可以参考他们的GitHub Repos以了解实现的详细信息。\n根据作者、上下文和研究领域(线性代数、集合论等)的不同，数学符号可以有不同的含义。本指南可能不会涵盖符号的所有用法。在某些情况下，会引用真实世界的参考资料(博客文章、出版物等)来演示符号在野外可能是如何出现的。\n为简单起见，此处的许多代码示例都对浮点值进行操作，并且在数值上并不健壮。有关为什么这可能是一个问题的更多详细信息，请参见Mikola Lysenko的鲁棒算术笔记。\n根据上下文和研究领域的不同，命名约定有多种，并且它们并不总是一致的。但是，在某些文献中，您可能会发现变量名称遵循如下模式：\nθ-代表常量和特殊变量的希腊小写斜体字母(例如极角θ，θ)。\n有许多符号类似于等号=。以下是几个常见的示例：\n//等式2=3//不等式2！==3//近似等于几乎相等(数学。Pi，3.14159，1e-5)函数几乎等于(a，b，ε){返回数学。ABS(a-b)&lt；=ε}。\n但是，这是可变的，并且只获取当时值的快照。一些语言有预处理器#DEFINE语句，它更接近于数学定义。\n复数是形式的表达式，其中是实部，是虚部。虚数定义为：\n在JavaScript中，没有针对复数的内置功能，但是有一些库支持复数算术。例如，使用mathjs：\nvar MATH=REQUIRED(&#39；mathjs&39；)var a=MATH。Complex(3，-1)//=&gt；{Re：3，im：-1}var b=数学。sqrt(-1)//=&gt；{re：0，im：1}控制台。LOG(数学。使(a，b)相乘。toString())//=&gt；&#39；1+3i&#39；\n该库还支持计算字符串表达式，因此可以将上面的代码重写为：\n它们可能看起来很明显，但在我们继续其他部分之前，了解其中的细微差别是很重要的。\n通常，乘号仅用于避免歧义(例如，在两个数字之间)。在这里，我们可以完全省略它：\n为了表示一个向量与标量的乘法，或者表示一个向量与另一个向量的元素相乘，我们通常不使用点·或交叉×符号。这些在线性代数中有不同的含义，简要讨论一下。\n让我们以前面的例子为例，但将其应用于向量。对于基于元素的向量乘法，您可能会看到一个开点∘来表示Hadamard乘积。2个。\n在其他情况下，作者可能会显式定义不同的符号，例如圆点⊙或实心圆。3个。\n下面是它在代码中的外观，使用数组[x，y]来表示2D向量。\nvar s=3 var k=[1，2]var j=[2，3]var tmp=multiply(k，j)var result=multiyScalar(tmp，s)//=&gt；[6，18]。\n函数multiply(a，b){return[a[0]*b[0]，a[1]*b[1]]}函数multiyScalar(a，标量){return[a[0]*标量，a[1]*标量]}。\n类似地，矩阵乘法通常不使用点·或交叉符号×。矩阵乘法将在后面的部分中介绍。\n点符号·可用来表示两个向量的点积。有时这称为标量积，因为它的计算结果是标量。\n这是线性代数的一个非常常见的功能，对于3D矢量，它可能如下所示：\nvar k=[0，1，0]var j=[1，0，0]var d=dot(k，j)//=&gt；0。\n结果0告诉我们，我们的矢量是垂直的。以下是3分量矢量的点函数：\n函数点(a，b){返回a[0]*b[0]+a[1]*b[1]+a[2]*b[2]}。\n交叉符号×可以用来表示两个向量的叉积。\nvar k=[0，1，0]var j=[1，0，0]var result=Cross(k，j)//=&gt；[0，0，-1]。\n这里，我们得到[0，0，-1]，它与k和j都垂直。\n函数CROSS(a，b){var ax=a[0]，ay=a[1]，az=a[2]，bx=b[0]，by=b[1]，bz=b[2]var rx=ay*bz-az*by var ry=az*bx-ax*bz var rz=ax*by-ay*bx return[rx，ry，rz]}\n大的希腊西格玛(Σ)是求和的。换句话说，就是把一些数字加起来。\n这里，i=1表示从1开始，在西格玛100以上的数字结束。这分别是下界和上界。E&34；右边的i告诉我们要求和的内容。在代码中：\n对于(var i=1；i&lt；=100；i++){sum+=i}，var sum=0。\nvar n=100//上界var sum=(n*(n+1))/2。\n对于(var i=1；i&lt；=100；i++){sum+=(2*i+1)}，var sum=0。\n该表示法可以嵌套，这非常类似于嵌套for循环。您应该首先计算最右边的sigma，除非作者已将它们括在括号中以更改顺序。但是，在下面的情况中，由于我们处理的是有限和，因此顺序并不重要。\n(var i=1；i&lt；=2；i++){for(var j=4；j&lt；=6；j++){sum+=(3*i*j)}}。\n大写Pi或Big Pi&34；与Sigma非常相似，不同之处在于我们使用乘法来求一系列值的乘积。\n(var i=1；i&lt；=6；i++){value*=i}的var值=1。\n管道符号称为条，根据上下文的不同可以表示不同的含义。下面是三种常见的用法：绝对值、欧几里得范数和行列式。\n对于向量v，‖v‖是v的欧几里得范数，也称为向量的幅值或长度。\n这通常由双条线表示，以避免绝对值表示法的歧义，但有时您可能会看到单条线：\n以下是使用数组[x，y，z]表示3D矢量的示例。\n函数长度(Vec){var x=vec[0]var y=vec[1]var z=vec[2]返回数学。sqrt(x*x+y*y+z*z)}。\n下面是一个计算2x2矩阵行列式的示例，该矩阵由列为主格式的平面数组表示。\nvar行列式=REQUIRED(&#39；gl-mat2/&39；)var矩阵=[1，0，0，1]var Det=行列式(矩阵)//=&gt；1\n在几何学中，字符上方的符号用来表示单位向量。例如，以下是a的单位向量：\n在笛卡尔空间中，单位向量的长度通常为1。这意味着向量的每个部分都将在-1.0到1.0的范围内。在这里，我们将3D向量规格化为单位向量：\n函数标准化(Vec){var x=vec[0]var y=vec[1]var z=vec[2]var squaredLength=x*x+y*y+z*z if(squaredLength&gt；0){var length=Math。sqrt(SquaredLength)vec[0]=x/长度vec[1]=y/长度vec[2]=z/长度}返回vec}。\n在集合论中，符号∈和∋的元素可以用来描述某事物是否为集合的元素。例如：\n这里我们有一组数字A{3，9，14}，我们说3是该集合的&#34；元素。\n但是，使用仅包含唯一值的集合会更准确。这是ES6的一项功能。\n您也可以使用&#34；而不是&#34；符号∉和∌的元素，如下所示：\n你可能会在方程式中看到一些很大的黑板字母。通常，它们被用来描述集合。\n例如，我们可以将k描述为集合ℝ的一个元素。\n大ℝ描述实数集。其中包括整数，以及有理数和无理数。\njavascript将浮点型和整型视为同一类型，因此下面将是我们的k∈ℝ示例的简单测试：\n有理数是可以用分数或比率(如⅗)表示的实数。有理数不能以零作为分母。\n这也意味着所有整数都是有理数，因为分母可以表示为1。\n另一方面，无理数是指不能用比率表示的数字，如π(PI)。\n整数，即没有小数部分的实数。这些可以是积极的，也可以是消极的。\n函数isInteger(N){返回类型为n=&#39；&amp；&amp；n%1=0}\n一个自然数，一个正非负整数。根据上下文和研究领域的不同，集合可能包含零，也可能不包含零，因此它看起来可能类似于以下任意一个：\n复数是实数和虚数的组合，被视为2D平面中的坐标。有关更多信息，请参阅虚数的直观指南。\n函数是数学的基本特征，这个概念很容易转换成代码。\n函数将输入与输出值相关联。例如，以下是一个函数：\n我们可以给这个函数命名。通常，我们使用ƒ来描述函数，但也可以将其命名为A(X)或任何其他名称。\n在上面的示例中，x是输入，关系是平方的，y是输出。\n函数也可以有多个参数，就像在编程语言中一样。这些在数学上称为参数，而函数采用的参数数量称为函数的数量。\n这与代码中的if/Else非常相似。对于x&lt；0&34；，右侧条件通常写为&#34；，如果x=0&#34；，则写为&#34；。如果条件为真，则使用左侧的函数。\n函数f(X){if(x&&gt;；=1){return(Math.。POW(x，2)-x)/x}否则{返回0}}。\n有一些函数名称在数学中无处不在。对于程序员来说，这些可能类似于语言的内置函数(如JavaScript中的parseInt)。\nSGN函数就是这样一个例子。这是Signum或Sign函数。让我们使用分段函数表示法来描述它：\n函数sgn(X){if(x&lt；0)return-1 if(x&gt；0)return 1 return 0}。\n在一些文献中，函数可以用更明确的符号来定义。例如，让我们回到前面提到的Square函数：\n这里带尾巴的箭头通常表示&#34；映射到，就像在x映射到x2一样。\n有时，当它不明显时，符号还会描述函数的域和同域。ƒ的一个更正式的定义可能写成：\n函数的域和协域分别有点像它的输入和输出类型。下面是另一个示例，使用我们前面的sgn函数，该函数输出一个整数：\n在JavaScript和其他动态类型语言中，您可以使用文档和/或运行时检查来解释和验证函数的输入/输出。示例：\n/*将数字平方。*@param{number}一个实数*@return{number}一个实数*/函数Square(A){if(typeof a！==&#39；number&#39；){抛出新的TypeError(&#39；期望一个数字&#39；)}返回数学。战俘(a，2)}。\n其他语言，如Java，允许基于函数的输入/输出的静态类型进行真正的方法重载。这更接近于数学：如果两个函数使用不同的域，则它们是不同的。\n素数符号(‘)通常用在变量名中，用来描述相似的事物，而不会给它一个完全不同的名称。它可以描述经过一些转换后的下一个值。\n例如，如果我们取一个二维点(x，y)并旋转它，您可以将结果命名为(x‘，y’)。或者，矩阵M的转置可以命名为M‘。\n对于数学函数，素数符号通常描述该函数的导数。衍生品将在未来的一节中解释。让我们以前面的函数为例：\n可以使用多个素数符号来描述二阶导数ƒ“”和三阶导数ƒ“”。在此之后，作者通常用罗马数字ƒIV或上标数字ƒ(N)表示更高的顺序。\n特殊括号⌊x⌋和⌈x⌉分别表示楼层和天花板函数。\n当两个符号混合为⌊x⌉时，它通常表示四舍五入为最接近整数的函数：\n在函数表示法中经常使用箭头。以下是您可能会看到的其他几个区域。\n像⇒和→这样的箭头有时在逻辑中用来表示实质含义。也就是说，如果A为真，那么B也为真。\n箭头可以指向⇐⇒方向中的任意一个，也可以同时指向两个⇔方向。当A⇒B和B⇒A时，它们被认为是等价的：\n在数学中，&lt；&gt；≤和≥的使用方式通常与我们在代码中使用它们的方式相同：分别小于、大于、小于或等于和大于或等于。\n50&gt；2=TRUE 2&lt；10=TRUE 3&lt；=4=TRUE 4&gt；=4=TRUE。\n在很少的情况下，你可能会看到这些符号上有一个斜杠，用来描述不是。如上所述，k不大于&#34；j。\n≪和≫有时用来表示显著的不平等。也就是说，k是比j大的数量级。\n在数学中，数量级是相当具体的；它不仅仅是一个非常大的差别。&#34；上面的一个简单例子：\n函数log10(N){//以10为底的返回数学中的对数。log(N)/Math。ln10}函数顺序OfMagnitude(N){返回数学。trunc(log10(N))}。\n逻辑中箭头的另一个用法是合取∧和析取∨。它们分别类似于程序员的AND和OR运算符。\n在JavaScript中，我们使用&amp；&amp；。假设k是自然数，则逻辑暗示k是3：\n偶尔，…，~和！符号用于表示逻辑NOT。例如，只有当A为FALSE时，-A才为TRUE。\n注：波浪号~根据上下文有很多不同的意思。例如，行等价(矩阵理论)或相同数量级(在等式中讨论)。\n有时，函数处理的实数被限制在某个值范围内，这样的约束可以使用区间来表示。\n例如，我们可以将介于0和1之间的数字表示为包括/不包括0和/或1：\n例如，要指示点x在三维单位立方体中，我们说：\nvar nextafter=request(&#39；nextater&#39；)var a=[nextater(0，无穷)，nextater(1，-无穷)]//打开间隔var b=[nextater(0，无穷)，1]//左侧关闭的间隔var c=[0，nextater(1，-无穷)]//右侧关闭的间隔var d=[。\n变量INTERVAL=REQUIRED(&#39；INTERVAL-算术)var Nextafter=REQUIRED(&#39；NEXTER&#39；)var a=INTERVAL(3，NEXTER(5，-Infinity))var b=INTERVAL(4，6)INTERVAL。交叉口(a，b)//{lo：4，hi：4.999999999999999}间隔。Union(a，b)//{lo：3，hi：6}间隔。差异(a，b)//{lo：3，hi：3.9999999999999996}间隔。差异(b，a)//{lo：5，hi：6}", "note_en": "This is a reference to ease developers into mathematical notation by showing comparisons with JavaScript code.\n  This guide is not yet finished. If you see errors or want to contribute, please  open a ticket or send a PR.\n Note: For brevity, some code examples make use of  npm packages. You can refer to their GitHub repos for implementation details.\n  Mathematical symbols can mean different things depending on the author, context and the field of study (linear algebra, set theory, etc). This guide may not cover  all uses of a symbol. In some cases, real-world references (blog posts, publications, etc) will be cited to demonstrate how a symbol might appear in the wild.\n  For simplicity, many of the code examples here operate on floating point values and are not numerically robust. For more details on why this may be a problem, see  Robust Arithmetic Notes by Mikola Lysenko.\n    There are a variety of naming conventions depending on the context and field of study, and they are not always consistent. However, in some of the literature you may find variable names to follow a pattern like so:\n θ - italic lowercase Greek letters for constants and special variables (e.g.  polar angle  θ,  theta)\n   There are a number of symbols resembling the equals sign  =. Here are a few common examples:\n   // equality 2  ===  3 // inequality 2 !==  3 // approximately equal almostEqual ( Math . PI ,  3.14159 ,  1e-5 ) function  almostEqual ( a ,  b ,  epsilon )  {  return  Math . abs ( a  -  b ) &lt;=  epsilon }\n      However, this is mutable, and only takes a snapshot of the values at that time. Some languages have pre-processor  #define statements, which are closer to a mathematical  define.\n            Complex numbers are expressions of the form   , where    is the real part and    is the imaginary part. The imaginary number    is defined as:\n  In JavaScript, there is no built-in functionality for complex numbers, but there are some libraries that support complex number arithmetic. For example, using  mathjs:\n var  math  =  require ( &#39;mathjs&#39; ) var  a  =  math . complex ( 3 ,  - 1 ) //=&gt; { re: 3, im: -1 } var  b  =  math . sqrt ( - 1 ) //=&gt; { re: 0, im: 1 } console . log ( math . multiply ( a ,  b ) . toString ( ) ) //=&gt; &#39;1 + 3i&#39;\n The library also supports evaluating a string expression, so the above could be re-written as:\n      They might seem obvious, but it&#39;s important to understand the subtle differences before we continue into other sections.\n      Often, the multiplication sign is only used to avoid ambiguity (e.g. between two numbers). Here, we can omit it entirely:\n     To denote multiplication of one vector with a scalar, or element-wise multiplication of a vector with another vector, we typically do not use the dot  · or cross  × symbols. These have different meanings in linear algebra, discussed shortly.\n Let&#39;s take our earlier example but apply it to vectors. For element-wise vector multiplication, you might see an open dot  ∘ to represent the  Hadamard product.  2\n  In other instances, the author might explicitly define a different notation, such as a circled dot  ⊙ or a filled circle  ●.  3\n Here is how it would look in code, using arrays  [x, y] to represent the 2D vectors.\n var  s  =  3 var  k  =  [  1 ,  2  ] var  j  =  [  2 ,  3  ] var  tmp  =  multiply ( k ,  j ) var  result  =  multiplyScalar ( tmp ,  s ) //=&gt; [ 6, 18 ]\n  function  multiply ( a ,  b )  {  return  [  a [ 0 ] *  b [ 0 ] ,  a [ 1 ] *  b [ 1 ]  ] } function  multiplyScalar ( a ,  scalar )  {  return  [  a [ 0 ] *  scalar ,  a [ 1 ] *  scalar  ] }\n Similarly, matrix multiplication typically does not use the dot  · or cross symbol  ×. Matrix multiplication will be covered in a later section.\n  The dot symbol  · can be used to denote the   dot product of two vectors. Sometimes this is called the  scalar product since it evaluates to a scalar.\n  It is a very common feature of linear algebra, and with a 3D vector it might look like this:\n var  k  =  [  0 ,  1 ,  0  ] var  j  =  [  1 ,  0 ,  0  ] var  d  =  dot ( k ,  j ) //=&gt; 0\n The result  0 tells us our vectors are perpendicular. Here is a  dot function for 3-component vectors:\n function  dot ( a ,  b )  {  return  a [ 0 ] *  b [ 0 ]  +  a [ 1 ] *  b [ 1 ]  +  a [ 2 ] *  b [ 2 ] }\n  The cross symbol  × can be used to denote the   cross product of two vectors.\n   var  k  =  [  0 ,  1 ,  0  ] var  j  =  [  1 ,  0 ,  0  ] var  result  =  cross ( k ,  j ) //=&gt; [ 0, 0, -1 ]\n Here, we get  [ 0, 0, -1 ], which is perpendicular to both  k and  j.\n  function  cross ( a ,  b )  {  var  ax  =  a [ 0 ] ,  ay  =  a [ 1 ] ,  az  =  a [ 2 ] ,  bx  =  b [ 0 ] ,  by  =  b [ 1 ] ,  bz  =  b [ 2 ]  var  rx  =  ay *  bz  -  az *  by  var  ry  =  az *  bx  -  ax *  bz  var  rz  =  ax *  by  -  ay *  bx  return  [  rx ,  ry ,  rz  ] }\n    The big Greek  Σ (Sigma) is for  Summation. In other words: summing up some numbers.\n  Here,  i=1 says to start at  1 and end at the number above the Sigma,  100. These are the lower and upper bounds, respectively. The  i to the right of the &#34;E&#34; tells us what we are summing. In code:\n var  sum  =  0 for  ( var  i  =  1 ;  i &lt;=  100 ;  i ++ )  {  sum  +=  i }\n   var  n  =  100  // upper bound var  sum  =  ( n *  ( n  +  1 ) ) /  2\n    var  sum  =  0 for  ( var  i  =  1 ;  i &lt;=  100 ;  i ++ )  {  sum  +=  ( 2 *  i  +  1 ) }\n  The notation can be nested, which is much like nesting a  for loop. You should evaluate the right-most sigma first, unless the author has enclosed them in parentheses to alter the order. However, in the following case, since we are dealing with finite sums, the order does not matter.\n   var  sum  =  0 for  ( var  i  =  1 ;  i &lt;=  2 ;  i ++ )  {  for  ( var  j  =  4 ;  j &lt;=  6 ;  j ++ )  {  sum  +=  ( 3 *  i *  j )  } }\n   The capital Pi or &#34;Big Pi&#34; is very similar to  Sigma, except we are using multiplication to find the product of a sequence of values.\n    var  value  =  1 for  ( var  i  =  1 ;  i &lt;=  6 ;  i ++ )  {  value *=  i }\n   Pipe symbols, known as  bars, can mean different things depending on the context. Below are three common uses:  absolute value,  Euclidean norm, and  determinant.\n        For a vector  v,  ‖v‖ is the  Euclidean norm of  v. It is also referred to as the &#34;magnitude&#34; or &#34;length&#34; of a vector.\n Often this is represented by double-bars to avoid ambiguity with the  absolute value notation, but sometimes you may see it with single bars:\n  Here is an example using an array  [x, y, z] to represent a 3D vector.\n   function  length  ( vec )  {  var  x  =  vec [ 0 ]  var  y  =  vec [ 1 ]  var  z  =  vec [ 2 ]  return  Math . sqrt ( x *  x  +  y *  y  +  z *  z ) }\n      Here is an example computing the determinant of a 2x2 matrix, represented by a flat array in column-major format.\n var  determinant  =  require ( &#39;gl-mat2/determinant&#39; ) var  matrix  =  [  1 ,  0 ,  0 ,  1  ] var  det  =  determinant ( matrix ) //=&gt; 1\n    In geometry, the &#34;hat&#34; symbol above a character is used to represent a  unit vector. For example, here is the unit vector of  a:\n  In Cartesian space, a unit vector is typically length 1. That means each part of the vector will be in the range of -1.0 to 1.0. Here we  normalize a 3D vector into a unit vector:\n   function  normalize ( vec )  {  var  x  =  vec [ 0 ]  var  y  =  vec [ 1 ]  var  z  =  vec [ 2 ]  var  squaredLength  =  x *  x  +  y *  y  +  z *  z  if  ( squaredLength  &gt;  0 )  {  var  length  =  Math . sqrt ( squaredLength )  vec [ 0 ]  =  x /  length  vec [ 1 ]  =  y /  length  vec [ 2 ]  =  z /  length  }  return  vec }\n    In set theory, the &#34;element of&#34; symbol  ∈ and  ∋ can be used to describe whether something is an element of a  set. For example:\n  Here we have a set of numbers  A  { 3, 9, 14 } and we are saying  3 is an &#34;element of&#34; that set.\n   However, it would be more accurate to use a  Set which only holds unique values. This is a feature of ES6.\n    You can also use the &#34;not an element of&#34; symbols  ∉ and  ∌ like so:\n   You may see some some large  Blackboard letters among equations. Often, these are used to describe sets.\n For example, we might describe  k to be an  element of the set  ℝ.\n    The large  ℝ describes the set of  real numbers. These include integers, as well as rational and irrational numbers.\n JavaScript treats floats and integers as the same type, so the following would be a simple test of our  k ∈ ℝ example:\n    Rational numbers are real numbers that can be expressed as a fraction, or  ratio (like  ⅗). Rational numbers cannot have zero as a denominator.\n This also means that all integers are rational numbers, since the denominator can be expressed as 1.\n An irrational number, on the other hand, is one that cannot be expressed as a ratio, like π (PI).\n  An integer, i.e. a real number that has no fractional part. These can be positive or negative.\n  function  isInteger  ( n )  {  return  typeof  n  ===  &#39;number&#39;  &amp;&amp;  n %  1  ===  0 }\n  A natural number, a positive and non-negative integer. Depending on the context and field of study, the set may or may not include zero, so it could look like either of these:\n     A complex number is a combination of a real and imaginary number, viewed as a co-ordinate in the 2D plane. For more info, see  A Visual, Intuitive Guide to Imaginary Numbers.\n  Functions are fundamental features of mathematics, and the concept is fairly easy to translate into code.\n A function relates an input to an output value. For example, the following is a function:\n  We can give this function a  name. Commonly, we use  ƒ to describe a function, but it could be named  A(x) or anything else.\n      In the above example,  x is the input, the relationship is  squaring, and  y is the output.\n Functions can also have multiple parameters, like in a programming language. These are known as  arguments in mathematics, and the number of arguments a function takes is known as the  arity of the function.\n        This is very similar to  if /  else in code. The right-side conditions are often written as  &#34;for x &lt; 0&#34; or  &#34;if x = 0&#34;. If the condition is true, the function to the left is used.\n  function  f  ( x )  {  if  ( x &gt;=  1 )  {  return  ( Math . pow ( x ,  2 )  -  x ) /  x  }  else  {  return  0  } }\n  There are some function names that are ubiquitous in mathematics. For a programmer, these might be analogous to functions &#34;built-in&#34; to the language (like  parseInt in JavaScript).\n One such example is the  sgn function. This is the  signum or  sign function. Let&#39;s use  piecewise function notation to describe it:\n   function  sgn  ( x )  {  if  ( x  &lt;  0 )  return  - 1  if  ( x  &gt;  0 )  return  1  return  0 }\n    In some literature, functions may be defined with more explicit notation. For example, let&#39;s go back to the  square function we mentioned earlier:\n    The arrow here with a tail typically means &#34;maps to,&#34; as in  x maps to x 2.\n Sometimes, when it isn&#39;t obvious, the notation will also describe the  domain and  codomain of the function. A more formal definition of  ƒ might be written as:\n  A function&#39;s  domain and  codomain is a bit like its  input and  output types, respectively. Here&#39;s another example, using our earlier  sgn function, which outputs an integer:\n   In JavaScript and other dynamically typed languages, you might use documentation and/or runtime checks to explain and validate a function&#39;s input/output. Example:\n /**  * Squares a number.  *  @param { Number} a real number  *  @return { Number} a real number  */ function  square  ( a )  {  if  ( typeof  a !==  &#39;number&#39; )  {  throw  new  TypeError ( &#39;expected a number&#39; )  }  return  Math . pow ( a ,  2 ) }\n  Other languages, like Java, allow for true method overloading based on the static types of a function&#39;s input/output. This is closer to mathematics: two functions are not the same if they use a different  domain.\n  The prime symbol ( ′) is often used in variable names to describe things which are similar, without giving it a different name altogether. It can describe the &#34;next value&#34; after some transformation.\n For example, if we take a 2D point  (x, y) and rotate it, you might name the result  (x′, y′). Or, the  transpose of matrix  M might be named  M′.\n  For a mathematical  function, the prime symbol often describes the  derivative of that function. Derivatives will be explained in a future section. Let&#39;s take our earlier function:\n      Multiple prime symbols can be used to describe the second derivative  ƒ′′ and third derivative  ƒ′′′. After this, authors typically express higher orders with roman numerals  ƒ IV or superscript numbers  ƒ (n).\n  The special brackets  ⌊x⌋ and  ⌈x⌉ represent the  floor and  ceil functions, respectively.\n     When the two symbols are mixed  ⌊x⌉, it typically represents a function that rounds to the nearest integer:\n     Arrows are often used in  function notation. Here are a few other areas you might see them.\n  Arrows like  ⇒ and  → are sometimes used in logic for  material implication. That is, if A is true, then B is also true.\n    The arrows can go in either direction  ⇐  ⇒, or both  ⇔. When  A ⇒ B and  B ⇒ A, they are said to be equivalent:\n   In math, the  &lt;  &gt;  ≤ and  ≥ are typically used in the same way we use them in code:  less than,  greater than,  less than or equal to and  greater than or equal to, respectively.\n 50  &gt;  2  ===  true 2  &lt;  10  ===  true 3 &lt;=  4  ===  true 4 &gt;=  4  ===  true\n On rare occasions you might see a slash through these symbols, to describe  not. As in,  k is &#34;not greater than&#34;  j.\n  The  ≪ and  ≫ are sometimes used to represent  significant inequality. That is,  k is an  order of magnitude larger than  j.\n  In mathematics,  order of magnitude is rather specific; it is not just a &#34;really big difference.&#34; A simple example of the above:\n   function  log10 ( n )  {  // logarithm in base 10  return  Math . log ( n ) /  Math . LN10 } function  orderOfMagnitude  ( n )  {  return  Math . trunc ( log10 ( n ) ) }\n    Another use of arrows in logic is conjunction  ∧ and disjunction  ∨. They are analogous to a programmer&#39;s  AND and  OR operators, respectively.\n   In JavaScript, we use  &amp;&amp;. Assuming  k is a natural number, the logic implies that  k is 3:\n         Occasionally, the  ¬,  ~ and  ! symbols are used to represent logical  NOT. For example,  ¬A is only true if A is false.\n     Note: The tilde  ~ has many different meanings depending on context. For example,  row equivalence (matrix theory) or  same order of magnitude (discussed in  equality).\n  Sometimes a function deals with real numbers restricted to some range of values, such a constraint can be represented using an  interval\n For example we can represent the numbers between zero and one including/not including zero and/or one as:\n     For example we to indicate that a point  x is in the unit cube in 3D we say:\n   var  nextafter  =  require ( &#39;nextafter&#39; ) var  a  =  [ nextafter ( 0 ,  Infinity ) ,  nextafter ( 1 ,  - Infinity ) ]  // open interval var  b  =  [ nextafter ( 0 ,  Infinity ) ,  1 ]  // interval closed on the left  var  c  =  [ 0 ,  nextafter ( 1 ,  - Infinity ) ]  // interval closed on the right var  d  =  [ 0 ,  1 ]  // closed interval\n      var  Interval  =  require ( &#39;interval-arithmetic&#39; ) var  nextafter  =  require ( &#39;nextafter&#39; ) var  a  =  Interval ( 3 ,  nextafter ( 5 ,  - Infinity ) ) var  b  =  Interval ( 4 ,  6 ) Interval . intersection ( a ,  b ) // {lo: 4, hi: 4.999999999999999} Interval . union ( a ,  b ) // {lo: 3, hi: 6} Interval . difference ( a ,  b ) // {lo: 3, hi: 3.9999999999999996} Interval . difference ( b ,  a ) // {lo: 5, hi: 6}", "posttime": "2020-06-13 16:32:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,数学,math,函数", "title": "数学即代码", "title_en": "Math-as-Code", "transed": 1, "url": "https://github.com/Jam3/math-as-code", "via": "", "real_tags": ["代码", "数学", "math", "函数"]}, {"category": "", "categoryclass": "", "imagename": "004cbd69b166e3c22b6e5e9c000620d6.png", "infoid": 1006391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我们拿苹果怎么办，”吉姆·克雷默(Jim Cramer)咆哮着，袖子卷到肘部，“现在它已经成为周围最令人憎恨的股票之一了？”\n那是2019年1月，苹果公司正处于自由落体状态。主要的担忧是iPhone。增长似乎在放缓，投资者惊慌失措。\n股价仅为150-35%，较几个月前创下的历史新高下跌了。情况非常糟糕，以至于本·汤普森当周发表了一篇题为“苹果的错误”的文章，并以下面的图表开头：\n吉姆·克雷默接着说：“现在，我们听到了很多关于苹果公司可能出了什么问题的说法。”“但是，你知道吗，我更喜欢直截了当地追根究底。因此，今天早些时候，我们偷偷溜到库比蒂诺，与苹果首席执行官蒂姆·库克进行了长时间的会面。\n切换到吉姆和蒂姆坐在拥挤的苹果专卖店中央的凳子上，顾客们尴尬地在背景中拖着脚走来走去，偷偷地瞥了一眼摄像机。\n“你知道我总是说，‘拥有它，不要交易它。’但现在，人们都在说，‘吉姆，给我买股票的投资理由。’“。\n这是蒂姆的时刻。全国各地的交易员坐在那里，痛苦得目瞪口呆，手指在“卖出”按钮上方几毫米处徘徊。\n“嗯，你知道，我从来没有试着卖出一只股票。我试着卖一种产品。不过，让我告诉你我的看法：我们是从长远来管理公司的。“。然后他谈了所有你想要的东西-苹果的创新文化，巨大的安装基础，高客户满意度等。\n但在接近尾声时，蒂姆说了一些许多人可能遗漏的重要事情。交易员的财务模型中没有包含一些东西，但在iPhone成熟后，这些东西可能是维持苹果增长的关键：\n“如果你把目光投向未来，回首往事，你会问这样一个问题，‘苹果对人类最大的贡献是什么？’这将是关于健康的。“。\n当人们想到苹果和健康时，首先想到的是手表。\n具体地说，他们正在建立一个系统，从现代互联设备(如手表、秤、健身设备、床垫等)收集数据，并将其与传统的健康记录(实验室结果、条件、药物、程序)相集成，以打开对你身体健康的新的、全面的看法。\n传统上，这些数据集一直处于孤岛状态。但是，如果所有这些都安全地聚集在一个地方，会发生什么呢？\n这对你的健康以及更广泛的医疗体系的影响将是巨大的。\n想象一下，当你注册一个新的健身房时，你可以连接Apple Health。数据现在可以双向流动。这样你的教练就可以知道你有椎间盘突出，你的医生就可以查看你的锻炼记录。\n想象一下，一个智能马桶可以对你的粪便进行采样，并将数据发送到苹果健康中心。想象一下，这会触发由您的医疗保健提供商开发的算法进行自动分析，该算法会考虑到您所有其他健康数据(例如体重、心率、睡眠、DNA)的上下文，以便在检测到任何异常模式时主动建议您安排预约。\n想象一下，医疗保健系统的运行效率提高了10倍，因为持续的后台数据收集和分析消除了不必要的访问，减少了误诊，并及早发现了大多数问题，只需简单的程序就能解决。\n当然，这些故事仍然是虚构的。这项技术还有很长的路要走，医疗保健是一个臭名昭著的扭曲市场，苹果也不是唯一对成为健康数据聚合器感兴趣的科技巨头。\n但如果他们真的成功了，这将是一次重大的战略胜利，与苹果通常的行事方式大相径庭。\n苹果的正常做法是制造高端硬件，并将其与内部和第三方开发者开发的高端软件集成在一起。基本目标是卖给你更多的设备，并让你为每台设备支付更高的价格，让它成为一种优质的差异化体验。\n当然可以，他们有手表，可以测量你的心率。但他们将大部分可能的设备空间留给了其他公司，如Peloton、Whop和Eight Sept。苹果公司不想走健康相关硬件设备的道路。这些设备有很高的固定研发和制造成本，而且每一种设备往往只能填补一个很小的利基市场-所以这是一个很难进入的行业。苹果将这些设备视为附件/子部件。\n问题是，有时一件事情一开始只是一件附属品，最后却从“主要的东西”手中夺走了权力。例如，网络一开始是对个人电脑的补充，但随着它在人们心目中的份额增加，网络降低了Windows的重要性，使消费者更容易切换到Mac。\n因此，马克·安德森(Marc Andreessen)臭名昭著地预测，Netscape将把Windows降为“一组调试不佳的设备驱动程序”。\n蒂姆·库克最担心的是这种情况会发生在iPhone上。苹果生态系统之外的价值增长越多，消费者就越容易切换到其他类型的手机，苹果的定价权越小，Tim要做的Mad Money采访就越尴尬。\n一方面，我们看到健康传感器的扩散只会继续加速。今天，我们有联网的床垫追踪我们的睡眠，联网的手表追踪我们的心率。明天，我们可以让前面提到的联网马桶来测量我们的肠道健康。\n另一方面，我们的医疗保健系统没有使用任何这些数据，也没有以任何类型的结构化或可移植的方式公开它们生成的任何数据。\n苹果的目标是通过成为一个站在中间的值得信赖的经纪人，将这些点连接起来。\n为了达到这一地位，苹果不得不赢得医疗行业和政府的信任。迈向这一新的医疗保健现实的第一步是将医疗记录整合到Apple Health中。需要明确的是，要走到这一步并不是在公园里散步。在幕后，苹果与关键的医疗保健参与者(包括供应商、医院和政府机构)进行了大量的屏蔽和处理，以实现这一目标。任何了解HIPAA的人都知道这个东西~复杂~.。\n数字化的患者健康数据通常称为电子健康记录(EHR)。这些记录包含医生存档的病史、实验室结果、诊断和进展记录等内容。\n在Apple Health出现之前，这些数据由医疗保健供应商严密保护，这些供应商有严格的隐私需求。此外，医疗保健公司历来都会停止将EHR集成到移动设备中的尝试，部分原因是这很复杂，但也是因为他们极大地抑制了允许形成新的数据层，使患者可以更容易地在不同提供商之间切换。这是谷歌和微软在过去都曾尝试过的，但都被关闭了。那么为什么是苹果呢？\n简而言之，这是规模和隐私的结合。苹果对隐私的关注让他们进入了医疗保健公司的大门，他们的规模使得医疗保健提供者可以利用他们的客户群进行大规模的研究，使这种关系互惠互利。\n这种关系创造了一个反馈循环：苹果在其健康生态系统中获得的用户越多，新的医疗保健公司就越有可能与他们合作。与他们合作的医疗保健公司越多，苹果的健康生态系统对不在其中的用户就变得越有吸引力。发展这一市场的每一面都加深了苹果健康数据护城河的战壕，由于这条护城河是他们独一无二的，所以它已经成为他们的首要任务。\n一旦你了解了苹果对其健康应用的目标，他们的所有决定都会变得更有意义。看看苹果手表就知道了。苹果没有过度关注某一特定的健康支柱，而是决定尽可能追求最广泛的人群。\n举个例子，虽然早期的版本专注于心率和健身功能，但Apple Watch 4.0增加了检测跌倒的能力，以及紧急求救功能-显然是针对老年人。Apple Watch 5.0增加了跟踪月经周期和检测噪音的能力。虽然这些发展可能看起来很散漫，但它们实际上都与同一个对规模的单一关注捆绑在一起。\n为了推行这一战略，苹果已经做出了一些真正的权衡。因为Apple Health应用程序充当了所有健康数据的存储库，所以苹果自己开发的应用程序并不多，而是选择允许第三方开发人员在Healthkit API的基础上进行构建。他们对传感器采取了类似的路线。虽然像Horop、Oura和Eight Sept这样的公司已经将传感器技术推向了极限，但苹果已经接受了“足够好”的代价，同时深化了他们的数据护城河。\n从战略上讲，接受这两个领域的“足够好”是有意义的，因为无论是应用程序还是传感器都不是苹果的独特优势，就像它们整合医疗数据的能力一样。正如我们之前提到的，利基保健设备可能是具有挑战性的业务，需要很高的研发和制造固定成本，但客户基础很小，可以将这些成本分摊到各处。\n此外，只要创建第三方传感器和应用程序的公司无论如何都要将他们的数据输入Apple Health，为什么还要与他们竞争呢？\n具有讽刺意味的是，苹果今天对Health的策略让人想起90年代微软对Windows的策略。\n苹果不想制造所有的硬件，而是想要创造健康的操作系统，并拥有所有玩家必须集成才能获得分销的关键瓶颈。这感觉像是蒂姆·库克(Tim Cook)做出的明显贡献，与过去截然不同。\n为了判断它是否有效，重要的是始终从“寻找权力”框架返回到基本问题：要做的工作是什么？有什么不够好的？换句话说，竞争的基础是什么？你需要控制价值链的哪些层面才能取胜？\n在医疗保健领域，工作是保持人们的生命和健康。但它成本太高，太复杂，而且缺乏关键信息。这就好比你试图在没有任何仪表或指示器的情况下操作一辆汽车，只有当有什么东西坏得很严重，以至于你在开车时才会注意到它时，你才会走进商店。无论是谁建立了聚合这些数据的系统，都将在医疗保健的质量和效率方面实现巨大的改进。\n当蒂姆·库克(Tim Cook)告诉吉姆·克雷默(Jim Cramer)，他认为苹果将被人们记住的主要是它对健康的贡献时，我们应该认真对待他，认真对待他。\n上市公司的首席执行官们对他们能说的话有很多限制。透露具体计划的细节有很大的障碍，另外，苹果已经是一家众所周知的特别保密的公司。因此，我们唯一必须遵循的是宽泛的声明。\n我们是不是推断得太多了？也许吧。但在这种情况下，斯特劳斯读物是唯一可能的读物。我们觉得这一次是对的。\n我们不可能知道未来会如何发展，但我们预计苹果将继续与更多的医疗保健提供商和联网设备整合。一些具有前瞻性的提供商，如one Medical、Forward和Q.bio，将更好地利用来自苹果生态系统的数据，提供差异化的初级保健。患者会期待并珍视它。也许Barry‘s或Equinox会与Apple Health整合，创造更好的客户体验。\n这是一个令人兴奋的愿景，但我们想知道，那些买不起所有这些东西的人会发生什么。根据今年选举的结果，我们可能会看到巨大的变化席卷整个系统。很难预测这会产生什么影响。\n重要的是继续为进步而努力，并努力确保进步尽可能公平地分配。\n罗布·利特斯特(Rob Litterst)在ProfitWell从事订阅定价工作。他的时事通讯，Good Better Best，涵盖了数字包装战略。\n点击“喜欢”按钮(这样我就知道要做更多这样的帖子了)。\n请阅读“寻找力量”，以更多地了解帮助我们生成此分析的理论。\n占卜是有读者支持的。大约一半的内容是免费的，另一半是付费的。付费帖子非常详细地解释了商业战略理论(迈克尔·波特、克莱·克里斯滕森、汉密尔顿·赫尔默等)，并构成了我在免费帖子中对具体公司进行分析的基础。\n还有一件很酷的事情：当你订阅占卜时，你也可以访问超级组织者和Prxis。这是你在互联网上遇到的关于生产力的两份最聪明的时事通讯。这是一个很大的包裹。你可以在这里阅读更多关于它的信息。", "note_en": "“What do we do with Apple,” Jim Cramer barked, sleeves rolled above his elbows, “now that it&#39;s become one of the most  hated stocks around?”\n It was January 2019, and AAPL was in  free fall. The main concern was the iPhone. Growth seemed to be slowing, and investors were panicked.\n Shares cost just $150 — 35% down from the all-time high they hit a few months prior. Things were so bad that Ben Thompson published an article that week titled “ Apple’s Errors” and led with this chart:\n   “Now, we&#39;ve heard a lot of theories about what might be going wrong here at Apple” Jim Cramer continued. “But, you know what, I prefer to go straight to the source. So earlier today we snuck out to Cupertino for a long meeting with Apple&#39;s CEO Tim Cook.”\n Cut to Jim and Tim perched on stools in the middle of a crowded Apple store, customers awkwardly shuffling around in the background, sneaking glances at the camera.\n  “You know I always say, ‘Own it, don’t trade it.’ But right now, people are saying, ‘Jim, give me the investment case for  buying the stock.’”\n This was Tim’s moment. Traders throughout the nation sat, transfixed in agony, fingers hovering millimeters above the “sell” button.\n “Well, you know, I never try to sell a stock. I try to sell a product. However, let me tell you the way I look at it: we manage the company for the  long term.” He then went on about all the stuff you’d expect — Apple’s culture of innovation, huge install base, high customer satisfaction, etc.\n But towards the end, Tim said something important that many may have missed. Something that wasn’t built into the traders’ financial models, but nevertheless may hold the key to sustaining Apple’s growth once the iPhone matures:\n “If you zoom out into the future, and you look back, and ask the question, ‘What was Apple’s greatest contribution to mankind?’  It will be about health.”\n   When people think about  Apple and  health, the first thing that comes to mind is the Watch.\n     Specifically, they’re building a system to aggregate data from modern connected devices (like watches, scales, fitness equipment, mattresses, etc) and integrate it with traditional health records (lab results, conditions, medications, procedures) in order to unlock a new, comprehensive view of your body’s health.\n Traditionally, these data sets have lived in silos. But what could happen if it all was aggregated safely in one place?\n   The impact on your health, and on the healthcare system more broadly, would be enormous.\n  Imagine when you sign up for a new gym, you can connect Apple Health. Data can now flow in both directions. So your trainer could know you had a herniated disk, and your doctor will have access to your workout history.\n Imagine a smart toilet that can sample your stool and send the data to Apple Health. Imagine this triggers an automatic analysis by an algorithm developed by your healthcare provider, which takes into account the context of all your other health data (e.g. weight, heart rate, sleep, DNA), in order to proactively suggest you schedule an appointment if any anomalous patterns are detected.\n Imagine the healthcare system was able to operate 10x more efficiently, because continuous background data collection and analysis eliminated unnecessary visits, reduced misdiagnoses, and caught most issues early enough to be solved with simple procedures.\n Of course, these stories are still just imaginary. The technology has a long way to go, healthcare is a notoriously distorted market, and Apple isn’t the only tech giant interested in becoming an aggregator of health data.\n But if they do manage to pull it off, it’ll be a major strategic coup, and a huge departure from Apple’s usual way of doing things.\n   Apple’s normal play is to build high-end hardware and integrate it with high-end software created both in house, and by third-party developers. The basic goal is to sell you more devices, and get you to pay more for each device, by making it a premium, differentiated experience.\n  Sure, they have the watch, which measures your heart rate. But they’re leaving the majority of the possible device space to others, such as Peloton, WHOOP, and Eight Sleep. Apple doesn&#39;t want to go down the path of making health-related hardware devices. These have high fixed R&amp;D and manufacturing costs to make them, and each device tends to only fill a small niche — so it&#39;s a tough business to be in. Apple considers these devices accessories/subcomponents.\n The problem is, sometimes a thing that starts out as an accessory ends up usurping power from the “main thing.” For example, the web started out as a complement to PCs, but as it gained mindshare, the web decreased the importance of Windows and it made it much easier for consumers to switch to a Mac.\n Thus the infamous Marc Andreessen prediction that Netscape would reduce Windows to a “poorly debugged set of device drivers.”\n  Tim Cook’s worst fear is that this happens to the iPhone. The more value grows outside Apple’s ecosystem, the easier it is for consumers to switch to some other type of phone, the less pricing power Apple has, the more embarrassing  Mad Money interviews Tim has to do.\n    On one hand, we’re seeing a proliferation of health sensors that will only continue to accelerate. Today we have connected mattresses tracking our sleep and connected watches tracking our heart rate. Tomorrow we could have the aforementioned connected toilet measuring our gut health.\n On the other hand, we have a healthcare system that isn’t making use of any of this data and isn’t exposing any of the data they generate in any sort of structured or portable way.\n Apple’s goal is to connect these dots by becoming a trusted broker that stands in the middle.\n In order to get to this position, Apple has had to gain the trust of the healthcare industry and the government. The first step to this new healthcare reality is integrating medical records into Apple Health. To be clear, getting to this point has not been a walk in the park. Behind the scenes, Apple has done a ton of blocking and tackling with key healthcare players to make it happen, including vendors, hospitals, and government agencies. Anyone who knows about HIPAA knows this stuff is ~ complicated~.\n Digitized patient health data is generally known as Electronic Health Records (EHR). These records contain things like medical history, lab results, diagnoses, and progress notes that doctors keep on file.\n Before Apple Health came along this data was closely guarded by healthcare vendors that have restrictive privacy needs. Further, healthcare companies have historically shut down attempts to integrate EHR into mobile devices, partially because it’s complicated, but also because they have a big disincentive to allow a new data layer to form that allows patients to switch between providers more easily. This would Both Google and Microsoft have tried in the past, and both got shut down. So why Apple?\n Put simply, it’s the combination of scale and privacy. Apple’s focus on privacy got them in the door with healthcare companies, and their scale allows healthcare providers to tap into their customer base for large scale research studies that make the relationship mutually beneficial.\n   This relationship creates a feedback loop: the more users Apple can get in their Health ecosystem, the more likely new healthcare companies are to partner with them. The more healthcare companies partner with them, the more compelling Apple’s health ecosystem becomes for users who aren’t on it. Growing each side of this marketplace deepens the trenches of Apple’s health data moat, and since this moat is so uniquely theirs, it’s become their biggest priority.\n   Once you understand Apple’s goals for its Health app, all their decisions make a lot more sense. Just look at the Apple Watch. Rather than hyper-focus on a particular pillar of health, Apple has decided to go after the broadest swath of the population possible.\n Case in point, while earlier editions focused on heart rate and fitness functionality, the Apple Watch 4.0 added the ability to detect falls, and an emergency SOS function — clearly targeting the elderly. The Apple Watch 5.0 added the ability to track menstrual cycles and detect loud noises. While these developments may seem scatterbrained, they actually all tie back to the same singular focus on scale.\n Apple has made some real  trade-offs to pursue this strategy. Because the Apple Health app acts as a repository for all health data, Apple hasn’t developed many apps of their own, opting to allow third-party developers to build on their Healthkit API. They’ve taken a similar route with sensors. While companies like WHOOP, Oura, and Eight Sleep have pushed sensor technology to their limits, Apple has accepted the trade-off of being “good enough”, while they deepen their data moat.\n Strategically, accepting “good enough” in both of these areas makes sense, because neither applications nor sensors are unique strengths for Apple to the same extent as their ability to integrate healthcare data. And as we mentioned before, niche health devices can be challenging businesses, requiring high of R&amp;D and manufacturing fixed costs, but with a small customer base to spread those costs across.\n Plus, as long as companies creating third-party sensors and apps feed their data into Apple Health anyway, why compete with them?\n  Ironically, Apple’s strategy with Health today is reminiscent of Microsoft’s strategy with Windows in the 90s.\n Instead of making all the hardware, Apple wants to create the OS for health, and own the critical chokepoint that all players must integrate with in order to get distribution. This feels like a distinctly Tim Cook contribution, a definite break from the past.\n In order to judge whether it’ll work, it’s important to always return to the basics from the “ Finding Power” framework: what is the job to be done? What’s not good enough? In other words, what is the basis of competition? What layers of the value chain do you need to control in order to win?\n In healthcare, the job is to keep people alive and healthy. But it costs too much, is way too complicated, and lacks critical information. It’s as if you were trying to operate a car without any gauges or indicators, and only went into the shop when something broke down so badly that you noticed it while driving. Whoever builds the system that aggregates this data will unlock massive improvements in the quality and efficiency of healthcare.\n   When Tim Cook told Jim Cramer that he thought Apple would be remembered mostly for its contribution to health, we should take him seriously and literally.\n Public company CEOs have a lot of limits on what they can say. There are huge disincentives to divulge details about specific plans, and plus, Apple is already well known to be an especially secretive company. So the only thing we have to go by is broad statements.\n Are we extrapolating too much? Maybe. But a  Straussian reading is the only possible reading in a situation like this. And this one feels right to us.\n It’s impossible to know how the future will play out, but we expect to see Apple continue to integrate with more healthcare providers and connected devices. Some forward-thinking providers like One Medical, Forward, and Q.bio will make better use of the data from Apple’s ecosystem to offer differentiated primary care. Patients will come to expect it and value it. Perhaps Barry’s or Equinox will integrate with Apple Health to create a better customer experience.\n  It’s an exciting vision, but we’re left wondering what will happen to people who can’t afford all this stuff. Depending on the results of this year’s election, we could see huge changes sweep through the system. It’s hard to predict what effect that could have.\n The important thing is to keep working for progress, and to work to ensure that progress is distributed as equitably as possible.\n  Rob Litterst works on subscription pricing at ProfitWell. His newsletter,  Good Better Best, covers digital packaging strategy.\n     Hit the “like” button (so I know to do more posts like this)\n Read “ Finding Power” to understand more of the theory that helped us generate this analysis.\n   Divinations is supported by readers. About half of the content is free, and half is paid. The paid posts explain theories of business strategy in great detail (Michael Porter, Clay Christensen, Hamilton Helmer, etc) and form the foundation of the analysis of specific companies that I do in the free posts.\n There’s one other cool thing: when you subscribe to Divinations you  also get access to  Superorganizers and  Praxis. They are two of the smartest newsletters on productivity you’ll encounter on the internet. It’s one big bundle. You can read more about it  here.", "posttime": "2020-06-13 15:58:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,操作系统,app,apple,building", "title": "苹果正在为健康打造操作系统", "title_en": "Apple is building an OS for health", "transed": 1, "url": "https://divinations.substack.com/p/healthos", "via": "", "real_tags": ["苹果", "操作系统", "app", "apple", "building"]}]