[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1035291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Concords是一个MVP框架，用于构建离线和分散的Web应用程序，并采用基于文件的方法来存储数据。它没有服务器或数据库，是一个用Javascript和HTML构建的静态应用程序，所有代码都是在浏览器中运行的，没有任何东西存储在浏览器或下载的文件之外。\nSaaS应用程序在具有数据库的服务器上运行。与用户界面的每次交互都会将信息从浏览器发送到服务器，然后服务器很可能会从一个集中的数据库中写入或提取一些内容。\n维护服务器和数据库既昂贵、复杂又耗时，而且我对软件的这一方面并不真正感兴趣。我不想要管理依赖的数据的责任，这既不是我的技能，也不是我的激情所在。我喜欢把注意力集中在前端体验上。\n我开始为基于文件的SAAS应用程序构建一个框架。多用户协作应用程序，具有数据驱动的用户流和高级用户界面。但离线运行并将状态保存到文件系统的应用程序，不会将其发送到基于云的数据库。为用户提供对其数据的完全所有权和可见性，而不依赖于互联网连接。采取循序渐进的方式实现互联互通，利用它丰富体验，但不依赖它。\n这款MVP展示了一个在协作Web应用中实现真正离线和分散体验的基本解决方案。这是一个静态的应用程序，所以只有Javascript和HTML，没有服务器或后台运行的数据库。这是一款先进的网络应用程序，有一名服务人员，完全可以在浏览器中运行。因此，一旦执行了初始加载，剩下的体验就可以完全脱机工作了，数据存储在文件中，通过用户界面下载和上传。\n一款董事会应用程序涵盖了SAAS应用程序中常见的许多功能，我认为它是证明这项技术的一个很好的基准。\n使用协和协议，身份验证全部在浏览器中完成，无需与服务器或外部资源进行任何通信。\n在协和认证系统中，我们会发布一个可下载的公共配置文件，其中包括您的公钥和一些基本用户信息。我把我的MVP留在了我的个人领地上。Https://ternent.dev/concords/sam-ternent.profile.concords.json\n任何可以访问我的公钥的人都可以为我加密数据，只有我可以用我的私钥读取这些数据。我只是把它储存在我的个人电脑里。它从来没有在网上出现过，其他人也不知道。\n此键用于将用户登录到应用程序，只有有效的组合键才能登录和访问软件。\n对于我的MVP来说，这足以完成一个像样的身份验证流程。我们可以使用可识别的配置文件/密码组合的用户体验来构建登录系统，同时设置加密的多用户数据流。\n我知道要求用户自己存储加密密钥的两个部分是一件痛苦的事情。如果私钥丢失，它将无法恢复，该密钥的任何加密数据也将无法恢复。但我不能在这方面妥协，只有这样才能保持事情的分散化。但这是一个可以通过软件解决的问题，它不一定非要由我的软件来解决--我们正在分散处理，但密钥管理软件会解决这个问题。\n大致了解我需要构建什么来证明这个概念，并且已经实现了用户配置文件和身份验证流，我选择实现的关键特性是：\n默认情况下，新用户无权编辑文档。为了MVP的目的，我们在左边的工具栏上放了一个加盟按钮。单击此选项将把用户作为条目添加到数据存储中，并解锁编辑。目前，这个概念已经涵盖够了，但是我们能够通过公钥/私钥身份验证实现直接加密，因此这将是在MVP上下文之外进一步探索的一个有趣途径。\n该框架的核心是用打字稿写成的。它是一组功能实用程序，覆盖了应用程序的数据端。它运行一个内部区块链来写入数据，并映射到一个用于读取的IndexDB实例。\n该图书馆的核心是Merkel Tree解决方案。我们的Merkle Tree(如在BlockChain和Git中使用的)是一个功能库，在浏览器中充当JSON对象结构中的区块链节点。\n在此基础上构建的是CRUD API，应用程序将与该API进行交互。当在应用程序中执行操作时，会为区块链创建带时间戳的事务。一旦提交，所有挂起的事务就会被添加到链上的一个块中。一旦区块被添加到区块链中，基于散列的数据结构就可以确保应用程序状态的完整性。\n{&#34；类型&#34；：&#34；任务&#34；，&#34；操作&#34；：&#34；创建&#34；，&#34；数据&#34；：{&#34；标题&#34；：&#34；任务名称&#34；，&#34；描述&#34；：&#34；任务描述&#34；，&#34；已完成&#34；：FALSE，&#34；到期日&#34；：&#34；2020-11-02&#34；，&#34；Assigned_to&#34；：&#34；a72e75a898db9247be59d1aaf9d4c54459e1d24faa43d9f5da0a5a9611a19eb&#34；，&#34；Column&#34；：&#34；2bb6a2b737381377fd962b1bda0771d084abd3cab270648c78b7e06566e6b5&#34；，&#34；id&#34；：&#34；d2e25d4d6c77b34fbe87da5f387cf8c3bec25ffc76673e84bf76dbf2aa15754f&#34；，&#34；Timestamp&#34；：1604144654690}，&#34；User&#34；：{&#34；FirstName&#34；：&#34；Sam&#34；，&#34；姓氏&#34；：&#34；Ternent&#34；，&#34；头像URL&#34；：&#34；https://ternent.dev/concords/avatar.jpeg&#34；，&#34；组织&#34；：&#34；Team Concords&#34；，&#34；id&#34；：&#34；a72e75a898db9247be59d1aaf9d4c54459e1d24faa43d9f5da0a5a9611a19eb&#34；}，&#34；签名&#34；：&#34；未发布&#34；}。\n区块链的另一边是DB层。当它接受区块链上的交易时，我们解析事件并在浏览器中对IndexedDB实例执行操作。事务在进入时被记录，因此我们不会重复事务，并最大限度地减少对数据库的写操作次数。\n只要我们有区块链数据对象，我们就能全面了解我们的应用和数据状态。我们可以根据受保护的事务历史记录，完全准确地删除并重新创建数据库。这是只读图层。\n这里的一个快速跳跃是使用电子将其构建成一个桌面应用程序。一些小事情，比如将散列保存到密钥链，直接读写文件系统。我很高兴能尝试运行DAT项目，使P2P连接能够提供实时协作体验。\n我的首要目标是权力下放。我并不反对将数据存储在云上，我只是希望能够自己选择在哪里存储数据。我最初想尝试的突出集成是与Dropbox的集成，将文件系统中的文件夹同步到Dropbox将使我们能够引入Git中的推/拉(Push/Pull)方面。(=。\n我需要围绕冲突解决做进一步的研究。我有完整区块链的基础，包括工作证明和共识，以确保底层数据结构的有效性，但它不能保护或处理应用程序内的数据冲突。视觉差异和冲突是各种其他应用程序中解决的问题，有大量的研究可用。我还不确定它会是什么样子，但它应该是一个有趣的问题来解决。\n使用我们的数据结构，用户角色和权限是可以实现的。通过使用应用程序级别的权限密钥，我们可以加密特定用户的访问密钥。然后，他们将有权访问该权限级别下的任何数据。", "note_en": "Concords is an MVP framework for building offline &amp; decentralised web apps, with a file-based approach to storing data. It has no servers or databases and is a static app built with Javascript and HTML, all code is written to run in a browser and nothing is stored outside of the browser or downloaded files.\n      SAAS applications run on servers with databases. Each interaction with the UI sends information from the browser to a server, which then likely writes something or fetches something from a centralized database.\n  Maintaining servers and databases is expensive, complex and time-consuming and I&#39;m not really interested in that side of software. I don&#39;t want the responsibility to look after data that is depended upon, that&#39;s neither my skill-set nor passion. I like to focus my attention on the front-end experience.\n  I set out to build a framework for file-based SAAS apps. Multi-user collaborative apps, with data-driven user flows and advanced UI. But apps that run offline and save state to the filesystem, not send it off to a cloud-based database. Giving users full ownership and visibility of their data, with no dependency on an internet connection. Taking a progressive approach to connectivity, using it to enrich the experience, but not depend on it.\n        This MVP serves to demonstrate a basic solution to a truly offline and decentralized experience in a collaborative web app. It&#39;s a static app, so just Javascript and HTML, with no servers or databases running in the background. It&#39;s a progressive web app with a service worker, that runs entirely in the browser. So once the initial load has been performed, the rest of the experience can work completely offline, where data is stored in files, downloaded and uploaded through the UI.\n  A boards app covers a lot of functionality commonly found in SAAS applications, I figured it&#39;s a great benchmark to prove out the technology.\n        With Concords, authentication is all done in the browser, without any communication to a server or external resource.\n  In the Concords authentication system, we issue a downloadable public profile which includes your public key and some basic user info. I keep mine for the MVP on my personal domain.  https://ternent.dev/concords/sam-ternent.profile.concords.json\n  Anyone with access to my public key is able to encrypt data for me, that only I can read with my private key. I just have that stored on my personal machine. It’s never been online and no-one else knows it.\n  This key is used to log the user into the app and only a valid key combination can login and access the software.\n  For my MVP, this is more than sufficient to complete and decent authentication flow. We can have a recognisable UX of profile/password combination to build a login system, whilst setting us up for an encrypted, multi-user, data flow.\n      I know it&#39;s a pain to ask users to store both parts of their encryption keys themselves. If the private key is lost, it&#39;s unrecoverable and so is any encrypted data to that key. But I couldn&#39;t compromise here, it has to be this way to keep things decentralized. But it&#39;s a problem that can be fixed through software, it doesn&#39;t have to be my software - we&#39;re decentralizing things here, but key management software will fix this problem.\n    Knowing roughly what I needed to build to prove out the concept, and having already implemented User Profile and the authentication flow, the key features I chose to implement were:\n          By default, a new user doesn&#39;t have edit access to a document. For the purpose of the MVP, we&#39;ve got a &#34;Join&#34; button in the left-hand sidebar. Clicking this will add the user as an entry to the data store and unlock editing. This covers the concept enough for now, but we are able to achieve direct encryption with the public/private key authentication, so that&#39;s going to be an interesting avenue to explore further outside of the MVP context.\n        The core of the framework is written in Typescript. It&#39;s a collection of functional utilities which cover the data side of the application. It runs an internal blockchain for writing data, mapped with an IndexDB instance for reading.\n    At the heart of the library is the  Merkel Tree solution. Our Merkle Tree (as used in Blockchain and git), is a functional library to act as a blockchain node, from a JSON object structure, in the browser.\n  Built on top of that is a CRUD API which the application will interface with. When an action is performed in the app, a timestamped transaction is created for the blockchain. Once commit, all pending transactions are then added to a block on the chain. Once a block has been added to the blockchain, the hash-based data structure ensures the integrity of the app state.\n  { &#34;type&#34;: &#34;tasks&#34;, &#34;action&#34;: &#34;create&#34;, &#34;data&#34;: { &#34;title&#34;: &#34;Task Name&#34;, &#34;description&#34;: &#34;Task Description&#34;, &#34;completed&#34;: false, &#34;due_date&#34;: &#34;2020-11-02&#34;, &#34;assigned_to&#34;: &#34;a72e75a898db9247be59d1aaf9d4c54459e1d24faa43d9f5da0a5a9611a19eb&#34;, &#34;column&#34;: &#34;2bb6a2b737381377fd962b1bda0771d084abd3cab270648c78b7e06566e6b5&#34;, &#34;id&#34;: &#34;d2e25d4d6c77b34fbe87da5f387cf8c3bec25ffc76673e84bf76dbf2aa15754f&#34;, &#34;timestamp&#34;: 1604144654690 }, &#34;user&#34;: { &#34;firstName&#34;: &#34;Sam&#34;, &#34;lastName&#34;: &#34;Ternent&#34;, &#34;avatarUrl&#34;: &#34;https://ternent.dev/concords/avatar.jpeg&#34;, &#34;organisation&#34;: &#34;Team Concords&#34;, &#34;id&#34;: &#34;a72e75a898db9247be59d1aaf9d4c54459e1d24faa43d9f5da0a5a9611a19eb&#34; }, &#34;signature&#34;: &#34;NOT RELEASED&#34;}\n     Sitting on the other side of the blockchain is the DB layer. When a transaction it accepted onto the blockchain, we parse the event and perform an operation on an IndexedDB instance in the browser. Transactions are recorded as they go in, so we don’t duplicate transactions and minimise the number of write operations to the database.\n  As long as we have the blockchain data object, we have a full picture of our app and data state. We can drop and recreate a database with complete accuracy, based on secured transactional history. This is a  read only layer.\n                A quick leap here is to build this out into a desktop app using electron. Little things like saving the hash to a keychain, directly reading and writing to the filesystem. I&#39;m excited to try running the  DAT project to enable P2P connectivity to give a realtime collaborative experience.\n    My primary goal is decentralization. I&#39;m not against storing data on the cloud, I just want to be able to make my own choice as to where. The initial standout integration I want to try is with Dropbox, syncing a folder in your filesystem to dropbox will give us the ability to introduce the &#34;push/pull&#34; aspect found in git.\n    I need to do further research around conflict resolution. I have the basics for a complete blockchain, which includes proof of work and consensus to ensure the validity of the underlying data structure, but it doesn&#39;t secure or handle in-app data conflicts. Visual diffs and conflicts are problems solved in various other applications, with plenty of research available. I&#39;m not sure how it will look yet, but it should be a fun one to solve.\n    Using our data structure user roles and permissions are achievable. With the use of application-level permission keys, we can encrypt the access key for a specific user. They will then have access to any data under that permission level.", "posttime": "2020-11-16 01:07:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,离线,offline,应用程序", "title": "一个用于离线和分散的Web应用程序的框架", "title_en": "A framework for offline and decentralised web apps", "transed": 1, "url": "https://concords.app/blog/what-is-concords", "via": "", "real_tags": ["程序", "离线", "offline", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "3cd7b8b1a2f8ab4d8ea1db43430ce811.jpg", "infoid": 1035290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们讨论原创内容播客的最新一集时，HBO的新纪录片讲述了一家名为Nxivm(发音为nex-ee-um)的自我完善公司的故事，该公司后来被揭露为性崇拜，其领导人基思·拉尼尔(Keith Raniere)被判处120年监禁。\n核心故事既令人信服，又令人毛骨悚然。而《誓言》中有数量惊人的镜头显示了拉涅尔和其他Nxivm高层成员在工作-仅出于这个原因，对于任何对Nxivm故事感兴趣的人来说，这部电视剧都值得一看。\n然而，它也受到了一些不幸的讲故事选择的阻碍。首先，通过将故事分散在9个小时的剧集中，这部电视剧经常让人感觉不必要的冗长和重复。\n“誓言”聚焦于少数Nxivm的高级成员，他们后来成为重要的告密者和批评者(包括负责大量幕后镜头的电影制作人马克·文森特(Mark Vicente))，也招致了批评，认为它淡化了拉涅尔真正受害者的故事，掩盖了他的罪行程度(不像斯塔兹的纪录片“诱惑”(Traduced))。\n除了回顾这一系列，我们还讨论了最新的迪士尼+增长数据和新一季的《光棍》。\n你可以在下面的播放器中收听我们的评论，使用苹果播客订阅，或者在你选择的播客播放器中找到我们。如果你喜欢这部剧，请在苹果上留言让我们知道。您也可以在Twitter上关注我们或直接向我们发送反馈。(或者推荐节目和电影供我们评论！)。\n如果你想跳过，下面是这一集的详细介绍：0：00介绍0：45迪士尼+讨论7：40《单身女子》讨论30：48《誓言》评论", "note_en": "As we discuss on the latest episode of  the Original Content podcast, HBO’s new docuseries tells the story of NXIVM (pronounced nex-ee-um), a self-improvement company that was subsequently  revealed as a sex cult, with its leader Keith Raniere  sentenced to 120 years in prison.\n The core story is both compelling and horrifying. And “The Vow” features an astonishing amount of footage showing Raniere and other high-level NXIVM members at work — for that reason alone, the series is worth watching for anyone interested in the NXIVM story.\n  However, it’s also hampered by some unfortunate storytelling choices. For one thing, by parceling the story out over nine hour-long episode, the series often feels unnecessarily drawn out and repetitive.\n And by focusing on a handful of high-ranking NXIVM members who subsequently became important whistleblowers and critics (including Mark Vicente, the filmmaker responsible for a great deal of that behind-the-scenes footage), “The Vow” has also  opened itself up to criticism that it downplays the stories of Raniere’s true victims and obscures the extent of his crimes (unlike the Starz documentary “Seduced”) .\n In addition to reviewing the series, we also discuss  the latest Disney+ growth numbers and the new season of “The Bachelorette.”\n You can listen to our review in the player below,  subscribe using Apple Podcasts or find us in your podcast player of choice. If you like the show, please let us know by leaving a review on Apple. You can also  follow us on Twitter or  send us feedback directly. (Or suggest shows and movies for us to review!)\n If you’d like to skip ahead, here’s how the episode breaks down: 0:00 Introduction 0:45 Disney+ discussion 7:40 “The Bachelorette” discussion 30:48 “The Vow” review", "posttime": "2020-11-16 00:49:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,内容,content,故事", "title": "\n原创内容播客：《誓言》提供了一个关于Nxivm邪教的混乱画面", "title_en": "\n\t\t\t\tOriginal Content podcast: ‘The Vow’ offers a muddled look at the NXIVM cult\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/15/original-content-podcast-the-vow-offers-a-muddled-look-at-the-nxivm-cult/", "via": "", "real_tags": ["播客", "内容", "content", "故事"]}, {"category": "", "categoryclass": "", "imagename": "c85896ab2bec34cbd6e0b96cb189ba58.png", "infoid": 1035288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可批量生产的开源新冠肺炎ARDS呼吸机。旨在帮助医院应对疫情爆发期间可能出现的专业呼吸机短缺问题。全世界。\nMakair呼吸机是第一台在法国进行临床试验并在人类患者身上成功测试的开源呼吸机。\n我们是一个由200多名贡献者组成的分布式团队(工程、医疗、监管等)，主要分布在法国各地。制造商、开发者、大学教师、研究人员和医疗团队在这个项目上进行了合作。我们的测试和组装业务位于法国。\n为了确保国际化，我们确保您自己制造MakAir呼吸机所需的内容有英文版本。MakAir项目有自己的网站。\n粗略地说，想法是这样的：从2020年4月起，由于新冠肺炎疫情的影响，世界各地的医院可能会开始缺乏机械式人工呼吸机。我们建造了一个泵和一个阀门系统(由电子设备控制)。通过这种方式，可以通过阀门系统中适当的空气路线来实现呼吸循环。\n我们的呼吸机能够处理压力控制呼吸，通过软件中的PID控制器稳定下来。\n为了确保正确的呼吸周期(吸气+呼气)，需要将多个阀门连接在一起形成一个回路。它们的马达需要协调控制，以便每个阀门单元之间的空气路线是一致的。\n该项目提供了用批量生产的部件建造一台足够好的ARDS呼吸机所需的所有部件。我们提供所需的所有机械部件、电子设计和电路板以及固件。这款呼吸机可以通过3D打印并在Arduino板上运行(制造商的方式)，但我们强烈建议您与工业流程合作，如模制医用级塑料部件并组装整个呼吸机(这将是制造的呼吸机通过所有医疗认证所必需的)。\n我们的目标是每台呼吸机的单位成本远低于500欧元，考虑到适当的规模经济，以及更便宜的现成部件的选择，可以很容易地将每台呼吸机的成本缩减到200欧元甚至100欧元。随动马达)。\nMakAir呼吸机已经由独立研究人员进行了测试，研究发现，它可以与昂贵的医院复苏呼吸机相媲美(在目标压力和体积上的误差不到5%)。\n从机械上讲，整个系统由子组件组成，这些子组件可以插在一起并连接起来，形成一个空气回路，即：\n虽然3D打印(FDM和SLA)可以用来制造自己的呼吸机，但这肯定不会很好地扩展到批量生产MakAir呼吸机，而且部件可能会变脆或漏气。如果您想制造自己的Makair通风机，请使用适当的工业方法和流程。\n当ARDS患者使用镇静剂时，他们的呼吸周期被机械通气强迫，而他们需要插管。呼吸机故障(由于机械、气动或软件故障)可能会导致患者死亡(氧气减饱和)，或永久性损害患者的肺泡(超压)。至关重要的是，任何自建的MakAir呼吸机都要在肺部模拟器系统上进行测试(例如：ASL 5000)，并经医学专家验证。\n生产呼吸机时应使用医用级塑料，呼吸机内必须避免任何油脂或粘性化学物质。通风器应在洁净室内生产，以避免粉尘和细菌污染。\n气动回路应彻底测试是否有泄漏，以及其承受升高的正气压的能力。应在相关的地方使用接头，部件之间应使用医用级软管。\n虽然在法国现场生产的Makair呼吸机经过了医疗与工程委员会的验证，但您应该独立寻求对您生产的Makair呼吸机的验证，因为您的组装方法或部件可能会因我们的不同而有所不同。\nMakAir和Maker for Life在任何时候都不应为对人类生命造成的伤害承担责任(例如，MakAir和Maker for Life)。肺损伤或生命损失)。通过构建自己的MakAir，您需要对其安全验证和使用负责。\n随着MakAir通风机项目逐渐变得相当大，它被分成几个子库(例如。固件、印刷电路板设计等)。\nMakair-CONTROL-UI：控制用户界面，在LCD显示屏上显示呼吸机运行时的实时图形；\nMakair遥测：遥测库(和CLI工具)，用作固件和控制用户界面之间的协议桥；\n制造零件：可进行3D打印和组装以构成气动回路的机械零件；\n本部分旨在向您介绍如何制造自己的MakAir-3D打印方式。换句话说，我们将在那里解释如何使用现成的部件和3D打印机来制造一台DIY MakAir。\n为了3D打印您的MakAir，请首先确保您最多只能使用SLS 3D打印机(例如，HP Multi Jet Fusion)，或其他SLA打印机(例如。Formlabs表格3)。如果要使用FDM打印机(例如，MakerBot方法)，请注意，某些精密部件已针对SLA或SLS打印进行了优化。使用FDM打印机时，某些部件可能打印不好，即使在像样的硬件上也是如此。\n👉总结：最好使用SLS金属打印机，否则，使用SLA树脂打印机。如果您无法访问这两种设备，您可以使用FDM灯丝打印机(使用PLA或ABS灯丝)。\n您可以找到应进行3D打印的所有部件的列表，以及每个部件应打印的部件数量(为每个部件选择最后激活的版本)：\n1台吹风机-使用同一打印机打印所有STL部件(SLA或SLS；不建议使用FDM；至少50微米)；\n2个压力阀-使用同一打印机打印所有STL部件(SLA、SLS或FDM；至少200微米)；\n1个混氧机-打印STL部件(SLA或SLS；不建议使用FDM；至少100微米)；\n1个患者过滤器盒-使用同一打印机打印所有STL部件(SLA、SLS或FDM；至少100微米)；\n1个机器过滤器盒(进气口)-使用同一打印机打印所有STL部件，确保选择正确的子部件(SLA或SLS；建议使用FDM；至少100微米)；\n1个机器过滤器盒(输出)-使用同一打印机打印所有STL部件，确保选择正确的子部件(SLA或SLS；不建议使用FDM；至少100微米)；\n1个气动接头(鼓风机)-使用同一打印机打印STL部件，确保选择正确的子部件(SLA或SLS；不建议使用FDM；至少100微米)；\n1个气动接头(O2)-使用同一打印机打印STL部件，确保选择正确的子部件(SLA或SLS；不建议使用FDM；至少100微米)；\n1个气动接头(无压力)-使用同一打印机打印STL部件，确保选择正确的子部件(SLA或SLS；不建议使用FDM；至少100微米)；\n1个气动接头(压力)-使用同一打印机打印STL部件，确保选择正确的子部件(SLA或SLS；不建议使用FDM；至少100微米)；\n如果您使用的是您自己的专有鼓风机--除了上面的部件--请调整鼓风机座CAD型号并将其打印出来(此型号在最差情况下使用FDM打印机打印效果很好)。\n现在您已经打印好了所有部件，可以将它们组装到Makair外壳盒中。我们建议您使用激光切割的亚克力面板制作外壳。您可能会找到Fusion 360的外壳CAD模型或STEP文件。\n请确保您的亚克力面板的切割尺寸与我们型号上的尺寸相同，因为这些尺寸已经过优化，可以在最小的空间内容纳所有需要的部件和电子产品。\n电子设备由两部分组成：固件控制器板(通常是Arduino)和原始印刷电路板电子设备(LCD、接口按钮、报警蜂鸣器等)。这些部件组成了主板，在主板上安装了刚性面板，并打印了用户说明(例如，控制按钮绑定)。\n主板的电子原理图和接线图可以在那里找到。请选择最后一个可用的版本。\n控制单元由Raspberry Pi 4计算机组成，连接到Raspberry Pi Touch显示屏。\n现在机械部件和电子设备都已准备就绪，您可以在固件控制器板(Arduino、St Nucleo或其他)上刷新最新的MakAir固件二进制文件。\n控制单元应按照控制单元文档中提供的说明在树莓PI 4上构建和运行。\n如果没有这些公司和组织的支持，这个项目是不可能的，这些公司和组织在项目上投入了人力、房地产和/或财政资源：\n此外，该项目还有200多名个人成员，他们对技术、法律、医学和新闻主题(以及更多)做出了贡献。", "note_en": "Mass-producible open-source Covid-19 ARDS ventilator. Aims at helping hospitals cope with a possible shortage of professional ventilators during the outbreak. Worldwide.\n Makair ventilator is the first open-source ventilator tested with success on human patients with ongoing clinical trials in France.\n We are a distributed team of  200+ contributors (engineering, medical, regulatory, etc.), mostly spread through France. Makers, developers, university teachers, researchers and medical teams collaborated on this project. Our testing &amp; assembly operations are located in France.\n As to ensure international outreach, we made sure that contents required to build your own MakAir ventilator are available in English. The MakAir project has  a website of its own.\n        Roughly, the idea is as follows: as of April 2020 and due to the Covid-19 pandemic, hospitals throughout the world may start lacking mechanical artificial ventilators. We built a pump, and a valve system (controlled by electronics). This way, the breathing cycle can be enforced by proper air routing through the valve system.\n Our ventilator is able to handle pressure-controlled breathing, stabilized using a  PID controller in the software.\n In order to ensure a proper breathing cycle (inhale + exhale), multiple valves need to be connected together to form a circuit. Their motors need to be controlled in harmony so that the air routing between each valve unit is consistent.\n This project provides all the parts required to build a good-enough  ARDS ventilator from mass-produced components. We provide all the required mechanical parts, electronics designs &amp; boards, and firmwares. This ventilator can be 3D-printed and ran on an Arduino board (the maker way), though we  highly advise that you work with industrial processes as to mold medical-grade plastic parts and assemble the whole ventilator (this would be required for the built ventilator to pass all medical certifications).\n We target a per-unit cost well under 500 EUR, which could easily be shrunk down to 200 EUR or even 100 EUR per ventilator given proper economies of scale, as well as choices of cheaper on-the-shelf components (eg. servomotors).\n   MakAir ventilator has been tested by independent researchers and studies found that it can compare with expensive hospital reanimation ventilators (less than 5% error on target pressures and volumes).\n Mechanically-speaking, the overall system is composed of sub-components that can be plugged together and wired to form an air circuit, namely:\n       Though 3D-printing (FDM and SLA) can be used to build your own ventilator — this will definitely not scale well to mass-produce MakAir ventilators, and parts might be brittle or leak air. Please work with proper industrial methods and processes if you want to build your own MakAir ventilators.\n As ARDS patients are sedated, their breathing cycle is forced by mechanical ventilation, while they are intubated. A failing ventilator (due to bad mechanics, pneumatics or software) could kill the patient (O2 desaturation), or permanently damage their lung alveoli (overpressure). It is critical that any self-built MakAir ventilator is tested against a lung simulator system (eg.  ASL 5000), and validated by medical experts.\n Medical-grade plastic should be used to produce ventilators, and any kind of grease or adhesive chemicals must be avoided in the ventilator. The ventilators should be produced in a  cleanroom as to avoid dust &amp; germ contaminations.\n The pneumatic circuit should be thoroughly tested for leaks and its ability to withstand elevated positive air pressure. Joints should be used where relevant, and medical-grade flexible pipes should be used between components.\n While the MakAir ventilators produced on-site in France were validated by a medical &amp; engineering board, you should independantly seek validation of the MakAir ventilators that you produce; as your assembly methods or parts may vary with ours.\n MakAir and Makers For Life should not be held resposible — at any time, for harm caused to human life (eg. lung damage or loss of life). By building your own MakAir, you are held responsible for its safety validations &amp; use.\n  As the MakAir ventilator project grew up to be quite large, it is split up in sub-repositories (eg. firmware, PCB designs, etc.).\n  makair-control-ui: The control user interface, that shows realtime graphs of the ventilator while running, on a LCD display;\n makair-telemetry: The telemetry library (and CLI tool), used as a protocol bridge between the Firmware and Control UI;\n    makair-parts: The mechanical parts that can be 3D-printed and assembled to build the pneumatic circuit;\n  This section aims at introducing you on how to manufacture your own MakAir —  the 3D-printed way. In other words, we will explain there how to build a DIY MakAir using on-the-shelf parts and 3D printers.\n  In order to 3D-print your MakAir, please first ensure you have access to a  SLS 3D printer at best (eg.  HP Multi Jet Fusion), or otherwise a  SLA printer (eg.  Formlabs Form 3). If you want to use a  FDM printer (eg.  MakerBot Method), please note that some precise parts have been optimized for SLA or SLS printing. Some parts may not print well using FDM printers, even on decent hardware.\n 👉 To sum up: at best, use a SLS metal printer, else, use a SLA resin printer. If you do not have access to either of these, you may fallback on a FDM filament printer (using  PLA or  ABS filaments).\n  You can find a list of all parts that should be 3D-printed, as well as the number of parts that should be printed for each one (pick the last active version for each part):\n 1 x  Blower — Print  all STL parts using the same printer (SLA or SLS; FDM discouraged; 50 microns minimum);\n 2 x  Pressure Valve — Print  all STL parts using the same printer (SLA, SLS or FDM; 200 microns minimum);\n 1 x  Oxygen Mixer — Print  the STL part (SLA or SLS; FDM discouraged; 100 microns minimum);\n 1 x  Patient Filter Box — Print  all STL parts using the same printer (SLA, SLS or FDM; 100 microns minimum);\n 1 x  Machine Filter Box (Intake) — Print  all STL parts using the same printer, make sure that you pick the proper sub-part (SLA or SLS; FDM discouraged; 100 microns minimum);\n 1 x  Machine Filter Box (Outtake) — Print  all STL parts using the same printer, make sure that you pick the proper sub-part (SLA or SLS; FDM discouraged; 100 microns minimum);\n 1 x  Pneumatic Connectors (Blower) — Print  the STL part using the same printer, make sure that you pick the proper sub-part (SLA or SLS; FDM discouraged; 100 microns minimum);\n 1 x  Pneumatic Connectors (O2) — Print  the STL part using the same printer, make sure that you pick the proper sub-part (SLA or SLS; FDM discouraged; 100 microns minimum);\n 1 x  Pneumatic Connectors (No Pressure) — Print  the STL part using the same printer, make sure that you pick the proper sub-part (SLA or SLS; FDM discouraged; 100 microns minimum);\n 1 x  Pneumatic Connectors (Pressure) — Print  the STL part using the same printer, make sure that you pick the proper sub-part (SLA or SLS; FDM discouraged; 100 microns minimum);\n If you are using your own proprietary blower —  in addition to the parts above — please adjust the  Blower Holder CAD model and print it as well (this one prints well using a FDM printer at worst).\n  Now that you got all parts printed, you may assemble them in the MakAir casing box. We recommend that you build the casing using laser-cut acrylic panels. You may find the casing CAD model for  Fusion 360 or as a  STEP file.\n Please ensure that you cut your acrylic panels using the same sizes than stated on our models; as those sizes are optimized to contain all required parts and electronics in the minimum amount of space.\n  Electronics are comprised of two parts: the firmware controller board (typically, an Arduino), and the &#34;raw&#34; PCB electronics (LCD, interface buttons, alarm beeper, etc.). Those parts make up the motherboard, on the top of which a rigid panel is mounted, and user instructions are printed (eg. control button bindings).\n  The motherboard electronic schematics and wiring diagrams  can be found there. Please pick the last version available.\n   The control unit is made of a  Raspberry Pi 4 computer, plugged to a  Raspberry Pi Touch Display.\n    Now that both mechanical parts and electronics are ready, you may flash the latest MakAir firmware binary on your firmware controller board (Arduino, ST Nucleo, or other).\n    The Control Unit should be built and ran on the Raspberry Pi 4 using instructions available on the  Control Unit documentation.\n                   This project would not have been possible without the support of those companies and organizations, which have put human, real estate and/or financial resources at work on the project:\n    Adding to that, 200+ individual members of the project who contributed to technical, legal, medical and press subjects (and more).", "posttime": "2020-11-16 00:43:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,source", "title": "第一台在人类患者身上测试的开源呼吸机", "title_en": "The first open-source ventilator tested on human patients", "transed": 1, "url": "https://github.com/makers-for-life/makair/", "via": "", "real_tags": ["开源", "source"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我就是我所说的不知名的公众人物。我这么说是什么意思？我的意思是，我的工作是人们公开评论我的工作。作为一名大学教师，我会收到学生的评论。有些是在我们学校内部阅读的，有些是公之于众的。它们和我的名字连在一起。它们不是人们可能只知道我的公司或我的品牌的产品。他们了解我，他们正在评估我。作为一名作家，我的书会受到评论。其中一些评论是由出版商内部的编辑和官方评论员撰写的。其中一些评论是通过电子邮件进行的。但这些评论大多发布在网上。作为一名软件开发人员和业余播客，我也得到了公众的评价。\n对于那些在个性化创意领域非常关心自己工作的人来说，负面评价是有害的。这不仅仅是敏感的问题(虽然我很敏感，但这无济于事)。这就是说，当你真的全身心投入到某件事上时，比如我在做我的教学，那么这个产品就是你的延伸。没有人会否认，一堂课或一本书的结果是教师/作者人格、知识和能力的延伸。而当产品被批评的时候，就好像你被批评了一样。\n我的父亲也是一名大学教师，在许多其他公共创意项目中，他制作了9本书和9部教学视频，他的脸皮很薄。他不能忍受我给他读一篇差评。这让我印象深刻。这个多才多艺的人，连一点点批评都忍受不了。当我变得过于敏感时，我会试着回忆他不能接受批评是如何伤害了他的一些产品。他更注重的是把事情做好，而不是把它们做得尽善尽美。如果他有一点完美主义的气质，他会做得更好。但也许他会少做些…。\n如果我在一节课上得到18个好评，那也没关系。这两个差评的话让我印象深刻。你知道为什么吗？因为这些评论几乎总是有一丝真实性。这是不是意味着我们应该听他们的？如果我只听那些差评，我就什么都不会做了。我只会躺在床上。事实是，那些没有得到负面评价的人，是那些不会冒险把自己放在那里的人。因此，我们不能让自己灰心丧气，以至于停止生产。我们必须记住，虽然我们可能没有很好地为这两名学生服务，但我们为其他18名学生提供的服务可能比没有我们教他们的世界中的他们得到的服务更好。\n我们不可能取悦每一位学生或每一位顾客。只有少数人观看/阅读的任何东西都不会受到所有人的喜爱。即使是特蕾莎修女也会在YouTube上获得反对票。因此，如果我们是在为大多数人服务，我们就不想让少数人的批评把我们引向错误的方向。\n另一方面，像我爸爸一样也很危险。不，客户并不总是正确的。但通常情况下，客户是有道理的。我们必须一直努力让自己变得更好。因为我们并不完美，总有改进的空间。我们需要阅读这些差评，找出需要改进的地方。这并不意味着他们是对的，但这确实意味着我们需要考虑他们。\n我父亲完成了令人惊叹的成就。如果他让这些不好的评价让他变得太慢，很可能他就不会取得那么大的成就。但如果他能找到一些微调和改变，更好地服务于少数几个客户，那么他就可以在这些变化中成长起来。我想成长，但我也不想停下来。所以，我不能让这些评论让我太沮丧，但我必须读一读。", "note_en": "I am what I would call a non-famous public person. What do I mean by that? I mean that I have jobs where people publicly review my work. As a college instructor, I receive student reviews. Some of them get read internally at our school, and some of them get posted publicy. And they’re attached to my name. They’re not some product where people might just know my company or my brand. They know  me, and they’re reviewing  me. As an author, my books get reviewed. Some of those reviews are by editors and official reviewers internal to the publisher. Some of those reviews are by email. But most of those reviews are posted online. As a software developer and hobbyist podcaster I also get public reviews.\n To anyone in a personalized creative field who cares deeply about their work, bad reviews hurt. It’s not just about being sensitive (although I am sensitive and that doesn’t help). It’s that when you really pour your heart into something, as I do my teaching for example, then the product is an extension of you. Nobody would deny that the way a class or a book turns out is an extension of the personality, knowledge, and ability of the teacher/author. And when the product is criticized, it’s like you are being criticized.\n My dad, who was also a college instructor, and the producer of nine books and nine instructional videos among many other public creative ventures, had a very thin skin. He couldn’t stand me reading him a bad review. That stuck with me. This very accomplished man, couldn’t stand even a little criticism. When I get too sensitive, I try to remember how his inability to accept criticism hurt some of his products. He was much more about getting things done than doing them perfectly. If he had a little bit more of a perfectionist streak in him, he would have done even better. But maybe he would have done less…\n It doesn’t matter if I receive eighteen great reviews for a class. It’s the words of the two bad reviews that stick with me. And do you know why?  Because almost always there’s a kernel of truth to those reviews. Does that mean we should listen to them? Well if I only listened to the bad reviews, I would never produce anything. I would just stay in bed. The fact is the people who are getting no bad reviews, are the people who are not taking the risk of putting themselves out there. So, we have to not let ourselves get so discouraged that we stop producing. And we have to remember that while we may not have served those two students well, we may have served those other eighteen students better than they would have been served in a world without us teaching them.\n We can’t please every student or every customer. Nothing that gets watched/read by more than a few people is going to be liked by all of them. Even Mother Theresa would get a downvote on YouTube. So, if we’re serving the majority, we don’t want to let the critiques of a few steer us in the wrong direction.\n On the other hand, being like my dad is dangerous too.  No, the customer is not always right. But usually the customer has a point. We have to always be working to get better. Because we’re not perfect, and there’s always room for improvement.  And we need to read those bad reviews to find those spaces for improvement. It doesn’t mean they’re right, but it does mean we need to think about them.\n My dad accomplished an amazing amount. If he let those bad reviews slow him down too much, it’s very possible he would have not accomplished as much. But if he could have found a few tweaks, a few changes, to serve a few customers better, well then he could have grown through them. I want to grow, but I also don’t want to stop. So, I can’t let the reviews get me too down, but I have to read them.", "posttime": "2020-11-16 00:43:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "接受批评,criticism,评论", "title": "论接受批评", "title_en": "On Taking Criticism", "transed": 1, "url": "https://www.observationalhazard.com/2020/11/on-taking-criticism_15.html", "via": "", "real_tags": ["接受批评", "criticism", "评论"]}, {"category": "", "categoryclass": "", "imagename": "55a0c39380ecf3f7d93784427b5b1a6d.jpeg", "infoid": 1035286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个用于调试FreeCAD Python宏的小型Python环境。将FakeFreeCad程序包含到您的代码中，它将模拟FreeCAD操作的子集。\n它将为你的设计绘制一个自上而下的2D视图(某种程度上)，但这不是重点。它所做的就是让你轻松地浏览你的程序，查看变量，以及做你在FreeCAD宏编辑器中做不到的所有其他事情。\n从FakeFreeCad导入*#来自FreeCad的代码从这里开始#将它变成一个可以调用的函数，以生成partdef Make Platform()：=Part.MakeBox(800,600,100)hole=Part.MakeCylinder(200,200，Base.Vector(400,300，0))Board=plate.Cut(Hole)Part.show(Plate)Gui.SendMsgToActiveView(&#34；ViewFit&#34；)Gui.activeDocument().activeView().viewAxometric()###End of(&#34；ViewFit&#34；)End Of)GUI.SendMsgToActiveView(&#34；ViewFit&#34；)End of。Rob Miles的GadgetMaker 1.0)#调用FreeCad函数来设计partMake Board()#display outputtk_display.mainloop()。\n我正在用它来创建一个我正在开发的案例制作程序。它最终将与文档一起出现在GitHub上。", "note_en": "A tiny Python environment for debugging FreeCAD Python macros. Include the FakeFreeCad program into your code and it simulates a subset of FreeCAD actions.\n It will draw a top down 2D view of your design (sort of) but that&#39;s not the point. What it will do is make it easy to step through your program, view variables and do all the other things that you can&#39;t do in the FreeCAD macro editor.\n   from FakeFreeCad import *### code from FreeCad starts here### Make it into a function that can be called to make the partdef makePlate(): plate = Part.makeBox(800,600,100) hole = Part.makeCylinder(200,200,Base.Vector(400,300,0)) plate = plate.cut(hole) Part.show(plate) Gui.SendMsgToActiveView(&#34;ViewFit&#34;) Gui.activeDocument().activeView().viewAxometric()### End of the FreeCad code# Open the displaytk_display = TKDisplay(1000,600)Display.setCanvas(tk_display)Display.addMessageLine(&#34;Gadgetmaker 1.0 by Rob Miles&#34;)# Call the FreeCad function to design the partmakePlate()# Display the outputtk_display.mainloop()\n I&#39;m using it to create a case making program I&#39;m working on. It will eventually appear on GitHub along with documentation.", "posttime": "2020-11-16 00:43:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "freecad", "title": "FreeCAD模拟器", "title_en": "FreeCAD Simulator", "transed": 1, "url": "https://github.com/CrazyRobMiles/FreeCADSimulator", "via": "", "real_tags": ["freecad"]}, {"category": "", "categoryclass": "", "imagename": "f2accaf325da84dcbb5021a2dd7fd7c4.jpg", "infoid": 1035285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从Pinterest上所有这些天来专门介绍阳台的页面和在线挂牌照片来看-豪华阳台、备用阳台、花哨得离谱的阳台-对于购房者和卖家来说，如今风景如画的阳台比以往任何时候都更热。\n当然，这些天生浪漫的平台并不是什么新鲜事：威廉王子在白金汉宫的一个平台上第一次公开亲吻了他的新娘凯特·米德尔顿，莎士比亚的不幸情人朱丽叶站在自己的平台上渴望罗密欧。\n现在，大众对这一建筑元素本身着迷了。阅读《学习Lingo》的最新一期，了解你作为购房者可能会遇到的许多不同类型的阳台-或者考虑作为房主增加阳台。\n这个现代阳台的前身揭示出，这些服装实际上可以追溯到战争，而不是爱情。A Hourd是一种木制脚手架，最初是一种安装在城堡外墙上的“11世纪反围困装置”。他们身上覆盖着兽皮或，嗯，粪便，以抵御攀爬的入侵者，并保护城堡守卫者，因为他们向下面的叛乱分子投掷石块(或更多的粪便)。当然，如今的阳台更多的是为了优雅的目的而建造的--而且粪便也明显减少了。\n这些阳台实际上不过是家居立面上的栏杆装饰品。室外绝对没有空间--没有可用的露台，什么都没有。虽然有些人可能会辩称，人造阳台并没有提供任何真正的用途，但你不能打折，因为这是一个令人眼花缭乱的因素。\n从外面看，它们给人一种阳台的错觉，而不那么假的栏杆，从玻璃到熟铁，可以防止你在推开窗户时掉下来。可以把人造阳台看作是你外墙的装饰品。\n是的，当涉及到阳台时，人造阳台和假阳台是有区别的。一个假阳台有一个栏杆和一个很小的露台，通常大约有4到6英寸深。由于这些露头--也被称为“阳台”--是封闭的，不会给房屋增加任何实际面积，因此可以很容易地将它们安装在现有的房屋上。虽然狭窄的露台不能容纳一对亲吻的皇室成员，但对于芳香的香草园来说，它是帮助带来一点户外活动的理想之选。\n这些异想天开的东西从220美元到4000多美元不等，这取决于你想要铝还是锻铁。\n也许最流行的假阳台是朱丽叶阳台。莎士比亚只字不提年轻的卡布利特站在阳台上，罗密欧问道：“那边窗户透进来的是什么光？”然而，这部剧的传统舞台总是让朱丽叶陶醉在这个小栖息地上。\n朱丽叶这个绰号通常被用来形容小而不突出的露台，通常是由一扇玻璃门和外面的浅栏杆组成的。\n另一种流行的假阳台风格的绰号来自法式门，这些法式门通向一个小露台，下面的风景随处可见。爱德华·马奈(Edouard Manet)在巴黎奥赛博物馆(Musée d；Orsay)展出的画作《阳台》就是一个著名的例子。\n教皇和艾薇塔有什么共同之处？喜欢在真正的阳台上向公众发表讲话。对于你和我来说，这是一个阳台，设计了一个非常宽敞的露台，可以容纳休闲椅，让你在喝葡萄酒的同时观看日落。\n由于真正的阳台通常从高层建筑的二层延伸而来，因此通常也会有甜蜜的景色，就像从白宫杜鲁门阳台上可以看到的南草坪一样。\n这些户外空间是模糊一个新家内部和外部的绝佳方式。根据《重塑》杂志的说法，主卧套房中的一套被认为是一种奢华的升级。\n虽然价格因材料和尺寸的不同而有很大差异，但一辆低调的4英尺木质自行车的平均价格至少为每平方英尺15至20美元。诚然，虽然很难将阳台的魅力转化为冷钱，但至少在纽约，这笔钱可以让要价增加数千英镑。\n夹层的定义是建筑中两个主要楼层之间的小楼层，夹层也是一种专为住宅内部设计的阳台。这通常会有一个巨大的甲板或平台，从被保护栏杆包围的围墙延伸出来。\n本质上是舒适的阁楼区域，也是家庭办公室的热门场所，或者是非常小的折叠式客人沙发的完美角落。开创性的设计师查尔斯·伊姆斯和雷·伊姆斯在他们位于加州的定制住宅中添加了一款。从那以后，我们其他人就一直在追赶。\n虽然露台乍一看可能看起来像阳台，但它实际上是一个独特的建筑特征。传统上不在一楼，因此给人一种阳台的错觉，门廊通过屋顶和支撑结构被分开。阳台悬挂在建筑外，没有头顶覆盖，而阳台是建筑的一部分，与人共用屋顶。", "note_en": "Judging from all the Pinterest pages and online listing photos devoted to balconies these days—luxe ones, spare ones, absurdly tricked-out ones—the picturesque perches are hotter than ever these days for home buyers and sellers.\n Of course there&#39;s nothing new about these inherently romantic platforms:  Prince William first publicly kissed his new bride,  Kate Middleton, on one at Buckingham Palace, and  Shakespeare&#39;s star-crossed lover  Juliet pined for  Romeo as she stood on hers.\n Now the masses are swooning over this architectural element itself. Read this latest installment of   Learning the Lingo to discover the many different types of balconies you might encounter as a home buyer—or consider adding on as a home owner.\n     This ancient predecessor to the modern balcony reveals that these accoutrements actually trace their roots to war, not love. A  hourd was a wooden scaffolding that originated as an “ 11th-century anti-siege device” on exterior castle walls. They were covered in animal skin or, um, manure to ward off climbing invaders and protect castle defenders as they dropped rocks (or yet more manure) on the insurgents below. Today&#39;s balconies, of course, are constructed for much more genteel purposes—and significantly less manure.\n      These balconies are actually no more than ornamentation in the form of a railing attached to a home&#39;s facade. There is absolutely no outside space—no usable decking,  nada—to put so much as a toe on. While some may argue faux balconies don’t provide any real use, you can&#39;t discount the eye-candy factor.\n From the outside, they give the illusion of a balcony while the not-so-faux railing made of anything from glass to wrought iron prevents you from falling out when you fling open a window. Think of faux balconies as flair for your exterior walls.\n    Yep, there is a difference between  faux and  false when it comes to balconies. A false balcony has a railing  and a teeny deck, usually around 4 to 6 inches deep. Because these outcroppings—also called “balconettes”—are contained and don&#39;t add any real square footage to a home, they can easily be installed on existing homes. And while the narrow deck can&#39;t support a pair of smooching royals, it&#39;s ideal for the likes of a fragrant herb garden to help bring a bit of the outdoors in.\n These touches of whimsy run from  $220 to over  $4,000, depending on if you want aluminum or wrought iron.\n    Perhaps the most popular type of false balcony is the Juliet. Shakespeare makes no mention of the young Capulet standing on a balcony when Romeo asks, “What light through yonder window breaks?” However, traditional stagings of the play always have Juliet swooning on this small perch.\n The Juliet moniker is generally trotted out to describe small, nonprotruding terraces, often consisting of a glazed door with a shallow railing outside it.\n    Another popular false balcony style derives its moniker from the french doors that open onto a small deck and whatever scenery lies below. A famous example can be seen in  Edouard Manet&#39;s “ The Balcony” painting on display at Paris&#39; Musée d&#39;Orsay.\n    What do the  pope and  Evita have in common? A penchant for addressing the public from true balconies. For you and me, this is a balcony designed with a spacious deck to accommodate lounge chairs for watching sunsets while sipping wine.\n As a true balcony usually extends from the second story of a building or higher, there&#39;s usually a sweet view involved, too, like the south lawn as seen from the White House&#39;s  Truman Balcony.\n These outdoor spaces are a fabulous way to blur a home&#39;s interior and exterior. And one off a master suite is considered a swank upgrade, according to  Remodeling Magazine.\n While prices vary wildly depending on material and size, an average low-key, 4-foot wood one will run you at least  $15 to $20 a square foot. Granted, it&#39;s hard to translate the charm of a balcony into cold cash, but in New York at least, the addition can  add thousands to an asking price.\n    Defined as a small floor between two main ones in a building, a mezzanine is also a type of balcony designed for the  inside of a home. This usually features a large deck or landing that extends out from a wall surrounded by a protective railing.\n What are essentially cozy loft areas serve also as popular places for home offices or nooks perfect for a small pullout guest couch. Groundbreaking designers   Charles and Ray Eames added one to their custom home in California.The rest of us have been catching up ever since.\n    While a loggia may look like a balcony at first glance, it&#39;s actually a distinct architectural feature. Traditionally not on the ground floor, thus giving an illusion of a balcony, a loggia is set apart by its roof and support structure. A balcony is suspended off a building and has no overhead covering, while a loggia is part of the building and shares the roof.", "posttime": "2020-11-16 00:20:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lingo,阳台", "title": "《学习Lingo：关于阳台你需要知道的一切》(2016)", "title_en": "Learning the Lingo: Everything You Need to Know About Balconies (2016)", "transed": 1, "url": "https://www.realtor.com/advice/buy/balconies-glossary-lingo/", "via": "", "real_tags": ["lingo", "阳台"]}, {"category": "", "categoryclass": "", "imagename": "075d2261299e6ca4e6c81e9f52b968f3.jpg", "infoid": 1035284, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "绿色氢气正在全球范围内兴起--其支持者表示，它可能会在脱碳方面发挥重要作用，但持怀疑态度的人质疑其安全性和实用性。\n在红海边的沙特阿拉伯沙漠边缘，一座名为Neom的未来主义城市即将建成。这座耗资5000亿美元(3800亿英镑)的城市--配有会飞的出租车和机器人家政服务--计划成为100万人的家园。什么样的能源产品既能为这座城市供电，又能销往世界？不是石油。相反，沙特阿拉伯寄希望于一种不同的燃料-绿色氢气。这种无碳燃料是通过使用可再生的电力将氢分子从氧分子中分离出来而从水中提炼出来的。\n今年夏天，美国大型天然气公司Air Products&Amp；Chemical宣布，作为Neom的一部分，该公司过去4年一直在沙特阿拉伯建设一座绿色氢气工厂。该电厂的电力来自遍布沙漠的风能和太阳能项目，发电量为40千兆瓦。它号称是世界上最大的绿色氢气项目--更多的沙特工厂正在筹划中。\n并不是只有沙特人认为绿色氢气是能源领域的下一件大事。虽然这种燃料在美国几乎没有受到关注，但在世界各地，一场绿色氢气热潮正在进行。许多公司、投资者、政府和环保人士认为，它是一种能源，可能有助于结束化石燃料的统治，减缓世界变暖的轨迹。\n总部设在纽约的非营利组织自然资源保护委员会(Natural Resources Defense Council)的能源分析师雷切尔·法赫里(Rachel Fakhry)说：“这是非常有前途的。”法赫里等专家表示，虽然风能和太阳能可以为家庭和电动汽车提供电力，但绿色氢气可能是混凝土和钢铁制造等高耗能行业的理想能源，也可能是更难通电的部分交通行业的理想能源。“经济的最后15%很难清理--航空、航运、制造业、长途卡车运输，”法赫里说。“绿色氢气可以做到这一点。”\n欧洲的经济背负着高昂的能源价格，严重依赖俄罗斯的天然气，它正在通过为电解厂和其他氢气基础设施的建设提供资金，来拥抱绿色氢气。德国将清洁能源刺激资金的最大份额分配给了绿色氢气。欧盟委员会(European Commission)在评论其氢气战略时表示：“对于一个完全脱碳的经济来说，这是一个缺失的部分。”\n几十年来，人们一直在吹捧氢作为燃料来源的潜力，但据怀疑者称，这项技术从未大规模投入使用--而且有充分的理由。他们认为，广泛采用绿色氢气技术面临着严重的障碍，最引人注目的是，氢燃料需要可再生能源才能实现绿色。这将需要大规模的可再生能源发电来为电解厂提供动力，这些电解厂将水分解为氢气和氧气。相比之下，目前最常见的制氢方法仍然是“天然气重整”，顾名思义，这需要以天然气的形式输入化石燃料，天然气与水蒸气反应产生氢气、一氧化碳和二氧化碳。因为传统的甲烷制氢过程中会排放二氧化碳，这对环境不友好；以这种方式生产的氢气被称为“灰氢”。\n而且，不管是哪种生产方法，如果没有管道，氢气也很难储存和运输。目前，在美国等一些地方，氢气比天然气等其他燃料贵得多。\n彭博新能源金融(Bloomberg New Energy Finance)驻英国分析师、绿色氢气怀疑论者迈克尔·利布里奇(Michael Liebreich)表示，尽管它有优势，但“它显示出同样令人印象深刻的劣势清单”。\nLiebreich在BloombergNEF最近的两篇文章中的第一篇中写道：“它在自然界中不存在，所以它需要能量来分离。”“它的储存需要压缩到大气压的700倍，制冷到-253C…。它每单位体积的能量是天然气…的四分之一。它可以使金属变脆，它可以通过最微小的泄漏逃脱，是的，它真的是爆炸性的。“。\n一些绿色氢气项目正在以艰难的方式认识到这一点。澳大利亚的一个能源财团最近获得了环境监管部门的批准，该财团计划将氢气从西澳大利亚州皮尔巴拉(Pilbara)附近的一个地点输送到新加坡。该计划涉及1600台大型风力涡轮机和30平方英里的太阳能电池板，以运营一座23千兆瓦的电解厂，以生产绿色氢气。但据ABC新闻报道，这个名为亚洲可再生能源中心(Asian Renewable Energy Hub)的设施在认识到液化氢气并将其运输到如此远的距离存在困难后，改变了策略。取而代之的是，该设施现在计划出口氨气，这是一种更稳定的气体。\nLiebreich写道，尽管存在这样的问题，绿色氢气仍然“像恶棍一样控制着技术乐观主义者的想象力”。\n伍德麦肯齐(Wood McKenzie)研究绿色氢气的能源分析师本·加拉格尔(Ben Gallagher)表示，这种燃料是如此之新，其未来仍不明朗。“没有人知道这里到底发生了什么，”他说。“在这一点上，这只是一种猜测。目前，很难将其视为新的石油。不过，它可能构成整体燃料组合的重要组成部分。“。\n但对于支持者来说，绿色氢气的前景太诱人了，不容忽视。如果用可再生能源制造，它是不含二氧化碳的。此外，使用可再生能源制造燃料可以帮助解决困扰风能和太阳能的间歇性问题，因此它本质上是一种高效的储存方式。当对可再生能源的需求较低时，在春季和秋季，多余的电力可以用来为分解氢和氧分子所需的电解提供动力。然后氢气就可以储存起来，或者沿着管道输送。\n纵观欧洲、中东和亚洲，越来越多的国家和公司正在拥抱这种燃料。美国之所以落后，是因为天然气等其他形式的能源目前要便宜得多，但有几个新项目正在进行中，包括犹他州的一座绿色氢气发电厂，它将取代两座老化的燃煤电厂，为南加州和内华达州发电，并供犹他州境内使用。\n在日本，一座新的绿色氢气工厂刚刚在福岛附近开业，这是世界上最大的氢气工厂之一。考虑到该工厂距离2011年核灾难现场很近，这是一个有意的象征性位置。它将被用来为燃料电池提供动力，无论是在车辆上还是在固定场所。\n随着欧洲加大脱碳力度，它也在投资绿色氢气。欧盟最近起草了一项大规模绿色氢气扩张战略，尽管该战略尚未正式实施。但在其清洁能源计划中，欧盟包括了新的绿色氢电解槽以及运输和储存技术的资金。在该计划中，欧盟预计将向这种燃料投资至多4700亿欧元(合5500亿美元/GB 4150亿美元)。欧盟委员会写道：“快速大规模部署清洁氢气是欧盟实现其气候雄心的关键。”\n中东地区拥有世界上最便宜的风能和太阳能，正准备成为绿色氢气的主要参与者。落基山研究所突破技术项目负责人托马斯·科赫·布兰克说：“沙特阿拉伯拥有低得离谱的可再生能源。”“太阳每天都很稳定地照耀着，风每晚都很稳定地吹着。”这是很难被击败的。“。\n彭博社(BloombergNEF)估计，要生产足够多的绿色氢气来满足世界四分之一的能源需求，需要的电力比目前世界所有来源产生的电力还要多，在生产和储存方面的投资将达到11万亿美元(8.3万亿GB)。这就是为什么目前关注的焦点是15%的经济，其能源需求不容易由风能和太阳能提供，如重型制造业、长途卡车运输以及货船和飞机的燃料。\n绿色氢气的能量密度是喷气燃料的三倍，使其成为一项很有前途的飞机零排放技术。但欧洲飞机制造商空中客车(Airbus)最近发布了一份声明，称需要克服重大问题，包括在飞机上安全储存氢气，机场缺乏氢气基础设施，以及成本。\n空中客车(Airbus)零排放飞机副总裁格伦·卢埃林(Glen Llewell Yn)表示：“为了让零排放飞行成为现实，具有成本竞争力的绿色氢气和跨行业合作将是强制性的。”他对此持乐观态度，认为氢动力飞机可能在2035年之前投入飞行。\n在地面上，绿色氢气也被确定为一些道路车辆的替代品。在英国，氢气火车、卡车和双层巴士正在获得吸引力。在加利福尼亚州，该州早在2009年就通过了低碳燃料标准，以推广电动汽车和氢气汽车。10月份，一群重型汽车和能源行业官员组成了西部各州氢联盟，以推动迅速部署氢燃料电池技术和基础设施，以取代柴油卡车、公交车、机车和飞机。\n西方国家氢联盟的执行董事Roxana Bekemohammadi说：“氢燃料电池将为这些重型、难以通电的行业的零排放机动性的未来提供动力。”他说：“这是不争的事实。这个新的联盟的存在是为了确保政府和产业界能够有效地合作，以加速这场革命的到来。“。\n甚至还有更小规模的氢气系统的计划，可以为个人家庭供电。在澳大利亚，新南威尔士大学(University Of New South Wales)与全球工程公司GHD合作，创造了一种名为Lavo的家用系统，它利用太阳能产生和储存绿色氢气，并在需要时将其转化为电力。\n落基山研究所(Rocky Mountain Institute)的布兰克表示，从日本、美国到欧盟，绿色氢气的发展都是“非常好的消息”。“绿色氢气很有潜力解决许多让人们夜不能寐的问题，因为气候变化问题似乎无法解决。”\n本文最初由耶鲁e360出版，经许可再版-点击此处阅读原文。这也是为什么这篇报道没有像《未来星球》报道通常那样对其碳排放量进行估算的原因。\n在Facebook上为我们点赞，或者在Twitter或Instagram上关注我们，就可以加入100万未来粉丝的行列。\n如果你喜欢这个故事，可以订阅每周一次的bbc.com专题时事通讯，名为“基本清单”(The Essential List)。精选BBC《未来》、《文化》、《职场生活》和《旅行》中的故事，每周五发送到你的收件箱。", "note_en": "Green hydrogen is taking off around the globe – its supporters say it could play an important role in decarbonisation, but sceptics question its safety and practicality.\n On the edge of the Saudi Arabian desert beside the Red Sea, a futuristic city called Neom is due to be built. The $500bn (£380bn) city – complete with flying taxis and robotic domestic help – is planned to become home to a million people. And what energy product will be used both to power this city and sell to the world? Not oil. Instead, Saudi Arabia is banking on a different fuel – green hydrogen. This carbon-free fuel made is from water by using renewably produced electricity to split hydrogen molecules from oxygen molecules.\n This summer, a large US gas company, Air Products &amp; Chemicals, announced that as part of Neom it has been building a green hydrogen plant in Saudi Arabia for the past four years. The plant is powered by four gigawatts of electricity from wind and solar projects that sprawl across the desert. It claims to be the world’s largest green hydrogen project – and more Saudi plants are on the drawing board.\n The Saudis aren’t alone in seeing green hydrogen as the next big thing in energy. While the fuel is barely on the radar in the United States, around the world a green hydrogen rush is underway, and many companies, investors, governments and environmentalists believe it is an energy source that could help end the reign of fossil fuels and slow the world’s warming trajectory.\n  “It is very promising,” says Rachel Fakhry, an energy analyst for the Natural Resources Defense Council, a non-profit organsiation based in New York. Experts like Fakhry say that while wind and solar energy can provide the electricity to power homes and electric cars, green hydrogen could be an ideal power source for energy-intensive industries like concrete and steel manufacturing, as well as parts of the transportation sector that are more difficult to electrify. “The last 15% of the economy is hard to clean up – aviation, shipping, manufacturing, long-distance trucking,” Fakhry says. “Green hydrogen can do that.”\n  Europe, which has an economy that is saddled with high energy prices and is heavily dependent on Russian natural gas, is embracing green hydrogen by providing funding for construction of electrolysis plants and other hydrogen infrastructure. Germany has allocated  the largest share of its clean energy stimulus funds to green hydrogen. “It is the missing part of the puzzle to a fully decarbonised economy,” the  European Commission commented on its hydrogen strategy.\n   Hydrogen’s potential as a fuel source has been touted for decades, but the technology has never gotten off the ground on a sizeable scale – and with good reason, according to sceptics. They argue that widespread adoption of green hydrogen technologies has faced serious obstacles, most notably that hydrogen fuels need renewable energy in order to be green. This will require a massive expansion of renewable generation to power the electrolysis plants that split water into hydrogen and oxygen. In contrast, at present  the most common way to produce hydrogen remains “natural gas reforming”, which as its name suggests requires a fossil-fuel input in the form of natural gas, which is reacted with steam to produce hydrogen, carbon monoxide and carbon dioxide. Because CO2 is emitted in this traditional manufacture of hydrogen from methane, it’s not climate friendly; hydrogen produced this way is known as “grey hydrogen”.\n  And, regardless of the method of production, hydrogen is also hard to store and transport without a pipeline. And right now in some places, such as the US, hydrogen is a lot more expensive than other fuels such as natural gas.\n  While it has advantages, says Michael Liebreich, a Bloomberg New Energy Finance analyst in the UK and a green hydrogen sceptic, “it displays an equally impressive list of disadvantages”.\n “It does not occur in nature so it requires energy to separate,” Liebreich writes in the first of a pair of  recent essays for BloombergNEF. “Its storage requires compression to 700 times atmospheric pressure, refrigeration to -253C… It carries one quarter the energy per unit volume of natural gas… It can embrittle metal, it escapes through the tiniest leaks and yes, it really is explosive.”\n Some green hydrogen projects are learning this the hard way. An energy consortium in Australia recently received environmental regulatory approval for a scheme to pipe hydrogen from a site near Pilbara in western Australia to Singapore. The scheme involved 1,600 large wind turbines and 30 square miles of solar panels to run a 23-gigawatt electrolysis factory to create its green hydrogen. But the facility, called the Asian Renewable Energy Hub, changed tack after  recognising the difficulties of liquidising hydrogen and transporting it over such long distances, ABC News reported. Instead, the facility now plans to export ammonia, a more stable gas, instead.\n In spite of problems such as these, Liebreich writes, green hydrogen still “holds a vice-like grip over the imaginations of techno-optimists”.\n Ben Gallagher, an energy analyst at Wood McKenzie who studies green hydrogen, says the fuel is so new that its future remains unclear. “No one has any true idea what is going on here,” he says. “It’s speculation at this point. Right now, it’s difficult to view this as the new oil. However, it could make up an important part of the overall fuel mix.”\n But for proponents, the prospect of green hydrogen is too tantalising to ignore. If manufactured with renewable energy, it’s CO2-free. Moreover, using renewable energy to create the fuel can help solve the problem of intermittency that plagues wind and solar power, and so it is essentially efficient storage. When demand for renewables is low, during the spring and fall, excess electricity could be used to power the electrolysis that is needed to split hydrogen and oxygen molecules. Then the hydrogen can be stored or sent down a pipeline.\n Across Europe, the Middle East and Asia, more countries and companies are embracing this fuel. The US lags behind because other forms of energy, such as natural gas, are currently much cheaper, but several new projects are getting underway, including a  green hydrogen power plant in Utah that will replace two aging coal-fired plants and produce electricity for southern California and Nevada, as well as for use within Utah.\n  In Japan, a new green hydrogen plant, one of the world’s largest, just opened near Fukishima – an intentionally symbolic location given the plant’s proximity to the site of the 2011 nuclear disaster. It will be used to power fuel cells, both in vehicles and at stationary sites.\n As Europe intensifies its decarbonisation drive, it, too, is investing in green hydrogen. The  European Union recently drafted a strategy for a large-scale green hydrogen expansion, though it hasn’t been officially adopted yet. But in its clean energy plan, in which it envisages investment of up to its €470bn ($550bn/£415bn) in the fuel, the EU is including funds for new green hydrogen electrolysers and transport and storage technology. “Large-scale deployment of clean hydrogen at a fast pace is key for the EU to achieve its high climate ambitions,”  the European Commission wrote.\n The Middle East, which has the world’s cheapest wind and solar power, is angling to be a major player in green hydrogen. “Saudi Arabia has ridiculously low-cost renewable power,” says Thomas Koch Blank, leader of the Rocky Mountain Institute’s Breakthrough Technology Program. “The sun is shining pretty reliably every day and the wind is blowing pretty reliably every night. It’s hard to beat.”\n BloombergNEF estimates that to generate enough green hydrogen to meet a quarter of the world’s energy needs would take more electricity than the world generates now from all sources, and an investment of $11tn (£8.3tn) in production and storage. That’s why the focus for now is on the 15% of the economy with energy needs not easily supplied by wind and solar power, such as heavy manufacturing, long-distance trucking, and fuel for cargo ships and aircraft.\n The energy density of green hydrogen is three times that of jet fuel, making it a promising zero-emissions technology for aircraft. But Airbus, the European airplane manufacturer, recently released a  statement saying that significant problems need to be overcome, including safely storing hydrogen on aircraft, the lack of a hydrogen infrastructure at airports, and cost.\n “Cost-competitive green hydrogen and cross-industry partnerships will be mandatory to bring zero-emission flying to reality,” says Glen Llewellyn, vice president of Zero Emission Aircraft for Airbus. He is optimistic that it can happen, believing that hydrogen-powered aircraft could be flying by 2035.\n  And on the ground, green hydrogen has also been identified as an alternative to some road vehicles.  In the UK, hydrogen trains,  trucks and  double-decker buses are gaining traction. While in California, the state passed a  Low Carbon Fuel Standard back in 2009 to promote electric vehicles and hydrogen vehicles. In October, a group of heavy-duty vehicle and energy industry officials formed the  Western States Hydrogen Alliance to press for rapid deployment of hydrogen fuel cell technology and infrastructure to replace diesel trucks, buses, locomotives, and aircraft.\n “Hydrogen fuel cells will power the future of zero-emission mobility in these heavy-duty, hard-to-electrify sectors,” says Roxana Bekemohammadi, executive director of the Western States Hydrogen Alliance. “That fact is indisputable. This new alliance exists to ensure government and industry can work efficiently together to accelerate the coming of this revolution.”\n There are even plans for smaller scale hydrogen systems that can power individual homes. In Australia, the University of New South Wales, in partnership with the global engineering firm GHD, has created  a home-based system called LAVO that uses solar energy to generate and store green hydrogen, which is converted back into electricity as needed.\n The developments in green hydrogen – from Japan, to the US, to the EU – are “really good news”, says Blank of the Rocky Mountain Institute. “Green hydrogen has high potential to address many of the things that keep people awake at night because the climate change problem seems unsolvable.”\n  This article was originally published by   Yale e360 , and is republished with permission – read the original story   here . This is also why this story does not have an estimate for its carbon emissions,   as Future Planet stories usually do .\n  Join one million Future fans by liking us on   Facebook , or follow us on   Twitter  or   Instagram .\n If you liked this story,   sign up for the weekly bbc.com features newsletter , called “The Essential List”. A handpicked selection of stories from BBC Future, Culture, Worklife, and Travel, delivered to your inbox every Friday.", "posttime": "2020-11-15 23:58:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "沙特阿拉伯,saudi,氢气", "title": "来自沙特阿拉伯的新燃料", "title_en": "The new fuel to come from Saudi Arabia", "transed": 1, "url": "https://www.bbc.com/future/article/20201112-the-green-hydrogen-revolution-in-renewable-energy", "via": "", "real_tags": ["沙特阿拉伯", "saudi", "氢气"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的使命是让世界各地的学生、业余爱好者和好奇的公众都能接触到计算机科学和数字电子产品。我们的第一个互动展览是2005年由英特尔博物馆委托举办的。\n你想怎么庆祝4004&50周年？把你的想法发送到点击放大：4004面具：英特尔提供，可视化：蒂姆·麦克纳尼，原理图捕获：弗雷德·休蒂希(EE Extradiaire)……他的教育(和开源)Arduino兼容的套装，让你可以在笔记本电脑上轻松地玩真正的复古微处理器。(编者注：英特尔提供的面具，可视化：Tim McNerney，Schematic Capture：Fred Huettig(EE Extradiaire))……他的教育(开源)系列与Arduino兼容，让你可以在笔记本电脑上轻松操作真正的复古微处理器。他最近发布了他迄今为止最雄心勃勃的盾牌--你猜到了--ZIF预装的4004反盾牌，配有电压电平移位器，这样-15伏的PMOS 4004就可以与5伏的CMOS Arduino通信。我特别喜欢Erturk&#39；的Busicom计算器的技术总结，其中包括对新树精机滚筒打印机工作原理的很好的解释。\n请查看Chen Steenvoorden在WebAssembly中实现的最新Busicom 141-PF打印计算器模拟器。最好的注意：141-PF是一台古董加法机，因此只有在按下像加号这样的操作按钮之后，您才能看到您在纸上输入的数字。例如：要将18和42相加，请键入1 8+4 2+=(第2+非常重要！)，然后才能看到您在纸上输入的数字。例如：要将18和42相加，请键入1 8+4 2+=(第2+非常重要！)。\n想见见我们启发的一群老式半导体工程师吗？参观视觉6502项目和邪恶疯狂科学家实验室。\n想知道更多关于芯片角落里签名的信息吗？读一读费德里科·法金(Federico Faggin)的观点，他是这款4004；的硅片设计师。\n2004年，我对一种新的SSI(小规模集成)逻辑门的封装方式--DSBGA(芯片大小球栅阵列)产生了浓厚的兴趣。多年来，我一直在等待看到没有包装的薯片，这是我见过的最接近的东西。一个DSBGA&34；封装只不过是一个裸露的芯片，焊盘上焊接了一个焊球网格，这样它就可以像任何其他表面贴装设备一样倒置并焊接到印刷电路板上。但我发现更令人振奋的是，现在有了一个完整的逻辑系列，每个封装只有一个门。现在，印刷电路可以像原理图一样布置出来，或者……。就像一个标准单元的超大规模集成电路芯片！而最终的结果，不是微观的，任何人都很容易看到并更好地欣赏。\n知道机器人拾取和放置机器现在是组装电子产品的标准方式，并使整个想法变得实用，我开始思考。我能从这种复古的每芯片一门技术中建立起什么呢？某种微处理器看起来像是天然的。但现代微处理器有数百万个晶体管，所以我知道我必须把这个项目保持在非常低的水平，比如将数据路径限制在4位。这意味着我必须自己设计，否则……。回到历史，建造一个商用微处理器的复制品。此外，复制商业微处理器，而不是重新发明我自己的微处理器，可以让我使用现有的软件和现有的手册、数据表、时代的智慧等等。\n第一个浮现在脑海中的微处理器是英特尔4004。它远没有8080及其8位子代那么出名，但我已故的继父乔·罗布(Joe Robb)在20世纪70年代初为英特尔工作，我仍然记得他带回家一些MCS-4数据表的情景。MCS-4(微电脑组4)是英特尔在1971年11月商业推出4004芯片家族时给它起的名字。\n所以问题已经解决了，但是如何得到原理图呢？乔(我这样称呼他)还带回了英特尔的其他好东西，其中包括一个单独封装的C3102寄存器堆芯片--无疑是一个工程样片。几十年后，也就是2000年，我对我手中的这件历史遗物非常好奇，于是我给英特尔档案馆写了一封信，令我吃惊的是，几周后，我收到了一个很大的信封，里面有一份数据表和其他有关英特尔早期的历史信息。\n在这次研究狂欢中，我还了解到英特尔档案馆和英特尔博物馆之间存在某种联系。这帮助我把想法变成了计划：我写信给英特尔博物馆馆长特蕾西·马祖尔(Tracey Mazur)和英特尔公司档案保管员雷切尔·斯图尔特(Rachel Stewart)，提出一个建议：如果你允许我访问4004内部工程文件，我将为你建造一个巨大的、功能正常的4004复制品，适合在博物馆展出。\n大约在同一时间，我开始寻找可以在巨型4004复制品上运行的复古软件。我写信给费德里科·法金(Federico Faggin)和马西安·霍夫(Marcian&34；Ted；Hoff)，他们是4004的四位共同发明者中的两位(我一直无法联系到其他发明者，即商业通信公司(Busicom)的岛正志(Masatoshi Shima)或英特尔(Intel)的斯坦·马佐(Stan Mazor))。Faggin和Hoff都回复了，Faggin提供了一般性的建议，Hoff提供了基于4004的视频游戏设计的软件，英特尔向潜在客户推销了这款软件。\n当时，我对获得原理图或用来制作最初4004晶圆的掩模艺术品并不乐观，因此我开始设计B计划。在看过采访后，我甚至开始怀疑是否有什么原理图可以找到，因为采访表明，4004还没有画出完整的逻辑图。在与费德里科·法金(Federico Faggin)和麻省理工学院(MIT)的汤姆·奈特(Tom Knight)商量后，我在心理上做好了准备，准备用老式的方法对4004；004；进行逆向工程。我用显微镜拍摄金属层，然后蚀刻掉顶层，露出多晶硅层，然后拍摄下来，然后用放大的显微照片仔细地转录每一个晶体管和导线。\n几周后，我从特蕾西·马祖尔那里得到消息，英特尔的法律部门将允许我们查阅4004份工程文件，瑞秋·斯图尔特提供了关于她的研究的令人鼓舞的消息。\n2005年7月下旬，我飞往加利福尼亚州，与费德里科·法金(Federico Faggin)和瑞秋·斯图尔特(Rachel Stewart)在英特尔档案馆会面。这次访问非常短暂，几乎取得了圆满成功。法金拿起Vullum(一种半透明塑料布)上的三张大型工程图纸，一个接一个地展开，在30秒内宣布：是的。这就是所有的了。瑞秋和我赞许地看着对方，法金补充道，看到这里了吗？图纸的绘制方式与芯片布局一样。\n就在我去硅谷之前，费德里科提醒我，他把Busicom 141-PF计算器的工程原型捐赠给了加州山景城的计算机历史博物馆(Computer History Museum)。除了已知现存的生产141-PFS的不到12个这样的事实外，这个特殊的遗迹的意义在于它有嵌入的ROM。如果我们能为与4004系列兼容的不同寻常的4001只读写存储器构建一个定制模式的只读存储器，这可能会让我们恢复原来的计算器软件。费德里科在他的房子里翻了个底朝天，借给我一些测试光盘，我可以用它们来开发我的ROM阅读器。\n一回到家，我就把原理图寄给了布莱恩和巴里·西尔弗曼，他们立即开始试图弄清楚4004的详细工作原理。为了帮助他们寻求理解，他们使用Dia(类似于Microsoft Visio的开源图表编辑器)输入了原理图，编写了一些脚本将Dia原理图翻译成可模拟的网表，并为自己建造了一个零传播延迟的晶体管级模拟器。最终的结果是4004运行一个非常短的测试程序并以4-10赫兹的时钟速度运行的精美动画模拟\n与此同时，我继续开发ROM阅读器，定期向Brian和Barry发送我的结果，看看我提取的二进制数据是否产生了有效的4004代码。在与4001只只读存储器使用的异常电压水平作了一番斗争之后，我们成功地从法金在地下室发现的只读存储器中提取了Busicom软件的一大部分。坏消息是，四分之三的计算器只读存储器中有很大一串零。我们将不得不寻找另一个来源。\n2005年感恩节期间，弗雷德·赫蒂格计划去加州看望他的哥哥。我和达格·斯派塞安排弗雷德参观计算机历史博物馆，提取他们的Busicom 141-PF计算器的数字内容。弗雷德带来了我的4001只读光盘阅读器，赛勒姆·伊斯梅尔小心翼翼地取出了光盘，其中包括罕见的包含平方根函数的第五只光盘，这让我们非常高兴。然后，他把每一个4001放入只读存储器，让弗雷德上传到他的笔记本电脑上。弗雷德还把线束追踪到了计算器键盘上。任务完成了，只有一次轻微伤亡，其中一张光盘上的针脚断了。\n弗雷德回到波士顿后，我立即将光盘内容寄给了布莱恩和巴里，他们使用了弗雷德的接线图，以及我从德国芯片收藏家克里斯蒂安·巴索(Christian Bassow)那里收到的印刷电路板照片。在一个月内，他们已经制作了4004的指令级模拟器以及模拟Busicom硬件，到2006年1月，他们已经完成了Busicom 141-PF打印计算器的完全工作模拟。\n与此同时，Fred正在使用一个商业CAD包进行自己的原理图捕获工作，并正在顺利地自动推导出4004的功能Verilog模型，以验证原理图的正确性。到2006年春天，弗雷德的模拟器正确地执行了Faggin允许我保留的原始4004诊断ROM中的最大份额。\n这大约是英特尔博物馆的项目资金获得批准的时候，实物展览的设计工作也开始认真进行。英特尔请来了他们的营销机构来设计展会的整体外观。经过短短几个月的幕后设计工作和每周的电话会议，才华横溢的设计团队将我粗略的草图变成了一个堪称博物馆的吸引人的展品。我与一位文案和英特尔博物馆密切合作，精心设计了展览的文字，解释了历史背景、4004的功能和计算器软件。\n博物馆展览的主要目的之一是让博物馆参观者欣赏引擎盖下的机械，以及4004和Busicom计算器的内部工作原理。为此，我指定了一个大型动画流程图，显示当您按下键盘上的按钮时微处理器通过计算器软件的路径。为了显示正在进行的计算，另一个显示屏显示了计算器的内部寄存器。\n设计完成后，英特尔聘请了一家展品制造公司来详细设计和建造展品的非技术部分。我们一起制作了一个逼真的芯片封装模型，以及连接芯片和外部世界的连接线。\n在展览建设的同时，我开始在幕后与Tracey交谈，看看我们是否可以让英特尔将4004原理图、掩模作品和MCS-4用户手册发布到公共领域。毕竟，如果历史技术的唯一价值是历史价值，那么把历史技术锁在保险库里有什么意义呢？在撰写本文时，英特尔已同意许可这些文档用于非商业用途。\n暂时不提供：Lajos Kintli的英特尔4004网表/布局分析器和带有完整MCS-4模板和原理图的动画逻辑模拟器(Zip，v2.0：2018年11月15日更新)。\nYouTube链接：Marcian&34；Ted Hoff、Federico Faggin和Tim McNerney的35周年演讲的完整视频，以及Q&amp；A环节如果您想了解我们的产品或服务的信息，您有兴趣做志愿者，或者您有一个有趣的建议，请联系我，Tim McNerney。\n是!。我们正在寻找电气工程师、计算机科学家和超大规模集成电路设计师来帮助我们分析Intel 4004硬件的内部工作原理，从晶体管级到Busicom 141-PF计算器软件到指令级，以及K-12教师、教授、作家、平面设计师、信息设计师和网络技术专家，帮助我们向学生、普通人和未来的历史学家记录、说明和解释这一历史悠久的微处理器系统的优雅之美。\n英特尔博物馆已经允许我们向其他博物馆和机构提供我们的展览技术，包括使用分立晶体管建造的全功能130x比例的4004复制品、博物馆耐用的键盘和滑动开关，以及视频显示电子产品。\n在接下来的几个月里，我们计划提供限量版Busicom 141-PF复制品，适合在你的家里或办公室展示，并使用老式4004系列芯片制造。这些英特尔芯片价格昂贵，供不应求，但如果有足够多的人对使用现代芯片、但仍运行原始Busicom软件的更实惠的复制品感兴趣，我们将很乐意满足您的要求。\n他们是弗雷德·休蒂格、布莱恩·西尔弗曼、巴里·西尔弗曼和我。赛勒姆·伊斯梅尔对费德里科·法金捐赠给计算机历史博物馆的考古文物进行了精细的手术。\n是。英特尔4004被广泛认为是世界上第一个微处理器。由于担心虚假诉讼，英特尔没有做出这样大胆的声明，但毫无疑问，4004是第一个进入商业市场的客户可编程微处理器。在1971年11月15日推出之前，你根本买不到类似的东西……[阅读更多信息]。\n4004是从1971年到1986年制造的，你知道为什么它使用了这么长时间吗？\n简短的回答是：因为它便宜、美观、可扩展，而且不需要胶水逻辑。[阅读更多]。\n我在eBay上看到了4004及相关芯片(4001、4002、4003、4008、4009、4040、4201、4289)出售。搜索P4004(P=塑料包装)、D4004(D=棕色陶瓷)和C4004(C=白色陶瓷)。白色陶瓷包装的售价为数百美元，但其他包装的价格更实惠。早期的灰白色陶瓷包装极为罕见。\n所有这些芯片都是静电敏感的。只有你(和卖家)小心处理芯片，就像升级你的电脑内存一样，你才能避免它被电击(这会使它无法工作或断断续续)。如果你的芯片是防静电泡沫(通常是黑色)，并包裹在铝箔或防静电塑料(通常是粉色)，那么它可能仍然有效，即使在35年后。现在，要确定它是否有效，唯一的办法就是建立一个使用你的4004的电子项目。\n克里斯蒂安·巴索(Christian Bassow)，一台Busicom 141-PF的所有者，他好心地给我寄来了印刷电路板的照片。\n软件(如模拟器)和工程文档(如原理图)按原样提供，不提供任何明示或暗示的保修。不能保证任何特定目的的适合性。作者对使用本信息不承担任何责任。\n本网站上的作品受知识共享署名-非商业性-同样共享3.0许可证的许可。", "note_en": "Our mission is to make computer science and digital electronics accessible to students, hobbyists, and the curious public around the world. Our first interactiveexhibit was commissioned by the Intel Museum in 2005.\n   How would you like to celebrate the 4004&#39;s 50th? Send your ideas to   Click to Enlarge:          4004 masks: courtesy of Intel, Visualization: Tim McNerney, Schematic capture: Fred Huettig (EE extraordinaire)     ...for his line of educational (and open-source)  Arduino-compatible &#34;Retroshield&#34; kits that let you play around with real, vintage microprocessors from the comfort of your laptop. He recently released his most ambitious shield yet—you guessed it—the ZIF socketed, preassembled  4004 Retroshield, complete with voltage level-shifters so the -15 volt PMOS 4004 can communicate with the 5 volt CMOS  Arduino.I particularly like Erturk&#39;s  Busicom calculator technical summary, which includes a nice explanation of  how the Shinshu Seiki drum printer works.\n  Check out Chen Steenvoorden&#39;s new  Busicom 141-PF Printing Calculator Simulator implemented in WebAssembly.Note best: The the 141-PF was a vintage adding machine, so you&#39;ll see the digits you typed on &#34;paper&#34;  only after you press an operator button like &#34;plus.&#34;For example: To add 18 and 42, type  1 8 + 4 2 + = (The 2nd + is  very important!)You can read the original  (Busicom clone) Operating Instructions at the  Internet Archive.\n    Want to meet a community of vintage semiconductor engineers we inspired?  Visit the Visual 6502 Project and  Evil Mad Scientist Laboratories\n Want to know more about the &#34;F.F.&#34; signature in the corner of the chip?  Read the perspective of Federico Faggin, the 4004&#39;s silicon designer.\n       In 2004 I became intrigued by a new kind of packaging for SSI (Small Scale Integration) logic gates, the DSBGA (Die Size Ball Grid Array). I had been waiting for years to see chips without packages, and this was the closest thing I had ever seen. A DSBGA &#34;package&#34; is nothing more than a &#34;bare die&#34; with a grid of solder balls welded to the pads so it can be flipped upside down and soldered to a printed circuit board like any other surface-mount device. But what I found more inspiring was that an entire logic family was now available with one gate per package. Now a printed circuit could be laid out just like the schematic or... just like a &#34;standard cell&#34; VLSI chip! And the end result, not being microscopic, would be easy for anyone to see and better appreciate.\n  Knowing that robotic &#34;pick-and-place&#34; machines were now the standard way of assembling electronics, and made the whole idea practical to produce, I started thinking. What could I build out of this &#34;retro,&#34; one-gate-per-chip technology? Some sort of microprocessor seemed like a natural. But modern microprocessors have millions of transistors, so I knew I&#39;d have to keep the project very modest, like restricting the data-path to 4-bits. This meant I&#39;d have to design my own, or... go back in history and build a replica of a commercial micrprocessor. Besides, reproducing a commercial microprocessor, rather than re-inventing my own, would allow me to use existing software and existing manuals, data sheets, wisdom of the ages, etc.\n The first microprocessor that came to mind was the Intel 4004. It was not nearly as famous as the 8080, and its 8-bit progeny, but my late step-father, Joe Robb, worked for Intel in the early 1970&#39;s, and I still remember when brought home some MCS-4 data sheets. MCS-4 (Microcomputer Set 4) was the name Intel gave to the 4004 chip family for its commercial introduction in November 1971.\n  So that was settled, but how to get the schematics? Joe, as I called him, had also brought home other goodies from Intel, among them an individually packaged C3102 register file chip--undoubtedly an engineering sample. Decades later, in 2000, I was curious enough about this historical relic I had in my possession, that I wrote a letter to the Intel Archives, and much to my surprise, received a big envelope in the mail a few weeks later with a data sheet and other historical information about Intel&#39;s early days.\n During this research spree I also learned that the Intel Archives and the Intel Museum were somehow connected. This helped me turn a notion into a plan: I wrote to Tracey Mazur, the curator of the Intel Museum, and Rachel Stewart, Intel&#39;s corporate archivist, with a proposition: if you give me access to internal 4004 engineering documents, I will build you a giant, functioning replica of the 4004 suitable for a museum exhibit.\n Around the same time I started looking for vintage software to run on the giant 4004 replica. I wrote to Federico Faggin and to Marcian &#34;Ted&#34; Hoff, two of the four co-inventors of the 4004 (I was never able to contact the other inventors, Busicom&#39;s Masatoshi Shima or Intel&#39;s Stan Mazor). Both Faggin and Hoff wrote back, Faggin with a general offer of advice, and Hoff with software for a 4004-based video game design that Intel pitched to a potential customer.\n At this time, I was not optimistic about gaining access to schematics or the mask artwork that was used to create the original 4004 wafers, and so I began devising a &#34;Plan B.&#34; I was even starting to wonder if there were any schematics to be found, having read interviews that suggested that no complete logic diagram was ever drawn of the 4004. In consultation with Federico Faggin and MIT&#39;s Tom Knight, I mentally prepared myself for reverse-engineering the 4004 &#34;the old-fashioned way,&#34; by photographing the metal layer through a microscope, and then etching that top layer away to reveal the polysilicon layer, photographing that, and using enlargements of these photomicrographs to meticulously transcribe every transistor and wire.\n A few weeks later I got word from Tracey Mazur that Intel&#39;s legal department would allow us access to the 4004 engineering documents, and Rachel Stewart was offering encouraging news about her research.\n In late July of 2005 I flew to California to meet with Federico Faggin and Rachel Stewart at the Intel archives. The visit was amazingly brief and nearly a complete success. Faggin picked up three large engineering drawings on vullum, a translucent plastic sheeting, unrolled them one-by-one, and declared within 30 seconds, &#34;Yes. This is all of them.&#34; Rachel and I looked at each other approvingly, as Faggin adds, &#34;See here? The drawings are drawn just like the chip layout.&#34;\n   Just before my trip to Silicon Valley, Federico alerted me to the existence of an engineering prototype of the Busicom 141-PF calculator that he donated to the Computer History Museum in Mountain View, California. Besides the fact that there are fewer than a dozen production 141-PFs known to still be in existence, the significance of this particular relic was that it has socketed ROMs. This might allow us to recover the original calculator software, if we could construct a custom-mode ROM reader for the unusual 4001 ROMs compatible with the 4004 family. Federico was able to dig through his house and lend me some test ROMs that I could use to develop my ROM Reader.\n  Once back home, I sent the schematics to Brian and Barry Silverman, who immediately started trying to figure out how the 4004 worked in detail. To aid in their quest for understanding, they entered the schematics using Dia, an open-source diagram editor similar to Microsoft Visio, wrote some scripts to translate the Dia schematics into a simulatable netlist, and built themselves a &#34;zero propagation delay&#34; transistor-level simulator. The end result was a beautifully animated simulation of the 4004 running a very short test program running at a clock speed of maybe 4-10Hz\n  Meanwhile I continued to develop the ROM reader, periodically sending Brian and Barry my results to see if the binary data I was extracting yielded valid 4004 code. After some struggles with the unusual voltage levels used by the 4001 ROMs, we succeeded in extracting a significant fraction of the Busicom software from the ROMs Faggin had found in his basement. The bad news was that there were large strings of zeros in three out of four of the calculator ROMs. We would have to find another source.\n  Over Thanksgiving 2005, Fred Huettig had plans to see his brother in California. I made arrangements with Dag Spicer for Fred to visit the Computer History Museum to extract the digital contents of their Busicom 141-PF calculator. Fred brought with him my 4001 ROM Reader and Sellam Ismail carefully removed the ROMs, including, much to our delight, the rare 5th ROM containing the Square Root function. He then placed each 4001 in the ROM Reader for Fred to upload to his laptop. Fred also traced the wiring harness to the calculator keyboard. Mission accomplished with only a minor casualty, a broken pin on one of the ROMs.\n After Fred returned to Boston, I immediately sent the ROM contents to Brian and Barry, who used Fred&#39;s wiring diagram along with printed circuit board photographs I received from Christian Bassow, a German chip collector. Within a month, they had crafted an instruction-level simulator of the 4004 as well as simulated Busicom hardware, and by January 2006, they had a completely working simulation of the Busicom 141-PF printing calculator.\n  In parallel, Fred was working on his own schematic capture using a commercial CAD package, and was well on his way to automatically deriving a functional Verilog model of the 4004 to verify that the schematics were correct. By spring of 2006, Fred&#39;s simulator was correctly executing the lion&#39;s share of the original 4004 diagnostics ROM Faggin allowed me to keep.\n  This is around the time that the project funding from the Intel Museum was approved, and work began in earnest to design the physical exhibit. Intel brought in their marketing agency to design the overall look of the exhibit. After only a few months of behind-the-scenes design work and weekly conference calls, the talented design team turned my back-of-the-envelope sketches into an attractive exhibit worthy of a museum. I worked closely with a copywriter and the Intel Museum to wordcraft the exhibit&#39;s text to explain the historical context, the function of the 4004, and the calculator software.\n  One of my main goals for the museum exhibit was to allow museum visitors to gain an appreciation for the &#34;machinery under the hood,&#34; the inner workings of the 4004 and the Busicom calculator. To this end, I specified a large, animated flowchart that shows the path that the microprocessor takes through the calculator software when you press a button on the keyboard. To show the calculations in-progress, another display shows the calculator&#39;s internal registers.\n  Once the design was completed Intel brought in an exhibit fabrication firm to detail the design and construct the non-technology parts of the exhibit. Together we fashioned a realistic scale model of the chip&#39;s package and the bond wires that connect chips to the &#34;outside world.&#34;\n  Concurrently with the exhibit contruction, I started having conversations with Tracey behind the scenes to see if we could get Intel to release the 4004 schematics, mask works, and MCS-4 Users Manual into the public domain. After all, what is the point of keeping historic technology locked up in a vault once its only value is historical? At this writing, Intel has agreed to license these documents for non-commercial use.\n      Temporarily unavailable: Lajos Kintli&#39;s Intel 4004 netlist/layout analyzer and animated logic simulator with complete MCS-4 masks and schematics (Zip,  v2.0: updated 11/15/2018)\n    YouTube Link:  Complete video of 35th anniversary talks by Marcian &#34;Ted&#34; Hoff, Federico Faggin, and Tim McNerney, with Q&amp;A session       If you want information about our  products or services, you are interested in  volunteering, or you have an interesting  suggestion, contact me, Tim McNerney at\n      Yes! We are looking for  electrical engineers,  computer scientists, and  VLSI designers to help us analyze the inner workings of the Intel 4004 hardware down to the transistor level and the Busicom 141-PF calculator software down to the instruction level, and  K-12 teachers,  professors,  writers,  graphic designers,  information designers, and  web technologists to document, illustrate, and explain the elegant beauty of this historic microprocessor system to students, lay people, and future historians.\n      The Intel Museum has given us permission to offer our  exhibit technology to other museums and institutions, including fully functional 130x scale replicas of the 4004 built using discrete transistors, museum-durable keyboards and slide switches, and video display electronics.\n  Within the next few months we plan to offer  limited edition, &#34;glass printer&#34;  Busicom 141-PF replicas suitable for displaying in your home or office, and built using vintage 4004-family chips. These Intel chips are expensive and in short supply, but if there is sufficient interest in more affordable replicas built using modern chips yet still running the original Busicom software, we would be happy to oblige.\n       They were Fred Huettig, Brian Silverman, Barry Silverman, and myself. Sellam Ismail performed the delicate surgery on the archeological artifact that  Federico Faggin donated to the  Computer History Museum\n      Yes. The Intel 4004 is widely considered to be the world&#39;s first microprocessor. Wary of spurious lawsuits, Intel makes no such bold claims, but there is no doubt that the 4004 was the first  customer-programmable microprocessor to reach the commercial market. You simply could not buy anything like it before its introduction on November 15, 1971...[ Read More]\n    The 4004 was manufactured from 1971 to 1986, any idea why it lasted so long?\n  Short answer: Because it was cheap, elegant, scalable, and required no &#34;glue logic&#34;...  [Read more]\n      I have seen 4004s and related chips (4001, 4002, 4003, 4008, 4009, 4040, 4201, 4289) for sale on  eBay. Search for P4004 (P = plastic package), D4004 (D = brown ceramic), and C4004 (C = white ceramic). The white ceramic packages sell for hundreds of dollars, but the other packages are more affordable. The early grey-on-white ceramic packages are extremely rare.\n      All these chips are  static sensitive. Only if you (and the seller) handle the chip carefully, just like a memory upgrade to your computer, can you avoid &#34;zapping&#34; it (which would render it inoperative or intermittent). If your chip arrived in anti-static foam (usually black) and wrapped in aluminum foil or anti-static plastic (usually pink), then it may still work, even after 35 years. Right now, the only way to find out if it works for sure is to build an electronics project that uses your 4004.\n                           Christian Bassow, owner of a Busicom 141-PF, who kindly sent me photographs of the PCB.\n       The software (e.g. simulator) and engineering documents (e.g. schematics) are provided &#34;AS IS&#34; with no warranty expressed or implied. Fitness for any particular purpose is not guaranteed. The authors do not accept any liability for use of this information.\n  The works on this web site are licensed under a  Creative Commons Attribution-Noncommercial-Share Alike 3.0 License.", "posttime": "2020-11-15 23:40:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,庆祝,celebrate", "title": "庆祝英特尔4004微处理器今天49岁生日", "title_en": "Celebrate Intel's 4004 Microprocessor Turning 49 Today", "transed": 1, "url": "https://4004.com/", "via": "", "real_tags": ["英特尔", "庆祝", "celebrate"]}, {"category": "", "categoryclass": "", "imagename": "17a514bafc9fd43c9feb496a61bcbf9e.jpg", "infoid": 1035281, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX和NASA多年来一直在为今天的Crew-1任务工作，该任务将于美国东部时间晚上7点27分(太平洋标准时间下午4点27分)从佛罗里达州发射。这是SpaceX公司的“龙”太空舱和猎鹰9号火箭首次正式作为航天器被美国国家航空航天局(NASA)认证用于载人飞行的常规宇航员运送操作。美国国家航空航天局(NASA)宇航员迈克·霍普金斯(Mike Hopkins)、维克多·格洛弗(Victor Goverer)和香农·沃克(Shannon Walker)以及日本宇宙航空研究开发机构(JAXA)的宇航员野口宗一(Soichi Noguchi)也将乘坐龙飞船，除非天气延误，否则他们将于周日晚间前往国际空间站。\nSpaceX已经搭载了龙-NASA宇航员Bob Behnken和Doug Hurley在今年早些时候参加SpaceX的Demo-2任务时，有幸成为第一批乘坐商业航天器发射到国际空间站的人类。这显然是一个历史性的成就，但从技术上讲，这也是SpaceX的龙和猎鹰9号测试和演示计划的最后一个阶段，而今天的Crew-1发射不再符合测试的条件。这样想吧：如果Demo-2类似于莱特兄弟的小鹰(Kitty Hawk)飞行，那么Crew-1将相当于1914年美国第一架定期商业航空公司的航班。\nCrew-1将是第一次有完整的宇航员乘坐龙飞船(总共有6个座位，但NASA表示，在这些飞行中，它只会运送最多4名其及其合作机构的机组人员前往国际空间站)。宇航员将加入国际空间站现有的工作人员，定期执行实验、维护和升级空间站，这也将看到国际空间站的活跃人员在标准轮换期间首次增加一名宇航员，这意味着根据该机构的说法，这意味着可以完成更多的科学工作。\n发射系统被设计成以完全自动化的方式工作，这意味着从发射到与国际空间站对接的过程中，它不需要机上机组人员采取任何行动。返程也是如此，返程将在明年6月左右进行。\nSpaceX还将尝试利用其在大西洋的自动无人机登陆舰回收此次发射中使用的第一级助推器。\n一切都应该在接近发射目标时间开始，但NASA也将通过上面的直播全天安排与Crew-1任务、龙计划以及更多内容相关的程序。", "note_en": "SpaceX and NASA have spent years working towards today’s Crew-1 mission, which is set to launch from Florida at 7:27 PM EST (4:27 PM PST). This is the first time that SpaceX’s Dragon capsule and Falcon 9 rocket will be officially used as a spacecraft certified by NASA for human flight on a regular astronaut transportation operation. NASA astronauts Mike Hopkins, Victor Glover and Shannon Walker, along with JAXA astronaut Soichi Noguchi, will also be aboard the Dragon spacecraft and, barring any weather delays, on their way to the International Space Station later Sunday night.\n SpaceX has already flown people using Dragon – NASA astronauts Bob Behnken and Doug Hurley had the honor of being the first humans ever to be launched to the ISS aboard a commercial spacecraft when they took part in SpaceX’s Demo-2 mission earlier this year. That was obviously a historic achievement, but it was also technically the last stage in SpaceX’s test and demonstration program for Dragon and Falcon 9, whereas today’s Crew-1 launch no longer qualifies as a test. Think of it this way: If Demo-2 was akin to the Wright Brothers’ Kitty Hawk flight, Crew-1 will be the equivalent of the first U.S. scheduled commercial airline flight in 1914.\n  Crew-1 will be the first time that a full complement of astronauts are flown on Dragon (there are six total seats but NASA has said it will only ever fly a max of four of its and partner agency crew to the ISS on these flights). The astronauts will join the existing crew on the ISS for a regular tour of performing experiments, maintaining and upgrading the station, which will also see the active ISS population swell by one additional astronaut for the first time during a standard rotation, which means more science can get done according to the agency.\n The launch system is designed to work in a completely automated way, which means that it requires no action on the part of the crew on board from launch all the way through its docking with the ISS. That’s also true of the return trip, which will take place sometime around next June.\n SpaceX will also be attempting a recovery of the first stage booster used during this launch, using its autonomous drone landing ship in the Atlantic Ocean.\n Everything should get started closer to the liftoff target time, but NASA will also have programming all day related to the Crew-1 mission, the Dragon program and much more via the livestream above.", "posttime": "2020-11-15 23:18:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,宇航员,spacex", "title": "\n现场观看SpaceX发射其历史性的第一次NASA宇航员任务", "title_en": "\n\t\t\t\tWatch SpaceX launch its historic first NASA astronaut crew mission live\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/15/watch-spacex-launch-its-historic-first-nasa-astronaut-crew-mission-live/", "via": "", "real_tags": ["nasa", "宇航员", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035280, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天是SourceHut在其阿尔法开发阶段向公众开放的两周年纪念日，也是其开发的第四个年头。这是多么美好的一年啊！如果我能给写去年那篇文章的年轻的我一个警告就好了。在两周年纪念日来临之际，尽管我们今年经历了种种考验，我还是对我们取得的成就感到乐观。\n一年前，我写道，我预计SourceHut将在2020年进入测试期，但我错了。然而，在我们开始测试版之前，我们确实有一个定义明确的、有限的行动项目列表需要完成。今年我们实现了许多重要发展里程碑，2021年我们将把樱桃放在首位。\n本月的Mumble公开会议将于世界协调时(UTC)明天(16日)17点在voice.mnus.de上的Sourcehut房间举行，端口为64738。请加入我们一起庆祝我们的第二个年头，并提出任何问题或提供任何反馈，您可能会有关于Sourcehut的。\n让我们花点时间庆祝2020年取得的成就，规划2021年的规划。\n还有，在全新的项目中心有2000个项目！你可以在这里浏览723个公共项目。今年开始使用SourceHut的一些值得注意的项目包括：\n在“让自由/开源软件变得更好”的开放式指令下，我们的工程师为Wayland、Mesa、Vulkan、Go、Linux内核、IRCv3、Gemini等做出了贡献。我们的FOSS咨询部门已经在Mesa、Xorg等网站上生产了100%的免费软件产品，并为Valve Software和Migadu等客户建立了全新的FOSS网络邮件。\n那么，今年我将继续做同样不幸的预测：Beta将在2021年的某个时候开始。我去年提到的拦路虎之一--用户组/组织--仍然没有完成，但最主要的拦路虎是API 2.0的完成。我还在我们所有的bug追踪器上添加了“beta”标签，如果你想详细了解哪些功能和bug被认为是拦截器的话。\n去年的帖子中列出的业务和运营目标已经实现。唯一与业务相关的障碍是，当测试版开始时，长期承诺的价格变化将如何形成，这将受到最终用户群的严重影响。当然，社会人士会参与讨论的每一个环节。而且，我会一如既往地重申，我们的计划不是让用户放弃这项服务--那些无力支付的用户将一如既往地获得免费服务。\nAPI2.0的努力对测试版尤为重要。它们的完成将是必要的，以建立一个API，我们有信心在未来的许多年里支持这个API，并使我们能够将服务和他们对彼此的认识扩展到任何我们想要的程度。随着API 2.0的完成，我们的服务的性能、可伸缩性和可靠性也有望大幅提高。\n我们在数据所有权方面也取得了实质性进展--您现在可以在Sourcehut上导出和导入几乎所有的数据，其中大部分是标准格式的数据--但我们也希望通过实施自助帐户删除和重命名以及一次下载所有数据的统一解决方案来扩展这一点。\n我们在地平线上还有很多工作要做，但我们已经有了一个周密的计划--终点线和测试版的开始。一旦测试版开始，我们将专注于改进我们的模型，清除错误，提高我们已经是同类中最好的性能和可靠性，并建立足够的信心，宣布它已经准备好投入生产。\nSourceHut对生产准备情况的标准比大多数软件都高得多。许多用户已经将SourceHut作为其下一个生产准备项目的首选平台，我们已经做出了许多人认为必要的稳定性和安全性保证。但在我们远远超出行业标准之前，我们不会宣布我们的系统生产准备就绪--我们想要最好的性能、最好的可靠性，我们希望给其他所有人留下很大的差距，让他们迎头赶上。只有当我们遥遥领先并准备好在未来几十年支持我们的所有功能和用户时，我们才会宣布它已经投入生产。当SourceHut准备成为自由软件的基石时，它将准备好“生产准备”，而不是在此之前。\n现在，对于您定期安排的状态更新，我将保持简短。大部分工作都是在幕后进行的，也就是API2.0。", "note_en": "Today is the second anniversary of  SourceHut being made available to thegeneral public during its alpha phase of development, andthe end of the fourth year of development. What a year it’s been! If only Icould send a warning to the younger me who wrote  last year’s article.As the second anniversary comes around, despite the trials we’ve endured thisyear, I feel positive about our accomplishments.\n One year ago, I wrote that I expected SourceHut to enter its beta phase in 2020,and I was wrong. However, we do have a well-defined, finite list of action itemsto be completed before we can kick off the beta. We hit a lot of importantdevelopment milestones this year, and we’ll put the cherry on top in 2021.\n This month’s public Mumble conference will take place tomorrow (the 16th) at17:00 UTC, in the sourcehut room on voice.mnus.de, port 64738. Please join us tocelebrate our second year, and ask any questions or provide any feedback thatyou might have about sourcehut.\n Let’s take a moment celebrate our accomplishments in 2020, and lay out our plansfor 2021.\n      And, 2,000 projects on the brand-new project hub! You can browse  the 723 publicprojects right here. Some notable projects whichstarted using SourceHut this year include:\n    And our engineers, under the open-ended directive of “make FOSS better”, havecontributed to Wayland, Mesa, Vulkan, Go, the Linux kernel, IRCv3, Gemini, and more. Our  FOSS consultingarm has produced 100% free-software outputin Mesa, Xorg, and more, and built a brand-new FOSS webmail, for clients like Valve Software andMigadu.\n      Well, I’ll go ahead and make the same ill-fated prediction this year: the betawill begin sometime in 2021. One of the blockers I mentioned last year stillremains to be completed — user groups/organizations — but the mainblocker is the completion of  API 2.0. I’vealso added “beta” labels to all of our  bug trackers, if you want toexplore the fine details of what features and bugs are considered blockers.\n The business and operational goals laid out in last year’s post have been met.The only business-related blocker is determining how the long-promised pricingchanges will take shape when the beta begins, which will be heavily influencedby the ultimate implementation of user groups. Of course, the community will beinvolved in every part of this discussion. And, as always, I’ll re-iterate thatthe plan is not to price users out of the service — those who are unableto afford payments, as always, will be issued free service.\n The API 2.0 efforts are of particular importance for the beta. Their completionwill be necessary to establish an API that we can be confident in supporting formany years into the future, and enable us to expand the services and theirawareness of one another to any degree we please. The performance, scalability,and reliability of our services is also expected to increase substantially withthe completion of API 2.0.\n We also made substantial progress on data ownership — you can now exportand import almost all of your data on sourcehut, much of it in standard formats— but we also want to expand on this by implementing self-service accountdeletion and renames, and a unified solution for downloading all of your data atonce.\n   We still have a lot of work on the horizon, but we have a well-laid plan towardsthe finish line and the start of the beta phase. Once the beta begins, we’llfocus on refining our model, flushing out bugs, improving our already best-in-class performance and reliability, andestablishing enough confidence in the system to declare it production ready.\n SourceHut has much higher standards for production readiness than most software.Many users are already enjoying SourceHut as the platform of choice for theirown production-ready projects, and we already make stability and securityguarantees which many would consider necessary as such. But we’re not going todeclare our system production ready until we’ve well exceeded the standards ofthe industry — we want  the best performance,  the best reliability, andwe want to leave a wide margin for everyone else to catch up. We’re only goingto declare it production ready when we’re far ahead of the pack and prepared tosupport all of our features and users for decades to come. SourceHut will be“production ready” when it’s prepared to become the bedrock of free software,and not before.\n  Now, for your regularly scheduled status update, I’ll keep it brief. Most of thework has been behind the scenes, on API 2.0.", "posttime": "2020-11-15 23:13:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sourcehut,year", "title": "Sourcehut在Alpha的第二年", "title_en": "Sourcehut's Second Year in Alpha", "transed": 1, "url": "https://sourcehut.org/blog/2020-11-15-sourcehut-2-year-alpha/", "via": "", "real_tags": ["sourcehut", "year"]}, {"category": "", "categoryclass": "", "imagename": "af8d143b50719ecaa9a259d96854a965.png", "infoid": 1035279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，苹果在一次巧妙的营销活动中向世界发布了他们新的基于ARM的“Apple Silicon”机器，我们中的许多人都掏出了信用卡。与此同时，数值算法小组宣布，他们已经将他们的Fortran编译器移植到了新的平台上。在撰写本文时，这是Apple Silicon唯一公开可用的Fortran编译器，不过随着开源Fortran编译器的更新，这种情况很可能很快就会改变。\n在您的Mac上安装Fortran！@NAGTalk在@Apple活动之前发布了第一个用于Apple Silicon Mac的Fortran编译器#OneMoreThing-了解更多https://t.co/pcCuTs2vET#AppleEvent#Apple#Apple#AppleSiliconMac#Fortran#编译器#sc20@arm pic.twitter.com/d03WsGVrUN。\nFortran已有60多年的历史，是目前仍在积极开发和使用的最古老的编程语言之一(最新的语言规范是Fortran 2018)。Fortran经常被软件工程师嘲笑为老生常谈(包括十多年前建议不应该教给本科生的我)，Fortran是每个人在星巴克(Starbucks)喝着纯白咖啡，在闪亮的Macbook Air上不停地玩MATLAB、R或Python时被忽视的语言。\n因此，当你发现我们最喜欢的许多数据科学工具根本不能在没有Fortran编译器的任何系统上本机运行时，可能会非常震惊！\n我们今天经常使用的许多数字功能是几十年前开发的，并在Fortran中发布。更现代的系统(如R)直接利用了大量这类代码，因为它具有很高的性能，或许更重要的是，它已经在生产中经过了数十年的战斗测试。数值计算很难(即使你所有的直觉都表明不是这样)，当有人明显做得对的时候，重用而不是重新发明是很有意义的。\n巨蟒用户也无法幸免。以下是截至今天Scipy的GitHub统计数据。\n当然，没有Scipy意味着你也不能拥有任何依赖Scipy的东西，包括Kera或Scikit-Learn。此外，如果你想要良好的线性代数运算的性能(这是大量数据科学和ML算法的基础)，那么你需要一个好的BLAS实现。很多项目都使用OpenBLAS(例如，这是在Numpy中很受欢迎的选项)，…。你猜对了，…。几乎是49%的Fortran。\nNAG的Fortran编译器非常优秀(例如，它在检查和Fortran标准合规性方面经常位居独立排行榜榜首)，但它是商业的。如果数据科学家想要实现苹果新硬件的全部潜力，社区需要并将要求开源(或至少是免费)Fortran编译器，我毫不怀疑这些都在发展中。其他主要的芯片提供商(例如Intel、AMD、NEC和NVIDIA/PGI)都有自己的Fortran编译器，与之共存\n在这个问题得到解决之前，我们中的大多数人将依赖于Rosetta2仿真…。谢天谢地，这显然是相当不错的！", "note_en": "Earlier this week Apple announced their new, Arm-based ‘Apple Silicon’ machines to the world in  a slick marketing event that had many of us reaching for our credit cards. Simultaneously,  The Numerical Algorithms Group announced that they had ported their Fortran Compiler to the new platform. At the time of writing this is the only Fortran compiler publicly available for Apple Silicon although that will likely change soon as open source Fortran compilers get updated.\n Fortran on your Mac!  @NAGTalk announce the first Fortran Compiler for Apple Silicon Macs ahead of  @Apple event  #OneMoreThing – learn more  https://t.co/pcCuTs2vET  #AppleEvent  #Apple  #AppleSiliconMacs  #Fortran  #Compiler  #SC20  @Arm  pic.twitter.com/d03WsGVrUN\n   At over 60 years old,  Fortran is one of the oldest programming languages that continues to be actively developed and used (The latest language specification is Fortran 2018). Routinely mocked by software engineers as old-skool (including me who,  over a decade ago, suggested that it shouldn’t be taught to undergraduates), Fortran is the language that everyone overlooks as they spend their days sipping flat-whites in Starbucks while hacking away in MATLAB, R or Python on shiny Macbook Airs.\n It can come as quite a shock, therefore, to discover that much of our favourite data science tools simply cannot work natively on any system that doesn’t have a Fortran compiler!\n  Much of the numerical functionality we routinely use today was developed decades ago and released in Fortran. More modern systems, such as R, make direct use of a lot of this code because it is highly performant and, perhaps more importantly, has been battle tested in production for decades.  Numerical computing is hard ( even when all of your instincts suggest otherwise) and when someone demonstrably does it right, it makes good sense to reuse rather than reinvent.\n   The Python crowd don’t get away with it either.  Here are the  GitHub stats for Scipy as of today\n  Of course, no Scipy means you also can’t have anything that  depends on Scipy including things like Keras or Scikit-learn.  Also, if you want good performance for linear algebra operations (Which underpins a huge number of data science and ML algorithms) then you’ll need a good  BLAS implementation.  Many projects use  OpenBLAS (It’s a popular option in Numpy for example) which…you guessed it…is almost 49% Fortran.\n  NAG’s Fortran compiler is excellent (it  routinely tops independent charts for its checking and Fortran standards compliance for example) but it is commercial.   The community needs and will demand open source (or at least free) Fortran compilers if data scientists are ever going to realise the full potential of Apple’s new hardware and I have no doubt that these are on the way.  Other major silicon providers (e.g. Intel, AMD, NEC and NVIDIA/PGI) have their own Fortran compiler that co-exist with the open ones.  Perhaps Apple should join the club (I suggest they talk to NAG!).\n Until this is resolved, most of us will be relying on the Rosetta2 emulation…which, thankfully,  is apparently pretty good!", "posttime": "2020-11-15 22:54:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,编译,apple,silicon,fortran", "title": "为什么Apple Silicon需要开源Fortran编译器", "title_en": "Why Apple Silicon Needs an Open Source Fortran Compiler", "transed": 1, "url": "https://walkingrandomly.com/?p=6696", "via": "", "real_tags": ["开源", "编译", "apple", "silicon", "fortran"]}, {"category": "", "categoryclass": "", "imagename": "ce218627eac76d57e9592bd06ecfe930.jpg", "infoid": 1035278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX和NASA在5月份创造了历史，两名宇航员-道格·赫尔利(Doug Hurley)和鲍勃·本肯(Bob Behnken)-乘坐私人开发的乘员龙(Crew Dragon)飞船进入轨道。\n在那次非常成功的两个月任务之后，SpaceX和NASA开始审查数据，以确保实际飞行与他们近十年来的所有模拟一致。在开发Crew Dragon的过程中，SpaceX表示，在进行的一系列测试中，它完成了大约800万小时的硬件在环软件测试，700次Dragon的SuperDraco推进器测试，以及近100次Dragon的降落伞测试和飞行。\n在所有这些工作和两次试飞之后，NASA于本月早些时候正式完成了对乘员龙飞船及其猎鹰9号火箭的载人航天认证。航天飞机退役后，美国国家航空航天局(NASA)在荒野中徘徊了十年，没有独立的太空通道，多亏了这种公私合作，NASA即将重新开始飞行宇航员的业务。\n认证将我们从设计和测试阶段带入工作的机组轮换阶段，人类航天主管凯西·路德斯在认证过程结束后说。但我们不会停止确保每一次飞行，包括NASA的太空一号任务，都会像我们为宇航员提供的最好系统一样严格对待。“。\n这一过程为SpaceX和NASA在周日进行首次机组龙飞行扫清了道路。在他们命名为Resilience的航天器内，NASA宇航员迈克尔·霍普金斯(Michael Hopkins)、维克多·格洛弗(Victor Goverer)、约翰·香农·沃克(Shannon Walker)以及日本宇宙航空研究开发机构任务专家野口宗一(Soichi Noguchi)将进入轨道，在国际空间站执行为期6个月的任务。\n在5月份的演示飞行之后，SpaceX对Dragon进行了两次更改。SpaceX公司的汉斯·科尼斯曼说，隔热罩有一小块区域，在大气层再入过程中的侵蚀比预期的要深一些。隔热罩的这一区域已经变得更加坚固。该公司的工程师还发现，降落伞展开过程中用于测量高度的气压传感器需要改进。此外，上个月，SpaceX不得不解决其猎鹰9号火箭上的梅林发动机的漆面问题。\n最后，该公司和NASA将与美国海岸警卫队更密切地协调，建立一个10英里的禁区，以确保回收区-太空舱将在佛罗里达州海岸外溅入大西洋或墨西哥湾-没有休闲游艇。\n但现在，这些技术问题似乎已成定局。主要的担忧是天气。SpaceX公司和美国国家航空航天局(NASA)原定于11月14日(星期六)发射“乘员一号”(Crew-1)任务。但本周晚些时候，热带风暴埃塔(Eta)的临近推迟了一艘无人机的起飞，以回收猎鹰9号火箭的第一级。由于SpaceX和美国国家航空航天局(NASA)打算在明年春天重新利用这一第一阶段执行Crew-2任务，而且周六晚上的发射天气不确定，发射被推迟到周日。\n不能保证周日在肯尼迪航天中心发射场的情况会很好，也不能保证在大西洋对岸的发射场，如果“龙”号在紧急情况下需要从猎鹰9号火箭上丢弃自己，情况会很好。周日的预报称，在美国东部时间晚上7点27分(世界标准时间周一00：27)的瞬间窗口内，发射成功的可能性为50%。如果发射尝试被取消，周三还有后备机会。\n机组人员今天早上已经醒来，并将在当地时间今天下午3点12分收到最后一次天气预报。美国国家航空航天局(NASA)下面的网络直播将在大约同一时间开始。如果情况看起来足够好，机组人员将立即穿上西装，并在下午4点05分正式离开操作和结账大楼，前往发射台。", "note_en": "SpaceX and NASA  made history in May by launching two astronauts—Doug Hurley and Bob Behnken—into orbit on board the privately developed Crew Dragon spacecraft.\n After that highly successful two-month mission, SpaceX and NASA set about reviewing data to ensure the actual flight was consistent with all of their simulations over the course of nearly a decade. In developing Crew Dragon, among the raft of tests performed, SpaceX said it completed about 8 million hours of hardware-in-the-loop software testing, 700 tests of Dragon&#39;s SuperDraco thrusters, and nearly 100 tests and flights of Dragon&#39;s parachutes.\n Following all of this work and two test flights, NASA formally completed certification of the Crew Dragon vehicle, and its Falcon 9 rocket, for human spaceflight earlier this month. After a decade of wandering in the wilderness, with no independent access to space following the space shuttle&#39;s retirement, NASA is about to be back in the business of flying astronauts thanks to this public-private partnership.\n  &#34;Certification moves us from the design and test phase into the crew rotation phase of our work,&#34; said Kathy Lueders, chief of human spaceflight, after this certification process. &#34;But we will not stop making sure every flight, including NASA’s Space Crew-1 mission, will be approached with the same rigor we have put into making this the best system it can be for our astronauts.”\n This process clears the way for SpaceX and NASA to conduct the first operational flight of Crew Dragon on Sunday. Inside the spacecraft they&#39;ve named  Resilience, NASA astronauts Michael Hopkins, Victor Glover, and Shannon Walker, along with Japan Aerospace Exploration Agency mission specialist Soichi Noguchi, will fly into orbit for a six-month stint on the International Space Station.\n    After the demonstration flight in May, SpaceX made two changes to Dragon. SpaceX&#39;s Hans Koenigsmann said there was a small area of the heat shield where erosion during atmospheric reentry was a little deeper than expected. This area of the heat shield has been made more robust. The company&#39;s engineers also found that the barometric pressure sensor used to measure altitude during the parachute deployment sequence needed to be improved. Additionally, last month, SpaceX had to tackle  a lacquer issue with the Merlin engines on its Falcon 9 rocket.\n Finally, the company and NASA will more closely coordinate with the U.S. Coast Guard to establish a 10-mile keep out zone to make sure the recovery zone—the capsule will splashdown off the coast of Florida either in the Atlantic Ocean or Gulf of Mexico—is free of recreational boaters.\n But now, those technical issues appear to be done and dusted. The primary concern is weather. SpaceX and NASA were originally targeting Saturday, November 14, for the launch of the Crew-1 mission. But late in the week, the proximity of Tropical Storm Eta delayed the departure of a drone ship to recover the Falcon 9 rocket&#39;s first stage. Because SpaceX and NASA intend to reuse this first stage for the Crew-2 mission next spring, and launch weather was uncertain for Saturday evening, launch was delayed until Sunday.\n  There is no guarantee conditions will be great on Sunday at the launch site, Kennedy Space Center, nor down range at &#34;abort sites&#34; across the Atlantic Ocean should Dragon need to jettison itself from the Falcon 9 rocket during an emergency. The  forecast for Sunday calls for a 50-50 chance of getting the launch off during its instantaneous window—7:27pm ET (00:27 UTC Monday). If the launch attempt is scrubbed, a back-up opportunity is available Wednesday.\n The crew has already awoken this morning, and will receive a final weather briefing at 3:12 pm local time today. The NASA webcast below will begin at about the same time. If conditions look decent enough, the crew will move to don suits immediately thereafter, and make their formal walkout of the operations and checkout building at 4:05pm en route to the launch pad.", "posttime": "2020-11-15 22:36:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,permitting,nasa", "title": "如果天气允许的话，今天是“乘员龙”将四人送入太空的日子。", "title_en": "Weather permitting, today’s the day Crew Dragon flies four people into space", "transed": 1, "url": "https://arstechnica.com/science/2020/11/weather-permitting-todays-the-day-crew-dragon-flies-four-people-into-space/", "via": "", "real_tags": ["太空", "nasa"]}, {"category": "", "categoryclass": "", "imagename": "60655b4598380b450ff3ef350d1acda7.jpg", "infoid": 1035277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我是在使用这项技术，还是在使用我？”夏琳·亨特·高尔特在PBS的《麦克尼尔/莱勒》节目中采访了媒体理论家和文化评论家尼尔·波斯曼。", "note_en": "\"Am I using this technology, or is it using me?\" Charlene Hunter Gault interviews media theorist and cultural critic Neil Postman on PBS' The MacNeil/Lehrer ...", "posttime": "2020-11-15 22:28:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postman,媒体", "title": "Neil Postman谈网络空间(1995)[视频]", "title_en": "Neil Postman on Cyberspace (1995) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=49rcVQ1vFAY", "via": "", "real_tags": ["postman", "媒体"]}, {"category": "", "categoryclass": "", "imagename": "0fef88d44e2d934e9c73b2c7907da3fa.jpg", "infoid": 1035276, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在IT巨头试图在设备生命周期内索要免费用品之际，EFF对这起攻击进行了抨击，这只是一个介绍性的报价。\n惠普公司(HP Inc.)不仅终止了终身免费墨水的承诺，而且还自动让客户加入订阅计划，继续使用他们的打印机墨水，这让惠普公司受到了抨击。\n在大流行期间，家用打印机在我们的生活中变得越来越重要，科里·多克托罗(Cory Doctorow)在谈到EFF的数字权利斗士时说。对于惠普来说，很难想象有比这更糟糕的时机了，它把手更深入地插进了客户的口袋。\n事情是这样的：惠普运行一种名为“即时墨水”(Instant Ink)的服务，你每月支付一笔费用，就会定期收到墨盒，以便装进你的打印机。您支付的金额决定了您可以打印的页数。例如，每月25美元可以让你在这段时间内打印最多700页，其中最多2100页未使用的页面可以滚动到随后的几个月。用完你的津贴后，你必须支付每15页1美元。不付款，不能打印。\n在安装惠普设备时，客户可以选择是选择Instant Ink路线，还是自己出去购买墨盒。如果他们取消了Instant Ink计划，他们将不得不把墨盒送回惠普--反正这些耗材已经不能再用打印机了--而是购买他们自己的标准墨盒。\n对于不需要打印太多内容的用户，惠普推出了终身免费打印服务，不过每月限量打印15页，每10页收费1美元。惠普推出了免费打印服务，以吸引用户使用订阅系统。这个想法是这样的：你买了一台打印机，注册了即时墨水免费层，就可以免费获得足够的耗材，在设备的生命周期内每月打印几件东西。\n然而，现在不再是这样了：免费等级正在被取消，现在人们不得不付费。下面是一封典型的上月底发给客户的电子邮件。一位终身免费打印的读者告诉我们，他必须从12月26日开始向惠普支付月费，否则他的打印机将停止工作，除非他自己购买新的墨盒。15页的月费起价为0.99美元，就像免费级别一样，尽管可以滚动到最多45页未使用的页面。\n惠普的一位发言人辩称，这家IT巨头的终身免费打印计划只是一个介绍性的提议，并补充道：\n我们在10月份通过电子邮件通知我们的客户，我们的Instant Ink订阅服务现在包括新的打印计划，允许更多的滚动灵活性、选项和好处。因此，一些订户可能会看到定价发生变化。\n免费打印计划包括每月最多15页，大约两年前开始为我们的Instant Ink订户提供介绍性优惠。我们现在正在调整我们的产品，使客户能够享受到更多的灵活性和选择。因此，我们将从今年12月开始终止针对现有客户的免费打印计划，并从11月4日起结束针对新客户的免费打印计划。然而，客户仍然可以获得非常实惠的打印计划，最低成本的计划定价为15页每月0.99美元。\nEFF特别顾问多克托罗(Doctorow)对此一无所知。他怒气冲冲地说，惠普最新发明的吸墨器确实是一个可悲的转折。他提醒我们，惠普为其打印机型号发布了固件更新，悄悄地阻止它们使用更便宜的非惠普墨盒。\n多克托罗在接受The Register采访时表示，美国法律--DMCA第1201条以及《计算机欺诈和滥用法》(Computer Fraud And Abuse Act)--允许这些公司逍遥法外，给他们提供了攻击灌装商和再制造商的工具，这些制造商对他们的不良行为起到了纠正作用。由于反垄断执法松懈，该行业如此集中，以至于几乎没有竞争压力来迫使公司做出具有约束力的承诺，不会这样做。\n上个月，惠普笨拙地撤销了MacOS上的打印机支持软件，导致客户无法在Mac电脑上打印到惠普设备上，而不是跳过这些圈套。\n本月，惠普彩色激光喷气机的拥有者抱怨说，在遇到供应问题后，他们突然无法打印；似乎又一次固件更新被推到了设备上，以阻止使用第三方墨盒。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "EFF on the attack as IT giant tries to claim free supplies during &#39;device lifetime&#39; just an introductory offer\n  HP Inc is under fire for not only ending its promise of free ink for life but also automatically enrolling customers into a subscription plan to continue using their printer ink.\n  &#34;During the pandemic, home printers have become far more important to our lives,&#34; said Cory Doctorow of the digital-rights warriors at the EFF. &#34;It&#39;s hard to imagine a worse time for HP to shove its hands deeper into its customers&#39; pockets.&#34;\n  What&#39;s happened is this: HP runs a thing called  Instant Ink, in which you pay a monthly fee, and periodically get sent ink cartridges to fit into your printer. The amount you pay dictates how many pages you are allowed to print. For instance, $25 a month lets you print up to 700 pages in that period, of which you can rollover up to 2,100 unused pages to subsequent months. After running out of your allowance, you must pay $1 per 15 pages. Don&#39;t pay, can&#39;t print.\n  Customers chose when setting up their HP device whether they want to go down the Instant Ink route, or go out and buy cartridges themselves. If they  cancel their Instant Ink plan, they have to send the cartridges back to HP – the supplies won&#39;t work anymore with the printer, anyway – and buy their own standard ones instead.\n  For users who don&#39;t need to print much, and to lure folks into the subscription system, HP  marketed a print-free-for-life tier that cost nothing, though it was limited to 15 pages a month, and $1 per 10 additional pages. The idea being: you buy a printer, you sign up for the Instant Ink free tier, and get enough supplies gratis to print a few things a month during the device&#39;s lifetime.\n    Well, not anymore: the free tier is being scrapped, and now folks have to pay. Below is a typical email sent to customers at the end of last month. One print-free-for-life reader told us he has to start paying HP a monthly fee from December 26, or his printer will stop working unless he buys his own fresh cartridges. The fees start from $0.99 a month for 15 pages, just like the free tier albeit with the ability to rollover up to 45 unused pages.\n    An HP spokesperson argued that the IT giant&#39;s print-free-for-life plan was &#34;an introductory offer,&#34; adding:\n  We notified our customers in October via email that our Instant Ink subscription service now includes new printing plans that allow for more roll-over flexibility, options and benefits. As a result, some subscribers may see a change in pricing.\n The free printing plan, which included up to 15 pages a month, started as an introductory offer for our Instant Ink subscribers about two years ago. We are now adjusting our offerings to enable customers to enjoy more flexibility and options. As a result, we are ending our free printing plan offer starting this December for existing customers, and we have ended our free printing plan as of November 4 for new customers. However, customers can still access very affordable printing plans, with the lowest-cost plan priced at $0.99 per month for 15 pages.\n  EFF special adviser Doctorow is having none of it. &#34;HP&#39;s latest reinvention as a wallet-siphoning ink grifter is a sad turn indeed,&#34; he  thundered. He reminded us HP emits  firmware updates for its printer models that quietly prevent them from using cheaper non-HP ink cartridges.\n  &#34;US law – section 1201 of the DMCA, and the Computer Fraud and Abuse Act – allows the companies to get away with this, giving them tools to attack refillers and remanufacturers who act as a corrective for their bad deeds,&#34; Doctorow told  The Register. &#34;The industry is so concentrated, thanks to lax antitrust enforcement, that there&#39;s little competitive pressure to drive companies to make binding promises not to do this.&#34;\n  Last month, HP  clumsily revoked its printer support software on macOS, leaving customers unable to print on their Macs to their HP devices without jumping through hoops.\n  And this month, HP Color Laser Jet owners  complained they were suddenly unable to print after getting &#34;Supply Problem&#34; errors; it  appears another firmware update was pushed out to devices to  block the use of third-party cartridges.\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-11-15 21:54:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打印,继续,printer,惠普", "title": "惠普：我们向你承诺的终身免印协议？嗯，现在是按月付费的，可以继续使用你的打印机墨水", "title_en": "HP: That print-free-for-life deal we promised you? Well, now it's pay-per-month to continue using your printer ink", "transed": 1, "url": "https://www.theregister.com/2020/11/12/hp_free_printing/", "via": "", "real_tags": ["打印", "继续", "printer", "惠普"]}, {"category": "", "categoryclass": "", "imagename": "a2e5f29071f5e0c68014147986389ebe.jpg", "infoid": 1035275, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "相信它能飞，现在它证明了这一点。这家德国品牌刚刚成功地让空中运动先驱彼得·萨尔兹曼(Peter Salzmann)身着新开发的电动翼装，以每小时186英里的速度在天空中翱翔。\n这一创新概念是宝马和萨尔茨曼共同努力的结果。这位专业跳伞运动员和定点跳伞运动员说，这个想法是他在思考如何提高空中表现时产生的。\n萨尔兹曼告诉宝马：“其中一个是辅助发动机--这是一个我无法动摇的想法。”“穿着翼装从我当地的山上跳下来，然后降落在我的花园里，这个想法让我很着迷。”", "note_en": "believed it could fly and now it’s proved it. The German marque just successfully sent air sports pioneer Peter Salzmann soaring through the sky at speeds of up to 186 mph in a newly developed  electric wingsuit.\n  The innovative concept was a joint effort between BMW,   and Salzmann. The professional skydiver and BASE jumper said the idea arose while he was thinking of ways to improve performance in the air.\n  “One of them was a supporting motor—and it’s an idea I just couldn’t shake,” Salzmann  told BMW. “I found the idea of being able to jump from my local mountain wearing the wingsuit and land in my garden fascinating.”", "posttime": "2020-11-15 21:45:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制造,world,想法", "title": "宝马制造了世界上第一套电动翼装。在第一次飞行中达到时速186英里", "title_en": "BMW Made World’s First Electrified Wingsuit. Reached 186 MPH on First Flight", "transed": 1, "url": "https://robbreport.com/motors/aviation/bmw-electrified-wingsuit-maiden-flight-1234580128/", "via": "", "real_tags": ["制造", "world", "想法"]}]