[{"category": "", "categoryclass": "", "imagename": "ba447b5f24234dd401bdc343c72d032e.jpg", "infoid": 1067933, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌正在向媒体应用程序开发人员开辟申请，让他们让他们保持更多的佣金 - 将较低的15％佣金支付给Google以换取支持某些平台和功能（通过9to5Google）。\n 游戏媒体体验计划是另一种旨在绕过公司的30％的服务费的方式，也是谷歌已经削减了景象背后的一些开发人员的录取;谷歌正在将其定位为以前邀请的计划的全球扩展，但似乎在今天之前没有提到过它。\n 如果这听起来很熟悉，您可能正在考虑亚马逊如何设法逃避Apple的App Store税。苹果公司也解释说，尽管从未提及其存在，但它为Premium Video Apps提供了“已建立的”计划。但谷歌的系统确实具有一些关键差异，比如如何旨在推动开发人员更好地支持多个Google平台。\n 虽然谷歌告诉我们，但不完全强迫开发人员支持Google TV，Wear OS，Android自动等，它要求他们支持以下功能和平台，其中有意义：\n 视频：鼓励客厅的开发人员 - 鼓励为Android电视，谷歌电视和谷歌演出的应用程序，并具有“交叉设备播放”和登录集成。\n 音频：鼓励通过订阅的高级音乐和音频内容的开发人员为佩戴OS，Android汽车，Android电视和Google演员构建应用程序。\n 书籍：开发人员提供高级书籍，有声读物和漫画，应制作平板电脑和可折叠的设备优化，与娱乐空间集成，以及用于佩戴OS和Android Auto的AudioBook服务。 \n谷歌还列出了在其网站上的特定资格要求，可以取消许多较小的开发人员，如需要超过100,000多个每月主动安装，以及播放商店的良好评级。此外，尽管谷歌告诉我们，但它将公开列出其一些平台，作为“必要的集成”，谷歌最终仍然是在哪些公司获得批准的最终呼叫。\n 目前尚不清楚这些应用程序是否能够通过谷歌的应用程序内计费系统，苹果的程序允许。去年，谷歌设定了2021年9月30日的截止日期，为所有开发人员采用Google In-App购物，如果他们销售数字货物。据报道，Netflix和Spotify已经通过直接接受信用卡来删除谷歌的30％。\n 谷歌已经将其他苹果橄榄枝镜像到开发人员。该公司于3月份宣布，开发商每年的首次收入100万美元将有资格获得15％的佣金。 Apple为适用于其App Store小型商业计划的开发人员提供了类似的15％费用安排。只要任何给定的客户已经订阅了超过一年，这两家公司都会减少30％的人减少到15％的人数到15％。\n 虽然所有这些优先似乎对开发人员都有益，但他们也表明事情一段时间没有完全相等。两家公司仍然掌握了最终的力量，如果你太大而无法忽视，你可能已经达成了更好的交易。 ", "note_en": "Google is  opening up applications to a new program for developers of media apps that lets them keep more of what they earn — paying a lower 15 percent commission to Google in exchange for supporting certain platforms and features ( via  9to5Google).\n The Play Media Experience Program is another way to get around the company’s 30 percent service fee, and it’s also an admission that the Google had already been cutting deals with some developers behind the scenes; Google is positioning it as the global expansion of a program that was previously invite-only, though it doesn’t seem to have mentioned it before today.\n If that sounds familiar, you might be thinking of  how Amazon managed to evade Apple’s App Store tax. Apple, too, explained that it had an “established” program for premium video apps, despite having never mentioned its existence publicly. But Google’s system does have some key differences, like how it also seems to be designed to push developers to better support multiple Google platforms.\n While Google tells us it isn’t exactly forcing developers to support Google TV, Wear OS, Android Auto and the like, it’s asking them to support the following features and platforms where it makes sense:\n Video: Developers for living room-first video services are encouraged to build apps for Android TV, Google TV, and Google Cast, with “cross device playback” and sign-in integrations.\n Audio: Developers for premium music and audio content via subscriptions are encouraged to build apps for Wear OS, Android Auto, Android TV, and Google Cast.\n Books: Developers offering premium books, audiobooks, and comics should make tablet and foldable device optimizations, integrate with  Entertainment Space, and for audiobook services, build apps for Wear OS and Android Auto.\n Google also lists  specific eligibility requirements on its site that may disqualify many smaller developers, like requiring over 100,000 monthly active installs, and a good rating in the Play Store. Also, despite what Google told us, it does publicly list some of its platforms as “required integrations,” and Google is ultimately still making the final call on which companies are approved.\n It’s not clear whether these apps will be able to skirt Google’s in-app billing system, something Apple’s program allows.  Last year, Google set a deadline of September 30th, 2021 for all developers to adopt Google in-app purchases if they sell digital goods. Netflix and Spotify  had reportedly already been evading Google’s 30 percent cut by directly accepting credit cards.\n Google has mirrored other Apple olive branches to developers as well. The company announced in March that developers’ first $1 million in revenue every year would be eligible for  a lower 15 percent commission. Apple offers a similar 15 percent fee arrangement for developers that apply to its  App Store Small Business Program. Both companies already reduce their 30 percent cut to 15 percent when it comes to subscription services, as long as any given customer has been subscribed for more than a year.\n While all these offers seem good for developers, they also show that things haven’t exactly been equal for a while. Both companies still wield the ultimate power, and if you’re too big to ignore, you may have already gotten a better deal.", "posttime": "2021-06-24 18:46:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,书籍,现在,app", "title": "谷歌现在考虑让您的视频，音乐或书籍应用避免其30％的裁减 ", "title_en": "Google will now consider letting your video, music or book app evade its 30% cut", "transed": 1, "url": "https://www.theverge.com/2021/6/24/22547934/google-play-app-store-fee-15-percent-movies-tv-books-audio", "via": "", "real_tags": ["google", "谷歌", "书籍", "现在", "app"]}, {"category": "", "categoryclass": "", "imagename": "a77a3489c563eae8757f11ce35538429.jpg", "infoid": 1067930, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "印度公司去年可获得谷歌（和其他155亿美元）的45亿美元的投资，并分享了在低成本智能手机上工作的计划，表示，Jiophone接下来将有助于大约3亿用户在印度仍在2G网络升级。\n 这款手机是“由极其优化的Android”操作系统，将于9月10日首次推出印度，最终将在该国之外提供。\n  Mukesh Ambani（聘请42500万用户）的JIO平台定位在未来几年内，依赖于周四的年度股东周年大会。\n Jiophone接下来将是全球“最实惠的智能手机”，声称Ambani，虽然他没有透露手机的价格或硬件规格。\n 谷歌首席执行官Sundar Pichai表示，该公司还与JIO平台进入了5G云合作伙伴关系。 “它将有助于超过十亿的印度人连接到一个更快，更好的互联网，支持他们的数字转型的企业，并帮助JIO在卫生，教育等行业中建立新的服务，为印度的下一阶段奠定基础， “Pichai说。\n “作为这一协作的一部分，依赖也将将其核心零售业务转移到谷歌云的基础架构。他们将能够利用谷歌的AI和机器学习，电子商务和需求预测产品。他补充说，利用谷歌云的可靠性和性能使这些企业能够根据需要扩展以响应客户需求。“\n  “我们与JIO团队密切合作了关于工程和产品开发的有用的声音第一功能，使这些用户能够以自己的语言消耗内容并导航手机，提供很大的相机体验，并获得最新的Android功能和安全性更新，“谷歌在一份声明中表示。 \n即使是印度的大多数智能手机，第二大市场的售价为150美元或更少，也留下了100美元的智能手机的客户留下了很少的选择。该选择近年来进一步缩减了。\n 研究公司对比告诉TechCrunch，即100美元的智能手机占印度智能手机市场的12％，从2019年的18％下降，2018年的24％。50美元的智能手机在2020年占整个市场的0.3％，下降2018年的4.3％。\n 智能手机制造商意识到市场上的这种空格，但已经发现满足这一需求令人难以置信的挑战。其中一些，包括大约42500万用户的JIO平台，早些时候探索了一系列特色手机，以抵达印度小城镇和城镇。 JIO平台的Kaios-Powered Feature Phone，称为Jiophone，今年2月下旬拥有1亿客户。\n 在最近向客户报告中，瑞银的分析师表示，在考虑到最近的记忆组件的价格浪涌之后，任何智能手机在50美元的价格上可能以成本售价。\n “虽然JIO的这一举措将加速2G到4G迁移，但我们评估了这种空间对其他智能手机制造商的有趣程度，尤其是像小米这样的关键参与者。印度智能手机的单位市场领导者小米不太可能跟进50美元的智能手机，我们认为，“他们在报告中写道，由TechCrunch获得。\n 谷歌此外，此前曾经做过几项努力 -  2014年的100美元Android一个智能手机课程和2017年的低资源密集型Android Go操作系统 - 扩大手机的触及范围。该公司还支持KaioS，为流行的功能手机提供了热门的功能。\n jiophone接下来是“印度的Android使命的重要步骤”，是我们的Android产品和工程团队将于印度开始的许多人，“谷歌在一份声明中表示。 “我们还积极扩展了印度的工程团队，因为我们继续努力寻找支持印度智能手机用户的独特需求的方法。” ", "note_en": "The Indian firm, which  secured $4.5 billion investment from Google (and another $15.5 billion from Facebook and others) last year and shared plans to work on low-cost smartphones, said the JioPhone Next will help roughly 300 million users in India who are still on 2G network upgrade.\n The phone, which is “powered by extremely optimized Android” operating system, will first launch in India on September 10 and will eventually be made available outside of the country.\n  Jio Platforms, which serves 425 million subscribers, is positioned to add another 200 million in the next few years, said Mukesh Ambani, chairman of Reliance Industries, at its annual general meeting Thursday.\n The JioPhone Next will be the “most affordable smartphone” globally, claimed Ambani, though he didn’t reveal the price or the hardware specifications of the handset.\n Google CEO Sundar Pichai said the company has also entered into a 5G cloud partnership with Jio Platforms. “It will help more than a billion Indians connect to a faster and better internet, support businesses in their digital transformation, and help Jio build new services in sectors like health, education and more — laying a foundation for the next phase of India’s digitization,” said Pichai.\n “As part of this collaboration, Reliance will also shift its core retail businesses to Google Cloud’s infrastructure. They will be able take advantage of Google’s AI and machine learning, e-commerce, and demand forecasting offerings. Harnessing the reliability and performance of Google Cloud will enable these businesses to scale up as needed to respond to customer demand,” he added.\n  “We have worked closely with the Jio team on engineering and product development on useful voice-first features that enable these users to consume content and navigate the phone in their own language, deliver a great camera experience, and get the latest Android feature and security updates,” Google said in a statement.\n Even as most smartphones that ship in India, the second largest market, are priced at $150 or less, customers looking for a smartphone priced under $100 are left with little choice. And that choice has further shrunk in recent years.\n Research firm Counterpoint told TechCrunch that the sub-$100 smartphones accounted for just 12% of the Indian smartphone market, down from 18% in 2019 and 24% in 2018. Sub-$50 smartphones represented just 0.3% of the entire market in 2020, down from 4.3% in 2018.\n Smartphone makers are aware of this whitespace in the market, but have found it incredibly challenging to meet this demand. Some, including Jio Platforms, which has amassed over 425 million subscribers, earlier explored a range of feature phones to reach small cities and towns of India. Jio Platforms’ KaiOS-powered feature phone, called JioPhone, had amassed 100 million customers as of late February this year.\n In a recent report to clients, analysts at UBS said that after accounting the recent price surge of memory component, any smartphone priced at or under $50 is likely selling at cost.\n “While this move by Jio will accelerate 2G to 4G migration, we evaluated how interesting this space would be for other smartphone manufacturers, especially key players like Xiaomi. Xiaomi, the unit market leader in smartphones in India, is unlikely to follow up with a $50 smartphone, in our view,” they wrote in the report, obtained by TechCrunch.\n Google, too, has previously made several efforts —  $100 Android One smartphones program in 2014 and  low-resource intensive Android Go operating system in 2017 — to expand the reach of its handsets. The company has also  backed KaiOS, which powers popular feature phones.\n The JioPhone Next is a “ momentous step in our Android mission for India, and is the first of many that our Android product and engineering teams will embark on in India,” Google said in a statement. “We are also actively expanding our engineering teams in India, as we continue to work on finding ways to answer the unique needs of India’s smartphone users.”", "posttime": "2021-06-24 18:04:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,google,手机,谷歌,实惠", "title": "谷歌和jio平台宣布jiophone接下来，一个经济实惠的Android智能手机 ", "title_en": "\n\t\t\t\tGoogle and Jio Platforms announce JioPhone Next, an affordable Android smartphone\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/google-and-jio-platforms-announce-worlds-cheapest-smartphone-jiophone-next/", "via": "", "real_tags": ["android", "google", "手机", "谷歌", "实惠"]}, {"category": "", "categoryclass": "", "imagename": "c39133a24ff427181eff609522b5181d.jpg", "infoid": 1067929, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "The Round由Thoma Bravo领导，最近收购了网络安全供应商校对点123亿美元，并由富兰克林·斯坦普敦，汉密尔顿巷和蓝猫头鹰资本支持。\n 幻灯队的系列融资赛后两年以上的圆形土地，其中它筹集了6500万美元，并推动了迫使IPO的猜测。该公司的创始人安德鲁·鲁宾仍然没有准备好被压制公司是否计划去公众，虽然他告诉TechCrunch：“如果我们做的就业，如果我们让客户成功，我想认为这将是我们旅程的一部分。“\n Illumio的最新资金圆形是良好的。它不仅在成功的网络内攻击中的巨大崛起中，这表明一些传统的网络安全措施不再是2020年初的太阳能冲击，从太阳能发布到最近的殖民地管道的攻击，但它也是几周之后Joe Biden总统发布了一项行政命令，推动联邦机构实施明显的网络安全举措，包括零信任架构。\n “只有几周前，安妮新伯格[网络安全副国家安全顾问]在所有公司通过赎金瓶大流行中留下了一份关于所有公司的白宫的备忘录，这是我们的六件事鲁宾说，恳求你这样做。 “其中一个是分段你的网络。”\n Illumio专注于保护数据中心和云网络通过它调用微分割，它声称它更容易管理和防范潜在的漏洞，以及如果发生这种情况，则包含违规行为。这种零信任方法 - 一种符合企业不应自动信任其周边或外部内外的任何信念的概念 - 根据Illumio的说法从未对组织更加重要。\n “网络事件不再限制网络空间，”鲁宾说。 “这就是为什么人们终于说，在30年后依靠检测让我们保证安全，我们不能100％的时间依靠它。零信任现在正在成为咒语。“\n Illumio告诉TechCrunch它将利用新筹集的资金在其现场运营和渠道合作伙伴网络中进行“巨大”投资，并投资于创新，工程及其产品。 \n在2013年成立的阶段启动，始于加利福尼亚州，该公司超过10％的公司 - 包括摩根士丹利，BNP Paribas SA和Salesforce  - 现在使用其技术来保护他们的数据中心，网络和其他技术 应用程序。 它在大流行期间看到了100％的国际增长，并说它也在扩大其跨越更多行业的客户群。  该公司筹集了更多现在从投资者提供更多5.5亿美元包括Andreessen Horowitz，通用催化剂和形成8。 ", "note_en": "The round was led by Thoma Bravo, which recently  bought cybersecurity vendor Proofpoint by $12.3 billion, and supported by Franklin Templeton, Hamilton Lane, and Blue Owl Capital.\n The round lands more than two years after  Illumio’s Series E funding round in which it raised $65 million, and fueled speculation of an impending IPO. The company’s founder, Andrew Rubin, still isn’t ready to be pressed on whether the company  plans to go public, though he told TechCrunch: “If we do our job right, and if we make our customers successful, I’d like to think that would be part of our journey.”\n Illumio’s latest funding round is well-timed. Not only does it come amid a huge rise in successful cyberattacks which show that some of the more traditional cybersecurity measures are no longer working, from the  SolarWinds hack in early 2020 to the more recent attack on  Colonial Pipeline, but it also comes just weeks after President Joe Biden issued an executive order pushing federal agencies to implement significant cybersecurity initiatives, including a zero trust architecture.\n “And just a couple of weeks ago,  Anne Neuberger [deputy national security adviser for cybersecurity] put out a memo on White House stationary to all of corporate America saying we’re living through a ransomware pandemic, and here’s six things that we’re imploring you to do,” Rubin says. “One of them was to segment your network.”\n Illumio focuses on protecting data centers and cloud networks through something it calls micro-segmentation, which it claims makes it easier to manage and guard against potential breaches, as well as to contain a breach if one occurs. This zero trust approach to security — a concept centered on the belief that businesses should not automatically trust anything inside or outside its perimeters — has never been more important for organizations, according to Illumio.\n “Cyber events are no longer constrained to cyber space,” says Rubin. “That’s why people are finally saying that, after 30 years of relying solely on detection to keep us safe, we cannot rely on it 100% of the time. Zero trust is now becoming the mantra.”\n Illumio tells TechCrunch it will use the newly raised funds to make a “huge” investment in its field operations and channel partner network, and to invest in innovation, engineering and its product.\n The late-stage startup, which was founded in 2013 and is based in California, says more than 10% of Fortune 100 companies — including Morgan Stanley, BNP Paribas SA and Salesforce — now use its technology to protect their data centers, networks and other applications.  It saw 100% international growth during the pandemic, and says it’s also broadening its customer base across more industries.\n The company has raised more now raised more $550 million from investors include Andreessen Horowitz, General Catalyst and Formation 8.", "posttime": "2021-06-24 18:04:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,unicorn", "title": "Zero Trust Unicorn Illumio关闭了Thoma Brava领导的$ 225M系列 ", "title_en": "\n\t\t\t\tZero trust unicorn Illumio closes $225M Series F led by Thoma Brava\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/zero-trust-unicorn-illumio-closes-225m-series-f-led-by-thoma-brava/", "via": "", "real_tags": ["rust", "unicorn"]}, {"category": "", "categoryclass": "", "imagename": "2fdcee65d540adb6e8458d53170ca601.png", "infoid": 1067928, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "......或者很难写出两年前完成的项目\n      长话短说，这是一篇关于我在2019年7月在...的另一个定制机器的帖子......\n 是的，我知道......有点旧的故事，但我以前写过，机器和照片是堆叠的，而我继续前进到其他项目，这些是在队列中等待。\n 无论如何，我意识到我需要赶上我所做的所有旧工作，因为我很快就会忘记所有关于哈哈的东西！\n  在这个特定的Acorn Archimedes A3020之前，我用A3000玩了一点，即Bachoo / SaveTefloppy（旧证据警告）带来了固定。这是一个很好的机器，但我几乎没有机会用它玩它，因为一个很容易。特定的A3000不想与监视器合作，Bachoo不知道如何对其进行解决。此外，他会把它交给另一个没有clue如何使用duckduckgo.com这样的Interwebz搜索引擎的人\n 如果我记得正确，修复程序就是抑制“删除”键重置CMOS或'T'，如startdot.org.uk论坛所述\n               正如我所说，有明显的事情是必须做的，如清理套接字周围的腐蚀和rTC电池区域周围。这次我尝试过草酸，因为它是水溶性的，便宜的，轻度。它结果适度正常，因为它没有像其他酸一样创造复杂的铜化合物，但是，我将在未来寻找其他更好的解决方案。这是它的完成。 \n有一些腐蚀的痕迹必须固定，显然是强制性的覆盖那些泄漏和磨损的电解质帽。\n            键盘在符号中是固定的。实际上，它只需要脱黄，因为它是电子方式的。无论如何，这是它看起来的看法。\n           我不得不修理连接器，因为它有点疲惫不堪，并没有服务于其目的。通过切断一小位的原始膜连接器，键盘工作很容易实现。\n     对于这个特定的单位，我已经订购了RAM升级套件和RTC电池MOD，从寄射锁定标记。像往常一样，标记套件和产品很棒，具有详细的安装手册等。\n   我所要做的就是将RAM芯片放入插座并根据手动设置跳线 - 轻松\n          我想使用标准的CF2IDE适配器以及CF卡作为硬盘替代品。\n  这部分有点棘手，因为我不是橡子专家。在悲惨地失败之后，我已经开始寻找一些帮助。拯救的丁丁特论坛！耶！ \n这个mod有两个主要问题。首先，我不得不弄清楚一个正确设置CF卡的方法，所以它可以在RISC OS 3.1下工作。起初，我以为我可以轻松地在Linux（这是可行的）下进行，但事实证明还有另一种方式 -  Raspberry PI运行RISC OS 5！我从未有过这个操作系统的opprotunity，所以我就像......\n  如何在令人敬畏的Startdot论坛上详细进行伟大的教程，显然是令人敬畏的。论坛上的伙计们将我指向一个我可以刻录的图像来测试我的设置。\n  它有点努力，但无论我的努力如何，我所遇到的只是这个令人讨厌的错误弹出。\n  这就是Stardot论坛上另一个线程的地方帮助了我很多。首先，我不得不修改适配器一点。这是通过向其添加二极管并在CF2ADE适配器上连接销30和32来完成的。\n    我设法测试了四张不同的CF卡，但错误仍然存​​在，所以我又决定再试一次，最后一次和使用4GB的SanDisk超CF卡这次从Speccy Devices汲取了课程\n      一旦被整理出来，我就开始寻找一种方式来安装适配器和Archie内的卡。\n 我认为我可以3D打印一个简单的支架并将其拧在内部。遵循快速设计和3D打印会话。 （STL文件在帖子底部提供） \n我必须做的就是完成它，是为了在一个迷人的封面上为CF卡制作一个洞。  通过设计和3D打印简单适配器，容易实现该部分。 （STL文件在帖子底部提供）  我在原始软盘按钮上粘在原始软盘上，以防所有者想要返回原始状态。  Acorn Archimedes A3020已准备好玩。 在将其运送到新所有者之前，我用这台机器播放了一些。 在一些图片下方和一个短视频，显示了这台计算机的能力。  如果您想获得复古装备我正在制造或硬件模块，请访问商店 - ＆gt; https://retrohax.net/shop/  如果你想捐一台死锁，那么我会给我发一封电子邮件。 极端案例受到欢迎。 - 没有人捐赠任何东西。 所以不要打扰。 看起来只有YouTubers获得所有好吃的Lolol; P < - 这不再是真的！ 从巴西😀的家伙欢呼 ", "note_en": "… or it is seriously hard to write about a project that was finished two years ago\n      Long story short, this is a post about another custom-ordered machine that I worked on … in July of 2019 …\n Yeah, I know … a bit old story but like I’ve written before, machines and pics are piling while I move on to other projects and these are waiting in a queue.\n Anyway, I’ve realized that I need to catch up with all the older jobs that I did simply because I will soon forget what it was all about lol!\n  Before this particular Acorn Archimedes A3020, I’ve played a bit with the A3000 that Bachoo/ SaveTheFloppy (old cert warning) brought for fixing. It is a nice machine but I barely had an opportunity to play with it as a fix was very easy. That particular A3000 didn’t want to co-operate with the monitor and Bachoo didn’t know how to sort it out. Moreover, he’d give it to another guy who had no clue how to use interwebz search engines like  duckduckgo.com either 😉\n If I remember correctly the fix was about holding down either the ‘Delete’ key to reset CMOS or ‘T’ as described on  startdot.org.uk forums\n               As I said, there were obvious things that had to be done, like cleaning up the corrosion around the sockets and around the RTC battery area. This time I’ve tried Oxalic acid as it is water-soluble, cheap, and mild. It turned out moderately OK since it does not create complex copper compounds like other acids, however, I will be looking for other, better solutions in the future. Here is how it was done.\n       There were some corroded traces that had to be fixed and obviously, a mandatory recap of those leaking and worn-out electrolytic caps.\n            The keyboard was next in line to be fixed. Actually, it only needed de-yellowing as it was electronically OK. Anyway, here is how it looked.\n           I had to fix the connector as it was a bit worn out and didn’t serve its purpose. That was easily achieved by cutting off a tiny bit of an original membrane connector and the keyboard was working.\n     For this particular unit, I’ve ordered a RAM upgrade KIT and RTC battery mod from  Mark of retroclinic. As usual, Marks KITs and products are awesome with detailed installation manuals, etc.\n   All I had to do is to put RAM chips into sockets and set up jumpers according to the manual – easy\n          I wanted to use a standard CF2IDE adapter along with a CF card as a hard drive substitute.\n  That part was a bit tricky as I am not an expert in Acorns. After failing miserably to set it all up, I’ve started looking for some help. S tartdot forums to the rescue! YaY!\n There were two main issues with this mod. First, I had to figure out a way to properly set up a CF card so it could work under RISC OS 3.1. At first, I thought that I can do it easily under Linux (which is doable) but it turned out that there is another way – Raspberry PI running RISC OS 5! I’ve never had an opprotunity to play with this OS so I was like…\n  There is a great tutorial on how to do it in detail on  awesome startdot forums obviously. Guys on forums pointed me to an image that I can burn to test my setup out.\n  It kinda worked but regardless of my efforts, all I was getting was this annoying error pop-up.\n  This is where another thread on  stardot forums helped me a lot. First, I had to modify my adapter a bit. That was done by adding a diode to it and connecting pins 30 and 32 on a CF2IDE adapter.\n    I’ve managed to test four different CF cards but the error was still there so I’ve decided to test it one more, last time and used a 4GB SANDISK Ultra CF card this time – lesson learned from Speccy devices 😉\n      Once that was sorted out, I’ve started looking for a way to nicely install an adapter and a card inside Archie.\n I’ve figured that I can 3D print a simple holder for it and screw it inside. Quick designing and 3D printing session followed. ( STL file is available at the bottom of the post)\n     All I had to do to finish it, was to make a hole in a dummy cover for a CF card.\n        That part was easily achieved by designing and 3D printing a simple adapter. ( STL file is available at the bottom of the post)\n     I’ve glued on an original floppy button just in case the owner want’s to return to an original state.\n       Acorn Archimedes A3020 was ready to play with. Before shipping it to a new owner, I’ve played a bit with this great machine. Below some pics and a short video showing what this computer is capable of.\n        If you want to get the retro gear I am manufacturing or hardware modules, please visit  shop -&gt; https://retrohax.net/shop/\n  If you want to donate a dead computer then  drop me an email. Extreme cases are welcome. –  Nobody donates anything. so don’t bother. Looks like only Youtubers get all goodies LOLOL ;P  &lt;– THIS IS NO LONGER TRUE!  Cheers to guys from Brasil 😀", "posttime": "2021-06-24 17:56:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "archimedes,原始", "title": "Acorn Archimedes A3020  -  Refurm和Mods ", "title_en": "Acorn Archimedes A3020 – Refurb and Mods", "transed": 1, "url": "https://retrohax.net/acorn-archimedes-a3020-refurb-and-mods/", "via": "", "real_tags": ["原始"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067927, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在日常新闻中脱落 ", "note_en": "Shedding Light On Daily News", "posttime": "2021-06-24 17:56:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "男人,buses,新闻", "title": "男人埋设了42辆上学的地下，他建造的是辉煌的 ", "title_en": "Man Buries 42 School-Buses Underground and What He Built Is Brilliant", "transed": 1, "url": "https://www.illumeably.com/news/man-buries-42-school-buses-underground-vsparks-de/2/3/", "via": "", "real_tags": ["男人", "buses", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "dfc17c386e8b2cc233b091ab46b7fc00.jpeg", "infoid": 1067926, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦 - 签证同意周四收购瑞典金融技术启动思考18亿欧元（21亿美元），旨在展望巨头巨头和数字野心。\n 这笔交易是在签证签证之后，并在购买格子上的竞标后，美国竞争对手的竞争对手被美国监管机构鱼腥草。格子花呢披肩选择单独作为独立公司独自，并被投资者私下重视，134亿美元。\n  格子和TIN思都在称为开放银行的新生空间中运作，这呼吁贷方提供第三方公司，该公司提供了令人垂涎的消费银行数据的访问，提供了它们＆＃39所同意。由于新条例，开放银行在英国和欧盟蓬勃发展。\n ＆＃34;签证致力于尽我们所能促进创新和赋予消费者支持欧洲的开放银行目标，＆＃34;在一份声明中表示，签证＆＃39;首席执行官。\n  ＆＃34;通过携带网络和叮当作用的网络和TINK和＃39;开放银行能力，我们将以更简单，可靠和安全的工具为欧洲消费者和企业提供增加的价值。＆＃ 34;\n 2012年由瑞典企业家DanielKjellén和Fredrik Hedberg成立，最初是作为财务管理应用程序的TINK，但后来旨在重点，专注于为其他企业提供技术。\n TINK＆＃39; S技术让银行和FINTECH公司访问银行数据以创造新的金融产品。基于斯德哥尔摩的公司私人价值6.8亿欧元。它从投资者筹集了超过3亿美元，包括PayPal，SEB和ABN AMRO。 \n＆＃34;正如我们了解签证，它明确地分享了一个共同的使命 - 联系金融世界，加快数字金融服务的增长和采用，＆＃34; Tink＆＃39;在星期四的博客文章中说道。\n  ＆＃34;与签证合作意味着我们＆＃39; LL现在能够比以往任何时候都更快，达到，我们知道签证是我们旅程的下一阶段的完美合作伙伴。＆＃34;\n 签证＆＃39;收购TINK是大规模支付行业巩固努力的最新潮流。该公司去年试图购买格子，但最终在美国司法部后抛弃了收购，该公司起诉挡住了反托拉斯地面。\n 签证所说，处理Tink的交易受到监管批准和其他习惯性关闭条件的约束，加入它将仅限于现金和赢得影响公司＆＃39;股票回购计划或股息政策。\n 签证说，TINK将保持其品牌和管理团队，签证，而公司＆＃39;总部也将留在斯德哥尔摩。 ", "note_en": "LONDON —  Visa agreed Thursday to acquire Swedish financial technology start-up Tink for 1.8 billion euros ($2.1 billion), in a deal aimed at bolstering the payment giant&#39;s digital ambitions.\n The deal comes after Visa&#39;s bid to buy Plaid, an American rival to Tink, was  torpedoed by U.S. regulators. Plaid has since opted to go it alone as an independent company, and was  last privately valued by investors at $13.4 billion.\n  Both Plaid and Tink operate in a nascent space known as  opening banking, which calls on lenders to provide third-party firms with access to coveted consumer banking data, provided they&#39;ve got consent. Open banking has flourished in Britain and the EU thanks to  new regulation.\n &#34;Visa is committed to doing all we can to foster innovation and empower consumers in support of Europe&#39;s open banking goals,&#34; Al Kelly, Visa&#39;s CEO, said in a  statement.\n  &#34;By bringing together Visa&#39;s network of networks and Tink&#39;s open banking capabilities we will deliver increased value to European consumers and businesses with tools to make their financial lives more simple, reliable and secure.&#34;\n Founded by Swedish entrepreneurs Daniel Kjellén and Fredrik Hedberg in 2012, Tink initially started out as a financial management app but later pivoted to focus on providing its technology to other businesses instead.\n Tink&#39;s technology lets banks and fintech firms access banking data to create new financial products. The Stockholm-based company was last privately valued at 680 million euros. It has raised more than $300 million from investors including  PayPal,  SEB and  ABN AMRO.\n  &#34;As we got to know Visa, it became clear that we share a common mission – to connect the financial world and accelerate the growth and adoption of digital financial services,&#34; Tink&#39;s founders said in a  blog post Thursday.\n  &#34;Teaming up with Visa means we&#39;ll now be able to move faster and reach further than ever before, and we know that Visa is the perfect partner for the next stage of our journey.&#34;\n Visa&#39;s acquisition of Tink is the latest in a  wave of consolidation efforts in the massive payments industry. The company  had tried to buy Plaid last year, but ultimately  abandoned the takeover after the U.S. Department of Justice sued to block it on antitrust grounds.\n The deal with Tink is subject to regulatory approvals and other customary closing conditions, Visa said, adding it will be financed solely with cash and won&#39;t impact the company&#39;s stock buyback program or dividend policy.\n Tink will keep its branding and management team after the deal, Visa said, while the company&#39;s headquarters will also remain in Stockholm.", "posttime": "2021-06-24 17:08:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "购买,buy,签证", "title": "签证购买瑞典金公司启动TINK ", "title_en": "Visa to buy Swedish fintech startup Tink", "transed": 1, "url": "https://www.cnbc.com/2021/06/24/visa-to-buy-swedish-fintech-start-up-tink.html", "via": "", "real_tags": ["购买", "buy", "签证"]}, {"category": "", "categoryclass": "", "imagename": "d135b4a30ccbc4876226facc467284ea.png", "infoid": 1067925, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CloudFlare上的静态WordPress托管将为您的网站提供最快的页面加载速度 - 它完全免费！\n  是和否。如果您有一个简单的WordPress网站，您可以使用它来显示内容，那么这将很好。如果您使用评论，电子商务，任何导致Post Request的内容，那么这将无法正常工作。\n CloudFlare作为缓存代理开始生活，但在某些点发布的页面上允许您部署GitHub项目并在CloudFlare上托管它。它与静态内容确实很好，并将在没有服务器侧处理的情况下快速提供您的内容。\n 相比之下的WordPress是一个在PHP和MySQL上运行的服务器端应用程序。每个请求由PHP处理，该PHP查询DB并使用页面响应。页面性能根据插件/主题复杂性/服务器拥塞等的数量而下降。\n 因此，为了在CloudFlare上“主机”WordPress，您需要在本地运行WordPress，编写您的帖子，然后将您的网站导出为将部署到CloudFlare的静态内容集。\n  如果您已经在Web上运行WordPress，则可以跳过（如果要仍需支付托管），只需将您的网站移动到像https://edit.myblog.com这样的子域。\n 如果您不想支付托管，那么每次想要制作博客文章或选择新主题时，您需要在本地运行WordPress。这是静态WordPress托管的主要缺点 - 您无法避免在进行更改时在某处运行堆栈。 \n我将使用Docker演示这一点，因为它更容易获得这种方式运行的WordPress环境。如果您已在本地计算机上运行WordPress，您仍然可以执行此操作。它假设您的主站点使用HTTPS（您完全总是这样做，对吧？）\n  这需要进行调整，以便可以正确地从WordPress正确转储文件。首先是nginx override，以便该网站在端口8000上内部运行。这应该\n  为此工作，您还需要一个端口定义，因此Apache知道要倾听它：\n  这些文件应将这些文件安装在docker-compose.yml文件中的WordPress容器中，因此您应该最终以这样的完整文件：\n 版本：＆＃34; 3＆＃34;服务：db：container_name：site_mysql图片：5.7卷： -  ./db_data：/var/lib/mysql #persist mysql数据当地重新启动：始终环境：mysql_root_password：password mysql_database：site_wp mysql_user：site_wp mysql_password：password wordpress：contain_name ：site_wordpress indeds_on： -  dB图像：wordpress：最新卷： -  ./ wordpress_data：/var/www/html＃持续WordPress文件在本地 -  ./ports.conf:/etc/apache2/ports.conf＃完成允许静态站点生成工作 -  ./000-default.conf:/etc/apache2/sites-enabled/000-default.conf端口： - ＆＃34; 8000：8000＆＃34;重启：始终环境：wordpress_db_host：db：3306 wordpress_db_user：site_wp wordpress_db_password：password wordpress_db_name：site_wp\n     此时，您将编写要发布的任何博客文章，设置主题，插件等，直到您已准备好部署到Web。\n  您需要安装简单的静态插件以将您的网站导出为静态集HTML。 \n转到“生成”菜单，然后单击“生成静态文件”。等待完成过程，您应该最终与您的WordPress网站导出到./wordpress_data/static。\n   CloudFlare要求您从Github Repo推送它。这是免费的，因此您只需要登录GitHub并创建一个新的私人回购：\n    这将忽略MySQL和WordPress创建的所有文件，除了简单静态的静态HTML文件。\n       选择您将代码推入并继续的存储库。设置构建配置时选择：\n  这将告诉CloudFlare只是抓取静态输出，该静态输出被推到主分支并曝光。\n 完成后，请让Build运行和您的网站在yoursite.pages.dev中可见。如果要使用自定义域，请立即设置CNAME记录并将其指向该URL。\n  WordPress很棒，但由于其成为服务器端呈现的网站的性质，可以缓慢。如果您没有一个主要只是内容的复杂网站，您可以通过在本地写入博客并将其发布到CloudFlare来实现大量增长并为静态WordPress托管付款。 ", "note_en": "Static WordPress hosting on CloudFlare will give you the fastest possible page load speed for your site – and it’s completely free!\n  Yes and no. If you have a simple WordPress site you use to just display content then this will be fine.  If you use comments, ecommerce, anything that causes a  POST request then this won’t work.\n CloudFlare started life as a cache proxy but at some point released  pages that lets you deploy a github project and host it on CloudFlare. It does really well with static content and will deliver your content quickly as there is no server side processing.\n WordPress in contrast is a server-side app that runs on PHP and MySql. Each request is processed by PHP that queries the DB and responds with a page. Page performance drops off a cliff depending on the number of plugins/theme complexity/server congestion etc.\n So in order to “host” WordPress on CloudFlare, you need to run WordPress locally, write your posts and then export your site as a static set of content that gets deployed into CloudFlare.\n  If you already have WordPress running on the web, you can skip (if you want to still pay for hosting) and just move your site to a subdomain like  https://edit.myblog.com.\n If you don’t want to pay for hosting, then you’ll need to run WordPress locally each time you want to make a change like writing a blog post or choosing a new theme. This is main downside to static WordPress hosting – you can’t avoid running the stack somewhere when making changes.\n I’ll be demonstrating this using Docker since it’s just easier to get the WordPress environment running this way. You can still do this if you already have WordPress running on your local machine. It assumes your main site runs using HTTPS (you’re totally always doing this already, right?)\n  This needs to be tweaked so that the files can be correctly dumped from WordPress. First up is an  nginx override so that the site runs internally on port  8000. This should\n  For this to work, you’ll also needs a ports definition so apache knows to listen on it:\n  These files should be mounted into the WordPress container in the  docker-compose.yml file, so you should end up with a complete file like this:\n version: &#34;3&#34; services: db: container_name: site_mysql image: mysql:5.7 volumes: - ./db_data:/var/lib/mysql # Persist mysql data locally restart: always environment: MYSQL_ROOT_PASSWORD: password MYSQL_DATABASE: site_wp MYSQL_USER: site_wp MYSQL_PASSWORD: password wordpress: container_name: site_wordpress depends_on: - db image: wordpress:latest volumes: - ./wordpress_data:/var/www/html # Persist wordpress files locally - ./ports.conf:/etc/apache2/ports.conf # Done to allow static site generation to work - ./000-default.conf:/etc/apache2/sites-enabled/000-default.conf ports: - &#34;8000:8000&#34; restart: always environment: WORDPRESS_DB_HOST: db:3306 WORDPRESS_DB_USER: site_wp WORDPRESS_DB_PASSWORD: password WORDPRESS_DB_NAME: site_wp\n     At this point you’d write any blog posts you want to publish, set themes, plugins etc until you’re ready to deploy to the web.\n  You’ll need to install the  Simply Static plugin to export your site as a static set of HTML.\n       Go to the  Generate menu and click  Generate Static Files. Wait for the process to complete and you should end up with your WordPress site exported to  ./wordpress_data/static.\n   CloudFlare requires that you push to it from a GitHub repo. This is free, so you just need to log into GitHub and create a  new Private Repo:\n    This will ignore all of the files that get created by MySql and WordPress, except for the static html files from Simply Static.\n       Choose the repository you pushed your code into and continue. When setting up the build configuration choose:\n  This will tell CloudFlare to simply grab the static output that got pushed up to the master branch and expose it.\n Once complete, let the build run and your site should be visible at   yoursite.pages.dev. If you want to use your custom domain, just setup a  CNAME record and point it at that url.\n  WordPress is great, but can be slow due to its nature of being a server-side rendered website. If you don’t have a complicated site that’s mainly just content, you can achieve a big speed increase and pay nothing for static WordPress hosting by writing your blog locally and publishing it up to CloudFlare.", "posttime": "2021-06-24 17:07:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,wordpress", "title": "免费的“主持人”WordPress免费 ", "title_en": "“Host” WordPress on Cloudflare for Free", "transed": 1, "url": "https://blogabout.dev/how-to-get-static-wordpress-hosting-on-cloudflare-for-free", "via": "", "real_tags": ["免费", "wordpress"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很激动到宣布签证正在获取思考。这是开放银行新章的开头，我们对员工，客户和金融服务未来的意义不可能更兴奋。\n 与签证合作将允许TININ进一步发展其组织，产品和服务，以更好地为现有和未来的客户提供服务。\n TINK和VISA分享了联系金融世界的共同任务，加快了数字金融服务的增长和采用。\n  差不多十年前，我们创立了对所有人的想法来实现的，应该是每个人的想法。从那一天起，我们的每一个同事都是无情地建立技术，使人们能够将银行账户与新一代金融服务联系起来。直观，轻松和愉快的服务。多年来删除障碍障碍的服务。\n 从联系瑞典的前10个银行，居住在18个市场，支持超过3,400多个金融机构的金融机构 - 我们为我们所实现的所有达成而感到骄傲。今天，我们正在向开拓者提供推动 - 从数千名初创公司到世界上最大，最渐进的金融机构。各种各样的每个人的集体努力工作即将永远改变金融服务业的形状。\n 很明显，我们在TINK的根本上建立了真正令人难以置信的东西，这对我们的客户有巨大影响，对消费者和大量的社会产生了巨大的影响。但也很清楚，我们只划伤了表面，我们刚刚开始。\n 这就是为什么我们兴奋地分享TINK正在加入签证的消息。 \n正如我们要了解签证，很明显，我们分享了一个共同的使命 - 联系金融世界，加快数字金融服务的增长和采用。与签证合作意味着我们现在可以比以往任何时候都更快，更加达到，我们知道Visa是我们旅程的下一阶段的完美伴侣。\n 对于所有同事，客户和财务未来，我们对下一阶段意味着什么更令人兴奋。这种合作伙伴关系反映了在过去十年中造成的每个人都制定了各个人的贡献，而我们的客户则为我们提供的信任。与签证合作将使我们进一步发展我们的组织，产品和服务，以更好地为我们现有的和未来客户提供服务 - 同时继续作为独立品牌运营，并建立在令人难以置信的扭动优势。\n 我们最温暖，最衷心的感谢谢谢你们每一个修补师，他们都努力让我们到达我们今天的地方，以及我们的投资者，客户和其他支持者在多年来相信我们。\n 对于TINK的下一章，我们无法更加兴奋。让我们出去为新的金融世界推出权力！ ", "note_en": "We are thrilled to announce Visa is acquiring Tink. This is the beginning of a new chapter in open banking, and we couldn’t be more excited about what this means for our employees, our customers and the future of financial services.\n Partnering with Visa will allow Tink to further grow its organisation, products and services, to better serve existing and future customers.\n Tink and Visa share a common mission to connect the financial world and accelerate the growth and adoption of digital financial services.\n  Almost ten years ago we founded Tink on the idea that access to financial infrastructure should be for everyone. Since that day, each and every one of our colleagues has worked relentlessly to build technology that makes it easy for people to connect their bank accounts to a new generation of financial services. Services that are intuitive, effortless and enjoyable. Services that remove barriers that have stood in the way of innovation for years.\n From connecting the first 10 banks in Sweden, to being live in 18 markets supporting more than 3,400 financial institutions across Europe – we are so proud of what we all have achieved. Today, we are powering the pioneers – from thousands of startups to the largest and most progressive financial institutions in the world. The collective hard work of everyone at Tink is about to change the shape of the financial services industry forever.\n It is clear that we have all built something truly incredible at Tink, which has had a tremendous impact on our customers, on consumers and on society at large. But it’s also clear that we’ve only scratched the surface and that we’ve just gotten started.\n This is why we are thrilled to share the news that Tink is joining Visa.\n As we got to know Visa, it became clear that we share a common mission – to connect the financial world and accelerate the growth and adoption of digital financial services. Teaming up with Visa means we’ll now be able to move faster and reach further than ever before, and we know that Visa is the perfect partner for the next stage of our journey.\n We couldn’t be more excited for what this next phase means, for all of our colleagues, our customers and for the future of finance. This partnership reflects the contribution that every person at Tink has made over the past ten years, and the trust our customers have placed in us. Partnering with Visa will allow us to further grow our organisation, products and services, to better serve our existing as well as future customers - while continuing to operate as an independent brand and build on the incredible strengths of Tink.\n Our warmest, most heartfelt thank you goes to every Tinker, who has worked so hard to get us to where we are today, as well as to our investors, customers and other supporters for believing in us over the years.\n We couldn’t be more excited about this next chapter for Tink. Let’s go out and power the new world of finance!", "posttime": "2021-06-24 17:07:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "joining,客户", "title": "tink正在加入签证 ", "title_en": "Tink Is Joining Visa", "transed": 1, "url": "https://tink.com/blog/news/visa-acquires-tink/", "via": "", "real_tags": ["joining", "客户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几天前刚刚宣布，如果您在加利福尼亚接种疫苗，您可以通过转到数字Covid-19疫苗记录门户网站以QR码的形式获得疫苗接种录制的数字副本。 QR码如下所示：\n  但如果您尝试使用iOS相机扫描它，它只是说“找不到可用的数据”。 iOS 15将支持阅读智能保健卡，但直到下降至下降，直到那么我们拥有这些大多数无用的QR码。所以让我们和他们一起做点什么！\n 首先，它是一个巨大的QR码。那是因为它包含很多信息，包括：\n  基本上它拥有您在物理COVID-19疫苗接种卡上看到的一切，以及一些可以核实的东西。\n 当您扫描QR码时，您将留下一串数字：\n  您可以拍摄这些数字并通过将它们分成对成对将它们转换为Base64字符串，将每个对ASCII十进制添加到（45），并采用十进制总和的ASCII字符。例如，前两对是56和76.所以我们加入45 + 56 = 101，它表示为e和45 + 76 = 121，其表示为y并继续这样做，直到所有对完成，我们都有另一个长弦：\n  花费太多时间调试JWTS或OpenID Connect的读者将识别JWT的Telltale Ey前缀。事实上，将此投入JWT.IO将吐出我们的标题： \n有效载荷看起来有点古怪。那是因为它是一个Base64URL编码。我们可以解码此编码以获取一堆字节，然后使用膨胀算法向JSON字符串解压缩这些字节。\n  常量PAKO =需要（＆＃39; PAKO＆＃39）; VAR有效载荷=＆＃39; 3ZLLbtswEEV_JZhuZYkSVKfWLknRx6YokLSbwAuaGlsM-BD4MOIG-vfOyApaFEFWXYXQhpyZw3sv9QQ6RuhgSGmMXVXFEVUZrQxpQGnSUCoZ-ljho7SjwVhRd8YABbjdHrp63bStEJu2LtfvPxRwVNA9QTqNCN39H-a_uHfnzYo3sC1ABezRJS3Nbd49oEpM2Q86_MQQtXekry1FWdO1fHqdXW-QewJGn4PCu_lGWArFogCUN4ZoTCiALggnkkXkbMyPYKjheb4T1PC8eQH8XSZN82xbWjxDpNWGePBJZqWpctBHdGz7yqXBuxMd3ZawncjfTpP_jzIxqt6sNyvRrhoB01S8KKZ-XcxXa7PTv-TiKyaZcpzd8hMl7OnwKJXSDm98PxOU77U7zLrjKSa0y4vT4wzmsvThUHGwVdR9pY6PBFDzJDTiEqbtVMC4JDDL2WNAx9r-DpCavFI5zCU2e6ftGdHUK8EfYUcMex8s_UGsRarkAyN7HUcjOc2r65uLz-gwSHPxxcdRJ2koKArR-PQt2x2PgqDVvpJg8yYTbDb_N0Gx3nBhovUb＆＃39 ;; VAR字节= Buffer.from（有效载荷，＆＃39; base64＆＃39;）; var incollat​​edpayload = pako.inflateaw（bytes，{to：＆＃39; string＆＃39; string＆＃39;}）; console.log（充气般的覆盖）;\n  {＆＃34; ISS＆＃34 ;:＆＃34; https：//spec.smarthealth.cards/examples/issuer&&#34;＆＃34; nbf＆＃34 ;:1624400941.658，＆＃34; vc＆＃34; ：{＆＃34;类型＆＃34 ;: [＆＃34; https：//smarthealth.cards#health-card&#34; ]，＆＃34; credentialsubject＆＃34 ;: {＆＃34; fhirversion＆＃34 ;:＆＃34; 4.0.1＆＃34;＆＃34; fhirbundle＆＃34 ;: {＆＃34; resourcetype＆＃34; ：＆＃34;捆绑＆＃34 ;,＃34;类型＆＃34 ;:＆＃34;集合＆＃34;＆＃34;条目＆＃34 ;: [{＆＃34; fullull＆＃34 ;:＆＃ 34;资源：0＆＃34;＆＃34;资源＆＃34 ;: {＆＃34; resourceType＆＃34 ;:＆＃34;患者＆＃34;＆＃34;名称＆＃34 ;: [{＆＃ 34;家庭＆＃34 ;:＆＃34; fauci＆＃34 ;,＃34;给定＆＃34 ;: [＆＃34;安东尼＆＃34;＆＃34; s。＆＃34; ]}]，＆＃34;出生日胎＆＃34 ;:＆＃34; 1969-04-20＆＃34; }}，{＆＃34; fullul＆＃34 ;:＆＃34;资源：1＆＃34 ;,＆＃34;资源＆＃34 ;: {＆＃34; resourceType＆＃34 ;:＆＃34;免疫免疫＆＃34 ;，＆＃34;状态＆＃34 ;:＆＃34;完成＆＃34;＆＃34; vaccinecode＆＃34 ;: {＆＃34;编码＆＃34 ;: [{＆＃34;系统＆＃34 ;: ＆＃34; http：//hl7.org/fhir/sid/cvx&#34 ;,＆＃34;代码＆＃34 ;:＆＃34; 207＆＃34; }]}，＆＃34;患者＆＃34 ;: {＆＃34;参考＆＃34 ;:＆＃34;资源：0＆＃34; }，＆＃34;发生attencedateme＆＃34 ;:＆＃34; 2021-01-01＆＃34;，＆＃34;执行者＆＃34 ;: [{＆＃34;演员＆＃34 ;: {＆＃34;显示＆ ＃34 ;:＆＃34; ABC综合医院＆＃34; }}]，＆＃34; Lotnumber＆＃34 ;:＆＃34; 0000420＆＃34; }}，{＆＃34 ;:＆＃34;资源：2＆＃34;＆＃34;资源＆＃34 ;: {＆＃34; resourceType＆＃34 ;:＆＃34;免疫免疫＆＃34 ;，＆＃34;状态＆＃34 ;:＆＃34;完成＆＃34;＆＃34; vaccinecode＆＃34 ;: {＆＃34;编码＆＃34 ;: [{＆＃34;系统＆＃34 ;: ＆＃34; http：//hl7.org/fhir/sid/cvx&#34 ;,＆＃34;代码＆＃34 ;:＆＃34; 207＆＃34; }]}，＆＃34;患者＆＃34 ;: {＆＃34;参考＆＃34 ;:＆＃34;资源：0＆＃34; }，＆＃34;发生＆＃34 ;:＆＃34; 2021-01-29＆＃34;＆＃34;执行者＆＃34 ;: [{＆＃34;演员＆＃34 ;: {＆＃34;显示＆ ＃34 ;:＆＃34; ABC综合医院＆＃34; }}]，＆＃34; lotnumber＆＃34 ;:＆＃34; 0000069＆＃34; }}]}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}\n 关键是发行人。在这种情况下，发行人是https://spec.smarthealth.cards/examples/issuer。发行者在ISS值+ /.WELL-KNOWN/JWKS.JSON发布他们的公钥，所以我们应该能够转到https://spec.smarthealth.cards/examples/issuer/.well-known/jwks.json和下载他们：\n {＆＃34; keys＆＃34 ;: [{＆＃34; kty＆＃34 ;:＆＃34; ec＆＃34;＆＃34;孩子＆＃34 ;:＆＃34; 3kfdg-xwp-7gxyywtufuadwbumdopkmqx-iell11w9s＆ ＃34 ;,＆＃34;使用＆＃34 ;:＆＃34; sig＆＃34 ;,＆＃34; alg＆＃34 ;:＆＃34; es256＆＃34 ;,＆＃34; crv＆＃34 ;:＆ ＃34; p-256＆＃34 ;,＆＃34; x＆＃34 ;:＆＃34; 11xvrwy1i2s0eyjlyf_bwfw_tq5cjjnlw78bhxnxcgw＆＃34;＆＃34; y＆＃34 ;:＆＃34; ezxwxvo1hvcy0kucrpfko7yaymt6ajc3n7okab6vyy8＆＃34; }，......]}\n 不出所料，孩子匹配我们JWT标题中发现的孩子。通过使用公钥，我们可以验证此卡来自发行人，因为只有他们拥有签名所需的私钥。\n 当您从数字COVID-19疫苗记录门户中获取QR码时，这些是由https://myvaccinerecord.cdph.ca.gov/creeds发出的，因此可以在https：//myvaccinerecord.cdph中找到他们的公钥。 ca.gov/creds/.well-known/jwks.json。由于任何人都可以通过生成公共/私钥对来成为发行人，因此重要的是您确定您实际信任的发行人是重要的。 \n如果我们可以采取QR码，提取疫苗接种记录，并验证它是由国家发出的，我们可以将其整合到几乎任何内容！听我说。\n 如果我们阻止人们根据其疫苗接种状态访问内容怎么办？如果你无法阅读reddit，观看YouTube，或在Instagram上发布的情况怎么办，而无需首先证明您已被疫苗接种？我觉得我们很快就把数字相当快。\n 作为概念验证，我建立了一个疫苗接种PayWall，提供了如何完成的例子。在这个例子中，伟大的盖茨比的书的内容受疫苗接种付费墙保护。要阅读它，您只需从数字Covid-19疫苗记录门户中获取您的数字疫苗接种记录，按扫描数字Covid-19疫苗接种录制按钮并扫描。\n     尚未询问任何问题，因此下面的此常见问题解答部分代表经常预期的问题。\n      你认为一个不会接种疫苗的人甚至想读伟大的盖茨比吗？\n  我不是加利福尼亚州的居民，所以我无法测试这种疫苗接种付费墙。\n 此博客帖子顶部的QR码可用于测试PayWall。 \n这不是一个问题。加利福尼亚州建议您可以要求将扫描数码Covid-19疫苗中的QR码扫描QR码的组织记录它们将如何使用您的数据或者他们将保留它。只有您可以决定如何以及何时分享您的记录。\n  这些数据仅用于验证您的疫苗接种状态并在笑话的情况下显示它，以上伟大的盖茨比的文本。\n  不可以。您可以查看源代码，但您无法验证网站是否使用相同的代码，以便我不知道还有什么要告诉您的方式。\n  我不。如果您可以接种疫苗，并且您可以使用疫苗，并且您没有获得一个，您应该感到差。\n  在物理设置中，数字疫苗接种卡应该与另一个识别证明一起使用，如驾驶执照。这是棘手的在线。防止滥用的一种方法是只允许与一个帐户相关联的疫苗接种记录。您可以存储有效载荷的哈希值并检查它是否已被使用，而不是存储整个有效载荷。\n  不是真的，但我可以看到它被用作促销，比如作为在线服务的折扣或信用。如果Dunkin'甜甜圈和Krispy Kreme可以有疫苗激励计划，也许在线服务也可以？坦率地说，我真的没有得到疫苗激励计划，或彩票，或给人们接种疫苗。如果没有染色是不够的动力来获得疫苗，我不确定会有什么。 ", "note_en": "It was  just announced a few days ago that if you were vaccinated in California, you can get a digital copy of your vaccination record in the form of a QR code by going to the  Digital COVID-19 Vaccine Record portal. The QR code looks like this:\n  But if you try to scan it in with the iOS Camera, it just says “No usable data found”. iOS 15 will  support reading Smart Health cards but it won’t be released until the fall, so until then we have these mostly useless QR codes. So let’s do something with them!\n First of all, it’s a giant QR code. That’s because it contains a lot of information including:\n  Basically it has everything you see on your physical COVID-19 Vaccination card, as well as some stuff to make it verifiable.\n When you scan in the QR code, you’re left with a long string of numbers:\n  You can take those numbers and convert them to a base64 string by splitting them into pairs, adding each of those pairs to the ASCII decimal of  - (45), and taking the ASCII character of the decimal sum. For example, the first two pairs are 56 and 76. So we add 45 + 56 = 101 which is represented as  e and 45 + 76 = 121 which is represented as  y and keep doing that until all the pairs are done and we have another long string:\n  Readers that have spent too much time debugging JWTs or OpenID Connect will recognize the telltale  ey prefix of a JWT. In fact, throwing this into  jwt.io will spit out the header for us:\n  The payload looks a little wacky though. That’s because it’s a  base64url encoding. We can decode this encoding to get a bunch of bytes and then decompress those bytes using the INFLATE algorithm to a JSON string.\n  const pako = require(&#39;pako&#39;);var payload = &#39;3ZLLbtswEEV_JZhuZYkSVKfWLknRx6YokLSbwAuaGlsM-BD4MOIG-vfOyApaFEFWXYXQhpyZw3sv9QQ6RuhgSGmMXVXFEVUZrQxpQGnSUCoZ-ljho7SjwVhRd8YABbjdHrp63bStEJu2LtfvPxRwVNA9QTqNCN39H-a_uHfnzYo3sC1ABezRJS3Nbd49oEpM2Q86_MQQtXekry1FWdO1fHqdXW-QewJGn4PCu_lGWArFogCUN4ZoTCiALggnkkXkbMyPYKjheb4T1PC8eQH8XSZN82xbWjxDpNWGePBJZqWpctBHdGz7yqXBuxMd3ZawncjfTpP_jzIxqt6sNyvRrhoB01S8KKZ-XcxXa7PTv-TiKyaZcpzd8hMl7OnwKJXSDm98PxOU77U7zLrjKSa0y4vT4wzmsvThUHGwVdR9pY6PBFDzJDTiEqbtVMC4JDDL2WNAx9r-DpCavFI5zCU2e6ftGdHUK8EfYUcMex8s_UGsRarkAyN7HUcjOc2r65uLz-gwSHPxxcdRJ2koKArR-PQt2x2PgqDVvpJg8yYTbDb_N0Gx3nBhovUb&#39;;var bytes = Buffer.from(payload, &#39;base64&#39;);var inflatedPayload = pako.inflateRaw(bytes, { to: &#39;string&#39; });console.log(inflatedPayload);\n  { &#34;iss&#34;: &#34;https://spec.smarthealth.cards/examples/issuer&#34;, &#34;nbf&#34;: 1624400941.658, &#34;vc&#34;: { &#34;type&#34;: [ &#34;https://smarthealth.cards#health-card&#34; ], &#34;credentialSubject&#34;: { &#34;fhirVersion&#34;: &#34;4.0.1&#34;, &#34;fhirBundle&#34;: { &#34;resourceType&#34;: &#34;Bundle&#34;, &#34;type&#34;: &#34;collection&#34;, &#34;entry&#34;: [ { &#34;fullUrl&#34;: &#34;resource:0&#34;, &#34;resource&#34;: { &#34;resourceType&#34;: &#34;Patient&#34;, &#34;name&#34;: [ { &#34;family&#34;: &#34;Fauci&#34;, &#34;given&#34;: [ &#34;Anthony&#34;, &#34;S.&#34; ] } ], &#34;birthDate&#34;: &#34;1969-04-20&#34; } }, { &#34;fullUrl&#34;: &#34;resource:1&#34;, &#34;resource&#34;: { &#34;resourceType&#34;: &#34;Immunization&#34;, &#34;status&#34;: &#34;completed&#34;, &#34;vaccineCode&#34;: { &#34;coding&#34;: [ { &#34;system&#34;: &#34;http://hl7.org/fhir/sid/cvx&#34;, &#34;code&#34;: &#34;207&#34; } ] }, &#34;patient&#34;: { &#34;reference&#34;: &#34;resource:0&#34; }, &#34;occurrenceDateTime&#34;: &#34;2021-01-01&#34;, &#34;performer&#34;: [ { &#34;actor&#34;: { &#34;display&#34;: &#34;ABC General Hospital&#34; } } ], &#34;lotNumber&#34;: &#34;0000420&#34; } }, { &#34;fullUrl&#34;: &#34;resource:2&#34;, &#34;resource&#34;: { &#34;resourceType&#34;: &#34;Immunization&#34;, &#34;status&#34;: &#34;completed&#34;, &#34;vaccineCode&#34;: { &#34;coding&#34;: [ { &#34;system&#34;: &#34;http://hl7.org/fhir/sid/cvx&#34;, &#34;code&#34;: &#34;207&#34; } ] }, &#34;patient&#34;: { &#34;reference&#34;: &#34;resource:0&#34; }, &#34;occurrenceDateTime&#34;: &#34;2021-01-29&#34;, &#34;performer&#34;: [ { &#34;actor&#34;: { &#34;display&#34;: &#34;ABC General Hospital&#34; } } ], &#34;lotNumber&#34;: &#34;0000069&#34; } } ] } } }}\n The key  iss is the issuer. In this case, the issuer is  https://spec.smarthealth.cards/examples/issuer. Issuers publish their public keys at  iss value +  /.well-known/jwks.json so we should be able to go to   https://spec.smarthealth.cards/examples/issuer/.well-known/jwks.json and download them:\n { &#34;keys&#34;: [ { &#34;kty&#34;: &#34;EC&#34;, &#34;kid&#34;: &#34;3Kfdg-XwP-7gXyywtUfUADwBumDOPKMQx-iELL11W9s&#34;, &#34;use&#34;: &#34;sig&#34;, &#34;alg&#34;: &#34;ES256&#34;, &#34;crv&#34;: &#34;P-256&#34;, &#34;x&#34;: &#34;11XvRWy1I2S0EyJlyf_bWfw_TQ5CJJNLw78bHXNxcgw&#34;, &#34;y&#34;: &#34;eZXwxvO1hvCY0KucrPfKo7yAyMT6Ajc3N7OkAB6VYy8&#34; }, ... ]}\n Unsurprisingly, the  kid matches the  kid found in the header of our JWT. By using the public key, we can verify that this card came from the issuer because only they have the private key necessary to sign it.\n When you get a QR code from the  Digital COVID-19 Vaccine Record portal, these are issued by  https://myvaccinerecord.cdph.ca.gov/creds and thus their public keys can be found at   https://myvaccinerecord.cdph.ca.gov/creds/.well-known/jwks.json. Since anyone can be an issuer by generating public/private key pairs, it’s important that you identify which issuers you actually trust.\n If we can take a QR code, extract the vaccination record, and verify that it was issued by the state, we can integrate that into almost anything! Hear me out.\n What if we prevented people from accessing content based on their vaccination status? What if you couldn’t read Reddit, watch Youtube, or post on Instagram without first proving that you’ve been vaccinated? I think we’d up our numbers pretty quick.\n As a proof-of-concept, I’ve built a  vaccination paywall to provide an example of how this can be done. In this example, the contents of the book  The Great Gatsby are protected by a vaccination paywall. In order to read it, you simply have to get your digital vaccination record from  Digital COVID-19 Vaccine Record portal, press the  Scan Digital COVID-19 Vaccination Record button and scan it in.\n     No one has asked any questions yet, so this FAQ section below stands for Frequently Anticipated Questions.\n      Do you think that a person that won’t get vaccinated even wants to read  The Great Gatsby?\n  I’m not a resident of California so I have no way of testing this vaccination paywall.\n The QR code at the top of this blog post may be used to test the paywall.\n  That’s not a question. The  State of California suggests that you can ask organizations that will scan the QR code in your Digital COVID-19 Vaccine Record how they will use your data or if they will keep it. Only you can decide how and when to share your record.\n  The data is only used to verify your vaccination status and display it, in a joking matter, above the text of  The Great Gatsby.\n  No. You can look at the  source code but there’s no way for you to verify that the website is using the same code so I don’t know what else to tell you.\n  I do not. If you can be vaccinated and a vaccine is available to you and you’re not getting one,  you should feel bad.\n  In a physical setting, the digital vaccination card is supposed to be used in conjunction with another proof of identification, like a driver’s license. This is trickier online. One way to prevent abuse would be to only allow a vaccination record to be associated with a single account. Instead of storing the entire payload, you could store a hash of the payload and check if it’s already been used.\n  Not really, but I could see it being used as a promotion, like as a discount or credit for an online service. If Dunkin’ Donuts and Krispy Kreme can have vaccine incentive programs, maybe online services could too? Frankly, I don’t really get vaccine incentive programs, or lotteries, or giving people guns for getting vaccinated. If not dying is not enough of an incentive to get the vaccine, I’m not sure what will be.", "posttime": "2021-06-24 17:07:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "接种,paywalls,疫苗", "title": "疫苗接种PayWalls  -  Bertrand Fan ", "title_en": "Vaccination Paywalls – Bertrand Fan", "transed": 1, "url": "https://bert.org/2021/06/23/vaccination-paywalls/", "via": "", "real_tags": ["接种", "paywalls", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "2b1a1b60c4655670f9cc4940866db43c.jpg", "infoid": 1067922, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "26年后关闭在其领导作家国家安全法下的早晨逮捕，在最新的警察署在小号报纸上。 ", "note_en": "Shutdown after 26 years follows morning arrest under national security law of its lead editorial writer, in the latest police swoop on the tabloid-style newspaper.", "posttime": "2021-06-24 17:02:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,停止,daily,小号", "title": "苹果每日，香港的亲民主报纸停止出版 ", "title_en": "Apple Daily, Hong Kong's Pro-Democracy Newspaper to Stop Publishing", "transed": 1, "url": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3138399/national-security-law-apple-dailys-main-editorial", "via": "", "real_tags": ["苹果", "apple", "停止", "daily", "小号"]}, {"category": "", "categoryclass": "", "imagename": "8b8af62cebe28a94fa496bbd2aee25ca.jpg", "infoid": 1067921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦 - 英国立法者要求在苏格兰仓库调查后与科技巨头亚马逊国家经理会面，揭示了数千名未售出或退回的物品 - 包括电视，书籍，密封面罩和笔记本电脑 - 被公司摧毁。\n  ITV新闻在苏格兰镇的仓库仓库中的卧底调查，也显示了无人机，耳机，珠宝和无数其他高价值产品被放入标有“毁灭”之前的盒子，然后在巨大的卡车遵循填埋面填埋场之前网站和回收中心。调查表明，每年占数百万产品的破坏。\n 一位前员工告诉ITV消息，员工预计每周都会摆脱估计的130,000件物品。广播公司将练习描述为“浪费在令人惊讶的水平”。\n   随着社交媒体的愤怒，鲍里斯约翰·约翰逊总理答应了他会调查他说的指控“令人难以置信”。气候活动家Greta Thunberg抨击Twitter上的镜头。\n  “这只是一个仓库。如果您有一个可能的系统 - 甚至有利可图 - 这是一个明确的迹象，即某些东西是根本错误的，“Thunberg写道。\n 亚马逊在全球范围内运营175个中心，跨越超过1.5亿平方英尺的空间，员工准备装运物品并送到时钟的客户。\n  在一份声明的声明上，在周三向华盛顿邮报，亚马逊发言人矛盾的是ITV的指控，即该公司将物品送到垃圾填埋场，并补充说该位置也是回收站。 \n“我们正在努力实现零产品处置的目标，我们的优先事项是转售，捐赠给慈善组织或回收任何未售出的产品，＆＃34;声明说。 “没有物品在英国垃圾填埋场。作为最后的手段，我们将把物品寄给能源恢复，但我们努力推动它发生在零的次数。“\n 根据ITV，John Boumphrey，亚马逊的英国国家经理表示，该公司被摧毁的物品数量“非常小”。\n 自从原始调查分享以来，该公司以前在英国赫特福德郡的一家大型仓库雇用的另一名举报人表示，“从全新的iPhone到Playstations的很多东西”被摧毁，以及从未阅读过的书籍。\n  尚未确定的人还报告说，在全国各地的其他亚马逊中心工作的人面临着浪费的可用产品的类似账户。\n  ITV新闻指出，销毁货物的原因可能归因于亚马逊的商业模式。全球公司在网上购物巨头拥有的仓库商店。但是，如果物品未能出售，则收取一些费用的费用，有些人可能会努力支付，导致需要储存的堆积或倾销 - 其他地方。\n 反对派劳动党的立法者Siobhain McDonagh表示，该公司已摧毁了可能会使许多儿童遍布全国各地的物品 - 特别是在冠状病毒大流行中摧毁了物品。许多家庭在爆发期间努力向孩子们从家里教育，通常是不充分或有限的数字设备。\n  冠状病毒已经蹂躏英国，造成超过128,000人死亡，三个全国锁定，在全国范围内迫使学校关闭。 \n许多英国人，也关注调查，要求知道为什么当脆弱的人或慈善机构使用货物时倾倒出良好状态的物品。  最近联合国儿童基金（儿童基金会）的报告呼吁英国政府阻止英国年轻人所谓的“数字排除”。 它表示，数字访问是“不再是奢侈品”，但必须是“必须被视为基石，以确保每个孩子的社会正义和公平的生活机会”。  2019年，法国报纸Le Monde报道，亚马逊于2018年摧毁了估计的320万未售出的产品。“亚马逊，大规模毁灭性销售商”，标题读。  当天最重要的新闻故事，由邮政编辑策划并每天早上交付。 ", "note_en": "LONDON — British lawmakers are demanding a meeting with tech giant Amazon’s country manager after an investigation at a warehouse in Scotland revealed that thousands of unsold or returned items — including televisions, books, sealed face masks and laptops — were being destroyed by the company.\n  Footage from the undercover  investigation by ITV News at a warehouse in the Scottish town of Dunfermline, also showed drones, headphones, jewelry and countless other high-value products being placed into boxes labeled “destroy” before huge trucks were followed carrying the stock to landfill sites and recycling centers. The investigation said it amounted to the destruction of millions of products each year.\n One ex-employee told ITV News that workers were expected to get rid of an estimated 130,000 items a week. The broadcaster described the practice as “waste on an astonishing level.”\n   As outrage grew on social media, Prime Minister Boris Johnson promised that he would look into the allegations, which he said were “incredible.” Climate activist Greta Thunberg slammed the footage on Twitter.\n  “This is just ONE warehouse. If you have a system where this possible — and even profitable — that’s a clear sign that something is fundamentally wrong,” Thunberg  wrote.\n Amazon operates 175 centers worldwide, spanning more than 150 million square feet of space where employees prepare items to be shipped and delivered to customers around-the-clock.\n  In a statement emailed to The Washington Post on Wednesday, an Amazon spokesperson contradicted ITV’s allegation that the company was sending items to landfill sites, adding that the location was also a recycling site.\n   “We are working towards a goal of zero product disposal and our priority is to resell, donate to charitable organisations or recycle any unsold products,&#34; the statement said. “No items are sent to landfill in the UK. As a last resort, we will send items to energy recovery, but we’re working hard to drive the number of times this happens down to zero.”\n According to ITV, John Boumphrey, Amazon’s country manager for the United Kingdom, said the number of items being destroyed by the company was “extremely small.”\n Since the original investigation was shared,  another whistleblower who was previously employed by the company at a large warehouse in Hertfordshire, England, said that “lots of things from brand new iPhones to PlayStations” were destroyed, along with books that had never been read.\n  The man, who has not been identified, also reported that people working at other Amazon centers across the country had similar accounts of usable products going to waste.\n  ITV News noted that the reason for the destruction of the goods may be attributable to Amazon’s business model. Companies worldwide store items in warehouses owned by the online shopping giant. However, if the items fail to sell, they are charged rising fees that some may struggle to pay, leading to piles of goods that need to be stored — or dumped — elsewhere.\n Lawmaker Siobhain McDonagh of the opposition Labour Party  said it was “appalling” that the company had destroyed items that could have benefited many children across the country — especially amid the  coronavirus pandemic. Many families struggle to educate their children from home during the outbreak, often with inadequate or limited digital equipment.\n  The coronavirus has ravaged Britain, causing more than 128,000 deaths and three nationwide lockdowns that forced schools across the country to close.\n  Many Britons, also concerned by the investigation, demanded to know why items that appeared to be in good condition were being dumped when vulnerable people or charities could have used the goods.\n A recent  report from the United Nations Children’s Fund (UNICEF) called on the British government to stop what it called “digital exclusion” of young people in Britain. It said digital access was “no longer a luxury” but a necessity that “must be seen as the cornerstone to ensuring social justice and equitable life chances for every child.”\n   In 2019, the French newspaper Le Monde reported that Amazon destroyed an estimated 3.2 million unsold products in 2018. “Amazon, seller of mass destruction,” the headline at the time  read.\n     The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-06-24 16:25:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,摧毁,official,物品", "title": "亚马逊的镜头摧毁英国数千个未售出的物品提示呼吁官方调查 ", "title_en": "Footage of Amazon destroying thousands of unsold items in Britain prompts calls for official investigation", "transed": 1, "url": "https://www.washingtonpost.com/world/2021/06/23/amazon-uk-warehouses-destroy-items/", "via": "", "real_tags": ["amazon", "亚马逊", "摧毁", "official", "物品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 ：\r\r  作为一个展望，\r 或来自您的包裹经理（例如\r  Ubuntu或\r  pkgs.org）或直接从本网站\r  64bit 32bit.\n  A＆＃34;分层电子表格＆＃34;这是电子表格的大替代品，铭记映射器，outliners，pims，\r 文本编辑器和小型数据库。\n  适用于任何类型的数据组织，例如todo列表，日历，\r 项目管理，头脑风暴，组织理念，规划，要求\r 收集，呈现信息等\n  它像电子表格一样＆＃39;立即熟悉，但更适合\r 对于复杂数据，因为它＆＃39; s等级。\r   它和＃39; s喜欢映射器，但更具组织和紧凑。\r   它和＃39; s喜欢在一起，但在一个以上的维度。\r   它和＃39; s喜欢文本编辑器，但具有结构。\n  快速查看应用程序的样子\r  屏幕截图页面，看看它是多么容易\r  教程，然后给它一个下载（上面）。\r 有人制作的视频（在Linux上）\n  Treesheets非常小＆amp;快，所以可以坐在你的系统中\r 托盘始终：加载了几个文件，代表等效\r 几乎100页的文本，它仅在Windows上使用5MB内存\r 7（！）\n    加入\r  不和谐或\r  谷歌小组讨论。\r 抓取源代码\r  github或文件错误在那里报告/功能请求。\r 过去的捐款页面。\r  请亲自联系作者（Wouter Van Oortmerssen）。 ", "note_en": "D O W N L O A D :\r\r  As an  AppImage,\r or from your package manager (e.g.\r  Ubuntu or\r  pkgs.org) or directly from this site\r  64bit  32bit\n  A &#34;hierarchical spreadsheet&#34; that is a great replacement for spreadsheets, mind mappers, outliners, PIMs,\r text editors and small databases.\n  Suitable for any kind of data organization, such as todo lists, calendars,\r project management, brainstorming, organizing ideas, planning, requirements\r gathering, presentation of information, etc.\n  It&#39;s like a spreadsheet, immediately familiar, but much more suitable\r for complex data because it&#39;s hierarchical.\r   It&#39;s like a mind mapper, but more organized and compact.\r   It&#39;s like an outliner, but in more than one dimension.\r   It&#39;s like a text editor, but with structure.\n  Have a quick look at what the application looks like on the\r  screenshots page, see how easy it is to use in the\r  tutorial, then give it a download (above).\r A  video someone made (on Linux)\n  TreeSheets is exceptionally small &amp; fast, so can sit in your system\r tray at all times: with several documents loaded representing the equivalent\r of almost 100 pages of text, it uses only 5MB of memory on Windows\r 7 (!)\n    Join the\r  Discord or\r  google group for discussion.\r Grab the source code from\r  GitHub, or file bug reports there / feature requests there.\r The past  donations page.\r  contact the author (Wouter van Oortmerssen) personally.", "posttime": "2021-06-24 16:17:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,数据,cross,映射器", "title": "Treesheets：跨平台，自由形式数据管理器应用程序 ", "title_en": "Treesheets: cross-platform, free-form data organizer app", "transed": 1, "url": "http://strlen.com/treesheets/", "via": "", "real_tags": ["程序", "数据", "cross", "映射器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067919, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于694经典和当代小说的一个新的计算研究表明，语言的使用方式反映了男女之间的已知心理差异。\n  结果还表明，正如认知神经科学所预测的那样，同性恋男性作者用语言与直男性不同，实际上更接近妇女的写作，而女同性恋的女性的写作略微转向直男。\n 奥克兰大学博士博士使用了计算机化的文本分析，解剖了在19世纪初从19世纪初到现今的小说中番茄素质的妇女的写作方式。\n 他分析了6690万字，从主要由英国，美国和爱尔兰作者写的小说中。\n 异性恋作者的样本包括典当线的作品，如詹姆斯乔伊斯的尤利西斯，简奥斯汀的感觉和敏感，以及赫曼梅尔维尔的莫比迪克，以及当代畅销作者的作品。\n 同性恋样本包括1963年John Reghy's Nought的经典，1928年的Radclyffe Hall的孤独井，以及来自大量当代同性恋作者的小说。\n 在研究中，罗托博士说，与直男性相比，女性使用更多的社会词语，个人代词，积极的情感词和与悲伤和焦虑有关的词语。 \n“异性恋男性，相比之下，使用更多的文章，数字，空间词，死亡和愤怒相关的词，发誓词和反映分析思维的词语。”\n  只需通过分析特定小说中的个人代词，文章和数字的频率（由异性恋作者编写），他表示可以猜测作者的性别约72％的准确性。\n 他说，调查结果很大程度上与已知的心理性别差异相一致，如男性更高的系统性认知风格，朝着＆＃39的更高的定位;事物＆＃39;而不是人，更加明显的空间认知风格和能力 - 以及女性更明显的同情认知风格，情感和人们的定位。\n 他说，同性恋男性作者有一个女性典型的写作风格，其特点是认知过程词，社会词，个人代词，动词和与积极情绪，悲伤和焦虑有关的词语。\n “就像异性恋女性一样，同性恋者的文章频率较低，分析思维词，空间词，数字和死亡相关的词语而不是异性恋男性。通过男性作者分析个人代词，文章和数量的频率，可以猜测它们是否是异性恋或同性恋，精度大约69％。\n “同性恋的性别转变假设表明，同性恋男性是女性化的，同时在某些神经行为和心理特征上阳性妇女阳性。这种假设通常在心理学和认知神经科学中得到支持，但目前的研究为来自文学提供了新的支持，＆＃34为此提供了新的支持;他说。\n 罗托博士表示，整体结果表明，之前的语言使用的性别差异估计可能已经低估了。 \n“本研究介绍了比以前的语言使用性别差异的研究，包括出版年份，作者年龄，作者的性取向和书面领域，只有小说。 通过控制这些因素，这项研究的性别差异大得多比早先报道。“  他说，这个大型语料库的调查结果为66.9万字，表明了心理群体的基础是基于性别和性定向在语言使用中的两段文学中的语言用途。  “性取向的新发现对心理和语言学做出了特别重要的贡献，”他说。 ", "note_en": "A new computational study on 694 classic and contemporary novels suggests that how language is used reflects known psychological differences between men and women.\n  The findings also showed that, as predicted by cognitive neuroscience, gay male authors used language differently to straight men, in fact being closer to how straight women write, and lesbian women’s writing was slightly shifted towards that of straight men.\n Dr Severi Luoto from the University of Auckland used computerised text analysis to dissect the writing styles of men and women of differing sexual orientation in an electronic sample of novels spanning from the beginning of the 19th century to the present day.\n He analysed 66.9 million words in all, from novels that were written mainly by British, American and Irish authors.\n The sample by heterosexual authors included canonical works such as James Joyce’s  Ulysses, Jane Austen’s  Sense and Sensibility, and Herman Melville’s  Moby Dick, as well as works by contemporary bestselling authors.\n The homosexual samples included classics like John Rechy’s  City of Night from 1963 and Radclyffe Hall’s  The Well of Loneliness  from 1928, as well as novels from a large number of contemporary gay and lesbian authors.\n In the study Dr Luoto says that compared with straight men, women used more social words, personal pronouns, positive emotion words and words related to sadness and anxiety.\n “Heterosexual men, by contrast, used more articles, numbers, spatial words, death and anger-related words, swear words, and words that reflect analytical thinking.”\n  Simply by analysing the frequencies of personal pronouns, articles, and numbers in a given novel (written by a heterosexual author), he says it would be possible to guess the sex of the author with about 72 percent accuracy.\n He says the findings largely aligned with known psychological sex differences such as men’s higher systemising cognitive style, higher orientation towards &#39;things&#39; rather than people, and more pronounced spatial cognitive styles and abilities – as well as women’s more pronounced empathising cognitive style, emotionality, and people orientation.\n Fascinatingly, he says gay male authors had a female-typical writing style, characterised by high frequencies of cognitive process words, social words, personal pronouns, verbs, and words related to positive emotions, sadness, and anxiety.\n “Like heterosexual women, gay men had lower frequencies of articles, analytical thinking words, spatial words, numbers, and death-related words than heterosexual men. By analysing the frequencies of personal pronouns, articles, and numbers in a given novel by a male author, it would be possible to guess whether they are heterosexual or homosexual with approximately 69 percent accuracy.\n “The gender shift hypothesis of homosexuality suggests that homosexual men are feminised while homosexual women are masculinised on certain neuro-behavioural and psychological traits. This hypothesis is generally supported in psychology and cognitive neuroscience, but the current study provides new support for it from literature,&#34; he says.\n Dr Luoto says the overall results suggest that previous estimates about the magnitude of sex differences in language use may have been underestimated.\n “This study introduced stricter controls than previous studies on sex differences in language use, including publication year, authors’ age, authors’ sexual orientation, and domain of writing, with only novels included. With these factors controlled for, the magnitude of sex differences was much larger in this study than has been reported earlier.”\n He says the findings on this large corpus of 66.9 million words indicate how psychological group differences based on sex and sexual orientation manifest in language use across two centuries of literature.\n “The new findings on sexual orientation make a particularly important contribution to psychology and linguistics,” he says.", "posttime": "2021-06-24 16:17:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语言,centuries,作者", "title": "跨越几个世纪的语言揭示性定位 ", "title_en": "Language use across centuries reveals sexual orientation", "transed": 1, "url": "https://www.auckland.ac.nz/en/news/2021/06/15/language-use-across-centuries-reveals-sexual-orientation.html", "via": "", "real_tags": ["语言", "centuries", "作者"]}, {"category": "", "categoryclass": "", "imagename": "4ca010f8975fce44de34a88d5ccc4683.jpg", "infoid": 1067918, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（总体而言，明智的建立了双层股份结构，有两种阶段的股票，股票和B级股票，为了支持明智的关注其在公共市场转向公共市场的使命注意到。B级股票不是可交易的。）\n “该公司不会在A级股份上设定价格，或者提供与直接上市的任何阶级股份，”在声明中指出。 “股份的开盘价将在入场日期开放拍卖中确定。”虽然直接列表有点被取得了一条用于技术公司在美国公开的路线 - 另一个欧洲Juggernaut，Spotify的趋势 - 这是LSE的新转向，它在此过程中公布了自己的新规则聪明的日子宣布了它的计划。\n  与此同时，我们可以观看周围的更多详细信息，并在未来几天和几周内出现在招股说明书和其他相关陈述中。\n 绕过大型投资银行和更多传统上市的相关路线可以是一个大胆的举措，一个想要避免对该过程的波动和承诺的公司可能会选择他们觉得他们有足够的势头直接击中市场。今天明智的陈述暗示，基于其股份为智慧的客户提供了一些早期利息。\n “我很高兴地确认我们在伦敦直接上市的计划。这一过程将扩大明智的所有权，以支持我们的使命，以便在世界各地搬到世界各地的款项，“明智的主席和联合创始人在声明中的一个注释中。 “自从上周宣布预期的浮标意图，我们在我们的客户股东方案上有超过60,000个表达，其目的是旨在奖励购买明智股票并与我们坚持长期的客户。这个直接列表是关于我们的使命和我们的股东基地进一步调整，我非常自豪地为客户成为其中的一部分。“\n Wise是Fintech出来的欧洲巨大成功案例之一，而伦敦 - 公司成立于爱沙尼亚人Käärmann和塔韦特Hinrikus，即使通过Brexit的所有金融动荡，也陷入了困境。其1000万客户目前每月在跨境交易中处理大约70亿美元（50亿英镑），这仍然是其主要业务，即使它在新的财务服务的新相关领域多样化。在最近的财政年度，智慧的收入增长了5.86亿美元，高于4220万美元。税前代表5700万美元（4.1亿英镑），公司表示自2017年以来一直是有利可图的。\n B级股票将持有9票每股投票，严格不可转让，在其他投票权取消活动中，该公司确认的任何上市五周年过期。威斯威斯的股东和归属期权的持有人纳入2021年5月23日有权选择在1：1基础上获得额外的相应B股股份持有50％的股份持有股份持有股份（保存为KristoKäärmann，首席执行官和公司） - 它补充说，明智的明智者有权选择获得100％的班级持有本公司的股份持有额外的班级B股。 \n“凭借某些监管批准，凭借某些监管批准，凭借他们持有的B级股票，凭借股东，持有的股东不能持续超过35％的符合条件投票 任何股东决定（为kristoKäärmann保存），因为他的公司首席执行官，将在少于50％的符合条件的票据决定和 如果在任何时候，他不是公司的首席执行官，他将在任何股东决定的符合条件的投票的35％的人中覆盖。 B级股票是非可交易的，不会列出。“ ", "note_en": "(Overall,  Wise has put in place a dual-class share structure in place with two classes of shares in issue, class A shares and class B shares, in order to support Wise’s focus on its mission as it transitions into the public markets, it noted. Class B shares are not tradeable.)\n “The Company will not set a price in respect of the class A shares or offer any class A shares in connection with the direct listing,” it noted in the statement. “The opening price of the class A shares will be determined in the opening auction on the date of Admission.” While direct listings have somewhat taken off as a route for tech companies to go public in the U.S. — a trend spearheaded by another European juggernaut, Spotify — this is a new turn for the LSE, which  published its own new rules on the process the same day that Wise announced its plans.\n  In the meantime, we can watch for more details around the public offering, and updates about the company’s business, will be coming out in a prospectus and other related statements in the coming days and weeks.\n Bypassing the big investment banks and the related roadshow of a more conventional listing can be a bold move, one that companies who want to avoid the volatility and commitment of that process might opt to take if they feel they have enough momentum to hit the market directly. Wise in its statement today hinted that there has been some early interest, based on its share  offering to Wise customers.\n “I am pleased to confirm our plans for a direct listing in London. This process will broaden the ownership of Wise, in support of our mission to move money around the world faster, cheaper and more conveniently,” said Kristo Käärmann, CEO and co-founder of Wise, in a note in the statement. “Since announcing our expected intention to float last week, we’ve had over 60,000 expressions of interest in our customer shareholder programme, OwnWise, which is designed to reward customers who buy Wise shares and stick with us for the longer-term. This direct listing is about further aligning our mission and our shareholder base and I’m enormously proud that customers want to be a part of that.”\n Wise has been one of the huge success stories for fintech coming out of Europe, and London — founded by Estonians Käärmann and Taavet Hinrikus, the company’s been based out of London and has stuck with that even through all the financial turmoil of Brexit. Its 10 million customers currently process around $7 billion (£5 billion) in cross-border transactions every month, which remains its primary business even as it diversifies into newer, related areas of financial services. In its most recent financial year, Wise’s revenue grew to $586 million, up from $422 million. That represents $57 million (£41 million) in profit before tax, and the company says it has been profitable since 2017.\n Class B shares will hold 9 votes per share, are strictly non-transferable and, amongst other voting right cancellation events, expire on the fifth anniversary of any listing, the company confirmed. Wise’s shareholders and holders of vested options as at 23 May 2021 are entitled to elect to receive 50% of their class A share holding in the Company with additional corresponding class B shares on a 1:1 basis (save for Kristo Käärmann, CEO and co-founder of Wise, who is entitled to elect to receive 100% of his class A share holding in the Company with additional corresponding class B shares on a 1:1 basis), it added.\n “The voting rights attaching to the class B shares are, subject to certain regulatory approvals, capped so that no shareholder can, by virtue of the class B shares they hold, cast more than one vote less than 35% of the eligible votes in respect of any shareholder decision (save for Kristo Käärmann who, for so long as he is CEO of the Company, will be capped in respect of his class B shares at one vote less than 50% of the eligible votes in respect of any shareholder decision and if, at any time, he is not CEO of the Company he will be capped at one below 35% of the eligible votes in respect of any shareholder decision). The class B shares are non-tradeable and will not be listed.”", "posttime": "2021-06-24 15:35:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "报道,transferwise", "title": "智典（以前转移）在7月初的LSE上证实直接上市，据报道，估值为6B-$ 7B ", "title_en": "\n\t\t\t\tWise (formerly TransferWise) confirms direct listing on the LSE in early July, reportedly at a $6B-$7B valuation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/wise-formerly-transferwise-confirms-direct-listing-on-the-lse-in-early-july-reportedly-at-a-6b-7b-valuation/", "via": "", "real_tags": ["报道"]}, {"category": "", "categoryclass": "", "imagename": "58a8034eb6528ae6cb9cb2ac66ec89cb.jpg", "infoid": 1067917, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sorbet表示，它从雇主中消除了PTO的负担，让员工在提供的优惠和其他类型的优惠中“花费”，让雇主对整个过程进行更远的控制和预测的能力。它通过从员工购买PTO负债并在预付信用卡上加载PTO的现金价值来实现这一目标。然后，它为雇主融化了这些负债，因此预测优势。\n veetahl eilat-raichel，创始人兼首席执行官说：“很明显，我们在雇主 - 员工动态的构造转变中，累计全球利益超出了我们最疯狂的期望，我有很大的挑选和选择最佳投资者帮助我们扩大和加速。我可以想到没有比DOVI和整个第11队加入我们的更好的合作伙伴，并且很激动，谦卑地让他们和我们已经恒星的投资者群体一起。“\n  第11组创始合作伙伴的Dovi Frances表示：“在第11组，我们以我们独特地揭开明天unicorns的独特能力来骄傲。 Veetahl和团队做了一些非常困难的事情，这是揭示掩盖掩盖的大量市场效率。凭借270亿美元的市场机会，这是我的晶体对我来说是时候推进而不是回头看。“ ", "note_en": "Sorbet says it removes the burden of PTO from employers, allowing employees to ‘spend’ it in offers and other types of deals, giving employers far more control over the whole process and the ability to forecast ahead. It does this by buying out PTO liabilities from employees and loading the cash value of the PTO on prepaid Credit Cards. It then refinances these liabilities for employers, hence the forecasting advantage.\n Veetahl Eilat-Raichel, founder and CEO, said: “It’s clear that we’re in the midst of a tectonic shift in employer-employee dynamics and with inbound global interest exceeding our wildest expectations, I had the great privilege of picking and choosing the best investors to help us expand and accelerate. I can think of no better partner than Dovi and the entire Group 11 team to join us, and am thrilled and humbled to have them alongside our already stellar group of investors.”\n  Dovi Frances, Founding Partner, Group 11 said: “At Group 11 we pride ourselves in our unique ability to uncover the unicorns of tomorrow. Veetahl and the team did something exceedingly difficult which is to uncover a massive market inefficiency hiding in plain sight. With a $270B market opportunity, it was crystal clear to me this was the time to push forward and not look back.”", "posttime": "2021-06-24 15:35:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "时间,pto", "title": "有偿时间脱离冰糕卷轴 - 在三个月内在另外1500万美元 ", "title_en": "\n\t\t\t\tPaid Time Off startup Sorbet reels-in another $15M inside three months\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/paid-time-off-startup-sorbet-reels-in-another-15m-inside-three-months/", "via": "", "real_tags": ["时间", "pto"]}]