[{"category": "", "categoryclass": "", "imagename": "ed3d7987b7a68c78405d9ab0bfd6d392.png", "infoid": 1070289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用易于使用的 API 和工具在几分钟内构建令人惊叹的实时协作体验 创建出色的创意工具极其困难。用户可以选择成千上万条路径，用户体验的每个方面都必须仔细考虑并优化性能。当您尝试在此基础上添加实时协作时，您可以确保几乎没有时间专注于产品的核心用户体验。这就是我们创建 Liveblocks 的原因，这是一组工具和 API，可帮助您创建令人惊叹的实时协作体验。使用 Liveblocks，您可以在几分钟内进行任何协作，从而使您的核心产品得到应有的关注。在过去十年中，我们的合作方式发生了重大变化。大流行大大加速了向远程工作的转变。现在有数百万人在家工作，不再需要花几个小时通勤到办公室。但随着向远程工作的转变，建立有意义的关系和与人合作变得更加困难。 Buffer 对 2,300 名远程工作者的调查发现，16% 的人表示他们在协作和沟通方面遇到困难，另有 16% 的人表示他们在孤独中挣扎。当我们在同一个物理空间一起工作时，协作会自然地发生在白板前、会议室中，或者只是走到某人的办公桌前。随着越来越多的人开始远程工作，我们开始看到视频会议解决方案，只有通过共享屏幕的低质量图像才能真正实现协作。一个很好的改进，但并不理想。大多数在线表单、仪表板和工具仍需要您刷新页面以查看其他人已更改的内容。当你的互联网连接中断，你有机会打“保存”按钮之前，你知道你刚刚失去了工作时间。\n这是为什么？构建和维护高性能、可靠且可扩展的实时协作基础在技术上是困难的，而且成本极其高昂。只有少数拥有高度专业化工程师的公司能够做到这一点。我们认为，大规模解决远程协作问题的最佳方法是提供世界一流的基础设施，公司可以利用这些基础设施为他们为用户创造的数字体验提供动力。使用 Liveblocks，您可以轻松构建高性能的多人创意工具，使您的表单实时协作，甚至将实时光标添加到您现有的产品中。 Liveblocks 使我们能够在数小时而不是数周内为我们的应用程序添加实时状态，而且我们不必担心维护。对于任何构建协作体验的人来说，这都是轻而易举的事情。为此，我们为您提供了无缝协作的不同构建块：存在块、存储块和评论块。它们的设计考虑了特定的用例，可帮助您以最快的方式创建完全可定制的协作体验。另外，您可以决定使用哪个块，这样您就不会因为不需要的功能而使代码库膨胀。今天，我们很高兴向您介绍我们的第一个构建块：存在块。这非常适合让人们感觉好像他们在同一个房间里一样。只需几行代码，您就可以轻松地将实时光标和实时头像等内容集成到您的产品中。下面是一个示例，展示了我们的 React API 的外观。存在块现在可供所有人使用。存储和评论块目前处于私人测试阶段，并将在今年晚些时候更广泛地提供。\n只需几行代码就可以将实时光标添加到我的网站，这很神奇，而且非常有趣。设置起来非常简单快捷。 Liveblocks 使每个开发人员都可以构建实时体验。使用 Liveblocks 构建不仅可以提高产品的质量和用户体验，还可以帮助公司更快地发货并每年节省数十万美元的开发和维护成本。如果不是开源社区、研究人员以及 Figma 和 Google 等公司铺平了道路并向世界展示了创造令人难以置信的协作体验实际上是可能的，Liveblocks 就不会存在今天。他们都帮助我们取得了今天的成就，对此我们深表感谢。我们非常高兴能够解决这个问题并在完成这一使命中发挥我们的作用。如果这是您想参与的工作，我们正在招聘！请申请并将其发送给您认为愿意为此工作的任何人。", "note_en": "Build amazing real‑time collaborative experiences in minutes with easy‑to‑use APIs and tools\n  Creating great creative tools is extremely difficult. There are thousands of paths a user could take, and every aspect of the user experience has to be carefully considered and optimized for performance. And when you try to add real‑time collaboration on top of that, you can be sure that you’re left with almost no time to focus on the core user experience of your product.\n That’s why we created Liveblocks, a set of tools and APIs that helps you create amazing real‑time collaborative experiences. With Liveblocks, you can make anything collaborative in minutes so that you can give your core product the attention it deserves.\n    The way we work together has gone through a major change in the past decade. The pandemic accelerated the shift to remote work significantly. Millions of people now work from home and no longer have to spend hours commuting to an office.\n But with that shift to remote work, building meaningful relationships and collaborating with people became a lot more difficult.  Buffer’s survey of 2,300 remote workers found that 16% of people reported they had difficulties with collaboration and communication, and another 16% reported they struggled with loneliness.\n  When we all worked together in the same physical space, collaboration would happen naturally in front of a whiteboard, in a meeting room, or simply by walking over to someone’s desk. As more people started working remotely, we then started to see video conferencing solutions where collaboration could only really happen by sharing a low-quality image of your screen. A good improvement, but not ideal.\n Most online forms, dashboards, and tools still require you to refresh the page to see what other people have changed. And when your internet connection drops before you’ve had a chance to hit the &#34;Save&#34; button, you know you’ve just lost hours of work.\n Why is that? Building and maintaining a performant, reliable, and scalable real‑time collaborative foundation is technically difficult and extremely expensive. Only a few companies with highly specialized engineers have been able to pull this off.\n   We believe the best way to solve the remote collaboration problem at scale is by providing a world-class infrastructure that companies can leverage to power the digital experiences they create for their users.\n With Liveblocks, you can easily build a performant multiplayer creative tool, make your forms real‑time collaborative, or even add live cursors to your existing product.\n Liveblocks enabled us to add real‑time presence to our application in hours instead of weeks and we don’t have to worry about maintenance. This is a no‑brainer for anyone building collaborative experiences.\n To do that, we provide you with different building blocks that work seamlessly together: the presence block, the storage block, and the comment block. They’re designed with specific use cases in mind to help you create fully customizable collaborative experiences in the fastest way possible. Plus, you can decide which block to use so you’re not bloating your codebase with features you don’t need.\n  Today, we’re excited to introduce you to our first building block: the presence block. It’s great for making people feel as if they were together in the same room. You can easily integrate things like  real‑time cursors and  live avatars to your product with just a few lines of code. Below is an example showing how our React APIs look like.\n  The presence block is now available for everyone. The storage and comment blocks are currently in private beta and will be available more broadly later this year.\n Adding real‑time cursors to my website with just a few lines of code was magic, and just plain fun. It was so easy and fast to set up. Liveblocks makes building real‑time experiences accessible to every developer.\n Building with Liveblocks not only improves a product’s quality and user experience but also helps companies ship faster and save hundreds of thousands of dollars in development and maintenance costs every year.\n Liveblocks wouldn’t exist today if it wasn’t for the open‑source community, researchers, and companies like Figma and Google who have paved the way and showed the world that creating incredible collaborative experiences was actually possible. They all helped us get to where we are today, and we’re truly thankful for that.\n We couldn’t be more excited to solve this problem and play our part in fulfilling this mission. If this is an endeavor you’d like to be a part of,  we’re hiring! Please apply and send this along to anyone that you think would be jazzed to work on this.", "posttime": "2021-07-29 22:09:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产品,add,协作", "title": "Liveblocks：在几分钟内为您的产品添加实时协作", "title_en": "Liveblocks: Add real‑time collaboration to your product in minutes", "transed": 1, "url": "https://liveblocks.io/blog/introducing-liveblocks", "via": "", "real_tags": ["产品", "add", "协作"]}, {"category": "", "categoryclass": "", "imagename": "832a6c756d867847f0d64d1b0226727e.png", "infoid": 1070288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我一直在探索一种用于发布网站的架构模式，我称之为“烘焙数据”模式。它提供了静态站点生成器的许多优点，同时避免了它们的大部分限制。我认为它值得被更广泛地使用。烘焙数据：将数据的只读副本与应用程序的代码捆绑在一起，作为同一部署的一部分 大多数动态网站将其代码和数据分开：代码在应用程序服务器上运行，数据以某种形式独立存在外部数据存储——比如 PostgreSQL、MySQL 或 MongoDB。使用烘焙数据，数据被部署为应用程序包的一部分。每当内容发生更改时，都会部署包含这些更新的站点的全新副本。为此，我主要使用 SQLite 数据库文件，但许多其他格式也可以在这里使用。这对于所谓的“无服务器”部署平台特别有效——支持无状态部署并且只对用于服务传入请求的资源收费（“缩放到零”）的平台。由于对数据的每次更改都会导致全新部署，因此这种模式不适用于经常更改的站点——但根据我的经验，许多面向内容的站点每天最多更新几次内容。考虑博客、文档网站、项目网站——任何内容由一小群作者编辑的地方。\n主机便宜。任何可以运行应用程序代码的地方都可以托管烘焙数据应用程序——无需为托管数据库系统支付额外费用。将无服务器主机（例如 Cloud Run、Vercel 或 AWS Lambda）扩展到零，每月只需为低流量部署收取几美分的费用。易于扩展。需要处理更多流量？运行应用程序及其捆绑数据的更多副本。水平扩展烘焙数据应用程序是微不足道的。它们也非常适合在 Cloudflare 或 Fastly 等缓存代理 CDN 后面运行——当您部署新版本时，您可以清除整个缓存。很难打破。在 VPS 上托管服务器端应用程序总是令人不安，因为可能出错的地方太多了——服务器可能受到威胁，或者流氓日志文件可能导致磁盘空间不足。对于烘焙数据，最糟糕的情况是您需要重新部署应用程序——完全没有数据丢失的风险，并且可以自动重启代码的提供者可以自动从错误中恢复。支持服务器端功能。静态站点生成器提供了许多上述优点，但存在任何动态功能都需要在客户端 JavaScript 中实现的限制。使用烘焙数据应用程序，您也可以执行服务器端代码。模板化页面。对静态站点生成器的另一个改进：如果您有 10,000 个页面，则静态站点生成器将需要生成 10,000 个 HTML 文件。使用烘焙数据，这 10,000 个页面可以作为单个 SQLite 数据库文件中的行存在，并且可以在运行时使用服务器端模板生成这些页面。易于支持多种格式。由于您的内容位于动态数据存储中，因此以替代格式输出相同的内容很容易。我为此使用了 Datasette 插件：datasette-atom 可以从 SQL 查询生成 Atom 提要，而 datasette-ics 对 iCalendar 提要执行相同的操作。与版本控制很好地集成。我喜欢将我的网站内容置于版本控制之下。烘焙数据模式适用于从 git 存储库读取内容并使用它来构建与部署捆绑在一起的资产的构建脚本。\n我对烘焙数据的最初实现都使用了 SQLite。它是此类应用程序的理想格式：一个二进制文件，可以存储任何可以表示为关系表、JSON 文档或二进制对象的东西——基本上是任何东西。任何可以由您的动态服务器端代码从磁盘读取的格式也可以使用：YAML 或 CSV 文件、Berkeley DB 文件或任何其他可以由磁盘文件中的只读字节存储桶表示的任何格式。 [我有一种预感，你甚至可以使用 PostgreSQL、MySQL 或 Elasticsearch 之类的东西，通过打包它们的磁盘表示并将它们作为 Docker 容器的一部分发送，但我自己还没有尝试过。] 一旦你的数据在文件中可用，您的应用程序代码可以从该文件中读取并使用它来生成和返回网页。您可以使用任何服务器端语言编写执行此操作的代码。我使用 Python，通常与我的 Datasette 应用程序服务器一起使用，它可以从 SQLite 数据库文件中读取并使用 Jinja 模板生成页面。最后一块拼图是构建和部署脚本。我为此使用 GitHub Actions，但任何 CI 工具都可以在这里很好地工作。该脚本将站点内容构建为可部署资产，然后将该资产与应用程序代码一起部署到托管平台。我自己发布的最复杂的 Baked Data 站点是我的 Datasette 项目的官方网站，datasette.io——这个 repo 中的源代码。\n该站点是使用 Cloud Run 部署的。它实际上是一个高度自定义的 Datasette 实例，使用主页的自定义模板、站点其他部分的自定义页面和 datasette-template-sql 插件来执行 SQL 查询并显示来自这些模板的结果。 content.db 包含大部分站点内容。它是通过 build.sh 脚本在 GitHub Actions 中构建的，它执行以下操作：使用 markdown-to-sqlite 将 for/ 文件夹（Datasette 的用例）中的 markdown 文件导入到 uses 表中。使用来自更多 YAML 文件的数据填充 plugin_repos 和 tool_repos 单列表。这些将在下一步中使用。运行 build_directory.py Python 脚本。这使用 GitHub GraphQL API 来获取有关所有这些插件和工具存储库的信息，包括它们的 README 文件和它们最近的标记版本。使用所有 Datasette 生态系统 PyPI 包的最新下载统计信息填充统计表。该数据是从我的 simonw/package-stats 存储库中的 stats.json 文件导入的，该存储库本身由在 GitHub Actions 中运行的这个 git 抓取脚本填充。我也将它用于我的 Datasette Downloads Observable 笔记本。 blog.db 包含来自我的博客的内容，这些内容带有任何数据集、dogsheep 或 sqliteutils 标签。这是由 fetch_blog_content.py 脚本获取的，该脚本为我的博客内容点击分页的每个标签 Atom 提要，在 Django 中实现。 docs-index.db 是一个数据库表，包含最新稳定 Datasette 版本的文档，按部分分解。这个数据库文件是从一个单独的站点 stable-docs.datasette.io 下载的，它是作为 Datasette 发布过程的一部分构建和部署的。\ndogsheep-index.db 是支持站点搜索的搜索索引（例如，此搜索 dogsheep）。搜索索引由 dogsheep-beta 使用从此 YAML 文件配置的其他数据库文件中的表中提取的数据构建。该站点每天通过计划操作自动部署一次，如果我想确保新的软件版本反映在主页上，我也可以手动触发该操作。 Niche Museums 是关于我参观过的小型博物馆的博客。同样，它是带有自定义模板的 Datasette。大部分内容来自这个museums.yaml 文件，但我也运行了一个脚本来确定每个项目是何时从 git 历史记录中创建或更新的。我的 TILs 站点在 Vercel 上运行，并通过此构建脚本（填充此 tils 表）从我的 simonw/til GitHub 存储库构建。它使用 GitHub API 将 GitHub Flavored Markdown 转换为 HTML。我还运行了一个脚本，该脚本生成每个页面的小屏幕截图，并将它们存放在 SQLite 的 BLOB 列中，以提供社交媒体预览卡，请参阅我的 TIL 的社交媒体卡。在一个我自己没有工作过的站点中，我最喜欢的这种模式的例子是 Mozilla.org。他们于 2018 年开始在他们称为 Bedrock 的系统中使用 SQLite——Paul McLanahan 详细描述了其工作原理。他们的网站内容存在于一个约 22MB 的 SQLite 数据库文件中，该文件被构建并上传到 S3，然后定期下载到他们的每个应用程序服务器。\n您可以查看他们的健康检查页面以查看上次下载数据库的时间，并自己获取 SQLite 文件的副本。使用 Datasette 探索这一点很有趣：静态站点生成器在过去十年中大受欢迎。它们将托管站点的成本降低到几乎为零，提供出色的性能，与 CDN 配合良好，并生成极不可能损坏的站点。谨慎使用，烘焙数据保留了大部分这些特征，同时仍然支持服务器端代码执行。 datasette.io 提供 1,588 种不同内容的搜索，以及在插件和工具页面上更简单的搜索。所有三个站点都提供使用服务器端 SQL 查询配置的 Atom 提要：Datasette、Niche Museums、TIL。 Niche Museums 提供了一个“使用我的位置”按钮，然后可以使用利用 datasette-haversine 插件的 SQL 查询为您附近的博物馆提供服务。当用于大型站点时，对静态站点生成器的一个常见抱怨是，如果构建器必须生成数万个页面，则构建时间会变得很长。\n使用烘焙数据，单个模板文件和 SQLite 数据库表中的 10,000 行可以生成 10,000 个页面。这也使得开发过程中的迭代周期更快：您可以编辑模板并点击“刷新”以立即查看新模板呈现的任何页面，而无需重建任何页面。如果您想尝试烘焙数据模式，我建议您开始使用 Datasette、GitHub Actions 和 Vercel 的组合。希望我上面提供的示例是一个很好的起点——如果有任何问题，也可以随时在 Twitter 或 Datasette 讨论论坛上与我联系。", "note_en": "I’ve been exploring an architectural pattern for publishing websites over the past few years that I call the “Baked Data” pattern. It provides many of the advantages of static site generators while avoiding most of their limitations. I think it deserves to be used more widely.\n  Baked Data: bundling a read-only copy of your data alongside the code for your application, as part of the same deployment\n Most dynamic websites keep their code and data separate: the code runs on an application server, the data lives independently in some kind of external data store—something like PostgreSQL, MySQL or MongoDB.\n With Baked Data, the data is deployed as part of the application bundle. Any time the content changes, a fresh copy of the site is deployed that includes those updates.\n I mostly use SQLite database files for this, but plenty of other formats can work here too.\n This works particularly well with so-called “serverless” deployment platforms—platforms that support stateless deployments and only charge for resources spent servicing incoming requests (“scale to zero”).\n Since every change to the data results in a fresh deployment this pattern doesn’t work for sites that change often—but in my experience many content-oriented sites update their content at most a few times a day. Consider blogs, documentation sites, project websites—anything where content is edited by a small group of authors.\n   Inexpensive to host. Anywhere that can run application code can host a Baked Data application—there’s no need to pay extra for a managed database system. Scale to zero serverless hosts such as  Cloud Run,  Vercel or  AWS Lambda will charge only cents per month for low-traffic deployments.\n Easy to scale. Need to handle more traffic? Run more copies of your application and its bundled data. Horizontally scaling Baked Data applications is trivial. They’re also a great fit to run behind a caching proxy CDN such as Cloudflare or Fastly—when you deploy a new version you can purge that entire cache.\n Difficult to break. Hosting server-side applications on a VPS is always disquieting because there’s so much that might go wrong—the server could be compromised, or a rogue log file could cause it to run out of disk space. With Baked Data the worst that can happen is that you need to re-deploy the application—there’s no risk at all of data loss, and providers that can auto-restart code can recover from errors automatically.\n Server-side functionality is supported. Static site generators provide many of the above benefits, but with the limitation that any dynamic functionality needs to happen in client-side JavaScript. With a Baked Data application you can execute server-side code too.\n Templated pages. Another improvement over static site generators: if you have 10,000 pages, a static site generator will need to generate 10,000 HTML files. With Baked Data those 10,000 pages can exist as rows in a single SQLite database file, and the pages can be generated at run-time using a server-side template.\n Easy to support multiple formats. Since your content is in a dynamic data store, outputting that same content in alternative formats is easy. I use Datasette plugins for this:  datasette-atom can produce an Atom feed from a SQL query, and  datasette-ics does the same thing for iCalendar feeds.\n Integrates well with version control. I like to keep my site content under version control. The Baked Data pattern works well with build scripts that read content from a git repository and use it to build assets that are bundled with the deployment.\n  My initial implementations of Baked Data have all used SQLite. It’s an ideal format for this kind of application: a single binary file which can store anything that can be represented as relational tables,  JSON documents or  binary objects—essentially anything at all.\n Any format that can be read from disk by your dynamic server-side code will work too: YAML or CSV files, Berkeley DB files, or anything else that can be represented by a bucket of read-only bytes in a file on disk.\n [I have a hunch that you could even use something like PostgreSQL, MySQL or Elasticsearch by packaging up their on-disk representations and shipping them as part of a Docker container, but I’ve not tried that myself yet.]\n Once your data is available in a file, your application code can read from that file and use it to generate and return web pages.\n You can write code that does this in any server-side language. I use Python, usually with my  Datasette application server which can read from a SQLite database file and use  Jinja templates to generate pages.\n The final piece of the puzzle is a build and deploy script. I use GitHub Actions for this, but any CI tool will work well here. The script builds the site content into a deployable asset, then deploys that asset along with the application code to a hosting platform.\n  The most sophisticated Baked Data site I’ve published myself is the official website for my Datasette project,  datasette.io—source code  in this repo.\n  The site is deployed using Cloud Run. It’s actually a heavily customized Datasette instance, using  a custom template for the homepage,  custom pages for other parts of the site and the  datasette-template-sql plugin to execute SQL queries and display their results from those templates.\n  content.db has most of the site content. It is built inside GitHub Actions by the  build.sh script, which does the following: Import the markdown files from the  for/ folder (use-cases for Datasette) into the  uses table using  markdown-to-sqlite.\n Populate the  plugin_repos and  tool_repos single-column tables using data from more YAML files. These are used in the next step.\n Runs the  build_directory.py Python script. This uses the GitHub GraphQL API to fetch information about all of those plugin and tool repositories, including their README files and their most recent tagged  releases.\n Populates a  stats table with the latest download statistics for all of the Datasette ecosystem PyPI packages. That data is imported from a  stats.json file in my  simonw/package-stats repository, which is itself populated by this  git scraping script that runs in GitHub Actions. I also use this for my  Datasette Downloads Observable notebook.\n blog.db contains content from my blog that carries any of the  datasette,  dogsheep or  sqliteutils tags. This is fetched by the  fetch_blog_content.py script, which hits the paginated per-tag Atom feed for my blog content,  implemented in Django here.\n docs-index.db is a database table containing the documentation for the most recent stable Datasette release, broken up by  sections. This database file is downloaded from a separate site,  stable-docs.datasette.io, which is built and deployed as  part of Datasette’s release process.\n dogsheep-index.db is the search index that powers site search (e.g.  this search for dogsheep). The search index is built by  dogsheep-beta using data pulled from tables in the other database files, as configured by  this YAML file.\n The site is automatically deployed once a day by  a scheduled action, and I can also manually trigger that action if I want to ensure a new software release is reflected on the homepage.\n   Niche Museums is my blog about tiny museums that I’ve visited. Again, it’s Datasette with custom templates. Most of the content comes from this  museums.yaml file, but I also run  a script to figure out when each item was created or updated from the git history.\n My TILs site runs on  Vercel and is built from my  simonw/til GitHub repository by  this build script (populating  this tils table). It uses the GitHub API to convert GitHub Flavored Markdown to HTML. I’m also running  a script that generates small screenshots of each page and stashes them in a BLOB column in SQLite in order to provide social media preview cards, see  Social media cards for my TILs.\n My favourite example of this pattern in a site that I haven’t worked on myself is  Mozilla.org.\n They started using SQLite back in 2018 in a system they call Bedrock—Paul McLanahan provides  a detailed description of how this works.\n Their site content lives in a ~22MB SQLite database file, which is built and uploaded to S3 and then downloaded on a regular basis to each of their application servers.\n You can view  their healthcheck page to see when the database was last downloaded, and grab a copy of the SQLite file yourself. It’s fun to explore that using Datasette:\n   Static site generators have exploded in popularity over the past ten years. They drive the cost of hosting a site down to almost nothing, provide excellent performance, work well with CDNs and produce sites that are extremely unlikely to break.\n Used carefully, the Baked Data keeps most of these characteristics while still enabling server-side code execution.\n  datasette.io  provides search across 1,588 different pieces of content, plus  simpler search on the plugins and tools pages.\n  All three sites provide Atom feeds that are configured using a server-side SQL query:  Datasette,  Niche Museums,  TILs.\n Niche Museums offers a “Use my location” button which then serves  museums near you, using  a SQL query that makes use of the  datasette-haversine plugin.\n A common complaint about static site generators when used for larger sites is that build times can get pretty long if the builder has to generate tens of thousands of pages.\n With Baked Data, 10,000 pages can be generated by a single template file and 10,000 rows in a SQLite database table.\n This also makes for a faster iteration cycle during development: you can edit a template and hit “refresh” to see any page rendered by the new template instantly, without needing to rebuild any pages.\n  If you want to give the Baked Data pattern a try, I recommend starting out using the combination of  Datasette,  GitHub Actions and  Vercel. Hopefully the examples I’ve provided above are a good starting point—also feel free to reach out to me  on Twitter or in  the Datasette Discussions forum with any questions.", "posttime": "2021-07-29 22:08:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,data,datasette", "title": "烘焙数据架构模式", "title_en": "The Baked Data architectural pattern", "transed": 1, "url": "https://simonwillison.net/2021/Jul/28/baked-data/", "via": "", "real_tags": ["数据", "data", "datasette"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "喜欢数组语言 APL、J 和 k/q 的理由有很多！聆听并了解更多信息。阅读更多", "note_en": "There are lots of reasons to like the array languages APL, J and k/q! Listen and find out more.\n Read More", "posttime": "2021-07-29 22:08:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,播客,编程,cast,array", "title": "The Array Cast：关于数组编程语言的播客", "title_en": "The Array Cast: A podcast about the array programming languages", "transed": 1, "url": "https://www.arraycast.com/episodes/", "via": "", "real_tags": ["播客", "编程", "cast", "array"]}, {"category": "", "categoryclass": "", "imagename": "0e2b48fb7f64e905c8766e883336998d.jpg", "infoid": 1070286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在第一次世界大战期间，听证会被重新定义为一种战术活动——一种可以决定人类甚至国家生存的活动。根据第一次世界大战期间美国助理战争部长委托撰写的一份高耸报告的前言“战争的结束：图形记录”，第一次世界大战不是以一声巨响结束，而是如著名诗句中的呜咽声.这张照片在幻灯片上显示了六条水平线，描绘了 1918 年 11 月 11 日上午 11:00 停战前一分钟和后一分钟，摩泽尔河附近美国前线的炮兵活动。左侧描绘停战前一分钟的炮兵活动并显示出一连串锯齿状的线条（“全枪射击”）。在右侧，描绘了停战后一分钟的炮兵活动，只有流畅的线条（“所有枪声”）。 11:01:01 左右两次小幅下跌归因于一个面团男孩为庆祝停火开了两次手枪。除了这些枪声之外，炮兵的活动似乎完全停止了，战场上的枪声顿时变得空荡荡的。 “战争结束”的标题说，这是美国前线炮兵活动的最后记录，图像是从美国测距仪发出的。 “测距，”它写道，“是定位敌方火炮位置和口径的重要手段。”当该图像在《电力杂志》(Journal of Electricity) 上被转载时，有关它的声明甚至更为宏大：“真正的历史在这里是用电写成的！” “战争的终结”是通过第一次世界大战期间发明的众多声学防御方法之一制作的。在战争开始时，声学防御的概念几乎无人知晓。没有一支主要军队拥有通过跟踪敌人发出的声音来跟踪敌人位置的可靠手段。然而，到战争结束时，每个人都开发了新的技术和声音定位技术，通常是为了应对新技术的进攻，并且每个人都在无数场合使用过这些方法——从而产生了新的“声学防御”模式。然而，一种新的进攻武器的出现，并不意味着新的防御方法就容易获得。据皇家海军志愿预备役中校阿尔弗雷德·罗林森 (Alfred Rawlinson) 称，敌人很容易躲在云层后面。防御的枪应该如何击中他们看不到的物体？他说，答案“非常简单——即，虽然我们看不到它，但我们可以听到它。因此，我们不能用眼睛瞄准，如果我们要射击，就不得不用耳朵瞄准。”尽管如此，他写道，“理论无论多么正确，要转化为实践，还有很长的路要走。”直到 20 世纪早期，空间听觉几乎都是从声音物理学或听觉生理学和心理学的角度进行研究的。在战争期间，它被重新塑造为一种从战略角度理解的战术活动——可以决定人类甚至国家的生存。听觉空间感知曾经被认为是视觉空间感知的附属，现在被新理解为一项至关重要的技能，“听觉”突然映射到民族国家的权力上。\n第一次世界大战中使用的第一个声音定位器在很大程度上依赖于“看到”声音的想法。有些是基于视觉技术，并将源自光学科学的原理转移到声学领域。 1916 年，一位法国陆军中尉设计了一种 viseur acoustique（“声学面罩”），这是一种由镜子和指南针组成的手持设备。一名士兵使用该仪器将他的脸在镜子中的反射居中，这样他就可以同样清楚地看到自己的耳朵。罗盘然后大概会给出声音的方向。在英格兰进行了使用试听盘的实验，该技术基于这样一种想法，即当隔音盘面向声源时，声像将在圆盘中心与隔音盘相对的一侧形成。声音。这个想法被提出作为光学中阿拉戈光斑的声学模拟，由于光的波动性，一个亮点出现在圆形物体的阴影中心。虽然诸如声学遮阳板和听音盘之类的技术既不是特别有效也不实用，但作为战争中出现的最持久的声学防御技术之一，Baillaud 抛物面也是基于视觉技术的。尽管历史上有声学反射器的例子，但第一个专门为军事用途设计的抛物面声学反射器是由 René Baillaud 在 1915 年发明的，并具有盘子或碗的形式。 Baillaud 是图卢兹天文台的一位天文学家，他在牛顿望远镜上模拟了他的设备。他的设计基于这样一个前提，即抛物面镜无论是反射光还是反射声音，都必须具有相同的反射特性。在贝约的回忆录中，一系列照片展示了声学抛物面经过大约一年的密集实验的发展。我们发现了越来越大的乐器，直径从 60 厘米到 3 米不等；形状各异，使盘子看起来不像凹盘，而更像深碗；和不同的配置，其中包括四个抛物面堆叠成两排。在最大焦点上使用类似听诊器的设备收听的单个审计员变成了两个审计员，他们串联收听，而每个人都坐在设备的两端，使用手轮旋转盘子。我们还发现引入了自动航向绘图仪，这是一种跟踪审计员运动的成像技术，从而产生飞机轨迹的视觉记录。第一次世界大战的军用飞机产生了几种声音：螺旋桨的节拍声、发动机声音以及空气与运动飞机机身之间的摩擦引起的振动。然而，最响亮且最容易识别的声音是所谓的“排气音”。各种飞机的排气音在 80 赫兹到 130 赫兹之间，虽然这个音调在飞机运动时有所不同，但始终是低频声音。为了反射飞机的低频声音，各主力军都研制了喇叭声定位器（也称为喇叭声定位器），用可以反射低频声音的大锥形喇叭代替了火炮测距装置的小喇叭。据剑桥大学生理学教授、20世纪初英国防空实验组主任AV希尔介绍，英国陆军研制的第一种小号声音定位器只有一对大号角，其口部直径约 40 英寸。该设备于 1917 年首次用作伦敦防空系统的一部分，只能确定敌机的水平方位。几乎立即开发的第二种型号有两对号角，有时被称为“四小号”或“四号角”声音定位器。一对喇叭用于确定飞机的仰角（高度），而另一对用于确定其水平方位（方位角）。喇叭的“alt-azimuth”安装需要两名审计员，他们从事可能被认为是“双双耳”聆听模式的工作。每个审计员都通过一个类似听诊器的双耳听筒听，该听筒只连接到一组喇叭。一名审计员只听了飞机的高度，而另一名则听了它的水平方位。因此，使用审计员的综合听觉印象来跟踪飞机，这是通过平衡两个耳朵的声级来确定的，这个过程被称为“包围声音”。\n四喇叭声音定位器是重型、劳动密集型的设备，需要相当大的努力来运输和使用。此外，通过喇叭声音定位器收听几乎总是在任何实验室都无法复制的不利条件下进行。军事审计员几乎总是在黑暗中运作，这已经是一项艰巨的任务，他们经常在恶劣的天气和混乱可怕的战斗条件下倾听。众所周知，士兵在战斗中会瞬间耳聋；士兵们回忆说“看到枪手的耳朵在流血”。通过声音定位器收听时，听力受损和听者疲劳是司空见惯的。听众不仅要在陌生和不可预测的环境中从事一项艰巨而繁重的活动，而且几乎可以肯定他有死亡的危险。在这种情况下，“加强倾听”是一个极端的命题。鉴于在这种极端条件下聆听的不稳定性质，军事审计员接受了广泛的培训，以培养他们的定向聆听技能。关于声学测角仪（一种法国设备）的军事手册包含有关“声音观察者的培训”和“听众的耳朵培训”的段落。这些段落详细描述了军事审计员必须进行的各种耳朵训练练习才能获得操作声学测角仪的资格- 喇叭声音定位器。声学测角仪听力练习分五个阶段进行。在第一阶段，审计员聆听大约 100 米外的固定声源。助手通过数数、拍手或吹喇叭来提供声音。助理然后侧身移动到另一个点，而审计员则将仪器重新对准他。第一个练习用于消除不可靠的听众。如果审核员的“声学目标”偏离太多，审核员将不被允许进入第二阶段。在第二阶段，助手模仿移动的声源，在以大约每秒一米的速度连续行走时产生连续的声音，距离审计员大约 150 到 200 米。审计员试图通过不断地将测角仪重新对准助手来跟踪声音。一位站在旁听者和助教之间的教官随意吹口哨。在这些点上，助手停止移动，审核员的声学瞄准得到验证。在第三和第四阶段，审核员跟踪实际飞机的声音，首先跟踪其水平方位，然后跟踪其高度。在第五阶段也是最后阶段，两名审计员同时跟踪一架飞机，一名审计员监听飞机的水平方位，另一名监听飞机的仰角。决定审计员“应该每天系统地接受培训”，每天的听力练习“绝对不可或缺”。如果审计师不每天练习，人们认为他“很快就会失去所获得的效率”。战争中机械上最复杂的声音定位器之一是佩兰远距望远镜 (télésitemètre Perrin)，它以法国物理学家让·巴蒂斯特·佩兰 (Jean Baptiste Perrin) 的名字命名。其前提是锥形喇叭所能达到的声音放大量必然受到喇叭尺寸和长度的限制。为了增加声音定位器的放大功率而不是其尺寸，Perrin 设计了一个接收器，该接收器将数十个基本喇叭聚集在六角形蜂窝状巢穴中。这些“主号角”通过一套管子连接到中央号角，两名审计员分别通过额外长度的管子进行双耳收听。这个想法是，被称为“myriaphones”的多细胞喇叭组合将使设备能够收集大量声能，而仪器本身可以保持相对较小，因此在运动战的背景下是可行的。\n根据 AV Hill 的说法，许多人认为 Perrin 遥测仪比小号声音定位器提供了“更确定的中心位置”，并且使用遥测仪，声音在两只耳朵之间传递的感觉似乎“更加明显”。第一次世界大战期间，出现了一支军事审计专家级，他们感知声音位置和方向的能力成为军事行动中的一项关键资产。在法国，军事审计员每天都接受培训，定向聆听被理解为可以通过听力训练来培养的技能。在声学防御的背景下，“好的倾听者”不一定是听得好的人。相反，一个好的倾听者是能够使用他们的空间听觉来定位和追踪声音来源的人。在战争过程中，声学防御技术变得更加复杂，不仅在其日益复杂的设计方面，而且在它们所需的聆听类型方面。出现了合作和协作的聆听模式，其中涉及几个审计员 - 以及其他团队 - 他们协同工作以感知和解释声学活动。尤其是在战争后期，在声学防御环境中进行聆听显然是一种集体努力。几乎每一种防御性倾听行为都涉及一系列复杂的程序，需要专业知识、多位审计员和其他观察员之间的合作以及人员团队之间的沟通。通过这种方式，聆听变成了一个分散的过程，由许多人分配，每个人都被分配到“聆听行为”的不同部分。同时，倾听行为本身也从个人在日常环境中进行的单一、连续、连贯的行为重新配置为一组由审计人员在极端战争条件下进行的系统化、离散的行为。由于军事审计员的作用是倾听并不断报告他的发现，因此进一步将倾听重新配置为数据收集行为。军事审计员通常不会像声学传感器那样解释声音的含义，而他的角色基本上是观察和报告物理声学数据。从这个意义上说，军事聆听本质上是一项机械任务，预示着当代形式的机器聆听。人类审计师通过制定功能性和高度合理化的聆听模式来执行机器今天执行的功能：声音研究学者乔纳森·斯特恩称之为“听觉技术”的军事化形式。通过声学防御，听力同样被重新配置为感知、观察或视觉绘制声能，而不是仅仅“听到”声音。在一些声学防御方法中，声音的视觉表示以及与声学活动相关的计算——例如确定风和温度等大气条件对特定日期声音传播的影响——取代了听觉。换句话说，在声学防御中，声音“听起来”的方式并不总是很重要。相反，在许多情况下，声音的物理行为才是听力方程式中最重要的部分。如果声音不是被理解为可以听到的东西，而是可以被感知的东西——或者实际上是被观察到的——那么它的定义也必须改变。在战争开始时，声音通常被理解为“某些振动运动对听觉神经产生的影响”，希尔引用了这一定义作为标准。然而，这个定义并不总是适用于声学防御的背景，因为有时需要考虑声音，正如一位军事领导人所写的那样，“不考虑通过耳朵的最终检测。”因此，希尔建议对声音更合适的定义是“听觉器官对其作出反应的那种物质的振动运动”。虽然这当然符合关于声音的成熟想法，但声学防御技术使以有形的方式体验声音作为“物质的振动运动”成为可能。\n声学防御同样使“声音传播”的想法具体化。成千上万的人——包括军事审计员，以及许多生活在空中轰炸威胁下的平民——不是面向可见的声音来源，而是面向声音的路径。声学防御使声音移动的想法变得合理，并且通过将自己定位于它的移动，人们可以重新定位历史本身。 Gascia Ouzounian 是牛津大学音乐系副教授，着有《立体声：科学、技术和艺术中的声音与空间》一书，本文改编自该书。", "note_en": "During WWI the act of hearing was recast as a tactical activity — one that could determine human and even national survival.\n   According to “The End of the War: A Graphic Record,” the frontispiece of  a towering report commissioned by the U.S. Assistant Secretary of War during WWI, the Great War ended not with a bang, but, as in the famous verse, a whimper.\n The image, which showed six horizontal lines on a filmstrip, depicted artillery activity at the American front near the Moselle River exactly one minute before and one minute after the time of armistice, 11:00 a.m. on November 11, 1918. The left side depicted artillery activity at one minute before armistice and showed a flurry of jagged lines (“All guns firing”). On the right side, which depicted artillery activity at one minute after armistice, there were only smooth lines (“All guns silent”). Two small dips around 11:01:01 were attributed to the exuberance of a doughboy who fired his pistol twice in celebration of the ceasefire. Apart from these gunshots, it appeared that artillery activity had ceased entirely, and that the battlefield had been suddenly drained of the throttling sounds of gunfire.\n  The caption for “The End of the War” stated that it was the last record of artillery activity at the American front, and that the image issued from an American sound ranging apparatus. “Sound ranging,” it read, “was an important means of locating the positions and calibers of enemy guns.” When the image was reproduced in the  Journal of Electricity the claims made about it were even grander: “Truly history has here been written electrically!”\n “The End of the War” was produced through one of numerous methods of acoustic defense that were invented during the First World War. At the outset of the war the concept of acoustic defense was mostly unknown. None of the principal armies possessed reliable means for tracking the position of the enemy by following the sounds it made. By the end of the war, however, each had developed new technologies and techniques for sound location, typically in response to new technologies of offense, and each had employed these methods on countless occasions — thereby generating new modes of “acoustic defense.”\n  The appearance of a new offensive weapon, however, did not mean that new methods of defense were easily come by. According to Alfred Rawlinson, Lieutenant Commander of the Royal Naval Volunteer Reserve, the enemy was prone to hiding behind clouds. How should the guns of the defense hit an object they could not see? The answer, he said, was “childishly simple — namely, though we can’t  see it, yet we can  hear it. Therefore, as we cannot aim by using our  eyes, we shall be obliged to shoot, if we are to shoot at all, by using our  ears to aim with.” Still, he wrote, there was “a terribly long way to go before theory, however correct, could be turned into practice.”\n Until the early 20th century, spatial hearing had been studied almost exclusively in terms of the physics of sound or the physiology and psychology of hearing. During the war it was recast as a tactical activity that was understood in strategic terms — as something that could determine human and even national survival. Auditory space perception, once considered subordinate to visual space perception, was newly understood as a vital skill, with “powers of hearing” suddenly mapped onto the powers of nation states.\n  The first sound locators used in the First World War relied heavily on the idea of “seeing” sound. Some were based on technologies of vision and transposed principles derived from optical science onto the acoustic domain. In 1916 a Lieutenant in the French Army designed a  viseur acoustique (“acoustic visor”), a handheld device that comprised a mirror and compass. A soldier used the instrument by centering the reflection of his face in the mirror such that he could  see his ears equally well. The compass would then presumably give the direction of the sound.\n  Experiments were undertaken in England with listening discs, a technology that was based on the idea that, when a soundproof disc was oriented towards the source of sound, an acoustic image would form at the center of the disc on the side opposite to that of the sound. The idea was proposed as an acoustic analogue to the Arago spot in optics, whereby a bright point appears at the center of the shadow of a circular object due to the wave nature of light.\n While technologies like acoustic visors and listening discs were neither particularly effective nor practicable, one of the most enduring acoustic defense technologies to emerge from the war, the Baillaud paraboloid, was also based on a technology of vision. Although there are examples of acoustic reflectors throughout history, the first parabolic acoustic reflector designed expressly for military use was invented by René Baillaud in 1915, and given the form of a dish or a bowl. Baillaud, an astronomer based at the Toulouse Observatory, modeled his device on the Newtonian telescope. His design was based on the premise that parabolic mirrors must share the same properties of reflection whether they were reflecting light or sound.\n  In Baillaud’s memoirs a series of photographs shows the development of the acoustic paraboloid over an intensive, approximately year-long period of experimentation. We find instruments of increasing size, ranging from 60 centimeters to 3 meters in diameter; of varying shapes, whereby the dish appears less like a concave dish and more like a deep bowl; and of varying configurations, including one in which four paraboloids were stacked in rows of two. A single auditor listening using a stethoscope-like device at the point of greatest focus becomes two auditors, who listen in tandem while each one is seated at opposite ends of the device, using hand wheels to rotate the dish. We also find the introduction of an automatic course plotter, an imaging technology that traced the auditors’ movements, thereby producing a visual record of the trajectory of the aircraft.\n  Military aircraft of the First World War produced several kinds of sounds: the beat of the propeller, engine sounds, and vibrations caused by friction between the air and the body of the moving airplane. The loudest and most easily identifiable sound, however, was what was called the “exhaust note.”\n The exhaust notes of various aircraft ranged between 80 hertz and 130 hertz, and although this pitch varied somewhat when the aircraft was in motion, it was invariably a low-frequency sound. In order to reflect the low-frequency sounds of aircraft, each of the principal armies developed trumpet sound locators (also called horn sound locators) that replaced the small trumpets of artillery ranging devices with large conical trumpets that could reflect low frequency sounds. According to A. V. Hill, professor of physiology at the University of Cambridge and director of the Anti-Aircraft Experimental Section in England in the early 20th century, the first type of trumpet sound locator developed by the British Army had only a single pair of large horns, which measured approximately 40 inches in diameter at the mouth. This device, which was first used as part of the Anti-Aircraft Defense of London in 1917, could determine only the horizontal bearing of enemy aircraft. A second model, which was developed almost immediately, had two pairs of horns, and was sometimes called the “four-trumpet” or “four-horn” sound locator. One pair of horns was used to determine the elevation of the aircraft (its altitude), while the other pair was used to determine its horizontal bearing (azimuth).\n  The “alt-azimuth” mounting of the horns necessitated two auditors, who engaged in what might be thought of as a “double binaural” mode of listening. Each auditor listened via a stethoscope-like binaural earpiece that was connected only to one set of horns. One auditor listened only to the aircraft’s elevation, while another listened to its horizontal bearing. It was therefore the auditors’  combined auditory impressions that were used to track the aircraft, which was ascertained by equalizing the sound level at the two ears, a process that was called “bracketing the sound.”\n Four-trumpet sound locators were heavy, labor-intensive devices that required considerable effort to transport and use. Moreover, listening through trumpet sound locators was almost always done in adverse conditions that could not be replicated in any laboratory. Military auditors almost always operated in the dark, already a difficult task, and they often listened in poor weather and in the chaotic and terrifying conditions of battle. Soldiers were known to have suffered instantaneous deafness in battle; and soldiers recalled “seeing gunners’ ears bleeding.”\n Hearing damage and listener fatigue were commonplace when listening through sound locators. Not only was the listener engaged in a difficult and taxing activity in unfamiliar and unpredictable settings, but he was almost certainly at risk of death. In this context, “heightened listening” was an extreme proposition.\n  Given the precarious nature of listening in such extreme conditions, military auditors received extensive training to develop their directional listening skills. A military manual on the acoustic goniometer, a French device, contains passages on the “Training of Sound Observers” and “Ear Training for Listeners.” These passages describe in detail the various ear-training exercises a military auditor was required to undertake to qualify for operating the acoustic goniometer, an alt-azimuth sound locator in which two sets of ten small, clustered horns replaced the large conical horns of the four-trumpet sound locator.\n Listening exercises with the acoustic goniometer were conducted in five stages. In the first stage an auditor listened to a fixed sound source approximately 100 meters away. An assistant provided the sound either by counting, clapping his hands, or sounding a trumpet. The assistant then moved sideways to another point while the auditor reoriented the instrument towards him. This first exercise served to eliminate unreliable listeners. If an auditor’s “acoustic aimings” deviated too much, the auditor would not be permitted to pass to the second stage.\n  During the second stage an assistant mimicked a moving sound source, producing a continuous sound while walking continuously at a rate of approximately one meter per second, at a distance of approximately 150 to 200 meters from the auditor. The auditor attempted to follow the sound by continuously reorienting the goniometer towards the assistant. An instructor who stood between the auditor and the assistant whistled at random. At these points the assistant stopped moving and the auditor’s acoustic aiming was verified.\n For the third and fourth stages the auditor followed the sound of an actual airplane, first tracking its horizontal bearing and then its elevation. In the fifth and final stage, two auditors followed an airplane simultaneously, with one listening for its horizontal bearing and the other for its elevation. It was decided that auditors “should be trained every day systematically” and that daily listening practice was “absolutely indispensable.” If an auditor did not practice every day, it was believed that he “would quickly lose the efficiency acquired.”\n   One of the most mechanically complex sound locators of the war was the Perrin telesitemeter ( télésitemètre Perrin), named after the French physicist Jean Baptiste Perrin. It was based on the premise that the amount of sound amplification that could be achieved by a conical horn was necessarily limited by the size and length of the horn. In seeking to increase the sound locator’s amplifying power but not its size, Perrin designed a receiver that clustered dozens of elementary horns in hexagonal, honeycomb-like nests. These “primary horns” were connected to a central horn by a suite of tubes, and two auditors each listened binaurally via an additional length of tubing. The idea was that the multicellular horn assemblages, called “myriaphones,” would enable the device to collect a substantial amount of acoustic energy while the instrument itself could remain relatively small and therefore practicable in the context of mobile warfare.\n According to A.V. Hill, many people believed that the Perrin telesitemeter gave a “more decided position of centrality” than trumpet sound locators, and that the sensation of passage of sound between the two ears seemed “more pronounced” with the telesitemeter.\n  During the First World War an expert class of military auditor emerged, one whose ability to sense the location and direction of sounds became a key asset in military operations. In France, military auditors were trained on a daily basis, and directional listening was understood as a skill that could be developed through ear training. In the context of acoustic defense, a “good listener” was not necessarily someone who could hear well. Rather, a good listener was one who could use their spatial hearing sense to locate and track the source of a sound.\n Over the course of the war acoustic defense technologies became more complex, not only in terms of their increasingly elaborate designs, but also in the kinds of listening they required. Cooperative and collaborative modes of listening emerged that involved several auditors — and teams of others — who worked in tandem to sense and interpret acoustic activity. Especially in the later years of the war, listening in the context of acoustic defense was a distinctly group effort.\n Almost every act of defensive listening involved a complex sequence of procedures that required specialist knowledge, cooperation between several auditors and other observers, and communication between teams of people. In this way, listening became a fragmented process that was divided between many people, each of whom was assigned to a different part of the “listening act.” Meanwhile, the listening act itself was reconfigured from a single, continuous, coherent act carried out by individuals in everyday contexts to a set of systematized, discrete actions carried out by groups of auditors under the extreme conditions of warfare.\n Since the role of the military auditor was both to listen and to continuously report his findings, listening was further reconfigured as an act of data collection. The military auditor did not typically interpret the  meaning of sounds so much as he acted as an acoustic sensor, one whose role was fundamentally to observe and report physical acoustic data. In this sense, military listening was essentially a mechanical task that prefigured contemporary forms of machine listening. Human auditors performed the function that machines perform today, by enacting functional and highly rationalized modes of listening: militarized forms of what sound studies scholar Jonathan Sterne has called “audile technique.”\n Through acoustic defense, listening was equally reconfigured as sensing, observing, or visually plotting acoustic energy versus merely “hearing” sound. In some acoustic defense methods, the visual representation of sound, and calculations relating to acoustic activity — determining the influence of atmospheric conditions like wind and temperature on the propagation of sound on a particular day, for example — superseded the sense of hearing. In other words, it was not always how the sound “sounded” that mattered in acoustic defense. Rather, in many cases it was the physical behavior of sound that was the most consequential part of the listening equation.\n  If sound is understood not as something to be heard but rather as something to be sensed — or indeed, observed — then its definition must also change. At the start of the war sound was commonly understood as “the effect produced upon the auditory nerve by certain vibratory motions,” a definition that was cited as standard by Hill. However, this definition was not always applicable in the context of acoustic defense, since it was sometimes necessary to consider sound, as one military leader wrote, “without reference to its ultimate detection by the ear.” Hill therefore suggested that a more appropriate definition of sound would be that of “a vibratory motion of matter of the type to which the organ of hearing responds.” While this certainly corresponded to well-established ideas about sound, technologies of acoustic defense made it possible to experience sound as “a vibratory motion of matter” in a tangible way.\n Acoustic defense equally made concrete the idea that “sound travels.” Thousands of people — including military auditors, as well as the many civilians living under the threat of aerial bombardment — oriented themselves not towards the visible source of sound but towards the path of sound. Acoustic defense made sensible the idea that sound moves, and that, by orienting oneself towards its movements, one might reorient history itself.\n  Gascia Ouzounian is Associate Professor of Music at the University of Oxford and the author of   “Stereophonica: Sound and Space in Science, Technology, and the Arts,”  from which this article is adapted.", "posttime": "2021-07-29 22:08:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "力量,hearing,声音", "title": "听觉的力量：声音定位的军事科学", "title_en": "Powers of Hearing: The Military Science of Sound Location", "transed": 1, "url": "https://thereader.mitpress.mit.edu/powers-of-hearing-the-military-science-of-sound-location/", "via": "", "real_tags": ["力量", "hearing", "声音"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter 不直接提供对粗体、斜体等格式文本的支持。但它确实支持 Unicode 字符 [1]，因此绕过格式限制的一个技巧是用 Unicode 变体替换字母。我在上面的行中作弊，使用粗体和斜体格式而不是 Unicode 字符，因为有些读者可能无法阅读。这是 Emacs 中实际 Unicode 文本的屏幕截图。您可以在脚注 [2] 中看到文本。这是纯文本。我已经要求以粗体显示“b”的详细信息，底部窗口显示它不是 ASCII 范围内“b”向下的常见 U+0062，而是补充多语言平面中的 U+1D5EF。同样，上面斜体的 i 不是 U+0069，而是 U+1D456。这是一个肮脏的黑客，我建议不要过度使用它。但它偶尔会派上用场。另一方面，有些人可能看不到您希望他们看到的内容。这是 Android 设备屏幕截图的一部分： 根据非常粗略的经验，具有较小 Unicode 值的字符更有可能在任何地方正确显示。据我所知，像 ∞ (U+221E) 这样的数学符号无处不在。我不会依赖于 0xFFFF 以上的任何 Unicode 字符。更新：有几个人说这种格式给语音阅读器带来了问题。下一篇文章解释了为什么不应该这样做。 （也许它确实会引起问题，但不必如此。）\n我使用 Perl 模块 Unicode::Tussle 中的程序 unifont 和 unisupers 生成了上面的 Unicode 文本。有关如何安装模块的信息，请参阅此帖子。这是从命令行使用这些实用程序的屏幕截图。要使用 unifont，请在命令后键入要格式化的文本。然后显示使用 Unicode 字符以多种方式格式化的文本。我输入了“粗体”并复制了这个词的粗体版本。文本可以是任何东西；巧合的是，我给它的文本也是格式名称。例如，我使用命令创建了上面的双击 R 和 C。 unisupers 命令不接受参数，而是从标准输入中获取输入。所以我在命令名称后按回车键，然后输入“n”来获取上标 n。 [1] Twitter 支持 Unicode 字符，但有一个问题是读者是否会安装字体来显示这些字符。八年前，我写过一些用户可能会看到和不太可能看到的符号，但我的印象是从那时起情况已经有了很大改善。如何在推文中包含或文本。魏尔斯特拉斯函数。 Im: ℂ -&gt; ℝ ℝⁿ -&gt; ℝᵐ（我将文本粘贴到我的博客软件中，但看起来它正在删除“粗体”和“斜体”这两个词。）", "note_en": "Twitter does not directly provide support for formatting text in bold, italic, etc. But it does support Unicode characters [1], and so a hack to get around the formatting limitation is to replace letters with Unicode variants.\n   I cheated in the line above, using bold and italic formatting rather than Unicode characters because some readers might not be able to read it.\n Here’s a screenshot of the actual Unicode text in Emacs. You can see the text in the footnotes [2].\n  This is plain text. I have asked for the details on the ‘b’ in  bold, and the bottom windows shows that it is not the common U+0062 for ‘b’ down in the ASCII range, but U+1D5EF up in the Supplementary Multilingual Plane. Similarly, the i in  italic above is not U+0069 but U+1D456.\n   It’s a dirty hack, and I’d recommend not overdoing it. But it could come in handy occasionally. On the other hand, some people may not see what you intend them to see. Here’s a portion of a screenshot from an Android device:\n  As a very rough rule of thumb, characters with smaller Unicode values are more likely to display correctly everywhere. Math symbols like ∞ (U+221E) work everywhere as far as I know. I wouldn’t depend on any Unicode character above 0xFFFF.\n Update: Several people have said this formatting poses a problem for speech readers.  The next post explains why it shouldn’t. (Maybe it  does cause a problem, but it wouldn’t  have to.)\n  I produced the Unicode text above using the programs  unifont and  unisupers from the Perl module  Unicode::Tussle. See  this post for how to install the module. Here’s a screenshot of using these utilities from the command line.\n  To use  unifont, type the text you’d like to format after the command. It then shows the text formatted several ways using Unicode characters. I typed “bold” and copied the bold version of the word. The text could be anything; it’s a coincidence that I gave it text that was also a format name. For example, I created the double-struck R and C above with the command\n  The  unisupers command does not take an argument but instead takes its input from standard input. So I hit return after the command name and then typed ‘n’ to get the superscript n.\n   [1] Twitter supports Unicode characters, but there’s a question of whether readers will have fonts installed to display the characters. I wrote  eight years ago about some symbols users were and were not likely to see, but my impression is that the situation has improved quite a bit since then.\n  How to include or text in a tweet.\rWeierstrass function.\rIm: ℂ -&gt; ℝ\rℝⁿ -&gt; ℝᵐ\n (I pasted the text into my blogging software, but it looks like it is deleting the words “bold” and “italic.”)", "posttime": "2021-07-29 22:07:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "unicode,text,文本", "title": "如何使用 Unicode 字符在 Twitter 中格式化文本", "title_en": "How to format text in Twitter using Unicode characters", "transed": 1, "url": "https://www.johndcook.com/blog/2021/07/19/how-to-format-text-in-twitter/", "via": "", "real_tags": ["unicode", "text", "文本"]}]