[{"category": "", "categoryclass": "", "imagename": "e5ed128c1a06aa44423b386c62786d16.jpg", "infoid": 1018044, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在其游戏流媒体服务XCloud被屏蔽后，越来越多的开发者对App Store的政策不满，微软也加入了这些开发者的行列。\n近年来，苹果臭名昭著的“围墙”平台变得更加开放，但一些令人沮丧的政策仍然存在，这些政策限制了开发人员，导致库比蒂诺的客户体验更差。\n游戏流媒体服务越来越受欢迎-特别是随着5G的推出-但iOS设备上明显缺乏这类服务。Stadia、GeForce Now和XCloud都有Android版本已经有很长一段时间了(Stadia有iOS应用程序，但它只能用于管理目的，不能用于实际的游戏流媒体)。\n前面提到的所有服务都会很欢迎iOS用户，这并不是因为没有尝试过。XCloud在iOS上有一个测试版，但由于苹果的政策，它被迫取消了。\n“不幸的是，我们没有办法通过苹果应用商店将Xbox Game Pass旗舰版云游戏的愿景带给iOS上的游戏玩家。苹果是唯一一个拒绝消费者使用云游戏和Xbox Game Pass等游戏订阅服务的通用平台。而且，它一贯以不同的方式对待游戏应用程序，对非游戏应用程序应用更宽松的规则，即使它们包括互动内容。\nXbox游戏通行证目录中的所有游戏都由独立的行业评级机构(如ESRB和地区同等机构)对内容进行评级。\n我们致力于寻找一条道路，将Xbox Game Pass旗舰版的云游戏带到iOS平台上。我们认为，客户应该是游戏体验的核心，游戏玩家告诉我们，他们想在任何地方玩、连接和分享，无论他们在哪里。“。\n苹果的主要智能手机竞争对手三星已经与微软建立了合作伙伴关系，在其设备上提供独特的XCloud功能。本周发布的三星Note 20甚至有一个智能手机附带的游戏捆绑包，一个专门为XCloud设计的PowerA Moga XP5-X Plus控制器，以及三个月的Game Pass旗舰版。这是一个鲜明的对比。\n苹果的论点是，它不能控制向其用户设备提供的内容，因为这些内容是流媒体的。这可能适用于任何流媒体内容，即使是Netflix这样的公司，因此感觉苹果出于商业原因对其批准的内容进行了选择。\n问题的真正症结似乎是，苹果无法将流媒体到设备上的内容货币化，特别是在苹果正在推动自己的“苹果拱廊”(Apple Arade)替代Game Pass等服务的情况下。用户不再通过App Store购买游戏-苹果可以在那里获得有争议的30%的提成-而是向微软(Microsoft)、谷歌(Google)或英伟达(Nvidia)(GeForce Now)等支付订阅费用。\n在越来越多针对该公司的反垄断案件中，苹果对游戏流媒体服务的态度感觉像是更多的证据。在Spotify和其他公司投诉后，欧盟最近成为最新启动调查App Store政策是否反竞争的国家之一。\n在美国，一个反垄断委员会正在对所有主要科技公司的做法进行里程碑式的调查。苹果的蒂姆·库克、Facebook的马克·扎克伯格、谷歌的桑达尔·皮查伊、亚马逊的杰夫·贝佐斯和微软的布拉德·史密斯都参加了听证会。\n微软总裁兼首席法务官史密斯向反垄断委员会表达了对App Store的审批政策和苹果大幅提成购买的担忧。他接着说，与微软几年前被判违反反垄断罪时相比，今天的App Store对竞争的阻碍要大得多。\n与收入和资源较少的小型开发商相比，像微软这样的公司不会受到苹果决定的太大影响。虽然他们的许多声音被大案件淹没了，但也有一些人设法让人理解了他们的观点。\n今年5月，Basecamp首席执行官杰森·弗里德(Jason Fry)就苹果拒绝其公司名为“嘿”的电子邮件应用程序写了一封信。\n弗里德说，他对苹果接受的提成有异议，但他最大的问题是“没有选择，以及苹果如何强行将自己插入[公司]和[它的]客户之间”。\n嘿被拒绝了，因为Basecamp使用的是自己的计费系统，而不是苹果的。\n“30%的比率仍然是高速公路抢劫，正如国会议员西西林最近在一次采访中所说，但我们面临的根本问题是缺乏选择。\n苹果，请给你的开发者一个选择！让我们通过我们自己的系统为我们的客户开具账单，这样我们就可以用我们自己的方式帮助他们延长、退款、折扣或任何其他方式。这是我们的事，不是你的事。\n菲尔·席勒建议我们应该提高iOS客户的价格，以弥补苹果增加的利润率，这是反垄断金。\n我们将拭目以待，看看苹果是否会改变政策。然而，这场最新的惨败让人感觉它在针对该公司的反垄断案件中提供了更多证据。\n不管喜欢与否，苹果最终可能会被迫变得对开发者更加友好。\n有兴趣听业界领袖讨论这样的话题吗？参加共同举办的5G博览会、物联网技术博览会、区块链博览会、AI&amp；大数据博览会和网络安全与云博会世界系列，并即将在硅谷、伦敦和阿姆斯特丹举办活动。", "note_en": "Microsoft has joined the growing number of developers who are disgruntled with the App Store’s policies after its game streaming service xCloud is blocked.\n Apple’s notorious “walled” platforms have become more open in recent years, but some frustrating policies remain which restrict developers and lead to a poorer experience for Cupertino’s customers.\n Game streaming services are growing in popularity – especially with 5G rolling out – but there’s a notable lack of them on iOS devices. Stadia, GeForce Now, and xCloud have all had Android versions for quite some time (Stadia has an iOS app, but it can only be used for management purposes and not actual game streaming.)\n All of the aforementioned services would love to welcome iOS users, and it’s not for lack of trying. xCloud had a test version on iOS but has been forced to pull it due to Apple’s policies.\n  “Unfortunately, we do not have a path to bring our vision of cloud gaming with Xbox Game Pass Ultimate to gamers on iOS via the Apple App Store. Apple stands alone as the only general purpose platform to deny consumers from cloud gaming and game subscription services like Xbox Game Pass. And it consistently treats gaming apps differently, applying more lenient rules to non-gaming apps even when they include interactive content.\n All games available in the Xbox Game Pass catalog are rated for content by independent industry ratings bodies such as the ESRB and regional equivalents.\n We are committed to finding a path to bring cloud gaming with Xbox Game Pass Ultimate to the iOS platform. We believe that the customer should be at the heart of the gaming experience and gamers tell us they want to play, connect and share anywhere, no matter where they are.”\n Samsung, Apple’s main smartphone rival, has established a partnership with Microsoft to offer unique xCloud capabilities on its devices. The Samsung Note 20 announced this week even has a gaming bundle which comes with the smartphone, a PowerA MOGA XP5-X Plus controller designed specifically for xCloud, and three months of Game Pass Ultimate. It’s a stark contrast.\n Apple’s argument is that it cannot moderate what content is being served to its users’ devices because they’re being streamed. This could for any streamed content, even the likes of Netflix, so it feels like Apple is being selective of what it approves for business reasons.\n The real crux of the issue seems to be that Apple cannot monetise the content being streamed to devices, especially as Apple is pushing its own “Apple Arcade” alternative to services like Game Pass. Rather than purchase games through the App Store – where Apple can take their controversial 30 percent cut – users pay their subscription to the likes of Microsoft (xCloud), Google (Stadia), or Nvidia (GeForce Now).\n  Apple’s attitude towards game streaming services feels like more evidence in the growing number of antitrust cases against the company. The EU recently became one of the most recent to  launch an investigation into whether App Store policies are anti-competitive following complaints from Spotify and others.\n In the US, an antitrust committee is conducting a landmark investigation into the practices of all the major tech companies. Hearings have been held with Apple’s Tim Cook, Facebook’s Mark Zuckerberg, Google’s Sundar Pichai, Amazon’s Jeff Bezos, and Microsoft’s Brad Smith.\n Smith, Microsoft’s president and chief legal officer, voiced concerns about the App Store’s approval policy and the large cut Apple takes on purchases to the antitrust committee. He went on to say the App Store impedes competition far more today than Microsoft did all those years ago when it was found guilty of antitrust violations.\n The likes of Microsoft aren’t so impacted by Apple’s decisions when compared to smaller developers with less revenue and resources at their disposal. While many of their voices have been drowned out by the big cases, some have managed to get their views across.\n In May, Basecamp CEO Jason Fried  penned a letter over Apple’s rejection of his company’s email app called Hey.\n Fried said he has issues with the cut taken by Apple, but that he mostly has a problem with the “absence of choice and how Apple forcibly inserts themselves between [the] company and [its] customer”.\n Hey was rejected because Basecamp used its own billing system rather than Apple’s own.\n  “The 30% rate is still highway robbery, as Congressman Cicilline recently said in an interview, but the fundamental problem for us is the lack of choice.\n Apple, please just give your developers the choice! Let us bill our own customers through our own systems, so we can help them with extensions, refunds, discounts, or whatever else our own way. It’s our business, not your business.\n And Phil Schiller’s suggestion that we should raise prices on iOS customers to make up for Apple’s added margin is antitrust gold.”\n We’ll have to wait and see whether Apple changes its policies. However, this latest fiasco feels like it provides more evidence in the antitrust cases against the company.\n Whether it likes it or not, Apple may end up being forced to become more developer-friendly.\n Interested in hearing industry leaders discuss subjects like this? Attend the co-located  5G Expo,  IoT Tech Expo,  Blockchain Expo,  AI &amp; Big Data Expo, and  Cyber Security &amp; Cloud Expo World Series with upcoming events in Silicon Valley, London, and Amsterdam.", "posttime": "2020-08-14 22:56:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,游戏,microsoft,joins,苹果", "title": "微软在XCloud游戏流媒体被屏蔽后加入App Store的反弹", "title_en": "Microsoft joins App Store backlash after xCloud game streaming blocked", "transed": 1, "url": "https://developer-tech.com/news/2020/aug/07/microsoft-app-store-backlash-xcloud-game-streaming/", "via": "", "real_tags": ["微软", "游戏", "microsoft", "joins", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "59270189425462b3e9b105af5ad6c3b6.jpg", "infoid": 1018043, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专家表示，与过去世界上发生的大规模漏油事件相比，这艘日本拥有的船只在毛里求斯东南部泻湖和沿海地区附近泄漏的石油数量相对较低，但它将造成巨大而持久的损害。\n与之前的大多数近海漏油事件不同，这次事件发生在两个受环境保护的海洋生态系统和蓝湾海洋公园保护区附近，蓝湾海洋公园保护区是一个具有国际重要性的湿地。\n因此，引起最大关注的是漏油的位置，而不是漏油的大小，这可能会对环境造成严重影响。\n毛里求斯沿海村庄马埃堡外蓝色泻湖令人惊叹的绿松石般的湖水，许多宝莱坞电影的背景，现在都被染成了黑色和棕色。\n这艘名为MV Wakashio的船于7月下旬在埃斯尼角搁浅，上周四开始漏油。卫星图像显示，石油泄漏延伸到位于埃斯尼角的大陆和艾格雷特岛(Ile-aux-Aigrettes)之间。\n据认为，超过1000吨的燃料已经从船上泄漏出来，进入泻湖。一场大规模的清理行动已经从海岸发起，许多当地人自愿帮助。\n8月7日，也就是沉船事件发生近两周后，毛里求斯政府宣布该事件为全国紧急状态。\n毛里求斯是一个生物多样性热点，该地区特有的动植物高度集中。\n前绿色和平组织策略师苏尼尔·莫克沙南达(Sunil Mokshananda)告诉BBC，风和水流并没有起到帮助作用，它们把石油带到了拥有重要海洋生态系统的地区。莫克沙南达现在住在漏油地点附近的一个岛屿上。\n根据联合国生物多样性公约，毛里求斯海洋环境是1700种物种的家园，其中包括大约800种鱼，17种海洋哺乳动物和两种海龟。\n地球上生物多样性如此丰富的海洋区已所剩无几。英国布莱顿大学海洋生物学高级讲师科琳娜·乔坎博士说，像这样的石油泄漏几乎会影响那里的一切。\n这不仅仅是关于你看到的由泄漏造成的水面上的轻油浮油。\n还会有溶解在水中的油中的可溶性化合物，在水面下面形成一层摩丝状的层，然后在床上留下非常重的残留物--所以整个海洋生态系统都会受到影响。\n据运营商三井OSK Lines称，这艘名为MV Wakashio的船只据信装载了约4000吨燃料，其中近1200吨已经泄漏。\n尽管天气恶劣，总理Pravind Jgnauth说现在所有的石油都已经从船上的燃料库中移走了，尽管有一小部分仍然留在船上的其他地方。人们一直担心这艘船可能会解体，从而将更多的石油泄漏到大海中。\n燃料已经通过直升机转移到岸上，并转移到同一家日本公司长崎船务(Naghiki Shipping)拥有的另一艘船上。\n这艘船为什么离泻湖这么近还不清楚，目前正在接受警方的调查。\n在一次新闻发布会上，三井OSK Lines执行副总裁小野明彦(Akihiko Ono)为漏油事件和我们造成的巨大麻烦深情道歉。\n其中一个主要的担忧是泻湖中的珊瑚礁-有时被称为海洋的热带雨林-因为在它们身上发现了生物的多样性。\n根据美国国家海洋和大气管理局的数据，海洋中大约25%的鱼类依赖健康的珊瑚礁。\n它们保护海岸线免受暴风雨和侵蚀。珊瑚礁和海洋生态系统是毛里求斯旅游业的主要支柱，它是该国经济的重要组成部分。\n国际漏油顾问、美国阿拉斯加海洋生物学家理查德·斯坦纳教授说，泄漏的石油释放出的有毒碳氢化合物将漂白珊瑚礁，它们最终会死亡。\n去年，当一艘船在所罗门群岛海岸外的珊瑚礁上泄漏石油时，施泰纳教授帮助了所罗门群岛政府：\n尽管漏油的规模不大--只有几百吨--但对那里的珊瑚礁的破坏是巨大的。\n尽管之前世界各地的漏油事件没有被列为环境敏感地区，但它们仍然对海洋动植物造成了重大影响。\n2010年，墨西哥湾附近的深水地平线事件导致近40万吨石油泄漏，导致从浮游生物到海豚的数千种物种死亡。\n对海洋生物也有其他较长期的影响，包括繁殖受损、生长减慢、损伤和疾病。\n南佛罗里达大学海洋生态学家史蒂文·穆拉夫斯基博士和该大学C-Image协会副主任雪莉·吉尔伯特在“对话”杂志上写道，在漏油事件发生后的几个月里，研究人员在北海湾的红笛鲷身上发现了皮肤损伤，但到2012年，这些损伤变得不那么频繁和严重了。\n还有其他证据表明，随着时间的推移，在经济和环境上具有重要意义的物种，如金针鱼、石斑鱼和鳕鱼中，碳氢化合物的暴露正在持续并不断增加。\n1978年，一艘大型原油运输船在法国布列塔尼海域搁浅，导致近7000万加仑石油泄漏入海。\n大约200英里的法国海岸被浮油污染，它杀死了数百万无脊椎动物，如软体动物和甲壳类动物。泄漏还导致约2万只鸟死亡，并污染了该地区的牡蛎床。\n专家表示，尽管尽了最大努力，但在这类事件中，通常只有不到10%的漏油被成功清理。\n法国已从附近的留尼汪岛派出一架载有污染控制设备的军用飞机，帮助毛里求斯漏油事件，而日本已派出一个六人小组协助法国的努力。毛里求斯海岸警卫队和几个警察部队也在岛上东南部的现场。\n斯坦纳教授说，毛里求斯政府应该尽快进行环境影响评估。", "note_en": "The amount of oil spilled from the Japanese-owned ship nearby the lagoons and coastal areas of south-east Mauritius is relatively low compared to the big oil spills the world has seen in the past, but the damage it will do is going to be huge and long-lasting, experts say.\n Unlike most previous offshore spills, this has taken place near two environmentally protected marine ecosystems and the Blue Bay Marine Park reserve, which is a wetland of international importance.\n So, it&#39;s the location rather than the size of the spill which is causing greatest concern about its potentially serious environmental impact.\n The stunning turquoise waters of the blue lagoon outside the coastal village of Mahébourg in Mauritius, the backdrop for numerous Bollywood movies, are now stained black and brown.\n The ship, MV Wakashio, ran aground at Pointe d&#39;Esny in late July, and oil began leaking from it last Thursday. Satellite images show the oil spill stretched out between the mainland at Pointe D&#39;Esny and the island of Ile-aux-Aigrettes.\n   It is thought that more than 1,000 tonnes of fuel have leaked out of the ship and into the lagoon. A huge clean-up operation has been launched from the shore with many local people volunteering to help.\n On 7 August, nearly two weeks after the shipwreck, the Mauritian government declared the incident a national emergency.\n  Mauritius is a biodiversity hotspot with a high concentration of plants and animals unique to the region.\n &#34;The wind and the water currents are not helping, they are taking the oil towards the areas that have vital marine ecosystems,&#34; Sunil Mokshananda, a former Greenpeace strategist, who is on an island near the oil-spill site, told the BBC.\n The Mauritian marine environment is home to 1,700 species including around 800 types of fish, 17 kinds of marine mammals and two species of turtles, according to the UN Convention on Biological Diversity.\n  &#34;There are very few such marine areas with such rich biodiversity left on the planet. An oil spill like this will impact almost everything there,&#34; said Dr Corina Ciocan, a senior lecturer in marine biology at the UK&#39;s University of Brighton.\n &#34;It is not just about the light oil slick you see on the surface of the water caused by the spill.\n &#34;There will also be soluble compounds from the oil that will dissolve in the water, a mousse-like layer underneath the surface of the water, and then very heavy residues on the bed - so the entire marine ecosystem will be affected.&#34;\n  The ship, MV Wakashio, is believed to have been carrying around 4,000 tonnes of fuel, of which nearly 1,200 tonnes have already spilled, according to the operator Mitsui OSK Lines.\n Despite bad weather, Prime Minister Pravind Jugnauth said all the oil has now been removed from the ship&#39;s fuel reservoirs, although a small amount remains on board elsewhere. There had been fears that the ship could break up, spilling even more oil into the sea.\n Fuel has been transferred to shore by helicopter and to another ship owned by the same Japanese firm, Nagashiki Shipping.\n Why the ship came so close to the lagoon is not clear and is being investigated by police.\n At a news conference, Akihiko Ono, executive vice-president of Mitsui OSK Lines &#34;profusely&#34; apologised for the spill and for &#34;the great trouble we have caused&#34;.\n  One of the major concerns has been for coral reefs in the lagoon - which are sometimes called the rainforests of the sea - because of the diversity of life found in them.\n Around 25% of fish in the ocean depend on healthy coral reefs, according to the National Oceanic and Atmospheric Administration of the US.\n They protect coastlines from storms and erosion. Coral reefs and the marine ecosystems are the major pillars of Mauritian tourism which is a big part of the country&#39;s economy.\n  &#34;The toxic hydrocarbons released from spilled oil will bleach the coral reefs and they will eventually die,&#34; said Professor Richard Steiner, an international oil spill adviser and a marine biologist in Alaska, US.\n Last year Professor Steiner helped the government of the Solomon Islands when a ship spilled oil on the coral reef off its coast:\n &#34;Although the oil spill wasn&#39;t large - just a few hundred tonnes of oil - the damage to the coral reefs there have been massive.&#34;\n  Although previous oil spills around the world have not been in as environmentally sensitive areas, they have still significantly affected marine animals and plants.\n In 2010, the Deep Water Horizon incident off the Gulf of Mexico saw nearly 400,000 tonnes of oil spill, resulting in the death of thousands of species ranging from plankton to dolphins.\n There were also other longer-term impacts on marine life including impaired reproduction, reduced growth, lesions and disease.\n &#34;Researchers found skin lesions on red snapper from the northern Gulf in the months after the spill, but the lesions became less frequent and severe by 2012,&#34; wrote Dr Steven Murawski, marine ecologist at the University of South Florida, and Sherry Gilbert, assistant director of the university&#39;s C-IMAGE Consortium in the journal The Conversation.\n  &#34;There is other evidence of ongoing and increasing exposures to hydrocarbons over time in economically and environmentally important species like golden tilefish, grouper and hake.&#34;\n In 1978, a large crude oil carrier ran aground off the coast of Brittany, France, which leaked nearly 70 million gallons of oil into the sea.\n Around 200 miles of the French coast were polluted by the oil slick, and it killed millions of invertebrates, such as molluscs and crustaceans. The spill also killed an estimated 20,000 birds, and contaminated oyster beds in the region.\n Experts say that despite best efforts, generally less than 10% of oil spilled in incidents like these is successfully cleaned up.\n France has sent a military aircraft with pollution control equipment from its nearby island of Réunion to help with the Mauritian spill, while Japan has sent a six-member team to assist the French efforts. The Mauritius coast guard and several police units are also at the site in the south-east of the island.\n &#34;The Mauritian government should do the environmental impact assessment as soon as they can,&#34; said Professor Steiner.", "posttime": "2020-08-14 22:54:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏油,oil,海洋", "title": "毛里求斯漏油事件为何如此严重", "title_en": "Why the Mauritius oil spill is so serious", "transed": 1, "url": "https://www.bbc.com/news/world-africa-53754751", "via": "", "real_tags": ["漏油", "oil", "海洋"]}, {"category": "", "categoryclass": "", "imagename": "2952e0e21a57958a43124fad130b5a14.png", "infoid": 1018039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个在覆盆子皮3B上运行的“Spot Micro”步行四足机器人。通过构建这个项目，rededitor/thetrueonion(又名Mike)想自学C++和Python的机器人软件开发，让机器人行走，并掌握速度和方向控制。\n迈克的灵感来自于波士顿动力公司为工业开发的机器人之一Spot，用于执行远程操作和自主传感。\nUBEC：HKU5 5V/5A ubec，用作5V电压调节器，为树莓PI、LCD面板、PCA9685控制板供电。\n迷你“Spot Micro”机器人通过键盘摇摆三轴角度指令/身体姿势控制模式，可以实现“快步步态”或“行走步态”。前者是一种四相步态，两条腿同时对称运动(就像小跑的马)。后者是一种八阶段步态，一次摆动一条腿，身体在两条腿之间移动以保持平衡(就像人类走路一样)。\n迈克分析了他们是如何让机器人行走的，精确到伺服系统需要连接到PCA9685控制板的顺序，在这个广泛的演练中。\n是的，这是一个神奇的项目，您需要的所有代码都存储在GitHub上。该软件是在运行Ubuntu16.04的Raspberry PI 3B上实现的。它由ROS框架中的C++和Python节点组成。\n迈克还没有完成：他们希望通过结合激光雷达来实现简单的房间2D映射来改进他们的黄色野兽。名单上还包括开发一个自主运动规划模块，以引导机器人在感知到的2D环境中执行简单的任务。最后，添加一个摄像头或网络摄像头来进行基本的图像分类将使他们的创作更加巧妙。", "note_en": "This is a ‘Spot Micro’ walking quadruped robot running on Raspberry Pi 3B. By building this project, redditor  /thetrueonion (aka Mike) wanted to teach themself robotic software development in C++ and Python, get the robot walking, and master velocity and directional control.\n  Mike was inspired by  Spot, one of Boston Dynamics’ robots developed for industry to perform remote operation and autonomous sensing.\n  UBEC: HKU5 5V/5A ubec, used as 5V voltage regulator to power Raspberry Pi, LCD panel, PCA9685 control board\n   The mini ‘Spot Micro’ bot rocks a three-axis angle command/body pose control mode via keyboard and can achieve ‘trot gait’ or ‘walk gait’. The former is a four-phase gait with symmetric motion of two legs at a time (like a horse trotting). The latter is an eight-phase gait with one leg swinging at a time and a body shift in between for balance (like humans walking).\n Mike breaks down how they got the robot walking, right down to the order the servos need to be connected to the PCA9685 control board, in this  extensive walkthrough.\n   And yes, this is one of those magical projects with  all the code you need stored on GitHub. The software is implemented on a Raspberry Pi 3B running Ubuntu 16.04. It’s composed on C++ and Python nodes in a ROS framework.\n   Mike isn’t finished yet: they are looking to improve their yellow beast by incorporating a lidar to achieve simple 2D mapping of a room. Also on the list is developing an autonomous motion-planning module to guide the robot to execute a simple task around a sensed 2D environment. And finally, adding a camera or webcam to conduct basic image classification would finesse their creation.", "posttime": "2020-08-14 22:49:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,波士顿,boston,机器人", "title": "用树莓派模拟波士顿动态", "title_en": "Mimicking Boston Dynamics with Raspberry Pi", "transed": 1, "url": "https://www.raspberrypi.org/blog/mini-raspberry-pi-boston-dynamics-inspired-robot/", "via": "", "real_tags": ["波士顿", "boston", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "742e64a6d7ed841815b24a2903bcb2f7.jpeg", "infoid": 1018038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卷积器是一个图像卷积库，它使用超出加权平均的聚合算子扩展了经典卷积。这允许表达更多的图像处理操作。卷积内核还允许分别为R、G、B和Alpha通道指定值，以便可以支持每通道操作。\n卷积运算支持开箱即用的并行处理，允许为多核系统上的大多数线性加速指定并行度。\n卷积从定义内核开始。内核有一个“半径”，它以像素为单位定义矩形面片的大小。例如，对于任何给定像素，半径为2的核在所有四个方向上延伸2个像素，总面片大小为5x5：\n上面创建了一个空的5x5内核，其中所有权重都为零。当应用于图像时，每个输出像素都是内核覆盖的以相应输入像素为中心的像素聚合的结果。权重决定了这些像素中的每个像素对聚合结果的贡献程度。权重指定为浮点数，并且可以分别为R、G、B和Alpha通道指定。\n使用这些权重，我们可以定义一个核来提取单独的颜色通道。下面指定半径为0的平凡核(表示它仅覆盖一个像素，而不考虑像素的邻居)，其中输出完全受蓝色和Alpha通道(权重1)的影响，而红色和绿色通道没有影响(权重0)。因为核是1x1，所以在x(0)，y(0)位置只有一组权重。\n内核：=卷积器。KernelWithRadius(0)x，y，r，g，b，a：=0，0，0.0，0.0，1.0，1.0内核。SetWeightRGBA(x，y，r，g，b，a)。\n一旦定义了内核，就可以使用给定的聚合函数(这里是求平均值，尽管这对于1x1内核实际上无关紧要)来应用内核：\nPARALLELISM参数允许使用并行处理来应用内核，以利用多个CPU核心。将其设置为1表示内核处理是单线程的；将其设置为4表示处理将分布在四个线程上。\n下面使用SetWeightsUniform方法，使用R、G、B和Alpha通道的单个统一权重，指定表示高斯模糊的5x5内核：\n权重：=[]float32{1，4，6，4，1，4，16，24，16，4，6，24，36，24，6，4，16，24，16，4，1，4，6，4，1，}内核：=卷积器。KernelWithRadius(2)内核。SetWeightsUniform(权重)。\n此内核可以应用于将平均化作为聚合运算符的图像，如下所示：\n通过迭代地应用内核，可以有效地强调由许多内核表示的操作。例如，我们可以继续将高斯模糊内核再应用七次：\n一个简单的锐化内核可以这样表示。权重强调像素与其四个相邻像素之间的对比度：\n应用此内核(仍使用平均)的方式与前面相同：\n边缘检测内核可能如下所示。请注意，与锐化不同，边缘周围的权重与中心的权重之和为零，这意味着在没有对比边的区域中，输出将为零：\n例如，我们可以为内核定义一个简单的、均匀加权的5x5“圆”：\n权重：=[]float32{0，1，1，1，0，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，1，0，}内核：=卷积器。KernelWithRadius(2)内核。SetWeightsUniform(权重)。\n但是，我们可以使用Max运算符来应用它，而不是使用Avg运算符(这会产生类似于简单模糊的结果)：\nMAX运算符聚合内核覆盖的像素，并为每个通道生成最大值。这意味着由内核覆盖范围规定的接近不透明像素(全Alpha)的透明像素(零Alpha)也将变得不透明。一如既往，权重为零表示这些像素对结果没有影响。\n当然，该内核也可以应用于多通道。这是应用第二个过程后的结果(请注意在一个过程中厚度增加)：\n另一个聚合运算符是Min。其中Max查找内核覆盖的最大值，Min查找最小值。使用与上面的扩展完全相同的内核，我们可以改为应用最小聚合：\n这会产生侵蚀效果，其中原始图像的特征会变细，如下所示：\n而且，内核的其他应用程序将再次强调其效果。这是应用第二个过程后的结果：\n通过组合卷积可以产生更复杂的运算。例如，通过进行扩张，然后进行侵蚀，我们可以产生闭合效果：\n这具有平滑锐点、圆角和闭合孔洞的效果，并且对于在图像中生成平滑的“孤岛”非常有用。\n我们还可以重复此操作以增强效果，先执行两次扩张，然后执行两次侵蚀：", "note_en": "convolver is an image convolution library which extends classical convolution with aggregation operators beyond weighted averaging. This allows for the expression of more image processing operations. The convolution kernels also allow specifying values separately for R, G, B, and alpha channels so that per-channel operations can be supported.\n Convolution operations support parallel processing out of the box, allowing the degree of parallelism to be specified for mostly-linear acceleration on multi-core systems.\n     Convolution starts with defining a kernel. A kernel has a “radius” which defines the size of a rectangular patch in pixels. For example, for any given pixel, a kernel of radius 2 extends 2 pixels away in all four directions, for a total patch size of 5x5:\n  The above creates an empty 5x5 kernel, where all weights are zero. When applied to an image, each output pixel is the result of some aggregation of the pixels covered by the kernel, centred on the corresponding input pixel. The weights dictate how much each of those pixels contribute to the aggregated result. Weights are specified as floats, and may be specified separately for R, G, B, and alpha channels.\n  Using the weights, we can define a kernel to extract individual colour channels. The following specifies a trivial kernel of radius 0 (meaning it only covers one pixel without consideration of the pixel’s neighbours) where the output is entirely influenced by the blue and alpha channels (weight 1) and where the red and green channels have no influence (weight 0). Because the kernel is 1x1, there is only one set of weights at the x(0),y(0) position.\n kernel  :=  convolver. KernelWithRadius( 0) x,  y,  r,  g,  b,  a  :=  0,  0,  0.0,  0.0,  1.0,  1.0 kernel. SetWeightRGBA( x,  y,  r,  g,  b,  a)\n Once defined, a kernel can be applied using a given aggregation function (here, averaging, although it doesn’t really matter for a 1x1 kernel):\n  The  parallelism parameter allows a kernel to be applied using parallel processing to take advantage of multiple CPU cores. Setting this to 1 means kernel processing is single threaded; setting it to 4 means the processing will be spread across four threads.\n    The following specifies a 5x5 kernel that expresses a Gaussian blur by using the  SetWeightsUniform method, using a single uniform weight for each of the R, G, B, and alpha channels:\n weights  := [] float32{  1,  4,  6,  4,  1,  4,  16,  24,  16,  4,  6,  24,  36,  24,  6,  4,  16,  24,  16,  4,  1,  4,  6,  4,  1,} kernel  :=  convolver. KernelWithRadius( 2) kernel. SetWeightsUniform( weights)\n This kernel can be applied to an image with averaging as the aggregation operator like this:\n     The operations expressed by many kernels can be emphasised in effect by iteratively applying the kernel. For example, we could continue to apply the Gaussian blur kernel another seven times:\n     A simple sharpening kernel can be expressed like this. The weights emphasise contrast between a pixel and its four neighbours:\n  Applying this kernel (still using averaging) can be done in the same way as before:\n     An edge detection kernel might look like this. Note that—unlike sharpening—the weights around the edges sum to zero with the weight in the centre, which means that in areas without a contrasting edge, the output will be zero:\n        For example, we can define a simple, uniformly weighted 5x5 “circle” for a kernel:\n weights  := [] float32{  0,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  0,} kernel  :=  convolver. KernelWithRadius( 2) kernel. SetWeightsUniform( weights)\n However, instead of applying this using the  Avg operator (which would yield something like a simple blur), we can apply it using a  Max operator:\n  The  Max operator aggregates the pixels covered by the kernel and produces the maximum value for each channel. This means that transparent pixels (zero alpha) which are near opaque pixels (full alpha) as dictated by the coverage of the kernel will also become opaque. As always, weights of zero indicate that those pixels have no influence on the result.\n   Of course, this kernel can also be applied in multiple passes. This is the result after applying a second pass (notice the increase in thickness over one pass):\n   Another aggregation operator is  Min. Where  Max finds the maximum values covered by the kernel,  Min finds the minimum. Using exactly the same kernel as with  Dilation above, we can apply a  Min aggregation instead:\n  This produces an  eroded effect, where the features of the original image are thinned down, and looks like this:\n  And again, additional applications of the kernel will emphasise the effect. This is the result after applying a second pass:\n   More sophisticated operations can be produced by combining convolutions. For example, by performing a  dilation, and following up with an  erosion, we can produce a  closing effect:\n  This has the effect of smoothing over sharp points, rounding off corners, and closing holes, and is useful for producing smooth “islands” in an image.\n We can also iterate this operation to strengthen the effect, performing the dilation twice and then the erosion twice:", "posttime": "2020-08-14 22:48:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "convolver,内核", "title": "Mandykoh/Convolver：用于围棋的扩展并行图像卷积库", "title_en": "Mandykoh/convolver: Extended parallel image convolution library for Go", "transed": 1, "url": "https://github.com/mandykoh/convolver", "via": "", "real_tags": ["convolver", "内核"]}, {"category": "", "categoryclass": "", "imagename": "49c8164eff17be6f7a9b0cfbbf5eeace.jpeg", "infoid": 1018037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，在加州一家上诉法院裁定，亚马逊可以对第三方卖家在其网站上销售的有缺陷的产品承担法律责任后，亚马逊遭受了法律上的失败。\n在周四发布的一致裁决中，第四地区上诉法院法官帕特里夏·格雷罗(Patricia Guerrero)写道，根据既定的严格责任原则，如果通过亚马逊网站销售的产品被证明存在缺陷，亚马逊应该承担责任。\n这一决定推翻了一家初审法院早些时候做出的有利于亚马逊即决判决的动议，尽管该公司仍可以向该州最高法院提出上诉。亚马逊没有立即回复记者的置评请求。\n此案涉及亚马逊客户安吉拉·博尔格(Angela Bolger)从香港一家名为Lenoge Technology的公司购买的更换笔记本电脑电池，该公司在亚马逊的在线市场上被封为E-Life。博尔格在她的诉讼中声称，电池在几个月后爆炸，结果她遭受了严重烧伤，她认为亚马逊应该对此负责。\n亚马逊辩称，它不承担责任，因为它没有分销、制造或销售产品，而勒诺奇是卖家。\n但法院不同意这种说法，认为亚马逊在这笔交易中扮演了过大的角色，因此它对有缺陷的电池负有责任。\n格雷罗写道，亚马逊在分销链中位于莱诺吉和博尔格之间……。接受对该产品的所有权..。储存在亚马逊的仓库里。把博尔格吸引到了这个网站上。给她提供了一份产品清单。收到了她的付款。产品是用亚马逊包装运来的。控制了莱诺格出售要约的条件…。限制Lenoge访问亚马逊的客户信息...。迫使莱诺吉通过亚马逊与客户沟通。并要求赔偿以及每笔购买的巨额费用。\n她总结道，无论我们用什么词来描述亚马逊的角色，无论它是零售商、分销商，还是仅仅是推动者，它在将产品带给消费者方面起到了关键作用。\n最高法院也不相信亚马逊的声明，即它应该受到1996年“通信体面法”(Communications Decency Act)第230条的保护，该条款保护互联网公司不会因第三方在其网站上发布的内容而受到法律影响。\n它认定第230条不适用，因为博尔格的主张依赖于亚马逊自己的活动，而不是它作为Lenoge为其产品列表提供的内容的演讲者或出版商的地位。这是因为博尔格的主张依赖于亚马逊自己的活动，而不是它作为Lenoge为其产品列表提供的内容的发言人或出版商的身份。\n在等待可能的上诉结果之前，周四的裁决可能会让这家在线零售巨头面临其他客户的重大法律风险，这些客户可能会就有缺陷或损坏的产品提起类似的诉讼。这也可能迫使亚马逊调整政策，对第三方卖家进行更严格的监管。\n亚马逊上的第三方卖家的数量在过去几年里大幅增长，他们现在占到了网站上列出的产品的一半以上。这也导致了有缺陷的、假冒的、不安全的、过期的，甚至是非法或被禁止的上市数量激增。\n亚马逊上市评论网站Fakespot发现，在最近10天的时间里，亚马逊上的276693种产品和417,616家卖家是不可靠的，从抽样中得出的结论是，15%的亚马逊卖家不可靠，应该避免。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "Amazon was hit with a legal defeat this week after a California appeals court ruled that the company can be held legally liable for defective products sold on its site by third-party sellers.\n In a unanimous  decision issued Thursday, Judge Patricia Guerrero of the Fourth District Court of Appeals wrote that &#34;under established principles of strict liability, Amazon should be held liable if a product sold through its website turns out to be defective.&#34;\n The decision overturned an earlier ruling from a trial court in favor of Amazon&#39;s motion for a summary judgment, though the company can still appeal to the state&#39;s Supreme Court. Amazon did not immediately respond to a request for comment.\n The case concerned a replacement laptop battery that Amazon customer Angela Bolger purchased from a Hong Kong-based company called Lenoge Technology, which went by &#34;E-Life&#34; on Amazon&#39;s online marketplace. Bolger alleged in her lawsuit that &#34;the battery exploded several months later, and she suffered severe burns as a result,&#34; for which she argued Amazon should be held responsible.\n   Amazon had argued that it wasn&#39;t liable because &#34;it did not distribute, manufacture, or sell the product,&#34; and that Lenoge was the seller.\n But the court disagreed, finding that Amazon played such an outsized role in the transaction that it bore the responsibility for the defective battery.\n Guerrero wrote that Amazon &#34;placed itself between Lenoge and Bolger in the chain of distribution... accepted possession of the product... stored it in an Amazon warehouse... attracted Bolger to the site... provided her with a product listing... received her payment... shipped the product in Amazon packaging... controlled the conditions of Lenoge&#39;s offer for sale... limited Lenoge&#39;s access to Amazon&#39;s customer information... forced Lenoge to communicate with customers through Amazon... &#34;and demanded indemnification as well as substantial fees on each purchase.&#34;\n &#34;Whatever term we use to describe Amazon&#39;s role, be it &#39;retailer,&#39; &#39;distributor,&#39; or merely &#39;facilitator,&#39; it was pivotal in bringing the product here to the consumer,&#34; she concluded.\n   The court also didn&#39;t buy Amazon&#39;s statement that it should be protected under section 230 of the Communications Decency Act of 1996, which shields internet companies from legal repercussions for content published by third parties on their sites.\n It determined that section 230 didn&#39;t apply because Bolger&#39;s claims &#34;depend on Amazon&#39;s own activities, not its status as a speaker or publisher of content provided by Lenoge for its product listing.&#34;\n Pending the results of a possible appeal, Thursday&#39;s ruling potentially opens up the online retail giant to significant legal exposure from other customers who could bring similar lawsuits for faulty or damaged products. It could also force Amazon to adjust its policies to more tightly regulate third-party sellers.\n The number of third-party sellers on Amazon has grown substantially in the past several years, and they now account for  more than half of the products listed on the site. That has also led to a spike in defective, counterfeit, unsafe, expired, and even  illegal or prohibited listings.\n   Amazon listing review site Fakespot found that, over a recent 10-day period, 2,766,693 products on Amazon and 417,616 sellers were &#34;unreliable,&#34; concluding from that sample that &#34;15% of Amazon sellers are unreliable and should be avoided.&#34;\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-08-14 22:47:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,缺陷,products,产品", "title": "加州法院：亚马逊对第三方销售的缺陷产品负责", "title_en": "California court: Amazon liable for defective products sold by 3rd parties", "transed": 1, "url": "https://www.businessinsider.com/court-rules-amazon-liable-defective-third-party-seller-product-sales-2020-8", "via": "", "real_tags": ["amazon", "亚马逊", "缺陷", "products", "产品"]}, {"category": "", "categoryclass": "", "imagename": "b515844e22d4636927f681d01aae7b32.jpg", "infoid": 1018036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名俄罗斯摄影师潜入世界上唯一一辆具有核能力的地效车辆，捕捉到了其内部罕见的图像。\n这就是伦级Ekranoplan，这是一艘前苏联绝密海军舰艇，可以喷气式飞机的速度掠过海浪，躲避雷达和反舰水雷。\n这辆车在脊椎上配备了六个发射器，可以发射威力足以摧毁航空母舰的核导弹。\n该飞行器利用了所谓的“地面效应”，即在极低飞行的飞机机翼下形成的高压缓冲，提高了速度和升力。经常可以看到掠浪海鸟利用同样的现象。\n在苏联解体和随后的LUN计划结束后，“航母杀手”闲置在俄罗斯达吉斯坦地区海岸这个戒备森严的码头上。\n今年夏天，31岁的俄罗斯城市探险家拉娜·萨托(Lana Sator)读到了一篇报道，报道称这幅蓝图正被海路拖到达吉斯坦的德本特，在那里它将被移入一个“爱国公园”，并永久展出。\n随着Ekranoplan懒洋洋地躺在海浪中等待最后一次运往军事主题公园，Sator告诉RFE/RL，她在最后一刻预订了从莫斯科基地到达吉斯坦的150美元的机票。\n凌晨1点左右。8月7日上午，萨托和一位朋友将相机塞进密封袋里，沿着月光照耀的海岸行走，然后涉水穿过海浪向车辆驶去。萨托说，在机翼周围，海水已经挖出了“沙子上的一个深洞”，但两人最终设法爬上了船，并向敞开的船门内窥视。\n在入口处，萨特说“灯泡亮着，发电机嗡嗡作响。”然后他们看到了一名保安。\n不知怎么的，警卫在发电机的嘈杂声中睡着了。随着喧闹声覆盖着他们的脚步，萨托和她的同伴--两人身上都是海水--得以从他身边溜过，钻进了这头苏联野兽的肚子里。\n这两个人离开警卫，进入船的后部，然后打开他们的相机和闪光灯，开始工作。\n萨托说，当他们悄悄穿过灯光昏暗的车厢时，她更多的是兴奋，而不是害怕。船像小船一样在海浪中轻轻摇摆。\n在对飞机后部进行了近一个小时的探索后，两人再次踮起脚尖经过熟睡的警卫，前往前部，萨托在那里能够拍摄到飞机般的控制室。\n最后，在凌晨3点左右，他们的相机上有几十张照片，两人再次超过了警卫--他们注意到警卫在睡梦中翻了个身--走下机翼进入温暖的海水中，当时海水已经足够深，他们出人意料地跳入了头顶之上。\n在安全到达岸边，后来看着这名健忘的警卫从飞船上出来伸展身体，在日出时打哈欠后，萨托说她的任务可以“被认为已经完成”。\n​", "note_en": "A Russian photographer snuck into the world’s only nuclear-capable, ground-effect vehicle and captured rare images of its interior.\n  This is the Lun-class ekranoplan, a formerly top-secret Soviet naval vessel that could skim just above the waves at jet-plane speeds, evading radar and anti-ship mines.\n  The vehicle was equipped with six launchers along its spine that could fire   nuclear missiles powerful enough to destroy an aircraft carrier.\n  The vehicle made use of the so-called   “ground effect” -- a cushion of high pressure that forms under the wings of extremely low-flying aircraft, boosting speed and lift. Wave-skimming seabirds can often be seen utilizing the same phenomenon.\n  After the collapse of the U.S.S.R. and subsequent end of the Lun program, the “aircraft carrier killer” sat idle on this tightly guarded dock   on the coast of Russia’s Daghestan region.\n  This summer, Russian urban explorer Lana Sator, 31, read about the ekranoplan being towed by sea to Derbent, a city in Daghestan, where it is due to be moved into a &#34;patriotic park” and put on permanent display.\n With the ekranoplan lolling in the waves awaiting its final transport to the military theme park, Sator told RFE/RL she booked a last-minute, $150 flight from her base in Moscow to Daghestan.\n  At around 1 a.m. on the morning of August 7, Sator and a friend stuffed cameras into watertight bags, walked along the moonlit coast, then waded through the waves toward the vehicle. Around the wing, Sator says the sea had scooped out “a deep hole in the sand” but the pair eventually managed to clamber on board and peer inside the vessel’s open door.\n  Inside the entrance, Sator says “light bulbs were on and a generator was humming very loudly.” Then they saw a security guard.\n  Somehow the guard was sleeping through the generator’s din. With the noise covering their footsteps, Sator and her companion -- both dripping with seawater -- were able to sneak past him and into the belly of the Soviet beast.\n  The pair headed away from the guard and into the rear of the vessel, then unbagged their cameras and flashes and got to work.\n  Sator says she was more excited than scared as they crept undetected through the dimly lit compartments. The vessel swayed gently in the waves like a boat.\n  After nearly an hour exploring the rear of the ekranoplan, the pair again tiptoed past the slumbering guard and made their way to the front where Sator was able to photograph the airplane-like control room.\n  Finally, at about 3 a.m., with scores of photos on their cameras, the pair once more passed the guard -- who they noticed had turned over in his sleep -- and stepped off the wing into the warm seawater, which by then was deep enough that they plunged unexpectedly in over their heads.\n After getting safely to shore and later watching the oblivious guard emerge from the craft to stretch and yawn at the sunrise, Sator said her mission could “be considered accomplished.”\n  ​", "posttime": "2020-08-14 22:46:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苏联,肚子,beast,警卫", "title": "野兽的肚子：苏联GEV飞机“Ekranoplan”内部的非法照片", "title_en": "Belly of the Beast: Illicit Photos from Inside the Soviet GEV Plane “Ekranoplan”", "transed": 1, "url": "https://www.rferl.org/a/photographer-sneaks-inside-the-legendary-soviet-ekranoplan/30777774.html", "via": "", "real_tags": ["苏联", "肚子", "beast", "警卫"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1018035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：这些课堂讲稿概述了与Samson Abramsky的一些合作工作，因为它是我在2005年夏天的几次会议上提出的。它涉及到“只使用线条、正方形、三角形和钻石的图片来做量子力学”。这个图解演算可以被看作是狄拉克符号的一个非常实质性的扩展，并且在所谓的强紧闭范畴(由阿布拉姆斯基和我在Quant-ph/0402130和[4]中引入)方面有一个纯粹的代数对应，它包含了我的纠缠逻辑Quant-ph/0402014。关于“是什么”、“为什么”和“如何”的调查，我参考了以前的一套课堂讲稿Quant-ph/0506132。在最后一节中，我们将提供一些指向有关该主题的技术文献正文的指针。", "note_en": "Download PDF  Abstract: These lecture notes survey some joint work with Samson Abramsky as it waspresented by me at several conferences in the summer of 2005. It concerns`doing quantum mechanics using only pictures of lines, squares, triangles anddiamonds&#39;. This picture calculus can be seen as a very substantial extension ofDirac&#39;s notation, and has a purely algebraic counterpart in terms of so-calledStrongly Compact Closed Categories (introduced by Abramsky and I in quant-ph/0402130 and [4]) which subsumes my Logic of Entanglement quant-ph/0402014. For a survey on the `what&#39;, the `why&#39; and the `hows&#39; I referto a previous set of lecture notes  quant-ph/0506132. In a last section weprovide some pointers to the body of technical literature on the subject.", "posttime": "2020-08-14 22:45:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "幼儿园,quantum,quant", "title": "幼儿园量子力学", "title_en": "Kindergarten Quantum Mechanics", "transed": 1, "url": "https://arxiv.org/abs/quant-ph/0510032", "via": "", "real_tags": ["幼儿园", "quantum", "quant"]}, {"category": "", "categoryclass": "", "imagename": "de0d3b0842a5f2312f9a7f3e1cd4cdd6.png", "infoid": 1018034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“这个专栏是什么意思？”“此指标是如何计算的？”“我能信任这张桌子吗？”\n如果有人问过你这些问题，我们很抱歉。您知道，当ELT和存储成为解决问题的时候，碎片化的元数据正变得越来越多。你很容易失去两样你无法挽回的东西：时间和信任。\n虽然问题的一部分是人员和流程，但归根结底，文档很糟糕。但是拥有合适的工具可能会有所帮助。我们认为与零散的元数据作斗争的最好工具是一个目录，它试图为您完成大部分工作，然后让您轻松地填写剩下的工作。如果工具是一件苦差事，人们就不会使用它。\n该工具应该可以开箱即用，而不必管理Kubernetes集群或(更糟糕的是)编写Javascript。归根结底，我们相信数据团队是公司中杠杆率最高的团队，他们的存在是为了放大工具和周围人员的价值。", "note_en": "“What does this column mean?” “How was this metric calculated?” “Can I trust this table?”\n If you’ve been asked these questions, we’re sorry. You know that while ELT and storage are becoming solved problems, fragmented metadata is becoming more of one. It’s so easy to lose the two things that you can’t get back: time and trust.\n While parts of the problem are people and processes, ultimately, documentation sucks. But having the right tools can help. We think the best tool for battling fragmented metadata is a catalog that tries to do most of the work for you then makes it easy to fill out the rest. If a tool is a chore to use, people don’t use it.\n That tool should work out of the box without having to manage a Kubernetes cluster or (even worse) write Javascript. At the end of the day, we believe data teams are the highest leverage teams at a company, and exist to amplify the value of the tools and people around them.", "posttime": "2020-08-14 22:45:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,metadata", "title": "MetaPlane-现代数据团队的元数据目录", "title_en": "Metaplane – A metadata catalog for modern data teams", "transed": 1, "url": "https://metaplane.dev", "via": "", "real_tags": ["数据", "metadata"]}, {"category": "", "categoryclass": "", "imagename": "23e150a5eeaf78810ff20d64a3fee3d0.jpg", "infoid": 1018033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "EPIC游戏公司已就涉嫌违反反垄断行为对谷歌提起诉讼，就在几个小时前，堡垒之夜被谷歌Play商店和iOS应用商店淘汰，并对苹果提起了类似的诉讼。EPIC的控诉称，谷歌对Play Store的支付限制构成了垄断，因此违反了谢尔曼法案和加利福尼亚州的卡特赖特法案。\nEPIC的热门游戏堡垒之夜今天早些时候从谷歌Play商店下架。\n苹果的控诉一开始就描述了该公司标志性的1984年广告，而Etic对谷歌的控诉则集中在该公司现在臭名昭著的“不要作恶”的口头禅上。起诉书称：“22年过去了，谷歌几乎把自己的座右铭放在了事后的考虑中，并利用其规模在它逐渐垄断的一系列市场上对竞争对手、创新者、客户和用户做坏事。”\n除了五颜六色的开放之外，两项主要指控与Etic对苹果的诉讼相同：对向手机分发软件的垄断控制，以及对该软件内支付系统的垄断控制。在谷歌的案例中，Etic特别关注Google Play Store作为Android应用程序分销商的强大角色，以及Play Store要求托管应用程序在任何应用程序内购买都使用Play Store Billing。\n这一案件更难与谷歌相抗衡，谷歌对Android软件的控制没有苹果对iOS的严格。Android长期以来一直允许安装第三方应用商店，包括Etic自己的Etic Games App。应用程序也可以通过直接链接来侧面加载，而不需要应用程序商店的参与。\n多年来，安卓系统的堡垒之夜主要是通过这种旁路获得的。这款应用程序终于在4月份出现在谷歌Play Store上，克服了长期以来对Play Store政策的担忧，Play Store政策要求收取所有应用内购买的30%。“在谷歌Play商店之外的安卓系统上运行堡垒之夜18个月后，我们已经基本意识到，”该公司当时表示，“谷歌把可在谷歌Play之外下载的软件置于不利地位。”\n周四的诉讼也提出了类似的案例，辩称谷歌已将Play Store确立为Android应用程序唯一可行的分发方式。“尽管谷歌承诺让Android设备向竞争开放，但它在合同和技术上设置了壁垒，排除了向Android用户分发应用程序的竞争方式，确保Google Play Store几乎占据了Android设备上应用程序商店下载的所有应用程序。”\n联系到谷歌请其置评时，谷歌强调，堡垒之夜因违反明确和预先制定的规则而被从Play Store中移除。一位代表称，“对于选择使用Play Store的游戏开发商，我们有一贯的政策，这些政策对开发商是公平的，并保证商店对用户的安全.”“虽然堡垒之夜仍然可以在安卓系统上使用，但我们不能再让它在游戏中使用，因为这违反了我们的政策。不过，我们欢迎有机会继续我们与史诗的讨论，并将堡垒之夜带回谷歌Play。“", "note_en": "Epic Games has  filed suit against Google over alleged antitrust violations, just hours after seeing  Fortnite dropped from the both  the Google Play Store and  iOS App store and filing  a similar lawsuit against Apple. Epic’s complaint alleges that Google’s payment restrictions on the Play Store constitute a monopoly, and thus a violation of both the Sherman Act and California’s Cartwright Act.\n Epic’s hit game  Fortnite was removed from the Google Play Store  earlier today.\n  Where the Apple complaint opened with a description of the company’s iconic 1984 ad, Epic’s complaint against Google focuses on that company’s now-infamous “Don’t Be Evil” mantra. “Twenty-two years later, Google has relegated its motto to nearly an afterthought,” the complaint alleges, “and is using its size to do evil upon competitors, innovators, customers, and users in a slew of markets it has grown to monopolize.”\n Outside of the colorful opening, the two primary charges are identical to  Epic’s suit against Apple: monopoly control over the distribution of software to phones, and monopoly control over payment systems within that software. In Google’s case, Epic is specifically concerned about the Google Play Store’s powerful role as a distributor of Android apps, and the Play Store’s requirement that hosted apps use Play Store Billing for any in-app purchases.\n That case is more difficult to level against Google, which controls Android software less strictly than Apple does for iOS. Android has long allowed for the installation of third party app stores, including Epic’s own Epic Games App. Apps can also be sideloaded through direct links, without the involvement of an app store.\n For years,  Fortnite for Android was primarily available through this kind of sideloading. The app finally arrived  on the Google Play Store in April, overcoming longstanding concerns over the Play Store policy of taking 30 percent of all in-app purchases. “After 18 months of operating  Fortnite on Android outside of the Google Play Store, we’ve come to a basic realization,” the company said at the time, “Google puts software downloadable outside of Google Play at a disadvantage.”\n Thursday’s lawsuit makes a similar case, arguing that Google has established the Play Store as the only viable distribution method for Android apps. “Notwithstanding its promises to make Android devices open to competition, Google has erected contractual and technological barriers that foreclose competing ways of distributing apps to Android users, ensuring that the Google Play Store accounts for nearly all the downloads of apps from app stores on Android devices.”\n Reached for comment, Google emphasized that  Fortnite had been removed from the Play Store for violating clear and pre-established rules. “For game developers who choose to use the Play Store, we have consistent policies that are fair to developers and keep the store safe for users,” a representative said. “While  Fortnite remains available on Android, we can no longer make it available on Play because it violates our policies. However, we welcome the opportunity to continue our discussions with Epic and bring  Fortnite back to Google Play.”", "posttime": "2020-08-14 22:44:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,谷歌,google,games", "title": "EPIC游戏公司还就Fortnites从Play Store下架一事起诉谷歌", "title_en": "Epic Games is also suing Google over Fortnites removal from the Play Store", "transed": 1, "url": "https://www.theverge.com/2020/8/13/21368363/epic-google-fortnite-lawsuit-antitrust-app-play-store-apple-removal", "via": "", "real_tags": ["游戏", "谷歌", "google", "games"]}, {"category": "", "categoryclass": "", "imagename": "3cd08aa4536902e1cfa1b8afa4e7f031.jpg", "infoid": 1018032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国联邦调查局(FBI)和美国国家安全局(NSA)发布了一份联合报告，警告俄罗斯国家黑客正在使用一款以前不为人知的Linux恶意软件，秘密渗透敏感网络，窃取机密信息，并执行恶意命令。\n在一份从政府机构的技术细节深度来看不同寻常的报告中，官员们表示，Drovorub恶意软件是一个功能齐全的工具包，直到最近才被发现。这些恶意软件连接到一个为GRU工作的黑客组织运营的指挥和控制服务器。GRU是俄罗斯的军事情报机构，与十多年来肆无忌惮的高级行动有关，其中许多行动对国家安全造成了严重损害。\n这些机构的官员写道：“本网络安全咨询中的信息正在公开披露，以帮助国家安全系统所有者和公众对抗GRU的能力。GRU是一个继续威胁美国和美国盟友的组织，作为其流氓行为的一部分，包括他们干预2016年美国总统选举，如2017年情报界评估报告所述，评估俄罗斯在最近的美国选举中的活动和意图(国家情报总监办公室，2017年)。”\nDrovorub工具集包括四个主要组件：感染Linux设备的客户端；使用rootkit策略获得持久性并对操作系统和安全防御隐藏其存在的内核模块；在攻击者操作的基础设施上运行以控制受感染的计算机并接收被盗数据的服务器；以及使用受损的服务器或攻击控制的计算机充当受感染的计算机和服务器之间的中介的代理。\nRootkit是一种恶意软件，它深入操作系统内核，阻止接口注册恶意文件或它们产生的进程。它还使用了各种其他技术，使感染对正常形式的杀毒软件来说是不可见的。Drovorub还不遗余力地伪装进出受感染网络的流量。\n该恶意软件以不受限制的root权限运行，使操作员可以完全控制系统。它配备了完整的功能菜单，使恶意软件相当于瑞士军刀。\n政府官员表示，Drovorub的名字来自无意中留在代码中的字符串。“Drovo”大致翻译为“木头”或“柴火”，而“擦”则翻译为“倒下”或“砍”。政府说，总而言之，Drovorub的意思是“伐木工”或“劈柴”。安全研究员德米特里·阿尔佩罗维奇(Dmitri Alperovitch)职业生涯的大部分时间都在调查俄罗斯的黑客活动-包括2016年针对民主党全国委员会(DNC)的那次-他给出了不同的解释。\n“Re：恶意软件名称‘Drovorub’，正如@NSACyber指出的那样，它直接翻译为‘伐木工’，”安全公司CrowdStrike的联合创始人和前CTO阿尔佩罗维奇在Twitter上写道。“然而，更重要的是，‘Drova’在俄语中是‘驱动程序’的俚语，就像在内核驱动程序中一样。所以这个名字很可能是“(安全)司机杀手”的意思。\nRe：恶意软件名称“Drovorub”，正如@NSACyber指出的那样，它直接翻译为“伐木工”，然而，更重要的是，“Drova”在俄语中是“驱动程序”的俚语，就像在内核驱动程序中一样。因此，这个名字很可能是为了表示“(安全)驱动程序杀手https://t.co/yToULwp3xw”的意思。\n-Dmitri Alperovitch(@DAlperovitch)2020年8月13日。\nDrovorub增加了之前已知的APT 28使用的大量工具和战术，其他研究人员称俄罗斯军事黑客组织Fancy Bear、Sr、Pawn Storm、Sofacy、Sednit和Tsar Team为其提供了丰富的工具和战术。该组织的黑客攻击服务于俄罗斯政府利益和克里姆林宫认为是对手的目标国家和组织。\n今年8月，微软报告称，该组织一直在侵入打印机、视频解码器和其他所谓的物联网设备，并将它们用作滩头阵地，渗透到它们连接的计算机网络。2018年，思科Talos集团的研究人员发现，APT 28感染了54个国家的50多万台消费级路由器，然后这些路由器可能被用于一系列邪恶目的。\n在2016年大选前闯入民主党全国委员会(以及另一个名为舒适熊的俄罗斯组织)，然后分发破坏性文件以影响选民意见。\n周四的公告没有指明Drovorub的目标组织，也没有对他们所在的目标或地理位置提供更广泛的描述。它也没有说明恶意软件已经存在了多久，到目前为止已经有多少已知的感染，或者黑客是如何感染服务器的。APT 28通常依赖于恶意垃圾邮件或网络钓鱼攻击，这些攻击要么会感染计算机，要么会窃取密码。该组织还利用未打补丁的设备上的漏洞。\n该机构官员表示，针对Drovorub的一个关键防御措施是确保安装了所有安全更新。该咨询还敦促，服务器至少运行Linux内核3.7版或更高版本，以便组织可以使用改进的代码签名保护，这些保护使用加密证书来确保应用程序、驱动程序或模块来自已知和可信的来源，并且没有被其他任何人篡改。\n“此外，建议系统所有者将系统配置为仅加载带有有效数字签名的模块，从而使行为者更难将恶意内核模块引入系统，”该公告称。\n还包括网络管理员可以插入YARA和Snort入侵检测系统的规则，以捕获和阻止进出控制服务器的网络流量，或者标记已在服务器上运行的模糊的Drovorub文件或进程。\n这份45页的文件提供了技术细节和知情分析的水平，可以与私营公司的一些最好的研究相媲美。该咨询也是第一次披露这种新的高级恶意软件的存在。这些都是政府咨询中很少提供的东西。管理网络的任何人都应该要求阅读该报告。", "note_en": "The FBI and NSA have issued a joint report warning that Russian state hackers are using a previously unknown piece of Linux malware to stealthily infiltrate sensitive networks, steal confidential information, and execute malicious commands.\n In a  report that’s unusual for the depth of technical detail from a government agency, officials said the Drovorub malware is a full-featured tool kit that has gone undetected until recently. The malware connects to command and control servers operated by a hacking group that works for the GRU, Russia’s military intelligence agency that has been tied to more than a decade of brazen and advanced campaigns, many of which have inflicted serious damage to national security.\n “Information in this Cybersecurity Advisory is being disclosed publicly to assist National Security System owners and the public to counter the capabilities of the GRU, an organization which continues to threaten the United States and U.S. allies as part of its rogue behavior, including their interference in the 2016 US Presidential Election as described in the 2017 Intelligence Community  Assessment, Assessing Russian Activities and Intentions in Recent US Elections (Office of the Director of National Intelligence, 2017),” officials from the agencies wrote.\n  The Drovorub toolset includes four main components: a client that infects Linux devices; a kernel module that uses rootkit tactics to gain persistence and hide its presence from operating systems and security defenses; a server that runs on attacker-operated infrastructure to control infected machines and receive stolen data; and an agent that uses compromised servers or attacker-control machines to act as an intermediary between infected machines and servers.\n A rootkit is a type of malware that burrows deep inside an operating system kernel in a way that prevents the interface from being able to register the malicious files or the processes they spawn. It uses a variety of other techniques as well to make infections invisible to normal forms of antivirus. Drovorub also goes to great lengths to camouflage traffic passing into and out of an infected network.\n The malware runs with unfettered root privileges, giving operators complete control of a system. It comes with a full menu of capabilities, making a malware equivalent of a Swiss Army knife.\n  Government officials said Drovorub gets its name from strings unintentionally left behind in the code. “Drovo” roughly translates to “wood” or “firewood,” while “rub” translates to “fell” or “chop.” Put together, the government said, Drovorub means “woodcutter” or to “split wood.” Dmitri Alperovitch, a security researcher who has spent most of his career investigating Russian hacking campaigns—including the one that targeted the DNC in 2016—offered a different interpretation.\n “Re: malware name ‘Drovorub,’ which as @NSACyber points out translates directly as ‘woodcutter,’” Alperovitch, a co-founder and former CTO of security firm CrowdStrike,  wrote on Twitter. “However, more importantly, ‘Drova’ is slang in Russian for ‘drivers,’ as in kernel drivers. So the name likely was chosen to mean “(security) driver slayer.&#34;\n Re: malware name “Drovorub”, which as  @NSACyber points out translates directly as “woodcutter”  However, more importantly, “Drova” is slang in Russian for “drivers”, as in kernel drivers. So the name likely was chosen to mean “(security) driver slayer&#34;  https://t.co/yToULwp3xw\n— Dmitri Alperovitch (@DAlperovitch)  August 13, 2020\n  Drovorub adds to an already abundant cache of previously known tools and tactics used by APT 28, the Russian military hacking group that other researchers call Fancy Bear, Strontium, Pawn Storm, Sofacy, Sednit, and Tsar Team. The group’s hacks serve Russian government interests and target countries and organizations the Kremlin considers adversaries.\n In August, Microsoft reported that the group had been  hacking printers, video decoders, and other so-called Internet-of-things devices and using them as a beachhead to penetrate the computer networks they were connected to. In 2018, researchers from Cisco’s Talos group uncovered APT 28’s  infection of more than 500,000 consumer-grade routers in 54 countries that could then be used for a  range of nefarious purposes.\n  The  intrusion into the Democratic National Committee ahead of the 2016 election (along with a different Russian group, known as Cozy Bear) and then distributing damaging documents to sway voter opinion\n Thursday’s advisory didn’t identify the organizations Drovorub is targeting or provide even broad descriptions of the targets or geographies where they’re located. It also didn’t say how long the malware has been in the wild, how many known infections there have been to date, or how the hackers are infecting servers. APT 28 often relies on malicious spam or phishing attacks that either infect computers or steal passwords. The group also exploits vulnerabilities on devices that haven’t been patched.\n  Agency officials said that a key defense against Drovorub is to ensure that all security updates are installed. The advisory also urged that, at a minimum, servers run Linux kernel version 3.7 or later so that organizations can use improved code-signing protections, which use cryptographic certificates to ensure that an app, driver, or module comes from a known and trusted source and hasn’t been tampered with by anyone else.\n “Additionally, system owners are advised to configure systems to load only modules with a valid digital signature making it more difficult for an actor to introduce a malicious kernel module into the system,” the advisory stated.\n Also included are rules that network administrators can plug in to the Yara and Snort intrusion detection systems to catch and halt network traffic passing to or from control servers or to flag obfuscated Drovorub files or processes already running on a server.\n The 45-page document provides a level of technical detail and informed analysis that’s on par with some of the best research from private companies. The advisory is also the first to disclose the existence of this new and advanced malware. Those are things that are rarely available in government advisories. The report should be required reading for anyone managing a network.", "posttime": "2020-08-14 22:42:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,软件,警告,fbi,组织", "title": "NSA和FBI警告称新的Linux恶意软件威胁国家安全", "title_en": "NSA and FBI warn that new Linux malware threatens national security", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/08/nsa-and-fbi-warn-that-new-linux-malware-threatens-national-security/", "via": "", "real_tags": ["linux", "软件", "警告", "fbi", "组织"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1018030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(CNN Business)-今年早些时候，前IBM云计算领导者阿温德·克里希纳(Arvind Krishna)接手该公司的最高职位时，此举发出了一个明确的信号，表明该公司对未来的看法。\n蓝色巨人(Big Blue)正在云计算上下大赌注，以求在经历了几年的低迷增长后扭转命运。现在，IBM正在进行一项新的10亿美元投资，旨在加速这一战略。\n这家拥有109年历史的公司是美国最具标志性的科技公司之一，但近年来，随着其传统服务器和企业IT业务的老化，它已被年轻的科技巨头黯然失色。IBM的股票上一次达到峰值是在2013年，当时股价约为211美元(周三收盘时略低于127美元)。\n为了刺激新的动力，IBM一直在努力围绕云业务重新定位-这一战略得到了2018年收购开源软件提供商Red Hat的推动，Krishna帮助撮合了这一战略，并在4月份晋升为首席执行官，巩固了这一战略。2019年，云计算占IBM营收的27%。\n该公司正在混合云领域大展拳脚--在这种技术设置中，公司除了自己的内部服务器外，还可以使用多个云。IBM的平台为公司提供了更轻松地在这些不同环境之间导航的工具。\n专注于这一领域可以帮助IBM区别于亚马逊网络服务(Amazon Web Services)和微软Azure(Microsoft Azure)等更大的云计算公司。它还可以更好地定位IBM，以帮助其长期的企业客户，其中许多客户仍然严重依赖硬件，因为他们继续进行数字转型。\n为此，IBM告诉CNN Business，它已经拨出10亿美元投资于云空间的其他公司-第三方软件提供商和数字IT供应商-以扩大在其混合云平台上工作的公司的生态系统。\nIBM负责认知应用、区块链和生态系统的高级副总裁鲍勃·洛德在接受CNN商业采访时表示：当你拥有一个平台--无论是架构平台还是技术平台--当你利用生态系统时，扩展这个平台要容易得多。\n投资者一直在等待这样的举措。今年1月，MoffettNathanson分析师丽莎·埃利斯(Lisa Ellis)告诉CNN Business：IBM已经经历了长达六年的简单之旅-削减成本并受益于较低的税收。现在，它必须在云中展示势头。句号。&#34；\nIBM的投资基金将帮助激励那些第三方软件公司建立在自己的架构之上，比如支付迁移服务的成本。\n洛德说，这些企业使用IBM软件，所以当他们销售软件时，他们会拉出IBM软件。\n混合云模式是有意义的，特别是对于IBM长期合作的大型传统公司来说。在许多情况下，它们是在硬件数据系统上投入巨资的公司，可能正在运行不能失败的关键进程，比如与飞机通信的航空软件。\n使用混合云平台意味着公司可以继续使用其硬件系统存储需要的数据。他们还可以将其他流程转移到云上，为海量数据提供更大的灵活性，以及其他好处，如人工智能，以了解公司数据的趋势。\nNucleus Research首席执行官伊恩·坎贝尔(Ian Campbell)表示，许多公司都面临着一个问题，那就是如何转移到云端？Nucleus Research首席执行官伊恩·坎贝尔(Ian Campbell)表示。就像制造业一样，一切基本上都很正常，他们可能看不到这样做的理由。这就是混合云的用武之地，他们说，我们为您提供了一条轻松过渡到云的途径，而不必颠覆您对现有基础设施的投资。\n最终目标是使IBM技术成为其他公司软件下的基础层。这样的模式可以帮助IBM确保其技术是未来技术基础设施的关键组成部分，从而获得长期客户。\n坎贝尔说，迅速建立合作伙伴生态系统将使它们与竞争对手平起平坐。它显示了对云的坚定承诺，并激励任何可能一直在考虑(其他云提供商)的合作伙伴转而投资IBM。\n这笔投资是在许多公司受到冠状病毒大流行和随之而来的经济低迷的沉重打击之际进行的，一些公司已经削减了技术支出。IBM在6月份这个季度的收益同比下降了31%。\n虽然这场大流行在短期内具有破坏性，但大多数专家预计，它将加速许多公司向云计算转移，使现在可能成为此类投资的理想时机。\nIBM在这一领域面临着强大的竞争对手，包括亚马逊网络服务(Amazon Web Services)和微软Azure。\n然而，如果它奏效，回报可能是巨大的-IBM估计，混合云在未来两年代表着1.2万亿美元的市场机会。\nNucleus Research的坎贝尔表示：我认为你必须要信任他们，考虑到过去几个月是一段艰难的时期，他们正在经受住这场风暴，他们很可能会走出这场风暴，变得更强大。这可能是IBM目前能做的最好的投资……。如此多的传统IBM客户不得不向云过渡，但到目前为止还没有前进的道路。", "note_en": "New York (CNN Business) - When former IBM cloud leader Arvind Krishna took over the company&#39;s top job earlier this year, the move sent a clear signal about where the company sees its future.\n Big Blue is making a big bet on cloud computing as it seeks to reverse its fortunes following several years of sluggish growth. And now, IBM is making a new $1 billion investment aimed at accelerating that strategy.\n The 109-year old company is one of America&#39;s most iconic tech firms, but in recent years it has been eclipsed by younger tech giants as its legacy server and enterprise IT businesses age. IBM&#39;s shares last peaked in 2013 around $211 (they closed Wednesday just shy of $127).\n In an effort to spur new momentum, IBM has been working to reorient itself around the cloud business — a strategy boosted by its 2018 acquisition of open source software provider Red Hat, which Krishna helped to broker, and solidified by his ascension to CEO in April. In 2019, cloud represented 27% of IBM&#39;s revenue.\n The company is making a big play in &#34;hybrid cloud&#34; — a technical setup wherein companies may use multiple clouds in addition to their own on-premises servers. IBM&#39;s platform gives companies tools to more easily navigate between those various environments.\n Focusing in this area could help set IBM apart from bigger cloud players like Amazon Web Services and Microsoft Azure. It could also better position IBM to help its longtime corporate clients, many of whom still rely heavily on hardware, as they continue their digital transformations.\n To that end, IBM told CNN Business it has set aside $1 billion to invest in other companies in the cloud space — third party software providers and digital IT vendors — to grow the ecosystem of firms working on its hybrid cloud platform.\n &#34;When you have a platform — either an architectural platform or a technology platform — it&#39;s a lot easier to scale that platform when you leverage an ecosystem,&#34; Bob Lord, IBM&#39;s senior vice president of cognitive applications, blockchain and ecosystems, told CNN Business.\n Investors have been waiting for just such a move. In January, MoffettNathanson analyst Lisa Ellis told CNN Business: &#34;IBM has had a long six-year journey of doing easy stuff — cost cutting and benefiting from lower taxes. It now has to demonstrate momentum in cloud. Period.&#34;\n  IBM&#39;s investment fund will help provide incentives for those third party software companies to build on top of its own architecture, such as covering the costs of migration services.\n &#34;These are businesses that consume IBM software, so that when they sell their software, they pull IBM software,&#34; Lord said.\n A hybrid cloud model makes sense, especially for the large, legacy companies IBM has long worked with. In many cases, they are firms that have spent heavily on hardware data systems and could be running crucial processes that can&#39;t afford to fail, such as airline software that communicates with planes.\n Using a hybrid cloud platform means companies can keep using their hardware systems for data that requires it. And they can move other processes onto the cloud, providing greater flexibility for large amounts of data, as well as other benefits such as artificial intelligence to understand trends in a company&#39;s data.\n &#34;Many corporations are facing a problem of, &#39;how do I shift to the cloud?&#39;&#34; Nucleus Research CEO Ian Campbell said. &#34;Like manufacturing, where everything is essentially fine and running, they may not see a reason to do it. That&#39;s where hybrid cloud comes in and says, &#39;we have an easy path for you to make the transition to the cloud without having to upend your investment in existing infrastructure.&#39;&#34;\n The ultimate aim is to make IBM technology the foundational layer that sits under other companies&#39; software. Such a model could help IBM secure longtime customers by ensuring its technology is a crucial component in their technical infrastructure in the future.\n &#34;Quickly building out a partner ecosystem is going to put them on par with their competitors,&#34; Campbell said. &#34;It shows a strong commitment to the cloud and provides an incentive for any of the partners that may have been looking at (other cloud providers) to invest in IBM instead.&#34;\n  The investment comes as many corporations have been hit hard by the coronavirus pandemic and the ensuing economic downturn, and some have pulled back on their tech spending. IBM&#39;s earnings fell 31% year-over-year in the June quarter.\n While the pandemic has been disruptive in the short term, most experts expect it will accelerate many companies&#39; move to the cloud, making it perhaps the ideal time for such an investment.\n IBM is up against tough competitors in the space, including Amazon Web Services and Microsoft Azure.\n If it works, though, the payoff could be huge — IBM estimates that hybrid cloud represents a $1.2 trillion market opportunity over the next two years.\n &#34;I think you&#39;ve got to give them credit, given that the last few months have been a tough time, they&#39;re weathering that storm and they&#39;re likely to come out of it stronger,&#34; said Nucleus Research&#39;s Campbell. &#34;It&#39;s probably the best investment IBM could make right now ... So many traditional IBM customers have to make the transition to the cloud but haven&#39;t had a path forward until now.&#34;", "posttime": "2020-08-14 22:39:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,历史,ibm", "title": "拥有109年历史的IBM正计划与亚马逊展开竞争。下面是如何", "title_en": "109 Year-old IBM is planning to take on Amazon. Here's how", "transed": 1, "url": "https://lite.cnn.com/en/article/h_ea74d9d628653181427f3c5354c6d84a", "via": "", "real_tags": ["amazon", "亚马逊", "历史", "ibm"]}, {"category": "", "categoryclass": "", "imagename": "1612c16cbcdbaead6f3c1c2d81b50820.jpg", "infoid": 1018029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第二级，它仍然削弱了苹果的说法，即他们自己的寻租行为是合理的，因为它为App Store客户提供了更好的用户体验。\n如果他们真的关心自己的应用程序的用户体验，他们会使用谷歌的IAP，这在客观上更容易让消费者使用。\n然而，这并不是苹果的虚伪。他们的App Store规则和Apple Music这件事都有相同的目的：最大化苹果的收入。\n苹果的立场完全是出于金钱和对其平台的控制。这(可能)是合法的，但我看到这么多人似乎接受了“这是为了我们好”的论点，我只能翻白眼笑了。\n第二级并不能让它变得不那么卑鄙，因为他们会强迫开发者通过他们的支付系统获得30%的提成，但是当他们可以节省一美元并绕过支付系统时，这是他们第一件要做的事情。\n2级你确定吗？堡垒之夜没有出现在Play Store上的整个问题难道不是因为Epici不想让谷歌分一杯羹吗？\n二级LMAO如果谷歌在iOS上这么做，即使苹果允许，你们也会大吃一惊的。\n级别2是的，应用商店也应该如此，因为这是开发人员所要求的。\n如果苹果认为在Android上做这件事是合理的，为什么他们会公开呼吁他们最大的开发者在媒体上要求在iOS上做同样的事情？这是完全合理的要求，正如苹果在其他平台上做同样的事情所证明的那样。\n微软商店也不会从iTunes或iCloud Windows客户端收入中提成。\n在Google Play上下载的另一类应用中提供产品的2级开发人员必须使用Google Play应用内计费作为支付方式，但以下情况除外：\n如果我是谷歌，我会把他们踢出地狱。话又说回来，苹果可能会进行报复。\n2级你有消息来源吗？因为如果是这样的话，作为一个开发人员，我已经被敲诈了。我认为更有可能的是，谷歌只是在顺其自然。", "note_en": "level 2  It still undercuts Apple’s claims that their own rent-seeking behavior is justified because it provides a better user experience for App Store customers.\n If they actually cared about the user experience for their own app, they would use Google’s IAP, which is objectively easier for consumers to use.\n However, this is not a case of Apple being hypocritical. Their App Store rule and this Apple Music thing both serve the same purpose: maximizing Apple’s revenue.\n Apple’s position is entirely motivated by money and control over their platform. It’s (probably) legal, but I see so many people seemingly accepting the “it’s for our own good” argument that I just have to roll my eyes and laugh.\n       level 2  Doesn&#39;t make it less scummy, since they force developers through their payment system to get their 30% cut, but when they can save a buck and circumvent the payment system it&#39;s the first thing they do.\n level 2  Are you sure? Wasn&#39;t that the whole issue with Fortnite not being on the Play Store because Epic didn&#39;t want Google to take a cut.\n  level 2  Lmao if google did this on ios you guys would go ape shit even if apple allowed it\n   level 2  Yes, and so should the App Store&#39;s as this is what developers are asking for.\n If Apple sees this as a reasonable thing to do on Android, why do they publicly call out their biggest developers in the press for asking for the same thing on iOS? It is an entirely reasonable thing to ask for, as Apple proves by doing the same on other platforms.\n The Microsoft Store doesn&#39;t take a cut of iTunes or iCloud Windows&#39; client revenues either.\n      level 2  Developers offering products within another category of app downloaded on Google Play must use Google Play In-app Billing as the method of payment, except for the following cases:\n level 2  If I were Google, I&#39;d kick them off just for the hell of it. Then again, Apple would probably retaliate.\n  level 2  Do you have a source on that? Because if so, then I&#39;ve been getting ripped off as a developer. I think it&#39;s more likely that Google&#39;s just letting it slide.", "posttime": "2020-08-14 22:39:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,android,apple,google,music", "title": "Android上的Apple Music询问用户卡详细信息以避免谷歌30%的提成", "title_en": "Apple Music on Android asks user's card details to avoid Google's 30% cut", "transed": 1, "url": "https://reddit.com/r/apple/comments/hb0jl8/", "via": "", "real_tags": ["谷歌", "android", "apple", "google", "music"]}, {"category": "", "categoryclass": "", "imagename": "12f8a9b8d093061fa72fbbb934bb79a2.jpg", "infoid": 1018028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "O​在过去的四十年里，学者们一直试图将维京人作为和平商人的观念叠加到狂暴分子和角盔的传统上，但没有多少成功。关于维京时代的事件及其时间线几乎没有分歧，从793年6月8日(对林迪斯法恩的意外袭击)到1066年9月25日，“硬顾问哈拉尔德”哈拉尔德国王哈拉尔德一世在斯坦福桥战役中阵亡。正如尼尔·普莱斯(Neil Price)指出的那样，所有这一切都应该被视为原始历史，而不是历史。维京人自己不会写字，除了木头或石头上刻的简短的符文铭文，而且除了“奥拉夫国王第四年”之外没有日期系统等等。王室继承是原地踏步的唯一方式。我们称之为维京时代的这一系列事件是从爱尔兰到拜占庭的许多受害者的描述中拼凑而成的。\n然而，普莱斯的书集中在“是什么让(维京人)活着，他们是如何思考和感受的”。他们赚了多少钱？装备一支维京舰队需要多少劳力？维京人认为女人死后会发生什么事？(当然，勇士们去了瓦尔哈拉。)。在出土的北欧海盗坟墓中有最后一个问题的线索，但这些发现-普莱斯是乌普萨拉大学的考古学教授-往往令人费解。还有后勤方面的问题。考虑到维京人的财富，人们不可能忽视哥特兰岛，那里发现了数百种白银，几乎相当于每个农场一个-在斯堪的纳维亚和波罗的海发现的白银迪拉姆总数超过100万迪拉姆，是在穆斯林近东发现的原产地白银迪拉姆的九倍。普莱斯写道，这“根本不可信”，“几乎所有的房主都把家里的现金藏在后院，然后在没有告诉任何人之前就去世了”。后来的报道声称，维京人相信他们会在来世享受他们埋藏的财富。消息来源不可靠，但至少可以解释这一现象。\n当然，最大的问题是，是什么让维京人取得了这么长时间的成功。西欧由好战的君主和贵族统治，而穆斯林西班牙、拜占庭帝国和巴格达哈里发国都以不同的方式组织战争。普莱斯认为，我们既需要史前历史，也需要原始史。早在林迪斯法恩之前，两件创伤性事件就影响了北方世界。其一是罗马帝国的崩溃，这种动荡导致了一种由失业的雇佣兵和流浪的军团组成的“黑帮文化”。更糟糕的，也是更好的证据，是536年、539/540和可能547年的火山喷发。第二个起源于现在的萨尔瓦多的伊洛潘戈，向大气中排放了大约90立方公里的灰尘、火山灰和气溶胶。整个世界都受到了影响，但生长季节短，农业往往处于边缘的斯堪的纳维亚半岛受到的影响最大。据认为，多达一半的人口死于饥饿。斯堪的纳维亚神话的核心是盛冬，三个冬天之间没有夏天，这可能曾经是一个事实。\n在绝望的情况下，穷人会死去，但幸存者会扩大他们的财产。饥荒很可能加强了后罗马军事化精英的力量，他们在乌普萨拉和瓦尔斯加德的巨型土丘和船葬中，以及挪威博格的巨大木制大厅(270英尺长，有大教堂那么大)中留下了痕迹。乌普萨拉的另一个大厅有由长矛制成的门铰链，门尖朝向中心，这样你就可以通过武器入口进入：所有这些都是“令人眼花缭乱的杀戮物质文化”的一部分。但在后罗马时代的长期衰退中，几乎没有什么办法来支付这笔费用，这导致了现有市场的混乱。突袭行动看起来一定很吸引人。\n普莱斯还注意到了维京人性别失衡的重要性。挪威社会并不完全是一夫多妻制，因为一夫一妻制是正常的，但它是一夫多妻制的。根据不来梅的亚当在11世纪的一篇论文，富人和皇室有妻子、次要妻子和妃子，有时“数量无限”。不平衡的“社会-性经济”ʼ可能是因为好战社会中养育男婴比养育女孩更仔细的习惯而变得更糟，导致女婴因疏忽而被杀害。瑞典的骨骼研究显示，大约7%的维京男性在儿童时期营养不良，而女性的这一比例为37%。精英垄断和不平等的存活率肯定造就了我们现在所说的“非自愿独身者”的下层阶级，他们是心怀不满的年轻人，愤怒、绝望，很容易招募到。\n在几个小插曲中，普莱斯想象了挪威贫穷的西海岸上的一个小儿子，他童年的心上人有了一枚新胸针：一个夏天成功突袭的男孩送给他的礼物。年轻的奥姆或冈纳打算做什么？不仅\n北欧海盗社会并不是同质化的。他们与许多不同的文化打交道，他们生活在不同的环境中，从丹麦和瑞典的牧场到挪威和冰岛的亚北极冻土带。在11世纪早期，世界上旅行最多的女性一定是古德里德·索比亚纳多蒂尔，她非凡的旅程证明了维京人所走过的遥远距离。她在北美生了一个孩子，在文兰认识了原住民，吃了葡萄，去了罗马朝圣，在意大利喝了酒，在冰岛以修女的身份去世。维京人生活在与萨米人密切接触的地方，他们称萨米人为芬兰人。在他的早期著作“维京人的方式”中，普莱斯指出，挪威人和瑞典人至少在某些方面可以被视为与从格陵兰岛延伸到西伯利亚的“环极”文化相似，特别是在看起来像萨满教的行为上。\n但是，我们对维京人了解得越多，就越难对他们做出任何确定的评价。这尤其适用于我们拥有最多考古证据的地区-埋葬做法。出土的北欧海盗坟墓的数量只有几百万个，唯一的规则是它们都是不同的。带武器埋葬的男人很常见，但在比尔卡一座设施特别齐全的坟墓里的主人，被埋葬时坐着斧头、剑、矛、弓和箭，现在通过DNA确认是女性。相反，在几个场合发现了穿着女装、戴着女性配饰的男性，其中一名男子在安多弗附近被埋葬了全套女性珠宝。用铁杖埋葬的女人可能是伏地魔、女巫、塞瑟尔魔法的实践者，这对男人来说是可耻的交易。但奥丁似乎一直是这种魔法的最高代表，所以现在一些学者写到了“奥丁这个酷儿”。也许，就像在环极地文化中一样，所有的魔术工作者都被认为是“不同的性别”。萨满有自己的性别。\n从他们的埋葬实践中很难得出关于维京人信仰的任何总体结论。他们进行了火化和埋葬，船葬和手推车葬。在瑞典，鸟蛋通常被放入火化的骨灰中。用两匹马埋葬一个人可能是一种贡品，但为什么要把马一分为二，然后交换一半呢？几十年后，一艘装满身体的小船被安放在上面，龙骨正好覆盖着坟墓，这一仪式多年来随着更多的船和更多的人重复着，如何解释这种适度的埋葬？在爱沙尼亚海岸外的萨尔姆，发现了两艘似乎载有40名瑞典突袭者的船只，掩埋在地下，展示了他们的战伤，抓着鱼和鸟，以及切成块的牛肉或猪肉。但为什么要向他们扔游戏棋子呢？一个拿剑的人嘴里放着一位国王。这是胜利者嘲笑的标志还是尊重的标志？如何理解“每具身体手中紧握着一块光滑的白色鹅卵石的一系列埋葬”？如果骨灰中的鸡蛋表达了对新生活、孵化的希望，那么白色的鹅卵石可能是象征性的鸡蛋？\n普莱斯避免了这种猜测，尽管我们对这种惊人的多样性没有很好的解释。他同样对我们可以从“北欧神话”中重建信仰体系的想法不屑一顾。维京人没有公认的经文，只有故事。他们也没有被接受的宗教，只是普莱斯所说的“宗教选民”，因为方言与标准语言不同，所以他们彼此不同。考古学在其他领域提供了更确凿的事实和更坚定的结论。哥特兰的银器储备足够令人惊讶，但它们只占维京人收入的一小部分。据认为，多达1.25亿来自巴格达哈里发国的银迪拉姆，约340吨金属，在10世纪向北支付毛皮和奴隶的费用。法兰克帝国在9世纪的回报要小得多，但仍高达700万银分左右，在贫穷的西欧流通的硬币中占有很高的比例。北欧海盗偷走了“法兰克帝国全部货币产出的大约14%”，这还不包括其他种类的战利品，比如奴隶。\n还有获取战利品所涉及的支出问题。维京海盗的帆是用涂了油的羊毛制成的，大约需要50只羊才能提供一张帆的羊毛。羊毛必须纺纱和编织：在一台巨大的维京织布机上进行沉重的合作工作(《瓦尔基里之歌》是一首劳动歌曲，但瓦尔基里夫妇用人体肠道编织的网是战争和死亡)。你最好有一张备用的帆，船员们需要衣服、帐篷和绳索，所有这些都需要更多的羊毛、油脂、大麻、亚麻和海豹皮。这将意味着30个人工作一年，只安装一艘船和它的船员。11世纪的丹麦和挪威舰队需要大约两艘。\nS​提醒我们，尽管维京人有着奇怪的风俗习惯和不可知的心理，但他们比我们可能愿意承认的更像我们。但他们身上有些可怕的东西。不来梅的亚当描述了乌普萨拉的奇怪仪式，在那里，人和动物被大量绞死在一个神圣的小树林里，作为对神的祭品。在瑞典的弗雷岛(Frös Island)发现了类似的东西：埋在教堂祭坛下的一棵白桦树的树桩，周围环绕着人和动物的骨头和身体部位，包括猪和羊的骨头，以及六只麋鹿和五只熊。他们甚至把熊挂在圣树上吗？\n维京人的葬礼可能也是可怕的事情，而且不仅仅是对受害者来说。在奥塞伯格船葬中发现的物品的工艺非常令人钦佩，但仪式似乎完成得非常仓促，似乎埋葬者惊慌失措。房间是用任何方便的旧木块密封起来的，木头敲得太快了，木头凹陷了，钉子弯曲或折断了。\n帕特里克·沃马尔德曾评论说，维京人似乎很少遭受疯狂之苦，尽管也有像索吉尔·哈瓦森(Thorgeir Hávarsson)这样的精神病患者，他在“福斯特兄弟传奇”(The Saga Of FosterBrothers)中说，仅仅因为一名无辜的旁观者看起来如此诱人地愿意接受打击，他就用斧头砍倒了一名无辜的旁观者。他们有一个荣誉准则。在1012年Thorkel的高个子，一个著名的船长，是说，默塞堡的Thietmar，已经提供了他所拥有的一切，除了他的船，为被俘的坎特伯雷大主教»lfheah，谁拒绝支付赎金，当»lfheah被杀时，无论如何，投掷骨头和斧头结束，索克尔改变立场，并采取他的人离开，以服务？也许他认为杀死一个手无寸铁的老人是一种英勇的行为，而不是勇士般的行为。\n考虑到伊本·法德兰(Ibn Fadlan)描述的罗斯葬礼上轮奸和杀害奴隶的骇人听闻的场面，最近的一位学者声称，这应该终结维京人是英雄的想法：他们就是残忍。这太天真了。只有在漫画世界里，英雄主义和残忍才是相互排斥的。正如普莱斯的书中所说的那样，他们经常一起去。", "note_en": "O ​ the last forty years, academics have tried, without much success, to superimpose the idea of the Vikings as peaceful traders on the berserkers-and-horned-helmets tradition. There is little disagreement about the events of the Viking Age or its timeline, stretching from 8 June 793 (the unexpected raid on Lindisfarne) to 25 September 1066, when King Haraldr Harðráði, ‘Hard-Counsel Harald’, died at the Battle of Stamford Bridge. As Neil Price points out, all this should be seen as protohistory rather than history. The Vikings themselves couldn’t write, except for short runic inscriptions carved in wood or stone, and had no dating system beyond ‘the fourth year of King Olaf’ and so on. Royal succession was the only way to mark time. The sequence of events we refer to as the Viking Age was put together from the accounts of their many victims, from Ireland to Byzantium.\n Price’s book, however, centres on ‘what made [the Vikings] tick, how they thought and felt’. How much money did they make? How much labour went into fitting out a Viking fleet? What did Vikings think happened to women when they died? (Warriors, of course, went to Valhalla.) There are clues to this last question in excavated Viking graves, but these discoveries – Price is professor of archaeology at Uppsala University – are often inscrutable. There are logistical questions too. In considering the wealth of the Vikings, it’s impossible to ignore the island of Gotland, where hundreds of hoards of silver have been found, almost one for every farm – contributing to a total of more than a million silver dirhams found in Scandinavia and the Baltic, nine times as many as have been found in their point of origin in the Muslim Near East. It’s ‘simply not credible’, Price writes, ‘that virtually all homeowners concealed their family cash in the backyard and then died before telling anyone about it’. Later accounts claim that the Vikings believed they would enjoy their buried wealth in the afterlife. The sources aren’t reliable, but it does at least explain the phenomenon.\n The biggest question, of course, is what made the Vikings so successful for so long. Western Europe was dominated by warlike monarchs and aristocracies, while Muslim Spain, the Byzantine Empire and the Caliphate of Baghdad were all in their different ways organised for warfare. Price suggests that we need a prehistory as well as a protohistory. Two traumatic events affected the northern world long before Lindisfarne. One was the collapse of the Roman Empire, a destabilisation that led to a kind of ‘gangster culture’ of unemployed mercenaries and roving warbands. Even worse, and better evidenced, were the volcanic eruptions of 536, 539/540 and possibly 547. The second, which originated from Ilopango in what is now El Salvador, threw around ninety cubic kilometres of dust, ash and aerosols into the atmosphere. The entire world suffered, but Scandinavia, with its short growing season and often marginal agriculture, suffered most. It’s thought as much as half the population died of starvation. At the heart of Norse mythology is the  Fimbulwinter, three winters with no summers in between, which may once have been a fact.\n In desperate circumstances, the poor die but the survivors expand their holdings. The famine may well have strengthened the post-Roman militarised elites who have left their traces in the giant mounds and boat-burials of Uppsala and Valsgärde, and the enormous wooden hall at Borg in Norway, which at 270 feet long is as big as a cathedral. Another hall at Uppsala had door hinges made of spears, their points facing towards the centre, so that you entered through a weapon portal: all part of ‘a dazzling material culture of killing’. But there were few ways to pay for this in the middle of the long post-Roman slump, which entailed the disruption of established markets. Raiding must have looked very attractive.\n Price also notes the significance of the Vikings’ gender imbalance. Norse society was not exactly polygamous, for monogamy was normal, but it was polygynous. Rich men and royalty had wives, subsidiary wives and concubines, sometimes, according to an 11th-century treatise by Adam of Bremen, ‘in unlimited number’. An unbalanced ‘socio-sexual economyʼ was probably made worse by the habit in warlike societies of rearing baby boys more carefully than girls, leading to female infanticide by neglect. Skeleton studies in Sweden show that about 7 per cent of Viking men were malnourished as children, compared to 37 per cent of women. Elite monopolisation and differential survival rates must have created an underclass of what we would now call ‘involuntary celibates’, disaffected young men, angry, desperate and easy to recruit.\n In one of several vignettes, Price imagines a younger son on the impoverished west coast of Norway, whose childhood sweetheart has a new brooch: a present from a boy who spent a successful summer raiding. What is young Orm or Gunnar going to do? Not only does he need money for the bride-price paid to her family, he needs a reputation: ‘The act of acquiring silver was as important as the silver itself.’ And if he went raiding he might in any case acquire a woman for free. DNA has shown that ‘a very large proportion – even the majority – of female settlers in Iceland were of Scottish or Irish heritage.’\n Traumatised societies, militarised elites, disaffected youths: they all help explain the Viking phenomenon. But did they think like us? Price points out that the Vikings decorated everything that had a surface, including themselves. Ibn Fadlan, the Arab traveller who met a party of the blond ‘Rus’ somewhere in Eastern Europe in the 920s – and whose horrifying account of a Viking funeral has been largely confirmed by archaeological finds – said that they were covered in what must have been tattoos. ‘Each man, from the tip of his toes to his neck, is covered in dark green lines, pictures and such like.’ No Viking skin has survived, but their teeth have. It seems there was a male fashion for filing horizontal grooves along the upper incisors, which were probably filled with coloured resin. A Viking smile must have looked very odd. But what the point of this fashion was, we don’t know.\n Nor do we know what they thought about their own inner lives. Vikings recognised  hamr, or ‘shape’, as more or less equivalent to ‘body’, though some people were  eigi einhamr, ‘not of one shape’: they were werewolves, or worse.  Hugr could correspond more or less to ‘mind’. But Vikings also seem to have thought that each of us has a  hamingja, a personal ‘luck’, which can on occasion leave the body (a very bad sign). The fourth part of us is a female  fylgja, a ‘follower’ or ‘fetch’, inherited from our ancestors. Price doesn’t claim to know what a ‘fetch’ does, but he writes that the belief dies hard. If you ask modern Icelanders whether they believe in elves and the  huldufólk or ‘hidden people’, they will roll their eyes, but ask them about their  fylgjur and you get ‘a level stare and perhaps a change of subject’.\n Viking society wasn’t homogeneous. They had dealings with many different cultures and they lived in varied environments, from Danish and Swedish pasture to the sub-Arctic tundra of Norway and Iceland. In the early 11th century the best-travelled woman in the world must have been Gudrid Thorbjarnardóttir, whose remarkable journeys demonstrate the great distances the Vikings covered. She gave birth to a child in North America, met people of the First Nations and ate grapes in Vinland, made a pilgrimage to Rome and drank wine in Italy, and died as a nun in Iceland. Vikings lived in close contact with the Sámi people, whom they called Finns. In his earlier book,  The Viking Way, Price pointed out that Norwegians and Swedes, at least, might be regarded as in some ways similar to the ‘circumpolar’ cultures which stretch from Greenland to Siberia, notably in what looks like shamanistic behaviour.\n But the more we know about the Vikings, the harder it becomes to say anything certain about them. This applies in particular to the area for which we have most archaeological evidence – burial practices. The number of excavated Viking graves is in the low millions, and the only rule is that they’re all different. Men buried with weapons are common, but the occupant of a particularly well-furnished grave in Birka, who was buried seated with axe, sword, spears, bow and arrows, is now confirmed by DNA as female. Conversely men buried in women’s clothes and with feminine accessories have been found on several occasions, including one man buried with a full set of female jewellery near Andover. Women buried with iron staffs may have been  völvur, sorceresses, practitioners of the  seithr magic which was shameful for men to deal in. But Odin seems to have been the supreme exponent of just this kind of magic, so some scholars now write about ‘Odin the Queer’. Possibly, as in circumpolar cultures,  all the workers of magic and sorcery were regarded as ‘differently gendered’. Shamans have a gender all their own.\n It is hard to come to any overall conclusions about Viking belief from their burial practices. They performed cremation and inhumation, boat burial and barrow burial. In Sweden, birds’ eggs were often placed in cremated ashes. Burying someone with two horses could be a kind of tribute, but why bisect the horses  and then swap the halves over? What explains the modest burial which, decades later, had a boat full of bodies placed over it, the keel exactly covering the grave, a ritual repeated with more boats and more men over the years? In Salme, off the coast of Estonia, two boats have been found which appear to contain forty Swedish raiders, buried displaying their battle wounds, clutching fish and birds and cuts of beef or pork. But why throw gaming pieces over them? One sword-carrier has a king placed in his mouth. Was it a mark of derision from the victors or of respect? What to make of ‘a line of burials in which every corpse clasps a smooth white pebble in their hand’? If the eggs in the ashes express hope for a new life, a hatching, then perhaps the white pebbles are symbolic eggs?\n Price avoids such speculation, though we have no good explanations for this astonishing diversity. He is similarly dismissive of the idea that we can reconstruct a belief system from the ‘Norse myths’. Vikings had no accepted scripture, just stories. They had no accepted religion either, just what Price calls ‘religiolects’, differing from one another as dialects differ from a standard language. Archaeology offers harder facts and firmer conclusions in other areas. The silver hoards of Gotland are surprising enough, but they represent only a fraction of the Vikings’ take. It’s thought that as many as 125 million silver dirhams from the Caliphate of Baghdad, some 340 tonnes of metal, went north in the tenth century as payment for furs and slaves. The ninth-century payoffs from the Frankish Empire were much less substantial, but still amounted to around seven million silver pennies, a high proportion of the coins in circulation in impoverished Western Europe. The Vikings made off with ‘approximately 14 per cent of the entire monetary output of the Frankish Empire’, and that isn’t counting other kinds of loot, such as slaves.\n There is also the matter of the expenditure involved in gaining the loot. Viking sails were made of greased wool and it took about fifty sheep to provide the wool for one sail. The wool had to be spun and woven: heavy, co-operative work on a great Viking loom (the ‘Song of the Valkyries’ is in the form of a work song, but the web the Valkyries are weaving from human intestines is war and death). You would be wise to have a spare sail, and the crew would need clothes and tents and cordage, all demanding more wool and grease and hemp and flax and sealskins. That would mean thirty people working for a year to fit out just one ship and its crew. The 11th-century fleets of Denmark and Norway would have required about two million sheep. As for a major warship like the one displayed at the British Museum’s Vikings exhibition in 2014, that would represent something like a year’s work for a team of eight skilled men, not counting the time taken to produce the wood and iron needed.\n Price doesn’t quite describe this as a pirate economy, but he draws the parallel. In the central section of his book he offers something like a narrative history of the Viking Age, but focusing on general trends rather than single dates and events. As he sees it, the first development was ‘maritoria’, markets organised by many petty kings, especially those in geographically fragmented western Norway. These were trade centres, but were dependent on the ‘maritime military power’ exercised by leaders who bore nicknames such as ‘Cruiser’, ‘Screamer’, ‘Sails Alone’ and ‘Sails at Dusk’ (forget about ‘peaceful traders’). Even Harald Fairhair, who became a proper historical king, may have had his nickname cleaned up by later saga writers: he started off as Harald  Lúfa, ‘Mophead’.\n This pirate world generated what Price calls (again a term borrowed from the 17th and 18th centuries) a ‘hydrarchy’: there were no overall leaders, no pirate monarchs, and indeed no formal organisation. This made them difficult to deal with, because, as everyone soon found out, making a deal with or buying off one group of Vikings meant nothing to another. A Viking army, at least until the late stages when the kings of Denmark and Sweden (but probably not Norway) had some loose control over their subjects, was a confederation of brotherhoods bound, if at all, by temporary oaths. Gangs left and more gangs joined, depending on the opportunities available.\n The ‘real catalyst’ for the big surge in Viking activity in the ninth century, Price argues, was the civil war in the Frankish Empire between the grandsons of Charlemagne. Anglo-Saxon England was already divided, and Ireland and Scotland even more so. The Vikings came in like the tide, flowing into anywhere they found a gap. In the east, the great rivers of Ukraine and Russia were like the Hudson and the St Lawrence to explorers centuries later, only these had the markets of Byzantium and Baghdad at the end.\n S ​   remind us that the Vikings, for all their strange customs and unknowable psychology, were more like us than we might like to admit. But there was something macabre about them. Adam of Bremen describes the strange rituals at Uppsala, where men and animals were hanged in large numbers in a sacred grove as sacrifices to the gods. Something like this has been discovered at Frösö, or ‘Frey’s Island’, in Sweden: the stump of a birch tree buried under the church altar, surrounded by human and animal bones and body parts, including those of pigs and sheep, as well as six elks and five bears. Did they even hang bears from sacred trees?\n Viking funerals may have been scary affairs as well, and not just for the victims. The craftsmanship of the objects found in the Oseberg boat-burial has been much admired, but the ceremony seems to have been completed in terrible haste, as if the burial party panicked. The chamber was sealed with any old pieces of wood that were handy, hammered in so fast that the wood was dented and the nails bent or broken.\n Patrick Wormald once commented that Vikings rarely seemed to have suffered from madness, though there were psychopaths like Thorgeir Hávarsson, who is said in ‘The Saga of the Fosterbrothers’ to have axed down one innocent bystander just because he looked so temptingly open to the blow. They had a code of honour. In 1012 Thorkel the Tall, a famous captain, is said by Thietmar of Merseburg to have offered everything he had, except his ship, for the life of the captured Archbishop Ælfheah of Canterbury, who had refused to pay a ransom; when Ælfheah was killed anyway, pelted with bones and finished off with an axe, Thorkel changed sides and took his men off to serve Æthelred the Unready. Perhaps he thought killing a defenceless old man was  ódrengiligt, not warrior-like behaviour.\n A recent scholar, considering the appalling scene of gang rape and slave murder at the Rus funeral described by Ibn Fadlan, claimed that this ought to put paid to the idea that the Vikings were heroic: they were just cruel. This is naive. Heroism and cruelty are mutually exclusive only in the world of comic books. As Price’s book makes clear, they have often gone together.", "posttime": "2020-08-14 22:37:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hang,维京", "title": "他们甚至有吊熊吗？", "title_en": "Did they even hang bears?", "transed": 1, "url": "https://www.lrb.co.uk/the-paper/v42/n16/tom-shippey/did-they-even-hang-bears", "via": "", "real_tags": ["hang", "维京"]}, {"category": "", "categoryclass": "", "imagename": "f1657ab9d04767dde977d75665d3514b.jpg", "infoid": 1018027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "宾夕法尼亚州格伦·米尔斯(Glen Mills)。-迈克·麦克维(Mike McVeigh)在病毒来袭时，已经卖车16年了-他担心这些技能已经成为一门失传的艺术。他46岁，失业了。在宾夕法尼亚州所有不必要的企业于3月下旬关闭后，他在大卫·道奇(David Dodge)的老板让销售人员休假。麦克维当晚离开了经销商，在一家瓦瓦停了下来，整理一下自己的想法，并打电话给另一位推销员布拉德·罗斯(Brad Ross)。\n麦克维说：“我们讨论了我们可以做些什么来让我们的头浮出水面。”“我们总共要养活八个孩子，养家糊口。”\n一个月后，他被叫回来工作。但一切都变了。一度繁荣的经济已经支离破碎。每个人都戴着口罩。陈列室对顾客关闭。试驾是单独进行的。交易需要主要在网上完成。没有人想和任何人靠得太近。\n“如果我不能与你建立联系，如果我不能做我的表演技巧，如果我看不到你，”麦克维说，“我以为我完了。”\n新冠肺炎疫情迫使数以千万计的人失业，数以千计的企业倒闭，其中最初几乎占所有为汽车经销商工作的人的四分之一。但幸存下来的工人和公司经常发现，它并没有像往常一样恢复业务。\n这包括销售汽车-在一个突然疏远的社会里，这可能是最终的握手交易。\n麦克维回到了一家匆忙重塑的经销商，放弃了几十年来一直依赖的吸引潜在买家进入展厅的公式，让销售人员发挥他们的魔力。这场流行病意味着即使是有动力的购车者也在犹豫是否去经销商那里。零利率融资和数千美元的回扣几乎没有改变这一点。根据Cox Automotive的数据，截至6月份的第二季度，美国汽车销量估计下降了35%，希望购买的人数急剧下降。\n为了生存，汽车推销员不得不尝试一些新的东西。经销商开始强调在线销售和向客户交付汽车。这有助于找到新的潜在客户，并缓解了人们对大流行的一些担忧。但交易仍需完成，文件和钥匙被保护在一个黄色文件夹中，表示即将出售。这就是麦克维的用武之地，他是一位戴着老式老花镜的推销员，戴着口罩尝试着新的工作方式。\n“我甚至不知道这是可能的，”他说。“但我再也不会走回头路了。”\n现在，7月的最后一天，麦克维坐在陈列室中心的办公桌前。那是时间紧要关头。这个月的最后一天对汽车销售仍然至关重要。工厂回扣通常会随着日历的变化而变化。汽车制造商将有利可图的销售目标与月度总额挂钩，尽管一些制造商，如大卫·道奇(David Dodge)的汽车供应商菲亚特克莱斯勒(Fiat Chrysler)，在大流行开始后暂停了激励计划，销量开始暴跌。尽管如此，每个推销员还是根据月份来判断他或她的成功。\n那天早上，这家经销商的老板大卫·凯莱赫(David Kelleher)-以主演自己的当地电视广告而闻名-在Zoom电话会议上告诉他的经理们，不要担心走进展厅的人数。自封锁以来，人流量一直在下降-宾夕法尼亚州对汽车经销商的关闭是全国最严格和持续时间最长的之一。然而，大卫·道奇(David Dodge)的销售额却在上升。众所周知，推销员靠前门过日子的日子已经一去不复返了。\n“现在不再是那个世界了，”凯莱赫说。“我们不会回去的。”\n在新世界，麦克维在4月份售出了零辆汽车。但他在5月份售出了58台-这是他有史以来最好的一个月-通过Zoom和短信达成了交易。他使用FaceTime与客户一起试驾，因为没有人想和他一起坐车，即使是戴着面具。\n经销商也很兴旺，5月份售出了216辆新车和二手车。6月份的销量甚至更好：253辆。\n与3月和4月相比，这是一个令人震惊的转变，当时州冠状病毒限制导致经销商损失75万美元。凯莱赫让他的大多数员工休假，但他继续支付他们的医疗保险，并用140万美元的联邦薪资保护计划(Paycheck Protection Program)贷款向他们支付一些东西。\n现在，怀着推销员根深蒂固的乐观情绪，凯莱赫希望在7月份售出300辆汽车-这是一个随时都很大胆的目标，但现在尤其如此。在还剩一天的时间里，总共售出了264辆汽车。\n“吉米，”他曾对他的长期销售主管说，“你今天的后袋里没有36辆车，是吗？”\n“我不知道，”吉米·阿特金斯回答，“但现在别把我排除在外。”\n麦克维是经销商的顶尖推销员。尽管他有10天的假期，但到目前为止，他在7月份已经售出了47辆车。他的目标是达到50岁。最后一天还有三个人要去。他在白色便签簿上写下了潜在线索的名字，然后开始工作。\n麦克维认为，销售需要一定的技巧和能力，才能立即与人建立联系。他喜欢接二连三地向潜在买家提问，以保持他们的参与度。他寻求共同点。他有一本强大的“商业账簿”-费城郊区的人脉，大多是蓝领工人、警察和消防员。他在脸书上很活跃。他不停地用手机发短信。他确保人们知道他是做什么谋生的，他可以帮助他们。\n“每个人都有那个家伙，”他说。一个卖车的。一个卖轮胎的人。买东西最喜欢的人。“我想成为他们的男人。”\n他指导过其他推销员。三年前，他说服罗斯-当时是一名因公受伤的警探-加入他的行列。他把罗斯放在自己的羽翼下，告诉他：“如果你能让某人承认谋杀，你就能让他们买辆车。”\n罗斯被出卖了。现在，麦克维和45岁的罗斯经常作为一个团队工作-他们有时加起来占大卫·道奇售出的所有汽车的四分之一。\n那天早上，罗斯向一位客户交付了一辆价值4.4万美元的新吉普大切诺基(Jeep Grand Cherokee)，麦克维紧随其后，载他回了经销商，差点错过了自己的一笔交易。\n“我在做布拉德的肮脏工作，”麦克维开玩笑说。“他会为我这么做的。”\n但并不是每个推销员都取得了成功。麦克维坐在中心的办公桌上可以感觉到这一点--这是佣金销售“不杀即被杀”的本质的一部分。他看到了一些销售人员未能适应一种新的汽车销售方式，这种方式阻碍了面对面的接触，依赖于在大流行之前建立的关系，而且大部分工作都是在网上完成的。\n“这种冠状病毒会让这个行业的很多人退休--在很多行业，”他说。\n麦克维听着一位年轻的推销员和一位顾客坐在附近的办公桌旁。这名女子曾停下来试驾一辆新的吉普牧马人(Jeep Wrangler)。她开的是一辆林肯。那个女人说她不喜欢牧马人。但她并没有起身离开。她坐在座位上，就像在等着被卖一样。推销员竭力推动这笔交易。一位销售经理走过来，推销员站了起来--这就是所谓的“换人”。但这笔交易无法挽救。那个女人走了。不卖。\n“我不相信她不喜欢牧马人，”麦克维说。\n他认为推销员漏掉了什么。古板的林肯一点也不像运动的牧马人。这在试驾之前很久就很清楚了。在麦克维看来，这位顾客似乎已经准备好尝试一种不同的车辆，朝着一个新的方向前进。这就是“牧马人”吸引她的原因。她只是需要帮助才能到那里。他认为这笔交易本来是可以挽救的。\n在一个下午的平静中，展厅的话题转向了经销商的销售繁荣-似乎无视其他经销商和更广泛的经济领域正在发生的事情。大卫·道奇(David Dodge)卖出了如此多的汽车，似乎正在从其他经销商手中夺取市场份额。\n尽管如此，罗斯说他不敢相信人们会花这么多钱。另一位推销员安东尼·乔丹(Anthony Jordan)建议人们必须有多余的钱，因为所有的假期和婚礼都被取消了。\n“我想不出来，”乔丹说。“为什么我们不会被杀？”\n成功感觉很脆弱。冠状病毒病例的激增或经济的新问题可能会结束良好的运行。凯莱赫现在不仅追踪销售数字，还追踪当地的新冠肺炎案件。他每天上网几次，查看费城郊区的情况。\n他最近警告他的员工说：“我们这片树林的颈部有一些尖峰。”“现在不是松懈的时候。我们不能让任何人生病。“。\n口罩在工作时是强制性的。洗手液藏在整个陈列室里。一队清洁工擦干净了椅子和方向盘。大多数展示厅的车辆都被移到了外面，以便为里面的桌子和椅子提供额外的社交距离。销售人员被分开，所以他们轮流在陈列室待几天。前门旁的一块白板记录了参观展厅的客户预约情况。\n白板上还列出了经销商的“BDC计数”--业务发展中心，也就是网上销售线索进入的地方。三名推销员操作电脑，给大卫·道奇(David Dodge)网站上对汽车感兴趣的人发送电子邮件，并给他们打电话。凯莱赫在封锁期间彻底改革了在线销售流程。\n28岁的艾丽莎·派尔(Alyssa Pyle)经营着BDC。她把数字1到8写在白板上。这就是她今天想要完成的交易数量-她和她的员工已经确定了一些线索，并将其交给销售人员完成。只有一个数字被划掉了。她还需要七个。\n派尔的行动的重要性从它放在陈列室前门的位置上就很清楚了。即使是以传统销售技巧为荣的麦克维也认识到派尔的船员是至关重要的。消费者似乎很舒服地呆在家里，同时做着买车的大部分肮脏工作-检查库存，敲定价格，排队融资。他们根本不需要走进展厅。\n罗斯已经完成了一笔交易。他有另一个潜在客户下午6点来。\n“我22岁了，”乔丹说。“我想我会到25岁。”\n乔丹负责从服务中心寻找潜在的销售-这项工作因二手车价格飙升而变得更容易。他可以出更高的价格换取一辆新车或卡车。\n下午早些时候，麦克维从他的名单上划掉了第一个名字。一位医生接受了一辆新的大切诺基轿车的交付。经销商的一名司机把它送到了他在新泽西州的家中。现在，这是一次正式的大甩卖。\n在后面，销售总监阿特金斯抱怨道。他数了数，已经完成了10笔交易。到目前为止，他们已经卖出了274个。三百还很远。他通过看着办公桌旁边的一排监控摄像头屏幕来判断这一天，这些屏幕显示了经销商的每一寸地方。\n“我们没有我希望的那么忙，”他说。“但是我们的夜晚就要到了。”\n几个小时过去了，没有像冠状病毒之前那样蜂拥而至的顾客蜂拥而至。\n麦克维几乎没有离开他的办公桌，只是继续工作他的手机和电脑，从喝咖啡切换到冰茶。黄色的文件夹就堆积在他的桌子上。一辆道奇公羊3500。杜兰戈。\n派尔在白板上划出了她的BDC号码。到下午6点。她已经实现了8笔交易的目标。\n乔丹和一位客户花了一个小时的时间，这位客户的变速器坏了，他想买一辆新卡车，但他们无法解决融资问题。不卖。\n罗斯在下午6点遇到了他的朋友。预约-他希望一个女人能用她的吉普牧马人(Jeep Wrangler)换一辆大切诺基(Grand Cherokee)。\n罗斯后来在阿特金斯的办公室里宣布：“就这么定了，兄弟。”“我会把它说得很详细。”\n晚上7点多一点，当麦克维又一天工作12个小时接近尾声时，他收到了一条来自他认识的女人的短信。本周早些时候，她的2019牧马人车撞毁了，保险公司刚刚宣布它是完全损失。麦克维是她的车夫。所以她给他发了短信。她想要一辆2020年的牧马人。\n当天晚上晚些时候，随着经销商的关闭，阿特金斯坐在他后面的销售办公室里，数了数7月份的总销量为289辆。\n不是300。但这仍然是该经销商15年来表现最好的一个月。\n“这个月一结束，就是山脚下了，”他说，“又回到了山脚下。”", "note_en": "GLEN MILLS, Pa. — Mike McVeigh had been selling cars for 16 years — honing skills that he feared were already a lost art — when the virus hit. He was 46 and out of a job. His boss at David Dodge furloughed the sales staff after all nonessential businesses in Pennsylvania closed in late March. McVeigh left the dealership that night, stopping at a Wawa to collect his thoughts and call another salesman, Brad Ross.\n “We talked about what we could do just to keep our heads above water,” McVeigh said. “Between us we got eight kids, families to support.”\n A month later, he was called back to work. But everything had changed. A once-booming economy was in tatters. Everyone wore masks. The showroom was closed to customers. Test drives were solo affairs. Deals needed to be done mostly online. No one wanted to get too close to anyone.\n   “If I can’t connect with you, if I can’t do my showmanship, if I can’t see you,” McVeigh said, “I thought I was done.”\n The covid-19 pandemic forced tens of millions of people to lose jobs and thousands of businesses to close, including, initially,  almost a quarter of all people working for auto dealers. But the workers and companies that survived often discovered it was not back to business as usual.\n And that included selling cars — perhaps the ultimate handshake deal in a suddenly socially distanced world.\n McVeigh returned to a dealership that had reinvented on the fly, abandoning a formula relied on for decades to lure potential buyers into the showroom and allow the sales staff to work their magic. The pandemic meant even motivated car buyers hesitated to visit the dealership. Zero-percent financing and thousands of dollars in rebates did little to change that. U.S. auto sales fell an estimated 35 percent in the second quarter that ended in June, with a steep decline in the number of people looking to buy, according to Cox Automotive.\n   Just to survive, car salesmen had to try something new. The dealership started to emphasize online sales and delivering automobiles to customers. That helped find new potential customers and ease some concerns about the pandemic. But the deals still needed to be closed, the paperwork and keys secured in a yellow folder that signified a pending sale. And that’s where McVeigh came in, an old-school salesman with reading glasses trying new ways of making it work wearing a face mask.\n “I didn’t know this was even possible,” he said. “But I’m never going back to the old way.”\n Now, McVeigh sat at his desk in the center of the showroom on the last day of July. It was crunchtime. The last day of the month was still vital for car sales. Factory rebates usually changed with the calendar. Automakers pegged lucrative sales goals to monthly totals, although some manufacturers, such as Fiat Chrysler — supplier of David Dodge’s vehicles — suspended their incentive programs once the pandemic began and sales started to plummet. Still, every salesman judged his or her success by the month.\n   That morning, the dealership’s owner, David Kelleher — known for starring in his own local TV ads — told his managers on a Zoom call to stop worrying about the number of people walking into the showroom. Foot traffic was down since the lockdown — and Pennsylvania’s shutdown of auto dealers had been among the strictest and longest in the nation. Yet sales at David Dodge were up. The days of salesmen living off the front door, as it’s known, were gone.\n   “It’s not that world anymore,” Kelleher said. “And we’re not going back.”\n In the new world, McVeigh sold zero cars in April. But he sold 58 in May — his best month ever — working deals over Zoom and text messages. He used FaceTime to join customers on test drives, since no one wanted to ride in a car with him, even with a mask.\n  The dealership thrived, too, selling 216 new and used vehicles in May. Sales were even better in June: 253 vehicles.\n It was a stunning turnaround from March and April, when state  coronavirus restrictions resulted in a $750,000 loss for the dealership. Kelleher furloughed most of his staff, but he kept paying their medical insurance and using a $1.4 million federal Paycheck Protection Program loan to pay them something.\n  Now, with a salesman’s ingrained optimism, Kelleher hoped to sell 300 vehicles in July — an audacious goal anytime, but especially now. With one day to go, a total of 264 vehicles had been sold.\n  “Jimmy,” he had said to his longtime sales director, “you don’t have 36 cars in your back pocket today, do you?”\n “I don’t know,” replied Jimmy Atkins, “but don’t count me out just yet.”\n McVeigh was the dealership’s top salesman. He’d sold 47 vehicles so far in July — despite a 10-day vacation. His goal was to hit 50. Three more to go on the final day. He wrote the names of potential leads on a white legal pad and got to work.\n McVeigh believed salesmanship required a certain finesse and ability to instantly connect with people. He liked to pepper potential buyers with questions to keep them engaged. He hunted for common ground. He had a strong “book of business” — contacts throughout the Philadelphia suburbs, mostly blue-collar workers, police and firemen. He’s active on Facebook. He constantly texted on his phone. He made sure that people knew what he did for a living and that he could help them.\n   “Everyone has that guy,” he said. A car guy. A tire guy. A go-to person for buying something. “I want to be their guy.”\n He mentored other salesmen. Three years ago he persuaded Ross — then a police detective who got hurt on the job — to join him. He took Ross under his wing, telling him, “If you can get someone to confess to murder, you can get them to buy a car.”\n  Ross was sold. Now, McVeigh and Ross, 45, often worked as a team — together they sometimes accounted for a quarter of all vehicles sold at David Dodge.\n That morning, Ross had delivered a new $44,000 Jeep Grand Cherokee to a customer, with McVeigh following behind to give him a ride back to the dealership, nearly missing out on a deal of his own.\n  “I was doing Brad’s dirty work,” McVeigh joked. “He’d do it for me.”\n But not every salesman was finding success. McVeigh, from his desk in the center, could sense it — part of the “kill or be killed” nature of commission sales. He saw salesmen who failed to adjust to a new way of selling cars that discouraged face-to-face contact, relied on relationships established before the pandemic and where most of the work was done online.\n  “This coronavirus is going to retire a lot of people in this industry — in a lot of industries,” he said.\n McVeigh listened as a young salesman sat with a customer at a nearby desk. The woman had stopped in to test drive a new Jeep Wrangler. She drove a Lincoln. The woman said she didn’t like the Wrangler. But she wasn’t getting up to leave. She stayed in her seat, like she was waiting to be sold. The salesman struggled to push the deal forward. A sales manager came over and the salesman got up — a “turnover,” it’s called. But the deal couldn’t be salvaged. The woman left. No sale.\n  “I don’t believe she didn’t like the Wrangler,” McVeigh said.\n He thought the salesman had missed something. A staid Lincoln is nothing like the sporty Wrangler. That’s clear long before the test drive. The customer seemed to McVeigh like she was ready to try a different vehicle, move in a new direction. That’s what had attracted her to the Wrangler. She just needed help getting there. He thought the deal could have been saved.\n During an afternoon lull, showroom talk turned to the dealership’s sales boom — seeming to defy what was happening at other dealerships and the broader economy. David Dodge was selling so many vehicles that it appeared to be taking market share from other dealers.\n  Still, Ross said he couldn’t believe what folks were spending. Another salesman, Anthony Jordan, suggested people must have extra money because of all the canceled vacations and wedding parties.\n   “I couldn’t figure it out,” Jordan said. “Why aren’t we getting killed?”\n   The success felt fragile. A surge in coronavirus cases or a new problem with the economy could end the good run. Kelleher now tracked not only sales numbers but local covid-19 cases. He went online several times a day to check the status of the Philadelphia suburbs.\n “There’s a bit of spike in our neck of the woods,” he warned his staff recently. “It’s not the time to get lax. We can’t have anyone get sick.”\n Masks were mandatory at work. Hand sanitizer was stashed throughout the showroom. A cleaning crew wiped down chairs and steering wheels. Most of the showroom vehicles had been moved outside to provide extra room for the social distancing of desks and chairs inside. Sales staff were divided up so they alternated days in the showroom. A whiteboard by the front door tracked customer appointments for visiting the showroom.\n  The whiteboard also listed the dealership’s “BDC count” — business development center, the place where the online leads came in. Three salesmen worked the computers, emailing and calling people who showed interest in a vehicle on David Dodge’s website. Kelleher had overhauled the online sales process during the lockdown.\n Alyssa Pyle, 28, ran the BDC. She’d written the numbers 1 through 8 on the whiteboard. That’s how many deals she wanted to finish today — leads that she and her staff had firmed up and passed on to salesmen to finish. Just one number was crossed out. She needed seven more.\n   The importance of Pyle’s operation was clear from its placement by the showroom’s front door. Even McVeigh, who prided himself on traditional salesmanship, recognized that Pyle’s crew was vital. Consumers seemed comfortable staying home while doing most of the dirty work of buying a car — checking inventory, nailing down a price and lining up financing. They didn’t need to walk into the showroom at all.\n Ross had closed the one deal already. He had another potential client coming at 6 p.m.\n   “I’m at 22,” Jordan said. “I think I’ll get to 25.”\n Jordan was responsible for finding potential sales from the service center — a job made easier by the booming prices for used vehicles. He could offer more for a trade-in on a new car or truck.\n McVeigh scratched the first name off his list in the early afternoon. A doctor took delivery of a new Grand Cherokee. A driver for the dealership had dropped it off at his home in New Jersey. It was now an official sale.\n      In the back, sales director Atkins grumbled. He counted 10 completed deals. They’d sold 274 so far. Three hundred was still a long way off. He judged the day by looking at the bank of surveillance camera screens next to his desk, which showed every inch of the dealership.\n “We’re not as busy as I want us to be,” he said. “But we’ve got the night coming.”\n  The hours slid by, with no great rush of customers coming through the door that would have been seen before the coronavirus.\n McVeigh barely left his desk, just kept working his phone and computer, switching from drinking coffee to iced tea. And the yellow folders just piled up on his desk. A Dodge Ram 3500. A Durango.\n  Pyle marked off her BDC numbers on the whiteboard. By 6 p.m. she’d hit her target of eight deals.\n Jordan spent an hour with a customer who had a blown transmission and was looking at buying a new truck, but they couldn’t work out the financing. No sale.\n Ross met his 6 p.m. appointment — a woman he hoped would trade in her Jeep Wrangler for a Grand Cherokee.\n “That’s done, bro,” Ross later announced in Atkins’s office. “I’m going to put it in detail.”\n A little after 7 p.m., as McVeigh neared the end of another 12-hour day, he received a text from a woman he knew. She’d crashed her 2019 Wrangler earlier in the week and the insurance company had just declared it a total loss. McVeigh was her car guy. So she texted him. She wanted a 2020 Wrangler.\n   Later that night, with the dealership closed, Atkins sat in his back sales office and counted 289 total sales for July.\n No 300. But it was still the best month in the dealership’s 15 years.\n   “The minute the month is over, it’s the bottom of the hill,” he said, “right back at it.”", "posttime": "2020-08-14 22:35:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推销员,salesmen,经销商", "title": "不能握手。经济不景气。这些汽车推销员改变了策略，并取得了成功。", "title_en": "No handshakes. A bad economy. These car salesmen shifted tactics– and succeeded", "transed": 1, "url": "https://www.washingtonpost.com/business/2020/08/12/with-handshakes-barred-an-economy-trouble-car-salesman-tries-seal-deal/", "via": "", "real_tags": ["推销员", "salesmen", "经销商"]}, {"category": "", "categoryclass": "", "imagename": "b804ea5361197e068fb41b9483498618.jpg", "infoid": 1018026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四晚上，EPIC游戏公司起诉谷歌将堡垒之夜从谷歌Play商店中撤下，此前苹果也提起了类似的诉讼。\n我们可能已经预料到了。出乎意料的是：EPIC声称谷歌迫使一加手机制造商终止了一加手机预装堡垒之夜发射器的交易，并要求另一家安卓手机制造商LG放弃任何同样的计划。\n对于OnePlus，Epic声称在谷歌对Epic绕过Play Store的能力表示“担忧”后，谷歌“迫使OnePlus违背了交易”。EPIC还声称，Eic和OnePlus之间的最初协议将使发射器在全球范围内可用，但谷歌“要求OnePlus不执行与Etic的协议，只有在印度销售的移动设备是有限的例外。”\nEPIC还声称，谷歌“阻止LG在LG设备上预装Eic Games应用程序”，因为--用LG的话说，显然--LG“今年与谷歌Play Store签订了阻止侧面下载的合同”。\n当The Verge联系到谷歌时，谷歌拒绝对这些交易的细节发表评论。\n“史诗”认为，如果没有谷歌阻止这类交易，制片厂“可以而且会与原始设备制造商进行谈判，让消费者可以直接获得”堡垒之夜“和其他”史诗“游戏，而不受谷歌的反竞争限制。”取而代之的是，在这些交易明显失败后，Etic做出了让步，最终于今年4月在Play Store上映了堡垒之夜。(它最终确实与一加科技合作开发了另一个堡垒之夜功能。)。\n但今天，谷歌将堡垒之夜踢出了Play Store，原因是该商店违反了Epic店的政策，此前EpicePic实施了一项新的支付机制，允许玩家直接向EpicePack支付游戏内货币。(它仍然提供了通过谷歌的支付机制付款的选项，但价格更高。)。EPIC对谷歌的控诉称，该公司垄断Play Store的支付系统，违反了谢尔曼法案和加利福尼亚州的卡特赖特法案。\n周四，苹果出于与谷歌类似的原因将堡垒之夜从应用商店下架，不久之后，Etic起诉了这家苹果手机制造商，指控其与针对谷歌的投诉类似。EPIC还恶搞苹果标志性的“1984”广告。", "note_en": "Epic Games  sued Google over pulling  Fortnite from the Google Play Store Thursday evening, following a similar lawsuit against Apple.\n We might have expected that. What we didn’t expect: Epic claims that Google forced phone manufacturer OnePlus to break off a deal that would have seen a special  Fortnite launcher preinstalled on OnePlus phones — and demanded that another Android phonemaker, LG, abandon any plans to do the same.\n With OnePlus, Epic claims that Google “forced OnePlus to renege on the deal” after Google expressed ‘concern’ about Epic’s ability to bypass the Play Store. Epic also alleges that the original deal between Epic and OnePlus would have made the launcher available worldwide, but Google “demanded that OnePlus not implement its agreement with Epic with the limited exception of mobile devices sold in India.”\n   Epic also alleges that Google “prevented LG from pre-installing the Epic Games app on LG devices” because — in LG’s words, apparently — LG had a contract “to block side downloading off Google Play Store this year.”\n Google declined to comment on the specifics of these deals when contacted by  The Verge.\n   Without Google blocking these sorts of deals, Epic argues, the studio “could and would negotiate with OEMs to make  Fortnite and other Epic games directly available to consumers, free from Google’s anti-competitive restraints.” Instead, after these deals were apparently scuttled,  Epic gave in and wound up releasing  Fortnite on the Play Store this April. (It did wind up working with OnePlus  on a different  Fortnite feature.)\n But today, Google  kicked  Fortnite from the Play Store for violating the store’s policies after Epic implemented a new payment mechanism that allowed players to pay Epic directly for in-game currency. (It still offered the option to pay through Google’s payment mechanism, but for a higher price.) Epic’s complaint against Google alleges the company is violating the Sherman Act and California’s Cartwright Act by having a monopoly on the payment systems on the Play Store.\n Apple  booted  Fortnite from the App Store store on Thursday for similar reasons to Google, and shortly after,  Epic sued the iPhone-maker, alleging similar complaints as it did against Google. Epic also  parodied Apple’s iconic “1984” ad.", "posttime": "2020-08-14 20:38:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,谷歌,交易,google,forced", "title": "史诗游戏称，谷歌迫使一加摧毁堡垒之夜发射器交易", "title_en": "Google forced OnePlus to decimate a Fortnite launcher deal, claims Epic Games", "transed": 1, "url": "https://www.theverge.com/2020/8/13/21368395/fortnite-epic-games-oneplus-deal-google-play-store-lawsuit-lg", "via": "", "real_tags": ["游戏", "谷歌", "交易", "google", "forced"]}]