[{"category": "", "categoryclass": "", "imagename": "3e546efd1be8e6df3742904fda2460ad.jpg", "infoid": 1068177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用现实世界材料的调色板涂漆简单的形状和线条，如草或云。 然后，实时地，我们的革命性AI模型将屏幕填满了展示停止结果。 不喜欢你看到的东西吗？ 换回物料，改变雪到草地，并随着整个图像从冬季仙境变为热带天堂。 创造性的可能性是无穷无尽的。 ", "note_en": "Paint simple shapes and lines with a palette of real world materials, like grass or clouds. Then, in real-time, our revolutionary AI model fills the screen with show-stopping results. Don’t like what you see? Swap a material, changing snow to grass, and watch as the entire image changes from a winter wonderland to a tropical paradise. The creative possibilities are endless.", "posttime": "2021-06-25 12:02:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,看到", "title": "nvidia画布 ", "title_en": "Nvidia Canvas", "transed": 1, "url": "https://www.nvidia.com/en-gb/studio/canvas/", "via": "", "real_tags": ["nvidia", "看到"]}, {"category": "", "categoryclass": "", "imagename": "dcec0fab1001699a1bc090367283e333.jpg", "infoid": 1068176, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众所周知，世界上最富有的人民居住最奢侈的生活。我们中的任何一人都可能会这样做：正常工作到相当的财富，您可以在豪华住宿，豪华轿车，豪华度假，奢侈品中挥霍。就麝香而言，亿万富翁，如果没有几个项目 - 包括豪华住宿，他就可以做得很好。\r虽然回来，麝香通过宣布销售他的整个房地产投资组合来造成很多嗡嗡声，这是可预测的令人印象深刻的。他继续计划，而且，就世界而言，Tesla和Spacex Ceo现在无家可归，或多或少。根据他本月早些时候的推文之一，他现在住在一个价值约50,000美元的房子里的太空财产。\r“我的主要房屋在博卡奇卡/星巴斯出租，我的主要房屋在Spacex租来的博卡奇卡/星巴赛中。麝香写道，它是很棒的很棒。 “我拥有的唯一房子是湾区的活动。如果我卖掉它，否则房子会更少使用，除非一个大家庭买了一天的大家庭。“麝香甚至没有拥有他住在德克萨斯州的廉价房子的事实只是锦上添花。根据Teslarati的说法，该房子实际上是一个预制的可牵引的小家，称为Boxupl Casita  - 最便宜的型号（以及截至按压的唯一可用于预订）。盒子实际上在2020年11月暗示了这一点，当他们透露他们向Boca Chica交付了一个神秘的A-List客户端。\rCasita与名称表明一样可爱。它是一个20x20英尺（6x6米）的混凝土板，钢和eps泡沫，可以发货或拖曳（即使是模型x，作为页面底部的推文）直接向买方发货。将其设置在一小时和一天之间，具体取决于所有者想要的设置：CASITA可以用于离网生活或连接到公用事业。同样根据此，设置可以暗示各种额外的成本。\r仍然，CASITA本身从50,000美元开始，并且是“持续一生”。墙壁，地板和屋顶是结构层压板，用于绝缘和耐久性比传统自制市场上的所有其他内容更高。 Casita是飓风和抗抗火，抗抗抗抗抗抗抗抗雪的额定额定雪。它是便宜的维护，可以通过太阳能电池板，备用电池和智能技术更便宜。\r基础模型非常适合一个小家庭，更多的一室公寓：它基本上是一个广场空间分为四个起居区。您有一个主卧室区域，厨房区，浴室和休闲斜线用餐区。也就是说，由于高天花板，这是一个很好的组织，良好的看起来和通风。更重要的是，它配备齐全的冰箱：厨房，洗衣机，洗碗机，双水槽，熨衣板和厨房里的烤箱和微波炉;浴室配有深色淋浴浴缸和尺寸的柜台;您将加热和交流作为标准包的一部分。该想法是为了盒子开始提供更大的型号，在这个微小的CASITA上的变化，而且还包括这一个作为更大建筑的模块。 Boxapl认为住房行业需要进化并进入大规模生产，以更高效，更实惠。公司首席执行官在下面的一个视频中说，唯一的出路，是通过提供更耐用，更实惠的单位，并且交货日期更短。\r显然，Boxabl Casita单元很棒，足以引起埃龙麝香的眼睛。但盒子喜欢梦想未来，超越地球的建筑：他们最近对火星单位揭开了一个概念，基于Casita还可以用于灾难或冲突地区的医疗或军事用途。为什么不考虑未来的不太遥远的未来，麝香麝香在殖民大马的使命中引导人类？我的主要房屋在博卡奇卡/星巴斯出租，我的主要房屋是一个〜5万美元的房子。虽然有点棒了。\r我拥有的唯一房子是湾区的活动。如果我卖掉它，否则房子会看到较少使用，除非由一个大家庭购买，可能会发生一天。\n\r -  Elon Musk（@elonmusk）2021年6月9日\n      急切地等待Cyber​​truck，需要12,000磅的Tow容量@elonmusk。 #tech #startup #housing #construction\r免责声明：模型x未归类于拖曳CASITA。不要在家尝试做这个。 pic.twitter.com/pywzd6wmtp.\n\r -  Boxabl（@_boxabl）4月22日，2021 ", "note_en": "The world’s richest people are known to live the most extravagant lives. Any one of us would probably do the same: work your way to a considerable fortune, and you’d splurge on  luxury accommodation, luxury cars, luxury vacations, luxury everything. As far as Musk is concerned, billionaire or not, he can do very well without a couple of items on that list—including luxury accommodation.    \rA while back, Musk caused a lot of buzz online by announcing plans to sell his entire real estate portfolio, which was predictably impressive. He went ahead with the plans, and, as far of the world knows, the Tesla and SpaceX CEO is now homeless, more or less. According to one of his tweets from earlier this month, he now lives on SpaceX property in a house that’s worth some $50,000.     \r“My primary home is literally a ~$50k house in Boca Chica / Starbase that I rent from SpaceX. It’s kinda awesome though,” Musk wrote.  “Only house I own is the events house in the Bay Area. If I sold it, the house would see less use, unless bought by a big family, which might happen some day.”     The fact that Musk doesn’t even  own the cheap house he lives in when in Texas is just the icing on the cake. According to  Teslarati, that house is actually a prefabricated, towable tiny home called Boxabl Casita—the cheapest model (and the only one available for preorder as of the moment of press).  Boxabl actually hinted at this back in November 2020, when they revealed they had delivered a unit to Boca Chica for a then-mysterious A-list client.    \rThe Casita is as adorable as the name suggests. It’s a 20x20 foot ( 6x6 meter) home-made of concrete panels, steel and EPS foam that can be shipped or towed (even by  a Model X, as one of the tweets available at the bottom of the page shows) directly to the buyer. Setting it up takes between one hour and one day, depending on the setup the owner wants: the Casita can be made for off-grid living or hooked up to utilities. Also depending on this, the setup can imply a variety of additional costs.    \rStill, the Casita itself starts at $50,000 and is made to  “last a lifetime.” The walls, floor, and roof are structurally laminated panels rated higher for insulation and durability than everything else on the traditional home-building market. The Casita is hurricane and storm resistant, fire-resistant, flood-resistant, and 90% rated for snow. It’s cheap to maintain and can be made even cheaper by means of solar panels, backup batteries, and  smart tech.    \rThe base model is perfect for a small family, being more of a studio apartment: it’s basically a square space divided into four living areas. You have a master bedroom area, a kitchen area, a bathroom, and a living slash dining area. That said, it’s well organized, quite good looking and airy due to the high ceiling. More importantly, it&#39;s well equipped: you have a large fridge, a washer-dryer unit, a dishwasher, a double sink, an ironing board, and an oven and microwave in the kitchen; the bathroom has a deep shower tub, and a sizable counter; you get heating and AC as part of the standard package.     The idea is for Boxabl to start offering larger models soon, variations on this tiny Casita, while also including this one as  a module for larger constructions. Boxabl believes that the housing industry needs to evolve and head into mass production to be more efficient and more affordable. The only way out of the housing crisis, the company CEO says in one of the videos below, is by offering units that are more durable, more affordable, and with shorter delivery dates.    \rClearly, the Boxabl Casita unit is awesome enough to have caught the eye of  Elon Musk. But Boxabl likes to dream of a future well beyond building on Earth: they recently unveiled a concept for a Mars unit, based on the idea that the Casita can also serve for medical or military use in disaster or conflict areas. Why not think ahead into the not-too-distant future in which  Musk leads humanity on a mission to colonize Mars?      My primary home is literally a ~$50k house in Boca Chica / Starbase that I rent from SpaceX. It’s kinda awesome though.   \rOnly house I own is the events house in the Bay Area. If I sold it, the house would see less use, unless bought by a big family, which might happen some day.\n\r— Elon Musk (@elonmusk)  June 9, 2021\n      Eagerly awaiting the Cybertruck, need 12,000 pound tow capacity  @elonmusk. #tech  #startup  #housing  #construction  \rDisclaimer: Model X not rated to tow Casita. Do not try this at home.  pic.twitter.com/PYWzd6wmTp\n\r— Boxabl (@_BOXABL)  April 22, 2021", "posttime": "2021-06-25 12:02:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "musk,麝香", "title": "Elon Musk住在一个预制的家中，他甚至没有拥有一个盒子casita ", "title_en": "Elon Musk Lives in a Prefab Tiny Home That He Doesn’t Even Own, a Boxabl Casita", "transed": 1, "url": "https://www.autoevolution.com/news/elon-musk-lives-in-a-prefab-tiny-home-that-he-doesnt-even-own-a-boxabl-casita-163877.html", "via": "", "real_tags": ["musk", "麝香"]}, {"category": "", "categoryclass": "", "imagename": "b5d0f1167a86fdbbb8945644fc4c54f6.png", "infoid": 1068175, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很多人（我所包括）是反对变革的变化，即积极利用未定义的行为，但是  TL; DR：C＆＃39;如果INT！=寄存器宽度，但（对于向后Compat）int是32位  主要的64位目标，这导致一些代码生成和优化的毛茸茸的问题  相当常见的病例。 签名的溢出UB利用是尝试解决此问题的尝试。  更精确：编译器真的想要摆脱的＃1转换是替代int32  尽可能在64位代码中使用INT64循环计数器的循环计数器，因为INT32S是坏消息  movsxd（标记*）表示问题：We＆＃39;在一个64位机器上尝试使用32位索引 \n请参阅阵列，因为地址为64位（我们可能绝对可以具有大于4GB的数组，但  在少于20亿个条目），我们需要在我们完成寻址之前将该索引扩展到64位  该符号扩展是在此代码段的32位版本中不存在的内部循环中的额外工作。  它也会导致其他问题。 例如，上面的代码的32位等效于始终访问内存  和ebx是什么＆＃39; s称为＆＃34;诱导变量＆＃34; - 它在每个循环迭代中的常量值更改  （在这种情况下递增1）。 32位编译器可以实现此功能并用指针算术替换它  （每次递增4，递增4个）。 ＆＃34; esi＆＃34; 和＃34; ebx＆＃34; 两个32位值是否受到32位环绕， \n符号在中间延伸（那个＆＃34; sext32to64（ebx）＆＃34;是＆＃34; movsxd rbx，edx＆＃34; do）。 和在  剧烈地，（4  -  2 ^（32 + 2））。 在32位模式（所有地址模2 ^ 32），这只是增加4  照常; ＆＃34;环绕声＆＃34; 部分是2 ^ 32的倍数，因此看不见。 在64位模式下，它是＆＃39; t; 如果是  选项a）在这个特殊的例子中相对简单，但它可以得到毛茸茸的，我的观点是  32位编译器永远不需要担心任何一个开始（并且都没有执行64位编译器  如果编译器*＆＃39; t *能够做这些证明，它可以变得非常糟糕。 例如，上面的循环  基本上是全部循环开销，大多数编译器都会结束展开（或矢量化，但我＆＃39; ll \n忽略它。 现在我们更喜欢看到一个内循环，如:(我在此显示设置或尾循环）：  （仅在这里展示地址零件，在实践中＆＃39;其他改变我们＆＃39;喜欢看，但是  如果编译器可以＆＃39; t（无论出于何种原因），证明索引表达式不会溢出  这是一个愚蠢的例子，但你需要做的就是看一些装配列表  ＆＃34; movsxd＆＃34 ;; 通常你＆＃39; ll能够找到实际的寻址代码，这些代码是这样的东西  无论如何，如上所述，编译器使用签名overflow UB作为自由票证来推广Int32  当＆＃34; int＆＃34; 是机器寄存器的宽度和漂亮 \n当它＆＃39;没有。 较新的语言（例如，Go和Rust）通过制作解决这个问题  ＆＃34; int＆＃34; 在64位平台上是64位，从而消除了这类的大部分动机  在冷码上延伸（并导致额外的工作）延伸（并导致额外的工作）不是*糟糕的话  在那里有一个方法，编译器告诉程序员真正的热环  通常与额外指令一样多（或更多）。 在x64上，它在  或类似的。 前32位＆＃34; rbx＆＃34; 下次一个32位ALU将获得零清除  op写入ebx，但是＆＃39;很好。 至少我们没有使用额外的寄存器。 \n例如 显示溢出何时可以＆＃39; t发生在循环中，例如示例循环（在此  案例：如果我们可以证明＆＃34;伯爵和＃34; 保持固定在整个循环中，我们只输入循环  如果＆＃34; 0＆lt; 数＆＃34 ;,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, 随着我的增加  每次迭代的速度为1，这是在我溢出之前发生的。 这是  程序员，并且真的很难理解编译器可以或不能  在任何给定的时间点证明。 所以它＆＃39;棘手。 更好的分析捕获更多和  如果有疑问，它几乎总是优选的是以这种方式定义了语义 \n许多算术运算，无论如何都冒险。 你真的很想  在大多数机器上你＆＃39;重新使用，＆＃34; size_t＆＃34; 对于循环计数器是个好主意 ", "note_en": "A lot of people (myself included) are against transforms that aggressively exploit undefined behavior, but\n      TL;DR: C doesn&#39;t work very well if int!=register width, but (for backwards compat) int is 32-bit on all\n  major 64-bit targets, and this causes quite hairy problems for code generation and optimization in some\n  fairly common cases. The signed overflow UB exploitation is an attempt to work around this.\n    To be more precise: the #1 transform that compilers really want to get out of this is to replace int32\n  loop counters with int64 loop counters in 64-bit code whenever possible, because int32s are bad news\n                                                    That MOVSXD (marked *) is indicative of the issue: we&#39;re on a 64-bit machine trying to use a 32-bit index to\n  refer to an array, and because addresses are 64-bit (and we could absolutely have an array larger than 4GB but\n  with less than 2 billion entries), we need to sign-extend that index to 64-bit before we can do our addressing\n      That sign-extend is extra work in the inner loop that would not exist in the 32-bit version of this snippet.\n  It also causes other problems. For example, the 32-bit equivalent of the code above always accesses memory at\n        and ebx is what&#39;s called an &#34;induction variable&#34; - it changes by a constant value in every loop iteration\n  (incrementing by 1 in this case). A 32-bit compiler can realize this and replace it with pointer arithmetic\n  (incrementing esi by 4 every iter, say). &#34;esi&#34; and &#34;ebx&#34; are both 32-bit values subject to 32-bit wraparound,\n              with a sign extend in the middle (that &#34;sext32to64(ebx)&#34; is what the &#34;movsxd rbx, edx&#34; does). And in\n    dramatically, by (4 - 2^(32+2)). In 32-bit mode (all addresses modulo 2^32), this is just an increase by 4\n  as usual; the &#34;wraparound&#34; part is a multiple of 2^32 and hence invisible. In 64-bit mode, it isn&#39;t; if the\n            Option a) is relatively straightforward in this particular example, but it can get hairy, and my point is\n  that 32-bit compilers never need to worry about any of this to begin with (and neither do 64-bit compilers\n      And if the compiler *isn&#39;t* able to do these proofs, it can get pretty bad. For example, the loop above\n  is basically all loop overhead, and most compilers will end up unrolling (or vectorizing, but I&#39;ll\n  ignore that) it. Now we&#39;d prefer to see an inner loop like: (I won&#39;t show the setup or tail loop here):\n                      (only showing the adressing parts here, in practice there&#39;s other transforms we&#39;d like to see too, but\n      If the compiler can&#39;t (for whatever reason) prove that the index expressions are not going to overflow\n                                      This is a silly example, but all you need to do is look at some assembly listings for\n    &#34;movsxd&#34;; usually you&#39;ll be able to find actual addressing code that does stuff like this\n      Anyway, as said, compilers use the signed-overflow UB as a free ticket to promote int32\n            to int etc.) work pretty well when &#34;int&#34; is the width of machine registers and pretty\n  badly when it&#39;s not. Newer languages (e.g. Go and Rust) solve this problem by just making\n  &#34;int&#34; be 64-bit on 64-bit platforms, which removes most of the motivation for this kind\n          Eating the sign extends (and resulting extra work) on cold code is not *that* bad if\n  there&#39;s a way for the compiler to tell the programmer about the hot loops that really\n        often as much (or more) of a problem than the extra instructions. On x64, it is in\n          or similar. The top 32 bits of &#34;rbx&#34; will get zero-cleared the next time a 32-bit ALU\n  op writes to ebx, but that&#39;s fine. At least we didn&#39;t use an extra register.\n    e.g. show when overflows can&#39;t happen in a loop such as the example loop (in this\n  case: if we can prove &#34;count&#34; stays fixed throughout the loop, we only enter the loop\n  if &#34;0 &lt; count&#34;, and we only stay in the loop until &#34;i &gt;= count&#34;; with i increasing at\n  a rate of 1 per iteration, this is guaranteed to happen before i overflows). This is\n      programmer, and it can be really hard to understand what the compiler can or cannot\n  prove at any given point in time. So it&#39;s tricky. Better analysis catches more and\n      If in doubt, it&#39;s almost always preferable to have semantics defined in such a way\n                                    of many arithmetic operations, and your life sucks no matter what. You really want to\n      On most of the machines you&#39;re likely to use, &#34;size_t&#34; for loop counters is a good idea", "posttime": "2021-06-25 12:02:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,签署,background,循环", "title": "在利用签署的overflow的编译器的一点背景（2016） ", "title_en": "A bit of background on compilers exploiting signed overflow (2016)", "transed": 1, "url": "https://gist.github.com/rygorous/e0f055bfb74e3d5f0af20690759de5a7", "via": "", "real_tags": ["编译", "签署", "循环"]}, {"category": "", "categoryclass": "", "imagename": "b59407c20d975f0ed1f5b9d6fd4da223.jpeg", "infoid": 1068174, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2018年申请联邦逮捕令的联邦调查局申请了美国政府金的传说中缓存，他说是“在内战期间被盗”并隐藏在宾夕法尼亚州洞穴中，如果美联储要求，国家可能会把黄金拿着这一国家根据法院文件的说法，周四未封闭。\n 新未密封的宣誓书确认了我们在联邦媒体上报告，政府一直在寻找该网站上的长期金的传奇缓存，联邦当局长期以来拒绝确认。无论如何，FBI说，挖掘出来了空。\n AP和费城询问者向联邦法官申请了联邦判决。联邦检察官没有反对要求，法官同意，铺平了周四发布文件的方式。\n  “我有可能的原因相信黄金的重要缓存是在地下洞穴中分泌的”在凹陷的奔跑中，抱着“一个或多个吨”属于美国政府，在费城的联邦调查局的艺术犯罪队的雅各布···萨克斯写道。\n 弓箭手告诉法官，他需要一名扣押权证，因为他担心，如果联邦政府允许宾夕法尼亚州的保护和自然资源部门挖掘该网站，则该州将为黄金本身而言，建立一个昂贵的法律战斗。\n “我担心的是，即使DCNR初步同意FBI挖掘凹陷运行网站上的黄金的高速缓存，在联邦调查局收回美国财产之前，可以撤销该同意，其结果是非法声称的黄金的缓存是被遗弃的财产，因此属于宾夕法尼亚州的联邦，“宣誓书说。\n 弓箭手还透露对他写的立法员工的指控试图为自己抢夺一些战利品。 \n2013年，宣誓书表示，立法人员联系了一对曾发现过的黄金地点的宝藏猎人。员工“腐败”提供了让宝藏猎人的国家许可证挖掘“返回三个金或百分之三的金币”，无论他们康复。据阿森师称，员工表示，他代表州政府的别人代表别人在州政府中行事，包括“将钱控制到DCNR的人和在宾夕法尼亚州州长办公室工作的人。”\n 没有人被收取与案件有关，联邦检察官表示，他们认为这件事已关闭。保护和自然资源部的发言人拒绝了评论。\n  联邦调查局长期以来一直拒绝解释为什么它于2018年3月挖掘埃尔克县的国有土地，只在多年来就在书面陈述中表示，代理商在那里的法院授权挖掘“建议可能已经有什么证据文化遗产网站。“\n 根据宣誓书，联邦调查局基于其对缉获令的要求，部分是由宝宝猎人所做的工作，他们已经向该地区推出了数百人。父子二人一人告诉当局他们认为他们发现了传说联盟黄金的位置，即1963年在途中的途中丢失或偷走了美国弗拉德利亚的美国薄荷。\n 在2018年初与宝藏猎人见面后，联邦调查局带来了一个更复杂的乐器的承包商。承包商检测到一个地下质量，该地下质量达到九吨，誓言的密度是金，誓言。\n  阿切尔写道，他还与一名记者交谈，被认为是“人3”，他在一个叫做金色圈骑士的内战时代集团进行了广泛的研究。 KGC，Archer写道，是一个据称同盟的秘密协会，据称是“埋葬了武器，硬币和金银和银和银条的秘密高速缓存，其中许多人被盗，从银行的抢劫中偷走了，培训了联盟军队的薪酬内战和北方军队，南部，西部和北方国家。“\n 弓箭手说，在建议的挖掘网站附近的岩石上发现了一只龟雕刻“很可能......该网站的KGC标记。” \n宣誓书表示，射手无法确认美国铸造厂实际上错过了任何预期的黄金造币，因为薄荷没有犯有内战期内的记录。\n 根据周四的文件，FBI显然并未向法官表明该网站在该网站上发现的内容。 Feladelphia的美国律师办公室的发言人表示，没有提交法院的文件，因为挖掘了空洞。\n Dennis和Kem Parada是宝藏狩猎服装守护者的共同主人，已表示，他们认为联邦调查局在该网站上找到了黄金。他们正在寻求关于调查的数千页的联邦调查局文件以及挖掘的视频文件。\n  他指出，美国法官授予授予的逮捕裁判法官Richard Lloret授予FBI代理商允许从下午6点到下午10点挖掘。但居民已经讲述了一夜之间听到了一个反铲和jackhammer  - 当挖掘被停顿时 - 并看到联邦调查局车辆的车队，包括大型装甲卡车。\n 此外，它询问联邦调查局从未与承包商回顾过，承包商已经表明可能存在黄金的存在，以问誓言宣誓书中的“人3”。\n “科学是否真的出错了？我不太确定，“叛逆金”的作者，“叛军黄金”的作者说，一本书探索了埋葬了埋葬了金银市的埋藏时的可能性。\n “为什么他们在事实之后送四或五辆装甲车？”他问。 “为什么他们在黑暗的掩护下工作？为什么他们在下午3点踢山上。当天我们应该作为合作伙伴工作的那一天？“ \n一个空洞的FBI主张是“侮辱所有做这类工作的可信人”，“丹尼斯帕达岛以前告诉过AP。 “这是一个拍打在脸上，真的，认为所有这些人都可以让那种错误。” ", "note_en": "An FBI agent applied for a federal warrant in 2018 to seize a fabled cache of U.S. government gold he said was “stolen during the Civil War” and hidden in a Pennsylvania cave, saying the state might take the gold for itself if the feds asked for permission, according to court documents unsealed Thursday.\n The newly unsealed affidavit  confirms previous reporting by The Associated Press  that the government had been looking for a legendary cache of gold at the site, which federal authorities had long refused to confirm. In any case, the FBI said, the dig came up empty.\n The AP and The Philadelphia Inquirer petitioned a federal judge to unseal the case. Federal prosecutors did not oppose the request, and the judge agreed, paving the way for Thursday’s release of documents.\n  “I have probable cause to believe that a significant cache of gold is secreted in the underground cave” in Dent’s Run, holding “one or more tons” belonging to the U.S. government, wrote Jacob Archer of the FBI’s art crime team in Philadelphia.\n Archer told the judge he needed a seizure warrant because he feared that if the federal government sought permission from the Pennsylvania Department of Conservation and Natural Resources to excavate the site, the state would claim the gold for itself, setting up a costly legal battle.\n “I am concerned that, even if DCNR gave initial consent for the FBI to excavate the cache of gold secreted at the Dent’s Run Site, that consent could be revoked before the FBI recovered the United States property, with the result of DCNR unlawfully claiming that that cache of gold is abandoned property and, thus, belongs to the Commonwealth of Pennsylvania,” the affidavit said.\n Archer also revealed allegations against a legislative staffer who, he wrote, tried to get some of the loot for himself.\n In 2013, the affidavit said, the legislative staffer contacted a pair of treasure hunters who had identified the likely site of the gold. The staffer “corruptly” offered to get the treasure hunters a state permit to dig “in return for three bars of gold or ten percent” of whatever they recovered. The staffer said he was acting on behalf of others in state government, according to Archer, including “someone who controlled money going to DCNR and someone working in the Pennsylvania governor’s office.”\n No one has been charged in connection with the case, and federal prosecutors say they consider the matter closed. A spokesperson for the Department of Conservation and Natural Resources declined comment.\n  The FBI had long refused to explain exactly why it went digging on state-owned land in Elk County in March 2018, saying only in written statements over the years that agents were there for a court-authorized excavation of “what evidence suggested may have been a cultural heritage site.”\n According to the affidavit, the FBI based its request for a seizure warrant partly on the work done by the treasure hunters, who had made hundreds of trips to the area. The  father-son duo  told authorities they believed they had found the location of the fabled Union gold, which, according to legend, was either lost or stolen on its way to the U.S. Mint in Philadelphia in 1863.\n After meeting with the treasure hunters in early 2018, the FBI brought in a contractor with more sophisticated instruments. The contractor detected an underground mass that weighed up to nine tons and had the density of gold, the affidavit said.\n  Archer wrote that he also spoke with a journalist, identified as “Person 3,” who had done extensive research on a Civil War-era group called the Knights of the Golden Circle. The KGC, Archer wrote, was a secret society of Confederate sympathizers that had purportedly “buried secret caches of weapons, coins, and gold and silver bullion, much of which was stolen from robberies of banks, trains carrying payroll of the Union Army during the Civil War and from northern army military posts, in southern, western and northern states.”\n Archer said that a turtle carving found on a rock near the proposed dig site was “very likely ... a KGC marker for that site.”\n Archer wasn’t able to confirm the U.S. Mint had actually missed any expected shipments of gold because the Mint did not have records for the Civil War period, the affidavit said.\n The FBI apparently did not indicate to the judge, in writing, what it found at the site, according to the documents unsealed Thursday. A spokesperson for the U.S. attorney’s office in Philadelphia said that no such document was filed with the court because the dig came up empty.\n Dennis and Kem Parada, co-owners of the treasure-hunting outfit Finders Keepers, have said they believe the FBI found gold at the site. They are seeking thousands of pages of FBI documents about the investigation as well as video files of the dig.\n  He noted the warrant granted by U.S. Magistrate Judge Richard Lloret gave FBI agents permission to dig from 6 a.m to 10 p.m. But residents have  told of hearing a backhoe and jackhammer overnight — when the excavation was supposed to have been paused — and seeing a convoy of FBI vehicles, including large armored trucks.\n In addition, it is telling that the FBI never checked back with the contractor whose sensitive instruments had indicated the possible presence of gold to ask what went wrong, said Warren Getler, the journalist identified as “Person 3” in the affidavit.\n “Did the science really go wrong? I am not so sure about that,” said Getler, author of “Rebel Gold,” a book exploring the possibility of buried Civil War-era caches of gold and silver.\n “Why did they send four or five armored cars after the fact?” he asked. “Why did they work under cover of darkness? Why did they kick us off the mountain at 3 p.m. that day when we were supposed to be working as partners?”\n The FBI assertion of an empty hole is “insulting all the credible people who did this kind of work,” Dennis Parada previously told the AP. “It was a slap in the face, really, to think all these people could make that kind of mistake.”", "posttime": "2021-06-25 12:01:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,possibly,挖掘", "title": "FBI可能挖了400万美元的传说中的内战时代黄金 ", "title_en": "FBI Possibly Dug up $400M of fabled Civil War era gold", "transed": 1, "url": "https://apnews.com/article/pennsylvania-oddities-technology-lifestyle-government-and-politics-2c2d2a064fa7f8b3835648821ca3ecbc", "via": "", "real_tags": ["可能", "possibly", "挖掘"]}, {"category": "", "categoryclass": "", "imagename": "2e57ee55fbf5658540cd2c4e40d84922.png", "infoid": 1068172, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您不必成为微软历史学家来看ping-pong模式：\n  Windows XP  - 命中！ Windows Vista  -  FLOP。 Windows 7  - 点击！ Windows 8  - 翻转。 Windows 10  - 点击！\n  如果您正在播放赔率，您将打赌Windows 11，星期四宣布，将翻转。但是我所看到的到目前为止的Windows 11看起来很聪明。此外，Microsoft首席执行官Satya Nadella在独家采访中，开玩笑说11是幸运号码。\n  虽然Windows 11接口已被重新设计，但它比完整的重建更新鲜的油漆。是的，微软已将启动按钮移动到底部中心，但是，你不担心，你可以总是把它放回左角。还有大量的新生产率功能，以及标题功能：Android应用程序！\n  亚马逊（是的，亚马逊）将其Android应用商店带到新的Microsoft Store，并且Windows 11 PC本身将能够运行该软件，无论芯片为它们都能。\n  您将收取$ +税（如果适用）为华尔街日记。您可以随时在客户中心的任何时间更改帐单偏好或致电客户服务。您将在率或条款的任何变化提前通知您。您可以随时通过调用客户服务来取消订阅。 ", "note_en": "You don’t have to be a Microsoft historian to see the ping-pong pattern:\n  Windows XP — Hit!\t\t\t\t\t \t\t\tWindows Vista — Flop.\t\t\t\t\t \t\t\tWindows 7 — Hit!\t\t\t\t\t \t\t\tWindows 8 — Flop.\t\t\t\t\t \t\t\tWindows 10 — Hit!\n  If you were playing the odds, you’d bet  Windows 11, announced Thursday, would flop. But what I’ve seen so far of Windows 11 looks smart. Plus, Microsoft Chief Executive Satya Nadella, in an exclusive interview, joked that 11 is a lucky number.\n  While the Windows 11 interface has been redesigned, it’s more a fresh coat of paint than a complete remodel. Yes, Microsoft has moved the Start button to the bottom center, but, don’t you worry, you can always put it back in the left corner. There are loads of new productivity features, too, and the headline feature: Android apps!\n  Amazon (yes, that Amazon) is bringing its Android app store to the new Microsoft Store, and Windows 11 PCs themselves will be able to run the software, regardless of the chip that powers them.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-06-25 12:00:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,nadella,interview", "title": "WSJ：对Windows 11的attya nadella采访 ", "title_en": "WSJ: Interview with Satya Nadella about Windows 11", "transed": 1, "url": "https://www.wsj.com/articles/microsoft-windows-11-guide-11624549583", "via": "", "real_tags": ["windows", "nadella", "interview"]}, {"category": "", "categoryclass": "", "imagename": "f51d7c1ac8f3bcd6c3a437c69fa246de.jpg", "infoid": 1068171, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不是那么多，分布式计算意味着聚集在一起一堆廉价的X86服务器，并用某种形式的中间件配备，允许工作分布在数十万到数千个节点。这种戒除方法，这增加了软件堆栈的复杂性，因为正常的SMP和NUMA缩放技术，在十几个或两个节点上具有非常紧密的耦合计算和共享存储器，根本无法进一步伸展。\n 这些分布式系统难以构建，与我们在下一个平台上开始称之为“超广频系统”的人相比，这是儿童的发挥，这是在不断变化的“超级分布系统”中，因为分解和可兼容性在同一时间进入了系统架构师的想象力可以使用更广泛和更广泛的计算，内存，存储和网络组件 - 预计将以灵活而不是静态方式使用。\n 问题说，说出一个名为Enfabrica的隐形模式启动的共同创始人，就是这个新的超分布式架构比储存良好的酒吧有更多的瓶颈。他们说他们已经开发了硅，系统硬件和软件的组合，这些软件将创建一个更好适合超广频系统的新I / O架构。 enfabrica尚未从隐身模式下覆盖，但该公司的创始人们为我们达到了我们的第一轮资金 - 来自Sutter Hill Ventures的5000万美元 - 并希望在最终阐述他们在现代分布式系统中看到的问题。披露他们如何解决这些问题。\n  Enfabrica于罗氏·萨卡尔成立于2020年，其首席执行官Shijeet Mukherjee，其首席发展官员以及其他创始人，其成立顾问是Christos Kozyrakis，是斯坦福大学电气工程和计算机科学教授过去两位在伯克利除了David Patterson作为他的博士顾问，几十年来，他在加利福尼亚州加利福尼亚州加州大学。 Kozyrakis在斯坦福国运行MultiScale建筑和系统团队（MAST），并在谷歌和英特尔在其他组织中完成了研究所;他在矢量处理器，操作系统，云管理员的广泛工作以及用于交易存储系统的广泛工作。\n Sankar从多伦多大学和宾夕法尼亚大学的沃顿文学学校获得了学士学位的电气工程，并在赛普拉斯半导体中度过了七年的应用工程师和芯片建筑师，并且广泛的产品营销和管理总监世卫组织驾驶五代“三叉戟”和“战斧”数据中心切换ASIC，这些交换ASICS超过3亿港口销售和生成数十亿美元的Broadcom收入。\n Mukherjee在俄勒冈大学获得了俄罗斯大学，并在加入思科系统作为其技术人员的成员之前，在高端图形系统上工作了八年，并成为突破“加利福尼亚州”统一计算系统的工程董事融合服务器网络系统，专门处理虚拟接口卡，这是我们今天看到的DPU的前身。之后，Mukherjee在积云网络中花了近七年的软件工程副总裁，构建了创建其开源交换机软件的软件团队（现在是NVIDIA堆栈的一部分以及交换机ASIC，NIC和切换操作系统69亿美元收购Mellanox Technologies。）当NVIDIA购买积云时，Mukherjee在谷歌上做了两年的努力，在网络架构和平台上工作了 - 他不能像往常一样对他所做的事情更重要。\n  Sankar和Mukherjee相互了解，因为它是一个自然的高音扫描器和云建造者交换机，以了解开源网络操作系统供应商 - 基金队伍而不是其他方式。 Mukherjee和Kozyrakis在谷歌的Stints期间一起工作。他们组装的团队 - 确切的数字是一个秘密 - 是系统架构师和分布式系统工程师，它已经部署了“PlanetsCale软件”，Mukherjee将其纳入其中，包括来自亚马逊Web服务，Broadcom，思科系统，数字海洋，Facebook，谷歌的人员，英特尔和甲骨文。 \n“我们共同看到了分布式计算中发生的巨大转型，”Sankar告诉下一个平台。 “这被摩尔定律的减速是关键的，因为英特尔在设置服务器架构迭代步伐时失去了领导作用。它不再是滴答声循环，然后推动所有相应的硅和操作系统创新。这完全被高超划分器和云建设者破坏了。我们现在正在参与计算，存储和网络的异构实例。在哪里看到解决方案的多样性，云源处理器，其他ASIC，GPU，代码转换器，FPGA，分类闪存，可能分列的内存。我们在数据中心在数据中心级别发生的情况发生了什么，并且在数据中心级别的互连的需要现在将直接进入机架。“\n 很难争辩，我们没有。我们看到发生同样的事情，而I / O与计算和存储有关。以AI为例。\n “AI筹码基本上将其加工能力提高了10倍至100倍，具体取决于您认为谁，”Kozyrakis说。 “与此同时，系统正在变得越来越大。如果您只看过高音客，则数据中心大小的大小增加了一个数量级。所以我们有这种大规模的计算能力。但我们需要在I / O连接基础架构中提供10x，100倍，100倍，100倍。否则，将使这种能力的好处是非常困难的。“\n 为了使其直言不讳地，如果不那么令人印象深刻，但超级分布但超级分布得更复杂得多，而且没有正确的I / O永远不会上班。凭借viperscaling，Sankar说，分布式系统是用父子查询架构构建的，映射到具有相同内存和存储和相同的网络接口的同质双套接字X86服务器节点上。硬件基本上是相同的，这使得这一切都很简单，驱动卷经济学。\n “数据中心正在进行进入数据管道，”Sankar解释道。 “软件层中正在处理的多样性如何处理数据层是如何映射到基础结构层中，并且它在服务器架构中推动了不断的异构性，以使它们优化。我们坚信，今天勾勒出来的解决方案遭受了可扩展性和性能的问题，它们患上各种可兼容架构中的最佳品种。“\n 如果没有真正进入细节，Enfabrica表示它正在建立以更可扩展的方式粘合所有计算，存储和网络的硬件和软件。我们强烈怀疑Enfabrica将从快速网络和DPU借用一些想法，但这也不仅仅是在每个服务器中都有DPU并将它们绑在一起。亚马逊Web服务中的Pensando，Fungible，Nvidia和Annapurna Labs已经这样做。并坦率地说，这些公司会告诉您的是，许多智能NIC或DPU的许多想法都来自Mukherjee在UCS平台中的虚拟网络和存储接口上的工作。 Mukherjee在庞大的情况下，在某些超声波的方式突出了今天，顺便说一下。\n 没有进入细节，因为公司仍处于隐形模式，enfabrica认为它已经提出了更好的思想，以便大量分布式I / O. \n“如果你看看所有这些公司，他们已经建造了一个产品，现在他们会试图说服人们使用它们，”穆克烈说。 “虽然我们组装了一支关于产品需要做什么的人团队以及如何将其实际适合它需要适应的计算，网络和存储物的格子。这种差异实际上改变了我们如何强调硬件以及软件的哪些软件，以及您需要投入努力以及您没有的地方。例如，制作一个非常说明的点：一个东西的表格有多大？硬件始终会受到限制，软件将永远希望一切都是无限的。你如何做出这些决定，你如何分区？它要求提供这些解决方案的人，因为他们了解人们愿意采取削减以及绝对线业绩的情况。“\n 我们意识到这一切都没有告诉你enfabrica正在做什么。但是，我们可以告诉您公司如何考虑数据中心的I / O和这些领域的市场尺寸和玩家，计划扰乱。看看我们组装的这个图表：\n  这就是Sankar称之为“100亿美元的I / O问题”，即Enfabrica正在尝试解决，并且大致是上面所示互连的所有硅的总可卡网。这将铺设出各种层的互连堆叠的所有缺点。\n 无论enfabrica在做什么，我们都非常怀疑它会破坏带有服务器内的每个层，在行程中，横跨行，并在数据中心的墙壁内。该公司仍处于隐形模式，并不是说，但我们希望在2021和2022年期间听到更多，因为它有效地拦截了一个不同的技术和缩放系统，这些系统正在归档2023及以后。\n 从我们直接从我们到收件箱的一周中的亮点，分析和故事。现在订阅 ", "note_en": "Not so very long ago, distributed computing meant clustering together a bunch of cheap X86 servers and equipping them with some form of middleware that allowed for work to be distributed across hundreds to thousands to sometimes tens of thousands of nodes. Such scale-out approaches, which added complexity to the software stack, were necessary because normal SMP and NUMA scale up techniques, with very tightly coupled compute and shared memory across a dozen or two nodes, simply could not stretch any further.\n These distributed systems, which were difficult enough to build, are child’s play compared to what we at  The Next Platform are starting to call “hyperdistributed systems,” which are evolving as disaggregation and composability have entered the imagination of system architects at the same time as a wider and wider variety of compute, memory, storage, and networking components are available – and are expected to be used in flexible rather than static ways.\n The problem, say the co-founders of a stealth-mode startup called Enfabrica, is that this new hyperdistributed architecture has more bottlenecks than a well-stocked bar. And they say they have developed a combination of silicon, system hardware, and software that will create a new I/O architecture that better suits hyperdistributed systems. Enfabrica is not uncloaking from stealth mode just yet, but the company’s founders reached out to us as they were securing their first round of funding – $50 million from Sutter Hill Ventures – and wanted to elaborate the problems they see in modern distributed systems before they eventually disclose how they have solved those problems.\n  Enfabrica was formed in 2020 by Rochan Sankar, its chief executive officer, Shrijeet Mukherjee, its chief development officer, plus other founding engineers, and its founding advisor is Christos Kozyrakis, a professor of electrical engineering and computer science at Stanford University for the past two decades who got his PhD in computer science at the University of California at Berkeley with none other than David Patterson as his PhD advisor. Kozyrakis runs the Multiscale Architecture and Systems Team (MAST) at Stanford and has done research stints at Google and Intel, among other organizations; he has done extensive work on vector processors, operating systems, cluster managers for clouds, and transactional memory systems.\n Sankar got his bachelor’s in electrical engineering from the University of Toronto and an MBA from the Wharton School at the University of Pennsylvania and spent seven years at Cypress Semiconductor as an application engineer and chip architect and was notably the director of product marketing and management at Broadcom who drove five generations of its “Trident” and “Tomahawk” datacenter switching ASICs, which had over 300 million ports sold and generated billions of dollars in revenue for Broadcom.\n Mukherjee got his Master’s at the University of Oregon and spent eight years at Silicon Graphics working on high-end graphics systems before joining Cisco Systems as a member of its technical staff and becoming a director of engineering on the groundbreaking “California” Unified Computing System converged server-network system, specifically working on the virtual interface card that is a predecessor to the DPUs we see emerging today. After that, Mukherjee spent nearly seven years at Cumulus Networks as vice president of software engineering, building the software team that created its open source switch software ( now part of the Nvidia stack along with the switch ASICs, NICs, and switch operating systems from  the $6.9 billion acquisition of Mellanox Technologies.) When Nvidia bought Cumulus, Mukherjee did a two year stint at Google working on network architecture and platforms – and he can’t say much more about what he did there, as usual.\n  Sankar and Mukherjee got to know one another because it was a natural for the leading merchant silicon supplier for hyperscaler and cloud builder switches to get to know the open source network operating system supplier – Cumulus needed Broadcom more than the other way around of course. Mukherjee and Kozyrakis worked together during their stints at Google. The team they have assembled – the exact number is a secret – are system architects and distributed systems engineers that have deployed “planetscale software,” Mukherjee put it, including people from Amazon Web Services, Broadcom, Cisco Systems, Digital Ocean, Facebook, Google, Intel, and Oracle.\n “We jointly saw a massive transformation happening in distributed computing,” Sankar tells  The Next Platform. “And that is being keyed by the deceleration of Moore’s Law and on the fact that Intel has lost the leadership role in setting the pace on server architecture iterations. It is no longer a tick-tock cycle, which then drove all of the corresponding silicon and operating system innovation. That has been completely disrupted by the hyperscalers and cloud builders. And we are now in a race with heterogeneous instances of compute, storage, and networking. where we see a diversity of solutions, cloud sourced processors, other ASICs, GPUs, transcoders, FPGAs, disaggregated flash, potentially disaggregated memory. What we saw happening at the datacenter level in terms of the disaggregation of the architecture and the need for interconnects at the datacenter level is now headed straight into the rack.”\n It is hard to argue with that, and we don’t. We see the same thing happening, and the I/O is way far out of whack with the compute and the storage. Take AI as an example.\n “AI chips are basically improving their processing capabilities by 10X to 100X, depending on who you believe,” says Kozyrakis. “At the same time is that systems are becoming bigger. If you look at just hyperscalers, it’s an order of magnitude increase in the size of datacenters. So we have this massive increase in compute capacity. But we need to provide the 10X, the 100X, the 1000X really, in the I/O connectivity infrastructure. Otherwise, it will be very difficult to bring the benefits of this capacity to bear.”\n To put it bluntly, hyperscaling was relatively easy if no less impressive for its time, but hyperdistribution is much more complex and it is never going to work without the right I/O. With hyperscaling, says Sankar, distributed systems were built with parent-child query architectures mapped onto homogeneous two-socket X86 server nodes with the same memory and storage and the same network interfaces. The hardware was essentially the same, and that made it all easy and drove volume economics to boot.\n “Datacenters are evolving into data pipelines,” Sankar explains. “The diversity of what is happening in the software layer with respect to how data is being processed is mapping into the infrastructure layers, and it is driving increasing heterogeneity in the server architectures to make them optimized. We firmly believe that the solutions that are being sketched out today suffer from problems with scalability and performance, and they suffer from the inability to be best of breed across a wide range of composable architectures.”\n And without really getting into specifics, Enfabrica says it is building the hardware and software that is going to glue all of this compute, storage, and networking together in a more scalable fashion. We strongly suspect that Enfabrica will borrow some ideas from fast networks and DPUs, but that this is also more than just having a DPU in every server and lashing them together. Pensando, Fungible, Nvidia, and Annapurna Labs within Amazon Web Services are already doing that. And to be frank, what those companies will tell you is that many of the ideas that are in those smart-NICs or DPUs came from the work that Mukherjee did on the virtual network and storage interfaces in the UCS platform. The work Mukherjee did with Cumulus has also figured prominently in the way certain hyperscalers do their networking today, by the way.\n Without getting into specifics, since the company is still in stealth mode, Enfabrica thinks it has come up with a better idea for massively distributed I/O.\n  “If you look at all of these companies, they have built a product and now they are going to try to convince people to use them,” says Mukherjee. “Whereas we assembled a team of people who  know what the product  needs to do and how it will actually fit in into the lattice of compute, network, and storage that it needs to fit into. This difference actually changes how we emphasize what’s hardware and what’s software, and where you need to put effort in and where you don’t. For example, to make a very illustrative point: how big should a table of something be? Hardware is always going to be limited, software will always want everything to be unlimited. How do you make of those decisions and how do you partition? It requires people who have delivered these kinds of solutions because they understand where people are willing to take a cutback and where absolute line performance matters.”\n We realize that none of this tells you what Enfabrica is doing. But we can tell you how the company is thinking about I/O in the datacenter and the market sizes and players in these areas that it plans to disrupt. Take a look at this chart we have assembled:\n  This is what Sankar calls “the $10 billion I/O problem” that Enfabrica is trying to solve, and that is roughly the total addressable market of all of the silicon for interconnects shown above. This lays out all of the shortcomings of various layers of the interconnect stack.\n Whatever Enfabrica is doing, we strongly suspect that it is going to disrupt each of these layers withing the server, within the rack, across the rows, and within the walls of the datacenter. The company is still in stealth mode and is not saying, but we expect to hear more in 2021 and 2022 as it works to intercept a slew of different technologies and scale out systems that are being architected for 2023 and beyond.\n Featuring highlights, analysis, and stories from the week directly from us to your inbox with nothing in between.  Subscribe now", "posttime": "2021-06-25 12:00:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "enfabrica,takes,系统", "title": "ENFabrica采用超级I / O瓶颈 ", "title_en": "Enfabrica Takes On Hyperdistributed I/O Bottlenecks", "transed": 1, "url": "https://www.nextplatform.com/2021/06/24/enfabrica-takes-on-hyperdistributed-i-o-bottlenecks/", "via": "", "real_tags": ["enfabrica", "takes", "系统"]}, {"category": "", "categoryclass": "", "imagename": "7ceda3aa98247650e5626191bd0a344a.png", "infoid": 1068169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳跃以搜索leidenfrost效果是一种物理现象，其中液体，靠近液体的表面明显热的表面，产生绝缘蒸汽层，其保持液体迅速沸腾。因为这个＆＃39;排斥力＆＃39;，液滴悬停在表面上，而不是与热表面进行物理接触。\n 当烹饪时，这是最常见的，当少量水洒在热锅中时。如果平底锅＆＃39; S温度在leidenfrost点上方，这是水的大约193°C（379°F），水洗油机穿过锅，蒸发时间比水滴的速度蒸发被洒在凉爽的锅中。\n 该效果以德国博士约翰·戈特夫·莱森弗洛斯特（Johann Gootlob Leidenfrost）命名，他在1751年在普通水的某些品质中描述了它。\n     当它加热时，效果可以被视为水滴在不同时间洒在平底锅上。最初，随着PAN的温度在100°C（212°F）以下，水达到并慢慢蒸发，或者如果锅的温度远低于100°C（212°F），则水停留液体。随着盘的温度超过100°C（212°F），当触摸盘时，水滴嘶嘶声，这些液滴快速蒸发。后来，随着温度超过莱登弗洛斯特点，莱顿弗罗斯特效应发挥作用。在与平底锅接触时，水滴束成小球和散发器周围的小球，持续时间比锅的温度较低。这种效果有效，直到更高的温度导致任何进一步的水滴蒸发，以造成这种效果。\n 这是因为在Leidenfrost点的温度下，水滴的底部立即蒸发与热锅接触。所得到的气体悬浮在其上方的其余水滴，防止液态水和热锅之间的任何进一步的接触。由于蒸汽具有比金属盘更差的导热系数，因此平底锅和液滴之间的进一步传热被急剧下降。这也导致掉落能够在其上围绕锅上滑动。\n  Leidenfrost效应开始发生的温度并不容易预测。即使液滴的体积保持不变，leidenfrost点也可能是完全不同的，并且对表面的性质以及液体中的任何杂质的复杂性依赖性。有些研究已经进入了系统的理论模型，但它非常复杂。 [1]\n 该效果还由杰克多里亚蒸汽锅炉设计师爵士，威廉Fairbairn，参考其对大规模减少从热铁表面到水的热量，例如锅炉内的效果。在一对锅炉设计的讲座中，他引用了Pierre Hippolyte Butigny（1798-1884）的工作和King＆＃39的教授伦敦，伦敦学习这一点。在168℃（334°F）在168℃（334°F）下几乎立即蒸发的水滴在202℃（396°F）下持续152秒。锅炉火箱中的较低温度可能会蒸发水更快;比较MPEMBA效果。另一种方法是将温度提高超出莱顿弗罗斯特的温度。 Fairbairn也考虑了这一点，可能一直在考虑闪蒸蒸汽锅炉，而是考虑了随时不可逾越的技术方面。 \nleidenfrost点也可能被认为是悬停液滴持续最长的温度。 [3]\n 已经证明，可以通过利用超疏水表面稳定水晶漂蒸气层。在这种情况下，一旦建立了蒸汽层，冷却切勿坍塌层，并且不会发生成核沸腾;该层恰好缓慢地放松直至表面冷却。 [4]\n Leidenfrost效果已被用于开发高灵敏度环境质谱。在LeidenFrost条件的影响下，悬浮液滴不会释放分子，分子富含液滴内。在液滴的最后一刻蒸发所有富集的分子在短时域中释放，从而提高灵敏度。 [5]\n 基于莱登福克效应的热力发动机已被原型。它具有极低摩擦的优势。 [6]\n   Leidenfrost点表示稳定薄膜沸腾的发作。它表示沸腾曲线上的点，其中热通量最小，表面完全被蒸汽橡皮布覆盖。通过通过蒸汽导通和辐射，从表面到液体的热传递。在1756年，LeidenFrost观察到蒸汽膜支撑的水滴在热表面上移动时慢慢蒸发。随着表面温度的增加，通过蒸汽膜的辐射变得更显着，并且随着过度的温度增加，热通量增加。\n 大水平板的最小热量通量可以源自Zuber＆＃39; s等式，[3]\n q a min = chfgρv[σg（ρl-ρv）（ρlρv）2] 1÷4 {\\ displaystyle {{\\ frac {q} {a}} _ {min}} = c {{h} _ {fg} {{\\ rho} _ {v} {{\\ left [{\\ frac {\\ sigma g \\ left（{{\\ rho} _ {l}}  -  {{\\ rho } {{{\\ left（{{\\ rho} _ {l}} + {{\\ rho} _ {v}}} ^ {2}}} ^ {2}}} ^ {} ^ {1} \\！\\！\\ \\ dialup \\！\\！{} _ {4} \\;}}} \n在饱和温度下评估性质的情况下。 Zuber＆＃39; S常数C {\\ DisplayStyle C}，适用于适度压力的大多数流体约0.09。\n   h = c [kv3ρvg（ρl-ρv）（hfg + 0.4 cpv（t s-t sat））dμv（t s-t sat）] 1÷4 {\\ displaystyle h = c { {\\ left [{\\ frac {k_ {v} ^ {3} {{\\ rho} _ {v} g \\ left（{{\\ rho} _ {l}}  -  {{\\ rho} _ {v} } \\右）\\ left（{{h} _ {fg}}左（{{t} _ {s}}  -  {{t} _ {sat}} \\右）\\右）} {{{d} _ {o}} {{\\ mu} _ {v}}左（{{t} _ {s}}  -  {t} _ {sat}} \\ ）}} \\ \\ roting]} ^ {} ^ {1} \\！\\ \\ \\ \\ \\ dialup \\！\\！{} _ {4} \\;}}}\n 其中，d o {\\ displaystyle {{d} _ {o}}是管的外径。对于水平滚筒和垂直板，相关恒定C为0.62，为球体为0.67。在薄膜温度下评估蒸汽性能。\n 对于水平表面上沸腾的稳定薄膜，Berenson已经改进了溴利＆＃39; s等式，[7]\n H = 0.425 [KVF3ρVFG（ρl-ρv）（hfg + 0.4 cpv（t s-t sat））μvf（t s-t sat）σ/ g（ρl-ρv）] 1╱ 4 {\\ displaystyle h = 0.425 {{\\ left [{\\ frac {k_ {vf} ^ {3} {{\\ rho} {vf} g \\ left（{{\\ rho} _ {l}}  -  { {\\ rho} _ {v}} \\ left（{h} _ {fg}}左（{{t} _ {s}}  -  {{{{{{t}}}） -  {{ \\ {SAT}} \\右）\\ lex）} {{{t} _ {vf}} \\ left（{{t} _ {s}}  -  {{t} _ {sat}} \\右） {\\ sqrt {\\ sigma / g \\ left（{{\\ rho} _ {l}}  -  {{\\ rho} _ {v}}}}}}}}}}}}}}}}}}} \\ revally]}}}}}} \\ levent]}}}} \\ revally]}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}。 } \\！\\！\\ \\ Diagup \\！\\！{} _ {4} \\;}}}\n  h [μV2gρv（ρl-ρv）kv 3] 1÷3 = 0.0020 [4mπd vμv] 0.6 {\\ displaystyle h {{\\ left [{\\ frac {\\ mu _ { v} ^ {2}} {g {{\\ rho} _ {v}}左（{{\\ rho} _ {l}}  -  {\\ rho} _ {v}} \\ oled）k_ {v} ^ {3}}} \\右]}} ^ {{} ^ {1} \\！\\ \\ \\ \\ \\ \\ in dialup \\！\\！{} _ {3} \\;}}}} = 0.0020 {{\\ left [{\\ frac {4m } {\\ PI {{d} _ {v}} {{\\亩} _ {v}}}} \\右]} ^ {0.6}}}\n 其中，M是管的上端的L B m / h r {\\ {\\ {{b} / hr} / hr}中的质量流量 \n在高于最低热通量的过度温度下，辐射的贡献可观，并且在高过量温度下变得显着。因此，总传热系数可以是两者的组合。 Bromley建议了以下方程，从水平管的外表面上煮沸沸腾。\n H 4╱3 = HCONV 4 + 3 + HRADH 1╱3{\\ DISPLAYSTYLE {{H} ^ {{} ^ {4} \\！\\ \\ \\ DIAPUP \\！\\！{} _ {3} \\;}} = {{h} _ {conv}} ^ {} ^ {4} \\！\\！\\ \\ dialup \\！\\！{} _ {3} \\;} + {{h} _ {rad}} {{h} ^ {{} ^ {1} \\！\\！\\ \\ dialup \\！\\！{} _ {3} \\;}}}\n  H = H C O N V + 3 4 H R A D {\\ DisplayStyle H = {{H} _ {CONC}} + {\\ FRAC {3} {4}} {{H} _ {RAD}}}\n  hrad =εσ（t s 4  -  t sat 4）（t s  -  t sat）{\\ displaystyle {{h} _ {rad}} = {\\ frac {\\ varepsilon \\ sigma \\ left（t_ {s} ^ { 4} -t_ {sat} ^ {4} \\ other）} {\\ left（{{t} _ {s}}  -  {{t} _ {sat}}}}}}}}}}}}}}\n 其中，ε{\\ displaystyle \\ varepsilon}是solid和σ{\\ displaystyle \\ sigma}的发射率是stefan-boltzmann常数。\n  可以解决液滴和固体表面之间的蒸汽区域中的压力场的方程，用于使用标准动量和连续性方程。为了求解简单，在气相中假设线性温度曲线和抛物线速度曲线。假设气相内的热传递通过传导。通过这些近似，可以解决Navier-Stokes方程[8]以获得压力场。\n  Leidenfrost温度是一组固体液体对的性质。超出液体经历林登弗洛斯特现象的固体表面的温度被称为莱顿脱裂温度。利德策略温度的计算涉及计算流体的最小膜沸腾温度。 Berenson [9]获得了从最小热通量争论的最小薄膜沸腾温度的关系。虽然可以在上面参考中找到的最小膜沸腾温度的等式非常复杂，但可以从物理角度来理解它的特征。考虑的一个关键参数是表面张力。最小膜沸腾温度和表面张力之间的比例关系是预期的，因为具有较高表面张力的流体需要较高量的热量通量，以便核心沸腾的发作。由于核心沸腾后的薄膜沸腾，因此薄膜沸腾的最低温度应具有比例对表面张力的依赖性。 \n亨利开发了一种用于莱顿福克现象的模型，包括瞬态润湿和微层蒸发。由于Leidenfrost现象是薄膜沸腾的特殊情况，因此Leidenfrost温度与最小膜沸腾温度有关，通过所使用的固体性质中的关系。虽然Leidenfrost温度与流体的表面张力直接相关，但它间接依赖于薄膜沸腾温度。对于具有相似热神经性质的流体，具有较高表面张力的液体通常具有更高的裂片漂流温度。\n 例如，对于饱和水铜界面，Leidenfrost温度为257°C（495°F）。由于其较低的表面张力值（密度和粘度差异也有助于因素，甘油和常见醇的Leidenfrost温度明显较小。）\n   2015年发现非易失性材料，也显示出A＆＃39;反应性莱登弗罗斯特效果，＆＃39;由此观察到固体颗粒以不规则地漂浮在热表面和冰中。通过高速摄影，为高温抛光表面上的小颗粒（〜0.5mm）的小颗粒完成了反应性脱翅霉效应的详细表征。显示纤维素分解为短链低聚物，其熔化和湿滑表面随着与增加表面温度的增加而增加的热传递。以上675°C（1,247°F），观察到纤维素表现出剧烈沸腾的过渡沸腾和传热减少。观察到纤维素液滴（右侧描绘的纤维素）的升降液相高于约750℃（1,380°F），与热传递剧烈降低相关。 [12]\n 还显示出纤维素纤维素（大孔氧化铝）对多孔表面（大孔氧化铝）的高速摄影抑制反应性脱翅霉效应，并从表面上增强颗粒的总热传递速率。 A＆＃39的新现象;反应性leidenfrost（RL）效应＆＃39;通过无量纲量（φRL=τcrm/τrxn），其将固体颗粒热传递的时间常数与颗粒反应的时间常数相关，具有10 -1°的反应性裂开抗效果。 φrl＆lt; 10 +1。与纤维素的反应性脱翅霉效应将发生在许多高温应用中，碳水化合物聚合物，包括生物量转化为生物燃料，制备和烹饪食品和烟草使用。 [13]\n  在Jules Verne＆＃39; S 1876 Book Michael Strocoff，通过蒸发眼泪，将主角的节省从热刀片蒙蔽。 [14]\n 在2009年第7季的神话中的第7季，＆＃34;迷你神话混乱＆＃34;，球队展示了一个人可以使用莱顿弗罗斯特效应作为科学依据，将其手润湿，并将其短暂地浸入熔融铅中。 [15]\n    ^ Bernardin，John D .; Mudawar，Issam（2002）。 ＆＃34;莱森弗罗斯特点的腔激活和泡沫生长模型。热传递杂志。 124（5）：864-74。 DOI：10.1115 / 1.1470487。 \n^ a b c cantopera，dewitt，伯格曼＆amp;熔化：热量和传质的基础，第6版。第325-330页\n ^ Vakarelski，Ivan U.; Patankar，Neelesh a。 Marston，Jeremy O;陈，德里克y. c .; Thoroddsen，Sigurdur T.（2012）。 ＆＃34;用纹理的超疏水表面稳定leidenfrost蒸气层＆＃34;自然。 489（7415）：274-7。 BIBCODE：2012NATUR.489..274V。 DOI：10.1038 / Nature114​​18。 PMID 22972299.S2CID 4411432。\n ^ Subhrakanti Saha，Lee Chuin Chen，Mridul Kanti Mandal，Kenzo Hiraoka（2013年3月）。 ＆＃34;莱登弗洛斯特现象辅助热解吸（LPTD）及其在大气压质谱法下打开离子源的应用。美国质谱学杂志。 24（3）：341-7。 Bibcode：2013Jasms..2..341s。 DOI：10.1007 / s13361-012-0564-y。 PMID 23423791. S2CID 39368022.CS1 MAINT：使用作者参数（链接）\n ^井，加里g .; Ledesma-Aguilar，Rodrigio; MCHALE，GLEN; Sefiane，Khellil（2015年3月3日）。 ＆＃34;升华热发动机＆＃34;自然通信。 6：6390.BIBCODE：2015NATCO ... 6.6390W。 DOI：10.1038 / ncomms7390。 PMC 4366496.PMID 25731669。\n ^ a b james r. welty; Charles E. Wicks;罗伯特·威尔逊; Gregory L. Rorrer。，＆＃34;动量，热量和大规模转移的基础＆＃34;第五版，约翰瓦里和儿子。介\n  ^ Berenson，P.J.，薄膜沸腾的热量从水平表面存档2015-04-02在Wayback机器，传热，第83卷，1961年，第351-362页\n ^ Henry，R.E.，[[最小薄膜沸腾温度的相关性]，Chem。 eng。 Prog。 Symp。 Ser。 ，第70卷，1974，第81-90页 \n^＆＃34;科学家用高速摄影＆＃34捕获的结构表面上的木材夺取木材; phys.org。 ＆＃34;存档的副本＆＃34;从2015-06-11上存档原件。 CS1 MAINT：存档副本作为标题（链接）\n ^ teixeira，安德鲁r; Krumm，Christoph; Vinter，Katherine P; Paulsen，Alex D;朱，程;斯托巴斯卡尔·萨拉尔;约瑟夫，克里斯汀e; Greco，Katharine; Stelatto，Michael;戴维斯，埃里克;文森特，布伦顿;赫尔曼，理查德;苏苏斯基，威斯拉夫;施密特，兰尼D;粉丝，魏; Rothstein，Jonathan P; Dauenhauer，Paul J（2015）。 ＆＃34;结晶纤维素颗粒＆＃34的反应性剥离;科学报告。 5：11238.BIBCODE：2015NATSR ... 511238T。 DOI：10.1038 / srep11238。 PMC 4460903.PMID 26057818。\n   在美国俄勒冈大学的Heiner Linke，Heiner Linke的高速视频，图片和解释\n ＆＃34;科学家们让水上奔跑上坡＆＃34;通过BBC新闻，关于使用Leidenfrost效果来冷却计算机芯片。\n    杰弗里，科林（2015年3月10日）。 ＆＃34;在冷冻二氧化碳上运行的发动机可能会对火星的使命。 gizmag。 ", "note_en": "Jump to navigation  Jump to search  The  Leidenfrost effect is a physical  phenomenon in which a liquid, close to a surface that is significantly hotter than the liquid&#39;s  boiling point, produces an insulating  vapor layer that keeps the liquid from  boiling rapidly. Because of this &#39;repulsive force&#39;, a droplet hovers over the surface rather than making physical contact with the hot surface.\n This is most commonly seen when  cooking, when a few drops of water are sprinkled in a hot pan. If the pan&#39;s  temperature is at or above the Leidenfrost point, which is approximately 193 °C (379 °F) for water, the water skitters across the pan and takes longer to evaporate than it would take if the water droplets had been sprinkled into a cooler pan.\n The effect is named after the German doctor  Johann Gottlob Leidenfrost, who described it in  A Tract About Some Qualities of Common Water in 1751.\n     The effect can be seen as drops of water are sprinkled onto a pan at various times as it heats up. Initially, as the temperature of the pan is just below 100 °C (212 °F), the water flattens out and slowly evaporates, or if the temperature of the pan is well below 100 °C (212 °F), the water stays liquid. As the temperature of the pan goes above 100 °C (212 °F), the water droplets hiss when touching the pan and these droplets evaporate quickly. Later, as the temperature exceeds the Leidenfrost point, the Leidenfrost effect comes into play. On contact with the pan, the water droplets bunch up into small balls of water and skitter around, lasting much longer than when the temperature of the pan was lower. This effect works until a much higher temperature causes any further drops of water to evaporate too quickly to cause this effect.\n This is because at temperatures above the Leidenfrost point, the bottom part of the water droplet vaporizes immediately on contact with the hot pan. The resulting gas suspends the rest of the water droplet just above it, preventing any further direct contact between the liquid water and the hot pan. As steam has much poorer  thermal conductivity than the metal pan, further heat transfer between the pan and the droplet is slowed down dramatically. This also results in the drop being able to skid around the pan on the layer of gas just under it.\n  The temperature at which the Leidenfrost effect begins to occur is not easy to predict. Even if the volume of the drop of liquid stays the same, the Leidenfrost point may be quite different, with a complicated dependence on the properties of the surface, as well as any impurities in the liquid. Some research has been conducted into a theoretical model of the system, but it is quite complicated.  [1]\n The effect was also described by the eminent Victorian steam boiler designer,  Sir William Fairbairn, in reference to its effect on massively reducing heat transfer from a hot iron surface to water, such as within a boiler. In a pair of lectures on boiler design,  [2] he cited the work of Pierre Hippolyte Boutigny (1798-1884) and Professor Bowman of  King&#39;s College, London in studying this. A drop of water that was vaporized almost immediately at 168 °C (334 °F) persisted for 152 seconds at 202 °C (396 °F). Lower temperatures in a boiler  firebox might evaporate water more quickly as a result; compare  Mpemba effect. An alternative approach was to increase the temperature beyond the Leidenfrost point. Fairbairn considered this too, and may have been contemplating the  flash steam boiler, but considered the technical aspects insurmountable for the time.\n The Leidenfrost point may also be taken to be the temperature for which the hovering droplet lasts longest.  [3]\n It has been demonstrated that it is possible to stabilize the Leidenfrost vapour layer of water by exploiting  superhydrophobic surfaces. In this case, once the vapour layer is established, cooling never collapses the layer, and no nucleate boiling occurs; the layer instead slowly relaxes until the surface is cooled.  [4]\n Leidenfrost effect has been used for the development of high sensitivity ambient mass spectrometry. Under the influence of Leidenfrost condition the levitating droplet does not release molecules out and the molecules are enriched inside the droplet. At the last moment of droplet evaporation all of the enriched molecules release in a short time domain and thus increase the sensitivity.  [5]\n A  heat engine based on the Leidenfrost effect has been prototyped. It has the advantage of extremely low friction.  [6]\n   The Leidenfrost point signifies the onset of stable film boiling. It represents the point on the boiling curve where the heat flux is at the minimum and the surface is completely covered by a vapor blanket. Heat transfer from the surface to the liquid occurs by conduction and radiation through the vapor. In 1756, Leidenfrost observed that water droplets supported by the vapor film slowly evaporate as they move about on the hot surface. As the surface temperature is increased, radiation through the vapor film becomes more significant and the heat flux increases with increasing excess temperature.\n The minimum heat flux for a large horizontal plate can be derived from Zuber&#39;s equation,  [3]\n q  A      m  i  n     =  C        h     f  g           ρ     v             [        σ  g    (          ρ     L     −        ρ     v      )          (          ρ     L     +        ρ     v      )      2      ]             1        ╱             4           {\\displaystyle {{\\frac {q}{A}}_{min}}=C{{h}_{fg}}{{\\rho }_{v}}{{\\left[{\\frac {\\sigma g\\left({{\\rho }_{L}}-{{\\rho }_{v}}\\right)}{{\\left({{\\rho }_{L}}+{{\\rho }_{v}}\\right)}^{2}}}\\right]}^{{}^{1}\\!\\!\\diagup \\!\\!{}_{4}\\;}}}\n where the properties are evaluated at saturation temperature. Zuber&#39;s constant,            C    {\\displaystyle C}  , is approximately 0.09 for most fluids at moderate pressures.\n   h  =  C          [          k    v     3          ρ     v     g    (          ρ     L     −        ρ     v      )     (          h     f  g     +  0.4        c     p  v       (          T     s     −        T     s  a  t      )    )            D     o           μ     v       (          T     s     −        T     s  a  t      )      ]             1        ╱             4           {\\displaystyle h=C{{\\left[{\\frac {k_{v}^{3}{{\\rho }_{v}}g\\left({{\\rho }_{L}}-{{\\rho }_{v}}\\right)\\left({{h}_{fg}}+0.4{{c}_{pv}}\\left({{T}_{s}}-{{T}_{sat}}\\right)\\right)}{{{D}_{o}}{{\\mu }_{v}}\\left({{T}_{s}}-{{T}_{sat}}\\right)}}\\right]}^{{}^{1}\\!\\!\\diagup \\!\\!{}_{4}\\;}}}\n Where,                  D     o       {\\displaystyle {{D}_{o}}}   is the outside diameter of the tube. The correlation constant C is 0.62 for horizontal cylinders and vertical plates and 0.67 for spheres. Vapor properties are evaluated at film temperature.\n For stable film boiling on a horizontal surface, Berenson has modified Bromley&#39;s equation to yield,  [7]\n h  =  0.425          [          k    v  f     3          ρ     v  f     g    (          ρ     L     −        ρ     v      )     (          h     f  g     +  0.4        c     p  v       (          T     s     −        T     s  a  t      )    )            μ     v  f       (          T     s     −        T     s  a  t      )       σ    /   g    (          ρ     L     −        ρ     v      )        ]             1        ╱             4           {\\displaystyle h=0.425{{\\left[{\\frac {k_{vf}^{3}{{\\rho }_{vf}}g\\left({{\\rho }_{L}}-{{\\rho }_{v}}\\right)\\left({{h}_{fg}}+0.4{{c}_{pv}}\\left({{T}_{s}}-{{T}_{sat}}\\right)\\right)}{{{\\mu }_{vf}}\\left({{T}_{s}}-{{T}_{sat}}\\right){\\sqrt {\\sigma /g\\left({{\\rho }_{L}}-{{\\rho }_{v}}\\right)}}}}\\right]}^{{}^{1}\\!\\!\\diagup \\!\\!{}_{4}\\;}}}\n  h          [        μ    v     2      g        ρ     v       (          ρ     L     −        ρ     v      )     k    v     3       ]             1        ╱             3         =  0.0020          [        4  m     π        D     v           μ     v        ]      0.6       {\\displaystyle h{{\\left[{\\frac {\\mu _{v}^{2}}{g{{\\rho }_{v}}\\left({{\\rho }_{L}}-{{\\rho }_{v}}\\right)k_{v}^{3}}}\\right]}^{{}^{1}\\!\\!\\diagup \\!\\!{}_{3}\\;}}=0.0020{{\\left[{\\frac {4m}{\\pi {{D}_{v}}{{\\mu }_{v}}}}\\right]}^{0.6}}}\n Where, m is the mass flow rate in            l        b     m       /   h  r    {\\displaystyle l{{b}_{m}}/hr}   at the upper end of the tube\n At excess temperatures above that at the minimum heat flux, the contribution of radiation becomes appreciable and becomes dominant at high excess temperatures. The total heat transfer coefficient can be is thus a combination of the two. Bromley has suggested the following equations for film boiling boiling from the outer surface of horizontal tubes.\n h            4        ╱             3         =          h     c  o  n  v              4        ╱             3        +        h     r  a  d           h            1        ╱             3           {\\displaystyle {{h}^{{}^{4}\\!\\!\\diagup \\!\\!{}_{3}\\;}}={{h}_{conv}}^{{}^{4}\\!\\!\\diagup \\!\\!{}_{3}\\;}+{{h}_{rad}}{{h}^{{}^{1}\\!\\!\\diagup \\!\\!{}_{3}\\;}}}\n  h  =        h     c  o  n  v     +      3  4          h     r  a  d       {\\displaystyle h={{h}_{conv}}+{\\frac {3}{4}}{{h}_{rad}}}\n  h     r  a  d     =        ε  σ    (      T    s     4    −    T    s  a  t     4     )      (          T     s     −        T     s  a  t      )       {\\displaystyle {{h}_{rad}}={\\frac {\\varepsilon \\sigma \\left(T_{s}^{4}-T_{sat}^{4}\\right)}{\\left({{T}_{s}}-{{T}_{sat}}\\right)}}}\n Where,            ε    {\\displaystyle \\varepsilon }   is the emissivity of the solid and            σ    {\\displaystyle \\sigma }   is the Stefan-Boltzmann constant.\n  The equation for the pressure field in the vapor region between the droplet and the solid surface can be solved for using the standard momentum and  continuity equations. For the sake of simplicity in solving, a linear temperature profile and a parabolic velocity profile are assumed within the  vapor phase. The heat transfer within the vapor phase is assumed to be through  conduction. With these approximations, the Navier-Stokes equation can be solved  [8] to get the pressure field.\n  The Leidenfrost temperature is the property of a given set of solid-liquid pair. The temperature of the solid surface beyond which the liquid undergoes Leidenfrost phenomenon is termed as Leidenfrost temperature. The calculation of Leidenfrost temperature involves the calculation of minimum film boiling temperature of a fluid. Berenson  [9] obtained a relation for the minimum film boiling temperature from minimum heat flux arguments. While the equation for the minimum film boiling temperature, which can be found in the reference above, is quite complex, the features of it can be understood from a physical perspective. One critical parameter to consider is the  surface tension. The proportional relationship between the minimum film boiling temperature and surface tension is to be expected since fluids with higher surface tension need higher quantities of heat flux for the onset of  nucleate boiling. Since film boiling occurs after nucleate boiling, the minimum temperature for film boiling should have a proportional dependence on the surface tension.\n Henry developed a model for Leidenfrost phenomenon which includes transient wetting and microlayer evaporation.  [10] Since the Leidenfrost phenomenon is a special case of film boiling, the Leidenfrost temperature is related to the minimum film boiling temperature via a relation which factors in the properties of the solid being used. While the Leidenfrost temperature is not directly related to the surface tension of the fluid, it is indirectly dependent on it through the film boiling temperature. For fluids with similar thermophysical properties, the one with higher surface tension usually has a higher Leidenfrost temperature.\n For example, for a saturated water-copper interface, the Leidenfrost temperature is 257 °C (495 °F). The Leidenfrost temperatures for glycerol and common alcohols are significantly smaller because of their lower surface tension values (density and  viscosity differences are also contributing factors.)\n   Non-volatile materials were discovered in 2015 to also exhibit a &#39;reactive Leidenfrost effect,&#39; whereby solid particles were observed to float above hot surfaces and skitter around erratically.  [11] Detailed characterization of the reactive Leidenfrost effect was completed for small particles of  cellulose (~0.5 mm) on high temperature polished surfaces by high speed photography. Cellulose was shown to decompose to short-chain  oligomers which melt and wet smooth surfaces with increasing heat transfer associated with increasing surface temperature. Above 675 °C (1,247 °F), cellulose was observed to exhibit transition boiling with violent bubbling and associated reduction in heat transfer. Liftoff of the cellulose droplet (depicted at the right) was observed to occur above about 750 °C (1,380 °F) associated with a dramatic reduction in heat transfer.  [12]\n High speed photography of the reactive Leidenfrost effect of cellulose on porous surfaces (macroporous  alumina) was also shown to suppress the reactive Leidenfrost effect and enhance overall heat transfer rates to the particle from the surface. The new phenomenon of a &#39;reactive Leidenfrost (RL) effect&#39; was characterized by a dimensionless quantity (φ RL= τ conv/τ rxn), which relates the time constant of solid particle heat transfer to the time constant of particle reaction, with the reactive Leidenfrost effect occurring for 10 −1&lt; φ RL&lt; 10 +1. The reactive Leidenfrost effect with cellulose will occur in numerous high temperature applications with carbohydrate polymers including biomass conversion to  biofuels, preparation and  cooking of food, and  tobacco use.  [13]\n  In  Jules Verne&#39;s 1876 book   Michael Strogoff, the protagonist is saved from being blinded with a hot blade by evaporating tears.  [14]\n In the 2009 season 7 finale of   MythBusters, &#34; Mini Myth Mayhem&#34;, the team demonstrated that a person can wet their hand and briefly dip it into molten  lead without injury, using the Leidenfrost effect as the scientific basis.  [15]\n    ^   Bernardin, John D.; Mudawar, Issam (2002). &#34;A Cavity Activation and Bubble Growth Model of the Leidenfrost Point&#34;.  Journal of Heat Transfer.  124 (5): 864–74.  doi: 10.1115/1.1470487.\n  ^     a     b     c  Incropera, DeWitt, Bergman &amp; Lavine: Fundamentals of Heat and Mass Transfer, 6th edition. Pages 325-330\n ^    Vakarelski, Ivan U.; Patankar, Neelesh A.; Marston, Jeremy O.; Chan, Derek Y. C.; Thoroddsen, Sigurdur T. (2012). &#34;Stabilization of Leidenfrost vapour layer by textured superhydrophobic surfaces&#34;.  Nature.  489 (7415): 274–7.  Bibcode: 2012Natur.489..274V.  doi: 10.1038/nature11418.  PMID  22972299.  S2CID  4411432.\n ^    Subhrakanti Saha, Lee Chuin Chen, Mridul Kanti Mandal, Kenzo Hiraoka (March 2013). &#34;Leidenfrost Phenomenon-assisted Thermal Desorption (LPTD) and Its Application to Open Ion Sources at Atmospheric Pressure Mass Spectrometry&#34;.  Journal of the American Society for Mass Spectrometry.  24 (3): 341–7.  Bibcode: 2013JASMS..24..341S.  doi: 10.1007/s13361-012-0564-y.  PMID  23423791.  S2CID  39368022.  CS1 maint: uses authors parameter ( link)\n ^    Wells, Gary G.; Ledesma-Aguilar, Rodrigio; McHale, Glen; Sefiane, Khellil (3 March 2015).  &#34;A sublimation heat engine&#34;.  Nature Communications.  6: 6390.  Bibcode: 2015NatCo...6.6390W.  doi: 10.1038/ncomms7390.  PMC   4366496.  PMID  25731669.\n ^     a     b  James R. Welty; Charles E. Wicks; Robert E. Wilson; Gregory L. Rorrer., &#34;Fundamentals of Momentum, Heat and Mass transfer&#34; 5th edition, John Wiley and Sons. Page 327\n  ^  Berenson, P.J.,   Film boiling heat transfer from a horizontal surface  Archived 2015-04-02 at the  Wayback Machine, Journal of Heat Transfer, Volume 83, 1961, Pages 351-362\n ^  Henry, R.E.,  [A correlation for the minimum film boiling temperature],Chem. Eng. Prog. Symp. Ser. , Volume 70, 1974, Pages 81-90\n ^  &#34;Scientists levitate wood on structured surfaces captured by high speed photography&#34; Phys.org.    &#34;Archived copy&#34;.  Archived from the original on 2015-06-11 .  CS1 maint: archived copy as title ( link)\n ^    Teixeira, Andrew R; Krumm, Christoph; Vinter, Katherine P; Paulsen, Alex D; Zhu, Cheng; Maduskar, Saurabh; Joseph, Kristeen E; Greco, Katharine; Stelatto, Michael; Davis, Eric; Vincent, Brendon; Hermann, Richard; Suszynski, Wieslaw; Schmidt, Lanny D; Fan, Wei; Rothstein, Jonathan P; Dauenhauer, Paul J (2015).  &#34;Reactive Liftoff of Crystalline Cellulose Particles&#34;.  Scientific Reports.  5: 11238.  Bibcode: 2015NatSR...511238T.  doi: 10.1038/srep11238.  PMC   4460903.  PMID  26057818.\n   Site with high-speed video, pictures and explanation of film-boiling by Heiner Linke at the University of Oregon, USA\n &#34;Scientists make water run uphill&#34; by BBC News about using the Leidenfrost effect for cooling of  computer chips.\n    Jeffrey, Colin (March 10, 2015).  &#34;Engine running on frozen carbon dioxide may power mission to Mars&#34;.  Gizmag .", "posttime": "2021-06-25 11:17:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "效果,leidenfrost,温度", "title": "莱登弗洛斯特效果 ", "title_en": "Leidenfrost Effect", "transed": 1, "url": "https://en.wikipedia.org/wiki/Leidenfrost_effect", "via": "", "real_tags": ["效果", "温度"]}, {"category": "", "categoryclass": "", "imagename": "311ebf61da3005fd5526666c356bc384.png", "infoid": 1068168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于新加坡的创业公司宣布，它已经筹集了700万美元的LocalGlobe领导的种子资金，并参与了社会杠杆，Y组合者，Picus首都和猛禽集团。这回合还包括天使投资者，如马特罗宾逊，Gocardless的联合创始人; Carlos Gonzalez-Cadenas，Skyscanner前首席产品官员;弗兰克施特劳斯，德意志银行全球数字业务的前负责人;和乔尔yarbrough，亚太地区的raphyd。\n 罗拉德是在2019年由大卫·格兰特，诺曼韦诺·诺戈和罗哈特穆拉尼成立的。它的应用程序在三个月前推出，目前只邀请。塔罗德索赔注册已经增长了20％的周，现在拥有超过10万用户遍布全球。大约65％的塔罗德的用户之前有股票，而其余的是首次投资者。\n  该公司首席执行官Mulani告诉TechCrunch，当他对美国股票感兴趣时，种植了Gotrade的想法，但发现了许多交易障碍。\n “当我18岁时，我实际上看着在新加坡获得访问，银行每笔交易每次收取30美元。有效地，市场教会了我无法进入市场。快进十年，我决定再次调查它，银行仍在收取25美元的贸易，“他说。 “最重要的是，他们的用户界面是我不想看的东西。因此，我们决定建立一个常务能够获得访问的经纪平台。“\n “分数交易实际上有点稍后，”他补充道。 “这对我们来说是真正的MVP，因为小数真的让任何人都能在全球范围内投资，因为你所需要的只是一美元。”\n 罗宾情绪，SOFI和Stash所有特征分数交易，但Mulani表示，这些应用程序主要用于美国居民。另一方面，由于财务法规，美国居民无法使用塔罗德，因此其主要竞争对手是互动经纪人，萨克索银行和etoro。\n GoTrade不收取佣金，监管，不活动或股息费用。相反，它通过收取从存款的货币兑换的少量费用，并从经纪账户中取得的现金产生的兴趣。该应用程序可以自由使用，但计划添加用户可以链接到其帐户的高级支付订阅计划和虚拟借记卡。 \n塔罗拉德的用户是投资于当地股市的人，但不能以前贸易美国股票。它们在年龄差异很大，但25至34岁的是应用最大的细分市场，平均账户规模约为500美元。\n GoTrade作为Alpaca Securities LLC的推出经纪人，由金融行业监管机构（FINRA）监管，并作为中介。 Alpaca证券将其库存库存分成分数，塔雷德用户可以决定他们想要购买多少分数。该应用程序还允许他们设置预算，并自动计算通过名义价值交易所提供的分数股份的数量。\n 通过证券投资者保护公司（SIPC）保护用户账户高达500,000美元，并通过新加坡等的交易对手，如Rapyd和美国，包括羊魄和第一个共和国银行。为了保护用户，ToTrade仅使用完全资助的现金账户，没有任何保证金设施。 MULANI解释说，保证金账户有效意味着人们借钱投资，而完全资助的账户意味着用户只能投入他们已经存入其帐户的资金。芬兰和证券交易委员会规定还意味着25,000美元的账目只有日常贸易，或在同一天购买和销售安全，每五个交易日最多三次。\n 与何种投资应用程序一样，罗拉德包括教育内容，如具有投资条款定义的窗口，以及关于公开交易公司的新闻艺术品。其新资金将用于招聘和产品开发，强烈关注添加更多应用内容。\n 在一份声明中，LocalGlobe合作伙伴Remus Brett表示，“在过去的100年里，美国股票已经提供了10％的平均年度返回。随着复合，1,000美元的投资将于今天的价值1300万美元。这些回报在美国和其他发达市场中促进了财富创造，但世界上的大部分都错过了。我们认为塔罗德有可能帮助世界99％的收益获得同样的福利，即1％的人。在这段旅程中，我们非常兴奋地加入Rohit，David和Norman。“ ", "note_en": "The Singapore-based startup announced it has raised $7 million in seed funding led by LocalGlobe, with participation from Social Leverage, Y Combinator, Picus Capital and Raptor Group. The round also included angel investors like Matt Robinson, co-founder of GoCardless; Carlos Gonzalez-Cadenas, former chief product officer of Skyscanner; Frank Strauss, former head of Deutsche Bank’s global digital business; and Joel Yarbrough, Asia-Pacific head at Rapyd.\n GoTrade was founded in 2019 by David Grant, Norman Wanto and Rohit Mulani. Its app launched three months ago and is currently invite-only. Gotrade claims sign-ups have grown 20% week-on-week, and it now has more than 100,000 users spread across the world. About 65% of Gotrade’s users have traded stocks before, while the rest are first-time investors.\n  Mulani, the company’s chief executive officer, told TechCrunch that the idea for Gotrade was planted when he became interested in American stocks, but discovered many barriers to trading.\n “When I was 18, I actually looked to get access in Singapore, and banks were charging $30 per trade. Effectively, the market taught me that I could not get into the market. Fast forward ten years, I decided to look into it again, and the banks were still charging $25 a trade,” he said. “On top of that, their user interfaces were something I didn’t want to look at. So we decided to build a brokerage platform where anyone can get access.”\n “Fractional trading actually came a bit later,” he added. “That was the real MVP for us because fractional really makes investing accessible to anyone globally since all you need is one dollar.”\n Robinhood,  SoFi and  Stash all feature fractional trading, but Mulani said those apps are primarily used by U.S. residents. On the other hand, Gotrade is not available to U.S. residents because of financial regulations, so its main competitors are interactive brokers, Saxo Bank and  eToro.\n Gotrade does not charge commission, custody, inactivity or dividend fees. Instead, it monetizes by collecting a small fee on the currency exchange from deposits, and interest generated from uninvested cash in brokerage accounts. The app is free to use, but plans to add a premium paid subscription program and virtual debit card that users can link to their accounts.\n  Many of Gotrade’s users are people who have invested in their local stock markets, but weren’t able to trade U.S. stocks before. They vary widely in age, but 25 to 34-year-olds are the app’s biggest segment, and the average account size is about $500.\n Gotrade acts as an introducing broker to Alpaca Securities LLC, a U.S. stock brokerage that is regulated by the Financial Industry Regulatory Authority (FINRA) and serves as an intermediary. Alpaca Securities splits its stock inventory into fractions, and Gotrade users can decide how many fractions they want to buy. The app also allows them to set a budget, and automatically calculates the amount of fractional shares they can afford through notional value trading.\n User accounts are protected up to $500,000 by the Securities Investor Protection Corporation (SIPC), and money goes through counterparties regulated in Singapore, like Rapyd, and the United States, including Alpaca and First Republic Bank. To protect users, Gotrade works only with fully-funded cash accounts without any margin facility. Mulani explained that a margin account effectively means people are borrowing money to invest, while a fully-funded account means that a user can only invest the money they have already deposited in their account. FINRA and Securities Exchange Commission regulations also mean accounts under $25,000 can only day trade, or buy and sell a security on the same day, up to three times every five trading days.\n Like many investment apps aimed at first-time or relatively new traders, Gotrade includes educational content, like pop-ups with definitions for investment terms, and news articles about publicly-traded companies. Its new funding will be used for hiring and product development, with a strong focus on adding more in-app content.\n In a statement, LocalGlobe partner Remus Brett said, “Over the past 100 years, U.S. stocks have delivered average annual returns of 10%. With compounding, an investment of $1,000 back then would be worth $13 million today. These returns have fueled wealth creation in the U.S. and other developed markets but most of the world has missed out. We believe Gotrade has the potential to help the world’s 99% gain access the same benefits that the 1% have. We are incredibly excited to be joining Rohit, David and Norman on this journey.”", "posttime": "2021-06-25 10:40:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,美国,localglobe", "title": "Gotrade通过LocalGlobe获得7米，让世界各地的投资者购买美国股票的分数份额 ", "title_en": "\n\t\t\t\tGotrade gets $7M led by LocalGlobe to let investors around the world buy fractional shares of U.S. stocks\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/gotrade-gets-7m-led-by-localglobe-to-let-investors-around-the-world-buy-fractional-shares-of-u-s-stocks/", "via": "", "real_tags": ["股票", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068167, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微小化石的发现表明恐龙在冰冻地区举起年轻 - 可能是温血\n    它长长的冬天黑暗，冰冷的温度，往往稀缺资源，但一系列微小的化石表明恐龙不仅漫游北极，而且孵化并在那里举起他们的年轻人。\n 虽然恐龙化石以前在北极发现，但目前尚不清楚他们是否渴望过那里或季节性游客。\n  现在专家们说，从阿拉斯加北部恢复的非常年轻恐龙的数百个化石表明该地区复制的生物，这表明它是他们的永久家庭。\n 佛罗里达州立大学的古生物GREGORY ERICKSON教授和该研究的共同作者表示，发现是一种史前孕妇病房，添加了很少有遗骸，因为它们是如此小而细腻的。\n “当我们发现微小的化石时，我们被惊呆了，”他说。 “我们怀疑他们在北极筑巢，但预计没有恢复这种行为的证据。”\n  在杂志上写作埃克森及其同事们报告了他们如何分析从跨越十年的一系列探险中从上白垩纪王子克里克群中恢复的化石，并涉及使用细网眼筛网到筛选沉积物。 \n虽然以前在地层中发现了来自恐龙的遗留情况，但没有表现出复制证据。\n 但新的研究揭示了小恐龙的小牙齿和骨骼的发现，包括那些即将孵化或最近这样做的人。\n 在700米年前约会的化石来自大型和小型恐龙，覆盖至少七种不同类型的恐龙 - 包括鸭嘴和有角恐龙。埃里克森说，牙齿也发现了牙齿，可能只有六个月大。\n “我们已经建立了一个没有只是其中一个恐龙在那里筑巢的证据，但看起来几乎所有人，如果不是所有的话，”他说。\n 虽然调查结果排除了恐龙在繁殖后北部北方北部移动的想法，但埃里克森补充说，在北极孵化的年轻人将太小而无法在冬天旅行。\n “鉴于长孵化期，小孵化尺寸和短暂的北极夏季，恐龙很不可能迁移，”他说。\n 该团队表示，结论是，恐龙可能在北极全年期间被其他证据支持，包括在较低纬度的类似年龄的岩石中发现了许多物种。 \n当时恐龙漫游北极地区，该地区缺乏大地冰帽，并有针叶树林，但研究人员表示，该生物仍然面临严酷的条件，冬季持续长达120天的持续黑暗和平均年度气温在6C以上。\n 该团队写道，“恐龙，如果冬季居民，终于忍受了冬季条件，偶尔会降雪”。\n Erickson表示，该研究提出了恐龙如何在冬季应对的问题，这些团队提出较小的恐龙可能已经冬眠，可能在洞穴中，而较大的食草恐龙可能已经禁食 - 虽然吠陀，蕨类植物和苔藓等植物可能已经提供了一些食物。\n 该团队表示，羽毛可能已经提供了绝缘，而北极恐龙的发现 - 但不是两栖动物或乌龟等冷血生物 - 为至少一些恐龙的想法增添了支持。\n 爱丁堡大学的古生学家斯蒂芬布鲁斯博士表示，该研究表明是突破性的，并补充说，虽然化石是微小的，但他们的重要性是巨大的。\n “这些化石中的一些是尖头或头皮屑剥落的大小，并且他们在渗透的严格中幸存下来的事实是显着的，”他说。\n Brusatte添加了该研究表明，在这种恶劣的环境中，恐龙如何生存。 \n“对我来说是最令人惊叹的，”他说。 “这些恐龙 - 大型恐龙，小型，肉类食物，植物饮食者 - 必须形成整个社区，适应忍受极端冬季生存的挑战。” ", "note_en": "Discovery of tiny fossils indicates dinosaurs raised young in freezing region – and may have been warm-blooded\n    It had long stretches of winter darkness, freezing temperatures and often scarce resources, but an array of tiny fossils suggests dinosaurs not only roamed the  Arctic, but hatched and raised their young there too.\n While dinosaur fossils have previously been found in the Arctic, it was unclear whether they lived there year-round or were seasonal visitors.\n  Now experts say hundreds of fossils from very young dinosaurs recovered from northern Alaska indicates the creatures reproduced in the region, suggesting it was their permanent home.\n Prof Gregory Erickson, a palaeobiologist at Florida State University and a co-author of the research, said the discovery was akin to a prehistoric maternity ward, adding it was very rare to find remains of such young dinosaurs because they are so small and delicate.\n “We were stunned when we discovered the tiny fossils,” he said. “We suspected they were nesting in the Arctic, but didn’t anticipate recovering evidence of this behaviour.”\n  Writing in the journal Current Biology, Erickson and colleagues reported how they analysed fossils recovered from the Upper Cretaceous Prince Creek Formation in a series of expeditions spanning a decade and involved the use of fine mesh screens to sift sediments.\n Though remains from dinosaurs have previously been found in the formation, none showed evidence of reproduction.\n But the new research has revealed the discovery of tiny teeth and bones from young dinosaurs, including those who were just about to hatch or had recently done so.\n The fossils, dating to around 70m years ago, came from large and small-bodied dinosaurs covering at least seven different types – including duck-billed and horned dinosaurs. Teeth were also found from a young tyrannosaur, said Erickson, possibly just six months old.\n “We have built up a body of evidence that showed not just one of the dinosaurs was nesting up there, but it looks like almost all of them, if not all of them,” he said.\n While the findings rule out the idea that dinosaurs only moved north after reproduction, Erickson added that young hatched in the Arctic would have been too small to travel south for the winter.\n “Given long incubation periods, small hatching sizes, and the short Arctic summer, it is very unlikely the dinosaurs were migrating,” he said.\n The team said the conclusion that the dinosaurs likely lived in the Arctic year-round is backed up by other evidence, including that many of the species have not been found in rocks of a similar age at lower latitudes.\n  At the time that dinosaurs roamed the Arctic, the region would have lacked big polar ice caps and had conifer forests, but the researchers say the creatures still faced harsh conditions, with up to 120 days of continuous darkness in the winter and an average annual temperature of just above 6C.\n The team wrote that “the dinosaurs, if winter residents, endured freezing winter conditions with occasional snowfall”.\n Erickson said the study raised questions of how the dinosaurs coped in the winter, with the team suggesting smaller dinosaurs may have hibernated, potentially in burrows, while larger herbivorous dinosaurs may have fasted – although plants such as bark, ferns and moss may have provided some food.\n The team said feathers may have provided insulation, while the discovery of dinosaurs in the Arctic – but not cold-blooded creatures such as amphibians or turtles – adds support to the idea that at least some dinosaurs were warm-blooded .\n Dr Stephen Brusatte, a palaeontologist at the University of Edinburgh who was not involved in the study, said the research was groundbreaking, adding that while the fossils are tiny, their importance is huge.\n “Some of these fossils are the size of pinheads or dandruff flakes, and the fact that they survived the rigours of fossilisation at all is remarkable,” he said.\n Brusatte added the research showed how adaptable dinosaurs were to survive in such a harsh environment.\n “That to me is what is most stunning,” he said. “These dinosaurs – big ones, small ones, meat-eaters, plant-eaters – must have formed entire communities that adapted to endure the challenges of extreme winter survival.”", "posttime": "2021-06-25 10:33:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表明,lived,恐龙", "title": "研究表明，恐龙在北极居住 ", "title_en": "Dinosaurs Lived In the Arctic, Research Suggests", "transed": 1, "url": "https://www.theguardian.com/science/2021/jun/24/dinosaur-fossils-eggs-arctic-research", "via": "", "real_tags": ["表明", "lived", "恐龙"]}, {"category": "", "categoryclass": "", "imagename": "782111975764a57924727793a8603363.jpg", "infoid": 1068166, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿州，6月24日（路透社） - 技术评论家和联邦贸易委员会的新主席Lina Khan指定了三位顶级员工，以至于该代理机构如何变得更加积极地在其执行反垄断法和抗欺骗广告的法律方面。\n 汗，曾在6月15日宣誓，名叫霍莉·韦多瓦成为竞争局的代理主管，成为消费者保护局的代理负责人，伊利梅尔是代理商＆＃39;首席技术师一名FTC发言人周四说。\n 根据他们在LinkedIn的概况的说法，这三个目前在FTC担任民主委员会rohitChopra的顾问。 Chopra是一项被提名掌握消费者金融保护局的进步，正在等待确认。\n  观察员广泛期望FTC在Khan下变得更加激进，虽然在原子能机构无法达成协议的情况下，其律师必须在法官之前争论其案件。\n 去年与司法部合作的FTC与司法部一起执行反托拉斯法，为违反反托拉斯法律而起诉Facebook（FB.O），并向Amazon.com（Amzn.o）开放调查。 ", "note_en": "WASHINGTON, June 24 (Reuters) - Tech critic and the new chair of the Federal Trade Commission, Lina Khan, has named three top staffers in a signal that the agency could become more aggressive in how it enforces antitrust law and laws against deceptive advertising.\n Khan, who was sworn in on June 15, named Holly Vedova to be the acting head of the Bureau of Competition, Sam Levine to be the acting head of the Bureau of Consumer Protection and Erie Meyer to be the agency&#39;s chief technologist, an FTC spokesman said on Thursday.\n The three currently work at the FTC as advisors to Democratic Commissioner Rohit Chopra, according to their profiles on Linkedin. Chopra is a progressive who has been nominated to head the Consumer Financial Protection Bureau and is awaiting confirmation.\n  Observers broadly expect the FTC to become more aggressive under Khan although in the instances that the agency cannot reach an agreement on matters their lawyers must argue their cases before a judge.\n The FTC, which works with the Justice Department to enforce antitrust law, sued Facebook  (FB.O) last year for violating antitrust law and has an investigation open into Amazon.com  (AMZN.O).", "posttime": "2021-06-25 10:32:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "担任,bureau,ftc", "title": "FTC的Khan任命Erie Meyer担任首席技术人员，霍莉Vedova是竞争局主席，山姆莱文担任消费者保护局负责人 ", "title_en": "FTC's Khan appoints Erie Meyer as chief technologist, Holly Vedova as acting head of Bureau of Competition, Sam Levine as head of Bureau of Consumer Protection", "transed": 1, "url": "https://www.reuters.com/technology/new-ftc-chief-khan-names-some-top-staffers-including-competition-chief-2021-06-24/", "via": "", "real_tags": ["担任", "bureau", "ftc"]}, {"category": "", "categoryclass": "", "imagename": "d23e0cf1f08e5e7d856d17c5554d829e.jpeg", "infoid": 1068165, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编程注意：正如我注意到几周后，平台师在下周休假。 您的支持让我每年花一点时间放松，想想大想，并思考在这里，我可能能够为您做些什么，我不能感谢你。 7月6日星期二见到您的收件箱。 ", "note_en": "Programming note:  As I noted a couple weeks back,  Platformer is  on vacation next week. Your support allows me to take a little time off each year to relax, think big thoughts, and ponder what else I might be able to do for you around here, and I can’t thank you enough for it. See you back in your inbox on Tuesday, July 6.", "posttime": "2021-06-25 10:32:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,platformer,放松", "title": "平台师 ", "title_en": "Platformer", "transed": 1, "url": "https://www.platformer.news/p/microsoft-comes-for-the-creators", "via": "", "real_tags": ["平台", "放松"]}, {"category": "", "categoryclass": "", "imagename": "82a035d7b67e02d40b730207bea418a4.jpg", "infoid": 1068164, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4月初的某个时候，生活对居住在Richardson Bay周围的船只居民的Jaunty社区有很大压力。那是当保罗史密斯进入“战斗模式”时。\n 53岁的史密斯的朋友说，他在3月17日返回萨斯加里托海滨时，他已经离开了大约一个星期，发现了理查森湾港口和他的团队正在删除和准备摧毁术士 - 帆船史密斯过去几个月叫回家。\n “我知道保罗，”史密斯的朋友和许多自我识别的“锚出”之一，蒂姆·洛根说，直到最近在贝尔维德，丁苏顿，萨乌顿（Sausalito）之间的这种水体上的一个合法灰色地区，和Marin County的磨坊。据洛根和认识他的其他人说，史密斯是一位退伍军人。\n “他有一种善良的精神，只是试图保持自己，”洛根说。 “但是是的，他绝对有接触者。”\n 史密斯不是第一个失去漂浮的房屋，失去漂浮的房地产权（RBRA），政策制定者和执法人员在金门桥东边的政策制定者和执法部门。然而，他是第一个据称呼吁枪支响应这种驱逐的枪支。\n  洛根告诉它的方式，史密斯在空中发射了他的火炬枪，有同样的原因，任何水手都会。这是一个难忘的呼唤，意味着发出史密斯 - 谁不拥有手机 - 需要的帮助。然而，据官方警察报告称，史密斯瞄准了Harbormaster Curtis Havel的耀斑，他们正在拖着术士到索萨利托的工程师码头的附近军团的过程中，在那里将被粉碎。史密斯跟着他的小船上的港口，到达军队要求术士回来无济于​​事。\n 整个星期的紧张局势升级，因为众议员不断试图与史密斯接触，他藏在他的朋友Michael Ortega的船上，弹丸。 \n据澳门县警长的报告称，史密斯击败了射弹的舱口，在其腔室上安装了爆炸性煮沸的陷阱，并用他的斗牛犬小狗堆积在锚定的船的小屋中挖掘起来。 4月2日，警长的代表试图告知史密斯，他们有一个逮捕令，但他拒绝投降并提醒他穿着防弹背心的军官。\n 警长的特殊反应团队包围史密斯，在船上圈出了一些锚地被描述为“浮动坦克的军队”。警方报告国代表部署了在去年夏天乔治弗洛伊德抗议活动中遇到的许多相同武器示威者。他们烧掉了催泪气体，闪光手榴弹和胡椒喷洒到船上，并在史密斯射出五轮豆子 - 用三个击球。\n 目击者说，史密斯撤退了甲板下方，执法人员登上了船，使用锯条进入机舱。\n  警方报告说明史密斯通过试图用一个贴有两个金属尖刺的工具来刺伤他的立场。最终，射弹被拖到了剪刀游艇港，史密斯用令人惊叹的枪撒上了一个令人震惊的枪，并从船上拆除，从船上迅速着火并沉没。\n   该事件激怒和创伤了许多Richardson Bay Anchor-Outs  - 谁坚持他们在一个地区在国家的一些最高住房成本中尽最大努力刮掉，其中一些错过的薪水可能是持有的区别一个廉价的公寓和生活粗糙。\n Peter Romanowsky，一位72岁的锚地上目睹了史密斯捕获，记得燃烧船弹射弹，喷洒他在燃烧船上被描述为“Dinky Garden软管”的东西。执法弗洛特拉的并置和灭火后期爆炸的软弱试图使罗马斯基怀疑当局的优先事项。\n 自史密斯戏剧性捕获以来已经过了一个月，他仍然在监狱里，无法支付305,000美元的保释或保证债券。他指责四次指控 - 虐待动物，阻碍军官，以致命的武器攻击官员，并用枪支攻击。由于已从公开访问的官方报告中删除了一些上述细节，并且在过去几周内已增加5个针对史密斯的收费。 \n回到2019年，本地NPR会员克Q深深地深入了解了Richardson Bay的历史，揭示了该地区的牲畜文化追溯到1880年，当时旧金山贵族首次在贝尔维德和泰国岸边种植船屋。最初用作周末撤退，许多蓝色血腥旧福建人在1906年的地震和火灾之后发现自己在这些浮动遗产上全日制。\n 在20世纪上半叶的过程中，丰富的重建和重新押出的旧金山，以及萨乌托多海滨附近的前火车院子被转换为船舶建设工厂。船舶船舶，正如前工厂现在所知，搅拌了近100个船只，以便在美国海军中服务，并在第二次世界大战期间援助盟友。在盟军声称胜利之后，一个名叫唐阿库斯的前余地乘坐大部分余地占有土地，并开始向返回士兵和不需要住房的艺术家提供剩余的废料。\n  在几十年来之下，Richardson Bay将进入一个麦加的创意表达，拉扯饥饿的作家，艺术家，摇滚乐和嬉皮士的垃圾。艾伦吉斯伯格，艾伦吉斯伯格和感恩的成员沿着这个海岸线生活 - 穿过金门桥的旧金山的激进想法，并为花电和荒漠化的泥浆奠定了基础，最终绘制了赫尔当地执法。\n Richardson Bay在马林的四个城市旁边休息，并包含一个整个生态系统。立法和警务该地区仅为这个原因很复杂。作为港口的事实，水域也落在联邦管辖范围内，事物变得更加复杂。多层联邦，州，县和城市权力往往导致谁可以居住在理查森湾 - 以及多长时间。这种历史上的困惑是执法部门的头疼，这是一个植物在过去的100年里居住在安克雷奇的人。\n  这并不是说警方一直害怕过去弯曲他们的肌肉。 1971年，当玛林县警长的代表在一个不会放弃船的居民上吸引枪时，就在Richardson Bay上的事情特别紧张。这标志着所谓的“船屋战争”的开始，这脉冲了10年，直到各个有关方缔约方达成了一个解决方案，允许建立五个永久玛林斯来永久和安全地浮动。\n 虽然很多人很乐意遵守这些新的规则，但该协议还创造了一类和爱心的歹徒 - 锚 - 散货 - 船锚 - 谁无法或不愿意满足码头对船只维护的严格要求，并支付搭乘船用滑动，在哪里他们可以法律地将船只绑在码头上。\n  许多人带到了露天水，而不是默许的，在那里有一个杂志的法律和拉链执法在海上隔绝了他们的生活方式。 \n自70年代以来，南马林县的人口统计数据以及Richardson Bay周围的社区已经转变。曾经是一个古老的背向登陆者的避风港，寻求忙碌的城市生活中的受障人员已经成为一个白色领子工人的飞地，寻求一个安静的社区，方便客人前往旧金山的设施和高薪。曾经曾担任过周末居住的船屋和富裕的城市居民的紧急避难所，现在指挥百万美元的价格标签，并再次超出工作舱的范围。\n 根据Zillow家庭价值指数，在过去的10年里，Marin县的房屋价值从平均增加了一倍，平均增加了70万至近140万美元。 2017年，全国低收入住房联盟确定，居住在马林的租户需要赚61美元，以实惠租用每月约3000美元的两居室房屋。假设租金只有在多年来才能攀爬 - 特别是在Covid-19大流行之后，这为逃离旧金山的技术工人来说，逃离旧金山的附近的社区，在那里他们可以伸展双腿并在远程办理时呼吸新鲜空气。\n “我曾经能够在萨乌托托这里租用，”贝壳斯奈德说。 “我们有房子，公寓遍布。太好了。现在你不能。这是一个3,000美元到4,000美元，就像一室一室小屋一样。那么他们期待什么？我应该只是离开沙漠，因为我不能在这里闲逛？“斯奈德也选择了斯诺德的斯诺德，而不是解体，以保持自己的规则。几十年来，她居住在理查森湾锚地。\n “人们认为这是物质使用的障碍或心理健康，当时的人们陷入无家可归者是失业的，”北湾市中心街道队的高级总监Karen Strolia表示，基于硅谷的无家可归者外展组织。根据Strolia的说法，她的外展团队预计无与伦比的个人在大流行之后增加的人数 - 这正是他们所看到的，尽管许多锚地将在“无家可归者”一词中刺耳。\n  “我不是不是无家可归的 - 我住在我的船上，”亚瑟布鲁斯（亚瑟尔布鲁斯）曾倾向于跨越Marin县的豪华庄园。 “在Covid命中后，我在土地上失去了公寓。我买不起日托和汽车维修和租金，所以我全职在我的船上。“\n  湾区的几乎每个港口都有搭配母线板的容量 - 而且有些人曾多年待命球员 - 生活在理查森湾的便宜船上是低收入人民留在马林的唯一选择之一。但经过几十年的无规水生活，镇上的新罕由之限在镇上，锚地出局正在争取彻底改变的速度。\n 柯蒂斯·哈维尔 - 南加州出生的冲浪者和水手 - 在2019年7月宣誓就宣誓就哈比斯特的位置。他有一个良好意义的灵魂，那种吃奎奴亚藜和无肉香肠的人，因为他告诉我他做了在我们第一次采访前的一天晚上。 \n“我想消除这种概念，即[rbra]是一些巨大的代理商。不是。 It’s pretty much as mom-and-pop as you can get,” he says, clarifying that the RBRA comprises himself, the harbormaster, his assistant, and four elected officials. “我被雇用了临时六个月的基础，这就是如何开始的。”\n 在Richardson Bay携带秩序的当局将表示，安全是在目前对史密斯锚出的锚定的核心。一艘未经理性的船 - 未连接到码头上的码头，这本身就是靠岸地板 - 以及对其居民和其他船只的危险。即使这样的船很好锚定，强烈的风暴也可以将其撞击海岸线或使其引起倾覆。维修不良的船可能会将油，燃料或废物泄漏到水中。\n 由于这个原因，根据Richardson的湾区机构1987年的法律，船只仅允许丢弃72小时的锚72小时。之后，他们应该在返回船只再次返回之前至少一周离开。\n 问题是，该法律在本世纪中的四分之一的法律上并没有真正强制执行前港口票价巡逻理查森湾。\n 在2019年7月退休后，瑞国人聘请了Havel终于实施了安克雷奇的72小时的时间限制，并确保港口的每艘船都是海运 - 海员之间的争议术语，特别是那些生活，工作或在Richardson Bay上的生活或重建。\n  完整的船体，码码布线，安全储存的燃料容器以及正确处理废水的能力都列在RBRA的确定船舶的可耕种的准则中。不符合这些要求的船 - 以及其他 - 可以从锚地内提取并根据规则销毁。\n 一般而言，这些指导方针旨在确定船舶是否是“生命，肢体或财产的风险”和/或造成环境危害。虽然这些规则方面是保护人类，野生动物和更广泛的生态系统的，但Richardson Bay的锚地说，RICRA是不公平地瞄准船上的人，同时忽视其他被遗弃的，遗弃和漂流船只。这次指责召回了其他所谓的“贫困税”的批评 - 可能对带有手段的人带来不便的法规，但威胁到穷人的生计。 \n“我不会从这个角度来看这一点，”哦，你的游艇不是缩减。“我看着一些这些船只，我真的担心我打算叫一个，'嘿，嘿，这艘船下来了，我们找不到所以的“，”哈维尔说，在沉思的是rbra的可耕地标准时说。\n 当船只被视为不可思议时，Harbormaster将物理标记并将通知邮寄给船只的注册地址。 10天后，如果标记的船只尚未被移动，并且其所有者没有说出，则RBRA通常将乘船拖入美国陆军队的工程师队的Sausalito港口，在那里他们处理有害物质，再循环金属在船上，用挖掘机粉碎它的壳。无人认领的个人物品被抛出。\n “我现在感到胸痛，只是在考虑他们被摧毁的所有事情，”爱丽丝·涅文（Alice Nevin）说，衣服戴着三角帽子，涂上水的景观。 “他们摧毁了这艘船的古董港口窗户，对我来说是极端的亵渎，因为所有的木头和绳索和索具都可以被回收。”\n 哈维尔说，他在近两年内从锚地上删除了大约100艘船，因为留言运动员仍然存在93艘船。他担心这些持久船只对他们的居住者和周围的生物的威胁担心，并注意到现在是如何的，他们的船只是死亡陷阱。“\n “当你在海洋环境和母亲自然时开始将它脱落，她不在乎你的发动机是否不起作用，”他说。哈维尔希望有一天过渡到陆地上的锚地，鉴于每个冬季船只漂流，无论是撞到贝尔维地雷的家园还是撞到萨乌拉托的玛林纳斯。\n Harbormaster关闭我们的第一次采访警告我拿走了锚出来的所有故事，用一粒盐告诉他。\n “锚地上有一所虚假的叙事，我偷了船，我是一个海盗，我是一个小偷，我是一个强奸者，我是凶手。” \n在4月8日召唤他之前，我唯一知道Romanowsky的是他是理查森湾锚地，他可能愿意和我谈谈。我准备自己听到关于哈维尔的各种邪恶的事情，因为我在这个号码里打了一拳。\n  “他们在等我死了，”罗曼斯基曾在1964年逃离家里的船只逃离家里的船上，“罗马森斯基说。”我死的那一刻在几天内，他们会在几天内尝试抓住我的船。他们刚刚这样做，我们的一位老年人刚刚去世，并在48小时内，她的船屋被认为被摧毁。“\n 在阻止他的中间句子之前，我紧张地听到他的悲惨联系，要求他的坐标，并跑去亲自见到他。这显然不是一个故事我能够完全掌握而不用自己的眼睛看到它。\n 我的路线让我在塞萨利托江边的污垢清理，叫做Sanctuary City，这是一个安全的避风港，用于前锚 - 在海上失去家园 - 天气或rbra干预。联邦法官阻止了Sausalito迫使营地居民在大流行期间搬迁，这刺激了许多其他人，仍有船只或两艘船只，在陆地上花一些夜晚。\n 大麻的麝香通过篝火染色的蓝天徘徊。五颜六色的帽子的老家伙欢迎我，戴着温暖的握手和益生菌冰沙，可能捐赠了。有些婴儿跑来跑去，狗，尖叫者 - 因为有些人会称之为偶尔尖叫的人 - 以及我见过的最聪明的笑容的几个八大体。我们在一个大容易的圈子里坐在一个圆圈;这就像燃烧的人，只有大海。\n 我举行的麦克风就像是海鸥的大会的面包：圣所城市的居民饿了很饿，一个声音在下一个声音喊道。\n “我必须帮助一个怀孕九个月的朋友去商店，但在她说的过程中，”我想我正在进入劳动力。“她仍然想把杂货带到她的船上......她没有想离开她的船，“Paul Smith的朋友蒂姆洛根说。 \n另一个名叫Robert Powelson的另一个船居民，也是一个无与伦比的倡导者，通过电子邮件向我发出新闻稿。部分阅读，部分“社区是由于失去了一个心爱的长期住宿水母的悲伤。”船只进口商布鲁斯亚当斯（他的兄弟Mark的船）被罗布拉采取，并将他的船只绑在一起，以“捍卫他们被抓住并被Harbormaster Havel摧毁”。 Powelson说布鲁斯在两个侧面捆绑的船之间落下并于4月15日淹死。\n  就其部分而言，RBRA承认它正在将船只从水中拉出速度。该机构的2020年过渡计划积极扩大了港口运输的责任，以执行72小时的锚地时间限制，消除来自Richardson Bay的所有不可难以置信的船只。此外，Havel说他致力于确保只有未占用的船只被摧毁。\n “我没有把他们从家里扯下来，让他们从他们的主要船上物理地流离失所，把它们甩在街上，让他们看着他们在那里粉碎它，”他说，添加“这不是我们的驱动器无家可归。”\n 哈维尔认为一个船只被占用，如果它是“某人的睡眠的主要场所”，并说他通过自己的观察决定了这一点。他在黎明和黄昏时围绕着港口，如果他一直通告在那些小时内无人看管船，他将标记它即将删除的警告。另一方面，锚地说他们渴望失去家园的永恒恐惧。\n “有时候我甚至不想来散步我的狗岸边，因为如果他看到一个人没有那里的船，他会拿走它。它让我如此多的胁迫下，“Alice Nevin说。\n 生活在Richardson Bay的许多锚地说他们是他们船的合法主人。因此，他们争辩，RBRA的行为归咎于盗窃。其他人像哈维尔一样，可能会抵消那么大量的锚地，经常从船上跳到船上，收集废弃的血管并搅拌水。\n 由爱因斯坦去的一位老人水手并没有完全否认这笔费用。 “我改变了船，就像我改变内衣一样，”他笑了。 \n虽然Eisenstein笑着他在Richardson Bay留下的策略，一个在萨乌拉尼托租用的一名年轻女性，并且不想被识别，但她并没有被锚地社区逗乐。  “我一直被生活在营地处的无家可归者的一个无家可归者的口头上性骚扰，”她说，在她理解锚出社区的需要是真实的时，她认为他们正在给予太多的尊重， 虽然工作舱的其他人尽力通过规则发挥作用。  “我支持劳动人民的经济适用房，”这位妇女说。 “劳动的人甚至不能住在Sausalito中，因为它是如此昂贵。 第一步是为劳动的人提供价格合理的住房。“  SeaTrek Kayak＆amp;  ...... ", "note_en": "Sometime in early April, life got a lot more stressful for the jaunty community of boat dwellers living on and around Richardson Bay. That’s when Paul Smith went into “combat mode.”\n Friends of the 53-year-old Smith say he’d been away for about a week when he returned to the Sausalito Waterfront on March 17 to discover the Richardson Bay Harbormaster and his team were removing and preparing to destroy Warlock — the sailboat Smith had called home for the past several months.\n “I know Paul,” says Tim Logan, a friend of Smith’s and one of many self-identified “anchor-outs” who until recently were floating through life in a legal gray area on this body of water between Belvedere, Tiburon, Sausalito, and Mill Valley in Marin County. According to Logan and others who know him, Smith is a veteran.\n “He has a kind spirit and just tries to keep to himself,”  Logan says. “But yeah, he most definitely has PTSD.”\n Smith was not the first anchor-out to lose his floating home to the Richardson’s Bay Regional Agency (RBRA), the body of policymakers and law enforcement governing this seaside north east of the Golden Gate Bridge. However he was the first to allegedly discharge a firearm in response to such an eviction.\n  The way Logan tells it, Smith fired his flare gun in the air for the same reason any sailor would. It was a distress call, meant to signal that Smith — who does not own a cell phone — needed help. According to the official police report, however, Smith aimed the flare at Harbormaster Curtis Havel, who was in the process of towing Warlock to the nearby Army Corps of Engineers’ dock in Sausalito, where it was to be crushed. Smith followed the harbormaster on his small skiff, arriving at the Army Corps to demand Warlock back to no avail.\n Tensions escalated throughout the week, as deputies continuously tried to make contact with Smith, who had gone into hiding on his friend Michael Ortega’s boat, Projectile.\n According to a Marin County Sheriff’s report, Smith battened down the hatches of Projectile, installed explosive booby traps on its chamber doors, and holed up in the cabin of the anchored-out boat with his pit bull puppy, Runt Girl. On April 2, sheriff’s deputies tried to inform Smith they had a warrant for his arrest, but he refused to surrender and alerted the officers he was wearing a bulletproof vest.\n The Sheriff’s Special Response Team surrounded Smith, circling round the boat in what some anchor-outs described as an army of “floating tanks.” The police report states deputies deployed many of the same weapons demonstrators encountered at last summer’s George Floyd protests. They fired tear gas, flash grenades, and pepper spray onto the boat, and shot five bean bag rounds at Smith — hitting him with three of them.\n Witnesses say Smith retreated below deck, and law enforcement officers boarded the boat, using chainsaws to gain access to the cabin.\n  The police report states Smith defended his position by attempting to stab deputies with a tool that had two metal spikes affixed to a pole. Ultimately, Projectile was towed to Clipper Yacht Harbor, where Smith was subdued with a stun gun and removed from the boat, which quickly caught on fire and sank.\n   The incident infuriated and traumatized many of the Richardson Bay anchor-outs — who insist they are doing their best to scrape by in a region with some of the highest housing costs in the nation, where a few missed paychecks can be the difference between holding onto a cheap apartment and living rough.\n Peter Romanowsky, a 72-year-old anchor-out who witnessed Smith’s capture, remembers a fireboat circling Projectile, spraying what he described as a “dinky garden hose” at the burning vessel. The juxtaposition of the law enforcement flotilla and the feeble attempt at extinguishing the subsequent blaze makes Romanowsky suspicious of the authorities’ priorities.\n It’s been over a month since Smith’s dramatic capture and he remains in jail, unable to pay $305,000 in bail or secure a bond. He stands accused of four charges — cruelty to an animal, obstructing officers, assault with a deadly weapon on officers, and assault with a firearm. Some of the aforementioned details have since been removed from publicly accessible official reports and five more charges against Smith have been added to the sheriff’s report in the past few weeks.\n  Back in 2019, local NPR affiliate KQED took a  deep dive into the history of Richardson Bay, revealing that the region’s liveaboard culture dates back to 1880, when San Francisco aristocrats first planted houseboats on the shores of Belvedere and Tiburon. Initially used as weekend retreats, many blue blooded San Franciscans found themselves living full-time on these floating estates in the aftermath of the earthquake and fire of 1906.\n Over the course of the first half of the 20th century, the rich rebuilt and repopulated San Francisco, and a former train yard near the Sausalito waterfront was converted into a ship-building factory. Marinship, as the former factory is now known, churned out nearly 100 vessels to serve in the U.S. Navy and aid the allies during World War II. After the Allies claimed victory, a former Marinship worker named Don Arques took possession of most of the Marinship land and began offering leftover scrap materials to returning soldiers and untethered artists in need of housing.\n  In the decades to follow, Richardson Bay would evolve into a mecca of creative expression, pulling in a litter of starving writers, artists, rockstars, and hippies. Shel Silverstein, Allen Ginsberg, and members of the Grateful Dead lived along this shoreline — shuttling their radical ideas to and from San Francisco across the Golden Gate Bridge, and laying the foundation for a mushpot of flower power and debauchery, which eventually drew the ire of local law enforcement.\n Richardson Bay rests next to four cities in Marin and contains an entire ecosystem in itself. Legislating and policing the area is complicated for this reason alone. Throw in the fact that as a harbor, the waters also fall under federal jurisdiction and things get even more convoluted. The multiple layers of federal, state, county, and city authority have often led to confusion as to who may live on Richardson Bay — and for how long. That confusion, which has historically been a headache for law enforcement, has been a boon for those living in anchorage here for the past 100 years.\n  That’s not to say police have been afraid of flexing their muscles in the past. In 1971, matters on Richardson Bay got particularly tense when Marin County Sheriff’s deputies drew a gun on a resident who wouldn’t give up his boat. This marked the start of the so-called “Houseboat Wars,” which pulsed for 10 years until the various concerned parties reached a settlement allowing for the establishment of five permanent marinas for floating homes to permanently and safely dock.\n While plenty were happy to abide by these new rules, the agreement also created a class of peace-loving outlaws — the anchor-outs — who were unable or unwilling to meet the marina’s strict requirements for boat maintenance and pay for a liveaboard slip, where they could legally tie their boat to a dock.\n  Rather than acquiesce, many took to the open water, where a murkier set of laws and lax enforcement insulated their lifestyle at sea.\n  Since the ’70s, the demographics of southern Marin County, and the communities surrounding Richardson Bay, have shifted. What was once a haven for granola-munching back-to-the-landers seeking a reprieve from hectic city life has become an enclave of white collar workers seeking a quiet community with easy access to the amenities and high salaries of San Francisco. And the houseboats that once served as weekend getaways and emergency shelters for wealthy city dwellers now command million-dollar price tags and are once again beyond the reach of the working class.\n Over the past 10 years, the value of homes in Marin County has doubled, from an average of $700,000 to almost $1.4 million, according to the Zillow Home Value Index. In 2017, the National Low Income Housing Coalition determined that tenants living in Marin would need to make $61 an hour to affordably rent a two-bedroom home at around $3,000 per month. It’s safe to assume rents have only climbed in the years since — especially in the wake of the COVID-19 pandemic, which saw tech workers fleeing San Francisco for nearby communities where they could stretch their legs and breathe fresh air while telecommuting.\n “I used to be able to rent here, in Sausalito,” says Shell Snyder. “We had houses, apartments all over. It was great. And now you can’t. It’s $3,000 to $4,000 just for, like, a one-room shack. And so what do they expect? I’m supposed to just leave to the desert because I can’t afford to live up here?” Rather than decamp to Joshua Tree, Snyder chose to stay put and make her own rules. She has lived as a Richardson Bay anchor-out for decades.\n “People assume it’s substance-use disorder or mental health, when the No. 1 cause of people falling into homelessness is job loss,” says Karen Strolia, senior director of the North Bay’s Downtown Streets Team, a Silicon Valley-based homelessness outreach organization. According to Strolia, her outreach team expected the number of unhoused individuals to increase in the wake of the pandemic — and that’s exactly what they saw, though many anchor-outs would bristle at the term “homeless.”\n  “I wasn’t and still am not homeless — I live on my boat,” says Arthur Bruce, a landscaper who tends to lavish estates across Marin County. “I lost my apartment on land just after COVID hit. I couldn’t afford daycare and car maintenance and rent, so I went full time on my boat.”\n  With nearly every harbor in the Bay Area at capacity for liveaboard slips — and some with years-long waitlists — living on a cheap boat in Richardson Bay has been one of the only options for low-income folks to remain in Marin. But after decades of unregulated on-the-water living, a new harbormaster is in town and the anchor-outs are fighting a riptide of sweeping changes.\n Curtis Havel — a Southern California-born surfer and sailor — was sworn into the position of harbormaster in July 2019. He has a well-meaning aura, the type of guy who eats quinoa and meatless sausage for dinner, as he tells me he did the night before our first interview.\n “I want to dispel this notion that the [RBRA] is some huge agency. It’s not. It’s pretty much as mom-and-pop as you can get,” he says, clarifying that the RBRA comprises himself, the harbormaster, his assistant, and four elected officials. “I was hired on for a temporary six-month basis and that’s how it all started.”\n The authorities charged with keeping order in Richardson Bay will say that safety is at the heart of their current campaign against anchor-outs like Smith. An unmoored boat — unattached to a dock that is itself secured to the bay floor — is a danger to its inhabitants and other vessels, as well. Even if such a boat is well anchored, a strong storm could dash it against the shoreline or cause it to capsize. Boats in poor repair may leak oil, fuel, or waste products into the water.\n For this reason, vessels are only allowed to drop anchor for 72 hours, according to a law codified in 1987 by the Richardson’s Bay Regional Agency. After that, they are supposed to leave for at least a week before returning to drop anchor again.\n Problem is, that law wasn’t really enforced in the quarter of a century that former Harbormaster Bill Price patrolled Richardson Bay.\n After Price retired in July 2019, the RBRA hired Havel to finally implement the anchorage’s 72-hour time limit and to ensure that every vessel in the harbor is  seaworthy — a contentious term among seamen, especially those living, working, or recreating on Richardson Bay.\n  An intact hull, up-to-code wiring, safely stored fuel containers, and the ability to properly dispose of wastewater are all listed in the RBRA’s  guidelines for determining a vessle’s seaworthiness. Boats that do not meet these requirements — and others — may be extracted from the anchorage and destroyed according to the rules.\n Generally speaking, these guidelines are meant to determine whether a vessel is “a risk to life, limb, or property” and/or poses “an environmental hazard.” While these rules are ostensibly in place to protect humans, wildlife, and the broader ecosystem, the anchor-outs of Richardson Bay say the RBRA is unfairly targeting those living on their boats while ignoring other abandoned, derelict, and drifting vessels. This accusation recalls critiques of other so-called “poverty taxes” — regulations that may pose something of an inconvenience to individuals with means but threaten the very livelihoods of the poor.\n  “I’m not coming at this from the perspective of, ‘Oh, your yacht is not up to scale.’ I look at some of these boats and I genuinely worry that I’m going to get a call that, ‘Hey, this boat went down and we can’t find so-and-so’,” Havel says in contemplation of the RBRA’s seaworthiness criteria.\n When a vessel is deemed unseaworthy, the harbormaster will physically tag it and mail a notice to the vessel’s registration address. After 10 days, if the tagged vessel hasn’t been moved and its owner hasn’t spoken up, the RBRA will typically tow the boat into the U.S. Army Corps of Engineers’ Sausalito harbor, where they dispose of hazardous materials, recycle the metals on the boat, and crush its shell using an excavator. Unclaimed personal items are thrown out.\n “I’m feeling chest pains right now just thinking about all of the things that they’ve destroyed,” says Alice Nevin, an anchor-out who wears a tricorn hat and paints landscapes of Richardson Bay from the water. “They busted out the antique port windows of this one boat, which to me was extreme sacrilege because all of the pieces of wood and ropes and rigging could have been recycled.”\n Havel says he has removed roughly 100 vessels from the anchorage in his nearly two years as harbormaster, while 93 boats remain. He worries about the threat these lasting vessels pose to their occupants and the living things around them, noting how “right now, their vessels are death traps.”\n “When you’re in the marine environment and mother nature starts dishing it out, she doesn’t care if your engine doesn’t work,” he says. Havel hopes to one day transition the anchor-outs onto land, given that every winter vessels go adrift and either crash into homes in Belvedere or crash into marinas in Sausalito.\n The harbormaster closed our first interview warning me to take all stories the anchor-outs tell about him with a grain of salt.\n “There’s a host of false narratives on the anchorage that I steal boats, that I’m a pirate, that I’m a thief, that I’m a rapist, that I’m a murderer.”\n   The only thing I knew about Romanowsky before calling him on April 8 was that he was a Richardson Bay anchor-out and that he might be willing to talk to me. I prepared myself to hear all sorts of vile things about Havel as I punched in the number.\n  “They’re waiting for me to die,” said Romanowsky, who has been living on a boat in Richardson Bay since running away from home as a teenager in 1964. “And the minute I die, within days, they’re gonna try to grab my boat. They just did that, one of our senior citizens just died, and within 48 hours, her houseboat was taken to be destroyed.”\n I strained to hear him over the choppy connection for 45 minutes before stopping him mid-sentence, asking for his coordinates, and racing out to meet him in person. This was clearly not a story I’d be able to fully grasp without seeing it with my own eyes.\n My directions brought me to a dirt clearing on the Sausalito waterfront called Sanctuary City, a safe haven for former anchor-outs who lost their homes at sea — either to rough weather or RBRA intervention. A federal judge has blocked Sausalito from forcing relocation of the camp residents during the pandemic, which has spurred many others, who still have a boat or two, to pitch tents and spend some nights on land.\n The musk of marijuana wafted through a bonfire-stained blue sky. Old guys in colorful hats welcomed me to Sanctuary City with warm handshakes and probiotic smoothies, probably donated. There were babies running around, dogs, screamers — as some would call the folks who’d scream sporadically — and a few octogenarians with the brightest smiles I had ever seen. We sat in a circle under a big easy-up; it was like Burning Man, only by the sea.\n The microphone I held was like bread for an assembly of seagulls: The residents of Sanctuary City were hungry to be heard, and one voice shouted over the next.\n “I had to help a friend who was nine months pregnant get to the store, but in the process she said, ‘I think I’m going into labor.’ She still wanted to take the groceries to her boat… she didn’t wanna leave her boat,” said Tim Logan, friend of Paul Smith.\n Another boat-dweller named Robert Powelson, who is also an advocate for the unhoused, emailed me a press release. It read, in part, “The community is grief stricken by the loss of a beloved and long-time live-aboard mariner.” Vessel importer Bruce Adams, whose brother Mark’s boat was taken by the RBRA, took to side-tying his boats to “defend against them being taken and destroyed by Harbormaster Havel.” Powelson says Bruce fell between two of the side-tied boats and drowned on April 15.\n  For its part, the RBRA acknowledges that it is pulling boats out of the water at a rapid clip. The agency’s  2020 Transition Plan aggressively amplified the responsibilities of the harbormaster to enforce the 72-hour anchorage time limit and eliminate all unseaworthy vessels from Richardson Bay. Still, Havel says he is committed to ensuring that only unoccupied vessels are destroyed.\n “I have not ripped somebody from their home and made them homeless, physically displaced them from their primary vessel, dumped them on the street and made them watch as I crushed it there,” he says, adding “It’s not our drive to make someone homeless.”\n Havel considers a vessel to be occupied if it’s “someone’s primary place to sleep,” and says he determines this through his own observation. He travels around the harbor at dawn and dusk, and if he consistently notices a boat is unattended in those hours, he will tag it with a warning of its imminent removal. The anchor-outs, on the other hand, say they live in perpetual fear of losing their homes.\n “There was times I didn’t even want to come and walk my dog on shore because if he sees a boat with a person not there, he’ll take it. It’s put me under so much duress,” anchor-out Alice Nevin says.\n Many of the anchor-outs living in Richardson Bay say they are the rightful owners of their boats. As such, they argue, RBRA’s actions amount to theft. Others, like Havel, might counter that plenty of the anchor-outs regularly bounce from boat to boat, collecting abandoned vessels and cluttering the water.\n One elderly sailor who goes by Einstein doesn’t exactly deny this charge. “I change boats like I change my underwear,” he laughs.\n While Eisenstein jokes about his strategies for remaining in Richardson Bay, one young woman who is legally renting a slip in Sausalito and did not want to be identified, says she isn’t amused by the anchor-out community.\n “I have been verbally sexually harassed consistently by one of the homeless individuals living at the encampment,” she said, adding that while she understands the needs of the anchor-out community are real, she feels that they are being given too much deference, while others in the working class do their best to play by the rules.\n “I support affordable housing for working people,” the woman said. “Working people can’t even afford to live in Sausalito because it’s so expensive. The first step is to provide affordable housing to working people.”\n  Seatrek Kayak &amp; \n......", "posttime": "2021-06-25 10:31:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bay,wars,史密斯", "title": "Richardson Bay的船屋战争 ", "title_en": "The Houseboat Wars of Richardson Bay", "transed": 1, "url": "https://www.sfweekly.com/news/pirates-bay-richardson-sausalito/", "via": "", "real_tags": ["bay", "wars", "史密斯"]}, {"category": "", "categoryclass": "", "imagename": "cac752605fa29633404bb6e65aaa9ad0.jpg", "infoid": 1068163, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个工作日晚上，我们的编辑指导您通过当天最大的故事，帮助您发现新的想法，并让您惊喜。订阅将此交付给您的收件箱。\n  世界以奇怪的方式工作，并且在我们忽略的日常物体中通常可以找到有趣的设计选择。这里有两个夏天思考。\n 番茄酱瓶。如果你已经足够老了记住玻璃Heinz番茄酱瓶，你也可能会记住他们使用的令人沮丧。你会击中底部，最终，一个巨大的blob会挥动，毁了你的盘子。\n Heinz的目前的瓶子是可挤压的，它将分配器恢复到底部，但其阀门如此紧张，每次挤压仍然会出现一堆番茄酱。\n 我将Heinz挤压瓶与圆柱形的细小尖端的排序进行了比较，可装饰许多餐馆和野餐桌。我可以让这款通用瓶输出每次挤压的调味品30倍，而不是宽阔的娃娃。今天的瓶子可能有利于炸薯条，但它释放了太多的番茄酱，穿着汉堡或热狗。\n 较早，更便宜的包装技术似乎优越。那么为什么Heinz会部署更糟糕的或至少减少灵活的设计？\n 罗切斯特理工学院包装科学主席Daniel Johnson，向我保证了Kraft Heinz等大公司在他们的包装后面放了大量的R＆amp; D.番茄酱瓶将受到对焦组的使用偏好，举起瓶颈习惯等。一位海因斯发言人告诉我，“我们发现我们的消费者更喜欢玩得沸的汉堡或浸泡。” \n这将解释为什么瓶子的工作方式，但它不能阻止我哀叹这么票据使用我们国家最喜欢的调味品。投资廉价，野餐型瓶子，并从品牌名称瓶中分配进入其中，以更加多功能挤压。\n 无籽西瓜。国家西瓜促销委员会高级总监Stephanie Barlow告诉我，今天在美国消费的90％以上的西瓜是无籽。这种变化发生了缓慢，然后快速发生：第一个无籽杂交瓜出现在20世纪中期，但工业农民并没有弄清楚如何在2000年代中期以规模有效地授予它们。\n 这改变了西瓜如何被吃掉。种子甜瓜最好用作楔形，用手，卫生巾或 - 传统方法咳痰除去种子。但是Sans Seeds，西瓜来享受更多样化的用途：在水果沙拉，叶茂盛沙拉，甚至在比萨饼上。\n 后者的食谱是西瓜委员会在促销活动中建议宣传迪士尼皮克尔新的动画电影卢卡的宣传活动，该电影卢卡在亨里亚的北部意大利设有。西瓜在电影中似乎很短暂，当阳台上的两个女孩可以在宽阔的楔子中搭配地完成。由皮克斯（Pixar）创造的促销形象，而不是西瓜板，甚至展示了薄膜的海怪物，享受黑色种子果实的笑容。\n 巴洛告诉我，西瓜板在其通信中只使用无籽 - 西瓜图像强调。 “但是，种子西瓜切片的视觉占上风，”她承认。\n 这可能是因为水果与夏季怀旧的象征关系。卢卡的意大利里维埃拉回忆与我自己的夏令营有一块。当涉及西瓜时，我们吃水果，但我们也消耗了图像。\n 做任何普通的东西让你想知道，为什么这样？将它们发送至hello@theatlantic.com。 \n（1）一个人死了，在迈阿密附近迈阿密附近倒塌后，几十个未占据。 （2）昨天在Court在法庭上的流行明星残酷的辩护之后，呼吁“免费布兰妮”继续。 （3）“基础设施周”终于结束：乔·拜登总统宣布了两党妥协。\n 一个问题，回答：如果我旅行，我的戴头皮不会戴面具，我该怎么办？我们的副管理编辑Rachel Gutman有一些建议：\n 如果您完全接种疫苗，而不是免疫抑制或免疫抑制，您不应该与塞蜂制出来的任何显着危险。在任何长途旅行中，您的乘客都需要吃喝，并且在购买机票之前应该为此做好准备。\n  如果您特别担心面罩合规性，您可能希望乘火车或飞机选择旅行，导体和空乘人员更有可能在行驶中巡逻。但这并不会消除在董事会前的车站或机场的自由的可能性。\n 在Rachel的新文章中找到更多疫苗夏季旅行的安全规则。如果你想要一个有趣的假期，不仅仅是一个安全的问题，我们的幸福专栏作家亚瑟C. Brooks，你已经覆盖。\n   倾听实验播客的最新发作，其中性治疗师和大屠杀幸存者博士露丝与我们的员工作家Emma绿色的咨询与如何在生命变化后发现乐趣和目的。\n  科学家拥有一种精美的直接技术，可用于检测其他恒星周围的行星。我们的空间记者滨海湾问：外星人天文学家可以使用它来找到我们吗？ \n每个工作日晚上，我们的编辑指导您通过当天最大的故事，帮助您发现新的想法，并让您惊喜。 订阅将此交付给您的收件箱。 ", "note_en": "Every weekday evening, our editors guide you through the biggest stories of the day, help you discover new ideas, and surprise you with moments of delight.   Subscribe to get this delivered to your inbox.\n  The world works in strange ways, and interesting design choices can often be found in the everyday objects we overlook. Here are two to think about just in time for summer.\n Ketchup bottles. If you’re old enough to remember glass Heinz ketchup bottles, you might also recall how frustrating they were to use. You’d strike the bottom until, eventually, a huge blob would splurt out, ruining your plate.\n Heinz’s current bottle is squeezable and it relocates the dispenser to the bottom, but its valve is so tight that a heap of ketchup still comes out with each squeeze.\n I compared the Heinz squeezable bottle with the cylindrical, fine-tipped sort that adorn many a diner and picnic table. I could get that generic bottle to output 30 times less condiment per squeeze, and in a fine line instead of a wide dollop. Today’s bottle might be good for a fry-dipping excursion, but it releases too much ketchup to dress a burger or hot dog.\n The earlier, cheaper packaging technology seems superior. So why would Heinz deploy a worse—or at least less flexible—design?\n Daniel Johnson, the chair of packaging science at Rochester Institute of Technology, assured me that big companies such as Kraft Heinz put lots of R&amp;D behind their packaging. The ketchup bottle would have been subject to focus-group studies of usage preferences, bottle-holding habits, and more. A Heinz spokesperson told me, “We’ve found that our consumers prefer a dollop to top a burger or for dipping.”\n That would explain why the bottle works the way it does, but it can’t stop me from lamenting such a one-note use of our nation’s favorite condiment. Invest in a cheap, picnic-type bottle and dispense from the brand-name bottle into it for a more versatile squeeze.\n Seedless watermelon. Stephanie Barlow, a senior director at the National Watermelon Promotion Board, told me that more than 90 percent of watermelons consumed in the United States today are seedless. The change happened slowly and then quickly: The first seedless hybrid melons appeared in the mid-20th century, but industrial farmers didn’t figure out how to pollinate them effectively at scale until the mid-2000s.\n That’s changed how watermelon gets eaten. Seeded melons were best consumed as wedges, with the seeds removed by hand, napkin, or—the traditional method—expectoration. But sans seeds, the watermelon came to enjoy more diverse uses: in fruit salads, in leafy salads, and even on pizza.\n The latter recipe is one that the watermelon board suggests in a promotional campaign tied to the release of Disney Pixar’s new animated film  Luca, which is set in  anguria-loving, mid-century Italy. Watermelon appears fleetingly in the film, when two girls on a balcony can be seen eating it in wide wedges—complete with seeds. A promotional image created by Pixar, not the watermelon board, even shows the film’s sea monsters enjoying big smiles of black-seeded fruit.\n Barlow told me that the watermelon board has stressed using only seedless-watermelon imagery in its communications. “But the visual of the seeded watermelon slice prevails,” she admitted.\n That’s probably because of the fruit’s symbolic relationship with summertime nostalgia. Luca’s Italian Riviera memories are of a piece with my own from American summer camps. When it comes to watermelons, we eat the fruit, but we also consume the image.\n Do any ordinary things make you wonder, Why is it like that?  Send them to  hello@theatlantic.com.\n   (1) One person is dead  and dozens are unaccounted for, after a building collapsed near Miami, police say. (2) Calls to “Free Britney”  continue, following the pop star’s brutal plea in court yesterday. (3) “ Infrastructure Week” may finally be over: President Joe Biden has  announced a bipartisan compromise.\n One question, answered: What do I do if I’m traveling and my seatmate won’t wear a mask? Our deputy managing editor Rachel Gutman has some advice:\n If you’re fully vaccinated and not  immunosuppressed or immunocompromised, you shouldn’t be in any significant danger from a seatmate with their nose out. On any long trip, your fellow passengers are going to need to eat and drink, and you should be prepared for that eventuality before buying a ticket.\n  If you’re particularly worried about mask compliance, you might want to opt for travel by train or plane, where conductors and flight attendants are more likely to be patrolling the rows. But that doesn’t eliminate the possibility of a free-for-all at the station or airport before you board.\n Find more safety rules for vaccinated summer travels in Rachel’s new article. And if you want tips for a fun vacation, not just a safe one, our happiness columnist, Arthur C. Brooks,  has you covered.\n   Listen to the newest episode of  The Experiment podcast, in which the sex therapist and Holocaust survivor Dr. Ruth shares advice with our staff writer Emma Green on  how to find pleasure and purpose after life-changing loss.\n  Scientists have a beautifully straightforward technique for detecting planets around other stars. Our space reporter Marina Koren asks:  Could alien astronomers use it to find us?\n  Every weekday evening, our editors guide you through the biggest stories of the day, help you discover new ideas, and surprise you with moments of delight.   Subscribe to get this delivered to your inbox.", "posttime": "2021-06-25 10:31:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "番茄酱,bottles,西瓜", "title": "为什么番茄酱瓶很难使用？ ", "title_en": "Why Are Ketchup Bottles So Hard to Use?", "transed": 1, "url": "https://www.theatlantic.com/newsletters/archive/2021/06/why-are-ketchup-bottles-so-hard-to-use/619292/", "via": "", "real_tags": ["番茄酱", "bottles", "西瓜"]}, {"category": "", "categoryclass": "", "imagename": "628cb0b19334d3a66918aad422b4de8d.jpg", "infoid": 1068161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的Windows 11消息全部是关于微软看到未来几年的计算的地方，但它与十年前的85亿美元的收购自25亿美元以来，Skype在Skype蓬勃发展的故事中。五年前，Skype是互联网呼叫和视频中的大名称，Microsoft为Windows 10制作了一个包含在安装中的“收件箱应用程序”，默认情况下在启动时启动。\n 现在，经过大流行的一年，在使用他们的PC的大流行年度比以往任何时候都有更多的人，Skype无处可见在Windows 11演示文稿或材料中。相反，Microsoft团队在新中心对齐任务栏中获得了一个突出显示的位置，并将深度集成到Windows中。\n   “Skype不再是运行Windows 11的新设备的收件箱应用程序。”\n Microsoft到处都是Skype的未来愿景变成了现实 - 但现实情况使竞争对手缩放和关注家庭名称。回到6月份，当微软制作个人账户的团队时，公司仍然支付给Skype的唇部服务，说：“对于只想要一个非常目的地的应用程序的人，Skype是一个很好的解决方案，我们支持它并鼓励它。“\n  但现在，如果你想使用Skype，你将不得不在Microsoft商店里找到它，就像任何其他应用程序一样。一家公司发言人讲述了边缘：“Skype不再是运行Windows 11的新设备的收件箱应用程序。Skype应用程序可免费下载Microsoft Store。”\n   当您考虑其中的其他应用程序11将包括开箱即用时，您可以看到过去一年的Skype如何倒下;即使是Windows终端也将是一个包装。 Skype加入OneNote，Paint 3D和3D查看器作为操作系统不再附带的应用程序。\n 甚至添加一键单击“同时满足”功能无法帮助Skype在大流行早期竞争。突然推动遥远的遥远的人常规用户选择强大的企业级聊天应用程序，巨头像微软一样，谷歌打开他们的门鼓励趋势。现在，就像谷歌一样，Microsoft有一个复杂的一系列会议工具来解决，而Windows 11的发射推出表明它会迅速削减脂肪而不是稍后。 ", "note_en": "Today’s  Windows 11 news is all about where Microsoft sees computing going over the next few years, but it’s just as much the story of how Skype has flourished and ebbed since  its $8.5 billion acquisition a decade ago. Five years ago, Skype was the big name in internet calling and video, and Microsoft made it an “inbox app” for Windows 10 that was included at installation and launched at startup by default.\n Now, after a pandemic year that has had more people using their PCs for voice and video than ever before, Skype was nowhere to be seen in the Windows 11 presentation or materials. Instead,  Microsoft Teams gets a highlight spot in the new center-aligned taskbar and deep integration into Windows.\n   “Skype is no longer an inbox app for new devices that run Windows 11.”\n The future vision that Microsoft had for  Skype everywhere has turned into a reality — but that reality made competitors Zoom and FaceTime into household names instead. Back in June, when Microsoft  made Teams available for personal accounts, the company still paid lip service to Skype, saying, “For folks that just want a very purpose-built app, Skype is a great solution, and we support it and encourage it.”\n  But now, if you want to use Skype, you’re going to have to go find it in the Microsoft Store like any other app. A company spokesperson tells  The Verge: “Skype is no longer an inbox app for new devices that run Windows 11. The Skype app is available to download through the Microsoft Store for free.”\n   You can see just how precipitously Skype has fallen over the last year when you consider which other apps Windows 11 will include out of the box; even Windows Terminal will be a pack-in. Skype joins OneNote, Paint 3D, and 3D Viewer as the apps that will no longer come with the OS.\n Even adding one-click “Meet Now” features  couldn’t help Skype compete early in the pandemic. The sudden push to go remote saw regular users choose powerful enterprise-grade chat apps, with giants like Microsoft and Google opening their doors to encourage the trend. Now,  just like Google, Microsoft has a complicated array of conferencing tools to sort out, and Windows 11’s launch suggests it’ll cut the fat sooner rather than later.", "posttime": "2021-06-25 09:49:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,程序,默认,skype", "title": "Windows 11将Skype作为默认应用程序删除 ", "title_en": "Windows 11 Drops Skype As a Default App", "transed": 1, "url": "https://www.theverge.com/2021/6/24/22549191/skype-windows-11-microsoft-teams", "via": "", "real_tags": ["windows", "程序", "默认", "skype"]}, {"category": "", "categoryclass": "", "imagename": "d20026c26cb585f8ea4fb40841e94a22.jpeg", "infoid": 1068160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一个wd mybook直播，连接到我的家兰，多年来锻炼身体。 我刚刚发现，在某种程度上，今天的所有数据都消失了，而目录似乎在那里但是空的。 以前，2T卷几乎是满满的，但现在它显示了全部容量。 即使是奇怪的事情就是当我尝试登录控制UI进行诊断时，我只能通过用于“所有者密码”的输入框进入此登录页面。 我已经尝试了默认的密码“admin”，也可以为其设置有什么机智... ", "note_en": "I have a WD mybook live connected to my home LAN and worked fine for years. I have just found that somehow all the data on it is gone today, while the directories seems there but empty. Previously the 2T volume was almost full but now it shows full capacity.  The even strange thing is when I try to log into the control UI for diagnosis I was-only able to get to this landing page with an input box for “owner password”. I have tried the default password “admin” and also what I could set for it wit...", "posttime": "2021-06-25 09:48:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,wd,登录", "title": "帮助WD MyBook中的所有数据Live Gay和所有者密码未知 ", "title_en": "Help All data in WD mybook live gone and owner password unknown", "transed": 1, "url": "https://community.wd.com/t/help-all-data-in-mybook-live-gone-and-owner-password-unknown/268111", "via": "", "real_tags": ["密码", "wd", "登录"]}]