[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1069985, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我直线穿越了整个国家。 “为什么？”，你可能会问……为什么不呢？受到 Tom Davies（又名 GeoWizard）的启发，我决定继续这个无害的冒险和挑战……摩纳哥！不像汤姆在挪威或威尔士的任务那么令人兴奋，但足够好。在开始这次旅行之前，必须做一些计划。由于摩纳哥是一个小国，我们不得不跨越一小段距离。尽管如此，这里多山，到处都是建筑物，这使得直线部分的挑战变得复杂。用来应对这一挑战的策略是在谷歌地图上放置两个针脚，一个用来开始和停止，然后移动它们直到我们收敛到一个合适的路径。有了这条预先计划好的路线后，是时候画实际的线（下面的绿色），然后尽量靠近它。由于地形和建筑带来的困难，计划是利用“人造设施”穿越全国——将其中的几个组合成一条直线，是必要的选定的路线。自从我乘火车到达以来，这与我这次挑战的起点相吻合。第一步是爬上自动扶梯，往法国方向走，这意味着开始到停车场——它已经在法国境内了，不需要我离开并绕过火车站。然后，你只要朝着大海的方向走，乘电梯，以免毁了你宝贵的直线。之后，你有一些楼梯。随后，在圣德沃特教堂 (Chapelle Sainte-Dévote) 进行迷人的“略微弯曲”步行。然后，您在人行横道附近以非法方式过马路。最后，有一个地下通道让您尽可能靠近线路，而无需进行一些跑酷，它会将您带到码头附近的 F1 赛道的一部分 - 毕竟，这是摩纳哥！这条路径在上面的地图上以蓝色绘制。您可以使用标尺进行一些测量；我曾经测量过我与线路的最大距离 - 20 米，🏆 白金级别。", "note_en": "Recently, I’ve crossed an entire country in a straight line. “Why?”, you might ask… why not? Inspired by  Tom Davies (aka  GeoWizard), I decided to go on this harmless adventure &amp; challenge across… Monaco! Not as exciting as Tom’s missions across Norway or Wales, but good enough as a josh.\n Before embarking on this trip, some planning had to be done. Since Monaco is a small country, we had to cross a small distance. Nevertheless, it’s very mountainous and full of buildings everywhere, which makes the straigh line part of the challenge complex. The strategy used to approach this challenge was to go on Google Maps and drop two pins one for start and stop and moving them around until we converged to an adequate path. After having this pre-planned route it was time to draw the  actual line (in green below) and then try to stick as closer as possible to it.\n  Due to the difficulties presented by the terrain and the constructions, the plan was to make use of the “man-made facilities” to go accross the country - a combination of several of these, aligned in a straight line, was necessary to viabilize the selected route.\n Since I arrived by train, that matched my start point for this challenge. The first step was to go up the escalators and go in direction of France, which meant starting to the parking lot - it is already within France and did not require me to leave and go around the train station. Then, you just go in the direction of the sea and take the elevator, in order not to ruin your precious straight line. Afterwards, you have some stairs. Later, a charming “slightly curved” walk around Chapelle Sainte-Dévote. Then, you cross the road in an illegal manner right near the crosswalk. And finally, there is an underpass that keeps you as close as possible to the line, without the need to do some  parkour, which leads you to part of the F1 race track right near the marina - after all, it’s Monaco!\n This path is drawn in blue on the map above. You can use the ruler to make some measurements; I’ve used to measure my maximum distance from the line - which was 20 meters, a 🏆  Platinum rank.", "posttime": "2021-07-27 17:31:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "直线,entire,挑战", "title": "直线穿越整个国家", "title_en": "Crossing an entire country in a straight line", "transed": 1, "url": "https://magamig.github.io/posts/crossing-an-entire-country-in-a-straight-line/", "via": "", "real_tags": ["直线", "entire", "挑战"]}, {"category": "", "categoryclass": "", "imagename": "ae29189edd73cf2ab6a35ee6189ad163.png", "infoid": 1069984, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1968 年 2 月 20 日是电视史上的一个红字日，作为处方：谋杀案首次播出的那一天，将我们最熟悉和喜爱的科伦坡中尉带到了数百万人的集体意识中。但许多普通粉丝没有意识到，这个角色 Columbo 是由威廉·林克和理查德·莱文森在近十年前创作的，早在彼得·福尔克扮演米色雨衣和常燃雪茄之前，他就已经登上舞台和银幕。 .当现在臭名昭著的 1960 年作家协会罢工发生时，莱文森和林克（如图）是好莱坞舞台上的年轻编剧。从 1 月到 6 月，罢工将持续五个月，这让充满活力的二人组不知如何补充收入。幸运的是，他们发现了一个漏洞，可以让他们发挥创造力。尽管采取了罢工行动，但公会成员仍然可以为电视直播写作。因此，针对新推出的雪佛兰神秘秀及其每周一小时的现场直播，两人开始编写名为“足够的绳索”的谋杀之谜的剧本——这是第一个以科伦坡中尉为主角的官方剧本。 “哥伦布的角色完全基于波菲里·彼得罗维奇（Porfiry Petrovich），他是陀思妥耶夫斯基的《罪与罚》中机敏但迂回曲折的首席调查员。”他们将这个角色完全基于波菲里·彼得罗维奇（Porfiry Petrovich），他是陀思妥耶夫斯基（Dostoevsky）的《罪与罚》（Criminal &amp; Punishment）的首席调查员——两人都在大学学习过。他们如何确定 Columbo 这个名字是一个谜，连 Link（1987 年 Levinson 去世后合伙企业的幸存成员）都无法解开。这是对洛基·马西亚诺传奇教练艾莉·科伦坡的致敬吗？或者是改编自费城夜总会 Palumbo&#39;s 两人曾经经常光顾的地方？林克只是想不起来，在电视最好的创作之一的形成过程中，给了我们一个令人愉快的小秘密。\n在 2002 年的一次采访中，Link 在下面有趣地谈论了 Columbo 的创建。如果可以的话，看一看，然后我们将继续推进 Enough Rope 本身……第一个描绘 Columbo 的荣誉归于 Bert Freed，他接过了地幔在前面提到的直播谋杀之谜 Enough Rope 中，该剧于 1960 年 7 月 31 日作为雪佛兰神秘秀剧集的一部分播出。仅仅运行了一个小时，《足够的绳索》就很容易被今天的科伦坡观众认出是处方：谋杀的萌芽版本。主要主角是心理学家罗伊弗莱明博士，他通过勒死他不爱的妻子并通过让他的年轻情人打扮成弗莱明夫人并从停放的飞机上摔下来来建立不在场证明 - 就像处方：谋杀一样。今天的哥伦布迷们会为其他几个场景敲响警钟，包括当罗伊独自度假回家时，中尉在弗莱明斯的公寓里；一个年轻暴发户的虚假谋杀供词；科伦坡对弗莱明夫人丢失的裙子和手套的顽固追求；以及他对 Fleming 博士返回时携带的较轻行李的好奇心。 “只要运行一个小时，今天的哥伦布粉丝就可以轻松地将 Enough Rope 识别为 Prescription: Murder 的萌芽版本。”但是，存在关键差异。科伦坡从来不会对弗莱明博士的年轻恋人（这里叫苏珊·哈德森，而不是琼）感到厌烦；弗莱明夫人并没有坚持昏迷的生活；两位领导不会分享关于波旁威士忌的假设性聊天；结局与 1968 年郊游中巧妙的“死女友”引诱和转换哥伦布戏剧大不相同。相反，弗莱明更轻的行李被证明是他的失败。科伦坡假装他在弗莱明斯家中发现了据称在谋杀后被盗的物品，他在罗伊在加拿大度假的湖边疏浚。弗莱明博士并没有上当，这迫使哥伦布承认这一切都是他的东西。苏珊走进来问：“你在哪里找到的？”炸掉雷的掩护。\n据报道，这一集以哥伦布说的话结束，大意是：“我们还没有找到真正的东西，但我们现在肯定会！”随着学分滚动，这对我来说听起来有点反高潮。罗伊·弗莱明（理查德·卡尔森饰）自始至终都是关注的焦点，他将哥伦布降级为次要角色。至于弗里德的刻画，我只能从其他来源报道说，哥伦布球迷熟悉的许多特征都在那里（健忘，越来越坚持的质疑，困扰他的小事），但弗里德和福尔克在他们如何表达这些台词，以及他们的身材（Freed，如图，身材高大，身体上令人生畏）。然而，我从未见过 Enough Rope，也从未见过它可以买到。如果您有并且可以发表更明智的评论，那么请成为我的客人！两年后，莱文森和林克为舞台制作了故事的加长版。这一次实际上名为“处方：谋杀”，该剧由温文尔雅的约瑟夫·科顿饰演罗伊·弗莱明和资深演员托马斯·米切尔（当时 70 岁）饰演哥伦布。这个角色已经演变成更像我们在 Falk 1968 年首次亮相时遇到的那个版本。更寒酸，更恭顺，更糊涂。事实上，最初的剧本将哥伦布描述为：“一个年龄不详的皱巴巴的警探。他似乎笨手笨脚，含糊其辞，带着一种过度道歉，几乎是恭顺的态度。然而，这掩盖了与生俱来的精明，对人性的狡猾知识。”多么令人放心的熟悉！舞台版与 1968 年的银幕版非常相似，另一个显着的区别是结局。也许意识到 Enough Rope 中与行李相关的结局有点乏味，这里的结局被加强以增强其情感影响。科伦坡确实上演了一个假的自杀场景来吸引弗莱明博士，但这一次苏珊（仍然不是琼）并没有躲在角落里听罗伊抒情他从来没有真正关心过她。相反，罗伊真的爱上了苏珊，并且对她所谓的死亡感到如此哽咽，以至于他坚持要当场承认谋杀。\n这种对凶手的遗憾和部分救赎的强调表明人们相信这部作品的主要明星很大程度上是科顿的弗莱明博士。米切尔是第一个赢得奥斯卡、艾美奖和托尼奖传奇三连冠的人，曾出演过传奇电影《乱世佳人》、《驿马车》、《正午》和《美好的生活》，就像他之前的弗里德一样，扮演第二个给弗莱明小提琴。然而，如果传言属实，观众对哥伦布这个角色的反应如此之好，以至于很明显这位蓬头垢面的侦探本身就拥有明星力量。该剧于 1962 年 1 月初至 5 月下旬在美国和加拿大巡回演出，但从未在百老汇上演。可悲的是，这标志着托马斯·米切尔 (Thomas Mitchell) 在同年 12 月因癌症去世，这是他最后的表演角色。当然，这并不是哥伦布中尉的终结。 1967 年，当莱文森和林克（以及中尉）听说环球正在寻找好的神秘剧本时，这成为第三次幸运的案例。科伦坡——一个对故事来说比最初预期更重要的角色？据说当时 50 多岁的 Lee J. Cobb 是首选，但他的日程安排得太满了，不允许这样做。 Bing Crosby 曾被邀请担任这个角色，但他拒绝了，因为他太享受退休生活（以及高尔夫球场的诱惑）。相反，尽管对他“太年轻”有所保留，莱文森和林克还是转向了刚满 40 岁的彼得福尔克。拍摄于 1967 年末结束。其余的，正如他们所说，已经成为历史。如果 1967 年由福尔克以外的其他人担任这个角色，我们是否敢推测会发生什么？总是说不清楚。 Lee J. Cobb 本来可以非常出色（他在 The Exorcist 中的中尉 Kinderman 完全是哥伦布式的），尽管我无法想象 Bing 在一百万年后扮演这个角色。不，可以肯定地说，福尔克在 Columbo 的角色中是如此出色、如此完美，以至于他和他一人本可以将这个角色——以及这个节目——变成最优秀、最持久、最受尊敬和最受喜爱的角色之一。整天。事实上，这证明了 Falk 以及 Levinson 和 Link 的创造力，Columbo 在未来 50 年可能会像今天一样受到高度重视。\n你第一次见到哥伦布中尉的记忆是什么？在下面的评论部分分享您的想法。", "note_en": "February 20 1968 is a red-letter day in the annals of TV history as the day  Prescription: Murder first aired, bringing Lieutenant Columbo, as we  mostly know and love him, to the collective consciousness of millions.\n But what many casual fans don’t realise is that Columbo, the character, was created by William Link and Richard Levinson  nearly a decade earlier and had already graced both the stage and screen long before Peter Falk assumed the beige raincoat and ever-lit cigar.\n  Levinson and Link (pictured) were fresh young screen writers on the Hollywood scene when the now infamous Writers Guild strike of 1960 took place. The strike would go on for five months from January to June, leaving the dynamic duo at a loss at how to supplement their incomes.\n Fortunately for the world they uncovered a loophole that allowed them to flex their creative muscles. Despite the strike action, it was still permissable for Guild members to write for  live television. And so targeting the newly launched  Chevy Mystery Show and its weekly one-hour live broadcasts, the two got to work on the script for a murder mystery entitled  Enough Rope – the first official script featuring one Lieutenant Columbo.\n “The Columbo character was based squarely on Porfiry Petrovich, the astute but meandering lead investigator in Dostoevsky’s  Crime &amp; Punishment.”\n They based the character squarely on  Porfiry Petrovich, the astute but meandering lead investigator in Dostoevsky’s  Crime &amp; Punishment – a book both had studied at college. How they settled on the name Columbo is a mystery even Link (the surviving member of the partnership following Levinson’s death in 1987) cannot solve.\n Was it a tribute to Rocky Marciano’s legendary trainer  Allie Colombo? Or an adaption of Philadelphia nightclub  Palumbo’s that both men used to frequent? Link just can’t recall, giving us a pleasant little mystery at the heart of the formation of one of TV’s finest creations.\n Link talks entertainingly about the creation of Columbo below in an interview from 2002. Have a watch if you can, and then we’ll push on to  Enough Rope itself…\n   The honour of first portraying Columbo went to  Bert Freed, who took up the mantle in the aforementioned live-to-air murder mystery  Enough Rope, which aired on 31 July 1960 as part of the  Chevy Mystery Show drama anthology.\n  Running for just an hour,  Enough Rope would nevertheless be easily recognised by the  Columbo viewer of today as an embryonic version of  Prescription: Murder. The chief protagonist was psychologist  Dr Roy Fleming, who murders his unloved wife by strangulation and establishes an alibi by having his young lover dress up as Mrs Fleming and flounce off a parked plane – just like in  Prescription: Murder.\n Several other scenes would ring bells with by today’s  Columbo afficionados, including the Lieutenant being in the Flemings’ apartment when Roy returns home from his solo vacation; the false murder confession by a young upstart; Columbo’s dogged pursuit of Mrs Fleming’s missing dress and gloves; and his curiosity about Dr Fleming’s lighter luggage on his return.\n “Running for just an hour,  Enough Rope would be easily recognised by today’s Columbo fans  as an embryonic version of  Prescription: Murder.”\n There are key differences, though. Columbo never gets heavy with Dr Fleming’s young love interest (here named Susan Hudson, not Joan); Mrs Fleming doesn’t cling on to life in a coma; the two leads don’t share a hypothetical chat over bourbons; and the ending is very different to the ingenious ‘dead girlfriend’ bait-and-switch Columbo plays in the 1968 outing.\n Instead Fleming’s  lighter luggage proves to be his undoing. Columbo pretends he’s uncovered the items from the Flemings’ home said to have been stolen after the murder by dredging the lake where Roy has been vacationing in Canada. Dr Fleming doesn’t fall for it, forcing Columbo to admit it’s all his stuff. The Susan walks in and says ‘Where did you find it?’ to blow Ray’s cover.\n Reportedly the episode ends with Columbo saying words to the effect of: “We ain’t found the real stuff yet, but we’re sure gonna now!” as credits roll, which sounds moderately anti-climactic to me.\n Roy Fleming (played by Richard Carlson) was very much the centre of attention throughout, relegating Columbo to a largely secondary role. As for Freed’s portrayal, I can only report from other sources that say many of the characteristics familiar to  Columbo fans were there (the forgetfulness, the increasingly insistent questioning, the little things that bother him), but that Freed and Falk were poles apart in how they delivered the lines, as well as their physical stature (Freed, pictured, being a large, physically intimidating sort).\n However, I’ve never seen  Enough Rope, nor have ever seen it available to buy. If you have and can make more informed comment then please be my guest!\n Two years later and a lengthened version of the story was produced by Levinson and Link for the stage. This time actually entitled  Prescription: Murder, the play starred the suave Joseph Cotten as Roy Fleming and veteran actor  Thomas Mitchell – then aged 70 – as Columbo.\n The character had evolved to become more like the version we meet in Falk’s 1968 debut. Shabbier, obsequious, more confused. Indeed, the original script described Columbo as being: “ A rumpled police detective of indeterminate age. He seems to be bumbling and vague, with an overly apologetic, almost deferential manner. This masks an innate shrewdness, however, a foxy knowledge of human nature.” How reassuringly familiar!\n  The stage version plays out very similarly to the 1968 screen version, a notable difference again being the ending. Perhaps realising that the luggage-related denouement in  Enough Rope was a bit of a dud, the ending here was beefed up to enhance its emotional impact.\n Columbo  does stage a fake suicide scene to draw Dr Fleming out, but this time Susan (still not Joan) isn’t hiding in a corner to hear Roy wax lyrical about how he never really cared for her. Instead  Roy really was in love with Susan and is so choked up about her supposed death that he insists on confessing to the murder there and then.\n This emphasis on the killer’s regret and partial redemption is indicative of the belief that the main star of the production was very much Cotten’s Dr Fleming. Mitchell, the first man to win the legendary trifecta of Oscar, Emmy and Tony Awards, and who had graced legendary motion pictures  Gone With the Wind,  Stagecoach,  High Noon and  It’s a Wonderful Life, was, like Freed before him, to play second fiddle to Fleming. Yet if the rumours are true, audiences responded so favourably to the Columbo character that it became clear that the disheveled detective had star power in his own right.\n  The play toured the US and Canada from early January to late May of 1962, but never made it to Broadway. Sadly it marked Thomas Mitchell’s final acting role, as he died from cancer that December.\n It wasn’t, of course, the end of Lieutenant Columbo. It became a case of third time lucky for Levinson and Link (and the Lieutenant) when they heard Universal were on the lookout for good mystery scripts in 1967. The  Prescription: Murder teleplay was duly picked up by the studio, but who to cast as Columbo – a character more pivotal to the story than originally intended?\n Lee J. Cobb, then in his 50s, is said to have been the first choice, but his schedule was too full to allow it.  Bing Crosby was famously offered the role but turned it down as he was enjoying retirement (and the lure of the golf links) too much. Instead, and despite reservations about him being ‘too young’, Levinson and Link turned to Peter Falk, who had just turned 40. Filming wrapped up in late 1967. The rest, as they say, is history.\n Dare we speculate on what might have happened if someone other than Falk had got the role in 1967? It’s always impossible to tell. Lee J. Cobb could actually have been superb (his Lieutenant Kinderman in  The Exorcist was entirely Columbo-esque), although I can’t imagine Bing  in the role in a million years.\n No, it’s safe to say that Falk was so wonderful,  so perfect in the role of Columbo, that he and he alone could have turned the character – and the show – into one of the best, most enduring, most respected and most loved of all time.\n Indeed it’s a testament to Falk, and the creative powers of Levinson and Link, that  Columbo is likely to be as highly regarded in another 50 years as it is today.\n   What are your memories of your first encounter with Lieutenant Columbo? Share your thoughts in the comments section below.", "posttime": "2021-07-27 17:30:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "哥伦布,origin", "title": "哥伦布：起源故事 - 哥伦布爱好者", "title_en": "Columbo: An Origin Story – The Columbophile", "transed": 1, "url": "https://columbophile.com/2018/02/17/columbo-an-origin-story/", "via": "", "real_tags": ["哥伦布", "origin"]}, {"category": "", "categoryclass": "", "imagename": "9dc48d28e29f9bed543ef4792a648710.jpg", "infoid": 1069983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "企业家 edwin bos 和 martijn lukaart 建造了一个移动的海滩清洁机器人，可以发现烟蒂，将其拔出并放入安全的垃圾箱中。被称为 BeachBot - 简称 BB - 机器人使用人工智能来寻找烟蒂并学习捡起它们的最佳方式。基于 AI 的检测算法是由 TechTics（一家由 bos 和 lukaart 在海牙创立的咨询公司）和代尔夫特理工大学的学生创建的，他们使用了微软的 trove，这是一款将 AI 开发人员与世界各地的拍照者联系起来的应用程序机器人有数百万张香烟图片，可以识别它们。 “这是我们概念中最有趣的部分——我们有一个人机交互，公众可以帮助让机器人变得更聪明，”博斯说。为了检测 BeachBot 必须捡起的垃圾，一定程度的智能必须成为解决方案的一部分。使用机器学习，机器人可以决定要捡起什么，防止机器人通过移除其他物体（例如贝壳）来造成损坏。除了选择性之外，机器学习还具有更大的灵活性。因为机器人还可以学习新的垃圾来适应未来。空间和功率的限制使得机器人变得更智能。为了解决这个问题，机器人使用专门的硬件运行高效的实现。此外，该实施将允许未来的迭代以支持云计算。机器人的抓手必须能够在 3D 空间中移动。这部分得益于笛卡尔运动系统，其中两个固定在框架上的电机允许在两个方向（上/下和右/左）上移动。这种系统有几个优点：它非常稳定，因此与机器人手臂等相比，它可以设计出轻型框架、轻型电机、低能耗和易于控制。步进电机用于驱动由皮带和在轴上滑动的线性轴承组成的系统。这些电机可以促进保持扭矩，从而将夹具牢牢固定在位。一个重要的设计挑战是保护这些线性移动元件免受沙尘和腐蚀：这是通过折叠波纹管和润滑来实现的。在第一次演示中，BeachBot 在 30 分钟内吸起了 20 个烟头。为此，这个 80 厘米宽的机器人使用两个机载摄像头向前和向下看。一旦它发现过滤器，它就会降低两个夹臂，将沙子推到一起并抓住过滤器，然后将其拉入内部垃圾箱。然后需要由人类清空。 &#39;我们从烟头开始。那是世界上乱扔垃圾最多的物品，”博斯总结道。 “在未来，我们希望机器人能够检测到一系列其他垃圾。”设计邦的评论政策指南一般来说，如果我们发表一些东西，那是因为我们真的对这个主题感兴趣。我们希望您能分享这种兴趣，如果您对此有更多了解，请分享！我们在讨论线程中的目标是进行良好的对话，我们更喜欢建设性的意见。我们和我们的读者玩得开心。设计邦欢迎有关打字错误、错误名称等的警告。更正由帖子编辑自行决定，可能不会立即发生。如果您不同意我们或其他评论者的意见怎么办？让我们听听吧！但请理解，冒犯性的、不适当的或只是简单烦人的评论可能会被删除或缩短。 - 请不要发表种族主义、性别歧视、反犹太主义、恐同或其他攻击性评论。 - 请不要个人侮辱作者或您的评论者。 - 请避免使用冒犯性的词，用星号替换几个字母不是有效的解决方法。 - 请不要在评论中包含您的网站或电子邮件地址以用于自我宣传。 - 请尊重陪审团的裁决，不要对比赛结果进行攻击性的讨论（只有一个拳头奖，设计邦通常会请知名专业人士帮助我们提升人才。除了获奖的设计，我们确实觉得几乎所有的设计都值得我们注意，这就是为什么我们也发布最好的 100-200 个条目的原因。）在评论中允许链接，只要它们以信息、图像、幽默等形式增加价值（链接到您个人博客的首页或网站不正常）。不受欢迎的链接（指向他人的商业产品或服务、攻击性材料等）将被编辑。而且，...是的，垃圾邮件被禁止了。不，我们不会发布虚假评论。\n一个多样化的数字数据库，作为直接从制造商处获取有关产品的洞察力和信息的宝贵指南，并作为开发项目或方案的丰富参考点。 BeachBot 是一种移动的海滩清洁机器人，可以发现烟蒂，将其拔出并放入安全的垃圾箱中。与 BMW 艺术车和艺术作品对话时，数字化滚动雕塑几乎可以在任何地方上演，从山顶到您的花园或客厅。 950bhp 阿斯顿马丁瓦尔哈拉混合动力超级跑车是否暗示了英国品牌的电动汽车未来？", "note_en": "entrepreneurs edwin bos and martijn lukaart have built a mobile, beach-cleaning  robot that can spot cigarette butts, pluck them out and dispose of them in safe bins. dubbed  BeachBot — BB for short — the robot uses   artificial intelligence to find the cigarette butts and to learn the best way to pick them up. the AI-based detection algorithm was created by TechTics (a consultancy based in the hague founded by bos and lukaart) and students from delft university of technology, who used   microsoft’s trove, an app that connects AI developers with photo-takers worldwide to feed the robot with millions of cigarette pictures for it to recognize them.\n  ‘that’s the most interesting part of our concept – we have a human-robot interaction where the public can help make the robots smarter,’  bos said.\n    to detect the trash the  BeachBot must pick up, some level of smart must be part of the solution. using machine learning, the robot can decide what to pick up, preventing the robot from inflicting damage by removing other objects, such as shells. besides selectivity, machine learning also allows for more flexibility. as the robot can also learn new litter to future-proof itself. space and power constraints make it harder to make the robot smart. to solve this, the robot uses specialized hardware running efficient implementations. additionally, the implementation will allow for future iterations to support cloud computation.\n    the gripper of the robot must be able to move in 3D space. this is partly facilitated by a cartesian movement system, where two motors fixed to the frame allow movement in two directions (up/down and right/left). there are several advantages of such a system: it is very stable which as a result allows the design of a lightweight frame, light motors, low energy consumption and easy control compared to, for example, a robot arm. stepper motors are used to drive the system that consist of belts and linear bearings sliding on axles. these motors can facilitate a holding torque, that keep the gripper firmly in position. an important design challenge is the protection of these linear moving elements against sand and corrosion: this is achieved with folding bellows and lubrication.\n    during its first demo,  BeachBot scooped up 20 cigarette butts in 30 minutes. to do so, the 80-centimeter wide robot uses two onboard cameras to look ahead and down. once it spots a filter, it lowers two gripper arms that push the sand together and grab the filter, which is pulled up and into an internal bin. it then needs to be emptied by humans.\n  ‘we start with cigarette butts. that’s the world’s most littered item,’  bos concluded.  ‘in the future, we want the robots to detect a range of other litter.’\n designboom&#39;s comment policy guidelines  generally speaking, if we publish something, it&#39;s because we&#39;re genuinely interested in the subject. we hope you&#39;ll share this interest and if you know even more about it, please share! our goal in the discussion threads is to have good conversation and we prefer constructive opinions. we and our readers have fun with entertaining ones. designboom welcomes alerts about typos, incorrect names, and the like.  the correction is at the discretion of the post editor and may not happen immediately.    what if you disagree with what we or another commenter has to say?  let&#39;s hear it! but please understand that offensive, inappropriate, or just plain annoying comments may be deleted or shortened.    - please do not make racist, sexist, anti-semitic, homophobic or otherwise offensive comments.  - please don&#39;t personally insult the writers or your fellow commenters.  - please avoid using offensive words, replacing a few letters with asterisks is not a valid workaround.  - please don&#39;t include your website or e-mail address in your comments for the purpose of self-promotion.  - please respect jury verdicts and do not discuss offensively on the competition results  (there is only one fist prize, and designboom usually asks renown professionals to help us to promote talent.  in addition to the awarded designs, we do feel that almost all deserve our attention, that is why we publish  the best 100-200 entries too.)    a link is allowed in comments as long as they add value in the form of information, images, humor, etc. (links to the front page of your personal blog or website are not okay). unwelcome links (to commercial products or services of others, offensive material etc. ) will be redacted. and, ... yes, spam gets banned. no, we do not post fake comments.\n   a diverse digital database that acts as a valuable guide in gaining insight and information about a product directly from the manufacturer, and serves as a rich reference point in developing a project or scheme.\n BeachBot is a mobile, beach-cleaning robot that can spot cigarette butts, pluck them out and dispose of them in safe bins.\n in conversation with BMW art cars and acute art, the digitalized rolling sculptures can be staged virtually anywhere, from atop a mountain to your garden or living room.\n does the 950bhp aston martin valhalla hybrid supercar hint at the british marque&#39;s EV future?", "posttime": "2021-07-27 17:30:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,机器人,ai", "title": "BeachBot，一个人工智能机器人，可以在海滩上清理烟头", "title_en": "BeachBot, an AI-powered robot that cleans cigarette butts at the beach", "transed": 1, "url": "https://www.designboom.com/technology/beachbot-robot-cleans-cigarette-butts-beach-07-26-2021/", "via": "", "real_tags": ["人工智能", "机器人", "ai"]}, {"category": "", "categoryclass": "", "imagename": "e73ea3b5169a5a95acf77afc8588d74d.jpg", "infoid": 1069982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在创纪录的时间内开发出冠状病毒疫苗后，这家德国制药公司的目标是明年开始使用相同的突破性 mRNA 技术试验一种疟​​疾疫苗。这家制药公司周一表示，BioNTech 希望通过使用与开发冠状病毒疫苗相同的突破性 mRNA 技术来“帮助根除疟疾”。这家总部位于德国的组织表示，它的目标是在 2022 年底前开始临床疟疾疫苗试验。如果成功，该疫苗可能成为抗击疟疾的重大进展，疟疾每年导致超过 40 万人死亡——主要是非洲的幼儿.这种疾病是由一种寄生虫引起的，这种寄生虫通常会感染某种以人类为食的蚊子。 “我们将尽一切努力开发一种安全有效的基于 mRNA 的疟疾疫苗，以预防这种疾病、降低死亡率并确保为非洲大陆和其他受这种疾病影响的地区提供可持续的解决方案，”BioNTech 首席执行官 Ugur Sahin 表示。一份声明。该项目得到了世界卫生组织、非洲疾病控制和预防中心和欧盟的支持。 BioNTech 与美国合作伙伴辉瑞 (Pfizer) 共同开发了首个获得广泛批准的冠状病毒疫苗，该公司表示，它还希望在非洲建立一个 mRNA 疫苗生产部门。迄今为止，非洲大陆一直在努力获得足够的冠状病毒疫苗剂量。\n欧盟委员会主席乌尔苏拉·冯德莱恩周一表示：“我们正在见证医学科学革命的开始，信使 RNA 的革命。” “消灭疟疾现在是一个现实的目标，现在我们知道它可以在这一代人中实现。”科学家们认为，通过将包含病原体关键部分代码的遗传分子传递到人体细胞中来促进免疫反应的 mRNA 技术可能会改变对抗多种疾病的游戏规则。使用这项技术也是一种比传统方法更快的疫苗开发方式，并且可以结束长达数十年的可靠的疟疾疫苗研发工作。", "note_en": "After developing a coronavirus vaccine in record time, the German pharmaceutical company aims to start trialing a malaria shot next year using the same breakthrough mRNA technology.\n    BioNTech wants &#34;to help eradicate malaria&#34; by using the same breakthrough  mRNA technology it used to develop its coronavirus vaccine, the pharmaceutical company said on Monday.\n  The Germany-based group said it aimed to begin clinical malaria vaccine trials by the end of 2022.\n    If successful, the shot could be a major development in the fight against  malaria, which kills  more than 400,000 people a year — mainly young children in Africa. The disease is caused by a parasite that commonly infects a certain type of mosquito which feeds on humans.\n  &#34;We will do whatever it takes to develop a safe and effective mRNA-based malaria vaccine that will prevent the disease, reduce mortality and ensure a sustainable solution for the African continent and other regions affected by this disease,&#34; BioNTech CEO Ugur Sahin said in a statement.\n    The project is backed by the World Health Organization, the Africa Centers for Disease Control and Prevention and the European Union.\n  BioNTech, which developed the first widely approved coronavirus shot together with  US partner Pfizer, said it is also hoping to establish an mRNA vaccine production unit in Africa. The continent has so far struggled to get sufficient supply of coronavirus vaccine doses.\n      &#34;We are witnessing the start of a revolution in medical science, the revolution of messenger RNA,&#34; European Commission President Ursula von der Leyen said Monday.\n  &#34;Eradicating malaria is now a realistic goal and now we know that it can be achieved already in this generation.&#34;\n  Scientists believe mRNA technology, which prompts an immune response by delivering genetic molecules containing the code for key parts of a pathogen into human cells, could be a game-changer against several diseases.\n  Using this technology is also a faster way of developing a vaccine than traditional methods and could bring an end to the decades-long search for a reliable malaria shot.", "posttime": "2021-07-27 17:30:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,疟疾,developing,疫苗", "title": "BioNTech 正在开发一种疟疾疫苗", "title_en": "BioNTech is developing a malaria vaccine", "transed": 1, "url": "https://www.dw.com/en/biontech-wants-to-eradicate-malaria-with-mrna-vaccine/a-58649642", "via": "", "real_tags": ["开发", "疟疾", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "8b36b8454623c6251311a73205da235e.jpeg", "infoid": 1069981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "隐私工具销售商 Windscribe 表示，它未能加密最近被乌克兰当局没收的公司 VPN 服务器，这一失误使当局有可能冒充 Windscribe 服务器并捕获和解密通过它们的流量。这家总部位于加拿大安大略省的公司本月早些时候表示，作为对一年前发生的活动进行调查的一部分，在乌克兰托管的两台服务器被查封。运行 OpenVPN 虚拟专用网络软件的服务器还被配置为使用在 2018 年被弃用的设置，因为安全研究揭示了可能允许攻击者解密数据的漏洞。 “在这两台服务器的磁盘上有一个 OpenVPN 服务器证书及其私钥，”一位 Windscribe 代表在 7 月 8 日的帖子中写道。 “虽然我们在高敏感地区有加密服务器，但这些服务器运行的是遗留堆栈并且没有加密。我们目前正在制定解决这个问题的计划。” Windscribe 的承认强调了近年来 VPN 服务爆炸式增长所带来的风险，其中许多来自以前很少有人听说过的企业。人们使用 VPN 将所有互联网流量汇集到一个加密隧道中，以防止连接到同一网络的人能够读取或篡改数据，或者检测通信双方的 IP 地址。 VPN 服务然后解密流量并将其发送到其最终目的地。由于未能遵循标准的行业惯例，Windscribe 在很大程度上否定了这些安全保证。虽然该公司试图通过列出攻击者必须满足才能成功的要求来淡化影响，但这些条件正是 VPN 旨在防止的条件。具体来说，Windscribe 表示，条件和潜在后果是： 攻击者可以控制您的网络并可以拦截所有通信（MITM 攻击的特权位置） 您使用的是传统 DNS 解析器（传统 DNS 流量未加密并受 MITM 约束）\n攻击者有能力操纵您未加密的 DNS 查询（用于选择我们其中一台服务器的 IP 地址的 DNS 条目）您没有使用我们的 Windscribe 应用程序（我们的应用程序通过 IP 而不是 DNS 条目连接）没有历史流量由于 PFS（完美前向保密）可以防止历史流量的解密，即使拥有服务器的私钥也存在风险 除了缺乏加密之外，该公司还使用数据压缩来提高网络性能。在拉斯维加斯举行的 2018 年黑帽安全会议上发表的研究报告披露了一种称为 Voracle 的攻击，它使用压缩过程中留下的线索来解密受基于 OpenVPN 的 VPN 保护的数据。几个月后，OpenVPN 弃用了该功能。这家隐私工具制造商表示，它正在彻底改革其 VPN 产品以提供更好的安全性。更改包括： 停止使用其当前的 OpenVPN 证书颁发机构，转而使用“遵循行业最佳实践，包括使用中间证书颁发机构 (CA)”的新证书 将所有服务器转换为没有硬盘的内存服务器后盾。这意味着机器包含或生成的任何数据都仅存在于 RAM 中，一旦机器关闭或重新启动就无法访问\n部署“弹性身份验证后端”以允许 VPN 服务器运行，即使核心基础设施完全中断。启用新的应用程序功能，例如无需断开连接即可更改 IP 地址的能力、请求特定的静态 IP，以及“未存储在任何数据库中的多跳客户端 ROBERT 规则”。在一封电子邮件中，Windscribe 董事 Yegor Sak 详细介绍了他的公司正在采取的步骤。它们包括： 1. 服务器功能所需的所有密钥不再永久存储在我们的任何服务器上，并且在投入运行后仅存在于内存中 2. 所有服务器都具有由我们的新 CA 生成的唯一短期证书和密钥轮换 4. 新的 OpenVPN 客户端配置使用唯一的通用名称强制执行服务器证书 X509 名称验证。与此同时，我们不会为这种疏忽找借口。本应采取的安全措施却没有。在进行威胁评估后，我们认为我们文章中处理和描述的方式是最好的推进方式。它影响了尽可能少的用户，同时透明地解决了由缉获导致的不太可能的假设情况。没有用户数据曾经或面临风险（利用密钥的攻击向量要求攻击者完全控制受害者的网络，并满足上述文章中概述的几个先决条件）。概述的假设情况不再可利用，因为最终的 CA 日落过程已于上周 7 月 20 日完成。\n目前尚不清楚该服务有多少活跃用户。然而，该公司的 Android 应用程序列出了超过 500 万次安装，这表明用户群可能很大。没收 Windscribe 服务器凸显了该公司未能遵循的基本 VPN 安全卫生的重要性。这反过来又强调了当人们依赖鲜为人知或未经测试的服务来保护他们的互联网使用免受窥探时所带来的风险。大家好，这里是 Windscribe 的 Yegor。解决上面的一些评论：为什么分叉 Wireguard 比仅在他们的堆栈中实现它更可取？如果没有适当的维护（公司现在会这样做的信念），这是否意味着他们的前叉可能会大大偏离 Wireguard 实施的预期？这有几个原因，主要是能够从中心位置获取密钥，而无需在每个服务器上部署每个用户的配置（已实现），以及在握手期间协商接口地址以消除对静态接口的需要地址（正在进行中）。 Wireguard 从来不是为数百万用户规模而设计的，这就是为什么需要进行这些更改的原因。这可以“带外”实现，但很笨重。更多细节在这里：https://blog.windscribe.com/introducing ... a1670700a6 这是乌克兰执法部门，他们可能确实扭动了他们的手臂，直到它断裂，然后拔出热风枪或喷砂机，以确保他们对他们的行为诚实答案。没有扭动手臂。据称有人冒充政府雇员并从乌克兰社会服务机构窃取了 1 万美元。一年后，这些服务器被地方当局查封。我们从来没有交出任何客户数据，仅仅是因为没有什么可以交出的。我们在以下 URL 提供实时透明度报告：https://windscribe.com/transparency", "note_en": "Privacy-tools-seller Windscribe said it failed to encrypt company VPN servers that were recently confiscated by authorities in Ukraine, a lapse that made it possible for the authorities to impersonate Windscribe servers and capture and decrypt traffic passing through them.\n The Ontario, Canada-based company  said earlier this month that two servers hosted in Ukraine were seized as part of an investigation into activity that had occurred a year earlier. The servers, which ran the  OpenVPN virtual private network software, were also configured to use a setting that was deprecated in 2018 after security research revealed vulnerabilities that could allow adversaries to decrypt data.\n “On the disk of those two servers was an OpenVPN server certificate and its private key,” a Windscribe representative wrote in the July 8 post. “Although we have encrypted servers in high-sensitivity regions, the servers in question were running a legacy stack and were not encrypted. We are currently enacting our plan to address this.”\n  Windscribe’s admission underscores the risks posed by an explosion of VPN services in recent years, many from businesses few people have heard of before. People use VPNs to funnel all their Internet traffic into an encrypted tunnel, to prevent people connected to the same network from being able to read or tamper with data or to detect the IP addresses of the two parties communicating. The VPN service then decrypts the traffic and sends it to its final destination.\n By failing to follow standard industry practices, Windscribe largely negated those security guarantees. While the company attempted to play down the impact by laying out the requirements an attacker would have to satisfy to be successful, those conditions are precisely the ones VPNs are designed to protect against. Specifically, Windscribe said, the conditions and the potential consequences are:\n    The attacker has control over your network and can intercept all communications (privileged position for  MITM attack)\n You are using a legacy DNS resolver (legacy DNS traffic is unencrypted and subject to MITM)\n The attacker has the ability to manipulate your unencrypted DNS queries (the DNS entries used to pick an IP address of one of our servers)\n You are  NOT using our Windscribe applications (our apps connect via IP and not DNS entries)\n    No historical traffic is at risk thanks to PFS ( perfect forward secrecy) which prevents decryption of historical traffic, even if one possesses the private key for a server\n  Besides the lack of encryption, the company also uses data compression to improve network performance.  Research presented at the 2018 Black Hat security conference in Las Vegas disclosed an attack known as Voracle, which uses clues left behind in compression to decrypt data protected by OpenVPN-based VPNs. A few months later, OpenVPN  deprecated the feature.\n The privacy-tools maker said it’s in the process of overhauling its VPN offering to provide better security. Changes include:\n Discontinuing use of its current OpenVPN certificate authority in favor of a new one that “follows industry best practices, including the use of an intermediate certificate authority (CA)”\n Transitioning all servers to operate as in-memory servers with no hard disk backing. This means that any data the machines contain or generate, live solely in RAM and can’t be accessed once a machine has been shut off or rebooted\n  Deploying “resilient authentication backend” to allow VPN servers to function even if there is a complete outage of core infrastructure.\n Enabling new application features, such as the ability to change IP addresses without disconnecting, request a specific and static IP, and “multi-hop, client side R.O.B.E.R.T. rules that are not stored in any database.”\n    In an email, Windscribe Director Yegor Sak expanded on the steps his company is taking. They include:\n 1. All keys required for server function are no longer stored permanently on any of our servers and exist solely in memory after they are put into operation\n 2. All servers have unique short lived certificates and keys generated from our new CA which are rotated\n  4. New OpenVPN client configurations enforce server certificate X509 name verification using the common name which is unique.\n  In the meantime, we make no excuses for this omission. Security measures that should have been in place were not. After conducting a threat assessment we feel that the way this was handled and described in our article was the best move forward. It affected the fewest users possible while transparently addressing the unlikely hypothetical scenario that results from the seizure. No user data was or is at risk (the attack vector to make use of the keys requires the attacker to have full control over the victim&#39;s network with several prerequisites outlined in the above article). The hypothetical situations outlined are no longer exploitable because the final CA sunset process was already completed last week on July 20th.\n It’s not clear how many active users the service has. The company’s  Android app, however, lists more than 5 million installs, an indication that the user base is likely large.\n The seizure of the Windscribe servers underscores the importance of the kind of basic VPN security hygiene that the company failed to follow. That, in turn, emphasizes the risks posed when people rely on little-known or untested services to shield their Internet use from prying eyes.\n  Hi folks, Yegor from Windscribe here. Addressing some comments above:    Why would forking Wireguard be preferable to just implementing it in their stack? Without proper maintenance (which faith that the company would do so right now) wouldn&#39;t that mean their fork could deviate wildly from what&#39;s expected from a Wire guard implementation?\n  There are several reasons for this, mainly the ability to fetch keys from a central place without having every single user&#39;s config be deployed on every server (already implemented), as well as negotiating the interface address during the handshake to eliminate the need for static interface addresses (work in progress). Wireguard was never designed for millions of users scale, which is why these changes are required. This can be achieved &#34;out of band&#34;, but it&#39;s clunky. More details here:  https://blog.windscribe.com/introducing ... a1670700a6     It&#39;s Ukraine law enforcement they probably did twist their arm till it broke then pulled out the heat gun or sand blaster to make sure they were being honest in their answers.\n  No arms were twisted. Someone allegedly impersonated a gov employee and stole $10k from a Ukrainian social services agency. A year later the servers were seized by local authorities.   At no point did we ever hand over any customer data, simply because there is nothing to hand over. We have a real time transparency report at the following URL:  https://windscribe.com/transparency", "posttime": "2021-07-27 16:52:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "当局,vpn,服务器", "title": "乌克兰当局扣押的 Windscribe VPN 服务器未加密", "title_en": "Windscribe’s VPN servers seized by Ukrainian authorities weren’t encrypted", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/vpn-servers-seized-by-ukrainian-authorities-werent-encrypted/?utm_brand=arstechnica", "via": "", "real_tags": ["当局", "vpn", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "23deb69326e1806f38e0dafb90567edd.jpg", "infoid": 1069979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rocketium 的客户包括 Urban Company、CasaOne、BigBasket、Cure.fit 和 Meesho。它说在其平台上制作的视觉效果被 1 亿最终用户看到。其最新一轮融资使 Rocketium 迄今为止的融资总额达到 420 万美元，其中包括来自 Blume Ventures 和 1Crowd 的 100 万美元种子轮融资。 Rocketium 的平台目前只接受邀请，并计划在 2022 年开放自助服务使用和购买，以及与电子商务和广告平台的更多集成（其目前的集成包括 Salesforce、Mailchimp、YouTube、Vimeo、Wistia 和 Hubspot）。为了使用 Rocketium，设计团队在 Photoshop 或 After Effects 中创建了一组核心模板并将它们导入平台。然后Rocketium针对不同场景定制广告。例如，如果零售商在某些地区开展有针对性的免费送货活动，他们将该信息输入电子表格，Rocketium 会自动更新模板中的文本。然后针对不同平台对广告和视频进行格式化，例如用于网络广告的横幅或用于 Instagram 的方形格式。 Rocketium 的客户之一，健身应用程序 curure.fit，使用它每月针对不同的会员计划运行大约五到六次活动。该平台使 cur.fit 能够减少视觉内容的制作时间，并根据用户的兴趣、人口统计和位置来个性化活动。其他帮助营销团队创建视觉广告活动的公司包括 Canva、InVideo 和 Lumen5。联合创始人兼首席执行官 Satej Sirur 告诉 TechCrunch，Rocketium 专为需要每月创建成百上千个广告、视频和其他创意内容的客户而设计，并且一次可用于创建多达 10,000 个视觉效果。 Canva、InVideo 和 Lumen5 提供模板，而 Rocketium 更专注于想要从 PhotoShop 和 After Effects 导入自己的设计的用户。在一份声明中，Emergent Ventures 创始人兼合伙人 Ankur Jain 表示：“从大容量内容制作到数据驱动的活动优化，Rocketium 正在挑战传统的组织孤岛，以提供真正受到绩效营销人员和设计师等人喜爱和依赖的产品。”", "note_en": "Rocketium’s clients include Urban Company, CasaOne, BigBasket, cure.fit and Meesho. It says visuals made on its platform are seen by 100 million end users. Its latest funding brings Rocketium’s total raised so far to $4.2 million, including a $1 million seed round from Blume Ventures and 1Crowd.\n Rocketium’s platform is currently invite-only and it plans to open self-service usage and purchases in 2022, along with more integrations with e-commerce and advertising platforms (its current integrations include Salesforce, Mailchimp, YouTube, Vimeo, Wistia and Hubspot).\n  To use Rocketium, design teams create a core set of templates in Photoshop or After Effects and import them to the platform. Then Rocketium customizes ads for different scenarios. For example, if a retailer is running a targeted campaign with free shipping in certain areas, they enter that information into a spreadsheet and Rocketium automatically updates the text in the templates. Then ads and videos are formatted for different platforms, like banners for web advertising or square format for Instagram.\n  One of Rocketium’s clients, fitness app cure.fit, uses it to  run about five to six campaigns each month for different membership plans. The platform enables cure.fit to reduce the production time for visual content and personalize campaigns based on users’ interests, demographics and locations.\n   Other companies that help marketing teams create visual advertising campaigns include Canva, InVideo and Lumen5. Co-founder and chief executive officer Satej Sirur told TechCrunch that Rocketium was designed specifically for clients that need to create hundreds or thousands of ads, video and other creative content a month, and can be used to create up to 10,000 visuals at a time.\n  While Canva, InVideo and Lumen5 provide templates, Rocketium is more focused on users who want to import their own designs from PhotoShop and After Effects.\n In a statement, Emergent Ventures founder and partner Ankur Jain said, “From high-volume content production to data-driven campaign optimization, Rocketium is challenging traditional organizational silos to deliver a product that is truly loved and relied on by performance marketers and designers alike.”", "posttime": "2021-07-27 16:51:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创意,teams,rocketium", "title": "Rocketium 融资 320 万美元，帮助创意团队开展大规模营销活动", "title_en": "\n\t\t\t\tRocketium raises $3.2M to help creative teams create massive marketing campaigns\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/rocketium-raises-3-2m-to-help-creative-teams-create-massive-marketing-campaigns/", "via": "", "real_tags": ["创意", "teams", "rocketium"]}, {"category": "", "categoryclass": "", "imagename": "dd8754fa476b645a8a1942c7383bf5bf.png", "infoid": 1069978, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界已经真正觉醒到了去中心化通信的时代。美国国会正在发布 ACCESS 法案，以加强平台之间的互操作性和数据可移植性；欧盟正在为此推进《数字市场法案》——德国国家医疗保健系统已公布其计划，将 Matrix 上的 150,000 个医疗保健组织标准化。正是在这种背景下，我们非常高兴地宣布 Element 已经筹集了 3000 万美元的 B 系列资金，以彻底改变应用程序的可用性，构建主要的新功能，扩展企业市场并使 Matrix 完全成为主流！这轮融资由我们在 Protocol Labs 的老朋友（libp2p、IPFS、Filecoin 等的创造者）和 Metaplanet 领投，Metaplanet 是由 Skype 联合创始人 Jaan Tallinn 设立的投资基金。 Automattic 和 Notion 也参与了这一轮，将他们对 Element 的现有投资加倍。我们想不出比 Protocol Labs 和 Metaplanet 更好的新投资者来支持 Element 的使命。 Protocol Labs 毫无疑问是去中心化运动的领导者：只要我们一直致力于将 Matrix 作为去中心化通信层，他们就一直忙于构建 IPFS 作为互联网的去中心化存储层。在 Element 诞生之前，他们就一直在 Matrix 上（Vector 是最早完全托管在 IPFS 上的应用程序之一！），我们迫不及待地想在未来与他们更密切地合作，尽管技术只会在显然是对我们来说正确的技术决策——例如，Element（和 Matrix）不会很快使用加密货币激励措施。与此同时，Metaplanet 是最具前瞻性的投资基金之一——当他们说他们的投资主题是“支持可以为人类带来巨大回报的新颖和循证创新”时，他们并不是在开玩笑。换句话说，他们投资于那些为了让世界变得更美好而做出疯狂破坏性长期事情的人——在我们的例子中，是通过民主化交流使私人交流成为所有人的基本人权。除此之外，Jaan 构建 Skype（他负责聊天！）的经历与我们对 Matrix 的追求之间也存在明显的大量重叠。许多人忘记了 Skype 最初是一个庞大且成功的去中心化通信应用程序——实际上是完全点对点的，建立在与 Kazaa 相同的技术上。随着 P2P Matrix 工作的进展，从构建 Skype 的经验中吸取教训会很棒。这笔投资也非常具体地反映了 Matrix 和 Element 的进步和成熟，以及越来越注重隐私的市场。仅在过去的六个月中，我们就在 EMS 上为 Slack 和 Teams（以及 Telegram 和 Discord）推出了桥梁，在企业市场上获得了真正的吸引力 - 很快就会有更多。与此同时，事实证明，Element Home 在想要拥有自己的服务器的朋友和家人中很受欢迎。与此同时，在更广阔的 Matrix 世界中，我们看到世界上最大的开源会议 FOSDEM 通过 Matrix 实现虚拟化（在 660 多个演讲中有超过 30,000 名与会者），激发了许多其他开源项目的加入。最后，Spaces 的 Beta 版发布了一场风暴——终于让用户可以将他们的房间分成组甚至层次结构，很快就会退出 Beta 版！\n在公共部门，越来越多的政府和非政府组织（希望很快宣布！）正在加入英国、美国、法国和德国的行列，建立 Matrix。就在上周，我们看到了德国国家卫生机构 gematik，它宣布德国的所有医疗保健部门都将使用 Matrix 来发送消息。私营部门也在迎头赶上，意识到将所有未加密的对话交给微软和 Salesforce (Slack) 可能不是最好的举措。在其他地方，我们看到越来越多的用户意识到 Element 是 Discord 的绝佳安全替代品——或者是 WhatsApp 的去中心化替代品。坦率地说，作为一家公司，如果我们愿意，Element 在这一点上可以自给自足，通过来自 EMS 托管、EMS 服务和法国和德国等国家级部署的支持合同的收入为基本的 Matrix 和 Element 开发提供资金。公共网络现在拥有超过 3500 万可寻址用户，分布在约 7 万个部署中，我们正在与其他 10 多个国家/地区合作，以将他们也加入进来。矩阵就在这里。然而，在大流行、对 WhatsApp 隐私政策变化的反应，甚至监管机构现在都意识到这些平台垄断是多么不健康的事实之间：过去 18 个月很明显，安全的分散通信已成为一项生存要求，我们应该这样做尽我们所能加快我们剩余的工作。很简单，世界现在需要Matrix。运行 Matrix 服务器应该像运行 Web 服务器一样简单明了。 Element 使用起来应该非常令人愉快，以至于它推动了 Matrix 的采用以获得临界质量并迅速爆发。因此，我们有意识地决定主动筹集这笔新资金，以加速 Element 的增长，并尽快将数据主权带给大众。实际上，这意味着我们要在核心工作上加倍努力：使 Element 尽可能地精致和流畅——引入更多的设计师和产品可用性专家来帮助我们挖掘应用程序中剩余的漏洞；添加剩余的核心缺失功能：空格、线程、固定消息、加星标的消息、自定义表情符号等。在 Matrix 方面，让 Synapse 服务器成为运行的乐趣，并在下一代服务器 Dendrite 上继续开发。我们还组建了专门的团队，专注于完善我们的端到端加密、VoIP/VR、信任与安全以及 P2P 计划。简而言之，对于 Element 和 Matrix，我们正在全面招聘 - 因此，如果您想构建 Web 缺少的通信层，请与我们联系！看到自 2017 年 7 月成立 Element 以来 Matrix 已经走了多远，这有点令人眼花缭乱，但几乎感觉我们仍处于起步阶段。我们正处于 Element 不受控制地在我们的计算机和手机上爆炸的风口浪尖，其方式与 Netscape 在 Web 的早期所做的或电子邮件在早期的 Internet 上所做的几乎相同。想象一个所有服务器都默认带有 Matrix 主服务器的世界，就像今天它们带有邮件传输代理一样——或者是一个点对点世界，其中 Element 的每个副本都嵌入了自己的服务器：用户对他们的对话拥有完全的数字主权。\n随着我们向这个美丽的新世界转变，接下来的几个月将证明是至关重要的。新资金将用于将 Element 的抛光提升到一个新的水平——同时全额资助 P2P Matrix 工作、去中心化 VoIP/视频会议和去中心化声誉。这应该是 Matrix 和 Element 的一个步骤变化，我们要感谢 Protocol Labs、Metaplanet、Automattic 和 Notion 为其提供燃料！", "note_en": "The world has truly woken up to the age of decentralised communication. The US congress is releasing the  ACCESS Act bill to enforce interoperability and data portability between platforms; the EU is pushing forwards with the  Digital Markets Act for the same - and the German national healthcare system has  published its plan to standardise 150,000 healthcare organisations on Matrix.\n It’s against this backdrop that we are incredibly excited to announce that Element has raised $30M of Series B funding in order to revolutionise the app’s usability, build out major new features, expand in the enterprise market and take Matrix fully mainstream!\n The round is led by our long-standing friends at  Protocol Labs (the creators of  libp2p,  IPFS,  Filecoin and more) alongside  Metaplanet - the investment fund set up by Jaan Tallinn, co-founder of Skype.  Automattic and  Notion are also participating in the round, doubling down on their existing investments in Element.\n  We cannot think of better new investors to support Element’s mission than Protocol Labs and Metaplanet.  Protocol Labs is unquestionably a leader of the decentralisation movement: they have been busy building out IPFS as the decentralised storage layer of the Internet for as long as we’ve been working away on Matrix as the decentralised communication layer. They’ve been on Matrix since before Element was born (Vector was one of the first apps entirely hosted on IPFS!), and we cannot wait to work more closely with them in future, although technology will only be shared if it is clearly the right technical decision for us - for instance, Element (and Matrix) is not going to use cryptocurrency incentives any time soon.\n Meanwhile,  Metaplanet is one of the most forward thinking investment funds out there - they’re not joking when they say that their investment thesis is to “support novel and evidence based innovation that could produce an outsized return for the benefit of humankind”.  In other words, they invest in folks who are doing crazy disruptive long-term things to make the world a better place - in our case, democratising communication to make private communication a basic human right for all.  Beyond that, there’s also the obvious massive overlap between Jaan’s experiences building out Skype (where he was responsible for chat!) and our quest with Matrix.  Many people forget that Skype was originally a massive and successful decentralised communications app - and in fact fully peer-to-peer, built on the same tech as Kazaa. It will be fantastic to learn from the lessons of building Skype as P2P Matrix work progresses.\n The investment is also a very concrete reflection of Matrix and Element’s progress and maturity, and an increasingly privacy conscious market.\n  These last six months alone have seen us gain real traction in the enterprise market with the launch of bridges for Slack and Teams (and Telegram and Discord) on EMS - with more to come shortly.  At the same time, Element Home is proving popular for friends and family wanting their own servers.  Meanwhile in the wider Matrix world we saw the world’s biggest open source conference  FOSDEM go virtual via Matrix (with over 30K attendees across 660+ talks), inspiring many other open source projects to hop on board.  Finally, the beta release of Spaces has gone down a storm - at last letting users curate their rooms into groups and even hierarchies, and soon to exit beta!\n In the public sector, more and more governments and NGOs (hopefully to be announced soon!) are joining the UK, the US, France and Germany in building on Matrix. Only last week we saw gematik, the German national health agency announce  all of Germany&#39;s healthcare will use Matrix for messaging going forwards. The private sector is catching up too, realising that handing over all their unencrypted conversations to Microsoft and Salesforce (Slack) may not be the best move.  Elsewhere, we see more and more users realising that Element is an excellent secure alternative to Discord - or a decentralised alternative to WhatsApp.\n Speaking candidly, as a company, Element could be self-sufficient at this point if we wanted to, funding basic Matrix and Element development via revenue from EMS hosting, EMS services, and support contracts for nation-scale deployments such as France and Germany. The public network now has over 35M addressable users spread over ~70K deployments, and we’re working with over 10 other countries to bring them on board too. Matrix is here to stay.\n  However, between the pandemic, the reactions to WhatsApp’s privacy policy changes, and the fact even regulators now realise how unhealthy these platform monopolies are: it’s become clear over the last 18 months that secure decentralised communication has become an existential requirement, and we should do everything we can to speed up our remaining work.  Quite simply, the world needs Matrix  now.  Running a Matrix server should be as straightforward and as commonplace as running a web server. Element should be so delightful to use that it drives Matrix adoption to gain critical mass and explode virally.\n So we consciously made the decision to proactively raise this new funding in order to accelerate Element’s growth, and bring data sovereignty to the masses as quickly as we possibly can.\n Practically speaking, this means doubling down on our core work: making Element as polished and slick as possible - bringing in more designers and product usability specialists to help dig us out of the remaining holes in the app; adding the remaining core missing features: spaces, threading, pinned messages, starred messages, custom emoji and more. On the Matrix side, making the Synapse server a joy to run, and continuing development on Dendrite, the next-gen server.  We are also filling out dedicated teams to focus exclusively on refining our End-to-end Encryption, VoIP / VR, Trust &amp; Safety and P2P initiatives.\n In short, for both Element and Matrix, we’re hiring across the board - so if you want to build the missing communication layer of the Web, please  get in touch!\n  It’s a bit dizzying to see how far Matrix has come since we set up Element in July 2017, and yet it almost feels like we are still at the beginning.  We’re at the cusp of Element uncontrollably exploding across our computers and phones in much the same manner that Netscape once did in the early days of the Web - or email did over the early Internet.  It’s not implausible to think of a world where all servers come with a Matrix homeserver by default, much as they come with a mail transfer agent today - or a peer-to-peer world where every copy of Element embeds its own server: giving the user total digital sovereignty over their conversations.\n The coming months will prove critical as we transform towards this brave new world. The new funds will be spent on taking Element&#39;s polish to the next level - while fully funding P2P Matrix work, Decentralised VoIP/Video conferencing and Decentralised Reputation at last. This should be a step change for Matrix and for Element, and we’d like to thank Protocol Labs, Metaplanet, Automattic and Notion for providing the fuel to power it!", "posttime": "2021-07-27 16:42:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "爆发,element,matrix", "title": "随着 Matrix 的爆发，Element 筹集了 3000 万美元", "title_en": "Element raises $30M as Matrix explodes", "transed": 1, "url": "https://element.io/blog/element-raises-30m-as-matrix-explodes/", "via": "", "real_tags": ["爆发", "element", "matrix"]}, {"category": "", "categoryclass": "", "imagename": "4ce34706a4900562850f71dea74f6414.jpg", "infoid": 1069977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不要错过。注册并成为第一个获得诺基亚手机新闻和优惠的人。 HMD Global Oy 是诺基亚手机和平板电脑品牌的独家授权商。诺基亚是诺基亚公司的注册商标。 Android、Google 和其他相关标志和徽标是 Google LLC 的商标。可能适用于提供的变化。检查本地可用性。所提供的所有规格、功能和其他产品信息如有更改，恕不另行通知。图片仅供参考。 1 提供一次免费更换屏幕，如果您在购买后的第一年内损坏它。 3 5G 覆盖范围有限，您的网络服务提供商可能不支持。实际速度取决于网络和其他因素。 4 Google Assistant 不适用于某些语言和国家/地区。在 https://support.google.com/assistant 查看可用性。 © 2021 HMD Global。版权所有。诺基亚是诺基亚公司的注册商标。 HMD Global Oy 是诺基亚手机和平板电脑品牌的独家授权商。", "note_en": "Don&#39;t miss out. Sign up and be the first to get Nokia phone news and offers.\n HMD Global Oy is the exclusive licensee of the Nokia brand for phones and tablets. Nokia is a registered trademark of Nokia Corporation. Android, Google and other related marks and logos are trademarks of Google LLC. Variations on offering may apply. Check local availability. All specifications, features and other product information provided are subject to change without notice. Images are for illustrative purposes only.\n 1 Comes with one free screen replacement, if you will break it during the first year from the purchase.\n  3 5G coverage is limited and might not be supported by your network service provider. Actual speed depends on network and other factors.\n 4 The Google Assistant is not available in certain languages and countries. Check availability at  https://support.google.com/assistant.\n  © 2021 HMD Global. All rights reserved. Nokia is a registered trademark of Nokia Corporation. HMD Global Oy is the exclusive licensee of the Nokia brand for phones &amp; tablets.", "posttime": "2021-07-27 16:42:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,xr20,google", "title": "诺基亚 XR20 手机", "title_en": "Nokia XR20 Mobile", "transed": 1, "url": "https://www.nokia.com/phones/en_int/nokia-xr-20", "via": "", "real_tags": ["手机", "xr20", "google"]}, {"category": "", "categoryclass": "", "imagename": "517713a7ad5ab4d9fdce5fb5c53d973b.jpg", "infoid": 1069976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最新一轮使 Onto 的总资金达到 2.45 亿美元。瑞典风投 Alfvén &amp; Didrikson 领投这轮股权融资，英国投资公司 Pollen Street Capital 提供高级担保资产支持的债务工具，这可能意味着 Onto 的 3,000 多辆电动汽车将用作抵押品。 Onto 没有透露这轮融资中有多少来自股权与债务。这家汽车即服务公司正在寻找社会对订阅服务日益增长的崇拜与立法推动的电动汽车采用之间的最佳平衡点。与许多其他国家一样，英国正在禁止到 2030 年销售内燃机新车，因此越来越多的人正在寻找转向电动汽车的方法。从天然气到电力的转变正在加速。根据汽车制造商和贸易商协会的数据，2020 年全电动和插电式混合动力汽车的新注册在英国的市场份额为 10.7%。这比 2019 年的 6.6% 有所上升。该组织指出，电池和插电式混合动力汽车的注册量合计超过十分之一，高于 2019 年的大约 30 分之一。购买汽车通常被认为是最糟糕的投资之一你（们）能做到;它是一种资产，一旦客户通过融资购买它，就会贬值和花钱。然而，英国每年有数百万辆新车销售。由于市场规模如此之大，Onto 创始人兼首席执行官 Rob Jolly 认为，有足够的空间使订阅业务成为可持续且有利可图的业务。 “我们的总拥有成本与拥有自己的汽车非常相似，但您不必担心收费或服务，”乔利告诉 TechCrunch。 “棒球场的费用是每月 330 英镑（约 450 美元）。没有预付定金，这是巨大的。我们正在努力做的是消除所有障碍，让人们更容易认识到订阅汽车实际上比购买汽油或柴油汽车更容易、更实惠。”简单浏览 Onto 的网站，就会发现 330 英镑的球场仅适用于公司车队中较低级别的某些汽车。中档可能是标致 450 英镑（~622 美元）或现代 560 英镑（~775 美元），高档可能是捷豹或特斯拉，1299 英镑（~1,800 美元）。例如，如果我们计算租赁现代 Kona 的数字，就不清楚 Onto 的服务是否更便宜。在英国租用这辆车可能会在四年内为客户每年花费 9,888 英镑，首付为 2,152 英镑。英国电动汽车的平均保险费用为 2,264 英镑。普通人每天开私家车行驶 35 英里，而现代科纳的续航里程约为 245 英里，所以你真的只需要每周充满电一次。为电池充电的平均成本约为 10 英镑，因此您每年的充电费用约为 520 英镑。电动汽车的维护很少，通常包含在租赁协议中。算起来，你会在四年内得到大约 15,000 英镑（~20,700 美元）的数字。以每月 560 英镑的价格计算，Onto 的服务在同一四年期间将使客户花费 26,880 英镑（约合 37,145 美元）。考虑到英国的插电式汽车补助金，您可以以 27,950 英镑（约合 38,620 美元）的价格购买这辆车。\n这当然更像是一种高端服务，其优势在于便利性和灵活性。 Onto 的定价肯定与其他电动汽车订阅业务相当，例如北美的 Steer。旧金山的 Flux 明显更便宜，以每月 600 美元的价格提供 Teslas，但它不包括 Onto 提供的“全包”服务，如道路税和保险。诚然，在英国，电动车车主实际上不必支付道路税。 Onto 表示，订阅中包括的其他内容包括车辆送货上门，以及通过网络合作伙伴（如 BP Pulse、Tesla Supercharger、InstaVolt 以及截至今年早些时候的 Shell Recharge）免费充电。该公司与 10 个汽车品牌建立了合作伙伴关系，并出租了 12 种不同的电动汽车车型，并且正在巩固更多汽车制造商的合作伙伴关系。 Jolly 不会分享有关未来合作伙伴关系的细节。但是，该公司网站的更新显示了最近添加的要预订的车型，这表明大众汽车及其 2021 e-Up!将是最新的。 Jolly 表示，大众可能需要一段时间才能同时接受电动汽车和订阅服务，但他相信，为客户提供可随时取消的白手套服务会使选择变得尽可能简单。事实上，乔利说 Onto 几乎是盈利的，这在公司计划每三到六个月将其团队规模扩大一倍的计划中很明显，该团队目前有 70 名员工。 Onto 的主要投资者 Alfvén &amp; Didrikson (A&amp;D) 通常投资于更多 SaaS 业务，具有长期投资结构。 A&amp;D 合伙人蒂亚姆·阿夫沙里 (Tiyam Afshari) 表示，这使得 VC 能够对像 Onto 这样需要大量前期成本的企业进行更大的赌注。 “我们很高兴接受我们看到正在改变行业的那些赌注，”Afshari 告诉 TechCrunch。 “如果您了解拥有汽车所带来的所有麻烦，订阅作为汽车所有权的一种形式是轻而易举的。因此，我们非常强烈地认为，订阅模式应该并且将会发展成为融资行业的重要组成部分，而 Onto 处于利用这一点的主要位置。”鉴于其主要投资者对 Onto 的长期押注，可以看出该公司在寻求向英国以外的地区扩张时可能将目光投向瑞典 毕竟，斯堪的纳维亚人采用电动汽车的速度比其他国家快，而挪威的另一项电动汽车订阅服务 imove ，最近在 A 系列中筹集了 1900 万美元。对于许多用户来说，电动汽车订阅服务不仅仅是不必担心路税、汽车保险和服务等问题。这是关于跟上最新电动汽车模型的灵活性。\n“iPhone 每年都会更新，因为技术在进步，电池寿命也略有改善，”乔利说。 “同样的事情将会发生，而且已经发生在电动汽车上。我们看到这就是千禧一代现在拥有的汽车。他们可以更换最新最好的汽车，即使它只是一辆额外行驶 30 英里的汽车。这在我们的客户中非常普遍。”对于 32 岁的东德文郡的西蒙史密斯来说，从来没有尝试过最新的汽车。由于道德和经济原因，他于 2019 年加入 Onto 的服务，并发现雷诺 Zoe ZE40 的不同版本完全满足他的需求。 “对我来说，这仍然是最实惠的电动驾驶方式，”史密斯告诉 TechCrunch。 “我真的很想使用电动汽车，但在 2019 年没有任何明显的方法可以做到这一点或实现它，而且我想说它在英国仍然相当有限如果你想使用电动汽车，你可能必须即使买二手也能省下一大笔钱，然后你就没有灵活性了。”史密斯说，对于那些想在购买前试用的人来说，使用 Onto 也是一种很好的方法，这无疑是特斯拉、现代、捷豹、奥迪和标致等汽车制造商有兴趣合作的部分原因。 “同样，这是一个巨大的市场，我们可以与汽车制造商和经销商携手并进，在其他方面，我们是人们现在购买汽车的众多方法之一，”乔利说.现有投资者 Legal and General、Campden Hill Capital 和 JamJar 也参与了本轮融资，以及来自 TotalEnergies Ventures、Vlerick Group、荷兰保险公司 Achmea Innovation Fund 和 Jim O&#39;Neill 家族办公室的新投资。 Lazard 担任 Onto 的财务顾问。", "note_en": "This latest round brings Onto’s total funding to $245 million.  Swedish VC Alfvén &amp; Didrikson is leading the round on the equity raise, and British investment company Pollen Street Capital is providing a senior-secured asset-backed debt facility, which likely means Onto’s fleet of over 3,000 electric vehicles will be used as collateral. Onto did not disclose how much of the round came from equity versus debt.\n The car-as-a-service company is finding that sweet spot between society’s growing adoration for subscription services and EV adoption driven by legislation. The U.K., like many other countries, is banning internal combustion engine new car sales by 2030, so more people are looking for ways to make the switch to electric.\n  That shift from gas to electric is accelerating. New registrations of all-electric  and plug-in hybrid vehicles had a market share of 10.7% in the UK in 2020,  according to the Society of Motor Manufacturers and Traders. That’s up from 6.6% in 2019. The organization noted that battery and plug-in hybrid electric cars together accounted for more than one in 10 registrations, up from around one in 30 in 2019.\n Buying a car is often considered one of the worst investments you can make; it’s an asset that both depreciates and costs money the moment a customer buys it through financing. Yet there are millions of new car sales each year in the U.K. With a market size that large, Onto founder and CEO Rob Jolly thinks there’s plenty of room to make the subscriptions business a sustainable and profitable one.\n “Our total cost of ownership is very comparable with having your own car but you don’t have to worry about charging fees or servicing,” Jolly told TechCrunch. “The ballpark cost is £330 (~$450) per month. There’s no upfront deposit, which is huge. What we’re trying to do is remove all the barriers and actually make it easier for people to recognize that having a car on subscription is actually easier and more affordable than having a petrol or diesel car.”\n A brief glance at  Onto’s website shows that the  £330 ballpark is only accurate for certain cars at the lower range of the company’s fleet. The middle range could be a Peugeot at £450 (~$622) or a Hyundai at £560 (~$775), and high range could be a Jaguar or Tesla at £1299 (~$1,800).\n If we crunch the numbers for leasing a Hyundai Kona, for example, it’s not clear that Onto’s service is cheaper.  A lease for this vehicle in the U.K. could cost a customer annually  £9,888 over a four year period with a down payment of £2,152. The  average cost of insurance for EVs in the U.K. is £2,264. The  average person travels 35 miles by personal car per day, and the Hyundai Kona has a range of about 245 miles, so you really only need to fully charge it once a week. The  average cost of charging the battery is about  £10, so you’re looking at about £520 per year on charging. Maintenance for electric vehicles is minimal and usually included in a lease agreement. Tally it up and you get a number in the ballpark of £15,000 (~$20,700) over four years. At £560 per month, Onto’s service would cost a customer £26,880 (~$37,145) over the same four year period. When factoring in U.K.’s plug-in car grant, you could  buy the car for £27,950 (~$38,620).\n It’s certainly more of a high-end service, and the premium is on the convenience and flexibility. Onto’s pricing is certainly comparable to other EV subscription businesses, like  Steer in North America. Flux, in San Francisco, is markedly cheaper, offering Teslas for $600 per month, but it doesn’t include the “all-inclusive” services like road tax and insurance that Onto does. Granted, in the U.K., EV owners don’t actually have to pay for road tax.\n Among other things Onto says are included in a subscription are home delivery on its vehicles and access to free charging via network partners like BP Pulse, Tesla Supercharger, InstaVolt and as of earlier this year   Shell Recharge . The company has partnerships with 10 car brands and rents out 12 different EV models, and is in the process of firming up more automaker partnerships. Jolly wouldn’t share specifics on future partnerships. However, updates to the company’s website, which shows most recent additions of car models to book, suggest Volkswagen and its 2021 e-Up! will be the latest.\n  Jolly said it might take a while for the masses to catch on to both EVs and subscriptions, but he’s confident that offering customers a white-glove service that can be canceled anytime makes the choice as easy as possible. In fact, Jolly said Onto is very nearly profitable, and that’s evident in the company’s plans to double its team size, which is currently at 70 staff members, every three to six months.\n Onto’s lead investor, Alfvén &amp; Didrikson (A&amp;D), which usually invests in more SaaS businesses, has a long term investing structure. This has allowed the VC to take bigger bets on businesses like Onto’s that requires large upfront costs, according to Tiyam Afshari, partner at A&amp;D.\n “We’re happy to take those bets that we see are transforming an industry,” Afshari told TechCrunch. “Subscription as a form of ownership when it comes to cars is just a no-brainer if you look at all the hassle that comes from owning a car. So we feel quite strongly that the subscription model should and will grow to quite a significant part of the financing industry, and Onto is in a prime position to capitalize on that.”\n Given its lead investor’s long term bet on Onto, it’s perceivable that the company might look towards Sweden as it seeks to expand outside the U.K. After all, the Scandinavians have taken to EVs faster than other countries, and another EV subscription service in Norway,   imove, recently raised $19 million in a Series A.\n For many users, the EV subscription service isn’t just about not having to worry about things like road tax, auto insurance and servicing. It’s about the flexibility of keeping up with the latest EV models.\n “The iPhone has updates every year because the tech is improving and the battery life gets slightly better,” said Jolly. “The same thing is going to happen and already is happening with EVs. We’re seeing that this is car ownership now for millennials. They can swap in for the latest and greatest car when it comes out, even if it’s just a car with 30 miles extra range. And that’s hugely prevalent within our customers.”\n For Simon Smith of East Devon, 32, it’s never been about trying out the newest car. He joined Onto’s service in 2019 for ethical and financial reasons, and has found the different iterations of the Renault Zoe ZE40 to suit his needs entirely.\n “It’s still the most affordable way for me to drive electric,” Smith told TechCrunch. “I really wanted to go electric, but there wasn’t any obvious way of doing that or making that happen in 2019, and I would say it’s still fairly limited in the U.K. If you wanted to go electric, you’d probably have to save up a good deal of money even to buy second hand, and then you just wouldn’t have the flexibility.”\n Smith says using Onto is a good approach for people who want to try before they buy, as well, which is no doubt at least partly why automakers like Tesla, Hyundai, Jaguar, Audi and Peugeot are interested in partnering up.\n “Again, it’s an enormous market, of which we can kind of sit hand-in-hand with the car manufacturers and dealerships and the other aspects where we are one of a number of methods people have of acquiring the car now,” said Jolly.\n Existing investors Legal and General, Campden Hill Capital and JamJar also participated in the equity round, alongside new investments from TotalEnergies Ventures, Vlerick Group, Dutch insurer Achmea Innovation Fund and the family office of Jim O’Neill. Lazard acted as financial advisor to Onto.", "posttime": "2021-07-27 16:03:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英国,service,服务", "title": "Onto 在 B 轮融资 1.75 亿美元以扩展英国的电动汽车订阅服务", "title_en": "\n\t\t\t\tOnto raises $175 million in Series B to expand EV subscription service in the UK\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/onto-raises-175-million-in-series-b-to-expand-ev-subscription-service-in-the-uk/", "via": "", "real_tags": ["英国", "service", "服务"]}, {"category": "", "categoryclass": "", "imagename": "37551aa624cf48cb1d04dc75caedb0f6.jpg", "infoid": 1069975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在南非，这些企业贡献了该国国内生产总值的三分之一左右。去年，冠状病毒大流行威胁到其中一些中小企业的生存，其影响持续存在，因为业主担心收入、销售和现金流。自 2013 年推出以来，南非金融科技 Yoco 已将自己定位为该国商家进行线下支付的首选平台。今天，该公司宣布获得 8300 万美元的 C 轮融资，以扩大线下和线上产品的规模并扩展到新市场。尽管南非的卡和移动普及率超过 70%，但该国的中小企业仍然难以接受卡。事实证明，Yoco 的便携式卡片机在解决这个问题方面非常出色；三年前，当 TechCrunch 在 B 轮融资 1600 万美元后报道该公司时，使用其平台的商户只有 3 万多家。现在，这个数字增加了五倍。随着 Yoco 在提供离线支付方面呈指数级增长，它建立了在线产品。在测试了一段时间后，在去年 3 月南非封锁的几天后，推出及时。这样，南非商家就可以继续在平台上接受付款。 “我们希望提供商家需要的任何支付方式。我们确实从面对面的支付领域开始，专注于终端，这是最大的需求所在，”首席商务官 Carl Wazen 说。 “但这场大流行对如此多依赖面对面交易的企业产生了毁灭性影响，加速了企业接受在线支付的需求。”根据 Yoco 的小型企业脉搏监测器，在南非封锁最严重的时期，-100 到 100 之间的中小企业所有者的情绪在 2020 年第二季度降至历史最低点 -12。此后，随着封锁的放松，情况有所改善，使企业可以更自由地行动并继续面对面付款。因此，Yoco 的在线支付只占平台上交易的一小部分。但这并不是说人们用现金进行交易。据 Wazen 称，事实上，情况恰恰相反。 Wazen 说，他注意到的一种大流行后行为是，一旦解除封锁，人们就会以更快的方式回来亲自付款，因为他们不再使用现金。 “最近的消费者行为表明不再使用现金，企业必须迅速适应这种变化。这提供了一个巨大的机会，我们的使命是支持这种转变，”他补充道。\n今年早些时候，首席执行官 Katlego Maphai 表示，Yoco 正在寻求将其服务扩展到数字支付的其他方面。他将移动货币、二维码支付和电子资金转账 (ETF) 列为正在筹备中的产品。 Wazen 证实了这一点，但没有提供有关公司在这些产品方面的最新情况。然而，他确实提到，该公司仍然是一家以卡为中心的支付提供商。作为南非最重要的信用卡支付提供商，Yoco 的战略在于创造接入和消除采用数字金融服务的障碍。该公司通过专注于 Wazen 声称对中小型企业最全面的产品功能来做到这一点。他补充说，就市场占有率而言，Yoco也是商家最容易通过不同渠道无缝访问服务的地方。 “我们有一个现在得到认可的品牌。这就是我们获胜的方式，它是关于尽可能专注于市场的那部分，在我们看来，像其他竞争对手一样的人没有足够关注。”南非有超过 600 万家小企业仍然只用现金进行交易；这为 Yoco 提供了巨大的机会。据该公司称，从 3 月到 2020 年 7 月，完全无现金的小企业数量增长了 300%。 Yoco 目前为其中 150,000 家企业提供服务，每天增加 500 多家商户。该公司声称每年处理超过 10 亿美元的信用卡支付，在其成立的六年中，它处理了超过 20 亿美元的信用卡支付。 Yoco 总共筹集了 1.07 亿美元。该公司的 C 系列投资是南非同类投资中规模最大的，也是非洲金融科技领域最大的投资之一（仅次于 Flutterwave 和 Chipper Cash）。 Wazen 还声称它是中东和非洲任何以小型企业为重点的支付平台中最大的。 Yoco 目前是非洲大陆最有价值的初创公司之一，作为一家金融科技初创公司，这并不奇怪。该行业继续主导着非洲的创业风险投资资金，而其重量级人物则将首次投资者带到非洲大陆。在 Yoco 的案例中，它是本轮的主要投资者 Dragoneer Investment Group。该基金以支持 Chime、Klarna、Nubank、Mercado Libre 和 Square 等金融科技巨头而闻名。\n其他参与的投资者包括新投资者 Breyer Capital、HOF Capital、The Raba Partnership、4DX Ventures 和 TO Ventures；以及现有投资者 Partech、Velocity Capital Fintech Ventures、Orange Ventures 和 Quona Capital。 Coinbase、Revolut、Spotify 和 Gojek 等全球科技公司的现任和前任高管也参加了此次会议。 “与 Yoco 团队合作，我们非常兴奋，”Dragoneer 私人投资联席主管 Christian Jensen 在一份声明中表示。 “在 Dragoneer，我们寻找优秀的团队，他们正在建立具有出色经济模型的持久业务，而这正是我们在 Yoco 找到的。 Yoco 已经受到客户的喜爱，该公司正在投资的产品路线图将为商家带来更多价值。虽然国内有巨大的持续增长空间，但 Yoco 的机会远远超出了南非。” Wazen 指出，Yoco 的业务蓬勃发展有三个核心推动因素。一是产品能力，二是平台，三是市场占有率。这项投资将加速这三者的发展。 Yoco 正在从纯粹的支付接受游戏转变为产品方面的完整金融生态系统。平台游戏将使 Yoco 继续整合并利用监管放松的垂直优势，并且 Yoco 正在深化其在南非的市场占有率。虽然 Wazen 认为 Yoco 在南非还没有触及皮毛，但他期待在非洲和中东的其他地区复制其增长。在这两个地区有超过 1 亿的中小企业以现金进行交易，Yoco 计划在未来四年内至少达到 100 万。为了实现这一目标，Yoco 将在明年将其远程团队以及在开普敦和阿姆斯特丹的办公室中增加 200 人。该公司还利用了当前的趋势，即非洲的独角兽和独角兽从全球公司雇用前高级员工，将他们的规模扩大到新的高度。虽然没有提及姓名，但 Yoco 的一些新员工包括 Monzo 的前产品副总裁、Paypal 的前产品营销总监和优步的前通讯主管。该公司还任命了一位新董事长，即金融科技独角兽 Pagseguro 的前董事总经理胡安·富恩特斯 (Juan Fuentes)。", "note_en": "In South Africa, these businesses contribute around one-third of the country’s GDP. Last year, the coronavirus pandemic threatened the existence of some of these SMEs, and its effects linger as owners worry about revenue, sales and cash flow.\n Since launching in 2013, South African fintech  Yoco has positioned itself as the go-to platform to access offline payments among merchants in the country. Today, the company is announcing $83 million in Series C funding to scale offline and online offerings and expand to new markets.\n  Despite South Africa’s high card and mobile penetration rates of over 70%, the country’s SMEs still struggle to accept cards. Yoco’s portable card machines have proved masterful in solving this problem; when TechCrunch  covered the company three years ago after its $16 million Series B raise, it had little over 30,000 merchants using its platform. Now, that number has quintupled.\n  As Yoco grew exponentially in providing offline payments, it built an online offering. After being in beta for a while, the rollout came right on time some days into South Africa’s lockdown in March last year. This way, South African merchants could continue accepting payments on the platform.\n “We want to offer whatever payment methods our merchants need. And we did start in the in-person payment space, focusing on terminals, which was where the biggest demand was,” chief business officer  Carl Wazen said. “But the pandemic, which had a devastating effect on so many businesses that relied on in-person trade, accelerated the need for businesses to accept payments online.”\n During the height of the lockdowns in South Africa, sentiment across SMEs owners on a scale of -100 to 100 dropped to an all-time low of -12 in Q2 2020, according to Yoco’s small business pulse monitor. It has since improved following the easing of the lockdowns, allowing businesses to move more freely and continue in-person payments. As a result, Yoco’s online payments account for a minute part of the transactions made on the platform.\n But that’s not to say people are transacting with cash. In fact, it’s the opposite, according to Wazen. Wazen says one post-pandemic behavior he noticed was that once the lockdown was lifted, people came back to make in-person payments in an accelerated way because they stopped using cash. “Recent consumer behavior shows a shift away from cash, and businesses have to rapidly adapt to this change. This presents a huge opportunity, and it is our mission to support that transition,” he added.\n Earlier this year, chief executive  Katlego Maphai said Yoco was looking to expand its services into other aspects of digital payments. He listed mobile money, QR payments and electronic funds transfer (ETF) as offerings in its pipeline. Wazen corroborated this, but didn’t provide an update about where the company is with these offerings. He did mention, however, that the company is still very much a card-focused payment provider.\n Yoco’s strategy as the foremost card payments provider in South Africa lies in creating access and removing barriers to adopting digital financial services. The company does that by focusing on product capabilities that Wazen claims are the most comprehensive for small and medium businesses. He adds that in terms of market presence, Yoco is also the easiest for merchants to access services through different channels seamlessly.\n “We’ve got a brand that is recognized now. That’s how we win and it’s about staying as focused as possible on that part of the market that, in our opinion, people like other competitors are not focused on enough.”\n South Africa has over 6 million small businesses that still transact only in cash; this provides a huge opportunity for Yoco. According to the company, the number of small businesses that were fully cashless jumped 300% from March to July 2020. Yoco currently serves 150,000 of these businesses and adds over 500 merchants per day. The company claims to be processing more than $1 billion in card payments per year, and in its six years of existence, it has processed over $2 billion in card payments.\n  Yoco has raised a total of $107 million. The company’s Series C investment is the largest of its kind in South Africa and one of the largest for any African fintech (third only to  Flutterwave and  Chipper Cash). Wazen also claims it is the largest by any small business-focused payments platform in the Middle East and Africa.\n Yoco is currently one of the most valuable startups on the continent, and as a fintech startup, it comes as no surprise. The sector continues to dominate startup venture capital funding in Africa while its heavy hitters bring first-time investors to the continent.\n In Yoco’s case, it’s the lead investor in this round,  Dragoneer Investment Group. The fund has famously backed fintech giants like Chime, Klarna, Nubank, Mercado Libre and Square.\n Other investors that participated include new investors Breyer Capital, HOF Capital, The Raba Partnership, 4DX Ventures and TO Ventures; and existing investors Partech, Velocity Capital Fintech Ventures, Orange Ventures and Quona Capital. Current and former executives from global tech companies such as Coinbase, Revolut, Spotify and Gojek took part as well.\n “We couldn’t be more excited to partner with the Yoco team,” Christian Jensen, co-head of private investments at Dragoneer, said in a statement. “At Dragoneer, we look for great teams that are building durable businesses with wonderful economic models, and that is exactly what we’ve found at Yoco. Yoco is already beloved by customers, and the product roadmap that the company is investing behind will drive even more value for merchants. While there is tremendous room for continued growth domestically, the opportunity for Yoco goes well beyond South Africa.”\n There are three core enablers to Yoco’s thriving business, Wazen pointed out. First is its product capabilities, second is its platform and third is its market presence. This investment will be there to accelerate all three. Yoco is transitioning from a pure payment acceptance play into a full financial ecosystem on the product side. The platform play will see Yoco continue to integrate and take advantage of regulatory easing vertically, and Yoco is deepening its market presence in South Africa.\n While Wazen believes Yoco has barely scratched the surface in South Africa, he’s looking forward to replicating its growth in other parts of Africa and the Middle East. With over 100 million SMEs transacting in cash across both regions, Yoco plans to reach at least a million within the next four years.\n To accomplish this, Yoco is increasing its team by 200 people remotely and across its offices in Cape Town and Amsterdam within the next year. The company is also tapping into a current trend that has seen African soonicorns and unicorns hire former top employees from global companies to scale theirs to new heights. While it doesn’t mention names, some of Yoco’s new hires include a former VP of product at Monzo, a former product marketing director at Paypal and a former head of communications at Uber. The company has also brought on board a new chairman, Juan Fuentes, the former managing director of fintech unicorn Pagseguro.", "posttime": "2021-07-27 16:03:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "支付,led,yoco", "title": "南非支付初创公司 Yoco 筹集了由 Dragoneer 领投的 8300 万美元 C 轮融资", "title_en": "\n\t\t\t\tSouth African payments startup Yoco raises $83M Series C led by Dragoneer\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/south-african-payments-startup-yoco-raises-83m-series-c-led-by-dragoneer/", "via": "", "real_tags": ["支付", "led", "yoco"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069974, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "完成 CAPTCHA 证明您是一个人，并让您可以临时访问网络资产。如果您使用个人连接（例如在家），您可以在您的设备上运行防病毒扫描，以确保它没有感染恶意软件。如果您在办公室或共享网络中，您可以要求网络管理员在整个网络中运行扫描以查找配置错误或受感染的设备。", "note_en": "Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.\n  If you are on a personal connection, like at home, you can run an anti-virus scan on your device to make sure it is not infected with malware.\n  If you are at an office or shared network, you can ask the network administrator to run a scan across the network looking for misconfigured or infected devices.", "posttime": "2021-07-27 15:55:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,驱动力,growth,感染", "title": "作为经济驱动力的美国人口增长停滞不前", "title_en": "U.S. Population Growth, an Economic Driver, Grinds to a Halt", "transed": 1, "url": "https://archive.ph/GsNcf", "via": "", "real_tags": ["美国", "驱动力", "growth", "感染"]}, {"category": "", "categoryclass": "", "imagename": "3878eae83a677de05b12902d8d537938.png", "infoid": 1069973, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的大新闻：由创建 Matrix 的团队创立的初创公司 Element 刚刚筹集了 3000 万美元的 B 轮资金，以进一步加速 Matrix 的开发并改进 Element，旗舰 Matrix 应用程序。该轮融资由我们在 Protocol Labs 和 Metaplanet 的朋友领投，Metaplanet 基金由 Jaan Tallinn（Skype 和 Kazaa 的联合创始人）创立。 Protocol Labs 和 Metaplanet 都出色地参与了我们的去中心化通信任务，您真的无法要求更好的资金来源来帮助将 Matrix 提升到一个新的水平。感谢您相信 Matrix 并领导 Element 的最新资金！您可以在 Element 博客上从 Element 的角度阅读有关它的所有内容，但可以说这对于整个 Matrix 生态系统来说是一个巨大的新闻。除了改造 Element 应用程序，在 Matrix 方面，这意味着现在有具体的资金保证：完成 P2P Matrix 的构建并使其上线（包括完成 Dendrite，因为我们的 P2P 工作建立在 Dendrite 上！）所有正常的日常工作都在以下方面进行：许多姗姗来迟的有趣点点滴滴（是的，自定义表情符号，我们正在看着你）。如果您想知道 Protocol Labs 的投资是否意味着我们将看到 IPFS 和 Matrix 之间更多的重叠，那么是的 - 在技术上这样做有意义的地方，我们希望更紧密地合作；例如在我们的 P2P 工作中与 libp2p 团队合作（我们仍然需要正确地尝试 gossipsub！），或者给 MSC2706 一些关注。但是，短期内没有计划在 Matrix 或 Element 中使用加密货币激励措施。所以，激动人心的时刻即将到来！我们非常感谢多年来一直支持 Matrix 的每个人——尤其是我们的 Patreon 支持者，他们的捐款为所有 matrix.org 基础设施付费，同时鼓励其他人打开支票簿； Element 现有投资者（尤其是 Notion 和 Automattic，本轮再次进入）；所有大规模的 Matrix 部署都有效地将 Matrix 变成了一个行业（你好 Gematik！） - 以及所有曾经运行过 Matrix 服务器、贡献代码、使用规范制作他们自己的 Matrix 驱动的创作，或者只是在 Matrix 上聊天的人。\n不用说，如果没有你，Matrix 就不会存在：如果不是所有支持它的人，协议和网络早就失效了（matrix.org 服务器现在可以在网络上看到超过 3550 万可寻址用户！）-和同时社区和核心团队不断增加的能量相结合，使协议以前所未有的速度向前推进。我们将尽一切努力成功创建期待已久的开放网络安全通信层，我们期待 Element 的大量新资金直接用于核心 Matrixdevelopment :)", "note_en": "Big news today: Element, the startup founded by the team who created Matrix,just raised $30M of Series B funding in order to further accelerate Matrixdevelopment and improve Element, the flagship Matrix app. The round is led byour friends at  Protocol Labs and  Metaplanet,the fund established by Jaan Tallinn (co-founder ofSkype and Kazaa). Both Protocol Labs and Metaplanet are spectacularly onboard our decentralised communication quest, and you couldn&#39;t really ask fora better source of funding to help take Matrix to the next level. Thank youfor believing in Matrix and leading Element&#39;s latest funding!\n You can read all about it from the Element perspective over at the Element Blog,but suffice it to say that this is enormous news for the Matrix ecosystem as awhole. In addition to transforming the Element app, on the Matrix side thismeans that there is now concrete funding secured to:\n finish building out  P2P Matrixand get it live (including finishing Dendrite, given our P2P work builds on Dendrite!)\n Obviously this is in addition to all the normal business-as-usual work goingon in terms of:\n lots of little long-overdue fun bits and pieces (yes, custom emoji, we&#39;re looking at you).\n If you&#39;re wondering whether Protocol Labs&#39; investment means that we&#39;ll beseeing more overlap between  IPFS and Matrix, then yes -where it makes tech sense to do so, we&#39;re hoping to work more closelytogether; for instance collaborating with the libp2p team on our P2P work(we still need to experiment properly with gossipsub!), or perhaps giving MSC2706some attention. However, there are no plans to use cryptocurrency incentivesin Matrix or Element any time soon.\n So, exciting times ahead! We&#39;d like to inordinately thank everyone who hassupported Matrix over the years - especially our Patreon supporters, whosedonations pay for all the matrix.org infrastructure while inspiring others toopen their cheque books; the existing investors at Element(especially Notionand Automattic, who have come in again on this round); all the large scaleMatrix deployments out there which are effectively turning Matrix into anindustry (hello  gematik!) -and everyone who has ever run a Matrix server, contributed code, used thespec to make their own Matrix-powered creation, or simply chatted on Matrix.\n Needless to say, Matrix wouldn&#39;t exist without you: the protocol and networkwould have fizzled out long ago were it not for all the people supporting it(the matrix.org server can now see over 35.5M addressible users on thenetwork!) - and meanwhile the ever-increasing energy of the community and thecore team combines to keep the protocol advancing forwards faster than ever.\n We will do everything we possibly can to succeed in creating the long-awaitedsecure communication layer of the open Web, and we look forward to largeamounts of Element&#39;s new funding being directed directly into core Matrixdevelopment :)", "posttime": "2021-07-27 15:54:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "element,matrix", "title": "Element 筹集了 3000 万美元以推动 Matrix", "title_en": "Element raises $30M to boost Matrix", "transed": 1, "url": "https://matrix.org/blog/2021/07/27/element-raises-30-m-to-boost-matrix", "via": "", "real_tags": ["element", "matrix"]}, {"category": "", "categoryclass": "", "imagename": "72bb04e8035c67cf290c5320fe04a72c.png", "infoid": 1069971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Peppy 是一个解决这些问题的 B2B 数字健康平台，现在已经筹集了 660 万英镑/1000 万美元的 A 轮融资，由 Felix Capital 领投，之前的投资者包括 Outward VC、Seedcamp 和 Hambro Perks 也参与其中。 Peppy 有点像“在您需要巴比伦健康之前的巴比伦健康”。该公司表示，它在个人需要看医生之前为他们提供专家主导的支持。这家初创公司由联合创始人 Evan Harris、Max Landry 和 Mridula Pore 于 2018 年在伦敦创立，致力于解决重要的生活和家庭时刻：更年期、生育、怀孕和早育。它为企业客户群提供服务，然后将 Peppy 纳入其员工健康计划，使其能够收购英国的一些大型雇主，并在过去 12 个月内按月增长 20% .客户包括法国巴黎银行、桑坦德银行、DFS、Wickes、NHS 信托、谢菲尔德大学。这家初创公司正在敞开大门：更年期女性是英国增长最快的人群，大多数人表示她们的工作受到了负面影响，但是——这是关键的一点，她们宁愿不和她们谈论这件事直线经理。 Peppy 说，这是他们对公司的最大卖点之一，现在可以解决问题并帮助员工更轻松地重返工作岗位。与其他远程医疗产品一样，也有一些功能，例如通过安全的移动应用程序访问专家、即时消息、群聊、视频咨询、现场活动、循证文章、视频和程序。此外，用户可以加入遇到类似挑战的人的社区。 Peppy 的联合创始人 Mridula Pore 说：“大流行告诉我们，雇主不能再只谈论支持员工的健康和福祉，他们必须采取行动。越来越多的领先企业转向我们来提供他们的员工真正需要的支持——不是一刀切的解决方案，而是值得信赖的、个性化的并由专家提供的支持。我们仍处于 Peppy 可能的表面。”\nFelix Capital 的投资者 Susan Lin 表示：“自 Felix 成立以来，‘对美好生活的渴望’一直是一个核心主题，我们相信数字健康和保健解决方案有很大的机会来改善这一点。 Peppy 处于三大市场趋势的前沿，我们相信它的定位是成为一个定义品类的品牌。首先，有针对性的员工福利大幅增长，这是由于人们越来越意识到这些福利在提高士气、生产力和保留率方面的重要性。其次，对更便捷的医疗保健方式的需求，COVID-19 进一步加速了这一需求。最后，需要更加个性化的解决方案，尤其是在更年期和早育等关键生命阶段。”在接受 TechCrunch 采访时，Pore 扩展了这个问题：“今天，人们的选择是去看他们的 GP/MP。他们可能很幸运，有一位了解很多问题的全科医生可以提供患者所需的支持。我们知道，很多女性没有得到她们需要的支持，她们受苦受难，她们挣扎着，她们不好意思与她们的经理谈论正在发生的事情。他们糊里糊涂，担心因为“女性问题”而被解雇。一些女性放弃了。所有的调查都表明，人们要么改变工作安排，做出不同的决定，要么辞职。这让雇主很头疼，我们知道新手父母也会遇到同样的情况。”她补充说：“我们已经看到了真正的潮汐变化，尤其是在过去两年中，我认为 COVID 大大加快了公司将更年期政策纳入直线经理培训的速度。但是这些都没有真正解决个人的需求，因为最终他们仍然去找他们的全科医生，他们又回到了原点。因此，我们与 Pepe 合作的目的是让他们可以接触到我们计划中的护士和顾问，这样他们就可以获得信息，了解他们的医疗和非医疗选择，获得他们需要的信息，并且为他们寻找正确的选择，尝试他们，他们会在几个月内获得支持，因为我们知道它会随着时间的推移而上下起伏，而且您知道每个人的健康历程都会发生变化。她告诉我，技术解决方案意味着 Peppy 允许人们“通过适合他们的个性化方式和便利的方式与人类专家联系，这样他们就可以获得子女抚养费，他们可以获得视频咨询，他们将获得量身定制的内容他们，他们可以参加与他们相关的主题的现场会议。这可以是从更年期的基本知识到您的性生活的任何事情。您可以根据自己的时间，在短时间内进行，或者如果需要，进行 45 分钟的电话咨询。”", "note_en": "Peppy, a B2B digital health platform addressing just these concerns, has now raised a £6.6M/$10M Series A funding round led by Felix Capital, with previous investors including Outward VC, Seedcamp, and Hambro Perks, also participating.\n Peppy is a little like a ‘Babylon Health before you need Babylon Health’. The company says it provides expert-led support to individuals before they need to see a doctor.\n  Founded in London in 2018 by co-founders Evan Harris, Max Landry, and Mridula Pore, the startup address major life and family moments: menopause, fertility, pregnancy, and early parenthood.\n It offers its services to a corporate customer base, which then incorporates Peppy into its employee health programs, enabling it to acquire some large employers in the UK and grow – it says – by 20 percent month-on-month for the past 12-months. Customers include BNP Paribas, Santander, DFS, Wickes, NHS trusts, the University of Sheffield.\n The startup is pushing at an open door: Women of menopausal age are the fastest-growing demographic in the UK, and most say their work is negatively impacted, but – and here’s the crucial bit, they’d rather not talk about it to their line manager. Peppy says this is one of their biggest selling points into companies, which can now address the problem and help employees back to work more easily.\n Just as with other telemedicine products, there are features such as access experts via a secure mobile app, with instant messaging, group chat, video consultations, live events, evidence-based articles, videos and programs. Furthermore, users can join a community of people who are experiencing similar challenges.\n Mridula Pore, Co-Founder of Peppy, said: “The pandemic has shown us that employers can’t just talk about supporting their employees’ health and wellbeing anymore, they have to take action. More and more leading businesses are turning to us to provide the support their people really need – not a one-size-fits all solution, but support that is trustworthy, personalized, and delivered by experts. We’re still at the surface of what is possible for Peppy.”\n Susan Lin, Investor at Felix Capital, said: “Since Felix started, ‘aspiration for a better life’ has been a core theme and we believe in the strong opportunity for digital health and wellness solutions to improve this. Peppy is at the forefront of three huge market trends and we believe is positioned to become a category-defining brand. First, massive growth in targeted employee benefits, driven by increasing awareness of the importance these have in boosting morale, productivity, and retention. Second, demand for much more convenient ways to access healthcare, which has been further accelerated by COVID-19. And finally, a need for much more personalized solutions, especially in critical life stages such as menopause and early parenthood.”\n Speaking to TechCrunch, Pore expanded on the problem: “Today, people’s alternative is to go to their GP/MP. They may be lucky, have a GP who knows a lot about the issues to offer the support the patient needs. We know that a lot of women aren’t getting the support they need, they suffer, they struggle, they’re embarrassed to talk to their manager about what’s going on. They muddle through and they’re worried about being fired because for ‘women’s problems’. Some women quit. All the surveys suggest that people either switch their working arrangements, make different decisions or quit. It’s a big headache for employers, and we know the same thing happens for new parents.”\n She added: “We’ve seen a real tidal change, especially in the last two years and I think COVID has massively accelerated companies putting menopause policy into line manager training. But none of those really address what the individual needs are because ultimately they still go to their GP and they’re back at square one. And so what we’re doing with Pepe is giving them access to our nurses and counselors on our programs, so they can get informed, educated on what their options are, medical and nonmedical, have the information they need to be able to go and seek out the right options for them, try them and they get that support over months, because we know that it will go up and down over time and you know everyone’s health journey evolves.”\n She told me that the tech solution means Peppy allows people to connect to human experts “through the way that suits them in a personalized way and convenience so they can get child support, they can get video consultations, they’ll get content that’s tailored for them, they can join in live sessions on topics that are relevant for them. That can be anything from the basics of menopause, to your sex life. You can do it on your own time, in short bursts, or if you need it, for a 45-minute phone consultation.”", "posttime": "2021-07-27 15:16:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "更年期,led,获得", "title": "Peppy 是一个 B2B 更年期、生育健康平台，筹集了 1000 万美元的 A 轮融资，由 Felix Capital 领投", "title_en": "\n\t\t\t\tPeppy, a B2B health platform for menopause, fertility, raises $10M Series A led by Felix Capital\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/2182193/", "via": "", "real_tags": ["更年期", "led", "获得"]}, {"category": "", "categoryclass": "", "imagename": "5ed7d430425ff04c0e741c07d6ce8d30.jpg", "infoid": 1069969, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Element 在 B 轮融资中获得了 3000 万美元。部分资金将用于扩展其技术，以继续迎合已经使用它的大型组织的用例。其中包括覆盖约 550 万公务员的法国政府； Dataport（正在将其纳入德国的教育和公共管理系统）；该公司表示，BWI 提供德国武装部队使用的通信系统——总共约有 10 次政府参与。 Element 的首席执行官兼开源非个人资料 Matrix 协议的技术联合创始人 Matthew Hodgson 也表示，其中一些将用于继续投资公司的点对点架构，以消除对服务器的任何需求。第三个投资领域将是建立公司的分散式语音和视频会议服务。 “这将是安全方面的变革，”他在接受采访时说。今天的 Element 可用作内部部署系统或基于云的平台。这家初创公司表示，大多数公共部门客户选择前者，而私营部门客户则选择后者。过去 12 个月，云收入增长了 300%，虽然该公司没有透露实际收入有多少，但这表明 Element 正在增长（另一个现在接受资金的原因，尽管作为联合创始人 Amandine Le Pape 指出，它不需要它）。这一轮包括来自 Protocol Labs（libp2p、IPFS 和 Filecoin 背后的开源研发实验室）和 Metaplanet（由 Skype 联合创始人 Jaan Tallinn 设立的基金）的投资。 Automattic 和 Notion——过去的投资者——也参与其中。没有披露估值。迄今为止，Element 已筹集了 4800 万美元。 Matrix 是 Element 所基于的非盈利协议，旨在通过创建一个地方来改变互联网的工作方式，在这个地方可以将多个孤立的通信环境集成并参与到一个有凝聚力的单一平台中，并且这些通信反过来可以由组织它的实体“拥有”。这里的想法是，通过将所有内容整合在一起，可以更轻松地从安全性和实际使用的角度管理这些对话。 Matrix 本身一直在增长，在过去 12 个月中使用率增长了 190%，现在已达到 75,000 次部署，拥有超过 3500 万“可寻址”用户。这些部署可以在小到 Raspberry Pi 或由政府运行的大型服务器上进行。但需要明确的是，“活跃”的数量远小于可寻址用户。虽然 Matrix，更不用说 Element，无法“看到”其他人如何使用 Matrix（这是政府喜欢的安全优势之一），但霍奇森指出，在其自己的服务器上有 120 万活跃用户。\nElement - 最初被称为 Riot - 被设定为一种 Slack/Discord 竞争对手，它是 Matrix 之上的本地消息传递平台，在那里捕获已经使用该协议做其他事情的观众，为他们提供干净和安全的替代方案在只有少数平台控制着世界上大部分消息传递数据的时代。 “我们开发消息传递技术已经超过 15 年了，”Le Pape 说。 “让几个玩家[支配]并保留每个人的数据作为人质，这感觉很疯狂。这是为了打开任何人的交流。这就是我们正在努力解决的问题，数据主权。”在这方面，Element（和 Matrix）处于一个更大的技术趋势的核心，该领域的一些最聪明的人正在考虑这一切如何运作的默认值，已经决定了一个替代方案，一个不那么集中的随着数据变得更有价值，通信渠道变得越来越重要，这种方法必须成为更大等式的一部分。 “互联网通信协议已成为人类的基础。今天，大多数消息传递发生在变幻无常的专有集中围墙花园中，这些花园让我们受制于他们的短期业务前景，”Protocol Labs 首席执行官 Juan Benet 在一份声明中说。 “Matrix 是希望的灯塔：一个开放的网络，用于安全、分散的通信，以健全的互联网基础设施原则构建。 Element — 产品和公司 — 赋予组织控制权、所有权，并为他们的所有对话提供出色的用户体验。”虽然市场上还有许多其他加密消息平台正在被大规模采用——包括 Telegram、Signal，甚至在某种程度上 Facebook 的 WhatsApp——但 Element（和 Matrix 的）早期采用者一直是大型组织。然而，随着 Element 引擎 Matrix 也在其 Blue Sky 去中心化平台工作中与 Twitter 等公司进行早期合作，这可能会给 Element 带来除早期采用者之外的另一次用户增长。但正如云层有一线希望，晴朗的前景也会投下阴影……与 Telegram 和 Rocket.chat 等其他去中心化通信平台一样，端到端加密可以双向切割：它可以帮助防止通信被黑客入侵，但是它还可用于在计划恶意活动时逃避检测。 Matrix（以及默认情况下的 Element）一直在探索后门进入加密系统的替代方案，这是政府正在考虑解决此问题的一种途径，其论点是强制一个只会将不良行为者转移到另一个。最终，尽管存在这些疑虑和存在的问题，但这里的投资和 Element 的使用是对坚持去中心化方向的投票。\n“当交流集中化时，它就会成为一个非常有吸引力的滥用目标；无论是通过宣传、监视、审查还是更糟的方式，”Metaplanet 的塔林说。 “消费者需要从监视资本主义中解脱出来，组织需要一种安全的中立沟通方式。 Matrix 是提供缺失的通信层的最先进平台。”", "note_en": "Element has picked up $30 million in a Series B round of funding. Some of the funding will be used to expand its technology to continue catering to use cases among the large organizations already using it. They include the French government covering some 5.5 million civil servants; Dataport (which is incorporating it into Germany’s education and public administration systems); and BWI, which supplies the communications system used by the German armed forces — in all, some 10 government engagements, the company said.\n Matthew Hodgson, Element’s CEO and the technical co-founder of the open source, non-profile Matrix protocol, also said that some will be used to continue investing in the company’s peer-to-peer architecture to eliminate any need for servers. And a third area of investment will be building out the company’s decentralized voice and videoconferencing services.\n  “It will be transformational in terms of security,” he said in an interview.\n Element today is available as an on-premise systems or a cloud-based platform. Most public sector customers choose the former, and private sector ones opt for the latter, the startup said. Cloud revenues grew 300% in the last 12 months, and although the company didn’t disclose how much that is in actual money, it’s a sign that Element is growing (another reason for taking funding now, even though as co-founder Amandine Le Pape noted, it didn’t need it).\n This round includes investments from  Protocol Labs (the open-source R&amp;D lab behind libp2p, IPFS and Filecoin) and  Metaplanet (a fund set up by Jaan Tallinn, co-founder of Skype).  Automattic and  Notion —  past investors — are also participating. No valuation is being disclosed. Element has raised $48 million to date.\n Matrix, the not-for-profit protocol on which Element is based, was built to shake up how the internet worked by creating a place where multiple, siloed communications environments could be integrated and engaged with in a cohesive, single platform, and those communications in turn can be “owned” by the entity organizing it. The idea here is that by bringing it all together, it’s easier to manage those conversations from the perspectives of security and practical use.\n Matrix has been growing in its own right, with usage up 190% in the last 12 months, now up to 75,000 deployments with over 35 million “addressable” users. Those deployments can be on something as small as a Raspberry Pi or a giant server run by a government. But to be clear, “active” is a significantly smaller number than addressable users. While Matrix, much less Element, cannot “see” how others are using Matrix (that is one of the security advantages that governments like), Hodgson notes that on its own servers there are 1.2 million active users.\n Element — which  originally had been called Riot — was set out as a kind of Slack/Discord rival that was a native messaging platform on top of Matrix, there to capture audience already doing something else with the protocol to give them a clean and secure alternative at a time when only a handful of platforms control the majority of the world’s messaging data.\n “We’ve been building messaging technology for more than 15 years,” Le Pape said. “It just felt crazy that you have a few players [dominating] and keeping everyone’s data hostage. This is to open anyone’s communication. That is what we are trying to fix, data sovereignty.”\n In the regard, Element (and Matrix) sit at the heart of a much bigger trend in technology, where some of the brightest minds in the field are reckoning with the defaults of how it all works, have decided that an alternative, a less centralized approach, must be a part of the bigger equation as data becomes more valuable and communications channels only become increasingly essential.\n “Internet communication protocols have become fundamental for humanity. Today, most messaging happens over fickle proprietary centralized walled gardens who hold us hostage to their short-term business outlook,” said Juan Benet, CEO of Protocol Labs, in a statement. “Matrix is a beacon of hope: an open network for secure, decentralised communication, built with sound internet infrastructure principles. Element — both product and company — empowers organizations with control, ownership, and a great user experience for all their conversations.”\n While there are a number of other encrypted messaging platforms on the market that are seeing mass adoption — they include Telegram, Signal and even to some extent Facebook’s WhatsApp — Element (and Matrix’s) early adopters have been large organizations. However, with Matrix, the engine underpinning Element, also doing early work with the likes of Twitter on its  Blue Sky decentralized platform efforts, that could potentially give Element another boost of users, beyond those early adopters.\n But just as clouds have silver linings, so too do sunny outlooks cast shadows… As with other decentralized communications platforms like Telegram and  Rocket.chat, end-to-end encryption can cut both ways: it can help keep communications from being hacked, but it might also be used to evade detection when planning something malicious. Matrix (and by default Element) has been exploring  alternatives to backdoors into encrypted systems, which is one route that governments are considering to fix this, the argument being that mandating one will simply move the bad actors to another.\n Ultimately, the investment here, and the usage of Element, is a vote in the direction of sticking with decentralization despite those misgivings and existing issues.\n “When communication is centralised it becomes a very appealing target for abuse; whether that’s through propaganda, surveillance, censorship or worse,” said Metaplanet’s Tallinn. “Consumers need rescuing from surveillance capitalism, and organisations need a secure neutral way to communicate.  Matrix is the most advanced platform to provide that missing communication layer.”", "posttime": "2021-07-27 15:15:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "应用,messaging,element", "title": "Element 是一款基于去中心化 Matrix 协议的消息应用，融资 3000 万美元", "title_en": "\n\t\t\t\tElement, a messaging app built on the decentralized Matrix protocol, raises $30M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/element-a-messaging-app-built-on-the-decentralized-matrix-protocol-raises-30m/", "via": "", "real_tags": ["应用", "messaging", "element"]}, {"category": "", "categoryclass": "", "imagename": "c44271c89e4c0143a135eda40b6c7551.jpg", "infoid": 1069968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "B 轮融资由 Insight Partners 领投，Stride.VC、Chalfen Ventures 和 SAP.iO 基金（SAP 的一部分）也参与其中。这笔资金将用于继续围绕 Sedna 的核心功能构建更多数据科学，目的是随着时间的推移进入更广泛的垂直领域。目前其主要业务在供应链参与者领域，其客户包括嘉能可、诺顿和邦吉。金融等领域的其他客户包括新银行 Starling。总部位于伦敦的 Sedna 没有透露估值。 Sedna 的首席执行官兼创始人比尔·多比 (Bill Dobie) 表示，公司的想法是根据他自己的经验产生的。 “我花了数年时间构建软件来帮助用户提高工作效率，但无论我们构建什么，我们都没有真正减少人们的工作量。”原因是：被称为电子邮件的磨盘，其源源不断、未经请求的入站消息，其中一些（刚好足以不容忽视）可能很重要。 “真正让我印象深刻的是将项目移出和移入电子邮件所花费的时间，”他谈到由此产生的“待办事项”时说。因此，Sedna 旨在“阅读”电子邮件并为它们提供更多背景和方向。当涉及到人们的收件箱时，它的系统会删除重复的操作项并从本质上提高点击率：里面的内容更有可能是您真正需要看到的内容。它以非常快的速度完成。 “我们的主要价值在于我们经营的庞大规模，”多比说。 “我们在亚秒级响应时间内阅读了数百万甚至数十亿条消息。”事实上，虽然我们中的许多人没有收到“数百万”电子邮件，但有一个消息世界需要阅读更多。例如，想想基于物联网的诊断将产生的数据量。 “智能”收件箱肯定已经成为消费者的东西——尽管可以说没有一个像你希望的那样工作。 Sedna 值得注意的是它如何将其特定算法调整到特定的垂直领域，让他们在特定组织的内容和工作实践方面变得更加智能。目前，这项工作是由 API 框架驱动的，其中包含“低代码”格式的元素，让人们可以塑造自己的 Sedna 体验。随着时间的推移，我们的目标是让这一切变得更加容易。现在是一个 API 驱动的框架，我们正在使用一些低代码，但主要是它的 SAP 或运输或交易系统，它了解正在进行的交易，然后 Sedna 使用决策树进行分类。 Sedna 可能增长的另一个领域是它如何处理它摄取的信息。目前，该公司的技术可以由客户互连，然后将某些工作移交给 RPA 系统以及特定人员。在那里开发一些第二阶段的软件有一条明显的途径——或者，这表明像 Sedna 这样的东西可能会被一个大型 RPA 玩家抢购或复制。\nInsight Partners 的负责人 Rebecca Liu-Doyle 在一份声明中说：“Bill 开始重新构想电子邮件最容易损坏、因此最难修复的地方——管理大量数据和复杂流程的大型团队。” “今天，Sedna 的强大之处在于它能够为任何收件箱体验带来极大的速度、简单性和愉悦感，无论规模或复杂程度如何。我们很高兴与 Sedna 团队合作，因为他们将继续为全球供应链及其他领域的团队提供更智能的数字通信。” Liu-Doyle 在这轮融资中加入了董事会。 SAP 是这一轮的战略投资者，因为 Sedna 有可能帮助其客户在使用 SAP 系统时提高生产力。 “SAP 继续与 SEDNA 合作，为 SAP 客户创造价值。 SAP 全球运输解决方案负责人 Stefan Sauer 在一份声明中表示，将复杂信息转化为更简单的智能协作的能力已成为许多 SAP 客户日益重视的问题。", "note_en": "The funding, a Series B, is being led by Insight Partners, with Stride.VC, Chalfen Ventures and the SAP.iO fund (part of SAP) also participating. The funding will be used to continue building out more data science around Sedna’s core functionality, with the aim of moving into a wider set of verticals over time. Currently its main business is in the area of supply chain players, with Glencore, Norden, and Bunge among its customers. Other customers in areas like finance include the neobank Starling. London-based Sedna is not disclosing valuation.\n Bill Dobie, Sedna’s CEO and founder, said the idea for the company was hatched out of his own experience. “I spent years building software to help users be more productive, but no matter what we built we never really reduced people’s workload.” The reason: the millstone that is called email, with its endless, unsolicited, inbound messages, some of which (just enough not to ignore) might be important. “What really struck me was how long it spent to move items out of and into email,” he said of the “to-do’s” that arose out of there.\n  Out of that, Sedna was built to “read” emails and give them more context and direction. Its system removes duplicates of action items and essentially increases the strike rate when it comes people’s inboxes: what’s in there is more likely to be what you really need to see. And it does so at a very quick speed.\n “Our main value is the sheer scale at which we operate,” Dobie said. “We read millions or even billions of messages in sub second response times.” Indeed, while many of us are not getting “millions” of emails, there is a world of messaging out there that needs reading beyond that. Think, for example, of the volume of data that will be coming down the pike from IoT-based diagnostics.\n “Smart” inboxes have definitely become a thing for consumers — although arguably none work as well as you wish they did. What’s notable about Sedna has been how it’s tuned its particular algorithms to specific verticals, letting them get smarter around the kind of content and work practices in particular organizations.\n Right now the work is driven by an API framework, with elements of “low code” formatting to let people shape their own Sedna experiences. The aim will be to make that even easier over time. AN API driven frame work right now, some low code we’re heading into, but mostly its SAP or shipping or trading system that understands the transaction under way, then Sedna uses a decision tree to categories.\n Another area where Sedna might grow is in how it handles the information that it ingests. Currently, the company’s tech can be interconnected by a customer to then hand off certain work to RPA systems, as well as to specific humans. There is an obvious route to developing some of the second stage of software there — or alternatively, it’s a sign of how something like Sedna might get snapped up, or copied by one of the big RPA players.\n “Bill started reimagining email where it was most broken and therefore hardest to fix—large teams managing huge volumes and complicated processes,” said Rebecca Liu-Doyle, principal at Insight Partners, in a statement. “Today, Sedna’s power is in its ability to introduce immense speed, simplicity, and delight to any inbox experience, regardless of scale or complexity. We are excited to partner with the Sedna team as they continue to make digital communication more intelligent for teams in global supply chain and beyond.” Liu-Doyle is joining the board with this round.\n SAP is a strategic investor in this round, as Sedna potentially helps its customers be more productive while using SAP systems. “SAP continues to partner with SEDNA to deliver value to SAP customers. The ability to turn complex information into simpler intelligent collaboration has been a growing priority for many SAP customers,” said Stefan Sauer, global transport solutions Lead at SAP, in a statement.", "posttime": "2021-07-27 15:15:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,action,sedna", "title": "Sedna 为一个平台提供 3400 万美元的资金，该平台解析大量电子邮件和聊天以自动执行其中的操作项", "title_en": "\n\t\t\t\tSedna banks $34M for a platform that parses large volumes of email and chat to automatically action items within them\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/sedna-banks-34m-for-a-platform-that-parses-large-volumes-of-email-and-chat-to-automatically-action-items-within-them/", "via": "", "real_tags": ["平台", "action", "sedna"]}]