[{"category": "", "categoryclass": "", "imagename": "e2643f1a2b80814a919f14ac212d0a41.jpg", "infoid": 1012035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NVIDIA非常友好地为我的YouTube频道提供了泰坦RTX。这个视频展示了我计划和建造一台基于…的计算机的过程。", "note_en": "NVIDIA was kind enough to provide my YouTube channel with a TITAN RTX. This video shows the process that I went through to plan and build a computer based on...", "posttime": "2020-07-15 22:45:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学习,ryzen,计划", "title": "建造价值5000美元的机器学习工作站/Tiitan RTX和Ryzen ThreadRipper", "title_en": "Building a $5k Machine Learning Workstation/Tiitan RTX and Ryzen ThreadRipper", "transed": 1, "url": "https://www.youtube.com/watch?v=iahQOQZVdog", "via": "", "real_tags": ["学习", "ryzen", "计划"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编辑器如何处理客户端会话？每个用户都有一个Lisp进程。当有人登录编辑他们的网站时，我们会启动一个新进程，并将他们的所有数据加载到内存中。从那时起，他们就这个过程进行了持续的对话。因为所有内容都已经加载到内存中，所以我们不必从磁盘读取任何内容或启动进程来响应HTTP请求。我们所要做的就是评估存储在内存中的闭包。您使用的HTTP服务器是什么？起初，编辑器有自己的HTTP服务器，由Robert Morris用Common Lisp语言编写。后来，我们切换到了Apache的一个版本，他破解了这个版本，以便与Lisp进行交流。你用的是什么Lisp？克利斯普。你有没有使用真正的延续来拯救州政府？不，我们使用宏在Common Lisp中伪造它们，如关于Lisp中所述。你用的是什么数据库？我们没有用过一个。我们只是把所有东西都储存在文件里了。Unix文件系统非常擅长不丢失数据，特别是当您将文件放在Netapp上时。认为基于Web的应用程序是连接到数据库的接口是一个常见的错误。桌面应用程序不仅仅是连接到数据库的接口；基于Web的应用程序有什么不同呢？困难的部分不是存储数据的位置，而是软件做什么。当我们在做Viaweb的时候，我们因为没有使用数据库，而使用运行FreeBSD的廉价Intelbox作为服务器，而受到了风险投资家和行业分析师等伪技术人员的强烈抨击。但当我们被雅虎收购时，我们发现他们也只是把所有的东西都存储在文件中--而且他们所有的服务器也都是运行FreeBSD的廉价英特尔盒子。(在泡沫期间，甲骨文过去常常在甲骨文软件上投放广告，称雅虎然。我觉得这很难相信，所以我四处打听，结果雅虎会计部门用的是甲骨文(Oracle)。)。你的联合创始人是不是写了蠕虫的罗伯特·莫里斯现在是麻省理工学院的教授？是。你从哪里获得风险投资的？我们从几个私人投资者那里拿到了钱，他们在业内被称为天使。我们的投资者相当认真，几乎都是风投公司，但他们实际上并不是知名的风投公司。我们做Viaweb的成本非常低。我们总共花了大约200万美元，当我们被收购时，我们刚刚达到收支平衡，所以我们不会花太多钱。Viaweb&34；是怎么发音的？官方的政策是，你可以说vee-a-web或vie-a-web。我们都使用前者，但其他所有人，包括雅虎的员工，似乎都更喜欢后者。你会有什么不同的做法？严格来说，不是很多。我认为我们应该做的最主要的事情是我们自己开了一家网店。我们用编辑器制作了我们自己的网站，所以我们很有动力把它做得很好。但是我们只能理解二手软件中的电子商务部分。", "note_en": "How did the editor handle client sessions?  There was one Lisp process for each user. When someone loggedin to edit their site, we&#39;d start up a new process and load alltheir data into memory. From that point they had an ongoingconversation with that process.  Because everything was already loaded into memory, we neverhad to read anything from disk or start up a process torespond to an HTTP request. All we had to do was evaluatea closure stored in memory.   What did you use for an HTTP server?  At first the editor had its own HTTP server, written in Common Lispby Robert Morris. Later we switched to a version ofApache that he hacked to talk to Lisp.   What Lisp did you use?   Clisp.   Did you use real continuations to save state?  No, we used macros to fake them in Common Lisp, as described in On Lisp.   What database did you use?  We didn&#39;t use one. We just stored everything in files. The Unix file system is pretty good at not losing your data, especially if you put the files on a Netapp.  It is a common mistake to think of Web-based apps as interfaces to databases.Desktop apps aren&#39;t just interfaces to databases; why should Web-based appsbe any different? The hard part is not where you store the data, butwhat the software does.  While we were doing Viaweb, we took a gooddeal of heat from pseudo-technical people like VCs and industryanalysts for not using a database-- and for using cheap Intelboxes running FreeBSD as servers. But when we were gettingbought by Yahoo, we found that they also just stored everythingin files-- and all their servers were also cheap Intel boxesrunning FreeBSD.  (During the Bubble, Oracle used to run ads saying that Yahooran on Oracle software. I found this hard to believe, so I asked around.It turned out the Yahoo  accounting department used Oracle.)   Was your co-founder the same Robert Morris who wrote the wormand is now a professor at MIT?  Yes.   Where did you get venture funding?  We got money from several private investors, what are known in thebusiness as &#34;angels.&#34; Our investors were pretty serious,almost VCs, but they weren&#39;t actually brand-name VC firms.  We did Viaweb very cheaply. We spent a total of about $2 million.We were just about breaking even when we got bought, so wewould not have spent too much more.   How was &#34;Viaweb&#34; pronounced?  The official policy was that you could say either vee-a-web or vie-a-web. We all used the former, but everyone else, includingthe people at Yahoo, seemed to prefer the latter.   What would you do differently?  Technically, not much. I think the main thing we should have donethat we didn&#39;t was start some kind of online store ourselves. Weused the editor to make our own site, so we were pretty motivatedto make it good. But we could only understand the e-commercepart of the software second-hand.", "posttime": "2020-07-15 22:45:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "viaweb", "title": "Viaweb常见问题解答", "title_en": "Viaweb FAQ", "transed": 1, "url": "http://www.paulgraham.com/vwfaq.html", "via": "", "real_tags": ["viaweb"]}, {"category": "", "categoryclass": "", "imagename": "4c7d36a785d2a2692d217c5a4005e3e9.png", "infoid": 1012033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科技行业，特别是安全行业，对新来者来说似乎是惊人的压倒性优势，即使作为一个中级的“InfoSec Pro”，人们也似乎有大量的途径和主题可以专注。我们大多数人，特别是初来乍到的人，遇到的问题是我们不知道要关注什么。即使我们找到了一个可以集中精力的话题，我们似乎也会被困在我们可用的巨大资源池中。\n以GitHub储存库AweseHakking(强烈推荐)为例。很多人都知道它的存在。同样是这些人给我发信息，问我从哪里开始，以及如何不被看似有价值的资源的结构化集合完全淹没，但似乎没有解决我们的问题。但是我们到底有什么问题呢？当然不是缺乏资源。为什么尽管我们可以获得开发一项新技能所需的所有资源，但即使我们有时间或可以重新安排时间表来腾出时间，我们也无法做到这一点？也许我们已经忘记了，我们每天面临的分心事情阻碍了我们发挥最大的能力。\n当我们想要学习新东西时，我们都知道这种感觉。我们等待，直到动力从任何地方袭来，然后我们在没有明确方向的情况下修修补补几个小时，查看通知，一旦我们意识到我们没有取得任何进展，我们就灰心丧气，放弃了。附注：如果你等待激励，那你就做错了。根据我的经验，激发动机的公式是从行动开始的，行动激发灵感，激发动机，从而导致行动，然后循环继续下去。\n我们也知道并体验过流动的感觉。当你全神贯注于一项任务的那一刻。你失去了所有的时间感，一切似乎毫不费力地流淌；你忘记了周围的一切，有一种对任务的控制感。心理学家米哈里·齐克森特米哈里(Mihaly Csikszentmihalyi)对这种流畅的感觉描述得最好：\n“最好的时刻通常发生在当一个人的身体或精神被伸展到极限的时候，为了完成一些困难和有价值的事情而自愿努力。”\n为什么这种流动状态看起来如此武断和罕见，就像我们偶然发现的东西？为什么我们不努力创造一种尽可能多的流动状态呢？毕竟，它不仅令人满意，而且非常富有成效，并产生积极的回报。我们很少达到这种状态的原因是我们需要不断地提醒自己，我们生活在一个充满分心的世界里。有时按下暂停按钮也很困难。\n要创造一种流动的状态，一个人必须遵循一定的规则，并通过一个称为深度工作的概念接受刻意的练习。为了产生你力所能及的绝对最好的结果，你需要投入到深入的工作中。培养深入工作的能力的关键是超越善意，增加例行公事，以最大限度地减少从分心状态转换到稳定注意力状态所需的有限意志力。经验法则是，集中注意力而不分心大约需要25分钟才能达到心流状态。如果你每隔20分钟查看一次推特通知，这似乎是无害的，你会阻止你的大脑达到那种状态，从而延长完成任务所需的时间。\n不要犯把生产力和忙碌混为一谈的错误。以看得见的方式做很多事情并不意味着你很有效率。我们所做的大部分都是肤浅的工作：\n肤浅的工作：对认知要求不高的后勤风格的任务，通常是在分心的情况下完成的。这些努力往往不会在世界上创造太多新价值，而且很容易复制。“。\n卡尔·纽波特(Cal Newport)是“深度工作：在分心的世界中专注成功的规则”(Deep Work：Rules for Focus Success in a Diffected World)一书。他认为，如果你在一种强迫性浅薄的状态中花费足够的时间，你就会永久性地降低你执行深入工作的能力。过度使用社交媒体正是他在这里所指的那种强迫性肤浅，但不是唯一的一种。他对深度工作的定义如下：\n“在不受干扰的状态下进行的专业活动会把你的认知能力推向极限。这些努力创造了新的价值，提高了你的技能，而且很难复制。深层次的工作很难，浅层次的工作比较容易，如果你的工作没有明确的目标，围绕浅层工作的看得见的忙碌就会变成自我保护。“。\n刻意的练习不能与分心共存。当你在相关神经元周围形成更多的髓鞘时，你就会在一项技能上变得更好，从而允许相应的电路更轻松、更有效地放电。因此，擅长某件事就是有很好的髓鞘。通过深思熟虑的练习和专注于一项特定的技能，你正在迫使与该技能相关的特定回路一次又一次地孤立地开火。这个重复的过程触发被称为少突胶质细胞的细胞开始将髓磷脂包裹在回路中的神经元周围，这反过来又有效地加强了这一技能。\n好的。这一切都很有道理，但我可以从经验中看出，仅仅知道这些事情并不能让你离目标更近一步。我已经读了一整本关于深度工作的书，当我试图将深度工作落实到我的日常/每周计划中时，我学到的最大的教训是，如果你不仔细计划，并把它养成一个强大的习惯，你将无法发展这项技能，并自动倒退到徒劳无益的修补工作中。毕竟，你的意志力是有限的，当你使用它时，意志力就会耗尽。事实证明，我们每天都有大约4小时的意志力。试图强迫自己最终开始，而拖延恰恰是你的意志力以最没有成效的方式耗尽的地方。如果你有固定的计划或习惯，你就会把意志力留给实际的任务。\n我学到的另一个重要的教训是练习=刻意练习。深思熟虑的练习指的是一种特殊类型的练习，它是有目的的，系统的，并将你的思维扩展到它的极限。常规练习可能包括盲目重复相同的任务，而刻意练习则需要集中注意力，并以提高绩效为具体目标进行。人类大脑的自然倾向是将重复的行为转变为自动习惯。我们重复的任务越多，它就变得越愚蠢。盲目的活动是刻意练习的敌人。行为心理学家詹姆斯·克利尔证实，\n“太多时候，我们认为我们正在变得更好，仅仅是因为我们获得了经验。实际上，我们只是在强化我们目前的习惯，而不是改善它们。“( - )。\n如果我们以正确的方式训练我们的大脑，我们都有能力提高我们在生活的任何领域的表现。“这说起来容易做起来难。我们开门见山吧。深思熟虑的练习不是一种舒适的活动，它需要持续的努力和专注。这基本上是一次又一次失败的过程，因为通过失败，我们知道我们已经超出了我们的极限。以举重为例。你举重直到失败，不得不休息，这正是你的身体学会扩大目前的极限，并准备下次进行这项活动时变得更强壮的地方。强迫自己接受超出你能力范围的挑战。选择一个能迫使你学习新概念和新技术的项目。当你阅读一篇科学论文时，系统地查找你不理解的单词和概念，而不是抱着“反正我一半都看不懂”的态度丢弃它。\n当表现心理学家开始探索是什么将许多不同领域的专家与其他所有人区分开来时，唯一一致的答案是：刻意练习。我们的文化喜欢神童的故事情节，以及专家拥有将他们与其他人区分开来的与生俱来的才华的概念。但在现实中，要掌握一项认知要求很高的任务，需要这种特定形式的练习。只有几个例外是针对天赋的。K.Anders Ericsson在他1993年的论文“故意练习在获得专家绩效中的作用”中引入了刻意练习的概念，他在文中指出：\n“我们否认这些差异是一成不变的，也就是说，这是由于先天天赋造成的。只有少数例外，最引人注目的是身高，是基因规定的。相反，我们认为，专家表演者和正常成年人之间的差异反映了一个终生刻意努力提高特定领域表现的时期。“。\n你需要选择一种适合你具体情况的策略/哲学，因为不匹配会在你的深层工作习惯有机会巩固之前就破坏它。以下是我从“深度工作：在分心的世界中专注成功的规则”一书中摘录的一些策略：\n修道院：“这种哲学试图通过消除或从根本上最小化肤浅的义务来最大限度地提高深度努力。”--长时间地孤立自己，不让自己分心；不允许浅薄的工作。\n双峰模式：“这种哲学要求你分配时间，把一些定义明确的时间用来做深层次的工作，把其余的时间留给其他事情做。”--连续几天(比如周末或周日)只做深度工作，每周至少有一天。\n有节奏的：“这个哲学认为，持续深入工作的最简单方法就是把它们变成一个简单的常规习惯。”--养成每天三到四个小时的习惯，在你的项目中进行深入的工作。\n记者：“只要你能把深度工作安排在你的日程表中，你就能把它安排好。”--不建议你先试一试，因为你首先需要让自己习惯于深度工作。\n就我目前的生活方式而言，我更喜欢在节奏和双峰之间切换。您不一定要放在一个盒子上，但在开发适合您的环境的策略时，您可以使用这些策略作为参考点。\n当然可以。很难事先知道什么会成为“你的事情”，因为我们的兴趣因人而异，只是因为我喜欢ARM开发，并不意味着你会喜欢自己做的事情。\n如果你还没有一条路，选择一项通常有用的技能，或者一项你可能会转化为职业的技能。\n至少尝试30个小时(深入工作！)。一开始你可能不喜欢。不要马上灰心丧气。我们不擅长的事情是可怕的，我们不喜欢做我们不擅长的事情。诀窍是克服最初的挫折感，直到你获得第一次有益的经历。\n把你的30个小时分成7个4小时的课程(加上缓冲)。设定清晰的目标，说明你想通过这个项目实现什么。记住，我们的目标不是在30小时内成为一名大师，而是有效地利用你的时间来学习足够的知识，这样你就可以判断你是想继续学习还是切换到另一门学科。\n使用您的第一个会话执行广泛的信息收集。查看可供您使用的资源，选择那些对完成您选择的项目最有用的资源。如有必要，使用第二次会话设置环境(例如，恶意软件分析的分析环境，包括第一次分析可能需要的所有工具)并定义明确的目标(例如，分析恶意软件x)。重要的是要设定明确的目标，并将它们分成结构化的部分。\n如果你每周完成两次课程，你将在3周内完成。最糟糕的情况是：你意识到你不喜欢它，但你花了30个小时学习一些有挑战性的新东西，否则你就不会学到这些东西。最好的情况：你意识到这实际上很有趣，并且想要继续下去。已经开始了，你克服了最烦人的部分，现在可以快乐地继续进一步发展你的技能了。", "note_en": "The tech industry, especially the security industry, seems outrageously overwhelming to newcomers and even as an intermediate “InfoSec Pro” there seems to be an overwhelming number of paths and topics one can focus on. The problem most of us, especially newcomers, encounter is that we don’t know what to focus on. Even when we find a topic to focus on, we seem to get stuck in the vast pool of resources that are available to us.\n Take the GitHub repository  Awesome Hacking (highly recommended), for example. Many people are aware of its existence. The very same people are sending me messages and asking where to start and how to not be totally overwhelmed by what seems to be a structured collection of valuable resources but doesn’t seem to solve our problem. But what exactly is our problem? It’s certainly not the lack of resources. Why is it, that although we have access to all the resources we need for developing a new skill, we fail to do so, even if we have the time or could rearrange our schedule to make time for it? Perhaps we have forgotten that the distractions we face on a daily basis prevent us from performing to the best of our abilities.\n We all know this feeling when we want to learn something new. We wait until motivation strikes us out of nowhere, then we tinker around for a few hours without a clear direction, checking notifications, and as soon as we realize that we’re not getting anywhere, we get discouraged and give up. Side note: if you wait for motivation, you’re doing it wrong. The formula to induce motivation, in my experience, starts with action, which sparks inspiration, which sparks motivation, which leads to action, and the loop continues.\n We also know and have experienced the feeling of flow. The moment when you’re fully focused on a task. You lose all sense of time, and everything seems to flow effortlessly; you forget everything around you and have a feeling of control over the task. This rewarding feeling of flow is best described by Psychologist Mihaly Csikszentmihalyi:\n “The best moments usually occur when a person’s body or mind is stretched to its limits in a voluntary effort to accomplish something difficult and worthwhile.”\n  Why is it that this state of flow seems so arbitrary and rare, like something that we happen to stumble upon by mere coincidence? Why don’t we strive to create a state of flow as often as possible? After all, it is not only satisfying, but also very productive and yields positive rewards. The reason we rarely reach this state is that we constantly need to remind ourselves that we live in a world full of distractions. And sometimes it is difficult to press the pause button.\n To create a state of flow, one must follow certain rules and embrace deliberate practice through a concept called deep work. In order to produce the absolute best results you’re capable of, you need to commit to deep work. The key to developing the ability for deep work is to move beyond good intentions and add routines and rituals designed to minimize the amount of your limited willpower necessary to transition from a distracted state into a state of stable concentration. The rule of thumb is that it takes approximately 25 minutes of focus without distraction to reach a state of flow. If you’re checking your Twitter notifications every 20 minutes, which seems harmless, you prevent your brain from reaching that state and therefore prolong the time required to complete your task.\n  Don’t make the mistake of confusing productivity with busyness. Doing lots of stuff in a visible manner does not mean you’re being productive. Most of what we do is Shallow Work:\n “Shallow Work: Non-cognitively demanding, logistical-style tasks, often performed while distracted. These efforts tend not to create much new value in the world and are easy to replicate.”\n  Cal Newport is the author of the book  Deep Work: Rules for Focused Success in a Distracted World  (which I highly recommend!) and he argues that if you spend enough time in a state of obsessive shallowness, you permanently reduce your capacity to perform deep work. Social Media overuse is exactly the type of obsessive shallowness he’s referring to here, but not the only one. He defines Deep Work as follows:\n “Professional activities performed in a state of distraction free concentration that push your cognitive ability to their limit. These efforts create new value, improve your skills, and are hard to replicate. Deep work is hard and shallow work is easier and in the absence of clear goals for your job, the visible busyness that surrounds shallow work becomes self-preserving.”\n  Deliberate practice cannot exist alongside distraction. You get better at a skill as you develop more myelin around relevant neurons, allowing the corresponding circuit to fire more effortlessly and effectively. Therefore, to be good at something is to be well myelinated. Through deliberate practice and by focusing on a specific skill, you’re forcing the specific circuit relevant to that skill to fire, again and again, in isolation. This repetitive process triggers cells called oligodendrocytes to start wrapping layers of myelin around the neurons in the circuits, which in turn effectively strengthens the skill.\n Ok. This all makes a lot of sense, but I can tell from experience that simply knowing these things won’t put you any closer to your goal. I’ve read an entire book on Deep Work and the biggest lesson I learned when trying to implement Deep Work into my daily/weekly schedule is that if you don’t plan it carefully and make it a strong habit, you will fail to develop this skill and automatically fall back to unproductive tinkering. After all, you have a finite amount of willpower that becomes depleted as you use it. As it turns out, we all have approximately 4 hours of willpower available each day. Trying to force yourself to finally get started while procrastinating is exactly where your willpower gets depleted in the most unproductive way. If you have a fixed plan, a habit, you save your willpower for the actual task.\n Another important lesson I’ve learned is that practice != deliberate practice. Deliberate practice refers to a special type of practice that is purposeful, systematic, and stretches your mind to its limits. Regular practice might include mindless repetitions of the same task, while deliberate practice requires focused attention and is performed with the specific goal of improving performance. The natural tendency of the human brain is to transform repeated behaviors into automatic habits. The more we repeat a task the more mindless it becomes. Mindless activity is the enemy of deliberate practice. Behavioral psychologist James Clear confirms,\n “ Too often, we assume we are getting better simply because we are gaining experience. In reality, we are merely reinforcing our current habits — not improving them.”\n  We all have the capacity to improve our performance in any area of life if we train our brain in the correct way.  This is easier said than done. Let’s be straight here. Deliberate practice is not a comfortable activity and it requires sustained effort and focus. It is basically the process of failing, over and over again, because through failure we know that we have stretched our limits. Take lifting weights as an example. You lift weights until you fail and have to take a break, which is exactly where your body learns to expand its current limits and prepare to be stronger the next time you perform this activity. Force yourself to take on challenges that are beyond your limits. Pick a project that forces you to learn new concepts and techniques. When you read a scientific paper, systematically look up the words and concepts you don’t understand rather than discarding it with a “I don’t understand half of it anyway” attitude.\n  When performance psychologists began to explore what separates experts, in many different fields, from everyone else, the single coherent answer was: deliberate practice. Our culture loves the story line of the prodigy and the notion that experts posses a inherent talent that separates them from everyone else. But in reality, to master a cognitively demanding task requires this specific form of practice. There are only a few exceptions made for natural talent. K. Anders Ericsson introduced the concept of deliberate practice in his 1993 paper “ The Role of Deliberate Practice in the Acquisition of Expert Performance“, where he stated:\n “we deny that these differences are immutable, that is, due to innate talent. Only a few exceptions, most notably height, are genetically prescribed. Instead, we argue that the differences between expert performers and normal adults reflect a life-long period of deliberate effort to improve performance in a specific domain.”\n   You need to choose a strategy/philosophy that fits your specific circumstances, as a mismatch can derail your deep work habit before it has a chance to solidify. Here are some strategies I extracted from the book  Deep Work: Rules for Focused Success in a Distracted World :\n Monastic: “This philosophy attempts to maximize deep efforts by eliminating or radically minimizing shallow obligations.” — isolate yourself for long periods of time without distractions; no shallow work allowed.\n Bimodal: “This philosophy asks that you divide your time, dedicating some clearly defined stretches to deep pursuits and leaving the rest open to everything else.” – dedicate a few consecutive days (like weekends, or a Sunday, for example) for deep work only, at least one day a week.\n Rhythmic: “This philosophy argues that the easiest way to consistently start deep work sessions is to transform them into a simple regular habit.” – create a daily habit of three to four hours every day to perform deep work on your project.\n Journalistic: “in which you fit deep work wherever you can into your schedule.” — Not recommended to try out first, since you first need to accustom yourself to deep work.\n For my current lifestyle, I prefer to switch between the Rhythmic and the Bimodal. You don’t have to fit on one box, but you can use these strategies as reference points when developing one that fits your circumstances.\n   Fair enough. It’s difficult to know in advance what could become “your thing”, since our interests vary from person to person and only because I like ARM exploit development, doesn’t mean it is something you would enjoy doing yourself.\n  If you don’t have a path yet, pick a skill that is generally useful or one that you could potentially transform into a career.\n Give it a try for minimum 30 hours (deep work!). You might not like it at first. Don’t get discouraged right away. Things we’re not good at are scary and we don’t like doing what we suck at. The trick is to overcome the initial frustration until you get your first rewarding experiences.\n Split your 30 hours into seven 4-hour sessions (plus buffer). Set clear goals of what you want to accomplish with this project. Remember, the goal is not to become a master within 30 hours but to use your time efficiently to learn enough so you can judge if you want to continue or switch to another subject.\n Use your first session to perform extensive information gathering. Look at the resources available to you and pick the ones that stick out as the most useful for completing the project you’ve chosen. If necessary, use the second session to set up the environment (e.g. an analysis environment for Malware analysis including all tools you could possibly need for your first analysis) and define clear goals (e.g. Analyze Malware x). It is important to set clear goals and split them into structured parts.\n If you complete two sessions per week, you’ll be done in 3 weeks. Worst case scenario: You realize that you don’t like it, but you have spent 30 hours learning something challenging and new that you wouldn’t have otherwise learned. Best case: You realize that this is actually fun and want to continue it. Having already started, you overcame the most annoying part and can now happily continue developing your skill further.", "posttime": "2020-07-15 22:45:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "重要性,deep,练习", "title": "深耕细作的重要性和学习新技能的30小时法", "title_en": "The Importance of Deep Work and the 30-Hour Method for Learning a New Skill", "transed": 1, "url": "https://azeria-labs.com/the-importance-of-deep-work-the-30-hour-method-for-learning-a-new-skill/", "via": "", "real_tags": ["重要性", "deep", "练习"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年7月最近有很多关于特权的讨论。虽然这个概念被过度使用了，但它还是有一定的道理，特别是特权会让你失明的想法，让你无法看到那些生活与你截然不同的人所能看到的东西。但是，这类失明最普遍的例子之一，我从未见过明确提到过。我要称它为正统特权：一个人的思想越传统，在他们看来，每个人表达自己的观点就越安全。对他们来说，发表意见是安全的，因为他们的意见来源是目前可以接受的任何东西。因此，在他们看来，这对每个人来说都是安全的。从字面上讲，他们无法想象会给他们带来麻烦的真实说法。然而，在历史的每一个时刻，都有一些真实的事情会让你陷入可怕的麻烦之中。我们的是第一个不是这样的地方吗？那将是多么惊人的巧合啊。当然，这至少应该是默认的假设，即我们的时代并不是独一无二的，有一些真实的事情你现在不能说，就像过去一直存在的那样。你会认为。但是，即使面对如此压倒性的历史证据，大多数人还是会大胆地去做这件事。东正教特权的典型特征是，你为什么不直接说出来呢？如果你认为有些事情是真实的，人们不能说，为什么你不勇敢地拥有它呢？更极端的人甚至会指责你他们认为你心里一定有特定的异端邪说，尽管如果你那个时代有不止一种异端邪说，这些指控往往是不确定的：你必须要么是Bean Xist，要么是Yist。与这些人打交道固然令人沮丧，但重要的是要认识到他们是认真的。他们并不是假装认为一个想法既非正统又真实是不可能的。在他们看来，世界真的是这样的。你如何回应正统特权？仅仅给它起个名字可能会有一些帮助，因为当你遇到它的时候，它会提醒你，为什么和你交谈的人看起来如此不合理，因为这是一种独特的顽强的特权形式。人们可以通过了解更多他们不了解的东西来克服大多数形式的特权造成的盲目性。但是他们不能仅仅通过学习更多的知识来克服正统特权。他们必须变得更加独立。如果这真的发生了，那也不是在一次谈话的时间范围内发生的。也许可以让一些人相信正统特权是存在的，尽管他们感觉不到它，就像人们对暗物质可以感觉到的那样。例如，可能会有一些人相信，这是历史上第一个你不能说没有真实的东西的时刻，即使他们想象不出具体的例子，这也是非常不可能的。但是，除了这些人，我认为对这类特权说“检查一下你的特权”是行不通的，因为那些在这类特权中的人并没有意识到他们也在享受这项特权的权利。“。在思想保守的人看来，他们并不是思想传统。在他们看来，他们是对的。事实上，他们往往特别肯定这一点。也许解决办法就是诉诸礼貌。如果有人说他们能听到你听不到的高音噪音，那只是礼貌地相信他们的话，而不是要求他们拿出不可能拿出的证据，或者干脆否认他们听到了什么。想象一下这听起来有多粗鲁。同样，如果有人说他们能想到一些真实但不能说出来的事情，那么只有礼貌地相信他们的话，即使你自己想不到任何事情。一旦你意识到正统特权的存在，很多其他的事情就会变得更加清晰。例如，怎么会有一大批理性的聪明人担心他们所谓的取消文化，而另一些理性的聪明人却认为这是个问题呢？“。一旦你理解了正统特权的概念，就很容易看出这种分歧的根源。如果你相信没有什么是你不能说的，那么任何因为他们所说的事情而陷入麻烦的人都是罪有应得。感谢山姆·奥尔特曼、特雷弗·布莱克威尔、帕特里克·科里森、安东尼奥·加西亚-马丁内斯、杰西卡·利文斯顿、罗伯特·莫里斯、迈克尔·尼尔森、杰夫·拉尔斯顿、马克斯·罗瑟和哈吉·塔格阅读了这本书的草稿。", "note_en": "July 2020  There has been a lot of talk about privilege lately. Although theconcept is overused, there is something to it, and in particularto the idea that privilege makes you blind that you can&#39;t seethings that are visible to someone whose life is very differentfrom yours.  But one of the most pervasive examples of this kind of blindnessis one that I haven&#39;t seen mentioned explicitly. I&#39;m going to callit  orthodox privilege: The more conventional-minded someone is, themore it seems to them that it&#39;s safe for everyone to express theiropinions.  It&#39;s safe for them to express their opinions, because the sourceof their opinions is whatever it&#39;s currently acceptable to believe.So it seems to them that it must be safe for everyone. They literallycan&#39;t imagine a true statement that would get them in trouble.  And yet at every point in history, there were true things that wouldget you in terrible trouble to say. Is ours the first where thisisn&#39;t so? What an amazing coincidence that would be.  Surely it should at least be the default assumption that our timeis not unique, and that there are true things you   can&#39;t say now,just as there have always been. You would think. But even in theface of such overwhelming historical evidence, most people will gowith their gut on this one.  The spectral signature of orthodox privilege is &#34;Why don&#39;t you justsay it?&#34; If you think there&#39;s something true that people can&#39;t say,why don&#39;t you be brave, and own it? The more extreme will evenaccuse you of specific heresies they imagine you must have in mind,though if there&#39;s more than one heresy current in your time, theseaccusations will tend to be nondeterministic: you must either bean xist or a yist.  Frustrating as it is to deal with these people, it&#39;s important torealize that they&#39;re in earnest. They&#39;re not pretending they thinkit&#39;s impossible for an idea to be both unorthodox and true. Theworld really looks that way to them.  How do you respond to orthodox privilege? Merely giving it a namemay help somewhat, because it will remind you, when you encounter it,why the people you&#39;re talking to seem so strangely unreasonable.Because this is a uniquely tenacious form of privilege. People canovercome the blindness induced by most forms of privilege by learningmore about whatever they&#39;re not. But they can&#39;t overcome orthodoxprivilege just by learning more. They&#39;d have to become moreindependent-minded. If that happens at all, it doesn&#39;t happen onthe time scale of one conversation.  It may be possible to convince some people that orthodox privilegemust exist even though they can&#39;t sense it, just as one can with,say, dark matter. There may be some who could be convinced, forexample, that it&#39;s very unlikely that this is the first point inhistory at which there&#39;s nothing true you can&#39;t say, even if theycan&#39;t imagine specific examples.  But except with these people, I don&#39;t think it will work to say&#34;check your privilege&#34; about this type of privilege, because thosein its demographic don&#39;t realize they&#39;re in it. It doesn&#39;t seem toconventional-minded people that they&#39;re conventional-minded. Itjust seems to them that they&#39;re right. Indeed, they tend to beparticularly sure of it.  Perhaps the solution is to appeal to politeness. If someone saysthey can hear a high-pitched noise that you can&#39;t, it&#39;s only politeto take them at their word, instead of demanding evidence that&#39;simpossible to produce, or simply denying that they hear anything.Imagine how rude that would seem. Similarly, if someone says theycan think of things that are true but that cannot be said, it&#39;sonly polite to take them at their word, even if you can&#39;t think ofany yourself.  Once you realize that orthodox privilege exists, a lot of otherthings become clearer. For example, how can it be that a largenumber of reasonable, intelligent people worry about something theycall &#34;cancel culture,&#34; while other reasonable, intelligent peopledeny that it&#39;s a problem? Once you understand the concept of orthodoxprivilege, it&#39;s easy to see the source of this disagreement. Ifyou believe there&#39;s nothing true that you can&#39;t say, then anyonewho gets in trouble for something they say must deserve it.             Thanks to Sam Altman, Trevor Blackwell, Patrick Collison, Antonio Garcia-Martinez,Jessica Livingston, Robert Morris, Michael Nielsen , Geoff Ralston, Max Roser, andHarj Taggar for reading drafts of this.", "posttime": "2020-07-15 22:45:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "东正教,orthodox,特权", "title": "东正教特权", "title_en": "Orthodox Privilege", "transed": 1, "url": "http://paulgraham.com/orth.html", "via": "", "real_tags": ["东正教", "orthodox", "特权"]}, {"category": "", "categoryclass": "", "imagename": "3a0e6aca140331335de9ccaa4e510554.jpg", "infoid": 1012029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sumeru Equity Partners的负责人马克·哈勒(Mark Haller)告诉TechCrunch：“Sumeru Equity Partners正在对公司进行多数投资，但也为未来的增长充分利用了业务资本。”\n根据Crunchbase的数据，该公司此前筹集了4700万美元。哈勒表示，这不是收购，而是与那些之前的投资者建立合作伙伴关系。他表示：“我们看到与现有投资者的持续合作，我们将进入并进行多数投资，我们还将在资产负债表上进行另一项投资。”\nSumeru首席执行官加里·中村(Gary Nakamura)表示，Sumeru得到的是一家利用营销技术帮助内部沟通的公司。Nakamura告诉TechCrunch：“作为一名领导者、管理者和组织，你可以通过目标细分和所有遥测来开展活动，以了解你的沟通是如何与员工沟通的。”\n目标是大公司，客户包括福特、阿彻·丹尼尔斯·米德兰(Archer Daniels Midland)和波音(Boeing)等大牌公司。该公司报告说，它在全球拥有120个大客户，业务一直在以每年50%的速度增长。\n中村表示，虽然公司从Sumeru那里获得了这笔现金注入，但他将继续努力，以周到的方式管理公司，这意味着在公司现有的120名员工之外，他们如何招聘员工要谨慎。\n“我们所建立的是一项不需要很多人来经营的业务。通过我们已经实施的财务纪律，我们可以保持50%的增长率。从历史上看，这就是我们能够做到的。“他说。\nSumeru Equity Partners是一家总部位于旧金山的私募股权公司。根据公司网站的说法，它的目标是中端市场公司，然后试图通过在产品战略、加速上市和组织发展等领域与他们合作，应用运营效率，目标是建立公司并使其退出。", "note_en": "“ Sumeru Equity Partners   is making a majority investment in the company but also well capitalizing the business for future growth,” Mark Haller, principal at Sumeru told TechCrunch.\n The company previously raised $47 million, according to Crunchbase data. Haller says this is not a buyout, so much as a partnership with those previous investors. “We’re seeing continued partnership with existing investors and we’re coming in and making that majority investment, and we’ll also be making another investment in the balance sheet,” he said.\n  What Sumeru is getting is a company that helps with internal communications using marketing techniques, says company CEO Gary Nakamura. “You can run campaigns with targeting segmentation and all the telemetry back that you need as a leader, as a manager, as an organization to understand how your communications are landing with your workforce,” Nakamura told TechCrunch.\n The target is large companies and customers include big names like Ford, Archer Daniels Midland and Boeing. The company reports it has 120 large customers around the world, and the business has been growing at 50% year over year.\n While the company is getting this infusion of cash from Sumeru, Nakamura says he will continue to try and manage the company in a thoughtful way, and that means being careful about how they hire beyond the 120 employees the company already has.\n “What we have built is a business that doesn’t require a lot of heads to run it. We can maintain a 50% growth rate with financial discipline that we’ve implemented. Historically that is what we’ve been able to do,” he said.\n Sumeru Equity Partners is a private equity firm based in San Francisco. It targets mid-market companies, according to the company website and then tries to apply operational efficiency by working with them on areas like product strategy, go-to-market acceleration and organizational development with the goal of building up the company and taking it to exit.", "posttime": "2020-07-15 22:22:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "equity,stake", "title": "\nSumeru Equity Partners投资1亿美元收购SocialChorus多数股权", "title_en": "\n\t\t\t\tSumeru Equity Partners buys majority stake in SocialChorus with $100M investment\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/sumeru-equity-partners-buys-majority-stake-in-socialchorus-with-100m-investment/", "via": "", "real_tags": ["equity", "stake"]}, {"category": "", "categoryclass": "", "imagename": "3354fd3dd1aaed84c6e348f5d0bb1587.jpg", "infoid": 1012028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司的租赁市场已经在洛杉矶拥有数万个单元，租户自己在其平台上对此进行了描述。今年晚些时候，该公司将扩展到旧金山和圣地亚哥，并计划在2021年搬到西雅图，同年晚些时候搬到纽约和芝加哥。\n支持该公司扩张计划和发展的是一轮280万美元的种子资金，资金来自大卫·萨克斯的投资公司Craft Ventures，以及Abstract VC、Wonder Ventures和Zillow的联合创始人、最近从洛杉矶归来的斯宾塞·拉斯科夫(Spencer Rascoff)。其他未披露的天使投资者也参与了这轮融资。\nPocketList仍在营收前，计划通过向物业经理和房东收取公寓潜在租户的线索来赚钱。房东可以向表示对房产感兴趣的潜在租房者发送出境信息，达维在谈到该公司计划提供的一项新服务时说。\nPocketList投资人、dot.LA和Zillow创始人斯宾塞·拉斯科夫(Spencer Rascoff)表示：“给房地产带来透明度是一个近20年的过程，而公寓市场才刚刚起步。”“PocketList让透明度更上一层楼，将独家的‘售前’库存公之于众，租房者蜂拥使用这项服务也就不足为奇了。”\n租房者可以免费下载PocketList应用程序，对他们目前的公寓进行评级，并访问该应用程序上提供的列表。与此同时，该公司表示，物业经理和房东可以使用专业版，它具有他们想要的所有外展、管理和概览功能。\n“考虑到目前租赁市场的建立方式，租房者‘需要找地方’和实际‘租一个地方’之间几乎总是存在差距，”达泽继续说。“PocketList打破了这个循环，让人们比以往任何时候都更早地进入他们喜欢的家庭。”", "note_en": "The company Dazé has built with co-founder  Julian Vergel de Dios, has, in fact, flipped the traditional script of relying on landlords and property managers to source information about available rentals and is relying on renters to provide information about the apartments they’re in… and the apartments where they’d like to be.\n PocketList started out as an experiment born out of a lot of trial and error, according to Dazé, but it was around the initial revelation that “renters typically know they’re going to be moving way ahead of time.”\n  The service, which is available as an app and online, was a business nearly four years in the making. Initially Dazé and Vergel de Dios built a service called Block. “ The hypothesis with Block was that a big painpoint for renters was communication between people looking for apartments together,” Dazé said. “We made a tool that was well designed and well built … it was a cross between Slack and Microsoft Excel, but specifically for renters. The biggest problem was that it didn’t have a good business model.”\n  What started as Block, eventually morphed into PocketList and the two Los Angeles-based founders quickly took the app to market with little fanfare in November. Growing initially by word of mouth, the service allows for an easy sign up where renters fill out a brief description of their apartment — basically letting the community know what it’s like and that it will soon be on the market — and then can search for other apartments in areas they’re interested in.\n Rentals typically sit vacant for an average of 26 days every time they turn over, according to PocketList’s internal data. That delay costs landlords as much as $43 billion and puts pressure on supply constrained housing markets, the company said. But using PocketList, renters can leave a place more quickly and owners reduce the time an apartments stands empty to perhaps one week.  Currently, the average unit on PocketList is rented 67 days before the landlord is given notice, and 97 days before the unit appears on other listing sites, the company said in a statement.\n For renters, the network provides information about apartments that will be available on the market and a way to query current occupants about potential units. Interested renters can also reach out directly to landlords and property managers via the PocketList app to indicate that they’d be interested in looking at a place. To ensure security no contact information is shared with a property manager until a renter submits an application and last names and images are hidden until the renter applies for an apartment.\n On the other side of the equation, landlords and property managers are able to claim properties for free and see feedback from renters about their buildings — and the thoughts renters have of other properties in their area. They also get earlier access to potential tenants once a previous tenant gives notice.\n The next features on the product roadmap include descriptions of areas which give potential renters the option to select for the kinds of neighborhood features they want and more tools for landlords like direct application submissions, renter resumes and other landlord response tools.\n The company’s rental marketplace already has tens of thousands of units in Los Angeles described on its platform by the renters themselves and will be expanding to San Francisco and San Diego later this year with plans to move into Seattle in 2021 and New York and Chicago later that same year.\n Backing the company’s expansion plans and development is a $2.8 million seed round which came from David Sacks’ investment firm, Craft ventures, along with Abstract VC, Wonder Ventures, and Zillow co-founder, and recent Los Angeles returnee, Spencer Rascoff. Other, undisclosed, angel investors also participated in the round.\n Still pre-revenue, PocketList plans to make money off of charging property managers and landlords for leads on likely renters for their apartments. Landlords can send outbound messages to potential renters that have expressed interest in a property, said Davé, of one of the company’s planned new services.\n “Bringing transparency to real estate has been a nearly 20-year process, and the apartment market is only just getting there,” said Spencer Rascoff, PocketList investor, and founder of dot.LA and Zillow. “PocketList takes transparency to the next level, bringing exclusive ‘pre-market’ inventory into the light, and it’s no surprise that renters have flocked to the service.”\n Renters can download the PocketList app for free, rate their current apartment and get access to the listings available on the app. Meanwhile, property managers and landlords have access to a pro version, which has all of the outreach, management and overview features that they’d want, the company said.\n “Given the way the current rental market is set up, there’s almost always a gap between when a renter ‘needs to find a place’ and actually ‘rents a place,” continued Dazé. “PocketList breaks the cycle and gets people into homes they love earlier than ever before.”", "posttime": "2020-07-15 22:22:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "了解,pocketlist", "title": "\n洛杉矶的PocketList为租房者提供了更好、更快的信息，了解城市里有哪些公寓可用", "title_en": "\n\t\t\t\tLA’s PocketList gives renters better information, faster, about what apartments are available in cities\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/las-pocketlist-gives-renters-better-information-faster-about-what-apartments-are-available-in-cities/", "via": "", "real_tags": ["了解"]}, {"category": "", "categoryclass": "", "imagename": "4de35a7e9d4bacae03a8986c1ccdae53.jpg", "infoid": 1012025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Charge Communications已向美国联邦通信委员会(FCC)请愿，请求允许在FCC的上限禁令到期至少两年前对客户实施数据上限。FCC禁止上限是这家有线电视公司为换取2016年批准其与时代华纳有线电视(Time Warner Cable)和光明屋网络(Bright House Networks)的合并而施加的一项关键条件。\n2016年，FCC告诉Spectrum，如果不要求一些有利于您作为Spectrum客户的改变和条件，它的合并不符合公众利益。因为FCC认识到有线电视行业的竞争并不常见，它知道合并后会有一种诱惑，那就是对互联网客户设置数据上限，除了公司可以这样做之外，没有任何好的理由。事实上，数据上限长期以来一直被讨论为一种威慑，以防止客户放弃有线电视订阅，转而使用流媒体视频。为什么？因为如果你流式播放Netflix、Hulu、YouTube TV、Sling和其他公司的电视节目，这些数据使用量将很快耗尽Spectrum在其数据上限中包括的任何数据限额。大多数有数据上限的公司，如果你超过你的津贴，都会确保你支付高昂的费用。事实上的标准超限费是每50 GB 10美元，最高可达每月100-200美元！这种账单冲击很可能会把你推回有线电视。\nFCC希望，对Spectrum实施数据上限的七年禁令将给竞争一个发展的机会，而不仅仅是在流媒体视频方面。事实上，FCC辩称，新进入的有线电视运营商、家庭提供商的光纤和5G服务可能会造成如此激烈的竞争，数据上限可能会消失。不幸的是，在过去的四年里，消费者几乎没有看到竞争的出现。事实上，许多人仍然只有一个选择-有线电视垄断-互联网服务达到FCC的最低速度(25 Mbps)才有资格成为宽带。电话公司的DSL很少能提供当地有线电视运营商提供的速度。在一些地区，光纤到户的竞争正在加剧，但许多家庭仍然缺乏接入。尽管媒体对5G大肆炒作，但在未来几年内，强大而快速的无线家庭互联网只会在一小部分家庭中使用。\n尽管存在这一现实，查特还是要求联邦通信委员会让数据上限禁令提前两年到期，这意味着他们可以在明年春天之前对像你这样的客户设置数据上限。查特认为，现在有很多流媒体服务在争夺你的业务，所以没有证据表明Spectrum正在损害流媒体电视的市场。因此，没有必要保护消费者不受数据上限的影响。\n大多数大型流媒体视频提供商的所有者是大型卫星、有线电视和电话公司(康卡斯特的孔雀、AT&amp；T的TV/TV Now和HBO Max、Dish Network的Sling TV)、大型电视集团(ABC-迪士尼的Hulu/Disney+、哥伦比亚广播公司-维亚康姆的All Access)或科技公司(Apple TV、YouTube TV)。Netflix提高了服务价格，部分原因是它被迫向康卡斯特等有线电视公司支付“互连费”，以保证康卡斯特的客户获得合适的服务。大多数与电信公司没有关联的流媒体服务一直反对数据上限，因为他们知道数据上限可能会反竞争，损害订户数量。\n什么比赛？Charge Spectrum客户可能仍然拥有与2016年相同的竞争选择(如果有的话)，这是不够的。对家庭宽带服务设置数据上限表明，行动中缺乏竞争。康卡斯特避免对竞争更激烈的东北部和大西洋中部地区的客户设置数据上限，该公司在这些地区面对的是Verizon的FiOS服务，该服务没有数据上限。\n查特要求并批准了消费者不需要或不想要的合并。查特自愿同意了FCC的条件，以完成交易。协议就是协议，但查特现在想要离开。该公司正花费数千美元聘请律师，以摆脱FCC的数据上限禁令，同时声称他们没有实施数据上限的计划。你真的相信他们吗？\n消费者讨厌数据上限。事实上，仅仅是对互联网服务设置数据上限就会破坏提供商的营销和广告活动，并使签约新客户变得困难。有数据上限的公司比没有数据上限的公司流失更多的客户，因为如果有新的无上限竞争对手到来，客户就会更换。仅仅是处理安装复杂的使用表和让抱怨其准确性的客户感到不安的成本，就比公司从超额费中赚取的任何收入都要高。值得注意的是，这些不仅仅是“阻止封顶”的观点！查特自己告诉FCC，这些只是一些反对实施数据上限的强有力的商业理由。现在，它正在请求联邦通信委员会允许实施数据上限，尽管如此！\n数据上限并不能保护宽带网络不受拥塞的影响，它们也不是关于公平共享互联网容量的问题。正在进行的大流行刚刚证明，大型有线电视和电话公司现有的宽带网络完全有能力处理网络流量的大幅增长。合理、经济高效的升级将在未来几年继续这一成功故事，而不需要任意的数据上限。别搞错了。数据上限只是电信公司将你的使用货币化以增加他们已经丰厚的利润的另一种方式。\n在2020年7月22日之前，您可以直接向FCC发送评论，敦促他们不要允许查特要求提前结束合并交易条件。门罗县(纽约州)。立法委员雷切尔·巴恩哈特和阻止上尉！已经联手将这条信息传递给各地的Spectrum客户。我们需要提醒FCC，它必须保持足够好的独立性，并允许交易条件保持不变。我们还希望向Charge的高管发出一个明确的信息，即客户不想要数据上限…。永远不会。这是一条信息让帽子停下来！2009年成功交付给时代华纳有线的最高领导层，他们倾听了。现在是时候向查特的人们发出另一个信息了。我们真诚地希望他们也会倾听。\n这里有一封信的样本，我们敦促您在提交之前调整一下，以反映您自己的观点和情况：\n请拒绝查特的要求，将其同意的交易条件作为其与时代华纳有线电视和光明之家网络合并的一部分。\n交易就是交易，查特同意至少在七年内不对客户设定数据上限。它现在希望提前两年解除禁令，辩称竞争在过去四年里蓬勃发展。事实上，对我们来说，几乎没有什么变化。竞争并没有蓬勃发展。我们仍然没有宽带服务的选择，尽管有更多的流媒体视频提供商，但大多数都是由大型有线电视、卫星和电话公司或大型媒体集团拥有的。数据上限会让我重新考虑使用这些服务，因为我负担不起更高的互联网账单。\n在一个健康的市场中，竞争应该会降低价格。但是我的账单只会上涨。在告诉所有人他们的网络足够强大，可以应对越来越多的在家使用之后，什么样的公司会要求允许在大流行期间对客户施加使用限制？答案是，这家公司面临的竞争很少，而且不担心竞争对手会利用这一要求来对付他们。互联网的可负担性已经是一个巨大的问题，而数据上限只会让互联网服务变得更加昂贵。我们已经为服务支付了世界上最高的价格之一。\n我的家人没有要求这次合并，FCC在2016年认定，在没有施加几个条件让消费者从交易中受益的情况下批准合并不符合公众利益。FCC应该坚持宪章是信守诺言的，而不是设置数据上限。查特在2016年告诉FCC，它“厌恶数据上限”，称它没有实施使用限制，而是选择将没有数据上限作为一种竞争优势进行营销“，并表示”不实施上限有很强的商业理由“，而且上限”破坏了“其营销信息。查特在2016年对FCC诚实吗？他们目前要求允许取消数据上限的请求似乎忽略了查特本身几年前对FCC采取的立场。\n我们敦促您拒绝查特的请愿书，该请愿书将允许查特继续从无限制互联网接入的销售中赚取大量资金，并继续履行其“没有数据上限”的互联网服务广告承诺，就像它现在所做的那样。\n其次，点击左边栏上标有“+Express”的链接，如下图所示：\n第三，尽可能完整地填写表格，并将您的评论留在底部的“简要评论”框中。\n邮寄两份您的书面意见，开头应为“亲爱的多尔奇部长”，并以您的签名结束，地址为：", "note_en": "Charter Communications has petitioned the FCC for permission to impose DATA CAPS on customers at least two years before the FCC’s prohibition on caps — a key condition imposed on the cable company in return for approval of its 2016 merger with Time Warner Cable and Bright House Networks — is scheduled to expire.\n In 2016, the FCC told Spectrum its merger was NOT in the public interest without requiring some changes and conditions that would benefit you as a Spectrum customer. Because the FCC recognized that competition was uncommon in the cable industry, it knew there would be a temptation after a merger to slap data caps on internet customers for no good reason, other than the fact the company could. In fact, data caps have long been discussed as a deterrent to keep customers from dropping cable TV subscriptions in favor of streaming video. Why? Because if you stream TV programming from Netflix, Hulu, YouTube TV, Sling, and others, that data usage would quickly eat up any data allowances Spectrum would include with its data cap. Most companies with data caps make sure you pay dearly if you go over your allowance. The de facto standard overlimit fee is $10 for each 50 GB of usage, up to a maximum ranging between $100-200 a month! That kind of bill shock would likely push you back to cable TV.\n The FCC hoped that a seven-year ban on Spectrum imposing data caps would give competition a chance to develop, and not just with streaming video. In fact, the FCC argued newly arriving cable operators, fiber to the home providers, and 5G services could probably create so much competition, data caps would likely disappear. Unfortunately, consumers have seen little competition emerge in the last four years. In fact, many still have only one choice — a cable monopoly — for internet service that meets the FCC’s minimum speed (25 Mbps) to qualify as broadband. DSL from the phone company rarely provides the speed available from your local cable operator. Fiber to the home competition is growing in some areas, but many homes still lack access. Although there has been much hype in the media about 5G, robust and fast wireless home internet will only be available in a fraction of homes for years to come.\n Despite this reality, Charter is asking the FCC to let the ban on data caps expire two years early, which means they could slap data caps on customers just like you by next spring. Charter argues there are lots of streaming services now competing for your business, so there is no evidence Spectrum is hurting the marketplace for streaming television. Therefore, there is no need to protect consumers from data caps.\n   Most large streaming video providers are owned by giant satellite, cable and telephone companies (Comcast’s Peacock, AT&amp;T’s TV/TV Now and HBO Max, Dish Network’s Sling TV), giant TV conglomerates (ABC-Disney’s Hulu/Disney +, CBS-Viacom’s All Access), or tech companies (Apple TV, YouTube TV). Netflix has raised prices for its service, in part because it has been pushed to pay cable companies like Comcast “interconnection fees” to guarantee Comcast customers will get suitable service. Most streaming services not affiliated with telecom companies have opposed data caps all along, understanding they can be anticompetitive and hurt subscriber numbers.\n What competition? Charter Spectrum customers likely still have the same competitive options they had in 2016, if any, which is not enough. Imposing data caps on home broadband service illustrates that lack of competition in action. Comcast has avoided imposing data caps on its customers in the more competitive northeast and mid-Atlantic regions, where it faces Verizon’s FiOS service, which does not have data caps.\n Charter asked for and was granted approval of a merger consumers did not need or want. Charter voluntarily agreed to the FCC’s conditions to close the deal. A deal is a deal, but Charter now wants to walk away. The company is spending thousands on its attorneys to free itself from the FCC’s data cap ban while claiming they have no plans to implement data caps. Do you honestly believe them?\n Consumers hate data caps. In fact, just having data caps on internet service can undermine a provider’s marketing and ad campaigns and make signing up new customers difficult. Companies with data caps lose more customers than those that don’t because customers switch if a new cap-free competitor comes to town. Just dealing with implementing complicated usage meters and upset customers complaining about their accuracy costs more than any revenue companies earn from overlimit fees. Remarkably, those are not just the views of  Stop the Cap! Charter  itself told the FCC those were just some reasons there was a strong business case against implementing data caps. Now it is asking the FCC for permission to impose data caps despite all that!\n  Data caps do not protect broadband networks from congestion, and they are not about equitably sharing internet capacity. The ongoing pandemic just proved that big cable and phone companies have existing broadband networks more than capable of handling a large spike in network traffic. Reasonable, cost-effective upgrades will continue that success story for years to come with no need for arbitrary data caps. Make no mistake. Data caps are just another way telecom companies can monetize your usage to increase their already fat profits.\n  Until July 22, 2020, you can send a comment directly to the FCC urging them NOT to allow Charter’s request to sunset merger deal conditions early. Monroe County (N.Y.) legislator Rachel Barnhart and  Stop the Cap! have teamed up to push this message through to Spectrum customers everywhere. We need to put the FCC on notice it must leave well enough alone and allow the deal conditions to remain in place. We also want to send a clear message to executives at Charter that customers  do not want data caps… ever. It’s a message  Stop the Cap! successfully delivered in 2009 to the top leadership of Time Warner Cable, and they listened. It’s now time to send another message to the folks at Charter. We sincerely hope they will listen too.\n Here is a sample letter, which we urge you to adjust to reflect your own views and circumstances before submitting:\n  Please reject Charter’s request to sunset the deal conditions it agreed to as part of its merger with Time Warner Cable and Bright House Networks.\n A deal is a deal, and Charter agreed not to impose data caps on its customers for at least seven years. It now wants that prohibition lifted two years early, arguing competition has flourished over the last four years. In fact, little has changed for us. Competition has not flourished. We still do not have choices for broadband service and although there are more streaming video providers, most are owned by large cable, satellite, and phone companies or giant media conglomerates. Data caps will make me reconsider using these services because I cannot afford an even higher internet bill.\n Competition is supposed to bring pricing down in a healthy marketplace. But my bill is only going up. What kind of company would ask for permission to slap usage limits on customers in the middle of a pandemic, after telling everyone their networks were more than robust enough to handle increased stay-at-home usage? The answer is a company that faces little competition and has no fear a competitor will use this request against them. Internet affordability is already an enormous problem, and data caps just make internet service even more expensive. We already pay among the highest prices in the world for service.\n My family did not ask for this merger, and the FCC in 2016 determined it was not in the public interest to approve it without imposing a handful of conditions to allow consumers to benefit from the transaction. The FCC should insist Charter be true to its word and not impose data caps. Charter told the FCC in 2016 it had an “aversion to data caps, stating that instead of enforcing usage limits it chooses to market the absence of data caps as a competitive advantage” and that “there is a strong business case for not implementing caps” and that caps “undermined” its marketing messaging. Was Charter being honest with the FCC in 2016? Their current request for permission to lift data caps seems to ignore the positions Charter itself took with the FCC just a few years ago.\n We urge you to deny Charter’s petition, which will allow Charter to continue making plenty of money from the sale of unlimited internet access and continue honoring its advertising commitments to sell internet service “with no data caps” as it does now.\n   Second, click the link on the left sidebar marked  “+Express” as circled below:\n Third, fill out the form as completely as possible, and leave your comments in the “brief comments” box at the bottom.\n  Mail  TWO COPIES of your written comments, which should open with the greeting “Dear Secretary Dortch,” and close with your signature to this address:", "posttime": "2020-07-15 22:16:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "communications,上限", "title": "Charge Communications向FCC请愿，要求对客户设置数据上限", "title_en": "Charter Communications petitioned the FCC to impose DATA CAPS on customers", "transed": 1, "url": "https://stopthecap.com/2020/07/13/call-to-action-tell-the-fcc-no-to-charter-spectrum-on-data-caps/", "via": "", "real_tags": ["上限"]}, {"category": "", "categoryclass": "", "imagename": "a99846a6c589d5cbcfc0457346931bbc.jpg", "infoid": 1012024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "计算机越来越善于想象“深度假象”--使用一种叫做“生成性对抗网络”(GAN)的技术创造出的照片真实感人脸。\n情报顾问穆尼拉·穆斯塔法(Munira MuStaa)表示，这项技术使宣传员能够“在没有任何历史或包袱”的情况下，隐藏在计算机生成的人物角色后面。穆尼拉·穆斯塔法之前曾在野外寻找过这样的图像。\n7月15日，路透社(Reuters)报道了一位据称名叫奥利弗·泰勒(Oliver Taylor)的英国作家，专家表示，他具备由GAN制作的所有特征。记者试图联系泰勒或他背后的任何人，但均未成功。\n这里有一本图文并茂的指南，介绍什么是深伪，以及如何识别它们。\n构建人工智能化身的初创公司Pincreen的首席执行官兼联合创始人李浩表示，生成性对抗性网络是指经过反复试错的决斗计算机程序。\n一个名为生成器的程序按顺序向一张脸发出数百万次尝试；第二个程序名为鉴别器，试图嗅出第一个程序的脸是否是假的。李说，如果鉴别者无法辨别，就会产生深度假。\n据路透社就深度假图像接受路透社采访的六位专家表示，甘氏总体上擅长模仿人，但一些面部特征仍然给他们带来了麻烦，导致许多人工生成的肖像在牙齿、眼睛和耳朵周围出现了签名毛刺。告密性的怪胎可能会潜入衣服、配饰或背景中，而甘斯也在为这些东西而苦苦挣扎。以下是专家所说的是观众正在看GaN图像的线索。\n模糊、超现实的背景是一个直接的危险信号。在泰勒的例子中，他身后墙上的瓷砖或接缝似乎在起伏和消散。\n甘斯很难给他们的作品穿上衣服。眼镜的镜框不对称，耳环很少搭配。在泰勒的肖像画中，他的领子有华夫饼图案(左边)和光滑的面料(右边)。\n甘斯创造的嘴巴通常看起来很畸形，而且可能有多余的牙齿。泰勒右侧的下巴似乎有一颗模糊的牙齿，他的一颗左前磨牙似乎与他的下嘴唇融合在一起。\n当GAN的头发不好的时候，它就会显示出来。毛发可以从额头上长出，也可以从耳朵和脖子上长出。泰勒的长长的飞行路线是GaN图像有时炫耀的不同寻常的头发的典型特征。泰勒还有其他问题。他的皮肤在鼻子下面和下巴上有棕色的数字文物。照亮他脸部的强光似乎同时从两个不同的角度照射到他的眼睛。另一个能说明问题的GAN故障-一个水滴状的斑点-似乎卡在了他的左前磨牙牙齿之间。\n李预测，深度假的创作者很快就能解决他和其他人在泰勒头像中发现的数字错误。“能力和质量将会提高，”他说。“一年后，如果有什么东西能解决所有这些奇怪的问题，我不会感到惊讶。”\n注：开场视频中泰勒之前的图像是由汤森路透实验室数据科学家利兹·罗曼生成的", "note_en": "Computers are getting better at dreaming up “deepfakes” — photorealistic human faces created using a technology called a generative adversarial network, or GAN.\n The technology is giving propagandists the ability to hide behind computer-generated personas “without any history or baggage,” said intelligence consultant Munira Mustaffa, who has previously hunted out such images in the wild.\n On July 15, Reuters reported on a purported British writer by the name of Oliver Taylor, who experts say bore all the hallmarks of having been produced by a GAN. Attempts to reach Taylor, or whoever was behind him, were unsuccessful.\n Here’s an illustrated guide on what deepfakes are — and how to spot them.\n  A generative adversarial network is the name given to dueling computer programs that run through a process of trial and error, according to Hao Li, chief executive and cofounder of Pinscreen, a startup that builds AI avatars.\n One program, the generator, sequentially fires out millions of attempts at a face; the second program, the discriminator, tries to sniff out whether the first program’s face is a fake. If the discriminator can’t tell, Li said, a deepfake is produced.\n  GANs are generally good at imitating people, but some facial features still give them trouble, leaving many artificially generated portraits with signature glitches around the teeth, eyes, and ears, according to six experts interviewed by Reuters about deepfake imagery. Telltale oddities can creep in to the clothes, accessories, or background, which GANs also struggle with. Here’s what the experts say are clues that a viewer is looking at a GAN image.\n  Fuzzy, surreal backdrops are an immediate red flag. In Taylor’s case, the tiles or seams in the wall behind him seem to undulate and dissipate.\n  GANs have trouble clothing their creations. Glasses have asymmetric frames; earrings rarely match. In Taylor’s portrait, his collar has a waffle pattern (on the left) and smooth fabric (on the right.)\n  Mouths created by GANs often look misshapen, and can have excess teeth. The right side of Taylor’s jaw appeared to have a blurry tooth and one of his left premolars seemed to merge with his lower lip.\n  When a GAN has a bad hair day, it shows. Hairs can sprout from foreheads or spike out from ears and necks. Taylor’s long flyaways are typical of the unusual hair sometimes sported by GAN images. Taylor has other problems too. His skin sports brown-colored digital artifacts under his nose and on his chin. And the bright light illuminating his face appears to be hitting his eyes from two different angles at once. Another telltale GAN glitch — a water droplet-like blob — appears to be stuck between his left premolar teeth.\n  Li predicted that deepfake creators will soon be able to resolve the digital errors he and others spotted in Taylor’s profile photo. “Capabilities and quality will improve,” he said. “I wouldn’t be surprised in a year to have something that fixes all these weird issues.”\n NOTE: The images preceding Taylor in the opening video were generated by Thomson Reuters Labs data scientist Liz Roman", "posttime": "2020-07-15 21:56:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,releases,gan", "title": "路透社发布识别深度假个人资料照片指南", "title_en": "Reuters releases guide to recognizing deepfake profile photos", "transed": 1, "url": "https://graphics.reuters.com/CYBER-DEEPFAKE/ACTIVIST/nmovajgnxpa/index.html", "via": "", "real_tags": ["发布", "releases", "gan"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012021, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "好了，终于到了-在新闻发布会发布一些主要结果的八周后，关于现代mRNA疫苗候选第一阶段试验的全文出来了。我很高兴看到这一点-所有候选疫苗的完整数据集公之于众将是非常重要的。\n看起来怎么样？正如我们在5月份发现的那样，我们正在观察三组志愿者，每组15名，年龄在18岁到55岁之间，分两次服用25微克、100微克或250微克的mRBA-1273，相隔28天。疫苗本身是冠状病毒S(Spike)蛋白三聚体形式的RNA序列(在这方面类似于辉瑞/BioNTech mRNA疫苗)。它带有一个跨膜锚，亚基之间的S1-S2裂解位点仍然完好无损，稳定在野生型病毒感染细胞之前存在的“预融合”构象中。这种稳定是通过将S2亚基顶部的两个残基替换为脯氨酸残基(“S 2P”形式)来实现的，同样的技巧也被用来完全稳定其他病毒的其他表面蛋白。(对于那些对蛋白质工程不感兴趣的人来说，脯氨酸在氨基酸残基中是独一无二的，它能迫使蛋白质链上的构象变得更加有限，特别是当你背靠背地拥有两个氨基酸时)。它在脂质纳米粒(LNP)配方中。\n如前所述，所有患者在第一次注射后15天内血清转阴。产生的抗体效价是剂量依赖性的，在第二轮注射后更高(几倍)。在第二次注射后，不良事件(发烧、发冷、注射部位疼痛)肯定也更常见，这也是你所预期的。考虑到这一点，值得注意的是这项试验的设计，这是一个标准的设计，当你介入调整免疫系统时，这是相当明智的。剂量从最低剂量的4名“哨兵”患者开始，然后是中等剂量的4名患者。在这些没有显示出严重的情况后，这两组人都被完全招募了。在全量给药的第8天后，最高剂量组的4名哨兵患者被注射，之后，该组的其余患者被纳入。对于尝试新的免疫学方法的错误方式，请参见此处。\n对患者进行了抗体水平(采用标准ELISA格式)、中和抗体(通过在各种细胞感染检测中寻找抑制作用)和T细胞水平的检测。正如你所预期的那样，在试验剂量开始之前，没有一个患者的血浆显示出中和冠状病毒的能力。虽然抗体效价有所上升，但第一次注射后中和程度仍然较低。然而，到第43天(第二次注射后)，所有参与者在细胞感染检测中都能够中和病毒的影响至少80%，这些反应也是剂量依赖性的。一项比较显示，这种活性与恢复期患者血浆中发现的活性相同或更高(样本来自38人，在症状出现后23至60天收集)。但当你查看数据时，你会注意到一件事，第43天是最好的-第57天有进一步的评估，这三组人在这两周都略有下降。您可以在论文的表2和图S8中的伪病毒中和化验中看到这种情况。毫无疑问，这些患者正在继续接受监测，看看他们的中和抗体效价如何，这是非常有兴趣的。\n也就是说，抗体水平并不是唯一决定免疫力的因素。T细胞是这个故事的一大部分，尽管我们不知道所有的细节-你通常会听到更多关于抗体滴度的信息，因为它们更容易测量，公平地说，它们通常是整体免疫力的良好代用品。但并不总是这样。至于这里的T细胞数据，CD4+细胞反应是被注意到的，但CD8+活性要弱得多(而且这只是在100µg组的第二剂之后)。这些CD4+细胞可以进一步分化为Th1和Th2细胞，它们各自产生一套不同的细胞因子。在这种情况下，疫苗似乎主要诱导Th1。这两种类型之间的平衡确实是一个复杂的课题(它们有不同的作用模式，也可以相互影响对方的活动)，这也适用于CD4+和CD8+T细胞之间的总体平衡。\n我不是一个足够的免疫学极客，不能告诉你我们要找什么样的人，我想我们甚至还不太清楚。我的印象是，CD8+细胞在清除病毒感染(特别是呼吸道病毒)方面更为重要，但CD4+细胞(以及两者的比例)也是真正的参与者。至于CD4+细胞的Th1和Th2亚群，有证据表明Th1类型对病毒病原体有更强的抵抗力，至少对一些病毒是如此。事实上，人们普遍认为，\n比较不同疫苗诱导的中和抗体(通过在细胞进入前与病毒结合来防止对宿主细胞的损害)，我认为评估靶向病毒蛋白中特定残基的进化保守性以及载体上糖基化的变化将是很重要的。病毒有多种逃避中和抗体的方法，表明A型HIV-I使用两种机制：1)低密度的表面蛋白使抗体结合稀疏；2)高度糖基化，可根据感染细胞类型的不同而改变。毫无疑问，许多人都会意识到，寻找一种能产生广泛而持久的中和流感抗体的疫苗，已经成为病毒免疫学家的一种“圣杯探索”(即许多人多年来一直在做这方面的工作，但还没有疫苗)。另一个大问题是，大多数疫苗都是针对斯派克的，如果这个目标存在致命缺陷，我们要到第三阶段才能发现呢？这里的重要比较将是以灭活病毒为基础的疫苗，它包含所有的SarsCov2蛋白。继续精彩的报道吧！\n注射第1天的RBD特异性IgG的GMT(55,166和575)是什么(表2)？怎么可能呢？", "note_en": "Well, it’s finally here – eight weeks to the day after press-releasing some top line results,  the full paper is out on the Moderna mRNA vaccine candidate’s Phase I trial. I’m very glad to see it – it’s going to be very important for the full data sets on all the vaccine candidates to be made public.\n So how’s it look? As we found out  back in May, we’re looking at three groups of 15 volunteers each, 18 to 55 years old, getting 25 µg, 100 µg, or 250 µg of mRBA-1273 in two doses 28 days apart. The vaccine itself is an RNA sequence for a trimer form of the S (Spike) protein of the coronavirus (similar to the Pfizer/BioNTech mRNA vaccine  in that way). It comes with a transmembrane anchor and the S1-S2 cleavage site between the subunits still intact, stabilized in the “prefusion” conformation that it will present in the wild-type virus before it infects cells. That stabilization is through the substitution of two residues at the top of the S2 subunit with proline residues, the “S 2P” form, and the  same trick has been used to stabilize other surface proteins of other viruses entirely. (For those who aren’t into protein engineering, proline is unique among amino acid residues in forcing a  much more limited conformation in the protein chain, particularly when you have two of them back-to-back). It’s in a  lipid nanoparticle (LNP) formulation\n As mentioned before, all patients seroconverted within 15 days of the first dose. The antibody titers generated were dose-dependent and were much higher (several-fold) after the second round of injections. Adverse events (fever, chills, pain at the injection site) were definitely more common after the second injection, too, which is just what you’d expect. With that in mind, it’s worth noting the design of the trial, a standard one that’s quite sensible when you’re stepping in to tweak the immune system. The dosing started off with four “sentinel” patients at the lowest dose, followed by four in the middle dose. After those showed nothing serious, both of those groups were then fully enrolled. After Day 8 of the full dosing, four sentinel patients were injected in the highest-dose group, and after them, the rest of that group were enrolled. For the wrong way to try out a new immunology approach, see  here.\n The patients were assayed for antibody levels (in a standard ELISA format), for neutralizing antibodies (by looking for inhibition in various cell-infection assays), and for T-cell levels. As you’d expect, none of the patients’ plasma showed the ability to neutralize the coronavirus before the trial dosing began. And neutralization was still low after the first injection, although the antibody titers had gone up. By Day 43, though (post-second injection), all participants were able to neutralize the effects of the virus in the cell-infection assays by at least 80%, with those responses also being dose-dependent. A comparison showed that this activity was the same or higher than that found with the plasma of convalescent patients (samples from 38 people, collected 23 to 60 days after onset of symptoms). But one thing that you do notice as you look over the data was that day 43 was the best – there was a further evaluation at day 57, and all three groups had gone down a bit in just those two weeks. You can see this happening in the pseudovirus neutralization assays in the paper’s Table 2 and in  Figure S8. These patients are no doubt continuing to be monitored, and it is of great interest to see how their neutralizing antibody titers hold up.\n That said, antibody levels are not the only thing that determines immunity. T cells are a big part of this story, although we  don’t know all the details – you’ll generally hear a lot more about antibody titers because they’re a lot easier to measure, and to be fair they are often a good proxy for overall immunity. But not always. As for the T-cell data here, CD4+ cell responses were noted, but there was much weaker CD8+ activity (and that only after the second dose in the 100 µg group). Those CD4+ cells can be  further differentiated into Th1 and Th2 cells, which each produce a different suite of cytokines. In this case, the vaccine seemed to mostly elicit Th1. The balance between those two types is a complex subject indeed (they have different modes of action and can influence each other’s activity as well), and that also goes for the balance between the CD4+ and CD8+ T cells in general.\n I’m not enough of an immunology geek to be able to tell you what profile we would be looking for, and I don’t think we even quite know yet. My impression is that CD8+ cells are more well-established as being important in clearing viral infections (especially  respiratory viruses), but the CD4+ ones (and the ratio of the two) are  real players as well. As for the Th1 and Th2 subsets of those CD4+ cells, there’s evidence that the Th1 type are more powerful against viral pathogens, at least for  some viruses. The general belief, in fact, has been that Th1 cells are more important in fighting intracellular pathogens in general, with Th2 cells going after extracellular parasites and the like, but (like everything else in immunology) that framework has only  become more complicated as we learn more about it.\n So from my bozo-immunology perspective, I think at first glance that I would rather see a more robust CD8+ response than what Moderna has shown here. Others seem to feel  similarly. But that said, I don’t know what the convalescent patient T-cell situation is, either: what kind of response did these people have when they cleared the virus on their own? We don’t have the figures from the set of patients in this paper (they just took plasma to evaluate antibodies). But we know  from a study of 10 infected patients with respiratory distress that those patients had a higher CD4+/CD8+ ratio, and that they had a higher Th1 response among the CD4+ cells. But you’d want to hear about the people who recovered smoothly as well as about the ones who ended up on respirators, wouldn’t you? The main thing I’ve been able to find on that i s this paper, which also showed a shift towards CD4+ cells in pooled plasma from convalescent patients, and among those cells a very pronounced Th1-driven response. So the Moderna data might well resemble the profile of recovered patients, which doesn’t sound so bad, although keep in mind that there might still be better ways to clear the virus than the response that we tend to get. We’re just going to have to see how things play out in Phase II/III, aren’t we? One also would like to see such profiles for the other vaccines in the race, and I assume that we will.\n The comparisons are going to be pretty darn interesting. As you can see, Moderna’s candidate is absolutely going to need two injections (as did the Pfizer/BioNTech vaccine candidate), and the reaction to the second dose is pretty vigorous. Will that cause trouble in moving into a larger and more diverse patient cohort? The Moderna neutralizing antibody response seems broadly similar to the Pfizer study, but we don’t have any T-cell profiling from Pfizer yet, so it’s impossible to make any comparisons in that department. The Pfizer/BioNTech adverse event profiling looked a bit better – is that going to be a distinguishing characteristic as the various vaccines go on? Will there be (can there be?) a single-dose vaccine from someone, which would make life and logistics much easier? What will the differences be in the strength of  real-world protection against infection, and in its duration? I have no earthly idea, and neither does anyone else: that’s why everyone is charging into the later clinical trial phases.\n  Comparing neutralizing antibodies (prevent damage to host cells by binding to virus before cell entry) induced by the different vaccines I think it will be important to evaluate the evolutionary conservation of the particular residues in the viral protein’s that are targeted and changes in glycosylation on the vector. Viruses have multiple documented ways of evading neutralizing Ab’s, exhibit A HIV-I uses two mechanisms 1) low density of surface proteins makes Ab binding sparse and 2) heavy glycosylation that can change depending on the cell type infected. As many will undoubtably be aware the search for a vaccine that generates broadly and durably neutralizing Ab’s against influenza has become something of a ‘grail quest’ for viral immunologists (ie many people have worked over many years on this and yet no vaccine). Another big concern the majority of the vaccines are targeting Spike, what if there is a fatal flaw with this target we don’t find out until phase 3? In important comparison here will be to the inactivated virus based vaccines which contain all the SarsCov2 proteins. Keep up the great reporting!\n  What’s obout GMT (55, 166 and 575) of RBD specific IgG at 1 Day of injection (Table 2)? How it possible?", "posttime": "2020-07-15 21:52:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sars,细胞", "title": "现代公司的SARS-CoV-2疫苗I期数据", "title_en": "Moderna’s SARS-CoV-2 Vaccine Phase I Data", "transed": 1, "url": "https://blogs.sciencemag.org/pipeline/archives/2020/07/15/modernas-phase-i-data", "via": "", "real_tags": ["sars", "细胞"]}, {"category": "", "categoryclass": "", "imagename": "cc5f7e7b42a057adff553060fbcf6c86.png", "infoid": 1012020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "V617考虑检查条件。按位运算的&#39；(1L&lt；&lt；STRUCT_CHRONSPOPE)&#39；参数包含非零值。HOUSE.CPP 5089 tyecif enum StructType：CHAR{STRUCT_NONE=-1，STRUCT_ADVANCED_TECH，STRUCT_IRE_CREWARD，STRUCT_WEAP，STRUCT_CHRONSPOPE，//3.}#定义STRUCTF_CHRONSPOPE(1L；&lt；STRUCT_CHRONSPOPE)UrgencyType HouseClass：：CHECK_BUILD_POWER(Void)const{.。IF(状态==STATE_AWAREED||STATE==STATE_ATTECTED){IF(BScan|(STRUCTF_CHRONSPOPE)){//&lt；=紧急=紧急高；}}.}。\n要检查变量中是否设置了某些位，请使用&amp；运算符，而不是|。由于此代码片断中的拼写错误，我们这里有一个始终为真的条件。v768枚举常量WWKEY_RLS_BIT&#39；用作布尔型变量。KEYBOARD.CPP 286类型枚举{WWKEY_SHIFT_BIT=0x100，WWKEY_CTRL_BIT=0x200，WWKEY_ALT_BIT=0x400，WWKEY_RLS_BIT=0x800，WWKEY_VK_BIT=0x1000，WWKEY_DBL_BIT=0x2000，WWKEY_BTN_BIT=0x8000，}WWKEY_。\n我认为，在key参数中，意图是检查由WWKEY_RLS_BIT掩码设置的某个位，但是作者犯了一个打字错误。他们应该使用&amp；按位运算符而不是&amp；&amp；来检查密钥代码。V523&#39；THEN&#39；语句等同于&#39；ELSE&39；语句。RADAR.CPP 1827 void RadarClass：：Player_Names(Bool On){IsPlayerNames=on；IsToRedraw=true；if(On){Flag_to_Reraw(True)；//Flag_to_Reraw(False)；}Else{Flag_to_Reraw(True)；//强制绘制图板}}。\n一位开发人员曾经评论过用于调试的代码。此后，代码中保留了在不同分支中具有相同运算符的条件运算符。找到了完全相同的两个位置：V705可能忘记或注释掉了&#39；Else&39；块，从而改变了程序的操作逻辑。NETDLG.CPP 1506静态INT NET_JOIN_DIALOG(Void){.。/*..。F4/Send/&#39；M&#39；=如果(Messages.Get_..*/_buf()==NULL){.。}Else/*..。如果我们已经在编辑一条消息，而用户单击了“发送”，请将我们的输入转换为返回，以便Messages.Input()可以正常工作。..*/IF(INPUT==(BUTTON_SEND|KN_BUTTON)){INPUT=KN_RETURN；}.}。\n由于大量注释，开发人员没有看到上面未完成的条件运算符。其余的Else关键字构成具有以下条件的Else If结构，这很可能会更改原始逻辑。V519连续两次为&#39；ScoresPresent&#39；变量赋值。也许这是个错误。检查热线：539,541。INIT.CPP 541 bool Init_Game(int，char*[]){.。ScoresPresent=False；//If(CCFileClass(&#34；SCORES.MIX&#34；).Is_Available()){ScoresPresent=True；If(！ScoreMix){ScoreMix=new MixFileClass(&#34；SCORES.MIX&#34；)；ThemeClass：：Scan()；}//}。\n另一个由不完全重构引起的潜在缺陷。现在还不清楚ScoresPresent变量应该设置为true还是false。V611内存使用&#39；new T[]&#39；运算符分配，但使用&#39；delete&#39；运算符释放。考虑检查此代码。使用DELETE[]POKE_DATA；&可能更好。CCDDE.CPP 410 BOOL SEND_DATA_TO_DDE_Server(char*data，int length，int Packet_type){.。char*poke_data=new char[length+2*sizeof(Int)]；//&lt；=.。IF(DDE_Class-&gt；POKE_Server(.。)==false){CCDebugString(&#34；C&amp；c95-POKE失败！\\n&#34；)；DDE_Class-&gt；CLOSE_POKE_CONNECTION()；DELETE POKE_DATA；//&lt；=RETURN(FALSE)；}DDE_Class-&gt；CLOSE_POKE_CONNECTION()；DELETE POKE_DATA；//&lt；=RETURN(True)；}。\n分析器发现一个错误，该错误与可以以不兼容的方式分配和释放内存有关。要释放分配给数组的内存，应该使用DELETE[]运算符，而不是DELETE。有几个这样的地方，它们都逐渐损害正在运行的应用程序(游戏)：V611内存是使用&#39；new T[]&#39；操作符分配的，但使用&#39；delete&#39；操作符释放。考虑检查此代码。使用DELETE[]POKE_DATA；&可能更好。CCDDE.CPP 416。\nV611内存使用&#39；new T[]&#39；运算符分配，但使用&#39；delete&#39；运算符释放。考虑检查此代码。最好使用&#39；delete[]TEMP_BUFFER；&#39；。INIT.CPP 1302\nV611内存使用&#39；new T[]&#39；运算符分配，但使用&#39；delete&#39；运算符释放。考虑检查此代码。使用&#39；delete[]Progress palette；&#39；可能更好。MAPSEL.CPP 795。\nV611内存使用&#39；new T[]&#39；运算符分配，但使用&#39；delete&#39；运算符释放。考虑检查此代码。使用删除[]Grey2Palette；&#39；可能更好。MAPSEL.CPP 796。\nV611内存使用&#39；new T[]&#39；运算符分配，但使用&#39；delete&#39；运算符释放。考虑检查此代码。使用DELETE[]POKE_DATA；&可能更好。CCDDE.CPP 422。\nV611内存使用&#39；new T[]&#39；运算符分配，但使用&#39；delete&#39；运算符释放。考虑检查此代码。最好使用&#39；delete[]TEMP_BUFFER；&#39；。INIT.CPP 1139。\nV772调用空指针的删除运算符将导致未定义的行为。ENDING.CPP 254 DELETE和DELETE[]运算符是分开的，这是有原因的。它们执行不同的任务来清除记忆。当使用非类型化指针时，编译器不知道指针指向的是哪种数据类型。在C++标准中，编译器的行为是不确定的。还有许多此类分析器警告：V772调用空指针的删除操作符将导致未定义的行为。HEAP.CPP 284。\nV772调用空指针的删除运算符将导致未定义的行为。INIT.CPP 728。\nV772调用空指针的删除运算符将导致未定义的行为。MIXFILE.CPP 134。\nV772调用空指针的删除运算符将导致未定义的行为。MIXFILE.CPP 391\nV772调用空指针的删除运算符将导致未定义的行为。MSGBOX.CPP 423。\nV772调用空指针的删除运算符将导致未定义的行为。SOUNDDLG.CPP 407。\nV772调用空指针的删除运算符将导致未定义的行为。BUFFER.CPP 126。\nV772调用空指针的删除运算符将导致未定义的行为。BUFF.CPP 162。\nV772调用空指针的删除运算符将导致未定义的行为。BUFF.CPP 212。\nV772调用空指针的删除运算符将导致未定义的行为。BFIOFILE.CPP 330。\nV772调用空指针的删除运算符将导致未定义的行为。事件.CPP 934。\nV772调用空指针的删除运算符将导致未定义的行为。HEAP.CPP 318\nV772调用空指针的删除运算符将导致未定义的行为。INIT.CPP 3851。\nV772调用空指针的删除运算符将导致未定义的行为。MIXFILE.CPP 130。\nV772调用空指针的删除运算符将导致未定义的行为。MIXFILE.CPP 430。\nV772调用空指针的删除运算符将导致未定义的行为。MIXFILE.CPP 447。\nV772调用空指针的删除运算符将导致未定义的行为。MIXFILE.CPP 481。\nV772调用空指针的删除运算符将导致未定义的行为。MSGBOX.CPP 461。\nV772调用空指针的删除运算符将导致未定义的行为。QUEUE.CPP 2982。\nV772调用空指针的删除运算符将导致未定义的行为。QUEUE.CPP 3167\nV762虚拟函数可能被错误覆盖。请参阅派生类&#39；HelpClass&#39；和基类&#39；DisplayClass&#39；中函数&#39；HELP_TEXT&#39；的第四个参数。HELP.H 55。\nV762虚拟函数可能被错误覆盖。请参阅派生类&#39；MapEditClass&#39；和基类&#39；HelpClass&#39；中函数&#39；raw_it&#39；的第一个参数。MAPEDIT.H 187。\nV762虚拟函数可能被错误覆盖。请参阅派生类&#39；AnimClass&#39；和基类&#39；ObjectClass&#39；中函数&#39；Occupy_List&#39；的第一个参数。ANIM.H 80。\nV762虚拟函数可能被错误覆盖。请参阅派生类&#39；BulletClass&#39；和基类&#39；ObjectClass&#39；中函数&#39；OVERVER_LIST&#39；的第一个参数。BULLET.H 102。\nV762虚拟函数可能被错误覆盖。请参阅派生类&#39；BuildingClass&#39；和基类&#39；TechnoClass&#39；中函数&#39；remap_Table&#39；的限定符。BUILDING.H 281。\nV762虚拟函数可能被错误覆盖。请参阅派生类&#39；HelpClass&#39；和基类&#39；DisplayClass&#39；中函数&#39；HELP_TEXT&#39；的第四个参数。HELP.H 58。\nV762虚拟函数可能被错误覆盖。请参阅派生类&#39；AnimClass&#39；和基类&#39；ObjectClass&#39；中函数&#39；OVERVER_LIST&#39；的第一个参数。ANIM.H 90。\nV763参数&#39；coord&#39；在使用之前总是在函数体中重写。DISPLAY.CPP4031void DisplayClass：：Set_Tactical_Position(COORDINATE coord){INT xx=0；INT yy=0；CONFINE_RECT(&amp；xx，&amp；yy，TacLeptonWidth，TacLeptonHeight，Cell_to_Lepton(MapCellWidth)+GlyphXClientSidebarWidthInLepton，Cell_to_Lepton(MapCellHeight))；coord=xy_coord\ncoord参数立即在函数体中被覆盖。未使用旧值。当函数有参数并且不依赖于它们时，这是非常可疑的。此外，还传递了一些坐标。因此，这段代码值得检查一下：指向本地数组的V507指针存储在此数组的作用域之外。这样的指针将变为无效。MAPSEL.CPP 757游戏代码中有很多全局变量。也许，这在当时是编写代码的常用方法。然而，现在它被认为是糟糕的，甚至是危险的。InterpolationPalette指针存储在本地数组localPalette中，该指针在退出函数后将无效。两个更危险的位置：V507指向局部数组的指针存储在此数组的作用域之外。这样的指针将变为无效。MAPSEL.CPP 769。\nV507指向本地数组缓冲区的指针存储在此数组的作用域之外。这样的指针将变为无效。WINDOWS.CPP 458。\n正如我在第一份报告中所写的那样，让我们希望新的电子艺术项目有更好的质量。顺便说一下，游戏开发商目前正在积极购买PVS-Studio。现在游戏预算相当大，所以没有人需要额外的费用来修复生产中的错误。说到这里，在代码编写的早期阶段修复错误不会占用太多时间和其他资源。欢迎您访问我们的网站下载并在所有项目中试用PVS-Studio。", "note_en": "The American company Electronic Arts Inc (EA) has opened the source code of the games Command &amp; Conquer: Tiberian Dawn and Command &amp; Conquer: Red Alert publicly available. Several dozen errors were detected in the source code using the PVS-Studio analyzer, so, please, welcome the continuation of found defects review.       \rCommand &amp; Conquer is a series of computer games in the real-time strategy genre. The first game in the series was released in 1995. The source code of the games was  posted together with the release of the  Command &amp; Conquer Remastered collection.    \rThe  PVS-Studio analyzer was used to find errors in the code. The tool is designed to detect errors and potential vulnerabilities in the source code of programs, written in C, C++, C#, and Java.    \rLink to the first error overview: &#34; The Code of the Command &amp; Conquer Game: Bugs from the 90&#39;s. Volume one&#34;      \rV583 The &#39;?:&#39; operator, regardless of its conditional expression, always returns one and the same value: 3072. STARTUP.CPP 1136     void Read_Setup_Options( RawFileClass *config_file ){ .... ScreenHeight = ini.Get_Bool(&#34;Options&#34;, &#34;Resolution&#34;, false) ? 3072 : 3072; ....}\n \rIt turns out that users couldn&#39;t configure some settings. Or, rather, they did something but due to the fact that the ternary operator always returns a single value, nothing has actually changed.   \rV590 Consider inspecting the &#39;i &lt; 8 &amp;&amp; i &lt; 4&#39; expression. The expression is excessive or contains a misprint. DLLInterface.cpp 2238     // Maximum number of multi players possible.#define MAX_PLAYERS 8 // max # of players we can havefor (int i = 0; i &lt; MAX_PLAYERS &amp;&amp; i &lt; 4; i++) { if (GlyphxPlayerIDs[i] == player_id) { MultiplayerStartPositions[i] = XY_Cell(x, y); }}\n \rDue to an incorrect loop, the position is not set for all players. On the one hand, we see the constant  MAX_PLAYERS 8 and assume that this is the maximum number of players. On the other hand, we see the condition  i &lt; 4 and the operator  &amp;&amp;. So the loop never makes 8 iterations. Most likely, at the initial stage of development, the programmer hadn&#39;t used constants. When he started, he forgot to delete the old numbers from the code.   \rV648 Priority of the &#39;&amp;&amp;&#39; operation is higher than that of the &#39;||&#39; operation. INFANTRY.CPP 1003     void InfantryClass::Assign_Target(TARGET target){ .... if (building &amp;&amp; building-&gt;Class-&gt;IsCaptureable &amp;&amp; (GameToPlay != GAME_NORMAL || *building != STRUCT_EYE &amp;&amp; Scenario &lt; 13)) { Assign_Destination(target); } ....}\n \rYou can make the code non-obvious (and most likely erroneous) simply by not specifying the priority of operations for the  || and  &amp;&amp; operators. Here I can&#39;t really get if it&#39;s an error or not. Given the overall quality of the code for these projects, we can assume that here and in several other places, we will find errors related to operations priority:     V648 Priority of the &#39;&amp;&amp;&#39; operation is higher than that of the &#39;||&#39; operation. TEAM.CPP 456\n  V648 Priority of the &#39;&amp;&amp;&#39; operation is higher than that of the &#39;||&#39; operation. DISPLAY.CPP 1160\n  V648 Priority of the &#39;&amp;&amp;&#39; operation is higher than that of the &#39;||&#39; operation. DISPLAY.CPP 1571\n  V648 Priority of the &#39;&amp;&amp;&#39; operation is higher than that of the &#39;||&#39; operation. HOUSE.CPP 2594\n  V648 Priority of the &#39;&amp;&amp;&#39; operation is higher than that of the &#39;||&#39; operation. INIT.CPP 2541\n \rV617 Consider inspecting the condition. The &#39;((1L &lt;&lt; STRUCT_CHRONOSPHERE))&#39; argument of the &#39;|&#39; bitwise operation contains a non-zero value. HOUSE.CPP 5089     typedef enum StructType : char { STRUCT_NONE=-1, STRUCT_ADVANCED_TECH, STRUCT_IRON_CURTAIN, STRUCT_WEAP, STRUCT_CHRONOSPHERE, // 3 ....}#define STRUCTF_CHRONOSPHERE (1L &lt;&lt; STRUCT_CHRONOSPHERE)UrgencyType HouseClass::Check_Build_Power(void) const{ .... if (State == STATE_THREATENED || State == STATE_ATTACKED) { if (BScan | (STRUCTF_CHRONOSPHERE)) { // &lt;= urgency = URGENCY_HIGH; } } ....}\n \rTo check whether certain bits are set in a variable, use the &amp; operator, not |. Due a typo in this code snippet, we have a condition that is always true here.   \rV768 The enumeration constant &#39;WWKEY_RLS_BIT&#39; is used as a variable of a Boolean-type. KEYBOARD.CPP 286     typedef enum { WWKEY_SHIFT_BIT = 0x100, WWKEY_CTRL_BIT = 0x200, WWKEY_ALT_BIT = 0x400, WWKEY_RLS_BIT = 0x800, WWKEY_VK_BIT = 0x1000, WWKEY_DBL_BIT = 0x2000, WWKEY_BTN_BIT = 0x8000,} WWKey_Type;int WWKeyboardClass::To_ASCII(int key){ if ( key &amp;&amp; WWKEY_RLS_BIT) return(KN_NONE); return(key);}\n \rI think, in the  key parameter, the intention was to check a certain bit set by the  WWKEY_RLS_BIT mask, but the author made a typo. They should have used the &amp; bitwise operator instead of &amp;&amp; to check the key code.      \rV523 The &#39;then&#39; statement is equivalent to the &#39;else&#39; statement. RADAR.CPP 1827     void RadarClass::Player_Names(bool on){ IsPlayerNames = on; IsToRedraw = true; if (on) { Flag_To_Redraw(true);// Flag_To_Redraw(false); } else { Flag_To_Redraw(true); // force drawing of the plate }}\n \rA developer once commented on code for debugging. Since then, a conditional operator with the same operators in different branches has remained in the code.   \rExactly the same two places were found:      \rV705 It is possible that &#39;else&#39; block was forgotten or commented out, thus altering the program&#39;s operation logics. NETDLG.CPP 1506     static int Net_Join_Dialog(void){ .... /*............................................................... F4/SEND/&#39;M&#39; = edit a message ...............................................................*/ if (Messages.Get_Edit_Buf()==NULL) { .... } else /*............................................................... If we&#39;re already editing a message and the user clicks on &#39;Send&#39;, translate our input to a Return so Messages.Input() will work properly. ...............................................................*/ if (input==(BUTTON_SEND | KN_BUTTON)) { input = KN_RETURN; } ....}\n \rDue to a large comment, the developer hasn&#39;t seen the above unfinished conditional operator. The remaining  else keyword forms the  else if construction with the condition below, which most likely changes the original logic.   \rV519 The &#39;ScoresPresent&#39; variable is assigned values twice successively. Perhaps this is a mistake. Check lines: 539, 541. INIT.CPP 541     bool Init_Game(int , char *[]){ .... ScoresPresent = false;//if (CCFileClass(&#34;SCORES.MIX&#34;).Is_Available()) { ScoresPresent = true; if (!ScoreMix) { ScoreMix = new MixFileClass(&#34;SCORES.MIX&#34;); ThemeClass::Scan(); }//}\n \rAnother potential defect due to incomplete refactoring. Now it is unclear whether the  ScoresPresent variable should be set to  true or  false.      \rV611 The memory was allocated using &#39;new T[]&#39; operator but was released using the &#39;delete&#39; operator. Consider inspecting this code. It&#39;s probably better to use &#39;delete [] poke_data;&#39;. CCDDE.CPP 410     BOOL Send_Data_To_DDE_Server (char *data, int length, int packet_type){ .... char *poke_data = new char [length + 2*sizeof(int)]; // &lt;= .... if(DDE_Class-&gt;Poke_Server( .... ) == FALSE) { CCDebugString(&#34;C&amp;C95 - POKE failed!\\n&#34;); DDE_Class-&gt;Close_Poke_Connection(); delete poke_data; // &lt;= return (FALSE); } DDE_Class-&gt;Close_Poke_Connection(); delete poke_data; // &lt;= return (TRUE);}\n \rThe analyzer found an error related to the fact that memory can be allocated and released in incompatible ways. To free up memory allocated for an array, the  delete[] operator should have been used instead of  delete.   \rThere were several such places, and all of them gradually harm the running application (game):     V611 The memory was allocated using &#39;new T[]&#39; operator but was released using the &#39;delete&#39; operator. Consider inspecting this code. It&#39;s probably better to use &#39;delete [] poke_data;&#39;. CCDDE.CPP 416\n  V611 The memory was allocated using &#39;new T[]&#39; operator but was released using the &#39;delete&#39; operator. Consider inspecting this code. It&#39;s probably better to use &#39;delete [] temp_buffer;&#39;. INIT.CPP 1302\n  V611 The memory was allocated using &#39;new T[]&#39; operator but was released using the &#39;delete&#39; operator. Consider inspecting this code. It&#39;s probably better to use &#39;delete [] progresspalette;&#39;. MAPSEL.CPP 795\n  V611 The memory was allocated using &#39;new T[]&#39; operator but was released using the &#39;delete&#39; operator. Consider inspecting this code. It&#39;s probably better to use &#39;delete [] grey2palette;&#39;. MAPSEL.CPP 796\n  V611 The memory was allocated using &#39;new T[]&#39; operator but was released using the &#39;delete&#39; operator. Consider inspecting this code. It&#39;s probably better to use &#39;delete [] poke_data;&#39;. CCDDE.CPP 422\n  V611 The memory was allocated using &#39;new T[]&#39; operator but was released using the &#39;delete&#39; operator. Consider inspecting this code. It&#39;s probably better to use &#39;delete [] temp_buffer;&#39;. INIT.CPP 1139\n \rV772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. ENDING.CPP 254      \rThe  delete and  delete[] operators are separated for a reason. They perform different tasks to clear memory. When using an untyped pointer, the compiler doesn&#39;t know which data type the pointer is pointing to. In the C++ standard, the behavior of the compiler is uncertain.   \rThere was also a number of analyzer warnings of this kind:     V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. HEAP.CPP 284\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. INIT.CPP 728\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MIXFILE.CPP 134\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MIXFILE.CPP 391\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MSGBOX.CPP 423\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. SOUNDDLG.CPP 407\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. BUFFER.CPP 126\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. BUFF.CPP 162\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. BUFF.CPP 212\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. BFIOFILE.CPP 330\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. EVENT.CPP 934\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. HEAP.CPP 318\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. INIT.CPP 3851\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MIXFILE.CPP 130\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MIXFILE.CPP 430\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MIXFILE.CPP 447\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MIXFILE.CPP 481\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. MSGBOX.CPP 461\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. QUEUE.CPP 2982\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. QUEUE.CPP 3167\n  V772 Calling a &#39;delete&#39; operator for a void pointer will cause undefined behavior. SOUNDDLG.CPP 406\n \rV773 The function was exited without releasing the &#39;progresspalette&#39; pointer. A memory leak is possible. MAPSEL.CPP 258     void Map_Selection(void){ .... unsigned char *grey2palette = new unsigned char[768]; unsigned char *progresspalette = new unsigned char[768]; .... scenario = Scenario + ((house == HOUSE_GOOD) ? 0 : 14); if (house == HOUSE_GOOD) { lastscenario = (Scenario == 14); if (Scenario == 15) return; } else { lastscenario = (Scenario == 12); if (Scenario == 13) return; } ....}\n \rThe developer might have thought: &#39;&#39;If I don&#39;t free memory at all, I will definitely not make a mistake and will choose the correct operator&#39;&#39;.       \rBut it results in a memory leak, which is also an error. Somewhere at the end of the function, memory gets released. Before that, there are many places with a conditional exit of the function, and memory by the  grey2palette and  progresspalett pointers isn&#39;t released.      \rV570 The &#39;hdr-&gt;MagicNumber&#39; variable is assigned to itself. COMBUF.CPP 806     struct CommHdr { unsigned short MagicNumber; unsigned char Code; unsigned long PacketID;} *hdr;void CommBufferClass::Mono_Debug_Print(int refresh){ .... hdr = (CommHdr *)SendQueue[i].Buffer; hdr-&gt;MagicNumber = hdr-&gt;MagicNumber; hdr-&gt;Code = hdr-&gt;Code; ....}\n \rTwo fields in the CommHdr structure are initialized with their own values. In my opinion, it&#39;s a meaningless operation, but it is executed many times:      \rV591 Non-void function should return a value. HEAP.H 123     int FixedHeapClass::Free(void * pointer);template&lt;class T&gt;class TFixedHeapClass : public FixedHeapClass{ .... virtual int Free(T * pointer) {FixedHeapClass::Free(pointer);};};\n \rIn the  Freefunction of the  TFixedHeapClass class there is no  return operator. What&#39;s interesting is that the called  FixedHeapClass::Free function also has a return value of the  int type. Most likely, the programmer just forgot to write the  return statement and now the function returns an incomprehensible value.   \rV672 There is probably no need in creating the new &#39;damage&#39; variable here. One of the function&#39;s arguments possesses the same name and this argument is a reference. Check lines: 1219, 1278. BUILDING.CPP 1278     ResultType BuildingClass::Take_Damage(int &amp; damage, ....){ .... if (tech &amp;&amp; tech-&gt;IsActive &amp;&amp; ....) { int damage = 500; tech-&gt;Take_Damage(damage, 0, WARHEAD_AP, source, forced); } ....}\n \rThe damage parameter is passed by reference. Therefore, the function body is expected to change the value of this variable. But at one point, the developer declared a variable with the same name. Because of this, the  500 value instead of the function parameter is stored in the local damage variable. Perhaps different behavior was intended.   \rOne more similar fragment:     V672 There is probably no need in creating the new &#39;damage&#39; variable here. One of the function&#39;s arguments possesses the same name and this argument is a reference. Check lines: 4031, 4068. TECHNO.CPP 4068\n \rV762 It is possible a virtual function was overridden incorrectly. See first argument of function &#39;Occupy_List&#39; in derived class &#39;BulletClass&#39; and base class &#39;ObjectClass&#39;. BULLET.H 90     class ObjectClass : public AbstractClass{ .... virtual short const * Occupy_List(bool placement=false) const; // &lt;= virtual short const * Overlap_List(void) const; ....};class BulletClass : public ObjectClass, public FlyClass, public FuseClass{ .... virtual short const * Occupy_List(void) const; // &lt;= virtual short const * Overlap_List(void) const {return Occupy_List();}; ....};\n \rThe analyzer detected a potential error in overriding the virtual  Occupy_List function. This may cause the wrong functions to be called at runtime.   \rSome other suspicious fragments:     V762 It is possible a virtual function was overridden incorrectly. See qualifiers of function &#39;Ok_To_Move&#39; in derived class &#39;TurretClass&#39; and base class &#39;DriveClass&#39;. TURRET.H 76\n  V762 It is possible a virtual function was overridden incorrectly. See fourth argument of function &#39;Help_Text&#39; in derived class &#39;HelpClass&#39; and base class &#39;DisplayClass&#39;. HELP.H 55\n  V762 It is possible a virtual function was overridden incorrectly. See first argument of function &#39;Draw_It&#39; in derived class &#39;MapEditClass&#39; and base class &#39;HelpClass&#39;. MAPEDIT.H 187\n  V762 It is possible a virtual function was overridden incorrectly. See first argument of function &#39;Occupy_List&#39; in derived class &#39;AnimClass&#39; and base class &#39;ObjectClass&#39;. ANIM.H 80\n  V762 It is possible a virtual function was overridden incorrectly. See first argument of function &#39;Overlap_List&#39; in derived class &#39;BulletClass&#39; and base class &#39;ObjectClass&#39;. BULLET.H 102\n  V762 It is possible a virtual function was overridden incorrectly. See qualifiers of function &#39;Remap_Table&#39; in derived class &#39;BuildingClass&#39; and base class &#39;TechnoClass&#39;. BUILDING.H 281\n  V762 It is possible a virtual function was overridden incorrectly. See fourth argument of function &#39;Help_Text&#39; in derived class &#39;HelpClass&#39; and base class &#39;DisplayClass&#39;. HELP.H 58\n  V762 It is possible a virtual function was overridden incorrectly. See first argument of function &#39;Overlap_List&#39; in derived class &#39;AnimClass&#39; and base class &#39;ObjectClass&#39;. ANIM.H 90\n \rV763 Parameter &#39;coord&#39; is always rewritten in function body before being used. DISPLAY.CPP 4031     void DisplayClass::Set_Tactical_Position(COORDINATE coord){ int xx = 0; int yy = 0; Confine_Rect(&amp;xx, &amp;yy, TacLeptonWidth, TacLeptonHeight, Cell_To_Lepton(MapCellWidth) + GlyphXClientSidebarWidthInLeptons, Cell_To_Lepton(MapCellHeight)); coord = XY_Coord(xx + Cell_To_Lepton(MapCellX), yy + Cell_To_Lepton(....)); if (ScenarioInit) { TacticalCoord = coord; } DesiredTacticalCoord = coord; IsToRedraw = true; Flag_To_Redraw(false);}\n \rThe  coord parameter is immediately overwritten in the function body. The old value was not used. This is very suspicious when a function has arguments and it doesn&#39;t depend on them. In addition, some coordinates are passed as well.    \rSo this fragment is worth checking out:      \rV507 Pointer to local array &#39;localpalette&#39; is stored outside the scope of this array. Such a pointer will become invalid. MAPSEL.CPP 757      \rThere are a lot of global variables in the game code. Perhaps, it used to be a common approach to writing code back then. However, now it is considered bad and even dangerous.   \rThe InterpolationPalette pointer is stored in the local array localpalette, which will become invalid after exiting the function.   \rA couple more dangerous places:     V507 Pointer to local array &#39;localpalette&#39; is stored outside the scope of this array. Such a pointer will become invalid. MAPSEL.CPP 769\n  V507 Pointer to local array &#39;buffer&#39; is stored outside the scope of this array. Such a pointer will become invalid. WINDOWS.CPP 458\n    \rAs I wrote in the first report, let&#39;s hope that new Electronic Arts projects are of better quality. By the way, game developers are currently actively  purchasing PVS-Studio. Now the game budgets are quite large, so no one needs extra expenses to fix bugs in production. Speaking of which, fixing an error at an early stage of code writing does not take up much time and other resources.   \rYou are welcome to visit our site to  download and try PVS-Studio on all projects.", "posttime": "2020-07-15 21:52:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,游戏,征服,command,wwkey", "title": "指挥与征服游戏的代码：来自90年代的虫子。第二卷", "title_en": "The Code of the Command and Conquer Game: Bugs from the 90s. Volume Two", "transed": 1, "url": "https://habr.com/en/company/pvs-studio/blog/510654/", "via": "", "real_tags": ["代码", "游戏", "征服", "command", "wwkey"]}, {"category": "", "categoryclass": "", "imagename": "fdfaa6712ff1250050b5ba52935ba41c.jpg", "infoid": 1012019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "着眼于以更环保的方式制造、包装和销售可持续发展的食品品牌，紧急公司推出了它的第一款产品-勇敢机器人冰淇淋。\n这也是完美日(Perfect Day)自完成由加拿大养老金计划投资委员会(Canada Payment Plan Investment Board)牵头、淡马锡(Temasek)和地平线风险投资公司(Horizons Ventures)额外承诺的3亿美元巨额融资以来，将如何部署部分巨额资金的第一个迹象。\n完美日创始人瑞安·潘迪亚(Ryan Pandya)和佩鲁马尔·甘地(Perumal Gandhi)第一次见到他们的紧急公司联合创始人兼总经理保罗·科尔索夫(Paul Kollessoff)时，科尔索夫正在为爱尔兰乳制品公司格兰比亚(Glanbia)工作，在完美日进行尽职调查。\n科尔索夫说：“我在那里做的实际上是在寻找新的商业项目。”“我是在三年前认识这些家伙的，当时我们正在和他们一起做一些口味方面的工作。”\n在潘迪亚和甘地建立完美日的过程中，对话就此结束，但大约三个月前，两位创始人提出了成立一家新的消费食品公司的想法，该公司基于最新的植物性或转基因蛋白(包括他们自己的)，还利用最新的包装技术、物流和其他技术来减少一家CPG公司的整个碳足迹。\n潘迪亚说：“这并不是说我们试图创建一家将完美日蛋白质商业化的公司。”“整个食品价值链上还有很多其他东西需要改进和现代化，包括围绕食品如何到达消费者手中的所有东西。”\n因此，Brave Robot对可持续发展的承诺超出了使用替代蛋白质来取代畜牧业和特别是生态灾难的乳制品行业及其奶牛的范围。科尔索夫说：“在配料创新和包装创新方面，有许多令人兴奋的东西正在进行。”\n根据科尔索夫的说法，这些创新不仅帮助紧急公司变得更可持续，而且使公司能够更快地将产品推向市场。\n据Kollessoff说，只有8名全职员工，它成功地在三个月的时间内带领冰淇淋业务从开始到产品推出。\n因此，Brave Robot将以5.99美元的价位直接向消费者推销其乳制品替代品脱冰淇淋。Kollessoff说，最初向加州地区的客户开放，任何数量的买家都在与该公司洽谈。“下个月我们都会在商店上架。与全国性经纪人…合作。我们还将拥有一个直接面向消费者的平台。“。\n科尔索夫说，在将产品投入商业规模之前，他必须和他的孩子们一起经历一个严格的产品测试过程。科尔索夫冰柜里一度有400品脱冰激凌。他和他的团队削减了最初的30多种口味的冰淇淋，并选定了8种核心口味。\n它们包括：香草，大量巧克力，香草N饼干，黄油山核桃，PB‘N软糖，蓝莓派，榛子巧克力块和覆盆子白松露。\n甘地在谈到建立另一个比完美日范围更广的业务时说：“我们想要创造一些视野更大、视野更广的东西，能够带来全面的创新。”“”完美日“关注的是…。我们制作了COW 2.0…。我们重新想象了奶牛…。(但是)我们希望(紧急公司)使用地球上的任何蛋白质。“。\n该公司如此无拘无束的部分原因是鼓励快速实验，原因很简单，因为没有太多时间采取必要的措施来减缓-理想情况下是逆转-气候变化。\n“你在地球上只有这么多时间，…。我们想要做更多的…。这就是为什么它被称为紧急公司..。(因为)让我们他妈的赶快行动起来吧。“", "note_en": "Focused on creating sustainable food brands manufactured, packaged and sold in a more environmentally friendly way, the Urgent Company is unveiling its first product —  Brave Robot ice cream.\n It’s also the first indication of how Perfect Day will deploy some of the massive amounts of money it raised  since it closed on its mammoth $300 million funding round led by the Canadian Pension Plan Investment Board with additional commitments from  Temasek and  Horizons Ventures.\n  Perfect Day founders Ryan Pandya and Perumal Gandhi first met their Urgent Company co-founder and general manager, Paul Kollessoff, when Kollessoff was performing due diligence on Perfect Day while working for the Irish dairy company  Glanbia.\n “What I was doing there was actually looking at new business ventures,” said Kollessoff. “I met the guys three years ago when we were doing some flavor work with them.”\n The conversation ended there while Pandya and Gandhi built up Perfect Day, but around three months ago the two founders reached back out with idea for a new consumer food company, based on the latest in plant-based, or genetically modified proteins (including their own), that also used the latest in packaging technology, logistics, and other technologies to reduce the entire carbon footprint of a CPG company.\n  “It’s not that we are trying to create a company that’s going to commercialize Perfect Day proteins,” said Pandya. “ There are so many other things across the value chain of food that need to be improved and modernized including all of the things around how a food gets to the consumer.”\n So Brave Robot’s commitment to sustainability extends beyond the use of alternative proteins to replace animal husbandry and the particularly ecologically disastrous dairy industry and its cows. “There’s a load of exciting stuff going on in ingredient innovation and packaging innovation,” said Kollessoff.\n Those innovations help The Urgent Company not only become more sustainable, but give the company the ability to move products into the market more quickly, according to Kollessoff.\n With only eight full-time members of the Urgent Company staff it managed to shepherd its ice cream business from inception to product launch within a three-month timeframe according to Kollessoff.\n  So Brave Robot will be launching with a direct to consumer pitch for its dairy-replacement pints of ice cream for a $5.99 price point. Initially available to customers in the California region, any number of buyers are talking to the company, Kollessoff said. “ We’ll be on store shelves through the next month. Working with a national broker… we will have a direct to consumer platform as well.”\n Before anything could happen with bringing a product to commercial scale, Kollessoff said he had to go through a rigorous process of testing the product — with his kids. At one point, there were 400 pints of ice cream in the Kollessoff freezer. He and his team whittled the initial over thirty flavors of ice cream and settled on a core group of eight.\n They include: Vanilla, A Lot of Chocolate, Vanilla ‘N Cookies, Buttery Pecan, PB ‘N Fudge, Blueberry Pie, Hazelnut Chocolate Chunk and Raspberry White Truffle.\n “We wanted to create something that is bigger and broader in vision that can bring innovation across the board,” said Gandhi of the drive to build another business with a broader scope than Perfect Day. “W hat Perfect Day is focusing on …we made cow 2.0… we’ve reimagined the cow… [but] we want [The Urgent Company] to use any protein on planet earth.”\n Part of the reason why the company is so unfettered is to encourage speedy experimentation for the simple reason that there’s not much time to take the steps needed to slow down — and ideally reverse — climate change.\n “You only get so much time on earth… and we wanted to do more… That’s why it’s called the urgent company.. [because] let’s hurry the fuck up world.”", "posttime": "2020-07-15 21:31:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "勇敢者,urgent", "title": "\n勇敢者冰激凌作为完美日支持的紧急公司的第一个品牌推出", "title_en": "\n\t\t\t\tBrave Robot ice cream launches as the first brand from the Perfect Day-backed Urgent Company\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/brave-robot-ice-cream-launches-as-the-first-brand-from-the-perfect-day-backed-urgent-company/", "via": "", "real_tags": ["勇敢者", "urgent"]}, {"category": "", "categoryclass": "", "imagename": "7b23fc6f0c9a9c6abe63c5bf30dc8ed1.png", "infoid": 1012018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最后一次机会：7月15日至17日在线举办的VB年度人工智能活动“注册转型”(Region For Transform)。\nMozilla已经向公众推出了虚拟专用网络(VPN)服务，从少数市场的Windows10和Android开始。该公司去年9月首次推出了基于浏览器的火狐专用网络(Firefox Private Network)，作为试点计划的一部分。6月，Mozilla透露，它将很快推出VPN，作为一个独立的跨平台产品，每月4.99美元，并将其更名为Mozilla VPN。\n快进一个月后，火狐浏览器制造商已经在美国、加拿大、英国、新加坡、马来西亚和新西兰正式推出了Mozilla VPN测试版，并计划在今年晚些时候向更多市场推出。同样值得注意的是，虽然iOS版本是测试版的一部分，但在最初推出时似乎还没有推出，仍然被冠以火狐专用网络(Firefox Private Network)的品牌。Mac和Linux的版本目前也在开发中。\nMozilla的推出很及时，因为过去几个月来，由于需要员工远程连接到公司网络的锁定措施，VPN的使用激增。虽然Mozilla的新VPN并不是专门针对企业领域的，但该公司希望通过将Mozilla VPN定位为一款专注于隐私的产品，完全通过订阅而不是通过出售用户数据来赚钱，从而赢得人心-没有免费版本。\nMozilla VPN运行在由Mullvad运营的全球服务器网络上，Mullvad是一家总部位于瑞典的商业开源VPN服务公司，其政策是“不登录”。这意味着它承诺不会记录用户的IP地址、浏览活动、会话持续时间、时间戳、DNS请求或类似的数据点。Mullvad还采用了轻量级WireGuard协议，这应该会使Mozilla VPN比市场上许多其他VPN更快。\n值得注意的是，Mozilla VPN需要一个Firefox帐户，这意味着当订户使用该服务时，VPN会收到订户的“电子邮件地址、区域设置和IP地址”。根据隐私政策，IP地址用于“近似您的位置，因为Mozilla VPN目前仅在某些国家可用”。此外，Mozilla VPN会向Mozilla发送与其安装的应用程序和设备的版本相关的“基本信息”，包括操作系统和硬件配置。然而，Mozilla表示，它不会保留用户数据日志。\nMozilla VPN可能不是终极关注隐私的VPN，但它确实出自一个知名的消费品牌，该品牌承诺通过优秀的老式付费客户赚钱。Mozilla自豪地宣称：“我们不会与第三方分析平台合作，这些平台想要建立你在网上做什么的个人资料。”", "note_en": "Last Chance:  Register for Transform, VB&#39;s AI event of the year, hosted online July 15-17.\n Mozilla has launched its virtual private network (VPN) service to the public, starting with Windows 10 and  Android in a handful of markets. The company debuted the browser-based Firefox Private Network  last September as part of a pilot program. In June, Mozilla revealed it would soon be launching the VPN as a standalone cross-platform product for $4.99 per month and rebranding it as  Mozilla VPN.\n Fast-forward a month, and the Firefox browser maker has officially launched Mozilla VPN out of beta in the U.S., Canada, the U.K., Singapore, Malaysia, and New Zealand, with plans to roll it out to additional markets later this year. It’s also worth noting that while an iOS incarnation was part of the beta phase, it doesn’t appear to be available at the initial rollout, remaining  branded as Firefox Private Network. Versions for Mac and Linux are also currently in development.\n  Mozilla’s launch is timely, as  VPN use has surged over  the past few months due to lockdown measures that have required workers to connect to corporate networks remotely. While Mozilla isn’t specifically targeting the corporate sphere with its new VPN, the company is hoping to gain hearts and minds by positioning Mozilla VPN as a privacy-focused product that is monetized entirely through subscriptions rather than by  selling user data — there is no free version.\n  Mozilla VPN runs on a global network of servers operated by  Mullvad, a commercial open source VPN service based in Sweden that has a “no-logging” policy. This means it promises to not record a user’s IP address, browsing activity, session duration, timestamp, DNS request, or similar data points. Mullvad has also adopted the lightweight  WireGuard protocol, which should make Mozilla VPN speedier than many other VPNs on the market.\n Is is worth noting that Mozilla VPN requires a Firefox account, which means the VPN receives the subscriber’s “email address, locale, and IP address” when they use the service. The IP address, according to the  privacy policy, is used to “approximate your location, because Mozilla VPN is currently only available in certain countries.” Additionally, Mozilla VPN sends Mozilla “basic information” relating to the version of the app and devices it’s installed on, including the operating system and hardware configuration. However, Mozilla said it doesn’t retain user data logs.\n Mozilla VPN might not be the ultimate privacy-focused VPN, but it does ship from a well-known consumer brand that has committed to making money through good old-fashioned paying customers. “We don’t partner with third-party analytics platforms who want to build a profile of what you do online,” Mozilla proudly proclaims.", "posttime": "2020-07-15 21:30:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,美国,android,vpn", "title": "Mozilla VPN退出测试版，在美国、加拿大、英国、新加坡、马来西亚和新西兰以每月5美元的价格在Android和Windows上推出", "title_en": "Mozilla VPN exits beta, launches on Android and Windows for $5 per month in the US, Canada, UK, Singapore, Malaysia, and New Zealand", "transed": 1, "url": "https://venturebeat.com/2020/07/15/mozilla-vpn-exits-beta-launches-on-android-and-windows-for-5-a-month/", "via": "", "real_tags": ["windows", "美国", "android", "vpn"]}, {"category": "", "categoryclass": "", "imagename": "5f74564baa2554a7fe87148bf4586c02.jpg", "infoid": 1012015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在马里奥多年来主演的所有衍生品中，纸质马里奥游戏(以及相关的马里奥和路易吉系列)最有能力地将这个角色扩展到他的基本平台根源之外。熟悉的人物、地点和物品仍然存在于纸质马里奥游戏中，但它们被全新的设置和情况所补充，这在传统的日本RPG中通常不会感到格格不入。即使是熟悉的马里奥角色也在这些游戏中获得了新的生命，揭示了丰富的内心生活和人物形象，这是简单的拯救公主的情节所无法比拟的。\n纸马里奥：“折纸大王”延续了这一传统，讲述了一个粗俗但引人入胜的、充满活力和魅力的、适合家庭的故事。但它如此严重地扰乱了该系列通常的RPG装饰品，以至于即使在最后的字幕滚动时，它仍然在寻找自己的立足点。作为一个完整的包装，折纸之王经常感觉像是原创想法的混合体-一些好的，一些平庸的-这些想法永远不会超过它们各部分的总和。\n就像马里奥的RPG游戏中经常发生的那样，鲍瑟国王已经被推到一边(并被关闭)，转而支持折纸王更有趣的对手。这一次，那个对手是奥利，一个漂浮的，折叠的，充满了通常定义不清的，情节移动的魔力。奥利发出了一些不那么微妙的种族至上主义的共鸣，他大声宣布，他希望将纸张马里奥王国的扁纸居民改造成更厚、更折叠的折纸版本。如果这些折叠版本成为受制于奥利意愿的僵尸般的自动机，那对他的新世界秩序就更好了。\n奥利一开始就把桃子公主变成了一个极其令人反感的折纸版本的自己，然后用一系列五颜六色的彩带包裹她的城堡，并将其举到火山顶端，从而超越了自己。他还着手于将鲍瑟的许多奴才转变为僵尸折纸士兵，留下剩下的平纸版本的鲍瑟的奴才们乐于帮助马里奥结成敌人-我的敌人的那种联盟。在奥利维亚的帮助下，奥利维亚不是偏执狂的折纸妹妹，摄制组不得不追查所有这些彩带的来源，并将它们转换成五彩纸屑，以解放桃子和王国。\n它不完全是莎士比亚的作品，而是适合家庭的、充满魔力的情节，伴随着必要数量的曲折和红鲱鱼。这项任务将带你穿越常见的场景(沙漠、冰、水、森林)，每个场景都充满了高度活跃和健谈的人物-尽管他们的动机往往像他们的外表一样薄。在每个领域看似简单的任务不可避免地会扩展成一系列可伸缩的所需的子任务；每个任务都代表着最终打破流线的目标的障碍，而且每个任务都比上一个更荒谬。\n文章写得相当犀利，混合了轻微的人物成长和健康的堆积如山的劫持(以及一些真正的成年人大声笑出声的元时刻)。这款游戏甚至挤出了相当一部分轻微影响角色的时刻，集中在个人牺牲的力量上。(说得多会毁了太多)。“折纸大王”在深度和复杂性上的不足之处在于，它用令人愉悦的愚蠢弥补了这一点。\n即使对于一个一直满足于忽略许多RPG游戏比喻的系列来说，折纸之王也不是传统的RPG。这一点在游戏的战斗系统中体现得很清楚，它更多地是关于空间关系的谜题，而不是通常的以回合为基础的事件。", "note_en": "Of all the spin-offs  Mario has starred in over the years, the  Paper Mario games (and the related  Mario &amp; Luigi series) most ably expanded the character past his basic platforming roots. The familiar characters, locations, and items are still there in  Paper Mario titles, but they&#39;re supplemented by completely new settings and situations that often wouldn&#39;t feel out of place in a traditional Japanese RPG. And even the familiar Mario characters get new life in these games, revealing rich interior lives and characterizations that the simple save-the-princess-again plots can&#39;t hope to match.\n Paper Mario: The Origami King continues this tradition, telling a cheesy-but-engaging, family-friendly story with verve and charm. But it messes with the series&#39; usual RPG trappings so much that it&#39;s still finding its footing even as the final credits roll. As a complete package,  Origami King often feels like a mishmash of original ideas—some good, some mediocre—which never quite come together as more than the sum of their parts.\n  As often happens in Mario&#39;s RPG titles, King Bowser has been pushed (and folded) aside in favor of a more interesting antagonist for  Origami King. This time around, that antagonist is Olly, a floating, folded being imbued with the usual ill-defined, plot-moving magical powers. Olly gives off some not-so-subtle racial supremacist vibes in loudly announcing his desire to transform the flat paper denizens of  Paper Mario&#39;s kingdom into thicker, folded origami versions of themselves. And if those folded versions become zombie-like automata beholden to Olly&#39;s will, it&#39;s all the better for his new world order.\n  Olly starts things off by transforming Princess Peach into an extremely off-putting origami-fied version of herself, then tops himself by wrapping her castle in a series of colorful streamers and lifting it away to the top of a volcano. He also goes about converting many of Bowser&#39;s minions into zombie-origami folded soldiers, leaving the remaining flat-paper versions of Bowser&#39;s minions happy to help Mario in an enemy-of-my-enemy kind of alliance. With the help of Olivia, Olly&#39;s non-monomaniacal origami sister, the crew has to trace all those streamers to their source and convert them to confetti to free Peach and the Kingdom.\n It&#39;s not exactly Shakespeare, but the family-friendly, magic-infused plotting hums along with the requisite number of twists and red herrings. The quest takes you through the usual settings (desert, ice, water, forest), each filled to the brim with highly animated and talkative characters—though their motivations tend to be as paper-thin as their appearances. What seems like a straightforward task in each area inevitably expands into a telescoping series of required subquests; each presents a barrier to the final streamer-busting goal, and each is more ridiculous than the last.\n    The writing is pretty sharp, mixing light character growth with a healthy heaping of hijinks (and some genuine laugh-out-loud meta moments for adults). The game even squeezes in its fair share of lightly affecting character moments focused on the power of personal sacrifice. (Saying more would spoil too much). What  Origami King lacks in depth and complexity, it makes up for in joyful silliness.\n  Even for a series that&#39;s always been content to ignore many RPG gameplay tropes,  Origami King is not a traditional RPG. This comes through clearly in the game&#39;s battle system, which is more about spatial-relation puzzles than the usual turn-based affair.", "posttime": "2020-07-15 21:09:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "马里奥,mario,折纸", "title": "纸张马里奥：折纸大王将常见的RPG比喻折成结", "title_en": "Paper Mario: The Origami King folds the usual RPG tropes into knots", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/paper-mario-the-origami-king-folds-the-usual-rpg-tropes-into-knots/", "via": "", "real_tags": ["马里奥", "mario", "折纸"]}, {"category": "", "categoryclass": "", "imagename": "2bc70fcb4ed1597dbb49224d6f026d04.jpg", "infoid": 1012014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "夏尔巴-FX将在即将到来的SpaceX拼车任务中首次执行任务，目前最早将于2020年12月起飞。太空飞行轨道转移飞行器的首次飞行将搭载来自多个不同公司和组织的16个小航天器，其中包括美国国家航空航天局(NASA)和南佛罗里达大学应用工程学院(University Of South佛罗里达)应用工程学院的一个。\n这是太空飞行的Sherpa-NG计划产生的第一个航天器，该计划致力于开发和部署下一代技术，从SpaceX等供应商签订的合同运载火箭的主要有效载荷部署的角度进行有效载荷部署和管理。这是确保拼车模型为有效载荷操作员工作的关键一步，因为虽然将有效载荷组合在一枚火箭上非常有利于支付发射成本，但对于实际确保您的航天器最终到达其实际运行的轨道来说，这远远不是理想的做法。\n火箭实验室(Rocket Lab)等公司的主营业务采用了专用的拼车模式，它们有自己的轨道转移工具，为单一客户部署更大有效载荷的运营商也是如此。SpaceSpace的整个业务基于提供必要的技术和服务，以支持像SpaceX和Rocket Lab这样的公司，并在单次发射支持更多部署方面提供更大的灵活性和优化。\n太空飞行公司。该公司今年早些时候被日本工业巨头三井物产(Mistui&amp；Co)收购，但本着同样的运营目标，继续在美国总部之外独立运营。", "note_en": "The Sherpa-FX will fly its debut mission on an upcoming  SpaceX   rideshare mission, currently set to take off as early as December 2020. The inaugural flight of the Spaceflight orbital transfer vehicle will carry 16 small spacecraft from a number of different companies and organizations, including one for NASA and one for the University of South Florida’s Institute of Applied Engineering.\n This is the first spacecraft that has resulted from Spaceflights’ Sherpa-NG program, which is dedicated to developing and deploying next-generation technology for payload deployment and management from the point of primary payload deployment from a contracted launch vehicle from providers like  SpaceX  . This is a key step in ensuring that rideshare models work for payload operators, since while combining payloads on a single rocket is great for defraying the cost of launch, it’s far from ideal for actually ensuring your spacecraft ends up in the orbit where it’ll actually be operating.\n  Companies like  Rocket Lab,   which employs a dedicated rideshare model for its main business, have their own orbital transfer vehicles, as do operators who deploy larger payloads for single customers. Spaceflight’s entire business is predicated on supplying the technology and services necessary to take companies like SpaceX, as well as Rocket Lab, and offer even more flexibility and optimization in terms of supporting a larger number of deployments from a single launch.\n Spaceflight, Inc. was acquired earlier this year by Japanese industrial giant Mistui &amp; Co, but continues to operate independently out of its U.S. HQ with the same operational goal in mind.", "posttime": "2020-07-15 21:08:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,太空,转移,orbital,部署", "title": "\n太空飞行公司。首次亮相用于卫星拼车火箭发射的新型轨道转移飞行器", "title_en": "\n\t\t\t\tSpaceflight Inc. debuts new orbital transfer vehicle for satellite rideshare rocket launches\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/spaceflight-inc-debuts-new-orbital-transfer-vehicle-for-satellite-rideshare-rocket-launches/", "via": "", "real_tags": ["火箭", "太空", "转移", "orbital", "部署"]}, {"category": "", "categoryclass": "", "imagename": "fdc1d82f0095a3ff22fc3ae3ca41a6fa.jpg", "infoid": 1012013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这款名为Zoom for Home-dten ME的设备正在由合作伙伴dten生产。它由一个独立的27英寸屏幕组成，本质上是一个大平板电脑，配备了三个专为高分辨率视频设计的广角摄像头和8个麦克风。变焦软件预装在设备上，界面设计用于轻松访问常用的变焦功能。\nZoom Room的负责人杰夫·史密斯(Jeff Smith)说，这个想法是为了提供一种你可以从盒子里拿出来的电器，它可以随时使用，而且大惊小怪。史密斯告诉TechCrunch：“Zoom for Home是Zoom的一项倡议，它允许任何Zoom用户为他们的视频会议、电话、交互式白板注释部署个人协作设备-所有你想在Zoom上做的好事情，你都可以用一个专门建造的设备来做。”\n他说，这是在设计时考虑到简单性，这样你就可以把它从盒子里拿出来，通过在你的笔记本电脑或手机上的网站上输入配对代码来启动界面。一旦界面出现，你只需触摸你想要的功能，如打电话或开始会议，它就会自动连接。\n您可以将其链接到您的日历，以便您的所有会议都显示在侧边栏中，您只需触摸下一个会议即可进行连接。如果您需要共享您的屏幕，它包括设备与您的笔记本电脑或手机之间的超声波配对。史密斯说，这与蓝牙的工作原理类似，但它不是发出无线电信号，而是在18到22 kHz之间发出大多数人听不到的声音来连接这两个设备。\n史密斯说，Zoom将与另外两个合作伙伴一起推出，包括Neat Bar和Poly Studio X系列，并可能在未来增加其他合作伙伴。\ndten设备的售价为599美元，可与现有的Zoom许可证配合使用。该公司正在接受预订，预计这些设备将于下个月发货。", "note_en": "The device dubbed the  Zoom for Home – DTEN ME, is being produced by partner DTEN. It consists of a stand-alone 27 inch screen, essentially a large tablet equipped with three wide-angle cameras designed for high-resolution video and 8 microphones. Zoom software is pre-loaded on the device and the interface is designed to provide easy access to popular Zoom features.\n   Jeff Smith, head of Zoom Rooms, says that the idea is to offer an appliance that you can pull out of the box and it’s ready to use with minimal fuss. “Zoom for Home is an initiative from Zoom that allows any Zoom user to deploy a personal collaboration device for their video meetings, phone calls, interactive whiteboard annotation — all the good stuff that you want to do on Zoom, you can do with a dedicated purpose-built device,” Smith told TechCrunch.\n He says this is designed with simplicity in mind, so that you pull it out of the box and launch the interface by entering a pairing code on a website on your laptop or mobile phone. Once the interface appears, you simply touch the function you want such as making a phone call or starting a meeting and it connects automatically.\n  You can link it to your calendar so that all your meetings appear in a sidebar, and you just touch the next meeting to connect. If you need to share your screen it includes ultrasonic pairing between the appliance and your laptop or mobile phone. This works like Bluetooth, but instead of sending out a radio signal, it sends out a sound between 18 and 22 kHz, which most people can’t hear, to connect the two devices, Smith said.\n Smith says Zoom will launch with two additional partners including the Neat Bar and the Poly Studio X Series, and could add other partners in the future.\n The DTEN appliance will cost $599 and works with an existing Zoom license. The company is taking pre-orders and the devices are expected to ship next month.", "posttime": "2020-07-15 21:08:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,introduces,设备", "title": "\nZoom推出一体式家庭通讯设备，售价599美元", "title_en": "\n\t\t\t\tZoom introduces all-in-one home communications appliance for $599\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/zoom-introduces-all-in-one-home-communications-appliance-for-599/", "via": "", "real_tags": ["推出", "设备"]}]