[{"category": "", "categoryclass": "", "imagename": "c3c779aeda825a5f8a9b70a8c62cd9fc.jpg", "infoid": 1015474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2008年3月8日，一场大火烧毁了IBM 025大楼。现在，在圣何塞南部的一个停车场里，在劳氏和汽车区之间，一座小小的纪念碑纪念着曾经是硅谷开创性科技园区的地方。\n校园建于1957年，是建筑师约翰·S·博尔斯的设计。在IBM总裁小托马斯·J·沃森(Thomas J.Watson，Jr.)的授权下，他被指示将“建筑、景观和艺术融入员工友好的环境中”，一块说明性的展示牌写道。\n如果这听起来很耳熟，那就应该是：硅谷的许多科技园区都使用同样的元素来激励员工。著名的壁画家露西安·布洛赫(Lucienne Bloch)设计了陶瓷马赛克，建议使用电脑打孔卡覆盖建筑的大片区域，带有落地玻璃窗的砖结构通过庭院和走道连接起来。\n这个环境似乎已经被证明是一个创造性的环境，IBM大楼025内研究实验室的工程师们开发了“飞头”磁盘驱动技术，使得网上购物和互联网通信等实时过程成为可能。1959年，IBM自豪地在校园里接待了苏联总理尼基塔·赫鲁晓夫(Nikita Khrushchev)。据报道，他对展出的技术不以为然，反而爱上了公司的自助自助餐厅。\n但到了1996年，025号楼空无一人。该公司逐渐将员工转移到其他地方。2003年，洛威家装公司决定在老校区原址建店。当地的环保人士表示抗议，大楼一直处于悬而未决的状态，直到大火彻底解决了问题。洛威资助了这个小小的纪念馆，它的砖墙和钢架清楚地让人回想起失落的实验室，他们自己的大盒子建筑和附近的AutoZone都覆盖着露西安·布洛赫(Lucienne Bloch)风格的马赛克。", "note_en": "On March 8, 2008, a fire consumed IBM Building 025. Now, in a parking lot in south San José, between a Lowe’s and an AutoZone, a tiny monument memorializes what was once Silicon Valley’s pioneering tech campus.\n Built in 1957, the campus was the design of the architect John S. Bolles. Under the mandate of IBM’s president, Thomas J. Watson, Jr., he was instructed to blend “architecture, landscape and art into an employee-friendly environment,” notes an explanatory display sign.\n If that sounds familiar, it should: many a Silicon Valley tech campus uses those same elements to inspire their employees. Notable muralist Lucienne Bloch designed ceramic mosaics that suggested computer punch cards to cover wide swaths of the buildings, and brick structures with floor-to-ceiling glass windows were connected by patios and walkways.\n The environment seems to have proved a creative one.  Engineers at the research laboratory within IBM Building 025 developed “flying head” disc drive technology, making real-time processes such as online shopping and Internet communication possible. IBM proudly hosted Soviet premier Nikita Khrushchev at the campus in 1959. Reportedly unimpressed with the technology on display, he instead fell in love with the company’s self-service cafeteria.\n But by 1996, Building 025 stood empty. The company gradually shifted its employees elsewhere. In 2003, Lowe’s Home Improvement decided to build a store on the site of the former campus. Local preservationists protested, and the building stayed in limbo until the fire settled the matter once and for all. Lowe’s funded the tiny memorial, with its brick walls and steel trellises clearly calling back to the lost laboratory, and both their own big-box building and the nearby AutoZone are covered in Lucienne Bloch-style mosaics.", "posttime": "2020-08-01 03:00:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ibm", "title": "IBM大楼025", "title_en": "IBM Building 025", "transed": 1, "url": "https://www.atlasobscura.com/places/ibm-building-025", "via": "", "real_tags": ["ibm"]}, {"category": "", "categoryclass": "", "imagename": "d408ba1ecc2d82d7ac23f4d337caf19b.png", "infoid": 1015473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这第二张图表显示了谷歌趋势对搜索词“比特币”的每月得分，也是自2013年10月以来的得分。\n当我第一次看到第二张图表时，我觉得它看起来与第一张非常相似。果然，的确如此。下面是两张图表的总和。深色的线条根据左边的轴显示价格，浅色的线条根据右边的轴显示Google Trends得分。\n事实证明，比特币的价格和它的谷歌趋势得分是相当相关的。\n具体地说，自2013年10月以来，它们的正相关性为72%。相比之下，去年比特币与股市的关联度为26%，与黄金的关联度为24%。\n我应该指出的是，比特币价格与谷歌趋势得分之间的相关性在2017年12月价格和得分都达到峰值(98%)之前要强得多，而不是自那以来(59%)。\n尽管如此，这项分析的目的不是为了争论相关性的程度，也不是为了断言两者之间的因果关系(尽管价格和受欢迎程度似乎是相互影响的，这似乎是合乎逻辑的)。相反，这项分析的目的是对比特币的价格做出投机性预测，如果比特币的受欢迎程度(以谷歌趋势得分衡量)回到并超过之前的历史最高水平时，比特币的价格可能会是多少。\n为了做出这一预测，我们首先必须考虑比特币平均价格与其每月Google Trends得分之间的历史比率。让我们将其简称为价格：分数率(Price：Score Ratio)。\n下图显示了比特币的价格与得分比在过去几年中是如何提高的。\n对于一个历史上一直相对波动的比率来说，最近两个月(6月和7月)一直保持着异常一致的729，距离2019年11月创下的758的历史高点只差4%。\n比特币的价格：得分比在过去12个月中有9个月超过645，此前只有一次达到这样的水平，几乎没有达到(2018年10月达到646)。\n去年有3个月的比率低于645，这是相当容易解释的。它们发生在刚刚过去的3月、4月和5月，因为预计比特币将在2020年5月11日每四年一次减半，炒作越来越多。此外，当股市在大流行导致的封锁初期暴跌约30%时，人们可能比往常更多地搜索有关另类资产(包括比特币)的信息。这两个因素加在一起似乎足以解释比特币在谷歌趋势(Google Trends)得分在此期间的上升。在价格：得分比的另一边，比特币的价格随着市场的下跌而下降，所以随着价格的下降和得分的上升，这几个月价格：得分比的下降是有意义的。\n由于股市大幅回升，减半事件来来去去并没有实质性影响比特币的价格，谷歌趋势得分已回到大流行之前、减半之前的炒作范围。过去两个月(6月和7月)，比特币的谷歌趋势月度得分稳定在13分，与2018年4月(峰值之后)至2020年2月(炒作减半和市场崩盘之前)的平均值持平。\n对于一些额外的背景，应该指出的是，比特币的谷歌趋势得分在比特币问世后的7个月里才等于或大于21，而且它们都是连续发生在2017年9月至2018年3月比特币上一次大幅飙升的周围(得分按时间顺序为21、22、44、100、55、39和23)。\n我只想说，自上次飙升以来，比特币的平均得分为13分，不包括从今年早些时候开始的上述3个月(如果包括的话，为14分)，客观地表明比特币正在悄悄飞行(至少就其作为搜索词的受欢迎程度而言)。当然，对于每天密切关注密码的人来说，这看起来可能不是这样的，但算法和大量数据收集的谷歌趋势得分应该比任何一个人对当前炒作和关注水平的投机性和主观观察更可信。\n如果你和我一样，相信比特币现在是，而且已经在雷达下飞行了两年多，那么自然要问的问题是这样的。当情况不再是这样的时候，我们期望发生什么呢？换句话说，如果比特币达到下一个炒作周期的顶峰，它的价格会发生什么？下一次我们看到类似于2017年12月的情况时，比特币可能会飞得多高？\n我相信，通过将过去12个月比特币的平均价格：得分比(643)与谷歌趋势得分100进行比较，估计如果价格：得分比保持不变，比特币在搜索方面的受欢迎程度恢复到历史最高水平，可以对这个问题做出合理的回答。此预测所隐含的价格约为65,000美元，如下图右上角的最大值所示。基本上，如果人们认为比特币至少会在某个时候恢复到2017年12月的受欢迎程度，这种方法将导致他预计比特币届时的价格至少会达到6万美元。\n这一估计可以通过两种方式变得不那么保守。第一种是假设价格：得分比将一如既往地继续增加(环比6%)，而不是使用该比率的LTM平均值来计算价格。第二种假设是，比特币作为一个搜索词的受欢迎程度将远远超过2017年12月创下的前一个历史高点，就像历史上的人气是之前任何一个高点的两倍多，比2017年5月之前的历史高点高出8倍以上(后者是在2013年12月创下的，或许不是巧合的是，恰好在最近的历史高点之前4年或减半)。我不愿称这两个不那么保守的假设中的任何一个是激进的，因为如果简单地假设历史趋势将在得分和比率方面继续下去，它们不仅是合理的，而且实际上是可能的。\n因此，在结束时，我将提供一个图表，您可以使用该图表来近似计算他们自己输入的Google Trends分数和价格分数比所隐含的价格。在此图表中，我显示了过去12个月、2年、3年等的比率，并使用这些数字之间的平均同比增长率(16%)来预测未来12个月(“NTM”)、未来两年(“N2Y”)和未来3年(“N3Y”)的比率。\n图表上预测的最高价格正好在30万美元左右，这是Google Trends得分的3倍于之前的历史最高水平(300)，预计N3Y的价格：得分比为996(LTM的平均价格643在3年内增长了16%)。当然，这个最高价格预测只受我决定在这张图表上显示的分数和比率的最大值的任意限制。\n许多人采用了许多方法来试图准确预测比特币的价格。例如，PLANB的库存与流量比率着眼于稀缺性，以做出我见过的更有说服力的价格预测之一。我的价格：得分比着眼于努力做到同样的受欢迎程度。这一分析并不是完全全面的。我的意图仅仅是介绍这种方法论，以供他人批评。因此，我希望这篇文章能得到足够广泛的阅读，这样我就可以收到足够的批判性反馈，以便进一步考虑和改进方法。", "note_en": "This second chart shows the  Google Trends Score by month for the search term “bitcoin”, also since October 2013.\n  When I first saw the second chart, I thought it looked remarkably similar to the first. Sure enough, it does. Below are the two charts together. The darker line shows the price according to the left-side axis and the lighter line shows the Google Trends Score according to the right-side axis.\n  It turns out that bitcoin’s price and its Google Trends Score are quite correlated.\n Specifically, they have had a 72% positive correlation since October 2013. This compares favorably to bitcoin’s  26% correlation with the stock market and 24% correlation with gold over the last year.\n I should note that the correlation between bitcoin’s price and its Google Trends Score was much stronger up until both price and score peaked in December 2017 (98%) than it has been since (59%).\n Nonetheless, the purpose of this analysis is not to argue about the level of correlation nor to assert causation one way or another (though it seems logical that the price and popularity feed off of each other). Rather, the purpose of this analysis is to make a speculative projection regarding what bitcoin’s price could be if and when its popularity (as measured by its Google Trends Score) returns to and surpasses its previous all-time high.\n In order to make this projection, we first must consider the historical ratio between bitcoin’s average price and its Google Trends Score on a monthly basis. Let us refer to this as the   price:score ratio  for short.\n  The chart below shows how bitcoin’s price:score ratio has increased over the last several years.\n  For a ratio that has been relatively volatile historically, it has remained unusually consistent for the last two months (June &amp; July) at 729, just 4% short of its all-time high of 758 in November 2019.\n Bitcoin’s price:score ratio has been above 645 for 9 of the last 12 months after having only reached such a level once before, and barely (646 in October 2018).\n The 3 months in the last year during which the ratio was lower than 645 can be fairly easily explained. They took place this past March, April, and May as hype grew in anticipation of bitcoin’s once every four years halving event on May 11, 2020. Additionally, people perhaps were searching more than usual for information about alternative assets (including bitcoin) when the stock market crashed ~30% in the early days of the lockdown resulting from the pandemic. Those two factors together seem sufficient to explain the uptick in bitcoin’s Google Trends Score over that period. On the other side of the price:score ratio, bitcoin’s price fell along with the market, and so with the price going down and the score going up, the decreased price:score ratio over those few months makes sense.\n Since the stock market substantially recovered and the halving event came and went without materially moving bitcoin’s price, the Google Trends Score has returned to the pre-pandemic, pre-halving-hype range. For the last two months (June &amp; July), bitcoin’s monthly Google Trends Score has stayed steady at 13, which is equal to its average from April 2018 (after the peak) through February 2020 (before the halving hype and market crash).\n For some additional context, it should be noted that bitcoin’s Google Trends Score has only been equal to or greater than 21 in 7 months since bitcoin’s inception and they all took place consecutively surrounding bitcoin’s last major surge from September 2017 through March 2018 (with scores chronologically of 21, 22, 44, 100, 55, 39, and 23).\n  Sufficed to say, bitcoin’s average score of 13 since the last surge, excluding the three aforementioned months from earlier this year (14 if we include them), shows objectively that bitcoin is flying under the radar (in terms of its popularity as a search term at least). Of course, it may not seem this way to people who follow crypto closely and daily but the algorithmic and mass-data collecting Google Trends Score should be trusted over any single person’s speculative and subjective observation about the current level of hype and attention.\n If you, like me, believe that bitcoin is and has been flying under the radar for more than two years now, the natural question to ask is this. What do we expect to happen when that is no longer the case? In other words, what happens to bitcoin’s price if and when it reaches the pinnacle of its next hype cycle? How high might bitcoin fly the next time we see a situation similar to that of December 2017?\n  I believe a reasonable response to this question can be made by applying bitcoin’s average price:score ratio over the last twelve months (643) to a Google Trends Score of 100 to estimate what bitcoin’s price would be if the price:score ratio stays about constant and bitcoin’s popularity in terms of search returns to its all-time high. The price implied by this projection is about $65,000 as is demonstrated by the maximum value in the top right corner of the chart below. Basically, if one believes that bitcoin will at least at some point return to the level of popularity it attained in December 2017, this methodology would lead that person to expect bitcoin to attain a price of at least $60,000 at that time.\n  This estimate can be made less conservative in two ways. The first is to assume that the price:score ratio will continue to increase as it has all along (6% month-over-month), rather than calculating the price using the LTM average of the ratio. The second is to assume that bitcoin’s popularity as a search term will well surpass its previous all-time high set in December 2017 just as that all-time was more than twice as great as any high before it and more than 8 times greater than the all-time high before May 2017 (which was set in December 2013, perhaps not coincidentally exactly 4 years or one halving period prior to the latest all-time high). I hesitate to call either of these two less conservative assumptions aggressive because they are not only reasonable but actually probable if one is to simply assume that the historical trends will continue in terms of the score and the ratio.\n As such, I will close by presenting a chart which one can use to approximate the price implied by their own inputs for the Google Trends Score and the price:score ratio. In this chart, I show the ratio for the last 12 months, 2 years, 3 years, and so on, and use the average year-over-year growth rate between those figures (16%) to project the next twelve months (“NTM”), next two years (“N2Y”), and next three years (“N3Y”) ratios.\n The highest price projected on the chart is right around $300,000 based on a Google Trends Score of 3 times the previous all-time high (300) and a projected N3Y price:score ratio of 996 (the LTM average of 643 increased 16% 3 times for 3 years). Of course, this maximum price projection is limited only arbitrarily by the maximums I have decided to present on this chart for both the score and the ratio.\n   Many people have employed many methodologies in attempting to accurately project bitcoin’s price. For example,  PlanB‘s stock to flow ratio looks at scarcity to make one of the more convincing price projections I’ve seen. My price:score ratio looks at popularity in endeavoring to do the same. This analysis was not intended to be totally comprehensive. My intention was to merely to introduce this methodology for others to critique. As such, my hope is that this become widely enough read so that I may receive ample critical feedback for further consideration and refinement of the methodology.", "posttime": "2020-08-01 02:59:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,比特币,价格,bitcoin", "title": "用人气预测比特币的价格(谷歌趋势)", "title_en": "Projecting Bitcoin's Price with Popularity (Google Trends)", "transed": 1, "url": "https://blogofjake.com/2020/07/31/projecting-bitcoins-price-with-popularity-google-trends/", "via": "", "real_tags": ["google", "谷歌", "比特币", "价格", "bitcoin"]}, {"category": "", "categoryclass": "", "imagename": "e56e91477861f37d637a8c0377961921.jpg", "infoid": 1015472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周五，通用汽车公司和电动汽车充电公司eVgo宣布，他们正在合作加强国家的直流快速充电基础设施。计划部署2700多台直流快速充电器，能够以100-350kW的功率充电，每个站至少有4个充电器。推广工作将于2021年开始，应于2025年完成。\n通用汽车即将投入生产一种名为BEV3的新电池电动汽车架构和一种名为Ultium的新电池组设计。该公司还计划在这些灵活的基础上开发多款新的BEV。\n第一款是将于8月7日正式亮相的SUV凯迪拉克Lyriq；紧随其后的应该是一款电动GMC悍马，它很可能配备200kWh电池和800V架构(因此将受益于350kW的充电器)。(Cadillac Lyriq将于8月7日正式亮相；其次是GMC电动悍马，它很可能配备200kWh电池和800V架构(因此将受益于350kW充电器)。\n我们知道充电生态系统对司机有多重要，其中包括使用方便可靠的公共快速充电。通用汽车董事长兼首席执行官玛丽·巴拉在一份声明中表示：我们与eVgo的合作将在市场需求增长之前，增强电动汽车客户可用的公共快速充电网络，并强化我们对全电动、零排放未来的承诺，通用汽车董事长兼首席执行官玛丽·巴拉(Mary Barra)在一份声明中表示。\n据Green Car报道，eVgo正在寻找新充电器的40个主要大都市地区。目前，这两家公司只是表示，充电站将建在显眼的地方。EeVgo目前运营着800个快速充电站，几乎是Etrify America的两倍(后者目前有452个活跃的充电站，另有104个正在建设中)。\n通用汽车和eVgo都没有谈论建造这些新充电器的成本；在电气化美国的案例中，由于柴油排放作弊丑闻，大众被要求在充电基础设施上花费20亿美元。", "note_en": "On Friday, General Motors and the electric vehicle charging company EVgo announced they are partnering to beef up the nation&#39;s DC fast charging infrastructure. The plan is to deploy more than 2,700 DC fast chargers, capable of charging at 100-350kW, with at least four chargers per station. The rollout will begin in 2021 and should be complete by 2025.\n GM is about to put into production  a new battery EV architecture called BEV3 and a new battery pack design called Ultium. The company also has plans for multiple new BEVs built on these flexible underpinnings.\n The first of these will be an SUV, the Cadillac Lyriq, which is being officially unveiled on August 7; next after that should be an electric GMC Hummer, which may well pack a 200kWh battery and an 800V architecture (which would therefore benefit from a 350kW charger).\n &#34;We know how important the charging ecosystem is for drivers, one that includes access to convenient and reliable public fast charging. Our relationship with EVgo will bolster the public fast charging network available to EV customers ahead of increased market demand and reinforce our commitment to an all-electric, zero-emissions future,&#34; said GM chairperson and CEO Mary Barra in a statement.\n According to Green Car Reports, EVgo is looking at 40 major metropolitan areas for the new chargers. For now, the two companies are merely saying that the charging stations &#34;will be located in highly visible areas.&#34; EVgo currently operates 800 fast charging stations, almost twice that of  Electrify America (which currently has 452 active sites with another 104 currently in the works).\n Neither GM nor EVgo is talking about how much it will cost to build out these new chargers; in the case of Electrify America, Volkswagen was required to spend $2 billion on charging infrastructure as a result of the  diesel-emissions cheating scandal.", "posttime": "2020-08-01 02:36:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "通用汽车,evgo,fast,充电", "title": "通用汽车与eVgo合作部署2700多台新的直流快速充电器", "title_en": "GM teams up with EVgo to deploy more than 2,700 new DC fast chargers", "transed": 1, "url": "https://arstechnica.com/cars/2020/07/gm-teams-up-with-evgo-to-deploy-more-than-2700-new-dc-fast-chargers/", "via": "", "real_tags": ["通用汽车", "evgo", "fast", "充电"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，您可以通过将WordPress.com帐户连接到TechCrunch来节省登录时间。", "note_en": "You can now save time spent logging in by connecting your WordPress.com account to TechCrunch.", "posttime": "2020-08-01 02:35:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tech,连接", "title": "\n大型科技公司远程进入国会", "title_en": "\n\t\t\t\tBig tech goes to Congress remotely\t\t\t", "transed": 1, "url": "https://techcrunch.com/video-article/big-tech-goes-to-congress-remotely/", "via": "", "real_tags": ["tech", "连接"]}, {"category": "", "categoryclass": "", "imagename": "6686336fe948dd688938f35e14e08aca.jpg", "infoid": 1015469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Netflix通过新的播放控制，让人们选择在手机或平板电脑上观看节目的速度。\nNetflix将允许Android移动设备上的任何人以0.5x或0.75x的速度流媒体，以减缓观看速度；以1.25x或1.5x的速度流媒体，以加快观看速度。这些选项比YouTube略少，YouTube允许人们将速度一直放慢到0.25倍，而速度则是正常播放速度的两倍。人们已保存以供脱机观看的下载书目也提供播放速度选项。\n订阅者必须选择对他们想看的每一个节目使用播放速度；当你选择其他节目观看时，它不会仅仅保持活动状态。这可以防止人们在不愿意的情况下以1.5倍的速度意外观看所有内容。该功能将于明天推出，并将在未来几周内向全球所有人开放。\nNetflix宣布将于2019年测试这一功能，并遭到好莱坞创意社区的强烈反对。演员亚伦·保罗(Aaron Paul)和导演布拉德·伯德(Brad Bird)公开反对Netflix引入回放控制的决定，导演贾德·阿帕托(Judd Apatow)在10月份的推特上表示，“发行商无权改变内容的呈现方式。”\n订阅者必须选择对他们想要观看的每个节目使用播放速度。\n据Netflix公司称，Netflix的团队正在推出一系列功能，试图与创意社区合作，以确保内容的质量不会受到影响，包括自动纠正“音频中的音调以更快和更慢的速度”。\n一位发言人告诉The Verge：“我们也注意到了一些创作者的担忧。”“这就是为什么我们对播放速度设定了上限，并要求会员每次观看新节目时都要改变播放速度--而不是根据上次使用的速度来调整设置。”\n创意社区希望以特定的方式看待他们的作品，这是可以理解的。这就是为什么克里斯托弗·诺兰(Christopher Nolan)拒绝让他的电影在剧院以外的任何地方首映。但在过去的几十年里，分销方式发生了变化，已经扰乱了这个行业。VHS、DVD和蓝光播放器，加上数字零售商和PVR，让观众可以更好地控制他们观看电影和电视节目的方式。有些人以更快的播放速度收听播客，而据传闻，我观看所有YouTube视频的速度都快了一倍。\nNetflix负责产品创新的副总裁基拉·罗宾逊(Keela Robison)谈到了多年来允许不同类型观看的技术变化，以及为什么Netflix在短暂的测试阶段后决定继续前进。\n罗宾逊写道：“这项功能多年来一直受到会员们的强烈要求。”“最重要的是，我们的测试表明，消费者看重的是它提供的灵活性，无论是重看他们最喜欢的场景，还是因为他们在看字幕或有听力困难而放慢了速度。”\n全国聋人协会和全国盲人联合会都称赞Netflix增加了播放功能。全美聋人协会(National Association Of The Deaf)首席执行官霍华德·A·罗森布鲁姆(Howard A.Rosenblum)表示，由于字幕速度会变慢(也会加快)，以跟上屏幕上的图像，这可以帮助那些可能更喜欢以稍慢速度显示字幕的聋人。另一方面，全国盲人联合会(National Federation Of The Blind)的董事会成员埃弗雷特·培根(Everette Bacon)在一份声明中说，盲人社区中的许多人“可以理解和欣赏音频播放的速度，比大多数有视力的人可能感到舒适的速度要快得多”。\nNetflix计划密切关注创意社区和订户对播放速度的反应。该公司还将开始在iOS设备和该应用的网络版上进行测试，但Netflix的电视应用还没有设定测试阶段。", "note_en": "Netflix is letting people choose the speed at which they want to watch something on their phone or tablet with new playback controls.\n Netflix will allow anyone on an Android mobile device to stream at either 0.5x or 0.75x speeds for slowed-down viewing and 1.25x or 1.5x speeds for faster watching. Those are slightly fewer options than YouTube, which allows people to slow all the way down to 0.25x speeds, and speed up by twice the normal playback speed. Playback speed options are also available on downloaded titles that people have saved for offline viewing.\n Subscribers must opt in to use the playback speeds with every single title they want to watch; it won’t just remain active when you pick something else to watch. This prevents people from accidentally watching everything at 1.5x speed if they don’t want to. The feature is rolling out tomorrow and will be available to everyone globally in the coming weeks.\n Netflix announced it  was testing the feature in 2019 and was met with backlash from Hollywood’s creative community. Actor Aaron Paul and director Brad Bird spoke out against Netflix’s decision to introduce the playback controls, and director Judd Apatow  tweeted in October that “distributors don’t get to change the way the content is presented.”\n Subscribers must opt in to use the playback speeds with every single title they want to watch\n Netflix’s team is introducing a number of features with the rollout to try to work with the creative community to ensure the quality of the content isn’t disrupted, including automatically correcting “the pitch in the audio at faster and slower speeds,” according to the company.\n “We’ve also been mindful of the concerns of some creators,” a spokesperson told  The Verge. “It’s why we have capped the range of playback speeds and require members to vary the speed each time they watch something new — versus fixing their settings based on the last speed they used.”\n The creative community understandably wants their work to be seen a specific way. It’s why Christopher Nolan refuses to have his movies premiere anywhere other than in a theater. But distribution methods have changed over the last few decades that have already disrupted the industry. VHS, DVD, and Blu-ray players, alongside digital retailers and PVRs have given viewers more control over how they watch movies and TV shows. There are people who listen to podcasts at faster playback speeds and, anecdotally, I watch all YouTube videos at twice the speed.\n Keela Robison, Netflix’s vice president of product innovation, addressed the changes in technology that have allowed for different types of viewing over the years, and why Netflix decided to move forward after a brief testing phase.\n  “The feature has been much requested by members for years,” Robison wrote. “Most important of all, our tests show that consumers value the flexibility it provides whether it’s rewatching their favorite scene or slowing things down because they’re watching with subtitles or have hearing difficulties.”\n Both the National Association of the Deaf and the National Federation of the Blind commended Netflix on adding the playback features. Since captions are slowed down (and also sped up) to keep in time with the images on-screen, it can help deaf people who might prefer the captions at a slightly slower speed, according to Howard A. Rosenblum, CEO of the National Association of the Deaf. On the other side, many people in the blind community “can understand and appreciate audio played at a much faster pace than what might be comfortable for most sighted people,” Everette Bacon, a board member on the National Federation of the Blind, said in a statement.\n Netflix is planning to keep an eye on the response to the playback speeds from both the creative community and subscribers. The company is also set to begin testing on iOS devices and the web version of the app, but there’s no testing phase set for Netflix’s TV app.", "posttime": "2020-08-01 02:34:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,ios,rolling,速度", "title": "Netflix正在Android设备上推出最高0.5倍慢或1.5倍快的播放速度控制，并将开始测试iOS版的选项", "title_en": "Netflix is rolling out playback speed controls of up to 0.5x slower or 1.5x faster on Android devices and is set to begin testing the option for iOS", "transed": 1, "url": "https://www.theverge.com/2020/7/31/21348693/netflix-playback-speed-slow-fast-mobile-android-web-tv-streaming?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["android", "ios", "rolling", "速度"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛罗里达州坦帕市。(WFLA)-根据监狱记录和希尔斯伯勒州检察官办公室，一名坦帕市少年目前在监狱中，被控是社交媒体网站Twitter黑客事件的幕后黑手，这起事件导致对该网站和高调账户的访问受到限制。\n贵方的瑞安·休斯收到了关于17岁的格雷厄姆·克拉克被捕的独家消息。\n希尔斯堡州检察官安德鲁·沃伦本周对这名青少年提出了30项重罪指控，指控他与7月15日发生的推特黑客事件有关，“诈骗美国各地的人”。他面临的指控包括一项有组织欺诈，17项通讯欺诈，一项受害者超过10万美元或30人的欺诈使用个人信息的指控，10项欺诈使用个人信息的指控，以及一项未经授权访问电脑或电子设备的指控。\n希尔斯伯勒县监狱的记录显示，克拉克在早上6：30过后不久就被登记入狱。星期五。\n沃伦的办公室表示，诈骗计划“窃取了知名人士的身份”，并“以他们的名义发布信息，指示受害者将比特币发送到与坦帕青少年有关的账户”。根据州检察官的说法，该计划在短短一天内就收获了超过10万美元的比特币。\n“作为一种加密货币，比特币如果在诈骗中被盗，很难追踪和追回，”州检察官办公室表示。\n巴拉克·奥巴马(Barack Obama)、乔·拜登(Joe Biden)、杰夫·贝佐斯(Jeff Bezos)和埃隆·马斯克(Elon Musk)只是受黑客攻击影响的一些名字。Twitter官员最近表示，在这起备受瞩目的黑客攻击事件发生后，Twitter对其内部工具的访问权限受到了限制。\n“这些罪行是以名人和名人的名义犯下的，但他们并不是这里的主要受害者。这个‘Bit-Con’的目的是从全国各地的普通美国人那里偷钱，包括佛罗里达州的这里，“沃伦在一份声明中说。“这起大规模诈骗就是在我们的后院策划的，我们不会容忍。”\n据州检察官办公室称，美国联邦调查局(FBI)和美国司法部(US Department Of Justice)经过“复杂的全国性调查”，找到了希尔斯伯勒县袭击事件的幕后黑手。\n“我要祝贺我们的联邦执法伙伴-加州北区联邦检察官办公室、联邦调查局、美国国税局和特勤局-以及佛罗里达州执法部门。他们迅速开展工作，调查并查明了一起复杂而广泛的欺诈案的肇事者。“州检察官沃伦在他的声明中说。\n沃伦补充说，这名青少年将在希尔斯伯勒县受到起诉，因为“这名被告住在坦帕”，“他在这里犯下了罪行。”\n黑客事件发生后的第二天，白宫官员对唐纳德·特朗普(Donald Trump)总统的Twitter账户感到担忧，他每天都使用该账户推送新闻和其他信息。他们向公众保证，他的账户受到额外的保护。\n佛罗里达州首席财务官也表达了他的担忧，即类似的黑客攻击可能会以佛罗里达州的经济和选举为目标。佛罗里达州执法部门被要求帮助调查这起违规事件。\n版权所有2020 Nexstar广播公司。版权所有。这些材料不得出版、广播、重写或重新分发。", "note_en": "TAMPA, Fla. (WFLA) – A Tampa teenager is in jail, accused of being the “mastermind” behind a  hack on the social media website Twitter that caused limited access to the site and high-profile accounts, according to jail records and the Hillsborough State Attorney’s Office.\n 8 On Your Side’s Ryan Hughes received exclusive information about the arrest of 17-year-old Graham Clark.\n Hillsborough State Attorney Andrew Warren filed 30 felony charges against the teen this week for “scamming people across America” in connection with the Twitter hack that  happened on July 15. The charges he’s facing include one count of organized fraud, 17 counts of communications fraud, one count of fraudulent use of personal information with over $100,000 or 30 or more victims, 10 counts of fraudulent use of personal information and one count of access to computer or electronic device without authority.\n Hillsborough County Jail records show Clark was booked into jail shortly after 6:30 a.m. Friday.\n Warren’s office says the scheme to defraud “stole the identities of prominent people” and “posted messages in their names directing victims to send Bitcoin” to accounts that were associated with the Tampa teen. According to the state attorney, the scheme reaped more than $100,000 in Bitcoin in just one day.\n “As a cryptocurrency, Bitcoin is difficult to track and recover if stolen in a scam,” the state attorney’s office says.\n Barack Obama, Joe Biden, Jeff Bezos and Elon Musk were just some of the names who were impacted by the hack. Twitter officials recently said that it had limited access to its internal tools after the high-profile hack.\n “These crimes were perpetrated using the names of famous people and celebrities, but they’re not the primary victims here. This ‘Bit-Con’ was designed to steal money from regular Americans from all over the country, including here in Florida,” Warren said in a statement. “This massive fraud was orchestrated right here in our backyard, and we will not stand for that.”\n According to the state attorney’s office, the FBI and U.S. Department of Justice found the suspect behind the attack in Hillsborough County after a “complex, nationwide investigation.”\n “I want to congratulate our federal law enforcement partners – the US Attorney’s Office for the Northern District of California, the FBI, the IRS, and the Secret Service – as well as the Florida Department of Law enforcement. They worked quickly to investigate and identify the perpetrator of a sophisticated and extensive fraud,” State Attorney Warren said in his statement.\n Warren added that the teen will be prosecuted in Hillsborough County because “this defendant lives here in Tampa” and “he committed the crime here.”\n The day after the hack, White House officials were concerned about President Donald Trump’s Twitter account, which he uses daily to push out news and other information. They assured the public that his account has extra protections.\n Florida’s Chief Financial Officer also voiced his concern that  similar hacks could target Florida’s economy and elections. The Florida Department of Law Enforcement was called on to help investigate the breach.\n  Copyright 2020 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "posttime": "2020-08-01 02:34:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,推特,青少年,teen,账户", "title": "坦帕青少年被控是推特黑客攻击的幕后黑手", "title_en": "Tampa teen accused of being ‘mastermind’ behind Twitter hack", "transed": 1, "url": "https://www.wfla.com/news/hillsborough-county/tampa-teen-accused-of-being-mastermind-behind-twitter-hack-that-targeted-high-profile-accounts/", "via": "", "real_tags": ["黑客", "推特", "青少年", "teen", "账户"]}, {"category": "", "categoryclass": "", "imagename": "070a16c353cd5d863b121ef795350fbc.png", "infoid": 1015466, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BuzzFeed长期以来一直向受众推荐产品，当读者点击其文章中的链接并从实际销售商品的网站购买时，BuzzFeed可以从收入中分得一杯羹。\n这家数字出版商现在已经推出了一个名为BuzzFeed Shopping的独立网站，让访问者无需前往其他任何地方就可以完成购买。\n许多出版商通过从产品提及到完成交易的零售商的链接，赚取所谓的代销商收入，这是他们帮助产生销售时获得的一部分收入。但随着消费者习惯的改变，出版商继续寻求广告销售以外的收入，直接在媒体网站上购物可能会变得更加普遍。\nBuzzFeed商务高级副总裁尼拉·阿里(Nilla Ali)表示，BuzzFeed此举的部分原因是，相对最近，结账功能从传统电子商务平台扩展到一系列网站和应用程序，并特别提到了在Instagram上购物。\n阿里说，就在两年前，人们还不倾向于在传统电商网站外购物。她说：“但现在，随着Instagram的原生结账功能，以及更多有影响力的人通过他们的Feed推送产品，消费者的行为已经发生了变化。”\n新的BuzzFeed购物网站与BuzzFeed主网站上的购物部分不同，它通过与Shop Bonsai Inc.合作执行交易，Shop Bonsai Inc.是一个连接出版商和品牌的电子商务平台。\nBuzzFeed Shopping的推出描述了待售产品，如Message Me Inc.的HipDot面膜和Elf Cosmetics Inc.的面霜。\n该公司表示，BuzzFeed的直销佣金平均为25%。盆景从这笔佣金中分得一杯羹，但两家公司拒绝透露其规模。BuzzFeed拒绝描述其从附属链接获得的佣金。\n阿里说，BuzzFeed将收集消费者关于其新购物体验的数据，着眼于最终的个性化推荐，并指出平均订单价值是一个潜在的感兴趣的变量。\nBuzzFeed将继续在其主网站上发布附属链接。BuzzFeed上的文章也可以提到产品，即使该公司与卖家没有附属关系。\n该公司商务团队的编辑人员将为这两个网站撰写报道，尽管新的BuzzFeed购物文章只能突出盆景合作伙伴提供的产品。\n媒体品牌和控股公司2pm LLC的创始人韦伯·史密斯(Web Smith)表示，当出版商要求作家在一个网站上推荐只能展示特定商品池的产品-可供现场结账的产品-员工或读者可能会质疑文章的编辑独立性。2pm LLC是一家媒体品牌和控股公司。\n阿里说，“我们认为，不限制我们的编辑团队链接到我们目前正在展示的零售商或品牌的能力，这一点极其重要。”“我们绝对不打算告诉作家，他们只能写关于这些品牌的文章，因为我们有本地结账服务。”\n该公司称，BuzzFeed的关联链接去年带来了3亿美元的产品销售额。\n其他出版商也尝试了类似的努力。PopSugar Inc.。2016年，当它拥有ShopStyle Inc.时，曾试图创建一款时尚通用购物车。搜索引擎和移动购物公司Cosic Cart。\n该公司在2017年放弃了这些努力，将ShopStyle出售给了Ebates Inc.，即现在的乐天(Rakuten)\n盆景与Complex Media Inc.首次亮相也有类似的体验。去年12月，重点是推出有限的产品，通常被称为“Drops”。过去的服装包括歌手J.Balvin和日本艺术家村上隆(Takashi Murakami)的衣服。\n盆景表示，有75家商家使用其平台销售1000多个品牌的产品，包括阿迪达斯(Adidas AG)和李维斯(Levi Strauss&amp；Co；)。该公司表示，今年将与另外8家出版商达成协议，推出现场购物体验，但拒绝透露这些出版商的名字。\n盆景的首席执行官萨阿德·西迪基(Saad Siddiqui)说，“像BuzzFeed这样的出版商在过去几年里真正接受了附属公司，并建立了坚实的业务，他们实际上已经培训了受众从它们那里购物，并期待能卖出产品--这些出版商接受这类产品的时机真的很成熟。”\n另一家出版商Vox Media LLC负责电子商务的高级副总裁卡米拉·赵(Camilla Cho)表示，该公司正在考虑让游客直接从其购物网站The Strategy ist购买商品，而不必点击。\n但Cho说，Vox并不确定消费者是否想要直接从出版商那里购买。\n“现在很难说消费者是想要还是更喜欢从出版商那里购物，”她说。“但我们看到的一些市场信号表明，消费者对从各种渠道购物持开放态度，包括多家零售商和直接从社交平台购物。”", "note_en": "BuzzFeed has long recommended products to its audience, earning a cut of the revenue when readers click the links in its articles and buy from the sites that actually sell the goods.\n  The digital publisher has now introduced a standalone website called BuzzFeed Shopping that lets visitors complete purchases without going anywhere else.\n  Many publishers earn so-called affiliate revenue, the slice of revenue they get when they help generate a sale, by linking from product mentions to retailers that finish the transactions. But shopping directly on media sites may become more common as consumer habits change and publishers continue to seek revenue beyond ad sales.\n  BuzzFeed’s move was enabled partly by the relatively recent spread of checkout functionality beyond traditional e-commerce platforms to a range of websites and apps, said Nilla Ali, senior vice president of commerce at BuzzFeed, citing  shopping on Instagram in particular.\n    People weren’t inclined to shop outside traditional e-commerce sites just two years ago, Ms. Ali said. “But now with Instagram’s native checkout, and more influencers pushing products through their feed, consumer behavior has shifted,” she said.\n  The new BuzzFeed Shopping site, which is distinct from the Shopping section on BuzzFeed’s main site, executes transactions through a partnership with Shop Bonsai Inc., an e-commerce platform that connects publishers and brands.\n  The BuzzFeed Shopping rollout describes products for sale such as a face mask from Message Me Inc.’s HipDot and face cream from Elf Cosmetics Inc.\n  BuzzFeed earns an average commission of 25% on direct sales, it said. Bonsai receives a portion of that commission, but the companies declined to disclose its size. BuzzFeed declined to describe its commissions from affiliate links.\n  BuzzFeed will collect consumer data on its new shopping experience with an eye toward eventually personalizing recommendations, Ms. Ali said, citing average order value as one potential variable of interest.\n  BuzzFeed will keep publishing affiliate links on its main site. Articles on BuzzFeed proper can also mention products even if the company doesn’t have an affiliate relationship with a seller.\n  Editorial staffers on the company’s commerce team will write stories for both sites, though the new BuzzFeed Shopping articles can only spotlight products that are available from Bonsai’s partners.\n  When publishers ask writers to recommend products on a site that can only feature a certain pool of items—products that are available for on-site checkout—staffers or readers might question the editorial independence of the articles, said Web Smith, founder of 2pm LLC, a media brand and holding company.\n    “We think it’s extremely important that we’re not constraining our editorial team’s ability to link to the retailers or brands that we’re currently featuring,” Ms. Ali said. “We definitely do not intend to be in a situation where we’re telling the writers they can only write about these brands because we have native checkout.”\n  BuzzFeed’s affiliate links led to $300 million in product sales last year, the company said.\n  Other publishers have tried similar efforts. PopSugar Inc.  attempted to create a universal shopping cart for fashion in 2016, when it owned the ShopStyle Inc. search engine and Cosmic Cart, a mobile shopping company.\n  The company abandoned those efforts in 2017 and sold ShopStyle to Ebates Inc., now known as  Rakuten\n  Bonsai debuted a similar experience with Complex Media Inc. last December, with a focus on rolling out limited runs of products, often called “drops.” Past drops include clothes from singer J. Balvin and Japanese artist Takashi Murakami.\n  Bonsai said 75 merchants use its platform to sell products from more than 1,000 brands, including Adidas AG and  Levi Strauss &amp; Co. It has deals to roll out on-site shopping experiences with eight more publishers this year, it said, though it declined to name them.\n  “Publishers like BuzzFeed that have really embraced affiliate over the last few years and built a solid business, and they’ve actually trained their audience to shop from them and expect to be sold product—those publishers are really ripe for this kind of product,” said Saad Siddiqui, chief executive of Bonsai.\n  Another publisher, Vox Media LLC , is considering letting visitors buy items directly from its shopping site, The Strategist, without having to click away, according to Camilla Cho, senior vice president of e-commerce at the company.\n  But Vox isn’t sure whether consumers want to buy directly from a publisher, Ms. Cho said.\n  “It’s hard to say now whether consumers want or prefer to shop from publishers,” she said. “But there are some market signals we are seeing that suggest consumers are open to shopping from various sources, including multiple retailers and directly from social platforms.”", "posttime": "2020-08-01 02:33:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "销售,starts,出版商", "title": "BuzzFeed开始直接向消费者销售产品", "title_en": "BuzzFeed starts selling products directly to consumers", "transed": 1, "url": "https://www.wsj.com/articles/buzzfeed-starts-selling-products-directly-to-consumers-11596136660", "via": "", "real_tags": ["销售", "starts", "出版商"]}, {"category": "", "categoryclass": "", "imagename": "5bcec9d3f689f0c7f3ad4a0b1dffacfa.jpg", "infoid": 1015465, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "快速浏览一下2维和3维的球面几何，以及为什么它看起来如此不寻常。这是我的双曲线Devlog系列的第二部分，这两个几何图形都将…", "note_en": "A quick look at spherical geometry in 2 and 3 dimensions and why it looks so unusual. This is part 2 of my Hyperbolica Devlog series, and both geometries wil...", "posttime": "2020-08-01 02:33:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "双曲线,geometry,球面几何", "title": "球面几何比双曲线奇怪", "title_en": "Spherical Geometry Is Stranger Than Hyperbolic", "transed": 1, "url": "https://www.youtube.com/watch?v=yY9GAyJtuJ0", "via": "", "real_tags": ["双曲线", "geometry", "球面几何"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015463, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2001年出版的“从Akira到Mononoke公主的动漫”一书中，纳皮尔教授指出，许多动漫爱好者从事计算机科学及其相关领域的工作。调查还碰巧显示，“超过70%的人平均绩点在3.0或更高，当一个人对科学领域的学术严谨性印象深刻时，这一点尤其令人印象深刻。”\n动漫在塑造有文化气质的人方面享有相当高的声誉。这清楚地表明，动漫迷可以受到媒体的深刻影响。此外，许多多产的开源贡献者都将动画人物作为他们的头像。所以这让我想，做一个动漫迷是不是也会让你变得更聪明？\n当然，像这样的问题几乎不可能直接回答。毕竟，衡量智商的方法有无数种，而且动漫迷是如此宽泛，没有一个定义可以适用于所有情况。例如，我们应该把只看过“千与千寻”，非常喜欢它，但没有接触过其他形式的动漫的人视为动漫迷吗？那些只看漫画的人怎么办？还是那些独家收看本该是什么的人呢？\n一个较小的问题很容易回答，那就是看看拥有一张动漫头像是否与你是一名更好的程序员有关。毕竟，如果有人努力将自己的头像设置为外福，那么他们显然对动漫情有独钟。至于成为一名“更好的程序员”，我们只会把更好的等同于在GitHub上有更多的活动。而且，擅长编程确实需要大量的逻辑推理能力，这应该等同于更高的智商。当然，这个度量很容易被创建提交的cron作业滥用，但是它是编程活动的度量，应该足够好的™。\n幸运的是，谷歌以非常便宜的价格提供了他们的图像标签API(如果你有GCP积分，也可以是免费的)。例如，将Rascal Does Not Dream of Bunny Girl Senpai的最佳女孩Mai Sakurajima的图片放入所提供的演示中，我将从中获得以下标签列表：\n注意到其中一个标签是“Anime”吗？这是一个令人惊讶的工具，稍后会对我们有所帮助：)Google还提供了Python API，这使得检查图像变得更加容易，因为您现在要做的就是检查“Anime”是否是标签之一：\nAnime_or_Not(Image)：响应=客户端。LABEL_DETACTION(image=image)labels=Response。标签中项目的LABEL_ANNOTIONS：如果项目。描述==&#34；动画&#34；：返回True。\n至于GitHub提交，我们可以使用事件API，它大致类似于用户的贡献历史图表。我们将通过每个用户的事件数量来衡量用户活动，因此每个事件(打开公关、创建回购等)。被给予同等的权重。这大致相当于一个用户的贡献热图有多环保。\nPyGitHub将GitHub API封装到一个易于使用的库中，因此获取用户的事件数量以及他们的个人资料图片的URL非常简单：\n用户=g。用户中的USER的GET_USERS()：USER中的事件的EVENT_COUNT=0。Get_events()：event_count+=1 is_Anime_image=check_if_Weeb(用户。阿凡达_url)。\n对于通过认证的用户，GitHub会将API速率限制在每小时5000个请求。这已经足够Torun每小时大约2000个请求了。要解决此问题，我们可以利用GitHub配置文件ID的顺序编号方式，并分批处理1000个配置文件：\n对于范围(1200000,1201000)内的gihub_id：尝试：USER=g。Get_user(Gihub_Id)异常除外：在此继续#执行用户操作。\n我在这里修改了GET_USER函数，以使用未记录的/USER/：ID端点。这还没有在PyGitHub中实现，但是这个问题似乎正在跟踪它。\n剩下的就是将这些API链接起来并保存数据。只需使用/Users GitHub API端点遍历所有用户，将他们的图像发送到Google Vision API，记下他们是否有动画个人资料图片和该用户的活动数量，最后将其记录到CSV中以供稍后分析，这是很简单的。这正是我所做的，您可以在这里看到我的代码。这是非常高的研究质量，所以不要期望太高。\n现在我有一个包含3497个GitHub档案的表格，其中只有23个有动漫档案图片。以下是按档案图片类型显示用户活动分布的框图：\n嗯，拥有动漫头像的用户似乎有更高的平均活跃度。但我们不能停在这里。请记住，与有动画头像的用户相比，没有动漫头像的用户样本要多得多，而且两组中的离群值都相对较高。为了确保这里的差异在统计上显著，我们需要进行T检验：\n它提供的p值为0.2371。我们现在必须得出的结论是，我们得到的更高的平均值在统计上并不显著，因为我们23.7%的p值没有达到传统的5%的临界值。因此，我们必须再次默认贝特里奇定律，并采用我们的零假设，即拥有一张动画头像并不一定与你作为程序员的能力相关。\n但是，可以对此主题进行进一步的工作。由于这个项目只关注了一小部分用户，他们是第一批注册的用户，所以它不是GitHub用户群体中具有代表性的一部分。此外，将不活跃的用户包括在此实验中也可能是有启发性的。", "note_en": "In her 2001 book  Anime from Akira to Princess Mononoke, Professor Napier showed that many fans ofanime work in computer science and its related fields. The survey also happened to show that “over70 percent had a grade point average of 3.0 or higher, which is especially impressive when oneconsiders the academic rigor of scientific fields.”\n Anime has a pretty well-known reputation for creating  men of culture. That’s a clearindication that anime fans can be profoundly affected by the medium. In addition, many prolificopen source contributors have anime characters as their profile picture. So that got me to thinking,does being a fan of anime also make you a more intelligent person?\n  Of course, a question like that is nearly impossible to answer directly. After all, there’scountless ways to measure intelligence, and anime fandom is so broad that no one definition can fitall cases. For example, should we consider someone who has only watched  Spirited Away, and likedit very much, but has no exposure to other forms of anime, to be an anime fan? What about people whoonly read manga? Or those who exclusively watch  whatever this is supposed to be?\n A smaller question that’s easily answerable would be to see if having an anime profile picturecorrelates with you being a better programmer. After all, if someone takes the effort to set theirprofile picture to a waifu, they clearly have some fondness for anime. As for being a “betterprogrammer,” we’ll just equate being better with having more activity on GitHub. And being good atprogramming does require an amount of critical reasoning at logic skill, which should equate to ahigher intelligence. Of course, this metric could be easily abused by having a  cron job making aton of commits, but it’s a measure of programming activity that should be Good Enough™.\n Luckily, Google provides their  image labelling API for very cheap (or free, if youhave GCP credit). As an example, putting in an image of best girl Mai Sakurajima from  Rascal DoesNot Dream of Bunny Girl Senpai into the demo provided, I’ll get this list of labels back from it:\n  Notice how one of the labels is “Anime”? That’s a surprise tool that will help us later :) Googlealso provides a Python API, which makes it even easier to check images, since all you have to do nowis check if “Anime” is one of the tags:\n anime_or_not ( image ):  response  =  client . label_detection ( image = image )  labels  =  response . label_annotations  for  item  in  labels :  if  item . description  ==  &#34;Anime&#34; :  return  True\n As for GitHub commits, we can use the  events API that’s roughly analogous to thecontribution history graph of a user. We’ll be measuring user activity just by the number of eventsfor each user, so each event (opening a PR, creating a repo, etc.) is given equal weight. That’sroughly analogous to how green a user’s contribution heatmap is.\n  PyGitHub wraps the GitHub API into an easy to use library, so getting the number ofevents for a user, as well as their profile picture’s URL, is pretty simple:\n users  =  g . get_users () for  user  in  users :  event_count  =  0  for  event  in  user . get_events ():  event_count  +=  1  is_anime_image  =  check_if_weeb ( user . avatar_url )\n GitHub does rate limit the API to 5000 requests per hour for authenticated users. That’s enough torun about 2000 requests per hour. To get around that, we can take advantage of how GitHub profileIDs are numbered sequentially and process profiles in batches of 1000:\n for  github_id  in  range ( 1200000 ,  1201000 ):  try :  user  =  g . get_user ( github_id )  except  Exception :  continue  # do user stuff here\n I’ve modified the  get_user function here to use the undocumented  /user/:id endpoint. This hasn’tbeen implemented in PyGitHub yet, but  this issue seems to be tracking it.\n All that’s left is to link these APIs up and save the data. It’s trivial to just loop through allusers using the  /users GitHub API endpoint, send their image over to the Google Vision API, notedown whether they had an anime profile picture and the number of events for that user, and finallylog it into a CSV for analysis later. That’s exactly what I did, and you can see my code here. It’s very research quality, so don’t expect much.\n So now I’ve got a table of 3497 GitHub profiles, of which only 23 have anime profile pictures.Here’s a box plot that displays the distribution of user activity by profile picture type:\n  Hmm, the users with an anime profile picture do seem to have a higher average number ofactivities. But we can’t stop here. Keep in mind that there’s way more samples of users withoutanime profile pictures compared to those with, as well as the comparatively high amount ofoutliers in both groups. To be sure that the difference here is statistically significant,we’ll need to do a T-test:\n  That provides a p-value of  0.2371. We now have to conclude that the higher average we got isn’tstatistically significant, since our p-value of 23.7% doesn’t meet the traditional 5% cutoff.Therefore, we must once again acquiesce to  Betteridge’s law, and adopt our nullhypothesis, that having an anime profile picture does not necessarily correlate with your abilitiesas a programmer.\n Further work into this topic can be done, however. Since this project only looked at a smallnumber of users, who were among the first to register, it is not a representative slice of theGitHub user population. In addition, it may also be enlightening to include the inactive usersskipped in this experiment.", "posttime": "2020-08-01 02:33:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,头像,profile", "title": "有一张动漫头像会让你成为更好的程序员吗？", "title_en": "Does Having an Anime Profile Picture Make You a Better Programmer?", "transed": 1, "url": "https://h313.info/blog/github/anime/google-cloud/2020/07/31/does-having-an-anime-profile-picture-make-you-a-better-programmer.html", "via": "", "real_tags": ["程序", "头像", "profile"]}, {"category": "", "categoryclass": "", "imagename": "acad9c0cc893c1b258fda89197ed7e5b.png", "infoid": 1015460, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此存储库根据加拿大隐私专员提供的指导，为Apple/Google的ExposureNotification框架实现了Reaction Native Client应用程序。\n这款应用程序是使用Reaction Native构建的，设计为在Android和iOS设备上都能很好地使用模式。它与COVID报警诊断服务器一起工作，为暴露通知客户端应用程序如何工作提供参考。\n按照React Native Development Environment安装程序中概述的步骤进行操作，以确保安装了正确的工具。\n您还需要具有公开通知权限的调配配置文件。欲了解更多信息，请访问https://developer.apple.com/documentation/exposurenotification.。\n能够运行最新版本的Google Play服务或Google Play服务测试版的Android设备。在此处注册测试版计划https://developers.google.com/android/guides/beta-program.。\n您还需要用于发布到Google Play的安全列表APPLICATION_ID。您可以使用Google sample App中的APPLICATION_ID来测试&#34；com.google.android.apps.exposurenotification&#34；.。转到环境配置以查看如何更改APPLICATION_ID。\n现在，你可以在iOS和Android上使用以下命令启动该应用程序。\n当应用程序运行开发模式时，您可以轻触应用程序顶部的COVID Alert徽标以打开测试菜单。此菜单允许您执行以下操作：\n请注意：如果环境配置文件(.env*)的TEST_MODE=TRUE，则启用测试菜单。要在生产构建上禁用测试模式UI，只需在环境配置文件TEST_MODE=FALSE中将其设置为FALSE。\n使用IP地址连接到COVID报警诊断服务器实例，或者服务器不支持HTTPS，或者。\n让应用程序在模拟器中运行，并通过Metro服务器获得自动反应原生代码更新；\n请将以下密钥添加到info.plist文件。这些密钥不应委托给回购，仅用于当地发展。\n您可以在很大程度上通过编辑主题文件中的值来自定义应用程序的外观。\nCOVID Alert应用程序有法语和英语两种版本。可以通过编辑在翻译目录中找到的翻译文件来修改完全本地化的内容。可以使用与法语和英语相同的机制添加更多翻译。\n修改内容后，您必须运行Generate-Translations命令，才能使应用程序反映您的更改。\n在Xcode本地化设置(Project-&gt；CovidShield-&gt；信息选项卡-&gt；本地化)中添加新选项，并确保选中了Launch Screen.Storyboard。\nCOVID Alert最初是由Shopify的志愿者开发的。它是在灵活的开源许可下免费发布的。\n这个存储库是由加拿大数字服务公司开发的。我们可以通过cds-snc@tbs-sct.gc.ca联系。\n失败：构建失败，出现异常。*出错之处：任务&#39；：app：PackageDebug&#39；执行失败。&gt；执行com.android.build.gradle.internal.tasks.Workers$ActionFacade&gt；com.android.ide.common.signing.KeytoolException：时失败，无法从存储区&#34；/Users/Your_User/.android/debug.keystore&#34；读取密钥AndroidDebugKey：密钥库密码不正确。\nCd android/appkeytool-genkey-v-keystore debug.keystore-storepass androiddebugkey-keypass androiddebugkey-keypass androiddebugkey-keyalg RSA-keysize 2048-有效期10000。\n执行步骤2.1.1时，如果收到类似以下内容的错误，请安装CocoaPods(请注意：错误消息不会相同，但相似)：\n错误：正在加载命令：Install(LoadError)dlopen(/Users/$home/ruby/2.6.5/x86_64-darwin18/openssl.bundle，9)：库未加载：/usr/LOCAL/OPT/openssl/lib/libssl.1.0.0.dylib在执行gem时引用自：/Users/$home/ruby/2.6.5/x86_64-darwin18/openssl.bundleERROR：...。(NoMethodError)。\n这是因为您安装的Ruby版本没有包含OpenSSL。\n您可以通过安装Ruby Version Manager(如果您尚未安装)，然后使用以下步骤重新安装OpenSSL所需的Ruby版本来修复此错误：\n运行以下命令安装包含OpenSSL的Ruby所需版本，这将需要几分钟时间，请耐心等待。\nCE dépôt会见了enœuvre une应用程序客户反应本地的Pour le Cadriciel Notificationd‘exposition d’Apple/GOOGLE，éclairépar l‘Orientation Four nie Par le Commissaireàla Protection de la Vie Privée du Canada。\nCette应用程序是最重要的构造，它反映了本地和最新的功能，以及Android和iOS的服装。ELL Fonctionne de Concert Avec le Serveur de Diagnosis Alerte COVID Pour Fournir réféence Sur le Functionnement Pour‘une Application Client Pour Les Notify d’Expose.。\nSuivez Lesétapes décrites Dans Configuration de l‘Environmental de Development pement Reaction Native Pour vous Assurer que le Les outils Appropriés sont installés.。\n您可以在提供的简档中获得通知的权利。Pour Obtenir de Plus Samples Renseignations，请访问https://developer.apple.com/documentation/exposurenotification.。\n服装Android Pouvant exécuter la dernière版de Google Play Services ou Google Play Services Beta。题词-您的Au节目bêta ici https://developers.google.com/android/guides/beta-program.。\nVous avezégalement beoin d‘un application_ID protégéqui sera utiliséour Publisher dans Google Play.。Vous pouvez utiliser l‘application_ID de Google Sample Appàdes Fins d’essai«com.google.android.apps.exposurenotification»。AlleràEnvironment config Pour va Comment修饰符l‘APPLICATION_ID。\nCocher.env et rajuster la configuration si nécessaire.。VOVACTION-NATIVE-CONFIG PUR加上d‘information。\nVous pouvez主要租户l‘applicationàl’aide des Commandes suivantes our iOS et Android：\nPour IOS，utilisez XCode en vant le filhier CovidShield.xcworkspace dans le Archisier«iOS»。\nLorsque l‘应用程序最大程度的模式开发，vous pouvez appuyer sur le logo alert te COVID en haut de l’application our ouvrir le Menu Test。CE菜单VOU PERMET de：\nMettre l‘应用程序模式测试Pour Configourner le Contrôle de l’API de Notification d‘exposation。\nRemarque：LE MENU de test est activési le fichier de configuration de l‘Environment(.env*)montre«test_mode=true»。Pour désactiver l‘interface utilisateur du mode test en Production，il fulit de la définir comme false dans le fichier de configuration d’Environmental«test_mode=false»。\nVOU Pouvez Personaliser l‘apopence de l’Application en Grande Party en Modifiant Les Valeur du Theme File.。\nL‘应用程序警报COVID EST可丢弃在法国和英格兰。地方修饰性修饰剂是一种改进型的减法行为，但并不是一种简单的减法行为，而是一种改进型的减法行为，也就是一种改进型的减法行为，但并不是一件容易发生的事情，而是一件很容易发生的事情。论外加减法是法国等国的一种实用的用法和经济发展方式，也是对法国和印度的一种有益的补充和减法，也是对法国和印度的一种有效的利用方式，也是对法国和英格兰的一种补充。\nAprès voir Modifiéle contenu，vous devez exécuter la command Generate-Translations Pour que l‘application reflète vos修改。\nAjouter la nouvelle选项dans les paramètres Xcode本地化(Project-&gt；CovidShield-&gt；onglet信息-&gt；本地化)et assurez-vous que Launch Screen.Storyboard Est coché。\nAlerte COVID aétédédeveloppéàl‘Origine Par des bénévoles de Shopify。IaétéDiffuségratuentation en vertu d‘une许可证是一种非常灵活的许可证。\nCe dépôt est Maintenu Par le Service Numérique Canadien.。Vous pouvez nous joindreàcds-snc@tbs-sct.gc.ca.。\n失败：构建失败，出现异常。*出错之处：任务&#39；：app：PackageDebug&#39；执行失败。&gt；执行com.android.build.gradle.internal.tasks.Workers$ActionFacade&gt；com.android.ide.common.signing.KeytoolException：时失败，无法从存储区&#34；/Users/Your_User/.android/debug.keystore&#34；读取密钥AndroidDebugKey：密钥库密码不正确。\nCd android/appkeytool-genkey-v-keystore debug.keystore-storepass androiddebugkey-keypass androiddebugkey-keypass androiddebugkey-keyalg RSA-keysize 2048-有效期10000", "note_en": "This repository implements a React Native  client application for Apple/Google&#39;s  ExposureNotification framework, informed by the  guidance provided by Canada&#39;s Privacy Commissioners.\n   This app is built using React Native and designed to work well with patterns on both Android and iOS devices. It works alongside the  COVID Alert Diagnosis Server to provide a reference for how a client application for exposure notifications could work.\n   Follow the steps outlined in  React Native Development Environment Setup to make sure you have the proper tools installed.\n    You also need a provisioning profile with the Exposure Notification entitlement. For more information, visit  https://developer.apple.com/documentation/exposurenotification.\n  Android device with the ability to run the latest version of Google Play Services or Google Play Services Beta. Sign up for beta program here  https://developers.google.com/android/guides/beta-program.\n You also need a safelisted APPLICATION_ID that will be used to publish to Google Play. You could use APPLICATION_ID from  Google Sample App for testing purposes  &#34;com.google.android.apps.exposurenotification&#34;. Go to  Environment config to see how to change APPLICATION_ID.\n               You can now launch the app using the following commands for both iOS and Android.\n     When the app is running development mode, you can tap on the COVID Alert logo at the top of the app to open the Test menu. This menu enables you to:\n  Note that: Test menu is enabled if the environment config file ( .env*) has  TEST_MODE=true. To disable test mode UI on production build, simply set it to false in the environment config file  TEST_MODE=false.\n   connect to a COVID Alert Diagnosis Server instance with an IP address or the server does not support HTTPS, or\n have the app run in the simulator and get automatic React-Native code updates via the Metro server;\n Please add the following keys to the  info.plist file. These keys should not be commited to the repo, and used only for local development.\n   You can customize the look and feel of the app largely by editing values found in the  Theme File.\n  The COVID Alert app is available in French and English. Fully localized content can be modified by editing translations files found in the  translations directory. More translations can be added by using the same mechanism as French and English.\n After modifying the content you must run the  generate-translations command in order for the app to reflect your changes.\n   Add the new option in Xcode  Localizations settings (Project -&gt; CovidShield -&gt; Info tab -&gt; Localizations) and make sure  Launch Screen.storyboard is checked.\n    COVID Alert was originally developed by  volunteers at Shopify. It was  released free of charge under a flexible open-source license.\n This repository is being developed by the  Canadian Digital Service. We can be reached at  cds-snc@tbs-sct.gc.ca.\n    FAILURE: Build failed with an exception. * What went wrong:Execution failed  for task   &#39;:app:packageDebug &#39;. &gt; A failure occurred  while executing com.android.build.gradle.internal.tasks.Workers $ActionFacade  &gt; com.android.ide.common.signing.KeytoolException: Failed to  read key AndroidDebugKey from store   &#34;/Users/YOUR_USER/.android/debug.keystore &#34;: keystore password was incorrect\n  cd android/appkeytool -genkey -v -keystore debug.keystore -storepass android -alias androiddebugkey -keypass android -keyalg RSA -keysize 2048 -validity 10000\n     When following step  2.1.1 Install Cocoapods if you recieve an error that looks like the following ( Please Note: Error message will not be identical but simliar):\n ERROR: Loading command: install (LoadError) dlopen(/Users/ $home/ruby/2.6.5/x86_64-darwin18/openssl.bundle, 9): Library not loaded: /usr/local/opt/openssl/lib/libssl.1.0.0.dylib Referenced from: /Users/ $home/ruby/2.6.5/x86_64-darwin18/openssl.bundleERROR: While executing gem ... (NoMethodError)\n This is because the version of Ruby you have installed does not have OpenSSL included.\n You can fix this error by installing Ruby Version Manager (if you do not already have it), and reinstalling the version of ruby required with OpenSSL using the following steps:\n Run the following command to install the version of Ruby needed with OpenSSL included, this will take a few minutes so be patient.\n       Ce dépôt met en œuvre une  application client React Native pour le cadriciel  Notificationd’exposition d’Apple/Google, éclairé par  l’orientation fournie par le commissaire à la protection de la vie privée du Canada.\n   Cette application est construite à l’aide de React Native et est conçue pour bien fonctionner avec des modèles sur les appareils Android et iOS. Elle fonctionne de concert avec le  Serveur de diagnostic Alerte COVID pour fournir une référence sur le fonctionnement possible d’une application client pour les notifications d’exposition.\n   Suivez les étapes décrites dans  Configuration de l’environnement de développement React Native pour vous assurer que les outils appropriés sont installés.\n    Vous avez également besoin d’un profil de provisionnement avec le droit de notification d’exposition. Pour obtenir de plus amples renseignements, visitez  https://developer.apple.com/documentation/exposurenotification.\n  Appareil Android pouvant exécuter la dernière version de Google Play Services ou Google Play Services Beta. Inscrivez-vous au programme bêta ici  https://developers.google.com/android/guides/beta-program.\n Vous avez également besoin d’un APPLICATION_ID protégé qui sera utilisé pour publier dans Google Play. Vous pouvez utiliser l’APPLICATION_ID de  Google Sample App à des fins d’essai  « com.google.android.apps.exposurenotification ». Aller à  Environment config pour voir comment modifier l’APPLICATION_ID.\n           Cocher  .env et rajuster la configuration si nécessaire. Voir  react-native-config pour plus d’information.\n    Vous pouvez maintenant lancer l’application à l’aide des commandes suivantes pour iOS et Android :\n   Pour iOS, utilisez XCode en ouvrant le fichier  CovidShield.xcworkspace dans le dossier « ios ».\n  Lorsque l’application est en mode de développement, vous pouvez appuyer sur le logo Alerte COVID en haut de l’application pour ouvrir le menu Test. Ce menu vous permet de :\n Mettre l’application en mode test pour contourner le contrôle de l’API de notification d’exposition\n Remarque : Le menu de test est activé si le fichier de configuration de l’environnement ( .env*) montre « TEST_MODE=true ». Pour désactiver l’interface utilisateur du mode test en production, il suffit de la définir comme False dans le fichier de configuration d’environnement « TEST_MODE=false ».\n  Vous pouvez personnaliser l’apparence de l’application en grande partie en modifiant les valeurs du  Theme File.\n  L’application Alerte COVID est disponible en français et en anglais. Le contenu entièrement localisé peut être modifié en modifiant les fichiers de traduction qui se trouvent dans le  répertoire des traductions. On peut ajouter plus de traductions en utilisant le même mécanisme pour le français et l’anglais.\n Après avoir modifié le contenu, vous devez exécuter la commande  generate-translations pour que l’application reflète vos modifications.\n   Ajouter la nouvelle option dans les paramètres Xcode  Localizations (Project -&gt; CovidShield -&gt; onglet Info -&gt; Localizations) et assurez-vous que  Launch Screen.storyboard est coché.\n  Alerte COVID a été développé à l’origine par  des bénévoles de Shopify. Il a été  diffusé gratuitement en vertu d’une licence ouverte flexible.\n Ce dépôt est maintenu par le  Service numérique canadien. Vous pouvez nous joindre à  cds-snc@tbs-sct.gc.ca.\n    FAILURE: Build failed with an exception. * What went wrong:Execution failed  for task   &#39;:app:packageDebug &#39;. &gt; A failure occurred  while executing com.android.build.gradle.internal.tasks.Workers $ActionFacade  &gt; com.android.ide.common.signing.KeytoolException: Failed to  read key AndroidDebugKey from store   &#34;/Users/YOUR_USER/.android/debug.keystore &#34;: keystore password was incorrect\n  cd android/appkeytool -genkey -v -keystore debug.keystore -storepass android -alias androiddebugkey -keypass android -keyalg RSA -keysize 2048 -validity 10000", "posttime": "2020-08-01 02:30:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,covid,de", "title": "加拿大Covid Alert移动应用程序", "title_en": "Canada's Covid Alert Mobile App", "transed": 1, "url": "https://github.com/cds-snc/covid-alert-app", "via": "", "real_tags": ["程序", "covid", "de"]}, {"category": "", "categoryclass": "", "imagename": "b594b25469aa281fda62b36b6f0f7fc5.jpg", "infoid": 1015459, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Better是一款适用于iPhone、iPad和Mac上Safari的隐私工具。我们保护您不受网络上跟踪和介绍您的行为广告和公司的影响。\nBetter是由Small Technology Foundation手工制作的，Small Technology Foundation是一个由两个人和一个哈士奇组成的小型非营利性组织，致力于在数字网络时代争取社会正义。为了更好地基于道德设计原则，我们策划了我们自己独特的阻止规则。\n为了支持我们，您可以在iPhone、iPad和Mac的App Store上购买更好的产品。您也可以成为我们的赞助人或一次性捐款来资助我们在Small Technology Foundation的工作。", "note_en": "Better is a privacy tool for Safari on iPhone, iPad, and Mac. We protect you from behavioural ads and companies that track and profile you on the web.\n         Better is hand-crafted by  Small Technology Foundation, a tiny two-person-and-one-husky not-for-profit striving for social justice in the digital network age. We curate our own unique blocking rules for Better based on the principles of  Ethical Design.\n  To support us, you can purchase Better on the App Store for iPhone, iPad and Mac. You can also  become a patron or  make a one-time donation to fund our work at Small Technology Foundation.", "posttime": "2020-08-01 02:30:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工具,privacy,iphone", "title": "更好的隐私工具", "title_en": "Better Privacy Tool", "transed": 1, "url": "https://better.fyi/", "via": "", "real_tags": ["工具", "privacy", "iphone"]}, {"category": "", "categoryclass": "", "imagename": "1857b9181adce2d709e1f9a4e695e709.png", "infoid": 1015457, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的Petri Office 365 Insider致力于分享来自顶级Office 365专家的详细知识。每月送到你的收件箱一次。\nPetri.com可能会使用您的联系信息提供您可能感兴趣的更新、优惠和资源。你可以随时退订。要了解我们如何管理您的数据的更多信息，您可以阅读我们的隐私政策和服务条款。\n如果您使用的是微软新的Edge浏览器，并且它一直崩溃，那么您并不孤单。Twitter和许多其他社交平台开始报道这一问题，但谢天谢地，微软已经意识到了这一点。\n现在的问题是，如果您将Google设置为默认引擎，并尝试在搜索栏中键入内容，浏览器可能会崩溃。该问题与“搜索建议”有关，当调用该API时，浏览器立即崩溃。\n我在浏览器的开发和发布渠道版本上看到了它。如果您遇到此问题，您可以导航到edge：//settings/search并关闭该功能作为解决方法。\n当您尝试在地址栏中键入内容时，是否看到Edge Crash？团队正在调查这件事！同时，作为一种解决办法，请关闭此处的搜索建议：edge：//settings/search。一旦我们有了更多的信息，我们就会跟进！\n虽然有解决办法，但这对微软来说是一个严重的问题，因为它已经开始告诉企业客户开始使用浏览器。对于技术用户来说，这个变通方法很容易启用，但对于技术较低的用户，他们可能会认为这是他们的安装崩溃，并切换回Chrome以保持稳定。\n微软已经意识到了这个问题，并正在努力修复。希望他们可以在后端部署更新来解决问题，而不是要求每个人都更新他们的浏览器。\n[更新]问题现已解决，但微软尚未解释问题原因。\n您没有登录但想要加入对话吗？注册一个Petri网帐户。\n寄存器", "note_en": "Our Petri Office 365 Insider is dedicated to sharing detailed knowledge from top Office 365 experts. Delivered once a month to your inbox.\n   Petri.com may use your contact information to provide updates, offers and resources that may be of interest to you. You can unsubscribe at any time. To learn more about how we manage your data, you can read our  Privacy Policy and  Terms of Service.\n If you are using Microsoft’s new Edge browser and it keeps crashing, you are not alone. Twitter and many other social platforms started reporting the issue but thankfully Microsoft is aware.\n The issue right now is that if you have Google set as the default engine and try to type in the search bar, the browser may crash. The problem is related to “Search Suggestions” and when that API is called, the browser crashing instantly.\n I am seeing it on my dev and release channel builds of the browser. If you have been experiencing this issue, you can navigate to edge://settings/search and turn off the feature as a workaround.\n Are you seeing Edge crash when trying to type into the address bar? The team is looking into it! In the meantime, as a workaround, please turn off Search Suggestions here: edge://settings/search. We&#39;ll follow up once we have more!\n  While there is a workaround, this is a serious issue for Microsoft who has begun telling corporate customers to start using the browser. For technical users, this workaround is easy to enable, but for less technical users, they may assume that it is their install crashing and switch back to Chrome for stability.\n Microsoft is aware of the issue and is working on a fix. Hopefully, they can deploy an update on the backend to resolve the issue and not require everyone to update their browser.\n [ Update] The issue has now been resolved but Microsoft has yet to explain the cause of the issue.\n    Don&#39;t have a login but want to join the conversation? Sign up for a Petri Account\n  Register", "posttime": "2020-08-01 01:14:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,microsoft,谷歌,微软,浏览器", "title": "如果谷歌是你的搜索引擎，微软的Edge浏览器就会崩溃", "title_en": "Microsoft's Edge Browser is Crashing if Google is Your Search Engine", "transed": 1, "url": "https://petri.com/microsofts-edge-browser-is-crashing-if-google-is-your-search-engine", "via": "", "real_tags": ["google", "microsoft", "谷歌", "微软", "浏览器"]}, {"category": "", "categoryclass": "", "imagename": "2fcd96bb7ea00fdd5881a0132b17730f.jpg", "infoid": 1015456, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两家公司没有透露收购价格，但思科告诉我们，收购已经完成。\n在一篇宣布这笔交易的博客文章中，思科Meraki的克里斯·斯托里表示，Modcam将提升Meraki的机器学习游戏，同时也会给它带来一些关键的工程人才。\n通过收购Modcam，思科正在投资一支才华横溢的工程师团队，他们带来了机器学习、计算机视觉和云管理摄像头方面的丰富专业知识。Modcam已经开发出一种解决方案，使相机变得更加智能，“他写道。\n他的意思是，今天，虽然Meraki拥有包括运动检测和机器学习功能的智能摄像头，但这仅限于单摄像头操作。Modcam带来的是额外的收集信息的能力，并在多个摄像头之间应用机器学习，极大地增强了摄像头的功能。\n“有了Modcam的技术，这些微观层面的信息可以缝合在一起，使多个相机能够提供真实世界的宏观视角，”斯托里写道。例如，在实践中，这可以为设施管理团队提供更完整的空间可用性视图，这是一个特别重要的场景，因为企业试图找到在大流行期间更安全的开放方式。Modcam推销的另一个场景是更全面地描述工厂车间发生的事情。\n思科发言人告诉TechCrunch，Modcam的所有员工，思科只称其为“一个小团队”已经加入思科，Modcam技术将并入Meraki产品线，不再作为独立产品提供。\n根据Crunchbase的数据，Modcam成立于2013年，已经筹集了760万美元。思科在2012年以12亿美元收购了Meraki。", "note_en": "The companies did not reveal the purchase price, but  Cisco   tells us that the acquisition has closed.\n In a blog post announcing the deal, Cisco  Meraki’s   Chris Stori says Modcam is going to up Meraki’s machine learning game, while giving it some key engineering talent, as well.\n  “In acquiring  Modcam,   Cisco is investing in a team of highly talented engineers who bring a wealth of expertise in machine learning, computer vision and cloud-managed cameras. Modcam has developed a solution that enables cameras to become even smarter,” he wrote.\n What he means is that today, while Meraki has smart cameras that include motion detection and machine learning capabilities, this is limited to single camera operation. What Modcam brings is the added ability to gather information and apply machine learning across multiple cameras, greatly enhancing the camera’s capabilities.\n “With Modcam’s technology, this micro-level information can be stitched together, enabling multiple cameras to provide a macro-level view of the real world,” Stori wrote. In practice, as an example, that could provide a more complete view of space availability for facilities management teams, an especially important scenario as businesses try to find safer ways to open during the pandemic. The other scenario Modcam was selling was giving a more complete picture of what was happening on the factory floor.\n All of Modcams employees, which Cisco described only as “a small team” have joined Cisco, and the Modcam technology will be folded into the Meraki product line, and will no longer be offered as a stand-alone product, a Cisco spokesperson told TechCrunch.\n Modcam was founded in 2013 and has raised $7.6 million, according to Crunchbase data.  Cisco acquired Meraki back in 2012 for $1.2 billion.", "posttime": "2020-08-01 01:14:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "相机,收购,acquires,modcam", "title": "\n思科收购Modcam使Meraki智能相机产品组合更加智能", "title_en": "\n\t\t\t\tCisco acquires Modcam to make Meraki smart camera portfolio even smarter\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/31/cisco-acquires-modcam-to-make-meraki-smart-camera-portfolio-even-smarter/", "via": "", "real_tags": ["相机", "收购", "acquires", "modcam"]}, {"category": "", "categoryclass": "", "imagename": "cf740d537ae4c21bd50e8cb56e5cfeee.jpeg", "infoid": 1015455, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州立法机构的民主党人本周提议对该州收入最高的人群增税，以帮助支付受疫情影响的学校和服务费用。\n该提案将提高加州百万富翁的税收，并导致最高收入者的联邦和州税最高税率接近54%。\n该计划是在纽约州提议对富人增税以支付不断扩大的预算赤字之后出台的。\n一项对加州百万富翁增税的提案将导致联邦和州税收的最高税率接近54%。\n加利福尼亚州立法机构的民主党人本周提议对该州收入最高的人群增税，以帮助支付因冠状病毒大流行而受损的学校和服务费用。立法委员们说，增税将每年筹集60多亿美元，并将把富人的资金重新投向那些在新冠肺炎危机中受到最严重打击的人。\n该计划是在纽约州提议对富人增税以支付不断扩大的预算赤字之后出台的。这也加剧了关于在大流行期间扩大不平等以及谁应该向政府支付飙升的费用的日益激烈的辩论。\n然而，加州的提案将把全国最高的州税率提高得更高，并重新审视加州富人逃离该州的可能性。\n加州的最高边际税率是13.3%。新提案将对七位数的收入者增加三项新的附加费。它将对总收入超过100万元的人增加1%的附加费，对收入超过200万元的人增加3%的附加费，对收入超过500万元的人增加3.5%的附加费。\n因此，收入超过500万美元的人的最高税率将为16.8%，加州最高收入者的州和联邦税率加起来将飙升至53.8%。根据特朗普的减税政策，州和地方税的扣除额上限为1万美元，收入最高的加州人将无法从他们的联邦申报单中扣除新税。\n这项税收只会影响加州最富有的0.5%的纳税人。但根据加州特许经营税务局的数据，这一小部分超级收入者-其中许多是科技行业的人-缴纳了该州40%的税收。新的税率也将适用于资本利得，资本利得在科技收入中占很大份额，因为加州对资本利得税的税率与普通收入相同。\n由于许多科技公司现在允许高管在明年远程工作，收入最高的人可以更容易地离开该州，在内华达州和德克萨斯州等没有所得税的地方工作。如果新税在8月份获得批准，它将追溯到今年，并适用于2020年1月以来获得的收入。\n加州纳税人协会(California纳税人Association)主席罗伯特·古铁雷斯(Robert Gutierrez)说，增税将是许多纳税人的转折点，该协会倡导减税，促使他们预订前往49个税收较低的州之一的单程旅行。“加州纳税人协会”倡导减税，该协会主席罗伯特·古铁雷斯(Robert Gutierrez)说，这促使他们预订前往49个税收较低的州中的一个州的单程旅行。", "note_en": "Democrats in the California state legislature this week proposed a tax hike on the state&#39;s highest earners to help pay for schools and services hurt by the pandemic.\n The proposal would raise taxes on California millionaires, and result in a top tax rate of nearly 54% for federal and state taxes for the highest earners.\n The plan follows proposals in New York state to raise taxes on the wealthy to pay for a widening budget deficit.\n A proposal to raise taxes on California millionaires would result in a top tax rate of nearly 54% for federal and state taxes.\n Democrats in the California state legislature this week proposed a tax hike on the state&#39;s highest earners to help pay for schools and services hurt by the coronavirus pandemic. Legislators say the tax hike would raise more than $6 billion a year, and would redirect funding from the wealthy to those who have been hit hardest by  the Covid-19 crisis.\n  The plan follows proposals in New York state to raise taxes on the wealthy to pay for a widening budget deficit. And it adds to a growing debate over expanding inequality during the pandemic and who should pay the soaring costs to government.\n Yet the California proposal would raise the highest state tax rate in the country even higher, and renew the possibility of wealthy Californians fleeing the state.\n California&#39;s top marginal tax rate is 13.3%. The new proposal would add three new surcharges on seven-figure earners. It would add a 1% surcharge to gross income of more than $1 million, 3% on income over $2 million and 3.5% on income above $5 million.\n  So the top tax rate would be 16.8%, on income of more than $5 million and the combined state and federal tax rate for California&#39;s top earners would soar to 53.8%. With the deduction on state and local taxes capped at $10,000 under the Trump tax cuts, the top-earning Californians wouldn&#39;t be able to deduct the new taxes from their federal returns.\n The tax would only effect the top 0.5% of California taxpayers. But that small group of super-earners — many of them in tech — pay 40% of the state&#39;s tax revenues, according to California&#39;s Franchise Tax Board. The new tax rate would also apply to capital gains, which accounts for a large share of tech income, since California taxes capital gains at the same rates as ordinary income.\n  With many tech companies now allowing executives to work remotely for the next year, top earners could more easily leave the state and work in places with no income tax, like Nevada and Texas. If the new tax is approved in August, it would be retroactive for this year and apply to income earned since January 2020.\n &#34;The tax hikes would be the tipping point for many taxpayers,&#34; said Robert Gutierrez, president of the California Taxpayers Association, which advocates lower taxes, &#34;prompting them to book a one-way trip to one of the 49 states with lower taxes.&#34;", "posttime": "2020-08-01 01:12:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "百万富翁,tax,税率", "title": "对加州百万富翁增税将创造54%的税率", "title_en": "Tax hike on California millionaires would create 54% tax rate", "transed": 1, "url": "https://www.cnbc.com/2020/07/30/tax-hike-on-california-millionaires-would-create-54percent-tax-rate.html", "via": "", "real_tags": ["百万富翁", "tax", "税率"]}, {"category": "", "categoryclass": "", "imagename": "029c424ee6d93834e7bb24657d70ee49.jpg", "infoid": 1015454, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify首席执行官丹尼尔·埃克(Daniel Ek)在周四发表的最近接受Music Ally采访时讨论了流媒体和可持续性。埃克否认了有关Spotify向艺术家支付的版税不足的批评，并坚称在今天的未来格局中，这位音乐家的角色已经改变。\n埃克声称，有人制造了一个叙事谬误，这让乐迷们相信，Spotify没有为音乐家的音乐流媒体支付足够的费用。埃克说，一些过去做得很好的艺术家在未来可能不会做得很好，因为你不能每三到四年录制一次音乐，认为这样就足够了。\n埃克坚持认为，对成功的音乐家来说，需要的是比过去更深刻、更始终如一、更持久的承诺。“今天的艺术家们正在意识到，这是为了与他们的粉丝创造一种持续的互动。这是关于把作品放进去，是关于专辑周围的故事讲述，是关于与歌迷保持持续的对话。“。\n今年夏天，Spotify的股价创下500亿美元的历史新高，尽管这家流媒体平台对艺人的薪酬问题仍未得到解决。Spotify和Apple Music的版税是按比例确定的；每首特定歌曲的费用是根据歌曲与平台上最受欢迎的曲目相比的流媒体数量来确定的。在Spotify和Apple Music上，版税是按比例确定的；每首歌曲的费用是根据歌曲相对于平台上最受欢迎的曲目的流媒体数量来确定的。这导致了大多数独立音乐人获得的奖金最少，正如丽兹·佩利(Liz Pelly)在2017年为The Baffler所写的那样。\n然而，埃克声称，艺术家们私下多次表示，他们对Spotify的版税很满意，并表示他认为无法谋生的音乐家可能与现代标准格格不入。埃克说：“我真的觉得，那些在流媒体领域做得不好的人主要是那些想要以过去的方式发布音乐的人。”", "note_en": "Spotify CEO Daniel Ek discussed streaming and sustainability in a recent interview with  Music Ally published on Thursday. Ek denied criticisms that Spotify pays insufficient royalties to artists, and insisted that the role of the musician had changed in today&#39;s &#34;future landscape.&#34;\n    Ek claimed that a &#34;narrative fallacy&#34; had been created and caused music fans to believe that Spotify doesn&#39;t pay musicians enough for streams of their music. &#34;Some artists that used to do well in the past may not do well in this future landscape,&#34; Ek said, &#34;where you can’t record music once every three to four years and think that’s going to be enough.”\n  What is required from successful musicians, Ek insisted, is a deeper, more consistent, and prolonged commitment than in the past. “The artists today that are making it realize that it’s about creating a continuous engagement with their fans. It is about putting the work in, about the storytelling around the album, and about keeping a continuous dialogue with your fans.”\n    Spotify&#39;s stock value hit  all-time highs of $50 billion this summer even as questions about the streaming platform&#39;s compensation of artists remain unresolved. Royalties on Spotify and Apple Music are determined on a &#34;pro-rata&#34; basis; payment on each particular song is based on how much the song is streamed in comparison with the platform&#39;s most popular tracks. This results in &#34;the tiniest of payouts for most independent musicians,&#34; as Liz Pelly wrote for   The Baffler in 2017.\n  However, Ek alleged that artists have said &#34;many times&#34; in private that they are happy with their royalties from Spotify, and said that he believes that musicians who cannot make a living may not be in step with modern standards. “I feel, really, that the ones that aren’t doing well in streaming are predominantly people who want to release music the way it used to be released,” Ek said.", "posttime": "2020-08-01 01:11:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ceo,流媒体", "title": "Spotify CEO：音乐人不能再“每3-4年才发行一次音乐”", "title_en": "Spotify CEO: musicians can no longer release music only “once every 3-4 years”", "transed": 1, "url": "https://www.thefader.com/2020/07/30/spotify-ceo-daniel-ek-says-working-musicians-can-no-longer-release-music-only-once-every-three-to-four-years", "via": "", "real_tags": ["ceo", "流媒体"]}]