[{"category": "", "categoryclass": "", "imagename": "630c90e19854b58c2c13198e732b67a9.jpg", "infoid": 1003337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司在给The Verge的电子邮件中证实，Gitch周四解雇了“相当数量的员工”，以努力削减成本并确保“长期生存能力”.。Gitch表示，由于市场状况，它不得不“大幅削减运营成本”。\n据两名要求匿名的前员工称，至少有18人被解雇。消息人士称，Gitch在裁员前约有50名员工。格林奇拒绝就有多少员工被裁员发表评论。该公司表示，它正在为被解雇的员工提供“遣散费、医疗保险和寻找新工作的支持”。\nGitch执行长Anil Dash在推特上表示，裁员是因为“在艰难的经济环境下，身处竞争激烈的小公司”.。\n这周我们在格林奇进行了裁员。背景正如你所预期的那样：我们是一家小公司，在艰难的经济形势下，我们处于竞争激烈的领域。但这些优秀的人做了非常有价值的工作，我们整个团队和社区都很感激。\n-Anil Dash(@anildash)2020年5月22日。\nGitch是一个编码平台，于2017年推出，当时名为Fog Creek Software。该平台有一个古怪的外观，并强调其易用性-任何人都应该能够跳进去，重新混合其他人的代码，并启动一个将在Gitch的服务器上运行的小应用程序。\n不过，在过去的三年里，这项服务几乎都是完全免费的。直到一个月前，也就是疫情爆发大约一个月后，故障才推出了一项订阅服务，为用户提供每月支付10美元来扩展功能的能力。据两位消息人士透露，这项服务起步缓慢，其中一位称此次发布“平淡无奇”。\n今年3月，格林奇的员工投票决定在美国通信工人协会(Communications Workers Of America)的领导下成立一个工会，使他们成为首批组织起来的科技公司之一。格林奇同意自愿承认工会，但工会尚未与该公司谈判合同。The Verge已经联系工会请其置评。\n2018年，Gitch筹集了3000万美元的资金。该公司表示，这笔资金将使该公司能够“建立符合其雄心勃勃的愿景的平台和社区”。", "note_en": "Glitch laid off “a substantial number of employees” on Thursday in an effort to cut costs and ensure “long term viability,” the company confirmed in an email to  The Verge. Glitch said it had to “significantly cut operating costs” due to market conditions.\n At least 18 people were laid off, according to two former employees who asked to remain anonymous. Glitch had about 50 employees before the layoffs, the sources said. Glitch declined to comment on how many employees were laid off. The company said it is offering “severance, health insurance, and support in finding new employment” to employees who were laid off.\n Glitch CEO Anil Dash tweeted that the layoffs came as a result of being a “small company in a fiercely competitive space in a tough economy.”\n We had layoffs at Glitch this week. The context is what you’d expect: we are a small company in a fiercely competitive space in a tough economy. But these good people have done immensely valuable work that our entire team and community are grateful for.\n— Anil Dash (@anildash)  May 22, 2020\n Glitch is a coding platform that  launched in 2017 under what was then known as Fog Creek Software. The platform has a quirky look and emphasizes its ease of use — anyone is supposed to be able to jump in, remix someone else’s code, and launch a bite-sized app that will run on Glitch’s servers.\n The service has been completely free to use nearly all of the past three years, though. It wasn’t until one month ago — about a month into the pandemic — that  Glitch launched a subscription service, offering users the ability to pay $10 per month for expanded capabilities. The service had a slow start, according to both sources, with one describing the launch as “underwhelming.”\n In March, Glitch employees voted to form a union under the Communications Workers of America, making them one of the first tech companies to organize. Glitch agreed to voluntarily recognize the union, but the union had not yet negotiated a contract with the company.  The Verge has reached out to the union for comment.\n Glitch raised $30 million in funding in 2018. It said the funding would allow the company to “build the kind of platform and community that fits” its ambitious vision.", "posttime": "2020-05-23 13:35:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "裁员,lays,员工", "title": "小故障裁员“大量员工”以削减成本", "title_en": "Glitch lays off ‘substantial number of employees’ to cut costs", "transed": 1, "url": "https://www.theverge.com/2020/5/22/21268007/glitch-layoffs-substantial-number-coding-platform-union", "via": "", "real_tags": ["裁员", "lays", "员工"]}, {"category": "", "categoryclass": "", "imagename": "74999c26c25af8b626b9bfa9ba6859f8.jpg", "infoid": 1003336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阴影常常与黑暗和不确定性联系在一起。现在，NUS的研究人员通过展示一种利用这种常见但经常被忽视的光学效应来发电的方法，给阴影带来了积极的旋转。这一新颖的概念为电力电子在室内照明条件下产生绿色能源开辟了新的途径。\n来自NUS材料科学与工程以及NUS物理的一个团队创造了一种名为阴影效应能量发生器(SEG)的设备，它利用照明区和阴影区之间的照明对比度来发电。他们的研究突破于2020年4月15日发表在科学期刊“能源与环境科学”(Energy&Amp；Environmental Science)上。\n“影子无处不在，我们常常认为它们是理所当然的。在使用稳定光源为器件供电的传统光伏或光电应用中，阴影的存在是不希望的，因为它降低了器件的性能。在这项工作中，我们利用阴影造成的照明对比度作为一种间接的能量来源。照明中的对比度在阴影部分和照明部分之间感应电压差，从而产生电流。这种在阴影下收集能量的新概念是史无前例的，“研究小组组长、来自国立大学材料科学与工程学院的助理教授谭瑞清解释说。\n智能手机、智能眼镜和电子手表等移动电子设备需要高效、持续的电源供应。由于这些设备在室内和室外都可以佩戴，可以利用环境光的可穿戴电源可能会提高这些设备的多功能性。虽然商用太阳能电池可以在室外环境中发挥这一作用，但在阴影持续存在的室内条件下，它们的能量收集效率会显著下降。这种从与低光强相关的照明和阴影中清除能量的新方法既令人兴奋又及时，从而最大限度地提高能量收集的效率。\n为了应对这一技术挑战，NUS团队开发了一种低成本、易于制造的SEG，以执行两项功能：(1)将照明对比度从部分阴影投射转化为电能，(2)用作自供电的接近传感器来监控经过的对象。\nSEG包括布置在柔性透明塑料膜上的一组SEG电池。每个SEG单元都是沉积在硅片上的一层金薄膜。经过精心设计，与商用硅太阳能电池相比，SEG的制造成本更低。研究小组随后进行了实验，以测试SEG在发电和作为自供电传感器方面的性能。\n“当整个SEG电池处于照明或阴影下时，产生的电量很低或根本没有。当SEG单元的一部分被照亮时，检测到显著的电输出。我们还发现，发电的最佳表面积是当SEG电池的一半发光，另一半在阴影下，因为这样就有足够的面积分别产生和收集电荷，“来自NUS物理的联合团队负责人Andrew Wee教授说。\n基于实验室实验，该团队的四电池SEG在阴影移动的影响下，与商用硅太阳能电池相比，效率是商业硅太阳能电池的两倍。在室内照明条件下产生阴影的情况下，从SEG获得的能量足以为一块数字手表供电(即1.2V)。\n此外，该研究小组还表明，SEG可以作为监测移动物体的自供电传感器。当物体经过SEG时，它会在设备上投下间歇性的阴影，并触发传感器记录物体的存在和移动。\n这个由六名成员组成的团队花了四个月的时间来构思、开发和完善设备的性能。在下一阶段的研究中，NUS团队将试验黄金以外的其他材料，以降低SEG的成本。\nNUS的研究人员还在研究开发具有多功能的自供电传感器，以及连接到衣服上的可穿戴式传感器，以便在正常的日常活动中收集能量。另一个有前途的研究领域是开发低成本的SEG电池板，以有效地从室内照明中获取能量。\n喜欢这个故事吗？你可以加入NUS新闻电报频道，或者注册电子邮件时事通讯频道，定期更新。", "note_en": "Shadows are often associated with darkness and uncertainty. Now, NUS researchers are giving shadows a positive spin by demonstrating a way to harness this common but often overlooked optical effect to generate electricity. This novel concept opens up new approaches in generating green energy under indoor lighting conditions to power electronics.\n  A team from  NUS Materials Science and Engineering as well as  NUS Physics created a device called a shadow-effect energy generator (SEG), which makes use of the contrast in illumination between lit and shadowed areas to generate electricity. Their research breakthrough was reported in the scientific journal   Energy &amp; Environmental Science on 15 April 2020.\n  “Shadows are omnipresent, and we often take them for granted. In conventional photovoltaic or optoelectronic applications where a steady source of light is used to power devices, the presence of shadows is undesirable, since it degrades the performance of devices. In this work, we capitalised on the illumination contrast caused by shadows as an indirect source of power. The contrast in illumination induces a voltage difference between the shadow and illuminated sections, resulting in an electric current. This novel concept of harvesting energy in the presence of shadows is unprecedented,” explained research team leader Assistant Professor Tan Swee Ching, who is from NUS Materials Science and Engineering.\n  Mobile electronic devices such as smart phones, smart glasses and e-watches require efficient and continuous power supply. As these devices are worn both indoors and outdoors, wearable power sources that could harness ambient light can potentially improve the versatility of these devices. While commercially available solar cells can perform this role in an outdoor environment, their energy harvesting efficiency drops significantly under indoor conditions where shadows are persistent. This new approach to scavenge energy from both illumination and shadows associated with low light intensities to maximise the efficiency of energy harvesting is both exciting and timely.\n  To address this technological challenge, the NUS team developed a low-cost, easy-to-fabricate SEG to perform two functions: (1) to convert illumination contrast from partial shadows castings into electricity, and (2) to serve as a self-powered proximity sensor to monitor passing objects.\n    The SEG comprises a set of SEG cells arranged on a flexible and transparent plastic film. Each SEG cell is a thin film of gold deposited on a silicon wafer. Carefully designed, the SEG can be fabricated at a lower cost compared to commercial silicon solar cells. The team then conducted experiments to test the performance of the SEG in generating electricity and as a self-powered sensor.\n  “When the whole SEG cell is under illumination or in shadow, the amount of electricity generated is very low or none at all. When a part of the SEG cell is illuminated, a significant electrical output is detected. We also found that the optimum surface area for electricity generation is when half of the SEG cell is illuminated and the other half in shadow, as this gives enough area for charge generation and collection respectively,” said co-team leader Professor Andrew Wee, who is from NUS Physics.\n  Based on laboratory experiments, the team’s four-cell SEG is twice as efficient when compared with commercial silicon solar cells, under the effect of shifting shadows. The harvested energy from the SEG in the presence of shadows created under indoor lighting conditions is sufficient to power a digital watch (i.e. 1.2 V).\n  In addition, the team also showed that the SEG can serve as a self-powered sensor for monitoring moving objects. When an object passes by the SEG, it casts an intermittent shadow on the device and triggers the sensor to record the presence and movement of the object.\n    The six-member team took four months to conceptualise, develop and perfect the performance of the device. In the next phase of research, the NUS team will experiment with other materials, besides gold, to reduce the cost of the SEG.\n  The NUS researchers are also looking at developing self-powered sensors with versatile functionalities, as well as wearable SEGs attached to clothing to harvest energy during normal daily activities. Another promising area of research is the development of low-cost SEG panels for efficient harvesting of energy from indoor lighting.\n      Like this story?  Join the NUS News Telegram channel or  sign up for the email newsletter for regular updates .", "posttime": "2020-05-23 13:35:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "影子,effect,seg", "title": "利用“影子效应”发电", "title_en": "Using the ‘shadow-effect’ to generate electricity", "transed": 1, "url": "https://news.nus.edu.sg/research/using-shadow-effect-generate-electricity", "via": "", "real_tags": ["影子", "effect", "seg"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PI 4上用于USB大容量存储引导的测试版固件和引导加载程序现已面市。文档和设置说明在引导加载程序配置页面上，请阅读。这是测试版。如果您对手动固件更新感到不舒服，请等待标准版本提供此更新。不会很久的！https://www.raspberrypi.org/documentati._config.md一般互操作性报告应发布在论坛上。RPI-EEPROM问题模板已更新，以指明错误报告中需要哪些类型的日志。迷你如何使用USB卡读卡器：-选择Beta引导加载器并使用rpi-eeprom-update-d-f进行更新(需要新的配置设置)。\n弹出SD卡并使用USB读卡器引导，而不是直接引导SD。\nUSB SD卡读卡器通常比直接从卡启动性能更差，但这是一个有用的快速测试。注意：测试版的标准是没有任何退步和足够的USB笔驱动程序、固态硬盘+鼠标+键盘+供电集线器工作，即普通的台式机配置。具有更复杂设置的错误将在通常的增量版本中修复。不管怎样，代码发布了，该运行了(字面意思)。玩得开心!。\n太棒了！我专门为此预留了一个USB 3.0固态硬盘盘柜。快速问题：与SD卡相比，您期望的存储和引导性能如何？有什么我可以运行的有用的性能指标吗？\nBomblord写道：↑太棒了！我专门为此预留了一个USB 3.0固态硬盘盘柜。快速问题：与SD卡相比，您期望的存储和引导性能如何？有什么我可以运行的有用的性能指标吗？\n引导速度可能要快一些，对于大内核(例如，64位内核未压缩)或initramfs来说可能最明显，但一些SSD的初始化时间可能会更长。与SDHCI相比，初始化xHC控制器还有大约0.5秒的开销。也就是说，吞吐量很高，但有一些固定的管理费用。Linux有自己的USB3xHC堆栈，所以如果您已经将SSD用于rootfs，那么它不会改变，但至少在Raspbian上，systemd和X启动是启动的最大部分。\nUSB SD卡读卡器的性能通常比直接从卡启动差，但这是一个有用的快速测试。\n那么，如果我在完成入围列表后将SD卡映像重新刻录到USB3拇指驱动器上，这应该也能正常工作，对吧？\n干得好。没有启动介质的启动闪屏调试显示中出现较小的拼写错误.。USBMSD在10000秒后超时，我猜这应该是从SD卡启动，通过USB2.0或3.0.插入Poundland Signalex USB2.0多槽SDHC读卡器中。很完美，从最初的测试来看。\ntimg236写道：↑PI4上用于USB海量存储引导的测试版固件和引导加载程序现已面市。..。[*]弹出SD卡并使用USB读卡器引导，而不是直接引导SD。[/列表].。不管怎样，代码发布了，该运行了(字面意思)。玩得开心!。\n`+oooooooo00：`+ooooooooooo：-/ooooo++//ooooo：ooooo+//+ooooo。操作系统：Raspbian GNU/Linux 10(Buster)armv7l`+oooooo：-：oo-+o+：：/oooooo：host：raspberry Pi 4 Model B Rev 1.1`：ooooooo+``.ooooooo+-内核：5.4.42-v7l+`：++ooo/。：+ooo+/.`正常运行时间：2分钟.``.-.``.。套餐：2575(Dpkg).：-``：.`-：：-`shell：Bash 5.0.3-：-`.：-``-：-`解析：2560x1440`：：`.--.`.-.``.：`DE：LXDE.：`-：``WM：Openbox.：：`.：-`：``：``。主题：Adwaita[GTK3]-：`：。：.`：-Icons：Adwaita[GTK3]：-：。`-：终端：lxTerminal-：：-.-：-.``.``.-：：-。-：：-终端字体：等宽10.。``.：。`..`..。CPU：BCM2711(4)@1.500 GHz-：-`-：`内存：320MiB/3744MiB：`-：`：.：-：。：`-：`..--.`：。`.``.--..`.`.：`.-：-`。\n尝试从旧的USB卡读卡器引导(第一次尝试)未成功。\n干得好，覆盆子圆周率队。当我将固态硬盘插入USB2.0时，这里看起来都很好，但USB3.0端口却没有什么乐趣。快速互联网搜索https://jamesachambers.com/raspberry-pi.。SH-DRIVES/建议这可能是我的军刀USB/SATA电缆。会拿到一个不同的品牌，看看会不会有什么不同。\n最后一次编辑时间为2020年5月20日星期三下午2：18，共编辑1次。\n感谢您让它正常工作(主要是)我从SD卡运行RPI-UPDATE以提取ELF和DAT文件时遇到错误，如下所示：[电子邮件受保护]：~$sudo RPI-UPDATE BRANCH=msd-boot*Raspberry PI固件更新程序由Hexxeh提供，由Andrews和Dom增强*执行自我更新*更新后重新启动*Raspberry Pi固件更新程序由Hexxeh提供，由Andrews和Dom增强。我看不到MSD-BOOT分支。我猜MSD-BOOT还没有上市吧？问候！杰伊。\n我已经对它进行了测试，所以更新到了新的测试版Pieprom，并安装了最新的固件。在没有任何microSD卡的情况下，USB 3.0端口的引导似乎工作得非常好，速度也非常快。UAS和TRIM处于活动状态，因此没有负面影响。我的USB转SATA适配器是ASMedia1351，2TB硬盘有一个带有混合MBR的GPT分区表。\n@jr3us也许是不带参数的RPI更新，就像第一篇文章中的迷你指南所建议的那样？\n最后一次编辑时间为2020年5月20日星期三下午2：24分，共编辑1次。\n我在GitHub上做了一些调查，但我没有看到MSD-boot分支。我猜MSD-BOOT还没有上市吧？\n我用了引导文件夹里的那些。它们刚刚更新过，所以我以为就是它们了。工作得很好。\n肯德克写道：↑我已经测试过了，所以更新到了新的测试版Pieprom，并安装了最新的固件。在没有任何microSD卡的情况下，USB 3.0端口的引导似乎工作得非常好，速度也非常快。UAS和TRIM处于活动状态，因此没有负面影响。我的USB转SATA适配器是ASMedia1351，2TB硬盘有一个带有混合MBR的GPT分区表。\n在运行rpi-update时，是否使用了BRANCH=msd-boot？我看到您使用的链接在主分支中。问候！杰伊。\njr3us写道：↑当您运行rpi-update时，您是否使用了BRANCH=msd-boot？我看到您使用的链接在主分支中。\n我的操作系统是带有自定义内核的自定义Ubuntu20.04。因此，我只是将文件下载到/boot目录中。\n汉索顿写道：↑@jr3us，也许像第一篇帖子中的迷你指南所建议的那样，是一个没有参数的rpi-update？\n这个修好了，谢谢！看起来MSD-BOOT已经迁移到MASTER了。我正在使用这里链接的说明：usb._config.md谢谢你的hintl，我的https://www.raspberrypi.org/documentati引导现在可以工作了！问候！杰伊。\n分支昨天切换为主分支，以避免需要特殊分支文件.1553/https://github.com/raspberrypi/document。\ntimg236写道：昨日分支切换为主分支，以避免需要特殊分支https://github.com/raspberrypi/document.1553/↑。\n有人需要更新分支._config.md，因为它在几个地方仍然显示https://www.raspberrypi.org/documentati=msd-boot。\nhttps://github.com/raspberrypi/document写道：↑timg236写道：↑昨天分支切换为主分支，以避免需要特殊分支Trejan.1553/Files。\n有人需要更新分支._config.md，因为它在几个地方仍然显示https://www.raspberrypi.org/documentati=msd-boot。\n这是自动发生的，但是脚本运行和内容缓存更新会有一些延迟。\n测试了Raspbian w/Desktop下的Beta固件和引导程序EEPROM，在PI 4B 4 GB上使用Kingston USB 3多卡读卡器(FCR-HS4)中的Micro SD卡-与Micro SD卡插槽中的Micro SD卡和使用黑色覆盆子PI品牌适配器的SD卡插槽配合正常工作。已在PI上的所有4个USB端口中测试。USB 3端口，USB 2端口为正式PI鼠标和戴尔键盘；USB 2端口为USB 3端口，鼠标和键盘为USB 3端口。都在工作。在HDMI 0上显示。使用SD卡复制器将卡复制到2.5&#34；Startech.com盘柜(S2510BMU33)中的160 GB日立硬盘(从旧笔记本电脑)，并设置了新分区UUIDs&#39；选项。关机，断开电源和USB多卡读卡器，重新通电，PI已从硬盘正确启动。已测试重新启动-正常。已在两个USB 3端口中测试-正常。已测试HDMI 1上的单显示器-正常。注：硬盘和固态硬盘可能需要通过通电集线器连接。使用通过通电的USB 2.0集线器(D-Link DUB-H7 B1)连接的硬盘盘柜进行了快速测试-似乎工作正常。\n最后一次编辑时间为2020年5月20日周三下午3：39，共编辑2次。\nhttps://github.com/raspberrypi/document写道：↑Trejan写到：↑timg236写到：↑昨天分支切换为主分支以避免需要特殊分支timg.1553/files.。\n有人需要更新分支._config.md，因为它在几个地方仍然显示https://www.raspberrypi.org/documentati=msd-boot。\n这是自动发生的，但是脚本运行和内容缓存更新会有一些延迟。\n在raspbercrypi.org上似乎是最新的。如果您仍然看到旧版本的页面，请按键盘上的CTRL+F5，这将强制浏览器返回服务器获取页面，而不管服务器是否告诉它页面没有更改。\n这只是一个小细节，但是使用15/05/20的EEPROM镜像时，我最初无法让USB引导工作，因为引导顺序是0xF21，而不是Bootload配置页面上描述的0xF41。但是，将配置转储到文本文件时，引导顺序列为0xF41。将配置重写到EEPROM似乎也没有达到预期的效果-用0xF41的引导顺序重写配置一开始不起作用-我必须先将其更改为不同的值，然后再改回0xF41才能起作用。\n我执行了以下步骤来更新用于从USB引导的RPi4：1.使用定义的步骤更新EEPROM。2.通过写入新镜像创建USB驱动器。以下步骤为RPi4创建了一个USB可引导设备(我使用了SanDisk 128 GB USB3Ultra Lite Boot a Raspberry pi 3，(使用上面新鲜USB的Raspberry pi 3。3.sudo apt update&amp；&amp；sudo apt Full-Upgrade 4.rpi-update#这将安装RPI 4.5所需的更新后的*.elf和*.dat文件。5.重新启动，让RPI 3返回桌面。6.关闭RPI 3.7。7.将USB从RPI 3移出，并使用它从USB3端口引导RPI 4。成功！\nMarko73写道：↑只是一个小细节，但是使用15/05/20的EEPROM镜像，我最初无法启动USB，因为启动顺序是0xF21，而不是Bootload配置页面上描述的0xF41。但是，将配置转储到文本文件时，引导顺序列为0xF41。将配置重写到EEPROM似乎也没有达到预期的效果-用0xF41的引导顺序重写配置一开始不起作用-我必须先将其更改为不同的值，然后再改回0xF41才能起作用。\n听起来您可能是通过不同的途径获得EEPROM映像的。不同的发行版？\n也有raspi-config选项在工程中，它将提供一个简单的引导顺序配置选择SD/网络或SD/USB-MSD。https://github.com/RPi-Distro/raspi-con..。spi-config这应该可以帮助任何想要开始网络引导的人，例如PiServer。注意：它不是用于编辑引导加载程序配置的GUI，它是更高级别的配置选择。\ngeev03写道：usb timg236写道：↑↑PI4上用于大容量存储引导的测试版固件和引导加载程序现已面市。..。[*]弹出SD卡并使用USB读卡器引导，而不是直接引导SD。[/列表].。不管怎样，代码发布了，该运行了(字面意思)。玩得开心!。\n`+oooooooo00：`+ooooooooooo：-/ooooo++//ooooo：ooooo+//+ooooo。操作系统：Raspbian GNU/Linux 10(Buster)armv7l`+oooooo：-：oo-+o+：：/oooooo：host：raspberry Pi 4 Model B Rev 1.1`：ooooooo+``.ooooooo+-内核：5.4.42-v7l+`：++ooo/。：+ooo+/.`正常运行时间：2分钟.``.-.``.。套餐：2575(Dpkg).：-``：.`-：：-`shell：Bash 5.0.3-：-`.：-``-：-`解析：2560x1440`：：`.--.`.-.``.：`DE：LXDE.：`-：``WM：Openbox.：：`.：-`：``：``。主题：Adwaita[GTK3]-：`：。：.`：-Icons：Adwaita[GTK3]：-：。`-：终端：lxTerminal-：：-.-：-.``.``.-：：-。-：：-终端字体：等宽10.。``.：。`..`..。CPU：BCM2711(4)@1.500 GHz-：-`-：`内存：320MiB/3744MiB：`-：`：.：-：。：`-：`..--.`：。`.``.--..`.`.：`.-：-`。\n尝试从旧的USB卡读卡器引导(第一次尝试)未成功。\n除了一张很不错的覆盆子的大照片外，它完全没有告诉我们任何关于你的USB硬件，引导加载程序版本，你采取了什么步骤，或者它以什么方式不起作用。\n我设法找到了一台如果连接了USB启动就会损坏的设备。我有一对Startech.com 3.5&34；HDD盘柜(S3510BMU33)，它们是单驱动器盘柜。我每个都有一个1TB的硬盘，目前组成了一个ZFS池，我已经成功地与Raspbian以及现在的Ubuntu20.04arm64一起使用了这个池。为了测试USB MSD引导，我关闭了该PI、集线器和机箱的电源，然后将集线器和两个机箱连接到我的测试用的PI 4B 4 GB(与从其他USB MSD设备引导的那个相同)。当引导加载程序进入检查驱动器的LUN 0阶段时，我发现引导加载程序一致挂起。我试过将设备超时时间从2000毫秒延长到7000毫秒，但没有什么不同。驱动器开始旋转，但引导加载程序在&#39；LUN 0&#39；处停滞。Startech盘柜具有VID：PID 174c：1053，这是一个通用ASM1053 ID。桥接芯片上写着ASM1053。由于某些原因，引导加载程序在尝试与此驱动器通信时挂起。我可以从另一个硬盘(在正常工作的2.5&34；盘柜中)启动，但如果在启动时连接了非正常工作的3.5&34；盘柜，则引导加载程序总是挂起。我已尝试将盘柜连接到USB 2集线器和USB 3集线器，使用不同的驱动器和盘柜(2.5和#34；日立硬盘，盘柜桥接器174C：1153，ASM1153E)可以正常启动USB MSD。两个有问题的驱动器存储模块和工作正常的存储模块连接的屏幕截图，所有这些都通过HUB：https://drive.google.com/file/d/1qvkYpd.。SP=仅与通过集线器https://drive.google.com/file/d/1_lGwHV连接的一个有问题的盘柜共享屏幕截图.。SP=共享我有跳线电缆，以便连接到另一台机器上，这样我就可以从串行端口进行调试(我似乎丢失了以前使用PI 1的那些电缆)。我还将介绍如何设置网络调试输出。", "note_en": "The beta firmware and bootloader for USB mass storage boot on Pi 4 are now available.   Documentation and setup instructions are on the bootloader configuration page, please read it.    This is a beta release. If you aren&#39;t already comfortable with manual firmware updates then please wait until this is available in a standard release. It won&#39;t be very long!   https://www.raspberrypi.org/documentati ... _config.md  General interoperability reports should be posted on the forums. The rpi-eeprom issue template has been updated to indicate what sort of logs will be required in bug reports.   Mini-HOWTO if you have a USB card reader:-   Select beta bootloader and use rpi-eeprom-update -d -f to update it (the new configuration settings are required)\n  Eject the SD card and boot using USB card reader instead of direct SD boot.\nUSB sd-card readers will generally give worse performance than booting from the card directly but it&#39;s a useful quick test.  N.B. The &#39;pass&#39; criteria for the beta is no regressions and enough USB pen-drivers, SSDs + mouse + keyboard + powered hub working i.e. usual desktop configurations. Bugs with more complicated setups will be fixed in the usual incremental releases.  Anyway, code released, time to run (literally). Have fun!\n    Awesome! I have a USB 3.0 SSD enclosure set aside specifically for this. Quick question how do you expect the storage and boot performance to compare to an SD card? Any useful performance metrics I could run?\n    bomblord wrote:  ↑ Awesome! I have a USB 3.0 SSD enclosure set aside specifically for this. Quick question how do you expect the storage and boot performance to compare to an SD card? Any useful performance metrics I could run?\nMaybe a bit faster to boot, probably most noticeable with large kernels (e.g. the 64 bit kernel is not compressed) or initramfs but some SSDs can take longer to initialise. There is also about a 0.5 second overhead in initialising the xHC controller compared to the SDHCI.  i.e Throughput is high but there are some fixed overheads.  Linux has it&#39;s own USB3 xHC stack so that won&#39;t change if you already use an SSD for rootfs but at least on Raspbian the systemd and X startup is the largest part of boot.\n    USB sd-card readers will generally give worse performance than booting from the card directly but it&#39;s a useful quick test\nSo then, if I re-burn the SD card image to a USB3 thumbdrive after having done the short list, this should work too right?\n    Excellent work. Minor typo in the boot splash screen debug display with no boot media...  &#34;USB MSD timed out after 10000 seconds&#34;  I&#39;m guessing that should be &#34;milliseconds&#34;  Boot from SD Card plugged into a Poundland Signalex USB 2.0 Multislot SDHC Reader, via USB 2.0 or 3.0 ... Perfect, from initial testing.\n    timg236 wrote:  ↑ The beta firmware and bootloader for USB mass storage boot on Pi 4 are now available.   .... [*] Eject the SD card and boot using USB card reader instead of direct SD boot. [/list] ... Anyway, code released, time to run (literally). Have fun!\n `+oooooooooooo: `+oooooooooooo: -------------- /oooo++//ooooo: ooooo+//+ooooo. OS: Raspbian GNU/Linux 10 (buster) armv7l `+ooooooo:-:oo- +o+::/ooooooo: Host: Raspberry Pi 4 Model B Rev 1.1 `:oooooooo+`` `.oooooooo+- Kernel: 5.4.42-v7l+ `:++ooo/. :+ooo+/.` Uptime: 2 mins ...` `.----.` ``.. Packages: 2575 (dpkg) .::::-``:::::::::.`-:::-` Shell: bash 5.0.3 -:::-` .:::::::-` `-:::- Resolution: 2560x1440 `::. `.--.` `` `.---.``.::` DE: LXDE .::::::::` -::::::::` ` WM: Openbox .::` .:::::::::- `::::::::::``::. Theme: Adwaita [GTK3] -:::` ::::::::::. ::::::::::.`:::- Icons: Adwaita [GTK3] :::: -::::::::. `-:::::::: :::: Terminal: lxterminal -::- .-:::-.``....``.-::-. -::- Terminal Font: Monospace 10 .. `` .::::::::. `..`.. CPU: BCM2711 (4) @ 1.500GHz -:::-` -::::::::::` .:::::` Memory: 320MiB / 3744MiB :::::::` -::::::::::` :::::::. .::::::: -::::::::. :::::::: `-:::::` ..--.` ::::::. `...` `...--..` `...` .:::::::::: `.-::::-`\nAttempt to boot from an old usb-card reader (first attempt) did not succeed\n    Great work raspberry pi team. All looking good here when I plug SSD into USB 2.0 but no joy in USB 3.0 port. A quick internet search  https://jamesachambers.com/raspberry-pi ... sh-drives/ suggests it&#39;s possibly my Sabrent USB/Sata Cable. Will get hold of a different brand and see if that makes a difference.\n  Last edited by   on Wed May 20, 2020 2:18 pm, edited 1 time in total.\n    Thank you for getting this working(mostly)     I am getting an error when running rpi-update from the sd card to pull the elf and dat files as follows:   [email protected]:~ $ sudo rpi-update branch=msd-boot  *** Raspberry Pi firmware updater by Hexxeh, enhanced by AndrewS and Dom  *** Performing self-update  *** Relaunching after update  *** Raspberry Pi firmware updater by Hexxeh, enhanced by AndrewS and Dom  *** Invalid hash given  [email protected]:~ $    I did a little sleuthing on github, and I don&#39;t see an msd-boot branch.   I am guessing that msd-boot isn&#39;t available yet?  Regards!  Jay\n    I&#39;ve tested it, so updated to the  new beta pieeprom, and installed  the latest firmware. The boot seems to work very well and very fast on USB 3.0 port, without any microSD card. The UAS and TRIM are active, so there are no negative effects. My USB to SATA adapter is ASMedia 1351, and the 2TB HDD has a GPT partition table with hybrid MBR.\n    @jr3us Perhaps a rpi-update without arguments as the &#39;mini&#39; guide&#39; in the first post suggests?\n  Last edited by   on Wed May 20, 2020 2:24 pm, edited 1 time in total.\n    I did a little sleuthing on github, and I don&#39;t see an msd-boot branch.   I am guessing that msd-boot isn&#39;t available yet?\nI used the ones in the boot folder. They had just been updated so I assumed that they were the ones. Worked fine.\n    Kendek wrote:  ↑ I&#39;ve tested it, so updated to the  new beta pieeprom, and installed  the latest firmware. The boot seems to work very well and very fast on USB 3.0 port, without any microSD card. The UAS and TRIM are active, so there are no negative effects. My USB to SATA adapter is ASMedia 1351, and the 2TB HDD has a GPT partition table with hybrid MBR.\nWhen you ran rpi-update, did you use the branch=msd-boot? I see the link you used was in the master branch.  Regards!  Jay\n    jr3us wrote:  ↑ When you ran rpi-update, did you use the branch=msd-boot? I see the link you used was in the master branch.\nMy OS is a custom Ubuntu 20.04 with a custom kernel. So I just downloaded the files into the /boot dir.\n    hansotten wrote:  ↑ @jr3us Perhaps a rpi-update without arguments as the &#39;mini&#39; guide&#39; in the first post suggests?\nThis fixed it, thanks! Looks like msd-boot was migrated into master. I was using the instructions linked here:   https://www.raspberrypi.org/documentati ... _config.md  Thanks for the hintl, my usb boot is now working!  Regards!   Jay\n    The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\n    timg236 wrote:  ↑ The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\nSomebody needs to update  https://www.raspberrypi.org/documentati ... _config.md as it still says branch=msd-boot in several places.\n    trejan wrote:  ↑  timg236 wrote:  ↑ The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\nSomebody needs to update  https://www.raspberrypi.org/documentati ... _config.md as it still says branch=msd-boot in several places.\nThat happens automatically, but there will be some delay for scripts to run and content caches to update.\n    Tested beta firmware and bootloader EEPROM under Raspbian w/desktop on PI 4B 4GB with micro SD card in Kingston USB 3 multi card reader (FCR-HS4) - works fine with micro SD card in micro SD card slot, and SD card slot using black Raspberry Pi-branded adaptor. Tested in all 4 USB ports on the Pi. While in USB 3 port, official Pi mouse and Dell keyboard in USB 2 ports; while in USB 2 port, mouse and keyboard in USB 3 ports. All working. Display on HDMI 0.  Copied card to 160GB Hitachi hard disk (from an old laptop) in 2.5&#34; Startech.com enclosure (S2510BMU33) using SD Card Copier, with &#39;New Partition UUIDs&#39; option set. Shut down, removed power and USB multi card reader, reapplied power and Pi booted correctly from hard disk. Tested reboot - OK. Tested in both USB 3 ports - OK. Tested single display on HDMI 1 - OK.  Note: Hard disks and SSDs may need to be connected via a powered hub.  Did a quick test with hard disk enclosure connected via powered USB 2.0 hub (D-Link DUB-H7 B1) - seems to work fine.\n  Last edited by   on Wed May 20, 2020 3:39 pm, edited 2 times in total.\n    timg236 wrote:  ↑  trejan wrote:  ↑  timg236 wrote:  ↑ The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\nSomebody needs to update  https://www.raspberrypi.org/documentati ... _config.md as it still says branch=msd-boot in several places.\nThat happens automatically, but there will be some delay for scripts to run and content caches to update.\nSeems to be up-to-date now on raspberrypi.org. If you are still seeing the old version of the page, press CTRL+F5 on your keyboard, which should force the browser to go back to the server to fetch the page, regardless of whether the server tells it the page has not changed.\n    Just a small detail but using the EEPROM image from 15/05/20 I initially couldn&#39;t get USB booting to work, because the boot order was 0xF21 instead of 0xF41 as described on the bootload configuration page. However, dumping the config to a text file, the boot order was listed as 0xF41. Rewriting the config to the EEPROM also seemed not to behave as expected - rewriting the config with boot order of 0xF41 didn&#39;t work at first - I had to change it to something different first, then back to 0xF41 before it worked.\n    I did the following steps to update the RPi4 for booting off USB:  1. Update the eeprom, using the steps defined. 2. Create a usb drive by writing a fresh image.  The following steps create a USB bootable device for the RPi4 ( I used a SANDISK 128GB USB3 Ultra Lite  Boot a raspberry pi 3 , ( use a Raspberry pi 3 with the fresh USB above.  3. sudo apt update &amp;&amp; sudo apt full-upgrade 4. rpi-update ### This installs the updated *.elf and *.dat files needed by the RPi 4.  5. Reboot, and let the RPi 3 return to desktop. 6. Shutdown the RPi 3.  7. Move the USB from the RPI 3 and use it to boot the RPi 4 from a USB3 port.  Success!\n    Marko73 wrote:  ↑ Just a small detail but using the EEPROM image from 15/05/20 I initially couldn&#39;t get USB booting to work, because the boot order was 0xF21 instead of 0xF41 as described on the bootload configuration page. However, dumping the config to a text file, the boot order was listed as 0xF41. Rewriting the config to the EEPROM also seemed not to behave as expected - rewriting the config with boot order of 0xF41 didn&#39;t work at first - I had to change it to something different first, then back to 0xF41 before it worked.\nIt sounds like you may have gotten the EEPROM image via a different route. Different distro?\n    There&#39;s also raspi-config option in the works which will present a simple boot order configuration choice SD/Network or SD/USB-MSD.    https://github.com/RPi-Distro/raspi-con ... spi-config  This should help anyone who wants to get started with network-boot e.g. with PiServer.   N.B. It&#39;s not intended to be GUI for editing the bootloader config, it&#39;s a higher level configuration choice.\n    geev03 wrote:  ↑  timg236 wrote:  ↑ The beta firmware and bootloader for USB mass storage boot on Pi 4 are now available.   .... [*] Eject the SD card and boot using USB card reader instead of direct SD boot. [/list] ... Anyway, code released, time to run (literally). Have fun!\n `+oooooooooooo: `+oooooooooooo: -------------- /oooo++//ooooo: ooooo+//+ooooo. OS: Raspbian GNU/Linux 10 (buster) armv7l `+ooooooo:-:oo- +o+::/ooooooo: Host: Raspberry Pi 4 Model B Rev 1.1 `:oooooooo+`` `.oooooooo+- Kernel: 5.4.42-v7l+ `:++ooo/. :+ooo+/.` Uptime: 2 mins ...` `.----.` ``.. Packages: 2575 (dpkg) .::::-``:::::::::.`-:::-` Shell: bash 5.0.3 -:::-` .:::::::-` `-:::- Resolution: 2560x1440 `::. `.--.` `` `.---.``.::` DE: LXDE .::::::::` -::::::::` ` WM: Openbox .::` .:::::::::- `::::::::::``::. Theme: Adwaita [GTK3] -:::` ::::::::::. ::::::::::.`:::- Icons: Adwaita [GTK3] :::: -::::::::. `-:::::::: :::: Terminal: lxterminal -::- .-:::-.``....``.-::-. -::- Terminal Font: Monospace 10 .. `` .::::::::. `..`.. CPU: BCM2711 (4) @ 1.500GHz -:::-` -::::::::::` .:::::` Memory: 320MiB / 3744MiB :::::::` -::::::::::` :::::::. .::::::: -::::::::. :::::::: `-:::::` ..--.` ::::::. `...` `...--..` `...` .:::::::::: `.-::::-`\nAttempt to boot from an old usb-card reader (first attempt) did not succeed\nOther than a large picture of a Raspberry which is nice, that tells us absolutely nothing about your USB hardware, the bootloader version, what steps you took or in what way it di not work\n    I&#39;ve managed to find a device that breaks USB boot if it is attached. I have a pair of Startech.com 3.5&#34; HDD enclosures (S3510BMU33), which are single drive enclosures. I have a 1TB hard disk in each which currently make up a ZFS pool that I have used successfully with Raspbian, and now Ubuntu 20.04 arm64. To test USB MSD boot, I powered down that Pi, the hub, and the enclosures, then connected the hub and the two enclosures to my &#39;testing&#39; Pi 4B 4GB (same as the one that boots from other USB MSD devices). I&#39;m seeing a consistent hang in the bootloader when it gets to the &#39;LUN 0&#39; stage of examining the drive. I&#39;ve tried extending the device timeout from 2000 to 7000 milliseconds, but it makes no difference. The drive spins up but the bootloader gets stuck at &#39;LUN 0&#39;.  The Startech enclosure has vid:pid 174c:1053 which is a generic ASM1053 id. The bridge chip says ASM1053 on it.  For some reason the bootloader is hanging when it tries to talk to this drive. I can boot from another hard disk (in the working 2.5&#34; enclosure), but if the non-working 3.5&#34; enclosure is connected at boot time, the bootloader always hangs. I have tried the enclosure connected to a USB 2 hub and USB 3 hub that will do USB MSD boot OK with a different drive and enclosure (2.5&#34; Hitachi hard disk, enclosure bridge 174c:1153 which is an ASM1153E).  Screenshot with both problematic drive enclosures, and working 2.5&#34; enclosure attached, all via hub:  https://drive.google.com/file/d/1qvkYpd ... sp=sharing  Screenshot with just one problematic enclosure attached via hub:  https://drive.google.com/file/d/1_lGwHV ... sp=sharing  I have jumper cables on order to hook up to another machine so I can get debug out of the serial port (I seem to have lost the ones I used back back in the day with my Pi 1s). I will look at setting up network debug output as well.", "posttime": "2020-05-23 13:35:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,pi,usb", "title": "Raspberry PI 4 USB大容量存储测试版", "title_en": "Raspberry Pi 4 USB mass storage beta", "transed": 1, "url": "https://www.raspberrypi.org/forums/viewtopic.php?t=274595&p=1663644", "via": "", "real_tags": ["pi", "usb"]}, {"category": "", "categoryclass": "", "imagename": "6a3cee053f9020262e8abf739d934cdf.jpg", "infoid": 1003334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你曾经渴望在星舰企业号上工作，那就放心吧：最新的办公楼与宇宙飞船的共同点比你意识到的要多得多。\n这也不仅仅是苹果的新园区。随着工作在我们生活中的地位越来越重要，工程师、建筑师和科学家开始将我们的工作场所视为密封的结构，必须积极管理内部环境，同时减轻污染和其他危险，这些都是在世界上许多最经济的国家做生意的成本……", "note_en": "If you have ever yearned to work aboard the Starship Enterprise, take comfort: The newest office buildings have more in common with spaceships than you realize.\n  It isn’t just Apple’s new campus, either. As work takes an ever more central place in our lives, engineers, architects and scientists are beginning to view our workplaces as sealed structures that must actively manage their internal environments, while mitigating pollution and other hazards that are the cost of doing business in many of the world’s most economically...", "posttime": "2020-05-23 13:34:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,buildings", "title": "写字楼应该像宇宙飞船一样运转(2017)", "title_en": "Office buildings should run like spaceships (2017)", "transed": 1, "url": "https://www.wsj.com/articles/why-office-buildings-should-run-like-spaceships-1507467601", "via": "", "real_tags": ["应该", "buildings"]}, {"category": "", "categoryclass": "", "imagename": "48e295b17026344c87c590eb9efed199.jpg", "infoid": 1003333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在机组人员龙飞船被安装在猎鹰9号火箭上后，过去几天进行的最后一次拉力检查已经正式结束，结果是一切都准备就绪，为周三的发射做准备。猎鹰9号火箭将把机组人员龙飞船送往国际空间站(ISS)。另一次飞行准备情况审查计划在进一步检查后于周一进行。\n5月27日的发射窗口正式定于美国东部夏令时下午4点33分(太平洋标准时间下午1点33分)开放，搭载机组人员龙的猎鹰9号将从佛罗里达州的肯尼迪航天中心起飞。机上将有NASA宇航员道格·赫尔利(Doug Hurley)和鲍勃·本肯(Bob Behnken)，他们是第一批被美国制造的私人航天器搭载的宇航员，也是自2011年航天飞机计划结束以来第一批从美国本土发射进入太空的人类。\n这项任务将包括本肯和赫尔利发射到太空，然后与国际空间站的乘员龙会合，如果一切按计划进行，乘员龙将自动与空间站对接。然后，宇航员们将留在空间站，作为机组人员为空间站的工作做出贡献，最长可达三个月，然后才能回家。\n尽管Behnken和Hurley将在国际空间站为这次任务花费一些时间，但这实际上并不是一次可操作的发射-这是SpaceX公司为NASA商业机组人员计划进行的人类评级过程中的最后一次演示任务。商业乘员是NASA与公司发展强有力的公私合作伙伴关系的尝试，以帮助支付从美国将人送入太空的费用。\n任务的结束将涉及机组人员龙与空间站分离，宇航员在船上，并执行受控的重返大气层和下降到海洋，他们将在那里被SpaceX的回收机组人员接走。\n准备过程中的下一步是静态试射，将在今天晚些时候进行，包括在发射台上点燃猎鹰9号的发动机，以确保它们在起飞前正常工作。然后是发射日(还有备用日期以防天气问题)-根据Behnken的说法，届时这次飞行的机组人员龙太空舱的正式名称也将公布。", "note_en": "This final stretch check, conducted over the past few days after the Crew Dragon spacecraft was mounted on top of the  Falcon   9 rocket that will take it to the International Space Station (ISS), has officially concluded and the result is that everything is cleared to go forward with preparations ahead of the launch on Wednesday. Another flight readiness review is scheduled for Monday after further checkouts.\n The launch window on May 27 is officially set to open at 4:33 PM EDT (1:33 PM PDT), and the Falcon 9 carrying the Crew Dragon will be taking off from Kennedy Space Center in Florida. On board will be NASA astronauts Doug Hurley and Bob Behnken, the first astronauts to be carried aboard a private U.S.-built spacecraft, and the first humans to launch into space from U.S. soil since the end of the Space Shuttle program in 2011.\n  The mission will involve Behnken and Hurley launching to space, then making a rendezvous with the ISS in Crew Dragon, which will autonomously dock with the station if all goes to plan. The astronauts will then stay on the station and contribute to its work as crew members for up to three months before returning home.\n Despite the fact that Behnken and Hurley are going to spend a bit of time at the ISS on this mission, this isn’t actually an operational launch — it’s the final demonstration mission in SpaceX’s human-rating process for the NASA Commercial Crew program. Commercial Crew is NASA’s attempt to develop strong public-private partnerships with companies to help defray the cost of sending people to space from the U.S.\n The end of the mission will involve the Crew Dragon detaching from the Space Station with the astronauts on board, and performing a controlled re-entry and descent into the ocean, where they’ll be picked up by SpaceX’s recovery crew.\n Next up in the preparation sequence is a static test fire, which will be performed sometime later today, and involves firing the Falcon 9’s engines while it’s on the launchpad to see that they’re functioning correctly before it takes off. Then it’s on to launch day (and there are backup dates in case of weather problems) — when the official name of the Crew Dragon capsule for this flight will be revealed, too, according to Behnken.", "posttime": "2020-05-23 13:34:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "航天器,crewed,机组人员", "title": "SpaceX的第一次载人航天器发射获准进行到5月27日的目标", "title_en": "SpaceX’s first crewed spacecraft launch cleared to proceed for May 27 target", "transed": 1, "url": "https://techcrunch.com/2020/05/22/spacexs-first-crewed-spacecraft-launch-is-officially-cleared-to-proceed-on-may-27/", "via": "", "real_tags": ["航天器", "crewed", "机组人员"]}, {"category": "", "categoryclass": "", "imagename": "1016b28248ad952d65c253423118c9d4.png", "infoid": 1003332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山湾区揭露丑闻的报纸“SF周刊”今天发表了一篇揭露特斯拉弗里蒙特工厂糟糕的健康状况和工作条件的文章。一位特斯拉工厂工人说，“这是生死攸关的情况.”另一名拒绝重返工作岗位的工人说，“这是一个现代的血汗工厂。”不幸的是，我们从特斯拉未加入工会的员工那里听到了类似的严厉言论，他们帮助公司取得了重大成功。\n卡洛斯·加布里尔(Carlos Gabriel)是一名工人，他拒绝返回，因为社交距离没有得到遵守。他说：\n这里真的没有空间，而且这是一家空气回收的工厂。你们基本上就是在互相呼吸。\n上周联系electrek的另一名员工证实了SF Weekly的报道。他描述了在阿拉米达县批准特斯拉之前整整一周举行的一次会议。\n我们彼此相距几英寸。看起来他们没有对生产线做任何改变。在生产线上，我们有时会互相顶着工作，接触相同的设备。\n他们给了我们一个面具，当我们走进来的时候，他们给了我们临时工。浴室并不总是干净的，而且很小。\n联系到electrek的工人补充说，“工会多年来一直试图进入，但一直没有运气。”他说每个人都知道“埃隆不会允许的”SF Weekly指出，特斯拉是美国所有主要(美国)汽车公司中唯一没有加入工会的员工。\n今年3月，另一名同样不愿透露姓名的员工向electrek通报了工厂正式关闭时的情况。\n我今天早上到公司了。我们仍在全面投产。看起来他们并没有裁员。他们给我们一个口罩，当我们走进去的时候给我们量体温。他们不是在练习安全社交距离。\n这位特斯拉首席执行官5月12日给他的工人发了一条信息，感谢他们在工厂重新开工后重返工作岗位。他写道：\n我只想给你寄一封感谢信，感谢你为特斯拉的成功付出了辛勤的努力。看到工厂恢复生机，而你正在让它发生，这真是太酷了！\n为他人制造产品或提供有用的服务，一天的诚实工作是极其光荣的。我对那些以做好工作为荣的人，不管是什么职业，比起那些什么都不做的富人或名人，要尊敬得多。\n一些员工表示支持马斯克作为回报。他们是抵制封锁协议的所谓揭幕运动的一部分。这些工人对马斯克和唐纳德·特朗普表达的“重返工作岗位”的观点表示同情。据SF周刊报道，一些员工还“摘下口罩，以便在几个小时的体力劳动后呼吸”。\n特斯拉继续将更多员工召回工作岗位。尽管如此，该公司警告称，不回来工作的员工可能会失去失业救济金。\n5月12日，通过阿拉米达县和特斯拉官员的会议，制定了一套针对特定地点的大流行安全指南。指导方针要求改变休息室，温度筛选，并让员工分散在整个工厂。\n我们已做好充分准备，确保安全进行，并与政府的所有预防措施和该县要求的安全措施保持一致。\n然而，SF Weekly报道称，工人们表示，人力资源备忘录和重返工作岗位手册中概述的措施“在弗里蒙特的工厂车间没有得到始终如一的执行，工厂管理层仍在摸索着建立动态的安全指导方针。”\n他们试图在每个人都在工作的时候实施这些改变。这会让你怀疑你的生命是否值每小时20美元。\n员工们说，到上周四，轮班之间20分钟的宽限期缩短到了10分钟。一次换班涉及的员工人数可能超过1000人。有些班次早在凌晨5点就开始了。\n一位61岁的流水线员工叫阿特(Art)，他只透露了自己的名字，他说他和同事们“肩并肩”工作，没有6英尺的距离。\n弗里蒙特警方已经短暂露面几次，以核实是否执行了社会疏远措施。然而，弗里蒙特警察局的一位发言人说，“我们根本没有能力对弗里蒙特的每一家企业进行(检查)，因为我们有数千家企业。”\n加布里埃尔告诉SF周刊，他相信马斯克几个月来一直在考虑将工厂从旧金山湾区搬出去。他说，这家拥有1万名员工的工厂是该地区最后几家蓝领工作的供应商之一，但特斯拉管理层并不认为自己是社区的一部分。“我们对(特斯拉)来说是一次性的，”加布里埃尔说。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从哪里开始？请查看我们的YouTube频道以了解最新的评论。", "note_en": "SF Weekly, the Bay Area’s muckraking newspaper, today published an exposé about poor health and work conditions at Tesla’s Fremont plant. One Tesla factory worker said, “This is a life and death situation.” Another worker, who refused to return to work, said, “It’s a modern-day sweatshop.” Unfortunately, we’ve heard similarly harsh words from Tesla non-unionized employees, who helped build the company into a major success.\n  Carlos Gabriel, the worker who refused to return because social distancing is not being observed, said:\n There’s really no room, and this is a factory with recycled air. You’re basically just breathing on each other.\n Another employee who reached out to  Electrek last week corroborated the report from  SF Weekly. He described a meeting held a full week before Tesla was given the go-ahead from Alameda County.\n We were inches apart from one another. Didn’t look like they made any changes to the line. On the line, we sometimes work on top of each other, touching the same equipment.\n They give us a mask and take our temps when we walk in. The bathrooms aren’t always clean and are small.\n  The worker who contacted  Electrek added, “Unions have been trying to get in for years with no luck.” He said that everybody knows that “Elon wouldn’t allow it.”  SF Weekly noted that Tesla is the only non-unionized workforce of any major [American] car company in the US.\n In March, another employee who also wanted to remain anonymous informed  Electrek about conditions at the plant when it was formally shut down.\n I arrived at work this morning. We are still running full production. Does not look like they cut down on the workforce. They give us a mask and take our temperature when we walk in. They are not practicing safe social distance.\n  The Tesla CEO sent a message to his workers on May 12, thanking them for returning to work after the factory was re-opened. He wrote:\n Just wanted to send you a note of appreciation for working hard to make Tesla successful. It is so cool seeing the factory come back to life and you are making it happen!\n An honest day’s work spent building products or providing services of use to others is extremely honorable. I have vastly more respect for someone who takes pride in doing a good job, whatever the profession, than some rich or famous person who does nothing useful.\n Some employees expressed support for Musk in return. They are part of the so-called Unmasking movement resisting the lockdown protocols. Those workers are sympathetic to the “back to work” sentiments expressed by Musk and Donald Trump. Some employees also “remove their masks in order to breathe after hours of physical labor,” according to  SF Weekly.\n Tesla continues to  call more employees back to work. Nonetheless, the company warns that employees who don’t come back to work might  lose unemployment benefits.\n A set of site-specific pandemic safety guidelines were created on May 12 via meetings between Alameda county and Tesla officials. The guidelines called for changes to the breakroom, temperature screenings, and having employees dispersed throughout the plant.\n  We are well-prepared to proceed safely and in alignment with all government precautions and the county’s requested safety measures.\n  However,  SF Weekly reports that workers say the measures outlined in the HR memo and Return to Work playbook are “not being implemented consistently on the Fremont factory floor, where plant management is still fumbling to establish safety guidelines on the fly.”\n  They’re trying to implement the changes while everyone’s working. It makes you wonder if your life is worth 20 bucks an hour.\n Employees said that that by last Thursday, a 20-minute grace period between shifts was shortened to 10 minutes. The number of employees involved in a shift change can number more than 1,000 people. Some shifts begin as early as 5 a.m.\n A 61-year-old assembly line employee named Art, who only shared his first name, said that he and his colleagues work “shoulder to shoulder,” with no room for 6 feet of distance.\n Fremont police have made a few brief appearances to verify whether social distancing measures are enforced. However, a spokesperson from the Fremont Police Department said, “We would simply not have the capacity to do [inspections] for every business in Fremont, as we have thousands.”\n Gabriel told  SF Weekly that he believes Musk has been looking at moving the factory from the Bay Area for months. He said the plant, which employs 10,000 people, is one of the last suppliers of blue-collar jobs in the area, but that Tesla management doesn’t see itself as part of the community. “We are disposable to [Tesla],” said Gabriel.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-05-23 13:34:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,担心,employees,员工", "title": "特斯拉员工担心工厂不安全的条件，称之为现代血汗工厂", "title_en": "Tesla employees fear unsafe conditions at factory, call it modern-day sweatshop", "transed": 1, "url": "https://electrek.co/2020/05/21/tesla-employees-fear-unsafe-conditions-at-factory-call-it-modern-day-sweatshop/", "via": "", "real_tags": ["特斯拉", "担心", "employees", "员工"]}, {"category": "", "categoryclass": "", "imagename": "59bdd091a7f6b8c680ad535954f28708.jpg", "infoid": 1003330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者Neil Savage Communications of the ACM，2020年6月，第63卷第6期，第15-16页10.1145/3392516评论机器视觉与人工智能(AI)相结合，在让计算机理解图像方面取得了长足的进步。多亏了深度学习，它以类似于人脑的方式处理信息，机器视觉正在做一切事情，从保持自动驾驶汽车在正确的轨道上行驶，到通过检查活组织切片或x光图像来改进癌症诊断。现在，一些研究人员正在超越人眼或相机镜头所能看到的范围，使用机器学习来观察墙另一边的人在做什么。\n这项技术依赖于低功率射频(RF)信号，这种信号反射活组织和金属，但很容易穿过木质或石膏内墙。人工智能可以破译这些信号，不仅可以检测人的存在，还可以看到他们是如何移动的，甚至可以预测他们从事的活动，从打电话到刷牙。有了射频信号，他们可以在黑暗中看到东西。麻省理工学院(MIT)计算机科学与人工智能实验室的博士生李天红(音译)说，他们可以透过墙壁或家具看到东西。他和他的研究生范丽杰(Lijie Fan)帮助开发了一种测量运动的系统，并由此识别具体的行动。我们的目标是了解人们在做什么，李说。\n这样的理解可以派上用场，例如监察辅助生活设施的年长居民，看看他们在执行日常生活任务方面是否有困难，或察觉他们是否跌倒。它还可以用来创建智能环境，在这些环境中，自动设备可以打开家里或办公室的灯或暖气。警察部队可能会使用这样的系统来监视疑似恐怖分子或武装抢劫犯的活动。\n数字。RF-POSE使用无线信号来监视墙另一边的人的活动。\n领导这项研究的麻省理工学院教授迪娜·卡塔比(Dina Katabi)表示，在生活环境中，通过射频信号通过墙壁监控活动的一个好处是，例如，它们无法分辨人脸或看到一个人的穿着，所以比起在家里布满摄像头，它们可以提供更多的隐私感。另一个原因是，它不要求人们佩戴他们可能会忘记或不舒服的监控设备；他们只需像往常一样在家里走动即可。\n麻省理工学院系统使用的无线电发射机工作在5.4 GHz到7.2 GHz之间，功率水平比Wi-Fi信号低1000倍，因此应该不会造成干扰。由于我们身体的所有水分含量，射频发射会强烈地反弹到人身上，但它们也会不同程度地反弹到环境中的其他物体上，这取决于物体的组成。卡塔比说，你会得到大量的反射，信号从所有东西上反弹。\n因此，第一步是教计算机识别哪些信号是来自人的。研究小组通过记录可见光和射频信号中的场景，并使用视觉图像来标记卷积神经网络(CNN)训练数据中的人类，卷积神经网络是一种深度学习算法，为图像的不同方面分配权重。信号还包含空间信息，因为信号传输更远的距离需要更长的时间。Katabi说，CNN可以捕捉到这些信息，并利用它将同一附近的两个或更多人分开，尽管如果这些人非常接近或拥抱，这可能会导致错误。\n研究人员还希望根据人们的行动方式来确定他们正在采取的行动。为了做到这一点，该系统采取了中间步骤，将来自人的信号渲染成骨骼，这是人体的简化版本，将它们简化为基本上由头部和四肢组成的棍状图形。根据线条在条形图中的相对位置，计算机可以识别各种动作-坐下、弯腰拿起东西、挥手、喝酒、打电话等等。\n该团队建立在之前使用人工智能从视频图像派生动作的工作基础上。然而，现有的动作检测数据集都不包括射频信息，因此团队必须创建自己的数据集。他们找到了30名志愿者，将他们放在10个不同的环境中-例如办公室、走廊和教室-并要求他们从35种可能性中随机执行行动。这产生了25小时的数据来训练和测试他们的计算机模型。\n为了提供更多数据，他们从没有任何相关RF信号的视频中提取骨架。李说，这些骨架与从射频信号中提取的骨架略有不同，所以他们必须做出一些调整。然而，这种方法允许研究人员纳入其他信息，例如名为PKU-MMD的数据集，该数据集包含来自51个类别的近2万个动作，由66个人执行。\n卡塔比并不是唯一一个使用射频透视墙壁的研究人员。密苏里州圣路易斯市华盛顿大学(Washington University)的计算机科学与工程教授尼尔·帕特瓦里(Neal Patwari)多年来一直在研究射频传感，尽管他在2009年的工作并不涉及机器学习。他的基本系统同时使用无线电发射机和接收机。附近的物体会改变接收器接收到的信号的强度。直接穿过这两条线的人会强烈地阻挡信号，附近的人会阻挡得稍微少一些，而当一个人在很远的地方时，一个散布在他们身体上的信号会稍微改变接收到的信号。\n帕特瓦里使用机器学习来教导计算机特定的信号混合与特定的动作相匹配。例如，厨房的一组特定尺寸可能意味着有人在做饭。你可以有一个算法来学习与烹饪相对应的特征是什么。他说：然后我就可以知道，对于独居在家的人来说，他们在这一天的这个时候正在做饭，并确保他们没有太多偏离正常的日程安排。这样的系统可能有助于监测处于痴呆症早期阶段的人，或者处于已知的抑郁症风险中的人。\n帕特瓦里说，但有一个问题是，测量结果可能会随着环境的变化而改变。例如，如果一个人刚刚去杂货店购物，打开装满食物的冰箱可能会产生一组射频信号。几天后，当冰箱里有更多的空空间时，信号可能会看起来不同。训练数据会在一段时间后变得陈旧。\n例如，Patwari目前正在开发一种系统，该系统使用射频信号通过精神病院的墙壁监测患者的呼吸。许多精神病院有一项政策，晚上每隔15分钟进一次病人的房间，以确保他们睡得正常，不会试图伤害自己。当然，这样的检查可能会唤醒患者，干扰他们获得所需的睡眠。射频系统可以检测到患者胸部的运动，并能看到他们是否正常睡眠。因为它能透过墙壁，所有的设备和电线都在房间外面，所以病人不能损坏它们或用它们伤害他/她自己。\n伦敦大学学院(University College London)安全与犯罪科学系教授凯文·切蒂(Kevin Chetty)表示，可以通过将射频信号用作一种多普勒雷达来检测呼吸，观察信号在反射来回移动的东西时如何变化。他的重点是利用机器学习来理解他所说的被动Wi-Fi，利用环境中已经存在的射频信号，可能包括5G手机使用的信号。射频场中的任何运动都会产生多普勒信号。切蒂说，这是一个复杂的融合，有向前和向后，向左和向右，不同角度的不同多普勒分量。你可以得到与不同类型的运动相关联的微多普勒信号。\n依靠环境中已经存在的射频信号意味着不需要像Patwari这样的系统所要求的那种类型的校准。另一方面，它不得不凑合使用任何存在的信号，而不是依赖于像卡塔比那样的可预测信号。\n为了训练他的动作识别系统，切蒂让志愿者穿着点缀着LED的西装，这个系统类似于创建虚拟现实场景时使用的系统。随着人的移动，切蒂和他的团队收集摄像机记录的视觉数据和射频信号。视觉数据为训练系统基于微多普勒特征识别动作提供了基础事实。它可能是一组复杂的测量数据，需要破译。例如，根据观察的角度不同，同一动作的多普勒信号可能会有所不同。\n一些射频传感技术已经在使用中。例如，帕特瓦里以前的学生成立了一家名为Xandem的公司，销售使用射频探测人类存在和运动的传感器。使用机器学习来识别医疗保健或智能环境中使用的操作的系统仍需要进一步开发。切蒂说：我们还没有到那一步，但我们正在努力。\n李涛，范林，赵明，刘勇，卡塔比，D让看不见的：通过墙壁和封闭的行动识别，2019年，arxiv.org/abs/1909.09300。\nAl-Husseiny，A.，Patwari，N.无设备本地化信号强度模型的无监督学习，2019IEEE第20届无线、移动和多媒体网络世界国际研讨会，DOI：10.1109/WoWMoM.2019.8792970。\n李伟，Piechocki R，Woodbridge K，Chetty K WiFi传感，体力活动，修正的交叉模糊函数，独立WiFi设备，2019年，IEEE全球通信会议，https://discovery.ucl.ac.uk/id/eprint/10084427/。\n王霞，王霞，毛，S。物联网中的射频传感：一个通用的深度学习框架，2018年，IEEE通信杂志，DOI 10.1109/MCOM.2018.1701277。\n允许将本作品的部分或全部数字或硬拷贝用于个人或课堂使用，但不得以盈利或商业利益为目的制作或分发拷贝，并且拷贝的首页必须注明本通知和完整的引文。必须尊重ACM以外的其他人拥有的本作品组件的版权。允许赊账提款。要以其他方式复制、重新发布、在服务器上发布或重新分发到列表，需要事先获得特定许可和/或收取费用。通过Permission@acm.org或传真(212)869-0481请求发布许可。\n数字图书馆由计算机械协会出版。版权所有©2020 ACM，Inc.", "note_en": "By Neil Savage Communications of the ACM,June 2020,Vol. 63 No. 6, Pages 15-16 10.1145/3392516  Comments      Machine vision coupled with artificial intelligence (AI) has made great strides toward letting computers understand images. Thanks to deep learning, which processes information in a way analogous to the human brain, machine vision is doing everything from keeping self-driving cars on the right track to improving cancer diagnosis by examining biopsy slides or x-ray images. Now some researchers are going beyond what the human eye or a camera lens can see, using machine learning to watch what people are doing on the other side of a wall.\n The technique relies on low-power radio frequency (RF) signals, which reflect off living tissue and metal but pass easily through wooden or plaster interior walls. AI can decipher those signals, not only to detect the presence of people, but also to see how they are moving, and even to predict the activity they are engaged in, from talking on a phone to brushing their teeth. With RF signals, &#34;they can see in the dark. They can see through walls or furniture,&#34; says Tianhong Li, a Ph.D. student in the Computer Science and Artificial Intelligence Laboratory at the Massachusetts Institute of Technology (MIT). He and fellow graduate student Lijie Fan helped develop a system to measure movement and, from that, to identify specific actions. &#34;Our goal is to understand what people are doing,&#34; Li says.\n Such an understanding could come in handy for, say, monitoring elderly residents of assisted living facilities to see if they are having difficulty performing the tasks of daily living, or to detect if they have fallen. It could also be used to create &#34;smart environments,&#34; in which automated devices turn on lights or heat in a home or an office. A police force might use such a system to monitor the activity of a suspected terrorist or an armed robber.\n Figure. RF-Pose uses wireless signals to monitor people&#39;s movements on the other side of a wall.\n In living situations, one advantage of monitoring activity through walls with RF signals is that they are unable to resolve faces or see what a person is wearing, for instance, so they could afford more of a sense of privacy than studding the home with cameras, says Dina Katabi, the MIT professor leading the research. Another is that it does not require people to wear monitoring devices they might forget or be uncomfortable with; they just move through their homes as they normally would.\n The MIT system uses a radio transmitter operating at between 5.4 GHz and 7.2GHz, at power levels 1,000 times lower than a Wi-Fi signal, so it should not cause interference. The RF transmissions bounce strongly off people because of all the water content of our bodies, but they also bounce off other objects in the environment to varying degrees, depending on the composition of the object. &#34;You get this mass of reflections, signals bouncing off everything,&#34; Katabi says.\n So the first step is to teach the computer to identify which signals are coming from people. The team does this by recording a scene in both visible light and RF signals, and using the visual image to label the humans in the training data for a convolutional neural network (CNN), a type of deep learning algorithm that assigns weights to different aspects of an image. The signals also contain spatial information, because it takes a longer time for a signal to travel a longer distance. The CNN can capture that information and use it to separate two or more people in the same vicinity, although it can lead to errors if the people are very close or hugging, Katabi says.\n    The researchers also want to identify the actions people are taking based on how they move. To do that, the system takes the intermediate step of rendering the signals from the people into skeletons, simplified versions of human bodies that reduce them to essentially stick figures consisting of a head and limbs. Based on the relative positions of the lines in the stick figures, the computer can identify various actions—sitting down, bending to pick something up, waving, drinking, talking on the phone, and so on.\n The team built on previous work done using AI to derive actions from video images. None of the existing action detection datasets, however, included RF information, so the team had to create its own. They found 30 volunteers, put them in 10 different environments—offices, hallways, and classrooms, for example—and asked them to randomly perform actions from a list of 35 possibilities. That produced 25 hours of data to train and test their computer model.\n To provide more data, they derived skeletons from video that did not have any associated RF signals. Li says those skeletons were slightly different from those derived from the RF signals, so they had to make some adjustments. This approach, however, allowed the researchers to incorporate other information, such as a dataset called PKU-MMD, which contains nearly 20,000 actions from 51 categories performed by 66 people.\n    Katabi is not the only researcher using RF to see through walls. Neal Patwari, a professor of computer science and engineering at Washington University in St. Louis, MO, has been working on RF sensing for years, although his work back in 2009 did not involve machine learning. His basic system uses both a radio transmitter and receiver. Bodies in the vicinity alter the strength of the signal being picked up by the receiver. A person directly crossing a line between the two blocks the signal strongly, someone nearby blocks it somewhat less, and when a person is far away, a signal scattering off their body changes the received signal a bit.\n Patwari uses machine learning to teach the computer what particular blend of signals goes with a specific action. For instance, a particular set of measurements from the kitchen might mean someone was cooking. &#34;You could have an algorithm that learned what the features are that correspond to cooking. And then I could know, for somebody living home alone, that they&#39;re cooking at this time on this day and make sure that they&#39;re not veering from their regular schedule too much,&#34; he says. Such a system could be useful to monitor a person in the early stages of dementia, or who was at known risk for depression.\n One issue, though, is that the measurements could change with changes in the environment, Patwari says. For instance, if a person had just done the grocery shopping, opening a refrigerator full of food might generate one set of RF signals. A few days later, when there was more empty space in the refrigerator, the signals could look different. The training data goes stale after a while.\n Patwari currently is developing a system that uses RF signals to monitor a patient&#39;s breathing through the walls of a psychiatric hospital, for instance. Many psychiatric hospitals have a policy to go into a patient&#39;s room every 15 minutes at night to make sure they are sleeping normally and not trying to harm themselves. Such checks, of course, can wake the patients and interfere with them getting the sleep they need. An RF system can detect the movement of a patient&#39;s chest and see that they are sleeping normally. Because it sees through walls, all the equipment and wires are outside the room, so the patient cannot damage them or use them to harm him/herself.\n    Respiration can be detected by using RF signals as a sort of Doppler radar, seeing how the signal changes as it reflects off something moving back and forth, says Kevin Chetty, a professor in the department of security and crime science at University College London. His focus is on using machine learning to make sense of what he calls passive Wi-Fi, taking advantage of RF signals already in the environment including, potentially, the signals used by 5G cellphones. Any sort of movement in an RF field produces Doppler signals. &#34;There&#39;s a complex amalgamation of forward and back, left and right, different angles to different Doppler components,&#34; Chetty says. &#34;You get micro-Doppler signatures associated with different types of motion.&#34;\n Relying on RF signals already in the environment means there is no need for the type of calibration that a system like Patwari&#39;s requires. On the other hand, it has to make do with whatever signals exist, instead of relying on a predictable signal like Katabi&#39;s.\n To train his action recognition system, Chetty has volunteers wear suits studded with LEDs, a system similar to that used in creating virtual reality scenarios. As the person moves, Chetty and his team collect both visual data recorded by cameras, and RF signals. The visual data provides ground truth for training the system to recognize actions based on the micro-Doppler signatures. It can be a complex set of measurements to decipher. For instance, the Doppler signal for the same action can look different depending on the angle from which it&#39;s viewed.\n Some RF sensing technology is already in use. Former students of Patwari&#39;s, for instance, formed a company called Xandem that sells sensors that use RF to detect human presence and motion. Systems using machine learning to identify actions, for use in healthcare or smart environments, still require further development. &#34;We&#39;re not there yet, but we&#39;re working on it,&#34; Chetty says.\n  Li, T., Fan, L., Zhao, M., Liu, Y., Katabi, D  Making the Invisible Visible: Action Recognition Through Walls and Occlusions, 2019,  arxiv.org/abs/1909.09300\n Al-Husseiny, A., Patwari, N.  Unsupervised Learning of Signal Strength Models for Device-Free Localization, 2019 IEEE 20th International Symposium on &#34;A World of Wireless, Mobile and Multimedia Networks&#34; DOI: 10.1109/WoWMoM.2019.8792970\n Li W, Piechocki R, Woodbridge K, Chetty K  WiFi Sensing, Physical Activity, Modified Cross Ambiguity Function, Stand-Alone WiFi Device, 2019, IEEE Global Communications Conference,  https://discovery.ucl.ac.uk/id/eprint/10084427/\n Wang, X, Wang, X., Mao, S.  RF Sensing in the Internet of Things: A General Deep Learning Framework, 2018, IEEE Communications Magazine, DOI 10.1109/MCOM.2018.1701277\n      Permission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and full citation on the first page. Copyright for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, to republish, to post on servers, or to redistribute to lists, requires prior specific permission and/or fee. Request permission to publish from  permissions@acm.org or fax (212) 869-0481.\n The Digital Library is published by the Association for Computing Machinery. Copyright © 2020 ACM, Inc.", "posttime": "2020-05-23 13:33:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "透过,walls,信号", "title": "透过墙壁看得见", "title_en": "Seeing Through Walls", "transed": 1, "url": "https://cacm.acm.org/magazines/2020/6/245152-seeing-through-walls/fulltext", "via": "", "real_tags": ["透过", "walls", "信号"]}, {"category": "", "categoryclass": "", "imagename": "aec7ea5e867cad0825ee78633d622d34.jpg", "infoid": 1003328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四和周五，美国国家航空航天局(NASA)、太空探索技术公司(SpaceX)和航天局的国际合作伙伴的高级管理人员举行了长时间的会议，审查猎鹰9号火箭和机组人员龙飞船即将进行的所有方面的飞行。\n这些讨论肯定进行得很顺利，因为周五下午，NASA官员发出了一个明确的信息：没有重大问题，NASA副局长史蒂夫·尤尔奇克(Steve Jurczyk)说，他在肯尼迪航天中心主持了闭门会议。归根结底，这是一次非常干净的回顾。“我们已经准备好推出了。&#34；\n搭载道格·赫尔利(Doug Hurley)和鲍勃·本肯(Bob Behnken)前往国际空间站的机组人员龙(Dragon)飞船定于5月27日(星期三)美国东部时间下午4点33分(世界标准时间20点33分)开始飞行。这将是自2011年7月航天飞机进行最后一次飞行以来，首次从美国进行人类轨道发射。NASA付钱给SpaceX公司开发这一运输系统，并将作为其主要客户。这一商业安排为NASA节省了数十亿美元。\n在周五的新闻发布会上，官员们赞扬了SpaceX和NASA工程师为公司准备飞行所做的辛勤工作。值得注意的是，自从一艘“乘员龙”飞船在试射“超龙”推进器时被摧毁以来，仅仅过去了一年多一点的时间。\n从那时起，SpaceX不仅解决了这个问题的根本原因，而且还监督了飞行器降落伞系统的彻底重新设计。为了达到这一点，该公司解决了数十个其他重要问题。\n美国国家航空航天局(NASA)商业机组项目经理凯西·路德斯(Kathy Lueders)承认，这一过程一直是旋风式的。去年4月，我可能没想到我会在一年内飞起来，但你知道吗--你永远不能低估NASA和SpaceX的团队，她说。他们总是为我创造奇迹。我为他们感到非常、非常自豪。\n在下周三的飞行前仍有工作要做。SpaceX公司将在周五下午对猎鹰9号火箭进行静态射击测试，周六机组人员将进行一次彩排，赫尔利和本肯将为发射日做好准备，周一将举行发射准备审查会议。但最大的担忧可能是天气；猎鹰9号发射和紧急中止情况下的范围有多种限制。根据中期天气模式，佛罗里达州下周可能会有一些分散到大范围的阵雨。\n然而，NASA和SpaceX非常接近。尤尔奇克周五表示，很难相信我们距离启动这项载人任务只有5天了，我们必须达成一致。我们不能等了。", "note_en": "On Thursday and Friday, senior managers from NASA, SpaceX, and the space agency&#39;s international partners held long meetings to review all of the aspects of an upcoming flight of the Falcon 9 rocket and Crew Dragon spacecraft.\n These discussions must have gone well, because on Friday afternoon, NASA officials emerged with a clear message: &#34;There are no significant issues,&#34; said NASA Associate Administrator Steve Jurczyk, who led the meetings behind closed doors at Kennedy Space Center. &#34;In the end, it was a very clean review. We are ready to launch.&#34;\n  The flight of the Crew Dragon spacecraft, carrying Doug Hurley and Bob Behnken to the International Space Station, is set to begin at 4:33pm ET (20:33 UTC) on Wednesday, May 27. It will be the first orbital launch of humans from the United States since July 2011, when the space shuttle made its final flight. NASA paid SpaceX to develop this transportation system and will serve as its primary customer. This commercial arrangement  has saved NASA billions of dollars.\n Throughout a news conference on Friday, officials praised the hard work that SpaceX and NASA engineers have conducted to reach the point where the company is ready to fly. It&#39;s notable that only a little more than a year has passed since a Crew Dragon spacecraft  was destroyed during a test-firing of its SuperDraco thrusters.\n Since that time, SpaceX has addressed not only the root cause of that problem but has also overseen a complete redesign of the vehicle&#39;s parachute system. The company closed out dozens of other significant issues to reach this point.\n NASA&#39;s manager of the Commercial Crew Program, Kathy Lueders, acknowledged that the process has been a whirlwind. &#34;Last April, I probably wasn&#39;t thinking I was going to be flying in a year, but you know what—you can never sell this NASA and SpaceX team short,&#34; she said. &#34;They&#39;ve always accomplished miracles for me. And I&#39;m very, very proud of them.&#34;\n  Work remains to be done before next Wednesday&#39;s flight. SpaceX will conduct a static-fire test of its Falcon 9 rocket on Friday afternoon, on Saturday the crew will conduct a &#34;dry&#34; dress rehearsal in which Hurley and Behnken suit up for launch day, and there will be a Launch Readiness Review meeting on Monday. But the biggest concern is probably weather; there are multiple constraints for the Falcon 9 launch and emergency abort scenarios down range. Florida may see some scattered to widespread showers next week, according to medium-range weather models.\n Yet NASA and SpaceX are very close. Jurczyk said Friday it &#34;is hard to believe&#34; we are just five days from launching this crewed mission, and we have to agree. We can&#39;t wait.", "posttime": "2020-05-23 13:33:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,飞行,declares", "title": "美国国家航空航天局宣布，SpaceX公司已经准备好进行首次载人飞行任务", "title_en": "NASA declares that SpaceX is ready to fly its first crewed mission", "transed": 1, "url": "https://arstechnica.com/science/2020/05/nasa-declares-that-spacex-is-ready-to-fly-its-first-crewed-mission/", "via": "", "real_tags": ["nasa", "飞行", "declares"]}, {"category": "", "categoryclass": "", "imagename": "4a282630da4f93ec66c6098222617735.jpg", "infoid": 1003326, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉首席执行官埃隆·马斯克(Elon Musk)和其他硅谷大牌高管长期以来一直承诺，一款无需人工帮助就能完成所有驾驶任务的汽车。\n但马里兰大学计算机科学家本·施奈德曼(Ben Shneiderman)几十年来一直警告不要盲目地用计算机自动执行任务，他认为全自动汽车和科技行业对机器人未来的愿景是被误导的。甚至很危险。他认为，机器人应该与人类合作，而不是取代人类。\n去年年底，施奈德曼博士发起了一场十字军东征，目的是让人工智能世界相信，它正朝着错误的方向前进。今年2月，他质问了在凤凰城举行的一个名为“Assured Autonomy”的行业会议的组织者，告诉他们，就连会议的标题都是错误的。他说，设计师不应该试图创造自主机器人，而应该专注于一条新的口号，设计“可靠、安全和值得信赖”的计算机化机器。\n施奈德曼博士认为，应该为每个机器人配备相当于飞行数据记录器的设备。\n当世界经济最终从冠状病毒大流行的破坏中走出来，数百万失去工作的人试图重返工作岗位时，这一警告可能会变得更加紧迫。他们中越来越多的人会发现他们正在与机器竞争或并肩工作。\n现年72岁的施奈德曼博士几十年前就开始传播他的信息。作为人机交互领域的先驱，他于1982年与他人共同创立了现在的计算系统中人的因素会议，并创造了“直接操纵”一词，以描述物体在计算机屏幕上用鼠标或最近用手指移动的方式。\n1997年，施奈德曼博士与麻省理工学院媒体实验室(Massachusetts Institute of Technology‘s Media Lab)的计算机科学家帕蒂·梅斯(Pattie Maes)进行了一场颇具先见之明的辩论，讨论当时流行的智能软件代理的概念，这种想法旨在为计算机用户执行自主任务--从重新订购食品杂货到预订餐厅，无所不包。\n“设计师相信他们正在创造一些逼真和智能的东西-然而，用户感到焦虑，无法控制这些系统，”他辩称。\n自那以后，施奈德曼博士一直辩称，设计者不仅面临创造不安全机器的风险，还有可能免除人类对从汽车到武器的自动系统所采取行动的道德责任。\n人与计算机控制之间的冲突至少与交互计算本身一样古老。\n这一区别最早出现在斯坦福大学附近于1962年创建的两个计算机科学实验室。计算机科学家约翰·麦卡锡(John McCarthy)创造了“人工智能”一词，他建立了斯坦福人工智能实验室，目标是在十年内创造一台“思维机器”。发明了电脑鼠标的道格拉斯·恩格尔巴特(Douglas Engelbart)在斯坦福研究中心(Stanford Research Center)创建了增强研究中心，并创造了“智能增强”这个术语，或称I.A.。\n近年来，计算机界和学术界的研究人员试图将这两个领域重新结合起来，将由此产生的学科描述为“以人为本”或“以人为中心”的人工智能。\n施奈德曼博士向工程界提出挑战，要求他们重新思考如何实现基于人工智能的自动化。到目前为止，机器自主性一直被描述为一维尺度，范围从人工控制的机器到无人干预运行的系统。\n这些一维模型中最著名的是由汽车工程师协会建立的一套与自动驾驶车辆相关的定义。它描述了六个级别的车辆自动驾驶，从需要完全人工控制的0级到完全驾驶自动化的5级。\n相比之下，施奈德曼博士勾勒出了一种二维替代方案，既可以实现高度的机器自动化，也可以实现人工控制。除了某些例外，如汽车安全气囊和核电站控制棒，他断言计算设计者的目标应该是使用计算来扩展人类用户能力的系统。\n这种方法已经被机器人专家和五角大楼官员推广。丰田研究所所长吉尔·普拉特(Gill Pratt)是让人类“知情”的长期倡导者。他的研究所一直致力于开发Guardian，研究人员将其描述为“超高级驾驶员辅助系统”。\n“自动化可以帮助人们做很多事情，而不是取代他们，”普拉特博士说。他不仅将实验室的重点放在汽车安全上，还将重点放在开发机器人技术以支持年长司机这一挑战上。\n同样，曾在特朗普和贝拉克·奥巴马政府担任国防部副部长的罗伯特·O·沃克(Robert O.Work)支持所谓的半人马武器系统的想法，该系统需要人类控制，而不是基于人工智能的机器人杀手，后者现在被称为致命的自动武器。\n“半人马”一词最初是在国际象棋领域流行起来的，在国际象棋领域，人类和计算机程序的伙伴关系不断地击败没有辅助的软件。\n在今年的凤凰城自动驾驶系统会议上，施奈德曼博士说，波音的MCAS飞行控制系统是高度自动化和低人工控制的极端例子。在两架波音737 Max喷气式飞机坠毁后，该系统被指责为波音公司的MCAS飞行控制系统。\n他在一篇广为流传的未发表文章中写道：“设计师们相信他们的自主系统不会失败。”因此，它的存在没有在用户手册中描述，飞行员也没有接受如何切换到手动超控的培训。\n施奈德曼博士在接受采访时说，他参加这次会议的目的是说服组织者将会议名称从关注自主改为关注人类控制。\n“我逐渐意识到名字和比喻非常重要，”他说。\n他还列举了空军、美国国家航空航天局(National Aeronautics And Space Administration)和国防科学委员会(Defense Science Board)放弃对自动系统的依赖的例子。国防科学委员会是一个为国防部提供科学技术建议的民间专家委员会。\n德克萨斯农工大学的计算机科学家和机器人专家罗宾·墨菲(Robin Murphy)说，她已经和施奈德曼博士谈过，并大体上同意他的观点。\n“我认为有一些不完美的地方，我已经和本谈过这件事，但我不知道更好的了，”她说。“我们必须想办法更好地表现人类和计算机是如何互动的。”\n杜克大学(Duke University)人类与自主实验室主任米西·卡明斯(Missy Cummings)说，“本认为他的二维模型是一个全新的视角，这是不正确的。”她说，她在设计课程中依赖于他的人机界面想法。\n“协作的程度应该由系统中的不确定性和结果的临界性来驱动，”她说。“核反应堆高度自动化是有原因的：如果反应堆变得关键，人类通常没有足够快的反应时间来推动棒的进入。”", "note_en": "The Tesla chief Elon Musk and other big-name Silicon Valley executives have long promised a car that can do all the  driving without human assistance.\n But Ben Shneiderman, a University of Maryland computer scientist who has for decades warned against blindly automating tasks with computers, thinks fully automated cars and the tech industry’s vision for a robotic future is misguided.  Even dangerous. Robots should collaborate with humans, he believes, rather than replace them.\n Late last year, Dr. Shneiderman embarked on a crusade to convince the artificial intelligence world that it is heading in the wrong direction. In February, he confronted organizers of an industry conference on “Assured Autonomy” in Phoenix, telling them that even the title of their conference was wrong. Instead of trying to create autonomous robots, he said, designers should focus on a new mantra, designing computerized machines that are  “reliable, safe and trustworthy.”\n There should be the equivalent of a flight data recorder for every robot, Dr. Shneiderman argued.\n It is a warning that’s likely to gain more urgency when the world’s economies eventually emerge from the devastation of the coronavirus pandemic and millions who have lost their jobs try to return to work. A growing number of them will find they are competing with or  working side by side with machines.\n  Dr. Shneiderman, 72, began spreading his message decades ago. A pioneer in the field human-computer interaction, he co-founded in 1982 what is now the Conference on Human Factors in Computing Systems and coined the term “direct manipulation” to describe the way objects are moved on a computer screen either with a mouse or, more recently, with a finger.\n In 1997, Dr. Shneiderman engaged in a prescient debate with Pattie Maes, a computer scientist at the Massachusetts Institute of Technology’s Media Lab, over the then-fashionable idea of intelligent software agents designed to perform autonomous tasks for computer users — anything from reordering groceries to making a restaurant reservation.\n  “Designers believe they are creating something lifelike and smart — however, users feel anxious and unable to control these systems,” he argued.\n Since then, Dr. Shneiderman has argued that designers run the risk not just of creating unsafe machines but of  absolving humans of ethical responsibility of the actions taken by autonomous systems, ranging from cars to weapons.\n The conflict between human and computer control is at least as old as interactive computing itself.\n The distinction first appeared in two computer science laboratories that were created in 1962 near Stanford University. John McCarthy, a computer scientist who had coined the term “artificial intelligence,” established the Stanford Artificial Intelligence Laboratory with the goal of creating a “thinking machine” in a decade. And  Douglas Engelbart, who invented the computer mouse, created the Augmentation Research Center at the Stanford Research Center and coined the term “intelligence augmentation,” or I.A.\n In recent years, the computer industry and academic researchers have tried to bring the two fields back together, describing the resulting discipline as “humanistic” or “human-centered” artificial intelligence.\n Dr. Shneiderman has challenged the engineering community to rethink the way it approaches artificial intelligence-based automation. Until now, machine autonomy has been described as a one-dimensional scale ranging from machines that are manually controlled to systems that run without human intervention.\n The best known of these one-dimensional models is a set of definitions related to self-driving vehicles established by the Society of Automotive Engineers. It describes six levels of vehicle autonomy ranging from Level 0, requiring complete human control, to Level 5, which is full driving automation.\n  In contrast, Dr. Shneiderman has sketched out a two-dimensional alternative that allows for both high levels of machine automation and human control. With certain exceptions such as automobile airbags and nuclear power plant control rods, he asserts that the goal of computing designers should be systems in which computing is used to extend the abilities of human users.\n  This approach has already been popularized by both roboticists and Pentagon officials. Gill Pratt, the head of the  Toyota Research Institute, is a longtime advocate of keeping humans “in the loop.” His institute has been working to develop Guardian, a system that the researchers have described as “super advanced driver assistance.”\n “There is so much that automation can do to help people that is not about replacing them,” Dr. Pratt said. He has focused the laboratory not just on car safety but also on the challenge of developing robotic technology designed to support older drivers as well.\n Similarly, Robert O. Work, a deputy secretary of defense under Presidents Trump and Barack Obama, backed the idea of  so-called centaur weapons systems, which would require human control, instead of A.I.-based robot killers, now called lethal autonomous weapons.\n  The term “centaur” was originally popularized in the chess world, where partnerships of humans and computer programs consistently defeated unassisted software.\n At the Phoenix conference on autonomous systems this year, Dr. Shneiderman said Boeing’s MCAS flight-control system, which was blamed after two 737 Max jets crashed, was an extreme example of high automation and low human control.\n “The designers believed that their autonomous system could not fail,” he wrote in an unpublished article that has been widely circulated. “Therefore, its existence was not described in the user manual and the pilots were not trained in how to switch to manual override.”\n Dr. Shneiderman said in an interview that he had attended the conference with the intent of persuading the organizers to change its name from a focus on autonomy to a focus on human control.\n “I’ve come to see that names and metaphors are very important,” he said.\n He also cited examples where the Air Force, the National Aeronautics and Space Administration, and the Defense Science Board, a committee of civilian experts that advises the Defense Department on science and technology, had backed away from a reliance on autonomous systems.\n Robin Murphy, a computer scientist and robotics specialist at Texas A&amp;M University, said she had spoken to Dr. Shneiderman and broadly agreed with his argument.\n “I think there’s some imperfections, and I have talked to Ben about this, but I don’t know anything better,” she said. “We’ve got to think of ways to better represent how humans and computers are engaged together.”\n “Ben’s notion that his two-dimensional model is a fresh perspective simply is not true,” said Missy Cummings, director of Duke University’s Humans and Autonomy Laboratory, who said she relied on his human-interface ideas in her design classes.\n “The degree of collaboration should be driven by the amount of uncertainty in the system and the criticality of outcomes,” she said. “Nuclear reactors are highly automated for a reason: Humans often do not have fast enough reaction times to push the rods in if the reactor goes critical.”", "posttime": "2020-05-23 13:32:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,fully,人类", "title": "对全自动机器人的追求是误入歧途的，甚至可能是危险的。", "title_en": "The quest for fully automated robots is misguided, perhaps even dangerous", "transed": 1, "url": "https://www.nytimes.com/2020/05/21/technology/ben-shneiderman-automation-humans.html", "via": "", "real_tags": ["机器人", "fully", "人类"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "广告拦截器肯定不会阻止与你想要打开的内容完全集成的广告，但当这种情况发生时，这意味着内容的作者知道他们在做什么广告，而不仅仅是让横幅广告自动贴在他们的页面上。不管怎样，弄清楚你是否可以信任你打开的网页的作者是你必须要做的事情。这是我们推荐的，因为它非常强大，而且它还包含一些工具，用于处理试图阻止广告拦截程序工作的网站。它也很容易安装，因为它只是一个浏览器插件。\n由于uBlock Origin在当前版本的Safari中不起作用，我推荐使用这个版本。您可以将其安装在Mac、iPhone或iPad上。\n如果你有很多电脑，这台是最好的选择。你在你的网络上安装pi-hole，重新配置你的调制解调器或路由器，你家里或小办公室里的每一台计算机的广告都会被屏蔽。\nGoogle Chrome附带一个列表，阻止发现不符合更好的广告标准的广告。虽然我赞赏任何试图惩罚掩盖内容或播放声音的广告，但这似乎对欺诈或恶意软件广告没有太大帮助。谷歌已经试图执行广告标准；他们运营着互联网上最大的广告网络，当他们抽出时间删除不良广告时，广告已经造成了破坏，不良演员已经转移到了另一家廉价而易燃的空壳公司。他们的广告拦截软件不会影响这一切。真正的广告拦截器，如uBlock Origin、1Blocker或PiHole，可以拦截整个广告网络。一个接一个地阻止所有不良广告是一项不可能完成的任务，但阻止所有主要的广告网络是很容易的，因为它们并不是很多。不是的。他们屏蔽的是跨站跟踪，这很棒，但实际上与不良广告没有任何关系。隐私是支持广告屏蔽的常见论点，他们是对的：广告网络经常公然侵犯网络访问者的隐私。但是，即使主要的广告网络完全放弃了行为跟踪，即使按照广告标准，这也不能解决它们有多垃圾。其中一个更臭名昭著的电视广告-重复的“迎面：直接涂在额头上”广告-是为了回应一项要求他们停止伪装成药物的命令。电视和平面广告受到广泛的、实际上是强制执行的监管。谷歌、Facebook、Twitter、亚马逊和微软销售的广告不太像那些，而更像是声称来自你的银行的电话，而没有实际说明那是什么银行的电话。或垃圾邮件文件夹的内容。为了你自己的健康和安全，你必须忽略它们。在这一点上，几乎没有理由下载它们。1.我们推荐的程序支持自定义黑名单，而且没有规定你程序的黑名单必须是广告列表，所以称它们为广告拦截器有点低估了像这样的软件的力量。但这篇文章是关于屏蔽广告是一件好事，所以现在让我们坚持这一点。\n2.网页脚本是附加在网页上的一组指令，告诉您的计算机在网页加载后执行操作。脚本可以包含的指令类型是有意限制的-例如，Web脚本在没有事先询问您的情况下不能运行您的打印机-但它们可以做的一件事是让您的计算机执行一些数学运算，然后将结果发送回它从其获得脚本的网站。加密货币挖掘的设计假设是，对于任何打算通过这种方式赚钱的人来说，进行数学运算都需要花费大量资金，但通过在广告上附加一个网络脚本，然后在随机网络访问者的电脑上进行数学运算可能会更便宜。\n广告网络还收集个人读者的兴趣清单，所以他们实际上是在匹配三人组，而不是情侣。但无论哪种方式，这个类比仍然是有用的。\nShouldIBlockAds.com是由“notriddle”Howell撰写的。如果您发现错误，请在问题报告页面中让我知道。", "note_en": "Ad blockers will definitely not block advertisements  that are completely integrated with the content that you wanted to open, but when that sort of thing happens, it means that the author of the content knew about what they were advertising, instead of just having a banner ad automatically stuck to their page. Figuring out if you can trust the author of the web page that you opened is something you had to do anyway.  This is the one we recommend, because it’s very powerful, and it includes tools for dealing with web sites that try to prevent ad blockers from working. It’s also easy to install, since it’s just a browser add-on.\n Since uBlock Origin doesn’t work in the current version of Safari, I recommend this one instead. You can install it on a Mac, iPhone, or iPad.\n This one is the best option if you have lots of computers. You install pi-hole on your network, reconfigure your modem or router, and every computer in your home or small office will have its ads blocked.\n  Google Chrome ships with a list that blocks ads  that are discovered to not meet the Better Ads Standards. While I applaud any attempt to penalize ads that cover up content or play sound, this doesn’t seem to have done much about fraud or malware ads. Google already tries to enforce ad standards; they run the biggest ad network on the internet, and by the time they get around to removing bad ads, the ad has already done damage and the bad actors have already moved onto another cheap and burnable shell company. Their ad blocker doesn’t affect any of this. A real ad blocker, like uBlock Origin, 1Blocker, or PiHole, blocks the entire ad network. Blocking all of the bad advertisements one by one is an impossible task, but blocking all of the major ad networks is easy, because there aren’t very many of them.  No. What they block is cross-site tracking,  which is awesome, but doesn’t actually have anything to do with bad advertisements. Privacy is a common argument made in favor of ad blocking, and they’re right: ad networks regularly and blatantly violate web visitors’ privacy. But even if major ad networks completely abandoned behavioural tracking, it won’t fix how  garbage they are, even by advertising standards. One of the more infamous television ads — the repetitive “Head-On: Apply Directly to Forehead” spot — was made in response to an  mandate requiring them to stop pretending to be medicine. Television and Print ads are subject to extensive, and actually enforced, regulation. The ads sold by Google, Facebook, Twitter, Amazon, and Microsoft are a lot less like those, and a lot more like the telephone call that claims to be from your bank without actually saying what bank that is. Or the contents of your spam folder. For your own health and safety, you have to ignore them. And  at that point, there is little reason to download them at all. 1  the programs that we recommend support custom block lists, and there’s no rule saying that the block list that you program has to be a list of  advertisements, so calling them ad blockers is kind of underselling the power of software like this. But this essay is about how blocking ads is a good thing, so let’s stick with that for now.\n 2  A web script is a set of instructions, attached to a web page, telling your computer to do things after the web page has loaded. The kinds of instructions that a script can include are intentionally limited — for example, a web script can’t run your printer without asking you first — but one thing they can do is have your computer perform some math and then send the results back to the website that it got the script from. Cryptocurrency mining is designed under the assumption that performing math costs lots of money for whoever intends to earn it that way, but doing it by attaching a web script to an ad and having the math performed on random web visitors’ computer instead might be cheaper.\n 3  Ad networks also collect lists of interests of individual readers, so they’re actually matching up trios, not couples. But the analogy would still be useful either way.\n ShouldIBlockAds.com was written by  Michael “notriddle” Howell. If you found a mistake, let me know in the  issues reporting page.", "posttime": "2020-05-23 13:31:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,屏蔽,block", "title": "我应该屏蔽广告吗？", "title_en": "Should I Block Ads?", "transed": 1, "url": "https://shouldiblockads.com/", "via": "", "real_tags": ["广告", "屏蔽", "block"]}, {"category": "", "categoryclass": "", "imagename": "2e7fce61bbb234e4b42dac2afbfbfa78.jpeg", "infoid": 1003323, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任天堂交换机eShop上的设计选择可以为黑客提供关于目标密码的线索。", "note_en": "A design choice on the Nintendo Switch eShop can gives hackers clues as to a target’s password.", "posttime": "2020-05-23 04:18:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "任天堂,密码,开关,nintendo,交换机", "title": "“怪异”的任天堂开关问题让你更容易猜到密码", "title_en": "'Weird' Nintendo Switch Issue Makes it Easier to Guess Passwords", "transed": 1, "url": "https://www.vice.com/en_us/article/889a33/nintendo-switch-eshop-guess-password", "via": "", "real_tags": ["任天堂", "密码", "开关", "nintendo", "交换机"]}, {"category": "", "categoryclass": "", "imagename": "ec761b5f0916b440ddd67841dfd5b8a8.png", "infoid": 1003322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我发现这也发生在我的团队里，尽管他可能有点夸大了情况。\nScrum是一种将低于平均水平或较差的开发人员转变为一般开发人员的方法。它还擅长将优秀的开发人员转变为一般的开发人员。\n每个人都只想从黑板上去掉一些你可以在一天内完成的容易的事情，这样你就可以在明天的每日Scrum上报告一些事情。每个人都在努力采摘低垂的果实。如果什么都没有发生，你又在做什么呢？你没有动力去做聪明的事情，也没有花时间去思考解决方案的动机。你让球队失望了！速度在下降！\n我认为，如果你有困难要解决的问题，你可以把它们交给聪明人，然后让他们自己去解决。你不要每天不停地骚扰他们，要求知道他们昨天做了什么，今天又计划做什么。每天都在更新，聪明人解决难题的动力在哪里？他们现在有了与初级开发人员相同的激励，找到最容易的门票来全面转移。\n有时候我只想一个人呆几天，想个办法。如果我这么做了，我在Scrum上就没什么可说的了。所以取而代之的是，我会选择前端的颜色是错误的绿色或拼写错误的用户故事！你看，在午饭前，我一天就完成了两层楼！跟我走！\n我不完全同意他的话，例如，我同意有一条评论说，不是他们(经理)不信任他们，而是他们在没有持续监督的情况下不能把事情做好。\n当一个伟大的开发人员变成一个普通的开发人员时，总是有多种原因，但我确实发现日常Scrum可能是原因之一。那么，我如何防止Scrum会议的这种副作用呢？\n我也意识到说起来容易做起来难，但我喜欢看看别人怎么看这个问题。\n你引用的文本的第三和第四段谈到了这个问题，并提出了一种绕过它的方法。-你是在排除那个解决方案吗？-一个Flater。\n@菲利普，我同意！但我已经得到了答案，所以我不能把我的问题移到那里，对吗？--陈秋浪。\n主持人可以将问题和答案一起迁移到不同的Stack Exchange站点。如果您希望他们这样做，请将您的问题标记为需要版主干预，并告诉他们您希望将其迁移到何处。-大卫·菲利普(Philipp)。\n我和我的朋友都是Scrum团队的一员，他们不是Scrum的粉丝。原因是，作为一个拥有专门的流程管理器的流程，它通常会将所有其他流程弯曲和中断，并成为这个总体流程，在该流程中，除了Scrum例程和使这些Scrum例程看起来成功之外，您什么都不做。\n冲刺(两周的部分)是第一位的。因为在两周结束的时候有人会问我们是否完成了我们承诺要做的事情，所以优先买到“做完”的门票。这意味着要抄近路才能把票做完。当冲刺结束时，我的团队不会进行单元测试或代码审查。在我朋友的团队中，他加入了if语句来处理QA发现的错误，而不是真正找到错误的根本原因来完成票证。这两周的关注可能会导致无限缺陷的方法论。显然，在Scrum中，它需要通过产品所有者，但除非他们痴迷于边缘情况，否则很容易就会漏掉很多东西，开发人员不会被鼓励深入考虑这一点。Scrum和无限缺陷可以成为好朋友，因为无限缺陷方法允许人为地提高速度，只要在冲刺之后发现错误，并因此将其视为新工作。通过不断生成新的bug，您可以获得更高的速度。\n每个人都可以一天比一天地看到您的工作效率，这成为一个简单的评估指标。拥有一个公开的任务委员会意味着每个人都可以看到你做事情的速度有多快，包括管理层。在我的组织中有一些关键的人认为我很有效率，主要是因为我相对于其他人来说票务转移得太快了。当在此基础上评判开发人员时，通过QA的糟糕实现和经过良好测试、架构良好的实现是等价的。这就是明星可以被降至看似平均水平的地方，因为董事会+速度成为评判开发人员的方式，成为他们关注的焦点。\n在许多情况下，团队实际上并不是有效的自组织。Scrum喋喋不休地谈论自组织团队。&#34；我写了另一个关于这个问题的答案。总而言之，团队成员将按照他们喜欢的/受到激励的方式做事，除非这构成了一个有用的团队，否则许多事情都无法完成，团队成员只能继续在混乱中前进。如果团队都有相同的目标和激励，他们可能会自组织起来。问题是，这很少是真的。有一个人想要升职。另一个是在业余时间攻读学位。三分之一的人正在提升技能，准备去另一家公司工作。另一个只是不想有争论，所以什么都同意，让代码库变得一团糟。很多好的设计都需要开发人员坐下来仔细考虑该如何工作。在Scrum中，您需要清单，并且没有对工作质量进行真正的检查，因为&#34；完成&#34；或&#34；未完成&#34；通常是由非技术性项目所有者决定的。这激励人们进入空白，专注于输出代码。\n票证/用户故事迅速成为架构。因为开发人员独立地按顺序处理每个票证，所以体系结构迅速开始镜像这些票证。门票通常是1-2句话的用户故事。票证驱动的体系结构很快变得杂乱无章，原因很简单，因为更多的代码会根据需要堆积起来。\n高度的开发人员独立性意味着每个开发人员采取不同的方法。考虑对对象进行排序。您可以在JS的前端、Java的后端或SQL本身中执行此操作，如果时间有限，您可以选择最容易实现的方法。虽然这不一定是错误的，但它使调试变得非常困难，因为需要检查更多的地方。\n站立表演是有效的更新管理。认为单口相声是为开发人员服务的想法是荒谬的。有没有人真的等到早上9点才报告问题，或者他们会立即在群聊中询问？实际上，是食物链上更高层的人在密切关注事物的移动速度，这样他们就可以在当天晚些时候询问。\n优秀的开发人员通常由他们开发健壮代码的能力来定义。除非产品负责人是技术人员，否则Scrum会大量贬值，因为产品负责人不会评估代码。它是功能驱动的，它运行的是所提供的用户故事的功能标准。\n伟大的开发人员通常是由他们编写代码的能力来定义的，这些代码现在和将来都有价值。Scrum项目在两周的时间内考虑到所有事情。没有未来。\n伟大的开发人员通常被定义为能够解决棘手问题的人。Scrum鼓励挑选可以轻松完成并以稳定的速度快速完成的工作。一个棘手的问题是开发人员完成票证的速度很慢。\n伟大的开发人员经常被寻求建议和第二意见。但是，任何这样做的时间都会减少大量生产门票的时间，因此它们的速度会下降。\n即使你遇到的情况是，没有根据完成的分数来正式评判你(如果管理层主要是在Scrum仪式期间互动，因为这是他们关于进展的全部内容)，人们仍然会竞争注意力和奖励。\n为了解决这个问题，我会取消个人速度得分，取消单口相声中管理层的存在(否则开发人员会受到强烈的激励，总是有好消息)，并会告诉管理层，他们第二次表扬开发人员或根据票量给他们加薪，他们就会从根本上改变行为。理想情况下，产品所有者也不会是直接经理，因此开发人员在Sprint审查和Sprint计划期间会受到激励，让他们看起来不错。\n问题是，您正在与Scrum的本质作斗争，因为它主要关心速度。衡量的是重点关注的是什么，Scrum衡量的是输出速度，用户端的输出只由产品所有者判断。该指标并不重视与伟大的开发人员相关的许多行为。\n您基本上以令人难以置信的简明方式总结了我对Scrum的所有不喜欢之处。9~10成熟。--格雷戈里·柯里(Gregory Currie)。\n我没有对此投反对票(我不认为我们应该因为一系列糟糕的经历而受到惩罚)，但你所描述的不是Scrum。然而，这是一种被称为Scrum的足够普遍的体验。我曾多次在伟大的Scrum团队中担任开发人员，在这些团队中，每个人都团结在一起解决困难的问题，并做出了令人惊叹的工作。但后来，我工作的公司确实致力于此。--丹尼尔。\n无限缺陷方法论的Scrum解毒剂是“完成”的定义。在Scrum中，自组织团队选择如何最好地完成他们的工作，而不是由团队外的其他人指挥。如果管理层监控个人贡献者的表现来奖励速度最快的牛仔程序员，这就违反了这一点。Scrum并没有说开发人员独立工作。它说开发团队自行组织，这意味着团队可以决定其成员如何协作。-约翰·梅里顿(Meriton)。\n我觉得有必要指出的是，1)在Scrum中不再有承诺的工作，2)Scrum明确地告诉你特定的人没有任务，所有的任务都属于团队3)Scrum不希望开发人员独立，4)根据Scrum的说法，上级不属于站台表演--Erik。\n对于人们称之为Scrum的负面体验，我可以理解，但如果你的大部分经历在指南中被明确称为Scrum，而不是Scrum；，你就不能真的把它们归咎于系统。--约翰·埃里克。\n我认为你的情况和你引用的文本的问题是，每天的Scrum不知何故变成了一场谁完成了最多门票的比赛。您的开发人员交付的票证数量是判断/评估票证的最重要指标吗？而不考虑票证的难度/工作量？\n每天的Scrum不应该是一场比赛，而应该是一个(简短的)会议，在那里每个人都会讲述他们目前正在做的事情，他们遇到的问题，以及他们是否可以相互帮助的看法/讨论。\n除此之外，Scrum不应该被视为经文。经理将某些任务/票证分配给最高级/最合适的人并没有什么错。\n通过正确地做这件事。我读过的所有恐怖故事，不管是你的还是其他的答案，只告诉我一件事：那些人做得不对。我明白，这很难。制定一些规则并让他们遵守是非常容易的，但这不是Scrum。Scrum正在组建一个自组织团队。这并不适用于每个人，也不适用于每个星座。但这是基础，你所看到的一切都是实际上不是一个团队的结果。\n想象一下，11个人被递给一本足球手册，并被告知每天上午10点左右在5号会议室进行15分钟的训练。你认为这就是一支优秀足球队的标准吗？但是如果这11个人真的是很棒的职业球员呢？还是没有团队吗？不是的。即使是克里斯蒂亚诺·罗纳尔多也迟早会和这样的球队一起拿到平均工资。但这不是足球的错。这不是你如何组建团队的问题。\nScrum建立在你们是一个团队的事实之上。在一个团队里，你昨天是否拿到了一张罚单并不重要。在团队中，你同意你的目标是什么(即完成的定义)，然后努力实现它。在一起。\n一个优秀的开发人员如果每天与他们的团队交谈5分钟，也不会有丝毫逊色。如果一个伟大的开发人员被迫进入一个管理不善的流程，每天都要召开会议，向经理报告他们是否完成了票证，那么他们就会变得不感兴趣。\n召开每日报告会议，告诉经理你昨天做了什么，并试图融入一些武断的绩效计划，这不是Scrum。这是一种众所周知的反模式。有人可能会称它为Scrum，并说Scrum指南说你们应该每天见面，但这将是真正的Scrum，因为人民民主共和国实际上是一个为人民服务的民主共和国。\n就像团队运动一样，Scrum需要参与者成为一个团队。如果他们只是参与者，希望通过炫耀自己做了多少故事点或进了多少球来提高自己的地位，那么他们总是会输给一个合作的团队，而不是毗邻或相互竞争。\n那么，如何防止Scrum将优秀的开发人员变成平庸的开发人员呢？雇佣团队成员。很棒，平均水平，这并不重要，因为一个真正的团队随时都会击败随机收集的所谓的优秀参与者。我不是说那很容易。但这就是Scrum的意义所在。\n根据我的经验，关于Scrum正在组建一个自组织团队的说法更像是一个谜。--发稿陈秋浪。\n+1，团队经常采用像Scrum这样的敏捷过程，认为所涉及的仪式会神奇地让他们构建更好的软件。但这不是敏捷的意义所在。当你归结敏捷的时候，它就是关于收紧反馈循环，这样团队就可以自我检查，自己找出如何变得更好。Scrum不会帮助您构建更好的产品，但如果您认真地进行自我检查，它可能会帮助您构建更好的团队。这反过来又会带来更好的产品。--塞斯·R(Seth R)。\n团队并不是凭空形成的。这是它的功劳。而且许多公司不想投资这项工作。甚至不理解这个事实。所以，是的，我看到失败的团队比工作团队更多。我见过它工作，如果做得正确，如果做得不对，就会失败。但我认为指责Scrum失败是不公平的，因为Scrum做得不对。咖啡如果用废水冲泡，味道真的很不好。但你不能为此责怪咖啡。那不是你做这件事的方式。如果世界上大多数人用废水煮咖啡.。咖啡对此还是无能为力。-nvoigt。\n@秋浪仅仅做Scrum并不能自动组成团队。当您有一个团队时，Scrum是您可以使用的东西。没有真正的团队，Scrum就会失败。-nvoigt。\nScrum大约在两周内构建。对于开发人员来说，除了这段时间之外，没有做任何考虑。\n几乎任何两周的产品都可以由初级工程师成功地制造出来。高级工程师的价值在于发现陷阱、开发面向未来的体系结构、确保健壮性和捕捉边缘情况。Scrum认为所有这些都无关紧要，就像喷洒代码一样。\n在Scrum中，您可以完成大量工作。然后你来处理它。然后，您会根据您在冲刺过程中完成的堆栈数量进行评分。正式来说，你没有得分，所有的工作都属于团队，但没有人，至少是管理层，会相信这一点。该框架构建在微观管理中，频繁检查Scrum工件，其中工件表示您所做的任何事情和每件事。\n单口相声通过每24小时带来一次检查，让你的老板检查来强调这种资历。\n我在两个Scrum团队工作过。我的第一份工作是大学毕业后的第一份工作，所以保持低调，报告无穷无尽的工作是很容易的。我可以及时拼凑出一些东西，即使它不稳定。\n然后，在我的第三份工作中，那家公司把它带来了，我被期望做更大的工作，但仍然有进展要报告。在编码之前，我通常甚至没有时间阅读需求文档，所以我可以在第二天报告站立表演的代码。\nScrum是如何让我变得平庸的？我开始讨厌我的工作，所以除了再次静静地在我的格子间代码中大量生产之外，我再也没有做出过有意义的贡献。\n顺便说一句，我记得看了辛德勒的名单后，我想，这家工厂很可能是在Scrum的管理下进行的，甚至到了神经质地关心日常生产率，以及惩罚可怜的工人在单口相声中出现生产缺陷的地步。\n很遗憾看到您有一个如此糟糕的老板，现在却责怪一个相当好的流程框架。您可能希望实际阅读一些关于Scrum的内容。官方的Scrum指南可能是一个很好的起点。在其中，你会了解到，检查是由团队完成的，而不是由管理层完成的。事实上，在Scrum中没有老板(或者如果他们有，那么产品负责人和Scrum大师应该保护您不受他们的影响，所以您在评审会议上每个Sprint最多只能看到他们一次)。-约翰·梅里顿(Meriton)。\n即使从这个简短的描述中也可以清楚地看出，Scrum在这里做得很糟糕，效率也很低。-DJClayworth。\n@DJClayworth：没错，但是Scrum确实有一个问题，它很容易被误解。这不是Scrum发明者的错，但这是Scrum的一个问题，正如你从这里的许多类似帖子(不幸被否决)中看到的那样。-宾客。\n我是一个被Scrum转变为平庸的体面开发人员，主要是因为Scrum给了我一条逃脱惩罚的途径，让我没有理由去关心它，并强烈鼓励我玩弄系统。\nScrum进行了15分钟的单口相声表演，在这里你可以影响你的老板，也可以让你的老板评估你的表现。一整天都围绕着在你的1分钟简介中报告成功。因此，做任何复杂的事情都意味着它永远不会进入报告层次结构，因为复杂的想法需要一分钟以上的时间。\n因为我需要做的就是犹豫不决，保持我的速度很快，我和我的同事们可以把我的很多时间重新分配到其他事情上。我正在攻读硕士学位。另一名团队成员正在创建自己的初创公司。我的质检人员有一半时间在织布。\nScrum假设员工关心一家公司或项目的成功或失败，但我们不关心，因为我们是展出的斑马，而不是动物园饲养员。动物园只需要赚足够的钱，我们就不会挨饿了。主人是否吃东西无关紧要。另一个答案是，一群人会输给一支队伍。不过，作为一名员工，失败是完全没有问题的。如果我的项目一年后就夭折了，我又何必在乎呢？\n我是一个专业的Scrum开发人员，但最主要的原因是它让我几乎全职攻读硕士课程就能获得报酬。\n管理层中的任何人都不应该对此感到高兴，因为我们的团队的产量可能只有9月份的三分之一。但是，只要我们保持较高的速度，管理层就会被Scrum蒙蔽了双眼，无法分辨出点数生成和实际工作之间的区别。\n防止这种情况需要关心个人表现，而不仅仅是单口相声和票速。Scrum强调报告速度，没有其他内容，所以提交垃圾，然后把时间用在自己身上是绝对有意义的。\nScrum会在15分钟内进行单口相声，在这段时间里，你会影响你的老板，你的老板也会评价你的表现。那么，你就不是在做Scrum了。单口相声是为了让团队相互了解最新情况，并检查完成工作是否存在障碍，这样就可以消除这些障碍。它是关于也许可以与你的团队成员中的一员联系起来，一起做一些事情。这绝对不是要影响你的老板。如果这就是你的工作方式，你应该不邀请你的男朋友。\n..", "note_en": "I found  this also happened in my team although he may exaggerated the situation a little bit.\n Scrum is a way to take a below average or poor developer and turn them into an average developer. It&#39;s also great at taking great developers and turning them into average developers.\n  Everyone just wants to take something easy off the board that you can get done in a day so you have something to report in tomorrows daily scrum. It&#39;s just everyone trying to pick the low hanging fruit. THere&#39;s no incentive to be smart and to take time to think about solutions, if nothing is moving across what are you even doing? You&#39;re letting the team down! The velocity is falling!\n  I think if you have hard problems to solve you solve them by giving them to smart people then leaving them alone. You don&#39;t constantly harass them everyday demanding to know what they did yesterday and what they plan to do today. With daily updates where is the incentive for the smart people to work on the hard problems? They now have the same incentive as the junior developer, find the easiest tickets to move across the board.\n  Sometimes I will want to just be alone and think about a solution for a few days. If I do that though I&#39;d have nothing to say at the scrum. So instead I&#39;ll pick the user story where the colour on a front end was the wrong shade of green or a spelling mistake! See, I knocked out 2 stories in one day, before lunch! Go me!\n I don&#39;t fully agree with his words, e.g. I agree with one comment said  it&#39;s not that they (managers) don&#39;t trust them, it&#39;s that they don&#39;t get things done without constant supervision.\n When a great developer becomes an average developer there are always multiple reasons but I do find daily scrum could be one of reasons. So how do I prevent this side-effect of scrum meeting?\n I also realized it is easier said than done but I like to see how others see this problem.\n  The third and fourth paragraphs of the text you quoted address the issue and a way to get around it. Are you excluding that solution?\r \r–  Flater\n    @Philipp I agree! But I already got answers so I won&#39;t be able to &#34;move&#34; my question there, right ?\r \r–  Qiulang\n  Moderators are able to migrate questions together with their answers to a different Stack Exchange site. If you would like them to do that, flag your question for &#34;in need of moderator intervention&#34; and tell them where you would like it to be migrated to.\r \r–  Philipp\n  I and my friends who are part of Scrum teams are not fans of it. The reason is that in being the one process which has a dedicated process manager, it usually bends and breaks every other process to it and becomes this overarching process where you do nothing consistently except Scrum rituals and making those Scrum rituals seem successful.\n  The sprint (the two week part) comes first. Because there is someone at the end of the two weeks asking about whether we got what we  committed to done, getting tickets to &#34;done&#34; gets prioritized. It means that corners get cut to get the tickets finished. My team doesn&#39;t unit test or code review as the sprint ends. On my friend&#39;s team, he has thrown in if statements to deal with bugs QA found rather than actually finding the root cause of errors to get the tickets done. This two-week focus can lead to the  infinite defects methodology. Obviously in Scrum it needs to pass the product owner, but unless they obsess over edge cases, a lot easily slips through and the developer is not encouraged to consider that very deeply. Scrum and infinite defects can be good friends because the infinite defects approach lets velocity be artificially high as long as bugs are found after the sprint and therefore counted as new work. You could have an ever higher velocity by constantly generating new bugs.\n Everyone can see your productivity day by day and it becomes an easy evaluation metric. Having a public task board means everyone can see how quickly you are doing stuff, including management. There are key people in my organization who consider me very productive mostly because of how quickly I have moved tickets relative to other people. When developers are judged on that basis, a lousy implementation that passes QA and a well-tested, well-architected implementation are equivalent. That is where stars can be reduced to seeming average as that board + velocity becomes how developers are judged and becomes what they focus on.\n Teams do not actually self organize usefully in many cases. Scrum goes on about &#34;self-organizing teams.&#34; I wrote  another answer about this.. In summary, team members are going to do things the way they prefer/are incentivized to do and unless that adds up to a useful team, lots of things do not get done and team members just keep marching on over the mess. Teams might self organize if they all have the same goal and incentives. The problem is, that is rarely true. One guy wants a promotion. Another is studying for a degree on the side. A third is upskilling to go to another company. Another just doesn&#39;t want to have arguments so agrees to anything and lets the codebase become a mess. A lot of good design requires the developers to sit down and hash out how a thing should work. In Scrum, you need to clear tickets and there is no real check on the quality of the work as &#34;done&#34; or &#34;not done&#34; is decided by a usually non-technical project owner. That incentivizes going into a void and focusing on outputting code.\n Tickets/user stories rapidly become architecture. Because the developers are independently working away on each ticket sequentially, the architecture rapidly begins to mirror the tickets. The tickets are typically 1-2 sentence user stories. Ticket driven architecture rapidly gets messy simply because more code gets piled on as required.\n The high level of developer independence means each developer takes different approaches. Consider sorting of an object. You can do that in the frontend in JS, in the backend in Java, or in the SQL itself and if you are time-constrained, you will choose whichever method you can most easily implement. While it is not necessarily wrong, it makes debugging a heck of a lot harder as more places need to be checked.\n Standup is effectively &#34;update management&#34;. The notion that standup is for developers is absurd. Does anyone actually wait until 9AM to report a problem or are they going to just ask in the group chat immediately? In practice, it is someone higher up the food chain keeping tabs on how fast things are moving so they can ask about it later in the day.\n Great developers are usually defined by their ability to develop robust code. Unless the product owner is technical, Scrum massively devalues that as the product owner isn&#39;t evaluating the code. It is feature driven and &#34;it runs&#34; is a functional standard for the provided user stories.\n Great developers are usually defined by their ability to write code which has value both now and in the future. Scrum projects think of everything in two week periods. There is no future.\n Great developers are usually defined as those who can solve tough problems. Scrum encourages picking work that can easily be done and rapidly churned out at a steady pace. A tough problem is a developer being slow on getting the tickets done.\n Great developers are often sought out for advice and for second opinions. But any time doing that is less time spent churning out tickets, so their velocity falls.\n Even if you get a situation where you are not formally judged on the points completed (which will not happen if management is mostly interacting during Scrum rituals as that is all they have to see regarding progress), people are still going to compete for attention and rewards.\n To resolve this, I would eliminate both individual velocity scores, the presence of management at standup (otherwise developers are strongly incentivized to always have good news), and would tell management that they second they praise a dev or give them a raise based on ticket volume, they radically change behavior. Ideally, the product owner would also not be a direct manager and thus someone the devs are incentivized to look good for during sprint review and sprint planning.\n The problem is, you are fighting the nature of Scrum as it primarily cares about velocity.  What gets measured is what gets focused on and what Scrum measures is speed of output with the output judged from the user side only by the product owner. That metric does not value many behaviors associated with great developers.\n  You basically summarised everything I dislike about Scrum in an incredibly concise manner. Well done.\r \r–  Gregory Currie\n  I did not downvote for this (I don&#39;t think we should be penalized for having a crappy set of experiences) but what you describe is not Scrum. However, it is a common enough experience labeled as Scrum. I&#39;ve worked as a developer on great Scrum teams many times where everyone rallied around hard problems and did amazing work. But then, the company I worked at really committed to it.\r \r–  Daniel\n  The scrum antidote to &#34;infinite defects methodology&#34; is the &#34;definition of done&#34;. In scrum, &#34;Self-organizing teams choose how best to accomplish their work, rather than being directed by others outside the team&#34;. This is violated if management monitors the performance of individual contributors to reward the fastest cowboy coders. Scrum does not say that developers work independently. It says that the development team organizes itself, meaning the team gets to decides how its members collaborate.\r \r–  meriton\n  I feel the need to point out that 1) there is no such thing as &#34;committed work&#34; in Scrum anymore, 2) Scrum explicitly tells you that specific people do NOT have tasks, all tasks belong to the team 3) Scrum doesn&#39;t want developer indepedence and 4) according to Scrum, higher ups do not belong at the standup\r \r–  Erik\n  I can understand having negative experiences with something that people called Scrum, but if most of your experiences are called out explicitly as &#34;not Scrum&#34; in the guide, you can&#39;t really blame them on the system.\r \r–  Erik\n      I think the problem in both your situation and the text you are quoting is that the daily scrum somehow turned into a competition who has completed the most tickets. Is the quantity of the tickets your developers deliver the most important metric on which they are judged/evaluated ? without taking into account the difficulty/amount of work of the ticket ?\n The daily scrum should not be a competition but a (short) meeting where everyone tells what they are doing at the moment, what problems they encounter and see/discuss if they can help each other.\n Apart from that, scrum should not be treated as scripture. There is nothing wrong with the manager assigning certain tasks/tickets to the most senior/appropriate persons.\n    By doing it  correctly. All those horror stories I read, being it yours or the other answers, only tell me one thing: those people did not do it correctly. And I get it, it&#39;s hard. It&#39;s super easy to slap down some rules and have them followed, but that is not Scrum. Scrum is  forming a self-organizing team. That does not work with every person and it does not work in every constellation. But it is the foundation and everything you see is the result of not actually being a team.\n Just imagine 11 people being handed a soccer manual and being told practice is every day for fifteen minutes around 10 AM in conference room #5. Do you think that is what makes a good soccer team? But what if those 11 people were really good, professional players? Still no team? No. Even Christiano Ronaldo would be getting &#34;average&#34; sooner or later with that kind of &#34;team&#34;. But that&#39;s not soccer&#39;s fault. It&#39;s just not how you build a team.\n Scrum builds on the fact that you are a team. In a team, it does not matter whether you got &#34;a ticket done&#34; yesterday. In a team, you agree on what your goal is (i.e. definition of done) and then strive to reach it. Together.\n A great developer does not get one bit less great if they talk with their team for 5 minutes a day. A great developer  will become disinterested if they are forced into a poorly managed process that has a daily meeting where they report to their manager whether they got a ticket done or not.\n Having a daily report meeting where you tell a manager what you did yesterday and try to fit in some arbitrary performance scheme is not Scrum. It&#39;s a well known anti-pattern. Someone might call it Scrum and say the Scrum guide says you should meet daily, but it would be just as much real Scrum as the People&#39;s Democratic Republic is actually a democratic republic for the people.\n Just as team sports, Scrum needs the participants to  be a team. If they are just participants that look to boost their own standing by showing off how many story points they did or how many goals they scored, they will always lose the day to a team that works together instead of next to each other or against each other.\n So how do you prevent Scrum from turning great developers into average one&#39;s? Hire team players. Great, average, does not matter, because a  real team will beat a random collection of supposedly &#34;great&#34; participants any day. I&#39;m not saying that&#39;s easy. But that&#39;s what Scrum is about.\n  Through my experience the claim that scrum is forming a self-organizing team is more like a mystery.\r \r–  Qiulang\n  +1, too often teams adopt Agile processes like Scrum thinking that the rituals involved will magically get them to build better software. But that&#39;s not what Agile is about. When you boil Agile down, it&#39;s all about tightening up the feedback loop so the team can self-examine and figure out for itself how to get better. Scrum won&#39;t help you build a better product, but if you take the self-examination step seriously, it might help you build a better team. That in turn leads to a better product.\r \r–  Seth R\n  Teams don&#39;t form themselves just out of the blue. It&#39;s work. And many companies do not want to invest that work. Or even understand that fact. So yes, I have seen failed teams more often than working teams. I&#39;ve seen it work, if done correctly, and fail if not done correctly. But I don&#39;t think it&#39;s fair to blame Scrum for failing, when not done correctly. Coffee tastes really bad if brewed with waste water. But you cannot blame coffee for that. That&#39;s just not how you do it. and if the majority in the world brews their coffee with waste water... still nothing coffee could do about that.\r \r–  nvoigt\n  @Qiulang Just doing Scrum does not automagically form a team. Scrum is something you can use, when you  have a team. Without a real team, Scrum will fail.\r \r–  nvoigt\n      Scrum is built around two week periods. As far as developers are concerned no thinking is done for outside of that period.\n Virtually any two week product could be successfully built by a junior engineer. The value of a senior engineer is in spotting pitfalls, developing future proof architecture, ensuring robustness, and catching edge cases. Scrum views all of these as irrelevant as you firehose spray code out.\n In Scrum, you are handed your stack of work. Then you process it. Then you get scored on how much of the stack you did during the sprint. Officially you are not scored and all work &#34;belongs to the team&#34; but nobody least of all management beleives that. The framework builds in micromanagement with &#34;frequent inspection of Scrum artifacts&#34; with artifacts meaning anything and everything you do.\n With standup that juniority is emphasized by bringing that inspection once every 24 hours for your boss to inspect.\n I have worked on two Scrum teams. My first time was my first job out of college so keeping my head down and reporting endless work was easy. I could hack together something in time even if it was not stable.\n Then on my third job that company brought it in and I was expected to do bigger work but still have progress to report. I often didnt even have time to read the requirement documents before coding so I could report code for standup the next day.\n How did Scrum make me average? I started to hate my work so never meaningfully contributed beyond churning out quietly in my cubicle code again.\n As an aside I remember watching Shindler&#39;s list and thinking that the factory was probably managed with Scrum right down to the part about caring neurotically about day to day productivity and punishing the poor worker for a production bug during standup.\n  Sad to see that you had such a terrible boss, and are now blaming a rather good process framework instead. You might want to actually read a bit about scrum. A good place to start might be the  official scrum guide. In it, you would learn, among other things, that inspection is done by the team, not management. In fact, there are no bosses in scrum (or if they are, the product owner and scrum master are supposed to shield you from them, so you see them at most once per sprint in the review meeting).\r \r–  meriton\n  Even from this short description it is clear that scrum was being done badly and ineffectively here.\r \r–  DJClayworth\n  @DJClayworth: That&#39;s right, but it is really a problem with Scrum that it is prone to such misinterpretations. This is not the fault of the &#34;Scrum inventors&#34;, but it is a problem with Scrum nontheless, as you can see by the many similar posts (unfortunately downvoted) here.\r \r–  guest\n    I’m a decent developer transformed to mediocrity by Scrum mostly because Scrum gives me a path to get away with it and gives me no reason to care and strongly encourages me to game the system.\n Scrum makes the 15 minute standup where you influence your boss and where your boss evaluates your performance. The entire day becomes built around reporting success in your 1 minute blurb. So doing anything complex means it never enters the reporting hierarchy as complex ideas require more than a minute.\n Because all I need to do is blither on and keep my velocity high, my colleagues and I can reallocate a lot of my time to other things. I’m doing my masters degree. Another team member is building his own startup. My QA spends half her day weaving.\n Scrum assumes employees care whether a company or project succeeds or fails but we don’t because we are the zebras on display not the zookeeper. The zoo merely needs to make enough money for us not to starve. Whether the owner eats is irrelevant. Another answer says that a group of individuals will lose to a team. As an employee though losing is perfectly fine. If my project dies a year out why do I care?\n I’m a dev who is pro Scrum but mostly because it lets me get paid for doing my masters nearly full time.\n Nobody in management should be happy with it as our team is probably producing 1/3 of what It did back in September. But as long as we keep velocity high, management is too blinded by Scrum to know the difference between points generation and real work.\n Preventing this would require caring about individual performance beyond standup and ticket speed. Scrum emphasizes reporting about speed nothing else so committing garbage and then using the time for myself makes absolute sense.\n  &#34;Scrum makes the 15 minute standup where you influence your boss and where your boss evaluates your performance.&#34; then you&#39;re not doing scrum. The standup is for the team to get each other up-to-date, and check if there are impediments to getting things done, so those impediments can be removed. It is about maybe linking up with on of your team members to work on something. It is absolutely not about influencing your boss. If that is how you work, you should uninvite your b\n......", "posttime": "2020-05-23 04:10:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,防止,scrum", "title": "如何防止Scrum将优秀的开发人员变成普通开发人员？", "title_en": "How do I prevent Scrum from turning great developers into average developers?", "transed": 1, "url": "https://workplace.stackexchange.com/questions/158451/how-do-i-prevent-scrum-from-turning-great-developers-into-average-developers", "via": "", "real_tags": ["开发", "防止", "scrum"]}, {"category": "", "categoryclass": "", "imagename": "33c118e3bbb9919641b94709207661cc.jpg", "infoid": 1003321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据Business Insider报道，Blind对4400名科技员工进行的匿名调查发现，如果可以选择远程工作，三分之二的员工会考虑离开旧金山湾区。\n随着科技巨头宣布让员工无限期远程工作的计划，这种选择似乎越来越有可能。\n上周，Twitter首席执行官杰克·多尔西(Jack Dorsey)告诉员工，大多数员工将被允许永久在家工作，即使在冠状病毒大流行过去之后也是如此。在社交媒体巨头Coinbase和Square做出颠覆性举动后，Coinbase和Square也做出了类似的决定。谷歌和Facebook很快也加入了诉讼，尽管没有停止无限期的变化，但预计在家工作至少到2021年都是常态。\n以办公为中心的文化可能已经成为过去，尽管工资可能会进行调整，以应对旧金山天价租金和房地产价格带来的生活成本下降。\n在经历了一个世纪的办公室文化之后，这种彻底的变化可能会从根本上改变美国人的工作方式。\n即使员工真的回到市中心的办公室，每周五天工作制也可能成为过去。这项调查的受访者压倒性地表示，他们不希望在大流行之后每天都回到办公室。\n这一变化将受到许多人的欢迎，他们正在与旧金山复杂的生活作斗争，从超高的生活成本到缓慢的通勤。随着城市酒吧、商店和餐馆在大流行期间关门歇业，一些科技工作者表示，他们没有理由留下来。与此同时，塔霍河等其他地区的房地产兴趣也有所上升。\n当被问及如果可以选择远程办公，他们是否会考虑搬迁时，34%的旧金山湾区受访者表示不会。约18%的人说他们会考虑搬出旧金山湾区但留在加州，36%的人说他们会考虑搬到美国其他地方，16%的人说他们可以预见会离开这个国家。", "note_en": "An anonymous survey of 4400 tech workers, conducted by  Blind, found that two thirds of employees would consider leaving the Bay area if they had the option to work remotely, as reported by  Business Insider.\n   That option seems more and more likely as tech giants announce plans to let employees work remotely, indefinitely.\n      Last week Twitter&#39;s chief executive Jack Dorsey told employees that most workers would be allowed to work from home permanently, even after the coronavirus pandemic passes. Following the social media giant&#39;s disrupting move, Coinbase and Square made similar decisions. Google and Facebook soon joined suit although stopped short of an indefinite change, but foresee working-from-home as the norm until at least until 2021.\n          An office-centric culture may be a thing of the past, although salaries could be adjusted to account for reduced living costs away from the sky-high rents and real estate prices in San Francisco.\n      The sweeping changes may radically alter the way Americans work, after a century of office culture.\n       Even if workers do return to their downtown offices, the five-day work week may be a thing of the past. Respondents to the survey overwhelmingly said they didn&#39;t expect to go back into offices every day after the pandemic.\n   The change will be welcome to many who battle the complications of life in San Francisco, from a ultra-high cost of living to slow commutes. As city bars, shops and restaurants shutter their doors through the pandemic, some tech workers say they have no reason to stay. Meanwhile other regions such as Tahoe have seen an  uptick in real estate interest.\n          When asked if they would &#34;consider relocating&#34; if given the option to work remotely, 34% of Bay Area respondents said no. About 18% said they&#39;d consider moving out of the Bay Area but staying in California, 36% said they&#39;d consider moving elsewhere in the US and 16% said they could foresee leaving the country.", "posttime": "2020-05-23 04:09:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,员工,workers", "title": "如果可以远程工作，三分之二的技术员工会永久离开SF", "title_en": "2 Out of 3 tech workers would leave SF permanently if they could work remotely", "transed": 1, "url": "https://www.sfgate.com/living-in-sf/article/2-out-of-3-tech-workers-would-leave-SF-15289316.php", "via": "", "real_tags": ["远程工作", "员工", "workers"]}, {"category": "", "categoryclass": "", "imagename": "40b85dfe257c01ae87ffce8fb5080e84.jpg", "infoid": 1003319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据智能手机隐私公司Jumbo Privacy的一份新报告，北达科他州的官方冠状病毒接触追踪应用程序旨在检测人们是否可能接触到冠状病毒，它会向Foursquare发送位置数据和唯一的用户标识符，以及向谷歌和一家漏洞跟踪公司发送其他数据。\n这款名为Care19的应用程序由一家名为ProudCrowd的公司开发，该公司还为北达科他州的体育迷制作了一款基于位置的社交网络应用程序，为每个使用它的人生成一个随机的ID号。然后，它可以“全天匿名缓存个人的位置”，根据国家网站的说法，它可以一次存储关于人们在哪里度过至少10分钟的信息。如果用户的冠状病毒检测呈阳性，他们可以将这些信息提供给北达科他州卫生部用于接触者追踪目的，这样其他花时间接近病毒患者的人就有可能得到通知。\n根据该应用程序的隐私政策，“位置数据是你的隐私，安全地存储在ProudCrowd，LLC服务器上”，不会与第三方共享，“除非你同意，或者ProudCrowd是根据联邦法规强制的。”\n但根据Jumbo的报告，这款应用程序会将随机的ID号码，以及用于广告目的的手机ID和用户访问的地点的明显纬度和经度发送给领先的位置数据提供商Foursquare。据监测该应用产生的互联网流量的Jumbo称，该应用还将随机ID发送到Bugfender运行的服务器。Bugfender是一项总部位于巴塞罗那的服务，应用制造商使用该服务来跟踪和诊断软件故障。据报道，它伴随着手机的名字，通常包括设备所有者的名字。Jumbo发现，手机的广告ID也会被发送到谷歌服务器，这些服务器似乎与谷歌的Firebase服务有关联。\nJumbo首席执行官皮埃尔·瓦莱德(Pierre Valade)表示：“我们的主要观点是，隐私政策没有披露与第三方共享的情况。”瓦莱德和Jumbo首席技术官简·西切曼之前曾在Foursquare工作，但该公司强调，这项研究并不是基于他们在公司期间收集的任何信息。在其报告中，Jumbo建议人们在隐私政策更加明确或应用程序更新以停止共享数据之前不要安装该应用程序。\n在一份声明中，ProudCrowd证实使用了Bugfender和Foursquare服务，并表示计划在未来更新其隐私政策和该应用程序。\n该公司的声明称：“根据我们Foursquare协议的条款，Care19应用程序的用户界面清楚地在我们的‘附近地点’屏幕上显示了Foursquare的用法。”“然而，我们的隐私政策目前没有明确提到这种用法。我们将与我们的州合作伙伴合作，在我们的隐私政策中更加明确。值得注意的是，我们与Foursquare达成的协议不允许他们收集Care19数据或以任何形式使用这些数据，只是简单地确定附近的企业并将其返回给我们。“。\n在给Fast Company的一封电子邮件中，ProudCrowd创始人蒂姆·布鲁金斯(Tim Brookins)写道，这个随机ID是无意中包含在给Foursquare的消息中的，公司将尽快删除它。\n布鲁金斯写道，向Foursquare传输信息是“相当良性的，因为Foursquare实际上并不收集我们发送的数据。”“但对我们来说很容易移走。保安公司抓得不错。“。\n北达科他州公共信息官员Jennifer Skjod表示，该州支持ProudCrowd的声明。\n在谈到布鲁金斯的回应时，她说：“我们相信，无论他做出什么回应，我们都会这么说。”\nFoursquare已经超越了它的同名城市指南应用程序，为其他软件公司提供位置跟踪。一位公司发言人在给Fast Company的电子邮件中写道：“Foursquare从我们SDK的免费用户Care19那里收到了一些数据，但我们没有以任何方式使用这些数据，这些数据很快就被丢弃了。”对于我们SDK的免费用户，Foursquare不会使用、重新打包或转售数据。从本质上说，我们可能收到的任何数据都会立即被丢弃。“。\n根据该公司的声明，ProudCrowd还计划在该应用程序的未来版本中通过Bugfender opt-in进行“诊断数据收集”。\n根据声明，“这将使用户在需要技术支持时可以选择发送诊断信息，并避免过度收集我们不需要的数据。”\n在发给Fast Company的一封电子邮件中，Bugfender的联合创始人兼首席执行官乔迪·希梅内斯表示，他无法确认ProudCrowd的应用程序是否使用了Bugfender的软件。他写道，一般来说，应用程序发送到服务器的数据会安全存储，不会与第三方共享，也不会用于用户档案或广告。\n他写道：“我们通过向应用程序开发者收取使用该工具的费用来赚钱，他们的数据属于他们。”“我们不会搞砸它。”\n布鲁金斯说，隐私政策也将更新，以反映发送给谷歌的数据。\n他写道：“我们的隐私政策目前在第二段有一个相当笼统的声明，指出我们收集数据是出于应用的可用性和应用的可靠性原因(应用崩溃等)。”“我们修订后的隐私政策将在更多细节中指出这一点，并指明第三方(谷歌Firebase)的名字。”\n谷歌发言人在给Fast Company的电子邮件中写道，Google Analytics for Firebase对哪些信息可以发送到该服务有规定。\n这位发言人写道：“任何选择使用Google Analytics for Firebase的开发者都被禁止传递信息，比如电子邮件地址或电话号码，这些信息可能会向谷歌个人识别某人的身份，我们使用机器学习和人工审查相结合的方式来识别健康应用，并将它们标记为没有资格使用广告。”\nJumbo首席执行官瓦莱德表示，他对ProudCrowd的声明感到鼓舞，并称如果公司更新该应用程序和隐私政策，Jumbo可能会修改不使用该应用程序的建议。\n接触者追踪被视为减少冠状病毒传播的一种潜在方式。接触者追踪是一种潜在的减少冠状病毒传播的方式，通过这种方式，潜在的接触者会得到通知，这样他们就可以接受检测，并有可能接受治疗或隔离。苹果和谷歌已经开发了软件工具包，让公共卫生机构可以构建iOS和Android应用程序，通过蓝牙实现自动手机接近检测，许多州和地方机构已经开始雇佣人员手动追踪感染病毒的人的联系人。北达科他州官员表示，未来版本的Care19将采用苹果-谷歌的新技术。谷歌发言人表示，该应用程序目前没有使用该系统。\n这位发言人在给Fast Company的电子邮件中写道：“这款应用程序没有使用谷歌的曝光通知API，该API严格禁止应用程序收集或使用Android的广告ID。”\n这类应用程序的运行效果如何，人们是否会安装足够数量的应用程序以发挥作用，这仍然是一个悬而未决的问题，一些调查显示，人们对这项技术持怀疑态度。专家和活动人士也表达了对错误结果和隐私问题的担忧。上周国会提出的一项法案将限制此类数据的使用方式。\n华盛顿大学法学院(University Of Washington School Of Law)副教授、拟议法律的支持者瑞安·卡洛(Ryan Calo)在写给Fast Company的一封电子邮件中写道，“与接触者追踪相关的收集到的数据不应用于任何次要目的，更不用说商业目的了。”", "note_en": "The official COVID-19 contact-tracing app for the state of North Dakota, designed to detect whether people have potentially been exposed to the coronavirus, sends location data and a unique user identifier to Foursquare—and other data to Google and a bug-tracking company—according to  a new report from smartphone privacy company  Jumbo Privacy.\n   The app, called  Care19, and produced by a company called ProudCrowd that also makes a  location-based social networking app for North Dakota State sports fans, generates a random ID number for each person who uses it. Then, it can “anonymously cache the individual’s locations throughout the day,” storing information about where people spent at least 10 minutes at a time,  according to the state website. If users test positive for the coronavirus, they can provide that information to the North Dakota Department of Health for contact-tracing purposes so that other people who spent time near virus patients can potentially be notified.\n According to the app’s  privacy policy, “location data is private to you and is stored securely on ProudCrowd, LLC servers” and won’t be shared with third parties “unless you consent or ProudCrowd is compelled under federal regulations.”\n But according to the Jumbo report, the app sends the random ID number, along with a phone ID used for advertising purposes and apparent latitudes and longitudes of places visited by the user, to  Foursquare, a leading location-data provider. The app also sends the random ID to servers run by  Bugfender, a Barcelona-based service used by app makers to track and diagnose software malfunctions, according to Jumbo, which monitored internet traffic generated by the app. It’s accompanied by the phone’s name, which often includes the device owner’s first name, according to the report. The phone’s advertising ID is also sent to Google servers that appear to be affiliated with Google’s Firebase service, Jumbo found.\n “Our main point is that the privacy policy is not disclosing this sharing with third parties,” says Jumbo CEO Pierre Valade. Valade and Jumbo CTO Jan Sichermann previously worked at Foursquare, but the company emphasizes the study wasn’t based on any information they collected while at the company. In its report, Jumbo recommends people don’t install the app until the privacy policy is made more explicit or the app is updated to stop sharing data.\n  In a statement, ProudCrowd confirmed the use of Bugfender and Foursquare services and said it plans to update its privacy policies and the app in the future.\n “The Care19 application user interface clearly calls out the usage of Foursquare on our ‘Nearby Places’ screen, per the terms of our Foursquare agreement,” according to the company’s statement. “However, our privacy policy does not currently explicitly mention this usage. We will be working with our state partners to be more explicit in our privacy policy. It is important to note that our agreement with Foursquare does not allow them to collect Care19 data or use it in any form, beyond simply determining nearby businesses and returning that to us.”\n  In an email to  Fast Company, ProudCrowd founder Tim Brookins wrote that the random ID was included in the messages to Foursquare unintentionally, and that the company will remove it as soon as possible.\n The transmission of information to Foursquare is “fairly benign, as Foursquare doesn’t actually collect our sent data,” Brookins wrote. “But easy enough for us to remove. Good catch by the security firm.”\n Jennifer Skjod, a public information officer for North Dakota, says the state stands behind ProudCrowd’s statement.\n “We’re confident whatever he responded [with] is exactly what we would say,” she says of Brookins’s response.\n Foursquare  has expanded beyond its namesake city guide app to  provide location tracking for other software companies. “Foursquare receives some data from Care19, a free user of our SDK, but we do not use the data in any way and it is promptly discarded,” a company spokesperson wrote in an email to  Fast Company. “For free users of our SDK, Foursquare does not use, repackage, or resell the data. Essentially, any data we might receive is immediately discarded.”\n ProudCrowd also plans to make “diagnostic data collection” via Bugfender opt-in in future versions of the app, according to the company’s statement.\n  “This will enable users to opt in to send diagnostics when they need technical support and avoid overcollection of unneeded data on our part,” according to the statement.\n In an email to  Fast Company, Bugfender cofounder and CEO Jordi Giménez said he wasn’t able to confirm whether or not ProudCrowd’s app used Bugfender’s software. In general, he wrote, data sent by apps to its servers is stored securely and not shared with third parties or used for user profiling or advertising.\n “We make money by charging the app makers a fee for using the tool, and their data belongs to them,” he wrote. “We don’t mess with it.”\n The privacy policy will also be updated to reflect data sent to Google, Brookins says.\n “Our privacy policy currently has a fairly blanket-like statement in the second paragraph noting we collect data for app usability and app reliability reasons (app crashes, etc..),” he wrote. “Our revised privacy policy will call this out in some additional detail and also name the third party (Google Firebase).”\n Google Analytics for Firebase has rules about what information can be sent to the service, a Google spokesperson wrote in an email to  Fast Company.\n  “Any developer that chooses to use Google Analytics for Firebase is prohibited from passing information, like an email address or phone number, that could personally identify someone to Google, and we use a combination of machine learning and human review to identify health apps and mark them ineligible for ads usage,” the spokesperson wrote.\n Jumbo CEO Valade says he was encouraged by ProudCrowd’s statement and says that if the company updates the app and privacy policy, Jumbo may revise its recommendation not to use the app.\n   Contact tracing, where people potentially exposed to a disease are notified so they can be tested and potentially treated or quarantined, has been seen as a potential way to reduce the spread of COVID-19. Apple and Google have  developed software toolkits to let public health agencies build iOS and Android apps to enable automated phone proximity detection via Bluetooth, and many state and local agencies have begun hiring people to manually trace contacts of those infected with the virus. North Dakota officials have indicated future versions of Care19 will incorporate the new Apple-Google technology. A Google spokesperson indicated the app isn’t currently using that system.\n “This app does not use Google’s Exposure Notification API, which strictly prohibits apps from collecting or using Android’s Advertising ID,” the spokesperson wrote in an email to  Fast Company.\n How well such apps will work, and whether people will install them in sufficient numbers to be useful,  remains an open question, with some surveys indicating people are skeptical of the technology. Experts and activists have also expressed concerns about erroneous results and privacy concerns. A  bill introduced in Congress last week would limit how such data could be used.\n  “Data collected in connection with contact tracing should not be used for any secondary purpose, let alone a commercial one,” wrote Ryan Calo, an associate professor at the University of Washington School of Law and a backer of the proposed law, in an email to  Fast Company.", "posttime": "2020-05-23 03:42:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,冠状病毒,google,病毒,app", "title": "北达科他州的冠状病毒应用程序一直在向Foursquare和谷歌发送数据", "title_en": "North Dakota's COVID-19 App Has Been Sending Data To Foursquare and Google", "transed": 1, "url": "https://www.fastcompany.com/90508044/north-dakotas-covid-19-app-has-been-sending-data-to-foursquare-and-google", "via": "", "real_tags": ["程序", "冠状病毒", "google", "病毒", "app"]}, {"category": "", "categoryclass": "", "imagename": "bb53663700f2be37c2e7c9433c1454d7.jpg", "infoid": 1003316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一场大规模的竞标战之后，这部感觉不错的网络连续剧以高价获得了维亚康姆哥伦比亚广播公司(ViacomCBS)的授权。\nCBS All Access将于今年夏天更名，并将有更多来自维亚康姆CBS投资组合的原创剧集作为支持。在新剧集转移到该公司的多个线性网络之前，它将拥有第一个窗口。虽然克拉辛斯基将继续担任执行制片人，但他不会主持新的剧集。新的主持人将在晚些时候任命，尽管克拉辛斯基将出现在某种形式的直播中。目前还没有确定哪些维亚康姆CBS平台将拥有新的SGN剧集的第二个窗口，以及广播网是否会参与进来。除了新的剧集，维亚康姆哥伦比亚广播公司(ViacomCBS)文件夹内的其他简短内容也将被制作出来。\n克拉辛斯基周四在一份声明中表示，能够与哥伦比亚广播公司(CBS)/维亚康姆(Viacom)合作，能够给这么多人带来一些好消息，我感到无比兴奋和自豪！从第一集开始，我们的目标就是制作一个完全以好消息为主题的新闻节目。我从未想过会加入哥伦比亚广播公司(CBS)这样一家历史悠久的新闻机构。消息人士称，哥伦比亚广播公司娱乐集团(CBS Entertainment Group)总裁乔治·切克斯(George Cheeks)在将克拉辛斯基和新加坡国家电视台(SGN)带入公司方面发挥了重要作用。Chek之前在NBC环球工作了几十年，他于3月下旬接替了乔·伊涅洛(Joe Ianniello)。据信这是他首批重大交易之一。该系列将通过喜剧中心制作公司内部制作，因为该集团还将拥有SGN的所有权股份。\nComedy Central Productions很高兴能与John合作，并通过ViacomCBS的品牌家族将他心爱的一些好消息带给世界各地的观众，“娱乐和安培；青年集团总裁克里斯·麦卡锡(Chris McCarthy)说。在YouTube上播放期间，Krasinski自筹资金并自行制作了每周一集的SGN节目，正如其标题所示，目的是向那些在新颖的冠状病毒大流行中呆在家里的观众传播一些好消息。\n消息人士告诉好莱坞报道，克拉辛斯基最初抵制了出售这部电视剧的冲动，尽管各种各样的追求者打来了一波又一波的电话。Krasinski的团队在SGN的第一集病毒式传播后收到了大量的咨询，追求者包括广播网络和流媒体服务。他最初的计划是继续为YouTube提供的免费和广泛的观众制作SGN。随着这部电视剧继续每周制作病毒式剧集(由Office毕业生和杰克·瑞安明星资助)，企业赞助商开始赠送这部电视剧。例如，美国电话电报公司(AT&amp；T)为令人垂涎的急救人员提供了赠品，而波士顿红袜队(Boston Red Sox)则提供了未来比赛的门票。随着与维亚康姆哥伦比亚广播公司的交易，线性网络的第二个窗口将继续Krasinski的愿景，即让SGN的剧集接触到广泛的观众。\n克拉辛斯基似乎在周日结束了SGN，此前他制作了八集，其中包括办公室工作人员的团聚和汉密尔顿在百老汇的原班人马。在这一集中，克拉辛斯基指出，这部电视剧将休息一下，并感谢观众的灵感。\n在两个月的时间里，Some Good News YouTube频道已经吸引了256万订户，剧集的浏览量高达1700万。\n克拉辛斯基在大约七年前想出了一些好消息的想法，并选择在3月下旬推出它，当时他和数百万其他人一样，在新的冠状病毒大流行中呆在家里。SGN是由Krasinski和他的周日夜制作横幅合作伙伴Allyson Seeger创建和制作的。\n克拉辛斯基已经与维亚康姆哥伦比亚广播公司(ViacomCBS)建立了关系。他目前在亚马逊的“杰克·瑞安重启”(Jack Ryan Reboot)中担任主演，该剧由亚马逊旗下的派拉蒙电视制片厂制作。他还编剧、导演并主演了公司派拉蒙影业的突破性故事片“一个安静的地方”。“幽静的地方”第二部分计划于9月上映，克拉辛斯基将执导并主演“再来一次”。", "note_en": "Following a massive bidding war, the feel-good web series has been licensed to ViacomCBS in a rich deal.\n CBS All Access, which will be rebranded this summer and bolstered with more originals from across the ViacomCBS portfolio, will have the first window for the new episodes before they move to a number of the company&#39;s linear networks. While Krasinski will continue to be involved as an executive producer, he will not host the new episodes. A new host will be named at a later date, though Krasinski will have some sort of on-air presence. It&#39;s yet to be determined which of the ViacomCBS platforms will have the second window for new  SGN episodes and whether the broadcast network will be involved. In addition to the new episodes, other shortform content that will live within the ViacomCBS fold will also be produced.\n   &#34;Could not be more excited and proud to be partnering with CBS/Viacom to be able to bring  Some Good News to so many more people!&#34; Krasinski said Thursday in a statement. &#34;From the first episode, our goal was to create a news show dedicated entirely to good news. Never did I expect to be joining the ranks of such a historic news organization as CBS.&#34;  Sources say CBS Entertainment Group president  George Cheeks was instrumental in bringing Krasinski and  SGN to the company. Cheeks, who previously spent decades at NBCUniversal, took over for Joe Ianniello in late March. This is believed to be one of his first major deals. The series will be produced in-house via Comedy Central Productions as the conglomerate will also have an ownership stake in  SGN.\n &#34;Comedy Central Productions is excited to partner with John and bring his beloved  Some Good News to audiences around the world through ViacomCBS’ family of brands,” said Chris McCarthy, Entertainment &amp; Youth Group president.  During its run on YouTube, Krasinski self-financed and self-produced the weekly  SGN episodes designed to spread, as its title indicates, some good news to audiences who are staying at home amid the novel coronavirus pandemic.\n  Sources tell  The Hollywood Reporter that Krasinski initially resisted the urge to sell the series, despite a wave of incoming calls from a wide variety of suitors. Krasinski&#39;s team received a flood of inquiries following  SGN&#39;s viral first episode, with suitors including broadcast networks and streaming services. His original plan was to continue to make  SGN for the free and wide audience that YouTube provided. As the series continued to produce weekly viral episodes (financed by the  Office grad and  Jack Ryan star), corporate sponsors began to board the series with giveaways. AT&amp;T, for example, provided a giveaway for covid first responders, while the Boston Red Sox supplied tickets to future games. With the ViacomCBS deal, the second window across linear networks will continue Krasinski&#39;s vision of seeing  SGN episodes reach a wide audience.\n Krasinski seemingly concluded  SGN on Sunday after producing eight episodes that included reunions of the  Office crew and the original  Broadway cast of  Hamilton. During the episode, Krasinski noted the series would be taking a break and thanked viewers for the inspiration.\n In two months, the  Some Good News YouTube channel has collected 2.56 million subscribers, with episodes ranging in views of as many as 17 million.\n Krasinski came up with the idea for what became  Some Good New  some seven years ago and opted to launch it in late March when he, like millions of others, was staying home amid the novel coronavirus pandemic.  SGN was created and produced by Krasinski and his Sunday Night production banner partner Allyson Seeger.\n Krasinski already has a relationship with ViacomCBS. He currently stars in Amazon&#39;s  Jack Ryan reboot, which is produced by the company&#39;s Paramount Television Studios. He also wrote, directed and starred in the breakout feature  A Quiet Place for the company&#39;s Paramount Pictures.  A Quiet Place Part II is scheduled to be released in September, with Krasinski attached to again direct and star.", "posttime": "2020-05-23 03:25:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "竞标,krasinski,制作", "title": "约翰·克拉辛斯基的一些好消息在竞标战后出售给维亚康姆哥伦比亚广播公司(ViacomCBS)", "title_en": "John Krasinski's Some Good News Sells to ViacomCBS Following Bidding War", "transed": 1, "url": "https://www.hollywoodreporter.com/live-feed/john-krasinskis-some-good-news-sells-viacomcbs-massive-bidding-war-1295491", "via": "", "real_tags": ["竞标", "krasinski", "制作"]}]