[{"category": "", "categoryclass": "", "imagename": "803cfacc57596712c05252f7ff16cd88.jpg", "infoid": 1067545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "超过10亿条的CVS健康客户留在第三方未命名的供应商的数据库中 - 暴露，无保护，在线。研究人员表示，揭示的数据点可以串联，以创造一个极其个人的医疗状况的快照。\n 毛刺很可能是由于人为错误，安全研究员Jeremiah Fowler周四在网站上的一篇文章中说：换句话说，这可能是猖獗的误解的发病率，这是基于云的储存，导致内部敏感数据的曝光网络。\n 根据Fowler的帖子，Wetter WatePlanet的研究人员 -  Web开发人员和互联网营销人员的门户网站 - 发现了非密码保护的数据库，该数据库没有身份验证，以防止3月21日的未经授权的条目。他们在记录中与Fowler协调他们的发现和同一天，在他们联系CVS健康之后，裸体数据库从公众视图关闭。\n  CVS健康是多家家庭品牌背后的母公司，包括CVS药房零售药房链; CVS Caremark，药房福利经理;和健康保险提供者Aetna。\n CVS发言人证实了研究人员的调查结果，称CVS健康已收到公开可访问的数据库的曝光，该数据库包含不可识别的CVS健康元数据。调查后，他们确定数据库由第三方供应商托管，该公司未披露其名称。该数据库没有包含客户，会员或患者的任何个人身份信息（PII），该公司在一份声明中表示，数据库很快就会被淘汰。\n 随着研究人员的报告表明，客户，会员或患者没有风险，我们与供应商合作，迅速将数据库击败。我们已经解决了供应商的问题，以防止再次发生，并感谢将我们通知我们此事的研究员。 -cvs健康声明。\n  Fowler在他的帖子中表示，实际上有足够的信息来派生客户的PII，包括他们的电子邮件地址。根据研究人员称，数据库的总大小为204 GB。它占11亿枚记录，或精确，1,148,327,940张档案。它们被标记为“生产”并将信息键入搜索栏中，例如数据类型添加到购物车，配置，仪表板，索引模式，更多的更新，订单，从购物车，搜索，服务器中删除。 \n记录还暴露了名为访客ID，会话ID和设备信息的字段，例如客户是否使用iPhone，Android，iPad或台式电脑。团队指出，通过串联数据，他们可以透露可以在网络钓鱼攻击，社会工程或可能用于交叉参考其他行动的网络钓鱼攻击中的电子邮件。\n  同样，文件给出了“清楚地了解配置设置，其中存储数据以及日志记录服务如何从后端操作的蓝图，”根据咨询。\n 在寻找PII时，研究人员对常见的电子邮件扩展进行了几个搜索查询，例如Gmail，Hotmail和Yahoo，他们说。它们在数据集中的每个查询的结果中获得了奖励，表明记录实际上包含了电子邮件地址。福勒说，给定使用部分或所有用户名都格式化了多少个个人电子邮件地址，他能够通过简单地搜索公开公开的电子邮件地址来识别“小型对个人采样。”\n 记录还包含数据类型访客ID和会话ID，指示访问者搜索的项目，包括药物，Covid-19疫苗和其他CVS产品。 Fowler说，所有这些数据都汇编在一起，可以创建有关个人健康的私人细节的快照。\n “假设，可以将会话ID与他们在该会话期间搜索或添加到购物车中的会话ID匹配，然后尝试使用公开的电子邮件识别客户，”他在咨询中说。\n  处理研究人员的CVS代表说，无论在数据库中发现什么电子邮件都没有来自CVS客户账户。相反，他们被访客自己输入了搜索栏 - 大概是错误的。\n “搜索栏捕获并记录输入到网站搜索功能中的所有内容，这些记录被存储为日志文件，”咨询说明。 “在审查CVS站点的移动版本时，它是访问者可能相信他们正在登录其帐户的可能理论，但却真的进入搜索栏中的电子邮件地址。” \n搜索被格式化为事件类型参数，并设置为搜​​索。电子邮件地址是名为查询的参数的值，Fowler继续，“可以解释如何在不打算识别访问者的产品数据库中最终获得许多电子邮件地址。”\n 此外，记录表明，使用的是来自手机和移动设备（如iPhone或Androids）的大多数搜索以及来自桌面计算机的搜索。\n  不幸的是，暴露所有这些信息的活动记录是“必要的邪恶”，团队观察到 - 一个可以导致敏感记录的暴露。\n “跟踪网站或电子商务平台的所有活动有助于为访客和客户提供有价值的见解，”咨询说明。 “此日志记录和跟踪通常可以包含无意中曝光更敏感记录的元数据或错误日志。”\n 公开的搜索日志来自CVS健康和CVS.com上的搜索，并提供了“有价值的分析数据，以查看客户正在寻找的东西，如果他们正在寻找他们想要的产品，”团队表示。其中包括有关配置，应用程序，软件，操作系统和构建信息的数据的可能性：如果如果它们未被划分或过时，则可以识别潜在漏洞的数据。\n 该团队表示，这是网络犯罪分子或对抗性国家可以利用的信息。 “通常，他们使用与合法安全研究人员相同的方法来识别公开暴露的数据，”根据咨询。 “每个信息记录用作难题件，以提供组织的网络或数据存储方法的更大图像。”\n  由于基于云的数据存储的爆炸性增长，PJ Norris（网络安全公司Tridwire）的高级系统工程师PJ Norris表示，这种情况变得太常见了。 “曝光敏感数据不需要复杂的漏洞，并且基于云的数据存储的快速增长在周四通过电子邮件发送到任何人的流程中的流程中的缺点是暴露的。 \n9月份，SpaliTech的2,064次谷歌云桶的调查发现，所有谷歌云桶中的6％都是错误的，为任何人和每个人都留下公开互联网 - 包括来自印度儿童的护照，出生证明和个人档案，和俄罗斯Web开发人员的电子邮件服务器凭据和聊天日志。\n 3月份，艺术和工艺品零售商爱好者留下了138GB的敏感信息，对公共互联网开放 - 包括一系列客户信息 - 由于云桶错误配置。\n “可能不会注意到内部网络上的错误配置数据库，如果注意，可能不会公开，但是当您的数据存储直接连接到Internet时，赌注更高，”Norris指出。 “组织应确定安全地配置所有系统的流程，包括基于云的存储，如Elasticsearch和Amazon S3。一旦进程到位，必须监视系统以进行配置更改。这些是可解决的问题，而且今天存在的工具提供帮助。“\n  Netskope威胁研究总监Ray Canzanese表示，CVS健康曝光是亚马逊Web服务（AWS），Azure和Google Cloud等基础设施 -  AS-Service（IAAS）提供商中常见的。在安全组织，网络ACL（NACLS）和防火墙规则中，常见的错误配置在安全组织，网络ACL（NACLS）和防火墙规则中裁剪。事实上，Netskope最近分析了三个主要IAAS提供商的IAAS环境中的Compute基础设施的公开曝光，发现超过35％的计算实例将至少一个服务涉及到互联网。\n NetSkope建议，为避免此类曝光，组织应自动扫描自己的云环境，以发现并锁定公开的资源。 Canzanese还推荐Zero-Trust网络架构作为一种方法，使员工能够安全地访问云资源，无论它们是在图形或云中托管，而不将它们暴露于Internet。\n 加入威胁普通“提示和策略以获得更好的威胁狩猎” - 周三的现场活动，6月30日在上午2:00与Palo Alto Networks合作。从Palo Alto的单位学习42专家最好捕杀威胁以及如何使用自动化来帮助的最佳方式。免费注册免费。 ", "note_en": "More than 1 billion records for CVS Health customers were left in the database of a third-party, unnamed vendor – exposed, unprotected, online. Researchers said the data points revealed could be strung together to create an extremely personal snapshot of someones’s medical situation.\n The glitch is likely due to human error, security researcher Jeremiah Fowler said in a  post on WebsitePlanet on Thursday: In other words, it’s probably yet another incidence of  rampant misconfiguration that’s plaguing cloud-based storage, leading to exposure of sensitive data on an internal network.\n According to Fowler’s post, researchers at WebsitePlanet – a portal for web developers and internet marketers – found the non-password-protected database, which had no form of authentication in place to prevent unauthorized entry, on March 21. They coordinated with Fowler in documenting their discovery and on that same day, after they contacted CVS Health, the naked database was closed off from public view.\n  CVS Health is the parent company behind multiple household brands, including the CVS Pharmacy retail pharmacy chain; CVS Caremark, a pharmacy benefits manager; and Aetna, a health insurance provider.\n A CVS spokesperson confirmed the researchers’ findings, saying that CVS Health had been notified of the exposure of a publicly accessible database that contained non-identifiable CVS Health metadata. Upon investigation, they determined that the database was hosted by a third-party vendor, whose name the company didn’t disclose. The database didn’t contain any personally identifiable information (PII) of customers, members or patients, the company said in a statement, and the database was quickly taken down.\n As the researcher’s report indicates, there was no risk to customers, members or patients, and we worked with the vendor to quickly take the database down. We’ve addressed the issue with the vendor to prevent a recurrence and we thank the researcher who notified us about this matter. —CVS Health statement.\n  Fowler said in his post that there was in fact enough information to derive customers’ PII, including their email addresses. The total size of the database was 204 GB, according to the researchers. It held 1.1 billion records, or, to be precise, 1,148,327,940 files. They were labeled “production” and included information typed into search bars, such as the data types  add to cart, configuration, dashboard, index-pattern, more refinements, order, remove from cart, search, server.\n The records also exposed fields called Visitor ID, Session ID and device information, such as whether customers were using an iPhone, an Android, an iPad or a desktop PC. The team noted that by stringing together the data, they could reveal emails that could be targeted in a phishing attack, in social engineering, or “potentially used to cross-reference other actions.”\n  As well, the files gave a “clear understanding of configuration settings, where data is stored and a blueprint of how the logging service operates from the backend,” according to the advisory.\n In looking for PII, the researchers performed several search queries for common email extensions, such as Gmail, Hotmail and Yahoo, they said. They were rewarded with results for each query within the dataset, indicating that the records did in fact contain email addresses. Fowler said that, given how many personal email addresses are formatted using portions or all of the user’s name, he was able to identify “a small sampling of individuals by simply searching Google for the publicly exposed email address.”\n The records also contained the data types  Visitor ID and  Session ID, indicating the items that visitors searched for, including medications, COVID-19 vaccines and other CVS products. All of this data, strung together, could have created a snapshot of private details about individuals’ health, Fowler said.\n “Hypothetically, it could have been possible to match the Session ID with what they searched for or added to the shopping cart during that session and then try to identify the customer using the exposed emails,” he said in the advisory.\n  The CVS representative who dealt with the researchers said that whatever emails were found in the database didn’t come from CVS customer accounts. Rather, they were entered into the search bar by visitors themselves – presumably, by mistake.\n “The search bar captures and logs everything that is entered into the website’s search function and these records were stored as log files,” the advisory explained. “When reviewing the mobile version of the CVS site it is a possible theory that visitors may have believed they were logging into their account, but were really entering their email address into the search bar.”\n The searches were formatted as  event type parameters and were set to  search. The email addresses are values for a parameter named  query, Fowler continued, which “could explain how so many email addresses ended up in a database of product searches that was not intended to identify the visitor.”\n In addition, the records show what device customers used, with a majority of the searches coming from phones and mobile devices such as iPhones or Androids, as well as some searches coming from desktop computers.\n  Unfortunately, the activity logging that exposed all this information is a “necessary evil,” the team observed – one that can lead to the exposure of sensitive records.\n “Tracking all activity from a website or ecommerce platform helps build valuable insights about visitors and customers,” the advisory explained. “This logging and tracking can often contain metadata or error logs that inadvertently expose more sensitive records.”\n The exposed search logs were from searches done on both CVS Health and CVS.com, and provided “valuable analytical data to see what customers are looking for and if they are finding the products they want,” the team said. That includes the possibility that data about configuration, applications, software, operating systems and build information were exposed: data that could identify potential vulnerabilities if they were unpatched or outdated.\n That’s information that cybercriminals or adversarial nation-states can exploit, the team said. “Often they use the same methods as legitimate security researchers to identify publicly exposed data,” according to the advisory. “Each record of information serves as a puzzle piece to provide a larger picture of an organization’s network or data-storage methods.”\n  Thanks to the explosive growth of cloud-based data storage, misconfigurations like these are becoming all too common, said PJ Norris, senior systems engineer at cybersecurity company Tripwire. “Exposing sensitive data doesn’t require a sophisticated vulnerability, and the rapid growth of cloud-based data storage has exposed weaknesses in processes that leave data available to anyone,” he said via email to Threatpost on Thursday.\n In September, a survey of 2,064 Google Cloud buckets from Comparitech found that 6 percent of all  Google Cloud buckets are misconfigured, left open to the public internet for anybody and everybody to see – including passports, birth certificates and personal profiles from children in India, and a Russian web developer’s email server credentials and chat logs.\n In March, arts-and-crafts retailer  Hobby Lobby left 138GB of sensitive information open to the public internet – including a slew of customer information – due to a cloud-bucket misconfiguration.\n “A misconfigured database on an internal network might not be noticed, and if noticed, might not go public, but the stakes are higher when your data storage is directly connected to the Internet,” Norris noted. “Organizations should identify processes for securely configuring all systems, including cloud-based storage, like Elasticsearch and Amazon S3. Once a process is in place, the systems must be monitored for changes to their configurations. These are solvable problems, and tools exist today to help.”\n  Ray Canzanese, threat research director at Netskope, said that the CVS Health exposure is common in infrastructure-as-a-service (IaaS) providers such as Amazon Web Services (AWS), Azure and Google Cloud. Common misconfigurations crop up in security groups, network ACLs (NACLs) and firewall rules, he said via email to Threatpost on Thursday. In fact, Netskope recently analyzed public exposure of compute infrastructure in IaaS environments across the three major IaaS providers, and found that over 35 percent of compute instances expose at least one service to the Internet.\n Netskope recommended that, to avoid such exposures, organizations should scan their own cloud environments automatically to discover and lock down exposed resources. Canzanese also recommended zero-trust network architecture  as a means to give employees secure access to cloud resources, whether they are hosted on-prem or in the cloud, without exposing them to the internet.\n Join Threatpost for “  Tips and Tactics for Better Threat Hunting ” — a LIVE event on   Wed., June 30 at 2:00 PM ET  in partnership with Palo Alto Networks. Learn from Palo Alto’s Unit 42 experts the best way to hunt down threats and how to use automation to help.   Register HERE  for free.", "posttime": "2021-06-23 04:23:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户,health,数据库", "title": "CVS健康记录为1.1B客户暴露 ", "title_en": "CVS Health Records for 1.1B Customers Exposed", "transed": 1, "url": "https://threatpost.com/cvs-health-records-billion-customers-exposed/167011/", "via": "", "real_tags": ["客户", "health", "数据库"]}, {"category": "", "categoryclass": "", "imagename": "d975537164e8008bdd210b68f38706d5.jpeg", "infoid": 1067544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub Docs是开源的，您可以通过访问GitHub repo来贡献项目。\n 你可能之前听到了这样的事情，“文档不是优先事项，我们不能只是复制并使用其他人建造并打电话完成的东西？”文档通常是一个陆续的思想，不仅在特征实施中，而且还在写作和策划。事实是，文档可以用软件制作或打破某人的成功。通常，开发人员通过DOCS形成他们的第一次印象，即使在他们将其交给产品之前也是如此。用个性化的参与体验为生活带来文件可以是陈旧的解剖学博客的解毒剂。构建充当产品的Docs。\n   今天，太多的文档网站是静态，过时的，无生命。它们并没有以为与核心产品相同的护理和细节，即使它们通常是核心产品。读者预计会在选项卡后打开选项卡，无休止地搜索并通过详细滚动以查找简单代码示例。\n 如果文档知道您在Windows机器上编写Python应用程序，并且您首选观看视频而不是通过文本读取的读数我希望您能够轻松敏捷地找到文档中的问题的答案。当你被困在一个问题并且转向文档时，当你找到解决方案时，有一段魔法，试试吧，它的工作。在那一刻，你变得畅通无阻，你学习了一些新的东西，你可以继续继续建立你的应用程序。\n 在过去的一年里，我在GitHub上度过了我们的文献团队，我们一直在努力了解开发人员今天面对的挑战。我们希望建立一种更好的经验，鼓励更多，教导而不是假设，混淆，并且是您作为开发人员的个人方式。我们一起学习了一些有助于误解一些痛苦开发人员的关键事情，每天都有一些痛苦的开发者面对：\n 人们很难找到所需的东西：文档没有与产品的正确位置相关联。\n 支持团队依赖于知识管理系统（KM），该系统重复文档而不是引用它们 - 专注于内容存储，检索和评估（而不是最终用户的成功）。 \n开发人员在许多不同的方式中了解不同的东西 - 教程，视频，示例，指南等。Docs今天主要提供静态内容，其中代码示例不是不交互的。\n 人们使用搜索作为导航的方式，当他们深入一篇文章时，他们经常丢失搜索ux。\n 当开发人员陷入困境时，他们想询问其他开发人员的问题＆amp;从他们的同龄人那里得到答案。\n 顺便说一下，如果我们解决这些痛苦点，我们不仅是更好地读取和与文档互动的经验，而且我们还能够提高写作文档的经验。如果你很幸运有一个惊人的技术作家，就像我们在GitHub一样，很重要的是利用他们对产品的深刻了解并为他们提供了编写伟大文档的工具。我们在2020年10月开放了整个GitHub Docs应用程序，其中包括内容，代码，甚至是创作文章的过程。通过以合作，沉浸方式撰写的系统，我们必须建立用户体验来匹配。\n  在与数百名开发人员交谈后，学习他们正在努力的东西，以及他们希望的，我写了一些原则。意图是为了有一些东西可以依赖，我可以随着我的头脑风暴的想法，这些想法可以解决一些挫折开发人员的文件。\n 带代码：开发人员想要编写代码，将代码示例提供为起始块。不要埋葬lede。\n 解决问题（AKA：回答问题）：开发人员来到文档，以了解他们试图解决的问题，挑战或问题的答案。通过多种方法给予他们答案（视频，文本，教程，指南等），因此他们以适用于它们的方式学习解决方案。 \n启用社区：拥抱合作的乐趣，社区的支持，并赋予人们教人的人。  符合用户＆＃39; s需要：文档不应优化，导致支持票证，我们不漏斗开放式票证，我们确保我们的内容符合用户的需求。  鼓励贡献：开源 - 任何人都应该能够为Doc＆amp做出贡献; 帮助提高内容。  保留文档新鲜：软件更改，所以文档应该！ 他们应该感到活着，新鲜和相关。  优化和简化：简单难以实现，我们一直融合并简化我们的平台并访问内容 - 最大限度地减少点击内容。  可衡量的成功：我们正在积极衡量我们的内容是否成功地满足用户需求，并始终如一地提高其疗效。  鼓励戏剧和实验：开发人员来到Docs做很多事情，让他们通过游戏来源地发现并创造性地参与。 “自己试试！” \n媒体无症状＆amp;便携式：开发人员应该能够从他们的终端或其IDE等任何地方调用文档。代码示例应该很容易随身携带并重新使用。\n  下一部分是一个小偷看了产品人的大脑。以下是一系列想法 - 其中一些是对GitHub的文档引起实际改进，但我用它们作为一种引发好奇心的一种方式，并为我们如何为开发人员构建更好的文档而生成想法。\n 我与这些草图的目标是为如何将文档带入更多的社区驱动，开发者 - 第一，可扩展和amp;互动，吸引世界。这个想法是他们是中等无人机（Devs可以从他们所在的地方调用Docs），他们是开源的（任何人都可以轻松为文档做出贡献，这意味着更新我们的发布过程），它们是软件的内容（我们将像软件开发过程的一部分对待内容，而不是次要的）。\n 我想从一个系统中搬到一个专注于我们的内容平台的简洁到一个也突出显示开发人员正在努力的内容的一个系统。当您查看其他学习和内容系统，如条纹，零线或圆形CI，它们会使意图模型周围的内容构成。例如，“开始使用条带的API”，确定进入内容的意图，将电源放入开发人员的手中，因为他们探索和学习。\n 这些草图旨在帮助我们的用户更快地进入正确的地方，并强迫我们作为策展人思考读者正在尝试的事情 - 我们可以基于意图构建，而不是简洁。\n 最后，他们介绍了一个系统，我们可以在我们探索和开始建立它时扩展。所以，有一些我故意专注的东西，但我们需要在某些时候解决，因为它们很重要：\n    我始于教程或指南的文章页面。我首先选择它，因为开发人员经常在看到这些网站的任何其他部分之前了解这些页面，而且感谢推荐链接和Google搜索。 \n此页面背后的想法是尽可能快地将读者进入内容，以便他们可以尝试并自己尝试。该页面分为三部分：左侧浏览教程步骤，突出显示代码示例的正确交互框，底部告诉您接下来的位置，如果您感觉宽容要求反馈。页面中最重要的部分：互动。\n     我与文档交谈的开发人员总是告诉我他们主要互相学习。有时它是通过代码审查，其他时间是通过谷歌曲和阅读其他开发人员的例子。将此反馈取向心脏，我决定与您在文档本身内有关软件或代码的对话。\n      文档是关于学习，人们在很多方面学习。你只有一种方式学习的想法一直似乎是我的小香蕉。有时我是一个听见的学习者，有时我是视觉的。拥抱那个，以及让文档生命的欲望一点点，我决定添加一些视频。\n 此页面与使用代码示例的文章/教程页面类似。如果您宁愿观察有关内容的视频，请单击“视频”选项卡并按播放。该视频将向您展示开发人员通过左侧轨道上的内容中的步骤 - 以及滚动，视频将向该教程的该部分提前前进。\n   因为SSH是文档的一点白鲸（它是Docs.Github.com的最受欢迎的文章页面），我决定更多地探索有关什么将使SSH文章更加友好，但这些布局选项为任何教程工作。这是什么样子：\n    内容站点的搜索和导航通常是相同的，但UX由Intent驱动。\n 让我们从导航开始。为了在GitHub文档页面上了解内容的广度，我们将事物组织成类别。但是，当用户考虑太多的选择时，会出现类别膨胀。这是'汤过道康宁，'当你有100多种选择时，你会选择哪种汤？选择变得如此压倒客户最终放弃。为了打击类别膨胀，我们策划我们为用户提供的服务（我们可以依靠搜索功能来允许读者使用更多精度导航）。当我们积极纠正我们的内容的精度和准确性。这有助于让我们的用户更快地播放到正确的地方，并使我们作为策展人思考读者正在尝试的事情 - 我们可以根据意图构建这些类别，而不是内容简洁。 \n因为导航是该网站的基石，所以我写下了这个草图的一些规则：\n    导航层次结构与内容层次结构合作。产品是顶级，类别是基于意图的策划，主题组织在一个类别中的文章和文章在一个主题中教授概念。上面所看到的是导航在潜入产品区域时如何波动的例子。由于还有一个以上的产品，我们也需要一个看法。\n  在您正在探索该网站时，使用导航（此Mega菜单）以保持您的面向导向并找到新事物。我从观看开发人员学到的东西使用docs.github.com以及使用数据，是人们通常在一个产品区域内 - 他们在同一课程中经常探索产品。但是，如果你想，我们需要让那种行为容易，因为Docs导航是人们发现新的Github产品的一部分！\n 现在在搜索。搜索是一种以更精度导航的方式（而不是浏览）。你有一个想法你正在寻找的东西，你想搜索答案。例如，如果您喜欢我，请经常忘记GitHub SSH的工作原理，因此每当您需要使用它时，您都会搜索SSH文章。搜索也是整个网站体验的基石，所以它应该是前沿和中心。\n    探索这些草图的整个动机是建立一个符合他们所在开发人员的DOC体验。 docs.github.com可以做好组织内容，为您提供访问它的新方法，并自定义为您设计的阅读体验。开发人员文档是产品的一部分，应用程序的扩展名以及代码的一部分。没有它，人们可能会丢失，所以给出航路点很重要，这就是这个系统旨在提供的东西。越魔力“aha！”和“它的工作！”我们可以通过文档激发灵感的时刻，我们越是解锁人们为人们创造性，富有成效的路径，并回到编码业务。\n 如果您认为文档网站不需要优先考虑或者我们不应该投资它们，请询问开发人员他们需要的内容，然后再次思考您可能在不存在的情况下DOCS的沉浸式，互动和吸引力的经验。而不是刚刚制作另一个文档网站（yads），让我们制作站立的经历 - 我们的开发人员应该得到它。 ", "note_en": "GitHub Docs are open source, and you can contribute to the project by visiting the   GitHub repo .\n You’ve probably heard something like this before, “documentation isn’t a priority,   can’t we just copy and use what someone else has built and call it done?” Docs are often an after-thought, not only in feature implementation but also in writing and curation. The truth is that documentation can make or break someone’s success with your software. Often, developers form their first impressions through docs, even before they make it to the product. Bringing documentation to life with a personalized engaging experience can be the antidote to stale, esoteric docs. Build docs that act as the butler to your product.\n   Today, too many documentation sites are static, out-of-date, and lifeless. They aren’t thought of with the same care and detail as the core product, even though they often are a core product. The reader is expected to do too much work, open tab after tab, search endlessly and scroll through verbose articles just to find a simple code example.\n Wouldn’t it be great if the docs knew that you were writing a Python app on a Windows machine and that you preferred watching videos instead of reading through text? I want you to find the answer to your questions in the docs, easily and efficiently. When you’re stuck on a problem and you turn to the docs, there’s a moment of magic as you find the solution, try it out and it works. In that moment you become unblocked, you learn something new and you can move on to keep building your application.\n Over the past year, I’ve spent time with our documentation team at GitHub where we have been working together to understand the challenges that developers face with documentation today. We want to build an experience that works better, inspires more, teaches instead of assumes, confuses less, and is personalized to your needs as a developer. Together, we learned a few key things that have helped misunderstand some of the pain developers face with documentation every day:\n People have a hard time finding what they need: Documentation is not linked from the right places in the product.\n Support teams rely on a knowledge management system (KM) that duplicates the docs instead of referencing them — focusing on content storage, retrieval, and assessment (instead of end-user success).\n Developers learn different things in lots of different ways — tutorials, videos, examples, guides, etc. Docs today mostly offer static content with code examples that aren’t interactive.\n People use search as a way to navigate, and they often lose the search UX when they’re deep into an article.\n When developers get stuck, they want to ask other developers questions &amp; get an answer from their peers.\n By the way, if we solve for these pain points, not only are we making the experience of reading and interacting with the docs better, but we’re also able to improve the experience of writing the docs. If you’re lucky to have an amazing group of technical writers, like we do at GitHub, it’s important to take advantage of their deep knowledge of the product and give them the tools to write great docs. We open sourced the entire GitHub Docs application in October of 2020, this includes the content, the code, and even the process for authoring articles. With a system that’s authored in a collaborative, immersive way, we have to build a user experience to match.\n  After talking with hundreds of developers, learning what they were struggling with, and what they wished for, I wrote up a few principles. The intent was to have something to lean on, that I could use as I brainstormed ideas that may solve some frustrations developers have with documentation.\n Lead with code: Developers want to write code, give them the code examples as starting blocks. Don’t bury the lede.\n Solve the problem (aka: answer the question): Developers come to docs to learn the answer to a question, challenge, or problem they’re trying to resolve. Give them the answer through multiple methods (video, text, tutorials, guides, etc.), so they learn the solution in a way that works for them.\n Enable community: Embrace the fun of collaboration, the support of the community, and empower people teaching people.\n Meet user&#39;s needs: Docs should never be optimized to result in a support ticket, we don’t funnel devs to open tickets, we ensure our content meets the user’s need.\n Encourage contribution: Open source — anyone should be able to contribute to docs &amp; help improve the content.\n Keep docs fresh: Software changes, so should the docs! They should feel alive, fresh, and relevant.\n Refine and simplify: Simplicity is hard to achieve, we consistently refine and simplify our platform and access to content — minimize the clicks to content.\n Measurable success: We are actively measuring if our content successfully meets users’ needs and consistently improves its efficacy.\n Encourage play and experimentation: Developers come to docs to do many things, let them discover and engage creatively through playing around. “Try it yourself!”\n Medium agnostic &amp; portable: Developers should be able to call docs from wherever they are, like their terminal or their IDE. Code examples should be easy to take with you and re-use.\n  This next part is a little peek into the brain of a product person. What follows are a series of ideas — some of these are provoking actual improvements to GitHub’s docs, but I use them as a way to spark curiosity and generate ideas for how we can build better docs for developers in general.\n My goal with these sketches was to set a direction for how we can take docs into a more community-driven, developer-first, extensible &amp; interactive, engaging world. The idea is that they’re medium agnostic (devs can call docs from wherever they are), they’re open source (anyone can contribute to the docs easily, which will mean updating our publishing process), and they’re content as software (we treat the content like it’s part of the software development process, not secondary to it).\n I wanted to move from a system that focuses on the brevity of our content platform to one that also highlights the intent behind what the developer is trying to do. When you look at other learning and content systems like Stripe, Twilio, or Circle CI, they structure the content around intent models. “Get started with Stripe’s API”, for example, pinpoints the intent of the content upon entry, which puts the power into the hands of the developer as they explore and learn.\n These sketches are designed to help our users get to the right place faster, and force us as curators to think about what the reader is trying to do — we can structure based on intent, instead of brevity.\n Finally, they introduce a system that we can expand on as we explore and start building against it. So, there are a few things that I intentionally didn’t focus on, but we’ll need to address at some point because they’re important:\n    I started with the article page for a tutorial or guide. I picked it first because developers often end up looking at these pages before they see any other part of the site and that’s thanks to referral links and Google search.\n The idea behind this page is to get the reader into the content as quickly as possible so that they can experiment and try things themselves. The page is broken down into three parts: the left rail that walks through the tutorial steps, the right interaction box that highlights code examples, and the bottom which tells you where to go next and if you’re feeling generous asks for feedback. The most important part of the page: the interaction.\n     Developers I talk with about documentation always tell me that they primarily learn from each other. Sometimes it’s through code review, other times it’s from googling and reading through other developer’s examples. Taking this feedback to heart, I decided to play around with what it might look like to have a conversation about the software or code from within the documentation itself.\n      Docs are about learning and people learn in many ways. The idea that you learn in only one way has always seemed a little bananas to me. Sometimes I’m an audible learner, sometimes I’m visual. Embracing that, and the desire to make the docs come to life a little bit, I decided to add some video.\n This page works similarly to the article/tutorial page that uses code examples. If you’d rather watch a video about the content, then click the video tab and press play. The video will show you a developer walking through the steps in the content on the left rail — and as you scroll, the video will advance to that part of the tutorial.\n   And because SSH is a bit of a white whale for documentation (it’s the most visited article page for docs.github.com), I decided to explore a bit more about what would make the SSH article a little more friendly, but these layout options work for any tutorial. Here’s what that looks like:\n    Search and navigation are often one in the same for content sites, but the UX is driven by intent.\n Let’s start with navigation. To make sense of the breadth of content on the GitHub documentation page, we organize things into categories. However, category bloat happens when there are too many choices for a user to think about. This is the ‘soup aisle conundrum,’ which can of soup do you choose when you have over 100 options? The choice becomes so overwhelming that the customer eventually gives up. To combat category bloat, we curate what we serve to the user (we can lean on the search features to allow readers to navigate with more precision). When we curate aggressively we increase the precision and accuracy of our content. This helps get our users to the right place faster, and forces us as curators to think about what the reader is trying to do — we can structure these categories based on intent, instead of content brevity.\n Because navigation is a cornerstone for the site, I wrote down some rules for this sketch:\n    Navigation hierarchy works in cooperation with content hierarchy. Products are top-level, categories are curated based on intent, topics organize articles within a category and articles teach concepts in a topic. What you see above is an example of how the navigation fluctuates as you dive into a product area. Since there’s more than one product, we need a view for that, too.\n  As you’re exploring the site, use the navigation (this mega menu) to keep you oriented and find new things. What I’ve learned from watching developers use docs.github.com, and from the usage data, is that people typically stay within one product area — they don’t often explore across products during the same session. But if you wanted to, we need to make that kind of behavior easy, because the docs navigation is part of the way people discover new GitHub products!\n Now onto search. Search is a way to navigate with more precision (as opposed to browsing). You have an idea for what you’re looking for, and you want to search for the answer. For example, if you’re like me you constantly forget how GitHub SSH works, so whenever you need to use it you search for the SSH article. Search is also a cornerstone to the entire site experience, so it should be front and center.\n    The entire motivation for exploring these sketches is to build a doc experience that meets developers where they’re at. Docs.github.com can do a better job of organizing the content, giving you new ways to access it, and customizing a reading experience that is designed for you. Developer documentation is part of the product, an extension of the application, and a part of the code. Without it, people can get lost, so it’s important to give waypoints and that’s what this system is intended to provide. The more magic “aha!” and “it worked!” moments that we can inspire through documentation, the more we’re unlocking a path for people to be creative, productive, and get back to the business of coding.\n If you think that documentation sites don’t need to be prioritized or that we shouldn’t invest in them, just ask a developer what they need, and then go think again about what you might be missing out on if you don’t have an immersive, interactive and engaging experience for docs. Instead of just making Yet Another Docs Site (YADS), let’s make experiences that stands apart — our developers deserve it.", "posttime": "2021-06-23 04:22:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "想到,文档", "title": "也许是时候我们重新想到了文件 ", "title_en": "Maybe it’s time we re-think docs", "transed": 1, "url": "https://kathykorevec.medium.com/building-a-better-place-for-docs-197f92765409", "via": "", "real_tags": ["想到", "文档"]}, {"category": "", "categoryclass": "", "imagename": "8e0538daae4cea7a15c114ed73dc31a3.jpg", "infoid": 1067543, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Cat Contillo是一个骄傲的奇迹自闭症和亨特塞的威胁分析师。她对LGBTQ +权利，自闭症，神经大学，DEI和网络安全的热情。\n  神经大学对不同的人来说意味着不同的东西。这是一种观看神经系统差异的光谱的概念 - 如ADHD，自闭症，诵读诵读，TILETTE和其他认知和发育障碍 - 作为人类脑的自然变化。简而言之，神经大学意识到脑差异只是：差异。\n 我总是意识到我有一个不同的操作系统。这就像在Mac OS上成长，但专门为Windows操作系统制作。直到我被诊断为自闭症，我理解为什么我是我的方式。我的诊断给了我一个目的。这是我与我一起进入工作世界的目的，它帮助我意识到了人们如何成为网络安全行业的人才能够和将是如何发展的。\n   患有自闭症的人有许多固有的特征，非常适合在网络安全中工作。例如，许多患有自闭症的人是模式思想家，并且是高度细节的。这允许某人在威胁狩猎位置找到恶意和非可理性代码之间的细微差异，并捕获自动化工具可能会错过的威胁。我们也有高度的能力，这使我们能够专注于解决问题并坚持其他人可能放弃的复杂问题。\n 当然，我们都有不同的技能，兴趣，优势和劣势。但是有一些特征 - 当赋予正确的支持和环境时 - 可以积极转化为网络安全。\n 当自闭症成年人对技术和网络安全感兴趣时，这尤其如此。他们的兴趣可以补充他们对细节的关注，这可以为一个成功的蓝色团队网络专业人员提供。网络威胁的数量和类型是不断变化的。有些人显而易见，有些是更微妙的。一些恶意软件甚至能够通过使用已创建的应用程序或在计算机上生存的应用程序或可执行文件来“实现土地”。了解这些信息，并了解要寻找的内容以及在哪里磨练，允许神经统一的人一直检查，调查和追捕即使是最持久的威胁。\n  而不是专注于让神经发声的人“不同的东西”，我们应该接受不同思想和观点对网络安全领域带来的好处。让我们面对它：世界将需要更多的网络安全专业人士。确保这些团队的多样性包括拥抱神经化的人。由这些细节导向，规则束缚，逻辑和独立思维者提供的独特人才的混合 - 并且将是 - 网络安全的竞争优势。 \n在网络安全的职业生涯通常需要逻辑，纪律，好奇心和解决问题的能力并找到模式。这是一个为神经发出的人提供广泛的位置和职业道路，特别是对于威胁分析，威胁情报和威胁狩猎的角色。\n Neurodiverse思想通常很好地在大海捞针，小红旗和微小细节中找到针对狩猎和分析潜在威胁的小型细节。其他优势包括模式识别，思考在盒子外，关注细节，敏锐的焦点，有条不紊的思维和完整性。\n 您的团队更加多样化，他们将更加富有成效，创造性和成功。不仅可以才能帮助加强网络安全，采用不同的思想和观点，也可以解决沟通问题，为您的团队和贵公司创造积极影响。\n 据劳动统计局介绍，信息安全分析师的需求 - 网络安全专业人士的普通职业道路 - 预计将增长31％，比其他职业的平均增长率高出4％。虽然网络安全的重要作业不利，但是数百万聪明的人，他们理想适合工作仍未被失业。\n  是时候挑战了合格人才等于神经典卡的假设了。有许多阶梯公司可以采取，以确保包容性并促进归属于工作场所。让我们在一开始就一路开始，专注于招聘帖子。\n 在他们要求的信息和工作要求方面，招聘帖子应该是黑白的。首先制作在所需要的内容中更具包容性和更少的收缩。包括申请人可以要求住宿的联系人电子邮件地址，并通过提供这些住宿来提供更不等的传统方法。\n 传统访谈可能对神经发声的人来说是一个挑战，这通常是就业的第一个障碍。例如，为了缓解一些候选人的神经，您可以提供将作为指导要求的问题列表。更重要的是，不要根据他们缺乏目光接触来判断某人。 \n为了促进工作场所的包容性和归属文化，工作场所应该更加支持不同的需求。 确保各级员工有关如何授权多元化的团队并创建开放和包容性工作场所的知识和理解是至关重要的。 这始于所有员工的多样性，公平，包容性和归属培训。 公司还应该考虑改变他们的沟通风格。 Neurodiverse个人个人不同地沟通，而没有改变您的沟通方式可能导致工作场所的断开连接。  我对寻求闯入网络安全领域的其他神经发声和/或自闭症成年人的建议是继续您的学习，与网络安全专业人士联系，以获得网络目的，永不放弃。 我们越多推进了所有公司的所有方面的意识和包容性 - 小而大 - 成功的机会越多。 ", "note_en": "Cat Contillo is a proud queer autistic and a Threat Analyst II at  Huntress. She&#39;s passionate about LGBTQ+ rights, autism, neurodiversity, DEI and cybersecurity.\n  Neurodiversity can mean different things to different people. It’s a concept that views the spectrum of neurological differences — like ADHD, autism, dyslexia, Tourette’s and other cognitive and developmental disorders — as natural variations of the human brain. In a nutshell, neurodiversity recognizes that brain differences are just that: differences.\n I was always aware of the fact that I had a different operating system. It was like growing up on a Mac OS, but made specifically for Windows OS. It wasn’t until I was diagnosed as autistic that I understood why I am the way that I am. My diagnosis gave me a purpose. It’s a purpose I’ve taken with me into the working world, and it’s helped me realize how vital neurodiverse individuals can and will be to the cybersecurity industry.\n   There are many inherent traits in people with autism that are well suited for working in cybersecurity. For example, many people with autism are pattern thinkers and are highly detail-oriented. This allows someone in a threat-hunting position to find those subtle differences between malicious and nonmalicious code and catch the threats that automated tools might miss. We also have the ability to hyperfocus, which allows us to concentrate on problem-solving and stick with complex issues that other people may abandon.\n Of course, we all have a different set of skills, interests, strengths and weaknesses. But there are some characteristics that — when given the right support and environment — can translate to cybersecurity positively.\n This is especially true when autistic adults are interested in technology and cybersecurity. Their interest can complement their attention to detail, which can make for a successful blue team cyber professional. The number and types of cyber threats are constantly changing. Some are obvious to hunt down, and some are much more subtle. Some malware even has the ability to “live off the land” by using already created applications or executables that live natively on a computer. Knowing this information, and knowing what to look for and where to hone in, allows a neurodivergent person to consistently inspect, investigate and hunt down even the most persistent threats.\n  Instead of focusing on what makes a neurodivergent person “different,” we should embrace the benefits that different minds and viewpoints bring to the field of cybersecurity. Let’s face it: The world is going to need more cybersecurity professionals. Ensuring diversity in these teams includes embracing neurodiversity. Having a blend of unique talents provided by these detail-oriented, rule-bound, logical and independent-thinking individuals is — and will be — a competitive edge in cybersecurity.\n Having a career in cybersecurity typically requires logic, discipline, curiosity and the ability to solve problems and find patterns. This is an industry that offers a wide spectrum of positions and career paths for people who are neurodivergent, particularly for roles in threat analysis, threat intelligence and threat hunting.\n Neurodiverse minds are usually great at finding the needle in the haystack, the small red flags and minute details that are critical for hunting down and analyzing potential threats. Other strengths include pattern recognition, thinking outside the box, attention to detail, a keen sense of focus, methodical thinking and integrity.\n The more diverse your teams are, the more productive, creative and successful they will be. And not only can neurodiverse talent help strengthen cybersecurity, employing different minds and perspectives can also solve communication problems and create a positive impact for both your team and your company.\n According to the  Bureau of Labor Statistics, the demand for Information Security Analysts — one of the common career paths for cybersecurity professionals — is expected to grow 31% by 2029, much higher than the average growth rate of 4% for other occupations. While vital jobs in cybersecurity are going unfilled, millions of smart people who’d be ideally suited for the work remain unemployed.\n  It’s time to challenge the assumption that qualified talent equals neurotypicality. There are many steps companies can take to ensure inclusivity and promote belonging in the workplace. Let’s start all the way at the beginning and focus on job postings.\n Job postings should be black and white in terms of the information they are asking for and the job requirements. Start by making job postings more inclusive and less constrictive in what is being required. Include a contact email address where an applicant can ask for accommodations, and provide a less traditional approach by providing these accommodations.\n Traditional interviews can be a challenge for neurodivergent individuals, and this is often the first hurdle to employment. For example, to ease some candidates’ nerves, you could provide a list of questions that will be asked as a guideline. More importantly, don’t judge someone based on their lack of eye contact.\n To promote an inclusive and belonging culture of neurodiversity in the workplace, the workplace should be more supportive of different needs. It is vital to ensure employees at all levels have the knowledge and understanding on how to empower a diverse team and create an open and inclusive workplace. This starts with diversity, equity, inclusion and belonging training for all employees. Companies should also consider changing their communication style. Neurodiverse individuals communicate differently and not altering the way you communicate could lead to a disconnect in the workplace.\n My advice to other neurodivergent and/or autistic adults looking to break into the cybersecurity field is to continue your learning, connect with cybersecurity professionals for networking purposes and never give up. The more we push for awareness and inclusion in all aspects of all companies — small and large — the more opportunities there will be for success.", "posttime": "2021-06-23 03:45:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大学,cybersecurity,网络安全", "title": "通过神经大学解决网络安全技能差距 ", "title_en": "\n\t\t\t\tAddressing the cybersecurity skills gap through neurodiversity\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/22/addressing-the-cybersecurity-skills-gap-through-neurodiversity/", "via": "", "real_tags": ["大学", "网络安全"]}, {"category": "", "categoryclass": "", "imagename": "727373213181bbefb2fbbc90d94e5b33.jpg", "infoid": 1067542, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zoox周二发布了安全报告，旨在向其定制电动自治车辆提供新的洞察力，并更详细地描述各种设计细节，旨在防止崩溃和保护。\n “如你所知，每个人都在谈论的事情，是做AVS的理由的一部分是因为安全，安全，安全，但他们从未到达下一个子弹（点）吧？你将实际做些什么来防止这些崩溃，拯救那些生命？“ Mark Rosekind，该公司的首席安全创新官员和国家公路交通安全管理局前负责人在最近的面试中告诉TechCrunch。\n   Zoox有点不同于其竞争对手。它不仅仅是开发自动驾驶软件堆栈。该公司负责创建按需乘车共享应用程序和车辆本身。 Zoox还计划拥有，管理和运营其Robotaxi舰队。\n Zoox于12月推出电动，自主罗布西，它由地上建造的 - 一种装载传感器的立方体车辆，没有方向盘和天窗，能够以每小时高达75英里的速度运输四个人。当时，Zoox在四位座位上共享了一些规格，包括面对面的对称座位配置，类似于火车旅行者可能遇到的东西，并且该公司所说的133千瓦时电池允许它每次充电，最多可持续16小时。但并非一切都被揭示，特别是关于如何保护车辆中的乘客以及行人，骑自行车者和其他司机的细节，它将与之共享道路。\n 要清楚，Zoox不是唯一发行安全报告的AV公司。自愿安全自我评估报告或vssas在行业中变得相当普遍。这些志愿安全报告包含在NHTSA自动化驾驶系统VSSA披露指数中，应该涵盖12个区域，包括车辆的设计，崩溃模拟场景，测试的基准以及乘员和其他道路使用者的保护措施。\n Zoox的第一个安全报告于2018年出版，其中概述了公司的“预防和保护”哲学。这一最新揭示了Zoox如何计划满足其安全目标，包括关于车辆设计的具体细节。在这种最新的一个提示中，更多的安全报告即将到来 - 包括有关其碰撞避免系统的详细信息以及用于与其他道路使用者沟通的车辆使用的照明系统。\n Zoox已经设计并建造了100多种安全创新，进入其有目的的车辆。 Rosekind分享细节，其中九分为三类：驾驶控制，没有单点故障和骑手保护。 \nZoox的目的地车辆具有独立的制动和非活动悬架系统，这意味着每个制动器具有其自己的电子控制单元，允许更多地控制道路上的牵引力，重量分布和主动悬架。所有这些都转化为较短的停止距离。\n 车辆还有四轮转向，罗斯克宁今天的任何车都不存在，并且是双向的。四轮转向允许车辆同时调整它在头部的位置以及其内部的位置。\n “一旦我们的软件确定了车辆的路径，它就会保持下降到厘米的精度 - 即使在速度通过遏制速度，罗斯克汀解释说。\n 四轮转向与车辆对称设计相结合允许其双向旅行。双向能力意味着没有更多的U形或三分转弯，两个机动更复杂，耗时，并且可以使乘员更容易迎面而来的交通。\n Rosekind表示，该公司的设计目标是其安全关键系统将没有单一的失败。例如，车辆有两个电力。电机，驱动系统和电池彼此配合工作。如果系统中的一个组件发生故障，则另一个将接管另一个组件。\n 该车辆还拥有两节电池以及一种监控所有硬件，软件和固件的安全诊断系统。像激光器一样的传感器和。雷达也被放置在车辆的四个角上，每个射线提供270度的视场。\n 诊断系统超出监控，并将减轻它识别的故障或性能问题。例如，如果传感器从损坏或碎片中具有降低的性能，则它将激活车辆上的清洁系统或将其从双向转向单向转向单向，因此如果它基本上无关紧要，那么如果它被遮挡，则传感器在遮挡的位置，Rosekind解释。 \n“失败的操作意味着它会继续骑行，让你出去，然后去照顾任何问题，或者拉到一个安全的地方，”他说。\n   Zoox的目标是其车辆，以满足车辆中每个座位的五星碰撞保护。罗斯克宁目前正在经历车辆正在经历碰撞测试，并补充说，这是“越来越好，几乎完整”。\n 该公司还设计了一种新型安全气囊系统，其中包含五种不同的安全气囊。窗帘安全气囊位于车辆的每一侧，正面分为两部分，以保护头部，颈部和胸部。还有后座和侧面座椅安全气囊。\n 在系统内部是一种安全气囊控制单元，可以监视碰撞的位置以及速度，并确定哪些安全气囊和何种顺序部署。它们立即而不是每个安全气囊部署，它们会根据碰撞位置和影响的严重程度来充气。\n 最后，车辆在座椅上有传感器，扣且甚至涂在安全带的织带上的涂层，以便能够判断乘客是否使用安全带。罗斯基德说，车辆不会开始，直到每个人的弯曲。 ", "note_en": "Zoox  issued a safety report Tuesday that aims to give new insight into its custom electric autonomous vehicle and describes in greater detail various design details aimed at preventing crashes and protecting if they do.\n “As you know, and something everybody keeps talking about, is that part of the rationale for doing AVs is because of safety, safety, safety, but they never get to the next bullet (point) right? What are you going to actually do to prevent those crashes, to save those lives?” Mark Rosekind, the company’s chief safety innovation officer and former head of the National Highway Traffic Safety Administration, told TechCrunch in a recent interview.\n   Zoox is a bit different from its rivals. It isn’t just developing the self-driving software stack. The company is responsible for creating the on-demand ride-sharing app and the vehicle itself. Zoox also plans to own, manage and operate its robotaxi fleet.\n Zoox unveiled in December the  electric, autonomous robotaxi it built from the ground up — a cube-like vehicle loaded with sensors, no steering wheel and a moonroof that is capable of transporting four people at speeds of up to 75 miles per hour. At the time, Zoox shared a few specs on the four-seat vehicle, including the face-to-face symmetrical seating configuration, similar to what a train traveler might encounter, and the 133 kilowatt-hour battery that the company said allows it to operate for up to 16 continuous hours on a single charge. But not everything was revealed, particularly details about how it would protect occupants in the vehicle as well as the pedestrians, cyclists and other drivers it will be sharing the road with.\n To be clear, Zoox is not the only AV company issuing safety reports. Voluntary safety self-assessment reports, or VSSAs, have become fairly common in the industry. These voluntary safety reports, which are included in  NHTSA’s Automated Driving Systems VSSA Disclosure Index, are supposed to cover 12 areas, including the vehicle’s design, crash simulation scenarios, benchmarks for testing as well as protective measures for occupants and other road users.\n Zoox’s  first safety report came out in 2018, which outlined the company’s “prevent and protect” philosophy. This latest one reveals how Zoox plans to meet its safety goals, including specific details on the design of the vehicle. And more safety reports are coming — per a few hints in this latest one — including details about its collision avoidance system and the lighting system the vehicle uses for communicating with other road users.\n Zoox has designed and built more than 100 safety innovations into its purposeful vehicle. Rosekind shared details on nine of them that fall into three categories: driving control, no single point of failure and rider protection.\n   Zoox’s purpose-built vehicle has independent braking and inactive suspension system, which means that each of the brakes has its own electronic control unit, allowing for more control over traction on the road, weight distribution and an active suspension. All of that translates to shorter stopping distances.\n The vehicle also has four-wheel steering, which Rosekind noted doesn’t exist on any car on the road today, and is bidirectional. Four wheel steering allows the vehicle to simultaneously adjust where it is headed and its position within the lane.\n “Once our software has determined the path for the vehicle, it’ll stay on that path down to centimeters accuracy — even at speed through a curb, Rosekind explained.\n The four-wheel steering combined with the vehicle’s  symmetrical design allows for it to travel bidirectionally. The bidirectional capability means no more U-turns or three-point turns, two maneuvers  that are more complex, time consuming and can make occupants more vulnerable to oncoming traffic.\n Rosekind said the company’s design objective was that there would be no single point of failure for its safety critical systems. For instance, the vehicle has two powertrains. The motors, drive systems and batteries work in conjunction with each other. If one component in the system fails, the other one will take over.\n The vehicle also has two batteries as well as a safety diagnostics system that monitors all of the hardware, software and firmware. Sensors like lidar and. radar are also placed on the four corners of the vehicle, each one which provides a 270-degree field of view.\n The diagnostic system goes beyond monitoring and will  mitigate a failure or performance problem that it identifies. For instance, if a sensor has degraded performance from damage or debris, it will activate a cleaning system on the vehicle or turn it from  bidirectional to unidirectional, so the sensor in a position where basically doesn’t matter if it is obscured, Rosekind explained.\n “Failsafe operational means it’s going to continue the ride, let you out, and then go take care of whatever the issue is, or pull over to a safe spot,” he said.\n   Zoox’s goal is for its vehicle to meet a five-star crash protection for every seat in the vehicle. The vehicles are currently going through crash testing now, Rosekind said, adding that it is “going quite well and almost complete.”\n The company also designed a new kind of airbag system that contains five different airbags. Curtain airbags are on each side of the vehicle, a frontal one is divided in two parts to protect the head, neck and chest. There are also rear and side seat airbags.\n Within the system is an airbag control unit that can monitor where a collision is coming as well as the velocity and determine which airbags and in what order to deploy. Instead of every airbag deploying at once, they will inflate based on the collision location and the severity of the impact.\n Finally, the vehicle has sensors in the seat, the buckle and even the coating on the webbing of the seatbelt to be able to tell if passengers are using the seatbelt. The vehicle will not start until everybody’s buckled up, Rosekind said.", "posttime": "2021-06-23 03:45:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,amazon,亚马逊,zoox,owned", "title": "亚马逊拥有的Zoox如何设计自动驾驶车辆，以防止崩溃并保护 ", "title_en": "\n\t\t\t\tHow Amazon-owned Zoox designed its self-driving vehicles to prevent crashes and protect if they do\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/22/how-amazon-owned-zoox-designed-its-self-driving-vehicles-to-prevent-crashes-and-protect-if-they-do/", "via": "", "real_tags": ["设计", "amazon", "亚马逊", "zoox", "owned"]}, {"category": "", "categoryclass": "", "imagename": "3a4f1314a5220a4b4a8dd0b4ce68ee2b.jpg", "infoid": 1067541, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter正在打开应用程序，以便对其超级遵循和票务空间的有限测试。基于美国的用户可以通过Twitter的移动应用程序分别适用于每个程序;超级遵循限制为iOS，而iOS和Android可提供票务空间。\n Twitter将选择一个“小组”用户来测试其新的货币化功能，这两者都在今年早些时候宣布。 Super以下功能让用户收取2.99美元，4.99美元或每月9.99美元，以便访问独家内容。售票空间让他们收取1美元至999美元，以便访问Twitter的社交音频室之一，提供额外的功能，如设置房间尺寸的盖子。用户可以通过在移动应用程序侧栏中查看新的“Mometization”选项来查看它们是否有资格申请。\n   测试集团参与者最初将保留97％的钱，他们用票务空间或超级换取，在IOS和Android收取适用于应用内购买的费用之后。如果用户在这两个系统上总共50,000美元，则Twitter将从3％增加到20％。\n 早期，自上个月预览了售票席以来，已经增加了更慷慨的收入拆分。今天，高级产品经理Esther Crawford推断了“我们希望确保新兴的声音能够赚钱，这就是为什么他们有资格获得更大的股票开始。 ...从超级赛后获得$ 50k +票据和售票空间显示您从这些功能中获得了价值，并且他们帮助您成为真实的。“\n  Twitter的20％的佣金低于一些订阅平台。亚马逊拥有的视频服务抽搐从订阅中削减了50％，而YouTube则收取30％的会员费。费用也与唯一的20％相称。但它大幅高于10％的通讯平台委员会的委员会或者会员平台Patreon的5％基本率，尽管这些服务都需要额外的支付处理费。虽然Facebook在2018年推出了订阅服务，但它表示不会采取任何佣金（除了苹果和谷歌的应用成本之外）直到2023年。 ", "note_en": "Twitter is opening applications for a limited test of its Super Follows and Ticketed Spaces features. US-based users can apply separately for each program through Twitter’s mobile app; Super Follows are restricted to iOS, while Ticketed Spaces are available on iOS and Android.\n Twitter will select a “small group” of users to test its new monetization features, both of which were announced earlier this year. The  Super Follows feature lets users charge $2.99, $4.99, or $9.99 per month for access to exclusive content.  Ticketed Spaces lets them charge between $1 and $999 for access to one of  Twitter’s social audio rooms, and it offers extra features like setting a room size cap. Users can see if they’re eligible to apply by checking a new “Monetization” option in the mobile app sidebar.\n   Test group participants will initially keep 97 percent of the money they make with Ticketed Spaces or Super Follows, after the fee that iOS and Android charge for in-app purchases. Twitter will increase its cut from 3 percent to 20 percent if a user makes a total of $50,000 on both systems.\n That early, far more generous revenue split has been added  since a preview of Ticketed Spaces last month. Today, senior product manager Esther Crawford tweeted that “we want to ensure that emerging voices are able to earn money, which is why they’ll be eligible to earn a larger share starting out. ... Earning $50K+ from Super Follows and Ticketed Spaces shows that you’re getting value from these features and that they’re helping you make real .”\n  Twitter’s 20 percent commission is lower than  that of some subscription platforms. Amazon-owned video service Twitch takes a 50 percent cut from subscriptions, and YouTube charges 30 percent of membership fees. The fee is also commensurate with OnlyFans’ 20 percent. But it’s substantially higher than the 10 percent commission from newsletter platform Substack or the 5 percent base rate of membership platform Patreon, although both those services require additional payment processing fees. While Facebook introduced a subscription service in 2018, it says it won’t take any commission (besides Apple and Google’s in-app purchase costs) until 2023.", "posttime": "2021-06-23 03:37:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打开,iap", "title": "Twitter打开申请以测试票务空间，超级遵循的“少数用户”，如果制作<$ 50K，他们将在IAP削减后保留97％的收入 ", "title_en": "Twitter opens applications to test Ticketed Spaces and Super Follows for “small number” of users, who will keep 97% of revenue after the IAP cut if making <$50K", "transed": 1, "url": "https://www.theverge.com/2021/6/22/22545167/twitter-opens-super-follows-ticketed-spaces-new-feature-test-application-ios-android?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["打开", "iap"]}]