[{"category": "", "categoryclass": "", "imagename": "07cd10f76c1d74843310656696204cb4.jpg", "infoid": 1069348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了给少数亿万富翁太空探索者的梦想泼冷水，美国收紧了对“宇航员”一词的定义。美国联邦航空管理局 (FAA) 的新规定规定，有希望的宇航员必须成为机组人员的一员，并为太空飞行安全做出贡献。这意味着杰夫·贝佐斯和理查德·布兰森爵士在美国政府眼中可能还不是宇航员。商业宇航员之翼计划的更新于周二宣布——同一天，亚马逊的贝佐斯先生乘坐蓝色起源火箭飞往太空边缘。要获得商业宇航员的资格，太空爱好者必须在地球表面上方 50 英里（80 公里）处飞行，而贝佐斯先生和布兰森先生都做到了这一点。但除了高度之外，该机构表示，未来的宇航员还必须“在飞行期间展示了对公共安全至关重要或有助于人类太空飞行安全的活动”。美国联邦航空局在一份声明中表示，这些变化使机翼计划更符合其在商业太空飞行期间保护公共安全的作用。\n7 月 11 日，理查德爵士乘坐维珍银河的太空船二号飞到太空边缘进行测试，然后在明年允许客户登机。贝佐斯先生和其他三名乘坐 Blue Origin 飞船的机组人员可能对这个梦寐以求的头衔的要求较低。在发射前，Blue Origin 首席执行官鲍勃史密斯表示，在自动驾驶汽车上，“机组人员真的无事可做”。那些希望拥有商业翅膀的人也需要为他们提名。美国联邦航空局发言人告诉 CNN，他们目前没有审查任何提交的文件。在美国还有两种获得宇航员翅膀的方法——通过军队或美国宇航局。贝佐斯先生和理查德爵士在飞行后发现的翅膀是他们自己公司定制的别针。然而，对于理查德爵士、贝佐斯先生和任何希望被承认为宇航员的未来观星者来说，仍然存在一线希望。新命令指出，荣誉奖项可以根据功绩授予 - 由 FAA 的副局长酌情决定。\n1960 年代初期，宇航员小艾伦·谢泼德 (Alan Shepard Jr) 和维珍·格里森 (Virgin Grissom) 因参与了水星七号计划，首次获得了宇航员翅膀。", "note_en": "In a move that pours cold water on the dreams of a few billionaire space explorers, the US has tightened its definition of the word &#34;astronaut&#34;.\n New Federal Aviation Administration (FAA) rules say astronaut hopefuls must be part of the flight crew and make contributions to space flight safety.\n That means Jeff Bezos and Sir Richard Branson may not yet be astronauts in the eyes of the US government.\n  The Commercial Astronaut Wings programme updates were announced on Tuesday - the same day that Amazon&#39;s Mr Bezos flew aboard a Blue Origin rocket to the edge of space.\n To qualify as commercial astronauts, space-goers must travel 50 miles (80km) above the Earth&#39;s surface, which both Mr Bezos and Mr Branson accomplished.\n  But altitude aside, the agency says would-be astronauts must have also &#34;demonstrated activities during flight that were essential to public safety, or contributed to human space flight safety&#34;.\n  In a statement, the FAA said that these changes brought the wings scheme more in line with its role to protect public safety during commercial space flights.\n On 11 July,  Sir Richard flew on-board Virgin Galactic&#39;s SpaceShipTwo to the edge of space as a test before allowing customers aboard next year.\n Mr Bezos and the three other crew members who flew on Blue Origin&#39;s spacecraft may have less claim to the coveted title. Ahead of the launch, Blue Origin CEO Bob Smith said that &#34;there&#39;s really nothing for a crew member to do&#34; on the autonomous vehicle.\n Those wishing for commercial wings need to be nominated for them as well. An FAA spokesperson told CNN they are not currently reviewing any submissions.\n  There are two other ways to earn astronaut wings in the US - through the military or Nasa.\n  The wings spotted on Mr Bezos and Sir Richard following their flights were custom-made pins by their own companies.\n However, a glimmer of hope remains for Sir Richard, Mr Bezos and any future stargazers hoping to be recognised as astronauts.\n The new order notes that honorary awards can be given based on merit - at the discretion of the FAA&#39;s associate administrator.\n Astronaut wings were first awarded to astronauts Alan Shepard Jr and Virgin Grissom in the early 1960s for their participation in the Mercury Seven programme.", "posttime": "2021-07-24 07:19:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,贝索斯,branson,宇航员", "title": "美国称贝索斯和布兰森还不是宇航员", "title_en": "Bezos and Branson not yet astronauts, US says", "transed": 1, "url": "https://www.bbc.com/news/world-us-canada-57950149", "via": "", "real_tags": ["美国", "贝索斯", "branson", "宇航员"]}, {"category": "", "categoryclass": "", "imagename": "564282d1f307a7fe0f231d2f0bb3f6cb.jpg", "infoid": 1069347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的目标是为开发人员策划和创建资源来构建、开发和扩展应用程序，以推动积极的业务影响。对于每一期，我将从开发人员的角度探索主题，并提供一些相关资源的链接，供读者深入挖掘。此外，讨论构建现实世界高增长工程产品并围绕其工作开发复杂框架的工程师的经验。如果您有任何我们可能感兴趣的反馈、即将举行的活动、产品发布、职位空缺或编码竞赛、激动人心的内容，请通过下面的电子邮件与我们联系。对于开发者社区来说，这是有趣的一周。自从引入 GitHub 的 Copilot 以来，我们看到了双方的争论——用户欢迎公共回购和自动完成代码的开放性，而另一方则担心高质量的编程和侵犯版权。副驾驶是否会助长传统软件行业的衰落？好吧，让我们拭目以待。 “启用副驾驶”又如何是祸与福？ - GitHub 和 OpenAI 发布了 Copilot，这是一种 AI 助手，可以通过为他们的软件解决方案生成或自动完成代码来帮助编码人员。这对软件工程行业，尤其​​是开发人员和测试人员意味着什么？规划和估算大型软件项目 - 如果您是一家快速扩展公司的工程经理，Tom Russell 将讨论您将如何为一些主要项目进行估算。内存模型 - 在本系列中，Russ Cox 将硬件内存模型分为 3 个部分，它们有何不同，以及如何克服这些差异以确保程序在 CPU 平台上的行为一致。在中期初创公司建立数据团队 - Erik Bernhardsson 主要讨论了如果您在中期初创公司发展小型数据团队可能会遇到的组织挑战。\nPegasus 项目 — 只需向目标设备拨打 WhatsApp 电话，即可在手机上安装 Pegasus 代码。最近，NSO Software 开始利用 Apple 的 iMessage 中的漏洞，使其后门访问数亿部 iPhone。超过 50,000 个电话号码可能成为恶意软件的目标。 [ 卫报 ] 亚马逊为 Alexa 设备推出了 50 多项新功能，以推动开发人员的增长，包括技能卡、API 小部件等。 [ Alexa Skills Kit 博客] TechCrunch 是否认为开源即将结束？这篇文章是在明尼苏达大学的研究人员找到一个系统来自动检测开源中的各种类型的错误之后写的，使用 Linux 内核作为测试用例。 [阅读] DevRev 正在构建一个 API 优先的以开发人员为中心的 CRM，它利用数据、设计和机器智能来授权开发人员构建、支持和发展他们的业务。 event.io 是一种工具，可让您从 Slack 管理工程事件，确保所有公告、更新和角色分配都可以在一个地方进行。 AlgoExpert 是一个领先的平台，可帮助掌握在高速增长公司的编码面试中测试的基本算法和数据结构。 Kelsey Hightower 是 Google 的首席工程师，他建议如何将纪律和热情结合起来，以帮助您作为自学成才的开发人员在技术领域取得成功。\n据说在欧盟为程序员提供内部开发人员培训是一个蓬勃发展的行业。 [阅读] 学习 Python 101！ Python 简介，要了解更多介绍，请单击此处获取免费的交互式 Python 教程。从工程师到 CEO：如何创办一家科技公司：Taavi Rehemägi 讲述了他从软件工程师到 CEO 再到 Dashbird 的故事。 [听] Canva 的工程师和分析师如何扩展数据平台以跟上增长？采访 Canva 的数据工程师 Krishna Naidu。 [观看] Kafka 亚太峰会将于 2021 年 7 月 27 日至 28 日以虚拟方式举行。点击此处注册。 Build by SkipTheLine 将帮助印度开发商在 4 周内启动一个辅助项目。申请截止日期为 7 月 25 日。单击此处注册（仅开放 50 个席位）。 Techstars Equitech Accelerator 宣布成立 Powerhouse Venture Team，以通过投资、指导和指导经验为创始人提供支持。而且，他们的国内和国际网络将帮助覆盖全球的创始人。要申请，请单击此处了解更多信息。\nReddit 的开发者平台计划旨在授权其用户使 Reddit 上的社区尽可能精彩。 [在此申请] 今年前 6 个月，UserLeap 的基础架构处理了超过 820 亿次 API 请求。如果您对构建可扩展基础架构的挑战感兴趣，请在此处开放职位！您是否看到您认为我们应该在时事通讯中包含的内容？建议一个链接。", "note_en": "We aim to curate and create resources for developers to build, develop, and scale applications to drive positive business impact. With each issue, I will be exploring topics from the developer’s point of view, with a few links to relevant resources for the reader to dig deeper. Also, discuss the experiences of engineers who build real-world high-growth engineering products and developed complex frameworks around their work.\n If you have any feedback, upcoming events, product launches, job openings or coding competitions, exciting content, that might interest us, please find the email below to reach us.\n  It’s been an interesting week for the developer community. Since the introduction to GitHub’s Copilot, we have seen debate on both sides - users who welcome the openness of public repos &amp; auto-completing code, and the other side worried about quality programming and  copyright infringement. Will the copilot contribute to the  fall of the traditional software industry? Well, let’s wait and see.\n    “Enable Copilot” and how is it a   curse and a blessing ? - GitHub and OpenAI have announced Copilot, an AI assistant that can assist coders by generating or autocompleting code for their software solutions. What does this mean for the software engineering industry, especially developers and testers?\n Planning and Estimating Large-Scale Software Projects - If you’re an engineering manager for a fast scaling company, Tom Russell discusses how you will be expected to produce estimates for some major projects.\n Memory Models - In this series, Russ Cox breaks down hardware memory models in 3 parts, how they differ, and how to overcome those differences to ensure the programs behave consistently across CPU platforms.\n Building a data team at a mid-stage startup - Erik Bernhardsson discusses primarily organizational challenges that could happen if you are brought in to grow a tiny data team at a mid-stage startup.\n    Pegasus Project — Simply by placing a WhatsApp call to a target device, Pegasus code could be installed on the phone. More recently NSO Software has begun exploiting vulnerabilities in Apple’s iMessage, giving it backdoor access to hundreds of millions of iPhones. More than 50,000 phone numbers are potentially targeted by malicious software. [ The Guardian]\n Amazon unveils over 50 new features for Alexa devices to drive growth for developers including Skill cards, API widgets, etc. [ Alexa Skills Kit Blog]\n Does TechCrunch think that the  end of Open Source is near? This article is written in the aftermath of University of Minnesota researchers finding a system to automatically detect various types of bugs in open source, using the Linux kernel as a test case. [ Read]\n    DevRev is building an API-first dev-centric CRM that leverages data, design, and machine intelligence to empower developers to build, support, and grow their business.\n incident.io is a tool that lets you manage engineering incidents from Slack, ensuring all announcements, updates and role allocation can happen in one place.\n AlgoExpert is a leading platform that helps to master the essential algorithms and data structures that are tested in coding interviews of hyper growth companies.\n    Kelsey Hightower, a principal engineer at Google advises on how to bring  discipline plus passion can help you succeed in tech as a self-taught developer.\n In-house developer training for programmers in the EU is said to be a booming industry. [ Read]\n Learn Python 101!  Introduction to Python, and to learn more than introduction,  click here for free interactive Python Tutorial.\n    From Engineer to CEO: How to Start a Tech Company: Taavi Rehemägi tells his story about going from software engineer to CEO to Dashbird. [ Listen]\n How do Canva’s engineers and analysts scale data platforms to keep up with growth? Interview with Canva’s Data Engineer Krishna Naidu. [ Watch]\n    Kafka Summit APAC will be hosted virtually from July 27 - 28, 2021.  Click here to register.\n Build by SkipTheLine will help Indian developers to launch a side project in 4 weeks. Application deadline by 25th July.  Click here to register (open for 50 seats only).\n Techstars Equitech Accelerator Announces Powerhouse Venture Team to support founders with investment, coaching, and mentorship experience. And, their national and international networks will help reach founders across the globe. To apply,  click here to learn more.\n    Reddit’s developer platform initiative is about empowering its users to make communities on Reddit as awesome as possible. [ Apply here]\n  In the first 6 months of the year, UserLeap’s infrastructure has processed over 82 Billion API requests. If you’re interested in the challenges of building a scalable infrastructure, open positions  here!\n        Did you see something you think we should include in our newsletter?  Suggest a link.", "posttime": "2021-07-24 07:18:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "digest,开发人员", "title": "Startup Digest Developer – 问题 #1", "title_en": "Startup Digest Developer – Issue #1", "transed": 1, "url": "http://developer.startupdigest.com/issues/startup-digest-developer-issue-1-95275", "via": "", "real_tags": ["digest", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "7e4a8f1b9b2ae62f86a145c180bddbbc.jpg", "infoid": 1069346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "事实核查：错误声称杰夫贝索斯是外星人，爬行动物利用阴谋论声称：杰夫贝索斯的脖子上有一张外星人的脸，证明他不是人类 7月初，与微软取消的政府合同让前亚马逊首席执行官杰夫贝索斯更富有。这位亿万富翁财富的激增激发了社交媒体上的猜测和阴谋论——其中一些读起来就像科幻电影的情节。 7 月 14 日发布在 YouTube 上的一段视频宣传贝佐斯是外星人和爬行动物的毫无根据的说法。该视频由 YouTube 用户 Gina Maria Colvin Hill 发布，标题为“我不确定他是否是人类！”在 Facebook 上收到了数千次浏览。 “那是他脖子上的外星人，”她在视频中说。 “看看他脖子上的那两只眼睛。这个杰夫贝索斯脖子上有一个外星人。”她声称贝索斯“头上戴着橡胶面具”，并辩称“他的手甚至看起来也很假。” “他是爬行动物！”她说，“我不认为他是人类。”\n但没有证据表明贝索斯的脖子上住着外星人——或者说这位亿万富翁是一只爬行动物。该视频引用了几个古怪的、未经证实的阴谋论。自 1990 年代以来，阴谋论者提出了一个毫无根据的观点，即世界是由伪装成人类的爬行动物精英秘密经营的。许多富裕的名人，如马克扎克伯格和贝索斯，都是这些主张的目标。在过去的几年里，QAnon 阴谋论毫无根据地声称世界是由一个由食人、恋童癖精英组成的秘密阴谋集团经营的，重新点燃了网上对富人和名人的怀疑。 Colvin Hill 定期发布视频，宣传涉及富人、僵尸、疫苗和 QAnon 的阴谋论。正如《今日美国》和其他媒体此前报道的那样，这些阴谋论没有证据支持。 YouTube 视频称贝索斯是外星人，因为他脖子上的皱纹看起来像是外星人的脸，而且他脸上的皮肤“太光滑了”。但完整的视频讲述了一个不同的故事。本视频中使用的贝索斯镜头来自他于 2018 年 9 月 13 日对非营利性商业组织华盛顿特区经济俱乐部的采访。在整个采访过程中，当贝佐斯移动脖子时，皱纹也随之移动。在几个点上，他伸长了脖子，没有明显的皱纹，科尔文·希尔认为这是一张外星人的脸。据《大英报》报道，贝索斯 1964 年出生于新墨西哥州阿尔伯克基，父母当时并不富裕。自亚马逊于 1990 年代推出以来，他一直在公众视野中。\n在他的公共生涯中，没有任何有信誉的报道质疑他是否是人类。 《今日美国》无法找到任何科学证据表明爬行动物或外星人可能将自己伪装成人类。根据我们的研究，我们认为贝佐斯脖子上有外星人脸的说法是错误的，证明他不是人类。用作证据的视频显示，贝佐斯说话时脖子上的皱纹会移动。没有证据表明贝索斯是爬行动物或外星人——或者其他物种在科学上可能将自己伪装成人类。这一说法借鉴了几个未经证实的阴谋论。华盛顿特区经济俱乐部，通过 YouTube，2018 年 9 月 20 日，亚马逊首席执行官兼创始人 Jeff Bezos 感谢您支持我们的新闻业。您可以在此处订阅我们的印刷版、无广告应用程序或电子报纸副本。", "note_en": "Fact check: False claims that Jeff Bezos is an alien, reptile draw on conspiracy theories\n    The claim: There is an alien’s face in Jeff Bezos&#39; neck, proving he&#39;s not human\n In early July,  a canceled government contract with Microsoft made former Amazon CEO Jeff Bezos even richer. This jump in the billionaire’s wealth inspired speculation and conspiracy theories on social media – some of which read like the plot of a science-fiction movie.\n A video posted to YouTube on July 14 promotes baseless claims that Bezos is an alien and reptile. The video, posted by YouTube user Gina Maria Colvin Hill and titled “I’m not sure if he is human!” has received  thousands of views on Facebook.\n “That’s an alien in his neck,” she says in the video. “Look at that two eyes in his neck. This Jeff Bezos has got an alien in his neck.”\n   She claims Bezos is wearing “a rubber mask on his head” and argues “his hands even look fake, too.”\n “He’s a reptilian!&#34; she says. &#34;I don’t think he’s a human.”\n But there is no evidence an alien is living in Bezos&#39; neck – or that the billionaire is a reptile. This video references several outlandish, unsubstantiated conspiracy theories.\n   Since the 1990s,  conspiracy theorists have pushed the baseless idea that the world is secretly run by reptilian elites that mask themselves as humans.\n Many affluent celebrities,  like Mark Zuckerberg and Bezos, have been the targets of these claims. Over the past several years,  the QAnon conspiracy theory, which baselessly claims the world is run by a secret cabal of cannibalistic, pedophile elites, has reinvigorated online suspicions about the wealthy and famous.\n  Colvin Hill regularly posts videos pushing conspiracy theories involving  wealthy people,  zombies,  vaccines and  QAnon. These conspiracy theories are not supported by evidence, as USA TODAY and other media outlets  have previously reported.\n    The YouTube video says Bezos is an alien because wrinkles in the skin of his neck appeared to show an alien&#39;s face and the skin on his face was &#34;too smooth.&#34; But the full video tells a different story.\n  The footage of Bezos used in this video comes from his  Sept. 13, 2018, interview with the Economic Club of Washington, D.C., a nonprofit business organization. Throughout the interview, when Bezos moves his neck, the wrinkles move with it. At several points, he extends his neck and there are no visible wrinkles, which Colvin Hill argued showed an alien&#39;s face.\n According to Britannica, Bezos was born in 1964 in Albuquerque, New Mexico, to teenage parents who were not wealthy at the time. He has lived in the public eye since Amazon launched in the 1990s.\n   Throughout his public career, there have been no reputable reports questioning whether he was a human.\n USA TODAY could find no scientific evidence that it&#39;s possible for reptiles or aliens to mask themselves as humans.\n  Based on our research, we rate FALSE the claim that there is an alien’s face in Bezos&#39; neck, proving he&#39;s not human. The video used as evidence shows Bezos&#39; neck wrinkles move as he talks. There is no evidence that Bezos is a reptile or alien – or that it is scientifically possible for another species to mask themselves as human. This claim draws on several unsubstantiated conspiracy theories.\n  The Economic Club of Washington, D.C., via YouTube, Sept. 20, 2018,  Jeff Bezos, CEO and Founder, Amazon\n Thank you for supporting o ur journalism. You can  subscribe to our print edition, ad-free app or electronic newspaper replica here.", "posttime": "2021-07-24 07:18:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "贝佐斯,事实,check,外星人", "title": "事实核查：杰夫·贝佐斯既不是外星人，也不是爬行动物", "title_en": "Fact check: Jeff Bezos is not an alien, nor a reptile", "transed": 1, "url": "https://www.usatoday.com/story/news/factcheck/2021/07/22/fact-check-jeff-bezos-not-alien-reptile/8008413002/", "via": "", "real_tags": ["贝佐斯", "事实", "check", "外星人"]}, {"category": "", "categoryclass": "", "imagename": "8058863ed26248864740891554080ab9.jpg", "infoid": 1069345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆马斯克表示，特斯拉不得不出售这家总部位于硅谷的汽车制造商于 2019 年收购的 Maxwell Technologies, Inc. 具有讽刺意味。特斯拉收购了韩国的 Maxwell Technologies，以利用其在超级电容器和超级电容器方面的研发优势，这将有助于推进电池技术。但根据埃隆·马斯克（Elon Musk）最近的一条推文，特斯拉已经在过去两年内从收购 Maxwell 中了解到了它需要什么。马斯克表示，即使当前技术没有任何重大进步，仅使用锂离子的电池技术就足以将世界转变为可持续能源。确实具有讽刺意味，因为我有一次打算在斯坦福大学攻读用于电动汽车的高能量密度电容器的博士学位。但锂离子已经涵盖了它。即使锂离子技术没有进步，也有可能将地球转变为可持续能源。 — Elon Musk (@elonmusk) 2021 年 7 月 21 日 马斯克进一步解释说，降低锂离子电池成本的秘诀是“干电极”。这是降低锂离子电池成本的众多难题之一，他在“电池日”演讲中解释了其中几个，并由 Sandy Munro 在他的一个视频中进一步解释。 Tesla 借鉴了 Maxwell 的干电极技术蓝图，并进一步对其开发进行了大量投资，“需要*大量*大量的工程才能将 Maxwell 的概念验证用于高质量的批量生产，我们仍在还没有完成，”马斯克在推特上说。干电极是降低锂电池成本的关键部分（众多部分之一）。也就是说，需要*大量*的工程才能将 Maxwell 的概念验证用于高质量的批量生产，而且我们还没有完全完成。\n— Elon Musk (@elonmusk) 2021 年 7 月 21 日，特斯拉公司已将 Maxwell Technologies 出售给 UCAP Power, Inc. 一家总部位于圣地亚哥的公司，该公司旨在将超级电容器技术带入商业主流。 UCAP Power 在 7 月 14 日的新闻稿中宣布了此次收购。 UCAP Power, Inc. 将商用超级电容器技术带入主流。在麦克斯韦最近被特斯拉收购后，创始人是前 Maxwell Technologies 领导和产品管理团队的公认领导者，成立了 UCAP Power。 UCAP Power 为一系列应用开发创新、适应性强的产品，使我们的客户更容易选择卓越的电力存储解决方案。市场包括风能和发电机备用电源中铅酸电池技术的“改造”替代策略。资料来源：领英上的 UCAP Power 根据我的研究，包括 UCAP Power 首席执行官在内的核心团队成员中至少有 3 人曾在特斯拉工作过。 UCAP Power 首席执行官 Gordon Schenk 于 2019 年 6 月离开特斯拉，担任美洲、澳大利亚和新西兰销售副总裁（Maxwell 部门）。 UCAP Power Troy Brandon 总经理兼副总裁曾在特斯拉担任高级产品线经理，他也于 2019 年 6 月离开了这家汽车制造商。\nUCAP Power 的高级机械工程师 Jesse Rivero 也曾在特斯拉担任机械工程师，并于 2019 年 8 月离开公司。", "note_en": "Elon Musk says it’s ironic that Tesla had to sell Maxwell Technologies, Inc. which the Silicon Valley-based automaker  acquired in 2019. Tesla bought Korea-based Maxwell Technologies to take advantage of its research and development in super and ultracapacitors that would help advance the battery tech.\n But according to a recent tweet by Elon Musk, Tesla has learned what it needed to out of the Maxwell acquisition within the past two years. Musk says that the battery tech using lithium ion alone is enough to transition the world to sustainable energy even without any significant advancement in current technology.\n  Ironic indeed, as I was at one point going to do my PhD at Stanford on high energy density capacitors for use in electric vehicles.   But lithium-ion has it covered. Even with no advances in lithium-ion technology, it’s possible to transition Earth to sustainable energy.\n— Elon Musk (@elonmusk)  July 21, 2021\n Musk further explains that the secret ingredient to lowering cost of lithium-ion batteries is “dry electrode”. It is one of the many pieces of the puzzle in the cost reduction of li-ion batteries, several of which he explained during the  Battery Day presentation and further  explained by Sandy Munro in one of his videos.\n Tesla has taken the dry electrode technology blueprint from Maxwell and has further invested in its development heavily, “it has required an *immense* amount of engineering to take Maxwell’s proof-of-concept to high-quality, volume production &amp; we’re still not quite done,” Musk stated on Twitter.\n Dry electrode is a key piece (one of many pieces) of the puzzle for lowering cost of lithium batteries.   That said, it has required an *immense* amount of engineering to take Maxwell’s proof-of-concept to high-quality, volume production &amp; we’re still not quite done.\n— Elon Musk (@elonmusk)  July 21, 2021\n  Tesla, Inc. has sold Maxwell Technologies to UCAP Power, Inc. a San Diego-based company that aims to bring the ultracapacitor technology to the commercial mainstream. UCAP Power announced this acquisition in a  press release on July 14th.\n  UCAP Power, Inc. brings commercially available Ultracapacitor technology into the mainstream. The founders, proven leaders formerly from Maxwell Technologies’ leadership and product management teams, formed UCAP Power after Maxwell’s recent acquisition by Tesla. UCAP Power develops innovative, adaptable products for a range of applications that make it easier for our clients to choose superior power storage solutions. Markets include “retrofit” replacement strategies for lead-acid battery technology in wind energy and generator reserve power.\n Source:  UCAP Power on LinkedIn\n According to my research, at least 3 of the core team members including the CEO of UCAP Power previously worked at Tesla.\n UCAP Power CEO Gordon Schenk left Tesla, Inc. in June 2019 as Vice President of Sales, Americas, Australia &amp; New Zealand (for Maxwell division).\n General Manager &amp; Vice President at UCAP Power Troy Brandon previously worked at Tesla as Sr. Product Line Manager who also left the automaker in June 2019.\n Jesse Rivero, a Sr. Mechanical Engineer at UCAP Power also worked at Tesla as a Mechanical Engineer and left the company in August 2019.", "posttime": "2021-07-24 07:18:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,maxwell,sells,技术", "title": "特斯拉出售 Maxwell Technologies，因为它不打算使用超级电容器技术", "title_en": "Tesla sells Maxwell Technologies as it doesn't plan to use ultracapacitor tech", "transed": 1, "url": "https://www.teslaoracle.com/2021/07/23/tesla-sells-maxwell-technologies-since-its-not-needed-anymore/", "via": "", "real_tags": ["特斯拉", "maxwell", "sells", "技术"]}, {"category": "", "categoryclass": "", "imagename": "b0d0fd04ca883af0d9eb1a4831feb79e.jpeg", "infoid": 1069344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在澳大利亚悉尼以南一小时车程的富裕郊区斯坦威尔公园，硫冠凤头鹦鹉在它们的人类邻居中没有最好的声誉。野生动物在城市环境中繁衍生息，随着它们在城市景观中的成功，它们已经养成了一些粗暴的新习惯——比如打开垃圾桶盖来获取里面的好东西。 2014 年，这种行为在当地社区杂志上为鹦鹉赢得了一些负面报道。鸟类学家理查德·梅杰 (Richard Major) 在接受这篇文章的采访时，第一次了解到他附近的一系列鸟脑垃圾箱袭击事件。当时，他还没有亲眼目睹犯罪，但他和他的研究人员决定在 2018 年调查这种行为。现在，在今天发表在《科学》杂志上的一项新研究中，该团队报告说这些聪明的凤头鹦鹉可以学习这一点他们的社会群体中的垃圾觅食行为，每年都有更多的鸟类掌握这项技能。研究作者、澳大利亚塔龙加保护协会的生态学家约翰马丁说，“鹦鹉是鸟类世界的朋克”，无论是外表还是性格。首先，他们运动的黄色冠像莫霍克族。他们兴奋的跳跃、拍打翅膀和摇头的表现很容易被误认为是一种恶魔般的态度。他们的尖叫声会增强任何朋克摇滚歌曲。 （马丁说，每到日出和日落，成群的凤头鹦鹉都会“真正地尖叫”。）它们的觅食习惯很有创意，虽然有点烦人。好奇且具有破坏性，他们在食物袭击中留下了毁灭性的痕迹——从斩首花朵获取花蜜，到为了获得几粒种子而砍掉成群的水果。当马丁，少校的前博士之一。学生和他的同事了解了垃圾劫持行为，他们想知道这种行为在其他凤头鹦鹉中有多普遍，以及聪明的鸟类是如何接受这种行为的。三年后，经过 160 次直接观察和一次大规模的公民科学调查，研究人员证实，聪明的凤头鹦鹉可以通过观察其他先驱鹦鹉来学习如何打开垃圾箱。这项研究首次见证了几只凤头鹦鹉的创新是如何在同龄人中传播一种新的觅食文化。 “[研究人员] 能够实时捕捉[垃圾箱打开]，这真是令人兴奋，”奥地利维也纳兽医大学的认知生物学家 Alice Auersperg 说，他没有参与这项研究。她对研究人员如何利用公民科学的力量在野外大规模记录新的行为怪癖印象特别深刻。 “他们有一个很好的方法，”她说。研究人员对悉尼和卧龙岗 478 个郊区的 1,322 人进行了为期一年半的调查，记录了对垃圾破坏行为的观察结果。在 2018 年之前，只有三个地区曾观察到凤头鹦鹉打开垃圾箱，但到 2019 年，有 44 个地区报告了这种行为。与被森林包围的遥远社区或社区相比，垃圾桶开放在附近地区传播得更快，这可能会阻止潮流引领者分享他们新获得的技能。由于并非所有凤头鹦鹉都能流行，研究人员认为，这种创新的觅食行为可能是社会学习的一个例子，而不是遗传倾向。他们所学的技能不同于其他鸟类知识分子，例如新喀里多尼亚乌鸦，无论它们是在野外还是在圈养环境中长大，它们在进化上都倾向于修补工具。\n为了分析鹦鹉打开垃圾箱的机制，研究人员在三个地点拍摄了 160 次这种行为。该团队用向日葵种子贿赂鸟类，用临时油漆涂抹了近 500 名路过的凤头鹦鹉，以区分不同的个体。 （捕捉凤头鹦鹉要复杂得多——尽管它们是聪明的鸟类，但它们很快就会学会识别绑架者并用女妖的尖叫声发出警报。）对凤头鹦鹉来说，打开垃圾箱并不是一件容易的事，需要精心设计的提升、盖子的顺序保持、行走和翻转步骤。只有 8% 的有标记的鸟类——主要是较重的雄性——发展出打开盖子的排骨，但研究人员对成功和不成功个体的整体持久性感到惊讶。 “能做到这一点的人让它看起来如此简单，”研究作者、德国马克斯普朗克动物行为研究所的行为生态学家芭芭拉·克伦普说。 “如果我没有看到这么多鸟在挣扎，我就不会意识到这实际上是一项多么艰巨的任务。”在胜利的凤头鹦鹉中，技术因人而异，甚至在不同的地理位置之间更为显着。每只鸟都有自己独特的垃圾盗窃方式。某些凤头鹦鹉喜欢沿着垃圾箱的边缘顺时针行走。一些垃圾袭击者侧身拖着脚步，而另一些人则像走钢丝一样一头扎进。这一结果暗示了凤头鹦鹉之间存在区域亚文化。其他通过社交学习并认同自己文化的动物智障包括灵长类动物、鲸鱼和鸣禽。 “从生态的角度来看，这对我们来说非常令人兴奋，”Klump 说。 “在这样的人类环境中，动物文化实际上可以促进适应。”她补充说，对于鹦鹉的觅食习惯，人类只能感谢或责备自己，因为他们首先为鸟类提供了带盖的垃圾箱供它们探索。 “这只是表明这些鸟类对人类环境的适应程度如何，”她说。住在悉尼并喜欢凤头鹦鹉的马丁说，有几只鸟群蹲在他镇的角落里，每个船员大约有 50 名成员。他还没有观察到他所在地区的垃圾桶打开行为，但他预计这种行为最终会流行起来。当然，只有时间会证明一切，但概率肯定不是不可能的。 “有很多鸟，”他说，“每个房子都有垃圾箱。”", "note_en": "Sulfur-crested cockatoos don’t have the best reputation around their human neighbors in Stanwell Park, an affluent suburb an hour’s drive south of Sydney, Australia. The wild animals have flourished in an urban environment, and with their success in the cityscape, they’ve developed some rowdy new habits—like flipping open trash bin lids to access the goodies within. In 2014, this behavior earned the cockatoos  a bit of bad press in the local community magazine. Ornithologist Richard Major first learned about the string of bird-brained bin raids in his neighborhood when he was interviewed for the article. At the time, he hadn’t witnessed the crime firsthand yet, but he and his fellow researchers decided to investigate the behavior in 2018.\n    Now, in a new study published today in the journal   Science, the team reports these clever cockatoos can learn this garbage foraging behavior within their social groups, with more birds picking up the skill each year.\n  “Cockatoos are the punks of the bird world” in both looks and character, says study author John Martin, an ecologist at Taronga Conservation Society, Australia. For starters, the yellow crests they sport resemble mohawks. Their exuberant displays of hopping, wing flapping and head bobbing are easy to mistake for a devil-may-care attitude. Their shrieking  calls would enhance any punk rock song. (Martin says flocks of cockatoos “literally scream” every sunrise and sunset.) Their foraging habits are inventive, if not a bit annoying. Curious and destructive, they leave a trail of devastation in their food raids—from beheading flowers for nectar to decimating hordes of fruit just to reach a few seeds.\n  When Martin, one of Major’s former Ph.D. students, and his colleagues learned about the trash-jacking behavior, they wondered how prevalent it was among other cockatoos and how the brainy birds pick up the action. Three years, 160 direct observations and one large-scale citizen science survey later, the researchers confirmed that the clever cockatoos can learn how to open garbage bins by observing other pioneering parrots. This research is the first of its kind to witness how a stroke of innovation in a few cockatoos propagates a new foraging culture among peers.\n  “It’s really exciting that [the researchers] were able to catch [bin opening] in real time,” says Alice Auersperg, a cognitive biologist at the University of Veterinary Medicine, Vienna in Austria, who wasn’t involved in the study. She’s particularly impressed with how the researchers tapped into the power of citizen science to document a new behavioral quirk in the wild at large scales. “They had a great approach,” she says.\n    The researchers documented observations of bin-busting behavior by surveying 1,322 people across 478 suburbs in Sydney and Wollongong for one and a half years. Only three districts had ever observed cockatoos opening bins before 2018, but by 2019, 44 areas reported the behavior. Bin opening spread more quickly to nearby districts than to faraway neighborhoods or communities surrounded by forests, which could have walled off trendsetters from sharing their newly acquired skills.\n  Since not all cockatoos catch on, the researchers suggest the innovative foraging behavior could be an example of social learning rather than a genetic predisposition. Their learned skill is unlike other avian intelligentsia such as New Caledonian crows, which are  evolutionarily wired to tinker with tools whether they were raised in the wild or in captivity.\n  To analyze the mechanics of bin opening à la cockatoo, the researchers filmed 160 instances of the behavior in three locations. Bribing the birds with sunflower seeds, the team dabbed nearly 500 cockatoo passers-by with temporary paint to tell different individuals apart. (Capturing cockatoos is much trickier—smart birds as they are, they quickly learn to recognize human kidnappers and sound the alarm with their banshee shrieks.)\n  Busting the bin open is no easy task for a cockatoo, requiring an elaborate sequence of lifting, lid holding, walking and flipping steps. Only eight percent of marked birds—mostly the heavier males—developed the chops to flip open the lids, but the researchers were surprised by the overall persistence in both successful and unsuccessful individuals.\n  “The ones that can do it make it look so easy,” says study author Barbara Klump, a behavioral ecologist at the Max Planck Institute of Animal Behavior in Germany. “If I hadn’t seen so many birds struggling, I wouldn&#39;t appreciate what a difficult task this actually is.”\n  Among triumphant cockatoos, techniques varied between individuals and even more saliently across geographic locations. Each bird had its own unique way of going about its garbage burglary. Certain cockatoos favored walking clockwise along the bin’s rim. Some rubbish raiders shuffled sideways, whereas others marched headlong as if walking along a tightrope. This result alludes to the existence of regional subcultures among cockatoos. Other animal brainiacs that learn socially and subscribe to cultures of their own include  primates,  whales and  songbirds.\n    “That’s very exciting for us from an ecological point of view,” Klump says. “In such a human environment, animal cultures can actually facilitate adaptation.”\n  She adds humans have only themselves to thank—or blame—for the cockatoo’s foraging habits, as they’ve provided lidded bins for the birds to explore in the first place. “It just shows how well-adapted these birds are to the human environment,” she says.\n  Martin, who lives in Sydney and adores cockatoos, says several flocks squat in his corner of town, each crew around 50 members strong. He has yet to observe bin opening behavior in his district, but he anticipates it could catch on eventually. Only time will tell, of course, but the probability is certainly not out of the question. “There are lots of birds,” he says, “and every house has bin.”", "posttime": "2021-07-24 07:18:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "垃圾箱,trash,鹦鹉", "title": "澳大利亚的垃圾箱袭击凤头鹦鹉", "title_en": "Australia’s trash bin-raiding cockatoos", "transed": 1, "url": "https://www.smithsonianmag.com/science-nature/cockatoos-learn-open-garbage-bins-observing-their-peers-180978248/", "via": "", "real_tags": ["垃圾箱", "trash", "鹦鹉"]}, {"category": "", "categoryclass": "", "imagename": "6c3b19fc8f11f0de42fd4d1f9a6ddee7.png", "infoid": 1069343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "登入", "note_en": "Sign in", "posttime": "2021-07-24 07:17:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "技术,survive,登入", "title": "我们能在技术中生存吗？ (1955) [pdf]", "title_en": "Can we survive technology? (1955) [pdf]", "transed": 1, "url": "https://drive.google.com/file/d/10_IKsz0GdgyLlO9-MAtpTPQ7vnfpN8Ng/view?usp=drivesdk", "via": "", "real_tags": ["技术", "survive", "登入"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 PDF 摘要：空间安全违规是许多安全攻击和应用程序意外行为的根源。现有的强制执行空间安全的技术在对象或指针粒度上广泛工作。基于对象的方法往往会导致高 CPU 开销，而基于指针的方法会导致高 CPU 和内存开销。 SGXBounds 是一种基于对象的方法，是迄今为止为对象提供完整越界保护的最有效技术。但是，这种方法的一个主要缺点是它将应用程序地址空间限制为 4GB。在本文中，我们介绍了 CGuard，这是一种为 C 应用程序提供对象边界保护的工具，其开销与 SGXBounds 相当，而不会限制应用程序地址空间。 CGuard 在对象的基地址之前存储边界信息，并在 x86_64 架构中可用的虚拟地址的备用位中编码基地址的相对偏移量。对于无法放入备用位的对象，CGuard 使用自定义内存布局，使其能够在一次内存访问中找到对象的基地址。我们的研究揭示了来自 SPEC CPU2017 基准测试套件的 gccand x264 基准测试和来自 Phoenix 基准测试套件的 string_matchbenchmark 的空间安全违规。 SPEC CPU2017 和 Phoenix 基准套件的执行时间开销分别为 44% 和 25%，而当 CPU 完全饱和时，Apache Web 服务器的吞吐量降低了 30%。这些结果表明 CGuard 在保持合理效率的同时可以非常有效。", "note_en": "Download PDF  Abstract: Spatial safety violations are the root cause of many security attacks andunexpected behavior of applications. Existing techniques to enforce spatialsafety work broadly at either object or pointer granularity. Object-basedapproaches tend to incur high CPU overheads, whereas pointer-based approachesincur both high CPU and memory overheads. SGXBounds, an object-based approach,is so far the most efficient technique that provides complete out-of-boundsprotection for objects. However, a major drawback of this approach is that itrestricts the application address space to 4GB. In this paper, we present CGuard, a tool that provides object-boundsprotection for C applications with comparable overheads to SGXBounds withoutrestricting the application address space. CGuard stores the bounds informationjust before the base address of an object and encodes the relative offset ofthe base address in the spare bits of the virtual address available in x86_64architecture. For an object that can&#39;t fit in the spare bits, CGuard uses acustom memory layout that enables it to find the base address of the object injust one memory access. Our study revealed spatial safety violations in the gccand x264 benchmarks from the SPEC CPU2017 benchmark suite and the string_matchbenchmark from the Phoenix benchmark suite. The execution time overheads forthe SPEC CPU2017 and Phoenix benchmark suites were 44% and 25% respectively,whereas the reduction in the throughput for the Apache webserver when the CPUswere fully saturated was 30%. These results indicate that CGuard can be highlyeffective while maintaining a reasonable degree of efficiency.", "posttime": "2021-07-24 07:17:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "空间,efficient,对象", "title": "CGuard：C 的高效空间安全", "title_en": "CGuard: Efficient Spatial Safety for C", "transed": 1, "url": "https://arxiv.org/abs/2107.10533", "via": "", "real_tags": ["空间", "efficient", "对象"]}, {"category": "", "categoryclass": "", "imagename": "ac649f8216b5e977df1d758b8154f87c.jpg", "infoid": 1069341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MySQL 是一种由 Oracle 开发的开源数据库，为 Facebook 的一些最重要的工作负载提供支持。我们积极开发 MySQL 中的新功能，以支持我们不断发展的需求。这些特性改变了 MySQL 的许多不同领域，包括客户端连接器、存储引擎、优化器和复制。 MySQL 的每个新主要版本都需要花费大量的时间和精力来迁移我们的工作负载。挑战包括： 我们上次升级到 MySQL 5.6 的主要版本花了一年多的时间才推出。当 5.7 版发布时，我们仍在开发 5.6 版上的 LSM-Tree 存储引擎 MyRocks。由于在构建新存储引擎的同时升级到 5.7 会显着减缓 MyRocks 的进度，因此我们选择继续使用 5.6，直到 MyRocks 完成。 MySQL 8.0 是在我们完成将 MyRocks 部署到我们的用户数据库 (UDB) 服务层时宣布的。该版本包括引人注目的功能，如基于写集的并行复制和提供原子 DDL 支持的事务数据字典。对我们来说，迁移到 8.0 还会带来我们错过的 5.7 功能，包括文档存储。 5.6 版即将结束，我们希望在 MySQL 社区中保持活跃，尤其是我们在 MyRocks 存储引擎上的工作。 8.0 中的增强功能，如即时 DDL，可以加速 MyRocks 架构更改，但我们需要在 8.0 代码库上使用它。考虑到代码更新的好处，我们决定迁移到 8.0。我们正在分享我们如何处理 8.0 迁移项目 - 以及我们在此过程中发现的一些惊喜。当我们最初确定项目的范围时，很明显迁移到 8.0 比迁移到 5.6 或 MyRocks 更加困难。当时，我们定制的 5.6 分支有超过 1,700 个代码补丁可以移植到 8.0。在我们移植这些更改时，新的 Facebook MySQL 功能和修复被添加到 5.6 代码库中，从而将目标移得更远。我们有许多 MySQL 服务器在生产中运行，为大量不同的应用程序提供服务。我们还拥有用于管理 MySQL 实例的广泛软件基础设施。这些应用程序执行诸如收集统计数据和管理服务器备份之类的操作。从 5.6 升级到 8.0 完全跳过了 5.7。在 5.6 中处于活动状态的 API 将在 5.7 中被弃用，并可能在 8.0 中被删除，这要求我们使用现已删除的 API 更新任何应用程序。许多 Facebook 功能与 8.0 中的类似功能不向前兼容，需要弃用和向前迁移。\n我们首先设置了 8.0 分支，用于在我们的开发环境中进行构建和测试。然后，我们开始了从 5.6 分支移植补丁的漫长旅程。我们开始时有 1,700 多个补丁，但我们能够将它们分为几个主要类别。我们的大多数自定义代码都有很好的注释和描述，因此我们可以轻松确定应用程序是否仍然需要它，或者是否可以删除它。由特殊关键字或唯一变量名称启用的功能也使确定相关性变得容易，因为我们可以搜索我们的应用程序代码库以找到它们的用例。一些补丁非常模糊，需要侦探工作——挖掘旧的设计文档、帖子和/或代码审查评论——以了解它们的历史。删除：不再使用的功能或在 8.0 中具有等效功能的功能不需要移植。构建/客户端：移植了支持我们的构建环境和修改过的 MySQL 工具（如 mysqlbinlog）或添加的功能（如异步客户端 API）的非服务器功能。非 MyRocks 服务器：移植了 mysqld 服务器中与我们的 MyRocks 存储引擎无关的功能。我们使用电子表格跟踪每个补丁的状态和相关历史信息，并在删除补丁时记录我们的推理。更新相同功能的多个补丁被组合在一起进行移植。移植并提交到 8.0 分支的补丁使用 5.6 提交信息进行了注释。由于我们需要筛选大量补丁，这些注释帮助我们解决了这些问题，因此不可避免地会出现移植状态的差异。每个客户端和服务器类别自然而然地成为软件发布的里程碑。移植所有与客户端相关的更改后，我们能够将客户端工具和连接器代码更新到 8.0。一旦移植了所有非 MyRocks 服务器功能，我们就能够为 InnoDB 服务器部署 8.0 mysqld。完成 MyRocks 服务器功能使我们能够更新 MyRocks 安装。一些最复杂的功能需要对 8.0 进行重大更改，并且一些领域存在重大兼容性问题。例如，上游 8.0 binlog 事件格式与我们的一些自定义 5.6 修改不兼容。 Facebook 5.6 功能使用的错误代码与上游 8.0 分配给新功能的错误代码相冲突。我们最终需要修补我们的 5.6 服务器以与 8.0 向前兼容。\n完成所有这些功能的移植花了几年时间。到最后，我们已经评估了 2,300 多个补丁并将其中的 1,500 个移植到 8.0。我们将多个 mysqld 实例组合成一个 MySQL 副本集。副本集中的每个实例都包含相同的数据，但在地理上分布到不同的数据中心，以提供数据可用性和故障转移支持。每个副本集有一个主实例。其余实例都是辅助实例。主节点处理所有写入流量并将数据异步复制到所有辅助节点。我们从包含 5.6 个主/5.6 个辅助的副本集开始，最终目标是包含 8.0 个主/8.0 个辅助的副本集。我们遵循了一个类似于 UDB MyRocks 迁移计划的计划。对于每个副本集，使用 mysqldump 通过逻辑副本创建和添加 8.0 次要副本。这些辅助节点不提供任何应用程序读取流量。每个副本集都可以独立地过渡上述每个步骤，并根据需要停留在一个步骤上。我们将副本集分成更小的组，并在每次转换中进行引导。如果我们发现问题，我们可以回滚到上一步。在某些情况下，副本集能够在其他步骤开始之前到达最后一步。为了自动化大量副本集的转换，我们需要构建新的软件基础设施。我们可以将副本集分组在一起，并通过简单地更改配置文件中的一行来将它们移动到每个阶段。任何遇到问题的副本集都可以单独回滚。作为 8.0 迁移工作的一部分，我们决定标准化使用基于行的复制 (RBR)。一些 8.0 功能需要 RBR，它简化了我们的 MyRocks 移植工作。虽然我们的大多数 MySQL 副本集已经在使用 RBR，但那些仍在运行基于语句的复制 (SBR) 的副本无法轻松转换。这些副本集通常有没有任何高基数键的表。完全切换到 RBR 是一个目标，但添加主键所需的长尾工作的优先级通常低于其他项目。\n因此，我们将 RBR 作为 8.0 的要求。在评估并为每个表添加主键后，我们切换了今年最后一个 SBR 副本集。使用 RBR 还为我们提供了一种替代解决方案，用于解决我们在将一些副本集移动到 8.0 主版本时遇到的应用程序问题，稍后将对此进行讨论。大多数 8.0 迁移过程涉及使用我们的自动化基础设施和应用程序查询测试和验证 mysqld 服务器。随着我们的 MySQL 机群的增长，我们用来管理服务器的自动化基础设施也在增长。为了确保我们所有的 MySQL 自动化都与 8.0 版本兼容，我们投资构建了一个测试环境，该环境利用测试副本集和虚拟机来验证行为。我们编写了集成测试，对每个自动化部分进行金丝雀测试，以便在 5.6 版本和 8.0 版本上运行并验证它们的正确性。在进行此练习时，我们发现了几个错误和行为差异。由于每个 MySQL 基础设施都针对我们的 8.0 服务器进行了验证，我们发现并修复了（或解决了）许多有趣的问题：从错误日志、mysqldump 输出或服务器显示命令解析文本输出的软件很容易损坏。服务器输出的细微变化通常会揭示工具解析逻辑中的错误。 8.0 的默认 utf8mb4 排序规则设置导致我们的 5.6 和 8.0 实例之间的排序规则不匹配。 8.0 表可能会使用新的 utf8mb4_0900 排序规则，即使对于 5.6 的 show create table 生成的 create 语句，因为使用 utf8mb4_general_ci 的 5.6 模式没有明确指定排序规则。这些表差异通常会导致复制和模式验证工具出现问题。某些复制失败的错误代码发生了变化，我们必须修复我们的自动化以正确处理它们。\n8.0 版本的数据字典废弃了表 .frm 文件，但我们的一些自动化使用它们来检测表架构修改。我们希望应用程序的转换尽可能透明，但一些应用程序查询会出现性能下降或在 8.0 上会失败。对于 MyRocks 迁移，我们构建了一个 MySQL 影子测试框架，用于捕获生产流量并将其重播到测试实例。对于每个应用程序工作负载，我们在 8.0 上构建测试实例并向它们重放影子流量查询。我们捕获并记录了从 8.0 服务器返回的错误，并发现了一些有趣的问题。不幸的是，并非所有这些问题都在测试过程中被发现。例如，在迁移过程中应用程序发现了事务死锁。在我们研究不同的解决方案时，我们能够暂时将这些应用程序回滚到 5.6。 8.0 中引入了新的保留关键字，其中一些与应用程序查询中使用的流行表列名称和别名相冲突，例如组和排名。这些查询没有通过反引号对名称进行转义，从而导致解析错误。使用自动转义查询中列名的软件库的应用程序没有遇到这些问题，但并非所有应用程序都使用它们。解决这个问题很简单，但追踪应用程序所有者和生成这些查询的代码库需要时间。一些应用程序在 InnoDB 上的重复键查询上遇到了涉及 insert … 的可重复读取事务死锁。 5.6 有一个错误，在 8.0 中得到纠正，但修复增加了事务死锁的可能性。在分析了我们的查询之后，我们能够通过降低隔离级别来解决它们。由于我们已切换到基于行的复制，因此我们可以使用此选项。我们的自定义 5.6 文档存储和 JSON 函数与 8.0 不兼容。使用文档存储的应用程序需要将文档类型转换为文本以进行迁移。对于 JSON 函数，我们向 8.0 服务器添加了 5.6 兼容版本，以便应用程序可以在以后迁移到 8.0 API。我们对 8.0 服务器的查询和性能测试发现了一些需要立即解决的问题。\n我们在 ACL 缓存周围发现了新的互斥量争用热点。当同时打开大量连接时，它们都可以阻止检查 ACL。当存在许多 binlog 文件且高 binlog 写入速率频繁轮换文件时，binlog 索引访问也会出现类似的争用。几个涉及临时表的查询被破坏。查询将返回意外错误或运行时间过长而超时。内存使用与 5.6 相比有所增加，特别是对于我们的 MyRocks 实例，因为必须加载 8.0 中的 InnoDB。默认的 performance_schema 设置启用了所有仪器并消耗了大量内存。我们通过仅启用少量仪器并更改代码以禁用无法手动关闭的表来限制内存使用。但是，并非所有增加的内存都由 performance_schema 分配。我们需要检查和修改各种 InnoDB 内部数据结构，以进一步减少内存占用。这一努力将 8.0 的内存使用率降低到可接受的水平。到目前为止，8.0 迁移已经花费了几年时间。我们已将许多 InnoDB 副本集转换为完全在 8.0 上运行。其余的大部分都处于迁移路径的不同阶段。现在我们的大部分自定义功能都已移植到 8.0，更新到 Oracle 的次要版本相对容易，我们计划与最新版本保持同步。首先，我们无法就地升级服务器，需要使用逻辑转储和还原来构建新服务器。但是，对于非常大的 mysqld 实例，这在实时生产服务器上可能需要很多天，而且这个脆弱的过程可能会在完成之前被中断。对于这些大型实例，我们不得不修改我们的备份和恢复系统来处理重建。其次，检测 API 更改要困难得多，因为 5.7 可以向我们的应用程序客户端提供弃用警告以修复潜在问题。相反，我们需要运行额外的影子测试来发现故障，然后才能迁移生产工作负载。使用自动转义架构对象名称的 mysql 客户端软件有助于减少兼容性问题的数量。\n在一个副本集中支持两个主要版本是很困难的。一旦副本集将其主实例提升为 8.0 实例，最好尽快禁用并删除 5.6 实例。应用程序用户往往会发现仅 8.0 支持的新功能，例如 utf8mb4_0900 排序规则，使用这些功能可能会中断 8.0 和 5.6 实例之间的复制流。尽管在我们的迁移过程中遇到了所有障碍，但我们已经看到了运行 8.0 的好处。一些应用程序选择提前转换到 8.0，以利用文档存储和改进的日期时间支持等功能。我们一直在考虑如何在 MyRocks 上支持 Instant DDL 等存储引擎功能。总的来说，新版本极大地扩展了我们可以用 MySQL @ Facebook 做的事情。", "note_en": "MySQL , an open source database developed by Oracle, powers some of Facebook’s most important workloads. We actively develop new features in MySQL to support our evolving requirements. These features change many different areas of MySQL, including client connectors, storage engine, optimizer, and replication. Each new major version of MySQL requires significant time and effort to migrate our workloads. The challenges  include:\n  Our last major version upgrade, to MySQL 5.6, took more than a year to roll out. When version 5.7 was released, we were still in the midst of developing our LSM-Tree storage engine,   MyRocks , on version 5.6. Since upgrading to 5.7 while simultaneously building a new storage engine would have significantly slowed the progress on MyRocks, we opted to stay with 5.6 until MyRocks was complete. MySQL 8.0 was announced as we were finishing the rollout of MyRocks to our user database (UDB) service tier.\n That version included compelling features like writeset-based parallel replication and a transactional data dictionary that provided atomic DDL support. For us, moving to 8.0 would also bring in the 5.7 features we had missed, including Document Store. Version 5.6 was approaching end of life, and we wanted to stay active within the MySQL community, especially with our work on the MyRocks storage engine. Enhancements in 8.0, like instant DDL, could speed up MyRocks schema changes, but we needed to be on the 8.0 codebase to use it. Given the benefits of the code update, we decided to migrate to 8.0. We’re sharing how we tackled our 8.0 migration project — and some of the surprises we discovered in the process. When we initially scoped out the project, it was clear that moving to 8.0 would be even more difficult than migrating to 5.6 or MyRocks.\n At the time, our customized 5.6 branch had over 1,700 code patches to port to 8.0. As we were porting those changes, new Facebook MySQL features and fixes were added to the 5.6 codebase that moved the goalpost further away.\n We have many MySQL servers running in production, serving a large number of disparate applications. We also have extensive software infrastructure for managing MySQL instances. These applications perform operations like gathering statistics and managing server backups.\n Upgrading from 5.6 to 8.0 skipped over 5.7 entirely. APIs that were active in 5.6 would have been deprecated in 5.7 and possibly removed in 8.0, requiring us to update any application using the now-removed APIs.\n A number of Facebook features were not forward-compatible with similar ones in 8.0 and required a deprecation and migration path forward.\n  We first set up the 8.0 branch for building and testing in our development environments. We then began the long journey to port the patches from our 5.6 branch. There were more than 1,700 patches when we started, but we were able to organize them into a few major categories. Most of our custom code had good comments and descriptions so we could easily determine whether it was still needed by the applications or if it could be dropped. Features that were enabled by special keywords or unique variable names also made it easy to determine relevance because we could search through our application codebases to find their use cases. A few patches were very obscure and required detective work — digging through old design documents, posts, and/or code review comments — to understand their history.\n  Drop: Features that were no longer used, or had equivalent functionality in 8.0, did not need to be ported.\n Build/Client: Non-server features that supported our build environment and modified MySQL tools like mysqlbinlog, or added functionality like the async client API, were ported.\n Non-MyRocks Server: Features in the mysqld server that were not related to our MyRocks storage engine were ported.\n We tracked the status and relevant historical information of each patch using spreadsheets, and recorded our reasoning when dropping a patch. Multiple patches that updated the same feature were grouped together for porting. Patches ported and committed to the 8.0 branch were annotated with the 5.6 commit information. Discrepancies on porting status would inevitably arise due to the large number of patches we needed to sift through and these notes helped us resolve them.\n Each of the client and server categories naturally became a software release milestone. With all client-related changes ported, we were able to update our client tooling and connector code to 8.0. Once all of the non-MyRocks server features were ported, we were able to deploy 8.0 mysqld for InnoDB servers. Finishing up the MyRocks server features enabled us to update MyRocks installations.\n Some of the most complex features required significant changes for 8.0, and a few areas had major compatibility problems. For example, upstream 8.0 binlog event formats were incompatible with some of our custom 5.6 modifications. Error codes used by Facebook 5.6 features conflicted with those assigned to new features by upstream 8.0. We ultimately needed to patch our 5.6 server to be forward-compatible with 8.0.\n It took a couple of years to complete porting all of these features. By the time we got to the end, we had evaluated more than 2,300 patches and ported 1,500 of those to 8.0.\n  We group together multiple mysqld instances into a single MySQL replica set. Each instance in a replica set contains the same data but is geographically distributed to a different data center to provide data availability and failover support. Each replica set has one primary instance. The remaining instances are all secondaries. The primary handles all write traffic and replicates the data asynchronously to all secondaries.\n  We started with replica sets consisting of 5.6 primary/5.6 secondaries and the end goal was replica sets with 8.0 primary/8.0 secondaries. We followed a plan similar to the   UDB MyRocks migration plan .\n For each replica set, create and add 8.0 secondaries via a logical copy using mysqldump. These secondaries do not serve any application read traffic.\n Each replica set could transition through each of the steps above independently and stay on a step as long as needed. We separated replica sets into much smaller groups, which we shepherded through each transition. If we found problems, we could rollback to the previous step. In some cases, replica sets were able to reach the last step before others started.\n To automate the transition of a large number of replica sets, we needed to build new software infrastructure. We could group replica sets together and move them through each stage by simply changing a line in a configuration file. Any replica set that encountered problems could then be individually rolled back.\n  As part of the 8.0 migration effort, we decided to standardize on using row-based replication (RBR). Some 8.0 features required RBR, and it simplified our MyRocks porting efforts. While most of our MySQL replica sets were already using RBR, those still running statement-based replication (SBR) could not be easily converted. These replica sets usually had tables without any high cardinality keys. Switching completely to RBR had been a goal, but the long tail of work needed to add primary keys was often prioritized lower than other projects.\n Hence, we made RBR a requirement for 8.0. After evaluating and adding primary keys to every table, we switched over the last SBR replica set this year. Using RBR also gave us an alternative solution for resolving an application issue that we encountered when we moved some replica sets to 8.0 primaries, which will be discussed later.\n  Most of the 8.0 migration process involved testing and verifying the mysqld server with our automation infrastructure and application queries.\n As our MySQL fleet grew, so did the automation infrastructure we use to manage the servers. In order to ensure all of our MySQL automation was compatible with the 8.0 version, we invested in building a test environment, which leveraged test replica sets with virtual machines to verify the behaviors. We wrote integration tests to canary each piece of automation to run on both the 5.6 version and the 8.0 version and verified their correctness. We found several bugs and behavior differences as we went through this exercise.\n As each piece of MySQL infrastructure was validated against our 8.0 server, we found and fixed (or worked around) a number of interesting issues:\n Software that parsed text output from error log, mysqldump output, or server show commands easily broke. Slight changes in the server output often revealed bugs in a tool’s parsing logic.\n The 8.0’s default  utf8mb4  collation settings resulted in collation mismatches between our 5.6 and 8.0 instances. 8.0 tables may use the new  utf8mb4_0900  collations even for create statements generated by 5.6’s show create table because the 5.6 schemas using  utf8mb4_general_ci  do not explicitly specify collation. These table differences often caused problems with replication and schema verification tools.\n The error codes for certain replication failures changed and we had to fix our automation to handle them correctly.\n The 8.0 version’s data dictionary obsoleted table .frm files, but some of our automation used them to detect table schema modifications.\n  We wanted the transition for applications to be as transparent as possible, but some application queries hit performance regressions or would fail on 8.0.\n For the MyRocks migration, we built a MySQL shadow testing framework that captured production traffic and replayed them to test instances. For each application workload, we constructed test instances on 8.0 and replayed shadow traffic queries to them. We captured and logged the errors returning from the 8.0 server and found some interesting problems. Unfortunately, not all of these problems were found during testing. For example, the transaction deadlock was discovered by applications during the migration. We were able to roll back these applications to 5.6 temporarily while we researched different solutions.\n New reserved keywords were introduced in 8.0 and a few, such as groups and rank, conflicted with popular table column names and aliases used in application queries. These queries did not escape the names via backquotes, leading to parsing errors. Applications using software libraries that automatically escaped the column names in queries did not hit these issues, but not all applications used them. Fixing the problem was simple, but it took time to track down application owners and codebases generating these queries.\n  A few applications hit   repeatable-read transaction deadlocks  involving  insert … on duplicate key  queries on InnoDB. 5.6 had a bug which was corrected in 8.0, but the fix increased the likelihood of transaction deadlocks. After analyzing our queries, we were able to resolve them by lowering the isolation level. This option was available to us since we had made the switch to row-based replication.\n Our custom 5.6 Document Store and JSON functions were not compatible with 8.0’s. Applications using Document Store needed to convert the document type to text for the migration. For the JSON functions, we added 5.6-compatible versions to the 8.0 server so that applications could migrate to the 8.0 API at a later time.\n Our query and performance testing of the 8.0 server uncovered a few problems that needed to be addressed almost immediately.\n We found new mutex contention hotspots around the ACL cache. When a large number of connections were opened simultaneously, they could all block on checking ACLs.\n Similar contention was found with binlog index access when many binlog files are present and high binlog write rates rotate files frequently.\n Several queries involving temp tables were broken. The queries would return unexpected errors or take so long to run that they would time out.\n Memory usage compared with 5.6 had increased, especially for our MyRocks instances, because InnoDB in 8.0 must be loaded. The default performance_schema settings enabled all instruments and consumed significant memory. We limited the memory usage by only enabling a small number of instruments and making code changes to disable tables that could not be manually turned off. However, not all the increased memory was being allocated by performance_schema. We needed to examine and modify various InnoDB internal data structures to reduce the memory footprint further. This effort brought 8.0’s memory usage down to acceptable levels.\n  The 8.0 migration has taken a few years so far. We have converted many of our InnoDB replica sets to running entirely on 8.0. Most of the remaining ones are at various stages along the migration path. Now that most of our custom features have been ported to 8.0, updating to Oracle’s minor releases has been comparatively easier and we plan to keep pace with the latest versions.\n  First, we could not upgrade servers in place and needed to use logical dump and restore to build a new server. However, for very large mysqld instances, this can take many days on a live production server and this fragile process will likely be interrupted before it can complete. For these large instances, we had to modify our backup and restore systems to handle the rebuild.\n Second, it is much harder to detect API changes because 5.7 could have provided deprecation warnings to our application clients to fix potential issues. Instead, we needed to run additional shadow tests to find failures before we could migrate the production workloads. Using mysql client software that automatically escaped schema object names helps reduce the number of compatibility issues.\n Supporting two major versions within a replica set is hard. Once a replica set promotes its primary to be an 8.0 instance, it is best to disable and remove the 5.6 ones as soon as possible. Application users tend to discover new features that are supported only by 8.0, like  utf8mb4_0900  collations, and using these can break the replication stream between 8.0 and 5.6 instances.\n Despite all the hurdles in our migration path, we have already seen the benefits of running 8.0. Some applications have opted for early conversion to 8.0 to utilize features like Document Store and improved datetime support. We have been considering how to support storage engine features like Instant DDL on MyRocks. Overall, the new version greatly expands on what we can do with MySQL @ Facebook.", "posttime": "2021-07-24 07:17:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mysql,facebook,迁移", "title": "将 Facebook 迁移到 MySQL 8.0", "title_en": "Migrating Facebook to MySQL 8.0", "transed": 1, "url": "https://engineering.fb.com/2021/07/22/data-infrastructure/mysql/", "via": "", "real_tags": ["mysql", "facebook", "迁移"]}, {"category": "", "categoryclass": "", "imagename": "1fb89afefe117b7e27bc907c3544c11c.png", "infoid": 1069340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在致力于对 transactionfee.info 的主根支持进行工作时，很明显主网上已经存在一些 Pay-to-Taproot (P2TR) 输出。任何人都可以使用这些输出，但它们是非标准的，因此无法在比特币中的节点之间进行中继点对点网络。但是，矿池可以在其区块中包含非标准交易。我们涵盖了主网上已经存在的六个 P2TR 输出，并解释了为什么任何人都可以在主根激活之前使用这些输出。在 f2pool.com 矿池的帮助下，四个 P2TR 输出被捐赠给 brink.dev，一家专注于支持开源比特币开发的非营利公司。 Taproot 是对比特币协议的软分叉升级，并收紧了共识规则。软分叉一旦激活就会禁止之前允许的东西。 Taproot 限制了原生 SegWit 输出的使用方式，witnessversion 为 1 和一个 32 字节的见证程序。其他见证版本、嵌套隔离见证和原生隔离见证输出的支出规则，其见证版本为 1，但更长或更短的见证程序不受影响。虽然可以在主根激活之前创建 P2TR 输出，但不建议这样做。同样，钱包不应该在激活前生成 P2TR 地址。尽管如此，在撰写本文时，比特币主网上已经有六个 P2TR 输出。第一个 P2TR 输出是在 2019 年 12 月 17 日在来自 purse.io 的提款交易中创建的。 Matthew Zipkin 向见证版本 1 bech32 地址发起了 5431 sat 的提款，以测试发送对见证版本 1 的支持。他将他的测试结果添加到比特币 OptechCompatibility Matrix 中，并提供了一张显示在 thepurse.io 前端提款的屏幕截图。地址中编码的公钥是 010 10101 01010101 010 101010101010 10 10 101010101 0101010101 0 101010 101，这很可能不是由私钥生成的。假设这个公钥的私钥是未知的，一旦主根激活，资金将无法使用。第二个 P2TR 输出创建于 2020 年 1 月 28 日。值为 700sat，接近默认的 SegWit 灰尘阈值 294 sat。此输出的创建者未知。第三个、第四个和第五个 P2TR 输出是在检查发送支持到 Pieter Wuille 于 2020 年 10 月 19 日发布到比特币开发邮件列表的见证 v1 bech32 地址时创建的测试输出。第三个 P2TR 输出的值为 3656 sat 和由 Riccardo Casatta 使用 Blockstream Aqua 钱包创建。价值 50.000 sat 的第四个 P2TR 输出很可能是 Mike Schmidt 使用 BRD 钱包创建的。不知道是谁创建了第五个 P2TR 输出，值为 100.000 sat。第六个 P2TR 输出，值为 1324 sat，创建于 2021 年 7 月 7 日。它是在 2021 年 6 月 13 日锁定主根后创建的唯一 P2TR 输出。其他 P2TR 输出是在尚不清楚主根何时或是否会被创建时创建的启用。\n在主根激活之前，任何人都可以使用这六个 P2TR 输出。然而，这些 P2TR 输出还没有被花费，因为支出交易目前被认为是非标准的。非标准交易不会在比特币网络上中继。在接受交易到内存池之前，比特币核心会在 AreInputsStandard 函数中检查每个输入的标准性。如果花费的 UTXO 是 P2TR 输出，则该函数当前返回 false，表明交易具有非标准输入。节点不接受对其内存池的交易，并且不会将其转发给对等方。但是，当直接包含在一个区块中时，非标准交易仍然有效。在其他检查旁边，交易必须通过脚本验证。不检查标准。在 Bitcoin Core 中，VerifyScript 函数负责脚本验证。 SegWit 花费的脚本验证包括两部分：脚本评估和见证程序的验证。在脚本评估期间，首先评估 scriptSig。在从输入中引用的 UTXO 评估 scriptPubKey 时，结果堆栈用作初始堆栈状态。如果脚本评估完成且没有失败，堆栈不为空，并且堆栈顶部元素转换为真（不为零），则脚本评估成功。当使用原生 SegWit 输出（例如 P2TRoutputs）时，scriptSig 为空。 scriptPubKey 包含witnessversion 和witness 程序。由于 scriptSig 为空，因此使用空堆栈进行 scriptPubKey 评估。在那里，见证版本和见证程序被压入堆栈。脚本评估完成。由于堆栈不为空并且堆栈顶部元素是见证程序（通常不为零），脚本评估将成功。这种行为使 SegWit 成为软分叉。隔离见证交易对不支持隔离见证的节点有效，因为栈顶元素不为空。一旦主根激活，关键路径 P2TR 支出将是有效和标准的。任何人都可以支出的 P2TR 支出可能有一个空的见证人，但其他方面看起来是一样的。下一步，如果见证版本已知，则验证见证程序。如果见证版本未知，则将见证程序视为有效 1.在验证版本 1 见证程序期间（即当花费 P2TR 输出时）的第一个检查) 是如果设置了 SCRIPT_VERIFY_TAPROOT 脚本验证标志。如果未设置，则在检查见证程序之前验证成功。此标志仅在主根处于活动状态时设置。这导致主根输出在激活之前是任何人都可以使用的。见证程序未经过验证，见证可以留空。我们通过构建一个共识有效的非标准交易来证明在主根软分叉激活之前 P2TR 输出的支出。矿池 f2pool.com 通过在区块中包含非标准交易来提供帮助。对于我们的交易，我们从前面讨论的六个可用输出中选择第一个、第三个、第四个和第五个 P2TR 输出。值为 5.431 sat 的第一个输出在主根激活时将无法使用，否则将永远保留在 UTXO 集中。第三个（3.656 sat）、第四个（50.000 sat）和第五个（100.000 sat）P2TR 输出在测试交易中发送，知道资金很可能会丢失或捐赠给慈善机构。这使我们总共可以花费 159.087 sat。我们将另外两个 P2TR 输出（700 sat 和 1.324 sat）留给其他人在激活之前或之后使用。\n我们的交易包含两个输出。第一个输出将全部输入量 159.087 sat（在撰写本文时约为 50 美元）捐赠给 brink.dev，以支持开源比特币开发。交易故意不支付矿工费以最大化捐赠金额。第二个输出是一个 OP_RETURN 输出，带有指向此博客文章的链接。这使得找到任何人都可以花费的交易的人有可能更多地了解为什么在 Taproot 激活之前 P2TR 输出是可以花费的。 { “TxID添加”： “b10c007c60e14f9d087e0291d4d0c7869697c6681d979c6639dbd960792b4d41”， “散列”： “b10c007c60e14f9d087e0291d4d0c7869697c6681d979c6639dbd960792b4d41”， “版本”：1， “大小”：234， “VSIZE”：234， “重量”：936， “LOCKTIME”：45324， “VIN” : [ { &quot;txid&quot; : &quot;b53e3bc5edbb41b34a963ecf67eb045266cf841cab73a780940ce6845377f141&quot;, &quot;vout&quot; : 0, &quot;scriptSig&quot; : { &quot;asm,&quot; 7&quot;, &quot;16&quot;, &quot;16&quot;, &quot;7&quot;, &quot;4 b48a59fa9e036e997ba733904f631b1a64f5274be646698e49fd542141ca9404&quot; ， “VOUT”：0 “scriptSig”：{ “ASM”： “”， “六角”： “”}， “序列”：45324}，{ “TxID添加”： “7641c08f4bd299abfef26dcc6b477938f4a6c2eed2f224d1f5c1c86b4e09739d”， “VOUT”：1 , &quot;scriptSig&quot; : { &quot;asm&quot; : &quot;&quot; , &quot;hex&quot; : &quot;&quot; }, &quot;sequence&quot; : 45324 }, { &quot;txid&quot; : &quot;fd43650477e0ba6825ae0482a8b0b2b509d5443fa2a87127s&quot;{ig2a87271ds&quot;,scripta87s, dd0as &quot;, sig2a87271d&quot; &quot; : &quot;&quot; , &quot;hex&quot; : &quot;&quot; }, &quot;sequence&quot; : 45324 }], &quot;vout&quot; : [ { &quot;value&quot; : 0.00159087, &quot;n&quot; : 0, &quot;scriptPubKey&quot; : { &quot;asm&quot; : &quot;OP_HASH160 fb94f9a556bae3f98f44186e1c caa4f5ff6a3187 OP_EQUAL”， “六角”： “a914fb94f9a556bae3f98f44186e1ccaa4f5ff6a318787”， “reqSigs”：1， “类型”： “scripthash”， “地址”：[ “3QdFzfpU3u92GeRN4U5pLLezbBaHbj2ppr”]}}，{ “值”：0.00000000中， “n”：1 “scriptPubKey”：{ “ASM”： “OP_RETURN 68747470733a2f2f623130632e6d652f37”， “六角”： “6a1168747470733a2f2f623130632e6d652f37”， “类型”： “nulldata”}}]}当在块709632直根激活，比特币核心v0.21.1和newerwill开始执行主根规则。只有通过为密钥路径花费提供有效签名或满足脚本路径花费的脚本要求，才有可能花费 P2TR。但是，不知道主根软分叉的旧节点将继续将 P2TR 花费视为任何人都可以花费。例如，如果矿池忘记升级并包含来自 P2TR 输出的交易支出，而没有满足网络强制执行的主根规则，这可能会成为一个问题。链将在执行主根的升级节点和未升级节点之间分裂。建议在激活主根之前升级生产和支付处理节点。我要感谢 f2pool.com 的合作。如果没有他们在一个区块中包含非标准交易，将 P2TR 输出捐赠给 brink.dev，将是不可能的。这允许通过未来的软分叉向当前未使用的见证版本引入新规则。见证程序验证在不知道软分叉的节点上成功。 ↩︎", "note_en": "While working on taproot support for  transactionfee.info, it became apparentthat there already exist a few  Pay-to-Taproot (P2TR) outputs on mainnet.Anyone can spend these outputs, but they are non-standard and thus not relayedbetween nodes in the Bitcoin peer-to-peer network. However, a mining pool caninclude non-standard transactions in their block.We cover the six P2TR outputs already present on mainnet and explainwhy the outputs can be spent by anyone before taproot activates. With the helpof the  f2pool.com mining pool, four P2TR outputs are donated to  brink.dev,a non-profit company focused on supporting open-source Bitcoin development.\n  Taproot is a softfork upgrade to the Bitcoin protocol and tightens theconsensus rules. A softfork forbids something that was previously allowedonce it activates. Taproot restricts how native SegWit outputs, with a witnessversion of 1 and a 32-byte witness program, can be spent. The spending rules forother witness versions, nested SegWit, and native SegWit outputs with a witnessversion of 1, but longer or shorter witness programs are unaffected.\n  While it is possible to create P2TR outputs before taproot activates, it is notrecommended to do so. Likewise,  wallets shouldn’t generate P2TR addressesbefore activation. Nonetheless, at the time of writing, there are already sixP2TR outputs on Bitcoin mainnet.\n The first P2TR output was created on December 17, 2019, in a withdrawal transaction from purse.io. Matthew Zipkin initiated a withdrawalof 5431 sat to a witness version 1 bech32 address to test sending support forwitness version 1. He  added his test results to the  Bitcoin OptechCompatibility Matrix and provided a  screenshot showing the withdrawal on thepurse.io frontend. The public key encoded in the address is 010​10101​01010101​010​101010101010​10​10​101010101​0101010101​0​101010​101, which islikely not generated from a private key. It is to be assumed that the privatekey to this public key is unknown, and the funds won’t be spendable once taprootactivates.\n The  second P2TR output was created on January 28th, 2020. With a value of 700sat, it is close to the default SegWit dust threshold of 294 sat. The creator ofthis output is unknown.\n The third, fourth, and fifth P2TR outputs are test outputs created whilechecking send support to a witness v1 bech32 addresses that Pieter Wuille posted to the bitcoin-dev mailing list on October 19th, 2020.The  third P2TR output has a value of 3656 sat and was created by Riccardo Casatta using the Blockstream Aqua wallet. The  fourth P2TR outputwith a value of 50.000 sat was likely created by  Mike Schmidt using theBRD wallet. It’s unknown who created the  fifth P2TR outputwith a value of 100.000 sat.\n The  sixth P2TR output, with a value of 1324 sat, was created on July7th, 2021. It is the only P2TR output created after taproot locked in onJune 13th, 2021. The other P2TR outputs were created while it was still unclearwhen or if taproot would activate.\n  Before taproot activates, these six P2TR outputs can be spent by anyone. Hoever,none of these P2TR outputs have been spent yet, as the spending transaction iscurrently considered non-standard. Non-standard transactions aren’t relayed onthe Bitcoin network. Bitcoin Core checks each input for standardness in the AreInputsStandard function before accepting a transaction to the mempool. Ifthe  spend UTXO is a P2TR output, the function currently returns  false,indicating that the transaction has non-standard inputs. Nodes don’t accept thetransaction to their mempool and it is not relayed to peers.\n However, a non-standard transaction can still be valid when directly included ina block. Next to other checks, the transaction has to pass the scriptverification. Standardness is not checked. In Bitcoin Core, the   VerifyScriptfunction is responsible for script verification. The script verification fornative SegWit spends consists of two parts: the script evaluation and theverification of the witness program.\n During script evaluation, the  scriptSig is evaluated first. The resultingstack is used as the initial stack state when evaluating the  scriptPubKey fromthe UTXO referenced in the input. The script evaluation succeeds if it finisheswithout failing, the stack is not empty, and the top stack element casts to true (is not zero). When spending native SegWit outputs like, for example, P2TRoutputs, the  scriptSig is empty. The  scriptPubKey contains the witnessversion and the witness program. As the  scriptSig is empty, an empty stack isused for the  scriptPubKey evaluation. There, the witness version and witnessprogram are pushed onto the stack. The script evaluation finishes. As the stackisn’t empty and the top stack element is the witness program (which usuallyisn’t zero), the script evaluation will succeed. This behavior makes SegWit asoftfork. SegWit transactions are valid for nodes without SegWit support as thetop stack element is not empty.\n  A keypath P2TR spend that will be valid and standard once taproot activates.A anyone-can-spend P2TR spend will likely have an empty witness, but otherwiselook the same.\n As a next step, the witness program is verified if the witness version is known.If the witness version is unknown, the witness program  is treated as valid   1.One of the first checks during verification of version 1 witness programs (i.e.when spending P2TR outputs) is if the  SCRIPT_VERIFY_TAPROOT script verificationflag is set.  If unset, the verification succeeds before checking the witnessprogram. This flag is only set  when taproot is active. This causestaproot outputs to be anyone-can-spend before activation. The witness programisn’t verified, and the witness can be left empty.\n  We demonstrate the spending of P2TR outputs before the taproot softfork activatesby constructing a non-standard transaction that is consensus valid. The miningpool  f2pool.com helps by including the non-standard transaction in a block.\n For our transaction, we pick the first, third, fourth, and fifth P2TR output outof the six available outputs discussed earlier. The first output with a value of5.431 sat will be unspendable upon taproot activation and would otherwise remainin the UTXO-set forever. The third (3.656 sat), fourth (50.000 sat), and fifth(100.000 sat) P2TR output were sent in test transactions with the knowledge thatthe funds will most likely be lost or donated to charity. This allows us tospend a total of 159.087 sat. We leave the other two P2TR outputs (700 sat and1.324 sat) for someone else to spend either before or after activation.\n Our transaction contains two outputs. The first output donates the full inputamount of 159.087 sat (about 50 USD at the time of writing) to  brink.dev tosupport open-source Bitcoin development. The transaction purposefully doesn’tpay a miner fee to maximize the donation amount. The second output is anOP_RETURN output with a link to this blog post. This makes it possible forsomeone finding the anyone-can-spend transaction to learn more about why theP2TR outputs were spendable before Taproot activation.\n     {  &#34;txid&#34; :  &#34;b10c007c60e14f9d087e0291d4d0c7869697c6681d979c6639dbd960792b4d41&#34; ,  &#34;hash&#34; :  &#34;b10c007c60e14f9d087e0291d4d0c7869697c6681d979c6639dbd960792b4d41&#34; ,  &#34;version&#34; :  1 ,  &#34;size&#34; :  234 ,  &#34;vsize&#34; :  234 ,  &#34;weight&#34; :  936 ,  &#34;locktime&#34; :  45324 ,  &#34;vin&#34; :  [  {  &#34;txid&#34; :  &#34;b53e3bc5edbb41b34a963ecf67eb045266cf841cab73a780940ce6845377f141&#34; ,  &#34;vout&#34; :  0 ,  &#34;scriptSig&#34; :  {  &#34;asm&#34; :  &#34;&#34; ,  &#34;hex&#34; :  &#34;&#34;  },  &#34;sequence&#34; :  6817749  },  {  &#34;txid&#34; :  &#34;b48a59fa9e036e997ba733904f631b1a64f5274be646698e49fd542141ca9404&#34; ,  &#34;vout&#34; :  0 ,  &#34;scriptSig&#34; :  {  &#34;asm&#34; :  &#34;&#34; ,  &#34;hex&#34; :  &#34;&#34;  },  &#34;sequence&#34; :  45324  },  {  &#34;txid&#34; :  &#34;7641c08f4bd299abfef26dcc6b477938f4a6c2eed2f224d1f5c1c86b4e09739d&#34; ,  &#34;vout&#34; :  1 ,  &#34;scriptSig&#34; :  {  &#34;asm&#34; :  &#34;&#34; ,  &#34;hex&#34; :  &#34;&#34;  },  &#34;sequence&#34; :  45324  },  {  &#34;txid&#34; :  &#34;fd43650477e0ba6825ae0482a8b0b2b509d5443fa2a8cdd101872752a9171dd6&#34; ,  &#34;vout&#34; :  1 ,  &#34;scriptSig&#34; :  {  &#34;asm&#34; :  &#34;&#34; ,  &#34;hex&#34; :  &#34;&#34;  },  &#34;sequence&#34; :  45324  }  ],  &#34;vout&#34; :  [  {  &#34;value&#34; :  0.00159087 ,  &#34;n&#34; :  0 ,  &#34;scriptPubKey&#34; :  {  &#34;asm&#34; :  &#34;OP_HASH160 fb94f9a556bae3f98f44186e1ccaa4f5ff6a3187 OP_EQUAL&#34; ,  &#34;hex&#34; :  &#34;a914fb94f9a556bae3f98f44186e1ccaa4f5ff6a318787&#34; ,  &#34;reqSigs&#34; :  1 ,  &#34;type&#34; :  &#34;scripthash&#34; ,  &#34;addresses&#34; :  [  &#34;3QdFzfpU3u92GeRN4U5pLLezbBaHbj2ppr&#34;  ]  }  },  {  &#34;value&#34; :  0.00000000 ,  &#34;n&#34; :  1 ,  &#34;scriptPubKey&#34; :  {  &#34;asm&#34; :  &#34;OP_RETURN 68747470733a2f2f623130632e6d652f37&#34; ,  &#34;hex&#34; :  &#34;6a1168747470733a2f2f623130632e6d652f37&#34; ,  &#34;type&#34; :  &#34;nulldata&#34;  }  }  ] }\n     When taproot activates on block 709632, Bitcoin Core v0.21.1 and newerwill start enforcing the taproot rules. Spending P2TR will only be possibleby supplying a valid signature for the keypath spend or a by satisfying thescript requirements for a scriptpath spend. However, older nodes thatdon’t know about the taproot softfork will continue to treat the P2TR spends asanyone-can-spend. This can become a problem if, for example, a mining poolforgets to upgrade and includes a transaction spending from a P2TR outputwithout satisfying the taproot rules enforced by the network. The chain wouldsplit between upgraded nodes enforcing taproot and not upgraded nodes.It is recommended to upgrade production and payment handling nodes beforetaproot activates.\n I like to thank  f2pool.com for their cooperation. Without them includingthe non-standard transaction in a block, donating the P2TR outputs to brink.dev, wouldn’t have been possible.\n This allows introducing of new rules to currently unused witness versionsvia a future softforks. The witness program verification succeeds at nodesunaware of the softfork.  ↩︎", "posttime": "2021-07-24 07:17:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pay,输出", "title": "激活前任何人都可以使用 Pay-to-Taproot 输出", "title_en": "On anyone-can-spend Pay-to-Taproot outputs before activation", "transed": 1, "url": "https://b10c.me/blog/007-spending-p2tr-pre-activation/", "via": "", "real_tags": ["pay", "输出"]}, {"category": "", "categoryclass": "", "imagename": "c244eaf36330b2b46e1bd3a905b322a0.jpg", "infoid": 1069338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "浏览互联网可能会感觉很多。有可爱的动物视频、植物父母团体、鼓舞人心的时尚达人和许多#movements 的信息。但也有很多坏消息、仇恨言论和骚扰、鲶鱼、错误信息等等。 “互联网可以让我们敞开心扉，看到许多我们从未遇到过的事情。这是它最美丽、最神奇的事情之一。但它也会分散我们的注意力，让我们感到支离破碎，”克里斯·斯特德曼说，IRL：在我们的数字生活中寻找真实性、意义和归属感的作者。我是天秤座，这意味着我生来寻求平衡，我想将这一原则应用于我的社交媒体行为和消费。这是一个持续不断的个人项目，但如果您也想做某事，这里有四个技巧可以帮助您入门。应用程序和社交媒体公司正在争夺消费者的注意力，这已经不是什么秘密了。在应用程序或平台上花费的时间越多越好。这意味着已经做出了一系列设计选择，以缓慢但肯定地让我们锁定。 当媒体研究 Shaka McGlotten 教授使用 Facebook 或 Twitter 等应用程序时，他们有时想知道使用社交媒体是否可以被视为一种双方同意的互动观点。我们的社交媒体行为有多少是我们自己的，又有多少受媒体本身的影响？这个故事来自 Life Kit，这是 NPR 的播客系列，旨在帮助改善生活——涵盖从锻炼到养育孩子再到结交朋友的方方面面。如需更多信息，请注册时事通讯并在 Twitter 上关注@NPRLifeKit。\n这个问题似乎与我们与社交媒体的关系无关，但与任何关系一样，麦格洛滕也在购买学院-纽约州立大学教授人类学，他说退后一步思考关系本身的性质很重要。 “我认为在这段关系中，值得一提的是，我们是否应该总是这样说，‘好吧，我必须把它放在一起……然后停止厄运滚动。这取决于我，’”麦格洛滕说。 “当公司自己可以做出某些类型的选择时，这会让我们更容易一些。”他们正在谈论诸如下拉刷新、无限滚动、自动播放等功能以及这些平台用来向您展示更多他们认为您喜欢的内容的算法。 McGlotten 说，鼓励更健康行为的责任不仅在于我们作为用户，也在于我们的合作伙伴（公司）。在考虑您的角色和责任是平衡您的数字饮食时，牢记这一点是很好的第一步。对我们在社交媒体上花费多少时间感到担忧的部分原因可能是因为人们认为社交媒体并不总是被认为是“真实的”体验——这是一种需要控制的轻率习惯。事实并非完全如此，Stedman 说，IRL 作者。 “我们告诉自己，线上的生活不如线下的生活真实。实际上并没有以同样的方式计算，”斯特德曼说。 “这意味着，如果我们在网上看到自己习惯中的某些东西让我们感到不舒服，我们可以将其挥之不去。”斯特德曼说，如果我们要与社交媒体建立更健康的关系，我们就必须停止将其视为一种无意识的活动，而应开始将其视为一种有意义的活动，并有可能揭示有关我们自己的某些真相。\n当你在线时，你是谁？你最近有没有看过你的时间表？滚动浏览您的个人资料并查看您的推文和帖子 - 您向世界发布了什么？你喜欢你看到的吗？要谨慎定义您想要的社交媒体关系，您可以问问自己：如果您像我一样在互联网上花费大量时间，花一些时间来整理您的数字空间——就像您一样您家的任何部分 - 都会有所帮助。至少每年一次，我会在 Twitter、Instagram 和 TikTok 上浏览我的“关注”列表，并将其清理干净。我问自己：什么帐户给我带来快乐、帮助我学习、挑战我或以其他方式为我的生活带来价值？哪些不是？我关闭了大多数通知，以便在我与社交媒体互动时有更多的控制权。我还可以快速使用阻止、静音和其他功能，这些功能让我可以限制不想看到的内容类型。有点像修剪你的社交媒体花园！每隔一段时间，你可能会看到一个朋友发帖说他们正在做社交媒体“排毒”，为 Lentor 放弃一个特定的平台，甚至永久删除所有内容。极度在线并不适合所有人——尤其是那些知名度高或遭受骚扰的人。互联网通常不好玩。但是，如果您确实想继续参与，将休息时间纳入您的社交媒体日常活动以保持平衡感可能会有所帮助。斯特德曼说，这些小休息的功能与休假或下班休假的方式相同。\n它不必是永远的，甚至不必每次都一样长——只要确保你给自己留出空间，有意识地退后以获得一些观点。花一些时间与外界断开联系并独处，感到无聊并收集自己的想法和意见。如果有帮助，您甚至可以计划定期执行此操作。正如斯特德曼所说，如果你想改变与社交媒体的关系，你必须做出承诺。他说：“这是一种经常性的做法，不断地检查自己并随着在线景观的变化以及你作为一个人、你自己的需求和你的生活环境的变化而重新调整。”本集的音频部分由 Audrey Nguyen 制作，Brian Jarboe 提供音频工程支持。我们很乐意听取您的意见。给我们留言 202-216-9823，或发送电子邮件至 LifeKit@npr.org。如需更多 Life Kit，请订阅我们的时事通讯。", "note_en": "Navigating the internet can feel like  a lot. There&#39;s cute animal videos, plant parent groups, inspiring fashionistas and information on many #movements. But there&#39;s also plenty of bad news, hate speech and harassment, catfishing, misinformation and more.\n  &#34;The Internet can crack us open to seeing so many things that we would have never encountered otherwise. And that&#39;s one of the most beautiful, miraculous things about it. But it can also divide our attention and make us feel fractured,&#34; says  Chris Stedman, author of   IRL: Finding Realness, Meaning, and Belonging in our Digital Lives.\n     I&#39;m a Libra which means I was born to find balance, and I wanted to apply that principle to my social media behaviors and consumption.\n  It&#39;s a constant ongoing individual project, but if it&#39;s something that you want to do, too, here are four tips I&#39;ve come across to help you get started.\n       It&#39;s no secret that apps and social media companies are competing for consumers&#39; attention. The more time spent on an app or platform, the better. And that means a series of design choices have been made, to slowly but surely keep us locked in.\n  When media studies Professor  Shaka McGlotten uses an app like Facebook or Twitter, they sometimes wonder whether using social media can be considered a consensual interaction at this point. How much of our social media behavior is ours and how much of it is influenced by the medium itself?\n    This story comes from  Life Kit, NPR&#39;s family of podcasts to help make life better — covering everything from exercise to raising kids to making friends. For more,  sign up for the newsletter and follow  @NPRLifeKit on Twitter.\n   It&#39;s a question that may seem unrelated to our relationship to social media, but like any relationship, McGlotten, who also  teaches anthropology at Purchase College-SUNY, says it&#39;s important to take a step back and think about the nature of the relationship itself.\n  &#34;I think it&#39;s worth asking in this relationship whether it should always fall upon us to be like, &#39;OK, I just got to pull it together...and just stop  doomscrolling. It&#39;s up to me,&#39;&#34; McGlotten says. &#34;When the companies themselves could make certain kinds of choices that would make it a little bit easier for us.&#34;\n  They&#39;re talking about features like pull to refresh, endless scroll, autoplay and the algorithms these platforms use to show you more of what they think you like.\n     McGlotten says, the onus isn&#39;t just on us as users but also on our partners (the companies), to encourage healthier behaviors. Keeping that in mind is a good first step when thinking about what your part and responsibility is balancing your digital diet.\n    Part of the hand wringing around how much time we spend on social media may stem from the belief that it&#39;s not always considered a &#34;real&#34; experience — that it&#39;s a frivolous habit that needs to be reigned in. That&#39;s not entirely the case, says Stedman, the  IRL author.\n    &#34;We&#39;ve told ourselves that life online is less real than life offline. It doesn&#39;t really count in the same way,&#34; Stedman says. &#34;What that means is if we see something in our own habits online that makes us uncomfortable, we can just kind of wave it off.&#34;\n     Stedman says if we&#39;re going to have a healthier relationship with social media, we&#39;ve got to stop thinking of it as a mindless activity and start thinking of it as a meaningful one with the potential to reveal certain truths about ourselves.\n  Who are you when you&#39;re online? Have you taken a look at your timeline recently? Scroll through your profile and look at your tweets and posts — what are you putting out into the world? Do you like what you see?\n    To mindfully define the relationship that you want with social media, you can ask yourself:\n        If you&#39;re someone, like me, who spends a lot of time on the internet, taking some time to spruce up your digital space — the same way you would any part of your home — can be helpful.\n  At least once a year, I go through my &#39;following&#39; list on Twitter, Instagram and TikTok, and clean it out. I ask myself: What accounts are bringing me joy, helping me learn, challenging me or otherwise bringing value to my life? Which ones aren&#39;t?\n  I&#39;ve turned off most notifications to have a bit more control of when I engage with social media. I&#39;m also quick with block, mute and other functions that let me restrict the kind of content I don&#39;t want to see. Kind of like pruning your social media garden!\n    Every once in a while, you may see a friend post that they&#39;re doing a social media &#34;detox,&#34; giving up a particular platform for Lentor even deleting everything for good. Being extremely online isn&#39;t for everyone — especially people who have high visibility or who suffer from harassment. The internet is often  not fun.\n        But if you do want to continue to engage, it can be helpful to incorporate breaks into your social media routine to maintain a sense of balance. Stedman says these little breaks function the same way a sabbatical or vacation from work does.\n  It doesn&#39;t have to be forever or even the same length every time — just make sure you&#39;re giving yourself the space to intentionally step back to get some perspective. Take some time away to disconnect and be alone, be bored and gather your own thoughts and opinions. You can even plan to do this regularly if it helps.\n  Like Stedman says, if you want to change your relationship with social media, you gotta commit.\n  &#34;It&#39;s a regular practice of constantly checking in with yourself and recalibrating as both the landscape online changes and you as a person and your own needs and and the circumstances of your life change as well,&#34; he says.\n    The audio portion of this episode was produced by   Audrey Nguyen,  with audio engineering support from Brian Jarboe.\n    We&#39;d love to hear from you. Leave us a voicemail at 202-216-9823, or email us at LifeKit@npr.org. For more Life Kit,   subscribe to our newsletter .", "posttime": "2021-07-24 07:16:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,社交,relationship", "title": "粘在你的手机上？以下是如何重新思考您与社交媒体的关系", "title_en": "Glued to Your Phone? Here's How to Rethink Your Relationship with Social Media", "transed": 1, "url": "https://www.npr.org/2021/07/16/1016854764/social-media-balance-relationship-boundaries", "via": "", "real_tags": ["手机", "社交"]}, {"category": "", "categoryclass": "", "imagename": "34afa80e2a658d3608af0a50877a34f9.jpeg", "infoid": 1069337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我花了将近二十年的时间写博客、发表演讲和发布开源代码。这对我的职业生涯来说非常棒，而且工作量很大。但这里有一个有用的秘密：你根本不需要在公共创造力上投入太多工作，就可以在求职者中脱颖而出。我已经面试了数百人，并筛选了数百份简历——主要是针对旧金山这个竞争异常激烈的就业市场的技术职位。绝大多数候选人在公共场合几乎没有创造力的证据。对于我共事过的许多最优秀的工程师来说，情况也是如此。作为一名招聘经理，这意味着你必须学习如何有效地寻找候选人和面试：你不想错过一个伟大的工程师，因为他们把所有的精力都花在为以前的雇主制作伟大的产品上，而不是写博客、演讲并公开编码。但是作为候选人，这意味着您可以通过相对较少的工作量从人群中脱颖而出，从而为自己提供很大的优势。开始写博客。每年向它发布一两次有趣的技术文章——一些你学到的东西，或者你已经修复的错误，或者你已经解决的问题。几年后完全停止打扰，但将博客留在网上。搭建一个个人小项目，把代码放到GitHub上。随附一份自述文件，其中包含项目的详细描述和实际操作的屏幕截图——几乎没有人这样做，它只需要额外花费几个小时，而且它极大地增加了您的项目对正在检查您的招聘经理的影响出去。\n而已。一两篇博文。也许是一个 GitHub 存储库。信不信由你，如果你面对一群其他候选人（尤其是在你职业生涯的早期），他们可能不会有这样的事情。你会直接跳到招聘经理心目中的最顶端，也许他们甚至没有注意到。如果您想投入更多精力，您还可以做更多事情：在 Twitter 上建立受众、开始时事通讯、制作视频、发表演讲（最好是在线录制和发布）、发布开源包、发布 TIL——但老实说如果您的目标是更轻松地通过面试过程，您很快就会遇到收益递减规律。如果你打算做这些事情，那就是因为你想发展这些技能并与世界分享和学习——不要只是因为你认为这是被录用的关键途径。如果你想从其他候选人中脱颖而出，甚至有一段文字或发布的代码来展示你所构建的东西都是一个很好的方式来做到这一点 https://t.co/QfYEWxfIet - Simon Willison (@simonw ) 2021 年 7 月 17 日", "note_en": "I’ve spent nearly twenty years blogging, giving talks and releasing open source code. It’s been fantastic for my career, and a huge amount of work. But here’s a useful secret: you don’t have to put very much work at all into public creativity in order to stand out as a job candidate.\n I’ve interviewed hundreds of people, and screened hundreds more resumes—mostly for tech roles in San Francisco, an extremely competitive job market.\n The vast majority of candidates have little to no evidence of creativity in public at all. The same is true for many of the best engineers I have worked with.\n As a hiring manager, this means you have to learn how to source candidates and interview effectively: you don’t want to miss out on a great engineer just because they spent all of their energy making great products for prior employers rather than blogging, speaking and coding in public.\n But as a candidate, this means you can give yourself a big advantage in terms of standing out from the crowd with a relatively small amount of work.\n Start a blog. Post an interesting technical article to it once or twice a year—something you’ve learned, or a bug you’ve fixed, or a problem you’ve solved. After a few years stop bothering entirely, but leave the blog online somewhere.\n Build a small personal project and put the code on GitHub. Accompany it with a README with a detailed description of the project and screenshots of it in action—almost no-one does this, it only takes a few hours extra and it massively increases the impact your project will have on hiring managers who are checking you out.\n That’s it. One or two blog posts. Maybe a GitHub repository. Believe it or not, if you are up against a bunch of other candidates (especially earlier on in your career) they likely won’t have anything like that. You will jump straight to the top of the hiring manager’s mental list, maybe without them even noticing.\n There’s plenty more you can do if you want to put the effort in: build an audience on Twitter, start a newsletter, make videos, give talks (ideally that get recorded and published online), release open source packages, publish  TILs—but honestly if your goal is to get through the interview process more easily you will very quickly hit the law of diminishing returns.\n If you’re going to do that stuff do it because you want to develop those skills and share with and learn from the world—don’t just do it because you think it’s a critical path to being hired.\n  If you want to stand out from other candidates, having even one piece of writing or published piece of code that shows something you’ve built is a great way to do that  https://t.co/QfYEWxfIet\n- Simon Willison (@simonw)  July 17, 2021", "posttime": "2021-07-24 07:16:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "脱颖而出,public,发布", "title": "作为求职者脱颖而出并不需要太多的公共创造力", "title_en": "It doesn't take much public creativity to stand out as a job candidate", "transed": 1, "url": "https://simonwillison.net/2021/Jul/17/standing-out/", "via": "", "real_tags": ["脱颖而出", "public", "发布"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "级别 1 根据您的需要，AGPL 是一种选择。它不会阻止第三方将您的开源软件作为服务运行，但它确实要求他们将源代码提供给所有用户（因此，用户可以根据需要获取修改后的代码并自行运行） .或者，您可以使用 CC BY-NC-SA 许可证，该许可证禁止所有商业用途，并要求衍生作品在同一许可证下发布。在我的脑海中，我不知道任何允许内部商业使用但禁止将基于软件的服务作为产品销售的许可证，如果这就是你的意思的话。级别 2 我知道 Elastic License V2 接近了。但显然它不被视为开源许可证:( 级别 1 我认为你的问题与许多企业家问“如果有人窃取我的想法怎么办”不同？你的 OSS 很可能是下一个切片面包，但如果你处于一个位置云提供商将其作为服务出售的地方，你已经做到了。你可以通过多种方式赚钱，包括提供增值服务、高级支持等。有多种方法可以通过流行的 OSS 工具获利。级别 1 可以” t 完成。如果它是*适当的* OSS，根据定义，它的开放程度足以供 AWS 使用。阻止 AWS 使用它的限制将使其不再是开源的。\n这就是为什么darklang 是“源可用”而不是开源的部分原因。人们仍然可以查看来源以了解正在发生的事情，如果他们愿意，可以贡献等等。如果您的用户自己运行您的软件很有价值，那么这对您来说不是最好的许可证。在我们的例子中，我们没有创建我们希望我们的用户运行的东西，所以这就是我们使用这个特定许可证的原因。级别 1 您可以选择您最喜欢的任何许可证（GPLv2、GPLv3、MIT、AGPL 等等），但对其进行修改以在末尾添加类似内容：“属于以下各项的子公司、拥有或控制的公司公司，或以下公司的官员，没有获得使用该软件的许可：正如其他人所说，AGPL通常是一个不错的选择。目前尚不完全清楚它的禁止和要求，因此mega-corps对使用任何 AGPL。您也可以对您编写的代码进行双重许可（针对大众的 AGPL，亚马逊的专有许可，如果他们想为他们不过敏的许可付费）但如果您正在合并来自一般人的代码贡献在你开始接受贡献之前，拥有一个 Audacity/Muse 风格的 CLA 会有所帮助，这样那些不想为专有许可证做出贡献的人可以避免为你的项目做出贡献。级别 1 有些大公司不会使用WTFPL 许可软件：Go ogle 和英特尔肯定不会。\n级别 1 我看到其他地方推荐的知识共享许可。请注意，不建议将它们用于软件。见：https://creativecommons.org/faq/#can-i-apply-a-creative-commons-license-to-software level 1 知识产权法是胡说八道，只让律师致富。专注于最大程度提高软件质量的方面。在公共领域许可它。举个例子，sqlite 比它好得多。如果它有用但具有限制性许可证，则很可能有人会更宽容地重写它，届时将停止使用限制性版本。", "note_en": "level 1  Depending on what you want, AGPL is one option. It won’t stop a third party from running your open-source software as a service, but it does require that they provide the source code to all users (hence, the users could take the modified code and run it themselves if they wanted).\n Alternatively you could use a CC BY-NC-SA license which prohibits all commercial use and requires that derivative works are published under the same license.\n Off the top of my head I am not aware of any licenses that would allow internal commercial use but prohibit selling a service based on the software as a product, should that be what you mean.\n level 2  I know Elastic License V2 comes close. But apparently it&#39;s not considered an open-source license :(\n  level 1  I think your question is not unlike many entrepreneurs ask &#34;what if someone steals my idea&#34;?\n Your OSS might well be the next sliced bread, but if you are in a position where cloud providers are selling it as a service, you have it made. You can make money in multiple ways, including providing value-add services, premium support, etc. There are  multiple ways to monetize a popular OSS tool.\n level 1  Can&#39;t be done. If it&#39;s *proper* OSS, the it&#39;s by definition open enough for AWS to use. A restriction that prevents AWS from using it would make it no longer open source.\n This is part of why darklang is &#34;Source Available&#34; instead of open source. People can still see the source to understand what&#39;s going on, contribute if they wish, etc.\n  If it&#39;s valuable for your users to run your software themselves, this won&#39;t be the best license for you. In our case, we&#39;re not creating something we want our users to run, so that&#39;s why we used this particular license.\n level 1  You could pick whatever license you like the most (GPLv2, GPLv3, MIT, AGPL, whatever) but modify it to add something like this at the end:\n &#34;Companies which are a subsidiary of, owned by, or controlled by the following companies, or by the officers of the following companies, are not licensed to use this software:\n  As others have mentioned, AGPL is generally a good choice. It&#39;s not yet entirely clear what it prohibits and requires, so mega-corps are extremely allergic to using anything that is AGPL.\n You can also dual-license code you write (AGPL for the masses, proprietary license for Amazon if they want to pay for a license they&#39;re not allergic to) but if you are incorporating code contributions from the general public it would help to have an Audacity/Muse-style CLA in place before you start accepting contributions, so that people who don&#39;t want to contribute to a propriety license can avoid contributing to your project.\n level 1  Some bigcos won’t use WTFPL-licensed software: Google and Intel certainly won’t.\n level 1  I saw a Creative Commons license recommended elsewhere. Please be aware that they&#39;re not recommended for software. See:  https://creativecommons.org/faq/#can-i-apply-a-creative-commons-license-to-software\n level 1  Intellectual property laws are nonsense to make only lawyers rich. Focus on what will maximally improve the quality of the software. License it in the public domain. As an example, sqlite is so much better off for it. If it&#39;s useful but has a restrictive license, odds are that someone will rewrite it more permissively, at which time the restrictive version will cease to be used.", "posttime": "2021-07-24 07:15:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,project", "title": "使用什么许可证来防止 AWS 等。将我的项目作为服务出售？", "title_en": "What license to use to prevent AWS et al. from selling my project as a service?", "transed": 1, "url": "https://www.reddit.com/r/opensource/comments/oqalj1/what_license_should_i_use_to_prevent_aws_e_al/", "via": "", "real_tags": ["服务", "project"]}, {"category": "", "categoryclass": "", "imagename": "f020a06936f6fe91ef3703317e545ba6.jpg", "infoid": 1069335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook 宣布了一个新的 API，可以让开发人员将来自 Quest 2 传感器的视频整合到他们的游戏和应用程序中，从而创造一种混合现实体验。借助 Passthrough API，开发人员不仅能够将头显传感器的黑白​​图像混合到他们的体验中，而且还能够自定义它最终对玩家的看法、应用效果和甚至让真实世界出现在特定的表面上。 Facebook 的公告包括 API 如何通过允许集成现实键盘和办公桌来提高软件生产力的示例，以及游戏如何包含您的真实家具以供敌人躲在后面。也很容易想象将您的真实环境与虚拟世界混合在一起的其他有趣体验 - 您在自己的房子里解决门户式的谜题，或者能够看到您的墙壁被虚拟油漆覆盖？当被问及与第一代 Quest 的兼容性时，Facebook 告诉 UploadVR，该 API 目前仅适用于 Quest 2。在公告中，Facebook 表示 API 的图像处理是在设备上完成的，使用它的应用程序将无法查看或存储来自 Quest 2 传感器的图像。 Facebook 正在将 API 的实验版本添加到其即将推出的开发人员工具中，它将首先提供给使用 Unity 构建软件的程序员。 Facebook 承诺该 API 将在未来获得对其他开发平台的支持。 Quest、Quest 2 和 Rift S 耳机已经有一个 Passthrough 技术版本，可以让用户快速了解现实世界中发生的事情。 Facebook 还允许你将 Passthrough 设置为你的虚拟环境，为你提供一个真实环境的版本（尽管是黑白的），你可以在其中导航 Oculus UI。它甚至在关于其无限办公室功能的视频中展示了这种能力。长期以来，将您的真实环境集成到虚拟世界的能力一直是带有集成摄像头的耳机的更令人兴奋的承诺之一。微软甚至在将其 VR 平台命名为 Windows Mixed Reality 时引用了这个想法（无论实际交付了多少）。然而，Oculus 的 API 的消息并不意味着您今天就可以拿起耳机并拥有混合现实体验。 Facebook 在其公告中表示，它希望让开发人员在“今年晚些时候”向玩家提供使用 Passthrough 的软件。尽管如此，这个 API 对开发人员的可用性还是令人兴奋的，因为它应该允许在 Oculus 平台上获得新的体验类型。", "note_en": "Facebook announced a new API that will let developers incorporate video from the Quest 2’s sensors into their games and applications, creating a mixed reality experience. With the Passthrough API, developers will not only be able to mix the black-and-white images from the headset’s sensors into their experiences, but they’ll also be able to customize how it ends up looking to the player, apply effects, and even have the real world show up on specific surfaces.\n Facebook’s announcement includes examples of how the API could improve productivity software by allowing integration of real-life keyboards and desks, and how games could include your real-life furniture for enemies to hide behind. It’s also easy to imagine other fun experiences that mix your real environment with a virtual world — how about Portal-esque puzzles that you solve in your own house, or the ability to see your walls covered in virtual paint?\n   Facebook told  UploadVR that the API was currently only for the Quest 2 when asked about compatibility with the first-generation Quest. In the announcement post, Facebook says the image processing for the API is done on-device and that applications using it won’t be able to see or store the images from the Quest 2’s sensors.\n Facebook is adding the experimental version of the API to its upcoming developer tools, and it’ll be available first to programmers using Unity to build their software. Facebook does promise that the API will be getting support for other development platforms in the future.\n  The Quest, Quest 2, and Rift S headsets  already have a version of the Passthrough technology, which lets users get a quick look at what’s happening around them in the real world. Facebook also lets you  set Passthrough as your virtual environment, giving you a version of your real environment (albeit in black and white) that you can navigate the Oculus UI in. It even  showed off that ability in a video about  its Infinite Office feature.\n  The ability to integrate your real environment into a virtual world has long been one of the more exciting promises of headsets with integrated cameras. Microsoft even invoked the idea when it named its VR platform Windows Mixed Reality (regardless of how much that’s actually been delivered on).\n The news of Oculus’ API doesn’t mean that you’ll be able to pick up your headset and have a mixed reality experience today, however.  In its announcement, Facebook says it’s looking to let developers ship software using Passthrough to players “later this year.” Still, this API’s availability to developers is exciting, as it should allow for new types of experiences on the Oculus platform.", "posttime": "2021-07-24 07:15:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "passthrough,api", "title": "Oculus 的 Passthrough API 将实现混合 VR 和现实世界的体验", "title_en": "Oculus’ Passthrough API will enable experiences that mix VR and the real world", "transed": 1, "url": "https://www.theverge.com/2021/7/23/22590794/oculus-mixed-reality-api-quest-2-development-kit-unity", "via": "", "real_tags": ["api"]}, {"category": "", "categoryclass": "", "imagename": "af7c1d31f620a7326ae4d26fa51ad2f0.jpg", "infoid": 1069334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一段延时涂鸦总结了 Mark Weiser 于 1991 年发表在《科学美国人》上的开创性文章 The Computer for the 21st Century。", "note_en": "A time lapse doodle summarizing Mark Weiser's seminal article The Computer for the 21st Century, published in 1991 in Scientific American.", "posttime": "2021-07-24 07:15:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算机,century,文章", "title": "延时涂鸦：Mark Weiser 1991 年的“21 世纪计算机”[视频]", "title_en": "Time lapse doodle: Mark Weiser’s 1991 “Computer for the 21st Century” [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=CkHALBOqn7s", "via": "", "real_tags": ["计算机", "century", "文章"]}, {"category": "", "categoryclass": "", "imagename": "13897cb30823899267f22e061625b574.jpeg", "infoid": 1069333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿拉斯加渔民沙丘兰卡德一生都在寻找大海——为了食物、工作和目的。 “我从五岁开始钓鱼，”来自铜河三角洲的土著团体 Athabaskan Eyak 社区的成员兰卡德说。 “除了海洋，我真的没有任何技能。”兰卡德出生于 1959 年，同年阿拉斯加成为一个州，他目睹了各种自然和人为灾难——包括原住民传统捕鱼生活方式的商品化——破坏了他的工业和家园。 “作为一名土著渔民，我已经看到了这一切，”他说。 1964 年，一场 9.2 级的大地震，恰如其分地称为 1964 年阿拉斯加大地震，引发了海啸，造成 130 多人死亡并摧毁了渔业。整整 25 年后，一艘埃克森瓦尔迪兹油轮撞上了威廉王子湾的布莱礁，将 1080 万加仑原油喷入大海。泄漏影响了 1,300 英里的水域和海岸线，其中大部分仍被认为正在恢复中。现在，阿拉斯加渔民正面临另一个紧迫的问题。阿拉斯加已经感受到气候变化的影响，因为变暖的海洋对磷虾、野生海带森林、鲑鱼和鸟类的生态系统造成了严重破坏。这是 1989 年石油泄漏造成的挥之不去的损失之上的全部。在埃克森美孚漏油事件之前，Sound 的春季鲱鱼运回国内的总量超过 200,000 吨。如今，每年仅返回 4,000 吨。兰卡德最近在连续几个糟糕的季节之后卖掉了他的捕鱼许可证。为了帮助减轻变暖水域的影响，兰卡德现在正在采用一种称为再生海洋养殖的方法，该方法涉及在小型水下花园中种植海藻和贝类。兰卡德曾经是一名商业渔民，现在主要养殖海带。 “阿拉斯加一直以提取为基础。我们是一个自然资源开采州，”Lankard 说。 “再生海洋农业所做的是创造一种新的再生经济，它基于保护、恢复和缓解，而不是更多的资源开采。”再生海洋养殖的新兴概念是由加拿大商业渔民转为海洋农民的 Bren Smith 提出并命名的。他认为海洋养殖是未来的新养殖模式。\n在 1990 年代离开白令海的商业渔船前往鲑鱼养殖场工作后，史密斯很快对养殖场固有的单一养殖感到沮丧。他说，水产养殖被吹捧为解决过度捕捞的方法，但同样具有破坏性。史密斯对渔业感到失望，开始寻找一种更可持续的海洋工作方式。他前往长岛海峡，那里有一项计划向 40 岁以下的年轻商业渔民出租贝类捕捞场。他租了 20 英亩的水域，自 2005 年以来，他一直在康涅狄格州的顶针岛海洋农场养殖牡蛎、贻贝和海带. 在那里，史密斯努力磨练他的可持续海洋养殖模式——他在他的詹姆斯·比尔德获奖回忆录《像鱼一样吃》中记录了这一旅程。 “海洋作为农业空间有什么独特之处？当你停下来问这个问题时，就变得很容易了，”史密斯说。 “海洋就像你为什么不种植不会游走也不需要喂食的东西？当你这样看海洋时，我们可以种植数百种贝类和数千种植物。这开辟了整个农业的前沿。”", "note_en": "For all his life, Alaskan fisherman Dune Lankard has looked to the sea—for food, work and purpose. “I started fishing when I was five,” says Lankard, a member of the Athabaskan Eyak community, an Indigenous group from the Copper River Delta. “I really don’t have any skills beyond the ocean.”\n    Born in 1959, the same year Alaska became a state, Lankard has witnessed various natural and man-made disasters—including the commoditization of Indigenous peoples’ traditional fishing way of life—that have disrupted his industry and homeland. “As an Indigenous fisherman, I’ve seen it all,” he says.\n  In 1964, a massive magnitude 9.2 earthquake, fittingly called the Great Alaska Earthquake of 1964, triggered a swell of tsunamis that killed more than 130 people and devastated fisheries. Exactly 25 years later, an Exxon Valdez oil tanker struck Bligh Reef in the Prince William Sound, spewing 10.8 million gallons of crude oil into the sea. The spill affected 1,300 miles of water and coastline, much of which is still considered to be in recovery.\n  Now, Alaskan fishermen are facing another urgent problem. Alaska is already feeling the effects of climate change, as the warming oceans have wreaked havoc on ecosystems of krill, wild kelp forests, salmon and birds. That’s all on top of the lingering losses caused by the 1989 oil spill. Before the Exxon spill, the Sound’s spring run of herring totalled more than 200,000 tons returning home. Today, there are only 4,000 tons returning annually. Lankard recently sold his fishing permit after several consecutive bad seasons.\n    To help mitigate the effects of warming waters, Lankard is now embracing an approach known as regenerative ocean farming, which involves growing seaweed and shellfish in small underwater gardens. Once a commercial fisherman, Lankard now mostly farms kelp.\n  “Alaska has always been based on extraction. We’re a natural resource extraction state,” says Lankard. “What regenerative ocean farming does is create a new regenerative economy that’s based on conservation, restoration and mitigation, as opposed to more extraction of resources.”\n  The burgeoning concept of regenerative ocean farming was developed and named by Bren Smith, a Canadian commercial fisherman turned ocean farmer. He believes ocean farming is the new farming model of the future.\n  After leaving commercial fishing boats in the Bering Sea in the 1990’s to work on salmon farms, Smith quickly grew disheartened by the farms’ inherent monoculture. Aquaculture was touted as a solution to overfishing, he says, yet was just as destructive.\n  Disillusioned by the fishing industry, Smith set out to find a more sustainable way to work with the seas. He made his way to Long Island Sound, where there was a program to lease shellfishing grounds to young commercial fishermen under 40. He leased 20 acres of water, where he’s been raising oysters, mussels and kelp on   Thimble Island Ocean Farm in Connecticut since 2005. There, Smith worked to hone his sustainable ocean farming model—a journey he chronicled in his James Beard Award-winning memoir,    Eat Like a Fish.\n  “What’s unique about the ocean as an agricultural space? When you stop and ask that question it becomes so easy,” says Smith. “The ocean’s like why don’t you grow things that don’t swim away and don’t have to feed? When you look at the ocean that way, there are hundreds of kinds of shellfish, and thousands of plants we can grow. That opens up a whole frontier of agriculture.”", "posttime": "2021-07-24 07:15:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变暖,warming,海洋", "title": "面对变暖的水域，渔民开始从事海洋养殖", "title_en": "Facing Warming Waters, Fishermen Are Taking Up Ocean Farming", "transed": 1, "url": "https://www.smithsonianmag.com/innovation/facing-warming-waters-fishermen-are-taking-up-ocean-farming-180978091/", "via": "", "real_tags": ["变暖", "warming", "海洋"]}]