[{"category": "", "categoryclass": "", "imagename": "22cbbd96c7345d6823da7f5f6810b0e6.jpg", "infoid": 1007729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已经在美国的签证持有者和那些已经获得签证的申请者可以免于禁令。这些限制措施打算持续到今年年底，这将扰乱政府在10月份国家财政日历开始时发放新签证的典型程序。\n特朗普政府的官员告诉华尔街日报，此举旨在保护美国的就业，但科技行业的高管长期以来一直警告说，签证限制将损害美国在作为经济增长引擎的具有战略和财务意义的行业中的竞争能力。\n科技官员甚至提到，移民限制是一个因素，可能会迫使公司将更多业务迁往海外，以努力招聘和留住顶尖技术人才。\n科技行业游说团体TechNet的总裁兼首席执行官琳达·摩尔(Linda Moore)在一份声明中说，“科技行业正在加班加点地工作，通过提供送餐服务、远程医疗、协作商业解决方案，以及让家人和朋友保持联系的方式，在全球大流行期间保持美国人的联系。”他说：“展望未来，科技将继续对我们的经济重建起关键作用。今天的行政命令只会阻碍企业就如何最好地部署现有劳动力和招聘新员工做出决定的能力。这将减缓创新，并破坏科技行业为帮助我们国家从史无前例的事件中复苏所做的工作。“。\n据新闻报道，官员们预计这些新的限制措施将持续到今年年底，并扩大总统在4月份实施的移民禁令，这些禁令阻止美国公民的家人移民，并大幅削减了寻求移民到美国的高技能移民工人可以获得的签证数量。\n提供给华尔街日报的估计显示，由于扩大的旅行限制，大约52.5万人将无法进入美国，其中包括自4月份以来被禁止进入美国的17万绿卡持有者。华尔街日报援引特朗普政府官员的话说，这项倡议是“美国优先的复苏”，可能会为失业的美国人创造50万个就业机会。\n科技高管已经表达了他们对报道中的禁令的不满。“禁止所有H1B签证意味着像我这样的首席执行官必须在加拿大等允许移民的国家开设办事处并雇佣更多人。这项签证禁令在道德上是错误的，在经济上也是愚蠢的，“科技初创公司SkyFlow的首席执行官安舒·夏尔马(Anshu Sharma)写道。\n禁止所有H1B签证意味着像我这样的首席执行官必须在加拿大等允许移民的国家开设办事处并雇佣更多人。\n这项签证禁令在道德上是错误的，在经济上也是愚蠢的。你不是说“合法移民”吗？https://t.co/R9O9Q1Ts0j。\n投资者也对这一决定对美国竞争能力的影响感到不安。\n“不管他的政府是否意识到这一点，他们都给美国的创新造成了很大的障碍。技术投资基金Urban.us的联合创始人Stonly Baptiste写道：“我们最具创新性和影响力的投资组合公司和他们的许多员工都是从持有H-1b签证开始的。“如果没有H-1B，我们实际上不可能在一个环境中建立我们的投资组合。我们甚至不是一个专注于移民的基金。“。\n同样被砍掉的还有H-2B签证，这种签证用于让从事园林绿化和非农工作的短期季节性工人进入美国，为营地顾问和互助生等短期工人提供J-1工作，以及为公司调任提供L-1签证。\n专注于医疗保健的初创公司Elektra Labs的首席执行官安迪·科拉沃斯(Andy Coravos)在一条直接信息中写道：“通过限制美国公司的人才库，美国政府正在阻碍我们建立强大、有防御能力的组织的能力。”“特朗普政府暂停外国工作签证的行政命令不仅基于恐惧，还会让我们社区的恐惧永久化，不符合我们社会的最佳利益。”\n医护人员、冠状病毒研究人员、食品包装中的食品供应人员都不受签证暂停的影响。\n科技高管并不是唯一站出来反对更严格的移民规定的人。5月27日，包括南卡罗来纳州有权势的资深参议员林赛·格雷厄姆(Lindsey Graham)和德克萨斯州参议员约翰·科宁(John Cornyn)在内的9名共和党参议员发表了一封联名信，恳求总统重新考虑传言中的移民限制。\n他们写道：“需要客工来促进美国的商业发展，而不是抢走美国人的工作。”", "note_en": "Visa-holders already in the U.S. and those applicants who have already received a visa are exempt from the ban. The restrictions are intended to last until the end of the year, which would disrupt the government’s typical process of awarding new visas at the beginning of the national fiscal calendar in October.\n Officials from the Trump administration  told the Wall Street Journal that the move is intended to protect American jobs, but executives in the technology industry have long warned that visa restrictions would hurt the nation’s ability to compete in industries that have both strategic and financial significance as engines of economic growth.\n  Tech officials have even cited immigration curbs as a factor that would force companies to relocate more of their operations overseas in an effort to hire and retain top technology talent.\n “The technology industry is working overtime to keep Americans connected during a global pandemic by providing food delivery services, telehealth care, collaborative business solutions, and ways for families and friends to stay connected,” said Linda Moore, the president and chief executive of the tech industry’s lobbying group, TechNet, in a statement. “Looking forward, technology will continue to be crucial to the rebuilding of our economy. Today’s executive order only hinders the ability of businesses to make decisions on how best to deploy their existing workforce and hire new employees. This will slow innovation and undermine the work the technology industry is doing to help our country recover from unprecedented events.”\n According to news reports, officials expect these new restrictions to last until the end of the year, and expand the immigration bans that the President put in place in April that blocked family members of U.S. citizens from immigrating and slashed the number of visas available to high-skilled  workers looking to immigrate to the US.\n Estimates provided to the Wall Street Journal indicate that roughly 525,000 people will be unable to enter the country as a result of the expanded travel restrictions including 170,000 green card holders barred from entering the U.S. since April. The Trump administration official quoted by the Journal called the initiative an “America-first recovery” that would potentially open up 500,000 jobs for out-of-work Americans.\n Technology executives are already voicing their displeasure with the reported ban. “Banning all H1B [sic] visas means CEOs like me have to open offices and hire more people in countries like  Canada   that allow immigration. This visa ban is morally wrong and economically stupid,” wrote  Anshu Sharma,   the chief executive officer of the technology startup  Skyflow.\n Banning all H1B visas means CEOs like me have to open offices and hire more people in countries like Canada that allow immigration.\n This visa ban is morally wrong, and economically stupid. What happened to being “for legal immigration”?  https://t.co/R9O9Q1Ts0j\n Investors are also up-in-arms about the decision’s impact on America’s ability to compete.\n “Whether his administration realizes it or not, they creating a significant handicap for US innovation. Our most innovative and impactful portfolio companies and many of their employees started as H-1b holders,” wrote Stonly Baptiste, the co-founder of technology investment fund, Urban.us. “ We literally couldn’t have built our portfolio in an environment without H-1B. And we’re not even an immigrant focused fund.”\n Also on the chopping block are H-2B visas, which are used to let short-term seasonal workers in landscaping and non-farm jobs into the country, J-1 jobs for short-term workers like camp counselors and au pairs and L-1 visas for corporate company transfers.\n “By limiting the talent pool for American companies, the US government is hindering our ability to build strong, defensible organizations,” wrote Andy Coravos, the chief executive officer of the healthcare-focused startup  Elektra Labs, in a direct message. “The Trump Administration’s Executive Order to suspend foreign work visas is not only based in fear, but also perpetuates fear within our community, and is not in our society’s best interest.”\n Healthcare workers, coronavirus researchers, food supply workers in food packaging are all exempt from the visa suspensions.\n Technology executives aren’t the only ones coming out against the tighter immigration rules. A group of nine Republican senators including South Carolina’s powerful senior senator, Lindsey Graham, and Texas Senator John Cornyn, issued a joint letter on May 27, which pleaded with the President to reconsider the rumored immigration restrictions.\n “Guest workers are needed to boost American business, not take American jobs,” they wrote.", "posttime": "2020-06-23 06:53:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "签署,sign,美国", "title": "特朗普将签署行政命令暂停H-1B工作签证", "title_en": "Trump will sign executive order temporarily suspending work visas for H-1B", "transed": 1, "url": "https://techcrunch.com/2020/06/22/president-trump-reportedly-will-sign-executive-order-temporarily-suspending-work-visas-for-h-1b-holders/", "via": "", "real_tags": ["签署", "sign", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007728, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果找不到执行所需功能的模拟IC，该怎么办？\n每隔几年，我收到的反馈就会让我确信，现在是我提醒模拟工程师的时候了，他们必须像工程师和设计电路一样行事，而不是简单地用现成的模块组装系统。\n那么，你应该怎么做呢？打造您自己的专用集成电路(ASIC)！我们都倾向于认为集成电路(ASIC的IC位)是单片硅片，但这个想法比单片IC早了几十年。运算放大器应用手册展示了一种早期集成电路：Philrick的K2-W运算放大器，这是一个包含两个真空管的插入式模块，于1952年进入商业市场。随着晶体管的发明，模块化电路功能变得相当普遍-它们通常不被称为“集成电路”，但它们正是如此。这样的“集成电路”不一定是现成的模块购买的；相反，它们可能是众所周知的电路功能-通常以其发明者的名字命名-被合并到设计中。一些例子包括科尔皮茨振荡器、埃克尔斯-乔丹触发器和多尔蒂放大器。\n所以，当我说“建立你自己的ASIC”时，我并不是建议你开始设计你自己的单片芯片。如果您需要大量组件，这可能是值得的，但是需要少于10,000个组件的系统很少从这种方法中受益。现场可编程模拟阵列(FPAA)有时对于使用大量运算放大器的子系统很有用，但对于包含其他功能的小型系统来说很少具有成本效益。\n我也不建议您将子系统作为一个整洁的模块，尽管如果您愿意的话，您可以这样做。我最近买了一台3D打印机，我发现现在我制作的许多小玩意儿比以前不得不用马口铁、PCB材料、木头或塑料薄片手工制作盒子时要整齐得多。\n然而，我的建议是，如果您需要一个定义良好的子系统，但找不到现成的ASIC，您既不应该绝望，也不应该尝试将其设计为整个系统的一个组成部分。相反，您应该考虑将其设计为单独定义的子系统。这可能简化了设计；它当然简化了测试和评估，并且是制造商哲学、制造商的权利法案和工匠宣言的一种有价值的表达。\n现代模拟IC比以往任何时候都更易于使用，使运算放大器、基准电压源、乘法器、转换器和模拟开关等构建模块能够执行复杂的功能。我最近设计了一个单边带(SSB)无线电接收机。接收机的自动增益控制(AGC)系统应跟踪高达20dB/秒的变化信号。在讲话暂停期间没有信号，因此AGC在这些时间不应该改变。然而，在暂停一秒钟之后，系统应该很快恢复到完全增益。这个AGC系统在1967到1993年间以单片ASIC的形式出现，但是自从我的替代品使用了均方根到直流转换器和几个运算放大器之后，它就再也没有制造出来了。\n我邀请您在EngineerZone上的模拟对话社区中评论DIY ASIC。", "note_en": "What should I do if I can’t find an analog IC that performs the required function?\n      Every couple of years the feedback I receive convinces me that it&#39;s time for me to remind analog engineers that they must behave like engineers and design circuits, rather than simply assembling systems from ready-made blocks.\n So, what should you do? Build your own  application specific integrated circuit (ASIC)! We all tend to think of integrated circuits (the IC bit of ASIC) as single silicon chips, but the idea predates monolithic ICs by decades. The  Op Amp Applications Handbook shows an early integrated circuit: Philbrick’s  K2-W op amp, a plug-in module containing two vacuum tubes, which entered the commercial market in 1952. With the invention of the transistor, modular circuit functions became quite common—they were not usually called “integrated circuits,” but that&#39;s exactly what they were. Such “integrated circuits” were not necessarily bought as ready-made modules; instead they might be well-known circuit functions—often named for their originators—which were incorporated into a design. Some examples include the  Colpitts oscillator, the  Eccles-Jordan flip-flop, and the  Doherty amplifier.\n So, when I say “build your own ASIC,” I’m not suggesting that you start designing your own monolithic chip. If you need a lot of them this may be worthwhile, but systems that require less than 10,000 pieces rarely benefit from such an approach. Field programmable analog arrays (FPAA) are sometimes useful for subsystems that use large numbers of op amps, but are rarely cost-effective for small systems incorporating other functions.\n I&#39;m also not suggesting that you make a subsystem as a neat module, although you can if you like. I recently acquired a 3D printer, and find a lot of the gadgets that I make are now much more neatly boxed than when I had to make the boxes by hand from tinplate, PCB stock, wood, or sheet plastic.\n What I am suggesting, however, is that if you need a well-defined subsystem and cannot find a ready-made ASIC, you should neither despair, nor try to design it as an integral part of your total system. Instead you should consider designing it as a separately defined subsystem. This probably simplifies the design; it certainly simplifies testing and evaluation, and is a worthy expression of the  Maker Philosophy, the Maker&#39;s Bill of Rights, and the Crafter&#39;s Manifesto.\n Modern analog ICs are easier to use than ever before, allowing an assembly of building blocks such as op amps, voltage references, multipliers, converters, and analog switches to perform complex functions. I recently designed a single-sideband (SSB) radio receiver. The automatic gain control (AGC) system of the receiver should track signals that change at up to 20-dB/sec. There is no signal during speech pauses, so the AGC should not change at these times. After a pause of a second, however, the system should revert quickly to full gain. This AGC system was available as a monolithic ASIC between 1967 and 1993, but it has not been made since—my substitute used an rms-to-dc converter and a few op amps.\n I invite you to comment on DIY ASICs in the  Analog Dialogue Community on  EngineerZone.", "posttime": "2020-06-23 06:36:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "diy,asics,模拟", "title": "DIY-DIY ASIC(2013)", "title_en": "Do-it-Yourself ASICs (2013)", "transed": 1, "url": "https://www.analog.com/en/analog-dialogue/raqs/raq-issue-95.html#", "via": "", "real_tags": ["diy", "asics", "模拟"]}, {"category": "", "categoryclass": "", "imagename": "bdd40e0ec577dd335b7e70467c060aaf.jpg", "infoid": 1007727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019年小说冠状病毒(新冠肺炎)明显扰乱了美国人的生计。*自2020年3月以来，美国企业及其工人在采取某些必要的公共卫生措施的同时，面临着广泛的干扰，以平坦新冠肺炎的曲线，减少导致新冠肺炎的SARS-CoV-2病毒的传播。*2020年2月至5月，美国整体失业率几乎翻了两番-产生了美国劳工统计局(Bureau Of Labor Statistics)有史以来最极端的一些失业情况。虽然5月份13.3%的失业率比4月份明显下降，但数百万美国人仍然失业。", "note_en": "The 2019 Novel Coronavirus (COVID-19) has significantly disrupted Americans’ livelihoods.  Since March 2020, United States businesses and their workers have faced extensive disruptions while undertaking certain public health measures necessary to flatten the curve of COVID-19 and reduce the spread of SARS-CoV-2, the virus that causes COVID-19.  The overall unemployment rate in the United States nearly quadrupled between February and May of 2020 — producing some of the most extreme unemployment ever recorded by the Bureau of Labor Statistics.  While the May rate of 13.3 percent reflects a marked decline from April, millions of Americans remain out of work.", "posttime": "2020-06-23 06:35:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,入境,entry", "title": "E/O：暂停外国人入境给美国劳动力市场带来风险", "title_en": "E/O: Suspending Entry of Aliens Presenting a Risk to the U.S. Labor Market", "transed": 1, "url": "https://www.whitehouse.gov/presidential-actions/proclamation-suspending-entry-aliens-present-risk-u-s-labor-market-following-coronavirus-outbreak/", "via": "", "real_tags": ["美国", "入境", "entry"]}, {"category": "", "categoryclass": "", "imagename": "8ef9f1304fbc12757fe7532652d7adf9.jpg", "infoid": 1007726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "未来从2021年开始。根据艾萨克·阿西莫夫的获奖小说，基金会记录了一群流亡者拯救胡马的不朽旅程。", "note_en": "The future begins in 2021. Based on the award-winning novels by Isaac Asimov, Foundation chronicles a band of exiles on their monumental journey to save huma...", "posttime": "2020-06-23 06:35:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基金会,foundation,拯救", "title": "基金会(阿西莫夫)", "title_en": "Foundation (Asimov)", "transed": 1, "url": "https://youtube.com/watch?v=xgbPSA94Rqg", "via": "", "real_tags": ["基金会", "拯救"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们花了大量的试验、错误和检查整个代码和Z80指令集，才找到在GW-BASIC源代码的反向翻译中可以改进的模式和东西。这件事最终有点复杂，但足够复杂，足以匹配和转换我可以找到的所有模式，这些模式一次需要转换多条指令。随着我对Z80功能有了更多的了解，比如条件调用或RET指令，一些模式开始出现，这一步得到了一些非常需要的改进。最后一步是生成Z80代码。我必须做的第一件事是找出8086和Z80的寄存器映射。这并不难，因为GW-BASIC中的许多较旧的代码仍然有引用Intel8080寄存器的注释，这些寄存器在Z80中的名称是相同的。一些较新的代码无法映射到Intel8080，但幸运的是，由于索引寄存器IX和IY的存在，它们可以在Z80中映射。右边的表格根据阅读源代码注释和Z80指令的可用性总结了我的转换器正在使用的寄存器映射。在编写转换步骤之前，我不知道如何使用AH寄存器。整个代码库都有一些用途，而Z80中没有对应的用途：16位寄存器AF、F的低位部分用于标志；它不是真正的通用寄存器。幸运的是，由于8086GW-BASIC代码的性质，AH寄存器的使用遵循一种模式(由专有的Microsoft ISA转换器发出)，我能够找出并发出指令，例如ex AF，AF&#39；(将AF与其影子寄存器AF进行交换，AF&#39；)，或者根据情况推送AF和POP AF。最后一步要么在尝试使用错误数量的参数生成指令时断言失败，要么在其他不变量都不成立的情况下引发异常。例如，生成8086 ROR(向右旋转)指令的Z80等价物的代码如下：def_gen_direction_ror(self，Token)：assert len(TOKEN[&#39；Operators&#39；])==2 op1，op2=Token[&#39；Operators&#39；]if op2==1：if op1=&#39；AL&#39；：如果不是self，则返回&#39；rra&39；_is_16bit_reg(Op1)和自身中的op1。regmap：返回&#39；rr%s&#39；%self。regmap[OP]if op1==&#39；[bx]&#39；：return&#39；rr(HL)&#39；raise SyntaxError(&#34；Don&#39；t知道如何使用op%s，%s&34；%(op1，op2)生成ROR)。\n它将只识别对GW-Basic源代码有意义的RoR指令的使用。这个主题一遍又一遍地重复。MAP、Z80 Heaven等站点以及详细说明每个条件跳转指令如何使用每组标志的这个表都非常有帮助。其他一些网站，如CPC技术页面或WikiTI，有一些很棒的提示，帮助我将8086指令映射到Z80，并给了我一些关于如何实现IMUL或IDIV等指令的想法。我家里碰巧也有一些死树的书，包括最初的英特尔8086手册和一本针对MSX的Z80编程的书(虽然它实际上没有提到非文档说明，其中一些在编写这个转换器时很有用)，但帮助不大。缺少Ctrl+F对这类文档没有帮助。最后，但同样重要的是，我想不分先后地感谢里卡多·比腾古尔、丹尼尔·卡埃塔诺、乔瓦尼·努内斯和皮特·朋克等人在我发推特谈论这件事时给予的帮助。这个转换工具已经可以做很多工作了，但是它还不完整。我确实因为个人原因暂停了一段时间的工作，但正如我之前提到的，它正在被重构，以便在Transformer和Writer步骤之间有一个中间步骤，这应该会在解决由于生成无效Z80指令而导致的错误时减少一些干扰。在GW-Basic源代码的其他分支中也进行了一些工作，人们试图使用较旧版本的Microsoft汇编器和Linker，或者使用更现代的工具(如JWAsm和JWLink)来构建GW-Basic源代码。一些使解释器工作的代码丢失了，但它主要是特定于平台的粘合代码，这些代码要么从头开始重新实现，要么从之前在MIT许可下发布的(仅限二进制的)BASICA.COM代码进行反向工程。一些丢失的符号的名称对我来说是可疑的，事实上，它们中的许多实际上是MSX中的BIOS函数的名称。考虑到微软在这些电脑中设计了BIOS，这并不令人惊讶。(这也很好，因为如果我能让它在MSX上运行，我就不需要重新实现那些东西了。)。最终，我的想法是以此为基础", "note_en": "It took a lot of trial, error, and looking through the whole code and the Z80 instruction set, to find patterns and things that could be improved in the &#34;backwards translation&#34; of the GW-BASIC source code. This thing ended up being slightly complex, but complex enough to match and transform all patterns that I could find that required transformation of more than a single instruction at a time. As I learned more about the Z80 capabilities, such as conditional  CALL or  RET instructions, some patterns began to emerge and this step got some much needed refinement.   The last step is generating the Z80 code. The first thing that I had to do was figure out the register mapping of 8086 and Z80. This wasn&#39;t that difficult, because a lot of the older code in GW-BASIC still had comments referencing the Intel 8080 registers, which are named the same in the Z80. Some newer code couldn&#39;t be mapped to the Intel 8080, but luckily, they could in the Z80 due to the existence of the indexing registers  IX and  IY. The table on the right summarizes the register mapping that my converter is using, based on reading the source comments and the availability of Z80 instructions. Before writing the Transformation step, I had no clue what I would have to do with the usage of the  AH register. There were some uses throughout the code base, and there&#39;s no equivalent in the Z80: the low part of the 16-bit register  AF,  F, is used for flags; it&#39;s not really a general-purpose register. Luckily, due to the nature of the 8086 GW-BASIC code, uses of the  AH register followed a pattern (emitted by the proprietary Microsoft ISA converter) that I was able to figure out and emit instructions such as  EX AF, AF&#39; (exchange  AF with its shadow register,  AF&#39;), or  PUSH AF and  POP AF depending on the case. This last step will either fail assertions when trying to generate an instruction with the wrong number of arguments, or raise an exception if none of the other invariants hold. For instance, the code to generate the Z80 equivalent of the 8086  ROR (rotate right) instruction is the following: def  _gen_instruction_ror ( self ,  token ):  assert  len ( token [ &#39;operands&#39; ])  ==  2  op1 ,  op2  =  token [ &#39;operands&#39; ]  if  op2  ==  1 :  if  op1  ==  &#39;AL&#39; :  return  &#39;RRA&#39;  if  not  self . _is_16bit_reg ( op1 )  and  op1  in  self . regmap :  return  &#39;RR  %s &#39;  %  self . regmap [ op ]  if  op1  ==  &#39;[BX]&#39; :  return  &#39;RR (HL)&#39;  raise  SyntaxError ( &#34;Don&#39;t know how to generate ROR with op  %s ,  %s &#34;  %  ( op1 ,  op2 ))\n It&#39;ll only recognize uses of the  ROR instruction that makes sense for the GW-BASIC source code. This theme repeats over and over again.  Sites such as  MAP,  Z80 Heaven, and  this table detailing how each set of flags are used by each conditional jump instruction, were immensely helpful. A few other sites, such as the  CPC Tech page, or  WikiTI had some wonderful tips that helped me map the 8086 instructions to Z80, and gave me a few ideas on how to implement instructions such as  IMUL or  IDIV. I also happen to have some deadtree books at home, including the original Intel manual for the 8086 and a book for Z80 programming targeting the MSX (although it doesn&#39;t really mention the non-documented instructions, of which some were useful in writing this converter), which were less helpful. Lack of  Ctrl+F isn&#39;t helpful for this kind of documentation. Last, but certainly not least, I&#39;d like to thank in no particular order, people like Ricardo Bittencourt, Daniel Caetano, Giovanni Nunes, and Piter Punk for the help when I was tweeting about this.  The converter tool can do a lot of work already, but it&#39;s not complete. I did pause the work on it for a while due to personal reasons, but as I mentioned before, it&#39;s being refactored to have an intermediate step between the Transformer and Writer steps, which should reduce some of the churn when addressing bugs due to invalid Z80 instructions being generated. Some work has been also being made in other forks of the GW-BASIC source code, where  people are trying to build it using either older versions of the Microsoft Assembler and Linker, or using more modern tooling such as JWAsm and JWLink. Some of the code to make the interpreter work is missing, but it&#39;s mostly platform-specific glue code, which is being either reimplemented from the scratch, or reverse-engineered from the (binary-only)  BASICA.COM code that was released previously under the MIT license. Some of the missing symbols had names that were suspicious to me, and, indeed, many of them were actually names of BIOS functions from the MSX. Considering that Microsoft designed the BIOS in those computers, it&#39;s not really surprising. (It&#39;s good, too, because I wouldn&#39;t need to reimplement those things if I ever get this to work on the MSX.) My idea, eventually, is to use this as a base for a BASIC interpreter in the  C-BIOS project, which is an open source BIOS for the MSX computers. It currently lacks the BASIC component, and using one that&#39;s essentially the same that shipped with the MSX would be a good starting step. Of course, a lot of the hardware-specific things, such as the  PLAY command (which has 3 channels in the MSX, and is extensible to use FM synthethizers and whatnot), general extensibility via hooks in ROMs attached to the computer, and many other MSX-specific routines will need to be implemented. I&#39;m not really worried about all this, however, as I&#39;ll be really happy if I could fill the screen with the quintessential BASIC Hello, World:", "posttime": "2020-06-23 06:17:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "移植,gw,z80", "title": "为Z80移植GW-Basic", "title_en": "Porting GW-Basic for the Z80", "transed": 1, "url": "https://tia.mat.br/posts/2020/06/21/converting-gwbasic-to-z80.html", "via": "", "real_tags": ["移植", "gw", "z80"]}, {"category": "", "categoryclass": "", "imagename": "f125c092400a40855c283915d2980e45.jpg", "infoid": 1007723, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首先，您可以编译您的应用程序以在基于英特尔的Mac和基于ARM的Mac上运行。你可以使用一种名为Universal 2的新格式将这些应用程序与两个可执行文件一起发布。如果你已经使用了一段时间的Mac，你就会知道苹果在从PowerPC CPU切换到英特尔CPU时使用了相同的流程--一个应用程序，两个可执行文件。\n至于未经优化的软件，你仍然可以运行这些应用程序。但它的性能不会像本地ARM就绪应用程序那样好。苹果公司将推出Rosetta2，这是一个模拟层，可以让你在新的Mac电脑上运行旧的应用程序。\n当你安装一个旧的应用程序时，你的Mac会检查该应用程序，并试图针对你的ARM处理器对其进行优化。这样，即使在你打开应用程序之前，也会有一定程度的优化。\n但是，如果它是网络浏览器或带有即时代码的复杂应用程序呢？当你运行应用程序时，Rosetta2还可以将指令从x86即时翻译成ARM。\n如果您是开发将要在服务器上运行的代码的开发人员，那么Apple也在开发一套虚拟化工具。您将能够在ARM Mac上运行Linux和Docker。\n作为额外的好处，用户还可以访问更大的应用程序库。“Mac用户首次可以在Mac上运行iOS和iPadOS应用程序，”苹果首席执行官蒂姆·库克说。\n虽然该公司没有透露太多细节，但苹果并没有谈论Catalyst，这是苹果自己的框架，可以更容易地将iOS应用移植到MacOS上。即使开发人员从未针对MacOS优化过这些应用程序，您也应该能够下载和运行这些应用程序。\n过渡将需要一段时间-大约两年。第一款基于ARM的Mac将于今年年底发货。对于有兴趣将应用程序移植到基于ARM的Mac上的开发人员，将有一个快速入门计划。除了文档和私人论坛外，苹果还将向你发送一台搭载A12Z系统的定制Mac Mini。这样，您就可以在装有ARM芯片的实际Mac上测试您的应用程序。", "note_en": "First, you’ll be able to compile your app to run both on Intel-based Macs and ARM-based Macs. You can ship those apps with both executables using a new format called Universal 2. If you’ve been using a Mac for a while, you know that Apple used the same process when it switched from PowerPC CPUs to Intel CPUs — one app, two executables.\n As for unoptimized software, you’ll still be able to run those apps. But its performances won’t be as good as what you’d get from a native ARM-ready app. Apple is going to ship Rosetta 2, an emulation layer that lets you run old apps on new Macs.\n  When you install an old app, your Mac will examine the app and try to optimize it for your ARM processor. This way, there will be some level of optimization even before you open the app.\n But what if it’s a web browser or a complicated app with just-in-time code? Rosetta 2 can also translate instructions from x86 to ARM on the fly, while you’re running the app.\n And if you’re a developer working on code that is going to run on servers, Apple is also working on a set of virtualization tools. You’ll be able to run Linux and Docker on an ARM Mac.\n  As a bonus, users will also be able to access a much larger library of apps. “Mac users can for the first time run iOS and iPadOS apps on the Mac,” Apple CEO Tim Cook said.\n While the company didn’t share a lot of details, Apple isn’t talking about Catalyst, its own framework that makes it easier to port iOS apps to macOS. You should be able to download and run apps even if the developer never optimized those apps for macOS.\n The transition is going to take a while — around two years. The first ARM-based Mac will ship by the end of the year. There will be a quick start program for developers interested in porting apps to ARM-based Macs. In addition to documentation and a private forum, Apple will send you a custom-made Mac Mini with an A12Z system on a chip. This way, you can test your apps on an actual Mac with an ARM chip.", "posttime": "2020-06-23 06:00:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,ios,apple,apps,应用程序", "title": "苹果将让你模仿旧应用，在ARM Mac上运行iOS应用", "title_en": "Apple Will Let You Emulate Old Apps, Run iOS Apps on ARM Macs", "transed": 1, "url": "https://techcrunch.com/2020/06/22/apple-will-let-you-emulate-old-apps-and-run-ios-apps-on-arm-macs/", "via": "", "real_tags": ["苹果", "ios", "apple", "apps", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "b0fbf83e8b3ed9465a3b4c14d294a2c6.jpg", "infoid": 1007721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对许多人来说，人类的巨大飞跃等同于尼尔·阿姆斯特朗登上月球表面的一小步。\n美国宇航局宇航员、化学工程师和文艺复兴人唐纳德·佩蒂特不同意这种说法。他说，这一飞跃实际上发生在离家很近的地方。\n他在2012年写道，人类的巨大飞跃不是登上月球的第一步，而是到达地球轨道的第一步。\n这第一步距离地球约400公里，需要进入火星表面所需总能量的一半。地球和月球之间的目的地只是简单进入地球轨道所需的一小部分。这第一步的成本取决于地球引力的大小。物理学规定，支付比全额成本少一分钱的费用将导致地球以一种不那么温和的方式收回你的航天器。\n重力对地球居民令人窒息的控制意味着，当前火箭质量的80%到90%必须被实际燃烧的推进剂吸收，才能将火箭送入太空！根据佩蒂特的说法，这意味着坐在火箭上比坐在汽油瓶上更不稳定。这也意味着没有太多的空间来放食物、电脑、科学实验和宇航员等东西。\n佩蒂特说，如果我们星球的半径更大，可能会有一个无法建造地球逃逸火箭的点。\n让我们假设用96%的推进剂(4%的火箭)建造一枚火箭.。是运载火箭工程的实际极限。让我们也选择氢氧，这是已知的、目前能够用于人类额定火箭发动机的最高能量的化学推进剂。通过将这些数字插入火箭方程，我们可以将计算的逃逸速度转换为其等效的行星半径。这个半径大约是9680公里(地球是6670公里)。如果我们的星球直径大50%[同时保持相同的密度]，我们将无法进入太空，至少不能使用火箭进行运输。\n佩蒂特的思维实验强调了几点。首先，尽管火箭作为人类的星际运输工具取得了成功，但它们的效率却低得令人悲哀。如果可能，我们必须找到新技术来打破地心引力的束缚。已经提出了许多方法，其中一些直接来自科幻小说。很少有人接受过测试，甚至没有得到充实。其次，在月球上建立发射基地很有直观性。月球的逃逸速度仅为地球的21.3%。在地球上发射太空需要轰鸣，而在月球上发射太空需要相对呜咽。月球上的卡纳维拉尔角还很遥远，但随着3D打印和材料加工的进步，它可能会得到更清晰的关注。毕竟，为了让它工作，我们需要从月球本身或附近的空间物体(如彗星或小行星)中提取大部分宇宙飞船材料。或者，我们可以简单地将月球作为加油站，将其储存的水冰加工成氢氧推进剂。\n用佩蒂特的话说，地球目前对人类有着残暴的控制。到目前为止，我们超越其引力控制的尝试只是昙花一现，但最终还是有可能挣脱的。", "note_en": "To many people, mankind&#39;s &#34;giant leap&#34; is synonymous with Neil Armstrong&#39;s &#34;small step&#34; onto the surface of the Moon.\n NASA astronaut, chemical engineer, and renaissance man  Donald Pettit disagrees. The leap, he says, actually occurred far closer to home.\n &#34;The giant leap for mankind is not the first step on the Moon, but in attaining Earth orbit,&#34; he  wrote in 2012.\n This first step, about 400 kilometers away from Earth, requires half of the total energy needed to go to the surface of Mars. Destinations between the Earth and the Moon are only a fraction of that required to simply get into Earth orbit. The cost of this first step is due to the magnitude of Earth’s gravity. And physics dictates that paying a penny less than the full cost will result in Earth repossessing your spacecraft in a not so gentle way.\n Gravity&#39;s smothering hold on Earth&#39;s inhabitants means that eighty to ninety percent of the mass of current rockets must be taken up by the actual propellant burned to lift the rocket into space! According to Pettit, this means that sitting atop a rocket is more precarious than perching oneself atop a bottle of gasoline. It also means that there isn&#39;t much room for stuff like food, computers, scientific experiments, and astronauts.\n  &#34;If the radius of our planet were larger, there could be a point at which an Earth escaping rocket could not be built,&#34; Pettit says.\n  Let us assume that building a rocket at 96% propellant (4% rocket)... is the practical limit for launch vehicle engineering. Let us also choose hydrogen-oxygen, the most energetic chemical propellant known and currently capable of use in a human rated rocket engine. By plugging these numbers into the rocket equation, we can transform the calculated escape velocity into its equivalent planetary radius. That radius would be about 9680 kilometers (Earth is 6670 km). If our planet was 50% larger in diameter [while maintaining the same density], we would not be able to venture into space, at least using rockets for transport.\n Pettit&#39;s thought experiment underscores a couple points. First, as successful as rockets have been, serving as humanity&#39;s transports to the stars, they are woefully inefficient. If possible, we must find  new technologies to break gravity&#39;s bonds.  Many methods, some straight out of science fiction, have been proposed. Few have been tested or even fleshed out. Second, establishing a launch base on the Moon makes a lot of intuitive sense. The Moon&#39;s escape velocity is a mere 21.3% of Earth&#39;s. While a space launch on Earth requires a roar, a space launch on the Moon could be accomplished with a relative whimper. A &#34;Cape Canaveral&#34; on the Moon is far off, but could come into clearer focus with advancements in 3D printing and materials processing. After all, to make it work, we&#39;d need to extract most of the materials for spaceships from the Moon itself or nearby space objects like comets or asteroids. Alternatively, we could simply use the Moon as a &#34; gas station,&#34; processing its stores of water ice into hydrogen-oxygen propellant.\n In Pettit&#39;s words the Earth currently holds a tyrannical grip on humanity. Our forays beyond its gravitational grasp have thus far been fleeting, but the possibility exists to break free at last.", "posttime": "2020-06-23 05:41:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,larger,火箭", "title": "如果地球大50%，我们可能会被困在这里", "title_en": "If Earth Was 50% Larger, We Might Be Stuck Here", "transed": 1, "url": "https://www.realclearscience.com/blog/2017/07/06/if_earth_was_50_larger_we_might_be_stuck_here.html", "via": "", "real_tags": ["可能", "larger", "火箭"]}, {"category": "", "categoryclass": "", "imagename": "ba3f0b7e8c758c0bc0960c2e3eb276b5.jpg", "infoid": 1007719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一下午，高级政府官员告诉记者，特朗普政府将在今年年底前禁止持某些临时工作签证-包括高技能H-1B签证-的外国人进入美国。\n重要原因：备受期待的移民限制扩大了特朗普总统早些时候在4月下旬推出的与冠状病毒相关的移民禁令-该禁令也延长到了今年年底。\n特朗普利用冠状病毒的紧急权力和经济担忧，慢慢关闭了移民系统的大部分-尽管他敦促各州重新开放。\n美国政府周一还宣布，正在努力进行永久性的监管改革，打击寻求庇护者的H-1B签证和工作许可。\n细节：除了美国大型科技公司经常依赖的H-1B签证外，入境限制还将影响H-1B配偶的签证、非农业工人的H-2B签证、持J-1交换签证的短期工人以及允许公司将海外工作人员转移到美国办事处的L签证。\n这项禁令将持续到今年年底，这可能会阻止许多新的H-1B签证工作人员进入美国。\n参与食品供应链的某些外国工人以及学院和大学教授将免于禁令。这位官员说，4月份限制措施中的医务人员豁免范围被缩小，只豁免那些来新冠肺炎护理或研究工作的人。\n大局：特朗普的首个与COVID相关的移民禁令阻止外国人获得永久移民绿卡，如果他们在美国以外，并且没有有效的签证或其他旅行证件-除了一些例外。\n国务院的每个部门的数据显示，在限制措施实施之前，美国国务院在1月份发放了4.3万个移民签证。4月份，只发放了1500个移民签证。", "note_en": "The Trump administration will ban entry into the U.S. for foreigners on certain temporary work visas — including high-skilled H-1B visas— through the end of the year, senior administration officials told reporters Monday afternoon.\n Why it matters: The highly-anticipated immigration restrictions expand on President Trump&#39;s earlier  coronavirus-related immigration ban introduced in late April — which was also extended through the end of the year.\n Trump has leveraged emergency powers and economic concern from the coronavirus to slowly shut down large parts of the immigration system— even as he urges states to reopen.\n The administration also announced Monday that it is working toward permanent regulatory reforms that would crack down on H-1B visas and work permits for asylum seekers.\n The details: In addition to H-1B visas often relied on by big U.S. tech companies, the restrictions on entry will also affect visas for H-1B spouses, non-agriculture worker H-2Bs visas, short-term workers on J-1 exchange visas, and L visas, which allow companies to transfer employees working overseas to U.S. offices.\n The ban will be in effect through the end of the year, which will likely prevent many new H-1B visa workers outside of the country from entering the U.S.\n Certain foreign workers involved in the food supply chain will be exempt from the ban, along with college and university professors. The medical worker exemption in the April restrictions was narrowed to exempt only those coming in to work on COVID-19 care or research, the official said.\n The big picture: Trump&#39;s  first COVID-related immigration ban prevented foreigners from obtaining permanent immigration green cards if they are outside the U.S. and don&#39;t already have valid visas or other travel documents — with some exceptions.\n The State Department issued 43,000 immigrant visas in January, before the restrictions were implemented,  per department data. In April, just 1,500 immigrant visas were issued.", "posttime": "2020-06-23 05:24:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,coronavirus,冠状病毒,扩大,expand", "title": "特朗普将扩大与冠状病毒相关的移民限制", "title_en": "Trump To Expand Coronavirus-Related Immigration Restrictions", "transed": 1, "url": "https://www.axios.com/immigration-ban-h1b-visa-coronavirus-trump-8202a261-756b-4363-97cc-584c1909d686.html", "via": "", "real_tags": ["病毒", "冠状病毒", "扩大", "expand"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下是关于我的程序草图Iris如何工作的详细信息。这是我最近创作的最快、最有趣的素描之一。\n有一天，我醒来对自己说：我应该画一幅丰富多彩的虹膜素描。我不记得为什么了。\n我把它作为一个想法添加到我要创作的p5js草图清单中，上周三在等待布洛芬起作用时(我头疼了两天)，就开始用它了。在短短两个下午的时间里，我就得到了一个令我非常满意的结果。\n有几件事需要考虑“我会对此进行编程”。首先，问题是：这是可行的吗？在这种情况下，因为我知道它可以被“人类”画出来，所以答案是肯定的。下一个问题是我将如何做这件事？为了准备，我看了YouTube上关于如何用ProCreate画眼睛的教程。这给了我所需要的结构思想：如果您不知道如何绘制/绘制/构造对象，使用代码创建它是非常困难的。\n我首先实现了一个边界模糊的实心圆。我对“疯狂之夜”中的月光和光环所做的大致相同。\n有了这个，我就可以有一个虹膜(虽然是平的)和一个瞳孔(兴趣不大)。\n下一步就是在虹膜上添加一些图案。虹膜有一个线形(如果我没记错的话，是肌肉纤维)图案从外面的瞳孔流出。在我的第一个实现中，我编写了瞳孔和外部虹膜之间的线条生成器。该方法将产生长度为N(对于大N)的线，其长度由辐射形状的Perlin噪声调整。我对这个学生使用了类似的方法。这是因为瞳孔不是完美的圆形，而是轮廓参差不齐(因为虹膜是肌肉)。\n线的生成由外部瞳孔和外部虹膜之间的随机位置(以百分比表示)和边界之前任何可用的填充的大小百分比来参数化。因此，例如，如果初始位置在0.5(50%或中间)，则大小为1(100%)的线将最大限度地延伸到虹膜有色区域的整个跨度。如果初始位置为0.9(因此，几乎在外部边界)，100%大小将仅填充从80%的虹膜到100%的虹膜的宽度范围。\n这是一个很好的开始，对于一个快速的编码过程来说，看起来相当不错。我增加了一些亮点：小学、中学和小学生。瞳孔是假的：真正的瞳孔不会发光，瞳孔是个洞。但是有了它图像看起来好多了，我不太在意。高光只是一组不透明度非常低的放射状线条。在第一个模型中，不透明度降低到边界，但沿半径是恒定的。\n这个肌肉纤维模型在相对较低的分辨率下看起来不错，但放大后，很明显它就是Meh。更好的解决方案：用同样的方法构建多边形和等高线。代码上的差异很小，结果上的差异是显著的。你可以毫无问题地放大它，它看起来很不错。不过，带有行的旧代码仍然存在：将两者结合起来会产生最佳结果。我还找了一套很好的虹膜颜色。还需要稍微调整一下，有些果岭感觉太绿了。\n在这个改变之后(在瞳孔中也有类似的改变)，我调整了高光以使其更平滑。在p5js中很难得到真正平滑的“怪异”形状。最后，我手动调整了尺寸和数字，直到它看起来足够好。使用这种方法，Alpha交错是不可避免的。我一直在浮现的一个想法是，使用类似于这些弧形的多边形形状，但略有摇晃：这样你就会认为阿尔法锯齿和不平坦的边界结合在一起只是虹膜本身的产物。这是一个值得探索的想法，但我认为草图已经完成了。\n我对纤维的圆盘起始角进行了随机化，并在珀林噪声中添加了一些种子。最后，添加散布在虹膜上的随机小椭圆。虹膜有这种随机性。\n与多边形的闭合重合(使用curveVertex意味着您至少需要4个折点，并重复最后一个折点以确保它闭合…。我忘了\\_(ツ)_/使它看起来比代码正常工作时看起来更参差不齐，但是结果更好。", "note_en": "Here are the details about how my procedural sketch  Iris works. This has been one of the fastest and most enjoyable sketches I have created lately\n  One day I woke up and thought to myself:  I should do a generative iris sketch. I don’t remember why.\n  I added it as an idea to my list of  p5js sketches to create, and last Wednesday while waiting for ibuprofen to work (I had a two-days-and-counting headache), started with it. In just two short afternoons I had a result I am very happy with.\n There are several things that go into thinking “I will program this”. First, the question:  is it doable? In this case, since I knew it could be drawn “by humans”, was  yes. The next would be  how would I do it?. To prepare, I watched  this Youtube tutorial on how to draw an eye with  Procreate. This gave me the structural ideas I needed: if you don’t know how you’d draw/paint/construct the object, creating it with code is very hard.\n  I started by implementing a solid circle with a blurred border. Pretty much the same I did for the moonlight and halo in  Crazy Nights.\n With this, I could have an iris (although flat) and a pupil (with not a lot of interest).\n The next would be adding some pattern to the iris. Irises have a linear (muscular fibres, if I’m not mistaken) pattern flowing from the pupil outside. For my first implementation, I wrote a generator of lines between the pupil and the outer iris. This method would generate  N (for a large  N) lines of length adjusted by Perlin noise in a radiating shape. I used a similar approach for the pupil. This is because the pupil is not perfectly circular, but has a ragged contour (because the iris is a muscle).\n  The generation of lines is parameterized by a random position (as a percentage) between the outer pupil and the outer iris and a percentage of size to fill for whatever is available until the borders. So, for example, if the initial position is at 0.5 (50%, or middle), a 1 of size (100%) would generate lines that would go up to a maximum of full span of the coloured area of the iris. If initial position is at 0.9 (so, almost at the outer border), 100% size would just fill a band of width from 80% of the iris to 100% of the iris.\n This was a good start, looked pretty decent for a quick coding session. I added some highlights: primary, secondary and pupil. The pupil one is fake: real pupils don’t shine, the pupil is a hole. But the image looks so much better with it I don’t care that much. The highlights are just a radial set of lines with very low opacity. In this first model, opacity decreases to the borders, but is constant along the radii.\n  This muscle fiber model looks decent for relatively low resolutions, but on zooming in, it is clear it is just  meh. Better solution: with the same approach, construct polygons and contours. The difference in code is small, the different in results is significant. You can zoom in on this with no issues, it just looks good. The old code with lines is still present, though: combining both gives the best results. I also looked for a good set of colours for irises. Still would need a bit of tweaking, some of the greens feel  too green.\n  After this change (and a similar one in the pupil) I tweaked the highlights to be smoother. It’s hard to get really smooth “weird” shapes in  p5js. In the end I tweaked the sizes and numbers manually until it looked good enough. Alpha jagging is unavoidable with this approach. An idea I’ve been floating is using polygonal shapes similar to these arcs but slightly wobbly: then you’d think the alpha jagging combined with the uneven borders were just an artifact of the iris itself. It’s an idea to explore, but I consider the sketch finished as is.\n I randomised the start angle of the discs for the fibers, and added some seed to perlin noise. Finally, added random, small, ellipses strewn over the iris. Irises have this kind of randomness.\n  A happy coincidence with the closing of the polygons (using  curveVertex means you need at least 4 vertices, and repeating the last vertex to make sure it closes… I forgot  ¯\\_(ツ)_/¯) makes it look more jagged than it should if the code worked, but the result turns out better by it.", "posttime": "2020-06-23 05:23:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生殖,generative,虹膜", "title": "生殖性虹膜", "title_en": "Generative Iris", "transed": 1, "url": "https://mostlymaths.net/2020/06/iris-sketch.html/", "via": "", "real_tags": ["生殖", "虹膜"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MacOS-11引入了许多用户界面变化，更新了应用程序的外观，使其对从iPad应用程序过渡的人来说更容易接近。MacOS 11中还增加了对熟悉的iOS功能的支持-如SF符号和文本样式-这些功能增强了用户体验，并可以简化应用程序设计流程。\n当你为MacOS 11构建应用程序时，你会发现，当你将系统定义的元素与SwiftUI或Auto Layout结合使用时，大多数更新都是自动的；如果你的应用程序是高度定制的，你可能会有额外的工作要做。当您考虑为MacOS 11更新您的应用程序时，请查看以下更改以帮助您计划您的方法。\nMacOS-11刷新了整个系统的图标设计，为APP图标带来了统一的形状，为文档图标带来了精致的外观。此外，MacOS 11中还引入了多用途功能图标，可以在侧边栏和表格中表示项目或功能。\nSF符号的采用为整个系统中的字形和图标赋予了很强的视觉一致性，并为您提供了一种轻松创建图像和图标的方法，让您在任何地方都能感到宾至如归。MacOS 11自动将AppKit共享图像(如操作、解锁和共享)映射到特定符号。在某些情况下，符号的大小或对齐方式可能与其替换的AppKit图像不同，因此最好检查一下布局。\n在MacOS-11中，应用程序图标的设计语言促进了与所有平台的一致性，同时保留了MacOS图标典型的逼真渲染风格。应用程序图标结合了圆角矩形、正面透视和一致的投影，以提供统一的视觉体验。\n虽然设计语言强烈鼓励视觉一致性，但它并不排除明智的表现力。例如，Preview、Xcode和TextEdit图标继续合并对物理对象的描述，以最好地传达应用程序的核心目的，同时合并新的形状、透视和阴影。\n要合成文档图标，系统会将您的应用程序图标与熟悉的折角图标形状组合在一起。如果您的应用程序打开或创建了大量文档类型，您还可以提供自定义中心图像或背景外观来帮助人们区分它们。\n功能图标可以表示表视图或首选项窗口的内容侧栏中的项(或项类别)、技术或信息类型。功能图标通常使用MacOS-11圆角矩形形状来包含简单、明确的字形，但它也可以使用自定义形状和颜色。有关设计功能图标的帮助，请下载Apple Design Resources for MacOS中包含的产品模板。\n在MacOS 11中，您可以指定强调色来自定义应用程序按钮、选项突出显示和侧边栏字形的外观。当常规&gt；强调色首选项中的当前值为多色时，系统会应用您的强调色。\n如果用户将强调色首选项设置为多色以外的值，系统会将他们选择的颜色应用于整个应用程序中的相关项目，替换您的强调色。例外情况是使用您指定的固定颜色的侧栏标志符号。因为固定颜色侧栏标志符号使用特定的颜色来提供含义，所以当用户更改强调色首选项的值时，系统不会覆盖其颜色。要了解更多信息，请参阅侧栏。\n在整个MacOS11中，Windows都采用了让人想起iOS界面的视觉触感。例如，窗口集成了侧边栏、工具栏和内容区，使用更大的角半径，并显示轻量级控件。\n默认情况下，工具栏更高，窗口标题可以与控件一起内联显示，工具栏项不再包括边框。增加的高度和无边框的控件结合在一起，使MacOS-11工具栏具有流线型的外观。\n为了匹配默认工具栏增加的高度，工具栏项自动使用较大的控件大小。唯一的例外是集成的工具栏-标题栏区域-比如Safari窗口中的那个-它继续使用常规控件大小。要适应新的默认大小，您可能需要调整工具栏的布局。\n重要说明：继续使用minSize和maxSizeAPI设置工具栏项的大小可能会裁剪控件，因为当前值没有考虑较大的默认大小。如果需要指定工具栏控件的最小或最大大小，请使用约束。\n当水平空间有限时，工具栏可以在搜索栏的位置显示搜索按钮。当用户单击“搜索”按钮时，栏会展开；当他们单击窗口中的其他位置时，搜索栏会折叠，并且工具栏会再次显示该按钮。\n在首选项窗口中，工具栏可以使用SF元件来与主窗口的外观协调，但标题位置保持在工具栏按钮上方。当需要清晰显示时，各个工具栏按钮可以包含颜色。为了指示活动的首选项窗格，窗口将系统提供的选择外观应用于选定的工具栏按钮。\n如果窗口包括多个窗格，则可以将工具栏项的不同子集与每个窗格对齐，以便在用户调整窗口大小时，每组项保持在其关联视图的上方。\n在MacOS11中，侧边栏(技术上称为源列表)延伸到窗口的整个高度。在侧边栏中，默认项目间距、行高和字形大小都会增加，并且所选项目突出显示使用圆角外观。\n侧边栏的行高、文本和字形大小取决于它的整体大小，可以是小的、中等的或大的。您可以通过编程方式设置大小，但用户也可以通过在“常规首选项”中选择不同的侧边栏图标大小来更改它。下表显示了MacOS 11中的默认侧栏指标与之前版本的MacOS之间的差异。\n使用SF符号是创建使用新度量的侧栏字形的最简单方法。或者，您可以使用PDF模板图像来创建边栏字形；如果您必须使用位图图像，请确保以@1x和@2x分辨率以小、中、大尺寸创建它们。\n默认情况下，侧栏字形使用当前强调色(要了解更多信息，请参阅应用程序强调色)。如果您需要澄清单个侧边栏标志符号的含义，您可以为其指定一个固定的颜色，无论用户的强调颜色偏好如何，该颜色都会保持不变。不要使用指定固定颜色的功能来整体设置应用程序的样式。在MacOS中，人们希望在他们使用的所有应用程序中都能看到他们选择的强调色。\n在MacOS 11中，表格视图总体上更大，使用更高的行、更大的字体大小和更大的项目之间的空间，以增加表格内容内部和周围的视觉分隔。MacOS版本11引入了三种表视图样式来定义在特定窗口区域中工作良好的不同外观：插页、全角和自动。有关开发人员指南，请参阅NSTableView.style。\n镶嵌风格为MacOS-11桌子的扩展宽敞增添了镶嵌。因为插入样式增加了内容周围的可视空间，所以它在填充其他视图(如侧栏和工具栏)之间区域的表格中工作得很好，并与侧栏外观的变化相呼应。\n经典的全宽表格样式仍然可用，但会自动在每行的开头和末尾包含所需的内容填充。全角样式最适用于周围已有可视边距的表格，例如嵌入在首选项窗格中的表格。\n自动样式意味着系统使用表视图在视图层次结构中的位置来帮助确定其外观。\n为了创建更宽敞的表格，MacOS-11使用了几个新的表格视图指标。在下面的图表中，您可以看到MacOS 10.11和MacOS 10.15及更早版本之间的表行布局有何不同。\n除了上表中列出的值外，MacOS-11中的插入式表格在第一行之前和最后一行之后还包括一个10pt的垂直插页。\n使用推荐的24pt行高时，请确保图标或字形可以适合16pt×16pt的区域。\n考虑在一行内的项目之间增加6个点的间距，以确保表格外观宽敞。\n如果你不更新你的应用程序，当你的应用程序在MacOS 11中运行时，你的表格的外观不会改变。例外的是一个实现了侧边栏的表格。如果将表格样式标识为源列表，系统会自动应用新的侧边栏外观。有关指南，请参阅侧栏；有关开发人员指南，请参阅NSTableView.style.sourceList。\n提示：在MacOS11中，表格的宽度仍然与其行的宽度相同，但是新的填充和嵌入防止了列和单元格覆盖整行。系统还使用指定的样式来确定要添加到行背景功能(如选择外观或交替行颜色)的空间。如果需要提供完全覆盖一行的内容(如自定义背景外观)，请将其添加到行中，而不是单元格。\n工作表不再从父窗口工具栏的底部边缘展开。在MacOS 11中，工作表是漂浮在暗淡的父窗口顶部的圆角矩形视图。\n提醒是卡片状的矩形，与MacOS 11中的所有窗口使用相同的角半径。在提醒中，大多数内容居中对齐。\nMacOS 11中引入了菜单和菜单内容的视觉更改。如果使用标准菜单和菜单项，则会自动获得以下默认外观：\n菜单项标题使用与侧栏和窗口内容区域相同的13磅字体大小。\n菜单项的选择高亮显示是从菜单边缘插入的圆角矩形。\n刷新的AppKit控件(如复选框、弹出按钮、按钮和分段控件)强调简单和大胆，与iOS控件协调一致，同时保持熟悉的外观。当你在你的应用程序中使用标准的AppKit控件时，你应该不需要调整你的界面来采用新的外观。例外的是滑块，它更高。\n从MacOS-11开始，带有勾号标记的滑块的轨迹与拇指中心对齐。\n从MacOS 11中开始，SF Pro以可变字体的形式提供。可变字体格式提供单个包，该包包含所有支持的粗细(如常规、粗体和超轻)的字形，既有竖排字体，也有斜体字体。可变格式还支持光学大小调整，这是在字形之间插入的一种方式，以创建特定于大小的SF Pro版本，以适合每种设计。光学尺寸调整取代了对SF Pro的固定范围文本和显示变体的需要。\nMacOS版本11还引入了对各种文本样式的支持，例如正文、标题和标注。动态文字在MacOS 11中不可用。有关指南，请参阅排版。\n小部件以一种美观、易于浏览的方式提升应用程序中的少量有用内容。在MacOS 11中，您可以创建小、中、大三种大小的小部件；人们在将您的小部件添加到Notification Center时可以选择他们想要的大小。\n您还可以为iOS和iPadOS创建窗口小部件。有关指南，请参阅微件；有关开发人员指南，请参阅WidgetKit.11", "note_en": "macOS 11 introduces many user interface changes that update the appearance of apps and make them more approachable to people transitioning from iPad apps. macOS 11 also adds support for familiar iOS features — such as SF Symbols and text styles — that enhance the user experience and can streamline the app design process.\n  When you build your app for macos 11, you’ll find that most of the updates are automatic when you use system-defined elements with SwiftUI or Auto Layout; if your app is highly customized, you may have additional work to do. As you think about updating your app for macos 11, review the following changes to help you plan your approach.\n  macos 11 refreshes icon design throughout the system, bringing a uniform shape to app icons and a refined appearance to document icons. In addition, macos 11 introduces multipurpose feature icons that can represent items or functions in sidebars and tables.\n The adoption of SF Symbols imparts a strong visual consistency to glyphs and icons throughout the system, and gives you an easy way to create images and icons that look at home everywhere. macos 11 automatically maps AppKit shared images — such as Action, Unlocked, and Share — to specific symbols. In some cases, a symbol might not have the same size or alignment as the AppKit image it replaces, so it&#39;s a good idea to check your layout.\n   In macos 11, the design language for app icons promotes consistency with all platforms while retaining the lifelike rendering style typical of macOS icons. App icons combine a rounded-rectangle shape, a front-facing perspective, and a consistent drop shadow to provide a unified visual experience.\n  Although the design language strongly encourages visual consistency, it doesn’t preclude judicious expressiveness. For example, the Preview, Xcode, and TextEdit icons continue to combine depictions of the physical objects that best convey the app’s core purpose, while incorporating the new shape, perspective, and shadow.\n   To compose a document icon, the system combines your app icon with the familiar folded-corner icon shape. If your app opens or creates a large number of document types, you can also supply a custom center image or background appearance to help people distinguish them.\n   A  feature icon can represent an item (or category of items), a technology, or a type of information in a table view or in the content sidebar of a preferences window. A feature icon typically uses the macos 11 rounded rectangle shape to contain a simple, unambiguous glyph, but it can also use custom shapes and colors. For help designing a feature icon, download the production template included in the  Apple Design Resources for macOS.\n   In macos 11, you can specify an accent color to customize the appearance of your app’s buttons, selection highlighting, and sidebar glyphs. The system applies your accent color when the current value in General &gt; Accent color preferences is  multicolor.\n  If people set the Accent color preferences to a value other than multicolor, the system applies their chosen color to the relevant items throughout your app, replacing your accent color. The exception is a sidebar glyph that uses a fixed color you specify. Because a fixed-color sidebar glyph uses a specific color to provide meaning, the system doesn’t override its color when people change the value of Accent color preferences. To learn more, see  Sidebars.\n    Throughout macos 11, windows adopt visual touches that recall iOS interfaces. For example, windows integrate the sidebar, toolbar, and content areas, use an increased corner radius, and display lightweight controls.\n   By default, toolbars are taller, window titles can display inline with controls, and toolbar items no longer include a bezel. The increased height and bezel-free controls combine to give macos 11 toolbars a streamlined appearance.\n  To match the default toolbar’s increased height, toolbar items automatically use the large control size. The exception is an integrated toolbar-title bar area — such as the one in a Safari window — which continues to use the regular control size. To accommodate the new default size, you’ll probably need to adjust the layout of your toolbar.\n  IMPORTANT Continuing to use the  minSize and  maxSize APIs to set the size of a toolbar item can clip the control, because the current values don’t account for the larger default size. Use constraints if you need to specify minimum or maximum sizes for a toolbar control.\n When horizontal space is limited, the toolbar can display the Search button in place of the search bar. When people click the Search button, the bar expands; when they click elsewhere in the window, the search bar collapses and the toolbar displays the button again.\n  In a preferences window, the toolbar can use SF Symbols to harmonize with the appearance of the main window, but the title position remains above the toolbar buttons. When needed for clarity, individual toolbar buttons can include color. To indicate the active preference pane, the window applies a system-provided selection appearance to the selected toolbar button.\n  If your window includes multiple panes, you can align different subsets of toolbar items with each pane, so that as people resize the window, each set of items remains above its associated view.\n   In macos 11, a sidebar (technically known as a  source list) extends to the full height of the window. Within the sidebar, default item spacing, row height, and glyph size all increase, and the selected-item highlight uses a rounded-corner appearance.\n  A sidebar’s row height, text, and glyph size depend on its overall size, which can be small, medium, or large. You can set the size programmatically, but users can also change it by selecting a different sidebar icon size in General preferences. The table below shows the differences in default sidebar metrics between macos 11 and previous versions of macOS.\n   Using SF Symbols is the easiest way to create sidebar glyphs that use the new metrics. Alternatively, you can use PDF template images to create sidebar glyphs; if you must use bitmap images, be sure to create them in small, medium, and large sizes, at both @1x and @2x resolutions.\n By default, sidebar glyphs use the current accent color (to learn more, see  App Accent Colors). If you need to clarify the meaning of an individual sidebar glyph, you can give it a fixed color that persists regardless of the user’s Accent color preferences. Don’t use the ability to specify a fixed color to stylize your app as a whole. In macOS, people expect to see their chosen accent color throughout all the apps they use.\n  In macos 11, table views are larger overall, using taller rows, a larger font size, and more space between items to increase visual separation within and around table content. macos 11 introduces three table-view styles to define different appearances that work well in specific window areas: inset, full-width, and automatic. For developer guidance, see  NSTableView.style.\n The inset style adds insets to the expanded spaciousness of macos 11 tables. Because the inset style increases the visual space around the content, it works well in tables that fill the area between other views — such as sidebars and toolbars — and echoes the changes in sidebar appearance.\n  The classic, full-width table style remains available, but automatically includes the required content padding at the beginning and end of each row. The full-width style works best for tables that already have a visual margin around them, such as a table embedded in a preferences pane.\n  The  automatic style means the system uses the table view’s position in the view hierarchy to help determine its appearance.\n To create more spacious tables, macos 11 uses several new table-view metrics. In the diagrams that follow, you can see how the layout of a table row differs between macos 11 and macOS 10.15 and earlier.\n    In addition to the values listed in the table above, inset-style tables in macos 11 also include a 10pt vertical inset before the first row and after the last row.\n  Make sure your icons or glyphs can fit into a 16pt × 16pt area when you use the recommended 24pt row height\n Consider adding 6 points of space between items within a row to ensure a spacious table appearance\n If you don’t update your app, the appearance of your tables doesn’t change when your app runs in macos 11. The exception is a table that implements a sidebar. If you identify the table style as a  source list, the system automatically applies the new sidebar appearance. For guidance, see  Sidebars; for developer guidance, see  NSTableView.style.sourceList.\n Tip In macos 11, a table&#39;s width continues to equal the width of its rows, but the new padding and insets prevent columns and cells from covering the entire row. The system also uses the specified style to determine the space to add to row background features, like selection appearance or alternating row colors. If you need to provide content that completely covers a row — such as a custom background appearance — add it to the row instead of the cells.\n  Sheets no longer unfurl from the bottom edge of the parent window’s toolbar. In macos 11, a sheet is a rounded rectangle view that floats on top of the dimmed parent window.\n   Alerts are cardlike rectangles that use the same corner radius as all windows in macos 11. Within an alert, most content is center aligned.\n     macos 11 introduces visual changes to menus and menu content. If you use standard menus and menu items, you get the following default appearances automatically:\n Menu item titles use the same 13-point font size as sidebars and window content areas.\n  The selection highlight for a menu item is a rounded rectangle that’s inset from the edges of the menu.\n   Refreshed AppKit controls — such as checkboxes, pop-up buttons, push buttons, and segmented controls — emphasize simplicity and boldness, harmonizing with iOS controls while maintaining familiar appearances. When you use standard AppKit controls in your app, you shouldn’t have to adjust your interface to adopt the new appearances. The exception is the slider, which is taller.\n   Beginning in macos 11, the track of a slider with tick marks aligns with the center of the thumb.\n  Beginning in macos 11, SF Pro is available as a variable font. The variable font format delivers a single package that includes the glyphs for all supported weights — such as regular, bold, and ultralight — in both uprights and italics. The variable format also supports optical sizing, which is a way to interpolate between glyphs to create size-specific versions of SF Pro to fit every design. Optical sizing replaces the need for the fixed-range Text and Display variants of SF Pro.\n macos 11 also introduces support for the full range of text styles, such as body, headline, and callout. Dynamic Type is not available in macos 11. For guidance, see  Typography.\n  A widget elevates a small amount of useful content from your app in a beautiful, glanceable way. In macos 11, you can create widgets in small, medium, and large sizes; people choose the size they want when they add your widget to Notification Center.\n You can also create widgets for iOS and iPadOS. For guidance, see  Widgets; for developer guidance, see  WidgetKit.11", "posttime": "2020-06-23 05:22:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人机界面,interface", "title": "MacOS 11人机界面指南", "title_en": "macOS 11 Human Interface Guidelines", "transed": 1, "url": "https://developer.apple.com/design/human-interface-guidelines/macos/overview/whats-new-in-macos/", "via": "", "real_tags": ["人机界面", "interface"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Headlyy.com是一个平台，用户可以来这里随心所欲地表达自己的感受。", "note_en": "Headlyy.com is a platform where users can come and express their feelings as to however they like.", "posttime": "2020-06-23 05:04:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,电脑,今年,switching", "title": "苹果公司从今年晚些时候开始将Mac电脑更换为自己的处理器", "title_en": "Apple is Now switching Macs to its own processors starting later this year", "transed": 1, "url": "https://headlyy.com/post/1592856746310x718742091151946400", "via": "", "real_tags": ["苹果", "apple", "电脑", "今年", "switching"]}, {"category": "", "categoryclass": "", "imagename": "7c393d9cf266ed12237860dc17ee6ded.jpg", "infoid": 1007713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从黑客组织“匿名者”在互联网上肆虐，窃取并泄露了数十个美国组织的数百万份机密文件以来，这是十年来最好的一部分。现在，在乔治·弗洛伊德被杀后引发的全球抗议中，“匿名者”卷土重来--它带回了数以百亿兆字节的执法文件和内部通讯。\n上周星期五，也就是6月19日假期，一个名为分布式否认秘密的关注泄密的活动组织公布了一份269G的警方数据集合，其中包括电子邮件、音频、视频和情报文件，总共有100多万份文件。DDOSecrets创始人艾玛·贝斯特在接受“连线”采访时表示，被黑客窃取的文件来自“匿名者”，或者至少是“匿名者”组织的一部分，因为在“匿名者”松散、无领导的架构下，任何人都可以宣称自己是该组织的成员。上周末，DDOSecrets的支持者、匿名者和世界各地的抗议者开始挖掘这些文件，拿出关于警方追踪抗议者活动的坦率的内部备忘录。这些文件还揭示了执法部门是如何描述反法西斯运动安提法(Antifa)等组织的。\nDDOSecrets的联合创始人艾玛·贝斯特(Emma Best)在一系列短信中写道，这是美国执法机构遭遇的最大规模的公开黑客攻击。它提供了对负责保护公众的州、地方和联邦机构的最密切的内部观察，包括政府对COVID和BLM抗议活动的回应。\n根据Kreb on Security获得的一份执法备忘录，DDOSecrets公布的大量内部数据最初是从一家名为Netsential的网络开发公司获得的。这份由全国融合中心协会(National Fusion Center Association)发布的备忘录称，大部分数据属于美国各地的执法融合中心，这些中心充当联邦、州和地方机构的信息共享中心。网信没有立即回复记者的置评请求。\n贝斯特拒绝评论这些信息是否来自网信，但指出一些推特用户准确地指出，很多数据对应于网信系统。至于他们的来源，百思买只会说这个人自称是大写的“匿名者”，但隐晦地补充说，人们最终可能会看到一个熟悉的名字。(注：贝斯特拒绝评论这些信息是否来自网信，但他指出，一些推特用户准确地指出，很多数据与网信系统相符。至于他们的消息来源，百思买只会说，这个人自称大写字母“匿名者”)，但他隐晦地补充说，人们最终可能会看到熟悉的名字。\nDDOSecrets已经在其网站上以可搜索的格式发布了这些文件，支持者很快创建了#Blueleaks标签来收集他们在社交媒体上从被黑客攻击的文件中的发现。例如，在这些文件中的一些初步发现显示，FBI监控抗议者的社交账户，并向当地执法部门发送关于反警察信息的警报。其他文件详细说明了联邦调查局(FBI)追踪向抗议团体捐赠比特币的情况，以及内部备忘录警告称，白人至上主义团体冒充安提法(Antifa)煽动暴力。\nDDOSecrets指出，这些文件似乎都不是机密文件，Best承认，它们可能不会显示警方的非法行为。但该组织辩称，这些文件反而揭示了合法但有争议的做法，以及警方围绕安提法等组织进行讨论的基调-例如，将理查德·斯宾塞(Richard Spencer)等白人民族主义者描述为反安提法，而不是承认安提法明确反对那些追随斯宾塞的组织。\n贝斯特写道，执法的基本态度是我认为BlueLeaks文件非常好的一件事。我已经看到一些评论，认为它不太可能揭露警察的严重不当行为，但我认为这些评论有点没有抓住要点，或者至少将警察的不当行为完全等同于非法行为。目前的许多抗议活动的一部分是关于警察的所作所为和所做的一切都是合法的。\nDDOSecrets统计了200多个州、地方和联邦机构在泄密中的数据。在泄露的数据集中拥有最多信息的一些机构似乎确实是情报融合中心，如密苏里州信息分析中心、北加州地区情报中心、联合地区情报中心、特拉华州信息和分析中心以及奥斯汀地区情报中心。该组织还包括几个地区性的联邦调查局学院校友协会和Infraard，这是一个总部位于旧金山的组织，致力于在FBI和私营部门之间共享信息。\n对于这些组织及其成员和员工来说，在某些情况下，影响可能不仅仅是尴尬。Krebs on Security获得的NFCA备忘录警告说，泄露的文件包括高度敏感的信息，如银行账户路由号码和其他个人身份信息，以及犯罪嫌疑人的图像。然而，DDOSecrets&39；Best表示，该组织在发布之前花了一周的时间清理文件，寻找关于犯罪受害者和儿童的特别敏感的数据，以及关于无关的私人企业、医疗保健和退休退伍军人协会的信息。\n由于数据集的大小，我们可能遗漏了一些东西，贝斯特承认。我希望我们能做得更多，但我对我们所做的感到高兴，而且我们还在继续学习。贝斯特补充说，该组织在发布文件之前删除了超过50G字节的数据，他们称这是出于高度的谨慎，并将继续搜索这些数据，以寻找该组织稍后可能发布的任何符合公众利益的东西。\n然而，百思买指出，DDOSecrets在知情的情况下公布了这些财务信息，认为它可能与其他信息相关，以进一步揭露警察的行为，以符合公共利益的方式。贝斯特认为，这些数据的潜力，特别是从长远来看，当与其他数据集相关时，会盖过允许公众检查它的任何不利之处。\n他们对公布警务人员的个人身份资料也没有任何顾虑。他们写道，公众对公务员的身份感兴趣。\n与此同时，对于匿名者来说，BlueLeaks的发布可能是该组织多年来在美国采取的最重大行动。警方的目标让人回想起2011年匿名子组织Antisec的行动，该组织的成员-包括多产的黑客活动家杰里米·哈蒙德(Jeremy Hammond)-窃取并泄露了一系列执法目标的数据，以支持占领华尔街的抗议者。我能想到的最接近先例的是杰里米·哈蒙德(Jeremy Hammond)的一些黑客攻击，这是对BlueLeaks最好的评价。\n哈蒙德本人因黑客罪行仍在服刑10年。周五，一群名为杰里米·哈蒙德支持委员会(Jeremy Hammond Support Committee)的支持者在推特上发布了一个指向BlueLeaks数据转储的链接。上面简单地写着，去他妈的警察。#BlueLeaks。&#34；\n✨使用我们齿轮团队的最佳选择优化您的家庭生活，从机器人吸尘器到价格实惠的床垫再到智能扬声器", "note_en": "It&#39;s been the better part of a decade since the hacktivist group  Anonymous rampaged across the internet, stealing and leaking millions of secret files from dozens of US organizations. Now, amid the global protests following the killing of George Floyd, Anonymous is back—and it&#39;s returned with a dump of hundreds of gigabytes of law enforcement files and internal communications.\n On Friday of last week, the Juneteenth holiday, a leak-focused activist group known as Distributed Denial of Secrets published a 269-gigabyte collection of police data that includes emails, audio, video, and intelligence documents, with more than a million files in total. DDOSecrets founder Emma Best tells WIRED that the hacked files came from Anonymous—or at least a source self-representing as part of that group, given that under Anonymous&#39; loose, leaderless structure anyone can declare themselves a member. Over the weekend, supporters of DDOSecrets, Anonymous, and protesters worldwide began digging through the files to pull out frank internal memos about police efforts to track the activities of protesters. The documents also reveal how law enforcement has described groups like the antifascist movement Antifa.\n &#34;It&#39;s the largest published hack of American law enforcement agencies,&#34; Emma Best, cofounder of DDOSecrets, wrote in a series of text messages. &#34;It provides the closest inside look at the state, local, and federal agencies tasked with protecting the public, including [the] government response to COVID and the BLM protests.&#34;\n   The massive internal data trove that DDOSecrets published was originally taken from a web development firm called Netsential, according to a law enforcement memo obtained by  Kreb On Security. That memo, issued by the National Fusion Center Association, says that much of the data belonged to law enforcement &#34;fusion centers&#34; across the US that act as information-sharing hubs for federal, state, and local agencies. Netsential did not immediately respond to a request for comment.\n Best declined to comment on whether the information was taken from Netsential, but noted that &#34;some Twitter users accurately pointed out that a lot of the data corresponded to Netsential systems.&#34; As for their source, Best would say only that the person self-represented as &#34;capital A Anonymous,&#34; but added cryptically that &#34;people may wind up seeing a familiar name down the line.&#34;\n  DDOSecrets has published the files in a searchable format on its website, and supporters quickly created the #blueleaks hashtag to collect their findings from the hacked files on social media. Some of the initial discoveries among the documents showed, for instance, that the FBI monitored the social accounts of protesters and sent alerts to local law enforcement about anti-police messages. Other documents detail the FBI tracking bitcoin donations to protest groups, and internal memos warning that white supremacist groups have posed as Antifa to incite violence.\n  DDOSecrets notes that none of the files appear to be classified, and Best concedes that they may not show illegal behavior on the part of police. But the group argues that the documents instead reveal legal but controversial practices, as well as the tone of police discussions around groups like Antifa—for instance, describing white nationalists like Richard Spencer as anti-Antifa, rather than acknowledging that Antifa expressly opposes groups like those who follow Spencer.\n  &#34;The underlying attitudes of law enforcement is one of the things I think BlueLeaks documents really well,&#34; Best writes. &#34;I&#39;ve seen a few comments about it being unlikely to uncover gross police misconduct, but I think those somewhat miss the point, or at least equate police misconduct solely with illegal behavior. Part of what a lot of the current protests are about is what police do and have done legally.&#34;\n  DDOSecrets counts the data of more than 200 state, local, and federal agencies in the leak. Some of the agencies with the most sheer quantity of information in the leak&#39;s dataset do appear to be intelligence fusion centers, like the Missouri Information Analysis Center, the Northern California Regional Intelligence Center, the Joint Regional Intelligence Center, the Delaware Information and Analysis Center, and the Austin Regional Intelligence Center. The group also includes a handful of regional FBI Academy alumni associations and Infragard, a San Francisco–based group devoted to sharing information between the FBI and the private sector.\n  For those organizations and their members and employees, the effects could in some cases amount to more than mere embarrassment. The NFCA memo obtained by Krebs on Security warns that leaked files include &#34;highly sensitive information&#34; such as bank account routing numbers and other personally identifiable information, as well as images of criminal suspects. DDOSecrets&#39; Best says that the group spent a week prior to publication, however, scrubbing the files for especially sensitive data about crime victims and children, as well as information about unrelated private businesses, health care, and retired veterans&#39; associations.\n &#34;Due to the size of the dataset, we probably missed things,&#34; Best concedes. &#34;I wish we could have done more, but I&#39;m pleased with what we did and that we continue to learn.&#34; Best adds that the group pruned more than 50 gigabytes of data out of the files before publication out of what they describe as an abundance of caution, and will continue to scour that data for anything in the public interest that the group may publish later.\n Best notes, however, that DDOSecrets published the financial information knowingly, arguing that it could be correlated with other information to further expose police behavior in ways that serve the public interest. &#34;The potential of the data, especially in the long run and when correlated with other datasets, outweighs any downsides to allowing the public to examine it,&#34; Best argues.\n They also have no qualms about publishing the personally identifiable information of police officers. &#34;The public has an interest in the identities of public servants,&#34; they write.\n For Anonymous, meanwhile, the BlueLeaks release represents perhaps the most significant action the  group has undertaken in the US in years. The police targeting harks back to the 2011 operations of the Anonymous subgroup Antisec, whose members—including the prolific hacktivist Jeremy Hammond— stole and leaked data from a wide array of law enforcement targets in support of Occupy Wall Street protesters. &#34;The closest thing I can think of to a precedent is some of Jeremy Hammond&#39;s hacks,&#34; Best says of BlueLeaks.\n  Hammond himself is still  serving a 10-year sentence for his hacking crimes. On Friday, a group of supporters known as the Jeremy Hammond Support Committee tweeted out a link to the BlueLeaks data dump. It read, simply, &#34;Fuck the police. #BlueLeaks.&#34;\n   ✨ Optimize your home life with our Gear team’s best picks, from  robot vacuums to  affordable mattresses to  smart speakers", "posttime": "2020-06-23 05:03:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "窃取,stole,组织", "title": "匿名窃取并泄露了一大批警方文件", "title_en": "Anonymous Stole and Leaked a Megatrove of Police Documents", "transed": 1, "url": "https://www.wired.com/story/blueleaks-anonymous-law-enforcement-hack/", "via": "", "real_tags": ["窃取", "stole", "组织"]}, {"category": "", "categoryclass": "", "imagename": "113fc51f5a6ae9aefc8f6bfc91ea5637.jpeg", "infoid": 1007712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如今，互联网上几乎每一项服务都与金钱打交道。而与货币打交道需要一个强大的账单系统。建立自己的计费系统是一件痛苦的事情。它是一个重要的组件，应该高度可用、安全并且100%没有bug，否则，您的用户或您的企业可能会损失一些钱，这是不可接受的。\n在Mad Devs，如果可能，我们更喜欢使用健壮、合适和节省资源的解决方案。这就是我们经常使用条纹&amp；条纹连接为我们的产品启用计费的原因。这为我们的客户节省了大量的时间、金钱和负面情绪。\n条带和条带连接非常容易集成：它有大量文档和非常简单而强大的API。然而，对于那些刚开始接触在线支付和电子商务的人来说，“条纹”整合可能会带来一些问题和意想不到的副作用。本文将描述我们学到的一些经验教训，以便在为您的业务集成Strike Connect时，您可以轻松地避免或克服这些经验教训。\n如果您将卡链接到用户的帐户，或者您接受信用卡支付，请确保用户授权这些卡，否则您可能会有很多欺诈行为，从而导致纠纷。卡授权分几个步骤进行，您需要请求基本的卡详细信息，并确保将它们传递给STRIPE，以便它可以验证卡。但是，如果一个人偷了/扫描了一张卡，就很容易打破防御。要完全避免使用被盗卡片的情况，请使用3D安全。\n您可以这样做，要么设置条纹雷达规则，它会要求用户授权他们的卡，或者在构建支付意图或设置意图对象时，将其设置为从后端验证卡的默认方式。这将为您节省大量的精力、时间和金钱。3D Secure还提供了责任转移，因此您的平台对与欺诈相关的案件不承担任何责任。\nStripe Connect附带入职选项，这意味着您可以将用户的入职验证外包给Strip，新用户必须填写表格才能完成他们的配置文件，或者您可以在平台内进行您自己的入职验证。第二个选项允许您使其看起来像您希望的那样，并在入职验证期间避免与条纹相关的信息。然而，即使它看起来真的很有吸引力，这也不是一条容易的路。有很多数据需要处理，有很多情况需要考虑，还有很多格式需要格式化。\n否则，您将感受到将所有这些集成到您的平台中的痛苦。因此，请确保您有一个强有力的重要理由不使用STRIPE EXPRESS自注册流程。\n与卡附件一样，支付应从客户端(移动应用程序、网站等)实施。因为只有在这种情况下才能正确授权。在设置/支付意图的帮助下，您可以实施各种工作流程，并在用户付款时立即跟踪响应。在某些情况下，您可能愿意在非会话期间向用户卡收费，但是，这是可能会出现很多问题的地方(特别是如果添加了恶意卡)。避免从后端向用户收费，并确保他们更好地向您支付会话中的费用，如果他们只能在用户可能无法授权支付的情况下使用会话外支付(这里的示例可能是简单的订阅)。\n在您的工作流过程中可能会发生很多边缘情况。Stripe可能会开始他们的防欺诈检查，并暂时禁用您的帐户。用户的卡上可能没有足够的资金。卡可能不支持3D安全，等等。为了避免它-要做好准备。测试您与条带测试数据的集成。您应该始终监听WebHooks并更新用户帐户的状态，以通知用户更改、阻止等。+将您自己的代码工作流与条纹的工作流同步，以便在出现任何延迟、事务失败、临时锁定的情况下，您将能够向您的用户显示正在发生的事情，他们不应为此担心。阅读发展核对表以获得有关本课的更多想法。\nSTRIPE最重要的组件之一是通过WebHook与您的服务器进行通信。当您的平台帐户或连接的帐户出现问题时，条带会发送事件(重要！这是两件不同的事情！)。因此，请确保您的平台高度可用，并启用所有帮助您将服务器的数据与Strip的数据同步的WebHook，反之亦然。千万不要将轮询与Stiped一起使用，因为这将需要大量的资源和对Strip的请求，而这些资源和请求是不需要的，请始终依赖WebHook，并确保如果服务器上的某些内容开始失败，您可以重新处理它们。\nStripe提供了多种支付方式，乍一看似乎很清楚，但有时选择可能会对我们的系统产生负面影响，或者可能不完全适合您的工作流程。\n例如，哪个目的地收费和转账听起来可能是个好主意，请记住您要转账到您的连接帐户。如果您还转移了费用数据，然后终究拿走了它，在全额退款的情况下，您可能会在连接的账户上获得负余额。如果您最终想拒绝它，您将不得不手动将钱转到该帐户，使其余额为0。注意这些细节，因为它们可能会让你感到困惑，甚至会花掉你一些钱。\n所有上述的教训只是处理在线货币和支付处理器集成时需要了解和学习的一小部分。仍然了解他们可以节省大量的时间、财力和情感资源，并防止事情出错。如果您有什么要添加到列表中，或者任何可以帮助改进这篇文章的建议，请随时发表评论，并将您的反馈发送到team@maddevs.io。", "note_en": "Almost every service on the Internet today deals with money. And dealing with money requires a robust Billing system. Building your own billing system is a pain. It is a crucial component that should be highly available, secure, and 100% bug-free, otherwise, your users or your business might lose some money, which is unacceptable.\n At Mad Devs, we prefer to use robust, suitable, and resources-saving solutions if possible. That is why we often use  Stripe &amp;  Stripe Connect to enable billing for our products. That saves our clients a lot of time, money, and negative emotions.\n Stripe as well as Stripe Connect is very easy to integrate: it has a lot of documentation and very simple and powerful API. Yet, for those who are new to online payments &amp; e-commerce Stripe integration might cause issues and unexpected side effects. This article is to describe some of our lessons learned so that when you integrate Stripe Connect for your business, you are easy to avoid or overcome them.\n  If you link cards to your users’ accounts, or you accept card payments make sure users authorize the cards, otherwise you might have a lot of fraud resulting in disputes. Cards authorization happens in several steps, you request basic card details and make sure they are passed to Stripe so that it can verify the card. But it is very easy to break defense if a person has stolen/scanned a card. To completely avoid cases of stolen cards being used, use the 3D Secure.\n  You can do it either setting  Stripe Radar rules and it would request users to authorize their cards OR make it a default way to auth the cards from backend when constructing  payment intent or  setup intent objects. This will save you a lot of efforts, time, and money. 3D secure also gives a  liability shift, so that your platform bears no responsibility for fraud-related cases.\n  Stripe Connect comes with  onboarding options, which means you might outsource users onbording &amp; verification to Stripe and new users will have to fill out the forms to complete their profiles, or you might conduct your own onboarding &amp; verification within the Platform. The second option allows you to make it look as you wish and avoid Stripe-related info during onboarding &amp; verification. Yet, even if it seems really attractive, it is not an easy way. There is a lot of data to deal with, a lot of cases to consider, and a lot of formatting.\n  Otherwise handled by Stripe, you can feel the pain integrating all of that to your platform. So, make sure you have a strong important reason not to use Stripe express onboarding flow.\n   As with card attachments, payments should be implemented from  a client (mobile app, website, etc.) side since only in this case it can be authorized properly. With the help of Setup/Payment Intents, you can implement all sorts of workflows and track responses right away while a user pays. There are cases when you would be willing to charge a user’s card off-session, yet, this is where (especially if a malicious card was added) a lot of problems can arise. Avoid charging users from the backend and make sure they better pay you on-session, if they can only use off-session payments if users might not be able to authorize the payment (an example here might be a simple subscription).\n  There are a lot of edge cases that can happen during your workflows. Stripe might begin their fraud prevention checkups and temporarily disable your accounts. Users might not have enough funds on their cards. Cards might not support 3D secure, and so on and so forth. To avoid it — be prepared for it. Test your integration with  Stripe Testing data. You should  always listen to webhooks and update the state of user’s accounts notifying users of the changes, blocks, etc. + sync your own code workflows with those of Stripe, so in case of any delays, failed transactions, temporary locks you would be able to show your users that something is happening and they should not worry about it. Read about  Development Checklist to get more ideas on this lesson.\n   One of the most important components of Stripe is communication with your server via webhooks. Stripe sends events when something happens either with your platform account or your connected accounts (Important! These are two different things!). So, make sure your platform is highly available and you enable all the webhooks that help you synchronize your server’s data to Stripe’s data and visa versa. Never use polling with Stripe since this would require a lot of resources and requests to Stripe which are not needed, always rely on webhooks and make sure you can reprocess them if something starts failing on your server.\n  Stripe offers a variety of payment methods, which seem so clear at first, yet sometimes the choice might have a negative impact on our system or might not exactly fit into a workflow of yours.\n  For example, which destination charges and transfers might sound like a good idea, keep in mind what you transfer to your connected account. If you also transfer the fee data and then take it after all, in case of a full refund you might get a negative balance on the connected account. If you want to reject it after all you will have to manually transfer money to that account to bring its balance to 0. Pay attention to those details, since they might get you confused or even cost you some money after all.\n  All the above-mentioned lessons are just a small part of what there is to know and to learn when dealing with online money and the integration of payment processors. Still knowing them can save a lot of time, financial and emotional resources and prevent things from going wrong. If you have something to add to the list or any suggestion, proposal that can help improve this article, feel free to comment and send us your feedback at  team@maddevs.io.", "posttime": "2020-06-23 04:46:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "条带,care", "title": "集成条带连接时应注意的重要事项", "title_en": "Important Things That You Should Take Care When Integrate of Stripe Connect", "transed": 1, "url": "https://blog.maddevs.io/integration-of-stripe-connect-926daa2978d5", "via": "", "real_tags": ["条带", "care"]}, {"category": "", "categoryclass": "", "imagename": "857b457db58135dbac74f04172fbe577.jpg", "infoid": 1007711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在此之前，我曾写过我最喜欢的Mac应用程序。但我有一半的时间是在终端上度过的，我有几个CLI工具，可以让我的生活变得更容易。以下是其中一些：\n外壳-您每次打开终端时使用的最重要的工具。我过去使用过Bash和Z Shell，目前我使用的是FISH。它是一个很棒的Shell，有很多开箱即用的功能，比如自动建议、语法突出显示，或者使用⌥+→和⌥+←在文件夹之间切换。\n一方面，这使得它非常适合初学者，因为您不需要设置任何东西。另一方面，因为它使用与其他shell不同的语法，所以您通常不能仅仅从互联网上粘贴脚本。您必须将不兼容的命令更改为fish脚本，或者启动Bash会话来运行bash脚本。我理解这个改变背后的想法(Bash不是最容易使用的语言)，但它对我没有任何好处。我编写bash/fish脚本的次数太少，以至于无法记住语法，所以我总是必须从头开始重新学习。而且，用于fish脚本的资源比用于bash脚本的资源要少。我通常最后会阅读文档，而不是从StackOverflow复制粘贴现成的脚本。\n我推荐吃鱼吗？是!。换壳很容易，所以试一试吧。尤其是如果您不喜欢修补您的shell，并且想要用最少的配置就能很好地工作的话。\n你可以用插件给鱼添加更多的功能。安装它们最简单的方法是使用插件管理器，如Fisher、Oh my Fish或Fundle。\nfranciscolourenco/完成-当长时间运行的脚本完成时发送通知。我没有一直开着的航站楼。我使用的是Guake风格的终端，它会在我需要时从屏幕顶部弹出，在不需要时隐藏起来。有了这个插件，当我运行耗时超过几秒的脚本时，我会在脚本完成时收到MacOS通知。\n我过去有更多的插件(rbenv、pyenv、nodenv、fzf、z)，但我切换到不同的工具以避免我的shell变慢(这是我过去对Zshell所做的错误)。\n如果您想看到更多的鱼类资源，请查看AWOWE-FISH资源库。与Z shell和Bash相比，FISH的插件更少，所以如果你想对其进行大量调整，这并不是最好的选择。对我来说-这是件好事。它阻止我启用太多插件，然后抱怨它的😉速度太慢。\n如果让我从整个列表中选择一个最喜欢的工具，那就是“星际飞船”。星际飞船是一个适用于任何炮弹的提示符。您只需安装它，将一行配置添加到您的.bashrc/.zshc/config.fish中，它就会处理剩下的事情。\n当前目录的GIT状态和不同的符号，具体取决于您是否有新文件、挂起的更改、存储等。\nPython版本(如果您在Python项目文件夹中)(同样适用于Go/Node/Rust/Elm和许多其他编程语言)。\n执行上一条命令所需的时间(如果超过几毫秒)。\n还有无数的其他信息。但是，以一种聪明的方式！如果您不在git存储库中，它会隐藏git信息。如果您不在Python项目中-没有Python版本(因为显示它没有意义)。它不会用太多的信息让你不知所措，提示符保持漂亮、有用和简约。\n我提过它很快吗？它是用铁锈写的，即使有这么多功能，它仍然比我以前所有的提示都要快！我对我的提示语非常挑剔，所以我通常会修改我自己的版本。我从现有的提示中提取功能，并将其粘合在一起，以确保我只有我需要的东西，并且它保持快速。这就是为什么我对星际飞船持怀疑态度。“外部工具不可能比我精心设计的提示符更快！”好吧，我错了。试一试，我相信你会喜欢的！向星际飞船的创造者致以巨大的赞誉！\n“z”允许您在文件系统中快速跳转。它会记住您访问的文件夹，在短暂的学习时间之后，您可以使用zpath_of_the_older_name在它们之间移动。\n例如，如果我经常转到~/work/src/jects文件夹，我可以只运行zpro并立即跳转到那里。Z的算法基于频率-频率和新近的组合，非常有效。如果它记住了您不想使用的文件夹，您始终可以手动将其删除。\n它加快了在我电脑上经常访问的文件夹之间移动的速度，并为我节省了大量的击键(和路径记忆)。\nfzf代表“模糊查找器”。这是一个通用工具，允许您使用模糊搜索查找文件、历史记录中的命令、进程、git提交等。您键入一些字母，它会尝试在结果列表中的任何位置匹配这些字母。您键入的字母越多，结果就越准确。您可能从代码编辑器中知道这种类型的搜索-当您使用命令打开文件时，您只键入文件名的一部分而不是完整路径-这是模糊搜索。\n我通过fish fzf插件使用它，所以我可以搜索命令历史记录或快速打开文件。这是另一个每天节省我时间的小工具。\n与find命令类似，但使用起来更简单、速度更快，并且具有良好的默认设置。\n您想查找一个名为“Invoice”的文件，但是您不确定它的扩展名是什么？或者可能是一个存放所有发票的目录，而不是一个文件？您可以卷起袖子开始为find命令编写那些正则表达式模式，也可以直接运行FD Invoice。对我来说，这个选择很简单，😉。\n默认情况下，FD忽略.gitignore中隐藏或列出的文件和目录。大多数时候--这就是你想要的，但对于那些需要禁用这项功能的极少数情况，我有一个别名：fda=&#39；fd-IH&39；\n输出的颜色很好，根据基准测试(或上面的GIF)，它甚至比Find更快。\n与上面提到的fd类似，ripgrep是grep命令的替代方法-速度更快，具有合理的缺省值和彩色输出。\n它跳过被.gitignore和隐藏文件忽略的文件，因此您可能需要此别名：rga=&#39；rg-uuu&#39；。它禁用所有智能过滤，并使Ripgrep表现为标准grep。\n显示Linux或Mac上运行的进程信息的最常用工具称为top。它是每个系统管理员最好的朋友。而且，即使你主要像我一样做网络开发，看看你的电脑是怎么回事也是很有用的。你知道，只是想看看这次是Docker还是Chrome吃掉了你所有的内存。\nTOP是非常基本的，所以大多数人都会改用HTOP。HTOP在类固醇上名列前茅--五颜六色，有很多选择，总体上使用起来更舒适。\n扫视是HTOP的补充工具。除了列出所有进程及其CPU和内存使用情况外，它还显示有关系统的其他信息。\n我仍然使用HTOP来更快地过滤和清除进程，但我会使用扫视来快速浏览我的计算机正在发生的事情。它附带API、Web UI和各种导出格式，因此您可以将系统监控提升到一个新的水平。我强烈推荐！\nVirtualenv是用Python创建虚拟环境的工具(与内置venv模块相比，我更喜欢它)。\nVirtualFish是Fish shell的虚拟环境管理器(如果您没有使用Fish，请查看viralenvwrapper)。它提供了一系列额外的命令来快速创建、列出或删除虚拟环境。\nPyenv、nodenv和rubyenv是用于在我的计算机上管理不同版本的Python、Node和Ruby的工具。\n假设您的计算机上有两个版本的Python。可能您正在处理两个不同的项目，或者您仍然需要支持Python2。管理不同的Python版本很困难。您需要确保不同的项目安装具有正确版本的包。如果您不小心，很容易搞砸这个脆弱的设置，并覆盖其他包使用的二进制文件。\n版本管理器提供了很多帮助，并将这场噩梦变成了一项相当容易管理的任务。好的版本管理器可以全局或“按文件夹”交换Python版本。而且每个版本都是与其他版本隔离的。\n我最近发现了一个名为asdf的工具，它可以用一个工具来管理所有这些内容，从而取代pyenv、nodenv、rbenv和其他*env。它提供了几乎所有编程语言的版本管理，下次需要为编程语言设置版本管理器时，我一定会试一试。\nVirtualenv解决了Python中的包管理的许多问题，但还有一个用例需要介绍。如果我想要全局安装Python包(因为它是一个独立的工具，就像前面提到的扫视一样)，我就遇到了一个问题。在虚拟环境之外安装软件包不是一个好主意，而且可能会在将来导致问题。另一方面，如果我决定使用虚拟环境，那么每次我想运行我的工具时都需要激活该虚拟环境。这也不是最方便的解决方案。\n事实证明，PIPEX工具可以解决这个问题。它将Python包安装到单独的环境中(因此它们的依赖关系没有冲突的风险)。但是，与此同时，这些工具提供的CLI命令在全球范围内都可用。所以我不需要激活任何东西-PIPEX会为我做这件事！\n当您使用Docker时，这两个工具都很有用。Ctop是用于Docker容器的类似于顶层的界面。它为您提供：\n统计数据，如内存使用情况、CPU和每个容器的附加详细窗口(包括开放端口和其他信息)。\n这比试图从docker ps中找出所有这些信息要好得多。\n如果你认为ctop很酷，那就等着试试lazydocker吧！这是一个功能更多的管理Docker的功能齐全的终端UI。说到Docker，我最喜欢的工具！\n除了我几乎每天使用的工具之外，还有一些我多年来收集的工具，我发现它们对特定的任务特别有用。有一些东西可以从终端记录GIF(您可以暂停和复制其中的文本！)、列出目录结构、连接到数据库等。\n如果您使用的是Mac，则不需要介绍自制软件。它实际上是MacOS的软件包管理器。它甚至有一个叫做Cakebrew的GUI版本。\nasciinema是一个可以用来记录终端会话的工具。但是，与录制GIF不同的是，它将允许您的观众从这些录制中选择和复制代码！\n它对记录编码教程有很大的帮助-没有多少事情像键入长命令那样令人沮丧，因为讲师没有为您提供代码片段。\n我很少再在终端中执行差异(比较两个文件之间的差异)，但如果您需要执行一项操作，请使用Colordiff而不是不可用的diff命令。Colordiff对输出进行着色，因此更容易看到变化，而不是试图遵循所有的“&lt；”和“&gt；”符号。\n对于运行git diff和git show命令，有一个更好的工具叫做diff-so-flick。它通过以下方式进一步改进了差异的外观：\n如果您想要显示给定目录的内容，树是实现该目的的首选工具。它以漂亮的树状结构显示所有子目录和文件：\n$TREE。.├──Recovery y.md├──Readme.md├──Archive├──Automator│├──Open\\Item2.Workflow││└──Contents││├──Info.plist│├──├──QuickLook│├──└──Document.png│：└──Start\\Screen\\Saver.Workflow├──BREW-cask.sh。\n类似于cat(最常用于在终端中显示文件内容的命令)，但更好。\n添加语法突出显示、git装订线标记(如果适用)、自动分页(如果文件很大)，通常会使输出更具可读性。\n如果您需要发送一些HTTP请求，并且发现curl使用起来不直观，那么可以尝试HTTPIE。\n这是一个很好的选择。它更容易与合理的默认值和简单的语法一起使用，返回彩色输出，甚至支持安装额外的插件(用于不同类型的身份验证)。\n简化手册页。“手册页”包含解释如何使用给定命令的Linux软件手册。尝试运行man、cat或man grep查看示例。它们非常详细，有时很难掌握。因此，tldr是社区努力将每个手册页的精华提炼成带有一些示例的简短描述。\nTLDR适用于最流行的软件。正如我所说的，这是社区的努力，有人为您记录一个晦涩难懂的包的可能性很小。但当它工作时，它提供的信息通常包含您正在寻找的内容。\n例如，如果您想要创建一个包含几个文件的gzip存档，man tar会让您不知所措。相反，TLDR tar将列出一些常见示例-第二个正是您想要做的事情：\n它五颜六色，显示其他信息，如git状态，自动将文件大小转换为人类可读的单位，以及所有这些，同时保持与ls相同的速度。\n尽管我喜欢并推荐它，但出于某些原因，我仍然坚持使用ls。我猜是肌肉记忆吧？\n我针对SQLite和PostgreSQL的首选CLI解决方案。通过自动完成和语法突出显示，它们比默认的sqlite3和psql工具更易于使用。\nMAS是用于从App Store安装软件的CLI工具。我一生中只用过一次--在我安装Macbook的时候。我也会用它来设置我的下一台Macbook。\nMAS允许您在MacOS中自动安装软件。它为您节省了大量点击的时间。而且，由于您正在阅读一篇关于CLI工具的文章，我想-就像我一样-您也不喜欢单击。\n我在我的“灾难恢复”脚本中保存了从App Store安装的应用程序列表。如果有什么不好的事情发生，我希望我能够重新安装所有的东西，麻烦最小。\n终端的磁盘使用分析器。快速、易用。当我需要释放一些空间时，我的默认工具(“哦，我肯定256 GB的磁盘空间会很充足！”)。\n一些工具，如FD、Ripgrep或Httpie，是您可能已经知道的东西的改进版本。除了新版本更易于使用之外，它们提供了更好的输出，有时甚至更快。因此，不要仅仅因为其他人都在使用旧工具而死守旧工具。\n我听到的坚持使用“标准Linux工具”的一个常见论点是：\n但是，如果您需要登录到Linux服务器并在那里执行一些工作，该怎么办呢？你将无法使用你的花哨工具。最好学习如何使用大多数Linux发行版内置的工具。\n您上一次必须登录Linux服务器是什么时候？你不能安装软件，但是你必须手动调试一些问题？我甚至都不记得了。现在这样做的人不多了。也许是时候重新考虑如何进行部署了，从手工工作转向更具伸缩性的工作？\n不要让您的工具带生锈，并在那里添加一些新的CLI工具！", "note_en": "Previously, I wrote about  my favorite Mac apps. But I spend half of my time in the terminal, and I have a handful of CLI tools that makes my life easier. Here are some of them:\n          Shell - the most important tool that you use every time you open the terminal. I’ve used Bash and Z shell in the past, and currently, I’m using fish. It’s a great shell with plenty of features out of the box, like the autosuggestions, syntax highlighting, or switching between folders with ⌥+→ and ⌥+←.\n  On the one hand, this makes it perfect for beginners, because you don’t have to set up anything. On the other hand, because it’s using a different syntax than other shells, you usually can’t just paste scripts from the internet. You either have to change the incompatible commands to  fish scripts or start a Bash session to run the bash scripts. I understand the idea behind this change (Bash is not the easiest language to use), but it doesn’t benefit me in any way. I write bash/fish scripts too seldom to memorize the syntax, so I always have to relearn it from scratch. And there are fewer resources for fish scripts than for bash scripts. I usually end up reading the documentation, instead of copy-pasting ready-made scripts from StackOverflow.\n  Do I recommend fish? Yes! Switching shells is easy, so give it a try. Especially if you don’t like to tinker with your shell and want to have something that works great with minimal configuration.\n    You can add more features to fish with plugins. The easiest way to install them is to use a plugin manager like  Fisher,  Oh My Fish, or  fundle.\n    franciscolourenco/done - sends a notification when a long-running script is done. I don’t have a terminal open all the time. I’m using a  Guake style terminal that drops down from the top of the screen when I need it and hides when I don’t. With this plugin, when I run scripts that take longer than a few seconds, I get a macOS notification when they finish.\n  I had more plugins in the past (rbenv, pyenv, nodenv, fzf, z), but I switched to different tools to avoid slowing down my shell (a mistake that I did in the past with Z shell).\n  If you want to see more resources for fish, check out the  awesome-fish repository. Compared with Z shell and Bash, fish has fewer plugins, so it’s not the best option if you want to tweak it a lot. For me - that’s a plus. It stops me from enabling too many plugins and then complaining that it’s slow 😉.\n      If I had to choose one favorite tool from this whole list - it would be Starship. Starship is a prompt that works for any shell. You install it, add one line of config to your  .bashrc/ .zshrc/ config.fish, and it takes care of the rest.\n    git status of the current directory and different symbols, depending on if you have new files, pending changes, stashes, etc.\n  Python version if you are in a Python project folder (the same applies to Go/Node/Rust/Elm and many other programming languages)\n  How long it took the previous command to execute (if it was longer than a few milliseconds)\n    And a bazillion other information. But, in a smart way! If you are not in a git repository, it hides the git info. If you are not in a Python project - there is no Python version (because there is no point in displaying it). It never overwhelms you with too much information, and the prompt stays beautiful, useful, and minimalistic.\n  Did I mention that it’s fast? It’s written in Rust, and even with so many features, it’s still faster than all my previous prompts! I’m very picky about my prompt, so I was usually hacking my own version. I was taking functions from existing prompts and gluing it together to make sure I only have things that I need and it stays fast. That’s why I was skeptical about Starship.  “There is no way that an external tool can be faster than my meticulously crafted prompt!” Well, I was wrong. Give it a try, and I’m sure you are going to love it! Huge kudos to the creators of Starship!\n      “z” lets you quickly jump around your filesystem. It memorizes the folders that you visit, and after a short learning time, you can move between them using  z path_of_the_folder_name.\n  For example, if I often go to folder  ~/work/src/projects, I can just run  z pro and immediately jump there. z’s algorithm is based on  frecency - a combination of  frequency and  recency that works very well. If it memorizes a folder that you don’t want to use, you can always remove it manually.\n  It speeds up moving between commonly visited folders on my computer and saves me a lot of keystrokes (and path memorization).\n      fzf stands for  “fuzzy finder”. It’s a general-purpose tool that lets you find files, commands in the history, processes, git commits, and more using a  fuzzy search. You type some letters, and it tries to match those letters anywhere in the list of results. The more letters you type, the more accurate the results are. You probably know this type of search from your code editor - when you use the command to open a file, and you type just part of the file name instead of the full path - that’s a fuzzy search.\n  I use it through the  fish fzf plugin, so I can search through command history or quickly open a file. It’s another small tool that saves me time every day.\n      Like the  find command but much simpler to use, faster, and comes with good default settings.\n  You want to find a file called “invoice,” but you are not sure what extension it has? Or maybe it was a directory that was holding all your invoices, not a single file? You can either roll up your sleeves and start writing those regex patterns for the  find command or just run  fd invoice. For me, the choice is easy 😉.\n  By default, fd ignores files and directories that are hidden or listed in the  .gitignore. Most of the time - that’s what you want, but for those rare cases when I need to disable this feature, I have an alias:  fda=&#39;fd -IH&#39;.\n  The output is nicely colorized and,  according to the benchmarks (or the GIF above), it’s even faster than  find.\n      In a similar manner to  fd mentioned above,  ripgrep is an alternative to the  grep command - much faster one, with sane defaults and colorized output.\n  It skips files ignored by  .gitignore and hidden ones, so you will probably need this alias:  rga=&#39;rg -uuu&#39;. It disables all smart filtering and makes  ripgrep behave as standard grep.\n    The most common tool to show information about processes running on Linux or Mac is called  top. It’s the best friend of every system administrator. And, even if you are mostly doing web development like me, it’s useful to see what’s going on with your computer. You know, just to see if it was Docker or Chrome that ate all your RAM this time.\n    top is quite basic, so most people switch to  htop.  htop is top on steroids - colorful, with plenty of options, and overall more comfortable to use.\n    glances is a complementary tool to  htop. Apart from listing all the processes with their CPU and memory usage, it also displays additional information about your system.\n      I still use  htop for faster filtering and killing processes, but I use  glances to quickly  glance at what’s going on with my computer. It comes with API, Web UI, and various export formats, so you can take system monitoring to the next level. I highly recommend it!\n      Virtualenv is a tool for creating virtual environments in Python (I like it more than the built-in  venv module).\n  VirtualFish is virtual environment manager for the fish shell (if you are not using fish, check out  virtualenvwrapper). It provides a bunch of additional commands to create, list, or delete virtual environments quickly.\n      Pyenv, nodenv, and rubyenv are tools for managing different versions of Python, Node, and Ruby on my computer.\n  Let’s say you want to have two versions of Python on your computer. Maybe you are working on two different projects, or you still need to support Python 2. Managing different Python versions is hard. You need to make sure that different projects install packages with the correct version. If you are not careful, it’s easy to mess up this fragile setup and overwrite binaries used by other packages.\n  Version manager helps a lot and turns this nightmare into a pretty manageable task. Good version manager can swap the Python version globally or “per folder”. And every version is isolated from others.\n  I’ve recently found a tool called  asdf that can replace pyenv, nodenv, rbenv, and other *envs with one tool to rule them all. It provides version management for pretty much  any programming language, and I will definitely give it a try next time I need to set up a version manager for a programming language.\n      Virtualenv solves many problems with package management in Python, but there is one more use case to cover. If I want to install a Python package globally (because it’s a standalone tool, like  glances mentioned before), I have a problem. Installing packages outside of a virtual environment is a bad idea and can lead to problems in the future. On the other hand, if I decide to use a virtual environment, then I need to activate that virtual environment each time I want to run my tool. Not the most convenient solution either.\n  It turns out that  pipx tool can solve this problem. It installs Python packages into separate environments (so there is no risk that their dependencies will clash). But, at the same time, CLI commands provided by those tools are available globally. So I don’t have to activate anything -  pipx will do this for me!\n        Both of those tools are useful when you are working with Docker.  ctop is a top-like interface for Docker containers. It gives you:\n  Statistics like memory usage, CPU, and an additional detailed window for each container (with open ports and other information)\n  It’s so much nicer than trying to figure out all this information from  docker ps.\n    And if you think that  ctop was cool, wait until you try  lazydocker! It’s a full-fledged terminal UI for managing Docker with even more features. My favorite tool when it comes to Docker!\n    Apart from the tools that I use almost every day, there are some that I collected over the years and found them particularly useful for specific tasks. There is something to record GIFs from the terminal (that you can pause and copy text from!), list directory structure, connect to databases, etc.\n      Homebrew needs no introduction if you are using a Mac. It’s a  de facto package manager for macOS. It even has a GUI version called  Cakebrew.\n      asciinema is a tool that you can use to record your terminal sessions. But, unlike recording GIFs, it will let your viewers select and copy the code from those recordings!\n  It’s a great help for recording coding tutorials - not many things are as frustrating as typing long commands because the instructor didn’t provide you with code snippets.\n      I rarely do diffs (compare differences between two files) in the terminal anymore, but if you need to do one, use  colordiff instead of the unusable  diff command.  colordiff colorizes the output, so it’s much easier to see the changes instead of trying to follow all the “&lt;” and “&gt;” signs.\n    For running  git diff and  git show commands, there is an even better tool called  diff-so-fancy. It further improves how the diff looks like by:\n      If you want to present the content of a given directory,  tree is a go-to tool to do that. It displays all the subdirectories and files in a nice, tree-like structure:\n  $ tree  . .├── recovery.md├── README.md├── archive├── automator│   ├── Open \\ Iterm2.workflow│   │   └── Contents│   │   ├── Info.plist│   │   ├── QuickLook│   │   │   └── Thumbnail.png│   │   └── document.wflow│   └── Start \\ Screen \\ Saver.workflow├── brew-cask.sh\n      Like  cat (command most commonly used to display the content of a file in a terminal) but better.\n  Adds syntax highlighting, git gutter marks (when applicable), automatic paging (if the file is large), and in general, makes the output much more enjoyable to read.\n      If you need to send some HTTP requests and you find  curl unintuitive to use, try  httpie.\n  It’s an excellent alternative. It’s easier to use with sensible defaults and simple syntax, returns a colorized output, and even supports installing additional plugins (for different types of authentication).\n    Simplified man pages.  “man pages” contain manuals for Linux software that explain how to use a given command. Try running  man cat or  man grep to see an example. They are very detailed and sometimes can be difficult to grasp. So  tldr is a community effort to extract the essence of each man page into a brief description with some examples.\n  tldr works for the most popular software. As I said, it’s a community effort, and there is a slim chance that someone will document an obscure package for you. But when it works, the information it provides usually contains what you are looking for.\n  For example, if you want to create a gzipped archive of a few files,  man tar will overwhelm you with the possible options.  tldr tar will instead list some common examples - the second one being exactly the thing that you want to do:\n          It’s colorful, displays additional information like the git status, automatically converts file size to human-readable units, and all that while staying equally fast to  ls.\n  Even though I like it and recommend it, for some reason, I still stick with  ls instead. Muscle memory, I guess?\n      My go-to CLI solutions for SQLite and PostgreSQL. With the auto-completion and syntax highlighting, they are much better to use than the default  sqlite3 and  psql tools.\n      mas is a CLI tool to install software from the App Store. I used it once in my life - when I was setting up my Macbook. And I will use it to set up my next Macbook too.\n  mas lets you automate the installation of software in macOS. It saves you from  a lot of clicking. And, since you are reading an article about CLI tools, I assume that - just like me - you don’t like clicking.\n  I keep a list of apps installed from the App Store in my “disaster recovery” scripts. If something bad happens, I hopefully should be able to reinstall everything with minimal hassle.\n      Disk usage analyzer for the terminal. Fast and easy to use. My default tool when I need to free some space ( “Ohh, I’m sure that 256GB of disk space will be plenty!”).\n      Some of the tools like the  fd,  ripgrep, or  httpie are improved versions of things that you probably already know. Except that the new versions are easier to use, they provide better output, and sometimes are actually faster. So don’t cling to old tools only because everyone else is using them.\n  A common argument for sticking with the  “standard Linux tools” that I hear is:\n  But what if you need to log in to a Linux server and do some work there? You won’t have access to your fancy tools. It’s better to learn how to use tools that come built-in with most Linux distributions.\n  When was the last time you had to log in to a Linux server? One where you can’t install software, but you had to debug some issues manually? I don’t even remember. Not many people do that anymore. Maybe it’s time to rethink how you do the deployment and move away from manual work into something more scalable?\n  Don’t let your tool-belt get rusty and add some new CLI tools there!", "posttime": "2020-06-23 04:45:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cli", "title": "最喜欢的CLI工具", "title_en": "Favorite CLI Tools", "transed": 1, "url": "https://switowski.com/blog/favorite-cli-tools", "via": "", "real_tags": ["cli"]}, {"category": "", "categoryclass": "", "imagename": "7869be446058d530eac5b842b9c69051.gif", "infoid": 1007710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你有没有坐过堵在路上的公交车，奇怪为什么路上停的是车，而不是公交专用道？A/B街是一款游戏，探索城市的微小变化如何影响司机、骑自行车的人、交通使用者和行人的移动。\n请参阅当前工作的路线图，包括提供帮助的方法。如果你想把这个带到你的城市，或者如果你在设计、交通模拟、数据可视化或市政/政府推广方面很在行，请通过dabreegster@gmail.com联系达斯汀·卡利诺(Dustin Carlino)。关注r/abStreet获取每周更新，或者关注@carlinodustin获取最近进展的临时视频。\n如果你在玩A/B街的时候解决了一些交通问题，我的最终目标是让你的改变成为调整西雅图基础设施的一个真正的建议。A/B街当然是一个游戏，它使用一种简化的交通建模方法，所以城市政府仍然必须使用他们现有的方法来评估提案。A/B街的目的是作为对话的起点和工具，以互动的可视化方式交流想法。\n为什么不把城市规划留给专业人士来做呢？人们是当地的专家，熟悉他们每天与之互动的城市的一小块地方--总是倒车的一条左转车道，或者是一组时机不佳的步行信号灯。劳拉·阿德勒写道：\n只有通过简单易用的模拟程序，市民才能成为他们自己城市愿景的激活者，而不仅仅是被政府官员猛烈抨击的选项的被动接受者。\n现有的城市规划软件要么是专有的，要么很难使用。“街舞”是一款有趣的、引人入胜的游戏，努力将无障碍设置得更高。请看这里了解更多指导原则。", "note_en": "Ever been on a bus stuck in traffic, wondering why there are cars parked on theroad instead of a bus lane? A/B Street is a game exploring how small changes toa city affect the movement of drivers, cyclists, transit users, and pedestrians.\n             See the  roadmap for current work, including ways to help. Ifyou want to bring this to your city or if you&#39;re skilled in design, trafficsimulation, data visualization, or civic/government outreach, please contactDustin Carlino at  dabreegster@gmail.com. Follow r/abstreet for weekly updates or @CarlinoDustin for occasional videos ofrecent progress.\n  If you fix some traffic problem while playing A/B Street, my ultimate goal isfor your changes to become a real proposal for adjusting Seattle&#39;sinfrastructure. A/B Street is of course a game, using a simplified approach totraffic modeling, so city governments still have to evaluate proposals usingtheir existing methods. A/B Street is intended as a conversation starter andtool to communicate ideas with interactive visualizations.\n Why not leave city planning to professionals? People are local experts on thesmall slice of the city they interact with daily -- the one left turn lane thatalways backs up or a certain set of poorly timed walk signals. Laura Adlerwrites:\n &#34;Only with simple, accessible simulation programs can citizens become activegenerators of their own urban visions, not just passive recipients of optionslaid out by government officials.&#34;\n Existing urban planning software is either proprietary or hard to use. A/BStreet strives to set the accessibility bar high, by being a fun, engaging game.See  here for more guiding principles.", "posttime": "2020-06-23 04:27:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,修复,simulation,城市", "title": "A/B街：修复西雅图交通的模拟游戏", "title_en": "A/B Street: A simulation game to fix Seattle's traffic", "transed": 1, "url": "https://abstreet.org/", "via": "", "real_tags": ["游戏", "修复", "城市"]}]