[{"category": "", "categoryclass": "", "imagename": "b995e6b8711098d47d50e81ab49789dd.png", "infoid": 1068408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CloudProxy的目的是隐藏云层后面的刮刀IP。它允许您使用流行的云提供商旋转一个代理池，只需一个API令牌。无需配置。\n        CloudProxy过度克拉帕毒的主要优点是CloudProxy只需要来自云提供商的API令牌。 CloudProxy自动部署并在云实例上配置代理，而无需用户需要预配置或复制图像。\n            age_limit  - 以秒为单位设置前向代理的年龄限制。达到年龄限制后，代理被替换。值0禁用该功能。默认值：0。\n    docker运行-e username =＆＃39; change_this_username＆＃39; \\ -e password =＆＃39; change_this_password＆＃39; \\ -e digitalocean_enabled = true \\ -e digitalocean_access_token =＆＃39;您的秘密访问键＆＃39; \\ -IT -P 8000：8000肉类/ CloudProxy：最新\n 建议使用码头图像标记为v版本。 Laffin / CloudProxy：0.3.0-Beta，请参阅最新版本。\n  CloudProxy在localhost上公开API：8000。您的应用程序可以使用以下API检索带有部署代理服务器的Auth的IP。然后您的应用程序可以使用这些IP来代理。\n 例如，循环通过IPS进行替代的逻辑将需要在您的应用程序中，例如： \n将随机导入请求作为Requests＃从CloudProxy Def Randum_Proxy（）返回一个随机代理程序：IPS =请求。得到（＆＃34; http：// localhost：8000＆＃34;）。 json（）随机返回。选择（IPS [＆＃39; IPS＆＃39;]）代理= {＆＃34; http＆＃34 ;: randum_proxy（），＆＃34; https＆＃34 ;: random_proxy（）} my_request =请求。获得（＆＃34; https：//api.ipify.org&#34;，代理=代理）\n   您可以通过API和UI管理CloudProxy。您可以访问http：// localhost / ui的UI。\n 您可以通过UI向上和向下缩放代理并将其删除每个提供商。\n                                CloudProxy在每30秒的时间表中运行，它将检查最小缩放是否已满足，如果不是，则它将部署所需数量的代理。新的代理信息将在部署并准备使用后显示在IP中。\n  该项目处于早期的Alpha，具有有限的功能。将来，将支持更多提供商，将实施自动阶段，并致富为富有的API，以允许对代理商的黑名单和回收。\n   贡献是使开源社区成为一个令人惊叹，激励和创造的令人惊叹。您所做的任何贡献都非常感谢。 ", "note_en": "The purpose of CloudProxy is to hide your scrapers IP behind the cloud. It allows you to spin up a pool of proxies using popular cloud providers with just an API token. No configuration needed.\n        The primary advantage of CloudProxy over Scrapoxy is that CloudProxy only requires an API token from a cloud provider. CloudProxy automatically deploys and configures the proxy on the cloud instances without the user needing to preconfigure or copy an image.\n            AGE_LIMIT - set the age limit for your forward proxies in seconds. Once the age limit is reached, the proxy is replaced. A value of 0 disables the feature. Default value: 0.\n    docker run -e USERNAME=  &#39;CHANGE_THIS_USERNAME &#39; \\ -e PASSWORD=  &#39;CHANGE_THIS_PASSWORD &#39; \\ -e DIGITALOCEAN_ENABLED=True \\ -e DIGITALOCEAN_ACCESS_TOKEN=  &#39;YOUR SECRET ACCESS KEY &#39; \\ -it -p 8000:8000 laffin/cloudproxy:latest\n It is recommended to use a Docker image tagged to a version e.g.  laffin/cloudproxy:0.3.0-beta, see  releases for latest version.\n  CloudProxy exposes an API on localhost:8000. Your application can use the below API to retrieve the IPs with auth for the proxy servers deployed. Then your application can use those IPs to proxy.\n The logic to cycle through IPs for proxying will need to be in your application, for example:\n import  random import  requests  as  requests # Returns a random proxy from CloudProxy def  random_proxy():  ips  =  requests. get( &#34;http://localhost:8000&#34;). json()  return  random. choice( ips[ &#39;ips&#39;]) proxies  = { &#34;http&#34;:  random_proxy(),  &#34;https&#34;:  random_proxy()} my_request  =  requests. get( &#34;https://api.ipify.org&#34;,  proxies = proxies)\n   You can manage CloudProxy via an API and UI. You can access the UI at  http://localhost/ui.\n You can scale up and down your proxies and remove them for each provider via the UI.\n                                CloudProxy runs on a schedule of every 30 seconds, it will check if the minimum scaling has been met, if not then it will deploy the required number of proxies. The new proxy info will appear in IPs once they are deployed and ready to be used.\n  The project is at early alpha with limited features. In the future more providers will be supported, autoscaling will be implemented and a rich API to allow for blacklisting and recycling of proxies.\n   Contributions are what make the open source community such an amazing place to be learn, inspire, and create. Any contributions you make are  greatly appreciated.", "posttime": "2021-06-26 17:32:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "隐藏,hide,代理", "title": "CloudProxy  - 隐藏云背后的刮刀IP ", "title_en": "Cloudproxy – hide your scrapers IP behind the cloud", "transed": 1, "url": "https://github.com/claffin/cloudproxy", "via": "", "real_tags": ["隐藏", "hide", "代理"]}, {"category": "", "categoryclass": "", "imagename": "b87673dd3d9f33462ab823fcad449b7c.jpg", "infoid": 1068407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1999年，当长期麻省理工学院罗恩里维斯特教授创造了一个加密拼图，以庆祝学校的计算机科学实验室35周年，他表示将在任何人可能解决之前再过35年。  RIVEST表示，拼图需要35年的连续计算，以及每年用下一个最快的模型切换执行它的计算机。 他说它需要几乎不可想象的步骤。  “大多数工作将在过去几年中真正完成，但是，”最近几年来的是，“当时最近。  他没想到的是在几年内完成的所有工作 - 以及十年和十年的时间表。 ", "note_en": "In 1999, when longtime MIT professor Ron Rivest created a cryptographic puzzle to celebrate the 35th anniversary of the school’s Laboratory for Computer Science, he said it would be another 35 years before anyone could possibly solve it.\n Rivest said the puzzle would take 35 years of continuous computing, along with switching out the computer performing it with the next fastest model each year. He said it would require a virtually unimaginable number of steps.\n “Most of the work will really be done in the last few years, however,” Rivest said at the time.\n What he didn’t expect was for  all of the work to be finished in a few years — and a decade and a half ahead of schedule.", "posttime": "2021-06-26 17:28:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,解决,solve,拼图", "title": "程序员解决了MIT的20岁加密拼图 ", "title_en": "Programmers solve MIT’s 20-year-old cryptographic puzzle", "transed": 1, "url": "https://www.boston.com/news/local-news/2019/05/21/bernard-fabrot-mit-puzzle/", "via": "", "real_tags": ["程序", "解决", "solve", "拼图"]}, {"category": "", "categoryclass": "", "imagename": "c381752bccaec104ff585f4c4e1fb98d.png", "infoid": 1068406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这对任何观看了许多动作电影或扮演职责的人来说是一个熟悉的愿景：一个使不可见物体可见的幽灵般的绿色图像。自20世纪60年代中期开发第一夜视设备以来，该技术已捕获了流行的想象力。\n 夜视护目镜，红外摄像机和其他类似的设备检测从物体反射的红外光或者以热量的形式检测从物体发出的红外光。今天，这些设备不仅由军队而广泛使用，也是由执法和紧急服务，安全和监督行业，野生动物猎人和露营爱好者的爱好者。\n 但目前的技术并非没有问题。商用红外相机阻挡可见光，扰乱正常视觉。齿轮庞大和重，需要低温 - 并且在某些情况下，即使是低温冷却 - 工作。\n  我们提出了一种新技术，该技术采用超薄层的纳米晶体来使红外光可见，解决了当前设备的许多长期存在的问题。我们的研究发表于先进的光子学。\n  我们的最终目标是生产一种灯，可以坐在眼镜或其他镜片上，由微小的内置激光器提供动力，让人们在黑暗中看到。\n  商用红外摄像机将红外光转换为电信号，然后在显示屏上显示。由于红外光的能量和频率低，它们需要低温。这使得传统的红外探测器庞大和重沉重 - 一些安全人员由于经常使用夜视护目镜而导致慢性颈部损伤。\n 目前技术的另一个缺点是它阻断了可见光的传输，从而扰乱正常视觉。在某些情况下，可以将红外图像发送到显示监视器，留下正常的视觉。但是，当用户正在移动时，此解决方案是不可行的。 \n还有一些全光学替代品，不涉及电信号。相反，它们直接将红外光转换成可见光。然后可以通过眼睛或相机捕获可见光。\n 这些技术通过将进入的红外光与强光源组合 - 一种激光束 - 在称为“非线性晶体”的材料内。然后晶体在可见光谱中发光。\n 然而，非线性晶体庞大且昂贵，并且只能检测在红外频率窄带中的光。\n  我们的工作推进了这种全光学方法。我们开始使用被称为“Metasurfaces”的精心设计的纳米晶体层，而不是非线性晶体。 Metasurfaces是超薄和超光线，可以调整以操纵穿过它们的光的颜色或频率。\n 这使得Metasurfaces成为将红外光子转换为可见的有吸引力的平台。重要的是，透明元件可以使红外成像能够同时进行正常视觉。\n 我们的小组旨在展示与Metasurfaces的红外成像。我们设计了由数百个令人难以置信的微小晶体天线组成的元表面，由砷化镓制成。\n 这种元表面设计用于通过某些红外频率的共振放大光，以及激光器的频率和可见光输出。然后我们制造了金属表面并将其转移到透明玻璃上，在玻璃表面上形成一层纳米晶体。 \n为了测试我们的元曲面，我们用目标的红外图像照亮它，并看到红外图像被转换为​​可见的绿色图像。我们用目标的各种位置测试了这一点，也没有目标 - 所以我们可以看到Metasurface本身的绿色排放。在获得的图像中，暗条纹对应于红外目标，被绿色可见发射包围。\n 尽管通过组合元表面的独立纳米晶体上升的红外图像的不同部分，但是在可见光中再现图像。\n  虽然我们的实验只是一个概念证明，但该技术原则上可以做很多不可能与传统系统不可能的事情，例如更广泛的视角和多色红外成像。\n  由于夜视之外的各种应用，对人眼不可见的红外光的需求不断增长。该技术可用于农业产业，以帮助监控和维持食品质量控制，以及LIDAR的遥感技术 - 一种有助于映射自然和人造环境的技术。\n 在更广泛的背景下，使用Metasurfaces来检测，产生和操纵光线蓬勃发展。利用Metasurfaces的力量将使我们更接近实时全息显示器，自主系统的人工视觉，以及超快速的基于WiFi的技术。 ", "note_en": "It’s a familiar vision to anyone who has watched a lot of action movies or played Call of Duty: a ghostly green image that makes invisible objects visible. Since the development of the first night-vision devices in the mid-1960s, the technology has captured the popular imagination.\n Night vision goggles, infrared cameras and other similar devices detect infrared light reflected from objects or rather detect infrared light emitted from objects in the form of heat. Today these devices are widely used not only by the military, but also by law enforcement and emergency services, the security and surveillance industries, wildlife hunters, and camping enthusiasts.\n But current technology is not without its problems. Commercial infrared cameras block visible light, disrupting normal vision. The gear is bulky and heavy, and requires low temperatures — and, in some cases, even cryogenic cooling — to work.\n  We have proposed a new technology that uses ultra-thin layers of nanocrystals to make infrared light visible, addressing many of the longstanding problems with current devices. Our research is published in  Advanced Photonics.\n  Our eventual goal is to produce a light, film-like layer that can sit on glasses or other lenses, powered by a tiny built-in laser, allowing people to see in the dark.\n  Commercial infrared cameras convert infrared light to an electric signal, which is then shown on a display screen. They require low temperatures, because of the low energy and frequency of infrared light. This makes conventional infrared detectors bulky and heavy – some security personnel have reported chronic neck injury due to  regular use of night vision goggles .\n Another drawback of the current technology is that it blocks the transmission of visible light, thereby disrupting normal vision. In some cases, infrared images could be sent to a display monitor, leaving normal vision intact. However, this solution is not feasible when users are on the move.\n     There are also some all-optical  alternatives, which do not involve electrical signals. Instead, they directly convert infrared light into visible light. The visible light can then be captured by the eye or a camera.\n These technologies work by combining incoming infrared light with a strong light source – a laser beam – inside a material known as “nonlinear crystal”. The crystal then emits light in the visible spectrum.\n However, nonlinear crystals are bulky and expensive, and can only detect light in a narrow band of infrared frequencies.\n  Our work advances this all-optical approach. Instead of a non-linear crystal, we set out to use carefully designed layers of nanocrystal called “metasurfaces”. Metasurfaces are ultra-thin and ultra-light, and can be tweaked to manipulate the color or frequency of the light that passes through them.\n This makes metasurfaces an attractive platform to convert infrared photons to the visible. Importantly, transparent metasurfaces could enable infrared imaging and allow for normal vision at the same time.\n Our group set out to demonstrate infrared imaging with metasurfaces. We designed a metasurface composed of hundreds of incredibly tiny crystal antennas made of the semiconductor gallium arsenide.\n This metasurface was designed to amplify light by resonance at certain infrared frequencies, as well as the frequency of the laser and the visible light output. We then fabricated the metasurface and transferred it to a transparent glass, forming a layer of nanocrystals on a glass surface.\n  To test our metasurface, we illuminated it with infrared images of a target and saw that the infrared images were converted to visible green images. We tested this with various positions of the target, and also with no target at all — so we could see the green emission of the metasurface itself. In the images obtained, the dark stripes correspond to the infrared target, surrounded by the green visible emission.\n Despite different parts of the infrared images being up-converted by independent nanocrystals composing the metasurface, the images were well reproduced in visible light.\n  While our experiment is only a proof of concept, this technology can in principle do many things that are not possible with conventional systems, such as a broader angle of view and multi-colour infrared imaging.\n  The demand for detecting infrared light, invisible to human eyes, is constantly growing, due to a wide variety of applications beyond night vision. The technology could be used in the agricultural industry to help monitor and maintain food quality control, and in remote sensing techniques such as LIDAR – a technology that is helping to map natural and manmade environments.\n In a wider context, the use of metasurfaces to detect, generate and manipulate light is booming. Harnessing the power of metasurfaces will bring us closer to technologies such as real-time holographic displays, artificial vision for autonomous systems, and ultra-fast light-based wifi.", "posttime": "2021-06-26 16:41:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "薄膜,crystal,红外", "title": "微型晶体薄膜可以让夜视成为日常的现实 ", "title_en": "Tiny crystal films could make night vision an everyday reality", "transed": 1, "url": "https://theconversation.com/seeing-the-invisible-tiny-crystal-films-could-make-night-vision-an-everyday-reality-162615", "via": "", "real_tags": ["薄膜", "crystal", "红外"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\n发表于3月22日，2021 20:52 UTC（Mon）由Cyber​​ax（✭支持者✭，＃52523）[链接]\n  多年来我发现奶牛很糟糕，最好避免它们。\n 如果你＆＃39;重新打破API兼容性，*然后你可能只是告诉人们使用vfork（）或posix_spawn（），因为那些已经成熟并且很好地理解的接口，并且后者甚至是便携式的。顺便提一下，在研究这一评论时，我偶然发现了来自克隆（2）：＆gt的TIDBIT;与Glibc包装器相比，原始克隆（）系统调用＆gt;接受空值作为堆栈参数（克隆3（）同样允许＆gt; cl_args.stack为null）。在这种情况下，孩子使用A＆gt;父母＆＃39; s堆栈的副本。 （编写编写的语义保证＆gt;当孩子＆gt时，孩子会在＆gt;过程修改堆栈时单独的堆叠副本。）在这种情况下，对于正确而GT;操作，不应指定CLONE_VM选项。 （如果是＆gt;孩子因使用＆gt; clone_vm标志而分享父级＆＃39; s内存，那么没有发生编写的复制复制和混乱和gt;很可能会导致。）听起来像是这样的声音打电话的乐趣。现在我想知道是否有任何开发者已经决定他们＆＃34;需要＆＃34;绕过Glibc并在我的任何系统上拉这类暗示......（我是一个SRE，所以如果它在生产中闯入，那么我的问题是我的问题。 ＆＃34;幸运的是，＆＃34;大多数虫子I＆＃39;已经看到的往往比这更高，但它仍然有点可怕，即内核将让你做那样的事情。 *这显然不会在内核和＃39;不打破用户空间的粉丝奉献，但是假装一会儿。\n 发表于3月23日，2021年10:08 UTC（Tue）由Pbonzini（✭支持者✭，＃60935）[链接]\n  posix_spawn（）不是单个系统调用（技术上，Fork（）和vfork（）是克隆（2）周围的包装器，但至少后者是单个系统调用）。\n 肯定，但在（荒谬）假设我们＆＃39;重新消除牛的假设，内核可能需要延伸与类似于Fork + Exec的能力的接口，并且该接口的POSIX标准名称是posix_spawn。\n 发表于3月23日，2021 23:00 UTC（Tue）由Cyber​​ax（✭支持者✭，＃52523）[链接] \n显然，人们不喜欢posix_spawn。也许我们会展现一个完整的更换，允许创建暂停的过程，调整其属性（使用基于文件句柄的API），然后恢复它。但我觉得我们实际上的实际上是一种基于IO_URE的API，它可以使用BPF来实现这一点。\n 我们_almost_已经有了一个API：Ptrace。轻微的问题是ptrace真的很糟糕。它的建议也太糟糕了，添加了基于Saner处理的版本。\n  几年前我们讨论了这篇论文，这争辩说，Fork（）基本上是错误的原始原始，可以构建OS流程管理：https://lwn.net/arlicle/785430/\n  发表于3月23日，2021年14:17 UTC（TUE）通过ABATTERS（✭支持者✭，＃6932）[链接]\n  我最近考虑过vfork（），但在遇到有关它的警告太多时最终会反对它。例如，请参阅Posix_spawn（）的Vfork（）的glibc历史：glibc＆lt; = 2.23：posix_spawn（）使用vfork（）如果设置了posix_spawn_usevfork，或者如果在IT Exec（3）之前没有预期的清除，则S请求的文件。但是，这种vfork（）的实现是许多错误的来源。 Linux Glibc＆gt; = 2.24：glibc提交9ff72da471a509a8c19791fe4697910469791046979105C19791046979110POSIX_SPAWN（）从vfork（）交换到克隆（克隆_vm | clone_vfork），它使用单独的堆栈为孩子。这修复了许多vfork（） - 相关的错误（＆＃34;可能的父clobber到期堆栈溢出＆＃34;），使其可以通过默认和忽略posix_spawn_usevfork来实现。最近的非Linux Glibc Glibc提交CCFB2964726512F6669FEA99A43AFA714E2E6A80 POSIX_SPAWN_USEVFORK被忽略，始终使用常规叉（），由于难点vfork（）在没有Linux特定的克隆（）语义的情况下工作。请注意，使用CLONE（CLONE_VM | CLONE_VFORK）安全地需要阻止所有信号，包括NPTL内部信号。但是Glibc包装器Don＆＃39; t让您阻止NPTL-Internal Signal，使得在Glibc之外更难以做到。查看所有血腥细节的Glibc实现。\n  Naïve非内核开发人员视角：这似乎_intually_就像问题的错误解决方案一样。孩子仍然可以访问该页面，所以肯定应该被标记为访问该页面，只要它确实有一个引用，而不是假装它并没有访问该页面只是因为它是munmap＆＃39; d。只是因为页面已经是Munmap＆＃39; d并不意味着这个过程可以＆＃39; t从中读取，为什么页表表删除了？但是，我假设它是一个非常好的原因，为什么这样做了。有人可以清理我的误解吗？\n ＆gt;孩子仍然可以访问该页面，所以肯定应该被标记为访问该页面，只要它确实有一个引用，而不是假装它并没有访问该页面只是因为它是munmap＆＃39; d。我不确定我理解你的观点，但是通过提交来阻止这个问题。当孩子想要采取额外的参考（对于VMSPLICE（）），它会获得副本而不是与父级共享的页面。之后，孩子的页面表和管道点持有的引用点对此新副本，以及对父级的访问丢失。 ＆gt;只是因为页面已经是Munmap＆＃39; d并不意味着这个过程可以＆＃39; t从中读取，为什么页表表删除了？这只是Munmap（）的语义 - 它 - 它必须调整VMA树和ZAP Page表条目，以便在那里不再表示Munmapped Range。然后，如果该过程尝试读取/写入该区域内的地址，IT SEGFAULTS。我们可以＆＃39; t留下页表条目，仅是因为另一个引用存在。从管道读取并通过这些页面表。 \n作为非内核开发人员，我＆＃39;好奇：回想起来，这头牛是根本错误的吗？为什么不治疗VMSplice参考＆＃34;参考资料＆＃34;在Munmap之后，可以使用户空间过程无法进入的页面，同时仍然保持内核＆＃39; s引用？\n 原则是，但是你有其他问题。例如，MMAP可用于在固定地址处分配内存。难以判断任何给定的地址是否合适（因为其他页面等可能是在路上），但如果您只是刚刚映射它，那么在同一地址和大小的后续MMAP中，它将真的很奇怪。用户佩勤可能会假设它不需要检查该案例中mmap的错误代码（或者它可能没有合适的恢复代码，并且只需呼叫中止（3））。因此，现在您的解决方案需要在隐藏页面顶部堆叠堆叠新页面，或重新定位隐藏页面，其中任何一个都是不动的。甚至没有提到您需要教导VMSplice以与Pages Do相同的方式跟踪VMSplice以跟踪每个进程的引用，而没有用户空间页面映射中实际存在的页面。这些都是解决的问题，这是一个安全问题，因此解决了难题不是修复的理想形式。在简单的牛休息中投掷是一种更直接的解决方案（但是，作为故事暗示，可能会有一些并发症，他们未能解释）。\n ＆gt;如果您只是刚刚Munmapped它，对于同一地址和大小的后续MMAP，它将非常奇怪。用户佩勤可能会假设它不需要检查该案例中mmap的错误代码（或者它可能没有合适的恢复代码，并且只需呼叫中止（3））。这让我想起了一个古老的错误：大约十年前，Firefox（使用Jemalloc的代码）会尝试做一个大的对齐分配，如＆＃34; p = mmap（null，size * 2）; Munmap（P）; p = mmap（round_up（p，对齐），大小）;＆＃34;即，使用第一个MMAP + MUNMAP在地址空间中发现足够大的孔，然后在该孔中的正确对齐地址处分配。如果第二个MMAP and＃39; t返回请求的地址，必须有一个竞争条件与另一个线程分配在同一个孔中，因此它会循环并再次尝试，并希望下次更好运气。这正常工作好，直到它在内核上运行了随机MMAP的安全功能，并完全忽略了地址参数（从技术上都是可以的，因为它被定义为只是一个提示，而不是要求），因此代码被困在无限循环。这是固定的年龄，但它确实可以合理于某些用户空间代码可能仍然同样不明智的假设。\n  PTE必须消失，因为那个＆＃39; s被指定为dummap（）是什么。此外，它的事实＆＃39; s t\n...... ", "note_en": "Please consider subscribing to LWN Subscriptions are the lifeblood of LWN.net. If you appreciate this content and would like to see more of it, your subscription will help to ensure that LWN continues to thrive. Please visit  this page to join up and keep LWN on the net.\n   The kernel&#39;s memory-management subsystem is built upon many concepts, oneof which is called &#34;copy on write&#34;, or &#34;COW&#34;.The idea behind COW is conceptually simple, but itsdetails are tricky and its past is troublesome. Any change to itsimplementation can have unexpected consequences and cause subtle breakagefor existing workloads. So it is somewhat surprising that last year we sawtwo major changes the kernel&#39;s COW code; less surprising is the fact that,both times, these changes had unexpected consequences and broke things. Some of the resulting problems are still not fixedtoday, almost ten months after the first change, while the original reasonfor the changes — a security vulnerability — is also not fully fixed. Readon for a description of COW, the vulnerability, and the initial fix; theconcluding article in the series will describe the complications that arosethereafter.  Copy on write is a standard mechanism for sharing a single instance of anobject between processes in a situation where each process has the illusionof an independent, private copy of that object. Examples include memorypages shared between processes or data extents shared between files. Tosee how COW is used in the memory-management subsystem, consider whathappens when a process calls  fork(): the pages in that process&#39;sprivate memory areas should no longer be shared between the parent andchild. But, instead of creating new copies of those pages for the childprocess during the  fork() call, the kernel will simply map theparent&#39;s pages in the child&#39;s page tables. Importantly, the page-tableentries in both parent and child are set as read-only (write-protected). If either process attempts to write to one of thesepages, a page fault will occur, and the kernel&#39;s page-fault handler willcreate a new copy of the page, replacing the page-table entry (PTE) in thefaulting process with a PTE that references the new page, but which allowsthe write to proceed. This action is often referred to as &#34;breakingCOW&#34;. If the other process then tries to write to that same page, anotherpage fault will occur, as that process&#39;s PTE is still marked read-only. But now thepage-fault handler will recognize that the page is no longer shared, sothe PTE can just be made writable and the process can resume. The benefits of this scheme are lower memory consumption and a reduction ofCPU time spent copying pages during  fork() calls. Often the priceof copying is never paid for many of the pages because the childmight call  exit() or  exec() before either the parent orthe child writes to those pages. While the COW mechanism looks simple, the devil is in the details, as hasbeen  shown already in the past. The recenttrouble in this area started in 2020; it resulted in two major changes whileattempting to fix a vulnerability — which is actually still not fixed in allscenarios — and resulted in many corner cases, some of which are still notfully ironed out. The first public sign of issues with the COW mechanism appeared in the form of commit 17839856fd58(&#34;gup: document and work around &#39;COW can break either way&#39;issue&#34;) at the end of May 2020. The changelog doesn&#39;t fully describe theproblem scenario, but what is there is ominous enough: End result: the get_user_pages() call might result in a page pointer that is no longer associated with the original VM, and is associated with - and controlled by - another VM having taken it over instead.\n Any doubts about whether the commit fixed a security vulnerability vanishwhen one notices the Reported-by tag mentioning Jann Horn; presumablyHorn&#39;s report went through the appropriate non-public securitychannels. The practice of making fixes to some vulnerabilities immediatelypublic without explicitly marking them as such is not new, especially inthe COW area. Nevertheless, the related  ProjectZero issue was made public in August, and CVE-2020-29374 was assignedin December; both point to the above-mentioned commit as the fix. As the Project Zero issue includes proof-of-concept (PoC) code, we can look atthe fix with that code in mind and not rely on the incomplete commit log. Themost important parts of the PoC are the following: static void *data; posix_memalign(&amp;data, 0x1000, 0x1000); strcpy(data, &#34;BORING DATA&#34;); if (fork() == 0) {\t// child\tint pipe_fds[2];\tstruct iovec iov = {.iov_base = data, .iov_len = 0x1000 };\tchar buf[0x1000];\tpipe(pipe_fds);\tvmsplice(pipe_fds[1], &amp;iov, 1, 0);\tmunmap(data, 0x1000);\tsleep(2);\tread(pipe_fds[0], buf, 0x1000);\tprintf(&#34;read string from child: %s\\n&#34;, buf); } else {\t// parent\tsleep(1);\tstrcpy(data, &#34;THIS IS SECRET&#34;); }\n The code starts by allocating an anonymous, private page and writing somedata there; it then calls  fork(). At that point, the page becomesa COW page — it is write-protected for the parent process by making thecorresponding page-table entry read-only, and for the child process anidentical PTE is created. Then, while the parent is blocked inside sleep(), the child creates a pipe and passes the page to that pipewith  vmsplice(), a system call that is similar to  write()but which allows a zero-copy data transfer of the page&#39;s contents. In orderto achieve that, the kernel takes a reference on the source page (by increasing itsreference count) through  get_user_page() or one of its variants;the set of these functions is often referred to as &#34;GUP&#34;. The child thenunmaps the page from its own page tables (but retains the reference in thepipe) and goes to sleep. The parent wakes up from its sleep and writes new data to the page. Thepage table entry is write-protected, so the write causes a page fault. Thepage-fault handler can tell that this is fault on a COW page because thethe mapping allows write access while the PTE is write protected. If therewere more processes mapping the page then the content would have to becopied (breaking COW), but if there is a single mapping, the page canbe just made writeable. The kernel relies on the value returned by  page_mapcount()to determine how many mappings exist. Here is the problem:  page_mapcount() at this point in the PoC&#39;sexecution includes only the parent&#39;s mapping, because the child has alreadycalled  munmap() on that page. This function does not take intoaccount the fact that the child can still access the parent&#39;s page throughthe pipe; it ignores the elevated page reference count. Thus, the kernel allowsthe parent process to write new data into the page, which is no longerconsidered to be a COW page. Finally, the child wakes up and reads that newdata from the pipe, which might include sensitive information that theparent did not expect the child to see. One might rightfully ask why this potential of leaking data from parent tochild can matter in practice, as both processes are normally executing thecode from the same binary and the  fork() only acts as a branch inthe code. So we can assume that, either the binary is trusted and thus thechild process is too, or it is not and then we probably should not let theparent access any sensitive data in the first place. And, in the scenariowhere  fork() from a trusted binary is followed by an exec() of a potentially malicious binary,  exec() removesall shared pages from the address space of the child process before loadingthe new binary. But, as the Project Zero issue mentions, there areenvironments, such as Android, where each process is forked from a zygoteprocess without a subsequent  exec(), for performance reasons.That could lead to a situation that looks a lot like the PoC exploit forthis bug. Moreover, the  vmsplice() syscall might just be a symptom of abroader issue, since there are many other callers of the GUP functions inthe kernel. So it is a good idea in general not to let a child processhold on to a page shared through the COW mechanism with the parent whileletting the parent write new contents to the page. To prevent exploits of this behavior,commit 17839856fd58 made it impossible to get areference (even a read-only reference) via GUP to a COW-shared page. Allsuch attempts now result in breaking COW and returning a reference to the new copy instead. Thus,in the PoC code above, calling  vmsplice() now causes the childprocess to replace the shared COW page in the corresponding page tableentry with a new page, which is then passed to the pipe. Afterward, thechild no longer has any way to access the parent&#39;s page and the newcontents written there. The commit notes the possibility of worse performance for some GUP users,especially those that rely on a lockless variant of the interface like get_user_pages_fast(). The changelog continues that finer-grainedrules could be added later for situations where it is clear that it is safe tokeep sharing the COW page because it can never be overwritten with new,potentially sensitive contents. The system-wide zero-page would be oneexample of this sort of situation. But otherwise, Linus Torvalds (theauthor of the change) expectedno fundamental issues with this aggressively COW-breaking approach forGUP. Linux 5.8 was duly released with this commit. And this, one might think, was the end of the problem. But, as wasmentioned at the outset, COW is a complicated and subtle beast. In truth,the problems were just beginning. The second half of this article willdelve into how the COW fix led to a stampede of new problems that stillhave yet to be completely solved.     ( Log in to post comments)\n  What a cliffhanger!  I certainly am glad that project zero is there to root out these bugs (pun intended).\n &#34;But, as the Project Zero issue mentions, there are environments, such as Android, where each process is forked from a zygote process without a subsequent exec(), for performance reasons. That could lead to a situation that looks a lot like the PoC exploit for this bug.&#34;\n  It&#39;s definitely a problem because it doesn&#39;t match the user&#39;s mental model of how fork() is supposed to work. It&#39;s clear that either COW must be broken in this case or a mapping must be retained (or the refcounts split into per-mm versions, which seems likely to be far more expensive). The conceptually ideal approach would have everything act just like normal data, i.e. recognise things like vmsplice references *as* references so you don&#39;t need to specially break COW early for them -- but this seems likely to be viciously complex and of only minor benefit. Of course, hunting down every single way a reference can be taken by a child and arranging to COW-break on all of them seems likely to be a nightmarish game of whack-a-mole too...\n  Posted Mar 22, 2021 20:52 UTC (Mon) by  Cyberax ( ✭ supporter ✭, #52523) [ Link]\n  Over the years I found that COWs are just bad and it&#39;s best to avoid them altogether.\n If you&#39;re going to break API compatibility anyway,* then you might as well just tell people to use vfork() or posix_spawn(), as those are already mature and well-understood interfaces, and the latter is even portable.  Incidentally, while researching this comment, I stumbled across this tidbit from clone(2):  &gt; In contrast to the glibc wrapper, the raw clone() system call  &gt; accepts NULL as a stack argument (and clone3() likewise allows  &gt; cl_args.stack to be NULL). In this case, the child uses a  &gt; duplicate of the parent&#39;s stack. (Copy-on-write semantics ensure  &gt; that the child gets separate copies of stack pages when either  &gt; process modifies the stack.) In this case, for correct  &gt; operation, the CLONE_VM option should not be specified. (If the  &gt; child shares the parent&#39;s memory because of the use of the  &gt; CLONE_VM flag, then no copy-on-write duplication occurs and chaos  &gt; is likely to result.)  That sounds like it would be fun to debug. Now I&#39;m wondering if any developers have decided that they &#34;need to&#34; bypass glibc and pull this sort of chicanery on any of my systems... (I&#39;m an SRE, so if it broke in production, it would be my problem to fix it). &#34;Fortunately,&#34; most of the bugs I&#39;ve seen have tended to be higher-level than this, but it&#39;s still a bit frightening that the kernel will just let you do something like that.  * Which is obviously not going to happen given the kernel&#39;s fanatical devotion to not breaking userspace, but let&#39;s pretend for a moment.\n Posted Mar 23, 2021 10:08 UTC (Tue) by  pbonzini ( ✭ supporter ✭, #60935) [ Link]\n  posix_spawn() is not a single system call (technically both fork() and vfork() are wrappers around clone(2), but at least the latter is a single system call).\n Well sure, but in the (absurd) hypothetical where we&#39;re eliminating COW, the kernel would presumably need to grow an interface with capabilities similar to fork+exec, and the POSIX standard name for that interface is posix_spawn.\n Posted Mar 23, 2021 23:00 UTC (Tue) by  Cyberax ( ✭ supporter ✭, #52523) [ Link]\n  Apparently, people dislike posix_spawn. Perhaps we would grow a full replacement that would allow to create a suspended process, tweak its attributes (using file handle-based API) and then resume it.  But I feel what we might actually get is a io_uring-based API that does this using BPF.\n We _almost_ have that api already: ptrace.  Minor problem being that ptrace is really awful. It&#39;s too bad the proposals to add a saner handle based version have all died off.\n  A couple of years ago we discussed this paper, which argues that fork() is fundamentally the wrong primitive to build OS process management around:  https://lwn.net/Articles/785430/\n  Posted Mar 23, 2021 14:17 UTC (Tue) by  abatters ( ✭ supporter ✭, #6932) [ Link]\n  I considered using vfork() recently, but ultimately decided against it after encountering too many warnings about it. For example, see the history of glibc using vfork() for posix_spawn():  glibc &lt;= 2.23: posix_spawn() uses vfork() if POSIX_SPAWN_USEVFORK is set or if there is no cleanup expected in the child before it exec(3)s the requested file. However, this implementation of vfork() was the source of a number of bugs.  Linux glibc &gt;= 2.24: glibc commit 9ff72da471a509a8c19791efe469f47fa6977410 posix_spawn() switches from vfork() to clone(CLONE_VM | CLONE_VFORK) which uses a separate stack for the child. This fixes a number of vfork()-related bugs (&#34;possible parent clobber due stack spilling&#34;), making it possible to enable by default and ignore POSIX_SPAWN_USEVFORK.  recent non-Linux glibc glibc commit ccfb2964726512f6669fea99a43afa714e2e6a80 POSIX_SPAWN_USEVFORK is ignored and regular fork() is always used, due to difficulties getting vfork() to work without the Linux-specific clone() semantics.  Note that using clone(CLONE_VM | CLONE_VFORK) safely requires blocking all signals, including NPTL-internal signals. But the glibc wrappers don&#39;t let you block NPTL-internal signals, making it much more difficult to do outside of glibc. See the glibc implementation for all the gory details.\n  Naïve non-kernel-developer perspective: this seems _intuitively_ like the wrong solution to the problem. The child still has access to the page, so surely it should still be marked as having access to that page as long as it does indeed have a reference to it, rather than pretending it doesn&#39;t have access to the page just because it&#39;s been munmap&#39;d. Just because the page has been munmap&#39;d doesn&#39;t mean that the process can&#39;t read from it, so why is the page table entry removed? I assume there&#39;s a very good reason why it&#39;s done this way, though. Could someone clear up my misunderstanding?\n &gt; The child still has access to the page, so surely it should still be marked as having access to that page as long as it does indeed have a reference to it, rather than pretending it doesn&#39;t have access to the page just because it&#39;s been munmap&#39;d.  I&#39;m not sure I understand your point, but that problem is prevented by the commit. When the child wants to take that extra reference (for vmsplice()) it gets a copy instead of the page shared with the parent. Afterwards both the page tables of the child and the reference held by the pipe point to this new copy, and the access to parent&#39;s page is lost.  &gt; Just because the page has been munmap&#39;d doesn&#39;t mean that the process can&#39;t read from it, so why is the page table entry removed?  That&#39;s simply the semantic of munmap() - it has to adjust the VMA tree and zap page table entries so that the munmapped range is no longer represented there. Then if the process tries to read/write to an address within the area, it segfaults. We can&#39;t leave the page table entry there just because another reference exists. The read from the pipe doesn&#39;t go through these page tables.\n As a non-kernel developer, I&#39;m curious:  In retrospect, is this COW breaking fundamentally wrong? Why not treat vmsplice reference &#34;as references&#34;? Is is possible to make the page inaccessible to the userspace process after munmap while still keep the kernel&#39;s reference?\n In principle yes, but then you have other problems.  For example, mmap can be used to allocate memory at a fixed address. It can be difficult to tell whether any given address is suitable (because other pages etc. might be in the way), but if you had just munmapped it, it would be really weird for a subsequent mmap of the same address and size to fail. Userspace might assume that it doesn&#39;t need to check the error code for mmap in that case (or it might not have suitable recovery code, and just call abort(3)).  So now your solution needs to accommodate stacking a new page on top of the hidden page, or relocating the hidden page, either of which is nontrivial. That&#39;s not even mentioning the fact that you need to teach vmsplice to track per-process references in the same way as pages do, without that page actually existing in the userspace page map. These are all rather difficult problems to solve, and this is a security issue, so solving hard problems is not the ideal form of a fix. Throwing in a simple COW break is a much more straightforward solution (but, as the story alludes, there was presumably some complication which they failed to account for).\n &gt; if you had just munmapped it, it would be really weird for a subsequent mmap of the same address and size to fail. Userspace might assume that it doesn&#39;t need to check the error code for mmap in that case (or it might not have suitable recovery code, and just call abort(3)).  That reminds me of an old bug: About a decade ago, Firefox (using code from jemalloc) would try to do a large aligned allocation like &#34;p = mmap(NULL, size*2); munmap(p); p = mmap(round_up(p, alignment), size);&#34; i.e. using the first mmap+munmap to discover a large-enough hole in the address space, then allocating at a correctly-aligned address within that hole. If the second mmap didn&#39;t return the address that was requested, there must have been a race condition with another thread that allocated in the same hole, so it would loop around and try again and hope for better luck next time.  That worked okay until it ran on kernels with a security feature that randomised mmap and entirely ignored the address parameter (which is technically okay since it&#39;s defined as just a hint, not a requirement), so the code got stuck in an infinite loop.  That was fixed ages ago, but it does seem plausible that some userspace code may still make similarly unwise assumptions.\n  The PTE has to go away because that&#39;s what munmap() is specified to do. Furthermore, the fact that it&#39;s t\n......", "posttime": "2021-06-26 16:41:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "直到,cows,vfork", "title": "修补，直到奶牛回家 ", "title_en": "Patching until the COWs come home", "transed": 1, "url": "https://lwn.net/Articles/849638/", "via": "", "real_tags": ["直到", "cows", "vfork"]}, {"category": "", "categoryclass": "", "imagename": "f2f261ee9b23f9cbef78336888cc285f.jpg", "infoid": 1068404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过许多越来越多的铲子在烧焦的澳大利亚阳光下的污垢时，肖恩偶像开始认为他已经令人尴尬的错误，并且是 - 非常字面上挖掘自己的洞。\n Doody是南佛罗里达大学的爬虫学家，他们共度研究了澳大利亚黄色斑点的Goanna-A捕食者监视器蜥蜴，长爪，一个鞭状的尾巴和蜿蜒的肌肉机身，可以达到5英尺的长度。它的范围与欧洲一样大，但含有300万人，所以尽管大小，很少见，仍然是神秘的。直到最近，例如，没有人知道它在哪里奠定了鸡蛋。 Doody谈到了原始的澳大利亚人，他们经常捕捉怀孕的女性，附近看起来像洞穴入口。 “但每次有人试图到达时，他们都会靠近他们的肩膀并击中死去的终点，”他告诉我。\n 他在2012年发现了同样的事情，当他和四个同事挖到了一个加入勇敢的洞穴。从表面，在突然停止之前，隧道仅略微宽较宽的肌肉下降约两英尺。但是，当Doody交易他的铲子勺子时，轻轻地推动暴露的污垢，他意识到隧道的末端比其墙壁略微柔软。这意味着洞穴比似乎更深;创造它的加法者已经用土壤回填。有趣的，做的，他的团队挖得更深。\n 当他们三英尺下来时，没有任何东西可以展示他们的努力，Doody很困惑。当大多数爬行动物埋入卵子时，它们在表面下面少于一英尺。甚至大海龟挖掘浅巢。但是回填的Goanna Burrow一直待命。陌生人仍然，它的道路开始扭曲，开瓶器下降。 “我的伴侣，也是爬虫医生，在电话上，说，”你知道，肖恩，爬行动物不会深深地挖掘，“他告诉我。 “我开始怀疑自己。”\n 在五英尺的下来，在挖掘的第二天，Doody在他们中的一个人的时候对他的同事们精神上撰写道歉，他的头上躺在地上，他的手臂蜷缩在螺旋洞穴，尖叫着，“蛋！” Doodod和他的团队终于找到了一个巢穴;从中，他们拔出了10个鸡蛋，完整。\n 从那以后，该团队分析了几十个GOANNA BOUROWS，所有这些都有相同的精心制作结构。几只动物也挖掘（或挖掘）螺旋挖洞，包括蝎子，口袋踩踏者，一个名为古代截止者的灭绝海藻，以及叫做副爬行动物的哺乳动物，称为Diictodon，这些爬行动物被称为Diictodon，这些爬行动物被称为Diictodon，这些爬行动物是Diictodon，这些爬行动物是Diictodon，这是25500万年前的Diictodon。但黄色斑点的Goanna的巢穴比所有这些生物的巢穴更深入到延伸到表面下方的13英尺。 “这是一个荒谬的深度，”Doody告诉我。他认为黄色斑点的加法者面临着独特的挑战。它的大鸡蛋需要在孵化前8个月孵育 - 一个时期，通过澳大利亚的残酷旱季，当时几个月可能在没有任何雨的情况下才能。在浅层深度，鸡蛋会煮熟和干燥。只有在更深的土壤中，它们却较冷，湿润，它们是否可以存活。\n  为了创造她精心制作的洞穴，一个预期的女性歌阿首先挖出两英尺的土壤，并在附近的土墩中堆积。然后她有效地向下游泳，用正面腿挖掘，同时将松散的沙子移动到她身后的松散沙子以回填她创造的隧道。这需要几天，在此期间，她被包裹在土壤中并被足够的空气包围。 “我们在这个行为中找到了一个，她在那里留下了一个土豆，”Doofy告诉我。这可能是她在开瓶器中移动的原因，他补充说：“任何摔倒的沙子被她的身体阻挡了，事实是她转向的事实。”一旦她到达正确的深度，她就挖了一个开放式闭合拳的尺寸。她撒上她的鸡蛋，然后挖出她的方式，在她首次淹没后七到10天。 \n几个月后，当婴儿酵母孵化时，他们忽略了他们母亲的螺旋洞。相反，他们自己出去了，直行向上刮伤。 “海龟不得不挖掘漂亮，松散的沙子，有100个，”Doofy说。 “在这里，我们可能有八个孵化蜥蜴经过米的抗性土壤。”\n Goanna Burrows不会稀疏分布。许多这些蜥蜴筑巢，创造了大型公共沃朗。该团队曾经发现过100多个单独的离合器，小型客厅的大小。研究人员的重建是一个充满紧密包装的线圈的弹簧床垫。 Goannas在年复一年后重复使用了这些网站，并且随着单独的洞穴合并，折叠和侵蚀，沃伦成为充满开放空间的复杂迷宫。\n 这些职位空缺长期以来不会留空。 Doody的团队发现了一个不同的动物动物庇护和筑巢在Goanna Bourrows中。这些包括其他蜥蜴，蛇，蝎子，蜈蚣，甲壳虫，蚂蚁和称为脂肪尾的假甲素的鼠李泥浆。许多青蛙通过将自己埋在回填的洞穴的松散土壤中忍受了旱季。 “当我们拔出回填时，我们一遍又一遍地拔出几个青蛙，”Doody告诉我。在一个沃伦，他和他的同事发现了418蛙。 “依托这些洞穴的其他动物的纯粹数量和各种各样的人物是令人惊讶的，”博物馆维多利亚州维多利亚州的策展人Jane Melville告诉我。\n  Goannas通常被称为顶级捕食者，这些捕食者将吃任何东西，以及他们可以管理的一切。但是Doodod的工作表明，他们创造了和​​毁灭。它们很容易被视为生态系统工程师 - 以旨在为他们的生物创造机会的方式来修改他们的环境。海狸（大坝河），珊瑚（创造礁石）和啄木鸟（树木的钻孔）都是生态系统工程师。但除了几种乌龟和龟，爬行动物很少被认为是他们的队伍。 “我认为这可能是由于他们的经常消极的公众感知，”Curtin大学的爬虫学家Sophie Cross告诉我。 “爬行动物不被视为魅力。他们发挥着重要的生态角色，但这些并不广泛别名。“\n 例如，黄色察觉的加兰斯在北北部大部分地区发现，这使其成为一个“巨大的重要性”的工程师，“梅尔维尔说。 Doody认为其他Goan​​na种也重塑澳大利亚的景观，包括该国最大的蜥蜴 - 八英尺长的受限。他的学生Kari Soennichsen一直在放射线跟踪这些动物，以了解他们的卵子在哪里以及如何吞噬他们的鸡蛋。 “这一直很悲惨，试图找到这些家伙的巢穴，”Doody说。 “他们是秘密的，你必须一直都在他们身边。”去年，随着团队正准备另一个野外季节，“Covid真的踢了我们在屁股上。”\n 他们不能永远等待。 1935年，甘蔗蟾蜍被毫不羞于介绍给澳大利亚，一直慢慢地传播了该国的北部地区，他们的毒性分泌物是遗嘱的遗嘱，包括黄色斑点的雷纳斯。在某些地区，蜥蜴的数量已下降了90％。 Doody开始学习这些物种来学习其失踪的后果，而他的答案比他预期的更令人惊讶和陷入困境。随着Goannas消失，他们创造的地下世界也是如此。 ", "note_en": "After many futile hours of shoveling dirt under the scorching Australian sun, Sean Doody began to think that he had made an embarrassing mistake and was—quite literally—digging himself into a hole.\n Doody is a herpetologist from the University of South Florida who has spent years studying Australia’s yellow-spotted goanna—a predatory monitor lizard with long claws, a whiplike tail, and a sinuous, muscular body that can reach five feet in length. Its range is as large as Europe but contains just 3 million people, so despite the goanna’s size, it is seldom seen and remains mysterious. Until recently, for example, no one knew where it laid its eggs. Doody spoke to Aboriginal Australians who would often catch pregnant females near what looked like burrow entrances. “But every time someone tried to reach in, they’d get up to their shoulder and hit a dead end,” he told me.\n He found the same thing in 2012, when he and four colleagues dug into a goanna burrow themselves. From the surface, a tunnel that was only slightly wider than a muscular arm descended for about two feet before abruptly stopping. But when Doody traded his shovel for a spoon and gently pushed against the exposed dirt, he realized that the tunnel’s end was slightly softer than its walls. That meant the burrow was deeper than it seemed; the goanna that had created it had backfilled it with soil. Intrigued, Doody and his team dug deeper.\n By the time they were three feet down, with nothing to show for their efforts, Doody was confused. When most reptiles bury their eggs, they do so less than a foot beneath the surface. Even big sea turtles dig shallow nests. But the backfilled goanna burrow kept going. Stranger still, its path began to twist, corkscrewing as it descended. “My partner, who is also a herpetologist, was on the phone, saying, ‘You know, Sean, reptiles don’t dig that deep,’” he told me. “I was starting to doubt myself.”\n At five feet down, on the second day of digging, Doody was mentally composing an apology to his colleagues when one of them, lying flat on the ground with his head out of sight and his arm curled down the spiraling burrow, screamed out, “EGGS!” Doody and his team had finally found a nest; from it, they  pulled out 10 eggs, all intact.\n Since then, the team  has analyzed dozens of goanna burrows, all of which had the same elaborate structure. A few animals also dig (or dug) helical burrows, including scorpions, pocket gophers, an extinct beaver called  Palaeocastor, and a mammal-like reptile called  Diictodon that lived 255 million years ago. But the yellow-spotted goanna’s nests are deeper than those of all these creatures—extending as far as 13 feet below the surface. “That’s a ridiculous depth,” Doody told me. He thinks that the yellow-spotted goanna faces a unique challenge. Its large eggs need to incubate for 8 months before hatching—a period that takes them through Australia’s brutal dry season, when several months might go by without any rain. At shallow depths, the eggs would cook and desiccate. Only in deeper soil, which is cooler and wetter, can they survive.\n  To create her elaborate burrow, an expectant female goanna first digs out about two feet of soil and piles it in a nearby mound. Then she effectively swims downward, digging with her front legs while moving the loose sand behind her to backfill the tunnel she creates. This takes days, during which she is encased in soil and surrounded by just enough air to breathe. “We found one in the act, and she was lodged in there like a potato,” Doody told me. This might be why she moves in a corkscrew, he added: “Any sand that falls back down gets blocked by her body and the fact that she’s turning.” Once she reaches the right depth, she digs an open chamber the size of two clenched fists. She lays her eggs and digs her way back out, emerging seven to 10 days after she first submerged.\n  Several months later, when the baby goannas hatch, they ignore their mother’s helical burrow. Instead, they punch their own way out, scratching straight upward. “Sea turtles have to dig through nice, loose sand, and there’s 100 of them,” Doody said. “Here we have maybe eight hatchling lizards going through meters of resistant soil.”\n The goanna burrows are not sparsely distributed. Many of these lizards nest together, creating large communal warrens.  The team once found more than 100 separate clutches in an area the size of a small living room. The researchers’ reconstruction of the site looks like a spring mattress full of tightly packed coils. The goannas reuse these sites year after year, and as the separate burrows merge, collapse, and erode, the warrens become complex labyrinths full of open spaces.\n These vacancies don’t stay empty for long. Doody’s team has found a diverse menagerie of animals sheltering and nesting within the goanna burrows. These include other lizards, snakes, scorpions, centipedes, beetles, ants, and a mouselike marsupial called the fat-tailed false antechinus. Many frogs endure the dry season by burying themselves in the backfilled burrows’ loose soil. “When we pulled out backfill, we’d pull out handfuls of frogs, over and over,” Doody told me. In one warren, he and his colleagues found 418 frogs. “The sheer number and variety of other animals relying on these burrows is astounding,” Jane Melville, a curator at Museums Victoria who studies reptiles and amphibians, told me.\n  Goannas are typically characterized as top predators that will eat anything and everything they can manage. But Doody’s work shows that they create as well as destroy. They easily count as ecosystem engineers—animals that modify their environment in ways that create opportunities for the creatures around them. Beavers (which dam rivers), corals (which create reefs), and woodpeckers (which drill holes in trees) are all ecosystem engineers. But  other than a few species of tortoise and turtle, reptiles are rarely considered among their ranks. “I think this may be due to their often-negative public perception,” Sophie Cross, a herpetologist at Curtin University told me. “Reptiles are not considered charismatic. They play important ecological roles, but these aren’t widely known.”\n The yellow-spotted goanna, for example, is found across much of northern Australia, which makes it an engineer with “continent-wide importance,” Melville said. Doody thinks that other goanna species also reshape Australia’s landscape, including the country’s largest lizard—the eight-foot-long perentie. His student Kari Soennichsen has been radio-tracking these animals to find out where and how they lay their eggs. “It’s been miserable trying to find nests for these guys,” Doody said. “They’re secretive, and you have to be on them all the time.” And last year, as the team was gearing up for another field season, “COVID really kicked us in the butt.”\n They can’t wait forever.  Cane toads, which were ill-advisedly introduced to Australia in 1935, have been slowly spreading through the country’s northern region, and their poisonous secretions are lethal to would-be predators, including yellow-spotted goannas. In some areas, the lizards’ numbers have fallen by 90 percent. Doody started studying the species to learn the consequences of its disappearance, and his answer is more surprising and more galling than he could have anticipated. As the goannas vanish, so do the underground worlds they create.", "posttime": "2021-06-26 16:36:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "giant,创造", "title": "没有人想象的巨型蜥蜴巢会是这种奇怪的 ", "title_en": "No One Imagined Giant Lizard Nests Would Be This Weird", "transed": 1, "url": "https://www.theatlantic.com/science/archive/2021/06/monitor-lizards-australia-dig-incredible-corkscrew-nests/619294/", "via": "", "real_tags": ["giant", "创造"]}]