[{"category": "", "categoryclass": "", "imagename": "086deedfd61ad844220786f868668ad9.jpg", "infoid": 1069380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在他的回忆录“永久记录”出版前夕，美国国家安全局举报人爱德华·斯诺登在莫斯科与 MSNBC 的布莱恩·威廉姆斯进行了详细的谈话。", "note_en": "On the eve of his memoir 'Permanent Record' being published, NSA whistleblower Edward Snowden talked at length from Moscow with MSNBC's Brian Williams in an ...", "posttime": "2021-07-24 08:51:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "snowden,举报人", "title": "爱德华·斯诺登 (Edward Snowden) 谈隐私和民主威胁 (2019) [视频]", "title_en": "Edward Snowden on privacy and threats to democracy (2019) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=e9yK1QndJSM", "via": "", "real_tags": ["snowden", "举报人"]}, {"category": "", "categoryclass": "", "imagename": "bba1712f2d6f70278ff0108ed690ebf8.png", "infoid": 1069379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在政策团队中，我经常听到开发人员说起草项目治理是一个痛点。出于这个原因，我们制作了最小可行治理 (MVG)，这是一个简单、易于实施的治理框架，适用于您的免费和开源项目。它应该适用于所有项目——那些在几个朋友或几个大型企业竞争对手中的项目。它是开源的，因此您可以对其进行修改以满足您的需要。当您的项目从 1 个维护者变为 1+N 个维护者时，事情会变得复杂。突然，您需要弄清楚您将如何做出决定，如何添加其他维护者，如何分工并就愿景达成一致，以及谁拥有商标。通常对这些决定的谈判要么太少要么太多。对于志愿者运营的项目，人们通常在出现问题之前什么都不做，而这些问题会使社区紧张或破裂。对于有大型企业贡献者的项目，律师会参与其中，并花费数月时间协商减慢实际工作的重量级法律治理结构。 MVG 是维护者之间签署并存储在存储库中的协议。 MVG 为一组开源项目提供了一个两层结构。在顶层（在 GitHub 上称为“组织”），您选择一组人作为技术指导委员会，就组织所有项目之间的总体方向和协调做出决策。在该顶层之下是各个项目，维护者之间具有轻量级、基于共识的治理。该协议涵盖五项内容，默认设置如下。由于 MVG 是开源的，您当然可以修改文档以满足您的需要。做决定。 MVG 在组织层面默认采用基于共识的决策过程。共识并不意味着不反对——它意味着利益相关者基于其主导观点的松散同意，并考虑到突出的反对意见。这就是构建网络的方法。根据我们的经验，争取共识可以减少摩擦并减少敌对的项目分叉。在组织/指导委员会层面，无法通过共识做出的决定会退回到多数票。单个存储库仅达成共识，因此如果无法通过共识做出决定，则可以向指导委员会提出上诉。商标政策。中立的商标所有权是真正开放的协作过程的有力指标。当项目有一个非营利性公司主页时，该公司主页拥有商标（如项目名称和徽标），以便为更广泛的社区的利益进行管理。如果没有公司住所，商标所有权就很复杂。 MVG 通过让与项目相关的每个人都同意受与与项目无关的相同商标政策的约束来解决这些复杂问题。 MVG 默认商标政策基于示范商标指南。\n反垄断政策。该政策明确规定，使用 MVG 进行项目合作的参与者不会从事违反反垄断或竞争法的活动。这是良好的法律卫生，特别是如果有来自公司的维护者。行为守则。 MVG 默认为贡献者契约。这是 GitHub 开源社区使用最广泛的行为准则。项目标准。 MVG 适用于 GitHub 上的开源软件、开放标准、开放硬件和开放数据项目。默认情况下，MVG 包含一项策略，项目必须从有限的开源许可证列表中进行选择。对于开源项目，这些是 Open Source Initiative 的流行许可证列表，MVG 的模板项目许可证是 MIT——使用最广泛的开源许可证。 MVG 默认为标准的社区规范或开放 Web 基金会协议和开放知识基金会的数据推荐一致性许可列表。 MVG 的设计既简单又强大。一旦您查看并确保它适合您，请复制一份副本，填写空白，然后开始工作。 MVG 是开源的，遵循 CC-BY 许可，因此您可以修改文档以满足您的需要并重新共享它们。请记住，这些是合同，因此您应该确保它们适合您。 MVG 是一个入口匝道。如果您的项目取得成功并需要为聚会、会议演讲、托管费或其他任何事情存钱，则很容易将此结构转变为免费和开源软件基金会或其他公司形式。 MVG 仍处于测试阶段。我们需要您的反馈！有几个 alpha 版本正在使用中，但与所有事情一样，还有改进的余地。在我们发布 1.0 版本之前，我们将在接下来的几个月内在 MVG 存储库中接受任何人的反馈。最后，感谢许多 GitHub 团队成员以及在此 Beta 版发布之前审核并提供反馈的其他人，尤其是 Pam Chestek 和 Aaron Williamson。\n在 Twitter 上关注 GitHub 政策，了解有关影响开发人员的法律法规的更新。", "note_en": "In my role on the policy team, I hear a lot from developers that drafting project governance is a pain point. For that reason, we made  Minimum Viable Governance (MVG), a simple, easy-to-implement governance framework for your free and open source projects. It should work as-is for all projects—those among a few friends or a few mega-corporate rivals. It is open source, so you can modify it to fit your needs.\n  Things get complicated when you move from 1 maintainer to 1+N maintainers of your project. Suddenly, you need to figure out how you’ll make decisions, how you’ll add other maintainers, how you’ll divide work and agree on a vision, as well as who owns the trademark.\n There is often either too little or too much negotiation over these decisions. For volunteer-run projects, people often do nothing until there are problems, and those problems can strain or break the community. For projects with large corporate contributors, lawyers get involved and spend months negotiating heavyweight legal governance structures that slow down real work.\n  MVG is an agreement between maintainers that is signed and stored in the repository. MVG provides a two-tier structure for a set of open source projects. At the top level (called an “ organization” on GitHub), you choose a group of people to serve as the technical steering committee, making decisions about the overall direction and coordination between all of the organization’s projects. Underneath that top level are the individual projects, with lightweight, consensus-based governance among the maintainers.\n The agreement covers five things, with the defaults set out below. Since MVG is open source, you can of course modify the docs to suit your needs.\n Decision making. MVG defaults to a consensus-based decision making process at the organization level. Consensus does not mean no objection – it means loose agreement by the stakeholders based on their dominant view, and taking outstanding objections into consideration.  This is the approach that built the net. In our experience, striving for consensus reduces friction and reduces hostile project forks. At the organization/steering committee level, decisions that can’t be made by consensus fall back to majority vote. Individual repositories are consensus-only, so if a decision can’t be made by consensus, it’s appealed to the steering committee.\n Trademark policy. Neutral trademark ownership is a strong indicator of a truly open collaboration process. When projects have a non-profit corporate home, that corporate home owns the trademarks—like the project name and logo—so that they are managed for the benefit of the broader community. Without a corporate home, trademark ownership is complicated. MVG hacks these complications by having everyone associated with the project agree to be bound by the same trademark policy as those not associated with the project. The MVG default trademark policy is based on the  Model Trademark Guidelines.\n Antitrust policy. This policy makes clear that participants collaborating on projects using MVG will not engage in activities that would violate antitrust or competition laws. This is good legal hygiene, particularly if there are maintainers from corporations.\n Code of conduct. MVG defaults to the  Contributor Covenant. This is the code of conduct most widely used by GitHub’s open source communities.\n Project criteria. MVG is meant for open source software, open standards, open hardware, and open data projects on GitHub. By default, MVG includes a policy that projects must select from a limited list of open source licenses. For open source projects, these are Open Source Initiative’s  list of popular licenses, and MVG’s template project license is MIT—the most widely used open source license. MVG defaults to the  Community Specification or  Open Web Foundation Agreements for standards and the Open Knowledge Foundation’s list of  Recommended Conformant Licenses for data.\n  MVG is designed to be simple, yet robust. Once you review and make sure it’s right for you, fork a copy, fill in the blanks, and get to work. MVG is open source, under a  CC-BY license, so you can modify the docs to suit your needs and reshare them. Remember these are contracts, so you should make sure they’re right for you.\n MVG is meant to be an on-ramp. If your project takes off and needs to hold money for meetups, conference talks, hosting fees, or anything else, it’s easy to take this structure to a  free and open source software foundation or other corporate form.\n  MVG is still in beta. We want your feedback! There are a  few  alpha  versions in use, but like all things, there is room for improvement. We’ll be accepting feedback from anyone over the next few months  in the MVG repo before we release a 1.0 version.\n  Finally, thanks to the many GitHub teammates and other folks who reviewed and provided feedback prior to this beta release, particularly  Pam Chestek and  Aaron Williamson.\n  Follow  GitHub Policy on Twitter for updates about the laws and regulations that impact developers.", "posttime": "2021-07-24 08:51:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可行,viable,项目", "title": "最小可行治理", "title_en": "Minimum Viable Governance", "transed": 1, "url": "https://github.blog/2021-07-22-minimum-viable-governance-lightweight-community-structure-foss-projects/", "via": "", "real_tags": ["可行", "viable", "项目"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到您请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2021-07-24 08:51:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "天然气,gas,请求", "title": "石油和天然气公司将阻止世界升温 1.5°C", "title_en": "Oil and gas companies will prevent world from hitting 1.5°C", "transed": 1, "url": "https://energydigital.com/oil-and-gas/oil-and-gas-companies-will-prevent-world-hitting-15degc", "via": "", "real_tags": ["天然气", "gas", "请求"]}, {"category": "", "categoryclass": "", "imagename": "e6b1e5ad9d04cf93139808fed64a98ff.jpg", "infoid": 1069377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嘘……你找到了。这是疯狂科学、黑客和实验的 JavaScript 聚会。每周太平洋时间周五下午 4 点虚拟出去玩......", "note_en": "Psst... You've found it. This is the JavaScript meetup for mad science, hacking, and experiments. Hang out virtually on Friday at 4pm Pacific Time each week....", "posttime": "2021-07-24 08:46:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "web,portable,周五", "title": "Redbean：便携式可执行 Web 服务器 (Justine Tunney) [视频]", "title_en": "Redbean: Portable Executable Web Server (Justine Tunney) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=1ZTRb-2DZGs&list=PL1y1iaEtjSYitzKXzrE8wcQvEsw9dImn0&index=35", "via": "", "real_tags": ["web", "portable", "周五"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069376, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "-----BEGIN PGP SIGNED MESSAGE-----Hash: SHA256 大家好，发布日期============我们计划在2021-08-14发布。如果你想庆祝它（以及您周围的条件允许），请考虑参加 Debian 发布派对，或举办您自己的派对！有关更多信息，请参阅 https://wiki.debian.org/ReleasePartyBullseye。发布前的最后几周============================ ======在冻结前的最后一周，测试将被完全冻结，在此期间只会考虑紧急错误修复。请考虑 UTC 时间 2021-08-03 星期二 12:00 提交解锁的绝对最后时刻对 Bullseye 的请求。当时尚未准备好迁移到测试的更改将不会包含在初始版本的 Bullseye 中。但是，如果变更集遵循 stable 中的更新规则，您仍然可以通过点发布修复 Bullseye 中的错误。从现在开始，我们将在考虑取消阻止请求时更加严格。请检查下面的详细信息并确保仅上传经过良好测试的*有针对性的*修复。总结：vvvvvvvvvvvvvvvvvvvv * **取消阻止请求** 截止日期：&gt; 2021-08-03 12:00 UTC &lt; ^^^^^^^^ ^^^^^^^^^^^^ - 你必须在*之前*提交你的解锁请求 - 你的更改必须在那个时候准备好迁移到牛眼 - 在截止日期*之前*几天上传 * 如果更改是晚了，它可能仍然适用于在 Bullseye 发布后通过点发布进行的更新。 * 请注意，自动删除仍然有效，并且可能仍会删除该日期之前的软件包。此外，某些软件包将在自动删除截止日期之前手动删除。请在今天而不是在截止日期前不久修复错误。简单的错误（无论如何都是微不足道的）或繁忙的构建队列最终会导致您的上传错过靶心发布。靶心的未来更新直到冻结=-=-=-=-=-=-=-=-=-=- =-=-=-=-=-=-=-=-=-=-=-=当我们进入冻结的最后部分时，请将未来更改和取消阻止请求限制为： * 针对发布关键错误的针对性修复（即，严重性严重、严重和严重的错误）； * 修复严重性：重要的错误，只有当这可以通过不稳定来完成时； * 翻译更新和文档修复，只有当这可以通过不稳定来完成时（最好与上面列出的至少一个问题的修复捆绑在一起，没有别的） * 更新与发布过程直接相关的包（即引用档案的当前布局），只有当这可以通过不稳定来完成时；我们只接受有针对性的修复。不接受包括其他更改在内的请求。请不要上传新的上游版本tounstable.For发布团队，保罗----- BEGIN PGP签名----- iQEzBAEBCAAdFiEEWLZtSHNr6TsFLeZynFyZ6wW9dQoFAmD7HuUACgkQnFyZ6wW9dQqAFwf / Tv9mne / jKwgXrMAYe8wgH5ggfh / p3nvTfeD3Nx9sqN5D3RtmKQCLPKRb0LsguOQGARVH7U7FVKyQDn810Ussh8lU40sxetmcSncXFG9YcT3Oe3YrWk4RDoWUhS + KrFNkjXA9cB4tY / jr9lnhyrCe + X + rNVLfg2q20BJaOyAyyNosv + GRH / mafAVS6BFYC + 9wmNcr5O7 / DJChl7RmUnHxiluKWVGdDssixnxNH5OGmp62JEwQnwkwkzAtdNS9iabGXi8In2EIEk1Bmn8U1QgWx87MbaiBTK/kxCmhgPyRJI8Nf5PmZtsCJQTYCO3QOYS-A-PmZtsCJQTYCO3VZ-G-----jMVYZ-G----vqyqyztg----vgp", "note_en": "-----BEGIN PGP SIGNED MESSAGE-----Hash: SHA256Hi all,Release date============We plan to release on 2021-08-14.If you want to celebrate it (and the conditions around you allow forit), please consider attending a Debian release party, or hosting yourown! See  https://wiki.debian.org/ReleasePartyBullseye for moreinformation.The final weeks up to the release=================================In the last week prior to the freeze, testing will be completelyfrozen and only emergency bug fixes will be considered in this period.Please consider Tuesday the 2021-08-03 at 12:00 UTC the absolute lastmoment for submitting unblock requests for bullseye.Changes that are not ready to migrate to testing at that time willnot be included in bullseye for the initial release. However, you canstill fix bugs in bullseye via point releases if the changeset followsthe rules for updates in stable.Starting now, we will be even more strict when considering unblockrequests. Please check the details below and make sure to only uploadwell-tested *targeted* fixes.In summary: vvvvvvvvvvvvvvvvvvvv * **Unblock request** deadline: &gt; 2021-08-03 12:00 UTC &lt; ^^^^^^^^^^^^^^^^^^^^ - You must submit your unblock request *before* then - Your changes must be ready to migrate to bullseye at that time - Upload several days *before* the deadline * If a change is late, it may still be applicable for an update via a point release after bullseye has been released. * Please note that the automatic removals are still in effect and may still remove packages up to that date. Also, some packages will be removed manually before the auto-removal deadline.Please fix bugs today rather than shortly before the deadline. Simplemistakes (no manner how trivial) or busy buildd queue can end upcausing your upload to miss the bullseye release.Future updates to bullseye up to the freeze=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=As we are entering the final part of the freeze, please keep futurechanges and unblock requests limited to: * targeted fixes for release critical bugs (i.e., bugs of severity critical, grave, and serious); * fixes for severity: important bugs, only when this can be done via unstable; * translation updates and documentation fixes, only when this can be done via unstable (preferably bundled with a fix for at least one of the problems listed above and nothing else) * updates to packages directly related to the release process (i.e. with references to the current layout of the archive), only when this can be done via unstable;We will only accept targeted fixes. Requests including other changeswill not be accepted. Please do not upload new upstream versions tounstable.For the release team,Paul-----BEGIN PGP SIGNATURE-----iQEzBAEBCAAdFiEEWLZtSHNr6TsFLeZynFyZ6wW9dQoFAmD7HuUACgkQnFyZ6wW9dQqAFwf/Tv9mne/jKwgXrMAYe8wgH5ggfh/p3nvTfeD3Nx9sqN5D3RtmKQCLPKRb0LsguOQGARVH7U7FVKyQDn810Ussh8lU40sxetmcSncXFG9YcT3Oe3YrWk4RDoWUhS+KrFNkjXA9cB4tY/jr9lnhyrCe+X+rNVLfg2q20BJaOyAyyNosv+GrH/mafAVS6BFYC+9wmNcr5O7/DJChl7RmUnHxiluKWVGdDssixnxNH5OGmp62JEwQnwkwkzAtdNS9iabGXi8In2EIEk1Bmn8U1QgWx87MbaiBTK/kxCmhgPyRJI8Nf5PmZtsCJQTYCO3NiSxv7dMVY0G+jOZBiilCZ1zg/A===qQtT-----END PGP SIGNATURE-----", "posttime": "2021-07-24 08:46:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,bullseye", "title": "Debian Bullseye 计划于 2021-08-14 发布", "title_en": "Debian Bullseye release planned on 2021-08-14", "transed": 1, "url": "https://lists.debian.org/debian-devel-announce/2021/07/msg00003.html", "via": "", "real_tags": ["发布", "bullseye"]}, {"category": "", "categoryclass": "", "imagename": "81717ba952f9a962c02a1d9e05ffc553.jpg", "infoid": 1069375, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Vernal 在本月早些时候参加了 TechCrunch 早期阶段：营销和筹款活动，讨论创始人应该如何考虑产品与市场的契合度，特别关注节奏。他介绍了如何围绕迭代速度进行组织、如何在设计时考虑到客户反馈循环以及红杉资本如何根据节奏评估公司。这不仅仅是为了快速（这通常会导致一些鲁莽）。这是关于设定速度并保持与该速度一致。天使可以给予创始团队最好的赞美之一，并包括在我们的介绍中，“他们真的很快”或“她是一台机器”。那是什么意思？这并不意味着在那种不受控制、鲁莽、崩溃的意义上快速。这意味着以一种一致的、疯狂的、每天都变得更好的方式快速。这实际上是我们最看重的事情之一，至少在评估团队时是这样：他们移动的速度有多快。 （时间戳：2:26）Vernal 继续说，节奏与目标和目标以及关键结果 (OKR) 直接相关。在这些 OKR 中建立反馈循环并确定攻击它们的节奏至关重要，尤其是在寻找产品市场契合度的过程中。寻找产品与市场的契合点不是一个确定性的过程。大多数时候，它需要迭代。它需要不断的适应。我的心理模型是，它实际上只是一个回合制游戏，步骤数未知，有时在您完成游戏之前，时钟或金钱或两者都用完了。这有点像一盘棋。那么你的最佳策略是什么？ （时间戳：4:25）正如 Vernal 所解释的那样，找到产品与市场的契合度完全取决于反馈，而这必须是流程中一个持续的、内置的部分。他概述了创始人如何考虑到这一点进行设计。", "note_en": "Vernal joined us at TechCrunch Early Stage: Marketing and Fundraising earlier this month to discuss how founders should think about product-market fit, with a specific focus on tempo. He covered how to organize around the pace of iteration, how to design with customer feedback loops in mind and how Sequoia evaluates companies with regard to tempo.\n    It’s not just about going fast (which can often lead to some recklessness). It’s about setting a pace and staying consistent with that pace.\n One of the very best compliments an angel can bestow on a founding team and include in an introduction to us is, “They’re just really fast,” or “She’s a machine.” What does that mean? It doesn’t mean fast in the kind of uncontrolled, reckless, crashing sense. It means fast in a sort of consistent, maniacal, get-a-little-bit-better-each-day kind of way. And it’s actually one of the top things that we look for, at least when evaluating a team: how consistently fast they move.   (Timestamp: 2:26)\n Vernal went on to say that tempo is directly correlated to goals and objectives and key results (OKRs). Building a feedback loop into those OKRs and determining the tempo with which to attack them is critical, especially during the process of finding product-market fit.\n Finding product-market fit is not a deterministic process. Most of the time, it requires iteration. It requires constant adaptation. My mental model is that it’s actually just a turn-based game with an unknown number of steps, and sometimes either the clock or the money or both run out before you get to finish the game. It’s kind of like a game of chess. So what is your optimal strategy?   (Timestamp: 4:25)\n  As Vernal explained, finding product-market fit is all about feedback, and that must be an ongoing, built-in part of the process. He outlined how founders can go about designing with that in mind.", "posttime": "2021-07-24 08:12:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,资本,market,节奏", "title": "红杉资本的 Mike Vernal 概述了如何设计反馈回路以寻找产品与市场的契合度", "title_en": "\n\t\t\t\tSequoia’s Mike Vernal outlines how to design feedback loops in the search for product-market fit\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/23/sequoias-mike-vernal-outlines-how-to-design-feedback-loops-in-the-search-for-product-market-fit/", "via": "", "real_tags": ["设计", "资本", "market", "节奏"]}, {"category": "", "categoryclass": "", "imagename": "f020a06936f6fe91ef3703317e545ba6.jpg", "infoid": 1069374, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook 宣布了一个新的 API，可以让开发人员将来自 Quest 2 传感器的视频整合到他们的游戏和应用程序中，从而创造一种混合现实体验。借助 Passthrough API，开发人员不仅能够将头显传感器的黑白​​图像混合到他们的体验中，而且还能够自定义它最终对玩家的看法、应用效果和甚至让真实世界出现在特定的表面上。 Facebook 的公告包括 API 如何通过允许集成现实键盘和办公桌来提高软件生产力的示例，以及游戏如何包含您的真实家具以供敌人躲在后面。也很容易想象将您的真实环境与虚拟世界混合在一起的其他有趣体验 - 您在自己的房子里解决门户式的谜题，或者能够看到您的墙壁被虚拟油漆覆盖？当被问及与第一代 Quest 的兼容性时，Facebook 告诉 UploadVR，该 API 目前仅适用于 Quest 2。在公告中，Facebook 表示 API 的图像处理是在设备上完成的，使用它的应用程序将无法查看或存储来自 Quest 2 传感器的图像。 Facebook 正在将 API 的实验版本添加到其即将推出的开发人员工具中，它将首先提供给使用 Unity 构建软件的程序员。 Facebook 承诺该 API 将在未来获得对其他开发平台的支持。 Quest、Quest 2 和 Rift S 耳机已经有一个 Passthrough 技术版本，可以让用户快速了解现实世界中发生的事情。 Facebook 还允许你将 Passthrough 设置为你的虚拟环境，为你提供一个真实环境的版本（尽管是黑白的），你可以在其中导航 Oculus UI。它甚至在关于其无限办公室功能的视频中展示了这种能力。长期以来，将您的真实环境集成到虚拟世界的能力一直是带有集成摄像头的耳机的更令人兴奋的承诺之一。微软甚至在将其 VR 平台命名为 Windows Mixed Reality 时引用了这个想法（无论实际交付了多少）。然而，Oculus 的 API 的消息并不意味着您今天就可以拿起耳机并拥有混合现实体验。 Facebook 在其公告中表示，它希望让开发人员在“今年晚些时候”向玩家提供使用 Passthrough 的软件。尽管如此，这个 API 对开发人员的可用性还是令人兴奋的，因为它应该允许在 Oculus 平台上获得新的体验类型。", "note_en": "Facebook announced a new API that will let developers incorporate video from the Quest 2’s sensors into their games and applications, creating a mixed reality experience. With the Passthrough API, developers will not only be able to mix the black-and-white images from the headset’s sensors into their experiences, but they’ll also be able to customize how it ends up looking to the player, apply effects, and even have the real world show up on specific surfaces.\n Facebook’s announcement includes examples of how the API could improve productivity software by allowing integration of real-life keyboards and desks, and how games could include your real-life furniture for enemies to hide behind. It’s also easy to imagine other fun experiences that mix your real environment with a virtual world — how about Portal-esque puzzles that you solve in your own house, or the ability to see your walls covered in virtual paint?\n   Facebook told  UploadVR that the API was currently only for the Quest 2 when asked about compatibility with the first-generation Quest. In the announcement post, Facebook says the image processing for the API is done on-device and that applications using it won’t be able to see or store the images from the Quest 2’s sensors.\n Facebook is adding the experimental version of the API to its upcoming developer tools, and it’ll be available first to programmers using Unity to build their software. Facebook does promise that the API will be getting support for other development platforms in the future.\n  The Quest, Quest 2, and Rift S headsets  already have a version of the Passthrough technology, which lets users get a quick look at what’s happening around them in the real world. Facebook also lets you  set Passthrough as your virtual environment, giving you a version of your real environment (albeit in black and white) that you can navigate the Oculus UI in. It even  showed off that ability in a video about  its Infinite Office feature.\n  The ability to integrate your real environment into a virtual world has long been one of the more exciting promises of headsets with integrated cameras. Microsoft even invoked the idea when it named its VR platform Windows Mixed Reality (regardless of how much that’s actually been delivered on).\n The news of Oculus’ API doesn’t mean that you’ll be able to pick up your headset and have a mixed reality experience today, however.  In its announcement, Facebook says it’s looking to let developers ship software using Passthrough to players “later this year.” Still, this API’s availability to developers is exciting, as it should allow for new types of experiences on the Oculus platform.", "posttime": "2021-07-24 08:09:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,facebook,开发,宣布,reality", "title": "Facebook 宣布 Passthrough API，它允许 Oculus Quest 2 开发人员使用通过传感器收集的真实世界图像来创建混合现实应用程序", "title_en": "Facebook announces the Passthrough API, which allows Oculus Quest 2 developers to use real-world images collected via sensors to create mixed reality apps", "transed": 1, "url": "https://www.theverge.com/2021/7/23/22590794/oculus-mixed-reality-api-quest-2-development-kit-unity?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["程序", "facebook", "开发", "宣布", "reality"]}, {"category": "", "categoryclass": "", "imagename": "bd68e91c57248cea0f5df69174baff05.jpg", "infoid": 1069373, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "刚从我们与战锤纪念者丹·阿布内特 (Dan Abnett) 就战锤宇宙未解之谜的谈话中，我们现在将注意力转向了科幻小说中的一个不那么阴暗的属性：一个具有超凡记忆力的博学者发明了时间旅行，事情发生了，正如他们所说，有点卡卡。抓住你的手链，走进成像室，因为现在是谈论 Quantum Leap 的时候了。我们有幸与传奇电视制作人 Donald P. Bellisario 共度时光，他的名字为 80 年代和 90 年代一些最有影响力和最受欢迎的电视节目的片尾曲增光添彩——包括 Airwolf、Magnum、PI 和当然是量子跃迁。尽管他现在已经退休了，但贝利萨里奥还是勇敢地同意允许 Ars 的电影摄制组——带着道具！——进入他位于加利福尼亚的家，偶尔向他提出一些晦涩的问题，关于什么是有史以来最好的电视节目时间旅行节目。如果没有其他原因，除了量子飞跃是一个特别节目，这是一个特殊的情节。今天，它感觉像是另一个时代的遗物——在这个时代，故事连载是例外而不是规则，每季 22 集代表了预期的最低限度，而且商业广告的频率较低。 （Quantum Leap 的第一季剧集大约有 48 分钟——这比今天网络电视上大多数长达一小时的电视剧长约 6 分钟！）Quantum Leap 的 97 集最初于 1989 年至 1993 年播出，该节目是我的初中和高中早期经历的很大一部分——尽管我最想看到的节目部分是对“未来”的那些罕见的一瞥，但该节目很少瞥见 1999 年正在进行的“量子飞跃计划”。它是一个多么美好的未来——霓虹灯和闪烁的灯光，蓝色的炫酷闪电在彩色塑料上划过，90 年代复古未来时尚感横行，所有这些都由一个名为 Ziggy 的智能且有点狡猾的人工智能监督。本周的时间旅行故事很酷，但关于量子飞跃计划的总体叙述真正让我着迷——山姆会回家吗？虽然多年来一直有关于 Quantum Leap 重启的谣言，但我想稍微降低一些期望：Don 有很多整洁的东西要告诉我们，但在这次采访中你不会发现的一件事是关于是否或不是 Quantum Leap 会回来。 Don 坚信 Sam 仍然在那里跳跃——而 Sam 不知何故做出了继续这样做的有意识的选择。正如唐所说，这是山姆毕生的事业。所以系列结局令人心碎的结局仍然存在：山姆贝克特再也没有回到他 1999 年复古霓虹灯的家，他仍然在某个地方，与艾尔一起工作，努力纠正曾经的错误。我希望我们能和唐一起至少再拍一集“未解之谜”——Airwolf，有人吗？敬请关注！滑出长时间潜伏者模式进行评论。感谢您接受李先生的采访！我本可以听 Don 讲几个小时。希望你的采访有助于向这个节目介绍新的观众——对我来说是很棒的故事和回忆。\n唐非常友善，而且非常乐于助人。我们在他家拍了这个，摄制组拿着我们建造的这个巨大的 Ziggy 桌子在那里卷起来（有时候有预算真是太好了！），他没有告诉我们 GTFO，而是说我们可以在任何我们想要的地方设置。我们解决了连接问题（制作人和我都在 Zoom 上拨入了电话，所以当唐朝左看时，他看着我，亚当在 iPad 上问他问题）和 COVID 预防措施，最终结果是伟大的。他是一项很好的运动。我非常希望我们也能回来谈谈 Airwolf！", "note_en": "Fresh from our talk with Warhammer remembrancer Dan Abnett on the  unsolved mysteries of the Warhammer universe, we now turn our attention to a science fiction property with a bit less grimdark: the one where a polymath with an eidetic memory invents time travel and things go, as they say,  a little kaka. Grab your handlinks and step into the imaging chamber because it&#39;s time to talk about  Quantum Leap. We were lucky enough to snag some time with legendary TV producer  Donald P. Bellisario, whose name has graced the closing credits of some of the most influential and popular TV shows of the &#39;80s and &#39;90s—including   Airwolf,  Magnum, P.I., and of course  Quantum Leap. Though he&#39;s now retired, Bellisario gamely agreed to allow an Ars film crew—with props!—into his California home to badger him with occasionally obscure questions about what is easily the best time-travel show ever to grace television.\n This was a special episode to film, if for no other reason than that  Quantum Leap was a special show. Today it feels like a relic from another age—an age in which story serialization was the exception rather than the rule, where twenty-two episodes per season represented the expected minimum, and where commercial breaks were a bit less frequent. (The first-season episodes of  Quantum Leap clock in at almost  forty-eight minutes—that&#39;s about six minutes longer than most hour-long dramas on network TV today!)  Quantum Leap&#39;s 97 episodes originally aired from 1989 to 1993, and the show was a huge part of my junior high and early high school experience—though the parts of the show I wanted to see most were those rare glimpses into &#34;the future,&#34; the show&#39;s infrequently glimpsed vision of 1999 where Project Quantum Leap was taking place.\n    And what a future it was—a future of neon and blinking lights, of cool blue lightning arcing across colored plastic, of &#39;90s retro-future fashion sense run amok, all overseen by an intelligent and somewhat snippy artificial intelligence named Ziggy. The time travel stories of the week were cool, but the overarching narrative about Project Quantum Leap is what really hooked me—would Sam ever return home?\n Though there have been rumors floating around for years about a   Quantum Leap reboot, I want to temper expectations a bit: Don had a lot of neat stuff to tell us, but one thing you will not find in this interview is any discussion of whether or not  Quantum Leap will be coming back. It is Don&#39;s firm belief that Sam is still out there leaping—and Sam has somehow made the conscious choice to continue doing it. It is, as Don puts it, Sam&#39;s life&#39;s work.\n So the heartbreaking ending of the series finale still stands: Sam Beckett never makes it back to his retro-neon 1999 home, and he&#39;s still out there somewhere, working with Al, striving to put right what once went wrong.\n I&#39;m hopeful that we&#39;ll be able to do at least one more episode of &#34;Unsolved Mysteries&#34; with Don— Airwolf, anyone? Stay tuned!\n  Slipping out of long time lurker mode to comment. Thank you for this interview Lee! I could have listened to Don talk for hours. Hopefully your interview helps to introduce a new audience to the show -- great stories and memories for me.\n Don was so nice—and  super accommodating. We shot this at his house, and the film crew rolled up there with this giant Ziggy table that we built (it&#39;s nice having a budget sometimes!), and rather than telling us to GTFO, he said we could set up anywhere we wanted. We fought through connection issues (the producer and I were both dialed in on Zoom, so when Don is looking down and to his left, he&#39;s looking at me and Adam asking him questions on an iPad) and COVID precautions, and the end result was great. He was such a good sport.  I am super hopeful we&#39;ll get to come back and talk Airwolf, too!", "posttime": "2021-07-24 07:31:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "之谜,mysteries,节目", "title": "未解之谜：量子飞跃的唐·贝利萨里奥讲述山姆·贝克特的命运", "title_en": "Unsolved Mysteries: Quantum Leap’s Don Bellisario on the fate of Sam Beckett", "transed": 1, "url": "https://arstechnica.com/gaming/2021/05/don-bellisario-talks-to-ars-about-the-unsolved-mysteries-of-quantum-leap/", "via": "", "real_tags": ["之谜", "mysteries", "节目"]}, {"category": "", "categoryclass": "", "imagename": "3ea042a81f81d502ea7094fff483ddcb.jpg", "infoid": 1069371, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，其间谍软件工具已被用于针对记者和活动家的 NSO Group 的首席执行官表示，不是罪犯的人不应该害怕被监视。 39 岁的 Shalev Hulio 最近接受了《福布斯》采访，此前调查表明，专制政府使用 NSO 集团的 Pegasus 间谍软件来入侵和监视世界领导人、知名记者和活动家的移动设备。 NSO Group 表示，它向政府出售其工具，以帮助他们抓捕恐怖分子或歹徒等严重犯罪分子。然而，Hulio 承认它无法控制政府最终使用这些工具做什么。 “我们正在向政府出售我们的产品。我们无法监控这些政府的所作所为，”他说。 Hulio 确实指出，NSO Group 有适当的机制来检测滥用发生的时间，以便公司可以“关闭它们”。他表示，NSO 集团“以前做过并将继续这样做。另一方面，他表示 NSO 集团不应对政府滥用负责。此外，Hulio 表示，普通智能手机没有什么可担心的。”虽然 NSO 集团的间谍软件可以侵入运行最新软件的最新 iPhone，通常不需要用户采取任何行动，但它只针对罪犯。“不是罪犯的人，不是世界上的本拉登——什么都没有怕。他们可以绝对信任他们的 Google 和 Apple 设备的安全性和隐私性，”Hulio 说。在 17 家媒体机构进行为期一个月的调查后，有关 NSO Group 的 Pegasus 间谍软件被滥用的报道于 7 月初首次浮出水面。间谍软件包括法国总统埃马纽埃尔·马克龙，他已对此案展开调查。\n在调查追踪到的某些案例中，Pegasus 被用来秘密监视批评政府的活动人士和记者。例如，印度和墨西哥政府因涉嫌使用 Pegasus 监视反对派政客、活动家和记者而陷入困境。 Hulio 将 NSO 集团比作汽车制造商。如果酒后司机撞人，那是他们的错，而不是汽车制造商的错。 Hulio 还声称，NSO 的工具已被用于阻止超过 15 起恐怖袭击并逮捕了数百名危险罪犯。不过，由于他不能说具体，他也没有提供任何细节或证据。这不是 NSO Group 工具第一次被指控滥用。 2020 年，有报道称 Pegasus 已被用来监视为半岛电视台工作的 37 名记者。如果攻击者成功地用 Pegasus 软件感染了设备，他们就可以从中提取几乎任何他们想要的数据。据报道，政府利用苹果 iMessage 和 Apple Music 中的零日漏洞来感染设备。苹果公司谴责了这些袭击，称其将继续“不知疲倦地工作以保护我们所有的客户”。 AppleInsider 拥有附属合作伙伴关系，并且可以通过附属链接购买的产品赚取佣金。这些合作伙伴关系不会影响我们的编辑内容。", "note_en": "The CEO of NSO Group, whose spyware tools have reportedly been used to target journalists and activists, says that people who aren&#39;t criminals shouldn&#39;t be afraid of being surveilled.\n  Shalev Hulio, 39, recently  spoke to  Forbes after investigations indicated that NSO Group&#39;s Pegasus spyware was used by authoritarian governments to hack and surveil the mobile devices of world leaders, high-profile journalists, and activists.\n NSO Group says that it sells its tools to governments to help them catch serious criminals like terrorists or gangsters. However, Hulio admitted that it can&#39;t control what governments ultimately do with the tools. &#34;We are selling our products to governments. We have no way to monitor what those governments do,&#34; he said.\n  Hulio did note that NSO Group has mechanisms in place to detect when abuse happens so that the company can &#34;shut them down.&#34; He says that NSO Group has &#34;done it before and will continue to do so. On the other hand, he said that NSO Group shouldn&#39;t be responsible for government misuse.\n Additionally, Hulio said that the average smartphone has nothing to worry about. While NSO Group&#39;s spyware can break into the latest  iPhones running up-to-date software, often without any action from the user, it&#39;s only aimed at criminals.\n &#34;The people that are not criminals, not the Bin Ladens of the world— there&#39;s nothing to be afraid of. They can absolutely trust on the security and privacy of their Google and Apple devices,&#34; Hulio said.\n Reports that NSO Group&#39;s Pegasus spyware was being misused  first surfaced earlier in July after a monthlong investigation by 17 media organizations. Some of the alleged targets of the spyware include French President Emmanuel Macron, who has opened an investigation into the case.\n In some cases tracked by the investigation, Pegasus was used to covertly surveil activists and journalists critical of governments. The governments of India and Mexico, for example, in hot water for allegedly using Pegasus to surveil opposition politicians, activists, and reporters.\n Hulio likened NSO Group to an automaker. If a drunk driver hits someone, it&#39;s their fault and not the car manufacturer&#39;s. Hulio also claimed that NSO&#39;s tools have been used to stop more than 15 terrorist attacks and arrest hundreds of dangerous criminals. However, since he couldn&#39;t talk specifics, he didn&#39;t offer any detail or proof.\n This is not the first time that a NSO Group tool has been allegedly abused. In 2020, reports suggested that Pegasus had been used to spy on  37 journalists working for  Al Jazeera.\n If an attacker successfully infects a device with the Pegasus software, it would allow them to extract virtually any data they wanted from it. Governments reportedly used zero-day vulnerabilities in Apple&#39;s  iMessage and Apple Music to infect devices.\n Apple has  condemned the attacks, stating that it continues to &#34;work tirelessly to defend all our customers.&#34;\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2021-07-24 07:26:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "集团,group,政府", "title": "NSO 集团 CEO 称守法公民“无所畏惧”", "title_en": "NSO Group CEO Says Law-Abiding Citizens Have 'Nothing To Be Afraid Of'", "transed": 1, "url": "https://appleinsider.com/articles/21/07/23/nso-group-ceo-says-law-abiding-citizens-have-nothing-to-be-afraid-of", "via": "", "real_tags": ["集团", "group", "政府"]}, {"category": "", "categoryclass": "", "imagename": "f9fde2252faa627afbc8b5cab05130ae.jpeg", "infoid": 1069370, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家在线购物巨头正在推动全国各地的房东——有时会提供经济激励——让司机能够用移动设备自己解锁公寓楼的门。这项被称为“商业之钥”的服务旨在减少被盗包裹，让他们可以轻松地将包裹留在大厅而不是外面。亚马逊受益，因为它使送货工人能够更快地完成任务。更少的被盗包裹降低了成本，并可能使亚马逊比竞争对手更具优势。那些安装了该设备的人表示，它减少了送货人员不断的嗡嗡声，并且是向数十名送货人员发送代码的更安全替代方案。但亚马逊计划于 2018 年首次宣布，随着它获得牵引力，可能会引发安全和隐私问题。该公司表示，它会对送货人员进行背景调查，他们只有在手头有包裹要扫描时才能开门。但是租户可能不知道亚马逊司机可以进入他们大楼的前门，因为亚马逊让大楼通知他们。阿什坎·索尔塔尼 (Ashkan Soltani) 是前总统巴拉克·奥巴马 (Barack Obama) 的高级技术顾问，他是一位隐私研究员，他表示，任何连接到互联网的设备都可能被黑客入侵，包括亚马逊的设备，坏人可能会试图打开大门。 “你本质上是将一个外国互联网连接设备引入一个内部网络，”Soltani 说，他也是美国联邦贸易委员会的前首席技术专家。该公司已经在数以千计的美国公寓大楼中安装了该设备，但拒绝透露具体数字。它有时会留下线索，在安装了设备的蜂鸣器上贴上带有亚马逊微笑标志的圆形贴纸。在纽约市的一条街道上，贴纸贴在 11 座建筑物中的三座上。在另一个街区，七座建筑物中有两座贴有贴纸。\n亚马逊销售人员一直分散到全国各地的城市敲门、打电话或在街上接近建筑经理，敦促他们安装该设备。该公司甚至与当地锁匠合作，在他们修锁时将其推给建筑经理。亚马逊免费安装该设备，有时会向任何让他们进入的人赠送价值 100 美元的亚马逊礼品卡。 Soltani 说，他在 4 月份与两名亚马逊销售人员联系时了解到了 Key for Business，他们想进入他住在奥克兰的大楼，加利福尼亚。楼宇管理拒绝了，也没有安装任何设备。亚马逊与肯顿吉拉德的运气更好。作为芝加哥的房东，吉拉德同意在他的四栋建筑物中安装该设备，以减少包裹盗窃的情况，这种情况越来越严重，以至于他正在考虑在外面建造一个包裹投递箱。吉拉德谈到亚马逊设备时说：“我会付钱去做的。”目前，只有美国邮政局有办法进入公寓大楼以获取邮箱。 UPS 表示，它已在 2018 年与一家智能锁公司合作，测试了一种让员工在不打扰租户的情况下进入建筑物的方法。但该测试结束了，UPS 拒绝说明原因。该公司表示，如果客户不在家，他们可以将包裹送到附近的杂货店、干洗店或花店。多年来，亚马逊一直想走进人们的前门。 2017 年，它为购物者推出了一种方式，让送货人员在他们不在的时候进到他们的家中，并将包裹留在门厅。沃尔玛不久之后也做了同样的事情，但它的送货员也在冰箱里放了杂货。亚马逊和沃尔玛没有说明有多少人在使用这些服务，但最近都将其扩展到更多城市。 2018 年，亚马逊将目光投向了公寓楼，推出了 Key for Business 并签约大房东在他们的开发项目中安装该设备。但随着亚马逊在全国范围内部署销售人员，这一推动似乎在过去一年左右加速了。最近在迈阿密和圣安东尼奥发布的招聘信息称，亚马逊销售人员每月可以赚取 3,000 至 11,000 美元的奖金和佣金。亚马逊不会说它在这项工作上花费了多少。\n并非所有亚马逊包裹都可以通过前门。据购物数据公司乐天情报公司称，该公司大约 60% 的包裹是自己配送的；其余的来自其他无法让自己进入的快递公司。马里兰大学罗伯特·H·史密斯商学院的物流教授菲利普·T·埃弗斯（Philip T. Evers）表示，亚马逊希望将设备放入尽可能多的建筑物中一种将竞争对手拒之门外的方法。 “房东可能会说，&#39;你知道，我会为一家公司做这件事，但也许我们不希望那里的每一家快递公司都这样做，&#39;”他说。他补充说，亚马逊可以为这项服务找到其他用途，比如让送货员在大厅里取回退货，而不是让购物者去邮局。亚马逊拒绝透露任何未来计划。营销公司 Publicis Communications 的首席商务战略官 Jason Goldberg 表示，该设备可以为亚马逊节省资金，因为员工可以在轮班期间投递更多包裹，并且可能不得不向包裹被盗者提供更少的退款。他在 12 月听说了这个计划，当时一位锁匠在他的芝加哥公寓大楼更换蜂鸣器系统，提出免费安装 Amazon Key for Business。帮助管理大楼的戈德伯格后来允许亚马逊销售人员——挂着一张价值 100 美元的亚马逊礼品卡——安装该设备。 “他们免费赠送它，因为它比我们对亚马逊更有利，”戈德伯格说。", "note_en": "The online shopping giant is pushing landlords around the country — sometimes with financial incentives — to give its drivers the ability to unlock apartment-building doors themselves with a mobile device.\n The service, dubbed Key for Business, is pitched as a way to cut down on stolen packages by making it easy to leave them in lobbies and not outside. Amazon benefits because it enables delivery workers to make their rounds faster. And fewer stolen packages reduce costs and could give Amazon an edge over competitors.\n Those who have installed the device say it reduces the constant buzzing by delivery people and is a safer alternative to giving out codes to scores of delivery people.\n But the Amazon program, first announced in 2018, may stir security and privacy concerns as it gains traction. The company said that it does background checks on delivery people and that they can unlock doors only when they have a package in hand to scan. But tenants may not know that Amazon drivers have access to their building’s front doors, since Amazon leaves it up to the building to notify them.\n  Ashkan Soltani, a privacy researcher who was a senior tech advisor to former President Barack Obama, said that any device connected to the internet could be hacked, including the Amazon one, and bad actors could try to unlock the doors.\n “You’re essentially introducing a foreign internet-connected device into an otherwise internal network,” said Soltani, who was also a former chief technologist at the U.S. Federal Trade Commission.\n  The company has already installed the device in thousands of U.S. apartment buildings but declined to give a specific number. It sometimes leaves a clue, placing a round sticker with the Amazon smile logo on buzzers where the device has been installed. On one New York City street, the sticker was on three of 11 buildings. In another neighborhood, two of seven buildings had the sticker.\n Amazon salespeople have been fanning out to cities across the country to knock on doors, make cold calls or approach building managers on the street to urge them to install the device. The company has even partnered with local locksmiths to push it on building managers while they fix locks. Amazon installs the device for free and sometimes throws in a $100 Amazon gift card to whoever lets them in.\n Soltani said he learned about Key for Business when he was approached by two Amazon salespeople in April who wanted access to the building where he lives in Oakland, California. Building management declined, and no device was installed.\n Amazon had better luck with Kenton Girard. A Chicago landlord, Girard agreed to have the device installed in four of his buildings as a way to reduce package theft, which was getting so bad that he was considering building a package drop box outside.\n  “I would have paid to have it done,” Girard said of the Amazon device.\n Currently, only the U.S. Postal Service has a way to enter apartment buildings in order to get to mailboxes. UPS says it has tested a way for its workers to enter buildings without buzzing tenants, teaming up with a smart-lock company in 2018. But that test ended, and UPS declined to say why. The company says customers can instead have their packages delivered to nearby grocery stores, dry cleaners or florists if they’re not home.\n  Amazon has wanted to walk through people’s front doors for years. In 2017, it launched a way for shoppers to let delivery people come in their home when they’re not there and leave packages in the foyer. Walmart did the same shortly after, but its delivery people also stocked the fridge with groceries. Amazon and Walmart don’t say how many people are using those services, but both have expanded them to more cities recently.\n In 2018, Amazon set its sights on apartment buildings, launching Key for Business and signing up big landlords to install the device in their developments. But the push seems to have accelerated in the last year or so, with Amazon deploying salespeople nationwide. Recent job postings in Miami and San Antonio say Amazon salespeople can make $3,000 to $11,000 a month in bonuses and commissions. Amazon won’t say how much it’s spending on the effort.\n Not all Amazon packages can get through front doors. The company delivers about 60% of its own packages itself, according to shopping data firm Rakuten Intelligence; the rest come through other delivery companies that can’t let themselves in.\n Philip T. Evers, a logistics professor at University of Maryland’s Robert H. Smith School of Business, said Amazon’s desire to get the device into as many buildings as possible may be a way to keep competitors out.\n “The landlord may say, ‘You know, I’ll do this for one company, but maybe we don’t want it for every delivery company that’s out there,’ ” he said. He added that Amazon could find other uses for the service, like having delivery people pick up returns left in the lobby instead of making shoppers schlep to the post office. Amazon declined to share any future plans.\n Jason Goldberg, chief commerce strategy officer at marketing company Publicis Communications, said the device could save Amazon money, since workers can drop off more packages during a shift and may have to offer fewer refunds to those whose packages were stolen.\n He heard about the program in December, when a locksmith replacing the buzzer system at his Chicago condo building offered to install Amazon Key for Business for free. Goldberg, who helps manage the building, later allowed Amazon salespeople — dangling a $100 Amazon gift card — to install the device.\n “They give it away for free because it benefits Amazon more than us,” Goldberg said.", "posttime": "2021-07-24 07:26:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,亚马逊,amazon,business,key", "title": "看看亚马逊的 Key For Business 计划，该计划于 2018 年推出，让司机通过应用程序解锁公寓楼，鼓励房东采用", "title_en": "A look at Amazon's Key For Business program, launched in 2018 to let drivers unlock apartment buildings via an app, which it is encouraging landlords to adopt", "transed": 1, "url": "https://apnews.com/article/business-amazoncom-inc-a322a1aa0b29a58b0cb2a287ba0bac6f", "via": "", "real_tags": ["程序", "亚马逊", "amazon", "business", "key"]}, {"category": "", "categoryclass": "", "imagename": "671c740d47bb022d7106fa04ff38b2c6.jpg", "infoid": 1069369, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雨林是应对气候变化的强大而自然的解决方案——提供水过滤、捕获碳和调节全球温度。但是，包括农业扩张和砍伐在内的大规模土地利用变化等重大威胁已将这些生物多样性的天堂变成了地球上最濒危的栖息地之一。 2019 年，包括特拉华大学的 Rodrigo Vargas 在内的精选科学家在华盛顿特区的国家地理总部会面，讨论热带雨林面临的威胁。研究人员指出需要开发一个全球跟踪系统，该系统将发现有助于对抗土地退化和促进保护的趋势。在 7 月 23 日星期五发表在科学杂志 One Earth 上的论文中，这些研究人员介绍了独特的热带雨林指数 (TFVI)，这是全球雨林的基线。科学家的目标是检测和评估热带雨林对日益增加的威胁的脆弱性。国家地理和劳力士恒动行星计划资助了这项工作。 “通过这个新指数，我们现在不仅拥有全球覆盖面，而且具有统一性。我们可以总结关于雨林健康的关键信息，”生态系统生态学和环境变化教授 Vargas 说。 “它为我们提供了一个基准，并提供有关迫在眉睫的未来变化的信息。”利用先进的卫星测量，研究小组系统地分析了地球上每个热带地区的气候和植被。该研究的结果表明，雨林正在失去循环碳和水的能力。 “我们正在失去生物多样性和碳库的主要热点，”巴尔加斯说。 “这些不是世界各地的小块土地；这些是地球表面的很大一部分。”该研究的结果还表明，不同的热带地区对气候威胁有不同的反应。一些地区，如非洲的刚果盆地，比世界其他地区更具弹性。亚马逊盆地表现出对大气干燥条件、频繁干旱和大规模土地利用变化的大规模脆弱性。在东南亚，除了泥炭地地区，在厄尔尼诺年期间，现在更容易受到火灾的影响，热带雨林受到土地利用和物种破碎化的压力比气候带来的压力更大。\n“没有单一的解决方案，也没有适用于每个热带雨林的灵丹妙药。这凸显了对本地化解决方案的需求，”Vargas 说。 “但通用的全球指数也说明需要设计统一的战略，以最大限度地利用雨林提供的自然解决方案。”独特的热带雨林指数有条不紊地说明了雨林的敏感性实际上比之前的预测要大得多。受干扰和支离破碎的地区已经失去了对气候变暖和干旱的抵御能力。也许更令人不安的是研究结果表明雨林正在失去其循环碳和水的能力。热带森林为社会提供重要的环境服务和利益。这些热带雨林正在从历史上高度多样化的状态转变为经过严重改造的地区和受管理的土地——例如，缺乏从大气中固碳和支持生物多样性的能力。 “除了我们保护地球生物多样性的道德责任之外，因为人类的行为正在影响全球气候，我们必须准备好应对这些变化的后果，”巴尔加斯说。", "note_en": "Rainforests are a powerful, natural solution to combat climate change — providing water filtration, capturing carbon and regulating global temperatures. But major threats like large-scale land use changes, including agricultural expansion and clearcutting, have turned these biodiversity havens into one of the most endangered habitats on our planet.\n In 2019, select scientists, including the University of Delaware’s  Rodrigo Vargas, met at the National Geographic headquarters in Washington, D.C., to discuss the threats to rainforests. The researchers pinpointed a need to develop a worldwide tracking system, which would find trends to help fight land degradation and promote conservation.\n  In the paper published on Friday, July 23 in the scientific journal  One Earth, these researchers introduce the unique tropical rainforest index (TFVI), a baseline for rainforests across the entire globe. The scientist’s goal is to detect and evaluate the vulnerability of rainforests to increasing threats. National Geographic and the Rolex Perpetual Planet Initiative funded the endeavor.\n  “Through this new index, we now have not only global coverage, but uniformity. We can summarize critical information about the health of rainforests,” said Vargas, professor of ecosystem ecology and environmental change. “It gives us a benchmark and provides information about looming, future changes.”\n Using advanced satellite measurements, the research team systematically analyzed the climate and vegetation of each tropical region on Earth. The study’s findings suggest that rainforests are losing their capacity to cycle carbon and water.\n “We are losing major hotspots for biodiversity and carbon pools,” Vargas said. “These are not small patches of land across the world; these are large sections of the Earth’s surface.”\n The study’s findings also indicate different regions of tropics have different responses to climate threats. Some regions, like Africa’s Congo basin, are more resilient than other parts of the world. The Amazon Basin shows large-scale vulnerability to drying conditions of atmosphere, frequent droughts and large-scale land-use changes. In Southeast Asia, rainforests are stressed more from land use and species fragmentation than they are from climate, except for areas of peatlands that are, during El Nino years, now more vulnerable to fire.\n “There is no single solution, no silver bullet that will work in every tropical rainforest. This highlights the needs for localized solutions,” Vargas said. “But a general, global index also illuminates the need to design unified strategies to maximize the natural solutions that rainforests provide.”\n The unique tropical rainforest index methodically illustrates that the susceptibility of rainforests is actually much greater than previous predictions. Disturbed and fragmented areas have lost resilience to climate warming and droughts. Perhaps even more distressing were study findings suggesting that rainforests are losing their capacity to cycle carbon and water.\n Tropical forests provide critical environmental services and benefits to society. These rainforests are changing from their historically, highly-diverse status to heavily transformed areas and managed land — one that lacks the ability to, for example, sequester carbon from the atmosphere and support biodiversity.\n “In addition to our moral responsibility to preserve our planet’s biodiversity, because human’s actions are influencing the global climate, we must be prepared to manage the consequences of these changes,” Vargas said.", "posttime": "2021-07-24 07:25:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "热带雨林,rainforest,全球", "title": "热带雨林指数", "title_en": "Tropical Rainforest Index", "transed": 1, "url": "https://www.udel.edu/udaily/2021/july/rodrigo-vargas-tropical-rainforest-index-national-geographic/", "via": "", "real_tags": ["热带雨林", "全球"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069368, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个日本人走进餐厅。我以前见过他，四处游荡；他想卖算盘。他开始与服务员交谈，并向他们提出挑战：他说他加数字的速度比他们中的任何人都快。服务员不想丢面子，就说：“是啊，是啊。你怎么不过去挑战一下那边的顾客？”该男子让服务员喊出一些号码进行添加。他把我打得很空洞，因为当我写下数字时，他已经在添加它们了。我建议服务员写下两个相同的数字列表，同时交给我们。它没有太大区别。他还是比我差了一点点。然而，男人却有些激动：他想再证明一下自己。 “乘法！”他说。有人写下了一个问题。他再次击败了我，但幅度不大，因为我非常擅长产品。然后这个人犯了一个错误：他建议我们继续分裂。他没有意识到的是，问题越难，我的机会就越大。\n这个日本人真烦死了，因为他显然在算盘上受过良好的训练，而在这里，他差点在餐厅里被这位顾客殴打。 “Raios立方体！”他报仇雪恨地说。立方根！他想通过算术计算立方根。在算术中很难找到更难的基本问题。这一定是他在算盘领域的顶级练习。他在纸上写下一个数字——任何旧数字——我仍然记得它：1729.03。他开始工作，喃喃自语：“Mmmmmmagmmmmbrrr”——他像恶魔一样工作！他正在钻研，做这个立方根。我指着我的头。 “思维！”我说。我在纸上写下 12。过了一会儿，我得到了 12.002。 “不好了！”我说。 “更多的数字！更多的数字！”我知道通过算术求立方根，每一个新的数字都比以前的数字要多。这是一项艰巨的工作。他又把自己埋了起来，咕哝着“Rrrrrgrrrrmmmmmm...”，而我又加了两个数字。他终于抬起头，“12.01！”服务员一个个都很兴奋，很开心。他们告诉那个人，“看！他只是通过思考来做这件事，你需要一个算盘！他有更多的数字！”\n顾客是怎么打算盘的？号码是 1729.03。我碰巧知道一立方英尺包含 1728 立方英寸，所以答案是比 12 多一点点。多余的 1.03 只是近 2000 年的一部分，我在微积分中了解到，对于小分数，立方根的超额是数量超额的三分之一。所以我所要做的就是找到分数 1/1728，然后乘以 4（除以 3，再乘以 12）。所以我能够以这种方式提取出很多数字。几周后，那个男人来到我住的酒店的鸡尾酒休息室。他认出了我，就过来了。 “告诉我，”他说，“你怎么能这么快地做那个立方根问题？”我开始解释这是一种近似方法，与错误百分比有关。 “假设你给了我 28。现在 27 的立方根是 3……”我意识到了一些事情：他不知道数字。有了算盘，你就不必记住很多算术组合；你所要做的就是学会上下推动小珠子。你不必记住9+7=16；你只知道当你加上 9 时，你把一个十的珠子推上去，把一个的珠子拉下来。所以我们在基本算术上比较慢，但我们知道数字。此外，近似方法的整个想法超出了他的范围，即使三次根通常无法通过任何方法精确计算。所以我永远无法教他我是如何计算立方根的，也无法解释我是多么幸运，他碰巧选择了 1729.03。", "note_en": "A Japanese man came into the restaurant. I had seen him before, wandering around; he was trying to sell abacuses. He started to talk to the waiters, and challenged them: He said he could add numbers faster than any of them could do.\n  The waiters didn&#39;t want to lose face, so they said, &#34;Yeah, yeah. Why don&#39;t you go over and challenge the customer over there?&#34;\n        The man asked a waiter to call out some numbers to add. He beat me hollow, because while I was writing the numbers down, he was already adding them as he went along.\n  I suggested that the waiter write down two identical lists of numbers and hand them to us at the same time. It didn&#39;t make much difference. He still beat me by quite a bit.\n  However, the man got a little bit excited: he wanted to prove himself some more. &#34; Multiplicação!&#34; he said.\n  Somebody wrote down a problem. He beat me again, but not by much, because I&#39;m pretty good at products.\n  The man then made a mistake: he proposed we go on to division. What he didn&#39;t realize was, the harder the problem, the better chance I had.\n    The bothered the hell out of the Japanese man, because he was apparently well trained on the abacus, and here he was almost beaten by this customer in a restaurant.\n  &#34; Raios cubicos!&#34; he says with a vengeance. Cube roots! He wants to do cube roots by arithmetic. It&#39;s hard to find a more difficult fundamental problem in arithmetic. It must have been his topnotch exercise in abacus-land.\n  He writes down a number on some paper— any old number— and I still remember it: 1729.03. He starts working on it, mumbling and grumbling: &#34; Mmmmmmagmmmmbrrr&#34;— he&#39;s working like a demon! He&#39;s poring away, doing this cube root.\n      I point to my head. &#34;Thinking!&#34; I say. I write down 12 on the paper. After a little while I&#39;ve got 12.002.\n    &#34;Oh, no!&#34; I say. &#34;More digits! More digits!&#34; I know that in taking a cube root by arithmetic, each new digit is even more work that the one before. It&#39;s a hard job.\n  He buries himself again, grunting &#34; Rrrrgrrrrmmmmmm ...,&#34; while I add on two more digits. He finally lifts his head to say, &#34;12.01!&#34;\n  The waiter are all excited and happy. They tell the man, &#34;Look! He does it only by thinking, and you need an abacus! He&#39;s got more digits!&#34;\n    How did the customer beat the abacus? The number was 1729.03. I happened to know that a cubic foot contains 1728 cubic inches, so the answer is a tiny bit more than 12. The excess, 1.03 is only one part in nearly 2000, and I had learned in calculus that for small fractions, the cube root&#39;s excess is one-third of the number&#39;s excess. So all I had to do is find the fraction 1/1728, and multiply by 4 (divide by 3 and multiply by 12). So I was able to pull out a whole lot of digits that way.\n  A few weeks later, the man came into the cocktail lounge of the hotel I was staying at. He recognized me and came over. &#34;Tell me,&#34; he said, &#34;how were you able to do that cube-root problem so fast?&#34;\n  I started to explain that it was an approximate method, and had to do with the percentage of error. &#34;Suppose you had given me 28. Now the cube root of 27 is 3 ...&#34;\n    I realized something: he doesn&#39;t  know numbers. With the abacus, you don&#39;t have to memorize a lot of arithmetic combinations; all you have to do is to learn to push the little beads up and down. You don&#39;t have to memorize 9+7=16; you just know that when you add 9, you push a ten&#39;s bead up and pull a one&#39;s bead down. So we&#39;re slower at basic arithmetic, but we know numbers.\n  Furthermore, the whole idea of an approximate method was beyond him, even though a cubic root often cannot be computed exactly by any method. So I never could teach him how I did cube roots or explain how lucky I was that he happened to choose 1729.03.", "posttime": "2021-07-24 07:25:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "费曼,feynman,服务员", "title": "费曼与算盘 (1985)", "title_en": "Feynman vs. the Abacus (1985)", "transed": 1, "url": "http://www.ee.ryerson.ca/~elf/abacus/feynman.html", "via": "", "real_tags": ["费曼", "feynman", "服务员"]}, {"category": "", "categoryclass": "", "imagename": "91f9ab8a2fef16b217585a4ddc0c11f1.png", "infoid": 1069367, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近在威斯康星州麦迪逊市买了一栋房子，但在此之前，我在该州不同地区进行了一系列探索房地产市场的冒险。我最初对威斯康星州很感兴趣，因为我在那里有大家庭，他们鼓励我去看看阿普尔顿。他们将其描述为一个安全、繁荣且不断发展的社区，住满了好人。有一个历史悠久的市中心，劳伦斯大学，医疗中心，它是县城。作为其光明未来的证明，他们还提到亚马逊正在机场附近建造一个巨大的履行中心。我找到了一位房地产经纪人，描述了我正在寻找的内容，然后她开始向我发送可用房产的链接。我要求的是在靠近市政设施的可步行的社区中建造具有一点建筑特色的建筑，很可能在大学、公园、餐馆和商店骑自行车的范围内。我要了一个复式，想我会买一个和家人共同拥有的地方。他们可以拥有他们的一半，我可以拥有我的。赢赢。这些是她建议的地方。我查看了她在房源上设置的过滤器，她删除了 1990 年之前建造的所有房产。这保证了所提供的房屋都位于高速公路沿线的郊区边缘，而不是在城里。当我问她这个问题时，她很困惑，并开始在阿普尔顿的房地产市场上对我进行教育。她解释说你不想要旧房子，因为他们有太多的延期维护。相对于它们的转售价值，将它们提升到现代标准的成本太高了。旧社区的税收太高，因此您想在旧城区范围之外的市政线路上购买。在较新的开发项目中，您可以以更低的税收以更少的钱获得更多的房子。新区的学校要好得多，人们购买学区的次数比购买房屋本身的次数要多。虽然阿普尔顿是一个非常安全的小城市，但与边缘相比，犯罪始终是核心的更大问题。你必须为孩子们着想。更大面积的新房是更好的投资，因为这是优质买家想要的。老房子不升值，他们衰落。从她的角度来看，她告诉我的事情无疑是正确的。她不仅反映了阿普尔顿的价值观，也反映了大多数美国人和选择住在这些地方的人们的价值观。她没有错。但除了我不关心这些房屋中的任何一个并且永远不会在这些地方购买这一事实之外，我意识到了阿普尔顿模型的真相。三十年后，她出售的所有新房都将归入“旧”类别，并且随着税收的增加和中产阶级迁移到新的绿地开发项目而逐渐恶化。这些较旧的地方（今天正在建造的房屋）将由资源较少、地位较低的下层阶级人口居住，从而强化了如果可能的话最好搬家的看法。这些是可替代的、可遗忘的、一次性的地方，它们会迅速老化，然后静静地腐烂。还有商业地产老化的问题。在过去的几代人中，我们目睹了主街的大规模弃置，取而代之的是脱衣舞中心、大型商店和区域购物中心。现在，这些零售中心日渐陈旧，受到在线商务和送货上门的挤压。亚马逊物流仓库受到当地政府的大力补贴，并被誉为大都会边缘的“增长”，正在有效地取代福克斯河购物中心和各种小型购物广场的干壳。这不是一个附加过程。这是刀耕火种的都市主义，结局并不好。 “好消息”是这些地方建造得又快又便宜，无论如何都不会持续下去。它们的建造寿命经过精心调整，以匹配金融承销商的摊销和折旧时间表。一旦他们停止将现金流和税收优惠分给遥远的投资者，他们就会干杯。然后他们成为别人的问题。如果泥土的价值足够高，有人会将财产重新开发成不同的东西，但只能使用来自“商业友好”当地政府的适当甜味剂，这意味着大量补贴和免税期。这些交易往往是人质谈判。\n在向任何方向延伸 10 英里的连续大阿普尔顿地区内，有数十个较小的城市，这些城市在一个世纪的大部分时间里都被郊区开发所吞没。曾经繁荣的城镇的点点滴滴都以消失的形式存在于蔓延之中。这些城镇沿驳船运河、小型水电大坝和生产性工厂建造。许多幸存的建筑物已经部分占用或完全空置了数十年。一半的原始结构贬值，以至于它们被拆除并取而代之的是地面停车场。其中一些被用作低档存储设施或廉价寄售店。出于好奇，我查看了其中一栋建筑的成本。今年冬天，这个地方一楼有一家已停业的中餐厅，楼上有一间空置的两居室公寓，售价为 85,000 美元。仅餐厅设备、工业炉灶、油炸锅、步入式冰箱、不锈钢工作台和灭火通风罩的成本就接近这个价格。这座建筑在市场上已经很长时间没有出价了。它最终在几个月前以 65,000 美元的价格售出。相比之下，这是对价值 65,000 美元的豪华 2021 Ram 皮卡车的评论。有人拆除了餐厅内部，并开了一家出售棒球卡的收藏品店。这家商店激活了店面并使这个地方保持温暖，所以我全力以赴。但是，除非这家企业通过互联网完成大部分销售，否则它将难以生存。幸运的是，开销低得惊人。这一切都会继续进行，直到建筑物需要大笔费用，例如对失败的砖墙或破裂的基础进行结构修复。然后它开始沿着停车场转换的道路。回到一个世纪前这个小镇处于鼎盛时期的时候，这些空地中的每一个都有多座建筑物。他们现在都走了。我打电话给当地的商业改善区办公室以及城市规划师，并与各个部门的人聊天。他们以通常的销售方式讲述了他们如何打造具有历史特色的充满活力的零售大街。他们提到了新的装饰灯柱、花坛、节日旗帜和季节性庆祝活动。 “你看到我们的鹰雕塑了吗？”我想起了俄亥俄州科尔兰镇。破败的建筑物已被新的消防局、中学、市政府和新的警察局所取代。一旦融资和足够的空地聚集起来以容纳现代建筑，就有计划进行填充式开发。 （又名德克萨斯甜甜圈。）我的感觉是，他们加入城市规划时尚潮流已经晚了二十年。我对这个地方的未来的看法是我在全国其他地方看到的事物的变化。出于情感原因，Ye Olde Towne 的一小部分被保留下来，并变成了一个事实上的主题购物中心。在这个地方，随着文化和经济的盛行……我认为这只不过是一堆平庸的化妆品贴片，它们会一瘸一拐地跛行，直到下一个时尚在下一个二十年后到来。这不是一个可怕的情况，但它也不是“变革性的”或“催化性的”。我给了这些官员我一贯的直率评价。他们不喜欢我的语气。所以这是大局。美国的所有机构都专注于流失。生产新东西，快速出售，兑现，然后继续下一个项目。破败的街区并非偶然。它们融入了我们做事的方方面面。成功的个人和精明的投资者本能地知道这一点，并每五年或十年不断地迁移到下一个更好的地方。市政官员和私人顾问也是如此，他们不断地从一个职位跳到另一个职位，离开已经达到顶峰的地区，支持仍在增长的地区。\n我希望人们停止假装，而是诚实地对待这种情况。几十年你会得到很好的运行。然后随着乙烯基壁板和合成灰泥开始剥落，事情慢慢变得糟糕。我们将继续这样做，直到由于某种原因我们再也做不到为止。那么我们将别无选择，只能开始重新居住在留下的渣滓中。有些地方会比其他地方更值得拯救。耸耸肩。我想起了伊丽莎白·毕晓普 (Elizabeth Bishop) 的诗《想象中的冰山》，开头写道：“我们宁愿拥有冰山，也不愿拥有船，尽管这意味着旅行的结束。”这就是我对北美发展模式的感受。它是短暂的。在漫长的历史长河中，没有人会错过这些地方。后代将忙于对他们将继承的景观做完全不同的事情。我已经接受了这个现实。", "note_en": "I recently bought a house in Madison, Wisconsin, but before I did I went through a series of adventures in different parts of the state exploring the property market. I was initially interested in Wisconsin because I have extended family there and they encouraged me to look at Appleton. They described it as a safe, prosperous, and growing community populated by good people. There’s a historic downtown, Lawrence University, the medical center, and it’s the county seat. As proof of its bright future they also mentioned Amazon is building a giant fulfillment center out by the airport. I found a real estate agent, described what I was looking for, and she began sending me links to available properties.\n What I requested was a building with a bit of architectural character in a walkable neighborhood near civic amenities, quite possibly within a bicycle ride of the university, public parks, restaurants, and shops. I asked for a duplex, thinking I would be buying a place that I would co-own with family members. They could have their half, I could have mine. Win win.\n          These are the places she suggested instead. I looked at the filter she had set on the listings and she had eliminated any property that was built before 1990. That guaranteed the homes on offer would all be out on the suburban fringe along the highways instead of in town. When I asked her about this she was confused and set about educating me on the property market in Appleton.\n She explained that you don’t want an older home because they have too much deferred maintenance. Bringing them up to a modern standard is too expensive relative to their resale value. Taxes are too high in old neighborhoods so you want to buy across municipal lines outside the older city limits. You get more house for less money with lower taxes in the newer developments. The schools are much better in the newer areas, and people shop for school districts more than they shop for a house itself. While Appleton is a very safe little city, crime is always a bigger problem at the core compared to the edges. You have to think of the children. And a newer home on a larger lot is a better investment because that’s what quality buyers want. Older homes don’t appreciate, they decline.\n  What she was telling me was no doubt true from her perspective. She reflected the values not just of Appleton, but most of America and the people who choose to live in these places. She wasn’t wrong. But aside from the fact that I didn’t care for any of these homes and was never going to buy in these locations, I realized the truth of the Appleton model. Thirty years from now all the new homes she’s selling will slip into the “old” category and will gradually fester as taxes rise and the middle class migrates to new greenfield developments. These older places (the homes being built today) will then be populated by lower class people with fewer resources and less status thereby reinforcing the perception that it’s best to move on if at all possible. These are fungible, forgettable, disposable places that rapidly age and are then left to quietly decay.\n      There’s also the problem of aging commercial real estate. Over the last few generations we’ve witnessed the wholesale abandonment of Main Street in favor of strip centers, big box stores, and regional shopping malls. Now these retail centers are getting old and are being squeezed hard by online commerce and home delivery. The Amazon fulfillment warehouse that’s so aggressively subsidized by local government and heralded as “growth” out on the edge of the metroplex is effectively replacing the dried husk of the Fox River Mall and various lesser shopping plazas. This isn’t an additive process. It’s slash and burn urbanism and it doesn’t end well.\n The “good news” is these places were built fast and cheap and were never meant to last anyway. They have a construction lifespan exquisitely tuned to match the amortization and depreciation schedules of the financial underwriters. As soon as they stop spinning off cash flow and tax advantages to distant investors they’re toast. Then they become someone else’s problem. If the value of the dirt is high enough someone will redevelop the property into something different, but only with the appropriate sweeteners from “business friendly” local government, meaning heavy subsidies and tax holidays. These deals tend to be a hostage negotiation.\n       Within the continuous greater Appleton region for ten miles in any direction are dozens of smaller municipalities that have been engulfed by suburban development for most of a century. Little vestiges of once prosperous towns linger in diminished form embedded in the sprawl. These towns were built along barge canals, small hydroelectric dams, and productive mills. Many of the surviving buildings have been partially occupied or completely vacant for decades. Half the original structures were so devalued that they were torn down and replaced with surface parking lots. A number of them are used as low grade storage facilities or budget consignment shops.\n    Out of curiosity I looked at how much one of these buildings costs. This winter  this place with a defunct Chinese restaurant on the ground floor and a vacant two bedroom apartment upstairs was offered at $85,000. The cost of the restaurant equipment alone, the industrial stoves, deep fryers, walk-in refrigerators, stainless steel work tables, and fire suppressing vent hoods would have been close to that price. The building had been on the market for a very long time with no bids. It eventually sold a few months ago for $65,000. For comparison, here’s a review of a $65,000 luxury 2021 Ram pickup truck.\n  Someone removed the restaurant interior and opened a  collectibles shop that sells baseball cards. This shop activates the storefront and keeps the place warm so I’m all for it. But unless this enterprise does most of its sales via the interwebs it’s going to struggle to survive. Fortunately the overhead is shockingly low. It will all keep ticking along until the building needs a big ticket item like a structural repair to a failing brick wall or cracked foundation. Then it starts down the road to a parking lot conversion.\n       Back when this town was at its peak a century ago each of these vacant parcels had multiple buildings on them. They’re all gone now. I called the local business improvement district office as well as the town planner and chatted with people in various departments. They gave the usual sales pitch about how they’re creating a vibrant retail Main Street with historic character. They mentioned the new decorative lamp posts, flower beds, festive flags, and seasonal celebrations. “Did you see our eagle sculpture?” I got a flashback to  Colerain Township, Ohio.\n   Blighted buildings had been replaced with a new fire station, middle school, city offices, and a new police station. And there are plans for infill development once financing and enough vacant parcels are aggregated to accommodate modern buildings. (AKA  Texas Doughnuts.) My sense is that they’re jumping on the city planning fashion bandwagon twenty years too late.\n What I see for the future of this spot is a variation on things I’ve seen elsewhere around the country. A sliver of Ye Olde Towne is preserved for sentimental reasons and turned into a de facto  themed strip mall. In this location, with the prevailing culture and economy… I don’t see this being much more than a mediocre collection of cosmetic patches that will limp along half assed until the next fad arrives in another twenty years. It’s not a terrible situation, but it’s not “transformative” or “catalytic” either. I gave these officials my usual blunt assessment.  They didn’t like my tone.\n So here’s the big picture. All of America’s institutions are focused exclusively on churn. Crank out new stuff, sell it fast, cash out, and move on to the next project. Blighted neighborhoods aren’t an accident. They’re baked in to every facet of how we do everything. Successful individuals and savvy investors know this instinctively and keep moving every five or ten years to the next new better place. This is also true of municipal officials and private consultants who continually hopscotch from job to job leaving behind districts that have peaked in favor of ones that are still growing.\n I’d love for people to stop pretending otherwise and just be honest about the situation. You get a really good run for a few decades. Then things slowly turn to crap as the vinyl siding and synthetic stucco start to peel off. We’re going to continue to do this until we simply can’t anymore for one reason or another. Then we’ll have no choice but to start re-inhabiting the dregs that were left behind. Some places will be more worthy of salvation than others. Shrug.\n I’m reminded of  Elizabeth Bishop’s poem “The Imaginary Iceberg” which begins, “We’d rather have the iceberg than the ship, although it meant the end of travel.” That’s how I feel about the North American development pattern. It’s ephemeral. In the long arc of history no one will miss any of these places. Future generations will be busy doing entirely different things with the landscape they’ll inherit. I’ve made my peace with that reality.", "posttime": "2021-07-24 07:25:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拥有,iceberg,地方", "title": "我们宁愿拥有冰山也不愿拥有船", "title_en": "We’d rather have the iceberg than the ship", "transed": 1, "url": "https://www.granolashotgun.com/granolashotguncom/wed-rather-have-the-iceberg-than-the-ship", "via": "", "real_tags": ["拥有", "iceberg", "地方"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069366, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到您请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2021-07-24 07:24:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "egressive,egregious,请求", "title": "AWS 的 Egressive Egress", "title_en": "AWS's Egregious Egress", "transed": 1, "url": "https://blog.cloudflare.com/aws-egregious-egress/", "via": "", "real_tags": ["egressive", "egregious", "请求"]}, {"category": "", "categoryclass": "", "imagename": "418087cdb529052a0211ffc9a68db5a0.jpg", "infoid": 1069365, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "石油和天然气公司 O Royal Dutch Shell 和西班牙电力公司 Iberdrola 的子公司 Scottish Power 发布了一项公告。他们说，他们共同向英国当局提交了在苏格兰海岸附近建造世界上第一套大型浮动风电场的建议。目前，最大的浮动农场是一个 6 涡轮机，50 阵列，将于下个月在距离阿伯丁 15 公里的北海完工。相比之下，该财团表示正在考虑千兆瓦 ( )。以海床为基础的海上风电场现在已成为多个地方能源结构的一部分。在过去四年中，他们的产能几乎翻了一番，从 19 增加到 35，摊销成本下降了三分之一，从每小时 120 美元降至 80 美元。然而，它们的部署能力有限，仅限于浅于约 60 米的水域。不幸的是，世界上 80% 的海上风吹过比这更深的地方。国际能源署表示，让这些设施变得可及，将释放足够的电力，以满足 2040 年世界可能的电力需求 11 倍。诀窍是建造涡轮机，虽然停泊在海床上，但会漂浮。如果壳牌和苏格兰电力能够成功实现这一目标，那将是朝着挖掘潜力迈出的一大步。十年前，浮动涡轮技术是一个边缘事件。困难不在于涡轮机本身，而在于使它们漂浮。自 1960 年代以来，石油和天然气行业开发了一系列浮动基础，可以使钻井平台等巨大物体在海上保持稳定。但是，将这种专业知识转移到风力发电上并不容易。首先，与石油钻井平台不同，风力涡轮机瘦长且头重脚轻，容易翻倒。其次，涡轮机会产生强大的陀螺力，这会进一步破坏漂浮机器的稳定性。在那些日子里，很难看到如何以足够便宜的方式解决这些问题，以与用螺栓固定在海底的涡轮机竞争——更不用说传统能源了。不再。十年的发展产生了两件事：证明涡轮机可以漂浮和清楚地了解这些漂浮装置的外观。工程师通过患者原型设计实现了这一点。他们采用了先前在大学波浪池中测试过的设计，并将它们放大到挪威、葡萄牙和日本沿海的小型示范单位。每个单元都配备了传感器，收集了诸如俯仰、风速和波浪高度等变量的数据。然后将这些数据折叠到设计中，以获得更大、更稳定的单元。结果，今天在挪威和葡萄牙海岸附近的新模型中可见，可以安全地漂浮比其前辈强大四倍的涡轮机。因此，工程师认为浮选问题已解决。 “涡轮机运行良好。他们不翻转。这是可以做到的，”该领域的先驱阿拉·温斯坦 (Alla Weinstein) 说，他现在正在为加利福尼亚海岸附近的浮动风电场申请许可证。出现了四种浮选方法（见图）。最常见的是半潜式。一家美国公司 Principle Power 是一家追求这一目标的公司。半潜式有多种设计。 Principle&#39;s 使用了一个有浮力的钢三角形，在两个顶点处有一个装满水的罐子。这些压载舱平衡了第三个顶点处涡轮机的重量，在三角形内部泵送水以降低其稳定性。\n挪威公司 Equinor 所追求的第二个方法是将涡轮机固定在一个装满重压载物的称为翼梁的瓶子上，使其直立漂浮。 Equinor 将涡轮机放置在 80 米高的混凝土管上，该管内装有水、岩石或其他一些廉价而沉重的材料。另外两种方法不太发达，但可能证明是有用的。 Glosten 是一家与通用电气建立合作伙伴关系的美国工程公司，它使用的是张力腿平台。这是一个海星形状的钢结构，其轮毂处装有涡轮机。海星被淹没并用电缆连接到海底。这种布置类似于在墨西哥湾钻探的超深水 Magnolia 钻井平台，使涡轮机保持直立。挪威公司 Ideol 将涡轮机安装在类似于空相框的扁平混凝土或钢驳船上。当涡轮机摆动时，水会在框架内晃动，从而抑制其运动。该公司声称，其原型机位于日本沿海，已经在三场台风中幸存下来。项目开发人员已经看到了足够的东西来说服他们。尽管壳牌-苏格兰电力财团的提议（没有提及首选技术方法）是迄今为止最雄心勃勃的，但它们并不是第一个。除了由使用 Principle 设计的西班牙建筑公司 Grupo Cobra 拥有的 Aberdeen 附近的 50 阵列外，Equinor 还开始建设一个 11 个单元、88 个项目，该项目将为一组北海钻井平台提供动力。法国石油和天然气公司道达尔和麦格理银行的项目开发部门绿色投资集团打算到 2023 年开始在韩国海岸附近的一个 500 浮式风电项目的工作——尽管他们也已经尚未具体说明他们计划使用哪种技术。更大的农场显然需要更多的涡轮机。但理想情况下，它们也需要更大的涡轮机。涡轮机越大，维护起来就越困难。风力涡轮机有时需要更换大部件，如叶片或发电机。这在土地上是具有挑战性的。但是在陆地上，起重机可以靠着地面支撑自己。在海上，“自升式”船只通过将钢腿放到海床上来实现类似的稳定性。然而，浮动涡轮机将在自升式船只无法工作的太深水域中运行，因此任何为它服务的船只本身都必须保持漂浮。 Equinor 的项目总监 Olav-Bernt Haga 说：“你有两个正在移动的结构，你要把载荷从这些移动结构中的一个转移到另一个。”这在技术上要求很高，因此很难廉价地做到。一个名为浮风联合产业项目 ( ) 的小组认为这是一个紧迫的问题，该小组的工作是标记集体利益的问题。该小组由 17 名项目开发商和位于英国的非盈利咨询机构 Carbon Trust 组成。去年发表的一项分析称，风力涡轮机已接近海上处理能力的物理极限。石油工业有许多在深水中工作的重型起重船。但是这些是针对重量而不是高度进行了优化，并且租用成本很高。浮动风电行业需要新的答案，否则它可能会发现自己在字面上和隐喻上都受到阻碍。幸运的是，前景正在发展。他们对这个问题采取了两种广泛的方法：举重和攀爬。前者的一个例子是荷兰公司 Heavy Lift，该公司已开始建造 010，这是一艘专门用于海上风电维护的船只。任何在浮动风力涡轮机上工作的人都必须与波浪作斗争。表面的轻微膨胀可能会导致危险的扫掠。 -010 将通过使用运动补偿软件将起重机吊钩的位置稳定在 5 厘米以内来消除这种摇摆的影响。即使该钩子高于海平面 150 米，这也有效。不过，此类船只的起价约为 2.5 亿美元。仅成本就意味着该行业将不得不共享少量船舶，从而成为增长的瓶颈。这就是为什么有些人建议停止接近涡轮机，而是开始攀爬它们。\n攀爬起重机在它们正在建造的物体上快速爬升，通常用于在陆地上架起摩天大楼。它们在海上未经证实，但有几个团体正在开发可能适合浮动风力发电的版本。例如，位于英国剑桥的 Wind 公司建议在涡轮机塔架的侧面安装轨道。这将让一艘船靠边停靠，在轨道上放置一辆维修车，从而在塔上上下移动大部件。其他人建议从涡轮机本身提升。大多数涡轮机都有一个用于轻型物品的小型起重机。丹麦公司 Liftra 使用它来提升越来越大的起重机。最大的尺寸适合标准的 40 英尺（12.2 米）集装箱。该公司声称，一旦用螺栓固定，该装置与传统的外部起重机一样强大。或者，正如荷兰承包商 Conbit 所建议的那样，将一些金属部件和电缆拉到塔顶，就可以在涡轮机的顶部临时建造重型起重机。这些技术都没有超出原型阶段。但它们可能对明天的大型涡轮机很有价值，无论它们是固定的还是浮动的。然而，对于浮动涡轮机，可能存在替代方案。与固定式涡轮机不同，它们可以拔下插头并拖到岸上。由最近发起的分析表明，在个别情况下最好的可能取决于位置。如果浮动涡轮机靠近岸边，最容易将其拖回港口进行维修。如果距离很远，像 -010 或攀爬起重机这样的奇特小工具可能会更好地工作。所有这一切的结果是，很快就有可能从风中提取更多电力，而无需用涡轮机覆盖山坡，并在这样做的同时获利。这足以让任何人的风帆风帆。 ■ 这篇文章出现在印刷版的科技版块，标题为“漂浮的风力涡轮机可以上升到很高的高度”", "note_en": "O  Royal Dutch Shell, an oil and gas company, and Scottish Power, a subsidiary of Iberdrola, a Spanish electricity utility, made an announcement. They were, they said, jointly submitting proposals to the British authorities to build, off the coast of Scotland, the first large-scale set of floating wind farms in the world. At the moment, the largest floating farm is a six-turbine, 50  array which is due for completion next month in the North Sea, 15km from Aberdeen. The consortium, by contrast, has said it is thinking in gigawatts ( ).\n  Offshore wind farms with foundations in the seabed are now part of the energy mix in several places. In the past four years their capacity has nearly doubled, from 19  to 35 , and amortised costs have dropped by a third, from $120 per  -hour to $80. They are, however, of limited deployability, being restricted to waters shallower than about 60 metres.\n Unfortunately, 80% of the world’s offshore wind blows over places deeper than that. Making these accessible, says the International Energy Agency, an offshoot of the  , would unlock enough power to meet the world’s probable electrical needs in 2040 11 times over. The trick is to build turbines which, though moored to the seabed, will float. If Shell and Scottish Power can pull this trick off, it will be a big step towards tapping that potential.\n  A decade ago, floating-turbine technology was a fringe affair. The difficulty was not the turbines themselves, but making them float. The oil and gas industry had, since the 1960s, developed a range of floating foundations that could keep titanic objects like drilling rigs stable at sea. But transferring that know-how to wind power was hardly straightforward. First, unlike an oil rig, a wind turbine is lanky and top-heavy, making it prone to tip over. Second, turbines generate powerful gyroscopic forces that would further destabilise a floating machine. It was hard, in those days, to see how these problems could be solved cheaply enough to compete with turbines bolted to the ocean floor—much less with conventional power sources.\n  No longer. A decade of development has yielded two things: proof that turbines can float and clarity as to how these floating units might look. Engineers achieved this through patient prototyping. They took designs previously tested in university wave pools and scaled them up into small demonstration units off the coasts of Norway, Portugal and Japan.\n Each unit, bedecked with sensors, gathered data on variables such as pitch, wind speed and wave height. These data were then folded into designs, for bigger, more stable units. The results, visible today in newer models off the Norwegian and Portuguese coasts, can safely float turbines four times as powerful as their predecessors. Engineers therefore consider the flotation problem solved. “The turbines function nicely. They don’t flip. It can be done,” said Alla Weinstein, a pioneer of the field who is now pursuing permits for a floating wind farm off the coast of California.\n Four approaches to flotation have emerged (see diagram). The commonest is a semisubmersible. Principle Power, an American company, is one firm pursuing this. Semisubmersibles come in various designs. Principle’s uses a buoyant steel triangle that has water-filled cans at two of the vertices. These ballast tanks balance the weight of a turbine at the third vertex, with water pumped around inside the triangle to trim its stability.\n  A second tack, pursued by, among others, Equinor, a Norwegian firm, is to stick a turbine on a bottle called a spar that is filled with heavy ballast, to make it float upright. Equinor does this by placing the turbine on top of an 80-metre-high concrete tube containing water, rocks or some other cheap and heavy material.\n Two other approaches are less developed, but may prove useful. Glosten, an American engineering firm that has formed a partnership with General Electric, uses a tension-leg platform. This is a starfish-shaped steel structure with a turbine at its hub. The starfish is submerged and yoked to the ocean floor with cables. This arrangement, similar to that for the ultra-deep-water Magnolia rig, drilling in the Gulf of Mexico, holds the turbine upright. And   Ideol, a Norwegian firm, erects the turbine on a flat concrete or steel barge that resembles an empty picture frame. When the turbine sways, water sloshes within the frame, dampening its movement. The company claims its prototype, off the coast of Japan, has already survived three typhoons.\n  Project developers have seen enough to convince them. Though the Shell-Scottish Power consortium’s proposals (which make no mention of a preferred technological approach) are the most ambitious so far, they are not the first. Besides the 50  array off Aberdeen, which is owned by Grupo Cobra, a Spanish construction company that uses Principle’s design, Equinor has begun construction on an 11-unit, 88  project which will power a group of North Sea drilling platforms. Total, a French oil and gas company, and Green Investment Group, a project-development arm of Macquarie, a bank, intend to start work on a 500  floating wind project off the coast of South Korea by 2023—though they, too, have not yet specified which technology they plan to use.\n  Bigger farms obviously require more turbines. But they also, ideally, require bigger turbines. And the bigger a turbine is, the harder it is to maintain. Wind turbines occasionally need big parts, like blades or generators, replaced. That is challenging on  terra firma. But on land, a crane can brace itself against the earth. At sea, “jackup” vessels achieve similar stability by dropping steel legs to the seabed. Floating turbines will, however, operate in waters too deep for jackup vessels to work, so any vessel servicing one will have, itself, to remain floating. “You have two structures that are moving, and you’re going to shift the load from one of these moving structures to another one,” said Olav-Bernt Haga, a project director at Equinor. This will be technically demanding and thus hard to do cheaply.\n A group called the Floating Wind Joint Industry Project ( ), the job of which is to flag up matters of collective interest, deems this an urgent problem. This group is made up of 17 project developers and the Carbon Trust, a not-for-profit consultancy based in Britain. In an analysis published last year the   said that wind turbines are nearing the physical limits of what can be handled at sea. The oil industry has a number of heavy-lift ships that work in deep water. But these are optimised for weight, not height, and are expensive to hire. The floating-wind industry needs new answers, or it could find itself stunted, both literally and metaphorically.\n Fortunately, prospects are in development. They take two broad approaches to the problem: lifting and climbing. An example of the former is   Heavy Lift, a Dutch company, which has started work on the  010, a vessel dedicated to offshore-wind maintenance. Anyone working on floating wind turbines must contend with waves. A gentle swell at the surface can cause a treacherous sweep up high. The  -010 will iron out the effect of this swaying by using motion-compensation software that steadies the position of the crane’s hook to within 5cm. This works even when that hook is 150 metres above sea level.\n The price tags for such vessels, though, start at around $250m. The cost alone implies that the industry would have to share a small number of ships, presenting a bottleneck to growth. That is why some propose to stop reaching up to turbines, and to start climbing them, instead.\n  Climbing cranes, which scurry up the very object they are building, are often used to raise skyscrapers on land. They are unproven at sea, but several groups are developing versions that might suit floating wind power.  Wind, a firm in Cambridge, England, for example, suggests putting tracks on the sides of turbine towers. This would let a ship pull up alongside, place a maintenance car on the tracks, and thus move large parts up and down the tower.\n Others propose to lift from the turbine itself. Most turbines have a small crane for light items. Liftra, a Danish company, uses this to raise progressively larger cranes. The biggest fits in a standard 40-foot (12.2 metre) shipping container. Once bolted on, the company claims, the arrangement is as powerful as a conventional external crane. Alternatively, as Conbit, a Dutch contractor, proposes, pulling a few metal parts and cables to the top of the tower would allow a heavy-duty crane to be fashioned temporarily on the turbine’s crown.\n  None of these technologies is beyond the prototype stage. But they may prove valuable for the mega-turbines of tomorrow, be they fixed or floating. For floating turbines, however, an alternative may exist. Unlike fixed turbines, they can be unplugged and dragged to shore. Recent analysis sponsored by the   suggests that what is best in individual circumstances may depend on location. If a floating turbine is near the shore, it may be easiest to tow it back to port for repair. If far away, exotic gadgets like the  -010 or climbing cranes may work better.\n The upshot of all this is that it may soon be possible to extract a lot more electrical power from the wind, to do so without covering hillsides with turbines, and to make a profit while doing it. And that is enough to put wind in anyone’s sails.  ■\n This article appeared in the Science &amp; technology section of the print edition under the headline &#34;Floating wind turbines could rise to great heights&#34;", "posttime": "2021-07-24 07:24:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "风力,wind,涡轮机", "title": "漂浮的风力涡轮机可以升到很高的高度", "title_en": "Floating wind turbines could rise to great heights", "transed": 1, "url": "https://www.economist.com/science-and-technology/2021/07/21/floating-wind-turbines-could-rise-to-great-heights", "via": "", "real_tags": ["风力", "wind", "涡轮机"]}]