[{"category": "", "categoryclass": "", "imagename": "8f49245dd8260cb48fc47d1860c57f36.png", "infoid": 1068044, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows 11具有Windows 10的所有电源和安全性，具有重新设计和刷新的外观。它还配备了新的工具，声音和应用程序。每个细节都已考虑。所有这一切都在一起，为您带来PC上的令人耳目一新的体验。\n    这取决于！许多不同的制造商将提供各种设备，该设备将运行Windows 11，所有设备都以不同的价格点运行。\n  使用Windows 11预先安装的PC将可从今年晚些时候提供广泛的零售商提供。来的细节。\n  如果您的附件使用Windows 10并满足Windows 11要求，它们应该使用Windows 11.如果要确定，请咨询您的配件制造商。\n  我现在想买一台电脑，我稍后可以安装Windows 11吗？\n 目前销售的大多数Windows 10 PC将能够升级到Windows 11.对于PC能够升级到Windows 11，它必须满足一些功能所需的最小硬件规格和特定硬件。升级卷展栏计划仍在最终确定，但计划于2021年开始迟到，并继续进入2022.特定时机将因设备而异。\n  有几种方法可以找到出来。如果您目前正在购买新的PC，请在事实标记上查看“免费升级到Windows 11”。您还可以要求您的零售销售专业人员确认。 \n我什么时候可以在我的Windows 10设备上升级到Windows 11？\n 如果您现有的Windows 10 PC正在运行最新版本的Windows 10并满足最低硬件规范，它将能够升级到Windows 11.升级推出计划仍在最终确定，但对于今天已经使用的大多数设备，我们预计它会在2022年初准备好了。并非所有有资格升级到Windows 11的Windows 10 PC将同时升级。要查看您的PC是否有资格升级，下载和运行PC Health Check App。升级卷展栏已启动后，您可以通过进入设置/ Windows更新来检查它是否已准备好。\n    如何知道我的当前Windows 10 PC是否符合Windows 11的硬件要求？\n 如果您想看看当前的电脑是否符合最低要求，下载并运行PC Health App。\n  如果我的电脑不符合最低硬件规格怎么办？我可以留在Windows 10吗？\n 是的！ Windows 10仍然是Windows的伟大版本。我们致力于支持2025年10月14日的Windows 10。\n  升级到Windows 11将于2021年延迟推出，并继续进入2022年。在此期间，我们将在您的特定PC进行一些幕后测试和验证。 Windows Update将在PC符合条件时提供指示。您可以通过进入设置/ Windows更新来检查。 \n免费。但只有运行最新版本的Windows 10的Windows 10 PC，符合最低硬件规范将能够升级。您可以在设置/ Windows Update中查看您是否为Windows 10的最新更新。\n  更新可以由Windows版本中的错误和安全修复和新功能组成。他们倾向于全年推出。升级是更改版本 - 例如，从Windows 10移动到Windows 11，或从Windows Home移动版本到Windows Pro。\n  免费升级优惠没有合格系统的特定结束日期。但是，Microsoft保留最终支持免费优惠的权利。从一般可用性，此结束日期将不得超过一年。\n  是的。您不必升级到Windows 11.我们将继续支持Windows 10到2025年10月14日。\n  不可以.Windows 11和Windows 10需要大约相同量的磁盘空间。但是，在升级过程中，需要额外的空间。升级完成后，Windows将在大约10天内清理此额外磁盘空间。\n  Windows 11是最新版本的Windows。但是，我们将继续支持Windows 10至2025年10月。\n  默认情况下，您的所有文件和数据都将传输。但是，我们建议在安装前备份文件。了解有关OnedRive PC文件夹备份的更多信息。 \n如果我不喜欢Windows 11，我可以升级后返回Windows 10吗？\n 是的。安装Windows 11升级后，有一个10天的时间，您可以在保留与您带来的文件和数据的同时返回Windows 10。在10天后，您需要备份数据并进行“清洁安装”以返回到Windows 10。\n  下载和安装Windows 11很可能需要长于典型的Windows 10特征更新。您可以在下载Windows 11时使用PC，然后您可以选择在没有规划使用PC的特定时间时安排安装到特定时间。\n  如果我正在运行S模式，我可以将我的Windows 10 PC升级到Windows 11吗？\n 如果您的PC满足最低硬件规格，则Windows 10在S模式下的Home Edition可以在S模式下升级到Windows 11 Home Edition。如果Windows 10 PC在S模式下运行Pro Edition，则需要切换出S模式以升级到Windows 11 Pro。 Windows 11 Pro Edition在S模式下不可用。\n  您可以使用PC Health Check应用程序来确定您的设备是否有资格升级到Windows 11.多于4岁的许多PC将能够升级到Windows 11.它们必须运行最新版本的Windows 10并满足最低硬件要求。 ", "note_en": "Windows 11 has all the power and security of Windows 10 with a redesigned and refreshed look. It also comes with new tools, sounds, and apps. Every detail has been considered. All of it comes together to bring you a refreshing experience on your PC.\n    It depends! Many different manufacturers will offer a variety of devices that will run Windows 11, all at different price points.\n  PCs that come with Windows 11 pre-installed will be available from a broad selection of retailers later this year. Details to come.\n  If your accessories worked with Windows 10 and meet the Windows 11 requirements, they should work with Windows 11. If you want to be sure, please check with your accessory manufacturer.\n  I want to buy a PC now, will I be able to install Windows 11 later?\n Most Windows 10 PCs currently being sold will be able to upgrade to Windows 11. For the PC to be able to upgrade to Windows 11, it must meet the  minimum hardware specifications and specific hardware is required for some features. The upgrade rollout plan is still being finalized but is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device.\n  There are a few ways to find out. If you’re currently shopping for a new PC look for “Free upgrade to Windows 11” on the fact tag. You can also ask your retail sales professional to confirm.\n  When will I be able to upgrade to Windows 11 on my Windows 10 device?\n If your existing Windows 10 PC is running the most current version of Windows 10 and meets the  minimum hardware specifications it will be able to upgrade to Windows 11. The upgrade rollout plan is still being finalized, but for most devices already in use today, we expect it to be ready sometime in early 2022. Not all Windows 10 PCs that are eligible to upgrade to Windows 11 will be offered to upgrade at the same time. To see if your PC is eligible to upgrade,  download and run the PC Health Check app. Once the upgrade rollout has started, you can check if it is ready for your device by going to Settings/Windows Updates.\n    How do I know if my current Windows 10 PC meets the hardware requirements for Windows 11?\n If you’d like to see if your current PC meets the minimum requirements,  download and run the PC Health Check app.\n  What if my PC doesn’t meet the minimum hardware specifications? Can I stay on Windows 10?\n Yes! Windows 10 continues to be a great version of Windows. We have committed to supporting Windows 10 through October 14, 2025.\n  Upgrades to Windows 11 will begin to roll out late in 2021 and continue into 2022. During this time, we will be doing some behind-the-scenes testing and validating for your specific PC. Windows Update will provide an indication if and when your PC is eligible. You can check by going to Settings/Windows Update.\n  It’s free. But only Windows 10 PCs that are running the most current version of Windows 10 and meet the minimum hardware specifications will be able to upgrade. You can check to see if you have the latest updates for Windows 10 in Settings/Windows Update.\n  An update can consist of bug and security fixes and new features in a version of Windows. They tend to roll out throughout the year. An upgrade is when you change versions—for example, moving from Windows 10 to Windows 11, or moving editions from Windows Home to Windows Pro.\n  The free upgrade offer does not have a specific end date for eligible systems. However, Microsoft reserves the right to eventually end support for the free offer. This end date will be no sooner than one year from general availability.\n  Yes. You do not have to upgrade to Windows 11. We will continue to support Windows 10 until October 14, 2025.\n  No. Windows 11 and Windows 10 require approximately the same amount of disk space. During the upgrade process, however, extra space is required. Windows will clean up this extra disk space about 10 days after the upgrade is complete.\n  Windows 11 is the newest version of Windows. However, we will continue to support Windows 10 until October 2025.\n  By default, all your files and data will transfer. However, we recommend backing up your files before installation.  Learn more about OneDrive PC folder Backup.\n  Can I go back to Windows 10 after I upgrade if I don’t like Windows 11?\n Yes. After you have installed the Windows 11 upgrade, there is a 10-day period where you can move back to Windows 10 while keeping files and data that you brought along with you. After the 10 days, you will need to back up your data and do a “clean install” to move back to Windows 10.\n  Downloading and installing Windows 11 will most likely take longer than a typical Windows 10 feature update. You can use your PC while you’re downloading Windows 11 and then you have the option to schedule the install to happen at a specific time when you aren’t planning on using your PC.\n  Can I upgrade my Windows 10 PC to Windows 11 if I’m running S mode?\n If your PC meets the minimum hardware specifications, the Windows 10 Home edition in S mode can upgrade to the Windows 11 Home edition in S mode. If your Windows 10 PC is running the Pro edition in S mode, you will need to switch out of S mode to upgrade to Windows 11 Pro. Windows 11 Pro edition is not available in S mode.\n  You can use the  PC Health Check app to determine if your device is eligible to upgrade to Windows 11. Many PCs that are less than four years old will be able to upgrade to Windows 11. They must be running the most current version of Windows 10 and meet the minimum hardware requirements.", "posttime": "2021-06-25 01:05:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows", "title": "Windows 11. ", "title_en": "Windows 11", "transed": 1, "url": "https://www.microsoft.com/en-us/windows/windows-11", "via": "", "real_tags": ["windows"]}, {"category": "", "categoryclass": "", "imagename": "d7e53334de86e026bb16c1a28dca4001.jpg", "infoid": 1068042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "悉尼 - 澳大利亚经常被誉为冠状病毒大流行期间最好的地方之一，低案例数，死亡人数低，返回公民和居民的严格检疫系统。\n  但当局说，该国的部分正在进入病毒斗争中最令人担忧的阶段，就像疫苗接种的美国人正在挖掘面具和欧洲正在举行旅行者举行禁令。\n Gladys Berejiklian是悉尼的新南威尔士总理，周四表示，这座城市的高度传染性三角洲变种的爆发意味着它面临着整个大流行的“也许是最可怕的时期”。\n  该集群上周开始与机场豪华轿车司机，并增长到36起案件，其中11例周四宣布。\n  爆发是通过全球标准的爆发，但在一个追求零传播策略的国家的大型交易。甚至单位数日情况的低耐受性使澳大利亚人每次出现群集时经常捕获新限制的周期。\n  缓慢的疫苗接种率加剧了这一斗争，因此澳大利亚最有多个人的城市悉尼的大流行达到了一年，这一周恢复了聚会和运动的恢复限制，就像在美国和欧洲的限制一样易受限制。\n  新南威尔士州议会在立法者对病毒测试阳性后关闭。星期三，乘客不得不在澳大利亚州其他澳大利亚州封闭边境后衡量中空频道或返回悉尼。 \n官员和科学家特别感到困扰，在印度首次检测到的德雷塔变体，从人们传递给人。\n  录像镜头显示豪华轿车司机在购物中心感染陌生人，只通过短暂的联系人在一家咖啡馆中，科学家认为证明可以捕获病毒，只需将与受感染者共享相同的空域。\n   “这使得这种变体极其危险，因为坎德伯里大学的数据建模专家迈克尔·格尔克说，这一变体极为危险，”新西兰坎特伯雷大学的数据建模专家迈克尔。 “只有三个传输链，平均案件会有八倍。因此，当原始变体可能引起10例时，Delta Variant可能会导致80例同时，这会很快使得无法控制而不锁定。“\n  在维多利亚州的墨尔本在那里检测到Delta Variant后，在上个月被锁定。到目前为止，悉尼的当局已停止强加锁定，虽然警方表示，他们会确保人们遵守公共交通的面具佩戴等规则，以及禁止悉尼部分地铁地区旅行的人们。\n “在大流行中，自满没有地方，”Berejiklian告诉记者。 “我对每个公民都有吸引力......我们所有人都必须符合法律信的健康建议。”\n   周三州政府向悉尼的家庭提供了五位游客，更严格的社会疏远规则，以及在室内场地的面具，包括工作场所。\n 新西兰也在警戒，在悉尼人飞到首都，惠灵顿，惠灵顿，并在周末参观餐馆和博物馆度过。在周四，新西兰在一个免费的免费旅行泡沫中延伸了一个新的南威尔士州另外12天。 \n当局在周三的惠灵顿地区在惠灵顿地区收集少于100人，在公共交通上迫使面具。  现在，Plank表示，疫苗接种覆盖率太低，无法对控制任何爆发产生大大差异。 “所以，我们需要非常认真地掌握这种变体的威胁，并采取措施尽可能快地盖出。”  托尼Blakely是墨尔本大学的流行病学家，悉尼有大约一个50-50机会击败爆发而没有锁定。  “每天延迟都意味着如果你需要一个锁定，我认为现在的可能性很可能，它会更长，更难，”他告诉澳大利亚广播公司  当天最重要的新闻故事，由邮政编辑策划并每天早上交付。 ", "note_en": "SYDNEY — Australia is  regularly hailed as one of the  best places to be during the coronavirus pandemic, with low case numbers, comparatively few deaths and a strict quarantine system for returning citizens and residents.\n  But authorities say parts of the country are entering the most worrisome phase of the virus fight, just as vaccinated Americans are  ditching masks and Europe  is lifting bans on travelers.\n Gladys Berejiklian, the premier of New South Wales, home to Sydney, on Thursday said an outbreak of the highly infectious delta variant in the city meant it was facing “perhaps the scariest period” of the entire pandemic.\n  The cluster began last week with an airport limousine driver and has grown to 36 cases, including 11 announced Thursday.\n  The outbreak is minuscule by global standards, but a big deal in a country that has pursued a strategy of zero transmission. The low tolerance for even single-digit daily cases has left Australians frequently caught in cycles of new restrictions every time a cluster emerges.\n  A slow vaccination rate is exacerbating the struggle, so that well over a year into the pandemic, Sydney, Australia’s most populous city, is grappling with  reinstated limits on gatherings and movements this week just as restrictions are easing in the United States and Europe.\n  The New South Wales state parliament was shut down Thursday after a lawmaker tested positive for the virus. On Wednesday, passengers had to weigh midflight whether to enter quarantine or return to Sydney after other Australian states snapped their borders shut.\n Officials and scientists are especially troubled by the apparent ease with which the delta variant, first detected in India, passes from person to person.\n  Video footage shows the limo driver infecting strangers at a shopping mall and in a cafe through only fleeting contact, which scientists say proves it is possible to catch the virus simply from sharing the same airspace as an infected person.\n   “That makes this variant extremely dangerous because of the way cases can grow exponentially,” said Michael Plank, a data-modeling expert at the University of Canterbury in New Zealand. “After just three chains of transmission, there would be eight times as many cases on average. So, where the original variant might have caused 10 cases, the delta variant could cause 80 cases in the same time, which would quickly make it impossible to control without a lockdown.”\n  Melbourne, in Victoria state, was locked down last month after the delta variant was detected there. So far, authorities in Sydney have stopped short of imposing a lockdown, although police said they would ensure people were complying with rules such as mask-wearing on public transportation and a ban on people from parts of Sydney from traveling outside the metro area.\n “In a pandemic, complacency has no place,” Berejiklian told reporters. “I am appealing to every single citizen … all of us must conform to the health advice to the letter of the law.”\n   The state government on Wednesday introduced a limit of five visitors to homes in Sydney, more stringent social distancing rules, and mask-wearing at indoor venues, including workplaces.\n New Zealand is on alert, too, after a Sydney man flew to the capital, Wellington, while infectious, and spent a weekend visiting sites such as restaurants and a museum. On Thursday, New Zealand extended a pause on a quarantine-free travel bubble with New South Wales for another 12 days.\n Authorities limited gatherings in the Wellington region to fewer than 100 people on Wednesday, and masks were made compulsory on public transit.\n Right now, Plank said, vaccination coverage is too low to make much of a difference in controlling any outbreak. “So, we need to take the threat of this variant very seriously, and take the measures needed to stamp it out as quickly as possible.”\n   Tony Blakely, an epidemiologist at the University of Melbourne, said Sydney had about a 50-50 chance of beating the outbreak without a lockdown.\n “Each day you delay means that if you need a lockdown, which I think is more than likely now, it will be longer and harder,” he told the Australian Broadcasting Corp.\n     The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-06-25 01:04:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阶段,enters,悉尼", "title": "领导人说，悉尼将大流行的阶段进入大流行的阶段 ", "title_en": "Sydney enters ‘scariest’ phase of pandemic as delta variant spreads, leader says", "transed": 1, "url": "https://www.washingtonpost.com/world/2021/06/24/sydney-virus-rules-outbreak-australia/", "via": "", "real_tags": ["阶段", "enters", "悉尼"]}, {"category": "", "categoryclass": "", "imagename": "09d0bf66f15295d354854c6e0b9b8f1d.jpg", "infoid": 1068038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows 11将拥有Microsoft团队内置的，以竞标更直接与Apple FaceTime等通信平台进行竞争。 而且像FaceTime一样，这里的关键是跨设备集成，使得服务更加硬件无关，因为人们从桌面移动到移动并再次回来。  在一个时代，当我们有更多的视频聊天平台时比我们知道该怎么做，很难动摇这种感觉，因为我们可能会在公司购买的次要Skype中看到棺材中的最终钉子 2011年以85亿美元。 正如它试图与Skype有关，微软希望将消费者和专业人士与平台的专业人士进行联系。  所有新操作系统的版本都将与直接烘烤的团队直接进入“开始”菜单。 ", "note_en": "Windows 11 will have Microsoft Teams built in, in a bid to compete more directly with communication platforms like Apple’s FaceTime. And like FaceTime, the key here is cross-device integration, making the service more hardware-agnostic as people move from desktop to mobile and back again.\n   In an era when we’ve got more video chat platforms than we know what to do with, it’s hard to shake the feeling that we might be seeing the final nail in the coffin for the once-mighty Skype, which the company bought way back in 2011 for $8.5 billion. As it tried to do with Skype, Microsoft is looking to blur the line between consumers and professionals with the platform.\n All versions of the new operating system will have Teams baked directly into the Start menu.", "posttime": "2021-06-25 00:22:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,microsoft,teams", "title": "Microsoft团队将直接构建到Windows 11中 ", "title_en": "\n\t\t\t\tMicrosoft Teams will be built directly into Windows 11\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/microsoft-teams-will-be-built-directly-into-windows-11/", "via": "", "real_tags": ["windows", "microsoft", "teams"]}, {"category": "", "categoryclass": "", "imagename": "4a37074afa0a3005b4b3af587173ca76.jpg", "infoid": 1068037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，除此之外，很明显，汽车公司将机器人视为未来的主要投资。真正对谈话充满了我的谈话，是三家公司 - 现代，福特和丰田的谈话方式 - 正在接近空间。如果没有别的，那是一个标志，这里有很多机会。\n 我们在几个综述前福特在福特的野心中撰写了相当多的关于，包括与Mario Santillo进行采访，他加入了最近的小组。正如公司最近在密歇根大学投资所证明的那样，福特的方法在很大程度上是基于研究的。该公司希望在技术和人才方面进入地板。然而，当我按下Santillo关于收购时，（特别是因为它与数字制造商，敏捷）而言，他告诉我，“这总是我们正在看的东西。”所以不要统治它，特别是随着其他汽车公司开始在类别中锁定大名。\n   当然，现代是最近记忆中最大的机器人学习之一，在SoftBank组合中的短暂上空之后拿起波士顿动力学（投资公司仍然是股东）。当然，除了公司之后的谷歌时间一直很重要，看到现货商业化和即将出售的延伸。 Hyundai的Ernestine Fu为我们在本周正式关闭的交易中提供更多光线，\n 使用新的地平线工作室，当您将机器人与传统轮式运动相结合时，授权正在重新称解您可以做的事情，如行走机器人和步行车。显然，[波士顿动态]的技术在一起在使这些概念变得享有生命中的关键作用。\n  正如我们所讨论的，丰田研究所在日本衰老人口类别中的兴趣。 EvercareCare构成了公司在机器人中的大部分内容的基础，包括一些家庭机器人研究，它本周展示了它的研究 - 特别是其成像如何处理反射和透明的表面。两者都传统上对机器人系统令人棘手。\n   [I]日本，在20  -  30年内，超过65人的人数大致与65岁以下的人数大致相同。这将在劳动力方面具有一个非常有趣的社会经济影响。它可能会变得更大，我们在丰田在丰田正在寻找这些人们如何继续完成工作，因此他们可以让履行工作或在家里逗留更长。我们不想只是取代人民。我们真的想到我们如何保持以人为本和放大人民。\n  我们现在一直遵循NVIDIA的ISAAC软件，机器人仿真软件可作为开放测试版提供。该软件建立在Omniverse之上，设计用于测试机器人的各种不同的相机和传感器功能。这是一个迷人的项目，并且可能是早期机器人初创公司的大量大量。 \n快速跟进上周从机器人园林美化公司的一些资金，我要求Irobot与他们的Terra Mower发生了什么，这是延迟狂热相关的削减。该公司告诉我，无限延迟机器人仍然没有明确的时间表。\n  与此同时，MISO机器人继续从Flippy中展开，汉堡翻转机器人具有自动饮料分配器。采用饮料分配器制造商Lancer创建的机器，完全自动化该过程，向下添加杯子上的盖子。然而，在产品中没有明确的时间表，但很有趣，可以在特定的部门中分配一些这些公司。\n  一对仓库自动化故事，值得突出显示在这里。 Berkshire Gray推出了一堆新的履行机器人。本公司，\n 这种新一代的移动机器人以更低的成本点提供更高的实现吞吐量，以实现更短的交货时间并支持更大数量的SKU。与固定输送带和早期发电机器人不同，伯克郡灰色的智能车队利用AI的力量来协调数千个移动机器人，以挑选，组织和提供各种客户和商店订单的项目。\n  该公司将与每个机器人制造商同样地告诉您同一件事：这一切都是关于帮助零售商与亚马逊的庞然大物竞争。拟合，电子商务巨头本周也展示了一些新的机器人。亚马逊表示，自公司收购Kiva Systems以自亚马逊机器人翼组成的基础以来，它利用了350,000个移动驱动器单元。该职位导致一些人想知道，尽管有头部开始和一些大规模的资金，但公司是否开始落后于许多侵略性仓库机器人初创公司。\n  本周不是很多资金新闻，但这应该很快改变。热机器人夏天几乎靠我们。我觉得它在空中。同时，请享受此潜水寄生虫，旨在追踪中间骨架“暮光之城”区域的广泛创造者。 Mesobot由树林洞海洋机构开发，旨在观察Zooplankton，凝胶状动物，而不会扰乱他们的栖息地。这是高级科学家Dana Yoerger，\n 我们预计Mesobot将成为观察延长期间的重要工具，以及快速识别从容器生物体验中观察到的物种。因为美孚可以调查，追踪和录制引人注目的图像，我们希望透露以前未知的行为，物种相互作用，形态学结构和生物发光的使用。 ", "note_en": "Beyond that, however, it’s clear that car companies see robotics as a key investment in their future. What really struck me about the conversation, is how differently the three companies – Hyundai, Ford and Toyota – are approaching the space. If nothing else, it’s a sign that there’s plenty of opportunity here.\n We  wrote quite a bit about Ford’s ambitions in the category several roundups ago, including an interview with Mario Santillo, who joined us for the recent panel. As evidenced by the company’s recent investment in University of Michigan, Ford’s approach is largely research-based. The company wants to be in on the ground floor both in terms of technology and talent. Though when I pressed Santillo about acquisitions, however, (specifically as it pertains to Digit-maker, Agility), he told me, “that’s always something we’re looking at.” So don’t rule it of, especially as other car companies begin to lockdown big names in the category.\n   Hyundai, of course, made one of the biggest robotics acquisitions in recent memory, picking up Boston Dynamics after its short stint in the Softbank portfolio (the investment firm remains a shareholder). Of course, that post-Google time has been important for the company, seeing the commercialization of Spot and the  upcoming sale of Stretch. Hyundai’s Ernestine Fu shed some more light for us on the deal,  which officially closed this week,\n With New Horizon Studios, the mandate is reimagining what you can do when you combine robotics with traditional wheeled locomotion, like walking robots and walking vehicles. Obviously the technology that [Boston Dynamics] has put together plays a key role in enabling those sorts of concepts to come to life.\n  As we discussed, the driving force in the Toyota Research Institute’s interest in the category Japan’s aging population. Eldercare forms the basis of much of what the company does in robotics, including some home robotics research that  it showed off this week – specifically how its imaging can handle reflective and transparent surfaces. Both have traditionally been tricky for robotic systems.\n   [I]n Japan, in 20-30 years, the number of people who are over 65 will roughly be the same as the number of people who are under 65. That’s going to have a really interesting socioeconomic impact, in terms of the workforce. It’s probably going to be much older and we at Toyota are looking at how these people can keep doing their jobs, so they can get the fulfillment from doing their jobs or staying at home longer. We don’t want to just replace the people. We really think about how we stay human-centered and amplify people.\n  We’ve been following  NVIDIA’s Isaac software for a while now, and the robotic simulation software  is available as an open beta. Built on top of Omniverse, the software is designed to test a wide range of different camera and sensor capabilities for robotics. It’s a fascinate project and potentially a big deal for early-stage robotics startups.\n Quick follow up to some funding last week from  a robots landscaping company, I asked iRobot what’s going on with their Terra mower, which was delayed amid pandemic-related cuts. The company tells me there’s still no clear timeline for the indefinitely delayed robot.\n  Miso Robotics, meanwhile,  continues to build out from Flippy, the hamburger-flipping robot with an automated beverage dispenser. The machine, created with beverage dispenser manufacturer Lancer, fully automates the process, right down to adding the cap on the cup. No clear timeline on the product yet, however, but it’s fun to see some of these companies branch out in a given sector.\n  A pair of warehouse automation stories worth highlighting here.  Berkshire Grey has unveiled a bunch of new fulfillment robots. Per the company,\n This new generation of mobile robots offers increased fulfillment throughput at a lower cost point to enable shorter delivery times and support a larger number of SKUs. Unlike fixed conveyor belts and early generation mobile robots, Berkshire Grey’s intelligent fleets harness the power of AI to orchestrate tens to thousands of mobile robots to pick, organize, and deliver items for a wide variety of customer and store orders.\n  The company will tell you the same thing as every robotics maker: it’s all about helping retailers compete with the behemoth that is Amazon. Fittingly, the ecommerce giant also showed off  some new robots this week. Amazon says it’s utilized 350,000 mobile drive units since the company acquired Kiva Systems, which formed the foundation for its Amazon Robotics wing. The post has caused  some to wonder whether, in spite of a head start and some massive funding, whether the company is beginning to fall behind a number of aggressive warehouse robotics startups.\n  Not a ton of funding news this week, but that should change soon. Hot bot summer is nearly upon us. I feel it in the air. Meantime,  please enjoy this submersible drone designed to track a wide range of creators in the mesopelagic “twilight” zone. Developed by the Woods Hole Oceanographic Institution,  Mesobot is designed to observe zooplankton, gelatinous animals and more, without disturbing their habitat. Here’s Senior Scientist Dana Yoerger,\n We expect that Mesobot will emerge as a vital tool for observing midwater organisms for extended periods, as well as rapidly identifying species observed from vessel biosonars. Because Mesobot can survey, track, and record compelling imagery, we hope to reveal previously unknown behaviors, species interactions, morphological structures, and the use of bioluminescence.", "posttime": "2021-06-25 00:21:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器,drink,机器人", "title": "你是一个制动机器，饮料 - 接受者，自动化器 ", "title_en": "\n\t\t\t\tYou’re a carmaker, drink-taker, automator\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/robotics-roundup-17/", "via": "", "real_tags": ["机器", "drink", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "a19a1a30d2f2c9814d6e057a0696b876.jpg", "infoid": 1068036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首席产品官Panos Panay称此外，“只是一个令人惊讶的一个，”注意到移动应用程序可以集成到“开始”菜单和任务栏中。 他们还将作为OS的新应用程序放置UI的一部分铺设或“窗口”。  该应用程序将通过Microsoft Store通过Microsoft Store通过Amazon AppStore提供。 该公司强调了在操作系统的演示中运行的Tiktok。 该应用程序以垂直纵向的方向呈现，正如您所期望的移动首先设计。  使用185万Android应用程序，目前有一种方法可以使用一系列新内容泛洪Microsoft App Store  - 并确保最新的流行移动应用程序突然在平台上可用。 虽然时间将讲述最终是多么善于经验（内置于英特尔桥上）。 ", "note_en": "Chief Product Officer Panos Panay called the addition, “just one more small surprise,” noting that the mobile apps can be integrated into the Start menu and taskbar. They’ll also tile or “window” as part of the OS’s new application placement UI.\n   The apps will be available through the Microsoft Store by way of the Amazon Appstore. The company highlighted TikTok running on a demo of the operating system. The app is presented in a vertical, portrait orientation, as you would expect from a mobile-first design.\n With 1.85 million Android apps, it’s currently a way to flood the Microsoft app store with a whole bunch of new content – and make sure the latest popular mobile apps are suddenly available on the platform. Though time will tell how good the experience (built on top of Intel Bridge) ultimately is.", "posttime": "2021-06-25 00:21:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,android,amazon,程序,应用程序", "title": "Android应用程序通过Amazon AppStore来到Windows 11 ", "title_en": "\n\t\t\t\tAndroid apps are coming to Windows 11 through the Amazon Appstore\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/android-apps-are-coming-to-windows-11-through-the-amazon-appstore/", "via": "", "real_tags": ["windows", "android", "amazon", "程序", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "2f2230b7f8ba359ffed644fe509ec8c0.jpg", "infoid": 1068035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这就是为什么传统IPO的S-1申请很棒。 当谈到数字时，他们是诚实的。 备案不包括明年的预测，更不用说未来半十年。 当然，公司将为他们的模型和方法进行音高，但S-1申请与诚实的角度相当不错。 大多。  历史收入？ 谁需要它！ 看看可能，可能，理论上可能发生的增长！ 201％CAGR！  这是来自当地Bounti Spac Investor Deck的超级粒度图像。 这是我能找到的最低模糊的版本。 享受图表！  我要改变这些数字，标记它们“亚历克斯未来的博客输出”并在下次绩效审查之前转动它们。  鉴于我们了解到了关于SPAC性能预测的准确性的内容，我认为我们需要一只哥灵大大小的盐BAE来制造所有这种可口的。 ", "note_en": "That’s why S-1 filings for traditional IPOs are great. When it comes to numbers, they are honest. The filings don’t include forecasts for the next year, let alone the next half decade. Sure, companies will make a pitch for their model and methods, but S-1 filings are pretty good from an honesty perspective.  Mostly.\n   Historical revenue? Who needs it! Look at the growth that could maybe, possibly, theoretically happen! 201% CAGR!\n    Here’s a super-grainy image from the  Local Bounti SPAC investor deck. It’s the least-blurry version I could find. Enjoy the charts!\n  I’m going to change the numbers on these, label them “Alex’s future blogging output” and turn them in before my next performance review.\n      Given  what we’ve learned about the accuracy of SPAC performance predictions, I think we need a Godzilla-sized Salt Bae to make all of this palatable.", "posttime": "2021-06-25 00:21:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "图表,charts,数字", "title": "SPAC图表是炒作限制的练习 ", "title_en": "\n\t\t\t\tSPAC charts are exercises in the limits of hype\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/spac-charts-are-exercises-in-the-limits-of-hype/", "via": "", "real_tags": ["图表", "charts", "数字"]}, {"category": "", "categoryclass": "", "imagename": "afd8ab8cb48a4337206e8ad5ed85deb1.jpg", "infoid": 1068034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "额外的紧缩实时希望回答所有这些问题。到目前为止，Coda的Shishir Mehrotra和Investor S. Sonasegar告诉我们Coda的音高Doc（不是甲板）的唱片。我们听到了从Toast的Aman Narang和BVP的Kent Bennett中痴迷于客户痴迷的重要性。第五墙的Brendan Wallace布置了Prop Tech的所有最大机会。那就是在上个月左右的。\n 7月，我们在名册上拥有更多的顶级发言者，包括大名创始人和经验丰富的投资者。更重要的是，这些扬声器准备好了解您的启动。 ECL具有额外的紧缩现场投入，观众的创始人可以将他们的产品投向扬声器并获得实时反馈。\n  所以没有任何进一步的ADO，这里看看我们在7月加入我们的惊人扬声器。\n   Tusk Vinure Partners的Jordan Nof，联合创始人和普通合伙人，LED在柠檬水，鸟和周日等公司的早期投资。他还投资了由米歇尔·戴夫（Michelle Davey）共同创立的轮子，该公司专注于虚拟护理。在额外的紧缩中与他们一起参加谈话，了解筹集资金并将其用于最大的效果。\n      查看StechCrunch的Startup Alley公司，该公司将在专用于音高艺术的一集中扰乱2021。\n      Sequoia Capital是VC中最大的名字之一。在ECL的这一集上，SemoIa伴侣Sephanie Zhan和Rec Room Ceo Nick Fajt谈到这两个人如何为初创的种子回合聚集在一起，为什么Zhan也领导了A系列A，以及它如何延长了近1.5亿美元的资金。\n    作为提醒，任何想要来闲逛的人都可以访问额外的紧缩活动。但是，只有额外的CRUNCH成员可以访问需求的内容。如果你还是一个额外的紧张成员，你还在等什么？ ", "note_en": "Extra Crunch Live looks to answer all these questions and more. Thus far, Coda’s Shishir Mehrotra and investor S. Somasegar  have told us what sings in Coda’s pitch doc (not deck). We’ve  heard how important it is to be customer-obsessed from Toast’s Aman Narang and BVP’s Kent Bennett. And Fifth Wall’s Brendan Wallace  laid out all the biggest opportunities in prop tech. And that was just in the last month or so.\n In July, we have more top-notch speakers on the roster, including big-name founders and seasoned investors. What’s more, these speakers are ready to hear about your startup. ECL features the Extra Crunch Live Pitch-off, where founders in the audience can pitch their products to speakers and get live feedback.\n  So without any further ado, here is a look at the amazing speakers we have joining us in July.\n   Jordan Nof, co-founder and general partner at Tusk Venture Partners, led early investments in companies like Lemonade, Bird and Sunday. He also invested in Wheel, co-founded by Michelle Davey, an infrastructure company focused on virtual care. Join in a conversation with them on Extra Crunch Live about what it takes to raise funding and use it to the greatest effect.\n      Check out the Startup Alley companies that will exhibit at TechCrunch Disrupt 2021 in an episode dedicated to the art of the pitch.\n      Sequoia Capital is one of the biggest names in VC. On this episode of ECL, Sequoia partner Sephanie Zhan and Rec Room CEO Nick Fajt talk about how the two came together for the startup’s seed round, why Zhan also led the Series A, and how it’s gone on to raise nearly $150 million in funding.\n    As a reminder, Extra Crunch Live is accessible to anyone and everyone who wants to come hang out. However, only Extra Crunch members get access to the  content on-demand. If you’re not already an Extra Crunch member,  what are you waiting for?", "posttime": "2021-06-25 00:21:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "专家,expert", "title": "看看专家演讲者在7月份加入我们的额外紧缩 ", "title_en": "\n\t\t\t\tCheck out the expert speakers joining us on Extra Crunch Live in July\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/check-out-the-expert-speakers-joining-us-on-extra-crunch-live-in-july/", "via": "", "real_tags": ["专家", "expert"]}, {"category": "", "categoryclass": "", "imagename": "b508777ec93280a65219a5c2f5f5e444.jpg", "infoid": 1068033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Chuck Phillips是Meetwell的联合创始人，这是一个能够使团队能够实现更好的工作生活平衡的应用程序，同时通过减少他们参加的糟糕会议的金额来储蓄公司。\n  繁忙的会议组织者驾驶 - 通过时间安排会议，因为他们认为他们没有时间计划。他们希望从少量准备中获得良好的结果，不会发生这种情况。会议正在举行，进步踩踏。\n 拯救每个人的一种方法（并赢得很多朋友）将是为了摆脱所有会议，但是一场精心准备和经营良好的会议可以加快沟通，并让团队更接近其目标。不幸的是，大多数会议都是懒洋洋地策划，跑步，监禁与会者并停止生产力。\n   没有人衡量他们的会议的影响。因此，第一步是开始保持会议指标，以便您可以识别您的团队日历中的糟糕会议。\n  我公司创建了一位日历助理，在发生之前，自动衡量并停止差别会议，但如果您无法自动化在会议结束后从与会者预防会议，调查和学习，以便记录和衡量它们。\n 创建分类法并量化正在举行的会议类型 - 例如：“信息共享”，“头脑风暴”，“1：1”，“决策”等。\n 经过几个月（理想情况地是一年）收集指标，您可以评估质量并寻找模式。你可能会发现这些线条的东西： \n很少有员工拒绝会议，即使是显而易见的是，会议将是一个多泽的。 ", "note_en": "Chuck Phillips is the co-founder of  MeetWell, an application that enables teams to achieve a better work-life balance while saving companies money by reducing the amount of bad meetings they attend.\n  Busy meeting organizers drive-thru schedule meetings because they think they don’t have time to plan. They expect good outcomes to come from little preparation, which doesn’t happen. The meetings are being held and progress is stilted.\n One way to save everyone significant time (and win lots of friends) would be to just get rid of all meetings, but a well-prepared and well-run session can expedite communication and get a team closer to its goals. Unfortunately, most meetings are  lazily planned and poorly run, imprisoning attendees and halting productivity.\n   No one measures the impact of their meetings. So the first step is to start keeping meeting metrics so that you can identify the bad meetings on your teams’ calendars.\n  My company has created  a calendar assistant that automatically measures and stops bad meetings before they occur, but if you can’t automate the prevention of bad meetings, survey and learn from attendees after the meeting to record and measure them.\n Create taxonomies and quantify the types of meetings that are being held — for example: “information sharing,” “brainstorming,” “1:1,” “decision-making,” etc.\n After several months (ideally a year) of collecting metrics, you can grade the quality and look for patterns. You will probably find something along these lines:\n Very few employees decline meetings, even when it’s obvious that the meeting is going to be a doozy.", "posttime": "2021-06-25 00:20:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,创业者,startup,会议", "title": "改革你的创业者的会议文化 ", "title_en": "\n\t\t\t\tReform your startup’s meeting culture\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/reform-your-startups-meeting-culture/", "via": "", "real_tags": ["创业", "创业者", "startup", "会议"]}, {"category": "", "categoryclass": "", "imagename": "5ba7234fa31a1e060c125beaa2e61e1c.jpeg", "infoid": 1068032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它归还新的服务已经确定了如何衡量，现在它的规模升级了风险投资。\n Ryte在今年早些时候在伦敦的慕尼黑和八达通乐队在今年早些时候为其网站用户体验平台之前举行了850万欧元（10米）。\n  它现在推出了“Ryte网站碳KPI”，声称能够通过2023年度帮助使所有网站碳中立的5％。\n Ryte表示，它与数据科学家和环境专家合作，培养能够准确衡量客户网站的碳的影响。根据碳转型Thinktank，Shift项目，我们小工具的碳足迹，互联网和支持他们的系统占全球温室排放的3.7％。而这一趋势随着世界的数字化，尤其是大流行后，这种趋势正在迅速上升。\n Ryte现已从事其数据科学家Katharina Meraner，他在气候科学和全球变暖的博士学位，以及气候合作伙伴的投入，推出这项新服务。\n Ryte首席执行官Andy Bruckschloegl表示：“目前有1.89亿有活跃的网站。我们的目标是占所有活跃网站的5％，或950万个网站，在我们的平台，强大的合作伙伴，社交媒体活动的帮助下，2023年底，气候中立的气候中立。时间是滴答作响，并使网站碳中性与其他行业和流程相比真正简单。“\n Ryte表示，它还与尼加拉瓜圣何塞的重新造林项目合作，让客户通过购买气候证书来抵消其剩余的排放。 \n使用专有算法，Ryte表示它测量整个网站的代码，平均页面大小，以及通道的每月流量，然后产生它使用的CO2量的计算。  允许有类似的服务，但这些是ad-hoc，没有连接到平台。 简单的谷歌搜索将带来WebsiteCarbon，Ecosistant和学术论文等网站。 但据我所知，这样的初创公司还没有将这种服务放入他们的平台上。  “与Ryte合作将有助于提高信息技术如何促进气候变化的认识 - 同时提供有关工具的工具。 Ryte的行业领先的碳计算器使成千上万的网站所有者能够了解他们的碳足迹，以抵消不可避免的碳排放，从而为综合气候行动战略奠定基础，“Tristan A. Foerster，Co-Ceo ClimatePartner。 ", "note_en": "It transpires that a new service has identified how to gauge that, and now it’s raised Venture capital to scale.\n Ryte raised €8.5 million ($10M) in a previously undisclosed round led by Bayern Kapital out of Munich and Octopus Investments out of London earlier this year for its Website User Experience Platform.\n  It has now launched the ‘Ryte Website Carbon KPI’, which claims to be able to help make 5% of all websites carbon neutral by 2023.\n Ryte says it worked with data scientists and environmental experts to develop the ability to accurately measure the carbon impact of client’s websites. According to carbon transition thinktank, the Shift Project, the carbon footprint of our gadgets, the internet, and the systems supporting them accounts for about 3.7% of global greenhouse emissions. And this trend is rising rapidly as the world digitizes itself, especially post-pandemic.\n Ryte has now engaged its Data Scientist, Katharina Meraner, who has a PhD in climate science and global warming, and input from Climate Partner, to launch this new service.\n Andy Bruckschloegl, CEO of Ryte said: “There are currently 189 million active websites. Our goal is to make 5% of all active websites, or 9.5 million websites, climate neutral by the end of 2023 with the help of our platform, strong partners, social media activities, and much more. Time is ticking and making websites carbon neutral is really easy compared to other industries and processes.”\n Ryte says it is also collaborating with a reforestation project in San Jose, Nicaragua, to allow its customers to offset their remaining emissions through the purchase of climate certificates.\n Using a proprietary algorithm, Ryte says it measures the code of the entire website, average page size, as well as monthly traffic by channel then produces a calculation of the amount of CO2 it uses up.\n Admittedly there are similar services but these are ad-hoc and not connected to a platform. A simple Google search will bring us sites like  Websitecarbon,  Ecosistant, and academic papers. But as far as I can tell, a startup like this hasn’t put this kind of service into their platform yet.\n “Teaming up with Ryte will help raise awareness on how information technology contributes to climate change – while at the same time providing tools to make a difference. Ryte’s industry-leading carbon calculator enables thousands of website owners to understand their carbon footprint, to offset unavoidable carbon emissions and thus lay a basis for a comprehensive climate action strategy,” commented Tristan A. Foerster, Co-CEO ClimatePartner.", "posttime": "2021-06-25 00:20:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,launches,网站", "title": "在筹集1000万美元后，Ryte推出了“碳KPI”来测量网站的CO2占地面积 ", "title_en": "\n\t\t\t\tAfter raising $10M, Ryte launches ‘Carbon KPI’ to measure the CO2 footprint of web sites\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/after-raising-10m-ryte-launches-carbon-kpi-to-measure-the-co2-footprint-of-web-sites/", "via": "", "real_tags": ["推出", "launches", "网站"]}, {"category": "", "categoryclass": "", "imagename": "3cfb2b4ae8dc110d1ebee857c4e6eda2.jpg", "infoid": 1068031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管如此，许多公司试图攻击问题以生产可行的数字证明形式，有时称为疫苗护照。对于所有意图和目的，许多呼叫疫苗护照只是证据证明，您可以接种您的智能手机，而不是在钱包中的卡上。\n 有些人有针对性地争论了用于隐私原因的数字方法。其他人声称它是一个公民自由问题，有些人指出了与不平等的适当技术或互联网有关的权益问题。\n  缺乏与开放的道德问题缺乏共识，导致了一些州，包括佛罗里达和格鲁吉亚，至少禁止使用电子护照记录，至少就要求他们进行国家业务或创建集中式疫苗接种记录保存系统。在爱荷华州，总督在上个月签署了法律，禁止企业和国家要求任何证据来访问服务，无论卡是物理还是数字。\n 这些只是国家法律和行政订单拼凑的例子，这导致了试图开发产品来解决这个问题的公司更加复杂。但不是每个国家都禁止数字疫苗接种记录。本月早些时候，加利福尼亚州开通了一个注册系统，要求您的疫苗接种和纽约宣布今年早些时候宣布的系统，以将疫苗接种证明下载到智能手机。稍后更多的方法。\n 我们谈到了几位专家，以便将您的疫苗卡移动到数字世界，以了解如何尽管摩擦明显的摩擦力。\n  根据Shira I. Doron博士的说法，来自波士顿的Tufts Medical Centre，其特色包括传染病和医院流行病学，这并不像可能的声音那么简单。\n 对于她说的初学者，各国没有以一致的方式录制。人们一直在从学校健身房到药房的各种地方接种疫苗，并且如果这些记录已经向人们的初级保健医生做了途径，那就不清楚，假设他们甚至有一个。 \n“[疫苗护照可以起作用]如果[一个系统]从12月15日从12月15日开始那种方式[中央记录牢记] [我们开始接种疫苗]，但并非如此。所以，如果有人接受倒退和发出的证据，也许这样一个可以工作的系统 - 当然还有很多人已经采取了问题的道德，“她说。\n 对她来说，它归结为感染率。随着他们乘坐更多的人接种疫苗，它可以减轻对任何一种证明的需求，因为我们将简单地更安全，因为感染率低于10％。 “我认为，我们更理想地理解，我们达到如此低的感染率和如此高的疫苗接种率，即不再关注人们走进建筑物，”她说。\n   如果感染率仍然高于所需的，或者某些像大学这样想要要求的实体，我们如何在纸卡上提供疫苗接种的证据？有些人指着区块链，但这种方法并非没有争议。纽约州正在使用IBM的区块链技术，以称为Excelsior Pass的疫苗接种证明，但隐私主张担心这样做可能会暴露人们的个人医疗信息。\n 与IBM方法的想法是您要去医生的医疗保健门户或其他有疫苗记录的地方，并与IBM合作。门户网站将向您提供QR码，您可以使用手机和存储在手机的数字钱包中的照片。然后，该人在一个场地呈现QR码，它使用配套扫描应用程序来查看它以查看疫苗接种（或最近的负测试）。最后，场地将验证那个人的身份，辅助ID的辅助形式，如驾驶执照。\n 那么这个问题就是为什么在这种情况下完全使用sloctchain。 IBM Payer和Emerging Business Networks Eric Piscini的全球VP表示，有三个主要原因。 “第一个是，区块链的不可变得非常重要，这是一种[大理由]为什么我们使用它。第二件，这也非常重要的是该平台的分散化，使[所有疫苗数据]不仅仅在一个地方。它由不同的各方分散和管理。 [...]第三件作品是审计道路，而不仅仅是对我为消费者，而是作为一个试图验证我的[实体]，“他解释道。\n  但这些原因足以证明它使用的原理？ Constellation Research的分析师Steve Wilson专门从事最终用户隐私，认为区块链是用于数字疫苗接种的数字证明的不恰当技术。 “基本上，我没有看到区块链如何为Covid疫苗接种或测试的数字化添加任何东西。区块链的目的是关于某些事件的排序和在共享记录中记录该订单的命令源协议。他问道，疫苗接种管理中有什么问题，“他问道。\n  当加州上周发布了数字疫苗接种录制应用程序时，它会使用一个不同的路线，使用称为智能健康卡框架的开源框架。该框架是由称为Commons项目（TCP）的组织开发的，以及广泛的卫生和技术组织联盟，包括Oracle，Microsoft，Salesforce，Epic和其他组织。 \nJP Pollack，Commons Project，Corneld Tech的高级研究员，以及Weill Cornell Medicine的助理教授表示，由于政府明确，因此它不会在中央数据库中编制疫苗记录，因为疫苗管理系统本身是如此碎片化，因此创造数字记录更具挑战性。他的组织正在努力为该问题创建一个解决方案。\n “我们在公共项目上努力的是一个叫做疫苗接种凭证计划或VCI的指导组。该集团的目的基本上是设计和倡导规范，有一天希望一个标准，这使得所有这些疫苗的所有疫苗发行者都可以以签名和便携式格式发出相同的疫苗记录，“他说。\n 这是TCP开发的智能保健卡应用程序的形式。 “我们建造的附加层是将[您的疫苗]信息转变为我们称之为智能保健卡的信息。基本上它是您的CDC卡上的所有信息 - 所以您的名字，您的出生日期，您收到的疫苗类型，您所收到的疫苗，批次数量以及您收到的地方。所有这些类型的东西都会被打包到这个凭证中，然后由发行人签署该凭证，“他说。\n  除加州外，路易斯安那州本周还与公众项目解决方案一起生活，沃尔玛最近宣布通过他们接受疫苗的任何人现在都能够直接将数字版本的疫苗记录直接下载到公共应用程序（可在Android上提供）或ComparIsper应用程序（可在iOS或Android上提供）。本公司还暗示了疫苗所介绍的其他公司将在未来几周举行沃尔玛的领先地位，并通过同一应用程序提供数字记录。\n 该方法并不一定解决围绕公平获取技术，隐私或被要求显示证明疫苗接种的渠道的所有批评，但它确实提供了一种以开放方式为数字提供信息的方法。\n 无论您所在的方法选择，如果它确实选择了任何方法，它将带有自己的专业利弊。作为威尔逊指出的纸张CDC卡，在许多方面都是类似于“黄牌”疫苗接种记录，即海外的人们一直在携带几十年，这项工作罚款。\n 但似乎在2021年，当世界上大约一半的人口拥有智能手机时，三分之二有一些手机，智能或否则，使这个记录以数字形式提供有意义的。对于许多初创公司和大型公司试图解决这个问题，他们将不得不做的是提出聪明的解决方案。他们还需要弄清楚如何说服个人，企业和政府，即甚至提供这种方法是有道理的，这可能是所有人的最大障碍。 ", "note_en": "In spite of that, many companies are attempting to attack the problem to produce a viable form of digital proof, sometimes called vaccine passports. For all intents and purposes, what many call a vaccine passport is simply proof you’ve been vaccinated that you can carry on your smartphone, rather than on a card in your wallet.\n Some have argued against the digital approach  for privacy reasons. Others have claimed it is  a civil liberties issue, and some have pointed  to equity issues related to not having equal access to appropriate technology or the internet.\n  That lack of consensus along with the open ethical questions, has led some states including  Florida and  Georgia to ban the use of electronic passport records, at least as far as requiring them to conduct state business or to create a centralized vaccination record keeping system. In Iowa,  the governor signed a law last month that prohibits businesses and the state from requiring any proof to access services, whether the card is physical or digital.\n These are just a few examples of  the patchwork of state laws and executive orders that has resulted in even more complexity for companies trying to develop products to solve this problem. But not every state is banning digital vaccination records. Earlier this month,  California opened a registration system to request a digital record of your vaccination and New York  announced a system earlier this year to download proof of vaccination to your smartphone. More on these approaches later.\n We spoke to several experts to get their take on moving your vaccine card to the digital world to find out how this could work in spite of the obvious friction.\n  According to Dr. Shira I. Doron from Tufts Medical Center in Boston, whose specialties include infectious diseases and hospital epidemiology, it’s not as simple a matter as may sound.\n For starters she says, states have not kept records in a consistent way. People have been getting vaccinated in all kinds of places from school gyms to pharmacies to stadiums, and it’s not clear if those records have made their way to people’s primary care physicians, assuming they even have one.\n “[Vaccine passports could work] if [a system] had been rolled out that way [with central record keeping in mind] from December 15th [when we started vaccinating], but it was not. So, if somebody takes it on to go backwards and issue that kind of proof to people, maybe a system like that could work — and of course there are a lot of people that have taken issue with the ethics of that,” she said.\n For her, it comes down to infection rates. As they drop with more people getting vaccinated, it could alleviate the need for any kind of proof at all because we would be safer simply because the infection rate fell below 10%. “I think that more ideally we get down to such a low infection rate and such high rate of vaccination that there is no longer a concern about people walking into a building,” she said.\n   If the infection rate remains higher than desirable, or certain entities like universities want to require it, how do we offer proof of vaccination beyond the paper card? Some people are pointing to the blockchain, but the approach isn’t without controversy. New York State is using IBM’s blockchain technology for its proof of vaccination called  Excelsior Pass, but  privacy advocates worry that doing so could expose people’s personal medical information.\n The idea with the IBM approach is that you to go to your physician’s healthcare portal or some other place that has your vaccine records, and which has partnered with IBM. The portal will present you with a QR code which you can take a picture of with your phone and store in your phone’s digital wallet. The person then presents the QR code at a venue, which uses a companion scanning application to view it to see proof of vaccination (or a recent negative test). Finally the venue would verify the identity of that person with a secondary form of ID like a driver’s license.\n The question then is why use the blockchain at all in this instance. IBM Global VP of Payer and Emerging Business Networks Eric Piscini, says that there are three main reasons. “The first is that the immutability of the blockchain is extremely important, and that’s [a big reason] why we use it. The second piece, which is also very important is the decentralization of that platform so that [all of the vaccine data] is not just in one place. It’s decentralized and managed by different parties. […] The third piece […] is the audit trail, and not just for me as a consumer, but as an [entity] that is trying to verify me,” he explained.\n  But are those reasons enough to justify its use? Steve Wilson, an analyst at Constellation Research, who specializes in end user privacy thinks the blockchain is an inappropriate technology to use for digital proof of vaccination. “Basically, I don’t see how blockchain adds anything to the digitizing of COVID vaccinations or tests. The purpose of blockchain is to crowd-source agreement on the ordering of some events, and logging that order in a shared record. What problem in vaccination management does that address,” he asked.\n  When California released a digital vaccination record app last week, it went a different route, using an open-source framework called the  Smart Health Cards Framework. The framework was developed by an organization called  The Commons Project (TCP) along with a broad coalition of health and technology organizations including Oracle, Microsoft, Salesforce, Epic and others.\n JP Pollack, co-founder of The Commons Project, Senior Researcher-in-Residence at Cornell Tech, and Assistant Professor at Weill Cornell Medicine, says that since the government has made clear it won’t be compiling vaccine records in a central database, and because the vaccine administration system itself is so fragmented, it’s even more challenging to create digital records. His organization is working to create a solution to that problem.\n “What we’re working on at  The Commons Project is a steering group called the  Vaccination Credential Initiative or VCI. And the purpose of that group is basically to design and advocate for a specification, someday hopefully a standard, that makes it so that all of those disparate issuers of vaccines can issue the same vaccine record in a signed and portable format,” he said.\n That comes in the form of a Smart Health Card app that TCP has developed. “The additional layer that we have built is what turns [your vaccine] information into what we’re calling the  Smart Health Card. And basically it’s all of the information that goes on your CDC card — so your name, your date of birth, the type of vaccine that you received, the dates of your doses, lot numbers and where you received it. All of those kinds of things get packaged up into this credential, and that credential is then signed by the issuer,” he said.\n  In addition to California, the state of Louisiana also went live with the The Commons Project solution this week, and Walmart recently announced that anyone that received their vaccine through them is now able to download a digital version of their vaccine record directly to the  CommonHealth app (available on Android) or  CommonPass app (available on iOS or Android). The company also hinted that other companies that have administered the vaccine would be following Walmart’s lead in the coming weeks and providing access to digital records through the same apps.\n The approach doesn’t necessarily solve all of the criticisms around equitable access to technology, privacy or the ethics of being asked to show proof vaccination, but it does provide a means to deliver the information digitally for those that want it in an open way.\n Regardless of the method your state chooses, if it indeed chooses any approach at all,  it will come with its own set of pros and cons. The paper CDC card, as Wilson points out, is similar in many ways to the “ Yellow Card” vaccination record that people traveling overseas have been carrying for decades, and that has worked fine.\n But it seems that in 2021 when approximately half the world’s population owns a smartphone, while two-thirds have some sort of mobile phone, smart or otherwise, it makes sense to make this record available in a digital form. For the many startups and large companies trying to solve that problem, they will have to do more than come up with a clever solution. They will also need to figure out how to convince individuals, businesses and governments that it makes sense to even offer this approach, and that may be the biggest hurdle of all.", "posttime": "2021-06-25 00:20:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "导航,navigate,疫苗", "title": "公司导航伦理雷区以建立疫苗接种应用的证明 ", "title_en": "\n\t\t\t\tCompanies navigate ethical minefield to build proof of vaccination apps\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/companies-navigate-ethical-minefield-to-build-proof-of-vaccination-apps/", "via": "", "real_tags": ["导航", "navigate", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "f98c8e8c03efffe977cac4c71e975843.jpg", "infoid": 1068030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft宣布Windows 11将通过Amazon App Store支持Android应用程序！这些应用程序将在本地安装，这意味着它们将在任务栏和开始菜单中显示，而不是要求您的智能手机运行。从Tiktok到Uber的所有您最喜欢的命中率将用于您的Windows  - 使用方便（如果您尚未使用许多这些应用程序＆＃39;基于Web的PC对应物）。\n  Microsoft Didn＆＃39; T＆＃39; Windows 11上的Android应用程序可能由Microsoft＆＃39; SWindows 2.Swindows 2.Swindows 2.这些应用程序提供给Linux 2.。这些应用程序将在Microsoft Store中发现。\n  除此之外，Microsoft还推出了一个全新的Microsoft商店应用程序，专注于Windows上任何应用程序的开放式店面。这包括Win32，UWP，PWA，现在，Android应用程序。 Windows 11预计将运送此秋季，而且在Windows上的Android应用程序支持时，将可向公众提供＆＃39; s。\n  这个Android新闻只是冰山一角，当时从今天到达Windows 11新闻。我们学会了它＆＃39; ll是现有的Windows用户的免费升级，它＆＃39; ll严重借鉴微软团队（可怜的Skype），它＆＃39; ll拥有整个新的生产力工具。据说，这个Android开发被预期，所以它＆＃39;是一个欢迎樱桃，位于已经令人难以置信的操作系统风味的圣代德。\n 但是，即使我们所做的所有公告，它都值得注意的是，一些项目Weren＆＃39; T宣布，例如Windows 11的硬发布日期，＆＃39; LL让人们何时可以抓住操作系统。而且，我们忘记了，也缺乏表面Neo新闻，否则被称为最重要的项目可以＆＃39;你可能已经解决过。\n  阀门＆＃39;基于班级的射手团队堡垒2可能是14岁，但我自己和许多其他人仍然在经常播放。这里看看为什么。\n Microsoft＆＃39;当前版本的Windows上的Windows是Windows 10，这意味着有一天的Windows 11可以推出，对吗？ Microsoft预计将于今年晚些时候为Windows提供大型更新，代号为Sun Valley，据说它带来了一个全新的开始菜单，声音，图标等以及更多的全新用户体验。 \n微软今天宣布了Windows 11。 但是什么时候可以得到它？ 随着Windows内部人士可以很快开始测试两个答案，而普通版本是今年晚些时候。 这是您需要知道的。  即时计算机 - 只需添加屏幕。 这是超便携电脑背后的一般想法，但很难知道你想要哪一个。 放松，我们让你覆盖！ ", "note_en": "Microsoft has announced that  Windows 11 will support Android apps via the Amazon App Store! These apps will be locally installed, meaning they will show up in the Taskbar and Start menu and not require your smartphone to function. All your favorite hits, from TikTok to Uber, will be available for your Windows-using convenience (if you&#39;re not already using many of these apps&#39; web-based PC counterparts).\n  Microsoft didn&#39;t go into much detail, but it&#39;s likely that Android apps on Windows 11 are powered by Microsoft&#39;s Windows Subsystem for Linux 2. These apps will be discoverable in the Microsoft Store.\n  Alongside this news, Microsoft  also unveiled a brand new Microsoft Store app, with a focus on being an open storefront for any app on Windows. This includes Win32, UWP, PWA, and now, Android apps. Windows 11 is expected to ship this fall, and that&#39;s when Android app support on Windows will be made available to the public.\n  This Android news is just the tip of the iceberg when it comes to Windows 11 news from today. We learned it&#39;ll be a  free upgrade for existing Windows users, it&#39;ll heavily feature  Microsoft Teams (poor Skype), and it&#39;ll have a whole host of new  productivity tools. With that being said, this Android development was  not expected, so it&#39;s a welcome cherry on top of the already incredible operating system-flavored sundae.\n However, even with all the announcements we did receive, it&#39;s worth noting that certain items weren&#39;t announced, such as a hard release date for Windows 11 that&#39;ll let people know exactly when they can grab the OS. And, lest we forget, there was also a lack of Surface Neo news, otherwise known as the most important item that could&#39;ve possibly been addressed.\n  Valve&#39;s class-based shooter Team Fortress 2 may be 14 years old, but myself and many others still play it on a frequent basis. Here&#39;s a look at why.\n Microsoft&#39;s current version of Windows on the market is Windows 10, which would imply that one day a Windows 11 could launch, right? Microsoft is expected to ship a large update for Windows later this year, codenamed Sun Valley, that is said to bring with it a brand new user experience with a new Start menu, sounds, iconography, and much more.\n Microsoft has announced Windows 11 today. But when can you get it? There are two answers as Windows Insiders can start testing it very soon, while the general release is later this year. Here is what you need to know.\n Instant computer — just add a screen. That’s the general idea behind the ultra-portable PC, but it can be hard to know which one you want. Relax, we have you covered!", "posttime": "2021-06-25 00:13:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,android,microsoft,程序,宣布", "title": "Microsoft宣布推出Windows 11将能够运行Android应用程序 ", "title_en": "Microsoft Announces Windows 11 Will Be Able To Run Android Apps", "transed": 1, "url": "https://www.windowscentral.com/microsoft-announces-windows-11-will-be-able-run-android-apps", "via": "", "real_tags": ["windows", "android", "microsoft", "程序", "宣布"]}, {"category": "", "categoryclass": "", "imagename": "865ce693e86b5628482afe10d1c95ce5.jpeg", "infoid": 1068029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦 - 英国食品送货公司的股票在U.K.法院裁定其信使是自雇人士的裁定之后飙升9％。\n 从U.K.上诉法院之后举行的独立工人＆＃39;英国联盟对早期判断提出上诉。法院第四次裁定乘客的第四次是自雇人士的第四次，它是亚马逊支持公司的胜利，这一直在努力让骑手归类为独立承包商多年。\n  伦敦证券交易所的股价从伦敦证券交易所的股价升至约2.74英镑，在法院裁决的后面，由三名法官通过一致的协议。在3月份在其市场首次亮相之后，它是送达的。\n 它＆＃39;是一系列法律和监管战斗的最新发展，在所谓的演出经济平台上。今年早些时候，英国＆＃39;最高法院裁定了一群优步和＃39;司机是工人，而不是独立承包商。优步随后决定将所有U..驱动因素重新分类为工人，这导致猜测其他GIG经济应用程序如何受到影响。\n  ＆＃34;我们向骑手的信息很清楚，＆＃34;他们说。 ＆＃34;我们将继续向您努力按照您想要的方式工作，我们将继续倾听您的倾听并回应最重要的事情。＆＃34;\n ＆＃34; Serviceoo＆＃39; S型号提供了真正的灵活性，这些灵活性只能与自营职业兼容，为骑手提供他们告诉我们它们的价值，＆＃34;他们补充道。 ＆＃34;那些举办骑手＆＃39的活动;灵活性不要为绝大多数车手说话，并试图强加一种骑手不想要的工作方式。＆＃34;\n  一些送货员＆＃39;骑手争辩说，他们应该被归类为员工，这将使他们可以获得生病薪酬，假期支付和每小时的福利。 \n但是，交付者认为，承包商模型是一个更好的合适，因为它让骑手在他们想要的时候可以灵活地工作，并且只要他们想要。\n 送达人们表示，在冠状病毒大流行期间，希望在冠状病毒大流行期间注册的人涌入，每周在英国一周内达到16,000个应用，但一些送达骑手在冠心病大流行开始时告诉CNBC，他们正在努力制作足够的钱过车。\n Alex Marshall，IWGB总裁兼前Courier在一份声明中表示，在大流行期间，提供在越来越不公平和不安全的工作条件下工作的贸易司令。\n ＆＃34;他们收到了他们的赫尔科努力的奖励？交付持续投资成千上万的诉讼，沉默工人＆＃39;声音并拒绝他们有机会谈判更好的条款和条件，＆＃34;他说，指出最近由透露骑手的调查新闻局调查，揭示了骑手的每小时只为2英镑。\n ＆＃34;这是那种薪酬工人是否真的是他们自己的老板？看来，当送达灵活性和成为自己的老板时，它正在谈论选择何时在不安全的条件下选择贫困工资的灵活性。判决承认，骑手将受益于组织组织，以代表他们的兴趣，并承认判决中达成的结论可能似乎是令人反感的。＆＃34;\n 独立专业人员和自雇人士的协会警告说，演出的经济处于一个＆＃34;无法立即乱七八糟。\n ＆＃34;我们敦促政府介入并清除演出经济中的混乱，这意味着虽然英国法律明确定义了工人和雇员地位，但仍然没有任何自雇人员的定义， ＆＃34; Andy Chamberlain，IPSE政策总监，在一份声明中。 \n＆＃34;我们相信解决这一目标的唯一方法是向英国法律写一个法定定义 - 不仅要确保应确保应当被归类为工人的人的权利，而且还要保护合法的自由 自雇人士。＆＃34; ", "note_en": "LONDON — Shares of British food delivery firm  Deliveroo surged over 9% Thursday after  a U.K. court ruled that its couriers are self-employed.\n The ruling from the U.K. Court of Appeal came after the Independent Workers&#39; Union of Great Britain appealed against an earlier judgement. It&#39;s the fourth time a court has ruled Deliveroo riders are self-employed and it&#39;s a win for the  Amazon-backed company, which has been fighting to keep its riders classed as independent contractors for years.\n  Deliveroo&#39;s share price on the London Stock Exchange climbed from £2.51 to around £2.74 by the close, on the back of the court ruling, which was passed down by three judges who were in unanimous agreement. It comes after  Deliveroo&#39;s stock tanked in its market debut in March.\n It&#39;s the latest development in a series of legal and regulatory battles over so-called gig economy platforms. Earlier this year, Britain&#39;s Supreme Court  ruled that a group of Uber&#39;s drivers were workers, rather than independent contractors. Uber subsequently decided to  reclassify all of its U.K. drivers as workers, which led to speculation as to how other gig economy apps could be affected.\n  &#34;Our message to riders is clear,&#34; they said. &#34;We will continue to back your right to work the way you want and we will continue to listen to you and respond to the things that matter to you most.&#34;\n &#34;Deliveroo&#39;s model offers the genuine flexibility that is only compatible with self-employment, providing riders with the work they tell us they value,&#34; they added. &#34;Those campaigning to remove riders&#39; flexibility do not speak for the vast majority of riders and seek to impose a way of working that riders do not want.&#34;\n  Some of Deliveroo&#39;s riders argue that they should be classified as employees, which would give them access to benefits like sick pay, holiday pay and an hourly rate.\n But Deliveroo argues that the contractor model is a better fit as it gives riders the flexibility to work when they want, and for as long as they want.\n Deliveroo said it has seen an influx of people who want to sign up as riders during the coronavirus pandemic, with up to 16,000 applications a week across the U.K. However, some Deliveroo riders  told CNBC at the start of the coronavirus pandemic they were struggling to make enough money to live off.\n Alex Marshall, IWGB president and former courier, said in a statement that Deliveroo couriers have been working under increasingly unfair and unsafe working conditions during the pandemic.\n &#34;The reward they have received for their Herculean effort? Deliveroo continuing to invest thousands of pounds in litigation to silence workers&#39; voices and deny them the opportunity to negotiate better terms and conditions,&#34; he said, pointing to a recent investigation by the Bureau of Investigative Journalism which revealed riders were making as little as £2 per hour.\n &#34;Is this the kind of pay workers would accept if they really were their own boss? It appears that when Deliveroo talk about flexibility and being your own boss, it is talking about the flexibility of choosing when to make poverty wages and work in unsafe conditions. The judgment recognizes that riders would benefit from organizing collectively to represent their interests and admits the conclusion reached in the judgment might seem counter intuitive.&#34;\n The Association of Independent Professionals and the Self-Employed warned that the gig economy was in  an &#34;untenable mess.\n &#34;We urge government to step in and clear the confusion in the gig economy, which arises from the fact that while U.K. law clearly defines worker and employee status, there is still no definition of what it is to be self-employed,&#34; said Andy Chamberlain, director of policy at IPSE , in a statement.\n &#34;We believe the only way to resolve this is to write a statutory definition of self-employment into UK law – not only to secure the rights of people who should properly be classed as workers, but also to protect the freedom of legitimately self-employed people.&#34;", "posttime": "2021-06-25 00:12:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法院,court,骑手", "title": "英国上诉规则颁发的法院提供联盟挑战后自雇人士，法院第四次裁定派遣的青睐 ", "title_en": "UK Court of Appeal rules Deliveroo couriers are self-employed after a union challenge, the fourth time a court has ruled in Deliveroo's favor", "transed": 1, "url": "https://www.cnbc.com/2021/06/24/deliveroo-stock-surges-after-court-rules-riders-are-self-employed.html", "via": "", "real_tags": ["法院", "court", "骑手"]}, {"category": "", "categoryclass": "", "imagename": "8ea1339dff46ea59516acb68890d41d5.jpg", "infoid": 1068028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "B2B EDTECH Startup ClassPlus在其Tiger Global的C轮系列中达到了6500万美元。 GSV Ventures，Falcon Edge的AWI，Blume Ventures和RTP Global也参加了这一轮。\n 这是Noida的第四轮资金在过去的15个月内由Noida的公司提出。 Sequoia Capital的激增，时代互联网和BCCI总裁Sourav Ganguld也在以前的一轮投资本公司。\n Entrackr分别在6月和4月分别在ClassPlus系列C中的虎全球和GSV企业的即将到来的投资。\n 虽然ClassPlus没有透露其估值，但您知道发展的消息人士在2亿美元的价格下挂钩。根据FIntrackr的估计，当它提出了GSV Ventures的第一个Tanche Count的第一个Tanche的估值约为1.4亿美元。\n 新的收益将用于扩张，跨越工程，运营和业务发展的兴趣升高。\n 2018年由Mukul Rustagi和Bhaswat Agarwal成立，ClassPlus允许导师通过全堆叠移动解决方案运行他们所有的教练，通信，评估，付款和学生参与计划。\n 该公司还使教育工作者销售其在线课程，以在其地方以外的业务发展。 \n自成立以来，普拉普普普普普普尔兹声称在1,500个城市的1万卢比辅导员上数字化了，服务于2000万学生。 据该公司介绍，超过80％的用户群来自一级二级和三世城市。  这是Tiger Global在2021年的Semotia支持初创公司的第11次投资。本周早些时候，纽约基金会在Fintech Startup Progcap中联合领导了2500万美元。 完整列表包括Kutumb，APNA，Moglix，Groww，Cred，Innovaccer，Gomechanic，Plum和Coinswitch Kuber。  Bareback Media最近从一群投资者筹集资金。 一些投资者可以直接或间接参与竞争业务，或者可能与我们可能会写的其他公司相关联。 但是，这不应以任何方式影响我们的报告或覆盖范围。 您可以在这里找到我们投资者的列表。 ", "note_en": "B2B edtech startup Classplus has raked in $65 million in its Series C round led by Tiger Global. GSV Ventures, Falcon Edge’s AWI, Blume Ventures and RTP Global also participated in the round.\n This is the fourth round  of funding raised by the Noida-based company in the last 15 months. Sequoia Capital’s Surge, Times Internet and BCCI President Sourav Ganguly also invested in the company in its previous round.\n Entrackr  had exclusively reported about the upcoming investment from   Tiger Global  and   GSV Ventures  in Classplus’ Series C round in June and April, respectively.\n While Classplus did not disclose its valuation, sources aware of the development pegged it in the range of $200 million. According to   Fintrackr ’s estimates, it was valued at around $140 million when it raised the   first tranche  of Series C round led by GSV Ventures.\n The fresh proceeds will be deployed towards expansion, ramping up hiring across engineering, operations and business development.\n Founded by Mukul Rustagi and Bhaswat Agarwal in 2018, Classplus allows tutors to run all their coaching, communication, assessments, payments, and student engagement programmes through a full-stack mobile solution.\n The company also enables educators to sell their online courses to grow their business outside their localities.\n Since its inception, Classplus claims to have digitised over 1 lakh tutors across 1,500 cities serving 20 million students. According to the  company, over 80% of its user base comes from tier II and III cities.\n This is the 11th investment by Tiger Global in a Sequoia-backed startup in 2021. Earlier this week, the New York-based fund had co-led a   $25 million round  in fintech startup Progcap. The full list includes Kutumb, Apna, Moglix, Groww, CRED, Innovaccer, GoMechanic, Plum and Coinswitch Kuber.\n          Bareback Media has recently raised funding from a group of investors. Some of the investors may directly or indirectly be involved in a competing business or might be associated with other companies we might write about. This shall, however, not influence our reporting or coverage in any manner whatsoever. You may find a list of our investors     here.", "posttime": "2021-06-25 00:12:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "学习材料,online", "title": "基于印度的大众，让教练中心接受费用并在线提供学习材料，筹集了$ 65M系列C，消息人士称以200万美元的估价 ", "title_en": "India-based Classplus, which lets coaching centers accept fees and deliver study materials online, raises $65M Series C, sources say at a $200M valuation", "transed": 1, "url": "https://entrackr.com/2021/06/classplus-announces-65-mn-series-c-led-by-tiger-global/", "via": "", "real_tags": ["学习材料", "online"]}, {"category": "", "categoryclass": "", "imagename": "7727bd07d5fe41eae17ce17ad8ce8e63.png", "infoid": 1068027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft将Android应用程序带到Windows 11.软件巨头在今天的特殊Windows活动期间揭示了它的惊喜。 Android应用程序将在Windows 11上自然运行，将通过操作系统中包含的新Windows商店从Amazon的AppStore下载。\n 微软表示，它使用Amazon的AppStore将Android应用程序带到Windows 11.应用程序将列在新的Windows商店中，Microsoft也与英特尔合作，使用其英特尔桥技术来实现这一现实。 Windows 11上的Android应用程序可以固定到任务栏或搭配传统的Windows应用程序。\n   Windows 11上的Android应用程序是Apple与其M1芯片的进步的显而易见的答案，并在MacOS上运行iOS应用程序。虽然有许多Web等同物到移动应用程序，但它们通常乏味，以及Snapchat，Ring，Venmo，Roomba等某些应用程序在Web上没有任何内容。\n Microsoft演示了今天在Windows 11上运行的Tiktok这样的应用程序。 Microsoft显示的Windows商店显示了Lists Ring，Yahoo，Uber等，所以我们可能会看到亚马逊的AppStore完全访问。它没有立即清除有多少现有设备将支持Windows 11的Android应用程序，因为硬件需要支持英特尔桥技术。\n   此令人惊讶的声明遵循Microsoft的原始计划让Windows开发人员在2015年为Windows返工其现有的Android应用程序。项目Astoria在Microsoft标记它时，是一种尝试说服开发人员来搬迁到端口应用程序的方法，并使其更容易这样做。该计划最终分开了不到一年后，微软承认拥有“两座桥梁技术将代码从移动操作系统带到Windows的窗口。”\n Microsoft多年来一直在玩弄Android应用程序在Windows上运行Android应用程序的想法，并且该公司一直在尝试在Windows 10推出之前在Windows Store中列出的Android应用程序。相反，微软推动前方试图说服开发人员采用失败的通用Windows平台。\n Android应用程序集成直接进入Windows是一个重要的班次，特别是由于公司一直很有利于您的手机作为桥接Android和Windows之间的差距的方法。 Microsoft多年来一直在拥有Android作为移动版Windows的移动版本，现在那些相同的移动应用程序将直接在Windows 11中运行。 ", "note_en": "Microsoft is bringing Android apps to Windows 11. The software giant revealed its surprise Windows 11 addition during its special Windows event today. Android apps will run natively on Windows 11 and will be downloadable from Amazon’s Appstore, via the new Windows Store that’s included in the operating system.\n Microsoft says it’s using Amazon’s Appstore to bring Android apps to Windows 11. Apps will be listed in the new Windows store, and Microsoft is also partnering with Intel to use its Intel Bridge technology to make this a reality. Android apps on Windows 11 can be pinned to the taskbar or snapped alongside traditional Windows apps.\n   Android apps on Windows 11 are an obvious answer to Apple’s progress with its M1 chips and running iOS apps on macOS. While there are many web equivalents to mobile apps, they’re often lackluster, and certain apps like Snapchat, Ring, Venmo, Roomba, and the majority of home automation apps aren’t available on the web.\n Microsoft demonstrated apps like TikTok running on Windows 11 today. The Windows store that Microsoft showed lists Ring, Yahoo, Uber, and others, so we’ll likely see full access to Amazon’s Appstore. It’s not immediately clear how many existing devices will support Android apps with Windows 11, as hardware will need to support Intel Bridge technology.\n   This surprise announcement follows Microsoft’s original plans to  let Windows developers rework their existing Android apps for Windows in 2015. Project Astoria, as Microsoft labeled it, was a method to try to convince developers to port apps and make it easier to do so. The plan eventually fell apart less than a year later, with  Microsoft admitting that having “two bridge technologies to bring code from mobile operating systems to Windows was unnecessary.”\n Microsoft has been  toying with the idea of running Android apps on Windows natively for years, and the company had been experimenting with the idea of listing Android apps in the Windows Store just ahead of the Windows 10 launch. Instead, Microsoft pushed ahead trying to convince developers to adopt its  failed Universal Windows Platform.\n Android app integration directly into Windows is a significant shift, especially as the company has been  favoring Your Phone as the method to bridge the gap between Android and Windows. Microsoft has been  embracing Android as the mobile version of Windows for years, and now those same mobile apps will run directly in Windows 11.", "posttime": "2021-06-25 00:11:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,android,amazon,微软,microsoft", "title": "微软表示它通过Amazon的App Store将Android应用程序带到Windows 11 ", "title_en": "Microsoft says it is bringing Android apps to Windows 11 through Amazon's app store", "transed": 1, "url": "https://www.theverge.com/2021/6/24/22548428/microsoft-windows-11-android-apps-support-amazon-store?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["windows", "android", "amazon", "微软", "microsoft"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天我们很高兴地宣布新的Micro API云平台，现在在测试版中。用于日常使用的简单，快速和实惠的API。免费注册（不需要信用卡），并获得5美元的免费信用额度。\n     Micro已经从一个开源框架演变为一个完整的API平台，一个继续关注开发人员体验的一个。我们的大多数用户正在为最终公共消费构建API，但不得不重建他们所需要的许多构建块。\n 我们希望通过提供一系列可编程的构建块服务来解决这一问题，作为从世界任何地方的公共消费的简单API，都在一个地方。\n  缓存 - 短份键值存储 - 存储最大1MB的任何数据以快速关键的查找。将TTL设置为过期条目，因此您不必记住删除它们。\n  DB  - 简单数据库服务 - 通过API使用CRUD并将SQL留在后面。一个非常死的简单数据库服务，提供了JSON文档存储。\n  Crypto  -  Cryptocurrency价格和报价 - 及时了解比特币，Ethereum，Dogecoin等价格。实时跟踪它们并在顶部构建任何类型的可视化。\n  图像 - 上传，调整大小和裁剪图像 - 上传图像，在飞行中调整大小并通过CDN服务，而无需执行任何东西，而不是卷曲我们的API。 \nOTP  - 一次性密码生成 - 一次性指示密码并使用一个时间令牌生成来登录或验证用户。简单的OTP生成和验证。\n  路由 - 转弯方向和ETAS  - 一个完全更便宜的谷歌地图API由OSRM提供支持。我们将通过转向路由方向和eta，使用OpenStreetMap数据转动。\n  此外，我们与第三方API提供商合作，例如细则，交换API和WeatherAPI，为货币转换，股票价格和天气预报等平台带来更多功能，因此您只需访问一个帐户和一个帐户所需的一切API键，所有在一个地方。我们每天都在增加越来越多的第三方API提供商，所以让你的眼睛去皮！\n  AWS是天空中的云巨人我们都来知道API积木的定义，但随着时间的推移，它的复杂性也在增长，使其成为开发人员越来越困难。我们看到了这一点，我们觉得这一点，我们知道需要改变。\n 通过执行以下操作，微量尝试删除营销Spiel，云复杂性和无底计费：\n   API文档提供了示例和用法以及在端点旁边的定价一起使用\n        我们将向您的帐户添加5美元的免费信用才能开始，但只需充值即可充值 \n然后刚刚到令牌页面创建自己一个很好的令牌供外部使用  卷曲＆＃34; https：//api.m3o.com/v1/id/genere&&#34; \\ -H＆＃34;内容类型：应用程序/ JSON＆＃34; \\ -h＆＃34;授权：持票人$ micro_api_token＆＃34; \\ -d＆＃39; {＆＃34;类型＆＃34 ;:＆＃34;雪花＆＃34;}＆＃39;  希望您能够购买我们所谈论的内容以及对API空间中的新事物的需求。如果您喜欢您的听力，请免费注册或向我们发送一些反馈。 如果您有任何疑问，请伸出松弛或推特。 ", "note_en": "Today we’re excited to announce our new  Micro API cloud platform, now in beta. Simple, fast and affordable APIs for everyday use.  Signup for free (no credit card needed) and get $5 of free credit to get started.\n     Micro has evolved from an open source framework to a full blown API platform, one that’s continues to focus on the developer experience first and foremost. The majority of our users are building APIs for end public consumption but having to rebuild many of the building blocks they need wherever they go.\n We wanted to solve that problem by providing a set of programmable building block services as simple APIs for public consumption from anywhere in the world, all in one place.\n  Cache - Ephemeral key-value storage - Store any data up to 1mb for fast key based lookup. Set TTLs to expire entries so you don’t have to remember to delete them.\n  DB - Simple database service - Use CRUD via an API and leave the SQL behind. A really dead simple database service which provides JSON document storage.\n  Crypto - Cryptocurrency prices and quotes - Stay up to date with bitcoin, ethereum, dogecoin and other prices. Track them in real time and build any sort of visualisation on top.\n  Image - Upload, resize and crop images - Upload images, resize on the fly and serve them via a CDN all without having to do anything more than curling our API.\n  OTP - One time password generation - Throwaway the passwords and use one time token generation to login or authenticate users. Simple OTP generation and validation.\n  Routing - Turn by turn directions and etas - A vastly cheaper Google Maps API alternative powered by OSRM. We’ll give you turn by turn routing directions and etas using OpenStreetMap data.\n  Additionally we’ve partnered with third party API providers such as  Finage,  ExchangeRate-API and the  WeatherAPI to bring more functionality to the platform like  Currency conversion,  Stock prices and  Weather forecasts, so you can access everything you need with just one account and one API key, all in one place. We’re adding more and more third party API providers everyday so keep your eyes peeled!\n  AWS is the cloud giant in the sky we’ve all come to know as the definition of API building blocks but over time it’s complexity has also grown, making it more and more difficult to work with as a developer. We see this, we feel this and we know there needs to be a change.\n Micro attempts to remove the marketing spiel, cloud complexity and bottomless billing by doing the following:\n   API docs provide examples and usage along with the pricing clearly next to the endpoint\n        We’ll add $5 free credit to your account to start but just top-up with however much you need\n    Then just head to the token page to create yourself a well scoped token for external use\n     curl &#34;https://api.m3o.com/v1/id/Generate&#34; \\ -H &#34;Content-Type: application/json&#34; \\ -H &#34;Authorization: Bearer $MICRO_API_TOKEN&#34; \\ -d &#39;{&#34;type&#34;: &#34;snowflake&#34;}&#39;\n  Hopefully you buy into what we’re talking about and the need for something new in the API space.If you like what you’re hearing,  Signup for Free or send us some  feedback. Reach out on  slack or  twitter if you have any questions.", "posttime": "2021-06-25 00:10:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "用于,apis,api", "title": "用于日常使用的微型API ", "title_en": "Micro APIs for Everyday Use", "transed": 1, "url": "https://blog.m3o.com/2021/06/24/micro-apis-for-everyday-use.html", "via": "", "real_tags": ["用于", "apis", "api"]}]