[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2月23日（路透社）-推特（TWTR.N）周三表示，它错误地暂停了大约12个发布俄罗斯军事行动的账户，并表示这一行动不是由于协调的机器人行动或其他用户对账户的大规模报告。\n&#34;我们&#39；我们一直在积极监测违反我们政策的新叙述，在这种情况下，我们对一些错误的叙述采取了执法行动，&#34；Twitter发言人在一份声明中说&#34;我们&#39；重新迅速审查这些行动，并已主动恢复对多个受影响账户的访问&#34;\n这位Twitter发言人表示，这一错误行为是基于其针对合成媒体和被操纵媒体的规定。\n乌克兰于周三宣布进入紧急状态，并告诉其在俄罗斯的公民逃离，而莫斯科则开始撤离其基辅大使馆，这是乌克兰人最新的不祥迹象，他们担心俄罗斯的全面军事打击。阅读更多\n推特&#39；公司网站完整性负责人约尔·罗斯（Yoel Roth）在推特上表示，公司正在密切调查发生的事情，但表示大规模报道不是一个因素&#34;我们不会根据报告量触发自动强制执行，这完全是因为这很容易被玩弄，&#34；他说。", "note_en": "Feb 23 (Reuters) - Twitter  (TWTR.N) said on Wednesday it had mistakenly suspended around a dozen accounts that were posting about Russian military movements, and said the action was not due to a coordinated bot campaign or mass reporting of the accounts by other users.\n &#34;We&#39;ve been proactively monitoring for emerging narratives that are violative of our policies, and, in this instance, we took enforcement action on a number of accounts in error,&#34; a Twitter spokesperson said in a statement. &#34;We&#39;re expeditiously reviewing these actions and have already proactively reinstated access to a number of affected accounts.&#34;\n The Twitter spokesperson said the erroneous action had been based on its rules against synthetic and manipulated media.\n Ukraine declared a state of emergency on Wednesday and told its citizens in Russia to flee, while Moscow began evacuating its Kyiv embassy in the latest ominous signs for Ukrainians who fear an all-out Russian military onslaught.  read more\n Twitter&#39;s head of site integrity, Yoel Roth, tweeted that the company was closely investigating what had happened but said mass reporting was not a factor. &#34;We do not trigger automated enforcements based on report volume, ever, exactly because of how easily gamed that would be,&#34; he said.", "posttime": "2022-02-25 09:00:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,表示,accounts", "title": "Twitter表示，它错误地暂停了十几个关于俄罗斯在乌克兰边境附近军事行动的账户，并恢复了一些账户", "title_en": "Twitter says it mistakenly suspended around a dozen accounts posting about Russian military movements near the Ukrainian border, and reinstates some accounts", "transed": 1, "url": "https://www.reuters.com/world/twitter-says-it-mistakenly-took-down-accounts-posting-russian-military-2022-02-23/", "via": "", "real_tags": ["俄罗斯", "表示", "accounts"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074780, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乌克兰&#39；美国国家通信和信息保护局表示，一些政府网站和银行正在处理&#34；大规模DDoS攻击#34；该国正在为俄罗斯支持的军队的潜在入侵做准备。\n外交部、国防部、内政部、安全局（SBU）和内阁的网站都面临着被国家特别通信和信息保护局（State Service of Special Communications and Information Protection）和Netblocks——一个追踪全球互联网中断的组织——确认的中断。\n⚠️ 确认：#乌克兰#39；乌克兰外交部、国防部、内政部、乌克兰安全局和内阁网站刚刚受到网络中断的影响；该事件似乎与最近的DDOS攻击一致📉  照片。啁啾com/EVyy7mzZRr\n-NetBlocks（@NetBlocks）2022年2月23日\n乌克兰最大的商业银行PrivatBank和乌克兰国家储蓄银行Oschadbank也都处理过停电问题。\n&#34;我们&#39；我本周看到的DDoS活动比上周多，但不到一个月前。乌克兰有针对个别网站的攻击，这些攻击具有破坏性，&#34；Cloudflare发言人说。\n&#34;到目前为止，与大型DDoS攻击相比，它们相对温和；我过去处理过&#34;\n&#34;如今，一些政府和银行机构的网站再次遭受大规模DDoS攻击。一些被攻击的信息系统不可用或间歇性工作。这是因为将通信量切换到另一个提供商以将损害降至最低。其他网站有效抵御攻击并正常工作&#34；特别通信和信息保护局在一份声明中说。\n&#34;目前，乌克兰国家特别通信和信息保护局以及国家网络安全系统的其他主体正在打击攻击、收集和分析信息。我们要求所有受到攻击或怀疑受到攻击的当局联系政府计算机应急响应团队CERT-UA&#34;\n当天晚些时候，ESET的研究人员发现了乌克兰使用的一种新的数据雨刷恶意软件。据称，ESET遥测显示，雨刮器安装在数百台机器上。\n&#34;雨刮器滥用EaseUS分区主软件的合法驱动程序，以破坏数据。作为最后一步，雨刮器重新启动计算机，&#34；ESET说。\n&#34;在其中一个目标组织中，雨刮器是通过默认（域策略）GPO丢弃的，这意味着攻击者可能已经控制了Active Directory服务器&#34;\n雨刮器二进制文件使用发给Hermetica Digital Ltd 3/n pic的代码签名证书进行签名。啁啾com/sGCl3Lbqc1\n-ESET研究（@ESETresearch）2022年2月23日\n正如许多人在网上指出的那样，袭击开始于当地时间下午4点左右，就在乌克兰&#39；美国议会开始讨论紧急状态声明。乌克兰政府批准了为期30天的紧急状态，因为美国和北约都警告说，俄罗斯可能会入侵乌克兰。俄罗斯军队在过去两天里进入了该国东部地区。\n乌克兰记者报道说，议会主席罗斯兰·斯特凡丘克说，他和他的家人多次遭到网络攻击。据《基辅独立报》记者阿纳斯塔西娅·拉帕蒂娜称，黑客据称试图进入他们的电子邮件账户，阻止他们访问银行账户等。\n上周，许多相同的网站在一系列DDoS事件中遭到攻击，美国将其归咎于俄罗斯。英国外交、联邦和；发展办公室补充说，俄罗斯主要情报局（GRU）参与了这次袭击。\nCyber Anne Neuberger的美国副国家安全顾问告诉媒体，他们有技术信息显示&#34；GRU基础设施向乌克兰的IP地址和域传输大量通信&#34;\n在对DDoS事件的详细分析中，CERT-UA表示，攻击涉及Mirai和Meris僵尸网络，并包括一个补充的短信虚假信息活动。\n美国CYBERCOM国际网络战团队前负责人克里斯蒂安·索伦森（Christian Sorensen）表示，这些攻击旨在增加关注和压力。\n&#34;它没有&#39；听起来还没什么影响。在未来几小时/几天里，我预计会有更多孤立和扰乱乌克兰公民的活动，尤其是政府活动；索伦森说，他现在是网络安全公司SightGain的首席执行官。\n&#34;这一阶段的目的是在政府和经济中造成混乱和怀疑。下一阶段将产生影响，并继续威慑其他国家参与进来&#34;", "note_en": "Ukraine&#39;s State Service of Special Communications and Information Protection  said a number of government websites and banks are dealing with a &#34;massive DDoS attack&#34; as the country prepares for a potential invasion by Russian-backed forces.\n The websites for the Ministry of Foreign Affairs, Ministry of Defense, Ministry of Internal Affairs, Security Service (SBU) and Cabinet of Ministers all faced outages confirmed both by the State Service of Special Communications and Information Protection and Netblocks, an organization tracking internet outages around the world.\n ⚠️ Confirmed:  #Ukraine&#39;s Ministry of Foreign Affairs, Ministry of Defense, Ministry of Internal Affairs, the Security Service of Ukraine and Cabinet of Ministers websites have just been impacted by network disruptions; the incident appears consistent with recent DDOS attacks 📉  pic.twitter.com/EVyy7mzZRr\n— NetBlocks (@netblocks)  February 23, 2022\n PrivatBank, the largest commercial bank in Ukraine, and Oschadbank, the State Savings Bank of Ukraine, both  dealt with outages too.\n  &#34;We&#39;ve seen more DDoS activity this week than last week, but less than a month ago. There have been attacks against individual websites in Ukraine which have been disruptive,&#34; a Cloudflare spokesperson said.\n &#34;So far they have been relatively modest compared to large DDoS attacks we&#39;ve handled in the past.&#34;\n  &#34;Today, websites of a number of government and banking institutions have undergone a massive DDoS attack again. Some of the attacked information systems are not available or work intermittently. This is due to switching traffic to another provider to minimize damage. Other websites effectively resist the attack and work normally,&#34; the Service of Special Communications and Information Protection said in a statement.\n &#34;Currently, the State Service of Special Communications and Information Protection of Ukraine and other subjects of the national cybersecurity system are working on countering the attacks, collecting and analyzing information. We ask all authorities that have been attacked or are suspected to have been attacked to contact the Government Computer Emergency Response Team  CERT-UA.&#34;\n Later in the day, researchers at ESET  discovered a new data wiper malware used in Ukraine. ESET telemetry allegedly showed that the wiper was installed on hundreds of machines.\n &#34;The wiper abuses legitimate drivers from the EaseUS Partition Master software in order to corrupt data. As a final step the wiper reboots the computer,&#34; ESET said.\n &#34;In one of the targeted organizations, the wiper was dropped via the default (domain policy) GPO meaning that attackers had likely taken control of the Active Directory server.&#34;\n The Wiper binary is signed using a code signing certificate issued to Hermetica Digital Ltd 3/n  pic.twitter.com/sGCl3Lbqc1\n— ESET research (@ESETresearch)  February 23, 2022\n As many have  noted online, the attack began around 4pm local time, right as Ukraine&#39;s parliament began to discuss a state of emergency declaration. The 30-day state of emergency was approved by the Ukrainian government as both US and NATO warned that  a Russian invasion is likely. Russian forces  moved into eastern parts of the country over the last two days.\n Ukrainian journalists  reported that Ruslan Stefanchuk, the chairman of parliament, said he and his family were repeatedly hit with cyberattacks. Hackers allegedly attempted to get into their email accounts, block access to their bank accounts and more, according to Kyiv Independent reporter Anastasiia Lapatina.\n Many of the same websites were  attacked last week in a series of DDoS incidents that the US  attributed to Russia. The UK Foreign, Commonwealth &amp; Development Office  added that the Russian Main Intelligence Directorate (GRU) was involved in the attack.\n US Deputy National Security Advisor for Cyber Anne Neuberger told the press that they have technical information showing that &#34;GRU infrastructure was seen transmitting high volumes of communication to Ukraine-based IP addresses and domains.&#34;\n In a  detailed breakdown of that DDoS incident, CERT-UA said the attacks involved both the Mirai and Meris botnets and included a supplementary SMS disinformation message campaign.\n  Christian Sorensen, former leader of the international cyber warfare team at US CYBERCOM, said these attacks are designed to ratchet up attention and pressure.\n &#34;It doesn&#39;t sound like much impact yet. In the coming hours/days, I would anticipate more activities to isolate and disrupt Ukrainian citizens and especially government activities,&#34; said Sorensen, who is now CEO of cybersecurity firm SightGain.\n &#34;The purpose at this stage is to cause chaos and seed doubt in the government and economy. Next stage will be impactful and continue deterrence for other countries to get involved.&#34;", "posttime": "2022-02-25 08:49:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,攻击,ukrainian", "title": "DDoS攻击扰乱了几个乌克兰政府网站；ESET研究人员发现数百台乌克兰机器上安装了新的数据雨刷恶意软件", "title_en": "DDoS attacks disrupt several Ukrainian government sites; ESET researchers discover new data wiper malware installed on hundreds of Ukrainian machines", "transed": 1, "url": "https://www.zdnet.com/article/ukrainian-govt-sites-banks-disrupted-by-ddos-amid-invasion-fears/", "via": "", "real_tags": ["软件", "攻击", "ukrainian"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074779, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个没有所有膨胀的轻量级[版本]网站列表。包括的网站不包含或很少包含JavaScript，且大小小于1MB（通常较小，幅度较大）。我们喜欢他妈的网站。\n这个列表还很年轻，我想听听你对哪些内容应该或不应该包括在内的反馈，请提交一个问题或为正在进行的讨论做出贡献。\nlaarc——两个论坛的两位长期粉丝将黑客新闻和Reddit技术混搭在一起\n上下文——基于维基百科时事门户（新闻部分）信息的新闻网站，偶尔有编辑内容（观点部分）\nTilde——它不是一个社交网络，它是一台小型的、完全标准的unix计算机，人们可以在共享的过程中恭敬地一起使用它来创建精彩的网页\n维基百科——一个免费的在线百科全书，旨在允许任何人编辑文章\n常规提交——常规提交规范建议在提交消息的基础上引入标准化的轻量级约定。\nprivado——一个轻量级搜索引擎，它不&#39；t IP地址或以任何可识别的方式进行搜索\n在法律允许的范围内，Mahdi Dibaiee已放弃本作品的所有版权和相关或相邻权利。", "note_en": "A list of lightweight [versions of] websites without all the bloat.Websites included include no, or very little JavaScript and are smaller than 1MB in size (usually smaller by a significant margin). We love websites like  Motherfucking Website.\n This list is still young and I would like to hear your feedback on what should or should not be included, please submit an issue or contribute to on-going discussions.\n     laarc - a tech mashup of Hacker News and Reddit by two long time fans of both forums\n the Context- news website based on the information from Wikipedia Current Events Portal (News section), with occasional editorial content (Opinion section)\n  Tilde - not a social network it is one tiny totally standard unix computer that people respectfully use together in their shared quest to build awesome web pages\n  Wikipedia - A free online encyclopedia with the aim to allow anyone to edit articles\n         Conventional Commits - The Conventional Commits specification proposes introducing a standardized lightweight convention on top of commit messages.\n       privado - A lightweight search engine that doesn&#39;t IP address or searches in any identifiable way\n   To the extent possible under law, Mahdi Dibaiee has waived all copyright and related or neighboring rights to this work.", "posttime": "2022-02-25 08:45:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lightweight,新闻", "title": "没有膨胀的轻量级网站列表", "title_en": "A list of lightweight websites without bloat", "transed": 1, "url": "https://github.com/mdibaiee/awesome-lite-websites", "via": "", "real_tags": ["新闻"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074778, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已有24年历史的核聚变记录已经崩溃。2月9日，英国牛津附近的联合欧洲环面（JET）的科学家宣布，他们已经产生了有史以来通过原子融合产生的最高持续能量脉冲，比1997年的实验记录增加了一倍多。\n“这些具有里程碑意义的结果使我们更接近于克服其中最大的科学和工程挑战之一，”喷气式飞机所在的库勒姆聚变能源中心（CCFE）负责人伊恩·查普曼在一份声明中说。英国原子能管理局（UK Atomic Energy Authority）是JET的东道主，但其科学项目由一个名为Euroflusion的欧洲合作组织负责。\n如果研究人员能够利用核聚变——为太阳提供动力的过程——它有望提供几乎无限的清洁能源。但到目前为止，没有任何实验产生的能量超过投入的能量。JET的研究结果并没有改变这一点，但它们表明，使用相同技术和燃料混合物的后续聚变反应堆项目——计划于2025年开始聚变实验的耗资220亿美元的雄心勃勃的ITER——最终应该能够实现这一目标。\n“喷气式飞机真的达到了预期的效果。现在，ITER也会这样做。”荷兰埃因霍温技术大学的融合物理学家JoeFin Pro说，他在一种叫做星状器的不同类型的反应堆上工作。“这是一个非常非常好的迹象，我很兴奋。”\n剑桥麻省理工学院（Massachusetts Institute of Technology）的等离子体物理学家安妮·怀特（Anne White）说，这些实验是近20年工作的顶峰，对于帮助科学家预测ITER将如何运行非常重要，并将指导其运行设置，她在托卡马克（tokamaks）上工作，托卡马克反应堆与喷气式反应堆（JET）一样，具有圆环形状。“我相信，在fusion社区，我并不是唯一一个想向喷气机团队表示衷心祝贺的人。”\nJET和ITER利用磁场将氢同位素的过热气体等离子体限制在托卡马克中。在高温和高压下，同位素融合成氦，以中子的形式释放能量。\n为了打破能源记录，这架喷气式飞机使用了一种由等量的氚和氘组成的燃料，这种混合物将为正在法国南部建造的国际热核实验堆提供动力。氚是氢的稀有放射性同位素；当它与同位素氘熔合时，这些反应产生的中子比单独氘粒子之间的反应多得多。这增加了能量输出，但喷气式飞机必须经过两年多的翻新，为迎接猛烈的攻击做好准备。上一次在托卡马克聚变实验中使用氚是在1997年JET创下之前的记录时。\n在2021年12月21日的一次实验中，Jet的托卡马克在5秒的融合脉冲下产生了59兆焦耳的能量，这是1997秒中21.7兆焦耳的4倍。尽管1997年的实验仍然保持着“峰值功率”的记录，但该峰值仅持续了几分之一秒，实验的平均功率不到最新测试的一半，CCFE的等离子体科学家费尔南达·里米尼（Fernanda Rimini）说，她是去年实验活动的负责人。她说，这项改进花了20年的实验优化，以及硬件升级，包括更换托卡马克的内壁以减少燃料浪费。\n里米尼说，在几秒钟内产生能量对于理解等离子体内部发生的加热、冷却和运动至关重要，这对运行ITER至关重要。\n普洛尔补充道，五秒钟“很重要”。“真的，真的令人印象深刻。”\n去年，美国能源部的国家点火装置创造了一个不同的聚变记录：它使用激光技术产生了最高记录的聚变功率输出，与输入功率相比，该值称为Q，其中1将产生与输入功率相同的功率。该设施的Q值达到了0.7，这是激光聚变的里程碑，打破了JET 1997年的记录。但这一事件是短暂的，在不到40亿分之一秒的时间里只产生了130万焦耳。\n里米尼说，JET的最新实验持续了5秒，Q值为0.33。普洛尔说，JET是ITER的缩小版，体积只有浴缸和游泳池的十分之一。它比国际热核聚变实验堆更容易散热，所以它从来没有达到收支平衡。她说，如果工程师们将同样的条件和物理方法应用于ITER和喷气式反应堆，它可能会达到Q值为10的目标，产生的能量是投入的能量的十倍。\n核聚变研究人员远没有得到所有答案。例如，另一个挑战是如何处理ITER反应堆排气区域产生的热量。ITER的排气面积将比JET的更大，但增加的面积与它必须处理的功率激增不成比例。普洛尔说，目前正在研究哪种设计最能承受高温，但研究人员还没有找到答案。\n喷气式飞机打破纪录的运行发生在为期五个月的运动的最后一天，里米尼说，科学家们从中收集了大量信息，他们将在未来几年进行分析。里米尼补充说，最终的实验将设备推到了“绝对最大值”，他实时见证了这一里程碑式的测试。“我们没有跳上跳下，互相拥抱——我们相距2米——但这非常令人兴奋。”\n氚实验可能是JET的杰作。去年，欧洲核聚变公司决定在2023年底结束JET的运营，也就是开始运营40年后。UKAEA已表示计划取消该实验；喷气式飞机的硬件和操作技术将在现场的其他项目中找到住所。", "note_en": "A 24-year-old nuclear-fusion record has crumbled. Scientists at the Joint European Torus (JET) near Oxford, UK, announced on 9 February that they had generated the highest sustained energy pulse ever created by fusing together atoms, more than doubling their own record from experiments performed in 1997.\n “These landmark results have taken us a huge step closer to conquering one of the biggest scientific and engineering challenges of them all,” said Ian Chapman, who leads the Culham Centre for Fusion Energy (CCFE), where JET is based, in a statement. The UK Atomic Energy Authority hosts JET, but its scientific programme is run by a European collaboration called EUROfusion.\n  If researchers can harness nuclear fusion — the process that powers the Sun — it promises to provide a near-limitless source of clean energy. But so far, no experiment has generated more energy than has been put in. JET’s results do not change that, but they suggest that a follow-up fusion-reactor project that uses the same technology and fuel mixture — the ambitious US$22-billion ITER, scheduled to begin fusion experiments in 2025 — should eventually be able to reach this goal.\n “JET really achieved what was predicted. The same modelling now says ITER will work,” says fusion physicist Josefine Proll at Eindhoven University of Technology in the Netherlands, who works on a different kind of reactor called a stellarator. “It’s a really, really good sign and I’m excited.”\n  The experiments — the culmination of almost two decades of work — are important for helping scientists to predict how ITER will behave, and will guide its operating settings, says Anne White, a plasma physicist at the Massachusetts Institute of Technology in Cambridge who works on tokamaks, reactors that, like JET, have a doughnut shape. “I am sure I am not alone in the fusion community in wanting to extend very hearty congratulations to the JET team.”\n  JET and ITER use magnetic fields to confine plasma, a superheated gas of hydrogen isotopes, in the tokamak. Under heat and pressure, the isotopes fuse into helium, releasing energy as neutrons.\n To break the energy record, JET used a  fuel made of equal parts tritium and deuterium — the same mixture that will power ITER, which is being built in southern France. Tritium is a rare and radioactive isotope of hydrogen; when it fuses with the isotope deuterium, the reactions produce many more neutrons than do reactions between deuterium particles alone. That ramps up the energy output, but JET had to undergo more than two years of renovation to prepare the machine for the onslaught. Tritium was last used by a tokamak fusion experiment when JET set its previous record in 1997.\n  In an experiment on 21 December 2021, JET’s tokamak produced 59 megajoules of energy over a fusion ‘pulse’ of 5 seconds — more than double the 21.7 megajoules released in 1997 over around 4 seconds. Although the 1997 experiment still retains the record for ‘peak power’, that spike lasted for only a fraction of a second, and the experiment’s average power was less than half that of the latest test, says Fernanda Rimini, a plasma scientist at the CCFE who oversaw last year’s experimental campaign. The improvement took 20 years of experimental optimization, as well as hardware upgrades that included replacing the tokamak’s inner wall to waste less fuel, she says.\n  Producing the energy over a number of seconds is essential for understanding the heating, cooling and movement happening inside the plasma that will be crucial to run ITER, says Rimini.\n Five seconds “is a big deal”, adds Proll. “It is really, really impressive.”\n Last year, the US Department of Energy’s National Ignition Facility set a different fusion record: it used laser technology to produce the highest recorded fusion power output relative to power in, a value called  Q, where 1 would be generating as much power as is put in. The facility achieved a  Q of 0.7 — a landmark for laser fusion that beat JET’s 1997 record. But the event was short-lived, producing just 1.3 megajoules over less than 4 billionths of a second.\n JET’s latest experiment sustained a  Q of 0.33 for 5 seconds, says Rimini. JET is a scaled-down version of ITER, at one-tenth of the volume — a bathtub compared to a swimming pool, says Proll. It loses heat more easily than ITER, so it was never expected to hit breakeven. If engineers applied the same conditions and physics approach to ITER as to JET, she says, it would probably reach its goal of a  Q of 10, producing ten times the energy put in.\n Fusion researchers are far from having all the answers. A remaining challenge, for example, is dealing with the heat created in the exhaust region of the ITER reactor. ITER’s exhaust will have a bigger area than JET’s, but the increase will not be in proportion to the surge in power it will have to deal with. Research is under way to work out which design should best withstand the heat, but researchers are not there yet, says Proll.\n JET’s record-breaking run happened on the last day of a five-month campaign from which Rimini says scientists gleaned a wealth of information that they will analyse over the next few years. The final experiment pushed the device to its “absolute maximum”, adds Rimini, who witnessed the landmark test in real time. “We didn’t jump up and down and hug each other — we were at 2 metres distance — but it was very exciting.”\n The tritium experiments could be JET’s swansong. Last year, EUROfusion decided to end JET’s operations at the end of 2023, 40 years after they began. The UKAEA has said that it plans to decommission the experiment; JET hardware and operational expertise are to find homes in other projects at the site.", "posttime": "2022-02-25 08:42:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反应堆,fusion,实验", "title": "核聚变反应堆使原子聚变产生的能量记录翻了一番", "title_en": "Nuclear-fusion reactor doubles record for energy made from fusing atoms", "transed": 1, "url": "https://www.nature.com/articles/d41586-022-00391-1", "via": "", "real_tags": ["反应堆", "fusion", "实验"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074777, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基辅，2月24日（路透社）-乌克兰总统府顾问米哈伊洛·波多利亚克周四表示，切尔诺贝利核电站已被俄罗斯军队占领。\n&#34;在俄罗斯人毫无意义的袭击之后，不可能说切尔诺贝利核电站是安全的；他说。\n俄罗斯军队接管了这座发电厂，而乌克兰军队周四在莫斯科发动了自二战以来对欧洲国家最大规模的陆、海、空袭击后，从三个方面与他们作战。\n一些俄罗斯军队在切尔诺贝利集结&#34；禁区&#34；一名俄罗斯安全人士说，在周四凌晨进入乌克兰之前。\n同一消息来源称，俄罗斯希望控制切尔诺贝利核反应堆，以向北约发出不进行军事干预的信号。\n1986年，在当时的苏联乌克兰发生的切尔诺贝利灾难，在核电站的第四个反应堆进行了一次拙劣的安全测试后，核材料云团席卷了欧洲大部分地区。\n几十年后，它成为了一个旅游景点。在俄罗斯入侵前大约一周，切尔诺贝利地区被关闭，供游客参观。\n&#34;我们的捍卫者正在献出自己的生命，以便1986年的悲剧不会重演；乌克兰总统Volodymyr Zelenskiy在发电厂被俘前不久发了推特。", "note_en": "KYIV, Feb 24 (Reuters) - The Chernobyl nuclear power plant has been captured by Russian forces, an adviser to the Ukrainian presidential office, Mykhailo Podolyak, said on Thursday.\n &#34;It is impossible to say the Chernobyl nuclear power plant is safe after a totally pointless attack by the Russians,&#34; he said.\n   Russian troops took over the power plant while Ukrainian forces battled them on three sides on Thursday after  Moscow mounted an assault by land, sea and air in the biggest attack on a European state since World War Two.\n Some Russian military massed in the Chernobyl &#34;exclusion zone&#34; before crossing into Ukraine early on Thursday, a Russian security source said.\n  Russia wants to control the Chernobyl nuclear reactor to signal NATO not to interfere militarily, the same source said.\n The Chernobyl disaster in then-Soviet Ukraine sent clouds of nuclear material across much of Europe in 1986 after a botched safety test in the fourth reactor of the atomic plant.\n Decades later, it became a tourist attraction. About a week before the Russian invasion the Chernobyl zone was shut down for tourists.\n &#34;Our defenders are giving their lives so that the tragedy of 1986 will not be repeated,&#34; Ukrainian President Volodymyr Zelenskiy tweeted shortly before the power plant was captured.", "posttime": "2022-02-25 08:40:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,军队,power,乌克兰", "title": "俄罗斯军队占领切尔诺贝利发电厂", "title_en": "Chernobyl power plant captured by Russian forces", "transed": 1, "url": "https://www.reuters.com/world/europe/chernobyl-power-plant-captured-by-russian-forces-ukrainian-official-2022-02-24/", "via": "", "real_tags": ["俄罗斯", "军队", "power", "乌克兰"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074775, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rust团队发布了Rust的新版本1.59.0。Rust是一种编程语言，它使每个人都能够构建可靠高效的软件。\n今天&#39；在世界&#39；俄罗斯的注意力被普京突然入侵乌克兰所吸引&#39；美国军队。在讨论新防锈剂的细节之前，我们&#39；我谨声明，我们声援乌克兰人民，并对所有受这场冲突影响的人表示支持。\n如果您通过Rustop安装了Rust的早期版本，您可以通过以下方式获得1.59.0版本：\n如果你没有&#39；如果您还没有，您可以从我们网站上的相应页面获取RustUp，并在GitHub上查看1.59.0的详细发行说明。\nRust语言现在支持内联汇编。这使得许多应用程序需要对其执行进行非常低级的控制，或访问特定的机器指令。\n使用std:：arch:：asm；//使用移位和加法将x乘以6:u64=4；不安全的{asm！（&#34；mov{tmp}，{x}&#34；&#34；shl{tmp}，1&#34；&#34；shl{x}，2&#34；&#34；添加{x}，{tmp}&#34；，x=inout（reg）x，tmp=out（reg）#坚持！（x，4*6）；\nasm中用于命名寄存器的格式字符串语法！还有全球运动！宏与Rust格式字符串中使用的宏相同，因此Rust程序员应该非常熟悉宏。\n根据目标体系结构，内联汇编变量提供的汇编语言和指令。如今，稳定的Rust编译器支持以下体系结构上的在线组装：\n您可以在Rust By Example中看到更多内联装配示例，并在参考资料中找到更详细的文档。\n现在可以使用元组、切片和结构模式作为符号的左侧。\nlet（a，b，c，d，e）；（a，b）=（1，2）；[c，…，d，]=[1,2,3,4,5]；结构{e，…}=结构{e:5，f:3}；坚持！（[1,2,1,4,5]，[a，b，c，d，e]）；\n这使得赋值与let绑定更加一致，后者长期以来一直支持相同的东西。请注意，不允许使用运算符（如+=）来分解分配。\n泛型类型现在可以为其常量泛型指定默认值。例如，您现在可以编写以下内容：\n结构阵列存储&lt；T、 常数N:usize=2&gt；{arr:[T；N]，}impl&lt；T&gt；ArrayStorage&lt；T&gt；{fn new（a:T，b:T）->ArrayStorage&lt；T&gt；{ArrayStorage{arr:[a，b]，}}}\n以前，类型参数必须位于所有常量参数之前。这一限制已经放宽，现在可以将它们交错。\nfn笛卡尔_积&lt；T、 常数N:usize，U，常数M:usize，V，F&gt；（a:[T；N]、b:[U；M]、f:f）——&gt；[V；N]；M] 其中F:FnMut（&amp；T，&amp；U）——&gt；V{/…}\n有时，Rust编译器中的错误会导致它接受本不应该被接受的代码。这方面的一个例子是在安全代码中允许借用压缩结构字段。\n虽然这种情况很少发生，但当项目使用的板条箱中包含不再允许使用的代码时，这种情况可能会造成相当大的破坏。事实上，你可能不会注意到，直到你的项目莫名其妙地停止建设！\nCargo现在会在依赖项被未来版本的Rust拒绝时向您显示警告。运行货物构建或货物检查后，您可能会看到：\n警告：以下软件包包含的代码将被Rust的未来版本拒绝：old_dep v0。1.0注意：要查看问题所在，请使用选项“--future Compatibility report”，或运行“cargo report future Compatibilities--id 1”`\n您可以运行警告中提到的cargo report命令，查看将被拒绝的代码的完整报告。这让你有时间在依赖关系破坏你的构建之前升级它。\n它&#39；从您分发的二进制文件中删除不必要的信息（如debuginfo）通常很有用，从而使它们变得更小。\n虽然在创建二进制文件后一直可以手动执行此操作，但cargo和rustc现在在链接二进制文件时支持剥离。要启用此功能，请将以下内容添加到您的货物中。汤姆：\n这会导致debuginfo从发行版二进制文件中剥离。您还可以提供&#34；符号&#34；或者仅为true，以在支持的位置删除所有符号信息。\n标准库通常附带调试符号和行级别的DebugInfo，因此默认情况下，未启用调试符号的Rust二进制文件仍然包含标准库中的调试信息。使用stripoption可以删除这些额外信息，从而生成更小的二进制文件。\n1.59.0版本默认禁用增量（除非通过环境变量明确要求：RUSTC_FORCE_incremental=1）。这减轻了已知错误#94124的影响，该错误可能会在增量编译打开时的编译过程中导致反序列化错误（和恐慌）。\n#94124的具体补丁已经登陆，目前处于1.60测试版，将在六周后发布。我们目前还不知道会鼓励决定在1.60 stable中禁用增量编译的其他问题，如果没有出现，1.60 stable很可能会再次启用增量编译。默认情况下，beta和nightlychannels中的增量编译保持打开状态。\n一如既往，我们鼓励用户在夜间和beta频道上进行测试，并报告您发现的问题：尤其是对于增量bug，这是确保Rust团队能够判断是否存在破损及其影响的用户数量的最佳方法。\nRust 1.59.0版本还有其他变化。看看锈迹、货物和Clippy发生了什么变化。\n许多人聚集在一起创造了Rust 1.59.0。我们不能&#39；没有你们所有人我做不到。谢谢", "note_en": "The Rust team has published a new version of Rust, 1.59.0. Rust is a programminglanguage that is empowering everyone to build reliable and efficient software.\n  Today&#39;s release falls on the day in which the world&#39;s attention is captured bythe sudden invasion of Ukraine by Putin&#39;s forces. Before going into the detailsof the new Rust release, we&#39;d like to state that we stand in solidarity with thepeople of Ukraine and express our support for all people affected by thisconflict.\n  If you have a previous version of Rust installed via rustup, you can get 1.59.0with:\n  If you don&#39;t have it already, you can  get  rustupfrom the appropriate page on our website, and check out the detailed release notes for 1.59.0 on GitHub.\n   The Rust language now supports inline assembly. This enables many applicationsthat need very low-level control over their execution, or access tospecialized machine instructions.\n  use std::arch::asm;// Multiply x by 6 using shifts and addslet mut x: u64 = 4;unsafe { asm!( &#34;mov {tmp}, {x}&#34;, &#34;shl {tmp}, 1&#34;, &#34;shl {x}, 2&#34;, &#34;add {x}, {tmp}&#34;, x = inout(reg) x, tmp = out(reg) _, );}assert_eq!(x, 4 * 6);\n The format string syntax used to name registers in the  asm! and  global_asm!macros is the same used in Rust  format strings, so it should feel quite familiarto Rust programmers.\n The assembly language and instructions available with inline assembly varyaccording to the target architecture. Today, the stable Rust compiler supportsinline assembly on the following architectures:\n  You can see more examples of inline assembly in  Rust By Example,and find more detailed documentation in the  reference.\n  You can now use tuple, slice, and struct patterns as the left-hand side of anassignment.\n let (a, b, c, d, e);(a, b) = (1, 2);[c, .., d, _] = [1, 2, 3, 4, 5];Struct { e, .. } = Struct { e: 5, f: 3 };assert_eq!([1, 2, 1, 4, 5], [a, b, c, d, e]);\n This makes assignment more consistent with  let bindings, which have longsupported the same thing. Note that destructuring assignments with operatorssuch as  += are not allowed.\n  Generic types can now specify default values for their const generics. Forexample, you can now write the following:\n struct ArrayStorage&lt;T, const N: usize = 2&gt; { arr: [T; N],}impl&lt;T&gt; ArrayStorage&lt;T&gt; { fn new(a: T, b: T) -&gt; ArrayStorage&lt;T&gt; { ArrayStorage { arr: [a, b], } }}\n Previously, type parameters were required to come before all const parameters.That restriction has been relaxed and you can now interleave them.\n fn cartesian_product&lt; T, const N: usize, U, const M: usize, V, F&gt;(a: [T; N], b: [U; M], f: F) -&gt; [[V; N]; M]where F: FnMut(&amp;T, &amp;U) -&gt; V{ // ...}\n  Sometimes bugs in the Rust compiler cause it to accept code that should nothave been accepted. An example of this was  borrows of packed structfields being allowed in safe code.\n While this happens very rarely, it can be quite disruptive when a crate used byyour project has code that will no longer be allowed. In fact, you might notnotice until your project inexplicably stops building!\n Cargo now shows you warnings when a dependency will be rejected by a futureversion of Rust. After running  cargo build or  cargo check, you might see:\n warning: the following packages contain code that will be rejected by a future version of Rust: old_dep v0.1.0note: to see what the problems were, use the option `--future-incompat-report`, or run `cargo report future-incompatibilities --id 1`\n You can run the  cargo report command mentioned in the warning to see a fullreport of the code that will be rejected. This gives you time to upgrade yourdependency before it breaks your build.\n  It&#39;s often useful to strip unnecessary information like debuginfo from binariesyou distribute, making them smaller.\n While it has always been possible to do this manually after the binary iscreated, cargo and rustc now support stripping when the binary is linked. Toenable this, add the following to your  Cargo.toml:\n  This causes debuginfo to be stripped from release binaries. You can also supply &#34;symbols&#34; or just  true to strip all symbol information where supported.\n The standard library typically ships with debug symbols and line-leveldebuginfo, so Rust binaries built without debug symbols enabled still includethe debug information from the standard library by default. Using the  stripoption allows you to remove this extra information, producing smaller Rustbinaries.\n   The 1.59.0 release disables incremental by default (unless explicitly asked forby via an environment variable:  RUSTC_FORCE_INCREMENTAL=1). This mitigatesthe effects of a known bug,  #94124, which can cause deserialization errors (and panics) during compilationwith incremental compilation turned on.\n The specific fix for  #94124 has landed and is currently in the 1.60 beta,which will ship in six weeks. We are not presently aware of other issues thatwould encourage a decision to disable incremental in 1.60 stable, and if nonearise it is likely that 1.60 stable will re-enable incremental compilationagain. Incremental compilation remains on by default in the beta and nightlychannels.\n As always, we encourage users to test on the nightly and beta channels andreport issues you find: particularly for incremental bugs, this is the best wayto ensure the Rust team can judge whether there is breakage and the number ofusers it affects.\n       There are other changes in the Rust 1.59.0 release. Check out what changed in Rust, Cargo,and  Clippy.\n  Many people came together to create Rust 1.59.0.We couldn&#39;t have done it without all of you. Thanks!", "posttime": "2022-02-25 08:30:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,装配,assembly", "title": "防锈1.59.0，带直列装配支架等。", "title_en": "Rust 1.59.0 with inline assembly support etc.", "transed": 1, "url": "https://blog.rust-lang.org/2022/02/24/Rust-1.59.0.html", "via": "", "real_tags": ["rust", "装配", "assembly"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074774, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可能最近遇到了“元认知”这个词，并想知道它是否只是另一个教学术语。元认知是“思考思考”，但这到底意味着什么，为什么它对学习很重要，教师如何在教学中强调它？\n元认知是一个人对自己学习的意识。它需要理解学习过程的目标，找出最佳的学习策略，并评估学习目标是否得到了实现。元认知学生将自己视为学习过程中的代理人，并意识到学习是一种积极的、战略性的活动。\n理解元认知的一个有用类比可能是掌握一项运动技能：在早期阶段，新手球员需要仔细思考自己的行为如何影响表现。例如，在找出挥杆的最佳方式时，新手可能会故意调整自己的姿势，评估这种调整是否会带来更好的表现，然后决定是否采取后续策略。这本质上是我们希望鼓励学生积极思考学习过程。\n元认知与提高学习成绩有关。在学习过程中有策略的人比那些不反思学习过程的人更成功，这是有道理的。例如，元认知学习者更容易注意到他们正在学习的东西没有意义。这些学生试图阐明自己的理解，而不是被动地继续完成作业。研究人员John Hattie认为，元认知策略教学的效果大小为0.69，是最有效的教学干预措施之一。\n元认知也是学生能否将学习转移到新情境的一个重要因素。具有元认知能力的学生正在积极地将新信息嵌入他们现有的知识网络，并在想法之间建立联系。这是一种让学生超越表面学习并促使他们深入理解的思维方式。\n虽然有些人天生比其他人更具元认知能力，但元认知是一种可以教授和学习的技能。与其他学习技能一样，学生最初需要明确的指导、搭建、练习和反馈，以便将不熟悉的操作转化为思维习惯。以下是关于如何将元认知融入教学的一些想法，尤其是当它与识字有关时。\n教师可以通过在阅读时展示自己的思维过程来模拟元认知。他们可以让学生看到他们是如何与课文互动的：他们如何确定阅读目的，在哪里停下来问问题，他们如何将新想法与以前的知识联系起来，他们如何跟踪自己是否理解内容，他们如何决定何时放慢阅读速度并重新阅读，以及他们如何评估所学内容。教师可以通过大声朗读或与学生分享他们的注释来做到这一点。重复这个建模过程很有用，尤其是在更具挑战性的作业开始时。\n教师可以通过要求学生在写作或讨论中展示他们的思维来构建元认知。关于如何做到这一点的说明需要明确；例如，教师可以引导学生在他们发现的令人惊讶、困惑或错误的文本中标记一个时刻，并解释他们的反应。复习学生所记内容是激发关于阅读的讨论的好方法。\n写作是让元认知可见的一种特别有用的方式，因为它能让学生回顾以前的笔记，并看到他们的思维是如何变化的。一些教师发现，创建学生学习档案袋（包括草稿和写作前活动）是有效的，然后让学生回顾他们的工作轨迹，并注意到它是如何随着不断的修改而发展的。\n为了展示学习的影响，教师可以在阅读课文之前记录学生对某个主题的态度和先入为主的观念，然后在阅读后跟进，以根据所学内容判断学生是否改变了想法。这可以通过阅读前和阅读后的民意调查来完成，这些数据最终会引发关于学生的讨论#39；之前的误解以及文本如何影响他们的思考。\n教师可以鼓励学生定期练习元认知，只需问“你是怎么发现的？”学生回答问题后。这有助于学生反思他们所采用的学习策略，并让他们的同学有机会了解他们的同龄人是如何学习的。\n学生可以通过判断工作来帮助养成评估不同学习策略的习惯：在查看问题的详细答案后，学生可以讨论该答案是否显示了推理的有效使用，以及如何改进。\n最后，学生们从修改作业和反思他们的思维如何改进的机会中受益匪浅。这让他们有机会了解自己第一次犯了哪些错误，以及学习过程如何让他们以不同的方式看待问题。", "note_en": "You may have come across the term “metacognition” recently and wondered if it was just another instructional buzzword. Metacognition is “thinking about thinking,” but what exactly does that mean, why does it matter to learning, and how can teachers emphasize it in their instruction?\n  Metacognition is an awareness of one’s own learning. It entails understanding the goals of the learning process, figuring out the best strategies for learning, and assessing whether the learning goals are being met. A metacognitive student sees him or herself as an agent in the learning process and realizes that learning is an active, strategic activity.\n A useful analogy for understanding metacognition might be mastering an athletic skill: in the early stages, a novice player needs to think carefully about how his or her actions affect performance. For instance, in figuring out the best way to swing a golf club, a novice player might deliberately adjust his or her stance, assess whether the adjustment leads to better performance, and then decide whether to adopt the strategy going forward. This is essentially the active thinking about the learning process that we want to encourage with students.\n    Metacognition has been linked to improved learning outcomes. It makes sense that individuals who are strategic in their learning are more successful than those who do not reflect on the learning process. For instance, metacognitive learners are more likely to notice when what they are studying does not make sense. These are the students who try to clarify their understanding rather than passively continuing on with the assignment. According to researcher  John Hattie, the effect size for teaching metacognitive strategies is 0.69, making it one of the most effective teaching interventions.\n Metacognition is also a significant factor in whether students can  transfer their learning to new scenarios. Students who are metacognitive are actively embedding new information in their existing network of knowledge and creating connections among ideas. This is the sort of thinking that gets students beyond surface learning and drives them to deeper understanding.\n  Though some individuals are naturally more metacognitive than others, metacognition is a skill that can be taught and learned. As with other learning skills, students will initially need explicit instruction, scaffolding, practice, and feedback in order to turn unfamiliar operations into habits of mind. Here are a few ideas on how to incorporate metacognition into instruction, particularly as it pertains to literacy.\n   Teachers can model metacognition by demonstrating their own thought process while they read. They can let students see how they interact with the text: how they determine the purpose of their reading, where they pause to ask a question, how they connect new ideas to previous knowledge, how they track whether they understand the content, how they decide when to slow down and re-read, and how they assess what they have learned. Teachers can do this through read-aloud or by sharing their annotations with students. It is useful to repeat this modeling process, particularly at the beginning of more challenging assignments.\n  Teachers can scaffold metacognition by asking students to demonstrate their thinking in writing or during discussion. Instructions on how to do this will need to be explicit; for instance, teachers can guide students to mark one moment in the text they found surprising, confusing, or erroneous and explain their reaction. Reviewing what students have noted is a great way to spur a discussion about the reading.\n  Writing is a particularly useful way to make metacognition visible because it enables students to look back on their previous notes and see how their thinking has changed. Some teachers find it effective to create portfolios of student learning, including rough drafts and pre-writing activities, then ask students to look back on the trajectory of their work and note how it has evolved with successive revisions.\n  To demonstrate the impact of learning, teachers can record students’ attitudes and preconceived notions about a topic prior to reading a text, then follow up after the reading to gauge whether students have changed their minds based on what they’ve learned. This can be done via a pre- and post-reading poll, with the data ultimately driving a discussion about students&#39; previous misconceptions and how the text informed their thinking.\n  Teachers can encourage students to regularly practice metacognition simply by asking, “How did you figure that out?” after a student offers an answer to a question. This helps students reflect on the learning strategies they employ and gives their classmates an opportunity to see how their peers learn.\n  Students can help get in the habit of assessing different learning strategies by judging work: after viewing a detailed answer to a question, students can discuss whether the answer shows an effective use of reasoning and how it can be improved.\n  Finally, students benefit tremendously from opportunities to revise their work and reflect on how their thinking has improved. This gives them the chance to understand what errors they made the first time around and how the learning process has led them to see the problem differently.", "posttime": "2022-02-25 08:27:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,掌握,mastering,学生", "title": "掌握元认知：什么、为什么和如何", "title_en": "Mastering Metacognition: The What, Why, and How", "transed": 1, "url": "https://www.activelylearn.com/post/metacognition", "via": "", "real_tags": ["认知", "掌握", "mastering", "学生"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074773, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "改善存储是提高区块链节点整体性能的最有效方法之一。区块链节点必须定期、持续地访问包含区块链状态的存储（在Tezos中也称为上下文）。节点访问该存储的速度会影响块应用时间——较慢的存储模块会降低块应用的速度，从而对节点的整体速度和稳定性构成瓶颈。\n如果由于某种原因存储不可用，则块的应用无法继续，节点“冻结”。当发生此类冻结（可能持续数分钟）时，节点会被卡住，直到存储完成其维护任务。如果块应用程序需要超过30秒（当前允许创建块的时间，也称为块时间），那么面包师可能无法烘焙块，他们可能会失去烘焙或背书的奖励。\n到目前为止，TezEdge支持两种不同的上下文存储实现，Octez v11实现，以及我们自己的基于Rust的实现，即只保留最近7个周期的数据的内存中垃圾收集存储。\n现在还有第三种选择。我们开发了一种持久化上下文存储，将整个Tezos区块链状态保存在磁盘上，我们将其命名为Tezos Edge v1。15上下文存储。与Octez v11实现相比，这已经转化为性能上的重大改进：\nTezEdge v1。15与Octez v11实现相比，上下文存储在磁盘中执行的读取（输入）量略多于一半，写入（输出）量不足三分之一。它还具有最小方差，这意味着读/写没有峰值。您可以跳转到标题为“上下文存储高级跟踪工具”的部分，以查看完整的详细信息。\n此外，我们的实现不会受到上述冻结的影响。这增加了成功烘焙或背书一块砖并获得奖励的可能性。\nOctez（v13）的下一个版本将采用改进的存储实现，解决我们在本文中讨论的问题。我们期待着与Octez背后的团队合作，发布我们基准测试的更新版本。\n如果我们想对Tezos节点执行任何类型的工作，我们需要首先引导它，这意味着我们需要重新处理每个操作块，从genesis块开始，以链头的块结束。\n我们启动了TezEdge节点的两个实例，同时使用16GB的RAM，并允许两个节点的最大存储带宽均为300MB/s。这两个实例之间唯一的区别是其中一个使用了我们新的和改进的TezEdge v1。15个存储空间，而另一个使用Octez v11存储空间。\n引导节点受到两个约束：Tezos经济协议和被引导节点的存储。TezEdge v1。15存储需要44131秒才能完成200多万个数据块的处理（95.1%为自举）。同时，Octez v11存储只需要295756秒就可以执行引导过程中75.4%的存储部分（160万）\n在存储选项卡的右侧，您可以找到完整的统计信息。向下滚动至底部以查找总时间，这是此处的重要值。在新的TezEdge v1中，它要少得多。15.储存，主要是因为它避免了冰冻。此外，Octez v11存储实现在读取上花费如此之多的原因之一是它还需要等待合并\n因为我们的项目是开发一个Tezos节点外壳，所以我们的重点是它的每个模块。这包括存储，优化存储会极大地影响引导速度。我们的存储性能如此之好的原因是，我们不仅减少了引导所需的数据大小，而且还加快了数据的处理速度。\n在TezEdge v1中。15上下文存储，我们的数据文件仅附加，这意味着新数据可以附加到存储中，但现有数据是不变的。通常，在无序数据文件中查找值是通过线性扫描完成的（顺序检查列表中的每个值，直到找到匹配项或搜索整个列表）。然而，对于大型数据集来说，这种扫描往往相当昂贵。数据库通常通过使用索引来避免这种情况。\n数据库索引是由两列组成的特殊查找表。第一列是搜索键，第二列是数据指针。键是要从数据库表中搜索和检索的值，指针或引用在数据库中存储特定搜索键的磁盘块地址。对关键字段进行排序，以便加速所有查询的数据检索操作。\n这些索引通常只是一系列有序的条目，但新条目是以随机顺序添加的。这意味着您需要不时地对索引进行排序。这种类型的维护工作需要一些时间，在某些情况下，在完成之前，存储将不可用。\n在当前的Octez v11上下文存储中（对于Octez v11，Irmin 2.9），有一个索引可用于通过散列对任何存储对象进行寻址。这个索引可能会变得非常大（对于一个包含所有mainnet历史记录的节点来说，现在的索引大于70GB），这使得它的维护成本非常高。\n我们在TezEdge v1中使用的索引。15只在存储中存储对提交特殊对象的引用，这些对象包含有关表示区块链状态的Merkle树的特定版本的信息，从而使它们小得多。它们足够小，可以在节点启动时在内存中完全加载和排序——例如，提交索引（我们的主索引）的大小不到100 MB。这样的小索引不需要定期维护——磁盘上的索引不需要排序。由于这个原因，TezEdge v1。15.储存不易结冰。此外，将索引存储在内存中可以提高性能。\n这是因为在Tezos中，存储对象从不直接寻址，而是通过遍历从提交对象开始的Merkle树来访问。除此之外，树中的对象总是根据其在数据库文件中的偏移量而不是哈希值来引用其他对象。这避免了在商店中查找对象时进行一次代价高昂的间接操作。\nOctez上下文存储的下一个版本（Irmin 3.0）也将实现一个解决大索引问题的解决方案，类似于我们在这里描述的。\n通过减少上下文存储中的延迟来跟踪和防止威胁存储回报的高延迟调用\n由于Tezos的积木必须在30秒内烘焙，如果一个电话（如提交）花费太多时间，面包师可能会失去烘焙或代言奖励。当存储遇到本文前面讨论的峰值时，就会发生这种情况。\n这就是为什么我们的主要目标是减少通话延迟——这样就不会有个别通话导致面包师因为花费太多时间而失去奖励。我们的第二个目标是减少这些调用所需的总时间，以便节点的存储性能更好。\n我们开发了一种先进的跟踪工具，用于跟踪存储中的通话。我们可以使用这个工具来比较存储实现，甚至可以选择任何过去或当前的协议。\n从顶部向下，在突出显示的存储选项卡下方，您首先可以看到当前上下文是irmin，这意味着显示的统计信息是针对Octez v11上下文存储的。\n下面是所有Tezos协议的列表。让我们选择杭州，最新的协议，因为这是面包师目前正在使用的。\n从左到右，首先，我们看到操作类型的名称，这个图代表所有提交调用。\n图形被组织成垂直的块行。每个垂直行表示在特定时间范围内进行的通话，如标题为“通话持续时间”的x轴所述。\n灰色方块表示通话有足够的持续时间。橙色方块表示持续时间比平时长，红色方块表示持续时间太长，会给烘焙奖励带来风险。\n在这个屏幕截图中，我们可以看到&gt；100秒射程。由于块创建有30秒的限制，因此；100秒呼叫将阻止应用区块，这意味着烘焙和背书奖励将丢失。\n如前所述，我们不仅大大加快了数据的读取和写入速度，而且还减少了必须从节点硬盘读取或写入的数据量。\n对于在运行节点的服务器中使用企业级SSD的大型烘焙服务公司来说，减少必须写入和读取的数据量尤其有价值。\nSSD的寿命有限，通过将数据存储到SSD上，寿命会进一步缩短，寿命的缩短与存储的数据量成正比。因此，减少在烘焙过程中必须写入硬盘的数据量可以延长硬盘的使用时间。\n随着区块链数据的规模和存储需求将呈指数增长，这在未来将变得更加重要。\n我们已经发布了两个TezEdge节点实例，一个使用Octez v11存储实现，另一个使用新的TezEdge v1。15上下文存储。您可以通过浏览器中的Edge explorer查看每个实例：\n运行Octez v11上下文存储的节点已处理1620147个块，并应用了75.4%的操作。\n与边缘v1一起运行的节点。15上下文存储处理了2039622个块，并应用了95.1%的操作\n虽然system overview（系统概述）选项卡以CPU和RAM的图表开始，但在本文中，我们首先比较存储I/O，因为这是存储整体性能方面最重要的图表，以及它对成功烘焙和认可的影响程度。\n请注意，在这两个图中，光标都是故意放在尖峰上的。此外，Octez v11存储图表的y轴停止在400MB，而边缘v1。15个存储站的容量为200MB。\n边缘v1的输入/输出。15存储空间明显低于旧版本的存储空间。这里的重要价值是：\n验证器-每秒读取，这在TezEdge v1中。15存储空间是Octez v11存储空间的一半多一点\n验证器——每秒写入，不到Octez v11存储中的三分之一。\n虽然有一些尖峰，但它们的频率要低得多，而且它们从未达到Octez v11存储中图表中的高度。Octez v11存储实现中出现这种峰值的原因是索引的合并，随着处理的块越来越多，索引变得越来越大。\n这里要注意的值是标记为验证器的绿线。在这里你可以看到新的TezEdge v1。15存储使用的内存更少，变化也小得多——它不会出现“峰值”，内存使用量会突然增加，正如您在第一张图中看到的，在Octez v11存储实现中，这种情况非常常见。\n请注意，边缘v1中的大尖峰。15 RAM图是由协议011更新引起的。这包括对上下文树进行重大重组，这是一项非常昂贵的操作。虽然上下文树的新表示形式更好，但将过去版本的树迁移到新版本需要一段时间。\n在这里我们可以看到，在TezEdge v1中提交时间更快。15.储存。这是因为，在之前讨论的Octez v11存储冻结期间，操作会大大减慢。冻结是由索引维护任务引起的，这些任务不会在TezEdge v1中发生。15.储存。这些冻结会导致延迟峰值，这意味着某些呼叫可能会花费太长时间，导致面包师错过烘焙或代言的奖励。\n与提交和签出类似，在Octez v11存储中，MEM、MEM TREE和FIND以及这一行中的其他几个操作的速度要慢得多。\n您可以看到TezEdge v1的性能有所改善。15通过运行TezEdge Explorer的两个实例来存储，一个用于使用Octez v11存储实现的节点，另一个用于使用TezEdge v1的节点。15存储实现。\n在我们的下一个版本中，用户将能够从持久化版本加载我们在上一篇文章中描述的内存存储，这意味着您不必在每次启动节点时从头开始处理整个链。我们还将支持制作Tezos区块链的快照，以便更快地引导。但是，请注意，我们的快照与Octez快照不兼容。\n我们希望您喜欢我们关于新的和改进的存储的文章。请随时通过电子邮件与我联系，我期待收到您的问题、意见和建议。要阅读更多关于Tezos和TezEdge节点的信息，请访问我们的文档、订阅我们的媒体、在Twitter上关注我们或访问我们的GitHub。", "note_en": "Improving the storage is one of the most effective ways of improving a blockchain node’s overall performance. Blockchain nodes must regularly and continuously access the storage that contains the  blockchain state (also known in Tezos as the  context). The speed at which a node can access this storage affects block application time — a slower storage module will slow down block application, thus constituting a bottleneck for the overall speed and stability of the node.\n If the storage is not available for some reason, then the application of blocks cannot proceed and the node ‘freezes’. When such freezes happen (which can last many minutes), the node gets stuck until the storage has finished performing its maintenance tasks. If block application takes more than 30 seconds (the time currently allowed for block creation, also known as the  block time), then the baker might not be able to bake the block and they can lose their reward for baking or endorsing.\n  Until now TezEdge supported two different implementations of the context storage, the Octez v11 implementation, and our own Rust-based implementation of a garbage-collected in-memory storage that only keeps the data from the latest 7 cycles.\n Now there is a third option. We’ve developed a persisted context storage that saves the entire Tezos blockchain state on-disk and we have named it the TezEdge v1.15 context storage. This has translated into a major improvement in performance when compared to the Octez v11 implementation:\n The TezEdge v1.15 context storage performs a little over half as much reads (input) and less than a third of writes (outputs) into the disk compared to the Octez v11 implementation. It also has minimum variance, meaning that there are no spikes in reads/writes. You can jump to the section titled  Advanced tracing tool for context storage to see the full details.\n Additionally, our implementation does not suffer from the aforementioned freezes. This increases the probability of being able to successfully bake or endorse a block and obtain the reward.\n The next version of  Octez (v13) will feature an improved storage implementation that addresses the issues we have discussed in this article. We are looking forward to working the team behind Octez to publish an updated version of our benchmarks once it is released.\n  If we want to perform any kind of work with a Tezos node, we need to first bootstrap it, meaning that we need to re-process every block of operations, starting with the genesis block and finishing with the block at the head of the chain.\n We launched two instances of the TezEdge node while using 16GB of RAM and allowing a maximum storage bandwidth of 300MB/s for both. The only difference between the two instances was that one used our new and improved TezEdge v1.15 storage, while the other used the Octez v11 storage.\n Bootstrapping a node is limited by two constraints: the Tezos economic protocol and the storage of the node that is being bootstrapped. The  TezEdge v1.15 storage required  44,131 seconds to complete the processing of over 2 million blocks (95.1% bootstrapped). Meanwhile, the  Octez v11 storage needed  295,756 seconds to perform just 75.4% of the storage part of the bootstrapping (1.6 million)\n       On the right side of the  STORAGE tab you can find the full statistics. Scroll down to the bottom to find the total time, which is the important value here. It is much less in the new TezEdge v1.15 storage, mostly thanks due to its avoidance of freezes. Additionally, one of the reasons the Octez v11 storage implementation spends so much on reads is that it also needs to wait for merges\n Since our project is developing a Tezos node shell, our focus is on every module that is a part of it. This includes the storage, and optimizing it greatly affects the speed of bootstrapping. The reason why our storage performs so well is that we not only reduced the size of the data necessary for bootstrapping, but we also sped up the rate at which it is processed.\n  In the TezEdge v1.15 context storage, our data files are  append-only, meaning new data can be appended to the storage, but existing data is immutable. Ordinarily, finding values within an unordered data file is done via a linear scan (sequentially checking each value in the list until a match is found or the whole list has been searched). However, such scans tend to be quite expensive for large datasets. Databases usually avoid that by using  indexes.\n Database indexes are special lookup tables consisting of two columns. The first column is the search key, and the second one is the data pointer. The keys are the values you want to search and retrieve from your database table, and the pointer or reference stores the disk block address in the database for that specific search key. The key fields are sorted so that it accelerates the data retrieval operation for all your queries.\n These indexes often are just a sequence of ordered entries, but new entries are added in random order. This means that from time to time, you need to sort the index. This type of maintenance work takes some time, and in some cases, will leave the storage unavailable until it is complete.\n In the current Octez v11 context storage (Irmin 2.9 for Octez v11) , there is an index that can be used to address any stored object by its hash. This index can grow very big (larger than 70GB for a node containing all the mainnet history right now), which makes its maintenance very costly.\n The indexes we use in the TezEdge v1.15 only store references to the commits special objects in the storage that contain information about specific versions of the Merkle tree that represents the blockchain state, making them much smaller. They are small enough to be completely loaded and sorted in-memory when the node starts — for instance, the commit index, which is our main one, has less than 100 MB. Such small indexes do not require regular maintenance — the on-disk indexes do not have to be sorted. For this reason, the TezEdge v1.15 storage is not susceptible to freezes. Additionally, storing the indexes in-memory improves performance.\n This works because in Tezos, the storage objects are never addressed directly, but instead are reached by traversing a  Merkle tree that begins at the commit object. In addition to this, objects in the tree always reference other objects by their offsets in the database file, not by their hash. This avoids one costly indirection when trying to find objects in the store.\n The next version of the Octez context storage (Irmin 3.0) will also implement a solution to the big indexes problem similar to what we described here.\n Tracing and preventing high latency calls that threaten baking rewards by reducing latencies in the context storage\n Since blocks in Tezos have to be baked within 30 seconds, bakers may lose out on the baking or endorsement reward if a call (such as a commit) takes too much time. This tends to happen when the storage suffers from the spikes we discussed earlier in the article.\n This is why our primary goal is to reduce the latency of calls — so that no individual call causes bakers to lose their reward by taking too much time. Our secondary goal is to reduce the total time these calls take so that the node’s storage performs better.\n We’ve developed an advanced tracing tool for calls made in the storage. We can use this tool to compare storage implementations and we can even select any past or current protocol.\n     From the top downwards, underneath the highlighted  STORAGE tab, you can first see that the Current context is  irmin, meaning that the statistics displayed are for the Octez v11 context storage.\n Underneath that is a list of all Tezos protocols. Let’s select Hangzhou, the latest protocol, because that is what bakers are currently using.\n  From left to right, first, we see the name for the type of action, this graph is for all  COMMIT calls.\n        The graph is organized into vertical rows of blocks. Each vertical row represents calls made within a specific range of time as described in the x axis titled  Duration of call.\n    The grey squares denote that the calls have an adequate duration. Orange squares denote durations that are longer than usual, and red squares denote that the duration is too long and will pose a risk to baking rewards.\n  In this screenshot, we can see that there are 82 calls that are in the &gt;100 second range. Since block creation has a 30 second constraint, such a large number of &gt;100s calls will prevent blocks from being applied, which means baking and endorsement rewards will be lost.\n  As described previously, we have not only significantly sped up the rate at which the data is read and written, but we have also reduced the amount of data that has to be read from or written into the node’s hard disk.\n Reducing the amount of data that has to be written and read is particularly valuable for major baking services who use enterprise-level SSDs in the servers on which they run their nodes.\n SSDs have a limited lifespan that is further shortened by storing data onto them, with the reduction in lifespan being proportionate to the volume of data stored. Therefore reducing the amount of data that has to be written onto the hard disks used in baking allows them to last longer.\n This will become even more important in the future as the size of blockchain data and the requirements for storage will exponentially grow.\n  We’ve launched two instances of the TezEdge node, one using the Octez v11 storage implementation while the other uses the new TezEdge v1.15 context storage. You can view each instance via the in-browser TezEdge explorer:\n      The node running with the  the Octez v11 context storage used by Octez has processed  1620147 blocks and has applied  75.4% of operations.\n The node running with the  TezEdge v1.15 context storage has processed  2039622 blocks and applied  95.1% of operations\n Although the system overview tab begins with a graph for CPU and then RAM, in this article, we begin with a comparison of  STORAGE I/O, because this is the most important graph in terms of the storage’s overall performance, and how much it affects successful baking and endorsing.\n      Please note that here the cursor is intentionally placed on a spike in both graphs. Additionally, the y axis of the Octez v11 storage chart stops at 400MB while the TezEdge v1.15 storage stops at 200MB.\n The  input/output of the TezEdge v1.15 storage is significantly lower than that of the old version of the storage. The important values here are:\n Validators — read per second, which in the TezEdge v1.15 storage is a bit more than half of what it is in the Octez v11 storage, and\n Validators — written per second, which is less than a third of what it is in the Octez v11 storage.\n While there are a few spikes, they are much less frequent and they never reach the same heights as those in the graph from the Octez v11 storage. The cause of such spikes in Octez v11 storage implementation is the merging of the index, which grows bigger as more blocks are processed.\n     The value to watch here is the green line marked as  VALIDATORS. Here you can see that the new TezEdge v1.15 storage uses less memory and it also has much less variance — it does not go through ‘spikes’, sudden rises in the use of memory, which, as you can see in the first graph, are very frequent in the Octez v11 storage implementation.\n Please note that the large spike in the TezEdge v1.15 RAM graph is caused by the update to protocol 011 Hangzhou. This included a major restructuring of the context tree, which is a very expensive operation. While the new representation of the context tree is better, it takes a while to migrate the past version’s tree to the new one.\n      Here we can see that the  COMMIT time is faster in the TezEdge v1.15 storage. This is because, during the previously-discussed storage freezes in the Octez v11 storage, actions slow down considerably. Freezes are caused by index maintenance tasks, which do not happen in the TezEdge v1.15 storage. These freezes lead to spikes in latency, which means certain calls can take too long and cause bakers to miss out on their reward for baking or endorsing.\n     Similarly to  COMMIT and  CHECKOUT, the actions  MEM,  MEM TREE and  FIND as well as several others in this row are significantly slower in the Octez v11 storage.\n  You can see the improvement in the performance of the TezEdge v1.15 storage by running two instances of the TezEdge Explorer, one for the node with the Octez v11 storage implementation and the other for the node with the TezEdge v1.15 storage implementation.\n            In our next release, users will be able to load the in-memory storage that we described in our  past article from a persisted version, which means you won’t have to start processing the entire chain from the beginning each time you start the node. We will also include support for making  snapshots of the Tezos blockchain for quicker bootstrapping. However, please note that our snapshots are not compatible with Octez snapshots.\n We hope you have enjoyed our article about the new and improved storage. Feel free to contact me by  email, I look forward to receiving your questions, comments and suggestions. To read more about Tezos and the TezEdge node, please visit our  documentation, subscribe to our  Medium, follow us on  Twitter or visit our  GitHub.", "posttime": "2022-02-25 08:18:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "merkle,improvement,存储", "title": "Tezos的Merkle树存储量提高了六倍", "title_en": "A six-fold improvement in the Merkle tree storage for Tezos", "transed": 1, "url": "https://medium.com/tezedge/prevent-the-loss-of-baking-rewards-with-the-6-times-faster-and-more-stable-tezedge-context-storage-ade5714228b5", "via": "", "real_tags": ["merkle", "存储"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074772, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "©2022美国科学促进会。版权所有。AAAS是HINARI、AGORA、OARE、Chouse、CLOCKSS、CrossRef和COUNTER的合作伙伴。", "note_en": "© 2022 American Association for the Advancement of Science. All rights reserved. AAAS is a partner of HINARI, AGORA, OARE, CHORUS, CLOCKSS, CrossRef and COUNTER.", "posttime": "2022-02-25 08:17:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "具有,bacterium,科学", "title": "迄今为止发现的最大的细菌具有出人意料的复杂细胞", "title_en": "Largest bacterium ever discovered has unexpectedly complex cells", "transed": 1, "url": "https://www.science.org/content/article/largest-bacterium-ever-discovered-has-unexpectedly-complex-cells", "via": "", "real_tags": ["具有", "bacterium", "科学"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074771, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注：河豚。js 14.1需要一些最新的功能，并不适用于所有浏览器。\n这是一个多线程引擎，只能在较新的浏览器和节点上运行。js版本。对于较旧的JS和WASM版本，请参阅Stockfish。js 11分公司。\n你可以养条鱼。直接从带有节点的命令行执行js。js 14.4+。您可能需要添加一些命令行标志以使其运行：\n河豚。js可以在npm存储库中找到，安装方式如下：npm安装stockfish。\n如果您想从命令行使用它，您可能只想全局安装它：npm install-g stockfish。然后你可以简单地运行stockfishjs。\n在节点中。js，您可以直接从命令行（即节点src/stockfish.js）运行它，也可以将其作为一个模块（即var stockfish=require（&#34；stockfish&#34；）；）运行。\n您需要安装emscripten编译器，并将其置于您的路径中（使用2.0.26进行测试）。然后你可以编译Stockfish。js和构建脚本：/建筑js。看/建筑js——有关详细信息的帮助。\n示例文件夹中有一些示例。您需要运行示例/服务器。js服务器查看客户端示例。", "note_en": "NOTE: Stockfish.js 14.1 reqiures some of the latest features and does not work in every browser.\n This is a multi-threaded engine, and will only run in newer browsers and node.js versions. For an older JS and WASM version, see the  Stockfish.js 11 branch.\n  You can run Stockfish.js directly from the command line with Node.js 14.4+. You may need to add some command line flags to get it to run:\n  Stockfish.js can be found in the npm repository and installed like this:  npm install stockfish.\n If you want to use it from the command line, you may want to simply install it globally:  npm install -g stockfish. Then you can simply run  stockfishjs.\n In Node.js, you can either run it directly from the command line (i.e.,  node src/stockfish.js) or require() it as a module (i.e.,  var stockfish = require(&#34;stockfish&#34;);).\n  You need to have the  emscripten compiler installed and in your path (tested with  2.0.26). Then you can compile Stockfish.js with the build script:  ./build.js. See  ./build.js --help for details.\n  There are examples in the example folder. You will need to run the example/server.js server to view the client-side examples.", "posttime": "2022-02-25 08:15:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "河豚,stockfish,js", "title": "河豚。js", "title_en": "Stockfish.js", "transed": 1, "url": "https://github.com/nmrugg/stockfish.js", "via": "", "real_tags": ["河豚", "stockfish", "js"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074770, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Lithops是冰植物科的一个多汁植物属。该属的成员原产于南部非洲。这个名字来源于古希腊单词λίθος（líthos），意思是&#34；斯通和#34；和ὄψ（óps），表示&#34；脸&#34；指植物的石头状外观。它们通过与周围岩石混合来避免被吃掉，通常被称为鹅卵石植物或活石。这个名字来自古希腊#34-行动和#34；也就是说，即使是一株植物也被称为Lithops。\n单独的石斛属植物由一对或多对球茎组成，几乎融合的叶片彼此相对，几乎没有茎。叶子之间的缝隙包含分生组织，产生花朵和新叶。石松的叶子大多埋在土壤表面以下，顶部有一个部分或完全半透明的表面，称为叶窗，允许光线进入叶子内部进行光合作用。\n在冬季，一对新的叶片，或偶尔不止一对，生长在现有的融合叶片对内。在春天，老叶配对，露出新叶，然后老叶就会干枯。干旱期间，石斛的叶子可能会在地面以下收缩并消失。生境中的石松每头几乎从来没有超过一对叶，这可能是为了适应干旱环境。新叶对完全成熟后，黄色或白色的花从叶间的裂缝中出现，每对叶一朵。这通常是在秋季，但可以在夏至之前在假木耳中和冬青后在L.这些花通常有甜味。\nLithops最令人吃惊的适应性是叶子的颜色。叶子是开窗的，表皮窗口根据物种和当地条件，有各种深浅的奶油色、灰色和棕色图案，带有较暗的窗口区域、圆点和红线。在典型的石头状环境中，这些标记可以作为植物的显著伪装。就像典型的窗花植物一样，绿色的组织排列在叶子的内部，在表皮窗下覆盖着半透明的组织。\n石松是专性的异交种，需要从单独的植物中授粉。和大多数mesembs一样，Lithops水果是一种干燥的胶囊，当它变湿时就会打开；一些种子可能会被落下的雨滴射出，干燥后胶囊会重新关闭。胶囊有时也可能分离并完整分布，或在几年后解体。\n石斑自然分布在纳米比亚和南非的广大地区，以及博茨瓦纳和安哥拉的小边界地区，从海平面到高山。记录了近千个个体种群，每个种群只覆盖一小部分干燥草原、草原或裸露的岩石地面。不同的岩屑种类优先在特定环境中发现，通常仅限于特定类型的岩石。Lithops尚未在该地区以外归化。\nLithops栖息地的降雨量约为700毫米/年，接近于零。降雨模式从纯夏季降雨到纯冬季降雨不等，少数物种几乎完全依赖露水的形成来获取水分。夏季温度通常很高，冬季温度从冷到热，但在全年温度非常温和的海岸上发现了一种物种。\n石斛是很受欢迎的室内植物，许多多汁的专业种植者都收藏了石斛。种子和植物在商店和互联网上随处可见。如果有充足的阳光和排水良好的土壤，它们相对容易生长和护理。\n在温和的温带气候中，通常的处理方法是在冬季保持它们完全干燥，只有在老叶干枯并被新叶对取代时才浇水。当植物开花时，浇水会持续到秋天，然后在冬天停止。最好的结果是在有额外热量的环境中获得的，比如温室。在较热的气候条件下，石斛会在夏季休眠，此时应保持大部分干燥，冬季可能需要一些水分。在热带气候中，石松主要在冬季生长，夏季休眠时间较长。在所有条件下，石松在秋季都会最活跃，需要最多的水分，每种植物都会在几乎相同的时间开花。\n石粉在粗糙、排水良好的基质中生长最好。土壤中水分过多会导致植物在过度膨胀时开裂。在强光下生长的植物会长出坚硬、颜色强烈的皮肤，能够抵抗损伤和腐烂，尽管持续的过度浇水仍然是致命的。过高的热量会杀死盆栽植物，因为它们无法通过蒸腾作用冷却自己，只能依靠埋在地表以下凉爽的土壤中。商业种植者将温和的杀菌剂或弱强度园艺硫磺混合到植物中#39；水可以防止腐烂。在炎热的天气里，石松对浇水很敏感，这会导致植物腐烂；在栖息地，当温度较高时，植物通常处于休眠状态，在一年中凉爽的月份生长。低光照会使植物极易腐烂和真菌感染。[2]\n在英国，以下物种获得了皇家园艺学会的园艺优异奖：-[3]\n石松的繁殖是通过种子或插条进行的。只有在一株植物自然分裂形成多个头后，插条才能用来培育新植株，因此大多数繁殖是通过种子进行的。如果一个物种的两个不同克隆同时开花，并且种子将在大约9个月后成熟，则石松可以很容易地人工授粉。种子很容易发芽，但幼苗在第一年或第二年很小，很脆弱，至少在两三年前不会开花。\n南非探险家、植物学家兼艺术家威廉·约翰·布切尔（William John Burchel）首次对石斑进行了科学描述，尽管他称其为“中胚层混浊虫”（Mesembryanthemum turbiniforme）。1811年，伯切尔在捡起一只&#34时发现了一个标本；形状奇特的卵石&#34；从地上。[9] 不幸的是，记录在案的物理描述不够详细，无法确定他发现了哪些岩性，并且不再使用“浊形岩性”，尽管多年来，它一直被用于现在所知的岩性胡克里。\n1922年，N E Brown开始根据胶囊划分这个过大的属，在此之前，还有几个石松属被公布为中胚层属。在接下来的几十年里，石斛属被创造出来，还有几十个物种被发表。Brown、Gustav Schwantes、Kurt Dinter、Gert Nel和Louisa Bolus继续记录来自整个南部非洲的石斑鱼，但对于它们之间的关系，甚至应该将哪些种群归类为物种，几乎没有共识。直到20世纪50年代，该属在栽培上仍然相当未知，在分类学上也没有得到很好的理解。\n20世纪50年代，德斯蒙德和诺琳·科尔开始研究岩性。这对夫妇一起参观了不同石松种群的几乎所有自然栖息地，并从大约400个物种中采集了样本。他们记录并识别它们，分配一个号码，现在被称为科尔号码，至今仍在世界各地使用。他们研究并修订了该属，1988年出版了一本权威著作（Lithops:Blowing Stones），描述了自那时以来被接受的物种、亚种和变种。\n由于它们的伪装非常有效，新物种不断被发现，有时在纳米比亚和南非的偏远地区，有时在人口稠密的地区，它们几代人都被忽视了。最近的发现包括1994年的L.coleorum、2000年的L.hermetica和2006年的L.amicorum。\n列出的许多物种都有命名的亚种或变种，有些物种有许多由旧名称或栖息地位置确定的区域形式。物种的鉴定主要是通过花色和叶型。\n一些种类的花大到足以遮住叶子。它们下午开门，晚上关门。\n^    &#34;属：石松属；。种质资源信息网络。美国农业部。2009-06-09. 2012年10月11日从原件存档。\n^科尔，德斯蒙德；科尔，诺琳（2005）。石蕊花。仙人掌；公司ISBN 88-900511-7-5。\n^哈特曼，H.E.K.，编辑（2001年）。多汁植物图解手册：艾虫科F-Z.斯普林格。ISBN 3-540-41723-0。\n^科尔·德斯蒙德（2006）&#34;仙人掌；联合期刊&#34；。X（1）。仙人掌；Co:57-59。{{cite journal}}：cite journal需要| journal=（帮助）", "note_en": "Jump to navigation  Jump to search  Lithops is a  genus of  succulent plants in the ice plant family,  Aizoaceae. Members of the genus are native to  southern Africa. The name is derived from the  Ancient Greek words   λίθος (  líthos), meaning &#34;stone,&#34; and   ὄψ (  óps), meaning &#34;face,&#34; referring to the stone-like appearance of the plants. They avoid being eaten by blending in with surrounding rocks and are often known as  pebble plants or  living stones. The formation of the name from the Ancient Greek &#34;-ops&#34; means that even a single plant is called a Lithops.\n    Individual  Lithops plants consist of one or more pairs of bulbous, almost fused  leaves opposite to each other and hardly any  stem. The slit between the leaves contains the  meristem and produces  flowers and new leaves. The leaves of  Lithops are mostly buried below the surface of the  soil, with a partially or completely translucent top surface known as a  leaf window which allows light to enter the interior of the leaves for  photosynthesis.\n During winter a new leaf pair, or occasionally more than one, grows inside the existing fused leaf pair. In  spring the old leaf pair parts to reveal the new leaves and the old leaves will then dry up.  Lithops leaves may shrink and disappear below ground level during  drought. Lithops in habitat almost never have more than one leaf pair per head, presumably as an adaptation to the arid environment. Yellow or white flowers emerge from the fissure between the leaves after the new leaf pair has fully matured, one per leaf pair. This is usually in autumn, but can be before the summer  solstice in   L. pseudotruncatella and after the winter  solstice in   L. optica. The flowers are often sweetly scented.\n  The most startling  adaptation of  Lithops is the colouring of the leaves. The leaves are  fenestrated, and the  epidermal windows are patterned in various shades of cream, grey, and brown, with darker windowed areas, dots, and red lines, according to species and local conditions. The markings function as remarkable  camouflage for the plant in its typical stone-like environment. As is typical of a window plant, the green tissue lines the inside of the leaves and is covered with  translucent tissue beneath the epidermal windows.\n Lithops are obligate  outcrossers and require  pollination from a separate plant. Like most  mesembs, Lithops fruit is a dry  capsule that opens when it becomes wet; some  seeds may be ejected by falling raindrops, and the capsule re-closes when it dries out. Capsules may also sometimes detach and be distributed intact, or may disintegrate after several years.\n   Lithops occur naturally across wide areas of  Namibia and  South Africa, as well as small bordering areas in  Botswana and possibly  Angola, from sea level to high mountains. Nearly a thousand individual populations are documented, each covering just a small area of dry grassland,  veld, or bare rocky ground. Different  Lithops species are preferentially found in particular environments, usually restricted to a particular type of rock.  Lithops have not  naturalised outside this region.\n Rainfall in  Lithops habitats ranges from approximately 700 mm/year to near zero. Rainfall patterns range from exclusively summer rain to exclusively winter rain, with a few species relying almost entirely on dew formation for moisture. Temperatures are usually hot in summer and cool to cold in winter, but one species is found right at the coast with very moderate temperatures year round.\n   Lithops are popular  house plants and many specialist  succulent growers maintain collections.  Seeds and plants are widely available in shops and over the  Internet. They are relatively easy to grow and care for if given sufficient sun and kept in well-draining soil.\n Normal treatment in mild  temperate  climates is to keep them completely dry during winter, watering only when the old leaves have dried up and are replaced by a new leaf pair. Watering continues through autumn, when the plants flower, and then stops for winter. The best results are obtained in an environment with additional heat such as a greenhouse. In hotter  climates,  Lithops will have a summer dormancy when they should be kept mostly dry, and they may require some water in winter. In  tropical climates,  Lithops can be grown primarily in winter with a long summer dormancy. In all conditions,  Lithops will be most active and need most water during autumn and each species will flower at approximately the same time.\n  Lithops thrive best in a coarse, well-drained substrate. Any soil that retains too much water will cause the plants to burst their skins as they over-expand. Plants grown in strong light will develop hard strongly coloured skins which are resistant to damage and rot, although persistent overwatering will still be fatal. Excessive heat will kill potted plants as they cannot cool themselves by  transpiration and rely on staying buried in cool soil below the surface. Commercial growers mix a mild fungicide or weak strength horticultural sulfur into the plant&#39;s water to prevent rotting. Lithops are sensitive to watering during hot weather, which can cause the plants to rot; in habitat the plants are often dormant when the temperatures are high, doing most of their growing during the cool months of the year. Low light levels will make the plants highly susceptible to rotting and fungal infection.  [2]\n In the  United Kingdom the following species have gained the  Royal Horticultural Society’s  Award of Garden Merit:-  [3]\n    Propagation of  Lithops is by  seed or  cuttings. Cuttings can only be used to produce new plants after a plant has naturally divided to form multiple heads, so most propagation is by seed.  Lithops can readily be pollinated by hand if two separate  clones of a species flower at the same time, and seed will be  ripe about 9 months later. Seed is easy to  germinate, but the seedlings are small and vulnerable for the first year or two, and will not flower until at least two or three years old.\n   The first scientific description of  Lithops was made by  botanist and artist  William John Burchell, explorer of  South Africa, although he called it   Mesembryanthemum turbiniforme. In 1811, Burchell discovered a specimen when picking up a &#34;curiously shaped pebble&#34; from the ground.  [9] Unfortunately the documented physical description was not detailed enough to be sure which  Lithops he had discovered and the name  Lithops turbiniformis is no longer used, although for many years it was applied to what is now known as   Lithops hookeri.\n Several more  Lithops were published as   Mesembryanthemum  species until in 1922  N E Brown started to split up the overly large genus on the basis of the  capsules. The  genus  Lithops was created and dozens more species were published in the following decades. Brown,  Gustav Schwantes,  Kurt Dinter,  Gert Nel, and Louisa Bolus continued to document  Lithops from across southern Africa, but there was little consensus on the relationships between them, or even which populations should be grouped as species. As recently as the 1950s, the genus remained rather unknown in cultivation and was not well understood  taxonomically.\n In the 1950s, Desmond and Naureen Cole began to study  Lithops. Together, the couple visited nearly all natural habitats of the different lithops populations and collected samples from approximately 400. They document and identify them, assigning a number, which is now known as the Cole number still used today all around the world. They studied and revised the genus, in 1988 publishing a definitive book (Lithops: Flowering Stones) describing the  species,  subspecies, and  varieties which have been accepted ever since.\n Because their camouflage is so effective, new species continue to be discovered, sometimes in remote regions of Namibia and South Africa, and sometimes in well-populated areas where they simply had been overlooked for generations. Recent discoveries include   L. coleorum in 1994,   L. hermetica in 2000, and   L. amicorum in 2006.\n   Many of the species listed have named  subspecies or  varieties and some have many regional  forms identified by old names or habitat locations. Identification of species is primarily by flower colour and leaf patterns.\n   Lithops sp. Some species have flowers large enough to obscure the leaves. They open in the afternoon and close in the evening.\n  ^    &#34;Genus:  Lithops N. E. Br&#34;.  Germplasm Resources Information Network. United States Department of Agriculture. 2009-06-09. Archived from  the original on 2012-10-11 .\n        ^    Cole, Desmond; Cole, Naureen (2005).  Lithops—Flowering Stones. Cactus &amp; Co.  ISBN   88-900511-7-5.\n ^    Hartmann, H.E.K., ed. (2001).  Illustrated Handbook of Succulent Plants: Aizoaceae F-Z. Springer.  ISBN   3-540-41723-0.\n ^    Cole, Desmond (2006). &#34;Cactus&amp;Co Journal&#34;.  X(1). Cactus&amp;Co: 57–59.    {{ cite journal}}:  Cite journal requires  |journal= ( help)", "posttime": "2022-02-25 08:11:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "石印,lithops,植物", "title": "石印", "title_en": "Lithops", "transed": 1, "url": "https://en.wikipedia.org/wiki/Lithops", "via": "", "real_tags": ["石印", "lithops", "植物"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074769, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对许多创始人来说，他们处理的最乏味的话题不是筹资、定价或产品。是人。具体来说，就是组成他们的执行团队的人。\n这通常表现为向知己或董事会成员提出的关于某个特定人的问题：“我该怎么办？”\n每当有人问我这个问题，我都会回答：“你会热情地重新聘用他们吗？”换言之，如果这个职位今天空缺，而且这个人完全了解他们的长处和短处，你会热情地为他们提供这份工作吗？\n我认为“热情”这个词在这个问题上很重要，因为它能让问题变得清晰。你不能回答这个问题。如果有任何疑问，你有你的答案。\n假设答案是否定的（通常是否定的）。如果是这样的话，有两条潜在的前进道路。\n如果你认为这是可以解决的，就需要改变的问题与对方坦诚交谈。和他们一起改变它。然后在某个确定的时间段结束时问自己是否会热情地重新聘用他们。\n这听起来可能有些刺耳，但我真的相信这是一个很好的框架，适用于相关公司和团队成员。对于公司来说，它有助于确保他们拥有一支高绩效的团队（作为奖励，它为管理者在构建和评估团队时提供了一个简单、可扩展的问题）。对于团队成员，他们会被告知他们表现的真相。这并不总是令人愉快的，但请记住，另一种选择是长期表现不佳，得不到诚实的反馈。我怀疑，很少有人愿意在老板对重新聘用他们不感兴趣的地方工作。我当然不会。\n与商业中的许多事情一样，提出框架很容易。令人讨厌的一致性应用程序才是最难的。总是有一个看似很好的理由来避免一场激烈的对话，或者留住一个人，即使你不想热情地重新聘用他们。他们正在做一个重要的项目。一开始就花了很长时间才找到他们。你还有另外三个搜索正在进行。如果此人不在，其他人可能会离开。他们现在正在某个领域增加价值——如果他们不在了，谁会这么做？\n这些都是可以理解的担忧。没有一个框架适用于所有情况。也许你的是独一无二的。\n不过，我将分享一些观察结果。绝大多数时候，我都听说有人会成为“我们该怎么办……”的主题，结果就是这个人在12个月内不在公司工作。在我的整个职业生涯中，我从未听过一位创始人或领导者说，“我希望我能等更长时间，给那个人诚实的反馈，或者让他们走。”\n最后，我要说的是一个更积极的方面，我真诚地相信这种方法可以创造一种信任和同情的文化，同时也可以推动绩效。它可以创造一个既要求高又支持力强的环境。应用这项技术的最终结果是，一个团队中有很多人，你会在一瞬间重新聘用，他们知道你会这么做。然后你就可以和团队一起出去，专注于共同发展业务的有趣部分。", "note_en": "For many founders, the most draining topic they deal with isn’t fundraising, pricing or product. It’s people. Specifically, the people that make up their executive team.\n  This usually manifests itself as a question posed to confidants or board members about a specific person: “What should I do about _____?”\n  Whenever I’m asked this question, I respond with, “Would you enthusiastically rehire them?” In other words, if the position was open today and this person was available – with full knowledge of their strengths and weaknesses – would you enthusiastically offer them the job?\n  I think enthusiastically is an important word in the question because it drives clarity. You can’t say maybe to that question. If there is any doubt, you have your answer.\n  Let’s assume the answer is no (it usually is). If so, there are a couple of potential paths forward.\n  If you think it’s fixable, have a candid conversation with the person about what needs to change. Work with them on changing it. Then ask yourself at the end of some defined time period whether you’d enthusiastically rehire them.\n  This may sound harsh, but I genuinely believe this is a good framework for companies  and the team members in question. For companies, it helps ensure that they have a high-performing team (and, as a bonus, it provides a simple, scalable question for managers to ask as they build and evaluate their teams). For the team members, they get told the truth about their performance. It is not always pleasant, but remember that the alternative is to be a chronic underperformer who does not get honest feedback. I would suspect that very few people would want to be at a place where their boss would not be excited about rehiring them. I sure wouldn’t.\n  Like many things in business, coming up with the framework is easy. It’s the pesky consistent application that’s hard. There is always a seemingly good reason to avoid a tough conversation or keep someone even if you wouldn’t enthusiastically rehire them. They are working on an important project. It took forever to find them in the first place. You have three other searches going on right now. Someone else may leave if this person is no longer there. They are adding value in some area now – who is going to do that if they are gone?\n  These are all understandable concerns. And no framework applies to every situation. Perhaps yours is unique.\n  I will share a couple of observations though. The vast majority of the time I’ve heard someone be the subject of “What should we do about…”, it has ended with the person in question not being at the company within 12 months. And throughout my entire career, I have not once heard a founder or leader say, “I wish I had waited longer to give that person honest feedback or let them go.”\n  To end on a more positive note, I genuinely believe this approach can create a culture of trust and compassion while also driving performance. It can create an environment that is both  highly demanding and highly supportive. And the end result of applying this is a team full of people you would rehire in a heartbeat, and who know you would do so. Then you get to go out with that team and focus on the fun parts of building your business together.", "posttime": "2022-02-25 08:09:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "热情,enthusiastically", "title": "热情地重新雇用", "title_en": "Enthusiastically Rehiring", "transed": 1, "url": "https://rkg.blog/rehiring.php", "via": "", "real_tags": ["热情"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074768, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卫报项目已被授予来自FieloCin基金会的分散式网站（FFDW）的资助，致力于分散准确性和分发（DVD）。FFDW的使命是“通过指导开放源代码软件和开放协议的开发，为分散的数据存储和检索网络确保人类最重要信息的永久保存。”Filecoin建立在topof IPFS之上，这是一个“用于存储和访问文件的分布式系统”。FFDW-DVD项目的distributioncomponent致力于改善F-Droid的自由、开放和分散的移动应用生态系统。除了本网站和F-Droid官方应用提供的Flagship统一体验外，F-Droid还为任何人提供了创建、构建、混音、发布、复制、重新发布和审查移动应用的所有功能。\n这对F-Droid用户很重要，因为这意味着他们不会被F-Droid锁定为垄断应用程序提供商。F-Droid社区需要保持对用户的响应，因为它可以分叉所有F-Droid（好的，除了签名密钥）🚫Ψ📝🔑😉). 分散化也很重要，因为每个用户都有特定的需求，并希望与其他用户发生潜在冲突。许多人只想要自由软件，但其他人愿意在关键领域妥协，还有一些人有强烈的隐私需求，与其他用户最喜欢的功能相冲突。分散的附件为用户提供了这种灵活性，而无需离开F-Droid的主要基础设施。\n我们对应用商店的围墙花园方式也有同样的担忧。虽然他们的设计可能是出于安全和简单的考虑，但它们已经成为无限制控制、审查和监视的来源。智能手机是大多数人的主要电脑，而应用程序是主要的移动工具。集中化、锁定的手机让世界上大多数人无法获得现代计算的真实能力，这是不必要的。FFDW-DVD项目将推动F-Droid实现对定制、策展、镜像、审查规避和点对点共享的全面支持。我们可以为所有人分享能力和知识提供一个更自由、更不脆弱的解决方案。除此之外，这个项目将为我们提供集中的时间，使我们的流程运行更高效、更可靠。\nIPF和Filecoin是这项任务的核心。IPFS有可能为整个F-Droid生态系统提供管道。它是一个集中的文件系统，通过将文件的哈希编译成ContentIdentifier（CID）来访问文件。这意味着每个文件的唯一签名都可以用于从IPFS获取该文件，无论它实际存储在哪里。当你在山顶时，它可以存储在你旁边的某个服务器场或其他智能手机上。如果IPFS存储是可访问的，并且包含所需的CID，则可以将其删除。互联网是不需要的。此外，如果文件对您很重要，您可以将其“固定”在自己的IPFS存储中，或使用Filecoin支付其他人的费用。只要某个人对公开一个文件感兴趣，它就可以在IPFS中维护，即使原始创建者已经删除了它。\nIPFS现在正在运行，包括存档在内的服务正在使用它。组织。但要真正取代目前的网络托管和文件分发方法，还有很多工作要做。这意味着我们将以混合方式整合IPF，我们已经在向上游报告我们的经验，以帮助改善IPF。F-Droid已经支持存储库和镜像，并且PFS将直接插入这些通道。这为F-Droid生态系统提供了另一层弹性和灵活性。\n由于“去中心化网络”包含了各种各样的东西，所以重要的是还要提到一些我们不会在这项拨款中做的事情。我们不关注NFT、区块链、DAO、智能合约或“Web3”的相关方面。\n这项工作的重点是加强F-Droid的基础，同时使存储库能够托管在分散存储上，同时将我们的平台推广为各种用户和组织的可行替代方案。\n将客户端逻辑嵌入到库中，以便于将存储库嵌入任何需要它的应用程序中。\n增强F-Droid客户端现有的“附近”和“应用程序交换”功能，包括利用基于libp2p的通信。\n提高发布和分发多媒体内容（文档、演示文稿、照片、视频、地图文件等）的能力和可用性。\n更新F-Droid的RepoMaker工具（便于“点击”应用程序repos的策划和发布），并添加对IPFS发布的支持。\n将F-Droid存储库的访问扩展到非Android设备和移动网络（渐进式网络应用、内容）。\n扩大对软件开发商、媒体组织、科技公司等的外联和援助，以促进其软件采用F-Droid平台，内容和设备（例如：Mozilla可以轻松运行aMozilla app store，其中包括所有Mozilla频道：发行版、夜生活等。它们还可以包括Mozilla认可的可生产应用程序的策划集合。然后，信任Smozilla的人可以轻松选择只访问Mozilla策划的app store）\n您可以通过查看GitLab中的发行和合并请求上的FFDW DVD标签，了解该项资助下的工作。\n我们的首要任务是将核心客户机作为独立库进行拆分。我们将借此机会使索引格式现代化，并确保其与IPF良好配合。在Issues和mergerequests上使用index-v2label跟踪这一努力。", "note_en": "Guardian Project has been awarded a grant from the  Filecoin Foundation forthe Decentralized Web(FFDW) to work ondecentralizing veracity and distribution (DVD). FFDW’s Mission is to“ensure the permanent preservation of humanity’s most important informationby stewarding the development of open source software and open protocols fordecentralized data storage and retrieval networks.” Filecoin is built on topof IPFS, which is “ a distributed system for storing and accessingfiles”. The distributioncomponent of the FFDW-DVD project is focused on improving F-Droid’s free,open, and decentralized mobile app ecosystem. On top of the flagshipunified experience offered by this website and the F-Droid official app,F-Droid provides all the pieces for anyone to create, build, remix, publish,reproduce, redistribute and review mobile apps.\n This is important to F-Droid users because it means that they are not lockedinto F-Droid as the monopoly app provider. The F-Droid community needs tostay responsive to its users because it is possible to fork all of F-Droid(okay, except for the signing keys 🚫Ψ📝🔑😉). Decentralization is alsoimportant because each user has specific needs and wishes that potentiallyconflict with other users. Many want only free software, but others arewilling to compromise in key places, and still others have strong privacyneeds that conflict with other users’ favorite features. Decentralized apprepositories provide users that flexibility without having to move away fromthe main F-Droid infrastructure.\n We share the concerns about the walled garden approach to app stores. Whiletheir design may have been driven out of concern for security andsimplicity, they have become a source of unbridled control, censorship andsurveillance. Smartphones are the primary computer for most and apps arethe central mobile tool. Centralized, locked down phones keep the realpower of modern computing needlessly out of reach of most of the world’spopulation. The FFDW-DVD project will push F-Droid forward towardsrealizing full support for customization, curation, mirroring, censorshipcircumvention, and peer-to-peer sharing. We can provide a more free andless fragile solution for the sharing of capability and knowledge to all.On top of that, this project will give us focused time to work on making ourprocesses run more efficiently and reliably.\n IPFS and Filecoin are central to this mission. IPFS has the potential toprovide the plumbing for the entire F-Droid ecosystem. It is adecentralized filesystem where files are accessible by their hash compiled into a  ContentIdentifier (CID). Thatmeans the unique signature of each file can be used to fetch that file fromIPFS, no matter where it is actually stored. It can be stored on someserver farm or the other smartphone next to you when on a mountain top. Ifthe IPFS storage is reachable and contains the CID you need, it can beretrieved. Internet is not required. Additionally, if a file is importantto you, you can “ pin” it in yourown IPFS storage or pay someone else to do it using Filecoin. As long assomeone is interested in having a file publicly available, it can bemaintained in IPFS, even if the original creator has taken it down.\n IPFS is working now, and services are using it, including archive.org.But there is much work to be done before it really can replace current webhosting and file distribution methods. That means we will integrate IPFS ina hybrid approach, and we are already reporting our experiences upstream tohelp improve IPFS. F-Droid already supports repositories and mirrors, andIPFS will plug right into those channels. This gives the F-Droid ecosystemanother layer of resiliency and flexibility.\n Since the “decentralized web” includes all sorts of things, it is importantto also mention things that we will not bedoing with this grant. We are not looking at NFTs, blockchain, DAOs, smartcontracts or related aspects of“ Web3”.\n  This work is focused on strengthening F-Droid foundations while enablingrepositories to be hosted on decentralized storage, while spreading ourplatform as a viable alternative for all kinds of users and organizations.\n Make client logic into libraries to make it easy to embed repositories inany app that needs it.\n        Enhance F-Droid client’s existing “nearby” and “app swap” capabilities,including utilizing libp2p-based communication.\n  Improve the capability and usability of publishing and distributingmultimedia content (documents, presentations, photos, videos, map files,and more).\n  Update F-Droid’s RepoMaker tool (for easy “point and click” curation andpublishing of app repos) and add support for IPFS publishing.\n  Expand access to F-Droid repositories to non-Android devices and themobile web (progressive web apps, content).\n    Expand outreach and assistance to software developers, media organization,tech companies and more to promote adoption of the F-Droid platform fortheir software, content and devices (example: Mozilla could easily run aMozilla app store that includes all the Mozilla channels: releases,nightlies, etc. They could also include a curated collection ofreproducibly built apps that Mozilla approves of. Someone who trustsMozilla can then easily choose to only have access to the Mozilla-curatedapp store)\n You can follow the work funded under this grant by checking the  FFDW-DVDlabel on issuesand  mergerequestsin GitLab.\n Our first priority is splitting out the core client pieces as standalonelibraries. We will take this opportunity to modernize the index format andensure it works well with IPFS. That effort is tracked using the  index-v2label on issuesand  mergerequests.", "posttime": "2022-02-25 08:06:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分散,decentralizing,droid", "title": "分散分配", "title_en": "Decentralizing Distribution", "transed": 1, "url": "https://f-droid.org/en/2022/02/05/decentralizing-distribution.html", "via": "", "real_tags": ["分散", "droid"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074767, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ruby 3的主要关注点之一是并行性和并发性。这一领域的先驱是使用红宝石纤维。光纤是一种并发机制，允许我们暂停、循环和恢复执行，同时使用少得多的上下文切换。它比线程消耗更少的内存，同时让开发人员控制代码段的执行。\n光纤是可扩展的无阻塞客户端和服务器的最佳解决方案。然而，Rails花了一段时间来利用它。\n随着Rails继续用光纤取代线程的使用，性能只会变得更好。开发的一个领域是ActiveRecord，尽管配置了ActiveSupport的隔离级别，但到目前为止它仍然依赖于线程。隔离级别决定了数据库跟踪如何传播到其他用户和系统。\n为什么这很重要？为此，我们需要了解ActiveRecord的ConnectionPool是什么。连接池管理多个ActiveRecord连接。连接实质上是在数据库上执行事务。为了执行这个事务，Rails将I/O操作卸载到一个线程，其中每个线程都维护一个单独的DB连接（在Puma的情况下）。否则，与数据库的单独对话可能会混淆。现在有了一个性能更好的线程替代方案，ActiveRecord应该可以切换了！可悲的是，事实并非如此。\n幸运的是，该PR将整个ConnectionPool的对话迁移到使用线程或光纤。\n太棒了但是，这意味着什么？理想情况下，在可预见的未来，我们可以期待Rails I/O操作的良好性能改进。目前，Rails使用IsolatedExecutionState抽象执行，至少它应该这样做。然而，当我们环顾Rails代码库时，似乎有很多代码是硬连接到以线程为中心的实现的。所以Rails核心团队有很多工作要做，现在就投入进来并做出贡献吧！", "note_en": "One of the major focuses for Ruby 3 was parallelism and concurrency.A trailblazer in this space is the use of Ruby Fibers.Fibers are a concurrency mechanism that allows us to pause, loop, and resume execution while consuming far fewer context switches.It consumes less memory than threads while giving the developer control over code segment execution.\n Fibers are the best solution for scalable non-blocking clients and servers.However, it has taken Rails a while to make use of it.\n  As Rails continues to replace the usage of threads with fibers, the performance will only get better.One area of development is ActiveRecord which until now still depended on threads, despite configuring ActiveSupport’s isolation level.An isolation level determines how database tractions are propagated to other users and systems.\n Why is that important?Well for that we need to understand what ActiveRecord’s ConnectionPool is.A connection pool manages multiple ActiveRecord connections. A connection essentially performs a transaction on a database.To perform this transaction, Rails offloads the I/O operation to a thread where every thread maintains a separate DB connection (in the case of Puma). Otherwise individual conversations with the database could mix up.Now that there is a more performant alternative to threads, ActiveRecord should switch over!Sadly, it does not.\n       Fortunately,  this PR migrated overall ConnectionPool’s conversations to either use Threads or Fibers.\n   Great! But, what does this mean?Ideally, in the foreseeable future, we can expect good performance improvements to Rails I/O operations.Currently, Rails abstracts execution using  IsolatedExecutionState, at least that’s what it is supposed to do. However, as one looks around the Rails codebase, there seems to be a lot of code that is hard-wired to a thread-centric implementation.So there’s a lot of work for the Rails core team, jump in and contribute today!", "posttime": "2022-02-25 08:04:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增加,adds,rails", "title": "Rails增加了对光纤安全ActiveRecord连接池的支持", "title_en": "Rails adds support for Fiber-safe ActiveRecord ConnectionPools", "transed": 1, "url": "https://blog.saeloun.com/2022/02/23/rails-fiber-safe-connection-pools.html", "via": "", "real_tags": ["增加", "adds", "rails"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074766, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一年多前，我编制了一份最佳免费课程和学习资源的注释列表，这些课程和资源可以帮助任何人以较低的成本成为数据工程师。我们已经收到了大量的正面反馈，所以经过整整一年的训练营，我再次坐下来收集了我们在团队中遇到的其他资源。\n去年，经验丰富的数据科学家、雄心勃勃的数据分析师、痴迷于数据的产品经理和面向未来的计算机科学家加入了Pipeline Academy，目标是学习真正的数据工艺，即数据工程。但是，即使你不认同上述任何一项，但你正计划成为一名更全面的数据专业人士，你来对了地方。\n期待设计良好的学习体验，这些体验在定价方面非常容易获得，学习成果也非常接近市场需求。\n如果你还没有读过第一版的学习材料汇编，一定要先看看。\n这里有各种不同的格式（基于视频的课程、书籍、播客、基于故事的交互式编码教程等），请尝试确定哪些最适合您的学习风格。\n不要跳过基础知识：对于数据工程师来说，使用Python、SQL和命令行是必不可少的。\n与他人分享你的经验和建议，在平庸的中等职位和无用的证书林立的环境中，真的很难找到合适的课程。\n数据工程播客和Python播客。这是托拜厄斯·梅西关于上述主题的优秀播客。\n数据工程，UC伯克利，Spring 2021大学课程由行业参与者的经验，虽然人们必须反思的事实，数据工程不发生在笔记本电脑。\n从技术上讲，它会对技术概念做出引人入胜的简单解释，这对你的日常工作和阅读都很有用。从SQL和AWS解释开始。\n像我&#39一样解释云；m 10初学者将从基础知识中了解云。几乎没有先验知识。你会在这本书中找到很多图片，很多例子，还有很多有点可疑的类比。\nAlex Xu：系统设计访谈——知情人士#39；让我们来指导这本书，这门课程将帮助你思考和理解复杂的集成。\nPython中的数据结构和信息检索这本唐尼的新书介绍了数据结构和算法，使用网络搜索引擎作为一个激励性的例子。\n如果你&#39；我们从它开始。两个资源对新手很好，尤其是如果他们没有&#39；我没有计算机科学背景。\n这本书对阿帕奇·卡夫卡进行了一次温和的介绍——将异想天开的图像与对流处理概念的清晰解释结合起来，将吸引所有年龄段的初学者。\n插图儿童&#39；《库伯内特斯指南》讲述了长颈鹿菲比、库贝船长和地鼠戈尔迪在发现库伯内特斯吊舱、复制控制器、服务和卷时的冒险经历。通过这篇轻松介绍库伯内特斯核心概念的文章，让你变得既愚蠢又严肃。\n感谢2021届毕业生和专家嘉宾的宝贵反馈。", "note_en": "A bit more than a year ago I’ve compiled an annotated list of  the best free courses and learning resources that could help anyone to become a data engineer on a shoestring. We’ve received an overwhelming amount of positive feedback on it, so after a full year of running the bootcamp I sat down again and collected an other bunch of resources we’ve bumped into during the cohorts.\n Experienced data scientists, ambitious data analysts, data-obsessed product managers and future-oriented computer scientist have joined Pipeline Academy in the last year with the goal of learning real data craftsmanship, aka data engineering. But even if you don’t identify as any of the above, but you’re planning to become a more well-rounded data professional, you’ve come to the right place.\n Expect well-designed learning experiences that are mostly very accessible in terms of pricing, and learning outcomes that are very close to what the market demands.\n  If you haven’t read  the first edition of our compiled list of learning materials, make sure to check it out first.\n There are various different formats included here (video-based courses, books, podcasts, story-based interactive coding tutorials etc.), try to identify which ones suit your learning style the best.\n Don’t skip the fundamentals: using Python, SQL and the command line are essential for data engineers.\n  Share your experience and recommendations with others, it’s really difficult to find the right courses in the forest of mediocre Medium posts and useless certifications.\n  The Data Engineering Podcast   and    The Python Podcast.init  Outstanding podcasts of Tobias Macey on the mentioned topics.\n Data Engineering, UC Berkeley, Spring 2021   University course ran by industry players with experience, although one has to reflect on the fact that data engineering does not happen in notebooks.\n Technically   Technically sends out engaging, simple explanations of technical concepts that are useful for your day to day job and fun to read. Start with the  SQL and the  AWS explanations.\n Explain the Cloud Like I&#39;m 10   Beginners will find the cloud explained from the basics. Little prior knowledge is assumed. You will find lots of pictures, lots of examples, and many somewhat questionable analogies in this book.\n Alex Xu: System Design Interview - An Insider&#39;s Guide The  book and the  course will help you to think about and understand complex integrations.\n  Data Structures and Information Retrieval in Python   The new Downey book introduces data structures and algorithms using a web search engine as a motivating example.\n  The command line can be intimidating if you&#39;re starting out with it. Two resources that are nice to novices especially if they don&#39;t come from a computer science background.\n       Gently Down the Stream A gentle introduction to Apache Kafka - pairing whimsical imagery with lucid explanations of stream processing concepts, this book will captivate beginners of all ages.\n The Illustrated Children&#39;s Guide to Kubernetes Follow the adventures of Phippy the Giraffe, Captain Kube, and Goldie the Gopher as they discover Kubernetes pods, replication controllers, services, and volumes. Get silly and serious at the same time with this lighthearted introduction to core Kubernetes concepts.\n  Thanks to all graduates and expert guests of our cohorts in 2021 for their valuable feedback.", "posttime": "2022-02-25 08:01:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,免费资源,engineer,数据", "title": "以低廉的成本（免费资源）成为一名更好的数据工程师", "title_en": "Become a better data engineer on a shoestring (free resources)", "transed": 1, "url": "https://www.dataengineering.academy/pipeline-data-engineering-academy-blog/learn-data-engineering-on-a-shoestring-free-courses", "via": "", "real_tags": ["免费", "免费资源", "engineer", "数据"]}]