[{"category": "", "categoryclass": "", "imagename": "1d53e00dfebb988745c2dd1e325bca62.png", "infoid": 1017077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不管是好是坏(最近大多更糟)，我是Twitter的常客。随着推特越来越多地成为我们国家对话的一部分(见前面的括号)，同时公开解决它的一些滥用问题，我发现自己对匿名性-它在互联网中扮演的角色，以及它不可避免地倾斜的危害天平-更加认真地思考。\n匿名性是…。对我来说就像是一件事。在我加入Postlight之前，我花了几年时间运营Airendipity，这是一种微不足道的社交网络，每个人都是匿名的，你所能做的就是发送里面有一些文本的小纸质飞机。纸质飞机会在全球范围内从一个电话跳到另一个电话，沿途收集地名(您的飞机刚刚降落在开罗！)、心声和评论。\n你会注意到最后一句话是过去式的：Airendipity不再是过去式了，因为我发现在一个非法的国家，为人们过去做的事情(比如出柜为同性恋)收费在技术上和伦理上都很困难。但在运营它的过程中，我学到了很多关于如何防止虐待，如何在在线社区培养善意的知识，不幸的是，社交网络的创建者很容易就能从任何真正的情感工作中解脱出来。\n社交网络的所有者，特别是像Twitter这样完全开放和单向的社交网络的所有者，喜欢假装围攻滥用是一种平衡行为。他们像对待自由市场一样对待自己的网络，以报告工具的形式提供一些微不足道的监管-通常隐藏在神秘的菜单中，或者甚至需要截图等技术技能才能提交报告-并声称系统将自行达到自然平衡，比如加权天平。\n但它永远不会：发送滥用的成本(创建账户，写傻事)总是低于接收和监管滥用的成本(看到它，感觉不好，填写报告表格，屏蔽单个用户，尝试回到睡眠状态)。\n在现实中，解决滥用问题不是一个规模，而是一个转变。系统要么偏袒施虐者，要么偏袒被施虐者。造成这种情况的原因有很多，我们可以在这里对人类的本质进行真正的哲学思考，但一个重要的原因是，网络对匿名的想法与我们对它的亲身体验不同。\n在Twitter这样的地方，匿名账号是一个鸡蛋头像，名字是ClodiusPulcher96，而“真人”账号是我穿着万圣节独角兽服装的照片，名字是凯文·巴雷特(Kevin Barrett)，对吗？在Facebook上，我必须使用我的真实姓名，这意味着我在那里发布的内容100%准确地代表了我在现实世界中的身份。只是我在推特上感觉很酷，希望当我真正的无纸飞机在停机坪上多花30分钟寻找登机口时，我能找到的每个与联合航空公司相关的把手上都会有最糟糕的瘟疫(沸腾)。在Facebook上，我可以毫不犹豫地结束现实生活中的友谊，就像对一张旧标签照片的评论一样，留下一些愚蠢的东西。\n即使是用自己的脸和真名写照片的时候，我仍然感到有些匿名。Twitter和Facebook不同意这一点。因此，那里的虐待转换有利于施虐者，因为施虐者受到匿名感的保护。被虐待的人不是。他们什么都能感觉到。\n我自己建造了Airendipity。这是我第一次在服务器上构建任何东西。最后，我得到了一个正常工作的系统，它的开关被反转，有利于它的使用者，而不是它的滥用者。我将列出几个我曾经用来实现这一点的想法，但值得记住的是，我是一名Rails开发新手，大型科技公司可用的修复程序要微妙和复杂得多，以至于它们还没有实施是不合情理的。\n信任您的用户。如果他们说有一条内容是故意伤害他们的，那么就删除它，至少是暂时删除。对于用户会滥用实际系统来报告滥用行为的巨大恐惧(到目前为止还没有实现)，不值得任何一个人为自己的生命担忧。另外，很容易区分举报他们不喜欢的人和举报故意伤害的人之间的区别。我知道，自从我这么做了。\n不能保证有一个平台。在这条线上的某个地方，社交网络不再把自己标榜为好玩的玩具，而是开始像基本人权一样行事。在联合国收购Twitter之前，情况并非如此。在Airendipity中，如果你经常被举报，你就会被淘汰，至少有一段时间是这样。同样，同样勤奋的反报告算法也适用。但这是你的平台，即使建立它也是一种固执己见的行为，所以你不妨让这种观点有点像巨魔，而不是社会话语中必要的一部分。\n拥抱上下文。Airendipity只允许你在读完另一架飞机的全程后在另一架飞机上留下公开评论-它已经积累了所有的心和评论。没有再[推特|博客|广播]机械师将飞机从上下文中删除。参加Airendipity意味着要看到整个社区。Airendipity是我见过的唯一一个冷静、深思熟虑地讨论艰难话题的社交网络。在那里聊天感觉很好，没有烦恼，也没有令人绝望的压力。\n空中怜悯不是完美的，现在也不再是，但我认为对于那些使用(和我一样，经常非常享受)社交网络的人来说，理解虐待并不是我们集体人性的必然结果，就像狂野的西部不是狂野的，因为它是西部一样，这一点很重要。在内部，试图驯服它的人很少(过去也是如此)。现在开关翻错了方向。不一定非得这样。", "note_en": "For better or worse (lately, mostly worse), I’m a regular  Twitter user. And as Twitter increasingly becomes part of our national dialogue (see prior parenthetical) while  publicly grappling with some of its abuse problems, I find myself thinking harder about  anonymity—the role it plays in the internet, and the balance of harm it inevitably tilts.\n Anonymity is…kind of a thing with me. Before I joined Postlight I spent a couple of years running  Airendipity, a sort of twee social network in which everyone was anonymous and all you could do was send little paper airplanes with some text inside. The paper airplanes would bounce around the globe from phone to phone, picking up placenames ( your plane just landed in Cairo!), hearts, and comments along the way.\n You’ll notice that last sentence was in the past tense: Airendipity is no longer, as I found it difficult both technically and ethically to charge money for a service people used to do stuff like come out as gay in a country where that was illegal. But in running it I learned a lot about how to prevent abuse, how to cultivate kindness in online community, and—unfortunately—how easy it is for the creators of social networks to absolve themselves of any real emotional work.\n  The proprietors of social networks, especially ones that are totally open and unidirectional like Twitter, like to pretend that coralling abuse is a balancing act. They treat their networks like a free market, provide some paltry regulation in the form of reporting tools—often buried in arcane menus or requiring technical skills like screenshotting to even submit reports—and claim that the system will reach natural equilibrium on its own, like a weighted scale.\n But it never will: the cost of sending abuse ( create account, write dumb thing) will always be less than the cost of receiving and regulating abuse ( see it, feel bad, fill out report forms, block single user, try to fall back to sleep).\n In reality, addressing abuse is not a scale, but a switch. The system either favors the abuser or the abused. There are many reasons for this, and we could get  real philosophical on the nature of humankind here, but an important reason is that the  network’s idea of anonymity is different from our lived experience of it.\n   In a place like Twitter, an anonymous account is an egg avatar with a name like ClodiusPulcher96, and a “real person” account is a picture of me in a Halloween unicorn costume with a name like Kevin Barrett, right? And on Facebook I have to use my real name, which means what I post there is a 100% accurate representation of who I am in the real world. Except that I feel totally cool on Twitter wishing the worst kind of plague (boils) on every handle associated with United Airlines I can possibly find when my real non-paper plane spends an extra 30 minutes on the tarmac looking for a gate. And on Facebook I can, without a second thought, end real-life friendships over something dumb left as a comment on an old tagged photo.\n Even when writing behind images of my own face and under my real name I still feel somewhat anonymous. Twitter and Facebook disagree. And so the switch of abuse there favors the abuser, because the abuser is shielded by their sense of anonymity. The abused is not. They feel everything.\n  I built Airendipity by myself. It was my first time building anything on the server. And in the end I had a working system whose switch was flipped in favor of its users, not its abusers. I’m going to lay out a couple of ideas I used to make this happen, but it’s worth keeping in mind that I was a neophyte Rails dev and that the fixes available to giant tech companies are so much more subtle and sophisticated that it’s unconscionable they have yet to be implemented.\n Trust your users. If they say a piece of content was intended to harm them then remove it, at least temporarily. The great (heretofore unrealized) fear that users will abuse the actual systems for reporting abuse is not worth a single person’s fear for their own life. Plus, it’s pretty easy to tell the difference between someone who’s reporting people they dislike from someone who’s reporting intended harm. I know, since I did it.\n Do not guarantee a platform. Somewhere along the line social networks stopped billing themselves as fun toys and started acting like basic human rights. Until the UN buys Twitter ( swoon) that’s not the case. In Airendipity, if you got reported a lot, you were out, at least for a little while. Again, the same diligent counter-reporting algorithms apply. But it’s your platform—even building it is an opinionated act, so you might as well make that opinion something like  trolls are not a necessary part of societal discourse.\n Embrace context. Airendipity only allowed you to leave a public comment on another’s airplane after you’d read its full journey—all the hearts and comments it had already accumulated. There was no re[tweet|blog|broadcast] mechanic to remove an airplane from its context. Participating in Airendipity meant seeing the entire community. Airendipity is the only social network in which I had ever seen calm, considered discussions about hard topics. It felt good to talk there, never fraught or hopelessly charged.\n Airendipity wasn’t perfect and is no longer, but I think it’s important for those who use (and, like me, often really enjoy) social networks to understand that abuse there isn’t the inevitable result of our collective humanity in the same way that the Wild West wasn’t wild because it was the west. There are (and were) just very few people on the inside trying to tame it. Right now the switch is flipped the wrong way. It doesn’t have to be.", "posttime": "2020-08-09 11:56:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社交,kind,报告", "title": "构建善良的社交网络(2018)", "title_en": "Building Kind Social Networks (2018)", "transed": 1, "url": "https://postlight.com/insights/building-kind-social-networks#.69mdqenq2", "via": "", "real_tags": ["社交", "kind", "报告"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DENé-Yenissean是由西伯利亚中部的叶尼塞语和北美西北部的Na-Dené语言组成的一个拟议的语系。\n专家们的接受程度虽然不是普遍的，但在很大程度上是有利的；因此，除了远东西伯利亚和北美使用的爱斯基摩-阿留申语言之外，德内-叶尼赛语被称为符合传统比较历史语言学标准的旧世界和新世界语系之间的第一个谱系联系的例证。\n历史语言学中的业余和专业研究人员长期以来一直试图将世界上各种已知的语言语系联系起来，形成大语系。阿尔弗雷多·特伦贝蒂(Alfredo Trombetti)于1923年首次提出了纳丁和叶尼赛家族之间的假定关系。[2]所引用的大部分早期证据都是类型学的；特别是，这两个语系都有一个复杂的粘着性前缀动词结构，这与亚洲的大多数其他语言不同，在较小程度上也不同于北美的其他语言。\n由大家庭支持者梅里特·鲁伦(Merritt Ruhlen)(1998年)在美国“国家科学院学报”上发表的第一份同行评议的出版物，提出了一个独特的德内-叶尼赛家族的存在。[3]然而，Edward Vajda(2010a：34)指出(没有具体说明是哪些)Ruhlen提供的34组单词中有26组是巧合的相似之处，而Ruhlen的8组单词遵循Vajda的语音对应规则。\nMichael Fortescue在他1998年出版的“跨越白令海峡的语言关系”一书[4](见第213-215页)中独立提出了德内-叶尼塞安家族的可能存在。他写道，在大陆之间深厚的血缘关系问题上，我一直试图在笨蛋们傲慢的乐观主义和正统分裂者的悲观之间找到一条中间路线(第1页)，他写道，我一直试图在笨蛋们傲慢的乐观主义和正统的分裂主义者的悲观之间找到一条中间路线(第1页)，他写道，我一直试图在笨蛋们傲慢的乐观和正统分裂分子的悲观之间找到一条中间路线。\n正如Fortescue的评论所暗示的那样，对远程语言家族关系的科学调查因所谓的Lumpers和Spliters之间的意识形态之争而变得复杂，Lumpers被漫画描述为笨手笨脚的业余人士，他们愿意根据偶然的相似之处将不同、无关的家庭组合在一起，而Spliters则被漫画化为僵化的。[6]。\n在2008年阿拉斯加的一次研讨会上，西华盛顿大学的Edward Vajda总结了十年的研究成果，基于原始语言的动词形态和重建，表明叶尼赛人和纳德内人的家族可能是有联系的。瓦伊达的研究总结于2010年6月发表在阿拉斯加大学人类学论文的“代内-叶尼赛连接”上。\n这本369页的卷，由詹姆斯·卡里和本·波特编辑，包含了2008年2月26日至29日研讨会的论文以及几篇投稿的论文。随同Vajda的主要论文是由Jeff Leer提供的关于纳德尼历史音系学的主要数据，以及几位语言专家的评论和这些领域的专家对一系列主题(考古学、史前、民族地理学、遗传学、亲属关系和民俗学)的文章。\nVajda提供的证据包括110多个建议的同源语素和大约10个对应的动词前缀和后缀位置。Vajda比较了Proto-Yenissean和Proto-Na-Dené的现有重构，根据两者之间的明显关系扩充了重构，并建议将两者连接成假定的Proto-Dené-Yeniseian语言的声音变化。他认为叶尼塞语的声调差异起源于音节尾音中声门化辅音的存在或不存在，就像在纳-德内语中仍然存在的那样。\nVajda和其他人还指出，没有发现令人信服的证据将海达与Na-Dené或Yenissean联系起来(Vajda 2010b：115，Kari and Potter 2010：4)。至于更广泛的德内-高加索假说(见上文)，虽然瓦伊达没有发现他与叶尼塞安和纳德内所做的这些其他家族在形态上的对应关系，但他不排除存在这样的证据的可能性，并敦促做更多的工作(瓦伊达2010b)。\n2011年，瓦伊达出版了一本简短的关于登内-叶尼塞语的注释书目(点击下面的链接)。2012年3月24日，阿拉斯加本土语言中心在阿拉斯加费尔班克斯大学举办了德内-叶尼塞安研讨会。共有9篇论文，这是自2010年卷出版以来关于第内-叶尼塞安的第一批新论文。截至2012年7月，还没有发表论文的计划，但研讨会的视频可以看到。\n瓦伊达在2012年研讨会上的陈述[7]用更多的语言和非语言证据扩充了他的建议。他讨论了他与约翰娜·尼科尔斯(Johanna Nichols)所做的一项研究，该研究调查了具有这种形态的不同家族中复杂的前缀动词结构的历史。他的结论是，与流行的看法相反，这些结构在几千年的时间里往往完好无损，几乎没有变化，因此实际上可能比传统上寻找的词汇关系更有力地证明了基因联系。\n因此，他同意一致的观点，即在大约8000到10000年的语言分离之后，遗传关系的词汇证据实际上变得无法检测到，但他认为，某些复杂的形态在这段时间之后可能会保持稳定。Dené-Yenissean的进一步证据在Vajda的2013a文章中，关于纳德内和Yenissean的残留所有格形态。\n瓦伊达比较了一个古老的德内-叶尼塞语所有格连接词前缀(可能是*ŋ)，该前缀以独特的方式出现在德内(或阿萨巴斯坎)、艾亚克、特林吉特和叶尼赛的名词、后置位置、指向词和指示词中。金刚还提出了一个新的词汇同源词：PA Directional*ñəs-d&34；Ahead&#34；，&34；out of Open water&34；and Yenissean root*es&34；open space&#34；。就瓦伊达2010年论文中的章节而言，这篇2013年的文章可以被解读为对他的第2节(在第63页结束)的补充。在随后的一篇文章(Vajda 2013b)中，Vajda讨论了Ket中由于长期接触后缀凝聚语言而出现的特点。\n在2012年的演讲中，Vajda还提到了非语言证据，包括对Y染色体和线粒体DNA单倍群的分析，除了突变外，这两种单倍群分别在雄性和雌性系中传递时没有变化。他最有说服力的DNA证据是Q1 Y染色体单倍群亚群，他指出，它出现在大约15,000年前，在几乎所有的美洲原住民和几乎所有的叶尼赛凯特人(90%)中都能找到，但在欧亚大陆几乎没有其他地方，除了塞尔库普人(65%)，他们与凯特人通婚已经有几个世纪了。\n利用这一证据和其他证据，他提出了一个位于东西伯利亚阿穆尔河和阿尔丹河周围的原始人-德内-叶尼塞人的故乡。这些人可能和现代的也门人一样是狩猎-采集者，但与几乎所有其他西伯利亚人不同(除了一些位于远东西伯利亚太平洋边缘的古西伯利亚人，他们似乎在基因上与也门人没有血缘关系)。\n最终，欧亚大陆的所有后裔都被驯鹿繁殖的牧民(例如说所谓的阿尔泰语的人)的传播消灭了，除了现代的叶尼赛人，他们能够在叶尼塞河以西很远的沼泽避难所里生存下来，因为那里蚊子泛滥，驯鹿不容易生存。相反，驯鹿(北美驯鹿种群)从未被驯化，因此现代的纳德内人没有受到类似的威胁。[7]。\n在2012年给乔治·斯塔斯廷的回信中，瓦伊达澄清说，目前的德内-叶尼塞安学说是一种语言关联性假说，但还不是一种恰当的语言分类学假说。他留下了一种可能性，即也门人或ND人(或两者都有)可能在欧亚大陆的其他地方有更近的亲戚。[8]。\n在出版时，瓦伊达的建议已经得到了几位纳丁和叶尼塞安语言专家的好评-尽管有时也很谨慎-包括迈克尔·克劳斯、杰夫·利尔、詹姆斯·卡里和海因里希·沃纳，以及其他一些受人尊敬的语言学家，如伯纳德·科姆里、约翰娜·尼科尔斯、维克多·戈拉、迈克尔·福特斯库、埃里克·汉普和比尔·波斯尔(Kari and Potter 2010：12)。[9]。\n一个重要的例外是对莱尔·坎贝尔(Lyle Campbell)收集的论文数量的批判性审查[10]，以及瓦伊达(Vajda)在2011年底发表的回应[11]，暗示该提案目前尚未得到解决。2011年和2012年，科伦·赖斯(Keren Rice)、贾里德·戴蒙德(Jared Diamond)和迈克尔·邓恩(Michael Dunn。西科利和霍尔顿2014年对德内语和叶尼塞亚语的类型学数据进行了贝叶斯分析，构建的系统发展史表明，德内语和叶尼塞亚语的联系更有可能代表贝林贾的辐射，并回迁到中亚，而不是从中亚或西亚迁徙到北美。[12][13]。\n2012年，语言学家乔治·斯塔斯廷(George Starostin)质疑了大家族的有效性，理由是金刚的定期书信并不是。恰如其分地按照经典的历史比较法意义上的规则来形容这个词。他还指出，金刚对动词词法的处理涉及到极少数耐人寻味的同构现象。被密不可分的假设和极具争议的内部重建所包围，这些假设和内部重建创造了一种系统重建的错觉，而实际上根本没有系统性重建。尽管如此，Starostin承认，Vajda的著作无论如何都是向前迈进了一步，它可能最终会为研究也门和Na-Denén；的语法化路径指明方向。[14]。\nStarostin认为叶尼赛人和Na-Dené人都属于一个更大的被称为德内-高加索人的群体，而不是组成一个单独的家庭。所以Starostin指出，这两个语系在很大程度上是相关的，但它们之间没有什么特殊的关系，足以在这两个语系之间创建一个独立的语系。\n2015年，语言学家保罗·基帕斯基(Paul Kiparsky)对Dené-Yenissean表示赞同，他说，对应词缀之间的形态平行和音素相似是最具启发性的，但实际关系最令人信服的证据来自那些可以独立驱动的有规律的音变来解释的音符对应。[15]。\n2017年的一项研究确定了阿萨巴斯加人以及其他说纳德涅语的人群中的古爱斯基摩人的遗传祖先。[16]约公元前2500年，古爱斯基摩人居住在从楚科塔到格陵兰岛的北极地区。作者认为，古爱斯基摩人几千年来一直与纳德尼人的祖先生活在一起。这提供了由古爱斯基摩人介导的西伯利亚人和纳德尼人之间遗传联系的证据。\n利用计算系统学方法，西科利和霍尔顿(2014)[17]认为叶尼塞期代表了从贝林贾返回亚洲的回迁。他们的分类如下，北阿萨巴斯坎被发现是副反应性的。各种语言以斜体列出。\n伯纳德·科姆里(2008)；为什么德内-叶尼斯主义假说令人兴奋。阿拉斯加费尔班克斯和安克雷奇：德内-也门研讨会。\n^参见瓦伊达2010A：34，他引用了特姆贝蒂的话，阿尔弗雷多。1923年。Elementi di声门痛。博洛尼亚。(第486、511页)。\n梅里特·鲁伦(1998年11月)。人类学杂志：纳德尼的起源。程序。娜塔莉。阿卡德。SCI。美国。95(23)：13994-13996。密码：1998PNAS...9513994R。Doi：10.1073/pnas.95.23.1394.。太平洋投资管理公司上涨了25007。PMID为9811914。\n^Fortescue，Michael D.(1998年11月30日)。白令海峡两岸的语言关系：重新评估考古和语言证据。布卢姆斯伯里学院。Isbn：9780304703302-通过谷歌图书。\n梅里特·鲁伦：“语言的起源：追溯母语的演变”，威利，1994年。\n^a b金刚，爱德华。地理、人口学和时间深度：解释德内-叶尼塞安是如何可能的。2012年3月24日，阿拉斯加费尔班克斯大学阿拉斯加本土语言中心，2012-09-10年度Dene-Yenissean研讨会上的演示文稿。在线提供。\n^比尔·波瑟。高加索的语言。语言日志，2008年8月25日。2017年7月22日访问。\n莱尔·坎贝尔(Lyle Campbell)，2011年，“德内-叶尼赛联系述评”(Kari And Potter)，“国际美国语言学杂志”77：445-451。总而言之，拟议中的德内-叶尼塞安连接目前还不能接受。这一假设确实令人振奋，是由一位严肃的学者提出的，他试图使用适当的程序。不幸的是，所引用的词汇证据(具有假定的发音对应)和所引用的形态学证据都不足以支持Na-Dene和Yenissean之间的遥远亲缘关系。450)。\n爱德华·瓦伊达，2011，对坎贝尔的回应，“国际美国语言学杂志”77：451-452。DY假说的提倡者仍然有责任为坎贝尔的审查或DYC本身确定的至少一些悬而未决的问题提供解决方案。我的观点是，他们中的每一个人都需要一个令人信服的解决方案，才能认为叶尼塞安和纳德内之间的关系得到了解决。452)。\n保罗·基帕斯基(2015)。历史语言学的新视角。收录于：“历史语言学路线手册”(Routledge Handbook Of History Languology)版。作者声明：by C.Bowern和B.Evans；第65-67页。\nFlegontov，Pavel；等人。(2017年)。北美的古爱斯基摩人遗传遗产。10.1101/203018。引用日记账需要|日记账=(帮助)。\n^&#34；存档副本&#34；。存档日期为2011-07-18。CS1维护：作为标题的存档副本(链接)。\n爱德华·J·瓦伊达(2001)“叶尼赛人与语言：他们的研究史”，附有注释书目和资料来源。伦敦：柯松出版社。\nVajda，Edward J.(2010a)。与纳德涅语相联系的西伯利亚语系。在卡里，J.；波特，B.(编辑)。德内-叶尼赛连接。阿拉斯加大学人类学论文，新系列。5.费尔班克斯：阿拉斯加大学费尔班克斯大学人类学系。第33-99页。ISBN为9781555001124。CS1维护：REF=HARV(链接)。\nVajda，Edward J.(2010b)。叶尼塞安、那德内和历史语言学。在卡里，J.；波特，B.(编辑)。德内-叶尼赛连接。阿拉斯加大学人类学论文，新系列。5.费尔班克斯：阿拉斯加大学费尔班克斯大学人类学系。第100-118页。ISBN为9781555001124。CS1维护：REF=HARV(链接)\nVajda，Edward J.(2011)。德涅语-叶尼塞亚语(Dene-Yenissean Languages&#34；)。牛津在线书目。CS1维护：REF=HARV(链接)。\nVajda，Edward J.(2013a)。Na-Dene和Yenissean的遗迹所有格形态。(PDF)。在哈尔古斯，沙龙；瓦伊达，爱德华；希伯，但以理(编辑)。2012年阿萨巴斯干(德内)语种的工作文件。阿拉斯加本土语言中心的工作底稿。11.阿肯色州费尔班克斯：ANLC。第79-91页。CS1维护：REF=HARV(链接)。\nVajda，Edward J.(2013b)。KET&#34；中的复分解和重分析。现代和古典语言。(66)：14-16。CS1维护：REF=HARV(链接)。\nVajda，Edward J.(2017)。“模板多元合成中的创新和保持模式”，摘自“牛津多元合成手册”，M.Fortescue，M.Mithun和N.Evans(编辑)，第363-391页。牛津大学出版社，牛津。\n阿隆诺夫，马克。(2015)&#34；形态学与文化进化的思考。&#34；L.Bauer等人。(编)。“复合词的语义学”，“词法研究”，第3页，第77-88页。斯普林格国际出版社，瑞士。\n莱尔坎贝尔(2011年7月)。德内-叶尼塞尼亚联系回顾，主编：Dene-Yenissean Connection，ed.。作者：詹姆斯·卡里和本·A·波特(PDF)。“国际美国语言学杂志”。77(3)：445-451。10.1086/660977。ISSN：0020-7071。CS1维护：REF=HARV(链接)。\n戴蒙德，贾里德(2011年8月)。语言学：语言之间的深厚关系。大自然。476(7360)：291-292。密码：2011Natur.476..291D.。DOI：10.1038/476291a。ISSN电话：0028-0836。PMID为21850102。CS1维护：REF=HARV(链接)。\n邓恩，迈克尔(2012)。德内-叶尼赛联系回顾(Kari和Potter编)&#34；语言。88(2)：429-432。DOI：10.1353/lan.2012.0036.。ISSN电话：1535-0665。CS1维护：REF=HARV(链接)\n弗莱贡托夫，帕维尔；昌迈，皮亚；齐德科娃，阿纳斯塔西娅；洛加切娃，玛丽亚D.；Altınışık，N.Ezgi；弗莱贡托娃，奥尔加；盖尔凡，米哈伊尔·S；格拉西莫夫，叶夫根尼·S；赫拉梅娃，叶卡捷琳娜E；科诺瓦洛娃，奥尔加P.；内雷蒂娜，塔蒂亚娜；尼古斯基，尤里五世；Starosina。野猫的基因组研究：一个与古爱斯基摩人相关的民族，具有重要的古代北欧亚血统。科学报告。6(1)：20768。Arxiv：1508.03097。密码：2016NatSR...620768F。DOI：10.1038/srep20768.。太平洋投资管理公司上涨了4750364。PMID为26865217。CS1维护：REF=HARV(链接)。\n迈克尔·福特斯库(1998)。白令海峡两岸的语言关系：重新评估考古和语言证据。伦敦和纽约：卡塞尔。ISBN为9781847141644。CS1维护：REF=HARV(链接)。\n卡里，詹姆斯；波特，本·A(2010)。连接亚洲和北美洲的德内-叶尼塞尼亚连接线。在卡里，J.；波特，B.(编辑)。德内-叶尼赛连接。阿拉斯加大学人类学论文，新系列。5.费尔班克斯：阿拉斯加大学费尔班克斯大学人类学系。第1-24页。ISBN为9781555001124。CS1维护：REF=HARV(链接)。\n保罗·基帕斯基(2015)。历史语言学的新视角。(PDF)。书名/作者声明：by by C.(编者注：The Bellern，C.；Evans，B.(编辑)。“历史语言学路线手册”(The Routledge Handbook Of History Languology)。伦敦和纽约：鲁特利奇(Routledge)。第64-102页。CS1维护：REF=HARV(链接)。\n赖斯，科伦(2011)。德内-叶尼塞尼亚联系回顾，主编：Dene-Yenissean Connection，ed.。作者：詹姆斯·卡里(James Kari)和本·A·波特(Ben A.Potter；)。历时记。28(2)：255-271。DOI：10.1075/直径28.2.04 RIC.。CS1维护：REF=HARV(链接)。\n罗希娜·鲁比茨；梅尔文，克里斯汀·L；克劳福德，迈克尔·H(2002)。Na-Dene和叶尼塞亚语使用者之间系统发育关系的遗传证据。人类生物学。74(6)：743-760。DOI：10.1353/hub.2003.0011.。高密度脂蛋白：1808/16191。PMID为12617487。CS1维护：REF=HARV(链接)。\n梅里特·鲁伦(1998年11月10日)。Na-Dene的起源。美国国家科学院院刊。95(23)：13994-13996。密码：1998PNAS...9513994R。Doi：10.1073/pnas.95.23.1394.。ISSN电话：0027-8424。太平洋投资管理公司上涨了25007。PMID为9811914。CS1维护：REF=HARV(链接)。\n西科利，马克·A；霍尔顿，加里(2014年3月12日)。语言发展史支持从贝林贾向亚洲的回迁。PLOS一号。9(3)：E91722。密码：2014PLoSO...991722S。Doi：10.1371/Joural.pone.0091722.。ISSN：1932-6203。太平洋投资管理公司上涨了3951421。PMID为24621925。CS1维护：REF=HARV(链接)\nVajda，Edward J.(2011)。对坎贝尔的回应。“国际美国语言学杂志”。77(3)：451-452。10.1086/660978。CS1维护：REF=HARV(链接)。\n约瑟夫·威尔逊(2018年)。&#34；后记。\n.", "note_en": "Dené–Yeniseian is a proposed  language family consisting of the  Yeniseian languages of central  Siberia and the  Na-Dené languages of northwestern North America.\n Reception among experts has been largely, though not universally, favorable; thus, Dené–Yeniseian has been called &#34;the first demonstration of a  genealogical link between Old World and New World language families that meets the standards of traditional  comparative- historical linguistics,&#34;  [1] besides the  Eskimo–Aleut languages spoken in far eastern Siberia and North America.\n    Amateur and professional researchers in  historical linguistics have long sought to link the various known  language families around the world into  macrofamilies. The putative relationship between Na-Dené and Yeniseian families was first proposed by  Alfredo Trombetti in 1923.  [2] Much of the early evidence adduced has been  typological; in particular, both families have a complex  agglutinative prefixing verb structure, which differs from most of the other languages in Asia and—to a lesser extent—North America.\n The first peer-reviewed publication to propose the existence of a distinct Dené–Yeniseian family was written by the macrofamily supporter  Merritt Ruhlen (1998) in   Proceedings of the National Academy of Sciences, United States.  [3] However,  Edward Vajda (2010a:34) states (without specifying which ones) that 26 of the 34 sets of words offered by Ruhlen are coincidental look-alikes, whereas 8 of Ruhlen&#39;s word sets follow Vajda&#39;s rules of sound correspondences.\n Michael Fortescue independently suggested the possible existence of a Dené–Yeniseian family in his 1998 book  Language Relations Across Bering Strait  [4] (see pages 213–215). He writes, &#34;I have attempted throughout to find a middle way between the cavalier optimism of &#39; lumpers&#39; and the pessimism of orthodox &#39;splitters&#39; on the matters of deep  genetic relationship between the continents&#34; (page 1).\n As alluded to by Fortescue&#39;s comment, scientific investigations of long-range language family relationships have been complicated by an ideological dispute between the so-called  &#34;lumpers&#34; and &#34;splitters&#34;, with &#34;lumpers&#34; caricatured as bumbling amateurs willing to group together disparate, unrelated families based on chance resemblances  [5] and the &#34;splitters&#34; caricatured as rigid enforcers of orthodoxy willing to &#34;shout down&#34; researchers who disagree with their belief that long-range connections are impossible to establish.  [6]\n  At a symposium in Alaska in 2008,  Edward Vajda of  Western Washington University summarized ten years of research, based on verbal  morphology and reconstructions of the  proto-languages, indicating that the Yeniseian and Na-Dené families might be related. The summation of Vajda&#39;s research was published in June 2010 in  The Dene–Yeniseian Connection in the  Anthropological Papers of the University of Alaska.\n This 369-page volume, edited by  James Kari and Ben Potter, contains papers from the February 26–29, 2008, symposium plus several contributed papers. Accompanying Vajda&#39;s lead paper are primary data on Na-Dene historical phonology by  Jeff Leer, along with critiques by several linguistic specialists and articles on a range of topics ( archaeology,  prehistory,  ethnogeography,  genetics,  kinship, and  folklore) by experts in these fields.\n The evidence offered by Vajda includes over 110 proposed cognate morphemes and about ten homologous prefix and suffix positions of the verbs. Vajda compared the existing reconstructions of Proto-Yeniseian and Proto-Na-Dené, augmented the reconstructions based on the apparent relationship between the two, and suggested  sound changes linking the two into a putative Proto-Dené-Yeniseian language. He suggested that Yeniseian tone differences  originated in the presence or absence of  glottalized consonants in the  syllable coda, as still present in the Na-Dené languages.\n Vajda and others also note that no compelling evidence has been found linking  Haida with either Na-Dené or Yeniseian (Vajda 2010b:115, Kari and Potter 2010:4). As for the wider Dené-Caucasian hypothesis (see above), while Vajda did not find the kinds of morphological correspondences with these other families that he did with Yeniseian and Na-Dené, he did not rule out the possibility that such evidence exists, and urges that more work be done (Vajda 2010b).\n In 2011 Vajda published a short annotated bibliography on Dené–Yeniseian languages (follow link below). On March 24, 2012, the Alaska Native Language Center hosted the Dené-Yeniseian Workshop at the University of Alaska Fairbanks. There were nine papers, the first new papers on Dené–Yeniseian since the 2010 volume was published. As of July 2012, there are no plans to publish the papers, but video from the workshop is available.\n Vajda&#39;s presentations at the 2012 workshop  [7] augmented his proposal with additional linguistic and non-linguistic evidence. He discussed a study he did with  Johanna Nichols investigating the history of complex prefixing verb structures in various families possessing morphology of this sort. His conclusion was that, contrary to prevailing belief, such structures are often preserved intact with little change over several thousands of years, and as a result may actually be stronger evidence of a genetic connection than the lexical relationships that are traditionally sought.\n As a result, he agreed with the consensus belief that lexical evidence of a genetic relationship becomes virtually undetectable after about 8,000 to 10,000 years of linguistic separation, but suggested that certain sorts of complex morphology may remain stable beyond this time period. Further evidence for Dené–Yeniseian is in Vajda&#39;s 2013a article &#34;Vestigial possessive morphology in Na-Dene and Yeniseian&#34;.\n Vajda presents comparanda for an ancient Dene-Yeniseian possessive connector prefix (possibly *ŋ) that appears in idiosyncratic ways in Dene (or Athabaskan), Eyak, Tlingit, and Yeniseian nouns, postpositions, directionals, and demonstratives. Vajda also suggests one new lexical cognate: PA directional *ñəs-d &#34;ahead&#34;, &#34;out on open water&#34; and Yeniseian root *es &#34;open space&#34;. In terms of the sections within Vajda&#39;s 2010 paper, this 2013 article can be read as an addition to his §2 (which ends on p. 63). In a subsequent article (Vajda 2013b), Vajda discusses features in Ket that arose due to prolonged areal contact with suffixal agglutinating languages.\n In his 2012 presentation Vajda also addressed non-linguistic evidence, including analyses of  Y-chromosome and  mitochondrial DNA  haplogroups, which are passed unchanged down the male and female lines, respectively, except for mutations. His most compelling DNA evidence is the  Q1 Y-chromosomal haplogroup subclade, which he notes arose c. 15,000 years ago and is found in nearly all  Native Americans and nearly all of the Yeniseian  Ket people (90%), but almost nowhere else in Eurasia except for the  Selkup people (65%), who have intermarried with the Ket people for centuries.\n Using this and other evidence, he proposes a Proto-Dené-Yeniseian homeland located in eastern Siberia around the  Amur and  Aldan Rivers. These people would have been  hunter-gatherers, as are the modern Yeniseians, but unlike nearly all other Siberian groups (except for some  Paleosiberian peoples located around the  Pacific Rim of far eastern Siberia, who appear genetically unrelated to the Yeniseians).\n Eventually all descendants in Eurasia were eliminated by the spread of  reindeer-breeding  pastoralist peoples (e.g. the speakers of the so-called  Altaic languages) except for the modern Yeniseians, who were able to survive in swampy refuges far to the west along the  Yenisei River because it is too mosquito-infested for reindeer to survive easily. Contrarily, the  caribou (the North American reindeer population) were never domesticated, and thus the modern Na-Dené people were not similarly threatened.  [7]\n In his 2012 reply to  George Starostin, Vajda clarifies that Dené-Yeniseian &#34;as it currently stands is a hypothesis of language relatedness but not yet a proper hypothesis of language taxonomy&#34;. He leaves &#34;open the possibility that either Yeniseian or  ND (or both) might have a closer relative elsewhere in Eurasia&#34;.  [8]\n  At the time of publication Vajda&#39;s proposals had been favorably reviewed by several specialists of Na-Dené and Yeniseian languages—although at times with caution—including  Michael Krauss,  Jeff Leer,  James Kari, and  Heinrich Werner, as well as a number of other respected linguists, such as  Bernard Comrie,  Johanna Nichols,  Victor Golla,  Michael Fortescue,  Eric Hamp, and  Bill Poser (Kari and Potter 2010:12).  [9]\n One significant exception is the critical review of the volume of collected papers by  Lyle Campbell  [10] and a response by Vajda  [11] published in late 2011 that imply that the proposal is not settled at the present time. Other reviews and notices of the volume appeared in 2011 and 2012 by  Keren Rice,  Jared Diamond, and Michael Dunn. Sicoli and Holton 2014, applying Bayesian analysis to typological data from Dene and Yeniseian languages constructed phylogenies that suggest that the Dene-Yeniseian connection &#34;more likely represents a radiation out of  Beringia with a back migration into  Central Asia than a migration from  Central Asia or  Western Asia to  North America&#34;.  [12]  [13]\n In 2012, linguist  George Starostin questioned the validity of the macrofamily, citing the fact that &#34;Vajda’s &#39;regular correspondences&#39; are not... properly &#39;regular&#39; in the classic comparative-historical sense of the word&#34;. He also notes that Vajda&#39;s &#34;treatment of the verbal morphology&#34; involves &#34;a tiny handful of intriguing isomorphisms... surrounded by an impenetrable sea of assumptions and highly controversial internal reconstructions that create an illusion of systemic reconstruction where there really is none&#34;. Nonetheless, Starostin concedes that Vajda&#39;s work &#34;is, by all means, a step forward&#34;, and that it &#34;may eventually point the way towards research on grammaticalization paths in Yeniseian and Na-Dené&#34;.  [14]\n Instead of forming a separate family, Starostin believes that both Yeniseian and Na-Dené are part of a much larger grouping called  Dene-Caucasian. So Starostin states that the two families are related in a large sense, but there is no special relationship between them that would suffice to create a separate family between these two language families.\n In 2015, linguist  Paul Kiparsky endorsed Dené–Yeniseian, saying that &#34;the morphological parallelism and phonological similarities among corresponding affixes is most suggestive, but most compelling evidence for actual relationship comes from those sound correspondences which can be accounted for by independently motivated regular sound changes&#34;.  [15]\n  A 2017 study identifies  Paleo-Eskimo genetic ancestry in  Athabaskans, as well as in other  Na-Dene-speaking populations.  [16] The Paleo-Eskimo peoples inhabited the Arctic region from  Chukotka to  Greenland c. 2500 BC. The authors argue that the Paleo-Eskimos lived alongside Na-Dene ancestors for millennia. This provides evidence of a genetic connection between Siberian and Na-Dene populations mediated by Paleo-Eskimos.\n     Using  computational phylogenetic methods, Sicoli &amp; Holton (2014)  [17] suggest that Yeniseian represents a back-migration from  Beringia back to Asia. Their classification is as follows, with  Northern Athabaskan found to be  paraphyletic. Individual languages are listed in  italics.\n          ^  Bernard Comrie (2008) &#34;Why the Dene-Yeniseic Hypothesis is Exciting&#34;. Fairbanks and Anchorage, Alaska: Dene-Yeniseic Symposium.\n ^  see Vajda 2010a:34 who quotes Trombetti, Alfredo. 1923.  Elementi di glottologia. Bologna. pp.486, 511)\n ^   Merritt Ruhlen (November 1998).  &#34;Anthropology : The origin of the Na-Dene&#34;.  Proc. Natl. Acad. Sci. USA.  95 (23): 13994–13996.  Bibcode: 1998PNAS...9513994R.  doi: 10.1073/pnas.95.23.13994.  PMC   25007.  PMID  9811914.\n ^   Fortescue, Michael D. (30 November 1998).   Language Relations Across The Bering Strait: Reappraising the Archaeological and Linguistic Evidence. Bloomsbury Academic.  ISBN   9780304703302  – via Google Books.\n  ^  Merritt Ruhlen,  The Origin of Language: Tracing the Evolution of the Mother Tongue, Wiley, 1994.\n ^     a     b  Vajda, Edward. &#34;Geography, Demography and Time Depth: Explaining how Dene–Yeniseian is possible&#34;. Presentation at the  2012 Dene–Yeniseian Workshop  Archived 2012-09-10 at the  Wayback Machine, Alaska Native Language Center, University of Alaska Fairbanks, March 24, 2012. Available  online.\n  ^  Bill Poser. &#34; The languages of the Caucasus&#34;.  Language Log, 25 August 2008. Accessed 22 July 2017.\n ^  Lyle Campbell, 2011, &#34;Review of  The Dene-Yeniseian Connection (Kari and Potter)&#34;,   International Journal of American Linguistics 77:445-451. &#34;In summary, the proposed Dene-Yeniseian connection cannot be embraced at present. The hypothesis is indeed stimulating, advanced by a serious scholar trying to use appropriate procedures. Unfortunately, neither the lexical evidence (with putative sound correspondences) nor the morphological evidence adduced is sufficient to support a distant genetic relationship between Na-Dene and Yeniseian.&#34; (pg. 450).\n ^  Edward Vajda, 2011, &#34;A Response to Campbell&#34;,  International Journal of American Linguistics 77:451-452. &#34;It remains incumbent upon the proponents of the DY hypothesis to provide solutions to at least some of the unresolved problems identified in Campbell&#39;s review or in DYC itself. My opinion is that every one of them requires a convincing solution before the relationship between Yeniseian and Na-Dene can be considered settled.&#34; (pg. 452).\n    ^  Kiparsky, Paul (2015). &#34;New perspectives in historical linguistics&#34;. In:  The Routledge Handbook of Historical Linguistics ed. by C. Bowern and B. Evans. pp 65–67.\n ^   Flegontov, Pavel; et al. (2017).  &#34;Paleo-Eskimo genetic legacy across North America&#34;.  doi: 10.1101/203018.   Cite journal requires  |journal= ( help)\n  ^    &#34;Archived copy&#34;. Archived from  the original on 2011-07-18 .  CS1 maint: archived copy as title ( link)\n   Vajda, Edward J. (2001)  Yeniseian Peoples and Languages: A History of Their Study, with an Annotated Bibliography and a Source. London: Curzon Press.\n Vajda, Edward J. (2010a). &#34;A Siberian Link with Na-Dene Languages.&#34;. In Kari, J.; Potter, B. (eds.).  The Dene–Yeniseian Connection. Anthropological Papers of the University of Alaska, new series.  5. Fairbanks: University of Alaska Fairbanks, Department of Anthropology. pp. 33–99.  ISBN   9781555001124.  CS1 maint: ref=harv ( link)\n Vajda, Edward J. (2010b). &#34;Yeniseian, Na-Dene, and Historical Linguistics.&#34;. In Kari, J.; Potter, B. (eds.).  The Dene–Yeniseian Connection. Anthropological Papers of the University of Alaska, new series.  5. Fairbanks: University of Alaska Fairbanks, Department of Anthropology. pp. 100–118.  ISBN   9781555001124.  CS1 maint: ref=harv ( link)\n Vajda, Edward J. (2011).  &#34;Dene-Yeniseian Languages&#34;.  Oxford Bibliographies Online .  CS1 maint: ref=harv ( link)\n Vajda, Edward J. (2013a).  &#34;Vestigial possessive morphology in Na-Dene and Yeniseian.&#34;  (PDF). In Hargus, Sharon; Vajda, Edward; Hieber, Daniel (eds.).  Working papers in Athabaskan (Dene) Languages 2012. Alaska Native Language Center Working Papers.  11. Fairbanks, AK: ANLC. pp. 79–91 .  CS1 maint: ref=harv ( link)\n Vajda, Edward J. (2013b).  &#34;Metathesis and Reanalysis in Ket&#34;.  Modern &amp; Classical Languages. (66): 14–16 .  CS1 maint: ref=harv ( link)\n Vajda, Edward J. (2017). &#34;Patterns of Innovation and Retention in Templatic Polysynthesis.&#34; In  Oxford Handbook of Polysynthesis, M. Fortescue, M. Mithun, and N. Evans (eds.), pp. 363–391. Oxford University Press, Oxford.\n  Aronoff, Mark. (2015) &#34;Thoughts on Morphology and Cultural Evolution.&#34; L. Bauer et al. (eds.).  Semantics of Complex Words, Studies in Morphology 3 pp. 77-88. Springer International Publishing Switzerland.\n Campbell, Lyle (July 2011).  &#34;Review of  The Dene-Yeniseian Connection, ed. by James Kari and Ben A. Potter&#34;  (PDF).  International Journal of American Linguistics.  77 (3): 445–451.  doi: 10.1086/660977.  ISSN  0020-7071 .  CS1 maint: ref=harv ( link)\n Diamond, Jared (August 2011).  &#34;Linguistics: Deep relationships between languages&#34;.  Nature.  476 (7360): 291–292.  Bibcode: 2011Natur.476..291D.  doi: 10.1038/476291a.  ISSN  0028-0836.  PMID  21850102 .  CS1 maint: ref=harv ( link)\n Dunn, Michael (2012).  &#34;Review of The Dene–Yeniseian Connection (Kari and Potter, eds.)&#34;.  Language.  88 (2): 429–432.  doi: 10.1353/lan.2012.0036.  ISSN  1535-0665 .  CS1 maint: ref=harv ( link)\n Flegontov, Pavel; Changmai, Piya; Zidkova, Anastassiya; Logacheva, Maria D.; Altınışık, N. Ezgi; Flegontova, Olga; Gelfand, Mikhail S.; Gerasimov, Evgeny S.; Khrameeva, Ekaterina E.; Konovalova, Olga P.; Neretina, Tatiana; Nikolsky, Yuri V.; Starostin, George; Stepanova, Vita V.; Travinsky, Igor V.; Tříska, Martin; Tříska, Petr; Tatarinova, Tatiana V. (11 February 2016).  &#34;Genomic study of the Ket: a Paleo-Eskimo-related ethnic group with significant ancient North Eurasian ancestry&#34;.  Scientific Reports.  6 (1): 20768.  arXiv:  1508.03097.  Bibcode: 2016NatSR...620768F.  doi: 10.1038/srep20768.  PMC   4750364.  PMID  26865217.  CS1 maint: ref=harv ( link)\n Fortescue, Michael (1998).   Language Relations across Bering Strait: Reappraising the Archaeological and Linguistic Evidence.&#39; . London and New York: Cassell.  ISBN   9781847141644 .  CS1 maint: ref=harv ( link)\n Kari, James; Potter., Ben A. (2010). &#34;The Dene–Yeniseian Connection, Bridging Asia and North America.&#34;. In Kari, J.; Potter, B. (eds.).  The Dene–Yeniseian Connection. Anthropological Papers of the University of Alaska, new series.  5. Fairbanks: University of Alaska Fairbanks, Department of Anthropology. pp. 1–24.  ISBN   9781555001124.  CS1 maint: ref=harv ( link)\n Kiparsky, Paul (2015).  &#34;New perspectives in historical linguistics.&#34;  (PDF). In Bowern, C.; Evans, B. (eds.).  The Routledge Handbook of Historical Linguistics. London and New York: Routledge. pp. 64–102 .  CS1 maint: ref=harv ( link)\n Rice, Keren (2011). &#34;Review of  The Dene-Yeniseian Connection, ed. by James Kari and Ben A. Potter&#34;.  Diachronica.  28 (2): 255–271.  doi: 10.1075/dia.28.2.04ric.  CS1 maint: ref=harv ( link)\n Rubicz, Rohina; Melvin, Kristin L.; Crawford, Michael H. (2002).  &#34;Genetic Evidence for the Phylogenetic Relationship between Na-Dene and Yeniseian Speakers&#34;.  Human Biology.  74 (6): 743–760.  doi: 10.1353/hub.2003.0011.  hdl:  1808/16191.  PMID  12617487 .  CS1 maint: ref=harv ( link)\n Ruhlen, Merritt (10 November 1998).  &#34;The origin of the Na-Dene&#34;.  Proceedings of the National Academy of Sciences.  95 (23): 13994–13996.  Bibcode: 1998PNAS...9513994R.  doi: 10.1073/pnas.95.23.13994.  ISSN  0027-8424.  PMC   25007.  PMID  9811914.  CS1 maint: ref=harv ( link)\n Sicoli, Mark A.; Holton, Gary (12 March 2014).  &#34;Linguistic Phylogenies Support Back-Migration from Beringia to Asia&#34;.  PLoS ONE.  9 (3): e91722.  Bibcode: 2014PLoSO...991722S.  doi: 10.1371/journal.pone.0091722.  ISSN  1932-6203.  PMC   3951421.  PMID  24621925.  CS1 maint: ref=harv ( link)\n Vajda, Edward J. (2011). &#34;A Response to Campbell&#34;.  International Journal of American Linguistics.  77 (3): 451–452.  doi: 10.1086/660978.  CS1 maint: ref=harv ( link)\n Wilson, Joseph A. P. (2018). &#34;Postscript \n......", "posttime": "2020-08-09 11:55:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "叶尼塞,yeniseian,语言", "title": "登埃-叶尼塞亚语", "title_en": "Dené–Yeniseian Languages", "transed": 1, "url": "https://en.wikipedia.org/wiki/Dené–Yeniseian_languages", "via": "", "real_tags": ["叶尼塞", "yeniseian", "语言"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "--从提交中获取回购历史中每个提交的ID和作者电子邮件SELECT ID，Author_Email。\n-。\n--打印总提交分配百分比条形图(按作者姓名)，TOTAL_COMMITS(TOTAL)AS(SELECT COUNT(*)AS TOTAL FROM COMMITS)SELECT AUTER_NAME，ROUNT(*)*100.0/(SELECT TOTAL FROM TOTAL_COMMITS)，2)AS百分比，printf(&#39；%.&#39；||(CAST(ROUND(COUNT(*)*100.0/(SELECT TOTAL FROM TOTAL_COMMITS))AS INT)+1)||&#39；c&#39；&#。)AS COMMITIONS FROM COMMITS BY AUTHER_NAME ORDER BY百分比DESC", "note_en": "-- get the id and author email of every commit in the repo history SELECT id, author_email FROM commits\n -- get top commit counts by author (name)SELECT count(*) AS count, author_name FROM commits GROUP BY author_name ORDER BY count DESC\n -- print a bar chart of total commit distribution percentage (by author name)WITH total_commits(total) AS ( SELECT count(*) AS total FROM commits)SELECT author_name, round(count(*)*100.0 / (SELECT total FROM total_commits), 2) AS percentage, printf(&#39;%.&#39; || (CAST (round(count(*)*100.0 / (SELECT total FROM total_commits)) AS INT) + 1) || &#39;c&#39;, &#39;█&#39;) AS commitsFROM commits GROUP BY author_nameORDER BY percentage DESC", "posttime": "2020-08-09 11:55:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "存储,queries,百分比", "title": "Git存储库的SQL查询", "title_en": "SQL Queries for Git Repositories", "transed": 1, "url": "https://askgit.com/", "via": "", "real_tags": ["存储", "queries", "百分比"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rust和C++的一个引人注目的特性是零成本抽象。您可以编写高级代码，例如使用迭代器，这些代码会编译成与您手动编写的低级代码相同的机器代码。您可以添加抽象层，例如，将原始值包装在结构中并为其提供专门的API，而不会增加运行时开销。但是，仅当您启用了一组足够的编译器优化时，零成本才适用。不幸的是，启用这些优化会减慢编译速度，并且使用当前的编译器会浪费大量调试信息，使得使用这些二进制文件进行调试变得非常困难。由于Rust标准库(以及越来越多的C++标准库)大量使用零成本抽象，因此为了更好的调试和构建时间，使用非优化构建会创建比发布构建慢很多倍的二进制文件，而且通常非常慢。所以问题是：我们如何在保持零成本抽象的同时获得快速构建和高质量的调试信息？一种明显的方法是将启用的编译器优化集限制在实现零成本抽象所需的最低限度，并希望这能产生可接受的构建速度和调试信息质量。但是那是什么布景呢？如果它是所有的优化，那么这是没有帮助的。我猜这取决于我们想要支持的确切的零成本抽象模式集。以下是我认为需要列入列表的一些优化：内联：大多数或所有抽象都依赖于内联函数来实现零成本，因为它们将代码封装到您自己编写的函数中。所以，我们必须有侵略性的内衬。复制传播：内联函数之后，通过参数和结果的赋值链将需要使用复制传播来缩短。有限的死区消除和临时消除：复制传播后，不需要大量临时值。我们不应该存储它们的值或为它们分配空间。标量替换：许多抽象将变量打包到结构中，并将结构上的操作封装到函数中。优化器似乎需要能够撤销这一点，拆分结构并像对待任何其他标量变量一样对待原始组件。要使上面的优化在这些组件上工作，通常需要这样做。\n下面是一些我认为不需要出现在列表中的优化：寄存器分配：未经优化的调试构建通常几乎不进行寄存器分配：局部变量位于堆栈插槽中。因此，如果消除了不必要的临时变量(见上文)，则将幸存的变量存储在堆栈上并不是对抽象的惩罚。矢量化：未经优化的调试版本通常不做任何矢量化，所以我们可以继续不做，而不惩罚抽象。尾部调用：我想不出有哪种Rust或C++抽象依赖于TCO是零成本的。\n这是一个我不太确定的优化：公共子表达式消除：在Rust和C++中，有没有我们认为应该是零成本的需要CSE的通用抽象？我脑子里想不出任何东西。\n深入研究这一点并使用一组有前途的优化来实际配置Rust编译器并评估结果将是非常有趣的。解决整个问题的一种有点正交的方法是简单地提高优化构建的调试信息质量和构建速度。前者主要是大量的工程和架构工作，以便通过各种优化过程保存调试信息。有些问题是，某些优化(例如寄存器分配)会导致变量值在技术上仍在作用域内的程序点不可用，但像RR或更好的像Pernosco这样更好的记录和重放调试器可以绕过这一问题。构建速度确实是一个更难的问题：进行大量优化，特别是在所有簿记以保留调试信息的情况下，这本身就很昂贵。我想知道，如果您从零成本抽象的同时，以良好的调试信息和尽可能快的构建为目标，从头开始设计编译器后端会是什么样子。", "note_en": "A compelling feature of Rust and C++ is &#34;zero-cost abstractions&#34;. You can write &#34;high level&#34; code, e.g. using iterators, that compiles down to the same machine code as the low-level code that you&#39;d write by hand. You can add layers of abstraction, e.g. wrapping a primitive value in a struct and providing a specialized API for it, without adding run-time overhead. However, &#34;zero-cost&#34; only applies  if you enable an adequate set of compiler optimizations. Unfortunately, enabling those optimizations slows down compilation and, with current compilers, trashes a lot of debug information, making it very difficult to debug with those binaries. Since the Rust standard library (and increasingly the C++ standard library) makes heavy use of &#34;zero-cost&#34; abstractions, using non-optimized builds for the sake of better debugging and build times creates binaries that are many times slower than release builds, often untenably slow. So the question is:  how can we get fast builds and quality debuginfo while keeping zero-cost abstractions? An obvious approach is limit the set of enabled compiler optimizations to the minimum necessary to achieve zero-cost abstraction, and hope that that produces acceptable build speed and debuginfo quality. But what is that set? If it&#39;s &#34;all optimizations&#34;, then this is no help. I guess it depends on the exact set of &#34;zero-cost abstraction&#34; patterns we want to support. Here are some optimizations that I think need to be on the list: Inlining: Most or all abstractions depend on inlining functions to achieve zero-cost, because they encapsulate code into functions that you&#39;d otherwise write yourself. So, we must have aggressive inlining.  Copy propagation: After inlining functions, there will be chains of assignments through parameters and results that will need to be shortened using copy propagation.  Limited dead store elimination and temporary elimination: After copy propagation, a lot of temporary values aren&#39;t needed. We shouldn&#39;t store their values or allocate space for them.  Scalar replacement: Many abstractions package up variables into structs and encapsulate operations on the struct into functions. It seems likely that the optimizer needs to be able to undo that, taking structs apart and treating primitive components like any other scalar variable. This would typically be needed to make the above optimizations work on those components.\n Here are some optimizations that I think  don&#39;t need to be on the list: Register allocation: Unoptimized debug builds typically do almost no register allocation: local variables live in stack slots. Thus, if unnecessary temporaries are eliminated (see above) storing the surviving variables on the stack is not penalizing abstraction.  Vectorization: Unoptimized debug builds typically don&#39;t do any vectorization, so again we can just keep on not doing it without penalizing abstraction.  Tail calls: I can&#39;t think of a Rust or C++ abstraction that relies on TCO to be zero-cost.\n Here&#39;s an optimization I&#39;m not sure about: Common subexpression elimination: Are there common abstractions that we think should be zero-cost in Rust and C++ that require CSE? I can&#39;t think of any off the top of my head.\n It would be very interesting to dive into this further and actually configure the Rust compiler with a promising set of optimizations and evaluate the results. A somewhat orthogonal approach to the whole problem is to simply improve the debuginfo quality and build speed of optimized builds. The former is mostly a lot of engineering and architectural work to preserve debuginfo through various optimization passes. There are issues where some optimizations (e.g. register allocation) cause variable values to be unavailable at program points where they&#39;re technically still in scope — but good record-and-replay debuggers like  rr or better still omniscient debuggers like  Pernosco can get around that. Build speed is really the harder problem: doing lots of optimizations, especially with all the bookkeeping to preserve debuginfo, is inherently expensive. I wonder what a compiler backend would look like if you designed from scratch with the goal of good debuginfo and the fastest possible builds while enabling zero-cost abstractions.", "posttime": "2020-08-09 11:55:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抽象,set,优化", "title": "零成本抽象所需的最小优化集是什么？", "title_en": "What Is the Minimal Set of Optimizations Needed for Zero-Cost Abstraction?", "transed": 1, "url": "https://robert.ocallahan.org/2020/08/what-is-minimal-set-of-optimizations.html", "via": "", "real_tags": ["抽象", "set", "优化"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章是关于这个世界在一生中会发生多少变化。尽管在技术、人权和社会正义方面有许多相似之处，但我将把注意力集中在科学上。\n我出生于1954年末，所以我65岁了。我想，如果运气好的话，我还有30年的活跃的知识生活。但是，如果我回顾和展望我的家庭，我知道我的一些祖父母是在19世纪末出生的，我预计他们长大后都会认识我自己的孙子孙女，他们肯定会活到22世纪。从十九世纪到二十二世纪，我与我自己的直系基因系成员的成人到成人的互动将跨越五代人，从他们集体生活的开始到结束，跨越200多年。\n我将展示在我的有生之年，科学上的变化是多么令人震惊，自从我的祖父母出生以来，这些变化是如何令人震惊的，通过归纳，我将推测在我的孙子们的有生之年还会有多少震惊。所有我认识的人。\n不是所有的事情都会改变，但到下个世纪初，我们今天认为是真理和显而易见的一些事情肯定不会再是这样了。我们不能确切地知道他们中的哪一个会被淘汰，但我会推荐相当多的候选人。如果至少一个世纪后他们中的一些人没有半途而废，我会感到震惊。\n我最年长的祖父母出生在1887年迈克尔逊-莫利实验之前，该实验确定宇宙中并不充满以太，而是充满了真空。\n甚至在我的四位祖父母都还活着的时候，相对论和量子力学都没有被考虑过。由质子和中子组成的原子核，被一团电子包围，是未知的。没有检测到X射线和其他辐射。\n人们认为地球的年龄只有2000万到4000万年，直到我出生后，目前的估计才第一次公布。\n在我父亲出生两个月后，埃德温·哈勃描述了星系，并宣布我们生活在众多星系中的一个，在我们的情况下，就是银河系。在我父亲年轻的时候，人们发现了一些元素可能是裂变的可能性，以及一些元素可能是可熔化的想法。当宇宙大爆炸理论首次提出时，他已经是一个从战争中回来的成年人，直到最近30年，替代方案才在很大程度上被叫停。\n在我的有生之年，我们最初只有9颗行星，现在已经减少到8颗，现在已经在附近的恒星系统中观测到了数千颗。板块构造学，它首先揭示了大陆在历史上并不是静态存在的，并解释了地震和火山都是在我出生后首次提出的假设。\n就在我出生的前一年，克里克和沃森确定了DNA的结构。当克里克假设DNA到RNA的翻译和转录机制时，我还是个蹒跚学步的孩子，在学校，当第一个实验结果显示它可能是如何工作的时候，在大学里，在它基本上被弄清楚之前，我还是个蹒跚学步的孩子。后来人们意识到，大多数动植物DNA并不编码蛋白质，因此它被贴上了垃圾DNA的标签。随着时间的推移，人们逐渐发现了这种DNA的其他功能，现在它被称为非编码DNA。它的所有功能还没有被开发出来。\n我在研究生院时发现，将地球上所有的生命分裂成原核生物(无核细胞)和真核生物(有核细胞)是不够的。所有的动物、植物和真菌都属于后一类。但事实上，有两种截然不同的原核生物，都是单细胞的，细菌和古菌。后者是完全未知的，直到1977年第一批被发现。现在，生命树上有古生菌和真核生物从与细菌不同的分支上的一个公共点分枝。我们与未知古菌的亲缘关系比与细菌的亲缘关系更密切。我们完全忽略了一种主要的生物类型；地球上的古生菌的质量总和是所有动物的三倍多。我们只是完全没有意识到它们-它们主要位于深层的地下环境中，所以无可否认，它们并没有隐藏在人们的视线中。\n就在过去的几年里，我们已经意识到，人体内含有细菌的细胞比含有我们DNA的细胞多10倍，尽管细菌的质量只占我们体重的3%左右。在那之前，我们认为我们基本上就是我们自己。\n神经元的物理结构和它们相互联系的方式是在我的祖父母已经十几岁和年轻人的时候第一次被发现的。神经元的粗略运作方式在我出生前的十年就已阐明，但第一篇阐述神经元如何在整体中运作的功能性解释的论文直到我上幼儿园时才出现(在“青蛙的眼睛告诉青蛙的大脑”一文中)。长期以来，人们一直认为大脑中一半的细胞，即胶质细胞，是神经元的物质支持和营养供应者，在神经系统的活动中没有发挥直接作用。在二十世纪下半叶，我们已经了解到它们在神经传递中发挥作用，并调节神经元的各种行为。还有很多东西需要学习。最近，大脑中局部扩散的小分子的作用也被证明也会影响神经元的运作方式。\n自从我的祖父母出生以来，科学界对宇宙学、物理学、生命机制和神经科学的了解发生了巨大的变化，而且一直持续到今天。我们的科学信仰不是一成不变的，而是不断演变的。\n在我看来，我的孙子们似乎完全不可能有一天能够说，在他们出生之前，科学思想来来去去，公认的真理经常变化，但自从他们出生以来，科学一直非常稳定地保持在一系列公认的真理中。\n情况将继续发生变化。下面我列出了一些我认为从现在到下个世纪初可能会发生变化的事情。我并不是说这些中的任何一个都会发生变化。如果其中一半以上会被采纳，我会感到非常惊讶。但我选择了目前让我头疼的想法，感觉并不像科学中的其他一些想法那样可靠。一些人无疑会变得更加稳固。但如果其中任何一个人变成公认的智慧，我也不会感到太惊讶。\n我们发现，古生菌、细菌和真核生物(生命的第四个领域)有一个共同的祖先，它们仍然存在于地球上的一些地方-而且它显然是我们现在所知的这三个领域的前身，因为它没有完整的现代DNA版本的遗传学，而是基于DNA和RNA的遗传学的混合，或者纯粹的RNA，或者纯粹的PNA，并且有一个简化的祖先编码方案。\n我们在太阳系的其他地方发现了生命，它显然与地球上的生命没有关系。它是不同的，有不同的成分和机制，它的非生物发生明显独立于地球上的发生。\n我们探测到一颗行星上的生命，我们可以在附近的太阳系中观察到这些生命。\n我们在植物中发现了丰富的控制系统的原理，它不是基于神经元，但解释了当我们加速拍摄植物在世界上运行的视频时，我们可以观察到的植物的复杂行为。电子中心主义到此为止！\n我们摆脱了计算神经科学，使用了一组新的隐喻，事实证明，这些隐喻既有更好的解释能力，又提供了解释神经系统原本迟钝的方面的工具。\n我们不仅发现了一个不同的隐喻，而且在神经系统中发现了我们以前没有意识到的实际新机制，它们在我们对大脑的理解中占据主导地位。\n如果你想成为一名著名的科学家，那么就想出其中的一个吧。你们将重新引导人类主要的智力追求。但是，这将是一条漫长而寂寞的道路。", "note_en": "This post is about how much things can change in the world over a lifetime. I’m going to restrict my attention to science, though there are many parallels in technology, human rights, and social justice.\n I was born in late 1954 so I am 65 years old. I figure I have another 30 years, with some luck, of active intellectual life. But if I look backward and forward within my family, I knew as an adult some of my grandparents who were born late in the nineteenth century, and I expect that both I will know some of my own grandchildren when they are adults, and that they will certainly live into the twenty second century. My adult to adult interactions with members of my own direct genetic line will span five generations and well over two hundred years from the beginning to the end of their collective lives, from the nineteenth to the twenty second century.\n I’m going to show how shocking the changes have been in science throughout just my lifetime, how even more shocking the changes have been since my grandparents were born, and by induction speculate on how much more shock there will be during my grandchildren’s lifetimes. All people who I have known.\n Not everything will change, but certainly some things that we treat as truth and obvious today will no longer seem that way by early next century. We can’t know exactly which of them will be discarded, but I will put up quite a few candidates. I would be shocked if at least some of them have not fallen by the wayside a century from now.\n  My oldest grandparent was born before the Michelson-Morley experiment of 1887 that established that the universe was not filled with aether, but rather with vacuum.\n Even when all four of my grandparents were first alive neither relativity nor quantum mechanics had been thought of.  Atoms with a nucleus of protons and neutrons, surrounded by a cloud of electrons were unknown. X rays and other radiation had not been detected.\n The Earth was thought to be just 20 to 40 million years old, and it wasn’t until after I was born that the current estimates were first published.\n It was two months after my father was born that Edwin Hubble described galaxies and declared that we lived in one of many, in our case the Milky Way. While my father was young the possibility that some elements might be fissile was discovered, along with the idea that some might be fusible. He was an adult back from the war when the big bang theory of the universe was first proposed, and it is only in the last 30 years that alternatives were largely shouted down.\n In my lifetime we started out with nine planets, went down to eight, and now have observed thousands of them in nearby star systems. Plate tectonics, which first revealed that continents were not historically statically in place and explained both earthquakes and volcanoes were first hypothesized after I was born.\n Crick and Watson determined the structure of DNA just the year before I was born. I was a toddler when Crick hypothesized hypothesized the DNA to RNA translation and transcription mechanism, in school when the first experimental results showing how it might work came in, and in college before it was mostly figured out. Then it was realized that most animal and plant DNA does not code for proteins, and so it was labeled as  junk DNA. Gradually over time other functions for that DNA have been discovered and it is now called   non-coding DNA. All its functions have still not been worked out.\n I was in graduate school when it was figured out that the split of all life on Earth into prokaryotes (cells without a nucleus) and eukaryotes (cells with a nucleus) was inadequate. All animals, plants, and fungi, belong to the latter class. But in fact there are two very distinct sorts of prokaryotes, both single celled, the bacteria and the archaea. The latter were completely unknown until the first ones were found in 1977. Now the tree of life has archaea and eukaryotes branching off from a common point on a different branch than the bacteria. We are more closely related to the unknown archaea than we are to bacteria. We had completely missed a major type of living organism; the archaea on Earth have a combined mass of more than three times that of all animals. We were just plain unaware of them–they are predominantly located in deep subsurface environments, so admittedly they were not hiding in plain sight.\n In just the last few years we have realized that human bodies contain ten times more cells that are bacteria, than they contain cells that have our DNA in them, though the bacterial mass is only about 3% of our body weight. Before that we thought we were mostly us.\n The physical structure of neurons and the way they connect with each other was first discovered when my grandparents were already teenagers and young adults. The rough way that neurons operate was elucidated in the decade before my birth, but the first paper that laid out a functional explanation of how neurons could operate in an ensemble did not occur until I was already in kindergarten (in the “What the Frog’s Eye Tells the Frog’s Brain paper”). Half the cells in brains, the  glia, were long thought to be physical support and suppliers of nutrients to the neurons, playing no direct role in what neural systems did. In the second half of the twentieth century we have come to understand that they play a role in neurotransmission, and modulate all sorts of behavior of the neurons. There is still much to be learned. More recently the role of small molecules diffusing locally in the brain have been shown to also affect how neurons operate.\n What is known in science about cosmology, physics, the mechanisms of life, and neuroscience had changed drastically since my grand parents were born, and have continued to change right up until today. Our scientific beliefs have not been static, and have constantly evolved.\n  It seems entirely unlikely to me that my grandchildren will one day be able to say that up until they were born scientific ideas came and went with accepted truth regularly changing, but since they were born science has been very stable in its set of accepted truths.\n Things will continue to change. Below I have put a few things that I think could change from now into the beginning of the next century. I am not saying that any particular one of these will be what changes. And I would be very surprised if more than half of these will be adopted. But I have selected the ideas that currently gnaw at me and do not feel as solid as some other ideas in science. Some will no doubt become more solid. But it will not surprise me so much if any individual one of these turns into accepted wisdom.\n      We discover that there is a common ancestor to archaea, bacteria, and eukarya, a fourth domain of life, that still exists in some places on Earth–and it is clearly a predecessor to the three that we know about now in that it does not have the full modern DNA version of genetics, but instead is a mixture of DNA and RNA based genetics, or purely RNA, or perhaps purely PNA, and has a simplified ancestral coding scheme.\n We discover life elsewhere in the solar system and it is clearly not related to life on Earth. It is different, with different components and mechanisms, and its abiogenesis was clearly independent of the one on Earth.\n We detect life on a planet that we can observe in a nearby solar system.\n  We discover the principles of a rich control system in plants that is not based on neurons, but nevertheless explains the complex behaviors of plants that we can observe when we speed up videos of them operating in the world. So much for electro-centrism!\n We move away from computational neuroscience with a new set of metaphors that turn out to have both better explanatory power and provide tools that explain otherwise obtuse aspects of neural systems.\n We find not just a different metaphor, but actual new mechanisms in neural systems of which we have not previously been aware, and they become dominant in our understanding of the brain.\n  If you want to be a famous scientist then figure one of these out. You will redirect major intellectual pursuits of mankind. But, it will be a long lonely road.", "posttime": "2020-08-09 11:54:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "事情,change,dna", "title": "事情可以改变多少", "title_en": "How much things can change", "transed": 1, "url": "http://rodneybrooks.com/how-much-things-can-change/", "via": "", "real_tags": ["事情", "change", "dna"]}, {"category": "", "categoryclass": "", "imagename": "29d659f6ccba14176b69f2558823b225.jpg", "infoid": 1017070, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Linux基金会今天表示，它正在主持一个新的基金会，该基金会将把世界上一些最重要的开源安全倡议纳入一个新的保护伞之下。\n新成立的开源安全基金会将主持安全项目，如核心基础设施倡议(Core Infrastructure Initiative)，该倡议是为了应对2014年在Open SSL协议中发现的臭名昭著的心脏出血漏洞而设立的，以及由GitHub Inc.的安全实验室于2019年创立的开放源代码安全联盟(Open Source Security Coalition)。\nOpenSSF的创始成员包括一些科技界最大的公司，如GitHub、谷歌(Google LLC)、IBM、英特尔(Intel Corp.)、微软(Microsoft Corp.)、红帽(Red Hat Inc.)、优步(Uber Technologies Inc.)。和VMware Inc.。\nOpenSSF的目标是通过将其最受欢迎的项目和支持这些项目的公司汇聚在一起，简化行业的开源安全努力。*其创始人表示，开源软件在当今的技术中已经变得无处不在，从数据中心到消费设备，无所不包。\n但是大多数开源软件项目都极其复杂，有很长的贡献者和依赖链，这使得它很难得到保护。OpenSSF说，因此，这些公司迫切需要了解和验证这些依赖链的安全性。\nOpenSSF已经成立了管理委员会和技术咨询委员会，并计划主持一系列项目，旨在保护世界上最受欢迎的开源软件。这个想法有点类似于云原生计算基金会，它也是由Linux基金会托管的，是促进Kubernetes等重要开源云原生软件项目开发的主要组织。\nLinux基金会执行董事吉姆·泽姆林(Jim Zemlin)表示：“我们相信开源是一种公共产品，在每个行业，我们都有责任团结起来，改善和支持我们都依赖的开源软件的安全性。”他说：“确保开放源码安全是我们能做的最重要的事情之一，它需要我们世界各地的所有人协助这一努力。OpenSSF将为真正的协作、跨行业努力提供论坛。“。\n星座研究公司。分析师Holger Mueller告诉SiliconANGLE，让开源软件更安全是至关重要的，因为这是为数不多的几个传统的、非专有软件资产保持优势的领域之一。\n穆勒说：“很高兴看到这一倡议得到了广泛的支持，因为安全不能零敲碎打地交付。安全太重要了，不能变得复杂，否则采用成本将对下一代应用程序造成太大的惩罚性。”\n通过一键订阅我们的YouTube频道(如下所示)，显示您对我们使命的支持。我们的订阅用户越多，YouTube向您推荐的相关企业和新兴技术内容就越多。谢谢!。\n…。我们还想告诉您我们的使命，以及您如何帮助我们完成它。SiliconANGLE Media Inc.的商业模式是基于内容的内在价值，而不是广告。与许多在线出版物不同的是，我们没有付费墙或投放横幅广告，因为我们想让我们的新闻保持开放，不受影响，也不需要追逐流量。关于SiliconANGLE的新闻、报道和评论-以及我们的硅谷演播室和CUBE的全球巡回视频团队提供的现场无脚本视频-需要大量的辛勤工作、时间和金钱。要保持高质量，需要赞助商的支持，这些赞助商与我们对无广告新闻内容的愿景保持一致。\n如果您喜欢这里的报道、视频采访等无广告内容，请花点时间查看一下我们赞助商支持的视频内容样本，发推特表示支持，并不断回到SiliconANGLE。", "note_en": "The Linux Foundation said today it’s presiding over a new foundation that brings some of the world’s most important open-source security initiatives under a new umbrella.\n The newly launched  Open Source Security Foundation will host security projects such as the Core Infrastructure Initiative, which was set up in response to the infamous  Heartbleed vulnerability discovered in the Open SSL protocol in 2014, and the  Open Source Security Coalition, founded by GitHub Inc.’s Security Lab in 2019.\n OpenSSF’s founding members include some of tech’s biggest names, such as GitHub, Google LLC, IBM Corp., Intel Corp., Microsoft Corp., Red Hat Inc., Uber Technologies Inc. and VMware Inc.\n The goal of OpenSSF is to simplify the industry’s open source security efforts by bringing together its most popular projects and the companies that support them. Its founders say that open-source software has become pervasive in today’s technology, used in everything from data centers to c0nsumer devices.\n But most open-source software projects are extremely complex, with a long chain of contributors and dependencies that make it difficult to secure. As a result, companies have a pressing need to understand and verify the security of these dependence chains, OpenSSF says.\n OpenSSF has already established a Governing Board and Technical Advisory Council and plans to host a range of projects that aim to secure the world’s most popular open-source software. The idea is somewhat similar to that of the  Cloud Native Computing Foundation, which is also hosted by the Linux Foundation and is the primary organization that fosters the development of important open-source cloud native software projects such as Kubernetes.\n “We believe open source is a public good and across every industry we have a responsibility to come together to improve and support the security of open-source software we all depend on,” said Jim Zemlin, executive director at the Linux Foundation. “Ensuring open source security is one of the most important things we can do and it requires all of us around the world to assist in the effort. The OpenSSF will provide that forum for a truly collaborative, cross-industry effort.”\n Constellation Research Inc. analyst Holger Mueller told SiliconANGLE that it’s critical to make open source software more secure as it’s one of the few areas where traditional, proprietary software assets retain an advantage.\n “It’s good to see the broad support for this initiative as security cannot be delivered piecemeal,” Mueller said. “Security is too important to become complex, as otherwise the cost of adoption will be too punitive for next generation applications.”\n  Show your support for our mission with our one-click subscription to our YouTube channel (below). The more subscribers we have, the more YouTube will suggest relevant enterprise and emerging technology content to you. Thanks!\n  … We’d also like to tell you about our mission and how you can help us fulfill it. SiliconANGLE Media Inc.’s business model is based on the intrinsic value of the content, not advertising. Unlike many online publications, we don’t have a paywall or run banner advertising, because we want to keep our journalism open, without influence or the need to chase traffic. The journalism, reporting and commentary on  SiliconANGLE — along with live, unscripted video from our Silicon Valley studio and globe-trotting video teams at   theCUBE — take a lot of hard work, time and money. Keeping the quality high requires the support of sponsors who are aligned with our vision of ad-free journalism content.\n If you like the reporting, video interviews and other ad-free content here, please take a moment to check out a sample of the video content supported by our sponsors,   tweet your support, and keep coming back to   SiliconANGLE.", "posttime": "2020-08-09 11:29:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,软件,基金会,foundation,安全", "title": "Linux基金会推出开放源码安全基金会，将世界上一些最重要的开放源码软件安全倡议整合到一个保护伞下", "title_en": "Linux Foundation launches Open Source Security Foundation to bring some of the world's most important OSS security initiatives under one umbrella", "transed": 1, "url": "https://siliconangle.com/2020/08/03/linux-foundation-announces-new-initiative-secure-open-source-software/", "via": "", "real_tags": ["linux", "软件", "基金会", "安全"]}, {"category": "", "categoryclass": "", "imagename": "8e34c86e915fe8daa924c9f714549337.png", "infoid": 1017068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本教程中，我们将介绍另一种寻找问题最佳解决方案的技术。动态规划(/Lessons/Memoization-in-Dynamic-Programming)考虑了一个程序的所有解…", "note_en": "In this tutorial, we'll look at yet another technique for finding an optimal solution to a problem. Dynamic programming (/lessons/memoization-in-dynamic-programming) considers all the solutions of a pr...", "posttime": "2020-08-09 11:03:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithms,实例,规划", "title": "通过实例了解贪婪算法", "title_en": "Getting to Know Greedy Algorithms Through Examples", "transed": 1, "url": "https://algodaily.com/lessons/getting-to-know-greedy-algorithms-through-examples?view=article", "via": "", "real_tags": ["算法", "实例", "规划"]}, {"category": "", "categoryclass": "", "imagename": "5c4ec878e0afe8f00afcb0e71bca8d35.jpeg", "infoid": 1017067, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是关于利用WebRTC中的漏洞利用Messenger应用程序的三部分系列。博客文章中讨论的CVE-2020-6514已使用这些CLS在7月14日进行了修复。本系列重点介绍了当应用程序未安装WebRTC补丁程序以及安全问题的通信和通知中断时可能出现的问题。在第2部分中，我描述了Android上的WebRTC漏洞攻击。在本节中，我将探讨它在哪些应用程序上工作。\n在编写利用漏洞时，我最初通过更改WebRTC的源代码并重新编译它来更改发送到目标设备的SCTP数据包。这对于攻击封闭源代码的应用程序是不现实的，所以我最终转而使用Frida来挂接攻击设备的二进制代码。Frida的挂钩功能允许在调用特定本机函数之前和之后执行代码，这允许我利用漏洞更改传出的SCTP数据包以及检查传入的数据包。从功能上讲，它等同于更改攻击客户端的源代码，但不是在编译时对源代码进行更改，而是由Frida在运行时动态进行更改。此处提供了利用漏洞的来源。\n利用漏洞攻击还需要目标设备二进制的三个地址偏移量。系统函数和malloc函数之间的偏移量，以及上一次POST中描述的小工具和malloc函数之间的偏移量是其中的两个。这些偏移量位于libc中，这是一个Android系统库，因此需要根据目标设备的Android版本来确定它们。还需要从Cricket：：SctpTransport vtable的位置到全局偏移表中malloc的位置的偏移量。这必须从被攻击的应用程序中包含WebRTC的二进制文件中确定。\n请注意，提供的利用漏洞脚本有一个严重的限制：每次读取内存时，只有在设置了指针的第31位时才会起作用。第2部分解释了出现这种情况的原因。利用脚本提供了一个示例，说明如何修复此问题并使用FWD_TSN块读取任何指针，但这并不是针对每个读取实现的。出于测试目的，我重置了设备，直到WebRTC库映射到合适的位置。\n通过在Google Play上的APK文件中搜索usrsctp中的特定字符串，确定了集成WebRTC的流行Android应用程序列表。大约有200个用户超过500万的应用程序似乎在使用WebRTC。我对这些应用程序进行了评估，以确定它们是否可能受到利用漏洞中的漏洞的影响，以及会有什么影响。\n事实证明，应用程序使用WebRTC的方式多种多样，但可以分为四大类。\n投影：在用户同意增强可用性的情况下，将移动应用程序的屏幕和控件投影到桌面浏览器中。\n流式传输：音频和视频内容从一个用户发送到多个用户。通常有一个中间服务器，因此发送者不需要管理可能数以千计的对等点，内容会被记录下来供以后查看\n对于这些类别中的每一个类别，利用漏洞中使用的漏洞的影响是不同的。投影的风险很低，因为建立WebRTC连接需要进行大量的用户交互，而且用户首先可以访问连接的两端，因此损害另一端几乎没有什么好处。\n流媒体的风险也相当低。虽然当流的观看者数量较少时，某些应用程序可能会使用点对点连接，但它们通常使用中间服务器来终止来自发送对等点的WebRTC连接，并开始与接收对等点的新连接。这意味着攻击者通常不能将格式错误的数据包直接发送到对等点。即使采用对等流传输的设置，目标也需要用户交互才能查看流，并且通常无法限制谁可以访问流。因此，使用WebRTC的流应用程序可能对有针对性的攻击没有用处。当然，这些漏洞也有可能会影响流媒体服务使用的服务器，但本研究没有对此进行调查。\n浏览器几乎肯定容易受到WebRTC中的大多数错误的攻击，因为它们允许对如何配置进行大量控制。要利用浏览器中的此类缺陷，攻击者需要设置一个与对等连接中的其他对等设备行为相似的主机，并说服目标访问启动对该主机的呼叫的网页。在这种情况下，该漏洞将对JavaScript中的其他内存损坏漏洞产生类似的影响。\n会议是WebRTC的最高风险使用，但漏洞的实际影响在很大程度上取决于应用程序用户之间的联系方式。风险最高的设计是这样一个应用程序，在该应用程序中，任何用户都可以根据标识符联系任何其他用户。一些应用程序要求被呼叫者在进行呼叫之前已经以特定方式与呼叫者进行了交互，这使得用户更难联系目标，并且通常降低了风险。有些应用程序要求用户输入代码或访问链接才能开始通话，这也有类似的效果。还有一大组应用程序很难或不可能呼叫特定用户，例如聊天轮盘赌应用程序，以及具有允许用户开始呼叫客户支持的特征的应用程序。\n在这项研究中，我将重点放在允许用户联系特定其他用户的会议应用程序上。这将我的200个应用程序列表减少到14个应用程序，如下所示。\n这份榜单编制于2020年6月18日。请注意，有几个应用程序被删除，因为它们的服务器在那一天没有运行，或者它们很难测试(例如，需要观看多个广告才能拨打一个电话)。\n这篇博客文章不会指出一个测试过的应用程序，因为在测试过程中发现了一个严重的附加漏洞，该漏洞尚未修复或已达到披露截止日期。此博客帖子将在披露截止日期过后更新。\n以下部分介绍我针对上述应用程序测试利用漏洞的尝试。请注意，由于应用程序的数量，每个应用程序花费的时间有限，因此不能保证考虑对WebRTC的每一次攻击。虽然我非常相信被发现可被利用的应用程序确实是可被利用的，但我对被发现不可利用的应用程序就不那么有信心了。如果您出于保护用户的目的需要了解特定应用程序是否易受攻击，请联系供应商，而不是依赖此帖子。\n我从测试Signal开始，因为它是这个列表中唯一的开源应用程序。Signal将WebRTC集成为名为ringrtc的库的一部分。我构建了ringrtc，然后使用符号发出信号，然后将所需的符号与攻击者设备上的Frida脚本挂钩。我尝试了这个漏洞，大约90%的时间是有效的！\n此攻击不需要用户与目标设备进行任何交互，因为Signal在应答传入呼叫之前启动WebRTC连接，并且此连接可以接受传入的RTP和SCTP。由于错误376要求将释放的堆分配替换为线程执行的相同大小的下一次分配，并且偶尔另一个线程会同时执行相同大小的分配，因此在信号和其他目标上，利用漏洞攻击不是100%可靠的。失败会导致用户通常看不到的崩溃，因为进程会重新启动，但会出现未接呼叫。\n此漏洞是在2020年1月13日发布的信号4.53.6上执行的，因为在我完成漏洞攻击时，Bug 376已经在信号中打了补丁。CVE-2020-6514在更高版本中也已修复，并且ASCONF在usrsctp中也已禁用，因此不再可以访问导致错误376的代码。Signal最近还实现了一项功能，当呼叫者不在被呼叫者的联系人中时，需要用户交互才能启动WebRTC连接。Signal也已停止在测试版中使用SCTP，并计划在测试后将此更改添加到发布客户端。此处提供了此利用漏洞的来源。\nDuo也是一个有趣的目标，因为它预装在如此多的Android设备上。它动态链接Android WebRTC库libjingle_peerconnection_so.so，没有明显的修改。我在RDA中对这个库进行了逆向工程，以找到需要挂接的所有函数的位置，然后修改Frida脚本以基于它们与导出符号的偏移量来挂接它们。我还修改了Cricket：：SctpTransport vtable和全局偏移表之间的偏移量，因为它不同于Signal中的偏移量。这一漏洞也对Duo起到了作用。二人组攻击的源代码可以在这里获得。\n此漏洞不需要任何用户交互，因为与SIGNAL一样，DUO在应答呼叫之前启动WebRTC连接。\n该漏洞在2019年12月15日发布的版本68.0.284888502.DR68_RC09上进行了测试。自那以后，该漏洞已被修复。此外，在这款应用程序发布时，Duo可以呼叫任何安装了Google Play服务的Android设备，无论是否安装了Duo。现在情况不再是这样了。用户现在需要设置DUO，并将呼叫者放在他们的联系人中，才能接收来电。\n虽然Google Hangout使用WebRTC，但它不使用数据通道，也不交换SDP来建立呼叫，因此没有明显的方法从对等设备启用它们。因此，该漏洞在Hangout上不起作用。\nFacebook Messenger是另一个有趣的目标。它有大量的用户，根据它的文档，任何用户都可以根据自己的手机号码呼叫任何其他用户。Facebook Messenger将WebRTC集成到一个名为LibrtcR11.so的库中，该库动态链接到另一个库libxplat_third-party_usrsctp_usrsctpAndroid.so中的usrsctp。Facebook Messenger动态下载这些库，而不是将它们包含在APK中，因此很难识别我检查的版本，但它是在2020年6月22日下载的。\nLibrtcR11.so库似乎使用了大约6年前的WebRTC版本，因此在Cricket：：SctpTransport类出现之前。也就是说，类似的类Cricket：：DataMediaChannel似乎容易受到CVE-2020-6514的攻击。Libxplat_third-party_usrsctp_usrsctpAndroid.so库看起来更现代，但包含Bug376的易受攻击代码。也就是说，似乎不可能从Facebook Messenger访问此代码，因为它被设置为使用RTP数据通道而不是SCTP数据通道，并且不接受通过会话描述协议(SDP)更改通道类型的尝试。虽然尚不清楚此设计背后的动机是否是安全，但这是一个很好的例子，说明限制攻击者访问功能可以如何降低应用程序的漏洞。Facebook还会等到呼叫应答后才启动WebRTC连接，这进一步降低了影响它的任何WebRTC漏洞的可利用性。\n有趣的是，Facebook Messenger在一个名为LibrtcR20.so的库中还包含了一个更新版本的WebRTC，但应用程序似乎并没有使用它。通过在Android上设置系统属性，可以让Facebook Messenger使用备用库，但我找不到攻击者可以使设备切换库的方法。\n与Facebook Messenger类似，而Viber版本13.3.0.5似乎包含易受攻击的代码，但该应用程序在创建PeerConnectionFactory时会禁用SCTP。这意味着攻击者无法访问易受攻击的代码。\nVK是Mail.ru发布的一款社交网络应用程序，在允许每个用户呼叫他们之前，用户必须明确允许特定的其他用户联系他们。我在VK上测试了我的漏洞，它需要一些修改才能工作。首先，VK不使用数据通道作为其WebRTC连接的一部分，所以我必须启用它。为此，我用Java编写了一个挂接nativeCreateOffer的Frida脚本，并在创建报价之前调用了createDataChannel。这足以在两台设备上启用SCTP，因为目标设备根据攻击者提供的SDP确定是否启用SCTP。WebRTC的版本也比我为其编写漏洞的版本旧。WebRTC不包含任何版本信息，因此很难确定，但根据日志条目，该库似乎至少有一年的历史。这意味着利用漏洞使用的“假对象”中的一些偏移量是不同的。通过几处更改，我就可以利用VK了。\nVK向目标设备发送SDP提议以启动呼叫，但目标在用户接受呼叫之前不会返回SDP应答，这意味着此利用需要目标在WebRTC连接开始之前应答呼叫。这意味着除非目标手动应答呼叫，否则攻击将不起作用。在下面的视频中，在用户应答之后，漏洞攻击需要相当长的时间才能运行。这是由于我是如何设计利用漏洞的，而不是由于它使用的漏洞的基本限制。具体地说，即使漏洞利用脚本可以更快地生成特定数据包，利用漏洞攻击也会等待usrsctp生成特定数据包，并且还会在可以检查响应时使用延迟来避免数据包重新排序。只要付出足够的努力，此攻击很可能在不到5秒的时间内运行。还请注意，我更改了利用漏洞攻击来处理单个传入呼叫，而不是上面利用漏洞攻击中的两个传入呼叫，因为期望目标快速连续应答两次呼叫是不现实的。这不需要对利用漏洞的工作方式进行重大更改，尽管这确实会使利用漏洞的代码更加复杂和难以调试。\n无论如何，要求用户在呼叫之前必须选择接受攻击者的呼叫，以及要求用户接听呼叫并保持在线几秒钟，与没有这些功能的应用程序相比，这种利用漏洞攻击对VK的用处要小得多。\n针对VK 6.7(5631)执行测试。与Facebook一样，VK也动态下载其WebRTC版本，因此很难指定其版本，但测试是在2020年7月13日进行的。VK已经更新了他们的服务器，这样用户就不能使用包含数据通道的SDP发起呼叫，因此利用漏洞不再起作用。请注意，VK不使用WebRTC进行两方呼叫，只使用组呼叫，因此我使用组呼叫测试了此漏洞。此处提供了利用漏洞的来源。\nOK和Tamtam是由同一家供应商发布的类似的消息传递应用程序，也是Mail.ru。他们使用动态下载的WebRTC版本，该版本与VK使用的版本相同。因为库是完全相同的，所以我的漏洞也在OK上起作用了，而且我也没有费心去测试Tamtam，因为它太相似了。\n与VK一样，在目标通过与电话交互应答呼叫之前，OK和TAMTAM不会返回SDP应答，因此这不是对OK和TAMTAM的完全远程利用。OK还要求用户选择接受来自另一个用户的消息，然后该用户才能呼叫他们。TAMTAM稍微宽松一些，例如，如果用户验证了电话号码，任何有他们电话号码的用户都可以联系他们。\n测试于7月13日(星期一)在OK版本20.7.7上执行。仅SDP测试在TAMTAM版本2.14.0上执行。从那时起，这些应用程序的服务器已经更新，因此包含数据通道的SDP不能用于发起呼叫，因此利用漏洞不再起作用。\nDiscorde详细记录了它对WebRTC的使用。该应用程序使用中间服务器进行WebRTC连接，这意味着对等方不可能向另一个对等方发送原始SCTP，而这是利用漏洞工作所必需的。不和谐还需要几次点击才能进入呼叫。由于这些原因，不和谐不会受到本文讨论的漏洞的影响。\nJioChat是一款即时通讯应用程序，允许任何用户根据电话号码呼叫任何其他用户。分析版本3.2.7.4.0211，它的WebRTC集成似乎包含这两个漏洞，并且应用程序在被呼叫者接受传入呼叫之前交换SDP提供和应答，因此我预计该攻击将在没有用户交互的情况下工作。然而，当我测试它时情况并非如此，结果是JioChat使用了一种不同的策略来阻止WebRTC连接启动，直到被调用者接受了调用。我可以很容易地绕过这个策略，并让利用漏洞在JioChat上工作。\n不幸的是，JioChat的连接延迟策略引入了另一个漏洞，该漏洞已经修复，但披露期限尚未过期。因此，有关如何绕过它的详细信息将不会在此博客文章中分享。此处提供了没有此功能的利用漏洞的来源。JioChat最近更新了他们的服务器，因此包含数据通道的SDP不能用于发起呼叫，这意味着利用该漏洞在JioChat上不再起作用。\nSack和ICQ的相似之处在于，它们都集成了WebRTC，但不使用库的传输功能(请注意，Slake没有直接为音频呼叫集成WebRTC，它集成了集成WebRTC的Amazon Chime)。它们都只将WebRTC用于音频处理，但实现了自己的传输层，并且不使用WebRTC的RTP和SCTP实现。因此，它们不容易受到本文讨论的bug和许多其他WebRTC bug的影响。\nBOTIM有一种不同寻常的设计，它阻止了利用漏洞的工作。每个对等方不是调用createOffer并交换SDP，而是根据来自对等方的少量信息生成自己的SDP。默认情况下，此应用程序不使用SCTP，并且无法使用SDP将其打开。因此，使用此漏洞是不可能的。BOTIM似乎确实有一种模式，可以与对等机交换SDP，但我想不出如何启用它。\n该利用漏洞在另一个应用程序上以完全远程的方式工作，但设置该利用漏洞会暴露该应用程序中明显的附加严重漏洞。漏洞的泄露期过后，将发布应用程序上利用漏洞行为的详细信息。\n在分析的14个应用程序中，WebRTC在4个应用程序上启用了完全远程攻击，在另外两个应用程序上实现了一次单击攻击。这突出了在移动应用程序中包含WebRTC的风险。WebRTC不会带来与其他视频会议解决方案有本质不同的风险，但是在应用程序中包含视频会议的决定会带来一个很大的远程攻击面，否则就不会出现这种情况。WebRTC是为数不多的移动应用程序的完全远程攻击面之一，通常也是Android的完全远程攻击面之一。在几乎所有将其用于视频会议的应用程序中，它可能是风险最高的组件。\n视频会议对于某些应用程序的功能至关重要，但在其他应用程序中，它是一个很少使用的“额外”功能。低使用率并不会降低视频会议给用户带来的风险。它对软件很重要。\n.", "note_en": "This is a three-part series on exploiting messenger applications using vulnerabilities in WebRTC.   CVE-2020-6514 discussed in the blog post was fixed on July 14 with   these   CLs.This series highlights what can go wrong when applications don&#39;t apply WebRTC patches and when the communication and notification of security issues breaks down.   In   Part 2 , I described an exploit for WebRTC on Android. In this section, I explore which applications it works on.\n  When writing the exploit, I originally altered the SCTP packets sent to the target device by altering the source of WebRTC and recompiling it. This wasn’t practical for attacking closed source applications, so I eventually switched to using   Frida  to hook the binary of the attacking device instead. Frida’s hooking functionality allows for code to be executed before and after a specific native function is called, which allowed my exploit to alter outgoing SCTP packets as well as inspect incoming ones. Functionally, it is equivalent to altering the source of the attacking client, but instead of the alterations being made in the source at compile time, they are made dynamically by Frida at run time. The source for the exploit is available   here.\n           There are also three address offsets from the binary of the target device that are needed for the exploit to work.  The offset between the  system  function and the  malloc  function, as well as the offset between the gadget described in the previous post and the  malloc  function are two of these. These offsets are in libc, which is an Android system library, so they need to be determined based on the target device’s version of Android. The offset from the location of the  cricket::SctpTransport  vtable to the location of  malloc  in the global offset table is also needed. This must be determined from the binary that contains WebRTC in the application being attacked.\n   Note that the exploit scripts provided have a serious limitation: every time memory is read, it only works if bit 31 of the pointer is set. The reasons for this are explained in Part 2. The exploit script has an example of how to fix this and read any pointer using FWD_TSN chunks, but this is not implemented for every read. For testing purposes, I reset the device until the WebRTC library was mapped in a favorable location.\n  A list of popular Android applications that integrate WebRTC was determined by searching APK files on Google Play for a specific string in usrsctp. Roughly 200 applications with more than five million users appeared to use WebRTC. I evaluated these applications to determine whether they could plausibly be affected by the vulnerabilities in the exploit, and what the impact would be.\n   It turned out the ways applications use WebRTC are quite varied, but can be separated into four main categories.\n   Projection: the screen and controls of a mobile application is projected into a desktop browser with user consent for enhanced usability\n Streaming: audio and video content is sent from one user to many users. Usually there is an intermediary server, so the sender does not need to manage possibly thousands of peers, and the content is recorded for later viewing\n   The impact of the vulnerabilities used in the exploit is different for each of these categories. Projection is low risk, as a lot of user interaction is required to set up the WebRTC connection, and the user has access to both sides of the connection in the first place, so there is little to gain by compromising the other side.\n   Streaming is also fairly low risk. While it’s possible that some applications use peer-to-peer connections when a stream has a low number of viewers, they usually use an intermediary server that terminates the WebRTC connection from the sending peer, and starts new connections with the receiving peers. This means that the attacker usually cannot send malformed packets directly to a peer. Even with a set-up where streaming is performed peer-to-peer, user interaction is required for the target to view the stream, and there’s often no way to limit who can access a stream. For this reason, streaming applications that use WebRTC are probably not useful for targeted attacks. Of course, it is possible that these vulnerabilities affect the servers used by streaming services, but this was not investigated in this research.\n   Browsers are almost certainly vulnerable to most bugs in WebRTC, because they allow a large amount of control over how it is configured. To exploit such a bug in a browser, an attacker would need to set up a host that acts like the other peer in the peer-to-peer connection, and convince the target to visit a webpage that starts a call to that host. In this case, the vulnerability would have a similar impact to other memory corruption vulnerabilities in JavaScript.\n   Conferencing is the highest risk usage of WebRTC, but the actual impact of a vulnerability depends on a lot of how users of an application contact each other. The highest risk design is an application where any user can contact any other user based on an identifier. Some applications require the callee to have interacted in a specific way with the caller before a call can be made, which makes users harder to contact a target and generally reduces risk. Some applications require users to enter a code or visit a link to start a call, which has a similar effect. There is also a large group of applications where it is difficult or impossible to call a specific user, for example chat roulette applications, and applications which have features that allow a user to start a call to customer support.\n   For this research, I focused on conferencing applications that allow users to contact specific other users. This reduced my list of 200 applications to 14 applications, as follows.\n      This list was compiled on June 18, 2020. Note that a few applications were removed because their server was not operational on that day, or they were very difficult to test (for example, required watching multiple ads to make a single call).\n   One application tested will not be identified in this blog post, as a serious additional vulnerability was discovered in the process of testing that has not yet been fixed or reached its disclosure deadline. This blog post will be updated when the disclosure deadline has passed.\n  The following section describes my attempts to test the exploit against the above applications. Please note that due to the number of applications, limited time was spent on each, so there is no guarantee that every attack against WebRTC was considered. While I am very confident that applications found to be exploitable are indeed exploitable, I am less confident about applications found to be not exploitable. If you need to know whether a specific application is vulnerable for the purposes of protecting users, please contact the vendor instead of relying on this post.\n    I started off by testing Signal because it is the only   open-source  application on this list. Signal integrates WebRTC as a part of a library called   ringrtc . I built ringrtc and then Signal with symbols, and then hooked the needed symbols with the Frida script on the attacker device. I tried the exploit and it worked about 90% of the time!\n        This attack did not require any user interaction with the target device because Signal starts the WebRTC connection before an incoming call is answered, and this connection can accept incoming RTP and SCTP. The exploit is not 100% reliable on Signal and other targets because Bug 376 requires that a freed heap allocation is replaced with the next allocation of the same size performed by the thread, and occasionally another thread will do an allocation of the same size in the meantime. Failure results in a crash that is usually not evident to the user because the process respawns, but a missed call will appear.\n   This exploit was performed on Signal 4.53.6 which was released on January 13, 2020, as Bug 376 had already been patched in Signal by the time I finished the exploit.  CVE-2020-6514 was also fixed in  later versions, and ASCONF has also been disabled in usrsctp, so the code that caused   Bug 376  is no longer reachable. Signal has also recently implemented a   feature  that requires user interaction for the WebRTC connection to be started when the caller is not in the callee’s contacts. Signal has also stopped using SCTP in their beta version, and plans to add this change to the release client once it is tested. The source for this exploit is available   here.\n      Duo was also an interesting target, as it is preinstalled on so many Android devices. It dynamically links the Android WebRTC library,  libjingle_peerconnection_so.so  with no obvious modifications. I reverse engineered this library in IDA to find the location of all the functions that needed to be hooked, and then modified the Frida script to hook them based on their offsets from an exported symbol. I also modified the offset between the  cricket::SctpTransport  vtable and the global offset table, as it was different than in Signal. The exploit also worked on Duo. Source for the Duo exploit is available   here.\n       This vulnerability did not require any user interaction, as like Signal, Duo starts the WebRTC connection before a call is answered.\n   The exploit was tested on version 68.0.284888502.DR68_RC09 which was released on December 15, 2019. The vulnerability has since been fixed. Also, at the time this application was released, it was possible for Duo to call any Android device with Google Play Services installed, regardless of whether Duo had been installed. This is no longer the case. A user now needs to set up Duo and have the caller in their contacts for an incoming call to be received.\n    While Google Hangouts uses WebRTC, it does not use data channels, and does not exchange SDP in order to set up calls, so there is no obvious way to enable them from a peer. For that reason, the exploit does not work on Hangouts.\n    Facebook Messenger is another interesting target. It has a large number of users, and according to its   documentation , any user can call any other user based on their mobile number. Facebook Messenger integrates WebRTC into a library called  librtcR11.so , which dynamically links to usrsctp from another library,  libxplat_third-party_usrsctp_usrsctpAndroid.so . Facebook Messenger downloads these libraries dynamically as opposed to including them in the APK, so it is difficult to identify the version I examined, but it was downloaded on June 22, 2020.\n   The  librtcR11.so  library appears to use a version of WebRTC that is roughly six years old, so it was before the class  cricket::SctpTransport  existed. That said, the analogous class  cricket::DataMediaChannel  appeared to be vulnerable to  CVE-2020-6514 . The  libxplat_third-party_usrsctp_usrsctpAndroid.so  library appears to be more modern, but contains the vulnerable code for Bug 376. That said, it does not appear to be possible to reach this code from Facebook Messenger, as it is set to use RTP data channels as opposed to SCTP data channels, and does not accept attempts to change the channel type via Session Description Protocol (SDP). While it is not clear whether the motivation behind this design is security, this is a good example of how restricting attacker access to features can reduce an application’s vulnerability. Facebook also waits until a call is answered before starting the WebRTC connection, which further reduces the exploitability of any WebRTC vulnerabilities that affect it.\n   Interestingly, Facebook Messenger also contains a more modern version of WebRTC in a library called  librtcR20.so , but it does not appear to be used by the application. It is possible to get Facebook Messenger to use the alternate library by setting a system property on Android, but I could not find a way an attacker could cause a device to switch libraries.\n    Like Facebook Messenger, while Viber version 13.3.0.5 appeared to contain the vulnerable code, but the application disables SCTP when the  PeerConnectionFactory  is created. This means an attacker cannot reach the vulnerable code.\n    VK is a social networking app released by Mail.ru in which users have to explicitly allow specific other users to contact them before each user is allowed to call them. I tested my exploit against VK, and it required some modifications to work. To start, VK doesn’t use data channels as a part of its WebRTC connection, so I had to enable it. To do this, I wrote a Frida script that hooks  nativeCreateOffer  in Java, and makes a call to  createDataChannel  before the offer is created. This was sufficient to enable SCTP on both devices, as the target device determines whether to enable SCTP based on the SDP provided by the attacker. The version of WebRTC was also older than the one I wrote the exploit for. WebRTC doesn’t contain any version information, so it is difficult to tell for sure, but the library appeared to be at least one year old based on log entries. This meant that some of the offsets in the ‘fake object’ used by the exploit were different. With a few changes, I was able to exploit VK.\n   VK sends an SDP offer to a target device to start a call, but the target does not return the SDP answer until the user has accepted the call, which means this exploit requires the target to answer the call before the WebRTC connection is started. This means the exploit will not work unless the target manually answers the call. In the video below, the exploit takes a fair amount of time to run after the user has answered. This is due to how I designed the exploit, and not due to fundamental limitations of the vulnerabilities it uses. In particular, the exploit waits for usrsctp to generate specific packets even though they could be generated more quickly by the exploit script, and also uses delays to avoid packet reordering when responses could be checked instead. It is likely that with enough effort, this exploit could run in less than five seconds. Also note that I altered the exploit to work with a single incoming call, as opposed to two incoming calls in the exploits above, as it is not realistic to expect a target to answer a call twice in quick succession. This didn’t require substantial changes to how the exploit works, though it does make the exploit code more complex and difficult to debug.\n       Regardless, the requirement that a user must choose to accept calls from an attacker before they can call, alongside the requirement that the user answer the call and stay on the line for a few seconds makes this exploit substantially less useful against VK compared to applications without these features.\n   Testing was performed against VK 6.7 (5631). Like Facebook, VK dynamically downloads its version of WebRTC, so it is difficult to specify its version, however testing was performed on July 13, 2020. VK has since updated their servers so that a user cannot start a call with SDP that contains data channels, so the exploit no longer works. Note that VK does not use WebRTC for two-party calls, only group calls, so I tested this exploit using a group call. The source for the exploit is available   here.\n    OK and Tamtam are similar messaging applications released by the same vendor, also Mail.ru. They use a dynamically downloaded version of WebRTC that is identical to the one used by VK. Since the library is exactly the same, my exploit also worked on OK, and I didn’t bother also testing TamTam because it is so similar.\n       Like VK, OK and TamTam do not return the SDP answer until the target has answered the call by interacting with the phone, so this is not a fully remote exploit on OK and TamTam. OK also requires users to choose to accept messages from another user before the user can call them. TamTam is a bit more liberal, for example, if a user verifies a phone number, any user who has their phone number can contact them.\n   Testing was performed on version 20.7.7 of OK on Monday, July 13. SDP-only testing was performed on TamTam version 2.14.0. Since then, the servers for these applications have been updated so that SDP containing data channels cannot be used to start a call, so the exploit no longer works.\n    Discord has   documented  its use of WebRTC thoroughly. The application uses an intermediary server for WebRTC connections, which means that it is not possible for a peer to send raw SCTP to another peer, which is required for the exploit to work. Discord also requires several clicks to enter a call. For these reasons, Discord is not affected by the vulnerabilities discussed in this post.\n    JioChat  is a messaging application that allows for any user to call any other user based on phone number. Analyzing version 3.2.7.4.0211, it appeared that its WebRTC integration contained both vulnerabilities, and the app exchanges the SDP offer and answer before the callee accepts the incoming call, so I expected the exploit to work without user interaction. However, this was not the case when I tested it, and it turns out that JioChat uses a different strategy to prevent the WebRTC connection from starting until the callee has accepted the call. I was able to easily bypass this strategy, and get the exploit to work on JioChat.\n       Unfortunately, JioChat’s connection delay strategy introduced another vulnerability, which has been fixed, but the disclosure period has not expired for. For this reason, details of how to bypass it will not be shared in this blog post. The source for the exploit without this functionality is available   here. JioChat has recently updated their servers so that SDP containing data channels cannot be used to start a call, meaning that the exploit no longer works on JioChat.\n    Slack and ICQ are similar in that they both integrate WebRTC, but do not use the transport features of the library (note that Slack doesn’t integrate WebRTC directly for audio calls, it integrates Amazon Chime, which integrates WebRTC). They both use WebRTC for audio processing only, but implement their own transport layer and do not use WebRTC’s RTP and SCTP implementations. For this reason, they are not vulnerable to the bugs discussed in this blog post, and many other WebRTC bugs.\n      BOTIM has an unusual design that prevents the exploit from working. Instead of calling  createOffer  and exchanging SDP, each peer generates its own SDP based on a small amount of information from the peer. SCTP is not used by this application by default, and it was not possible to use SDP to turn it on. Therefore, it was not possible to use this exploit. BOTIM does appear to have a mode where it exchanges SDP with a peer, but I could not figure out how to enable it.\n    The exploit worked in a fully remote fashion on one other application, but setting up the exploit revealed an obvious additional serious vulnerability in the application. Details of the exploit’s behavior on the application will be released after the disclosure period has expired for the vulnerability.\n   Out of the 14 applications analyzed, WebRTC enabled a fully remote exploit on four applications, and a one-click exploit on two more. This highlights the risk of including WebRTC in a mobile application. WebRTC does not pose a substantially different risk than other video conferencing solutions, but the decision to include video conferencing in an application introduces a large remote attack surface that wouldn’t be there otherwise. WebRTC is one of the few fully remote attack surfaces of a mobile application, and of Android in general. It is likely the highest risk component in almost every application that uses it for video conferencing.\n   Video conferencing is vital to the functionality of some applications, but in others it is an ‘extra’ that is rarely used. Low usage does not make video conferencing any less of a risk to users. It is important for software\n......", "posttime": "2020-08-09 10:15:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,webrtc,android,应用程序", "title": "利用WebRTC开发Android Messenger", "title_en": "Exploiting Android Messengers with WebRTC", "transed": 1, "url": "https://googleprojectzero.blogspot.com/2020/08/exploiting-android-messengers-part-3.html?m=1", "via": "", "real_tags": ["开发", "webrtc", "android", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "8b5e70840e889cb2b752d4b23484120f.jpeg", "infoid": 1017063, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "查理·考夫曼(Charlie Kaufman)小说“蚂蚁”的叙述者是B·罗森伯格(B.Rosenberger Rosenberg)，他是一位秃顶的中年影评人，戴着瓶盖眼镜，留着飘逸的惠特曼式胡须，为了“不把我的男性气概当作武器”，他只用了自己的名字首字母。B是最糟糕的表演型白人男性文化批评家，知道在公开场合说什么，贬低那些不这么做的人，同时又曲折地试图隐藏自己极端倒退的个性。他让他遇到的大多数黑人立即知道他有一个黑人女友，但也同样迅速地驳斥了你可能认为他是犹太人的任何想法。他在皮威·赫尔曼的电影中抨击有毒的男子汉气概，但在他分居的女儿的博客上留下了尖刻的、争辩的评论-当然是匿名的。\n正是这些态度的剧烈波动导致了B疯狂的电影批评，他给电影制作人提供了一种超乎寻常的竞争优越感，只把那些让他的自我吹捧的东西视为可以接受的。即使只是决定去哪里买咖啡也会触发他：\n星巴克是为哑巴们准备的智能咖啡。这是咖啡界的克里斯托弗·诺兰。邓肯甜甜圈是低俗的，正宗的。这是贾德·阿帕托(Judd Apatow)电影中简单而真实的乐趣。不是在炫耀。是真的。人类。别和我竞争，克里斯托弗·诺兰。你永远都会输。我知道你是谁，我知道我是我们中更聪明的。\n在他的读者和观众面前，B感觉同样高人一等。在写电影之前，他一度解释了他对一部电影要求的七种不同类型的观看。他将第一阶段描述为在没有他广博的电影知识的帮助下观看它，就像一个普通的电影观众会说的那样，他称之为“无名猿的体验”。\n除了对贾德·阿帕托电影的热爱，B的另一个电影激情是他对查理·考夫曼电影的持久仇恨。B认为考夫曼是一个自命不凡、居高临下的知识分子装腔作势者，根本不关心普通人(与B本人没有什么不同)。他把他的考夫曼演讲称为“当涉及到考夫曼时，我用脚投票。”他发现纽约的希纳克多什是“一个曲折的哈欠”，并称考夫曼为“一个怪物，简单明了，但却是一个没有意识到自己惊人无能的怪物。”\n这些对查理·考夫曼的指控在查理·考夫曼的故事中并不令人惊讶，因为它们将我们带进了他如此多作品的核心的自我反身领域。B对考夫曼的咆哮通常被闹剧打断：鸟儿在他身上大便，B被笨拙的劳雷尔和像哈代一样的工人意外转身搬来的木板重击头部，或者B反复落入附近任何开放的沙井(他称之为“人孔”)，落入堆满人类排泄物的河流中。灾难经常发生，甚至B都怀疑他有一个折磨他的人，某种看不见的力量让他远离幸福-也许是考夫曼本人。这是因为，归根结底，“蚂蚁”是B和考夫曼关于艺术和喜剧的争论。\n查理·考夫曼最为人所知的身份是《做约翰·马尔科维奇》(Being John Malkovich)的编剧，改编版，与人合著的《无瑕疵心灵的永恒阳光》(他因此获得奥斯卡奖)，纽约Synecdoche的编剧兼导演，以及动画片《阿诺玛莉莎》(Anomalisa)的联合导演。考夫曼的电影并没有充斥着圆滑、优雅的人。他专门研究像B这样的男人，詹姆斯·瑟伯称之为“被击败的男人”。他们聪明、易怒、社交无能、才华横溢，总是非常接近成功。考夫曼在自我反省的现实和双重身份中审视了他们的生活，比如约翰·库萨克(John Cusack)神奇地通过超级成功的约翰·马尔科维奇(John Malkovich)的眼睛看世界，或者尼古拉斯·凯奇(Nicholas Cage)在改编中扮演沮丧的编剧，面对他和蔼可亲的双胞胎兄弟，事实证明他是一个极其成功的工作室编剧。\nB完全默默无闻，但与之相反的是，他最终抓住了登上关键世界顶峰的机会。在参观佛罗里达大沼泽地的一家电影机构时，他发现他的邻居，120岁的非洲裔美国电影制作人英戈·卡斯伯特(Ingo Cuthbert)独立完成了一部长达数十年的定格木偶电影的制作，放映时间为3个月-B是唯一看过这部电影的人。他立刻意识到Ingo毕生的工作对他来说是一个机会。“这太好了，简直不像是真的：古老的，隐居的，古怪的，很可能是精神错乱的非裔美国电影制作人。毫无疑问，是局外人的艺术。我偶然发现了一件壮观的事情。“达杰的幻觉在我的脑海中起舞，”B想。“我可以把它变成人类学上的黄金。我可以一辈子都吃这个。我终于可以撬开Cahiers du Cinema那条古板的腿了。“\nB很喜欢这部电影，但是在他看完之后不久，Ingo就死了。B将一万多卷胶卷连同Ingo的所有笔记本和木偶一起装上U-Track，然后向北行驶，想象着“纽约著名的电影批评区(位于25街和街区中央之间的第7个街区，面向住宅区，街道东侧)等待着他的荣耀。”不幸的是，Ingo唯一的指纹是在高度易燃的硝酸盐胶片上，B的卡车起火了。三个月后，B从可怕的伤势和药物引起的昏迷中苏醒过来，但现在甚至不记得英戈的电影了，更不用说把它呈现给世界了。正是在他试图重建英戈的杰作时，从一个幸存的框架，通过催眠诱导的恢复记忆和他醒着的、梦幻般的生活，以及它对现实的多种版本，这部小说无疑成为了考夫曼(Kaufman)。\n查理·考夫曼的职业生涯不是从电影制作人开始的，而是作为“国家讽刺报”的喜剧编剧，然后是20世纪90年代的情景喜剧，如“活着”(Get A Life)和“奈德与斯泰西”(Ned&Amp；Stacey)，直到成为约翰·马尔科维奇(John Malkovich)开始了他的电影生涯。喜剧-考夫曼对它的定义，阿帕托的定义，它的用途，以及B对它的憎恨-是反人类对话的很大一部分。考夫曼在书中引用了一些鲜为人知的喜剧，比如三个傻瓜的陪衬弗农·登特(Vernon Dent)，这是一家功能齐全的喜剧酒店，根据罗斯科·阿巴克尔(Roscoe Arbacle)的“钟声男孩”(The Bell Boy)、奥尔森(Olsen)和约翰逊(Johnson)电影中的酒店改编而成，沃尔特·米蒂(Walter Mitty)、维奥拉·斯波林(Viola Spolin)、艾伦·芬特(Allen Fant)、乔·贝瑟(Joe Besser)、弗洛伊德·诺曼(Floyd Norman)和艾克·巴林霍尔茨(Ike Barinholtz)。卢·科斯特洛本人在B的“英戈记忆”电影中有突出的表现，这部电影将科斯特洛描绘成一个无情的杀手，击败了所有威胁雅培和科斯特洛票房主导地位的后起之秀的喜剧团队。\n厌恶喜剧(尤其是考夫曼的喜剧)，这就是为什么考夫曼把他骂进了这个喋喋不休的地狱。谈到英戈的杰作，B如是说，“这是一部关于噩梦的喜剧，也就是幽默--如果你愿意的话，这是对喜剧的批评。它假定喜剧即将结束，需要废除它，需要我们学习同理心，永远不能嘲笑别人。“。B的抱怨不是通常的“喜剧变得太P.C.”。或者加强/压制我们经常看到的辩论。这件事激怒了这么多人，几乎每天都会照亮社交媒体，这就是有人、某事、任何事情都会受到嘲笑的事实：“我得出的事实是，只要没有什么是笑声的对象，只要没有人受伤，我们就需要笑。”“喜剧是一个谎言，”B告诉我们：\n它的判断就像神一样，从定义上讲，它是移情的对立面。喜剧坐在它的宝座上说，“你太可笑了。你真可悲。你是个笨蛋。你的痛苦让我觉得好笑。最重要的是，我不是你。“。\n对于一个影评人来说，B是一个恰如其分的投影大师，因为他只是在描述自己，就像许多被笑话激怒的人在拖拽小丑时所做的那样。考夫曼并没有对所有的批评或批评不屑一顾。B是一种特殊的傲慢类型。B认为Manohla Dargis(考夫曼的狂热粉丝)是他的敌人，Richard Roeper是克里斯托弗·诺兰的“泳池男孩”。“纽约客”的理查德·布罗迪(Richard Brody)是B钦佩引用的为数不多的评论家之一，特别是他对韦斯·安德森(Wes Anderson)的“月出王国”的评论：“仅仅热爱一部电影是不够的--出于正确的理由热爱它才是重要的。”\nB也相信这一点，这也是他作为评论家的最大缺点。考夫曼并没有隐瞒B在身体和思想上与布罗迪的相似之处。他们共享那些标志性的胡须和相同的首字母。在看了一部戈达尔的电影后(然后写了一些关于戈达尔的书)，每个人都作为常春藤联盟的大一新生爱上了电影。布罗迪特别解雇了考夫曼，用的语言与B使用的语言相同。他还对阿帕托的“怀孕”(This Is 40)(只是抱怨写得不够长)和“滑稽的人”(Funny People)写了热情洋溢的评论。和B一样，他也经常在他的“最佳”名单上给阿帕托留有一席之地。布罗迪将阿帕托与恩斯特·卢比奇和约翰·卡萨维茨进行了有利的比较，他和B都对考夫曼不屑一顾，认为他是三流的皮兰德罗。在一篇题为“查理·考夫曼的无名氏的居高临下的同情心”的评论中，他称考夫曼的奥斯卡获得者是“好莱坞外的明星”。虽然B自己流露出自满的优越感，但他对现代喜剧的主要问题是太了解了：“我不尊敬的是居高临下的喜剧演员。查理·考夫曼(Charlie Kaufman)、皮维·赫尔曼斯(Pee Wee Hermans)、罗伯特·唐尼(Robert Downey)、高年级(Junior就是天才)。“。\n当然，B的生活和布罗迪的生活有很大的不同。理查德·布罗迪(Richard Brody)并不是一个默默无闻的评论家，毫无疑问，他在纽约市的人行道上航行的运气更好，但布罗迪和考夫曼对喜剧的截然不同的观点在很大程度上决定了B的叙述。B坚持我们不只是喜欢电影，而且出于正确的理由，他的使命是从他的记忆中找回Ingo的电影。这一次，只有他对", "note_en": "B, the narrator of Charlie Kaufman’s novel   Antkind, is B. Rosenberger Rosenberg, a bald, middle-aged film critic with bottle-top glasses and a flowing Whitmanesque beard, who goes only by his lone initial so as “not to wield my maleness as a weapon.” B is the worst sort of performative white male culture critic, knowing what to say publicly and trashing those who do not, all while tortuously trying to hide his own archly regressive personality. He lets most Black people he meets know immediately that he has had a Black girlfriend, but just as quickly dismisses any notion you might have that he’s Jewish. He rails about toxic masculinity in the films of Pee-wee Herman, but leaves snipy, argumentative comments—anonymously, of course—on his estranged daughter’s blog.\n   It’s these wild swings in attitude that inform B’s unhinged film criticism, where he offers an outsize sense of competitive superiority to filmmakers and only views what flatters his ego as acceptable. Even just making a decision about where to get coffee triggers him:\n Starbucks is the smart coffee for dumb people. It’s the Christopher Nolan of coffee. Dunkin’ Donuts is lowbrow, authentic. It is the simple, real pleasure of a Judd Apatow movie. Not showing off. Actual. Human. Don’t compete with me, Christopher Nolan. You will always lose. I know who you are, and I know I am the smarter of us.\n B feels equally superior to his readers and audiences. At one point, he explains the seven different types of viewings he requires of a movie before writing about it. He describes the first stage as seeing it without the aid of his vast cinematic knowledge, as an average moviegoer would, which he calls, “the Nameless Ape Experience.”\n Besides a love of Judd Apatow movies, B’s other cinematic passion is his abiding hatred for the films of Charlie Kaufman. B considers Kaufman a pretentious, condescending intellectual poser who cares nothing for the common man (not unlike B himself). He calls his Kaufman lecture, “I Vote With My Feet When It Comes to Kaufman.” He finds  Synecdoche, New York “a tortuous, tortuous yawn,” and calls Kaufman “a monster, plain and simple, but a monster unaware of his staggering ineptitude.”\n These indictments of Charlie Kaufman are not a big surprise in a Charlie Kaufman story, as they take us into the self-reflexive territory central to so much of his writing. B’s rants about Kaufman are usually punctuated by slapstick: birds defecating on him, B getting whacked on the side of the head with planks of wood carried by clumsy Laurel and Hardy–like workmen who unexpectedly turn around, or B repeatedly falling into any nearby open manhole (“personhole,” as he calls them) into rivers of human waste. Disasters happen so often that even B suspects he has a tormentor, some unseen force that keeps him from happiness—maybe Kaufman himself. That’s because, ultimately,  Antkind is an argument between B and Kaufman about art and comedy.\n  Charlie Kaufman is best known as the writer of  Being John Malkovich ,  Adaptation, co-author of  Eternal Sunshine of the Spotless Mind (for which he won an Oscar), writer-director of  Synecdoche, New York, and co-director of the animated feature film,  Anomalisa. Kaufman’s films are not populated by slick, polished people. He specializes in men like B, a type James Thurber called “the defeated male.” Smart, angry, socially inept, semi-talented, they always remain tantalizingly close to success. Kaufman examines their lives in self-reflexive realities and dual identities, like John Cusack magically seeing the world through the ubersuccessful John Malkovich’s eyes or Nicholas Cage, as the frustrated screenwriter in  Adaptation, confronted by his amiable dope of a twin brother, who turns out to be a wildly successful studio screenwriter.\n B is utterly obscure, but in  Antkind he finally comes upon his chance at reaching the top of the critical world. On a visit to a Florida Everglades film institution, he discovers that his neighbor, a 120-year-old African American filmmaker named Ingo Cuthbert, has independently completed a decades-long production of a stop-motion puppet movie with a running time of three months—and B is the only person to have ever seen it. He instantly recognizes Ingo’s life’s work as an opportunity for himself. “This is too good to be true: ancient, reclusive, eccentric, likely psychotic African-American filmmaker. Outsider art, undoubtedly. I have stumbled onto something magnificent. Visions of Darger dance in my head,” B thinks. “I can spin this into anthropological gold. I can dine out on this for the rest of my life. Finally I can pry open the prudish legs of  Cahiers du Cinema.”\n B loves the film, but shortly after he views it, Ingo dies. B loads the more than 10,000-reel print onto a U-Haul, along with all of Ingo’s notebooks and puppets, and heads north, imagining the glory that awaits him in “New York’s famed Film Criticism District (7th between 25th and the middle of the block facing uptown, east side of the street).” Unfortunately, Ingo’s only print is on highly flammable nitrate film stock, and B’s truck bursts into flames. Three months later, B wakes from his terrible injuries and medically induced coma but now can’t even remember Ingo’s film, much less present it to the world. It’s in his trying to reconstruct Ingo’s masterpiece, from a single surviving frame, via hypnosis-induced recovered memories and his waking, and dreaming life, and its multiple versions of reality, that the novel becomes unmistakably Kaufman.\n Charlie Kaufman did not begin his career as a filmmaker but as a comedy writer for the  National Lampoon, then on 1990s sitcoms like  Get a Life and  Ned &amp; Stacey, until  Being John Malkovich launched his movie career. Comedy—Kaufman’s definition of it, Apatow’s, its uses, and B’s hatred of it—is a large part of the conversation of  Antkind. Kaufman steeps the book with references to obscure comedy like the Three Stooges’ foil Vernon Dent, a functioning comedy hotel based on the one in Roscoe Arbuckle’s  The Bell Boy, Olsen and Johnson movies, Walter Mitty, Viola Spolin, Allen Funt, Joe Besser, Floyd Norman, and Ike Barinholtz, and B’s landlord is Sid Fields, Abbott and Costello’s landlord on their television show. Lou Costello himself features prominently in B’s memory of Ingo’s film, which portrays Costello as a ruthless killer who bumps off any and all up-and-coming comedy teams who threaten Abbott and Costello’s box office dominance.\n  B loathes comedy (especially Kaufman’s), which is why Kaufman has damned him to this pratfall Hell. Of Ingo’s masterpiece, B gushes, “[I]t’s a comedy about the nightmare that is humor—a critique of comedy, if you will. It postulates the coming end of comedy, the need for its abolition, the need for us to learn empathy, to never laugh at others.” B’s complaint is not the usual “comedy has gotten too P.C.” or punching up/punching down debates we see so often. It’s the thing that infuriates so many, that lights up social media almost daily, the very fact that someone, something, anything, is ridiculed at all: “The truth I’ve come to is that we need to laugh, as long as nothing is the object of that laughter, as long as nobody is hurt.” “Comedy is a lie,” B tells us:\n It sits Godlike in its judgment and by definition is the antithesis of empathy. Comedy sits on its throne and states, “You are ridiculous. You are pathetic. You are stupid. Your pain amuses me. Most important, I am not you.”\n  Fittingly for a film critic, B is a master of projection, as he’s only describing himself, as so many of those outraged by jokes do when dragging the joker. Kaufman isn’t dismissing all critics or criticism. B is a specific arrogant type. B considers Manohla Dargis (an avid Kaufman fan) his enemy and Richard Roeper to be Christopher Nolan’s “pool boy.” One of the few critics B quotes admiringly is  The New Yorker’s Richard Brody, specifically from  his review of Wes Anderson’s   Moonrise Kingdom: “It’s not enough to love a movie—it’s important to love it for the right reasons.”\n B believes that, too, and that’s his great flaw as a critic. Kaufman is not hiding B’s physical and ideological resemblance to Brody. They share those trademark beards and the same initials. Each fell in love with cinema as freshman Ivy Leaguers after a seeing a Godard movie (and then wrote books about Godard). Brody has specifically dismissed Kaufman in the same language that B uses. He has also written rapturous reviews of Apatow’s  Knocked Up,  This is 40 (only complaining that it wasn’t long enough), and  Funny People. Like B, he regularly gives Apatow spots on his “Best of” lists. Brody compares Apatow favorably to Ernst Lubitsch and John Cassavetes, and both he and B shrug Kaufman off as a third-rate Pirandello. In a review titled “ The Condescending Compassion of Charlie Kaufman’s  Anomalisa ,” he calls Kaufman’s Oscar-winner “the off-Hollywood equivalent of  Entourage.” Although B himself drips self-satisfied superiority, his major problem with modern comedy is that it’s too knowing: “Who I do not honor are the comedians who condescend. The Charlie Kaufmans, the Pee Wee Hermans, the Robert Downey, Seniors (Junior is genius).”\n Certainly, B’s life and Brody’s differ in significant ways. Richard Brody is hardly an obscure critic, and he undoubtedly has better luck navigating New York City personholes, but the radically different views Brody and Kaufman have about comedy inform much of B’s narration. B’s insistence we not just enjoy films, but for the right reasons, fuel his mission to recover Ingo’s film from his memory. For once, only his interpretation of the film will exist, not even the film. Then Ingo’s masterpiece changes B’s life. He has finally met the work of art, the filmmaker, that overwhelms him. After seeing it he calls his editor to quit film criticism altogether. “The days of flag-planting, of claiming ownership are done. From here on in, I will submit to great art.” There are more twists for B after that, but in that moment you see the kind of anti-art criticism that has defined B’s career, and which ruins him as a critic.\n  There are many detours and diversions in  Antkind: the lengthy descriptions of Ingo’s comedy nightmare set in the world of Hollywood comedy teams and two-reelers, Brainio (the device that beams movies fused with your ideas into your head), meeting President Donald J. Trunk, B taking a job at a clown shoe factory, his fetish for clown sex, and the moment he encounters his successful doppelgänger. It’s easy to get lost in Kaufman’s unwieldy multiplex of storylines, but it’s never not funny.", "posttime": "2020-08-09 09:48:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电影,kaufman", "title": "查理·考夫曼对电影的辩护", "title_en": "Charlie Kaufman’s Defense of Film", "transed": 1, "url": "https://newrepublic.com/article/158663/charlie-kaufmans-defense-film", "via": "", "real_tags": ["电影", "kaufman"]}, {"category": "", "categoryclass": "", "imagename": "b715f41566b2ae04e11aa4c5c579ee2a.jpg", "infoid": 1017061, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "好的，我想在这篇文章的前言中指出，这完全是轶事，基于我在瑞典斯德哥尔摩一家大医院的急诊室工作的经验，以及作为瑞典公民生活的经历。这篇文章完全是轶事，基于我在瑞典斯德哥尔摩一家大医院的急诊室工作的经历，以及作为一名瑞典公民生活的经历。许多人都知道，瑞典可能是所有国家中对这场令人愉悦的流行病采取最放松态度的国家。与其他国家不同的是，瑞典从未进入过完全封锁的状态。非必需品企业仍然营业，人们继续去咖啡馆和餐馆，孩子们仍在上学，很少有人在公共场合戴口罩。\nCovid在3月中旬像风暴一样袭击了斯德哥尔摩。有一天，我看到患有阑尾炎和肾结石的人，这些都是你在急诊室里看到的常见疾病。第二天，所有的病人都走了，唯一走进医院的就是令人垂涎的东西。实际上，每个接受测试的人都很满意，不管出现的症状是什么。人们流着鼻血进来了，他们吃了些恶心的东西。他们肚子疼来了，而且还恶心。\n然后，几个月后，所有贪婪的病人都消失了。从大流行开始到现在已经四个月了，一个多月来我没有见过一个令人恶心的病人。当我因为某人咳嗽或发烧而给他们做测试时，测试结果总是呈阴性。在三个月前的高峰期，在拥有1000万人口的瑞典，每天有100人死于贪婪。现在全国每天只有5人死亡，而且这个数字还在继续下降。由于人们通常在感染后三周左右死亡，这意味着几乎没有人再被感染。如果我们假设大约0.5%的感染者死亡(我认为这是非常慷慨的，稍后会详细说明)，那么这意味着三周前，全国每天有1000人感染，这相当于每人每天有10000人感染的风险，这是微不足道的。记住，如果你真的被感染了，死亡的风险最多也就是200分之1。那是三周前的事了。基本上，在瑞典，Covid在所有的实际意义上都已经过时了。四个月后。\n在一个拥有1000万人口的国家，Covid总共杀死了不到6000人。这个国家的年死亡率约为10万人。考虑到死于Covid的人中有70%超过80岁，这6000人中有相当一部分人无论如何都会在今年去世。这使得Covid对死亡率的影响只是昙花一现。\n这就是为什么将贪婪与其他主要流行病相提并论是荒谬的，比如1918年导致数千万人死亡的大流行。Covid甚至永远不会接近这些数字。然而，许多国家已经关闭了整个经济，停止了儿童上学，并使大部分人口失业，以应对这种疾病。\n媒体一直宣称只有一小部分人有抗体，所以不可能发展成群体免疫。嗯，如果群体免疫力还没有形成，那么所有的病人在哪里？为什么感染率下降得如此之快？考虑到大多数瑞典人现在生活正常，没有社交距离，没有戴口罩，应该仍然有很高的感染率。\n我们检测抗体的原因是因为它既简单又便宜。事实上，抗体并不是人体抵御病毒感染的主要防御手段。T细胞是。但是T细胞比抗体更难检测，所以我们在临床上并没有真正做到这一点。很有可能拥有对Covid特异的T细胞，从而使你对这种疾病产生免疫力，而不产生任何抗体。就我个人而言，我认为这就是已经发生的事情。在我工作的急诊室工作的每个人都做过抗体测试。很少有人真的有抗体。这是尽管我们接触了大量的感染者，包括在大流行之初，在我们意识到恶心是多么普遍之前，当时没有人穿着防护装备。\n我并不否认Covid对那些确实得了重病的人或死者的家人来说是可怕的，就像对死于癌症、流感或阿片类药物过量的人的家人来说是可怕的一样。但世界上大多数国家(不包括瑞典)的反应规模与威胁的规模完全不成比例。\n瑞典迅速撕下了比喻意义上的创可贴，并在短时间内结束了疫情，而世界其他国家则选择了缓慢剥离创可贴。目前，这意味着瑞典是世界上总死亡率最高的国家之一。但是Covid在瑞典已经结束了。人们已经恢复了正常的生活，几乎没有人再被感染了。我愿意打赌，那些完全关闭的国家在开放时会看到利率飙升。如果是这样的话，那么首先关闭就没有任何意义了，因为所有这些国家最终都会有相同的死亡人数。只有当你愿意在疫苗可用之前保持关闭状态，为了减少总死亡人数而完全关闭才有意义。这可能需要数年时间。没有一个国家愿意等待那么久。\nCovid目前在瑞典杀死的人不到6000人。死亡人数不太可能超过7000人。瑞典平均每年有700人死于流感。这是不是意味着Covid比流感严重十倍？不，因为流感已经存在了几个世纪，而Covid是全新的。在一个普通的流感年份，大多数人已经有了一定程度的免疫力，因为他们以前感染过类似的毒株，或者因为他们接种了疫苗。因此，很有可能，事实上，Covid的病死率与流感相同，或者只是略高一些，我们看到的全部差异是因为在这场大流行开始时，人群中完全缺乏任何免疫力。\n这个结论对瑞典的死亡数字是有意义的-如果我们已经到了一个点，尽管几乎没有任何社会距离发生，但在瑞典几乎没有任何活跃的感染发生，那就意味着至少有50%的人口已经感染了病毒，并产生了免疫力，即500万人。如果我们假设两个病毒的繁殖数量，这个数字是完全合理的：如果每个人感染两个新的病毒，从感染到感染其他人有五天的时间，而你一开始只有一个感染者，那么你将在短短四个月内达到数百万人感染的地步。如果五百万感染者中只有6000人死亡，那就相当于0.12%的病死率，与普通的旧流感大致相同，没有人会害怕这种流感，我们也不会因为这种流感而关闭我们的社会。\n如果您喜欢这篇文章，请点击本页底部的链接，直接订阅并接收未来的文章到您的收件箱。", "note_en": "Ok, I want to preface this article by stating that it is entirely anecdotal and based on my experience working as a doctor in the emergency room of one of the big hospitals in Stockholm, Sweden, and of living as a citizen in Sweden. As many people know, Sweden is perhaps the country that has taken the most relaxed attitude of any towards the covid pandemic. Unlike other countries, Sweden never went in to complete lockdown. Non-essential businesses have remained open, people have continued to go to cafés and restaurants, children have remained in school, and very few people have bothered with face masks in public.\n Covid hit Stockholm like a storm in mid-March. One day I was seeing people with appendicitis and kidney stones, the usual things you see in the emergency room. The next day all those patients were gone and the only thing coming in to the hospital was covid. Practically everyone who was tested had covid, regardless of what the presenting symtom was. People came in with a nose bleed and they had covid. They came in with stomach pain and they had covid.\n Then, after a few months, all the covid patients disappeared. It is now four months since the start of the pandemic, and I haven’t seen a single covid patient in over a month. When I do test someone because they have a cough or a fever, the test invariably comes back negative. At the peak three months back, a hundred people were dying a day of covid in Sweden, a country with a population of ten million. We are now down to around five people dying per day in the whole country, and that number continues to drop. Since people generally die around three weeks after infection, that means virtually no-one is getting infected any more. If we assume around 0.5 percent of those infected die (which I think is very generous, more on that later), then that means that three weeks back 1,000 people were getting infected per day in the whole country, which works out to a daily risk per person of getting infected of 1 in 10,000, which is miniscule. And remember, the risk of dying is at the very most 1 in 200 if you actually do get infected. And that was three weeks ago. Basically, covid is in all practical senses over and done with in Sweden. After four months.\n In total covid has killed under 6,000 people in a country of ten million. A country with an annual death rate of around 100,000 people. Considering that 70% of those who have died of covid are over 80 years old, quite a few of those 6,000 would have died this year anyway. That makes covid a mere blip in terms of its effect on mortality.\n That is why it is nonsensical to compare covid to other major pandemics, like the 1918 pandemic that killed tens of millions of people. Covid will never even come close to those numbers. And yet many countries have shut down their entire economies, stopped children going to school, and made large portions of their population unemployed in order to deal with this disease.\n The media have been proclaiming that only a small percentage of the population have antibodies, and therefore it is impossible that herd immunity has developed. Well, if herd immunity hasn’t developed, where are all the sick people? Why has the rate of infection dropped so precipitously? Considering that most people in Sweden are leading their lives normally now, not socially distancing, not wearing masks, there should still be high rates of infection.\n The reason we test for antibodies is because it is easy and cheap. Antibodies are in fact not the body’s main defence against virus infections. T-cells are. But T-cells are harder to measure than antibodies, so we don’t really do it clinically. It is quite possible to have T-cells that are specific for covid and thereby make you immune to the disease, without having any antibodies. Personally, I think this is what has happened. Everybody who works in the emergency room where I work has had the antibody test. Very few actually have antibodies. This is in spite of being exposed to huge numbers of infected people, including at the beginning of the pandemic, before we realized how widespread covid was, when no-one was wearing protective equipment.\n I am not denying that covid is awful for the people who do get really sick or for the families of the people who die, just as it is awful for the families of people who die of cancer, or influenza, or an opioid overdose. But the size of the response in most of the world (not including Sweden) has been totally disproportionate to the size of the threat.\n Sweden ripped the metaphorical band-aid off quickly and got the epidemic over and done with in a short amount of time, while the rest of the world has chosen to try to peel the band-aid off slowly. At present that means Sweden has one of the highest total death rates in the world. But covid is over in Sweden. People have gone back to their normal lives and barely anyone is getting infected any more. I am willing to bet that the countries that have shut down completely will see rates spike when they open up. If that is the case, then there won’t have been any point in shutting down in the first place, because all those countries are going to end up with the same number of dead at the end of the day anyway. Shutting down completely in order to decrease the total number of deaths only makes sense if you are willing to stay shut down until a vaccine is available. That could take years. No country is willing to wait that long.\n Covid has at present killed less than 6000 in Sweden. It is very unlikely that the number of dead will go above 7,000. An average influenza year in Sweden, 700 people die of influenza. Does that mean covid is ten times worse than influenza? No, because influenza has been around for centuries while covid is completely new. In an average influenza year most people already have some level of immunity because they’ve been infected with a similar strain previously, or because they’re vaccinated. So it is quite possible, in fact likely, that the case fatality rate for covid is the same as for influenza, or only slightly higher, and the entire difference we have seen is due to the complete lack of any immunity in the population at the start of this pandemic.\n This conclusion makes sense of the Swedish fatality numbers – if we’ve reached a point where there is hardly any active infection going on any more in Sweden in spite of the fact that there is barely any social distancing happening then that means at least 50% of the population has been infected already and have developed immunity, which is five million people. This number is perfectly reasonable if we assume a reproductive number for the virus of two: If each person infects two new, with a five day period between being infected and infecting others, and you start out with just one infected person in the country, then you will reach a point where several million are infected in just four months. If only 6000 are dead out of five million infected, that works out to a case fatality rate of 0.12 percent, roughly the same as regular old influenza, which no-one is the least bit frightened of, and which we don’t shut down our societies for.\n If you liked this article, then please click the link at the bottom of this page to subscribe and receive future articles straight to your inbox.", "posttime": "2020-08-09 08:59:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "医生,doctor,瑞典", "title": "一位瑞典医生对Covid的看法", "title_en": "A Swedish doctor's perspective on Covid", "transed": 1, "url": "https://sebastianrushworth.com/2020/08/04/how-bad-is-covid-really-a-swedish-doctors-perspective/", "via": "", "real_tags": ["医生", "doctor", "瑞典"]}, {"category": "", "categoryclass": "", "imagename": "c31ccf8cfe87725043b8ffce4ae011fc.jpg", "infoid": 1017060, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我看来，汉娜·蒙塔娜(Hannah Montana)是一位才华横溢的x86汇编语言程序员。嘿，你永远不会知道，过双重生活是她的专长，对吧？▶T..。", "note_en": "In my headcanon, Hannah Montana was a brilliant x86 assembly programmer on the down low. Hey you never know, leading double lives was her specialty right? ▶T...", "posttime": "2020-08-09 08:34:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,游戏装,game,x86", "title": "你能把整个游戏装进二维码吗？", "title_en": "Can you fit a whole game into a QR code?", "transed": 1, "url": "https://www.youtube.com/watch?v=ExwqNreocpg", "via": "", "real_tags": ["游戏", "游戏装", "game", "x86"]}, {"category": "", "categoryclass": "", "imagename": "d4923d230d10a14be6c66b3c3d6d7000.png", "infoid": 1017059, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在贸易和互联网的交汇点，Flexport工程正在颠覆历史悠久的货运代理行业。我们正在寻找创新的、充满激情的人来构建数字技术，使世界各地的运输变得更容易、更高效。\n我们正在改变人们对货运的看法。能成为解决难题的开拓者是令人兴奋的。\n我们的工程师正在接受巨大而独特的挑战：首先，我们的团队正在创建一个数据模型，该模型以一种真实的、易于理解和访问的方式表示物流的所有复杂性。此外，我们的客户和我们支持的供应链都是全球性的。因此，我们不会小规模推出我们的产品-它们立即为我们在世界各地合作的企业运营。\nFlexport的发展非常迅速，我们的产品也是如此--我们欢迎提问和独特的想法。我们的工程师有权识别关键项目，对它们进行战略优先排序，并执行它们。你决定怎么带我们去我们想去的地方。你对货运代理知之甚少吗？大多数工程师在开始工作时也不会这样做，但您将通过与团队协作和学习来发展专业知识。另外，因为我们的很多软件都是为内部运营团队设计的，所以您经常可以直接与您的用户一起工作！\n昆廷·梁(Quintin Leong)是Flexport预订团队的软件工程师，他分享了加入Flexport的原因、他的团队的使命是什么，以及它为什么重要。", "note_en": "At the intersection of trade and the internet, Flexport engineering is disrupting the age-old freight forwarding industry. We&#39;re looking for innovative, passionate people to build the digital technologies that will make shipping around the world easier and more efficient.\n We&#39;re changing how people think about moving freight. It&#39;s exciting to be a pioneer, solving the hard problems.\n Our engineers are taking on huge and unique challenges: to start with, our teams are creating a data model that represents all the complexities of logistics in a way that’s true to reality, yet easy to understand and access. Plus, our clients and the supply chains we support are global. So we don’t roll out our products on a small scale – they’re operating for the businesses we partner with around the world right away.\n Flexport is growing very quickly, and so is our product -- we welcome questions and unique ideas. Our engineers are empowered to identify critical projects, strategically prioritize them, and execute them. You decide how to get us to where we want to go.Don’t know much about freight forwarding? Neither do most engineers when they start, but you’ll develop expertise by collaborating and learning with your team. Plus, because so much of our software is for our internal operations teams, you’ll often get to work directly with your users!\n   Quintin Leong, a software engineer on the bookings team at Flexport, shares why he joined Flexport, what his team’s mission is, and why it matters.", "posttime": "2020-08-09 08:09:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,团队", "title": "Flexport正在世界各地招聘员工", "title_en": "Flexport is hiring employees all over the world", "transed": 1, "url": "https://www.flexport.com/careers/department/engineering", "via": "", "real_tags": ["hiring", "团队"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Linux上使用BPF过滤数据包的每个人最终都会遇到这样一个错误：创建套接字，使用setsockopt应用BPF，然后使用recv从套接字读取。您读取的数据包与筛选器不匹配，但无论如何都是从套接字接收的。该错误仅在有大量流量时才会发生，即便如此，它也只会在应用程序第一次启动时发生。发生了什么事？\n以下是一些受此问题影响的代码。为简明起见，删除了错误处理：\nInt sock=套接字(AF_PACKET，SOCK_RAW，HTONS(ETH_P_ALL))；struct sock_filter bpf_bytecode[]={...}；//手工或使用&#34；tcpdump-dd&#34；struct sock_fprog BPF_PROGRAM={sizeof(Bpf_Bytecode)/sizeof(bpf_bytecode[0])，bpf_bytecode}；int。字符缓冲区[MAX_PACKET_SIZE]；int n=recv(SOCK，BUFFER，MAX_PACKET_SIZE，NO_OPTIONS)；//缓冲区有时会包含与BPF不匹配的数据包。\n这里的bug看起来很简单：包是在内核接收时过滤的，而不是在用户模式使用recv读取包时过滤的。因此，在创建套接字之后、调用setsockopt之前，可以接收到与BPF不匹配的数据包。即使在应用了BPF之后，这些数据包仍将保留在套接字的缓冲区中，并且稍后将通过recv传输到应用程序。\n在应用BPF之后，在循环中使用recv丢弃来自套接字的数据包，直到它为空。这通常是可行的，但如果流量速率大于您可以丢弃数据包的速率，则会出现故障。(例如，如果您在一台流量非常大的机器上嗅探，并且您的应用程序通常会在套接字的缓冲区填满时丢失数据包，但这对您的用例无关紧要。)。在这种情况下，清空套接字的尝试将变成无限循环。\n添加复制BPF逻辑的用户模式检查，并在接收到所有数据包后对其进行检查。重复的逻辑会导致错误。说得够多了。1个。\n现在，让我们看一下修复此错误的教科书解决方案-与libpcap使用的解决方案相同：\nStruct SOCK_FILTER ZERO_BYTECODE=BPF_STMT(BPF_RET|BPF_K，0)；struct SOCK_FPROG ZERO_PROGRAM={1，&amp；ZERO_BYTECODE}；IF(setsockopt(SOCK，SOL_SOCKET，SO_ATTACH_FILTER，&amp；ZERO_PROGRAM，sizeof(ZERO_PROGRAM))&lt；0){printf(&#34；附加零BPF时出错：%d\\。而(1){int bytes=recv(SOCK，DRAIN，SIZOF(DRAIN)，MSG_DONTWAIT)；IF(字节==-1){//我们假设这里的错误意味着没有任何东西可以从套接字读取，这正是我们想要中断的；}//bpf_program是我们要应用的实际BPF程序-就像上一个示例int err=setsockopt(sock，SOL_SOCKET，SO_ATTACH_FILTER，&amp；Int n=recv(SOCK，BUFFER，MAX_PACKET_SIZE，NO_OPTIONS)；//缓冲区现在将始终与BPF匹配\n我们在这里所做的是利用这样一个事实，即将一个BPF换出另一个是原子操作：如果您将一个BPF换成另一个，那么在任何时刻，第一个或第二个都在适当的位置，但永远不会两者都不存在。因此，我们首先应用所谓的“零BPF”，它是不匹配任何分组的BPF。然后，我们清空在应用“Zero-BPF”过滤器之前到达的所有数据包。在这一点上，套接字肯定是空的，它不能填满垃圾，因为零bpf已经就位。然后我们用我们想要的真实的BPF来代替零的BPF。因为交换是原子的，所以我们知道套接字中之后的任何数据包都必须与实际的BPF匹配。\n这似乎是理论上的原因，但我在生产代码中看到它一次又一次地发生。假设您有一个bug，使得您的用户模式检查过于宽松，并且允许不匹配的数据包，但是BPF有适当的限制。您可以使用大量不匹配的数据包来测试您的应用程序，您甚至不会注意到用户模式检查过于宽松，因为BPF无论如何都会过滤掉所有不匹配的数据包。也就是说，在部署到生产中的高流量计算机之前，您永远不会注意到。[返回]", "note_en": "Here is a bug that everyone who uses BPF to filter packets on Linux eventually encounters: you create a socket, use setsockopt to apply a BPF, and then read from the socket using recv. You read a packet that does  not match the filter but was received from the socket anyway. The bug only happens when there is a lot of traffic and even then it only occurs when the application first starts. What is happening?\n Here is some code which suffers from this issue. Error-handling has been removed for conciseness:\n int sock = socket(AF_PACKET, SOCK_RAW, htons(ETH_P_ALL));struct sock_filter bpf_bytecode[] = { ... }; // bytecode generated by hand or using &#34;tcpdump -dd&#34;struct sock_fprog bpf_program = { sizeof(bpf_bytecode) / sizeof(bpf_bytecode[0]), bpf_bytecode};int err = setsockopt(sock, SOL_SOCKET, SO_ATTACH_FILTER, &amp;bpf_program, sizeof(bpf_program));char buffer[MAX_PACKET_SIZE];int n = recv(sock, buffer, MAX_PACKET_SIZE, NO_OPTIONS); // buffer will sometimes contain a packet that doesn&#39;t match the bpf\n The bug here is deceptively simple: Packets are filtered when they are received by the kernel  not when they are read by user-mode using recv. Therefore packets which don’t match the BPF can be received after the socket is created and before setsockopt is called. Those packets will remain in the socket’s buffer even after the BPF is applied and will later be transferred to the application via recv.\n  After applying the bpf use recv in a loop to discard packets from the socket until it is empty. This typically works but it breaks down if the traffic rate is greater than the rate at which you can discard packets. (e.g. if you’re sniffing on a very high traffic machine and your app typically loses packets when the socket’s buffer fills but it doesn’t matter for your use-case.) In this case your attempt to empty the socket will turn into an infinite loop.\n Add user-mode checks that duplicate the BPF’s logic and check all packets after receiving them. Duplicate logic leads to bugs. Enough said.  1\n Now lets look at the textbook solution for fixing this bug - the same solution that  libpcap uses:\n struct sock_filter zero_bytecode = BPF_STMT(BPF_RET | BPF_K, 0);struct sock_fprog zero_program = { 1, &amp;zero_bytecode};if (setsockopt(sock, SOL_SOCKET, SO_ATTACH_FILTER, &amp;zero_program, sizeof(zero_program)) &lt; 0) {\tprintf(&#34;error attaching zero bpf: %d\\n&#34;, errno);\treturn 1;}char drain[1];while (1) {\tint bytes = recv(sock, drain, sizeof(drain), MSG_DONTWAIT);\tif (bytes == -1) {\t\t// we assume the error here means there is nothing left to read from the socket which is exactly what we want\t\tbreak;\t}}// bpf_program is the actual bpf program we want to apply - just like in the previous exampleint err = setsockopt(sock, SOL_SOCKET, SO_ATTACH_FILTER, &amp;bpf_program, sizeof(bpf_program));char buffer[MAX_PACKET_SIZE];int n = recv(sock, buffer, MAX_PACKET_SIZE, NO_OPTIONS); // buffer will now always match the bpf\n What we’re doing here is taking advantage of the fact that swapping one BPF out for another is an atomic operation: if you swap one BPF for another then at every moment either the first is in place or the second but never neither. We therefore start by applying the so-called “zero-BPF” which is a BPF that matches no packets. Then we empty out any packets that arrived before the “zero-BPF” filter was applied. At this point the socket is definitely empty and it can’t fill up with junk because the zero-BPF is in place. Then we replace the zero-BPF with the real BPF we want. Because the swap is atomic we know that any packet in the socket after that must match the real BPF.\n  This seems like a theoretical reason but I’ve seen it happen again and again in production code. Lets say that you have a bug such that your usermode checks are too loose and allow mismatching packets, but the BPF is appropriately restrictive. You could test your app with lots of mismatching packets and you would never even notice that the usermode checks are too loose because the BPF would filter out all the mismatching packets anyway. That is, you would never notice until you deploy to a high-traffic machine in production..   [return]", "posttime": "2020-08-09 08:09:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bpf,filter", "title": "使用BPF过滤套接字的错误方式", "title_en": "The wrong way to filter sockets with BPF", "transed": 1, "url": "https://natanyellin.com/posts/ebpf-filtering-done-right/", "via": "", "real_tags": ["bpf", "filter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017057, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-08-09 07:44:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "5g,weird,创建", "title": "“5G刚刚变得怪怪的”", "title_en": "'5G Just Got Weird'", "transed": 1, "url": "https://spectrum.ieee.org/tech-talk/telecom/standards/5g-release-16", "via": "", "real_tags": ["5g", "weird", "创建"]}, {"category": "", "categoryclass": "", "imagename": "d7d8b049b94ba3ee1bbb7f0e8983b1c0.jpg", "infoid": 1017054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人造分子有朝一日可能形成新型计算机的信息单元，或者成为可编程物质的基础。信息将以单个原子的空间排列进行编码-类似于碱基对序列如何决定DNA的信息含量，或者计算机内存中的0和1序列。加州大学伯克利分校(University of California，Berkeley)和波鸿鲁尔大学(Ruhr-University Bochum，RUB)的研究人员朝着这一愿景迈出了一步。他们表明，原子探针断层扫描可以用来读取多变量金属-有机框架中离子的复杂空间排列。\n金属-有机骨架(MOF)是由多个金属节点组成的晶体多孔网络，由有机单元连接在一起，形成明确的结构。要使用金属序列对信息进行编码，首先必须能够读取金属排列。然而，阅读这份安排是极具挑战性的。最近，人们对表征金属序列的兴趣与日俱增，因为这样的多变量结构将能够提供广泛的信息。\n从根本上说，没有方法读取MOF中的金属序列。在目前的研究中，研究团队通过使用(APT)成功做到了这一点，波鸿的材料科学家童力是其中的专家。研究人员选择了Yaghi集团于2005年制造的MOF-74作为感兴趣的对象。他们设计了钴、镉、铅和锰的混合组合的MOF，然后使用APT解密了它们的空间结构。\n李教授是RUB材料研究所原子尺度表征研究组的负责人，他与加州大学伯克利分校的哲·吉博士和Omar Yaghi教授一起在2020年8月7日在线发表的期刊《科学》上描述了这种方法。\n在未来，MOF可以形成可编程化学分子的基础：例如，MOF可以被编程为向人体内引入一种针对受感染细胞的物质，然后一旦不再需要，就将活性成分分解成无害的物质。或者，可以对MOF进行编程，使其在不同的时间释放不同的药物。\nYaghi说，这是非常强大的，因为你基本上是在编码离开毛孔的分子的行为。\n它们还可以用来捕获二氧化碳，同时将二氧化碳转化为化学工业有用的原料。\n作者写道，从长远来看，这种具有编程原子序列的结构可以完全改变我们对材料合成的思维方式。合成世界可能会达到一个全新的精确度和复杂程度，这在以前是生物学的专属领域。更多信息：多元金属-有机框架中金属的测序，科学(2020)。Doi：10.1126/Science ence.aaz4304，Science e.Science encemag.org/Content/3696504/674corence.Science encemag.org/content/3696504/674.", "note_en": "Artificial molecules could one day form the information unit of a new type of computer or be the basis for programmable substances. The information would be encoded in the spatial arrangement of the individual atoms—similar to how the sequence of base pairs determines the information content of DNA, or sequences of zeros and ones form the memory of computers.    Researchers at the University of California, Berkeley, and Ruhr-Universität Bochum (RUB) have taken a step towards this vision. They showed that atom probe tomography can be used to read a complex spatial arrangement of   ions in multivariate metal-organic frameworks.\n  Metal-organic frameworks (MOFs) are crystalline porous networks of multi-metal nodes linked together by organic units to form a well-defined structure. To encode information using a sequence of metals, it is essential to be first able to read the metal arrangement. However, reading the arrangement was extremely challenging. Recently, the interest in characterizing metal sequences is growing because of the extensive information such multivariate structures would be able to offer.\n  Fundamentally, there was no method to read the metal sequence in MOFs. In the current study, the research team has successfully done so by using   (APT), in which the Bochum-based materials scientist Tong Li is an expert. The researchers chose MOF-74, made by the Yaghi group in 2005, as an object of interest. They designed the MOFs with mixed combinations of cobalt, cadmium, lead, and manganese, and then decrypted their spatial structure using APT.\n  Li, professor and head of the Atomic-Scale Characterisation research group at the Institute for Materials at RUB, describes the method together with Dr. Zhe Ji and Professor Omar Yaghi from UC Berkeley in the journal  Science, published online on August 7, 2020.\n    In the future, MOFs could form the basis of programmable chemical molecules: for instance, an MOF could be programmed to introduce an   into the body to target infected cells and then break down the active ingredient into harmless substances once it is no longer needed. Or MOFs could be programmed to release different drugs at different times.\n  &#34;This is very powerful, because you are basically coding the behavior of molecules leaving the pores,&#34; Yaghi said.\n  They could also be used to capture CO 2 and, at the same time, convert the CO 2 into a useful raw material for the chemical industry.\n  &#34;In the long term, such structures with programmed atomic sequences can completely change our way of thinking about material synthesis,&#34; write the authors. &#34;The synthetic world could reach a whole new level of precision and sophistication that has previously been reserved for biology.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tSequencing of metals in multivariate metal-organic frameworks,  Science (2020).  DOI: 10.1126/science.aaz4304 ,  science.sciencemag.org/content/369/6504/674", "posttime": "2020-08-09 07:42:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,合成,synthetic,mof", "title": "可编程合成材料", "title_en": "Programmable Synthetic Materials", "transed": 1, "url": "https://phys.org/news/2020-08-programmable-synthetic-materials.html", "via": "", "real_tags": ["编程", "合成", "synthetic", "mof"]}]