[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1003139, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创新的例子并没有像从欧洲或美国涌现出来的那样大张旗鼓。\n还记得吗，在冠状病毒大流行的早期，关于如果这种疾病袭击非洲大陆会有多大的世界末日的猜测？我知道。人们深感焦虑的是，这对收入较低的人口、占主导地位但更难监管的非正规经济以及医疗设施远远少于英国或意大利的国家意味着什么。\n曾经有过冠状病毒的错误和误判，还有死亡，每一次都是一场悲剧。没有人知道大流行下一步可能会发生什么--非洲大陆和世界其他地区一样，还没有脱离险境。但同样发生的是，许多非洲国家很早就意识到，大规模、昂贵的检测和住院不是民众的选择，他们别无选择，只能采取更具创造性的方法。\n以我称之为家的两个非洲国家-塞内加尔和加纳为例。塞内加尔正在开发一种冠状病毒检测试剂盒，每位患者的费用为1美元，希望在不到10分钟的时间内，通过唾液中的抗原或抗体检测出当前或以前的感染。很难确切知道这与英国检测的价格相比如何，但许多检测使用聚合酶链式反应(PCR)来检测病毒，费用高达数百美元。我可以作证，本周从我伦敦家门口寄来的一张传单为我提供了一套针对GB250的私人检测试剂盒。\n塞内加尔处于有利地位，因为它的冠状病毒应对计划是在1月份第一次国际上对该病毒的警报发出后认真开始的。政府关闭了边境，启动了一项全面的接触者追踪计划，因为它是一个多职业家庭的国家，无论是在医院还是在社区卫生设施，都为每一名冠状病毒患者提供了一张床位。\n因此，这个拥有1600万人口的国家只有30人死亡。每一起死亡事件都得到了政府的个别承认，并向家属表示哀悼。当数字达到这个水平时，你可以把每一位死者看作一个人。在这些阶段中的每一个阶段，英国都做了相反的事情，现在面临着超过3.5万人的死亡人数。\n拥有3000万人口的加纳的死亡人数与塞内加尔相似，部分原因是广泛的接触者追踪系统，利用了大量的社区卫生工作者和志愿者，以及其他创新技术，如“池检测”，即对多个血样进行检测，然后只有在发现阳性结果时才作为个人检测进行跟进。世界卫生组织目前正在研究这种方法的优点。\n在整个非洲大陆，无法获得昂贵的药品，更不用说有充分理由的历史上缺乏信任，这激起了人们对传统草药是否有什么可提供的兴趣。在马达加斯加总统安德里·拉乔利纳(Anry Rajoelina)声称它是一种治疗冠状病毒的药物后，一种特别的植物-青蒿(Artemisia Annua)，或属于雏菊科的苦艾，引起了特别的关注。\n这听起来可能像特朗普式的，世界卫生组织警告说，在提倡将其作为治疗这种疾病的方法之前，还需要进行进一步的试验。但我联系了备受尊敬的德国马克斯·普朗克胶体与界面研究所(Max Planck Institute Of Colloid And Interfaces)，该研究所目前正在对同一植物的不同品种进行临床试验，这次是在肯塔基州种植的。\n该研究所所长彼得·西伯格(Peter Seeberger)教授告诉我，这种特别种植的更有效的苦艾正在细胞上进行测试，以确定它在对抗冠状病毒感染方面的有效性，到目前为止，结果“非常有趣”。人体临床试验很可能随之而来。\n已经有20多个非洲国家订购了马达加斯加版本，这是对拉乔利纳的一张信任票，他开始拿着一瓶用这种植物制成的棕色草本饮料出现在会议和电视上，吹嘘它的好处。\n他说，你可能没有听说过这件事的原因，是因为对非洲创新的傲慢态度。“如果是欧洲国家真的发现了这种疗法，还会有这么多疑问吗？”他在法国电视上问道。“我不这么认为。”\n科学家们将不得不说出他的“治疗”是否真的有效(在那些呼吁更好地证明其安全性和有效性的人中，有马达加斯加自己的国家医学研究院)。但在以欧洲为中心的态度上，他说得有道理。非洲大陆在创新解决问题方面有着辉煌的历史-只要看看移动货币和金融科技是如何将其变成世界上最精通数字的地区之一就知道了。\n欧洲国家之所以对这种疾病的传播感到惊讶，是因为对东亚采取了居高临下的态度，这一点已经得到了很好的证明。现在，类似的心态似乎会确保我们不会从非洲提供的克服它的教训中吸取教训。", "note_en": "Examples of innovation aren’t getting the fanfare they would do if they emerged from Europe or the US\n   R emember, early on in the Covid-19 pandemic, the speculation as to how apocalyptic it would be  if this disease hit the African continent? I do. There was deep anxiety about what it would mean for countries with lower income populations, dominant but harder-to-regulate informal economies and far fewer healthcare facilities than the UK or Italy.\n There have been coronavirus mistakes and misjudgments, and deaths, and each one is a tragedy. And no one knows the course the pandemic may take next – the continent, like the rest of the world, isn’t out of the woods yet. But what has also happened is that many African nations, realising early on that large-scale, expensive testing and hospitalisation was not an option for the populations, had no choice but to take  a more creative approach.\n Take the two African countries I have called home – Senegal and Ghana. Senegal is developing a Covid-19 testing kit that would  cost  $1 per patient, which it is hoped will, in less than 10 minutes, detect both current or previous infection via antigens in saliva, or antibodies. It’s hard to know exactly how this compares with the price of Britain’s tests, but many of them use polymerase chain reaction, or PCR, to detect the virus, and cost hundreds of dollars. And I can testify that a leaflet that came through my door in London this week offered me a private testing kit for £250.\n Senegal is in a good position because its Covid-19 response planning began in earnest in January, as soon as the first international alert on the virus went out. The government closed the borders, initiated a comprehensive plan of contact tracing and, because it is a nation of multiple-occupation households, offered a bed for  every single  coronavirus patient in either a hospital or a community health facility.\n As a result, this nation of 16 million people has had only 30 deaths. Each death has been acknowledged individually by the government, and condolences paid to the family. You can afford to see each death as a person when the numbers are at this level. At every single one of those stages, the UK did the opposite, and is now facing a death toll of more than 35,000.\n Ghana, with a population of 30 million, has a similar death toll to Senegal, partly because of an extensive system of contact tracing, utilising a large number of community health workers and volunteers, and other innovative techniques such as “pool testing”, in which multiple blood samples are tested and then followed up as individual tests only if a positive result is found. The advantages in this approach are now being  studied by the  World Health Organization.\n Across the African continent, the lack of access to expensive pharmaceutical products, not to mention a well-founded historic lack of trust, has fuelled interest in whether traditional herbal remedies have anything to offer. One plant in particular – Artemisia annua, or sweet wormwood, which belongs to the daisy family – is drawing particular attention after the president of Madagascar, Andry Rajoelina,  claimed it was a “cure” for Covid-19.\n That may sound Trumpian, and the WHO has cautioned that further trials are needed before it can be advocated as a treatment for the disease. But I contacted the respected Max Planck Institute of Colloids and Interfaces in Germany, which is currently  conducting clinical trials on a different breed of the same plant, in this case grown in Kentucky.\n This specially grown, more potent variety of sweet wormwood is being tested on cells to determine its effectiveness in fighting coronavirus infections and the results so far, the institute’s director, Prof Peter Seeberger, told me, are “very interesting”. Human clinical trials are likely to follow.\n More than 20 African countries have already ordered the Madagascan version, a vote of confidence for Rajoelina, who has taken to showing up at meetings and TV appearances with a bottle of a brown herbal drink made from the plant,  touting its benefits.\n The reason you probably haven’t heard about this, he says, is because of patronising attitudes towards African innovation. “If it was a European country that had actually discovered this remedy, would there be so much doubt?” he asked on French TV. “I don’t think so.”\n The scientists will have to say whether his “cure” actually works (among those calling for better evidence of its safety and effectiveness is Madagascar’s own  National Academy of Medicine). But on Eurocentric attitudes, he has a point. The African continent has a stellar history of innovating its way out of problems – just look at how mobile money and fintech has turned it into one of the most  digitally savvy regions in the world.\n It has been well documented how a patronising attitude towards east Asia is what allowed European countries to be caught by such surprise at the spread of this disease. Now a similar mindset seems set to ensure we don’t learn the lessons Africa has to offer in overcoming it.", "posttime": "2020-05-21 23:43:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,非洲,检测", "title": "非洲冠状病毒的成功被忽视了", "title_en": "Africa's coronavirus successes is being overlooked", "transed": 1, "url": "https://www.theguardian.com/commentisfree/2020/may/21/africa-coronavirus-successes-innovation-europe-us", "via": "", "real_tags": ["冠状病毒", "病毒", "非洲", "检测"]}, {"category": "", "categoryclass": "", "imagename": "9ae50089fda71146688b14ae2bc1ce08.jpeg", "infoid": 1003137, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒大流行已经颠覆了无数的工作岗位，甚至整个行业，让许多人想知道另一边会出现什么。\n然而，人工智能(AI)是一个可能在病毒下经受考验-甚至蓬勃发展的行业，这可能让我们得以一窥未来的新兴职业之一。\nIBM负责数据和人工智能的副总裁Ritika Gunnar告诉CNBC Make It，这次爆发带来了压倒性的不确定性，也增加了对人工智能的需求。在接受CNBC Make It采访时，IBM负责数据和人工智能的副总裁丽蒂卡·冈纳(Ritika Gunnar)表示。\n人工智能已经被全面部署，以帮助应对大流行。医院使用这项技术来诊断患者；政府将其用于接触者追踪应用程序，公司依靠它来支持历史上最大的在家实验。\n而且这种需求只会上升。市场研究公司国际数据公司(International Data Corporation)表示，预计今年全球人工智能工作岗位数量将增长16%。\n这可能会在原本具有挑战性的就业市场创造新的机会。但该行业尤其需要更多女性，如果它要克服一些历史性的偏见挑战的话。\n为了消除对人工智能的偏见，你需要在从事这项工作的人中有不同的视角。冈纳尔说，这意味着在人工智能领域会有更多的女性，整体上也会更加多样化。\n该行业最近一直在取得进展。在周三发布的一份新报告中，IBM发现，大多数(85%)的人工智能专业人士认为，近年来该行业变得更加多样化，这对这项技术产生了积极影响。\n在北美、欧洲和印度接受调查的3200多人中，86%的人表示，他们现在对人工智能系统做出决策的能力充满信心。\n然而，人工智能助理公司Out Think的执行董事丽莎·布拉里(Lisa Bouari)表示，要鼓励女性进入这个行业，并让她们留在这个行业，还需要做更多的工作。她也是IBM的“人工智能女性领袖”(Women Leaders In AI)奖项的获得者之一。\nBouari说，吸引和留住女性是同一问题的两个方面，支持在人工智能领域实现更大的女性平衡。报告中强调的关于职业发展的问题和障碍，是帮助女性继续从事人工智能职业，并最终随着现状的发展吸引更多女性的关键。\n对于Gunnar来说，这意味着从小就让更多的妇女和女孩对人工智能感到兴奋。\n冈纳尔说，我们应该让女孩在更早的年龄接触人工智能、数学和科学，这样她们就有了支持系统。\n事实上，IBM的报告指出，尽管近年来越来越多的女性被吸引到这个行业，但由于早期教育期间缺乏支持，她们直到晚年才认为人工智能是一条可行的职业道路。\n许多男性(46%)表示，他们在高中或更早的时候就开始对科技职业感兴趣，而大多数女性(53%)只在本科或研究生期间才认为这是一条可能的道路。\n但布瓦里表示，她希望目前对人工智能需求的激增能帮助推动该行业向前发展。\n她说：这场危机带来的人工智能机会很多，如果我们能成功地跨过障碍并有效地采用它，那么职业机会就在那里。", "note_en": "The coronavirus pandemic has upended countless jobs and even entire industries, leaving many wondering which will emerge out of the other side.\n One industry likely to endure — or even thrive — under the virus, however, is artificial intelligence (AI), which could offer a glimpse into one of the rising careers of the future.\n  &#34;This outbreak is creating overwhelming uncertainty and also greater demand for AI,&#34; IBM&#39;s vice president of data and AI, Ritika Gunnar told  CNBC Make It.\n Already, AI has been deployed sweepingly to help tackle the pandemic. Hospitals use the technology  to diagnose patients; governments employ it in contact tracing apps and companies rely on it to support the biggest work from home experiment in history.\n And that demand is only set to rise. Market research company International Data Corporation says it expects the number of AI jobs globally to  grow 16% this year.\n That could create new opportunities in an otherwise challenging jobs market. But the industry will need more women, in particular, if it is to overcome some of its  historic bias challenges.\n  &#34;In order to remove bias from AI, you need diverse perspectives among the people working on it. That means more women, and more diversity overall, in AI,&#34; said Gunnar.\n  The industry has been making progress lately. In a new report released Wednesday,  IBM found the majority (85%) of AI professionals think the industry has become more diverse over recent years, which has had a positive impact on the technology.\n Of the more than 3,200 people surveyed across  North America,  Europe and  India, 86% said they are now confident in AI systems&#39; ability to make decisions without bias.\n  However, Lisa Bouari, executive director at OutThought AI Assistants and a recipient of IBM&#39;s Women Leaders in AI awards, said more needs to be done to encourage women into the industry and keep them there.\n &#34;Attracting and retaining women are two halves of the same issue supporting a greater balance of women in AI,&#34; said Bouari. &#34;The issues highlighted in the report around career progression, and hurdles, hold the keys to helping women stay in AI careers, and ultimately attracting more women as the status quo evolves.&#34;\n  For Gunnar, that means getting more women and girls excited about AI from a young age.\n &#34;We should expose girls to AI, math and science at a much earlier age so they have a support system in place,&#34; said Gunnar.\n Indeed, IBM&#39;s report noted that although more women have been drawn to the industry over recent years, they did not consider AI a viable career path until later in life due to a lack of support during early education.\n A plurality of men (46%) said they became interested in a tech career in high school or earlier, while a majority of women (53%) only considered it a possible path during their undergraduate degree or grad school.\n But Bouari said she&#39;s hopeful that the surge in demand for AI currently can help drive the industry forward.\n &#34;The AI opportunities from this crisis are numerous and the career opportunities are there if we can successfully move hurdles and adopt it efficiently,&#34; she said.", "posttime": "2020-05-21 23:25:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,人工智能,女性", "title": "科技领域的女性：在冠状病毒中，人工智能领域的工作岗位增加", "title_en": "Women in tech: Jobs in artificial intelligence grow amid coronavirus", "transed": 1, "url": "https://www.cnbc.com/2020/05/06/women-in-tech-jobs-in-artificial-intelligence-grow-amid-coronavirus.html", "via": "", "real_tags": ["冠状病毒", "病毒", "人工智能", "女性"]}, {"category": "", "categoryclass": "", "imagename": "090c3b29d9b5291408bb348b707255ad.jpg", "infoid": 1003136, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎收看气候展望：时事通讯。“纽约时报”气候小组每周给读者发一封电子邮件，向他们介绍有关气候变化的故事和见解。请在此处注册以将其放入您的收件箱。\n对许多人来说，过去的几周是艰难的，但至少我们已经从污染中得到了喘息：随着美国人呆在家里，清空了道路和高速公路上的交通，全国的天空已经放晴了。\n至少，这感觉不错。但对于空气污染水平达到历史最高水平的社区来说，暂时净化空气并不能扭转他们呼吸的空气中高水平的颗粒物污染、臭氧和其他污染物造成的多年损害。\n在我最近关于冠状病毒和空气污染影响的研究中，我重点介绍了三个这样的社区。研究表明，污染行业不成比例地位于低收入社区或附近，主要是黑人或拉丁裔社区。而且，虽然空气污染和冠状病毒之间的确切关系尚不清楚，但研究表明，暴露在空气污染中会使人们更容易患上类似的呼吸道疾病。\n密歇根州众议员泰隆·卡特(Tyrone Carter)是底特律土生土长的人，他在3月底的病毒检测中呈阳性。他告诉我：“你们的环境和邮政编码与你们的预期寿命有很大关系。”\n特朗普政府为了应对疫情，大幅放松了对污染者的规定，并拒绝收紧在冠状病毒爆发之前提交审查的工业排放监管，这加剧了这些当地社区的担忧。我们在全面的回滚跟踪器中跟踪这些逆转，甚至更多。\n瞧一瞧。在大流行期间，你所在的社区是否存在对空气污染的担忧，这意味着什么？你可以在推特上联系我：@HirokoTabuchi。\n新的用电量数据让我们得以洞察美国人在冠状病毒大流行初期的警惕程度：许多人似乎在3月份发布封锁命令之前就呆在家里躲避病毒。\n这些关于30个州家庭消费的数据显示，许多州的能源使用量在居家命令发布前约一周、宣布紧急状态后开始上升。\n[您已经订阅了气候Fwd：时事通讯。走得好。为什么不也在Twitter上关注“纽约时报”的气候团队呢？]。\n数据来自总部位于马萨诸塞州剑桥市的Sense公司，该公司销售一种设备，通过智能手机应用程序帮助房主跟踪能源使用情况。\n这些信息附带一些警告。例如，这些设备往往在精通技术的早期采用者中很受欢迎，而且典型的家居感觉比大多数人都大。该公司表示，总体数据来自30个州的约5000台设备，这些设备在地理上代表了这个国家。\n就像最近对纽约市公寓用电量的一项研究一样，Sense数据显示用电量急剧上升，大部分增加发生在白天，而在正常情况下，许多人都在工作或上学。在所有30个州，该公司报告称，与2019年相比，今年3月10日至4月10日的国内总消费平均增长了22%。数据进行了调整，以计入天气差异。\n按日期和州划分-该公司分别查看了加利福尼亚州、纽约州和其他七个州的数据-结果更加耐人寻味。\n该公司负责技术的副总裁乔治·扎瓦利亚科斯(George Zavaliagkos)说，当他第一次开始查看数据时，他预计当某个州的政府发布封锁命令时，他会看到该州的能源使用量有所上升。加利福尼亚州是第一个在3月19日下令全州封锁的州，纽约州和其他州紧随其后。\n“但这不是我们看到的，”扎瓦利亚科斯说。“在几乎所有的州，大约在3月10日，消费者开始使用越来越多的能源。几乎所有人都步调一致。“\n自3月份以来，已有超过3800万人申请失业。美联储(Federal Reserve)5月14日发布的一项调查数据显示，在2月份工作的人中，有五分之一的人报告在3月份或4月初失去了工作或被暂时解雇，这种痛苦高度集中在低收入者身上。一位美联储官员表示，在收入在4万美元或以下的家庭中，整整39%的前工人失去了工作，相比之下，收入超过10万美元的家庭中，这一比例为13%。\n报告冻疮症状的人数有所上升，冻疮是一种疼痛的红色或紫色病变，通常在冬天出现在手指或脚趾上。这些病变正在成为感染新型冠状病毒的另一种症状。冻疮是由小血管在寒冷或潮湿的条件下发生炎症引起的，但它们通常在最冷的冬季月份很常见。联邦卫生官员不将脚趾病变列入冠状病毒症状清单，但一些皮肤科医生正在推动改变，称所谓的Covid Toe应该是检测的充分理由。\n是的，但是要确保你和不住在你家里的人保持6英尺的距离。即使你只是在公园里闲逛，而不是去慢跑或散步，呼吸一些新鲜空气，希望能得到阳光，也是一个好主意。\n测量一个人的体温来寻找发烧的迹象并不像听起来那么容易，因为“正常”的体温数字可能会有所不同，但通常情况下，要注意100.5华氏度或更高的温度。如果你没有温度计(这些天它们可能很贵)，还有其他方法可以确定你是否发烧，或者有患冠状病毒并发症的风险。\n美国疾病控制与预防中心建议所有美国人在公共场合外出时都要戴上口罩。这是联邦指导方针的转变，反映了新的担忧，即冠状病毒是由没有症状的感染者传播的。到目前为止，疾控中心和世界卫生组织一样，建议普通人除非生病和咳嗽，否则不需要戴口罩。部分原因是为了保存医用级口罩，供医护人员在口罩持续供不应求的时候迫切需要。口罩不能取代洗手和社交距离。\n如果你接触过冠状病毒或认为自己感染了冠状病毒，并出现发烧或咳嗽或呼吸困难等症状，请打电话给医生。他们应该就你是否应该接受检测，如何检测，以及如何在不潜在感染或暴露他人的情况下求医给你提供建议。\n如果你生病了，你认为你已经接触了新的冠状病毒，疾控中心建议你打电话给你的医疗保健提供者，解释你的症状和恐惧。他们会决定你是否需要检查。请记住，有一种可能性--例如，因为缺乏检测工具，或者因为你没有症状--你可能无法接受检测。\n这不是个好主意。即使你退休了，拥有一个平衡的股票和债券投资组合，这样你的钱就可以跟上通胀，甚至是增长，这是有意义的。但退休人员可能想要考虑留出足够的现金来支付未来五年所需的一年生活费用和大笔款项。\n慈善导航器使用基于数字的系统来评估慈善机构，它有一份在受疫情影响的社区工作的非营利性组织的运行名单。你可以通过美国红十字会献血，世界中央厨房已经介入，在主要城市分发食物。\n许多州至少在几天前就宣布进入紧急状态。一些地方政府，包括加利福尼亚州的几个县，在州政府命令之前发布了自己的居家命令。\n加利福尼亚州庞大的州立大学系统从3月10日开始关闭校园，全国各地的其他高校很快也纷纷效仿，迫使许多学生返乡。大约在同一时间，包括亚马逊在内的一些美国最大的雇主开始告诉他们的许多员工不要再来办公室。\n扎瓦利亚科斯说，所有这些都可能是导致早些时候家庭能源使用量上升的原因之一。\n亚利桑那州和北卡罗来纳州这两个州逆势而行，在此期间能源消耗增幅要低得多。这些州后来发布了呆在家里的命令-北卡罗来纳州的命令于3月30日开始，亚利桑那州的命令在一天后开始。在这两个州，包括在调查中的家庭能源使用量在3月14日之后增加了不到10%，不到所有30个州平均水平的一半。\n这些数据没有提供任何线索来解释为什么这些州的居民似乎更少呆在家里。“也许你会听新闻，”扎瓦利亚科斯说。“你听到意大利发生了什么，你会听到谷歌要把所有人送回家。但你也听到你所在的州没有立即做出反应，你说，让我听听我自己的地方州长在说什么。“。\n“我不是说我们可以解开这个故事，”他说。\n我们希望您能就这份时事通讯提供反馈。我们阅读了每一条信息，并回复了很多信息！请将想法和建议通过电子邮件发送到Climate eteam@nytimes.com。\n如果你喜欢我们正在做的事情，请把这个消息传给你的朋友。您可以在这里注册，每周将我们的时事通讯发送到您的收件箱。\n一定要查看我们来自“泰晤士报”的各种免费时事通讯。", "note_en": "Welcome to the   Climate Fwd:  newsletter. The New York Times climate team emails readers once a week with stories and insights about climate change.   Sign up here  to get it in your inbox.\n  For many, the past few weeks have been tough, but at least we’ve had a respite from pollution: With Americans staying home, emptying the roads and highways of traffic,  skies have cleared across the country\n That, at least, feels good. But for neighborhoods with historically high levels of air pollution, a temporary clearing of the air won’t reverse years of damage wrought by the high levels of particulate pollution, ozone and other pollutants in the air they breathe.\n  I featured three such neighborhoods in  my recent look at the effects of coronavirus and air pollution. Research has shown that polluting industries are disproportionately located in or near low-income, predominantly black or Latino neighborhoods. And, while the exact relationship between air pollution and Covid-19 is still unclear, research has shown that exposure to air pollution can make people more vulnerable to similar respiratory illnesses.\n As Michigan State Representative Tyrone Carter, a Detroit native who tested positive for the virus in late March, told me: “Your environment and your ZIP code have a lot to do with your life expectancy.”\n The Trump administration has added to concerns of these local communities by  drastically relaxing rules for polluters in response to the pandemic, and  declining to tighten regulations on industrial emissions that came up for review ahead of the coronavirus outbreak. We track these reversals, and more, in our comprehensive  rollback tracker.\n Take a look. Are there concerns over air pollution, and what that means amid the pandemic, in your neighborhood? You can reach me on Twitter:  @HirokoTabuchi\n    New data on electricity consumption has offered an insight into Americans’ level of wariness in the early days of the coronavirus pandemic: Many appeared to be staying home to avoid the virus even before lockdown orders were issued in March.\n  The data, on consumption in homes in 30 states, shows that energy use began to rise in many states about a week before stay-at-home orders were issued but after states of emergency were declared.\n [You’re already signed up for the Climate Fwd: newsletter. Good move. Why not   follow the New York Times climate team on Twitter , too?]\n  The data comes from  Sense, a company based in Cambridge, Mass., that sells a device to help homeowners track energy use through a smartphone app.\n The information comes with some caveats. For instance, the devices tend to be popular with tech-savvy early adopters, and the typical Sense home is larger than most. Overall data came from about 5,000 of the devices across 30 states that were geographically representative of the country, the company said.\n Like a recent  study of electricity use in New York City apartments, the Sense data shows a sharp rise in consumption, with most of the increase coming during the day, when in normal times many people would be at work or school. Across all 30 states, the company reported a 22 percent average increase in overall domestic consumption from March 10 to April 10 this year compared with 2019. The data was adjusted to account for weather differences.\n Broken down by date and state — the company looked at data for California, New York and seven other states individually — the results are even more intriguing.\n George Zavaliagkos, the company’s vice president of technology, said that when he first started looking at the data, he expected to see a rise in energy use in a given state when that state’s government issued a lockdown order. California was the first state to order a statewide lockdown, on March 19. New York and other states followed quickly.\n  “But that’s not what we saw,” Mr. Zavaliagkos said. “In almost all the states, around March 10, consumers started using more and more energy. Almost everybody moved in tandem.”\n Over 38 million people have filed for unemployment since March. One in five who were working in February reported losing a job or being furloughed in March or the beginning of April,  data from a Federal Reserve survey released on May 14 showed, and that pain was highly concentrated among low earners. Fully 39 percent of former workers living in a household earning $40,000 or less lost work, compared with 13 percent in those making more than $100,000, a Fed official said.\n  There is an uptick in  people reporting symptoms of chilblains, which are painful red or purple lesions that typically appear in the winter on fingers or toes. The lesions are emerging as yet another  symptom of infection with the new coronavirus. Chilblains are caused by inflammation in small blood vessels in reaction to cold or damp conditions, but they are usually common in the coldest winter months. Federal health officials do not include toe lesions in the list of coronavirus symptoms, but some dermatologists are pushing for a change, saying so-called Covid toe should be sufficient grounds for testing.\n  Yes, but make sure you keep six feet of distance between you and people who don’t live in your home.  Even if you just hang out in a park, rather than go for a jog or a walk, getting some fresh air, and hopefully sunshine, is a good idea.\n  Taking one’s temperature to look for signs of fever is not as easy as it sounds, as “normal” temperature numbers can vary, but generally, keep an eye out for a temperature of 100.5 degrees Fahrenheit or higher. If you don’t have a thermometer (they can be pricey these days), there are  other ways to figure out if you have a fever, or are at risk of Covid-19 complications.\n  The C.D.C. has  recommended that all Americans wear cloth masks if they go out in public. This is a shift in federal guidance reflecting  new concerns that the coronavirus is being spread by infected people who have no symptoms. Until now, the C.D.C., like the W.H.O., has advised that ordinary people don’t need to wear masks unless they are sick and coughing. Part of the reason was to preserve medical-grade masks for health care workers who desperately need them at a time when they are in continuously short supply. Masks don’t replace hand washing and social distancing.\n  If you’ve been exposed to the coronavirus or think you have, and have a fever or symptoms like a cough or difficulty breathing, call a doctor. They should give you advice on whether you should be tested, how to get tested, and how to seek medical treatment without potentially infecting or exposing others.\n  If you’re sick and you think you’ve been exposed to the new coronavirus,  the C.D.C. recommends that you call your healthcare provider and explain your symptoms and fears. They will decide if you need to be tested. Keep in mind that there’s a chance — because of a lack of testing kits or because you’re asymptomatic, for instance — you won’t be able to get tested.\n  That’s not a good idea. Even if you’re retired, having a balanced portfolio of stocks and bonds so that your money keeps up with inflation, or even grows, makes sense. But retirees may want to think about having enough cash set aside for a year’s worth of living expenses and big payments needed over the next five years.\n  Charity Navigator, which evaluates charities using a numbers-based system, has a running list of nonprofits working in communities affected by the outbreak. You can give blood through the  American Red Cross, and  World Central Kitchen has stepped in to distribute meals in major cities.\n Many states had declared a state of emergency at least several days before. Some local governments, including several counties in California, issued their own stay-at-home orders that preceded state mandates.\n California’s huge state university system began to close campuses on March 10, and other colleges and universities around the country soon followed suit, forcing many students to return home. Around the same time, some of the nation’s largest employers, including Amazon, began to tell many of their employees to stop coming to the office.\n All of this may have contributed to the earlier rise in home energy use, Mr. Zavaliagkos said.\n Two states, Arizona and North Carolina, bucked the trend, with far lower energy consumption increases during the time period. Those states issued stay-at-home orders later — North Carolina’s began on March 30, Arizona’s a day later. In both states, home energy use included in the survey increased by less than 10 percent after March 14, less than half the average for all 30 states.\n The data doesn’t provide any clues as to why residents of those states appeared to have stayed home less. “Maybe you listen to the news,” Mr. Zavaliagkos said. “You hear what happened in Italy, you hear that Google is sending everybody home. But you also hear that your state is not reacting immediately and you say, let me listen to what my own local governor is saying.”\n “I don’t claim that we can untangle the story,” he said.\n   We’d love your feedback on this newsletter. We read every message, and reply to many! Please email thoughts and suggestions to   climateteam@nytimes.com .\n If you like what we’re doing, please spread the word and send this to your friends. You can   sign up here  to get our newsletter delivered to your inbox each week.\n And be sure to check out   our full assortment of free newsletters  from The Times.", "posttime": "2020-05-21 23:03:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "预期,code,冠状病毒", "title": "您的邮政编码和您的预期寿命", "title_en": "Your ZIP Code and Your Life Expectancy", "transed": 1, "url": "https://www.nytimes.com/2020/05/20/climate/nyt-climate-newsletter-pollution-coronavirus.html#link-67747c50", "via": "", "real_tags": ["预期", "code", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "1bee62079bc4ad4b01efe95cb3b07b3a.jpg", "infoid": 1003135, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1948年，战争结束，约瑟夫·伍德兰回到校园。在曼哈顿计划工作了几年之后，他回到了德雷克塞尔，完成了学士学位，开始了研究生生活。然而，几乎在他重新开始学术工作的时候，他就离开学校去做一个新的秘密项目。\n伍德兰的研究生伯纳德·西尔弗(Bernard Silver)曾听一位杂货店高管说，他的行业需要一种方法来追踪他们销售的产品。西尔弗和伍德兰一起开始寻找答案。他们的第一个原型工作得很好，但太贵了，无法扩大规模。伍德兰攒了一点钱，所以他兑现了这笔钱，并在1948年冬天离开了学校。\n他在迈阿密海滩开了家店-考虑到迈阿密海滩相对于费城冬天的气候优势，这可能是一个自私的选择，但也是一个偶然的选择。有一天在海滩上，他有了一个想法，如何对物品的身份进行视觉编码。正如他告诉“纽约时报”的那样：\n我把四个手指伸进沙子里，不知什么原因--我不知道--我把手拉向我，画了四条线。我说：天哪！现在我有四条线，它们可以是宽线和窄线，而不是点和虚线。\n1952年，他和西尔弗为一种分类设备和方法申请了专利--今天我们称之为条形码。伍德兰和西尔弗的设计不太像现在产品上的条形码。他们两个人把线条拉成一个圆圈，可以从任何角度扫描。但他们组装的阅读机器需要一盏非常亮的灯-500瓦-和一根特殊的管子来将光转换成代码。他们想让一家杂货店感兴趣，但没人感兴趣。这项专利几乎以零卖出-1.5万美元，约合11.5万美元，按2014年美元计算-最终获得了RCA。\n然而，十年后，激光出现了，杂货店制造商恳求科技公司提供与西尔弗和伍德兰已经发明的东西一模一样的东西。RCA推出了旧的设计。伍德兰现在为IBM工作。伍德兰告诉杂货店：1949年我有这个主意的时候，这是一个非常好的主意。但IBM现在有了一个更好的主意--矩形产品代码系统，它在包装上占用的空间更小，对打印机来说也更容易。1974年，达信超市(一家UPC测试机构)的一名收银员扫描了一包口香糖--这是第一件带有UPC代码的商品。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。", "note_en": "In 1948, the war had ended, and Joseph Woodland was back on campus. After spending a couple of years working on the Manhattan Project, he had come back to Drexel to finish his bachelor&#39;s degree and start life as a grad student. Almost as soon as he had started academic work again, though, he left school to work on  a new secret project.\n  Woodland&#39;s fellow grad student, Bernard Silver, had heard a grocery executive say that his industry needed a way to track the products that they sold. Together, Silver and Woodland started working on an answer. Their first prototype worked fine, but it was too expensive to scale. Woodland had a little money saved up so he cashed it and left school in the winter of 1948.\n  He set up shop in Miami Beach—perhaps a self-serving choice, given its climatic advantages over Philadelphia in the winter, but a fortuitous one. One day on the beach, he had an idea for how to visually code items&#39;s identities. As he told   The   New York Times:\n I poked my four fingers into the sand and for whatever reason—I didn&#39;t know—I pulled my hand toward me and drew four lines. I said: &#39;Golly! Now I have four lines, and they could be wide lines and narrow lines instead of dots and dashes.&#39;\n  In 1952, he and Silver would patent a &#34; classifying apparatus and method&#34;—what today we&#39;d call a bar code. Woodland and Silver&#39;s design wasn&#39;t quite like the barcodes on produce now though. The two of them stretched the lines into a circle, which could be scanned from any angle. But the machine they rigged up to read it required a hugely bright lamp—500 watts—and a special tube to convert the light into code. They tried to get a grocery store interested, but no one bit. The patent was sold for next to nothing—$15,000, or about $115,000 in 2014 dollars—and ended up with RCA.\n    A decade later, however, lasers existed, and grocery manufacturers were begging tech companies for something exactly like what Silver and Woodland had already invented. RCA trotted out the old design. Woodland now worked for IBM. Woodland told the grocery stores: &#34; That was a very good idea when I had it back in 1949.&#34; But IBM now had a better one—a rectangular product code system that took up less space on packaging and would be easier on printers. In 1974, a cashier at  Marsh&#39;s supermarket, a UPC test facility, scanned a pack of gum—the first item sold with a UPC code.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.", "posttime": "2020-05-21 23:02:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "条形码,bar,德兰", "title": "第一个条形码是圆形的(2014)", "title_en": "The First Bar Code Was Round (2014)", "transed": 1, "url": "https://www.theatlantic.com/technology/archive/2014/11/the-first-bar-code-was-round/383171/", "via": "", "real_tags": ["条形码", "bar", "德兰"]}, {"category": "", "categoryclass": "", "imagename": "5737d7a1addff3a5e6bf8fb9eb118e2f.jpg", "infoid": 1003133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在三月份旧金山湾区的居家订单的第二天，诺希米·希门尼斯(Nohemi Jimenez)在加利福尼亚州圣巴勃罗上了她的车，向她3岁的儿子挥手告别，然后开车去参加周三的定期透析预约。\n路上空无一人。没有交通堵塞。希门尼斯说，很难承认她下一步的想法：没有交通就意味着没有车祸。这意味着她在肾移植等待名单上的时间会更长。\n我不想刻薄，但我就像，哦，天哪。她说，没有人会死。我不会接受我的移植手术。\n现年30岁的希门尼斯在20岁时怀上了她的第一个孩子，医生发现她出生时只有一个肾脏，而且唯一的肾脏正在衰竭。到29岁时，医生告诉她需要一个新的。她说，等待一个人死去，这样她才能活下来，这很奇怪，也很可怕。\n她说：你正在考虑这件事。它就在你的脑海里。它就是永远不能让你一个人呆着。\n根据管理美国器官移植系统的器官共享联合网络(United Network For Organ Sharing)的数据，死于车祸和致命伤害是移植器官的最大来源，占捐赠量的33%。\n但自从冠状病毒迫使加州人呆在室内以来，这些事故已经减少了。加州大学戴维斯分校(University of California，Davis)的一项研究显示，在实施就地避难限制的前三周，该州的交通碰撞和死亡人数下降了一半。根据非营利组织“立即停止溺水”汇编的数据，加州溺水死亡人数下降了80%。\n在4月份，器官采购组织通常会看到与户外、春假相关的活动和旅行相关的捐赠激增，但今年不会。\n根据UNOS的数据，从3月8日到4月11日，全国死于交通碰撞的器官捐赠者人数比去年同期下降了23%，而死于所有其他类型事故的捐赠者下降了21%。\n为北加州和内华达州管理器官捐赠的捐赠者网络West的首席执行官贾尼斯·威利(Janice Whaley)说，几乎不存在春假事故，因为春假期间没有海滩事故、摩托车事故和狩猎事故。\n医生们说，他们还注意到急诊室就诊的总人数有所下降，这不仅仅是因为事故，这可能也限制了捐献器官的供应。\n心脏病发作的人都到哪里去了？加州大学旧金山分校教授、传染病内科医生乔治·卢瑟福说，中风患者都到哪里去了？这些患者是因为害怕COVID而远离急诊室吗？显然，人口普查在急诊室已经很低了。\n在北加州的凯撒永久医疗中心，有440万名患者得到护理，自从3月初报道了该地区首例冠状病毒死亡病例以来，每周因心脏病发作入院的人数下降了近50%。\n根据UNOS的数据，中风和心脏病发作是器官捐赠的第二和第三大常见来源，分别占器官捐赠的27%和20%。\n当人们在家里而不是医院死于中风或心脏病发作时，他们的器官不能用于移植，因为失去了血液流动。大多数器官捐赠发生在一个人遭受了近乎致命的事件之后，拯救生命的措施没有奏效。要使器官存活，人们必须在使用呼吸机时死亡或被宣布脑死亡，这样血液就会源源不断地流向心脏、肺、肝脏和肾脏。\n在冠状病毒大流行期间，一系列其他后勤并发症使移植变得困难。医院不得不缩减各种手术，以保存稀缺的个人防护设备和呼吸机供应。而且许多避难所没有足够的带宽来管理器官捐赠、回收、运输和移植的微妙时机和复杂性。\n根据UNOS的数据，从3月8日到4月11日，全国的移植手术暴跌了52%。\n有很多事情必须完美地发生，而现在我们正处于一个不完美的境地，我们正在努力处理这么多其他的事情，威利说。\n在大流行的早期，随着医疗中心准备迎接冠状病毒患者的浪潮，他们想要释放尽可能多的呼吸机。除了捐赠者需要死在呼吸机上以保持器官存活外，医生通常会在移植团队和接受者排队时让他们在呼吸机上停留两三天。然后，接受者在手术期间需要戴上呼吸机。\n惠利说，人们对让非冠状病毒患者戴上呼吸机、占用空间感到非常不安。他们想确保他们已经为下一位病人做好了准备。\nWhaley说，许多死亡的COVID患者以前曾签约在死亡时捐赠他们的器官用于移植，但由于担心接受者可能会被感染，这些器官被拒绝了。\n冠状病毒检测用品的短缺使得移植中心很难对后来死于其他原因的潜在捐赠者进行检测，以确保他们没有感染病毒。\n加州大学旧金山分校(UCSF)教授兼移植外科医生克里斯·弗里斯(Chris Freise)博士表示，因此可能出现了一些我们通常不会看到的器官衰退。\n作为一项政策，医院取消了几乎所有来自活体捐赠者的器官移植-涉及家庭成员或其他人捐赠肾脏或肝脏切片的程序。\n弗里斯说，这涉及到将两名患者--捐赠者和接受者--送进医院，我们当然不想让捐赠者面临任何重大的额外风险。在全国的大多数项目中，活体肾移植几乎完全停止。\n一些医院在5月初重新开始进行活体捐赠，而已故捐赠者的捐赠从4月中旬开始缓慢增加。\n就在那时，希门尼斯接到了弗里斯在加州大学旧金山分校的团队打来的电话。弗里斯说，与希门尼斯三次怀孕有关的情况使她很难找到合适的捐赠者，这就像大海捞针。这也让她排在等待名单的首位，以防找到匹配的捐赠者。\n4月17日，希门尼斯的电话在凌晨2点响起。一名移植工作人员告诉她马上去医院。\n她只知道捐赠者当时19岁，死于洛杉矶的一场车祸。希门尼斯给捐赠者的家人写了一封信。\n我告诉他们，我会永远想着他们，她说。我会让他或她在我的身体里度过余生，我会为我们两个而活。\n希门尼斯还有六个月的康复时间。她说，她期待着重返工作岗位，有更多的精力和孩子们一起玩耍。", "note_en": "On Day 2 of the San Francisco Bay Area&#39;s stay-at-home orders in March, Nohemi Jimenez got into her car in San Pablo, Calif., waved goodbye to her 3-year-old son and drove to her regular Wednesday dialysis appointment.\n  The roads were deserted. No traffic. Jimenez says it is hard to admit what she thought next: No traffic meant no car crashes. And that meant she&#39;d be on the waiting list for a kidney transplant even longer.\n  &#34;I don&#39;t want to be mean, but I was like, &#39;Oh, my God. Nobody&#39;s going to die,&#39;&#34; she says. &#34;I&#39;m not going to get my transplant.&#34;\n  Jimenez, who is now 30 years old, was 20 and pregnant with her first child when doctors discovered she had been born with only one kidney, and that lone kidney was failing. By age 29, doctors told her she needed a new one. It was strange and scary, she says, waiting for someone to die so she could live.\n  &#34;You&#39;re just thinking about it,&#34; she says. &#34;It&#39;s sitting in your mind. It just can never leave you alone.&#34;\n    Deaths from motor vehicle crashes and fatal injuries are the biggest source of organs for transplant, accounting for 33% of donations, according to the United Network for Organ Sharing, which manages the nation&#39;s organ transplant system.\n    But ever since the coronavirus forced Californians indoors, those accidents have declined. Traffic collisions and fatalities in the state dropped by half in the first three weeks of shelter-in-place restrictions, according to a  study by the University of California, Davis. Drowning deaths dropped 80% in California, according to data compiled by the nonprofit  Stop Drowning Now.\n     In April, organ procurement organizations typically see a surge in donations related to outdoor, spring break-related activities and travel, but not this year.\n     From March 8 to April 11, the number of organ donors who died in traffic collisions was down 23% nationwide compared with the same period last year, while donors who died in all other types of accidents were down 21%, according to data from UNOS.\n  &#34;Spring break accidents are almost nonexistent because there&#39;s no spring break — beach accidents, motorcycle accidents, hunting accidents,&#34; says Janice Whaley, CEO of  Donor Network West, which manages organ donations for Northern California and Nevada.\n  Doctors say they&#39;ve also noticed a decline in emergency room visits overall, not just for accidents, and this may also be limiting the supply of donor organs.\n  &#34;Where are all the people with heart attacks? Where are all the people with strokes?&#34; says George Rutherford, a professor and infectious disease physician at the University of California, San Francisco. &#34;Are those patients staying away from the ERs for fear of COVID? Clearly, the census is way down in ERs.&#34;\n  At Kaiser Permanente medical centers in Northern California, where 4.4 million patients get care, weekly hospital admissions for heart attacks have  dropped almost 50% since the region&#39;s first COVID-19 death was reported in early March.\n  Strokes and heart attacks are the second and third most common sources of organ donations, accounting for 27% and 20% of organs, respectively, according to UNOS.\n  When people die from a stroke or heart attack at home instead of a hospital, their organs cannot be used for transplant because of lost blood flow. Most organ donations occur after a person suffers a near-fatal event and lifesaving measures do not work.  For organs to be viable, people must die or be declared brain-dead while on a ventilator, so blood keeps pumping to the heart, lungs, liver and kidneys.\n    A range of other logistical complications have made transplants difficult during the coronavirus pandemic. Hospitals have had to scale back surgeries of all kinds to preserve scarce supplies of personal protective equipment and ventilators. And many haven&#39;t had the bandwidth to manage the delicate timing and complexity of organ donation, recovery, transportation and transplantation.\n  Transplant surgeries across the country plummeted 52% from March 8 to April 11, according to  UNOS data.\n  &#34;There are a lot of things that have to happen perfectly, and now we&#39;re in an imperfect situation where we&#39;re trying to deal with so many other things,&#34; Whaley says.\n  Earlier in the pandemic, as medical centers braced for a wave of COVID-19 patients, they wanted to free up as many ventilators as possible. In addition to donors needing to die on ventilators to keep their organs viable, doctors often keep them on ventilators for two or three days while transplant teams and recipients are lined up. Then the recipients need to be on ventilators during surgery.\n  &#34;People were very antsy about having non-COVID-19 patients on ventilators, taking up space,&#34; Whaley says. &#34;They wanted to make sure they were ready for that next patient.&#34;\n  Many COVID patients who died had previously signed up to have their organs donated for transplantation upon death; but those organs were declined , out of concern that recipients could become infected, Whaley says.\n    And a shortage of coronavirus testing supplies made it difficult for transplant centers to test potential donors who later died of other causes to make sure they were not infected with the virus.\n  &#34;So there may have been some organ turndowns that we normally wouldn&#39;t have seen,&#34; says Dr. Chris Freise, a professor and transplant surgeon at UCSF.\n  As a matter of policy, hospitals canceled virtually all organ transplants from living donors — procedures that involve a family member or someone else donating a kidney or section of their liver.\n  &#34;That involves bringing two patients into the hospital — the donor and the recipient — and we certainly didn&#39;t want to put donors at any significant extra risk,&#34; Freise says. &#34;Living-donor kidney transplants ground down to almost a complete halt in most programs across the country.&#34;\n  Some hospitals began doing living donations again in early May, while donations from deceased donors started to increase slowly in mid-April.\n  That&#39;s when Jimenez got her call from Freise&#39;s team at UCSF. A condition related to Jimenez&#39;s three pregnancies made  finding a donor match for her exceptionally difficult, Freise says — &#34;like a needle in a haystack.&#34; That also put her at the top of the waiting list in case a match was found.\n  On April 17, Jimenez&#39;s phone rang at 2 a.m. A transplant staffer told her to get to the hospital right away.\n    All she knows is that the donor was 19 and died in an accident in Los Angeles. Jimenez wrote a letter to the donor&#39;s family.\n  &#34;I told them that I will forever be thinking of them,&#34; she says. &#34;I will have him or her in my body for the rest of my life, and I will live for both of us.&#34;\n  Jimenez has six months of recovery ahead of her. She says she&#39;s looking forward to going back to work and having more energy to play with her kids.", "posttime": "2020-05-21 23:00:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "减少,transplants,器官", "title": "器官移植减少，因为留在家里的规则减少了致命的交通碰撞", "title_en": "Organ Transplants Down as Stay-at-Home Rules Reduce Fatal Traffic Collisions", "transed": 1, "url": "https://www.npr.org/sections/health-shots/2020/05/20/858712314/organ-transplants-down-as-stay-at-home-rules-reduce-fatal-traffic-collisions", "via": "", "real_tags": ["减少", "器官"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么是兔子？什么是MQ？它如何改进我们的应用程序？我为什么要了解更多呢？-这些是我第一次被介绍给RabbitMQ时问的问题。我是Gabor，现在是RabbitMQ的工程师和顾问。在我使用RabbitMQ的时间里，我了解到即使是有经验的客户也会问这些问题。\n在我们深入研究RabbitMQ是什么以及如何使用它之前，有必要更多地了解问题域本身。不同服务(即计算机)之间的通信是一个由来已久的问题。\n一方面，有定义交通工具和通信属性的不同协议。此类协议的一些示例包括SMTP、FTP、HTTP或WebSockets(仅举几例)，它们都基于TCP/UDP。它们处理消息的格式化、可靠性和找到正确的收件人。\n另一方面，我们可以从信息的角度来探讨交际。它存在于一个系统中，然后被传输到另一个系统，得到转换，也就是说，它有一个生命周期。当它从一个系统传输到另一个系统时，我们应该知道消息在哪里，以及在任何给定的时间点谁拥有它。\n上面提到的通信协议可以确保消息的所有权(和“物理”位置)从一个系统转移到另一个系统(尽管执行该事务可能需要一些时间)。在双方都在场的情况下，我们可以认为这次转让是双方之间的交易。大多数情况下，这种主动交换是可取的，例如，询问服务的状态并期望得到及时和准确的答复。现实世界中的一个例子是通过电话呼叫某人：1)我们开始通话，2)等待对方应答，3)进行愉快的讨论，4)挂断电话。\n但也有其他时候，我们不需要答案，我们只需要接收者取得消息的所有权并履行其职责。在这种情况下，我们需要一个中介代理，即另一个系统来(临时)取得消息的所有权，并确保消息到达其目的地。为了进一步说明电话示例，对方目前无法接听，因此我们留下语音留言。语音邮件服务将通知目标接收者。\n这种异步(延迟的)消息传递是RabbitMQ提供的。显然，它可以做的不仅仅是一台简单的答录机，所以让我们看看下面它提供的一些选项。\n(如果您有兴趣了解更多有关RabbitMQ的历史，我推荐Alvaro Videla和Jason Williams的“RabbitMQ在行动”的第一章。它将揭示为什么它以兔子的名字命名的答案)。\nRabbitMQ是一个免费、开源且可扩展的消息队列解决方案。它是一种理解AMQP(高级消息队列协议)的Message Broker，但也能够与其他流行的消息传递解决方案(如MQTT)一起使用。它具有高可用性、容错性和可扩展性。它是在Erlang OTP中实现的，这是一项专为构建STATBE、可靠、容错和高度可扩展的系统而量身定做的技术，这些系统具有处理大量并发操作的本地能力，例如RabbitMQ和其他系统，如WhatsApp、MongooseIM等等。\n在非常高的级别上，它是一个中间件层，它使应用程序中的不同服务能够相互通信，而无需担心消息丢失，同时提供不同的服务质量(QoS)要求。它还支持细粒度和高效的消息路由，从而实现应用程序的广泛解耦。\n为了展示RabbitMQ的多功能性，我们将使用三个案例研究来演示RabbitMQ如何非常适合作为黑盒托管服务方法，作为与支持功能良好的微服务体系结构的应用程序紧密集成的方法，或者作为其他遗留项目的门户。\n当一个整体系统被分解成独立的子系统时，需要解决的最大问题之一是使用哪种通信技术。像MuleSoft或MassTransport这样的解决方案可以通过声明HTTP侦听器和发送器来“连接”服务。这种解决方案将RabbitMQ视为黑盒，但仍然能够利用RabbitMQ的功能。作为直接通信的示例，让我们使用HTTP“连接”各个服务。虽然它是一个得到很好支持和可靠的选择，但它也有一些缺点：1)没有解决服务发现问题。一种可能的解决方案是使用DNS。随着系统的扩展和增长，查找和平衡此负载的复杂性也随之增加。RabbitMQ可以减轻解决方案增加的复杂性。2)交流是短暂的。消息很容易在网络层被丢弃或复制。如果服务暂时不可用，则传递失败。\nRabbitMQ通过使用消息队列作为一种传输方式，可以在这两种情况下提供帮助。服务可以发布和使用消息，这将端到端消息传递与目标服务的可用性分离。如果消费服务暂时不可用，与HTTP不同的是，消息被安全地缓冲并保留在RabbitMQ中，并最终在服务恢复在线时交付。\n可发现性也得到了简化。我们只需要知道RabbitMQ在哪里以及队列名称是什么。虽然这看起来只是重新创造了问题，但这是可伸缩的。队列名称充当服务的地址。单个服务使用队列中的消息提供了一种可伸缩性的方法，即每个队列可以服务于多个使用者并平衡负载。不需要更改已内置于服务中的队列配置。\n这种适度静态的队列配置将RabbitMQ推向中间件层，在中间件层，可靠的设计可以保证长期稳定的服务质量。\n在光谱的另一端是一种更加流畅的体系结构，它适应了许多微服务不断变化的需求。RabbitMQ之所以在这个环境中大放异彩，是因为它提供了非常强大的路由功能。\n路由逻辑以不同的(所谓的)交换类型实现，这些交换类型可以在需要时由应用动态创建。目的地服务创建它们希望从中消费的队列，然后通过指定发布者在发布消息时可以使用的键的模式将它们绑定到交换。(将这些键视为交换可以用来将消息路由和传递到一个或多个队列的元数据。)。\nRabbitMQ提供了四种有用的交换类型，涵盖了大多数消息传递用例：1)直接交换。这将把传入消息传递到其绑定键与消息的路由键完全匹配的任何队列。如果使用队列名称作为路由关键字绑定队列，则可以将其视为一对一消息传递。通过使用多个队列的绑定键将同一消息传递到多个队列非常简单。2)主题交流。这将把传入消息传递到通配符绑定关键字与发布消息的路由关键字匹配的任何队列。绑定密钥可以包含复合路由密钥的通配符匹配条件。(例如，绑定密钥logs.*.error将与路由密钥logs.counting.error和logs.ui.error匹配)。这使我们能够编写逻辑包含良好的简单服务，并且消息将通过RabbitMQ的“魔力”到达正确的服务。3)扇出交换。有些消息需要传送到所有队列，这是可以使用扇出交换而不是在应用程序中编写复杂的多播逻辑的地方。使用RabbitMQ扇出交换，每个服务都将适当的队列绑定到交换，而不需要指定绑定键，这一切都是自动发生的。如果指定了绑定密钥，扇出交换机将简单地忽略它，并且仍然将消息路由/广播到绑定到它的所有队列。4)报头交换。该交换利用了AMQP消息的结构，并且能够基于AMQP消息的报头(包括自定义报头)进行复杂的路由。标头是附加到通过AMQP发送的每封邮件的元数据。\n除了交换之外，RabbitMQ中还有其他有用的特性，可以实现非常复杂的消息传递逻辑。一些最重要的功能包括：1)自定义插件。RabbitMQ允许用户添加插件，因此是可扩展的。RabbitMQ几乎每个方面都是可定制的，包括管理、身份验证和授权、备份解决方案和集群。2)聚类。当单个RabbitMQ服务器不够用时，可以连接多个RabbitMQ代理来协同工作并扩展系统。它可以使RabbitMQ处理更多消息或提高对错误的恢复能力。3)服务质量调整。通过将TTL(生存时间)值附加到消息或队列，可以帮助传递对时间敏感的消息。超时消息可以自动传递到死信队列。将普通路由逻辑和这些额外功能相结合可以产生高度高级的路由逻辑。另一个有用的功能是使用优先级队列，发布者可以在其中为每条消息分配优先级。还可以限制未确认消息的数量，这允许消费服务的性能调优，在这种情况下，RabbitMQ应用了背压机制。\n在前面的用例中，我提到了使用插件扩展RabbitMQ功能的可能性。这个强大的特性允许RabbitMQ充当RabbitMQ原生(支持AMQP)服务和其他遗留应用程序之间的中介层。一些值得注意的例子包括：1)通过简单地启用插件，将RabbitMQ用作MQTT代理。这为许多物联网技术打开了新的天地。2)RabbitMQ的JMS(Java Message Service)插件，该插件允许RabbitMQ与任何支持JMS的消息传递解决方案进行通信。3)如果您的应用程序使用专有协议进行通信，则可以开发一个自定义插件来连接任何此类服务。\n如上面的示例所示，RabbitMQ几乎没有什么不能与之通信的。但就像生活中的任何事情一样，这是有代价的。尽管配置RabbitMQ大部分都很简单，但有时仅有的功能数量可能会让人望而却步。如果您在设计、实施或支持RabbitMQ经纪人方面遇到任何问题，请联系我们的专家团队。\n想要一个直观的系统来轻松监控和维护RabbitMQ吗？现在就获得您的免费45天试用的WOBATOAM。\n回到博客", "note_en": "Why Rabbit? What is MQ? How can it improve our applications? Why would I want to learn more about it? — These are questions that I asked when I was first introduced to RabbitMQ. I’m Gabor, and I’m now a RabbitMQ engineer and consultant. In my time working with RabbitMQ, I’ve learned that even experienced customers ask these questions.\n  Before we delve into what RabbitMQ is and how to use it, it is worth learning more about the problem domain itself. Communication between different services (a.k.a computers) is an age-old problem.\n On one hand, there are the different protocols defining the means of transportation and the properties of the communication. Some examples of such protocols include SMTP, FTP, HTTP or WebSockets (to name a few), which are all based on TCP/UDP. They deal with the formatting, reliability and finding the correct recipient of a message.\n On the other hand, we can explore the communication from the perspective of the message. It exists in one system, then it is transported to another, gets transformed, that is, it has a lifecycle. As it travels from one system to another, we should be aware of where the message is, and who owns it at any given point of time.\n The communication protocols mentioned above can make sure that the ownership (and the “physical” location) of the message is transferred from one system to the other (although it may take some time to execute this transaction). We can consider the transfer to be a transaction between the two parties while both are present. Most of the time, this active exchange is desirable, e.g. asking for the status of the service and expecting a timely and accurate answer. An example from the physical world would be calling somebody over the phone: 1) we start the call, 2) wait for the other party to answer, 3) have a nice discussion, 4) hang up the phone.\n But there are other times when we don’t need the answer, we just need the receiver to take ownership of the message and do its job. In this case, we need an intermediary agent, another system to take ownership of the message (temporarily) and make sure that the message reaches its destination. To push the phone example further, the other party is not available at the moment, so we leave a voice message. The voicemail service will notify the intended receiver.\n This asynchronous (delayed) message delivery is what RabbitMQ provides. Obviously, it can do more than a simple answering machine, so let’s explore some of the options it provides below\n (If you are interested in learning more about the history of RabbitMQ, I recommend the first chapter of “RabbitMQ in Action” by Alvaro Videla and Jason Williams. It will reveal the answer to why it is named after Rabbits).\n  RabbitMQ is a free, open-source and extensible message queuing solution. It is a message broker that understands AMQP (Advanced Message Queuing Protocol), but is also able to be used with other popular messaging solutions like MQTT. It is highly available, fault tolerant and scalable. It is implemented in  Erlang OTP, a technology tailored for building stabe, reliable, fault tolerant and highly scalable systems which possess native capabilities of handling very large numbers of concurrent operations, such as is the case with RabbitMQ and other systems like WhatsApp, MongooseIM, to mention a few.\n At a very high level, it is a middleware layer that enables different services in your application to communicate with each other without worrying about message loss while providing different quality of service (QoS) requirements. It also enables fine-grained and efficient message routing enabling extensive decoupling of applications.\n  To show off the versatility of RabbitMQ, we are going to use three case studies that demonstrate how RabbitMQ is well suited as a black-box managed service approach, as one that integrates tightly with the application enabling a well-functioning micro-service architecture, or as a gateway to other legacy projects.\n  When a monolith system is broken down to separate subsystems, one of the biggest problems that needs solving is which communication technology to use. A solution like  Mulesoft, or  MassTransit can “wire” services by declaring HTTP listeners and senders. This kind of solution treats RabbitMQ as a black box, but is still able to leverage the capabilities of RabbitMQ. As an example of direct communication, let’s use HTTP to “connect” the individual services. While it is a well-supported and solid choice, it has some drawbacks: 1) The discovery of services is not solved. A possible solution is to use DNS. As the system scales and grows, so too does the complexity of finding and balancing this load. RabbitMQ can mitigate the increased complexity of the solution. 2) The communication is ephemeral. Messages are prone to being dropped or duplicated on the network layer. If a service is unavailable temporarily, the delivery fails.\n RabbitMQ can help in both cases by utilising message queues as a means of transport. Services can publish and consume messages, which decouples the end-to-end message delivery from the availability of the destination service. If a consuming service is temporarily unavailable, unlike HTTP, the message is safely buffered and retained in RabbitMQ, and eventually delivered when the service comes back online.\n   Discoverability is simplified too. All we need to know is where RabbitMQ is and what the queue name is. Although it seems like this just reinvents the problem, this is scalable. The queue name acts as the address of the service. Consuming messages from the queues by the individual services offer a means for scalability, i.e. each queue can serve multiple consumers and balance the load. There is no need to change the queue configuration already built into the services.\n This moderately static queue configuration pushes RabbitMQ to a middleware layer where a solid design can guarantee a stable service quality in the long term.\n  On the other end of the spectrum is an architecture which is more fluid and adapts to the ever-changing needs of many micro-services. What makes RabbitMQ shine in this environment is the very powerful routing capabilities it provides.\n The routing logic is implemented in different (so-called) exchange types that can be dynamically created by the application when needed. The destination services create the queues that they wish to consume from, then bind them to exchanges by specifying a pattern for the keys the publishers can use when publishing the message. (Think about these keys as metadata that the exchanges can use to route and deliver the messages to one or more queues.)\n   RabbitMQ comes with four useful exchange types that cover most of the use-cases for messaging: 1)  Direct exchange. This will deliver the incoming message to any queue whose binding key exactly matches the routing key of the message. If you bind the queues with the queue name as routing keys, then you can think about it as a one-to-one message delivery. It is simple to deliver the same message to multiple queues by using the binding keys for multiple queues. 2)  Topic exchange. This will deliver the incoming message to any queue whose wild-card binding key matches the routing key of the published message. Binding keys can contain wild-card matching criteria for a compound routing key. (e.g. the binding key  logs.*.error will match the routing keys  logs.accounting.error and  logs.ui.error). This enables us to write simple services where the logic is well contained, and the message will arrive to the correct services through the “magic” of RabbitMQ. 3)  Fanout exchange. Some messages need to be delivered to all queues, this is where a fanout exchange can be used instead of writing an elaborate multicast logic in the application. With a RabbitMQ fanout exchange, each service binds the appropriate queue to the exchange without need to specify a binding key, and it all happens automatically. If a binding key is specified, the fanout exchange will simply ignore it and still route/broadcast messages to all queues bound to it. 4)  Headers exchange. This exchange leverages the structure of AMQP messages and is capable of complex routing based on the headers (including custom ones) of the AMQP message. Headers are metadata attached to each message sent via AMQP.\n In addition to exchanges, there are other useful features in RabbitMQ which enable the implementation of very complex messaging logic. Some of the most important features include: 1)  Custom plug-ins. RabbitMQ is extensible by allowing its users to add plug-ins. Almost every aspect of RabbitMQ is customisable, including the management, authentication and authorisation, back-up solutions, and clustering. 2)  Clustering. When a single RabbitMQ server is not enough, multiple RabbitMQ brokers can be connected to work together and scale the system. It can enable RabbitMQ to process more messages or increase resilience to errors. 3)  Quality of Service tuning. Time-sensitive message delivery can be helped by attaching a TTL (Time-to-Live) value to either the message or the queue. Timed out messages can be automatically delivered to a Dead-letter queue. Combining ordinary routing logic and these extra features can lead to highly advanced routing logics. Another useful feature is using priority queues where the publisher can assign a priority level to each message. It is also possible to limit the number of unacknowledged messages, which allows for the performance tuning of the consuming services, in this case, RabbitMQ applies a back-pressure mechanism.\n  In the previous use-case, I mentioned the possibility of using plug-ins to extend the functionality of RabbitMQ. This powerful feature allows RabbitMQ to act as a mediation layer between your RabbitMQ native (AMQP capable) services and other legacy applications. Some notable examples include:  1) Using RabbitMQ as an MQTT broker by simply enabling a plug-in. This opens up the landscape to many IoT technologies.  2) RabbitMQ’s JMS (Java Message Service) plug-in, which allows RabbitMQ to communicate with any JMS capable messaging solution.  3) If your application is using a proprietary protocol for communicating, it is possible to develop a custom plugin to connect to any such services.\n  As the above examples demonstrate, there is hardly anything that RabbitMQ can’t communicate with. But as with anything in life, it has a price. Although configuring RabbitMQ is mostly straightforward, sometimes the mere number of features can be overwhelming. If you face any problems with designing, implementing or supporting your RabbitMQ brokers, reach out to our expert team here.\n  Want an intuitive system that makes monitoring and maintenance of your RabbitMQ easy?  Get your free 45 day trial of WombatOAM now.\n       Go back to the blog", "posttime": "2020-05-21 23:00:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rabbitmq,introduction", "title": "RabbitMQ简介", "title_en": "An introduction to RabbitMQ", "transed": 1, "url": "https://www.erlang-solutions.com/blog/an-introduction-to-rabbitmq-what-is-rabbitmq.html", "via": "", "real_tags": ["rabbitmq"]}, {"category": "", "categoryclass": "", "imagename": "54f2e8a61e18b69e241232dc9b58401c.jpg", "infoid": 1003131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "完整视频：https://www.pscp.tv/Microsoft/1OyKAYWPRrWKb?t=29m19s信用：微软、OpenAI", "note_en": "Full Video: https://www.pscp.tv/Microsoft/1OyKAYWPRrWKb?t=29m19s Credits: Microsoft, OpenAI", "posttime": "2020-05-21 22:59:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,python,代码,openai,https", "title": "Microsoft OpenAI可以根据函数签名和注释编写Python代码", "title_en": "Microsoft OpenAI can write Python code based on function signature and comments", "transed": 1, "url": "https://www.youtube.com/watch?v=fZSFNUT6iY8", "via": "", "real_tags": ["microsoft", "python", "代码", "openai", "https"]}, {"category": "", "categoryclass": "", "imagename": "3276dd30839d0c149b853bc829a9533d.jpg", "infoid": 1003130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4.8(6个评级)课程评级是根据个别学生的评级和各种其他信号(如评级年龄和可靠性)计算出来的，以确保它们公平和准确地反映课程质量。\n使用Docker和Docker Compose部署真实世界的Web应用程序，并使用此100%实践课程。\n4.8(5个评级)课程评级是根据个别学生的评级和各种其他信号(如评级年龄和可靠性)计算出来的，以确保它们公平和准确地反映课程质量。\n本课程将以一种简单易懂的方式向您传授使用Docker构建和部署您自己的应用程序所需的一切知识。本课程由视频、动手练习和场景组成，可以引导您朝着正确的方向前进，并帮助您通过自己动手来学习。\n讲座的重点是建立你的知识直觉，以便更容易地将这些知识转化为现实世界的解决方案。\n该课程深入探讨各种主题，如容器、图像、Dockerfile、卷、网络、坞站组合等，设计时考虑到Docker的实际应用程序，并由自己实施大规模Docker解决方案的个人设计。", "note_en": "4.8(6 ratings)  Course Ratings are calculated from individual students’ ratings and a variety of other signals, like age of rating and reliability, to ensure that they reflect course quality fairly and accurately.\n Use Docker and Docker compose to deploy real world web apps using this 100% hands-on course.\n 4.8(5 ratings)  Course Ratings are calculated from individual students’ ratings and a variety of other signals, like age of rating and reliability, to ensure that they reflect course quality fairly and accurately.\n This course teaches you everything you need to know to  build and deploy your own apps with Docker in a way that is simple to understand. The course consitutes of  videos, hands-on exercises and scenarios that guide you in the right direction and help you learn by doing things on your own.\n  Lectures are focused on building your knowledge intuitivley so that it&#39;s easier to transition this knowledge into real world solutions.\n  Course covers in-depth exploration of various topics like  containers, images, Dockerfile, volumes, networking, docker-compose and more and is designed keeping in mind  real world applications of Docker and by individuals who have themselves implemented  large scale Docker Solutions.", "posttime": "2020-05-21 22:59:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,动手,day,课程", "title": "一天中的Docker：通过动手示例从初学者到高级", "title_en": "Docker in a Day: Beginner to Advanced with Hands-On Examples", "transed": 1, "url": "https://www.udemy.com/course/how-to-docker/?couponCode=SAVEONDOCKER", "via": "", "real_tags": ["docker", "动手", "day", "课程"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，我在XDC做了一个关于各种当前和过去的输入栈开发的演讲(嗯，至少是其中的一个子集)。其中一张幻灯片指出了libinput的总线因素，我将利用这个博客让这一点更广为人知。\n如果你不知道公车因素是什么，维基百科将其定义为：公车因素是由于缺乏知识或能力的人员而不得不在项目停滞之前突然从项目中消失的最小团队成员数量。\nlibinput的总线因子为1。\n让我们随意选择1.9.0版本(大约在2年前)，看看数字：从1.9.0开始的1200次提交中，略低于990次是我完成的。在这两年中，我们总共有76个贡献者，但只有24个贡献者有一个以上的承诺，只有6个贡献者的承诺超过5个。即使我们一直回溯到2015年的1.0.0，这些数字也不会有太大变化。这些数字不包括非开发工作：新版本和单点版本的版本维护、检查CI故障[1]、编写文档(包括本博客上的内容)、测试和错误分类。现在，这一切实际上都是由一个人完成的。\n这是.。不太理想。在这一点上，libinput或多或少是我们拥有的唯一输入栈[2]，所有主要发行版都依赖于它。它可以驱动鼠标、触摸板、平板电脑、键盘、触摸屏、跟踪球等，所以基本上除了操纵杆之外什么都可以驱动。\n不管怎么说，我写这篇博文主要是希望有人有足够的动力投入其中。现在，如果你在libinput中获得50个补丁，你就会获得令人垂涎的倒数第二名的位置，以及由此带来的所有名气和财富(也就是说，几乎没有，但嘿，在流行文化中，失败者是很大的)。除此之外，任何帮助建立一个真正的社区也是值得感谢的。\n不管是哪种方式，以免有人说没有人预见到它的到来，让我们现在就敲响警钟，以免为时已晚。丁仃！", "note_en": "A few weeks back, I was at XDC and  gave a talk about various current and past input stack developments (well, a subset thereof anyway). One of the slides pointed out libinput&#39;s bus factor and I&#39;ll use this blog to make this a bit more widely known.\n If you don&#39;t know what the bus factor is,  Wikipedia defines it as: The &#34;bus factor&#34; is the minimum number of team members that have to suddenly disappear from a project before the project stalls due to lack of knowledgeable or competent personnel.\nlibinput has a bus factor of 1.\n Let&#39;s arbitrarily pick the 1.9.0 release (roughly 2 years ago) and look at the numbers: of the ~1200 commits since 1.9.0, just under 990 were done by me. In those 2 years we had 76 contributors in total, but only 24 of which have more than one commit and only 6 contributors have more than 5 commits. The numbers don&#39;t really change much even if we go all the way back to 1.0.0 in 2015. These numbers do not include the non-development work: release maintenance for new releases and point releases, reviewing CI failures [1], writing documentation (including the stuff on this blog), testing and bug triage. Right now, this is effectively all done by one person.\n This is... less than ideal. At this point libinput is more-or-less the only input stack we have [2] and all major distributions rely on it. It drives mice, touchpads, tablets, keyboards, touchscreens, trackballs, etc. so basically everything except joysticks.\n Anyway, I&#39;m largely writing this blog post in the hope that someone gets motivated enough to dive into this. Right now, if you get 50 patches into libinput you get the coveted second-from-the-top spot, with all the fame and fortune that entails (i.e. little to none, but hey, underdogs are big in popular culture). Short of that, any help with building an actual community would be appreciated too.\n Either way, lest it be said that no-one saw it coming, let&#39;s ring the alarm bells now before it&#39;s too late. Ding ding!", "posttime": "2020-05-21 22:58:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "总线,bus,因素", "title": "Libinput的总线因子为1", "title_en": "Libinput's bus factor is 1", "transed": 1, "url": "https://who-t.blogspot.com/2019/10/libinputs-bus-factor-is-1.html", "via": "", "real_tags": ["总线", "bus", "因素"]}, {"category": "", "categoryclass": "", "imagename": "6620cd5e4fdb05aa79d5b2ffa6146263.jpg", "infoid": 1003128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家在印度投资超过65亿美元的电商巨头今天在班加罗尔的部分地区推出了名为亚马逊食品(Amazon Food)的送餐服务。该公司原计划去年在印度推出这项服务，然后转移到3月份，但由于印度政府在3月下旬发布了全国范围内的居家命令，该公司进一步推动了这一计划。\n据TechCrunch在2月下旬报道，在推出之前，这家电商巨头今年早些时候开始与班加罗尔的精选餐厅合作伙伴和员工一起测试送餐服务。\n“一段时间以来，顾客一直告诉我们，除了购买所有其他必需品外，他们还想在亚马逊上订购准备好的饭菜。亚马逊的一位发言人告诉TechCrunch，“这一点在现在尤其重要，因为他们呆在家里很安全。”\n他说：“我们也认识到，本地企业需要他们所能得到的一切帮助。我们将在精选的班加罗尔密码中推出亚马逊食品，允许顾客从精选的当地餐厅和云厨房订购，这些餐厅和云厨房通过了我们的高卫生认证吧。我们坚持最高的安全标准，以确保我们的客户在获得愉快体验的同时保持安全。“。该公司没有透露计划多久将Food扩展到印度各地。\n亚马逊进军外卖市场可能会给Prosus Ventures支持的Swiggy和Zomato带来新的挑战，Zomato是一家成立11年的初创公司，今年1月收购了优步在印度的Eats业务，以及谷歌支持的Dunzo，后者在班加罗尔运营，将外卖视为其业务的最大部分之一。\nSwiggy和Zomato总共筹集了20多亿美元，但仍然没有盈利，每月损失超过1500万美元来获得新客户和维持现有客户。\n印度商号(India Quotient)的风险投资人阿南德·卢尼亚(Anand Lunia)今年早些时候表示，外卖公司别无选择，只能继续补贴他们平台上的食品成本，否则他们的大多数客户都买不起。\n找出一条盈利之路在印度尤其具有挑战性，因为与美国等发达市场不同，在美国，每件送货物品的价值约为33美元；据总部位于班加罗尔的研究公司RedSeer估计，在印度，类似物品的价格为4美元。\n最重要的是，已经在市场上建立了双寡头垄断地位的Zomato和Swiggy正面临着额外的挑战。\n在过去的一个月里，Swiggy已经解雇了2100多名员工，Zomato已经取消了公司约520个职位，因为在冠状病毒爆发期间，许多人对在线订餐变得谨慎起来。今天，这两家初创公司在各自的平台上收到的订单都不到100万份，低于今年早些时候各自处理的近300万份订单。\nSwiggy还缩减了云厨房业务和其他一些邻近业务。这家总部位于班加罗尔的初创公司今天开始在恰尔肯德邦的兰奇运送酒精。Zomato今天表示，从今天晚些时候开始，它还将在兰奇提供酒精送货服务。最近几周，这些初创公司也开始递送食品杂货。\n近年来，亚马逊在印度推出了亚马逊的Prime Now和Amazon Fresh平台，销售易腐烂食品和食品杂货，并在此过程中扩大了在印度多个地区的仓库。", "note_en": "The e-commerce giant, which has  invested more than $6.5 billion in India, today launched its food delivery service, called Amazon Food, in select parts of Bangalore. The company had originally planned to launch the service in India last year, which it then  moved to March but pushed it further amid the nationwide stay-at-home order the Indian government issued in late March.\n In the run up to the launch, the e-commerce giant began testing the food delivery service with select restaurant partners in Bangalore with employees earlier this year, TechCrunch reported in late February.\n   “Customers have been telling us for some time that they would like to order prepared meals on Amazon in addition to shopping for all other essentials. This is particularly relevant in present times as they stay home safe,” an Amazon spokesperson told TechCrunch.\n “We also recognize that local businesses need all the help they can get. We are launching Amazon Food in select Bangalore pin codes allowing customers to order from handpicked local restaurants and cloud kitchens that pass our high hygiene certification bar. We are adhering to the highest standards of safety to ensure our customers remain safe while having a delightful experience,” the spokesperson added. The company did not say how soon it plans to expand Food across India.\n Amazon’s foray into the food delivery market could create new challenges for  Prosus Ventures -backed Swiggy, and  Zomato,  a 11-year-old startup that  acquired Uber’s Eats business in India in January this year, and  Google-backed Dunzo, which operates in Bangalore and counts food delivery as one of the biggest parts of its business.\n Swiggy   and Zomato, having raised more than $2 billion together, are still not profitable and are losing more than $15 million each month to acquire new customers and sustain existing ones.\n Anand Lunia, a VC at India Quotient, said earlier this year that the food delivery firms have little choice but to keep subsidizing the cost of food items on their platform as otherwise most of their customers can’t afford them.\n Figuring out a path to profitability is especially challenging in India as unlike in the developed markets such as the U.S., where the value of each delivery item is about $33; in India, a similar item carries the price tag of $4, according to estimates by Bangalore-based research firm RedSeer.\n On top of that, Zomato and Swiggy that have established a duopoly in the market, are facing additional challenges.\n In the last one month, Swiggy has let go more than 2,100 employees and Zomato has eliminated  about 520 roles at the company as many people become cautious about ordering food online amid the coronavirus outbreak. Both the startups today are seeing fewer than 1 million orders on their respective platforms, down from nearly 3 million they were each processing earlier this year.\n Swiggy has additionally scaled down its cloud kitchen operations and some other adjacent businesses. The Bangalore-based startup today began delivering alcohol in Ranchi, a city in the state of Jharkhand. Zomato said today that it will also offer alcohol delivery in Ranchi starting later today. The startups have also started to deliver grocery items in recent weeks.\n Amazon has launched  Amazon’s Prime Now and Amazon Fresh platforms in India to sell perishables and grocery items in recent years and expanded its warehouses in several parts of the country along the way.", "posttime": "2020-05-21 22:36:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,推出,launches", "title": "亚马逊在印度推出送餐服务", "title_en": "Amazon Launches Food Delivery Service in India", "transed": 1, "url": "https://techcrunch.com/2020/05/21/amazon-launches-food-delivery-service-in-india/", "via": "", "real_tags": ["亚马逊", "amazon", "推出", "launches"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TI删除了Xavier在2020年5月20日，格林威治时间21：35发布的TI-83 Premium CE上汇编程序的访问权限。\n我们很遗憾地告诉大家，在今天发布的TI-83 Premium CE&amp；TI-83 Premium CE Edition Python(如此冗长的^^)最新OS 5.5.1版本中，TI完全删除了对汇编程序的访问权限。对未压缩的ASM程序的支持在OS5.3.1更早的版本中已经被移除，尽管这在当时并不是很重要，因为被压缩的ASM程序仍然完好无损。是的，TI已经追溯性地删除了一项广告功能，这是许多用户最喜欢的功能。\n这次大满贯结束了二十多年的黄金时代(！)。至少一个主动维护的TI图形计算器模型正式支持本机代码。由于可以通过巧尽心思构建的备份文件实现任意代码执行，本机代码的非官方可用性开始得稍早一些。数以千计的程序员已经发布了数千个程序(甚至更多)，其中许多发布的程序可以在ticalc.org档案中找到，因为ticalc.org从1996年就已经出现了，也就是说，在官方本机代码可用的整个时期，大约需要几个月的时间：)。\n据我们所知，德州仪器的这一举动并不是凭空而来的。导火索可能是一位老师在他广受欢迎的视频频道上发布了一段视频，内容是关于TI&#39；为TI-eZ80系列实施的PTT模式的早期版本中的一个长期修复的缺陷。修复是从2018年开始的，这段视频是在2020年发布的。此后不久，我们可以想象TI不得不屈服于一些管理标准化考试的人的压力(事实上，TI需要安抚的真正客户是他们，而不是最终用户)。不用说，删除用户对本机代码的访问与考试安全性几乎没有关系……。\n事实上，看看其他平台上一次又一次发生的事情，比如索尼PS3，我们可以自信地预测，这一举措将会恶化考试的安全性。从现在开始，法国的83 Premium CE，当然还有在不久的将来推出的国际84+CE版本，都将与Nspire平台处于相同的境地：一款集越狱、修复和更新越狱于一身的猫和老鼠游戏。Nspire系列和TI-eZ80系列都是不安全的平台，更多的用户可以不受限制地物理访问他们的计算器；更广泛地说，在撰写本文时，没有任何制造商生产任何安全的图形计算器型号，但是管理标准化考试的人并不知道，也不关心。\n像所有真正的计算器爱好者一样，我们对这件事有不好的感觉。社区一直对TI很好--在过去的20多年里，没有任何对TI的业务造成真正损害的东西被释放出来！--但是今天可能已经打破了一道道德屏障……。然而，生活中有太多更糟糕的事情，所以让我们关注未来吧。这是一个新时代的开始--当然是一个高度紧张的时代。现在，让我们向所有过去、现在和将来为TI图形计算器编写本机代码程序的程序员致以最热烈的感谢。接下来是一个仍在进行中的故事即将到来的新篇章：)。\n新闻愿望列表包含了一些TI-eZ80 ASM节目，即使没有未来的投票，我们也会在时间允许的情况下继续以节目为特色。", "note_en": "TI removes access to assembly programs on the TI-83 Premium CE   Posted by  Xavier on 20 May 2020, 21:35 GMT\n  We&#39;re sad to relay news about the fact that in the currently latest OS 5.5.1 version released today for the TI-83 Premium CE &amp; TI-83 Premium CE Edition Python (such a mouthful ^^), TI completely removed access to assembly programs... Support for unsquished ASM programs was already removed earlier in OS 5.3.1 onwards, though it didn&#39;t matter much at the time, because squished ASM programs remained unharmed. Yes, TI has retroactively removed an advertised feature, many a user&#39;s favorite feature at that.\n  This slam shuts a golden age of over two decades (!) of native code being  officially supported on at least one  actively maintained TI graphing calculator model. Unofficial availability of native code started a bit earlier, thanks to arbitrary code execution achievable through specially crafted backup files. Thousands of programmers have published thousands of programs (and produced even more), many of these published programs can be found in the ticalc.org archives, because ticalc.org has been around since 1996, i.e. for the entire period of official native code availability, give or take a few months time :)\n  As far as we can tell, TI did not make this move out of the blue. The trigger was probably a teacher posting, on his popular video channel, a video about a long-fixed flaw in an earlier version TI&#39;s implementation of PTT mode for the TI-eZ80 series. The fix is from 2018, the video was posted in 2020. Shortly thereafter, we can imagine that TI had to give in to pressure from some people who regulate standardized tests (as a matter of fact, they, not end users, are the real customers TI needs to appease). Needless to say, removing user access to native code has  extremely little to do with exam security...\n  In fact, looking at what happened time and again on other platforms, e.g. the Sony PS3, we can confidently predict that this move will  worsen exam security. From now on, the French 83 Premium CE, and certainly the international 84+ CE versions thereof in the near future, are in the same situation as the Nspire platform: a cat &amp; mouse game of jailbreaks, fixes, and newer jailbreaks. Both the Nspire series and the TI-eZ80 series are insecure platforms, all the more users have unrestricted physical access to their calculators; more generally, at the time of this writing, no manufacturer produces any secure graphing calculator model, but the people who regulate standardized tests don&#39;t know or don&#39;t care...\n  Like all true calculator enthusiasts, we have hard feelings about the matter. The community had always been nice to TI - nothing really damaging for TI&#39;s business was ever released over 20+ years! - but a moral barrier has probably been broken today... However, there are so many much worse things in life, so let&#39;s focus on the future instead. It&#39;s the beginning of a new era - certainly an era of heightened tension. For now, let&#39;s only send our warmest thanks to all past, present and future programmers of native code programs for TI graphing calculators... and on to the new, upcoming chapters of a still ongoing story :)\n  The news wishlist contains a number of TI-eZ80 ASM programs, among other things; even without future POTY votes, we&#39;ll keep featuring programs as time permits.", "posttime": "2020-05-21 22:35:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,编程,汇编,ce,ti", "title": "TI取消了对TI-83 Premium CE上汇编程序的访问", "title_en": "TI removes access to assembly programs on the TI-83 Premium CE", "transed": 1, "url": "https://www.ticalc.org/archives/news/articles/14/149/149342.html", "via": "", "real_tags": ["程序", "编程", "汇编", "ce", "ti"]}, {"category": "", "categoryclass": "", "imagename": "9c57e1cd5c797eddaa0d9ddca7a5dd3b.png", "infoid": 1003125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "de274c3更新电子实用程序1f789ec更新到Electron 9并启用e2ee d2f4928添加随机房间名称生成a1a52c4重构化身9b84fe5运行NPM审核修复程序78f3b24在设置ee99029修复欢迎表单占位符a085681中添加超时配置添加有关调试器cf7f2da的说明添加对URL查询参数e7deabb的支持自述文件1fb中修复打字错误。\n此更新附带一些警告：Windows和MacOS版本未签名，因此自动更新可能不起作用。\n第一次安装时会出现一条警告，提示该应用程序未签名。这是意料之中的。\n在MacOS Catalina上，首次安装时将显示警告。除非按下&#34；打开&#34；，否则应用程序无法打开。此对话框仅显示一次。\n有一个已知问题会阻止应用程序在某些Linux发行版上启动：#231", "note_en": "de274c3 Update electron-utils   1f789ec Update to Electron 9 and enable E2EE   d2f4928 Add randdom room name generation   a1a52c4 Refactor avatar   9b84fe5 Run npm audit fix   78f3b24 Add timeout configuration in settings   ee99029 Fix Welcome form placeholder   a085681 Add note about debugger   cf7f2da Add support for URL query parameters   e7deabb Fix typos in README   1f2889e macOS Catalina Camera/Mirophone Access Request fixed   2212eaf macOS Catalina Fix for Camera/Microphone   238e28a Fix shortcuts on macOS   e860605 chore(package.json): Update utils   1c229b9 Fix typo in onboarding boxes\n  This update comes with some caveats: the Windows and macOS releases are unsigned, so auto-update may not work.\n  A warning will show up mentioning the app is unsigned upon first install. This is expected.\n  On macOS Catalina a warning will be displayed on first install. The app won&#39;t open unless &#34;open&#34; is pressed. This dialog is only shown once.\n   There is a known issue which prevents the app from starting on some Linux distributions:  #231", "posttime": "2020-05-21 22:33:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "meet,修复", "title": "JITSI Meet Electron 2.1-采用端到端加密", "title_en": "Jitsi Meet Electron 2.1 – With End-to-End Encryption", "transed": 1, "url": "https://github.com/jitsi/jitsi-meet-electron/releases/tag/v2.1.0", "via": "", "real_tags": ["meet", "修复"]}, {"category": "", "categoryclass": "", "imagename": "4630ba1381fbc548eea8f92e6000744a.jpg", "infoid": 1003124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该计划是在拉吉夫·甘地逝世周年纪念日推出的。Chhattisgarh CM Bhupesh Baghel说，Nyay Yojana将使19万农民受益，并有助于扩大种植面积。\n国大党主席索尼娅·甘地(Sonia Gandhi)周四(5月21日)在恰蒂斯加尔邦启动了拉吉夫·甘地·基桑奈(Rajiv Gandhi Kisan Nyay)计划，这一天是这位前总理的逝世纪念日，他说这是对他“真正的敬意”。\n甘地通过视频会议向发布会发表讲话时表示：“这样的计划应该在基层实施，以帮助改变人们的生活。这是一个革命性的计划，是对拉吉夫·甘地的真正致敬。这是与拉吉夫·甘地的价值观相一致的一大步。\n恰蒂斯加尔邦首席部长Bhupesh Baghel说，Rajiv Gandhi Kisan Nyay Yojana将使19万农民受益，并帮助扩大种植面积。他说，该计划的目的是帮助农民赚取更多收入，并使该州的种植面积更大，目前该州的种植面积为20%。\nछत्तीसगढ़सरकारद्वाराप्रारंभकीगईदेशमेअपनीतरहकीपहलीयोजनाराजीवगांधीकिसानन्याययोजनाकेतहतधान。मक्काऔरगन्ना(रबी)उत्पादककिसानोंकेखातेमेंलगभग5700型करोड़रूपएकीराशिकिसानोंकोखेतीकिसानीकेलिएप्रोत्साहितकरने，उन्हेंउपजकासहीदामदिलानेकेउद्देश्य..。\n根据CMO Chhattisgarh的一条推文，根据该计划，拉比季节的稻谷、玉米和甘蔗农民将分四期在他们的银行账户中获得5700卢比的核心资金。周四，通过直接利益转移(DBT)向农民发放了第一批1500卢比。\nकांग्रेसअध्यक्षामाननीयसोनियागांधीजीएवंमाननीयराहुलगांधीजीआजकरेंगे“राजीवगांधीकिसानन्याययोजना”काशुभारंभpic.twitter.com/Gs1a4vbueX。\n通过Rajiv Gandhi Kisan Nyay Yojana，已经采取措施向恰蒂斯加尔邦的农民提供所有必要的资源，鼓励作物生产，并将资金直接汇到他们的银行账户。计划将无地部落农业劳工纳入该计划的第二阶段。这是一个非常独特的决定，将使他们全部自给自足。“索尼娅·甘地说。\n前国大党主席拉胡尔·甘地(Rahul Gandhi)也赞扬了恰蒂斯加尔邦政府在穷人和农民因冠状病毒爆发和为遏制疾病传播而实施的封锁而面临困难的时候推出了这一计划。", "note_en": "The scheme was launched on Rajiv Gandhi&#39;s death anniversary. Chhattisgarh CM Bhupesh Baghel said the Nyay Yojana will benefit 19 lakh farmers and help bring more area under cultivation.\n  Congress president  Sonia Gandhi launched the  Rajiv Gandhi Kisan Nyay scheme in Chhattisgarh on Thursday (May 21), the death anniversary of the former prime minister, and said this was a ‘true tribute’ to him.\n Addressing the launch event through video-conferencing, Gandhi said: “Such schemes should be implemented at the ground level to help bring a change in the lives of people. This is a revolutionary scheme and is a true tribute to Rajiv Gandhi. This is a big step taken in lines with the values of Rajiv Gandhi.\n Chhattisgarh Chief Minister Bhupesh Baghel said the Rajiv Gandhi Kisan Nyay Yojana will benefit 19 lakh farmers and help bring more area under cultivation. He said the aim of the scheme is to help farmers earn more and bring more area in the state under cultivation, which currently stands at 20 per cent.\n छत्तीसगढ़ सरकार द्वारा प्रारंभ की गई देश मे अपनी तरह की पहली योजना राजीव गांधी किसान न्याय योजना के तहत धान, मक्का और गन्ना (रबी) उत्पादक किसानों के खाते में लगभग 5700 करोड़ रूपए की राशि किसानों को खेती किसानी के लिए प्रोत्साहित करने, उन्हें उपज का सही दाम दिलाने के उद्देश्य..\n According to a tweet by CMO Chhattisgarh, under the scheme, paddy, maize and sugarcane farmers in the rabbi season will get Rs 5,700 core in their bank accounts, in four instalments. On Thursday, the first instalment of Rs 1,500 crore was given to the farmers through Direct Benefit Transfer (DBT).\n   कांग्रेस अध्यक्षा माननीय सोनिया गांधी जी एवं माननीय राहुल गांधी जी आज करेंगे “राजीव गांधी किसान न्याय योजना” का शुभारंभ  pic.twitter.com/Gs1a4vbueX\n “Through the Rajiv Gandhi Kisan NYAY Yojana, steps have been taken to provide all requisite resources to the farmers of Chhattisgarh, encourage crop production and send funds directly to their bank accounts. There is a plan to include landless tribal agricultural labourers in the second phase of this scheme. This is a very unique decision which will make them all self-sufficient,” said Sonia Gandhi.\n Former Congress president Rahul Gandhi also lauded the Chhattisgarh government for launching the scheme at a time when the poor and farmers were facing hardships due to the  coronavirus outbreak and the lockdown imposed to contain the spread of the disease.", "posttime": "2020-05-21 22:12:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "农民,state,计划", "title": "印度邦宣布农民基本收入：每英亩每年170美元", "title_en": "Indian state announces basic income for farmers: $170 per acre per year", "transed": 1, "url": "https://indianexpress.com/article/india/chhattisgarh-sonia-gandhi-launches-rajiv-gandhi-kisan-nyay-scheme-6421246/", "via": "", "real_tags": ["农民", "state", "计划"]}, {"category": "", "categoryclass": "", "imagename": "d097a84f570b551bde601eea0e85e74f.jpg", "infoid": 1003123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "订阅我的主频道-http://Timcast.net支持我的工作-https://www.timcast.com/donate https://www.youtube.com/watch?v=5xUNON8kztI从.", "note_en": "SUBSCRIBE TO MY MAIN CHANNEL - http://Timcast.net Support My Work - https://www.timcast.com/donate https://www.youtube.com/watch?v=5xUNON8kztI Buy stuff from...", "posttime": "2020-05-21 22:12:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "collapsing,https", "title": "Reddit正在崩溃，超级用户暴露", "title_en": "Reddit Is Collapsing, Power Users Exposed", "transed": 1, "url": "https://www.youtube.com/watch?v=a3nafnWsgH0", "via": "", "real_tags": ["https"]}, {"category": "", "categoryclass": "", "imagename": "67157d17897facce37bc4d25f6776b87.png", "infoid": 1003120, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此次发布的notqmail遵循两个主题：修复错误和降低错误可能性。\nqmail-pop3d：如果root进行了身份验证，则不是以root身份运行(并且是对root密码进行字典攻击的载体)，而是退出1，使其看起来就像失败的检查密码登录一样。(#92)。\n删除不能正确支持CNAME的旧DNS服务器的解决方法。乔纳森·德·博因·波拉德(Jonathan De Boyne Pollard)制作的补丁在网上漂浮多年。(#97)。\n使用系统头而不是重新声明exit()、read()、write()、malloc()、free()、fork()、uint32_t。(#79，#80，#81，#82，#101，#30)。\n在开发此版本的过程中，我们发现了我们打算在下一个版本中删除的程序。我们认为，所有这些都不是必要的，也不是足够有用的，不值得花费维护费用。如果您不同意，请告诉我们！\n删除qmail-pop3d，因为活跃维护的POP3服务器(例如Courier IMAP或Dovecot)很好地支持Maildir。\n我们感谢Qualys的发现、协作方法以及削减新版本的动力。", "note_en": "This release of notqmail is guided by two themes:  fix bugs and  reduce bug likelihood.\n  qmail-pop3d: instead of running as root if root authenticates (and being a vector for a dictionary attack on the root password), exit 1 to look just like a failed  checkpassword login. ( #92)\n   Remove workaround for ancient DNS servers that do not properly support CNAME.  Patch by Jonathan de Boyne Pollard that was floating around the net for years. ( #97)\n  Use system headers instead of redeclaring  exit(),  read(),  write(),  malloc(),  free(),  fork(),  uint32_t. ( #79,  #80,  #81,  #82,  #101,  #30)\n    In the course of developing this release, we found programs that we intend to remove in the next release. We believe none of these remains necessary or useful enough to be worth the cost of maintaining. If you disagree, please let us know!\n Remove  qmail-pop3d, since Maildir is well supported by actively maintained POP3 servers (e.g.,  Courier IMAP or  Dovecot).\n  We thank Qualys for their findings, collaborative approach, and impetus to cut a new release.", "posttime": "2020-05-21 21:47:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "notqmail,版本", "title": "Notqmail 1.08·notqmail/notqmail维基", "title_en": "Notqmail 1.08 · notqmail/notqmail Wiki", "transed": 1, "url": "https://github.com/notqmail/notqmail/wiki/notqmail-1.08", "via": "", "real_tags": ["notqmail", "版本"]}]