[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对机械键盘的一个常见抱怨是它们&#39；你很贵，尤其是如果你更喜欢一个知名品牌的话。但罗技通过其新的G413 SE挑战这一点，该公司是#39；这是最便宜的机械键盘。售价80美元，几乎不属于预算范畴，还有&#39；这也是一个70美元的无钥匙版本。\n罗技带来了一种高质量、稍微不同寻常的打字体验。G413 SE和#39；微软的保守设计也将赢得那些感觉机械键盘，尤其是游戏设备，变得过于浮华的用户。\n尽管以高价著称，但如今80美元的机械键盘仍能提供很多。但是如果你&#39；重新比较一下廉价机械键盘的功能集，G413 SE的成本比它应该的要高。\n我不&#39；我不知道为什么罗技将G413 SE归类为游戏键盘，而不仅仅是通用键盘。该设备缺乏该公司令人印象深刻的功能集#39；还有其他的游戏。即使是非SE G413也提供了更多，而在编写时，其成本也降低了10-20美元。\nG413 SE没有&#39；t与罗技科技合作&#39；s G Hub软件。因此，与非SE版本不同，非SE版本允许编程F1-F12键，包括使用宏&#39；它完全没有可编程性。\n此外，2017年推出的非SE G413具有USB直通端口和电缆管理功能，用于游戏鼠标和耳机。它带有一个红色（而不是白色）背光选项，并声称支持26键翻转，与我们的评论主题#39；s 6键翻滚。它甚至还配有额外的键帽和键帽拉拔器。\n我们没有&#39；t测试了非SE G413，它有不同于SE的触觉机械开关（罗技和罗默G触觉），并使用ABS塑料键帽。G413 SE和#39；与非SE相比，PBT塑料的碰撞似乎是唯一明显的改进，尽管随着升级，它&#39；It’没什么可打喷嚏的。这有助于G413 SE&#39；s的打字经验非常突出，但是任何一款价格更高的键盘特别版都应该比标准版有更多的好处。\n一些机械键盘将醒目、复古或大胆的配色方案与按键、底盘甚至手腕上的华而不实的彩色灯光结合在一起。G413 SE似乎采取了不同的策略：它没有&#39；我不想被人看见。事实上，在你打开它的白色背光之前，很难看到它黑色键帽上的黑色图例。\n那些在微妙中发现美的用户，或者想要一个光滑的黑色外观来完成他们的设置的用户，可以欣赏G413 SE。但再加上缺乏独特的功能，这种整体设计可以最好地描述为&#34；很简单&#34;\n键盘&#39；它最耀眼的一面是它的白色背光。自从钥匙帽&#39；从我的坐姿上看，传说难以辨认，我总是需要背光。G413 SE和#39；s明亮的LED没有RGB，但它们通过黑暗的键帽发光，同时在键帽之间产生辉光&#39；它可以从自顶向下的视图中看到。\n此背光比基本背光高一步。它有五种效果：一种效果是灯光淡入淡出；在另一种情况下，按键按下后会比其他按键亮一秒钟。分别按Fn和F12以及F1和F2可控制效果和亮度（三级，加上off）。不过，将所有照明控制装置放在一起会更直观。\n底部底盘由无灵魂的轻质塑料制成，表面略微光滑。同时，铝制顶板带来了更多的想象力。排名前39位；s精致的拉丝表面赋予键盘更多质感和重量，偶尔还会出现指纹污迹。\n又一次为SE&#39；成本低吗？有线电视。它&#39；它是一个普通的橡胶部件，在与键盘连接的地方没有强制力（尽管它的连接器相当粗）。不过，廉价键盘通常感觉更便宜，而且制作质量也很差，G413 SE&#39；s的两年保修期比一些更昂贵的竞争对手更长。", "note_en": "A common complaint about mechanical keyboards is that they&#39;re expensive, especially if you prefer an established brand. But Logitech challenges that with  its new G413 SE, which is one of the company&#39;s least expensive mechanical keyboards. At $80, it barely squeaks into the budget category, and there&#39;s also a  $70 tenkeyless version.\n Logitech comes through with a quality, mildly unusual typing experience. The G413 SE&#39;s conservative design will also win over users who feel mechanical keyboards, especially gaming devices, have become too flashy.\n Despite a reputation for high prices, $80 mechanical keyboards can still offer a lot these days. But if you&#39;re comparing feature sets among budget mechanical keyboards, the G413 SE costs more than it should.\n  I don&#39;t know why Logitech categorizes the G413 SE as a gaming keyboard instead of just a keyboard for general use. The device lacks the impressive feature sets of the company&#39;s other gaming clackers. Even the  non-SE G413 offers more while costing  $10-$20 less as of writing.\n The G413 SE doesn&#39;t work with Logitech&#39;s G Hub software. So, unlike the non-SE version—which lets you program the F1-F12 keys, including with macros—there&#39;s no programmability at all.\n Additionally, the non-SE G413 from 2017 has a USB passthrough port and cable management meant for gaming mice and headphones. It comes with a red (instead of white) backlight option and claims to support 26-key rollover, which lets the keyboard register 26 simultaneous key presses, compared to our review subject&#39;s 6-key rollover. It even comes with extra keycaps and a keycap puller.\n We haven&#39;t tested the non-SE G413, which has different tactile mechanical switches (Logitech&#39;s Romer G Tactile) from the SE and uses ABS plastic keycaps. The G413 SE&#39;s bump to PBT plastic seems to be the only obvious improvement over the non-SE, although, as upgrades go, it&#39;s nothing to sneeze at. That helps the G413 SE&#39;s typing experience stand out, but the pricier special edition of any keyboard really ought to come with a greater number of benefits over the standard edition.\n     Some mechanical keyboards combine striking, retro, or daring color schemes with flashy, colorful lights in the keys, chassis, or even wrist rest. The G413 SE seems to take a different tack: it doesn&#39;t want to be seen. In fact, before you turn on its white backlight, the dark legends on its black keycaps are hard to see.\n  Users who find beauty in subtlety or who want a sleek, black look to complete their setup can appreciate the G413 SE. But combined with a lack of unique features, this overall design can best be described as &#34;plain.&#34;\n The keyboard&#39;s flashiest aspect is its white backlight. Since the keycaps&#39; legends were illegible from my seated position, I always needed the backlight. The G413 SE&#39;s bright LEDs are no RGB, but they shine through the dark keycaps while creating a glow between the keycaps that&#39;s visible from a top-down view.\n  This backlight is a step above basic. It has five effects: in one effect, the lighting fades in and out; in another, keys illuminate brighter than the rest for a second after pressed. Controls for effects as well as brightness (three levels, plus off) are reached by pressing Fn and F12 and F1 and F2, respectively. Putting all the lighting controls next to each other would be more intuitive, though.\n Soulless, lightweight plastic with a mildly glossy finish makes up the bottom chassis. Meanwhile, the aluminum top plate brings more imagination. The top&#39;s subtle brushed finish gives the keyboard more texture and weight—and the occasional fingerprint smudge.\n  Another sacrifice made for the SE&#39;s low cost? The cable. It&#39;s a plain rubber thing with no enforcement where it connects to the keyboard (although its connector is rather chunky). Budget keyboards often feel cheaper and poorly made, though, and the G413 SE&#39;s two-year warranty is longer than some more expensive rivals.", "posttime": "2022-02-25 14:22:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "键盘,g413,se", "title": "罗技G413 SE机械键盘评论：价格合理，但不够便宜", "title_en": "Logitech G413 SE mechanical keyboard review: Affordable, but not cheap enough", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/logitech-g413-se-mechanical-keyboard-review-affordable-but-not-cheap-enough/", "via": "", "real_tags": ["键盘", "g413", "se"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄罗斯最精英、最厚颜无耻的间谍机构之一的黑客已经用一种以前看不见的恶意软件感染了世界各地的家庭和小型办公室网络设备，该软件将这些设备变成了攻击平台，可以窃取机密数据并攻击其他网络。\nCyclops Blink被称为高级恶意软件，该公司周三表示，它已经感染了网络设备制造商WatchGuard生产的约1%的网络防火墙设备。该恶意软件能够滥用在受感染设备中发现的合法固件更新机制，使其具有持久性，这意味着该恶意软件能够在重新启动后存活。\nCyclops Blink已经传播了近三年，它取代了VPNFilter。2018年，研究人员发现该恶意软件感染了约50万个家庭和小型办公室路由器。VPNFilter包含一把名副其实的瑞士军刀，黑客可以通过它窃取或操纵流量，并监控工业控制系统使用的一些SCADA协议。美国司法部将黑客攻击与俄罗斯联邦武装部队总参谋部的主要情报局（通常简称GRU）联系起来。随着VPNFilter的暴露，沙虫黑客构建了一个新的恶意软件来感染网络设备。和它的前身一样，Cyclops Blink拥有专业开发的固件的所有特征，但它也有一些新的技巧，使其更隐蔽，更难移除。\n英国国家网络安全中心（National Cyber Security Center）的官员在一份咨询报告中写道：“该恶意软件本身非常复杂、模块化，具有基本的核心功能，可以将设备信息发送回服务器，并允许下载和执行文件。”。“在恶意软件运行时，还有添加新模块的功能，这使Sandworm能够根据需要实现附加功能。”\n该公告称，到目前为止，Sandworm“主要”使用该恶意软件从WatchGuard感染网络设备，但黑客可能也能将其编译为在其他平台上运行。恶意软件通过滥用设备用于接收固件更新的合法进程，在WatchGuard设备上获得持久性。\n恶意软件首先复制存储在设备上的固件映像，然后修改它们以包含恶意功能。Cyclops Blink然后操纵一个HMAC值，用于以加密方式证明图像是合法的，以便设备运行它。过程如下所示：\n该恶意软件包含一个用于C2通信的硬编码RSA公钥，以及一个硬编码RSA私钥和X.509证书。但在英国官员分析的样本中，它们似乎没有被积极使用，这使得它们有可能被单独的模块使用。\nCyclops Blink使用OpenSSL加密库对TLS提供的加密下的通信进行加密。\n每次恶意软件信标出现时，它都会从当前C2服务器IPv4地址列表和C2端口硬编码列表中随机选择一个目标。信标由包含运行模块数据的排队消息组成。每条消息都使用AES-256-CBC单独加密。OpenSSL_EVP_SealInit函数用于为每条消息随机生成加密密钥和IV，然后使用硬编码RSA公钥对其进行加密。OpenSSL_RSA_public_decrypt函数用于使用硬编码RSA公钥对响应信标的任务进行解密。\n其他新的秘密措施包括使用Tor隐私网络隐藏恶意软件使用的IP地址。英国官员写道：\n受害设备被组织成集群，Cyclops Blink的每个部署都有一个命令和控制（C2）IP地址及其使用的端口列表（T1008）。到目前为止，所有已知的C2 IP地址都已被受损的WatchGuard防火墙设备使用。Cyclops Blink客户端和服务器之间的通信受传输层安全（TLS）（T1071.001）保护，使用单独生成的密钥和证书。Sandworm通过Tor网络连接到C2层来管理独眼巨人眨眼：", "note_en": "Hackers for one of Russia’s most elite and brazen spy agencies have infected home and small-office network devices around the world with a previously unseen malware that turns the devices into attack platforms that can steal confidential data and target other networks.\n Cyclops Blink, as the advanced malware has been dubbed, has infected about 1 percent of network firewall devices made by network device manufacturer WatchGuard, the company  said on Wednesday. The malware is able to abuse a legitimate firmware update mechanism found in infected devices in a way that gives it persistence, meaning the malware survives reboots.\n   Cyclops Blink has been circulating for almost three years and replaces  VPNFilter, the malware that in 2018 researchers found infecting about 500,000 home and small office routers. VPNFilter contained a veritable Swiss Army knife that allowed hackers to steal or manipulate traffic and to monitor some SCADA protocols used by industrial control systems. The US Department of Justice  linked the hacks to the Main Intelligence Directorate of the General Staff of the Armed Forces of the Russian Federation, typically abbreviated as the GRU. With VPNFilter exposed, Sandworm hackers built a new malware for infecting network devices. Like its predecessor, Cyclops Blink has all the trappings of professionally developed firmware, but it also has new tricks that make it stealthier and harder to remove.\n “The malware itself is sophisticated and modular with basic core functionality to beacon device information back to a server and enable files to be downloaded and executed,” officials with the UK’s National Cyber Security Center wrote in an  advisory. “There is also functionality to add new modules while the malware is running, which allows Sandworm to implement additional capability as required.”\n  So far, the advisory stated, Sandworm has “primarily” used the malware to infect network devices from WatchGuard, but the hackers are likely able to compile it to run on other platforms as well. The malware gains persistence on WatchGuard devices by abusing the legitimate process the devices use to receive firmware updates.\n    The malware starts by copying firmware images stored on the device and modifying them to include malicious functionality. Cyclops Blink then manipulates an HMAC value used to cryptographically prove the image is legitimate so devices will run it. The process looks like this:\n  The malware contains a hard-coded RSA public key, which is used for C2 communications, as well as a hard-coded RSA private key and X.509 certificate. But they don’t appear to be actively used within the samples analyzed by the UK officials, making it possible that they’re intended to be used by a separate module.\n Cyclops Blink uses the OpenSSL cryptography library to encrypt communications underneath encryption provided by TLS.\n  Each time the malware beacons it randomly selects a destination from the current list of C2 server IPv4 addresses and hard-coded list of C2 ports. Beacons consist of queued messages containing data from running modules. Each message is individually encrypted using AES-256-CBC. The OpenSSL_EVP_SealInit function is used to randomly generate the encryption key and IV for each message, and then encrypt them using the hard-coded RSA public key. The OpenSSL_RSA_public_decrypt function is used to decrypt tasking, received in response to beacons, using the hard-coded RSA public key.\n Other new measures for stealth include use of the Tor privacy network to conceal the IP addresses used by the malware. UK officials wrote:\n Victim devices are organised into clusters and each deployment of Cyclops Blink has a list of command and control (C2) IP addresses and ports that it uses (T1008). All the known C2 IP addresses to date have been used by compromised WatchGuard firewall devices. Communications between Cyclops Blink clients and servers are protected under Transport Layer Security (TLS) (T1071.001), using individually generated keys and certificates. Sandworm manages Cyclops Blink by connecting to the C2 layer through the Tor network:", "posttime": "2022-02-25 14:13:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,黑客,俄罗斯,网络,cutthroat", "title": "俄罗斯最残酷的黑客用新的僵尸网络恶意软件感染网络设备", "title_en": "Russia’s most cutthroat hackers infect network devices with new botnet malware", "transed": 1, "url": "https://arstechnica.com/information-technology/2022/02/russias-most-cut-throat-hackers-infect-network-devices-with-new-botnet-malware/", "via": "", "real_tags": ["软件", "黑客", "俄罗斯", "网络", "cutthroat"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从特斯拉在2019年首次推出了带有杯头港的车内游戏以来，其&#34；特斯拉商场&#34；这个平台已经慢慢发展到只包含不到20个游戏。不过，现在特斯拉首席执行官埃隆·马斯克表示有兴趣扩大与特斯拉兼容的游戏列表，将Steam游戏平台上的数万种游戏包括在内。在真正的马斯克风格中，这些计划的非正式宣布是通过一条推文发布的，推文中的帖子表达了对CD Projekt Red&#39；s Cyberpunk 2077（一款之前在s型方格格的信息娱乐系统上运行的游戏）&#34;我们正在研究让Steam游戏在特斯拉vs特定游戏中发挥作用的一般案例，&#34；马斯克写道&#34;前者显然是我们应该长期坚持的方向&#34;\n一辆汽车&#39；对于Steam上的许多高端游戏来说，s的信息娱乐中心似乎是一个奇怪的选择。但特斯拉汽车长期以来一直在其媒体控制单元（用于信息娱乐控制台）和用于驱动汽车的电子控制单元的核心位置使用高端图形卡；自动驾驶仪自动驾驶系统。\n在去年6月的Computex大会上（据Verge报道），AMD首席执行官Lisa Su表示，公司正在与特斯拉合作，提供Ryzen APU和&#34；一种基于RDNA2的离散GPU，在运行AAA游戏时启动，提供高达10万亿次的计算能力&#34; 这将使系统与像PlayStation 5这样的现代控制台大致相称，尽管其中的10个TopFaLoP中的一些可以在其他组件（如ECU）中拆分，可以和39。不要被用来玩游戏。\n苏补充说&#34；我们期待着为玩家提供一个AAA级游戏的绝佳平台；根据马斯克&#39；s关于蒸汽的推特。特斯拉自动驾驶仪（Tesla Autopilot）分析师丹·詹姆斯（Dan James）也在5月份发推文称，有机会&#34；Linux游戏开发者将在特斯拉开发一些非常激动人心的东西&#34; 从字里行间可以看出，这也可以作为与Steam和质子动力Steam游戏系统集成的参考，该系统允许基于Windows的游戏在Steam Deck（和特斯拉汽车）等Linux平台上运行。\n虽然能够将蒸汽库导入汽车是一个不错的功能，但马斯克在做出承诺方面享有一定的声誉，而这些承诺不会&#39；我没能按计划完成。无论如何，唐&#39；当你的特斯拉（Tesla）在运行时，不要指望能玩任何Steam游戏；在一年多前为特斯拉街机游戏添加了该功能后，该公司在开始正式的NHTSA安全调查后再次关闭了该功能。", "note_en": "Since Tesla first introduced in-car gaming with  a 2019 port of  Cuphead, the list of games available on its &#34;Tesla Arcade&#34; platform has  slowly grown to include just under 20 games. Now, though, Tesla CEO Elon Musk has expressed interest in expanding that list of Tesla-compatible games to include the tens of thousands of titles available on the Steam gaming platform. In true Musk style, the informal announcement of those plans came via  a thrown-off tweet in a thread expressing admiration for CD Projekt Red&#39;s   Cyberpunk 2077 (a game that has  previously been demoed running on the infotainment system for the Model S Plaid). &#34;We’re working through the general case of making Steam games work on a Tesla vs specific titles,&#34; Musk wrote. &#34;Former is obviously where we should be long-term.&#34;\n A car&#39;s infotainment center may seem like an odd fit for many of the high-end games available on Steam. But Tesla cars  have long sported high-end graphics cards at the heart of both their Media Control Units (for the infotainment console) and the Electronic Control Units used to power the cars&#39; autopilot self-driving systems.\n    At the Computex conference last June (as  reported by The Verge), AMD CEO Lisa Su said the company was working with Tesla to provide Ryzen APUs and &#34;a discrete RDNA2-based GPU that kicks in when running AAA games, providing up to 10 teraflops of compute power.&#34; That would put the system roughly on par with a modern console like the PlayStation 5, though some of that 10 teraflops may be split among other components (like the ECU) that can&#39;t be used for gaming.\n Su added that &#34;we look forward to giving gamers a great platform for AAA gaming,&#34; a statement that takes on new meaning in light of Musk&#39;s tweet about Steam. Tesla Autopilot Analyst Dan James also  tweeted back in May about an opportunity for &#34;Linux game devs to work on something *extremely* exciting at Tesla!&#34; Reading between the lines a bit, that could also be a reference to plans for integration with Steam and  the Proton-powered Steam Play system that lets Windows-based games run on Linux platforms  such as the Steam Deck (and Tesla cars).\n  While the ability to import your Steam library to your car would be a neat feature, Musk has  something of a reputation for making promises that don&#39;t quite pan out as planned. In any case, don&#39;t expect to be able to play any Steam games while your Tesla is in motion; after  adding that capability for Tesla Arcade games over a year ago, the company  turned it off again following the start of a formal NHTSA safety investigation.", "posttime": "2022-02-25 14:04:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,特斯拉,娱乐中心,install", "title": "马斯克说他想在特斯拉的信息娱乐中心安装Steam游戏", "title_en": "Musk says he wants to install Steam games in Tesla infotainment centers", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/musk-says-he-wants-to-install-steam-games-in-tesla-infotainment-centers/", "via": "", "real_tags": ["游戏", "特斯拉", "娱乐中心", "install"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Siri已经有四种美国口音的英语语音，但苹果将在iOS 15.4中增加第五种。据Axios报道，新的voice旨在首次提供性别中立的选择。\n声音的标签是&#34；声音5和34；在当前测试版的设置面板中，开发者史蒂夫·莫斯在Twitter上指出，该声音名为&#34；奎因和#34；在引擎盖下面。苹果向Axios确认，该语音是由LGBTQ+社区的一名成员录制的。Moser还发了一个新声音的例子：\niOS 15.4 Beta 4的变化🧵: 苹果增加了第五个美国Siri语音，文件名为“Quinn”图片。啁啾com/HFQZV1oF0I\n-史蒂夫·莫斯（@SteveMoser）2022年2月22日\n自从Siri在2011年首次成为iPhone的核心功能以来，大部分时间里，女性声音都是默认的。去年，苹果改变了iPhone的设置，提示用户在首次启动iPhone时选择男性或女性声音，但没有选择默认选项，这一点发生了改变。\n苹果向Axios发送了以下关于iOS 15.4测试版新增语音的声明：\n我们&#39；我们很高兴为说英语的人推出一种新的Siri语音，为用户提供更多选择与他们说话的语音的选项。全世界数以百万计的人每天都依赖Siri来帮助完成任务，因此我们努力让体验尽可能个性化。\n去年，苹果还增加了第三个和第四个美英Siri语音，即代表非裔美国人的女性和男性语音。\n除了这五种美国英语语音，苹果还提供多种其他语言的Siri语音，包括粤语、普通话、丹麦语、荷兰语、芬兰语、法语、德语、希伯来语、意大利语、日语、韩语、马来语、挪威语、葡萄牙语、俄语、西班牙语、瑞典语、泰语和土耳其语。这些语言中也有一些地区或口音变体，如智利语、墨西哥语、西班牙语和西班牙语的美国变体。即将发布的iOS 15.4的其他变化包括戴口罩时使用人脸识别码、双sim 5G支持、设置首选音乐流服务等。", "note_en": "There are already four American-accented English voices for Siri, but Apple will add a fifth in iOS 15.4. The new voice aims to provide a gender-neutral option for the first time, as  reported by Axios.\n The voice is labeled &#34;Voice 5&#34; in the Settings panel in the current beta release, though developer Steve Moser  noted on Twitter that the voice is named &#34;Quinn&#34; under the hood. Apple confirmed to Axios that the voice is built from recordings by a member of the LGBTQ+ community. Moser also tweeted an example of what the new voice sounds like:\n iOS 15.4 Beta 4 changes 🧵: Apple adds a 5th American Siri voice with filename ‘Quinn’  pic.twitter.com/HFQZV1oF0I\n— Steve Moser (@SteveMoser)  February 22, 2022\n For most of the time since Siri first became a core iPhone feature back in 2011, a female voice was the default. That changed last year when Apple changed the iPhone setup to prompt the user to pick a male or female voice when first starting the iPhone, with no default choice selected.\n    Apple sent the following statement to Axios about the new voice added in the iOS 15.4 beta:\n We&#39;re excited to introduce a new Siri voice for English speakers, giving users more options to choose a voice that speaks to them. Millions of people around the world rely on Siri every day to help get things done, so we work to make the experience feel as personalized as possible.\n Apple also added the third and fourth US English Siri voices last year—female and male voices meant to represent the speech of African Americans.\n  In addition to these five US English voices, Apple offers Siri voices in numerous other languages, including Cantonese, Mandarin, Danish, Dutch, Finnish, French, German, Hebrew, Italian, Japanese, Korean, Malay, Norwegian Bokmål, Portuguese, Russian, Spanish, Swedish, Thai, and Turkish. There are also several regional or accent variations within those languages, such as Chilean, Mexican, Spanish, and US variants of Spanish. Other changes in the upcoming iOS 15.4 include the ability to use Face ID while wearing a face mask, dual-sim 5G support, the ability to set a preferred music-streaming service, and more.", "posttime": "2022-02-25 14:00:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,ios,apple,siri,add", "title": "苹果将在iOS 15.4中添加第五个美英Siri语音", "title_en": "Apple will add fifth US English Siri voice in iOS 15.4", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/apple-will-add-fifth-us-english-siri-voice-in-ios-15-4/", "via": "", "real_tags": ["苹果", "ios", "apple", "siri", "add"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021年2月，美国邮政局提出了一个有争议的决定，用一支新的船队来取代其老化和低效的邮车，几乎全部都是新的低效柴油邮件卡车。尽管美国邮政的绝大多数配送路线都非常适合电动汽车，但美国邮政决定，计划订单中只有10%是电动电池。\n2022年2月初，这一决定招致了美国环境保护署和白宫环境质量委员会的严厉批评，他们指责邮政服务未能按照法律要求对其决定的环境影响进行适当审查。\n本周，美国邮政发布了下一代运载工具采购的最终决策记录和环境考虑记录。它&#39；这对任何关心气候变化或空气污染的人来说都是个坏消息，因为邮政部门一直坚持并拒绝改变其计划。这意味着，在订购的50000-165000辆NGDV中，90%将使用汽油，与空调一起使用时，平均每加仑仅为8.6英里（28.86升/100公里）。\n在EPA&#39；该机构在给邮政局的信中告诉USPS，它应该开启一个新的公开评论期，并要求就NGDV的决定举行公开听证会。\nUSPS现在拒绝了EPA&#39；s的要求，声称仅仅因为&#34；EPA不同意邮政服务的结论，但这并没有改变以下事实：邮政服务的分析和假设是合理的，基于可靠的来源，并反映了邮政服务在邮政物流和采购领域的卓越专业知识和丰富经验&#34;\nUSPS还抱怨EPA和CEQ的时间安排&#39；它继续以贫困为由，声称不能订购超过5000辆电动汽车。报告还说，邮政服务部门现在已经考虑并拒绝了购买像福特&#39；他说，Ars上个月驾驶的e-Transit尚未上市。\nUSPS还抱怨EPA&#39；s对NGDV的评估&#39；它的燃油效率非常糟糕，声称只有在不运行空调的情况下比较其燃油里程才是公平的。这个数字是每加仑14.7英里（每100公里16.00升）。然而，该报告没有提及在所有NGDV投入使用后关闭空调。\n&#34;拜登政府、国会、环境和公共卫生组织以及空气监管机构已明确表示，邮政服务的电气化必须是气候和公共卫生的首要任务。拒绝就这样一个有缺陷、有争议的计划举行公开听证会，充分说明了邮政局长路易斯·德乔伊（Louis DeJoy）和#34的恶意；塞拉俱乐部的凯瑟琳·加西亚说&#39；这对所有导演来说都是干净的交通工具&#34;没有理由在2022年推进这一计划；她在一份声明中说。\n乔·拜登总统仍然无法取代邮政局长路易斯·德乔伊，原因是后者#39；来自USPS的持续支持&#39；美国董事会。", "note_en": "In February 2021, the United States Postal Service made a controversial decision to replace its fleet of aging and inefficient mail trucks with  a new fleet made up almost entirely of new, inefficient diesel mail trucks. Although the vast majority of USPS delivery routes are ideally suited for electric vehicles, the USPS decided that a mere 10 percent of the planned order would be battery electric.\n In early February 2022, that decision  resulted in severe criticism from the US Environmental Protection Agency and the White House Council on Environmental Quality, who accused the Postal Service of failing to properly examine the environmental impact of its decision, as required by law.\n This week, the USPS released its  final record of decision and record of environmental consideration for the Next Generation Delivery Vehicle purchase. And it&#39;s bad news for anyone who cares about climate change or air pollution, as the Postal Service has dug in and refuses to alter its plans. That means that 90 percent of the 50,000-165,000 NGDVs that are being ordered will use gasoline and will only average 8.6 mpg (28.86 L/100 km) when used with air conditioning.\n In the EPA&#39;s letter to the Postal Service, the agency told the USPS that it should open a new public comment period and requested a public hearing on the NGDV decision.\n    The USPS has now rejected the EPA&#39;s demands, claiming that just because the &#34;EPA disagrees with the Postal Service’s conclusions does not change the fact that the Postal Service’s analyses and assumptions are reasonable, based on credible sources, and reflect the Postal Service’s superior expertise and extensive experience in the field of postal logistics and procurement.&#34;\n The USPS also complained about the timing of the EPA and CEQ&#39;s complaints, and it continues to plead poverty as the reason that it cannot order more than 5,000 EVs. The report also says the Postal Service has now considered and rejected the idea of buying a commercial off-the-shelf alternative like Ford&#39;s new electric e-Transit van, claiming that the e-Transit— which Ars drove last month—is not yet to market.\n The USPS also complained about the EPA&#39;s assessment of the NGDV&#39;s terrible fuel efficiency, claiming that it would only be fair to compare its fuel mileage when not running air conditioning. That number is 14.7 mpg (16.00 L/100 km). The report makes no mention of disabling the air conditioning for all NGDVs once they reach service, however.\n &#34;The Biden administration, Congress, environmental and public health groups, and air regulators have made it clear that electrifying the Postal Service must be a top priority for climate and public health. Refusing to hold a public hearing on such a flawed and controversial plan speaks volumes about the ill intentions of Postmaster Louis DeJoy,&#34; said Katherine García, the Sierra Club&#39;s Clean Transportation for All director. &#34;There should be no reason this plan is moving forward in 2022,&#34; she said in a statement.\n President Joe Biden remains unable to replace Postmaster Louis DeJoy due to the latter&#39;s  continued support from the USPS&#39;s Board of Governors.", "posttime": "2022-02-25 13:56:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "卡车,sticks,邮政", "title": "USPS坚持购买低效率的8.6 mpg卡车的决定", "title_en": "USPS sticks with decision to buy inefficient 8.6 mpg trucks", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/usps-says-too-bad-its-still-not-buying-more-electric-mail-trucks/", "via": "", "real_tags": ["卡车", "sticks", "邮政"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074876, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们&#39；我已经知道几个月了，EA一直在质疑它与国际足联（FIFA）近30年的关系的价值。FIFA是一个国际足球管理机构，它的名字已经成为一个超级流行的视频游戏系列的同义词。不过，现在，EA首席执行官安德鲁·威尔逊（Andrew Wilson）最近泄露的声明详细说明了&#34；讽刺的是，国际足联的许可证实际上是一个障碍；EA想要的一些方式&#34；扩大特许经营权&#34; &#34;我们的玩家告诉我们，他们想要更多的游戏模式，不同于11和11的东西，以及不同类型的游戏，&#34；据《电子游戏纪事报》报道，威尔逊在11月的一次全体人员会议上说&#34;我想告诉你，这是一场让国际足联承认我们想要创造的东西类型的斗争，因为他们说我们的许可证只涵盖某些类别。。。国际足联只是盒子上的名字，但它们阻止了我们进入球员想要的领域&#34;\n除了游戏性，FIFA许可证还限制EA&#39；包括&#34；更多的文化和商业品牌&#34；据报道，威尔逊在比赛中说。国际足联&#39；例如，谷歌与阿迪达斯的现有关系禁止在游戏中包含任何耐克品牌的产品或图像。\n据报道，威尔逊说，即使国际足联最终批准了某件事；由于批准时间表的性质和我们国际足联许可证的各种各样的事情，这实际上非常困难，我们的行动比我们想要的慢得多&#34;\n这不会&#39；这不是令人垂涎的体育许可证第一次对游戏设计产生影响。在美式足球方面，NFL要求Midway在NFL顶级闪电战系列赛中淡化后期点击和过度庆祝等特征。当EA在2012年带回NFL闪电战时，据报道联盟要求这场比赛&#39；这是世界上最过度的暴力，需要缓和，以符合#34；他们对球员健康和安全的看法&#34; EA和#39；s的NFL许可证还禁止其他出版商制作任何&#34；模拟&#34；具有联赛资格的比赛&#39；这是官方的支持。因此，拿两个例子来说，NFL2K品牌即将复兴的标题&#34；将是非模拟足球比赛体验，&#34；不管这意味着什么。\n自1993年国际足联国际足球赛（FIFA International Soccer）在世嘉创世纪（Sega Genesis）上发布以来，EA和FIFA之间最为旷日持久的公开较量中发表了上述评论。去年10月，EA公开确认其为&#34；审查我们与国际足联的命名权协议&#34；而且它正在考虑将该系列更名。在该声明发布后不久，《纽约时报》报道称，国际足联要求EA将其每年为这些许可权支付的近1.5亿美元增加一倍。\n国际足联回应了EA&#39；该公司发表声明称其为&#34；在游戏和电子竞技中采用新的商业定位#34；和&#34；与包括开发商、投资者和分析师在内的各个行业参与者合作，建立游戏、电子竞技和互动娱乐行业的长期愿景&#34;\n国际足联&#39；s报道称，每四年世界杯周期超过10亿美元的授权要求意义重大，即使是最近仅从年度&#34；终极团队&#34；微交易销售。国际足联&#39；很明显，美国对更多资金的推动让EA怀疑它是否&#39；它从许可关系中获得了足够的价值，这是它与单个足球队、联赛和其他合作伙伴的300多个许可关系之一。\n&#34;基本上，在一个非世界杯的年份，我们从FIFA那里得到的是盒子正面的四个字母，在这个世界上，大多数人甚至不再看到盒子，因为他们以数字方式购买游戏，&#34；据报道，威尔逊说。在世界杯期间，国际赛事的数字版本增加了真实性#34；是重要的，但不是最重要的；威尔逊接着说。\n威尔逊还表示，他已直接与国际足联主席詹尼·范塔尼诺讨论了自己的投诉，并将财务和游戏设计问题结合起来&#34;我说，‘听着，钱是一件事：我们不想支付超过这个许可证价值的钱，&#39&#34; 据报道，他说&#34;但这并不是关于这一点，而是关于我们及时提供球迷想要的比赛和体验的能力&#39;&#34;\n去年10月，EA为&#34；EA体育俱乐部和#34；建议如果国际足联授权讨论失败，可能会重塑品牌。", "note_en": "We&#39;ve  known for months that EA has been questioning the value of its nearly three-decade-long relationship with FIFA, the international soccer governing body whose name has become synonymous with an ultra-popular video game series. Now, though, newly leaked statements attributed to EA CEO Andrew Wilson detail how &#34;ironically, the FIFA license has actually been an impediment&#34; to some of the ways EA wants to &#34;grow the franchise.&#34; &#34;Our players tell us they want more modes of play, different things beyond 11 vs. 11 and different types of gameplay,&#34; Wilson said in a November all-hands meeting, according to  a Video Games Chronicle report. &#34;I would tell you, it’s been a fight to get FIFA to acknowledge the types of things that we want to create because they say our license only covers certain categories... FIFA is just the name on the box, but they’ve precluded our ability to be able to branch into the areas that players want.&#34;\n Beyond gameplay, the FIFA license also limits EA&#39;s ability to include &#34;more cultural and commercial brands&#34; in the game, Wilson reportedly said. FIFA&#39;s existing relationship with Adidas bars the inclusion of any Nike-branded products or imagery in the game, for instance.\n And Wilson reportedly said that even when FIFA does end up approving something, &#34;because of the nature of the approval timetables and the various things around our FIFA licence, that’s actually been really hard, and we’re moving much slower than we want.&#34;\n  This wouldn&#39;t be the first time a coveted sports license had an impact on game design. In American football, the NFL  asked Midway to tone down features like late hits and excessive celebrations in the over-the-top  NFL Blitz series. When EA  brought back  NFL Blitz in 2012, the league  reportedly asked for the game&#39;s most excessive violence to be toned down to align with &#34;their take on player health and safety.&#34; EA&#39;s NFL license also stops other publishers from making any &#34;simulation&#34; games that bear the league&#39;s official support. Thus Take-Two says that titles in its coming revival of the  NFL2K brand &#34;will be non-simulation football game experiences,&#34;  whatever that means.\n     The comments come during the most protracted public battle between EA and FIFA since  FIFA International Soccer was released on the Sega Genesis back in 1993. Last October, EA  publicly confirmed that it was &#34;reviewing our naming rights agreement with FIFA&#34; and that it was considering renaming the series going forward. Shortly after that announcement, The New York Times  reported that FIFA was asking EA to double the nearly $150 million it pays annually for those licensing rights.\n FIFA responded to EA&#39;s move by  issuing its own statement saying it was &#34;adopt[ing] a new commercial positioning in gaming and eSports&#34; and &#34;engaging with various industry players, including developers, investors and analysts, to build out a long-term view of the gaming, eSports, and interactive entertainment sector.&#34;\n  FIFA&#39;s reported licensing ask of over $1 billion for every four-year World Cup cycle is significant, even for a series that recently  brought in $1.62 billion just from annual &#34;Ultimate Team&#34; microtransaction sales. And FIFA&#39;s push for more money apparently has EA wondering whether it&#39;s getting sufficient value from that licensing relationship, which is one of over 300 it has with individual soccer teams, leagues, and other partners for the game.\n &#34;Basically, what we get from FIFA in a non-World Cup year is the four letters on the front of the box, in a world where most people don’t even see the box anymore because they buy the game digitally,&#34; Wilson reportedly said. During World Cup years, the added authenticity of having a digital version of the international tournament &#34;is important, but it’s not the most important [thing],&#34; Wilson continued.\n Wilson also said he had discussed his complaints with FIFA President Gianni Infantino directly, wrapping the financial and game design issues together. &#34;I said, ‘Listen, the money’s a thing: We don’t want to pay more money than this license is worth,&#39;&#34; he reportedly said. &#34;But it’s not about that, it’s really about our ability to deliver games and experiences that our fans want in a timely fashion.&#39;&#34;\n Last October, EA filed for  European and  British trademarks for &#34;EA Sports FC,&#34; suggesting a potential rebranding if the FIFA licensing discussions fall through.", "posttime": "2022-02-25 13:54:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,表示,comments,国际足联", "title": "在泄露的评论中，EA表示国际足联的许可证阻碍了足球比赛的设计", "title_en": "In leaked comments, EA says FIFA license is holding back soccer game design", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/in-leaked-comments-ea-says-fifa-license-is-holding-back-soccer-game-design/", "via": "", "real_tags": ["设计", "表示", "comments", "国际足联"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074874, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众所周知，微软在Windows 8上全力以赴开发以平板电脑为中心的触摸屏界面，自那以后，该公司几乎在所有主要的Windows版本上都在慢慢放弃这一决定。这一撤退在Windows 11上达到了顶峰，它彻底清除了Windows 10中仅存的平板电脑模式的最后痕迹。\n但最近几次Windows 11 Insider预览版增强了Windows 11&#39；s的触摸屏功能。上周发布给开发者频道用户的版本包括新的手势、在平板电脑模式下对抓拍窗口工作方式的更改，以及其他一些改进。今天发布的一个新版本彻底改变了触摸屏的任务栏。\n当前形式的Windows 11在&#39；重新将您的设备用作平板电脑，但新的预览版更进一步。当你&#39；重新使用应用程序时，任务栏将缩小到屏幕底部的窄条：它&#39；它仍然足够高，可以显示时钟、网络、声音和电池状态图标，但所有固定的应用程序和其他系统托盘图标都被隐藏。从屏幕底部向上滑动或关闭应用程序窗口会显示一个新的、更大版本的任务栏，带有更大、更友好的手指图标和间距。一旦你&#39；我已经启动了你的应用程序。\n如果你想自己尝试这些功能，你&#39；我想使用触摸屏硬件Windows 11仍然不&#39；我没有像Windows 10那样的专用平板电脑模式切换。相反，操作系统依赖于来自硬件的信号来启用和禁用以平板电脑为中心的UI调整。如果&#39；例如，在平板电脑模式下重新使用Surface设备，或者在瑜伽风格的可转换笔记本电脑上翻转铰链。", "note_en": "Microsoft famously went all-in on a tablet-centric touchscreen interface with  Windows 8, and the company has spent pretty much every major Windows release since then slowly backing away from that decision. That retreat culminated in  Windows 11, which fully removed the last vestiges of Tablet Mode that had survived in Windows 10.\n But the last couple Windows 11 Insider Preview builds have augmented Windows 11&#39;s touchscreen capabilities.  The build released to Dev channel users last week included new gestures, changes to how snapping windows works when in tablet mode, and a few other improvements. And  a new build released today totally overhauls the taskbar for touchscreens.\n Windows 11 in its current form adds more space between icons when you&#39;re using your device as a tablet, but the new preview goes further. When you&#39;re using apps, the taskbar will shrink to a narrow strip across the bottom of the screen: it&#39;s still tall enough to show the clock and your network, sound, and battery status icons, but all your pinned apps and other system tray icons are hidden. Swiping up from the bottom of the screen or closing an app window brings up a new, larger version of the taskbar with larger, more finger-friendly icons and spacing. The taskbar disappears again once you&#39;ve launched your app.\n       If you want to try these features for yourself, you&#39;ll want to use touch-enabled hardware—Windows 11 still doesn&#39;t have a dedicated Tablet Mode toggle like Windows 10 did. Instead, the OS relies on signals from your hardware to enable and disable the tablet-centric UI tweaks. You should see the new taskbar automatically if you&#39;re using  a Surface device in tablet mode, for example, or if you flip the hinge on a Yoga-style convertible laptop.", "posttime": "2022-02-25 13:51:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,触摸,friendly,平板", "title": "所有新的触摸友好任务栏都是最新的Windows 11预览版", "title_en": "All-new touch-friendly taskbar comes to latest Windows 11 preview", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/all-new-touch-friendly-taskbar-comes-to-latest-windows-11-preview/", "via": "", "real_tags": ["windows", "触摸", "friendly", "平板"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于超级用户、游戏玩家和那些寻求高功能鼠标的人来说，更多的按钮是有益的。Roccat希望通过即将推出的通力XP来吸引这些人，它有15个按钮，通过软件编程后可以作为29种不同的输入。\nRoccat和#39；今天发布的通力XP描述了外设是&#34；理想&#34；用于MMO和战略游戏。但高可编程性使得通力XP也有可能成为高级通用产品。\n可编程按钮包括：左键和右键单击、滚轮（5个输入：上、下、左、右和内）、滚轮以南的按钮、左键单击按钮附近的两个按钮、四个侧键和鼠标附近的一个拇指按钮&#39；这是我们的基地。\n下载Roccat&#39；当与指定按钮一起按下时，s软件为每个按钮提供辅助功能。指定的按钮可以同时位于鼠标或Roccat键盘上。这个简单的Shift[+]功能意味着你可以用鼠标编程29种不同的输入&#39；这是15个按钮。为什么不是30岁？因为其中一个按钮必须是Easy Shift[+]按钮。\n那&#39；它有很多功能，但通力XP将不得不在专门针对MMO游戏的价格范围内与mice竞争。这些满是按钮的竞争对手包括20个按钮的罗技G600 MMO（截至本文撰写时为35 MSRP）和16个按钮的Razer Naga X（80 MSRP）。后者有剃须刀和#39；s超换档功能，其工作原理与Roccat#39；It’s Easy Shift[+]。\n我说过通力XP主要针对游戏玩家，但你可能已经从它的外观上看出了这一点。鼠标总共有22个RGB LED。在八个导光板的帮助下，LED通过鼠标发射颜色#39；它有清晰的底盘和滚轮，Roccat称之为&#34；烟熏透明设计&#34；用来分散光线。\n鼠标没有&#39；Don’不要试图仅仅靠它的颜色和按钮布局来吸引玩家。它还有一个基于PixArt PAW3370的传感器，称为Roccat猫头鹰眼，具有极高的规格，包括50-19000 DPI（每英寸点数）。那&#39；与其他一些游戏鼠标相比，它的最大DPI更小，比如25000 CPI罗技G303裹尸布版。但对大多数人来说，DPI的范围是足够的。\n同时，左键和右键点击按钮使用龟背滩子品牌#39；美国本土土卫六光开关。在Roccat Kone Pro鼠标I&#39；经过测试，我发现这些开关比许多标准的机械鼠标开关更容易启动，噪音也更柔和。但是亲&#39；s的咔哒声也感觉不那么尖锐。时间会告诉我们通力XP&#39；不同的点击方式有所不同。\n最后一次向玩家点头，Roccat&#39；s通力XP也将与英伟达合作&#39；s反射潜伏期分析仪。\nArs Technica可能会通过联盟计划从本文链接中获得销售报酬。", "note_en": "For power users, gamers, and those seeking a highly functional mouse, more buttons is beneficial. Roccat wants to appeal to such people with its upcoming Kone XP, which has 15 buttons that can serve as 29 different inputs after programming via software.\n Roccat&#39;s announcement of the  Kone XP today described the peripheral is &#34;ideal&#34; for MMOs and strategy games. But high programmability makes the Kone XP potentially appealing for advanced general use, too.\n The programmable buttons are: left- and right-click, the scroll wheel (5 inputs: up, down, left, right, and in), the button south of the scroll wheel, two buttons near the left-click button, four side buttons, and a thumb button near the mouse&#39;s base.\n  Downloading Roccat&#39;s software gives each button a secondary function when pressed alongside a designated button. The designated button could be on the mouse or a Roccat keyboard simultaneously. That Easy-Shift[+] feature means you could program 29 different inputs with the mouse&#39;s 15 buttons. Why not 30? Because one of the buttons will have to be the Easy-Shift[+] button.\n That&#39;s a lot of functionality, but the Kone XP will have to compete with mice in its price range specifically geared for MMO games. Those button-laden rivals include the 20-button  Logitech G600 MMO ($35 MSRP as of writing) and the 16-button  Razer Naga X ($80 MSRP). The latter device has Razer&#39;s HyperShift feature that works like Roccat&#39;s Easy-Shift[+].\n      I said the Kone XP primarily targets gamers, but you could probably already discern that from its appearance. The mouse has 22 RGB LEDs in total. With the help of eight light guides, the LEDs blast color through the mouse&#39;s clear chassis and scroll wheel, which has what Roccat describes as a &#34;smoky transparent design&#34; meant to diffuse the lighting.\n The mouse doesn&#39;t try to lure gamers on its colors and button layout alone. It also has a sensor based off the PixArt PAW3370, called the Roccat Owl-Eye, with extreme specs, including 50-19,000  DPI (dots per inch). That&#39;s a lesser max DPI than some other gaming mice, like the 25,000 CPI  Logitech G303 Shroud Edition, offer. But for most, that DPI range is ample.\n  Meanwhile, the left- and right-click buttons use the Turtle Beach sub-brand&#39;s homegrown Titan Optical Switches. In the  Roccat Kone Pro mouse I&#39;ve tested, I found the switches easier to actuate with a softer noise than many standard mechanical mouse switches. But the Pro&#39;s clicks also felt less sharp. Time will tell if the Kone XP&#39;s clicks differ.\n And in a last nod at gamers, Roccat&#39;s Kone XP will also work with Nvidia&#39;s Reflex latency analyzer.\n  Ars Technica may earn compensation for sales from links on this post through  affiliate programs.", "posttime": "2022-02-25 13:49:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "编程,鼠标,mouse,按钮", "title": "新的Roccat鼠标可以编程多达29种不同的输入", "title_en": "New Roccat mouse lets you program up to 29 different inputs", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/new-roccat-mouse-lets-you-program-up-to-29-different-inputs/", "via": "", "real_tags": ["编程", "鼠标", "mouse", "按钮"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074872, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当人们第一次发现快速射电爆发时，它是一个谜。起初，每一个FRB都遵循相同的模式：在无线电波长中持续不到一秒钟的巨大能量激增，然后爆炸消失了，再也不会重复。我们最初怀疑FRB可能是我们的探测器中的硬件故障，但随着时间的推移，爆发#39；反复发生使我们确信它们是真实的。\n从那时起，我们&#39；我们已经确定了重复爆发的来源，并将FRB与在无线电范围外产生能量的来源联系起来。这最终帮助我们找到了一个单一的来源：磁星，或者说是中子星，它们具有极强的磁场。\n现在，现实已经过去了，在这个漂亮而简单的解释中加入了一个猴子扳手。一个新的FRB重复来源已经被确定，它位于一个我们不知道的地方&#39；我不指望能找到磁星。这并不意味着&#39；这并不意味着来源是&#39；t来自磁星，但我们不得不求助于一些不同寻常的解释来解释它的形成。\n磁星是中子星的一种形式，即&#39；一颗质量足以产生超新星，但质量不足以形成黑洞的恒星崩塌后留下的恒星。当残余物被压缩成中子汤时，中子星的物质会收缩，直到它&#39；它只有大约20公里宽。这个紧凑的物体继承了它的母星的所有旋转能量，使它以快速的速度旋转，通常通过加入从其环境中下落的物质而进一步旋转。\n在许多情况下，这种快速旋转会产生脉冲星，即中子星，其辐射源似乎会随着恒星快速闪烁&#39；这是轮换。在另一些情况下，中子星最终会产生强磁场，成为磁星。磁星&#39；地球的强磁力线被它的旋转所缠绕，通常会与环境产生高能相互作用。\n但这些高能现象并不&#39；t往往会持续很长时间，至少从天文角度来看是这样。所有这些与环境的高能相互作用都会导致中子星释放能量，减缓其自转，并降低其产生的任何光的强度。例如，磁星通常被认为只有10000年左右的寿命，然后才进入一种更安静的存在。\n此外，形成磁星的超新星出现在相对年轻的恒星中，通常只有几百万年的历史。\n这种早期恒星死亡和短磁星寿命的结合意味着我们只希望在年轻恒星丰富的区域看到磁星。较老的恒星群体应该在数十亿年前就看到磁星的形成和消失。\n这项新工作由一个大型国际团队完成，涉及对另一个重复FRB源的发现进行跟踪，该源名为FRB 20200120E。为了确定FRB 20200120E的位置，该团队求助于欧洲甚长基线干涉测量网络的分辨率，该网络可以使用分布在世界各地的多达22台望远镜。该团队设法让足够多的望远镜指向重复源，以拍摄五个单独的FRB。\n按照从这些不同望远镜重建数据的方式，单次爆发无法为我们提供精确的位置。相反，可以确定一系列可能的位置。通过结合与每一次爆发一致的位置，研究人员能够为FRB源提供一个可能的位置。\n这个来源原来是附近星系M81中的一个球状星团。基于关于FRB 20200120E位置和M81内球状星团频率的剩余不确定性，研究团队估计FRB 20200120E不在该球状星团中的几率仅为1/10000。\n搜索该位置并没有发现持续存在的无线电信号源。根据使用X射线和伽马射线望远镜进行的搜索，也没有发现高能量来源。所以，有&#39；这不是一个明显的高能物体。\n这个位置很奇怪。球状星团最引人注目的是由老恒星群组成。数十亿年来，它们不太可能有任何形成中子星的超新星。所以这可能会排除磁星的存在，对吧？\n不完全是。少数机制可以在没有超新星的情况下或在超新星发生后很久产生磁星。这些机制主要依赖于附近的伴星。如果伴星是一颗普通恒星，它可以将物质送入白矮星，直到白矮星坍缩成中子星。或者白矮星和中子星的各种组合可以合并，也可以产生中子星。最后，我们知道一个正常的伴侣可以&#34；向上旋转&#34；一颗以前安静的中子星，通过给它提供物质。\n这些过程中的任何一个都有可能在老恒星群中产生磁星。鉴于现场明显没有任何非爆破活动，如果其中任何一个过程实际上发生在FRB 20200120E，可能很难进行分类。\n无论如何，这一发现表明，如果磁星是所有FRB的来源，那么我们可能期望在比这一发现之前预测的更广泛的环境中看到它们。我们可能还不想排除非磁性来源的考虑。", "note_en": "Fast radio bursts were an enigma when they were first spotted. At first, each FRB followed the same pattern: a huge surge of energy in radio wavelengths that lasted less than a second—and then the burst was gone, never to repeat. We initially suspected FRBs might be hardware glitches in our detectors, but over time, the bursts&#39; recurrence convinced us that they were real.\n Since then, we&#39;ve identified  sources of repeated bursts and associated the FRBs with a source that produces energy outside the radio range. This ultimately helped us point the finger  at a single source: magnetars, or neutron stars that have extremely intense magnetic fields.\n Now, reality has gone and thrown a monkey wrench in that nice and simple explanation. A new repeating source of FRBs has been identified, and it resides in a location where we wouldn&#39;t expect to find any magnetars. This doesn&#39;t mean that the source  isn&#39;t from a magnetar, but we have to resort to some unusual explanations for its formation.\n  A magnetar is a form of neutron star, which is what&#39;s left after the collapse of a star that is massive enough to generate a supernova but not massive enough to form a black hole. As that remnant is compressed into a soup of neutrons, the matter of a neutron star shrinks until it&#39;s only about 20 kilometers across. That compact object inherits all the rotational energy of its parent star, causing it to spin at a rapid rate, often furthered by the addition of matter falling in from its environment.\n    In many cases, this rapid rotation results in pulsars, neutron stars that have sources of radiation that appear to blink rapidly in time with the star&#39;s rotation. In some others, the neutron star ends up with an intense magnetic field, making it a magnetar. A magnetar&#39;s intense magnetic field lines are whipped around by its rotation, often creating high-energy interactions with its environment.\n But these high-energy phenomena don&#39;t tend to last long, at least in astronomical terms. All of these energetic interactions with the environment cause the neutron star to shed energy, slowing its rotation and reducing the intensity of any light it produces. For example, magnetars are thought to typically have life spans on the order of only 10,000 years before fading into a quieter existence.\n In addition, the supernova that form magnetars occur in relatively young stars, typically only a few million years old.\n This combination—an early stellar death and a short magnetar life span—means we only expect to see magnetars in areas with an abundance of young stars. Older star populations should have seen magnetars form and fade out billions of years earlier.\n  The new work, done by a large international team, involved following up on the discovery of another repeating FRB source, called FRB 20200120E. To identify where FRB 20200120E was located, the team turned to the resolving power of the European Very Long Baseline Interferometry Network, which can use as many as 22 telescopes  scattered throughout the world. The team managed to get enough of those telescopes pointed at the repeating source to image five individual FRBs.\n The way reconstructing data from these different telescopes work, a single burst will not get us a precise location. Instead, a range of possible locations can be identified. By combining the locations that are consistent with each of these bursts, the researchers were able to provide a likely location for the FRB source.\n    That source turned out to be a globular cluster of stars in the nearby galaxy M81. Based on the remaining uncertainty regarding the location of FRB 20200120E and the frequency of globular clusters within M81, the research team estimates that the chances of FRB 20200120E not being in this globular cluster is only about 1 in 10,000.\n Searching that location did not reveal a persistent source of radio signals. No high-energy sources, based on searches using X-ray and gamma-ray telescopes, turned up either. So, there&#39;s not an obvious high-energy object there.\n  This location is odd. Globular clusters are most notable for consisting of populations of old stars. There are unlikely to have been any neutron-star-forming supernovae in them for billions of years. So that should probably rule the presence of a magnetar out, right?\n Not entirely. A handful of mechanisms could produce a magnetar either without a supernova or long after one took place. These mechanisms mostly rely on a nearby companion star. If the companion is a normal star, it can feed matter into a white dwarf star until the dwarf collapses into a neutron star. Or various combinations of white dwarfs and neutron stars can merge, also producing a neutron star. Finally, we know that a normal companion can &#34;spin up&#34; a previously quiet neutron star by feeding it matter.\n Any of these processes could potentially produce a magnetar within a population of old stars. Which process—if any of them—has actually taken place at FRB 20200120E may be difficult to sort out, given the apparent absence of any nonburst activity from the site.\n In any case, the finding suggests that, should magnetars be the source of all FRBs, then we might expect to see them in a much broader range of environments than would have been predicted prior to this discovery. And we might not want to rule out consideration of nonmagnetar sources just yet.", "posttime": "2022-02-25 13:45:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "应该,radio,中子星", "title": "在不应该有任何辐射源的地区发现了新的快速无线电爆炸", "title_en": "New fast radio burst found in area that shouldn’t have any sources", "transed": 1, "url": "https://arstechnica.com/science/2022/02/new-fast-radio-burst-found-in-area-that-shouldnt-have-any-sources/", "via": "", "real_tags": ["应该", "radio", "中子星"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074871, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考古学家从一座西班牙坟墓中挖掘出一个5300年前的头骨，并确定左耳道附近的七个切口是治疗中耳感染的原始外科手术的有力证据。据《科学报告》杂志最近发表的一篇论文的作者称，这是迄今为止发现的最早的耳外科手术。西班牙研究小组还发现了一把可能被用作烧灼工具的燧石刀片。\n发掘地点位于西班牙布尔戈斯的埃尔潘登多尔曼，由一座巨石纪念碑的遗骸组成，可追溯到公元前4世纪，即新石器时代晚期。废墟中有一个骨瓮，里面有近100人的骨头，考古学家自2016年以来一直在挖掘这些遗骸。\n2018年7月，研究小组找到了这项最新研究的主题头骨。头骨位于右侧，面向墓室入口，虽然大部分头骨完好无损，但没有牙齿残留。牙齿缺失，加上骨密度和甲状腺软骨完全骨化，表明这是一位65岁或以上的老年女性的头骨。\n在靠近乳突骨（位于耳朵后面）的颅骨两侧发现了穿孔的证据。作者认为，这些穿孔是两次外科手术的结果，每只耳朵上各有一次，是由具有基本解剖学知识的人进行的。右耳有更多的骨重建，这表明第一次手术是为了治疗可能危及生命的疾病，考虑到这段时间内这种手术的风险。\n这名女子在第一次手术中幸存下来，并在术后一段时间接受了第二次左耳手术。作者无法确定这些程序是连续进行的，还是两个程序之间经过了几个月甚至几年。不管怎样，&#34；因此，这是对两个颞骨进行手术的最早证据，因此很可能是人类历史上已知的第一次乳突根治术；他们写道。\n根据作者的说法，到17世纪，这是一种相当常见的治疗急性耳感染的外科手术，在克罗地亚（11世纪）、意大利（18世纪和19世纪）和哥本哈根（19世纪或20世纪初）发现了有乳突切除证据的头骨。也许最古老的颅骨手术类型是颅骨钻孔术，即在头部钻一个洞，这在伊比利亚半岛已经有很好的记录。从靠近埃尔彭多的多尔曼的一个地点发现的五个头骨显示出钻孔的证据，尽管缺乏抗生素和并发症的高风险，这些人显然在这些手术中幸存下来。\n是什么情况促使了这样的干预？作者排除了胆脂瘤的可能性，胆脂瘤是一种颞骨损伤，可导致听力丧失、眩晕和其他并发症，尽管这是古代头骨病理学研究中记录最充分的疾病之一。但胆脂瘤往往会侵蚀分隔耳道和乳突的骨壁（盾牌），而该女性两侧的盾牌都完好无损；这是头骨。作者还排除了骨肿瘤或恶性外耳炎（耳道和颞骨的快速传播感染）的可能性。\n作者得出结论，最有可能的情况是急性中耳炎，也就是中耳感染，它已经扩散到下面的骨骼，特别是乳突骨（乳突炎）。这种情况本来很容易诊断，因为随着液体和粘液在耳内积聚，感染会导致可见的肿胀和发红。如果中耳感染扩散到乳突骨，骨&#39；这种蜂窝状结构也会充满液体和粘液。如果不进行治疗，这可能会导致听力损失，甚至可能导致脑膜炎。在抗生素广泛使用之前，中耳感染引起的乳突炎是儿童死亡的主要原因之一（幸运的是，这在今天是一种罕见的疾病）。\n现代乳突切除术需要去除乳突骨中的细胞#39；这是一个充满空气的中空空间。在乳突根治术中，外科医生首先在耳后切开，然后用骨钻打开进入中耳腔的通道。然后，外科医生将移除任何受感染的乳突骨或组织，缝合伤口，并包扎伤口。根据作者的说法，他们的新石器时代晚期耳外科医生将遵循类似的（尽管更粗糙）程序，移除受影响的骨头以引流中耳，然后将乳突骨与内耳骨周围的鼓室连接起来。", "note_en": "Archaeologists have excavated a 5,300-year-old skull from a Spanish tomb and determined that seven cut marks near the left ear canal are strong evidence of a primitive surgical procedure to treat a middle ear infection. That makes this the earliest known example of ear surgery yet found, according to the authors of a  recent paper published in the journal Scientific Reports. The Spanish team also identified a flint blade that may have been used as a cauterizing tool.\n The excavation site is located in the Dolmen of El Pendón in Burgos, Spain, and consists of the remains of a megalithic monument dating back to the 4th century BCE, i.e., the late Neolithic period. The ruins include an ossuary holding the bones of nearly 100 people, and archaeologists have been excavating those remains since 2016.\n In July 2018, the team recovered the skull that is the subject of this latest study. The skull was lying on its right side, facing the entrance of the burial chamber, and while most of the cranium was intact, no teeth remained. The missing teeth, plus the loss in bone density and fully ossified thyroid cartilage, indicated that this was the skull of an elderly woman aged 65 or older.\n  Evidence of perforations were found on both sides of the skull near the mastoid bones (located just behind the ear). The authors suggested that these perforations were the result of two surgical interventions, one on each ear, by someone with rudimentary anatomical knowledge. There was more bone remodeling on the right ear, indicting that the first surgery was performed to treat what was likely a life-threatening condition, given the risks associated with such a procedure during this period.\n    The woman survived the first procedure and endured a second surgery on the left ear sometime after. The authors were unable to determine whether the procedures were done back-to-back or whether months or even years passed between them. Regardless, &#34;It is thus the earliest documented evidence of a surgery on both temporal bones and therefore, most likely, the first known  radical mastoidectomy in the history of humankind,&#34; they wrote.\n This was a fairly common surgical procedure to treat acute ear infections by the 17th century, per the authors, and skulls showing evidence of a mastoidectomy have been found in Croatia (11th century), Italy (18th and 19th centuries), and Copenhagen (19th or early 20th century). Perhaps the oldest type of skull surgery is cranial  trepanation—the drilling of a hole in the head—which has been well-documented along the Iberian Peninsula. Five skulls recovered from a site close to the Dolmen of El Pendón showed evidence of trepanation, and the individuals apparently survived those procedures, despite the lack of antibiotics and a high risk of complications.\n  What condition might have prompted such an intervention? The authors ruled out a  cholesteatoma—an injury to the temporal bone that can cause hearing loss, vertigo, and other complications—even though this is one of the most well-documented diseases in pathological studies of ancient skulls. But cholesteatoma tends to erode the bony wall (scutum) separating the ear canal from the mastoid, and the scutum was intact on both sides of the woman&#39;s skull. The authors also ruled out a bone tumor or  malignant external otitis (a fast-spreading infection of the ear canal and temporal bone).\n    The authors concluded that the most likely condition was  acute otitis media, aka a middle ear infection, which had spread to the underlying bone, specifically the mastoid bone ( mastoiditis). The condition would have been easy enough to diagnose, since the infection causes visible swelling and redness as fluid and mucus build up inside the ear. If a middle ear infection spread to the mastoid bone, the bone&#39;s honeycomb-like structure would have also filled with fluid and mucus. Untreated, this would have led to hearing loss and possibly meningitis. Mastoiditis resulting from a middle ear infection was one of the leading causes of death in children prior to the wide availability of antibiotics (and it is mercifully a rare condition today).\n A modern mastoidectomy involves removing the cells in the mastoid bone&#39;s hollow air-filled spaces. In a radical mastoidectomy, the surgeon will first make a cut behind the ear and then use a bone drill to open access to the middle ear cavity. Then the surgeon will remove any infected mastoid bone or tissue, stitch up the cut, and bandage the wound. Per the authors, their late Neolithic ear surgeon would have followed a similar (albeit much cruder) procedure, removing the affected bone to drain the middle ear and then connecting the mastoid bone with the  tympanic cavity surrounding the bone of the inner ear.", "posttime": "2022-02-25 13:43:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "外科手术,skull,乳突", "title": "这具5300年前的头骨显示了已知最早的耳外科手术的证据", "title_en": "This 5,300-year-old skull shows evidence of the earliest known ear surgery", "transed": 1, "url": "https://arstechnica.com/science/2022/02/this-5300-year-old-skull-shows-evidence-of-the-earliest-known-ear-surgery/", "via": "", "real_tags": ["外科手术", "skull", "乳突"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074870, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从来没能深入了解恶魔的灵魂，也没能深入了解软件开发者近年来所熟知的主题相似的后续作品。我上一次认真尝试，是在2014年深入研究《黑暗灵魂2》时，我记录了我在八小时的奋斗中，为了打败一个老板而死去65次时所忍受的“令人发狂的美丽痛苦”。虽然这段经历让我对软件公司不屈不挠的游戏设计产生了一定的欣赏，但也足以让我相信，我没有气质在这类游戏中投入几十个小时。我明白为什么这么多人觉得这种不可饶恕的风格很有吸引力，我甚至愿意不时地从软件的进一步目录中深入了解。但我就是无法克服必要的挫折因素，才能真正投入到这些精心打造的世界中去。\n然后，埃尔登戒指（Elden Ring）开始引起轰动，这是从&#39；s的“灵魂之本”风格。导演宫崎英太在接受采访时承诺，新的头衔将比他以前的软件作品更容易获得，生活质量的提高，比如更频繁的检查点，更容易的健康管理，以及一个开放的世界设计，它不会把进展关在几乎不可能的老板身后。\n宫崎骏说：“我不想强制执行任何游戏风格或特定路线，因为我希望（玩家）体验那种自由感。”。“我意识到，虽然我们提供的游戏具有很高的挑战性，但我们的设计方式让人感到满足，可以克服这些挑战。”这种谈话足以让我再次深入灵魂世界。我很高兴我做到了。虽然Elden Ring并没有真正让Soulsborne体验变得更容易，但就其本身而言，它的开放世界设计和游戏性调整调整了奖赏和挫折之间的平衡，足以让整个体验变得愉悦，即使对我这样的怀疑者来说也是如此。\n传奇奇幻作家乔治·R·马丁（George R.R.Martin）参与了《埃尔登环》（Elden Ring）的开发，这可能会让一些玩家希望有一个冰与火之歌风格的故事，捕捉到交战派系的自相残杀历史和复杂的人际家庭剧。不过，这些希望可能是错误的，因为埃尔登·林格的故事讲述具有稀疏性和神秘性的特点。\n一个简短的介绍性剪接场景向玩家介绍了名义上的埃尔登戒指，这是一件强大而神奇的珠宝，已被打碎并分发给了玛丽卡女王的孩子们。这些碎片给这些孩子带来了“新发现力量的疯狂污点”，导致了一场“没有上帝出现的战争”\n结果，远方破碎的世界现在充满了被玷污的人，那些“死了还活着”的人作为一个“没有名望”的污点，你应该寻找你的污点同伴，团结破碎的戒指碎片，为现在混乱的土地带来秩序。\n最初的信息转储是迄今为止你从埃尔登戒指上得到的最直接的信息。你必须从全世界共享的信息片段中找出其他一切&#39；影片中分散的非玩家角色，他们在被摧毁的教堂或破旧的棚屋中挺身而出。\n几乎对一个人来说，这些“幸存者”用一种令人毛骨悚然、空灵的语气说话，暗示着完全缺乏希望。他们都以一种神秘、迂回的方式展示了他们零碎的知识，只提供了世界如何发展到目前状态的最简单的暗示。拼凑这个堕落世界的社会历史就像试图解决一个拼图游戏，而你每半小时只能得到一个随机的片段。\nElden Ring没有讲述故事，而是倾向于非常强烈的环境故事。游戏地图的每一部分似乎都是精心设计的，以指向一段你只能模糊地意识到的更深层次的历史。\n你可能会爬上一块露出地面的参差不齐的石头，几分钟后才意识到，它实际上是一个被遗忘已久的旧世界英雄的巨大雕像的半粉碎的头部。之后，你可能会在一个被洪水淹没的小镇上绊倒，你必须在沼泽水线上方几乎看不见的屋顶上跳舞才能达到下一个目标。然后你会遇到一个摇摇欲坠的采矿作业，一层层的垂直脚手架延伸到一座山的深处。\n这也不仅仅是建筑。你会发现敌人徘徊在堕落英雄的破烂遗骸周围，用热情和冷漠守护着他们宝贵的装备。或者你可能会看到一队不死士兵带领着两个巨人，他们被锁在一辆神秘的手推车上，永远在一条该死的赛道上行进。\n那里&#39；这是一种弥漫的、令人不安的气氛，它是一种你永远无法真正了解的巨大文明的回响，最近已经褪色。当然，对于那些决心将其拼凑在一起的人来说，一定有知识可以挖掘，但埃尔登环在传递氛围方面比独特的情节线要有效得多，而且它&#39；这样可能会更好。", "note_en": "I’ve never been able to get very deep into  Demon’s Souls or any of the thematically similar follow-ups developer From Software has become known for in recent years. The last time I seriously tried, delving into  Dark Souls II in 2014, I  documented the “maddeningly beautiful suffering” I endured while dying 65 times in an eight-hour slog to beat a single boss. While that experience gave me some appreciation for From Software’s uncompromising game design, it was also enough to convince me that I didn’t have the temperament to pour dozens of hours into these sorts of games. I get why so many people find this unforgiving style appealing, and I’ve even willingly dipped my toes into From Software’s further catalog from time to time. But I just couldn’t overcome the frustration factor necessary to really commit to a deep dive into these meticulously crafted worlds.\n Then the buzz began for  Elden Ring, the latest game in what has become known as From&#39;s “Soulsborne” style. Director Hidetaka Miyazaki  promised in interviews that the new title would be more accessible than his previous From Software work, with  quality-of-life improvements like more frequent checkpoints, easier health management, and an open-world design that doesn’t gatekeep progress behind nigh-impossible bosses.\n  “I don’t want to enforce any playstyle or particular route because I’d like [players] to experience that sense of freedom,” Miyazaki said. “And I realize that while we offer games with a high level of challenge, we design them in a way that feels fulfilling to overcome.”  That kind of talk was enough to get me to dive deep into the Soulsborne world one more time. And I’m glad I did. While  Elden Ring doesn’t really make the Soulsborne experience any easier, per se, its open-world design and gameplay adjustments tweak the balance of rewards and frustrations just enough to make the whole experience enjoyable—even for a skeptic like me.\n     The involvement of legendary fantasy author George R.R. Martin in  Elden Ring’s development might have some players hoping for a  Song of Ice and Fire-style story that captures the internecine history and complex interpersonal family drama of warring factions. Those hopes would be misplaced, though, as  Elden Ring’s storytelling is characteristically sparse and cryptic.\n A short introductory cutscene introduces players to the titular Elden Ring, a powerful, magical piece of jewelry that has been shattered and had its pieces distributed to the children of Queen Marika. The shards give those children the “mad taint of the newfound strength” that leads to a “war from which no lord arose.”\n As a result, the shattered world of the Lands Beyond is now filled with the Tarnished, those who are “dead who yet live.” As one such Tarnished of “no renown,” it’s up to you to hunt down your fellow Tarnished, unite the pieces of the shattered ring, and bring order to a now-chaotic land.\n  That initial info dump is by far the most direct exposition you’ll get from  Elden Ring. You’ll have to figure out everything else from the snippets of information shared by the world&#39;s scattered non-player characters, who are holding out amid the destruction in ruined churches or dilapidated shacks.\n Almost to a person, these “survivors” speak with a creepy, ethereal tone that suggests an utter lack of hope. They all present their fragmentary lore in a cryptic, roundabout manner that offers only the barest hint of how the world got to its current state. Piecing together the social history of this fallen world is like trying to solve a jigsaw puzzle when you only get a single random piece every half hour.\n    Instead of exposition,  Elden Ring leans on extremely strong environmental storytelling. Every part of the game’s sprawling map seems masterfully crafted to point to a deeper history you’ll only ever be vaguely aware of.\n You might climb a jagged stone outcropping to realize minutes later that it’s actually the half-shattered head of a gigantic statue of some long-forgotten hero of the old world. Later, you could stumble on a flooded town where you have to dance across the barely visible rooftops above the swamp-waterline to reach your next objective. Then you’ll happen upon a ramshackle mining operation with layer upon layer of vertical scaffolding extending deep into a mountain.\n  It’s not just the architecture, either. You’ll catch enemies lingering around the tattered remains of fallen heroes, guarding their valuable gear with both zealousness and indifference. Or you might spot a caravan of undead soldiers leading two giants chained to a mysterious cart and marching in a damned circuit forever.\n There&#39;s a pervasive, unsettling air of recently faded grandeur—echoes of a massive civilization you’ll never truly know. While there’s surely lore to be mined for those determined enough to piece it together,  Elden Ring is much more effective at imparting vibes than distinct plotlines, and it&#39;s probably better off for it.", "posttime": "2022-02-25 13:41:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "评论,ring,世界", "title": "埃尔登戒指评论：来看看惩罚难度更温和的一面吧", "title_en": "Elden Ring review: Come see the softer side of punishing difficulty", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/elden-ring-review-come-see-the-softer-side-of-punishing-difficulty/", "via": "", "real_tags": ["评论", "ring", "世界"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074869, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔的NUC Extreme mini PC套件一直很难推荐。的确，它们甚至比最小的迷你ITX PC机箱都要小得多；如果你使用的是通用PC组件，就不可能在更少的空间内实现如此高的性能。但它们也很贵，它们没有#39；它的速度不及标准台式电脑，而且它们的可升级性也受到了限制。这三件事基本上违背了打造一台强大的台式游戏PC或工作站的目的。\n代号为“龙峡谷”（Dragon Canyon）的最新版本的NUC Extreme Kit通过切换到实际的嵌入式桌面处理器，而不是在笔记本电脑版本中焊接，帮助解决后两个问题。它仍然是一个昂贵的盒子，没有RAM、SSD、GPU或操作系统的Core i7版本大约需要1150美元，我们测试的Core i9版本大约需要1450美元，但它的性能现在已经接近典型的台式机。\nNUC Extreme仍然不适合所有人，但如果金钱不是目标，而你想要的是最小的桌面，那么第12代NUC Extreme与之前的版本相比就不那么折衷了。\nNUC 12 Extreme机箱的外部设计与上一版本几乎相同，它使用第12代Alder Lake CPU，但是第三代NUC Extreme硬件。这是一款狭长的电脑，顶部和侧面都有透气的网状面板，正面有一个霓虹灯头骨LED（所有系统的LED都可以通过英特尔的NUC软件工作室应用定制或禁用）。与第11代NUC Extreme相比，唯一的变化是前端的一个USB-A端口已被替换为USB-C端口。\n与第二代NZXT H1（15.6升）、SSUPD Meshlicious（14.7升）和Cooler Master NR200P（18.5升）等著名的迷你ITX外壳相比，8升外壳的体积更大。缺点是，你不能在NUC中使用标准主板或CPU冷却器，尽管它似乎使用了正常的650W SFX电源，如果它坏了，或者你需要用更高瓦数的型号来更换，应该很容易更换。您的GPU选项也将相对有限英特尔的NUC外壳可以容纳多达12英寸长的卡，但您将仅限于双插槽卡。我们在安装了华硕双GeForce RTX 3060 GPU的情况下测试了我们的产品，虽然可以安装更大的卡，但您肯定无法将大多数Radeon RX 6900 XT或RTX 3080型号塞进其中。\n第12代机型的内部设计也与前一代机型相似，如果单独购买，您可以使用更新的计算元件板升级前一代机柜。Intel的Compute Element板和您的GPU都插在机箱底部的子板上，使它们彼此平行，而无需使用脆弱或挑剔的PCIe转接电缆。\nNUC的一个受欢迎的内部变化是，它现在使用的是可拆卸和更换的嵌入式桌面处理器，而第11代型号使用的是焊接的笔记本电脑CPU。这大概是因为英特尔最终将其台式机芯片转移到了更高效的10nm制造工艺；NUC体积小，冷却能力有限，不适合炎热且耗电巨大的14纳米第11代台式机芯片，因此英特尔选择使用10纳米第11代笔记本电脑CPU，但功率限制有所提高。如果第13代Intel CPU继续与LGA1700插槽和600系列芯片组兼容，那么实际的CPU插槽将特别方便。\n对于这种尺寸的计算机，NUC Extreme有很多端口，包括一个SD卡读卡器和一个USB-a端口。在前端，它有一个USB-C端口；在背面，它有六个USB-A端口、一个HDMI端口、2.5Gbps和10Gbps以太网端口，以及两个Thunderbolt 4端口。如果您没有安装GPU，或者希望将显示器连接到集成GPU和专用GPU，则Thunderbolt和HDMI端口可用于驱动显示器。这是一个狭窄的使用案例，但能够将六台显示器连接到一台如此大小的PC上，使其成为一个非常灵活的工作站。\n借助英特尔的AX211 Wi-Fi芯片组，Wi-Fi 6E和Bluetooth 5.2集成在主板上，NUC有两个用于PCIe 4.0 NVMe SSD的插槽和一对用于用户可更换RAM的DDR4 SODIMM插槽。我们可以谴责NUC使用DDR4而不是DDR5，但DDR5仍然比DDR4贵得多，可用性也远低于DDR4，同时提供的速度效益微乎其微。随着DDR5变得更便宜、更快、更丰富，这种情况将随着时间的推移而改变。但就目前而言，采用DDR4是更实际的决定。\n整个外壳可以用十字螺丝刀拆卸。为了接近内部构件，你可以将后面板弹出，从侧板上滑下，然后小心地将顶部面板向上提起（它里面有风扇，因此它不会在不需要额外努力的情况下完全与外壳的其余部分断开）。随着超小型台式PC的发展，这很容易操作，哪怕只是因为机箱不允许你安装大而复杂的冷却器，也不允许你安装风扇和LED电缆的鼠窝。", "note_en": "Intel’s NUC Extreme mini PC kits have always been hard to recommend. It’s true that they’re considerably smaller than even the smallest mini ITX PC cases; it’s impossible to fit this much performance into less space if you’re using general-purpose PC components. But they’re also expensive, they haven&#39;t been as fast as standard desktop PCs, and their upgradability has been limited. Those three things essentially defeat the purpose of building a beefy desktop gaming PC or workstation.\n Codenamed “Dragon Canyon,” the newest version of the NUC Extreme Kit helps to fix the latter two problems by switching to actual socketed desktop processors rather than soldered-in laptop versions. It’s still an expensive box—you’ll pay about $1,150 for a Core i7 version with no RAM, SSD, GPU, or operating system and $1,450 for the Core i9 version we tested—but its performance now comes much closer to that of a typical desktop.\n The NUC Extreme still isn’t for everyone, but if money is no object and you want the smallest desktop you can get, the 12th-gen NUC Extreme is less of a compromise than the previous versions were.\n   The external design of the NUC 12 Extreme case, which uses 12th-gen Alder Lake CPUs but is the third generation of NUC Extreme hardware, is nearly identical to  the previous version. It’s a long, narrow computer with mesh panels for ventilation on the top and sides and a neon skull LED on the front (all of the system&#39;s LEDs can be customized or disabled entirely with  Intel&#39;s NUC Software Studio app). The only change from the 11th-gen NUC Extreme is that one of the USB-A ports on the front has been exchanged for a USB-C port.\n    The 8-liter enclosure’s volume compares favorably to notable mini ITX cases like the  second-generation NZXT H1 (15.6L), the  SSUPD Meshlicious (14.7L), and the  Cooler Master NR200P (18.5L). The downside is that you can’t use a standard motherboard or CPU cooler in the NUC, though it does appear to use a normal 650W SFX power supply that should be easy to replace if it breaks or if you need to replace it with a higher-wattage model. Your GPU options will also be relatively limited—Intel’s NUC case can take cards up to 12 inches long, but you’ll be limited to dual-slot cards. We tested ours with an  Asus Dual GeForce RTX 3060 GPU installed, and while larger cards can fit, you definitely won’t be able to cram most Radeon RX 6900 XT or RTX 3080 models into it.\n  The 12th-gen model’s internal design is also similar to the previous model’s, so much so that you could upgrade the previous enclosure with the newer Compute Element board if you bought it separately. Intel’s Compute Element board and your GPU both plug in to a daughterboard at the bottom of the case, allowing them both to sit parallel to one another without requiring the use of flimsy or finicky PCIe riser cables.\n One welcome internal change to the NUC is that it now uses socketed desktop processors that can be pulled out and replaced, whereas the 11th-gen model used a soldered-down laptop CPU. This is presumably because Intel has finally moved its desktop chips to its more efficient 10 nm manufacturing process; the NUC’s small size and limited cooling capacity would have been a bad fit for the hot and power-hungry 14 nm 11th-gen desktop chips, so Intel opted to use a 10 nm 11th-gen laptop CPU with the power limits turned up instead. An actual CPU socket will be particularly handy if 13th-gen Intel CPUs continue to be compatible with the LGA1700 socket and 600-series chipsets.\n     For a computer this size, the NUC Extreme has plenty of ports, including an SD card reader and one USB-A port. On the front, it has one USB-C port; on the back, it has six USB-A ports, one HDMI port, 2.5Gbps and 10Gbps Ethernet ports, and two Thunderbolt 4 ports. The Thunderbolt and HDMI ports can be used to drive displays if you don’t have a GPU installed or if you want to hook displays to both the integrated GPU and the dedicated GPU. This is a narrow use case, but being able to connect half a dozen monitors to a PC this size makes it a pretty flexible workstation.\n Wi-Fi 6E and Bluetooth 5.2 are integrated on the board, courtesy of Intel’s  AX211 Wi-Fi chipset, and the NUC has two slots for PCIe 4.0 NVMe SSDs and a pair of DDR4 SODIMM slots for user-replaceable RAM. We could ding the NUC for going with DDR4 instead of DDR5, but DDR5 is still much more expensive and much less available than DDR4 while offering only marginal speed benefits. This will change over time as DDR5 gets cheaper, faster, and more plentiful. But for now, going with DDR4 instead is the more practical decision.\n  The whole enclosure can be disassembled with a Phillips-head screwdriver. To access the internals, you pop the back panel off, slide off the side panels, and carefully lift the top panel up (it has fans in it, so it doesn’t totally disconnect from the rest of the case without additional effort). As super-small desktop PCs go, it’s easy to work on, if only because the enclosure doesn’t let you install big, complicated coolers or a rat’s nest of fan and LED cables.", "posttime": "2022-02-25 13:39:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,review,nuc", "title": "英特尔NUC 12极限评论：阿尔德湖打造了一个昂贵的便携式发电站", "title_en": "Intel NUC 12 Extreme review: Alder Lake makes for a pricey, portable powerhouse", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/intel-nuc-12-extreme-review-alder-lake-makes-for-a-pricey-portable-powerhouse/", "via": "", "real_tags": ["英特尔", "review", "nuc"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074868, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特称，它错误地暂停了公开源代码情报记者发布的关于俄罗斯在乌克兰周围军事集结的报道，导致许多人指责俄罗斯政府对他们发起了“机器人”行动。\n基于公开的卫星图像，开源记者利用社交媒体对俄罗斯军队在乌克兰边境附近的活动提供稳定的评论，为西方情报报告提供了有价值的替代信息来源。\n被冻结账户背后的人表示，他们认为自己是俄罗斯机器人计算机攻击的目标，这些计算机模仿了大量报告其内容可疑的人类用户的活动。这导致他们的内容被Twitter的调节技术自动删除。\n“这是对新闻业和那些依靠这些账户在其他新闻媒体上发布事实的人的攻击，”拥有33.7万粉丝的@Conflicts联合创始人凯尔·格伦（Kyle Glen）说。\n“Twitter有责任确保自己的报告系统不会被个人或国家滥用。”\nTwitter向英国《金融时报》表示，没有证据表明存在协同的机器人行动，但承认该公司采取了“错误”的行动，暂停了大约12个被标记为包含被操纵或误导媒体的账户。\n它表示正在“迅速审查这些行动”，并已恢复了许多受影响的账户。\n停牌发生在乌克兰几家政府网站和银行因一系列网络攻击而暂时关闭的同时，这是乌克兰自年初以来的第三次网络攻击。基辅将之前的两次袭击归咎于俄罗斯。\n推特账户几乎同时被暂停，这引发了人们的怀疑，即俄罗斯的行动可能是这些行动的幕后黑手。俄罗斯经常在其网络行动中使用代理组织，这样它就可以否认任何攻击的消息，尽管西方官员和网络专家认为这些组织代表莫斯科行事。\n@ositetechnical拥有8.3万名粉丝，英国《金融时报》已对其身份进行了独立核实。他说：“许多人昨晚在协调世界时11点51分看到自己的账户被锁定。”。\n他补充说：“账户锁定的模式表明，Twitter为处理账户报告而安装的自动功能被触发。实际上，一些‘人’同时用报告轰炸这些账户，激活了Twitter区块。”。\n尽管开源情报提供了一些令人震惊的军事行动细节图像，但分析人士表示，它只显示了正在发生的事情的一小部分。他们的报告（通常在Twitter上）独立地证实了公开发布的西方情报简报，并为其提供了可信度。\n“西方政府从（开放的）情报领域学到了很多关于信息战领域的知识，”英国特勤局前局长亚历克斯·杨格爵士说。\n他周三在英国《金融时报》的一个论坛上表示：“这一轮的表现要好得多，原因之一是有开源（情报）来检查他们的言论，这提高了他们的可信度。”。\n©2022金融时报有限公司。保留所有权利，不得以任何方式重新分发、复制或修改。", "note_en": "Twitter said it had mistakenly suspended the accounts of open source intelligence reporters posting about Russia’s military build-up around Ukraine, leading to many of them accusing the Russian state of launching a “bot” campaign against them.\n Based on publicly available satellite imagery, open source reporters have used social media to supply a steady commentary on the activities of Russian forces near the Ukrainian border, providing a valuable alternative source of information to Western intelligence reports.\n The people behind the suspended accounts said they believed they had been the target of an attack by Russian bots—computers that mimic the activity of human users—that had mass-reported their content as being suspicious. This led their content to be removed automatically by Twitter’s moderation technology.\n “It is an attack on journalism and people who rely on these accounts to post the facts over other news outlets,” Kyle Glen, co-founder of @Conflicts, which has 337,000 followers, said.\n “Twitter has... a responsibility to ensure its own reporting systems aren’t being misused by individuals or nations.”\n Twitter told the Financial Times that there was no evidence of a coordinated bot campaign but admitted the company had taken action “in error,” suspending around a dozen accounts that had been flagged as containing manipulated or misleading media.\n It said it was “expeditiously reviewing these actions” and had reinstated many of the affected accounts.\n    The suspensions took place at around the same time as several Ukrainian government websites and banks were temporarily shut down after a series of cyber attacks—Ukraine’s third since the beginning of the year. Kyiv has blamed the two prior attacks on Russia.\n That the Twitter accounts were suspended almost simultaneously fed suspicions that a Russian operation may have been behind the moves. Russia often uses proxy groups in its cyber operations so it can deny knowledge of any attack, even though the groups are believed by Western officials and cyber experts to act for Moscow.\n “A number of... individuals saw their accounts locked at exactly 11:51 UTC last night,” said @Osinttechnical, who has 83,000 followers and whose identity the FT has independently verified.\n “The pattern of the account lockings indicates that the automatic features Twitter installed to handle account reports were triggered. In effect, a number of ‘people’ bombarded these accounts with reports at the same time, activating the Twitter blocks,” he added.\n  Although open source intelligence has provided some startlingly detailed images of military movements, analysts say it only shows a fraction of what is going on. Their reports, often on Twitter, have independently corroborated the publicly released Western intelligence briefings and lent credibility to them.\n “Western governments have learned a lot about the information warfare space... from [the] open intelligence space,” Sir Alex Younger, former head of the UK’s secret service, said.\n “It’s been a much better performance this time round and one of the reasons why is that there has been open source [intelligence] to check on what they are saying, which has raised their credibility,” he told an FT forum on Wednesday.\n © 2022 The Financial Times Ltd.  All rights reserved Not to be redistributed, copied, or modified in any way.", "posttime": "2022-02-25 13:33:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,承认,admits,账户", "title": "Twitter承认它错误地删除了乌克兰的开源情报账户", "title_en": "Twitter admits it mistakenly removed Ukraine open-source intelligence accounts", "transed": 1, "url": "https://arstechnica.com/tech-policy/2022/02/twitter-admits-it-mistakenly-removed-ukraine-open-source-intelligence-accounts/", "via": "", "real_tags": ["开源", "承认", "admits", "账户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074867, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德克萨斯州前总统&#39；电网表示，去年决定维持高电价#39；他的暴风雨来自州长。\n正是德克萨斯州州长格雷格·雅培的错误，在国家致命的2021冬季暴风雪中，即使危机结束，电力价格也一闪而过，国家电力网的前高级官员星期三证实了这一点。这一说法与州长办公室的官方说法相矛盾，后者坚称雅培与导致纳税人损失数十亿美元的决定无关。\n比尔·马格纳斯是德州电力可靠性委员会（Electric Reliability Council of Texas，ERCOT）的前主席兼首席执行官，该委员会负责管理该州的电网。本周，他在破产法院出庭作证，这是总部位于韦科的电力合作公司Brazos Electric提起的听证会的一部分。这场混乱的核心是ERCOT在去年历史性的冬季风暴期间做出的一项关键决定，即在电力供应开始恢复正常一天后，尽管全州的停电已经结束，但仍保持高电价。\n这一举措最终使电力供应商额外付出160亿美元的成本；布拉索斯则声称，仅这一决定就让它损失了19亿美元，从而导致它破产。（当然，电力公司并不是唯一一家在这一举措中受到打击的公司。一些客户还看到了风暴过后天文数字的电费账单。）\n去年的致命风暴导致数百万德克萨斯人数天没有供暖，暴露了该州电网的巨大潜在问题后，埃尔科特清理了房屋。虽然该组织的一些官员走得很优雅，但马格尼斯坚持了下来，为埃尔科特在寒流期间选择性地切断一些客户电源的决定辩护，最终被董事会解雇。\n但马格尼斯周三的证词为那些命运多舛的日子究竟是如何过去的提供了新的线索。在2月中旬风暴的最后几天，电价上限为每兆瓦时9000美元，是正常价格的150多倍。马格内斯现在表示，在发电厂恢复运行的同时保持这些费率的决定来自州长。他作证说，这位现任公共事业委员会前主席告诉他，“州长已向她传达，如果我们从轮流停电中恢复，他们就必须停止工作。我们需要做我们需要做的事情来实现这一点。”\n马格尼斯说，在危机的最后几天将电价维持在高位的决定，是临市局鼓励发电厂恢复供电，并让工业设施等大型电力用户离线，以节省应急电力储备的一种尝试。然而，将价格保持在如此高的水平如此之久以及由此给系统带来的巨大成本，受到了监管机构的广泛批评，认为这是不明智的，超出了委员会的权力范围，似乎没有人愿意承担责任。（顺便说一句，包括美国银行、摩根士丹利和高盛在内的大型非国有银行确实从价格上涨中获利，并且在去年与一名前公用事业委员会雇员的一次电话录音中被发现，他向他们保证，他正在努力帮助他们保持利润。）\n在去年一次关于埃尔科特在这场混乱中所扮演角色的会议上，雅培的一位发言人表示，州长办公室与这一决定无关，尽管在决定维持高价格时，雅培办公室的一名助手在埃尔科特总部。\n“正如得克萨斯人所料，州长阿伯特指示所有相关人员，他们必须采取必要的措施来保持电力供应，防止人员伤亡，”阿伯特的一名发言人周三告诉《休斯顿纪事报》。“这与阿博特州长今年早些时候（在寒流期间）给临时市政局和ERCOT的指示是一样的：做需要做的事情来保持电力供应。”\n民主党候选人贝托·奥鲁克（Beto O’Rourke）是雅培在德克萨斯州即将举行的州长选举中的对手，长期以来，他一直在为政府在大停电期间的失败进行竞选活动。奥洛克发布了几条推特，抨击雅培参与了这一决定。鉴于雅培很容易就风能在停电事件中的作用编造谎言，并一直过分强调电网的可靠性，如果他在这方面也在捏造事实，我们也不会感到惊讶。", "note_en": "The former head of Texas&#39; power grid said a decision to keep electricity prices high during last year&#39;s storm came from the governor.\n It’s Texas Governor Greg Abbott’s fault that power prices during the state’s deadly 2021 winter storm shot through the roof even as the crisis was ending, a former top official with the state’s power grid testified Wednesday. This claim contradicts the official line from the governor’s office, which has maintained that Abbott had nothing to do with the decision that cost ratepayers billions of dollars.\n  Bill Magness, the former President and CEO of the Electric Reliability Council of Texas (ERCOT), which runs the state’s power grid,   took the stand this week in bankruptcy court as part of a hearing brought by Brazos Electric, an electric co-op based in Waco. At the center of the mess is a key decision made by ERCOT during last year’s historic winter storm to keep electricity prices high, even as outages were ending across the state, for more than a day after things started to return to normal.\n That move ultimately cost power providers an extra $16 billion in costs; Brazos, for its part, is claiming that the decision cost it $1.9 billion alone, which dragged it into bankruptcy. (Power companies, of course, aren’t the only ones who got the short end of the stick in this move. Some customers also   saw astronomical power bills following the storm.)\n    After last year’s deadly storm left millions of Texans without heat for days and exposed enormous, underlying problems with the state’s electric grid, ERCOT cleaned house. While some of the organization’s officials went gracefully, Magness dug in, defending ERCOT’s decision to selectively cut power for some customers during the cold snap before ultimately   being given the boot by the board.\n  But Magness’s testimony on Wednesday shed new light on how those fated days may have actually gone down. During the final days of the storm in mid-February, power prices were capped at more than 150 times normal at $9,000 per megawatt hour. Magness is now saying that the decision to keep those rates even as power plants were coming back online came from the governor. He testified that the now former Public Utility Commission Chairwoman told him that “the governor had conveyed to her if we emerged from rotating outages it was imperative they not resume. We needed to do what we needed to do to make it happen.”\n   The decision to keep prices high in the final days of the crisis, Magness said, was an attempt by the PUC to encourage power plants to come back online and to keep big power users like industrial facilities offline, in order to conserve emergency power reserves. However, the move to keep prices so high for so long and the enormous resulting cost to the system has been widely criticized by watchdogs as ill-advised and exceeding the scope of the Commission’s power—and, it seems, no one wants to step up to the plate to take the blame. (By the way, big out-of-state banks, including Bank of America, Morgan Stanley, and Goldman Sachs  did profit from the inflated prices, and were   caught on a recorded call last year with a former Public Utility Commission employee who assured them he was working to help them keep their profits.)\n At a meeting last year on ERCOT’s role in the mess, a spokesperson for Abbott said the governor’s office had   nothing to do with the decision—despite an aide from Abbott’s office being at ERCOT headquarters at the time the decision to keep prices high was made.\n  “As Texans would expect, Governor Abbott instructed everyone involved that they must do what was needed to keep the power on and to prevent the loss of life,” a spokesperson for Abbott told the Houston Chronicle Wednesday. “This is the same instruction Governor Abbott gave to the PUC and ERCOT (during a cold snap) earlier this year: Do what needs to be done to keep the power on.”\n  Democratic candidate Beto O’Rourke, an opponent for Abbott in Texas’ upcoming gubernatorial election has long been campaigning on the government’s failures during the blackout. O’Rourke   released   several   tweets blasting Abbott’s involvement in the decision. Given how easily Abbott   threw around falsehoods about wind energy’s role in the blackouts and has   consistently overpromised on the   grid’s solidity, we wouldn’t be surprised if he was fudging the truth when it comes to this too.", "posttime": "2022-02-25 13:31:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表示,high,决定", "title": "前电网首席执行官表示，阿伯特州长应该为高电价承担数十亿美元的责任。德克萨斯州电网前负责人表示，在去年的风暴中，州长做出了维持高电价的决定。", "title_en": "Gov. Abbott to Blame for Billions in High Electric Prices, Former Grid CEO Says | The former head of Texas' power grid said a decision to keep electricity prices high during last year's storm came from the governor.", "transed": 1, "url": "https://gizmodo.com/gov-abbott-to-blame-for-billions-in-high-electric-pric-1848584598", "via": "", "real_tags": ["表示", "high", "决定"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074866, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络安全公司寻求志愿者帮助国家军队对俄罗斯军队进行间谍活动\n据两名参与该项目的人士透露，乌克兰政府要求该国地下黑客提供志愿者，帮助保护关键基础设施，并对俄罗斯军队执行网络间谍任务。\n随着俄罗斯军队袭击乌克兰各地的城市，周四上午，随着许多居民逃离首都基辅，黑客论坛上开始出现招募志愿者的请求。\n“乌克兰网络社区！是时候参与我们国家的网络防御了，”帖子写道，要求黑客和网络安全专家通过谷歌文档提交申请，列出他们的专长，如恶意软件开发和专业参考。\n基辅一家网络安全公司的联合创始人耶戈尔·奥舍夫告诉路透社，他是应周四与他联系的国防部高级官员的要求写这篇文章的。Aushev的公司Cyber Unit Technologies因与乌克兰政府合作防御关键基础设施而闻名。\n另一位直接参与这项工作的人士证实，这项请求是国防部在周四上午提出的。\n乌克兰国防部代表没有回应置评请求。乌克兰驻华盛顿大使馆的一名国防武官表示，他“无法确认或否认来自移动通讯平台的电报渠道的信息”，并拒绝进一步置评。\n奥舍夫说，志愿者将分为防御和进攻网络部队。防御部队将被用于防御发电厂和供水系统等基础设施。在2015年的一次网络攻击中，22.5万乌克兰人失去了电力，这一攻击被广泛归因于俄罗斯国家黑客。\n进攻性志愿部队奥舍夫说，他正在组织一支将帮助乌克兰军队对入侵的俄罗斯军队进行数字间谍行动的部队。\n“我们在国内有一支军队，”奥舍夫说。“我们需要知道他们在做什么。”据网络安全公司ESET的研究人员称，周三，一个新发现的破坏性软件在乌克兰流通，击中了数百台计算机。怀疑落到了俄罗斯身上，俄罗斯曾多次被指控对乌克兰和其他国家进行黑客攻击。路透社此前报道称，受害者包括政府机构和一家金融机构。\n奥舍夫承认，建立网络军事力量的努力来得晚。\n据《华盛顿邮报》报道，乌克兰一名安全官员本月早些时候表示，该国没有专门的军事网络部队。“我们今年的任务是创建它们，”他告诉《华盛顿邮报》。\n周四深夜抵达乌克兰的奥舍夫说，他已经收到数百名申请者，并将开始审查，以确保他们中没有一人是俄罗斯特工。", "note_en": "Cybersecurity firm seeks volunteers to help nation’s military conduct espionage operations against Russian forces\n    The government of  Ukraine is asking for volunteers from the country’s hacker underground to help protect critical infrastructure and conduct cyber spying missions against Russian troops, according two people involved in the project.\n As Russian forces attacked cities across Ukraine, requests for volunteers began to appear on hacker forums on Thursday morning, as many residents fled the capital Kyiv.\n  “Ukrainian cybercommunity! It’s time to get involved in the cyber defense of our country,” the post read, asking hackers and cybersecurity experts to submit an application via Google docs, listing their specialties, such as malware development, and professional references.\n Yegor Aushev, the co-founder of a cybersecurity company in Kyiv, told Reuters he wrote the post at the request of a senior Defense Ministry official who contacted him on Thursday. Aushev’s firm Cyber Unit Technologies is known for working with Ukraine’s government on the defense of critical infrastructure.\n Another person directly involved in the effort confirmed that the request came from the Defense Ministry on Thursday morning.\n  Ukraine Defense Ministry representatives did not respond to a request for comment. A defense attache at Ukraine’s embassy in Washington said he “cannot confirm or deny information from Telegram channels” referring to the mobile messaging platform, and declined further comment.\n Aushev said the volunteers would be divided into defensive and offensive cyber units. The defensive unit would be employed to defend infrastructure such as power plants and water systems. In a 2015 cyber-attack, widely attributed to Russia state hackers, 225,000 Ukrainians lost electricity.\n The offensive volunteer unit Aushev said he is organizing would help Ukraine’s military conduct digital espionage operations against invading Russian forces.\n “We have an army inside our country,” Aushev said. “We need to know what they are doing.” On Wednesday, a newly discovered piece of destructive software was found circulating in Ukraine, hitting hundreds of computers, according to researchers at the cybersecurity firm ESET. Suspicion fell on Russia, which has repeatedly been accused of hacks against Ukraine and other countries. The victims included government agencies and a financial institution, Reuters previously reported.\n  The effort to build a cyber military force is coming late in the game, Aushev acknowledged.\n A Ukrainian security official said earlier this month that the country had no dedicated military cyber force, the Washington Post reported. “It’s our task to create them this year,” he told the Washington Post.\n Reached late Thursday night in Ukraine, Aushev said he already had received hundreds of applicants and was going to begin vetting to ensure that none of them were Russian agents.", "posttime": "2022-02-25 13:28:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,俄罗斯,呼吁,government,乌克兰", "title": "乌克兰政府呼吁黑客帮助防御俄罗斯", "title_en": "Ukrainian government calls on hackers to help defend against Russia", "transed": 1, "url": "https://www.theguardian.com/world/2022/feb/24/ukraine-hackers-defend-against-russia", "via": "", "real_tags": ["黑客", "俄罗斯", "呼吁", "乌克兰"]}]