[{"category": "", "categoryclass": "", "imagename": "62a45ddc49e773fd22182544d250b522.png", "infoid": 1030321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10月21日，欧盟委员会批准了新的欧盟委员会2020-2023年开源软件战略。这是朝着实现委员会总体数字战略的目标迈出的重要一步，并为数字欧洲方案作出贡献。\n内部战略以“思考开放”为主题，提出了鼓励和利用开放源码的变革、创新和协作力量、其原则和开发实践的愿景。它促进软件解决方案、知识和专业知识的共享和重用，以提供更好的欧洲服务，使社会受益，并降低社会成本。委员会承诺不仅在IT等实际领域，而且在具有战略意义的领域增加对开源的使用。\n鼓励软件和应用程序以及数据、信息和知识的共享和重用；\n该战略的实施将遵循6个原则：思想开放、转变、共享、贡献、安全、控制。在实践中，委员会旨在加强已经在很大程度上以开放源码原则为基础的内部工作文化，并通过以下具体行动实现该战略的目标：\n委员会已经将开源用于其许多关键的信息和通信技术服务和软件解决方案，并在内部增加了这类软件的作用。2014-2017年战略特别强调采购，为开源软件项目做出贡献，并提供更多在委员会内开发的软件作为开源软件。\n委员会在采购新的软件解决方案时，将确保为开源软件提供公平的竞争环境。这意味着开源解决方案和专有解决方案将在平等的基础上进行评估，两者都是在总拥有成本(包括退出成本)的基础上进行评估。\n欧盟委员会的服务将越来越多地参与开源软件社区，以建立在欧盟委员会软件中使用的开源构件之上。\n为了便于与开放源码社区合作，委员会的开发人员将受益于如何处理与开放源码软件有关的知识产权问题的适当法律指导和建议。\n欧盟委员会服务部门生产的软件，特别是为在委员会以外使用而生产的软件，将是开源的，并将在Joinup平台上发布，并将使用欧洲联盟公共许可证(EUPL)。所生产的软件应该以可互操作为目标，并使用开放的技术规范。\n该战略强调改善治理，在信息和通信技术安全领域更多地使用开放源码，并将这一战略与欧盟的ISA计划相结合，促进跨境和跨部门电子政务服务的现代化。\n1.委员会应继续通过产品管理程序正式采用开放源码软件技术和产品。\n2.委员会应确保开放源码软件有一个公平的竞争环境，并积极和公平地考虑使用开放源码软件--同时考虑到解决方案的所有权总成本。\n3.对于未来的所有信息技术发展，委员会应促进使用支持公认的、文件完备的、最好是开放的、可自由采用、实施和推广的技术规范的产品。互操作性对委员会来说是一个关键问题，而使用完善的标准是实现这一目标的关键因素。\n4.对于新信息系统的内部开发，特别是在欧共体基础设施之外的第三方预见到部署的情况下，应首选开放源码软件，并尽可能使用开放源码软件。\n5.委员会应进一步澄清有关开放源码软件内部使用的法律背景，并将这一澄清提供给有关各方。要讨论的主要议题包括：许可制度、知识产权、采购背景下的平等机会和参与开放源码软件社区。\n6.委员会应进一步制定准则和最佳做法，允许建立涵盖全套专业服务的开放源码软件和混合解决方案，包括在其数据中心以与专有服务相同的服务水平部署开放源码软件解决方案。\n7.委员会将继续开发和采用开放源码软件社区产生的最佳做法和工具，同时应用最先进的治理做法，特别是在安全领域。此外，欧共体将促进和促进为委员会发布的开放源码软件产品创建社区，并促进参与外部开放源码软件社区。\n8.开放源码软件在电子政务项目中发挥重要作用，因此应在这些活动的框架内加以考虑。\n9.委员会负责内部和外部开放源码软件战略的小组之间的协作应进一步加强，以实现趋同，特别是通过调整和重用ISA方案产生的经验证的解决方案。\n10.信息和通信技术生态系统极具活力、创新性和不断发展；因此，它影响到委员会政策的许多领域。在此背景下，Digit将继续在促进欧洲机构和其他利益攸关方之间以开放源码软件为重点的伙伴关系方面发挥积极作用。\n与该战略一起，已经制定了一项全面的行动计划，涉及上述所有10点。它计划在2015-2017年期间执行。\n这项行动计划涉及协调委员会不同服务的许多活动，以确保战略的原则在内部得到遵守。活动包括：\n由于这些行动主要是内部行动，可见的结果将是在采购方面提供平等机会、为开发商发布澄清、在已发布的开发项目中使用开放源码软件等。\n欧盟委员会的开源软件内部使用战略于2000年首次通过，自那以来已经更新了三次。\n委员会对开放源码软件的使用有所增加，并且随着每一个新版本的推出都扩展到新的领域。\nEU-Fossa项目-自由和开放源码软件审计的缩写-旨在提高关键开放源码软件的安全性和完整性。它是在2014年发现心脏出血漏洞后，在欧洲议会的煽动下由欧盟委员会发起的…更多关于欧盟窝点的信息", "note_en": "On October 21st, the European Commission approved the new Open Source Software Strategy 2020-2023 of the Commission. This is an important step towards achieving the goals of the overarching  Digital Strategy of the Commission and contributing to the Digital Europe programme.\n The internal strategy, under the theme ‘’Think Open’’, sets out a vision for encouraging and leveraging the transformative, innovative and collaborative power of open source, its principles and development practices. It promotes the sharing and reuse of software solutions, knowledge and expertise, to deliver better European services that benefit society and lower costs to that society. The Commission commits to increasing its use of open source not only in practical areas such as IT, but also in areas where it can be strategic.\n   Encourage sharing and reuse of software and applications, as well as data, information and knowledge;\n The implementation of the strategy will be guided by 6 principles:  think open, transform, share, contribute, secure, stay in control. In practice, the Commission aims to reinforce an internal working culture that is already largely based on the principles of open source and achieve the goals of the strategy by the following  concrete actions:\n   The Commission, which is already using open source for many of its key ICT services and software solutions, has increased the role of this type of software internally. The 2014-2017 strategy puts a special emphasis on procurement, contribution to open source software projects and providing more of the software developed within the Commission as open source.\n   The Commission will ensure a level playing field to open source software when procuring new software solutions. This means that open source solutions and proprietary solutions will be assessed on an equal basis, being both evaluated on the basis of total cost of ownership, including exit costs.\n  The Commission services will increasingly participate in open source software communities to build on the open source building blocks which are used in the Commission&#39;s software.\n  In order to enable easy collaboration with the open source communities, Commission developers will benefit from appropriate legal coaching and advice on how to deal with the intellectual property issues relating to open source software.\n  Software produced by the Commission services, in particular software produced with the objective of being used outside the Commission, will be open sourced and published on the Joinup platform and will use the European Union Public License (EUPL). The software produced should aim to be interoperable and use open technical specifications.\n  The strategy emphasises an improved governance, an increasing use of open source in the domain of ICT security and the alignment of this strategy with the EC’s ISA Programme, facilitating the modernisation of cross border and cross sector eGovernment services.\n 1. The Commission shall continue to adopt formally, through the Product Management procedure, the use of OSS technologies and products.\n 2. The Commission shall ensure a level playing field for open source software and demonstrate an active and fair consideration of using open source software – taking account of the total cost of ownership of the solution.\n 3. For all future IT developments, the Commission shall promote the use of products that support recognised, well-documented and preferably open technical specifications that can be freely adopted, implemented and extended. Interoperability is a critical issue for the Commission, and use of well-established standards is a key factor to achieve it.\n 4. For the internal development of new information systems, in particular where deployment is foreseen by third parties outside the EC infrastructure, OSS shall be the preferred choice and used whenever possible.\n 5. The Commission shall further clarify the legal context around the internal use of OSS and make this clarification available to interested parties. The main topics to be addressed include: licensing schemes, Intellectual Property Rights, equal opportunities in the context of procurement and participation in OSS communities.\n 6. The Commission shall further develop guidelines and best practices allowing the setup of OSS and mixed solutions covering the full set of professional services, including deployment of OSS solutions in its data centres at the same level of service as the proprietary ones.\n 7. The Commission shall continue to develop and adopt best practice and tools emerging from OSS communities while applying state-of-the-art governance practices, particularly in the domain of security. In addition, the EC will facilitate and promote the creation of communities for those OSS products released by the Commission and facilitate participation in external OSS communities.\n 8. OSS plays an important role in e-Government projects and shall be therefore considered within the framework of these activities.\n 9. The collaboration between Commission teams in charge of the internal and external OSS strategies shall be further enhanced in order to achieve convergence, in particular through alignment with and reuse of validated solutions produced by the ISA programme.\n 10. The ICT ecosystem is extremely dynamic, innovative, and constantly evolving; as such it impacts many areas of the Commission&#39;s policies. Within this context, DIGIT shall continue to play an active role in promoting partnerships focusing on OSS between the European Institutions and other stakeholders.\n  Together with the strategy, a comprehensive action plan has been created, addressing all 10 points above. It is scheduled for execution during the period 2015-2017.\n This action plan involves coordination of many activities with different services at the Commission in order to ensure that the principles of the strategy are followed internally. The activities include:\n As these actions are mostly internal, the visible outcome will be the provision of equal opportunities in procurement, publication of the clarifications for developers, usage of the OSS in published developments, etc. as expressed in the strategy.\n  The Commission&#39;s strategy for the internal use of Open Source Software was first adopted in 2000, and has since been updated three times.\n  The use of open source software at the Commission increases and is extended to new areas with every new version.\n  The EU-FOSSA project – short for Free and Open Source Software Auditing – aims to increase the security and integrity of critical open source software. It was launched by the European Commission at the instigation of the European Parliament after the discovery of the Heartbleed bug in 2014...More about  EU FOSSA", "posttime": "2020-10-22 03:26:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,2020,软件,commission", "title": "欧盟委员会批准新的开源软件战略2020-2023年", "title_en": "European Commission approved the new Open Source Software Strategy 2020-2023", "transed": 1, "url": "https://ec.europa.eu/info/departments/informatics/open-source-software-strategy_en", "via": "", "real_tags": ["开源", "2020", "软件"]}, {"category": "", "categoryclass": "", "imagename": "871e1e2e03371b9877b22f149cf413ab.jpg", "infoid": 1030320, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "司法部周三宣布，奥施康定(OxyContin)的制造商普渡制药(Purdue Pharma)已同意对其营销这种令人上瘾的止痛药的刑事指控认罪，并面临约83亿美元的罚款。这项和解协议可能会为解决数千起针对该公司的诉讼铺平道路。自1999年以来，这场公共卫生危机已导致超过45万美国人死亡。\n该公司的所有者，富裕的萨克勒家族成员，已经同意支付2.25亿美元的民事罚款。检察官表示，该协议并不排除对普渡高管或个人萨克勒提起刑事指控。\n联邦和解协议并没有结束针对普渡的所有广泛诉讼，但它确实代表着各州、部落、市和县在追究最著名的阿片制造商责任的漫长法律游行中取得的重大进展。\n在交易宣布后发布的一份声明中，公司董事会主席史蒂夫·米勒(Steve Miller)表示：“普渡对司法部在商定的事实声明中详述的不当行为深感遗憾，并接受责任。”\n萨克勒家族成员在一份声明中表示，他们的行为“合乎道德和合法”。这份家族声明代表曾在公司董事会任职的成员发布，并补充道：“董事会依赖于普渡管理团队反复且一致的保证，即公司符合所有法律要求。”\n奥施康定于90年代中期上市，被视为阿片类药物流行的早期、凶猛的推动者，普渡被认为是肌肉发达、具有误导性的药物营销的设计师。但该公司不太可能支付接近和解协议中谈判的83亿美元的任何费用。这是因为普渡在诉讼的猛烈冲击中寻求破产法院的保护，因此联邦政府现在将不得不在一长串债权人中占据一席之地。通常情况下，债权人最终会在破产程序中收取面值的几分钱。\n和解协议确实给司法部和特朗普政府带来了一项备受瞩目的成就，总统可以在竞选活动中兜售这一成就。特朗普赢得2016年大选的部分原因是，他誓言要对抗阿片成瘾危机，这场危机已经席卷了美国的大片地区，在重要的摇摆州仍然是一个问题。\n但来自马萨诸塞州、纽约州和北卡罗来纳州等州的总检察长提出了问题，即和解协议对追究萨克勒家族的责任到底会产生多大影响。普渡大学热衷于在特朗普政府的领导下解决联邦法律问题，它感觉特朗普政府会比拜登新政府达成更好的协议。作为民事和解的一部分，萨克勒夫妇将支付2.25亿美元，与家族净资产相比，这笔钱很小。据估计，萨克勒家族的净资产至少为130亿美元，其中大部分来自出售奥施康定(OxyContin)。\n乔·赖斯(Joe Rice)是正在起诉普渡的地方政府的谈判代表，他说：“普渡正在尽其所能在本届政府中完成这笔交易。这对双方都是有利的。“。\n这起针对普渡的联邦案件与数千起针对其他药品制造商以及分销商和药房连锁店的阿片类药物相关诉讼不同，这些诉讼仍在联邦和州法院待决。\n普渡长期以来一直要求，在同意与城市、部落、州和个人达成更大规模的和解之前，对其的联邦指控必须得到解决。这些城市、部落、州和个人声称，其对OxyContin的无情营销直接导致了成瘾和吸毒过量的危机，导致医疗保健、执法和失业方面的高昂成本。接近谈判的律师预计，最终和解方案可能会在明年初出现。\n在联邦和解协议中，该公司同意承认欺诈联邦卫生机构和违反反回扣法律的重罪指控。罚金包括35.4亿美元的刑事罚款和20亿美元的刑事没收利润，这是有史以来对制药商开出的最大罚单。该公司承认向100多名医生销售阿片类药物，怀疑这些医生开了非法处方，并在这一点上向联邦药品监督管理局撒谎。\n普渡还承认向医生和电子健康记录公司Practice Fusion支付非法回扣。今年1月，Practice Fusion因收受药品制造商的回扣而支付了1.45亿美元的罚款，以换取向医生嵌入弹出式警报，旨在增加阿片类药物的处方。\n普渡大学的和解协议还包括28亿美元的民事罚款，相关指控称，该公司使用激进的营销策略说服医生开出不必要的阿片类药物-这些轻率的处方助长了困扰美国数十年的毒瘾危机，违反了《虚假索赔法案》(False Claims Act)。这些处方通常由联邦医疗保险(Medicare)和医疗补助(Medicaid)等联邦医疗保健计划支付。\n普渡董事长米勒表示，司法部指控的解决是该公司破产重组的重要一步。“普渡今天是一家非常不同的公司，”他补充道。“我们在领导层、运营、治理和监督方面进行了重大变革。”\n这是自2007年以来，普渡大学首次承认在其药物问题上误导医生、患者和政府的联邦刑事指控。当时，该公司支付了6亿美元的罚款。\n为了解决数千起当地诉讼，普渡提出了一项全球和解方案，其估值约为100亿美元。这一数字包括仍在开发中的药物未来的利润，以及萨克勒夫妇30亿美元的捐款，这与萨克勒家族同意向联邦政府支付的2.25亿美元是分开的。\n一年前，在阿片类药物诉讼的重压下，普渡申请破产，预计它将在某个时候作为一家新公司出现。至少另外两家阿片制造商，Insys治疗公司和Mallinckrodt，也因为诉讼而寻求破产保护。\n负责纽约州怀特普莱恩斯普渡(Purdue)破产案的法官罗伯特·D·德雷恩(Robert D.Drain)将不得不批准联邦和解协议的条款，并将与一长串无担保债权人一起审查数十亿美元的联邦罚款。普渡在联邦协议中表示，当破产最终敲定时，它将在公共网站上发布与起诉相关的文件。\n但一桶制裁，即20亿美元的刑事没收利润，更有可能得到全额支付。司法部周三表示，它将要求普渡直接向美国财政部支付仅2.25亿美元，但将为市政、州和部落预留17.75亿美元，条件是他们必须将这笔钱用于缓解当地的阿片类药物危机。\n和解的第二个条件引发了大约20多个州总检察长的强烈抗议：普渡在从破产中脱颖而出后的所有权。\n普渡提议将该公司作为一家“公益公司”运营，继续有限销售OxyContin的收益，以及几种正在开发的逆转过量药物的收益，用于阿片类药物的减少。司法部认可这一模式。\n但在本月早些时候写给司法部长威廉·P·巴尔(William P.Barr)的一封强有力的信中，州总检察长谴责了这种公共信托模式。他们说，政府不应该从事阿片类药物业务。相反，他们认为普渡应该在政府的监督下私人经营。\n对新和解协议的另一个反对意见集中在解决针对个人松弛者的民事索赔问题上，这些索赔是由提起诉讼的私人家庭提出的。普渡大学去年的一项法医审计发现，萨克勒夫妇将公司收益中的至少107亿美元转移到了家族控制的信托基金和控股公司，尽管普渡大学正面临法律审查。萨克勒夫妇说，这些收益中的大部分都用于纳税。\n在给巴尔的一封信中，阿片类药物受害者的亲属联盟表示，这项协议为时过早，而且太少了。\n例如，马萨诸塞州已安排在11月对一些Sackler进行证词陈述，在此期间，更多信息可能会曝光。\n“司法部失败了，”马萨诸塞州总检察长莫拉·希利(Maura Healey)说。“在这种情况下，正义需要揭露真相，追究肇事者的责任，而不是仓促达成和解以击败选举。我与普渡和萨克勒夫妇的关系还没有结束，我永远不会出卖那些呼吁正义这么久的家庭。“。\n在关于联邦和解的新闻发布会上，司法部副部长杰弗里·A·罗森(Jeffrey A.Rosen)驳斥了批评人士的说法，即该协议对普渡和萨克勒家族不够严厉。他说，该部门已经对普渡采取了“非常实质性”和“非常重大”的惩罚行动，普渡承认了三项刑事指控，他还指出，普渡家族将交出公司的所有权。\n关于萨克勒夫妇的一个有争议的问题是，萨克勒家族本身并没有寻求破产保护，一直在寻求摆脱诉讼，作为解决普渡索赔的条件。\n赖斯是数千个地方政府的谈判代表，他支持公共利益信托的广泛轮廓。“你必须弄清楚如何处理可能对一些阿片类药物的有限需求。如果你完全摧毁了普渡资产，你就不会使其价值最大化。“他说。“你要确保那些滥用毒品销售权的人为他们的所作所为付出代价。萨克勒夫妇失去了他们的名字，他们的公司，甚至更多。", "note_en": "Purdue Pharma, the maker of OxyContin, has agreed to plead guilty to criminal charges related to its marketing of the addictive painkiller, and faces penalties of roughly $8.3 billion, the Justice Department announced on Wednesday. The settlement could pave the way for a resolution of thousands of lawsuits brought against the company for its role in a public health crisis that has  killed more than 450,000 Americans since 1999.\n The company’s owners, members of the wealthy Sackler family, have agreed to pay $225 million in civil penalties. Prosecutors said the agreement did not preclude the filing of criminal charges against Purdue executives or individual Sacklers.\n The federal settlement does not end all of the extensive litigation against Purdue, but it does represent a significant advance in the long legal march by states, tribes, cities and counties to hold the most prominent opioid maker accountable.\n In a statement issued after the announcement of the deal, Steve Miller, chairman of the company board, said: “Purdue deeply regrets and accepts responsibility for the misconduct detailed by the Department of Justice in the agreed statement of facts.”\n Members of the Sackler family said in a statement that they “acted ethically and lawfully.” Issued on behalf of members who had served on the company’s board, the family statement added: “The board relied on repeated and consistent assurances from Purdue’s management team that the company was meeting all legal requirements.”\n OxyContin, which came on the market in the mid-90s, is seen as an early, ferocious driver of the opioid epidemic and Purdue is regarded as the architect of muscular, misleading drug marketing. But it is unlikely the company will pay anything close to the $8.3 billion negotiated in the settlement deal. That is because Purdue sought bankruptcy court protection amid the onslaught of lawsuits, and so the federal government will now have to take its place in a long line of creditors. Typically, creditors end up collecting pennies on the dollar in bankruptcy proceedings.\n The settlement does give the Justice Department and the Trump administration a high-profile achievement that the president can tout on the campaign trail. Mr. Trump won the 2016 election in part because he vowed to combat an opioid addiction crisis that had gripped large swaths of the country and continues to be an issue in important swing states.\n But state attorneys general from Massachusetts, New York and North Carolina, among others, have raised questions about just how much of an effect the settlement will have with respect to holding the Sackler family to account. Purdue was keen to settle its federal legal troubles under a Trump administration, which it sensed would cut a more better deal than a new Biden administration. The $225 million that the Sacklers would pay as part of their civil settlements is small relative to the family’s net worth, estimated to be  at least $13 billion, much of it generated from sales of OxyContin.\n Joe Rice, a negotiator for local governments that are suing Purdue, said, “Purdue is doing everything they can to get this deal done in this administration. It’s advantageous to both sides.”\n This federal case against Purdue is distinct from thousands of opioid-related lawsuits against other drug manufacturers, as well as distributors and pharmacy chains, still pending in federal and state courts.\n Purdue has long demanded that the federal charges against it be resolved before it would agree to a larger settlement with cities, tribes, states and individuals, who claim that its relentless marketing of OxyContin directly contributed to a crisis of addiction and overdoses, resulting in towering costs in health care, law enforcement and unemployment. Lawyers close to negotiations expect that the final settlement may emerge early next year.\n In the federal settlement, the company agreed to plead guilty to felony charges of defrauding federal health agencies and violating  anti-kickback laws. The penalties include $3.54 billion in criminal fines and $2 billion in criminal forfeiture of profits, the largest penalties ever levied against a pharmaceutical manufacturer. The company pleaded guilty to marketing opioids to more than 100 doctors that it suspected of writing illegal prescriptions and lying about this to the federal Drug Enforcement Administration.\n Purdue also pleaded guilty to paying illegal kickbacks to doctors and to an electronic health records company, Practice Fusion. In January Practice Fusion paid $145 million in fines for  taking kickbacks from drug manufacturers in exchange for embedding pop-up alerts to physicians, intended to boost opioid prescriptions.\n The Purdue settlement also includes $2.8 billion in civil penalties, related to allegations that the company violated the False Claims Act by using aggressive marketing tactics to convince doctors to unnecessarily prescribe opioids — frivolous prescriptions that experts say helped fuel a drug addiction crisis that has ravaged America for decades. Those prescriptions were often paid for by federal health care programs like Medicare and Medicaid.\n Mr. Miller, the Purdue chairman, said that the resolution of the Justice Department’s charges was an essential step in the company’s bankruptcy restructuring. “Purdue today is a very different company,” he added. “We have made significant changes to our leadership, operations, governance and oversight.”\n This is the first time since 2007 that Purdue has pleaded guilty to  federal criminal charges for misleading doctors, patients and the government about its drug. At the time, the company paid $600 million in fines.\n To resolve thousands of local lawsuits, Purdue has proposed a global settlement that it values at about $10 billion. That figure includes future profits from drugs still in development as well as a $3 billion contribution from the Sacklers, which is separate from the $225 million the family has agreed to pay the federal government.\n A year ago, under the weight of opioid litigation, Purdue filed for bankruptcy, and it is expected to emerge at some point as a new company. At least two other opioid manufacturers,  Insys Therapeutics and  Mallinckrodt, have also sought bankruptcy protection because of litigation.\n Judge Robert D. Drain, who is overseeing the Purdue bankruptcy case in White Plains, N.Y., will have to approve the terms of the federal settlement and will review the billions of dollars in federal penalties alongside a long line of unsecured creditors. When the bankruptcy is finalized, Purdue said in the federal agreement, it would post documents related to the prosecutions on a public website.\n But one bucket of sanctions, the $2 billion in criminal forfeiture of profits, is more likely to be paid in full. The Justice Department said on Wednesday that it would require that Purdue directly pay the U.S. Treasury just $225 million, but would earmark the remaining $1.775 billion for municipalities, states and tribes, on condition that they allocate the money to abate local opioid crises.\n A second condition of the settlement has prompted an outcry from some two dozen state attorneys general: the ownership of Purdue, after it emerges from bankruptcy.\n Purdue has proposed that the company be run as a “public benefit corporation,” with proceeds from continuing limited sales of OxyContin and several overdose-reversing medications under development to go toward opioid abatement. The Justice Department endorses that model.\n But in a  forceful letter addressed to Attorney General William P. Barr earlier this month, the state attorneys general decried the public trust model. Governments should not be in the opioid business, they said. Instead, they argued that Purdue should be run privately, with government oversight.\n Another objection to the new settlement centers on the resolution of civil claims against individual Sacklers, raised by  private families who are suing.  A forensic audit last year by Purdue found that the Sacklers directed at least $10.7 billion in the company’s proceeds to family-controlled trusts and holding companies, even as Purdue was facing legal scrutiny. Much of those proceeds, the Sacklers have said, went toward tax payments.\n In a letter to Mr. Barr, a coalition of relatives of opioid victims said the agreement was premature and too little.\n Massachusetts, for example, has scheduled depositions against some Sacklers in November, during which more information may come to light.\n “The D.O.J. failed,” said Maura Healey, the Massachusetts attorney general. “Justice in this case requires exposing the truth and holding the perpetrators accountable, not rushing a settlement to beat an election. I am not done with Purdue and the Sacklers, and I will never sell out the families who have been calling for justice for so long. ”\n During a news briefing on the federal settlement, Deputy Attorney General Jeffrey A. Rosen pushed back on critics who said that the deal was not tough enough on Purdue and the Sackler family. He said that the department had taken “very substantial” and “very significant” punitive action against Purdue, which pleaded guilty to three criminal charges, and he noted that the family would turn over ownership of the company.\n A contentious issue with respect to the Sacklers is that the  family itself is not seeking bankruptcy protection and has been seeking release from litigation as a condition of settling the Purdue claims.\n Mr. Rice, the negotiator for thousands of local governments, favors the broad contours of a public benefit trust. “You have to figure out what you do with the limited need there may be for some opioids. You don’t maximize the value of the Purdue asset if you destroy the product totally,” he said. “And you want to make sure that the people who abused the right to sell narcotics pay for what they did. The Sacklers lose their name, their company and substantially more.”", "posttime": "2020-10-22 03:25:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制药,pharma,普渡", "title": "普渡制药(Purdue Pharma)因阿片类药物销售被控有罪", "title_en": "Purdue Pharma Pleads Guilty to Criminal Charges for Opioid Sales", "transed": 1, "url": "https://www.nytimes.com/2020/10/21/health/purdue-opioids-criminal-charges.html", "via": "", "real_tags": ["制药", "pharma", "普渡"]}, {"category": "", "categoryclass": "", "imagename": "6e8f7a70d7734f88acf1e2dfaca3ceb0.png", "infoid": 1030318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "软件开发项目中的一个常见争论是，是将时间花在提高软件质量上，还是集中在发布更有价值的功能上。通常，交付功能的压力主导了讨论，导致许多开发人员抱怨他们没有时间致力于架构和代码质量。\nBetteridge的标题法则是一句谚语，它说任何标题或标题以问号结尾的文章都可以用“no”来总结。认识我的人都不会怀疑我想要颠覆这样一条法律的愿望。但这篇文章走得更远，它颠覆了问题本身。这个问题假设了质量和成本之间的共同权衡。在这篇文章中，我将解释这种权衡并不适用于软件-高质量的软件实际上生产成本更低。\n虽然我的大部分写作对象都是专业软件开发人员，但在本文中，我不会假设有任何软件开发机制方面的知识。我希望这是一篇对任何参与思考软件工作的人都有价值的文章，特别是那些充当软件开发团队客户的商业领袖。\n正如我在开场白中提到的，我们都习惯于在质量和成本之间权衡。当我更换智能手机时，我可以选择处理器更快、屏幕更好、内存更大的更昂贵的型号。或者我可以放弃这些品质中的一些来付更少的钱。这不是绝对的规则，有时我们可以买到物美价廉的东西。更多的时候，我们对质量有不同的价值观-有些人并没有真正注意到一个屏幕是如何比另一个更好的。但大多数情况下，这个假设是正确的，质量更高的产品通常成本更高。\n如果我要谈论软件质量，我需要解释一下那是什么。这就是第一个复杂的问题--有很多东西可以算作软件的质量。我可以考虑一下用户界面：它是不是很容易引导我完成我需要做的任务，让我更有效率，并消除挫折感？我可以考虑它的可靠性：它是否包含导致错误和挫折的缺陷？另一个方面是它的架构：源代码是否被分成清晰的模块，这样程序员就可以很容易地找到并理解本周他们需要处理的代码的哪一位？\n这三个质量的例子并不是一个详尽的列表，但它们足以说明一个重要的观点。如果我是该软件的客户或用户，我不欣赏我们称之为质量的某些东西。用户可以判断用户界面是否良好。高管可以判断该软件是否提高了员工的工作效率。用户和客户会注意到缺陷，特别是在损坏数据或使系统暂时无法运行的情况下。但是客户和用户无法感知软件的体系结构。\n因此，我将软件质量属性分为外部(如UI和缺陷)和内部(体系结构)。区别在于，用户和客户可以看到是什么使软件产品具有高的外部质量，但不能区分内部质量的高低。\n由于内部质量不是客户或用户可以看到的，这重要吗？让我们设想一下，丽贝卡和我写了一个应用程序来跟踪和预测航班延误。我们的两个应用程序都执行相同的基本功能，都有同样优雅的用户界面，而且几乎没有任何缺陷。唯一不同的是，她的内部源代码组织整齐，而我的内部源代码杂乱无章。还有一个不同之处：我的售价是6美元，而她的售价是10美元。\n既然客户从来不会看到这个源代码，而且它不会影响应用程序的操作，为什么会有人多花4美元购买丽贝卡的软件呢？更广泛地说，这应该意味着不值得为更高的内部质量花更多的钱。\n我的另一种说法是，用成本换取外部质量是有意义的，但用成本换取内在质量是没有意义的。用户可以判断他们是否想花更多的钱来获得更好的用户界面，因为他们可以评估用户界面是否足够好，值得花额外的钱。但是用户看不到软件的内部模块结构，更不用说判断它是否更好了。为什么要花更多的钱买一件没有效果的东西呢？既然是这样，为什么任何软件开发人员都应该把他们的时间和精力放在提高他们工作的内部质量上呢？\n那么，为什么软件开发人员会对内部质量提出质疑呢？程序员将大部分时间花在修改代码上。即使在新系统中，几乎所有编程都是在现有代码库的上下文中完成的。当我想要向软件添加新功能时，我的第一个任务是找出该功能如何适应现有应用程序的流程。然后，我需要更改该流程以使我的功能适合。我经常需要使用应用程序中已有的数据，因此我需要了解这些数据代表什么，它与周围的数据如何关联，以及我可能需要为我的新功能添加哪些数据。\n所有这些都是关于我理解现有代码的。但是软件很容易让人难以理解。逻辑可能会错综复杂，数据可能很难理解，用来指代事物的名字对托尼来说可能在六个月前是有意义的，但对我来说就像他离开公司的原因一样神秘。所有这些都是开发人员所称的CRUFT的形式-当前代码与理想情况之间的差异。\n内部质量的主要特征之一是让我更容易弄清楚应用程序是如何工作的，这样我就可以看到如何添加内容。如果软件被很好地划分为不同的模块，我不需要阅读全部50万行代码，我可以在几个模块中快速找到几百行代码。如果我们把精力放在清晰的命名上，我就可以很快理解代码的各个部分做什么，而不必费解细节。如果数据明智地遵循基础业务的语言和结构，我就很容易理解它与我从客户服务代表那里收到的请求之间的关系。克鲁夫特增加了我理解如何做出改变的时间，也增加了我犯错的机会。如果我发现了我的错误，那么就会损失更多的时间，因为我必须了解错误是什么，以及如何修复它。如果我找不到它们，那么我们就会有生产缺陷，以后就会花更多的时间来修理东西。\n我的改变也会影响到未来。我可能看到了一种快速添加此功能的方法，但这是一条与程序的模块化结构背道而驰的路线，增加了麻烦。如果我走这条路，我今天会让它对我来说更快，但在未来的几周和几个月里，会减慢其他所有必须处理这个代码的人的速度。一旦团队的其他成员做出了同样的决定，一个易于修改的应用程序可能很快就会积累到每一个微小的更改都需要数周的努力的地步。\n在这里，我们看到了为什么内部质量对用户和客户很重要的线索。更好的内部质量使添加新功能更容易，因此速度更快，成本更低。丽贝卡和我现在可能有相同的应用程序，但在接下来的几个月里，丽贝卡的高内部素质让她每周都能添加新功能，而我却在苦苦挣扎，只想拿出一项新功能。我比不上丽贝卡的速度，很快她的软件就比我的更有特色了。然后，我的所有客户都会删除我的应用程序，取而代之的是丽贝卡的应用程序，尽管她可以提高价格。\n内部质量的基本作用是降低未来变革的成本。但是，要编写好的软件需要付出一些额外的努力，这在短期内确实会带来一些成本。\n许多人，包括软件行业的不少人，将构建软件比作建造大教堂或摩天大楼-毕竟，我们为什么要为高级程序员使用建筑师？但是，构建软件存在于一个物理世界未知的不确定世界中。软件的客户对他们需要的产品功能只有一个粗略的概念，并在软件开发过程中了解到更多--特别是在早期版本发布给他们的用户之后。软件开发的构建块-语言、库和平台-每隔几年就会发生重大变化。在现实世界中相当于，客户通常会增加新的楼层和改变平面图，一旦一半的建筑建成和占用，而混凝土的基本性质每隔一年改变一次。\n考虑到这种级别的变化，软件项目总是在创造一些新奇的东西。我们几乎从来没有发现自己在研究一个以前已经解决过的众所周知的问题。当然，我们在构建解决方案的过程中了解到的问题最多，所以我经常听说团队只有在花了一年左右的时间构建了软件架构之后，才能真正最好地理解软件架构应该是什么。即使是最好的团队，他们的软件也会有缺点。\n不同的是，最好的团队不仅创造了更少的麻烦，而且还消除了他们确实创造的足够多的麻烦，这样他们就可以继续快速添加功能。他们花时间创建自动化测试，以便能够快速发现问题，并花更少的时间消除错误。他们经常进行重构，这样他们就可以在它积累到足够多的障碍之前移除它。持续集成最大限度地减少了由于团队成员在不同目的下工作而造成的混乱。一个常见的比喻是，这就像清理厨房里的工作面和设备。做饭的时候你不能把东西弄脏，但是如果你不迅速清理东西，垃圾就会干涸，更难清除，而且所有的脏东西都会妨碍下一道菜的烹调。\n即使是一个伟大的团队也会产生暴躁，但通过保持内部质量的高水平，就能够将其保持在可控的范围内。\n高的内部质量将麻烦降至最低，使团队能够以更少的精力、时间和成本添加功能。\n遗憾的是，软件开发人员通常不会很好地解释这种情况。我无数次与开发团队交谈过，他们说他们(管理层)不会让我们写出高质量的代码，因为这太耗时了。开发人员经常通过证明需要适当的专业精神来证明对质量的关注是合理的。但这种道义上的论点暗示，这种品质是以代价为代价的--注定了他们的论点。令人恼火的是，由此产生的粗糙代码既让开发人员生活更加艰难，又让客户付出了代价。当考虑内在质量时，我强调，我们应该只把它作为一个经济论点来对待。高内部质量降低了未来功能的成本，这意味着将时间投入到编写好的代码实际上降低了成本。\n这就是为什么这篇文章的标题问题没有抓住要点。高内部质量软件的成本为负。通常在成本和质量之间的权衡，这是我们生活中大多数决策所习惯的，对于软件的内部质量是没有意义的。(它在外部质量方面也是如此，比如精心打造的用户体验。)。因为成本和内部质量之间的关系是一种不同寻常的、违反直觉的关系，它通常很难被吸收。但是理解它对于以最高效率开发软件至关重要。", "note_en": "A common debate in software development projects is between spending time on improving the quality of the software versus concentrating on releasing more valuable features. Usually the pressure to deliver functionality dominates the discussion, leading many developers to complain that they don&#39;t have time to work on architecture and code quality.\n Betteridge&#39;s Law of headlines is an adage that says any article with a headline or title that ends in a question mark can be summarized by &#34;no&#34;. Those that know me would not doubt my desire to subvert such a law. But this article goes further than that - it subverts the question itself. The question assumes the common trade-off between quality and cost. With this article I&#39;ll explain that this trade-off does not apply to software - that high quality software is actually cheaper to produce.\n Although most of my writing is aimed at professional software developers, for this article I&#39;m not going to assume any knowledge of the mechanics of software development. My hope is that this is an article that can be valuable to anyone involved with thinking about software efforts, particularly those, such as business leaders, that act as customers of software development teams.\n As I mentioned in the opening, we are all used to a trade-off between quality and cost. When I replace my smart phone, I can choose a more expensive model with faster processor, better screen, and more memory. Or I can give up some of those qualities to pay less money. It&#39;s not an absolute rule, sometimes we can get bargains where a high quality good is cheaper. More often we have different values to quality - some people don&#39;t really notice how one screen is nicer than another. But the assumption is true most of the time, higher quality usually costs more.\n If I&#39;m going to talk about quality for software, I need to explain what that is. Here lies the first complication - there are many things that can count as quality for software. I can consider the user-interface: does it easily lead me through the tasks I need to do, making me more efficient and removing frustrations? I can consider its reliability: does it contain defects that cause errors and frustration? Another aspect is its architecture: is the source code divided into clear modules, so that programmers can easily find and understand which bit of the code they need to work on this week?\n These three examples of quality are not an exhaustive list, but they are enough to illustrate an important point. If I&#39;m a customer, or user, of the software, I don&#39;t appreciate some of the things we&#39;d refer to as quality. A user can tell if the user-interface is good. An executive can tell if the software is making her staff more efficient at their work. Users and customers will notice defects, particularly should they corrupt data or render the system inoperative for a while. But customers and users cannot perceive the architecture of the software.\n I thus divide software quality attributes into  external (such as the UI and defects) and  internal (architecture). The distinction is that users and customers can see what makes a software product have high external quality, but cannot tell the difference between higher or lower internal quality.\n Since internal quality isn&#39;t something that customers or users can see - does it matter? Let&#39;s imagine Rebecca and I write an application to track and predict flight delays. Both our applications do the same essential function, both have equally elegant user interfaces, and both have hardly any defects. The only difference is that her internal source code is neatly organized, while mine is a tangled mess. There is one other difference: I sell mine for $6 and she sells hers for $10.\n Since a customer never sees this source code, and it doesn&#39;t affect the operation of the app, why would anyone pay an extra $4 for Rebecca&#39;s software? Put more generally this should mean that it isn&#39;t worth paying more money for higher internal quality.\n Another way I put this is that it makes sense to trade cost for external quality but it makes no sense to trade cost for internal quality. A user can judge whether they want to pay more to get a better user interface, since they can assess whether the user interface is sufficiently nicer to be worth the extra money. But a user can&#39;t see the internal modular structure of the software, let alone judge that it&#39;s better. Why pay more for something that has no effect? Since that&#39;s the case - why should any software developer put their time and effort into improving the internal quality of their work?\n So why is it that software developers make an issue out of internal quality? Programmers spend most of their time modifying code. Even in a new system, almost all programming is done in the context of an existing code base. When I want to add a new feature to the software, my first task is to figure out how this feature fits into the flow of the existing application. I then need to change that flow to let my feature fit in. I often need to use data that&#39;s already in the application, so I need to understand what the data represents, how it relates to the data around it, and what data I may need to add for my new feature.\n All of this is about me understanding the existing code. But it&#39;s very easy for software to be hard to understand. Logic can get tangled, the data can be hard to follow, the names used to refer to things may have made sense to Tony six months ago, but are as mysterious to me as his reasons for leaving the company. All of these are forms of what developers refer to as  cruft - the difference between the current code and how it would ideally be.\n  One of the primary features of internal quality is making it easier for me to figure out how the application works so I can see how to add things. If the software is nicely divided into separate modules, I don&#39;t have to read all 500,000 lines of code, I can quickly find a few hundred lines in a couple of modules. If we&#39;ve put the effort into clear naming, I can quickly understand what the various part of the code does without having to puzzle through the details. If the data sensibly follows the language and structure of the underlying business, I can easily understand how it correlates to the request I&#39;m getting from the customer service reps. Cruft adds to the time it take for me to understand how to make a change, and also increases the chance that I&#39;ll make a mistake. If I spot my mistakes, then there&#39;s more time lost as I have to understand what the fault is and how to fix it. If I don&#39;t spot them, then we get production defects, and more time spend fixing things later.\n My changes also affect the future. I may see a quick way to put in this feature, but it&#39;s a route that goes against the modular structure of the program, adding cruft. If I take that path, I&#39;ll make it quicker for me today, but slow down everyone else who has to deal with this code in future weeks and months. Once other members of the team make the same decision, an easy to modify application can quickly accumulate cruft to the point where every little change takes many weeks of effort.\n Here we see a clue of why internal quality does matter to users and customers. Better internal quality makes adding new features easier, therefore quicker and cheaper. Rebecca and I may have the same application now, but in the next few months Rebecca&#39;s high internal quality allows her to add new features every week, while I&#39;m stuck trying chop through the cruft to get just a single new feature out. I can&#39;t compete with Rebecca&#39;s speed, and soon her software is far more featureful than mine. Then all my customers delete my app, and get Rebecca&#39;s instead, even as she&#39;s able to increase her price.\n The fundamental role of internal quality is that it lowers the cost of future change. But there is some extra effort required to write good software, which does impose some cost in the short term.\n A way of visualizing this is with the following pseudo-graph, where I plot the cumulative functionality of software versus the time (and thus cost) to produce it. For most software efforts, the curve looks something like this.\n   This is what happens with poor internal quality. Progress is rapid initially, but as time goes on it gets harder to add new features. Even small changes require programmers to understand large areas of code, code that&#39;s difficult to understand. When they make changes, unexpected breakages occur, leading to long test times and defects that need to be fixed.\n Concentrating on high internal quality is about reducing that drop off in productivity. Indeed some products see an opposite effect, where developers can accelerate as new features can be easily built by making use of prior work. This happy situation is a rarer case, as it requires a skilled and disciplined team to make it happen. But we do occasionally see it.\n   The subtlety here is that there is a period where the low internal quality is more productive than the high track. During this time there is some kind of trade-off between quality and cost. The question, of course, is: how long is that period before the lines cross?\n At this point we run into why this is a pseudo-graph. There is no way of measuring the functionality delivered by a software team. This inability to measure output, and thus productivity, makes it impossible to put solid numbers on the consequences of low internal quality (which is also difficult to measure). An inability to measure output is pretty common among professional work - how do we measure the productivity of lawyers or doctors?\n The way I assess where lines cross is by canvassing the opinion of skilled developers that I know. And the answer surprises a lot of folks. Developers find poor quality code significantly slows them down within a few weeks. So there&#39;s not much runway where the trade-off between internal quality and cost applies. Even small software efforts benefit from attention to good software practices, certainly something I can attest from my experience.\n Many non-developers tend to think of cruft as something that only occurs when development teams are careless and make errors, but even the finest teams will inevitably create some cruft as they work.\n I like to illustrate this point with a tale of when I was chatting with one of our best technical team leads. He&#39;d just finished a project that was widely considered to be a great success. The client was happy with the delivered system, both in terms of its capabilities and its construction time and cost. Our people were positive about the experience of working on the project. The tech lead was broadly happy but confessed that the architecture of the system wasn&#39;t that good. I reacted with &#34;how could that be - you&#39;re one of our best architects?&#34; His reply is one familiar to any experienced software architect: &#34;we made good decisions, but only now do we understand how we should have built it&#34;.\n Many people, including more than a few in the software industry, liken building software to constructing cathedrals or skyscrapers - after all why do we use &#34;architect&#34; for senior programmers? But building software exists in a world of uncertainty unknown to the physical world. Software&#39;s customers have only a rough idea of what features they need in a product and learn more as the software is built - particularly once early versions are released to their users. The building blocks of software development - languages, libraries, and platforms - change significantly every few years. The equivalent in the physical world would be that customers usually add new floors and change the floor-plan once half the building is built and occupied, while the fundamental properties of concrete change every other year.\n  Given this level of change, software projects are always creating something novel. We hardly ever find ourselves working on a well-understood problem that&#39;s been solved before. Naturally we learn most about the problem as we&#39;re building the solution, so it&#39;s common for me to hear that teams only really best understand what the architecture of their software should be after they&#39;ve spent a year or so building it. Even the best teams will have cruft in their software.\n The difference is that the best teams both create much less cruft but also remove enough of the cruft they do create that they can continue to add features quickly. They spend time creating automated tests so that they can surface problems quickly and spend less time removing bugs. They refactor frequently so that they can remove cruft before it builds up enough to get in the way. Continuous integration minimizes cruft building up due to team members working at cross-purposes. A common metaphor is that it&#39;s like cleaning up work surfaces and equipment in the kitchen. You can&#39;t not make things dirty when you cook, but if you don&#39;t clean things quickly, muck dries up, is harder to remove, and all the dirty stuff gets in the way of cooking the next dish.\n Even a great team produces cruft, but by keeping internal quality high, is able to keep it under control\n High internal quality keeps cruft to a minimum, allowing a team to add features with less effort, time, and cost.\n Sadly, software developers usually don&#39;t do a good job of explaining this situation. Countless times I&#39;ve talked to development teams who say &#34;they (management) won&#39;t let us write good quality code because it takes too long&#34;. Developers often justify attention to quality by justifying through the need for proper professionalism. But this moralistic argument implies that this quality comes at a cost - dooming their argument. The annoying thing is that the resulting crufty code both makes developers&#39; lives harder, and costs the customer money. When thinking about internal quality, I stress that we should only approach it as an economic argument. High internal quality reduces the cost of future features, meaning that putting the time into writing good code actually reduces cost.\n This is why the question that heads this article misses the point. The &#34;cost&#34; of high internal quality software is negative. The usual trade-off between cost and quality, one that we are used to for most decisions in our life, does not make sense with the internal quality of software. (It does for external quality, such as a carefully crafted user-experience.) Because the relationship between cost and internal quality is an unusual and counter-intuitive relationship, it&#39;s usually hard to absorb. But understanding it is critical to developing software at maximum efficiency.", "posttime": "2020-10-22 03:15:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,quality", "title": "高质量的软件物有所值吗？", "title_en": "Is High Quality Software Worth the Cost?", "transed": 1, "url": "https://martinfowler.com/articles/is-quality-worth-cost.html", "via": "", "real_tags": ["软件", "quality"]}, {"category": "", "categoryclass": "", "imagename": "d4214b17152dc824da72a0a835b72f4c.jpg", "infoid": 1030317, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如何不依赖继承与许多语言相反，Rust没有继承的概念，而是依赖于特征。在这次演讲中，我们将谈论..。", "note_en": "How not to rely on inheritance As opposed to many languages, Rust doesn't have a concept of inheritance, relying instead on Traits. In this talk, we'll talk ...", "posttime": "2020-10-22 03:14:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,性状,traits,继承", "title": "锈病性状简介", "title_en": "Introduction to Traits in Rust", "transed": 1, "url": "https://www.youtube.com/watch?v=m6Gee5kNe7U", "via": "", "real_tags": ["rust", "性状", "traits", "继承"]}, {"category": "", "categoryclass": "", "imagename": "9b836048b9e0d6934a5507bb5eb03e46.jpg", "infoid": 1030316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当iPhone12、iPhone12Pro和iPad Air在10月23日(星期五)上市时，消费者可以通过在线、电话或商店提供的定制购买体验，直接从苹果获得他们的全新产品。从在线开始并以非接触式送货结束的与专家的聊天会话，到访问选定的苹果专卖店与苹果专家进行一对一的会话，客户可以找到获得他们正在寻找的产品的最佳方式。AT&amp；T、T-Mobile/Sprint和Verizon提供了前所未有的优惠，为客户提供了比以往更多的选择和灵活性，iPhone12.1的优惠起价低至每月0美元。\n苹果零售+人事部高级副总裁迪尔德丽·奥布莱恩(Deirdre O‘Brien)说：“现在是购买新iPhone的最佳时机，也没有比Apple Retail更好的目的地了。”我们正在为我们的客户提供新的方式，让他们在购买之前了解我们的所有产品，这样他们就可以确保获得适合自己的产品。无论我们的客户选择面对面、通过电话还是在线与我们联系，我们的整个零售团队都准备好提供他们期待从苹果公司获得的世界级个性化服务。“。\n苹果零售业今年的新产品：苹果现在提供前所未有的运营商优惠，无论是在商店里还是在线上，节省了高达800美元的费用。1个。\n有了Shopping Sessions，客户现在可以在Apple Store预订与专家的一对一会议，以获得选择新产品、运营商计划或融资选项的个性化帮助。同样的专家建议也可以在网上获得，客户可以随时与专家聊天。\n提货选项包括店内提货、路边提货、当天送货或快递店面。2客户可以查看apple.com/Retailure，了解当地商店提供的服务。\n包括iPhone和iPad在内的所有产品都可以使用非接触式送货。送货司机可以要求在安全距离内进行口头确认，以取代实际签名的需要。\n现在有了苹果卡，美国的客户直接从苹果购买时，每天可以获得3%的现金返还，并可以选择苹果卡每月分期付款，这样他们就可以分期支付，免息。3个。\n虽然今年的iPhone发布会看起来与往年不同，但Apple Retail继续提供客户喜爱的服务：在客户获得新的苹果产品后，在线个人会议允许他们安排与专家的免费会议，以设置他们的新产品，学习基础知识，或获得专业提示。\n苹果以旧换新让iPhone或iPad的用户在购买新产品时获得最高500美元的抵免。4.。\n世界各地的绝大多数苹果商店都是开放的，并以各种服务模式运营，以保护客户和员工的健康和福祉。在访问之前，客户应查看apple.com/Retailure，了解当地Apple Store的详细信息。有关Apple Retail提供的服务和支持的更多信息，请访问apple.com/shop。\n美国电话电报公司(AT&amp；T)以旧换新优惠：最低95美元的合格智能手机以旧换新后，在30个月内申请最高800美元的以旧换新积分后，月度价格反映的是每月净付款。需要升级现有系列(或在商店激活新系列)，并按照合格的30个月0%APR分期付款计划购买新的iPhone 12 mini、iPhone 12、iPhone 12 Pro或iPhone 12 Pro Max，具体取决于运营商信用资格。如果使用Next Up购买AT&amp；T分期付款计划，客户应负责，并且不会因下一次UP升级功能每月额外获得5美元的积分而获得任何积分。只对资质好的客户支付0美元的首付，或者可能需要支付首付，这取决于各种因素。销售时应缴的零售价全额税。需要激活符合条件的无限计划(有关详细信息，请访问att.com/plan/Wireless)。如果客户取消无线，信用将停止，并且客户将欠剩余的设备余额。激活/升级费用：30美元。必须在新手机激活后30天内，在参与AT&A；T；的地点以良好状态折价符合条件的智能手机。折价设备可能不在现有分期付款计划中。请访问att.com/tradein了解条款并检查该设备是否符合条件。在30个月的分期付款计划中，账单信用作为每月信用使用。积分在三张钞票内开始。一旦积分开始，将获得追赶积分。无线线路必须签订分期付款协议、有效且在30天内状态良好才有资格。分期付款协议从设备发货时开始。要获得所有积分，设备必须在整个期限内保持协议，并且客户必须在整个分期付款期限内保持设备上的合格服务。限制：每个合格购买一个折价，每行一个积分。不能与其他优惠、折扣或积分组合。适用购买、融资、其他限制和限制。\n苹果卡每月分期付款适用于某些苹果产品，并受信用审批和信用额度的限制。有关可用产品的更多信息，请咨询专家以了解更多详细信息。在美国电话电报公司(AT&amp；T；)、T-Mobile或威瑞森(Verizon)这些全国性运营商的苹果商店购买iPhone时，需要激活iPhone。根据信誉，苹果卡以外的苹果卡每月分期付款的可变年利率从10.99%到21.99%不等。截至2020年4月1日的利率。税费和运费不包括在Apple Card每月分期付款中，并且受标准购买年率的影响。有关更多信息，请参阅Apple Card客户协议。要访问和使用Apple Card的所有功能，客户必须在装有iOS 12.4或更高版本的iPhone上将Apple Card添加到钱包中。要管理Apple Card的月度分期付款，客户需要一台iOS 13.2或更高版本的iPhone，或者一台iPadOS 13.2或更高版本的iPad。通过选择设置&gt；常规&gt；软件更新，更新到最新版本的iOS或iPadOS。单击下载，然后单击安装。适用于美国的合格申请者。由高盛银行美国盐湖城分行发行。\n折价价格会有所不同，可以基于折价设备的条件、年份和配置，也可以在在线折价和店内折价之间有所不同。折价价值可能适用于新购买，可能需要新购买才能获得额外的折价价值。增值税可以按新购商品的全额征收。你必须至少18岁。苹果或其以旧换新合作伙伴保留以任何理由拒绝或限制任何以旧换新交易的权利。店内折价要求出示政府颁发的有效照片ID(当地法律可能要求保存此信息)。来自苹果或苹果折价合作伙伴的附加条款可能适用。", "note_en": "When iPhone 12, iPhone 12 Pro, and iPad Air are available Friday, October 23, customers can get their all-new products directly from Apple through tailored purchase experiences offered online, by phone, or in store. From a chat session with a Specialist that starts online and finishes with contactless delivery, to visiting select Apple Store locations for a one-on-one session with an Apple Specialist, customers can find the best way to get the products they’re looking for. And unprecedented offers from AT&amp;T, T-Mobile/Sprint, and Verizon give customers more choice and flexibility than ever, with offers starting as low as $0 per month for iPhone 12. 1\n  “There’s never been a better time to get a new iPhone, and there’s never been a better destination than Apple Retail,” said Deirdre O’Brien, Apple’s senior vice president of Retail + People. “We’re offering new ways for our customers to get to know all of our products before they buy, so they can be sure to get the product that’s right for them. Whether our customers choose to connect with us in person, by phone, or online, our entire retail team is ready to deliver the world-class personalized service they’ve come to expect from Apple.”\n    New at Apple Retail this year:  Unprecedented carrier offers are now available from Apple, in store or online, with savings of up to $800. 1\n  With Shopping Sessions, customers can now book a one-on-one session with a Specialist at an Apple Store for personalized help selecting a new product, carrier plan, or financing option. The same expert advice is available online, where customers can chat with a Specialist anytime.\n  Pickup options include in-store, curbside, same-day delivery, or Express storefront. 2 Customers can check  apple.com/retail for services available at their local store.\n  Contactless delivery is available for all products, including iPhone and iPad. Delivery drivers may ask for verbal confirmation from a safe distance, replacing the need for a physical signature.\n  And now with Apple Card, customers in the US get 3 percent Daily Cash back when they buy directly from Apple and have the option to choose Apple Card Monthly Installments so they can pay over time, interest-free. 3\n  Though this year’s iPhone launch looks different from years past, Apple Retail continues to offer the services customers love: After a customer gets their new Apple product, an Online Personal Session allows them to schedule a free session with a Specialist to set up their new product, learn the basics, or get pro tips.\n  Apple Trade In lets iPhone or iPad owners get up to $500 credit toward the purchase of a new product. 4\n  The vast majority of Apple Store locations around the world are open and operating in various service models to protect the health and well-being of customers and employees. Before visiting, customers should check  apple.com/retail for details on their local Apple Store. For more information about services and support available from Apple Retail, visit  apple.com/shop.\n      AT&amp;T Special Trade-in Offer: Monthly price reflects net monthly payment, after application of AT&amp;T trade-in credit up to $800 applied over 30 months after trade-in of eligible smartphone with minimum $95 trade-in value. Requires upgrade of an existing line (or activation of a new line in stores) and purchase of a new iPhone 12 mini, iPhone 12, iPhone 12 Pro, or iPhone 12 Pro Max on a qualifying 30-month 0 percent APR installment plan, subject to carrier credit qualification. If buying on the AT&amp;T Installment Plan with Next Up, customer is responsible and will not receive any credits for an additional $5 per month for the Next Up upgrade feature. $0 down for well-qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible unlimited plan (visit  att.com/plans/wireless for details). If the customer cancels wireless, credits will stop and the customer will owe the remaining device balance. Activation/Upgrade Fee: $30. Must trade in eligible smartphone in good condition at a participating AT&amp;T location within 30 days from activation of new phone. Trade-in device may not be on existing installment plan. See  att.com/tradein for terms and to check if the device is eligible. Bill credits are applied as a monthly credit over the 30-month installment plan. Credits start within three bills. Will receive catch-up credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term, and customer must keep eligible service on device for entire installment term. Limits: One trade-in per qualifying purchase and one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply.\n  Apple Card Monthly Installments is available for certain Apple products and is subject to credit approval and credit limit. For more information on available products, see a Specialist for more details. iPhone activation is required on iPhone purchases made at an Apple Store with one of these national carriers: AT&amp;T, T-Mobile, or Verizon. Variable APRs for Apple Card other than Apple Card Monthly Installments range from 10.99 percent to 21.99 percent based on creditworthiness. Rates as of April 1, 2020. Taxes and shipping are not included in Apple Card Monthly Installments and are subject to the standard purchase APR. See the Apple Card Customer Agreement for more information. To access and use all the features of Apple Card, customers must add Apple Card to Wallet on an iPhone with iOS 12.4 or later. To manage Apple Card Monthly Installments, customers need an iPhone with iOS 13.2 or later or an iPad with iPadOS 13.2 or later. Update to the latest version of iOS or iPadOS by choosing Settings &gt; General &gt; Software Update. Tap Download, then Install. Available for qualifying applicants in the United States. Issued by Goldman Sachs Bank USA, Salt Lake City Branch.\n Trade-in values vary and can be based on the condition, year, and configuration of the trade-in device, and may also vary between online and in-store trade-in. Trade-in value may be applied toward new purchase, and new purchase may be required to receive additional trade-in values. Sales tax may be assessed on full value of new purchase. You must be at least 18 years old. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). Additional terms from Apple or Apple’s trade-in partners may apply.", "posttime": "2020-10-22 03:09:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,iphone,购买,ipad", "title": "苹果提供购买iPhone 12、iPhone 12 Pro和iPad Air的新方式", "title_en": "Apple offers new ways to shop for iPhone 12, iPhone 12 Pro, and iPad Air", "transed": 1, "url": "https://www.apple.com/newsroom/2020/10/apple-offers-new-ways-to-shop-for-iphone-12-iphone-12-pro-and-ipad-air/", "via": "", "real_tags": ["apple", "苹果", "iphone", "购买", "ipad"]}, {"category": "", "categoryclass": "", "imagename": "ebafa84e7a239df09abf89caf22fc426.jpg", "infoid": 1030314, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "9月初，俄勒冈州波特兰市议会召开虚拟会议，考虑全面立法禁止使用面部识别技术。这些法案不仅将禁止警方使用该软件揭开监控图像中捕捉到的抗议者和个人的面具，还将阻止公司和其他各种组织使用该软件来识别不明身份的人。\n在征求公众意见期间，当地人克里斯托弗·豪厄尔(Christopher Howell)表示，他对全面禁令感到担忧。他给出了一个令人惊讶的理由。\n豪厄尔说，“我参与了面部识别的开发，实际上是用在波特兰警察身上，因为他们不会向公众表明自己的身份。”今年夏天，随着反对警察暴力的示威活动占领了这座城市，该部门的领导人告诉穿制服的警察，他们可以用胶带粘住自己的名字。豪厄尔想知道：他使用面部识别技术会不会成为非法的？\n波特兰市长泰德·惠勒(Ted Wheeler)告诉豪厄尔先生，他的项目“有点令人毛骨悚然”，但该市的一名律师澄清说，这些法案不适用于个人。议会随后以全票通过了这项立法。\n豪厄尔对惠勒对他的项目的描述感到冒犯，但他松了一口气，因为他可以继续努力。他在接受电话采访时说：“波特兰这里有很多过度的武力。”“知道这些军官是谁似乎是一条底线。”\n42岁的豪厄尔是一名终生抗议者和自学成才的程序员；在研究生院，他开始使用神经网络技术，这是一种人工智能，可以学习根据输入的数据(如图像)做出决定。他说，警方在6月份的一次中午抗议活动中向他发射了催泪瓦斯，他已经开始研究如何制造一种面部识别产品，可以挫败警察隐藏身份的企图。\n他说：“你知道，对我来说，这是一个‘淋浴思考’的时刻，也是我知道怎么做和我目前的兴趣的交汇点。”他说：“问责性很重要。我们需要知道是谁在做什么，这样我们才能应对。“。\n豪厄尔先生并不是唯一一个追求这一目标的人。执法部门使用面部识别来识别罪犯，使用来自政府数据库的照片，或者通过一家名为Clearview AI的公司，从公共互联网上识别罪犯。但现在，世界各地的积极分子正在扭转这一过程，开发可以揭露不当行为的执法的工具。\n乔治城大学隐私与技术中心的律师克莱尔·加维说：“我一点也不惊讶。”“我想有些人会说，‘爱情和战争都是公平的’，但这突显了开发这项技术的风险，而没有考虑到它在所有可能的参与者手中的用途。”\n到目前为止，针对的当局并不满意。《纽约时报》(New York Times)2019年7月报道称，香港抗议者科林·张(Colin Cheung)开发了一种工具，可以使用警察的在线照片来识别他们。他在Facebook上发布了一段关于该项目的视频后，他被逮捕了。张先生最终放弃了这项工作。\n本月，艺术家保罗·西里奥(Paolo Cirio)在网上为一个名为“捕捉”(Capture)的展览发布了4000张法国警察的面孔照片，他称这是开发面部识别应用程序的第一步。他从互联网和参加法国抗议活动的摄影师那里收集了1000张照片中的面孔。41岁的齐里奥在法国内政部长威胁要采取法律行动后撤下了这些照片，但他说他希望重新发布这些照片。\n“这关系到每个人的隐私，”西里奥说，他认为面部识别应该被禁止。“作为一名试图提出问题的艺术家，试图阻止我，而不是解决问题本身，这是幼稚的。”\n正如最近白俄罗斯警察暴力视频所捕捉到的那样，世界各地的许多警察全部或部分遮住了自己的脸。上个月，现居洛杉矶的俄罗斯技术专家安德鲁·马克西莫夫(Andrew Maximov)将一段视频上传到YouTube，展示了如何使用面部识别技术来数字剥离口罩。\n在模拟视频中，软件将蒙面警察与从社交媒体渠道拍摄的警察的完整图像进行了匹配。然后，这两张图像被合并，这样警官们就会穿着制服，展示他们的脸。目前还不清楚这些匹配是否准确。早些时候，一家名为Meduza的俄罗斯新闻网站报道了这段视频，点击量已超过100万次。\n30岁的马克西莫夫说，“有一段时间，每个人都意识到，大人物可以利用这一点来识别和压迫小人物，但我们现在正在接近小人物可以对大人物这样做的技术门槛。”“这不仅仅是失去匿名性。这是声名狼藉的威胁。“。\n这些活动人士表示，由于近年来推出了现成的图像识别软件，构建面部识别工具变得相对容易。在波特兰，豪厄尔使用了谷歌提供的平台TensorFlow，该平台帮助人们建立机器学习模型。\n“技术流程--我不是在发明什么新东西，”他说。“这里最大的问题是获得高质量的图像。”\n豪厄尔在城市网站上找到波特兰警察的名字后，从新闻文章和社交媒体上收集了数千张他们的照片。他还提出了一份公共记录要求，要求提供一份警察花名册，包括他们的名字和人员编号，但遭到拒绝。\nFacebook一直是一个特别有用的图片来源。豪厄尔说，“他们都在这里参加烧烤之类的活动，有时穿着制服。”“人太少了，我可以作为个人合理地做这件事。”\n豪厄尔说，他的工具仍在开发中，只能识别波特兰大约20%的警察。他还没有将其公之于众，但他说，它已经帮助一位朋友确认了一名警官的身份。他拒绝提供更多细节。\n波特兰警察局的公共信息官员德里克·卡蒙(Derek Carmon)说，“在抗议期间，名牌被改成了人员编号，以帮助消除警察的倒班”，但警察被要求佩戴名牌，以执行“与抗议无关的任务”。卡蒙说，人们可以使用警官的人员编号提出投诉。他拒绝对豪厄尔的软件发表评论。\n较早的识别警察身份的尝试依赖于众包。新闻服务机构ProPublica要求读者在一系列警察暴力视频中识别警察。2016年，芝加哥的反监控组织露西·帕森斯实验室(Lucy Parsons Lab)启动了OpenSupervisor，这是一个“执法人员的公共可搜索数据库”。它要求人们上传穿制服的警官的照片，并将它们与警官的名字或徽章编号相匹配。\n“我们在征集什么信息时非常谨慎。我们不想鼓励人们跟着警察带着孩子去操场，“开放监督的首席开发者詹妮弗·赫尔斯比(Jennifer Helsby)说。“这导致警官被确认身份。”\n例如，据当地新闻机构隐形研究所(Insible Institute)的公共战略主管迈拉·赫瓦贾(Maira Khwaja)称，该数据库帮助该机构的记者识别出今年夏天用警棍殴打抗议者的芝加哥警察。\n赫尔斯比说，1000多名警官的照片已经上传到该网站上，并补充说，包括波特兰在内的其他城市也启动了开源数据库的版本。这个版本被称为Cops.Photo，也是豪厄尔获得警察身份照片的地方之一。\n豪厄尔说，他最初想公开自己的作品，但现在担心，根据该市新的面部识别法，将他的工具分发给其他人是非法的。\n“我已经寻求了一些法律建议，并将寻求更多，”豪厄尔说。他形容发布非法面部识别应用程序是“不明智的”，因为警方“一开始就不会欣赏它”。\n他补充说：“如果我对此不感到一点担忧，那就太天真了。”“但我认为这是值得做的。”", "note_en": "In early September, the City Council in Portland, Ore., met virtually to consider sweeping legislation outlawing the use of facial recognition technology. The bills would not only bar the police from using it to  unmask protesters and individuals captured in surveillance imagery; they would also prevent companies and a variety of other organizations from using the software to identify an unknown person.\n During the time for public comments, a local man, Christopher Howell, said he had concerns about a blanket ban. He gave a surprising reason.\n “I am involved with developing facial recognition to in fact use on Portland police officers, since they are not identifying themselves to the public,” Mr. Howell said. Over the summer, with the city seized by demonstrations against police violence, leaders of the department had told uniformed officers that they could  tape over their name. Mr. Howell wanted to know: Would his use of facial recognition technology become illegal?\n Portland’s mayor, Ted Wheeler, told Mr. Howell that his project was “a little creepy,” but a lawyer for the city clarified that the bills would not apply to individuals. The Council then passed the legislation in a unanimous vote.\n Mr. Howell was offended by Mr. Wheeler’s characterization of his project but relieved he could keep working on it. “There’s a lot of excessive force here in Portland,” he said in a phone interview. “Knowing who the officers are seems like a baseline.”\n Mr. Howell, 42, is a lifelong protester and self-taught coder; in graduate school, he started working with neural net technology, an artificial intelligence that learns to make decisions from data it is fed, such as images. He said that the police had tear-gassed him during a midday protest in June, and that he had begun researching how to build a facial recognition product that could defeat officers’ attempts to shield their identity.\n “This was, you know, kind of a ‘shower thought’ moment for me, and just kind of an intersection of what I know how to do and what my current interests are,” he said. “Accountability is important. We need to know who is doing what, so we can deal with it.”\n Mr. Howell is not alone in his pursuit. Law enforcement has used facial recognition to identify criminals, using photos from government databases or, through a company called  Clearview AI, from the public internet. But now activists around the world are turning the process around and developing tools that can unmask law enforcement in cases of misconduct.\n “It doesn’t surprise me in the least,” said Clare Garvie, a lawyer at Georgetown University’s Center on Privacy and Technology. “I think some folks will say, ‘All’s fair in love and war,’ but it highlights the risk of developing this technology without thinking about its use in the hands of all possible actors.”\n The authorities targeted so far have not been pleased. The New York Times reported in July 2019 that Colin Cheung, a protester in Hong Kong, had  developed a tool to identify police officers using online photos of them. After he posted a video about the project on Facebook, he was arrested. Mr. Cheung ultimately abandoned the work.\n  This month, the artist Paolo Cirio published photos of 4,000 faces of French police officers online for an exhibit called “ Capture,” which he described as the first step in developing a facial recognition app. He collected the faces from 1,000 photos he had gathered from the internet and from photographers who attended protests in France. Mr. Cirio, 41, took the photos down after France’s interior minister  threatened legal action but said he hoped to republish them.\n “It’s about the privacy of everyone,” said Mr. Cirio, who believes facial recognition should be banned. “It’s childish to try to stop me, as an artist who is trying to raise the problem, instead of addressing the problem itself.”\n Many police officers around the world cover their faces, in whole or in part, as captured in recent videos of  police violence in Belarus. Last month, Andrew Maximov, a technologist from the country who is now based in Los Angeles, uploaded a video to YouTube that demonstrated how facial recognition technology could be used to  digitally strip away the masks.\n In the simulated footage, software matches masked officers to full images of officers taken from social media channels. The two images are then merged so the officers are shown in uniform, with their faces on display. It’s unclear if the matches are accurate. The video, which was reported earlier by a news site about Russia called  Meduza, has been viewed more than one million times.\n “For a while now, everyone was aware the big guys could use this to identify and oppress the little guys, but we’re now approaching the technological threshold where the little guys can do it to the big guys,” Mr. Maximov, 30, said. “It’s not just the loss of anonymity. It’s the threat of infamy.”\n These activists say it has become relatively easy to build facial recognition tools thanks to off-the-shelf image recognition software that has been made available in recent years. In Portland, Mr. Howell used a Google-provided platform, TensorFlow, which helps people build machine-learning models.\n “The technical process — I’m not inventing anything new,” he said. “The big problem here is getting quality images.”\n Mr. Howell gathered thousands of images of Portland police officers from news articles and social media after finding their names on city websites. He also made a public records request for a roster of police officers, with their names and personnel numbers, but it was denied.\n Facebook has been a particularly helpful source of images. “Here they all are at a barbecue or whatever, in uniform sometimes,” Mr. Howell said. “It’s few enough people that I can reasonably do it as an individual.”\n Mr. Howell said his tool remained a work in progress and could recognize only about 20 percent of Portland’s police force. He hasn’t made it publicly available, but he said it had already helped a friend confirm an officer’s identity. He declined to provide more details.\n  Derek Carmon, a public information officer at the Portland Police Bureau, said that “name tags were changed to personnel numbers during protests to help eliminate the doxxing of officers,” but that officers are required to wear name tags for “non-protest-related duties.” Mr. Carmon said people could file complaints using an officer’s personnel number. He declined to comment on Mr. Howell’s software.\n Older attempts to identify police officers have relied on crowdsourcing. The news service ProPublica asks readers to identify officers in  a series of videos of police violence. In 2016, an anti-surveillance group in Chicago, the Lucy Parsons Lab, started  OpenOversight, a “public searchable database of law enforcement officers.” It asks people to upload photos of uniformed officers and match them to the officers’ names or badge numbers.\n “We were careful about what information we were soliciting. We don’t want to encourage people to follow officers to playgrounds with their kids,” said Jennifer Helsby, OpenOversight’s lead developer. “It has resulted in officers being identified.”\n For example, the database helped journalists at the Invisible Institute, a local news organization, identify Chicago officers who  struck protesters with batons this summer, according to the institute’s director of public strategy, Maira Khwaja.\n Photos of more than 1,000 officers have been uploaded to the site, Ms. Helsby said, adding that versions of the open-source database have been started in other cities, including Portland. That version is called Cops.Photo, and is one of the places from which Mr. Howell obtained identified photos of police officers.\n Mr. Howell originally wanted to make his work publicly available, but is now concerned that distributing his tool to others would be illegal under the city’s new facial recognition laws, he said.\n “I have sought some legal advice and will seek more,” Mr. Howell said. He described it as “unwise” to release an illegal facial recognition app because the police “are not going to appreciate it to begin with.”\n “I’d be naïve not to be a little concerned about it,” he added. “But I think it’s worth doing.”", "posttime": "2020-10-22 03:04:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工具,turn,警察", "title": "活动人士将面部识别工具用于对付警方", "title_en": "Activists Turn Facial Recognition Tools Against the Police", "transed": 1, "url": "https://www.nytimes.com/2020/10/21/technology/facial-recognition-police.html", "via": "", "real_tags": ["工具", "turn", "警察"]}, {"category": "", "categoryclass": "", "imagename": "46691cffe854c764dc9cc25cab514054.jpeg", "infoid": 1030313, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "宗教创造了与他们的神学几乎没有关系的高度不同的信仰集群和心态。\n如果你认为你会通过修改神学来改变宗教人士的行为，那你就犯了标准的韦伯谬误。它不是关于宗教的；它是关于碰巧拥有这种宗教和他们的文化的一群人。\n天主教徒的集体历史态度不一定来自天主教的神学，逊尼派穆斯林的态度不一定来自逊尼派伊斯兰教的神学-只是碰巧宗教要么创造了一个截然不同的两极分化群体，要么人们开始在这个群体中相互模仿。我在这里的观点是，建立在宗教决定态度和文化的观念基础上的韦伯利亚叙事违反了历史逻辑。而试图改变神学是完全没有意义的。如果可以的话，你需要改变心态和文化规范。\n另一种强有力的选择是，人们模仿他们群体中传统上由宗教定义的(有传染性的)习俗，这要合理得多。人们喜欢穿着、行动，甚至是广义地考虑他们团队中其他成员的风格，也就是他们认同的人--我们倾向于松散地称之为“身份认同”。\n韦伯介绍或推广了这样一种观点，即由于新教徒的宗教所赋予的价值观，新教徒具有一定的职业道德。这个观点--就像几乎所有的社会学一样--软绵软的。反过来说：当时的新教徒碰巧有某种文化，而其他新教徒可能会接受他们同龄人的文化，因为宗教是身份认同的吸引者。因为(多亏了叙事谬误)人们总能在宗教中找到一些东西来证实给定的理论。韦伯和韦伯人错过了工业革命很早就袭击了法国北部和比利时(都是极端天主教徒)，而信奉天主教的南方仍然是农业和社会保守的国家，所以人们用肉眼就可以看出，工业革命不可能是关于神学的适当的东西。只是文化规范在身份内是有感染力的，而且太多了。顺便说一句，自从地中海跳过工业革命以来，这样的文化规范还没有影响到它。对任何统计学家来说，“新教伦理”是南北的标志，而不是新教-天主教的标志。\n与其他网络和异教教义不同，三个亚伯拉罕宗教是相互排斥的-由于少数人的统治-即使有些向后兼容(伊斯兰教接受神学上的基督教和犹太教，但不是相反的；基督教不请自来地整合了旧约)。你可以同时崇拜木星和巴尔，就像你可以吃法日料理一样，但必须是基督徒或穆斯林。而始于犹太教拉比时代的分化-以及同步主义的丧失-在现代加速：摩洛哥的犹太人和穆斯林共用神殿；黎巴嫩的什叶派和马龙派在某种程度上也是如此。正是由于没有媒体和电视，当地习俗才能凌驾于遥远的宗教法令之上。在公元前6世纪的杜拉·欧罗波斯(Doura Europos)，同一个房间充当了犹太教堂、异教神庙和教堂。在黎巴嫩，很长一段时间以来，差异是在Qaysi和Yamani(北方人和南方人)之间，这一楔子可能是从拜占庭绿色和蓝色继承而来的，并且跨越了宗教(德鲁兹·卡伊西人在他们最大的战斗Ayn Dara中与Yamani人进行了恶毒的斗争，导致Yamani Druze人在戈兰高地重新定居)。\n另一位黎巴嫩基督徒阿明·马鲁夫(Amine Maalouf)相当本能地理解这个问题，并看到了当前历史记录中的矛盾之处。为什么伊斯兰教是目前与不宽容联系在一起的一个，而传统上是天主教会扮演着这个角色。只要考虑一下明显的证据：在伊斯兰教的传统土地上，你会发现更多的基督教少数民族，而不是相反的。正是天主教团体进行了(凶残的)阿尔比根斯十字军东征、大宗教裁判所、圣巴塞洛缪日大屠杀等等。天主教没有改变，人民和他们的文化改变了。我最后一次检查，这些经文没有修改过；在宗教裁判所期间、宗教裁判所之前和现在都是一样的。\n当然，逊尼派伊斯兰教对基督教的态度也随着时间的推移而改变：自公元前18世纪末以来，不容忍情绪有所上升，想想黎凡特地区基督徒的不断减少。\n比较神学也没有意义，当然，除非一个人被社会学课本洗脑，变得无法以最低限度的清晰度思考。居住在新英格兰和沙特阿拉伯和波斯湾萨拉菲派的(新教)清教徒有着几乎相同的神学，基于共同的社群主义(拒绝中央集权)，破坏偶像(没有代表，没有圣徒，没有任何精心设计的美学)，没有有组织的“教会”，以及非常严格的宗教实践。永远不要忘记，他们所崇拜的正是同一个神。\n这种认同心态的业务要对许多其他事情负责。东地中海和中东的自杀式炸弹袭击者最初并不是萨拉菲穆斯林；直到20世纪末，这种做法(在西西里人之后近两千年后重新引入)才开始传播，希腊东正教潘莱万丁追随者安顿·萨德(Antun Saadeh)。与人们在天堂遇到的处女无关，这是人们今天听到的那种事后归因。\n所以，对于经济发展来说，你认同谁很重要。你拥抱他们对枯燥、重复的任务的胃口，对工业增长和等级制度工作的关注，从她或他的家庭中抽出一个人，不打任何人就能排队数小时的胃口，允许西方工业革命的优点(或缺点)。\n在20世纪初，黎凡特的城市逊尼派认同奥斯曼帝国的上层阶级，因此随着奥斯曼帝国人的西化，他们很容易被“西化”，但以东地中海/东欧的方式：奥斯曼帝国的资产阶级在身份上看起来更像希腊人和保加利亚基督徒，而不是德国人或其他北欧人。后来，在土耳其成为土耳其之后，黎巴嫩逊尼派由于被称为“阿拉伯主义”的运动而认同中东，并改变了他们的心态和习惯。今天，黎巴嫩的什叶派越来越认同伊朗人(人民，而不是政权)，并接受与伊朗人相似的社会行为，专注于学习、工业等-具有讽刺意味的是，尽管是神权政权，但更西方化。Amine Maalouf发现(遗传学家Pierre Zalloua向我解释)黎巴嫩的基督徒认同西方，他们和穆斯林之间的差异开始增加。与此同时，宗教保持不变。\n你的思维方式随着身份的改变而改变，其中包括解决问题的方法。甚至像“智商”测试(主要是衡量在特定测试中测试良好的能力)这样的事情也改变了结果的等级，因为人们开始认同一个与他们原来所属的群体不同的群体：欧盟使爱尔兰人和南斯拉夫人的测试结果与主流趋同。\n我在“游戏中的皮肤”一书中解释说，饮食规则起到了社会屏障的作用：那些一起吃饭的人会被捆绑在一起。繁重的犹太饮食法律帮助创造了独立的散居人口，使他们得以生存，并防止了社会稀释。现在考虑以下几点：伊斯兰教的圣书中并没有特别强烈的反对饮酒的内容，只是一个相当含糊的建议，建议在面对造物主时避免醉酒。但对于社会习惯来说，将这样的法律解释为一项坚定的禁令，以避免与巴格达的基督徒和琐罗亚斯德教徒社交，而当时巴格达是哈里发的首府，阿拉伯人是少数，这是有意义的。正是这种心态找到了神学上的支持，而不是相反。\n最后，我们倾向于将宗教冲突归因于宗教，而不是文化。人们看神学上的皱纹，将马龙派、涅斯特里人和科普特人与希腊拜占庭东正教加尔克多尼亚人区分开来。很少有人知道这些异端邪说与乡村人对希腊罗马人的仇恨有关，这些人并不认同城市居民的希腊化。爱尔兰人和英语人的分歧也是如此。什叶派对逊尼派与生命的继承关系不大，更多的是与那些不想成为更大的逊尼派的一部分的团体有关。", "note_en": "Religions create highly differentiated belief clusters and mentalities that have little to do with their theologies.\n  If you think you will change the behavior of religious people by modifying the theologies, you are committing the standard Weberian fallacy. It is not about the religion; it is about clusters of people who happen to have that religion and their culture.\n  The collective historical attitudes of Catholics aren’t necessarily from the theologies of Catholicism, those of Sunni Muslims not from the theology of Sunni Islam — it just happens that religion either creates a distinct polarized group and people start imitating one another within that group. My point here is that the Weberian narrative built on the notion that religion determines attitude and culture fails historical logic. And trying to  change the theologies makes absolutely no sense. You need to change the mentalities, and cultural norms — if you can.\n   The robust alternative, that people imitate the (contagious) mores of those of their group, tradditionally defined by religion, makes vastly more sense. People like to dress, act, even think in broad terms within the style of others members of their group, people they identify with — what we tend to loosely call “identity”.\n Weber introduced, or promoted the idea that Protestants have a certain work ethics thanks to the values imparted by their religion. The idea — like almost all of sociology — is marshmallow-soft. Consider the reverse: that Protestants at the time happened to have a certain culture, and other protestants were likely to embrace the culture of their peers because religion acted as an attractor for identities. For one can always find (thanks to the  narrative fallacy) some stuff in a religion that confirms a given theory. Weber and the Weberians missed that the Industrial Revolution hit very early on northern France and Belgium (both extremely Catholic), while the Catholic South remained agricultural and socially conservative, so one can see with the naked eye that it cannot be about something proper to the theologies. It is just that cultural norms are contagious within identities, and too mush so. Incidentally such cultural norms haven’t yet hit the Mediterranean since it skipped the industrial revolution. To any statistician, the “Protestant ethics” is a North-South marker, not a Protestant-Catholic one.\n Unlike other networks and pagan creeds, the three Abrahamic religions are mutually exclusive — owing to the minority rule — even if somewhat backward compatible (Islam accepts,  theologically, Christianity and Judaism but not the reverse; Christianity unrequitedly integrates the Old Testament). You could worship both Jupiter and Baal, just as you can have Franco-Japanese cuisine, but must be either Christian or Muslim. And the differentiation — and the loss of synchretism — which started in Judaism during the rabbinical era, has accelerated in modern times: Jews and Muslims in Morocco shared shrines; at some point it was the same for Shiites and Maronites in Lebanon. It is that absence of media and television allowed local customs to override remote religious edicts. In Doura Europos, c. the 6th C., the same room acted as synagogue, pagan temple, and church. And in Lebanon for a long time the difference was between Qaysi and Yamani (Northern and Southerner), a wedge perhaps inherited from the Byzantine Green and Blue, and that cut across religions (the Druze Qaysis viciously battled the Yamanis in their largest battle, Ayn Dara, leading to the resettlement of the Yamani Druze in the Golan heights).\n  Amine Maalouf, another Christian Lebanese, understood the problem rather instinctively and saw the contradictions in the current historical accounts. How come Islam is the one currently associated with intolerance, when it was the Catholic Church that’s traditionally held that role. Just consider the obvious evidence: you find many more Christian minorities in the traditional lands of Islam than the reverse. It was Catholic groups that did the (viciously murderous) Albigensian crusade, the Great Inquisition, the St. Bartholomew’s Day massacre, and others. Catholicism has not changed; people and their culture did. Last time I checked, the scriptures have not been modified; they were the same during the Inquisition, before the inquisition, and now.\n And, of course, Sunni Islam’s attitude towards Christianity has changed over time: a rise in intolerance since the late 18th C. Consider the continuous drop of Christians in the Levant.\n Nor does comparing theologies make sense, unless of course one has been brainwashed by sociology texts and becomes unable to think with minimal clarity. The (Protestant) Puritans who inhabited New England and the Salafis of Saudi Arabia and the Persian Gulf have nearly identical theologies, based on shared communitarianism (refusal of a centralized authority), iconoclasm (absence of representation, of saints, and of any elaborate aesthetics), absence of an organized “church”, and very stern practice of the religion. And never forget that it is the exact same God that they are worshiping.\n This identity-mentality business is responsible for many other things. Suicide bombers in the East Mediterranean and the Middle East weren’t initially Salafi Muslims; it was in the late 20th Century that the practice (reintroduced almost two millennia after the sicarii) started spreading, with Greek Orthodox Pan Levantine followers of Antun Saadeh. Nothing to do with the virgins one meets in heaven, the kind of  ex post attribution one hears today.\n So, it matters, for economic development, who you identify with. You embrace their appetite for boring, repetitive tasks, a focus on industrial growth and working in a hierarchy, the extraction of an individual from her or his family, the appetite to wait in line for hours without beating anyone, virtues (or defects) that allowed for the West’s industrial revolution.\n  In the early 1900s, urban Sunnis in the Levant identified with the Ottoman upper class, hence were readily “Westernized” as the Ottomans Westernized, but in the Eastern Mediterranean/Eastern European way: the Ottoman bourgeois class looked more, for identity, to resemble Greeks and Bulgarian Christians than Germans or other Northern Europeans. The Lebanese Sunnis later on, after Turkey became Turkey, identified with the Middle East, owing to the movement called “Arabism” and changed their mentality and habits. Today Lebanon’s Shiites identify increasingly with Iranians (the people, not the regime), and are embracing social behavior similar to the Iranians, with a focus on study, industry, etc. — ironically much more Western in spite of the theocratic regime. Amine Maalouf detected (as explained to me by the geneticist Pierre Zalloua) that Christians in Lebanon identified with the West, and the differentiation between them and the Muslims started increasing. The religions, meanwhile, stayed the same.\n Your way of thinking changes along with the identity, which includes approaches to problem solving. Even such things as “IQ” testing (which measures mostly the ability to test well on  that specific test) has yielded an alteration of the hierarchy of results as populations started identifying with a different group than the original one they belonged to: the European Union made the test results of the Irish and the Southern Slavs converge to that of the mainstream.\n I explained in  Skin in the Game that dietary laws act as social barriers: those who eat together bind together. The onerous Jewish dietary laws helped create separate diasporas which allowed for survival, and prevented social dilution. Now consider the following: there is nothing particularly strong in Islam’s holy text against drinking alcohol, just a rather vague recommendation of avoidance of intoxication while facing the creator. But it made sense for social habits to interpret such a law as a firm interdict to avoid socialization with Christians and Zoroastrians in Bagdad when it was the capital of the Califate and Arabs were in the minority.  It was the mentality that found theological backing, rather than the reverse.\n Finally we tend to attribute religious conflicts to religion, rather than cultures. People look at theological wrinkes that differentiate the Maronites, Nestorians, and Copts from the Greek-Byzantine Orthodox Calcedonians. Few get that these heresies had to do with hatred of the Greco-Romans by people in the countryside who did not share the Hellenisms of city dwellers. The same with the Irish-English divide. And Shiite vs. Sunni has little to do with the Calife’s succession and more to do with groups that did not want to be part of the larger Sunna.", "posttime": "2020-10-22 03:03:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宗教,violence", "title": "宗教、暴力、宽容与进步：与神学无关", "title_en": "Religion, Violence, Tolerance and Progress: Nothing to Do with Theology", "transed": 1, "url": "https://medium.com/incerto/religion-violence-tolerance-progress-nothing-to-do-with-theology-a31f351c729e", "via": "", "real_tags": ["宗教", "violence"]}, {"category": "", "categoryclass": "", "imagename": "15d6486087ec9314849672a51e1874e4.jpeg", "infoid": 1030312, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dropbox让家人和朋友团体可以选择合作，以低于两个账户的价格获得Plus福利。该服务的家庭计划现在每月17美元，最多允许6名用户访问一个界面和Plus账户提供的所有功能。在过去的几个月里，Dropbox一直在对家庭计划进行Beta测试，并承诺在今年某个时候扩大推出范围。该公司在其声明中表示，这一选项可以帮助“离家生活、工作和上学的人”理顺他们的“数字生活”。\n计划成员可以访问一个名为Family Room的共享文件夹，在那里他们可以查看和打开彼此的文件，如食谱或照片，但他们仍然可以为自己的个人物品获得单独的帐户和文件夹。也就是说，家庭计划为所有用户提供了2TB的共享存储空间，因此对于那些有大量文件要保存和备份的用户来说，这可能不是最好的选择。\n该计划还提供了对Dropbox Password的访问权限，这是一种密码管理器，计划成员可以用来存储跨Windows、Mac、iOS和Android设备的登录详细信息。如果成员需要存储银行对账单或出生证明等敏感文件，他们可以利用另一项福利：访问Vault。存储在Vault中的文件在上载、下载和存储期间受PIN和加密保护，用户可以选择在紧急情况下授予一名家庭成员访问该文件的权限。\n会员还可以使用自己的账户将电脑直接备份到Dropbox文件夹中，还可以自动从移动设备上传照片。他们也可以通过将相机或存储卡连接到安装了Dropbox的电脑来上传照片，或者直接从Facebook传输照片和视频。", "note_en": "Dropbox is giving families and groups of friends the option to team up and get Plus perks for less than the price of two accounts. The service’s Family plan is now available for $17 a month and gives up to six users access to one interface and all the features a Plus account offers. Dropbox has been  beta testing Family plan over the past few months with the promise of a wider rollout sometime this year. In its  announcement, the company said the option can help “people living, working and schooling from home” declutter their “digital lives.”\n Plan members get access to a shared folder called Family Room, where they can see and open each other files such as recipes or photos, but they still get separate accounts and folders for their personal stuff. That said, Family plan comes with a 2TB shared storage allowance for all users, so it’s probably not the best option for those with a massive amount of files to save and back up.\n  The plan also comes with access to  Dropbox Passwords, a password manager plan members can use to store log-in details across Windows, Mac, iOS and Android devices. If members need to store sensitive files such as bank statements or birth certificates, they can take advantage of another perk: access to the Vault. Files stored in the Vault are protected by a PIN and encryption during upload, download and storage, and a user can choose to give one family member access to it in case of an emergency.\n Members can also use their accounts to back up their computer directly into their Dropbox folders, as well as automatically upload photos from a mobile device. They can upload photos by connecting a camera or a memory card to a computer installed with Dropbox, as well, or transfer their photos and videos directly from Facebook.", "posttime": "2020-10-21 21:55:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "共享,launches,访问", "title": "Dropbox推出2TB共享家庭计划，最多6人，每月17美元", "title_en": "Dropbox launches a shared family plan with 2TB for up to six people for $17 per month", "transed": 1, "url": "https://www.engadget.com/dropbox-family-plan-now-available-130047846.html", "via": "", "real_tags": ["共享", "launches", "访问"]}, {"category": "", "categoryclass": "", "imagename": "5f7ca654add5665efc98d49cec2cc6a9.jpeg", "infoid": 1030310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于这个最新的平台，福特用全新的系统升级了LiDAR传感器套件，该系统配备了更高分辨率的128光束阵列，可以提供360度的视野。福特表示，这有助于测试车辆更好地检测、修复和移动更靠近车辆的物体。近场摄像机和短程激光雷达可以向前和向车辆侧面看，而后置传感器可以帮助定位SUV后面的物体。\nEscape混合动力车的平台通过改进电池冷却更好地服务于自动驾驶技术。福特表示，改装的高压电池有助于供应自动驾驶系统，同时还减少了车辆的汽油消耗。\n福特正在奥斯汀、底特律、迈阿密、帕洛阿尔托、匹兹堡和华盛顿特区等测试城市推出这款新的试验台，在这些地区，改进的传感器清洁技术应该有助于车辆的自动驾驶努力。\n福特表示，它对系统进行了改造，任务是确保传感器没有灰尘、雨、雪和冰。与以前的型号相比，更多的喷嘴在更高的压力下喷射出液体清洗液。激光雷达传感器也有一个新开发的隐藏的强制空气清洁系统。\n福特在2018年表示，打算在2023年之前在自动驾驶汽车上花费40亿美元，最近的事态发展清楚地表明，福特正在推进这一努力。2018年，这家汽车制造商购买了底特律科克敦社区的废弃的密歇根中央车站和周围的建筑。从那时起，随着对这个庞大的火车站的翻新，该公司一直在该地区进行额外的投资。两个月前，它与博世(Bosch)和基岩(Bedrock)合作，宣布了一个自动代客停车库。\n尽管有今天的新闻，但该公司的自动驾驶服务还需要几年的时间。2020年4月，福特表示，由于新冠肺炎危机引发了对该战略的重新思考，该公司将把自动驾驶汽车服务推迟到2022年。", "note_en": "For this latest platform, Ford upgraded the LiDAR sensor suite with an all-new system that sports a higher resolution 128-beam array to provide a 360-degree view. Ford says this helps the test vehicle better detect fix and moving objects closer to the vehicle. Near-field cameras and short-range LiDAR look ahead and to the vehicle’s side while rear-facing sensors help with objects behind the SUV.\n  The Escape Hybrid’s platform better serves the self-driving technology with improved battery cooling. Ford says that modified high voltage batteries help supply the self-driving system while also reducing the gasoline consumed by the vehicle.\n Ford is rolling out this new testbed to its testing cities of Austin, Detroit, Miami, Palo Alto, Pittsburgh, and Washington D.C. And in each of these regions, the improved sensor cleaning technology should help the vehicle in its self-driving efforts.\n Ford says it reworked the systems tasked with ensuring the sensors are free of dust, rain, snow, and ice. More spray nozzles shoot out liquid cleaning solutions at a higher pressure than previous models. The LiDAR sensors have a newly-developed hidden, forced-air cleaning system, too.\n Ford  said in 2018 it intended to spend $4 billion on autonomous vehicles by 2023, and recent developments make it clear Ford is pushing forward in this effort. In 2018 the automaker purchased the defunct Michigan Central Station and surrounding buildings in Detroit’s Corktown neighborhood. Since then, it has been making additional investments in the area as it retrofits the massive train station. Two months ago,  it teamed with Bosch and Bedrock to announce an automated valet parking garage.\n Despite’s today’s news, the company’s self-driving service is still a few years out. In April 2020,  Ford said it was postponing its autonomous vehicle service until 2022, as the COVID-19 crisis caused a rethink of the strategy.", "posttime": "2020-10-21 21:36:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,改进,driving,传感器", "title": "\n福特推出了第四代自动驾驶平台，配备了更好的传感器、清洁技术和改进的电池", "title_en": "\n\t\t\t\tFord outs 4th-gen self-driving platform with better sensors, cleaning tech, and improved batteries\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/21/ford-releases-its-4th-gen-self-driving-platform-with-better-sensors-cleaning-tech-and-improved-batteries/", "via": "", "real_tags": ["福特", "改进", "driving", "传感器"]}, {"category": "", "categoryclass": "", "imagename": "17ec14c4d0791ddee038c6e9440d7a91.jpg", "infoid": 1030309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PayPal计划首先支持比特币、以太、比特币现金和Litecoin。您将能够连接到您的PayPal帐户来买卖加密货币。在幕后，帕克索斯负责交易和监管。\n在2021年初，贝宝希望让你使用你的加密资产作为你购买贝宝的资金来源。这可能是一个使用加密货币进行日常购买的好方法，而不必首先在交易所转换加密货币。\n世界各地有2600万商家提供贝宝(PayPal)服务。对于这些商家来说，客户用密码支付不会有任何影响。当交易结算时，所有的东西都会兑换成法定货币。\n作为今天行动的一部分，PayPal已获得纽约州金融服务部(New York State Department Of Financial Service)的有条件比特牌(BitLicense)。它应该能够与纽约的Paxos合作推出密码服务。\n贝宝(PayPal)的密码服务目前还没有上线。你可以去贝宝的网站，加入等待名单。该公司已经更新了费用，增加了有关加密货币兑换费的更多细节。\n该公司将对法定货币到加密货币和加密货币到法定货币的交易收取高额费用。100美元以下的交易预计支付2.3%，100美元和200美元之间的交易支付2%，200美元和1000美元之间的交易支付1.8%，1000美元以上的交易支付1.5%。低于25美元的交易最低手续费是0.5美元。该页面还说，买入和卖出价格之间将会有一些价差。\n相比之下，Coinbase对任何超过200美元的交易收取1.49%的转换费，低于200美元的交易收取固定费用。Square的Cash App收取可变费用，而Robinhood将费用隐藏在市场价格的一些加价之后。\nRevolut还与美国的Paxos合作提供加密货币交易，对免费客户收取2.5%至3%的交换费。如果你是高级用户，你需要支付1.5%的费用。\n许多公司一直在努力打造密码的贝宝(PayPal)。原来Crypto的PayPal可能就是PayPal。", "note_en": "PayPal plans to support Bitcoin, Ethereum, Bitcoin Cash and Litecoin at first. You’ll be able to connect to your PayPal account to buy and sell cryptocurrencies. Behind the scenes,  Paxos    takes care of trading and custody.\n In early 2021, PayPal wants to let you use your crypto assets as a funding source for your PayPal purchases. This could be a good way to use cryptocurrencies for everyday purchases without having to convert cryptocurrencies on an exchange first.\n  There are 26 million merchants that offer PayPal around the world. For those merchants, customers paying in crypto won’t have any impact. Everything will be converted to fiat currency when a transaction is settled.\n As part of today’s move, PayPal has been granted a conditional BitLicense by the New York State Department of Financial Service. It should be able to launch its crypto service in partnership with Paxos in New York.\n PayPal’s crypto service isn’t live just yet. You can head over to PayPal’s website and join the  waitlist. The company has already  updated its fees with more details about cryptocurrency exchange fees.\n The company will charge high fees on fiat-to-cryptocurrency and cryptocurrency-to-fiat exchange transactions. You can expect to pay 2.3% for transactions below $100, 2% for transactions between $100 and $200, 1.8% for transactions between $200 and $1,000 and 1.5% for transactions above $1,000. There’s a minimum fee of $0.50 for transactions below $25. The page also says that there will be some spread between buy and sell prices.\n As a comparison, Coinbase  charges 1.49% in conversion fees for any transaction over $200, and a fixed fee below that amount. Square’s Cash App charges variable fees and Robinhood  hides its fees behind some markup on market prices.\n Revolut, which also  partners with Paxos in the U.S. to offer cryptocurrency trading, charges 2.5 to 3% in exchange fees for free customers. If you’re a premium user, you pay 1.5% in fees.\n Many companies have been trying to build the PayPal of crypto. It turns out that the PayPal of crypto could just be PayPal.", "posttime": "2020-10-21 21:36:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,paypal,buy,贝宝", "title": "\n贝宝(PayPal)让你在美国买卖加密货币", "title_en": "\n\t\t\t\tPayPal to let you buy and sell cryptocurrencies in the US\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/21/paypal-to-let-you-buy-and-sell-cryptocurrencies-in-the-us/", "via": "", "real_tags": ["美国", "paypal", "buy", "贝宝"]}, {"category": "", "categoryclass": "", "imagename": "a8d4562d22d80fee17ba1ba8b2a92f52.jpg", "infoid": 1030308, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州大学伯克利分校(UC Berkeley)的一个团队创建了Ray开源Python框架，用于运行分布式计算项目，Anyscale是一家初创公司，已经筹集了4000万美元。\n它计划利用首都继续开发Anyscale，这是一个建立在Ray上的平台，使Ray不仅可以供高级开发人员和计算专家使用，而且可以供任何希望运行需要大量计算能力的项目的技术人员使用。\nAnyscale执行主席伊恩·斯托伊卡(ION Stoica)与罗伯特·西原(Robert Nishihara)、菲利普·莫里茨(Philipp Moritz)和伯克利分校(Berkeley)教授迈克尔·I·乔丹(Michael I.Jordan)共同创立了该公司。他在接受采访时表示，该公司正在利用这样一个时刻，这不仅是因为2020年的事件，也是因为公司的需求更大-云计算的增长、系统的重大数字化转型，以及需要付出更多努力以保持竞争力。组织在他们的技术战略和目标上变得更加雄心勃勃，无论他们是不是科技公司。\nStoica说：“从高层次来看，我们看到的趋势是，所有的应用程序都是分布式的，并在集群上运行，但构建这些应用程序非常困难，需要拥有正确专业知识的团队。”“我们正在努力构建的东西将使构建分布式计算项目变得像在您的笔记本电脑上运行程序一样容易。这将意味着普通开发者将能够构建可伸缩的应用程序，就像谷歌今天可以构建的那样。“。\n该公司的第一个Anyscale版本-它将允许组织从一台机器构建多云应用程序，并使用可上下扩展的无服务器架构来满足应用程序需求-\u2028还没有商业化推出：它还处于私人测试版，计划明年全面推出。\n斯托伊卡说，金融服务、零售和制造公司都有兴趣，设计、信息学和医学研究(以及新冠肺炎疫苗)的公司也在使用私人测试版。\nB系列由前投资者NEA牵头，安德森·霍洛维茨(Andreessen Horowitz)、英特尔资本(Intel Capital)和基金会资本(Foundation Capital)也参与其中。不到一年前，A16z领导了该公司的首轮融资(去年12月进行了2000万美元的融资)。\n与此同时，英特尔是一个战略投资者。与微软等其他科技巨头一起，英特尔正在使用Ray的分布式计算模型来运行项目。\nStoica也是Databricks，Conviva的联合创始人，也是Apache Spark的最初开发商之一。Stoica和西原在接受采访时拒绝就Anyscale的估值置评，但Stoica证实这轮融资获得了超额认购。该公司目前已募集到略高于6000万美元的资金。\n虽然这家初创公司继续扩大Anyscale，但在过去一年里，它与Ray的合作也取得了更大进展，他们也维持着Ray。\n在Ray峰会上-Anyscale的开发者大会在9月底以虚拟活动的形式运行-Anyscale发布了Ray 1.0，它除了提供通用的无服务器计算API外，还提供了一个可在Ray 1.0上使用的扩展库。西原将其描述为一个“巨大的里程碑”，尤其是因为这是朝着他们希望Anyscale被非科技公司用于技术工作的更大愿景迈出的一步。\n一个典型的例子是英特尔最近为汉堡王构建的推荐算法。他说：“很难做到的事情不是推荐，而是从用户的互动中学习，从他们做出的选择中学习，并让这种体验很快得到反映。”这是一个可以用其他方式完成的过程，但由于滞后，用户体验要差得多。\n西原说，在过去的一年里，人们对Ray的兴趣出现了“巨大的增长”，但很难说这是因为人们在家工作，还是因为更广泛的计算趋势。\n斯托伊卡说：“很明显，如果有什么不同的话，那就是大流行正在加速过渡。”“Ray对云有很好的支持，包括Azure、Google Cloud Platform等，这让它相当有吸引力。”\n我们在企业IT领域看到了一个有趣的趋势，初创企业正在市场上找到机会，让非技术组织有可能弥合数字鸿沟，向那些自己能够构建和操作此类工具的组织以外的组织提供更好的机会，获得计算领域最先进的技术。就像Element AI这样的组织正在努力让人工智能领域的进步民主化一样，苹果(Apple)、谷歌(Google)和亚马逊(Amazon)等公司建造、收购和使用的技术与之相同，Anyscale也在寻求在企业计算领域做同样的事情。\n当然，人工智能和计算这两个领域是相互联系的：如今，你需要大量的计算能力来运行人工智能应用程序，而这是普通公司通常缺乏的。\nNEA普通合伙人皮特·松西尼(Pete Sonsini)在一份声明中表示：“随着人工智能和机器学习在应用程序开发中的广泛采用，对分布式计算的需求继续增加。”尽管如此，在集群上扩展应用程序仍然极具挑战性。无服务器计算正在成为开发分布式应用程序的首选平台。不幸的是，今天的无服务器产品只支持有限的应用程序集，而且大多数都是特定于云的--但不支持Ray和Anyscale。到目前为止，该公司的道路具有杰出技术先驱的特点，我们很高兴能在下一阶段与该团队合作，将他们的开源产品和商业产品连接起来。“", "note_en": "Anyscale, a startup founded by a team out of UC Berkeley who created the Ray open-source Python framework for running distributed computing projects, has raised $40 million.\n It plans to use the capital to continue developing Anyscale, a platform built on Ray that will make Ray usable not just by high-level developers and computing specialists, but any technical people who are looking to run projects that require large amounts of computing power.\n  Ion Stoica, Anyscale’s executive chairman who co-founded the company with Robert Nishihara, Philipp Moritz and Berkeley professor Michael I. Jordan, said in an interview that the company is tapping into a moment spurred not just by the events of 2020 but by the bigger demand from companies — spurred by the growth of cloud computing, major digital transformation of their systems, and a need to go that extra mile to remain competitive. Organizations are becoming more ambitious in their technology strategies and goals, whether they are tech companies or not.\n “At a high level, the trend that we see is that all applications are distributed and running on clusters, but building these applications is incredibly hard and requires teams with the right expertise,” said Stoica. “What we are trying to build will make it as easy to build a distributed computing project as it would be to run a program on your laptop. It will mean ordinary developers will be able to build scalable applications just like Google can build today.”\n The company’s first build of Anyscale — which will let organizations build multi-cloud applications from a single machine and use serverless architecture that scales up and down to meet application demands –\u2028 has yet to launch commercially: it is in a private beta and the plan is to launch it fully next year.\n There has been interest from financial services, retail, and manufacturing companies, Stoica said, with companies working in design, informatics and medical research (and Covid-19 vaccines) also using the private beta.\n The Series B is being led by previous investor NEA, with Andreessen Horowitz (a16z), Intel Capital, and Foundation Capital also participating. A16z led the company’s Series A less than a year ago (a  $20 million round in December).\n Intel, meanwhile, is a strategic investor. Along with other tech giants like Microsoft, Intel is using Ray’s distributing computing model to run projects.\n Stoica — who also co-founded Databricks, Conviva and was one of the original developers of Apache Spark — and Nishihara declined to comment in an interview on Anyscale’s valuation, but Stoica confirmed that the round was oversubscribed. The company has now raised just over $60 million.\n While the startup continues to build out Anyscale, in the last year it has also been making more headway with Ray, which they also maintain.\n At the  Ray Summit — Anyscale’s conference for developers run as a virtual event at the end of September —  Anyscale released Ray 1.0, which provides, in addition to a universal serverless compute API, an expanded library to use on Ray 1.0. Nishihara described it as a “huge milestone,” not least because it is one step along the path for the bigger vision they have for Anyscale to be used by non-tech companies for tech work.\n A typical example was a recent recommendation algorithm built by Intel for Burger King. “T he thing that is hard to do is not making the recommendations but learning from the interactions that users are having, and the choices they are making, and having that experience reflected back very rapidly,” he said. It’s a process that can be done in other ways, but with a far less good user experience due to lags.\n This past year Nishihara said that interest in Ray has seen “tremendous growth,” but that it’s hard to say whether that is because of people working from home or just wider computing trends.\n “It’s clear if anything that the pandemic is accelerating the transition,” said Stoica. “Ray has good support for the cloud, including Azure, Google Cloud Platform and others, which makes it quite compelling.”\n We’ve seen an interesting trend in enterprise IT, where startups are finding an opportunity in the market by making it possible for non-technical organizations to bridge the digital divide, by providing better access to the most technical advances in computing to organizations beyond those that can build and operate such tools themselves. Just as groups like Element AI are working on ways to democratize advances in AI, the same kind of tech built, acquired and used by the likes of Apple, Google and Amazon, so too is Anyscale looking to do the same in enterprise computing.\n And the two areas of AI and computing, of course, are interconnected: these days you need vast amounts of computing power to run AI applications, something the average company typically lacks.\n “The demand for distributed computing continues to increase with the widespread adoption of AI and machine learning in application development,” said Pete Sonsini, General Partner at NEA, in a statement. “Still, scaling applications on clusters remains extremely challenging. Serverless computing is emerging as the preferred platform for developing distributed applications. Unfortunately, today’s serverless offerings support only a limited set of applications, and most of them are cloud-specific—but not Ray and Anyscale. The company’s path thus far bears the hallmarks of a standout technology pioneer, and we’re thrilled to partner with the team through this next phase bridging their open source and commercial offerings.”", "posttime": "2020-10-21 21:36:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "分布式计算,ray", "title": "\nAnyscale增加了4000万美元，将其基于Ray的分布式计算技术带给企业大众", "title_en": "\n\t\t\t\tAnyscale adds $40M to bring its Ray-based distributed computing tech to the enterprise masses\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/21/anyscale-adds-40m-to-bring-its-ray-based-distributed-computing-tech-to-the-enterprise-masses/", "via": "", "real_tags": ["分布式计算", "ray"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030307, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现场可靠性工程(SRE)为运行可靠的分布式系统提供了一种哲学，具有令人钦佩的原则和实践。然而，在短短几年内，SRE货运崇拜已经在一个层面上与2010年代的DevOps货运崇拜相抗衡，什么是SRE作为邪教，它作为邪教与DevOps是如何交叉的？为什么在拥有IT作为A成本中心的企业组织中应用SRE会如此困难？为什么强调可操作性对IT性能比SRE更重要？\n成功的数字化转型取决于从IT作为成本中心向IT作为业务差异化的转变。IT成本中心创建了独立的交付和运营团队，陷入了速度和可靠性之间无休止的冲突。交付希望最大化部署，提高速度。运营部门希望最大限度地减少部署，提高可靠性。这会导致IT性能低下，并对盈利能力、市场份额和工作效率产生负面影响。\n在“加速”一书中，Nicole Forsgren博士等人证明了速度和可靠性不是零和游戏。在持续交付和可操作性方面的投资将产生高性能的IT能力，可以发现新的产品收入来源。例如，将生产支持从您构建它转变为您运行它运行它将释放日常部署，并对服务可靠性产生积极影响。用户满意度、收入保护和品牌美誉度都将得到提高。\n2004年，本·特雷诺·斯洛斯在谷歌内部发起了一项名为SRE的计划。他后来将SRE描述为IT运营的一种软件工程方法，开发人员将历史上由系统管理员拥有的谷歌以外的工作自动化。SRE关键概念包括：\n可用性级别由可用性的九来表示。99.0%是2个9，99.999%是5个9。100%的可用性是无法实现的，因为可靠性较低的用户设备会限制用户体验。100%也是不可取的，因为最大化可用性会限制功能交付的速度，并增加运营成本。在开创性的“现场可靠性工程”一书中，Betsey Byers等人观察到“额外的9个可靠性需要多一个数量级的工程努力”。在任何可用性级别，都需要容忍一定数量的计划外停机，以便投资于功能交付。\n服务级别目标(SLO)是公布的测量目标范围，它设置用户对服务性能某一方面的期望。产品经理根据自己的风险承受能力选择SLO。他们必须平衡满足SLO的工程成本与用户需求、服务的收入潜力以及竞争对手的产品。可用性SLO可以是24小时内99.9%的请求成功率中值，24小时内每分钟收集一次测量值作为服务级别指示器(SLI)。\n错误预算是服务每季度可容忍的计划外停机时间。它用于缓解产品团队和SRE团队之间的任何团队间冲突，如您构建它的操作运行它中所述。它的计算方法是100%减去所选的9个可用性。例如，99.9%的可用性级别相当于0.01%不成功请求的错误预算。一周内0.002%的失败请求将消耗20%的错误预算，剩下80%用于本季度。\n您构建它，SRE运行它是一种有条件的生产支持方法，其中一组SRE支持产品团队的服务。所有的产品团队都会构建它吗？默认情况下，您会运行它，并且对SRE团队有严格的进入和退出标准。服务必须具有关键级别的用户流量、一些提升的SLO，并通过就绪审查。SRE将接管随叫随到，并确保始终满足SLO。如果服务在其错误预算内，产品团队可以推出新功能。如果没有，则在解决所有错误之前，它们无法部署。如果错误预算一再被夸大，SRE团队可以随时召回给产品团队，由产品团队恢复到您构建并运行它。\n这就是SRE作为一种哲学。SRE最大的礼物是一个根据产品收入量化可用性目标和工程成果的框架。SRE还推广了一些想法，如测量部分可用性、监控服务的黄金信号、从相同的遥测数据构建SLO警报和SLI仪表盘，以及在可能的情况下减少运营负担。\n在2010年代，DevOps的协作哲学被DevOps斥为邪教。DevOps货运崇拜无处不在，而且是错误的。它的信念是：\nDevOps自动化工具、DevOps工程师、DevOps团队和/或DevOps认证始终是该问题的解决方案。\n同样，SRE的哲学也被SRE作为邪教而腐化了。SRE货物崇拜基于同样有缺陷的前提，并将SRE错误预算、SRE工程师、SRE团队和SRE认证作为灵丹妙药。例子包括帕特里克·希尔在爱情中陈述的DevOps？等到你遇到SRE，“SRE消除了关于什么可以推出以及何时推出的猜想和争论”，以及提供SRE认证的DevOps Institute。\n作为一个邪教，SRE忽略了SRE哲学面临的核心问题-它作为成本中心对IT的适用性。SRE起源于单个独特组织中才华横溢、固执己见的软件工程师。谷歌将IT作为业务差异化的核心宗旨。使用罗恩·韦斯特勒姆(Ron Westrum)的“组织文化类型学”，它的组织文化可以被描述为生成性的。Accelerate发现，生产力文化预示着高性能的IT，员工倦怠程度较低。\n将SRE应用于具有官僚主义或病态文化的IT成本中心组织存在根本挑战。产品、交付和运营团队将受到正交激励、资金压力和竖井竞争的阻碍。\n可用性级别是跨组织支持SRE的领先指标。当失败导致替罪羊或正义时：\n产品/交付/运营负责人可能不会接受额外的9个可靠性意味着更多的工程工作。\n服务级别目标基于产品经理的风险容忍度。当责任被推卸或挫败时：\n产品经理将需要交付团队的帮助来发现用户预期、计算服务收入潜力并检查竞争对手的可用性级别。\n错误预算依赖于不同团队之间的共享协议，而不是诉诸于您构建它的团队间的斗争运营者运行它。当合作程度不高或较低时：\n当错误预算为0%时，产品/开发负责人可能不会接受部署上的阻止。\n当错误预算超过0%时，运营主管可能不会全天候接受部署。\n您构建它，SRE运行它意味着一个中央开发团队支持具有高可用性级别和关键用户流量的服务，而其他开发团队在您构建它并运行它的情况下支持他们自己的服务。它与你建造它的世界截然不同，运营者运营它。当仅仅容忍或不鼓励桥接时：\n运营主管可能不同意随叫随到的交付团队的运营成本预算。\n开发主管可能不同意随叫随到的交付团队的资本支出预算\n运营主管可能无法以运营支出预算为其系统管理员支付数月的软件工程培训费用。\n开发人员可能不想为他们的服务提供随叫随到的服务，或者不想被重新标记为SRE。\n交付团队将发现很难在错误和事件管理方面与运营SRE团队协作。\n运营主管可能无法将不可靠的服务转移回最初的交付团队，如果该团队在资本支出资金结束时被解散。\n在“站点可靠性工程”一书中，Ben Treynor Slos认为SRE招聘是谷歌面临的重大挑战。需要在软件工程和系统管理两方面都出类拔萃的开发人员，这是很少见的。他反驳说，SRE团队比运营团队更便宜，因为任务自动化减少了员工人数。由于招聘预算小得多，作为成本中心的IT组织的招聘挑战将会加剧。被吹捧的员工福利是荒谬的，因为开发人员的工资率总是高于系统管理员。\n持续交付需要卓越的运营。可靠的生产服务将最大限度地减少操作返工，并增加功能交付的吞吐量。通向可操作性的途径有很多，SRE只是其中之一。作为一种崇拜，SRE将推动SRE哲学的世界级运营实践，但却掩盖了SRE适用于中小企业和企业组织的重要问题。\n操作实践包括确定操作要求的优先顺序、自动化基础设施、部署运行状况检查、无处不在的遥测、故障注入、事件群集、从事件中学习，然后您构建并运行它。这些做法可以在有SRE的情况下实施，也可以在没有SRE的情况下实施。此外，某些SRE概念(如可用性级别和服务级别目标)可以独立于SRE实施。特别是，产品经理负责根据他们的风险容忍度计算可用性级别，这通常是从现状向前迈出的重要一步。\n但是，您构建它SRE运行它很难适合作为成本中心组织的IT，而且它不是所有可用性级别的经济高效的生产支持方法。在员工培训、组织变革和任务自动化方面，运营一个SRE团队所需的投资额，与您构建和运营IT团队相比，要高出一个数量级。仅当存在具有关键用户流量的多个服务，且可用性级别为4个9或更高时，才有保证。\nIT作为一个成本中心组织应该很好地实施您构建它，而不是运行它。它通过消除交付团队和运营团队之间的交接来解锁日常部署。它通过优先于功能开发的单级群集支持将事件解决时间降至最低。此外，它最大限度地激励开发人员专注于操作功能，因为他们自己在工作时间之外也是随叫随到的。这是一种具有成本效益的收入保护方法，从2个9增加到5个9可用。\n在某些情况下，中小企业或企业组织每天将获得数千万的产品收入，其可靠性需求将是极端的，将投资SRE作为一种理念可能是合理的。否则，请注意SRE作为邪教的危险。正如Luke Stone在“寻找SRE”一书中所说，“从长远来看，SRE不会仅仅基于目前的受欢迎程度而在您的组织中蓬勃发展”。\n感谢亚当·汉斯罗德、丹尼斯·余、斯派克·林赛和蒂埃里·德波的反馈。", "note_en": "Site Reliability Engineering (SRE) offers a philosophy for operating reliable distributed systems, with admirable principles and practices. However, in only a few years SRE cargo culting has emerged at a level to rival DevOps cargo culting in the 2010s.   What is SRE as a Cult, and how does it intersect with DevOps as a Cult? Why is SRE so difficult to apply to enterprise organisations with IT as a A Cost Centre? Why is an emphasis on operability more important to IT performance than SRE?\n  A successful Digital transformation is predicated on a transition from  IT as a Cost Centre to  IT as a Business Differentiator. An IT cost centre creates segregated Delivery and Operations teams, trapped in an endless conflict between speed and reliability. Delivery wants to maximise deployments, to increase speed. Operations wants to minimise deployments, to increase reliability. This results in low performance IT, and has negative consequences for profitability, market share, and productivity.\n In   Accelerate, Dr Nicole Forsgren  et al demonstrates speed and reliability are not a zero sum game. Investing in both Continuous Delivery and Operability will produce a high performance IT capability that can uncover new product revenue streams. For instance, transforming production support from  You Build It Ops Run It to  You Build It You Run It will unlock daily deployments, and have a positive impact on service reliability. User satisfaction, revenue protection, and brand reputation will all be improved.\n  In 2004, Ben Treynor Sloss started an initiative called SRE within Google. He later described SRE as a software engineering approach to IT operations, with developers automating work historically owned outside Google by sysadmins. SRE key concepts include:\n  Availability levels are known by the  nines of availability. 99.0% is two nines, 99.999% is five nines. 100% availability is unachievable, as less reliable user devices will limit the user experience. 100% is also undesirable, as maximising availability limits speed of feature delivery and increases operational costs. In the seminal book   Site Reliability Engineering, Betsey Byers  et al observe that ‘an additional nine of reliability requires an order of magnitude more engineering effort’. At any availability level, an amount of unplanned downtime needs to be tolerated, in order to invest in feature delivery.\n  A Service Level Objective (SLO) is a published target range of measurements, which sets user expectations on an aspect of service performance. A product manager chooses SLOs, based on their own risk tolerance. They have to balance the engineering cost of meeting an SLO with user needs, the revenue potential of the service, and competitor offerings. An availability SLO could be a median request success rate of 99.9% in 24 hours, with measurements collected every minute for 24 hours as a Service Level Indicator (SLI).\n An error budget is a quarterly amount of tolerable, unplanned downtime for a service. It is used to mitigate any inter-team conflicts between product teams and SRE teams, as found in You Build It Ops Run It. It is calculated as 100% minus the chosen nines of availability. For example, an availability level of 99.9% equates to an error budget of 0.01% unsuccessful requests. 0.002% of failing requests in a week would consume 20% of the error budget, and leave 80% for the quarter.\n You Build It SRE Run It is a conditional production support method, where a team of SREs support a service for a product team. All product teams do You Build It You Run It by default, and there are strict entry and exit criteria for an SRE team. A service must have a critical level of user traffic, some elevated SLOs, and pass a readiness review. The SREs will take over on-call, and ensure SLOs are consistently met. The product team can launch new features if the service is within its error budget. If not, they cannot deploy until any errors are resolved. If the error budget is repeatedly blown, the SRE team can hand on-call back to the product team, who revert to You Build It You Run It.\n This is  SRE as a Philosophy. The biggest gift from SRE is a framework for quantifying availability targets and engineering effort, based on product revenue. SRE has also promoted ideas such as measuring partial availability, monitoring the golden signals of a service, building SLO alerts and SLI dashboards from the same telemetry data, and reducing operational toil where possible.\n  In the 2010s, the DevOps philosophy of collaboration was bastardised by  DevOps as a Cult. The DevOps cargo cult is ubiquitous, and wrong. Its beliefs are:\n DevOps automation tools, DevOps engineers, DevOps teams, and/or DevOps certifications are  always solutions to that problem.\n In a similar vein, the SRE philosophy has been corrupted by  SRE as a Cult. The SRE cargo cult is based on the same flawed premise, and espouses SRE error budgets, SRE engineers, SRE teams, and SRE certifications as a panacea. Examples include Patrick Hill stating in  Love DevOps? Wait until you meet SRE that ‘SRE removes the conjecture and debate over what can be launched and when’, and the DevOps Institute offering  SRE certification.\n SRE as a Cult ignores the central question facing the SRE philosophy – its applicability to IT as a Cost Centre. SRE originated from talented, opinionated software engineers in a single, unique organisation. Google has IT as a Business Differentiator as a core tenet. Using   A Typology of Organisational Cultures by Ron Westrum, its organisational culture can be described as generative.  Accelerate found a generative culture is predictive of high performance IT, and less employee burnout.\n  There are fundamental challenges with applying SRE to an IT as a Cost Centre organisation with a bureaucratic or pathological culture. Product, Delivery, and Operations teams will be hindered by orthogonal incentives, funding pressures, and silo rivalries.\n Availability levels are a leading indicator of cross-organisation support for SRE. When failure leads to scapegoating or justice:\n Heads of Product/Delivery/Operations might not accept an additional nine of reliability means an order of magnitude more engineering effort.\n Service Level Objectives are based on the risk tolerances of product managers. When responsibilities are shirked or discouraged:\n Product managers will need help from Delivery teams to uncover user expectations, calculate service revenue potential, and check competitor availability levels.\n Error budgets depend on shared agreements between different teams, without resorting to the inter-team battles of You Build It Ops Run It. When cooperation is modest or low:\n Heads of Product/Development might not accept a block on deployments when an error budget is 0%.\n A Head of Operations might not accept deployments at all hours when an error budget is above 0%.\n You Build It SRE Run It means a central developer team supporting services with high availability levels and critical user traffic, while other developer teams support their own services under You Build It You Run It. It is worlds apart from You Build It Ops Run It. When bridging is merely tolerated or discouraged:\n A Head of Operations might not consent to on-call Delivery teams on their opex budget\n A Head of Development might not consent to on-call Delivery teams on their capex budget\n A Head of Operations might be unable to afford months of software engineering training for their sysadmins on an opex budget\n  Developers might not want to do on-call for their services, or be rebadged as SREs\n Delivery teams will find it hard to collaborate with an Operations SRE team on errors and incident management\n A Head of Operations might be unable to transfer an unreliable service back to the original Delivery team, if it was disbanded when its capex funding ended\n In  Site Reliability Engineering, Ben Treynor Sloss identifies SRE recruitment as a significant challenge for Google. Developers are needed that excel in both software engineering and systems administration, which is rare. He counters this with the argument that an SRE team is cheaper than an Operations team, as the headcount is reduced by task automation. Recruitment challenges will be exacerbated in IT as a Cost Centre organisations, due to much smaller recruitment budgets. The touted headcount benefit is absurd, as salary rates are invariably higher for developers than sysadmins.\n  Continuous Delivery requires operational excellence. Reliable production services will minimise operational rework, and increase the throughput of feature delivery. There are many pathways to Operability, and SRE is only one of those pathways. SRE as a Cult will promote the world class operational practices of the SRE philosophy, but obscure the important questions about SRE applicability to SMEs and enterprise organisations.\n Operability practices include the prioritisation of operational requirements, automated infrastructure, deployment health checks, pervasive telemetry, failure injection, incident swarming, learning from incidents, and You Build It You Run It. These practices can be implemented with, and without SRE. In addition, some SRE concepts such as availability levels and Service Level Objectives can be implemented independently of SRE. In particular, product managers being responsible for calculating availability levels based on their risk tolerances is often a major step forward from the status quo.\n However, You Build It SRE Run It is a difficult fit for an IT as a Cost Centre organisation, and it is not a cost effective production support method for all availability levels. The amount of investment required in employee training, organisational change, and task automation to run an SRE team alongside You Build It You Run It teams is an order of magnitude more than You Build It You Run It itself. It is only warranted when multiple services exist with critical user traffic, and at an availability level of four nines or more.\n An IT as a Cost Centre organisation would do well to implement You Build It You Run It instead. It unlocks daily deployments, by eliminating handoffs between Delivery and Operations teams. It minimises incident resolution times, via single-level swarming support prioritised ahead of feature development. Furthermore, it maximises incentives for developers to focus on operational features, as they are on-call out of hours themselves. It is a cost effective method of revenue protection, from two nines to five nines of availability.\n  In some cases, an SME or enterprise organisation will earn tens of millions in product revenues each day, its reliability needs will be extreme, and investing in SRE as a Philosophy could be warranted. Otherwise, heed the perils of SRE as a Cult. As Luke Stone said in   Seeking SRE, ‘in the long run, SRE is not going to thrive in your organisation based purely on its current popularity’.\n  Thanks to Adam Hansrod, Denise Yu, Spike Lindsey, and Thierry de Pauw for their feedback.", "posttime": "2020-10-21 21:32:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可操作性,operability,sre", "title": "以可操作性为目标，而不是将SRE视为狂热崇拜", "title_en": "Aim for Operability, Not SRE as a Cult", "transed": 1, "url": "https://www.stevesmith.tech/blog/aim-for-operability-not-sre-as-a-cult/", "via": "", "real_tags": ["可操作性", "sre"]}, {"category": "", "categoryclass": "", "imagename": "6d24beff447f24869b2bc45eca6b3503.png", "infoid": 1030306, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们将发布Reaction 17！我们已经在REACTION 17RC博客文章中详细介绍了REACTION 17版本的作用和它所包含的更改。这篇文章是对它的简要总结，所以如果你已经读过RC文章，你可以跳过这篇文章。\nREACTION 17版本不同寻常，因为它没有添加任何面向开发人员的新功能。相反，此版本主要侧重于简化Reaction本身的升级。\n具体地说，Reaction 17是使将由一个版本Reaction管理的树嵌入由不同版本的React管理的树内变得更安全的“垫脚石”版本。\nReaction 17支持逐步的Reaction升级。当你从RECTION 15升级到16(或者，这一次是从REACTION 16升级到17)时，你通常会一次升级整个应用程序。这对许多应用程序都很有效。但是，如果代码库是在几年前编写的，并且没有积极维护，那么它可能会变得越来越有挑战性。虽然可以在页面上使用两个版本的Reaction，但在Reaction 17之前，这是脆弱的，并且会导致事件问题。\n我们正在用Reaction 17解决其中的许多问题，这意味着当Reaction 18和下一个未来版本发布时，你现在将有更多的选择。第一个选择是一次性升级你的整个应用程序，就像你以前可能做的那样。但您也可以选择逐个升级您的应用程序。例如，您可能决定将应用程序的大部分迁移到REACTION 18，但在REACTION 17上保留一些延迟加载的对话框或子路由。\n这并不意味着你必须逐步升级。对于大多数应用程序来说，一次性升级仍然是最好的解决方案。加载两个版本的Reaction-即使其中一个是按需延迟加载的-仍然不理想。然而，对于没有积极维护的大型应用程序，考虑这个选项是有意义的，并且REPACTION 17让这些应用程序不会被抛在后面。\n我们已经准备了一个示例存储库，演示如何在必要时延迟加载较旧版本的Reaction。本演示使用create Reaction App，但是应该可以使用任何其他工具遵循类似的方法。我们欢迎使用其他工具作为拉式请求的演示。\n我们已经将其他更改推迟到Reaction 17之后。此版本的目标是实现逐步升级。如果升级到Reaction 17太难了，那就违背了它的目的。\n要启用渐进式更新，我们需要对Reaction事件系统进行一些更改。Reaction 17是一个主要版本，因为这些更改可能会造成破坏。您可以查看我们的版本控制常见问题解答，了解更多关于我们对稳定性的承诺。\n在REACTION 17中，REACT将不再在幕后附加文档级的事件处理程序。相反，它会将它们附加到呈现反应树的根DOM容器中：\n在REACTION 16和更早版本中，REACTION将对大多数事件执行Document.addEventListener()。REACTION 17将在幕后调用rootNode.addEventListener()。\n我们已经确认，多年来在我们的问题跟踪器上报告的大量与集成Reaction和非Reaction代码相关的问题已经通过新的行为得到了修复。\n如果您在此更改中遇到问题，这里有一个解决问题的常用方法。\nREACTION 17RC的博客文章描述了REACTION 17中的其余突破性变化。\n我们只需要更改Facebook产品代码中10万+个组件中的不到20个组件就可以处理这些更改，所以我们预计大多数应用程序都可以毫不费力地升级到17个。如果你遇到问题，请告诉我们。\nREACTION 17支持新的JSX转换。我们还支持它响应16.14.0、响应15.7.0和0.14.10。请注意，它完全是选择加入的，您不必使用它。经典的JSX转换将继续工作，并且没有停止支持它的计划。\nReaction Native有一个单独的发布时间表。我们目前预计对REACTION 17的支持将在REACTION Native 0.65中落地，但具体版本可能会发生变化。一如既往，您可以在Reaction Native Community发布问题跟踪器上跟踪发布讨论。\n停止公开Reaction Native Web不需要的内部内容。(@#18483中的Necolas)。\n在DEV模式双渲染的第二个渲染过程中禁用控制台。(#18547中的@sebmarkpage)。\n禁用&lt；div隐藏/&gt；预渲染以支持不同的未来API。(#18917中的@acdlite)。\n修复导致挂起树中的更新丢失的错误。(#18384和#18457中的@acdlite)。\n修复可能导致更新丢失的输入错误。(#18515中的@jddxf和#18535中的@acdlite)。\n如果要补水，不要剪掉悬挂表的尾巴。(#18854中的@sebmarkpage)", "note_en": "Today, we are releasing React 17! We’ve written at length about the role of the React 17 release and the changes it contains in  the React 17 RC blog post. This post is a brief summary of it, so if you’ve already read the RC post, you can skip this one.\n  The React 17 release is unusual because it doesn’t add any new developer-facing features. Instead, this release is primarily focused on  making it easier to upgrade React itself.\n In particular, React 17 is a “stepping stone” release that makes it safer to embed a tree managed by one version of React inside a tree managed by a different version of React.\n   React 17 enables gradual React upgrades. When you upgrade from React 15 to 16 (or, this time, from React 16 to 17), you would usually upgrade your whole app at once. This works well for many apps. But it can get increasingly challenging if the codebase was written more than a few years ago and isn’t actively maintained. And while it’s possible to use two versions of React on the page, until React 17 this has been fragile and caused problems with events.\n We’re fixing many of those problems with React 17. This means that  when React 18 and the next future versions come out, you will now have more options. The first option will be to upgrade your whole app at once, like you might have done before. But you will also have an option to upgrade your app piece by piece. For example, you might decide to migrate most of your app to React 18, but keep some lazy-loaded dialog or a subroute on React 17.\n This doesn’t mean you  have to do gradual upgrades.  For most apps, upgrading all at once is still the best solution. Loading two versions of React — even if one of them is loaded lazily on demand — is still not ideal. However, for larger apps that aren’t actively maintained, this option makes sense to consider, and React 17 lets those apps not get left behind.\n We’ve prepared an  example repository demonstrating how to lazy-load an older version of React if necessary. This demo uses Create React App, but it should be possible to follow a similar approach with any other tool. We welcome demos using other tooling as pull requests.\n We’ve  postponed other changes until after React 17. The goal of this release is to enable gradual upgrades. If upgrading to React 17 were too difficult, it would defeat its purpose.\n  To enable gradual updates, we’ve needed to make some changes to the React event system. React 17 is a major release because these changes are potentially breaking. You can check out our  versioning FAQ to learn more about our commitment to stability.\n In React 17, React will no longer attach event handlers at the  document level under the hood. Instead, it will attach them to the root DOM container into which your React tree is rendered:\n  In React 16 and earlier, React would do  document.addEventListener() for most events. React 17 will call  rootNode.addEventListener() under the hood instead.\n  We’ve confirmed that  numerous  problems  reported  over  the  years  on  our  issue  tracker related to integrating React with non-React code have been fixed by the new behavior.\n If you run into issues with this change,  here’s a common way to resolve them.\n  The React 17 RC blog post describes the rest of the breaking changes in React 17.\n We’ve only had to change fewer than twenty components out of 100,000+ in the Facebook product code to work with these changes, so  we expect that most apps can upgrade to React 17 without too much trouble. Please  tell us if you run into problems.\n  React 17 supports the  new JSX transform. We’ve also backported support for it to React 16.14.0, React 15.7.0, and 0.14.10. Note that it is completely opt-in, and you don’t have to use it. The classic JSX transform will keep working, and there are no plans to stop supporting it.\n  React Native has a separate release schedule. We currently expect the support for React 17 to land in React Native 0.65, but the exact version is subject to change. As always, you can track the release discussions on the React Native Community releases  issue tracker.\n             Stop exposing internals that won’t be needed by React Native Web. ( @necolas in  #18483)\n  Disable  console in the second render pass of DEV mode double render. ( @sebmarkbage in  #18547)\n      Disable  &lt;div hidden /&gt; prerendering in favor of a different future API. ( @acdlite in  #18917)\n        Fix a bug causing dropped updates in a suspended tree. ( @acdlite in  #18384 and  #18457)\n     Fix a bug with inputs that may cause updates to be dropped. ( @jddxf in  #18515 and  @acdlite in  #18535)\n  Don’t cut off the tail of a SuspenseList if hydrating. ( @sebmarkbage in  #18854)", "posttime": "2020-10-21 21:32:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "reaction,react", "title": "Reaction v17.0", "title_en": "React v17.0", "transed": 1, "url": "https://reactjs.org/blog/2020/10/20/react-v17.html", "via": "", "real_tags": ["reaction", "react"]}, {"category": "", "categoryclass": "", "imagename": "86b555749baf11367895c46c7d0b6380.jpg", "infoid": 1030305, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年是6月大放异彩的时候。随着越来越多的人被困在家里，试图(经常失败)在厨房里照顾自己，这家智能烤箱初创公司有一个坚实的机会来大幅扩大用户基础。\nCTO兼联合创始人尼基尔·博加尔(Nikhil Bhogal)在一份新闻稿中表示：“家庭烹饪的兴起促使我们重新评估6月份的烹饪项目，以实现标准家庭烤箱无法捕捉到的更多烹饪可能性。”\n今天，该公司宣布推出第三代烤箱，距离上一次重大更新已经过去了两年。从声音上看，这次更新是相对较小的一次。烤箱的硬件有几个升级，包括一个新的手柄，在加热元件上增加了护栏，更安静的风扇和具有更好的无线连接的新芯片组。\n其功能的最大变化是能够单独控制其六个加热元件中的每一个(而以前的型号仅将它们作为组控制)，以实现更均匀的烘烤。软件界面也进行了升级，机载AI摄像头系统能够识别食物放置在哪里，以进行最佳烹饪，并可以识别数百种不同的食物类型。\n599美元的价格，仍然是一款昂贵的厨房电器。该系统相当于一个巨大的、智能的烤面包机烤箱-尽管它有一堆不同的食物烹饪选择，从空气煎炸到脱水和烘烤。价格从那里开始上涨。799美元的捆绑包增加了一年的保修期，其中包括6月份的高级服务的一年订阅，以及999美元的版本，其中包括一系列额外的附加组件，包括气篮、披萨和烧烤套件以及额外的温度计。", "note_en": "2020 is  June’s   time to shine. With an increasing number of people stuck and home, trying (and often failing) to fend for themselves in their kitchen, the smart oven startup has a solid opportunity to considerably expand its users base.\n “The rise in at-home cooking has caused us to reevaluate June’s cook-programs to achieve more culinary possibilities not captured by a standard home oven,” CTO and co-founder Nikhil Bhogal said in a release.\n  Today it announced the launch of a third-generation oven, two years after its last major update. From the sound of it, the update is a relatively minor one. There are a handful of upgrades to the oven’s hardware, including a new handle, added guard rails on top of heating elements, quieter fans and a new chipset with better wireless connection.\n  The biggest change to its functionality is the ability to control each of its six heating elements individually (whereas the previous model only controlled them as groups) for more even roasts. The software interface has gotten an upgrade, as well, and the on-board AI camera system is capable of recognizing where the food is placed for optimal cooking and can identify hundreds of different food types.\n  At $599, it’s still a pricy kitchen appliance. The system amounts to a large, smart toaster oven — albeit one with a bunch of different food-cooking options, from air frying to dehydrating and broiling. The price goes up from there. There’s a $799 bundle that adds a year to the warranty and includes a one-year subscription to the June premium service and a $999 version that includes a bunch of additional add-ons, including air baskets, a pizza and grill kit and additional thermometers.", "posttime": "2020-10-21 21:16:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "烤箱,gen,烹饪", "title": "\n6月第三代智能烤箱接受预订，起价599美元", "title_en": "\n\t\t\t\tJune’s third-gen smart oven goes up for pre-order, starting at $599\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/21/junes-third-get-smart-goes-up-for-pre-order-starting-at-599/", "via": "", "real_tags": ["烤箱", "gen", "烹饪"]}, {"category": "", "categoryclass": "", "imagename": "15909d43062dd22fcfefae694734c3c5.jpg", "infoid": 1030304, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于特拉维夫的视觉搜索和产品发现平台Syte已经被Farfetch和Fashion Nova等品牌使用，该平台计划在最新一轮融资后在美国和亚太地区扩张。这家初创公司今天宣布，它已经筹集了3000万美元的C系列债券，另外还有1000万美元的债务。\n这轮融资由Viola Ventures牵头，LG Tech Ventures、La Maison、MizMaa Ventures、Kreos Capital以及返回投资者Magma、Naver Corporation、Commerce Ventures、Storm Ventures、Axess Ventures、Remagine Media Ventures和KDS Media Fund都参与了这轮融资。Syte的上一轮融资是2150万美元的B系列，是在2019年9月宣布的。这家初创公司现在已经总共筹集了7100万美元。\nSyte于2015年推出，专注于服装的视觉搜索，现在涵盖了珠宝和家居装饰等其他垂直领域，并被Farfetch、Fashion Nova、Castorama和Signet珠宝商等品牌使用。赛特表示，其解决方案平均可以将转化率提高177%。\n该公司的平台包括三个主要产品：Visual Discovery，让品牌添加相机搜索、推荐引擎和发现按钮；“Searchendising”，它基于视觉AI自动生成标签，以改善搜索和推荐结果；以及一个供出版商、智能设备制造商和社交平台使用的Discovery Marketplace，用于扩大产品广告的覆盖范围。\n赛特表示，自2020年初以来，其客户群增长了38%，部分原因是新冠肺炎的行动限制导致电商流量增加。\n在公司的新闻公告中，首席执行官兼联合创始人奥弗·弗莱曼表示，赛特公司将专注于开发或获取“覆盖我们所有感官--视觉、文本、语音等”的产品发现技术，以创建个性化的推荐类型。\nSyte目前的许多客户都在欧洲、中东和非洲，因此它的新资金也专门用于增加其在美国和亚太市场的影响力。\n包括亚马逊、塔吉特、宜家、沃尔玛、eBay、Snap和Pinterest在内的更多社交媒体平台和电子商务平台正在使用视觉搜索和识别技术，为用户提供关键字搜索之外的另一种选择。通过简化搜索过程或自动生成标签，视觉识别技术可以帮助改进搜索结果和产品推荐，从而提高转换率。\n还有一批其他公司也在为电子商务开发基于人工智能的视觉识别和搜索技术。同一领域其他筹集了风险投资的初创公司包括Donde Search、ViSenze和Slyce。\nSyte负责市场营销的副总裁Gal Fontyn告诉TechCrunch，它与联合创始人兼首席技术官Helge Voss开发的视觉人工智能算法不同，Helge Voss之前曾在CERN(欧洲核研究组织)担任物理学家。\nFontyn说，Voss在神经网络和机器学习方面的背景使Syte建立了一种视觉搜索解决方案，可以在不到一秒的时间内产生对象匹配准确率超过95%的结果。它的算法还接受了来自世界各地供应商的数百万种产品的培训，Syte声称这给了它“行业内最大的垂直特定词典”。这使得它能够识别图像中的几个对象，并为它们分配详细的标签。", "note_en": "Tel Aviv-based visual search and product discovery platform  Syte, already used by brands like Farfetch and Fashion Nova, plans to expand in the United States and Asia-Pacific region after its latest funding. The startup announced today it has raised a $30 million Series C, with an additional $10 million in debt.\n The round was led by Viola Ventures, with participation from LG Tech Ventures, La Maison, MizMaa Ventures, Kreos Capital, and returning investors Magma, Naver Corporation, Commerce Ventures, Storm Ventures, Axess Ventures, Remagine Media Ventures and KDS Media Fund. Syte’s last round of funding, a $21.5 million Series B, was announced in September 2019. The startup has now raised a total of $71 million.\n   Launched in 2015 to focus on visual search for clothing, Syte’s technology now covers other verticals like jewelry and home decor, and is used by brands including Farfetch, Fashion Nova, Castorama and Signet Jewelers. Syte says that its solutions can increase conversion by 177% on average.\n The company’s platform includes three main products: Visual Discovery to let brands add camera search, recommendation engines and discovery buttons; “Searchendising,” which automatically generates tags based on visual AI to improve search and recommendation results; and a Discovery Marketplace used by publishers, smart devices manufacturers and social platforms to increase the reach of product advertisements.\n Since the beginning of 2020, Syte says its customer base has grown 38%, partly because of the increase in e-commerce traffic caused by COVID-19 movement restrictions.\n In the company’s press announcement, chief executive officer and co-founder Ofer Fryman said Syte will focus on developing or acquiring product discovery technology “spanning the full range of our senses—visual, text, voice, and more” to create types of personalized recommendations.\n A lot of Syte’s current customers are in Europe, the Middle East and Africa, so its new funding is also earmarked to increase its presence in the U.S. and Asia-Pacific markets.\n More social media platforms and e-commerce platforms, including Amazon, Target, IKEA, Walmart, eBay, Snap, and Pinterest, are using visual search and recognition technology to give users an alternative to keyword searches. By simplifying the search process or automatically generating tags, visual recognition technology can help improve search results and product recommendations, resulting in more conversions.\n There is a roster of other companies that are also working on AI-based visual recognition and search technology for e-commerce. Other startups in the same space that have raised venture capital funding  include Donde Search,  ViSenze and  Slyce.\n Gal Fontyn, Syte’s vice president of marketing, told TechCrunch that it differentiates with visual AI algorithms developed by co-founder and chief technology officer Helge Voss, who previously worked as a physicist at CERN (the European Organization for Nuclear Research).\n Voss’ background in neural networks and machine learning allowed Syte to build a visual search solution that can produce results with over 95% accuracy in object-matching within less than a second, Fontyn said. Its algorithms have also been trained on millions of products from vendors around the world, which Syte claims gives it the “largest vertical-specific lexicon in the industry.” This is what allows it to recognize several objects within an image, and assign them detailed tags.", "posttime": "2020-10-21 21:16:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,亚洲,series,ventures", "title": "\n电商视觉搜索平台Syte获3,000万美元C系列在美国和亚洲扩张", "title_en": "\n\t\t\t\tSyte, an e-commerce visual search platform, gets $30 million Series C to expand in the U.S. and Asia\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/21/syte-an-e-commerce-visual-search-platform-gets-30-million-series-c-to-expand-in-the-u-s-and-asia/", "via": "", "real_tags": ["美国", "亚洲", "series", "ventures"]}]