[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1066856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在没有人甚至尝试的情况下，我写道，Grant Sanderson的YouTube频道3B1B有1.61亿观。根据YouTube如何计算“观点”，这是1.3和2140万小时的学习。\n 这对我来说是令人难以置信的。如果你昨晚问我，我的英雄是谁，我会说格兰特桑德逊。如果你问我对世界有什么问题，我会说没有更多的人喜欢他。\n  常规教师，每年180天教学凌晨8点至每年180天，每年生产25,000个学习时间！超过50年的职业生涯，这是130万，与桑德森相同，虽然在10倍的时间里。\n 将老师与Khan Academy进行比较是更令人惊讶的。取决于您如何计算的“观点”，它们的学习时间为1500万至12.12亿。但他们有600名员工，他们已经发生了12年了。因此，与普通教师的25,000人相比，这是每年17,000件，最差的2,000件学习时间，每年员工每年学习时间。\n 这是一个有点不公平的，Khan Academy没有600名员工，整整12年。但是，如果我们假设线性增长，他们将平均员工300人，这将使他们的学习时间增加到4,000（最好的案例33,000）。\n 要清楚，这一点不是Khan Academy是糟糕的（它们有更多的方式比讲座更好，并且他们可以免费提供任何有互联网连接的人）。这一点是，看似不可扩展的东西，如教学仍然可以乘以令人惊讶的巨大影响。\n 由于YouTube的观点是清晰和量化的，因此很容易看到100,000,000，并且觉得真的印象深刻。但是将一个视图算到30秒，一位带有20名学生和50年的职业的老师可以达到130万学习时间，相当于1.51亿“意见”！ \n到目前为止，我没有那么多尊重老师。我明白他们可能是好人，很多人都教授作为爱的劳动，但我并不欣赏他们的影响。\n 事实上，教学一直是我的榜样，以说明利他主义与地方意见有何不同程度翩翩。教学似乎是一件伟大的工作，但如果你通过EA镜头思考它，它就不是很有影响。 80,000小时有非常负面的教学审查，另一个原因不参加教育。\n 我没有学到的，最近没有让那些文章失效。然而，难以调和我对桑德逊敬畏似乎效率的信念。一如既往，一个人的Modus Ponens是另一个男人的Modus Tollens。我可以拥有我想要的任何信念，而不是两个人都是他们一次。任何教师都是英雄，桑德森只是适度的赞誉。\n  你正在开车穿过一个小镇，在午餐时停下来，听到一位老师的谣言，他们提供异常搞讲座。因为有兴趣教学和社会影响的尺度感兴趣，你决定亲自看看，并肯定，老师的惊人！\n 你的第一个想法是什么？如果你像我一样，你的第一个有意识的反应将是“我们必须在youtube上得到这个家伙！”如果你像我一样，你会认为这是一个可怕的浪费，因为他可以在互联网上陷入一个小镇，在互联网上陷入困境，以规模向群众提供内容。\n 所以你和他谈谈，建立一部小电影船员，说服他休假教学记录YouTube讲座，并肯定是一个打击！在您的前几年内，他的意见高达了1000万。\n 然而，事实证明直觉是完全错误的。他已经每隔几年时间在“1000万次观看”中时钟。当然存在在线的好处。记录内容，学生可以在世界上任何地方，如果您错过了一个部分，您可以回去。但没有一个感觉足以证明我的初步反应。 \n也许我只是一个无耻的Techephile追溯了我的信仰，但我认为揭露桑德隆仍有充分的理由。  我喜欢3B1B视频，因为它们是创造性的，并以数学从未在学校的方式上。 它真正感觉他通过任何混淆来阻止孩子从理解数学，并发现解释关键概念的更好方式。 因为数学是如此基本的推理，这不仅仅是一个良好的教育渠道。 感觉几乎就像是一个文明的飞跃。  但仍然，这不是公制的有效利他主义关心。 也许真正的Modus Tollens是Abbandon值系统。 ", "note_en": "In  No One is Even Trying, I wrote that Grant Sanderson’s Youtube channel  3B1B has 161 million views. Based on how Youtube counts “views”, that’s between 1.3 and 21.4 million hours of learning.\n This is incredible to me. If you asked me last night who my hero is, I would have said Grant Sanderson. If you asked me what’s wrong with the world, I would have said that there aren’t more people like him.\n  A regular teacher, teaching 8am–3pm  180 days a year to a  class of 20 is producing 25,000 learning hours a year! Over a 50 year career, that’s 1.3 million, same as Sanderson, though in 10x as much time.\n It’s even more surprising to compare a teacher with Khan Academy. Depending on how you count “views” they’re at 15 million to 120 million learning hours. But they have 600 employees, and they’ve been around for 12 years. So that’s best case 17,000, worst case 2,000 learning hours per employee per year, compared to a regular teacher’s 25,000.\n That’s a little unfair, Khan Academy hasn’t had 600 employees for the full 12 years. But if we assume linear growth, they’ve averaged 300 employees, which would increase their learning hours to 4,000 (best case 33,000).\n To be clear, the point is not that Khan Academy is bad (they have way more than lectures, and they’re available to anyone with an internet connection for free). The point is that seemingly non-scalable things like teaching can still multiply out to surprisingly large impact.\n Since views counts on Youtube are  legible and quantified, it’s really easy to see 100,000,000 and feel really impressed. But counting a view as 30 seconds, a teacher with 20 students and a 50 year career could hit 1.3 million learning hours, the equivalent of 151 million “views”!\n Until now, I didn’t have that much respect for teachers. I understood that they’re probably good people, and a lot of them teach as a labor of love, but I didn’t appreciate their impact.\n In fact, teaching has been my go-to example for illustrating how effective altruism differs from lay person opinions. Teaching seems like a great job, but if you think about it through an EA lens, it’s just not very impactful. 80,000 hours has very negative reviews of  teaching, and another article of  reasons not to go into education.\n Nothing I’ve learned recently invalidates those articles. And yet, it’s hard to reconcile my belief in the seeming inefficacy of teaching jobs with my reverence for Sanderson. As always,  one man’s modus ponens is another man’s modus tollens. I can have whichever belief I want, but not both of them at once. Either teachers are heroes, or Sanderson is merely moderately praiseworthy.\n  You’re driving through a small town, and while stopping for lunch, hear rumors of a teacher who delivers unusually engaging lectures. As someone interested in pedagogy and social impact at scale, you decide to go check it out in person, and sure enough, the teacher’s amazing!\n What would your first thought be? If you’re like me, your first conscious reaction would be “we’ve got to get this guy on Youtube!” If you’re like me, you see it as a horrendous waste of potential that this brilliant educator is stuck in a small town when he could be on the internet, delivering content to the masses at scale.\n So you talk to him, set up a small film crew, convince him to take time off teaching to record Youtube lectures, and sure enough it’s a hit! Within your first few years, he’s up to 10 million views.\n And yet, it turns out that intuition is totally wrong. He was already clocking in “10 million views” every few years. Of course there are benefits of being online. The content is recorded, the students could be anywhere in the world, you can go back if you missed a section. But none of that feels sufficient to justify my initial reaction.\n Maybe I’m just a shameless technophile retroactively justifying my beliefs, but I think there’s still a good reason to revere Sanderson.\n I love 3B1B videos because they’re creative and engaging in a way that math never was in school. It genuinely feels like he’s broken through whatever obfuscation prevents kids from understanding math, and discovered better ways of explaining key concepts. And because math is so fundamental to reasoning, this is more than a good educational channel. It feels almost like a leap forward for civilization.\n But still, that’s not a metric effective altruism cares about. Maybe the real modus tollens is to abbandon the value system.", "posttime": "2021-06-19 16:56:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教师,views,教学", "title": "修改我对教师的影响的看法 ", "title_en": "Revising My Views on the Impact of Teachers", "transed": 1, "url": "https://applieddivinitystudies.com/rethinking-education/", "via": "", "real_tags": ["教师", "views", "教学"]}, {"category": "", "categoryclass": "", "imagename": "25f4847adef0ce157d1b0da2dfb8c1ad.jpg", "infoid": 1066855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当人类基因组首次被认为是“完整”2000年时，新闻与伟大的国际粉丝达成了。两位竞争团体争夺基因组第一 - 一个大型政府主导的联盟，另一家私人公司 - 同意宣布联合成功。他们在白宫握手。比尔克林顿主持。托尼布莱尔在伦敦横梁。 “我们在科学历史上的一个非凡时刻，”当那些基因组出版时，一个着名的科学家宣布。 “就好像我们已经爬到了喜马拉雅山的顶端。”\n 但实际上，人类基因组未完成。既不达到真正的峰会。常如当代覆盖范围承认，该版本更像是粗略的草稿，用长长的延伸地缠绕，DNA序列仍然模糊或缺失。私营公司很快旋转并结束了人类基因组项目，虽然具有公共财团士兵的科学家。 2003年，随着呼吸较少但仍有大量的头条新闻，人类基因组再次宣布完成。\n 但实际上，人类基因组仍然没有完成。即使修订后的草案也缺少约8％的基因组。这些是最难的序列区域，充满了重复的字母，这是当时的技术无法阅读。\n  最后，这可能是一群独立的科学家悄悄地发布了一篇在线上面描述了可以被认为是第一个真正完善的人类基因组-A-A读出23例人类染色体的所有305.5亿字母。由相对年轻的研究人员领导的小组聚集在一起，从世界各地闲逛，完成20年前遗弃的任务。这次没有泼白房子宣布，没有谈论喜马拉雅山的总结;本文本身仍在审查日志中的官方出版物。但缺乏庞培的屏蔽这是一项成就：为了完成人类的基因组，这些科学家必须弄清楚如何弄清楚最神秘和忽视的重复地区，这现在最终可能会得到他们的科学。\n “我认为这是一个地标，”弗雷德·哈钦森癌症研究中心的分子生物学家史蒂文·亨尼克说，他没有参与该项目。 Henikoff研究其中一个神秘的难以序列地区，其中以前的人类基因组项目已经放弃了：Centromeres，这是每种染色体的略微夹持的中间。染色体，其中人有23对，每个都包括长，连续的DNA，可以冷凝成杆状; Centromere的DNA特别密集。\n 在五个人体染色体上，Centromere不在中间，但非常接近一端，将染色体分成一个长而一个非常短的臂。这些短臂也充满了从未完全测序的重复。 Centromeres，短武器和其他类型的重复区域组成了大部分的2.38亿字母，该联盟最终添加或纠正在人类基因组中。\n  人类基因组的重复含量通常不会含有基因，这是他们长期被忽视的一个原因。遗传学家在很大程度上集中在基因上，因为它们的功能是显而易见和简单的：基因编码蛋白质。 （人类基因组的早期草案的一个大惊喜是我们的DNA实际编码蛋白质的少点 - 只有1％。剩下的99％的作用变得更加清晰。）确实，有暗示这些重复的地区还在基因所表达和传递的基因中发挥重要作用，而他们的异常与癌症和老化有关。联盟发现了79个在重复中隐藏的新基因。通过终于在手中的地图上，科学家可以更仔细地探测它们的功能。 \n完成基因组的努力是“完全基层”，国立卫生研究院的计算遗传主义者，他们共同领导地端身致拓（T2T）联盟完成了基因组。 （端粒体是染色体末端的区域，所以端粒为Telometere意味着“结束结束”。）Phillippy和Karen MIGA，UC Santa Cruz的遗传手，决定在2018年在他们意识到这一点后在20​​18年创建联盟他们都有题为结束人类基因组的野心。\n “我爱上了重复，”米格娜说，作为一名生物学家试图了解那些重复的人。腓利菲，一位计算机科学家通过培训，带来了技术性的作弊。传统的测序技术片段DNA成小块，计算机算法必须像拼图一样重新组装它们。问题是，来自重复区域的碎片都看起来几乎相同。现在两个新的“长读”测序技术 - 叫做Pacbio Hifi和牛津纳米奥波尔 - 允许科学家们阅读更长的基因组。这些定序器仍然无法处理足够大的块以越过整个CENTROMERE或短臂，但至少算法具有更大的拼图组装。\n Centromere序列的作用，如许多其他重复区域，尚未完全理解，但它们是最被称为细胞分裂的关键。当一个细胞分为两个时，蛋白质主轴附着在焦点上时，将染色体分开，以确保每个细胞都获得正确的数量。当鸡蛋或精子中出现问题时，婴儿可以生出染色体异常，如唐氏综合征或旋转综合征。当它在身体的其他部位出现问题时，我们可以最终血细胞，例如，染色体过多或太少。这是老龄化的标志：70岁以上的男性对其血细胞中的y染色体失去了不寻常。在与完整基因组共同上传的两个伴随文件中，T2T联盟表明，牛津纳米孔的长读技术也可用于映射蛋白质主轴附着在厘米上的位置。检查这些区域中的序列可能会产生新的染色体异常线索。\n  染色体的重复的富有的短臂类似地是神秘的。它们绝对在将基因转化为蛋白质的细胞机制中发挥了一些作用，并且了解它们的序列可以在该功能上流动更多光。 Brian McStay是戈尔韦国立大学的生物学家，将完整的基因组比对染色体的“零件清单”并将科学家们逐一尝试取出建筑物的“零件清单”。 “知道这个零件清单是什么，我们可以说，'这正是我们的染色体看起来像什么'”McStay说。 “'让我们删除它，看看对该染色体功能的影响是什么。'”\n 令人印象深刻的是测序完整的人类基因组的技术壮举是，科学家告诉我，一个基因组只是一个快照。看到这些重复区域如何随着时间的推移而变化，物种对物种，将更有趣。 “癌症发生了什么？发展中发生了什么？如果将后代与父母比较会发生什么？“亨基夫说。该联盟证明，这些重复区域与新的长读技术一起排序。现在他们可以应用于更多基因组，让科学家与另一个人一起比较一个。\n 事实上，MIGA说，最终的梦想是让科学家试图从端到端完成序列的每个基因组，端子才能端身。但首先，该集团的目标是更直接的目标。如果你想用新的基因组没有“完成”，你可以指出它只有单一组23染色体，而正常人体细胞有23对。为了简化任务，本组使用来自特定类型的肿瘤的细胞，从异常受精卵产生并最终用23个单一染色体。该团队将不得不使用不同的细胞，23对染色体，完成所谓的“二倍体”基因组。\n  “下一个主要的里程碑将是常规的二倍体基因组，”哥本哈根大学遗传学家的吉尔帕卡格说，丹麦。 Garg已经使用Pacbio Hifi快速组装人类基因组 - 减去一些棘手的区域，例如焦化区域 - 以每天少数速度。通过使医生更容易使用基因组测序更容易诊断患者，这种速度也有助于临床环境。 （相比之下，她说，从较旧的测序技术组装种植体，只要三个星期即可服用。）真正完善的基因组测序，重复区域和所有，都变得更加容易和更快。很快，另一个完整的人类基因组根本不会成为新闻。 ", "note_en": "When the human genome was first  deemed “complete” in 2000, the news was met with great international fanfare. The two rival groups vying to finish the genome first—one a large government-led consortium, the other an underdog private company—agreed to declare joint success. They shook hands at the White House. Bill Clinton presided. Tony Blair  beamed in from London. “We are standing at an extraordinary moment in scientific history,”  one prominent scientist declared when those genomes were published. “It’s as though we have climbed to the top of the Himalayas.”\n But actually, the human genome was not complete. Neither group had reached the real summit. As even the contemporary coverage acknowledged, that version was more of a rough draft, riddled with long stretches where the DNA sequence was still fuzzy or missing. The private company soon pivoted and ended its human-genome project, though scientists with the public consortium soldiered on. In 2003, with less glitz but still  plenty  of headlines, the human genome was declared complete once again.\n But actually, the human genome was  still not complete. Even the revised draft was missing about 8 percent of the genome. These were the hardest-to-sequence regions, full of repeating letters that were simply impossible to read with the technology at the time.\n  Finally, this May, a separate group of scientists quietly posted a  preprint online describing what can be deemed the first truly complete human genome—a readout of all 3.055 billion letters across 23 human chromosomes. The group, led by relatively young researchers, came together on Slack from around the world to finish the task abandoned 20 years ago. There was no splashy White House announcement this time, no talk of summiting the Himalayas; the paper itself is still under review for official publication in a journal. But the lack of pomp belies what an achievement this is: To complete the human genome, these scientists had to figure out how to map its most mysterious and neglected repeating regions, which may now finally get their scientific due.\n “I consider this a landmark,” says Steven Henikoff, a molecular biologist at Fred Hutchinson Cancer Research Center, who was not involved in the project. Henikoff studies one of those enigmatic, hard-to-sequence regions where previous human-genome projects had given up: centromeres, which are the slightly pinched middles of each chromosome. Chromosomes, of which humans have 23 pairs, each consist of a long, continuous stretch of DNA that can be condensed into a rod shape; the DNA at the centromere is particularly dense.\n On five human chromosomes, the centromere is not in the middle but very close to one end, dividing the chromosome into one long and one very short arm. These short arms are also full of repeats that had never been entirely sequenced until now. Centromeres, short arms, and other types of repeating regions made up most of the 238 million letters the consortium ultimately added or corrected in the human genome.\n  The repeat-rich segments of the human genome do not usually contain genes, which is one reason they’ve long been neglected. Geneticists have focused largely on genes because their function is obvious and simple: A gene encodes a protein. (One big surprise of the earlier drafts of the human genome is how little of our DNA actually encodes proteins— only 1 percent. The role of the remaining 99 percent is becoming clearer.) Indeed, there have been hints that these repeat-rich regions also play important roles in how genes get expressed and passed on, and anomalies in them have been  linked to cancer and aging. The consortium found 79 new genes hidden among the repeats too. With a map of these repeating regions finally in hand, scientists can probe more carefully their function.\n The effort to finish the genome was “entirely grassroots,” says Adam Phillippy, a computational geneticist at the National Institutes of Health who co-leads the  Telomere-to-Telomere (T2T) consortium that completed the genome. (Telomeres are the regions at the ends of chromosomes, so telomere to telomere means “end to end.”) Phillippy and Karen Miga, a geneticist at UC Santa Cruz, decided to create the consortium in 2018, after a call when they realized that they both harbored ambitions of finishing the human genome.\n “I’m in love with repeats,” says Miga, who came to the project as a biologist trying to understand what those repeats do. Phillippy, a computer scientist by training, brought technical chops. Traditional sequencing technologies fragment DNA into small pieces, and computer algorithms have to reassemble them like puzzle pieces. The problem is that the pieces from repeating regions all look nearly the same. Now two new “long-read” sequencing technologies—called PacBio HiFi and Oxford Nanopore—allow scientists to read longer stretches of the genome. These sequencers still can’t handle chunks big enough to cross an entire centromere or a short arm, but at least the algorithms have larger puzzle pieces to assemble.\n The role of centromere sequences, like many other repeating regions, is not yet fully understood, but they are most classically known as the key to cell division. When a cell divides in two, a protein spindle attaches to the centromeres, yanking the chromosomes apart to make sure that each cell gets the right number. When this goes wrong in eggs or sperm, babies can be born with chromosomal anomalies such as  Down syndrome or Turner syndrome. When it goes wrong in other parts of the body, we can end up with blood cells, for example, that have too many or too few chromosomes. This is a hallmark of aging: It’s not unusual for men older than 70  to have lost the Y chromosomes in their blood cells. In  one of two  companion papers uploaded alongside the complete genome, the T2T consortium showed that Oxford Nanopore’s long-read technology can also be used to map where exactly the protein spindle attaches to the centromere. Examining the sequences in those regions might yield new clues to chromosomal anomalies.\n  The repeat-rich short arms of the chromosomes are similarly mysterious. They definitely play some role in the cellular machinery that translates genes into proteins, and knowing their sequences could shed more light on that function. Brian McStay, a biologist at the National University of Ireland at Galway, likens the complete genome to a “parts list” for chromosomes that allows scientists to try taking out the building blocks one by one. “Knowing what this parts list is, we can say, ‘This is exactly what our chromosome looks like,’” McStay says. “‘Let’s delete this and see what the impact on the function of that chromosome is.’”\n As impressive as the technical feat of sequencing a complete human genome is, scientists told me that one genome is only one snapshot. Seeing how these repeating regions change over time from person to person, species to species, will be far more interesting. “What happens in cancer? What happens in development? What happens if you compare offspring to parents?” Henikoff says. The consortium proved that these repeating regions are sequenceable with the new long-read technologies. Now they can be applied to more genomes, allowing scientists to compare one with another.\n Indeed, Miga says that the ultimate dream is to make every genome that scientists attempt to sequence complete from end to end, telomere to telomere. But first, the group has a more immediate goal in mind. If you wanted to fault the new genome for not being “complete,” you could point to the fact that it comprises only a single set of 23 chromosomes, whereas normal human cells have 23 pairs. To simplify the task, the group used cells from a particular type of tumor that develops from an abnormal fertilized egg and ends up with just 23 single chromosomes. The team will have to use different cells, with 23 pairs of chromosomes, to complete what is known as a “diploid” genome.\n  “The next major milestone would be routine diploid genomes,” says Shilpa Garg, a geneticist at the University of Copenhagen, in Denmark. Garg  has used PacBio HiFi to rapidly assemble human genomes—minus some tricky regions such as the centromeres—at a rate of a few per day. That speed could help in clinical settings too, by making it easier for doctors to more regularly diagnose patients using genome sequencing. (In comparison, she says, assembling genomes from older sequencing technology takes as long as three weeks.)  Truly complete genome sequencing, repeating regions and all, is getting easier and faster. Soon, another complete human genome will not be news at all.", "posttime": "2021-06-19 16:56:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,genome,基因组", "title": "人类基因组是最终 - 实现 ", "title_en": "The Human Genome Is–Finally –Complete", "transed": 1, "url": "https://www.theatlantic.com/science/archive/2021/06/the-human-genome-is-finally-complete/619172/", "via": "", "real_tags": ["人类", "genome", "基因组"]}, {"category": "", "categoryclass": "", "imagename": "aab1ed9e29b4b69a213af8be55664cbe.jpeg", "infoid": 1066854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook表示，苹果公司的计划隐私保护将严重损害其业务的一部分。\n 未经IOS 14的同意，Apple计划使应用程序更难跟踪用户数据。\n Facebook表示，这可能会严重损害受众网络广告网络，将收入减少50％。\n 观众网络只是Facebook更广泛的广告业务的一部分，该公司表示，这些变化也会损害使用它的企业。\n 苹果公司正在努力跟踪人们跨应用程序的数据 - 以及Facebook表示它可能对其业务的一部分产生破坏性影响。\n  星期三，硅谷 - 总部总部社交网络巨头发布了一个博客后解密改变Apple计划的IOS 14移动操作系统。 Apple打算防止应用程序跟踪用户使用其独特的设备标识符或IDFA，而无需其显式许可 -  Facebook的受众网络用于个性化第三方应用程序的广告。\n Facebook表示，这样做会对观众网络产生重大影响，因此由于无法提供更有价值的目标广告，因此将其收入减少到50％。该公司表示，它甚至可能迫使Facebook停止为iOS开发观众网络。 \n“这不是我们想要的变化，但遗憾的是，Apple对iOS 14的更新迫使这一决定。我们知道这可能会严重影响出版商通过IOS 14上的受众网络货币的能力，尽管我们的最佳努力，可能会使观众网络在iOS 14上如此无效，因为在未来的iOS 14上可能没有意义，可以在iOS 14上提供它， “博客帖说。\n 观众网络只有一片Facebook的收入（这毫不清楚地尚不清楚），其自己的应用程序内的广告核心业务将不受影响。但任何缩减数据收集的企图都可能对Facebook构成威胁，而该公司最近对监管机构和平台改变姿势的风险的声音。\n 在最近与分析师的盈利呼吁期间，公司高管认为Facebook是大流行期间的小企业的“生命线”，阻止他们有效地瞄准广告的人可能会有危险的“宏观经济效应”。\n 这是一个论点，Facebook在星期三博客文章中重申：“我们了解iOS 14将在已经困难的时间伤害我们的许多开发商和出版商。我们在全球范围内使用了超过19,000名开发人员和出版商，并在2019年，我们支付了数十亿美元。其中许多是小企业，依赖广告支持他们的生计。“\n 你在Facebook工作吗？通过加密消息应用程序（+1 650-636-6268），加密电子邮件（[电子邮件保护]），标准电子邮件（[电子邮件保护]），电报/ wickr / wechat（Robaeprice）或Twitter dm（@robaeprice）。我们可以让来源匿名。使用非工作设备伸出。请仅由标准电子邮件投球。 ", "note_en": "Facebook is saying that Apple’s planned privacy protections will severely damage part of its business.\n Apple plans to make it harder for apps to track users’ data without their consent in iOS 14.\n Facebook said this could severely hurt its Audience Network ad network, reducing revenue by up to 50%.\n Audience Network is just one part of Facebook’s broader ad business, and the company said the changes would also hurt businesses that use it.\n Apple is making it harder for companies to track people’s data across apps – and Facebook says it could have devastating effects on part of its business.\n  On Wednesday, the Silicon Valley-headquartered social-networking giant   published a blog post decrying changes Apple has planned for its   iOS 14 mobile operating system. Apple intends to prevent apps from tracking users using their unique device identifier, or IDFA, without their explicit permission – something that Facebook’s Audience Network uses to personalise advertising in third-party apps.\n Facebook said that doing so would have a significant impact on Audience Network, cutting its revenue on iOS by up to 50% because of an inability to deliver more valuable, targeted advertising. It may even force Facebook to stop developing Audience Network for iOS altogether, the company said.\n “This is not a change we want to make, but unfortunately Apple’s updates to iOS 14 have forced this decision. We know this may severely impact publishers’ ability to monetise through Audience Network on iOS 14, and, despite our best efforts, may render Audience Network so ineffective on iOS 14 that it may not make sense to offer it on iOS 14 in the future,” the blog post said.\n Audience Network is only one piece of Facebook’s revenue (it’s unclear precisely how much), and its core business of advertising inside its own apps will be unaffected. But any attempt to curtail data collection can pose a threat to Facebook, and the company has recently been vocal about the risks that regulators and platform changes pose.\n During a recent earnings call with analysts,   company executives argued that Facebook was a “lifeline” for small businesses during the pandemic and that preventing them from effectively targeting people with ads could have dangerous “macro-economic effects.”\n It’s an argument that Facebook reiterated in its Wednesday blog post: “We understand that iOS 14 will hurt many of our developers and publishers at an already difficult time for businesses. We work with more than 19,000 developers and publishers from around the globe and in 2019 we paid out billions of dollars. Many of these are small businesses that depend on ads to support their livelihood.”\n Do you work at Facebook? Contact Business Insider reporter Rob Price via encrypted messaging app Signal (+1 650-636-6268), encrypted email ( [email protected]), standard email ( [email protected]), Telegram/Wickr/WeChat (robaeprice), or Twitter DM ( @robaeprice). We can keep sources anonymous. Use a non-work device to reach out. PR pitches by standard email only, please.", "posttime": "2021-06-19 16:20:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,操作系统,apple,facebook", "title": "Apple的新款iPhone操作系统正在使Facebook更难跟踪人员，并且Facebook警告它将遭受其业务的一部分 ", "title_en": "Apple's new iPhone operating system is making it harder for Facebook to track people, and Facebook warns it will decimate part of its business", "transed": 1, "url": "https://www.businessinsider.com.au/facebook-apple-ios-14-damage-audience-network-ad-business-2020-8", "via": "", "real_tags": ["iphone", "操作系统", "apple", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "94882934980c1ea31c1803d9f8acf65a.png", "infoid": 1066853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马萨诸塞官方Covid-19自动曝光通知应用程序 ", "note_en": "Massachusetts’ official COVID-19 Automated Exposure Notification app", "posttime": "2021-06-19 16:13:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,程序,安装,massachusetts", "title": "谷歌和马萨诸塞州未经同意或通知安装了应用程序 ", "title_en": "Google and Massachusetts have installed an app without consent or notification", "transed": 1, "url": "https://play.google.com/store/apps/details?id=gov.ma.covid19.exposurenotifications.v3&showAllReviews=true", "via": "", "real_tags": ["google", "谷歌", "程序", "安装"]}, {"category": "", "categoryclass": "", "imagename": "21baa3c62f4fff153b9c585393afba73.png", "infoid": 1066852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所有RGB的目的很简单：为每个RGB颜色创建一个像素的图像（16,777,216）; 不是一种颜色丢失，而不是一种颜色两次。 ", "note_en": "The objective of all RGB is simple: To create images with one pixel for every  RGB color ( 16,777,216); not one color missing, and not one color twice.", "posttime": "2021-06-19 16:13:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "allrgb,颜色", "title": "AllRGB. ", "title_en": "AllRGB", "transed": 1, "url": "https://allrgb.com/", "via": "", "real_tags": ["allrgb", "颜色"]}, {"category": "", "categoryclass": "", "imagename": "a81b20264a51be670f2804fd81d39f8d.jpeg", "infoid": 1066851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据联邦数据的说法，今年迄今为止，今年距离今年的新野火数量达到了十年高位。促使警告长期，潜在危险的火灾。\n  现在最受关注的领域之一是犹他州，内华达州和俄勒冈州东部的高沙漠伟大的盆地地区。\n  ＆＃34;当你站立死草时，当我们有高热量时，当我们有高温时，点火潜力急剧增加，＆＃34; Paul Peterson表示，土地管理局的火灾管理官。\n  自1月份以来，超过28,000英亩的野火烧毁了这一日期的最多火灾。目前在西方有33个活跃的大火。峡谷和凤凰城以东的峡谷和山谷中最大的最大速度烧焦了超过175,000英亩。它含有73％。\n    本周西方的录制热浪尚不讨论＆＃39; t帮助缓解火灾危险。温度飙升到盐湖城，拉斯维加斯和蒙大拿州的三位数中，新野火的日本普通突出了几周。\n    它们包括24,000英亩的大火燃烧的黄石国家公园，靠近红屋顶镇的黄石国家公园。它到目前为止销毁了18个结构，含有0％。在一年中的这个时候，木材和草地出现异常干燥。\n    ＆＃34;它不是很典型的，＆＃34; Pilly Chapman表示，Custer-Gallatin国家森林的公共信息官。 ＆＃34;我想到了很多＆＃39;热量。我们真的没有任何春雨。＆＃34; \n如果异常温暖的温度和干燥的条件持续到夏天，查普曼预测严重的野火季节。  ＆＃34;事情可能会改变 - 我希望他们做到 - 但这不是一个很好的趋势，＃34; 他说。  高风在蒙大拿州＆＃39;首都，海伦娜附近燃烧了另一个大火燃烧，其中一个国家自然资源和保护直升机在战斗中坠毁的燃烧着。 所有五名机组人员都患有轻微的伤害。  这个故事的早期版本在一张照片标题中表示，罗伯逊绘制火灾是Wyo的水牛南部。事实上，它是蒙特红色小屋的南部。 ", "note_en": "The number of new wildfires in the U.S. so far this year is at  a ten-year high, according to federal data, prompting warnings of a long, potentially dangerous summer of fire.\n  One of the biggest areas of concern right now is the high desert Great Basin region in Utah, Nevada and eastern Oregon.\n  &#34;When you have standing dead grass that&#39;s already out there and when we have high heat, that ignition potential raises dramatically,&#34; said Paul Peterson, a fire management officer for the Bureau of Land Management.\n  Since January, more than a million acres have burned from more than 28,000 wildfires – the highest number of fires for this date since 2011. There are currently 33 active large fires across the West. The biggest has scorched more than 175,000 acres in the canyons and valleys east of Phoenix. It is 73% contained.\n    A record-breaking heat wave across the West this week isn&#39;t helping ease fire danger. Temperatures have soared into the triple digits in Salt Lake City, Las Vegas and Montana, where new wildfires are sparking weeks earlier than normal.\n    They include a 24,000-acre fire burning northeast of Yellowstone National Park near the town of Red Lodge, Mont. It has destroyed 18 structures so far and is 0% contained. The timber and grasses there are unusually dry for this time of year.\n    &#34;It&#39;s not very typical,&#34; said Billy Chapman, public information officer at Custer-Gallatin National Forest. &#34;I think a lot of it&#39;s the heat. We have not had any spring rain really.&#34;\n  Chapman predicts a severe wildfire season if the abnormally warm temperatures and dry conditions continue into the summer.\n  &#34;Things could change – and I hope they do – but this is not a good trend,&#34; he said.\n  High winds have fueled another large fire burning near Montana&#39;s capital, Helena, where a state Department of Natural Resources and Conservation helicopter crash-landed while battling the blaze. All five crew members survived with minor injuries.\n An earlier version of this story said in a photo caption that the Robertson Draw Fire was south of Buffalo, Wyo. In fact, it is south of Red Lodge, Mont.", "posttime": "2021-06-19 15:32:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "野火,high,火灾", "title": "新的野火在炎热，干燥的西方野生中达到了10年的高位 ", "title_en": "New Wildfires Are At A 10-Year High In The Hot, Dry Western US", "transed": 1, "url": "https://www.npr.org/2021/06/17/1007784176/new-wildfires-10-year-high-western-u-s", "via": "", "real_tags": ["野火", "high", "火灾"]}, {"category": "", "categoryclass": "", "imagename": "f1dbc60d581b005804f9867d1d9b8758.jpeg", "infoid": 1066850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月的澳大利亚餐厅Crux发布的视频显示了一些影响他们周日早午餐的任何影响者所期望的东西：一把刀慢慢地在荷兰那岛拍了一个鸡蛋，因为任何好的鸡蛋是 - 直到金黄蛋糕渗出。但外观正在欺骗，并且由于覆盖到剪辑上的文本明确表示：是的，它是素食主义者。是的，它是流行的。\n  对于素食主义者，乳酸素食者和其他任何削减卵消耗的人，长期以来几种方法可以取代鸡蛋的功能。亚麻籽，Chia种子，香蕉，苹果酱和淀粉混合物，如eNer-g蛋换剂，鸡蛋的绑定任务很好地进行了味道，可以在味道中找到。豆腐可以加扰，鹰嘴豆粉可以煮成薄，煎蛋型薄板。当素食主义看到一个令人兴奋的鼎盛时期时，其他商业蛋换剂选择正在上升。\n  沿着您的心灵，这位基于工厂的空间的50岁的领导者，2015年推出了一种争吵的替代品。VEGG销售蛋蛋白替代品，包括粉末，意味着模拟法式吐司等菜肴中的蛋黄的味道和质地。 Juggernaut只是鸡蛋，其绿豆的液体争先恐后的鸡蛋，在2018年争抢美国。到今年3月，当刚收到卡塔尔投资机关的额外投资2亿美元，公司卖了相当于1亿鸡蛋。华盛顿邮政报道，2019年，2019年，美国人在每年吃大约279个鸡蛋 - 最高50年的鸡蛋消耗最高。\n  但是，商业素食产品尚未捕获的特殊快乐：鸡蛋蛋黄在其所有粘性，球状，食物色情 - 荣耀。毕竟，尤利，与“把鸡蛋放在上面”的放纵Instagram吸引力有关，是否是“它”是披萨，汉堡还是早餐哈希。对于那些不想完全放弃鸡蛋概念的人，素食主义者鸡蛋用柔滑的白人和球形液体蛋黄是难以捉摸的但不是遥不可及的。这就是家庭和餐厅厨房的厨师有多欺骗科学，使基于工厂的Yolk POP成为可能。\n  在2018年在阿德莱德开设的症状，提供了两种方式的素食蛋。鸡蛋本尼迪克特含有他们的偷猎，它为蛋黄的白人和西红柿使用腰基。早餐三明治采用了煎蛋的传真，配有闪亮，大豆的白人，含有花边边缘和蛋黄的相同泡沫。虽然你可以告诉蛋黄的主要组成部分是西红柿和大豆，但是，两个版本都是在Crux Owner George Thomson说的那种版本中的白人的质地和味道。 “客户不断评论我们所做的事情被认为是”巫术“。\n  开发Crux的素食蛋“绝对消耗”汤姆森，培养皿大约五年来。 “我看到人们在网上制作素食主义者'煎蛋'，我想，我可以做得更好，”他说。 YouTube单独提供许多方法。 2018年，Ellie Blowen的博客elsa的健康生活共享了一个非常模仿的视频，其中她将南瓜融入黄色混合物中，然后将其Dolpoped它送到由面粉和椰奶制成的圆圈上。 Emmymade的emmy cho在使用鸡油果上的食谱上悄悄地，Canistel的口语名字;当它成熟时，与中美洲最原产树的树的水果相比，与煮沸的蛋黄的质地相比。然而，这些食谱尚未缩短，是“蛋黄”并没有吞噬，而是一勺酱油在有效的白色煎饼。\n   未加工的鸡蛋蛋黄是蛋白质，脂肪，水和矿物质的液体混合物，其包裹在透明膜中，使蛋黄与构成蛋清的蛋白分开。为了使素食蛋蛋黄表现得类似，然后复制膜至关重要。 \n在20世纪40年代获得专利的食品科学家William Peschardt，球形化是一种捕获薄凝胶膜中液体的技术。 Peschardt建议它用于“人工食用樱桃，软片等”。该过程通过混合含有藻酸钠的可食用液体，然后将其滴入盐浴中。 （还有逆向球化，涉及将含钙物质滴入藻酸盐浴中。）当藻酸钠达到钙离子时，离子粘合在一起，液体浸出凝胶皮。\n  Flacherification在2003年真正进入公众意识，当时西班牙餐厅El Bulli  - 赢得了上一年的最佳餐厅，每年从2006年到2009年开始使用它并获得橄榄果汁制成的“橄榄”这样的菜肴赞誉。 El Bulli和Chef FerranAdrià是烹饪运动中的领导者，有时被称为“分子美食”，尽管许多与之相关的厨师使用“现代化的烹饪”。\n  归功于物理学家Nicholas Kurti和ChemistHervé，其约会于1988年，分子美食是一个研究领域，探讨了家庭和餐厅厨房的烹饪背后的科学。 （“食品科学”与比较，一般是指工业粮食生产，安全和营养的研究。）该术语也被误认为是百科全书的不列颠诺坦尼卡 - 指的是使用科学创造新的菜肴和烹饪技巧。由于1990年代末，1990年代末，“分子美食”等厨师的工作，即“分子美食，”尽管潜在的错误数，但却成为泡沫，凝胶和球体等格式的食物的代名词。\n  曾以鸡蛋的热爱闻名的Dufresne甚至是椰子 - 胡萝卜混合物，旨在看起来像他纽约市餐厅WD-50的阳光壮丽的鸡蛋，从2003年到2014年开放。（2007年，Dufresne的“鸡蛋”成为了在线厨师的Marcel Vigneron“撕开了”撕开了“网络蛋”时的“撕裂了”的争议的主题。）\n  今天，Crux-of Comper-Sustes Facherized将番茄蛋蛋黄转化为番茄蛋黄。使用西红柿的类似技术在2019年的Insider视频中普及关于洛杉矶素食餐厅CrossRoads厨房，它自从2016年以来一直为番茄蛋黄提供服务。新的Paltz，纽约的Lagusta甜美的委员会于2016年开业，创造了它的自己的“分子蛋”在拉面顶部提供。但是，当Buzzfeed在诸如此写作中有近400万视图的视频中尝试时，Crossroads厨房的番茄技术在去年的善意时甚至更加关注。该方法正在Tiktok上的回合：除了Crux的剪辑之外，番茄素素食鸡蛋出现在User @ Oprahwinfrey.car1本月早些时候的Tiktok中，目前拥有350万次景观。 Crux还使用与腰果混合物的球形化，以使其其余的素食荷包蛋。\n  Lisa Kitahara Food Blog Okodici厨房开发了她的素食蛋蛋黄食谱，因为她错过了Tamago Kake Gohan，生蛋的舒适食物混合在炎热的米饭中，当她的家人每年访问日本时，她会吃。她还使用了球形化技术，而不是西红柿，她发现“太多汁”，她发现了使用南瓜，胡萝卜或甜土豆的成功，使蛋黄基础是光滑和黄油的蛋黄。\n  Kitahara在Tamago Kake Gohan的另一个关键成分是Nagaimo，这是一个山地山药，在加入蛋黄之前，她将腌制到她的碗里。 “这有点模仿鸡蛋的粘性纹理，”她说。她还在素食主义者中使用Nagaimo，以Kaki Fry或日式炸牡蛎。在那篇论述中，长头队以鸡蛋的方式束缚她用来挖掘牡蛎蘑菇的混合物，也增加了一种粘着的雪，这使得来自海洋的牡蛎。 \n蛋黄比表格更多，许多素食蛋食谱中的常见风味元素包括kitahara和汤姆森是kala namak，也被称为印度人或喜马拉雅黑盐。与含有活性炭的夏威夷黑盐不同，Kala Namak含有硫磺化合物，使鸡蛋的气味和味道不同。其中一个是硫化氢，这是鸡蛋的味道，从饥饿诱导腐烂的污垢。\n  为什么这些技术在商业甚至餐厅的意义上都不会更受欢迎可能是因为努力成为制造它们。汤森开发了一个成功的素食蛋原型之后，他的下一个挑战是在更大的规模上进行的，这是一个花了几个月的过程。 “制作少量素食主义者的鸡蛋是一件事，这是一个在商业环境中创造成千上万的不同游戏，”他说。“ “素食主义者'煎蛋'和素食主义者'偷猎鸡蛋'即使在完善两种方法之后，也会采取巨大的能量。”\n  虽然Kitahara在她的博客上为她的素食蛋蛋黄进行了食谱，但她计划继续尝试这些过程。她喜欢最终解决一个版本的onsen tamago（“温泉蛋”中的日语），鸡蛋在低于沸腾的温度下慢慢煮熟，直到它们柔滑，柔软，番荔枝。她认为这可以通过使用琼脂来实现这一常用素食替代。 “即使是现在，我又非常兴奋地对食谱有点兴奋，”Kitahara说。也许有一天，她建议，她可以为每个人的偏好制作完美的素食蛋的指导;她想弄清楚蛋黄混合物中的根蔬菜的正确比例，以创造从流y蛋糕到更厚的更熟练的看似的液体的选择。\n  在Crux，素食主义者蛋黄如此准确，这两种菜肴目前都有一个免责声明，“请小心鸡蛋。” “在菜单上的警告之前，人们对人们低估了他们的常见情况，他们最终会在素食主义者蛋黄中覆盖，”汤姆森说。 ", "note_en": "A  video posted by the Australian restaurant  Crux on TikTok last month shows something you’d expect from any influencer filming their Sunday brunch: A knife slowly breaks an egg—blanketed in hollandaise, as any good eggs Benedict is—until golden yolk oozes out. But appearances are deceiving, and as the text overlaid onto the clip makes clear: Yes, it’s vegan. And yes, it pops.\n  For vegans,  lacto-vegetarians, and anyone else cutting their egg consumption, there have long been many ways to replace the functions of the egg. Flax seeds, chia seeds, bananas, applesauce, and starch blends like Ener-G Egg Replacer perform the binding tasks that eggs do so well—a guide to which can be found  in Taste. Tofu can be scrambled, and chickpea flour can be cooked into a thin, omelette-esque sheet. Other commercial egg replacer options are on the rise as veganism  sees an exciting heyday.\n  Follow Your Heart, the 50-year-old leader in the plant-based space, launched a substitute intended for scrambles  in 2015.  Vegg sells egg replacer products including a  powder meant to simulate the taste and texture of egg yolks in dishes like French toast. The juggernaut is  JUST Egg, whose mung bean-based liquid that scrambles like real eggs, hit the United States  in 2018. By March of this year, when JUST  received a $200 million investment backed by the Qatar Investment Authority,  the company had sold the equivalent of 100 million chicken eggs. Chicken eggs remain big business:  In 2019, Americans were eating about 279 eggs per person per year—the highest egg consumption in almost 50 years, the  Washington Post reported.\n  But there’s a particular pleasure that commercial vegan products haven’t yet captured: the egg yolk in all of its gooey, globular, food porn-y glory. The yolk, after all, has much to do with the indulgent Instagram appeal of “ putting  an egg  on it,” whether “it” is a pizza, a burger, or a breakfast hash. For those who don’t want to give up the concept of the egg entirely, the vegan egg with silky whites and a spherical liquid yolk is elusive but not out of reach. This is how obsessed cooks in home and restaurant kitchens have tinkered with science to make the plant-based yolk pop possible.\n  Crux, which opened in Adelaide in 2018, offers vegan eggs two ways. The eggs Benedict contains their poached version, which uses a cashew base for the whites and tomatoes for the yolks. The breakfast sandwich features their facsimile of a fried egg, complete with shiny, soy-based whites with lacy edges and the same bubble of a yolk. Though you can tell that the egg yolks’ main components are tomatoes and soy, the texture and flavor of the whites in both versions is spot on, says Crux owner George Thomson. “Customers are constantly commenting about how what we do is considered ‘wizardry.’”\n  The process of developing Crux’s vegan eggs “absolutely consumed” Thomson, who has been vegan for about five years. “I saw people making vegan ‘fried eggs’ online, and I thought,  I could do that better,” he said. YouTube alone offers many methods. In 2018, Ellie Bullen of the blog Elsa’s Wholesome Life shared a much-imitated video in which she  blended pumpkin into a yellow mixture and then dolloped it onto a circle made of flour and coconut milk. Emmy Cho of Emmymade  riffed on that recipe using eggfruit, the colloquial name for canistel; when it’s ripe, the fruit, which comes from a tree native to Central America,  is compared to the texture of a hard-boiled egg yolk. Where these recipes fall short, though, is that the “yolks” aren’t poppable, but rather a spoonful of sauce atop what is effectively a white pancake.\n   A raw chicken egg yolk is a liquid mixture of protein, fat, water, and minerals that’s encased in a  transparent membrane, which keeps the yolk separate from the albumen that makes up the egg whites. To make a vegan egg yolk that behaves similarly, then, replicating that membrane is crucial.\n  Patented in the 1940s by food scientist William Peschardt, spherification is a technique that traps a liquid in a thin gel membrane. Peschardt suggested it for use in “artificial edible cherries, soft sheets, and the like.” The process works  by mixing an edible liquid that contains no calcium with sodium alginate, and then dropping it into a calcium salt bath. (There’s also  reverse spherification, which involves dripping a calcium-containing substance into an alginate bath.) When the sodium alginate meets the calcium ions,  the ions bind together, giving the drops of liquid a gel skin.\n  Spherification really entered public consciousness in 2003, when the Spanish restaurant El Bulli—which won World’s Best Restaurant the previous year, and every year from 2006 to 2009— began using it and gained acclaim for dishes like  an “olive” made out of olive juice. El Bulli and chef Ferran Adrià were leaders in the cooking movement that’s sometimes referred to as “molecular gastronomy,” though many chefs associated with it use terms like “ modernist cuisine.”\n  Credited to physicist Nicholas Kurti and chemist Hervé This and dating to 1988,  molecular gastronomy is a field of study that explores the science behind cooking in home and restaurant kitchens. (“ Food science,” by comparison, generally refers to the study of industrial food production, safety, and nutrition.) The term was also used—mistakenly,  according to Encyclopedia Britannica—to refer to the use of science to create new dishes and cooking techniques. Thanks to the work of chefs like Adrià, Heston Blumenthal, and Wylie Dusfresne in the late 1990s to early 2000s, “molecular gastronomy,” despite the potential misnomer, became synonymous with foods in formats like foams, gels, and spheres.\n  Dufresne, who was known for his love of eggs, even served a  coconut-carrot mixture designed to look like a sunny-side-up egg at his New York City restaurant WD-50, which was  open from 2003 to 2014. (In 2007, Dufresne’s “egg” became the subject of brief food world controversy when  Top Chef’s Marcel Vigneron “ ripped [it] off” with his “ cyber egg” that was featured in  Wired.)\n  Today, Crux—which is focused on “boundary-pushing vegan food”—uses spherification to turn a tomato-based mixture into its vegan egg yolk. A similar technique using tomatoes was popularized online in a  2019 Insider video about the Los Angeles vegan restaurant  Crossroads Kitchen, which has been serving a tomato yolk  since at least 2016. New Paltz, New York’s  Lagusta’s Luscious Commissary, which opened in 2016, created its own “ molecular egg” to serve on top of ramen. But Crossroads Kitchen’s tomato technique got even more attention last year when Buzzfeed’s  Goodful tried it in a video that has almost 4 million views as of this writing. The method is now making the rounds on TikTok: In addition to Crux’s clips, a tomato-based vegan egg appears in  a TikTok posted by the user @oprahwinfrey.car1 earlier this month and which currently has 3.5 million views. Crux also uses spherification with a cashew-based mixture to make the rest of its vegan poached egg.\n  Lisa Kitahara of the food blog  Okonomi Kitchen developed her  vegan egg yolk recipe because she missed the tamago kake gohan, a comfort food of raw egg mixed into hot rice, that she would eat when her family visited Japan every year. She also uses the spherification technique, but instead of tomatoes, which she found “too juicy,” she’s found success using squash, carrots, or sweet potatoes to make an egg yolk base that’s smooth and buttery.\n  Another key ingredient in Kitahara’s take on tamago kake gohan is nagaimo, a mountain yam, which she grates raw into her bowl of rice before adding the egg yolk. “It kind of mimics that slimy texture that eggs have,” she said. She also uses nagaimo in her  vegan take on kaki fry, or Japanese-style fried oysters. In that recipe, nagaimo acts in the place of eggs to bind the mixture she uses to dredge oyster mushrooms, and it also adds a sliminess that’s reminiscent of an oyster from the sea.\n  There’s more to an egg yolk than form, and a common flavor element in many vegan egg recipes including Kitahara’s and Thomson’s is  kala namak, also known as Indian or Himalayan black salt. Unlike  Hawaiian black salts that contain activated charcoal, kala namak  contains sulfur compounds that evoke the smell and flavor of eggs. One of these is hydrogen sulfide,  which is responsible for the smell of eggs, from hunger-inducing to spoiled rotten.\n  Why these techniques aren’t more popular in a commercial or even restaurant sense might be because of the effort that goes into making them. After Thomson developed a successful prototype of his vegan egg, his next challenge was making it on a larger scale, a process that took months. “It’s one thing to make a handful of vegan ‘poached eggs,’ it’s a whole different game to create thousands of them in a commercial environment,” he said. “Both the vegan ‘fried eggs’ and vegan ‘poached eggs’ take tremendous amounts of energy to create, even after perfecting both methods.”\n  Though Kitahara has put a recipe for her vegan egg yolk on her blog, she plans to continue experimenting with the process. She’d like to eventually tackle a version of  onsen tamago (“hot springs eggs” in Japanese),  eggs slowly cooked at a temperature below boiling until they’re silky, soft, and custardy. She thinks this could be possible with the use of agar, a common vegetarian alternative to gelatin. “Even now, I&#39;m still very excited to kind of tweak the recipe a bit,” Kitahara said. Perhaps one day, she suggested, she could make a guide to the perfect vegan egg for each person’s preference; she’d like to figure out the right proportions of liquid to root vegetables in her yolk mixture to create options from runny yolks to thicker, more cooked-seeming ones.\n  At Crux, the vegan egg yolks are so accurate that both dishes currently come with a disclaimer to “please pop eggs with care.” “Before the warning on the menu, it was a common occurrence for people to underestimate just how realistic they were, and they would end up covered in vegan egg yolk,” Thomson said.", "posttime": "2021-06-19 15:31:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可口,squeezable,鸡蛋", "title": "挤压，可口素食蛋蛋黄的科学 ", "title_en": "The Science of the Squeezable, Poppable Vegan Egg Yolk", "transed": 1, "url": "https://www.vice.com/en/article/7kv4xy/the-science-of-the-squeezable-poppable-vegan-egg-yolk", "via": "", "real_tags": ["可口", "鸡蛋"]}, {"category": "", "categoryclass": "", "imagename": "1e277f1778f9d49c341b6d5cb32bf46a.png", "infoid": 1066848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第2部分。C编程简介（#include，#define，main（），数据类型，运算符，...等）\n  此Web编程指南启动为YouTube上的视频系列，支持通过Patreon支持。在惠顾＆＃34; C编程＆＃34;等级及以上（Patreon）访问这些额外信息：\n 独家访问其余的＆＃34;编程指南＆＃34;更详细信息和信息，并将其陷入视频中\n  一周的帕勒顿论坛提出有关那周的问题＆＃39; s＆＃34; c编程＆＃34;主题（如果你用视频和需要帮助下沿，这是问的地方）\n  视频系列完成后，我将编程指南编辑为A＆＃34;教自己编程＆＃34;通过出版合作伙伴Lulu预订。顾客可以以成本购买这本书 - ＆＃39;从一般的书中储蓄一大笔钱\n  我喜欢感谢所有支持我的帕勒顿的每个人，包括Jason Pittman，Alexander Shendi，Gustavo Pezzi，Scott Bollinger，Ryan Harris，Rafael Campos，K Mi，Nikola Markovic BGD，Wade Brainerd，Mike Garcia，Philip Espi， Vlastimil Holer，Dan Mons，Stephen Smogen，Bill Marshall，Pater，Brett Owen，Ronald Eichler，Tom Dison，Joe Walker，Magnus Wild，Kwang Lee，Mitchel Valentino，TheGreatCodeholio，Bérenger，Daniel Monteiro，Mark Eichin，Sparheld International GmbH， Hallmentum Llc，Eric Leblanc，Luke Abbott，John Paul Wohlscheid，Sean Dobes，Tom Dearden，Eric Smith，Superilu和Dwayne。 ", "note_en": "Part 2. Introduction to C Programming (#include, #define, main(), data types, operators, … and more)\n  This web programming guide started out as a video series on YouTube, supported through Patreon. Patrons at the &#34;C programming&#34; level and above (Patreon) got access to these extras:\n Exclusive access to the rest of the &#34;programming guide&#34; with more detail and information that didn&#39;t make it into the videos\n  A weekly Patreon forum to ask questions about that week&#39;s &#34;C programming&#34; topics (if you were following along with the videos and need help, this was the place to ask)\n  After the video series was finished, I edited the programming guide into a &#34;teach yourself programming&#34; book, via publishing partner Lulu. Patrons can purchase the book at cost—that&#39;s a big savings from the general cover price for a finished book\n  I&#39;d like to thank everyone who supported me on Patreon, including Jason Pittman, Alexander Shendi, Gustavo Pezzi, Scott Bollinger, Ryan Harris, Rafael Campos, K MI, Nikola Markovic BGD, Wade Brainerd, Mike Garcia, Philip Espi, Vlastimil Holer, Dan Mons, Stephen Smoogen, Bill Marshall, Patater, Brett Owen, Ronald Eichler, Tom Dison, Joe Walker, Magnus Wild, Kwang Lee, Mitchel Valentino, TheGreatCodeholio, Bérenger Doneux, Daniel Monteiro, Mark Eichin, Sparheld International GmbH, Hallmentum LLC, Eric LeBlanc, Luke Abbott, John Paul Wohlscheid, Sean Dobes, Tom Dearden, Eric Smith, SuperIlu, and Dwayne.", "posttime": "2021-06-19 15:31:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,freedos,编程", "title": "在C（2020）中编写Freedos计划 ", "title_en": "Writing FreeDOS Programs in C (2020)", "transed": 1, "url": "https://www.freedos.org/books/cprogramming/", "via": "", "real_tags": ["2020", "freedos", "编程"]}, {"category": "", "categoryclass": "", "imagename": "10d96ecc65a3daaeaae257b0b3980347.jpg", "infoid": 1066847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容的一些人，以及每天更多的人，相信这一点：那些不相信疫苗的美德的人 - 反vaxxers  - 是无知和危险的疯子，可能是邪恶的。\n  我花了大部分时间相信这一点。在我20多岁的早期期间，我在怀疑博客圈，一个2000年代中期的互联网社区，理论上围绕高度富有魅力的博主，冯政府和其他知识分子组织。然而，在实践中，这些群体以更基本的原则为中心：对任何人和它被视为的任何人都有敌意;非理性。＆＃34;那是现在，现在仍然是一个非常白人，男性和防守的地方。\n  正是在那里，我对抗疫苗接种运动发展了深深的抗病。它不是我知道的，他们对疫苗错了。它不止于此。我相信自己在智力上和道德上优于那些人，我加强了每次我发表评论或观看vlog或重新发布关于这个主题的讽刺文章的信念。我掌握了一张脸，一种令人震惊的，不赞成的人在任何时候都有任何人甚至拉大了疫苗怀疑的主题。\n          我九年前遇见了我的妻子。我想乘坐挥舞着舞蹈，并决定采取私募课程来克服我的一些焦虑。当我打电话时，她是拿起电话的老师。\n  我立刻被她吸引了，但在她与她女儿的父亲一起参与她的舞蹈伴侣时。\n  所以起初我们建立了柏拉图友谊。我们花时间在一起。我们对我们对跳舞的共同兴趣结合。我在第一次提到她的女儿没有接种疫苗时，我认识她一年多的一年多。\n  那么，当你相信的人都聪明而且明智的结论时，你做了什么，你发现完全错了？那个人是否停止在那个精确的时刻聪明？ \n我的时间阅读（傲慢）怀疑博客让我说服了我的道德和智力优势。我相信，因为我是一个聪明，明智的，同情的人，我可以看到疫苗的价值。这个女人来了。我知道她不是愚蠢的 - 事实上，我以为她非常有洞察力。我知道她是and＃39; t危险或阴谋 - 我们谈到了关于我们如何关心人的几天，以及我们所居住的社会以及它意味着人类。我已经信任了她。\n  我是否必须完全重新评估我对这个人的看法？我必须检查自己的偏见和精神漫画，决定反vaxxers也是人吗？\n  好吧，没有。我做了大多数人所做的事情：选择认知不和谐。我决定它是值得争吵的，她可以成为我的朋友，同时对疫苗有奇怪的意见。即使她和她的伴侣分手，我和我分手了，我们发现自己在一起度过了很多时间，我忽略了这个问题。疫苗的主题过度或两次过晚餐，但是什么？我可以看到她深深地爱着她的女儿。她是我钦佩和尊重的人，并开始爱。疫苗没有进入vid。\n  而且，当然，如果我们一起度过足够的时间，我最终会改变自己的想法。\n      这是对抗vaxxers的任何真正讨论的殴打心脏。它不可能了解他们的立场而不考虑进入抗疫苗叙事的恐惧的数量，并考虑人们如何构建和处理恐惧。\n    现在，你可能会认为恐惧是恐惧，公共卫生是别的 - 而且你可能是对的。那个＆＃39;是理性的观点。但是，你自己的恐惧是如何理性的？\n  也许你＆＃39;害怕高度。也许它＆＃39; s蜘蛛。在任何一种情况下，你＆＃39;再幸运：应对你的恐惧，大多数人的方式 - 避免 - 不到他人的费用。但是，当每个人都买时，疫苗只能工作。公共卫生取决于反vaxxers面对他们最大的恐惧，因为他的利益。 \n对于那些不分享他们的恐惧的人，它非常简单，方便地要求反vaxxers只是吸收它并拍摄。我希望他们也会。但是，通过侮辱和贬低他们，拒绝认真对待他们的恐惧，即使有很多东西，也从来没有欺负他们，拒绝把他们恐惧的事实欺负，＆＃39;\n  难以做到。你有没有试图盯着眼睛盯着眼睛，告诉她你会把孩子放在危险之中？\n  尽管最初避免了这个主题，但我决定，在我们结婚后，我应该说服我的妻子接种女儿。毕竟，疫苗很好。疫苗是安全的。麻疹爆发一直在新闻 - 提高主题的更好时间更好？\n  但是，当我这样做时，我意识到从她的角度来看，我的所有对抗的推理都听起来像是我要求将枪指向女儿，并让她的信任充满空白。望着她的眼睛，我意识到她对我的信任受到威胁。她问为什么我会这样做。所有的坚持疫苗都是安全的，而＃39; T。去告诉阿拉罕医生父母，你必须把蜘蛛放在孩子身上，因为社会取决于它，看看它是怎么回事。在摘要中表达射门的好处，根本无法通过推翻立即，解除武装的恐惧。\n  所以我退缩了。反vax的位置不是我的交易破碎机，但建议我们应该把女儿暴露给严重危险，因为我的妻子是一个交易破碎机。我爱我的妻子。我没有渴望结束事物。是的，我认为女儿接受疫苗是非常重要的 - 但它没有＆＃39;不是我的妻子会在一个分手斗争中改变主意。\n  我退缩了，在机会出现时，在较少的对抗术语中得到了谈话。\n    我的妻子是我认识的最聪明，最敏感的人之一。那么聪明，明智的人在感知威胁时会做什么？他们做了聪明，明智的事情：采取预防措施并警告他人。 \n再次，它＆＃39很容易将反vaxxers的担忧视为非理性，用偏执的行为向偏执倾斜，但这是一个关键点：推理，一旦你接受大，未经证实的前提，就是有效的。它也是如此远离＆＃39;如果你不考虑它，那么太难了：有一些令人心碎的先例喂养这个逻辑。铅漆，烟草，血统 - 每次都感受到回复的冲动，＆＃34;但疫苗是安全的，每个人都知道，＆＃34;我们应该记住同样的判决，认真和自信地说，关于绝对是危险的事情。\n  去告诉阿拉罕医生的父母，你必须把蜘蛛放在孩子身上，因为社会取决于它，看看是怎么回事\n  如果你＆＃39; ve相信疫苗是危险的，那么抗vax行为几乎是合理的。如果我们想达到这些人，请将他们的逻辑视为荒谬或边缘是最糟糕的策略。它扮演反疫苗接种叙述：它们是＆＃34;只有理智的，＆＃34;警告粗心的群众对一个非常真实和隐患的危险。\n  我的妻子（和她的家人）真诚地相信，虽然她的担忧被认为是非理性的，但他们aren＆＃39; t。它易于想象一下，第一人称如何注意到普遍存在的东西，就像铅一样，被她的同龄人被视为不合理的恐惧 - 并想象你可能是其中一个人之一。第一个反引导人称为曲柄 - 直到它们被证明是正确的。\n  我的观点是＆＃39;反vaxxers可能是对的。他们＆＃39;重新。我的观点是，一旦你相信一些不真实的东西，它很容易保持合理化这种信念。它非常容易将批评者视为短视。当你＆＃39;重申不断攻击，它是＆＃39的自然，使你的恢复力成为你的身份，变得更加致力于维护它。\n  人们不是散文，在那里你可以通过细心，不受干扰的解剖来回到前一段并破坏前瞻。人们谈话和人民栏杆。我的妻子不会袖手会让我挑选她，就像她是一个需要解决的问题;她的前锋 - 就像其他人一样＆＃39; s  - 是她身份的一部分。我们所有人都有这种情况;它＆＃39;我们大多数人都可以更容易地离开它们。我们需要停止看到反vaxxers作为可以被说服抛弃坏主意的人，而是我们＆＃39;重申抛弃自己的一部分 - 他们的防御性的身份感＆＃39; ve鼓励糟糕的策略。\n      身份感或＃39;唯一一个使反vaxxers不受影响对抗对抗的争论。如果你采取深刻争议的立场，特别是在开始，你赢得了持续持续的持久性，没有强大的支持系统。不幸的是，恐惧卖 - 和＃39;总是有人愿意为您提供价格。 \n显然，不要＆＃39; t信任或价值常规医学的人仍然生病。在加拿大，在我生活的地方，社会化医疗保健涵盖几乎所有传统的医疗费用，但有一个严重的私人市场，宁愿从替代来源获得治疗。这些替代来源可以做一些好处：生病的人需要照顾，并且一定程度的护理通常比不健康更好。但替代卫生行业也是一个企业，而且在最糟糕的是，这就是业务的作品：关于儿童转向的文章＆＃34;自闭症＆＃34;拍摄后由作者销售书籍，销售广告的网站以及销售治疗的商家。当你＆＃39;在销售对补贴竞争对手的销售治疗的业务时，你的球场需要表情感，必不可少。它需要吸引观众的价值观。由于有一个真正的经济对人们不信任常规医学，因此其演员通过卡车卷发出耸人听闻的恐慌块，这验证了反vaxxers广告的预先存在的焦虑 - 并将它们驱逐出愿意销售的人的怀抱一个解法。\n    回到我的妻子和我只是朋友的时候，我遇见了她的妹妹几次。她是一个非常愉快，完全同意的，自然的善于善人的人。我真的没有理由对她友好的东西。然后我的妻子告诉我，她的妹妹是一个自然病，研究了疫苗和＃34;广泛的疫苗的毒性作用。＆＃34;\n  我的嫂子也是我妻子的重要组成部分。当我的妻子是第二次猜测疫苗 - 当她的女儿＆＃39;父亲在分离后提出了这个问题 - 她转向她的妹妹。她的妹妹甚至更深入地在运动中，她是贸易的替代药物的提供者 - 当他们谈话时，我的妻子更肯定的是反vax worldview。再次：这是一个奇怪的行为。你有多少次想到一些重要的事情，只能通过与亲人的对话来安抚？\n  当然，它与反柬柬者没有独特地狡猾地寻求志同道合的人验证他们的观点;我们都这样做。例如，我喜欢许多报纸和杂志的原因之一是因为他们告诉我我已经考虑了外交政策，城市，女权主义和种族的事情 - 我们都遭受了一定程度的确认偏见。但与更普通的偏见不同，替代医学球拍完全没有选中;根据定义，它估算主流检查其理论和实践。它兑现了鼓励其参与者的孤立和依赖。这是一个环境，其中每一个假设都是相同的重量，所有假设都与某种产品推荐包装。\n  没有盈利产业，反vax信仰可能无法生存漫长。但再一次，我们该怎么办？疫苗接种叙事的整体媒体存在使怀疑论者是一个＆＃34;袭击和被压迫的＆＃34;展望鼓励其成员寻求切割世界观的角落。那些角落然后卖给他们自己的偏见 - 他们变得更加自信，他们＆＃39;重新右转。\n    我决定在揭示Pandemrix，旨在打击猪流感的疫苗后写下这件作品，导致儿童鼻神病。正如Julia Belluz所指出的那样，尽管实际且表现出副作用，但2013年发现几乎没有被媒体覆盖 - 恰恰是这种行为反vaxxers嫌疑人的行为发生了所有疫苗。\n  我留意这样的故事，一个可以允许我的妻子和我讨论非共用术语的疫苗接种。像Pandemrix这样的故事让我诚信地吸引她，承认有时医学会发出不良呼叫，媒体可以是同谋的。我把它带到了我的妻子，表明我关心她的担忧，我认为他们超越了苍白。在缓解某人和＃39;恐惧时，爱情很少 - 需要表情，特别是当你想说服时。拒绝从事任何开放的思想讨论，承认这一切可能会出错，允许它＆＃39;我们不知道一切：那种屈尊屈服于我的妻子和女儿没有更接近疫苗。它有没有争夺更广泛的反vaxxers。 \n在缓解某人时，爱情很少足够了 - 需要表情，特别是在你想说服的时候\n  缺乏个人投资是因为它发生了导致我的妻子的初始拒绝疫苗：她在白青少年时期有一个非常令人满意的MD，而她经历了很多身体和精神上的痛苦。\n  它始于药物引起的精神病崩溃。她在一个破碎的家中长大，缺乏父亲，一个瘾君子的母亲，一个暴力的继父 - 一种毒品容易被忽视的环境。在17岁时，她抽出了一些奇怪的东西，感觉自己非常失去它。幻觉。惊恐发作。恶心和心悸。经过一周的艰苦的一周，她做了正常的事情，并把自己拿到了一名医生。\n  她用处方和一种不可动摇的感觉，这位医生和他的诊所以及为他服务支付的政府，并不关心她的担忧，她的需求和她的恐惧。她是一个可以用几个药片解决的问题。她觉得她理智的恐惧没有尊重，甚至没有考虑过。那种毒品问题的解决方案更具药物。\n    这不是违反可以通过讲述疫苗来恢复的信任。\n  它的明显和痛苦，所有人类系统都会因人类缺陷而在某些地方失败。它可能是不可能强迫所有医生善良和体贴的人。\n  也许我的妻子也会像在那一刻那一刻做的一切都是正确的。但是，了解许多反vaxxers有一个根本原因 - 导致它们滥用医学的东西，然后在反馈回路中结束，加强不信任 - 对推回来至关重要。我认为心灵可以改变，心脏可以赢得，但是我＆＃39; vere达到了我的和平：只有爱，耐心和同理心会导致进入。善待反vaxxers，如果只是因为它＆＃39;当你的对手善良时很难遭受迫害。这是我选择的道路，我很乐意与一个挑战和激励我的人分享我的生活。一个小十年前的人，我会考虑一个危险的疯狂。 \n然后，上周，她的女儿问她今年会拍摄。  ＆＃34;不与您的同学，＆＃34; 我的妻子说。 ＆＃34;但是，它和＃39;时间。 我们＆＃39; ll与我们的新家庭医生预约。＆＃34;  第一人称vox＆＃39;家的引人注目的挑衅性叙事散文。 你有一个分享的故事吗？ 阅读我们的提交指南，并在FirstPerson@vox.com上投球。  数百万人转向Vox，了解新闻中发生的事情。 我们的使命从未比这一刻更重要：通过了解来赋予。 我们读者的财务贡献是支持我们资源密集型工作的关键部分，并帮助我们为所有人提供新闻。 请考虑今天为vox提供贡献，从3美元的价格下降。  解释者与这些侵入性的“疯狂的”蠕虫是什么，为什么我们不能摆脱它们？  查看科学＆amp的所有故事; 健康 ", "note_en": "Skip to main content                                                                                                                Some people, and more people every day, believe this, too: Those who don&#39;t believe in the virtues of vaccines — anti-vaxxers — are ignorant and dangerous lunatics, possibly evil.\n  I spent most of my life believing that. During my early 20s, I lived in the skeptic blogosphere, a mid-2000s constellation of internet communities theoretically organized around highly charismatic bloggers, vloggers, and other intellectuals. In practice, however, these groups were centered on a more basic principle: hostility toward anyone and anything it deemed &#34;irrational.&#34; It was then and is still now a very white, male, and defensive place.\n  It was there that I developed a deep antipathy toward the anti-vaccination movement. It wasn&#39;t that I knew they were wrong about vaccines. It was more than that. I believed myself intellectually and morally superior to those people, and I reinforced that belief each time I left a comment or watched a vlog or republished a snarky article on the subject. I mastered a face, a kind of appalled, disapproving look for any time anybody even broached the subject of vaccine skepticism.\n          I met my wife nine years ago. I wanted to take up swing dancing and decided to take a private class to get over some of my anxiety. She was the teacher who picked up the phone when I called.\n  I was immediately attracted to her, but at the time she was engaged to her dancing partner, the father of her daughter.\n  So at first we built a platonic friendship. We spent time together. We bonded over our mutual interest in dancing. I had known her for more than a year the first time she mentioned that her daughter was not vaccinated.\n  What do you do, then, when someone you believe is both smart and sensible comes to a conclusion you find completely wrong? Does that person stop being smart at that precise moment?\n  My time reading (arrogant) skeptic blogs had convinced me of my moral and intellectual superiority. I believed that  because I was a smart, sensible, and empathetic person I could see the value of vaccines. Yet here this woman was. I knew she wasn&#39;t dumb — in fact, I thought she was very insightful. I knew she wasn&#39;t dangerous or conspiratorial — we had talked for days about how we care about people, and the society we live in, and what it means to be human. I already trusted her.\n  Did I have to completely reassess my opinion of this person? Did I have to examine my own biases and mental caricatures, decide that anti-vaxxers  are people too?\n  Well, no. I did what most people did: opted for cognitive dissonance. I decided it wasn&#39;t worth getting into a fight over, that she could be my friend and have weird opinions about vaccines at the same time. Even as she broke up with her partner, and I broke up with mine, and we found ourselves spending a lot of time together, I ignored the issue. The subject of vaccines came up once or twice over dinners, but so what? I could see she loved and cared deeply for her daughter. She was someone I admired and respected and was beginning to love. Vaccines didn&#39;t get in the way.\n  And, of course, I believed that if we spent enough time together, I&#39;d eventually change her mind.\n      This is the beating heart of any real discussion about anti-vaxxers. It&#39;s impossible to understand their position without considering the amount of fear that goes into the anti-vaccine narrative, and considering how people construct and deal with fear.\n    Now, you might think that a fear is a fear and public health is something else — and you might be right. That&#39;s the rational point of view. But then, how rational are your own fears?\n  Maybe you&#39;re afraid of heights. Maybe it&#39;s spiders. In either case, you&#39;re lucky: Coping with your fear the way most people do — avoidance — doesn&#39;t come at a cost to others. But vaccines only work when everyone buys in. Public health depends on anti-vaxxers confronting their greatest fears for the benefit of others.\n  For people who don&#39;t share their fear, it&#39;s very easy and convenient to demand that anti-vaxxers just suck it up and take the shot. I wish they would, too. But we&#39;ll never get there by bullying them, by insulting and demeaning them and refusing to take the fact of their fear seriously, even if there isn&#39;t much that&#39;s serious in its content.\n  That&#39;s hard to do. Have you ever tried to stare a loved one into the eye and tell her you are going to put her child in danger?\n  Despite initially avoiding the subject, I decided, after we were married, that I should convince my wife to vaccinate her daughter. Vaccines are good, after all. Vaccines are safe. Measles outbreaks had been on the news — what better time to raise the subject?\n  But when I did, I realized that from her perspective, all of my confrontational reasoning sounded like me asking to point a gun at her daughter and have her trust that it was full of blanks. Looking into her eyes, I realized her trust in me was threatened. She asked why I would do that to a child. All of my insistence that vaccines are safe didn&#39;t matter. Go tell arachnophobic parents that you must put spiders on their child because society depends on it, and see how that goes. The benefits of getting the shot, expressed in the abstract, simply could not overpower the immediate, disarming fear.\n  So I backed down. The anti-vax position was not a deal breaker for me, but suggesting that we should expose her daughter to grave dangers for no good reason was a deal breaker for my wife. I loved my wife. I had no desire to end things. Yes, I think it was very important for her daughter to receive vaccines — but it&#39;s not as if my wife would have changed her mind over a breakup fight.\n  I backed down and resolved to have that conversation in less confrontational terms when the opportunity arose.\n    My wife is one of the smartest, most sensible people I know. So what do smart, sensible people do when they perceive a threat? They do the smart, sensible thing: take precautions and warn others.\n    Again, it&#39;s easy to dismiss the worries of anti-vaxxers as irrational and chalk up their activism to paranoid behavior, but this misses a crucial point: The reasoning, once you accept the big, unsubstantiated premise, is valid. It isn&#39;t even  that far-fetched, if you don&#39;t think about it too hard: There are some heartbreaking precedents that feed this logic. Lead paint, tobacco, bloodletting — every time we feel the urge to reply, &#34;But vaccines are safe, everyone knows that,&#34; we ought to remember that the same sentence has been said, earnestly and confidently, about things that absolutely were hazardous.\n  Go tell arachnophobic parents that you must put spiders on their child because society depends on it, and see how that goes\n  If you&#39;ve come to believe that vaccines are dangerous, then anti-vax behavior follows almost rationally. If we want to reach these people, dismissing their logic as ridiculous or fringe is the worst strategy. It plays right into the anti-vaccination narrative: that they are the &#34;only sane ones,&#34; warning the careless masses about a very real and hidden danger.\n  My wife (and her family) sincerely believes that though her worries are being recognized as irrational, they aren&#39;t. It&#39;s easy to imagine how the very first person to notice the dangers of something ubiquitous, like lead, was dismissed by her peers as irrationally afraid — and to imagine you might be one of these people. The first anti-lead folks were called cranks — until they were proven right.\n  My point isn&#39;t that the anti-vaxxers might be right. They&#39;re not. My point is that once you believe something untrue, it&#39;s very easy to keep rationalizing that belief. It&#39;s very easy to dismiss your critics as shortsighted. And when you&#39;re constantly attacked, it&#39;s natural to make your resilience part of your identity, to become even more committed to maintaining it.\n  People are not essays, where you can go back to a previous paragraph and undermine the priors through careful, unperturbed dissection. People talk, and people balk. My wife would not stand to have me pick her apart like she is a problem that needs to be solved; her priors — like everyone else&#39;s — are part of her identity. All of us have beliefs of this sort; it&#39;s just that most of us can get away with them more easily. We need to stop seeing anti-vaxxers as people who can be persuaded to abandon a bad idea, and instead as people we&#39;re asking to abandon a part of themselves — people whose defensive sense of identity we&#39;ve encouraged with bad tactics.\n      A sense of identity isn&#39;t the only thing that makes anti-vaxxers impervious to confrontational argument. If you take a deeply controversial position, especially in the beginning, you won&#39;t last long without a strong support system. Unfortunately, fear sells — and there&#39;s always someone willing to give you that support for a price.\n  Evidently, people who don&#39;t trust or value conventional medicine still get sick. In Canada, where I live, socialized health care covers almost all conventional health-care costs, but there is a serious private market for people who would rather get their treatments from alternative sources. These alternative sources  can do some good: Sick people need care, and some amount of care is usually better than no care at all. But the alternative health industry is also a business, and at its worst, this is how the business works:  Articles about children turning &#34;autistic&#34; after a shot are circulated by authors selling books, websites selling ads, and merchants selling cures. When you&#39;re in the business of selling treatments against a subsidized competitor, your pitch needs to be emotive, essential. It needs to appeal to the values of your audience. Since there is a real economy hinging on people not trusting conventional medicine, its actors churn out sensationalist scare pieces by the truckload, which validates the preexisting anxieties of anti-vaxxers ad nauseam — and drive them into the arms of the people willing to sell them a solution.\n    Back when my wife and I were just friends, I met her sister a couple of times. She is a very pleasant, completely agreeable, and naturally sociable person. I really had no reason to be anything less than friendly to her. Then my wife told me that her sister is a naturopath who studied the toxic effects of vaccines &#34;extensively.&#34;\n  My sister-in-law is also a big part of my wife&#39;s support network. When my wife is second-guessing herself about vaccines — like when her daughter&#39;s father raised the issue after their separation — she turns to her sister. Her sister is even deeper in the movement that she is — she&#39;s a provider of alternative medicines by trade — and when they talk, my wife comes away more sure of the anti-vax worldview. Again: This isn&#39;t a strange behavior. How many times have you wondered about something important, only to be reassured by a conversation with a loved one?\n  Of course, it&#39;s not uniquely devious for anti-vaxxers to seek like-minded people to validate their views; we all do it. One of the reasons I like many of the newspapers and magazines I like, for instance, is because they tell me things I already think about foreign policy, urbanism, feminism, and race — we all suffer from confirmation bias to some extent. But unlike more ordinary biases, the alternative medicine racket is completely unchecked; by definition, it eschews mainstream checks on its theories and practices. It cashes in on encouraging the isolation and dependence of its participants. This is an environment in which every hypothesis is given equal weight, and all of them come packaged with some kind of product recommendation.\n  Without a profitable industry, anti-vax beliefs might not survive long. But again, what do we do? The monolithic media presence of the vaccination narrative gives skeptics an &#34;assaulted and oppressed&#34; outlook that encourages its members to seek out corners that coddle their worldviews. Those corners then sell them back their own biases — and they become even more confident that they&#39;re right.\n    I decided to write this piece after it was revealed that Pandemrix, a vaccine designed to combat swine flu, was causing narcolepsy in children. As Julia Belluz pointed out  on this site, the 2013 discovery was hardly covered by the media despite real and demonstrated side effects — precisely the kind of behavior anti-vaxxers suspect is happening with all vaccines.\n  I keep an eye out for stories like this, one that could allow my wife and me to discuss vaccination in nonconfrontational terms. A story like Pandemrix allowed me to engage her in good faith, to admit that sometimes medicine makes bad calls and that the media can be complicit. I brought it up to my wife to show that I care about her worries, that I don&#39;t think they are beyond the pale. When easing somebody&#39;s fears, love is rarely enough — empathy is needed, especially when you want to persuade. Refusing to engage in any open-minded discussion, to concede that things can go wrong, to admit that it&#39;s possible we don&#39;t know everything: That kind of condescension had gotten me nowhere with my wife and her daughter no closer to vaccinations. It hasn&#39;t gotten the broader fight against anti-vaxxers very far either.\n  When easing somebody&#39;s fears, love is rarely enough — empathy is needed, especially when you want to persuade\n  A lack of personal investment is, as it happens, what led to my wife&#39;s initial rejection of vaccines: She had a very unfortunate run-in with a complacent MD in her late teens, while she was going through a lot of pain physically and mentally.\n  It started with a drug-induced psychotic breakdown. She grew up in something of a broken home, with an absent father, an addict mother, and a violent stepfather — an environment where drugs were easy to come by and hard to ignore. At 17, she smoked something weird and felt herself quite literally losing it. Hallucinations. Panic attacks. Nausea and heart palpitations. After a grueling week of recovering from the episode, she did the normal thing and took herself to a doctor.\n  She got out with a prescription and an unshakable feeling that this doctor, and his clinic, and the government that paid for his services, did not care at all about her concerns, her needs, and her fears. That she was a problem that could be solved with a couple of pills. That the fear she had felt for her sanity was not respected, not even considered. That the solution to her drug problem was  more drugs.\n    This is not a breach of trust that can be restored by telling her vaccines are safe.\n  It&#39;s obvious and painful that all human systems are going to fail at some places due to human imperfection. It&#39;s probably impossible to force all doctors to be nice and considerate people.\n  Maybe my wife would have felt just as abandoned even if the doctor did everything right at that moment. But knowing that for many anti-vaxxers there is a root cause — something that led them to mistrust medicine and then wind up in a feedback loop that reinforced that mistrust — is vital to pushing back. I do think minds can be changed and hearts can be won, but I&#39;ve made my peace: Only love, patience, and empathy will make inroads. Treat anti-vaxxers kindly, if only because it&#39;s pretty hard to feel persecuted when your adversaries are being kind. This is the road I chose, and I am happy to share my life with a person who challenges and inspires me. Someone whom, a mere decade ago, I would have considered a dangerous lunatic.\n  And then, last week, her daughter asked if she would be getting shots this year.\n  &#34;Not with your classmates,&#34; my wife said. &#34;But yes, it&#39;s time. We&#39;ll schedule an appointment with our new family doctor.&#34;\n        First Person is Vox&#39;s home for compelling, provocative narrative essays. Do you have a story to share? Read our  submission guidelines, and pitch us at  firstperson@vox.com.\n     Millions turn to Vox to understand what’s happening in the news. Our mission has never been more vital than it is in this moment: to empower through understanding. Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.  Please consider making a contribution to Vox today from as little as $3.\n Explainers   What’s with these invasive “crazy” worms and why can’t we get rid of them?\n  View all stories in Science &amp; Health", "posttime": "2021-06-19 15:30:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "vaxxers,anti,疫苗", "title": "我以为所有的反vaxxers都是白痴。 然后我结婚了。 （2015） ", "title_en": "I thought all anti-vaxxers were idiots. Then I married one. (2015)", "transed": 1, "url": "https://www.vox.com/2015/9/4/9252489/anti-vaxx-wife", "via": "", "real_tags": ["vaxxers", "anti", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "259e4637ca0f08999c463b038ce85400.jpg", "infoid": 1066846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃因霍温技术大学，高科技校园埃因霍温，以及像ASML和飞利浦这样的本地企业一直在欧洲的举措，并申请他们学会了到该地区的战略。飞利浦于1891年在埃因霍温推出，并在市政野心成为技术中心的雄心壮志中发挥了不小部分。\n 考虑到其小人口，埃因霍温每年生产大量专利，并已成为过多数量的硬件初创公司。例如，本地高科技校园具有高硬件焦点。\n  我们的调查受访者认为这座城市在光子，机器人，医疗器械，材料科学，深度技术，汽车技术，可持续发展技术，Medtech，大数据，硬件和精密工程等领域。他们正在寻找更多成熟的初创公司和扩展，专注于AI和Hard Tech。\n 埃因霍温被认为是金融气和消费品的较弱，并且存在于全球知名度有限的小区域。\n 在未来五年内，一位受访者表示，“埃因霍温将向荷兰的第二大科技生态系统落后于阿姆斯特丹。在欧洲规模上，埃因霍温将进入前十名。“\n     什么行业部门是您的科技生态系统强大？你最兴奋的是什么？什么是弱者？\n    科技投资者是什么样的？你城市的投资场景是什么？他们的焦点是什么？ \n谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？  什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  高科技系统和材料，真正的高科技和深度技术的东西，要么导致科学突破或转向公司的科学突破。 光刻对此以及医疗设备和生产技术作出了重大贡献。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  五年后，你在哪里看到你的城市的科技场景？ \n什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  优点是高科技系统，协作文化和优秀的创业生态系统; 缺点是，它是全球知名度有限的小区域。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  其他人会搬进去！ 住房非常昂贵，但对熟练员工的需求非常高。 如果人们搬到周边地区，30公里内，房价飙升全面。  谁是您所在城市的主要启动人员（例如，投资者，创始人，律师，设计师等）？\\  五年后，你在哪里看到你的城市的科技场景？ \n全球领先地位在几个技术领域，主要是高精度，轧辊加工原子层沉积，物料搬运，工业4.0，硅加工设备。\n  什么行业部门是您的科技生态系统强大？你最兴奋的是什么？什么是弱者？\n 该地区深入技术，汽车技术，可持续发展技术，Medtech，大数据，硬件和精密工程。最兴奋的可持续发展技术和深度技术。该地区在金融气中很弱。\n   科技投资者是什么样的？你城市的投资场景是什么？他们的焦点是什么？\n 保守，非风险 - 采取措施 - 有这么多的补贴，他们不需要冒险，所以一旦科技风险消失了，他们就是好的，但它们并不是全球化的;硬件。\n 随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？\n 硬件是实践 - 人们还在搬进去！我们有一个住房“危机！” \n谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？  什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？ \n什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  该地区深度技术和健康状况很强。 我对不同公司之间的合作机会感到兴奋。 它在种子投资中很弱。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  他们会留下来; 从家里工作有一些好处，但在鼓舞人心的环境中会面的人会带来最好的协同作用。  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？ \n什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  该地区在建立可持续发展和有弹性的城市和城市/社会和技术市场之间的平台方面很强。  数字工具箱（Serendipity Spinoff），琥珀（移动性），Active Esports Arena和Lumo Labs的其他投资组合公司。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  通过LUMO实验室，重点是社会投资; 其余的是由于大行业（VDLK，ASML，恩智浦，菲利普斯）的高科技投资。  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？ \n埃因霍温科技大学和大公司支持的加速器（Lumo Labs，Hightechxl，Braventure）和Brainport（生态系统管理）的组合。  五年后，你在哪里看到你的城市的科技场景？  领导世界各社会/全身变化 - 从高科技迈向影响（更多软件和数字化）。  什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  它在高科技设备，硬件，光子，添加剂制造，照明，电子，半导体技术和健康技术方面强大，消费产品和应用程序疲软。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？ \n他们会留下来。埃因霍温是一个热点，具有许多文化，国际科技界和基础设施伟大的基础设施，而感觉像一个村庄。\n 谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？\n  五年后，你在哪里看到你的城市的科技场景？\n   什么行业部门是您的科技生态系统强大？你最兴奋的是什么？什么是弱者？\n 埃因霍温生态系统在流动性，智能城市和能源的部门中非常强大。我对聪明的城市非常兴奋。这是我们的焦点部门，它是与影响解决方案的生态系统合作的体现。\n   科技投资者是什么样的？你城市的投资场景是什么？他们的焦点是什么？\n 投资场景越来越好。他们越来越意识到深度技术需要时间，需要培养，但潜在的影响是巨大的，对整个生态系统产生巨大影响。仍有相对较少的早期影响驱动器投资者。 Lumo Labs正在领先地前面的包装。 \n随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  我认为更多的人将留在荷兰的技术中心减少到阿姆斯特丹的必要性，使埃因霍温引起了加强其自身的生态系统，这反过来又会让更多人留下来吸引人们在城市搬迁。 因此，Covid-19将对Eindhoven的科技生态系统产生积极影响，我相信。  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？  五年来，我认为埃因霍温将发展到荷兰的第二大科技生态系统，落后于阿姆斯特丹。 在欧洲规模上，埃因霍温将进入前10名。 ", "note_en": "The Technical University of Eindhoven, High Tech Campus Eindhoven, and locally based corporates like ASML and Philips have been eyeing initiatives across Europe and applying what they’ve learned to the region’s strategy. Philips launched in Eindhoven in 1891 and played no small part in the municipality’s ambitions to become a tech hub.\n Eindhoven produces a high number of patents per year considering its small population and has been home to an inordinate number of hardware startups. The local High Tech Campus has a high hardware focus, for instance.\n  Our survey respondents consider the city strong in areas like photonics, robotics, medical devices, materials science, deep tech, automotive tech, sustainability tech, medtech, Big Data, hardware and precision engineering. They are looking for more mature startups and scaleups focused on AI and hard tech.\n Eindhoven is considered weaker in fintech and consumer products, and it exists in a small region with limited global visibility.\n Over the next five years, one respondent said, “Eindhoven will have evolved to the Netherlands’ second-largest tech ecosystem, behind Amsterdam. On a European scale, Eindhoven will have entered the top 10.”\n     What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n    What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n High-tech systems and materials, the real high-tech and deep tech stuff that either leads to scientific breakthroughs or turns scientific breakthroughs into companies. Lithography makes a major contribution to that, as well as medical devices and production technologies.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The pros are high-tech systems, collaboration culture and excellent startup ecosystem; The cons are that it’s a small region with limited visibility globally.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n Others will move in! Housing is extremely expensive but the demand for a skilled workforce is extremely high. If people move to surrounding areas, within 30 km, housing prices skyrocket all over.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\\\n  Where do you see your city’s tech scene in five years’ time?\n Leading worldwide in several technology areas, mainly, high-precision, roll-to-roll processing atomic layer deposition, material handling, industry 4.0, silicon processing equipment.\n  What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The region is strong in deep tech, automotive tech, sustainability tech, medtech, Big Data, hardware and precision engineering. Most excited by sustainability tech and deep tech. The region is weak in fintech.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n Conservative, non-risk-taking — there are so many subsidies they don’t need to take risks, so once the tech risk is gone, they are good, but they are not global enough; hardware.\n With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n Hardware is hands-on — people are still moving in! We have a housing “crisis!”\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n    What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n  Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The region is strong in deep tech and health. I’m excited about opportunities for cooperation between different companies. It’s weak in seed investment.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n They will stay; working from home has some benefits but meeting people in an inspiring environment gives the best synergy.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The region is strong in building sustainable and resilient cities and a platform between cities/society and tech market.\n  Digital Toolbox (a Serendipity spinoff), Amber (mobility), Active Esports Arena and other portfolio companies of LUMO Labs.\n What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n Through LUMO Labs, there is a focus on societal investments; the rest is investment in high tech due to the big industries (VDLK, ASML, NXP, Phillips).\n With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n  Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n A combination of accelerators (LUMO Labs, HighTechXL, Braventure) and Brainport (ecosystem management) supported by the Eindhoven University of Technology and big corporates.\n Where do you see your city’s tech scene in five years’ time?\n Leading in the world on societal/systemic change — moving from high-tech toward impact (more software and digitization).\n  What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n It’s strong in high-tech equipment, hardware, photonics, additive manufacturing, lighting, electronics, semiconductor technology and health tech, and weak in consumer products and apps.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n They will stay. Eindhoven is a hot spot with many cultures, international tech community and great infrastructure, while it feels like a village.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The Eindhoven ecosystem is really strong in the sectors of mobility, smart city and energy. I’m most excited about smart city. This is our focus sector and it is the embodiment of ecosystem collaboration with impact solutions.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n The investment scene is getting better. They are increasingly realizing that deep tech takes time and needs to be nurtured, but the potential impact is massive and can have a dramatic effect on the entire ecosystem. There are still relatively few early-stage impact drive investors. LUMO Labs is leading the pack on that front.\n With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n I think more people will stay as the need to move to Amsterdam as the tech hub of the Netherlands diminishes, giving Eindhoven a boost to strengthen its own ecosystem, which will in turn make even more people stay and attract people to move in the city. As a result, COVID-19 will have a positive effect on Eindhoven’s tech ecosystem, I believe.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n In five years, I believe Eindhoven will have evolved to Netherlands’ second-largest tech ecosystem, behind Amsterdam. On a European scale, Eindhoven will have entered the top 10.", "posttime": "2021-06-19 14:54:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表示,eindhoven,技术", "title": "投资者表示，埃因霍温将成为荷兰的2号技术中心 ", "title_en": "\n\t\t\t\tInvestors say Eindhoven poised to become Netherlands’ No. 2 tech hub\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/18/investors-say-eindhoven-poised-to-become-netherlands-no-2-tech-hub/", "via": "", "real_tags": ["表示", "eindhoven", "技术"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们推出这个时\r 页面在1996年，有很多网站的特色电视故障，\r 但从那时起，每个汤姆迪克和哈利都推出了自己的页面。即便是\r 英国广播公司已经进入了这一行为，随着他们的崇拜推出\r 电视节。我们希望是最好的，所以MHP与之合作\r 电视室，现在乘坐身份区内容。\n  原始标识区域\r 内容将留在这里，但没有更新。请访问\r 英国电视演示报道的全面目录的电视室。\n        每章都致力于\r 特定的电视图形，象征，符号或徽标。随着时间的推移，\r 我们希望它将建立成为电视的最终信息来源\r 图形。部分部分由MHP以外的网站托管。不要＆＃39; t\r 担心 - 他们都非常好，希望他们都包含一个链接。\r 如果您想了解更多关于a的信息，我们还会提出一些推荐的链接\r 具体主题。\n  如果您可以帮助纠正任何一个\r 事实，提供任何日期，或者建议缺少什么＆＃39;即使你没有\r 副本），然后请联系。加入MHP-Chat\r 并讨论与同事的主题。\n    \n        如果您喜欢此功能，您可能会喜欢\r加入与MHP聊天讨论此网站涵盖的主题的同事爱好者 ", "note_en": "When we launched this \r page in 1996, there were very few websites which featured television idents, \r but since then every Tom Dick and Harry has launched their own page. Even the \r BBC have got in on the act, with the launch of their  Cult \r TV section. We want to be the best, so MHP has teamed up with  The \r TV Room, who have now taken on board the Ident Zone content.\n  The original Ident Zone \r content will remain here, but is not being updated. Please do visit  The \r TV Room for the comprehensive catalogue of UK Television Presentation idents.\n        Each chapter is dedicated to \r a particular breed of television graphics, idents, symbols or logos. Over time, \r we hope it will build to become the definitive source of information on television \r graphics. Some of the sections are hosted by web sites other than the MHP. Don&#39;t \r worry - they are all very good and hopefully they all contain a link back here. \r We have also put some recommended links if you want to find out more about a \r particular topic.\n  If you can help correct any of \r the facts, supply any dates, or suggest what&#39;s missing (even if you don&#39;t have \r a copy), then please get in touch. Join  mhp-chat \r and discuss the subject with fellow enthusiasts.\n    \n        If you enjoyed this feature, you might like to\rjoin fellow enthusiasts who discuss the subjects covered by this web site on  mhp-chat", "posttime": "2021-06-19 14:47:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电视,zone", "title": "ident区 - 通过年龄的电视图形（2000） ", "title_en": "The Ident Zone – Television Graphics Through the Ages (2000)", "transed": 1, "url": "http://www.meldrum.co.uk/mhp/identzone/index.html", "via": "", "real_tags": ["电视", "zone"]}, {"category": "", "categoryclass": "", "imagename": "a5a7d525b1a0334079e70c48f9f21b0a.jpg", "infoid": 1066844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "具有索赔国际名声的最不寻常的当地网站之一是伍德德德。它是由布莱顿的监护人更加成本削减练习的1858年，而不是打破世界纪录的尝试，但它确实突破了一个纪录，仍然是世界上最深的“手挖”。\n 计划在1858年的新工作室重新开始，计划在目前Elm Grove的顶部建立一个新的工作室，并在沃伦农场距离少年2英里的少年工业学院添加到它。学校的目的是教导小镇的错位青年“行业的习惯”，并从“贫民祸害”中解脱出来。\n 然而，泵送水的费用，从当地的水上供应泵送水，然后在Lewes Road（现在的桑德斯公园）的角落被认为是禁止的，因此监护人决定他们将为两个属性构建一个井从Dyke Road Wouchhouse劳动中增加劳动力的劳动力。在他们看来，为更贫困的贫民，年轻或旧的，无论是性别的，有条件的穷人建设的一个方面都会减轻劳动力的一个方面，这将减少劳动力成本，并对考虑申请申请工作时，对任何人间接增加进一步威慑力宽松糟糕。\n 最初的计划不是成功的初始计划是将一个6英尺宽，砖衬里轴下降约400英尺到地下水位。所有的土壤挖出将放在铲斗中，手绞合到轴顶部的平台，在那里可以处理它。经过2年的挖掘后，轴仅达到约438英尺的深度，但没有发现水。担心他们刚错过了这项供应，承包商给了一个横向室的指示北向北驶过30英尺，但这也没有任何东西。进一步的横向隧道是向西和向东推动的，但它们都没有成功。未能承认失败，监护人在东部隧道尽头制定了另外4英尺宽轴的结构。\n 每天24小时挖掘24小时的工作持续了几年，男子每天24小时工作，只是蜡烛灯在令人震惊的条件下。许多人拆除了他们的衣服，赤身裸体工作，范围内的4英尺的男子队伍的范围不得不挖掘，装配桶和砖块。 Winchmen站在微小的平台上切成轴的一侧，随着轴继续向下延伸而使破坏和砖块下来。一个绞车实际上陷入了他的死亡。\n 升级成本导致地面的关注受到监护人开始争夺费用，对于伍德德德井现在正在降低当地的比率Payer，每周约90英镑，关于它的竞赛常见。有些人说该镇正在建造一个替代路线到左侧，而其他小镇则将整个东西描述为“一个伟大的钻孔”！\n 最后一次突破于1862年3月16日星期日晚上的变化，瓦工注意到他站立的地球薄的地壳正在像巨型活塞一样慢慢推动。争先着每个绞车的平台，他和其他人快速腾出了井。这一定是井现在已经沉没到这么令人惊叹的深度的艰难任务，他们的成功出口花了约45分钟。突然用咆哮，活塞头碎了碎，铲斗和梯子淹没了轴。最后发现了水。它已经采取了4年的劳动力劳动力，包括许多布赖顿派斯，手工挖掘轴约1285英尺（其中850英尺，在海平面低于海平面）而没有机器。 \n一个令人难以置信的成就，使这种令人难以置信的成就，距离和危险进入视角，我可以想到没有比P Mercer＆amp中使用的更大的比喻; D荷兰的“亨纽斯坑”，我用自己的插图解释了。 伍德德德井的深度进入地球的深度大于帝国大厦的高度。 想象一下，在每天两次，使用一系列摇摇欲坠的梯子在黑暗中攀登攀登，并在你和你的同事下面的水淹没了恐慌状态。  我同意我的姓名和电子邮件地址与此评论一起存储，并通过关于必要的电子邮件与我通信的网站编辑。 我的名字可以与网站的评论一起发布，但我的电子邮件地址不会发布。 我的信息不会与任何第三方共享（请参阅我们的隐私声明 - 在新窗口中打开）。 * ", "note_en": "One of the more unusual local sites with a claim to international fame is the Woodingdean Well. It was started in 1858 by Brighton’s Guardians more as a cost cutting exercise, than as an attempt to break a world record, but it did break a record and still remains as the deepest “HAND DUG” well in the world.\n Plans for a new workhouse  Back in 1858, plans were in hand to build a new workhouse at the top of what is now  Elm Grove and to add to it an industrial school for juveniles some 2 miles away at Warren Farm. The aim of the school would be to teach the misplaced youth of the town “the habits of industry” and relieve them from “the bane of pauperism.”\n The expense of pumped water  However, the expense of having pumped water supplied from the local waterworks, then on the corner of  Lewes Road (now Saunders Park) was considered prohibitive, so the Guardians decided that they would construct a single well for both properties and augment the workforce with labour from the  Dyke Road Workhouse. In their opinion, making relief for the more able pauper, young or old and regardless of gender, conditional on some of the destitute undertaking an aspect of the well’s construction would reduce labour costs and indirectly add a further deterrent to anyone considering applying to the workhouse for poor relief.\n The initial plans were not successful  initial plan was to sink a 6 ft wide, brick lined shaft down some 400 feet to the subterranean water table. All the soil dug out would be placed in buckets and hand winched to a platform at the top of the shaft where it could be disposed of. After 2 years of digging, the shaft had only reached a depth of some 438 feet, but no water had been found. Fearing that they had just missed the supply, the contractor gave instructions for a lateral chamber to be driven some 30 ft northwards, but this too yeilded nothing. Further lateral tunnels were driven westwards and eastwards, but none of them were successful. Failing to acknowledge defeat, the Guardians sanctioned the construction of a further 4 ft wide shaft at the end of the eastern tunnel.\n Digging done for 24 hours a day  Work continued for several more years with men working 24 hours a day just by candle light in appalling conditions. Many removed their clothes and worked naked for within the confines of a 4 ft circle teams of men had to dig, load buckets and lay bricks. Winchmen stood on tiny platforms cut into the side of the shaft, passing spoil up and bricks down as the shaft continued forever downwards. One winchman actually plunged to his death.\n Escalating costs caused concern  Above ground the Guardians began to bicker about the expense, for the Woodingdean Well was now costing the local ratepayer some £90 a week and jests about it were frequent. Some said the town was constructing an alternative route to the Antipodes, whereas others described the whole thing as “a great bore”!\n The final break through  At the change of the evening shifts on Sunday 16th March 1862, the bricklayer noticed that the thin crust of earth he was standing on was being slowly pushed upwards like a giant piston. Scrambling up the numerous ladders to each winchman’s platform, he and the others quickly vacated the shaft. It must have been a difficult task for the well had now been sunk to such an amazing depth their successful exit took some 45 minutes. Suddenly with a roar, the piston head crumbled and tools, buckets and ladders flooded up the shaft. Water had at last been found. It had taken over 4 years backbreaking work for a labour force which included many Brighton paupers, to hand dig a shaft some 1285 feet deep (850 of which were below sea level) without the aid of machines.\n An incredible achievement  To put this incredible achievement, distance and the danger into perspective, I can think of no greater analogy than that used in P Mercer &amp; D Holland’s “Hunns Mere Pit” which I have interpreted using my own illustration. The Woodingdean Well’s depth into the earth was greater than the height of the Empire State Building. Imagine climbing that building in darkness on a twice daily basis, using just a series of rickety ladders, let alone in a panic situation with water flooding up beneath you and your colleagues!\n  I consent to my name and e-mail address being stored along with this comment, and to the website editors communicating with me by e-mail about the comment if necessary. My name may be published alongside the comment on the website, but my e-mail address will not be published. My information will not be shared with any third party (see our  Privacy Statement - opens in a new window).  *", "posttime": "2021-06-19 14:47:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "在世界上,hand", "title": "最深的手在世界上挖井 ", "title_en": "Deepest Hand Dug Well in the World", "transed": 1, "url": "https://www.mybrightonandhove.org.uk/places/utilities/woodingdean-well/woodingdean-well", "via": "", "real_tags": ["在世界上", "hand"]}, {"category": "", "categoryclass": "", "imagename": "b2954f158a2afc09ff84567f354259a1.jpg", "infoid": 1066843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MCLean，基于弗吉尼亚州Booz Allen Hamilton，已经是D.C.地区最大的IT承包商，已完成7.25亿美元的基于Herndon的自由IT解决方案收购。  该公司拥有大约600名员工。 除了埃尔纽隆总部，它还拥有埃斯诺伊州埃斯塔尼亚和墨尔本，佛罗里达州的业务。 其工作包括政府机构和医疗保健行业的现代化项目，包括退伍军人事务部。  Liberty IT解决方案在其现代化工作中具有超过20亿美元的积压。 Booz Allen表示，收购将立即增加收入增长和收益。  Booz Allen在本月早些时候的现金组合和5亿美元债务提供的收益。  Booz Allen拥有超过14,000个D.C.区域员工，近28,000个全球。 2020年收入的79亿美元，几乎所有来自政府承包销售的收入。 ", "note_en": "McLean, Virginia-based  Booz Allen Hamilton, already the largest government IT contractor in the D.C. region, has completed its acquisition of Herndon-based  Liberty IT Solutions for $725 million.\n  The company has about 600 employees. In addition to its Herndon headquarters, it has operations in Exton, Pennsylvania, and Melbourne, Florida. Its work includes IT modernization projects for government agencies and the health care industry, including the Department of Veterans Affairs.\n  Liberty IT Solutions has a backlog of more than $2 billion in IT modernization work. Booz Allen says the acquisition will immediately increase revenue growth and earnings.\n Booz Allen paid for the acquisition with a combination of cash and from proceeds of a $500 million debt offering earlier this month.\n Booz Allen has more than 14,000 D.C.-area employees and almost 28,000 worldwide. It had $7.9 billion in 2020 revenue, almost of all which came from government contracting sales.", "posttime": "2021-06-19 14:05:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "liberty,allen", "title": "Booz Allen Hamilton以725米的价格获得Liberty IT解决方案; Liberty它的工作包括GOVT的现代化项目。 机构和医疗保健行业 ", "title_en": "Booz Allen Hamilton acquires Liberty IT Solutions for $725M; Liberty IT's work includes IT modernization projects for govt. agencies and the healthcare industry", "transed": 1, "url": "https://wtop.com/business-finance/2021/06/booz-allen-closes-on-725m-acquisition-of-herndon-it-contractor/", "via": "", "real_tags": ["liberty", "allen"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此站点需要要启用的cookie才能运行。 请确保cookie已打开，然后重新访问所需的页面。 ", "note_en": "This site requires Cookies to be enabled to function. Please ensure Cookies are  turned on and then re-visit the desired page.", "posttime": "2021-06-19 14:05:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,伊维,effect,cookie", "title": "高剂量伊维菌素在成人与Covid-19中的抗病毒作用 ", "title_en": "Antiviral effect of high-dose ivermectin in adults with Covid-19", "transed": 1, "url": "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(21)00239-X/fulltext", "via": "", "real_tags": ["病毒", "伊维", "effect", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "9f8a6569228527d4ce156f92345a5136.jpg", "infoid": 1066841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数毕业咨询 - 是否在危机的繁荣时期或时刻 - 描绘未来用未经搞砸的地面和无穷无尽的未知。如果你从过去看一下开始发表的地址，你会看到一个人的权力人员告诉特权的年轻人相信和草图的未来可能是什么，我们现在可以考虑旁边的现实接下来是什么。 Lapham的季度正在重新审视毕业生和其他人在获取知识或技能的过程中向毕业生和其他人提供建议的历史。\n  教会书是圣经“智慧”书籍之一，属于古老的文学传统，从苏美尔和巴比伦开始，记录圣人的建议。 ECclesistes这个词从希腊ekklesiastes源于希腊ekklesiastes，或者“解决一个装配的人”，这是希伯来语Qohelet（也是koheleth）的粗略翻译，意思是“传教士”或“老师”。 Qohelet是由教会的明显作者在文本中给出的名称。他还声称成为耶路撒冷之王和大卫的儿子。如果这是他真正的父母，Qohelet就是以色列人的第十世纪统治者王于萨洛蒙。犹太人和基督教神学家传统上，通过将特罗蒙斯和谚语，所罗门的其他圣经着作之间放置在旧约中的歌曲之间的歌曲和谚语。然而，文本的亚拉姆语贷款歌曲建议它是在第三世纪组成的，在所罗门的王国分开，耶路撒冷成为亚渊帝国的殖民地之一。\n Qohelet是一个深刻的愤世嫉俗的思想家，也许是因为以色列人的状态减弱。他描述了一个无法保证成功和幸福的世界，在人类贪婪，识别和痛苦面临的情况下，个人在很大程度上是无能为力的。他对读者的建议是接受他们的生活的徒劳，欢迎所有人类行为是“虚荣”或“蒸气”的知识。他建议（也许受到埃基哲学的希腊哲学的影响），最好的行动方案是追求宁静和快乐：\n 因此，用快乐吃你的面包，用快乐的心喝你的葡萄酒。上帝已经批准了你的契约。始终是你的衣服白色，让油不是缺乏你的头部。与你的爱的女人享受生活的生活，所以上帝在太阳下给了你的生活。这是生活中的部分和阳光下的你的辛劳的补偿。无论你能用你的物质所做的，因为没有活动，或监测或知识，没有智慧。 1\n 自第一世纪以来，学者们已经争论了为什么Qohelet对人类生活的悲观冥想被列入圣经中。宾夕法尼亚大学的山茱萸专家莫里斯Jastrow Jr.在他的1919年翻译中指出，“这是一个奇怪的书，陷入了神圣的系列。” Jastrow出现了产生新的Qohelet的词语翻译，相信各个巨大的适应和重新恢复导致不同的工作，而不是创造者的意图;他决心给二十世纪读者一个非常古老的文本的新印象：\n 在新的服装中提出Qohelet，减去附加到原始组合物的装饰，我希望能够在旧约的任何一系列翻译中阅读它比读它更容易理解的文学制作，所有这些都以1611的经典“授权”版本为模型，并且所有这些都认为本书是其现状的文学单位。换句话说，我试图将读者置于原始形式的Qohelet书，如目前可能的那样。\n 来自William Shakespeare的作家到伊迪丝沃顿省沃特顿有易怒的Qohelet的话语，Leo Tolstoy在一个忏悔的中期危机中转向牧师，写出他的疑惑，他的疑惑开始了一个人的疑虑：“我是什么意思是什么意思。在这几句话中，整个问题都在于整个问题。“ \n他的所有辛劳的人有什么东西，他在阳光下辛劳？一代来，一代去，但地球仍然是永恒的。太阳升起和太阳落山，他回来的冉冉升起的地方。在南方和北部圈出来，周围和周围的风，以及风返回的电路。所有溪流都流入大海，但大海并不满。到溪流流动的地方，从那里流出。一切都疲惫不堪，超越人类的话语，超越视野和听证会。是什么意思;发生了什么，这将发生这种情况，因此在阳光下没有任何新的东西。\n 如果发生某些事情，其中​​一个人说：“看到，这是我们之前的新” - 它已经发生了。未记录以前的事件，稍后的发生也不会被迄今为止的年龄记住。\n 我，Qohelet是耶路撒冷的以色列国王，我申请了我的思想，寻求和探索太阳下的一切 - 一个遗憾的业务，上帝给予男人的孩子们的痛苦。我看到所有发生在太阳下面的一切 - 并且在风之后都是虚荣的。\n 现在我想自己，我已经变得伟大，比任何在耶路撒冷统治的人都多得多。我的思绪非常智慧和知识。所以我出发了体验轻浮和愚蠢，尽管我也知道这也是在风之后追逐。我对自己说，来吧，我会对快乐进行考验，并且有一个美好的时光，但唉！这也表明是虚荣的。体育运动，我被告知得出结论，它是疯狂，而且快乐 - 它的成就是什么！我决定用葡萄酒刺激我的身体并追求愚蠢，以确定这对男人的孩子来说是度过他们的生活的好方法。\n 我进行了伟大的作品。我获得了房屋;我种植了葡萄园;我制作了花园和公园。我种植了各种各样的果树，我制作了水池，灌溉发芽森林。我购买了奴隶和手工，并拥有家族，除了拥有大量的牛和鸡群，比耶路撒冷面前的任何人都多。我也聚集了银色和金，皇家珍品和省份;我有歌手和跳舞少女和男人孩子的所有美食。\n 所以我变得伟大，超过了在耶路撒冷面前的任何人。我没有扣留任何我的眼睛所希望的东西，我没有否认自己有任何乐趣，因为我在我所有的辛劳中都很高兴，这是我所有的辛劳的一部分。但是当我看着所有的手都是锻造的所有东西时，我的劳动到了所有的东西，那么风似乎是虚荣的，风后追逐。在阳光下似乎没有什么值得的。\n 所以我对疯狂和愚蠢的考验，对于任何人都可以做些什么，以外的是他已经完成的东西？然而，我似乎也许智慧在愚蠢方面有一个优势，因为光比黑暗更好。但是，我意识到所有人都有一个和同样的命运，我反映了傻瓜的命运也会超越我。为什么我应该越来越多？我得出结论，这也是虚荣的。对于聪明人来说，因为傻瓜，没有永久的记录。在到来的日子里，一切都被遗忘了。看看智者如何像傻瓜一样死！ \n所以我讨厌生活。在太阳下面发生的一切对我来说看起来很邪恶，因为一切都是虚荣的，风后追逐。我讨厌，我必须把我所有人留给在阳光下辛苦的人，以追随我的人。一个用智慧，知识和诚信辛苦辛辛劳的人必须把它作为一种追求的人作为一个尚未辛苦的人 - 肯定是虚荣和一个伟大的邪恶。什么是他在阳光下的所有辛劳和他艰苦的努力的人，因为他所有的日子都是痛苦和他的野心，即使在晚上也没有休息？当然这是虚荣的。\n 一个人比吃和喝酒，喝酒并享受他的辛劳的更好。在我看来，这就是上帝的旨意。一切都有其指定的时间，并且有一段时间在阳光下。有一个诞生的时间，以及死亡的时间。有一个种植时间，以及连根拔起的时间。那么，有什么利润，有他的辛劳工人？\n 我已经观察到上帝为男人的孩子们为他们的痛苦而引起的每一个野心。他让他们把它们掌握了整个世界，没有人们在那些人中掌握了上帝从一开始到结束的工作。我意识到一个男人没有比快乐更好，在他的生命中享受自己，并且每个人都吃喝的人，在他所有的劳动中都有美好时光享有上帝的礼物。我意识到，无论上帝所做的任何东西都是永远的，哪一个不能添加，从中一个不能带走。无论是以前的任何东西，还有什么已经过去。\n 我在阳光下看到正义的邪恶，并且正义应该是邪恶的地方。我反映了上帝允许这是男人的孩子来测试它们并表明他们是野兽。对于男人的命运和野兽的命运是一样的。正如这个模具所在，那就是死亡，而且有相同的精神。男人对野兽没有优势，因为一切都是虚荣的。一切都去了一个地方。一切都是灰尘，都回到灰尘。谁知道男人的孩子是否安装起来，野兽的精神下降了？它似乎对人类来说比享受自己更好。这是他的部分 - 谁可以帮助他看看他应该是什么？\n 我认为在阳光下练习的所有压迫，而受压迫者的泪水没有任何人控制他们，以及他们的压迫者的暴力者在视线上没有被击退！我赞扬了这些长期死亡超过仍然生活的长期;比两者更好的是尚未成为的人，因为他没有看到太阳下的邪恶发生。我认为所有辛劳和所有诚实的工作都只是因为男人对他的邻居的热情 - 肯定是虚荣和风后追逐。更好的少于两只遥控辛劳和追逐之后的安静。我进一步考虑了在太阳下面的虚荣。没有一个没有伴侣的单身男人，没有儿子或兄弟，但毫无端兴奋，而眼睛从不满足他的财富。那么我应该辛劳辛劳剥夺自己的好时光吗？当然这是虚荣的，对不起的事。\n 更好的是孩子谦虚的孩子和聪明的是一个傻瓜，无法照顾自己。因为叛乱可能会犯统治，即使一个人在自己的王国出生差。我看到阳光下的所有生活蜂拥到孩子的一侧，谁在他的位置。所有人都没有结束，但那些来到的人不会在他身上欢喜快乐 - 现在这是虚荣之后的虚荣和追逐。\n 观察你的上帝之家的朝圣，但是抽取近听，而不是傻瓜提供牺牲，因为他们不知道伤害。不要用你的嘴巴猛烈，而不是匆匆地领导上帝面前的一句话，因为上帝在天堂和地球上的艺术。因此，让你的话很少。如果你确实向上帝发誓，请不要推迟付钱。无论你誓言，付钱！最好不要誓要发誓而不是付钱。不要让你的嘴带到你的罪，而不是在上帝面前说它是滑倒。为什么唤起上帝的愤怒并摧毁你自己的手工作业？ \n多种梦想导致许多愚蠢的词语，因为一个梦想来通过太多的业务，并且有许多话说傻瓜的声音。如果你认为穷人的压迫，而在这个国家的义法和正义欺骗，不要惊讶于发生，因为有一些“守护者”更高的上升和仍然更高的人，并超越他们一切都是国王。\n  我在阳光下看到的邪恶是困境的财富，当事人通过一个糟糕的冒险丢失，那个儿子被他从事。他不能随身携带他的辛劳和他所获得的东西。当然，这是一个痛苦的邪恶，就像他来的那样，所以他去了。因此，对他来说，他辛劳的潜水是什么盈利，他在拯救和不断担心和疾病中度过了所有的日子？\n 在我看来，这是好的，善于吃饭，喝酒，并在阳光下的所有辛劳下都有一个美好的时光，因为这是他的部分。上帝赋予财富和财产的每个人都有权力享受它并带走他的部分并在他的辛劳中幸福 - 这是上帝的礼物。因为他应该记住，生命是短暂的，上帝的喜悦批准。\n 我在阳光下观察到了一个邪恶，它沉重地对待人类 - 一个上帝给予了财富和财产和超级水的人，没有任何他所希望的任何东西，而是上帝没有给予谁享受它，让陌生人享受它 - 这肯定是虚荣，邪恶痛苦。\n 如果一个人会有一百个孩子和生活多年来，就是他的生活这么长时间，他并没有让他填补他的喜悦 - 我说堕胎比他更快乐。即使它变成了虚荣，在黑暗中移动，并且在黑暗中，它的名字被覆盖，它从未见过太阳也没有知道的事情 - 但这对另一方来说是优选的。虽然一个男人的生活一千年，两次被告知，并没有愉快的时光 - 不要全部去一个地方？\n 傻瓜有什么优势，或者通过他的知识的穷人设定了一个例子？更好的是享受而不是渴望 - 虽然这也是虚荣的虚荣和追逐。\n 由于确定了，因此已确定并且已修复的内容。男人不能争辩，什么比自己强。由于许多财产只是增加虚荣，他们对人类的优势是什么？对于谁知道在跨越虚荣处期间对一个男人有什么好处？虽然他花了像阴影的生活，但有人可以告诉男人是在阳光下追随他的人吗？ \n1 Sheol是希伯来黑社会，在圣经中描述为“悲观和深黑的土地”（Jow 10:21）。 ↩  阅读我们系列中的其他参赛作品：Lewis H. Lapham，Frederick Douglass，Virginia Gildersleeve和Kurt Vonnegut。  Qohelet是ECCLESSISSTES的归属作者，这是一本智慧文学的旧约。 由于这本书的叙述者是指自己作为“大卫的儿子，耶路撒冷国王”，一些读者已经确定了ECCLESSIASTES的作者作为所罗门，而其他读者则谨慎对待与文本作者等同于叙述者。 ", "note_en": "Most graduation advice—whether given in boom times or moments of crisis—depicts a future replete with untrammeled ground and endless unknowns. And if you take a look at commencement addresses from the past, you’ll see a glimpse of what people in power told privileged young people to believe in and sketches of what the future could be, which we can now consider next to the reality of what came next. Lapham’s Quarterly  is revisiting the history of giving advice to graduates and others in the process of acquiring knowledge or skills.\n  The Book of Ecclesiastes is one of the biblical “wisdom” books and belongs to an ancient literary tradition, beginning in Sumer and Babylonia, of recording the advice of sages. The word  Ecclesiastes derives from the Greek  ekklesiastes, or “one who addresses an assembly,” which is a rough translation of the Hebrew word  Qohelet (also  Koheleth), meaning “preacher” or “teacher.” Qohelet is the name  given in the text by the apparent author of Ecclesiastes. He also claims to be a king of Jerusalem and the son of David. If that is his true parentage, Qohelet was King Solomon, the tenth-century-  ruler of the Israelites. Jewish and Christian theologians have traditionally followed this attribution by placing Ecclesiastes between the Song of Solomon and the Book of Proverbs, Solomon’s other biblical writings, in the Old Testament. Yet the text’s Aramaic loanwords suggest it was composed in the third century  , after Solomon’s kingdom was divided and Jerusalem became one of the colonies of the Achaemenid Empire.\n Qohelet was a deeply cynical thinker, perhaps because of the diminished state of the Israelites. He describes a world in which success and happiness are not guaranteed, where an individual is largely powerless in the face of human greed, fallibility, and suffering. His advice for readers is to accept the futility of their lives and welcome the knowledge that all human actions are “vanity” or “vapor.” He suggests (perhaps influenced by the Greek philosophy of Epicureanism) that the best course of action is to pursue tranquility and pleasure:\n Therefore eat thy bread with joy, and drink thy wine with a merry heart. God has already given his approval to thy deeds. At all times be thy garments white, and let oil not be lacking for thy head. Enjoy life with the woman of thy love all the days of thy vain life that God has given thee under the sun. That is thy portion in life and the compensation for thy toil under the sun. Whatever thou can afford with thy substance do, for there is no activity, or reckoning, or knowledge, and no wisdom in Sheol.  1\n Since the first century, scholars have debated why Qohelet’s pessimistic meditation on human life was included in the Bible. Morris Jastrow Jr., an expert on Semitic languages at the University of Pennsylvania, noted in his 1919 translation, “It is a strange book to have slipped into a sacred collection.” Jastrow set out to produce a new translation of Qohelet’s words, believing that centuries of adaptation and reframing had resulted in a different work than its creator had intended; he was determined to give twentieth-century readers a new impression of a very old text:\n In presenting Qohelet in a new garb, minus the trimmings which were attached to the original composition, it is my hope to make a remarkable literary production more intelligible than is possible by reading it in any of our present-day translations of the Old Testament, which are all modeled on the classic “authorized” version of 1611, and which all assume the book to be a literary unit in its present form. In other words, I have tried to give the reader the book of Qohelet in its original form, as nearly as that is at present possible.\n Writers from  William Shakespeare to  Edith Wharton have paraphrased Qohelet’s words, and  Leo Tolstoy turned to Ecclesiastes during a midlife crisis of faith, writing in   A Confession that his doubts began with a single realization: “What am I?—A part of the infinite. In those few words lies the whole problem.”\n   What gain has a man of all his toil, \tWhich he toils under the sun? \tGeneration comes and generation goes, but the earth remains forever. \tThe sun rises and the sun sets, \tAnd to his rising place he returns. \tAround to the south and circling to the north, \tAround and around goes the wind, \tAnd on its circuits the wind returns. \tAll streams flow into the sea, \tBut the sea is not full. \tTo the place whither the streams flow, \tFrom there they flow back again. \tEverything is wearied, \tBeyond human utterance, \tBeyond sight and hearing. \tWhat has been is that which shall be; \tAnd what has happened is that which shall happen, \tSo that there is nothing new under the sun.\n If something occurs of which one says, “See, this is new”—ages before us it has already happened. Former occurrences are not recorded, and later occurrences also shall not be remembered by the ages that are to come.\n I, Qohelet, was king over Israel in Jerusalem, and I applied my mind to seek and explore everything under the sun—a sorry business which God has given the children of men for their affliction. I saw all that happened under the sun—and behold it was all vanity and chasing after wind.\n Now I thought to myself,  I have become great and acquired much more than anyone who reigned before me over Jerusalem. My mind was stored with very much wisdom and knowledge. So I set out to experience frivolity and foolishness, though I knew that this, too, was chasing after wind. I said to myself,  Come, I’ll make a test of pleasure and of having a good time, but alas! This also turned out to be vanity. Of sport, I was led to conclude that it was madness, and of joy—what does it accomplish! I made up my mind to stimulate my body with wine and to pursue folly, in order to ascertain whether this was a good way for the children of men to spend the days of their lives.\n I undertook great works. I acquired houses; I planted vineyards; I made gardens and parks. I planted in them all kinds of fruit trees, I made pools of water to irrigate the sprouting forest. I purchased slaves and handmaidens, and had a household of dependents, besides having possessions of cattle and flocks in large number, more than anyone before me in Jerusalem. I gathered also silver and gold, royal treasures, and provinces; I got singers and dancing maidens and all the delights of the children of men.\n So I became great, in excess of anyone who was before me in Jerusalem. I did not withhold anything that my eyes desired, I did not deny myself any pleasure, for I rejoiced in all my toil, and this was my portion of all my toil. But when I looked on all what my hands had wrought and on what I had toiled for—all indeed seemed vanity and chasing after wind. Nothing seemed worthwhile under the sun.\n So I made a test of madness and folly, for what can any man do who comes after a king beyond what he has already done? And yet it seemed to me that perhaps wisdom  has an advantage over folly, insofar as light is better than darkness. But then I realized that there is one and the same fate for all, and I reflected that the fate of the fool will also overtake me. Why then should I be overwise? I concluded that this also is vanity. For of the wise man, as of the fool, there is no permanent record. In the days to come everything is forgotten. And see how the wise man dies just as the fool!\n So I hated life. All that happened under the sun seemed evil to me since all was vanity and chasing after wind. I hated that I must leave all that I had toiled for under the sun to one who comes after me. A man who toils with wisdom, knowledge, and integrity must hand it over as an inheritance to one who has not toiled for it—surely this is vanity and a great evil. What has a man of all his toil and of his painstaking efforts under the sun, since all his days are pains and his ambition a vexation, with no rest for his mind even at night? Surely this is vanity.\n There is nothing better for a man than to eat and to drink and to enjoy himself for his toil; it seems to me that such is the will of God. Everything has its appointed time, and there is a time for every occurrence under the sun. There is a time to be born, and a time to die. There is a time for planting, and a time for uprooting. What profit, then, has the worker of his toil?\n I have observed every ambition which God has given the children of men for their affliction. He has given them a grasp of the whole world without the possibility on the part of man to fathom the work which God has made from the beginning to the end. I realized that there is nothing better for a man than to be happy and to enjoy himself in his life, and that every man who eats and drinks and has a good time in all his toil enjoys a gift of God. I realized that whatever God does is forever, to which one cannot add and from which one cannot take away. Whatever has been has been before, and what is to be has already been.\n I saw under the sun in the place of justice wickedness, and where the righteous should have been the wicked was. I reflected that God permits this in the case of children of men to test them and to show that they are beasts. For the fate of the children of men and the fate of the beast is the same. As this one dies, so is the death of that, and there is the same spirit to all. Man has no advantage over the beast, for all is vanity. All go to one place. All are of the dust and all return to dust. Who knows whether the spirit of the children of men mounts up and the spirit of the beast goes down? It appeared to me that there is nothing better for man than to enjoy himself. That is his portion—who can help him to see what shall be after him?\n I considered all the oppressions practiced under the sun, and the tears of the oppressed without anyone to console them, and the violence of their oppressors with no comforter in sight! And I praised these long since dead more than those still living; better than both is the one who has not yet been, as he has not seen the evil happenings under the sun. I considered that all toil and all honest work is merely due to man’s zeal against his neighbor—surely this is vanity and chasing after wind. Better a handful in quiet than two handsful in toil and chasing after wind. And I further considered the vanity that there is under the sun. There is a single man without a mate, without a son or brother, yet toiling without end, and with an eye never satisfied by his wealth. For whom then should I toil and deprive myself of a good time? Surely this is vanity and a sorry business.\n Better is the child of humble birth and wise than an old king who is a fool and unable to take care of himself. For through a rebellion one may come to rule, even though one is born poor in one’s own kingdom. I saw all the living under the sun flocking to the side of the child, who was to stand in his place. There was no end to all the people, yet those that come after will not rejoice in him—now surely this is vanity and chasing after wind.\n Observe thy pilgrimages to the house of God but draw nigh to hear, rather than to have fools offer a sacrifice, for they do not know enough to do any harm. Be not rash with thy mouth, and be not led hastily to utter a word before God, for God is in heaven and thou art upon earth. Therefore, let thy words be few. If thou  does make a vow to God, do not defer paying it. Whatever thou vows, pay! It is better not to vow than to vow and not pay. Let not thy mouth bring sin upon thee, and do not say before God that it was a slip. Why arouse God’s anger and destroy thy own handiwork?\n A multitude of dreams results in many foolish words, for a dream comes through too much business, and a fool’s voice is heard in many words. If thou sees the oppression of the poor, and justice and righteousness in the country defrauded, do not be amazed at the occurrence, for there is some “guardian” higher up and still higher ones above this one, and overtopping them all is the king.\n  A sore evil that I have seen under the sun is riches hoarded by the owner, and when that fortune is lost through a bad venture, the son begotten by him has nothing. He cannot carry anything that he has acquired by his toil away with him. Surely this  is a sore evil, that just as he came, so he goes. Therefore, what profit is it to him that he toils for the wind and that he spends all his days in saving and in constant worry and sickness and distress?\n It seems to me the thing that is good and proper is to eat, drink, and to have a good time with all one’s toil under the sun during the span of life which God has allotted to one, for that is his portion. Every man to whom God has given riches and possessions and who has the power to enjoy it and to take his portion and to be happy in his toil—this is a gift of God. For he should remember that life is short and that God approves of joy.\n There is an evil I have observed under the sun and it bears heavily on mankind—a man to whom God has given riches and possessions and superfluity with nothing lacking of anything that he might wish for, but to whom God has not given the power to enjoy it, so that a stranger enjoys it—this surely is vanity and a sore evil.\n If a man begets a hundred children and lives many years, be his life ever so long, and he does not get his fill of joy out of it—I say that the abortion is happier than he. Even though it comes into vanity, moves in darkness, and with darkness its name is covered and it has never seen the sun nor has known anything—yet this is preferable to the other. And though a man lives a thousand years twice told and has not had a good time—do not all go to one place?\n What advantage has a wise man over a fool, or the poor man who by his knowledge sets an example to the living? Better is enjoyment than longing—though this also is vanity and chasing after wind.\n Whatever is has long since been determined and what is has been fixed. Man cannot contend with what is stronger than himself. Since many possessions merely increase vanity, what advantage are they to man? For who knows what is good for a man during the span of his life of vanity? And though he spends his life like a shadow, is there anyone who can tell man who is to be after him under the sun?\n  1 Sheol is the Hebrew underworld, described in the Bible as “the land of gloom and deep darkness” (Job 10:21).  ↩\n  Read the other entries in our series:  Lewis H. Lapham,  Frederick Douglass,  Virginia Gildersleeve, and  Kurt Vonnegut.\n  Qohelet is the attributed author of Ecclesiastes, an Old Testament book of wisdom literature. As the narrator of the book refers to himself as “the son of David, king in Jerusalem,” some readers have identified Ecclesiastes’ author as Solomon, while others caution against equating the narrator with the writer of the text.", "posttime": "2021-06-19 13:22:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教会,wind", "title": "风后追逐：重新掠夺教会的书 ", "title_en": "Chasing After Wind: Reframing the Book of Ecclesiastes", "transed": 1, "url": "https://www.laphamsquarterly.org/roundtable/chasing-after-wind", "via": "", "real_tags": ["教会", "wind"]}]