[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1069446, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "超市将在 Covid 爆发期间关闭的说法促使新南威尔士州卫生局敦促人们使用“可信和可靠的消息来源” Facebook 表示正在努力限制错误信息在其私人消息应用程序上的传播。周四，据报道，一张据称来自新南威尔士州卫生局的屏幕截图在 WhatsApp 上流传，称作为 Covid-19 响应的一部分，超市将关闭四天。在悉尼大范围封锁期间，新南威尔士州的超市仍然营业，被认为是必不可少的零售店。在周五的一份声明中，该州卫生部门敦促人们不要从新南威尔士州官方卫生渠道以外的任何地方接受建议。一位发言人说：“新南威尔士州卫生局敦促人们使用可信和可靠的信息来源，向他们通报新南威尔士州最新的 Covid-19 信息。”注册每天早上都会收到一封包含澳大利亚卫报头条新闻的电子邮件 Facebook 发言人说：“我们清楚地标记了转发的消息，以帮助人们知道他们收到了不太可能由朋友或家人撰写的内容。我们还对消息的转发方式设置了限制，以限制谣言的传播。我们鼓励人们通过权威来源检查他们收到的消息的准确性，例如我们与澳大利亚政府建立的帮助热线，其中包含有关 Covid-19 的最新和最准确的信息。”\n在整个大流行期间，通过 WhatsApp 群聊传播的错误信息一直是一个持续存在的问题，不仅在澳大利亚，而且在世界各地。在维多利亚州的第二次封锁中，通过 WhatsApp 传播的消息错误地声称，州财政部长蒂姆·帕拉斯 (Tim Pallas) 将取代州长丹尼尔·安德鲁斯 (Daniel Andrews) 以结束封锁。去年，该公司引入了新规则来限制错误信息的传播，包括在消息频繁转发且并非来自密切接触者时注意的图标。还有一个限制，因此这些消息一次只能发送一个聊天。 WhatsApp 表示，这导致该应用程序上高度转发的消息数量减少了 70%。 WhatsApp 的负责人 Will Cathcart 本月早些时候在澳大利亚战略政策研究所的简报会上表示，打击通过 WhatsApp 这样的私人消息服务传播的错误信息的部分困难在于该公司无法访问正在发送的消息。但他表示，WhatsApp 正在与事实核查服务合作，并开展公共教育活动，关于人们是否应该在谣言被分享之前对其提出质疑。他说，在巴西等国家，它已经产生了影响。应用程序：下载免费的应用程序，永远不会错过最重要的故事，或者获取我们的周末版以精选本周最佳故事\n播客：在 Apple 播客、Spotify 上收听我们的每日剧集或在您最喜欢的应用程序中搜索“完整故事”空间，但如果你看看巴西等地最近的选举，我认为与几年前相比，人们对 WhatsApp 在信息环境中的作用的估计发生了巨大变化，”他说。他说，WhatsApp 在检测为传播错误信息而创建的虚假帐户方面也做得越来越好。 “在过去几年中，我们显着提高了检测人们创建大量虚假或不真实账户并自动禁止它们的情况的能力，”他说。 “我们现在每月主动禁止数百万个帐户，这让人们去建立一个信息农场并输出信息并尝试通过消息传递来做到这一点的能力发生了巨大变化。”", "note_en": "Claims that supermarkets will close amid Covid outbreak prompt NSW Health to urge people to use ‘trusted and credible sources’\n    New South Wales Health has issued a warning about misinformation circulating on WhatsApp that claims Sydney supermarkets will close as part of the ongoing lockdown, with owner Facebook saying it is working to limit the spread of misinformation on its private messaging app.\n On Thursday, it was reported that a screenshot purporting to be from NSW Health saying that supermarkets would close for four days as part of the Covid-19 response was circulating on  WhatsApp.\n  Supermarkets in NSW have remained open during the greater  Sydney lockdown and are considered essential retail. In a statement on Friday, the state’s health department urged people not to take advice from anywhere but the official NSW Health channels.\n “NSW Health is urging people to use trusted and credible sources of information to inform them about the most up-to-date Covid-19 information in NSW,” a spokesperson said.\n  Sign up to receive an email with the top stories from Guardian Australia every morning\n A Facebook spokesperson said: “We clearly label messages that have been forwarded to help people know they’ve received something that was unlikely to have been written by friends or family. We also set limits on how messages can be forwarded to limit the spread of rumours. We encourage people to check the accuracy of messages they’ve received through authoritative sources, such as the helpline we’ve created with the Australian government that includes the latest and most accurate information about Covid-19.”\n Misinformation being circulated through group chats on WhatsApp has been an ongoing issue throughout the pandemic, not just in Australia but around the world.\n In Victoria’s second lockdown, messages circulated through WhatsApp falsely claimed that the state treasurer, Tim Pallas,  was going to replace the premier, Daniel Andrews, to bring an end to the lockdown.\n Last year the company introduced new rules to limit the spread of misinformation, including icons to note when a message is frequently forwarded and did not originate from a close contact. There is also a limit so these messages can only be sent one chat at a time.\n  WhatsApp has said this resulted in a 70% reduction in the number of highly forwarded messages on the app.\n The head of WhatsApp, Will Cathcart, told an Australian Strategic Policy Institute briefing earlier this month that part of the difficulty in combatting misinformation being spread over a private messaging service like WhatsApp is that the company doesn’t have access to the messages being sent.\n But he said WhatsApp was partnering with fact-checking services and embarking on public education campaigns about whether people should question rumours before they’re shared. He said in countries like Brazil it had been having an impact.\n App:  download the free app and never miss the biggest stories, or  get our weekend edition for a curated selection of the week&#39;s best stories\n  Podcast: listen to our daily episodes on  Apple Podcasts,  Spotify or search  &#34;Full Story&#34; in your favourite app\n “I would never say we’ve achieved 100% success and I would never promise that that will continue forever, because this is an adversarial space, but if you look at the more recent elections in places like Brazil, I think there’s been a huge change in people’s estimate of what WhatsApp’s role was in the information environment compared to what it was years before,” he said.\n He said WhatsApp was also getting better at detecting fake accounts being created to spread misinformation.\n “We’ve over the last few years significantly ramped up our capability to detect cases where people are creating lots of fake or inauthentic accounts and automatically ban them,” he said. “We now ban millions of accounts a month, proactively, and that’s had a huge shift in the ability for people to go and set up a kind of an information farm and pump out information and try to do that over messaging.”", "posttime": "2021-07-24 20:23:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,whatsapp,forced", "title": "在悉尼封锁期间 Facebook 被迫限制通过 WhatsApp 传播的错误信息", "title_en": "Facebook forced to limit misinformation spread via WhatsApp amid Sydney lockdown", "transed": 1, "url": "https://www.theguardian.com/australia-news/2021/jul/24/facebook-forced-to-limit-sydney-lockdown-misinformation-spread-via-whatsapp", "via": "", "real_tags": ["facebook", "whatsapp", "forced"]}, {"category": "", "categoryclass": "", "imagename": "71ee1807d809fac5b64e59d51b513f0b.jpg", "infoid": 1069445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple 和 Roku 知道流媒体设备的遥控器很重要。这就是为什么他们最近签署了一项协议，即将在 Roku 遥控器上安装 Apple TV+ 按钮。这也是为什么他们以重新设计的遥控器的形式对各自的流媒体设备进行了一些深思熟虑的升级。两家公司都专注于通过遥控器提高可用性和添加功能，而不是重新调整流媒体本身。 Apple 的新 Siri Remote 和 Roku 的 Voice Remote Pro 是现有用户可以购买的新设备，以使他们的流媒体体验不那么令人沮丧（在 Apple 的情况下）或更轻松且功能更丰富（在 Roku 的情况下）。对于苹果来说，重新设计早就该进行了。自五年多前第一次也是唯一一次重新设计以来，Apple TV 遥控器一直是噩梦。 Roku 的遥控器从未遇到过这种过度设计的问题——相反，它们遇到了相反的问题，经常感觉空洞和廉价，同时缺少一些有用的功能，除了最高端的 Roku 播放器。现在，这些遥控器彼此之间没有直接竞争。在一些关键领域，比如价格和广泛的支持，他们控制的流媒体都落后于最新的谷歌 Chromecast——我们发现这种设备不仅比这些更受欢迎，而且比亚马逊的 Fire TV 平台更受欢迎。但是对于已经在使用 Apple 或 Roku 流媒体选项的任何人来说，完全报废这些设备可能会浪费大量金钱，并且会造成普遍的痛苦，具体取决于他们的设置。但是，添加这些新遥控器之一将显着改善体验。 （Ars Technica 可能会通过附属计划从这篇文章的链接中获得销售补偿。）Apple 的第一代 Siri 遥控器太薄太光滑，由铝和玻璃制成。它的触控板是您无法避免的雷区。这种令人焦虑的设计在 Apple TV 上存在了六年之久，但现在已经完全重新设计。与第一代遥控器的铝制机身相比，新款 Siri 遥控器略有加强，以获得更好的抓地力和手感。遥控器握在手中的重量更令人满意，而且它的厚度和方形足以避免在您按下按钮时感觉可能会掉下来。如果/当确实发生跌落时，更坚固的构建质量也应该更好，尤其是与上一代的铝和玻璃设计相比。不过，新设计确实包含了上一个 Siri Remote 中引入的一些触摸元素。值得庆幸的是，它不像以前那样敏感（咳咳）。这主要是由于触摸区域的占地面积较小。触摸灵敏度并没有占据遥控器机身的三分之一，而是仅限于中心按钮本身，它也是凹面的。这意味着在伸手或抓住遥控器时意外滑动触摸控件要困难得多。此外，您可以完全禁用触摸，或者像上一代一样，也可以调整触摸灵敏度。无论您是否启用了触摸控制，您都可以使用回车按钮周围的方向箭头来完全导航，就像早期的 Apple TV 用户所喜欢的那样。这两者的混合是可用性的完美最佳点。当我想要更精确时，仍然能够轻弹标题，但也可以单击按钮，这很有趣。触摸板现在只在我想要的时候做出反应，并且它可以顺利地通过媒体播放进行选择或擦洗。\n右上角还有一个新的电源按钮，您可以按住该按钮关闭 Apple TV 和与 Siri Remote 配对的任何其他红外设备。通过 Apple TV 的远程学习功能将我的旧 Polk Surroundbar 5000 与 Apple TV 配对很容易，尽管我无法以同样的方式将我的第一代 Beats by Dre Beatbox 配对。 Polk 和 Beatbox 遥控器都使用直接视线 IR，所以这有点出乎意料。我确实意识到我们在谈论控制一个已经停产了十年的设备，但它仍然发出一些严重的声音，好吗？不过，使用最新的 Siri Remote 控制相对较新的条形音箱或电视应该不会有任何问题。 Siri 激活按钮也移到了遥控器的一侧，我最初将它误认为是音量摇杆，因为这是 Roku 和 Google 流媒体遥控器上的音量控制位置。我更喜欢后者的位置。 “嘿 Siri”语音激活可以改善任何潜在的尴尬，但 Siri 的实际功能在新遥控器上没有改变，所以仍然有点缺乏。这似乎是添加此类支持的好时机，但就目前而言，使用离我最近的 iOS 设备来处理命令很容易。 Siri Remote 的电池寿命似乎很长，因为我已经连续四个星期每天使用它大约一个小时的电视时间，并且在撰写本文时还有 60% 的电池电量。苹果表示，新的 Siri Remote 可与两代 Apple TV 4K 流媒体以及 Apple TV HD 配合使用。 （Ars Technica 可能会通过附属程序从这篇文章的链接中获得销售补偿。）Roku 的遥控器在不同设备之间都略有不同，无论是电视、流媒体棒还是其他设备，但 Voice Remote Pro 是该公司的最佳迭代几乎以各种方式发布。与其他人相比，我唯一能给出的就是它包含了一个 Sling TV 按钮，它被 Roku 的 Express 4K+ 遥控器上的 Apple TV+ 快捷方式明智地取代。 Roku 表示，这一变化也将在 Voice Remote Pro 的未来生产中进行，因为两家公司最近同意在 Roku 的所有遥控器上继续进行这一变化。最后，这没什么大不了的，因为还有两个可编程按钮，您可以轻松映射到应用程序或常用功能来改善这一点。根据您的 Roku 设备，您可能缺少 Voice Remote Pro 的以下任何按钮和功能： 可充电电池，不幸的是通过古老的 microUSB 标准充电（包括一根电缆，但请继续）\n两个可编程按钮，可作为应用程序或常用命令的快捷方式，例如切换 HDMI 输入 即使您拥有 Roku 的顶级设备，例如 Roku Ultra 或 Streambar Pro，选择 Voice Remote pro 也会添加免提“Hey Roku”命令和超出当前遥控器功能的 USB 充电。它还将以令人愉悦但并非完全必要的方式加强遥控器的占用空间 Roku 的所有遥控器均由塑料制成，感觉有点轻巧和中空。我在 2020 年购买的 TCL Roku 电视随附的那个感觉最便宜、最轻、最重，而常规语音遥控器（随 Express 4K+ 和其他几款 Roku 设备提供）和 Voice Remote Pro两者都感觉更稳固和平衡。 Pro 是最厚的，但这对好坏几乎没有影响。从不同的塑料质地到整体重量和平衡，两者在各个方面都感觉优于我的 Roku 电视的遥控器。功能是您想要升级的主要原因，而不是手感如何。在这个区域，一切顺利，一出大门就按预期进行。将遥控器插入电源使我的直接进入配对模式。进入相应的电视菜单后，只需按一下按钮即可将其连接到我的电视。将一副耳机插入遥控器也可以立即工作。至于音量，它的音量确实足以淹没人们的谈话，不同风格的耳机也可以提供帮助。不幸的是，它与蓝牙耳机不兼容，所以你必须使用像遥控器一样的有线耳机。 “Hey Roku”效果很好，禁用它的开关也是如此，通过快捷按钮保存命令只需要在执行操作后长按即可。对于基本命令和功能，这一切都完全按照您的意愿工作，但正如我们在 Roku、Chromecast 和亚马逊的 Fire Stick 之间的比较中所指出的，这并不总是搜索内容的最佳方式。当然，如果您目前拥有 Roku，那么您可能熟悉如何最好地搜索内容，而 Voice Remote Pro 不会改变这一点。如果您以前没有它，那么远程查找器是您可能会喜欢的一项功能，并且确实应该成为所有像这样的小型流媒体遥控器的标准配置。还有一些选项可以将声音更改为更清晰或更喧闹的音调。无论您的偏好如何，只要您的电视不发出刺耳的声音，它的音量就足以让您在一个房间或隔壁房间都能听到。就电池寿命而言，我已经对这款遥控器进行了大约四个星期的测试，原始充电后剩余电量为 80%。不过，它并没有得到大量使用，主要只是为了切换来源或排队观看，因此您的里程可能会有所不同。无论如何，跳过为另一台设备储存电池是一个很好的好处。\n在兼容性方面，Roku 表示 Voice Remote Pro 将适用于“所有 Roku 电视型号、Roku 音频播放器和大多数 Roku 播放器”，包括 Roku Express、Roku Express +、Roku Streaming Stick、Roku Streaming Stick+、Roku Ultra、 Roku Ultra LT、Roku SE、Roku 2、Roku 3、Roku Premiere、Roku Premiere+ 和 Roku 4。但是，该公司指出，一些较旧的 Express 和 Express+ 可能无法使用。当谈到尖端的、功能丰富的流媒体体验时，这些遥控器在多大程度上推动了这一类别的发展？不多。但它们会让 Apple TV 和 Roku 顽固分子的生活变得更好吗？无疑。简而言之，这些升级后的遥控器都没有使各自的流媒体平台价值更高，或者通常比 Google Chromecast 和 Google TV 更好，这是我们目前在媒体流媒体中的通用选择。对于大多数人来说，50 美元的 Chromecast 将通过其广泛的设备兼容性、卓越的搜索功能，以及最重要的是，其提供相关且多样化的手表建议的无与伦比的能力提供整体更好的体验。不过，如果您已经拥有一台不打算更换的 Apple TV，并且您愿意多付一点钱来消除“不要碰遥控器！”的问题。流媒体焦虑，升级到新的 Siri Remote 将成功做到这一点。至于 Roku 的 Voice Remote Pro，30 美元非常接近全新 Google Chromecast 的 50 美元价格（它本身可以与任何 Roku 电视配合使用）。但是，如果您已经使用 Roku 流媒体整理床铺并希望从中获得更多收益，那么您可以通过获得一个更难丢失、不需要电池并增加私人聆听和双手的遥控器来帮自己一个忙-免费语音控制您的电视。", "note_en": "Apple and Roku know that remotes for streaming devices are important. It’s why they recently  inked a deal to put an Apple TV+ button on Roku remotes going forward. It’s also why they’ve made  some thoughtful upgrades to their respective streaming devices in the form of  redesigned remotes. Both companies are focused on improving usability and adding features via the remote, rather than retooling the streamers themselves.\n Apple&#39;s new Siri Remote and  Roku&#39;s Voice Remote Pro are new devices that existing users can buy to make their streaming experiences much less frustrating (in Apple&#39;s case) or easier and more feature-rich (in Roku&#39;s). For Apple, a redesign was long overdue. Apple TV remotes have been  the stuff of nightmares since the first and only redesign over half a decade ago. Roku’s remotes never had that sort of over-engineering problem—instead, they&#39;ve suffered from the opposite issue, often feeling hollow and cheap while missing some useful functions on all but the highest-end Roku players.\n  Now, these remotes aren’t in direct competition with one another. And in some key areas like price and wide-ranging support, the streamers they control both fall behind the  latest Google Chromecast—a device  we found preferable not just to those, but to Amazon&#39;s Fire TV platform as well. But for anyone who’s already using a streaming option from Apple or Roku, scrapping those devices entirely could be a significant waste of money and a general pain depending on their setup. Adding one of these new remotes, though, will improve the experience appreciably.   (Ars Technica may earn compensation for sales from links on this post through  affiliate programs.)\n Apple&#39;s first-generation Siri remote was too thin and slick, being made of aluminum and glass. Its touchy trackpad was a minefield you couldn’t avoid. That anxiety-inducing design stuck around the Apple TV for six long years, but it&#39;s now been totally redesigned.\n  Compared to the first-generation remote&#39;s aluminum body, the new Siri remote has been slightly beefed up for a better grip and feel. The remote has a more satisfying heft in the hand, and it’s thick and square enough to avoid feeling like you might drop it when you go to press a button. The more robust build quality should also fare better if/when drops do occur, especially compared to the aluminum and glass design of the previous generation.\n The new design does incorporate some touch elements introduced in the last Siri Remote, though. Thankfully, it’s not as touchy (ahem) as before. That’s largely due to the smaller footprint of the touch area. Instead of taking up a third of the remote’s body, touch sensitivity is confined only to the center button itself, which is also concave. That means it’s much harder to accidentally swipe the touch controls while reaching for or grasping the remote. Furthermore, you can disable touch entirely or, like the previous generation, adjust the touch sensitivity as well.\n Whether you have touch control enabled or not, you can use the directional arrows surrounding the enter button to navigate entirely, as early Apple TV adopters used to enjoy. The mixture of these two is the perfect sweet spot for usability. It’s fun to still be able to flick through titles but also click buttons when I want more precision. The touchpad now reacts only when I want it to, and it works smoothly for selection or scrubbing through media playback.\n    There’s also a new power button in the top right corner which you can hold down to power off your Apple TV and any other IR devices you’ve paired with the Siri Remote. Pairing up my older  Polk Surroundbar 5000 with the Apple TV via the latter’s remote learning function was easy enough, though I couldn’t pair my first-generation  Beats by Dre Beatbox in the same way.\n  Both the Polk and Beatbox remotes use direct line of sight IR, so that was a somewhat unexpected bummer. I do realize we’re talking about controlling a device that has been discontinued for the better part of a decade now, but it still cranks some serious sound, OK? You shouldn’t have any issues controlling relatively new soundbars or TVs with the latest Siri Remote, though.\n  The Siri activation button has also been moved to the side of the remote, where I initially mistook it for a volume rocker, as this is the volume control placement on both Roku&#39;s and Google&#39;s streaming remotes. I’d prefer the latter placement. “Hey Siri” voice activation  could ameliorate any potential awkwardness, but Siri’s actual functionality is unchanged with the new remote, so that&#39;s still a bit lacking. This seemed like a good time to add such support but, for now, it’s easy enough to settle for my nearest iOS device handling the command instead. Battery life on the Siri Remote seems strong, as I&#39;ve been using it for about an hour of TV time a day for four weeks and have 60% of the battery leftover at the time of this writing. Apple says the new Siri Remote works with both generations of Apple TV 4K streamers as well as the Apple TV HD.\n   (Ars Technica may earn compensation for sales from links on this post through  affiliate programs.)\nRoku’s remotes all vary slightly from device to device, be it a TV, streaming stick, or otherwise, but the Voice Remote Pro is the best iteration the company has released in nearly every way. Compared to the others, the only knock I can give is its inclusion of a Sling TV button, which is sensibly replaced by an Apple TV+ shortcut on  Roku’s Express 4K+ remote. Roku says this change will also be made in future production of the Voice Remote Pro, as the two companies recently agreed to keep this change going forward on all of Roku&#39;s remotes. In the end, it’s not a  huge deal, as there are also two programmable buttons you can easily map to apps or common functions to ameliorate this.\n Depending on your Roku device, you could be missing any of the following buttons and features of the Voice Remote Pro:\n A rechargeable battery, unfortunately charged via the ancient microUSB standard (a cable is included, but  come on)\n  Two programmable buttons that can act as shortcuts to apps or commonly used commands, like switching the HDMI input\n Even if you have Roku’s top-of-the-line devices, like the  Roku Ultra or  Streambar Pro, picking up a Voice Remote pro will add hands-free “Hey Roku” commands and USB charging beyond your current remote’s features. It’ll also beef up the remote’s footprint in a pleasing albeit not totally necessary way\n All of Roku’s remotes are made of plastic and feel a bit light and hollow. The one that came with my TCL Roku TV, bought in 2020, feels the cheapest, lightest, and most bottom-heavy, while the regular voice remote (which comes with the Express 4K+ and a couple of other Roku devices) and Voice Remote Pro both feel more solid and balanced. The Pro is the thickest, but that made very little difference for better or for worse. Both feel superior to my Roku TV’s remote in every way, from different plastic textures to the overall weight and balance.\n    Features are the main reason you’ll want to upgrade, not how it feels in hand. In this area, all works smoothly and as intended right out of the gate. Plugging in the remote to a power source put mine directly into pairing mode. Once I was in the appropriate TV menu, connecting it to my TV was done with a push of a button.\n Plugging in a pair of headphones to the remote works immediately, too. As for volume, it does get loud enough to drown out people talking, and different style headphones can help with that as well. Unfortunately, there’s no compatibility with Bluetooth headphones, so you will have to use a wired set like those that come with the remote.\n     “Hey Roku” works well, as does the switch to disable it, and saving a command via the shortcut button only requires a long press after the action is executed. For basic commands and functions, this all works exactly as you’d like, but as noted in our comparison between Roku, Chromecast, and Amazon’s Fire Stick, it’s not always the best way to search for content. Of course, if you have a Roku currently, then you’re likely familiar with how best to search for content and the Voice Remote Pro won’t be changing that. If you didn’t have it before, the remote finder is a feature you may appreciate and something that really should be standard for all tiny streaming remotes like this. There are options to change the sound to sharper or more boisterous tones, as well. Whatever your preference, it gets loud enough to hear in a room or the next room over, as long as your TV isn’t blaring.\n As far as battery life goes, I’ve been testing this remote for about four weeks and have 80% battery left from the original charge. It’s not getting a ton of use though, mostly just to switch sources or queue something up to watch, so your mileage may vary. Regardless, it’s a nice perk to skip stocking batteries for one more device.\n In terms of compatibility,  Roku says the Voice Remote Pro will work with &#34;all Roku TV models, Roku audio players, and most Roku players,&#34; including the Roku Express, Roku Express +, Roku Streaming Stick, Roku Streaming Stick+, Roku Ultra, Roku Ultra LT, Roku SE, Roku 2, Roku 3, Roku Premiere, Roku Premiere+, and Roku 4. The company notes that some older Express and Express+ may not work, however.\n  When it comes to cutting-edge, feature-rich streaming experiences, how much do these remotes push the category forward? Not much. But do they make Apple TV and Roku die-hards’ lives better? Undoubtedly.\n In short, neither of these upgraded remotes make their respective streaming platforms higher-valued or generally better picks over the Google Chromecast with Google TV, our current general-purpose pick among media streamers. For most people, the  $50 Chromecast will deliver an overall better experience with its wide device compatibility, superior search functionality, and, most importantly, its unmatched ability to serve up relevant and varied watch suggestions.\n Still, if you already have an Apple TV that you don’t plan to replace, and you&#39;re willing to pay a bit more to eliminate that “don’t touch the remote!” streaming anxiety, upgrading to the new Siri Remote will successfully do that. As for Roku’s Voice Remote Pro, $30 is awfully close to the $50 price of a brand-new Google Chromecast (which itself would work with any Roku TV). But if you’ve already made your bed with a Roku streamer and want more out of it, you&#39;ll be doing yourself a favor by getting a remote that’s harder to lose, doesn’t require batteries, and adds private listening and hands-free voice control to your TV.", "posttime": "2021-07-24 19:50:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,流媒体,roku,遥控器", "title": "Apple 和 Roku 新升级了流媒体遥控器——它们值得购买吗？", "title_en": "Apple and Roku have newly upgraded streaming remotes—are they worth buying?", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/new-apple-siri-remote-review-roku-voice-remote/", "via": "", "real_tags": ["apple", "流媒体", "roku", "遥控器"]}, {"category": "", "categoryclass": "", "imagename": "9ad1f01f0e4058061637f4fcf829e915.png", "infoid": 1069443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是关于所有非管理员用户如何在各种版本的 Windows 10 上读取注册表——从而提升权限和访问敏感凭据信息的故事。这个漏洞似乎已经存在多年，但没有人注意到。在这篇文章中，我做了一个漏洞利用来测试它。最近，乔纳斯在推特上发布了一些有趣的东西。乔纳斯当时没有意识到的是，当系统保护又名影子卷被启用时，Windows 10 也有相同的行为，这应该是大多数情况下的默认设置。它不应该。这打破了安全屏障，因为 SAM 是一个敏感的注册表配置单元，而 BUILTIN\\Users 包括非管理员。该文件夹还有其他敏感的注册表配置单元——例如 SYSTEM、SECURITY 等——BUILTIN\\Users 可以访问它们。通常您无法访问正在使用的 SAM（或其他注册表配置单元文件）。为了解决这个问题，我使用 CreateFile 来访问 VSC 快照的设备路径——在恢复情况下使用——以一种稍微有点古怪的方式：运行时，它会在工作文件夹中创建 SAM、SECURITY 和 SYSTEM 文件的副本，可供访问已登录的非管理员用户。这是一个关于如何使用我的漏洞在端点上以 SYSTEM 身份远程执行代码的视频：\n微软在他们的安全指南中提供了缓解措施：安全更新指南——加载——微软这是一个 PowerShell 脚本，可以通过 SCCM 部署，以修复 ACL 并删除 VSC：您的 EDR 工具应该具有查找 SAM 文件的逻辑访问，值得向您的 EDR 供应商询问确认和检测名称。过去 3 年的所有 Windows 10 版本。 US-CERT 将问题从 2018 年开始。微软的 MSRC 公告称自 1809 年以来的所有 Windows 10 版本。值得注意的一件事，当你执行某些操作时，它会创建一个系统恢复点（例如，在我的游戏中安装 7-zip PC）这似乎是一个因素。与所有安全事务一样，不要惊慌。这只是另一个漏洞。还有一个出色的未打补丁的 Print Spooler 零日。我的看法 - 要求您的 EDR 供应商进行检测、冷静并继续抗争。\n此外，是的，微软确实需要考虑在 MSRC 和 Windows 操作系统工程方面的资源。微软不能一边看着自己的产品烧毁，一边吹嘘自己是一家价值 100 亿美元的安全公司。我的意思是，他们可以——但他们不应该。", "note_en": "This is the story of how all non-admin users can read the registry — and so elevate privileges and access sensitive credential information — on various flavours of Windows 10. It appears this vulnerability has existed for years, and nobody noticed. In this post I made an exploit to test it.\n  Recently, Jonas tweeted something interesting. What Jonas didn’t realise at the time is Windows 10 also has the same behavior when System Protection aka Shadow Volumes is enabled, which should be the default in a majority of cases.\n   It shouldn’t. That breaks a security barrier, as the SAM is a sensitive registry hive, and BUILTIN\\Users include non-administrators.\n That folder also has other sensitive registry hives — for example SYSTEM, SECURITY etc — which BUILTIN\\Users can access.\n   Normally you cannot access the SAM (or other registry hive files) as they’re in use. To get around this, I used CreateFile to access the device path to the VSC snapshot — used in recovery situations — in a slightly hacky way:\n     When run, it creates a copy of SAM, SECURITY and SYSTEM files in the working folder, accessible to the logged in, non-admin user.\n  Here’s a video of how to use my exploit to reach remote code execution as SYSTEM on endpoints:\n   Microsoft have provided mitigations in their security guide:  Security Update Guide — Loading — Microsoft\n  Here is a PowerShell script, which can be deployed via SCCM, to fix the ACL and remove the VSC:\n     Your EDR tools should have logic to look for SAM files being accessed, it it worth asking your EDR vendors for confirmation and detection names.\n          All Windows 10 releases through the last 3 years. US-CERT  pen the issue as starting in 2018. Microsoft’s MSRC advisory says all Windows 10 versions since 1809.\n One thing of note, when you do certain actions it creates a system recovery point (for example, installing 7-zip did on my gaming PC) which appears to play a factor.\n    As with all things security, don’t panic. It’s just another vulnerability. There’s also still an outstanding an unpatched Print Spooler zero day.\n   My take — ask your EDR vendors for detection, chill, and keep up the fight.\n Also, yes, Microsoft really need to look at resourcing on MSRC and Windows OS engineering. Microsoft can’t boast about being a $10bn security company while watching their own products burn down. I mean, they can — but they shouldn’t.", "posttime": "2021-07-24 19:46:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows-10,windows,又名,read,访问", "title": "HiveNightmare 又名 SeriousSAM – 任何人都可以读取 Windows 10 中的注册表", "title_en": "HiveNightmare a.k.a. SeriousSAM – anybody can read the registry in Windows 10", "transed": 1, "url": "https://doublepulsar.com/hivenightmare-aka-serioussam-anybody-can-read-the-registry-in-windows-10-7a871c465fa5", "via": "", "real_tags": ["windows", "又名", "read", "访问"]}, {"category": "", "categoryclass": "", "imagename": "e2cb2157a753b8dcfd3ff8fcad19a6e8.jpg", "infoid": 1069442, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东京奥运会开幕前十天，美国女篮3x3篮球队主教练卡拉·劳森召开新闻发布会。这项运动是今年奥运会的新项目，前 WNBA 球员兼杜克大学教练劳森告诉十几位在线参与的记者她喜欢这项运动，劳森说，这项运动节奏更快，而且更难以预测。比五对五的版本。但在全球大流行期间，劳森补充说，她的球员的健康是她的第一要务。 “我们显然每天都接受测试。我现在实际上被隔离在我的房间里，”劳森说。 “我们一直戴着面具……对于任何准备前往东京的球队来说，在这个时刻进行阳性测试都很难。我们专注于尽自己的一份力量，不仅是为了我们可以有一个良好的竞争，而且我们绝对感到对人类同胞有责任明智地消除全球疾病的传播。”不到一周后，劳森的一名球员——西雅图风暴队的大前锋凯蒂·卢·萨缪尔森——在 Instagram 上宣布，她的 Covid-19 检测呈阳性，无法前往东京。快节奏，也许，但并非完全不可预测。随着 2020 年东京奥运会的举行，萨缪尔森是在东京参加奥运会或希望参加奥运会的 91 人之一，他们的疾病检测呈阳性，其中包括美国网球运动员可可·高夫、捷克沙滩排球运动员、两名南非洲足球运动员等等。 “奥林匹克主义”的精神应该是为了避免世俗的担忧。启示录的骑手可能会跟踪全球，但不允许他们进入奥运村。战争被推迟，饥荒在食堂枯萎，瘟疫……好吧。全球大流行已经造成至少 400 万人死亡，并导致了一场非常奇怪的夏季奥运会——没有欢呼的人群，运动员在没有更快、更高或更强的情况下基本上被限制在宿舍里——所有这些都是为了防止这种疾病的发生在参赛者之间和日本人民之间传播，并防止奥运选手将新的病毒株带回他们的祖国。奥运会是地球上国际合作的伟大象征之一，但今年的奥运会也是一个世纪以来最严重的流行病中的一次大规模集会，来自地球上几乎每个国家的人们将聚集在一个巨大的聚集生活环境中，参加一些近距离接触的运动，有时是在室内。可能会发生什么——疾病的故事也是群众集会的故事。 1867 年，世界上最大的宗教聚会印度大壶节爆发了霍乱。它从恒河沿岸传播到俄罗斯和欧洲。一百万人死亡。多年来，朝觐一直是一系列呼吸道疾病爆发的场所，包括流感和导致 Covid-19 之前的冠状病毒。 2014 年，斯洛文尼亚国际犬展和迪士尼乐园爆发了麻疹疫情。但奥运会总体上设法避免了大规模的传染病爆发，即使它发生在重大疾病恐慌期间。 2010 年温哥华冬奥会 H1N1 流感没有伤害，2012 年 SARS 和 MERS 都没有在伦敦传播，寨卡病毒没有在 2016 年从里约传播。然而，“如果人们在奥运会上生病怎么办？”是前三名的奥运故事子类型。 （另外两个是“这位运动员因个人原因被迫取得成功”和“奥运运动员彼此发生性关系。”）2020 年初，在大流行中，然后才刚刚开始膨胀成指数级海啸，国际奥委会和东京组织者推迟了奥运会。一个由来自公共卫生、旅游医学、经济学、行为科学甚至主题公园设计的专家组成的咨询小组在间隔年中制定了一个计划。负责人是 2012 年伦敦奥运会公共卫生措施取得成功的主要负责人，他是一位名叫布赖恩·麦克洛斯基的公共卫生和群众集会专家。 “从本质上讲，公共卫生对任何事件的反应都是一样的。这是关于你如何确定风险将是什么以及你如何处理它们，”麦克洛斯基告诉我。 “这里的区别在于规模之大，这是我们以前从未见过的。”主办方在 3 月份对游客关闭奥运会之前，他们预计将有 2000 万人来到东京。那可能不会很好。奥运会是一头奇怪的野兽。即使致命疾病的威胁迫在眉睫，所有利益相关者都非常有动力确保节目继续进行。东道国的旅游业有望获得意外收获，报道奥运会的媒体组织也是如此。众所周知，奥委会充满了与所有相关企业有着良好关系的喷气式飞机。与职业运动不同，错过几场比赛可能无关紧要，奥林匹克运动员和教练每四年才获得一次机会——因此他们可能会容忍感染控制措施的松懈。\n尽管如此，没有人希望任何人生病。该咨询小组确定，人们在 Covid 疫苗到来之前所依赖的基本公共卫生措施仍然有效。事实上，洗手、戴口罩、避开人群和通风不良的空间等措施在日本已经很有效了。 “我们所做的是在英国的一些学习基础上进行叠加，在那里没有测试和跟踪系统是一个弱点，”麦克洛斯基说。你会记得大流行初期的这一点，当时美国和欧洲在这方面大多失败了：对所有人进行 Covid 测试，追踪阳性者的接触者，并隔离他们以防止一个人感染成为超级传播事件。这将是东京的做法，同时减少奥运村的人数，改善那些公寓的通风系统，并添加“额外过滤”和有机玻璃防护罩（这可能没有任何作用，但可以) 在公共区域。而且“总的来说，国际社会和当地日本人之间没有混杂，”麦克洛斯基说。 “他们不会在东京的地铁里出去。”组织者考虑过要求接种疫苗，但最终决定不接种。 “我们相当肯定会有一种疫苗可用，但我们同样肯定它不会在世界各地同样可用，”麦克洛斯基说。 “这违背了举办奥运会的整体精神。我们也不希望运动员与医护人员和当地居民争夺疫苗。”在奥运会开幕前几天的新闻发布会上，麦克洛斯基将这个系统——为参赛者编入“剧本”——描述为多层过滤之一。运动员在离开祖国之前都会接受测试，并且在比赛前每天都会再次接受测试。他们会遵守社交距离规则，即 2020 年的非药物干预。如果有人检测结果呈阳性，他们将接受多种测试，包括高度准确的鼻咽 PCR 测试，以了解他们的病毒载量有多高，并帮助确定他们可能接触过的人的风险水平。 （病毒越多，危害越大。）奥运工作人员会追踪他们的接触者，部分使用团队事先填写的表格，说明谁与谁关系密切。疫苗，如果运动员得到它们，将是一个奖励层。至于那些已经测试呈阳性的奥运选手，麦克洛斯基说这并不构成系统的故障。恰恰相反——每一个都代表了一个更具传染性的时间线的截断。 “我们所看到的基本上就是我们所期望看到的，”麦克洛斯基在开幕式前一周的 7 月 19 日在东京举行的新闻发布会上对记者说。 “如果我认为我们所做的所有测试都是阴性的，我就不会费心去做这些测试了。”嘿，大约 15,000 名参赛者和数万名记者和其他奥运工作人员中的 91 例阳性，还不错吧？对于一些疾病专家和运动员倡导者来说，答案是：事实上，这很糟糕——因为它是关于准备工作的，以及接下来可能会发生什么。至少这是一些科学家和专家一直在说的。设计日本抗新冠病毒战略的病毒学家大谷仁告诉伦敦时报，他认为举办一场安全的奥运会是不可能的。 “有许多国家没有很多病例，还有一些国家没有任何变种，”Oshitani 告诉《泰晤士报》。 “我们不应该让奥运会成为将病毒传播到这些国家的机会。在美国和英国，人们接种疫苗的风险不大。但世界上大多数国家都没有疫苗。”麦克洛斯基估计，大约 85% 来东京的人会接种疫苗。但只有大约 22% 的日本人是这样。这是所有富裕国家中最低的比率之一。结合日本相对较低的病例数，这意味着大多数人口还没有对该病毒的抗体。他们就是流行病学家所说的“幼稚”。这意味着，正如陈词滥调，日本可能是其自身成功的受害者。 “显然，举办这些奥运会具有很高的价值，”洛克菲勒基金会大流行预防研究所病原体监测常务董事塞缪尔·斯卡皮诺说。 “因为在一个基本上没有疫苗接种且人口中基本上没有免疫力的国家内，将人们聚集在一个聚集的环境中当然是有风险的。”\nCovid-19 的无症状、空气传播意味着测试必须非常频繁，至少每天一次，以便在感染他人之前发现病例。例如，美国国家橄榄球联盟和美国国家篮球协会的严格、成功的疾病控制措施使用了所有典型的卫生和疏远措施，以及严格的测试追踪隔离方案。 NFL 每天进行逆转录 PCR 测试，并为球员和工作人员提供记录密切接触者的单一用途电子设备；累计 15 分钟或更长时间被视为较高风险。随着时间的推移，NFL 通过密集的面对面采访来补充电子设备，以确定这些接触的性质。 （蒙面？室内？吃饭的时候？） “NBA 所做的——或者我去年建议的女子篮球——是设计和拉出一个泡沫。一旦你参与进来，你就不会出局，”山的人口健康科学和政策教授安妮斯帕罗说。西奈医学院。 “你不可能在奥运会上制造泡沫。只是无法以这种规模完成。” 7 月初，Sparrow 和其他一些美国研究人员在《新英格兰医学杂志》上发表了一篇评论，表达了 Oshitani 所做的许多相同的担忧。他们走得更远，警告说麦克洛斯基的小组提出的策略是基于有关病毒动态的过时信息。反过来，那篇文章回应了世界运动员协会的批评，世界运动员协会是一个与世界各地运动员工会合作的国际组织。 WPA 辩称——尽管没有得到国际奥委会的回应，但收效甚微——规则认为橄榄球场上的接触与个人体操或户外跑道上的接触相同。 WPA 代表批评了共享房间的情况和剧本中关于偶尔开窗通风的建议，这在东京的酷暑中实际上可能是不切实际的。该计划也很糟糕：允许使用不同类型的口罩和个人防护设备，使用手机应用程序进行联系人追踪而不是专用技术，以及 WPA 代表所说的一系列其他不太出色的干预措施只是在自找麻烦。 WPA 法律和球员关系主管马修格雷厄姆说：“就 Covid 而言，永远不会有零风险，但肯定可以采取更多缓解措施。” “我们，就像我们所代表的运动员一样，希望这可以安全地完成，但不应该为此节省任何费用。”麦克洛斯基则坚持认为，他的团队采取的措施将尽可能保证村庄、奥运会和日本的安全。 “作为一般原则，我认为如果我没有受到批评，我就没有做好我的工作，”他说。如果一些运动员生病而无法参加比赛——那是可悲的，但这不是经济或流行病的灾难。但历史上最昂贵的夏季奥运会（154 亿美元！）却没有主办城市的游客？好吧，未能兑现其组织者的经济和发展承诺的奥运会并不是什么新鲜事，尽管对此的实际研究很复杂。这场灾难，如果真的发生的话，从很小的地方开始——在一个被病毒感染的人类细胞内。流行病学家莎拉·科比说：“每当你把很多人聚集在一起时，就有可能发生大规模爆发——不仅是超级传播事件，还有多代传播，然后当人们回家时，感染就会传播。”芝加哥大学进化生物学家。 “所有这些传播不仅会促进新病例，还会促进适应，包括更合适的变种向新人群的移动。”换句话说，问题不仅仅是某人感染了其他人，甚至是很多其他人。这些潜在的奥运感染可能就像微生物入侵物种，因为它们可以前往新的人群，在那里他们可能比在家里更危险。 Covid-19 受到超级传播者事件的影响——许多人同时被感染的情况。 SARS-CoV-2 是导致 Covid-19 的病毒，它在过去 18 个月中不断进化和适应，其遗传密码发生了变化，使病毒更容易传播。这对于一个以制造更多自身为生存目标的病毒来说非常好。这对人类非常不利，因为它可能使病毒更容易感染其他人，无论是通过数量的力量，还是在感染细胞时在病毒学上更加狡猾，或者完全是其他某种机制。\n来自许多不同人群的大型聚会，几乎可以肯定携带不同版本的病毒，正是这种地方让超级传播者事件和新变种的交流更有可能。它可能——强调可能——甚至使新的、更糟糕的变种的开发和传播成为可能。 “就我个人而言，如果我负责日本奥运会，传播的风险对我来说太高了。也许他们的假设是，如果它确实溢出，他们可以再次控制它而不会冒流行病的风险，”斯卡皮诺说。 “我可能不同意这一点，但我认为，当我们开始讨论这对病毒的演变可能意味着什么时，我们在举办奥运会与 Covid 在日本本地传播的成本效益计算方面存在分歧本身。”这是最坏的最坏情况。 “在许多生态进化场景中，这不是传统的超级传播者事件，而是一个‘超级进化事件’，”斯卡皮诺说，“大量接种疫苗的个体正在选择传播性增加的变种在接种疫苗的个体中。”所有那些免疫状态不同、接触不同病毒株的人都可能对 Olympism 的国际合作进行可怕的基因模仿：就如何提高传染性、甚至可能更致命或更多疫苗的病毒思想进行自由和公开交流——回避。然后它会在无症状传播的掩护下返回每个人的祖国。概率尺度有两个极端。在这一点上，任何人都可以希望的最好结果是，随着筛查计划的实施，只有少数人会被感染或生病。一些奥运故事的结局很糟糕。这已经发生了——运动员和与他们一起工作的人被剥夺了在东京参加比赛的机会，因为检测表明他们被感染了。而在规模的另一端是一个超级进化事件，它允许开发一种更有效的病毒形式，然后将它放在数百架飞往地球各个角落的喷气式飞机上。对于想知道最有可能的结果是什么的每个人来说，这就像奥运会，只是以最可怕的方式可能：它是不可预测的。", "note_en": "Ten days before the opening ceremony of the Tokyo Olympics, Kara Lawson, the coach of the United States women’s 3x3 basketball team, gave a press conference. The sport is new to the Olympics this year, and Lawson, a former WNBA player and coach at Duke University, told the dozen or so reporters participating online what she liked about it—the game is faster-paced, Lawson said, and more unpredictable than the five-on-five version. But during a global pandemic, Lawson added, the health of her players was her number one priority. “We’re obviously tested daily. I’m actually quarantined in my room right now,” Lawson said. “We’re masked all the time … a positive test at this juncture is hard for any team getting ready to go to Tokyo. We’re focused on doing our part, not just so we can have a good competition, but we definitely feel a responsibility to fellow human beings to be smart about eliminating transmission of the disease worldwide.”\n Less than a week later, one of Lawson’s players—Katie Lou Samuelson, a power forward for the Seattle Storm— announced on Instagram that she had tested positive for Covid-19 and  wouldn’t be able to go to Tokyo. Fast-paced, maybe, but not exactly unpredictable. As the 2020 Tokyo Games get underway, Samuelson is one of  91 people either in Tokyo for the Olympics or who were hoping to go who’ve tested positive for the disease, including US tennis player Coco Gauf, a Czech beach volleyball player, two South African soccer players, and so on.\n The spirit of “Olympism” is supposed to ward off worldly concerns. The riders of the Apocalypse may stalk the globe, but they’re not allowed into an Olympic Village. War gets postponed, Famine withers in the dining hall, and Pestilence … well. The global pandemic has killed  at least 4 million people and resulted in a very strange Summer Games—no cheering crowds, athletes essentially confined to quarters when they’re not going faster, higher, or stronger—all in an attempt to prevent the disease from spreading among the competitors and to the people of Japan, and to keep the Olympians from carrying new strains of the virus back to their home countries. The Olympics are one of Earth’s great symbols of international cooperation, but this year the Games are also a mass gathering in the middle of the worst pandemic in a century, where people from nearly every country on Earth will gather in a vast congregate living setting and compete in some close-contact sports, sometimes indoors. What could possibly go wr—\n The story of disease is also a story of mass gatherings. In 1867, a  cholera outbreak started at the Kumbh Mela in India, the world’s largest religious gathering. It spread from the banks of the Ganges to Russia and Europe. A million people died. Over the years,  the Hajj pilgrimage has been the site of a bunch of respiratory disease outbreaks, including influenza and the coronaviruses that predate the one that causes Covid-19. In 2014 there were  measles outbreaks at the International Dog Show in Slovenia, and at Disneyland.\n But the Olympics has generally  managed to avoid big infectious disease outbreaks, even when it happened during big disease scares. H1N1 influenza didn’t hurt the 2010 Winter Games in Vancouver, neither SARS nor MERS spread through London in 2012, Zika didn’t spread from Rio in 2016. Yet nevertheless, “ What if people get sick at the Olympics?” is a top-three Olympic story subgenre. (The other two are “This athlete is driven to succeed for personal reasons” and “Olympic athletes have sex with each other.”)\n  In early 2020, amid a pandemic then just beginning to swell into an exponential tsunami, the International Olympic Committee and the Tokyo organizers postponed the Games. An advisory group composed of experts from public health, travel medicine, economics, behavioral science, and even theme park design spent the gap year coming up with a plan. The person in charge was the one who was largely responsible for the successful public health measures at the London Games in 2012, a public health and mass-gathering expert named Brian McCloskey. “Essentially, the public health response to any event is the same. It’s about how you determine what the risks will be and what you do about them,” McCloskey tells me. “The difference here is the sheer scale, which we haven’t seen before.” Before the organizers  closed the Games to travelers in March, they expected 20 million people to come to Tokyo. That probably wouldn’t have been great.\n The Olympics are a strange beast. Even with the threat of deadly disease looming, all the stakeholders are  highly incentivized to make sure the show goes on. The host country’s tourism industries stand to get a windfall, as do the media organizations covering the Games. Olympic committees are famously full of jet-setters with cozy relationships to all the businesses involved. And unlike, say, professional sports, where missing a couple games might not matter much, Olympic athletes and coaches get their shot only once every four years—so they might put up with a little looseness in infection control measures.\n    Still, nobody wants anyone to get sick. That advisory group determined that the basic public health measures people relied on before the arrival of Covid vaccines would still work. In fact, things like hand-washing, mask-wearing, and avoiding crowds and poorly ventilated spaces were already  working well in Japan. “What we did was to layer on top of that some of the learning from the UK, where not having a test-and-trace system was a weakness,” McCloskey says.\n You’ll remember this from the pandemic’s early days, when the US and Europe  mostly failed at it: Test everyone for Covid, trace the contacts of the people who are positive, and isolate them to keep one person’s infection from turning into a super-spreading event. That’d be the approach in Tokyo, along with reducing the number of people in the Olympic Village, improving the ventilation systems in those apartments, and adding “additional filtration” and plexiglass shields (which probably don’t really do anything, but OK) in the common areas. And “by and large there is no intermingling between the international community and the local Japanese population,” McCloskey says. “They don’t go out in the subway in Tokyo.”\n The organizers thought about requiring vaccination but ultimately decided against it. “We were fairly certain a vaccine would be available, but we were equally certain it would not be available equally around the world,” McCloskey says. “That’s against the whole spirit of doing the Games. We also didn’t want athletes competing for vaccines with health care workers and local populations.”\n At a press conference just a few days before the Games were set to open, McCloskey described the system—codified for the competitors into “playbooks”—as one of multiple layers of filtration. Athletes would get tested before they left their home countries and again every day before competition. They’d follow social distancing rules, the non-pharmaceutical interventions of 2020. And if someone pinged positive, they’d get multiple kinds of tests, including a highly accurate nasopharyngeal PCR test, to see how high their viral load was and help determine the level of risk to the people they might’ve exposed. (More virus equals more bad.) Olympic staff would track their contacts, in part using forms the teams would fill out beforehand of who was close to whom. Vaccines, if athletes got them, would be a bonus layer.\n As for the Olympic-bound folks already testing positive, McCloskey said that didn’t constitute a failure in the system. Quite the opposite—each one represented the cutting-off of a more infectious timeline that might have been. “What we’re seeing is what we expected to see, essentially,” McCloskey told reporters in Tokyo at a press conference on July 19, a week before the opening ceremony. “If I thought all the tests we did would be negative, I wouldn’t be bothering to do the tests.” Hey, 91 positive cases out of roughly 15,000 competitors and tens of thousands of reporters and other Olympic workers ain’t bad, right? For a few disease experts and athlete advocates, the answer is: That is, in fact, pretty bad—because of what it says about the preparations, and what might happen next.\n  At least that&#39;s what some scientists and experts have been saying. Hitoshi Oshitani, the virologist who  devised Japan’s anti-Covid strategy,  told  The Times of London that he didn’t think it was possible to have a safe Olympics. “There are a number of countries that do not have many cases, and a number that don’t have any variants,” Oshitani told  The Times. “We should not make the Olympics [an occasion] to spread the virus to these countries. There is not much risk to the US and UK, where people are vaccinated. But most countries in the world don’t have the vaccine.”\n McCloskey estimates about 85 percent of people coming to Tokyo will be vaccinated. But only about 22 percent of Japanese people are. That’s among the lowest rates of all wealthy countries. Combined with Japan’s relatively low case count, that means most of the population doesn’t yet have antibodies to the virus. They’re what epidemiologists call “naive.” Which means Japan might be, as the cliché goes, a victim of its own success. “Clearly there is a high value being placed on holding these Olympics,” says Samuel Scarpino, managing director for pathogen surveillance at the Rockefeller Foundation’s Pandemic Prevention Institute. “Because certainly it’s risky to bring people together in a congregate setting inside a country with essentially no vaccination and essentially no existing immunity in the population.”\n Covid-19’s asymptomatic, airborne spread means that testing has to be extremely frequent, at least once a day, to catch cases before they infect others. The strict, successful disease control measures of the  US National Football League and  National Basketball Association for example, used all the typical hygiene and distancing measures, plus a hardcore test-trace-isolate regimen. The NFL performed daily reverse-transcription PCR tests and gave players and staff single-purpose electronic devices that registered close contacts; a cumulative 15 minutes or more counted as a higher risk. Over time, the NFL supplemented the electronics with intense in-person interviews to determine the nature of those contacts. (Masked? Indoors? While eating?) “What the NBA did—or women’s basketball, which I advised last year—was to design and pull off a bubble. Once you’re in it, you’re not out,” says Annie Sparrow, a population health science and policy professor at Mt. Sinai Medical School. “There’s no way you can ever create a bubble at the Olympics. It just cannot be done at this scale.”\n    In early July, Sparrow and a bunch of other US researchers published a  commentary in  The New England Journal of Medicine expressing many of the same concerns Oshitani did. They went further, warning that the strategy McCloskey’s group had come up with was based on outdated information about the dynamics of the virus.\n That article, in turn, echoed criticisms leveled by the World Players Association, an international group that works with athletes’ unions around the world. The WPA has argued—to little effect, having gotten no response from the IOC—that the rules consider contact on, say, the rugby pitch to be the same as contact in individual gymnastics or running track outdoors. WPA representatives criticized the shared-room situation and advice from the playbooks about opening windows once in a while for ventilation, something that might actually be impractical in Tokyo’s extreme summer heat. Also bad in the plan: allowing different kinds of masks and personal protective equipment, using phone apps for contact tracing instead of dedicated tech, and a lineup of other less-than-stellar interventions that the WPA reps said were just asking for trouble. “There’s never going to be zero risk when it comes to Covid, but there certainly could have been more mitigation put in place,” says Matthew Graham, director of legal and player relations at the WPA. “We, like the athletes we represent, hope this can be done safely, but no expense should have been spared for that.”\n McCloskey, for his part, maintains that the measures his team has put in place will keep the Village, the Games, and Japan as safe as possible. “As a general principle, I think if I’m not being criticized, I’m not doing my job properly,” he says.\n  If a few athletes get sick and are not able to compete—that’s sad, but it’s not an economic or epidemiologic catastrophe. But the  most expensive Summer Olympics($15.4 billion!) in history with no visitors to the host city? Well, an Olympics failing to live up to the economic and development promises of its organizers wouldn’t exactly be novel, though the  actual  studies on  this are  complicated.\n The catastrophe, if it happens at all, will start out small—inside a single human cell, infected by a virus. “Whenever you get many people together, there’s the opportunity for large outbreaks—not just super-spreading events, but also multiple generations of transmission, and the infections can then be passed on when people return home,” says Sarah Cobey, an epidemiologist and evolutionary biologist at the University of Chicago. “All such spread promotes not just new cases but also adaptation, including the movement of fitter variants to new populations.”\n In other words, the problem isn’t merely someone infecting someone else, or even lots of someone elses. These potential Olympic infections could be like microbiological invasive species, given the means to travel to new populations where they might be even more dangerous than they were at home. Covid-19 has been charged by  super-spreader events—occasions where many people get infected at once. SARS-CoV-2, the virus that causes Covid-19, has evolved and adapted over the past 18 months, manifesting changes to its genetic code that make it easier for the virus to spread. That’s very good for a virus whose whole existential goal is to make more of itself; it’s very bad for humans, because it might make the virus more able to infect other people, either through force of numbers or being more virologically sneaky in infecting cells, or some other mechanism altogether.\n A giant gathering with people from many different populations, almost certainly carrying different versions of the virus, is exactly the kind of place that makes super-spreader events and the exchange of new variants more possible. It might—emphasis on  might—even make possible the development and spread of new, worse variants. “Personally, if I were in charge of the Olympics in Japan, the risk of transmission getting established would be too high for me. Maybe their assumption is, if it does spill over, they can bring it under control again without risking an epidemic,” Scarpino says. “I may not agree with that, but I think where we diverge in the cost-benefit calculations of holding the Olympics versus the spread of Covid locally in Japan is when we get into the conversation of what this might mean for the evolution of the virus itself.”\n This is the  worst worst-case scenario. “There are plenty of eco-evolutionary scenarios where this isn’t a traditional super-spreader event, but a ‘super-evolutionary event,’” Scarpino says, “where a critical mass of vaccinated individuals are selecting for variants that have increased transmissibility in vaccinated individuals.” All those people with differing immune statuses and different exposures to different strains of the virus could create a terrifying genetic parody of Olympism’s international cooperation: a free and open exchange of viral ideas on how to be more infectious, maybe even more deadly or more vaccine-evasive. And then it’d travel back to everyone’s home country under the cover of asymptomatic spread.\n There are two extremes on the scale of probability. The best outcome anyone can hope for at this point is that with the screening program in place, only a few people will get infected or ill. A few Olympic stories will end badly. That’s already happening—athletes and the people who work with them have been denied a chance to compete in Tokyo because testing shows they’re infected. And on the far side of the scale is a super-evolutionary event that allows the development of an even more potent form of the virus and then puts it on hundreds of jet planes headed to every corner of the planet. For everyone wondering what the most likely outcome is, it’s like the Olympics, except only in the most terrifying way possible: It’s unpredictable.", "posttime": "2021-07-24 19:12:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "奥运会,olympics", "title": "东京奥运会可能是 Covid-19 的“超级进化事件”", "title_en": "The Tokyo Olympics could be a Covid-19 “super evolutionary event”", "transed": 1, "url": "https://arstechnica.com/science/2021/07/the-tokyo-olympics-could-be-a-covid-19-super-evolutionary-event/", "via": "", "real_tags": ["奥运会", "olympics"]}, {"category": "", "categoryclass": "", "imagename": "a15c83e7e8abc15a76ac2b5c4fb126b3.png", "infoid": 1069441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（路透社） - 事件管理软件公司 Cvent 将与一家空白支票公司合并，该公司的企业价值为 53 亿美元，在私有化五年后重返公开市场。周五宣布的与 Dragoneer Growth Opportunities Corp. II 的交易包括 Zoom Video Communications Inc 的投资，作为 4.75 亿美元 PIPE 或公共股权私募投资的一部分。 PIPE 轮次的其他投资者包括 Fidelity Management &amp; Research Co、Ian Osborne 的 Hedosophia 和 Oaktree Capital Management。拥有 22 年历史的 Cvent 提供被超过 200,000 名用户使用的事件管理软件。它于 2016 年被投资公司 Vista Equity Partners 以 16.5 亿美元的价格私有化。在大流行期间，促进在线会议的公司蓬勃发展，因为行动限制迫使企业以虚拟方式举办活动。总部位于弗吉尼亚州麦克莱恩的 Cvent 表示，预计这笔交易将带来 8.01 亿美元的收益，将用于产品开发和产品扩展。 Dragoneer Growth 等 SPAC 使用通过 IPO 筹集的资金池与一家私人公司合并并上市，通常在上市后两年内上市。\n交易完成后，Cvent 将在纳斯达克上市，股票代码为“CVT”。", "note_en": "(Reuters) -Event management software company Cvent will merge with a blank-check firm in a deal that gives it an enterprise value of $5.3 billion, returning to the public markets five years after it was taken private.\n The deal with Dragoneer Growth Opportunities Corp. II announced on Friday included an investment from Zoom Video Communications Inc as part of a $475 million PIPE, or private investment in public equity, round.\n Other investors in the PIPE round included Fidelity Management &amp; Research Co, Ian Osborne’s Hedosophia and Oaktree Capital Management.\n  22-year-old Cvent provides event management software that is used by more than 200,000 users. It was taken private in 2016 by investment firm Vista Equity Partners in a $1.65 billion deal.\n Companies that facilitate online meetings have flourished during the pandemic as restrictions on movement forced businesses to host events virtually.\n McLean, Virginia-based Cvent said it expects the deal to deliver proceeds of $801 million, which it will use for product development and expansion of its offering.\n  SPACs like Dragoneer Growth use the pool of capital raised through their IPOs to merge with a private company and take it public, typically within two years of listing.\n  After the deal closes, Cvent will be listed on Nasdaq under the ticker symbol “CVT”.", "posttime": "2021-07-24 19:08:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,equity,cvent", "title": "事件管理软件公司 Cvent 将通过与 SPAC 合并以 5.3B 美元的估值上市； Cvent 于 2016 年被 Vista Equity Partners 私有化", "title_en": "Event management software company Cvent is going public by merging with a SPAC at a valuation of $5.3B; Cvent was taken private in 2016 by Vista Equity Partners", "transed": 1, "url": "https://www.reuters.com/article/us-cvent-m-a-dragoneer-idUSKBN2ET18F", "via": "", "real_tags": ["软件", "equity", "cvent"]}, {"category": "", "categoryclass": "", "imagename": "7cd66533883de31cbd06515f596cbc86.png", "infoid": 1069440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该项目的目的是开发 EATX 外形的开源 Amiga 2000 PCB。什么是EATX？它是一种 ATX 变体，允许使用更深的 PCB，尺寸为 12 x 13 英寸（305 x 330 毫米）。这些被称为扩展 ATX 或 EATX（请参阅企业电子设备托架规范）。 Zorro II 卡的长度和 Amiga 2000 上的丰富组件使 EATX 成为该项目的最佳选择。 Amiga 2000 有一对一的电路板更换项目，但都没有改变布局以满足当前的外形标准。此外，Amiga 2000 使用了不再商业制造的连接器和定制部件。这通常需要从现有机器中取出零件。因此，该项目将在可能的情况下仅使用主动支持的组件。除了新的主板更换选项外，我相信无处不在的 EATX 标准将为 Amiga 作为爱好者和复古计算选项带来额外的兴趣。在撰写本文时，Amiga 操作系统仍在积极开发和支持。此外，还有大量现有软件和硬件附加选项的数据库和一个非常活跃的社区。我目前正在 Amiga 2000 EATX 上运行 Supra Wordsync SCSI 卡、Commodore A2630 加速器和 Pi HDMI 视频卡。可以在屏幕上看到 AIBB。我让 Amiga 2000 EATX 运行几个小时玩游戏和运行内存测试没有问题。所有外部端口都按预期工作。将 Amiga 2000 Rev 6.2 原理图输入 KiCad，包括所有已知的 A2000 Rev 6.x PCB 更新。查看此信息以确保在组装 Amiga 2000 EATX 系统时获得顺畅和愉快的体验。它将回答许多问题，并告知您 Amiga 2000 EATX PCB、各种 Amiga 插件卡等的物理要求。DB23 视频连接器已被移除，取而代之的是 HD15 连接器。该项目的目标之一是避免使用非市售部件。 D-Sub 23 连接器就是一个典型的例子。它们不在流行的电子供应商处备货。因此，更改为广泛使用的 HD15 连接器。模拟红色、绿色、蓝色、HSYNC 或 COMPSYNC（跳线可选）和 VSYNC 使用 VGA 标准引脚输出配置提供。不提供其他外部视频端口信号。任何 VGA 电缆都可用于向支持 15KHz 标准的 VGA 显示器或转换盒提供视频信号。\n原来的 256Kx4 DRAM 已被单个 SRAM 取代。 2000 EATX 永久配置为识别 1MB 芯片 ram 并需要 Fatter Agnus (MOS 8372A)。目前不支持其他 Agnus 修订版。 Amiga 的左/右 RCA 插孔已被 3.5 毫米立体声音频插孔取代。在内部，支持任何 Amiga 兼容双密度磁盘驱动器或正确配置的 Gotek 软盘模拟器。最多可以将两个内部磁盘驱动器连接到内部软盘连接器。外部磁盘驱动器端口已被移除。 16 位 ISA 插槽的数量已减少到三个。这样做是为了在板上提供额外的空间。与 Amiga 2000 相比，通过 Bridgeboard 对 ISA 卡的支持没有变化。内部（地狱）串行端口已被删除。外部串行端口与所有信号一起存在。出于显而易见的原因，有必要相对于彼此移动组件。 Zorro 插槽占据插槽位置 1-5，与前 3 个位置的 ISA 插槽重叠。视频槽位在板卡的第六槽位。 CPU 插槽占据位置 7。可以同时填充每个插槽位置。支持 ATX 24 针电源，-5V 通过电压调节器在板上供电。不支持原装 Amiga 2000 电源。\n可以通过 Amiga 键盘上的 CTRL-Amiga-Amiga 或通过 EATX 计算机机箱上的重置开关重置计算机。实时时钟 (RTC) 已更改为 RTC-62423。该 RTC 内置晶体，无需调整。在Amiga中，RTC由4条地址线和4条数据线读写。不幸的是，这种总线连接的 RTC 没有直接的“现代”替代品。因此，这是必须获得的传统 IC 之一。它很容易在出售这些类型的传统 IC 的地方买到。键盘、操纵杆、鼠标、并行和串行端口都存在并且功能与它们在 Amiga 2000 中一样。并行、串行、鼠标和操纵杆端口分别是堆叠的 DB9 和 DB25 连接器。 Amiga 键盘端口仍然是 DIN5 连接器。目前，Kickstart ROM 仍然是原始的 27C400。这些不再制造，但很容易找到。此外，这允许使用原始 Commodore Kickstart 掩码 ROM。修订版 1.2 为自定义 Kickstart ROM 添加了对 1MB (27C800) 和 2MB (27C160) EPROM 的支持。如果没有特别提及某些内容，您应该期望它在功能或组件上与原始 A2000 相同。 kr239 - 用于 Amiga 500 DRAM 更换项目的灵感以及用于该项目中使用的修改的 LIV2 和 texneus DarrenHD - Amiga 3000 视频插槽支架适配器的图片和测量值 - https://eab.abime.net/showthread.php?t =106928", "note_en": "The purpose of this project is to develop an open source Amiga 2000 PCB in the EATX form factor. What is EATX? It is an ATX variant that allows slightly deeper PCBs, measuring 12 x 13 inches (305 × 330 mm). These are referred to as Extended ATX, or, EATX (see  Enterprise Electronics Bay Specification). The length of Zorro II cards and the abundance of components on the Amiga 2000 makes EATX the best choice for this project.\n There are one-to-one board replacement projects for the Amiga 2000, but none to change the layout to meet current form factor standards. In addition, the Amiga 2000 made use of connectors and custom parts that are no longer commercially manufactured. This often requires parts to be pulled from existing machines. As such, this project will make use of only actively supported components when possible.\n In addition to a new board replacement option, I believe the ubiquitous EATX standard will bring additional interest to the Amiga as a hobbyist and retro-computing option. At the time or writting this, the Amiga operating system is still actively developed and supported. In addition, there is a substantial database of existing software and hardware add-on options and a very active community.\n     I am currently running a Supra Wordsync SCSI card, a Commodore A2630 accelerator, and a  Pi HDMI video card on the Amiga 2000 EATX. AIBB can be seen on the screen. I allowed the Amiga 2000 EATX to run for several hours playing games and running memory tests without issue. All the external ports are working as expected.\n   Enter Amiga 2000 Rev 6.2 schematics into KiCad, including all known A2000 Rev 6.x PCB updates.\n  Review  this information to ensure a smooth and happy experience when assembling an Amiga 2000 EATX system. It will answer many questions and inform you as to the physical requirements of the Amiga 2000 EATX PCB, various Amiga plug in cards, etc.\n       The DB23 video connector has been removed in favor of the HD15 connector. One of the goals of this project is to avoid parts that are not commercially available. The D-Sub 23 connector is a prime example. They are not stocked at popular electronic supply houses. Thus, the change to the widely available HD15 connector. Analog red, green, blue, HSYNC or COMPSYNC (jumper selectable), and VSYNC are supplied using the VGA standard pin out configuration. Other external video port signals are not supplied. Any VGA cable can be used to supply the video signal to a VGA monitor or conversion box supporting the 15KHz standard.\n    The original 256Kx4 DRAMs have been replaced by a single SRAM. The 2000 EATX is permanently configured to recognize 1MB chip ram and requires Fatter Agnus (MOS 8372A). Other Agnus revisions are not supported at this time.\n  The left/right RCA jacks of the Amiga have been replaced by a 3.5mm stereo audio jack.\n  Internally, any Amiga compatable double density disk drive or properly configured Gotek floppy emulator is supported. Up to two internal disk drives may be connected to the internal floppy connector. The external disk drive port has been removed.\n  The number of 16 bit ISA slots has been reduced to three. This was done to provide additional space on the board. Support for ISA cards via a Bridgeboard is unchanged from the Amiga 2000.\n  The internal (infernal) serial port has been removed. The external serial port is present with all signals.\n  For obvious reasons, it was necessary to move components relative to one another. Zorro slots occupy slot positions 1-5, overlapping with ISA slots in the first 3 positions. The video slot occupies the sixth slot position on the board. The CPU slot occupies position 7. It is possible to have every slot position populated simultaneously.\n  ATX 24-pin power supplies are supported with -5V being supplied on board via a voltage regulator. The original Amiga 2000 power supply is not supported.\n  The computer can be reset via CTRL-Amiga-Amiga on an Amiga keyboard or via the reset switch found on EATX computer cases.\n  The real time clock (RTC) has been changed to the RTC-62423. This RTC has a built in crystal and does not need adjustment. In the Amiga, the RTC is written and read by 4 address and 4 data lines. Unfortunately, there are no direct &#34;modern&#34; replacements for this type of bus connected RTC. As such, this is among the legacy IC&#39;s that must be obtained. It is readily available where these type of legacy IC&#39;s are sold.\n   The keyboard, joystick, mouse, parallel, and serial ports are all present and function as they did in the Amiga 2000. The parallel, serial, mouse, and joystick ports are stacked DB9 and DB25 connectors, respectively. The Amiga keyboard port remains a DIN5 connector.\n    For now, the Kickstart ROM remains the original 27C400. These are no longer made, but are easy to find. In addition, this allows the use of an original Commodore Kickstart mask ROM. Revision 1.2 added support for 1MB (27C800) and 2MB (27C160) EPROMs for custom Kickstart ROMs.\n  If something is not specifically mentioned, you should expect it to be unchanged in function or component from the original A2000.\n          kr239 - for the Amiga 500 DRAM replacement project inspiration and LIV2 and texneus for the modifications used in this project\n   DarrenHD - Pics and measurements of the Amiga 3000 video slot bracket adapter -  https://eab.abime.net/showthread.php?t=106928", "posttime": "2021-07-24 19:08:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "eatx,amiga", "title": "Amiga 2000 EATX PCB", "title_en": "Amiga 2000 EATX PCB", "transed": 1, "url": "https://github.com/jasonsbeer/Amiga-2000-ATX", "via": "", "real_tags": ["eatx", "amiga"]}, {"category": "", "categoryclass": "", "imagename": "c4e8d5f35d685a2d2d954ac8bf82b9fa.png", "infoid": 1069439, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "事实证明，当谈到计算机时，这句 16 世纪的名言仍然非常适用。毕竟，在大多数操作系统上，进程都有一个“命令行”组件，它允许（启动）父进程将信息传递给子进程。这个新创建的进程可以访问命令行，这可能会根据在命令行上找到的内容更改其进程流。这个概念是构成“计算机”的核心：它能够执行一组指令、程序，接受各种输入。尽管它在计算中发挥着基本作用，但对于命令行上可以找到的各个部分的称呼似乎没有达成一致。有些人认为命令行参数、参数、选项、标志、开关是一回事，有些人则有不同的含义。这篇文章将使用以下术语：整个行是命令行，它由命令行参数（用空格分隔）组成。虽然都是参数，但它们有不同的作用：例如，第一个参数通常是被调用的进程 - 或者，如果您在命令提示符中，这将是命令。在上面的例子中，后面跟着更多的参数。更具体地说，前三个是命令行选项，通常以特殊字符开头。在这三个选项中，前两个是开关，因为它们不需要进一步的输入，而第三个是一个标志，因为它后面是进一步的参数，这些参数是这个参数的“输入”。选项 char 是用作命令行选项前缀的字符。在 Windows 上，这通常是正斜杠 (/)，在类 Unix 系统上，主要使用连字符 (-)。这是惯例而非规则：因为命令行由正在执行的程序解析，开发人员可以完全自由地定义应该以什么格式传递参数。公约很难。计算历史告诉我们，如果没有标准化，事情往往会以混乱结束——这当然适用于命令行。命令行解析实践缺乏标准化导致用户混淆：很容易混淆不同的实践，导致执行不成功和很多挫折。为了帮助用户，一些程序被设计为接受多种约定。一个常见的例子是接受正斜杠和连字符作为选项字符，这将在下一节中更详细地讨论。另一个混淆源是可用的不同字符编码。这导致了旧程序（通常只接受 ASCII）和新程序（现在通常接受 UTF-8 或 Unicode）之间的各种兼容性问题。一些程序试图通过过滤掉某些字符或将特定字符转换为 ASCII 等价物来解决这些不兼容性。\n这导致了某些程序将各种不同的命令行参数视为一个相同的情况。您可以将此类实例称为同义命令行，因为尽管传递给流程的数据不同，但它们的执行和结果是相同的。虽然能够以不同的方式表达相同的命令可能对某些用户有所帮助，但它往往会使检测和预防工作更加困难。大多数威胁检测软件（AV、EDR 等）将监控进程执行，并寻找可能表示恶意使用的命令行参数。由于攻击者希望不被发现，他们可能会利用命令行的灵活性来逃避检测。这可能包括从绕过基于关键字的检测的小调整到全面的命令行混淆以隐藏原始命令。命令行级别混淆的一个很好的例子是 Daniel Bohannon 的优秀作品 DOSfuscation [1, 2]，它特别关注 Windows 命令行提示符 CMD。即使正在执行的 CMD &#39;理解&#39;并执行混淆的命令，它对人类来说可能看起来难以理解，并且监控软件也很可能被蒙在鼓里。同义命令行的现象超出了 DOSfuscation，因为它适用于更多程序，而不仅仅是 CMD。这里的主要区别在于，您不仅会愚弄命令行提示符，还会愚弄正在执行的程序本身。正如稍后将展示的，虽然 DOSfuscation 工作可能会在检测软件使用的记录器中以未混淆的形式结束，但同义的命令行参数不会。为了看到这一点，我们现在将仔细研究可能导致同义命令行的五种不同方法。考虑 Windows 可执行文件 ping。由于该程序是原始 Unix 版本的移植，帮助页面建议命令行选项应使用连字符作为选项字符，例如 ping -n 0 127.0.0.1。这与大多数其他使用正斜杠的 Windows 原生命令行工具不一致。大概是为了帮助困惑的用户，该程序还接受正斜杠作为选项字符：ping /n 0 127.0.0.1 也可以工作。大多数使用连字符的内置 Windows 可执行文件也接受正斜杠，但反之则不然。例如，命令 find /i keyword 将显示包含单词“keyword”的所有文件，而 find -i keyword 将导致错误。\n尽管正斜杠和连字符是最常见的可用选项，但有些程序支持更多的选项字符。 certutil 恰好接受连字符、斜线和斜线的大多数 Unicode 表示，例如除法斜线 (0x2215) 和分数斜线 (0x2044) [3]。正如我们将在其他变体中看到的那样，可执行文件很少记录这些替代命令行选项，这意味着您会偶然、“蛮力”或通过逆向工程找到它们。另一种方法是用类似的字符替换命令行中的其他字符（即除了选项字符之外）。尤其是当您考虑整个 Unicode 范围时，在 ASCII 范围内也发现了许多字母变体，某些进程可能接受这些变体。 Unicode 包含一个间距修饰字母范围 (0x02B0 - 0x02FF) [4]，其中包括 ˪、ˣ 和 ˢ 等字符。一些命令行解析器将它们识别为字母并将它们分别转换回 l、x 和 s。一个例子是 reg，它将 reg export HKCU out.reg 和 reg eˣport HKCU out.reg 视为相等。事实证明，有更多 Unicode 范围包含某些程序接受的字符。同样，有时可以在命令行中插入额外的字符，这些字符将被执行程序忽略。例如，某些可执行文件可能会删除不可打印的字符，同时也可能会过滤掉某些可打印的字符。例如，Windows 事件日志工具 wevtutil 似乎接受在随机位置插入某些范围内的 Unicode 字符的命令行。因此，执行 wevtutil gli hardwareevents 和 wevtutil gࢯli hardwareevents 将产生完全相同的输出，尽管后者在第一个参数的中间包含一个阿拉伯字母。\n由于命令行提示的标准输入有时不支持可用于此技术的字符（例如，因为它们不可打印），您可能必须使用字节表示法插入字符。从截图中可以看出，在这种情况下，字符被正确地传递给了进程。在保持流程完整的同时操纵命令行的另一种方法是插入引号。尽管这听起来像是先前技术的一个子集，但这里的要求是引号成对出现。您可能熟悉在参数周围加上引号的概念。以 dir &quot;c:\\windows\\&quot; 为例，由于缺少空格，它实际上与 dir c:\\windows\\ 相同。大多数程序都接受这个约定。鲜为人知的是，大多数程序在任意位置接受引号：命令 dir c:\\&quot;win&quot;d&quot;&quot;ow&quot;s&quot; 也可以使用。只要每个参数的引号数是偶数并且后面的引号不超过两个，大多数程序似乎都接受这一点。值得注意的是，在命令提示符中使用引号可能很棘手，因为它们通常在将引号传递给底层程序之前自己处理引号。例如，在 cmd 中解决此问题的一种方法是将每个引号加倍，因此要获得如上所示的等效执行，您必须运行 netsh ad&quot;&quot;vfi&quot;&quot;rewall show currentprofile state。插入和替换字符后，我们还需要尝试删除字符。一些应用程序允许为其他冗长的命令行选项提供“速记”，从而更容易输入它们。这是基于 Unix 的工具中的一个众所周知的概念（例如 grep -i 关键字与 grep --ignore-case 关键字），但在 Windows 上则不然。然而，一些程序接受缩短的版本。一些程序采用与 Unix 类似的方法并接受单字母版本（例如 cmdkey /l 与 cmdkey /list），有些程序接受其他缩写版本（例如 wevtutil gli 与 wevtutil get-loginfo），而其他程序则采用“通配符方法” &#39;。这方面的一个例子是 PowerShell，它的许多关键字允许您在关键字 [5] 的末尾省略一个或多个字符。成功执行 powershell /encodedcommand ZQBjAGgAbwAgACIASQB0ACAAdwBvAHIAawBzACEAIgA= 后跟 13 种不同速记的示例。\n也许除了最短的变体 /e 之外，在我看来，接受这些速记方法对很少人有帮助，但它确实使事情变得更加复杂和不可预测。例如，PowerShell 只接受缩短的版本，前提是它不会导致另一个命令之间的歧义。出于这个原因，关键字/noprofile 的最短变体是/nop，因为/no 会与例如/noexit 发生冲突。除了这种“通配符方法”之外，PowerShell 在某些情况下也接受首字母缩略词，因此尽管屏幕截图中没有显示，/ec 也可以用作 /encodedcommand 的简写。如前几节所述，处理命令行参数没有标准。有些程序非常严格，而有些程序会非常努力地将给出的任何内容变成它可以理解的内容。找出特定程序的命令行行为也是有问题的：帮助页面通常只指定传递参数的“首选”方式（方法 1 和 5），通常从不描述如何处理意外字符（方法 2-4 ）。确定这一点的最准确方法似乎是逆向工程。但是，这是一项非常耗时的活动，尤其是当您考虑到某些程序的复杂性时。因此，更实用的方法是简单地使用不同的字符重复尝试所有绕过技术并比较结果。这种方法的概念验证实现 [6] 使我们能够快速分析所描述的五种行为中的哪一种。可以在 GitHub 项目页面上找到对 PoC 的更详细解释、其基本假设和警告。出于本文的目的，PoC 用于分析 40 多个经常用于攻击的内置 Windows 可执行文件。注：1) 使用 Windows 10 2004 版进行分析；2) 对于每个 Windows 可执行文件，仅使用一个特定的命令 - 其他命令可能会导致不同的结果；3) 用星号 (*) 表示的条目针对的是命令-line 参数接受每个变化。例如，在 nslookup -querytype=ALL (...) 的情况下，PoC 发现无论插入什么字符，都会返回预期的输出。事实证明，nslookup 会忽略命令行选项（在本例中为 -q）的第一个字母之后的所有字母，这意味着可能的排列数量几乎是无限的。每个测试的可执行文件的完整报告，包括测试的命令和找到的字符，可以在 GitHub [6] 上找到。\n了解所有这些使我们能够退后一步，从威胁搜寻的角度审视命令行行为。如果你想用特定的命令行参数检测程序的执行，同义的命令行参数会带来问题。例如，编写 Sigma 规则 [7] 来检测指定 urlcache 和 f 参数的 certutil 执行可以表示为： 问题很明显：如果攻击者使用 -urlcache、/urᴸcache、/₞urlcache 或 /url&quot;cach &quot;e - 或者更糟的是，一个组合：-₞u₞rᴸ&quot;c₞a₞ch&quot;e，该命令仍然有效，但上述规则不会影响行为。将所有变体添加到规则中不是一种选择，因为结合各种绕过技术将导致数千甚至数百万个排列。 certutil -f -urlcache -split https://wietze.github.io/robots.txt output.txt 混淆版本的成功执行示例。可能尝试的第一个潜在解决方案是使规则更通用。例如，解决选项字符问题，我们可以将选项字符排除在定义之外：虽然这似乎解决了选项字符问题，但它创建了一个新的问题。查找 urlcache 而不是 /urlcache 不太可能导致很多误报，但是，只查找 f 而不是 /f 可能会产生误报。第二种可能的解决方案是使用更巧妙的匹配选项。许多提供寻找流程执行功能的 EDR 工具往往仅限于简单的“字符串包含”式功能，如上述示例中所示。有些允许正则表达式，但这似乎仍然很少见。尽管 Sigma 支持正则表达式值，但在 30 个支持的后端中似乎只有 7 个实际实现了它。虽然这并不一定意味着其他 23 个平台不支持它，但至少表明它可能不是一条明显的下降路径。供应商可能对提供此选项犹豫不决的一个关键原因首先是性能：正常的编译正则表达式的复杂度为 O(n)，但通过递归扩展，可以创建永远不会结束计算的正则表达式。 Sigma 项目也不鼓励使用正则表达式 [8]。\n对于那些支持正则表达式的工具，可以解决选项字符问题（假设您将 [-/\\\\] 替换为所有选项字符的列表）：正则表达式还可以帮助有效地捕获速记关键字。不幸的是，由于选项和排列的大小，字符插入和替换通常是不可行的。解决这些类型的混淆永远不会是无懈可击的。需要更具弹性的方法。为避免落入隧道视觉检测工程的陷阱，您可以采取一些措施来实现强大的威胁搜寻过程。首先，确保规则被合理地定义为“广泛”，捕捉所有可能的变化，同时考虑到误报的潜在增加。提供的 PoC [6] 可用于查找您的规则可能允许的变化。其次，标准化监控工具的输出也可能是有益的。如果您的数据在最终进入分析平台之前在管道中进行处理，请考虑添加一个单独的字段，将所有特殊字符转换为 ASCII 等效字符并去除所有非字母数字值（以去除引号和选项字符）。在此字段上运行您的规则可能会有更高的命中率。此外，使用数据分析来检测混淆尝试本身。查看包含在您的 IT 资产中使用率较低的字符的流程命令行，比较字符密度级别，甚至只是查找包含非 ASCII 字符的命令行参数并从那里开始工作。\n还要确保您的重点比单独的流程字符串更广泛。在可能的情况下，关注命令行试图实现的实际行为，例如文件创建、注册表更改或网络连接。例如，与其试图捕获所有可能的恶意 wevtutil 命令，不如寻找写入意外位置的 wevtutil（系统信息发现？[9]）或检查事件 ID 1102 的事件日志（指标删除？[10]） ]）。最后，请记住，不可能在 100% 的时间内检测到 100% 的不良情况 - 但是，您检测到的越多，攻击者就越难以完全被忽视。因此，考虑到上述因素将使您更近一步。 “欲听从者，必知指挥”，懂指挥者，必知察。", "note_en": "It turns out that when it comes to computers, this sixteenth-century quote still very much applies. After all, on most operating systems, processes have a ‘command line’ component, which allows the (initiating) parent process to pass on information to the child process. The command line is accessible to this newly created process, which may change its process flow based on what is found on the command line. This concept is at the core of what makes ‘the computer’: its ability to execute a set of instructions, programs, taking input of sorts.\n Despite its fundamental role in computing, there doesn’t appear to be agreement on what to call the various parts that can be found on command lines. Some consider command-line arguments, parameters, options, flags, switches to be one and the same, to some they have different meanings. This post will be using the following terminology:\n  The line in its entirety is the command line, which is comprised of command-line  arguments (separated by spaces). Although all are arguments, they have different roles: for example, the first argument is typically the  process that is being called - or, if you are within a command prompt, this would be the  command. In the above example it is followed by more arguments. More specifically, the first three are command-line  options, which typically start with a special character. Of these three options, the first two are  switches because they don’t require further input, whereas the third is a  flag because it is followed by further arguments that are ‘inputs’ for this argument.\n The  option char is the character that is used as a prefix on command-line options. On Windows this is typically the forward slash ( /), on Unix-like systems hyphens ( -) are predominantly used. This is rather by convention than by rule: because the command line is parsed by the program being executed, developers are completely free in defining in what format arguments should be passed.\n Conventions are hard. Computing history has taught us that without standardisation, things tend to end in chaos - and that certainly applies to command lines.\n  The lack of standardisation in command-line parsing practices has caused confusion amongst users: it is easy to mix up the different practices, leading to unsuccessful executions and much frustration. In an attempt to help users, some programs have been designed to accept multiple conventions. A common example of this is accepting both forward slashes and hyphens as option char, as will be discussed in more detail in the next section.\n Another source of confusion is the different character encodings that are available. This has caused all sorts of compatibility issues between old programs (typically only accepting ASCII) and newer programs (nowadays often accepting UTF-8 or Unicode). Some programs attempt to fix these incompatibilities by filtering out certain characters or converting specific characters to ASCII equivalents.\n This has led to a situation in which some programs treat a variety of different command-line arguments as one and the same. You could call such instances  synonymous command lines, since despite the data passed to the process is different, their execution and outcome is identical.\n  Although being able to express the same command in different ways may be of help to some users, it tends to make detection and prevention efforts harder. Most threat detection software (AV, EDR, and so on) will monitor process executions, and look for command-line arguments that may be indicative of malicious usage. As attackers will want to go undetected, they may take advantage of the flexibility of the command line in an attempt to evade detection. This may range from small tweaks to bypass keyword-based detection, to full-blown command-line obfuscation to hide the original commands.\n A good example of obfuscation on command-line level is the the excellent work of Daniel Bohannon, DOSfuscation [ 1,  2], which specifically focusses on the Windows command-line prompt CMD. Even though the executing CMD ‘understands’ and executes the obfuscated commands, it may look unintelligble to humans, and monitoring software is also likely to be kept in the dark.\n The phenomenon of synonymous command-lines goes beyond DOSfuscation, as it applies to many more programs than just CMD. The key difference here being that you wouldn’t just be fooling the command-line prompt, but the executing program itself. As will be shown later, whilst DOSfuscation efforts may end up in unobfuscated form in the recorders used by detection software, the synonymous command-line arguments will not.\n  To see this in action, we will now take a closer look at five different methods that can cause synonymous command lines.\n  Consider the Windows executable  ping. Because the program is a port of the original Unix version, the help page suggests command-line options should use a hyphen as option char, e.g.  ping -n 0 127.0.0.1. This is inconsistent with most other, Windows-native command-line tools, which use forward slashes. Presumably in an attempt to help confused users, the program also accepts the forward slash as option char:  ping /n 0 127.0.0.1 will work as well.\n Most built-in Windows executables that work with hyphens also accept forward slashes, but the reverse is not true. The command  find /i keyword for example will show all files containing the word ‘keyword’, while  find -i keyword will result in an error.\n Although forward slashes and hyphens are the most common available options, some programs support even more option chars.  certutil happens to accept hyphens, slashes, and most Unicode representations of slashes, such as the division slash (0x2215) and fraction slash (0x2044) [ 3].\n As we will see with the other variants, executables rarely document these alternative command-line options, meaning that you will find out about them either by chance, ‘brute force’ or through reverse engineering.\n  Another approach is to replace other characters (i.e. other than the option char) in the command line with similar characters. Especially when you consider the entire Unicode range, there are many variations of letters also found in the ASCII range that some processes may accept.\n Unicode contains a range for  Spacing Modifier Letters (0x02B0 - 0x02FF) [ 4], which includes characters such as ˪, ˣ and ˢ. Some command-line parsers recognise these as letters and convert them back to l, x and s respectively. An example of this is  reg, which treats  reg export HKCU out.reg and  reg eˣport HKCU out.reg as equal.\n  As it turns out, there are more Unicode ranges containing characters that are accepted by some programs.\n  In a similar vein, it is sometimes possible to insert extra characters into command lines that will be ignored by the executing program. Some executables may remove non-printable characters for example, whilst also certain printable characters may be filtered out.\n Windows Event Logs tool  wevtutil for instance seems to accept command lines that have Unicode characters from certain ranges inserted at random places. So executing  wevtutil gli hardwareevents and  wevtutil gࢯli hardwareevents will result in the exact same output, despite the latter containing an Arabic letter in the middle of the first argument.\n  Because the characters that can be used for this technique are sometimes unsupported on the stdin of command-line prompts (e.g. because they are non-printable), you may have to insert the character using byte notation. As can be seen in the screenshot, in this case the character is passed correctly to the the process.\n  Another way of manipulating a command line whilst keeping the process flow intact is by inserting quotes. Although this may sound like a subset of the previous technique, a requirement here is that the quotes come in pairs.\n You are probably familiar with the concept of putting quotes around arguments. Take  dir &#34;c:\\windows\\&#34; for example, which is effectively the same as  dir c:\\windows\\ due to the lack of spaces. Most programs accept this convention. Less well known is that most programs accept quotes in arbitrary places: the command  dir c:\\&#34;win&#34;d&#34;&#34;ow&#34;s&#34; will also work. As long as the number of quotes per argument is even and there are no more than two subsequent quotes, most programs seem to accept this.\n  It is worth noting that working with quotes in command prompts can be tricky, as they typically handle quotes themselves before passing it on to the underlying program. A way to work around this in  cmd for example is to double every quote, so to get the equivalent execution as shown above, you would have to run  netsh ad&#34;&#34;vfi&#34;&#34;rewall show currentprofile state.\n  Having inserted and replaced characters, what remains for us to try is removing characters. Some applications allow ‘shorthands’ for otherwise lengthy command-line options, making it easier to type them out.\n This is a well-known concept in Unix-based tools (e.g.  grep -i keyword vs  grep --ignore-case keyword), but on Windows less so. Nevertheless, some programs accept shortened versions. Some programs take a similar approach to Unix and accept a one-letter version (e.g.  cmdkey /l vs  cmdkey /list), some accept an otherwise abbreviated version (e.g.  wevtutil gli vs  wevtutil get-loginfo), whilst others take a ‘wildcard approach’. An example of this is PowerShell, which for many of its keywords allows you to leave off one or more characters at the end of the keyword [ 5].\n An example of the successful execution of  powershell /encodedcommand ZQBjAGgAbwAgACIASQB0ACAAdwBvAHIAawBzACEAIgA= followed by 13 different shorthands.\n Perhaps apart from the shortest variant  /e, it seems to me that very few people are helped by accepting these shorthands whilst it does make things more complicated and unpredictable. For example, PowerShell only accepts shortened versions if it doesn’t cause ambiguity between another command. For this reason the keyword  /noprofile’s shortest variant is  /nop, because  /no would clash with e.g.  /noexit. Next to this ‘wildcard approach’, PowerShell in some cases also accepts acronyms, so despite not shown in the screenshot,  /ec would also work as a shorthand for  /encodedcommand.\n  As mentioned in the previous sections, there is no standard when it comes to handling command-line arguments. Some programs are very strict, whereas some programs will try very hard to turn whatever it is given into something it can understand. Finding out for a particular program what its command line behaviour is, is problematic too: help pages usually only specify the ‘preferred’ way of passing arguments (methods 1 and 5) and typically never describe how unexpected characters are treated (methods 2-4).\n The most accurate way to determine this seems to be reverse engineering. However, this is a very time-consuming activity, especially when you take the complexity of some of the programs into account. A more pragmatic approach is therefore to simply try all bypass techniques repeatedly with different characters and compare the results.\n A proof-of-concept implementation of this approach [ 6] allows us to quickly analyse which of the five described behaviours apply. A more detailed explanation of the PoC, its underlying assumptions and caveats can be found on the GitHub project page.\n For the purposes of this post, the PoC was used to analyse over 40 built-in Windows executables often seen being used in attacks.\n  Notes:1) Windows 10 version 2004 was used for the analysis;2) For each Windows executable only a single, specific command was used - other commands may result in different outcomes;3) Entries denoted with an asterisk (*) targeted a command-line argument that accepted  every variation. In the case of  nslookup -querytype=ALL (...) for example, the PoC found that the expected output was returned regardless of what character was inserted. It turns out that  nslookup ignores all letters after the first letter of a command-line option ( -q in this case), meaning the number of possible permutations is nearly infinite.\n Full reports for each tested executable, including the tested commands and the found characters, can be found on GitHub [ 6].\n  Knowing all this allows us to take a step back and look at command-line behaviour from a threat-hunting perspective.\n If you want to detect executions of programs with specific command-line arguments, synonymous command-line arguments pose a problem. For example, writing a Sigma rule [ 7] to detect  certutil executions with the  urlcache and  f arguments specified could be expressed as:\n  The problem is immediately clear: if an attackers uses  -urlcache,  /urᴸcache,  /₞urlcache or  /url&#34;cach&#34;e - or even worse, a combination:  -₞u₞rᴸ&#34;c₞a₞ch&#34;e, the command will still work, but the above rule will not pick up the behaviour. Adding all variants to the rule is not an option, as combining the various bypass techniques will result in thousands if not millions of permutations.\n An example of the successful execution of an obfuscated version of  certutil -f -urlcache -split https://wietze.github.io/robots.txt output.txt.\n The first potential solution one may try is to make the rule a bit more generic. For example, solving the option char problem, we could leave the option char out of the definition:\n  Whilst this may appear to solve the option char problem, it created a new one. Looking for  urlcache instead of  /urlcache is unlikely to cause many false positives, however, looking for just  f instead of  /f is likely to generate false positives.\n A second potential solution would be to use more clever matching options. Many EDR tools that provide functionality to hunt for process executions tend to be limited to simple ‘string contains’-esque features such as expressed in the above examples. Some allow regular expressions, but this still seems to be rare. Although Sigma supports regex values, only 7 of the 30 supported backends appear to actually implement it. Whilst this does not necessarily mean the 23 other platforms do not support it, it at least suggests it may not be an obvious path to go down. A key reason vendors may be hesitant to provide this option in the first place is performance: a normal, compiled regular expression has a complexity of  O(n), but through recursion extensions it is possible to create regexes that will never end evaluating. The Sigma project also discourages the use of regexes [ 8].\n For those tools that do support regular expressions, it is possible to work around the option char problem (assuming you replace  [-/\\\\] with a list of all option chars):\n  Regexes may also help efficiently capture shorthand keywords. Unfortunately, character insertion and substitution this is typically not feasible due to the size of options and permutations.\n Working around these types of obfuscation is never going to be watertight. More resilient methods are needed.\n  To avoid falling into the trap of tunnel visioned detection engineering, there are a few things you can do to achieve robust threat hunting processes.\n First of all, make sure rules are defined as ‘broadly’ as they reasonably can be, catching all possible variations, whilst taking into account the potential increase of false positives. The presented PoC [ 6] can be used to find variations your rule may allow for.\n Secondly, standardising your monitoring tool’s output may be beneficial too. If your data is processed in a pipeline before it ends up in your analytics platform, consider adding a separate field that converts all special characters to ASCII equivalents and strips all non-alphanumeric values (to get rid of quotes and option chars). Running your rules over this field might have a higher hit rate.\n Furthermore, use data analytics to detect the obfuscation attempt itself. Look at process command lines that contain characters with a low prevalence across your IT estate, compare character density levels, or even simply look for command-line arguments that contain non-ASCII characters and work from there.\n Also make sure your focus is broader than process strings alone. Where possible, focus on the actual behaviour that the command line is trying to achieve, such as file creations, registry changes or network connections. For example, rather than trying to capture all possibly malicious  wevtutil commands, it may be better to look for  wevtutil writing to unexpected locations (system information discovery? [ 9]) or checking the event log for event ID 1102 (indicator removal? [ 10]).\n Finally, bear in mind that it won’t be possible to detect 100% of the badness 100% of the time - however, the more you you  can detect, the harder you are making it for an attacker to go completely unnoticed. And as such, taking the above into account will get you one step closer.\n “ He who wishes to be obeyed must know how to command”, and he who knows how to command will know how to detect.", "posttime": "2021-07-24 19:07:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,命令行,command", "title": "Windows 命令行混淆", "title_en": "Windows Command-Line Obfuscation", "transed": 1, "url": "https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation", "via": "", "real_tags": ["windows", "命令行", "command"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN 订阅者为您带来的这篇文章 LWN.net 的订阅者使这篇文章——以及围绕它的一切——成为可能。如果您欣赏我们的内容，请购买订阅并让下一组文章成为可能。 7 月 4 日，Rust for Linux 项目发布了另一个版本的补丁集，增加了对内核语言的支持。该项目似乎已经准备好考虑进入主线。不过，也许一个更大的问题仍然存在：内核开发社区是否为 Rust 做好了准备？那部分似乎仍然悬而未决。 Miguel Ojeda 已被聘用全职从事该项目，他发布了补丁集；在求职信中，他列出了自 4 月份发布 RFC 补丁集以来的一些更改和更新。特别是，在失败时调用 panic!() 的分配已被替换。已经为内核项目创建了 alloc crate 的修改版本，尽管计划是让更改进入上游项目，以便最终可以删除自定义版本。顺便说一句，添加修改后的 crate 的补丁显然太大了绝杀档案，尽管它确实出现在 LWN 档案中。他说，在内核设施的 Rust 抽象方面取得了更多进展，包括“红黑树、引用计数对象、文件描述符创建、任务、文件、io 向量……”，以及对驱动程序支持的补充。除此之外，Android Binder 进程间通信机制的 Rust 驱动程序具有更多功能，并且正在开发用于某些 Raspberry Pi 型号上可用的硬件随机数生成器的驱动程序。但是缺乏“真正的”车手是 4 月份的症结之一，这次又被提出来了。 Christoph Hellwig 表示，如果这是发布的意图，他强烈反对合并代码。在求职信中，Ojeda 说补丁集正在添加到 linux-next，并且他确认正在提交合并。 Hellwig 希望看到 Rust 在被包含之前证明自己：[...] 首先证明它确实有用。有用的将是像 nvme 这样的真实驱动程序或 USB 主机控制器驱动程序，它实际上可以工作并显示出优于现有驱动程序的优势。在它显示出如此有用之前，它只会拖累其他人。 Ojeda 指出 Binder 驱动程序是一个“非平凡的模块”，“已经在工作”，但承认真正的硬件驱动程序是一个重要的（并且目前还没有）。但是，求职信列出了一些对该项目感兴趣或已经参与其中的组织，Ojeda 认为这也有助于证明该项目：从某种意义上说，我们已经开始让下游用户和其他感兴趣的用户产生兴趣。各方表示支持。然而，其他人则更加保守，只有在我们处于主线时才会开始投资它，即如果已经做出是否使用 Rust 的决定。但是，Greg Kroah-Hartman 说，由于一些不同的原因，Binder“驱动程序”并不是一个很好的例子。它缺少一个相当大的功能（binderfs），但它也几乎没有帮助展示 Rust 将如何与内核的其余部分相适应。和以前一样，他强烈建议做一些有助于解决内核开发人员对 Rust 的一些问题的工作：并不是说它没有用途，而是 Binder 和内核其余部分之间的交互非常小且具体. 几乎没有人会再写的东西。请在一个真正的驱动程序上工作，以帮助证明或反驳这一切都能正常工作。有很多悬而未决的问题需要解决，当你做这样的事情时，你会遇到这些问题。\nRust 证明自己的主题也出现在 ksummit-discuss 邮件列表上的一个线程中。 6 月底，Ojeda 在今年的 Linux PlumbersConference 上提出将 Rust for Linux 作为 Kernel Summit 赛道的技术主题。 7 月 6 日，Linus Walleij 回复，同意这是一个应该讨论的话题。他指出，内核开发人员已经需要关注很多语言（例如 C、汇编、Make、Bash、Perl、Python 等），所以他心中的一个问题是 Rust 将带来什么值得添加到列表中。该消息引发了关于 Rust 如何适合以及实验将走向何方的讨论。内核开发人员显然有些担心必须了解 Rust 才能继续开发内核。Ojeda 试图在一定程度上减轻这些担忧，但承认大多数内核开发人员最终需要了解该语言。 Ojeda 说，目前，该项目的目的是与希望向其子系统添加 Rust API 的维护者合作。这将在内核中引导对 Rust 的支持，并有助于缓解 Leon Romanovsky、JamesBottomley 和其他。 Romanovsky 担心在具有两种语言的驱动程序的系统中进行重构，尤其是跨子系统重构。 Bottomley 建议 Rust 代码的审阅者会更少，所以 bug 更容易溜进来：由于我们现在的大多数 CVE 类型问题通常是编程错误，缺乏审阅可能会导致编程错误类型错误的增加，这些错误不是被禁止的更安全的内存模型。在短期内，这些都是需要解决的问题，但目标是让 Rust 知识在内核开发人员中得到更广泛的传播。正如 Ojeda 所说：毕竟，如果我们要将 Rust 作为内核中的第二语言，我们应该尝试在合理的时间范围内让尽可能多的人加入，至少在某种程度上是这样。正如 Laurent Pinchart 指出的那样，这是一个重要的观点，需要在讨论中更明确地强调：[...] 在内核中采用 Rust 作为第二语言不仅仅是一个影响有限的技术决定，也是一个过程决定这将为大多数内核开发人员学习 Rust 创造条件。这是否应该和将会发生是我们正在辩论的问题，但无论结果如何，正确地表达问题并广泛地了解其含义是很重要的。当然，还有很多技术障碍需要清除。这些领域之一是 Linux 驱动程序模型和随之而来的对象生命周期处理。 Roland Dreier 建议像 devres（即管理设备资源）这样的接口可以避免很多他在驱动程序中看到的关于生命周期管理的问题，特别是错误路径，但它没有被广泛采用。 Walleij 不同意它没有被广泛使用，但完全不确定 Rust 开关是否更好：我认为这是一个巨大的成功，人们只需要学习更多。但是，如果学习更好行为的更简单的方法是洗牌整个棋盘并用 Rust 编写的驱动程序替换它，我不知道？也许？对于 Kroah-Hartman 来说，在 Rust 中看到内核的真实驱动程序将有助于弄清楚这些问题将如何在语言中解决。有一些难题需要解决：这将是“有趣的” Rust 工作的一部分，它必须弄清楚如何将我们当前在驱动程序模型中拥有的引用计数对象映射到 Rust 控制的对象并保持一切正确同步。对于普通代码，内存被分配给一个特定对象（结构设备）但还被另一个对象（cdev）引用的事实。像这样的 devm_* 用户似乎没有意识到这里发生了两个单独的对象生命周期，因为交互有时很微妙。我很期待 Rust 实现将如何处理所有这些，因为我不知道。\n还有一个问题是所有这些导致了哪里。 Walleij 想知道内核（即驱动程序）的“叶节点”是否实际上是从展示语言优势的角度出发的最佳位置。他还在 4 月份的长篇消息中询问了这一点。他的部分问题是决定从驱动程序开始是否是出于其他原因：如果首先做设备驱动程序的整个基本原理是战略性的，不一定会给该设备驱动程序子系统带来任何好处，而是作为试验场和试验场，那么该战略需要明确并被每个人理解。因此，虽然我们理解 Rust 作为所有这些 $UPSIDES 首先做设备驱动程序纯粹是战略性的，对吗？我认为也提到了如果它没有解决就可以撤回整个事情的能力？他还询问了用 Rust 编写整个子系统的问题。这将需要将 Rust API 暴露给内核中其他地方的 C 代码。它也有可能允许在内核中向越来越多的 Rust 演进：如果我们想在 Rust 中*编写*一个子系统，那么它当然会以另一种方式：Rust 需要将 API 暴露给 C。我假设宏伟的愿景是在那之后，Rust 将一次吃掉 Linux。如果它证明比 C 更好，那就是。 Ojeda 说，虽然可以将 Rust API 暴露给系统的 C 部分，但他不建议这样做。问题是 C 调用者失去了 Rust 带来的很多好处：一般来说，我会避免将 Rust 子系统暴露给 C。当然，这是可能的，并且它在*实现*中为您提供了 Rust 的优势子系统。然而，由于必须公开一个 C API，你将失去更丰富的类型系统的大部分优势，以及 Rust 作为一种语言为子系统的消费者带来的保证。类似地，约翰内斯·伯格询问是否用 Rust 替换子系统的部分，但将驱动程序留在 C 中——有效地与现有计划相反。 Ojeda 再次表示这是可能的，但告诫不要失去 Rust 功能和保证。此外，有些架构此时没有 Rustcompiler 可用，因此现在考虑基于 Rust 的子系统可能还为时过早。该项目的最终目标并不完全清楚。如果所有的 Linux 驱动程序都是用 Rust 编写的，那么仍然会有很多重要的部分运行不安全的 C；如果 Rust 同时证明自己，下一步是否会取代那些？但在这种情况下，“证明自己”的实际含义也不清楚。学习一门具有所有不同行为、怪癖和特质的新语言，对于已经在维护现有内核代码中处理相当多的复杂性的开发人员来说是一个非常大的要求。更不用说在已有功能的基础上提供新功能的额外复杂性。两个线程（和其他地方）的评论者似乎相当普遍的怀疑态度可能源于这种学习负担。将 Rust 添加到内核需要大量工作，对于很多不同的人来说，除了承诺之外，没有明确和明显的好处，只有用 Rust 编写的整个内核才能真正完全实现。 幸运的是，该项目可以提供一些明确的“胜利” “在早期，这清楚地展示了该语言的潜力和在像内核这样的大型复杂代码库上增量使用的能力。没有它，项目可能很难在“生锈”内核的目标上取得很大进展。\n（登录发表评论）&gt; Ojeda 试图在一定程度上减轻这些恐惧，但确实承认大多数内核开发人员最终需要了解该语言。我认为这是指这封电子邮件：https://lwn.net/ml/ksummit-discuss/CANiq72=LrxpE_2WmdDdb5...基本上它似乎是在说如果项目成功，最终结果应该是，如果你想要更改具有 Rust 绑定的 API，那么您需要了解这些 Rust 绑定，以便您也可以调整它们。这很有意义，如果您更改破坏其他内核代码的内核代码，那么您需要修复其他代码。但它确实清楚地说明了这个项目的范围以及承诺这个项目的决定有多大。为什么在 LWN 文章中如此偏向于谈论 Rust？我的意思是，这个补丁集可能（希望）永远不会合并，它的 lwn 文章与发布的版本一样多。在这里发现了多少重要的补丁集到 v2+（并且有机会登陆）？这是一个关于内核项目未来的基本决定；它似乎值得多看一看。借调。有史以来最重要的变化之一。请继续在更多报道而不是更少方面犯错。你不喜欢的偏见是我喜欢的偏见。有些人想要改善 Linux 环境。他们的努力可能会被拒绝，因为他们最终不符合合理的进入标准。这无关紧要。相关的是他们有一个与大多数其他改进工作完全不同的目标，并且相信它足以花费资源（时间、金钱等）。如果他们失败了，那么这种失败将影响未来的努力，包括 Rust 以外的语言。很好的答案，谢谢！最重要的是，Rust 可能会给 Linux 内核带来新的开发人员，否则他们不会接触它。 Rust 是一种适销对路的编程语言，C 是传统语言。从任何现代编程语言切换到 C 感觉就像进入了雷区。从用户空间到内核开发时更是如此。\n&gt; 从任何现代编程语言切换到 C 感觉就像进入了雷区。从用户空间到内核开发时更是如此。确切地。 C有很多footguns。 C++ 有更多的脚步声。你可以用 C++ 编写漂亮、干净、简洁的代码……但你无法避免它们——尤其是当编译器开发人员每年向语言中添加越来越多的代码时。 Rust 不会试图从语言中删除footguns（实际上，当您对内核进行编程时这基本上是不可能的），而是尝试确保它们中的每一个都被标记为不安全。这就是为什么从理论上讲，驱动程序听起来是最有希望移植到 Rust 的原因：它们通常是由硬件人员编写的，他们没有判断所有这些步枪的经验。并且，希望 API 可以提供给他们，允许他们在默认的、安全的、Rust 中编写驱动程序。但是如果你将内核的核心重写为 Rust ......收益会小得多：你越接近核心数据结构的黑暗魔法，就会有更多的内在脚步。这也是为什么为真正的硬件实现真正的驱动程序是一个重要的里程碑：某些讨厌的脚步声存在于内核中，因为它们是与硬件交互的固有特性，很高兴看到甚至移植一个驱动程序需要多大的胶水代码。如果胶水代码比实际的驱动程序代码多，这很好（它最终会与所有驱动程序共享，所以这没什么大不了的），但是如果驱动程序本身充满了许多不安全的块，那么整个练习就会变成有点无意义。 Rust 并没有试图彻底删除footguns 是不正确的。一些 C++ 步炮，尤其是继承自或建立在 C 兼容性基础上的 C++ 步炮（即使它们不一定是 C 中的步炮）是被遗忘的过去的遗物。例如，为什么允许“char” _either_ 有符号或无符号并且由实现来选择？因为当时的硬件千差万别。快进到 21 世纪，没有人希望他们在他们使用的 CPU 上拥有更快的 Rust i8 和 u8。那不是一回事。所以，如果你想要 i8 你就要求 i8，如果你想要 u8 你就要求 u8，因此你不能因为得到一种不是你想象的类型而大吃一惊。同样，为什么有符号整数在溢出时有未定义的行为？古代硬件以多种方式表示负数。因此，为了最大的兼容性，C 无法指定会发生什么。也许应该说平台定义，现在太晚了。很好，但是今天可用的每个平台都有二进制补码算法，所以这没有用。 Rust 可以预先说明这一点。调试造成恐慌！如果您溢出，如果错误一直存在到 Production ，您将获得二进制补码算法并祝您好运。如果您明确_想要_包装或饱和算术（后者在音频中尤其有意义），您可以在 Rust 中请求它们，无论是用于一个操作（例如饱和加法）还是作为变量的类型，您都会得到您想要的要求，没有恐慌，编译器为这种情况生成了良好的优化代码。但是，即使没有消除溢出的“未定义行为”的脚步。有时编译器变得更好，我们不再需要说明可以推断出什么。 C 和 C++ 都有一对一元增量运算符。他们是步兵。 b++ 和 ++b 都比 b += 1 的输入要少一些，但是它们将很多出错的机会挤进了这么少的字符中。为什么是其中两个？因为 C 和 C++ 使这些一元运算符具有结果以及它们的赋值效果，即使您很少需要它，并且结果是不同的。在 Rust 中，一元增量不存在，其他赋值运算符没有结果（严格来说，它们的结果是空元组），如果你的意思是 a = b; b+= 1 你可以这样写，如果你的意思是 b+= 1; a = b 你可以这样写。别担心，现代编译器很聪明，你不会因为输入稍微多一点而得到更慢的代码。有时同时明确问题范围。 Rust 缺少 C 和 C++ 的“volatile”关键字，我之前曾详细讨论过。该关键字可能是错误的。它在 Unix 中的用途在 Rust 中作为一组名为 volatile_read 和 volatile_write 的编译器内部函数存在（一组因为它们有不同的大小，事实证明你的硬件知道你是写了一个 32 位整数还是两个 16 位整数整数到内存），并且它在 C 或 C++ 中被错误地滥用的许多事情今天在这些语言中被明确禁止，因为它们无法工作。所以在实践中，Rust 的 volatile_read/ volatile_write 和 C++ volatile 关键字之间的差距只是你通过没有那种类型限定符而避免的。除了与 unsafe 关键字本身相关的事情（例如调用不安全的函数），我相信 Rust 只允许你在不安全的代码中做 3 件事，而你在安全代码中是不允许做的。您可以取消引用原始指针。您可以访问联合中的字段。你可以改变静态。就这样。这些确实是潜在的枪支（谁知道原始指针指向什么，如果有的话；也许联合中的那个字段不是其中包含有效数据的字段；嘿，另一个线程正在读取该静态变量，似乎在更改它）像一个坏主意）但这是一个比你预期的要小得多的集合。 &gt; 也许应该说平台定义，现在太晚了。为什么为时已晚？正确的程序将保持正确，而错误的程序（他们的作者认为是正确的！）将变得真正正确。\n事实上，这正是应该发生的事情：未定义的行为使实现者许可不捕获某些难以诊断的程序错误。它还确定了可能符合语言扩展的领域：实现者可以通过提供官方未定义行为的定义来扩充语言（强调我的）。签名溢出被声明为“未定义”没有......", "note_en": "This article brought to you by LWN subscribers Subscribers to LWN.net made this article — and everything that surrounds it — possible. If you appreciate our content, please  buy a subscription and make the next set of articles possible.\n   On July 4, the  Rust for Linux project postedanother version of its patch set adding support for the language to thekernel. It would seem that the project feels that it is ready to be considered formerging into the mainline. Perhaps a bigger question lingers, though: is the kerneldevelopment community ready for Rust? That part still seems to be up in the air.\n  Miguel Ojeda, who has been hired to  work onthe project full-time, posted the patch set; in the cover letter, he listed anumber of changes and updates since the  RFC patchset was  posted back in April. Inparticular, the allocations that would call  panic!() when theyfailed have beenreplaced. A modified version of the   alloc crate has been created for thekernel project, though the plan is for the changes to work their wayinto the upstream project so that the customized version can eventually be dropped.Incidentally, the patch adding the modified crate was  apparentlytoo large for the lore archive, though it does  showup in the LWN archive.\n There is more progress on Rust abstractions for kernel facilities,including &#34; red-black trees, reference-counted objects, filedescriptor creation, tasks, files, io vectors...&#34;, he said, as wellas additions for driver support. Beyond that, theRust driver for the  Android Binder interprocesscommunication mechanism has more features and there is ongoing work on a driver forthe hardware random-number generator available on some Raspberry Pi models.\n But the lack of a &#34;real&#34; driver was one of the sticking points back inApril, and it was raised again this time. Christoph Hellwig  said that he wasstrongly against merging the code if that was the intent of the posting.In the cover letter, Ojeda said that the patch set was being added to linux-next, andhe  confirmedthat it is being submitted for merging. Hellwig wants to see Rust proveitself before being included: [...] prove it actually is useful first. Whereuseful would be a real-life driver like say nvme or a usb hostcontroller driver that actually works and shows benefits over theexisting one. Until it shows such usefulness it will just drageveryone else down.\n Ojeda pointed at the Binder driver as a &#34; non-trivial module&#34;that &#34; is already working&#34;, but acknowledged that a realhardware driver is an important (and, as yet, missing) piece. But the coverletter listed a number of organizations that are interested in or involved withthe project already, and Ojeda believes that is also something that ishelping to prove the project: It is &#34;proven&#34; in the sense we are already starting to get usersdownstream and other interested parties have shown support. However, others are more conservative and will only start investinginto it if we are in mainline, i.e. if the decision of having Rust ornot is already taken.\n But the Binder &#34;driver&#34; is not really a good example to use for a few differentreasons, Greg Kroah-Hartman  said. It ismissing a fairly large piece of functionality (binderfs) for one thing, but it also doeslittle to help show how Rust will fit in with the rest of the kernel. Asbefore, he strongly recommended working on something that would help clearup some of the questions that kernel developers have about Rust: Not to say that it doesn&#39;t have its usages, but the interactions betweenbinder and the rest of the kernel are very small and specific.Something that almost no one else will ever write again. Please work on a real driver to help prove, or disprove, that this allis going to be able to work properly. There are huge unansweredquestions that need to be resolved that you will run into when you dosuch a thing.\n  The theme of Rust proving itself was also present in a thread on the ksummit-discuss mailinglist. At the end of June, Ojeda  proposedRust for Linux as a technical topic for the Kernel Summit track at thisyear&#39;s  Linux PlumbersConference. On July 6, Linus Walleij  replied, agreeing that it was a topic that should be discussed. He noted that thereare already quite a few languages that kernel developers need to beup on (e.g. C, assembly, Make, Bash, Perl, Python, ...), so a question inhis mind is what Rust will bring to the table that makes it worth adding tothe list.\n That message started the ball rolling on a discussion of how Rust fits—andwhere the experiment leads. There is clearly some concern among kerneldevelopers about having to know Rust to continue working on the kernel.Ojeda tried to allay those fears to a certain extent, but did acknowledgethat most kernel developers would eventually need to understand thelanguage. For now, the intent is for the project to work withmaintainers that want to add a Rust API to their subsystem, Ojeda  said.That will bootstrap support for Rust within the kernel and will help alleviate some ofthe concerns expressed by   Leon Romanovsky, JamesBottomley, and others.\n Romanovsky was worried about refactoring, especially cross-subsystemrefactoring, in a system with drivers in both languages. Bottomleysuggested that there would be fewer reviewers for the Rust code, so bugscould more easily slip in: Since most of our CVE type problems are usuallyprogramming mistakes nowadays, the lack of review could contribute toan increase in programming fault type bugs which aren&#39;t forbidden bythe safer memory model.\n In the near term, those are problems that will need to be dealt with, butthe goal is to get to a point where Rust knowledge is more widespread amongkernel developers. As Ojeda  putit: After all, if we are going to have Rust as a second language in thekernel, we should try to have as many people on board as possible, atleast to some degree, within some reasonable time frame.\n As Laurent Pinchart  pointedout, that is an important point and one that needs to be more clearlyhighlighted in the discussion: [...] adopting Rust asa second language in the kernel isn&#39;t just a technical decision withlimited impact, but also a process decision that will create arequirement for most kernel developers to learn Rust. Whether thatshould and will happen is what we&#39;re debating, but regardless of theoutcome, it&#39;s important to phrase the question correctly, with a broadview of the implications.\n There are, of course, plenty of technical hurdles that need to be clearedas well. One of those areas is the Linux driver model and theobject-lifetime handling that goes along with it. Roland Dreier  suggestedthat interfaces like  devres(i.e. managed device resources) could have avoided a lot of problems thathe has seen in drivers regarding lifetime management, and error paths in particular, butthat it has not been adopted widely. Walleij  disagreedthat it hasn&#39;t been widely used, but is not at all sure that a Rust switch is better: I think it&#39;s a formidable success, people just need to learn to do it more. But if an easier path to learn better behaviours is to shuffle the wholechessboard and replace it with drivers written in Rust, I don&#39;t know?Maybe?\n For Kroah-Hartman, seeing real drivers in Rust for the kernel would help clear up how these problems are going to be solved in the language.There are some difficult problems that will need to be tackled: This is going to be the &#34;interesting&#34; part of the rust work, where ithas to figure out how to map the reference counted objects that wecurrently have in the driver model across to rust-controlled objects andkeep everything in sync properly. For the normal code, the fact that the memory was assigned to onespecific object (the struct device) but yet referenced from anotherobject (the cdev). devm_* users like this do not seem to realize thereare two separate object lifecycles happening here as the interactionsare subtle at times. I am looking forward to how the rust implementation is going to handleall of this as I have no idea.\n There is also the question of where all of this leads. Walleij  wonderedwhether the &#34;leaf nodes&#34; of the kernel (i.e. drivers) are actually the best place to startfrom the perspective of showing the benefits of the language. He also  askedabout that in a lengthy message back in April. Part of his question iswhether thedecision to start with drivers was made for other reasons: If the whole rationale with doing device drivers first is strategic,not necessarily bringing any benefits to that device driversubsystem but rather serving as a testing ground and guineapig, then that strategy needs to be explicit and understoodby everyone. So while we understand that Rust asall these $UPSIDES doing device drivers first is purelystrategic, correct? I think the ability to back out the wholething if it wasn&#39;t working out was mentioned too?\n He also asked about writing whole subsystems in Rust. That would entail exposingRust APIs to C code elsewhere in the kernel. It would also potentially allowan evolution toward more and more Rust in the kernel: If we want to *write* a subsystem in Rust then of course it willgo the other way: Rust need to expose APIs to C. And I assumethe grand vision is that after that Rust will eat Linux, one pieceat a time. If it proves better than C, that is.\n Ojeda  saidthat while it is possible to expose Rust APIs to the C part of the system,he does not recommend it. The problem is that the C callers lose much ofthe benefit that Rust brings to the table: In general, I would avoid exposing Rust subsystems to C. It is possible, of course, and it gives you the advantages of Rust inthe *implementation* of the subsystem. However, by having to expose aC API, you would be losing most of the advantages of the richer typesystem, plus the guarantees that Rust bring as a language for theconsumers of the subsystem.\n In a similar vein, Johannes Berg  askedabout replacing parts of a subsystem with Rust, but leaving the drivers inC—the reverse of the existing plan, effectively. Once again, Ojeda  saidthat its possible, but cautioned about losing Rust features andguarantees. In addition, there are architectures where there is no Rustcompiler available at this point, so it may be premature to be looking atRust-based subsystems.\n  The project&#39;s eventual goal is not entirely clear. If all of the Linux drivers were written in Rust, there would still be lotsof big important pieces that are running unsafe C; is the next step toreplace those if Rust proves itself in the meantime? But it is alsounclear what &#34;proves itself&#34; actually means in this context.\n Learning a new language, with all of its different behaviors,quirks, and idiosyncrasies,is a pretty big ask for developers who are already juggling a fair amountof complexity in maintaining the existing kernel code. Not to mention the addedcomplexity of providing new functionality on top of what&#39;s already there. Theskepticism that seems fairly prevalent from commenters in both threads (andelsewhere) likely stems from that learning burden.\n Adding Rust to the kernel requires a lot of work, for a lot ofdifferent people, without a clear and obvious benefit beyond promises thatcan only truly be fully fulfilled with a whole kernel written in Rust.With luck, the project can provide some clear &#34;wins&#34; in the early goingthat clearly demonstrate both the potential of the language and an abilityto be utilized incrementally on a large and complex code base like thekernel. Without that, it may be difficult for the project to progress veryfar in the goal of &#34;rustifying&#34; the kernel.\n     ( Log in to post comments)\n  &gt; Ojeda tried to allay those fears to a certain extent, but did acknowledge that most kernel developers would eventually need to understand the language.  I think this is referring to this email:  https://lwn.net/ml/ksummit-discuss/CANiq72=LrxpE_2WmdDdb5...  Basically it seems to be saying that if the project is a success the end result should be, if you want to change APIs which have Rust bindings, then you need to understand those Rust bindings so you can adjust them as well.  Which makes a lot of sense, if you change kernel code which breaks other kernel code, then you need to fix that other code. But it does make clear the scope of this project and how big a decision it is to commit to this.\n  Why such a bia in LWN articles to talk about rust? I mean, this patchset, that will probably (hopefuly) never get merged, has as many lwn articles as versions published. How many important patchsets got to a v2+ (and with a chance to land) were uncovered here?\n This is a fundamental decision about the future of the kernel project; it seems worthy of more than one detailed look.\n Seconded. One of the most important changes ever considered. Please continue to err on the side of more coverage rather than less.\n  The bias that you do not like is a bias that I like.  There are people that want to improve the Linux environment. Their effort might be rejected because they end up not meeting the reasonable entry criteria. And that is not relevant.  What is relevant is that they have a goal that is quite different to most other improvement efforts, and believe in it enough to spend resources (time, money, etc). And if they fail, then that failure will inform future efforts, including languages other than Rust.\n Excellent answer, thank you! On top of that Rust may bring new developers to Linux kernel who would not touch it otherwise. Rust is a marketable programming language, C is legacy. Switching from any modern programming language to C feels like going to a minefield. Even more so when going from userspace to kernel development.\n &gt; Switching from any modern programming language to C feels like going to a minefield. Even more so when going from userspace to kernel development. Exactly. C have lots of footguns. C++ have  even more footguns. You can write nice, clean, concise code in C++… but you can&#39;t avoid them — especially when compiler developers add more and more of them to the language each year.\n Rust doesn&#39;t try to remove footguns from the language (indeed, when you are programming the kernel that&#39;s basically impossible) but tries to make sure each and every one of them is marked as  unsafe.\n That&#39;s why driver sounds, in theory, most promising thing to port to Rust: they are often written by hardware guys, who are not experienced with judging all these footguns. And, also, hopefully, API can be presented to them which allows them to write drivers in default, safe, Rust.\n  But if you rewrite core of kernel into Rust… gains would be much smaller: the closer to the dark magic of core data structures you come the more  inherent footguns would be there.\n And that&#39;s also why implementing real driver for real hardware is important milestone: certain nasty footguns live in kernel because they are inherent to interaction with hardware and it would be nice to see how large the glue code would be needed to even port one driver. It&#39;s fine if there would be more glue code than actual driver code (it would, eventually, be shared with all drivers so it&#39;s not a big deal), but if the driver itself would be peppered with numerous  unsafe blocks then the whole exercise would become a bit pointless.\n It&#39;s not true that Rust doesn&#39;t try to outright remove footguns.  Some of the C++ footguns, especially C++ footguns inherited from, or founded upon C compatibility (even if they weren&#39;t necessarily footguns in C) are relics of a forgotten past. For example, why is &#34;char&#34; allowed to be _either_ signed or unsigned and it&#39;s up to the implementation to choose? Because the hardware at the time varied. Fast forward to the 21st century and nobody wishes they had whichever of Rust&#39;s i8 and u8 is faster on the CPU they&#39;re using. That isn&#39;t a thing. So, if you want i8 you ask for i8 and if you want u8 you ask for u8, and you thus can&#39;t blow your foot off by getting a type that isn&#39;t what you thought it would be.  Likewise, why do the signed integers have undefined behaviour on overflow? Ancient hardware represented negative numbers in several ways. So, for maximum compatibility C can&#39;t specify what happens. Maybe it should have said platform defined, too late now. Great, but every platform available today has two&#39;s complement arithmetic, so this serves no purpose. Rust gets to just say this up front. Debug builds panic! if you overflow, if the mistake survives until Production you get two&#39;s complement arithmetic and good luck with that. If you explicitly _want_ wrapping, or saturating arithmetic (the latter especially could make sense in audio), you can ask for them in Rust, either for one operation (e.g. a saturating addition) or as the type of a variable and you get what you asked for, no panics, the compiler produces good optimised code for this case. But even if not the footgun of &#34;Undefined behaviour&#34; for overflow is banished.  Sometimes compilers got better and we no longer need to spell out what can be inferred. C and C++ both have the pair of unary increment operators. They are footguns. Both b++ and ++b are a bit less typing than b += 1 but they squeeze a lot of opportunity for mistakes into so few characters. Why two of them? Because C and C++ make these unary operators have a result as well as their assignment effect, even though you rarely need it, and the results are different. In Rust the unary increments don&#39;t exist, and the other assignment operators do not have a result (strictly, their result is the empty tuple), if you mean a = b; b+= 1 you can write that, and if you mean b+= 1; a = b you can write that instead. Don&#39;t worry, a modern compiler is smart, you don&#39;t get slower code just because it was slightly more typing.  Sometimes the problem scope was meanwhile clarified. Rust lacks C and C++&#39;s &#34;volatile&#34; keyword which I&#39;ve talked about before at some length. That keyword is probably a mistake. The thing it was intended for in Unix exists in Rust as a set of compiler intrinsics named volatile_read and volatile_write (a set because they come in different sizes, it turns out your hardware knows whether you wrote a 32-bit integer or two 16-bit integers to memory), and many of the things it was mistakenly abused to do in C or C++ are specifically outlawed in those languages today because they can&#39;t work. So in practice the gap between Rust&#39;s volatile_read/ volatile_write and C++ volatile keyword is just footguns you avoided by not having that type qualifier.  Aside from things related to the unsafe keyword itself (e.g. calling unsafe functions) I believe Rust only lets you do 3 things in unsafe code that you weren&#39;t anyway allowed to do in safe code. You can dereference a raw pointer. You can access fields in a union. You can mutate statics. That&#39;s all. Those are indeed potential footguns (who knows what, if anything, that raw pointer is pointing at; maybe that field in the union isn&#39;t the one with valid data in it; hey, another thread is reading that static variable, changing it seems like a bad idea) but that&#39;s a much smaller set than you might have expected.\n &gt; Maybe it should have said platform defined, too late now. Why is it too late? Correct programs would stay correct and incorrect programs (which their authors perceive as correct!) would become truly correct.\n In fact his is  exactly  what was supposed to happen:  Undefined behavior gives the implementor license not to catch certain program errors that are difficult to diagnose. It also identifies areas of possible conforming language extension:  the implementor may augment the language by providing a definition of the officially undefined behavior (emphasis mine).\n Signed overflow was declared “undefined” no\n......", "posttime": "2021-07-24 18:31:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,rust", "title": "用于 Linux Redux 的 Rust", "title_en": "Rust for Linux Redux", "transed": 1, "url": "https://lwn.net/Articles/862018/", "via": "", "real_tags": ["linux", "rust"]}, {"category": "", "categoryclass": "", "imagename": "87e36d4a62e14082e08a95be63666f87.png", "infoid": 1069437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周我有两件特别重要的事情要展示！不是 Steam Deck 级别的大，但我认为还是很酷的。 🙂 首先，David Redondo 和 Kai Uwe Broulik 实现了电源配置文件功能！这允许您指定计算机应如何平衡能源使用与性能。您可以随时使用电池和亮度小程序切换模式，并且您可以配置在插入或拔出电源线时自动使用哪个配置文件。当使用 Linux Kernel 5.12 或更高版本时，该功能将在 Plasma 5.23 中可用，并且支持它的较新计算机。接下来，Plasma 5.20 中引入的新 Kickoff 启动器菜单进行了巨大的代码修改，修复了许多错误，提高了性能和可访问性，收紧了用户界面，并添加了一些常见的功能。修复：页脚中的电源/会话项目或侧边栏中的项目的长文本不再被忽略；相反，布局水平延伸以容纳它们使用箭头键导航搜索结果列表不再丢弃第一次击键您现在可以选择是对所有应用程序视图使用列表还是网格，而不仅仅是收藏夹类别 Pin 按钮具有已添加，因此您现在可以根据需要将其打开——就像您可以为系统托盘、数字时钟和 KRunner 做的一样\n非常感谢诺亚戴维斯完成这个彻底的改变！它将在 Plasma 5.23 中发布。现在可以更改系统监视器中的传感器标签并提供自定义文本（David Redondo，Plasma 5.23）系统设置登录屏幕页面的同步功能现在也同步您的屏幕排列，以便登录屏幕 UI 正确定位在您的所有物理屏幕上（Aleix Pol Gonzalez，Plasma 5.23）：Dolphin 上下文菜单中的“开始幻灯片”菜单项现已翻译（Yuri Chornoivan，Gwenview 21.08）如果故意固定，打开数字时钟小程序的设置对话框不再关闭小程序的弹出窗口打开 (David Redondo, Plasma 5.22.3) 系统托盘扩展弹出窗口中的网格项目现在总是完全像素对齐，因此它们不会变得模糊 (Derek Christ, Plasma 5.22.4) 在桌面项目的上下文菜单中，按当子菜单打开时，用于在“移至垃圾箱”和“删除”之间切换的 shift 键现在可以工作（Derek Christ，Plasma 5.22.4）\n桌面文件在文件名中包含大写字符的应用程序的全局快捷方式现在可以正常工作，并且它们在“系统设置快捷方式”页面中的条目现在总是显示正确的图标（David Redondo，Plasma 5.22.4）带有嵌入链接的 Plasma 通知现在使用链接颜色来自 Plasma 主题而不是应用程序配色方案，修复了在这些不同的情况下的错误，例如应用 Breeze Twilight 主题时 (Kai Uwe Broulik, Plasma 5.22.4) Unsplash Picture of the Day 壁纸配置页面中的类别列表现在按字母顺序排序，而不是半随机排序（Arnaud Vergnet，Plasma 5.22.4）在 KRunner 中显示的来自使用 Plasma 浏览器集成的浏览器的网站图标现在在使用高 DPI 比例因子时非常清晰（Kai Uwe Broulik， Plasma 5.22.4) 打开系统设置用户反馈页面不再短暂地使 Discover 出现在任务管理器中 (Plasma 5.23) 在 Plasma Wayland 会话中，glob所有快捷方式再次工作，而否则会窃取焦点（在 X11 上）的弹出窗口打开（Andrey Butirsky，Plasma 5.33）现在每个 Dolphin 的缩放级别都有与其相关联的不同图标大小；不再会改变缩放级别有时会导致网格的大小发生变化，但图标保持相同的大小（Eugene Popov，Dolphin 21.12）\n当使用显示桌面效果时，使用自适应透明度功能的面板现在进入透明模式（David Edmundson，Plasma 5.22.4）在 Discover 中浏览应用程序列表时，应用程序来源的图标现在显示在按钮内还列出了源的名称（我：Nate Graham，Plasma 5.23）：标题栏中的问号按钮现在默认为对话框窗口隐藏（我：Nate Graham，Plasma 5.23）Plasma 日历小部件上的事件指示器点并且无论您使用何种配色方案或 Plasma 主题，数字时钟弹出窗口现在都更加明显（Carl Schwan，Framework 5.85）基于 Kirigami 的应用程序的“关于”页面现在显示“参与”链接，将您带到 https ://community.kde.org/Get_Involved（Felipe Kinoshita，Frameworks 5.85）：请记住，这个博客只涵盖了冰山一角！我没有时间关注其开发的大量 KDE 应用程序在这里没有展示，我也没有提到后端重构、改进的测试覆盖率和其他通常不面向用户的更改。如果您想了解更多信息，请查看 https://planet.kde.org/，在那里您可以找到其他 KDE 贡献者的博客文章，详细介绍了他们正在做的工作。看看 https://community.kde.org/Get_Involved 发现如何成为真正重要的项目的一部分。每个贡献者都对 KDE 产生了巨大的影响；你不是机器中的数字或齿轮！您也不必已经是程序员。我刚开始的时候不是。试试吧，你会喜欢的！我们不咬人！", "note_en": "This week I have two particularly large things to present! Not  Steam Deck levels of large, but still pretty cool, I think. 🙂\n First of all, David Redondo and Kai Uwe Broulik implemented the  power profiles feature! This allows you to specify how your computer should balance energy use against performance. You can switch modes at any time using the Battery and Brightness applet, and you can configure which profile gets used automatically when plugging or unplugging the power cord. The feature will be available in Plasma 5.23 with a newer computer that supports it when using Linux Kernel 5.12 or greater.\n   Next, the new Kickoff launcher menu that was introduced in Plasma 5.20  has received a gigantic code overhaul which fixes many bugs, improves performance and accessibility, tightens up the user interface, and adds a few commonly requested features. Among the fixes:\n Long text for  the power/session items in the footer or  items in the sidebar is no longer ever elided; instead the layout stretches horizontally to accommodate them\n Using the arrow keys to navigate the search results list  no longer discards the first keystroke\n        You  can now choose whether to use a list or a grid for all app views, not just the Favorites category\n A Pin button has been added, so you can now pin it open if you like–just like you can do for the System Tray, Digital Clock, and KRunner\n   Big thanks to Noah Davis for completing this exhaustive change! It will be released in Plasma 5.23.\n    Sensor labels in System Monitor  can now be changed and given custom text (David Redondo, Plasma 5.23)\n The System Settings Login Screen page’s synchronization feature  now syncs your screen arrangement as well, so that the login screen UIs are positioned properly on all your physical screens (Aleix Pol Gonzalez, Plasma 5.23):\n     The “Start a Slideshow” menu item in Dolphin’s context menu  is now translated (Yuri Chornoivan, Gwenview 21.08)\n Opening the Digital Clock applet’s settings dialog  no longer closes the applet’s popup if it has been deliberately pinned open (David Redondo, Plasma 5.22.3)\n    The grid items in the System Tray’s expanded popup  are now always perfectly pixel-aligned so they will not become blurry (Derek Christ, Plasma 5.22.4)\n  In the context menu for desktop items, pressing the shift key to switch between “Move to Trash” and “Delete”  now works when a sub-menu is open (Derek Christ, Plasma 5.22.4)\n Global shortcuts for apps whose desktop files have uppercase characters in their filenames  now work properly, and  their entries in the System Settings Shortcuts page now always display the correct icons (David Redondo, Plasma 5.22.4)\n Plasma Notifications with embedded links  now use the link color from the Plasma theme rather than the application color scheme, fixing bugs in cases where these differed such as when the Breeze Twilight theme is applied (Kai Uwe Broulik, Plasma 5.22.4)\n Category lists in the Unsplash Picture of the Day wallpaper’s configuration page  are now sorted alphabetically, rather than semi-randomly (Arnaud Vergnet, Plasma 5.22.4)\n Website Favicons displayed in KRunner that come from a browser using Plasma Browser Integration  are now nice and crisp when using a high DPI scale factor (Kai Uwe Broulik, Plasma 5.22.4)\n Opening the System Settings User Feedback page  no longer briefly makes Discover appear in the Task Manager (Plasma 5.23)\n In the Plasma Wayland session,  global shortcuts once again work while popups that would otherwise steal focus (on X11) are open (Andrey Butirsky, Plasma 5.33)\n     Every one of Dolphin’s zoom levels now has a different icon size associated with it; no longer will changing the zoom level sometimes cause the size of the grid to change but the icons stay the same size (Eugene Popov, Dolphin 21.12)\n Panels using the Adaptive Transparency feature  now enter transparent mode when the Show Desktop effect is in use (David Edmundson, Plasma 5.22.4)\n   When browsing app lists in Discover, the icon of the source that the app comes from  is now displayed inside the button that also lists the name of the source (me: Nate Graham, Plasma 5.23):\n    The question mark button in the titlebar  is now hidden by default for dialog windows (me: Nate Graham, Plasma 5.23)\n   Event indicator dots on the Plasma Calendar widget and the Digital Clock popup  are now more visible no matter what color scheme or Plasma theme you’re using (Carl Schwan, Frameworks 5.85)\n Kirigami-based apps’ “About” pages  now display a “Get Involved” link that takes you to  https://community.kde.org/Get_Involved (Felipe Kinoshita, Frameworks 5.85):\n   Keep in mind that this blog only covers the tip of the iceberg! Tons of KDE apps whose development I don’t have time to follow aren’t represented here, and I also don’t mention backend refactoring, improved test coverage, and other changes that are generally not user-facing. If you’re hungry for more, check out  https://planet.kde.org/, where you can find blog posts by other KDE contributors detailing the work they’re doing.\n  Have a look at  https://community.kde.org/Get_Involved to discover ways to be part of a project that really matters. Each contributor makes a huge difference in KDE; you are not a number or a cog in a machine! You don’t have to already be a programmer, either. I wasn’t when I got started. Try it, you’ll like it! We don’t bite!", "posttime": "2021-07-24 18:30:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kde,现在", "title": "本周 KDE：电源配置文件和更精美的 Kickoff", "title_en": "This week in KDE: Power profiles and a more polished Kickoff", "transed": 1, "url": "https://pointieststick.com/2021/07/23/this-week-in-kde-power-profiles-and-a-more-polished-kickoff/", "via": "", "real_tags": ["kde", "现在"]}, {"category": "", "categoryclass": "", "imagename": "4d1cd705c86a0441d676aeb20499fe81.jpg", "infoid": 1069436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今晚 Adam Barth 将带我们参观 Google 的新操作系统 Fuchsia。我们将看到一些事情是如何在幕后工作的，并写下...", "note_en": "Tonight Adam Barth will take us on a tour of Google's new operating System, Fuchsia.  We'll get to see how some things work under the hood as well as write o...", "posttime": "2021-07-24 18:30:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,fuchsia,adam", "title": "Fuchsia 操作系统之旅", "title_en": "A Tour of the Fuchsia Operating System", "transed": 1, "url": "https://www.youtube.com/watch?v=gIT1ISCioDY", "via": "", "real_tags": ["操作系统", "fuchsia", "adam"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伽利略项目研究小组的目标是使用标准科学方法确定 UAP 和类似 Oumuamua 的星际物体的性质，该方法基于对使用优化仪器收集的开放科学数据的透明分析。一张图片胜过千言万语。例如，在一英里距离外的人类尺度 UAP 物体表面的百万像素图像将允许区分标签：“X 国制造”与附近系外行星上的潜在替代品“ETC Y 制造”。我们的银河系。这一目标将通过使用分布在选定位置的中型、高分辨率望远镜和探测器阵列网络以及合适的相机和计算机系统搜索 UAP 来实现。数据将向公众开放，科学分析将是透明的。我们期待广泛的人工智能/深度学习 (AI/DL) 和算法方法来区分大气现象与鸟类、气球、商业或消费无人机，以及潜在的陆地或其他来源调查我们星球的技术对象，如卫星。为了实现高对比度成像，每个望远镜都将成为具有正交和互补能力的探测器阵列的一部分，从雷达、多普勒雷达和高分辨率合成孔径雷达到高分辨率、大型相机可见范围和红外波段望远镜。如果发现 ETC 正在使用 UAP 测量地球，那么我们必须假设 ETC 已经掌握了无源雷达、光学和红外技术。在这种情况下，我们对这种检测到的 UAP 的系统研究将通过高性能、集成和多波长探测器阵列得到加强。伽利略计划研究小组还将利用现有和未来的天文调查，例如未来在维拉·鲁宾天文台 (VRO) 进行的时空遗产调查 (LSST) [1]，来发现和监测星际访客的特性到太阳系。我们将概念化和设计，可能与感兴趣的太空机构或太空企业合作，一个准备发射的太空任务，通过拦截它们接近太阳的轨迹或使用地面勘测望远镜，对不寻常的星际物体（如“Oumuamua”）进行成像发现星际流星。发现潜在的 1 米或更小的可能正在探索地球的卫星，例如在地球上空几百公里的极地轨道上，可能在 2023 年及以后通过 VRO 变得可行，但如果雷达、光学和红外技术已被掌握ETC，然后可能需要地球上非常复杂的大型望远镜。我们将设计伽利略计划打算部署的先进算法和 AI/DL 对象识别和快速过滤方法，最初是在非轨道望远镜上。", "note_en": "The  Galileo  Project research group will aim to identify the nature of UAP and  ‘Oumuamua-like interstellar objects using the standard scientific method based on a transparent analysis of open scientific data to be collected using optimized instruments.\n    A picture is worth a thousand words.   For example, a megapixel image of the surface of a human-scale UAP object at a distance of a mile will allow to distinguish the label: “Made in Country X” from the potential alternative “Made by ETC Y” on a nearby exoplanet in our galaxy.  This goal will be accomplished by searching for UAP with a network of mid-sized, high-resolution telescopes and detector arrays with suitable cameras and computer systems, distributed in select locations. The data will be open to the public and the scientific analysis will be transparent.\n We anticipate extensive Artificial Intelligence/Deep Learning (AI/DL) and algorithmic approaches to differentiate atmospheric phenomena from birds, balloons, commercial or consumer drones, and from potential technological objects of terrestrial or other origin surveying our planet, such as satellites. For the purpose of high contrast imaging, each telescope will be part of a detector array of orthogonal and complementary capabilities from radar, Doppler radar and high-resolution synthetic aperture radar to high-resolution, large camera visible range and infrared band telescopes. If an ETC is discovered to be surveying Earth using UAP, then we have to assume that the ETC has mastered passive radar, optical and infrared technologies. In such a case, our systematic study of such detected UAP will be enhanced by means of high-performance, integrated and multi-wavelength detector arrays.\n   The  Galileo    Project  research group also will utilize existing and future astronomical surveys, such as the future Legacy Survey of Space and Time (LSST)   [1] at the Vera C. Rubin Observatory (VRO), to discover and monitor the properties of interstellar visitors to the Solar system.\n We will conceptualize and design, potentially in collaboration with interested space agencies or space ventures, a launch-ready space mission to image unusual interstellar objects such as  ‘Oumuamua by intercepting their trajectories on their approach to the Sun or by using ground-based survey telescopes to discover interstellar meteors.\n   Discovering potential 1 meter-scale or smaller satellites that may be exploring Earth, e.g., in polar orbits a few hundred km above Earth, may become feasible with VRO in 2023 and later, but if radar, optical and infrared technologies have been mastered by an ETC, then very sophisticated large telescopes on Earth might be required. We will design advanced algorithmic and AI/DL object recognition and fast filtering methods that the  Galileo    Project  intends to deploy, initially on non-orbiting telescopes.", "posttime": "2021-07-24 17:53:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高分辨率,high,uap", "title": "获取高分辨率、多探测器 UFO 图像", "title_en": "Obtain High-Resolution, Multi-Detector UFO Images", "transed": 1, "url": "https://projects.iq.harvard.edu/galileo/activities", "via": "", "real_tags": ["高分辨率", "high", "uap"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本网站需要启用 Cookie 才能运行。请确保 Cookie 已打开，然后重新访问所需的页面。", "note_en": "This site requires Cookies to be enabled to function. Please ensure Cookies are  turned on and then re-visit the desired page.", "posttime": "2021-07-24 17:53:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,deficits,cookie", "title": "从 Covid-19 中康复的人的认知缺陷", "title_en": "Cognitive deficits in people who have recovered from Covid-19", "transed": 1, "url": "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(21)00324-2/fulltext", "via": "", "real_tags": ["认知", "deficits", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "928dd585679d6f5abd6c098674702fb5.jpg", "infoid": 1069430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN) 根据丹麦的一项新研究，在过去 25 年中，与滥用大麻有关的精神分裂症病例比例有所增加。 1995 年，该国 2% 的精神分裂症诊断与大麻使用障碍有关。 2000 年，它增加到 4% 左右。研究发现，自 2010 年以来，这一数字增加到 8%。 “我认为利用我们的研究和其他研究来强调和强调大麻的使用并非无害是非常重要的，”哥本哈根心理健康研究中心副教授、该研究的作者 Carsten Hjorthøj 说。医学杂志 JAMA Psychiatry，通过电子邮件。 “不幸的是，有证据表明大麻越来越多地被视为一种无害的物质。这很不幸，因为我们发现它与精神分裂症、认知功能较差、物质使用障碍等有关，”Hjorthøj 写道。先前的研究表明，使用大麻的人患精神分裂症的风险更高，而这种关联尤其是由于大量使用这种药物。许多研究人员假设大麻的使用可能是一个“组成部分”，它与其他风险因素相互作用，导致这种情况。 “当然，我们的发现必须在其他地方复制才能得出确切的结论，”Hjorthøj 继续说道。 “但我确实相当有信心，我们会在有问题的大麻使用增加或大麻效力增加的地方看到类似的模式，因为许多研究表明，高效大麻可能是与精神分裂症相关的驱动因素.”全世界有数千万人使用大麻。在美国 19 个州和加拿大用于娱乐用途是合法的。在这些地方和其他一些地方，它还被批准用于治疗某些疾病。\n该研究称，丹麦的大麻使用和大麻使用障碍一直在增加——这种模式在全球范围内也有出现。娱乐性杂草在丹麦是非法的，但允许用于医疗目的。大麻使用障碍通常被定义为药物使用有问题：产生对杂草的耐受性；使用大麻的数量或时间比预期的要长；无法减少使用；花费大量时间获得、使用或从大麻的影响中恢复；放弃有利于大麻的重要活动和义务；尽管有负面后果，但仍继续使用该药物。精神分裂症是一种慢性、严重和致残的精神障碍。其症状可能包括妄想、思维障碍和幻觉。在世界范围内，精神分裂症影响着 2000 万人。没有治愈方法，因此医生会尝试通过药物和治疗来控制症状。 Hjorthøj 说，虽然一项研究表明丹麦的精神分裂症正在增加，但在其他国家，情况还不确定。在美国，美国国家心理健康研究所表示，很难准确估计精神分裂症的患病率，因为诊断很复杂，而且与其他疾病重叠。 “许多精神病学教科书指出，精神分裂症的发病率……随着时间的推移是恒定的，与地理位置无关，”Hjorthøj 说。 “这经常被用作反对大麻可能导致精神分裂症的假设的论据，”他补充道。 “然而，事实证明，支持这一观点的研究很少。”这项新研究基于丹麦国家健康登记处的数据，包括所有在 2000 年 12 月 31 日之前出生的丹麦人，他们在 1972 年 1 月 1 日至 2016 年 12 月 31 日的某个时间点年满 16 岁。\n该研究结果可能有助于解释“近年来观察到的精神分裂症发病率普遍增加”，并提供了一些支持，即“长期观察到的大麻与精神分裂症之间的关联可能在本质上是部分因果关系”，该研究称。伦敦国王学院精神病学、心理学和神经科学研究所社会行为与发展教授兼主席 Terrie Moffitt 指出，该研究评估了临床诊断为大麻治疗障碍的人，而不是一般使用该药物的人。 “这项对全国医疗记录的研究增加了重要的证据，表明被诊断出大麻使用障碍的患者现在比过去更容易患精神病，”研究大麻使用对婴儿潮一代心理健康影响的莫菲特，告诉伦敦科学媒体中心。然而，莫菲特说，大多数大麻使用者，即使是那些依赖它的人，也从不寻求治疗，许多人在消遣时使用它而不会出现问题。在此处注册，每周二与 CNN 健康团队的 Sanjay Gupta 博士一起获取结果。 “众所周知，寻求治疗的人往往有多种心理健康问题，而不仅仅是大麻问题，”莫菲特说。 “并且能够很好地管理大麻的休闲大麻使用者比无法管理大麻的依赖大麻的使用者多得多。”哈佛大学公共卫生学院流行病学和生物统计学系教授 Tyler J. VanderWeele 在与该研究同时发表的一篇社论中说，由于对大麻使用障碍的诊断不足，该研究中的估计可能是保守的.\n“大麻使用障碍不是大多数精神分裂症病例的原因，但它造成的比例不可忽视且不断增加。在讨论大麻使用合法化和监管时应该考虑到这一点，”VanderWeele 在评论中写道。", "note_en": "(CNN)The proportion of schizophrenia cases linked with problematic use of marijuana has increased over the past 25 years, according to a new study from Denmark.\n In 1995, 2% of schizophrenia diagnoses in the country were associated with cannabis use disorder. In 2000, it increased to around 4%. Since 2010, that figure increased to 8%, the study found.\n &#34;I think it is highly important to use both our study and other studies to highlight and emphasize that cannabis use is not harmless,&#34; said Carsten Hjorthøj, an associate professor at the Copenhagen Research Center for Mental Health and an author of the study published in the medical journal JAMA Psychiatry, via email.\n     &#34;There is, unfortunately, evidence to suggest that cannabis is increasingly seen as a somewhat harmless substance. This is unfortunate, since we see links with schizophrenia, poorer cognitive function, substance use disorders, etc,&#34; Hjorthøj wrote.\n    Previous research has suggested that the risk of schizophrenia is heightened for people who use cannabis, and the association is particularly driven by heavy use of the drug. Many  researchers hypothesize that cannabis use may be a &#34;component cause,&#34; which interacts with other risk factors, to cause the condition.\n  &#34;Of course, our findings will have to be replicated elsewhere before firm conclusions can be drawn,&#34; Hjorthøj continued. &#34;But I do feel fairly confident that we will see similar patterns in places where problematic use of cannabis has increased, or where the potency of cannabis has increased, since many studies suggest that high-potency cannabis is probably the driver of the association with schizophrenia.&#34;\n Around the world tens of millions of people use cannabis. It&#39;s legal for recreational use in  19 US states and Canada. In these and some other places, it&#39;s also approved to treat some medical conditions.\n  Cannabis use and cannabis use disorder have been increasing in Denmark, the study said --  a pattern that&#39;s also seen globally.  Recreational weed use is illegal in Denmark but is allowed for medicinal purposes.\n Cannabis use disorder is usually defined as a problematic use of the drug: developing tolerance to weed; using cannabis in larger amounts or over a longer period than intended; being unable to reduce use; spending a lot of time obtaining, using or recovering from the effects of cannabis; giving up important activities and obligations in favor of cannabis; and continued use of the drug despite negative consequences.\n  Schizophrenia is a chronic, severe and disabling mental disorder. Its symptoms may include delusions, thought disorder and hallucinations. Worldwide,  schizophrenia affects 20 million people. No cure exists, so doctors try to manage the symptoms with medications and therapy.\n While one study has suggested that schizophrenia is increasing in Denmark, in other countries the picture is uncertain, said Hjorthøj. In the US, the  National Institute of Mental Health said it&#39;s hard to obtain accurate estimates of the prevalence of schizophrenia because diagnosis is complex and it overlaps with other disorders.\n &#34;Many textbooks in psychiatry state that the incidence... of schizophrenia is constant over time and independent of geographical location,&#34; Hjorthøj said.\n &#34;And this has often been used as an argument against the hypothesis that cannabis could cause schizophrenia,&#34; he added. &#34;However, it turns out that there is very little research that would support this notion.&#34;\n  The new study was based on data from Denmark&#39;s national health registry and included all people in Denmark born before December 31, 2000, who were 16 years or older at some point from January 1, 1972, to December 31, 2016.\n The findings could help explain the &#34;general increase in the incidence of schizophrenia that has been observed in recent years&#34; and provides some support that the &#34;long-observed association between cannabis and schizophrenia is likely partially causal in nature,&#34; the study said.\n  The study assessed people who had a clinical diagnosis for cannabis treatment disorder, not general use of the drug, noted Terrie Moffitt, a professor and chair in Social Behaviour &amp; Development of the Institute of Psychiatry, Psychology, and Neuroscience at King&#39;s College London.\n &#34;This study of nationwide medical records adds important evidence that patients with diagnosed cannabis use disorder are more at risk for psychosis now than they used to be,&#34; Moffitt, who studies the effects of cannabis use on the mental health of the baby boomer generation, told the Science Media Centre in London.\n However, Moffitt said that most cannabis users, even those who are dependent on it, never seek treatment and many people use it recreationally without developing problems.\n Sign up here to get  The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n &#34;It is known that people who seek treatment tend to have multiple mental health problems, not solely cannabis problems,&#34; Moffitt said. &#34;And there are far more recreational cannabis users who manage cannabis well than cannabis-dependent users who cannot manage it.&#34;\n   In an editorial that accompanied the study, Tyler J. VanderWeele, a professor in the Departments of Epidemiology and Biostatistics at the Harvard T. H. Chan School of Public Health, said that the that estimates in the study could be conservative because of underdiagnosis of cannabis use disorder.\n &#34;Cannabis use disorder is not responsible for most schizophrenia cases, but it is responsible for a nonnegligible and increasing proportion. This should be considered in discussions regarding legalization and regulation of the use of cannabis,&#34; VanderWeele wrote in the commentary.", "posttime": "2021-07-24 17:52:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linked,研究", "title": "与大麻使用障碍有关的精神分裂症呈上升趋势", "title_en": "Schizophrenia linked to marijuana use disorder is on the rise", "transed": 1, "url": "https://edition.cnn.com/2021/07/22/health/marijuana-schizophrenia-study-wellness/index.html", "via": "", "real_tags": ["linked", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "计算机是了不起的工具，而互联网是一个了不起的网络，我们可以与任何连接的人分享我们想要的一切。就目前而言，大多数 Internet 是中立的，这意味着 ISP 必须向其客户提供 Internet 访问权限，并且不要根据目的地做出选择（例如某些网站的访问速度更快）。理解这一点很重要，这意味着您可以在家里或租用的专用服务器上托管自己的网站、自己的聊天服务器或自己的游戏服务器，这称为自托管。我想将标签自托管放在专用服务器上可能不会让每个人都同意，这是真的，这是一个灰色区域。自托管的反面是依靠一家公司为您完成工作，在他们的条件下，无论是否免费。自托管是关于自由的，您可以选择要运行的服务器、版本、功能和配置。如果您在家中自行托管，您还可以选择符合您需求的硬件（更多内存？更多磁盘？RAID？）。自托管不是一个完美的解决方案，您必须购买硬件、更换故障组件、进行系统维护以保持软件部分的活力。当你依赖一家公司或第三方提供服务时，你就会被他们的生态系统和他们的决定所束缚。一家公司可以随时停止你所依赖的东西，他们可以随时决定暂停你的账户，无需解释。毫无疑问，公司会努力让他们的服务变得有吸引力，然后将你锁定在他们的生态系统中。例如，如果您将所有项目转移到 github 上并开始深入使用 github 服务（不仅仅是一个简单的 git 存储库），那么离开 Github 将很复杂，因为您没有 _reversibility_，这意味着退出和从您的服务中获得帮助以离开而不丢失数据或信息。自托管赋予用户权力，而不是从中获利。如果在社区中完成，自托管更好，为一群人提供公共邮件服务器和联合到更大网络（例如 XMPP 或 Matrix）的通信服务器是创建弹性互联网的好方法，同时又不放弃您的权利给资本主义公司。要求每个人都托管自己的服务甚至不是乌托邦而是愚蠢的，我们不需要每个人都为自己的服务运行自己的服务器，我们应该建立一个使用联合协议连接的社区群，例如电子邮件、XMPP、 Matrix、ActivityPub（用于乳齿象、Pleroma、Peertube、Disapora* 的协议）。\n在法国，有一项名为 CHATONS（这是 KITTENS 的法语词）的伟大计划，它收集了具有一些先决条件（例如多个系统管理员）的关联托管，以避免依赖一个人。我想我的大多数读者会争辩说，自托管很好，但无法与“云”服务竞争，我承认这是真的。公司投入大量资金来提供优质的服务来吸引客户并赚钱，如果他们的服务不好，他们就不会存在太久。但是不使用开源和自托管不会使您的服务提供商的替代品变得更大，您会因为系统而成为问题的一部分。例如，Google Mail GMAIL 现在很大，他们可以决定哪些域可以访问，哪些不能。这是一个问题，大多数小型电子邮件服务器无法将电子邮件发送到 Gmail 而不会被视为垃圾邮件，我们对此无能为力，他们的用户越多，他们就越不关心其他提供商。 Peertube这样的开源联合服务可以取得很大的成就，可以在Peertube实例上托管视频并遵循实例的本地规则，而其他一些大公司可能会因为某些自动检测脚本找到一段音乐而禁用您的视频或不合适的图片。将您的数据提供给公司并依赖他们的服务会让您失去自由。如果你不认为这是真的，那也没关系，自由是一个模糊的概念，它伴随着高尺度的各种步骤。如果您想了解有关托管自己的服务的更多信息，这里有一些提示。问问你信任的人是否愿意参与，最好有不止一个人来管理服务器。\n您不需要成为 IT 专业人员，但您需要了解您必须学习。只要您能证明原因（例如，peertube 服务器的运行成本可能非常高），就可以要求（贡献或作为要求）金钱。周围的人通常会扔旧硬件，询问朋友或亲戚是否有旧的未使用的硬件。您可以轻松修复“由于 wifi 停止工作而更换的旧 Windows 笔记本电脑”并将其用作服务器。用电一定要考虑，但另一方面，买一个全新的硬件来节省20W并不一定更环保。由于特定要求，某些服务（例如电子邮件服务器）无法托管在大多数 ISP 连接上 冗余在大多数情况下是过大的，狗屎会发生，但在冗余服务器中狗屎经常发生两次 我是自托管 自从我第一次了解运行网络以来服务器是 15 年前我唯一需要拥有自己的 PHP 论坛的东西。我主要保持这个博客活跃以展示和分享我的实验，大部分时间发生在我的自托管服务器上。\n我对这个主题有强烈的看法，托管您自己的服务是学习新技能或完善它们的绝佳方式，但这对于自由也很重要。在法国，我们甚至有关联的 ISP，即使它们很小，它们的存在也迫使大型 ISP 公司对其流程和互操作性保持透明。", "note_en": "Computers are amazing tools and Internet is an amazing network, we can share everything we want with anyone connected. As for now, most of the Internet is neutral, meaning ISP have to give access to the Internet to their customer and don&#39;t make choices depending on the destination (like faster access for some websites).\n This is important to understand, this mean you can have your own website, your own chat server or your own gaming server hosted at home or on a dedicated server you rent, this is called self hosting. I suppose putting the label self hosting on dedicated server may not make everyone agree, this is true it&#39;s a grey area. The opposite of self hosting is to rely on a company to do the job for you, under their conditions, free or not.\n  Self hosting is about freedom, you can choose what server you want to run, which version, which features and which configuration you want. If you self host at home, You can also pick the hardware to match your needs (more Ram ? More Disk? RAID?).\n Self hosting is not a perfect solution, you have to buy the hardware, replace faulty components, do the system maintenance to keep the software part alive.\n  When you rely on a company or a third party offering services, you become tied to their ecosystem and their decisions. A company can stop what you rely on at any time, they can decide to suspend your account at any time without explanation. Companies will try to make their services good are appealing, no doubt on it, and then lock you in their ecosystem. For example, if you move all your projects on github and you start using github services deeply (more than a simple git repository), moving away from Github will be complicated because you don&#39;t have _reversibility_, which mean the right to get out and receive help from your service to move away without losing data or information.\n Self hosting empower the users instead of making profit from them. Self hosting is better when it&#39;s done in community, a common mail server for a group of people and a communication server federated to a bigger network (such as XMPP or Matrix) are a good way to create a resilient Internet while not giving away your rights to capitalist companies.\n  Asking everyone to host their own services is not even utopia but rather stupid, we don&#39;t need everyone to run their own server for their own services, we should rather build a constellation of communities that connect using federated protocol such as Email, XMPP, Matrix, ActivityPub (protocol used for Mastodon, Pleroma, Peertube, Disapora*).\n In France, there is a great initiative named CHATONS (which is the french word for KITTENS) gathering associative hosting with some pre-requisites like multiple sysadmin to avoid relying on one person.\n      I suppose most of my readers will argue that self hosting is nice but can&#39;t compete with &#34;cloud&#34; services, I admit this is true. Companies put a lot of money to make great services to get customers and earn money, if their service were bad, they wouldn&#39;t exist long.\n But not using open source and self hosting won&#39;t make alternatives to your service provider greater, you become part of the problem by feeding the system. For example, Google Mail GMAIL is now so big that they can decide which domain is allowed to reach them and which can&#39;t. It is such a problem that most small email servers can&#39;t send emails to Gmail without being treated as spam and we can&#39;t do anything to it, the more users they are, the less they care about other providers.\n Great achievements can be done in open source federated services like Peertube, one can host videos on a Peertube instance and follow the local rules of the instance, while some other big companies could just disable your video because some automatic detection script found a piece of music or inappropriate picture.\n Giving your data to a company and relying on their services make you lose your freedom. If you don&#39;t think it&#39;s true this is okay, freedom is a vague concept and it comes with various steps on a high scale.\n  Here are a few tips if you want to learn more about hosting your own services.\n ask people you trust if they want to participate, it&#39;s better to have more than only one person to manage servers.\n  you don&#39;t need to be an IT professional, but you need to understand you will have to learn.\n    asking (for contributing or as a requirement) for money is fine as long as you can justify why (a peertube server can be very expensive to run for example).\n  people around usually throw old hardware, ask friends or relative if they have old unused hardware. You can easily repair &#34;that old Windows laptop I replaced because wifi stopped working&#34; and use it as a server.\n  electricity usage must be considered but on the other hand, buying a brand new hardware to save 20W is not necessarily more ecological.\n  some services such as email servers can&#39;t be hosted on most ISP connection due to specific requirements\n    redundancy is overkill most of the time, shit happens but in redundant servers shit happens twice more often\n  I&#39;m self hosting since I first understood running a web server was the only thing I required to have my own PHP forum 15 years ago. I mostly keep this blog alive to show and share my experiments, most of the time happening when playing with my self hosting servers.\n I have a strong opinion on the subject, hosting your own services is a fantastic way to learn new skills or perfect them, but it&#39;s also important for freedom. In France we even have associative ISP and even if they are small, their existence force the big ISP companies to be transparent on their processes and interoperatibility.", "posttime": "2021-07-24 17:15:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "托管,hosting,服务", "title": "为什么自托管很重要", "title_en": "Why self hosting is important", "transed": 1, "url": "https://dataswamp.org/~solene/2021-07-23-why-selfhosting-is-important.html", "via": "", "real_tags": ["托管", "hosting", "服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们使用 cookie 来确保在我们的网站上为您提供最佳体验。您的浏览器似乎不支持它们，这会影响站点功能。", "note_en": "We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2021-07-24 17:15:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,实践,skeptics", "title": "冠状病毒怀疑论者使用正统数据实践来促进非正统科学", "title_en": "Coronavirus Skeptics Use Orthodox Data Practices to Promote Unorthodox Science", "transed": 1, "url": "https://dl.acm.org/doi/fullHtml/10.1145/3411764.3445211", "via": "", "real_tags": ["病毒", "冠状病毒", "实践", "skeptics"]}]