[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国证券交易委员会（Securities and Exchange Commission）今天指控BlockFi Lending LLC（BlockFi）未能登记其零售加密借贷产品的报价和销售。在这一首次同类诉讼中，SEC还指控BlockFi违反了1940年《投资公司法》的注册规定。为了解决SEC的指控，BlockFi同意支付5000万美元的罚款，停止其未注册的贷款产品BlockFi利息账户（BIAs）的要约和销售，并试图在60天内使其业务符合《投资公司法》的规定。BlockFi的母公司还宣布，它打算根据1933年的《证券法》注册一种新贷款产品的发行和销售。在今天宣布的平行行动中，BlockFi同意向32个州额外支付5000万美元的罚款，以解决类似指控。\n&#34;这是第一个涉及加密借贷平台的此类案例；SEC主席加里·根斯勒说&#34;今天的和解表明，加密市场必须遵守久经考验的证券法，如1933年的《证券法》和1940年的《投资公司法》。这进一步表明，委员会愿意与加密平台合作，以确定它们如何遵守这些法律。我要感谢并赞扬我们出色的SEC工作人员和州监管机构在这项和解协议上的努力与合作&#34;\n&#34;提供BlockFi’s BIAs等证券的加密借贷平台应立即注意今天的决议，并遵守联邦证券法和#34；美国证券交易委员会执法部门负责人格比尔·S·格雷瓦尔说&#34;遵守我们的注册和披露要求对于为投资者提供在加密资产领域做出明智投资决策所需的信息和透明度至关重要&#34;\n根据SEC的命令，从2019年3月4日到今天，BlockFi向公众提供并出售了偏见。通过偏见，投资者将加密资产借给BlockFi，以换取该公司承诺每月支付可变利息。该命令认定，BIAs是适用法律下的证券，因此，该公司被要求登记其BIAs的要约和销售，但未能登记或有资格获得SEC登记豁免。此外，该命令还发现，BlockFi作为一家未注册的投资公司运营了18个月以上，因为它发行了证券，还持有投资证券（不包括现金）总资产的40%以上，包括向机构借款人提供的加密资产贷款。\n该命令还发现，BlockFi在其网站上就其贷款组合和贷款活动的风险水平发表了虚假和误导性声明，持续两年多。\n在不承认或否认SEC调查结果的情况下，BlockFi同意了一项停止令，禁止其违反《证券法》的注册和反欺诈规定以及《投资公司法》的注册规定。BlockFi还同意停止在美国提供或销售BIAs。\nSEC的调查由格温·利卡多（Gwen Licardo）、克雷格·韦尔特（Craig Welter）和肯尼斯·戈特利布（Kenneth Gottlieb）在布伦特·W·威尔纳（Brent W.Wilner）的协助下进行，由零售战略工作组组长哈恩·L·金（Hane L.Kim）监督；美国证券交易委员会纽约地区办事处副区域主任劳拉·沙洛夫·梅拉班；还有网络部门负责人克里斯蒂娜·利特曼。SEC感谢作为北美证券管理者协会成员的州监管机构的协助。\n美国证券交易委员会（SEC）投资者教育与倡导办公室（Office of Investor Education and Advocation and Enforcement）的零售战略工作组（Retail Strategy Task Force）发布了一份关于加密资产计息账户的投资者公告。投资者可以在Investor上找到有关加密资产的更多信息。州长。", "note_en": "The Securities and Exchange Commission today charged BlockFi Lending LLC (BlockFi) with failing to register the offers and sales of its retail crypto lending product. In this first-of-its-kind action, the SEC also charged BlockFi with violating the registration provisions of the Investment Company Act of 1940. To settle the SEC’s charges, BlockFi agreed to pay a $50 million penalty, cease its unregistered offers and sales of the lending product, BlockFi Interest Accounts (BIAs), and attempt to bring its business within the provisions of the Investment Company Act within 60 days. BlockFi’s parent company also announced that it intends to register under the Securities Act of 1933 the offer and sale of a new lending product. In parallel actions announced today, BlockFi agreed to pay an additional $50 million in fines to 32 states to settle similar charges.\n &#34;This is the first case of its kind with respect to crypto lending platforms,&#34; SEC Chair Gary Gensler said. &#34;Today’s settlement makes clear that crypto markets must comply with time-tested securities laws, such as the Securities Act of 1933 and the Investment Company Act of 1940. It further demonstrates the Commission’s willingness to work with crypto platforms to determine how they can come into compliance with those laws. I’d like to thank and commend our remarkable SEC staff and state regulators for their efforts and collaboration on this settlement.&#34;\n &#34;Crypto lending platforms offering securities like BlockFi’s BIAs should take immediate notice of today’s resolution and come into compliance with the federal securities laws,&#34; said Gurbir S. Grewal, Director of the SEC’s Division of Enforcement. &#34;Adherence to our registration and disclosure requirements is critical to providing investors with the information and transparency they need to make well-informed investment decisions in the crypto asset space.&#34;\n According to the SEC’s order, from March 4, 2019 until today, BlockFi offered and sold BIAs to the public. Through BIAs, investors lent crypto assets to BlockFi in exchange for the company’s promise to provide a variable monthly interest payment. The order finds that BIAs are securities under applicable law, and the company therefore was required to register its offers and sales of BIAs but failed to do so or to qualify for an exemption from SEC registration. Additionally, the order finds that BlockFi operated for more than 18 months as an unregistered investment company because it issued securities and also held more than 40 percent of its total assets, excluding cash, in investment securities, including loans of crypto assets to institutional borrowers.\n The order also finds that BlockFi made a false and misleading statement for more than two years on its website concerning the level of risk in its loan portfolio and lending activity.\n Without admitting or denying the SEC’s findings, BlockFi agreed to a cease-and-desist order prohibiting it from violating the registration and antifraud provisions of the Securities Act and the registration provisions of the Investment Company Act. BlockFi also agreed to cease offering or selling BIAs in the United States.\n The SEC’s investigation was conducted by Gwen Licardo, Craig Welter, and Kenneth Gottlieb, with assistance from Brent W. Wilner, under the supervision of Hane L. Kim, Chief of the Retail Strategy Task Force; Lara Shalov Mehraban, Associate Regional Director of the SEC’s New York Regional Office; and Kristina Littman, Chief of the Cyber Unit. The SEC appreciates the assistance of state regulators that are members of the North American Securities Administrators Association.\n The SEC’s Office of Investor Education and Advocacy and Enforcement’s Retail Strategy Task Force has issued an  Investor Bulletin on Crypto Asset Interest-bearing Accounts. Investors can find additional information about crypto assets at Investor.gov.", "posttime": "2022-02-15 16:40:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "agrees,blockfi", "title": "Blockfi同意支付1亿美元罚款并进行注册", "title_en": "Blockfi agrees to pay $100M in penalties and pursue registration", "transed": 1, "url": "https://www.sec.gov/news/press-release/2022-26", "via": "", "real_tags": ["agrees", "blockfi"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎来到我的个人网站和博客，在这里你可以找到一些关于我的信息、联系方式、社交媒体链接以及我的博客帖子", "note_en": "Welcome to my personal website and blog, here you can find some information about me, contact, social media links as well as    my blog posts", "posttime": "2022-02-15 16:39:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,博客", "title": "Python增强计划即将为您带来的Python特性", "title_en": "Upcoming Python features brought to you by Python Enhancement Proposals", "transed": 1, "url": "https://martinheinz.dev/blog/67", "via": "", "real_tags": ["python", "博客"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个博客中，我将介绍我的自动音乐创作方法，包括理论、算法和Python包实现ch0p1n。\n举一个简单的例子，想象你把一只猫放在钢琴上，随机按下键来产生音乐。因此，音乐是预先确定的算法的结果，而不是你瞬间的情绪或作曲技巧的结果。这就是为什么它被称为自动合成。\n自动作文有许多不同的方法或范例。1我采取的方法受到了阿诺德·勋伯格、海因里希·申克和威廉·卡普林理论的启发。关键的想法是，在一些常见的操作下，音乐可以从有限的材料中发展或产生。我将在以下三个部分中解释我的方法的理论基础。\n让我们来看一个例子，贝多芬第一首钢琴奏鸣曲的开头：\n事实上，蓝色框架中的结构可以仅通过转置红色框架中的结构来生成。因此，为了创作这篇文章，我只需要在红色框架中创建结构，然后重用或稍微修改它以生成蓝色框架中的结构，而不是从头开始创建两个结构。\n同样的情况也发生在其他地方。如下所示，四个框架结构也非常相似：\n这种重复使用是否只存在于贝多芬的音乐中？不，这可能发生在每一部音乐作品中。无论一部音乐作品持续多长时间，或者它的声音有多变化多端，其核心材料的数量总是很少的。\n然而，有时候，一种材料可以被修改得太多以至于你几乎认不出来，比如在下面的例子中，肖邦的夜曲作品9第一首的开头：\n这两个框架结构看起来和听起来都非常不同，但在我的方法中，蓝色框架中的结构仍然可以通过在红色框架中详细阐述结构来生成，而不是它们完全不相关。这是因为这两个结构有一些共同的形态特征，它们具有相同的背景和声级数，并且从音乐形式的角度来看，蓝色框架中的结构确实是红色框架中结构的重复。2.\n请注意，在声明一个结构可以由其他结构生成时，我并没有断言贝多芬或肖邦在作曲时确实这样做或故意这样做。相反，我的观点是，我们可以使用这种音乐生成的视角来正式化或自动化音乐创作的过程。\n一旦创建了一个结构，就可以对其应用一些常见的操作来生成新的结构。我将在下面讨论一些操作。\n我要讲的第一个操作是重复。它意味着在不改变形态的情况下，以新的和谐方式重复一个结构。\n蓝色框架中的结构是红色框架中结构的换位。这两种结构具有相同的形态，尽管它们适应不同的背景和声。\n肖邦的夜曲是另一个例子。蓝色框架中的伴奏主题与红色框架中的主题重复：\n在重复中，根据一些语音引导规则，一些音调会移动到最近的音调以适应新的和声。3其中一些变化如下所示：\n下一个操作是精化。这意味着向结构中添加传递注释、相邻注释和其他类型的注释。肖邦的夜曲就是一个例子，在重复中加入了许多元组：\n有时，详细描述更多地是从分数中推断出来的，而不是表现在分数中。海因里希·申克（Heinrich Schenker）的理论区分了音乐的表层结构和深层结构，表层结构是深层结构细化的结果，如下例所示：\n例如，在上面的分数中，b部分可以通过阐述c部分生成。\n精化的相反操作是简化。例如，在上述分数中，b部分可以减少为c部分。\n我要说的最后一个操作是碎片化。这意味着从材料中取出一块碎片。\n正如贝多芬的奏鸣曲一样，蓝色框架中的结构是红色框架中的一个片段：\n可以修改红色框架中的片段以生成橙色框架中的结构；蓝色框架中的片段可以修改以生成绿色框架中的结构。这两块碎片取自紫色框架中的结构。\n有更多的操作可以应用到音乐材料上，但我就到此为止。我所介绍的四个操作对于本博客来说已经足够了。\n根据音乐形式，创建和生成的结构可以组合成更大的结构。音乐形式是音乐材料组织的一种方式。\n例如，贝多芬奏鸣曲的开头有形式句。下面是威廉·卡普林的系统是如何分析这句话的：2\n肖邦夜曲的开始是从一个更大的结构形式复合时期，这是远比句子复杂。\n我不会在这里深入讨论音乐形式的问题。我强烈推荐威廉·卡普林关于这个话题的优秀教材2。我的重点是，音乐材料应该根据音乐形式进行组合，以产生有意义的音乐。\n我们首先需要严格定义音乐材料和结构，我们一直在模糊地谈论这些。\n让我们回到贝多芬的奏鸣曲。下面是它的前两个栏：\n这首曲子有两种声音或乐句。每一段音乐都由音符、休止符或和弦组成，而和弦也由音符组成。音符有几个属性，这里只考虑音高和持续时间。我们将分别处理音符的音高和持续时间内容，而不是将音符表示为单个对象。\n音高可以用科学的音高符号或MIDI音符数字来表示。为了便于操作，通常使用后者。例如，音高C4由MIDI音符编号60表示。\n在Python中，和弦的音高内容可以用列表表示。例如，在Python中，我们可以使用[&#39；C4&#39；，&#39；A-3&#39；，&#39；F3&#39；]或[60,56,53]代表红色框架中和弦的音高内容：\n持续时间可以用数字表示。例如，季度票据的持续时间为1。\n一条音乐线的音高内容可以用我所说的音高线来表示。在Python中，音高线是一个列表，其成员为无、数字或数字列表。使用Python包类型，节线可以定义为：\n一条音乐线的持续时间内容可以用持续时间线来表示。在Python中，持续时间行是成员为数字的列表。\n最后，和声和音阶可以用音高等级列表来表示。例如，在Python中，C大调和声可以用[&#39；C&#39；，&#39；E&#39；，&#39；G&#39；]来表示或者[0,4,7]。\n你可能经常听到这个词。母题在结构上是一条音乐线，通常长度较短。主题是音乐的基石。它们可以被重复、细化、分割和组合，从而产生音乐。\n例如，以下是勋伯格如何分析贝多芬奏鸣曲的开头：5\n在他的分析中，这首曲子的旋律部分只能由三个主题生成。\n有不同种类的图案。例如，以下乐谱中有两种主题：\n红色框架中的图案可以称为伴奏图案，因为它们出现在这首夜曲的伴奏行中。它们也可以被称为和声母题，因为它们只包含和声音符。蓝色框架中的主题可以称为旋律主题，因为它们出现在旋律线中，或者如果它们包含非和声音符，则称为非和声主题。\n在接下来的几节中，我将讨论可应用于Motif的常见操作的实现。\n我的Python包ch0p1n中的函数transpose（）用于沿比例变换图案。\n音高主题=[60,67,76,72]#[#39；C4&#39；&#39；G4&#39；&#39；E5&#39；&#39；C5&#39；]持续时间主题=[1,1,1,1]\n我们可以用show（）在score中显示这个主题，它构建在Python包music21上：\n来自ch0p1n。utils import show（音高线=[pitch_motif]、音长线=[duration_motif]、组=1、#高音杆键中的声音数=0、米=和#39；4/4和#39；、谱号=[和#39；g和#39；，&#39；f和#39；]））\n来自ch0p1n。motif import transpose pitch_motif_transposed=transpose（pitch_motif=pitch_motif，scale=[0,2,4,5,7,9,11]，step=1）\n显示（音高线=[pitch_motif_transposed]，duration_lines=[duration_motif]，group=1，#高音杆键中的声音数=0，meter=&#39；4/4&#39；，谱号=[&#39；g&#39；，&#39；f&#39；]））\n看起来不错。每一个音高都在C大调音阶上上升了一步。\n由于和声是一种特殊的音阶，我们可以使用转置（）在和声中重复主题，比如G大调和声：\n音高调换=调换（音高调换=音高调换，音阶=[7,11,2]，#G大调和声阶=1）\n表演（音高线条=[音高主题+音高主题转置]，音长线条=[音长主题*2]，组=1，键=0，节拍=&#39；4/4&#39；，谱号=[&#39；g&#39；，&#39；f&#39；]））\n最初的主题在第一栏，第二栏转置。你可以看到G大调和声中的每个音高是如何上升一步的。\n然而，在某些情况下，transpose（）并不好用。仍然在上面的例子中，假设我们用step=-1将motif向下转一步，而不是向上转一步：\n第二小节中的转置主题是不可接受的，因为它没有音高等级G来完全具体化G大调和声。\n我们可以通过ch0p1n中的函数lead（）来改善这种情况。这个函数的名字来源于声音引导的概念，意思是一个主题中的每个音符都一步一步地引导到一个给定和声中的音符。\n来自ch0p1n。motif import lead pitch_motif=lead（pitch_motif=pitch_motif，harmony=[7,11,2]，35;G大调和声步数=[-1,0]，complete=False，Simular=None）\n步数=[-1，0]意味着每个音高如果符合和声，将移动零步，同时向下移动一步。换句话说，每个音高可能会在lead（）下的给定和声中生成多个音高，因此返回的结果是音高主题列表，而不是单个。稍后我将讨论完整参数和类似参数。\n#合并itertools导入链展示中的'pitch_Motions'（pitch_lines=[列表（链（*pitch_Motions））]，duration_lines=[duration_motif*2]，group=1，key=0，meter=&39；4/4&#39; ,  谱号=[&#39；g&#39；，&#39；f&#39；]）\n虽然第一小节中的主题与转置（）产生的不可接受的主题相同，步骤=-1，但第二小节中的主题是好的，这充分体现了G大调和声。\n使用complete=True，我们可以筛选出不和谐完整或不完全具体化给定和谐的音高主题：\n音高母题=引导（音高母题=音高母题，和声=[7,11,2]，步数=[1,0]，完整=正确，相似=无）\n在参数相似的情况下，我们可以筛选出与原始基调轮廓不同的基调图案。在这篇介绍性博客中，我将跳过这一部分。\n函数thread（）用于在连续的和声中重复一个主题，或在和声中穿插一个主题。让我们尝试一下前面定义的主题：\n来自ch0p1n。motif import thread pitch_motif=thread（pitch_motif=pitch_motif，duration_motif=duration_motif，和声=[5,9,0]，[7,11,2]，#F，G durations=[2,2]，steps=[1]）show（pitch lines=pitch_motif，duration_lines=[duration_motif]组=1，键=0，米=39；2/4&#39; ,  谱号=[&#39；g&#39；，&#39；f&#39；]）\n主题的前两个音符改编为F大调和声，而最后两个音符改编为G大调和声。\n到目前为止，我只讨论了和声主题。为了处理非谐波图案，这是更复杂的，我们首先需要考虑如何精心制作图案。\n简单地说，精化就是给主题添加注释。ch0p1n中的函数deployate（）正好用于此目的。\n来自ch0p1n。motif import deployate motif=deployate（音高=pitch_motif，持续时间=duration_motif，参考=2，步数=1，-1]，音阶=0,2,4,5,7,9,11]，位置=39；左&#39；）\n表演（音高线=[pitch_motif+motif[0]]，持续时间线=[duration_motif+motif[1]]，组=1，键=0，音阶=&#39；4/4&#39；，谱号=[&#39；g&#39；，&#39；f&#39；]））\n参数引用指示在何处添加注释或阐述主题。例如，reference=2表示在第三个注释处添加注释。我们可以详细说明最后一点：\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=3，#最后一个音符步数=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；左&#39；）\n参数步骤指定要添加的音符的音高。例如，steps=[-1，-1]表示参考注释应向下移动一步以生成第一个注释，然后此注释应向下移动一步以生成第二个注释。让我们用这个参数添加三个降序注释：\nmotif=精致（音高#音高#音高#音高#音高#音高#音长#音高#音高#音长#音高#音高#音高#音高#音长#音高#音长#音高#音高#音高\n通过这些步骤，您还可以重复一些注释或为主题添加休息，如以下示例所示：\nmotif=精心设计（音高_motif=音高_motif，持续时间_motif=持续时间_motif，参考=2，步骤=[0,0，无]#重复两次音符，然后添加休息）\n参数比例指定移动参考注释以生成要添加的注释的比例。例如，scale=[0,2,4,5,7,9,11]表示它是C大调音阶。我们可以用C色阶来代替：\nmotif=精细（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步骤=[-1，-1]，音阶=列表（范围（12）），#C色阶位置=&#39；左&#39；）\n参数位置指定添加注释相对于参考注释的位置。例如，position=&#39；左&#39；指示将注释添加到参考注释的左侧。我们可以在右边添加注释：\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步数=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；右侧&#39；#在右侧添加注释）\n请注意，带有&#39；左&#39；和&#39；对&#39；，添加的注释采用参考注释的持续时间。如果你想从参考注释之前或之后的注释中提取持续时间，请使用&#39；前&#39；或&#39；接下来&#39；。例如\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步数=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；上一个&#39；#从上一个音符中选取持续时间）\n参数比率指定添加的笔记持续时间的百分比。例如，比率=1/2意味着添加的注释占参考注释持续时间的50%：\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步骤=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；左&#39；，比率=1/2#占参考音符持续时间的50%）\n精简与精化相反。这是从一个主题中删除注释。ch0p1n的相应函数是reduce（）。\n来自ch0p1n。motif import reduce motif=reduce（音高motif=motif[0]，持续时间motif=motif[1]，开始=2，结束=3，位置=&#39；右&#39；）\n参数start和end指定要删除的注释。参数位置指定要向其添加已删除注释的持续时间的参考注释。\n背景和声为Fm，圆圈音符不符合和声，因此为非和声。\n音高主题=[65,68,72,77,80,79,77,76,77，无]持续时间主题=[1,1,1,1,1.5,1/6,1/6,1/6,1,1]\n音高主题，持续时间主题=减少（音高主题，持续时间主题，开始=5，结束=7，位置=&#39；左&#39；）#以下显示相同（[pitch_motif]，[duration_motif]，key=-4）\n音高主题，持续时间主题=精心设计（音高主题，持续时间主题，参考=4，步数=[-1，-1，-1]，音阶=[5,7,8,10,0,1,4]，位置=&#39；右&#39；，比率=1/4）\n碎片化是将一个主题分解成几个较短的主题，或从一个主题中提取一个片段。ch0p1n中相应的函数是divide（）和fragment（）。\n音高主题=[82,84,85,81,82,78]+[77]*4+[78,77,75,72,73,70]持续时间主题=[0.5]*6+[1]*4+[0.5]*4+[2,1]\n使用divide（），我们可以将这个图案分成三个长度相等的较短图案：\n&gt&gt&gt；主题[（[82,84,85,81,82,78,77]，[0.5,0.5,0.5,0.5,0.5,1]），（[77,77,77,78,77]，[1,1,1,0.5,0.5]，[75,72,73,70]，[0.5,0.5,2,1]）]\n来自ch0p1n。motif import fragment motif=fragment（音高、持续时间、开始=6、结束=9、比率=1/2、适合度=&#39；右&#39；）显示（[motif[0]，[motif[1]，[key=-5，meter=&#39；6/4&#39；）\n参数start和end指定片段的开始注释和结束注释。比率=1/2表示片段的长度应该是原始图案的50%，为了实现这一点，fit=&#39；右&#39；表示尾音应该延长。\n现在是时候把这一切放在一起了。首先，我们试着用少量的材料，在我们已经讨论过的操作下，生成贝多芬奏鸣曲的开头。\n为了简化问题并使模式更加清晰，我将从原始乐谱中删除含糊、发音、动态、优雅音符和其他一些音符：\n这首曲子由两个声部或乐谱组成，高音管中的旋律线和低音管中的伴奏线。\n总之，要创作贝多芬奏鸣曲的开头，核心材料是\n旋律音高主题=[65,68,72,77,80,77]旋律音长主题=[1,1,1,1,2,2]\n#Fm，C7，Fm，C7，Fm，Gdim，C7和声=[[5,8,0]，[0,4,7,10]，[5,8,7,10]，[5,8,0]，[7,10,1]，[0,4,7,10]#F谐波小调音阶=[5,7,8,10,0,1,4]\ndef生成贝多芬奏鸣曲（旋律、音高、旋律、音长、伴奏、伴奏、音高、和声、，\n......", "note_en": "In this blog, I will introduce my approach to automatic musical composition, including the theory, the algorithm, and a Python package implementation  ch0p1n.\n   As a trivial example, imagine that you put a cat on a piano to randomly press keys to generate music. The music is thus the result of a predetermined algorithm rather than of your instantaneous emotions or compositional skills. This is why it is called  automatic composition.\n Automatic composition has many different approaches or paradigms.  1 The approach I take is inspired by the theories of Arnold Schoenberg, Heinrich Schenker and William Caplin. The key idea is that  music can develop or be generated from limited materials under some common operations. I will explain the theoretical foundation of my approach in the following three sections.\n  Let’s see an example, the beginning of Beethoven’s first piano sonata:\n       In fact, the structure in the blue frame can be generated by merely transposing the structure in the red one. Therefore, to compose this piece, I need only to create the structure in the red frame, then reuse or slightly modify it to generate the structure in the blue frame, rather than create both structures from scratch.\n The same situation happens in other parts too. As indicated below, the four framed structures are also highly similar:\n  Does this kind of reuse exist only in Beethoven’s music? No, this probably happens in every musical work.  No matter how long a musical work lasts or how varied it can sound, the amount of its core materials is always small.\n   Sometimes, however, a material can be modified so much that you can barely recognize it, as in the following example, the beginning of Chopin’s nocturne Op.9 No.1:\n     The two framed structures look and sound quite different, but, in my approach, it is still that the structure in the blue frame can be generated by elaborating the structure in the red one, rather than that they are totally unrelated. It is so because the two structures have some morphological characteristics in common, they have the same background harmonic progression, and from the perspective of musical form, the structure in the blue frame is indeed a repetition of the structure in the red one.  2\n Please note that, in stating that a structure can be generated from other structure, I do not assert that Beethoven or Chopin actually did this or deliberately did this when composing music. Rather, my point is that we can use this music generation perspective to formalize or automate the process of musical composition.\n  Once a structure is created, some common operations can be applied to them to generate new structures. I will talk about some operations below.\n The first operation I will talk about is  repetition. It means repeating a structure in a new harmony without changing its morphology.\n   The structure in the blue frame is a  transposition of the structure in the red one. The two structures have the same morphology, although they are adapted to different background harmonies.\n The Chopin’s nocturne is another example. The accompaniment motif in the blue frame is a repetition of the one in the red frame:\n  In the repetition, some pitches move to their nearest pitches to fit the new harmony, according to some  voice-leading rules.  3 Some of these changes are indicated below:\n     The next operation is  elaboration. It means adding passing notes, neighbor notes, and other types of notes to a structure. The Chopin’s nocturne is an example, in which a lot of tuplets are added in the repetition:\n  Sometimes, elaborations are rather inferred from than showed in scores. Heinrich Schenker’s theory differentiates music’s superficial structure from its deep structure(s), and the superficial structure is the outcome of elaboration of a deep structure, as showed in the following example:  4\n  In the above score, for example, piece b can be generated by elaborating piece c.\n The opposite operation of elaboration is  reduction. For example, in the above score, piece b can be reduced to piece c.\n The last operation I will talk about is  fragmentation. It means taking a fragment from a material.\n As in the Beethoven’s sonata, the structure in the blue frame is a fragment from the structure in the red one:\n       The fragment in the red frame can be modified to generate the structure in the orange frame; the fragment in the blue frame can be modified to generate the structures in the green frames. The two fragments are taken from the structure in the purple frame.\n There are more operations can be applied to musical materials, but I will stop here. The four operations I have introduced are enough for the purpose of this blog.\n  Created and generated structures can be combined into larger structures, according to musical forms. A  musical form is a way in which musical materials should be organized.\n For example, the beginning of the Beethoven’s sonata has the form  sentence. Below is how this sentence is analyzed in William Caplin’s system:  2\n  The beginning of the Chopin’s nocturne is from a larger structure of the form  compound period, which is far more complex than sentence.\n I will not go deep into the subject of musical forms here. I highly recommend William Caplin’s excellent textbook  2 on this topic. My key point is that musical materials should be combined according to musical forms to generate meaningful music.\n      We first need to strictly define musical  materials and  structures, which we have been talking about quite vaguely.\n Let’s return to the Beethoven’s sonata. Below is its first two bars:\n  This piece of music has two voices or musical lines. Each musical line consists of notes, rests or chords which consist of notes too. A note has several attributes, among which only pitch and duration will be considered here. Rather than represent notes as single objects, we will handle their pitch and durational contents separately.\n Pitches can be represented by  scientific pitch notations or  MIDI note numbers. Mostly, the latter are used, for ease of operation. For example, pitch C4 is represented by MIDI note number 60.\n  The pitch contents of a  chord can be represented by list in Python. For example, in Python we can use  [&#39;C4&#39;, &#39;A-3&#39;, &#39;F3&#39;] or  [60, 56, 53] to represent the pitch contents of the chord in the red frame:\n  Durations can be represented by numbers. For example, quarter note’s duration is 1.\n The pitch contents of a  musical line can be represented by what I call  pitch line. In Python, a pitch line is a list whose members are  None, numbers or lists of numbers. With Python package  typing, pitch line can be defined as:\n  The durational contents of a musical line can be represented by  duration line. In Python, a duration line is a list whose members are numbers.\n Finally,  harmonies and  scales can be represented by lists of  pitch classes. For example, in Python C major harmony can be represented by  [&#39;C&#39;, &#39;E&#39;, &#39;G&#39;] or  [0, 4, 7].\n  You may have heard this term a lot. A  motif is structurally a musical line, usually short in length. Motifs are the building blocks of music. They can be repeated, elaborated, fragmented and combined to generate music.\n For example, the following is how Schoenberg analysed the beginning of the Beethoven’s sonata:  5\n  In his analysis, the melody part of this piece can be generated from only three motifs.\n There are different kinds of motifs. For example, two kinds of motifs are framed in the following score:\n  The motifs in the red frames can be called  accompaniment motifs as they appear in the accompaniment line of this nocturne. They can also be called  harmonic motifs as they consist of only harmonic notes. The motifs in the blue frames can be called  melodic motifs as they appear in the melody line, or  non-harmonic motifs if they contain non-harmonic notes.\n In the following several sections, I will talk about the implementation of the common operations that can be applied to motifs.\n  The function  transpose() from my Python package  ch0p1n is for transposing a motif along a scale.\n  pitch_motif  =  [ 60 ,  67 ,  76 ,  72 ] # [&#39;C4&#39;, &#39;G4&#39;, &#39;E5&#39;, &#39;C5&#39;] duration_motif  =  [ 1 ,  1 ,  1 ,  1 ]\n  We can show this motif in score with  show(), which is built on Python package  music21:\n from  ch0p1n.utils  import  show show (  pitch_lines  =  [ pitch_motif ],  duration_lines  =  [ duration_motif ],  group  =  1 ,  # the number of voices in the treble staff  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n   from  ch0p1n.motif  import  transpose pitch_motif_transposed  =  transpose (  pitch_motif  =  pitch_motif ,  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  step  =  1 )\n   show (  pitch_lines  =  [ pitch_motif_transposed ],  duration_lines  =  [ duration_motif ],  group  =  1 ,  # the number of voices in the treble staff  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  It looks good. Every pitch has moved up by one step along the C major scale.\n Since harmony is a special kind of scale, we can use  transpose() to repeat the motif in a harmony, say, the G major harmony:\n pitch_motif_transposed  =  transpose (  pitch_motif  =  pitch_motif ,  scale  =  [ 7 ,  11 ,  2 ],  # G major harmony  step  =  1 )\n  show (  pitch_lines  =  [ pitch_motif  +  pitch_motif_transposed ],  duration_lines  =  [ duration_motif  *  2 ],  group  =  1 ,  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  The original motif is in the first bar, and the transposed the second. You can see how each pitch moves up by one step in the G major harmony.\n In some cases, however,  transpose() does not work well. Still in the above example, suppose we transpose the motif down rather than up by one step with  step = -1:\n  The transposed motif in the second bar is not acceptable because it contains no pitch class G to fully reify the G major harmony.\n  We can improve this situation with function  lead() from  ch0p1n. The function got its name from the concept of voice-leading, which means every note in a motif  leads by step to the note(s) in a given harmony.\n  from  ch0p1n.motif  import  lead pitch_motifs  =  lead (  pitch_motif  =  pitch_motif ,  harmony  =  [ 7 ,  11 ,  2 ],  # G major harmony  steps  =  [ - 1 ,  0 ],  complete  =  False ,  similar  =  None )\n steps = [-1, 0] means each pitch will move zero step if it fits the harmony, and at the same time one step downwards. In other words, each pitch may generate more than one pitch in the given harmony under  lead(), and the result returned is thus a list of pitch motifs rather than a single one. I will talk about parameters  complete and  similar later.\n    # to merge `pitch_motifs` from  itertools  import  chain show (  pitch_lines  =  [ list ( chain ( * pitch_motifs ))],  duration_lines  =  [ duration_motif  *  2 ],  group  =  1 ,  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  While the motif in the first bar is as same as the unacceptable one generated by  transpose() with  step = -1, the motif in the second bar is good, which fully reifies the G major harmony.\n With  complete = True, we can screen out the pitch motifs which are not harmonically complete or do not fully reify the given harmony:\n pitch_motifs  =  lead (  pitch_motif  =  pitch_motif ,  harmony  =  [ 7 ,  11 ,  2 ],  steps  =  [ - 1 ,  0 ],  complete  =  True ,  similar  =  None )\n   With parameter  similar, we can screen out the pitch motifs which do not have the same contour as the original one. I will skip this part in this introductory blog.\n  The function  thread() is for repeating a motif in consecutive harmonies or  threading a motif through harmonies. Let’s try it on the motif defined earlier:\n from  ch0p1n.motif  import  thread pitch_motifs  =  thread (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  harmonies  =  [[ 5 ,  9 ,  0 ],  [ 7 ,  11 ,  2 ]],  # F, G  durations  =  [ 2 ,  2 ],  steps  =  [ 1 ] ) show (  pitch_lines  =  pitch_motifs ,  duration_lines  =  [ duration_motif ],  group  =  1 ,  key  =  0 ,  meter  =  &#39;2/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  The first two notes of the motif are adapted to the F major harmony, while the last two notes to the G major harmony.\n So far, I have talked only about harmonic motifs. To deal with non-harmonic motifs, which is more complex, we need first to consider how to elaborate motifs.\n  Simply speaking, elaboration is adding notes to a motif. The function  elaborate() from  ch0p1n serves the exact purpose.\n  from  ch0p1n.motif  import  elaborate motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; )\n  show (  pitch_lines  =  [ pitch_motif  +  motif [ 0 ]],  duration_lines  =  [ duration_motif  +  motif [ 1 ]],  group  =  1 ,  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n    The argument  reference indicates where to add notes or elaborate the motif. For example,  reference = 2 means the notes are added at the third note. We can elaborate the last note instead:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  3 ,  # the last note  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; )\n  The argument  steps specifies the pitches of the notes to add. For example,  steps = [-1, -1] indicates that the reference note should move one step downwards to generate the first note, then this note should move one step downwards to generate the second note. Let’s add three descending notes with this argument:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ 1 ,  1 ,  1 ],  # three descending notes  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; )\n  With  steps, you can also repeat some note or add rests to a motif, as in the following example:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ 0 ,  0 ,  None ]  # repeat the note twice then add a rest )\n  The argument  scale specifies the scale along which to move the reference note to generate the notes to add. For example,  scale = [0, 2, 4, 5, 7, 9, 11] indicates that it is the C major scale. We can use C chromatic scale instead:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  list ( range ( 12 )),  # C chromatic scale  position  =  &#39;left&#39; )\n  The argument  position specifies the position of the added notes relative to the reference note. For example,  position = &#39;left&#39; indicates that the notes are added at the left side of the reference note. We can add the notes at the right side:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;right&#39;  # add the notes at the right side )\n  Please note that, with  &#39;left&#39; and  &#39;right&#39;, the added notes take durations from the reference note. If you want that the durations are taken from the note before or after the reference note, use  &#39;previous&#39; or  &#39;next&#39;. For example,\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;previous&#39;  # take durations from the previous note )\n  The argument  ratio specifies the percentage of duration the added notes take. For example,  ratio = 1/2 means that the added notes take 50% of the duration of the reference note:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; ,  ratio  =  1 / 2  # take 50% of the duration of the reference note )\n   Reduction is the opposite of elaboration. It is removing notes from a motif. The corresponding function from  ch0p1n is  reduce().\n    from  ch0p1n.motif  import  reduce motif  =  reduce (  pitch_motif  =  motif [ 0 ],  duration_motif  =  motif [ 1 ],  start  =  2 ,  end  =  3 ,  position  =  &#39;right&#39; )\n  The arguments  start and  end specify the notes to remove. The argument  position specifies the reference note to which to add the durations of the removed notes.\n    The background harmony is Fm, and the circled notes are non-harmonic since they do not fit the harmony.\n     pitch_motif  =  [ 65 ,  68 ,  72 ,  77 ,  80 ,  79 ,  77 ,  76 ,  77 ,  None ] duration_motif  =  [ 1 ,  1 ,  1 ,  1 ,  1.5 ,  1 / 6 ,  1 / 6 ,  1 / 6 ,  1 ,  1 ]\n  pitch_motif ,  duration_motif  =  reduce (  pitch_motif ,  duration_motif ,  start  =  5 ,  end  =  7 ,  position  =  &#39;left&#39; ) # the same below show (  [ pitch_motif ],  [ duration_motif ],  key  =  - 4 )\n      pitch_motif ,  duration_motif  =  elaborate (  pitch_motif ,  duration_motif ,  reference  =  4 ,  steps  =  [ - 1 ,  - 1 ,  - 1 ],  scale  =  [ 5 ,  7 ,  8 ,  10 ,  0 ,  1 ,  4 ],  position  =  &#39;right&#39; ,  ratio  =  1 / 4 )\n   Fragmentation is breaking a motif up into several shorter motifs or taking a fragment from a motif. The corresponding functions from  ch0p1n are  divide() and  fragment().\n    pitch_motif  =  [ 82 ,  84 ,  85 ,  81 ,  82 ,  78 ]  +  [ 77 ] * 4  +  [ 78 ,  77 ,  75 ,  72 ,  73 ,  70 ] duration_motif  =  [ 0.5 ] * 6  +  [ 1 ] * 4  +  [ 0.5 ] * 4  +  [ 2 ,  1 ]\n With  divide(), we can divide this motif into, say, three shorter motifs of equal length:\n  &gt;&gt;&gt;  motifs [  ([ 82 ,  84 ,  85 ,  81 ,  82 ,  78 ,  77 ],  [ 0.5 ,  0.5 ,  0.5 ,  0.5 ,  0.5 ,  0.5 ,  1 ]),  ([ 77 ,  77 ,  77 ,  78 ,  77 ],  [ 1 ,  1 ,  1 ,  0.5 ,  0.5 ]),  ([ 75 ,  72 ,  73 ,  70 ],  [ 0.5 ,  0.5 ,  2 ,  1 ]) ]\n       from  ch0p1n.motif  import  fragment motif  =  fragment (  pitch_motif ,  duration_motif ,  start  =  6 ,  end  =  9 ,  ratio  =  1 / 2 ,  fit  =  &#39;right&#39; ) show ([ motif [ 0 ]],  [ motif [ 1 ]],  key  =  - 5 ,  meter  =  &#39;6/4&#39; )\n  The arguments  start and  end specify the start note and the end note of the fragment.  ratio = 1/2 indicates that the fragment’s length should be 50% of the original motif, and to accomplish this,  fit = &#39;right&#39; indicates that the end note should be prolonged.\n  Now it is time to put it all together. Let’s first try to generate the beginning of the Beethoven’s sonata from a small amount of materials, under the operations that we have been talking about.\n To simplify the problem and to make patterns more discernible, I will remove slurs, articulations, dynamics, grace notes, and some other notes from the original score:\n  This piece consists of two voices or musical lines, the melody line in the treble staff and the accompaniment line in the bass staff.\n         In summary, to generate the beginning of the Beethoven’s sonata, the core materials are\n    melodic_pitch_motif  =  [ 65 ,  68 ,  72 ,  77 ,  80 ,  77 ] melodic_duration_motif  =  [ 1 ,  1 ,  1 ,  1 ,  2 ,  2 ]\n    # Fm, C7, Fm, C7, Fm, Gdim, C7 harmonies  =  [  [ 5 ,  8 ,  0 ],  [ 0 ,  4 ,  7 ,  10 ],  [ 5 ,  8 ,  0 ],  [ 0 ,  4 ,  7 ,  10 ],  [ 5 ,  8 ,  0 ],  [ 7 ,  10 ,  1 ],  [ 0 ,  4 ,  7 ,  10 ] ] # F harmonic minor scale scale  =  [ 5 ,  7 ,  8 ,  10 ,  0 ,  1 ,  4 ]\n  def  generate_beethoven_sonata (  melodic_pitch_motif ,  melodic_duration_motif ,  accompaniment_pitch_motif ,  accompaniment_duration_motif ,  harmonies , \n......", "posttime": "2022-02-15 16:20:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "作曲,automatic,音高", "title": "我的自动作曲方法", "title_en": "My approach to automatic musical composition", "transed": 1, "url": "https://flujoo.github.io/en/my-approach-to-automatic-musical-composition/", "via": "", "real_tags": ["作曲", "automatic", "音高"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Matt Mullenweg是WordPress背后的Automattic公司的创始人兼首席执行官。com讨论了“异步工作”以及他认为混合模式将消亡的原因\n世界各地的公司都在努力寻找工作的未来。Matt Mullenweg是WordPress背后的Automattic公司的创始人兼首席执行官。com说，他的员工们已经过上了这种生活。\n在疫情期间，许多白领已经习惯了不正常的工作时间，他们打乱了传统的9-5上班时间，以适应照顾孩子或其他责任。自Automattic 2005年成立以来，这种灵活性一直是常态。Automattic是所谓的异步工作的先驱，它不仅为工人提供了位置上的灵活性，还为他们的工作时间提供了灵活性。该公司在97个国家拥有1876名员工，他们在“异步”的基础上工作，这意味着他们可以自行设定时间表。虽然他们必须实现目标，但他们可以控制自己的工作时间和工作量。\n《华尔街日报》将向您收取$+税（如果适用）。您可以随时在客户中心或致电客户服务部更改账单偏好。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客服取消订阅。", "note_en": "Work     Matt Mullenweg, founder and CEO of Automattic, the company behind WordPress.com, talks about ‘asynchronous work’ and why he thinks hybrid models will die out\n   Companies everywhere are struggling to figure out the future of work. Matt Mullenweg, founder and CEO of Automattic, the company behind WordPress.com, says his employees  are already living it.\n  During the pandemic, many white-collar workers grew accustomed to  working unusual hours, scrambling their traditional 9-5 schedules to adjust for childcare or other responsibilities. Since Automattic’s 2005 founding, such flexibility has been the norm. Automattic was a pioneer of so-called asynchronous work, which offers workers not only flexibility on their location, but on their hours, too. The company has 1,876 employees in 97 countries who work on an “asynchronous” basis, meaning they set their own schedules. While they must hit their goals, they control when and how much they work.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-02-15 16:13:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "执行官,lets", "title": "首席执行官让他的员工随时随地工作——无论他们想在哪里工作", "title_en": "CEO Lets His Employees Work Whenever They Want–From Wherever They Want", "transed": 1, "url": "https://www.wsj.com/articles/the-next-wave-in-remote-work-flexibility-in-locationand-hours-11643993475", "via": "", "real_tags": ["执行官", "lets"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一，GiveSendGo的网站称其处于“维护中”，几小时后该网站被劫持并重定向到据信由黑客控制的页面，该页面不再加载。重定向的页面2019冠状病毒疾病，他们在加拿大首都的卡车司机反对强制性的CVID-19疫苗接种，造成交通和贸易的广泛破坏超过一周。\n该页面还包含一个链接，指向一个包含数万条记录的文件，这些记录被称为“原始捐赠数据”，涉及那些向自由护航队捐款的人。\n不久后，非营利泄密网站Distributed Denial of Secrets表示，它从GiveSendGo收到了30兆字节的捐赠者信息，包括自我报告的姓名、电子邮件地址、邮政编码和IP地址。\n分布式拒绝机密网站（Distributed Denial of Secrets）表示，这些数据只会提供给研究人员和记者。该网站以托管涉及极右翼团体的一系列泄露数据而闻名。\n据记者米凯尔·塔伦（Mikael Thalen）称，此次漏洞与早些时候的一次安全漏洞是不同的。在那次安全漏洞中，GiveSendGo将一个亚马逊托管的S3存储桶暴露在了互联网上，存储了上千份身份证件。塔伦在一夜之间首次报告了数据漏洞。\n上个月，总部位于马萨诸塞州波士顿的GiveSendGo成为“自由护航队”的主要捐款服务机构，GoFundMe停止了众包活动，并冻结了数百万美元的捐款，理由是警方报告称渥太华各地发生了暴力事件。上周末，加拿大一家法院发布命令，禁止使用GiveSendGo募集的资金，该公司表示将对此进行抗辩。\n本月早些时候，抗议者为自由车队筹集了800多万美元。\n更新以澄清分布式拒绝机密的数据是针对自由护航数据的，而不是针对每一场战役。", "note_en": "On Monday, GiveSendGo’s website said it was “under maintenance,” hours after the site was hijacked and redirected to a page believed to be controlled by the hackers, which no longer loads. The redirected page condemned the truckers who descended on Canada’s capital to oppose mandatory COVID-19 vaccinations, causing widespread disruption to traffic and trade for more than a week.\n The page also contained a link to a file containing tens of thousands of records of what was described as “raw donation data” about those who donated to the Freedom Convoy.\n  A short time later, nonprofit leak site Distributed Denial of Secrets said it had received 30 megabytes of donor information from GiveSendGo, including self-reported names, email addresses, ZIP codes and IP addresses.\n Distributed Denial of Secrets, a site known for hosting sets of leaked data involving far-right groups, said that the data would only be provided to researchers and journalists.\n   The breach is separate from an earlier security lapse, in which GiveSendGo left exposed to the internet an Amazon-hosted S3 bucket  storing over a thousand identity documents, according to journalist Mikael Thalen, who  first reported the data breach overnight.\n The Boston, Massachusetts-based GiveSendGo became the primary donation service for the “Freedom Convoy” last month after GoFundMe halted the crowdsourcing campaign and froze millions of dollars in donations, citing police reports of violence across Ottawa. Over the weekend, a Canadian court issued an order halting access to the funds collected by GiveSendGo, which the company said it would defy.\n Earlier in the month, the protesters raised more than $8 million for the Freedom Convoy.\n Updated to clarify that the data given to Distributed Denial of Secrets was for the Freedom Convoy data, not every campaign.", "posttime": "2022-02-15 16:12:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,捐赠者,leak,数据", "title": "GiveSendGo入侵后，黑客泄露了“自由护航”捐赠者的名字", "title_en": "Hackers leak names of ‘Freedom Convoy’ donors after GiveSendGo breach", "transed": 1, "url": "https://techcrunch.com/2022/02/14/freedom-convoy-donor-leak-givesendgo/", "via": "", "real_tags": ["黑客", "捐赠者", "leak", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，我通过一个应用程序预订了一辆出租车，让我从伦敦一个朋友家里回来。这时发生了两件奇怪的事。首先，司机假装来接我，然后立即完成了旅程，这样他们就可以得到最低4英镑的关税——我现在不处理这个问题。接下来，该应用向我额外收取了15英镑的“技术费”——这就是我想说的。\n因为我使用了一种算法而被额外收费，这让我思考；软件在我们的世界中扮演什么角色？我们为什么要构建它？\n金钱不是一个充分的答案，因为它适用于所有行业。此外，软件行业目前的蓬勃发展状态也没有削减成本，因为其他行业也出现了这种情况，而且在某个时候可能会饱和。我们正在寻找更普遍、更永恒的东西。\n这个应用没有抓住重点。向客户收取超过实际服务金额三倍的费用，这太违反直觉，更重要的是；感觉应用程序不在我的服务范围内。事实上，感觉正好相反；我为一家糟糕的企业服务。碰巧的是，我有足够的技术，知道即使是为机器学习定制的最先进的云实例，在找到我的出租车花了60秒的时间里，也没有达到这个成本。除非我错过了非常重要的东西，否则这就是客户支出的全部利润率。这是不对的，也不是应该的。\n我认为软件应该得到报酬，而且报酬应该很高，以支持其员工、基础设施和寿命。然而，软件并没有为组织提供浅薄的机会来利用人们的口袋，比如这15%。相反，它应该为各方创造以前无法获得的价值。每隔一段时间，我们需要后退一步，问几个问题；我们为什么要建这个？它是否达到了目的？是为使用它的人服务吗？\n我看到我们在软件方面有一个非常好的机会。我们可以提供更多的工作岗位和更有意义的工作岗位，提供成本更低的产品和服务，甚至创造更多的利润。这可能是一场全胜的比赛。别毁了这一切。相反，让我们实现这一点。\n附言：虽然不重要，但我要求退款，因为这笔交易中发生了明显的欺诈行为，全额很快得到了报销。他们值得祝贺，因为他们提供了出色的客户支持，但这并没有改变一个事实，即“技术费”本来就不应该存在。\n在LOGIC，我们努力创造有意义的软件产品，让我们的生活变得更好。你可能想看看我们最新的自制产品Remote Work Café，它可以帮助人们找到一家很棒的咖啡馆进行远程工作或联系hey@withlogic.co帮助您设计、构建和扩展产品。", "note_en": "A few weeks ago I ordered a cab through an app to get me back to my hotel from a visit at a friend’s house in London. Two peculiar things happened at this moment. First, the driver pretended to pick me up and then completed the ride immediately, so they could get the minimum £4 tariff — I will not deal with this right now. Next, the app charged me an additional £15 “technology fee” — that is what I want to talk about.\n  Being charged extra because I used an algorithm, made me think; what is the role of software in our world and why do we build it?\n Money is not an adequate answer, as it’s valid for all sorts of industries. Also, the current flourishing status of the software industry does not make the cut either, as this has happened with other industries and is likely to saturate at some point. We are looking for something more universal and timeless.\n This app missed the point. Charging a customer a fee, more than triple the amount of the actual service, is way too counter intuitive and more importantly; does not feel like the app is at my service. Actually, it felt the other way around; I was at the service of a poor business. It happens also that I am technical enough to know that even the most advanced cloud instance tailored for machine learning does not even approach this cost for the 60 seconds it took it to find my cab. Unless I am missing something terribly important, that was all profit margin on the customer’s expense. This is not right and it is not the way it is supposed to be.\n I think software should be paid, and be paid well, to support its staff, infrastructure and longevity. Software does not exist though to provide organisations with shallow opportunities to exploit people’s pockets, like with these 15£. On the contrary, it should generate value, that was not accessible before, for all parties. Every once in a while, we need to take a step back and ask a few questions; Why are we building this? Is it serving its purpose? Is it at the service of the people that will use it?\n I see that we have a fascinating opportunity with software. We can provide more jobs and more meaningful jobs, less costly products and services and even generate more profits. It can be an all-win game. Let’s not ruin this. Instead, let’s make this happen.\n P.S.: Although not important, I asked for a refund because of the apparent fraud that took place in this transaction and the full amount got reimbursed quickly. They deserve congratulations for the great customer support, but this does not alter the fact that this “technology fee” should never exist in the first place.\n  At  LOGIC we strive to create meaningful software products that make our lives better. You might want to take a look at  Remote Work Café, our latest home-brew product, helping people find a great café to work remotely or reach out at  hey@withlogic.co to help you architect, build and scale your products.", "posttime": "2022-02-15 16:10:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "algorithms,算法,程序,fee", "title": "因使用算法，出租车招呼应用程序收取了15英镑的“技术费”", "title_en": "Got charged £15 “technology fee” by cab hailing app because it uses algorithms", "transed": 1, "url": "https://stateofprogress.blog/2022/01/11/the-role-of-software.html", "via": "", "real_tags": ["算法", "程序", "fee"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073468, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "稳健性原则，通常被称为&#34；发送的内容要保守，接受的内容要自由&#34；，长期以来一直指导着互联网协议的设计和实施。该声明倡导的姿态在短期内促进了互操作性，但随着时间的推移，可能会对原生态系统产生负面影响。对于积极维护的协议，可以也应该避免使用健壮性原则。¶\n本文档的讨论在架构讨论邮件列表（架构）上进行-discuss@ietf.org)，存档于https://mailarchive.ietf.org/arch/browse/architecture-discuss/. ¶\n本互联网草案完全符合BCP 78和BCP 79的规定。¶\n互联网草案是互联网工程任务组（IETF）的工作文件。请注意，其他小组也可以将工作文件作为互联网草稿分发。目前互联网上的草稿列表位于https://datatracker.ietf.org/drafts/current/. ¶\n互联网草案是有效期最长为六个月的文件草案，可随时由其他文件更新、替换或作废。不应将互联网草稿用作参考资料或引用as&#34以外的内容；工作正在进行中&#34; ¶\n版权（C）2021 IETF信托和被认定为文件作者的人。版权所有。¶\n本文件受BCP 78和IETF信托&#39的约束；s与IETF文件相关的法律规定（https://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文档中提取的代码组件必须包括简化的BSD许可证文本，如第4节所述。如简化BSD许可证所述，不提供任何担保。¶\n稳健性原则对互联网的设计有着巨大的影响。正如IAB RFC 1958[原则]所述，稳健原则建议：\n发送时要严格，接收时要宽容。在发送到网络时，实现必须严格遵循规范，并容忍来自网络的错误输入。当有疑问时，无提示地放弃错误输入，而不返回错误消息，除非规范要求这样做。¶\n这个简单的陈述抓住了互操作系统设计中的一个重要概念。许多人认为，应用RoistNeNess原则，有助于互联网的成功，以及一般的互操作协议的设计。¶\n时间和经验表明，如果实现应用健壮性原则，那么对互操作性的负面影响会随着时间的推移而累积。这个问题源于一个隐含在原则中的假设，即不可能影响互联网规模的系统的变化。也就是说，一旦协议规范发布，可能需要现有实现才能更改的更改是不可行的。¶\n对于处于主动维护状态的协议，许多可能导致应用健壮性原则的问题都是无效的。主动协议维护是指协议设计者、实施者和部署者共同努力，在这些协议的实施和部署过程中不断改进和发展协议规范。在协议维护中扮演积极角色的社区可以大大减少甚至消除应用健壮性原则的机会。¶\n有很好的证据表明，许多重要的协议都是在其初始阶段之后常规维护的。尤其是，相当大一部分IETFactivity致力于现有协议的管理。本文件主要用于记录应用稳健性原则所固有的危害，并为处理部署中的互操作性问题提供替代策略。¶\n理想情况下，协议实现永远不必应用健壮性原则。或者，在不可避免的情况下，稳健性原则的使用被视为一种需要迅速恢复的短期变通方法。¶\n稳健性原则产生的背景为其意图和目的提供了有价值的见解。theRFC系列（在RFC 760[IP]中）中，原则的最早形式前面有一句话，揭示了原则的动机：\n虽然本规范的目标是明确协议，但可能存在不同的解释。一般来说，实现在发送行为上应该是保守的，在接收行为上应该是自由的。¶\n该原则的这种表述明确承认了该规范可能不完善的可能性。这以一种重要的方式将该原则置于语境中。¶\n不完美的规范是很自然的，主要是因为需要实现和部署比完善规范更重要。与任何复杂系统一样，协议也从其使用经验中受益匪浅。部署的协议比完美的协议有用得多。稳健性原则是一种适用于系统设计早期阶段的工具。¶\n正如[成功]所表明的，协议的成功或失败更多地取决于有用性等因素，而不是技术上的卓越性。协议规范的及时发布，即使可能存在缺陷，也可能对互联网的最终成功做出重大贡献。¶\n因此，问题不在于前提，而在于结论：公正原则本身。¶\n将稳健性原则应用于早期互联网或任何处于部署早期阶段的系统是有利的。应用这些原则可以促进处理互操作性问题的努力，这将优先发展。然而，延迟可能会放大处理互操作性问题的最终成本。¶\n随着时间的推移，规范的不同实现会出现。当语义组件的解释或表达发生变化时，实现就不再具有完美的互操作性。¶\n实现缺陷通常被认为是导致变化的原因，尽管它是多种因素的组合。将协议应用于原始设计中未提及的用途，或规范中的歧义和错误通常是混淆因素。在阿普罗托考的使用期限内，对说明书的解释可能会出现分歧。¶\n即使出于最好的意图，互操作的压力也可能很大。任何实现都无法避免无限制地用正确性换取互操作性。¶\n以稳健原则中建议的方式对变化做出反应的实施会建立一个反馈周期。随着时间的推移：\n实现逐步添加逻辑，以限制数据的传输方式，或允许接收内容发生变化。¶\n缺陷可以成为事实标准。协议的任何实现都需要复制异常行为，否则无法互操作。这既是应用稳健性原则的结果，也是避免致命错误条件的自然不情愿的产物。确保这种环境中的互操作性通常被称为目标是&#34；bugfor bug兼容&#34；。¶\n例如，在TLS[TLS]中，扩展使用标记长度值格式，可以按任何顺序将它们添加到消息中。但是，如果某些服务器实现遇到以空扩展名结尾的TLS ClientHellomessage，则会终止连接。为了保持互操作性，客户端实现需要注意这个错误，并确保aClientHello消息以非空扩展结尾。¶\n最初的JSON规范[JSON]演示了规范缺陷的影响。RFC 4627省略了一系列关键细节，包括Unicode处理、对象成员的排序和复制，以及数字编码。因此，实现使用了一系列解释。更新后的规范[JSON-BIS]没有纠正这些错误，而是专注于识别JSON的可互操作子集。I-JSON[I-JSON]获取该子集，并定义一种新格式，禁止JSON中有问题的部分。当然，这意味着I-jsoni不能与JSON完全互操作。因此，I-JSON并没有在解析器中广泛实现。许多JSON解析器现在实现了[ECMA262]中指定的更精确的算法。¶\n因此，稳健性原则鼓励人们做出可能导致互操作性问题的反应。尤其是，应用健壮性原则对新协议的早期实现尤其有害，因为早期实现中的怪癖可能会影响所有后续部署。¶\n一旦偏差根深蒂固，纠正这种情况可能极其困难——如果不是不可能的话。¶\n协议实施的互操作性要求由其他部署设置。规范和一致性测试套件（如果有）可以指导实现的初始开发，但实现结果需要与已部署的实现进行互操作。¶\n对于广泛使用的协议，互联网的巨大规模使得大规模的可互操作性测试对于除少数特权之外的所有人都不可行。随着实现数量和bug的增加，使用逆向工程构建新实现的成本也在增加。更糟糕的是，广泛的互操作性所需的一系列调整可能很难发现。¶\n因此，新的实现可能会被迫进入小众应用领域，从而可以更紧密地管理互操作性问题带来的问题。然而，将新的实现限制在有限的部署中可能会导致协议中出现分叉。如果实现不能互操作，就很难防止这些实现随着时间的推移出现更多分歧。¶\n这对议定书的生态系统有负面影响。新的实施对于确保协议的持续可行性非常重要。新的协议实现也更有可能针对新的和多样化的用例进行开发，并且通常是现有用户受益的特性和功能的来源。¶\n解决互操作性问题的需要也降低了已建立的实现进行更改的能力。针对互操作性问题的缓解措施的累积使得实现更难维护，并且无法训练可扩展性（另请参见[USE-IT]）。¶\n有时，看似互操作性的问题是协议设计问题的症候。一个愿意通过修改或扩展协议来对协议进行修改的社区，可以在这个过程中使协议变得更好。相反，应用稳健性原则会隐藏问题，使得以后更难甚至不可能解决问题。¶\n健壮性原则可以非常有效地防止对等方执行协议时出现缺陷。尤其是当一个规范在很长一段时间内保持不变时，容忍错误的动机会随着时间的推移而累积。事实上，当面对一个不变规范的不同解释时，实现保持可互操作性的唯一方法是容忍解释和实现错误的差异。¶\n从这个角度来看，将健壮性原则应用于实现不变的协议规范是合乎逻辑的，甚至是必要的。但这一结论依赖于一个假设，即现有规范和实现无法更改。以这种方式应用鲁棒性原则，会不成比例地重视短期收益，而不是对未来实现和整个协议的负面影响。¶\n为了使协议具有持续的生存能力，除了处理随着时间的推移可能出现的新问题和旧问题外，规范和实现都必须对变化做出响应。¶\n维护规范，使其与部署紧密匹配，可以确保实现一致的互操作性，并为新实现消除不必要的障碍。维护还可以持续改进协议。新的用例是协议可能成功的一个指标。¶\n强烈鼓励协议设计人员在最初的开始和定义之后继续维护和改进协议规范。这可能需要制定修订后的规范、扩展或其他支持材料，以记录协议的当前状态。实施和部署协议的人员的参与是这一过程的关键部分，因为他们提供了关于如何使用协议的经验的输入。¶\n大多数互操作性问题不需要修改协议或协议规范。例如，在对等网络中处理有效实现的最有效方法可能是向负责的开发人员发送电子邮件。从长远来看，修复一个孤立的bug要比处理变通方法的后果有效得多。¶\n协议的早期实现有更严格的义务严格遵守规范，因为它们的行为将影响所有后续实现。除了规范之外，以后的实现将以现有部署所接受的内容为指导。在早期部署中容忍错误最有可能导致问题。在早期部署期间，协议规范可能需要更频繁的修订，以获取早期部署的反馈。¶\n忽视会很快产生本文件所述的负面后果。将协议恢复到可以维护的状态需要首先在部署时发现协议的属性，而不是最初记录的协议。这可能既困难又耗时，尤其是当协议有多种实现时。在经过一段时间的最少维护后，HTTP[HTTP]就开始了这样一个过程。将HTTP规范恢复到relevancetook需要付出巨大的努力。¶\n如果维护是响应性的，那么它是最有效的，这在很大程度上受部署协议更改的速度的影响。对于在较长时间范围内运行的协议部署，可能需要遵循鲁棒性原则的精神采取临时解决办法。如果规范比部署更容易更新，则可以记录解决方案的详细信息，包括不再需要解决方案时所需的协议形式，以及删除解决方案的计划。¶\n良好的可扩展性[EXT]可以更容易地响应协议部署环境中的新用例或更改。¶\n扩展协议的能力有时被误认为是应用了可靠性原则。毕竟，如果一方希望在另一方准备接收新功能之前就开始使用它，那么可能会假设接收方能够容忍意外的输入。¶\n设计良好的可扩展性机制为处理新消息或参数等事项建立了明确的规则。这取决于对格式错误或非法输入的处理有明确的规则，以便在所有可能影响互操作的情况下实现行为一致。如果扩展机制和错误处理被正确地设计和实现，那么新的协议特性就可以在理解它们对现有实现的影响的情况下进行部署。¶\n相比之下，依赖实现来一致地应用健壮性原则并不是一个好的可扩展性策略。如[EXT]附录a.3中的案例研究所示，使用协议的未记录或附带特性作为扩展机制的基础可能非常困难。¶\n协议可以设计为允许一组有限的有效输入，也可以允许广泛的输入作为核心功能（例如参见[HTML]）。指定和实施更灵活的协议更加困难；在没有充分理由保持灵活性的情况下，无许可可变性更可取。¶\n明确规定的协议包括一致处理异常情况的规则。这增加了实现对异常情况进行一致且可互操作处理的可能性。¶\n不容忍任何偏离规范的行为，在这种情况下，实现会因观察到未定义或异常的行为而产生默认错误，从而减少异常实现的发生。选择为未指定的条件生成致命错误，而不是尝试错误恢复，可以确保故障得到关注。¶\n这尤其改善了对新实现的反馈。当一个新的实现遇到一个不能容忍错误的对等方时，它会收到强烈的反馈，从而能够快速发现问题。¶\n为了有效，不容忍的实现需要得到足够广泛的部署，以使新的实现很可能遇到它们。这可能取决于部署严格检查的多个实现。¶\n这并不意味着不容忍协议早期部署中的错误会影响互操作性。相反，当现有的实现遵循明确指定的错误处理时，新的实现或功能可以更容易地引入，因为对现有实现的影响可以很容易地预测；另见第6节。¶\n任何不容忍也需要得到规范的有力支持，否则它们会导致协议社区的分裂或工作环境的扩散；见第8节。¶\n不容忍可以用来激励遵守任何协议要求。例如，TTP/2[HTTP2]中的不充分的_安全错误代码和相关要求导致部署基地的安全性得到改善。¶\n任何受维护引起的更改影响的协议参与者，如果他们不愿意或无法实施或部署对协议所做的更改，则可以将其排除在外。¶\n故意排除有问题的实现是一个重要工具，可以确保协议的互操作性仍然可行。尽管可兼容的更改总是比不兼容的更改更可取，但并不总是能够产生一种保护所有当前和未来协议参与者互操作能力的设计。开发和部署具有排除以前互操作实现风险的更改需要一定的谨慎，但不应仅以排除风险为由阻止对协议的更改。¶\n当选择不容忍错误时，排除是一个直接目标（见第7节）。排他性行为是为了保护未来的互操作性而故意采取的。¶\n排除实施或部署可能会导致协议系统崩溃，这可能比遵循健壮性原则导致的任何分歧更有害。RFC 5704[UNCOORDINATED]描述了协议维护中的冲突或竞争如何导致类似问题。¶\n草率的实现、对规范的松散解释，以及为弥补规范中的漏洞而对需求进行的不协调，都可能导致不安全问题。隐藏协议变化的后果会鼓励隐藏问题，这会隐藏错误并使其难以发现。¶\n本文档中描述的问题的后果对于安全性依赖于协议元素语义一致性的任何协议来说都是特别严重的。对于ins\n......", "note_en": "The robustness principle, often phrased as &#34;be conservative in what you send,and liberal in what you accept&#34;, has long guided the design and implementationof Internet protocols. The posture this statement advocates promotesinteroperability in the short term, but can negatively affect the protocolecosystem over time. For a protocol that is actively maintained, the robustnessprinciple can, and should, be avoided. ¶\n Discussion of this document takes place on the Architecture-Discuss mailing list (architecture-discuss@ietf.org), which is archived at  https://mailarchive.ietf.org/arch/browse/architecture-discuss/. ¶\n This Internet-Draft is submitted in full conformance with the provisions of BCP 78 and BCP 79. ¶\n Internet-Drafts are working documents of the Internet Engineering Task Force (IETF). Note that other groups may also distribute working documents as Internet-Drafts. The list of current Internet-Drafts is at   https://datatracker.ietf.org/drafts/current/. ¶\n Internet-Drafts are draft documents valid for a maximum of six months and may be updated, replaced, or obsoleted by other documents at any time. It is inappropriate to use Internet-Drafts as reference material or to cite them other than as &#34;work in progress.&#34; ¶\n Copyright (c) 2021 IETF Trust and the persons identified as the document authors. All rights reserved. ¶\n This document is subject to BCP 78 and the IETF Trust&#39;s Legal Provisions Relating to IETF Documents (  https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License. ¶\n  The robustness principle has been hugely influential in shaping the design ofthe Internet. As stated in IAB RFC 1958  [ PRINCIPLES], the robustnessprinciple advises to: ¶\n Be strict when sending and tolerant when receiving. Implementations must follow specifications precisely when sending to the network, and tolerate faulty input from the network. When in doubt, discard faulty input silently, without returning an error message unless this is required by the specification. ¶\n This simple statement captures a significant concept in the design ofinteroperable systems. Many consider the application of the robustnessprinciple to be instrumental in the success of the Internet as well as thedesign of interoperable protocols in general. ¶\n Time and experience shows that negative consequences to interoperabilityaccumulate over time if implementations apply the robustness principle. Thisproblem originates from an assumption implicit in the principle that it is notpossible to affect change in a system the size of the Internet. That is, theidea that once a protocol specification is published, changes that might requireexisting implementations to change are not feasible. ¶\n Many problems that might lead to applications of the robustness principle areavoided for protocols under active maintenance. Active protocol maintenance iswhere a community of protocol designers, implementers, and deployers worktogether to continuously improve and evolve protocol specifications alongsideimplementations and deployments of those protocols. A community that takes anactive role in the maintenance of protocols can greatly reduce and eveneliminate opportunities to apply the robustness principle. ¶\n There is good evidence to suggest that many important protocols are routinelymaintained beyond their inception. In particular, a sizeable proportion of IETFactivity is dedicated to the stewardship of existing protocols. This documentserves primarily as a record of the hazards inherent in applying the robustnessprinciple and to offer an alternative strategy for handling interoperabilityproblems in deployments. ¶\n Ideally, protocol implementations never have to apply the robustness principle.Or, where it is unavoidable, use of the robustness principle is viewed as ashort term workaround that needs to be quickly reverted. ¶\n The context from which the robustness principle was developed provides valuableinsights into its intent and purpose. The earliest form of the principle in theRFC series (in RFC 760  [ IP]) is preceded by a sentence that revealsthe motivation for the principle: ¶\n While the goal of this specification is to be explicit about the protocol there is the possibility of differing interpretations. In general, an implementation should be conservative in its sending behavior, and liberal in its receiving behavior. ¶\n This formulation of the principle expressly recognizes the possibility that thespecification could be imperfect. This contextualizes the principle in animportant way. ¶\n An imperfect specification is natural, largely because it is more important toproceed to implementation and deployment than it is to perfect a specification.A protocol, like any complex system, benefits greatly from experience with itsuse. A deployed protocol is immeasurably more useful than a perfect protocol.The robustness principle is a tool that is suited to early phases of systemdesign. ¶\n As  [ SUCCESS] demonstrates, success or failure of a protocol dependsfar more on factors like usefulness than on on technical excellence. Timelypublication of protocol specifications, even with the potential for flaws,likely contributed significantly to the eventual success of the Internet. ¶\n The problem is therefore not with the premise, but with its conclusion: therobustness principle itself. ¶\n The application of the robustness principle to the early Internet, or any systemthat is in early phases of deployment, is expedient. Applying the principledefers the effort of dealing with interoperability problems, which prioritizesprogress. However, deferral can amplify the ultimate cost of handlinginteroperability problems. ¶\n Divergent implementations of a specification emerge over time. When variationsoccur in the interpretation or expression of semantic components,implementations cease to be perfectly interoperable. ¶\n Implementation bugs are often identified as the cause of variation, though it isoften a combination of factors. Application of a protocol to uses that were notanticipated in the original design, or ambiguities and errors in thespecification are often confounding factors. Disagreements on theinterpretation of specifications should be expected over the lifetime of aprotocol. ¶\n Even with the best intentions, the pressure to interoperate can be significant.No implementation can hope to avoid having to trade correctness forinteroperability indefinitely. ¶\n An implementation that reacts to variations in the manner recommended in therobustness principle sets up a feedback cycle. Over time: ¶\n Implementations progressively add logic to constrain how data is transmitted,or to permit variations in what is received. ¶\n A flaw can become entrenched as a de facto standard. Any implementation of theprotocol is required to replicate the aberrant behavior, or it is notinteroperable. This is both a consequence of applying the robustness principle,and a product of a natural reluctance to avoid fatal error conditions. Ensuringinteroperability in this environment is often referred to as aiming to be &#34;bugfor bug compatible&#34;. ¶\n For example, in TLS  [ TLS] extensions use a tag-length-value format,and they can be added to messages in any order. However, some serverimplementations terminate connections if they encounter a TLS ClientHellomessage that ends with an empty extension. To maintain interoperability, clientimplementations are required to be aware of this bug and ensure that aClientHello message ends in a non-empty extension. ¶\n The original JSON specification  [ JSON] demonstrates the effect ofspecification shortcomings. RFC 4627 omitted critical details on a range of keydetails including Unicode handling, ordering and duplication of object members,and number encoding. Consequently, a range of interpretations were used byimplementations. An updated specification  [ JSON-BIS] did not correctthese errors, concentrating instead on identifying the interoperable subset ofJSON. I-JSON  [ I-JSON] takes that subset and defines a new formatthat prohibits the problematic parts of JSON. Of course, that means that I-JSONis not fully interoperable with JSON. Consequently, I-JSON is not widelyimplemented in parsers. Many JSON parsers now implement the more precisealgorithm specified in  [ ECMA262]. ¶\n The robustness principle therefore encourages a reaction that can createinteroperability problems. In particular, the application of the robustnessprinciple is particularly deleterious for early implementations of new protocolsas quirks in early implementations can affect all subsequent deployments. ¶\n Once deviations become entrenched, it can be extremely difficult - if notimpossible - to rectify the situation. ¶\n Interoperability requirements for protocol implementations are set by otherdeployments. Specifications and - where they exist - conformance test suitesmight guide the initial development of implementations, but implementationsultimately need to interoperate with deployed implementations. ¶\n For widely used protocols, the massive scale of the Internet makes large-scaleinteroperability testing infeasible for all but a privileged few. The cost ofbuilding a new implementation using reverse engineering increases as the numberof implementations and bugs increases. Worse, the set of tweaks necessary forwide interoperability can be difficult to discover. ¶\n Consequently, new implementations might be forced into niche uses, where theproblems arising from interoperability issues can be more closely managed.However, restricting new implementations into limited deployments risks causingforks in the protocol. If implementations do not interoperate, little preventsthose implementations from diverging more over time. ¶\n This has a negative impact on the ecosystem of a protocol. New implementationsare important in ensuring the continued viability of a protocol. New protocolimplementations are also more likely to be developed for new and diverse usecases and often are the origin of features and capabilities that can be ofbenefit to existing users. ¶\n The need to work around interoperability problems also reduces the ability ofestablished implementations to change. An accumulation of mitigations forinteroperability issues makes implementations more difficult to maintain and canconstrain extensibility (see also  [ USE-IT]). ¶\n Sometimes what appear to be interoperability problems are symptomatic of issuesin protocol design. A community that is willing to make changes to theprotocol, by revising or extending it, makes the protocol better in the process.Applying the robustness principle instead conceals problems, making it harder,or even impossible, to fix them later. ¶\n The robustness principle can be highly effective in safeguarding against flawsin the implementation of a protocol by peers. Especially when a specificationremains unchanged for an extended period of time, incentive to be tolerant oferrors accumulates over time. Indeed, when faced with divergent interpretationsof an immutable specification, the only way for an implementation to remaininteroperable is to be tolerant of differences in interpretation andimplementation errors. ¶\n From this perspective, application of the robustness principle to theimplementation of a protocol specification that does not change is logical, evennecessary. But that conclusion relies on an assumption that existingspecifications and implementations are unable to change. Applying therobustness principle in this way disproportionately values short-term gains overthe negative effects on future implementations and the protocol as a whole. ¶\n For a protocol to have sustained viability, it is necessary for bothspecifications and implementations to be responsive to changes, in addition tohandling new and old problems that might arise over time. ¶\n Maintaining specifications so that they closely match deployments ensures thatimplementations are consistently interoperable and removes needless barriers fornew implementations. Maintenance also enables continued improvement of theprotocol. New use cases are an indicator that the protocol could be successful [ SUCCESS]. ¶\n Protocol designers are strongly encouraged to continue to maintain and evolveprotocol specificationss beyond their initial inception and definition. Thismight require the development of revised specifications, extensions, or othersupporting material that documents the current state of the protocol.Involvement of those who implement and deploy the protocol is a critical part ofthis process, as they provide input on their experience with how the protocol isused. ¶\n Most interoperability problems do not require revision of protocols or protocolspecifications. For instance, the most effective means of dealing with adefective implementation in a peer could be to email the developer responsible.It is far more efficient in the long term to fix one isolated bug than it is todeal with the consequences of workarounds. ¶\n Early implementations of protocols have a stronger obligation to closely followspecifications as their behavior will affect all subsequent implementations. Inaddition to specifications, later implementations will be guided by whatexisting deployments accept. Tolerance of errors in early deployments is mostlikely to result in problems. Protocol specifications might need more frequentrevision during early deployments to capture feedback from early rounds ofdeployment. ¶\n Neglect can quickly produce the negative consequences this document describes.Restoring the protocol to a state where it can be maintained involves firstdiscovering the properties of the protocol as it is deployed, rather than theprotocol as it was originally documented. This can be difficult andtime-consuming, particularly if the protocol has a diverse set ofimplementations. Such a process was undertaken for HTTP  [ HTTP] aftera period of minimal maintenance. Restoring HTTP specifications to relevancetook significant effort. ¶\n Maintenance is most effective if it is responsive, which is greatly affected byhow rapidly protocol changes can be deployed. For protocol deployments thatoperate on longer time scales, temporary workarounds following the spirit of therobustness principle might be necessary. If specifications can be updated morereadily than deployments, details of the workaround can be documented, includingthe desired form of the protocols once the need for workarounds no longer existsand plans for removing the workaround. ¶\n Good extensibility  [ EXT] can make it easier to respond to new usecases or changes in the environment in which the protocol is deployed. ¶\n The ability to extend a protocol is sometimes mistaken for an application of therobustness principle. After all, if one party wants to start using a newfeature before another party is prepared to receive it, it might be assumed thatthe receiving party is being tolerant of unexpected inputs. ¶\n A well-designed extensibility mechanism establishes clear rules for the handlingof things like new messages or parameters. This depends on having clear rulesfor the handling of malformed or illegal inputs so that implementations behaveconsistently in all cases that might affect interoperation. If extensionmechanisms and error handling are designed and implemented correctly, newprotocol features can be deployed with confidence in the understanding of theeffect they have on existing implementations. ¶\n In contrast, relying on implementations to consistently apply the robustnessprinciple is not a good strategy for extensibility. Using undocumented oraccidental features of a protocol as the basis of an extensibility mechanism canbe extremely difficult, as is demonstrated by the case study in   Appendix A.3 of [ EXT]. ¶\n A protocol could be designed to permit a narrow set of valid inputs, or it couldallow a wide range of inputs as a core feature (see for example  [ HTML]).Specifying and implementing a more flexible protocol is more difficult; allowingless variability is preferable in the absence of strong reasons to be flexible. ¶\n A well-specified protocol includes rules for consistent handling of aberrantconditions. This increases the chances that implementations will haveconsistent and interoperable handling of unusual conditions. ¶\n Intolerance of any deviation from specification, where implementations generatefatal errors in response to observing undefined or unusual behaviour, can beharnessed to reduce occurrences of aberrant implementations. Choosing togenerate fatal errors for unspecified conditions instead of attempting errorrecovery can ensure that faults receive attention. ¶\n This improves feedback for new implementations in particular. When a newimplementation encounters a peer that is intolerant of an error, it receivesstrong feedback that allows the problem to be discovered quickly. ¶\n To be effective, intolerant implementations need to be sufficiently widelydeployed that they are encountered by new implementations with high probability.This could depend on multiple implementations deploying strict checks. ¶\n This does not mean that intolerance of errors in early deployments of protocolshave the effect of preventing interoperability. On the contrary, when existingimplementations follow clearly specified error handling, new implementations orfeatures can be introduced more readily as the effect on existingimplementations can be easily predicted; see also  Section 6. ¶\n Any intolerance also needs to be strongly supported by specifications, otherwisethey encourage fracturing of the protocol community or proliferation ofworkarounds; see  Section 8. ¶\n Intolerance can be used to motivate compliance with any protocol requirement.For instance, the INADEQUATE_SECURITY error code and associated requirements inHTTP/2  [ HTTP2] resulted in improvements in the security of thedeployed base. ¶\n Any protocol participant that is affected by changes arising from maintenancemight be excluded if they are unwilling or unable to implement or deploy changesthat are made to the protocol. ¶\n Deliberate exclusion of problematic implementations is an important tool thatcan ensure that the interoperability of a protocol remains viable. Whilecompatible changes are always preferable to incompatible ones, it is not alwayspossible to produce a design that protects the ability of all current and futureprotocol participants to interoperate. Developing and deploying changes thatrisk exclusion of previously interoperating implementations requires some care,but changes to a protocol should not be blocked on the grounds of the risk ofexclusion alone. ¶\n Exclusion is a direct goal when choosing to be intolerant of errors (see Section 7). Exclusionary actions are employed with the deliberate intentof protecting future interoperability. ¶\n Excluding implementations or deployments can lead to a fracturing of theprotocol system that could be more harmful than any divergence resulting fromfollowing the robustness principle. RFC 5704  [ UNCOORDINATED]describes how conflict or competition in the maintenance of protocols can leadto similar problems. ¶\n Sloppy implementations, lax interpretations of specifications, and uncoordinatedextrapolation of requirements to cover gaps in specification can result insecurity problems. Hiding the consequences of protocol variations encouragesthe hiding of issues, which can conceal bugs and make them difficult todiscover. ¶\n The consequences of the problems described in this document are especially acutefor any protocol where security depends on agreement about semantics of protocolelements. For ins\n......", "posttime": "2022-02-15 15:58:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "稳健性,consequences,协议", "title": "稳健性原则的有害后果", "title_en": "The harmful consequences of the robustness principle", "transed": 1, "url": "https://www.ietf.org/archive/id/draft-iab-protocol-maintenance-05.html", "via": "", "real_tags": ["稳健性", "协议"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "../", "note_en": "../\r edge/ 30-Sep-2015 07:58 -\r latest-stable/ 12-Nov-2021 13:57 -\r v3.0/ 07-May-2014 22:52 -\r v3.1/ 01-Jan-2015 07:25 -\r v3.10/ 31-May-2019 18:14 -\r v3.11/ 06-Dec-2019 18:36 -\r v3.12/ 22-May-2020 09:41 -\r v3.13/ 15-Jun-2021 19:47 -\r v3.14/ 24-Nov-2021 11:46 -\r v3.15/ 12-Nov-2021 13:57 -\r v3.2/ 24-Apr-2015 09:24 -\r v3.3/ 21-Dec-2015 14:43 -\r v3.4/ 21-Apr-2016 12:39 -\r v3.5/ 16-Nov-2016 16:01 -\r v3.6/ 20-Apr-2017 10:47 -\r v3.7/ 23-Nov-2017 21:25 -\r v3.8/ 27-Apr-2018 06:06 -\r v3.9/ 15-Nov-2018 16:03 -\r MIRRORS.txt 14-Feb-2022 23:00 2245\r last-updated 15-Feb-2022 07:00 11", "posttime": "2022-02-15 15:57:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,dl", "title": "HTTP://dl-cdn。阿尔皮内鲁克斯。org/alpine/关闭（错误503后端不正常）", "title_en": "HTTP: //dl-cdn.alpinelinux.org/alpine/ is down (Error 503 Backend is unhealthy)", "transed": 1, "url": "http://dl-cdn.alpinelinux.org/alpine/", "via": "", "real_tags": ["linux", "dl"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073465, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个SQL表，包含2020年5月30日图书馆创世纪项目（Library Genesis project）发布的每篇文章的元数据。\n获取Sci中心内容：自2015年起，完整的Sci中心数据库可在torrents上下载。Torrents是一种让用户能够以分散的方式在互联网上分发数据和电子文件的技术。\n你可以在这里下载洪流。Torrents由Library Genesis项目提供。在2021 ReDeD社区启动了SCI集线器的救援任务，并敦促每个人下载和播种种子，以确保数据库的长期保存。\nSci Hub在2013年至2016年期间增长最快。这是因为它从期刊档案中下载旧论文。在那之后，它只需要下载新的论文。\nCrossref metadata——一个庞大的数据库，由内政部为研究文件编制索引，提供关于作者、年份、标题和每个项目的其他元数据的信息。该数据库包含超过1.2亿条记录，具有API，可在torrents上下载。\n卡尔·马拉默德&#39；s通用索引——一个庞大的数据集，按n-gram索引1.07亿篇学术论文\nopen引文语料库：一个自由开放的数据库，包含相互引用论文的信息\nScopus——该数据库不是免费的，但有一个可自由访问的表，其中包含注册后可下载的科学期刊信息\nSCImago杂志；国家排名——一个可自由访问的数据库，包含有关科学期刊的信息", "note_en": "an SQL table with metadata for every article from 30 May 2020 made by   Library Genesis project.\n  To get Sci-Hub contents: Since 2015 the full Sci-Hub database is available on torrents for download. Torrents are technology that enables users to distribute data and electronic files over the Internet in a decentralized manner.\n  You can  download the torrents here. Torrents are provided by  the  Library Genesis project. In 2021 Redit community started  a rescue mission for Sci-Hub and urged everyone to download and seed torrents, to ensure long preservation of database.\n  Sci-Hub was growing most quickly in the period from 2013 to 2016. That is because it was downloading old papers from journal archives. After that it only had to download new papers.\n  Crossref metadata - a gigantic database that indexes research documents by DOIs, providing information about authors, year, title and other metadata for every item. The database contains 120+ million records,  has API and is availabe for download on  torrents.\n  Carl Malamud&#39;s General Index - a gigantic dataset that indexes 107 million academic papers by n-grams\n  OpenCitations Corpus a free and open database that has information about papers citing each other\n  Scopus - the database is not free, but has freely accessible table with information about scientific journals that can be downloaded after registration\n  SCImago Journal &amp; Country Rank - a freely accessible database with information about scientific journals", "posttime": "2022-02-15 15:50:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,中心,hub", "title": "Sci中心统计和数据库", "title_en": "Sci-Hub statistics and database", "transed": 1, "url": "https://sci-hub.ru/database", "via": "", "real_tags": ["database", "数据库", "中心", "hub"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073464, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019冠状病毒疾病流行在世界各地肆虐，另一种疾病可能正在消失。在2021人中，只有14例感染了几内亚线虫的寄生虫——一种导致皮肤疼痛的寄生虫。\n这是20世纪80年代在20多个国家发现的一种感染的最低记录，每年感染350万人（见《即将绝迹》）——然而，一些科学家说，动物体内残留的寄生虫意味着，如果确实可能的话，根除可能还需要一段时间。\n总部位于佐治亚州亚特兰大的卡特中心根除麦地那龙线虫项目主任亚当·韦斯说：“这真是太神奇了。”。该中心在1月底公布了这些数字。“在一个拥有近80亿人口的星球上，有14个人。想想这个问题，真是令人费解。”\nWeiss说，与2020年报告的27例病例相比，减少了近50%，这是国际组织和各国政府为消除世界上的麦地那龙线虫而进行的近40年努力的结果。如果成功，这种疾病将与天花和牛瘟（一种主要感染牛和水牛的病毒）一起成为人类历史上唯一被有意根除的疾病。\n罗利北卡罗来纳州立大学的疾病建模师朱莉·斯旺（Julie Swann）说，这一进展“非常显著”，尤其是考虑到目前还没有公认的寄生虫治疗或疫苗。相反，根除运动的重点是防止传播，她说。\n人类和一些动物，包括猫、狗和狒狒，通过饮用被几内亚蠕虫幼虫污染的水而感染几内亚蠕虫。在寄主体内生长一年后，这种寄生虫（可能长达一米）会穿过寄主的皮肤，等待与水接触释放幼虫。蠕虫的逃逸是痛苦的，可以持续长达六周，有时会妨碍人们工作甚至行走。\n但是，麦地那龙线虫病的可识别性也使得这种寄生虫很容易被发现。总部位于恩贾梅纳的乍得根除麦地那龙线虫项目协调员菲利普·特欣德贝特·瓦库说，在乍得，去年报告了14例病例中的7例，现场工作人员建立了一个网络来追踪受污染的水源。然后，他们阻止人们饮用受污染的水，并使用杀虫剂对其进行消毒。\n在南苏丹、马里和埃塞俄比亚等国家也使用了类似的方法，其中2021例中有7例被发现。瓦库说，这些方法使病例数保持在较低水平，并可用于治疗其他地方病。\n但斯旺并不完全相信根除是可能的：她说，很难控制有动物宿主的疾病，她指出，仅去年一年，乍得就报告了790例狗感染麦地那龙线虫的病例。\n但2021的动物病例也下降了45%，韦斯仍然乐观认为根除是可以达到的。他说，根除计划正在通过拴住狗来控制寄生虫的传播来解决动物蓄水池的问题。韦斯补充说，狒狒可能是从被狗污染的水中感染了几内亚蠕虫，因此控制狗体内的寄生虫可能有助于控制其在野生动物中的传播。\n“我绝对相信麦地那龙线虫是可以治愈的，”他说。“这需要更多的工作，但如果我们做不到，我会第一个说出来。”\n国际根除疾病特别工作组目前有八种疾病被确定为可能治愈。除了几内亚蠕虫，还有脊髓灰质炎、腮腺炎、风疹、淋巴丝虫病、囊虫病、麻疹和雅司病。", "note_en": "While the COVID-19 pandemic continues to rage around the world, another disease could be on its way out. Only 14 cases of infection with Guinea worm — a parasite that causes painful skin lesions — were reported in humans in 2021.\n This is the lowest tally ever for an infection that, as recently as the 1980s, was found in more than 20 countries and infected 3.5 million people a year (see ‘On the way out’) — however, a remaining reservoir for the parasite in animals means eradication could be a while off, if indeed it is possible, say some scientists.\n “It’s pretty amazing,” says Adam Weiss, director of the Guinea Worm Eradication Program of the Carter Center, which is headquartered in Atlanta, Georgia. The centre announced the numbers in late January. “Fourteen people on a planet of almost eight billion. It’s mind-bending to think about.”\n The reduction — nearly a 50% drop compared with the 27 cases reported in 2020 — is the result of a near 40-year effort by international organizations and national governments to rid the world of Guinea worm, says Weiss. If it succeeds, the condition will join smallpox and rinderpest (a virus that mainly infected cattle and buffalo) as the only diseases to have been purposefully eradicated in human history.\n This progress is “remarkable”, says Julie Swann, a disease modeller at North Carolina State University in Raleigh — especially given that there is no recognized treatment or vaccine for the parasite. Instead, eradication campaigns have focused on preventing transmission, she says.\n   People and some animals, including cats, dogs and baboons, become infected with Guinea worm by drinking water that is contaminated with its larvae. After spending a year growing inside the host, the parasite — which can be up to one metre long — pushes through the skin of its host and waits to come into contact with water to release its larvae. The worm’s escape is painful and can last for up to six weeks, sometimes preventing people from working or even walking.\n But the recognizable nature of Guinea worm disease also makes the parasite easy to detect. In Chad, where 7 of the 14 cases were reported last year, field agents create a network to track contaminated water sources, says Philippe Tchindebet Ouakou, the coordinator of the nation’s Guinea Worm Eradication Program, who is based in N’Djamena. They then prevent people from drinking the contaminated water and use pesticides to disinfect it.\n Similar approaches have been used in countries such as South Sudan, Mali and Ethiopia, where the remaining 7 detected cases in 2021 occurred. These methods are what have kept case numbers low, says Ouakou, and could be used to tackle other endemic diseases.\n But Swann isn’t entirely convinced that eradication is possible: she says that it’s hard to control diseases that have animal reservoirs, pointing out that there were 790 reported cases of Guinea worm infection in dogs in Chad alone last year.\n But animal cases were also down by 45% in 2021 and Weiss remains optimistic that eradication is within reach. He says that eradication programmes are tackling animal reservoirs by tethering dogs to curb the spread of the parasite. Weiss adds that baboons are probably contracting Guinea worm from water contaminated by dogs, so controlling the parasite in dogs could help to rein in its spread in wildlife.\n “I absolutely believe Guinea worm is eradicable,” he says. “It will take more work, but if we couldn’t do it, I’d be the first one to say it.”\n The International Task Force for Disease Eradication currently has eight diseases identified as potentially eradicable. In addition to Guinea worm, these are poliomyelitis, mumps, rubella, lymphatic filariasis, cysticercosis, measles and yaws.", "posttime": "2022-02-15 15:48:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "麦地那,worm,根除", "title": "麦地那龙线虫病即将根除", "title_en": "Guinea worm disease nears eradication", "transed": 1, "url": "https://www.nature.com/articles/d41586-022-00385-z", "via": "", "real_tags": ["麦地那", "worm", "根除"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073463, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "参与基因研究很可能有基因成分。识别这种成分很困难，因为我们无法直接比较参与者和非参与者的基因信息，后者是不可用的。在这里，我们表明，与非参与者相比，参与者中更常见的等位基因将在两个相关参与者共享的基因片段中进一步丰富。通过比较英国生物银行一级亲属对的共享和非共享基因片段中的等位基因频率，进行全基因组分析。在非重叠样本中，根据该分析构建的多基因评分与教育程度（P=2.1x10-52）、体重指数（P=1.5x10-19）和饮食研究参与度（P=6.9x10-21）相关。进一步的分析表明，参与倾向本身就是一种行为特征，而不仅仅是其他既定表型的结果。了解这一特征的基础对于数据分析和未来调查（无论是遗传还是其他）的设计都很重要。", "note_en": "Participation in a genetic study likely has a genetic component. Identifying such component is difficult as we cannot compare genetic information of participants with non-participants directly, the latter being unavailable. Here, we show that alleles that are more common in participants than non-participants would be further enriched in genetic segments shared by two related participants. Genome-wide analysis was performed by comparing allele frequencies in shared and not-shared genetic segments of first-degree relative pairs of the UK Biobank. A polygenic score constructed from that analysis, in non-overlapping samples, is associated with educational attainment (P=2.1x10 -52), body mass index (P=1.5x10 -19), and participation in a dietary study (P=6.9x10 -21). Further analysis shows that inclination to participate is a behavioural trait in its own right, and not simply a consequence of other established phenotypes. Understanding the basis of this trait is important for data analyses and the design of future surveys, genetic or otherwise.", "posttime": "2022-02-15 15:47:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "遗传学,participation,基因", "title": "参与遗传学：方法与分析", "title_en": "The Genetics of Participation: Method and Analysis", "transed": 1, "url": "https://www.biorxiv.org/content/10.1101/2022.02.11.480067v1", "via": "", "real_tags": ["遗传学", "基因"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073462, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2010年，$Expective_COMPANY成立时，它在$TECHBRO_创始人车库的一台服务器上运行。从那时起，我们经历了由VC资助的爆炸性增长，今天我们有来自全球各地的数亿日常活跃用户（DAU）通过我们的移动应用程序和著名公司的美元访问我们的产品。通用域名格式。自那以后，我们对后端进行了几次由恐慌引发的更改，以管理我们的技术债务（通常是在一次引人注目的停机之后），防止我们的服务器崩溃。这些年来，我们现有的技术堆栈一直为我们提供良好的服务，但随着我们寻求进一步发展，很明显，完全重写我们的应用程序将以某种方式防止我们在获得客户方面每年损失20亿美元。\n正如我们在之前的博客文章中提到的那样，$PROFECTION_COMPANY后端在历史上是用$PROFECTION_语言开发的，并且是在$PROFECTION_开源_框架的基础上构建的。为了满足我们的独特需求，我们设计并开源了$AN_ENGINEER_take_A_history_类，这是一个高度可用的即时编译器，只需$unremarable_语言。然而，即使使用自定义运行时，我们最终也开始在第99百分位延迟统计中看到零星的峰值，随着我们扩大规模以处理不断增加的DAU计数，这种峰值变得越来越明显。幸运的是，我们所有的软件都是为自省而从头开始设计的，使用我们从Brendan Gregg的网站复制的一些BPF脚本，我们的内部分析工具$著名的公司工程师确定性能瓶颈是在垃圾收集器中花费时间的结果。\n起初，我们试图搞乱一些我们并不真正理解的垃圾收集器参数，但出乎意料的是，这并没有神奇地解决我们的问题，所以我们完全禁用了垃圾收集。这增加了我们的内存使用，但我们的自动按需定标器为我们解决了这一问题，如下图所示：\n然而，最终，我们之所以决定转学，是因为我们很难用不起眼的_语言聘请新人才，尽管美国各地几十所大学都在教授这种语言。我们在$PRACTICAL_OPEN_SOURCE_FRAMEWORK上发表的博客文章在Reddit上发表时，获得的支持率似乎也更低，这巩固了我们的信念，即我们的技术堆栈现在是遗留代码。\n我们知道，我们需要找到一些能跟上我们的公司规模的东西。我们评估了一些有希望的替代方案，我们根据他们在网站上的要点数量、他们出现在黑客新闻头版的频率，以及我们让办公室人员填写的重要语言特征（性能、效率、社区、易用性）的电子表格，对这些方案进行了选择和排名。\n由于我们的电子表格满足了随机性的强大统计保证，我们能够重用它来取代应用程序的CSPRNG。\n经过仔细考虑，我们决定重新构建我们的平台，使用$FLASHY_语言和$hypod_技术。根据Stack Overflow开发者调查，$FLASHY_语言不仅广受欢迎，而且是跨平台的；我们也在用它来重新实现我们的移动应用。重写我们的核心基础设施相当简单：因为我们拥有的工程师比我们可能需要的更多，甚至不知道该怎么办，我们只是冻结了处理错误报告的工作，并将我们的工作转向了$HYPED_技术。我们最初在适应$FLASHY_语言的一些怪癖方面遇到了一些困难，并在$HYPED_技术上遇到了一些错误，但总体而言，它们强大的新功能让我们消除了以前的解决方案必须处理的一些复杂性。\n在不停机的情况下部署更改需要一些仔细的规划，但这也不太困难：我们只是硬编码状态页面，以便在推送新更改时不进行更新，让用户猜测我们的服务是否已启动。管理增量部署是关键：我们积极地对新代码进行了A/B测试。我们的内部研究表明，通过偶尔向用户展示一个全新的界面，然后在下次加载页面时切换回旧界面，可以提高用户参与度，因此我们确保基于一篇我们发现与多武装匪徒有关的媒体文章实现这样一个系统。\n随着我们的重写工作现已完成并向所有客户推出，我们认为这项工作对我们和我们的团队来说都是巨大的成功。我们已经衡量了我们的绩效，您可以看到以下结果摘要：\n每一个对我们来说重要的指标都在重写后大幅增加，我们甚至发现了一些与我们不再相关的指标，比如错误数量、用户挫折感和维护成本。今天，我们将在GitHub页面上提供一些我们能够负担得起的开源代码。它本身是无用的，而且与我们的基础设施紧密相连，但你可以将其作为明星，让我们看起来更相关。\n人们常说，完全重写软件充满了风险，但我们在$PROFIMENT_公司喜欢下大赌注，很明显，这一次得到了丰厚的回报。虽然我们在这篇博文中重点讨论了后端的变化，但正如我们前面提到的，我们在移动应用程序中也使用了$FLASHY_语言，因为我们没有资源为每个平台编写本机应用程序。不幸的是，为了增加锁定，这些重写也意味着我们将拒绝第三方API访问我们的服务。我们知道我们的一些用户出于可访问性的原因依赖这些界面，但我们$PROFIMENT_COMPANY致力于改善我们为残疾人提供的服务，只要您不使用任何辅助技术，这些技术在我们的应用程序中根本不起作用。\n我们希望你把我们公司的轶事内化为某种真实的事实，并把它展示给你公司的CTO，这样他们也可以考虑重新设计他们的架构，就像我们已经做过的那样。我们知道你会忽略一个事实，那就是你不是我们，我们有足够的工程师和资源来做我们喜欢做的任何事情，但这个决定会毁掉你的初创公司，所以我们不会很快看到你关于你使用$HYPED_技术的经历的博客帖子。如果你无法影响公司的使用，你仍然可以在下一次出现语言战时提出，以便得分。\n如果你正在读这篇文章，并且像我们一样对$HYPED_技术感兴趣，我们正在招聘！一定要查看我们的工作页面，那里将没有与$FLASHY_语言相关的职位。\n问题？评论？更正？欢迎随时联系我saagar@saagarjha.com; 我&#39；I’我很想听听你的想法！", "note_en": "When $FAMOUS_COMPANY launched in 2010, it ran on a single server in $TECHBRO_FOUNDER’s garage. Since then, we’ve experienced explosive VC-funded growth and today we have hundreds of millions of daily active users (DAUs) from all around the globe accessing our products from our mobile apps and on $famouscompany.com. We’ve since made a couple of panic-induced changes to our backend to manage our technical debt (usually right after a high-profile outage) to keep our servers from keeling over. Our existing technology stack has served us well for all these years, but as we seek to grow further it’s clear that a complete rewrite of our application is something which will somehow prevent us from losing two billion dollars a year on customer acquisition.\n  As we’ve mentioned in previous blog posts, the $FAMOUS_COMPANY backend has historically been developed in $UNREMARKABLE_LANGUAGE and architected on top of $PRACTICAL_OPEN_SOURCE_FRAMEWORK. To suit our unique needs, we designed and open-sourced $AN_ENGINEER_TOOK_A_MYTHOLOGY_CLASS, a highly-available, just-in-time compiler for $UNREMARKABLE_LANGUAGE. Even with our custom runtime, however, we eventually began seeing sporadic spikes in our 99th percentile latency statistics, which grew ever more pronounced as we scaled up to handle our increasing DAU count. Luckily, all of our software is designed from the ground up for introspectability, and using  some BPF scripts we copied from Brendan Gregg’s website our in-house profiling tools $FAMOUS_COMPANY engineers determined that the performance bottlenecks were a result of time spent in the garbage collector.\n Initially, we tried messing with some garbage collector parameters we didn’t really understand, but to our surprise that didn’t magically solve our problems so instead we disabled garbage collection altogether. This increased our memory usage, but our automatic on-demand scaler handled this for us, as the graph below shows:\n  Ultimately, however, our decision to switch was driven by our difficulty in hiring new talent for $UNREMARKABLE_LANGUAGE, despite it being taught in dozens of universities across the United States. Our blog posts on $PRACTICAL_OPEN_SOURCE_FRAMEWORK seemed to get fewer upvotes when posted on Reddit as well, cementing our conviction that our technology stack was now legacy code.\n  We knew we needed to find something that could keep up with us at $FAMOUS_COMPANY scale. We evaluated a number of promising alternatives that we selected and ranked based on the how many bullet points they had on their websites, how often they’d appear on the front page of Hacker News, and a spreadsheet of important language characteristics (performance, efficiency, community, ease-of-use) that we had people in the office fill out.\n As our spreadsheet met strong statistical guarantees of randomness, we were able to reuse it to replace our application’s CSPRNG.\n After careful consideration, we settled on rearchitecting our platform to use $FLASHY_LANGUAGE and $HYPED_TECHNOLOGY. Not only is $FLASHY_LANGUAGE popular according to the Stack Overflow developer survey, it’s also cross platform; we’re using it to reimplement our mobile apps as well. Rewriting our core infrastructure was fairly straightforward: as we have more engineers than we could possibly ever need or even know what to do with, we simply put a freeze on handling bug reports and shifted our effort to $HYPED_TECHNOLOGY instead. We originally had some trouble with adapting to some of $FLASHY_LANGUAGE’s quirks, and ran into a couple of bugs with $HYPED_TECHNOLOGY, but overall their powerful new features let us remove some of the complexity that our previous solution had to handle.\n Deploying the changes without downtime required some careful planning, but this was also not too difficult: we just hardcoded the status page to not update whenever we pushed new changes, keeping users guessing if our service was up or not. Managing incremental rollout was key: we aggressively A/B tested the new code. Our internal studies showed that gaslighting users by showing them a completely new interface once in a while and then switching back to the old one the next time they loaded a page increases user engagement, so we made sure to implement such a system based on a Medium article we found that had something to do with multi-armed bandits.\n With our rewrite now complete and rolled out to all of our customers, we think the effort has been a massive success for us and our team. We have measured our performance and you can see a summary of the results below:\n  Every metric that matters to us has increased substantially from the rewrite, and we even identified some that were no longer relevant to us, such as number of bugs, user frustration, and maintenance cost. Today we are making some of the code that we can afford to open source available on our GitHub page. It is useless by itself and is heavily tied to our infrastructure, but you can star it to make us seem more relevant.\n  It’s often said that completely rewriting software is fraught with peril, but we at $FAMOUS_COMPANY like to take big bets, and it’s clear that this one has paid off handsomely. While we focused on our backend changes in this blog post, as we mentioned before we are using $FLASHY_LANGUAGE in our mobile apps as well, since we don’t have the resources to write native applications for each platform. Unfortunately  to increase lock-in these rewrites also mean we will be deprecating third-party API access to our services. We know some of our users relied on these interfaces for accessibility reasons, but we at $FAMOUS_COMPANY are dedicated to improving our services for those with disabilities as long as you aren’t using any sort of assistive technologies, which no longer work at all with our apps.\n We hope that you internalize our company’s anecdote as some sort of ground truth and show it to your company’s CTO so they too can consider redesigning their architecture like we have done. We know you’ll ignore the fact that you’re not us and we have enough engineers and resources to do whatever we like, but the decision will ruin your startup so it’s not like we’ll see  your blog posts about your experience with $HYPED_TECHNOLOGY anytime soon. If you’re not in a position to influence what your company uses, you can still bring it up for point-scoring the next time a language war comes up.\n If you’re reading this and are interested in $HYPED_TECHNOLOGY like we are, we are hiring! Be sure to check out our jobs page, where there will be zero positions related to $FLASHY_LANGUAGE.\n Questions? Comments? Corrections? Feel free to reach out to me at  saagar@saagarjha.com; I&#39;d love to hear your thoughts!", "posttime": "2022-02-15 15:44:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "转用,company", "title": "我们在$著名的公司转用了$炒作的技术", "title_en": "We at $Famous_company Switched to $Hyped_technology", "transed": 1, "url": "https://saagarjha.com/blog/2020/05/10/why-we-at-famous-company-switched-to-hyped-technology/", "via": "", "real_tags": ["转用", "company"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073461, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是开放式课程超过2400门课程之一。在左侧链接的页面中探索本课程的材料。\n麻省理工学院开放式课程是一个免费的；公开出版麻省理工学院数千门课程的材料，涵盖麻省理工学院的全部课程。\n没有注册或登记。以自己的速度自由浏览和使用开放式课程材料。那里&#39；没有注册，也没有开始或结束日期。\n知识是你的奖赏。使用开放式课程来指导自己的终身学习，或者教别人。我们没有&#39；t提供使用开放式课程的学分或认证。\n专为分享而设计。下载文件供以后使用。发送给朋友和同事。修改、重新混合和重用（请记住引用OCW作为源代码。）\n2014年1月是螺母和螺栓IAP课程的25周年纪念日，该课程被INC杂志评为美国十大最佳创业课程之一。\n本课程提供两种观看视频的方式。视频和幻灯片播放器页面以并排双窗口格式显示视频和幻灯片。“课堂视频”页面以标准窗口格式呈现视频，并附带可单独下载的课堂讲稿。\n准备新的创业计划和启动创业的细节将在第二十五届年度课程中探讨。本课程面向麻省理工学院社区成员和其他对创业感兴趣的人开放。特别推荐给有兴趣开始或参与新业务或风险的人。由于一些演讲者将担任麻省理工学院10万美元创业竞赛的评委，计划参加竞赛的人应该会发现这门课程特别有用。在过去，大约50%的学生来自工程/科学/建筑学校，50%来自斯隆管理学院。\n该课程在独立活动期（IAP）提供，这是麻省理工学院的一个为期4周的特殊学期，从1月的第一周到月底。", "note_en": "This is one of over 2,400 courses on OCW. Explore materials for this course in the pages linked along the left.\n  MIT OpenCourseWare is a free &amp; open publication of material from thousands of MIT courses, covering the entire MIT curriculum.\n  No enrollment or registration. Freely browse and use OCW materials at your own pace. There&#39;s no signup, and no start or end dates.\n  Knowledge is your reward. Use OCW to guide your own life-long learning, or to teach others. We don&#39;t offer credit or certification for using OCW.\n  Made for sharing. Download files for later. Send to friends and colleagues. Modify, remix, and reuse (just remember to cite OCW as the source.)\n   January 2014 was the twenty-fifth anniversary of the Nuts and Bolts IAP course, ranked by INC Magazine as one of the  10 Best Entrepreneurship Courses in America.\n This course offers two ways to watch the videos. The  Video and Slide Player page presents the videos and slides in a side-by-side dual window format. The  Lecture Videos page presents the videos in a standard window format with separately downloadable  Lecture Notes.\n  The nuts and bolts of preparing a New Venture Plan and launching the venture will be explored in this twenty-fifth annual course offering. The course is open to members of the MIT Community and to others interested in entrepreneurship. It is particularly recommended for persons who are interested in starting or are involved in a new business or venture. Because some of the speakers will be judges of the MIT $100K Entrepreneurship Competition, persons who are planning to enter the Competition should find the course particularly useful. In the past approximately 50% of the class has been from the Engineering / Science / Architecture Schools and 50% from the Sloan School of Management.\n The course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month.", "posttime": "2022-02-15 15:42:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "商业,开放式,ocw,课程", "title": "麻省理工学院/开放式课程——商业计划的细节（2014）", "title_en": "MIT/OCW Course – Nuts and Bolts of Business Plans (2014)", "transed": 1, "url": "https://ocw.mit.edu/courses/sloan-school-of-management/15-s21-nuts-and-bolts-of-business-plans-january-iap-2014/", "via": "", "real_tags": ["商业", "开放式", "ocw", "课程"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073460, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在研究Repography I和#39时；我已经探索了大量开源Git回购协议。最近看着golang/go，我惊讶地发现第一次提交似乎来自1972年7月的计算机传奇人物布莱恩·克尼根。\n提交7D7C6A97F815E9279D08CFAEA7D5EFB5E90695A8作者：Brian Kernighan&lt；bwk&gt；日期：1972年7月18日星期二19:05:45-0500 hello，world R=ken DELTA=7（添加7个，删除0个，更改0个）diff--git a/src/pkg/debug/macho/testdata/hello。b/src/pkg/debug/macho/testdata/hello。B新文件模式100644index 0000000000。。05c4140424---/dev/null+++b/src/pkg/debug/macho/testdata/hello。b@@@0,0+1,7@@@main（）{+extrn a，b，c；+putchar（a）；putchar（b）；putchar（c）；putchar（&#39；！*n&#39；）+}+a&#39；见鬼+b&#39；o、 w&#39+c&#39；世界&#39；；\n1988年，该团队决定在罗伯特·格里默（Robert Griesemer#39；让我们从第一次提交开始。\n它&#39；It’有趣的是，这些早期提交的文件（最终的ANSI C版本）至今仍在Go repo中。\n我绝对喜欢有人花时间植入这个复活节彩蛋，而且它仍然存在，在这样一个著名的项目中。\n最后，在稍微调整了时间范围后，我绘制了我打算。。。我认为这非常清楚地表明了核心团队是如何随着时间的推移而演变的。它&#39；此外，令人鼓舞的是，几位顶尖贡献者似乎最近才参与进来。\n我想知道还有什么复活节彩蛋和有趣的故事隐藏在历史中？如果你有任何建议，请告诉我们。", "note_en": "While working on Repography I&#39;ve explored a ton of open source Git repos. Recently looking at  golang/go, I was amazed to see the first commit appears to be from computing legend Brian Kernighan in July 1972.\n commit 7d7c6a97f815e9279d08cfaea7d5efb5e90695a8Author: Brian Kernighan &lt;bwk&gt;Date: Tue Jul 18 19:05:45 1972 -0500 hello, world R=ken DELTA=7 (7 added, 0 deleted, 0 changed)diff --git a/src/pkg/debug/macho/testdata/hello.b b/src/pkg/debug/macho/testdata/hello.bnew file mode 100644index 0000000000..05c4140424--- /dev/null+++ b/src/pkg/debug/macho/testdata/hello.b@@ -0,0 +1,7 @@+main( ) {+ extrn a, b, c;+ putchar(a); putchar(b); putchar(c); putchar(&#39;!*n&#39;);+} +a &#39;hell&#39;;+b &#39;o, w&#39;;+c &#39;orld&#39;;\n   In 1988 the team decided to take a break — for about 20 years — before Robert Griesemer&#39;s first commit,  Go spec starting point.\n It&#39;s interesting to note that the file from these early commits (the final ANSI C version) is  still in the Go repo today.\n I absolutely love that someone took the time to implant this easter egg and that it still endures, in such a prominent project.\n  Finally, having fiddled with the time range a bit, I rendered the poster I intended to... I think this makes it super clear how the core team has evolved over time. It&#39;s also encouraging that several of the top contributors appear to have become involved relatively recently.\n  I wonder what other easter eggs and interesting stories are hiding in commit histories? If you have any suggestions please  let us know.", "posttime": "2022-02-15 15:41:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "围棋,language,时间", "title": "围棋语言的第一次承诺（1972年）", "title_en": "The Go language's first commit (1972)", "transed": 1, "url": "https://repography.com/blog/go-first-commit", "via": "", "real_tags": ["围棋", "language", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073459, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考虑在一个大小为$n＝2 ^ { 21 }的数组上的一个步长递增循环，其固定步长为256：\n哪一个更快完成？我想到了几点考虑：\n一开始，您认为应该没有太大的差异，或者第二个循环的速度是$\\frac{257}{256}$倍左右，因为它总共进行了较少的迭代。\n然后你会想起256是一个很好的整数，这可能与SIMD或内存系统有关，所以第一个可能更快。\n但正确的答案是非常违反直觉的：第二个循环更快，而且速度是10倍。\n这不仅仅是一个糟糕的步长。如果所有指数都是2的大幂的倍数，则性能会下降：\n没有矢量化或任何东西，两个循环产生相同的集合，除了步长。这种影响只归因于内存系统，尤其是一种称为缓存关联性的功能，它是CPU缓存在硬件中实现方式的一种特殊产物。\n当我们从理论上研究内存系统时，我们讨论了在软件中实现缓存逐出策略的不同方法。我们关注的一个特定策略是最近最少使用（LRU）策略，它简单有效，但仍然需要一些非平凡的数据操作。\n在硬件环境中，这样的方案被称为完全关联缓存：我们有$M$个单元，每个单元都能够容纳一条缓存线，对应于总内存为$N$的任何位置，在发生争用的情况下，最长未被访问的单元将被踢出并替换为新的单元。\n完全关联缓存的问题是，在软件中实现“在数百万个缓存线中查找最古老的缓存线”操作非常困难，在硬件中则不可行。您可以创建一个具有16个条目左右的完全关联缓存，但管理数百条缓存线已经变得非常昂贵，或者速度太慢，不值得这么做。\n我们可以求助于另一种更简单的方法：只需将RAM中64字节的每个块映射到它可以占用的单个缓存线。比方说，如果我们在内存中有4096个块和64个缓存线，那么每个缓存线在任何时候都存储$\\frac{4096}{64}=64$不同块中的一个块的内容。\n直接映射缓存很容易实现，除了标记（缓存块的实际内存位置）之外，它不需要存储与缓存线相关的任何附加元信息。缺点是，条目可能被踢出得太快——例如，在映射到同一缓存线的两个地址之间跳转时——导致整体缓存利用率降低。\n因此，我们满足于直接映射缓存和完全关联缓存之间的某种东西：集合关联缓存。它将地址空间分成相等的组，这些组分别充当小型全关联缓存。\n关联性是这些集合的大小，或者换句话说，每个数据块可以映射到多少不同的缓存线。较高的关联性允许更有效地利用缓存，但也会增加成本。\n例如，在我的CPU上，L3缓存是16路集关联的，单个内核有4MB可用空间。这意味着总共有$\\frac{2^{22}}{2^{6}}}=2^{16}$缓存线，这些缓存线被分割成$\\frac{2^{16}{16}=2^{12}$组，每个组充当它们自己的第$（\\frac{1}{2^{12}}}）部分的完全关联缓存。\n大多数其他CPU缓存也设置为关联，包括非数据缓存，如指令缓存和TLB。例外情况是只有64个或更少条目的小型专用缓存——它们通常是完全关联的。\n如果我们在软件中实现set关联缓存，我们将计算内存块地址的一些哈希函数，然后使用其值作为缓存线索引。在硬件方面，我们不能真正做到这一点，因为它太慢了：例如，对于一级缓存，延迟要求是4或5个周期，甚至取模也需要10-15个周期，更不用说更复杂的东西了。\n相反，硬件使用惰性方法。它获取需要访问的内存地址，并将其分为三部分——从低位到高位：\n偏移量——64B缓存线内的字索引（$\\log_2 64=6$位）；\nindex-缓存线集的索引（接下来的$12$位，因为三级缓存中有$2^{12}$缓存线）；\n标记-内存地址的其余部分，用于区分存储在缓存线中的内存块。\n换句话说，所有具有相同“中间”部分的内存地址都映射到同一个集合。\n这使得缓存系统实现起来更简单、更便宜，但也容易受到某些不良访问模式的影响。\n现在，我们在哪里？哦，是的：为什么256步的迭代会导致如此严重的减速。\n当我们跳过256个整数时，指针总是增加$1024=2^{10}$，最后10位保持不变。由于缓存系统使用较低的6位作为偏移量，使用下一个12位作为缓存线索引，因此我们在三级缓存中基本上只使用$2^{12-（10-6）}=2^8$不同的集合，而不是$2^{12}$，这会将三级缓存缩小一倍$2^4=16$。阵列停止装入L3缓存（$N=2^{21}$），并溢出到数量级较慢的RAM中，这会导致性能降低。\n缓存关联性效应导致的性能问题在算法中出现的频率非常高，因为出于多种原因，程序员喜欢在索引数组时使用二的幂：\n如果最后一个维度是2的幂，则更容易计算多维数组访问的地址，因为它只需要二进制移位而不是乘法。\n计算二次幂的模更容易，因为它可以用一个按位的“and”来完成。\n在分治算法中，使用两个问题大小的幂是方便的，甚至经常是必要的。\n它是最小的整数指数，因此在对内存限制算法进行基准测试时，使用二次幂递增序列作为问题大小是一种流行的选择。\n此外，更自然的十次幂可以通过传递性被稍微低一点的二次幂整除。\n这尤其适用于使用固定内存布局的隐式数据结构。例如，在大小为$2^{20}$的数组上进行二进制搜索，每次查询大约需要约360ns，而在大小为$（2^{20}+123）$的数组上进行搜索则需要约300ns。当数组大小是2的大幂的倍数时，“最热”元素的索引（我们可能在前十几次迭代中请求的元素）也将被一些大的2幂整除，并映射到同一缓存线——相互踢出，导致性能降低约20%。\n幸运的是，这些问题更多的是反常现象，而不是严重问题。解决方案通常很简单：避免以二的幂进行迭代，使多维数组的最后一个维度的大小略有不同，或者使用任何其他方法在内存布局中插入“孔”，或者在数组索引和实际存储数据的位置之间创建一些看似随机的双射。", "note_en": "Consider a  strided incrementing loop over an array of size $N=2^{21}$ with a fixed step size of 256:\n    Which one will be faster to finish? There are several considerations that come to mind:\n At first, you think that there shouldn’t be much difference, or maybe that the second loop is $\\frac{257}{256}$ times faster or so because it does fewer iterations in total.\n Then you recall that 256 is a nice round number, which may have something to do with  SIMD or the memory system, so maybe the first one is faster.\n But the right answer is very counterintuitive: the second loop is faster — and by a factor of 10.\n This isn’t just a single bad step size. The performance degrades for all indices that are multiples of large powers of two:\n  There is no vectorization or anything, and the two loops produce the same assembly except for the step size. This effect is due only to the memory system, in particular to a feature called  cache associativity, which is a peculiar artifact of how CPU caches are implemented in hardware.\n   When we were studying the memory system  theoretically, we discussed different ways one can  implement cache eviction policies in software. One particular strategy we focused on was the  least recently used (LRU) policy, which is simple and effective but still requires some non-trivial data manipulation.\n In the context of hardware, such scheme is called  fully associative cache: we have $M$ cells, each capable of holding a cache line corresponding to any of the $N$ total memory locations, and in case of contention, the one not accessed the longest gets kicked out and replaced with the new one.\n  The problem with fully associative cache is that implementing the “find the oldest cache line among millions” operation is pretty hard to do in software and just unfeasible in hardware. You can make a fully associative cache that has 16 entries or so, but managing hundreds of cache lines already becomes either prohibitively expensive or so slow that it’s not worth it.\n We can resort to another, much simpler approach: just map each block of 64 bytes in RAM to a single cache line which it can occupy. Say, if we have 4096 blocks in memory and 64 cache lines for them, then each cache line at any time stores the contents of one of $\\frac{4096}{64} = 64$ different blocks.\n  A direct-mapped cache is easy to implement doesn’t require storing any additional meta-information associated with a cache line except its tag (the actual memory location of a cached block). The disadvantage is that the entries can be kicked out too quickly — for example, when bouncing between two addresses that map to the same cache line — leading to lower overall cache utilization.\n For that reason, we settle for something in-between direct-mapped and fully associative caches: the  set-associative cache. It splits the address space into equal groups, which separately act as small fully-associative caches.\n  Associativity is the size of these sets, or, in other words, how many different cache lines each data block can be mapped to. Higher associativity allows for more efficient utilization of cache but also increases the cost.\n For example, on  my CPU, the L3 cache is 16-way set-associative, and there are 4MB available to a single core. This means that there are in total $\\frac{2^{22}}{2^{6}} = 2^{16}$ cache lines, which are split into $\\frac{2^{16}}{16} = 2^{12}$ groups, each acting as a fully associative cache of their own $(\\frac{1}{2^{12}})$-th fraction of the RAM.\n Most other CPU caches are also set-associative, including the non-data ones such as the instruction cache and the TLB. The exceptions are small specialized caches that only house 64 or fewer entries — these are usually fully associative.\n    If we implemented set-associative cache in software, we would compute some hash function of the memory block address and then use its value as the cache line index. In hardware, we can’t really do that because it is too slow: for example, for the L1 cache, the latency requirement is 4 or 5 cycles, and even  taking a modulo takes around 10-15 cycles, let alone something more sophisticated.\n Instead, the hardware uses the lazy approach. It takes the memory address that needs to be accessed and splits it into three parts — from lower bits to higher:\n offset — the index of the word within a 64B cache line ($\\log_2 64 = 6$ bits);\n index — the index of the cache line set (the next $12$ bits as there are $2^{12}$ cache lines in the L3 cache);\n tag — the rest of the memory address, which is used to tell the memory blocks stored in the cache lines apart.\n In other words, all memory addresses with the same “middle” part map to the same set.\n  This makes the cache system simpler and cheaper to implement but also susceptible to certain bad access patterns.\n   Now, where were we? Oh, yes: the reason why iteration with strides of 256 causes such a terrible slowdown.\n When we jump over 256 integers, the pointer always increments by $1024 = 2^{10}$, and the last 10 bits remain the same. Since the cache system uses the lower 6 bits for the offset and the next 12 for the cache line index, we are essentially using just $2^{12 - (10 - 6)} = 2^8$ different sets in the L3 cache instead of $2^{12}$, which has the effect of shrinking our L3 cache by a factor of $2^4 = 16$. The array stops fitting into the L3 cache ($N=2^{21}$) and spills into the order-of-magnitude slower RAM, which causes the performance to decrease.\n Performance issues caused by cache associativity effects arise with remarkable frequency in algorithms because, for multiple reasons, programmers just love using powers of two when indexing arrays:\n It is easier to calculate the address for multi-dimensional array accesses if the last dimension is a power of two, as it only requires a binary shift instead of a multiplication.\n It is easier to calculate modulo a power of two, as it can be done with a single bitwise “and”.\n It is convenient and often even necessary to use power-of-two problem sizes in divide-and-conquer algorithms.\n It is the smallest integer exponent, so using the sequence of increasing powers of two as problem sizes are a popular choice when benchmarking memory-bound algorithms.\n Also, more natural powers of ten are by transitivity divisible by a slightly lower power of two.\n This especially often applies to implicit data structures that use a fixed memory layout. For example, binary searching over arrays of size $2^{20}$ takes about ~360ns per query while searching over arrays of size $(2^{20} + 123)$ takes ~300ns. When the array size is a multiple of a large power of two, then the indices of the “hottest” elements, the ones we likely request on the first dozen or so iterations, will also be divisible by some large powers of two and map to the same cache line — kicking each other out and causing a ~20% performance decrease.\n Luckily, such issues are more of an anomaly rather than serious problems. The solution is usually simple: avoid iterating in powers of two, make the last dimensions of multi-dimensional arrays a slightly different size or use any other method to insert “holes” in the memory layout, or create some seemingly random bijection between the array indices and the locations where the data is actually stored.", "posttime": "2022-02-15 15:35:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缓存,cache", "title": "缓存关联性", "title_en": "Cache Associativity", "transed": 1, "url": "https://en.algorithmica.org/hpc/cpu-cache/associativity/", "via": "", "real_tags": ["缓存", "cache"]}]