[{"category": "", "categoryclass": "", "imagename": "5eae7cd27e142ebddc80ad3ef0deed7b.jpg", "infoid": 1009561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国早期现代主义者约翰·马林最令人难忘的是他对新墨西哥州陶斯峡谷的动感沙漠和布鲁克林大桥红日的锐利维度的绘画。但对史密森美国艺术博物馆(Smithsonian American Art Museum，SAAM)的相框保护员马丁·科特勒(Martin Kotler)来说，包裹马林作品的相框和里面的画布一样重要。\n在他的职业生涯中，马林在每一幅画和它的框架之间寻求一种“幸福的平衡”。他与纽约市相框制造商乔治·奥夫(George Of)合作创造了定制的坐骑，他在坐骑上涂上水彩，以增强里面绘画的调色板。在他职业生涯的后期，马林手工制作了他的镜框，并稳步地将他的艺术推到了边缘：纽约天际线布鲁克林大桥帆船的黑色边框上有银色条纹，就像交通繁忙的道路上的线条。\n但过去的私人买家和博物馆管理员很少像科特勒那样珍视相框。一些帧被编目并存储，一些帧被遗忘和重新发现，而另一些帧则被彻底丢弃。直到最近，大多数人-包括专家-认为相框是可互换和可消耗性的，如果他们曾经想到过的话。\n科特勒在谈到镜框时说：“当你在学校的时候，它从来不会被讨论。”许多框架制造商的名字丢失或被遗忘。在测试幻灯片和教科书上，艺术作品几乎都是不加边框的。学术上的盲点被传递给了参观者。科特勒说：“当人们走进博物馆时，有太多的事情要讨论。”在构图、色彩和艺术家传记之后，几乎没有时间讨论造型。\n这在一定程度上是由于设计：框架基本上是功利性的物品。它们的存在是为了保护艺术品免受粗暴的搬运、人的接近以及灰尘和光线等环境因素的影响。他们还为观众走神的眼睛提供了护栏。“是母亲抱着自己的孩子，”科特勒说。但许多相框本身就是艺术品，理应被视为艺术品。\n有些物品，比如马林或当代艺术家马修·巴尼(Matthew Barney)的那些物品，是“艺术家镜框”--由艺术家制作，因此与艺术品密不可分。马林或当代艺术家马修·巴尼(Matthew Barney)是塑料行业的先驱。其他的则是由框架大师完成的委托，比如大胆的布奥艺术建筑师斯坦福·怀特(Stanford White)(他把自己的奇幻设计交给工匠们制作)，波士顿奢侈品商店Carrig-Rohane(科特勒称其为“框架中的劳斯莱斯”)，或者雕刻大师格雷戈里·基什内尔(Gregory Kirchner)(他只制作了12个已知的框架)。还有一些是由像科特勒这样的保护者制作的，他为SAAM的珍宝制作了微妙、安全和历史上准确的箱子。\n“相框遭受了流放和破坏，”林恩·罗伯茨(Lynn Roberts)说，他是一位自由职业的艺术历史学家，也是相框博客的创始人。但我们可以重新学会看东西。罗伯茨说，当人们“意识到那里有另一段历史时，他们开始问越来越多的问题。”“他们被镜框是如何制作的，做了什么，以及它们纯粹的多样性和美感迷住了。”\n框架一直是一种保护形式。但罗伯茨说，这种狭隘的观点“很快就被意识到在这幅画和墙壁之间有了另一块空地，这块空地本身可以用来装饰”。虽然四块木头足以保证安全，但框架制造商喜欢巴洛克框架的镀金和多色曲线，不对称的洛可可峰和装饰艺术外壳的阶梯形几何形状。\n科特勒说，当欧洲商店在重复他们的设计时，大多数美国人对大规模生产的“便利框架”感到满意。在1860年之前，他们进口这些华丽的石板，然后把它们贴在全国各地的绘画上。它看起来好不好看并不重要，只要合身就行了。虽然国内商店最终出现在波士顿、费城和纽约，但他们的作品并不一定是原创的。制造商往往是多产的小偷。如果像怀特这样的人展示了一个革命性的新镜框，全国各地的商店很快就会开发出仿制品-这是一个完全合法的主张，即使在今天，也很少有专利保护镜框和镜框。\n但随着20世纪的临近，镀金时代的艺术家们开始对整个过程进行更批判性的思考。例如，阿什坎学校的成员想要反映他们作品的原始、冷漠精神的框架，而不是旧世界大教堂的框架。到了20世纪40年代抽象表现主义的出现，许多艺术家决定他们根本不想要镜框。\n圣达菲乔治亚基夫博物馆的保护负责人戴尔·克朗赖特(Dale Kronkright)说：“现代画家认为，如果你戴上历史框架风格，就会失去这幅画的美感。”O‘Keeffe和她的同龄人希望观众在没有分心的情况下考虑形状、颜色、线条和构图的工作方式。为了确保她的愿景得以实现，O‘Keeffe与纽约市镜框制造商Of合作，开发了八个截然不同的镜框，恰好适合她的画作。\n虽然O‘Keeffe作品的管理人员仔细保存了她的画框，但其他艺术家就没有这么幸运了。“好品味”--至少它是在当下构思的--常常凌驾于历史真相之上。史蒂夫·威尔科克斯(Steve Wilcox)是美国国家美术馆(National Gallery Of Art)的前相框保护员，他说，博物馆过去会移除原始相框，转而采用一种房屋风格。“没有人把它当做一个道德过程来认真对待，”威尔科克斯说，他在整个学区被称为“框架中的米克·贾格尔”(Mick Jagger Of Frame)。\n私人收藏家往往更加恶劣。罗伯茨回忆说，一幅德加画作最近出现在艺术品市场上，原始画框完好无损，但拍卖行用镀金木质画框取代了它。罗伯茨说：“它看起来华而不实，像巧克力盒，德加肯定会被吓坏的。”但“对于商业世界来说，一个镀金雕花框架会让一些东西显得更重要，价值一百万美元。”\n今天，大多数博物馆都在寻求以真实的框架展示他们的藏品，这些框架真实地反映了作品创作的时代和艺术家的愿景。但长达几个世纪的框架贬值可能会使这个卑微的目标成为一项西西弗式的任务。\n威尔科克斯说：“你可以通过翻阅卷册来找到那一句话。”\n第一个目标是确定现有框架与内部工作的关系。赫什霍恩博物馆和雕塑花园(Hirshhorn Museum And Sculpture Garden)的框架专家贾尼斯·柯林斯(Janice Collins)说，这项工作需要对历史框架风格和材料有广泛而深刻的了解，而且通常还需要拥有该领域专业知识的策展人额外的一双眼睛。策展人想要更新约瑟夫·阿尔伯斯(Josef Albers)的作品的相框。阿尔伯斯是一位现代艺术家，最出名的是他的一系列对广场的敬意。但柯林斯采访了一位阿尔伯斯方面的专家，这位专家解释说，这位艺术家精心挑选了自己的画框。所以原来的固定装置留了下来。\n如果这个框架是原创的，许多文物保护人员会试图调查它的起源故事。自20世纪90年代以来，科特勒一直利用业余时间追捕一个名叫莫里斯·芬肯(Maurice Fincken)的人，他为约翰·斯隆(John Sloan)的一幅画制作了一个镜框。科特勒说：“背面有一个漂亮的纸质标签，但你去搜索一下，就会发现什么都没有。”“现在我的好奇心高涨了。”随着更多的挖掘，他发现Fincken在费城以外的地方工作，但在第一次世界大战前后基本上从记录中消失了。最近，科特勒确认了一名后代，他可能能够解释更多的故事。\n一旦确定了它的来源，保护人员就会努力保护这个镜框，它可能已经经历了磨损、撕裂和不太巧妙的修饰。科特勒回忆起他在亚历山大·霍格的“尘埃碗”和艺术家画框上的作品。“一百万年前，博物馆说，‘把那个镜框取下来，设计出另一个更有同情心的镜框，’因为它真的是一个丑陋的镜框，”他说。科特勒按要求做了，但他保留了原来的相框，并“慢慢地，慢慢地清理掉了其他人做的东西”。当德克萨斯州的一家博物馆为霍格的职业生涯做回顾展时，科特勒能够用它的原始画框把它运给他们。这幅画并不漂亮，但对这位艺术家来说是真实的。\n如果一件艺术品是在一个不真实的相框里，找到一个合适的、空的替代方案，或者从头开始建造一个，这是相框保管员的工作。例如，在史密斯学院艺术博物馆(Smith College Museum Of Art)，阿什坎艺术家乔治·贝洛斯(George Bellows)的画作“宾夕法尼亚发掘”长期以来一直陈列在路易十四风格的镜框里，全部是编织和金色的。但该学院框架保护项目的学生们建造了另一种选择-仍然镀金，但带有微妙的芦苇造型，更适合贝洛斯的作品。\n尽管几个世纪以来一直被忽视，但这一框架最终可能会发挥作用。“就艺术史而言，这是一个相当新的领域，但在过去的15年里取得了突飞猛进的发展，”威尔科克斯说。\n威尔科克斯在20世纪70年代刚开始的时候只记得一本关于装框的书，今天已经有几十本了，像框架博客这样的网站让保护人员的洞察力可以向大众开放。历史悠久的工艺和新技术的结合导致了环境控制框架的发展，这些框架仍然尊重艺术家的意图。一些博物馆，主要在欧洲，已经策划了致力于装框艺术的展览，包括伦敦的国家肖像美术馆和卢浮宫。\n虽然他最近退休去了北卡罗来纳州的山区，但威尔科克斯说，他希望领导世界各地的相框“极客”们的研讨会，并继续培养我们对相框的新生敬意。但就目前而言，他说，“我只是在享受我的风景。”\n窗外的景色？“我没想到会这样，”他笑着说。", "note_en": "John Marin, the early American modernist, is best remembered for his paintings of the kinetic desert of   Taos Canyon, New Mexico and the razor-sharp dimensions of   Red Sun, Brooklyn Bridge. But to  Martin Kotler, a frames conservator at the  Smithsonian American Art Museum (SAAM), the frames encasing  Marin ’s work are just as important as the canvases inside.\n    Over the course of his career, Marin  sought a “Blessed Equilibrium” between every painting and its frame. He worked with New York City frame maker  George Of to create custom mounts, which he coated in watercolors to enhance the palette of the painting inside. Later in his career, Marin made his frames by hand, and steadily pushed his art over the edge: The black frame of   Sailboat, Brooklyn Bridge, New York Skyline is streaked with silver, like the lines on a well-trafficked road.\n  But past private buyers and museum conservators have rarely treasured frames like Kotler does. Some frames were cataloged and stored, some were forgotten and rediscovered, and others were discarded outright. Until recently, most people—experts included—saw picture frames as interchangeable and expendable, if they ever thought of them at all.\n  “When you are in school, it’s never discussed,” Kotler says of frames. The names of many frame makers are lost or forgotten. On test slides and in textbooks, works of art are almost exclusively depicted unframed. The academic blind spot is passed on to visitors. “When you have people walking into a museum, there are so many things to discuss,” Kotler says. After composition, colors, and the artist’s biography, there’s hardly time to discuss the molding.\n  That’s partly by design: frames are fundamentally utilitarian objects. They exist to protect art from rough handling, the proximity of people and environmental factors like dust and light. They also offer a guardrail for the viewer’s wandering eye. “It [is] the mother holding its child,” Kotler says. But many frames are works of art in their own right—and deserve to be seen as such.\n  Some objects, like those of Marin or contemporary artist  Matthew Barney, a pioneer in plastics, are “artist frames”—made by the artist and therefore inseparable from the artwork. Others are commissions fulfilled by master frame makers, like bold Beaux Arts  architect Stanford White (he sent his fantastical designs to artisans for execution), the luxury Boston shop  Carrig-Rohane (which Kotler calls the “Rolls Royce of framing”), or the carving virtuoso  Gregory Kirchner (who made just 12 known frames). And still others are made by conservators like Kotler, who builds subtle, secure and historically accurate cases for SAAM’s treasures.\n    “Frames have suffered exile and destruction,” says Lynn Roberts, a freelance art historian and founder of  The Frame Blog. But we can learn to see again. When people “realize that there’s another history there, they start asking more and more questions,” Roberts says. “They’re fascinated by how frames are made, and what they do, and their sheer variety and beauty.”\n  Frames have always been a form of protection. But that narrow view was “very rapidly subsumed by the realization that now there was another empty field between the painting and the wall, which could itself be used and decorated,” says Roberts. While four pieces of wood would suffice for security, frame makers delighted in the gilded and polychrome curves of Baroque frames, the asymmetrical Rococo peak and the stepped geometry of Art Deco casing.\n  While European shops were iterating on their designs, most Americans were content with mass-produced “frames of convenience,” Kotler says. Before 1860, they imported these ornate slabs and slapped them on paintings across the country. It didn&#39;t matter if it looked good, it just had to fit. While domestic shops eventually emerged in Boston, Philadelphia and New York, their works weren’t necessarily original. Manufacturers were often prolific thieves. If someone like White revealed a revolutionary new frame, shops across the country quickly developed imitations—a perfectly legal proposition, even today few patents protect frames and framing.\n  But as the 20th century approached, Gilded Age artists began to think more critically about the entire process. Members of the Ashcan School, for example, wanted frames that reflected the raw, unsentimental spirit of their work, not that of an Old-World cathedral. By the advent of Abstract Expressionism in the 1940s, many artists decided they didn’t want frames at all.\n  “Modern painters felt that if you put on a historic frame style, it would take away from the aesthetics of the painting,” says  Dale Kronkright, head of conservation at the Georgia O&#39;Keeffe Museum in Santa Fe. O’Keeffe and her contemporaries wanted viewers to consider the way the shapes, colors, line and composition worked, without distractions. To ensure her vision was realized, O’Keeffe worked with Of, the New York City frame maker, to develop  eight distinct frames that precisely suited her paintings.\n  While stewards of O’Keeffe&#39;s work have carefully preserved her frames, other artists haven’t been so lucky. “Good taste”—at least as it&#39;s conceived in the moment—has often overruled historical truths. Steve Wilcox, a former frames conservator at the National Gallery of Art, says museums used to remove original frames in favor of a house style. “Nobody was taking it seriously as an ethical process,” says Wilcox, who is known around the district as the “Mick Jagger of frames.”\n  Private collectors were often even more egregious. Roberts recalls that a Degas recently appeared on the art market with its original frame intact, but the auction house replaced it with a giltwood frame. “It looked meretricious and chocolate-boxy, and Degas would have been horrified,” Roberts said. But “for the commercial world a carved giltwood frame makes something appear a million dollars more important.”\n  Today, most museums seek to display their collections in frames that are true to the period in which the work was created and the vision of the artist. But the centuries-long devaluation of frames can make this humble goal a Sisyphean task.\n      “You could be looking through volumes and volumes to find that one sentence,” Wilcox says.\n  The first aim is to determine an existing frame&#39;s relationship to the work inside. The job requires a wide and deep knowledge of historic frame styles and materials and, often, an extra set of eyes from curators with domain expertise, says Janice Collins, a framing specialist at the  Hirshhorn Museum and Sculpture Garden. Curators wanted to update the frames on the work of  Josef Albers, a modern artist best known for his series   Homage to the Square. But Collins spoke with an expert on Albers, who explained that the artist carefully selected his own frames. So the original fixtures stayed.\n  If the frame is original, many conservators will try to investigate its origin story. Since the 1990s, Kotler has spent his spare time hunting down a man named Maurice Fincken, who made a frame for a painting by John Sloan. “There’s this beautiful paper label on the back, but you go and do a search, and there’s zero,” Kotler says. “Now my curiosity’s up.” With some more digging, he found that Fincken was working outside of Philadelphia, but largely disappeared from the records around the First World War. More recently, Kotler identified a descendant who may be able to explain more of the story.\n    Once its provenance is established, conservators work on preserving the frame, which has likely experienced wear, tear and less-than-artful touch-ups. Kotler recalls his work on Alexandre Hogue’s   Dust Bowl and artist frame. “A million years ago, the museum said, ‘take that frame off and design and make another frame that was more sympathetic,’ because it’s really an ugly frame,” he says. Kotler did as he was asked, but he kept the original frame, and “slowly, slowly cleaned off the stuff that other people did.” When a museum in Texas did a retrospective of Hogue’s career, Kotler was able to ship it to them with its original frame. It wasn&#39;t beautiful, but it was true to the artist.\n      If an artwork is in an inauthentic frame, it’s a frames conservator’s job to find a suitable, empty alternative, or build one from scratch. At Smith College Museum of Art, for example, the Ashcan artist George Bellows’ painting   Pennsylvania Excavation had long been displayed in a Louis XIV-style frame, all braided and gold. But students in the college’s frame conservation program  built an alternative—still gilded, but with a subtle reeded molding more suited to Bellows’ work.\n  Despite centuries of neglect, the frame may finally be coming into its own. “It’s a fairly new field, in terms of art history, but it’s made leaps and bounds in the last 15 years,” Wilcox says.\n  Where Wilcox remembers just one book on framing when he started out in the 1970s, today there are dozens, and sites like The Frame Blog make conservators’ insight available to the masses. The marriage of time-honored craftsmanship and new technology has led to the development of  environment-controlled frames that still honor the intent of the artist. And some museums, mainly in Europe, have curated exhibitions dedicated to the art of framing, including  the National Portrait Gallery in London and  the Louvre.\n  While he recently retired to the mountains of North Carolina, Wilcox says he hopes to lead workshops for frame “geeks” around the world, and continue to nurture our nascent respect for framing. But for now, he says, “I’m just enjoying my view.”\n  A view framed by the window? “I hadn’t thought of it that way,” he says with a laugh.", "posttime": "2020-07-03 04:09:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,应该,recognized,框架", "title": "相框应该被认定为一种艺术形式吗？", "title_en": "Should the Frame Be Recognized as an Art Form?", "transed": 1, "url": "https://www.smithsonianmag.com/smithsonian-institution/it-time-recognize-frames-independent-artform-180975184/", "via": "", "real_tags": ["艺术", "应该", "框架"]}, {"category": "", "categoryclass": "", "imagename": "0f82bac88ceed8ca0dd8aae1daa5733a.jpg", "infoid": 1009560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由ETH剥离出来的incon.ai开创的这项技术使积木能够精确定位，创造出具有美学设计和增强声学效果的结构。\n皮影戏、波浪形图案或音响效果：砖块可以以特殊的角度放置，以创造美学的建筑设计。为了创造所需的效果，同时确保稳定的结构，每块砖的定位精度需要达到毫米级。用传统的建筑平面图和砌筑技术来达到这样的精确度需要付出巨大的努力。\n一项基于增强现实(AR)的新技术使即使是最非正统的想法也有可能实现。蒂莫西·桑迪(Timothy Sandy)是机器人专家，也是ETH先锋研究员，他是开发这一概念的科学家。\n首先，建筑师在电脑上起草设计方案，并将3-D平面图加载到软件中。在现场工作时，泥瓦匠们将摄像机对准砖墙。该软件识别这些对象，并将各个部件的位置与虚拟设计中的位置进行比较。\n监视器精确地向泥瓦匠显示他们需要如何放置单独的砖块。桑迪说，这项创新的技术使人类能够以几乎与机器人系统一样的精度建造建筑。这允许创建全新的形状和结构。桑迪的软件已经在两个项目中使用。\n在希腊奥林匹斯山脚下，来自Gramazio Kohler的建筑师建造了一个总立面为225平方米的酒窖。当地一家公司在不到三个月的时间里完成了建设。桑迪解释说，我们只在现场待了一周，做好了一切准备。\n酒窖的半透明外立面创造了一种随着一天的进程而变化的灯光图案。各个砖块之间的间隙也确保了建筑物内部的最佳采光和通风。\n第二个项目涉及苏黎世附近埃斯林根Basler&amp；Hofmann餐厅的墙壁，这是一座木结构建筑，也是由格拉马齐奥·科勒建筑师事务所(Gramazio Kohler Architects)设计的。单个木块的面首先被切割成多边形。这些块的不对称形状在墙上创建了定制的阴影图案。\n此外，积木之间的不同间隙改善了吸声效果，并起到了墙后通风系统的风道作用。以这种方式建造了三面总面积为90m²的声墙。\n33岁的软件开发人员蒂莫西·桑迪(Timothy Sandy)有机器人方面的背景。在美国学习机械工程后，他来到苏黎世理工大学完成机器人学硕士学位，然后攻读机器人辅助建筑博士学位。他现在正在向泥瓦匠和木匠提供这方面的专业知识。老实说，与机器人相比，我更喜欢和人一起工作，他开玩笑说。\n然而，最重要的是，在机动性和灵活性方面，机器人仍然无法与人类相提并论。机器人辅助施工目前只能用非常具体、扁平的砖块。该软件可以将计算机设计和人工工艺的优点结合起来。\n在这两个试点项目中，软件都被加载到连接到相机和监视器的计算机上。一部简单的智能手机可以作为终端设备使用。\n桑迪说，这项新技术比其他增强现实解决方案要准确得多。例如，它可以检测和跟踪对象，而不考虑遮挡视图或背景杂乱。即使是强烈的相机抖动或系统重启也不是问题。\n桑迪最近与联合创始人法德里·弗雷尔(Fadri Furrer)和阿贝尔·加维尔(Abel Gawel)一起成立了分拆公司incon.ai&34；。作为ETH先锋奖学金的一部分，桑迪目前正在评估这项技术如何在市场上定位，以及谁将从中受益。\n年轻的创始人还希望继续完善技术。桑迪说，他们想让软件更精确、更稳定，最重要的是用户友好。该团队还在努力加快整个过程，以便计算机辅助施工最终将与传统方法一样快。\n播放此视频表示您同意YouTube使用Cookie，这可能包括分析、个性化和广告。了解更多信息确定", "note_en": "The technology pioneered by the ETH spin-off incon.ai allows blocks to be positioned with pinpoint accuracy, creating structures with aesthetic designs and augmented acoustics.\n  Shadow plays, wavelike patterns or acoustic effects: bricks can be placed at special angles to create aesthetic architectural designs. To create the required effects and at the same time ensure a stable structure, the individual bricks need to be positioned with millimetre accuracy. It would take an enormous effort to achieve such precision with conventional building plans and masonry techniques.\n A new technology based on augmented reality (AR) makes it possible to realise even the most unorthodox ideas. Timothy Sandy, a specialist in robotics and an ETH Pioneer Fellow, is the scientist who developed the concept.\n  First the architects draft the design on the computer and load the 3-D plans into the software. While working on site, the masons direct a camera at the brickwork. The software recognises the objects and compares the position of the individual components with those in the virtual design.\n A monitor shows the masons exactly how they need to place the individual bricks. &#34;This innovative technology allows humans to build with almost the same accuracy as robotic systems,&#34; says Sandy. &#34;This allows entirely new shapes and structures to be created.&#34; Sandy&#39;s software has already been used in two projects.\n      At the foot of Mount Olympus in Greece, ETH architects from Gramazio Kohler have built a wine cellar with a total facade of 225 m². A local company completed the construction in less than three months. &#34;We were only on site for a week to prepare everything,&#34; Sandy explains.\n The wine cellar&#39;s semi-transparent facade creates a light pattern that changes over the course of the day. The gaps between the individual bricks also ensure optimum lighting and ventilation for the building&#39;s interior.\n  The second project involves the walls of the cafeteria of Basler &amp; Hofmann in Esslingen near Zurich, a timber construction also designed by Gramazio Kohler Architects. The faces of the individual timber blocks are first cut into polygons. The asymmetric shape of the blocks creates customised shadow patterns on the wall.\n      In addition, the varying gaps between the blocks improve the acoustic absorption and function as air ducts for the ventilation system behind the walls. Three acoustic walls with a total area of 90 m² were constructed in this fashion.\n  The software developer Timothy Sandy, 33, has a background in robotics. After studying mechanical engineering in the US, he came to ETH Zurich to complete his masters in robotics before moving on to a doctorate in robotics-assisted construction. He is now making this expertise available to masons and carpenters. &#34;To be honest, I prefer working with people than with robots,&#34; he jokes.\n      Above all, however, robots still cannot match humans when it comes to mobility and dexterity. Robotics-assisted construction is currently only possible with very specific, flat bricks. &#34;The software makes it possible to combine the advantages of computer design and human craftsmanship&#34;.\n In both pilot projects, the software was loaded onto a computer connected to a camera and a monitor. A simple smartphone functions as a terminal device.\n &#34;The new technology is much more accurate than other AR solutions,&#34; Sandy says. For example, it detects and tracks objects despite occluded views or background clutter. Even strong camera shake or a system restart are not a problem.\n Sandy recently set up the spin-off &#34;incon.ai&#34; together with co-founders Fadri Furrer and Abel Gawel. As part of his ETH Pioneer Fellowship, Sandy is currently assessing how the technology could be positioned in the market and who would benefit from it.\n The young founders also want to continue to refine the technology. Sandy says they want to make the software more precise, stable and above all user-friendly. The team is also working to accelerate the entire process, so that computer-assisted construction will eventually be just as quick as conventional methods.\n   By playing this video, you agree to the use of cookies by YouTube \r This may include analytics, personalization, and ads.   Learn more   OK", "posttime": "2020-07-03 04:08:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "crooked,技术", "title": "歪曲到毫米", "title_en": "Crooked to the Millimetre", "transed": 1, "url": "https://ethz.ch/en/news-and-events/eth-news/news/2020/07/crooked-to-the-millimetre.html", "via": "", "real_tags": ["crooked", "技术"]}, {"category": "", "categoryclass": "", "imagename": "f213420346dae6cc206edf9182eedc7f.jpg", "infoid": 1009559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，我们报道了美国国家海洋和大气管理局(NOAA)对与处理唐纳德·特朗普(Donald Trump)总统自己造成的飓风争议有关的违反科学诚信行为的调查结果。\n当特朗普错误地在推特上说阿拉巴马州可能会受到飓风多里安的影响时，问题就开始了。在看到大量问题涌入后，伯明翰国家气象局(Birmingham National Weather Service)办公室在推特上做出了澄清。白宫没有简单地纠正这个错误，而是坚称总统是正确的，这一坚持最终导致了椭圆形办公室提交的经标记修正的预报地图。\nNOAA的问题是，其领导层发布了一份未签署的声明，站在特朗普总统一边，批评伯明翰办公室的讲话“绝对值与当时最好的预测产品的概率不符”。\nNOAA的科学诚信官员委托对该声明进行调查，得出结论，代理行政长官尼尔·雅各布斯(Neil Jacobs)和通信总监朱莉·凯·罗伯茨(Julie Kay Roberts)发布该声明违反了该机构的规定。但调查也得出结论，这份声明实际上是由商务部领导层指挥的-他们中没有一个人愿意回答NOAA调查人员的问题。\n进入商务部监察长的行列，他开始了一项平行的调查。周一，该机构监察长佩吉·古斯塔夫森(Peggy Gustafson)发布了一份备忘录，总结了她的结论。奇怪的是，这份日期为6月26日的备忘录说，完整的报告定于周一同一时间发布。然而，完整的报告并没有在那里，而且备忘录本身包含了几处“等待特权审查”的密文。\n周三晚间，古斯塔夫森发布了第二份备忘录，主题是“该部门正在积极阻止OIG完成一项评估。”在这份报告中，古斯塔夫森有效地声称，商务部长威尔伯·罗斯(Wilbur Ross)的办公室正在阻碍报告的发布。\n该部门要求NOAA发布一份声明，该声明不会进一步增加NOAA或国家气象局的利益。\n三、该部未能解释美国国家气象局(National Weather Service)伯明翰推文的公共安全意图，以及物理科学和社会科学信息之间的区别。\n一名NOAA员工删除了相关短信，该部门的联邦记录指南已经过时。\n根据NOAA委托的报告，删除短信的是通讯总监朱莉·凯·罗伯茨(Julie Kay Roberts)，她曾出现在NOAA的报告中。\n商务监察长佩吉·古斯塔夫森(Peggy Gustafson)的第二份备忘录说，商务领导层同意在48小时内审查她的报告，确定它认为需要编辑的任何具体声明。但古斯塔夫森表示，国务卿办公室现在对该报告引用证据附录中的信息感到不安，这些信息之前曾要求进行编辑。古斯塔夫森写道：“这一立场是没有价值的，因为它表明司法部在OIG如何起草其报告以及所依赖的证据方面有一定的作用。相反，该部没有参与决定OIG如何或何时进行其监督工作或报告的结构。期望出现不同的情况是违反IG法案的，也是对OIG独立性的不可接受的侵犯。“。\n古斯塔夫森说，领导层现在拒绝确认他们想要编辑的具体声明，这使得最终报告处于不确定状态。她继续说，“值得注意的是，沟通始终是合议制的，直到OIG将最终报告发送给您进行特权审查，并随后向您发布最终报告。这种语气转变似乎与我们报告的内容以及涉案高层个人的责任发现直接相关。“。\n换言之，古斯塔夫森认为，在发现报告得出结论认为商务部高级官员对这些问题负有责任后，官员们停止了合作。“备忘录要求部长办公室在7月9日之前提供具体的编辑要求，以便报告可以发布。”", "note_en": "Last month, we  covered the results of a NOAA investigation into scientific integrity violations associated with its handling of President Donald Trump’s self-inflicted hurricane controversy.\n The problems started when Trump incorrectly tweeted that Alabama was likely going to be impacted by Hurricane Dorian. After seeing an influx of questions, the Birmingham National Weather Service office tweeted a clarification. Rather than simply correcting the mistake, the White House insisted that the President was right, an insistence that eventually led to his  marker-amended forecast map, presented from the Oval Office.\n  NOAA’s issue was that its leadership released an unsigned statement that sided with President Trump, criticizing the Birmingham office for speaking “in absolute terms that were inconsistent with probabilities from the best forecast products available at the time.”\n  NOAA’s scientific integrity officer commissioned an investigation into that statement, concluding that Acting Administrator Neil Jacobs and Director of Communications Julie Kay Roberts had violated agency rules in releasing that statement. But the investigation also concluded that the statement had actually been directed by Commerce Department leadership—none of whom were willing to answer questions from the NOAA investigators.\n Enter the Commerce Department Inspector General, who started a parallel investigation. On Monday, agency Inspector General Peggy Gustafson  posted a memo summarizing her conclusions. Curiously, the memo—dated June 26—said that the full report was set to be posted at the same time on Monday. Yet the full report wasn’t there, and the memo itself contained several redactions “pending privilege review.”\n On Wednesday night, Gustafson posted a  second memo with the subject, “The Department Is Actively Preventing OIG from Completing an Evaluation.” In it, Gustafson effectively alleges that the office of Commerce Secretary Wilbur Ross is stonewalling the report’s release.\n  II. The Department required NOAA to issue a Statement that did not further NOAA’s or the National Weather Service&#39;s interests.\n III. The Department failed to account for the public safety intent of the National Weather Service Birmingham tweet and the distinction between physical science and social science messaging.\n IV. One NOAA employee deleted relevant text messages, and the Department’s federal records guidance is outdated.\n According to the report NOAA commissioned, it was Julie Kay Roberts—the Director of Communications who featured in NOAA&#39;s report—who had deleted text messages.\n The second memo from Commerce Inspector General Peggy Gustafson says that Commerce leadership agreed to review her report within 48 hours, identifying any specific statements it felt needed to be redacted. But Gustafson says that the Secretary’s office is now upset that the report references information in evidentiary appendices that it had previously asked to be redacted. Gustafson writes, “This position is without merit as it suggests that the Department has a role in how OIG drafts its reports and what evidence is relied upon. On the contrary, the Department has no part in determining how or when OIG conducts its oversight work or structures its reports. To expect otherwise is contrary to the IG Act and an unacceptable intrusion on OIG’s independence.”\n Gustafson says that leadership is now refusing to identify specific statements that it wants redacted, leaving the final report in limbo. She continues, “Notably, communications were consistently collegial, until OIG transmitted the final report for a privilege review and subsequent issuance of the final report to you. This tone shift appears to be directly linked to the content of our report and the findings of responsibility of the high-level individuals involved.”\n In other words, Gustafson thinks that, upon finding that the report concluded that senior officials in Commerce were responsible for the problems, said officials stopped cooperating. The memo requests that the Secretary’s office provide its specific redaction requests by July 9 so the report can be released.", "posttime": "2020-07-03 03:50:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sharpiegate,inspector,报告", "title": "商务监察长称“Sharpiegate”报告被封杀", "title_en": "Commerce Inspector General says “Sharpiegate” report being blocked", "transed": 1, "url": "https://arstechnica.com/science/2020/07/commerce-department-sharpiegate-report-blocked-by-leadership/", "via": "", "real_tags": ["inspector", "报告"]}, {"category": "", "categoryclass": "", "imagename": "adb45d2d85b681d124222cbe12418266.jpg", "infoid": 1009557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你问一名美国海军潜水员水下和航海体验中最感人的部分，你几乎每次都会得到同样的答案--那就是气味。正如我们水手所说，它是柴油、机油、洗衣篮和胀气的独特组合。据我所知，从来没有人试图将Eau de Boat装瓶出售--但Kickstarter的一项活动正试图为太空旅行做同样的事情。\n6月下旬，美国国家空间委员会执行秘书斯科特·佩斯表示，他希望支持维珍银河和蓝色起源等公司发展最低限度的商业太空旅游--把几个人带到大气层上空的短暂亚轨道往返旅行，然后让他们回到出发的地方。维珍银河甚至计划最终将一些NASA宇航员送到国际空间站。\n但这些可能是很少人会经历的小而昂贵的事情，至少在几十年内是这样。同时，太空爱好者可以更方便、更实惠地在虚拟现实中某种程度上体验国际空间站。即使有六个自由度，体验也是极其有限的。\nOculus和它的竞争对手不太可能想出一种模拟微重力的方法-但如果你想在虚拟参观国际空间站的同时闻到它的味道，这可能是一个选择。\n信不信由你，这并不是第一次试图掩盖太空旅行的味道。NASA试图模拟在地面训练期间尽可能忠实地驾驶航天器和执行任务的体验，让宇航员在真正的训练中保持准备和自信-如果你相信Eau de Space Kickstarter活动，那就包括气味。\n几十年前，美国国家航空航天局(NASA)聘请专家开发太空气味，以帮助宇航员在发射进入轨道之前进行培训。美国宇航局在训练期间模拟太空的目标是消除宇航员在外层空间可能经历的任何意外。熟能生巧，这就是火箭科学。太空的味道已经被锁在后面，需要知道的是，宇航员只接受野外训练，而且多年来都是繁文缛节。通过剪切的决心、毅力、大量的运气和几个信息自由法(FOIA)的要求，我们把它弄出来了。\n我们不太确定这一说法与现实的吻合程度。Kickstarter活动本身明显缺乏支持其主张的链接。在接受CNN采访时，Eau de Space创始人兼化学家史蒂夫·皮尔斯(Steve Pearce)表示，美国国家航空航天局(NASA)在2008年与他签约开发这种模拟气味--这本身就是一个很酷的故事，但它无法与Kickstarter的一个数十年前的项目相提并论，该项目必须通过“信息自由法”才能挖掘出来。\n2002年，在寻找愿意描述太空旅行气味的宇航员时，佩吉·惠特森(In-Peggy Whitson)将国际空间站描述为苦涩的烟雾味，唐·佩蒂特(Don Pettit)将太空行走描述为一种甜蜜的金属气味，类似于弧焊烟雾。\n在描述他2008年为美国宇航局工作时，皮尔斯本人在2012年告诉“大西洋月刊”，想象一下汗流浃背的脚和臭气熏天的体味，把它们和指甲油去污剂和汽油混合在一起……。然后你再走近。这听起来不像是一种商业上可行的产品，但对我来说，它肯定像是Eau de Boat。\n这并不是第一家声称向消费者提供太空瓶装气味的公司--航空公司洛克希德·马丁公司去年在愚人节限量生产了一种名为Vector的香水。我们自己的埃里克·伯杰(Eric Berger)有机会品尝了矢量，他说它是黑色的，麝香的，像木炭一样，类似于新铺设的覆盖物。\n皮尔斯的Kickstarter活动完全没有描述Eau de Space产品的实际气味。它可能会忠实地再现使用回收空气的人工机器的大部分人类恐惧感，或者它可能会抛弃人类的气味，专注于从太空行走中飘进来的刺鼻、电离的气味。如果你想知道，每瓶4盎司要花15美元。", "note_en": "If you ask a US Navy submariner the most visceral part of the underwater and underway experience, you&#39;ll get the same answer almost every time—it&#39;s the smell. &#34;Eau de Boat,&#34; as we sailors called it, is a unique combination of diesel fuel, machine oil, laundry hamper, and flatulence. To the best of my knowledge, nobody&#39;s ever attempted to bottle and sell Eau de Boat—but a Kickstarter  campaign is trying to do the same thing for space travel.\n  In late June, the US National Space Council&#39;s Executive Secretary Scott Pace expressed his desire to support companies like Virgin Galactic and Blue Origin in developing minimal commercial space tourism—brief suborbital round trips which take a few people above the atmosphere, then return them to the same spot they started. Virgin Galactic even  plans to send some NASA astronauts to the International Space Station, eventually.\n But these are likely to be small and expensive affairs that very few people will get to experience, for several more decades at least. In the meantime, space enthusiasts can more accessibly and affordably  experience the ISS to some degree in  virtual reality. Even with  six degrees of freedom, the experience is sharply limited.\n Oculus and its competitors are unlikely to figure out a way to simulate microgravity—but if you want to  smell the ISS while you virtually tour it, that might be an option.\n  Believe it or not, this isn&#39;t the first effort to bottle up the smell of space travel. NASA tries to simulate the experience of crewing its vehicles and running its missions as faithfully as possible during ground training, leaving its astronauts as prepared and confident during the real thing—and if you believe the Eau de Space Kickstarter campaign, that includes the smell.\n Decades ago, NASA contracted specialists to developed the &#34;smell of space&#34; to help train astronauts before launch into orbit. NASA&#39;s goal of simulating Space during training is to eliminate any surprises Astronauts might experience in Outer Space. Practice makes perfect, and it is Rocket Science. The Smell of Space has been locked behind &#34;Need to Know&#34;, Astronaut only field training, and Red Tape for years. Through shear determination, grit, a lot of luck, and a couple of Freedom of Information Act (FOIA) requests, we got it out.\n We&#39;re not too sure how well this claim stacks up to reality. The Kickstarter campaign itself is notably lacking in links to back up its claims. In a CNN  interview, Eau de Space founder and chemist Steve Pearce said NASA had contracted him to develop the simulated odor in 2008—which would be a cool story by itself, but it doesn&#39;t match up with the Kickstarter&#39;s campaign of a &#34;decades old&#34; program that had to be unearthed through FOIA.\n Finding astronauts willing to describe what space travel smells like isn&#39;thard— Peggy Whitson described the ISS as smelling like bitter, smoky gunpowder in 2002, and  Don Pettit describes eau de spacewalk as a sweet, metallic tang similar to arc-welding fumes.\n When describing his 2008 work for NASA, Pearce himself told the Atlantic in 2012 to &#34;imagine sweaty feet and stale body odour, mix that with nail polish remover and gasoline... then you get close.&#34; This doesn&#39;t sound like a commercially viable product, but it certainly sounds like Eau de Boat to me.\n This isn&#39;t the first time a company has claimed to offer the bottled smell of space to consumers—aviation company Lockheed Martin produced a limited batch of a scent it called &#34;Vector&#34; for April Fools&#39; Day last year. Our own Eric Berger got a chance to sample Vector, and he  pronounced it to be dark, musky, charcoal-like, and similar to freshly spread mulch.\n  Pearce&#39;s Kickstarter campaign is entirely free of any description of what the Eau de Space product actually smells like. It might faithfully reproduce the mostly human funk of a crewed machine with recycled air—or it might forego the human odors and focus on the sharp, acrid, ionized smell that wafts in from a spacewalk. If you want to find out, it&#39;ll cost you $15 per  4-ounce bottle.", "posttime": "2020-07-03 03:29:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,于闻,fly,气味", "title": "飞不起太空吗？满足于闻起来像它", "title_en": "Can’t afford to fly to space? Settle for smelling like it", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/cant-afford-to-fly-to-space-settle-for-smelling-like-it/", "via": "", "real_tags": ["太空", "于闻", "fly", "气味"]}, {"category": "", "categoryclass": "", "imagename": "5d76d0cd9c545482bff80bea1bc16e56.jpg", "infoid": 1009556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我非常清楚，联网汽车并不是围绕这些领域的热门话题，今天的新闻不太可能改变这一点。宝马(BMW)正计划将其新车的一些功能转变为订阅模式，这是宝马在周三向媒体介绍该公司数字计划时宣布的。\n对于汽车业来说，这并不是一个全新的想法--特斯拉率先提出了将硬件装运到车辆上的想法，这些硬件可以在购买时启用，也可以在以后付费。宝马过去在信息娱乐功能方面也做过类似的事情；有一段时间，如果你想使用Apple CarPlay，你必须每年支付80美元的订阅费，直到这家汽车制造商放弃了这个想法。\n但这些都是数字服务-现在这家巴伐利亚汽车制造商计划将这种模式应用于加热座椅等功能。宝马表示，车主可以提前获得试用产品的机会，试用期为一个月，之后他们可以预订一到三年的相应服务。该公司还表示，它可以允许宝马的第二位车主激活最初购买者拒绝的功能。\n事实上，宝马已经开始在一些市场实施这一想法，允许软件解锁自适应巡航控制或远光辅助等功能(在美国，这些选项通常是标准设备)。其他功能更加异想天开，比如为你的电动宝马设计了汉斯·齐默(Hans Zimmer)设计的音响套件，或者为你的M-Car设计了自适应悬架。事实上，该公司表示，其即将到来的下一次会议将扩大个性化的机会。我相信所有人都迫不及待了。", "note_en": "I&#39;m all too aware that connected cars aren&#39;t a popular topic around these parts, and with today&#39;s news that&#39;s unlikely to change. BMW is planning to move some features of its new cars to a subscription model, something it announced on Wednesday during a briefing for the press on the company&#39;s digital plans.\n It&#39;s not an entirely new idea to the auto industry—Tesla has pioneered the idea of shipping vehicles with hardware that can be enabled at the time of purchase or later on for a fee. And BMW has done something similar in the past with infotainment features; for a while, if you wanted access to Apple CarPlay, you had to pay an $80 yearly subscription  until the automaker abandoned that idea.\n But those were for digital services—now the Bavarian carmaker has plans to apply that model to features like heated seats. BMW says that owners can &#34;benefit in advance from the opportunity to try out the products for a trial period of one month, after which they can book the respective service for one or three years.&#34; The company also says that it could allow the second owner of a BMW to activate features that the original purchaser declined.\n In fact, BMW has already started implementing this idea in some markets, allowing software unlocking of features like adaptive cruise control or high-beam assist (in the United States, those options are usually standard equipment). Other features are more whimsical, like having a  Hans Zimmer-designed sound package for your electric BMW or adaptive suspension for your M-car. Indeed, the company says that  its forthcoming iNext will &#34;expand the opportunities for personalization.&#34; I&#39;m sure y&#39;all can&#39;t wait.", "posttime": "2020-07-03 03:08:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "座椅,seats,宝马", "title": "加热座椅作为服务吗？宝马希望按需销售汽车功能", "title_en": "Heated seats as a service? BMW wants to sell car features on demand", "transed": 1, "url": "https://arstechnica.com/cars/2020/07/heated-seats-as-a-service-bmw-wants-to-sell-car-features-on-demand/", "via": "", "real_tags": ["座椅", "seats", "宝马"]}, {"category": "", "categoryclass": "", "imagename": "fef9ba39fa6d0ee054ddc0371a5ba0e3.png", "infoid": 1009555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当然，这是一个非常开放的问题，但就公司的期望设定一些导轨可能会很好。作为个人贡献者，职业阶梯告诉我公司表面上看重的是什么(漏掉的是它并不看重的是什么)。\n我最近整理了这份职业阶梯清单，我想我会在这里分享它。有些梯子包括非技术性的工作，我将只看工程和工程管理。\n雾溪：从2009年开始，但显然乔尔的思想一直很有影响力。重点是不断增长的所有权、独立编写生产代码的能力、发货经验，以及高级设计/规划/体系结构。团队合作、自学、指导和影响力都是关键，乔尔测试也是如此。\n租用跑道(电子表格)：从2015年开始。根据技术技能、生产力、影响力和沟通/领导力，采用有趣的D&A D灵感DEX/Str/Wis/Cha统计数据进行评估。管理课程也包括在内，更侧重于架构、招聘、组织技能和领导力/销售能力。\nThumbtack(电子表格)：从2019年开始。将技术技能分解为代码质量/测试、调试和范围/项目设计，以及与协作、公民身份、领导力和影响相关的非技术因素。有趣的是，领导力分为自主权、判断力、主动性和建立共识。\nCircleCI(电子表格)：最著名的梯子之一，详细但不是压倒性的。值得注意的是，评估的价值之一是安全性。\n金融时报(WebApp)。甚至还有API！LOL。仅评估了技术、领导力、交付和沟通的4个领域。感觉是可以控制的。\n制造商专注于体系结构和框架&软件开发、最佳实践&体系结构和代码审查、技术技能评估和指导、引入新的工程工具和指导采用，并建议过程改进和支持采用。\n经理们专注于绩效评估、职业发展、招聘和资源配置、推出流程改进和工程工具的采用以及组织和管理。\n媒体(要点)：有移动，服务器，基金会，网络客户端，项目管理，通信，工艺，倡议，组织设计，成就，福祉，职业发展，布道，社区，招聘和导师的轨道！哟！\nStarling Software：使用大O符号来表示级别，这是一种有趣的做法。技能分为计算机科学、软件工程、编程、经验和知识。这一张在黑客新闻上有很长的记录，但这是一张我们可以研究的很好的地图。\nBrandWatch：从高层次解释级别，然后在此电子表格中将其细分为IC&39；s和管理层。总共需要处理15个属性！\nSpotify：Spotify以其团队/部落结构而闻名，强调步骤，列出他们想要的五套行为的简单清单：\n查克·格罗姆(Chuck Groom)-这是不同寻常的-关于工作阶梯的个人想法，尽管作者是VTS的高级工程负责人。很好地讨论了使用梯子有什么帮助，以及对反模式的描述。我喜欢首席工程师反模式：\n过分强调远远超出业务需求的可扩展性或高可用性。花了太多时间追逐最新的“闪亮”技术。不合作也不提问。居高临下。有“宠物”议程。激怒了高层领导。", "note_en": "Of course this is a very open ended question, but it can be nice to set some guide rails around what expectations are in a company. As an individual contributor, career ladders tell me what the company ostensibly values (and, by omission, what it doesn&#39;t value).\n  I recently compiled this list of career ladders and figured I would share it here. Some ladders include nontechnical jobs, I will just look at engineering and engineering management.\n  Fog Creek: from 2009, but obviously Joel&#39;s thinking has been very influential. Focus is on growing ownership, ability to write production code independently, shipping experience, and at senior levels, design/planning/architecture. Teamwork, self study, mentorship, and impact are all key, as well as the Joel Test.\n  Rent the Runway ( spreadsheet): from 2015. Takes a fun D&amp;D inspired Dex/Str/Wis/Cha stats based evaluation, corresponding to technical skill, productivity, impact, and communication/leadership. Management track is also included, with more focus on architecture, hiring, organizational skills, and leadership/salesmanship.\n        Thumbtack ( spreadsheet): from 2019. Breaks down technical skills into  code quality/testing,  debugging, and  scoping/project design, and nontechnical factors to  collaboration, citizenship, leadership, and impact. Leadership is interestingly broken down into  Autonomy, Judgement, Initiative, and Consensus Building.\n  CircleCI ( spreadsheet): one of the most well known ladders, detailed but not overwhelming. NOtably, one of the values assessed is Security.\n    Financial Times ( webapp). Even has an  API! lol. Only 4 areas across Technical, Leadership, Delivery, and Communication are assessed. Feels manageable.\n  Makers focus on Architecture &amp; framework &amp; software development, Best practices &amp; architecture &amp; code reviews, Technical skills evaluation &amp; mentoring, Introduce new engineering tools &amp; mentor adoption, and Recommend process improvements &amp; support adoption.\n  Managers focus on Performance evaluation, Career growth, Recruiting &amp; resourcing, Rollout process improvements &amp; adoption of engineering tools and Organization &amp; administrative.\n    Medium ( gist): has tracks for Mobile, Servers, Foundations, Web client, Project Management, Communication, Craft, Initiative, Org design, Accomplishment, Wellbeing, Career development, Evangelism, Community, Recruiting, and Mentorship! Phew!\n  Starling Software: Uses Big O notation to denote levels, which is a fun shibboleth. Skills are broken out to Computer Science, Software Engineering, Programming, Experience, and Knowledge. This one has a long record on  Hacker News but is a good map of things that we can work on.\n    Brandwatch: explains levels at a high level, and then breaks it out for  IC&#39;s and Management in this spreadsheet. A total of 15 attributes to work on!\n  Spotify: famous for its &#34;Squad/Tribe&#34; structure - emphasizes &#34;Steps&#34;, with a simple list of five sets of behaviors they want:\n  Chuck Groom - this is unusual - personal thoughts on a Job Ladder, though the author is a senior engineering leader at VTS. Good discussions on how having ladders helps, as well as descriptions of Anti-patterns. I love the Principal Engineer antipatterns:\n  Over-emphasis on scaling or high availability far beyond business needs. Spends too much time chasing the newest “shiny” technology. Doesn’t collaborate or ask questions. Condescending. Has “pet” agenda. Pisses off senior leadership.", "posttime": "2020-07-03 03:06:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "职业,engineering,领导力", "title": "每一个公共工程职业阶梯", "title_en": "Every Public Engineering Career Ladder", "transed": 1, "url": "https://www.swyx.io/writing/career-ladders/", "via": "", "real_tags": ["职业", "领导力"]}, {"category": "", "categoryclass": "", "imagename": "b1f015f12024983ec3d3eecb19df9dd5.jpg", "infoid": 1009554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加密电话网络被破解后，700多人在英国打击有组织犯罪的“有史以来最大规模”的行动中被捕。\n警方在查获5400万GB和数吨毒品后欢呼“对头目犯罪分子取得了无与伦比的胜利”\n警方逮捕了700多名嫌疑人，缴获了5400万英镑的现金和数吨毒品，这是英国有史以来打击有组织犯罪的“最大规模和最重要的”行动。\n官员们表示，此前被拘留的人中包括数十年来逃脱司法制裁、享受着“奢华”生活方式的“贱民”头目。\n在执法机构进入一个秘密通信网络后，包括那些向英国进口枪支、毒品和人口的高级别帮派成为一系列突袭行动的目标。\n它被称为EncroChat，被用在定制的手机上，旨在保护手机免受警方的渗透和检查。\n但在4月份，一个国际团队破解了它的加密，开始监视用户，并在他们不知不觉中收集他们的数据。\n周四上午，突袭行动仍在继续，英国国家犯罪局(NCA)表示：“全球有6万用户，英国约有1万用户。”\n“唯一的用途是协调和策划非法商品的分配、洗钱和密谋杀害敌对罪犯。”\n该平台被法国和荷兰的机构渗透，并通过欧洲刑警组织分享给包括英国在内的合作伙伴。\nNCA的一位发言人说：“在用户不知情的情况下，NCA和警方从那时起就一直在监控他们的一举一动。”\n“这是英国同类行动中规模最大、意义最重大的一次。”\n输入您的电子邮件地址请输入电子邮件地址电子邮件地址无效填写此字段电子邮件地址无效电子邮件已存在。登录以更新您的时事通讯首选项我希望接收周一至周五的早间标题，以及通过电子邮件发送的突发新闻提醒。\n数百名工作人员努力分析数据并识别EncroChat用户，处理了数百万条消息和数十万张图片。\n到目前为止，英国各地共逮捕了746人，其中包括之前逃脱法律制裁的“高价值目标”和“标志性”逃犯。\n这次行动还揭露了数量不详的腐败警察和不同执法机构员工的身份。\n官员们表示，尽管警方在打击帮派的行动中经常看到“弄脏手”的下级特工被捕，而高层人员仍处于自由状态，但EncroPhone只被“中层以上”使用。\n负责严重有组织犯罪的国家警察总长委员会主席史蒂夫·朱普(Steve Jupp)将这次行动称为“对头目犯罪分子的无与伦比的胜利”。\n“通过解散这些组织，我们拯救了无数人的生命，保护了英国各地的社区，”他补充道。\n到目前为止，突袭行动已经查获了超过5400万GB的犯罪现金，以及来自非法实验室的77支枪支和手榴弹，1800发子弹，超过2吨A类和B类毒品，以及2800万粒“街头安定”药丸。\n警方和NCA表示，通过阻止敌对团伙实施绑架和处决，他们已经阻止了200多起“生命威胁”。\n仅在伦敦，就发现了1400名EnroChat用户。伦敦警察局表示，这次行动使他们能够挫败6月份的一起暗杀阴谋，并逮捕了准枪手。\n伦敦警察厅表示，他们已经拘留了伦敦“最具危害性”的OCG之一的成员，并补充说：“这一群体的核心人物过着奢侈的生活方式，住在数百万英镑的房产里，可以使用顶级汽车。”\n“他们看起来是成功的、受人尊敬的商人，但他们是危险的人。”\nNCA的调查主任尼基·霍兰德(Nikki Holland)将这种渗透比作“该国每个顶级有组织犯罪集团都有内部人士”。\n她补充说：“这是英国有史以来打击严重有组织犯罪的最广泛和最深入的行动。”\n“这只是行动的开始，还将持续很长一段时间。…。我要对任何使用加密手机的罪犯说，你应该非常非常担心。“。\n这些设备是“EncroPhone”--定制的手机，声称可以提供完全匿名的内置安全操作系统、加密信息和通话、自毁短信，甚至还有“恐慌清除”功能。\n该产品6个月的合约价为1500 GB，吸引了欧洲各地的有组织犯罪集团。\n在竞争对手黑莓PGP网络被关闭后，EncroPhone从2017年开始变得更受欢迎。\nNCA副主任马特·霍恩(Matt Horne)表示，EncroChat网络“完全是出于犯罪目的”。\n他表示，EncroPhone已成为参与向英国进口毒品、枪支和人口以及大规模洗钱的有组织犯罪集团的“要求”。\n该网络被用来执行毒品债务，在竞争市场上进行地盘争夺战，发出威胁，策划袭击甚至暗杀。\n2018年5月，一名杀手谋杀了利物浦黑帮成员约翰·金塞拉(John Kinsella)，此前一名杀手使用了一部支持EncroChat的手机。\n针对欧洲用户的全欧洲行动始于4月份，但霍兰德表示，选择在冠状病毒大流行期间进行这一行动是巧合。\n她补充说，这“对我们有利，因为当我们打电话来的时候，更多的罪犯在家里”，而且由于犯罪率下降，警方有了更大的能力。\n6月13日，在EncroChat的运营商意识到他们的平台被渗透后，警方被迫“加强”活动。\n“今天，我们的域名被政府实体非法没收，”发送给用户的一条消息写道。“我们无法再保证您的Device…的安全性。建议您立即关闭电源并实际处置您的设备。“。\n在警报发布后被截获的英国用户之间的信息中有一条写道：“警察正在忙碌的一天。”\nEncroChat服务器现在已经关闭，但内政大臣普里蒂·帕特尔(Priti Patel)表示，针对类似设备的工作将继续进行。\n她补充说：“这次行动显示，犯罪分子不会利用加密设备在雷达下策划邪恶的犯罪活动而逍遥法外。”", "note_en": "More than 700 arrested in ‘biggest ever’ UK operation against organised crime after encrypted phone network cracked\n  Police hail ‘unparalleled victory against the kingpin criminals’ after £54m and tonnes of drugs seized\n  Police have arrested more than 700 suspects, seized £54m in cash and tonnes of drugs in the UK’s “biggest and most significant” operation ever against  organised crime.\n  Officials said previously “untouchable” kingpins who have evaded justice for decades, while enjoying “flashy” lifestyles, were among those detained.\n    High-level gangs, including those importing guns, drugs and people into Britain, have been targeted in a series of raids after  law enforcement agencies accessed a secretive communications network.\n            Known as EncroChat, it was used on bespoke mobile phones that were designed to be secure against police infiltration and examination.\n    But in April, an international team cracked its  encryption, started spying on users and harvesting their data as they carried on unawares.\n    “There were 60,000 users worldwide and around 10,000 users in the UK,” the  National Crime Agency (NCA) said as raids continued on Thursday morning.\n    “The sole use was for coordinating and planning the distribution of illicit commodities, money laundering and plotting to kill rival criminals.”\n  The platform was infiltrated by agencies in France and the Netherlands, and shared via Europol to partners including the UK.\n  “Unbeknown to users, the NCA and the police have been monitoring their every move since then,” an NCA spokesperson said.\n  “It is the biggest and most significant operation of its kind in the UK.”\n  Enter your email address      Please enter an email address  Email address is invalid  Fill out this field  Email address is invalid  Email already exists. Log in to update your newsletter preferences    I  would like to receive morning headlines  Monday - Friday plus breaking news alerts by email\n  Hundreds of staff worked to analyse the data and identify EncroChat users, working through millions of messages and hundreds of thousands of images.\n       It resulted in 746 arrests across the UK so far, including “high-value targets” and “iconic” fugitives who had previously escaped justice.\n  The operation has also revealed the identities of an unknown number of corrupt police officers and employees in different law enforcement agencies.\n  Officials said that while police operations against gangs frequently see lower-level operatives who “get their hands dirty” arrested while those at the top remain free, EncroPhones were only used by the “middle tier upwards”.\n     The National Police Chiefs’ Council lead for serious organised crime, Chief Constable Steve Jupp, called the operation “an unparalleled victory against the kingpin criminals”.\n    “By dismantling these groups, we have saved countless lives and protected communities across the UK,” he added.\n  Raids have so far seen more than £54m in criminal cash seized, alongside 77 firearms and grenades, 1,800 rounds of ammunition, over two tonnes of Class A and B drugs and 28 million “street valium” pills from an illicit laboratory.\n       As a result of the intelligence seized, police and the NCA said they had prevented more than 200 “threats to life”, by stopping rival gangs carrying out kidnappings and executions.\n  In London alone, 1,400 EnroChat users were found. The Metropolitan Police said the operation enabled them to foil an assassination plot in June and arrest the would-be gunman.\n  Scotland Yard said it had detained members of one of the “most high-harm” OCGs in the capital, adding: “The central figures of this group lead lavish lifestyles and live in multimillion pound properties with access to top-of-the-range vehicles.\n       “They appear to be successful, respectable business people but they are dangerous individuals.”\n  Nikki Holland, the NCA’s director of investigations, likened the infiltration to “having an inside person in every top organised crime group in the country”.\n  “This is the broadest and deepest ever UK operation into serious organised crime,” she added.\n  “This is just the start of the operation and it will be going on for a long time yet … I’d say to any criminal who uses an encrypted phone, you should be very, very worried.”\n  The devices were “EncroPhones” – bespoke mobiles that claimed to offer complete anonymity with a built-in secure operating system, encrypted messaging and calls, self-destructing texts and even a “panic wipe” function.\n     The product, priced at £1,500 for a six-month contract, attracted organised crime groups across Europe.\n  EncroPhones became more popular from 2017 onwards following the takedown of the rival Blackberry PGP network.\n  Matt Horne, deputy director of the NCA, said the EncroChat network was “completely for criminal purposes”.\n     He said EncroPhones had become “a requirement” for organised criminal groups involved in the importation of drugs, guns and people to the UK, as well as large-scale money laundering.\n    The network was used for enforcing drug debt, fighting turf wars over competing markets, making threats and planning attacks or even assassinations.\n  An EncroChat-enabled phone was previously used by a hitman who murdered Liverpool gangster John Kinsella in May 2018.\n     The Europe-wide operation against European users started in April, but Ms Holland said the timing during the coronavirus pandemic was a coincidence.\n  She added that it had “worked to our advantage because more criminals were at home when we came calling”, and police had greater capacity because of a drop in crime.\n  Police were forced to “intensify” activity on 13 June after EncroChat’s operators realised their platform had been penetrated.\n     “Today, we had our domain seized illegally by government entities,” read a message sent to users. “We can no longer guarantee the security of your device … you are advised to power off and physically dispose of your device immediately.”\n  Messages between British users that were intercepted after the alert went out included one reading: “The police are having a field day.”\n    EncroChat servers have now been shut down but the home secretary, Priti Patel, said work against similar devices would continue.\n  “This operation demonstrates that criminals will not get away with using encrypted devices to plot vile crimes under the radar,” she added.", "posttime": "2020-07-03 03:05:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "破解,电话,uk,表示", "title": "加密电话网络被破解后，英国700多人被捕", "title_en": "700+ arrests in UK after encrypted phone network cracked", "transed": 1, "url": "https://www.independent.co.uk/news/uk/crime/encrochat-phone-network-encryption-organised-crime-uk-arrests-police-a9597501.html", "via": "", "real_tags": ["破解", "电话", "uk", "表示"]}, {"category": "", "categoryclass": "", "imagename": "dfae78cf796610cdea3285c1913370b1.jpg", "infoid": 1009553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，英国已有近750人被捕，此前一个由执法机构组成的国际联盟渗透到一个加密聊天平台，嫌疑人在该平台上公开讨论谋杀、安排暗杀、非法毒品购买、枪支销售和其他涉嫌犯罪的问题。\n英国国家犯罪局(NCA)今天宣布了一项名为“威尼斯行动”的调查结果。到目前为止，英国情报机构总共逮捕了746名嫌疑人，缴获了77支枪，2吨毒品，2800万粒非法药丸，55辆高价值汽车，以及超过5400万英镑(6740万美元)的现金。\n在逮捕之前，欧洲地下组织广泛使用的加密通信平台Encrochat取得了突破。NCA调查主任尼基·霍兰德在一份书面声明中说，这个指挥和控制沟通平台渗透到英国犯罪市场，就像在这个国家的每个顶级有组织犯罪集团中都有一个内部人士。这是英国有史以来打击严重有组织犯罪的最广泛、最深入的行动。\n根据欧盟联合执法机构欧洲刑警组织(Europol)的说法，调查始于法国，最终于2017年在法国被称为艾玛(Emma 95；34；34；)。然后，它以代号Lamont；传播到荷兰，最终来到英国。欧洲刑警组织表示，瑞典和挪威的用户也与毒品贩运和其他有组织犯罪有牵连。\n到目前为止，法国当局拒绝公开他们的调查细节或结果，但荷兰当局表示，他们已经逮捕了100多名嫌疑人，缴获了8000多公斤可卡因，1200公斤冰毒，数十支枪支和豪华汽车，以及近2000万欧元(2250万美元)的现金。\n嫌疑人都是通过Encrochat进行通信的，Encrochat是一种加密服务，需要特殊的电话才能操作。正如欧洲刑警组织所描述的那样：\n提供给客户的Encrochat手机保证了完美的匿名性(客户账户上没有设备或SIM卡关联，在保证没有可追踪性的条件下获取)，以及加密接口(双操作系统，加密接口被隐藏以便不会被检测到)和终端本身(移除相机、麦克风、GPS和USB端口)的完美自由裁量权(Encrochat Phone保证了完美的匿名性(客户账户上没有设备或SIM卡关联，在保证没有可追踪性的条件下获取)和终端本身(移除摄像头、麦克风、GPS和USB端口)。\n找到了进入平台的方法的调查人员并没有试图以任何方式破解加密。取而代之的是，他们攻击这些设备，安装恶意软件，允许他们在发送消息之前读取消息。副主板审查了大量泄露的文件，并与执法部门、Encrochat和罪犯进行了交谈，以深入报告所发生的事情。\n主板观察到，Encrochat高度保密，运营方式与普通科技公司不同。虽然一名控制公司电子邮件地址的人告诉该网站，它是一家合法的公司，客户遍及140个国家，但与犯罪有关的消息来源称，大量Encrochat客户正在做一些非法的事情。\nMotherboard解释说，这些手机本身都是改装后的Android设备，其中包括一款由一家西班牙公司生产的名为BQ AQuaris X2的手机。Encrochat从物理上移除了手机的GPS、相机和麦克风功能，因此无法通过它们记录或跟踪用户。该公司还在每台设备上安装了双操作系统(标准Android和Encrochat系统)，这样手机就可以伪装成普通设备。这些设备还拥有一项功能，如果用户输入PIN，它们就可以被完全擦除。\n据Motherboard报道，今年5月，一些Encrochat用户开始在擦除功能上遇到问题。起初，Encrochat认为这是用户错误或流氓漏洞。今年5月，该公司拿到了一台有问题的X2设备，发现问题不是用户错误。取而代之的是恶意软件，它不仅阻止了擦除，还记录了屏幕锁定密码和克隆的应用程序数据。\nEncrochat推动了一次更新，但这些设备几乎立即再次受到攻击，新的恶意软件不仅可以记录锁屏密码-它还可以更改密码。在尝试了几种通过停止SIM服务来绕过攻击的方法后，Encrochat确定攻击很可能来自执法部门，并决定关闭。6月13日，它警告客户：今天，我们的域名被政府实体非法没收。他们改变了我们的领地的用途，发动了一场攻击，以破坏碳单位。\n该公司估计，欧洲约有50%的单位受到影响。由于攻击和恶意软件代码的复杂程度，我们无法再保证您的设备的安全，Encrochat补充道，建议用户关闭电源并实际处置手机。\n然而，正如已经清楚的那样，关闭来得太晚了，执法机构已经可以访问大量的数据。\n一位消息人士告诉Motherboard，大规模逮捕似乎取得了预期的效果，并告诉该网站，批量购买毒品变得非常困难，因为每个人都将被禁足。不过，平静可能不会持续太久：竞争对手不仅开始填补这一空白，而且还向以前使用Encrochat的用户提供折扣，这些用户现在可能正在寻找新的平台。", "note_en": "Almost 750 individuals in the UK have been arrested so far after an international coalition of law enforcement agencies infiltrated an encrypted chat platform in which the suspects openly discussed murder, arranged hits, illegal drug purchases, gun sales, and other alleged crimes.\n The UK&#39;s National Crime Agency (NCA) today  announced the results of an investigation it dubbed Operation Venetic. UK agencies, taken together, have to date arrested 746 suspects and seized 77 guns, two metric tons of drugs, 28 million illicit pills, 55 &#34;high value&#34; cars, and more than £54 million ($67.4 million) in cash.\n The arrests followed a breakthrough into an encrypted communications platform, Encrochat, used widely in the European underground. &#34;The infiltration of this command and control communication platform for the UK’s criminal marketplace is like having an inside person in every top organized crime group in the country,&#34; NCA Director of Investigations Nikki Holland said in a written statement. &#34;This is the broadest and deepest ever UK operation into serious organized crime.&#34;\n The investigation began in France, where it eventually was called &#34;Emma 95,&#34; in 2017,  according to Europol, the joint European Union law enforcement agency. It then spread to the Netherlands under the code name &#34;Lamont&#34; and eventually came to the UK. Users in Sweden and Norway were also implicated in drug trafficking and other organized crime, Europol said.\n French authorities declined to disclose publicly the details of their investigations or the results so far, but Dutch authorities said they have arrested more than 100 suspects and seized more than 8,000 kg of cocaine, 1,200 kg of crystal meth, dozens of guns and luxury cars, and almost €20 million ($22.5 million) in cash.\n  The suspects were all communicating through Encrochat, an encrypted service requiring specialized phones to operate. As Europol described it:\n Encrochat phones were presented to customers as guaranteeing perfect anonymity (no device or SIM card association on the customer&#39;s account, acquisition under conditions guaranteeing the absence of traceability) and perfect discretion both of the encrypted interface (dual operating system, the encrypted interface being hidden so as not to be detectable) and the terminal itself (removal of the camera, microphone, GPS and USB port)\n The investigators who found a way in to the platform didn&#39;t try to break the encryption in any way. Instead, they went for the devices, installing malware to allow them to read messages before they were sent. Vice Motherboard reviewed a trove of leaked documents and spoke with law enforcement, Encrochat, and criminals to  report in depth what happened.\n Encrochat &#34;is highly secretive and does not operate like a normal technology company,&#34; Motherboard observed. While &#34;someone in control of a company email address&#34; told the site that it is a legitimate firm with customers in 140 nations, criminal-affiliated sources said that a whole lot of Encrochat customers are doing something illegal.\n The phones themselves are modified Android devices, Motherboard explains, including a model called the BQ Aquaris X2 that&#39;s made by a Spanish firm. Encrochat physically removed GPS, camera, and microphone capabilities from the handsets, so users could not be recorded or traced through them. The company also installed dual operating systems on each device (standard Android as well as the Encrochat system) so the phone could masquerade as a normal device. The devices also boasted a feature allowing them to be wiped completely if the user entered a PIN.\n  In May, Motherboard reports, some Encrochat users started to have problems with that wipe feature. At first, Encrochat assumed it was user error or a rogue bug. In May, the company got its hands on one of the X2 devices with the problem and discovered the issue was not user error. Instead, it was malware that not only prevented the wipe but also recorded screen lock passcodes and cloned application data.\n Encrochat pushed an update, but the devices were almost immediately struck again, and the new malware could not only record lock screen passcodes—it could also alter them. After attempting several ways to work around the attack by halting SIM service, Encrochat determined the attack was likely from law enforcement and decided to shut down. On June 13, it  warned customers: &#34;Today we had our domain seized illegally by government entities(s). They repurposed our domain to launch an attack to compromise the carbon units.&#34;\n The company estimated about 50 percent of units in Europe were affected. &#34;Due to the level of sophistication of the attack and the malware code, we can no longer guarantee the security of your device,&#34; Encrochat added, advising users to power off and physically dispose of their phones.\n As has become clear, though, the shutdown came too late, and law enforcement agencies already had access to an enormous trove of data.\n One source told Motherboard the mass arrests seem to have had their desired effect and told the site that bulk purchases of drugs had become significantly harder because &#34;Everybody&#39;s going to ground.&#34; Still, the quiet may not last: competitors are not only moving to fill the space, but they&#39;re offering discounts to onetime Encrochat users who may now be looking for a new platform.", "posttime": "2020-07-03 02:48:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,渗透,infiltrate,encrochat", "title": "警方渗透加密手机，在有组织犯罪行动中逮捕数百人", "title_en": "Police infiltrate encrypted phones, arrest hundreds in organized crime bust", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/police-infiltrate-encrypted-phones-arrest-hundreds-in-organized-crime-bust/", "via": "", "real_tags": ["手机", "渗透", "encrochat"]}, {"category": "", "categoryclass": "", "imagename": "f830fb150eb4778eb446b903a12d7ecc.jpg", "infoid": 1009552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "塞恩科姆乐于取笑自己--毕竟，他是一家讽刺朋克新闻网站的联合创始人兼首席执行官--但他听起来也对自己在艰难时期所做的一切感到由衷的自豪。他从来没有筹集过外部资金，虽然过去也有过收购要约，但他总是担心这些收购要约可能会威胁到网站的话语权。\n“我一直是财务的后盾，”塞恩科姆告诉我。尽管如此，在某种程度上，“这开始变得不负责任。”\n因此，他很高兴自己、他的联合创始人兼主编比尔·康威(Bill Conway)和他们的编辑人员将获得一笔经济上的意外之财(更不用说医疗保健和福利了)，加上自由职业者的加薪。他还表示，此次收购将使“艰难时光”能够更认真地投资于其编辑战略，例如通过扩大其播客网络。\n“如果你喜欢艰难时期，那就是服用类固醇的艰难时期，”他说。“方向大同小异，但更好、更安全。”\n收购公司是成立于2016年的数字媒体和电子商务公司Project M Group，该公司还收购了Revolver Magazine和Inked Magazine。\n创始人兼首席执行官恩里克·阿贝塔(Enrique Abyta)是这样阐述Project M模式的：“我们走出去，与受众一起收购现有的媒体资产，我们重振或重新启动，或者向它们投入一些资本，以扩大这些受众。然后我们将其与一个垂直整合的电商平台捆绑在一起。“。\n毕竟，许多在线出版商一直在努力让数字广告模式发挥作用，这已经不是什么秘密了。鉴于Revolver专注于重金属和摇滚，Inked专注于纹身，这里有一些自然的商业机会-例如，如果你正在阅读一篇关于Metallica的文章，你可能还想买一件Metallica T恤。\n与此同时，阿贝塔强调了M项目收购的出版物的真实性的重要性，他说，收购后，这些出版物不会变得更加商业化。\n他说：“我是一个满身纹身的莫霍克人，在亚利桑那州凯夫克里克的房子里经营着这家公司。”“我们是地球上最小的公司，…。当我们与这些企业家合作时，我们的整个氛围是，我们希望与企业家和品牌合作。“。\n因此，包括Saincome在内的整个艰难时期团队将继续参与其中。同时，该网站的老母公司将继续拥有和运营相关的游戏和科技网站硬盘。\nSaincome表示，他还将继续运营OutVoice，这是一家独立的初创公司，建立了自由职业者支付工具。事实上，这笔交易的结果之一是，Project M的所有出版物都将使用OutVoice。\n他说：“我在艰难时期的角色将是那种有远见、打造品牌的人。”这应该会将他的大量时间和精力从日常的业务担忧中解放出来，他承诺，“我会把这些精力投入到OutVoice中。”", "note_en": "Saincome is happy to poke fun at himself — he is the co-founder and CEO of a satirical punk news website, after all — but he also sounded genuinely proud of what he’s built with  The Hard Times. He never raised outside funding, and while there have been acquisition offers in the past, he was always afraid that they might threaten the site’s voice.\n  “I had always been the financial backstop,” Saincome told me. Still, at a certain point, “That started to become irresponsible.”\n So he’s happy that there will be a bit of a financial windfall (not to mention health care and benefits) for himself, his co-founder and editor in chief Bill Conway and their editorial staff, plus a pay bump for freelancers. He also suggested that the acquisition will allow The Hard Times to invest more seriously in its editorial strategy, for example by building out its podcast network.\n “If you like The Hard Times, it’s just going to be The Hard Times on steroids,” he said. “It’s very much the same direction, but better and secured.”\n The acquiring company is  Project M   Group, a digital media and e-commerce company founded in 2016 that has also acquired  Revolver Magazine and  Inked Magazine.\n Here’s how founder and CEO Enrique Abeyta laid out the Project M model: “We go out and acquire existing media properties with an audience, and we reinvigorate or relaunch or put some capital behind them to grow those audiences. Then we tie that into a vertically integrated e-commerce platform.”\n After all, it’s no secret that many online publishers have struggled to make the digital advertising model work. And given Revolver’s focus on heavy metal and rock, and Inked’s focus on tattoos, there are some natural commerce opportunities — for example, if you’re reading an article about Metallica, you might also want to buy  a Metallica T-shirt.\n At the same time, Abeyta emphasized the importance of authenticity in the publications that Project M acquires, and he said that post-acquisition, they don’t become any more corporate.\n “I’m a tattooed, mohawked guy running this company out of my house in Cave Creek, Arizona,” he said. “We’re the least corporate thing on Planet Earth … Our whole vibe when we partner with these entrepreneurs is, we want to work with the entrepreneur and the brand.”\n So the entire Hard Times team, including Saincome, will remain involved. At the same time, the site’s old parent company will continue to own and operate the related gaming and technology site  Hard Drive.\n Saincome said he’ll also continue running  OutVoice, a separate startup  building freelancer payment tools. In fact, one of the results of the deal is that all of Project M’s publications will be using OutVoice.\n “My role at Hard Times is going to be the visionary, brand-builder sort of guy,” he said. That should free up a lot of his time and energy from worrying about day to day business concerns, and he promised, “I’m going to take that energy and pump it back right into  OutVoice  .”", "posttime": "2020-07-03 02:47:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,acquires", "title": "\n项目M收购朋克摇滚讽刺网站The Hard Times", "title_en": "\n\t\t\t\tProject M acquires punk rock satire site The Hard Times\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/02/project-m-acquires-the-hard-times/", "via": "", "real_tags": ["收购", "acquires"]}, {"category": "", "categoryclass": "", "imagename": "b3235eee1e223162101943ad915b2edf.jpeg", "infoid": 1009551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "柏林(美联社)-根据周四发布的一份年度报告，世界上丢弃的平板电视、手机和其他电子产品的堆积如山去年达到了创纪录的高点。\n这项由联合国支持的研究估计，2019年全球堆积的电子垃圾数量为5360万吨(5910万吨)-比前一年增加了近200万吨。\n这项研究的作者计算出，去年所有倾倒的带电池或插头的设备的重量加起来相当于350艘玛丽女王2号大小的游轮的重量。\n在所有被丢弃的塑料和硅中，有大量的铜、金和其他贵金属-例如，用于在电路板上导电。研究发现，虽然其中约六分之一被回收，但其余价值约570亿美元的贵重部件没有被回收。\n被丢弃的电子设备也会对健康和环境造成危害，因为它含有会损害神经系统的汞等物质。\n这项由联合国大学、国际固体废物协会和其他机构编制的研究报告的作者预测，到2030年，全球电子垃圾可能会增长到7400万吨。", "note_en": "BERLIN (AP) — The world’s mountain of discarded flat-screen TVs, cellphones and other electronic goods grew to a record high last year, according to an annual report released Thursday.\n The U.N.-backed study estimated the amount of e-waste that piled up globally in 2019 at 53.6 million metric tonnes (59.1 million tons) - almost 2 million metric tons more than the previous year.\n The authors of the study calculated the combined weight of all dumped devices with a battery or a plug last year was the equivalent of 350 cruise ships the size of the Queen Mary 2.\n Among all the discarded plastic and silicon were large amounts of copper, gold and other precious metals — used for example to conduct electricity on circuit boards. While about a sixth of it was recycled, the remainder of those valuable components — worth about $57 billion — weren’t reclaimed, the study found.\n  Discarded electronic equipment also poses a health and environmental hazard, as it contains substances such as mercury that can damage the nervous system.\n The authors of the study, which is produced by the U.N. University, the International Solid Waste Association and others, predicted that global e-waste could grow to 74 million metric tons by 2030.", "posttime": "2020-07-03 02:47:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电子,pile,研究", "title": "世界电子垃圾堆积如山：研究", "title_en": "World's Pile of Electronic Waste Grows Ever Higher: Study", "transed": 1, "url": "https://apnews.com/f2706b256cb163c1e662c2e4f9d7f78e", "via": "", "real_tags": ["电子", "pile", "研究"]}, {"category": "", "categoryclass": "", "imagename": "b872a9a000f91ca5671b61eca85c4f81.jpg", "infoid": 1009549, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Dealmaster的头条新闻是Razer Viper的新低价，这是我们最喜欢的有线游戏鼠标之一，大多数玩家都喜欢。最初零售价为80美元，现在售价为50美元。这比它之前的最低价便宜了10美元，我们已经看到这款设备在多个场合卖出了这个价格。\n去年假日季，我们在我们的科技爱好者礼品指南中推荐了Razer Viper，目前我们在我们的无线鼠标购买指南中推荐了它的无线对等产品Razer Viper Ultimate，作为最佳游戏选择。虽然有很多更便宜的鼠标在市场上，即使在这个价格，毒蛇是一个绝对高端的设备，无论是在舒适性和性能方面。\n它最大的吸引力在于它极其轻巧：69克重的毒蛇可以快速滑动，而不会把你锁在大多数其他超轻鼠标的蜂巢设计中。它对于较小的手来说并不太大，其略微隆起的设计轮廓应该与所有类型的抓手都能很好地工作。(不过，用爪子或指尖握住可能比握掌更舒服，特别是如果你的手很大的话。)。它的橡胶侧面帮助你更好地把握设备，设计真的是双刃剑，左右两边都有两个可定制的侧键。虽然毒蛇主要是由塑料制成的，但它摸起来很光滑，并且感觉牢固地组装在一起。\n在游戏中，毒蛇的表现令人钦佩，没有明显的延迟和极其精确的传感器。它的CPI范围可以以50个CPI为增量，从100调整到惊人的16,000；这个最高值有点夸张，但有足够的空间来微调鼠标对您的喜好的敏感度。滚轮对于超高速滚动来说有点太硬了，但它是准确的，而且主要的点击按钮足够清晰。连接的线缆也非常灵活，虽然鼠标的徽标上有少量的RGB照明，但它远不是惊人的。\n需要注意的一点是，Razer的Synapse3应用程序虽然不够引人注目，但并不支持MacOS。大多数PC游戏类型都使用Windows计算机，但如果不使用Windows计算机，您将无法自定义毒蛇的各种设置。值得一提的是，Razer出售的一款Viper Mini鼠标售价40美元--这是一款不错的设备，但它掉了几个侧钮，没有橡胶侧把，对于较大的手来说有点太小了，而且通常不如普通的Viper性能好。\n如果你对新鼠标不感兴趣，我们还有世嘉Genesis Mini、松下Eneloop充电电池、几个Anker充电配件、Apple HomePod等等。看看下面的完整名单。\nDealmaster推出了自己的时事通讯！注册后，就可以收到一份更短的、经过严格管理的网上最佳科技交易清单--不要胡说八道，直接进入你的收件箱，而且通常是在它们进入ARS主页之前。\n注意：ARS Technica可能会通过会员计划从本帖子上的链接中获得销售补偿。\n精选Prime用户：Amazon Fire TV 4K HDR媒体流在亚马逊售价24.99美元(使用代码：4KFIRETV-通常为50美元)。\nAnker PowerPort Zone PD 2迷你USB配电盘-2x AC，2x USB-A，18W USB-C PD，30W USB，在亚马逊总计24.89美元(剪辑4美元优惠券-通常为34美元)。\nAnker PowerCore III Fusion 5K，USB-C壁式充电器+便携式电池-18W USB-C PD，USB-A，5000 mAH，在亚马逊售价29.99美元(通常为40美元)。\n联想瑜伽C940笔记本电脑-英特尔酷睿i7-1065G7，14英寸1080p，12 GB内存，512 GB固态硬盘，百思买售价约999.99美元(通常为1,300美元)。\n联想ThinkCentre M90n迷你台式PC-英特尔酷睿i5-8265U，8 GB内存，512 GB固态硬盘，在联想售价399美元(使用代码：OHOTNANODEAL)-正常情况下为600美元。\nRazer Blade 15英寸游戏笔记本电脑-英特尔酷睿i7-9750H，15.6英寸1080p 144 Hz，16 GB RAM，256 GB固态硬盘，GeForce GTX 1660 Ti，亚马逊售价1099.99美元(通常为1500美元)。\n苹果MacBook Air(2020)笔记本电脑-1.1 GHz英特尔酷睿i5-1030NG7，13.3英寸2560x1600，8 GB RAM，512 GB固态硬盘，魔术键盘，亚马逊售价1199.99美元(通常为1270美元)。\n苹果MacBook Air笔记本电脑(2020年)-1.1 GHz英特尔酷睿i3-1000NG4，13.3英寸2560x1600，8 GB内存，256 GB固态硬盘，魔术键盘，亚马逊售价899.99美元(通常为970万美元)。\nApple Back to School促销：Apple AirPods真正的无线耳机可以免费购买精选Mac或iPad(必须是高等教育学生、高等教育学生的家长或K-12学校员工才有资格)。\n金属齿轮实心V：幻影疼痛控制器(PC，数字)在Steam的售价为5.99美元(通常为20美元)。\n精选Prime用户：Amazon Fire TV 4K HDR媒体流在亚马逊售价24.99美元(使用代码：4KFIRETV-通常为50美元)。\n75英寸索尼X900F(2018年款)4K HDR LED电视，亚马逊售价1,598美元(通常为1,800美元)。\nRoku智能音棒4K高清媒体流+音棒在亚马逊售价149.99美元(通常为175美元)。\n谷歌Nest Cam户外摄像头(2件装)1080P户外安全摄像头在亚马逊商店售价2.38亿美元(通常为300美元)。\nAnker Soundcore Life Q20在亚马逊以49.99美元的价格出售蓝牙降噪耳机(剪贴10美元的优惠券-通常是60美元)。\nAnker PowerPort Zone PD 2迷你USB配电盘-2x AC，2x USB-A，18W USB-C PD，30W USB，在亚马逊总计24.89美元(剪辑4美元优惠券-通常为34美元)。\nAnker PowerLine III在亚马逊以7.99美元的价格购买(3英尺)USB-C到USB-C 2.0电缆(使用代码：AKCTCPL352-通常为16美元)。\nAnker PowerLine III在亚马逊以9.99美元的价格购买(6英尺)USB-C到USB-C 2.0电缆(使用代码：AKCTCPL353-通常为18美元)。\nAnker PowerLine II提供3合1 USB电缆-USB-C、microUSB、Lightning，在亚马逊售价10.99美元(使用代码：NANKER8436-通常为18美元)。\nAnker PowerCore III Fusion 5K，USB-C壁式充电器+便携式电池-18W USB-C PD，USB-A，5000 mAH，在亚马逊售价29.99美元(通常为40美元)。\nBrydge 10.2 Keyboard在亚马逊以99.95美元的价格购买10.2英寸的苹果iPad(剪贴30美元的优惠券-通常是130美元)。", "note_en": "Today&#39;s Dealmaster is headlined by a new low price on  the Razer Viper, one of our favorite wired gaming mice for most players. Originally retailing for $80, it&#39;s currently available for $50. This is $10 cheaper than its previous best price, which we&#39;ve seen the device hit on multiple occasions.\n We recommended the Razer Viper in  our tech-enthusiast gift guide last holiday season, and we currently recommend its wireless equivalent, the  Razer Viper Ultimate, as the best gaming option in  our wireless-mouse buying guide. While there are plenty of cheaper mice out there, even at this deal price, the Viper is a decidedly premium device both in terms of comfort and performance.\n Its biggest draw is that it&#39;s supremely lightweight: at 69 grams, the Viper is quick to slide around without locking you into the &#34;honeycomb&#34; design of most  other ultralight mice. It&#39;s not too large for smaller hands, and its slightly-humped design is contoured in a way that should work well with all grip types. (Though it&#39;ll likely be  more comfortable with a  claw or fingertip grip than a palm grip, especially if you have large hands.) Its rubberized sides help you keep a better grip on the device, and the design is truly ambidextrous, with two customizable side buttons on its left and right. And while the Viper is primarily made of plastic, it&#39;s smooth to the touch and feels sturdily put together.\n In games, the Viper performs admirably, with no noticeable latency and a supremely precise sensor. Its CPI range can be adjusted from 100 to a whopping 16,000 in 50 CPI increments; that maximum is overkill, but there&#39;s plenty of room to fine-tune the mouse&#39;s sensitivity to your liking. The scroll wheel is a bit too stiff for ultra-fast scrolling, but it&#39;s accurate, and the main click buttons are sufficiently crisp. The attached cable is supremely flexible, too, and while there is a modicum of RGB lighting on the mouse&#39;s logo, it&#39;s far from egregious.\n One thing to note is that Razer&#39;s Synapse 3 app, while unobtrusive enough, doesn&#39;t support macOS. Most PC gaming types use a Windows machine anyway, but you won&#39;t be able to customize the Viper&#39;s various settings if not. It&#39;s also worth mentioning that Razer sells a  Viper Mini mouse for $40—that&#39;s not a bad device, but it drops a couple side buttons, lacks the rubberized side grips, is a bit too small for larger hands, and generally doesn&#39;t perform as well as the regular Viper.\n If you&#39;re not interested in a new mouse, though, we also have deals on the Sega Genesis Mini, Panasonic Eneloop rechargeable batteries, several Anker charging accessories, the Apple HomePod, and much more. Have a look at the full list below.\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n  Select Prime users:  Amazon Fire TV 4K HDR media streamer for  $24.99 at Amazon (use code:  4KFIRETV - normally $50).\n  Anker PowerPort Strip PD 2 Mini USB power strip - 2x AC, 2x USB-A, 18W USB-C PD, 30W USB total for  $24.89 at Amazon ( clip $4 coupon - normally $34).\n Anker PowerCore III Fusion 5K USB-C wall charger + portable battery - 18W USB-C PD, USB-A, 5,000mAh for  $29.99 at Amazon (normally $40).\n   Lenovo Yoga C940 laptop - Intel Core i7-1065G7, 14-inch 1080p, 12GB RAM, 512GB SSD for  $999.99 at Best Buy (normally $1,300).\n Lenovo ThinkCentre M90n mini desktop PC - Intel Core i5-8265U, 8GB RAM, 512GB SSD for  $399 at Lenovo (use code:  HOTNANODEAL - normally $600).\n Razer Blade 15 gaming laptop - Intel Core i7-9750H, 15.6-inch 1080p 144Hz, 16GB RAM, 256GB SSD, GeForce GTX 1660 Ti for  $1,099.99 at Amazon (normally $1,500).\n Apple MacBook Air (2020) laptop - 1.1GHz Intel Core i5-1030NG7, 13.3-inch 2560x1600, 8GB RAM, 512GB SSD, Magic Keyboard for  $1,199.99 at Amazon (normally $1,270).\n Apple MacBook Air (2020) laptop - 1.1GHz Intel Core i3-1000NG4, 13.3-inch 2560x1600, 8GB RAM, 256GB SSD, Magic Keyboard for  $899.99 at Amazon (normally $970).\n Apple Back to School sale: Apple AirPods true wireless earbuds for  free with select Mac or iPad purchases ( must be Higher Education student, parent of Higher Education student, or K-12 school employee to be eligible).\n   Metal Gear Solid V: The Phantom Pain (PC, digital) for  $5.99 at Steam (normally $20).\n      Select Prime users:  Amazon Fire TV 4K HDR media streamer for  $24.99 at Amazon (use code:  4KFIRETV - normally $50).\n 75-inch Sony X900F (2018 model) 4K HDR LED TV for  $1,598 at Amazon (normally $1,800).\n Roku Smart Soundbar 4K HDR media streamer + soundbar for  $149.99 at Amazon (normally $175).\n   Google Nest Cam Outdoor (2-pack) 1080p outdoor security camera for  $238 at Amazon (normally $300).\n  Anker Soundcore Life Q20 Bluetooth noise-cancelling headphones for  $49.99 at Amazon ( clip $10 coupon - normally $60).\n   Anker PowerPort Strip PD 2 Mini USB power strip - 2x AC, 2x USB-A, 18W USB-C PD, 30W USB total for  $24.89 at Amazon ( clip $4 coupon - normally $34).\n Anker PowerLine III (3ft) USB-C to USB-C 2.0 cable for  $7.99 at Amazon (use code:  AKCTCPL352  - normally $16).\n Anker PowerLine III (6ft) USB-C to USB-C 2.0 cable for  $9.99 at Amazon (use code:  AKCTCPL353 - normally $18).\n  Anker PowerLine II 3-in-1 USB cable - USB-C, microUSB, Lightning for  $10.99 at Amazon (use code:  ANKER8436 - normally $18).\n Anker PowerCore III Fusion 5K USB-C wall charger + portable battery - 18W USB-C PD, USB-A, 5,000mAh for  $29.99 at Amazon (normally $40).\n Brydge 10.2 Keyboard for 10.2-inch Apple iPad for  $99.95 at Amazon ( clip $30 coupon - normally $130).", "posttime": "2020-07-03 02:27:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,viper,excellent,鼠标", "title": "以50美元的新低抢购一只优秀的Razer Viper游戏鼠标", "title_en": "Grab an excellent Razer Viper gaming mouse for a new low of $50", "transed": 1, "url": "https://arstechnica.com/staff/2020/07/grab-an-excellent-razer-viper-gaming-mouse-for-a-new-low-of-50/", "via": "", "real_tags": ["游戏", "viper", "excellent", "鼠标"]}, {"category": "", "categoryclass": "", "imagename": "56275f237d5b8cc5dd65691ecdb66a89.jpg", "infoid": 1009548, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请于7月9日(星期四)参加我们的Extra Crunch Live，听听Emerging Capital的杰森·格林(Jason Green)的说法。Emerging Capital是推动和资助该领域一些最大的初创公司的领先投资者(和风险投资公司)之一。\nExtra Crunch Live只对额外的Crunch订户开放。如果您还不是Crunch的额外会员，您可以在这里加入。\n对于外行来说，EC Live的形式既直接又广泛，长达一小时的对话不仅涵盖了当今科技、创业和投资领域的一些最大问题-孩子们，我们现在确实有很多问题-而且以一种更轻松的形式切入核心，实际上看起来很有趣-你可以从过去与红杉(Sequoia)的罗洛夫·博塔(Roelof Botha)和家酿(Homebrew)的Hunter Walk的谈话中看到这一点。(请参阅此处的Extra Crunch Live演讲的完整日程。)。\n7月9日应该是一个特别好的日子，因为，嗯，格林充满了豆子。\n也就是说，在过去的几个月里，他一直非常直言不讳，领导着(令人放心的？令人担忧？)。向初创企业收取费用，让它们只冲销上个季度的账面价值，而把重点放在未来。\n听起来很轻率吗？不怎么有意思。格林拥有多年的经验可供借鉴-在云计算、企业和企业生产力领域，特别是在它们如何跨越方面，支持了过去十年中一些最具游戏规则改变和最成功的初创企业。它们包括Box、SalesLoft、ServiceMax、SteelBrick、SuccessFtors、Gusto(前身为ZenPayroll)和Yammer，Emerging本身也是Zoom、Salesforce、Crunchbase和Clearbanc的早期支持者。\n对于创始人、其他投资者和任何参与交易的人来说，特别是对企业初创公司来说，这是一个必须关注的问题。\nExtra Crunch Live只对额外的Crunch订阅者开放，所以如果你想看，可以在这里加入。您可以在下面的跳转下面找到呼叫的完整详细信息！", "note_en": "Come join us on Thursday, July 9, at  Extra Crunch Live to hear from  Jason Green of Emergence Capital, one of the leading investors (and VC firms) promoting and funding some of the biggest startups in this space.\n Extra Crunch Live is open exclusively to Extra Crunch subscribers. If you’re not already an Extra Crunch member, you can  join here.\n For the uninitiated, the EC Live format is at once direct and wide-ranging, an hour-long conversation that not only covers some of the biggest issues in tech, building startups and investing today — and boy do we have a lot of issues right now — but gets to the heart of them, in a lighter format that’s actually fun to watch — as you can see from past talks with  Sequoia’s Roelof Botha and  Homebrew’s Hunter Walk.  (See the whole schedule of Extra Crunch Live talks  here.)\n July 9 should be an especially good one because, well, Green is full of beans.\n That is to say, he’s been very outspoken in the last few months, leading the (reassuring? alarming?) charge for startups to  just write off the last quarter and focus on the future.\n Sounds flippant? Not really. Green has years of experience to draw on — a long track record backing some of the most game-changing and successful startups of the last decade+ in the areas of cloud computing, enterprise and enterprise productivity, and specifically in how they cross over. They include Box, SalesLoft, ServiceMax, SteelBrick, SuccessFactors, Gusto (formerly ZenPayroll) and Yammer, with Emergence itself also an early backer of Zoom, Salesforce, Crunchbase and Clearbanc.\n For founders, other investors and anyone involved in any aspect of deal-making, especially for enterprise startups, it’s a must-watch.\n  Extra Crunch Live is open exclusively to Extra Crunch subscribers, and so if you want to watch,  join here. You can find the full details of the call below the jump!", "posttime": "2020-07-03 02:26:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "现场,live", "title": "\nExtra Crunch Live：与Emerging Capital的Jason Green一起参加7月9日下午2点/11amPT的现场问答", "title_en": "\n\t\t\t\tExtra Crunch Live: Join Jason Green of Emergence Capital for a live Q&A on July 9 at 2pmET/11amPT\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/02/extra-crunch-live-join-jason-green-of-emergence-capital-for-a-live-qa-on-july-9-at-2pmet-11ampt/", "via": "", "real_tags": ["现场", "live"]}, {"category": "", "categoryclass": "", "imagename": "41ba6a5a24539ccf9e5f9ff0a84f65ad.jpg", "infoid": 1009547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球各地的景点比预期更早重新开放。这一追踪工具每天更新，监测全球旅游部门、已经向休闲旅行者开放国际边境的国家的最新更新，以及世界各地800多个景点的开放状况。\n几个国家已经开始放松国内的封锁规定。使用下表，您可以随时了解每个国家实施的旅行限制和修订后的规则。该表列出了受欢迎的国家及其关于封锁状态、国际旅行限制、签证规定以及目前正在审理的新冠肺炎案件数量的最新政策。该表格还包含一个指向政府官方网站的链接，您可以在那里找到对您的问题的更权威的答案。\n要将此表嵌入到您自己的网站中，请复制以下HTML并将其粘贴到页面的源代码中：\n&lt；div&gt；&lt；iframe title=&#39；top-international-tourist-destinations-table&#39；src=&#39；https://www.headout.com/top-tourist-destinations-table&#39；framework=&#39；0&#39；Width=&#39；100%&#39；Height=&#39；533&#39；/&gt；&lt；a href=&#34；https://www.headout.com/global-travel-reopening-tracker&#34；Style=&#34；显示：Block；页边距-TOP：16px；FONT-SIZE：12px；LINE-HEIGHT：19px；COLOR：#666666；&#34；&gt；数据由&lt；SPAN STYLE=&#34；COLOR：#ec1943；&#34；&gt；Headout&lt；/span&gt；&lt；/a&gt；&lt；/div&gt；编译。\n这是一份世界上所有重要景点和文化热点及其现状的清单。日本、澳大利亚、意大利和其他国家的主题公园、博物馆和景点已经开始开放，并发布了新的票务和安全指南。虽然一些地标仍然关闭，但我们迫不及待地想看到它们的状态变成绿色来开放。当它发生的时候，你可以打赌Headout会在那里帮助你体验最好的体验。\n要将此表嵌入到您自己的网站中，请复制以下HTML并将其粘贴到页面的源代码中：\n&lt；div&gt；&lt；iframe title=&#39；顶级景点-跟踪器-表&39；src=&#39；https://www.headout.com/attractions-tracker-table&#39；框架边框=&#39；0&#39；宽度=&#39；100%&#39；高度=&#39；533&#39；/&gt；&lt；a href=&#34；https://www.headout.com/global-travel-reopening-tracker&#34；Style=&#34；显示：块；页边距-顶部：16px；FONT-SIZE：12px；LINE-HEIGHT：19px；COLOR：#666666；&#34；&gt；数据由&lt；SPAN STYLE=&#34；COLOR：#ec1943；&#34；&gt；Headout&lt；/span&gt；&lt；/a&gt；&lt；/div&gt；编译。\n随着意大利在6月份宣布向国际游客开放边境的举措，以及澳大利亚、新西兰和一些欧洲国家正在建立旅游泡沫的传言，我们有望在2020年末看到国际旅游的复苏。浏览我们的交互式旅行推荐地图，找到您在COVID之后的第一个旅行目的地。\n新冠肺炎重新定义了全球旅行。随着我们慢慢迈向复苏的第一步，让我们来看看未来旅游的预期变化，无论是短期的还是长期的。\n由The Vacationer进行的一项调查显示，只有12.52%的受访者对立即进行的国际旅行感到舒服。鉴于最近的冠状病毒危机，越来越多的旅行者避免前往国际目的地，国内旅游将获得巨大的人气提升。这将在短期内带动当地旅游目的地和体验的发展。\n从长远来看，国内旅游业也将受益。虽然随着各国放松旅行限制和开放国际边境，这种突然涌入的国内游客最终将会减少，但目的地和体验可以继续预计国内游客数量将远远超过新冠肺炎之前的数字。\n在后COVID时代，徒步旅行、露营、骑自行车和徒步旅行等户外活动变得越来越受欢迎。追踪过去几个月谷歌搜索中这些活动的受欢迎程度，发现其搜索量出现了戏剧性的增长--趋势是高于COVID之前的数字。\n随着越来越多的人选择离家更近的公路旅行和逗留，汽车和房车租赁的需求预计将大幅上升。例如，我们可以看到，尽管旅游受到的打击最大，但像户外运动(房车租赁)和HipCamp(露营体验)这样的公司，访问他们网站的人数一直在异常稳定地激增。\n大流行的爆发导致远程工作变得越来越流行。在新冠肺炎之前，只有7%的美国人在家工作，现在这个数字上升到了62%。而且看起来这一趋势将会持续下去！\n随着远程工作成为常态，远程工作的概念将获得发展势头。旅行者现在将选择为期一个月的工作，而不是在周末进行多次短途旅行，这些酒店配备了便利不间断工作的设施。\n这一新趋势将迫使连锁酒店和旅游租赁物业进行创新。随着越来越多的人开始计划更长的假期，为长期住宿和超高速WiFi等便利设施提供更优惠价格的酒店和物业可以寻求吸引顾客和旅行者。\n最近的全球旅行禁令激发了新的虚拟旅行体验在世界各地的受欢迎程度。据Globetender最近报道，由法罗群岛发起的“远程旅游”计划吸引了超过7000名游客参加他们的虚拟体验。\n这些身临其境的体验带来了许多优势，比如诱人的价格和即时消费-就在你的沙发上。在后COVID时代，它们变得特别相关，因为在这个时代，从一个房间到另一个房间的旅行受到限制。\n虽然虚拟旅游不太可能取代传统旅游，但这场大流行肯定是这些虚拟体验的垫脚石，并加速了它们的增长，使它们在旅游业留下了印记。\n世界各地的景点正在加速重新开放，实施新的进入规则-强制性面具和社交距离，同时限制进入。虽然许多景点已经向公众开放，但更多的景点正在努力争取在未来几个月开业。\n对于那些愿意再次旅行的人来说，他们最关心的是安全问题。其他方面的担忧，如可负担性，而不是大流行的经济影响，预计也将与体验质量一起发挥重要作用。\n因此，非凡的、负担得起的和安全的体验将成为常态。无论是历史古迹、文物中心还是个人旅游平台，都将被迫拿出相关的制度、做法和方法来适应时代的变化。\n在大流行之前，在埃菲尔铁塔的任何一天，你都会看到入口处排起了蛇形的长队，游客们等待进入电梯的时间长达2个小时。\n然而，在大流行后的时代，排一小时的长队根本不是一个可行的选择。这就是为什么每天吸引数以千计游客的世界著名纪念碑和景点现在都在实施新的人群管理战略。\n对允许的游客数量设定上限和引入限时入场是大多数景点采取的两个主要步骤。因此，对所有参观者来说，整体旅行体验变得更加安全、高效和方便。\n自从大流行关闭世界以来，500多个著名的旅游景点重新开放。在所有重新开放的旅游景点中，45%的景点强制要求购买在线门票，并完全关闭了线下售票柜台。\n在大流行之前，超过85%的体验是在柜台或通过礼宾/旅行社在线下出售的。然而，随着社会距离等安全措施的迫切需要，这已不再是一个可行的选择。因此，由于大流行，线下旅游业现在被迫进行创新。\n从长远来看，即使世界已经从大流行中恢复过来，这一趋势预计仍将继续。虽然线下旅游行业将重新获得一些失去的动力，但它不会回到COVID之前的水平。已经开发了基础设施的在线旅游市场和其他在线旅行社将脱颖而出。\n国际航空运输协会(IATA)最近的一项调查发现，60%的受访者在冠状病毒得到控制后会等待两个月才会预订航班-40%的人表示他们会等待至少六个月。然而，你并不总是要去很远的地方才能玩得开心。在大流行之后，国内旅游将以前所未有的速度回升。以下是每个国家一些最受欢迎的国内旅游目的地的名单。\n仅仅因为我们呆在家里并不意味着我们已经失去了旅行的欲望。无论您身处世界何地，都可以参加在线体验，从互动烹饪课程到实况流徒步旅行。", "note_en": "Pockets of the globe are reopening sooner than expected. Updated daily, this tracker monitors the latest updates across global travel sectors, countries that have opened their international borders for leisure travelers as well as the opening status of 800+ attractions around the world.\n  Several countries have begun to ease their domestic lockdown rules. You can stay up to date with each country’s imposed travel restrictions and revised rules using the table below. The table contains a list of popular countries and their updated policies regarding the lockdown status, international travel restrictions, visa rules as well as the current number of active COVID-19 cases. The table also contains a link to the official government website where you can find more authoritative answers to your questions.\n To embed this table in your own website, copy the following HTML and paste it in the source code for your page:\n &lt;div&gt;&lt;iframe title=&#39;top-international-tourist-destinations-table&#39; src=&#39;https://www.headout.com/top-tourist-destinations-table&#39; frameBorder=&#39;0&#39; width=&#39;100%&#39; height=&#39;533&#39; /&gt;&lt;a href=&#34;https://www.headout.com/global-travel-reopening-tracker&#34; style=&#34;display: block;margin-top: 16px;font-size: 12px;line-height: 19px;color: #666666;&#34;&gt;Data compiled by &lt;span style=&#34;color: #ec1943;&#34;&gt;Headout&lt;/span&gt;&lt;/a&gt;&lt;/div&gt;\n This is a list of all the important attractions and cultural hot-spots of the world and their current status. Theme parks, museums and attractions in countries such as Japan, Australia, Italy and others have started to open up with new ticketing and safety guidelines. While some landmarks are still closed, we can&#39;t wait to see their status turn green to open. And when it does, you can bet Headout will be there to help you experience the best of it.\n To embed this table in your own website, copy the following HTML and paste it in the source code for your page:\n &lt;div&gt;&lt;iframe title=&#39;top-attractions-tracker-table&#39; src=&#39;https://www.headout.com/attractions-tracker-table&#39; frameBorder=&#39;0&#39; width=&#39;100%&#39; height=&#39;533&#39; /&gt;&lt;a href=&#34;https://www.headout.com/global-travel-reopening-tracker&#34; style=&#34;display: block;margin-top: 16px;font-size: 12px;line-height: 19px;color: #666666;&#34;&gt;Data compiled by &lt;span style=&#34;color: #ec1943;&#34;&gt;Headout&lt;/span&gt;&lt;/a&gt;&lt;/div&gt;\n With Italy announcing a move to open its borders to international tourists in June, and talk of travel bubbles being set up in Australia, New Zealand and a few European countries, we’re hopefully looking at a resurgence of international travel in late 2020. Go through our interactive travel recommendations map to find your first post-COVID travel destination.\n COVID-19 has redefined travel worldwide. As we slowly take the first steps towards recovery, let’s take a look at how travel is expected to change in the future, both in the short and long term.\n A survey conducted by the Vacationer revealed that only 12.52% of respondents felt comfortable with immediate international travel. As more and more travelers refrain from visiting international destinations in view of the recent coronavirus crisis,  domestic tourism is set to gain a massive boost in popularity. This will foreseeably lead to the development of local tourist destinations and experiences in the short term.\n Domestic tourism is also set to gain in the long term. While this sudden influx of domestic travelers will eventually decline as countries ease travel restrictions and open international borders, destinations and experiences can continue to expect domestic tourist numbers that well eclipse pre-COVID-19 numbers.\n Outdoor activities like hiking, camping, biking and trekking have become increasingly popular in the post-COVID era. Tracking the popularity of these activities in Google&#39;s searches in the past months shows a dramatic rise in its search volumes – trending at figures greater than pre-COVID times.\n As  more and more people opt for road trips and staycations closer to home, the demand for car and RV rentals is expected to rise significantly. For example, we can see that despite travel being hit the hardest, companies like  Outdoorsy (RV rental) and  Hipcamp (camping experiences) have been seeing an exceptional steady surge in the number of people visiting their websites.\n The onset of the pandemic has resulted in remote work becoming increasingly popular. While only 7% of Americans worked from home before COVID-19, the number has now increased to 62%. And it looks like the trend is here to stay!\n With remote work becoming the norm, the concept of  &#39;workations&#39; will gain momentum. Instead of going on multiple short trips over the weekends, travelers will now opt for a month-long workation to properties that are equipped to facilitate uninterrupted work.\n This new trend will force hotel chains and travel rental properties to innovate. As more and more people begin planning longer holidays, hotels and properties that offer better pricing for long term stays and amenities like super-fast WiFi can look to attract customers and travelers.\n The recent worldwide travel ban has inspired a surge in the popularity of  new virtual travel experiences all over the world. Globetrender recently reported that the &#39;Remote Tourism&#39; initiative by the Faroe Islands saw more than 7,000 tourists taking part in their virtual experience.\n These immersive experiences come with many advantages like attractive prices and immediate consumption – right from your couch. And they become especially relevant in the post-COVID era where traveling is limited from one room to the other.\n While it is unlikely that virtual tourism will ever displace traditional tourism, the pandemic has definitely acted as a stepping stone for these virtual experiences and have accelerated their growth, allowing them to make a mark in the travel industry.\n Attractions around the world are reopening at an accelerated rate, implementing new rules of entry – mandatory masks and social distancing along with limited access. While many have already opened their doors to the public, even more attractions are working towards opening in the coming months.\n The primary concern in the mind of those willing to travel again will be safety. Other concerns like affordability in lieu of the economic repercussions of the pandemic are also expected to play a major role, along with quality of the experience.\n Thus,  exceptional, affordable and safe experiences will become the norm. Be it historical monuments, heritage centers or individual travel platforms, they will all be forced to come up with relevant systems, practices and methods to adapt to the changing times.\n Pre-pandemic, on any given day at the Eiffel Tower, you would see a serpentine queue at the entrance with tourists waiting up to 2 hours to access the elevators.\n In the post-pandemic era, however, waiting in hour-long queues will simply not be a feasible option. Which is why world-famous monuments and attractions that lured in thousands of tourists every day are now implementing  new crowd-management strategies.\n Placing a cap on the number of visitors allowed and introducing timed entry are the two main steps taken by most attractions. As a result, the overall travel experience has become more safe, efficient and convenient for all visitors.\n Over 500 prominent tourist attractions have reopened since the pandemic shut the world down.  45% of of all tourist attractions that have reopened have mandated the purchase of online tickets and closed their offline ticket counters completely.\n Pre-pandemic, more than 85% of all experiences were sold offline at the counter or via a concierge/travel agency. However, with the pressing need for safety measures like social distancing, this is no longer a feasible option. Thus, the offline travel industry has now been forced to innovate due to the pandemic.\n In the long term, even after the world has recovered from the pandemic, this trend is expected to continue. While the offline travel industry will gain back some of its lost momentum, it will not return to pre-COVID levels. Online travel marketplaces and other OTAs who have the infrastructure developed will come out the winners.\n A  recent survey by the International Air Transport Association (IATA) found that 60% of people questioned would wait for two months before booking flights after the coronavirus is contained - 40% said they would wait for at least six months. However, you don’t always have to travel far to have a good time. In the wake of the pandemic, domestic travel is set to pick up like never before. Here’s a list of some of the most popular domestic tourist destinations in each country.\n Just because we’re staying home doesn’t mean we’ve lost our wanderlust. Join online experiences, from interactive cooking classes to livestream walking tours, no matter where you are in the world.", "posttime": "2020-07-03 02:25:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全球,travel,旅游", "title": "全球旅行重新打开仪表板", "title_en": "Global Travel Reopening Dashboard", "transed": 1, "url": "https://www.headout.com/global-travel-reopening-tracker", "via": "", "real_tags": ["全球", "travel", "旅游"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009546, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LFortran是建立在LLVM之上的现代开源(BSD许可)交互式Fortran编译器。它可以交互地执行用户代码，以便进行探索性工作(很像Python、MATLAB或Julia)，还可以编译二进制代码，目标是在多核CPU和GPU等现代架构上运行用户代码。\nGitLab的主存储库：https://gitlab.com/lfortran/lfortran GitHub镜像：https://github.com/lfortran/lfortran之星使用活页夹在线试用：有什么问题吗？请在Zulip或我们的邮件列表上咨询我们。\nFortran是从头开始构建的，目的是将数学转换成简单、可读和快速的代码。\n比像C或C++这样的语言有更多的限制(和更高的级别)，所以结果代码更容易维护和编写，也更容易编译器进行优化。做事情有一种规范的方法。\nLFortran允许交互地使用Fortran，就像Python、Julia或MATLAB一样。它可以在Jupyter笔记本上运行。\nFortran是一种成熟的语言，建立在62年的专业知识基础上，广泛用于高性能计算(HPC)。\nFortran有许多优秀的开源编译器：用于生产的GFortran和Flang；正在开发的新编译器，如F18和LFortran。\nLFortran还在开发中，现在有一些功能可以工作，还有一些功能正在实现中。\n交互式的Jupyter支持LFortran可以用作Jupyter内核，允许Python/Julia风格的快速原型和探索性工作流(参见静态或交互示例笔记本)。它还可以在带有交互式提示符(REPL)的命令行中使用。\n干净、模块化的设计，可作为库使用，LFortran围绕两个独立的模块AST和ASR构建，这两个模块都是独立的(完全独立于LFortran的其余部分)，并鼓励用户将其独立用于其他应用程序并在其上构建工具。有关更多详细信息，请参阅设计和开发人员TutorialDocuments。\n与GFortran的初始互操作LFortran有一个用于GFortran模块文件的原型解析器，并生成了一个Fortran包装器，允许在任何Fortran编译器中使用该模块。此功能仍在开发中。\n这些功能正在开发中，有一个指向相应问题的链接，这样您就可以通过跟踪它来跟踪进度。\n与其他语言(和其他Fortran编译器)的本机互操作使用USE语句导入用其他语言(如C或Python)编写的库，请参见#44。添加对用其他Fortran编译器生成的模块文件的支持，请参见#56。这将允许LFortran运行大量的生产代码。\n对不同硬件LLVM的支持使得在不同硬件上运行LFortran成为可能，并在多核CPU和GPU上利用原生Fortran语言构造(如并发操作)，请参见#57。\n完整的Fortran 2018支持目前只实现了Fortran的一个子集(我们计划确切记录所支持的内容#92，同时仅比笔记本中提供的内容多一点)，但目标是全面实施最新的Fortran 2018标准，请参阅#58。\n请在我们的问题跟踪器中对您希望我们优先处理的问题进行投票(如果我们遗漏了什么，请随时创建新的问题)。\n这里列出的任务为早期用户提供了贡献错误报告、功能请求和代码的机会。这样，LFortran将逐渐对更多的人有用，社区也会发展壮大。\n获取使用模块的GFortran模块文件，包括假定大小数组和假定形状数组(#52)。这将使LFortran对早期用户可用。我们预计在2019年夏末完成这项任务。\n逐渐用C++重写编译器以提高健壮性和速度(#70)。Python API不会改变(或者只会有最小的改变)。", "note_en": "LFortran is a modern open-source (BSD licensed) interactive Fortran compilerbuilt on top of LLVM. It can execute user’s code interactively to allowexploratory work (much like Python, MATLAB or Julia) as well as compile tobinaries with the goal to run user’s code on modern architectures such asmulti-core CPUs and GPUs.\n  Main repository at GitLab: https://gitlab.com/lfortran/lfortran GitHub mirror: https://github.com/lfortran/lfortran Star Try online using Binder:   Any questions? Ask us on Zulip   or our  mailing list.\n  Fortran is built from the ground up to translate mathematics into simple,readable, and fast code.\n    More restricting (and higher level) than languages like C or C++, so that theresulting code is easier to maintain and write and easier for the compilers tooptimize. There is one canonical way to do things.\n  LFortran allows to use Fortran interactively just like Python, Julia or MATLAB.It works in a Jupyter notebook.\n  Fortran is an established language, building on 62 years of expertise.Widely used for High Performance Computing (HPC).\n  Fortran has many excellent open source compilers: GFortran and Flang forproduction; new compilers in development such as F18 and LFortran.\n  LFortran is in development, there are features that work today, and there arefeatures that are being implemented.\n  Interactive, Jupyter support LFortran can be used as a Jupyter kernel, allowing Python/Julia-style rapidprototyping and an exploratory workflow (see the  static or  interactiveexample notebook). It can also be used from the command-line with aninteractive prompt (REPL).\n Clean, modular design, usable as a library LFortran is structured around two independent modules, AST and ASR, both ofwhich are standalone (completely independent of the rest of LFortran) andusers are encouraged to use them independently for other applications andbuild tools on top. See the  Designand  Developer Tutorialdocuments for more details.\n Initial interoperation with GFortran LFortran has a prototype parser for GFortran module files and generation ofa Fortran wrapper that allows using the module with any Fortran compiler.This feature is still under development.\n  These features are under development, there is a link to the correspondingissue so that you can track the progress by following it.\n Native interoperation with other languages (and other Fortran compilers) Import libraries written in other languages (such as C or Python) with the use statement, see  #44. Add support for module files generated withother Fortran compilers, see  #56. This will allow LFortran to run a largearray of production codes.\n Support for diverse hardware LLVM makes it possible to run LFortran on diverse hardware and takeadvantage of native Fortran language constructs (such as  do concurrent)on multi-core CPUs and GPUs, see  #57.\n Full Fortran 2018 support Currently only a subset of Fortran is implemented (we plan to documentexactly what is supported  #92, in the meantime it is just a bit more thanwhat is presented in the  notebook), but the goal is to have afull implementation of the latest Fortran 2018 standard, see  #58.\n Please vote on issues in our  issue tracker that you want us to prioritize(feel free to create new ones if we are missing anything).\n  The tasks listed here provide early users with the opportunity to contributebug reports, feature requests and code. This way LFortran will gradually becomeuseful to more people and the community will grow.\n Get GFortran module files working with  use module, both assumed-size andassumed-shape arrays ( #52). This will make LFortran usable for earlyusers. We expect to finish this task by the end of summer 2019.\n Gradually rewrite the compiler in C++ for robustness and speed ( #70).The Python API will not change (or only minimally).", "posttime": "2020-07-03 02:24:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,交互式,modern,lfortran", "title": "LFortran：基于现代交互式LLVM的Fortran编译器", "title_en": "LFortran: Modern interactive LLVM-based Fortran compiler", "transed": 1, "url": "https://lfortran.org/", "via": "", "real_tags": ["编译", "交互式", "modern", "lfortran"]}, {"category": "", "categoryclass": "", "imagename": "d2dc2da3bede5b1508d595ae5c718606.png", "infoid": 1009543, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌不再销售廉价手机。至少，这是该公司目前的暂时状况，这要归功于Pixel3a的停产(很可能是有计划的)，以及它的继任者Pixel4a的延迟(肯定是意外的)。9to5昨天，谷歌首次注意到这款手机从谷歌商店下架，谷歌向几家网点证实，这款手机正式不再出售。\n谷歌现在应该有替代者了。谷歌的新款廉价手机Pixel4a预计将在Google I/O2020上发布，这也是推出Pixel3a的同一场展会。这本来会发生在5月份，虽然冠状病毒大流行让谷歌I/O和其他所有公众集会停止了，但这仍然不能很好地解释为什么现在是7月份，Pixel4a仍然在行动中失踪。谷歌可能有与COVID相关的供应问题，但其他制造商，如宏达电、摩托罗拉和华为最近都推出了新产品。\nPixel 3a于2019年5月发布，是一款真正的大众喜闻乐见的产品。在扼杀Nexus系列并多年来只销售昂贵的Pixel手机后，谷歌带着这款400美元的设备重返经济型市场。这款便宜的手机和更贵的Pixel3一样有很棒的摄像头，也有同样棒的谷歌-Android版本，但有三年的更新计划。只有一些小的预算让步，比如稍微慢一点的SoC和塑料车身，但这两个都不是主要的缺点。谷歌便宜的手机可能有点太好了(也可能是昂贵的手机不够好)：没有太多理由选择更贵的Pixel3或4，而不是Pixel3a。\n从我们看到的Pixel4a来看，这款手机看起来将是经济型Android手机的最佳选择之一。在更广阔的市场上，Pixel4a将面临比以往任何时候都更激烈的竞争，这将是苹果的iPhone SE。说到性能，Pixel4a胜算不大：苹果400美元的手机甚至比最贵的Android手机都要快。Pixel4a将需要依靠更大的屏幕和更现代的设计。在Android市场，它还将不得不与即将推出的一加中端设备一加(OnePlus&39；39；)展开竞争，这款名字古怪的一加诺德(OnePlus Nord)预计将于本月某个时候发布。\n虽然这款手机不再出售，但Pixel3a当然仍将获得软件更新。软件支持的终止日期定于2022年5月。", "note_en": "Google is no longer selling cheap phones. At least, that&#39;s the temporary situation the company is in now, thanks to the (probably planned) discontinuation of the Pixel 3a and the (definitely unplanned) delays of its successor, the Pixel 4a.  9to5Google first noticed that the phone was pulled from the Google Store yesterday, and Google confirmed to several outlets that the phone is officially no longer for sale.\n Google was supposed to have a replacement by now. Google&#39;s new cheap phone, the Pixel 4a, was expected to be announced at Google I/O 2020, the same show that launched the Pixel 3a. That would have happened in May, and while the coronavirus pandemic put a stop to Google I/O and every other public gathering, that still doesn&#39;t quite explain why it&#39;s July now and the Pixel 4a is still missing in action. It&#39;s possible that Google is having COVID-related supply issues, but other manufacturers like  HTC,  Motorola, and  Huawei have had launches lately.\n The Pixel 3a launched in May 2019 and was a real crowd-pleaser. After killing the Nexus line and only selling expensive Pixel phones for years, Google returned to the budget market with the $400 device. The cheaper phone had the same great camera as the more expensive Pixel 3, and the same great Google-Android build with a three-year update plan. There were only small budget concessions like a slightly slower SoC and a plastic body, but neither of those were a major downside. Google&#39;s cheap phone was maybe a little too good (or maybe the expensive phones were not good enough): there wasn&#39;t much reason to pick a more expensive Pixel 3 or 4 over a Pixel 3a.\n From what we&#39;ve seen of  the Pixel 4a, the phone looks like it will be one of the best options for a budget Android phone. In the wider market, the Pixel 4a will face harsher competition than ever in the form of  Apple&#39;s iPhone SE. The Pixel 4a won&#39;t stand a chance when it comes to performance: Apple&#39;s $400 phone is faster than even the most expensive Android phones. The Pixel 4a will need to rely on a bigger screen and more modern design. In the Android market, it will also have to do battle with OnePlus&#39; upcoming mid-range device, the oddly named &#34; OnePlus Nord,&#34; which is expected to launch sometime this month.\n While the phone is no longer for sale, the Pixel 3a will still, of course, get software updates. The end-of-life for software support is  scheduled for May 2022.", "posttime": "2020-07-03 02:05:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,pixel4a", "title": "RIP to the Google Pixel 3a，该产品已正式停产", "title_en": "RIP to the Google Pixel 3a, which is officially discontinued", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/rip-to-the-google-pixel-3a-which-is-officially-discontinued/", "via": "", "real_tags": ["google", "pixel4a"]}]