[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1072949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "闲逛很好。我一直都在使用hangouts，直到有一天你打开了hangouts应用程序，强迫人们使用一个叫。。。闲聊那里&#39；有那么多死气沉沉的信息应用，我&#39；我肯定是&#39；你把每个人都换成新的人只是时间问题。\n唐&#39；难道不是邪恶吗？制造好的产品来改善人们的生活发生了什么#39；谁的生命？\n@benjrblant Google只能&#39；Don’不要停止杀掉聊天客户并创建新的（这可能更好，也可能不更好）。\n@facw i和#39；我现在受够了。而且替换应用程序很糟糕。\n它&#39；这就是我脱离他们整个生态系统的原因。我的Onhub路由器很快就要失效了，然后它&#39；它真的只剩下色度了。\n我&#39；我愿意考虑远离Android，但是我讨厌iOS，我必须使用它来进行Web浏览，所以我和39我没有风险。\n@benjrblant it&#39；这几乎就好像是一个科技巨头对长期经济不利。\n@法科真是胡说八道&#39；这是一篇很长的文章。我浏览了其中的大部分内容，我记得当第一对夫妇被宣布时，我很兴奋，但这张图表总结了这一点。\n我曾经是所有科技产品的早期使用者，但谷歌把我变成了一个暴躁的人。贝塔？不，当V7.8.45.115发布后给我打电话，然后我&#39；我想试试看。\n@benjrblant是的，说真的，我不&#39；我不知道根据谷歌的历史，他们是如何期望任何人为像体育场这样的东西买单的。也许是一个月订阅服务，或者是一个在你购买某个东西时还提供DRM免费或Steam PC拷贝的服务，但在他们头脑正常的人中，谁会支付全额从一个平台上购买游戏，而一旦出现其他东西，谷歌肯定会杀死这个平台？它&#39；它还没有死，但似乎很接近：“非暴力化”的谷歌体育场将转向“谷歌流”白标签服务。\n它&#39；谷歌的一切都是一样的。我不&#39；我不相信他们除了搜索、广告、分析、Gmail和表单之外还能提供任何服务。即使是安卓我也不会&#39；如果他们最后说&#34；所有人现在都在Fuchsia&#34;\n@这就是为什么我买了一个HD-DVD/蓝光组合光驱！但事实证明光媒体已经死了。\n@facw我爸爸给了我他的旧iPhone 7作为我的第一部手机，从那时起，我有了一部新手机，MacBook和AirPods。所以是的，他们抓住了我。不过，隐私和整合是惊人的。\n@benjrblant很难一直喜欢谷歌！去年早些时候，我试了6周的iPhone，然后又回到了安卓系统。\n当我从MSN messenger迁移到google messenger时，我从一开始就使用google messenger，虽然之前迭代之间的大多数转换都是相对无缝的，而且添加了聊天功能，这太糟糕了。\n@facw Sorta，我确实有很多音乐会视频，你可以&#39；t stream。。但是是的，我没有像大多数人那样喜欢流\n@jminer Google杀掉了一切半体面的东西，感觉越来越像他们&#39；你在利用我的数据。你对使用安卓系统的iphone有什么想法？是什么让你回来的？\n@benjrblant最大的一个问题是通知以及如何与它们交互。我喜欢android通知的线性和历史性的工作方式，它允许我在不打开特定应用程序的情况下与它们交互。比如文字上的标记/删除电子邮件，这样我不用打开应用程序，甚至不用解锁手机就可以做到，这很好。我赢了&#39；不要使用三星手机，因为它们也会使管理和使用通知变得困难。\n其他让我退缩的事情是无法正确排列主屏幕图标。想在屏幕底部多用一个，但不要&#39；没有足够的物品钉在屏幕上？没有这样的运气，自上而下-你没有其他选择！\n此外，除了在主屏幕左侧的专用屏幕上，无法将小部件放在其他任何地方（这一个可能会在15分钟内修复）\n@benjrblant Google不是&#39；它不是一家公司&#39；有很多支持应用的团队。每个人都想开发新的热门应用程序，所以旧的应用程序最终会被淘汰并被关闭。\n这太糟糕了，我希望他们&#39；我会改变。我喜欢Google play并取消了订阅，因为Youtube音乐是热门垃圾。\n我一直在买路虎，因为我不&#39；我没有问题，我可以随时退出。", "note_en": "Hangouts was fine. I used hangouts up til the day that you bricked the hangouts app and forced people to use the awful chat client called... chat. there&#39;s so many dead messaging apps, i&#39;m sure it&#39;s only a matter of time before you shuttle everyone over to some new one.\n what happened to don&#39;t be evil? what happened to making good products to improve people&#39;s lives?\n  @benjrblant Google just can&#39;t stop killing chat clients and making new ones (that may or may not be better).\n  @facw i&#39;m just so fed up with it at this point. and the replacement app is terrible.\n  It&#39;s why I broke away from their whole ecosystem. My Onhub router is getting killed off soon, then it&#39;s really just the chromecast left.\n    I&#39;d be willing to consider moving away from Android, but I loathe iOS anytime I have to use it for more than web browsing, so I&#39;m no risk there.\n  @benjrblant it&#39;s almost as if being an tech ogliopoly is bad for the long term economy.\n  @facw   holy crap that&#39;s a lengthy article. i skimmed most of it, and i recall getting excited about the first couple of those when they were announced, but this chart sums it up.\n I used to be such an early adopter of all things tech, but google has turned me into a curmudgeon. beta? no, call me when v 7.8.45.115 is released and then i&#39;ll consider trying it.\n  @benjrblant Yeah, seriously I don&#39;t know how Google expected anyone to pay for something like Stadia given their history. Maybe as a monthly subscription service, or a service that also provided DRM-free or Steam PC copies when you purchased something, but who in their right minds would pay full price to purchase games from a platform that Google was certain to kill as soon as something else shiny came along? It&#39;s not dead yet, but it seems quite close:  “Deprioritized” Google Stadia to pivot to “Google Stream” white-label service.\n And it&#39;s the same with anything from Google. I don&#39;t trust them to keep any service besides Search, ads, Analytics, Gmail, and Sheets. Even Android I wouldn&#39;t be shocked if they end up saying &#34;everyone on Fuchsia now!&#34;\n    @midengine See this is why I bought an HD-DVD/Blu-Ray combo drive! Turns out optical media was dead regardless though.\n    @facw my dad gave me his old iPhone 7 as my first phone and since then, I’ve got a new phone, MacBook and AirPods as well. So yea, they’ve got me. The privacy and the integration is amazing though.\n  @benjrblant It is so hard to keep liking Google! I actually tried an iPhone for 6 weeks earlier last year and went back to Android.\n  I used google messaging since the beginning when I migrated from MSN messenger to it and while annoying most previous transitions between iterations had been relatively seamless and added features hangouts to chat is fucking awful.\n    @facw Sorta, I do have quite a few concert videos you can&#39;t stream.. but yeah I stream like no other like most\n  @jminer Google kills everything half decent and it feels more and more like they&#39;re pimping my data. What were your thoughts on using an iphone coming from android? What drove you back?\n  @benjrblant The biggest one was notifications and how you can interact with them. I like the linear and historic fashion of how android notifications work that allow me to interact with them without ever opening that specific app. Things like the mark as read on a text/delete an email and such I can do without opening an app or even unlocking my phone is great. I won&#39;t use a samsung phone either because they make managing and using notifications difficult too.\n Other things that pushed me back is the inability to properly arrange home screen icons. Want to put one at the bottom of the screen where you use it more but don&#39;t have enough items pinned to fill the screen? No such luck, top down - no other options for you!\n Also the inability to put widgets anywhere other than in a dedicated screen to the left of home (this one may be fixed in 15?)\n    @benjrblant Google isn&#39;t a company, it&#39;s a bunch of fiefdoms of teams supporting apps. Everyone wants to work on the new hotness, so old apps eventually fall to the wayside and get shut down.\n It sucks and I wish that is something they&#39;d change. I loved Google play and cancelled my subscription because Youtube music is hot garbage.\n  I keep buying Land Rovers because I don&#39;t have a problem and I can quit anytime I want.", "posttime": "2022-02-13 20:20:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,迁移,started", "title": "谷歌已经开始强制迁移用户", "title_en": "Google has started force migrating users from Hangouts", "transed": 1, "url": "https://opposite-lock.com/topic/36989/google-i-like-you-less-and-less-by-the-day", "via": "", "real_tags": ["谷歌", "google", "迁移", "started"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "小结：在这篇文章中，我质疑了一些关于睡眠的共识，比如成年人至少需要7小时睡眠，急性睡眠剥夺的危害，长期睡眠剥夺的危害以及我们无法适应它。\n所有这些信念的证据似乎比睡眠科学家和公共卫生专家希望我们相信的要弱得多。特别是，我的结论是，至少在某些情况下，急性睡眠剥夺不仅无害，而且有益，而且我们能够适应长期睡眠剥夺，这是合理的。\n我还讨论了睡眠和躁狂/抑郁的双向关系，以及不必要睡眠的代价，指出每天少睡1.5小时会导致每年超过一个月的清醒。\n注意：如果我不限制自己的睡眠，我会正常睡7-9个小时。然而，像咖啡、莫达非尼和adderall这样的兴奋剂对我的认知能力的影响似乎比我认识的大多数人小得多。我的大脑总体上是不正常的，正如你可能从阅读本网站中猜到的那样。因此，根据我下面列出的论点，在尝试任何与睡眠有关的事情之前都要小心谨慎。具体来说，不要在阅读这篇文章的基础上对你的睡眠计划做出任何剧烈的改变，如果你想尝试睡眠，那就要循序渐进（即每次改变平均睡眠时间不超过30分钟）并小心行事。\n经历饥饿是正常的，并不一定意味着你吃得不够。永远不饿意味着你可能吃得太多了。\n困倦是正常的，并不一定意味着你睡眠不足。从不困倦意味着你可能睡得太多了。\n如果我们不限制自己，我们大多数人（包括我自己）都会吃很多垃圾食品和糖果。这是否意味着大量垃圾食品和糖果是“天然”还是“最佳”的健康量？\n显然，不是。现代垃圾食品和糖果是非自然的超级刺激物，比任何天然食品都要美味、丰富，因此它们最终会让我们的大脑充满愉悦，尤其是考虑到我们在工作、大学或高中一天中的大部分时间都很无聊。\n如果你吃得刚好够瘦，一看到披萨和冰激凌你就会流口水，并一直感到分心和饥饿。重要的是，在这种情况下，饥饿感并不意味着你应该吃得更多——而是你的大脑在无聊时被过度刺激所压倒。\n如果你想吃多少就吃多少，你可能会吃得太多而发胖。如果你一次吃了太多的糖果或披萨，不管食物多么美味，你都会感觉很糟糕。\n如果我们大多数人（包括我自己）早上没有闹钟，如果我们想起床的时候起床，就睡7-9个小时。这是否意味着7-9小时的睡眠是“自然”还是“最佳”量？\n我的论点是：显然不是。现代睡眠，在其无限舒适中，是一种非自然的超级刺激，它以愉悦和舒适压倒我们的大脑（注：我并不是说它不好，只是今天躺在床上比过去躺在“床”上更愉快。）\n想想一万年前的睡眠吧。你睡在山洞里，小屋里，或者天空下，捕食者和敌人部落四处游荡。你在木地板上，在动物的皮肤上，或者在地上。夜间气温可能会下降5-10摄氏度，这意味着如果你在睡觉时感觉舒适，那么醒来时就会冻僵。最后，月亮正对着你，你周围的森林里传来各种各样的声音。\n相比之下，今天：你睡在超级舒适的机器制作的泡沫上，其硬度正好适合你。你在家里是完全安全的，有厚厚的墙和门保护。你房间的温度大致保持不变，确保你整晚都保持温暖舒适。最后，你是在一个光和隔音的环境中你的房子。如果有任何干扰，你可以戴上眼罩和耳塞。\n如果你根本不睡觉，你会发疯，因为一定量的睡眠是必要的。\n如果你白天睡得刚好醒着，你就会梦见一张床就打个盹，而且会一直心烦意乱、昏昏欲睡。重要的是，我认为，在这种情况下，困倦的感觉并不意味着你应该睡得更多——而是你的大脑在无聊时被过度刺激所压倒。\n我认为如果你想睡多少就睡多少，你可能会睡得太多，更容易患抑郁症。如果你一下子睡得太多，不管你睡得多么愉快，你事后都会感觉很糟糕。\n即使我让你相信了“睡得太多”这一部分，你可能仍然在想：但是抑郁症与什么有关系呢？睡眠过多对心理健康不好吗？嗯…\n在本节中，我认为抑郁会触发/放大过度睡眠，而过度睡眠会触发/放大抑郁。类似地，躁狂会触发/放大急性睡眠剥夺，而急性睡眠剥夺会触发/放大躁狂。\n关于睡眠的一个最值得注意的事实是，在双相情感障碍患者中，过度睡眠与抑郁症以及睡眠剥夺与躁狂症之间有多么紧密的联系。\n以下是比较躁狂和抑郁状态时长的8个答案，我排除了描述轻度躁狂但不描述躁狂或仅描述躁狂或抑郁的答案。注意一致性：\n“躁狂，2-3，低能，5-6，稳定的8-9，抑郁的10-12。8是我试图达到的数字。”\n“重度抑郁不伴有混合症状-12至15小时轻度至中度抑郁不伴有混合症状-10小时，如果没有警报。警报较少，但宿醉非常稳定-通常7至9小时躁狂发作，服用镇静晚药-5至7小时躁狂发作，没有镇静晚药-3至5小时躁狂失控-0至3小时医院躁狂发作最长时间。”imum镇静药物或注射-4至6小时混合发作=与hypo（躁狂）相同“\n“我试着至少睡8个小时，但当我情绪低落时，我会打很多盹。当我情绪低落时，我睡得差不多，但当我狂躁时，我很幸运能睡3个小时。呼”\n“刚从一次躁狂发作中恢复过来。有几个通宵，很多是3个小时的夜晚，一个良好的睡眠时间是6个小时。现在我很沮丧，从晚上9点一直睡到中午，醒来后在床上的时间要长得多。”\n“抑郁时每晚睡眠约15小时，躁狂时每晚睡眠0-4小时。”\n睡眠不足是躁狂症的有力诱因，急性睡眠剥夺实际上被用来治疗抑郁症。除了氯胺酮，一夜不睡是我们唯一能迅速（确切地说是一夜不睡）并可靠（在约50%的患者中）改善抑郁症患者情绪的药物（直到他们上床睡觉，除非你继续推进他们的睡眠阶段。Riemann，D.，König，A.，Hohagen，F.，Kiemen，A.，Voderholzer，U.，Backhaus，J.，Bunz，J.，Wesiack，B.，Hermle，L.和Berger，M.，1999.如何保持睡眠剥夺的抗抑郁效果：睡眠阶段提前和睡眠阶段延迟的比较。欧洲档案《精神病学与临床神经科学》，249（5），第231-237页）。注意：如果你患有躁郁症，不要尝试这种方法，你可能会出现躁狂发作。\n图1。抄袭自Wehr TA。通过睡眠剥夺改善抑郁和引发躁狂。杰玛。1992年1月22日；267(4):548-51.\n为什么睡眠不足会导致躁狂，而长时间睡眠会导致抑郁？我不知道。但这里有一些有趣的论文，与这个问题有关：非快速眼动睡眠会导致抑郁吗？比尔斯玛总经理，右范登胡夫达克。非快速眼动睡眠会导致抑郁吗？。情感障碍杂志。1992年2月1日；24(2):101-8. 脑源性神经营养因子（BDNF）与突触生长有关。睡眠剥夺似乎会增加脑源性神经营养因子（因此神经发生？）。当我在谷歌上搜索“睡眠剥夺bdnf”时出现的论文：脑源性神经营养因子：睡眠剥夺、失眠和抑郁症之间缺少联系。脑源性神经营养因子：睡眠剥夺、失眠和抑郁症之间的缺失联系。神经化学研究。2020年2月；45(2):221-31.  睡眠、压力和脑源性神经营养因子之间的联系。埃克特·A、凯伦·S、贝克·J、布兰德·S、亨米特·U、哈辛格·M、霍尔斯伯尔·特雷斯勒·E.睡眠、压力和脑源性神经营养因子之间的联系。欧洲精神病学。2017年4月；41（S1）：S282-。脑源性神经营养因子：失眠的指标？。Giese M，Unternährer E，Hüttig H，Beck J，Brand S，Calabrese P，Holsboer Trachsler E，Eckert A.脑源性神经营养因子：失眠症的指标？。分子精神病学。2014年2月；19(2):151-2.  在治疗性睡眠剥夺后，恢复性睡眠显著降低抑郁症患者的BDNF。小戈德施密德、拉奥·H、丁格斯·D、戈尔·N、德特雷·贾、巴斯纳·M、谢琳·伊、塞斯·梅、盖尔曼出版社0886《恢复睡眠》显著降低治疗性睡眠剥夺后抑郁症患者的BDNF。睡觉2019年4月；42（补编1）：A356-。\n我（总结/简化）的假设基于我所读到的内容：抑郁症涉及僵硬、非灵活的大脑状态，对应于僵硬的抑郁世界模型。抑郁症还包括模型不更新或无法建立新的联系（抑郁症患者的大脑甚至稍微轻一点）。睡眠包括根据白天学习的连接修改/简化世界模型，包括修剪不必要或不相关的突触连接。因此，过度睡眠+抑郁=更少的世界模型更新，更僵硬的大脑，更少的新连接。睡眠剥夺至少可以暂时解决这个问题，方法是确保你保持清醒的时间更长，并不断增加联系，从而补偿由抑郁和“强迫”大脑更新（可能通过神经退火——见QRI文章）导致的联系建设减少。\n在本节中，我将继续进行饮食和睡眠之间的类比，并将其扩展到锻炼。我问：如果禁食和锻炼是好的，那么急性睡眠剥夺难道不是也很好吗？我的结论是，这可能是好的。\n让我们继续把睡眠比作饮食，并在其中加入运动。\n在我看来，反对急性睡眠剥夺的最常见论点同样“证明”了禁食和锻炼是有害的。\n例如，两天前我跑了7公里，但我的腿还是疼得要命，根本跑不动。这是否意味着跑步“不好”？\n大家似乎一致认为，跑步后头晕、肌肉损伤（以及由此产生的疼痛）和体能下降不仅不坏，而且事实上是机体通过增加肌肉质量、肌肉效率和肺活量来训练跑得更快或跑得更远所必需的。\n那禁食呢？当我禁食时，我会更加焦虑，我会经常想到食物，这意味着注意力更难集中，我会感到寒冷。如果我决定禁食太多，我会昏倒然后死去。这是否意味着禁食“不好”？大家似乎一致认为，偶尔禁食实际上会激活某种“好”的压力，促进健康的自噬，（显然）有助于减肥等等，而且实际上是好的。\n现在，如果我一晚睡两个小时而不是七个小时，会发生什么？我觉得双手有些刺痛，我的情绪有点高涨，如果我在下午6点开始和妻子看电影，我就会睡着。这是否意味着每晚睡两个小时对我的健康有害？\n显然不是。我们观察到的唯一一件事是，我的机体受到了严重的压力。然而，对急性压力的反应并不能告诉我们这种压力的长期影响。正如我们所知，无论是跑步还是禁食，短期的急性应激反应都会导致适应，并长期提高表现，有益于机体。\n我梳理了大量的睡眠文献，我还没有看到一项与禁食或锻炼平行的研究，我也没有看到一项预先注册的RCT，它试图观察如果你每周让一个人经历1-3晚的急性睡眠剥夺，并允许他们恢复剩下的夜晚，他们会发生什么。长期来看，他们在认知测试中的表现是更好还是更差？他们有多少炎症？随着时间的推移，他们需要更少的恢复性睡眠吗？\n急性睡眠剥夺加上咖啡因或其他一些可以抵消睡眠压力的兴奋剂，至少在清醒30-40小时之前不会导致认知能力下降（如果这是真的，那么在急性睡眠剥夺期间，睡眠，而不是缺乏睡眠本身，是认知能力下降的原因）。\n随着时间的推移，睡眠确实会变得更有效，完全类似于锻炼，你可以更好地承受急性睡眠剥夺，并且可以在长期睡眠量较低的情况下在基线水平上发挥作用。\n（据我所知，唯一与禁食相似的是纳西姆·塔勒布（Nassim Taleb）在推特上引用他的话。）\n在这一节中，我注意到大多数睡眠研究都非常不可靠，我们不应该在此基础上得出太多结论。\n如果答案是否定的，那么你对我们关于睡眠的知识的先验知识应该是薄弱的，因为“睡眠科学”主要是重新命名的认知心理学，其中绝大多数是小n，而不是预先注册的p-hacked实验。\n我已经找到了一个预先登记的实验，研究长期睡眠剥夺对认知能力的影响。它是由哈佛大学和麻省理工学院的经济学家于2021出版的，其预先登记的分析发现睡眠对所有初级结果的零或负面影响Bessone P、Rao G、席尔巴赫F、Schofield H、Toma M.是城市贫困人口睡眠增加的经济后果。经济学季刊。2021盎司；136(3):1887-941. （请注意，本文的摘要和正文均报告了未经多重假设修正的结果，这与本研究的注册前计划相矛盾。本文在任何地方均未提及这一变化。详情见评论。）。\n那么，为什么睡眠研究没有像心理学一样面临严重的复制危机呢？\n首先，与心理学相比，睡眠研究的速度较慢，成本相对较高，需要专门的设备（如脑电图仪、活动记录仪）。因此，持怀疑态度的局外人倾向于更容易的目标（如社会心理学），而局内人则继续做同样的劣质实验，因为他们需要以某种方式保持自己的职业生涯。\n其次，想象一下，如果睡眠研究人员最终证明睡眠对记忆、健康等不重要——他们会得到任何资助吗？不。他们的工作实际上是基于说服NIH和其他资助者睡眠很重要。正如帕特里克·麦肯齐（Patrick McKenzie）所指出的，“如果你想解决一个问题，那就把它变成别人的项目。如果你想管理它，那就把它变成别人的工作。”\n图2。关于药物和膳食补充剂干预的大型NHLBI试验，按发表年份显示治疗有益或有害的相对风险。复制自卡普兰RM，欧文VL。随着时间的推移，大型NHLBI临床试验无效的可能性增加。公共科学图书馆一号。2015年8月5日；10（8）：e0132382。\n图3。Eric Turner在Twitter上写道：“负性抑郁症试验……现在你看到了，现在你没有了。发表的文献vs FDA，来自[Turner EH，Matthews AM，Linardatos E，Tell RA，Rosenthal R.抗抑郁药试验的选择性发表及其对表观疗效的影响。《新英格兰医学杂志》，2008年1月17日；358（3）：252-60。]&#34;\n即使在医学领域，如果没有预先注册的随机对照试验，也很难获得真实性，超过一半的凯撒J。超过一半的高影响癌症实验室研究无法在有争议的分析中复制。AAAS文章做分组。2021；高影响力的癌症论文未能被复制，一半未预先登记积极结果的随机对照试验被转为Kaplan RM，Irvin VL。随着时间的推移，大型NHLBI临床试验无效的可能性增加。公共科学图书馆一号。2015年8月5日；10（8）：e0132382。被研究人员视为在没有利益的情况下提供利益。这是在医学领域，它比心理学更加重要和严格。\n长期每晚减少1-2小时睡眠对健康没有负面影响\n在本节中，我概述了几条证据，这些证据使我得出结论：长期每晚减少1-2小时睡眠不会对健康产生负面影响。总结一下：\n一位睡眠研究人员训练水手高效睡眠，以最大限度地提高他们的比赛成绩，他认为4.5-5.5小时的睡眠是可以的。\n2013年，84名狩猎采集者中有70%的人每天睡眠不足7小时，46%的人每天睡眠不足6小时。\n单点突变可以将所需睡眠时间减少2小时，且不会产生负面副作用。\n脑部手术可以减少3小时所需的睡眠时间，而且没有任何副作用。\n克劳迪奥·斯坦皮是马萨诸塞州牛顿市的睡眠研究员。但他不是你的普通睡眠研究者，他的职业生涯建立在观察性研究或p-hacked n=20实验之上，这些实验总是显示出“显著”的结果。他是唯一一位在比赛中有皮肤的睡眠研究者：他的研究目标是通过调整水手的睡眠周期来最大限度地提高他们的表现，他认为4.5-5.5小时的睡眠是可以的，文章使用了“过得去”这个短语，并没有说表现没有下降。然而，它确实指出，在大量小睡的情况下，3小时睡眠时的表现下降是12-25%，因此由此增加50-83%的睡眠，似乎不太可能导致任何表现下降，与8小时的睡眠相比(“他让他们改用三小时的常规。一个多月后，单相组的认知能力下降了30%。将睡眠分为夜间和短时间小睡的组的认知能力下降了25%。但只在短时间小睡的多相组只下降了12%。&#34；）。只要因为它被分解为核心睡眠和一系列短暂（通常为20分钟）的小睡。外面是：\n“单人帆船是全天候活动的最佳模式之一，需要大脑和肌肉，”斯坦皮有一天在自己的家中说，他是该研究所的负责人。“如果你睡得太多，你就不会赢。如果你睡得不够，你就会崩溃。”…\n37岁的加利福尼亚州人布拉德·范列（Brad Van Liew）说：“对于那些认真参加比赛的水手来说，Stampi是必不可少的。”他于1998年开始与Stampi合作，后来成为美国最有成就的单人赛选手，并在2002-2003年的环球单人赛（Around Only）中获胜。“你必须有效率地睡觉，否则就好像一副糟糕的帆或船底没有准备好。”…\n戈尔丁和麦克阿瑟在比赛时的睡眠时间大致相同，平均每24小时睡眠4.5到5.5小时，斯塔姆皮认为，这是人类能够度过的最低睡眠时间。\n2013年，科学家对来自3个不同部落的84名狩猎采集者的睡眠进行了跟踪，他们分别来自叶提什G、卡普兰H、古尔文M、伍德B、庞泽H、马格尔PR、威尔逊C、麦格雷戈R、西格尔JM。三个前工业化社会的自然睡眠及其季节变化。当代生物学。2015年11月2日；25(21):2862-8. （每个人的睡眠被测量了大约一周，但在一年的不同时间对不同群体进行了测量）。这84人的平均睡眠时间为6.5小时。根据疾控中心的“7小时或更长”建议，\n......", "note_en": "Summary: In this essay, I question some of the consensus beliefs about sleep, such as the need for at least 7 hours of sleep for adults, harmfulness of acute sleep deprivation, and harmfulness of long-term sleep deprivation and our inability to adapt to it.\n It appears that the evidence for all of these beliefs is much weaker than sleep scientists and public health experts want us to believe. In particular, I conclude that it’s plausible that at least acute sleep deprivation is not only not harmful but beneficial in some contexts and that it’s that we are able to adapt to long-term sleep deprivation.\n I also discuss the bidirectional relationship of sleep and mania/depression and the costs of unnecessary sleep, noting that sleeping 1.5 hours per day less results in gaining more than a month of wakefulness per year, every year.\n  Note: I sleep the normal 7-9 hours if I don’t restrict my sleep. However, stimulants like coffee, modafinil, and adderall seem to have much smaller effect on my cognition than on cognition of most people I know. My brain in general, as you might guess from reading  this site, is not very normal. So, be cautious before trying anything with your sleep on the basis of the arguments I lay out below. Specifically  do not make any drastic changes to your sleep schedule on the basis of reading this essay and, if you want to experiment with sleep, do it gradually (i.e. varying the average amount of sleep by no more than 30 minutes at a time) and carefully.\n   Experiencing hunger is normal and does not necessarily imply that you are not eating enough. Never being hungry means you are probably eating too much.\n Experiencing sleepiness is normal and does not necessarily imply that you are undersleeping. Never being sleepy means you are probably sleeping too much.\n  Most of us (myself included) eat a lot of junk food and candy if we don’t restrict ourselves. Does this mean that lots of junk food and candy is the “natural” or the “optimal” amount for health?\n Obviously, no. Modern junk food and candy are unnatural superstimuli, much tastier and much more abundant than any natural food, so they end up overwhelming our brains with pleasure, especially given that we are bored at work, college, or in high school so much of the day.\n  If you eat just enough to be lean, you’ll keep salivating at the sight of pizzas and ice cream and feel distracted and hungry all the time. Importantly, in this situation, the feeling of hunger does not mean that you should eat more – it’s your brain being overpowered by a superstimulus while being bored.\n If you eat it as much as you want, you’ll probably eat too much and become fat. And if you eat way too much candy or pizza at once, you’ll be feeling terrible afterwards, however tasty the food was.\n Most of us (myself included) sleep 7-9 hours if we don’t have any alarms in the morning and if we get out of bed when we feel like it. Does this mean that 7-9 hours of sleep is the “natural” or the “optimal” amount?\n My thesis is: obviously, no. Modern sleep, in its infinite comfort, is an unnatural superstimulus that overwhelms our brains with pleasure and comfort (note: I’m not saying that it’s bad, simply that being in bed today is much more pleasurable than being in “bed” in the past.)\n Think about sleep 10,000 years ago. You sleep in a cave, in a hut, or under the sky, with predators and enemy tribes roaming around. You are on a wooden floor, on an animal’s skin, or on the ground. The temperature will probably drop 5-10°C overnight, meaning that if you were comfortable when you were falling asleep, you are going to be freezing when you wake up. Finally, there’s moon shining right at you and all kinds of sounds coming from the forest around you.\n In contrast, today: you sleep on your super-comfortable machine-crafted foam of the exact right firmness for you. You are completely safe in your home, protected by thick walls and doors. Your room’s temperature stays roughly constant, ensuring that you stay warm and comfy throughout the night. Finally, you are in a light and sound-insulated environment of your house. And if there’s any kind of disturbance you have eye masks and earplugs.\n   If you don’t sleep at all, you go crazy, because some amount of sleep is necessary.\n If you sleep just enough to be awake during the day, you’ll be dreaming of getting a nap at the sight of a bed and will be distracted and sleepy all the time. Importantly, I claim, in this situation, the feeling of sleepiness does not mean that you should sleep more – it’s your brain being overpowered by a superstimulus while being bored.\n I claim that if you sleep as much as you want, you’ll probably sleep too much and become more susceptible to depression. And if you sleep way too much at once, you’ll be feeling terrible afterwards, however pleasant the sleep was.\n Even if I convinced you about the “sleeping too much” part, you are still probably wondering: but what does depression have to do with anything? Isn’t sleeping a lot good for mental health? Well…\n  In this section, I argue that depression triggers/amplifies oversleeping while oversleeping triggers/amplifies depression. Similarly, mania triggers/amplifies acute sleep deprivation while acute sleep deprivation triggers/amplifies mania.\n  One of the most notable facts about sleep is just how interlinked excessive sleep is with depression and how interlinked sleep deprivation is with mania in bipolar people.\n  Here are all 8 answers that compare hours for manic and depressed states,   I excluded answers that describe hypomania but do not describe mania or that only describe mania or only describe depression. note the consistency:\n “Manic, 2-3, hypo, 5-6, stable 8-9, depressed 10-12. 8 is the number I try to hit.”\n “Severely depressed w/o mixed features - 12 to 15 hours Low to Moderate depressed w/o mixed - 10 hours, if no alarm. With alarm less, but super hangover Stable -Usually 7-9 hours Hypomanic taking sedating evening meds - 5 to 7 hours Hypomanic with no sedating evening meds - 3 to 5 hours Manic out of hand - 0 to 3 hours Manic in hospital put on maximum sedating meds or injections - 4 to 6 hours Mixed episodes = same as hypo(manic)”\n “I try to get at least 8 hours but when I’m depressed I nap a lot. When I’m hypo I sleep pretty much the same but when I’m manic I’m lucky to get 3 hours. Huhs”\n “Just got out of a manic episode. A few all-nighters, a lot of 3 hour nights, and a good night of sleep was 6 hours. Now I’m depressed and I’ve been sleeping from 9pm to noon and staying in bed for much longer after I’m awake.”\n  “Around 15 hours of sleep per night while depressed, and between 0-4 hours per night while manic.”\n Lack of sleep is such a potent trigger for mania that   acute sleep deprivation is literally used to treat depression. Aside from ketamine, not sleeping for a night is the only medicine we have to quickly – literally overnight – and reliably (in ~50% of patients) improve mood in depressed patients (until they go to bed, unless you  keep advancing their sleep phase    Riemann, D., König, A., Hohagen, F., Kiemen, A., Voderholzer, U., Backhaus, J., Bunz, J., Wesiack, B., Hermle, L. and Berger, M., 1999. How to preserve the antidepressive effect of sleep deprivation: A comparison of sleep phase advance and sleep phase delay. European archives of psychiatry and clinical neuroscience, 249(5), pp.231-237. ). NOTE: DO NOT TRY THIS IF YOU ARE BIPOLAR, YOU MIGHT GET A MANIC EPISODE.\n Figure 1. Copied from Wehr TA. Improvement of depression and triggering of mania by sleep deprivation. JAMA. 1992 Jan 22;267(4):548-51.\n  Why does the lack of sleep promote manic states while long sleep promotes depression? I don’t know. But here are a couple of pointers to interesting papers relevant to the question:  Can non-REM sleep be depressogenic?    Beersma DG, Van den Hoofdakker RH. Can non-REM sleep be depressogenic?. Journal of affective disorders. 1992 Feb 1;24(2):101-8. Brain-derived neurotrophic factor (BDNF) is associated with synapse growth. Sleep deprivation appears to increase BDNF [and therefore neurogenesis?]. Papers that showed up when I googled “sleep deprivation bdnf”:  The Brain-Derived Neurotrophic Factor: Missing Link Between Sleep Deprivation, Insomnia, and Depression.    Rahmani M, Rahmani F, Rezaei N. The brain-derived neurotrophic factor: missing link between sleep deprivation, insomnia, and depression. Neurochemical research. 2020 Feb;45(2):221-31.  The link between sleep, stress and BDNF.    Eckert A, Karen S, Beck J, Brand S, Hemmeter U, Hatzinger M, Holsboer-Trachsler E. The link between sleep, stress and BDNF. European Psychiatry. 2017 Apr;41(S1):S282-.  BDNF: an indicator of insomnia?.    Giese M, Unternährer E, Hüttig H, Beck J, Brand S, Calabrese P, Holsboer-Trachsler E, Eckert A. BDNF: an indicator of insomnia?. Molecular psychiatry. 2014 Feb;19(2):151-2.  Recovery Sleep Significantly Decreases BDNF In Major Depression Following Therapeutic Sleep Deprivation.    Goldschmied JR, Rao H, Dinges D, Goel N, Detre JA, Basner M, Sheline YI, Thase ME, Gehrman PR. 0886 Recovery Sleep Significantly Decreases BDNF In Major Depression Following Therapeutic Sleep Deprivation. Sleep. 2019 Apr;42(Supplement_1):A356-.\n  My (summarized/simplified) hypothesis based on what I’ve read: depression involves rigid, non-flexible brain states that correspond to rigid depressive world models. Depression also involves a non-updating of models or inability to draw new connections (brain is even literally slightly lighter in depressed patients). Sleep involves revising/simplifying world models based on connections learned during the day, involves pruning unneeded or irrelevant synaptic connections. Thus, excessive sleep + depression = even less world model updating, even more rigid brain, even fewer new connections. Sleep deprivation can resolve this problem at least temporarily by ensuring that you stay awake for longer and keep adding connections, thus compensating for the decreased connection-building caused by depression and “forcing” a brain update (perhaps through neural annealing - see QRI article).\n  In this section, I continue the analogy between eating and sleeping and extend it to exercise. I ask: if fasting and exercising are good, shouldn’t acute sleep deprivation also be good? And I conclude that it  is probably good.\n  Let’s continue our analogy of sleep to eating and add exercise to the mix.\n It seems to me that most common arguments against acute sleep deprivation equally “demonstrate” that fasting and exercise are bad.\n For example, I ran 7 kilometers 2 days ago and my legs still hurt like hell and I can’t run at all. Does this mean that running is “bad”?\n Well, consensus seems to be that dizziness, muscle damage (and thus pain) and decreased physical performance after the run, are not just not bad, but are in fact necessary for the organism to train to run faster or to run longer distances by increasing muscle mass, muscle efficiency, and lung capacity.\n What about fasting? When I fast, I am more anxious, I think about food a lot, meaning that focus is more difficult, and I feel cold. And if I decided to fast too much, I would pass out and then die. Does this mean that fasting is “bad”? Well, consensus seems to be that occasional fasting actually activates some “good” kind of stress, promotes healthy autophagy, (obviously) helps to lose weight, etc. and is in fact  good.\n Now, what happens when I sleep for 2 hours instead of 7 one night? I feel somewhat tingly in my hands, my mood is heightened a little bit, and, if I start watching a movie with my wife at 6pm, I’ll fall asleep. Does this mean that sleeping 2 hours one night is bad for my health?\n Obviously no.  The only thing we observe is that my organism was subjected to acute stress. However, the reaction to acute stress does not tell us anything about the long-term effects of this kind of stress. As we know, both in running and in fasting, short-term acute stress response results in adaptation and in long-term increase in performance and in benefit to the organism.\n I combed through  a lot of sleep literature and I haven’t seen a single study that made a parallel to either fasting or exercise and I haven’t seen a single pre-registered RCT that tried to see what happens to someone if you subject them to 1-3 nights per week of acute sleep deprivation and allow to recover the rest of the nights. Do they perform better or worse in the long-term on cognitive tests? Do they have more or less inflammation? Do they need less recovery sleep over time?\n  Acute sleep deprivation combined with caffeine or some other stimulant that cancels out sleep pressure does not result in decreased cognitive ability at least until 30-40 hours of wakefulness (if this is true, then  sleepiness, rather  absence of sleep per se is responsible for decreased cognitive performance during acute sleep deprivation).\n  Sleep  does become more efficient over time and, in complete analogy to exercise, you withstand both acute sleep deprivation better and can function at baseline with a lower amount of sleep in the long-term.\n (The only parallel to fasting I’m aware of anyone making is by Nassim Taleb… when he was  quote-tweeting me.)\n     In this section, I note that most sleep research is extremely unreliable and we shouldn’t conclude much on the basis of it.\n   If the answer is no, then your priors for our knowledge about sleep should be weak because “sleep science” is mostly just rebranded cognitive psychology, with the vast majority of it being small-n, not pre-registered, p-hacked experiments.\n I have been able to find exactly  one pre-registered experiment of the impact of prolonged sleep deprivation on cognition. It was published by  economists from Harvard and MIT in 2021 and its pre-registered analysis found  null or negative effects of sleep on all primary outcomes    Bessone P, Rao G, Schilbach F, Schofield H, Toma M. The economic consequences of increasing sleep among the urban poor. The Quarterly Journal of Economics. 2021 Aug;136(3):1887-941. (note that both the abstract and the main body of this paper report results without the multiple-hypothesis correction, in contradiction to the pre-registration plan of the study. The paper does not mention this change anywhere.    See  comments for the details.  ).\n So why has sleep research not been facing a severe replication crisis, similar to psychology?\n First, compared to psychology, where you just have people fill out questionnaires, sleep research is slow, relatively expensive, and requires specialized equipment (e.g. EEG, actigraphs). So skeptical outsiders go for easier targets (like social psychology) while the insiders keep doing the same shoddy experiments because they need to keep their careers going  somehow.\n Second, imagine if sleep researchers had conclusively shown that sleep is not important for memory, health, etc. – would they get any funding? No. Their jobs are literally predicated on convincing the NIH and other grantmakers that sleep is important. As Patrick McKenzie  notes, “If you want a problem solved make it someone’s project. If you want it managed make it someone’s job.”\n Figure 2. Relative risk of showing benefit or harm of treatment by year of publication for large NHLBI trials on pharmaceutical and dietary supplement interventions. Copied from Kaplan RM, Irvin VL. Likelihood of null effects of large NHLBI clinical trials has increased over time. PloS one. 2015 Aug 5;10(8):e0132382.\n Figure 3. Eric Turner on Twitter: “Negative depression trials…Now you see ‘em, now you don’t. Published literature vs FDA, from [ Turner EH, Matthews AM, Linardatos E, Tell RA, Rosenthal R. Selective publication of antidepressant trials and its influence on apparent efficacy. New England Journal of Medicine. 2008 Jan 17;358(3):252-60.]&#34;\n  Even in medicine, without pre-registered RCTs truth is extremely difficult to come by, with  more than one half    Kaiser J. More than half of high-impact cancer lab studies could not be replicated in controversial analysis. AAAS Articles DO Group. 2021; of high-impact cancer papers failing to be replicated, and with one half of RCTs without pre-registration of positive outcomes  being spun    Kaplan RM, Irvin VL. Likelihood of null effects of large NHLBI clinical trials has increased over time. PloS one. 2015 Aug 5;10(8):e0132382. by researchers as providing benefit when there’s none. And this is in  medicine, which is infinitely more consequential and rigorous than psychology.\n     Decreasing sleep by 1-2 hours a night in the long-term has no negative health effects\n In this section, I outline several lines of evidence that bring me to the conclusion that decreasing sleep by 1-2 hours a night in the long-term has no negative health effects. To summarize:\n A sleep researcher who trains sailors to sleep efficiently in order to maximize their race performance believes that 4.5-5.5 hours of sleep is fine.\n 70% of 84 hunter-gatherers studied in 2013 slept less than 7 hours per day, with 46% sleeping less than 6 hours.\n A single-point mutation can decrease the amount of required sleep by 2 hours, with no negative side-effects.\n A brain surgery can decrease the amount of sleep required by 3 hours, with no negative-side effects.\n  Claudio Stampi is a Newton, Massachusetts based sleep researcher. But he is not your normal sleep researcher whose career is built on observational studies or p-hacked n=20 experiments that always show “significant” results. He is one of the only sleep researchers with skin in the game: the goal of his research is to maximize performance of sailors by tinkering with their sleep cycles, and he believes that 4.5-5.5 hours of sleep is fine,    The article uses the phrase “get by” and does not state that there’s no decrease in performance. However, it does state that the decrease in performance at 3 hours of sleep with lots of naps is 12-25%, so increasing sleep by 50-83% from this, seems unlikely to result in any decrease in performance, compared to 8 hours of sleep (“he had them shift to their three-hour routines. After more than a month, the monophasic group showed a 30 percent loss in cognitive performance. The group that divided its sleep between nighttime and short naps showed a 25 percent drop. But the polyphasic group, which slept exclusively in short naps, showed only a 12 percent drop.&#34;). as long as it’s broken down into core sleep and a series of short (usually 20-minute) naps. Here’s   Outside:\n “Solo sailing is one of the best models of 24/7 activity, and brains and muscles are required,” Stampi said one day at his home, from which he runs the institute. “If you sleep too much, you don’t win. If you don’t sleep enough, you break.” …\n “For those sailors who are seriously competing, Stampi is a necessity,” says Brad Van Liew, a 37-year-old Californian who began working with Stampi in 1998 and went on to become America’s most accomplished solo racer and the winner in his class of the 2002-2003 Around Alone, a 28,000-mile global solo race. “You have to sleep efficiently, or it’s like having a bad set of sails or a boat bottom that isn’t prepared properly.” …\n both Golding and MacArthur sleep about the same amount while racing, between 4.5 and 5.5 hours on average in every 24—the minimum amount, Stampi believes, on which humans can get by.\n In 2013, scientists  tracked the sleep of 84 hunter-gatherers from 3 different tribes    Yetish G, Kaplan H, Gurven M, Wood B, Pontzer H, Manger PR, Wilson C, McGregor R, Siegel JM. Natural sleep and its seasonal variations in three pre-industrial societies. Current Biology. 2015 Nov 2;25(21):2862-8. (each person’s sleep was measured for about a week but measurements for different groups were taken in different parts of the year).  The average amount of sleep among these 84 people was 6.5 hours. Judging by CDC’s “7 hours or more”  recommendation,    \n......", "posttime": "2022-02-13 20:09:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,睡眠,theses", "title": "关于睡眠的论文", "title_en": "Theses on Sleep", "transed": 1, "url": "https://guzey.com/theses-on-sleep/", "via": "", "real_tags": ["论文", "睡眠", "theses"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到您请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2022-02-13 20:09:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "脂肪组织,tissue,请求", "title": "健康和疾病中的脂肪组织可塑性", "title_en": "Adipose-tissue plasticity in health and disease", "transed": 1, "url": "https://www.cell.com/cell/fulltext/S0092-8674(21)01454-9", "via": "", "real_tags": ["脂肪组织", "tissue", "请求"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "北极驯鹿可以看到&#34；可见&#34；根据一个国际团队的最新研究，紫外线区域的光谱。\n他们说，对驯鹿的测试表明，与人类不同，驯鹿对紫外线刺激有反应。\n这种能力可能使它们能够在&#34；紫外线含量高&#34；北极大气，并在低光下保持可见度。\n紫外线对人类是看不见的。它的波长比&#34短（且能量更大）；可见&#34；波长从400纳米到10纳米不等的光。\n研究人员首先确定，紫外线能够通过解剖样本发出的光，穿透驯鹿眼睛的晶状体和角膜。测试表明，波长约为350纳米的光线进入眼睛。\n然后他们试图证明这些动物可以&#34；见&#34；通过测试麻醉驯鹿的视网膜对紫外线的电反应，可以获得光。\n&#34;我们使用了所谓的ERG（视网膜电图），通过在眼睑内侧放置一小块金箔来记录视网膜对光的电反应；合著者、伦敦大学学院的格伦·杰弗里教授告诉BBC新闻。\n测试显示感光细胞或#34；锥体和#34；视网膜对紫外线有反应。\n&#34;如果你&#39；你是一只大黄蜂，你不会&#39；我不认为这只动物在做什么，因为它&#39；他看到了什么&#39；它叫&#39；近紫外线&#39；（大约320到400纳米），但那&#39；这仍然是非常高能量的东西&#34;\n研究人员认为，紫外线视觉可以使驯鹿在&#34；白化&#34；北极的冬天和春秋的黄昏。\n他们说，驯鹿吃的地衣对驯鹿的眼睛来说是黑色的，因为它吸收紫外线。动物&#39；因为狼的皮毛吸收紫外线，所以它的传统捕食者狼在雪地上也会显得更黑。\n雪地里的尿液在紫外线视觉下也会更清晰，这可能会提醒驯鹿注意捕食者或其他驯鹿的气味。\n研究人员说，这只动物似乎也没有因为在紫外线下看东西而受到任何伤害，也没有遭受&#34；雪盲症#34；人类可以在紫外线丰富的北极环境中体验。\n伦敦玛丽女王大学的拉尔斯·奇特卡教授研究了蜜蜂的紫外线能力，他说这项研究显示了我们称之为&#34；可见&#34；这一光谱并不适用于动物王国的大部分地区。\n&#34;它&#39；进一步的证据表明，动物对紫外线的敏感性是规律而非例外，人类和其他一些哺乳动物实际上是少数不具有紫外线敏感性的动物，&#34；他说。\n奇特卡教授对紫外线似乎对驯鹿的视网膜没有损害并不感到惊讶。他说，测试表明眼睛只能接受较低频率的紫外线（&#34；UV-A光&#34；）而不是更具破坏性的高频光（&#34；UV-B&#34；）。\n还需要进一步的建模和行为测试来验证驯鹿&#39；s探测紫外线的明显能力确实导致&#34；更好地检测捕食者和北极地衣#34；，他说。\n进行驯鹿测试的同一个研究团队将很快在海豹身上重复同样的实验，看看它们是否能看到紫外线区域。杰弗里教授认为，许多北极动物可能都有这种能力。\n&#34;那里&#39；没有证据表明北极狐或北极熊患有雪盲症，所以我敢打赌，那里的大多数北极动物都能看到紫外线&#34;", "note_en": "Arctic reindeer can see beyond the &#34;visible&#34; light spectrum into the ultra-violet region, according to new research by an international team.\n They say tests on reindeer showed that the animal does respond to UV stimuli, unlike humans.\n The ability might enable them to pick out food and predators in the &#34;UV-rich&#34; Arctic atmosphere, and to retain visibility in low light.\n   UV light is invisible to humans. It has a wavelength which is shorter (and more energised) than &#34;visible&#34; light, ranging from 400 nanometres down to 10nm in wavelength.\n The researchers first established that UV light was able to pass through the lens and cornea of the reindeer eye by firing light through a dissected sample. The tests showed that light down to a wavelength of about 350nm passed into the eye.\n  They then sought to prove that the animals could &#34;see&#34; the light, by testing the electrical response of the retina of anaesthetised reindeer to UV light.\n &#34;We used what is called an ERG (electroretinography), whereby we record the electrical response to light by the retina by putting a little piece of gold foil on the inside of the eyelid,&#34; co-author Professor Glen Jeffery of University College London told BBC News.\n The tests showed that photoreceptor cells or &#34;cones&#34; in the retina did respond to UV light.\n &#34;If you&#39;re a bumblebee, you wouldn&#39;t think much of what this animal is doing because it&#39;s seeing in what&#39;s called &#39;near UV&#39; (about 320 to 400nm), but that&#39;s still very high energy stuff.&#34;\n  The researchers believe UV vision could enable the reindeer to distinguish food and predators in the &#34;white-out&#34; of the Arctic winter and the twilight of spring and autumn.\n Lichen, on which the animal feeds, would appear black to reindeer eyes, they say, because it absorbs UV light. The animal&#39;s traditional predator, wolves, would also appear darker against the snow, as their fur absorbs UV light.\n  Urine in the snow would also be more discernable in UV vision, which might alert reindeer to the scent of predators or other reindeer.\n Neither did the animal appear to suffer any damage as a result of seeing in UV, say the researchers, or suffer the &#34;snow blindness&#34; humans can experience in the UV-rich Arctic environment.\n  Professor Lars Chittka of Queen Mary University London, who has explored the UV capabilities of bees, said the study showed what we call the &#34;visible&#34; spectrum did not apply to most of the animal kingdom.\n &#34;It&#39;s further evidence that UV sensitivity across animals is the rule rather than the exception, and that humans and some other mammals are actually a minority in not having UV sensitivity,&#34; he said.\n Professor Chittka was not surprised the UV light appeared to do no damage to the reindeer retina. He said the tests suggested the eye would only admit lower-frequency UV light (&#34;UV-A light&#34;) rather than more damaging higher-frequency light (&#34;UV-B&#34;).\n Further modelling and behavioural tests would also be needed to verify that reindeer&#39;s apparent capacity to detect UV light really did result in &#34;better detection of predators and arctic lichens&#34;, he said.\n  The same research team which conducted the reindeer tests will soon repeat the same experiments on seals to see whether they can see into the UV region. Professor Jeffery believes many Arctic animals are likely to have the capacity.\n &#34;There&#39;s no evidence that Arctic foxes or polar bears suffer from snow blindness, so I bet you that most of the Arctic animals up there are seeing into UV.&#34;", "posttime": "2022-02-13 20:05:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "显示,show,紫外线", "title": "测试显示北极驯鹿“在紫外线下看”", "title_en": "Tests show Arctic reindeer 'see in UV'", "transed": 1, "url": "https://www.bbc.com/news/science-environment-13529152", "via": "", "real_tags": ["显示", "show", "紫外线"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072945, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卡尔·富兰克林是App vNext的执行副总裁，这是一家专注于最新方法和技术的软件开发公司。卡尔在软件行业有20多年的经验，\n由于他在手势识别方面的工作，他获得了Kinect的MVP。即KinectTools和GesturePak。\n卡尔也是Music to Code By的创始人，这是一套25分钟长的器乐作品，旨在让你进入一种流动状态，让你保持在那里。编码音乐受到了广泛的赞誉\n卡尔一直是这个行业的领导者。NET社区，以及在此之前的Visual Basic（VB）社区。在早期，他为VisualBasic程序员杂志撰写了《Q&amp；那本杂志的一个专栏以及许多特写\n在他开始之前。网石！2002年（在“播客”这个词流行的三年前），他为VB开发并教授实践训练课程。NET和ASP。NET通过他的培训公司Franklins。网\n卡尔定期在世界各地的会议上发言，如DevIntersection、NDC、NDC London、，\n除了在开发领域的工作外，卡尔还在音乐行业担任作曲家、录音工程师、制作人、多乐器演奏家和歌手。他和他的乐队富兰克林兄弟\n理查德·坎贝尔在1977年10岁时开始玩微型计算机。他&#39；从那以后，他真的再也没做过别的事。那时候他&#39；从制造到销售，再到开发，再到大规模基础设施的实施，我们都参与了PC行业的各个层面。他见证并参与了比尔·盖茨的&#34；每个桌面上都有一台电脑&#34;\n多年来，他&#39；s曾为许多国家的公司担任顾问，包括巴恩斯公司；高尚的com、陶氏化学、强生公司；Johnson Health Care Services、路透社、Subaru/Isuzu和美国空军，就架构、扩展系统和指导开发团队提供建议。他在大型系统方面的长期工作经验，使他在互联网繁荣的halycon年间成为一名受欢迎的顾问。他与提供建筑指导和尽职调查的风险投资和私募股权公司密切合作。\n他是微软的区域总监，被公认为微软在ASP领域最有价值的专业人士（MVP）。网络开发。\n2004年，理查德第一次见到了卡尔·富兰克林。NetRocks（www.dotnetrocks.com），这是一个针对互联网的音频谈话节目。NET开发者。理查德是69号节目的嘉宾，但他与卡尔的友谊很快演变成了合作关系，2005年初，在100号节目中，他作为联合主持人加入了节目。2007年，他创办了RunAs Radio（www.runasradio.com），这是一个面向IT专业人士的播客。\n他是Strangeloop Networks的联合创始人，该公司于2013年被Radware收购，并在2014年被Progress Software收购的Telerik董事会任职五年。\n2012年，理查德创建了人道主义工具箱（www.htbox.org），该组织旨在让世界各地的开发人员通过构建开源软件，将他们的技能捐赠给救灾组织。到2014年，人道主义工具箱成为了一家501（c）3注册的美国慈善机构，为联合国、美国疾病控制中心和红十字会开展了多个不同的项目。\n如今，Richard是多家成功技术公司的顾问和顾问，也是DevIntersection（www.DevIntersection.com）会议组的共同所有者和内容规划师。", "note_en": "Carl Franklin is Executive Vice President of  App vNext, a software development firm focused on the latest methodologies and technologies. Carl is a 20+ year veteran of the software industry,\r co-host and founder of  .NET Rocks!, the first and most widely listened to podcast for .NET developers, a  Microsoft MVP for\r  Kinect for Windows, a Microsoft  Regional Director, and Senior Executive of  Pwop Studios,\r a full-service audio and video production/post production studio located in Southeastern Connecticut.\n  He was awarded the MVP for Kinect because of his work on gesture recognition. Namely,  KinectTools and  GesturePak.\r KinectTools is an abstraction over the Kinect 2.0 SDK that takes the detail work out of using the Kinect in a Windows application. GesturePak lets you record, edit, and recognize gestures in a Windows application. Both are free open source products.\n  Carl is also the creator of  Music to Code By, a set of 25-minute long instrumental music pieces designed to get you into a state of flow and keep you there. Music to Code By has been praised widely by\r developers for keeping them focused and helping them solve difficult problems.\n  Carl has been a leader in the .NET community since 2002, and in the Visual Basic (VB) community before that. In the very early days he wrote for Visual Basic Programmer’s Journal, authoring the Q&amp;A column of that magazine as well as many feature\r articles for VBPJ and other magazines. He has authored two books for John Wiley &amp; Sons on sockets programming in VB, and in 1994 he helped create the very first web site for VB developers, Carl &amp; Gary&#39;s VB Home Page.\n  Before he started .NET Rocks! in 2002 (three years before the word ‘podcast’ became popular) he developed and taught hands-on training classes for VB.NET and ASP.NET via his training company, Franklins.Net.\n  Carl has spoken regularly at conferences around the world, such as  DevIntersection,  NDC,  NDC London,\r  OreDev, Microsoft TechEd, Microsoft TechEd Europe,  DevTeach,  DevReach, and others.\n  In addition to his work in the development field, Carl works in the music business as a composer, recording engineer, producer, multi-instrumentalist, and vocalist. With his band, the  Franklin Brothers, he\r has produced two albums,  Lifeboat to Nowhere and  Been a While.\r Both albums get nothing but five star reviews. Noted guitar virtuoso  John Scofield has collaborated with Carl on two songs,  Chain Reaction\r and  Groove or Get Out of the Way.\n  Richard Campbell started playing with microcomputers in 1977 at the age of 10. He&#39;s really never done anything else since. In that time he&#39;s been involved in every level of the PC industry, from manufacturing, to sales, to development, and into large scale infrastructure implementation. He has been a witness and participant to the Bill Gates vision of &#34;A PC on every desktop.&#34;\n  For years he&#39;s served as a consultant to companies in many countries, including Barnes&amp;Noble.com, Dow Chemical, Johnson &amp; Johnson Health Care Services, Reuters, Subaru/Isuzu and the U.S. Air Force, providing advice on architecture, scaling systems and mentoring development teams. His long experience in working with large scale systems made him a sought-after consultant during the halycon years of the DotCom boom. He worked closely with venture capital and private equity firms providing architectural guidance and due diligence.\n  He is a Microsoft Regional Director and is recognized as a Microsoft Most Valuable Professional (MVP) in the area of ASP.NET development.\n  In 2004 Richard first met Carl Franklin, creator of .NET Rocks ( www.dotnetrocks.com), The Internet Audio Talkshow for .NET Developers. Richard was a guest on show 69, but his friendship with Carl quickly evolved into a partnership and by show 100 in early 2005 he came onboard as co-host. In 2007 he started RunAs Radio ( www.runasradio.com), a podcast for IT Professionals.\n  He is a co-founder of Strangeloop Networks, which was acquired by Radware in 2013 and spent five years on the board of directors of Telerik which was acquired by Progress Software in 2014.\n  In 2012 Richard founded the Humanitarian Toolbox ( www.htbox.org), an organization designed to let developers around the world donate their skills to disaster relief organizations by building open source software. By 2014, Humanitarian Toolbox became a 501(c)3 registered US charity, working on a number of different projects for the United Nations, US Center for Disease Control and Red Cross.\n  Today Richard is a consultant and advisor to a number of successful technology firms as well as the co-owner and content planner of the DevIntersection ( www.devintersection.com) group of conferences.", "posttime": "2022-02-13 20:02:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c#,斯伯格,years", "title": "与安德斯·海尔斯伯格共事20年[音频]", "title_en": "Twenty years of C# with Anders Hejlsberg [audio]", "transed": 1, "url": "https://www.dotnetrocks.com/?show=1780", "via": "", "real_tags": ["c#", "斯伯格", "years"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亿万富翁、技术专家和投资者彼得·泰尔（Peter Thiel）与埃里克·韦恩斯坦（Eric Weinstein）一起在演播室推出“门户”：一个新的播客和视频频道。。。", "note_en": "Billionaire Technologist and Investor Peter Thiel is the guest as he joins Eric Weinstein in the studio to Launch \"The Portal\": a new podcast and video chann...", "posttime": "2022-02-13 20:02:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失败,weinstein,peter", "title": "泰尔和韦恩斯坦：一个停滞和普遍制度失败的时代", "title_en": "Thiel and Weinstein: An Era of Stagnation and Universal Institutional Failure", "transed": 1, "url": "https://www.youtube.com/watch?v=nM9f0W2KD5s", "via": "", "real_tags": ["失败", "weinstein", "peter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国proptech初创公司Showhere的创始人乔伊·纳扎里（Joy Nazzari）正在拼命招聘16名员工，包括高级开发人员、项目经理和设计师。但她的候选人库正在枯竭。\n“雇佣新人从来没有像现在这样困难，也从来没有像现在这样昂贵，”她说。“然而，你也必须为你已经拥有的人辩护，因为他们看到了LinkedIn上的亮光，听到了朋友们被高薪吸引的故事。”\n纳扎里是在去年开始的大辞职中发现很难取代辞职潮的雇主之一，从那以后一直没有松懈。根据消费者数据公司Statista的数据，在美国，辞职的工人数量已经连续八个月超过大流行前的最高水平。\n在英国也是如此。德意志银行（Deutsche Bank）首席英国经济学家桑杰·拉贾（Sanjay Raja）今年1月发布了一份报告，发现人们的辞职率达到了2009年以来的最高水平。根据拉贾的分析，大量的人完全离开了劳动力市场，超过80%的人不想要一份自1993年以来最高的工作。这在劳动力中留下了巨大的漏洞。\n大辞职扩大了技术工人的供需差距，并使雇主采取极端激励措施，尽可能多地招聘技术工人。仅在IT行业，就有31%的员工在去年7月至9月期间积极寻找新工作。根据Gartner的分析，这是所有行业中最高的。与此同时，来自培训公司Global Knowledge的数据发现，76%的全球IT决策者正在处理团队中的关键技能缺口。在其他技术岗位上，这个问题会成倍增加，很明显，在情况好转之前，技能短缺可能会进一步恶化。\n随着公司一个接一个地依靠福利来吸引新员工，对人才库不断缩小的争议正在加剧。企业正在尝试各种福利措施来吸引新员工：1月份，Pinterest扩大了生育福利和育儿假；去年12月，fintech company Finder在带薪年假和病假的基础上额外增加了五天；总部位于新德里的一家通讯咨询公司On-Purpose从2月起推出了为期七天的带薪宠物收养假。随着员工在LinkedIn和Twitter上以“ShowUsYourLeave”标签交换有关公司政策的信息，这个消息正在迅速传播。\n应聘者甚至只是为了参加面试而被提供金钱。总部位于法兰克福的保险科技公司Deutsche FamilienVersioncherung表示，它将向面试的任何人提供500欧元，向进入第二轮面试的人提供1000欧元，向完成六个月试用期的人提供5000欧元。\n不仅仅是大公司这样做，伦理技术非营利组织软件自由保护协会（Software Freedom Conservation）有六名工作人员，为面试入围者每人支付500美元。Cactus Communications是科学界的一个出版平台，提供角色年薪的5%作为欢迎奖金，而在Nazzari的Showhere公司，则是签订雇佣合同后的一个月工资。\n纳扎里说：“一个金色的问候是一个非常艰难的电话，因为已经在这家公司工作的人都在说，‘嘿，我没有得到这些’。”。“但每个人在内部都认识到这是一种不寻常的情况，为了继续增长，我们需要更具竞争力。”Nazzari说，Showhere的签约奖金并不有效，因为候选人希望最大限度地利用机会在其他地方获得更高的工资。她现在采取了更广泛的策略，比如在第一次电话面试时为候选人提供高级职位，并让新兵迁往他们想要的地方。以前，从国外招聘员工并让他们通过签证程序感觉有太多摩擦，但现在这是不可避免的。\n其他雇主也面临类似情况。“在过去的一年里，我们在招聘时不再考虑地点标准，”一个名为Kolabtree的科学家自由职业平台的首席执行官阿什米塔·达斯解释说，该平台有一个25人的全职团队。“我们在可以的时间和地点雇佣员工，这是工人寻找不同机会或在不同领域工作的绝佳机会。”\n据在线就业服务梯，美国的永久远程职位在2021的最后一个季度翻了一番，从18%增加到了18%，并且可以增加到25%到2022。“自从向远程优先转型以来，我们已经能够在全球范围内拓宽招聘选择，而不仅仅局限于某个领域的人才库，”美国公司Vista全球人才收购高级总监莫林·卡罗尔解释道。Vista是中小型企业数字服务的专家。这一转变意味着求职人数增加了300%，因此她相信这会带来不同。\n在2月初向股东发布的报告中，亚马逊、贝宝、英特尔和Pinterest承认，拒绝远程工作将使他们在人才争夺战中付出高昂代价，尤其是在Facebook、Twitter和Shopify已经成为常态的情况下。在日本，远程工作仍然不常见，雅虎宣布员工可以在该国的任何地方工作，如果他们需要进入办公室，雅虎将支付他们的机票费用。\n虽然一些科技企业在远程优先与混合动力之间苦苦挣扎，但在员工争夺战中，工资普遍上涨。根据科技职业市场骰子的报告，在2020到2021年间，美国科技职位的中位数增长了近7%，平均每个员工每月6707美元。该报告发现，该行业知识型员工的平均年薪为104566美元，在年薪同比上涨21.3%后，网络开发人员的年薪涨幅最大。\n总部位于柏林的product to consumer platform Productsup的首席人事官梅克·乔丹（Meike Jordan）认为，对于流失人才的公司来说，没有快速解决办法。她说：“用厨房里的啤酒桶或灵活的居家工作政策等办公室福利吸引候选人已经成为过去。”。“人们厌倦了过度工作和薪酬过低，希望雇主能关心他们的整体福祉和未来的成功。”\n🏃🏽‍♀️ 想要最好的健康工具吗？查看我们的装备团队挑选的最佳健身追踪器、跑步装备（包括鞋子和袜子）和最佳耳机", "note_en": "Joy Nazzari, the founder of British proptech startup Showhere, is desperately trying to hire 16 people—a combination of senior-level developers, project managers, and designers. But her pool of candidates is running dry.\n “It’s never been harder or more expensive to hire new people,” she says. “Yet you also have to defend who you already have, because they’re seeing the bright lights—being hit up on LinkedIn and hearing stories of friends attracted by big salary packages.”\n Nazzari is among the employers who have found it difficult to replace the wave of workers who quit in  The Great Resignation, which began last year and hasn’t let up since. In the US, the number of workers quitting has  now exceeded pre-pandemic highs for eight straight months, according to consumer data company Statista.\n  It’s a similar story in the UK. Sanjay Raja, chief UK economist at Deutsche Bank,  published a report in January that found that people are resigning at the highest rate since 2009. Huge numbers are leaving the labor market entirely and more than 80 percent do not want a job—the highest on record since 1993, according to Raja’s analysis. This has left gaping holes in the workforce.\n The Great Resignation has widened the gap between the supply and demand of tech workers, and has made employers resort to extreme incentives to recruit as many of them as possible. In IT alone,  31 percent of workers actively sought out a new job between July and September last year. This is the highest among all industries, according to analysis from Gartner. Meanwhile, data from training company Global Knowledge found that  76 percent of global IT decisionmakers are dealing with critical skills gaps on their teams. Multiply that problem across other tech roles, and it’s clear that the skills shortage is likely to worsen before it gets better.\n  The scrap over a shrinking talent pool is intensifying as companies lay on benefit after benefit to get new recruits through the door. Businesses are experimenting with all kinds of well-being measures to entice new staff: In January,  Pinterest bulked up its fertility benefits and parental leave; in December, fintech company  Finder introduced an extra five days on top of paid annual and sickness leave entitlements; and  On Purpose, a New Delhi–based communications consultancy, launched seven days paid leave for pet adoption from February onwards. Word is spreading fast as employees swap notes on company policies under the hashtag  #ShowUsYourLeave on LinkedIn and Twitter.\n  Candidates are even being offered money just to show up to job interviews. Deutsche Familienversicherung, an insurtech company based in Frankfurt, says it is offering €500 to anyone it interviews, another €1,000 to those who make it to a second round, and €5,000 more to those who complete a six-month probation.\n  It’s not just large companies doing it either—ethical tech nonprofit Software Freedom Conservancy, which has six people on staff, pays interview finalists $500 each. Cactus Communications, a publishing platform for the scientific community, offers 5 percent of a role’s annual compensation as a welcome bonus, and at Nazzari’s company Showhere, it’s a month’s salary upon signing an employment contract.\n  “A golden hello is such a tough call because people already in the business are saying, ‘Hey I didn’t get one of those’,” says Nazzari. “But everyone internally recognizes it’s an unusual situation and for us to continue to grow, we need to be extra competitive.” Showhere’s sign-on bonuses haven’t been effective, because candidates are looking to maximize the opportunity to get much higher salaries elsewhere, Nazzari says. She’s now adopting a broader range of tactics instead, such as offering candidates senior roles during their first phone interview and letting recruits relocate where they want. Before, recruiting staff from abroad and taking them through the visa process felt like too much friction, but now it’s unavoidable.\n Other employers are in a similar situation. “In the past year, we’ve stopped considering location criteria when recruiting,” explains Ashmita Das, CEO of a freelance platform for scientists called Kolabtree, which has a full-time team of 25. “We hire when and where we can—it’s a great opportunity for workers to look for different opportunities, or work in a different domain.”\n Permanent remote positions in the US doubled from 9 percent to 18 percent during the last quarter of 2021,  according to online job service Ladders, and could increase to 25 percent by 2022. “Since making the transition to remote-first, we have been able to broaden our hiring options globally and not be restricted to a talent pool in one area,” explains Maureen Carroll, senior director of global talent acquisition at US company Vista, a specialist in digital services for small and medium businesses. The switch has meant a 300 percent increase in job applications—so she believes it’s making a difference.\n In  reports released to shareholders in early February, Amazon, PayPal, Intel, and Pinterest acknowledged that rejecting remote work will cost them dearly in the fight for talent, particularly as Facebook, Twitter, and Shopify have made it the norm. In Japan, where remote working still isn’t common,  Yahoo has announced employees can work from anywhere in the country and it will pay for their flights if they ever need to come into the office.\n While some tech businesses agonize over remote-first versus hybrid, there has been a universal boost to salaries in the scrabble for staff. The median salary of US tech positions rose by almost 7 percent between 2020 and 2021, according to  a report from tech career marketplace Dice, averaging at $6,707 per employee per month. The average salary for a knowledge worker in the industry is now $104,566 per year, with web developers getting the heftiest increase after their annual salaries jumped 21.3 percent year-on-year, the report found.\n Meike Jordan, chief people officer at Berlin-based product-to-consumer platform Productsup, believes there’s no quick fix for companies hemorrhaging talent. “Attracting candidates with office perks like a beer keg in the kitchen or flexible work-from-home policies is a thing of the past,” she says. “People are tired of being overworked and underpaid, and want an employer who cares about their overall well-being and future success.”\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2022-02-13 19:56:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "resignation", "title": "在大辞职之后，科技公司变得绝望了", "title_en": "After the Great Resignation, Tech Firms Are Getting Desperate", "transed": 1, "url": "https://www.wired.com/story/great-resignation-perks-tech/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Plasma 5.24是几天前发布的，到目前为止，它是记忆中最流畅的版本。虽然出现了一些倒退，但比最近发布的其他版本要少。当然，我相信你们所有经历过新问题的人都会在评论中发言。🙂 但总的来说，进展相当顺利！\n在Plasma Wayland会话中，面板有时不再随机冻结，尤其是在登录之后（Vlad Zahorodnii，只要您的发行版更新KDE Qt补丁集合以包含此补丁）\n当外部显示器插入时，关闭笔记本电脑盖不会再导致电脑在使用禁用设置时不适当地进入睡眠状态（Someone awesome，Plasma 5.24）\nKonsole现在支持Sixel，允许它显示。窗口内的sixel图像（Matan Ziv Av，Konsole 22.04）\n当关闭应用程序时，使用Kate的功能将未保存的更改隐藏并还原到打开的文件中时，如果您碰巧使用“退出”操作或Ctrl+Q键盘快捷键退出应用程序，而不是单击窗口的关闭按钮（Waqar Ahmed，Kate 21.12.3），这些更改实际上会按预期保存，而不是被默默销毁\n取消正在进行的存档作业会自动删除正在创建的临时文件（Méven Car，Ark 22.04）\nKonsole的文本重排功能现在适用于完全没有空格或换行符的文本行（Luis Javier Merino Morán，Konsole 22.04）\n由于某种原因，当磁盘上不存在活动配色方案时，系统设置不再崩溃；现在它又回到了微风灯（默认的配色方案）并且没有崩溃（Nicolas Fella，Plasma 5.24.1）\n在Plasma Wayland会话中，在某些情况下，当你播放屏幕时，Plasma不再总是崩溃（David Edmundson，Plasma 5.24.1）\n在Plasma Wayland会话中，使用自定义启动屏幕再次起作用（Linus Dierheimer，Plasma 5.24.1）\n使用“开始”中的“添加到桌面”上下文菜单项添加到桌面的系统设置页面的链接再次实际出现在桌面上（Alexander Lohnau，Plasma 5.24.1）\n某些类型的带有文本的大按钮在用键盘聚焦时，不再使文本半隐形（Ingo Klöcker，Plasma 5.24.1）\n在便笺小程序上拖动桌面文件不再使文件暂时消失（Severin von Wnuck，Plasma 5.24.1）\n在Plasma X11会话中，光标在使用“缩放”效果时不再消失（Vlad Zahorodnii，Plasma 5.24.1）\n分崩离析效果再次发挥作用，不再与概览效果产生奇怪的交互作用（弗拉德·扎霍罗德尼，Plasma 5.24.1）\n在Plasma Wayland会话中，修复了工具提示可能被错误定位的一种方式（Vlad Zahorodnii，Plasma 5.24.1）\n当使用某些第三方窗口装饰主题时，快速平铺最大化的窗口不再意外地使窗口去最大化，而不是快速平铺（Vlad Zahorodnii，Plasma 5.24.1）\n系统设置现在启动速度更快，尤其是在使用传统图标查看模式时（傅山文，Plasma 5.24.1）\n基于QtQuick的软件中带有文本的可滚动视图不再显示视觉故障，当视图一次滚动一个像素时，文本在顶部或底部被切断或挤压（Noah Davis，Frameworks 5.92）\n如果没有安装信息中心，打开信息中心页面的系统托盘小程序中的按钮现在可以工作；而是在一个单独的窗口中打开请求的页面（我：Nate Graham，Frameworks 5.92）\n当一个应用程序从不同来源安装多次（例如，一个版本来自distro repos，另一个版本来自Flatpak）时，该应用程序在启动时的上下文菜单中不再有多个条目显示“卸载或管理加载项”（Alexander Lohnau，Plasma 5.24.1）\n搜索尚未安装的应用程序将不再返回来自多个来源的匹配应用程序的重复条目（Alexander Lohnau，Plasma 5.24.1）\n在概览效果中，当你开始拖动应用程序时，应用程序的选择高亮效果现在消失（Vlad Zahorodnii，Plasma 5.24.1）\n系统设置的快速设置页面在元素的对齐和间距以及标签的清晰性方面得到了一些用户界面改进（me:Nate Graham，Plasma 5.25）：\nKate、KDevelop和其他基于KTextEditor的应用程序现在可以更好地区分在具有相同文件名的选项卡中打开的文件（Waqar Ahmed，Frameworks 5.92）：\n现在，将文件或文件夹拖动到“位置”面板中的某个项目上会导致该位置被打开并显示在主视图中，这样您就可以将该项目拖动到其中的文件夹中。如果你拖过的Places面板项目是一个未安装的磁盘，那么它现在会首先自动安装！（Kai-Uwe Broulik，框架5.92）\n打开/保存对话框中的错误现在以Dolphin的形式内联显示，而不是使用单独的对话框窗口（Kai-Uwe-Broulik，Frameworks 5.92）\n请记住，这个博客只涉及冰山一角！这里没有介绍大量我没有时间关注的KDE应用程序的开发，我也没有提到后端重构、改进的测试覆盖率以及其他通常不面向用户的更改。如果你想要更多，就去看看吧https://planet.kde.org/，你可以在那里找到其他KDE贡献者的博客文章，详细介绍他们正在做的工作。\n如果你是一名开发人员，请查看我们的15分钟Bug计划。解决这些问题会很快产生巨大的影响！\n否则，请看一看https://community.kde.org/Get_Involved探索成为真正重要项目一部分的方法。每个贡献者在KDE方面都有巨大的不同；你不是机器上的数字或齿轮！你也不必已经是一名程序员了。我刚开始的时候不是。试试看，你会喜欢的！我们不咬人！", "note_en": "Plasma 5.24  was released a few days ago, and so far it’s been the smoothest release in memory. There have been a few regressions, but fewer than other recent releases. I’m sure all of you who have experienced new issues will speak up in the comments, of course. 🙂 But overall it has gone quite well!\n   In the Plasma Wayland session, panels  no longer sometimes randomly freeze especially right after login (Vlad Zahorodnii, as soon as your distro updates their KDE Qt patch collection to include  this patch)\n Closing your laptop lid when an external monitor plugged in  no longer causes the computer to inappropriately go to sleep when the setting to disable this has been used (Somebody awesome, Plasma 5.24)\n  Konsole  now supports Sixel, allowing it to display  .sixel images right inside the window (Matan Ziv-Av, Konsole 22.04)\n    When using Kate’s feature to stash and restore unsaved changes to open files when closing the app, those changes are  now actually saved as expected rather than being silently destroyed if you happen to quit the app using the “Quit” action or  Ctrl+Q keyboard shortcut instead of clicking on the window’s close button (Waqar Ahmed, Kate 21.12.3)\n Canceling an in-progress archive job  now automatically deletes the temporary file that was being created (Méven Car, Ark 22.04)\n Konsole’s text re-flow feature  now works for lines of text that have no whitespace or newline characters at all (Luis Javier Merino Morán, Konsole 22.04)\n System Settings  no longer crashes when the active color scheme doesn’t exist on disk for some reason; now it falls back to Breeze Light (the default color scheme) and doesn’t crash (Nicolas Fella, Plasma 5.24.1)\n In the Plasma Wayland session, Plasma  no longer always crashes when you screencast in certain circumstances (David Edmundson, Plasma 5.24.1)\n In the Plasma Wayland session, using custom splash screens  once again works (Linus Dierheimer, Plasma 5.24.1)\n  Links to System Settings pages added to the desktop using the “Add to Desktop” context menu item in Kickoff  once again actually appear on the Desktop as expected (Alexander Lohnau, Plasma 5.24.1)\n Certain types of large buttons with text  no longer make their text half-invisible when they’re focused with the keyboard (Ingo Klöcker, Plasma 5.24.1)\n  Dragging desktop files over a Sticky Note applet  no longer makes the files temporarily disappear (Severin von Wnuck, Plasma 5.24.1)\n In the Plasma X11 session, the cursor  no longer disappears while using the “Zoom” effect (Vlad Zahorodnii, Plasma 5.24.1)\n The Fall Apart effect  once again works and  no longer interacts strangely with the Overview effect (Vlad Zahorodnii, Plasma 5.24.1)\n In the Plasma Wayland session,  fixed one way that tooltips could be mis-positioned (Vlad Zahorodnii, Plasma 5.24.1)\n  When using certain 3rd-party window decoration themes, quick-tiling a maximized window  no longer unexpectedly de-maximizes the window instead of quick-tiling it (Vlad Zahorodnii, Plasma 5.24.1)\n System Settings  is now faster to launch,  especially when using the legacy Icons View mode (Fushan Wen, Plasma 5.24.1)\n   Scrollable views with text in QtQuick-based software  no longer exhibit visual glitches with text being cut off or squished at the top or bottom when the view is scrolled very slowly a pixel at a time (Noah Davis, Frameworks 5.92)\n  Buttons in System Tray applets that open Info Center pages  now work if you don’t happen to have Info Center installed; they instead open the requested page in a separate window (me: Nate Graham, Frameworks 5.92)\n   When an app is installed more than once from different sources (e.g. one version from distro repos, and another version from Flatpak), The context menu for that app in Kickoff  no longer has multiple entries saying, “Uninstall or manage add-ons” (Alexander Lohnau, Plasma 5.24.1)\n Searching for apps that are not yet installed  no longer returns duplicate entries for matched apps that are available from multiple sources (Alexander Lohnau, Plasma 5.24.1)\n In the Overview effect, apps’ selection highlight effects  now disappear when you start to drag them (Vlad Zahorodnii, Plasma 5.24.1)\n System Settings’ Quick Settings page  has received some UI polish for the alignment and spacing of its elements and the clarity of its labels (me: Nate Graham, Plasma 5.25):\n  Kate, KDevelop, and other KTextEditor-based apps  now do a much better job of differentiating files opened in tabs that have the same filename (Waqar Ahmed, Frameworks 5.92):\n  Dragging a file or folder over an item in the Places panel  now causes that location to be opened and displayed in the main view so you can drag the thing into a folder inside it. And if the Places panel item you dragged over was an unmounted disk,  it is now automatically mounted first! (Kai Uwe Broulik, Frameworks 5.92)\n Errors in the open/save dialogs  are now shown inline as in Dolphin, rather than with a separate dialog window (Kai Uwe Broulik, Frameworks 5.92)\n  Keep in mind that this blog only covers the tip of the iceberg! Tons of KDE apps whose development I don’t have time to follow aren’t represented here, and I also don’t mention backend refactoring, improved test coverage, and other changes that are generally not user-facing. If you’re hungry for more, check out  https://planet.kde.org/, where you can find blog posts by other KDE contributors detailing the work they’re doing.\n  If you’re a developer, check out our  15-Minute Bug Initiative. Working on these issues makes a big difference quickly!\n Otherwise, have a look at  https://community.kde.org/Get_Involved to discover ways to be part of a project that really matters. Each contributor makes a huge difference in KDE; you are not a number or a cog in a machine! You don’t have to already be a programmer, either. I wasn’t when I got started. Try it, you’ll like it! We don’t bite!", "posttime": "2022-02-13 19:04:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,本周,kde,现在", "title": "本周KDE：顺利发布Plasma 5.24", "title_en": "This week in KDE: A smooth release of Plasma 5.24", "transed": 1, "url": "https://pointieststick.com/2022/02/11/this-week-in-kde-a-smooth-release-of-plasma-5-24/", "via": "", "real_tags": ["发布", "本周", "kde", "现在"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072938, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这有助于内容和；信息\n一般帮助中心经验", "note_en": "This help content &amp; information\n General Help Center experience", "posttime": "2022-02-13 19:04:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,活跃,image,中心", "title": "谷歌图像搜索工具在新搜索中不保持活跃状态", "title_en": "Google Image Search Tools not staying active with new searches", "transed": 1, "url": "https://support.google.com/websearch/thread/93284248/google-image-search-tools-not-staying-active-with-new-searches?hl=en", "via": "", "real_tags": ["谷歌", "google", "活跃", "image", "中心"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072937, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TL；DR：在4天内，在6核AMD Ryzen 5 3600（64GB内存）上分解512位（复合）数字。\n%openssl rsa-noout-text-in密钥对。：adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvn）指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数）指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数d1:4c:2e:6a:a7:6b:bd:cb:da:3d:6c:例如：adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadad552:00:fd:3a:c0:67:27:b5:25:ab:72:10:a3:77:8c:b7:adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadvvvvvvvvvvvvvvvvvv）adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv系数：7b:be:00:7a:51:cd:5c:b0:ac:f7:be:67:2d:0c:ce:a1:34:cc:ab:7e:06:d4:88:cf:97:b0:b4:43:d9:96:bd:9c%openssl rsa-noout-text-Notify PEM-pubin-in pubkey。公钥：（512位）模数：00:fd:1a:2f:5a:b9:01:4f:85:f7:72:a4:c2:6f:58:43:c8:6a:4c:dc:2b:3f:96:08:8e:e9:ed:4e:c2:92:e4:3c:02:c8:2e:09:63:23:ad:45:6b:92:fa:a7:88:3a:0c:4b:08:cf:aa:fd:b5:64:cd:28:5e:c8:c8:c8:c8:5e:c8:c8:c8:e8:5a8:e8:e8:e8:5a:e8:e8:e8:5a:e8:e8:e8:e8:e8:5\n暂时忘记私钥。只取公钥。将&#39的十六进制数连接起来；模数&#39；，忽略冒号（&#39；：&#39；）象征将其转换为Wolfram Mathematica中的十进制数：\n现在等4天。或者更多，如果你的硬件速度较慢。或者更少，如果更快的话。\n...信息：过滤-重复删除，删除过程：dup2的CPU时间：802.59999999SINFO：线性代数：bwc的总CPU/实时：162309/30174信息：线性代数：聚合统计信息：线性代数：Krylov:CPU时间104154.41，WCT时间19350.89，迭代CPU时间0.14，通信0.01，CPU等待0.01，通信等待0.0（118784次迭代）信息：线性代数：林根CPU时间1233.97，WCT时间107.94信息：线性代数：Mksol:CPU时间55810.1，WCT时间10470.62，迭代CPU时间0.15，通信0.01，CPU等待0.01，comm wait 0.0（59392次迭代）信息：生成自由关系：freerel的总cpu/实时：480.9/42.4643信息：生成因子库：makefb的总cpu/实时：28.51/3.17731信息：平方根：sqrt的总cpu/实时：6552.17/687.81信息：多项式选择（根优化）：聚合统计信息：多项式选择（根优化）：总时间：9368.04信息：多项式选择（根优化）：根筛选时间：9366.28信息：筛选-单例删除：清除的总cpu/实时：883.34/900.631信息：HTTP服务器：关闭HTTP服务器信息：完成因式分解/离散对数：整个因式分解的总cpu/运行时间：3.55505e+06/549.64211453895573767833204351134448177200907101690028206764172540480084319013256187 11573391951427310712358932610501838699964100906320600963295194448416597\n下面的代码可以做到这一点：它重建RFC 2437中所述的所有额外（预计算）常量，并为RSA私钥生成一个新的PEM文件。\n我&#39；我在IRC#crypto（Libera）上找到了它，它是Wulf写的，非常感谢他。我只是通过放弃LCM操作简化了一点。\n#!/usr/bin/python3#下面的代码是Wulf在#crypto（Libera）上编写的，来自math import gcdfrom cryptography。危险品。后端从加密中导入默认值。危险品。原语。不对称rsa从密码学导入（rsPublicNumbers、rsPrivateNumbers、rsa_crt_iqmp、rsa_crt_dmp1、rsa_crt_dmq1等）。危险品。原语。序列化导入编码，PrivateFormat，NoEncryptiondef gcdext（a，b）：x0，x1，y0，y1=1，0，0，1，而b:q，a，b=a//b，b，a%bx0，x1=x1，x0-q*x1-y0，y1=y1，y0-q*y1返回a，x0，y0def反转（a，n）：g，x，u=gcdext（a，n）如果g！=1:raise ValueError（&#34；参数不是互质&#34；）返回x%ne=65537#订单不&#39；重要事项：p=1157339195142731071235843932610501578386997964100906320600963295194448416597Q=1145389557378332043511344817720090710169002820676417254048084319013256187N=p*qpub_num=RSAPublicNumbers（e，n）d=ateinvert（e，（p-1）*（q-1））iq=rsa_crt_iqmp（p，q）dp=rsa_crt_DMU（d，p）dq=rsa_crt_crt_-DMU（d，dq=RSAU）PRSU（p，q，d，dp，dq，iq，pub_num）prv=prv_num.private_key（默认_backend（））#跳过最新版本中的arg打印（prv.private_字节（Encoding.PEM，PrivateFormat.PKCS8，NoEncryption（））。解码（））\n%openssl rsa-noout-text-in new_priv_密钥。：adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvn）指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数）指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数指数d1:4c:2e:6a:a7:6b:bd:cb:da:3d:6c:例如：adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadad552:00:fd:3a:c0:67:27:b5:25:ab:72:10:a3:77:8c:b7:adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadvvvvvvvvvvvvvvvvvv）adadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadadvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv系数：7b:be:00:7a:51:cd:5c:b0:ac:f7:be:67:2d:0c:ce:a1:34:cc:ab:7e:06:d4:88:cf:97:b0:b4:43:d9:96:bd:9c\n%xxd-G1HW。txt。签名00000000:9d 30 22 87 12 c1 bf bb 87 e0 54 76 a0 fb a5 cd.0&#34；。。。。。。。电视00000010:F051 fc 44 e3 52 8f ba dc 82 b7 ca 0a 6a bd 64。Q.D.R。。。。。。。j、 d00000020:48 c9 30 8a 83 0a 5c 43 7d d6 5a 4a e8 cb d1 cd H.0。。。\\C} 。ZJ。。。。00000030:c6 a3 37 ac 49 8f a7 f8 d8 32 76 45 6e 0a bc 95。。7.我。。。。即使。。。\n%openssl dgst-签署新的私钥。pem-keyform pem-sha256-out hw。txt。符号-二进制硬件。txt%xxd-G1 hw。txt。签名00000000:9d 30 22 87 12 c1 bf bb 87 e0 54 76 a0 fb a5 cd.0&#34；。。。。。。。电视00000010:F051 fc 44 e3 52 8f ba dc 82 b7 ca 0a 6a bd 64。Q.D.R。。。。。。。j、 d00000020:48 c9 30 8a 83 0a 5c 43 7d d6 5a 4a e8 cb d1 cd H.0。。。\\C} 。ZJ。。。。00000030:c6 a3 37 ac 49 8f a7 f8 d8 32 76 45 6e 0a bc 95。。7.我。。。。即使。。。\n早在大约20年前的1999年，RSA-512就已被考虑在内。但他们需要6个月的时间，唐&#39；我不知道有多少硬件。\nCADO-NFS是当今用于因子分解的强大工具。截至2022年2月，它保持着目前的RSA factoring世界记录：829位（但运行在一个大集群上）。\n它&#39；如今，人们普遍认为RSA-1024已经不够了。考虑至少使用RSA-1536或RSA-2048。\nCADO-NFS可以按任意顺序打印数字。订单没有&#39；重要的是：Python中的重构工具可以按相反的顺序获取这些数字。但文本转储将略有不同（数字顺序）。但不管怎样，它都会起作用。", "note_en": "TL;DR: factoring a 512-bit (composite) number on a 6-core AMD Ryzen 5 3600 (64GB of RAM) in 4 days.\n       % openssl rsa -noout -text -in keypair.pemRSA Private-Key: (512 bit, 2 primes)modulus: 00:fd:1a:2f:5a:b9:01:4f:85:f7:72:a4:c2:6f:58: 43:c8:6a:4c:dc:2b:3f:96:08:8e:e9:ed:4e:c2:92: e4:3c:02:c8:2e:09:63:23:ad:45:6b:92:fa:a7:88: 3a:0c:4b:08:cf:aa:fd:b5:64:cd:28:5e:3a:6a:53: 20:7c:e9:35:d7publicExponent: 65537 (0x10001)privateExponent: 49:b5:ac:80:d1:4c:2e:6a:a7:6b:bd:cb:da:3d:6c: 50:1b:95:12:b1:8d:ad:16:04:f8:df:61:86:8c:dc: e7:14:9c:0f:e0:89:d9:20:fe:9c:6d:9a:be:0c:aa: a3:90:d1:88:7d:85:38:08:19:3d:f0:d0:3f:f0:6a: 88:8f:f8:71prime1: 00:ff:df:13:bd:0e:17:9f:05:41:92:8a:86:53:91: 34:fc:51:f2:c2:59:a7:ec:9b:f5:37:74:95:f0:eb: c6:17:55prime2: 00:fd:3a:c0:67:27:b5:25:ab:72:10:a3:77:8c:b7: d3:cd:00:db:89:e9:25:82:11:24:ec:bc:e9:a8:29: cc:00:7bexponent1: 00:8d:e4:30:36:fb:f4:9f:6b:b3:c4:46:eb:5c:b6: 3e:92:da:02:ec:41:f9:bc:5d:74:2b:af:8c:62:d0: ec:c6:0dexponent2: 00:f4:2d:24:bd:d3:42:0f:32:c4:68:5a:d7:ba:2e: bf:e2:9b:83:15:f6:64:9e:88:9d:8c:51:95:14:fc: 48:a3:e5coefficient: 7b:be:00:7a:51:cd:5c:b0:ac:f7:be:67:2d:0c:ce: a1:34:cc:ab:7e:06:d4:88:cf:97:b0:b4:43:d9:96: bd:9c % openssl rsa -noout -text -inform PEM -pubin -in pubkey.pubRSA Public-Key: (512 bit)Modulus: 00:fd:1a:2f:5a:b9:01:4f:85:f7:72:a4:c2:6f:58: 43:c8:6a:4c:dc:2b:3f:96:08:8e:e9:ed:4e:c2:92: e4:3c:02:c8:2e:09:63:23:ad:45:6b:92:fa:a7:88: 3a:0c:4b:08:cf:aa:fd:b5:64:cd:28:5e:3a:6a:53: 20:7c:e9:35:d7Exponent: 65537 (0x10001)\n Forget the private key for a moment.Take only the public key.Join hexadecimal numbers of &#39;Modulus&#39;, ignoring colon (&#39;:&#39;) symbol.Convert it to decimal number in Wolfram Mathematica:\n       Now wait ~4 days. Or more, if your hardware is slower. Or less, if faster.\n  ...Info:Filtering - Duplicate Removal, removal pass: CPU time for dup2: 802.5999999999999sInfo:Linear Algebra: Total cpu/real time for bwc: 162309/30174Info:Linear Algebra: Aggregate statistics:Info:Linear Algebra: Krylov: CPU time 104154.41, WCT time 19350.89, iteration CPU time 0.14, COMM 0.01, cpu-wait 0.01, comm-wait 0.0 (118784 iterations)Info:Linear Algebra: Lingen CPU time 1233.97, WCT time 107.94Info:Linear Algebra: Mksol: CPU time 55810.1, WCT time 10470.62, iteration CPU time 0.15, COMM 0.01, cpu-wait 0.01, comm-wait 0.0 (59392 iterations)Info:Generate Free Relations: Total cpu/real time for freerel: 480.9/42.4643Info:Generate Factor Base: Total cpu/real time for makefb: 28.51/3.17731Info:Square Root: Total cpu/real time for sqrt: 6552.17/687.81Info:Polynomial Selection (root optimized): Aggregate statistics:Info:Polynomial Selection (root optimized): Total time: 9368.04Info:Polynomial Selection (root optimized): Rootsieve time: 9366.28Info:Filtering - Singleton removal: Total cpu/real time for purge: 883.34/900.631Info:HTTP server: Shutting down HTTP serverInfo:Complete Factorization / Discrete logarithm: Total cpu/elapsed time for entire factorization: 3.55505e+06/549.642114538955737678332043511344817720090710169002820676417254048008431901325656187 115733919514273107123584393261050157838699796410090632060096329519444848416597\n      The following piece of code do this: it reconstructs all the additional (precomputed) constants as stated in RFC 2437and generate a new PEM file for RSA private key.\n I&#39;ve found it on IRC #crypto (Libera), it was written by Wulf, so many thanks to him.I only simplified it a bit by dropping the LCM operation.\n #!/usr/bin/python3# The following code was written by Wulf on #crypto (Libera)from math import gcdfrom cryptography.hazmat.backends import default_backendfrom cryptography.hazmat.primitives.asymmetric.rsa import ( RSAPublicNumbers, RSAPrivateNumbers, rsa_crt_iqmp, rsa_crt_dmp1, rsa_crt_dmq1,)from cryptography.hazmat.primitives.serialization import Encoding, PrivateFormat, NoEncryptiondef gcdext(a, b): x0, x1, y0, y1 = 1, 0, 0, 1 while b: q, a, b = a // b, b, a % b x0, x1 = x1, x0 - q * x1 y0, y1 = y1, y0 - q * y1 return a, x0, y0def invert(a, n): g, x, __ = gcdext(a, n) if g != 1: raise ValueError(&#34;Arguments are not coprime&#34;) return x % ne = 65537# order doesn&#39;t matter:p = 115733919514273107123584393261050157838699796410090632060096329519444848416597q = 114538955737678332043511344817720090710169002820676417254048008431901325656187n = p * qpub_num = RSAPublicNumbers(e, n)d = invert(e, (p - 1) * (q - 1))iq = rsa_crt_iqmp(p, q)dp = rsa_crt_dmp1(d, p)dq = rsa_crt_dmq1(d, q)prv_num = RSAPrivateNumbers(p, q, d, dp, dq, iq, pub_num)prv = prv_num.private_key(default_backend()) # skip arg in recent versionsprint(prv.private_bytes(Encoding.PEM, PrivateFormat.PKCS8, NoEncryption()).decode())\n    % openssl rsa -noout -text -in new_priv_key.pemRSA Private-Key: (512 bit, 2 primes)modulus: 00:fd:1a:2f:5a:b9:01:4f:85:f7:72:a4:c2:6f:58: 43:c8:6a:4c:dc:2b:3f:96:08:8e:e9:ed:4e:c2:92: e4:3c:02:c8:2e:09:63:23:ad:45:6b:92:fa:a7:88: 3a:0c:4b:08:cf:aa:fd:b5:64:cd:28:5e:3a:6a:53: 20:7c:e9:35:d7publicExponent: 65537 (0x10001)privateExponent: 49:b5:ac:80:d1:4c:2e:6a:a7:6b:bd:cb:da:3d:6c: 50:1b:95:12:b1:8d:ad:16:04:f8:df:61:86:8c:dc: e7:14:9c:0f:e0:89:d9:20:fe:9c:6d:9a:be:0c:aa: a3:90:d1:88:7d:85:38:08:19:3d:f0:d0:3f:f0:6a: 88:8f:f8:71prime1: 00:ff:df:13:bd:0e:17:9f:05:41:92:8a:86:53:91: 34:fc:51:f2:c2:59:a7:ec:9b:f5:37:74:95:f0:eb: c6:17:55prime2: 00:fd:3a:c0:67:27:b5:25:ab:72:10:a3:77:8c:b7: d3:cd:00:db:89:e9:25:82:11:24:ec:bc:e9:a8:29: cc:00:7bexponent1: 00:8d:e4:30:36:fb:f4:9f:6b:b3:c4:46:eb:5c:b6: 3e:92:da:02:ec:41:f9:bc:5d:74:2b:af:8c:62:d0: ec:c6:0dexponent2: 00:f4:2d:24:bd:d3:42:0f:32:c4:68:5a:d7:ba:2e: bf:e2:9b:83:15:f6:64:9e:88:9d:8c:51:95:14:fc: 48:a3:e5coefficient: 7b:be:00:7a:51:cd:5c:b0:ac:f7:be:67:2d:0c:ce: a1:34:cc:ab:7e:06:d4:88:cf:97:b0:b4:43:d9:96: bd:9c\n         % xxd -g 1 hw.txt.sign00000000: 9d 30 22 87 12 c1 bf bb 87 e0 54 76 a0 fb a5 cd .0&#34;.......Tv....00000010: f0 51 fc 44 e3 52 8f ba dc 82 b7 ca 0a 6a bd 64 .Q.D.R.......j.d00000020: 48 c9 30 8a 83 0a 5c 43 7d d6 5a 4a e8 cb d1 cd H.0...\\C}.ZJ....00000030: c6 a3 37 ac 49 8f a7 f8 d8 32 76 45 6e 0a bc 95 ..7.I....2vEn...\n    % openssl dgst -sign new_priv_key.pem -keyform PEM -sha256 -out hw.txt.sign -binary hw.txt % xxd -g 1 hw.txt.sign00000000: 9d 30 22 87 12 c1 bf bb 87 e0 54 76 a0 fb a5 cd .0&#34;.......Tv....00000010: f0 51 fc 44 e3 52 8f ba dc 82 b7 ca 0a 6a bd 64 .Q.D.R.......j.d00000020: 48 c9 30 8a 83 0a 5c 43 7d d6 5a 4a e8 cb d1 cd H.0...\\C}.ZJ....00000030: c6 a3 37 ac 49 8f a7 f8 d8 32 76 45 6e 0a bc 95 ..7.I....2vEn...\n   RSA-512 has been  factored as early, as ~20 years ago, in 1999.But they needed 6 months and don&#39;t know how many hardware.\n  CADO-NFS is the powerful tool today for factoring.As of Feb-2022, it holds the current RSA factoring world record:  829 bits(but running on a big cluster).\n It&#39;s widely considered today that RSA-1024 is not enough anymore.Think about using at least RSA-1536 or RSA-2048.\n  CADO-NFS can print numbers in either order.Order doesn&#39;t matter: a reconstructing tool in Python can take these numbers in reverse order.But text dump will differ slightly (order of numbers again).But it will work anyway.", "posttime": "2022-02-13 19:01:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硬件,破解,hardware,rsa", "title": "如何在4天内破解现有硬件上的RSA-512", "title_en": "How to crack RSA-512 on off-the-shelf hardware in 4 days", "transed": 1, "url": "https://yurichev.com/news/20220210_RSA/", "via": "", "real_tags": ["硬件", "破解", "hardware", "rsa"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072936, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论是作为最终用户还是作为程序员，最令人沮丧的经历之一就是试图运行一个不久前还可以完美运行的软件，结果却发现它现在坏了，软件不再运行了，原因也不清楚。软件没有改变，但有些东西坏了，似乎是无缘无故的。这通常是由于被称为“代码腐烂”或“位腐烂”的现象。\n我曾经在一个深度学习研究实验室工作，我见过一些案例，研究人员在六个月前刚刚发布了代码，但他们所依赖的一个或多个依赖项后来发生了突破性的变化。这让我们陷入了不幸的境地，不得不对其他人的代码进行故障排除。有时候你是幸运的，问题只是他们的代码所需的Python包中有一个做了破坏性的更改，而这个问题可以通过简单地编辑项目清单来解决。有时人们会导入一些他们并不真正使用的软件包，我们可以完全消除依赖性。其他时候，我们必须解决可以安装在给定系统（pip2、pip3、Conda和Ubuntu的apt）上的多个Python包管理器之间的冲突。\n编辑与包管理器相关的依赖列表或争吵并不太坏，但是PyTrink是一个令人恼火的特性，它是一个令人恼火的特性，每个版本需要英伟达GPU驱动程序的一个特定版本来运行。安装较旧的GPU驱动程序需要根访问权限，这是我们在远程计算集群上工作时通常没有的。即使你是在一台本地机器上做这件事，在那里你确实有根访问权限，安装一个新的GPU驱动程序的过程是非常缓慢和乏味的。多亏了Nvidia不友好的驱动程序安装程序，这个过程无法自动化，一旦完成，你可能会成功地获得Pytork的特定版本，但你的其他项目无法再运行，因为它们需要最新版本。\n为了可复制性，研究人员被鼓励发布他们的代码，但如果没有其他人能够在几个月后运行这些代码，那就没有多大意义了。因此，我们开始鼓励那些希望发布代码的人使用Docker或Singularity进行集装箱化。这修复了诸如Python软件包损坏、PyTorch或TensorFlow版本不兼容以及主机系统上缺少库等问题。然而，还有另一个问题，那就是很多深度学习代码不能在CPU上运行得足够快，无法使用。我们看到的大多数代码都需要GPU加速。实现这一点的解决方案是使用nvidia docker，这是docker的一个特殊版本，允许代码访问主机的nvidia GPU驱动程序。然而，这再次引发了一个问题，即容器中运行的代码需要在主机上安装一个特殊版本的GPU驱动程序才能正确运行。Nvidia让人们能够访问Docker容器内的GPU的解决方案是破坏容器，并在过程中暴露主机系统的细节。\n我们每年集体浪费多少时间来修复因依赖关系中断而导致的错误？每天损失了多少百万小时的生产力？我们花了多少时间重写那些在软件崩溃前运行良好的软件？在我看来，代码腐败是一个我们应该努力解决或至少缓解的问题。由于我将在本文后面讨论的基本原因，代码腐败可能永远无法完全消除，但我认为，通过更具原则性和前瞻性的软件工程，情况可能会变得更好。至少，如果我们承认代码腐烂是一个问题，并且首先理解是什么导致了它的发生，情况就会有所改善。\n我们如何避免代码破坏？Linus Torvalds似乎认为，一般来说，在编译软件时，如果可以的话，最好是静态链接库，因为很少有共享库实际上是版本安全的，而且使用动态链接，你总是在增加复杂性，让自己面临这样的风险：你的软件将要安装到的系统没有与你需要的库兼容的版本。\n在我看来，对于依赖软件包管理器的软件，如果可能的话，最好修复软件包版本号。也就是说，直接在包的清单中指定要使用的每个依赖项的版本。原因是，不幸的是，您不能信任更新版本的依赖项不进行破坏性更改，而且通常，一个破坏的依赖项就是导致软件破坏的全部条件。在某些情况下，程序员可能会避免指定固定的版本号，因为Python的pip等软件包管理器不支持同时安装给定软件包的多个版本，这可能意味着您请求的软件包版本可能会与已安装在给定系统上的其他软件冲突。如果我们想要构建可靠的软件，包管理器需要解决这个缺点。\n不过还有一个问题。Python的部分吸引力在于，它可以通过其外部函数接口（FFI）轻松地与C代码链接。这是Python如此受欢迎的原因之一，因为它使任何人都可以轻松编写一个包，与常用的C库进行接口，并从C生态系统的优势中获益。然而，这种便利是有代价的。FFI本质上是一扇陷阱门，通过它，软件可以访问包管理器无法控制的外部依赖项，这大大增加了代码破坏的风险。第三方软件包管理器（如Conda）试图通过管理外部库和Python代码的安装来解决这个问题，但这可能会与通过其他方式安装的Python软件包产生冲突。\n在我看来，在现实世界中处理这些问题的最实际的解决方案是对软件设计采取保守和最低限度的方法。如果可能，有目的地最小化依赖关系。不要添加新的依赖项，除非增加的价值真的值得潜在代码破坏的额外成本。尽可能避免外部依赖，如果选择依赖外部软件包和库，请选择稳定、维护良好、向后兼容且易于安装的库。记住，你的软件可能只需要一个坏掉的依赖项就无法在用户的系统上运行，如果你的软件坏了，他们甚至可能不会告诉你它坏了。\n良好的软件工程实践可以在很大程度上降低代码腐烂的风险，但我认为，首先问问自己代码腐烂的原因是什么也是很有价值的。我们能不能开发出不会腐烂的软件？一个有趣的观察结果是，在某种意义上，这样的软件确实存在。人们仍在为Super NES和Atari 2600等复古游戏平台编写软件。这些平台基本上是时间冻结的，设备固定，I/O能力有限。平台的固定性、简单性以及不可能依赖外部软件包意味着为其编写的任何软件都不太可能被平台本身的变化破坏。\n代码腐烂的根本原因是变化。世界本身在变化，软件也在变化。因此，要完全防止代码腐烂，唯一的方法就是针对一个永不改变的平台。不仅是平台本身，还有平台与外部的每个接口、每个设备、文件格式和网络协议。我们无法阻止世界的变化，但我们可以尝试在更稳定的基础上构建软件。就像旧金山的千禧大厦一样，现代软件是建立在我们脚下不断移动的软土上的，但它不一定是这样的。\n尽管世界确实在变化，但计算世界的许多元素仍然相当稳定。电脑键盘从20世纪50年代就开始出现了。自20世纪80年代以来，彩色显示器就已经出现了。十多年来，触摸设备已经司空见惯。IPv4于1981年推出，IPv6于1995年推出。如果我写的程序只需要读取键盘和指针设备的输入，并在屏幕上显示像素，那么这个程序就没有真正的理由需要中断。用于从键盘获取输入和将帧渲染到显示器的API可以非常简单。世界将不断变化，新的I/O设备将被发明，但即使在200年后，键盘和彩色显示器的概念也应该易于理解和使用。\n最近，我一直在考虑虚拟机的设计。如果我们想创造出不会崩溃的软件，也许我们需要的是某种可执行代码存档格式。这是一个极简的虚拟机，带有一小组I/O设备，这些设备通过一个小的API界面、一个小的RISC指令集连接，总体设计尽可能简单和稳定。有点像现代版的Commodore 64，具有高分辨率彩色显示屏和现代机器的性能。我不认为这样的东西适用于每一个用例，但我猜测，我们使用的许多软件实际上只需要以相当简单的方式与外部世界进行交互。例如，它需要从用户那里获取鼠标点击或触摸设备方面的输入，需要绘制像素来显示用户界面，可能还需要读取和写入文件，可能还需要访问网络。该软件基本上不需要链接到任何外部库，所有东西都可以静态链接，它只需要简单、稳定的界面就可以访问外部世界。\n虚拟机（VM）的概念并不新鲜。Java虚拟机试图实现这一点，但基本上失败了。Sun Microsystems创造了著名的“写一次，到处运行”口号，人们开始开玩笑地嘲笑它为“写一次，到处调试”。在我看来，大多数虚拟机设计人员出错的地方是，他们倾向于暴露太多的API，而且每个人都有一个太大的API表面。当一个API有一个大的表面时，很容易出现细微的bug和小问题。您几乎不可避免地会以不同的方式使用不同的API实现。Web Audio和Canvas HTML API就是很好的例子。创建具有大表面积的API是因为VM设计者认为这对程序员来说更方便，并且会产生更好的性能。然而，这种便利是有代价的，因为它使代码更容易被破坏。基本上，要输出音频，应该能够输出一个简单的浮点采样列表，要绘制像素，应该能够输出一个像素网格。它不必比这复杂得多，如果API保持简单，它们就不太可能崩溃。\n为了将代码破坏的风险降到最低，API边界并不是唯一需要考虑的问题。如果你的软件与外界连接，你还需要考虑文件格式和网络协议。在这方面，选择成熟、稳定、开放的标准通常是可取的。我不知道我对代码归档格式的想法，或是为最大限度地提高API稳定性而设计的虚拟机，是否会大行其道。目前，它仍然是一个思想实验，但与此同时，我鼓励每个开发人员考虑有目的地最小化依赖性，设计更小、更稳定的API，以及以一种能够最大限度地延长其有效保质期的方式包装他们的软件。设计更健壮、更耐用的软件是一种方法，通过这种方法，你可以以较小的方式改善大量人的生活，并帮助减少电子垃圾。", "note_en": "One of the most frustrating experiences, both as an end user and as a programmer, is to try to run a piece of software that used to work perfectly not that long ago, only to find out that it’s now broken, the software won’t run anymore, and it’s not clear why. The software didn’t change, but something broke, seemingly for no reason. This is often due to the phenomenon known as “code rot”, or “bit rot”.\n I used to work in a deep learning research lab, and I’ve seen cases where researchers had published code just six months ago, but one or more of the dependencies on which they relied had since made breaking changes. That put us in the unfortunate position of having to troubleshoot someone else’s code. Sometimes you were lucky, and the problem was just that one of the Python packages which their code needed had made breaking changes, and the problem could be fixed by simply editing the project manifest. Sometimes people imported packages which they didn’t really use, and we could completely remove the dependency. Other times we had to resolve conflicts between the multiple Python package managers that could be installed on a given system (pip2, pip3, Conda, and Ubuntu’s apt).\n Editing a list of dependencies or wrangling with package managers doesn’t sound too bad, but PyTorch, the deep learning framework which was key to a lot of this work, had this irritating feature that each release needed a specific version of the Nvidia GPU driver to run. Installing an older GPU driver required root access, which we often didn’t have when working on remote compute clusters. Even if you were doing this on a local machine where you did have root access, the process of installing a new GPU driver was quite slow and tedious. Thanks to Nvidia’s unfriendly driver installers, this process couldn’t be automated, and once you were done, you might succeed in getting a specific release of PyTorch to work, but your other projects couldn’t run anymore, because they needed the latest release instead.\n Researchers are encouraged to publish their code for the sake of replicability, but there’s not much point if nobody else is able to run said code a few months down the line. As such, we started to encourage those wishing to publish their code to rely on containerization using either Docker or Singularity. That fixed issues such as broken Python packages, incompatible versions of PyTorch or TensorFlow and missing libraries on the host system. However, there was another problem, which is that much deep learning code can’t really run fast enough on a CPU alone to be usable. Most of the code we saw required GPU acceleration. The solution to enable that was to use  nvidia-docker, a special version of Docker which allowed code access to the host’s Nvidia GPU drivers. This, however, reintroduced the problem that the code running inside the container needed a special version of the GPU drivers to be installed on the host machine to run correctly. Nvidia’s solution to give people access to GPUs inside a Docker container was to breach the container and expose details of the host system in the process.\n How much time do we collectively waste, every year, fixing bugs due to broken dependencies? How many millions of hours of productivity are lost every single day? How much time do we spend rewriting software that worked just fine before it was broken? In my opinion, code rot is a problem that we ought to try to fix, or at least alleviate. Because of fundamental reasons I’ll discuss later in this post, code rot probably can’t ever be fully eliminated, but I think the situation could be made a lot better through more principled and forward-thinking software engineering. At the very least, the situation would be improved if we acknowledged that code rot is a problem, and understood what causes it to happen in the first place.\n How can we avoid code breakage? Linus Torvalds seems to think that in general, when compiling software, it’s  better to statically link libraries if you can, because very few shared libraries are actually version safe, and with dynamic linking, you’re always adding complexity and exposing yourself to the risk that the system your software is going to get installed on won’t have a compatible version of the libraries you need.\n In my opinion, for software that relies on a package manager, it’s better to fix package version numbers if possible. That is, to specify directly in the manifest of your package which version of each dependency to use. The reason for this is that you unfortunately can’t trust newer version of your dependencies not to make breaking changes, and often, one broken dependency is all it takes to render your software broken. In some cases, programmers may avoid specifying fixed version numbers because package managers such as Python’s pip don’t support having multiple versions of a given package installed at the same time, which could mean that the version of a package you request could clash with other software already installed on a given system. This is a shortcoming that needs to be addressed by package manager if we want to build reliable software.\n There’s another problem though. Part of Python’s appeal is that it makes it easy to link with C code through its Foreign Function Interface (FFI). This is part of what made Python so popular, because it makes it easy for anyone to write a package to interface with commonly available C libraries and benefit from the strength of the C ecosystem. However, this convenience comes at a cost. The FFI is essentially a trap door through which software gets access to external dependencies that can’t be controlled by the package manager, which vastly increases the risk of code breakage. Third party package managers such as Conda try to address this by managing the installation of external libraries as well as Python code, but this can potentially introduce conflicts with Python packages installed through other means.\n In my opinion, the most practical solution to manage with these problems in the real world is to take a conservative and  minimalistic approach to software design. Purposefully minimize dependencies if possible. Don’t add new dependencies unless the value added is really worth the added cost of potential code breakage down the line.  Avoid external dependencies as much as it’s reasonable to do so, and when you do choose to rely on external packages and libraries, pick libraries that have a long history of being stable, well-maintained, backwards compatible and easy to install. Remember that it can take just one broken dependency for your software to fail to run on a user’s system, and if your software breaks, they  might not even tell you it’s broken.\n Good software engineering practices can go a long way towards minimizing the risk of code rot, but I think it’s also valuable to ask ourselves what is the cause of code rot in the first place. Could we possibly build software that doesn’t rot? One interesting observation is that such software does exist, in a sense. People still write software for retro gaming platforms such as the Super NES and the Atari 2600. These platforms are essentially frozen in time, with a fixed set of devices and limited I/O capabilities.  The fixedness of the platform, its simplicity, and the impossibility of relying on external software packages means that any software you write for it is unlikely to be broken by changes in the platform itself.\n The root cause of code rot is change. The world itself is changing, and so is software. As such, the only way to be completely protected from code rot is to target a platform that never changes. Not just the platform itself, but every interface the platform has to the outside, every device, file format and networking protocol. We can’t stop the world from changing, but we can try to build software on more stable foundations. Like San Francisco’s  Millennium Tower, modern software is build on soft soil that keeps shifting under our feet, but it doesn’t have to be that way.\n Although the world does change, many elements of the computing world remain fairly stable. Computer keyboards have been around since the 1950s. Color displays have been around since the 1980s. Touch devices have been commonplace for over a decade. IPv4 was introduced in 1981 and IPv6 in 1995. If I’m writing a program that only needs to read input from a keyboard and pointer device, and display pixels on a screen, there’s no real reason why that program ever needs to break. The APIs for getting input from a keyboard and rendering frames to a display can be extremely simple. The world will keep changing and new I/O devices will be invented, but even 200 years from now, the concept of a keyboard and a color display should be easy to understand and interface with.\n Recently, I’ve been thinking about the design of virtual machines. If we want to create software that doesn’t break, maybe what we need is some kind of executable code archival format. A minimalistic virtual machine with a small set of I/O devices that are interfaced through a small API surface, a small RISC instruction set, and an overall design that’s generally kept as simple and stable as possible. Something like the modern equivalent of a Commodore 64, with a high-resolution color display and the performance of a modern machine. I don’t think something like that would be applicable for every use cases, but I surmise that much of the software we use only really needs to interface with the outside world in fairly simple ways. For example, it needs to get input from the user in terms of mouse clicks or touch devices, it needs to draw pixels to display a user interface, and it might also need to read and write files, and maybe access the network. That software doesn’t fundamentally need to link to any external libraries, everything can be statically linked, it just needs simple, stable interfaces to access the outside world.\n The idea of a  Virtual Machine (VM) isn’t new. The Java VM tried to achieve this but largely failed. Sun Microsystems coined the famous  “write once, run anywhere” slogan, which people began to jokingly mock as “write once, debug everywhere”. In my opinion, the area where most VM designers go wrong is that they tend to expose too many APIs, and each of them has an API surface that is much too large. When an API has a large surface, it’s very easy for subtle bugs and corner cases to creep in. You almost inevitably end up with different implementations of the API behaving in different ways. The Web Audio and Canvas HTML APIs are good examples of this. APIs with a large surface are created because VM designers believe this is more convenient for programmers, and will yield better performance. However, this convenience has a cost, in that it makes code breakage much more likely. Fundamentally, to output audio, one should be able to output a simple list of floating-point samples, and to draw pixels, one should be able to output a grid of pixels. It doesn’t have to be much more complex than that, and if the APIs were kept simpler, they would be much less likely to break.\n In order to minimize the risk of code breakage, API boundaries are not the only thing one has to think about. If your software interfaces with the outside world, you also need to think about file formats and networking protocols. In this area, choosing mature, stable, open standards is generally preferable. I don’t know if my idea of a code archival format, or a virtual machine designed for maximum API stability will see the light of day. For the moment, it remains a thought experiment, but in the meantime, I encourage every developer to think about purposefully minimizing dependencies, about designing smaller, more stable APIs and about packaging their software in a way that will maximize its useful shelf life. Engineering more robust and durable software is one way in which you can improve the lives of a large number of people in small ways and help reduce electronic waste.", "posttime": "2022-02-13 18:57:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,不会,doesn", "title": "不会腐烂的代码", "title_en": "Code That Doesn’t Rot", "transed": 1, "url": "https://pointersgonewild.com/2022/02/11/code-that-doesnt-rot/", "via": "", "real_tags": ["代码", "不会", "doesn"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072935, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Western Digital表示，由于NAND生产设施的污染问题，其闪存存储至少损失了6.5 EB（65亿GB）。据市场研究公司TrendForce称，污染可能导致固态硬盘的主要组件NAND的价格飙升10%。任何潜在的NAND短缺或价格波动可能会影响PC市场在未来几个月，这是另一个大的一年，在2021，尽管全球芯片短缺和对GPU的需求。\n制造过程中使用的材料污染似乎已于1月下旬在日本的两家工厂检测到，Western Digital的合资伙伴Kioxia（前东芝）透露，它已影响到BiCS 3D NAND闪存。\n根据TrendForce的数据，Western Digital和Kioxia的合作关系约占NAND闪存市场的30%。Western Digital和Kioxia主要为PC提供SSD和eMMC存储驱动器，Western Digital是该行业的领先供应商之一。\n目前尚不清楚是什么原因造成了污染，市场上的产品是否需要召回，或者何时恢复生产。Western Digital表示，它正在“与合资伙伴Kioxia密切合作，实施必要的措施，尽快将设施恢复到正常运行状态。”", "note_en": "Western Digital says it has lost at least 6.5 exabytes (6.5 billion gigabytes) of flash storage due to contamination issues at its NAND production facilities. The contamination could see the price of NAND — the main component of SSDs — spike up to 10 percent, according to  market research firm TrendForce. Any potential NAND shortages or price fluctuations could affect the PC market over the next few months, which had  another big year in 2021 despite global chip shortages and demand for GPUs.\n The contamination of materials used in the manufacturing processes appears to have been detected in late January at two plants in Japan, with Western Digital’s joint venture partner, Kioxia (previously Toshiba),  revealing it has affected BiCS 3D NAND flash memory.\n Western Digital and Kioxia’s partnership amounts to around 30 percent of the NAND flash market, according to TrendForce. Both Western Digital and Kioxia primarily supply SSD and eMMC storage drives for PCs, and Western Digital is one of the leading suppliers in the industry.\n It’s not clear what caused the contamination, whether products on the market will need to be recalled, or when production will resume.  Western Digital says it’s “working closely with its joint venture partner, Kioxia, to implement necessary measures that will restore the facilities to normal operational status as quickly as possible.”", "posttime": "2022-02-13 18:56:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芯片,nand", "title": "WD损失650亿GB NAND芯片后，SSD价格可能会飙升", "title_en": "SSD prices could spike after WD loses 6.5 bln gigabytes of NAND chips", "transed": 1, "url": "https://www.theverge.com/2022/2/11/22928867/western-digital-nand-flash-storage-contamination", "via": "", "real_tags": ["芯片", "nand"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072933, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "发布：今天，我想就我们最近在Datadog上发布的一些新的评测功能分享一些想法。我将解释他们做什么，如何工作，以及哪些Go 1.18捐款是为了让事情顺利进行。\n让我们从最终结果开始。假设您有一个100毫秒的跟踪，其中10毫秒用于数据库查询，但90毫秒仍然无法解释。\n发生这种情况时，通常需要研究代码以寻找线索。你忘了一些追踪仪器了吗？是时候添加、重新部署并等待了。或者你需要优化你的围棋代码？如果是，怎么做？\n这个工作流程是可管理的，但事实证明有更好的方法——我们可以使用分析数据来填补空白。这正是我们新的代码热点功能所做的。如下所示，我们的请求占用了90毫秒的CPU时间。这是一个很强的信号，可以让我们排除非CPU活动，如未指令的服务调用、互斥冲突、通道等待、睡眠等。\n更棒的是，当点击“查看配置文件”按钮时，我们可以在CPU时间上查看每个请求的火焰图。这里我们可以看到，我们的时间都花在了JSON编码上。\n由于我们的HTTP处理函数没有出现在堆栈跟踪中，我们还可以间接推断，这项工作是在处理请求的goroutine生成的后台goroutine中完成的。\n除了使用概要文件分解跟踪信息外，我们还可以做相反的事情，按端点分解概要文件的CPU时间，如下所示。复选框可用于按端点过滤配置文件。\n为了更容易理解随时间的变化，例如部署后，我们可以将这些数据绘制成图表。\n这些功能建立在一个名为pprof标签的现有Go功能之上，该功能允许我们将任意键/值对附加到当前运行的goroutine。当生成新的goroutine时，这些标签会自动继承，因此它们会覆盖到代码的所有角落。关键的是，这些标签也集成到了CPU档案器中，因此它们会自动出现在它生成的CPU档案中。\n因此，为了实现这个功能，我们修改了dd trace go库中的跟踪代码，以便在创建新的span时自动应用诸如span id和端点之类的标签。此外，当跨度完成时，我们会注意移除标签。这种实现的简化示例如下所示：\nfunc StartSpan（ctx context.context，端点字符串）*span{span:=&span{id:rand.Uint64（），restoreCX:ctx}标签：=pprof。标签（&#34；span#u id&#34；，fmt.Sprintf（&#34；%d&#34；，span.id），&#34；终点&#34；，终点，）pprof。SetGoroutineLabels（pprof.WithLabels（ctx，labels））返回span}type span结构{id uint64 restoreCtx context.context}func（s*span）Finish（）{pprof.SetGoroutineLabels（s.restoreCtx）}\n我们的实际实现稍微复杂一些，还降低了泄露PII（个人身份信息）的风险。它会自动覆盖contrib包中的HTTP和gRPC包装，以及应用程序可能实现的任何自定义跟踪。\n一旦我们的后端接收到跟踪和分析信息，我们就能够执行为本文前面展示的功能提供动力所需的查找。\n作为实现这些新特性的一部分，我们做了很多测试，包括单元测试、微观基准测试、宏观基准测试等等。正如所料，这在我们的代码中暴露了问题，并允许我们快速修复它们。\n稍微出乎意料的是，我们还在Go运行时中发现了几个问题，这些问题影响了pprof标签的准确性，以及总体上的CPU配置。好消息是，在社区的帮助下，Go维护人员和我们这边的贡献——所有这些问题都在即将发布的Go 1.18版本中得到了解决。\n如果您对这方面的全部细节感兴趣，请查看附带的帖子：Go 1.18中的评测改进。\n也就是说，除非你使用大量cgo，否则Go 1.17中的新功能应该已经非常适合你了。\n我目前正在寻找对这些新功能感兴趣的人，以便获得反馈。\n无论你是现有客户还是潜在客户，只要给我发一封电子邮件，我们就可以设置30分钟的缩放。为了让交易更甜蜜，我也很乐意回答一些常见的问题：）。\n如果想快速入门，只需将下面的代码复制到应用程序中即可。\n此外，您还可以查看这个完整工作的dd trace go演示应用程序，它显示了一个包括HTTP和PostgreSQL的集成。\n包主要导入（&#34；time&#34；&#34；gopkg.in/DataDog/dd trace go.v1/ddtrace/tracer&#34；&#34；gopkg.in/DataDog/dd trace go.v1/profiler&#34；）func main（）{const（env=&#34；dev&#34；service=&#34；example&#34；version=&#34；0.1&#34；）tracer.Start（tracer.WithEnv（env）、tracer.WithService（service）、tracer.WithService（version）、tracer.withprofilercodehospots（true）、tracer.WithProfilerEndpoints（true）、defer（））tracer.Stop err:=profiler.Start（profiler.with服务（service），profiler。WithEnv（env），探查器。WithVersion（version），//在所有范围内，100%的时间内启用CPU分析以捕获热点信息//的功能。目前默认值为25%，但在//下一个dd trace go发行版中可能会发生变化。探查器。CPUDuration（60*time.s），分析器。WithPeriod（60*时间秒），如果出错无{panic（err）}延迟分析器。停止（）/&lt；您的应用程序代码&gt；}\n--Felix Geisendörfer通过RSS或电子邮件订阅此博客，或通过Twitter从我那里获取小的更新。", "note_en": "Published:   Today I’d like to share a few thoughts on a few new  profiling features we recently shipped at Datadog. I’ll explain what they do, how they work, and which Go 1.18 contributions were needed in order for things to work well.\n  Let’s start with the end result. Imagine you have a 100ms trace where 10ms are spent on a database query, but 90ms remain unexplained.\n  When this happens, you usually need to study your code for clues. Did you forget some tracing instrumentation? Time to add it, redeploy and wait. Or perhaps you need to optimize your Go code? If yes, how?\n This workflow is manageable, but it turns out there is a better way – we can use profiling data to fill in the gaps. And that’s exactly what our new  Code Hotspots feature does. As you can see below, our request used 90ms On-CPU time. This is a strong signal that lets us rule out Off-CPU activity such as uninstrumented service calls, mutex contentions, channel waits, sleeping, etc.\n  Even better, when clicking the “View Profile” button, we can view this On-CPU time as a per-request flame graph. Here we can see that our time was spent on JSON encoding.\n  And since our HTTP handler functions don’t show up in the stack traces, we can also indirectly infer that this work was done in a background goroutine spawned by the goroutine handling the request.\n In addition to breaking down tracing information using profiling, we can also do the opposite and break down a profile’s  CPU Time by Endpoint as shown below. The checkboxes can be used to filter the profile by endpoint.\n  And to make it easier to understand changes over time, e.g. after a deployment, we can graph this data.\n   The features are built on-top of an existing Go feature called  pprof labels which allows us to attach arbitrary key/value pairs to the currently running goroutine. These labels are automatically inherited when a new goroutine is spawned, so they reach into all corners of your code. Crucially these labels are also integrated into the CPU profiler, so they automatically end up in the CPU profiles it produces.\n So to implement this feature, we modified the tracing code in our  dd-trace-go library to automatically apply labels such as  span id and  endpoint whenever a new span is created. Additionally we take care of removing the labels when the span is finished. A simplified example of this implementation can be seen below:\n func  StartSpan(ctx context.Context, endpoint  string)  *span {\tspan  :=  &amp;span{id: rand. Uint64(), restoreCtx: ctx}\tlabels  := pprof. Labels(\t\t &#34;span_id&#34;, fmt. Sprintf( &#34;%d&#34;, span.id),\t\t &#34;endpoint&#34;, endpoint,\t)\tpprof. SetGoroutineLabels(pprof. WithLabels(ctx, labels))\t return span} type span  struct {\tid  uint64\trestoreCtx context.Context} func (s  *span)  Finish() {\tpprof. SetGoroutineLabels(s.restoreCtx)}\n Our actual implementation is a bit more complex and also reduces the risk of leaking PII (Personally Identifiable Information). It automatically covers the HTTP and gRPC wrappers in our contrib package, as well as any custom traces your application may implement.\n Once our backend receives the tracing and profiling information, we’re able to perform the lookups needed to power the features showcased earlier in this post.\n  As part of implementing these new features, we did a lot of testing, including unit tests, micro-benchmarks, macro-benchmarks and more. As expected, this surfaced problems in our code and allowed us to quickly fix them.\n Somewhat less expected, we also discovered several issues in the Go runtime that were impacting the accuracy of pprof labels, as well as CPU profiling in general. The good news is that with the help of the community, the Go maintainers and contributions from our end – all of these issues have been fixed in the upcoming Go 1.18 release.\n If you’re interested in the full details on this, check out the companion post:  Profiling Improvements in Go 1.18.\n That being said, unless you use a lot of cgo, the new features should already work great for you in Go 1.17.\n  I’m currently looking for people who are interested in taking these new features for a spin in order to get feedback.\n It doesn’t matter if you’re an existing or potential customer, just  send me an email and we can set up a 30 min zoom. To sweeten the deal, I’m also happy to answer general Go profiling questions along the way :).\n  If you want to get started quickly, you can simply copy the code below into your application.\n Additionally you can check out this fully working  dd-trace-go-demo application that shows an integration including HTTP and PostgreSQL.\n package main import (\t &#34;time&#34;\t &#34;gopkg.in/DataDog/dd-trace-go.v1/ddtrace/tracer&#34;\t &#34;gopkg.in/DataDog/dd-trace-go.v1/profiler&#34;) func  main() {\t const (\t\tenv =  &#34;dev&#34;\t\tservice =  &#34;example&#34;\t\tversion =  &#34;0.1&#34;\t)\ttracer. Start(\t\ttracer. WithEnv(env),\t\ttracer. WithService(service),\t\ttracer. WithServiceVersion(version),\t\ttracer. WithProfilerCodeHotspots( true),\t\ttracer. WithProfilerEndpoints( true),\t)\t defer tracer. Stop()\terr  := profiler. Start(\t\tprofiler. WithService(service),\t\tprofiler. WithEnv(env),\t\tprofiler. WithVersion(version),\t\t // Enables CPU profiling 100% of the time to capture hotspot information \t\t // for all spans. Default is 25% right now, but this might change in the \t\t // next dd-trace-go release. \t\tprofiler. CPUDuration( 60 *time.Second),\t\tprofiler. WithPeriod( 60 *time.Second),\t)\t if err  !=  nil {\t\t panic(err)\t}\t defer profiler. Stop()\t // &lt;your application code&gt; }\n -- Felix Geisendörfer Subscribe to this blog via  RSS or  E-Mail or get small updates from me via  Twitter.", "posttime": "2022-02-13 18:48:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "跟踪,profiling,功能", "title": "将Go分析与跟踪连接起来", "title_en": "Connecting Go Profiling with Tracing", "transed": 1, "url": "https://felixge.de/2022/02/11/connecting-go-profiling-with-tracing/", "via": "", "real_tags": ["跟踪", "profiling", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072932, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为我们的客户&#39；保护，苹果没有&#39；在调查完成、补丁或发布可用之前，不要披露、讨论或确认安全问题。苹果安全更新页面上列出了最新版本。\n适用于：iPhone 6s及更高版本、iPad Pro（所有型号）、iPad Air 2及更高版本、iPad第五代及更高版本、iPad mini 4及更高版本和iPod touch（第七代）\n影响：处理恶意制作的web内容可能会导致执行任意代码。苹果知道一份报告称，这个问题可能已被积极利用。\n有关非苹果制造的产品或非苹果控制或测试的独立网站的信息未经推荐或认可。苹果对第三方网站或产品的选择、性能或使用不承担任何责任。苹果不对第三方网站的准确性或可靠性做出任何声明。有关更多信息，请联系供应商。", "note_en": "For our customers&#39; protection, Apple doesn&#39;t disclose, discuss, or confirm security issues until an investigation has occurred and patches or releases are available. Recent releases are listed on the  Apple security updates page.\n    Available for: iPhone 6s and later, iPad Pro (all models), iPad Air 2 and later, iPad 5th generation and later, iPad mini 4 and later, and iPod touch (7th generation)\n Impact: Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.\n  Information about products not manufactured by Apple, or independent websites not controlled or tested by Apple, is provided without recommendation or endorsement. Apple assumes no responsibility with regard to the selection, performance, or use of third-party websites or products. Apple makes no representations regarding third-party website accuracy or reliability.  Contact the vendor for additional information.", "posttime": "2022-02-13 18:47:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,安全,content,苹果", "title": "关于iOS 15.3.1和iPadOS 15.3.1的安全内容", "title_en": "About the security content of iOS 15.3.1 and iPadOS 15.3.1", "transed": 1, "url": "https://support.apple.com/en-us/HT213093", "via": "", "real_tags": ["ios", "安全", "content", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072930, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络必须为各种规模的用户、广告商和出版商服务——但用户优先。理由很充分：越来越多的人使用互联网来满足更多的日常需求。他们不想事后再考虑隐私问题；他们想要设计隐私。\n理解这一点是我们思考如何构建谷歌分析的核心，谷歌分析是一套日常工具，帮助商业、公共和非营利部门的组织了解访问者如何使用他们的网站和应用程序，但绝不是通过识别个人或跨网站或应用程序跟踪他们。\n由于这些组织中的一些最近面临着分析服务是否能与用户隐私和个人数据国际传输规则兼容的问题，我们想解释一下谷歌分析做了什么，同样重要的是，它没有做什么。\n事实：谷歌分析（Google Analytics）是一项由组织使用的服务，用于了解其网站和应用程序的使用情况，从而使其更好地工作。它不会在互联网上追踪人或分析人。\n谷歌分析无法用于追踪网络或应用程序中的用户。它不会创建用户配置文件。\nGoogle Analytics帮助应用程序和网站的所有者了解他们的用户如何参与他们的网站和应用程序（并且仅限于他们的网站或应用程序）。例如，它可以帮助他们了解在线报纸的哪些部分读者最多，或者购物车被网上商店抛弃的频率。这有助于他们通过更好地了解哪些有效或哪些无效来改善客户体验。\n这类信息还包括所用设备或浏览器的类型；访问者在其网站或应用上的平均花费时间；或者大概是他们的访客来自世界的哪个地方。这些数据点从未用于识别访客或谷歌分析中的任何其他人。\nGoogle Analytics禁止用户上传可能被Google用来识别某人的信息。我们为客户提供数据删除工具，帮助他们在无意中删除服务器上的数据。\n组织使用谷歌分析是因为他们选择这样做。他们，而不是谷歌，控制着收集什么样的数据以及如何使用这些数据。\n他们保留使用Google Analytics收集的数据的所有权，Google只按照他们的指示存储和处理这些数据——例如，向他们提供关于访问者如何使用其网站和应用程序的报告。\n这些组织可以单独选择与谷歌共享其分析数据，以实现技术支持、基准测试和销售支持等特定目的之一。\n组织必须采取明确行动，允许谷歌使用其分析数据来改进或创建新的产品和服务。这些设置完全是可选的，需要明确的选择加入。\n事实：Google Analytics通过为客户提供一系列控制和资源，帮助他们实现法规遵从性。\n当组织使用谷歌分析从他们的网站或应用程序收集数据时，他们会控制这些数据。例如，他们：可以在其网站上启用IP匿名（或IP屏蔽），这意味着永远不会处理或记录完整的IP地址。\n可以选择Analytics存储用户级和事件级数据的时间，然后再将其从Analytics帐户和谷歌服务器中自动删除。\n可以通过提交删除请求从分析服务器中删除数据，包括通过用户删除API、用户浏览器报告或用户探索技术从分析帐户中删除单个用户的数据。\n谷歌生产的产品和功能在默认情况下是安全的，在设计上是私有的，并让用户控制。这就是为什么我们长期以来一直提供一个浏览器插件，允许用户在他们访问的任何网站上禁用Google Analytics的测量功能。\n除了提供强大的默认保护，我们的目标是为人们提供可访问、直观和有用的控制，以便他们能够做出适合自己的选择。例如，访问者可以选择他们访问的网站是否以及如何使用分析cookie，或者阻止所有或部分网站上的所有cookie。\n此外，组织还需要向访问者发出适当的通知，告知他们使用的谷歌分析的实现和功能，以及这些数据是否可以连接到他们拥有的关于他们的其他数据。\n根据其所在国家的适用法律要求，这些客户每次访问都必须获得用户的同意。\n事实：谷歌分析不能用于向人们展示基于健康、种族、性取向等敏感信息的广告。\n谷歌分析根本不提供广告服务。它是一个网络和应用分析工具。（你可以在这里阅读全部内容。）\n一些组织确实会利用通过谷歌分析获得的关于自己网站和应用程序的见解，为自己的广告活动提供信息。\n如果一家企业也使用谷歌的广告平台，那么它必须严格遵守谷歌的广告指南，防止使用敏感信息来个性化广告——比如健康、种族、宗教或性取向。我们绝不允许敏感信息用于个性化广告。这是绝对禁止的。\n事实：一个组织的谷歌分析数据只有在满足特定和严格的隐私条件时才能传输。\n谷歌分析（Google Analytics）在全球（包括美国）运营数据中心，以最大限度地提高服务速度和可靠性。在将数据传输到美国的任何服务器之前，数据会在本地服务器中收集，用户的IP地址会匿名（当客户启用该功能时）。\nGDPR和欧洲法院表示，只要满足条件，就可以出于这种原因将数据转移到欧盟之外。\n为了满足这些条件，我们采取了许多措施，包括：使用欧盟标准合同条款等数据传输协议，这些协议已被确认为向美国传输数据的有效机制，以及保持数据安全的其他保障措施：行业领先的数据加密，我们的数据中心的物理安全，以及处理政府用户信息请求的稳健政策。\n维护国际公认的独立安全标准，如ISO 27001，该标准为我们的系统、应用程序、人员、技术、流程和数据中心提供独立认证。\n为网站所有者提供广泛的控制，他们可以使用这些控制来确保网站访问者数据的安全。\n我们的基础设施和加密旨在保护数据，并保护其免受任何政府访问。\n我们还使用强大的技术措施（如应用层传输安全和HTTPS加密）来防止谷歌基础设施内部、数据中心之间以及用户和网站之间的传输拦截，包括世界各地政府当局的监视尝试。", "note_en": "The web has to work for users, advertisers, and publishers of all sizes — but users first. And with good reason: people are using the internet in larger numbers for more daily needs than ever. They don’t want privacy as an afterthought; they want privacy by design.\n Understanding this is core to how we think about building  Google Analytics, a set of everyday tools that help organizations in the commercial, public, and nonprofit sectors understand how visitors use their sites and apps — but never by identifying individuals or tracking them across sites or apps.\n Because some of these organizations lately have faced questions about whether an analytics service can be compatible with user privacy and the rules for international transfers of personal data, we wanted to explain what Google Analytics does, and just as important, what it does not do.\n  Fact: Google Analytics is a service used by organizations to understand how their sites and apps are used, so that they can make them work better. It does not track people or profile people across the internet.\n Google Analytics cannot be used to track people across the web or apps. It does not create user profiles.\n Google Analytics helps owners of apps and websites understand how their users are engaging with their sites and apps (and only  their site or app). For example, it can help them understand which sections of an online newspaper have the most readers, or how often shopping carts are abandoned for an online store. This is what helps them improve the experience for their customers by better understanding what’s working or not working.\n This kind of information also includes things like the type of device or browser used; how long, on average, visitors spend on their site or app; or roughly where in the world their visitors are coming from. These data points are never used to identify the visitor or anyone else in Google Analytics.\n Google Analytics customers are  prohibited from uploading information that could be used by Google to identify a person. We provide our customers with data deletion tools to help them promptly remove data from our servers if they inadvertently do so.\n  Organizations use Google Analytics because they choose to do so. They, not Google, control what data is collected and how it is used.\n They retain ownership of the data they collect using Google Analytics, and Google only stores and processes this data per their instructions — for example, to provide them with reports about how visitors use their sites and apps.\n These organizations can, separately, elect to share their Analytics data with Google for one of a few specific purposes, including technical support, benchmarking, and sales support.\n Organizations must take explicit action to allow Google to use their analytics data to improve or create new products and services. Such settings are entirely optional and require explicit opt-in.\n  Fact: Google Analytics helps customers with compliance by providing them with a range of controls and resources.\n When organizations use Google Analytics to collect data from their websites or apps, they  control that data. For example, they: Can enable  IP Anonymization (or IP masking) on their websites, meaning that full IP addresses are never processed or logged.\n  Can  select how long user-level and event-level data is stored by Analytics before it’s scheduled for automatic deletion from the Analytics account and Google’s servers.\n Can delete data from the Analytics servers by  submitting a request for its removal — including the ability to delete a single user’s data from their Analytics account via the  User Deletion API, the  User Explorer report, or the  User Exploration technique.\n  Google makes products and features that are secure by default, private by design, and put users in control. That’s why we have long offered a  browser add-on that enables users to disable measurement by Google Analytics on any site they visit.\n Along with providing strong default protections, we aim to give people accessible, intuitive and useful controls so they can make choices that are right for them. For example, visitors can choose if and how Analytics cookies are used by websites they visit, or block all cookies on all or some websites.\n In addition, organizations are required to give visitors proper notice about the implementations and features of Google Analytics that they use, and whether this data can be connected to other data they have about them.\n These customers are also required to obtain consent from users for each visit, as required by applicable laws in their country.\n  Fact: Google Analytics cannot be used to show advertisements to people based on sensitive information like health, ethnicity, sexual orientation, etc.\n Google Analytics does not serve ads at all. It is a web and app analytics tool. (You can read all about it  here.)\n Some organizations do use insights they’ve garnered via Google Analytics about their own sites and apps to inform their own advertising campaigns.\n If a business also uses Google’s advertising platforms, it’s strictly required to follow Google’s advertising guidelines preventing the use of sensitive information to personalize ads — like health, race, religion, or sexual orientation. We never allow sensitive information to be used for personalized advertising. It’s simply off limits.\n  Fact: An organization’s Google Analytics data can only be transferred when specific and rigorous privacy conditions are met.\n Google Analytics operates data centers globally, including in the United States, to maximize service speed and reliability. Before data is transferred to any servers in the United States, it is collected in local servers, where users’ IP addresses are anonymized (when the feature is enabled by customers).\n The GDPR and European Court of Justice say that data can be transferred outside of the European Union for just this sort of reason, provided  conditions are met.\n In order to meet those conditions, we apply numerous measures, including: Using data transfer agreements like EU Standard Contractual Clauses, which have been affirmed as a valid mechanism for transferring data to the United States, together with additional safeguards that keep data secure: industry-leading  data encryption,  physical security in our data centers and robust  policies for handling government requests for user information.\n Maintaining widely recognized, internationally accepted independent security standards like  ISO 27001, which provides independent accreditation of our systems, applications, people, technology, processes and data centers.\n Offering website owners a  wide range of controls that they can use to keep their website visitors’ data safe and secure.\n Our infrastructure and encryption is designed to protect data, and safeguard it from any government access.\n And we use robust technical measures (such as  Application Layer Transport Security and HTTPS encryption) to protect against interception in transit within Google’s infrastructure, between data centers, and between users and websites, including surveillance attempts by government authorities around the world.", "posttime": "2022-02-13 18:39:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,分析,数据", "title": "关于谷歌分析数据隐私的一些事实", "title_en": "Some facts about Google Analytics data privacy", "transed": 1, "url": "https://blog.google/around-the-globe/google-europe/google-analytics-facts/", "via": "", "real_tags": ["谷歌", "google", "分析", "数据"]}]