[{"category": "", "categoryclass": "", "imagename": "3d13185b58996873af33c33ddba7c2e6.jpg", "infoid": 1002047, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我回顾2020年的XPS 17 9700和XPS 15 9500之前，以下是我对XPS 17 9700和XPS 15 9500的早期印象。在很多方面都比苹果MacBook好，这些都是…", "note_en": "Before a I review the XPS 17 9700 and XPS 15 9500 for 2020, here are my early hands on impressions. Better than an Apple MacBook in many ways, these are the ...", "posttime": "2020-05-14 08:23:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dell,早期", "title": "全新Dell XPS 17(和15)预览版", "title_en": "New Dell XPS 17 (and 15) preview", "transed": 1, "url": "https://www.youtube.com/watch?v=XyRUWM_LOPQ", "via": "", "real_tags": ["dell", "早期"]}, {"category": "", "categoryclass": "", "imagename": "8be1075bb2aef2c45e8683a736d00284.jpg", "infoid": 1002046, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在法国东南部Causse MéJean高原下的一个洞穴的屋顶上发现了蜥脚类恐龙的脚印，这种30米长的食草恐龙位于法国东南部的Causse MéJean高原下。CNRS新闻采访了古生物学家让-大卫·莫罗(Jean-David Moreau)，他发表了一篇关于这一惊人发现的文章。\n2015年12月的一天，一群业余洞穴探险家进入法国东南部洛泽尔省的卡斯特尔布克洞穴，进行了一次不寻常的郊游。因为在洞穴内，洞穴新手很受欢迎，只能通过一条又长又窄的通道进入，他们偶然发现了一个数百万年来一直没有被观察到的宝藏：巨大恐龙的足迹，在“大隧道”的屋顶上清晰可见，这个洞穴长80米，宽20米，高10米。\n位于法国东北部第戎的生物地理科学实验室的古生物学家让-戴维·莫罗(Jean-David Moreau)作为洛泽尔古生物学协会(Lozère Palaeology Association)的负责人，组织了那天的洞穴探险活动，他说：“令人难以置信的是，成千上万的人从这个洞穴里经过，却什么也没看到。”莫罗仍然目瞪口呆，他是位于第戎(法国东北部)的生物地理科学实验室的古生物学家。“只需要一个人比往常更仔细地观察天花板，它们就在那里，清晰可见：显然是巨型恐龙留下的脚印。”\n仅用它们的前大灯发出的光来识别它们并不是一件容易的事情，莫罗和他的团队不得不多次返回以确认他们的惊人发现：1.7亿年前的中侏罗世蜥脚类恐龙留下的三条20米长的足迹。蜥脚类恐龙是四条腿的食草恐龙。“在两条轨道上，你可以看到交替的脚印和手印，手的形状是半月形。有些脚印既有爪子，也有五个脚趾，“科学家解释说。这些最大的恐龙长1.25米，是世界上发现的最大的恐龙之一，它们是由大约30米长的动物制作的。\n这一发现在很多方面都是史无前例的。首先，以前从未在世界任何地方的洞穴中发现过巨大的恐龙脚印。但这也是考西斯盆地首次发现蜥脚类脚印，尽管古生物学家已经在那里发现了大量的遗迹化石。该地区面积数百平方公里，横跨埃韦龙、洛泽尔、加德和赫罗省，拥有数十个遗迹化石遗址。然而，到目前为止，还没有发现这种巨大的食草动物的遗迹。\n“考塞斯盆地，也被称为考塞斯湾，记录了侏罗纪的整个地质历史，持续了5500万年，”莫罗说，他是古生物学的一个分支，专门研究遗迹化石。在此期间，海洋三次从该地区撤退，使恐龙得以在那里定居：2亿年前、1.68亿年前--当时卡斯特尔布克足迹已经确定日期--以及1.45亿年前。随着时间的推移，沉积物不断积累，地质层层堆积。在恐龙居住在那里数百万年后，水渗入了这个喀斯特环境的石灰岩和粘土中，最终形成了考斯山脉中发现的数百个天然洞穴。这就解释了为什么可以在洞穴的屋顶上看到恐龙的足迹，这一开始可能看起来有点违反直觉！\n“地质地层没有发生任何剧变。我们看到的痕迹实际上是石膏，与蜥脚类动物的脚底相对应，“莫罗解释说。“这就像是从下面看恐龙留下的足迹。事实是，渗入的水侵蚀了包含脚印的沉积层下面的岩石。“。\n这位专门研究植物化石和痕迹化石的古生物学家能够重建1.7亿年前蜥脚类动物生活的生态系统。“我们发现了植物，特别是针叶树的残留物，以及少量的咸水鱼残留物。对洞穴中的沉积物进行的分析告诉我们，它位于陆海交界处，很可能是在一个被针叶树包围的泻湖边缘。“\n这一发现带来的兴奋培养了这位研究人员对格兰德考斯地质丰富地区的热情，他希望在那里找到更多蜥脚类动物存在的痕迹。“除了继续探索传统上发现足迹的表面和露头，我们现在还将非常仔细地观察该地区丰富的天然洞穴的屋顶，”莫罗说，他已经开始鼓励该地区的洞穴探险者寻找新的证据。\n本新闻稿中的材料来自发起机构。内容可以针对样式和长度进行编辑。有问题吗？让我们知道。每天早上一封电子邮件，里面有我们的最新帖子。从医学研究到太空新闻。从环境到能源。从技术到物理。", "note_en": "The footprints of sauropods, thirty-metre-long herbivorous dinosaurs, have been found on the roof of a cave located beneath the Causse Méjean plateau, in southeastern France. CNRS News talked to the palaeontologist Jean-David Moreau, who has published an article about this astonishing discovery.\n One day in December 2015, a goup of amateur potholers entered the Castelbouc cave, in the Lozère department in southeastern France, for what turned out to be no ordinary outing. For inside the cavern, which is very popular with novice cavers and only accessible via a long, narrow passage, they came across a treasure trove that had remained unobserved for millions of years: the tracks of huge dinosaurs, clearly visible on the roof of the “great tunnel”, a chamber 80 metres long, 20 metres wide and 10 metres high.\n  “What’s so incredible is that thousands of people have passed through this cave without ever seeing a thing,” says a still dumbfounded Jean-David Moreau, a palaeontologist at the Biogeosciences Laboratory in Dijon (northeastern France) who, as head of the Lozère Palaeontology Association, organised the potholers’ outing that day. “All it took was for one person to take a closer look than usual at the ceiling, and there they were, clearly visible: the tracks of footprints apparently made by giant dinosaurs.”\n Identifying them with the light from their headlamps alone was no easy task, and Moreau and his team had to return several times to confirm their amazing find: three twenty-metre-long trails left by sauropods, four-legged herbivorous dinosaurs from the Middle Jurassic, 170 million years ago. “In two of the trackways, you can see alternate foot- and handprints, the hands being identified by their half-moon shape. Some of the footprints show five toes as well as claws,” the scientist explains. “The largest are 1.25 metres in length, making them among the biggest ever identified worldwide, and were made by animals that must have measured around 30 metres.”\n The discovery is unprecedented in more ways than one. To begin with, giant dinosaur prints had never been previously discovered in a cave anywhere in the world. But it is also the first time that sauropod footprints have been found in the Causses basin, even though palaeontologists have already uncovered a wealth of trace fossils there. The region, with an area of several hundred square kilometres and straddling the departments of the Aveyron, Lozère, Gard and Hérault, boasts dozens of trace fossil sites. However, no vestige of the giant herbivores had ever been spotted until now.\n “The Causses basin, also called the Causses gulf, recorded the entire geological history of the Jurassic, which lasted for 55 million years,” says Moreau, who is a specialist in ichnology, the branch of palaeontology concerned with the study of trace fossils. “During this period, the sea retreated three times from the region, enabling dinosaurs to settle there: 200 million years ago, 168 million years ago – when the Castelbouc tracks are dated – and 145 million years ago.”  Sediments accumulated over time, and geological layer after layer was laid down. Millions of years after the dinosaurs lived there, water infiltrated the limestones and clays of this karst environment, eventually forming the hundreds of natural cavities found in the Causses. Which explains why dinosaur tracks can be seen on the roof of a cave, which at first might appear somewhat counter-intuitive!\n “There hasn’t been any upheaval in the geological strata. The trails that we see are actually casts, corresponding to the base of the sauropods’ feet,” Moreau explains. “It’s as if you were looking at the tracks left by the dinosaurs from below. What happened is that infiltrated water eroded the rock beneath the sedimentary layer which contains the footprints.”\n  The palaeontologist, who specialises in plant fossils as well as trace fossils, was able to reconstruct the ecosystem in which the sauropods lived 170 million years ago. “We found plants, in particular remains of conifers, and small remnants of saltwater fish. An analysis of the sediments carried out in the cave told us that it was at the land-sea interface, probably on the edge of a lagoon surrounded by conifers.”\n The excitement generated by the discovery has nurtured the researcher’s passion for the geologically rich region of the Grands Causses, where he hopes to find more traces of the sauropods’ presence.   “As well as continuing to explore the surfaces and outcrops where footprints are traditionally found, we’ll now be taking a very close look at the roofs of the abundant natural cavities in the area,” says Moreau, who has already started to encourage the region’s potholers to be on the lookout for fresh evidence.\n    The material in this press release comes from the originating organization. Content may be edited for style and length. Have a question?  Let us know. One email, each morning, with our latest posts. From medical research to space news. Environment to energy. Technology to physics.", "posttime": "2020-05-14 08:22:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "洞穴,footprints", "title": "洞穴天花板上的恐龙脚印", "title_en": "Dinosaur Footprints on a Cave Ceiling", "transed": 1, "url": "https://scienceblog.com/516341/dinosaur-footprints-on-a-cave-ceiling/", "via": "", "real_tags": ["洞穴"]}, {"category": "", "categoryclass": "", "imagename": "5a92324bc08625e396b5a0938953d9c1.jpg", "infoid": 1002045, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员设计了一种名为“Sapple”的系统，该系统只需在一个人的家中放置两个传感器，就可以确定炉子、吹风机等设备的使用模式。有一种位置传感器可以使用无线电信号来确定位置，用户只需在自己的空间范围内走动就可以校准它，以覆盖他们的区域。第二个传感器测量整个家庭的能源使用情况，并将该数据与移动信息相结合，以将能源使用信号与特定申请者的物理位置相匹配，从而提供人们何时使用房子周围的电器以及使用多久的数据。\n这绕过了许多类似系统提出的问题，包括更简单的单独使用的电压表。虽然家用电器确实倾向于有特定的能源使用模式，这意味着你可以仅仅根据消耗来识别它们，但单凭这些数据很难判断它们是在什么时候以及如何使用的。这些信息可以让卫生专业人员知道病人是否注意卫生、食物准备和摄取等。\n当然，这个系统听起来确实像是一个有很多潜在隐私陷阱的系统，但它的预期用途是针对特定情况，比如为需要它的老年人口提供有监督的护理，同时仍然保留资源和实现更好的距离，这实际上是目前更紧迫的需求，因为我们正在继续研究如何在冠状病毒大流行的背景下解决护理问题。\n这是一个聪明的系统，除了两个简单的传感器外，它不需要任何特殊的智能物联网设备就可以工作，基本上也不需要接受护理的患者的任何技术专业知识。", "note_en": "The researchers devised a system called “Sapple” that uses just two sensors placed in a person’s home to determine use patterns of devices including stoves, hair dryers and more. There’s one location sensor that works using radio signals to figure out placement, with a user able to calibrate it to cover their area by simply walking the bounds of their space. A second sensor measures energy usage through the home, and combines that data with movement information to matching energy use signals with physical locations of specific applicants, to provide data both when a person is using the appliances around the house, and for how long.\n This gets around a lot of the issues raised by similar systems, including more simple voltage meters used on their own. While appliances do tend to have specific energy use patterns that mean you can identify them just based on consumption, it’s hard to tell when and how they’re being used with that data on its own. This info can let health professionals know if a patient is taking proper care of hygiene, food preparation and intake and more.\n  Of course, the system does sound like one that has a lot of potential privacy pitfalls, but its intended use is for specific cases, like providing supervised care of aging populations that need it while also still preserving resources and enabling better distancing, which is actually a more urgent need right now as we continue to figure out how to address caregiving in the context of the COVID-19 pandemic.\n It’s a clever system in that it doesn’t require any special smart IoT devices to work, beyond the two simple sensors, and essentially also doesn’t require any technical expertise on the part of the patients receiving care.", "posttime": "2020-05-14 08:09:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "app,开发,家用电器,develops", "title": "麻省理工学院开发了一种使用家用电器的无线信号来更好地了解您的健康的方法", "title_en": "MIT Develops a Way To Use Wireless Signals From In-Home Appliances To Better Understand Your Health", "transed": 1, "url": "https://techcrunch.com/2020/05/13/mit-develops-a-way-to-use-wireless-signals-from-in-home-appliances-to-better-understand-your-health/", "via": "", "real_tags": ["app", "开发", "家用电器", "develops"]}, {"category": "", "categoryclass": "", "imagename": "e53059a205c0972fd3adb8ec1213cb4e.jpg", "infoid": 1002044, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经济学家和政策制定者普遍表示，经济遭受的损失将超过最初的预期。民主党人提出了另一项3万亿美元的刺激法案。美联储主席杰罗姆·鲍威尔(Jerome Powell)警告称，如果不通过另一项刺激法案，将造成永久性的经济损害。根据鲍威尔的说法，收入低于4万美元的美国家庭中，有40%的人在3月份失去了工作。\n正在绘制的情景显示，复苏至少需要到2021年第一季度。", "note_en": "Across the board, economists and policymakers are saying the economy will suffer more than initially expected. The Democrats are suggesting  another  $3 Trillion stimulus bill. Jerome Powell, the Chair of the Federal Reserve, warned of   permanent economic damage if another stimulus bill is not passed. According to Powell, &#34;40 percent of American households earning less than $40,000 lost jobs in March&#34;.\n The scenarios being painted show a recovery that will take, at minimum, until Q1 2021.", "posttime": "2020-05-14 08:07:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,经济,won", "title": "冠状病毒经济：我们要到2022年才能复苏", "title_en": "The Covid-19 Economy: We won't recover until 2022", "transed": 1, "url": "https://chimerais.com/covid19-may13-prospects", "via": "", "real_tags": ["病毒", "冠状病毒", "经济", "won"]}, {"category": "", "categoryclass": "", "imagename": "7b9495456b519ba89fa9e39cb920afb6.jpg", "infoid": 1002043, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(CNN Business)JCPenney正在为拖欠债务而苦苦挣扎，并为可能的破产申请做准备，它批准了向四名高管发放100万美元或更多的奖金。\nJCPenney赢得了对其破产计划的置评，但该公司披露，它最近未能偿还两笔债务：4月15日到期的1200万美元债券持有人，以及上周四到期的1700万美元信贷额度。这些拖欠款项的宽限期是本周的周四和周五，这表明破产申请可能迫在眉睫。\n但该公司周一晚间宣布，已向首席执行官吉尔·索尔陶(Jill Soltau)支付了450万美元的奖金，并向首席财务官比尔·沃费尔、首席商人米歇尔·瓦兹洛(Michelle Wlazlo)和首席人力资源官布林·埃文森(Brynn Evanson)各支付了100万美元的奖金。JCPenney表示，高额发薪日是为了留住其顶尖人才。\n一家公司在一份声明中表示：在JCPenney，我们正在做出艰难而审慎的决定，以保护公司的未来，并驾驭不确定的环境，包括采取必要措施留住我们才华横溢的管理团队。\n根据该计划，如果高管在2021年1月31日之前辞职，他们将必须偿还80%的奖金。如果特定的基于里程碑的业绩目标没有实现，他们将不得不偿还另外20%。\n他们还必须放弃本财年任何年度奖金计划或长期激励奖励的权利，并放弃他或她所有未偿还的股权或过去奖励的期权。但考虑到该公司的财务问题，本财年的奖金不太可能发放，而且JCPenney股权的任何持有者都可能在破产申请中被扫地出门。\n该公司表示，在冠状病毒大流行迫使公司关闭大部分门店之前，高管们一直在推动公司扭亏为盈。\n该公司表示，保持领导层的连续性是并将继续对我们公司的长期成功至关重要。我们的薪酬计划与类似情况下的其他公司的薪酬计划是一致的，并与基于里程碑的业绩目标保持一致，以继续激励我们的团队推动业绩。\n破产申请通常包括大幅裁员，在许多情况下，那些被解雇的员工无法获得通常随着失业而获得的遣散费。破产法给予债权人优先于员工遣散费的权利。\n如果任何一位高管不得不偿还奖金，这笔钱将留出用于支付遣散费。但作为重组的一部分，如果他们的门店关闭，JCPenney的一些员工可能会失去工作。截至2月1日，该公司约有9万名员工。\n本周早些时候，全国近850家JCPenney门店中有16家重新开业。周三，另有25家门店宣布开业。它还有另外13家商店允许路边提货，尽管这些地点不允许购物者进入商店。", "note_en": "New York (CNN Business)As JCPenney struggles with missed debt payments and prepares for a possible bankruptcy filing, it approved bonuses of $1 million or more to its top four executives.\n JCPenney won&#39;t comment on its bankruptcy plans, but it disclosed that it  missed two recent debt payments: $12 million due to bond holders on April 15, and a $17 million payment due on a credit line this past Thursday. The grace periods for those missed payments are Thursday and Friday this week, suggesting a bankruptcy filing  could be imminent.\n But the company announced Monday evening it has paid a $4.5 million bonus to CEO Jill Soltau, and bonuses of $1 million each for CFO Bill Wafford, Chief Merchant Michelle Wlazlo and Chief Human Resources Officer Brynn Evanson. JCPenney said the big paydays are designed to keep its top talent on board.\n   &#34;At JCPenney, we are making tough, prudent decisions to protect the future of our company and navigate an uncertain environment, including taking necessary steps to retain our talented management team,&#34; said a company in a statement.\n Under the plan, the executives will have to repay 80% of their bonuses if they resign before January 31, 2021. They will have to repay the other 20% if specified milestone-based performance goals are not achieved.\n  They must also forfeit the right to any annual bonus plans or long-term incentive awards for the current fiscal year, as well as forfeit all of his or her outstanding equity or options for past awards. But bonuses for this fiscal year are unlikely considering the company&#39;s financial problems, and any holders of  JCPenney  (  JCP) equity are likely to be wiped out in a bankruptcy filing.\n The compansaid the executives had been making progress turning the company around before the Covid-19 pandemic forced it to close the majority of its stores.\n &#34;Maintaining continuity of leadership is and will continue to be critical to the future of our company&#39;s long-term success,&#34; said the company. &#34;Our compensation program is in line with those of other companies in similar situations and is aligned with milestone-based performance goals to continue incentivizing our team to drive results.&#34;\n  Bankruptcy filings often include deep job cuts, and in many cases, those employees who are laid off are  unable to get the severance payments that they would normally receive with the loss of their jobs. Bankruptcy law gives a preference to creditors over employee severance payments.\n   If any of the executives have to repay bonuses, the money will be set aside to pay severance. But there are a number of JCPenney employees who could lose their jobs if their stores close as part of a reorganization. The company had about 90,000 employees as of February 1.\n Earlier this week, 16 JCPenney stores out of nearly 850 nationwide reopened. Another 25 openings were announced Wednesday. And it has another 13 stores allowing curb-side pickup, although those locations are not allowing shoppers to go inside the stores.", "posttime": "2020-05-14 08:06:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发放,execs", "title": "JCPenney在可能申请破产的最后期限之前向高管发放奖金", "title_en": "JCPenney gives execs bonuses ahead of deadline for possible bankruptcy filing", "transed": 1, "url": "https://edition.cnn.com/2020/05/13/investing/jcpenney-bankruptcy-bonuses/index.html", "via": "", "real_tags": ["发放", "execs"]}, {"category": "", "categoryclass": "", "imagename": "9f2f145f3d2cc13a40e23379b0ac79ed.jpg", "infoid": 1002042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dieter Klein曾前往欧洲和美国的偏远角落寻找并拍摄被遗弃的汽车。\n这位德国自由摄影师在破旧的后院、尘土飞扬的谷仓、荒芜的田野和茂密的森林中找到了他的主题。\n在旅行中，克莱恩拍摄了一辆凹陷的保时捷、一辆褪色的凯迪拉克、一辆破旧的大众甲壳虫和一整队被遗弃的军用吉普车等照片。\n这160张照片展示了汽车和老爷车昔日的魅力-以及大自然宣称的力量。\n克莱恩在科格纳克市附近的法国自行车旅行中意外发现了他的第一辆被遗弃的汽车后，开始了他的搜索。\n我可能会开门或关门，但通常我甚至不会碰汽车。\n最古老的是一辆1907年的福特T型车，在内华达州一个前矿业小镇的一个小博物馆前。\n自从天气变了，我看到了很多光线不同的场景和不同的拍摄角度。\n在他去世的前两天，他父亲把车停在了他家门外。\n自1977年以来，他就没有使用过这处房产、房子和汽车，并留下了这一幕，作为记忆，就像它现在的样子。\n日落后，我得到了奖励-柔和的光线使云彩变得有点粉红色。\n[它创造了]一个近乎超现实的场景--奇怪、平静、平静和矛盾，一个童话故事。", "note_en": "Dieter Klein has travelled to remote corners of Europe and the US to find and photograph abandoned cars.\n  The German freelance photographer finds his subject matter in shabby backyards, dusty barns, deserted fields and thick forests.\n   On his travels, Klein has shot images of a dented Porsche, a faded Cadillac, a battered VW Beetle and a whole fleet of abandoned military Jeeps, among others.\n  The 160 images reveal the bygone glamour of the automobiles and classic cars - and the might of nature as it claims them.\n  Klein began his search after discovering his first abandoned car by accident, while on a bicycle tour through France, near the city of Cognac.\n      &#34;I might open or closed a door but usually I don&#39;t even touch the cars.&#34;\n  The oldest was a 1907 Ford Model T, in front of a small museum in a former mining town in Nevada.\n   &#34;And since the weather changed, I got a lot of light situations and different camera angles.\n     &#34;His father had parked the car outside his house two days before he passed away.\n &#34;He has not used the property, the house and the car since 1977 and leaves this scene, as a memory, just as it is.&#34;\n  &#34;After sunset, I got the reward - soft light that made the clouds a little pink.\n &#34;[It created] an almost surreal scene - strange, peaceful, calm and contradictory, a fairy tale.&#34;", "posttime": "2020-05-14 07:52:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "汽车,beauty", "title": "欧洲和美国各地被遗弃的汽车褪色的美丽", "title_en": "The faded beauty of abandoned cars across Europe and the US", "transed": 1, "url": "https://www.bbc.co.uk/news/in-pictures-52632396", "via": "", "real_tags": ["汽车", "beauty"]}, {"category": "", "categoryclass": "", "imagename": "7b1455566bc1adff533760a4875f449f.jpeg", "infoid": 1002041, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一名网络开发人员是困难的、有压力的、令人困惑的和令人精疲力竭的。但是，它也是非常令人兴奋、有趣和有意义的。在我年轻时成为一名网络开发人员的旅途中，我学到了很多东西。这里是我学到的20个教训，它们将帮助你成为一名更好的网络开发人员，并在生活中取得更大的成功。\n你可能休息得不够。没有足够的休息时间可能会导致精疲力竭，感觉没有动力继续工作。只要每小时起床伸展一下身体，吃点东西，喝点水。\n让你的大脑有时间休息可以帮助你找出你想要解决的问题的解决方案。每隔1-2小时休息一次，你会想得更清楚。\n如果你不向别人寻求帮助，那么你就错过了学习和提高的机会。当你不知道答案或者只是不确定的时候，不要向别人寻求帮助，这是一个学习和成长的好方法。\n许多网络开发人员可能认为寻求帮助会让他们看起来和听起来都很愚蠢，但实际上，这会让你看起来很感兴趣，很自信。\n向他人(你的客户、经理、同事)寻求帮助，可以帮助你避免未来的错误，并帮助你成为一名更好的Web开发人员。不寻求帮助会导致你在学习和工作上浪费时间。\n让其他网络开发人员在你身边回答问题甚至比有一本教程或一本书更好。他们可以直接回答你的问题，帮助你真正理解这个概念。\n以一种视觉上干净、安全和高效的方式编写您的代码。这适用于任何语言或框架。您可能需要做额外的研究才能找到编写干净代码的方法。\n不要在代码中重复自己，这将节省您的时间、精力，并且其他Web开发人员使用起来也容易得多。您还应该最小化您的CSS、JS和图像。\n一定要注意代码的性能。最后，测试您的代码。单元测试可以防止您在代码和应用程序中遇到未来的问题。从一开始就花时间正确编写代码。\n永远把自己当成一个学生，因为没有哪个开发人员什么都懂。如果你停止学习和阅读，你就会落后。\n即使你的工作不要求你学习新的东西，你也绝对应该每天花时间去学习新的东西。如果你失业了，这会增加你找到另一份工作的机会。\n编程要花很多时间，事情总是在变，你必须学习更多。与其认为你的生产力不够高，不如设定一个时间限制，让你每天编码多长时间。\n一定要在工作之余与家人和朋友共度美好时光。它们不仅会激励和激励你更加努力地工作，而且你还可能解决以前不用电脑就解决不了的问题。\n有让你快乐的有趣的爱好，不要太担心未来。最重要的是照顾好你的身心健康。\n一旦这件事处理好了，你就必须每天分配有质量的时间与家人和朋友在一起。最后，你应该努力工作，制作让世界变得更美好的网站或应用程序。\n团队有时会很困难，因为一些开发人员可能会对您粗鲁和愤怒。然而，如果你让别人说的话和做的事影响你，你的生活将会比应有的更艰难和更有压力。\n冷静地说你会处理好工作环境中的任何潜在冲突，这样就能迅速解决它。把责任交给你，你就不必担心团队中的另一名成员对你无礼，无法完成任务(这可能会导致更多的冲突)。\n如果你的团队中有人不听你的理由，你可以去找你的经理。然而，只有当这是一个严重的问题并且阻碍你完成你的工作时才这么做。如果你的工作受到严重影响，就向经理提出。\n作为一名网络开发人员，你会犯很多错误。这没有什么错，但是，如果你一直犯错误，而且你没有从中吸取教训，那就有问题了。要从你的错误中吸取教训，就要找出错误的原因。\n然后，想一想是否可以有一个流程来防止你再次犯错误。如果早点发现错误，你能避免自己犯错误吗？学习web开发是困难的，但当你从错误中学习时，它就会变得容易起来。\n确保你知道自己为什么会犯这个错误，知道如何防止下次再犯错误，然后从中吸取教训，继续前进。\n大多数情况下，当与他人一起工作时，人们是真心想帮助你，教你如何解决问题。你应该学会区分建设性批评和破坏性批评。\n采纳他人的建设性批评是学习和改进网络开发的最好方式之一。如果你应用这个建议，你会成为一名更好的开发人员。\n直到最近，我还很难接受建设性的批评。尽管有时我收到的严厉批评是有帮助的，但我把它理解错了。\n然而，我知道有些事情必须改变。我需要快点好起来。因此，在我收到的每一条批评(不管有没有建设性)之后，我把自我放在一边，从中吸取了教训。当我开始积极地接受批评时，我在前端网站开发、如何编写内容和学习新事物方面都有了显著的进步。\n冒险是.有风险的。你不知道一旦你做了一个冒险的决定会发生什么。你的生活可能会变得更好，也可能会变得更糟。在我的网络开发之旅中，冒险一直是很重要的一部分。有很多时候我无法决定下一步应该追求什么。\n然而，我发现，承担经过计算的风险才是解决这个问题的办法。你必须知道如果你做某事或计划将来做某事，可能会发生什么。\n一旦你知道了最好的选择，就选择那个选项。所以，让我们假设你正在努力决定接受什么样的工作机会。其中一人工资较高，但没有在家工作的自由。另一种工资较低，但让你可以自由地在家工作，并向你的经理学习新事物。你会选择哪份工作？\n我自己过去犯了这个错误，我很内疚。这发生在我们当中最优秀的人身上。在编程中受挫是不可避免的，但如果你放弃了，你所做的一切都是徒劳的。在你戒烟之前，找出所有可能的方法来解决摆在你面前的问题。\n当然，您从事的某些项目可能会非常困难。有些项目应该放弃。然而，你应该寻求帮助，搜索所有的路线，尝试一些不同的东西，使用不同的技术，休息很长一段时间，把项目放在一边，这会大大帮助你在放弃之前完成项目。成功可能就在眼前。\n有一次，我在为我的第一个客户做一个投资组合，我无法决定是应该使用Python Flask作为后端，还是只将静态HTML网站与Facebook连接起来。\n经过两天紧张的编码和决策，我决定将静态HTML网站与Facebook连接起来。这在当时对我来说是最简单的选择，我仍然很高兴我选择了那个选项。\n最终的结果不需要Python Flask的后端，甚至根本不需要后端。我的客户只需要一个简单而静态的网站来展示他的照片。这是我在网络开发过程中学到的最重要的一课。过早放弃不是一种选择。找出你有哪些选择，然后选择最好的。\n傲慢不仅会让与你共事的其他人很难相处，也会让你很难相处。如果你认为你什么都知道，你就不会积极地倾听别人来了解更多。把你的自尊心放在一边，要尊重别人，不要对任何人说三道四。\n傲慢的后果是巨大的。你不仅可能被解雇，还会失去别人的尊重。在我竭尽全力改掉这个坏习惯多年之后，我终于改掉了它。自从我不再傲慢之后，我学到了比以前多得多的东西，并且记住了我所学到的东西。\n正确地与任何人沟通对于解决复杂问题和完成更多工作至关重要。如果你沟通时没有愤怒和压力，你也会感觉更好。\n我对网络开发、构建东西和撰写令人惊叹的内容有着巨大的热情。尽管我充满激情，但有时网络开发可能会有压力，甚至有点无聊。\n在这些时刻，我专注于最终目标。我的最终目标是经济独立，这样我就可以周游世界，结识了不起的人，做一些很酷的事情。你的最终目标是什么？\n你必须专注于最终目标，这样当你正在经历困难的项目时，你才能度过难关，并在这样做的同时感到动力十足。\n当你从事有趣的项目时，你可能会从中获得乐趣。如果你正在做一个具有挑战性的项目，情况可能正好相反。这就是您应该将它们合并在一起的原因。\n你应该找到你感兴趣的困难项目。例如，我喜欢构建帮助他人的工具。然而，至少可以说，使用编程构建工具是具有挑战性的。\n你必须有一个想法、一个问题或一个你想纠正的错误。如果你从一开始就不够热情，你就永远不会坚持到底。\n生活中的一切都是如此。当你从事你热爱的项目时，由于你有多么热爱你所做的事情，你在工作过程中面临的困难将是可控的。\n要想在生活中取得任何成功，你必须首先学习。无论是如何调试Javascript错误消息，还是如何在Python Flask中构建复杂的应用程序。你必须先学会。\n一旦您对一个概念有了扎实的理解，那么您就必须使用您所学到的知识来构建项目。在你建造了那个项目之后，你必须学会如何改进它。学，做，学。\n直到2020年初，我甚至不知道SEO，更不用说每天用它来给我的网站在搜索引擎中排名了。我了解到，您的业务需要搜索引擎优化，因为它将带来长期收益和流量。\n你需要着眼于长期，而不是短期，才能让你的业务持续、有机地发展。用页面上的SEO优化你的网站，或者雇个人来做。你还应该雇佣一些人来撰写深度内容，这些内容将帮助你的在线业务增长，并为你的网站带来更多的流量，而不需要在广告上花费任何钱。\n免费为人们制作令人惊叹的网站是我在网络开发人员生涯中犯下的最大错误之一。你不能犯这个错误。当你受雇为某人建网站时(即使很简单)，你必须收费。\n如果你向某人提供他们没有的宝贵技能，你必须向他们收取你的工作费用。毕竟，你是在为他们提供价值，当你拥有一套有价值的技能时，你就会为此收费。我在我的如何学习Web开发的指南中更详细地讨论了这一点。\n如果你正在建立一个只有HTML和CSS的1页网站，这并不重要，你仍然要为你的工作收费。现在，计算出你收了多少钱可能是件棘手的事。你必须知道你的技能值多少钱。你可以通过找出你所提供的服务类型的平均工资来做到这一点。\n努力工作对于成功做任何有价值和有意义的事情都是必要的。但是，你需要休息一下。像其他许多人一样，我每周休息25个小时，不使用电子产品，每周一次。这很大程度上帮助我不会精疲力竭，并让我更享受我所做的事情。\n退一步让我有机会思考我完成了什么，以及我如何才能做得更好。我注意到，自从我每周都后退一步以来，我整个星期的工作效率都提高了很多。\n我不仅在网站开发方面变得更好了，我在学校的成绩也有了显著的提高。每周有一天从工作和电子产品中抽出一步来思考你已经做了什么，以及如何能做得更好，这会帮助你在整个星期都更有效率。\n在完成一个项目后，无论大小，做一些有趣的事情来奖励自己的辛勤工作。你可以给自己买你最喜欢的甜点，骑自行车，或者看一个男人打拳击的史诗般的视频。这将帮助你在完成困难的项目时保持动力，因为你知道一旦你完成了它们，你就会得到奖励。\n通过您学习Web开发、构建项目和为他人工作的经验，您将学到很多东西。把你学到的东西教给别人是帮助其他网络开发人员变得更好的好方法。\n当你教给其他人时，你也会帮助你的大脑在实践层面上理解你所学到的东西。这就是我的博客和播客的全部内容。它涵盖了我在很小的时候通过学习网络开发、克服挑战和从事困难的项目所学到的一切。\n如果你没有自己的网站，那你就错失良机了。拥有自己的网站，展示你建立的、完成的和学到的东西，对于在数字世界中成为一名成功的企业家至关重要。通过公开展示你的工作，你可以得到你梦想中的工作。\n通过展示你的成就，你在你的行业中建立了可信度；通过将你学到的知识传授给别人，你正在培养忠诚的受众，无论你何时制作有价值的内容，他们都会消费你的内容。\n总而言之，你学会了应该每隔1-2个小时休息一次，向别人寻求帮助，永远把自己当作学生，平衡工作和生活，从错误中吸取教训，承担风险，教给别人你学到的东西，等等。", "note_en": "Being a web developer is difficult, stressful, confusing, and exhausting. But, it&#39;s also very exciting, interesting, and meaningful. I&#39;ve learned many lessons during my journey of becoming a web developer at a young age. Here are 20 lessons I learned that will help you be a better web developer and more successful in life in general.\n    You might not be taking enough breaks. Not taking enough breaks can lead to burnout and feeling unmotivated to continue working. Simply get up every hour and stretch, get something to eat, drink water.\n Giving your brain time to rest can help you figure out the solution to the problem you were trying to solve. You&#39;ll think more clearly when you take breaks every 1-2 hours.\n  If you don&#39;t ask others for help, then you&#39;re missing out on learning and improving. Not asking others for help when you don&#39;t know the answer or just aren&#39;t sure is a great way to learn and grow.\n Many web developers might think that asking for help makes them look and sound stupid, but in reality, it makes you look interested and confident.\n Asking others for help (your client, manager, coworker) helps you prevent future mistakes and helps you become a better web developer. Not asking for help causes you to waste time both in learning and in the workplace.\n Having other web developers around you to answer questions is even better than having a tutorial or book. They can directly answer your questions and help you actually understand the concept.\n  Write your code in a way that&#39;s visually clean, secure, and efficient. This applies to any language or framework. You might have to do extra research to figure out a way to write clean code.\n  Don&#39;t repeat yourself in code, it will save you time, effort, and is much easier for other web developers to work with. You should also minimize your CSS, JS and images.\n Make sure to pay attention to the performance of your code. Finally, test your code. Unit testing prevents you from running into future issues in your code and application. Take the time to write code correctly to begin with.\n  Always think of yourself as a student, because there aren&#39;t any developers that know EVERYTHING. If you stop learning and reading, you&#39;ll fall behind.\n Even if your job doesn&#39;t require you to learn new things, you should definitely still take the time everyday to learn something new. This will increase the chance of you getting hired at another job if you ever lose your job.\n  Programming takes up lots of time, things are always changing and you have to learn more. Instead of thinking you&#39;re not  productive enough, set a time limit to how long you will code everyday.\n  Make sure to spend quality time free from your work with your family and friends. Not only will they inspire and motivate you to work harder, but you might also solve the problem you couldn&#39;t fix before without even using your computer.\n Have interesting hobbies that make you happy, and don&#39;t worry so much about the future. What&#39;s most important is to take care of your physical and mental health.\n Once that&#39;s taken care of, you must allocate quality time to spend with your family and friends everyday. Finally, you should then work hard and make websites or applications that make the world a better place.\n  Teams can be difficult at times because some developers can be rude and angry at you. However, if you let what other people say and do affect you, your life will be much more difficult and stressful than it should be.\n Quickly resolve any potential conflict in your work environment by calmly saying that you&#39;ll take care of it. By putting the responsibility on your hands, you won&#39;t have to worry about another member of your team being rude to you and not getting the task done (which can lead to more conflicts).\n If someone on your team won&#39;t listen to your reasoning, you could go to your manager. However, only do this if it&#39;s a major problem and it is preventing you from getting your work done. If your work is being severely impacted, bring it up to a manager.\n  As a web developer, you&#39;re going to make MANY mistakes. There&#39;s nothing wrong with that, but, there is a problem if you keep making mistakes and you&#39;re not learning from them. To learn from your mistakes, figure out what the cause of the mistake was.\n  Then, figure out if there can be a process put in place to prevent you from making the mistake again. If the mistake was found sooner, could you have prevented yourself from making the mistake?  Learning web development is difficult, but it becomes easier when you learn from your mistakes.\n Make sure that you know why you made the mistake, how to prevent it from happening next time, and then learn from it and move on.\n  Most of the time when working with others, people are genuinely trying to help you and teach you how to solve a problem. You should learn to spot the difference between constructive and destructive criticism.\n Taking other people&#39;s constructive criticism is one of the best ways to learn and improve in web development. You&#39;ll become a much better developer if you apply this advice.\n Up until recently, I had a tough time taking constructive criticism. Even though the harsh criticism I received sometimes was helpful, I took it the wrong way.\n However, I knew something had to change. I needed to get better, fast. So, after every piece of criticism I received (constructive or not), I put my ego aside and learned from it. When I started to take criticism positively, I significantly improved in front-end web development, how I write content, and learn new things.\n  Taking risks is...risky. You don&#39;t know what will happen once you make a risky decision. Your life could change for better or worse. Taking risks has been a big part in my web development journey. There are many times where I can&#39;t decide what I should pursue next.\n However, I found that taking calculated risks is how to solve this problem. You have to know what will probably happen if you do something or plan on doing something in the future.\n Once you know the best option, pick that option. So, let&#39;s say you&#39;re trying to decide what job offer to say yes to. One of them pays more but doesn&#39;t have the freedom of working from home. The other pays a less but gives you the freedom of working from home, and learning new things from your manager. Which job will you choose?\n  I am guilty of making this mistake in the past myself. This happens to the best of us. Frustration is inevitable in programming, but if you give up, everything you did was for nothing. Before you quit, find all the possible ways you can solve the problem that&#39;s in front of you.\n  Of course, some projects you work on can be VERY difficult. There are projects that should be given up on. However, you should ask for help, search for all routes, try something different, use a different technology, taking a long break, and putting the project aside can significantly help you complete the project before giving up. Success is probably right around the corner.\n Once, I was working on a  portfolio for my 1st client, and I couldn&#39;t decide if I should use Python Flask for the backend or just hook up the static HTML website with Facebook.\n After 2 days of stressful coding and decision making, I decided to hook up the static HTML website with Facebook. It was the easiest option for me at the time, and I&#39;m still glad I chose that option.\n The end result didn&#39;t need to have a backend with Python Flask, or even a backend at all. My client only needed a simple and static website that showcased his photos. This is one of the biggest lessons I&#39;ve learned during my web development journey. Giving up too soon isn&#39;t an option. Figure out what options you have, and choose the best one.\n  Not only does being arrogant make it very difficult for other people you&#39;re working with, it also makes it difficult for you. If you think you know everything, you won&#39;t actively listen to others to learn more. Put your ego aside, and be respectful and don&#39;t talk down to ANYONE.\n The consequences of being arrogant are huge. Not only might you get fired, you&#39;ll also lose the respect of others. After years of me trying my hardest to get rid of this bad habit, I finally got past it. Ever since I stopped being arrogant, I learn much more than I did before, and retain what I learn.\n  Communicating properly with anyone is critical to solving complex problems and  getting a lot more done. You&#39;ll also feel better if you communicate without anger and stress.\n  I have a huge passion for web development, building things, and writing awesome content. Despite my passion, there are times when web development can be stressful and even a little boring.\n In these moments, I focus on the end goal. My end goal is to be financially independent so I can travel the world, meet awesome people, and make cool things. What&#39;s your end goal?\n You must focus on the end goal so that when you&#39;re going through difficult projects, you can get through them and feel motivated while doing so.\n  When you work on interesting projects, you probably have fun doing it. The opposite can be true if you&#39;re working on a challenging project. This is why you should merge them together.\n You should find difficult projects that interest you. For example, I enjoy building tools that help other people. However, building tools with programming is challenging, to say the least.\n  &#34;You have to be burning with an idea, or a problem, or a wrong that you want to right. if you&#39;re not passionate enough from the start, you&#39;ll never stick it out.&#34;\n  This is true for everything in life. When you work on projects that you&#39;re passionate about, the difficulties you&#39;ll face along the way will be manageable because of how much you love doing what you do.\n  To be successful in anything in life, you must first learn. Whether it&#39;s how to debug a Javascript error message, or how to build a complex application in Python Flask. You must first learn.\n Once you have a solid understanding of a concept, then you must build projects using what you learned. After you have built that project, you must learn how to improve it. Learn, do, learn.\n  Up until the beginning of 2020, I didn&#39;t even know about SEO, let alone using it day-to-day to rank my websites in search engines. I&#39;ve learned that your business needs SEO because of the long-term gains and traffic it will bring.\n You need to focus on the long-term over the short-term to grow your business consistently and organically. Optimize your website with on-page SEO, or hire someone to do it. You should also  hire someone to write in-depth content that will help your online business grow and get more traffic to your website without spending any money on ads.\n   Making amazing websites for people for free was one of the BIGGEST mistakes I&#39;ve made in my web developer life. You must not make this mistake. When you get hired to build someone a website (even if it&#39;s simple), you must charge for it.\n If you are offering someone your valuable skills that they don&#39;t have, you must charge them for your work. After all, you&#39;re offering them value, and when you have a valuable skillset, you charge for it. I talk about this more in detail in  my guide of how to learn web development.\n  It doesn&#39;t matter if you are building a 1 page website with only HTML &amp; CSS, you still charge for your work. Now, figuring out how much you charge can be tricky. You must know how much your skills are worth. You can do this by finding the average salary of what type of services you&#39;re offering.\n  Working hard is necessary to being successful in anything worthwhile and meaningful. But, you need to take breaks. Like many others, I take a 25 hour break from using electronics every week, once a week. This significantly helps me not get burned out, and makes me enjoy what I do much more.\n Taking a step back gives me an opportunity to think about what I accomplished, and how I could have done it better. I noticed that ever since I&#39;ve been taking a step back every week, my entire weeks have been much more productive.\n Not only have I got better in web development, my grades in school have significantly improved. Taking a step back from work and electronics 1 day every week to think about what you&#39;ve done and how could do it better will help you be more  productive during the entire week.\n  After finishing a project, big or small, reward yourself for your hard work by doing something fun. You can get yourself your favorite dessert, go for a bike ride, or watch  an epic video of a guy beatboxing. This will help you stay motivated when working on difficult projects because of the reward you know you&#39;ll get once you finish them.\n   Through your experience of learning web development, building projects, and working for others, you&#39;ll learn a lot. Teaching others what you&#39;ve learned is a great way to help other web developers get better.\n You&#39;ll also help your brain understand what you&#39;ve learned on a practical level when you teach it to other people. This is what my blog and podcast is all about. It&#39;s about everything I&#39;ve learned through learning web development at a young age, overcoming challenges, and working on difficult projects.\n  If you don&#39;t have your own website, you&#39;re missing out. Having your own website that showcases what you&#39;ve built, accomplished, and learned is critical to being a successful entrepreneur in the digital world. By showcasing your work publicly, you could get hired at your dream job.\n By showcasing your accomplishments, you are building credibility in your industry; and by teaching others what you&#39;ve learned, you&#39;re growing a loyal audience that will consume your valuable content whenever you produce it.\n  To conclude, you&#39;ve learned that you should take breaks every 1-2 hours, ask others for help, always think of yourself as a student, have a work/life balance, learn from your mistakes, take risks, teach others what you&#39;ve learned, and more.", "posttime": "2020-05-14 07:51:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,开发人员,ve,帮助", "title": "作为一名15岁的Web开发人员，我学到的教训", "title_en": "Lessons I've Learned as a 15 Year Old Web Developer", "transed": 1, "url": "https://joshternyak.com/lessons-learned/index.html", "via": "", "real_tags": ["开发", "开发人员", "ve", "帮助"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002040, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "版主出于各种原因从订阅源中删除帖子，包括保持社区的安全、文明和忠于其目的。\n级别1我是一个机器人，这个动作是自动执行的。如果您有任何问题或疑虑，请联系此子编辑的版主。\n第二级是几十艘潜艇上的全职Mod，坐在你父母的地下室里吃薯条圈，审查互联网上不同意你的人。类似于身处前线。表现出一些该死的尊重。\n级别1，并且它已从r/all中删除，并且已从潜艇中删除，并且没有任何消息或才华指示它。消除阴影。从字面上看是R/ALL中的第一名.。\n第一级：Cyxie是如何生存的？如果他们真的控制了所有的替补，他们就不会有时间做任何事情了。我不知道有多少人能像那样成功地工作和编辑工作。\nLevel 2 Reddit是互联网上最受欢迎的网站之一，这个人可以控制数百万人看到的内容。那里的某个地方有钱。\n级别2很可能是由星际草坪公司、机器人农场或其他新时代的大数据公司运营的共享账户。\n第二级他们不工作，Reddit就是他们的生活。可能是福利，榨取父母，信托基金，或者别的什么。\n2级，他们不会对所有的减分牌进行审核。他们加入了国防部的团队，并没有做太多事情。\n第2级它是一个由软件运行的帐户。而且可能不是一个人，而是一个团队可以访问它。\n2级是的，我认为他们不需要工作。控制数百万人的观点肯定不是免费的", "note_en": "Moderators remove posts from feeds for a variety of reasons, including keeping communities safe, civil, and true to their purpose.\n    level 1  I am a bot, and this action was performed automatically. Please   contact the moderators of this subreddit  if you have any questions or concerns.\n                level 2  Being a full time Mod on dozens of subs, sitting in your parents basement eating froot loops and Censoring people on the internet who don&#39;t agree with you. Is akin to being on the Frontlines. Show some damn respect.\n        level 1  Anddd it&#39;s been removed from  r/all and removed from the sub with no message or flair indicating it. A shadow removal. Was literally number 1 on  r/all...\n  level 1  How does Cyxie survive? If they really moderated all those subs they&#39;d never have time for anything. I don&#39;t know many people that can work and reddit work like that successfully at all.\n level 2  Reddit&#39;s one of the most popular sites on the internet and this person has a form of control over what millions of people see. There&#39;s money in there somewhere.\n  level 2  Most likely a shared account run by astroturfing companies, bot farms, or some other new-age big data fuckery.\n  level 2  They don&#39;t work, reddit is their life. Probably welfare, leeching off parents, trust fund, or something.\n  level 2  They don&#39;t moderate all those subs. They got onto the mod team and don&#39;t do much.\n  level 2  It’s an account run by a software. And probably not one person but a team has access to it\n level 2  Yeah I don’t think they need a job. Controlling millions of people’s views sure wouldn’t be done for free", "posttime": "2020-05-14 07:50:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "个人,controlled,reddit", "title": "Subreddits由同样的5个人控制", "title_en": "Subreddits are controlled by the same 5 people", "transed": 1, "url": "https://www.reddit.com/r/interestingasfuck/comments/gitwbo/pointing_out_how_much_power_few_people_have_gets/", "via": "", "real_tags": ["个人", "reddit"]}, {"category": "", "categoryclass": "", "imagename": "a0f30be19b51d4ddcc4061f01dfb578a.jpg", "infoid": 1002039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众筹平台Kickstarter是最新一家在冠状病毒大流行导致的经济低迷期间诉诸裁员的公司。该公司上周在纽约提交了一份监管通知，披露已裁员25名，约占员工总数的18%。但Kickstarter告诉The Verge，其裁员人数是这个数字的两倍多，因为30名员工决定接受公司管理层和Kickstarter员工工会协商的自愿买断。\n“然而，这份文件是正确的，它没有反映一名受到影响的国际员工，也没有考虑到通过向员工提供的自愿买断进一步裁员。Kickstarter的一位发言人告诉The Verge：“总的来说，我们将看到员工人数减少39%。”“大多数离开的人选择了自愿离职方案，每个受影响的人都会留到本周，直到过渡。”\n“商业内幕”(Business Insider)周三最先报道了此次裁员。The Verge上个月报道称，Kickstarter首席执行官阿齐兹·哈桑(Aziz Hasan)已在一份内部备忘录中通知员工裁员迫在眉睫。当时，Hasan列举了该平台上的新项目下降了35%，而且“没有明显的反弹迹象”。\nKickstarter是一家公益公司，是为数不多的成立工会的科技公司之一。员工们在今年2月以Kickstarter United的名义这样做了，此前与管理层的一系列谈判始于2019年，谈判特别旷日持久，就在前首席执行官兼联合创始人佩里·陈辞职并将控制权移交给哈桑的同一天。\n以办公室和专业雇员国际联盟(OPEIU)为代表的Kickstarter工会参与了与管理层关于裁员的谈判，但尚不清楚裁员主要影响到哪些部门。双方于5月初首次达成协议，其中包括Kickstarter向工会成员提供自愿买断，并有能力选择退出医疗保险覆盖范围，转而获得部分付款。\n作为协议的一部分，Kickstarter最终向离职员工提供了一系列遣散费，其中包括四个月的工资，年薪超过11万美元的员工四个月的医疗保险，年薪低于11万美元的员工六个月的医疗保险，任何现有的竞业禁止协议都无效，如果他们的工作在一年内重新开放，还有机会重新加入公司。\n4月20日，Kickstarter管理层宣布，他们计划裁员约40%。经过两周的讨价还价，我们协商出了一个令我们感到无比自豪的遣散费方案。我们的声明：pic.twitter.com/0D786cMjgh。\n-Kickstarter United(@ksr_United)2020年5月2日。\n截至2020年2月，该工会由85名工程师、董事、分析师、设计师、协调员和客户支持专家组成，该团体代表了裁员前公司140名员工中的约60%。", "note_en": "Crowdfunding platform Kickstarter is the latest company to resort to layoffs during the economic downturn caused by the coronavirus pandemic. The company  filed a regulatory notice in New York last week revealing it had laid off 25 employees, or about 18 percent of its workforce. But Kickstarter tells  The Verge its workforce reduction is more than twice that, as 30 employees decided to take voluntary buyouts as negotiated between the company’s management and Kickstarter’s employee union.\n “The filing is correct, however, it does not reflect an international employee that was affected, nor does it take into account further staff reduction via the voluntary buyouts offered to staff. In total, we’ll see a 39 percent reduction in staff,” a Kickstarter spokesperson tells  The Verge. “The majority of those leaving chose voluntary separation packages, and everyone affected is staying on through this week through the transition.”\n The layoffs were  first reported on Wednesday by  Business Insider.  The Verge  reported last month that Kickstarter CEO Aziz Hasan had informed staff that the layoffs were imminent in an internal memo. At the time, Hasan cited a 35 percent drop in new projects on the platform with “no clear sign of rebound.”\n  Kickstarter, which is a public benefit corporation, is one of the few technology companies to have unionized. Employees  did so in February of this year under the name Kickstarter United after a particularly drawn-out series of negotiations with management that  began in 2019 on the  same day that former CEO and co-founder Perry Chen resigned and handed the reins to Hasan.\n Kickstarter’s union, which is represented by the Office and Professional Employees International Union (OPEIU), was involved in negotiations with management regarding the layoffs, but it’s unclear what departments the layoffs primarily affected. A deal was  first reached in early May, which involved Kickstarter offering voluntary buyouts to union members and the ability to opt out of health insurance coverage and receive partial payment instead.\n As part of deal, Kickstarter ultimately offered departing employees a severance package that includes four months’ pay, four months of health care coverage for employees making more than $110,001 a year and six months for those who make less, nullification of any non-compete agreements in place, and a chance to rejoin the company if their job reopens within the year.\n On April 20th, Kickstarter management announced that they were planning to lay off ~40% of our workforce. After two weeks of bargaining, we negotiated a severance package that we are incredibly proud of.  Our statement:  pic.twitter.com/0D786cMjgh\n— Kickstarter United (@ksr_united)  May 2, 2020\n As of February 2020, the union was made up of 85 engineers, directors, analysts, designers, coordinators, and customer support specialists, and the group represented about 60 percent of the company’s 140 employees prior to the layoffs.", "posttime": "2020-05-14 07:37:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "裁员,workforce,员工", "title": "Kickstarter在裁员和收购后失去近40%的员工", "title_en": "Kickstarter Loses Nearly 40 Percent of Its Workforce After Layoffs and Buyouts", "transed": 1, "url": "https://www.theverge.com/2020/5/13/21257585/kickstarter-layoffs-employees-union-negotiations-severance", "via": "", "real_tags": ["裁员", "workforce", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "走路感觉像是世界上最自然的事情。它就在另一只脚的前面，对吗？嗯，是的，但不完全是。在我们的第二篇系列文章(第一篇文章)中，我们讨论动态的运动和正念，Tatjana Mesar老师解释了如何走得好比你想象的要多。\n她在柏林经营着Dynamic Mindness的禅宗瑜伽，这是一家工作室和学校，并培训瑜伽教师。Tatjana热衷于帮助人们在运动中找到更多的自由和自发性，打破局限和限制的运动模式。当她不教书的时候，Tatjana学习运动科学，并将相关的东西应用到她的培训中。最近，她一直在学习Axis教学大纲，这是一本生物力学用户手册和运动系统。我们如何走路，我们的步态，是这种训练的核心部分。\n研究表明，我们走路的方式，我们的步态机制，并不像我们想象的那样“自然”。我们通过观察父母和周围的世界来学习走路。随着我们的成长，我们体现了我们所看到的模式。这些都会限制我们步态的全部潜力。我们中的一些人无意识地阻止骨盆和手臂摆动，因为文化禁忌认为步态太自由而不愿皱眉。\nTatjana说：“我们步态的主要元素之一是反向运动模式(走路时向前摆动相反的手臂和腿)，这是人类运动的工程学奇迹。”“然而，我们并没有真正充分利用它的潜力，因为步行主要是一种文化。”\n“改变步态模式是一个过程，”Tatjana继续说。“这是值得的，因为当我们的步态不平衡或受限时，通常会有巨大的能量泄漏。”\n你甚至可以在出门之前在家里做这个练习。它的目的是学习更自由地行走。首先，站在一个位置，练习前后摆动手臂，让骨盆左右旋转。当你这样做的时候，膝盖上稍微反弹一下。一旦你对此有了感觉，就开始向前迈几步，当你这样做的时候向前摆动相反的手臂和腿。真的让你的手臂摆动起来。做这件事的时候尽量放松，如果感觉怪异的话也不用担心。忘记旧的动作模式，学习新的动作模式，一开始总是感觉很尴尬。当你出去散步的时候，断断续续地练习这个，随着时间的推移，它会变得更自然。\n我们走路方式的另一个常见问题是头部位置。人们往下看，头向前倾，这是很常见的。Tatjana说：“特别是因为现在我们经常走路，低头看着我们的智能手机。”“头部增加了6到8公斤的重量，但将头部向前倾斜，重量会增加到20公斤左右。如果头部直接位于肩膀上方，下巴与地面平行，那么重量就会向下转移到脚部和地面。“。\n当你走路时，Tatjana建议你保持头部挺直，眼睛向前看，而不是看下面的地面。“此外，放松你的下巴，甚至微微张开嘴来促进这一点，并放松舌根，”她说。\n走路时双脚的摆放方式也很重要。Tatjana说，正确的技术是当你一步一步走的时候，双脚向下滚动。首先放置脚后跟的中心，然后将脚的外缘向下滚动，然后再放置外部脚趾，并向下滚动内侧脚趾。这也是你需要花时间去探索的东西。不要强迫自己一直做这件事。花点时间观察一下你的脚是如何摆放的，这是很好的。Tatjana说：“想象一下，当你走路的时候，你正在用脚亲吻地球。”“这将帮助你的脚步变得更加敏感和专注。”", "note_en": "Walking feels like the most natural thing in the world. It’s just one foot in front of another, right? Well yes, but not quite. In this second article in our series on walking your way to good health ( first article here), we talk dynamic movement and mindfulness teacher Tatjana Mesar explains how there is more to walking well than you might guess.\n She runs  Zen Yoga by Dynamic Mindfulness, a studio and school in Berlin, and trains yoga teachers. Tatjana is passionate about helping people find more freedom and spontaneity in their movement, and breaking out of conditioned and limiting movement patterns. When she isn’t teaching, Tatjana studies the science of movement, and implements what’s relevant into her training. Recently, she has been studying  Axis Syllabus, a biomechanical user manual and movement system. How we walk, our gait, is a central part of that training.\n    What research shows is that how we walk, our gait mechanics, isn’t as “natural” as we might believe. We learn to walk by observing our parents and the world around us. As we grow up, we embody the patterns we see. These can limit the full potential of our gait. Some of us unconsciouly prevent the pelvis and arms from swinging because of cultural taboos that frown up having a gait as being, for example, too free.\n “One of the main elements regarding our gait is the counter lateral movement pattern (swinging the opposite arm and leg forward as we walk), which is an engineering marvel of human movement,” Tatjana says. “However, we don&#39;t really use it to its full potential due to the fact that walking is mostly cultural.”\n “Changing the gait pattern is a process,” Tatjana continues. “It’s worth the effort because there’s usually a huge leak of energy when our gait is unbalanced or restricted.”\n     You can do this exercise at home before you even step out the door. Its purpose is to learn to walk more freely. To begin with, stand in one spot, and practice swinging your arms forward and back, allowing the pelvis to rotate side to side. As you do this bounce a little in your knees. Once you have a feeling for this, begin taking steps forward, swinging the opposite arm and leg forward as you do so. Really allow your arms to swing. Try to relax as you do this, and don’t worry if it feels weird. Unlearning old and learning new movement patterns always feels awkward at the beginning. Practice this, off and on, when you are out walking, and over time it will become more natural.\n        Another common issue with how we walk is head position. It’s common for people to look down, tilting their head forward. “Especially because so often now we are walking and looking down at our smartphones,” Tatjana says. “The head adds six to eight kilograms of weight, but by tilting the head forward it increases to something like twenty kilograms. If the head is positioned directly above the shoulders, with the chin parallel to the ground, then that weight is transferred down into the feet and ground.”\n When you’re walking, Tatjana advises to keep your head upright, with your eyes looking ahead, not on the ground below. “Also, relax your lower jaw, even slightly open the mouth to facilitate this, and relax the root of the tongue,” she says.\n        How you place your feet as you walk is also important. The correct technique, Tatjana says, is to roll the feet down as you step through. First place the centre of the heel, then roll the outside edge of the foot down before placing the outer toes, and rolling down the inner toes. This is also something to take your time with exploring. Don’t force yourself to do it all the time. It’s good to spend some time noticing how you are already placing the feet. “Imagine when you are walking you are kissing the earth with your feet,” Tatjana says. “This will help your footsteps to become more sensitive and mindful.”", "posttime": "2020-05-14 07:36:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "步行,walking,运动", "title": "如何提高你的步行技术", "title_en": "How to improve your walking technique", "transed": 1, "url": "https://www.suunto.com/en-us/sports/News-Articles-container-page/how-to-improve-your-walking-technique/", "via": "", "real_tags": ["步行", "walking", "运动"]}, {"category": "", "categoryclass": "", "imagename": "10737136c0a958e0af8e901069466559.jpg", "infoid": 1002037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由参议员罗恩·怀登(D-OR)和史蒂夫·戴恩斯(R-MT)提出的修正案-长度只有七行-将迫使政府首先建立可能的理由-或对犯罪的合理怀疑-以获得逮捕令。这比现行法律要求的门槛要高得多，根据爱国者法案，爱国者法案允许大量收集美国人的浏览记录。\n但修正案以一票之差未能在参议院获得通过所需的60票。\n四名参议员没有对修正案进行投票：拉马尔·亚历山大(R-TN)，他在一名工作人员检测呈阳性后处于自我隔离状态；本·萨斯(R-NE)；帕蒂·默里(D-WA)；以及前民主党总统候选人伯尼·桑德斯(I-VT)。\n缺席参议员的发言人没有立即评论他们为什么没有投票。\n该法案针对的是第215条，这是爱国者法案中一项有争议的法律，该法案是为了回应9·11恐怖袭击事件而签署成为法律的，而且是在9·11恐怖袭击发生一个月后签署成为法律的。法律允许政府从图书馆和其他企业收集任何“有形的东西”-只要它与国家安全调查有关。\n但直到2013年爱德华·斯诺登(Edward Snowden)被披露后，该项目的巨大规模才首次被披露。政府对爱国者法案有一个秘密的解释，允许它直接从互联网和电信巨头那里收集通话记录和互联网浏览记录。“爱国者法案”(Patriot Act)的作者吉姆·森森布伦纳(Jim Sensenbrenner)对他的立法如何被用来监视美国人表示震惊，并成为推动改革的直言不讳的倡导者。\n目前，根据爱国者法案第215条，政府可以在没有搜查令的情况下收集网络浏览和互联网搜索历史。第215条是[外国情报监视法案]中最具争议和最危险的条款。那是因为它太模糊了，太宽泛了。根据第215条，只要与调查相关，政府几乎可以收取任何东西。这可能包括无辜、守法的美国人的私人记录。他们不一定要做错任何事。他们没有任何嫌疑。他们甚至不需要与任何涉嫌任何事情的人接触。他们的个人信息只需要是“相关的”。\nWyden和Daines失败的修正案只是对美国政府监控权的几项拟议改革中的一项，其中一些改革-包括第215条-已于3月到期。参议院预计将在本周晚些时候就最终法案进行投票。\n假设所有修正案都没有通过，最终的法案很可能会跳过众议院-众议院今年早些时候通过了它的版本-并等待总统的签署。", "note_en": "The amendment brought by Sens.  Ron Wyden   (D-OR) and Steve Daines (R-MT) —  just seven lines in length — would have forced the government to first establish probable cause — or reasonable suspicion of a crime — to obtain the warrant. That’s a far higher bar than what’s required under existing law, which under the Patriot Act permits the bulk collection of Americans’ browsing records.\n But the amendment fell short by one vote of the required 60 votes to pass the chamber.\n Four senators did not vote on the amendment: Lamar Alexander (R-TN), who is in self-isolation after a staffer tested positive; Ben Sasse (R-NE); Patty Murray (D-WA); and former Democratic presidential candidate  Bernie Sanders   (I-VT).\n Spokespeople for the absent senators did not immediately comment on why they did not vote.\n The bill took aim at Section 215, a controversial law in the Patriot Act, which was signed into law in response to and a month after the September 11 terrorist attacks. The law allows the government to collect any “tangible thing” from libraries and other businesses — so long as it’s relevant to a national security inquiry.\n But it was only after the  Edward Snowden   disclosures  in 2013 onwards that the vast scope of the program was first revealed. The government had  a secret interpretation of the Patriot Act that allowed it to collect call logs and internet browsing records directly from the internet and telecom giants. Jim Sensenbrenner, who authored the Patriot Act,  expressed shock at how his legislation was used to spy on Americans and became  a vocal advocate in pushing through reforms.\n  Right now, the government can collect web browsing and internet search history without a warrant under Section 215 of the Patriot Act. Section 215 is the most controversial and dangerous provision of [the Foreign Intelligence Surveillance Act]. That’s because it is so vague and so broad. Under Section 215, the government can collect just about anything so long as it is relevant to an investigation. This can include the private records of innocent, law-abiding Americans. They don’t have to have done anything wrong. They don’t have to be suspected of anything. They don’t even have to have been in contact with anyone suspected of anything. Their personal information just has to be “relevant.”\n Wyden and Daines’ failed amendment is just one of several proposed reforms to the U.S. government’s surveillance powers, some of which — including Section 215 — expired in March. The Senate is expected to vote on a final bill later this week.\n Assuming none of the amendments pass, the final bill is likely to skip the House — which passed its version of the bill earlier this year — and await the president’s signature.", "posttime": "2020-05-14 07:35:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "否决,narrowly", "title": "参议院以微弱优势否决了要求对美国人浏览数据发出搜查令的计划", "title_en": "Senate narrowly rejects plan to require a warrant for Americans’ browsing data", "transed": 1, "url": "https://techcrunch.com/2020/05/13/senate-warrant-americans-web-browsing-data/", "via": "", "real_tags": ["否决", "narrowly"]}, {"category": "", "categoryclass": "", "imagename": "ebb0975a05f62c91ef75e6bcce00085b.jpg", "infoid": 1002036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ubuntu Touch是UBports推出的尊重隐私和自由的移动操作系统。今天我们很高兴地宣布发布Ubuntu Touch OTA-12！OTA-12立即可用于许多受支持的Ubuntu Touch设备。这无疑是我们有史以来最大的一次发布，在告别一些老朋友的同时，推出了许多新功能。如果您不耐烦了，您可以跳到How to Get OTA-12&34；来立即获取它，或者继续阅读以了解有关此版本的更多信息。\n就像我们的第一个基于Ubuntu16.04的版本OTA-4一样，这次更新涉及到将Ubuntu Touch堆栈的许多部分放到它们的基础上，然后重新构建。这让我们对堆栈有了更坚实的了解，并为未来更多的改进铺平了道路。\n对于此次更新，我们在203天内合并了251个非翻译PR(如果您想知道的话，总共有137个翻译PR)。有关更改的完整列表，请参阅此GitHub搜索查询。\n这个新版本的主要特点是我们引入了Canonical对Unity8的最终修改。这是一次始于2019年4月的过渡，带来了许多新功能。\n作为Ubuntu Touch用户，您将立即看到此次修订的效果--Ubuntu Touch主屏幕，即Unity8 Dash，现在已被空白背景所取代，抽屉充当新的应用程序列表。\n新版本的Unity8执行广泛的自检，帮助我们避免引入新的错误或再次触发旧的错误。\nUnity8现在被称为Lomiri，尽管代码命名只是缓慢更新以反映这一点。\n对我们来说最重要的是，我们从2015年发布的Mir 0.24升级到2019年发布的Mir 1.2。此较新版本的MIR具有对Wayland客户端的支持！由于缺少实现，我们的基于Android的设备目前不支持这种支持，但是像PinePhone和Raspberry PI这样的主流设备已经在使用Wayland了。最棒的是，从MIR 1.2升级到1.8(于2020年4月发布)应该比从0.24升级到1.2要容易得多。\n琼(CiberSheet)在过去的六个月里一直在进行一场色彩探测马拉松，致力于让Ubuntu Touch应用程序更一致，更美观。这包括对我们的默认颜色进行一些更改，为以前缺少的区域添加一些急需的对比度。\n新的颜色在背景和文本之间的对比度更好，使Ubuntu Touch符合W3&#39；关于文本对比度的Web内容可访问性指南。简单地说，现在一切都更容易看到了。\nJoan对几乎所有的默认应用程序做了(或推荐的)更改，使许多对话框对用户来说更清晰。\nMichele更改了一些控件的默认设置，使它们看起来是脱脂的，而不是浮雕的，反之亦然。它真的让一切都变得流行起来。\n在这次更新中，Kugi增加了一个底部滑动手势，可以从键盘切换到编辑覆盖。这意味着所有布局现在都可以访问编辑覆盖，而以前没有空格键的布局被排除在外。现在，在编辑覆盖上的空白区域双击可在选择模式和光标模式之间切换，并且完成按钮将从任一模式退出。\n此外，Michele还修复了几乎所有语言的一个重要可用性问题：键入冒号不再大写下一个字母。\n默认的Ubuntu Touch Web浏览器也看到了此更新的一些修复。\n私人浏览现在只在离开时删除私人浏览会话，而不是所有的浏览会话。此外，还添加了允许删除Cookie的设置选项。\n浏览器现在可以更优雅地处理下拉元素，打开一个带有可触摸选项的主题窗口，而不是很小的下拉框。这也修复了打开下拉框时崩溃的问题！\n添加了自动适应宽度的功能。启用后，浏览器将尝试自动缩放网页以避免呈现问题。\n不幸的是，QtWebEngine升级不在OTA-12的卡片上。然而，Chris已经亲自测试QtWebEngine 5.14有一段时间了，我们相信它将为OTA-13做好准备。\n具有多色LED的设备现在将使用它来指示其充电状态。电池电量不足时，LED将闪烁橙色，充电时呈白色稳定闪烁，充满时呈绿色稳定闪烁。\n在FairPhone 2上，将SIM卡切换到4G不再需要手动将另一个插槽切换到2G。此切换现在是自动完成的。\n许多指示器都得到了修复，允许它们正确创建和加载翻译文件，因此对于选择了不同语言的人来说，指示器中的英语将会少得多。\nNexus5、OnePlus One和FairPhone 2的默认内核中添加了Anbox所需的内核驱动程序。这些设备的用户将不再需要刷新不同的内核来体验Anbox。\n我们现在使用自己的Google OAuth键来实现Google联系人和日历的同步。然而，谷歌已经开始屏蔽他们认为可疑的浏览器，许多用户无法使用谷歌登录。有关此情况的最新信息，请参见GitHub上的“谷歌：无法再次登录”(&#34；Google：Unable to Login&#34；on GitHub)。\n正如前面提到的，这个更新已经筹备了一年多，所以&#34；250个拉取请求&#34；低估了这些变化。很多人帮助我们走到了这一步，包括Canonical的Mir团队，项目被放弃之前的Ubuntu电话团队(这对他们来说是延迟的满足感！)，还有我们令人惊叹和充满活力的社区。\n真的，感谢你们所有人的工作。没有你，我们不可能做到这一点。\n接下来的几个月我们的工作已经安排好了。从OTA-12周期开始到现在，PinePhone、*Other&#39；即将到来但未宣布的硬件*)和已提交但未合并的99个其他Pull请求之间。有一件事是肯定的，那就是我们会毫不费力地找到事情做！最重要的是，期待新的QtWebEngine版本的加入，它将使浏览网络变得更加愉快。\n稳定频道(在UBports安装程序中默认选择)中的Ubuntu Touch的现有用户可以通过系统设置的更新屏幕获得OTA-12更新。\n我们预计删除作用域将是此次更新中谈论最多的变化，因为它将改变每个人的主屏幕。这个话题在UBports论坛上的&#34；我想回家&34；中进行了大量的讨论，我们预计这一讨论将在这次更新中继续进行。我们认为，在分享你的想法之前，整个论坛主题都是必读的。提出了许多很好的观点。\n您可以按照我们的错误报告文档了解如何显示我们确认和解决问题所需的信息。每一点都有帮助。改进Ubuntu Touch的最好方法是使用它，然后告诉我们体验。\n您应该始终检查是否已经在Github上的ubports/ubuntu-touch上报告了您的错误。即使您没有什么要报告的，浏览开放的bug也是值得的。这样可以确保您可以监视任何未解决的问题，并通过提供更多信息来帮助解决这些问题。\n我们很抱歉，但是在这个版本中有太多的更改，无法为这篇文章编译一个完整的更改日志。它也会让这篇帖子看起来永远持续下去。您可以查看在OTA-11和OTA-12版本之间合并的所有PR的GitHub搜索查询。", "note_en": "Ubuntu Touch is the privacy and freedom respecting mobile operating system by  UBports. Today we are happy to announce the release of Ubuntu Touch OTA-12! OTA-12 is immediately available for many  supported Ubuntu Touch devices. It is easily our largest release ever, featuring a number of new features while saying goodbye to some old friends. You can skip down to &#34;How to get OTA-12&#34; to get it right away if you&#39;re impatient, or read on to learn more about this release.\n   Like OTA-4, our first release based on Ubuntu 16.04, this update involved taking many parts of the Ubuntu Touch stack down to their foundation and building back up. This has given us a more solid understanding of the stack and paved the way for more improvements in the future.\n For this update, we merged 251 non-translation PRs in 203 days (there were 137 translation PRs, if you were wondering). For the full list of changes, see  this GitHub search query\n  The headline feature of this new release is our import of Canonical&#39;s final changes to Unity8. This is a transition that started in April of 2019 and has brought many new features.\n As an Ubuntu Touch user, you&#39;ll be seeing the effects of the revision right away -- the Ubuntu Touch &#34;home screen&#34;, the Unity8 Dash, has now been replaced by a blank background, with the Drawer serving as the new app list.\n  The new version of Unity8 performs extensive self-tests, helping us to avoid introducing new bugs or triggering old ones again.\n Unity8 is now called Lomiri, though the code naming is only being updated slowly to reflect this.\n Most importantly for us, we upgraded from Mir 0.24, released back in 2015, to Mir 1.2, released in 2019. This newer version of Mir features support for Wayland clients! This support is not currently available to our Android-based devices due to a missing implementation, but mainline devices such as the PinePhone and Raspberry Pi are already using Wayland. Best of all, upgrading from Mir 1.2 to 1.8 (released in April 2020) should be much easier than going from 0.24 to 1.2 was.\n  Joan (Cibersheep) has been on a color-sleuthing marathon for the past six months, working toward making Ubuntu Touch apps more consistent and aesthetically pleasing. This involved making some changes to our default colors, adding some much-needed contrast to previously lacking areas.\n  The new colors contrast better between background and text, bringing Ubuntu Touch into compliance with the W3&#39;s Web Content Accessibility Guidelines for text contrast. Simply put, everything is easier to see now.\n Joan made (or recommended) changes to almost all of the default apps, making many dialogs clearer for the user.\n Michele changed the default aspect of some controls so they appear debossed rather than embossed and vice versa. It really makes everything pop.\n  In this update, Kugi has added a bottom-swipe gesture to switch from the keyboard to the editing overlay. This means that all layouts can now access the editing overlay, where previously those which did not have a spacebar were excluded. Double-tapping in the blank area on the editing overlay now switches between selection and cursor mode, and the Done button exits from either mode.\n Additionally, Michele fixed an important usability issue for almost all languages: typing a colon no longer capitalizes the next letter.\n  The default Ubuntu Touch web browser has also seen a number of fixes for this update.\n Private browsing now deletes only the private browsing session upon leaving, rather than  all browsing sessions. Additionally, a settings option has been added to allow deletion of cookies.\n  Dropdown elements are now handled more gracefully by the browser, opening a themed window with touchable options rather than tiny dropdown boxes. This also fixes crashing when opening dropdown boxes!\n An automatic fit-to-width feature was added. When enabled, the browser will attempt to zoom a webpage automatically to avoid rendering issues.\n Unfortunately, a QtWebEngine upgrade was not on the cards for OTA-12. However, Chris has already been testing QtWebEngine 5.14 personally for a while, and we believe it will be ready for OTA-13.\n  Devices with a multi-color LED will now use it to indicate their charge status. The LED will flash orange when the battery is low, while it will be solid white during charging and solid green when full.\n On the FairPhone 2, switching a SIM to 4G no longer requires manually switching the other slot to 2G. This switch is now done automatically.\n Many indicators received a fix that allows them to create and load their translation files properly, so there will be far less English in the Indicators for people who have selected a different language.\n The kernel driver required for Anbox has been added to default kernels for the Nexus 5, OnePlus One, and FairPhone 2. Users of these devices will no longer need to flash a different kernel in order to experiment with Anbox.\n  We are now using our own Google OAUTH keys to enable Google Contacts and Calendar to sync. However, Google has started blocking browsers they deem &#34;suspicious&#34; and many users are unable to use Google sign-in. See  &#34;Google: Unable to sign in  again&#34; on GitHub for updates on this situation.\n  As mentioned earlier, this update has been in the works for over a year, so &#34;250 Pull Requests&#34; understates the changes. Many people have helped us get here, including the Mir team at Canonical and what was the Ubuntu Phone Team before the project was dropped (talk about delayed gratification for them!), and our amazing and vibrant community.\n Truly, thank you all for your work. We could not have done this without you.\n  Our work is cut out for us for the next few months. Between the PinePhone, *other &#39;upcoming but unannounced hardware&#39; * ;) and  the 99 other pull requests filed but  not merged between the start of the OTA-12 cycle and now. One thing for sure is that we will have no problem finding something to do! Most importantly, look forward to the inclusion of the new QtWebEngine release, which will make browsing the web much more delightful.\n Existing users of Ubuntu Touch in the  Stable channel (which is selected by default in the UBports Installer) can obtain the OTA-12 update through the Updates screen of System Settings.\n    We expect the removal of scopes will be the most talked-about change in this update, as it will change the home screen for everyone. This topic was heavily discussed in  &#34;I wanna go Home&#34; on the UBports Forum, and we anticipate that this discussion will continue with this update. The whole forum topic is required reading before sharing your thoughts, we think. Many excellent viewpoints were raised.\n  You can follow our  Bug Reporting document to learn how to present the information we&#39;ll need to confirm and fix your issue. Every bit helps. The best way to improve Ubuntu Touch is to use it and then tell us about the experience.\n You should always check to see whether your bug has already been reported on  ubports/ubuntu-touch on Github. Browsing open bugs is worth doing, even if you have nothing to report. This ensures that you can watch for any of the open issues and help fix them by providing more information.\n  We apologize, but there were far too many changes in this release to compile a complete changelog for this post. It&#39;d also make this post go on for what would seem like forever... You can check out  this GitHub search query for all of the PRs merged between the release of OTA-11 and the release of OTA-12.", "posttime": "2020-05-14 07:34:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,touch,现在", "title": "Ubuntu Touch OTA-12版本", "title_en": "Ubuntu Touch OTA-12 Release", "transed": 1, "url": "https://ubports.com/blog/ubports-blog-1/post/ubuntu-touch-ota-12-release-276", "via": "", "real_tags": ["ubuntu", "touch", "现在"]}, {"category": "", "categoryclass": "", "imagename": "4714af385f353b546994e4afa9bc94e3.jpg", "infoid": 1002035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这似乎比仅仅几个月前冠状病毒开始蔓延的时间要长得多，当时科技行业感受到了它的存在。就像在大多数社会中一样，它始于呼吁人与人之间的社交距离，然后导致了稳定的多米诺骨牌效应，供应商取消了主要的技术展，或者宣布他们将把它们转移到网上。第一个受到冲击的大型活动是世界移动通信大会(Mobile World Congress)，这是一场在2月份举行的活动，往往会吸引超过11万人参加，但它也是在巴塞罗那举办的，这个国家很快就被冠状病毒病例和死亡人数吞噬了。\n没过多久，美国的供应商就开始取消他们的面对面活动。有一些活动按计划进行--2月下旬在旧金山举行的RSA 2020安全大会就是最引人注目的例子，尽管IBM和AT&amp；T等公司退出了--但到那时，节目取消的洪流已经开始。\n亚马逊网络服务公司决定像其他许多人一样举办年度峰会--使其成为一个严格意义上的在线虚拟活动。这是本周一个截然不同的事件。AWS首席技术官沃纳·沃格尔(Werner Vogels)在过去的峰会上以在推出一个又一个新功能时悄悄走上舞台并擦掉额头上的汗水而闻名，但他却出现在小屏幕上，从他的家庭演播室喜气洋洋地走进来。他传达的信息不是在AWS氛围中现有的大量新技术和服务的基础上添加，而是利用冠状病毒大流行带来的被迫放缓，回到基础并学习新技能，如机器学习，其中大部分可以通过AWS服务以及构建的工具和亚马逊构建者图书馆来完成。在这方面，他传达的信息是：利用冠状病毒大流行带来的被迫放缓，回到基础并学习新技能，如机器学习，这在很大程度上可以通过AWS服务以及架构工具和Amazon Builders‘Library来完成。\nVogels还吹捧了一系列其他技术，从S3对象存储到Route 53和CloudFront DNS Web服务。他之所以推动这一切，是因为在他看来，冠状病毒危机的后果-从大量员工突然从家里工作到企业，大量转向公共云以实现业务连续性，再到消费者在内部躲避的情况下转向内容流媒体公司进行娱乐-证明了云基础设施在应对飙升的服务需求方面的弹性。作为证据，他指出，尼尔森(Nielsen)最近的一项研究发现，在3月13日，超过1610亿分钟的视频内容被流传输。一年前，这一数字不到700亿分钟。\n此外，大流行带来的新现实正在改变未来的商业模式。\n这位首席技术官表示：“我相信，至少在过去的几个月里，我们真正开启了一个科技新纪元，在这个时代，我们不仅看到了每个人对技术本身的看法发生了根本性的转变，而且看到了人们如何获取技术以及如何构建技术的根本性转变。”“这就是AWS帮助您做的事情。在许多方面，它正在加速实现我们多年前预测的世界的道路。早在20世纪60年代，你就可以在车内进行视频会议，这可以追溯到20世纪60年代的间谍电影，而在80年代，3D打印被视为纯粹的科幻小说。我断言，在2020年及以后，大多数组织将转型为完全基于云的环境。任何地方，我都可以随时随地访问任何应用程序或服务。“。\n事实上，我们已经报道了过去三个月对公共云服务需求的上升，以及在一个正受到冠状病毒带来的经济重创的IT行业中，一些细分市场-包括公共云和基于云的视频会议-表现良好，AWS也包括在内。Gartner分析师为此增加了另一个证据，本周预测，由于冠状病毒爆发，2020年全球IT支出同比下降8%。也就是说，公共云服务支出今年将增长19%，基于云的会议(增长24.3%)和基于云的电话和消息(8.9%)也是如此。\nVogels还指出，远程医疗等行业的需求正在增长，并依赖公共云基础设施来帮助它们满足这些需求。他指出，一家名为KrY的医疗初创公司创建了Care Connect在线平台，使医生和患者之间能够进行视频咨询，自大流行开始以来，需求一直在增长。该平台完全建立在AWS之上，在不到两周的时间里就推出了。\n峰会和Vogels 45分钟演讲的重点主要是教导开发人员和工程师如何在AWS中构建架构，并利用云巨头的服务来确保安全性、弹性和可扩展性。也就是说，本周该公司传出了一些消息。其中包括AWS的第六代弹性计算云(EC2)通用实例-M6G-由该公司基于ARM的处理器的最新版本Graviton2提供支持。它是由AWS和亚马逊旗下的Annapurna实验室设计的，利用了ARM的64位Neoverse N1内核。第一个基于Graviton的EC2实例于2018年推出，并于去年12月首次谈论基于Graviton2的实例。\n正如我们在下一个平台上注意到的，Graviton处理器是越来越多的基于ARM的服务器芯片中的一员，使他们在一个由Intel和x86架构主导的领域感受到了它们的存在。经过多年的承诺，ARM及其制造合作伙伴-如Marvell及其ThunderX2处理器(2018年收购Cavium时继承)，以及由英特尔前高管领导的初创公司Ampere-正在取得进展。Graviton是该公司开发的芯片，该公司拥有蓬勃发展的公共云市场约40%的份额，并正在将其放入云实例中。\nGraviton2处理器支持256位DRAM加密，并包括双SIMD单元，使其第一代前身的浮点性能翻了一番。为了加速机器学习推理工作负载，它们还支持INT8/FP16指令。M6G实例有8种大小，从1到64个虚拟CPU或裸机实例，配备高达256 GB的内存、25 GB/秒的网络性能和19 GB/秒的EBS带宽。它们由AWS的Nitro系统平台提供动力。\n同样在本周，AWS推出了其新的企业搜索服务Kendra。该公司去年年底推出了这项技术的预览。它旨在解决在正在生成的快速增长的数据量中快速、轻松地查找信息这一挑战。其中的关键问题是，大多数企业都是非结构化的，而且数据通常分散在不同的位置，存储在从区域数据库到第三方应用程序的一系列站点中。还有一个挑战是找到正确的关键字。\n机器学习驱动的Kendra服务可以索引存储在一系列后端(包括文件系统、应用程序和关系数据库)中的结构化和非结构化数据，并且可以理解IT和医疗保健等一系列领域的复杂语言。数据在飞行中使用HTTPS加密，在静态时使用AWS密钥管理服务进行加密。\n将本周的精彩内容、分析和故事直接从我们的收件箱发送到您的收件箱，中间没有任何内容。", "note_en": "It seems much longer than just a couple of months ago when the  spreading coronavirus outbreak began make its presence felt in the tech industry. Like in most of society, it started with calls for social distancing between people and then led to the steady domino effect of vendors canceling major technology shows or announcing that they were moving them online. The first big one to hit was Mobile World Congress, an event in February that tends to draw more than 110,000 people but that also is hosted in Barcelona, in a country that soon was consumed by coronavirus cases and deaths.\n It wasn’t long before vendors in the United States began canceling their in-person events. There were some that went ahead as planned – the RSA 2020 security conference in San Francisco in late February being the most high-profile example, despite companies like IBM and AT&amp;T pulling out – but by that time the torrent of show cancellations had begun.\n Amazon Web Services decided to do with its annual Summit conference what many others did with theirs – make it a strictly virtual event online. And it was a decidedly different event this week. AWS CTO Werner Vogels, known in past Summits for stalking the stage and wiping sweat from his brow as he introduced one new feature after another, instead was on the small screen, beaming in from his home studio. And instead of the parade of new technologies and services being added to the massive numbers already available in the AWS atmosphere, his message was about taking advantage of the forced slowdown  brought on by the Covid-19 pandemic to get back to basics and learn new skills, like machine learning, much of which can be done with such AWS services as Well Architected Tool and Amazon Builders’ Library.\n  Vogels also touted a range of other technologies, from S3 object storage to the Route 53 and CloudFront DNS web services. He pushed all this because, in his mind, the fallout from the Covid-19 crisis – from the massive numbers of employees suddenly working from home to enterprises turning in large numbers to public clouds for business continuity to consumers turning to content streaming companies for entertainment as they stay sheltered inside – has proven the resiliency of cloud infrastructures to handle skyrocketing demand for services. As proof, he pointed to a recent Nielsen study that found that on March 13, more than 161 billion minutes of video content was streamed. A year earlier, that number was fewer than 70 billion minutes.\n In addition, the  new reality brought on by the pandemic is changing business models going forward.\n “I believe that if nothing else, these past few months have truly ushered in a new era in technology, where we are seeing a fundamental shift in how everyone is viewing not only technology itself, but how to access that technology as well as how we build the technology,” the CTO said. “That’s what AWS helps you do. In many ways, it’s accelerating the path to realize a world that we had predicted many years ago. You had video conferencing inside the car from spy movies as far back as the 1960s and 3D printing was seen as pure science fiction in 1980s. It is my assertion that in 2020 and beyond, most organizations are going to be transforming into a completely cloud-based environment. Anywhere I can access any application or service from anywhere at any time.”\n  Indeed, we’ve written about the  rise in demand for public cloud services during the past three months and how in an IT industry that is being hit hard by the economic battering the coronavirus is delivering, some segments – the public cloud and cloud-based video conferencing being two – are faring well,  AWS included. Gartner analysts added another proof point to this, forecasting this week that global IT spending in 2020 decline 8 percent year-over-year due to Covid-19 outbreak. That said, public cloud services spending will see a 19 percent jump this year, as will cloud-based conferencing (a 24.3 percent increase) and cloud-based telephony and messaging (8.9 percent).\n Vogels also noted that industries like telemedicine are seeing demand grow and are relying on public cloud infrastructures to help them meet those demands. He pointed to a healthcare startup called Kry, which created its Care Connect online platform enabling video consultations between doctors and patients and which has seen growing demand since the pandemic began. The platform is built entirely on AWS and was launched in less than two weeks.\n  The focus of the Summit – and of Vogels’ 45-minute talk – was primarily on teaching developers and engineers how to build architectures within AWS and leverage the cloud giant’s services to ensure security, resiliency and scalability. That said, there was some news coming out of the company this week. Among that was the availability of AWS’ sixth-generation Elastic Compute Cloud (EC2) general-purpose instance – the M6g – which is powered by Graviton2, the latest iteration of the company’s Arm-based processor. It was designed by AWS and Annapurna Labs – which is owned by Amazon – leveraging Arm’s 64-bit Neoverse N1 cores.  The first Graviton-powered EC2 instances were launched in 2018 and  first talked about the Graviton2-based instances in December.\n  As we at  The Next Platform have noted, the Graviton processors are among a growing number of Arm-based server chips making their presence felt in a space dominated by Intel and x86 architecture. After years of promise, Arm and its manufacturing partners – such as Marvell and its ThunderX2 processors (inherited when it bought Cavium in 2018) and  Ampere, a startup led by ex-Intel executives – are making inroads. Graviton comes in as the chip d eveloped by the company that owns about 40 percent of the booming public cloud market and is putting them in its cloud instances.\n The Graviton2 processors support 256-bit DRAM encryption and include dual SIMD units to double the floating point performance of their first-generation predecessors. To accelerate machine learning inference workloads, they also support INT8/FP16 instructions. The M6g instances come in eight sizes ranging from one to 64 virtual CPUs or as bare-metal instances, come with up to 256 GB of memory, 25 Gb/sec of network performance and 19 Gb/sec of EBS bandwidth. They’re powered by AWS’ Nitro System platform.\n Also this week, AWS made Kendra, its new enterprise search service, generally available. The company launched a preview of the technology late last year. It was designed to address the challenge of quickly and easily finding information in the fast-growing amounts of data that is being generated. Among the key problems are that most enterprise is unstructured and that it’s often spread across locations and stored in a range of sites, from regional databases to third-party applications. There also is the challenge of finding the right keywords.\n The machine learning-powered Kendra services can index structured and unstructured data stored in a range of backends, including file systems, applications and relational databases, and can understand complex language from an array of domains, such as IT and healthcare. The data is encrypted in flight using HTTPS and at rest with AWS Key Management Service.\n Featuring highlights, analysis, and stories from the week directly from us to your inbox with nothing in between.", "posttime": "2020-05-14 07:34:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流行病,shows,服务", "title": "流行病显示了公共云的价值", "title_en": "Pandemic Shows the Value of the Public Cloud", "transed": 1, "url": "https://www.nextplatform.com/2020/05/13/pandemic-shows-the-value-of-the-public-cloud/", "via": "", "real_tags": ["流行病", "shows", "服务"]}, {"category": "", "categoryclass": "", "imagename": "26ab3920e3474a24db89d3a56a69e0ca.png", "infoid": 1002034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界上有两种类型的人：一种是标签极简主义者，他们一次只打开几个标签；另一种是标签收藏家，他们拥有…明显更多的标签。无论是极简主义者还是收藏家，我们都为Chrome带来了一种新的标签组织方式：标签组。该功能现在在Chrome Beta中可用。", "note_en": "There are two types of people in the world:  tab minimalists who have just a few tabs open at a time and  tab collectors who have...significantly more. For minimalists and collectors alike, we’re bringing a new way to organize your tabs to Chrome: tab groups. This feature is available now in Chrome Beta.", "posttime": "2020-05-14 07:05:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrom,tabs,chrome", "title": "在Chrome中使用标签的一种新方法", "title_en": "A new way to use tabs in Chrome", "transed": 1, "url": "https://www.blog.google/products/chrome/manage-tabs-with-google-chrome/", "via": "", "real_tags": ["chrom", "tabs", "chrome"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Deno是一个安全的JavaScript和TypeScript运行时", "note_en": "Deno is a secure JavaScript and TypeScript runtime", "posttime": "2020-05-14 06:36:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "deno,javascript", "title": "Deno 1.0.0", "title_en": "Deno 1.0.0", "transed": 1, "url": "https://deno.land/v1", "via": "", "real_tags": ["deno"]}]