[{"category": "", "categoryclass": "", "imagename": "e46d2778aaa5226e2327043b2a43c44a.jpg", "infoid": 1017857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于旧金山的Coinbase周三宣布，今年秋季，Coinbase将允许美国零售客户以所持比特币持有量的30%为抵押借入法定贷款。\nCoinbase是进入贷款业务的最大、监管最严格的密码交易所之一，该交易所正在为该产品设定保守的参数，将每位客户的信贷额度上限定在2万美元，并为期限为一年或更短的比特币支持的贷款提供8%的利率。\n然而，客户将不需要填写申请或通过信用检查，借款人将能够在两到三天内收到贷款。\nCoinbase产品主管马克斯·布兰兹伯格(Max Branzburg)在一份电子邮件声明中说，“客户可能会根据自己的财务需求，以不同的方式使用比特币支持的贷款，包括房屋或汽车维修等大笔支出，为婚礼等重大场合提供资金，或者帮助管理更高利率的个人贷款或信用卡债务，”Coinbase的产品主管马克斯·布兰兹伯格(Max Branzburg)在一份电子邮件声明中说。\n他说，该产品只在17个州提供，但Coinbase正在其他州和国家寻求许可证，以便能够扩大其贷款服务。周三下午，一份等待名单开始了，其中包括一句标语：\n“你有没有在紧急情况下需要现金，比如买车或修房子？过去，你可能会出售比特币来弥补，并产生应税损益。现在你不必这么做了。“。\n该交易所表示，它不会将抵押品再投资于其他地方，并将比特币保留在交易所，这与一些密码贷款人不同，后者将抵押品再抵押或将存款投资于永久掉期。\n密码贷款机构Unchain Capital首席执行官兼联合创始人约瑟夫·凯利(Joseph Kelly)表示，增加贷款产品可能是交易所将客户资金留在交易所而不是将其转移到其他地方的一种方式。Square的支持比特币的Cash App本周也宣布正在测试一款贷款产品，该产品将为客户提供2-20美元的短期贷款。\nCoinbase的低利率也将使其能够在许多州运营，否则这些州将需要额外的许可来避免高利贷行为。\n“当客户有多余的资金想要用来做点什么的时候，这是一个很好的牛市产品，”Kelly说。“我们几乎从未见过垄断的借贷市场…。我预计其他交易所也会效仿。“。\n新的Coinbase产品仅在以下州发售：阿拉斯加、阿肯色州、康涅狄格州、佛罗里达州、佐治亚州、伊利诺伊州、马萨诸塞州、新罕布夏州、新泽西州、北卡罗来纳州、俄勒冈州、得克萨斯州、弗吉尼亚州、内布拉斯加州、犹他州、威斯康星州和怀俄明州。\nCoinDesk是区块链新闻的领先者，是一家努力追求最高新闻标准并遵守一套严格的编辑政策的媒体渠道。CoinDesk是数字货币集团(Digital Currency Group)的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "Coinbase will allow U.S. retail customers to borrow fiat loans against as much as 30% of their bitcoin holdings in the fall, the San Francisco-based exchange announced Wednesday.\n Coinbase is one of the largest and most regulated crypto exchanges to get into the lending business, and the exchange is setting conservative parameters on the product, capping credit lines at $20,000 per customer and offering an interest rate of 8% for bitcoin-backed loans with terms that are a year or less.\n Customers will not need to fill out an application or go through a credit check, however, and borrowers will be able to receive their loans in two to three days.\n “Customers may use bitcoin-backed loans in different ways depending on their financial needs, including for large expenditures like home or car repairs, financing major occasions like a wedding, or helping to manage higher-interest personal loans or credit card debt,” Max Branzburg, head of product at Coinbase, said in an emailed statement.\n The product is available in only 17 states but Coinbase is pursuing licenses in other states and countries to be able to expand its lending service, he said. A  waitlist opened Wednesday afternoon, including the tagline:\n “Have you ever needed cash for something urgent, like a car or home repair? In the past, you might have sold Bitcoin to cover it and incurred a taxable gain or loss. Now you don&#39;t have to.”\n The exchange says it won’t reinvest the collateral elsewhere and will keep the bitcoin at the exchange, unlike some crypto lenders who  rehypothecate collateral or  invest deposits into perpetual swaps.\n Adding a lending product can be a way for exchanges to keep customer funds at the exchange instead of moving them elsewhere, said Joseph Kelly, CEO and co-founder of crypto lender Unchained Capital. Square’s bitcoin-friendly Cash App also announced this week that it is testing a lending product that will offer customers  short term loans of between $2 and $20.\n Coinbase’s low interest rate will also allow it to operate in many states that would otherwise require additional licensing to avoid usurious lending practices.\n “It’s a good bull-market product when customers have excess capital they’d like to do something with,” Kelly said. “We’ve almost never seen a monopoly lending market … I’d expect other exchanges to follow suit.”\n The new Coinbase product is only available in the following states: Alaska, Arkansas, Connecticut, Florida, Georgia, Illinois, Massachusetts, New Hampshire, New Jersey, North Carolina, Oregon, Texas, Virginia, Nebraska, Utah, Wisconsin and Wyoming.\n   Disclosure The leader in blockchain news, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups.", "posttime": "2020-08-13 07:41:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "比特币,美国,客户,bitcoin,贷款", "title": "Coinbase表示，今年秋天将在17个州向美国零售客户提供法定贷款，由客户持有的比特币高达30%的资金支持", "title_en": "Coinbase says it will offer fiat loans to US retail customers, backed by as much as 30% of a customer's bitcoin holdings, in 17 states this fall", "transed": 1, "url": "https://www.coindesk.com/coinbase-to-offer-bitcoin-backed-loans-to-us-customers", "via": "", "real_tags": ["比特币", "美国", "客户", "bitcoin", "贷款"]}, {"category": "", "categoryclass": "", "imagename": "fca8d55cc5cea79849b0b906ad991c8e.png", "infoid": 1017856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MDN Web Docs是数百万Web开发人员每天的命脉、家园和真理的源泉。它使个人和团队能够构建令人惊叹的服务和产品，学习，创造自己的机会，并在开放的网络上表达自己。作为一个开发人员社区，我们可以免费访问所有这些信息，♥️。\n这一切都是由一个充满激情的社区、鼓舞人心的技术作者和一个小而坚定的开发团队实现的。现在是我们向他们表示我们有多么感谢他们的辛勤工作和奉献精神的时候了。如果MDN Web Docs对您的生活产生了影响，请花点时间在下面留言。谢谢！让我们继续为所有人建立一个开放的网络！", "note_en": "MDN Web Docs is the life blood, the home, the source of truth for millions of web developers everyday. It empowers individuals and teams to build amazing services and products, to learn, to create their own opportunities, and to express themselves on the open web. As a community of developers we have access to all of this information for free ♥️\n  This is all made possible by a passionate community, inspirational technical writers, and a small, but determined team of developers. It is time that  we show  them how much we appreciate their hard work and dedication. If MDN Web Docs has had an impact on  your life, please take a moment and leave a comment below.Thank you! Let’s keep building an Open Web for All!", "posttime": "2020-08-13 07:40:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "感谢,mdn,团队", "title": "️感谢mdn", "title_en": "️ Thank You MDN", "transed": 1, "url": "https://www.ilovemdn.org/", "via": "", "real_tags": ["感谢", "mdn", "团队"]}, {"category": "", "categoryclass": "", "imagename": "ddedcfc203f024ecbf019b87905350ae.jpg", "infoid": 1017855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lyft联合创始人兼总裁约翰·齐默(John Zimmer)在公司第二季度财报电话会议上表示，如果州政府不推翻最近要求Lyft将司机归类为全职员工的裁决，Lyft可能会暂停在加州的服务。\nLyft的股价在几个小时后一度高达6%，但当齐默尔表示Lyft可能会暂停在该州的服务时，股价转为负值。\n优步首席执行官Dara Khosrowshahi周三在接受MSNBC采访时表示，如果裁决不被推翻，优步也可能暂停在加州的服务。Khosrowshahi表示，暂停可能会持续到11月，届时选民将就投票措施22号提案做出决定，该提案将免除基于APP的运输和递送公司的司机被视为员工。\n齐默尔周三还强调了22号提案在公司财报电话会议上的重要性。\n如果我们在这里的努力不成功，将迫使我们暂停在加州的业务。幸运的是，加州选民可以通过在11月的第22号提案上投赞成票来发出自己的声音，齐默说。\n周一，加利福尼亚州的一名法官批准了一项初步禁令，要求Lyft和Uber在表示将对裁决提出上诉的10天期限后，停止将司机归类为独立工人。如果得到支持，该命令将要求Lyft和优步将司机视为员工，并支付福利和失业保险等额外费用。\n加州总检察长泽维尔·贝塞拉(Xavier Becera)在5月份与三名城市检察官一起起诉了这些公司，指控它们违反了该州旨在为零工工人提供福利的新法律。优步和Lyft一直反对这项法律，并正在为一项投票措施提供资金，该措施如果获得通过，将使他们免受该法律的约束。\n优步(Uber)的科斯罗沙希(Khosrowshahi)最近倡导他所谓的“第三条路”(Third Way)对工人进行分类。他认为，应该有一种方法，让工人在享受独立工作的灵活性的同时，获得员工身份提供的一些保护。在法院裁决前发表的一篇《纽约时报》专栏文章中，Khosrowshahi建议零工公司可以根据工人的工作时间支付他们可以获得的资金，以支付医疗保险、带薪休假或其他成本。Lyft的领导层在替代劳务模式方面并没有那么积极地直言不讳。", "note_en": "Lyft may suspend services in California if the state does not overturn a recent ruling requiring it to classify its drivers as full-time employees, Lyft co-founder and President John Zimmer said on the company&#39;s second-quarter earnings call.\n Shares of Lyft were as high as 6% after hours, but went negative when Zimmer said Lyft might suspend service in the state.\n  Uber would also likely pause its service in California if the ruling is not overturned,  CEO Dara Khosrowshahi said in an MSNBC interview Wednesday. Khosrowshahi said a suspension would likely last until November when voters would decide on the ballot measure,  Proposition 22, which would exempt drivers for app-based transportation and delivery companies from being considered employees.\n Zimmer on Wednesday also stressed the importance of Proposition 22 on the company&#39;s earnings call.\n &#34;If our efforts here are not successful it would force us to suspend operations in California. Fortunately, California voters can make their voices heard by voting yes on Prop 22 in November,&#34; Zimmer said.\n On Monday, a California judge  granted a preliminary injunction requiring Lyft and Uber to stop classifying their drivers as independent workers after a ten day period in which the companies said they would appeal the ruling. If upheld, the order will require Lyft and Uber to treat its drivers as employees and cover additional expenses like benefits and unemployment insurance.\n California Attorney General Xavier Becerra  sued the companies in May alongside three city attorneys, alleging they violated the state&#39;s new law that aims to provide benefits to gig workers. Uber and Lyft have consistently opposed the law and are funding a ballot measure that would exempt them from it if passed.\n  Uber&#39;s Khosrowshahi has recently advocated for what he calls a &#34;third way&#34; to classify workers. He has argued there should be a way for workers to enjoy the flexibility of independent work while having access to some of the protections offered by employee status. In a  New York Times op-ed published before the court ruling, Khosrowshahi suggested gig companies could pay into funds that workers have access to based on their hours worked in order to cover health insurance, paid time off or other costs. Lyft&#39;s leadership has not been as actively vocal on alternative labor models.", "posttime": "2020-08-13 07:40:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ab5,suspend,lyft", "title": "Lyft还可能因AB5原因暂停CA的服务", "title_en": "Lyft may also suspend services in CA due to AB5", "transed": 1, "url": "https://www.cnbc.com/2020/08/12/lyft-president-says-it-may-have-to-suspend-service-in-california.html", "via": "", "real_tags": ["ab5", "suspend", "lyft"]}, {"category": "", "categoryclass": "", "imagename": "f7c8ef77c2b0eb5f773eaaf3bcf9923c.jpg", "infoid": 1017854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在TechCrunch的早期阶段，Minted首席执行官兼连环创始人玛丽亚姆·纳菲奇与我们讨论了一些创始人不经常讨论的话题。当谈到创业精神时，期望和现实之间有什么不同？你如何在联合创始人之间分配责任？在招聘方面做得好的关键是什么？我们还[…]", "note_en": "At TechCrunch Early Stage, Minted CEO and serial founder Mariam Naficy got into the weeds with us on some of the topics founders don’t often discuss. What’s the difference between expectations and reality when it comes to entrepreneurialism? How do you split responsibilities between co-founders? What’s the key to being great at hiring? We also […]", "posttime": "2020-08-13 07:16:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,执行官,surprise,创始人", "title": "\nMinted.com首席执行官玛丽亚姆·纳菲希分享“创业最大的惊喜”", "title_en": "\n\t\t\t\tMinted.com CEO Mariam Naficy shares ‘the biggest surprise about entrepreneurship’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/12/minted-com-ceo-mariam-naficy-shares-the-biggest-surprise-about-entrepreneurship/", "via": "", "real_tags": ["创业", "执行官", "surprise", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "ea0a98ab0af11c7f015b01d7ac9f5751.jpg", "infoid": 1017853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "消息人士称，两家公司上月底开始谈判，尚未达成协议。其中一位消息人士称，TikTok在印度的业务估值超过30亿美元。在6月下旬被禁止之前，TikTok在印度已经积累了超过2亿用户。\nByteDance没有回复记者的置评请求。信实表示，对猜测和传言不予置评。\n对TikTok的投资可能有助于从石油到零售的巨头信实(Reliance)与消费者建立更深层次的联系。信实是印度最有价值的公司。尽管Jio平台在存在不到四年的时间里在印度积累了近4亿用户，但其面向消费者的应用程序一直难以复制这种吸引力。\n自今年4月下旬以来，印度巨头的数字风险投资已经从包括Facebook和谷歌在内的13家知名投资者那里筹集了约200亿美元。\n两家公司进行初步谈判之际，ByteDance正努力留住印度的一些关键员工。最近几周，包括一名政策主管和负责Helo APP印度运营的罗汉·米什拉(Rohan Mishra)在内的几名公司高层管理人员已经离开公司。周三中午，米什拉没有回复记者的置评请求。\n本月早些时候，Windows制造商ByteDance证实，该公司正在单独与微软(Microsoft)在包括美国在内的选定市场出售公司业务。金融时报上周报导称，两家公司扩大了交易范围，将TikTok在欧洲和印度等其他市场的业务也包括在内。", "note_en": "The two companies began conversations late last month and have yet to reach a deal, the sources said.  TikTok’s   business in India, where it had amassed over 200 million users before it was  banned in late June, is being valued at more than $3 billion, one of the sources said.\n ByteDance did not respond to a request for comment. Reliance said it does not comment on speculation and rumor.\n  An investment in TikTok could help the oil-to-retails giant Reliance, the most valuable firm in India, make deeper connections with consumers. Even as Jio Platforms has amassed nearly 400 million users in India in less than four years of its existence, its consumer-facing apps have struggled to replicate that appeal.\n Since late April this year, Indian giant’s digital venture has raised about  $20 billion from 13 high-profile investors including Facebook and Google.\n The preliminary talks between the two companies comes as ByteDance struggles to retain some key employees in India. A handful of high-level executives at the company including a policy head and Rohan Mishra, who oversaw Helo app’s operations in India have left the company in recent weeks. Mishra did not respond to a request for comment Wednesday noon.\n ByteDance is separately  engaging to sell the company’s business in select markets including the U.S. with Microsoft, the Windows-maker confirmed earlier this month. Financial Times  reported last week that the two companies had broaden the scope of the deal to include TikTok’s business in other markets including Europe and India.", "posttime": "2020-08-13 07:15:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "印度,talks", "title": "\nByteDance与印度Reliance就投资TikTok进行谈判", "title_en": "\n\t\t\t\tByteDance in talks with India’s Reliance for investment in TikTok\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/12/bytedance-in-talks-with-indias-reliance-for-investment-in-tiktok/", "via": "", "real_tags": ["印度", "talks"]}, {"category": "", "categoryclass": "", "imagename": "f3b5426a8afe1d599b566fc0f66c6982.jpg", "infoid": 1017852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(美国有线电视新闻网)位于波多黎各阿雷西博的著名天文台在詹姆斯·邦德电影“黄金眼”中亮相，由于一根断了的电缆砸破了它巨大的碟子的侧面，该天文台被迫暂时关闭。\n凌晨2点45分左右。根据中佛罗里达大学的一份新闻稿，周一，一根帮助支撑金属平台的三英寸辅助电缆断裂。UCF与University Ana G.Méndez和Yang Enterprise，Inc.一起管理该设施。\n根据UCF的说法，当电缆断裂时，在望远镜1000英尺长的反射盘上留下了一个100英尺长的口子。它还损坏了沿天文台格里高利穹顶悬挂在反射盘上方的大约6到8块面板。\n断裂的电缆还扭曲了用于进入格里高利穹顶的平台，使损失评估变得更加困难。\nUCF研究室和研究生学院负责战略沟通的助理副总裁泽纳伊达·冈萨雷斯·科塔拉(Zenaida Gonzalez Kotala)告诉CNN，该设施的工作人员正在与工程师和其他专家合作，评估和保护设施中的设备。从(周二)开始，一直持续到本周。\n冈萨雷斯·科塔拉说，他们希望在周五的媒体吹风会上得到更多信息。\n自1963年开放以来，该望远镜一直是许多科学发现的组成部分。1995年，当它出现在007电影“黄金眼”中时，它在流行文化中变得更加出名。\nUCF的新闻稿称，通过这一切，该设施继续为引力波、小行星表征、行星探索等领域的空间研究取得重大突破做出贡献。", "note_en": "(CNN)The famous observatory in Arecibo, Puerto Rico, featured in the James Bond movie &#34;GoldenEye,&#34; has been forced to temporarily close after a broken cable smashed through the side of its massive dish.\n Around 2:45 a.m. Monday, a three-inch auxiliary cable that helped support a metal platform broke, according to a news release from the University of Central Florida. UCF manages the facility alongside Universidad Ana G. Méndez and Yang Enterprises, Inc.\n When the cable broke, it created a 100-foot gash in the telescope&#39;s 1,000-foot-long reflector dish, according to UCF. It also damaged about six to eight panels along the observatory&#39;s Gregorian Dome, which is suspended over the reflector dish.\n    The broken cable also twisted a platform used to access the Gregorian Dome, making damage assessment even more difficult.\n &#34;The folks at the facility are working with engineers and other experts to asses and secure equipment at the facility,&#34; Zenaida Gonzalez Kotala, UCF Office of Research and College of Graduate Studies&#39; assistant vice president for strategic communications told CNN. &#34;That started (Tuesday) and is continuing through this week.&#34;\n  Gonzalez Kotala says they are hoping to have more information at a media briefing on Friday\n The telescope has been an integral part of a number of scientific discoveries since it opened in 1963. It was made even more famous in popular culture when it was featured in the 007 movie, &#34;Goldeneye&#34; in 1995.\n    &#34;Through it all, the facility has continued to contribute to significant breakthroughs in space research in the area of gravitational waves, asteroid characterization, planetary exploration and more,&#34; the UCF release said.", "posttime": "2020-08-13 07:15:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,天文台,observatory,设施", "title": "阿雷西博天文台出现在詹姆斯·邦德电影“金眼”中", "title_en": "Arecibo Observatory Featured in James Bond Film 'Goldeneye' Shut Down", "transed": 1, "url": "https://www.cnn.com/2020/08/12/us/arecibo-observatory-damaged-trnd-scn/index.html", "via": "", "real_tags": ["电影", "天文台", "设施"]}, {"category": "", "categoryclass": "", "imagename": "ba26fc543c477bbfc0d51e2fc78dbefa.jpg", "infoid": 1017849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步首席执行官Dara Khosrowshahi今天出现在MSNBC上，他声称，如果加州法院最近将司机重新归类为全职员工的裁决不被推翻，公司可能不得不暂停该州的服务几个月。\nKhosrowshahi说：“很难相信我们能够迅速将我们的模式转变为全职就业。”\n在最近的一篇“纽约时报”专栏文章中，这位首席执行官辩称，让司机成为全职员工会让司机和乘客的情况变得更糟。取而代之的是，他倡导其他立法解决方案，比如要求零工经济公司为他们的工人创建福利基金。\n前首席运营官起诉Pinterest，指控其性别歧视、报复和非法解雇-弗朗索瓦·布劳赫(Françoise Brougher)表示，她在4月份被公司突然解雇。她正在起诉Pinterest，要求其“对违反公平就业和住房法案(FEHA)和劳动法的歧视、报复和不当解雇负责。”\n微软的双屏Surface Duo将于9月10日上市，售价为1,399美元-微软的双屏移动设备向现实迈出了重要的一步，公布了发布日期和价格。\nSquare的Cash App测试了一项新功能，允许用户最多借200美元--你需要在四周内偿还贷款，同时收取5%的固定费用。\n法院驳回了Genius关于歌词的诉讼-谷歌抓取歌词-这起诉讼于去年12月提起，指控谷歌违反Genius的使用条款，通过在网站上抓取歌词以显示在歌曲搜索中来不公正地谋取私利。\n龚以22亿美元的估值再次筹集了2亿美元-龚氏首席执行官阿米特·本多夫(Amit Bendov)表示，他的公司正试图创建一个他所说的“收入情报”类别。\n个人培训课程进入ClassPass-这些个人培训课程将是虚拟的，遵循与ClassPass最近推出的虚拟课程相同的用户体验流程。\n👁👄👁是否说明了迷因文化在筹资中的力量？-这项隐晦的努力是关于“信息自由法”和炒作文化如何主导风险投资对话的声明。\n亲爱的索菲：我们如何赞助H-1B签证转移和延期？-一家初创公司询问需要续签H-1B签证的求职者。\n(提醒：Extra Crunch是我们的订阅会员计划，旨在使初创企业的信息大众化。您可以在这里注册。)。\n莎拉·库珀(Sarah Cooper)以在TikTok上对唐纳德·特朗普(Donald Trump)的印象而闻名，她刚刚与Netflix达成了一项协议，名为“莎拉·库珀：一切都好”(Sarah Cooper：Everything‘s Fine)，该剧将由娜塔莎·里昂(Natasha Lyonne)执导，玛雅·鲁道夫(Maya R。\n节省TC Sessions：Mobility 2020的团体折扣-如果您痴迷于在世界各地移动人员、产品和套餐的未来，您不会想错过10月6-7日的TC Sessions：Mobility 2020。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "Uber CEO Dara Khosrowshahi appeared on MSNBC today and claimed that if  a recent California court ruling reclassifying drivers as full-time employees is not overturned, the company  might have to suspend services in that state for several months.\n  “It’s hard to believe we’ll be able to switch our model to full-time employment quickly,” Khosrowshahi said.\n In  a recent New York Times op-ed, the chief executive argued that making drivers full-time employees would make things worse for both drivers and riders. Instead, he advocated for other legislative solutions like requiring gig economy companies to create benefits funds for their workers.\n  Former COO sues Pinterest, accusing it of gender discrimination, retaliation and wrongful termination — Françoise Brougher, who says she was abruptly fired from the company in April, is suing the company to hold it “accountable for discrimination, retaliation, and wrongful termination in violation of the Fair Employment and Housing Act (FEHA), and the Labor Code.”\n Microsoft’s dual-screen Surface Duo arrives September 10 for $1,399 — Microsoft’s dual-screen mobile device took an important step closer to reality, with a release date and price.\n Square’s Cash App tests new feature allowing users to borrow up to $200 — You’ll be expected to pay the loan back in four weeks, along with a flat fee of 5%.\n  Court dismisses Genius lawsuit over lyrics-scraping by Google — The lawsuit, filed in December, accused Google of violating Genius’s terms of use and unjustly enriching itself by scraping lyrics on the site to be displayed on searches for songs.\n Gong raises another $200M on $2.2B valuation — Gong CEO Amit Bendov says his company is trying to create a category he described as “revenue intelligence.”\n Personal training sessions come to ClassPass — These personal training sessions will be virtual and follow the same UX flow as ClassPass’s recently introduced virtual classes.\n  Does 👁👄👁 illustrate the power of meme culture in fundraising? — The cryptic effort was a statement on how FOMO and hype culture dominate venture capital conversation.\n Dear Sophie: How can we sponsor H-1B transfers and extensions? — A startup asks about job applicants who need to get their H-1B visas renewed.\n (Reminder: Extra Crunch is our subscription membership program, which aims to democratize information about startups.  You can sign up here.)\n  Sarah Cooper, known for her impressions of Donald Trump on TikTok, just landed a Netflix deal — Titled “Sarah Cooper: Everything’s Fine,” the production will be directed by Natasha Lyonne and executive produced by the Maya Rudolph.\n Save with group discounts to TC Sessions: Mobility 2020 — If you’re tech-obsessed about the future of moving people, products and packages around the world, you do not want to miss TC Sessions: Mobility 2020 on October 6-7.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-08-13 06:49:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crunch", "title": "\nDaily Crunch：优步CEO称CA关闭可能是必要的", "title_en": "\n\t\t\t\tDaily Crunch: Uber CEO says CA shutdown may be necessary\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/12/daily-crunch-california-shutdown/", "via": "", "real_tags": ["crunch"]}, {"category": "", "categoryclass": "", "imagename": "7099b08c78a00de2a6feffe331ce16fb.jpg", "infoid": 1017848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在微软决定关闭与之竞争的Mixer平台后，世界上最受欢迎的直播主持人之一迈克尔·格泽谢克(Michael Grzesiek)于周三重返Twitch，甚至在正式开始之前，他的复出流就吸引了近50万活跃观众。在美国东部时间下午2点50分左右，肖德打开相机之前，许多观众出现了，结果却发现了一条“很快开始”的信息。Twitch用户继续蜂拥而至，仅在一小时过后几分钟，Shroud的活跃观众就超过了50万。\n肖德说，他的迟到是由于技术困难，他引用了一个常见的罪魁祸首，当他在预定的流媒体上迟到时，这在他的粉丝军团中已经成为一个内部笑话。但他确实表示，明显的比特率和音频问题的最终结果是，他的数据流可能会保持在720p的上限。尽管存在早期的问题，但一条新的山羊胡子裹尸布点燃了Riot的新战术射手Valorant，他开始在那里保持大约40万到47.5万活跃观众。Shroud目前占据了Valorant超过80%的收视率，它现在坐在观看次数最多的Twitch排行榜的榜首。\n肖德和他在堡垒之夜饰演的当代泰勒“忍者”布莱文斯一起，与Mixer签署了一项协议，据报道，作为关闭条款的一部分，微软向他和其他流媒体支付了独家合同。然后，他花了一个多月的时间离开流媒体，同时考虑他可能会回到哪个平台，然后在昨天宣布，他将回到最初开始流媒体的亚马逊(Amazon)旗下的产品。\n尽管微软与Facebook合作，将其现有的用户群转移到Facebook的Facebook游戏平台上，但忍者和Shroud等热门流媒体公司可以自由谈判新的交易，Shroud选择了Twitch。目前还不清楚该平台花了多少钱来保护他，但据报道，微软为他在Mixer上短暂的时间支付了大约1000万美元。", "note_en": "Michael “Shroud” Grzesiek, one of the most popular live streamers in the world,  returned to Twitch on Wednesday following Microsoft’s decision to  shut down the competing Mixer platform, attracting nearly 500,000 active viewers in his comeback stream before it even officially started. Many of those viewers showed up only to find a “starting soon” message, before Shroud turned his camera on at roughly 2:50PM ET. Twitch users continued to pour in, and Shroud surpassed half a million active viewers just a few minutes past the hour.\n Shroud says his lateness was due to technical difficulties, a common culprit he cites when showing up late to scheduled streams that has become a bit of an inside joke among his legion of fans. But he did say the end result of apparent bit rate and audio issues was that his stream might remain capped at 720p. Despite the early issues, a freshly goateed Shroud fired up Riot’s new tactical shooter  Valorant, where he began maintaining between about 400,000 and 475,000 active viewers. Shroud is currently responsible for more than 80 percent of the viewership of  Valorant, which is now sitting at the top of the most-viewed Twitch charts.\n Shroud, alongside his  Fortnite-playing contemporary Tyler “Ninja” Blevins, signed a deal with Mixer before Microsoft  reportedly paid him and other streamers out of their exclusive contracts as part of the shutdown terms. He then spent more than a month away from streaming while he deliberated which platform he might return to, before  announcing yesterday that he would come back to the Amazon-owned product where he originally began streaming.\n Although Microsoft partnered with Facebook to transition its existing base of users over to the social network’s Facebook Gaming platform, popular streamers like Ninja and Shroud were free to negotiate new deals, and Shroud picked Twitch. It’s unclear how much money the platform paid to secure him, but Microsoft  reportedly paid him in the ballpark of $10 million for his brief time on Mixer.", "posttime": "2020-08-13 06:17:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "返回,stream,流媒体", "title": "在Mixer关闭后，Michael“Croud”Grzesiek于周三返回Twitch；他的返回流在其高峰期吸引了约500K活跃观众", "title_en": "Michael “Shroud” Grzesiek returned to Twitch on Wednesday, following Mixer's shutdown; his return stream attracted ~500K active viewers at its peak", "transed": 1, "url": "https://www.theverge.com/2020/8/12/21365355/shroud-return-twitch-500-thousand-viewers-streaming-valorant?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["返回", "stream", "流媒体"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在看到一些最奇怪的东西出现在我的推特时间线上后，我决定深入挖掘，亲眼看看这头野兽的肚子里发生了什么。我关注的一个人刚刚在推特上转发了一些信息，表面上看这些信息太离谱了，甚至连想都不敢想，他想知道是什么原因造成了这种情况。简而言之，最初的推文提到新冠肺炎是一个骗局，病毒不是真的，整个混乱只是“他们”的借口，如果不是直接用疫苗杀死我们，就是为了让我们所有人都得到控制。\n从专业上讲，我拿钱是为了区分事实和虚构，判断公司声明中哪些是真实的，哪些是不真实的，弄清楚这是故意的还是偶然的，并找出让它们更快前进的方法。这与揭穿阴谋论有很大不同，但有一些相似之处，一些可以用于一种阴谋论的工具也可以用于另一种阴谋论。有趣的是，这从来不是一个要求。人们之间分享的阴谋论是如此愚蠢和怪异，以至于你必须稍微放松一下才能相信其中的任何一件事。\n而这--我后来才意识到--正是它起作用的原因。社交媒体创造了一种结构，在这里，容易上当的人和胡作非为的制造者可以接触到对方，完全没有摩擦。外面有很多容易上当的人。例如，山达基仅仅通过站在街上就成功地在几乎每个他们想要开展业务的国家建立了立足点。没有网络，没有社交媒体，什么都没有。只是一些普通的老掉牙的谈话技巧。他们一点一滴地把原本健康、思维正常的人拉入他们的谎言和欺骗之网，同时骗取他们所有的钱。\n我带头进入互联网的腋窝并没有拿出那么难看的东西，我看到的没有一个人比前一天口袋里的钱少了。但我确实看到的是，如果这是一场彻头彻尾的现金骗局，其破坏力是一样的，甚至更大。正在发生的事情是，人们被这些虚假的迷因相互感染，通过联合起来，他们重新强化了这些信仰，就好像它们是无懈可击的真理一样。他们形成了迷你邪教，保护彼此不受质疑这些经常是绝对荒谬的信仰的外人的影响，这随后强化了社会结构，使他们更难摆脱这种结构。\n如果这只限于全世界几百人，我想我甚至不会费心写这篇文章。但是，有数百万这样容易上当受骗，最终是出于善意的人。他们都有投票权，他们都觉得他们也只有他们知道什么是真的。我们其余的人都是被骗的白痴。我们梦游进入我们自己的屠杀，只有他们才能看到真相。在他们的世界里，比尔·盖茨是撒旦，通过使用新冠肺炎疫苗来“扑杀”我们所有人，这将使我们摆脱集体的痛苦，这样亿万富翁就可以继承一个空虚的地球。我没有骗你，我希望我是。\n互联网使每个人都有可能与其他每个人进行交流。Facebook和Twitter已经为用户提供了平台，他们可以利用这些平台在几秒钟内将信息传播到更远更广的地方。乏味的事实甚至还没有穿上鞋子，性感的共谋理论就已经让它绕了半个世界又回来了。5G会致癌，可以用于精神控制，是“他们”用来监视我们所有人的工具。就像每一个善意的谎言一样，里面也有一丝真理。如果你把你的头伸进一个强大的几GHz发射机里，你不会变得更健康。打开和关闭它，它可能会让你头疼。事实上，它们可以用来确定谁是谁，什么时候是，分辨率相当好。但前两种方法简直就是哑巴，而第三种方法是我们自第一次无线电猎狐以来所能做到的，那就是三角测量，它和无线电一样古老。所有这些都没有阻止一群人放火焚烧手机发射塔，这可能会限制人们获得紧急服务。\n有一件事让我感兴趣，但到目前为止我还没有弄清楚它是如何开始的。一个“正常”的人怎么会走进这个上上下下的邪教世界，而不对自己说：“嗯，这似乎不可信”。同谋理论的精神病毒总得在某个地方生根发芽。例如，我认识一个人，他认为9⁄11从未发生过。他说这都是CGI和一个巨大的阴谋。但关键是：他是一名CGI专家，他很可能会让它看起来像是真的，但事实并非如此。只是他不想再改变自己的立场，因为他一直对此大喊大叫，令人厌恶，以至于不可能掉头。他太沉迷于自己的妄想小世界，不敢后退一步。在他的情况下，我明白。\n但是，一个做聚合酶链反应分析的人，知道聚合酶链反应检测的来龙去脉，坚持认为没有新冠肺炎这样的东西，对我来说是另一个水平。这就是那种目的\n那么，这一切通向何方：地球上现在有相当大一部分人能够近乎实时地交流，能够传播好的信息和坏的信息。如果我们不想意外地失去我们的民主、我们的健康和我们的安全等次要问题，从好中筛选出坏的将是非常重要的。共谋论的追随者只会在自己的小泥潭里陷得更远，他们不想看到自己的观点受到挑战。当你准备好被人叫各种各样的名字时，在一天的时间里，我被称为付费药房先令，付费政府先令，还有一大堆不堪重复的描述。你不可能跟愚蠢和/或疯狂的人讲道理。但他们有很多人，他们都有投票权，等待着作为有用的白痴被推到更高的目标上。政客们已经开始意识到，他们实际上并不需要获得真正的授权，他们也不会因为撒谎而被追究责任。在这个层面上，每次有人撒谎，就会有更多的人容易被拉入这张欺骗的网中。\n作为社交媒体的用户，我们都可以通过核实所说的话是否是真的来发挥作用，但对一个人来说显然是胡说八道的话对另一个人来说可能听起来是可信的，特别是如果他们容易上当，数据以正确的方式利用了他们的感受。如果Facebook和Twitter都能更主动地关闭这些胡说八道的喷泉，那将真的很有帮助。一种快速举报散布虚假信息的Tweet或FB帖子的方法已经很有帮助了。Twitter现在为你提供了一系列的选择，但据我所知，那一个是不可用的，这很有趣，因为它可能是我可能会以一定频率使用的唯一一个。\n关闭这种媒介精神感染很重要，我怀疑如果我们不这样做，我们的机构可能无法在第一个社交媒体时代幸存下来。这是一股正在酝酿中的强大力量，我们忽视它会给我们带来集体危险。只要合谋理论散布在扬声器角落，损害就是有限的。现在整个世界都在他们的演讲台上，而且是一下子。我的时间到了。", "note_en": "After seeing some of the weirdest stuff ever show up in my  Twitter timeline I decided to dig in and see for myself what is going on in the underbelly of the beast. Someone I follow had just re-tweeted a bit of information that at face value seemed too outrageous to even consider and wondered what made that happen. In short, the original tweet mentioned that COVID-19 is a hoax, that the virus isn’t real and that this whole pandemonium is just an excuse by ‘them’ to get us all under control if not to outright murder us using a vaccine.\n Professionally I get paid to separate fact from fiction, to determine what is and what isn’t true in the statements a company makes, to figure out if that is intentional or accidental and to figure out ways to make them go forward faster. This is very much unlike debunking conspiracy theories, but there are some similarities and some of the tools that can be used for the one can be used for the other. Funny enough, that never was a requirement. The conspiracy stuff that people share amongst each other is so dumb and so weird that you have to be a little bit loose in the head to believe any of it.\n And that - I realized belatedly - is exactly why it works. Social media has created a fabric where the gullible and the amok makers can reach ech other, totally free of friction. And there are a lot of gullible people out there. Scientology for instance, managed to create a foothold in almost every country where they wanted to operate simply by standing around on the street. No web, no social media, nothing. Just plain old conversational skills. And bit by bit they pull otherwise healthy and well thinking individuals into their web of lies and deception, in the meantime fleecing them of all their money.\n My lead into the armpit of the internet did not come up with something quite that ugly, nobody that I saw ended up with fewer $ in their pocket than they had the day before. But what I did see is as damaging or even more so than if it had been an outright scam for cash. What is happening is that people are infecting each other with these false memes and by cliquing together they then re-inforce these beliefs as though they are unassailable truths. And they form mini cults protecting each other from outsiders that question these often absolutely ridiculous beliefs, which then reinforces the social structure and makes it even harder for them to snap out of it.\n If this was limited to a few hundred people world wide I don’t think I’d even bother writing this. But there are  millions of these gullible, ultimately well meaning people. They all have the vote, and they all feel that they and only they know what is true. The rest of us are deluded idiots. We are sleepwalking into our own slaughter and only they see the truth. In their world Bill Gates is Satan, out to ‘cull’ us all through the use of the COVID-19 vaccine which will put us out of our collective misery so the billionaires can inherit an empty Earth. I kid you not, I wished I was.\n The internet has made it possible for every individual to communicate with every other individual. Facebook and Twitter have given users platforms that they can use to spread information far and wide, in seconds. The boring truth hasn’t even put on its shoes before the sexy complot theory has made it halfway around the world and back. 5G causes cancer, can be used for mind control and is a tool that ‘they’ use to spy on all of us. And like every good lie, there is a grain if truth in there. If you stick your head inside a powerful several GHz transmitter you won’t get healthier. Switching it on and off and it will probably be able to give you a headache. They can in fact be used to determine who was were and when with pretty good resolution. But the first two are simply dumb and the third we’ve been able to do since the first radio fox hunt, it’s called triangulation and is as old as radio. None of that stopped a bunch of people from setting cell phone towers on fire, potentially limiting access to emergency services.\n One thing that interests me and that I have so far not been able to find out is how it starts. How does a ‘normal’ person step into this cult world where up is down and not think to themselves: “Hm, this does not seem like it is believable”. The mental virus of a complot theory has to take root somewhere. For instance, I know a guy that believes that  9⁄ 11 never happened. He says it is all CGI and a giant plot. But the kicker is: he is a CGI expert, he probably  could make it look like it was real when it wasn’t. It’s just that he does not want to change his position any more because he has been so loud and obnoxious about it that a turn-about is impossible. He’s too vested in his little world of delusion to make a step back out. In his case I get it.\n But a person who does PCR analysis and knows the ins and outs of PCR tests that maintains that there is no such thing as COVID-19 is on another level for me. That’s the kind of purposeful refusal of the world as it exists all around us that I can not get my head wrapped around. You’d  think that qualifying for such a position would mean that you understand the subject matter enough to appreciate the predictive capability of a properly set up test. Ok, such a test will still have a substantial false positive rate. But it is super useful when there is corroborating evidence and also useful to spot trends.\n So, where is this all leading: we have a sizeable fraction of planet Earth now communicating in near real time with the ability to spread both good and bad information. Filtering out the bad from the good is going to be very important if we don’t want to accidentally lose such minor marbles as our democracies, our health and our safety. The complot theory adherents are only going to sink further away in their own little quagmires, they are not interested in seeing their views challenged. And when you do be prepared to be called all kinds of names, in the space of a day I got called a paid pharma shill, a paid government shill, and a whole bunch of descriptions that don’t bear repeating here besides. You are not going to be able reason with stupid and/or crazy. But there are a lot of them and they all have the vote, waiting to be pushed as useful idiots to some higher goal. Politicians have started to realize that they don’t actually need to get a real mandate, and that they won’t be held accountable for lying. At that level, every time someone lies more people become susceptible to being pulled in to this web of deception.\n As users of social media we could all make a difference by verifying if what is being said is real, but what’s obviously bullshit to one person may sound plausible to another, especially if they are gullible and the datum plays on their feelings in the right way. It would really help if both Facebook  and Twitter would be far more pro-active in shutting down these fountains of nonsense. An quick way to report a Tweet or FB post that spreads disinformation would already help a lot. Twitter right now gives you a whole range of options but that one is - as far as I can see - not available, which is funny given that it is the only one that I would probably use with some frequency.\n Shutting down this vector mental infection is important, I suspect that if we do not that our institutions may not survive the first Social Media Era. This is a powerful force that is brewing and we ignore it at our collective peril. As long as complot theories were spread on  speakers corner only the damage was limited. Now the whole world is on their soapbox and all at once. Time to get of mine.", "posttime": "2020-08-13 06:16:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "媒体,media", "title": "社交媒体问题", "title_en": "The Social Media Problem", "transed": 1, "url": "https://jacquesmattheij.com/the-social-media-problem/", "via": "", "real_tags": ["媒体", "media"]}, {"category": "", "categoryclass": "", "imagename": "41f7a136ef97e31367710eba14fe18c1.jpeg", "infoid": 1017846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "将Spotify等应用程序跨越两个屏幕，轻松查看、滚动、收听和观看更多内容*，1。\n将Spotify等应用程序跨越两个屏幕，轻松查看、滚动、收听和观看更多内容*，1。\n将Spotify等应用程序跨越两个屏幕，轻松查看、滚动、收听和观看更多内容*，1。\nSurface Duo现在可以预订，Surface Duo将于9月10日开始发货。Surface Duo将在AT&amp；、T-Mobile和Verizon网络(包括子公司和国际合作伙伴网络)上运行。5个。\n您的设备包含磁铁，可能会损坏信用卡、存折、出入卡、登机牌或停车牌等物品。请在您的设备和受磁铁影响的物体之间保持安全距离。有关您的设备的重要安全信息，请查看https://support.microsoft.com/en-us/help/4558037/product-safety-warnings-and-instructions。\n*部分设备、附件和软件单独销售。某些应用程序和功能需要额外费用和/或订阅。可用的应用程序可能会因运营商和时间的不同而不同。通话需要数据计划；有关价格和覆盖范围的详细信息，请参阅运营商。\n[3]微软于2020年8月使用试生产Surface Duo单元和软件通过Wi-Fi与LTE连接到网络进行测试。测试包括在活动使用场景下的完全电池放电和在挂起状态下的耗电测量。活跃的使用场景不包括手机通话，包括单屏和双屏场景，包括(1)通过多个打开的选项卡访问8个热门网站的网络浏览测试，(2)利用Microsoft Team音频和视频通话以及Microsoft Word、PowerPoint、Excel和Outlook进行的工作效率测试，(3)发送和接收SMS短信，以及(4)通过YouTube应用程序流式播放视频。所有设置均为默认设置，但禁用了自适应亮度，并且屏幕设置为150尼特。电池寿命因网络和功能配置、信号强度、设置、使用和其他因素而显著不同。电池充电周期有限，无法更换。\n[4]这需要您的手机应用程序、安装了最新Windows更新的Windows 10 PC，以及从Windows应用商店下载Windows 10应用程序。\n自适应摄像头11MP、f/2.0、1.0µm、PDAF和84.0°对角视场，前后均采用AI优化。\nLTE：4x4 MIMO，Cat.18 DL/Cat 5 UL，5CA，LAA。最高1.2 Gbps下载/最高150 Mbps上传。\n单声道扬声器，双麦克风噪音抑制和回声消除优化，可在所有姿势下高效使用。\n支持的音频格式：3GP、MP3、MP4、MKV、WAV、OGG、M4A、AAC、TS、AMR、FLAC、MID、MIDI、RTTL、RTX、OTA、IMY。\n支持市场上所有几代Surface超薄钢笔、Surface Pen和Surface Hub 2 Pen*。\n您的设备包含磁铁，可能会损坏信用卡、存折、出入卡、登机牌或停车牌等物品。请在您的设备和受磁铁影响的物体之间保持安全距离。有关您的设备的重要安全信息，请查看https://support.microsoft.com/en-us/help/4558037/product-safety-warnings-and-instructions。\n*部分设备、附件和软件单独销售。某些应用程序和功能需要额外费用和/或订阅。可用的应用程序可能会因运营商和时间的不同而不同。通话需要数据计划；有关价格和覆盖范围的详细信息，请参阅运营商。\n[2]-本地视频播放：微软于2020年7月使用试生产Surface Duo单元和软件进行了测试。测试包括在单个屏幕上播放本地视频期间充满电池放电。视频播放由重复播放的1080p、24fps的30分钟.mp4文件组成。所有设置均为默认设置，但以下情况除外：LTE和Wi-Fi都与禁用了“请求加入”的网络相关联，并且禁用了自适应亮度，屏幕设置为100尼特。电池寿命随网络和功能配置、信号强度、设置、使用和其他因素而显著不同。电池充电周期有限，无法更换。\n待机时间：微软于2020年7月在AT&amp；认证实验室使用预生产Surface Duo单元和软件进行测试。测试按照AT&amp；T要求和测试规范进行，所有设置均为默认设置，网络设置为：已连接到LTE，且Wi-Fi已启用但未连接。电池寿命因网络和功能配置、信号强度、设置、使用和其他因素而显著不同。电池充电周期有限，无法更换。\n演讲时间：微软于2020年7月在AT&amp；T认证实验室使用预生产Surface Duo单元和软件进行测试。根据AT&amp；要求和测试规范进行测试。所有设置均为默认设置，网络设置为：已连接到LTE，且Wi-Fi已启用但未连接。电池寿命因网络和功能配置、信号强度、设置、使用和其他因素而显著不同。电池充电周期有限，无法更换。\n[5]使用eSIM需要无线服务计划(其中可能包括对切换服务提供商和漫游的限制，即使在合同到期之后也是如此)。并不是所有的运营商都支持eSIM。AT&amp；T锁定设备将不支持eSIM。从某些运营商购买时，可能会禁用Surface Duo中的eSIM。有关详细信息，请参阅您的运营商。\n[6]系统软件占用大量存储空间。可用存储可能会根据系统软件更新和应用程序使用情况发生变化。1 GB=10亿字节。1 TB=1,000 GB。有关更多详细信息，请访问Surface.com/Storage。\n[8]视频播放格式将需要来自Google Play商店的第三方应用程序；可能会收费。\n当您从Microsoft商店购买时，通过合格的折价可获得高达700美元的返现。查看如何&gt；\nSurface Duo将在AT&amp；T；、T-Mobile和Verizon网络(包括子公司和国际合作伙伴网络)上开展工作。5个", "note_en": "Span apps such as Spotify across both screens to easily view, scroll, listen, and watch with more real estate *,1\n   Span apps such as Spotify across both screens to easily view, scroll, listen, and watch with more real estate *,1\n   Span apps such as Spotify across both screens to easily view, scroll, listen, and watch with more real estate *,1\n                Pre-order is now available, and Surface Duo will start to ship September 10. Surface Duo will work on AT&amp;T, T-Mobile and Verizon networks including subsidiary and international partner networks. 5\n          Your device contains magnets, which may damage objects such as credit cards, passbooks, access cards, boarding passes, or parking passes. Please keep a safe distance between your device and objects that are affected by magnets. Please review  https://support.microsoft.com/en-us/help/4558037/product-safety-warnings-and-instructions for important safety information about your device.\n  * Some devices, accessories, and software sold separately. Additional fees and/or subscriptions required for some apps and features. Available apps may vary by carrier and over time. Calling requires data plan; see carrier for pricing and coverage details.\n        [3] Testing conducted by Microsoft in August 2020 using preproduction Surface Duo units and software over Wi-Fi with LTE associated to a network. Testing consisted of full battery discharge during active use scenarios and a power drain measurement in Suspend. The active use scenarios excluded cell calls and included both single screen and dual screen scenarios, consisting of (1) a web browsing test accessing 8 popular websites over multiple open tabs, (2) productivity tests utilizing Microsoft Teams audio and video calls and Microsoft Word, PowerPoint, Excel and Outlook, (3) sending and receiving SMS text messages, and (4) streaming a video through the YouTube app. All settings were default except Adaptive Brightness was disabled, and screen was set to 150 nits. Battery life varies significantly with network and feature configuration, signal strength, settings, usage and other factors. Battery has limited recharge cycles and cannot be replaced.\n  [4] Requires the Your Phone app, a Windows 10 PC with the latest Windows updates, and download of the Windows 10 app from the Windows store.\n  Adaptive camera 11MP, f/2.0, 1.0 µm, PDAF and 84.0° diagonal FOV optimized with AI for front and rear\n      LTE: 4x4 MIMO, Cat.18 DL / Cat 5 UL, 5CA, LAA. Up to 1.2Gbps Download / Up to 150Mbps Upload\n          Mono speaker, Dual Mic noise suppression and echo cancellation optimized for productive use in all postures\n    Audio formats supported: 3GP, MP3, MP4, MKV, WAV, OGG, M4A, AAC, TS, AMR, FLAC, MID, MIDI, RTTL, RTX, OTA, IMY\n              Supports all in market generations of Surface Slim Pen, Surface Pen and Surface Hub 2 Pen *\n        Your device contains magnets, which may damage objects such as credit cards, passbooks, access cards, boarding passes, or parking passes. Please keep a safe distance between your device and objects that are affected by magnets. Please review  https://support.microsoft.com/en-us/help/4558037/product-safety-warnings-and-instructions for important safety information about your device.\n  * Some devices, accessories, and software sold separately. Additional fees and/or subscriptions required for some apps and features. Available apps may vary by carrier and over time. Calling requires data plan; see carrier for pricing and coverage details.\n        [2]  Local Video Playback: Testing conducted by Microsoft in July 2020 using preproduction Surface Duo units and software. Testing consisted of full battery discharge during local video playback on a single screen. Video playback consisted of a repeated 30-minute .mp4 file in 1080p at 24 fps. All settings were default except: LTE and Wi-Fi were both associated with a network with ‘ask to join’ disabled and Adaptive Brightness was disabled, screen was set to 100 nits. Battery life varies significantly with network and feature configuration, signal strength, settings, usage, and other factors. Battery has limited recharge cycles and cannot be replaced.\n  Standby Time: Testing conducted by Microsoft in July 2020 in an AT&amp;T Validated Lab using preproduction Surface Duo units and software. Testing conducted in accordance with AT&amp;T requirements and test specifications.  All settings were default, and network settings were: connected to LTE, and Wi-Fi was enabled but not connected. Battery life varies significantly with network and feature configuration, signal strength, settings, usage and other factors. Battery has limited recharge cycles and cannot be replaced.\n  Talk Time:  Testing conducted by Microsoft in July 2020 in an AT&amp;T Validated Lab using preproduction Surface Duo units and software. Testing conducted in accordance with AT&amp;T requirements and test specifications. All settings were default, and network settings were: connected to LTE, and Wi-Fi was enabled but not connected. Battery life varies significantly with network and feature configuration, signal strength, settings, usage and other factors. Battery has limited recharge cycles and cannot be replaced.\n      [5] Use of eSIM requires a wireless service plan (which may include restrictions on switching service providers and roaming, even after contract expiration). Not all carriers support eSIM. AT&amp;T locked devices will not support eSIM. Use of eSIM in Surface Duo may be disabled when purchased from some carriers. See your carrier for details.\n  [6] System software uses significant storage space. Available storage is subject to change based on system software updates and apps usage. 1 GB = 1 billion bytes. 1 TB = 1,000 GB. See  Surface.com/Storage for more details.\n    [8] Video playback formats will require 3rd party apps from the Google Play Store; fees may apply.\n    Get up to $700 cash back with a qualified trade-in when you purchase from Microsoft Store.\r  SEE HOW &gt;\n  Surface Duo will work on AT&amp;T, T-Mobile and Verizon networks including subsidiary and international partner networks. 5", "posttime": "2020-08-13 06:16:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "surface,网络", "title": "新表面二人组(The New Surface Duo)", "title_en": "The New Surface Duo", "transed": 1, "url": "https://www.microsoft.com/en-us/surface/devices/surface-duo?activetab=overview", "via": "", "real_tags": ["surface", "网络"]}, {"category": "", "categoryclass": "", "imagename": "ca0d062d712c3b3c2b3ec68d02596ddc.jpg", "infoid": 1017844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果已经发布了三个操作系统的软件更新：iPhone和iPod的iOS，iPad的iPadOS和Mac的MacOS。这些更新很小，并且专注于错误修复，而不是添加新功能。\n这些更新被标记为iOS 13.6.1、iPadOS 13.6.1和MacOS 10.15.6补充更新。通常，有两个小数点的iOS或iPadOS更新是错误修复更新，而带来新功能的版本只有一个小数点。\n移动设备更新修复了导致存储无法按预期清除的问题，解决了可能导致某些显示器呈现绿色的漏洞，并修复了可能对某些用户禁用曝光通知的问题。至于MacOS，苹果只提到了两个更改：修复了与虚拟化应用程序相关的稳定性问题，以及修复了刚刚发布的全新iMac独有的睡眠唤醒问题。在MacOS方面，苹果只提到了两个变化：一个是与虚拟化应用程序相关的稳定性问题的修复，另一个是刚刚发布的全新iMac独有的睡眠唤醒问题。这两个问题都是针对MacOS的：一个是与虚拟化应用程序相关的稳定性问题的修复；另一个是刚刚发布的全新iMac独有的从睡眠中唤醒的问题。\n解决了在可用存储不足时可能不会自动删除不需要的系统数据文件的问题。\n解决了‌iMac‌(视网膜5K，27英寸，2020)在从睡眠中醒来后可能会出现褪色的问题。\n今天，所有这些更新都应该在全球范围内向所有受支持设备的用户推出。", "note_en": "Apple has released software updates for three of its operating systems: iOS for iPhones and iPods, iPadOS for iPads, and macOS for Macs. The updates are small and focus on bug fixes rather than adding new features.\n The updates are labeled iOS 13.6.1, iPadOS 13.6.1, and macOS 10.15.6 Supplemental Update. Typically, iOS or iPadOS updates that have two decimal points are bug-fix updates, and releases that bring new features have just one decimal point.\n The mobile device update fixes a problem that prevented storage for being cleared as intended, addressed a bug that could cause &#34;some displays to exhibit a green tint,&#34; and fixed an issue &#34;where Exposure Notifications could be disabled for some users.&#34; As for macOS, just two changes are named by Apple: a fix for a &#34;stability issue&#34; related to virtualization apps, and a wake-from-sleep problem unique to the brand-new iMac that just released.\n  Addresses an issue where unneeded system data files might not be automatically deleted when available storage is low\n  Resolves an issue where an ‌iMac‌ (Retina 5K, 27-inch, 2020) may appear washed out after waking from sleep\n All these updates should be rolling out to all users of supported devices globally today.", "posttime": "2020-08-13 05:53:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,apple,苹果", "title": "苹果iOS和iPadOS 13.6.1面向所有用户推出", "title_en": "Apple’s iOS and iPadOS 13.6.1 roll out to all users", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/08/apples-ios-and-ipados-13-6-1-roll-out-to-all-users/", "via": "", "real_tags": ["ios", "apple", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "4d26003a705ed4867c4c3dddcbdb18ff.jpg", "infoid": 1017843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，这个由旧金山湾区创立的活动处理了一场内部冲突，因为聚会的规模越来越大，吸引了硅谷富有的科技阶层的大量存在，活动内容包括交钥匙体验、空调营地、直升机和龙虾晚餐。现在，在一场历史性大流行的阴影下，这场大规模、标志性活动背后的组织正在拼命工作，在一些科技行业参与者的无偿帮助下，将2020年的艺术节转向数字形式，同时避免财务崩溃。\n距离活动开始只有几周的时间，该组织正在召集一群具有虚拟现实、区块链、催眠和沉浸式戏剧背景的技术专家，以创建一个黑客聚合的社交产品网络，他们希望这些产品能捕捉到燃烧的人的氛围。\n虚拟是一个前所未有的举动，因为一个仅仅存在的事件似乎已经违反了先例。\n“燃烧的人”每年8月下旬在内华达州的黑岩沙漠举行。在9天的时间里，自称燃烧者的与会者用大量的艺术装置、舞台和营地填满了这片荒凉的风景。在过去的几十年里，出席人数一直在攀升，以至于联邦政府介入了进来，创建了一份超过170页的报告，解释为什么应该限制活动的出席人数。2019年有超过7.8万人参加。\n这是一种对社会的逃避，是一种共享的社会体验，似乎在其他地方是无法复制的。\n史蒂文·布鲁门菲尔德成为“燃烧的人”的首席技术官几天后，该组织的领导人公开宣布，由于新冠肺炎疫情的影响，体育赛事将突然取消，该团队将全力以赴进行一次虚拟聚会。尽管这位连环CTO预计这一职位在很大程度上将涉及维护活动媒体基础设施的棘手任务，但很快他就被迫重新考虑这场数十年前并充斥着传说的庞大活动的前端。\n“我的第一个倾向是，‘太棒了！让我们去建立一个巨大的3D VR世界怎么样…。因此，我花了头两周的时间研究我为员工准备了什么，在时间框架上准备了什么，以及我们实际上可以做些什么，“布鲁门菲尔德说。“这是不可能的。你知道吗，实际上我还是想这么做的。我想要一个挑战，…。但现实是，这是不可能发生的。“。\n“燃烧的人”是一项巨大的事业，在1986年首次举办的旧金山，以至硅谷，都有着特别深厚的情感。当“燃烧的人”项目宣布该活动将转向数字形式时，社区迅速涌入，以帮助破译网格上的虚拟“燃烧的人”可能是什么样子，这并不令人惊讶。“燃烧的人”项目宣布这一活动将转向数字形式，社区的意见迅速涌入，以帮助破译网格上的虚拟“燃烧的人”可能是什么样子。\n“我们有1.4万人告诉我们，他们想以某种方式为虚拟的黑石城做出贡献，”该组织的艺术和公民参与部主任金·库克(Kim Cook)说。“他们中的一些人说，他们想贡献的是爱；所以这很酷。我们也有大约1000名员工表示，他们想做开发人员式的工作。“。\n一些向“燃烧的人”项目伸出援手的团体是那些愿意打造“燃烧的人”体验，但想要官方品牌呈现的公司。尽管财务状况岌岌可危，但“燃烧的人”的组织者拒绝了这些赞助商的帮助，理由是该组织坚持“去商品化”-希望防止企业渗透到活动中，避免广告、品牌舞台和企业合作伙伴关系。\n布鲁门菲尔德和其他人离开了专业制片厂，选择了一个由小型独立团队组成的网络，这些团队都是愿意在自己的时间为活动开发官方数字体验的燃烧者。\n八个项目最终成为官方的“公认的宇宙”，每个项目都对虚拟燃烧人应该是什么样子采取了截然不同的方法。一些人将精力集中在虚拟现实上，而另一些人则在视频聊天中增加社交层次，或者在第二人生(Second Life)或微软的AltspaceVR等现有平台上构建3D环境。\n在大流行期间，经过修改的开发者会议和贸易展能够相当无缝地将主旨演讲或小组讨论转换为Zoom格式，但参与其中的团队意识到，可能无法在在线平台上复制的燃烧人体验中有很多元素。创建该活动虚拟世界的开发者决心重新思考在线社交网络的惯例，以确保燃烧者今年能结交新朋友。\n“敬畏和规模的感觉是微妙的，”埃德·库克(Ed Cooke)说，他正在开发一款官方应用程序。“对”燃烧的人“的一种解释是，它是一种你在去那里的路上发生的所有事情的副作用而获得的一种精神状态。”\n库克是伦敦一家初创公司的创始人，也有“记忆大师”的称号，他的收入之一是-在不到一小时的时间里记住了10副纸牌的顺序。他一直在和朋友克里斯·亚当斯(Chris Adams)一起开发SparkleVerse，亚当斯的白天工作是Airbnb的高级软件经理。\n他们的网络应用程序将2D地图界面与视频聊天窗口配对，主要专注于推动共享环境如何促进和更好地构建社会关系。\n在隔离期间，这对情侣告诉TechCrunch，他们一直在为朋友们创建非常复杂的视频聊天派对。一个例子是一个以月亮为主题的聚会，他们制作了一张可点击的月球表面地图，引导200名与会者通过16个独立的虚拟空间，使用他们自己的主题。晚会开始前，主持人通过引导人们通过零重力的影响，并指导他们在体验的同时玩耍，带着人们经历了一次“月球之旅的体验”。另一场以热水浴缸为主题的派对邀请客人在启动Zoom之前跳进浴缸。\n库克和亚当斯正在依靠其中的一些机制来创造一个燃烧的人主题，希望从身临其境的剧院中获得启示，使人们能够更深入地投入到体验中。库克说，开车、断了手机连接、在去参加体育活动的路上变得疲惫和饥饿，这些行为增加了“你的意识中的宽敞”，让人们可以更自由地行动。他希望参与者在活动前采取日常生活之外的步骤来复制这些体验，无论是坐在长得令人作呕的视频聊天会话中模拟驾车前往沙漠，还是在客厅搭帐篷，或者切断供水线路，避免在这九天里洗澡。\n库克在一段9分钟的视频中解释道：“所有这些都让你越来越深入这个遥远的背景，远离你的正常生活，在这个过程中，你实际上正在成为一个从根本上不那么无聊的人，”库克在一段9分钟的视频中概述了这个平台。\n许多应用程序都建立在这样的想法之上，即空间界面如何能够满足更大的社会背景，并使接近人们和结交新朋友变得更容易。\n另一款官方应用Build-a-Burn进一步发展了视频聊天的风格化2D界面的想法，提供了黑岩城的粗略灰度地图，用户可以在上面导航小棒状人物。随着用户穿过不同的阵营，他们的头像在身体上接近彼此，新的视频聊天屏幕逐渐淡入，用户可以获得冒险进入新的社交泡沫的体验。\n虽然Build-a-Burn和SparkleVerse更加依赖视频聊天，但其他体验希望，创建与现实世界活动规模相匹配的大规模3D景观将有助于人们融入活动精神。\n除了Burn2，它完全包含在Second Life平台中，大多数以3D为中心的应用程序都集成了一定程度的虚拟现实支持。支持VR头盔的项目包括无限播放、Bridge Experience、MyticVerse、BRCvr(接入微软AltspaceVR平台)和Multiverse。\n每种VR体验还将允许用户在移动或桌面上加入，以确保这些应用程序可以更广泛地访问。\nMultiVerse的创建者法里亚尔·加桑法里(Faryar Ghazanfari)经营着一家AR初创公司，此前曾在特斯拉的法律团队工作。他表示，开发这款应用的动机有点自私，他告诉TechCrunch，在物理活动取消后，他感到“非常难过”，觉得有必要帮助建立一个地方，让他可以与自己的营地团聚。\nGhazanfari告诉TechCrunch，他觉得有责任创造其他燃烧者将会经历的环境；他说，他最关心的是捕捉到活动的复杂性。与其他应用程序相比，Multiverse主要专注于提供一个照片逼真的3D游乐场，化身可以在其中进行缩放。\n“作为燃烧者，我们并不认为”燃烧的人“仅仅是一个音乐节或艺术节；它远不止于此。Ghazanfari说：“焚烧人类是一项社会实验，目的是从共同的斗争中创建一个社区。”\n每个经“燃烧的人”批准的应用程序似乎都在以不同的方式唤起这种共享的斗争，这似乎是将这场活动转变为虚拟形式最迫在眉睫的挑战。虽然这些应用程序希望将物理活动的元素带到他们的虚拟空间中，但创建者似乎也意识到，旨在与参与者的过去记忆竞争是不明智的。这是过去几年虚拟现实领域数十家初创公司面临的挑战。\n风投支持的初创公司Wave的首席执行官亚当·阿里戈(Adam Arrigo)表示：“我认为主要的挑战是将现实中存在的东西移植到不同的平台上。”Wave最初推出了一款用于音乐会的VR应用，但后来将重点转移到了移动和桌面体验上。“当你身处这些数字空间时，你作为用户拥有的经纪公司和你可以创造的体验与可能存在的东西是如此不同，即使是在演唱会上也是如此。”\n也许最大的未知数是，当该组织为8月30日的“燃烧的人”开机日期做准备时，没有人真的知道会有多少人出现。虽然Blumenfeld向我指出了整个数字活动在9天的运行中可能吸引多达3万人的建议，但Ghazanfari希望数十万或数百万用户能融入他的体验。\n内部的另一个争议点是，这些集团到底计划如何将这些数字体验货币化。\n2020年，《燃烧的人》的标准票价是475美元。在今年的体育赛事取消之前，该组织推迟了门票的“主要销售”，但他们已经售出了数万张门票。门票持有者可以选择退票，但该组织鼓励那些“有能力”的人考虑全额或部分捐赠门票价格。\n税务文件显示，2018年，该组织的制作成本为4400万美元。据“燃烧的人”项目报道，那次活动的门票收入约为4300万美元，加上其他捐款和收入来源，该非营利性组织在该财年的总收入约为4600万美元。在一篇博客文章中，活动的组织者指出，尽管该组织有活动保险，但他们不包括因大流行而取消的保险。燃烧人项目表示，它有1000万美元的现金储备，但预计到今年年底，这笔资金将耗尽，以维持运营。该组织被列为从联邦政府的Paycheck Protection Program获得了200万至500万美元的贷款。\n虽然像Ghazanfari这样的一些人正在推动让他们的体验免费访问，并可以选择稍后捐赠，但另一些人表达了对单一数字门票的渴望，这种门票将让与会者获得所有八种数字体验。库克说，用户需要支付50美元的入场费才能访问SparkleVerse。\nBlumenfeld告诉TechCrunch，今年正在建设的体验的不同性质-一些作为原生应用程序发布，另一些在HTML5中发布，还有一些在现有的技术平台内-意味着统一的票务平台根本不起作用。并不是所有的开发人员都对这一结果感到兴奋，他们担心这可能会打破某些平台上活动的上座率。最大的担忧似乎是确保所有这些努力以某种方式为该组织带来回报，以便他们能够在大流行后继续主办燃烧人事件。\nGhazanfari说：“我们这么做的最大原因之一是为了帮助燃烧人生存下来，因为不幸的是，燃烧人组织因为COVID受到了严重打击。”“该组织在财务上处于一种岌岌可危的境地。”\n近年来，该组织因活动的包容性而招致批评。一些开发者承认，对于想要加入社区的人来说，计划一次为期九天的沙漠之旅可能会令人望而生畏，而且成本高得令人望而却步。他们希望，今年向数字形式的转变将使活动向更多人开放，对于怀疑者来说，这些应用程序可以成为一种不那么吓人的方式，让他们尝尝社区的滋味。\n数字体验背后的开发者都没有因为他们构建这些应用程序的努力而获得报酬。然而，燃烧人项目已经给了他们中的至少一些人永久许可，让他们继续运营这些以燃烧人的名字命名的数字平台，并有权货币化，尽管一定比例的收益将返还给该组织。\n虽然在本月底之前让这项赛事越过终点线已经足够令人望而生畏，但燃烧人项目也在努力考虑其快速学习将如何应用于明年，尽管他们希望实物赛事能在2021年回归。\n布鲁门菲尔德说，他计划明年致力于后台基础设施的工作，这样虚拟燃烧人的门禁和票务功能就可以全部集中起来。\n虽然今年有八次截然不同的体验可能会使把一个大群体聚集在一起的目标复杂化，但担心新应用程序故障排除或虚拟燃烧器突然涌入使基础设施不堪重负的开发人员认为，多个进入电影节的入口点是必要的后勤举措。组织者希望多样化的选择能让与会者保持兴趣。\n“我认为我们有一个很好的组合，部分原因是，我们想要学习，”布鲁门菲尔德说。“我们极力避免的是在极速与地狱相遇。”\n无论用户是通过视频聊天还是在一个巨大的虚拟世界中以化身的身份进行联系，构建燃烧人虚拟体验的开发者都认为，他们正在虚拟互动的前沿进行操作，他们正在重新思考现代社交网络的元素，以创建一个虚拟的燃烧人，在那里人们将能够建立新的社交纽带。\n库克告诉TechCrunch：“我喜欢这个想法，在未来的某个时候，300年后的某个博士生会写一篇关于第一个在线燃烧人的论文，因为这确实让人感觉到这是一个非常前卫的时刻，在想象人类在线互动的未来是什么样子。”", "note_en": "Over the years, the Bay Area-founded event has dealt with an internal clash as the gathering has grown larger and attracted a heavy presence from Silicon Valley’s wealthy tech class, with  tales of turnkey experiences, air-conditioned camps, helicopters and lobster dinners. Now, under the shadow of a historic pandemic, the organization behind the massive, iconic event is desperately working to stick to its roots while avoiding financial ruin as it pivots the 2020 festival to a digital format with the pro bono help of some of its tech industry attendees.\n With just a few weeks before the event is set to kick off, the organization is bringing together a group of technologists with backgrounds in virtual reality, blockchain, hypnotism and immersive theatre to create a web of hacked-together social products that they hope will capture the atmosphere of Burning Man.\n Going virtual is an unprecedented move for an event that’s mere existence already seems to defy precedent.\n Burning Man is held in late August every year inside Nevada’s Black Rock Desert. For nine days, the attendees, who refer to themselves as Burners, fill up the desolate landscape with massive art installations, stages and camps. Attendance has been climbing over the past several decades, to the point that the federal government got involved,  creating a more than 170-page report arguing why the event’s attendance should be capped. More than 78,000 people attended in 2019.\n It’s an escape from society in a shared social experience that doesn’t seem to be replicable elsewhere.\n   Steven Blumenfeld became the CTO of Burning Man days before the org’s leaders publicly announced that, due to the COVID-19 pandemic, the physical event was being abruptly canceled and the team was going all-in on a virtual gathering. Though the serial CTO expected the position to largely involve crusty tasks maintaining the event’s media infrastructure, he soon was pressed to rethink the front-end of a sprawling event that’s decades old and steeped in lore.\n “My first inclination is, ‘Great! Let’s go build a big 3D VR world blah blah blah… So then I spent the first two weeks looking at what I had for staff, what I had for time frame, and what we could actually do,” Blumenfeld says. “There was just no way. And you know, I actually still wanted to do it. I wanted a challenge… but the reality was it just wasn’t going to happen.”\n Burning Man is a massive undertaking, with a particularly deep emotional hold inside San Francisco, where it was first held in 1986, and by extension Silicon Valley. It isn’t all that surprising that when the Burning Man Project announced the event was making the move to a digital format, there was a rapid influx of community input to help decipher what an on-the-grid virtual Burning Man might look like.\n “We had 14,000 people tell us they wanted to contribute in some way to a virtual Black Rock City,” said Kim Cook, the org’s director of art and civic engagement. “Some of them said what they wanted to contribute was love; so that’s cool. We also had around a thousand of them say they wanted to do developer-type work.”\n Some of the groups that reached out to the Burning Man Project were companies that were willing to build a Burning Man experience but wanted official branding present. Despite a precarious financial position, Burning Man’s organizers declined help from these sponsors, citing the org’s adherence to “de-commodification” — a desire to prevent corporate infiltration of the event, eschewing advertising, branded stages and corporate partnerships.\n Turning away from the professional studios, Blumenfeld and others settled on a network of small indie teams filled with Burners that were willing to develop the official digital experiences for the event on their own time.\n   Eight projects eventually emerged as official “recognized universes,” each taking drastically different approaches to what a virtual Burning Man should look like. While some focus their efforts on virtual reality, others add social layers to video chat or build 3D environments on top of existing platforms like Second Life or Microsoft’s  AltspaceVR  .\n During the pandemic, revamped developer conferences and trade shows have been able to port keynote addresses or panels to a Zoom format fairly seamlessly, but there are plenty of elements of the Burning Man experience that the teams involved realize might be impossible to replicate with online platforms. The developers creating the event’s virtual worlds are determined to rethink the conventions of online social networking to ensure that Burners make new friends this year.\n “The sense of awe and scale is tricky,” says Ed Cooke, who is building one of the official apps. “One way of explaining Burning Man is that it’s a state of mind that you access as a side effect of all the things that happen on the way there.”\n Cooke, a London startup founder who also boasts the title of Grand Memory Master, earned for — among other things — memorizing the order of 10 decks of cards in less than an hour, has been building  SparkleVerse with his friend Chris Adams, whose daytime gig is as a senior software manager at Airbnb.\n Their web app, which pairs a 2D map interface with video chat windows, is primarily focused on advancing how shared context can facilitate and better frame social relationships.\n Amid quarantine, the pair tells TechCrunch they have been creating deeply complicated video chat parties for their friends. One example is a moon-themed party where they created a clickable map of the lunar surface that guided the 200 attendees through 16 separate virtual spaces with their own themes. Before the party kicked off, the hosts walked people through the “experience of traveling to the moon” by guiding them through the effects of zero gravity and instructing them to play along with experiencing it. Another hot tub-themed party invited guests to jump into their bath tub before firing up Zoom.\n Cooke and Adams are leaning on some of these mechanics to create a Burning Man theme, hoping that taking cues from immersive theatre will enable people to commit more deeply to the experience. The acts of driving, losing your phone connection and growing tired and hungry on the way to the physical event add to a “spaciousness in your consciousness” that allows people to act more freely, Cooke says. He wants participants to replicate these experiences by taking steps outside their normal life in the run-up to the event, whether that’s sitting through an obscenely long video chat session to simulate a drive to the desert or setting up a tent in their living room, or cutting off their water line and avoiding showers during the nine days.\n “All of this is embedding you further and further into this distant context, miles away from your normal life, where effectively in the course of this, you’re just becoming a radically less boring person,” Cooke explains in a  nine-minute video outlining the platform.\n Many of the apps are building on the idea of how spatial interfaces can feed greater social context and make it easier to approach people and make new friends.\n Another official app,  Build-a-Burn, takes the idea of a stylized 2D interface for video chat even further with a sketched-out grayscale map of Black Rock City that users can navigate little stick figures across. As a user moves through different camps and their avatars get physically close to each other, new video chat screens fade in and users can gain the experience of venturing into a new social bubble.\n  While Build-a-Burn and SparkleVerse are leaning more heavily on video chat, other experiences hope that creating massive 3D landscapes that match the scale of the real-world event will help people get into the spirit of the event.\n Other than  Burn2, which is wholly contained within the Second Life platform, most of the 3D-centric apps integrate some level of virtual reality support. Projects that support VR headsets include  The Infinite Playa,  The Bridge Experience,  MysticVerse,  BRCvr (which taps into Microsoft’s AltspaceVR platform) and  Multiverse.\n Each of the VR experiences will also allow users to join on mobile or desktop, an effort to ensure that the apps are more widely accessible.\n    Multiverse   creator Faryar Ghazanfari, who runs an AR startup and previously worked on Tesla’s legal team, says that the motivations for building his app were a bit on the selfish side, telling TechCrunch that he became “extremely sad” after the physical event’s cancellation and felt the need to help build a place where he could reunite with his own camp.\n  Ghazanfari tells TechCrunch he feels a responsibility in creating the environment that other Burners will experience; he says his chief concern is capturing the event’s complexity. Compared to the other apps, Multiverse focuses primarily on providing a photorealistic 3D playground where avatars can zoom around.\n “As Burners, we don’t think of Burning Man as just a music festival or art festival; it is much more than that. Burning Man is a social experiment of creating a community out of a shared struggle,” Ghazanfari says.\n Each of the Burning Man-approved apps seem to engage with evoking that shared struggle differently, which appears to be the most looming challenge of moving this event to a virtual format. While the apps hope to bring elements of the physical event into their virtual spaces, the creators also seem to realize that aiming to compete with attendees’ past memories is unwise. It’s a challenge that has been faced by dozens of startups in the virtual reality space over the past several years.\n “I think the main challenge is taking something that exists in reality and then porting it into a different platform,” said Adam Arrigo, CEO of  Wave,   a venture-backed startup that initially launched a VR app for music concerts but has since shifted focus to mobile and desktop experiences. “When you’re in these digital spaces, the agency that you have as a user and the experiences you can create are so different than something that could exist, even at a concert.”\n   Perhaps the biggest unknown, as the organization readies for Burning Man’s August 30 start date, is that nobody really has any idea how many people are going to show up. While Blumenfeld pointed me to suggestions the entire digital event could attract up to 30,000 people over its nine-day run, Ghazanfari hopes that hundreds of thousands or millions of users will come into the fold of his experience.\n Another point of contention internally is how exactly the groups plan to monetize these digital experiences.\n In 2020, the standard ticket price for Burning Man was $475. The organization postponed the “main sale” of tickets prior to this year’s physical event’s cancellation, but they had already sold tens of thousands of tickets. Ticket holders will have the option of being refunded, but the organization has encouraged those who “have the means” to consider making a full or partial donation of the ticket price instead.\n In 2018, Burning Man cost $44 million for the organization to produce, according to tax documents. The Burning Man Project reported about $43 million in ticket sales from that event, with other donations and revenue streams bringing the nonprofit’s total revenue for that fiscal year to about $46 million. In a blog post, the event’s organizers noted that though the group had event insurance, they were not covered for a cancellation caused by a pandemic. Burning Man Project says it has $10 million in cash reserves, but that it anticipates draining through that funding by the end of the year to stay afloat. The organization is listed as having received a loan from the federal government’s Paycheck Protection Program for between $2-5 million.\n While some like Ghazanfari are pushing to make their experiences free to access with the option of giving a donation later, others expressed desire for a single digital ticket that would give attendees access to all eight digital experiences. Cooke says users will need to pay a $50 entrance fee to access the SparkleVerse.\n The disparate nature of the experience being built this year — with some being shipped as native apps, others in HTML5 and others inside existing tech platforms — meant that a unified ticketing platform just wouldn’t work, Blumenfeld told TechCrunch. Not all of the developers were thrilled with this outcome, which they fear could fracture attendance at events on certain platforms. The biggest concern seemed to be ensuring that all of this effort pays off in some way for the organization so that they can continue to host the Burning Man event post-pandemic.\n “One of the biggest reasons we’re all doing this is to help Burning Man survive, because the Burning Man organization unfortunately was really badly hit because of COVID,” Ghazanfari says. “The organization is in kind of a precarious situation financially.”\n The organization has attracted criticism in recent years for the event’s inclusiveness. Some of the developers acknowledge that planning for a nine-day trip to the middle of the desert can be daunting and prohibitively expensive for people that want to join the community, and they hope that this year’s shift to a digital format will open up the event to more people and that these apps can be a less intimidating way for skeptics to get a taste of the community.\n   None of the developers behind the digital experiences are being paid for their efforts building these apps. However, the Burning Man Project has given at least some of them perpetual licenses to continue operating these digital platforms with the Burning Man name and an option to monetize, though a percentage of proceeds will be kicked back to the organization.\n While getting this event across the finish line by the end of the month is daunting enough, the Burning Man Project is also trying to consider how its rapid learnings will apply to next year, though they hope that the physical event returns for 2021.\n Blumenfeld says he plans to spend the next year working on the background infrastructure so that items like gating and ticketing functions for a virtual Burning Man can all be centralized.\n While having eight distinct experiences this year could complicate the goal of getting one big group together, developers concerned about troubleshooting their new apps or having a sudden influx of virtual Burners overwhelm their infrastructures view multiple entry points to the festival as a necessary logistical move. Organizers hope the diversity of options will keep things interesting for attendees.\n “I think we’ve got a good mix, and part of it is, we want to learn,” Blumenfeld says. “What we’re trying very hard to avoid is being in Zoom meeting hell.”\n Whether users are connecting via video chat or as avatars inside a large virtual world, the developers building Burning Man’s virtual experiences believe they are operating on the cutting edge of virtual interaction and that they are rethinking elements of modern social networking to create a virtual Burning Man where people will be able to form new social bonds.\n “I’ve fallen in love with this idea that at some point in the future, some Ph.D. student in 300 years time is going to write a thesis on the first online Burning Man, because it does feel like an extraordinary moment of avant garde imagineering for what the future of human online interaction looks like,” Cooke tells TechCrunch.", "posttime": "2020-08-13 05:52:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "燃烧,burning,活动", "title": "\n数字化的“燃烧的人”", "title_en": "\n\t\t\t\tDigitizing Burning Man\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/12/digitizing-burning-man/", "via": "", "real_tags": ["燃烧", "burning", "活动"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1017841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如一些人所知，我花了相当多的时间研究经济学家肯尼斯·阿罗(Kenneth Arrow)，他在内生增长理论和信息经济学方面的研究影响了我对数字时代创新经济学的许多思考。然而，阿罗可能最广为人知的是通常被称为阿罗的不可能定理，该定理可以最简洁(如果不是完全准确的话)描述为认为没有完美的投票系统来充分反映公众的意愿。无论你选择哪一种投票制度，都会有一些内在的不公平。维基百科对它的总结(链接在上面)并不是最好的，但如果你想更详细地研究它，我推荐这个简短的描述或这个长得多的描述。\n我最近一直在思考这一理论，这与一直存在的关于内容审查的讨论有关。我多年来一直认为，虽然很多人喜欢说内容审核很难，但这是一种误导。规模化的内容调节是不可能做好的。重要的是，这并不是说我们应该投降，什么也不做。这也不是说公司不能在自己的内容审核努力中做得更好。但我确实认为，很多人--包括许多政客和记者--似乎希望这些公司不仅能够，而且应该努力实现根本不可能达到的内容审查水平，这是一个巨大的问题。\n因此，将谦逊抛诸脑后，我想提出马斯尼克的不可能性定理，作为对阿罗的不可能性定理的一种发挥。规模化的内容调节是不可能做好的。更具体地说，它最终总是会让很大一部分人感到沮丧，而且总是不能准确地代表任何人的适度水平。虽然我不打算经历定理形式化的过程，但我只会注意几点，说明为什么我提出的论点不可避免地是正确的。\n首先，最明显的一点是：任何温和都可能最终激怒那些温和的人。毕竟，他们首先发布了他们的内容，因此认为它属于任何发布的地方--所以几乎可以肯定的是，他们不会同意调整它的决定。现在，一些人可能会争辩说，对此的明显反应是完全不节制，但这是失败的，原因很明显，许多人都非常喜欢一定程度的节制，特别是考虑到互联网上任何不节制的领域都会很快充斥着垃圾邮件，更不用说辱骂和骚扰内容了。有一种观点(我经常主张)认为，把适度推到网络的尽头(即给最终用户更多的控制权)是更好的，但这也有一些复杂之处，因为这会给最终用户带来负担，他们既没有时间也没有意愿不断调整自己的设置。无论选择哪条道路，对于很大一部分人来说，最终都不会是理想的。\n第二，节制本质上是一种主观的做法。尽管有些人希望内容审核更科学、更客观，但这是不可能的。根据定义，内容审核将始终依赖于评判电话，许多评判电话将最终落入灰色地带，在那里，许多人的意见可能会有很大不同。事实上，我们多年来一直强调的内容审核问题之一是，要做出好的决定，往往需要大量的背景信息，而没有办法以一种实际有效的方式，在规模上充分提供这一点。也就是说，当进行大规模的内容审核时，您需要设置规则，但是规则几乎没有给理解上下文和适当地应用它留下任何空间。因此，你得到了很多疯狂的边缘案例，最终看起来很糟糕。\n我们已经直接看到了这一点。去年，当我们把一整场由内容审核专家组成的会议变成了一小时的内容主持人时，我们发现，在我们提出的8个案例中，完全没有一个案例能让所有与会者就应该做什么达成一致。\n第三，人们确实低估了规模对这个等式的影响。当你每天要处理1000个内容审核决定时，99.9%的内容审核决策处于可接受的水平可能没什么问题，但大型平台要处理的远不止这些。如果你假设每天有100万个决定，即使准确率达到99.9%(记住，考虑到以上几点，根本没有这回事)，你仍然会错过1000个电话。但是一百万不算什么。最近的一份报告指出，仅在Facebook上，每天就有3.5亿张照片上传。和\n因此，虽然我完全支持探索内容审核的不同方法，并不认为人们在(经常)发生失败时大声疾呼没有问题，但重要的是要认识到，内容审核没有完美的解决方案，任何公司，无论多么深思熟虑、深思熟虑和谨慎，都会犯错误。因为这就是马斯尼克的不可能定理--除非你能反驳它，否则我们将假定它是真的。", "note_en": "As some people know, I&#39;ve spent a fair bit of time studying economist  Kenneth Arrow whose work on endogenous growth theory and information economics influenced a lot of my thinking on the economics of innovation in a digital age. However, Arrow is perhaps most well known for what&#39;s generally referred to as  Arrow&#39;s Impossibility Theorem, which could be described most succinctly (if not entirely accurately) as arguing that there is no perfect voting system to adequately reflect the will of the public. No matter which voting system you choose will have some inherent unfairness built into it. The Wikipedia summary (linked above) of it is not the best, but if you want to explore it in more detail, I&#39;d recommend this  short description or this  much longer description.\n I was thinking about that theory recently, in relation to the ever present discussion about content moderation. I&#39;ve argued for years that while many people like to say that content moderation is  difficult, that&#39;s misleading. Content moderation at scale  is impossible to do well. Importantly, this is  not an argument that we should throw up our hands and do nothing. Nor is it an argument that companies can&#39;t do  better jobs within their own content moderation efforts. But I do think there&#39;s a huge problem in that many people -- including many politicians and journalists -- seem to expect that these companies not only can, but should, strive for a level of content moderation that is simply impossible to reach.\n And thus, throwing humility to the wind, I&#39;d like to propose Masnick&#39;s Impossibility Theorem, as a sort of play on Arrow&#39;s Impossibility Theorem.  Content moderation at scale is impossible to do well. More specifically, it will always end up frustrating very large segments of the population and will always fail to accurately represent the &#34;proper&#34; level of moderation of anyone. While I&#39;m not going to go through the process of formalizing the theorem, a la Arrow&#39;s, I&#39;ll just note a few points on why the argument I&#39;m making is inevitably true.\n First, the most obvious one: any moderation is likely to end up pissing off those who are moderated. After all, they posted their content in the first place, and thus thought it belonged wherever it was posted -- so will almost certainly disagree with the decision to moderate it. Now, some might argue the obvious response to this is to do no moderation at all, but that fails for the obvious reason that many people would greatly prefer some level of moderation, especially given that any unmoderated area of the internet quickly fills up with spam, not to mention abusive and harassing content. There is the argument (that I regularly advocate) that pushing out the moderation to the ends of the network (i.e., giving more controls to the end users) is better, but that also has some complications in that it puts the burden on end users, and they have neither the time nor inclination to continually tweak their own settings. No matter what path is chosen, it will end up being not ideal for a large segment of the population.\n Second, moderation is, inherently, a subjective practice. Despite some people&#39;s desire to have content moderation be more scientific and objective, that&#39;s impossible. By definition, content moderation is always going to rely on judgment calls, and many of the judgment calls will end up in gray areas where lots of people&#39;s opinions may differ greatly. Indeed, one of the problems of content moderation that we&#39;ve highlighted over the years is that to make good decisions you often need a tremendous amount of context, and there&#39;s simply no way to adequately provide that at scale in a manner that actually works. That is, when doing content moderation at scale, you need to set rules, but rules leave little to no room for understanding context and applying it appropriately. And thus, you get lots of crazy edge cases that end up looking bad.\n We&#39;ve seen this directly. Last year, when we turned an entire conference of &#34;content moderation&#34; specialists into content moderators for an hour, we found that there were exactly zero cases where  we could get all attendees to agree on what should be done in any of the eight cases we presented.\n Third, people truly underestimate the impact that &#34;scale&#34; has on this equation. Getting 99.9% of content moderation decisions at an &#34;acceptable&#34; level probably works fine for situations when you&#39;re dealing with 1,000 moderation decisions per day, but large platforms are dealing with way more than that. If you assume that there are 1 million decisions made every day, even with 99.9% &#34;accuracy&#34; (and, remember, there&#39;s no such thing, given the points above), you&#39;re still going to &#34;miss&#34; 1,000 calls. But 1 million is nothing. On Facebook alone a recent report noted that there are  350 million photos uploaded every single day. And that&#39;s just photos. If there&#39;s a 99.9% accuracy rate, it&#39;s still going to make &#34;mistakes&#34; on 350,000 images. Every. Single. Day. So, add another 350,000 mistakes the next day. And the next. And the next. And so on.\n And, even if you could achieve such high &#34;accuracy&#34; and with so many mistakes, it wouldn&#39;t be difficult for, say, a journalist to go searching and find a bunch of those mistakes -- and point them out. This will often come attached to a line like &#34;well, if a reporter can find those bad calls, why can&#39;t Facebook?&#34; which leaves out that Facebook DID find that other 99.9%. Obviously, these numbers are just illustrative, but the point stands that when you&#39;re doing content moderation at scale, the scale part means that even if you&#39;re very, very, very, very good, you will still make a ridiculous number of mistakes in absolute numbers every single day.\n So while I&#39;m all for exploring different approaches to content moderation, and see no issue with people calling out failures when they (frequently) occur, it&#39;s important to recognize that there is no perfect solution to content moderation, and any company, no matter how thoughtful and deliberate and careful is going to make mistakes. Because that&#39;s Masnick&#39;s Impossibility Theorem -- and unless you can disprove it, we&#39;re going to assume it&#39;s true.", "posttime": "2020-08-13 05:50:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内容,moderation", "title": "规模化的内容审核不可能做好(2019年)", "title_en": "Content moderation at scale is impossible to do well (2019)", "transed": 1, "url": "https://www.techdirt.com/articles/20191111/23032743367/masnicks-impossibility-theorem-content-moderation-scale-is-impossible-to-do-well.shtml", "via": "", "real_tags": ["内容"]}, {"category": "", "categoryclass": "", "imagename": "c737d99bf1ee5c08b2b936aab254412e.png", "infoid": 1017840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我的“程序员数学入门”一书中，我将泰勒级数描述为“钉钉子的锤子”。我从Hammack、Ryan和Ziech的“八个令人惊叹的工程故事”中了解到现代智能手机加速计设计中的另一个钉子，我将在这里与大家分享。\n这些加速度计是使用包含三个板的系统设计的，这三个板对应于两个电容器。简单回顾一下我对电容器工作原理的(有限的)理解。包含两个导电板的电容器如下所示：\n电池提供的电压将电子推向负方向，或等效地将“电荷”推向正方向(参见电荷流和电子流之间的区别)。这些选举在标有标签的板上积累起来，两个板上的电荷差异产生了一个电场。如果电场足够强，电子就可以跳跃到正极板的间隙，完成电路。否则，极板达到“容量”，电流停止流动。是否发生跳跃或电流停止取决于极板的面积、极板之间的距离以及极板之间材料的性质，最后一个称为“介电常数”。(注意，我不确定为什么它不取决于极板的组成材料，但我想如果有必要的话，它可以平滑到介电常数中)这个关系可以用公式来概括。(注意，我不确定为什么它不取决于极板的材料，但我想如果有必要的话，它可以平滑到介电常数。\n然后，外部事件可能会导致两个平板移动到足够近的距离，这样电子就可以跳过间隙，电流就可以开始流动。这会使带负电的极板放电。\n只需固定带负电的板的一端，就可以让带负电的板稍微晃动一下，就像跳水板(悬臂)一样。\n根据弹簧的胡克定律，摆动量将与加速度成正比。\n当移位一段距离时，极板中的电容变为。\n它能够测量一维上的加速度，所以这些装置中的三个都布置在垂直轴上，这样就可以测量三维空间中的加速度。\n这种设计的问题是电容相对于位移量的非线性变化。要查看非线性程度，请将其展开为泰勒级数：\n我使用大O符号来更严格地表示我“忽略”所有立方和更高的术语。我之所以能这样做，是因为在这些工程系统中(我在这里相信哈马克的话)，数量是有意义的大，但后来的术语，比如可以忽略不计。当然，只有当位移与之相比非常小时，这才是正确的，这就是为什么大O有一个下标。\n显然，通过电容变化中的非线性向后工作是足够困难的，足以保证改变系统的设计。(我不知道为什么这很困难，但我想这与测量设备的工程限制有关；如果您知道更多信息，请务必插话)。\n避免这种情况的系统设计是三板系统而不是两板系统。\n在该系统中，中间板在连接到电压源的两个固定板之间来回移动。当它远离一个而靠近另一个时，一侧增加的电容被另一侧减少的电容所平衡。泰勒级数显示了这两个变化如何仅在平方项上抵消。\n如果表示左板(中板向其移动)的变化的电容，并表示右板(中板向其移动得更远)，则我们通过泰勒级数(对两者使用泰勒级数，但在本例中是)来扩展电容的差异。\n同样，由于立方和更高的项可以忽略不计，我们可以“忽略”这些部分。剩下的是对中板位移变化的线性响应。这使得它更容易测量。因为我们测量的是电容的差异，所以这种设计被称为“差动电容器”。\n虽然回过头来看数学是很整洁的，但我很惊讶一个人是如何从头开始构思出这个设计的。发明人有没有注意到泰勒级数近似中的对称性可以被安排成相互否定的？有没有其他类型的“身体直觉”在起作用？", "note_en": "In my book,  A Programmer’s Introduction to Mathematics, I describe the Taylor Series as a “hammer for every nail.” I learned about another nail in the design of modern smartphone accelerometers from “ Eight Amazing Engineering Stories” by Hammack, Ryan, and Ziech, which I’ll share here.\n These accelerometers are designed using a system involving three plates, which correspond to two capacitors. A quick recap on my (limited) understanding of how capacitors work. A capacitor involving two conductive plates looks like this:\n  The voltage provided by the battery pushes electrons along the negative direction, or equivalently pushing “charge” along the positive direction (see the  difference between charge flow and election flow). These elections build up in the plate labeled  , and the difference in charge across the two plates generates an electric field. If that electric field is strong enough, the electrons can jump the gap to the positive plate and complete the circuit. Otherwise, the plate reaches “capacity” and current stops flowing. Whether the jump happens or the current stops depends on the area of the plate  , the distance between the plates  , and the properties of the material between the plates, the last one is called the “dielectric constant”  . (Nb., I’m not sure why it doesn’t depend on the material the plate is composed of, but I imagine it’s smooshed into the dielectric constant if necessary) This relationship is summarized by the formula\n  Then, an external event can cause the plates to move close enough together so that the electrons can jump the gap and current can begin to flow. This discharges the negatively charged plate.\n  Allow the negatively charged plate to wobble a little bit by fixing just one end of the plate, pictured like a diving board ( a cantilever).\n The amount of wobble will be proportional to the force of acceleration due to Hooke’s law for springs.\n When displaced by a distance of  , the capacitance in the plate changes to  .\n This is able to measure the force of acceleration in one dimension, and so thee of these devices are arranged in perpendicular axes to allow one to measure acceleration in 3-dimensional space.\n The problem with this design is that   is a nonlinear change in capacitance with respect to the amount of displacement. To see how nonlinear, expand this as a Taylor series:\n  I’m using the big-O notation   to more rigorously say that I’m “ignoring” all cubic and higher terms. I can do this because in these engineering systems (I’m taking Hammack at his word here), the quantity   is meaningfully large, but later terms like   are negligibly small. Of course, this is only true when the displacement   is very small compared to  , which is why the big-O has a subscript  .\n Apparently, working backwards through the nonlinearity in the capacitance change is difficult enough to warrant changing the design of the system. (I don’t know why this is difficult, but I imagine it has to do with the engineering constraints of measurement devices; please do chime in if you know more)\n The system design that avoids this is a three-plate system instead of a two-plate system.\n  In this system, the middle plate moves back and forth between two stationary plates that are connected to a voltage source. As it moves away from one and closer to the other, the increased capacitance on one side is balanced by the decreased capacitance on the other. The Taylor series shows how these two changes cancel out on the squared term only.\n If   represents the changed capacitance of the left plate (the middle plate moves closer to it), and   represents the right plate (the middle plate moves farther from it), then we expand the difference in capacitances via Taylor series (using the Taylor series for   for both, but in the   case it’s  ).\n  Again, since the cubic and higher terms are negligibly small, we can “ignore” those parts. What remains is a linear response to the change in the middle plate’s displacement. This makes it significantly easier to measure. Because we’re measuring the difference in capacitance, this design is called a “differential capacitor.”\n Though the math is tidy in retrospect, I marvel at how one might have conceived of this design from scratch. Did the inventor notice the symmetries in the Taylor series approximations could be arranged to negate each other? Was there some other sort of “physical intuition” at play?", "posttime": "2020-08-13 05:50:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "级数,series,电容", "title": "泰勒级数与加速度计", "title_en": "Taylor Series and Accelerometers", "transed": 1, "url": "https://jeremykun.com/2020/07/26/taylor-series-and-accelerometers/", "via": "", "real_tags": ["级数", "series", "电容"]}, {"category": "", "categoryclass": "", "imagename": "279ba21bcd0a8c67a101d0d2aad5595c.jpg", "infoid": 1017839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1903年5月28日下午，在纽约市旅游的年轻堪萨斯人莱奥蒂·布莱克(Leoti Blaker)在第23街登上了第五大道的一辆公共马车，并在那里安顿下来。马车很拥挤，当车厢拥挤时，她注意到坐在她旁边的那个人坐得离她更近一英寸。她默默地评价道：年纪大了，衣着雅致，“看起来很仁慈。”马加快了速度，舞台跳了起来，乘客们又一次互相投掷，现在那个人正在抚摸她，臀部挨着臀部，肩并肩。当他举起手臂，低低地搭在她的背上时，莱奥蒂受够了。在一个会让现代地铁骚扰的受害者感到兴奋的举动中，她伸手拿出近一英尺长的帽夹，把它插进了这名男子手臂的肉里。他发出一声可怕的尖叫，在下一站离开了长途汽车。\n“他是一位英俊的老绅士，我很抱歉伤害了他，”她告诉“纽约世界报”。“我听说过百老汇混血儿和‘L’混血儿，但我不知道第五大道有一个特别的品牌…。。如果纽约的女人能容忍捣碎，堪萨斯的女孩就不能。“。\n全国各地的报纸都开始报道与“混血儿”的类似遭遇，这是一个时期的俚语，指的是好色或掠夺的男人(在西奥多·德莱塞(Theodore Dreiser)的“嘉莉妹妹”(Sister Carrie)中，更微妙地定义为“那些着装或举止刻意要引起易受影响的年轻女性钦佩的人”)。纽约市的一名家庭主妇在一辆拥挤的哥伦布大道有轨电车上推开了一名男子，问他是否可以“送她回家”。一名芝加哥歌舞女郎，被一名捣蛋者的“侮辱性问题”困扰，用雨伞打了他的脸，直到他摇摇晃晃地走开。圣路易斯的一名教师用她的帽针砍伤了潜在袭击者的脸，将其赶走。这样的故事不仅因为它们的频率而引人注目，而且因为它们的赞美语气；第一次，反抗骚扰的女性被视为英雄，而不是喜剧人物，被视为主题而不是客体。社会正在缓慢而稳定地过渡，从期待和倡导女性对男性的依赖，转变为认识到她们保护自己的愿望和能力。\n职业女性和女权主义者掌握了对话的控制权，她们公开反对混血儿，并赞扬女性在公共场合自由行动的权利--而且是单独行动的权利。诚然，正如社会工作者简·亚当斯(Jane Adams)所哀叹的那样，“在文明社会中，从来没有如此多的年轻女孩突然从家庭的保护中解脱出来，被允许无人照看地走在城市街道上，在陌生的屋顶上工作。”约会仪式和性习俗正在发生变化。一个男人不再光顾女人的客厅，在她父母的密切注视下追求她，而是带她去看演出或去舞厅，那里潜伏着各种邪恶。女权主义者拒绝了芝加哥副委员会提出的观点，即没有监护人的女性应该穿得尽可能朴素-没有涂上脸颊或瞥见脚踝-以避免不必要的关注。一位妇女参政论者反驳说，问题不在于女性的时尚或日益增长的自由，而在于“‘捣蛋者’思想的卑鄙”。\n一些批评者没有与妇女参政论者争辩，而是采取了更微妙的方式，不是反对女性角色的改变，而是反对她们更喜欢的自卫模式：帽夹。无辜者的故事比比皆是--没有粉碎机，他们--成了“帽夹危险”的牺牲品。在斯克兰顿，一名19岁的女孩开玩笑地将她的帽针刺向她的男朋友，并致命地刺穿了他的心脏。一名年轻的纽约有轨电车乘客感到耳后剧痛--一名陌生人的帽针意外扎了一下--一周后陷入昏迷死亡。同样在纽约，100名工厂女工挥舞着舱盖，袭击了逮捕两名涉嫌发表无政府主义言论的同志的警察。即使是其他女人也不安全。在芝加哥郊区，一名妇女和她丈夫的情妇画上了帽夹，像决斗一样绕着对方转了一圈，直到警察将其驱散。一家报纸讽刺地评论道：“我们在寻找新的进口柯尔特的帽针，或者史密斯和韦森的速动别针。”到了1909年，这个帽针被认为是一个国际威胁，汉堡和巴黎的警察局长都在考虑采取措施限制它们的长度。\n1910年3月，芝加哥市议会采纳了这一想法，讨论了一项法令，该法令将禁止开口针超过9英寸；任何违反规定的妇女都将被逮捕，并处以50美元的罚款。整个过程挤满了好奇的观众，有男有女，从一开始就充满了尖刻的言辞。一位支持者说：“如果女性愿意在头上戴胡萝卜和公鸡，那是她们自己的事，但当涉及到佩剑时，她们必须被阻止。”“太棒了！”男人发出嘶嘶声；女人发出嘶嘶声。代表几个妇女俱乐部的南·戴维斯请求允许向委员会发表讲话。“如果芝加哥的人想要拿到帽子\n第一次世界大战开始时，人们对帽夹的愤怒平息了下来，当短发和小方帽开始流行时，这种愤怒就完全消失了--这时又出现了一个新的“社会威胁”：浪花。当然，用不了多久，政客们就会变得更关心如何赢得选票，而不是女性穿什么。\n书籍：埃斯特尔·B·弗里德曼(Estelle B.Freedman)，“重新定义强奸：选举权和种族隔离时代的性暴力”。剑桥：哈佛大学出版社，2013；凯里·西格雷夫(Kerry SeGrave)，“当心泥瓦匠：美国公共场所的性骚扰，1880-1930”。杰斐逊(德克萨斯州)：麦克法兰公司，2014年。\n文章：长帽针是公共威胁吗？蟒蛇(MT)标准报，1910年3月1日；将规范帽针的大小。德卢斯新闻-论坛报，1910年3月1日；《保卫长帽针的妇女》，1910年3月1日；大福克斯每日先驱报，1910年3月1日；它现在被称为公众头针(the Hatpin；Ware the Hatpin；Ware the Hatpin；它现在被称为公共头针的捍卫者)，1910年3月1日；大福克斯每日先驱报，1910年3月1日；&34；Ware the Hatpin；它现在被称为公共头针的捍卫者(Ware The Hatpin)，1910年3月1日；大福克斯每日先驱报(Grand Forks Daily Herald)，1910年3月1日。帽针作为武器。#34；哈里斯堡爱国者，1908年4月16日；&#34；帽针带来死亡。每日记录-矿工(亚肯色州朱诺)，1908年8月26日；#34；女流氓强盗，#34；克利夫兰平原经销商，1909年8月29日；#34；将帽针刺入搅拌机。&#34；纽约世界，1903年5月27日；&#34；指向。纽约论坛报，1904年2月7日；#34；斯普恩头针保护者。#34；纽约时报，1914年4月26日。", "note_en": "On the afternoon of May 28, 1903, Leoti Blaker, a young Kansan touring New York City, boarded a Fifth Avenue stagecoach at 23 rd Street and settled in for the ride. The coach was crowded, and when it jostled she noticed that the man next to her settled himself an inch closer to her. She made a silent assessment: elderly, elegantly dressed, “benevolent-looking.” The horse picked up speed and the stage jumped, tossing the passengers at one another again, and now the man was touching her, hip to hip, shoulder to shoulder. When he lifted his arm and draped it low across her back, Leoti had enough. In a move that would thrill victim of modern-day subway harassment, she reached for her hatpin—nearly a foot long—and plunged it into the meat of the man’s arm. He let out a terrible scream and left the coach at the next stop.\n    “He was such a nice-looking old gentleman I was sorry to hurt him,” she told the  New York World. “I’ve heard about Broadway mashers and ‘L’ mashers, but I didn’t know Fifth Avenue had a particular brand of its own…. If New York women will tolerate mashing, Kansas girls will not.”\n  Newspapers across the country began reporting similar encounters with “mashers,” period slang for lecherous or predatory men (defined more delicately in Theodore Dreiser’s  Sister Carrie as “one whose dress or manners are calculated to elicit the admiration of susceptible young women”). A New York City housewife fended off a man who brushed up against her on a crowded Columbus Avenue streetcar and asked if he might “see her home.” A Chicago showgirl, bothered by a masher’s “insulting questions,” beat him in the face with her umbrella until he staggered away. A St. Louis schoolteacher drove her would-be attacker away by slashing his face with her hatpin. Such stories were notable not only for their frequency but also for their laudatory tone; for the first time, women who fought back against harassers were regarded as heroes rather than comic characters, as subjects rather than objects. Society was transitioning, slowly but surely, from expecting and advocating female dependence on men to recognizing their desire and ability to defend themselves.\n    Working women and suffragists seized control of the conversation, speaking out against mashers and extolling women’s right to move freely—and alone—in public. It was true, as social worker Jane Addams lamented, that “never before in civilization have such numbers of young girls been suddenly released from the protection of the home and permitted to walk unattended upon city streets and to work under alien roofs.” Dating rituals and sexual mores were shifting. A man no longer called at a woman’s parlor and courted her under the close eye of her parents, but took her to a show or a dance hall, where all manner of evil lurked. The suffragists rejected the notion, advanced by the Chicago Vice Commission, that unchaperoned women should dress as modestly as possible—no painted cheeks or glimpse of ankle—in order to avoid unwanted attention. The issue lay not with women’s fashion or increasing freedoms, one suffragist countered, but with “the vileness of the ‘masher’ mind.”\n  Instead of arguing with the suffragists, some detractors took a more subtle approach, objecting not to women’s changing roles but to their preferred mode of self-defense: the hatpin. Tales abounded of innocent men—no mashers, they—who fell victim to the “hatpin peril.” A 19-year-old girl in Scranton playfully thrust her hatpin at her boyfriend and fatally pierced his heart. A young New York streetcar passenger felt a sharp pain behind his ear—an accidental prick from a stranger’s hatpin—and within a week fell into a coma and died. Also in New York, a hundred female factory workers, all wielding hatpins, attacked police officers who arrested two of their comrades for making allegedly anarchistic speeches. Even other women weren’t safe. In a suburb of Chicago, a woman and her husband’s mistress drew hatpins and circled each other, duel-style, until policemen broke it up. “We look for the new and imported Colt’s hatpin,” one newspaper sarcastically opined, “or the Smith and Wesson Quick-action Pin.” By 1909, the hatpin was considered an international threat, with the police chiefs in Hamburg and Paris considering measures to regulate their length.\n  In March 1910, Chicago’s city council ran with that idea, debating an ordinance that would ban hatpins longer than nine inches; any woman caught in violation would be arrested and fined $50. The proceedings were packed with curious spectators, men and women, and acrimonious from the start. “If women care to wear carrots and roosters on their heads, that is a matter for their own concern, but when it comes to wearing swords they must be stopped,” a supporter said. Cries of “Bravo!” from the men; hisses from the women. Nan Davis, there to represent several women’s clubs, asked for permission to address the committee. “If the men of Chicago want to take the hatpins away from us, let them make the streets safe,” she said. “No man has a right to tell me how I shall dress and what I shall wear.”\n  Despite Davis’ impassioned speech, the ordinance passed by a vote of 68 to 2. Similar laws subsequently passed in several other cities, including Milwaukee, Pittsburgh, Baltimore and New Orleans. Ten thousand miles away, in Sydney, Australia, sixty women went to jail rather than pay fines for wearing “murderous weapons” in their hats. Even conservative London ladies steadfastly refused to buy hatpin point protectors.\n  “This is but another argument for votes for women and another painful illustration of the fact that men cannot discipline women,” argued the suffragist Harriot Stanton Blatch, a daughter of Elizabeth Cady Stanton. “Women need discipline; they need to be forced, if not led, out of their barbarisms, but women never have and never will submit to the discipline of men. Give women political power and the best among them will gradually train the uncivilized, just as the best among men have trained their sex.”\n  The furor over hatpins subsided at the onset of World War I, and died entirely when bobbed hair and cloche hats came into fashion—at which point emerged a new “social menace”: the flapper. It wouldn’t be long, of course, before politicians grew less concerned with what women wore than with how to win their votes.\n    Books: Estelle B. Freedman,  Redefining Rape: Sexual Violence in the Era of Suffrage and Segregation. Cambridge: Harvard University Press, 2013; Kerry Segrave,  Beware the Masher: Sexual Harassment in American Public Places, 1880-1930. Jefferson (TX): McFarland &amp; Company, 2014.\n  Articles: &#34;Are Long Hatpins a Public Menace?&#34;  Anaconda (MT) Standard, March 1, 1910; &#34;Would Regulate Size of Hat Pins.&#34;  Duluth News-Tribune, March 1, 1910; &#34;Women Defending the Long Hat Pin.&#34;  Grand Forks Daily Herald, March 1, 1910; &#34;Ware the Hatpin; It&#39;s Now Called a Public Peril.&#34;  Cleveland Plain Dealer, September 5, 1909; &#34;The Hatpin As a Weapon.&#34;  Harrisburg Patriot, April 16, 1908; &#34;Hatpin Brings Death.&#34;  Daily Record-Miner (Juneau, AK), August 26, 1908; &#34;Woman Routs Robbers,&#34;  Cleveland Plain Dealer, August 29, 1909; &#34;Stuck Hatpin Into a Masher.&#34;  New York World, May 27, 1903; &#34;Pointed Reminder of Hatpin Days.&#34;  New York Times, December 24, 1944; &#34;Women&#39;s Handy Weapon Against Thieves.&#34;  New York Tribune, February 7, 1904; &#34;Spurn Hatpin Protectors.&#34;  New York Times, April 26, 1914.", "posttime": "2020-08-13 05:50:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "女性,peril", "title": "“帽夹危机”吓坏了那些无法应付20世纪女性的男人", "title_en": "“The Hatpin Peril” Terrorized Men Who Couldn’t Handle the 20th-Century Woman", "transed": 1, "url": "https://www.smithsonianmag.com/history/hatpin-peril-terrorized-men-who-couldnt-handle-20th-century-woman-180951219/", "via": "", "real_tags": ["女性", "peril"]}]