[{"category": "", "categoryclass": "", "imagename": "04c0fa5477c4da84e48e6e1fa7d49b46.jpg", "infoid": 1002392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "普林斯顿“数学家”约翰·霍顿·康威(John Horton Conway)于4月去世，享年82岁。当他在20世纪60年代末和70年代初首次成名时，他加入了相当于喷气式飞机的学术界。然后在剑桥大学(University Of Cambridge)，他会飞往蒙特利尔或纽约，就他的康威小组(Conway Group)发表演讲-这是一个数学对称领域的实体，居住在24个维度-然后在一天的时间内全部回家。\n偶尔，他会绕道拜访“科学美国人”数学游戏专栏作家马丁·加德纳(Martin Gardner)，在他位于纽约北部哈斯廷斯河畔的家中。加德纳先生教他魔术：试着打一个结，同时抓住绳子的两端，永远不要松开。反过来，康威博士用拼图和游戏取悦加德纳--例如，他和研究生迈克尔·帕特森(Michael Paterson)共同发明的纸笔游戏“萌芽”(Sprouts)，很快就吸引了包括行政人员在内的整个数学系。\n后来，加德纳在一封信中说，康威博士展示的烟花“如此之多，令人眼花缭乱”，他对此惊叹不已。“我仍然头晕目眩。”\n在写康威博士的传记时，我花了很多令人费解的时间试图跟上。他在普林斯顿大学的办公室总是乱七八糟，所以他搬到了数学系休息室旁边的走廊里。走廊两旁排列着窗龛，每个壁龛里都有两把扶手椅和一块黑板。在康威博士的壁龛里，正在进行的活页作品被放在一个座垫下面。\n从那里，他给一群参观者上了一堂大师课，教他们如何像他吹嘘的那样，把所有的时间都花在无所事事、懒惰和玩游戏上。他的教学大纲可能包括彩虹科学(初级、二级、三级)的即兴小品，或“化学π”(根据元素周期表使用助记符记忆圆周率)，或者他的末日法则，快速计算任何给定日期的星期几。\n有时我们冒险出去。有一次，我们乘火车到波基普西去见乔治·奥多姆，他是一位多才多艺的业余几何学家，也是哈德逊河精神病中心的住院病人。奥多姆先生发现了一些与黄金比例有关的东西，黄金比例描述的是某些形状(通常是长方形)在美学上令人愉悦的比例。奥多姆的发现引起了康威博士的兴趣，因为它们将黄金比例与立方体特别相关。“我一直觉得立方体是至高无上的，”奥多姆告诉他。\n康威博士偏向于三角形，他为三角形发现了康威圆定理：如果你把任何三角形的边延伸到每个顶点之外，距离等于对边的长度，那么得到的六个点就在一个圆上。(最近，“大锁数学”(The Big Lock-Down Math-Off)中出现了一个“没有文字的证明”。)。\n我们去了东京附近的鹿儿洼，去了卡夫利宇宙物理和数学研究所。康威博士在一个关于怪兽群的研讨会上发表了主旨演讲，怪兽群是一个物体的对称性的集合，它生活在196883个维度上--康威博士澄清说，这是怪兽居住的“最小的、不平凡的”地方。在21,296,876维有另一个表示，在27位数维空间中还有一个更大的表示：258,823,477,531,055,064,045,234,375。\n康威博士正确地预测，这个庞然大物拥有大约808个六分之一的对称性，或者说准确地说：\n“这些东西太漂亮了，”他告诉我。“我的意思是，这是一种存在于抽象中的美，但我们这些可怜的凡人永远不会看到它。我们只能得到模糊的微光。“。(例如，请参见248维编组E8。)。\n康威博士相信怪兽的存在是没有理由的。“但我完全不知道这是什么原因，”他在鹿儿村对观众说。“在我死之前，我真的很想知道怪兽为什么会存在。但我几乎可以肯定我不会。“。\n2009年9月，我们和他当时10岁的儿子加雷斯一起去了康威博士的家乡英国利物浦和他的母校剑桥，以澄清一些反事实。(他对自己的生活是出了名的不可靠的叙述者。)。\n在我们拜访他第一次婚姻中的女儿--安妮、埃莉、罗西和苏西时，我们玩了他的“一位字游戏”：试着用只包含一个音节或“位”的单词交谈。(当对手滑倒时，大喊“砰！”)。康威博士曾经挑战自己用一位的词语讲授一门数论课，这可不是一件小事，因为“数字”这个词本身就是：“那些你用来计算的东西--你知道的，1，2，3，4，5，6，或更多的数字(1，2，3，4，5，6，or more…。.“。\n剑桥是康威的巅峰之作，尤其是在游戏方面。据称，他和他的合作者埃尔文·伯莱坎普(Elwyn Berlekamp)和理查德·盖伊(Richard Guy)(于今年3月去世，享年103岁)在定期轮流的学生帮助下，每天发明或重新发明10个游戏：西蒙·诺顿(Simon Norton)设计了游戏《苦难》(Tritriations)；迈克·盖伊(Mike Guy)用Fibulations进行了反击。(两者都是基于三角数和斐波纳契数的类尼姆游戏。)。该组织收集了“没有名字的游戏”和“没有名字的游戏”的文件夹。1981年，15年后，他们出版了一本多卷本畅销书“你的数学游戏的制胜之道”(Win Ways For Your Maximal Places)。\n第22章包含了Phutball，也就是Philosopher‘s Football的缩写，这是一款由负面反馈驱动的双人棋盘游戏，由石头组成。“每一个动作都是不好的，”康威博士警告说。第25章讲述了康威博士的“生活的游戏”，开头是奥斯卡·王尔德的忠告：“生活太重要了，不能把它当回事。”\n“生命的游戏”首次发表在加德纳1970年10月的专栏上，正如康威博士喜欢说的那样，它是一款“无人参与、永无止境”的游戏，它被认为是细胞自动机最早、最引人注目、最受欢迎的例子之一--根据几条简单的规则，屏幕上的细胞在一次又一次的迭代中进化，产生了一个令人震惊的复杂的“生命形式”兽类。\n“生命是普遍存在的，”康威博士在1970年12月写给加德纳先生的信中用所有大写字母写道。也就是说，“生活的游戏”可以被编程为进行任何计算；它是对所有数学的隐喻，并且包含了所有的数学。数学家曼朱尔·巴尔加瓦(Manjul Bhargava)是康威博士在普林斯顿的同事，他说，“生活的游戏对公众对数学的认知做出了贡献，现代历史上很少有数学发现能做到这一点。”\n当然，所有这些游戏都可以归类为严肃的研究；作为玩家和观众，康威博士正在分析游戏，观察策略，并对每个玩家可用的走法进行分类。他注意到游戏表现得像数字，数字也像游戏。这导致了他的超实数理论-一个巨大的新数字系统，不仅包含所有的实数，还包含了令人难以置信的无穷大和无穷小的集合，比如π减1除以无穷大的立方根。\n为了解释他的理论，康威博士写了一本书，“论数字和游戏”，以及两篇论文，“所有游戏的光明和美丽”和“所有的数字大小”。他告诉我：“你知道赞美诗：‘万物明亮美丽，万物大小。’但在这个理论的情况下，所有的游戏都是光明和美丽的，才是第一位的。从逻辑上讲，游戏先于数字。“。\n他认为这一发现是如此重要，以至于他简单地用粗体命名为“不”，意思是所有的数字。斯坦福大学计算机科学家、“计算机编程的艺术”(The Art Of Computer Programming)的作者N·唐纳德·克努斯(N.Donald Knuth)在写中篇小说“超现实的数字：两名前学生如何转向纯数学并找到完全的幸福”时，想出了一个更经久不衰的名字。\n听到朋友去世的消息后，努斯博士说，康威博士是他第二喜欢的数学家，仅次于18世纪的瑞士数学家莱昂哈德·欧拉(Leonhard Euler)。“约翰给欣赏深度思考的鉴赏家带来了乐趣。对我来说，那才是真正的美，能触动我内心深处的情感。“。他指出，到目前为止，康威博士在“计算机编程的艺术”(The Art Of Computer Programming)中因不同的贡献而被提及超过25次：“我预计在他去世后很长一段时间里，引用都会继续(就像猫王的遭遇一样)。”\n2010年3月，我们出发前往亚特兰大参加“G4G9”，这是纪念加德纳先生的第九届两年一度的聚会。在五天多的时间里，10分钟的演讲接踵而至。康威博士提供了一个“无题演讲”，他在演讲中(在一个25分钟的特别会议中)讲授了“词典密码定理--真的是这样吗？”\n“至少可以说，我会对这个定理提出一些质疑，但最后一切都是好的，”他告诉观众，然后开始将他关于球体包装的工作转化为博弈论(摘自与尼尔·斯隆(Neil Sloane)共同撰写的一篇论文，题为“词典编码：来自博弈论的纠错编码”)。\n马萨诸塞大学洛厄尔分校(University Of Massachusetts Lowell)数学家詹姆斯·普罗普(James Propp)事后说，“康威是那种罕见的数学家，他把自己钟爱的数学兴趣联系起来的能力让人怀疑，在某种程度上，他是不是在塑造数学现实，而不仅仅是探索它。”普罗普博士说，球体包装和游戏是两个不同的领域，康威博士在不同的路径上进行了研究，没有明显的交叉点。但不知何故，通过他人格的力量和强烈的激情，他让数学世界屈从于他的意志。\n那年8月，我们的数学之旅在加拿大/美国数学营继续进行，这是一个面向热衷于数学的高中生的国际暑期项目，当年在马萨诸塞州南哈德利的芒特霍利克学院(Mount Holyoke College)举行。康威博士是一个常年吸引人的明星；我第一次在MathCamp见到他是在2003年--他在表演他的招牌戏法，在头上旋转铁丝架，挂钩上平衡着一便士--每年夏天，他都会表演他惯常的令人眼花缭乱的曲目。\n他做了一个关于“如何在孩子们自己的游戏中打败他们”的夏令营讲座，并接受了一项挑战，让十几个露营者同时进行游戏；如果他们赢了一场比赛，他就会宣布露营者获胜。有一次，露营者们惊恐地发现，他从营地办公室借了一本他的“获胜之道”来温习战略。但是，绕着对手的桌子转，他创造了数学夏令营的历史，输了三次。“等一下，”他说。“这里发生了什么事？你好像赢了！“。\n贾敏·刘(Jamin Liu)曾是一名数学营营员和辅导员，现在是加州大学旧金山分校(University of California，San Francisco)的生物工程研究生。对他来说，康威博士对游戏的无休止的拖累不仅仅是乐趣。“它们被很好地伪装成很酷的把戏，我可以分享，而不一定要深入了解潜在的数学思想，这对我来说很有趣，但我的朋友们却不感兴趣，”刘女士说。她补充说，她从未在Dots and Box中击败过康威博士：“在早期的游戏中，我总是太贪婪了！”\n相比之下，2014年菲尔兹奖牌获得者巴尔加瓦博士战胜了康威。“有一次，不小心，”他说。巴尔加瓦博士与康威博士合作并发挥了大量作用，康威博士曾担任他第一年的研究生学习顾问。他说：“他的态度肯定了我自己把数学当成游戏的想法，尽管他的态度远远超出了我对普林斯顿大学数学教授的期望，我很喜欢。”\n我们上一次一起旅行是在2019年1月。我们从康威博士的普林斯顿护理公寓出发--他在多次中风后住在那里--去了一家最受欢迎的餐厅--Tomo Sushi，那里有数学家约瑟夫·科恩(Joseph Kohn)、西蒙·科晨(Simon Kochen)，还有纽约魔术师马克·米顿(Mark Mitton)。(迪克·埃斯特尔(Dick Esterle)，几何玩具的发明者，比如“icosa”坐立不安的球，通过短信加入了他的行列。)。\n在等待午餐时，康威博士回忆起与加德纳先生的一次拜访。在一家餐馆用餐时，女服务员哗啦啦地把盘子端到桌子上。加德纳用一个巧妙的玩笑回应道：他把餐具直接扔进了盘子里。女服务员尖叫了一声，然后加德纳先生在桌子周围重复了这个把戏。\n坐在寿司店里，米顿抓起盘子和刀子，即兴表演了一曲。康威博士对此表示赞赏；50年前，他曾请加德纳先生教他这个诀窍。“回头见，”加德纳先生承诺。但事实证明，“后来”很难捉摸。", "note_en": "When John Horton Conway, the Princeton “mathemagician” who died  in April at age 82, first found fame in the late 1960s and early ’70s, he joined the academic equivalent of the jet set. Then at the University of Cambridge, he would fly to Montreal or New York, deliver a lecture on his Conway group — an entity in the realm of mathematical symmetry that inhabits 24 dimensions — and return home all within the space of a day.\n Occasionally, he made a detour to visit Martin Gardner, the mathematical games columnist for Scientific American, at his house in Hastings-on-Hudson, just north of New York. Mr. Gardner taught him magic tricks: Try tying a knot while holding onto both ends of the string, without ever letting go. Dr. Conway, in turn, regaled Mr. Gardner with puzzles and games —  Sprouts, for instance, a pencil-and-paper game he had invented with Michael Paterson, a grad student, and which quickly charmed the entire math department, administrative staff included.\n  Later, Mr. Gardner marveled at the fireworks that Dr. Conway displayed “in such bewildering profusion,” he said in a letter. “I still have my head spinning.”\n Writing Dr. Conway’s biography, I spent many mind-bending hours trying to keep up. His office at Princeton University was a perpetual mess, so he had relocated to a hallway adjacent to the math department common room. The corridor was lined with window alcoves, each furnished with two armchairs and a chalkboard. In Dr. Conway’s alcove, loose-leaf works in progress were filed beneath a seat cushion.\n From there, he delivered a master class, to a parade of visitors, on how to spend all of one’s time — as he would boast — doing nothing, being lazy and playing games. His syllabus might include a riff on the science of rainbows (primary, secondary, tertiary), or “ chemical π” (memorizing pi using a mnemonic based on the periodic table of elements), or his  Doomsday rule for speedily calculating the day of the week for any given date.\n Sometimes we ventured out. Once, we took the train to Poughkeepsie to meet George Odom, an accomplished amateur geometer and an inpatient at the Hudson River Psychiatric Center. Mr. Odom had made a few discoveries pertaining to the golden ratio — a ratio describing aesthetically pleasing proportions of certain shapes, usually rectangular. Mr. Odom’s discoveries intrigued Dr. Conway because they related the golden ratio specifically to the cube. “I’ve always felt the primacy of the cube,” Mr. Odom told him.\n Dr. Conway was partial to the  triangle, for which he discovered the  Conway circle theorem: If you extend the sides of any triangle beyond each vertex, at a distance equal to the length of the opposite side, the resulting six points lie on a circle. (A “proof without words” was recently featured in “ The Big Lock-Down Math-Off.”)\n  We went to Kashiwa, near Tokyo, to the Kavli Institute for the Physics and Mathematics of the Universe. Dr. Conway was the keynote speaker at a workshop about the Monster group, a collection of symmetries of an object that lives most accessibly in 196,883 dimensions — that’s the “smallest nontrivial” place that the Monster lives, Dr. Conway clarified. There is another representation in 21,296,876 dimensions, and a larger one still in 27-digit-number-dimensional space: 258,823,477,531,055,064,045,234,375.\n And Dr. Conway correctly predicted that this behemoth possesses symmetries numbering roughly 808 sexdecillion, or exactly:\n  “These things are so beautiful,” he told me. “I mean, it’s a kind of beauty that exists in the abstract, but we poor mortals will never see it. We can just get vague glimmerings.” (For example, see the 248-dimensional group  E8.)\n  Dr. Conway believed that the  Monster couldn’t exist without a reason. “But I don’t have any idea what that reason is,” he told the audience in Kashiwa. “Before I die, I really want to understand why the Monster exists. But I’m almost certain I won’t.”\n   In September 2009, with his son Gareth, then 10, we traveled to Liverpool, England, Dr. Conway’s hometown, and Cambridge, his alma mater, to clear up some counterfactuals. (He was a notoriously unreliable narrator of his own life.)\n During our visit with his daughters from his first marriage — Annie, Ellie, Rosie and Susie — we played his One Bit Word Game: Try conversing using words containing only one syllable or “bit.” (When an opponent slips up, shout “Bang!”) Dr. Conway once challenged himself to deliver a number theory class in one-bit words, no small feat given the word “number” itself: “Those things you count with — you know, 1, 2, 3, 4, 5, 6, or more….”\n Cambridge was peak Conway, especially with regard to games. With his collaborators, Elwyn Berlekamp and  Richard Guy (who died in March at 103), he purportedly invented or reinvented 10 games a day, assisted by a regular rotation of students: Simon Norton devised the game Tribulations; Mike Guy countered with Fibulations. (Both are  Nim-like games based on triangle numbers and Fibonacci numbers.) The group amassed folders of “games without names” and “names without games.” In 1981, after 15 years, they published the multivolume, best-selling book “Winning Ways for Your Mathematical Plays.”\n Chapter 22 contained  Phutball, short for Philosopher’s Football, a two-player board game with stones, driven by negative feedback. “Every move is bad,” Dr. Conway warned. Chapter 25 covered Dr. Conway’s Game of Life, prefaced by Oscar Wilde’s advice that “Life is too important to be taken seriously.”\n  First published in Mr. Gardner’s October 1970 column, the Game of Life is a “no-player, never-ending” game, as Dr. Conway liked to say, and it is considered one of the earliest, most remarkable and most popular examples of a cellular automaton — according to only a few simple rules, cells on the screen evolve from iteration to iteration to produce an astoundingly complex bestiary of “Life-forms.”\n “LIFE IS UNIVERSAL,” Dr. Conway wrote to Mr. Gardner in December 1970, in all caps. That is, the Game of Life could be programmed to do any calculation; it was a metaphor for, and contained, all of mathematics. “The Game of Life has contributed to the public perception of mathematics in a way that few mathematical discoveries in modern history have,” said Manjul Bhargava, a mathematician and a colleague of Dr. Conway’s at Princeton.\n All of this gaming could be classified as serious research, of course; as both player and spectator, Dr. Conway was analyzing games, observing strategy and classifying the moves available to each player. He noticed that games behaved like numbers, and numbers like games. This led to his theory of surreal numbers — a huge new number system containing not only all the real numbers, but also a boggling collection of infinites and infinitesimals, like π minus 1 divided by the cube root of infinity.\n  To explain his theory, Dr. Conway wrote a book, “On Numbers and Games,” and two papers, “ All Games Bright and Beautiful” and “All Numbers Great and Small.” He told me, “You know the hymn: ‘All things bright and beautiful, all creatures great and small.’ But in the case of this theory, it’s all games bright and beautiful that come first. The games are logically prior to the numbers.”\n He viewed this discovery as so fundamental that he named it simply “ No,” in bold, meaning all numbers, capital N. Donald Knuth, the Stanford computer scientist and author of “The Art of Computer Programming,” came up with the more enduring name while writing the novelette “ Surreal Numbers: How Two Ex-Students Turned On to Pure Mathematics and Found Total Happiness.”\n On hearing of his friend’s death, Dr. Knuth said that Dr. Conway was his second favorite mathematician, outshone only by the 18th-century Swiss mathematician Leonhard Euler. “John gave pleasure to connoisseurs who appreciate deep thinking. That’s real beauty, for me, and touches off deep emotions.” He noted that Dr. Conway has been mentioned more than 25 times so far in “The Art of Computer Programming,” for different contributions: “I expect the citings to continue long after his death (as happened to Elvis).”\n In March of 2010, we set out for “G4G9,” the ninth biennial gathering honoring Mr. Gardner, in Atlanta. Over five days, 10-minute presentations followed one after another. Dr. Conway offered an “Untitled Talk,” in which he lectured (during a special 25-minute session) on “The Lexicode Theorem — Or Is It?”\n  “I’ll cast some doubt on this theorem, to say the very least, but all turns out well in the end,” he told the audience, and proceeded to convert his work with sphere-packing into game theory (drawing from a paper written with Neil Sloane, “ Lexicographic Codes: Error-Correcting Codes from Game Theory”).\n “Conway is the rare sort of mathematician whose ability to connect his pet mathematical interests makes one wonder if he isn’t, at some level, shaping mathematical reality and not just exploring it,” James Propp, a mathematician at the University of Massachusetts Lowell, said afterward. Sphere-packing and games are two separate realms that Dr. Conway had investigated on different paths, with no obvious intersection, said Dr. Propp. “But somehow, through the force of his personality and the intensity of his passion, he bent the mathematical universe to his will.”\n Our mathematical journey continued that August at Canada/USA Mathcamp, an international summer program for high-school students keen on math, which was being held that year at Mount Holyoke College in South Hadley, Mass. Dr. Conway was a perennial star attraction; I first met him at Mathcamp in 2003 — he was doing his signature trick, spinning a wire hanger above his head with a penny balanced on the hook — and every summer he bestowed and inflicted his usual bewildering repertoire.\n    He gave a camp lecture on “How To Beat Children At Their Own Games,” and accepted a challenge to play a dozen or so campers in parallel; if they won a single game, he would declare the campers victorious. At one point, the campers were horrified to discover that he had borrowed a copy of his “Winning Ways” from the camp office to brush up on strategy. But, circling the table of opponents, he made math camp history, losing three times. “Wait a minute,” he said. “What’s happened here? You seem to have won!”\n For Jamin Liu, a former Mathcamper and counselor and now a bioengineering grad student at the University of California, San Francisco, Dr. Conway’s perpetual dragooning with games was more than just fun. “They were well disguised as cool tricks that I could share without necessarily getting into underlying mathematical ideas, which were interesting to me but not to my friends,” Ms. Liu said. She added that she never managed to beat Dr. Conway at Dots and Boxes: “I always got too greedy in the early game!”\n By contrast, Dr. Bhargava, a 2014 Fields Medalist, was victorious against Conway. “Once, by accident,” he said. Dr. Bhargava worked and played a great deal with Dr. Conway, who served as his first-year graduate studies adviser. “His attitude affirmed my own thoughts about math as play, though he took this attitude far beyond what I ever expected from a Princeton math professor, and I loved it,” he said.\n   Our last trip together was in January of 2019. We headed out from Dr. Conway’s Princeton care residence — he lived there after suffering a number of strokes — to a favorite restaurant, Tomo Sushi, with mathematicians Joseph Kohn and Simon Kochen and the New York magician Mark Mitton. (Dick Esterle, the inventor of  geometric toys like the “Icosa” fidget ball, joined by text.)\n While waiting for lunch, Dr. Conway recalled a visit with Mr. Gardner. During dinner at a restaurant, the waitress had dealt plates onto the table with a clatter. Mr. Gardner responded with a sleight-of-hand gag: He dropped his cutlery straight through his plate. The waitress screamed, and then Mr. Gardner repeated the trick around the table.\n Sitting there at the sushi joint, Mr. Mitton grabbed a plate and knife and improvised an encore on the spot. Dr. Conway was appreciatively agog; 50 years earlier, he had asked Mr. Gardner to teach him that trick. “Later,” Mr. Gardner promised. But “later” proved elusive.", "posttime": "2020-05-16 21:49:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "康威,john,游戏", "title": "与约翰·康威一起旅行，258个七分之一维度", "title_en": "Travels with John Conway, in 258 Septillion Dimensions", "transed": 1, "url": "https://www.nytimes.com/2020/05/16/science/john-conway-math.html", "via": "", "real_tags": ["康威", "john", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MacroPy3是从最初的MacroPy到Python3的一个移植。如果您正在寻找Python2版本，请参见python2分支。\nMacroPy是Python编程语言中语法宏的实现。MacroPy为用户定义的函数(宏)提供了一种机制，以便在导入时对Python程序的抽象语法树(AST)执行转换。这是一种以其他方式无法实现的方式增强Python程序的管理能力的简单方法，例如，提供了一种极其简明的声明类的方式：\n&gt；&gt；&gt；导入宏。console 0=[]=&gt；MacroPy已启用&lt；=[]=0&gt；&gt；&gt；从宏导入宏，case&gt；&gt；&gt；@case class Point(x，y)：pass&gt；&gt；&gt；p=Point(1，2)&gt；&。x)1&gt；&gt；&gt；打印(P)点(1，2)。\n在REPL中试试看，应该很管用！您还可以查看docs/examples/using_acros文件夹，以获取usingMacroPy现有宏的最小示例。\n浏览高级概述，或查看教程将更详细地介绍并指导您完成。\n或者直接跳到讨论和MacroPy：将宏引入Python。我们对投稿持开放态度，请将您的意见/问题/问题/拉式请求发送给我们，我们将尽最大努力满足您的需求！你可以在Google Group和Gitter频道上提问，或者在问题页面上询问文件错误。查看变更列表以了解最近发生了什么变化。", "note_en": "MacroPy3 is a port of the original MacroPy to Python 3. If you look forthe Python 2 version see the  python2 branch.\n MacroPy is an implementation of  Syntactic Macros in the Python Programming Language. MacroPy providesa mechanism for user-defined functions (macros) to performtransformations on the  abstract syntax tree (AST) of aPython program at  import time. This is an easy way to enhance thesemantics of a Python program in ways which are otherwise impossible,for example providing an extremely concise way of declaring classes:\n &gt;&gt;&gt;  import  macropy.console 0=[]=====&gt; MacroPy Enabled &lt;=====[]=0 &gt;&gt;&gt;  from  macropy.case_classes  import  macros ,  case &gt;&gt;&gt;  @case class Point(x, y): pass &gt;&gt;&gt;  p  =  Point ( 1 ,  2 ) &gt;&gt;&gt;  print ( p . x ) 1 &gt;&gt;&gt;  print ( p ) Point(1, 2)\n Try it out in the REPL, it should just work! You can also see the docs/examples/using_macros folder for a minimal example of usingMacroPy’s existing macros.\n     Browse the   high-level overview, or look at the  Tutorials will go into greater detail and walk you through\n  Or just skip ahead to the   Discussion and  MacroPy: Bringing Macros to Python. We’re open to contributions, so send us yourideas/questions/issues/pull-requests and we’ll do our best toaccommodate you! You can ask questions on the  Google Group and on the Gitter channel or file bugs onthee  issues page. See the  changelist tosee what’s changed recently.", "posttime": "2020-05-16 21:49:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,syntactic,macropy", "title": "Macropy：Python的语法宏", "title_en": "Macropy: Syntactic Macros for Python", "transed": 1, "url": "https://macropy3.readthedocs.io/en/latest/", "via": "", "real_tags": ["python", "syntactic", "macropy"]}, {"category": "", "categoryclass": "", "imagename": "bb5f7a1961628b278386424e70434ec1.jpg", "infoid": 1002389, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一场名为db8151dd的大规模数据泄露事件暴露了2200万人的记录-包括地址、电话号码和社交媒体链接。但是数据的来源是一个神秘的…。\n今天早上，我收到一封来自haveibeenpwned.com网站的电子邮件提醒，告诉我我的详细信息。暴露的数据看起来很广泛。\n然而，该网站的运营者特洛伊·亨特(Troy Hunt)表示，没有人能够确定这些信息是从哪里来的。\n我没有写这篇博文是因为它留下了很多我们应该能够回答的问题。这是关于一次数据泄露，其中有近90 GB的个人信息，涉及数千万条记录-包括我的记录。我知道的是：\n早在2月份，Dehash就向我提供了大量的数据，这些数据通过一个可公开访问的Elasticsearch实例暴露在一家主要的云提供商上。它总共包含103,150,616行[…]。\n以“db8151dd”开头的全局唯一标识符在前几行有很大的特点，因此我给它起了这个名字。我不得不给它起这个名字，因为坦率地说，我绝对不知道它是从哪里来的，其他任何与我共事过的人也不知道它是从哪里来的[…]。\n它大部分是来自公共来源的可抓取的数据，尽管有一些关键的不同之处。首先，我的电话号码通常不会曝光，而且是完整的。是的，有很多地方(显然)都有它，但这不是从，比方说，一个公开的LinkedIn页面上刮来的。接下来，我的记录紧跟在我过去与之交互过的其他人的旁边，就好像数据源理解这种关联一样。我发现这非常不寻常，因为这不是我期望看到的与之有强烈联系的人，我也看不到任何其他类似的人。但这是其中的下一类数据，这让这件事变得特别有趣。\n这些“有趣的”数据似乎来自客户关系管理(CRM)系统，包括以下内容：\n由安迪[编辑后的姓氏]推荐。2007年10月2日，安排木匠学徒德文(编辑后的姓氏)更换温哥华[编辑后的街道地址]的浴室梳妆台。\n最好的猜测是，这是来自多个来源的某种聚合数据，但由于亨特和其他信息安全专业人士尽管进行了近三个月的尝试，但都无法识别其中任何一个，因此隐私泄露的细节似乎仍是一个谜。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "A massive data breach dubbed db8151dd has exposed the records of 22M people – including addresses, phone numbers, and social media links. But the source of the data is a mystery …\n  I got an email alert this morning from the  haveibeenpwned.com site telling me that my details were included. The exposed data appears extensive.\n  However,  Troy Hunt, who runs the site, said that nobody has been able to identify where the information came from.\n I was reticent to write this blog post because it leaves a lot of questions unanswered, questions that we  should be able to answer. It’s about a data breach with almost 90GB of personal information in it across tens of millions of records – including mine. Here’s what I know:\n Back in Feb,  Dehashed reached out to me with a massive trove of data that had been left exposed on a major cloud provider via a publicly accessible Elasticsearch instance. It contained 103,150,616 rows in total […]\n The global unique identifier beginning with “db8151dd” features heavily on these first lines hence the name I’ve given the breach. I’ve had to give it this name because frankly, I’ve absolutely no idea where it came from, nor does anyone else I’ve worked on with this […]\n It’s mostly scrapable data from public sources, albeit with some key differences. Firstly, my phone number is not usually exposed and that was in there in full. Yes, there are many places that (obviously) have it, but this isn’t a scrape from, say, a public LinkedIn page. Next, my record was  immediately next to someone else I’ve interacted with in the past as though the data source understood the association. I found that highly unusual as it wasn’t someone I’d expect to see a strong association with and I couldn’t see any other similar folks. But it’s the next class of data in there which makes this particularly interesting.\n That ‘interesting’ data appears to come from customer relationship management (CRM) systems, including things like:\n Recommended by Andie [redacted last name]. Arranged for carpenter apprentice Devon [redacted last name] to replace bathroom vanity top at [redacted street address], Vancouver, on 02 October 2007.\n Best guess is it’s some kind of aggregated data from a number of sources, but as neither Hunt nor other information  security professionals have been able to identify any of them despite attempts lasting almost three months, it appears the details of the  privacy breach may remain a mystery.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-05-16 21:05:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "泄露,data,数据", "title": "名为“db8151dd”的神秘数据泄露曝光了2200万人的记录", "title_en": "Mystery Data Breach Dubbed 'db8151dd' Exposes Records of 22 Million People", "transed": 1, "url": "https://9to5mac.com/2020/05/15/db8151dd/", "via": "", "real_tags": ["泄露", "data", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英文：按Ctrl+Z(Windows)或Cmd+Z(MacOS)将链接恢复为正常的蓝色链接.。在将任何链接粘贴到Atlassian方框中之后。您可以通过使用复制链接地址复制粘贴已由Atlassian包装的链接来修复该链接。根据每个https://www.atlassian.com/trust/roadmap?tab=compliance，您请求用户连接外部帐户的目的是什么，我可以在哪里阅读有关您如何仅使用此信息预览链接的信息？您是否意识到此功能违反了最低特权的概念，并鼓励用户不必要地泄露信息，这可能会伤害他们或您？https://www.sec.gov/Archives/edgar/data/1650372/000104746915008972/a2226703zf-1a.htm&34；如果我们的安全措施被破坏或未经授权访问客户数据，我们的产品可能会被认为不安全，我们可能会失去现有客户或无法吸引新客户，并且我们可能会招致重大责任。&#34；当我将谷歌文档链接粘贴到Atlassian时，您的UI会撒谎，并告诉我您没有访问该链接的权限。然后，您在我指向我的文档的链接周围建立一个OAuth链接，当单击该链接时，会向Google披露我正在使用Atlassian，并授予Atlassian对我的Google文档的只读访问权限……。如果我点击接受.。你的意思是说，亚特兰大不能阅读你的商业秘密或IP地址，在那个链接后面，我们刚刚注意到你贴在一个聊天框里。是否允许Atlassian对文件元数据和文件内容具有只读访问权限？&#34；这是OAuth请求的范围：\n想要了解更多关于OAuth Scopes的实际含义吗？https://developers.google.com/drive/api/v2/about-auth想一想，当谷歌文档包含商业秘密或IP时会发生什么…。想想看，当Atlassian被攻破，所有那些具有只读访问权限的访问令牌都被用来窃取Atlassian客户的所有Google Docs时，当他们无害地连接帐户以预览链接时，他们并没有意识到自己在做什么。邀请开发人员查看记录的与Smartlink renderSuccess&#34；相关的GraphQL事件，其中包括诸如：non PrivacySafeAttributes：https://bitbucket.org/atlassian/atlaskit-mk-2/commits/6e446f687a9f513ff76cafbfa8b0131e7481cb74{LinkDomain：[&#34；docs.google.com&#34；]}GraphQL事件(指向该文件的链接不起作用.。但这里是https://github.com/pavithracjs/atlassian-ui-library/commit/6e446f687a9f513ff76cafbfa8b0131e7481cb74).的相同承诺。这是否意味着这些信息是隐私安全的？或者不？这个功能是一场等待发生的诉讼.。请默认禁用该功能，并且在未正确传达与您的软件建议的操作相关的风险和责任的情况下，切勿提示用户授予对外部资源的访问权限。如果可以禁用此行为，我会直接禁用它，而不是发布此功能实际工作方式的详细说明。我们能得到一个预计到达时间吗？什么时候可以停用它？", "note_en": "In english:   press Ctrl + Z (Windows) or Cmd + Z (macOS) to revert the link to a normal blue link... after pasting any link into an atlassian box...  You can fix a link that has been wrapped by atlassian by copy pasting it using copy link address.  Per  https://www.atlassian.com/trust/roadmap?tab=compliance  For what purpose are you requesting users connect external accounts be linked, where can I read about how you will only use this information to &#34;preview links&#34;?  Are you aware that this &#34;feature&#34; is violating the concept of least privilege and encourage users to disclose information unnecessarily, that might harm them or you?   https://www.sec.gov/Archives/edgar/data/1650372/000104746915008972/a2226703zf-1a.htm  &#34; If our security measures are breached or unauthorized access to customer data is otherwise obtained, our products may be perceived as insecure, we may lose existing customers or fail to attract new customers, and we may incur significant liabilities.&#34;   When I paste a google docs link into atlassian, your UI lies, and tells me that &#34;You don&#39;t have access to that link&#34;... you then build an OAuth link around my link to my document, that when clicked, discloses to google that i&#39;m using atlassian, and grants atlassian read only access to my google doc... if I will just click accept...  What you mean to say is &#34;Atlassian can&#39;t read your trade secrets or IP behind that link we just noticed you pasted in a chat box... would you like to allow Atlassian to have read-only access to file metadata and file content?&#34;  This is the scope of the OAuth Request:\n  Want to learn more about OAuth Scopes actually mean?     https://developers.google.com/drive/api/v2/about-auth  Think about what happens when that google doc contains trade secrets or IP... think about what happens when atlassian is breached and all those access token with read only access are used to steal all atlassian customer&#39;s google docs, who didn&#39;t realize what they were doing when they harmlessly &#34;Connected an account to preview links&#34;.  Developers are invited to review the graphql events logged associated with &#34;smartLink renderSuccess&#34; which includes gems like:  nonPrivacySafeAttributes: {linkDomain: [&#34;docs.google.com&#34;]}   https://bitbucket.org/atlassian/atlaskit-mk-2/commits/6e446f687a9f513ff76cafbfa8b0131e7481cb74  (link to the file doesn&#39;t work... but here is the same commit  https://github.com/pavithracjs/atlassian-ui-library/commit/6e446f687a9f513ff76cafbfa8b0131e7481cb74)....  does this mean this information is privacy safe? or not?  This feature is a lawsuit waiting to happen... Please disable it by default, and never prompt users to grant access to external resources, without properly communicating the risks and liabilities associated with the action your software is proposing.   If it were possible to disable this behavior I would have just disabled it, instead of posting this detailed explanation of how the &#34;feature&#34; actually works.  Can we get an ETA on when this will be possible to disable ?", "posttime": "2020-05-16 21:04:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,强制,forcing,atlassian", "title": "JIRA强制用户授予对GitHub和驱动器的写访问权限", "title_en": "Jira forcing users to give write access to GitHub and drive", "transed": 1, "url": "https://community.atlassian.com/t5/Confluence-questions/How-do-I-get-rid-of-quot-Connect-your-account-te-preview-links/qaq-p/1157882", "via": "", "real_tags": ["github", "强制", "forcing", "atlassian"]}, {"category": "", "categoryclass": "", "imagename": "6786a6212cc7db71e0577d2c90967da1.png", "infoid": 1002387, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Приложение«Социальныймониторинг»созданодляпациентовсподтвержденнымдиагнозом冠状病毒，выбравшихлечениенадому，граждан，контактировавшихсними，игорожанспроявлениямиострыхреспираторныхзаболеваний，проживающихвМосквеисоблюдающихпредписанныйимрежимизоляции。Сегопомощьюпациентинформируетгорододобросовестномсоблюдениикарантина.。Прирегистрациипользовательподтверждаетномертелефона，делаетфотографию，геолокация(местонахождение)отправляетсяавтоматически.。Этонужнодлятого，чтобыпроверить，находитсялипользовательвтойжелокации，которуюуказалвсогласии，выбираялечениенадому.。Чтобыупользователянебыловозможностиоставитьсмартфондомаивыйтинаулицубезнего，приложениевслучайноевремяприсылаетпуш-уведомлениясзапросомдополнительногоподтверждения-дляэтогопотребуетсясделатьселфи.Еслипользовательпокидаетисходнуюгеолокациюилинереагируетнауведомления，системапредупреждаетгородскиеслужбыовозможномнарушениирежимаизоляции.Личныеданные，которыепользовательпередаетсервису，определенывсогласиинаполучениемедицинскойпомощинадомуисоблюдениережимаизоляциилибовпостановленииглавногосанитарноговрачагородаМосквы.。Гражданинобязанподписатьдокумент，есливыбираетлечениенадомуилиеслионконтактировалсзаболевшимидолженсоблюдатьрежимизоляции.。ОнуказываетФИО，адрес，покоторомуобязуетсянаходитьсянапротяжениивсегопериодалеченияилиизоляции，иномермобильноготелефона.。Такжегражданиндаетсогласиенаосуществлениефотосъемкиипредъявлениедокумента，удостоверяющеголичность.Вседанные，которыепользовательпередаетприложению，хранятсявзащищенномвиденасерверахДепартаментаинформационныхтехнологий.。Послеокончаниялеченияилисрокадействиярежимаизоляцииэтиданныеуничтожаются.", "note_en": "Приложение «Социальный мониторинг» создано для пациентов с подтвержденным диагнозом COVID-19, выбравших лечение на дому, граждан, контактировавших с ними, и горожан с проявлениями острых респираторных заболеваний, проживающих в Москве и соблюдающих предписанный им режим изоляции. С его помощью пациент информирует город о добросовестном соблюдении карантина. При регистрации пользователь подтверждает номер телефона, делает фотографию, геолокация (местонахождение) отправляется автоматически. Это нужно для того, чтобы проверить, находится ли пользователь в той же локации, которую указал в согласии, выбирая лечение на дому. Чтобы у пользователя не было возможности оставить смартфон дома и выйти на улицу без него, приложение в случайное время присылает пуш-уведомления с запросом дополнительного подтверждения — для этого потребуется сделать селфи.Если пользователь покидает исходную геолокацию или не реагирует на уведомления, система предупреждает городские службы о возможном нарушении режима изоляции.Личные данные, которые пользователь передает сервису, определены в согласии на получение медицинской помощи на дому и соблюдение режима изоляции либо в постановлении главного санитарного врача города Москвы. Гражданин обязан подписать документ, если выбирает лечение на дому или если он контактировал с заболевшим и должен соблюдать режим изоляции. Он указывает ФИО, адрес, по которому обязуется находиться на протяжении всего периода лечения или изоляции, и номер мобильного телефона. Также гражданин дает согласие на осуществление фотосъемки и предъявление документа, удостоверяющего личность.Все данные, которые пользователь передает приложению, хранятся в защищенном виде на серверах Департамента информационных технологий. После окончания лечения или срока действия режима изоляции эти данные уничтожаются.", "posttime": "2020-05-16 21:04:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,app,程序,谷歌,拒绝", "title": "谷歌拒绝下架用于监视俄罗斯公民的国家资助应用程序", "title_en": "Google refuses to remove the state-sponsored app used to spy on Russian citizens", "transed": 1, "url": "https://play.google.com/store/apps/details?id=ru.mos.socmon&showAllReviews=true", "via": "", "real_tags": ["google", "app", "程序", "谷歌", "拒绝"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002385, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年，我在最初的Surface GoBack上使用了OpenBSD，除了内部的Atheros WiFi之外，很多东西都可以正常工作。这意味着我必须将它绑在USB-C基座上进行以太网连接，或者使用一个小型USB-A WiFi加密狗插入一个不太小的USB-A-to-USB-C适配器。\n微软在最近的Surface设备上改用了英特尔WiFi芯片，使Surface Go 2与OpenBSD的兼容性略有提高。\n和最初的Surface Go一样，我选择了仅支持WiFi的机型，内存为8GbRAM，NVMe固态硬盘为128 GB，处理器现在是第8代双核英特尔酷睿M3-8100Y。\n这款平板电脑的宽仍为9.65&34；，高6.9&34；，厚0.3&34；，但屏幕边框缩小了半英寸，将屏幕从1800x1200提高到10.5&34；对角线，分辨率从1800x1280；提高到1920x1280；。\n可拆卸USB连接的Surface Go Type盖包含背面键盘和触摸板。我选择了冰蓝Alcantara颜色，因为我上次购买的较深的钴蓝版本已不再可用。Type盖沿底部边缘磁性连接，可以磁性地折叠到屏幕的正面，发出ACPI睡眠信号，或靠着背面自动禁用键盘和触摸板。\n屏幕边框变小的一个不幸的副作用是，当键盘处于抬高位置时，Type Cover键盘的顶部现在离屏幕底部非常近。用手指放在键盘上，屏幕最底部的文本(如Web浏览器中的状态栏)可以被左手遮住。\nType Cover的键盘很安静，但有非常令人满意的触觉弹跳。考虑到整个键盘的宽度只有9.75&34；，按键是很小的，但它适合我的小手。触摸板的中空滴答声比我记忆中的上一款要少一些，这是一个优点。\n触摸屏是ElanTech型号，通过HID-Over-I2C连接，支持笔输入。Surface Pen可以单独购买，需要AAAA电池，但它不需要任何配对，只是顶部的擦除按钮出于某种原因需要蓝牙。不使用时，笔会磁性地附着在屏幕的左侧。\n一组立体声扬声器在屏幕边框的左上角和右上角朝前，但缺少底座。设备顶部有一个电源按钮和物理音量摇杆按钮。右侧有一个3.5 mm耳机插孔、USB-C端口、Surfacedock/电源端口和位于支架后面的microSD卡插槽。\n无线连接现在由英特尔Wi-Fi 6 AX200 802.11ax芯片提供，该芯片还提供蓝牙连接。\n通过按住音量增大按钮，然后按下并松开电源按钮，并在菜单出现时释放音量增大，可以进入Surface Go的BIOS/固件菜单。在此菜单中可以禁用安全启动以及各种硬件组件。还可以调整启动顺序。\n开机时，像其他电脑一样，按住电源按钮最终会强制关闭设备的电源，但该按钮必须按住似乎永远不动。\n由于我之前在原始Surface Go上所做的OpenBSD工作，大多数组件在安装和第一次引导期间都能正常工作。\n要引导OpenBSD安装程序，请将install67.fs映像dd到USB磁盘，如上所述进入BIOS并禁用安全引导，然后将USB设备设置为最高引导优先级。\n对128 GB的固态硬盘进行分区时，用户可以安全地删除占用1 GB的Windows恢复分区，因为无论如何它都不能修复完全删除的Windows分区，并且可以从Microsoft网站下载完整的恢复映像并复制到USB磁盘。\n在安装OpenBSD之后但在重新启动之前，请挂载EFI分区(Sd0i)并删除/efi/microsoft目录。否则，它可能会尝试启动Windows恢复加载程序。OpenBSD&#39；的EFI引导加载程序位于/EFI/Boot/BOOTX64。否则，默认情况下将加载EFI。\n还有一个令人烦恼的地方，我在之前的评论中注意到：如果触摸触摸板或按下F1-F7键，Type Cover将拆卸所有USB设备，然后重新连接它们。我不确定这是设计原因还是Type Cover固件问题，但一旦OpenBSD引导到X，它将打开键盘和触摸板USB数据管道，它们将按预期工作。\n2020-05-12：拆箱时，我直接开机进入固件屏幕禁用安全启动，然后安装OpenBSD，第一次完全启动OpenBSD时，内核因为acpivout无法初始化它的bcl元素索引而死机，我暂时关闭了acpivout。\niwx检测到Intel AX200芯片，固件加载(通过FW_UPDATE安装)，设备可以执行活动网络扫描，但当尝试验证到网络时，设备固件报告致命错误。我一直通过电子邮件发送STSP@来调试该问题。\n2020-05-13：我创建了一个新的umstc驱动程序，该驱动程序连接到Type Cover的uhidev设备上，可以响应音量和亮度键，而不必使用usbidaction。更重要的是，它保持数据管道打开，以便在控制台按下F1-F7键时Type Cover不会重新启动。仍然需要一个解决方案来防止Type Cover在不在X模式下意外触摸触摸板时重新启动。\n我尝试了S3暂停和恢复，但当按下电源按钮唤醒它时，它立即显示初始固件徽标并启动，就像它已经启动一样。S4休眠工作正常。S3暂停在Ubuntu中工作，所以我需要进行一些调试，以找出OpenBSD出现故障的地方。\n通过Acpiac支持，通过APM和hw传感器提供状态，还支持通过USB-C充电。\n英特尔设备，显示为Ugen设备，但OpenBSD不支持蓝牙。可以在BIOS中禁用。\n显然有前置、后置和红外摄像头，没有一个是受支持的(也不是想要的)。可以在BIOS中禁用。\n连接在PCI Intel Sensor Hub设备后面，这需要一个新的驱动程序，该驱动程序可以为我们的传感器框架提供支持，然后告诉xrandr旋转屏幕。\n通过IMS在触摸屏上工作。笔顶部的按钮需要蓝牙支持，因此不受支持。\nUSB，由ukbd和我的umstc驱动程序支持。3级背光控制可由键盘本身使用F1调节。\n由UMT驱动程序支持的USB，用于5指多点触摸、两指滚动、滞后，并且能够禁用否则在正常鼠标模式中默认启用的点击。\nInteldrm支持Kaby Lake，增加了加速视频、DPMS、伽马控制、集成背光控制和适当的S3恢复。\n谢谢你把这个写下来。我正在考虑用x86取代我老化的iPad，后者不错，但对做任何有效率的事情用处不大。关于自由/开源软件桌面环境/UI和触摸控制，您有什么想法可以分享吗？\n也就是说，您是否在纯平板模式下使用它，如果是，它是如何使用的？\n我只短暂地将其用作平板电脑，但内核目前将触摸屏识别为鼠标，因此触摸会移动光标并发出点击声。我需要弄清楚如何让Firefox拖拽手指来滚动页面，而不是移动光标。\n&gt；umstc&gt；umstc驱动程序，该驱动程序连接到Type Cover的UHIDEV设备，并响应音量和亮度键，而不必使用USBHIDaction pic.twitter.com/ZQM0ZGNHU4。\n你们有不同型号的打字套吗？好奇它是否适用于其他https://github.com/jcs/openbsd-src/commit/94da4530f8c848a1eedf4318494e5047753a79af。\n谢谢。它可能是需要添加到驱动程序的不同USB产品ID。", "note_en": "I used OpenBSD on the  original Surface Goback in 2018 and many things worked with the big exception of the internalAtheros WiFi.This meant I had to keep it tethered to a USB-C dock for Ethernet or usea small USB-A WiFi dongle plugged into a less-than-small USB-A-to-USB-C adapter.\n Microsoft has switched to Intel WiFi chips on their recent Surface devices,making the Surface Go 2 slightly more compatible with OpenBSD.\n   As with the original Surface Go, I opted for the WiFi-only model with 8Gbof RAM and a 128Gb NVMe SSD.The processor is now an 8th generation dual-core Intel Core m3-8100Y.\n The tablet still measures 9.65&#34; across, 6.9&#34; tall, and 0.3&#34; thick, butthe screen bezel has been reduced a half inch to enlarge the screen to 10.5&#34;diagonal with a resolution of 1920x1280, up from 1800x1200.\n The removable USB-attached Surface Go Type Cover contains the backlitkeyboard and touchpad.I opted for the &#34;ice blue&#34; alcantara color, as the darker &#34;cobalt blue&#34;version I purchased last time is no longer available.The Type Cover attaches magnetically along the bottom edge and can befolded up against the front of the screen magnetically, issuing an ACPIsleep signal, or against the back, automatically disabling the keyboardand touchpad in expectation of being touched while holding the Surface Go.\n  One unfortunate side-effect of the smaller screen bezel is that the top ofthe Type Cover keyboard now rests very close to the bottom of the screenwhen the keyboard is in its raised position.With one&#39;s fingers on the keyboard, the text at the very bottom of the screensuch as the status bar in a web browser can be covered up by the left hand.\n The Type Cover&#39;s keyboard is quiet but has a very satisfying tactile bounce.The keys are small considering the entire keyboard is only 9.75&#34; across, butit works for my small hands.The touchpad has a slightly less hollow-sounding click than I remember onthe previous model which is a plus.\n The touchscreen is an Elantech model connected by HID-over-I 2Cand supports pen input.The Surface Pen is available separately and requires a AAAA battery, thoughit works without any pairing necessary with the exception of the top eraserbutton which requires Bluetooth for some reason.The pen attaches magnetically to the left side of the screen when not in use.\n A set of stereo speakers face forward in the top left and right of the screenbezel but they lack bass.Along the top of the unit are a power button and physical volume rockerbuttons.Along the right side are a 3.5mm headphone jack, USB-C port, Surfacedock/power port, and microSD card slot located behind the kickstand.\n Wireless connectivity is now provided by an Intel Wi-Fi 6 AX200 802.11axchip which also provides Bluetooth connectivity.\n  The Surface Go&#39;s BIOS/firmware menu can be entered by holding down theVolume Up button, then pressing and releasing the Power button, andreleasing Volume Up when the menu appears.Secure Boot as well as various hardware components can be disabled inthis menu.Boot order can also be adjusted.\n When powered on, holding down the power button will eventually force apower-off of the device like other PCs, but the button must be held downfor what seems like forever.\n  Due to my previous OpenBSD work on the original Surface Go, most componentswork as expected during installation and first boot.\n To boot the OpenBSD installer,  dd the  install67.fs image to a USBdisk, enter the BIOS as noted above and disable Secure Boot, thenset the USB device as the highest boot priority.\n When partitioning the 128Gb SSD, one can safely delete the WindowsRecovery partition which takes up 1Gb, as it can&#39;t repair a totallydeleted Windows partition anyway and a full recovery image can bedownloaded from Microsoft&#39;s website and copied to a USB disk.\n After installing OpenBSD but before rebooting, mount the EFI partition( sd0i) and delete the  /EFI/Microsoft directory.Without that, it may try to boot the Windows Recovery loader.OpenBSD&#39;s EFI bootloader at  /EFI/Boot/BOOTX64.EFI will otherwise loadby default.\n One annoyance remains that I noted in my previous review: if the touchpadis touched or F1-F7 keys are pressed, the Type Cover will detach all of itsUSB devices and then reattach them.I&#39;m not sure if this is by design or some Type Cover firmware problem, butonce OpenBSD is booted into X, it will open the keyboard and touchpad USBdata pipes and they work as expected.\n  2020-05-12: Upon unboxing, I booted directly into the firmware screento disable Secure Boot and then installed OpenBSD.Upon first full boot of OpenBSD, the kernel panicked due to  acpivoutnot being able to initialize its index of BCL elements.I disabled  acpivout for the moment.\n The Intel AX200 chip is detected by  iwx, the firmware loads (installed via fw_update), and the device can do an active network scan, but when tryingto authenticate to a network, the device firmware reports a fatal error.I&#39;ve been e-mailing with  stsp@ to debug the problem.\n 2020-05-13: I created a new  umstc driver that attaches to the uhidev device of the Type Cover and responds to the volume and brightnesskeys without having to use  usbhidaction.More importantly, it holds the data pipe open so the Type Cover doesn&#39;treboot when the F1-F7 keys are pressed at the console.A solution will still be needed to prevent the Type Cover from rebootingwhen the touchpad is accidentally touched when not in X.\n I tried S3 suspend and resume, but when pressing the power button to wake itup, it immediately displays the initial firmware logo and boots as if it wererestarted.S4 hibernation works fine.S3 suspend works in Ubuntu, so I&#39;ll need to do some debugging to figure outwhere OpenBSD is failing.\n   Supported via   acpiac and status available via  apm and  hw.sensors, also supports charging via USB-C.\n    Intel device, shows up as a   ugen device but OpenBSD does not support Bluetooth. Can be disabled in the BIOS.\n There are apparently front, rear, and IR cameras, none of which are supported (nor desired). Can be disabled in the BIOS.\n Connected behind a PCI Intel Sensor Hub device which requires a new driver which could feed our  sensor framework and then tell  xrandr to rotate the screen.\n    Works on the touchscreen via   ims. The button on the top of the pen requires Bluetooth support so it is not supported.\n   USB, supported by   ukbd and my  umstc driver. 3 levels of backlight control are adjustable by the keyboard itself with F1.\n USB, supported by the   umt driver for 5-finger multitouch, two-finger scrolling, hysteresis, and to be able to disable tap-to-click which is otherwise enabled by default in normal mouse mode.\n  inteldrm has Kaby Lake support adding accelerated video, DPMS, gamma control, integrated backlight control, and proper S3 resume.\n  Thanks for writing this up. I&#39;m contemplating getting an x86 replacement for my ageing iPad, the latter being nice but not very useful for doing anything productive. Any thoughts you can share on FOSS desktop environments/UIs and touch control?\n   As in, do you use it in tablet-only mode, and if so, how is it?\n   I&#39;ve only briefly used it as a tablet, but the kernel is currently recognizing the touchscreen as a mouse, so touching moves the cursor and sends a click. I need to figure out how to make Firefox make dragging a finger scroll the page instead of moving the cursor.\n      &gt; umstc driver that attaches to the uhidev device of the Type Cover and responds to the volume and brightness keys without having to use usbhidaction pic.twitter.com/ZQM0ZGNHU4\n   Do you have a Type Cover for a different model? Curious if it works for others  https://github.com/jcs/openbsd-src/commit/94da4530f8c848a1eedf4318494e5047753a79af\n      Thanks. It will probably be a different USB product id that will need to be added to the driver.", "posttime": "2020-05-16 19:37:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,usb", "title": "Microsoft Surface Go 2上的OpenBSD", "title_en": "OpenBSD on the Microsoft Surface Go 2", "transed": 1, "url": "https://jcs.org/2020/05/15/surface_go2", "via": "", "real_tags": ["microsoft", "usb"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002384, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Project Loom旨在极大地减少编写、维护和观察充分利用可用硬件的高吞吐量并发应用程序的工作。\n织布机项目于2017年底开工。这份文件解释了项目的动机和采取的方法，并总结了我们到目前为止的工作。像所有OpenJDK项目一样，它将分阶段交付，不同的组件在不同的时间到达GA(通用可用性)，很可能首先利用预览机制。\n您可以在它的wiki上找到更多关于Project Loom的材料，并尝试下面在Loom EA二进制文件(早期访问)中描述的大部分内容。如能向织布机开发人员邮寄列表反馈有关您使用织布机的经验，我们将不胜感激。\n虚拟线程是运行时调试器和探查器中的线程引入代码。\n虚拟线程不是OS线程的包装器，而是Java实体。\n创建虚拟线程的成本很低-拥有数百万个线程，不要将它们汇集在一起！\nJava被用来编写一些世界上最大、伸缩性最强的应用程序。可伸缩性是程序优雅地处理不断增长的工作负载的能力。Java程序规模的一种方式是并行性：我们希望处理可能会变得相当大的数据块，因此我们将其转换描述为流上的λ管道，通过将其设置为并行，我们要求多个处理内核将它们的牙齿放在一个任务中，就像一群食人鱼吞噬一条大鱼一样；一个食人鱼就可以完成这项工作-这样做会更快。这种机制是在Java8中提供的，但是还有一种不同的、更难的、更流行的伸缩方式，即同时处理应用程序要求的相对独立的任务。他们必须同时提供服务，这不是一种实施选择，而是一种要求。我们称其为并发，它是当代软件的面包和黄油，这就是织布机的意义所在。\n考虑一下Web服务器。它服务的每个请求在很大程度上都是独立于其他请求的。对于每一个，我们都会进行一些解析、查询数据库或向服务发出请求，然后等待结果、进行一些进一步的处理并发送响应。该进程不仅在完成某些作业时不与其他并发HTTP请求协作，而且在大多数情况下它根本不关心其他请求正在做什么，而且它仍然在处理和I/O资源方面与它们竞争。不是食人鱼，而是出租车，每辆都有自己的路线和目的地，它旅行和停留。在同一道路系统上行驶的其他出租车的存在并不会让任何一辆出租车更早地到达目的地-如果有什么不同的话，那就是可能会放慢速度-但如果在任何时候城市道路上只有一辆出租车，那就不仅仅是一个缓慢的交通系统，它将是一个功能失调的系统。能够共享道路而不会堵塞市中心的出租车越多，系统就越好。从早期开始，Java就支持这类工作。servlet允许我们编写在屏幕上看起来很直观的代码。这是一个简单的序列-解析、数据库查询、处理、响应-不会担心服务器现在只处理这一个请求还是处理一千个其他请求。\n每个并发应用程序都有一些与其域自然相关的并发单元，有些工作是独立于其他工作同时完成的。对于Web服务器，这可能是HTTP请求或用户会话；对于数据库服务器，这可能是事务。并发性在Java之前就有了悠久而丰富的历史，但就Java的设计而言，这个想法很简单：用顺序运行的并发软件单元表示这个并发的域单元，就像出租车在其简单的路线上行驶，而不关心任何其他的单元。这个软件构造就是线程。它虚拟化从处理器到I/O设备的资源，并安排它们的使用-利用每个进程可能在不同时间使用不同硬件单元的事实-将其公开为顺序进程。线程的定义特性是，它们不仅对处理操作进行排序，而且还对阻塞进行排序-等待某个外部事件发生，无论是I/O还是某个事件，或者由另一个线程触发，只有在该事件发生后才继续执行。线程之间应该如何最好地通信的问题-共享数据结构和消息传递的适当组合应该是什么-对于线程的概念来说并不重要，而且无论Java应用程序中当前的组合是什么，都有可能随着新功能的出现而改变。\n无论您是直接使用还是在JAX-RS框架内使用，Java中的并发性都意味着线程。事实上，整个Java平台-从VM到语言和库，再到调试器和分析器-都是围绕线程构建的，作为运行程序的核心组织组件：\nI/O API是同步的，并且描述通过阻塞线程来启动I/O操作并等待它们的结果作为语句的顺序排序；\n内存副作用(如果组织为无竞争)按线程的操作顺序排序，就好像没有其他线程竞争使用该内存一样；\n异常通过将失败的操作放在当前线程的调用堆栈的上下文中来提供有用的信息；\n调试器中的单步执行遵循顺序执行，无论它需要一些处理还是I/O，因为单步执行与线程相关联；\n应用程序配置文件在显示处理或等待I/O或同步所花费的时间时，按线程组织工作。\n问题在于，线程(并发的软件单位)无法与应用程序域的自然并发单位(会话、HTTP请求或单个数据库操作)的规模相匹配，也无法与现代硬件可以支持的并发规模相匹配。一台服务器可以处理超过一百万个并发打开套接字，但是操作系统不能有效地处理超过几千个活动(非空闲)线程。随着Servlet容器上工作负载的增加和更多请求的传输，操作系统可以支持的线程数量相对较少，阻碍了它的扩展能力。Servlet读起来不错，但伸缩性很差。\n这不是线程概念的基本限制，而是它们在JDK中实现为围绕操作系统线程的无关紧要的包装器的意外特性。OS线程占用的空间很大，创建它们需要分配OS资源，而对它们进行调度-即为它们分配硬件资源-并不是最优的。与其说它们是出租车，不如说它们是火车。\n这就造成了线程要做的事情(将计算资源的调度抽象为一个简单的构造)和它们可以有效做的事情之间存在很大的不匹配。几个数量级的不匹配可能会产生很大的影响。\n它产生了很大的影响。具有讽刺意味的是，为透明共享稀缺计算资源而发明的用于虚拟化稀缺计算资源的线程本身已经成为稀缺资源，我们不得不搭建复杂的脚手架来共享它们。\n因为创建线程的成本很高，所以我们将它们汇集在一起。创建新线程的成本如此之高，以至于为了重用它们，我们乐于付出泄露线程局部变量和复杂的取消协议的代价。\n但是，仅池化就提供了一种过于粗粒度的线程共享机制。即使在单个时间点，线程池中也没有足够的线程来表示所有正在运行的并发任务。在任务的整个持续时间内从池中借用线程时，即使线程正在等待某些外部事件(例如来自数据库或服务的响应，或者会阻塞线程的任何其他活动)，线程也会保持不变。当任务处于非活动状态时，操作系统线程实在是太宝贵了，无法挂起。为了更好、更高效地共享线程，我们可以在每次任务必须等待某个结果时将线程返回到池中。这意味着任务在整个执行过程中不再绑定到单个线程。这也意味着我们必须避免阻塞线程。\n其结果是异步API的激增，从JDK中的异步NIO，到异步servlet，再到许多不遗余力不阻塞线程的所谓“反应性”库。将任务拆分并让异步构造将它们放在一起会产生侵入性的、包罗万象的和约束性的框架。即使是基本的控制流，如循环和try/catch，也需要在“反应式”DSL中重建，有些运动类有数百个方法。\n如上所述，因为许多Java平台假设执行上下文包含在线程中，所以一旦我们将任务与线程分离，所有的上下文都会丢失：异常堆栈跟踪不再提供有用的上下文，当我们在调试器中单步执行时，我们发现自己在调试器代码中，从一个任务跳到另一个任务，并且I/O负载下的应用程序的配置文件可能会显示我们空闲的线程池，因为等待I/O的任务不会通过阻塞来保持其线程，而是将其返回到池中。\n发明这种样式不是因为它更容易理解-它更难；也不是因为它更容易调试或剖析-它更难；也不是因为它与语言的其余部分很好地匹配，或者与现有代码很好地集成，或者可以隐藏在“仅限专家的代码”中-恰恰相反，它具有病毒侵入性，并且几乎不可能与普通同步代码进行干净的集成，而只是因为Java中的线程实现在占用空间和性能方面都不够充分。异步编程风格无处不在地与Java平台的设计作斗争，并在可维护性和可观察性方面付出了高昂的代价。但它这样做有一个很好的理由：满足可伸缩性和吞吐量需求，并充分利用昂贵的硬件资源。\n一些编程语言试图通过在线程之上构建一个新概念来解决这个问题：异步/等待。1它的工作方式类似于线程，但是协作调度点被显式地标记为等待。这使得编写可伸缩的同步代码成为可能，并通过引入一种新的上下文来解决上下文问题，这种上下文除了名称之外都是线程，但与线程不兼容。如果同步和异步代码通常不能混合-一个块，另一个返回某种类型的Future或流-异步/等待创建了两个不同的“有色”世界，即使它们都是同步的，也不能混合，更令人困惑的是，调用同步代码异步来指示，尽管是同步的，但没有线程被阻塞。因此，C#需要两个不同的API来暂停当前正在执行的代码的执行一段预定的持续时间，Kotlin也需要这样做，一个用于暂停线程，另一个用于暂停类似于线程但不是线程的新构造。从同步到I/O，所有复制的同步API都是如此。不仅同一概念的两个实现没有单一的抽象，而且这两个世界在语法上是不相交的，这要求程序员将她的代码单元标记为适合在一种模式或另一种模式下运行，但不能同时在两种模式下运行。\n为将线程作为稀缺资源进行管理而构建的机制是一个不幸的例子，一个好的抽象被抛弃，取而代之的是另一个，在大多数方面更糟糕，仅仅是因为实现的运行时性能特征。这种情况对Java生态系统产生了很大的有害影响。\n程序员被迫做出选择，要么将域并发单元直接建模为线程并浪费硬件可以支持的大量吞吐量，要么使用其他方式在非常细粒度的级别上实现并发，但放弃了Java平台的优势。这两种选择都有相当大的财务成本，要么是硬件成本，要么是开发和维护成本。\nProject Loom旨在消除高效运行并发程序与高效编写、维护和观察并发程序之间令人沮丧的权衡。它利用了平台的优势，而不是对抗它们，同时也利用了异步编程的高效组件的优势。它允许您以熟悉的风格编写程序，使用熟悉的API，并与平台及其工具-但也与硬件-保持和谐，以实现编写时间和运行时成本的平衡，我们希望这将是广受欢迎的。它无需更改语言，只需对核心库API稍作更改即可。一个简单的同步Web服务器将能够处理更多的请求，而不需要更多的硬件。\n如果我们能让线更轻，我们就能有更多的线。如果我们拥有更多的计算资源，它们就可以按预期使用：通过虚拟化稀缺的计算资源并隐藏管理这些资源的复杂性，直接表示并发的域单元。这并不是一个新想法，也许最熟悉的方法是Erlang and Go中采用的方法。\n我们的基础是虚拟线程。虚拟线程只是线程，但是创建和阻塞它们的成本很低。它们由Java运行时管理，不是OS线程的一对一包装器，而是在JDK的用户空间中实现的。\n操作系统线程是重量级的，因为它们必须支持所有语言和所有工作负载。线程需要挂起和恢复执行计算的能力。这需要保留其状态，包括包含当前指令索引的指令指针或程序计数器，以及存储在堆栈上的所有本地计算数据。因为操作系统不知道语言是如何管理它的堆栈的，所以它必须分配一个足够大的堆栈。然后，我们必须通过将它们分配给某个空闲的CPU内核，在它们变得可以运行(启动或取消驻留)时安排它们的执行。因为操作系统内核必须调度各种线程，这些线程在处理和阻塞的混合过程中的行为截然不同-一些线程服务HTTP请求，另一些线程播放视频-它的调度器必须是一个足够全面的折衷方案。\n通过不将其状态具体化为操作系统资源，而是将其状态具体化为VM已知的Java对象，并且在Java运行时的直接控制下，Boom增加了控制执行、挂起和恢复执行的能力。Java对象安全高效地对各种状态机和数据结构进行建模，因此也非常适合对执行进行建模。Java运行时知道Java代码如何利用堆栈，因此它可以更紧凑地表示执行状态。对执行的直接控制还允许我们选择更适合我们工作负载的调度器(普通Java调度器)；实际上，我们可以使用可插拔的自定义SCH\n操作系统最多可以支持几千个活动线程，而Java运行时可以支持数百万个虚拟线程。应用程序域中的每个并发单元都可以由其自己的线程表示，从而简化了并发应用程序的编程。忘掉线程池吧，只需生成一个新线程，每个任务一个线程。您已经生成了一个新的虚拟线程来处理传入的HTTP请求，但是现在，在处理请求的过程中，您想要同时查询一个数据库并向其他三个服务发出传出请求吗？没问题-生成更多线程。你需要在不浪费宝贵资源的情况下等待事情的发生吗？忘掉回调或反应式流链吧--只需阻塞即可。编写直截了当、枯燥乏味的代码。线程给我们带来的所有好处-控制流、异常上下文、调试流、分析组织-都由虚拟线程保留；只有占用空间和性能方面的运行时成本没有了。与异步编程相比，灵活性没有任何损失，因为正如我们将看到的，我们没有放弃对调度的细粒度控制。\n有了手头的新功能，我们知道如何实现虚拟线程；如何向程序员表示这些线程就不那么清楚了。\nJava的每一个新特性都会在保护和创新之间制造紧张关系。向前兼容性让现有代码享受新特性(使用单一抽象方法类型的旧代码如何使用lambdas就是一个很好的例子)。但我们也希望改正过去的设计错误，重新开始。\nThread类可以追溯到Java1.0，多年来积累了方法和内部字段。它包含已废弃20多年的Suspend、Resume、Stop和countStackFrames等方法，假定线程数量很少的getAllStackTraces等方法，添加以支持某些应用程序容器使用的过时概念(如context-classloader)，甚至更老的方法(如ThreadGroup)，其原始用途似乎已被历史遗忘，但仍渗透到许多处理线程的内部代码和工具中，包括过时的、未使用的方法(如Thread.。\n事实上，早期的Loom原型在一个新的Fibre类中表示我们的用户模式线程，该类帮助我们检查现有代码对线程API的依赖关系。在那次实验中的几个观察结果帮助我们形成了自己的立场：\n线程API的某些部分使用非常广泛，特别是Thread.currentThread()和ThreadLocal。没有它们，几乎没有现有的代码可以运行。我们尝试使ThreadLocal平均线程或纤程位于本地，并让Thread.currentThread()返回纤程的一些Thread视图，但这些都增加了复杂性。\nThread API的其他部分不仅很少使用，而且几乎不向程序员公开。从Java 5开始，鼓励程序员通过ExecutorServices间接创建和启动线程，这样Thread类中的杂乱就不会造成很大的危害；新的Java开发人员不需要接触大部分线程，也不需要接触它过时的痕迹。因此，保留Thread API的教学成本很小。\n我们可以通过将元数据移到“SideCar”对象以仅按需分配，从而减少元数据在Thread类中的占用空间。\n新的弃用和删除策略将逐渐允许我们清理Thread API。\n我们想不出比Thread更好的东西来证明一个全新的API是合理的。\n仍然有一些不便之处，比如不幸的返回类型和中断机制，但是我们在那次实验中学到的-我们可以保留部分Thread API，而不强调其他部分-改变了方向，倾向于保留现有的API，并用Thread类表示我们的用户模式线程。现在我们来看一下：虚拟线程就是线程，任何知道线程的库都已经知道虚拟线程了。调试器和分析器与今天的线程一样使用它们。与异步/等待不同的是，它们没有引入“语义鸿沟”：代码在屏幕上显示的行为在运行时被保留，并且对所有工具都是一样的。\n为了获得更大的灵活性，有了新的Thread.Builder，它可以做与上面相同的事情：\n没有公共或受保护的Thread构造函数来创建虚拟线程，这意味着Thread的子类不能是虚拟的。因为将平台类子类化会限制我们发展它们的能力，所以我们不鼓励这样做。\n它可以传递给java.util.concurrent.Executors以创建使用虚拟线程并照常使用的ExecutorServices。但既然我们没有。\n..", "note_en": "Project Loom aims to drastically reduce the effort of writing, maintaining, and observing high-throughput concurrent applications that make the best use of available hardware.\n Work on Project Loom started in late 2017. This document explains the motivations for the project and the approaches taken, and summarizes our work so far. Like all OpenJDK projects, it will be delivered in stages, with different components arriving in GA (General Availability) at different times, likely taking advantage of the  Preview mechanism, first.\n You can find more material about Project Loom on its  wiki, and try most of what’s described below in the  Loom EA binaries (Early Access). Feedback to the  loom-dev mailing list  reporting on your experience using Loom will be much appreciated.\n   A virtual thread is a  Thread — in code, at runtime, in the debugger and in the profiler.\n A virtual thread is not a wrapper around an OS thread, but a Java entity.\n Creating a virtual thread is cheap — have millions, and don’t pool them!\n     Java is used to write some of the biggest, most scalable applications in the world. Scalability is the ability of a program to gracefully handle growing workloads. One way in which Java programs scale is  parallelism: we want to process a chunk of data that could grow quite large, so we describe its transformation as a pipeline of lambdas on a stream, and by setting it to  parallel we ask multiple processing cores to sink their teeth into the task as one, like a swarm of piranhas devouring a large fish; one piranha could get the job done — it’s just faster this way. That mechanism was delivered in Java 8. But there’s a different, harder and more prevalent, kind of scaling, which is about handling relatively independent tasks demanded of the application at the same time. That they must be served simultaneously is not an implementation choice but a requirement. We call that  concurrency, it’s the bread-and-butter of contemporary software, and that’s what Loom is about.\n Consider the web server. Each of the requests it serves is largely independent of the others. For each, we do some parsing, query a database or issue a request to a service and wait for the result, do some more processing and send a response. Not only does this process not cooperate with other simultaneous HTTP requests on completing some job, most of the time it doesn’t care at all about what other requests are doing, yet it still competes with them for processing and I/O resources. Not piranhas, but taxis, each with its own route and destination, it travels and makes its stops. The presence of other taxis traveling on the same road system does not make any one cab reach its destination any sooner — if anything, it might slow it down — but if only a single cab could be on the city roads at any one time it wouldn’t just be a slow transit system, it would be a dysfunctional one. The more taxis that can share the roads without gridlocking downtown, the better the system. From its early days Java supported this kind of job. Servlets allow us to write code that looks straightforward on the screen. It’s a simple sequence — parsing, database query, processing, response — that doesn’t worry if the server is now handling just this one request or a thousand others.\n Every concurrent application has some units of concurrency natural to its domain, some work that is done independently of other work and at the same time. For a web server, this could be the HTTP request or the user session; for a database server this could be the transaction. Concurrency has a long and rich history that predates Java’s, but the idea, as far as how Java was designed, is simple: represent this domain unit of concurrency with a software unit of concurrency that runs sequentially, like a taxi going on its simple route without caring about any others. This software construct is the thread. It virtualizes resources, from processors to I/O devices, and schedules their use — exploiting the fact that each process might employ different hardware units at different times — exposing it as a sequential process. The defining feature of threads is that they sequence not only processing operations but also  blocking — waiting for some external occurrence, be it I/O or some event or triggered by another thread, continuing execution only after that occurrence. The question of how threads should best communicate with one another — what the appropriate mix of shared data structures and message passing should be — is not essential to the concept of threads, and it’s possible that whatever the current mix is in Java applications, it will shift with new features.\n Whether you use them directly or inside, say, a JAX-RS framework, concurrency in Java means threads. In fact, the entire Java platform — from the VM, through the language and libraries, to the debuggers and profilers — is built around the thread as the core organizing component of a running program:\n I/O APIs are  synchronous and describe initiating I/O operations and waiting for their result as a sequential ordering of statements by  blocking the thread;\n Memory side-effects (if organized to be race-free) are sequentially ordered by the actions of the thread, as if no other thread is competing to use that memory;\n exceptions provide useful information by placing the failing operation in the context of the current thread’s call-stack;\n single-stepping in a debugger follows execution in order, whether it entails some processing or I/O because single-stepping is associated with a thread;\n application profiles organize work by threads when showing how much time is spent processing or waiting for I/O or synchronization.\n The problem is that the thread, the software unit of concurrency, cannot match the scale of the application domain’s natural units of concurrency — a session, an HTTP request, or a single database operation — nor can it match the scale of concurrency that modern hardware can support. A server can handle upward of a million concurrent open sockets, yet the operating system cannot efficiently handle more than a few thousand active (non-idle) threads. As the workload on the servlet container increases and more requests are in flight, its ability to scale is hampered by the relatively small number of threads the operating system can support. Servlets read nicely but scale poorly.\n This is not a fundamental limitation of the concept of threads, but an accidental feature of their implementation in the JDK as trivial wrappers around operating system threads. OS threads have a high footprint, creating them requires allocating OS resources, and scheduling them — i.e. assigning hardware resources to them — is suboptimal. They’re not taxis so much as trains.\n This creates a large mismatch between what threads were  meant to do — abstract the scheduling of computational resources as a straightforward construct — and what they effectively  can do. A mismatch in several orders of magnitude can have a big impact.\n  And a big impact it’s had. Ironically, the threads invented to virtualize scarce computational resources for the purpose of transparently sharing them, have themselves become scarce resources, and we’ve had to erect complex scaffolding to share  them.\n Because threads are costly to create, we pool them. The cost of creating a new thread is so high that to reuse them we happily pay the price of  leaking thread-locals and a  complex cancellation protocol.\n But pooling alone offers a thread-sharing mechanism that is too coarse-grained. There just aren’t enough threads in a thread pool to represent all the concurrent tasks running even  at a single point in time. Borrowing a thread from the pool for the entire duration of a task holds on to the thread even while it is waiting on some external event, such as a response from a database or a service, or any other activity that would block it. OS threads are just too precious to hang on to when the task is inactive. To share threads more finely and efficiently, we could return the thread to the pool every time the task has to wait for some result. This means that the task is no longer bound to a single thread for its entire execution. It also means we must avoid blocking the thread.\n The result is the proliferation of  asynchronous APIs, from asynchronous NIO in the JDK, through asynchronous servlets, to the many so-called “reactive” libraries that go to great lengths to not block threads. Chopping down tasks to pieces and letting the asynchronous construct put them together results in intrusive, all-encompassing and constraining frameworks. Even basic control flow, like loops and try/catch, need to be reconstructed in “reactive” DSLs, some sporting classes with hundreds of methods.\n Because, as mentioned above, much of the Java platform assumes that execution context is embodied in a thread, all that context is lost once we dissociate tasks from threads: Exception stack traces no longer provide a useful context, when single-stepping in the debugger we find ourselves in scheduler code, jumping from one task to another, and the profile of an application under I/O load might show us idle thread pools, because tasks waiting for I/O do not keep holding their thread by blocking and, instead, return it to the pool.\n This style was invented not because it is easier to understand — it’s harder; not because it is easier to debug or profile — it’s  much harder; not because it fits well with the rest of the language or integrates well with existing code or can be hidden away in “experts-only code”— quite the opposite,  it is virally-intrusive and makes clean integration with ordinary synchronous code virtually impossible, but just because the implementation of threads in Java is inadequate in both footprint and performance. The asynchronous programming style fights the design of the Java platform at every turn and pays a high price in maintainability and observability. But it does so  for a good reason: to meet the scalability and throughput demands and make good use of costly hardware resources.\n Some programming languages tried to address the problem by building a  new concept on top of threads:  async/await.  1 It works similarly to threads but cooperative scheduling points are marked explicitly with  await. This makes it possible to write scalable synchronous code and solves the context issue by introducing a new kind of context that is a thread in all but name but is  incompatible with threads. If synchronous and asynchronous code cannot normally be mixed — one blocks and the other returns some sort of  Future or  Flow — async/await creates two differently “colored” worlds that cannot be mixed even though  both of them are synchronous, and, to make matters more confusing, calls synchronous code asynchronous to indicate that, despite being synchronous, no thread is blocked. As a result, C# requires   two different APIs to suspend execution of the currently executing code for some predetermined duration, and  Kotlin does too, one to suspend the thread and one to suspend the new construct that is  like a thread, but isn’t. The same goes for all synchronous APIs, from synchronization to I/O, that are duplicated. Not only is there no single abstraction of two implementations of the same concept, but the two worlds are syntactically disjoint, requiring the programmer to mark her code units as suitable to run in one mode or the other, but not both.\n The mechanisms built to manage threads as a scarce resource are an unfortunate case of a good abstraction abandoned in favor of another, worse in most respects, merely because of the runtime performance characteristics of the implementation. This state of affairs has had a large deleterious effect on the Java ecosystem.\n Programmers are forced to choose between modeling a unit of domain concurrency directly as a thread and wasting considerable throughput that their hardware can support, or using other ways to implement concurrency on a very fine-grained level but relinquishing the strengths of the Java platform. Both choices have a considerable financial cost, either in hardware or in development and maintenance effort.\n  Project Loom intends to eliminate the frustrating tradeoff between efficiently running concurrent programs and efficiently writing, maintaining and observing them. It leans into the strengths of the platform rather than fight them, and also into the strengths of the efficient components of asynchronous programming. It lets you write programs in a familiar style, using familiar APIs, and in harmony with the platform and its tools — but also with the hardware — to reach a balance of write-time and runtime costs that, we hope, will be widely appealing. It does so without changing the language, and with only minor changes to the core library APIs. A simple, synchronous web server will be able to handle many more requests without requiring more hardware.\n  If we could make threads lighter, we could have more of them. If we have more of them, they could be used as intended: to directly represent domain units of concurrency by virtualizing scarce computational resources and hiding the complexity of managing those resources. This is not a new idea, and is perhaps most familiar as the approach taken in Erlang and Go.\n Our foundation is  virtual threads. Virtual threads are just threads, but creating and blocking them is cheap. They are managed by the Java runtime and are not one-to-one wrappers of OS threads, rather, they are implemented in userspace in the JDK.\n OS threads are heavyweight because they must support all languages and all workloads. A thread requires the ability to suspend and resume the execution of a computation. This requires preserving its state, which includes the instruction pointer, or program counter, that contains the index of the current instruction, as well as all of the local computation data, which is stored on the stack. Because the OS does not know how a language manages its stack, it must allocate one that is large enough. Then we must  schedule executions when they become  runnable — started or unparked — by assigning them to some free CPU core. Because the OS kernel must schedule all manner of threads that behave very differently from one another in their blend of processing and blocking — some serving HTTP requests, others playing videos — its scheduler must be an adequate all-around compromise.\n Loom adds the ability to control execution, suspending and resuming it, by reifying its state not as an OS resource, but as a Java object known to the VM, and under the direct control of the Java runtime. Java objects securely and efficiently model all sorts of state machines and data structures, and so are well suited to model execution, too. The Java runtime knows how Java code makes use of the stack, so it can represent execution state more compactly. Direct control over execution also lets us pick schedulers — ordinary Java schedulers — that are better-tailored to our workload; in fact, we can use pluggable custom schedulers. Thus, the Java runtime’s superior insight into Java code allows us to shrink the cost of threads.\n Whereas the OS can support up to a few thousand active threads, the Java runtime can support millions of virtual threads. Every unit of concurrency in the application domain can be represented by its own thread, making programming concurrent applications easier. Forget about thread-pools, just spawn a new thread, one per task. You’ve already spawned a new virtual thread to handle an incoming HTTP request, but now, in the course of handling the request, you want to simultaneously query a database and issue outgoing requests to three other services? No problem — spawn  more threads. You need to wait for something to happen without wasting precious resources? Forget about callbacks or reactive stream chaining — just block. Write straightforward, boring code. All the benefits threads give us — control flow, exception context, debugging flow, profiling organization — are preserved by virtual threads; only the runtime cost in footprint and performance is gone. There is no loss in flexibility compared to asynchronous programming because, as we’ll see, we have not ceded fine-grained control over scheduling.\n  With new capabilities on hand, we knew how to  implement virtual threads; how to represent those threads to programmers was less clear.\n Every new Java feature creates a tension between conservation and innovation. Forward compatibility lets existing code enjoy the new feature (a great example of that is how old code using single-abstract-method types works with lambdas). But we also wish to correct past design mistakes and begin afresh.\n The  java.lang.Thread class dates back to Java 1.0, and over the years accumulated both methods and internal fields. It contains methods such as  suspend,  resume,  stop and  countStackFrames, that have been deprecated for over twenty years, methods like  getAllStackTraces that assume that the number of threads is small, antiquated concepts such as the context-classloader, added to support certain application container usages, and even older ones, such as  ThreadGroup, whose original purpose seems to have been lost to history yet still permeates a lot of internal code and tools that deal with threads, including outdated, unused methods such as  Thread.enumerate.\n Indeed, earlier prototypes of Loom represented our user-mode threads in a new  Fiber class that helped us examine the dependencies of existing code on the thread API. Several observations made during that experiment helped shape our position:\n Some parts of the thread API are very pervasively used, in particular,  Thread.currentThread() and  ThreadLocal. Without them very little existing code can run. We tried making  ThreadLocal mean thread-or-fiber-local and had  Thread.currentThread() return some  Thread view of the  Fiber, but these were added complications.\n Other parts of the  Thread API are not only seldom used, but are hardly exposed to programmers at all. Since Java 5, programmers have been encouraged to create and start threads indirectly through  ExecutorServices, so that the clutter in the  Thread class is not terribly harmful; new Java developers need not be exposed to most of it and not at all to its antiquated vestiges. So the pedagogical cost of keeping the  Thread API is small.\n We could reduce the footprint of the metadata in the  Thread class by moving it to a “sidecar” object to only be allocated on demand.\n The new deprecation and removal policy will gradually allow us to clean up the  Thread API.\n We couldn’t come up with anything sufficiently better than  Thread that would justify a completely new API.\n There are still some inconveniences like unfortunate return types and the  interruption mechanism, but what we learned during that experiment — that we can keep parts of the Thread API and de-emphasize others — moved the needle in favor of keeping the existing API, and representing our user-mode threads with the  Thread class. And here we are: virtual threads are just  Threads, and any library that knows  Thread already knows virtual threads. Debuggers and profilers work with them as with today’s threads. Unlike async/await, they introduce no “semantic gap”: the behavior of the code as it appears to the programmer on the screen is preserved at runtime, and appears the same to all tools.\n    For more flexibility, there’s the new   Thread.Builder, that can do the same thing as above:\n    There is no public or protected  Thread constructor to create a virtual thread, which means that subclasses of  Thread cannot be virtual. Because subclassing platform classes constrains our ability to evolve them, it’s something we want to discourage.\n   that can be passed to   java.util.concurrent.Executors to create  ExecutorServices that employ virtual threads and used as usual. But since we don’t\n......", "posttime": "2020-05-16 19:15:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "织机,state,线程", "title": "织机的状态", "title_en": "State of Loom", "transed": 1, "url": "https://cr.openjdk.java.net/~rpressler/loom/loom/sol1_part1.html", "via": "", "real_tags": ["织机", "state", "线程"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002383, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "过去的几天很有趣。我的Twitter遭到了游戏开发社区的攻击，他们看不到现代C++的太大价值，更喜欢用非常低的抽象层来编写代码。我的Twitter遭到了游戏开发社区的攻击，他们看不到现代C++的太大价值，更喜欢用非常低的抽象层来编写代码。只不过这一次不是我发动的，不同于不久前……。\n这篇文章(1)讲述了我的一条tweet引发的激烈讨论的故事，(2)分析了游戏开发人员的一些常见要求和误解，以及(3)提供了每个游戏开发人员都应该使用的现代C++功能的列表。\n我正在为地震制作一个虚拟现实模型。实际上，称它为Mod&34；有点小巫见大巫：我不仅花了相当多的时间在我的QuakeSpasm引擎分叉上增加了VR支持，而且我还几乎改变了每个游戏机制，把经典游戏变成了一流的虚拟现实体验：\n对我来说，Quake VR项目是一个很好的乐趣来源，也是一次奇妙的学习经历。我与Quake的代码库建立了非常亲密的关系(包括它的所有怪癖和怪异)，习惯了OpenVR，并涉足了我以前从未做过的OpenGL图形编程(例如几何着色器)。\n我还将利用这个项目作为尝试C++17特性的机会，并总体上享受使用现代C++的乐趣。在2017年的语言标准中，我最喜欢的新增功能之一是折叠表达式。折叠表达式基本上将一个参数包减少到单个结果中，但也可以用于为包中的每个元素任意生成代码。\n为了添加纹理粒子并消除即时模式OpenGL的开销，我从头开始重写了Quake的粒子系统。这样做，我发现自己需要将一些图像缝合在一起来创建纹理图集，以避免不必要的绑定和解开纹理。在我的特定场景中，所有纹理文件路径都是硬编码的，因为我没有兴趣也不需要实现自定义粒子纹理。因此，我决定尝试使用折叠表达式：\n我越多地使用#cpp包和折叠表达式，我就越希望它们在运行时可用。它们是表达某些操作的一种非常优雅和方便的方式。(@seanbax的想法是正确的！)。作为一个例子，这里的原始生成的纹理地图集的地震虚拟现实。pic.twitter.com/X7tKrvPq0j。\n-维托里奥·罗密欧(@supahvee1234)2020年5月11日\n正如您从我的tweet中看到的，我正在使用一个参数包将所有要缝合在一起的图像传递给stitchImages可变模板函数。这显然不是必需的，因为运行时容器也可以工作，但是令人惊讶的是，它会产生一些非常优雅的代码1：\n模板类型名称(&lt；TypeName).。图像&gt；TextureAtlas缝合图像(常量图像&amp；.。图像){const auto width=(images.width+.)；const auto Height=std：：max({images.heat.})；//.。\n关注宽度和高度的定义：使用折叠表达式可以非常简洁和毫不含糊地表达(1)将所有图像的宽度相加，(2)找出所有图像之间的最大高度。此外，这种方法允许两个变量都是常量限定的，避免了意外突变，并减少了读者的认知开销。这要归功于这两个变量保证在它们的整个生命周期内不会改变它们的值，从而使读者可以将注意力集中在函数体的移动部分上，从而减少了认知开销。\nTextureAtlas stitchImages(const std：：Vector&lt；Image&gt；&amp；image){std：：size_t width=0；for(const auto&amp；img：image){width+=img.width；}std：：size_t maxHeight=0；for(const auto&amp；img：image){maxHeight=std：：max(maxHeight，img.high)；}//.。\n老实说，我认为上面的解决方案很糟糕。首先，我们使用的是std：：size_t，它不能保证与Image：：Width的类型匹配。为了(垂直地)正确，应该使用decltype(std：：declval&lt；const Image&amp；&gt；().width)，它很详细。无论如何，代码仍然是不必要的冗长-大量的语法噪音让我怀疑当我查看它时代码是否正确，因为有更多的地方可能已经引入了缺陷。最后，我们失去了一致性，包括它的安全性和可读性的好处。\nTextureAtlas stitchImages(const std：：Vector&lt；Image&gt；&amp；image){const auto width=std：：accumate(images.start()，images.end()，0[](const std：：size_t acc，const Image&amp；img){return acc+img.width；})；const auto Height=std：：max_element(images.start()，images.end()，imgB.Height；})-&gt；高度；//.。\n真没意思。我们获得了常量，并避免了意外的高度类型不匹配，但对于一个非常简单的任务，存在着令人难以置信的噪音和样板。相反，考虑一下如何在其他语言(如Python)中执行此任务：\ndef stitchImages(Image)：width=sum(图像中img的img.width)high=max(图像中img的img高度)#.\n模板类型名称(&lt；TypeName).。图像&gt；TextureAtlas缝合图像(常量图像&amp；.。图像){const auto width=(images.width+.)；const auto Height=std：：max({images.heat.})；//.。\n我真的很喜欢上面的代码片段，我强烈建议人们在生产中编写这样的代码……。如果不是因为折叠表达式纯粹是编译时特性这一事实。这就引出了我推文的全部观点：\n我越多地使用#cpp包和折叠表达式，我就越希望它们在运行时可用。它们是表达某些操作的一种非常优雅和方便的方式。(@seanbax的想法是正确的！)。\n我试图引发的讨论是关于C++是否可以获得一种类似于在运行时也可以工作的折叠表达式的语法，因为我相信它是对语言的一个有价值的补充，可以同时提高可读性、简洁性和安全性。\n我在最初的推文中标注了肖恩·巴克斯特，他创造了一种令人惊叹的语言，叫做Circle。简而言之，它是C++的扩展，添加了一个新的强大的元编程范例和许多新功能来提高生产力。绝对值得一查。\nCircle支持列表理解、切片、范围、for表达式、函数折叠和展开表达式，甚至在运行时也是如此。事实上，您可以在Circle中编写stitchImages(使用运行时数据)，其方式与可变模板版本非常接近：\nTextureAtlas stitchImages(const std：：Vector&lt；Image&gt；&amp；image){const auto width=(images[：].width+.)；const auto Height=std：：max({images[：].height.})；//.。\n[：]基本上是编译器魔术，它允许您将向量的元素视为参数包。它是您将使用循环执行的常规运行时操作的全部语法糖。我发现它非常有价值，我认为这是C++前进的正确方向-我希望看到一篇标准化的论文被提出。\n当然，我在一个个人爱好游戏项目中对C++编译时和运行时特性之间差距的观察引起了Twitter游戏开发社区部分成员的注意，他们的第一反应自然是：(1)嘲弄地转发我的原始代码片段，向一个追随者展示那些C++程序员是多么愚蠢，或者(2)评论代码是多么迟钝。\n虽然这已经很令人难过了，但我更失望的是，看到一些我真正钦佩其作品的人也有一些非常令人沮丧的事情要告诉我：\n谢天谢地，我在生活中已经面对了足够多的困难，所以这种胡言乱语不会再让我(很大程度上)陷入困境。然而，想象一下，一个年轻的开发人员从他们的偶像中得到了这样的反应，对他们渴望分享的一个实验：那将是令人心碎的。\n即使这条推文的作者只是泛泛而谈，但这种泛化正在伤害我们的社区和行业。有些人在他们的个人项目上进行实验，并将一些想法分享给C++社区的特定子集，这并不会伤害任何人。\n我可以展示我收到的许多荒谬无味的推文，但这不是这篇帖子的重点。我想讨论一下游戏开发行业对现代C++的误解。\n在关于现代C++如何成为编程行业毒瘤的一连串尖刻评论或自以为是的评论中，也提出了一些非常好的观点。许多游戏开发人员都有C++标准化委员会没有优先考虑的非常具体的要求。\n最常见的需求是可调试性，这一点非常重要。使用现代C++有两种方式会阻碍代码调试能力。这一切都源于现代C++如何鼓励使用零成本抽象：\n这样的抽象只有在启用编译器优化时才是零成本(在运行时)。在调试模式下运行应用程序时，与发布模式相比，性能可能会下降数百倍，这可能会使游戏无法真正玩。\n这种抽象通常是通过利用分层体系结构和代码重用来实现的。这些都是有价值的软件工程原则，允许大型项目扩展和增长，但它们也往往会由于多个级别的间接而导致深层调用堆栈：这样的深度可能会使您很难理解调试过程中发生的事情。在使用标准库设施时，这个问题尤其明显，众所周知，标准库设施具有非常复杂且嵌套很深的实现细节。\n这些观点都是公平的。为了缓解这些问题，大多数游戏开发人员寻求的解决方案是尽可能避免抽象，包括做出极端的决定，比如根本不使用标准库，或者使用std：：Vector&lt；T&gt；：：Data()+N而不是std：：Vector&lt；T&gt；：：Operator[](N)(甚至根本不使用容器)。\n然而，这些解决方案中有一个方面经常被忽视。让我们(合理地)假设，除了您只想以交互方式探索代码库的情况外，必须调试的频率与程序中的bug数量成线性关系。让我们也(再一次，合理地)假设，使用经过战斗测试的抽象来提高安全性可以减少程序中出现错误的机会。\n你看到谜题了吗？当然，如果您编写容易出错的类似C的代码，并且避免几十年来为帮助您避免错误而改进的实用程序，那么您将不得不进行更多的调试。\n我相信这是一个平衡-不是代码的每一行都应该隐藏在20层抽象层下，但是正确使用标准库(或定制的类型和函数)将减少调试所需的时间，因为可以在编译过程中防止错误。丹·萨克斯(Dan Saks)在CppCon 2016(我很荣幸亲自参加)上做了一个精彩的演讲，其中涉及到这个话题-强烈推荐：\n标准库实现者和C++委员会成员应该认真对待这一要求，并集思广益，研究如何改进这种情况；\n游戏开发人员(以及通常对现代C++持怀疑态度的人)应该给更平衡的编码风格一个机会，在这种风格中，尽可能在编译时使用精心选择的抽象来避免错误。\n我还可以在调试工具开发领域看到另一个有趣的机会，以减轻可能使人的调试体验变得次优的因素。例如，以一种用户友好的方式将调用堆栈的某些层标记为不重要(并记住调试会话之间的信息)可能是一个很好的起点。\n然而，有一点我可以肯定：完全放弃现代C++特性和抽象提供的安全性、可读性、灵活性和表现力是对这个问题的极端和不明智的反应。\n另一个被多次提及的问题是以前已经多次讨论过的问题：编译时间。C++有一个臭名昭著的坏名声，那就是编译时间慢，在我看来，当我们没有现代语言功能时，这是非常合理的。在C++11之前，任何元编程都需要大量使用模板，包括用于(例如)模拟类型列表的递归模板实例化。此外，考虑到C++03(如Boost)的限制，在保持数千种编译器/平台组合的可移植性的同时实现了令人难以置信的壮举的库不得不求助于神秘的技术，这最终导致了非常慢的编译时间。\n不足为奇的是，过去经验不佳的游戏开发人员仍然不敢在他们的代码库中引入任何模板或抽象的想法，没有意识到现在的情况要好得多。\n我无数次接触到的最大的误解之一是，现代C++等于标准库。这完全是错误的。标准库实现没有针对编译时间或可调试性进行优化-它们需要(1)通用、(2)易于维护和扩展、(3)运行时高效、(4)符合标准及其所有细微差别。\nr/cpp(&#34；UNIQUE_PTR-7个取消引用调用-为什么需要这个？&#34；)上的这个线程很能说明问题。作者称自己是现代C++怀疑论者，并认为他们的怀疑是合理的，因为一个简单的std：：ique_ptr取消引用需要调用堆栈中的7层间接引用。\n一个更吸引人的资源是优秀的Magnum图形引擎的作者撰写的轻量级但仍然与STL兼容的唯一指针文章。\n本文观察到，在项目中包含&lt；memory&gt；头文件会极大地增加编译时间。作者当时还测试了模块的实现，但帮助不大。作者没有成为反对现代C++的斗士，而是意识到问题出在std：：Unique_ptr的实现上，并且该语言的最新标准为创建std：：Unique_ptr的轻量级替代品提供了必要的功能(它足以满足Magnum的要求)。(=。这个思考过程导致了CorradePointer.h的创建，它是唯一的堆分配对象所有权的单头实现，对编译时间的影响最小。\n我在这里想要说明的是，现代C++提供的大多数语言功能都可以使用，而不依赖于标准库。我也承认标准库并不完美，但这是可以理解的，因为它是一个需要满足大量用例的通用工具。\n我刚才讨论的是最困扰我的误解。如果&lt；内存&gt；对于您的编译时间来说太昂贵了，那么当您可以在大约20行代码中实现类似的东西时，为什么要放弃std：：Unique_ptr的安全性、便利性和可读性改进呢？\n这一点几乎可以应用于所有标准库组件(除了非常低级的组件，如&lt；type_trait&gt；，它们不会显著影响编译时间)。\n当您从整体上轻率地放弃了现代C++，转而成为Twitter键盘勇士时，您就错过了C++提供的真正而重要的好处。\n在游戏开发的上下文中，如果没有C++11/14/17中引入的许多特性，我将无法生存。其中一些是简单的生活质量改进，对编译时间或可调试性没有任何影响，但却提供了巨大的价值。\n我列出了一系列我认为(1)简单，(2)对可调试性和编译时间影响最小，(3)仍然非常有价值的特性。\n枚举类-非常适合表示一组选项或选择。非常适合人工智能、菜单、网络协议、强类型定义等等。\nLambda表达式-通过引入将相关逻辑捆绑在一起的本地函数来划分代码，或者更清晰地表达异步操作。\n覆盖-有时虚拟多态性对游戏很有用，覆盖有助于避免错误并增加可读性。当然，我并不是建议您应该有一个具有虚拟更新成员函数的实体类(即使这对于较小的游戏来说是完全合理的)，但是任何类型的辅助系统(例如场景管理器)都可以从多态性中受益。\n类型别名和模板别名-避免代码重复并使代码更易维护/更灵活的绝佳方法，因为您可以在单个位置更改类型，而不是在整个代码库中查找-替换。\n原始字符串文字-没有它们我活不下去。如果我想在我的游戏中嵌入GLSL代码并保持它的可读性，这些是必须的。非常有用。\n二进制文字-告别需要心智操练的位掩码。只需用二进制显示您的掩码应该是什么样子，就可以非常清楚地知道哪些位将受到影响。\n数字分隔符-游戏充满了硬编码常量。&#34；最大粒子数&#34；。&#34；最大实体数&#34；。诸若此类。用一个简单的字符使它们更具可读性--区分100&39；000和1&39；000非常容易。\n嵌套的命名空间定义--以细粒度的方式组织代码，避免所有额外缩进级别的麻烦。\n[[Fallthrough]]-自从切片面包以来最好的东西，特别是因为我知道你们游戏开发人员喜欢SWITCH语句。此属性允许您明确表示要失败的意图，从而避免错误并增加可读性。\n[[nodiscard]]-我撒谎了。这是自切片面包以来最好的事情，特别是因为我知道你们游戏开发人员讨厌使用异常。任何返回不应被忽略的值(例如错误代码)的函数现在都可以使用此属性进行修饰，如果您忘记检查重要的返回值，编译器会发出警告。我一直在使用这个功能，无论是在工作中还是在我的个人项目中。它是救命稻草。\n结构化绑定-我也知道您喜欢普通和平面结构类型。我也是。它们快速、简单、易于使用。C++17使它们变得更好，因为您现在可以分解它们的成员并为它们指定单独的名称。\n我相信双方都可以从对方身上学到很多东西，我为一条推文所经历的负面和负面影响(这只是我个人对现代C++特性的观察)表明了情况是多么令人难过。\n我还强烈认为，每一位对现代C++持怀疑态度的游戏开发人员都应该停止错误地认为标准库是现代C++，而应该尝试一下我上面列出的所有功能。我保证它们不会影响您的编译时间，并且它们很可能会对您的代码的质量、可读性和安全性产生积极的影响。\n最后，我希望这篇帖子能拉近双方的距离，而不是制造一场新的垃圾风暴--这不是我的本意。我喜欢一些竞争，我也喜欢一些争论.。但有时这太过分了，我们互相大声表达意见所带来的乐趣至少应该让双方都有所收获。\n..", "note_en": "The past few days have been &#34;interesting&#34;. My Twitter has been raided by the part of the gamedev community that doesn&#39;t see much value in Modern C++ and prefers writing code with a very low level of abstraction. Except this time I didn&#39;t start it, unlike  a while ago...\n This article (1) tells the story of the heated discussions one of my tweets spawned, (2) analyzes some common requirements and misconceptions game developers have, and (3) provides a list of Modern C++ features which  every game developer should use.\n   I am working on a virtual reality mod for Quake. Actually, calling it a &#34;mod&#34; is a bit diminishing: not only I have spent a considerable amount of time working on  my fork of the QuakeSpasm engine to add VR support, but I&#39;ve also changed pretty much every game mechanic to turn the classic into a first-class virtual reality experience:\n  The   Quake VR project has been a great source of fun and a fantastic learning experience for me. I am getting in a very intimate relationship with Quake&#39;s codebase (including all its quirks and weirdnesses), getting accustomed to  OpenVR, and dabbling in OpenGL graphics programming that I had never done before (e.g. geometry shaders).\n I am also using this project as an opportunity to experiment with C++17 features, and to generally enjoy myself with Modern C++. One of my favorite additions to the 2017 standard of the language is   &#34;fold expressions&#34;. A fold expression basically reduces a   parameter pack into a single result, but can also be used to arbitrarily generate code for every element in the pack.\n In order to add textured particles and remove the overhead of  immediate mode OpenGL, I rewrote Quake&#39;s particle system from scratch. Doing that, I found myself needing to stitch together some images to create a  texture atlas, in order to avoid unnecessarily binding and unbinding textures. In my particular scenario, all the texture file paths are hardcoded, as I have no interest or need to implement custom particle textures. Therefore, I decided to experiment with fold expressions:\n  The more I use  #cpp packs and fold expressions, the more I wish they were available at run-time. They are a very elegant and convenient way of expressing some operations. (  @seanbax had the right idea!)  As an example, here&#39;s primitive generation of a texture atlas for Quake VR.  pic.twitter.com/X7tKrvPq0j\n— Vittorio Romeo ( @supahvee1234)  May 11, 2020\n As you can see from my tweet, I am using a parameter pack to pass all the images to stitch together to the  stitchImages variadic template function. This is obviously not necessary, as a run-time container would also work, but - suprisingly - it leads to some really  elegant code  1:\n template &lt; typename... Images&gt;TextureAtlas stitchImages( const Images&amp;... images){  const  auto width = (images.width + ...);  const  auto height =  std::max({images.height...});  // ...\n Focus on the definition of  width and  height: using a fold expression allows to very concisely and unambigiously express the intention of (1) summing all the images&#39; widths together and (2) finding the maximum height between all the images. Furthermore, this approach allows both variables to be  const-qualified, avoiding accidental mutation and decreasing cognitive overhead for readers. Cognitive overhead is reduced thanks to the fact that those two variables are guaranteed to not change their value throughout their lifetime, thus allowing a reader to focus their attention on the &#34;moving parts&#34; of the function body.\n  TextureAtlas stitchImages( const  std::vector&lt;Image&gt;&amp; images){  std::size_t width =  0;  for( const  auto&amp; img : images) { width += img.width; }  std::size_t maxHeight =  0;  for( const  auto&amp; img : images) { maxHeight =  std::max(maxHeight, img.height); }  // ...\n I believe the above solution is, honestly speaking, terrible. First of all, we are using  std::size_t, which is not guaranteed to match the type of  Image::width. To be (pendantically) correct,  decltype(std::declval&lt;const Image&amp;&gt;().width) should be used, which is verbose. Regardless, the code is still unnecessarily verbose - the amount of syntactic noise makes me wonder if the code is correct when I look at it, as there are more places where a defect could have been introduced. Finally, we lose  const-correctness, including its safety and readability benefits.\n  TextureAtlas stitchImages( const  std::vector&lt;Image&gt;&amp; images){  const  auto width =  std::accumulate(images.begin(), images.end(),  0 []( const  std::size_t acc,  const Image&amp; img) {  return acc + img.width; });  const  auto height =  std::max_element(images.begin(), images.end(), []( const Image&amp; imgA,  const Image&amp; imgB) {  return imgA.height &lt; imgB.height; })-&gt;height;  // ...\n It sucks. We get  const-correctness and avoid accidental type mismatches for  height, but there is an unbelievable amount of noise and boilerplate for a very simple task. In contrast, think about how you would perform this task in other languages such as Python:\n def stitchImages(images): width = sum(img.width  for img in images) height = max(img.height  for img in images)  # ...\n  template &lt; typename... Images&gt;TextureAtlas stitchImages( const Images&amp;... images){  const  auto width = (images.width + ...);  const  auto height =  std::max({images.height...});  // ...\n I really like the above code snippet, and I would strongly encourage people to write code like that in production... if it wasn&#39;t for the fact that fold expressions are purely a compile-time feature. Which brings up  the entire point of my tweet:\n The more I use #cpp packs and fold expressions, the more I wish they were available at run-time. They are a very elegant and convenient way of expressing some operations. ( @seanbax had the right idea!)\n The discussion I was trying to spark was on whether or not C++ could get a syntax similar to fold expressions that also worked at run-time, because I believe it is a valuable addition to the language to improve readability, conciseness, and safety all at once.\n I tagged  Sean Baxter in the original tweet, who created an amazing language called  Circle. In a nutshell, it&#39;s an extension of C++ adding a new powerful metaprogramming paradigm and many new features to improve productivity. Definitely worth a look into.\n Circle supports   &#34;list comprehensions, slices, ranges, for-expressions, functional folds and expansion expressions&#34;, even at run-time. In fact, you are able to write  stitchImages in Circle (using run-time data) in a way that&#39;s very close to the variadic template version:\n TextureAtlas stitchImages( const  std::vector&lt;Image&gt;&amp; images){  const  auto width = (images[:].width + ...);  const  auto height =  std::max({images[:].height...});  // ...\n [:] is basically compiler magic that allows you to treat the elements of the vector as if they were a parameter pack. It&#39;s all syntactic sugar for regular run-time operations that you would perform using a loop. I find it extremely valuable and I think that is the right direction forward for C++ - would love to see a paper proposed for standardization.\n  Of course, an observation I made regarding the gap between compile-time and run-time features in C++ in the context of a personal hobby gamedev project attracted the attention of part of the Twitter gamedev community, whose first reaction was naturally to either (1) mockingly retweet my original code snippet, showing one&#39;s followers how &#34;stupid those C++ programmers are&#34;, or (2) comment on how the code was &#34;retarded&#34; and how my tweet was setting a negative example for young developers and should be shunned.\n While that&#39;s already sad, I even more disappointed by seeing that some people whose work I truly admire also had something very disheartening to tell me:\n   Thankfully, I have faced enough hardships in my life so that this kind of bullshit doesn&#39;t phase me (much) anymore. However, imagine a young developer getting this kind of response from one of their idols, to one of their experiments they were eager to share: that would be soul-crushing.\n Even if the author of that tweet was generalizing, those kinds of generalization are hurting our community and industry. Somebody experimenting on their personal project and sharing some thoughts to a specific subset of the C++ community isn&#39;t hurting anyone.\n I could show many absurd and tasteless tweets I was sent, but that&#39;s not the point of this post. I want to discuss misconceptions regarding Modern C++ in the game development industry.\n  Hidden throughout the barrage of snarky remarks or self-righteous observations on how Modern C++ is a cancer for the programming industry, there were some really good points raised as well. Many game develoeprs have very specific requirements that the C++ standardization committee is not prioritizing for.\n  The most common requirement,  debuggability, is of tremendous importance. There are two ways in which the use of Modern C++ hinders the ability to debug code. It all stems from how Modern C++ encourages the use of &#34;zero-cost abstractions&#34;:\n Such abstractions are only zero-cost (at run-time) when compiler optimizations are enabled. When running an application in debug mode, the performance can be hundreds of times worse compared to release mode, which can make a game literally unplayable.\n The way such abstractions are often implemented is by leveraging layered architecture and code reuse. These are valuable software engineering principles that allow large projects to scale and grow, but they also tend to cause deep call stacks due to multiple levels of indirection: such depth can make it hard to understand what is going on during debugging. This problem is particularly evident when using standard library facilities, which are notoriously known for having very complicated and deeply-nested implementation details.\n These points are fair. The solution that most game developers reach towards in order to mitigate these points is to simply avoid abstractions as much as possible, including making extreme decisions such as not using the standard library at all, or using  std::vector&lt;T&gt;::data() + N instead of  std::vector&lt;T&gt;::operator[](N) (or even not using containers at all).\n However, there is an aspect of those solutions that it is often overlooked. Let&#39;s (reasonably) assume that, apart from situations where you just want to explore a codebase interactively, the frequency of having to debug is linearly proportional to the number of bugs in your program. Let&#39;s also (again, reasonably) assume that the use of battle-tested abstractions designed to improve safety reduces the chance of bugs in your program.\n Do you see the conundrum? Of course you&#39;re going to have to debug more if you write error-prone C-like code and avoid utilities that have been refined over decades to help you avoid mistakes.\n I am sure there is a balance - not every line of your code should be buried under 20 layers of abstractions, however proper use of the standard library (or custom-made types and functions) would reduce the times debugging is required, as mistakes would be prevented during compilation. Dan Saks gave an excellent talk at CppCon 2016 (which I had the pleasure to attend in person) which touches on this topic a bit - highly recommended:\n   Standard library implementors and C++ committee members should take this requirement seriously, and brainstorm on how the situation could be improved;\n Game developers (and people generally skeptical of Modern C++) should give a chance to a more balanced coding style where carefully chosen abstractions are used to avoid bugs at compile-time whenever possible.\n I can also see another interesting opportunity in the space of debugging tools development to mitigate factors that can make one&#39;s debugging experience suboptimal. As an example, a user-friendly way to mark some layers of the call stack as &#34;unimportant&#34; (and remember that information between debugging sessions) could be a good starting point.\n However, I am sure of one thing: completely abandoning the safety, readability, flexbility, and expressivity provided by Modern C++ features and abstractions is an extreme and unwise reaction to this problem.\n  Another issue that was brought up multiple times was one that has been covered many and many times before: compilation times. C++ has a notoriously bad reputation for slow compilation times which, in my opinion, was very justified when we didn&#39;t have modern language features. Prior to C++11, any metaprogramming required heavy use of templates, including recursive template instantiations to - for example - simulate type lists. Furthermore, libraries that achieved incredible feats given the limitations of C++03 (such as Boost) while keeping portability with thousands of compiler/platform combinations had to resort to arcane techniques that ultimately led to very slow compilation times.\n It is not surprising that, game developers who had poor experiences back in the day, still shudder from the idea of introducing any template or abstraction in their codebase, failing to realize that things are much better nowadays.\n One of the biggest misconceptions I&#39;ve been exposed to countless times is that &#34;Modern C++&#34; equals &#34;Standard Library&#34;. That is completely false. Standard library implementations are not optimized for compilation time or debuggability - they need to be (1) general-purpose, (2) easy to maintain and extend, (3) efficient at run-time, (4) compliant to the standard and all its nuances.\n This thread on   r/cpp ( &#34;unique_ptr - seven calls to dereference - why is this needed?&#34;) is very telling. The author calls themselves a  &#34;modern C++ skeptic&#34;, and feels (rightfully) justified in their skepticism by the fact that a simple  std::unique_ptr dereference requires 7 layers of indirection in the call stack.\n A more compelling resource is the   &#34;Lightweight but still STL-compatible unique pointer&#34; article by the author of the excellent  Magnum graphics engine.\n The article observes that including the  &lt;memory&gt; header in a project drastically increases compilation times. The author also tested the implementation of modules at the time, and it didn&#39;t help much. The author, instead of becoming a crusader against Modern C++, realizes that the problem lies in the implementation of  std::unique_ptr, and that the latest standards of the language provide the necessary features for the creation of a lightweight alternative to  std::unique_ptr (which is good enough for Magnum&#39;s requirements). This thought process leads to the creation of   CorradePointer.h, a single-header implementation of unique heap-allocated object ownership that has minimal impact on compilation times.\n The point I&#39;m trying to make here is that most of the language features offered by Modern C++ can be used without depending on the standard library. I&#39;m also admitting that the standard library is far from perfect, but that&#39;s understandable as it is a general-purpose tool that needs to satisfy an incredible amount of use cases.\n What I just discussed is the misconception that bothers me the most. If  &lt;memory&gt; is too expensive for your compilation times, why would you ever abandon the safety, convenience, and readability improvements of  std::unique_ptr when you can implement something similar in about 20 lines of code?\n This point can be applied to pretty much every standard library component (except very low level ones like  &lt;type_traits&gt;, which do not impact compilation times significantly).\n When you rashly abandon Modern C++ as a whole and become a Twitter keyboard warrior, there are real and important benefits you are missing out that C++ provides.\n  In the context of game development, I would not be able to live without many features introduced in C++11/14/17. Some of them are simple quality-of-life improvements that have  zero impact on compilation time or debuggability and yet provide an immense amount of value.\n I made a list of features which I think (1) are simple, (2) have minimal impact on debuggability and compilation times, and (3) are still extremely valuable.\n   enum class - great to represent a closet of options or choices. Great for AI, menus, network protocols, &#34;strong typedefs&#34;, and more.\n   Lambda expressions - useful to compartmentalize your code by introducing local functions that bundle related logic together, or to express asynchronous operations more cleanly.\n override - sometimes  virtual polymorphism is useful for games, and  override helps avoid mistakes and increase readability. Of course, I am not suggesting your should have an  Entity class with a  virtual update member function (even though that&#39;s entirely reasonable for smaller games), but any sort of auxiliary system (e.g. scene manager) can benefit from polymorphism.\n  Type aliases and template aliases - excellent way to avoid code repetition and make your code more maintainable/flexible, as you can change your types in a single place instead of find-replacing all over your codebase.\n Raw string literals - I could not live without these. If I want to embed GLSL code in my game and keep it readable, these are a must. Incredibly useful.\n  Binary literals - say goodbye to bit masks which require mental gymnastics. Just show what your mask is supposed to look like in binary, making it extremely clear which bits are going to be affected.\n Digit separators - games are full of hardcoded constants. &#34;Max particles&#34;. &#34;Max entities&#34;. And so on. Make them more readable with a simple  &#39; character - it will be extremely easy to distinguish a  100&#39;000 from  1&#39;000&#39;000.\n  Nested namespace definitions - organize your code in a fine-grained manner, avoiding all the annoyance of extra indentation levels.\n [[fallthrough]] - best thing since sliced bread, especially because I know you game developers love  switch statements. This attribute allows you to be explicit about your intention to fall through, avoiding bugs and increasing readability.\n [[nodiscard]] - I lied. This is the best thing since sliced bread, especially because I know you game developers hate to use exceptions. Any function returning a value which shouldn&#39;t be ignored (e.g. an error code) can now be decorated with this attribute, causing the compiler to complain if you forget to check an important return value. I use this feature all the time, both at work and in my personal projects. It is a life saver.\n Structured bindings - I also know you like plain and flat  struct types. I do too. They&#39;re fast, simple, and easy to work with. C++17 makes them even better as you can now destructure their members and give them individual names.\n  I believe that both sides can learn a lot from each other, and that the negativity and toxicity I&#39;ve experienced for a tweet (that was just a personal observation regarding a Modern C++ feature) shows how sad the situation is.\n I also strongly believe that every game developer who is skeptical of Modern C++ should stop erroneously thinking of the &#34;Standard Library&#34; as &#34;Modern C++&#34; and should give a try to all the features I listed above. I promise that they will not impact your compilation times, and they will very likely have a positive impact on the quality, readability, and safety of your code.\n Finally, my hope is that this post will bring both sides closer together rather than create a new shitstorm - that is not my intention. I enjoy some rivalry, and I do enjoy some arguing... but sometimes it is too much, and the &#34;fun&#34; we have by shouting our opinions at each other should always at least give both sides something to\n......", "posttime": "2020-05-16 18:52:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,开发,游戏", "title": "现代C++游戏开发：思考与误区", "title_en": "Modern C++ gamedev: thoughts and misconceptions", "transed": 1, "url": "https://vittorioromeo.info/index/blog/gamedev_modern_cpp_thoughts.html", "via": "", "real_tags": ["c++", "开发", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "f0df1d414ebf3987e55fa6340c4b2f71.jpg", "infoid": 1002382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们中的许多人使用社交媒体被猫咪视频逗乐或被美味的蛋糕惊叹时，另一些人则用它们来发现新的物种。后者包括来自哥本哈根大学丹麦自然历史博物馆的研究人员。事实上，他们刚刚通过推特发现了一种新型的寄生真菌。这一切都始于国家自然历史博物馆的生物学家兼副教授安娜·索菲亚·雷博雷拉(Ana Sofia Reboleira)在推特上滚动。在那里，她偶然发现了一张北美人的照片，这张照片是她的美国同事、弗吉尼亚理工大学的德里克·亨宁(Derek Hennen)分享的。她发现几个小点打在她训练有素的眼睛上。\n我可以在千足虫的表面看到一些类似的东西。在此之前，这些真菌从未在美国千足类动物身上发现过。所以，我去找我的同事，给他看了这张照片。Ana Sofia Reboleira解释说，这就是我们跑到博物馆的收藏品并开始挖掘的时候。\n她和同事亨里克·恩霍夫(Henrik Enghoff)在自然历史博物馆(Natural History Museum)庞大的藏品中的几只美国千足类动物身上发现了几个相同的真菌样本--这些真菌以前从未被记录在案。这证实了以前不为人知的唇形目(Laboulbeniales)的存在-一种攻击昆虫和千足类的微小、怪异、基本上未知的真菌寄生虫的目。\n这种新发现的寄生真菌现在已经被正式命名为Troglomyces twitteri。\n安娜·索菲亚·雷博雷拉指出，这一发现是在社交媒体上分享信息会产生完全意想不到的结果的一个例子：\n据我们所知，这是第一次在推特上发现新物种。它强调了这些平台对于共享研究的重要性，从而能够取得新的成果。我希望这将激励专业和业余研究人员通过社交媒体分享更多数据。这一点在冠状病毒危机期间变得越来越明显，当时很多人被阻止进入田野或实验室。\n她强调，这一结果是可能的，因为她接触到了世界上最大的生物收藏品之一。\n因为我们有大量的博物馆藏品，所以相对容易地确认我们确实在为科学寻找一个全新的物种。这表明博物馆的藏品是多么有价值。安娜·索菲亚·雷博雷拉(Ana Sofia Reboleira)说，这些藏品中隐藏的东西比我们知道的要多得多。\n唇形目-真菌看起来像微小的幼虫。真菌属于它们自己的一类，因为它们生活在寄主有机体的外部，甚至生活在身体的特定部位-在这种情况下，生活在千足类动物的生殖器官上。这种真菌通过一种特殊的吸力结构刺穿宿主动物的外壳，从宿主动物身上吸取营养，而真菌的另一半则突出。\n大约30种不同种类的寄生唇形菌目真菌攻击千足虫。其中绝大多数是在2014年之后才被发现的。根据Reboleira的说法，很可能还有大量的有待发现。关于唇形目的研究仍然极其匮乏。\n每天研究这些真菌的Reboleira说，他们对自己的生物学也知之甚少。她认为，这些真菌不仅可以教给我们它们赖以生存的昆虫，还可以告诉我们寄生虫本身背后的机制-也就是寄生虫和它们的宿主之间的关系。她希望这项研究还将提供关于攻击并可能危害人类健康的寄生虫的有用知识。\n新物种Troglomyces twitteri属于被称为Laboulbeniales的微小寄生真菌目。这些真菌以昆虫、蜘蛛和千足虫为生，并依靠它们的寄主有机体生存。\n这项研究是由西班牙巴塞罗那Autónoma大学生物系的Sergi Santamaria和丹麦自然历史博物馆的Henrik Enghoff&Amp；Ana Sofia Reboleira进行的。\n来自巴黎国家博物馆(MNHN)的千足类标本证实了真菌的发现。\n丹麦自然历史博物馆的昆虫学藏品是世界上最大的馆藏之一，馆藏了超过350万枚针装昆虫，以及至少同样多的酒精保存的昆虫和陆地动物标本。代表了大约10万个已知物种(在100多万个物种总数中)。\n更多信息：Sergi Santamaria等人，第一个来自美国千足目的唇形菌目(子囊门，唇形菌)，通过社交媒体Mycokey(2020)发现。doi：10.3897/mycokeys.67.51811\n引用：发现了奇怪的新物种。在推特上(2020年5月15日)从https://phys.org/news/2020-05-bizarre-species-twitter.html检索到2020年5月16日。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "While many of us use social media to be tickled silly by cat videos or wowed by delectable cakes, others use them to discover new species. Included in the latter group are researchers from the University of Copenhagen&#39;s Natural History Museum of Denmark. Indeed, they just found a new type of parasitic fungus via Twitter.    It all began as biologist and associate professor Ana Sofia Reboleira of the National Natural History Museum was scrolling though Twitter. There, she stumbled upon a photo of a North American   shared by her US colleague Derek Hennen of Virginia Tech. She spotted a few tiny dots that struck her well-trained eyes.\n  &#34;I could see something looking like   on the surface of the millipede. Until then, these fungi had never been found on American millipedes. So, I went to my colleague and showed him the image. That&#39;s when we ran down to the museum&#39;s collections and began digging,&#34; explains Ana Sofia Reboleira.\n  Together with colleague Henrik Enghoff, she discovered several specimens of the same fungus on a few of the American millipedes in the Natural History Museum&#39;s enormous collection—fungi that had never before been documented. This confirmed the existence of a previously unknown   of Laboulbeniales—an order of tiny, bizarre and largely unknown fungal parasites that attack insects and millipedes.\n  The newly discovered parasitic fungus has now been given its official Latin name,  Troglomyces twitteri.\n    Ana Sofia Reboleira points out that the discovery is an example of how sharing information on social media can result in completely unexpected results:\n  &#34;As far as we know, this is the first time that a new species has been discovered on Twitter. It highlights the importance of these platforms for sharing research—and thereby being able to achieve new results. I hope that it will motivate professional and amateur researchers to share more data via social media. This is something that has been increasingly obvious during the coronavirus crisis, a time when so many are prevented from getting into the field or laboratories.&#34;\n      She stresses that the result was possible because of her access to one of the world&#39;s largest biological collections.\n  &#34;Because of our vast museum collection, it was relatively easy to confirm that we were indeed looking at an entirely new species for science. This demonstrates how valuable museum collections are. There is much more hiding in these collections than we know,&#34; says Ana Sofia Reboleira.\n    Laboulbeniales-fungi look like tiny larvae. The fungi are in a class of their own because they live on the outside of host organisms, and even on specific parts of bodies—in this case, on the reproductive organs of millipedes. The fungus sucks nutrition from its host animal by piercing the host&#39;s outer shell using a special suction structure, while the other half of the fungus protrudes.\n  Approximately 30 different species of parasitic Laboulbeniales-fungi attack millipedes. The vast majority of these were only discovered after 2014. According to Reboleira, there are most likely a great number remaining to be discovered. Research in the area of Laboulbeniales remains extremely scarce.\n  Nor is much known about their own biology, says Reboleira, who researches these fungi on a daily basis. She believes that these fungi can not only teach us about the insects upon which they live, but also about the mechanisms behind parasitism itself—that is, the relationship between parasites and their hosts. She hopes that the research will also provide useful knowledge about the parasites that attack and can be harmful to human health.\n    The new species  Troglomyces twitteri belongs to the order of microscopic parasitic fungi known as Laboulbeniales. These fungi live on insects, arachnids and millipedes, and rely on their host organisms to survive.\n  The research was conducted by: Sergi Santamaria of the Departament de Biologia Animal, de Biologia Vegetal i d&#39;Ecologia, Universitat Autònoma de Barcelona, Spain; and Henrik Enghoff &amp; Ana Sofia Reboleira from the Natural History Museum of Denmark at the University of Copenhagen.\n  Millipede specimens from the Muséum national d&#39;Histoire naturelle (MNHN) in Paris helped confirm the discovery of the   of fungus.\n The Natural History Museum of Denmark&#39;s entomological collection is one of the world&#39;s largest, housing more than 3.5 million pin-mounted insects and at least as many alcohol-preserved insect and land animal specimens. About 100,000 known species are represented (out of a total number of over one million species).\n        More information:\t\t\t\t\t\t\t\t\t\t\t\tSergi Santamaria et al, The first Laboulbeniales (Ascomycota, Laboulbeniomycetes) from an American millipede, discovered through social media,  MycoKeys (2020).  DOI: 10.3897/mycokeys.67.51811\n     Citation: Bizarre new species discovered... on Twitter (2020, May 15) retrieved 16 May 2020 from https://phys.org/news/2020-05-bizarre-species-twitter.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-05-16 18:51:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,物种,species,真菌", "title": "推特上发现离奇的新物种", "title_en": "Bizarre new species discovered on Twitter", "transed": 1, "url": "https://phys.org/news/2020-05-bizarre-species-twitter.html", "via": "", "real_tags": ["推特", "物种", "species", "真菌"]}, {"category": "", "categoryclass": "", "imagename": "00bbc7fd7c30910f969897267423d001.jpg", "infoid": 1002380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这段20分钟的视频中，我们将学习“如何编写一个Flask rest API并将Sqlite数据库用作少于100行的数据存储”。Books API将实现.", "note_en": "In this 20min video, we will learn \"How to write a Flask REST API and use Sqlite Database as a data store in less than 100 lines\". The Books API will impleme...", "posttime": "2020-05-16 18:08:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,sqlite,flask,api", "title": "Python Flask REST API和Sqlite DB AS数据存储，不超过100行", "title_en": "Python Flask REST API and Sqlite DB as data-store in less than 100 lines", "transed": 1, "url": "https://www.youtube.com/watch?v=Sf-7zXBB_mg&list=PLVUt86LpSCWgEe5EZsRomCTcwUH5dP-2x", "via": "", "real_tags": ["python", "sqlite", "flask", "api"]}, {"category": "", "categoryclass": "", "imagename": "7e4ec85136f3684b369fe68a8c5d1fa0.jpg", "infoid": 1002379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个臭名昭著的黑客组织声称有特朗普总统的“脏衣服”，并威胁称，如果有史以来最大的网络赎金之一得不到支付，下周就会公布这份报告。\n上周成功攻击纽约一家名人律师事务所的黑客现在声称，他们掌握了大量有关特朗普总统的肮脏信息。正如第六版首次报道的那样，这些黑客现在要求4200万美元(3460万英镑)的赎金，并威胁说，如果这些赎金不在下周内支付，他们就会公布他们掌握的信息。\n涉及的黑客是网络罪犯Revil勒索软件运营商。该组织也被称为Sodinokibi，有着悠久而不光彩的袭击历史，包括针对Travelex的毁灭性袭击。最近的一次是针对纽约律师的勒索软件攻击，他们的客户包括Lady Gaga，麦当娜和布鲁斯·斯普林斯汀。\n除了锁定系统外，该组织还运营着一个双重打击的系统，他们在加密数据之前将数据窃取，并利用这一点作为筹码，为赎金支付提供便利。不付钱，黑客就会公布偷来的文件，就像今年早些时候特斯拉(Tesla)、SpaceX和洛克希德·马丁(Lockheed Martin)陷入另一个组织对一家零部件供应商的攻击的交叉火力中一样。\n据报道，攻击者已经从Grubman，Shire，Meiselas and Sacks律师事务所窃取了756G的此类数据，并在黑暗的网络上发布了与Lady Gaga和麦当娜有关的文件，现在攻击者正在加大赌注。\n最初的赎金要求是2100万美元(1730万英镑)，但在没有支付赎金后，赎金要求现在翻了一番，有关特朗普总统文件的威胁现在也被加入其中。\n我与Emsisoft研究暗网犯罪活动的分析师布雷特·卡洛(Brett Callow)进行了交谈，他告诉我，到目前为止，Revil运营商已经发布了超过20G的与Lady Gaga有关的数据，其中包括合同文件。\n我们将出版的下一个人物是唐纳德·特朗普(Donald Trump)。竞选正在进行，我们按时发现了一大堆脏衣服。特朗普先生，如果你想继续当总统，就向那些家伙们伸出一根锋利的棍子，否则你可能会永远忘记这个雄心壮志。对于你们的选民，我们可以让你们知道，在这样的出版之后，你们肯定不想看到他成为总统。好吧，让我们省略细节吧。截止日期是一周。\n据了解，特朗普总统不是，也从来不是纽约律师事务所的客户。该组织有哪些与特朗普有关的文件(如果有的话)仍有待观察。\n联邦调查局正在调查这起事件，据悉已建议律师事务所不要与袭击者谈判或支付赎金，因为这将违反联邦刑法。\nGrubman，Shire，Meiselas and Sacks律师事务所给第六页的完整声明很有趣，因为它说：专家和联邦调查局告诉我们，与恐怖分子谈判或向他们支付赎金违反了联邦刑法，并得出结论，我们感谢我们的客户的压倒性支持，感谢他们认识到今天没有人是安全的网络恐怖主义。\n布雷特·卡洛说，这不仅有趣，而且意义重大。据我所知，从来没有勒索软件攻击被归类为恐怖行为，这包括对美国城市和医院的攻击，所以组织一直被允许谈判。我只能假设这种分类是由于特朗普面临的威胁。\n对于Revil罪犯来说，这可能是个可怕的消息，实际上，对于他们拥有文件的名人客户来说，这可能是个可怕的消息。一旦将恐怖主义纳入方程式，对这种威胁行为者的追捕就呈现出完全不同的维度。犯罪分子提到特朗普已经搬起石头砸自己的脚，卡洛说，他们不可能拿到赎金，所以他们很可能会公布剩下的数据或拍卖。", "note_en": "A notorious hacking group has claimed to have &#34;dirty laundry&#34; on President Trump and has threatened to publish it next week if one of the biggest cyber-ransoms ever isn&#39;t paid.\n  The same hackers that successfully attacked a celebrity New York law firm last week have now claimed to have &#34;a ton of dirty laundry&#34; about President Trump. As first reported at  Page Six, those hackers are now demanding a ransom of $42 million (£34.6 million) and have threatened to publish the information they have if this isn&#39;t paid within the next week.\n  The hackers concerned are the cybercriminal REvil ransomware operators. The group, also known as Sodinokibi, has a long and inglorious history of attacks,  including the devastating one against Travelex. The most recent being the ransomware attack against the  New York lawyers whose clients include Lady Gaga, Madonna and Bruce Springsteen.\n  As well as locking down systems, this group operates a double-whammy system whereby they exfiltrate data before encrypting it and use this as leverage to facilitate ransom payment. Don&#39;t pay up, and the hackers publish documents from the stolen haul, as has been the case when  Tesla, SpaceX and Lockheed Martin were caught in the crossfire of an attack by a different group against a parts supplier earlier this year.\n     Having already stolen a reported 756 gigabytes of such data from the Grubman, Shire, Meiselas and Sacks law firm and posted documents relating to Lady Gaga and Madonna on the dark web, the attackers are now upping the ante.\n  The original ransom demand was for $21 million (£17.3 million), but this has now been doubled after that was not paid, and the threat regarding documents concerning President Trump has now been thrown into the mix.\n    I spoke to Brett Callow, an analyst at Emsisoft with expertise in dark web criminal activity, who told me that so far, the REvil operators have posted more than two gigabytes of data relating to Lady Gaga that includes contract documents.\n    &#34;The next person we&#39;ll be publishing is Donald Trump. There&#39;s an election race going on, and we found a ton of dirty laundry on time. Mr. Trump, if you want to stay president, poke a sharp stick at the guys, otherwise you may forget this ambition forever. And to you voters, we can let you know that after such a publication, you certainly don&#39;t want to see him as president. Well, let&#39;s leave out the details. The deadline is one week.&#34;\n  It is understood that President Trump isn&#39;t, nor has he ever been, a client of the New York law firm. Quite what, if any, documentation relating to Trump the group has remains to be seen.\n  The FBI is investigating the incident and is understood to have advised the law firm  not to negotiate with the attackers or pay the ransom as this would violate federal criminal law.\n  The full statement given to Page Six by the Grubman, Shire, Meiselas and Sacks law firm is interesting, in that it stated: &#34;We have been informed by the experts and the FBI that negotiating with or paying ransom to terrorists is a violation of federal criminal law,&#34; and concluded, &#34;we are grateful to our clients for their overwhelming support and for recognizing that nobody is safe from cyberterrorism today.&#34;\n  Brett Callow says this is more than interesting; it is significant. &#34;As far as I know, no ransomware attack has ever been classed as a terrorist act, and that includes attacks on US cities and hospitals, so organizations have always been permitted to negotiate. I can only assume this classification is due to the threat to Trump.&#34;\n  Which could be terrible news for the REvil criminals and, indeed, the celebrity clients whose documents they possess. Once terrorism is brought into the equation, the hunt for such threat actors takes on an altogether different dimension. &#34;The criminals have shot themselves in the foot by mentioning Trump,&#34; Callow says, &#34;There’s no way they can collect a ransom, so they’ll probably publish the rest of the data or auction it.&#34;", "posttime": "2020-05-16 18:00:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,声称,claim,特朗普", "title": "黑客声称拥有特朗普的脏衣服并索要4200万美元保持沉默", "title_en": "Hackers Claim to Have Trump's Dirty Laundry and Demand $42M to Keep Quiet", "transed": 1, "url": "https://www.forbes.com/sites/daveywinder/2020/05/15/hackers-claim-to-have-trumps-dirty-laundry-and-demand-42-million-to-keep-quiet/#de8fa2e37d1b", "via": "", "real_tags": ["黑客", "声称", "claim", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "c96ee58cfcf1978aa978043627958188.jpg", "infoid": 1002378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年3月，爵士乐钢琴家兼作曲家丹·泰普费尔(Dan Tepfer)发现自己被限制在布鲁克林的公寓里，在可预见的未来，他的所有预订都被取消了，就像世界各地的音乐家一样。因此，他决定认真研究一个他一直在玩弄已久的想法。\n38岁的泰普费尔也擅长古典音乐，拥有天体物理学本科学位和复杂的技术技能，他编写了一个计算机程序。他录下了自己在雅马哈圆盘钢琴(Yamaha Disklavier)上优美地演奏巴赫的“戈德堡”变奏曲，这是一架带有高科技播放器钢琴功能的全三角钢琴；他的程序随后播放了每一首变奏曲，但都翻了过来。\n听我解释。Tepfer先生为他的大胆实验选择了一个勇敢的标题，“#BachUpside Down”，这表明这个项目是某种噱头。不用谢。把音乐“倒过来”的过程有很长的历史先例：这是一种复调反转的技巧。\n恕我直言，对位指的是由多个部分或多行谱写的音乐，这些部分或线条重叠交织在一起。有时，巴赫-以及其他对位大师-会玩弄线条的倒置。例如，音符基本上以特定模式上升的旋律线条会颠倒过来，这样改变后的线条基本上就会下降--这是一面镜子般的反射。\n泰普费尔在他的网站上写道，结果就像是“通过棱镜”看巴赫；音乐“感觉像是一首新作品”。\n然而，与此同时，它听起来出奇地熟悉，从颠倒的咏叹调开始-这是巴赫30首变奏曲的主题。巴赫原作低音部分缓慢上升的音符勾勒出G大调的三和弦，在颠倒的版本中，它变成了顶线上优美的下落数字。轻轻点缀的原创旋律，随着它的转弯和颤音，变成了一条活泼的底线。而关键的低音模式，从四个下降音符开始，为整首曲子提供了基础，现在成为最高音，从四个上升音符开始。巴赫用G大调创作的音乐，现在听起来隐约像是G小调，尽管和声难以捉摸，令人迷失方向。\n巴赫的第一个变奏曲是以其诙谐的节奏摇摆来定义的：热情洋溢的第16个音符在跳舞的低音线上展开，直到部分切换角色-并继续切换。在泰普费尔的颠倒版本中，摇摆、轮廓和性格仍然清晰可见。\n泰普费尔多年来一直参与“戈德堡”变奏曲，在他富有想象力的“戈德堡变奏曲/变奏曲”节目中，他完整地演奏巴赫的作品，每一首变奏曲之后都有他自己对音乐的即兴反应。(他在2011年录制了一张令人印象深刻的唱片。)\n在这种情况下，正如泰普费尔在最近的一次电话采访中所说，他沉迷于与巴赫“完全捣乱”。但他说，有了#BachUpside Down，他“让信息保持原始”，只是创造了它的镜子。然而，要做到这一点，在保持音符之间的间距-音程-相同的同时，涉及到一个被称为负和声的神秘过程。\n这会变得非常复杂。但转换所涉及的理论操纵对大多数听众来说不太可能重要，他们会本能地听到颠倒的版本具有一种非正统但奇怪的熟悉诱惑。而且不知何故，巴赫写作的严谨-其节奏和对位的错综复杂-生动地体现了出来。新的小调对整体声音的选择令人迷失方向。我会说好极了。\n以令人窒息的第五变奏曲为例，泰普费尔说，在巴赫的原作中，它是“技艺、键盘体操和戏剧的惊人结合”。翻过来，听起来像是一个恶魔钢琴家正在演奏普罗科菲耶夫(Prokofiev)在新巴洛克(Neo-Baroque)疯狂中创作的某种狂热的、顽皮的作品。\n在第七变奏曲中，巴赫音乐的巴洛克舞蹈特征，其修剪的装饰品和锯齿状的点音符节奏，在颠倒版本中几乎更加明显，尽管这首作品的和声领域现在看起来奇怪地空旷。在它的新版本中，巴赫的第10号变奏曲，一首简短的赋格，可能是泰普费尔所描述的“棱镜”效应的最有力的例子。你觉得你以前听过这首音乐。然而，对位似乎无处不在，和声语言在他的新古典主义血脉中隐约像是欣德米特。\n第13号变奏曲是泰普费尔先生迄今已完成的15首变奏曲中最喜欢的一首。巴赫的原作是该系列中第一个沉思的变体，既悲伤又无辜。泰普费尔在他的笔记中写道，倒置效果“令人震惊”，旋律现在在低音，两个配音在高音。他写道，这听起来像是原作的一个“更不祥”的版本，但“同样令人心酸”。\n这已经不是泰普费尔第一次将他的音乐制作与他的编程专长结合起来了。在他最新的爵士乐专辑“Natural Machines”中，他根据“All the Things You Are”这样的标准即兴创作，而一台连接到他正在播放的Disklavier的电脑则在瞬间做出反应，并提供对应性的附加内容。\n他说，#BachUpside Down涉及一种新的紧张工作，这就是为什么他只完成了巴赫30首变奏曲中的一半：“我需要休息一下，”他补充道。“我就要重新开始了。”\n他创作的视频包括倒置变体的手稿页面，可以很容易地打印出来。一些钢琴家的同事一直在学习它们，并给他发送了他们自己的视频。泰普费尔自己才刚刚开始阅读颠倒的版本。\n“他们并不比原版更难玩，”他说--不过，他补充说，“原版很难！”", "note_en": "In March, the jazz pianist and composer Dan Tepfer found himself confined to his apartment in Brooklyn with all his bookings canceled for the foreseeable future, like musicians everywhere. So he decided to work seriously on an idea he had long been toying with.\n Mr. Tepfer, 38, who also excels in classical music and has an undergraduate degree in astrophysics as well as sophisticated technology skills, wrote a computer program. He recorded himself playing Bach’s “Goldberg” Variations, beautifully, on a Yamaha Disklavier, a full grand piano with a high-tech player piano function; his program then played back each variation, but flipped.\n Let me explain.  The plucky title Mr. Tepfer chose for his bold experiment, “#BachUpsideDown,” suggests that this project is some kind of gimmick. Not at all. The process of turning music “upside-down” has a long historical precedent: It’s the technique of inversion in counterpoint.\n Without getting too theoretical, counterpoint refers to music written in multiple parts, or lines, that overlap and intertwine. Sometimes Bach — as well as other counterpoint masters — played around with inversions of lines. For example, a melodic strand where the notes basically ascend in a specific pattern would be turned upside-down, so that the altered line basically descends — a mirror-like reflection.\n The results, Mr. Tepfer writes on his website, are like looking at Bach “through a prism”; the music “feels like a new piece.”\n  Yet at the same time, it sounds eerily familiar, starting with the upside-down Aria — the theme developed over Bach’s 30 variations. The slowly ascending notes in the lower staff of Bach’s original, which outline a G major triad, become, in the upside-down version, a graceful falling figure in the top line. The gently embellished original melody, with its turns and trills, becomes an animated lower line. And the crucial bass pattern, which begins with four descending notes and provides the foundation for the entire piece, now becomes the topmost voice, starting with four rising notes. The music, which Bach wrote in G major, now sounds vaguely like it’s in G minor, though the harmonies are elusive and disorienting.\n Bach’s first variation is defined by its jocular rhythmic swing: Hearty strands of 16th notes unfold atop a dancing bass line, until the parts switch roles — and keep on switching. In Mr. Tepfer’s upside-down version, the sway, contours and character still come through.\n  Mr. Tepfer has been involved with the “Goldberg” Variations for years, as in his imaginative  “Goldberg Variations/Variations” program, in which he plays Bach’s work complete, following each variation with his own improvised reaction to the music. (He made an impressive  recording in 2011.)\n In that case, Mr. Tepfer indulged in “complete messing around” with Bach, as he put it in a recent phone interview. But with #BachUpsideDown he is, he said, “leaving the info pristine,” and just creating its mirror. To do so, however, while leaving the spacing between the notes — the intervals — the same, involved an arcane process that has been called negative harmony.\n  This gets very complicated. But the theoretical manipulations the conversion entailed are not likely to matter to most listeners, who will instinctively hear the upside-down versions as having an unorthodox yet weirdly familiar allure. And somehow, the rigor of Bach’s writing — its rhythmic and contrapuntal intricacies — comes through vividly. The new minor-mode cast to the overall sound is disorienting. I’d say wonderfully so.\n  Take the breathless Variation No. 5, which in Bach’s original is, Mr. Tepfer said, a “stunning combination of virtuosity, keyboard gymnastics and drama.” Turned upside-down, it sounds like a demonic pianist is playing some wild-eyed, impish piece written by Prokofiev in a fit of Neo-Baroque madness.\n  In Variation No. 7, the Baroque dance character of Bach’s music, with its clipped ornaments and jagged dotted-note rhythms, is almost more pronounced in the upside-down version, though the harmonic realm of the piece now seems curiously spacey. In its new version, Bach’s Variation No. 10, a short fugue, may be the strongest example of the “prism” effect Mr. Tepfer described. You feel you’ve heard this music before. Yet the counterpoint seems to roam all over the place and the harmonic language is vaguely like Hindemith in his Neo-Classical vein.\n  Variation No. 13 is Mr. Tepfer’s favorite of the 15 he has completed so far. Bach’s original is the first contemplative variation in the series, at once sad and innocent. The inversion works “shockingly well,” Mr. Tepfer writes in his notes, with the melody now in the bass and the two supporting voices in the treble. It sounds like a “more ominous” version of the original, he writes — but “just as poignant.”\n This isn’t the first time Mr. Tepfer has combined his music-making with his programming expertise. On his latest jazz album, “Natural Machines,” he improvises on standards  like “All the Things You Are” while a computer hooked up to the Disklavier he’s playing reacts in the moment and supplies contrapuntal additions.\n #BachUpsideDown involved intense work of a new kind, he said, which is why he only finished half of Bach’s 30 variations: “I needed a break,” he added. “I’m about to start again.”\n The videos he has created include manuscript pages for the inverted variations that can be printed out easily. Some pianist colleagues have been learning them and  sending him videos of their own. Mr. Tepfer has only just begun reading through the upside-down versions himself.\n “They’re not harder to play than the originals,” he said — though, he added, “the originals are hard!”", "posttime": "2020-05-16 18:00:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "钢琴家,pianist,巴赫", "title": "爵士钢琴家颠倒巴赫", "title_en": "A Jazz Pianist Flips Bach Upside-Down", "transed": 1, "url": "https://www.nytimes.com/2020/05/15/arts/music/dan-tepfer-bach.html", "via": "", "real_tags": ["钢琴家", "pianist", "巴赫"]}, {"category": "", "categoryclass": "", "imagename": "a8213d289b55c413a64534c49cfcb32b.jpg", "infoid": 1002377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯洛文尼亚政府周四(5月14日)晚些时候呼吁正式结束其冠状病毒疫情，成为第一个这样做的欧洲国家，此前当局证实，在过去两周里，每天新增冠状病毒病例不到7例。\n斯洛文尼亚政府在一份声明中表示，现在从其他欧盟国家抵达斯洛文尼亚的人将不再像4月初那样被隔离至少七天。\n这个与意大利、奥地利、匈牙利和克罗地亚接壤的200万人口的国家，到目前为止已经报告了1464例冠状病毒病例，103人死亡。它于3月12日宣布疫情。\n“斯洛文尼亚在过去两个月驯服了疫情…。今天斯洛文尼亚的流行病学状况是欧洲最好的，“总理Janez Jansa在周四早些时候告诉议会。\n疫情的结束意味着一些措施，包括对受到冠状病毒袭击的公民和公司的财政援助，将于5月底到期。\n政府表示，出现冠状病毒感染迹象的外国公民仍将不被允许进入该国。\n对来自非欧盟国家的人将继续实施至少14天的隔离，但包括外交官和货物运输人员在内的一些豁免除外。\n政府表示，公民仍将不得不遵守基本规则，以防止可能的感染蔓延，但没有详细说明。\n人们被要求在室内公共场所戴口罩，站在至少1.5米(5英尺)远的地方，并在进入公共场所时消毒双手。\n自3月中旬以来，斯洛文尼亚关闭了除食品和药店外的所有学校、体育和文化机构、酒吧、餐馆、酒店和商店，同时取消了公共交通。\n政府已经从4月20日开始放松封锁。本周早些时候，公共交通恢复运行，而下周，一些学生将返回学校。下周，所有酒吧和餐厅以及最多30个房间的小酒店都将获准开业。\nEurActiv Network为您提供该国如何应对冠状病毒健康危机的最新消息。", "note_en": "The Slovenian government late on Thursday (14 May) called an official end to its coronavirus epidemic, becoming the first European country to do so, after authorities confirmed less than seven new coronavirus cases each day for the past two weeks.\n People now arriving in Slovenia from other European Union states will no longer be obliged to go into a quarantine for at least seven days as was the case from early April, the government said in a statement.\n The country of 2 million people, which borders Italy, Austria, Hungary and Croatia, has so far reported 1,464 coronavirus cases and 103 deaths. It declared an epidemic on March 12.\n “Slovenia has tamed the epidemic over the past two months… Today Slovenia has the best epidemiologic picture in Europe,” Prime Minister Janez Jansa told parliament earlier on Thursday.\n The end of epidemic means some measures, including financial aid to citizens and firms hit by the coronavirus, will expire at the end of May.\n The government said foreign citizens who show signs of coronavirus infection will still not be allowed to enter the country.\n A quarantine of at least 14 days will remain in place for people from non-EU states, except for some exemptions including diplomats and people transporting cargo.\n Citizens will still have to follow basic rules to prevent a possible spread of infection, the government said without elaborating.\n People have been required to wear masks in indoor public spaces, stand at least 1.5 metres (5 feet) apart and disinfect hands upon entering public spaces.\n Since the middle of March, Slovenia has closed all schools, sports and cultural institutions, bars, restaurants, hotels and shops apart from food and drug stores, while cancelling public transport.\n The government has started easing the lockdown from April 20. Public transport resumed earlier this week while next week some pupils will return to schools. All bars and restaurants as well as small hotels with up to 30 rooms will be allowed to open next week.\n The EURACTIV Network provides you with the latest news on how the country is dealing with the coronavirus health crisis.", "posttime": "2020-05-16 17:38:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,coronavirus,calls", "title": "斯洛文尼亚呼吁正式结束其冠状病毒疫情", "title_en": "Slovenia calls an official end to its coronavirus epidemic", "transed": 1, "url": "https://www.euractiv.com/section/coronavirus/news/slovenia-calls-an-official-end-to-its-coronavirus-epidemic/", "via": "", "real_tags": ["病毒", "冠状病毒", "calls"]}, {"category": "", "categoryclass": "", "imagename": "e14fb239735e40792fb93254aa1f083b.jpeg", "infoid": 1002375, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊正在分发品牌商品，以感谢冠状病毒大流行期间的仓库工人，尽管它逐步取消了旨在提供帮助的政策。\n亚马逊的两名员工告诉“商业内幕”(Business Insider)，该公司已经向仓库员工(或履行助理)分发了感谢T恤。\n印第安纳州的一位员工分享了一张他们收到的衬衫的照片，正面写着感谢您，背面写着：一起，我们会送货的。\n工人们说，这些t恤是上周分发的，当时他们被放在一个房间里，工人们不得不进去挑选他们想要的尺寸。\n这一令牌出台之际，亚马逊宣布将削减3月中旬为员工带来的每小时2美元的加薪，这是大流行期间员工的危险补偿。\nBI采访的员工对这种取舍并不是特别满意。一个人说，到目前为止，各州正在开放我们的仓库，到目前为止，我们的仓库里有超过21个箱子，印第安纳波利斯仓库至少有一人死亡，这是一记耳光。\n德克萨斯州的另一名员工说，他们的仓库也分发了类似的t恤-尽管他们没有收到一件，因为他们不在仓库地板上工作。\n我所能说的是，他们似乎是在试图改变新闻中反映的叙述，因为这对公司看起来是负面的。虽然我讨厌听起来对任何事情都忘恩负义，但在衬衫上印上一个大大的谢谢就是一个明确的信号，表明他们想要左右我们的想法。他们说，这就是感觉没有诚意。\n4月底，亚马逊还结束了无限制无薪休假(UPT)的提供，这是一项首次引入的政策，目的是帮助仓库员工应对疫情期间的工作压力。正常情况下，工人每季度允许无薪休假20小时。\n亚马逊不得不迅速采取行动，以跟上滞留在家中的客户造成的需求突然飙升，同时也出台了保护一线员工的政策。\n该公司大举招聘17.5万名员工，带来了更多的清洁和社交距离-尽管多名员工告诉“商业内幕”(Business Insider)，实际上在仓库内不可能保持社交距离，而且清洁用品经常丢失。\n现在，这家零售巨头似乎在其供应链上掌握了更稳定的手，它正在取消其冠状病毒员工政策，如加薪和无限制UPT。接受Business Insider采访的工人们表示，现在逆转政策还为时过早，因为冠状病毒的风险远未结束。\n一名工人告诉“商业内幕”，这一决定特别令人恼火，因为他们在马里兰州的设施里的病例有所上升。\n他们说，亚马逊是一个经济巨头，拥有世界上最富有的首席执行官掌舵，这样的巨头肯定能付得起员工额外两美元的工资。\n彭博亿万富翁指数显示，自2020年初以来，首席执行官杰夫·贝佐斯的净资产增加了290亿美元。\n目前，全美至少有7名亚马逊仓库员工被证实感染冠状病毒死亡。\n突然出现了许多工人抗议活动，该公司似乎已经打击了内部通信。\n该公司还解雇了一些参与公开抗议的员工，其中包括仓库工人克里斯蒂安·斯莫尔斯(Christian Smalls)。在一份泄露的备忘录显示，亚马逊高管出席了一次会议，会上首席执行官杰夫·贝佐斯(Jeff Bezos)讨论了如何最好地处理他被解雇的媒体影响，他的案件成为了一项事业。\n亚马逊坚称，它没有因为工人持不同意见而解雇任何人，斯莫尔斯和其他人因为违反公司政策而被解雇。", "note_en": "Amazon is handing out branded merchandise to say thanks to warehouse workers during the coronavirus pandemic, even as it phases out policies intended to help.\n Two Amazon employees told Business Insider the company has distributed &#34;thank-you&#34; t-shirts to its warehouse workers (or &#34;fulfillment associates&#34;).\n One worker based in Indiana shared a picture of the shirt they received, the front reads &#34;Thanks to you&#34; and on the back: &#34;Together, we&#39;ll deliver.&#34;\n  The workers said the t-shirts were distributed last week, when they were placed in a room and workers had to go in to pick the size they wanted.\n   The token comes as Amazon announced it would be  cutting the $2 per hour wage hike it brought in for staff in mid-March as hazard pay for coming in during the pandemic.\n The workers BI spoke to aren&#39;t particularly happy about the trade-off. &#34;With states opening up and over 21 cases at our warehouse so far and at least one death at the Indianapolis warehouse, it&#39;s a slap in the face,&#34; one said.\n Another employee based in Texas said similar t-shirts had been given out at their warehouse — although they did not receive one because they do not work on the warehouse floor.\n &#34;All I can say was that it felt like they are trying to change the narrative that is reflected in the news, as it looks negatively upon the company. While I hate to sound ungrateful for anything, putting a big &#39;Thank you&#39; on the shirt was a clear indication they wanted to sway our thoughts. It just didn&#39;t feel sincere,&#34; they said.\n   At the end of April  Amazon also ended the offer of unlimited unpaid time off (UPT), a policy first brought in to help warehouse employees handle the pressures of working during the pandemic. Normally, workers are permitted 20 hours of unpaid time off per quarter.\n  Amazon has had to move quickly to keep up with a sudden spike in demand caused by customers stuck at home, while also introducing policies to protect its frontline workers.\n It went on  a huge 175,000 worker hiring spree and brought in increased cleaning and social-distancing — although multiple workers have told Business Insider in practice it&#39;s impossible to socially distance inside the warehouse and cleaning supplies are often missing.\n Now the retail giant seems to have  got a more steady hand on its supply chain, and it is removing its coronavirus worker policies like increased pay and unlimited UPT to match. Workers Business Insider spoke to said it was  too soon to reverse the policies, as the risk of coronavirus is far from over.\n   One worker told Business Insider the decision was particularly galling given there has been an uptick of cases in their facility in Maryland.\n &#34;Amazon is an economic juggernaut with the world&#39;s wealthiest CEO at the helm, surely such a titan can afford to pay his employees a mere two dollars extra,&#34; they said.\n Since the beginning of 2020, CEO Jeff  Bezos&#39; net worth has increased by $29 billion, according to the  Bloomberg Billionaires Index.\n At least seven Amazon warehouse workers are  now confirmed to have died with coronavirus across the US.\n   Numerous  worker protests have cropped up, and the company appears to have  cracked down on internal communications.\n  The company has also terminated some employees involved in public protest, including warehouse worker Christian Smalls whose case became a cause celèbre after  a leaked memo showed a meeting of Amazon executives at which CEO Jeff Bezos was present discussed how best to handle the media fallout from his firing.\n Amazon asserts it has not fired anyone for worker dissent, and that Smalls and others were terminated for violating company policies.", "posttime": "2020-05-16 17:01:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,handing,员工", "title": "亚马逊正在向仓库工人发放“谢谢你”的T恤，因为它正在削减工资。", "title_en": "Amazon is handing out 'Thank you' t-shirts to warehouse workers as it cuts pay", "transed": 1, "url": "https://www.businessinsider.com/amazon-warehouse-workers-thank-you-t-shirts-as-it-cuts-their-hazard-pay-2020-5", "via": "", "real_tags": ["amazon", "亚马逊", "handing", "员工"]}, {"category": "", "categoryclass": "", "imagename": "637ed34f746c7332f3ff137011d92390.jpg", "infoid": 1002373, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "刚刚过去的这个周末，我驱车前往贝斯佩奇州立公园，这是罗伯特·摩西在大萧条期间在长岛建造的公共高尔夫圣地。这个公园有五个球场，最近重新开放了新的安全规定：没有手推车，没有会所设施，提前通过电话处理付款。在与我合作的三名球员中，有一名当地退休人员，他刚从佛罗里达回来，正好赶上禁赛。当我们在红色赛道周围进行社交距离时，我问他是如何打发时间的。他说他在看电视，在股市交易。这听起来很危险，我大胆地说，但我的玩伴对我的担忧不屑一顾。他说，他对市场有信心，而且无论如何，他都留出了一笔固定的金额，以限制自己的风险敞口。\n股市从本周开始连跌三天，美联储主席杰罗姆·鲍威尔周三表示，越来越多的人感觉到“复苏可能比我们希望的来得更慢.”周二，前对冲基金经理斯坦利·德鲁肯米勒(Stanley Druckenmiler)在纽约经济俱乐部(Economic Club Of New York)的Zoom演讲中说，“股票的风险回报”--也就是股票--“可能是我职业生涯中见过的最糟糕的情况。”然而，许多小投资者，比如我的高尔夫同伴，似乎并没有被这样的警告所困扰。自从道指在2月和3月暴跌逾万点以来，个人交易员一直在以创纪录的速度买卖股票。周四，贴现经纪公司E-Trade报告称，其4月份的日交易量是2019年4月的三倍多。其他贴现经纪商也报告了类似的数据。TD ameritrade表示，4月份每天进行300多万笔交易，而去年同期为81万7001笔。\n这场交易狂潮是在价格战的背景下发生的，这场价格战促使E-Trade、TD ameritrade和Charles Schwab等公司取消了股票买卖、交易所交易基金(ETF)和指数期权的佣金。自从政府关门开始以来，许多投资者利用这个自由交易时代的机会，这个时代始于去年秋天，早在冠状病毒大流行来袭之前就开始了，他们似乎认为这是一个很好的赚钱机会。CNBC的玛吉·菲茨杰拉德(Maggie Fitzgerald)本周早些时候报道，仅在3月份，TD ameritrade就增加了超过40万个账户。嘉信理财(Charles Schwab)增加了近30万个账户。\n理性地说，取消佣金应该不会产生实质性的影响。如果你在苹果或特斯拉投资5000美元，你节省的5美元或10美元的费用对最终结果不会有太大影响。“你要做多少交易才能有所作为？”芝加哥大学(University Of Chicago)经济学家理查德·泰勒(Richard Thaler)周四对我说，当我打电话问他关于在线交易激增的情况时，他曾因其对行为经济学的贡献而获得2017年诺贝尔经济学奖。另一方面，泰勒补充说，“免费总是吸引人的。每个人都喜欢免费午餐，尽管我的同事们认为他们并不存在。“。在友好地抨击了米尔顿·弗里德曼(Milton Friedman)在芝加哥的门徒后，泰勒说，没有人真正知道是什么推动了所有的股票交易。“这可能是因为很多人手头有很多时间，”他说。“一位朋友向我建议，这将取代赌博。赌场都关门了，没有体育项目可以下注。“。\n对于一些活跃的交易者来说，这一理论似乎确实适用。“我喜欢在体育上下注，”Barstool Sports的创始人戴夫·波特诺伊(Dave Portnoy)告诉“商业内幕”(Business Insider)。“运动结束了，这是我白天可以做的事情。”在关闭开始后，波特诺伊将300万美元存入一个E-Trade账户中，“以供玩耍”。他一直忙于与他的大量推特追随者分享他的功绩。(周五早上，他报告说，“我赚了5万美元。”)。当然，大多数投资者没有波特诺伊那样的资源，今年早些时候，一家大型博彩公司收购了他网站的多数股权，波特诺伊赚了一大笔钱。而且许多小投资者不是日内交易。他们只是将资金转移到交易所交易基金(ETF)或蓝筹股，其中一些仍然遭受重创，而苹果(Apple)和Alphabet等其他公司已经弥补了大部分损失。\n耶鲁大学(Yale)经济学家罗伯特·希勒(Robert Shiller)因其对推动股价的因素的研究而分享了2013年诺贝尔经济学奖。他向我表示，投资者正在对一种广为流传的说法做出反应，即股价在大幅下跌后往往会大幅反弹，你必须早点入场，才能获得最大的收益。他说：“我经常听到‘V形’这个词。”席勒2000年出版的“非理性繁荣”(Irrational Exuberance)一书就在互联网泡沫破裂之前出版，还有“叙事经济学：如何讲述故事”(Narrative Economics：How Stori\n在目前的背景下，这似乎是一个可怕的故事。席勒告诉我，他也一直在想着大萧条。他提醒我，在1930年初，股市反弹了一段时间，就像现在一样，结果只是翻滚，进入了另一场无情的下跌。“但没有人记得这一点，”席勒说。“最近的过去更能引起共鸣。”当然，有些人确实研究历史事件。周二，华尔街公司古根海姆合伙公司(Guggenheim Partners)的首席全球投资官斯科特·米纳德(Scott Minerd)在Twitter上写道，“股市显然超过了最近的上涨趋势。现在我们来看看这是不是又是1930年的事了。“。\n本周末，股市结束了连续三天的跌势。道琼斯工业股票平均价格指数周四跃升近400点，周五又上涨了60点。直到我们看到未来几个月的经济情况，我们才能确切知道小投资者表现出的乐观和大胆行为是合理的还是疯狂的。快速复苏可能会带来企业获利的大幅反弹，这将对股市构成支撑。长期的经济低迷可能会在数年内导致收益大幅下降，这肯定会压垮股市。\n希勒说，他“给出了一些可能性”乐观的情况。但他也向投资者发出警告：在这一点上进入市场的风险比看起来要大得多，因为大流行的最终结果笼罩在如此多的不确定性之中。他说：“这就像是在说下一场战争是什么时候。”“要考虑的因素太多了.”至少就目前而言，许多小投资者似乎乐于忽略这些不确定性，增加他们的在线交易账户。他们坚持打高尔夫球会更安全。", "note_en": "This past weekend, I drove out to Bethpage State Park, the public golf mecca on Long Island that Robert Moses built during the Great Depression. The park, which has five courses, recently reopened with new safety rules: no carts, no clubhouse amenities, and payments processed in advance by phone. Among the three players I got teamed up with was a local retiree who had returned from Florida just in time for the lockdown. As we social-distanced our way around the Red course, I asked how he was filling his time. He said that he was watching television and trading in the stock market. That sounded dangerous, I ventured, but my playing partner dismissed my concerns. He had faith in the market, he said, and, in any case, he had set aside a fixed sum, to limit his exposure.\n  The stock market fell for three days in a row to start this week, and  Jerome Powell, the chairman of the Federal Reserve, said on Wednesday that there is a growing sense that “the recovery may come more slowly than we would like.” In a Zoom presentation to the Economic Club of New York, on Tuesday, Stanley Druckenmiller, a former hedge-fund manager who now invests his own money, said, “The risk-reward for equity”—that is, stocks—“is maybe as bad as I’ve seen it in my career.” And yet many small investors, like my golfing companion, do not seem fazed by warnings like these. Since the Dow plunged more than ten thousand points in February and March, individual traders have been buying and selling stocks at record rates. On Thursday, E-Trade, the discount brokerage,  reported that its daily trading volume in April was more than three times as large as it was in April, 2019. Other discount brokers have reported similar figures. TD Ameritrade  said that it did more than three million trades a day in April, compared with eight hundred and seventeen thousand a year earlier.\n This trading frenzy is taking place in the context of a price war that has prompted firms such as E-Trade, TD Ameritrade, and Charles Schwab to eliminate commissions for stock purchases and sales, exchange-traded funds, and index options. Since the shutdowns began, many investors have taken advantage of this era of free trades, which began last fall, well before  the coronavirus pandemic hit, to exploit what they seem to view as a good money-making opportunity. In March alone, TD Ameritrade added more than four hundred thousand accounts, CNBC’s Maggie Fitzgerald  reported earlier this week. Charles Schwab added nearly three hundred thousand accounts.\n  In rational terms, getting rid of commissions shouldn’t have had a substantial impact. If you invest five thousand dollars in Apple or Tesla, the five or ten dollars you saved in fees won’t have much effect on the ultimate outcome. “How much trading would you have to do for it to make a difference?” Richard Thaler, an economist at the University of Chicago—who was awarded the 2017 Nobel Memorial Prize in Economic Sciences, for his contribution to behavioral economics—said to me on Thursday, when I called and asked him about the surge in online trading. On the other hand, Thaler added, “Free is always appealing. Everybody likes a free lunch, even though my colleagues don’t think they exist.” Having taken a friendly jab at the Chicago disciples of Milton Friedman, Thaler said that nobody really knows what is driving all the stock trading. “It could be that it’s just a lot of people have a lot of time on their hands,” he said. “One friend suggested to me it is replacing gambling. The casinos are closed and there are no sports to bet on.”\n For some active traders, this theory does seem to apply. “I like betting on sports,” Dave Portnoy, the founder of Barstool Sports,  told Business Insider. “Sports ended, and this was something that was still going that I could do during the day.” After the shutdowns began, Portnoy put three million dollars in an E-Trade account “to play around with.” He’s been busy sharing his exploits with his large Twitter following. (On Friday morning, he  reported, “I’m up fifty grand.”) Of course, most investors don’t have the same resources as Portnoy, who made a fortune earlier this year when a big gambling company  took a majority stake in his Web site. And many small investors aren’t day-trading. They are simply moving money into exchange-traded funds or blue-chip stocks, some of which are still pretty beaten up, while others, such as Apple and Alphabet, have already made up most of their losses.\n  The Yale economist Robert Shiller, who shared the 2013 Nobel Prize in Economic Sciences, for his studies of what drives stock prices, suggested to me that investors are responding to a widely shared narrative that says stock prices tend to rebound sharply after a big fall, and that you have to get in early to make the biggest gains. “I hear the term ‘ “V”-shaped’ a lot,” he said. Shiller’s book “ Irrational Exuberance,” from 2000, came out just before the dot-com bubble burst, and “ Narrative Economics: How Stories Go Viral and Drive Major Economic Events,” from last year, explores what he describes as the power of “contagious popular stories that spread through word of mouth, the news media, and social media.” In standard economic theory, investors are supposed to carefully weigh things like the level of prices, interest rates, and expected profits before they invest. But Shiller told me that “a narrative is often more emotionally compelling and resonant than an argument about valuation or something else.”\n  After stocks dipped at the end of 2018, and again in the spring of last year, the market did rebound, and quickly reached new highs. This strengthened the “V”-shaped” narrative, Shiller said. So does the widespread belief that the Federal Reserve, through its massive asset purchases, has put a floor under the stock market. “The consensus seems to be, ‘Don’t worry, the Fed has your back,’ ” Druckenmiller said in his presentation. “There’s one problem with that: our analysis says it’s not true.”\n Stocks don’t always rebound in a “V” shape. During the last lengthy bear market, which accompanied the Great Recession, stocks prices started falling in September, 2007, and didn’t bottom out until February, 2009, seventeen months later. During the Great Depression, in the nineteen-thirties, the bear market lasted even longer. It began with the Wall Street crash of October, 1929, and lasted until the middle of 1932; by then, the market was down about eighty per cent from its pre-crash peak. Stocks didn’t hit new highs until the nineteen-fifties.\n In the current context, that seems like a scary narrative. Shiller told me that he had been thinking about the Great Depression, too. In early 1930, he reminded me, the stock market rallied for a while, much like it is doing now, only to roll over and go into another remorseless decline. “But nobody remembers that,” Shiller said. “The recent past is more resonant.” Some people do study historical episodes, of course. On Tuesday, Scott Minerd, the chief global investment officer at the Wall Street firm Guggenheim Partners,  wrote on Twitter, “Stocks have clearly topped the recent uptrend. Now we find out if this is 1930 all over again.”\n At the end of this week, stocks ended their three-day losing streak. The Dow Jones Industrial Average jumped nearly four hundred points on Thursday, and on Friday it rose another sixty points. Until we see what happens to the economy in the coming months, we won’t know for sure if the optimism and derring-do that small investors are exhibiting is justified or crazy. A rapid recovery could generate a big rebound in corporate profits, which would be supportive of the stock market. An extended economic slump could decimate earnings for years, which would surely crush stocks.\n Shiller said that he “gives some probability” to the optimistic scenario. But he also issued a warning to investors: being in the market at this point is much riskier than it appears, because the ultimate outcome of the pandemic is shrouded in so much uncertainty. “It’s like saying when the next war will be,” he said. “There are too many factors to consider.” For now, at least, many small investors seem happy to ignore these uncertainties and crank up their online trading accounts. They’d be safer sticking to golf.", "posttime": "2020-05-16 16:39:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股市,number,交易", "title": "创纪录的股市投资者是不是疯了？", "title_en": "Have the Record Number of Investors in the Stock Market Lost Their Minds?", "transed": 1, "url": "https://www.newyorker.com/news/our-columnists/have-the-record-number-of-investors-in-the-stock-market-lost-their-minds", "via": "", "real_tags": ["股市", "number", "交易"]}]