[{"category": "", "categoryclass": "", "imagename": "aa894409fa807c74d89e9d9ad6dea94c.jpg", "infoid": 1031674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个哈金托什不是哈辛托什。它实际上是一台运行MacOS作为虚拟化操作系统的Linux PC。而且速度很快。就像，真的很快。Manjaro KDE等离子：HTTPS：...", "note_en": "This hackintosh isn't a hacintosh... it's actually a Linux PC running macOS as a virtualized OS. And it's fast. Like, really fast. Manjaro KDE Plasma: https:...", "posttime": "2020-10-28 09:30:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟化,操作系统,linux,pc,等离子", "title": "将MacOS作为虚拟化操作系统运行的Linux PC比hackinstosh更快", "title_en": "A Linux PC running macOS as a virtualized OS is faster than a hackinstosh", "transed": 1, "url": "https://www.youtube.com/watch?v=-Otg7JFMuVw", "via": "", "real_tags": ["虚拟化", "操作系统", "linux", "pc", "等离子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "运营微服务/面向服务体系结构的组织面临各种与技术和人员相关的问题。在过去的几年里，公司一直在将大规模的单一应用程序迁移到较小的微服务(想想做一件事的服务，比如归档PDF)，甚至是面向服务的架构(例如，按域服务、支付、计费、身份验证)。\n毫无疑问，整体式架构带来了许多问题：容易将域和数据紧密耦合、部署过程较慢，以及长时间的测试运行，仅举几例。打破铁板一块似乎是解决这些问题的灵丹妙药。SOA可以提供对域及其系统的团队级别所有权，数据是分离的，功能/修复可以单独部署。不幸的是，SOA伴随着它自己的一组问题。\n巨石已经存在一段时间了。有很多关于驯服巨石的文章已经写过了。当我们开始构建Cortex时，我们一直在与工程师谈论他们处理微服务架构的经验。以下是我们在驯服你的微服务方面学到的一些东西。\n一块巨石，尽管有很多缺点，但很容易推论。没有网络呼叫。在代码库中的其他地方调用函数不会产生任何开销。如果您使用的是类型化语言，则可以在编译时捕获API更改。所有的代码都在一个地方--如果你这么喜欢，你可以很容易地窥探引擎盖下的情况。\nSOA带来了一系列技术挑战，包括操作复杂性和性能问题。您现在必须考虑：\nAPI版本控制-如果支付团队在没有通知我的情况下对其API进行了重大更改怎么办？\n网络问题-如果我没有收到付款已通过的确认，会发生什么情况？\n虽然认为文化和人员问题是架构选择带来的重大挑战听起来可能有些奇怪，但请记住，大多数组织转向SOA是为了扩展他们的团队，而不是为了扩展他们的软件。\n跨服务和团队分配域、数据和发布节奏的所有权可以提高工程组织的速度。\n不幸的是，分配所有权恰恰做到了这一点--团队在操作程序、文档实践等方面开始出现分歧。随着组织规模的扩大，这可能会严重影响工作效率，并最终将您的速度带回原点。\n增加工程师的成本变得很高-每个团队都维护着自己的流程。在不同团队之间跳槽的工程师可能要学到和新员工一样多的东西。\n运营分类需要更长的时间-随着组织的发展，部落知识会逐渐消失，这使得回答以下问题变得更加困难：现有哪些服务，这些服务做什么，以及谁拥有这些服务。\n团队之间的通信开销-过度共享信息很嘈杂，共享不足(例如，更改API时)在最坏的情况下可能会导致停机或功能问题，并直接影响底线。\n希望扩大您的团队规模吗？现在是开始思考这些挑战以及如何应对它们的时候了。\n没有解决这些问题的灵丹妙药。任何工具或流程的组合都不能保护您。然而，预防真的比治疗好。\n把它想象成一针流感疫苗--你知道它是流感季节，得流感很糟糕，即使你可能仍然得了流感，你也永远不会后悔为成功做好准备。\n要推广的一个很好的习惯是在进入实现之前考虑API和数据模型。\n防止这种情况的一种方法是遵循亚马逊的模式-API是团队通信的唯一方式。这意味着服务所有者应该：\n当与工具(如OpenAPI或GRPC)结合使用时，此工作流可提供额外的好处。如果提前设计了模式和API，您可以使用：\n在更改发布之前，使用您的代码评审过程循环引入合适的涉众。\nAtlassian是成功使用规范优先API设计来改进其开发生命周期的一个示例。我发现https://www.atlassian.com/blog/technology/spec-first-api-development是使用OpenAPI作为支持规范优先开发的工具的一个很好的概述。\n当多个团队开始跨域依赖相同的数据模型时，这是一个整体的转折点。这减慢了整个组织的开发节奏，由此产生的意大利面数据模型使得对代码库进行推理变得更加困难。\n在SOA中也很容易沿着相同的路线走下去。有一些习惯可以帮助防止这种噩梦：\n减少服务之间在数据级别的依赖性-例如，将引用ID存储到不同服务中的资源，并通过其API获取数据\n确保利益相关者(业务、开发人员、服务消费者)不会直接在您的数据上构建工具。这会锁定您的数据模型，并阻止您作为服务所有者进行迭代。取而代之的是，通过API或分析数据流公开数据(具有其自己的约定)。\n对于每个团队都以自己的方式做事，有一个显而易见的解决方案--让团队以标准化的方式轻松做事。\n例如，Atlassian已经建立了一个内部PaaS，本质上是对AWS的薄薄包装。通过这样做，开发人员可以获得他们想要的资源，但是平台会自动增加标准监控、日志记录等功能。\n设计良好的工具提供了一种标准的工作方式，加快了开发人员的速度，并确保团队以一致的方式工作。\n这甚至延伸到了文档。Spotify和Atlassian已经构建了内部工具，可以标准化围绕其微服务的信息发现。Spotify的System-Z和Atlassian的显微镜提供了有关每项服务的详细信息的真实来源，例如系统所有权、文档/Runbook的链接以及最近的部署。使它们变得更加强大的是，它们是进入有关服务待命轮换、监控仪表板链接、日志记录等进一步信息的入口点。\n这种信息标准化提高了工程上马时间和运营效率-所有服务都以相同的方式运行，开发人员有一个单一的来源来查找有关其服务的关键信息。\n在问题失控之后，许多组织最终为人类构建了内部服务注册表-太多的服务、不断增长的团队和人员流动、远程开发人员等等。\nCorpe提供了一种标准的、自以为是的方式来组织有关所有服务的信息，并支持以下功能：\n用于回答诸如存在哪些服务？谁拥有此服务？此服务的Runbook在哪里？&#34；，&#34；等问题的仪表盘。\n向您显示服务健康状况的审计报告：是否每个服务都有所有者、OnCall轮换等。\n与第三方工具集成-例如，当PagerDuty触发警报时，Cortex可以发送一条松弛消息，其中包含有关服务的信息，如所有权、来自GitHub的最新提交、最新部署等。\n在我们的主页上联系我们请求演示，我们很乐意向您展示我们已经构建了什么，并帮助您避免一些令人头疼的面向服务的体系结构带来的问题。即刻登上现代微服务目录！", "note_en": "Organizations that operate microservices/service-oriented architecture face a variety of technical and people related problems. Over the past few years, companies have been migrating massive monolithic applications into smaller microservices (think services that do one thing, like  archive a pdf) or even service oriented architectures (e.g. service-per-domain,  payments, billing, auth).\n There are undoubtedly many issues that come from monolithic architectures: easy to tightly couple domains and data, slower deployment process, and long test runs to name a few. Breaking the monolith can seem like a panacea for these issues. An SOA can provide team level ownership of domains and their systems, data is decoupled, and features/fixes can be deployed separately. Unfortunately, a SOA comes with its own set of issues.\n Monoliths have been around for a while. There&#39;s a lot that&#39;s been written about &#34;taming the monolith&#34;. As we get to work building Cortex, we&#39;ve been talking to engineers about their experiences dealing with microservice architectures. Here&#39;s some things we&#39;ve learned about taming your microservices.\n  A monolith, for all its warts, is simple to reason about. There are no network calls. There&#39;s no overhead to calling a function elsewhere in the codebase. If you&#39;re using a typed language, you can catch API changes at compile time. All the code is in one place – if you&#39;re so inclined, you can easily peek under the hood.\n An SOA brings with it a suite of technical challenges, including operational complexity and performance hits. You now have to think about:\n API versioning - what if the payments team makes a breaking change to its API without notifying me?\n Network issues - what happens if I don&#39;t receive confirmation that the payment went through?\n   While it may sound strange to think that cultural and people problems are a significant challenge stemming from architectural choices, keep in mind that most organizations move to an SOA to scale their team, not their software.\n Distributing ownership of domains, data, and release cadence across services and teams can increase the velocity of your engineering org.\n Unfortunately, distributing ownership does just that - teams start diverging in their operational procedures, documentation practices, and more. As an organization scales, this can wreak havoc on productivity, and ultimately bring your velocity back to square one.\n  Ramping up engineers becomes costly - each team maintains their own processes. An engineer moving between teams may have to learn as much as a brand new hire.\n Operational triage takes longer - tribal knowledge dissipates as an organization grows, making it harder to answer questions such as: what services exist, what they do, and who owns them\n Communication overhead between teams - oversharing information is noisy, undersharing (e.g. when making API changes) can, in the worst case, cause outages or functionality issues and directly impact the bottom line\n Looking to scale your team? It&#39;s time to start thinking these challenges and how you can counter them.\n  There&#39;s no silver bullet to solve these problems. No combination of tools or processes can protect you. However, prevention really is better than the cure.\n Think of it like a flu shot - you know its flu season, getting the flu sucks, and even though you may still get the flu, you&#39;ll never regret setting yourself up for success.\n  An excellent habit to promote is thinking about APIs and data models before jumping into the implementation.\n     One way to prevent this is following the Amazon model - APIs are the only way teams communicate. This means that a service owner should:\n  This workflow provides additional benefits when used in conjunction with tooling, such as OpenAPI or gRPC. If schemas and APIs are designed ahead of time, you can use:\n Use your code review process to loop in the right stakeholders  before a change is released\n  Atlassian is an example of successfully using spec-first API design to improve their development lifecycle. I found   https://www.atlassian.com/blog/technology/spec-first-api-development to be an excellent overview of using OpenAPI as the tooling to enable spec-first development.\n  The breaking point for a monolith is when multiple teams start depending on the same data models across domains. This slows down the development cadence across the org and the resulting spaghetti data models make it exponentially more difficult to reason about the code base.\n It&#39;s easy to go down the same route in an SOA as well. There are some habits that help prevent this nightmare:\n Reducing dependencies at the data level between services - for example, store reference IDs to resources in a different service, and fetch data through their API\n Ensuring stakeholders (business, developers, service consumers) don&#39;t build tooling directly on your data. This locks in your data model and prevents you from iterating as a service owner. Instead, expose data (with its own contract) through APIs or analytical data streams.\n  There&#39;s one obvious solution to &#34;each team doing things their own way&#34; - make it easy for teams to do things in a standardized way.\n Atlassian, for example, has built out an internal PaaS that is essentially a thin wrapper around AWS. By doing so, developers are provisioned their desired resources but the platform automatically augments it with standard monitoring, logging, and more.\n Well designed tooling that provides a standard way of doing things speeds up developer velocity and makes sure teams are working in consistent ways.\n This even extends to documentation. Spotify and Atlassian have built internal tooling that standardizes information discovery around their microservices. System-Z at Spotify and   Microscope at Atlassian provide a source of truth for details about each service, such as system ownership, links to documentation/runbooks, and recent deploys. What makes them even more powerful is that they are the entrypoint into further information about services – on-call rotations, links to monitoring dashboards, logging, etc.\n  This kind of standardization of information improves engineering ramp up time and operational efficiency - all services are operated in the same way and developers have a single source to look for critical information about their services.\n  Many organizations end up building an internal service registry for humans after the problem has gotten out of hand – too many services, growing teams and turnover, remote developers, etc.\n Cortex provides a standard, opinionated way to organize information about all of your services and enables functionality such as:\n A dashboard to answer questions such as &#34;what services exist?&#34;, &#34;who owns this service?&#34;, &#34;where are the runbooks for this service?&#34;\n An audit report that shows you the health of your services: does every service have an owner, an oncall rotation, etc.\n  Integrations with third party tools - for example, when Pagerduty triggers an alert, Cortex can send a slack message with information about the service such as ownership, latest commits from github, latest deploys, and more.\n Reach out to us on our home page to request a demo, we&#39;d love to show you what we&#39;ve built and help prevent some of the headaches that come with a service oriented architecture. Onboard to a modern microservice catalog today!", "posttime": "2020-10-28 09:29:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,microservice", "title": "现代微服务目录", "title_en": "Modern Microservice Catalog", "transed": 1, "url": "https://www.getcortexapp.com/post/taming-your-microservices", "via": "", "real_tags": ["服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031672, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网站上的信息说，“这个网站被查封了”，并给出了各种代码，以决定是否应该与公众分享有关冠状病毒的有价值的信息。\n版权所有2020 Nexstar Inc.。版权所有。这些材料不得出版、广播、重写或重新分发。", "note_en": "The message on the website stated that “this site was seized” and gave various codes to vote on if valuable information regarding coronavirus should be shared with the public.\n  Copyright 2020 Nexstar Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "posttime": "2020-10-28 09:15:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,总统,trumps,不得", "title": "特朗普总统竞选网站遭到黑客攻击", "title_en": "President Trumps campaign website hacked", "transed": 1, "url": "https://www.ksnt.com/news/national/president-trumps-campaign-website-hacked/", "via": "", "real_tags": ["黑客", "总统", "trumps", "不得"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请通过[电子邮件受保护]联系服务器管理员，告知他们此错误发生的时间，以及您在此错误之前执行的操作。\n此外，尝试使用ErrorDocument处理请求时遇到500内部服务器错误。", "note_en": "Please contact the server administrator at  [email protected] to inform them of the time this error occurred, and the actions you performed just before this error.\n  Additionally, a 500 Internal Server Errorerror was encountered while trying to use an ErrorDocument to handle the request.", "posttime": "2020-10-28 08:59:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面临,faces,错误", "title": "只有球迷面临欺诈和盗窃的指控", "title_en": "OnlyFans Faces Allegations of Fraud, Theft", "transed": 1, "url": "https://forensicnews.net/2020/08/13/onlyfans-faces-allegations-of-fraud-theft/", "via": "", "real_tags": ["面临", "faces", "错误"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FreeBSD发布工程团队很高兴地宣布FreeBSD12.2-Release发布。这是STRATE/12分支的第三个版本。\n已引入无线网络堆栈和各种驱动程序的更新，以提供更好的802.11n和802.11ac支持。\nClang、llvm、lld、lldb、编译器-RT实用程序和libc++已更新到版本10.0.1。\n有关新功能和已知问题的完整列表，请参阅在线发行说明和勘误表列表，网址为：\nFreeBSD12.2-Release现在可用于AMD64、i386、PowerPC、powerpc64、SPARC64、ARMv6和aarch64架构。\nFreeBSD12.2-Release可以从可引导的ISO映像安装，也可以通过网络安装。某些架构还支持从USB记忆棒安装。所需文件可以下载，如下节所述。\n此消息底部包含版本ISO、记忆棒和SD卡映像的SHA512和SHA256散列。\n其中包含安装基本FreeBSD操作系统所需的一切、文档、调试分发集和一小部分旨在启动和运行图形工作站的预构建软件包。它还支持引导进入基于Livefs&34；的救援模式。如果您可以刻录和使用DVD大小的介质，这应该就是您需要的全部内容。\n此外，还可以将其写入AMD64体系结构的USB记忆棒(闪存驱动器)，并用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。\n作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，则应该可以执行以下操作：\n它包含基本的FreeBSD操作系统。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。\n此外，还可以将其写入AMD64体系结构的USB记忆棒(闪存驱动器)，并用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。\n作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，则应该可以执行以下操作：\n它支持使用CDROM驱动器引导计算机，但不包含用于从CD本身安装FreeBSD的安装分发集。从CD引导后，您需要执行基于网络的安装(例如，从HTTP或FTP服务器)。\n此外，还可以将其写入AMD64体系结构的USB记忆棒(闪存驱动器)，并用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。\n作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，则应该可以执行以下操作：\n可以将其写入USB记忆棒(闪存驱动器)，并用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。\n作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，则应该可以执行以下操作：\n这可以写入USB记忆棒(闪存驱动器)并用于启动机器，但不包含介质本身上的安装分发集，这与仅引导映像类似。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。\n作为如何使用迷你内存条图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，则应该可以执行以下操作：\n这些可以写入SD卡，并用于引导受支持的ARM系统。SD卡映像包含完整的FreeBSD安装，并且可以安装到最小为512MB的SD卡上。\n为了方便那些无法通过控制台访问系统的用户，默认情况下可以使用密码为FreeBSD的FreeBSD用户访问ssh(1)。此外，root用户密码设置为root，强烈建议您在获得系统访问权限后更改这两个用户的密码。\n要将FreeBSD/ARM映像写入SD卡，请使用dd(1)实用程序，将kernel替换为系统的适当内核配置名称。\nFreeBSD12.2-Release也可以通过CD-ROM或DVD从多家供应商购买。将提供基于FreeBSD12.2的产品的供应商之一是：\n预安装的虚拟机映像还可用于QCOW2、VHD和VMDK磁盘映像格式的AMD64(X86_64)、i386(X86_32)和AArch64(Arm64)体系结构，以及原始(未格式化)映像。\nAF-南-1区域：AMI-0183ba5b381eb0baa欧盟-北-1区域：AMI-0821c256650690884 ap-South-1区域：AMI-009471f6e29b012ef欧盟-西部-3区域：AMI-0bfaf7527f637d64b欧盟-西部-2区域：AMI-023d320201b8d06c5 EU-South-1区域：AMI-08828d09ef0598bc8欧盟-西部-1区域：AMI-02b1b6b3c3face0ap-东北2区域：ami-03f4a1a1a8d0636a5 me-South-1区域：ami-023e55e02880fap-1区域：ami-02a2b1b6bc3face0ap-2区域：ami-03f4a1a1a8d0636a5 me-South-1AP-EAST-1区域：AMI-0f4732ac090ec2a7d AP-东南。区域：AMI-045943797617e690c AP-东南区域：AMI-0cbc4c8a75ded8b2d EU-Central区域：AMI-0d94faf9636228402 us-East-1区域：AMI-00be86d9bba30a7b3 us-East-2区域：AMI-075db5a7ecd8b1456 us-west区域：AMI-0e54f016b55b7f6ce-west-2区域：AMI-0c273f14b9d9d57d2。\n一旦完成第三方验证，AMI还有望在亚马逊市场上提供，网址为：https://aws.amazon.com/marketplace/pp/B07L6QV354/。\nAF-南-1区域：AMI-0afe034012109b43b欧盟-北-1区域：AMI-04d3c12757f20e9 ap-South-1区域：AMI-07c0b1ad6978b7814欧盟-西部-3区域：AMI-0bfc36baff5afe2a1欧盟-西部-2区域：AMI-0276cf2663706fbb5 EU-South-1区域：AMI-0fa854a53ca82be87 EU-West-1区域：AMI-0a22dfb10a633dap-东北2区域：ami-0fb44fe96791afme-1区域：ami-000276cf266db78acc9e ap-1东北区域：ami-0a22dfb10a633d26-东北区域：ami-0fb44fe96791afme-1区域：ami-0006cf26db78acc9e-1区域：ami-0a22dfb10a633d26-东北区域：ami-0fb44fe96791afme-1区域：ami-0005dcd78acc9e ap-1东北区域：ami-0a22dfb10a633d26-东北2区域：ami-0fb44fe96791afme-1AP-EAST-1区域：AMI-00f184a5ec9b137ca AP-东南。区域：AMI-063ab54f54180837c AP-东南区域：AMI-0903d6af1e37a6ff EU-Central区域：AMI-02fcc489e80482d5f美国东部区域：AMI-00eea2f51ee575a19美国东部区域：AMI-00d07c574a09a4941美国西部区域：AMI-03ad9a0a981f26542美国西部区域：AMI-0fd803a9d8be7d6d。\n%gCloud计算实例创建实例\\--image FreeBSD-12-2-Release-AMD64\\--image-project=Freebsd-org-cloud-dev%gcloud计算ssh实例。\nFreeBSD12.2-一旦GoogleComputeEngine完成第三方特定验证，https://console.cloud.google.com/launcher/browse?filter=category:os&amp；filter=price:free上的™Marketplace也将提供FreeBSD12.2-Release。\n基于新的FreeBSD支持模式，FreeBSD12版本系列将至少支持到2024年6月30日。此点版本FreeBSD12.2-Release将在FreeBSD12.3-Release之后至少三个月才受支持。有关其他支持信息，请访问：\n请注意，从目前计划于2021年1月31日发布的12.2开始，在三个月前将支持12.1。\n许多公司捐赠设备、网络接入或人力来支持FreeBSD12.2的发布工程活动，包括：\nSHA512(FreeBSD-12.2-Release-amd64-bootonly.iso)=de1a805cd7f2c740d0f42aa6d2f7439fd9470ee4a471dc2b8eb85314776e9fe5423d0576f099adda600c990885ffbb098bedcb4c13c132125f670919e499ea40 SHA512(FreeBSD-12.2-Release-amd64-bootonly.iso.xz)=1ea2389e2c7dc4bdc889925cbffb49e066ed087678cff46197f17d15bbedb35a1021e88a858b040c8d7b041ab7f7b18b4ff8c38e97866bd2b97d5b9ad506d687 SHA512(FreeBSD-12.2-Release-amd64-dis1.iso)=bbf67945d244c76f1ef26029b2e1c2d30d30881b178881b92b657a3da66f54ff40c57e69f4bebeefe6071da8311f477e8d371a1b9a8d7f000dd32383b9cd7ca7 SHA512(FreeBSD-12.2-Release-amd64-dis1.iso.xz)=ba2990269cc73623b490c18541d04d4fc9f1d9d1639688d33c8108e09cae78daa6be774d6f40c86774070ab0b42815249a6754ab4135843f197b94bdc8d34268 SHA512(FreeBSD-12.2-Release-amd64-dvd1.iso)=80e8c6804e0a965bc1be596b0c8d6dbdbbf9eef42bb4170761ec4094cc07b294fd4f17cd55d28aa7679b5d01c121fa15e6c24852f9307959af759254ebfceba1 SHA512(FreeBSD-12.2-Release-AMD64-dvd1.isoxz)=ab75d9cae6a4df12ecd9439a108601f8b7729684e711ea48b6784cac8072237e2a41500c1f3060b7680980a1c32545fb89444a936e9096aa6841c87d4bb236eb SHA512(FreeBSD-12.2-Release-AMD64-dvd1.isoxz)。2-Release-amd64-memtick.img)=483b961fda9d48a6a59e128f32ece9054e49cd25c7a33987524f1535e0732d2f362829c25801e16336b5ea9ee35681ef1ae04cd027275d73c6bbf9fca5f35ca0 SHA512(FreeBSD-12.2-Release-amd64-memtick.img.xz)=75219bd14c52efb9b670884d8dd67499a781f2e6242d84660525535c6eb334d11b50a3d5fb110e755aa1e9791cf5deb5c045eaefec036bd4b67cc4c15532a367 SHA512(FreeBSD-12.2-RELEASE-amd64-mini-memstick.img)=392d5bb81387b2639f59ac469d60e18d198f6e28d50c678f1154f86dbc583c16ec5461853ff66180b9405997ba8647efb740241794de18242a594241477a841c SHA512(FreeBSD-12.2-RELEASE-amd64-mini-memstick.img.xz)=6f5c1e8e15597c86ab56e6ac457975d361ea8dec375abe77cfd9604ee54055a2100e6f5d46da7acf702042025c62c4e680a1279c2e84b7b3b424bf6081e7f4bb SHA256(FreeBSD-12.2-Release-amd64-bootonly.iso)=f18412a1936d6f7df1e8e8857c98aeb53f752d43c732affee9c7a5615d4331b5 SHA256(FreeBSD-12.2-Release-amd64-bootly.iso.xz)=0eafcd6f17b8f87234f161d727b0f52b85f3f4415e9b36d3c93afb57f5da47d0 SHA256(FreeBSD-12.2-。Release-amd64-dis1.iso)=289522e2f4e1260859505adab6d7b54ab83d19aeb147388ff7e28019984da5dc SHA256(FreeBSD-12.2-Release-amd64-dis1.iso.xz)=a4530246cafbf1dd42a9bd3ea441ca9a78a6a0cd070278cbdf63f3a6f803ecae SHA256(FreeBSD-12.2-Release-amd64-dvd1.iso)=bc997989eafb41fcabd6ed55e379134c7322425391d1cd0e5eff37759fc7f865 SHA256(FreeBSD-12.2-Release-amd64-dvd1.iso.xz)=221d6f9214de944bcdbbe61f030fdebccd43e285227c6b3796e0926e793c9bf7 SHA256(FreeBSD-12.2-Release-amd64-memtick.img)=c7fae987dc652aca219d8b1c4941a1ae48bccefa41b7d82a0656a6a3f9e04775 SHA256(FreeBSD-12.2-Release-AMD64-memtick.img.xz)=9422356d456f2b8a8226c6f51f8a9205456777cb57a023421cfd4a330d382dae SHA256(FreeBSD-12.2-Release-AMD64-memtick.img.xz)。Memtick.img)=83ad7fab69f8d860e0f785ed3af16c19e84e32b3d4f6206fc8b31b83c4e6bfb5 SHA256(FreeBSD-12.2-RELEASE-amd64-mini-memstick.img.xz)=1e3fdefb660d9920f7d315591eeeeab1522670d5f122b9531064bf3b360701c9。\nSHA512(FreeBSD-12.2-Release-i386-bootonly.iso)=2eea6122389c0553d9aa15c682f472dfb8b7fa9c74c25364323f51185320904dbe96770fc333bfa11992d98bf85200ee729db5b1ea3ea25879b0a0ddcc105fc9 SHA512(FreeBSD-12.2-Release-i386-bootonly.iso.xz)=53b08ae31359f730fda8bbe9dc5cd19d76c7e1a672bb4b3ee69e731e2444825e8c8b6056e84a5c13195e81f1643eb793e65809aabd3d36e1a53844365a3b9485 SHA512(FreeBSD-12.2-Release-i386-dis1.iso)=3436f9f94fe7d35d604e4bd8089f8c98619092797c04fb6cd2fa6bf866cd78d7d282e3c7ee052750ee152ba44a6320ba6b1b6a1c589b5fad4a2466fa7f952fee SHA512(FreeBSD-12.2-Release-i386-dis1.iso.xz)=18652842708c858e03cb2b62db15c0925f04f08cd3ef42bdc6723939d4ef0acb3cae70fd1c8ea601f81fd4d9ed7c463c532f1249d068a3225e404e2df577c5b2 SHA512(FreeBSD-12.2-Release-i386-dvd1.iso)=07ac2f0f81a8a0d2370cd6e0650573c3ed78075d6e664262548f99d51ee7b7891a2e622633555e4545df90e2c329187c41ce7bf3e1f6899ecc2dd3edc06bb107 SHA512(FreeBSD-12.2-Release-i386-dvd1.isoxz)=1c89d73db19a9bcbda722f5362a16625c5dca906684ed80ee75ca7e95fd3393852da65c0a9ed1d09c564c05f1e5d4ccae9ce9937e3cacec045de64c6a052883a SHA512(FreeBSD-12.2-Release-i386-dvd1.isoxz)。2-Release-i386-memtick.img)=d2aac7e9ab2f733f8f052c3b7377c664be8addb76038ba3f8e738bae0c46c36e5e8966861668099e9c57f5ef761267b2b4e4e9b1604f22a3a6fd782ef7c0aec7 SHA512(FreeBSD-12.2-Release-i386-memtick.img.xz)=b00ad7ecd524601c74f43ccc54705db810be84e8880088a6fdb5a6b3afe8c882b28991c1117301af40fb3305d8cf5557364787852af4d6ee95605a3e47160bfb SHA512(FreeBSD-12.2-Release-i386-mini-memtick.img)=5bdabe7a44a2b9d2d65d15cd20158f8f6526bed9d459bbff3577c25900127b15900e0fda58cfc1d04640add87a65a800e418897cf2b3f17b71b2344d5a338a66 SHA512(FreeBSD-12.2-RELEASE-i386-mini-memstick.img.xz)=b68c51ebc80858e604c8836b0566c936f17a6c48077bfae469cd15f1ca6e9720b1261bf761550aabc02617302ee1ec11792f4d77b964672ee51c1f85665c4b0a SHA256(FreeBSD-12.2-Release-i386-bootonly.iso)=38ebc2", "note_en": "The FreeBSD Release Engineering Team is pleased to announce the availability of FreeBSD12.2-RELEASE. This is the third release of the stable/12 branch.\n    Updates to the wireless networking stack and various\t drivers have been introduced to provide better 802.11n and\t 802.11ac support.\n          The  clang,  llvm,  lld,\t lldb,  compiler-rt utilities and\t libc++ have been updated to version 10.0.1.\n  For a complete list of new features and known problems, please see the online release notes and errata list, available at:\n          FreeBSD12.2-RELEASE is now available for the amd64, i386, powerpc, powerpc64, sparc64, armv6, and aarch64 architectures.\n  FreeBSD12.2-RELEASE can be installed from bootable ISO images or over the network. Some architectures also support installing from a USB memory stick. The required files can be downloaded as described in the section below.\n  SHA512 and SHA256 hashes for the release ISO, memory stick, and SD card images are included at the bottom of this message.\n            This contains everything necessary to install the base FreeBSD\t operating system, the documentation, debugging distribution\t sets, and a small set of pre-built packages aimed at getting\t a graphical workstation up and running. It also supports\t booting into a &#34;livefs&#34; based rescue mode. This should be\t all you need if you can burn and use DVD-sized media.\n  Additionally, this can be written to a USB memory stick\t (flash drive) for the amd64 architecture and used to\t do an install on machines capable of booting off USB drives.\t It also supports booting into a &#34;livefs&#34; based rescue\t mode.\n  As one example of how to use the memstick image, assuming\t the USB drive appears as /dev/da0 on your machine something\t like this should work:\n    This contains the base FreeBSD operating system. It also\t supports booting into a &#34;livefs&#34; based rescue mode. There\t are no pre-built packages.\n  Additionally, this can be written to a USB memory stick\t (flash drive) for the amd64 architecture and used to\t do an install on machines capable of booting off USB drives.\t It also supports booting into a &#34;livefs&#34; based rescue mode.\t There are no pre-built packages.\n  As one example of how to use the memstick image, assuming\t the USB drive appears as /dev/da0 on your machine something\t like this should work:\n    This supports booting a machine using the CDROM drive but\t does not contain the installation distribution sets for\t installing FreeBSD from the CD itself. You would need to\t perform a network based install (e.g., from an HTTP or FTP\t server) after booting from the CD.\n  Additionally, this can be written to a USB memory stick\t (flash drive) for the amd64 architecture and used to\t do an install on machines capable of booting off USB drives.\t It also supports booting into a &#34;livefs&#34; based rescue mode.\t There are no pre-built packages.\n  As one example of how to use the memstick image, assuming\t the USB drive appears as /dev/da0 on your machine something\t like this should work:\n    This can be written to a USB memory stick (flash drive)\t and used to do an install on machines capable of booting off\t USB drives. It also supports booting into a &#34;livefs&#34; based\t rescue mode. There are no pre-built packages.\n  As one example of how to use the memstick image, assuming\t the USB drive appears as /dev/da0 on your machine something\t like this should work:\n    This can be written to a USB memory stick (flash drive)\t and used to boot a machine, but does not contain the\t installation distribution sets on the medium itself, similar\t to the bootonly image. It also supports booting into\t a &#34;livefs&#34; based rescue mode. There are no pre-built\t packages.\n  As one example of how to use the mini-memstick image,\t assuming the USB drive appears as /dev/da0 on your machine\t something like this should work:\n    These can be written to an SD card and used to boot the\t supported arm system. The SD card image contains the full\t FreeBSD installation, and can be installed onto SD cards as\t small as 512Mb.\n  For convenience for those without console access to the\t system, a  freebsd user with a password of\t  freebsd is available by default for  ssh(1)\t access. Additionally, the  root user password is\t set to  root, which it is strongly recommended to\t change the password for both users after gaining access to\t the system.\n  To write the FreeBSD/arm image to an SD card, use the\t  dd(1) utility, replacing  KERNEL with the\t appropriate kernel configuration name for the system.\n  FreeBSD12.2-RELEASE can also be purchased on CD-ROM or DVD from several vendors. One of the vendors that will be offering FreeBSD12.2-based products is:\n    Pre-installed virtual machine images are also available for the amd64 (x86_64), i386 (x86_32), and AArch64 (arm64) architectures in  QCOW2,  VHD, and  VMDK disk image formats, as well as raw (unformatted) images.\n    af-south-1 region: ami-0183ba5b381eb0baa\teu-north-1 region: ami-0821c256650690884\tap-south-1 region: ami-009471f6e29b012ef\teu-west-3 region: ami-0bfaf7527f637d64b\teu-west-2 region: ami-023d320201b8d06c5\teu-south-1 region: ami-08828d09ef0598bc8\teu-west-1 region: ami-02b1b6bc3cface0ac\tap-northeast-2 region: ami-03f41a1a8d06363a5\tme-south-1 region: ami-0e1e55e0288018f35\tap-northeast-1 region: ami-0a352b6e005340d93\tsa-east-1 region: ami-0b9c77455fbf5f3f0\tca-central-1 region: ami-0dbf9b82233b2b970\tap-east-1 region: ami-0f4732ac090ec2a7d\tap-southeast-1 region: ami-045943797617e690c\tap-southeast-2 region: ami-0cbc4c8a75ded8b2d\teu-central-1 region: ami-0d94faf9636228402\tus-east-1 region: ami-00be86d9bba30a7b3\tus-east-2 region: ami-075db5a7ecd8b1456\tus-west-1 region: ami-0e54f016b55b7f6ce\tus-west-2 region: ami-0c273f14bc9df57d1\n  AMIs are also expected to be available in the Amazon\t Marketplace once third-party validation is complete at:\t   https://aws.amazon.com/marketplace/pp/B07L6QV354/\n    af-south-1 region: ami-0afe034012109b43b\teu-north-1 region: ami-04d3c1275757f20e9\tap-south-1 region: ami-07c0b1ad6978b7814\teu-west-3 region: ami-0bfc36baff5afe2a1\teu-west-2 region: ami-0276cf2663706fbb5\teu-south-1 region: ami-0fa854a53ca82be87\teu-west-1 region: ami-0aa22dfb10a633d26\tap-northeast-2 region: ami-0fb44fe96791af480\tme-south-1 region: ami-000505dcbd78acc9e\tap-northeast-1 region: ami-066d14139dd815cda\tsa-east-1 region: ami-03d75ceb6ca00c117\tca-central-1 region: ami-050385d1fdf3c70f2\tap-east-1 region: ami-00f184a5ec9b137ca\tap-southeast-1 region: ami-063ab54f54180837c\tap-southeast-2 region: ami-0903d6af1e37a63ff\teu-central-1 region: ami-02fcc489e80482d5f\tus-east-1 region: ami-00eea2f51ee575a19\tus-east-2 region: ami-00d07c574a09a4941\tus-west-1 region: ami-03ad9a0a981f26542\tus-west-2 region: ami-0fd803a9d8beb7d6d\n  % gcloud compute instances create  INSTANCE \\\t --image freebsd-12-2-release-amd64 \\\t --image-project=freebsd-org-cloud-dev\t % gcloud compute ssh  INSTANCE\n    FreeBSD12.2-RELEASE is also expected to be\t available in the GoogleComputeEngine™\t Marketplace once they have completed third-party specific\t validation at:  https://console.cloud.google.com/launcher/browse?filter=category:os&amp;filter=price:free\n                  Based on the new FreeBSD support model, the FreeBSD12 release series will be supported until at least June 30, 2024. This point release, FreeBSD12.2-RELEASE, will be supported until at least three months after FreeBSD12.3-RELEASE. Additional support information can be found at:\n    Please note that 12.1 will be supported until three months from the 12.2 release date, currently scheduled for January 31, 2021.\n    Many companies donated equipment, network access, or human time to support the release engineering activities for FreeBSD12.2 including:\n                SHA512 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso) = de1a805cd7f2c740d0f42aa6d2f7439fd9470ee4a471dc2b8eb85314776e9fe5423d0576f099adda600c990885ffbb098bedcb4c13c132125f670919e499ea40 SHA512 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso.xz) = 1ea2389e2c7dc4bdc889925cbffb49e066ed087678cff46197f17d15bbedb35a1021e88a858b040c8d7b041ab7f7b18b4ff8c38e97866bd2b97d5b9ad506d687 SHA512 (FreeBSD-12.2-RELEASE-amd64-disc1.iso) = bbf67945d244c76f1ef26029b2e1c2d30d30881b178881b92b657a3da66f54ff40c57e69f4bebeefe6071da8311f477e8d371a1b9a8d7f000dd32383b9cd7ca7 SHA512 (FreeBSD-12.2-RELEASE-amd64-disc1.iso.xz) = ba2990269cc73623b490c18541d04d4fc9f1d9d1639688d33c8108e09cae78daa6be774d6f40c86774070ab0b42815249a6754ab4135843f197b94bdc8d34268 SHA512 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso) = 80e8c6804e0a965bc1be596b0c8d6dbdbbf9eef42bb4170761ec4094cc07b294fd4f17cd55d28aa7679b5d01c121fa15e6c24852f9307959af759254ebfceba1 SHA512 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso.xz) = ab75d9cae6a4df12ecd9439a108601f8b7729684e711ea48b6784cac8072237e2a41500c1f3060b7680980a1c32545fb89444a936e9096aa6841c87d4bb236eb SHA512 (FreeBSD-12.2-RELEASE-amd64-memstick.img) = 483b961fda9d48a6a59e128f32ece9054e49cd25c7a33987524f1535e0732d2f362829c25801e16336b5ea9ee35681ef1ae04cd027275d73c6bbf9fca5f35ca0 SHA512 (FreeBSD-12.2-RELEASE-amd64-memstick.img.xz) = 75219bd14c52efb9b670884d8dd67499a781f2e6242d84660525535c6eb334d11b50a3d5fb110e755aa1e9791cf5deb5c045eaefec036bd4b67cc4c15532a367 SHA512 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img) = 392d5bb81387b2639f59ac469d60e18d198f6e28d50c678f1154f86dbc583c16ec5461853ff66180b9405997ba8647efb740241794de18242a594241477a841c SHA512 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img.xz) = 6f5c1e8e15597c86ab56e6ac457975d361ea8dec375abe77cfd9604ee54055a2100e6f5d46da7acf702042025c62c4e680a1279c2e84b7b3b424bf6081e7f4bb SHA256 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso) = f18412a1936d6f7df1e8e8857c98aeb53f752d43c732affee9c7a5615d4331b5 SHA256 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso.xz) = 0eafcd6f17b8f87234f161d727b0f52b85f3f4415e9b36d3c93afb57f5da47d0 SHA256 (FreeBSD-12.2-RELEASE-amd64-disc1.iso) = 289522e2f4e1260859505adab6d7b54ab83d19aeb147388ff7e28019984da5dc SHA256 (FreeBSD-12.2-RELEASE-amd64-disc1.iso.xz) = a4530246cafbf1dd42a9bd3ea441ca9a78a6a0cd070278cbdf63f3a6f803ecae SHA256 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso) = bc997989eafb41fcabd6ed55e379134c7322425391d1cd0e5eff37759fc7f865 SHA256 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso.xz) = 221d6f9214de944bcdbbe61f030fdebccd43e285227c6b3796e0926e793c9bf7 SHA256 (FreeBSD-12.2-RELEASE-amd64-memstick.img) = c7fae987dc652aca219d8b1c4941a1ae48bccefa41b7d82a0656a6a3f9e04775 SHA256 (FreeBSD-12.2-RELEASE-amd64-memstick.img.xz) = 9422356d456f2b8a8226c6f51f8a9205456777cb57a023421cfd4a330d382dae SHA256 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img) = 83ad7fab69f8d860e0f785ed3af16c19e84e32b3d4f6206fc8b31b83c4e6bfb5 SHA256 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img.xz) = 1e3fdefb660d9920f7d315591eeeeab1522670d5f122b9531064bf3b360701c9\n    SHA512 (FreeBSD-12.2-RELEASE-i386-bootonly.iso) = 2eea6122389c0553d9aa15c682f472dfb8b7fa9c74c25364323f51185320904dbe96770fc333bfa11992d98bf85200ee729db5b1ea3ea25879b0a0ddcc105fc9 SHA512 (FreeBSD-12.2-RELEASE-i386-bootonly.iso.xz) = 53b08ae31359f730fda8bbe9dc5cd19d76c7e1a672bb4b3ee69e731e2444825e8c8b6056e84a5c13195e81f1643eb793e65809aabd3d36e1a53844365a3b9485 SHA512 (FreeBSD-12.2-RELEASE-i386-disc1.iso) = 3436f9f94fe7d35d604e4bd8089f8c98619092797c04fb6cd2fa6bf866cd78d7d282e3c7ee052750ee152ba44a6320ba6b1b6a1c589b5fad4a2466fa7f952fee SHA512 (FreeBSD-12.2-RELEASE-i386-disc1.iso.xz) = 18652842708c858e03cb2b62db15c0925f04f08cd3ef42bdc6723939d4ef0acb3cae70fd1c8ea601f81fd4d9ed7c463c532f1249d068a3225e404e2df577c5b2 SHA512 (FreeBSD-12.2-RELEASE-i386-dvd1.iso) = 07ac2f0f81a8a0d2370cd6e0650573c3ed78075d6e664262548f99d51ee7b7891a2e622633555e4545df90e2c329187c41ce7bf3e1f6899ecc2dd3edc06bb107 SHA512 (FreeBSD-12.2-RELEASE-i386-dvd1.iso.xz) = 1c89d73db19a9bcbda722f5362a16625c5dca906684ed80ee75ca7e95fd3393852da65c0a9ed1d09c564c05f1e5d4ccae9ce9937e3cacec045de64c6a052883a SHA512 (FreeBSD-12.2-RELEASE-i386-memstick.img) = d2aac7e9ab2f733f8f052c3b7377c664be8addb76038ba3f8e738bae0c46c36e5e8966861668099e9c57f5ef761267b2b4e4e9b1604f22a3a6fd782ef7c0aec7 SHA512 (FreeBSD-12.2-RELEASE-i386-memstick.img.xz) = b00ad7ecd524601c74f43ccc54705db810be84e8880088a6fdb5a6b3afe8c882b28991c1117301af40fb3305d8cf5557364787852af4d6ee95605a3e47160bfb SHA512 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img) = 5bdabe7a44a2b9d2d65d15cd20158f8f6526bed9d459bbff3577c25900127b15900e0fda58cfc1d04640add87a65a800e418897cf2b3f17b71b2344d5a338a66 SHA512 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img.xz) = b68c51ebc80858e604c8836b0566c936f17a6c48077bfae469cd15f1ca6e9720b1261bf761550aabc02617302ee1ec11792f4d77b964672ee51c1f85665c4b0a SHA256 (FreeBSD-12.2-RELEASE-i386-bootonly.iso) = 38ebc253646fa304888c248c9066f3354fe9beaf9d0784086d4bc0d70b639b2a SHA256 (FreeBSD-12.2-RELEASE-i386-bootonly.iso.xz) = aca3ea590b4dec58f964a489f99f57e6f1faecc2c249869179970404b2071036 SHA256 (FreeBSD-12.2-RELEASE-i386-disc1.iso) = b422b5f390f9bd05f5c71783099b2b9a925e7256d7907b9be613ece4a1fb4124 SHA256 (FreeBSD-12.2-RELEASE-i386-disc1.iso.xz) = a8761b1f6cef9d931c201bc5e041fcc1a9ae3705f2b407694206124fcfd276cb SHA256 (FreeBSD-12.2-RELEASE-i386-dvd1.iso) = e7278d307966306fc5709a312ad07b801ac73ea2acb0fd9469c2274bb57f0c05 SHA256 (FreeBSD-12.2-RELEASE-i386-dvd1.iso.xz) = cf562f8f8514ae344450fd15bd756693a72b8e29453a6b3fda5fcd25bc3270bd SHA256 (FreeBSD-12.2-RELEASE-i386-memstick.img) = 83a32f4f2b90f82fa205e481ab0068cd0c2fcdbbfa5fef81b99cc4b9b6f53b48 SHA256 (FreeBSD-12.2-RELEASE-i386-memstick.img.xz) = 78630d283f882116ce24161b4870884467e8c85385ed14f68ad36f5e4d727484 SHA256 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img) = e1055b30960827734f290916afcd477a48464753996eec88a4d76067c7f5b03b SHA256 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img.xz) = 5087505d6823ec1f09c5e8620ad1d83dd8cce27334e3b15971c81aff881b469a\n    SHA512 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso) = 48308b77fda1c3edf0d5916587b70e1148291ff6ad211294c0425086fc82e29893cc6571868789b009f16144b2480d43b778ba14548428bfd18dcc322f39cc1d SHA512 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso.xz) = 0f0785a6eef88e3c00b9c2af68355a5788d3db2e3419345f931860191ed360db5ab46a08e08d52c8b5c9619bb82af04be039148a083347146187135d5a60e135 SHA512 (FreeBSD-12.2-RELEASE-powerpc-disc1.iso) = eb7feb628946caf47c257596595e03864ffb4edb270c5a461708f5e30ce88c6e3044e19ee6014a0593597975d8b41bc0cf6a69f3e517a31485103bf4b1a42083 SHA512 (FreeBSD-12.2-RELEASE-powerpc-disc1.iso.xz) = 2983e759b5b3a58bf5e02a95ef4b69a889891ff35d6ac8d932a5e370361f31045f1cb48c11a4287fffb6fa2fd935da4b474d81162f72921fc6d332ba572e4acb SHA512 (FreeBSD-12.2-RELEASE-powerpc-dvd1.iso) = 5b76131677aa998e7ff5488841722bdc7d796ada8ee8edf466059b74617e7baa89661ba089430de62e2804d7e7053336c07003b9e085f8e01cefbc086e82522b SHA512 (FreeBSD-12.2-RELEASE-powerpc-dvd1.iso.xz) = 3a36fb3c512006d458a0afb1ca21aaaa475ca0a6b89b3fe499b4b8ecdb73ac84d835766c2633ab94648dd62eab6863a6dceaa55ce7bce4e5137cc9bf60693fd3 SHA512 (FreeBSD-12.2-RELEASE-powerpc-memstick.img) = 2d8175d46d4e9a1c35b4baf12d855fe2cdca8f31ac87c56a5ca7680441289459bacc55d3c13e742ccab64ad18ec09e741c520f192cbf5dc06e2164269e0de199 SHA512 (FreeBSD-12.2-RELEASE-powerpc-memstick.img.xz) = 819b8b5a14bc26152f6624f5d9638c2a57db38df6f831184b5b3cf4fdeee39cd190b360a1e7c4fd9ece0c5d638eff87759c878722390c6d9d23fc7dee59219e0 SHA512 (FreeBSD-12.2-RELEASE-powerpc-mini-memstick.img) = e214fdcabd64a545da57064c319516c41ba65b7cc6adc31d218a3fb7c09388f68cb9205ce8df70b32d54d11b05d4577137e151af57681a46a0a34318428a9526 SHA512 (FreeBSD-12.2-RELEASE-powerpc-mini-memstick.img.xz) = d115bedb3430d3b2c3b5a7dd8f4b0d78e185a91a4f600758f5d7c9420bc834a931445c38cf04f4eaf35558f6b42a0f6833e23943f8ec415193f80a247478325b SHA256 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso) = a12775e330bd10857ebdbe7489e3496007b4dc556842fcf77db861b43ab73295 SHA256 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso.xz) = 3a60de08618b1cf0439533c9e9ad589e81e21b0ebd220dd6788728b7937a2aaf SHA256 (FreeBSD-12.2-RELEASE-powerpc-disc1.iso) = ea75d83e7638e220849a2bee10175ec62f18393e87ca7d928d59995a951bddd6 SHA256 (FreeBSD-12.2-RELEASE-powerpc-disc1.iso.xz) = 375fbdf7d1c4b9365c6aae40c9ee8149edf71c51d541d1e9cc12f4f129beeaff SHA256 (FreeBSD-12.2-RELEASE-powerpc-dvd1.iso) = a70df012ad49928a24586c89d888b9d088c5dc74ca635d1519446e81dcbe3d63 SHA256 (FreeBSD-12.2-RELEASE-powerpc-dvd1.iso.xz) = 94f2ad8bbf20e3baf303a7a5b2da49f1f6b22be8ae02be69017c3db8eadbc3a9 SHA256 (FreeBSD-12.2-RELEASE-powerpc-memstick.img) = 2768337b74dbc3064f838b81d98eac8c3314cf8a9b94708a6b121b52d367a2c5 SHA256 (FreeBSD-12.2-RELEASE-powerpc-memstick.img.xz) = d3b771b2a8a20d6bc38f4d865372d89d741ae049f54beedc1bf08915476db5f2 SHA256 (FreeBSD-12.2-RELEASE-powerpc-mini-memstick.img) = 922e51d46bf57e2cdeb2fa3ff5bc2fa8b56f4a4f61eea9911c6278c54b65f254 SHA256 (FreeBSD-12.2-RELEASE-powerpc-mini-memstick.img.xz) = ce6e6f183dc90a356041baf016a84b33368c82f36335f499282485e82e630145\n    SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-bootonly.iso) = 4fe2e31c78ccb3511c92f8095fc6809a5abbccff2dde87cba812615dee73a3ac056c3f3b3d9687d99605b38a0ab0f07fb516854d972d5ddf160d00be3ddec65a SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-bootonly.iso.xz) = df68b371e9acdcb38ac066ebc93f834a52045514b453309af1aeaa896de0c03476f1545ca721bec4d94744a43b053180ca3f61552dd68eaf35237e03accec757 SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-disc1.iso) = 8de9a8da1de7cac22f97305ab6ac930e008241e5be11097c3f78a3c1a3253e0bbcff345b55216614f91ba5384f0fa5f7328815e0589aa753daa98fe2e4011595 SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-disc1.iso.xz) = 7debd7d6273a0f19475d9b61bd1f57f29762c47ee58669c256f4b41b837cda9ba04953900867d88a540881568a6a4c708f79ef49c390ec283a534891cfb5fb11 SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-dvd1.iso) = ab63a35ac490e4dc97f694253c699f491116a720cc345b3a32cb3a2ca0c8f26f8e5ea312e66c9be93207fb2db537e370d2ec2ae5468f3a7c7fc656bdf6630b9f SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-dvd1.iso.xz) = fdbb67ce6f78bf9384d5a7d0e23a80b38549034d29bfac9353fd1d65d682f600f17598102bedc858bb5a36a149ab49971b3ca3b0293dfce3ac9d175a6c3c8ea9 SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-memstick.img) = 6ab2e469368bf8f011f845b431d8b433b3a7a525f6ef48b20fc8aedbe9a1d52a4d4a34610247e251ba7c3ebf0516cf8b1323a69fe01a63e19ef343f7b67b2419 SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-memstick.img.xz) = bd78ad50d2a88871650a6fa59ad2f1556486c047e5b2bbaae73f01968e8a027eb0da633ecb6dd5e8b6487884b25b7d9fd13844ba21556044fe1492a0484f27c1 SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-mini-memstick.img) = 689ddf5092437a7e51d41a9dc5fe5bb71f2d07ec6da221676cd04d4054c41d6f02fb98b860fef9a93f15c79d1c2606e52f72ec54fb142e9984f45297110fcf41 SHA512 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-mini-memstick.img.xz) = 36c8c5fffee7439631150773b96392c2dc55b654cbe5e75d5cb6f03b1f166edc755f3929303ecfefc2f5934e23946efc0804df6e6c795482f5317f83872a17e6 SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-bootonly.iso) = d1226567cd54f02dd4cf3ad98be6426c147d6bbb7922734993c2a7b9373f2d45 SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-bootonly.iso.xz) = a1ec2e7cb9908cbc26158bdefce6f358aa3acbda871b1ad78ae6d6843479671c SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-disc1.iso) = 0a85c8b34c043a4147c6c175542435e1618b5d95590d6509a4c271cbd6f95b11 SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-disc1.iso.xz) = f0a20b84ab1aba40d563d175df35811e8b5af32550b137b12c418551b668d427 SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-dvd1.iso) = 016db608679c7e36666a0319439ca92386f40931480f4c2e6de2bd780edb81da SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-dvd1.iso.xz) = d02a44d105217a220fe9a5aa3dfc56d9497d6acc334a7648dfc845db59ccbcb3 SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-memstick.img) = 0dfff2ec5d416a62badf4c9f09f9cdb236b796dde5385c22726d931f12892e95 SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-memstick.img.xz) = c2cbc4785eaaee2e3f632815d69f14f2ba8986b447f95cb59cf85a2cdbe999f7 SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-mini-memstick.img) = b8f623d7ebef36bf0bde305ccbef6abf1c4c6979cb8cef5d596bd12edb1dae3e SHA256 (FreeBSD-12.2-RELEASE-powerpc-powerpc64-mini-memstick.img.xz) = c36d650841c77364f91db4bdca620e3b32690b3e978a6485bad270f4d2263a99\n    SHA512 (FreeBSD-12.2-RELEASE-powerpc\n......", "posttime": "2020-10-28 08:58:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,release,sha512", "title": "FreeBSD 12.2-发布声明", "title_en": "FreeBSD 12.2-Release Announcement", "transed": 1, "url": "https://www.freebsd.org/releases/12.2R/announce.html", "via": "", "real_tags": ["发布", "release", "sha512"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的经验是，公司往往会有一些自己的行话。其中一些只是普通的业务，比如当你发现自己身处拼车环境中，不得不了解预订是什么。其他部分更具文化性，随着时间的推移，人们在一起工作时，它们会有机地演变。\n其中一个来自Facebook的帖子就是小丑小镇，或者说就是小丑小镇。虽然可能有几种用法，但有时我倾向于把它当作一个形容词，几乎就像把某样东西叫做傻瓜，而不是直截了当地说它愚蠢。当然，还有小丑一词，它的尾部暗示形容词的用法(柔和、悠闲、摇晃)，但这就是你要用的语言。\n特别值得一提的是，小丑镇走出了口语领域，以命令行参数的形式返回到计算机中，您可以将其传递给某些工具。通过使用它们，您可以肯定，无论您要求它做什么，实际上都是失败的、疯狂的、愚蠢的、古怪的，或者仅仅是愚蠢的，但无论如何您都需要它发生。它提醒你停下来想一想你在做什么，以及为什么你必须首先求助于那面旗帜。然后，当火熄灭时，你应该回去想一想可以做些什么来避免再次发生这种情况。\n对于大多数用途来说，这种方式构建的工具往往是相对安全的，但是当您绝对必须在删除检查和健全性检查的情况下做一些特定的事情时，它们仍然具有所需的锐利边缘。他们中的许多人会记录他们一直以这种方式运行的事实，然后向IRC或其他机构宣布，让其他人知道发生了什么。\n基本上，你可以带着剪刀跑步，但其他人会发现这一点，如果组织在做自己的工作，就会有后续行动来找出原因。然后，车轮将开始转动(试图)，使这种情况永远不会再发生。这就是进步过去的样子。\n我还应该提一下，我们还有其他的旗帜，比你可能藏在--小丑城旗帜后面的那面旗帜更可怕。我想其中一个大概是--我想引起--SEV。我们做的就是让我们故意做一些荒谬的事情，比如现在就把生产中的每一台机器都移到包的新版本，即使有问题的系统被设计成永远不会让你在正常操作中这样做。我们宁愿编写工具，严格控制它，永远不会使用它，也不会发现自己处于我们确实需要它但无法实现它的情况下，特别是如果我们更换的系统允许这样做的话(因为总体上相对不安全)，我们宁愿使用它，也不愿发现自己处于实际上需要它但无法实现它的情况下，特别是如果我们更换的系统允许这样做的话(因为总体上相对不安全)。\n当谈到在紧急情况下随身携带非常锋利的工具时，如果你从来不需要使用它们，那也没什么。这意味着你可能已经建立了一个系统，在这个系统中，你的客户/用户所需要的一切都可以通过普通的方式来实现。那真是太棒了！\n按照同样的思路，寻找胶带，寻找--是的，我是认真的--类型标志的用途是一个很好的方法，可以找出你的系统对世界的模型在哪里遗漏了什么。也许现实生活中需要的东西比任何人想象的要多得多，也许某些事情实际上并不是一件例外的事情。也许有人需要花时间在不损害安全的情况下更频繁地做这些事情。\n你最不想要的就是规范安全优先的使用。软件中的最佳实践通常不是用鲜血写成的，就像它们是真正的工程学科一样，但它们仍然需要被考虑。如果我们能从我们自己的集体历史中学习，停电、隐私泄露、数据丢失事件和其他可怕事情的数量可以大大减少。", "note_en": "It&#39;s been my experience that companies tend to have bits of their own lingo. Some of it is just the usual business stuff, like when you find yourself in a ridesharing environment and have to learn what &#34;bookings&#34; are. Other parts are more cultural and sort of evolve organically as people work together over time.\n One of them from Facebook was &#34;clown town&#34; or just &#34;clowntown&#34;. While there might be several uses, I tended to think of it as an adjective sometimes, almost like calling something &#34;goofy&#34; without calling it straight-up &#34;stupid&#34;. Of course, there was also &#34;clowny&#34;, with its trailing &#34;y&#34; suggesting adjective use (downy, cushy, wobbly), but that&#39;s language for you.\n In particular, &#34;clowntown&#34; made it out of the spoken realm and back into the computers in the form of command-line arguments you could pass to certain tools. By using them, you were affirming that whatever you were asking it to do was in fact broken, crazy, goofy, wacky, or maybe just plain stupid, but you needed it to happen anyway. It was a reminder to stop and think about what you were doing, and why you had to resort to that flag in the first place. Then, when the fire was out, you should go back and figure out what can be done to avoid ever having to do that again.\n The tools built this way tended to be relatively safe for most uses, but they still had the sharp edges needed when you absolutely had to do something specific with the checks and sanity check removed. Many of them would log the fact they had been run in this fashion, and would then announce it to IRC or something else to let other people know what was going on.\n Basically, you COULD run with scissors, but other people would find out about it, and if the organization was doing its job, there would be follow-up to find out why. Then wheels would start turning to (try to) make it never have to happen again. This is what progress used to look like.\n I should also mention that we had other flags which were even scarier than the sort that you might hide behind the --clowntown flag. I think one of them was something like --i-want-to-cause-a-sev. It was the kind of thing we put in place to let us deliberately do something ridiculous like &#34;move every machine in production to a new version of a package RIGHT NOW&#34;, even though the system in questionhad been designed to never let you do that in normal operations.We&#39;d rather write the tool, gate it strongly, and never use it than find ourselves in a situation where we actually needed it but couldn&#39;t make it happen, especially if the system we replaced  would have allowed it (by being relatively unsafe overall).\n When it comes to having very sharp tools around for emergencies, it&#39;s okay if you never have to use them. This means you&#39;ve probably built a system in which everything your customers/users need can be fulfilled through ordinary means. That&#39;s great!\n Along the same lines of &#34;looking for the duct tape&#34;,looking for uses of the --yes-i-really-mean-it type flags is a good wayto figure out where you are missing something from your system&#39;s model of the world. It may be that real life needs something far more often than anyone imagined, and maybe certain things are actually not an exceptional event. Maybe someone needs to spend the time on making it possible to do them more often without compromising on safety.\n The last thing you want is to normalize the use of a safety override.Best practices in software aren&#39;t usually &#34;written in blood&#34; like they are with &#34;real&#34; engineering disciplines, but they still need to be considered. The number of outages, privacy leaks, data loss events and other terrible things could be greatly reduced if we could just learn from our own collective history.", "posttime": "2020-10-28 08:57:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小丑,tools", "title": "紧急情况下的锋利工具和小丑城旗帜", "title_en": "Sharp tools for emergencies and the –clowntown flag", "transed": 1, "url": "http://rachelbythebay.com/w/2020/10/27/argv/", "via": "", "real_tags": ["小丑", "tools"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Glen Barber gjb at FreeBSD.org Tue Oct 27 23：18：29 UTC 2020-Begin PGP Signed Message-Hash：SHA256 FreeBSD 12.2-Release声明FreeBSD发行工程团队很高兴地宣布推出FreeBSD 12.2-Release。这是STRATE/12分支的第三个版本。一些亮点：*推出了对无线网络堆栈和各种驱动程序的更新，以提供更好的802.11n和802.11ac支持。*添加了ICE(4)驱动程序，支持英特尔®100 Gb以太网卡。*JARAR(8)实用程序已更新，允许在被监禁的环境中运行Linux(R)。*OpenSSL已更新到版本1.1.1h。*OpenSSH已更新到版本7.9p1。*clang、llvm、lld、lldb、编译器-RT实用程序和libc++已更新到10.0.1版。*还有更多...。有关新功能和已知问题的完整列表，请参阅在线发行说明和勘误表，网址为：*https://www.FreeBSD.org/releases/12.2R/relnotes.html*https://www.FreeBSD.org/releases/12.2R/errata.html有关FreeBSD12.2-Release的详细信息，请参阅：*https://www.FreeBSD.org/releng/Availability FreeBSD12.2-Release现已发布，适用于AMD64、i386、PowerPC、PowerPC64、SPARC64、ARMv6和AARCH64体系结构，详情请参阅：*FreeBSD12.2-Release现已针对AMD64、i386、PowerPC、PowerPC64、SPARC64、ARMv6和AARCH64架构提供。FreeBSD 12.2-Release可以从可引导的ISO映像安装，也可以通过网络安装。某些架构还支持从USB记忆棒安装。所需文件可以下载，如下节所述。此消息底部包含版本ISO、记忆棒和SD卡映像的SHA512和SHA256散列。发布映像的pgp签名校验和也可在以下网址获得：*https://www.FreeBSD.org/releases/12.2R/signatures.html本公告的pgp签名版本可在以下网址获得：*https://www.FreeBSD.org/releases/12.2R/announce.asc作为发布的一部分提供的映像的用途如下：dvd1这包含安装基础FreeBSDTM操作系统、文档、调试分发集和旨在启动和运行图形工作站的一小部分预建软件包所需的一切。它还支持引导进入基于Livefs&34；的救援模式。如果您可以刻录和使用DVD大小的介质，这应该就是您需要的全部内容。此外，还可以将其写入AMD64体系结构的USB记忆棒(闪存驱动器)，并用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，则应该可以执行以下操作：#ddif=FreeBSD-12.2-release-amd64-dvd1.iso\\of=/dev/da0 bs=1M conv=sync请小心确保您的目标(Of)是正确的。(#dd if=FreeBSD-12.2-release-amd64-dvd1.iso\\of=/dev/da0 bs=1M conv=sync)。DISC1它包含基本的FreeBSD操作系统。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。此外，还可以将其写入AMD64体系结构的USB记忆棒(闪存驱动器)，并用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，应该可以执行以下操作：#ddif=FreeBSD-12.2-release-amd64-dis1.iso\\of=/dev/da0 bs=1M conv=sync请注意确保目标(Of)正确。仅引导这支持使用CDROM驱动器引导计算机，但不包含用于从CD本身安装FreeBSD的安装分发集。从CD引导后，您需要执行基于网络的安装(例如，从HTTP或FTP服务器)。此外，还可以将其写入AMD64体系结构的USB记忆棒(闪存驱动器)，并用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，应该可以执行以下操作：#dd if=FreeBSD-12.2-release-amd64-bootonly.iso\\of=/dev/da0 bs=1M conv=sync请小心确保目标(Of)正确。Memtick这可以写入USB记忆棒(闪存驱动器)，用于在能够从USB驱动器引导的机器上进行安装。它还支持引导进入基于Livefs&34；的救援模式。没有预置的软件包。作为如何使用记忆棒图像的一个示例，假设USB驱动器在您的机器上显示为/dev/da0，应该可以执行以下操作：#ddif=FreeBSD-12.2-release-amd64-memtick.img\\of=/dev/da0 bs=1M conv=sync请小心确保目标(Of)正确。迷你记忆棒这可以写入USB记忆棒(闪存驱动器)，并用于启动机器，但不能", "note_en": "Glen Barber  gjb at FreeBSD.org    Tue Oct 27 23:18:29 UTC 2020  -----BEGIN PGP SIGNED MESSAGE-----Hash: SHA256 FreeBSD 12.2-RELEASE Announcement The FreeBSD Release Engineering Team is pleased to announce the availability of FreeBSD 12.2-RELEASE. This is the third release of the stable/12 branch. Some of the highlights: * Updates to the wireless networking stack and various drivers have been introduced to provide better 802.11n and 802.11ac support. * The ice(4) driver has been added, supporting Intel(R) 100Gb ethernet cards. * The jail(8) utility has been updated to allow running Linux(R) in a jailed environment. * OpenSSL has been updated to version 1.1.1h. * OpenSSH has been updated to version 7.9p1. * The clang, llvm, lld, lldb, compiler-rt utilities and libc++ have been updated to version 10.0.1. * And much more... For a complete list of new features and known problems, please see the online release notes and errata list, available at: *  https://www.FreeBSD.org/releases/12.2R/relnotes.html *  https://www.FreeBSD.org/releases/12.2R/errata.html For more information about FreeBSD release engineering activities, please see: *  https://www.FreeBSD.org/releng/Availability FreeBSD 12.2-RELEASE is now available for the amd64, i386, powerpc, powerpc64, sparc64, armv6, and aarch64 architectures. FreeBSD 12.2-RELEASE can be installed from bootable ISO images or over the network. Some architectures also support installing from a USB memory stick. The required files can be downloaded as described in the section below. SHA512 and SHA256 hashes for the release ISO, memory stick, and SD card images are included at the bottom of this message. PGP-signed checksums for the release images are also available at: *  https://www.FreeBSD.org/releases/12.2R/signatures.html A PGP-signed version of this announcement is available at: *  https://www.FreeBSD.org/releases/12.2R/announce.asc The purpose of the images provided as part of the release are as follows: dvd1 This contains everything necessary to install the base FreeBSD operating system, the documentation, debugging distribution sets, and a small set of pre-built packages aimed at getting a graphical workstation up and running. It also supports booting into a &#34;livefs&#34; based rescue mode. This should be all you need if you can burn and use DVD-sized media. Additionally, this can be written to a USB memory stick (flash drive) for the amd64 architecture and used to do an install on machines capable of booting off USB drives. It also supports booting into a &#34;livefs&#34; based rescue mode. As one example of how to use the memstick image, assuming the USB drive appears as /dev/da0 on your machine something like this should work: # dd if=FreeBSD-12.2-RELEASE-amd64-dvd1.iso \\ of=/dev/da0 bs=1m conv=sync Be careful to make sure you get the target (of=) correct. disc1 This contains the base FreeBSD operating system. It also supports booting into a &#34;livefs&#34; based rescue mode. There are no pre-built packages. Additionally, this can be written to a USB memory stick (flash drive) for the amd64 architecture and used to do an install on machines capable of booting off USB drives. It also supports booting into a &#34;livefs&#34; based rescue mode. There are no pre-built packages. As one example of how to use the memstick image, assuming the USB drive appears as /dev/da0 on your machine something like this should work: # dd if=FreeBSD-12.2-RELEASE-amd64-disc1.iso \\ of=/dev/da0 bs=1m conv=sync Be careful to make sure you get the target (of=) correct. bootonly This supports booting a machine using the CDROM drive but does not contain the installation distribution sets for installing FreeBSD from the CD itself. You would need to perform a network based install (e.g., from an HTTP or FTP server) after booting from the CD. Additionally, this can be written to a USB memory stick (flash drive) for the amd64 architecture and used to do an install on machines capable of booting off USB drives. It also supports booting into a &#34;livefs&#34; based rescue mode. There are no pre-built packages. As one example of how to use the memstick image, assuming the USB drive appears as /dev/da0 on your machine something like this should work: # dd if=FreeBSD-12.2-RELEASE-amd64-bootonly.iso \\ of=/dev/da0 bs=1m conv=sync Be careful to make sure you get the target (of=) correct. memstick This can be written to a USB memory stick (flash drive) and used to do an install on machines capable of booting off USB drives. It also supports booting into a &#34;livefs&#34; based rescue mode. There are no pre-built packages. As one example of how to use the memstick image, assuming the USB drive appears as /dev/da0 on your machine something like this should work: # dd if=FreeBSD-12.2-RELEASE-amd64-memstick.img \\ of=/dev/da0 bs=1m conv=sync Be careful to make sure you get the target (of=) correct. mini-memstick This can be written to a USB memory stick (flash drive) and used to boot a machine, but does not contain the installation distribution sets on the medium itself, similar to the bootonly image. It also supports booting into a &#34;livefs&#34; based rescue mode. There are no pre-built packages. As one example of how to use the mini-memstick image, assuming the USB drive appears as /dev/da0 on your machine something like this should work: # dd if=FreeBSD-12.2-RELEASE-amd64-mini-memstick.img \\ of=/dev/da0 bs=1m conv=sync Be careful to make sure you get the target (of=) correct. FreeBSD/arm SD card images These can be written to an SD card and used to boot the supported arm system. The SD card image contains the full FreeBSD installation, and can be installed onto SD cards as small as 512Mb. For convenience for those without console access to the system, a freebsd user with a password of freebsd is available by default for ssh(1) access. Additionally, the root user password is set to root, which it is strongly recommended to change the password for both users after gaining access to the system. To write the FreeBSD/arm image to an SD card, use the dd(1) utility, replacing KERNEL with the appropriate kernel configuration name for the system. # dd if=FreeBSD-12.2-RELEASE-arm-armv6-KERNEL.img \\ of=/dev/da0 bs=1m conv=sync Be careful to make sure you get the target (of=) correct. FreeBSD 12.2-RELEASE can also be purchased on CD-ROM or DVD from several vendors. One of the vendors that will be offering FreeBSD 12.2-based products is: * FreeBSD Mall, Inc.  https://www.freebsdmall.com Pre-installed virtual machine images are also available for the amd64 (x86_64), i386 (x86_32), and AArch64 (arm64) architectures in QCOW2, VHD, and VMDK disk image formats, as well as raw (unformatted) images. FreeBSD 12.2-RELEASE amd64 is also available on these cloud hosting platforms: * FreeBSD/amd64 Amazon(R) EC2(TM): AMIs are available in the following regions: af-south-1 region: ami-0183ba5b381eb0baa eu-north-1 region: ami-0821c256650690884 ap-south-1 region: ami-009471f6e29b012ef eu-west-3 region: ami-0bfaf7527f637d64b eu-west-2 region: ami-023d320201b8d06c5 eu-south-1 region: ami-08828d09ef0598bc8 eu-west-1 region: ami-02b1b6bc3cface0ac ap-northeast-2 region: ami-03f41a1a8d06363a5 me-south-1 region: ami-0e1e55e0288018f35 ap-northeast-1 region: ami-0a352b6e005340d93 sa-east-1 region: ami-0b9c77455fbf5f3f0 ca-central-1 region: ami-0dbf9b82233b2b970 ap-east-1 region: ami-0f4732ac090ec2a7d ap-southeast-1 region: ami-045943797617e690c ap-southeast-2 region: ami-0cbc4c8a75ded8b2d eu-central-1 region: ami-0d94faf9636228402 us-east-1 region: ami-00be86d9bba30a7b3 us-east-2 region: ami-075db5a7ecd8b1456 us-west-1 region: ami-0e54f016b55b7f6ce us-west-2 region: ami-0c273f14bc9df57d1 AMIs are also expected to be available in the Amazon(R) Marketplace once third-party validation is complete at:  https://aws.amazon.com/marketplace/pp/B07L6QV354/ FreeBSD/arm64 Amazon(R) EC2(TM): AMIs are available in the following regions: af-south-1 region: ami-0afe034012109b43b eu-north-1 region: ami-04d3c1275757f20e9 ap-south-1 region: ami-07c0b1ad6978b7814 eu-west-3 region: ami-0bfc36baff5afe2a1 eu-west-2 region: ami-0276cf2663706fbb5 eu-south-1 region: ami-0fa854a53ca82be87 eu-west-1 region: ami-0aa22dfb10a633d26 ap-northeast-2 region: ami-0fb44fe96791af480 me-south-1 region: ami-000505dcbd78acc9e ap-northeast-1 region: ami-066d14139dd815cda sa-east-1 region: ami-03d75ceb6ca00c117 ca-central-1 region: ami-050385d1fdf3c70f2 ap-east-1 region: ami-00f184a5ec9b137ca ap-southeast-1 region: ami-063ab54f54180837c ap-southeast-2 region: ami-0903d6af1e37a63ff eu-central-1 region: ami-02fcc489e80482d5f us-east-1 region: ami-00eea2f51ee575a19 us-east-2 region: ami-00d07c574a09a4941 us-west-1 region: ami-03ad9a0a981f26542 us-west-2 region: ami-0fd803a9d8beb7d6d AMIs are also available in the Amazon(R) Marketplace at:  https://aws.amazon.com/marketplace/pp/B081NF7BY7/ * Google(R) Compute Engine(TM): Instances can be deployed using the gcloud utility: % gcloud compute instances create INSTANCE \\ --image freebsd-12-2-release-amd64 \\ --image-project=freebsd-org-cloud-dev % gcloud compute ssh INSTANCE Replace INSTANCE with the name of the Google Compute Engine instance. FreeBSD 12.2-RELEASE is also expected to be available in the Google Compute Engine(TM) Marketplace once they have completed third-party specific validation at:  https://console.cloud.google.com/launcher/browse?filter=category:os&amp;filter=price:free * Hashicorp/Atlas(R) Vagrant(TM): Instances can be deployed using the vagrant utility: % vagrant init freebsd/FreeBSD-12.2-RELEASE % vagrant upDownload FreeBSD 12.2-RELEASE may be downloaded via https from the following site: *  https://download.freebsd.org/ftp/releases/ISO-IMAGES/12.2/ FreeBSD 12.2-RELEASE virtual machine images may be downloaded from: *  https://download.freebsd.org/ftp/releases/VM-IMAGES/12.2-RELEASE/ For instructions on installing FreeBSD or updating an existing machine to 12.2-RELEASE please see: *  https://www.FreeBSD.org/releases/12.2R/installation.htmlSupport Based on the new FreeBSD support model, the FreeBSD 12 release series will be supported until at least June 30, 2024. This point release, FreeBSD 12.2-RELEASE, will be supported until at least three months after FreeBSD 12.3-RELEASE. Additional support information can be found at: *  https://www.FreeBSD.org/security/ Please note that 12.1 will be supported until three months from the 12.2 release date, currently scheduled for January 31, 2021.Acknowledgments Many companies donated equipment, network access, or human time to support the release engineering activities for FreeBSD 12.2 including: The FreeBSD Foundation Rubicon Communications, LLC (netgate.com) Tarsnap NetApp Internet Systems Consortium ByteMark Hosting CyberOne Data Sentex Data Communications New York Internet Juniper Networks NetActuate Department of Computer Science, National Chiao Tung University NLNet Labs iXsystems The release engineering team for 12.2-RELEASE includes: Glen Barber &lt; gjb at FreeBSD.org&gt; Release Engineering Lead, 12.2-RELEASE Release Engineer Konstantin Belousov &lt; kib at FreeBSD.org&gt; Release Engineering Antoine Brodin &lt; antoine at FreeBSD.org&gt; Package Building Bryan Drewery &lt; bdrewery at FreeBSD.org&gt; Release Engineering, Package Building Marc Fonvieille &lt; blackend at FreeBSD.org&gt; Release Engineering, Documentation Xin Li &lt; delphij at FreeBSD.org&gt; Release Engineering, Security Team Liaison Ed Maste &lt; emaste at FreeBSD.org&gt; Security Officer Deputy Colin Percival &lt; cperciva at FreeBSD.org&gt; Release Engineering Deputy Lead Hiroki Sato &lt; hrs at FreeBSD.org&gt; Release Engineering, Documentation Gleb Smirnoff &lt; glebius at FreeBSD.org&gt; Release Engineering Gordon Tetlow &lt; gordon at FreeBSD.org&gt; Security OfficerTrademark FreeBSD is a registered trademark of The FreeBSD Foundation.ISO Image Checksums amd64 (x86_64): SHA512 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso) = de1a805cd7f2c740d0f42aa6d2f7439fd9470ee4a471dc2b8eb85314776e9fe5423d0576f099adda600c990885ffbb098bedcb4c13c132125f670919e499ea40 SHA512 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso.xz) = 1ea2389e2c7dc4bdc889925cbffb49e066ed087678cff46197f17d15bbedb35a1021e88a858b040c8d7b041ab7f7b18b4ff8c38e97866bd2b97d5b9ad506d687 SHA512 (FreeBSD-12.2-RELEASE-amd64-disc1.iso) = bbf67945d244c76f1ef26029b2e1c2d30d30881b178881b92b657a3da66f54ff40c57e69f4bebeefe6071da8311f477e8d371a1b9a8d7f000dd32383b9cd7ca7 SHA512 (FreeBSD-12.2-RELEASE-amd64-disc1.iso.xz) = ba2990269cc73623b490c18541d04d4fc9f1d9d1639688d33c8108e09cae78daa6be774d6f40c86774070ab0b42815249a6754ab4135843f197b94bdc8d34268 SHA512 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso) = 80e8c6804e0a965bc1be596b0c8d6dbdbbf9eef42bb4170761ec4094cc07b294fd4f17cd55d28aa7679b5d01c121fa15e6c24852f9307959af759254ebfceba1 SHA512 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso.xz) = ab75d9cae6a4df12ecd9439a108601f8b7729684e711ea48b6784cac8072237e2a41500c1f3060b7680980a1c32545fb89444a936e9096aa6841c87d4bb236eb SHA512 (FreeBSD-12.2-RELEASE-amd64-memstick.img) = 483b961fda9d48a6a59e128f32ece9054e49cd25c7a33987524f1535e0732d2f362829c25801e16336b5ea9ee35681ef1ae04cd027275d73c6bbf9fca5f35ca0 SHA512 (FreeBSD-12.2-RELEASE-amd64-memstick.img.xz) = 75219bd14c52efb9b670884d8dd67499a781f2e6242d84660525535c6eb334d11b50a3d5fb110e755aa1e9791cf5deb5c045eaefec036bd4b67cc4c15532a367 SHA512 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img) = 392d5bb81387b2639f59ac469d60e18d198f6e28d50c678f1154f86dbc583c16ec5461853ff66180b9405997ba8647efb740241794de18242a594241477a841c SHA512 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img.xz) = 6f5c1e8e15597c86ab56e6ac457975d361ea8dec375abe77cfd9604ee54055a2100e6f5d46da7acf702042025c62c4e680a1279c2e84b7b3b424bf6081e7f4bb SHA256 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso) = f18412a1936d6f7df1e8e8857c98aeb53f752d43c732affee9c7a5615d4331b5 SHA256 (FreeBSD-12.2-RELEASE-amd64-bootonly.iso.xz) = 0eafcd6f17b8f87234f161d727b0f52b85f3f4415e9b36d3c93afb57f5da47d0 SHA256 (FreeBSD-12.2-RELEASE-amd64-disc1.iso) = 289522e2f4e1260859505adab6d7b54ab83d19aeb147388ff7e28019984da5dc SHA256 (FreeBSD-12.2-RELEASE-amd64-disc1.iso.xz) = a4530246cafbf1dd42a9bd3ea441ca9a78a6a0cd070278cbdf63f3a6f803ecae SHA256 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso) = bc997989eafb41fcabd6ed55e379134c7322425391d1cd0e5eff37759fc7f865 SHA256 (FreeBSD-12.2-RELEASE-amd64-dvd1.iso.xz) = 221d6f9214de944bcdbbe61f030fdebccd43e285227c6b3796e0926e793c9bf7 SHA256 (FreeBSD-12.2-RELEASE-amd64-memstick.img) = c7fae987dc652aca219d8b1c4941a1ae48bccefa41b7d82a0656a6a3f9e04775 SHA256 (FreeBSD-12.2-RELEASE-amd64-memstick.img.xz) = 9422356d456f2b8a8226c6f51f8a9205456777cb57a023421cfd4a330d382dae SHA256 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img) = 83ad7fab69f8d860e0f785ed3af16c19e84e32b3d4f6206fc8b31b83c4e6bfb5 SHA256 (FreeBSD-12.2-RELEASE-amd64-mini-memstick.img.xz) = 1e3fdefb660d9920f7d315591eeeeab1522670d5f122b9531064bf3b360701c9 i386 (x86): SHA512 (FreeBSD-12.2-RELEASE-i386-bootonly.iso) = 2eea6122389c0553d9aa15c682f472dfb8b7fa9c74c25364323f51185320904dbe96770fc333bfa11992d98bf85200ee729db5b1ea3ea25879b0a0ddcc105fc9 SHA512 (FreeBSD-12.2-RELEASE-i386-bootonly.iso.xz) = 53b08ae31359f730fda8bbe9dc5cd19d76c7e1a672bb4b3ee69e731e2444825e8c8b6056e84a5c13195e81f1643eb793e65809aabd3d36e1a53844365a3b9485 SHA512 (FreeBSD-12.2-RELEASE-i386-disc1.iso) = 3436f9f94fe7d35d604e4bd8089f8c98619092797c04fb6cd2fa6bf866cd78d7d282e3c7ee052750ee152ba44a6320ba6b1b6a1c589b5fad4a2466fa7f952fee SHA512 (FreeBSD-12.2-RELEASE-i386-disc1.iso.xz) = 18652842708c858e03cb2b62db15c0925f04f08cd3ef42bdc6723939d4ef0acb3cae70fd1c8ea601f81fd4d9ed7c463c532f1249d068a3225e404e2df577c5b2 SHA512 (FreeBSD-12.2-RELEASE-i386-dvd1.iso) = 07ac2f0f81a8a0d2370cd6e0650573c3ed78075d6e664262548f99d51ee7b7891a2e622633555e4545df90e2c329187c41ce7bf3e1f6899ecc2dd3edc06bb107 SHA512 (FreeBSD-12.2-RELEASE-i386-dvd1.iso.xz) = 1c89d73db19a9bcbda722f5362a16625c5dca906684ed80ee75ca7e95fd3393852da65c0a9ed1d09c564c05f1e5d4ccae9ce9937e3cacec045de64c6a052883a SHA512 (FreeBSD-12.2-RELEASE-i386-memstick.img) = d2aac7e9ab2f733f8f052c3b7377c664be8addb76038ba3f8e738bae0c46c36e5e8966861668099e9c57f5ef761267b2b4e4e9b1604f22a3a6fd782ef7c0aec7 SHA512 (FreeBSD-12.2-RELEASE-i386-memstick.img.xz) = b00ad7ecd524601c74f43ccc54705db810be84e8880088a6fdb5a6b3afe8c882b28991c1117301af40fb3305d8cf5557364787852af4d6ee95605a3e47160bfb SHA512 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img) = 5bdabe7a44a2b9d2d65d15cd20158f8f6526bed9d459bbff3577c25900127b15900e0fda58cfc1d04640add87a65a800e418897cf2b3f17b71b2344d5a338a66 SHA512 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img.xz) = b68c51ebc80858e604c8836b0566c936f17a6c48077bfae469cd15f1ca6e9720b1261bf761550aabc02617302ee1ec11792f4d77b964672ee51c1f85665c4b0a SHA256 (FreeBSD-12.2-RELEASE-i386-bootonly.iso) = 38ebc253646fa304888c248c9066f3354fe9beaf9d0784086d4bc0d70b639b2a SHA256 (FreeBSD-12.2-RELEASE-i386-bootonly.iso.xz) = aca3ea590b4dec58f964a489f99f57e6f1faecc2c249869179970404b2071036 SHA256 (FreeBSD-12.2-RELEASE-i386-disc1.iso) = b422b5f390f9bd05f5c71783099b2b9a925e7256d7907b9be613ece4a1fb4124 SHA256 (FreeBSD-12.2-RELEASE-i386-disc1.iso.xz) = a8761b1f6cef9d931c201bc5e041fcc1a9ae3705f2b407694206124fcfd276cb SHA256 (FreeBSD-12.2-RELEASE-i386-dvd1.iso) = e7278d307966306fc5709a312ad07b801ac73ea2acb0fd9469c2274bb57f0c05 SHA256 (FreeBSD-12.2-RELEASE-i386-dvd1.iso.xz) = cf562f8f8514ae344450fd15bd756693a72b8e29453a6b3fda5fcd25bc3270bd SHA256 (FreeBSD-12.2-RELEASE-i386-memstick.img) = 83a32f4f2b90f82fa205e481ab0068cd0c2fcdbbfa5fef81b99cc4b9b6f53b48 SHA256 (FreeBSD-12.2-RELEASE-i386-memstick.img.xz) = 78630d283f882116ce24161b4870884467e8c85385ed14f68ad36f5e4d727484 SHA256 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img) = e1055b30960827734f290916afcd477a48464753996eec88a4d76067c7f5b03b SHA256 (FreeBSD-12.2-RELEASE-i386-mini-memstick.img.xz) = 5087505d6823ec1f09c5e8620ad1d83dd8cce27334e3b15971c81aff881b469a powerpc: SHA512 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso) = 48308b77fda1c3edf0d5916587b70e1148291ff6ad211294c0425086fc82e29893cc6571868789b009f16144b2480d43b778ba14548428bfd18dcc322f39cc1d SHA512 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso.xz) = 0f0785a6eef88e3c00b9c2af68355a5788d3db2e3419345f931860191ed360db5ab46a08e08d52c8b5c9619bb82af04be039148a083347146187135d5a60e135 SHA512 (FreeBSD-12.2-RELEASE-powerpc-disc1.iso) = eb7feb628946caf47c257596595e03864ffb4edb270c5a461708f5e30ce88c6e3044e19ee6014a0593597975d8b41bc0cf6a69f3e517a31485103bf4b1a42083 SHA512 (FreeBSD-12.2-RELEASE-powerpc-disc1.iso.xz) = 2983e759b5b3a58bf5e02a95ef4b69a889891ff35d6ac8d932a5e370361f31045f1cb48c11a4287fffb6fa2fd935da4b474d81162f72921fc6d332ba572e4acb SHA512 (FreeBSD-12.2-RELEASE-powerpc-dvd1.iso) = 5b76131677aa998e7ff5488841722bdc7d796ada8ee8edf466059b74617e7baa89661ba089430de62e2804d7e7053336c07003b9e085f8e01cefbc086e82522b SHA512 (FreeBSD-12.2-RELEASE-powerpc-dvd1.iso.xz) = 3a36fb3c512006d458a0afb1ca21aaaa475ca0a6b89b3fe499b4b8ecdb73ac84d835766c2633ab94648dd62eab6863a6dceaa55ce7bce4e5137cc9bf60693fd3 SHA512 (FreeBSD-12.2-RELEASE-powerpc-memstick.img) = 2d8175d46d4e9a1c35b4baf12d855fe2cdca8f31ac87c56a5ca7680441289459bacc55d3c13e742ccab64ad18ec09e741c520f192cbf5dc06e2164269e0de199 SHA512 (FreeBSD-12.2-RELEASE-powerpc-memstick.img.xz) = 819b8b5a14bc26152f6624f5d9638c2a57db38df6f831184b5b3cf4fdeee39cd190b360a1e7c4fd9ece0c5d638eff87759c878722390c6d9d23fc7dee59219e0 SHA512 (FreeBSD-12.2-RELEASE-powerpc-mini-memstick.img) = e214fdcabd64a545da57064c319516c41ba65b7cc6adc31d218a3fb7c09388f68cb9205ce8df70b32d54d11b05d4577137e151af57681a46a0a34318428a9526 SHA512 (FreeBSD-12.2-RELEASE-powerpc-mini-memstick.img.xz) = d115bedb3430d3b2c3b5a7dd8f4b0d78e185a91a4f600758f5d7c9420bc834a931445c38cf04f4eaf35558f6b42a0f6833e23943f8ec415193f80a247478325b SHA256 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso) = a12775e330bd10857ebdbe7489e3496007b4dc556842fcf77db861b43ab73295 SHA256 (FreeBSD-12.2-RELEASE-powerpc-bootonly.iso.xz) = 3a60de08618b1cf0439533c9e9ad589e81e21b0ebd220dd6788728b7937a2aaf SHA256 (FreeBSD-12.2-RELEASE-powerpc-disc1.iso) = ea\n......", "posttime": "2020-10-28 08:57:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,freebsd", "title": "FreeBSD 12.2-现已发布", "title_en": "FreeBSD 12.2-RELEASE now available", "transed": 1, "url": "https://lists.freebsd.org/pipermail/freebsd-announce/2020-October/001993.html", "via": "", "real_tags": ["发布", "freebsd"]}, {"category": "", "categoryclass": "", "imagename": "54170c7b87208396b2410f838de3120e.jpg", "infoid": 1031665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "喜剧演员在讨论物理定律时让天体物理学家起鸡皮疙瘩的情况并不常见。但是喜剧演员Chuck Nice在最近的播客StarTalk节目中做到了这一点。该节目的主持人尼尔·德格拉斯·泰森刚刚解释了模拟的论点--我们可以是生活在计算机模拟中的虚拟存在的想法。如果是这样的话，模拟很可能会根据需要创建对现实的感知，而不是始终模拟所有现实-非常类似于优化为仅渲染玩家可见的场景部分的视频游戏。“也许这就是为什么我们的旅行速度不能超过光速的原因，因为如果我们可以，我们就可以到达另一个星系，”节目的联合主持人尼斯说，这促使泰森欣喜地打断了他的话。“在他们可以对其进行编程之前，”这位天体物理学家说，一想到这一点就很高兴。“所以程序员设定了这个限制。”\n这样的谈话可能看起来很轻率。但自从牛津大学(University Of Oxford)的尼克·博斯特罗姆(Nick Bostrom)在2003年写了一篇关于模拟论证的开创性论文以来，哲学家、物理学家、技术学家，当然还有喜剧演员一直在努力接受我们的现实是一个拟像的想法。有些人试图找出我们可以辨别我们是否是模拟生物的方法。其他人试图计算我们成为虚拟实体的可能性。现在，一项新的分析表明，我们生活在基本现实中的可能性-也就是没有被模拟的存在-几乎是相等的。但这项研究还表明，如果人类发展出模拟有意识生物的能力，机会也会压倒性地倾向于我们，因为我们也是别人电脑里的虚拟居住者。(对这一结论的一个警告是，对于“意识”一词的含义，人们几乎没有达成一致意见，更不用说如何去模拟它了。)。\n2003年，博斯特罗姆设想了一个技术娴熟的文明，它拥有巨大的计算能力，需要这种能力的一小部分来模拟新的现实，其中有意识的生物。考虑到这种情况，他的模拟论证表明，以下三难命题中至少有一个命题肯定是正确的：首先，人类几乎总是在达到模拟精通阶段之前灭绝。其次，即使人类达到了那个阶段，他们也不太可能对模拟自己的祖先过去感兴趣。第三，我们生活在模拟环境中的概率接近1。\n在博斯特罗姆之前，电影“黑客帝国”已经在普及模拟现实的概念方面做出了自己的贡献。从柏拉图的洞穴寓言到庄周的蝴蝶梦，这一思想深深植根于西方和东方的哲学传统。最近，埃隆·马斯克(Elon Musk)进一步支持了我们的现实是模拟的概念：“我们处于基本现实的可能性是十亿分之一，”他在2016年的一次会议上说。\n哥伦比亚大学的天文学家大卫·基平说：“如果你假设三难命题中的一个和两个是错误的，那么马斯克是对的。”“你怎么能这样假设呢？”\n为了更好地理解博斯特罗姆的模拟论证，基平决定求助于贝叶斯推理。这种类型的分析使用贝叶斯定理，该定理以18世纪英国统计学家和部长托马斯·贝叶斯的名字命名。贝叶斯分析允许人们通过首先对被分析的事物进行假设(赋予它一个“先验”概率)来计算事情发生的几率(称为“后验”概率)。\n基平一开始就把三难境地变成了两难境地。他将命题一和命题二压缩成一句话，因为在这两种情况下，最终的结果都是没有模拟。因此，两难境地是物理假说(没有模拟)与模拟假说(有基本的现实-也有模拟)。“你只需为这些模型中的每一个分配一个先验概率，”基平说。“我们只是假设无动于衷的原则，当你没有任何数据或倾向时，这是默认的假设.”\n因此，每个假设都会得到一半的先验概率，就像是抛硬币来决定赌注一样。\n下一阶段的分析需要考虑“生育”现实--那些可以产生其他现实的现实--以及“未分娩”现实--那些不能模拟后代现实的现实。如果物理假设是真的，那么我们生活在一个绝产的宇宙中的概率将很容易计算：它将是100%。基平随后表明，即使在模拟假设中，大多数模拟现实也是无效的。这是因为随着模拟产生更多的模拟，可供每一代人使用的计算资源减少到这样的程度，即绝大多数现实将不具备模拟能够容纳有意识生物的后代现实所需的计算能力。\n把所有这些都塞进贝叶斯公式，答案就出来了：我们生活在基本现实中的后验概率几乎与我们是模拟的后验概率相同-几率只有一点点向基本现实倾斜。\n如果人类创造了一个内部有意识存在的模拟，这些概率将发生戏剧性的变化，因为这样的事件将改变我们之前分配给物理假设的机会。“你可以马上排除这个(假设)。那么你就只剩下模拟假说了，“基平说。“根据这些计算，当我们发明这项技术的那一天，我们是真实的几率从略高于50%的几率变成了几乎肯定的我们不是真实的。”那将是对我们天才的一次非常奇怪的庆祝。“。\n基平分析的结果是，根据目前的证据，马斯克关于他认为我们生活在基本现实中的几率是十亿分之一的说法是错误的。博斯特罗姆同意这一结果-但有一些警告。他说，“这与模拟论证并不冲突，模拟论证只断言了一些关于析取的东西”，即三难命题中的三个命题中的一个是真的。\n但博斯特罗姆对基平在分析开始时将相同的先验概率分配给物理和模拟假说的选择提出了异议。他说：“在这里引用冷漠原则是相当站不住脚的。”“与我原来的三个选择相比，人们可以同样地引用它，这样他们每个人都有三分之一的机会。”或者，你可以用其他方式分割可能性空间，得到任何你想要的结果。“。\n这样的吹毛求疵是有道理的，因为没有证据支持一种说法而不是另一种说法。如果我们能找到模拟的证据，这种情况就会改变。那么你能检测到矩阵中的小故障吗？\n加州理工学院(California Institute Of Technology)的计算数学专家霍曼·奥哈迪(Houman Owhadi)曾考虑过这个问题。“如果模拟有无限的计算能力，你就不可能看到你生活在虚拟现实中，因为它可以计算出你想要的任何东西，达到你想要的逼真程度，”他说。“如果这个东西能被检测到，你必须从(它的)计算资源有限的原则开始。”再想想视频游戏，其中许多游戏依靠巧妙的编程将构建虚拟世界所需的计算量降至最低。\n对于欧哈迪来说，寻找这种计算捷径造成的潜在悖论的最有希望的方式是通过量子物理实验。量子系统可以存在于状态的叠加中，这种叠加由一个称为波函数的数学抽象来描述。在标准量子力学中，观测行为会导致该波函数随机崩塌到许多可能的状态之一。物理学家对崩塌过程是真实存在的，还是仅仅反映了我们对该系统认识的变化存在分歧。“如果这只是一个纯粹的模拟，就不会崩溃，”Owhadi说。“当你看着它的时候，一切都已经决定了。剩下的只是模拟，比如你玩这些电子游戏的时候。“\n为此，Owhadi和他的同事们对双缝实验的五个概念变体进行了研究，每个变体都旨在绊倒一个模拟。但他承认，在这个阶段，不可能知道这样的实验是否可行。“这五个实验只是猜测，”欧哈迪说。\n马里兰大学帕克分校的物理学家佐雷·达乌迪(Zohreh Davoudi)也有这样的想法，即有限计算资源的模拟可以自我揭示。她的工作重点是强相互作用，或称强核力-自然的四种基本力量之一。描述强相互作用的方程非常复杂，无法用解析方法求解。这些强相互作用将夸克聚集在一起，形成质子和中子。为了了解强相互作用，物理学家被迫进行数值模拟。与任何假定拥有无限计算能力的超级文明不同，它们必须依靠捷径来使这些模拟在计算上可行-通常是通过认为时空是离散的而不是连续的。到目前为止，研究人员设法从这种方法中获得的最先进的结果是对由两个质子和两个中子组成的单个氦原子核的模拟。\n“很自然，你会开始问，如果你今天模拟一个原子核，也许10年后，我们可以做一个更大的原子核；也许在20或30年后，我们可以做一个分子，”达乌迪说。“50年后，谁知道呢，也许你可以做一些几英寸大小的东西。也许在100年左右的时间里，我们可以研究(人类)大脑。“。\n然而，达乌迪认为，经典计算机很快就会碰壁。“在接下来的10到20年里，我们实际上将看到我们对物理系统的经典模拟的局限性，”她说。因此，她将目光转向量子计算，这依赖于叠加和其他量子效应，使某些通过经典方法不可能解决的计算问题变得容易处理。达乌迪说：“如果量子计算真的成为现实，从某种意义上说，它对我们来说是一个大规模、可靠的计算选择，那么我们将进入一个完全不同的模拟时代。”“我开始考虑，如果我有一台可行的量子计算机，如何进行强相互作用物理和原子核的模拟。”\n所有这些因素都让达武迪对模拟假说进行了推测。如果我们的现实是一个模拟，那么模拟器很可能也在离散化时空以节省计算资源(当然，假设它使用与我们的物理学家相同的机制进行模拟)。在高能宇宙射线到达的方向上，可以潜在地看到这种离散时空的特征：由于打破了所谓的旋转对称性，它们在天空中会有一个更好的方向。\n达乌迪说，望远镜“还没有观测到任何偏离旋转不变性的现象”。即使可以看到这样的效果，它也不会构成我们生活在模拟中的明确证据。基本现实本身也可能具有类似的属性。\n尽管基平自己进行了研究，但他担心对模拟假说的进一步研究进展缓慢。他说：“我们是否生活在模拟环境中，可以说是无法测试的。”“如果它不是可证伪的，那么你怎么能说它真的是科学呢？”\n对他来说，有一个更明显的答案：奥卡姆剃须刀，它说在没有其他证据的情况下，最简单的解释更有可能是正确的。模拟假设是精心设计的，假设现实嵌套在现实之上，以及永远不会知道它们在模拟中的模拟实体。基平说：“因为它首先是一个过于复杂、精致的模型，与简单的自然解释相比，奥卡姆剃须刀真的应该不看好它。”\n也许我们毕竟生活在基本的现实中-尽管有矩阵、马斯克和奇怪的量子物理。", "note_en": "It is not often that a comedian gives an astrophysicist goose bumps when discussing the laws of physics. But comic Chuck Nice managed to do just that in a recent episode of the podcast  StarTalk.  The show’s host Neil deGrasse Tyson had just explained the simulation argument—the idea that we could be virtual beings living in a computer simulation. If so, the simulation would most likely create perceptions of reality on demand rather than simulate all of reality all the time—much like a video game optimized to render only the parts of a scene visible to a player. “Maybe that’s why we can’t travel faster than the speed of light, because if we could, we’d be able to get to another galaxy,” said Nice, the show’s co-host, prompting Tyson to gleefully interrupt. “Before they can program it,” the astrophysicist said,  delighting at the thought. “ So the programmer put in that limit.”\n Such conversations may seem flippant. But ever since Nick Bostrom of the University of Oxford wrote a  seminal paper about the simulation argument in 2003, philosophers, physicists, technologists and, yes, comedians have been grappling with the idea of our reality being a simulacrum. Some have tried to identify ways in which we can discern if we are simulated beings. Others have attempted to calculate the chance of us being virtual entities. Now a new analysis shows that the odds that we are living in base reality—meaning an existence that is not simulated—are pretty much even. But the study also demonstrates that if humans were to ever develop the ability to simulate conscious beings, the chances would overwhelmingly tilt in favor of us, too, being virtual denizens inside someone else’s computer. (A caveat to that conclusion is that there is little agreement about what the term “consciousness” means, let alone how one might go about simulating it.)\n In 2003 Bostrom imagined a technologically adept civilization that possesses immense computing power and needs a fraction of that power to simulate new realities with conscious beings in them. Given this scenario, his simulation argument showed that at least one proposition in the following trilemma must be true: First, humans almost always go extinct before reaching the simulation-savvy stage. Second, even if humans make it to that stage, they are unlikely to be interested in simulating their own ancestral past. And third, the probability that we are living in a simulation is close to one.\n Before Bostrom, the movie  The Matrix had already done its part to popularize the notion of simulated realities. And the idea has deep roots in Western and Eastern philosophical traditions, from Plato’s  cave allegory to Zhuang Zhou’s  butterfly dream. More recently, Elon Musk gave further fuel to the concept that our reality is a simulation: “ The odds that we are in base reality is one in billions,” he said at a 2016 conference.\n “Musk is right if you assume [propositions] one and two of the trilemma are false,” says astronomer  David Kipping of Columbia University. “How can you assume that?”\n To get a better handle on Bostrom’s simulation argument, Kipping decided to resort to Bayesian reasoning. This type of analysis uses Bayes’s theorem,  named after Thomas Bayes, an 18th-century English statistician and minister. Bayesian analysis allows one to calculate the odds of something happening (called the “posterior” probability) by first making assumptions about the thing being analyzed (assigning it a “prior” probability).\n Kipping began by turning the trilemma into a dilemma. He collapsed propositions one and two into a single statement, because in both cases, the final outcome is that there are no simulations. Thus, the dilemma pits a physical hypothesis (there are no simulations) against the simulation hypothesis (there is a base reality—and there are simulations, too). “You just assign a prior probability to each of these models,” Kipping says. “We just assume the principle of indifference, which is the default assumption when you don’t have any data or leanings either way.”\n So each hypothesis gets a prior probability of one half,  much as if one were to flip a coin to decide a wager.\n The next stage of the analysis required thinking about “parous” realities—those that can generate other realities—and “nulliparous” realities—those that cannot simulate offspring realities. If the physical hypothesis was true, then the probability that we were living in a nulliparous universe would be easy to calculate: it would be 100 percent. Kipping then showed that even in the simulation hypothesis, most of the simulated realities would be nulliparous. That is because as simulations spawn more simulations, the computing resources available to each subsequent generation dwindles to the point where the vast majority of realities will be those that do not have the computing power necessary to simulate offspring realities that are capable of hosting conscious beings.\n Plug all these into a Bayesian formula, and out comes the answer: the posterior probability that we are living in base reality is almost the same as the posterior probability that we are a simulation—with the odds tilting in favor of base reality by just a smidgen.\n These probabilities would change dramatically if humans created a simulation with conscious beings inside it, because such an event would change the chances that we previously assigned to the physical hypothesis. “You can just exclude that [hypothesis] right off the bat. Then you are only left with the simulation hypothesis,” Kipping says. “The day we invent that technology, it flips the odds from a little bit better than 50–50 that we are real to almost certainly we are not real, according to these calculations. It’d be a very strange celebration of our genius that day.”\n The upshot of Kipping’s analysis is that, given current evidence, Musk is wrong about the one-in-billions odds that he ascribes to us living in base reality. Bostrom agrees with the result—with some caveats. “This does not conflict with the simulation argument, which only asserts something about the disjunction,” the idea that one of the three propositions of the trilemma is true, he says.\n But Bostrom takes issue with Kipping’s choice to assign equal prior probabilities to the physical and simulation hypothesis at the start of the analysis. “The invocation of the principle of indifference here is rather shaky,” he says. “One could equally well invoke it over my original three alternatives, which would then give them one-third chance each. Or one could carve up the possibility space in some other manner and get any result one wishes.”\n Such quibbles are valid because there is no evidence to back one claim over the others. That situation would change if we can find evidence of a simulation. So could you detect a glitch in the Matrix?\n Houman Owhadi, an expert on computational mathematics at the California Institute of Technology, has thought about the question. “If the simulation has infinite computing power, there is no way you’re going to see that you’re living in a virtual reality, because it could compute whatever you want to the degree of realism you want,” he says. “If this thing can be detected, you have to start from the principle that [it has] limited computational resources.” Think again of video games, many of which rely on clever programming to minimize the computation required to construct a virtual world.\n For Owhadi, the most promising way to look for potential paradoxes created by such computing shortcuts is through quantum physics experiments. Quantum systems can exist in a superposition of states, and this superposition is described by a mathematical abstraction called the wave function. In standard quantum mechanics, the act of observation causes this wave function to randomly collapse to one of many possible states. Physicists are divided over whether the process of collapse is something real or just reflects a change in our knowledge about the system. “If it is just a pure simulation, there is no collapse,” Owhadi says. “Everything is decided when you look at it. The rest is just simulation, like when you’re playing these video games.”\n To this end, Owhadi and his colleagues  have worked on five conceptual variations of the double-slit experiment, each designed to trip up a simulation. But he acknowledges that it is impossible to know, at this stage, if such experiments could work. “Those five experiments are just conjectures,” Owhadi says.\n Zohreh Davoudi, a physicist at the University of Maryland, College Park, has also entertained the idea that a simulation with finite computing resources could reveal itself. Her work focuses on strong interactions, or the strong nuclear force—one of nature’s four fundamental forces. The equations describing strong interactions, which hold together quarks to form protons and neutrons, are so complex that they cannot be solved analytically. To understand strong interactions, physicists are forced to do numerical simulations. And unlike any putative supercivilizations possessing limitless computing power, they must rely on shortcuts to make those simulations computationally viable—usually by considering spacetime to be discrete rather than continuous. The most advanced result researchers have managed to coax from this approach so far is the simulation of a single nucleus of helium that is composed of two protons and two neutrons.\n “Naturally, you start to ask, if you simulated an atomic nucleus today, maybe in 10 years, we could do a larger nucleus; maybe in 20 or 30 years, we could do a molecule,” Davoudi says. “In 50 years, who knows, maybe you can do something the size of a few inches of matter. Maybe in 100 years or so, we can do the [human] brain.”\n Davoudi thinks that classical computers will soon hit a wall, however. “In the next maybe 10 to 20 years, we will actually see the limits of our classical simulations of the physical systems,” she says. Thus, she is turning her sights to quantum computation, which relies on superpositions and other quantum effects to make tractable certain computational problems that would be impossible through classical approaches. “If quantum computing actually materializes, in the sense that it’s a large scale, reliable computing option for us, then we’re going to enter a completely different era of simulation,” Davoudi says. “I am starting to think about how to perform my simulations of strong interaction physics and atomic nuclei if I had a quantum computer that was viable.”\n All of these factors have led Davoudi to speculate about the simulation hypothesis. If our reality is a simulation, then the simulator is likely also discretizing spacetime to save on computing resources (assuming, of course, that it is using the same mechanisms as our physicists for that simulation). Signatures of such discrete spacetime could potentially be seen in the directions high-energy cosmic rays arrive from: they would have a preferred direction in the sky because of the breaking of so-called rotational symmetry.\n Telescopes “haven’t observed any deviation from that rotational invariance yet,” Davoudi says. And even if such an effect were to be seen, it would not constitute unequivocal evidence that we live in a simulation. Base reality itself could have similar properties.\n Kipping, despite his own study, worries that further work on the simulation hypothesis is on thin ice. “It’s arguably not testable as to whether we live in a simulation or not,” he says. “If it’s not falsifiable, then how can you claim it’s really science?”\n For him, there is a more obvious answer:  Occam’s razor, which says that in the absence of other evidence, the simplest explanation is more likely to be correct. The simulation hypothesis is elaborate, presuming realities nested upon realities, as well as simulated entities that can never tell that they are inside a simulation. “Because it is such an overly complicated, elaborate model in the first place, by Occam’s razor, it really should be disfavored, compared to the simple natural explanation,” Kipping says.\n Maybe we are living in base reality after all— The Matrix, Musk and weird quantum physics notwithstanding.", "posttime": "2020-10-28 08:43:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "生活,live,模拟", "title": "我们生活在模拟中吗？几率大约是50%", "title_en": "Do We Live in a Simulation? Chances Are about 50–50", "transed": 1, "url": "https://www.scientificamerican.com/article/do-we-live-in-a-simulation-chances-are-about-50-50/", "via": "", "real_tags": ["生活", "live", "模拟"]}, {"category": "", "categoryclass": "", "imagename": "995e6fa85a4267ea77fb3293d41aa953.jpg", "infoid": 1031664, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客攻击似乎发生在太平洋时间下午4点过后不久。罪魁祸首很可能获得了donaldjtrump.com网络服务器后端的访问权限，并用一长段模糊的javascript替换了“About”页面，生成了对FBI“此站点已被查封”的恶搞消息。\n新网站上写道：“世界已经受够了唐纳德·J·特朗普总统每天散布的假新闻。”“是时候让世界知道真相了。”\n这些黑客自称掌握了“冠状病毒起源”的内幕消息和其他败坏特朗普信誉的信息，提供了两个莫内罗地址。Monero是一种加密货币，很容易发送，但很难跟踪。出于这个原因，它已经与像这次黑客攻击这样令人不快的操作联系在一起。\n一个地址是给那些想要公布“严格保密信息”的人的，另一个地址是给那些更愿意保守秘密的人的。在一个未指明的最后期限之后，将比较加密货币的总数，较高的总数将确定如何处理数据。\n该页面是使用PGP公钥签名的，该公钥对应于不存在的域(planet.gov)中的电子邮件地址。\n在黑客攻击发生后的几分钟内，该网站恢复了原始内容。没有证据表明任何敏感数据，如捐赠者信息，被访问了，但在网站管理员彻底调查事件之前，可能性很小。\n让人们不可逆转地将加密货币发送到一个神秘的地址是一种常见的在线诈骗形式，通常依赖于在名人Twitter账户等高可见度平台上的短暂露面。这个也没什么不同，几分钟内就被拿下了。\n没有迹象表明这起袭击是由国家以任何方式支持的，虽然它带有党派基调，但很难说这是一次针对特朗普竞选纲领的非常连贯的袭击。竞选和其他与选举相关的网站是黑客的高价值目标，因为它们与特朗普等实体有关，但不像Whitehouse.gov等官方网站那样安全。尽管这句话似乎不是以英语为母语的人说的，但没有其他确凿的证据表明黑客来自外国。\n这不是特朗普最近第一次遭到黑客攻击。他的推特账号被一个猜到他密码的人短暂接管(“maga2020！”)。但幸运的是，总统并没有打算收集民主党议员或以其他方式搅乱局面。当然，特朗普的酒店之前也曾遭到黑客攻击。\n特朗普最近似乎错误地表示，“没有人会被黑客攻击。要想被黑客入侵，你需要一个智商为197的人，他需要你密码的15%。“", "note_en": "The hack seemingly took place shortly after 4 PM Pacific time. The culprits likely gained access to the donaldjtrump.com web server backend and replaced the “About” page with a long stretch of obfuscated javascript producing a parody of the FBI “this site has been seized” message.\n “the world has had enough of the fake-news spreaded daily by president donald j trump,” the new site read. “it is time to allow the world to know truth.”\n  Claiming to have inside information on the “origin of the corona virus” and other information discrediting Trump, the hackers provided two Monero addresses. Monero is a cryptocurrency that’s easy to send but quite difficult to track. For this reason it has become associated with unsavory operations such as this hack.\n  One address was for people that wanted the “strictly classified information” released, the other for those who would prefer to keep it secret. After an unspecified deadline the totals of cryptocurrency would be compared and the higher total would determine what was done with the data.\n The page was signed with a PGP public key corresponding to an email address at a non-existent domain (planet.gov).\n The website was reverted to its original content within a few minutes of the hack taking place. There is no evidence to suggest that any sensitive data, such as donator information, was accessed, but until the site administrators investigate the event thoroughly it is a remote possibility.\n Getting people to irreversibly send cryptocurrency to a mysterious address is a common form of scam online, usually relying on brief appearances on high visibility platforms like celebrity Twitter accounts and the like. This one is no different, and was taken down within minutes.\n There is no indication that this attack was in any way state-sponsored, and while it strikes a partisan tone one can hardly say that this is a very coherent attack against the Trump platform. Campaign and other elections-related websites are high value targets for hackers because they are associated with entities like Trump but are not as secure as official sites like whitehouse.gov. Though the diction seems not to be that of a native English speaker, there is no other positive evidence that the hack is of foreign origin.\n  This is not the first time Trump has been hacked recently. His  Twitter account was briefly taken over by someone who guessed his password (“maga2020!”) but was, luckily for the President, not of a mind to collect DMs or otherwise rock the boat. And of course  Trump’s hotels were hacked before as well.\n Trump recently stated, mistakenly it seems, that “Nobody gets hacked. To get hacked you need somebody with 197 IQ and he needs about 15 percent of your password.”", "posttime": "2020-10-28 08:09:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,竞选,campaign,特朗普", "title": "\n特朗普竞选网站被加密货币诈骗者黑客入侵", "title_en": "\n\t\t\t\tTrump’s campaign website hacked by cryptocurrency scammers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/trumps-campaign-website-hacked-by-cryptocurrency-scammers/", "via": "", "real_tags": ["黑客", "竞选", "campaign", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "40ea256ae120e98cfe4375939b0af476.jpg", "infoid": 1031663, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Waymo和戴姆勒(Daimler)卡车正在合作进行自动运输，目标是在美国制造和销售一款量产的自动驾驶卡车。此次合作将使Waymo贡献无人驾驶技术，该技术正在为其Waymo One自动叫车项目提供动力，该项目最近在亚利桑那州凤凰城进行了封闭测试。在那里，该项目的成员可以用手机召唤一辆全自动驾驶的Waymo车辆，就像他们可能召唤优步(Uber)或Lyft一样。早在2019年，Waymo就开始向公众提供自动驾驶汽车的乘车服务--在封闭的测试版中，车内没有人类安全司机；传统上，司机会出现在方向盘上，在系统遇到无法自行处理的问题时接手。现在，这项技术正被应用到更大的车辆上。Waymo一直坦率地将自动驾驶卡车视为其未来的一部分，与戴姆勒卡车北美公司(Daimler Trucks North America)的交易使其成为这一愿景的重量级合作伙伴。事实上，戴姆勒对这一概念并不陌生，早在2015年就测试了自己的自动驾驶卡车技术。合作的重点将是Freightliner Cascadia卡车，它将配备Waymo司机平台。这是一辆8级车，已经被标榜为戴姆勒旗下品牌提供的最先进的车型之一。它是所谓的底特律保险5.0主动安全技术套件的标配，包括主动刹车辅助和自适应巡航控制，而车道偏离警告和车道保持是可选的。不过，Waymo司机的能力将远远超过这一点。为卡车设想的4级系统将意味着它们将能够处理所有驾驶功能，尽管不一定在所有条件下：例如，恶劣天气可能会被证明是一个挑战，尽管Waymo一直在美国各地的不同地点进行测试，让其系统体验一下不同的气候。这包括自动卡车测试，尽管就像Waymo的乘用车合作伙伴一样，未来看起来总是可能涉及制造合作伙伴，而不是内部卡车。尽管如此，从大胆的自动驾驶想法到实际的商业运输的道路是艰难的，已经有几家初创公司希望实现同样的目标。今年早些时候，Starsky Robotics关闭了自己的自动驾驶和遥控卡车公司，其首席执行官分享了该行业面临的挑战的一些冷酷的家庭真相。Waymo和戴姆勒(Daimler)的无人驾驶卡车似乎不会很快准备好购买。两家公司表示：“配备Waymo司机的自动货运客机卡斯卡迪亚(Cascadia)卡车将在未来几年向美国客户推出。”但没有给出更具体的时间表。“Waymo和戴姆勒卡车将在不久的将来研究向其他市场和品牌的扩张.”", "note_en": "Waymo and Daimler Trucks are teaming up on autonomous haulage, aiming to build and sell a production self-driving truck in the US. The collaboration will see Waymo contribute the driverless tech that is powering its Waymo One autonomous ride-hailing program, which recently  came out of closed beta in Phoenix, Arizona.    There, members of the program can summon a fully-autonomous Waymo vehicle from their phone, much in the way that they might an Uber or Lyft. Back in 2019, Waymo began offering rides to the public – in closed beta – in autonomous vehicles without a human safety driver in the car; traditionally, that driver would be present at the wheel, to take over in case the system encountered a problem it couldn’t deal with itself.  Now the technology is being applied to much larger vehicles. Waymo has always been upfront about seeing self-driving trucks as part of its future, and the deal with Daimler Trucks North America gives it a heavyweight partner for that vision. Daimler, indeed, is no stranger to the concept, having tested out its own self-driving truck tech  all the way back in 2015.  The focus of the collaboration will be the Freightliner Cascadia truck, which will be outfitted with the Waymo Driver platform. It’s a Class 8 vehicle, and already billed as one of the most advanced the Daimler-owned brand offers. It comes as standard with the so-called Detroit Assurance 5.0 suite of active safety tech, including active brake assistance and adaptive cruise control, while lane departure warnings and lane-keeping are optional.   The Waymo Driver, though, will be far more capable than that. The Level 4 system envisaged for the trucks will mean they will be able to handle all driving functions, though not necessarily in every condition: heavy inclement weather, for example, could prove a challenge, though Waymo has been testing in different locations around the US to give its system a taste of alternative climates.  That’s  included autonomous truck testing, though as with Waymo’s passenger car partnerships the future always looked likely to involve manufacturing partners rather than an in-house truck. All the same, the path from bold self-driving idea to actual commercial haulage is a tough one, and has claimed several startups hoping to achieve the same. Earlier this year, Starsky Robotics shut down its own self-driving and remote control truck company, with its CEO sharing  some cold home truths about the challenges the industry faced.   Waymo and Daimler’s driverless trucks won’t be ready to purchase any time soon, it seems. “The autonomous Freightliner Cascadia truck, equipped with the Waymo Driver, will be available to customers in the U.S. in the coming years,” the two companies say, giving no more specific timeline than that. “Waymo and Daimler Trucks will investigate expansion to other markets and brands in the near future.”", "posttime": "2020-10-28 08:08:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,戴姆勒,trucks,自动", "title": "Waymo和戴姆勒卡车正在合作，将在“未来几年”在美国制造和销售自动驾驶货运卡车", "title_en": "Waymo and Daimler Trucks are partnering to build and sell self-driving freight trucks in the US over “the coming years”", "transed": 1, "url": "https://www.slashgear.com/waymo-and-daimler-team-up-to-sell-autonomous-trucks-in-the-us-27644606/", "via": "", "real_tags": ["美国", "戴姆勒", "trucks", "自动"]}, {"category": "", "categoryclass": "", "imagename": "778b5ac5f0146f57a7ec6f42afda2e57.jpeg", "infoid": 1031662, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据知情人士透露，Visa斥资53亿美元收购金融科技领域一家关键企业的交易因反垄断担忧而岌岌可危。\n司法部可能很快就会决定是否起诉阻止Visa收购Play Inc.，这家公司提供支撑一系列下一代金融应用程序的技术基础设施。知情人士说，在今年大部分时间里都在仔细审查这笔交易之后，商务部担心这可能会限制支付行业新生的竞争。\n一些知情人士说，司法部一直在为可能的诉讼做准备，包括安排潜在的证人进行审判。目前还没有做出最终决定。\n司法部最近将新的重点放在了金融领域的反垄断执法上。该部门最高反垄断官员马坎·德拉希姆(Makan Delrahim)在8月份宣布对内部运作进行改组，以改善该部门评估金融行业竞争的方式，他说，政府需要重新审视新技术如何改变金融服务业的竞争格局。\n与此同时，司法部和华盛顿正在广泛地密切关注主导人们购物、工作和沟通方式的大型科技公司。司法部上周对谷歌提起了重磅炸弹反垄断诉讼，指控该公司利用其主导地位扼杀竞争，这家搜索巨头否认了这一指控。\n在特朗普政府第一个任期晚些时候提起的任何案件都将落到赢得下周总统选举的任何人手中。如果民主党候选人乔·拜登获胜，反垄断执法不太可能平息。他说，经济集中“威胁到我们的竞争、选择和共享繁荣的美国价值观”。\n格子一直被金融科技公司和商家视为一个平台，有朝一日可以让消费者在不依赖借记卡和信用卡的情况下进行购物。\n这家总部位于旧金山的初创公司说，它在11,000多家银行和金融服务公司以及2亿多个消费者账户之间提供连接。\n根据行业出版物尼尔森报告(Nilson Report)的数据，今年1月宣布计划收购的Visa是美国最大的信用卡网络，在2020年上半年处理了2.2万亿美元的信用卡、借记卡和预付卡交易。其最接近的竞争对手万事达卡(Mastercard)在同一时期处理了9420亿美元的信用卡交易。\n司法部还在审查万事达卡以近10亿美元收购金融科技公司Finicity的交易，以及Intuit以约70亿美元收购个人理财门户网站Credit Karma Inc.的交易。Finicity是一家类似于Play的初创公司。\nVisa最初表示，预计对Played的收购将在夏季前完成，等待监管部门的批准。今年夏天，Visa表示，预计将在今年年底前关闭。\nPlay生产的软件允许银行和金融技术公司接入消费者的各种金融账户，使这些公司在获得用户许可的情况下，能够汇总支出数据、查询余额和核实其他个人财务信息。其客户和合作伙伴包括贝宝控股(PayPal Holdings)旗下的数字转账服务Venmo、股票交易应用Robinhood Markets Inc.和抵押贷款软件初创公司Blend Labs Inc.。\nVisa和万事达卡一直担心，如果更多的人改变支付方式和使用应用程序，例如，实现基本上绕过信用卡网络的银行账户到银行账户支付，他们就会落在后面。\n近年来，这两家公司都在收购支持新型支付的公司。\n与此同时，商家一直希望像格子这样的金融科技公司最终能帮助促进这些新型支付。这可能会让商家避免由Visa和万事达卡(Mastercard)等网络设定的刷卡费用，这些费用长期以来一直是争议的焦点。\nPlay目前并不像Visa那样运营支付网络，但它的软件可以查看消费者是否是某个特定银行账户的所有者，并可以查询该账户中有多少钱。\n知情人士说，司法部已经与商人贸易团体进行了交谈。它还与与Play合作的公司进行了交谈，包括允许互联网公司接受信用卡的PayPal，Strip Inc.，加密货币交易所Coinbase Inc.。据知情人士透露，还有生产TurboTax产品的Intuit。贝宝(PayPal)是Play的早期投资者。\n这些知情人士说，一些受访者告诉该部门，他们担心此次收购可能会损害金融科技公司提供服务的能力，包括限制他们代表客户与银行互动的能力。\n写信给Annamaria Andriotis(annamaria.andriotis@wsj.com)、Brent Kendall(brent.kendall@wsj.com)和Peter Rudegeair(Peter.Rudegeair@wsj.com)", "note_en": "Visa     V  -1.56%   $5.3 billion deal to buy a key player in the financial-technology space is in jeopardy because of antitrust concerns, according to people familiar with the matter.\n  The Justice Department could decide soon whether it will sue to block Visa’s acquisition of Plaid Inc., a firm that provides  the technological infrastructure underpinning an array of next-generation financial apps. After spending the better part of the year scrutinizing the deal, the department is concerned it could limit nascent competition in the payments sector, people familiar with the matter said.\n  The Justice Department has been making preparations for potential litigation, including lining up potential witnesses for a trial, some of the people said. No final decision has been made.\n        The Justice Department has recently placed new emphasis on antitrust enforcement in the financial sector. The department’s top antitrust official, Makan Delrahim, in August announced a shake-up of internal operations to improve how the department evaluates financial-sector competition, saying the government needed to “take a fresh look” at how new technologies are changing competitive dynamics in the financial-services industry.\n  At the same time, the Justice Department and Washington broadly are taking a closer look at big tech companies that dominate the way people shop, work and communicate. The Justice Department last week filed a blockbuster antitrust lawsuit against Google, alleging the company used its dominance to stifle competition, allegations the search giant denies.\n  Any cases filed this late in the Trump administration’s first term will fall to whoever wins next week’s presidential election. Antitrust enforcement is not likely to subside if Democratic nominee Joe Biden wins. He has said economic concentration “threatens our American values of competition, choice, and shared prosperity.“\n  Plaid has been viewed by fintech companies and merchants as a platform that could one day enable consumers to make purchases without having to rely on debit and credit cards.\n  The San Francisco-based startup has said it provides connections between more than 11,000 banks and financial-services companies and more than 200 million consumer accounts.\n  Visa, which announced the planned acquisition in January, is the largest U.S. card network, handling $2.2 trillion of credit, debit and prepaid-card transactions during the first half of 2020, according to the Nilson Report, a trade publication. Its closest competitor,  Mastercard   handled $942 billion in card transactions during the same period.\n  The Justice Department is also reviewing Mastercard’s nearly $1 billion deal for fintech firm Finicity, a startup similar to Plaid, as well as  Intuit  roughly $7 billion deal for personal-finance portal Credit Karma Inc.\n  Visa initially said it expected the Plaid acquisition to close by the summer, pending regulatory approval. In the summer, Visa said it was expecting to close by the end of the year.\n  Plaid makes software that allows banks and fintechs to plug into consumers’ various financial accounts, enabling those companies, with users’ permission, to aggregate spending data, look up balances and verify other personal financial information. Its clients and partners include Venmo, the digital money-transfer service owned by  PayPal Holdings  ; stock-trading app Robinhood Markets Inc.; and mortgage-software startup Blend Labs Inc.\n  Visa and Mastercard have been  concerned about getting left behind if more people change how they make payments and use apps that, for example, enable bank-account-to-bank-account payments that essentially bypass the card networks.\n  Both companies have been buying firms in recent years that enable new types of payments.\n  Merchants, meanwhile, have been hoping that fintech companies such as Plaid would eventually help facilitate these new types of payments. That could allow merchants to  avoid the swipe fees that are set by networks such as Visa and Mastercard, which have long been a point of contention.\n  Plaid doesn’t currently operate a payments network like Visa’s, but Plaid’s software can see if a consumer is the owner of a given bank account and can look up how much money is in that account.\n  The Justice Department has spoken with merchant trade groups, people familiar with the matter said. It also has spoken with companies that work with Plaid, including PayPal, Stripe Inc., which allows internet companies to accept credit cards, cryptocurrency exchange Coinbase Inc. and Intuit, which makes TurboTax products, according to people familiar with the matter. PayPal was an early investor in Plaid.\n  Some of those interviewed told the department they were worried the acquisition could harm fintech companies’ ability to provide services, including limiting their ability to interact with banks on behalf of customers, those people said.\n  Write to AnnaMaria Andriotis at  annamaria.andriotis@wsj.com, Brent Kendall at  brent.kendall@wsj.com and Peter Rudegeair at  Peter.Rudegeair@wsj.com", "posttime": "2020-10-28 08:08:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,美国,美国司法部,nascent", "title": "消息来源：美国司法部正在仔细审查Visa收购Play的交易，这有助于金融科技的应用连接到用户的银行账户，因为这可能会限制新生的竞争", "title_en": "Sources: the DOJ is scrutinizing Visa's purchase of Plaid, which helps fintech apps connect to users' bank accounts, because it could limit nascent competition", "transed": 1, "url": "https://www.wsj.com/articles/visas-planned-purchase-of-plaid-faces-antitrust-scrutiny-at-the-justice-department-11603819000?mod=djemalertNEWS", "via": "", "real_tags": ["交易", "美国", "美国司法部", "nascent"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从新墨西哥沙漠到繁花似锦的托斯卡纳山，自然是D.H.劳伦斯非虚构类作品集的中心。", "note_en": "Nature is central to this collection of D. H. Lawrence’s nonfiction, from New Mexican deserts to flowering Tuscan hills.", "posttime": "2020-10-28 08:03:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阿奇,arch,沙漠", "title": "D·H·劳伦斯，“阿奇-异端邪说”", "title_en": "D. H. Lawrence, Arch-Heretic", "transed": 1, "url": "https://www.commonwealmagazine.org/arch-heretic", "via": "", "real_tags": ["阿奇", "arch", "沙漠"]}, {"category": "", "categoryclass": "", "imagename": "ab82237435918aa1638b94d4665f69e8.jpg", "infoid": 1031658, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "似乎2020年还没有从美国家庭身上夺走足够的东西，万圣节前夕将会有另一场侮辱。自1966年首播以来，“这是伟大的南瓜，查理·布朗”第一次不会在网络电视上播出。原因不会是莱纳斯·范佩尔特对这位半神称号的信心动摇。相反，就像露西把足球从查理·布朗手中拽走一样，AppleTV Plus抢占了“花生”节日特价节目的转播权。\n在一个层面上，这是一个关于流媒体服务的崛起和传统电视的衰落的商业故事。但这种万圣节主食的消亡也暗示了一个可怕的事实：本应为消费者带来更多便利的改变，越来越威胁到普通的文化体验-今年，这些体验已经供不应求。\n冠状病毒大流行撼动了万圣节，激发了距离友好的糖果递送降落伞，并警告乘坐干草车的危险。在严峻的现实已经闯入一个梦幻般的假期的情况下，为童年忧郁、充满想象力的世界提供了一个可爱的视角的“花生”特色菜，陷入成人商业之中，感觉特别不公平。\n长期以来，广受欢迎的电视剧和电影向流媒体平台的迁移一直是娱乐业-新闻报道-的主要内容，也是观众感到沮丧的一个来源，他们必须从一个渠道追逐到另一个渠道。\n尽管这些服务在开发原创内容上投入了大量资金，但传统节目和电影往往最受订户欢迎。\n“老友记”(Friends)和“办公室”(The Office)等情景喜剧在NBC最初播出很久之后，在Netflix上作为流媒体热门节目找到了新的生活和观众。当NBC推出自己的流媒体服务孔雀时，它想要收回这些服务就不足为奇了。去年11月推出的流媒体服务迪士尼+(Disney Plus)通过整合所有迪士尼品牌的家庭友好型娱乐项目，吸引了超过6000万订户，而此时，父母们正不顾一切地想要分散因流行病限制而疯狂的孩子们的注意力。早在2016年，“芝麻街”就搬到了HBO。\n难怪AppleTV Plus想要自己的G级内容库，并将转向“花生”，一个深深植根于美国人想象中的品牌，一个很容易为新节目和特价节目重新创造的品牌。\n多年来，“剪线”的倡导者一直认为，流媒体生态系统将改善昂贵的有线电视捆绑包。但这些订阅费仍然在增加：购买本专栏中提到的最基本的流媒体版本的访问权，每月的税前费用为40.97美元。\n流媒体的另一个理由是方便：订阅者可以随时随地观看任何他们想看的节目。不过，这种可定制的体验可能会让人感到孤立无援。观看电视节目或电影的最大乐趣之一就是与其他人一起观看，实时分享反应，并在第二天讨论(还记得过去我们实际上聚集在办公室饮水机周围的那个时代吗？)。Teleparty等服务可以同步用户的视频流，以便他们即使在身体上相距很远也可以一起看电影和电视。随着疫情将朋友和家人分开，打乱了电影和电视的日程安排，Teleparty等服务变得越来越受欢迎。\nAPPLETV Plus计划在相关节假日前后的短时间内向非订阅者免费播放“花生”特价节目。但就像HBO允许PBS在一段时间内独家播出“芝麻街”剧集一样，苹果的决定强调的是限制，而不是有限的可获得性。它强调，美国人现在有不同程度的机会接触到一些文化试金石，将父母可以支付额外服务的孩子与那些不能支付额外服务的孩子区分开来。\n这种差距不仅仅是钱的问题。2019年美国社区调查发现，13.4%的家庭根本没有互联网订阅。当新冠肺炎大流行让学区为那些还没有电脑的学生购买热点和笔记本电脑时，这种分歧爆发了更广泛的意识。\n而且并不是所有的互联网接入都是一样的。许多农村地区缺乏足够快的宽带服务，无法可靠地将学校和工作转移到网上，或者播放电视节目和电影。虽然没有电视的家庭数量正在增长-2015年为2.6%-但电视仍然是共同、集体体验和事件的媒介。如果你什么都不能播放，那三天免费播放的“这是伟大的南瓜，查理·布朗”就没有多大价值了。\n这场流行病已经夺走了美国儿童的东西，大到面对面的学习，大到苹果摇晃的平淡无奇。像家人一样坐下来看莱纳斯等待大南瓜的到来，知道数以百万计的其他人在同一时刻做着同样的事情，这是弥补不了美国人今年正在经历的深刻破坏和损失的。但在2020年，我们需要所有我们能得到的乐趣和社区感觉。", "note_en": "As if 2020 hasn’t taken enough from American families, Halloween will be marked by yet another indignity. For the first time since its 1966 debut, “ It’s the Great Pumpkin, Charlie Brown” won’t air on network television. The cause won’t be Linus Van Pelt’s wavering faith in the demi-god of the title. Rather, like Lucy yanking the football away from Charlie Brown, AppleTV Plus has  swooped up the rights to “Peanuts” holiday specials.\n On one level, this is a business story about the rise of streaming services and the decline of traditional television. But the death of this Halloween staple also suggests a spooky truth: A change that was supposed to bring more convenience for consumers increasingly threatens common cultural experiences — which, this year, are already in short supply.\n The  coronavirus  pandemic has shaken up Halloween, inspiring distancing-friendly chutes for candy delivery and warnings about the dangers of hayrides. With grim reality already intruding on a fantastical holiday, it feels particularly unfair for the “Peanuts” specials, which provide a lovely look at the melancholy, imaginative world of childhood, to get caught up in adult commerce.\n   The migration of beloved shows and movies to streaming platforms has long been a staple of entertainment business-news coverage — and a source of frustration to viewers, who must chase that programming from outlet to outlet.\n For all the money these services have plowed into developing original content, legacy shows and movies are often the most popular with subscribers.\n Sitcoms such as “Friends” and “The Office” found new lives, and audiences, as streaming hits on Netflix long after their original runs on NBC. It’s no surprise NBC wanted to reclaim them when it launched its own streaming service, Peacock. Disney Plus, the streaming service launched last November,  signed up more than 60 million subscribers by consolidating family-friendly entertainment from all the Disney brands at precisely the moment parents were desperate to distract children driven stir-crazy by pandemic restrictions. And, back in 2016, “Sesame Street” moved to HBO.\n   Little wonder that AppleTV Plus wants a G-rated content library of its own, and that it would turn to “Peanuts,” a brand deeply rooted in the American imagination and one easily reinvented for new shows and specials.\n For years, advocates of “ cord-cutting” have argued that the streaming ecosystem would improve on expensive cable bundles. But those subscriptions still add up: Buying access to the most basic streaming version of the services mentioned in this column would run $40.97 per month before tax.\n The other argument for streaming is convenience: Subscribers can watch anything on offer whenever, and pretty much wherever, they want. This customizable experience, though, can be isolating. One of the great pleasures of watching a television show or movie is doing it  with other people, sharing reactions in real time and discussing it the next day (remember that past age when we actually gathered around office water coolers?). Services such as  Teleparty, which sync up users’ video streams so they can watch movies and TV together even when they are physically distanced, have gained popularity as the pandemic has kept friends and families apart and  disrupted film and television schedules.\n   AppleTV Plus plans to  make  the “Peanuts” specials free to stream for nonsubscribers during short windows around relevant holidays. But as with HBO allowing PBS to air “Sesame Street” episodes after a period in which they’re exclusive to HBO, Apple’s decision emphasizes the restriction, not the limited availability. It underscores that Americans now have different levels of access to some cultural touchstones, dividing kids whose parents can shell out for extra services from those who can’t.\n That gap isn’t just about money. The 2019 American Community Survey  found that 13.4 percent of households had no Internet subscription at all. That divide burst into more widespread consciousness when the covid-19 pandemic left school districts struggling to buy hot spots and laptops for students who didn’t already have them.\n And not all Internet access is the same. Many rural areas lack broadband service that is  fast enough to reliably move school and work online, or stream television shows and movies. While the number of households  without a television is growing — it was 2.6 percent in 2015 — TV is still the medium for common, collective experiences and events. Three days of free streams of “It’s the Great Pumpkin, Charlie Brown” isn’t worth much if you can’t stream anything at all.\n   The pandemic has taken from American children things as large as in-person learning and as prosaic as apple-bobbing. Sitting down as a family to watch Linus wait for the arrival of the Great Pumpkin, knowing that millions of other people are doing the same thing at the same moment, wouldn’t make up for the profound disruptions and losses Americans are experiencing this year. But in 2020, we need all the fun and community feeling we can get.", "posttime": "2020-10-28 07:53:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "布朗,brown,服务", "title": "查理·布朗的万圣节特别节目今年不会在网络电视上播出", "title_en": "The Charlie Brown Halloween special won’t air on network television this year", "transed": 1, "url": "https://www.washingtonpost.com/opinions/2020/10/27/charlie-brown-halloween-special-great-pumpkin-streaming-apple-tv/", "via": "", "real_tags": ["布朗", "brown", "服务"]}, {"category": "", "categoryclass": "", "imagename": "61bd89dc48ced04ced994b6b48ed2f21.jpg", "infoid": 1031657, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本杰明·凯拉(Benjamin Kaila)是一名数据库管理员，1999年从印度移民到美国。每当他申请美国科技公司的工作时，他都会祈祷在面对面面试时没有其他印度人。这是因为凯拉是达利特人，或者说是印度社会等级体系中排名最低的种姓的成员，以前被称为“贱民”。\n硅谷的多样性问题是有据可查的：它仍然由白人和亚洲男性主导，黑人和拉丁裔工人的代表性仍然很低。但多年来，随着关于精英管理的辩论愈演愈烈，科技行业对印度工程师的依赖让另一种歧视愈演愈烈。像凯拉这样的达利特工程师表示，美国雇主没有能力解决这个问题。\n在过去20年的100多次合同工面试中，凯拉说，当另一名印度人亲自面试他时，他只得到了一份工作机会。凯拉说，当面试小组的成员都是印度人时，他会面临一些私人问题，这些问题似乎被用来查明他是否像大多数在科技行业工作的印度人一样，是上层种姓的成员。\n“他们没有提到种姓，但他们可以很容易地辨认出我们，”凯拉说，并喋喋不休地说出他可能是达利特人的所有方式，包括他皮肤较黑的事实。\n印度种姓制度遗留下来的歧视很少被讨论为硅谷持续存在的多样性问题的一个因素。科技行业数十年的劳工做法，比如从一小批顶尖学校招聘候选人，或者依赖高技能工人的H-1B签证系统，塑造了该行业技术劳动力的种族人口统计。尽管如此，达利特的工程师和倡导者表示，科技公司不理解种姓偏见，也没有明确禁止基于种姓的歧视。\n然而，近年来，达利特权利运动变得越来越全球化，包括倡导美国企业界的变革。6月，加利福尼亚州公平就业和住房部对思科及其两名前工程经理提起了一项里程碑式的诉讼，指控他们歧视达利特工程师。这两名经理都是上流社会的印度人。\n诉讼宣布后，达利特权利的非营利倡导组织平等实验室(Equity Labs)在三周内收到了近260名美国科技工作者关于种姓偏见的投诉，这些投诉是通过该组织的网站或发给个人员工的电子邮件进行的。执行董事Thenmozhi Soundarajan说，指控包括基于种姓的诽谤和笑话、欺凌、歧视性招聘做法、同行审查中的偏见以及性骚扰。索赔数量最多的是Facebook的员工(33人)，其次是思科(24人)、谷歌(20人)、微软(18人)、IBM(17人)和亚马逊(14人)。这些公司都表示，他们不容忍歧视。\n根据《华盛顿邮报》独家分享的一份声明，一群30名印度女工程师属于达利特种姓，在谷歌、苹果、微软、思科和其他科技公司工作，她们表示，她们在美国科技行业面临种姓偏见。\n由于担心遭到报复，这些女性在匿名的情况下分享了这份声明。她们认为，来自占主导地位的种姓的工程师网络在招聘、推荐和绩效评估方面偏袒她们的同龄人，复制了美国国内的偏见模式。\n“我们还必须经受对我们背景的贬低侮辱，我们的工作之所以取得，完全是因为采取了平权行动。”这让人精疲力竭。“他们写道。他说：“我们的工作做得很好，我们也是优秀的工程师。我们是我们社区的榜样，我们希望继续在我们的工作岗位上工作。但对我们来说，继续在敌对的工作场所工作，而不受种姓歧视的保护是不公平的。“。\n科技行业对印度工人的依赖程度越来越高。根据美国国务院的数据，自2009年以来，美国已经发放了超过170万份H-1B签证，其中65%发给了印度国籍的人。卡托研究所(Cato Institute)的移民政策分析师大卫·J·比尔(David J.Bier)表示，近70%的H-1B签证持有者在科技行业工作，而2003年这一比例不到40%。\n约翰·霍普金斯大学(Johns Hopkins University)南亚研究教授德维什·卡普尔(Devesh Kapur)发现，2003年，在美国的印度移民中，只有1.5%是达利特人或地位较低的种姓成员。\n大型科技公司的年度公司多样性报告通常不区分东亚或南亚工人，也不深入研究任何种族或性别的种姓、阶级或社会经济差异。平等实验室的Soundararajan表示，达利特工人的移民身份，包括需要雇主担保的签证和绿卡，使得他们很难公开反对他们声称的歧视。平等实验室正在进行一项正式调查，以跟进他们今年夏天收到的索赔。\n西雅图微软工程师拉格夫·考希克(Raghav Kaushik)说：“就像种族主义一样，堕落主义在美国和科技行业也很盛行。”考希克出生于一个占主导地位的种姓，但多年来一直参与倡导工作。“思科正在发生的事情不是一次性的；它表明了一种更大的现象。”\n思科发言人罗宾·布鲁姆(Robyn Blum)在一份声明中表示：“思科致力于为所有人创造一个包容性的工作场所。我们有强有力的流程来报告和调查员工提出的担忧，这些担忧可以追溯到2016年，并确定我们完全遵守了所有法律以及我们自己的政策。思科将针对本诉状中的指控大力为自己辩护。“。\n达利特工程师表示，大多数来自上层种姓的印度工人似乎没有意识到自己的种姓特权，并认为种姓偏见已经成为过去，尽管微软首席执行官萨蒂亚·纳德拉(Satya Nadella)和百事可乐(Pepsi)前首席执行官亚马逊董事会成员英德拉·努伊(Indra Nooyi)等备受瞩目的科技首席执行官和董事会成员都是婆罗门，或者说是最高种姓的成员。\n在一份声明中，Facebook发言人Nneka Norville说：“要为全世界提供服务，我们需要一个多样化和包容性的工作场所。我们培训管理人员，让他们了解来自不同背景的团队成员可能面临的问题，并开设课程帮助员工克服无意识的偏见。“。\n苹果公司发言人雷切尔·图利说：“在苹果公司，我们致力于为员工提供一个让他们感到安全、受到尊重并激励他们全力以赴工作的工作场所。我们有严格的政策，禁止任何歧视或骚扰，包括基于种姓的歧视或骚扰，我们还为所有员工提供培训，以确保我们的政策得到维护。“。\n谷歌发言人詹妮弗·罗德斯特罗姆(Jennifer Rodstrom)说：“我们的政策禁止在工作场所进行骚扰和歧视。我们调查任何指控，并对违反我们政策的员工采取坚决行动。“。\n微软发言人弗兰克·X·肖(Frank X.Shaw)表示，美国没有官方对微软种姓偏见的投诉。IBM和亚马逊均拒绝置评。(亚马逊首席执行官杰夫·贝佐斯拥有《华盛顿邮报》。)。\n种姓通常是通过问题来发现的，并不总是通过外表来发现。(尽管达利特人的肤色可能较深，但肤色并不等同于种姓。)。在美国工作的七名印度工程师在接受“华盛顿邮报”采访时表示，关于某人是否素食、在哪里长大、信奉什么宗教或与谁结婚的问题可能会被用作“种姓定位器”，与30名印度女工程师分享的声明无关。\n其他测试包括拍拍一名印度男子的背部，看看他是否戴着一些婆罗门(等级最高的种姓)佩戴的“圣线”。(这种手势有时被称为“Tam-Bram Pat”，指的是说泰米尔语的婆罗门。)。\n“华盛顿邮报”获得的2006年微软内部电子邮件显示，种姓偏见是该行业长期存在的问题。那一年，在印度政府宣布针对边缘化种姓的平权行动措施后，公司的一条帖子上爆发了一场辩论，主题是达利特候选人的门槛是否正在降低，以及他们固有的智力和职业道德。人力资源部进行了干预，但只是暂时关闭了该帖子。\n考希克(Kaushik)和普拉桑特·内马(Prashant Nema)表示，没有员工因为表达对达利特人的偏见而面临后果。内马目前是Facebook的性能和容量工程师，当时在微软工作。肖说，微软鼓励并促进所有员工的对话和反馈，但拒绝就2006年帖子的细节发表评论。\n考希克说，“如果说有什么不同的话，那就是”由于纳伦德拉·莫迪(Narendra Modi)当选为总理，“情况可能变得更糟了”，他的政府试图取消对达利特人的保护。“很多以前被压抑的想法，现在南亚人觉得更有底气大声说出来了.”\n最近匿名应用程序Blind上关于思科案件的讨论帖子显示，科技工人在2020年对Dalit工程师提出了同样的问题。\n在思科的诉讼中，原告是一名被确认为无名氏(John Doe)的印度工程师，他声称自己的薪酬较低，并拒绝提供机会，因为两位经理都知道他是达利特人。它还声称，在无名氏抱怨面临敌意的工作环境后，他面临着报复。\n这起诉讼最初是向联邦法院提起的，上周又向思科总部所在的圣克拉拉县的州法院重新提起诉讼。诉讼称，思科违反了加州公平就业和住房法案(California Fair Employee And Housing Act)，该法案禁止基于种族、宗教、国籍和血统的就业歧视。\n印第安纳大学布鲁明顿分校(Indiana University At Bloomington)法学教授凯文·布朗(Kevin Brown)表示，如果无名氏获胜，这将是第一起证明私营部门歧视达利特人的重大案件。20多年来，布朗一直在印度旅行，研究达利特人的权利运动。布朗说，这一决定将对科技公司在美国的业务产生明显影响，但也会提高这个问题对在印度运营的跨国公司的重要性。\n这30名女工程师敦促她们的雇主以及整个美国企业界将种姓列为受保护的类别，这样她们就可以放心地向人力资源报告这种类型的偏见。该组织包括几名为美国科技公司签约工作的工程师-通过跨国外包公司在美国和印度工作。然而，大多数女性目前都是居住在美国的科技员工。\n这些女工程师描述了来自主要种姓的印度工程经理，他们将她们排除在晋升机会之外，对达利特人和穆斯林妇女以及达利特保留地(印度政府对平权行动的称呼)开了不恰当的玩笑，在最糟糕的情况下，还让她们遭受性骚扰。\n达利特妇女说，她们移民到美国是为了逃避在印度顶尖工程学校遭受的欺凌和虐待，在那里，占主导地位的种姓成员质疑她们作为开发人员的能力。但精英学术中心，如印度理工学院(IITs)，也是科技人才流向硅谷的支线系统。\n例如，在思科的案例中，无名氏和揭发他的经理都毕业于印度理工学院孟买分校。\n“功绩的种姓：印度的工程教育”(The Case of Merit：Engineering Education in India)一书的作者、哈佛大学(Harvard)教授阿杰塔·萨布拉马尼亚(Ajantha Subramanian)表示，印度理工学院通过强大的校友网络“在美国科技文化中拥有巨大的影响力”，这些网络为年轻一代进入硅谷提供了便利。\n萨勃拉曼尼亚说：“虽然种姓偏见并不是印度理工学院独有的，但它在校园里很普遍，因为高种姓的教职员工和学生普遍认为高种姓的优点和低种姓的智力劣势。”“在思科的案例中，这些假设显然起到了作用。”\n被认定为达利特人的后果也可能导致同事的社会排斥，即使在办公室之外也是如此。思科的一名工程师和前承包商表示，在分享了一个批评婆罗门霸权的新闻故事后，他与其他思科员工暂时被从WhatsApp群中除名。\n印度工程师表示，他们并不总是相信美国人会理解种姓压迫背后的权力动态。在采访中，许多印度工程师引用了记者伊莎贝尔·威尔克森(Isabel Wilkerson)的畅销书《种姓：我们不满的根源》，书中辩称，美国对待黑人的方式是种姓等级制度的结果。\n尽管有直言不讳的风险，但达利特工程师和他们的盟友抓住了围绕历史种族主义的讨论，分享了他们对工作场所歧视的个人观察和经验。\n微软的考希克说，种姓偏见的盛行使得思科案件的结果变得更加紧迫。“那么微软怎么想、谷歌怎么想、亚马逊怎么想都无关紧要。他们必须注意法律。“", "note_en": "Whenever Benjamin Kaila, a database administrator who immigrated from India to the United States in 1999, applies for a job at a U.S. tech company, he prays that there are no other Indians during the in-person interview. That’s because Kaila is a Dalit, or member of the lowest-ranked castes within India’s system of social hierarchy, formerly referred to as “untouchables.”\n Silicon Valley’s diversity issues are well documented: It’s still dominated by White and Asian men, and Black and Latino workers remain underrepresented. But for years, as debates about meritocracy raged on, the tech industry’s reliance on Indian engineers allowed another type of discrimination to fester. And Dalit engineers like Kaila say U.S. employers aren’t equipped to address it.\n In more than 100 job interviews for contract work over the past 20 years, Kaila said he got only one job offer when another Indian interviewed him in person. When members of the interview panel have been Indian, Kaila says, he has faced personal questions that seem to be used to suss out whether he’s a member of an upper caste, like most of the Indians working in the tech industry.\n   “They don’t bring up caste, but they can easily identify us,” Kaila says, rattling off all of the ways he can be outed as potentially being Dalit, including the fact that he has darker skin.\n The legacy of discrimination from the Indian caste system is rarely discussed as a factor in Silicon Valley’s persistent diversity problems. Decades of tech industry labor practices, such as recruiting candidates from a  small cohort of top schools or relying on the H-1B visa system for highly skilled workers, have shaped the racial demographics of its technical workforce. Despite that fact, Dalit engineers and advocates say that tech companies don’t understand caste bias and have not explicitly prohibited caste-based discrimination.\n  In recent years, however, the Dalit rights movement has grown  increasingly global, including advocating for change in corporate America. In June, California’s Department of Fair Employment and Housing filed a landmark suit against Cisco and two of its former engineering managers, both upper-caste Indians, for discriminating against a Dalit engineer.\n   After the lawsuit was announced,  Equality Labs, a nonprofit advocacy group for Dalit rights, received complaints about caste bias from nearly 260 U.S. tech workers in three weeks, reported through the group’s website or in emails to individual staffers. Allegations included caste-based slurs and jokes, bullying, discriminatory hiring practices, bias in peer reviews, and sexual harassment, said executive director Thenmozhi Soundararajan. The highest number of claims were from workers at Facebook (33), followed by Cisco (24), Google (20), Microsoft (18), IBM (17) and Amazon (14). The companies all said they don’t tolerate discrimination.\n And a group of 30 female Indian engineers who are members of the Dalit caste and work for Google, Apple, Microsoft, Cisco and other tech companies say they have faced caste bias inside the U.S. tech sector, according to a statement shared exclusively with The Washington Post.\n  The women, who shared the statement on the condition of anonymity for fear of retaliation, argue that networks of engineers from the dominant castes have replicated the patterns of bias within the United States by favoring their peers in hiring, referrals and performance reviews.\n   “We also have had to weather demeaning insults to our background and that we have achieved our jobs solely due to affirmative action. It is exhausting,” they wrote. “We are good at our jobs and we are good engineers. We are role models for our community and we want to continue to work in our jobs. But it is unfair for us to continue in hostile workplaces, without protections from caste discrimination.”\n The tech industry has grown increasingly dependent on Indian workers. According to the State Department, the United States has issued more than 1.7 million H-1B visas since 2009, 65 percent of which have gone to people of Indian nationality. Close to 70 percent of H-1B visa holders work in the tech industry, up from less than 40 percent in 2003, says David J. Bier, an immigration policy analyst at the Cato Institute.\n Devesh Kapur, a professor of South Asian studies at Johns Hopkins University, found that  in 2003, only 1.5 percent of Indian immigrants in the United States were Dalits or members of the lower-ranked castes.\n   Big Tech’s annual company diversity reports typically don’t distinguish between East Asian or South Asian workers and do not delve into caste, class, or socioeconomic distinctions of any race or gender. And the immigration status of Dalit workers, including visas and green cards that require being sponsored by their employers, made it difficult for them to speak out against the discrimination they allege, says Soundararajan from Equality Labs, which is  conducting a formal survey to follow-up on the claims they received this summer.\n “Just like racism, casteism is alive in America and in the tech sector,” said Seattle-based Microsoft engineer Raghav Kaushik, who was born into a dominant caste but who has been involved in advocacy work for years. “What is happening at Cisco is not a one-off thing; it’s indicative of a much larger phenomenon.”\n  In a statement, Cisco spokesperson Robyn Blum said: “Cisco is committed to an inclusive workplace for all. We have robust processes to report and investigate concerns raised by employees which were followed in this case dating back to 2016, and have determined we were fully in compliance with all laws as well as our own policies. Cisco will vigorously defend itself against the allegations made in this complaint.”\n   Dalit engineers said that most Indian workers from upper castes do not seem aware of their caste privilege and believe caste bias is a thing of the past, despite the fact that  high-profile tech CEOs and board members, such as Microsoft CEO Satya Nadella and Amazon board member  Indra Nooyi, the former CEO of Pepsi, are Brahmins, or members of the highest caste.\n In a statement, Facebook spokesperson Nneka Norville said: “To build services for the whole world, we need a diverse and inclusive workplace. We train managers to understand the issues team members from different backgrounds may face and have courses to help employees counter unconscious bias.”\n Apple spokesperson Rachel Tulley said: “At Apple, we are dedicated to providing employees with a workplace where they feel safe, respected, and inspired to do their best work. We have strict policies that prohibit any discrimination or harassment, including based on caste, and we provide training for all employees to ensure our policies are upheld.”\n   Google spokesperson Jennifer Rodstrom said: “Our policies prohibit harassment and discrimination in the workplace. We investigate any allegations and take firm action against employees who violate our policies.”\n Microsoft spokesperson Frank X. Shaw said there are no official complaints of caste bias at Microsoft in the United States. IBM and Amazon declined to comment. (Amazon chief executive Jeff Bezos owns The Washington Post.)\n Caste is often discovered through questions, not always through appearance. (Although Dalits may have a darker complexion, skin color is not synonymous with caste.) Questions about whether someone is a vegetarian, where they grew up, what religion they practice or who they married may be used as a “caste locator,” seven Indian engineers working in the United States said in interviews with The Post, unrelated to the statement shared by 30 female Indian engineers.\n   Other tests include patting an Indian man on the back to see whether he is wearing a “sacred thread” worn by some Brahmins, the highest-ranked caste. (This gesture is sometimes referred to as the “Tam-Bram pat,” in reference to Tamil-speaking Brahmins.)\n Internal Microsoft emails from 2006 obtained by The Post indicate that caste bias is a long-standing problem within the industry. That year, after the Indian government announced affirmative action measures for marginalized castes, a debate broke out on a company thread about whether the bar was being lowered for Dalit candidates and about their inherent intelligence and work ethic. HR intervened but only to temporarily shut down the thread.\n No employees faced consequences for expressing bias against Dalits, according to Kaushik and Prashant Nema, currently a performance and capacity engineer at Facebook, who worked at Microsoft at the time. Shaw said Microsoft encourages and facilitates dialogue and feedback from all employees but declined to comment on the specifics of the 2006 thread.\n   “If anything, it’s probably gotten worse” since then because of the election of Narendra Modi as prime minister, whose administration has tried to  roll back protections for Dalits, Kaushik says. “A lot of the previously repressed ideas, now South Asians feel more emboldened to say it out loud.”\n  Recent discussion threads about the Cisco case on the anonymous app Blind show tech workers raising the same questions about Dalit engineers in 2020.\n In the Cisco suit, the complainant, an Indian engineer identified as John Doe, alleges he was paid less and denied opportunities because both managers knew he is Dalit. It also claims that Doe faced retaliation after he complained about facing a hostile work environment.\n The lawsuit, which was initially filed in federal court before being refiled last week in state court in Santa Clara County, where Cisco is headquartered, alleges that Cisco violated the California Fair Employment and Housing Act, which prohibits employment discrimination based on race, religion, national origin, and ancestry.\n If Doe wins, it will be the first major case to prove discrimination against Dalits in the private sector, says Kevin Brown, a law professor at Indiana University at Bloomington, who has been traveling to India and studying the Dalit rights movement for more than 20 years. Brown says the decision would have a clear impact on tech companies’ U.S. operations but also raise the importance of the issue for multinational companies operating in India.\n  The 30 female engineers are urging their employers, as well as corporate America at large, to include caste as a protected category, so that they feel comfortable reporting this type of bias to human resources. The group includes a few engineers who worked on contract for U.S. tech companies — both in the United States and India through multinational outsourcing companies. However, most of the women are currently tech employees living in the United States.\n The female engineers described Indian engineering managers from dominant castes who excluded them from opportunities for promotion, made inappropriate jokes about Dalit and Muslim women and about Dalit reservations (the Indian government’s term for affirmative action), and, in the worst cases, subjected them to sexual harassment.\n The Dalit women said they immigrated to the United States hoping to escape bullying and abuse they endured at India’s top engineering schools, where members of the dominant castes questioned their competence as developers. But elite academic centers, such as the Indian Institutes of Technology (IITs), also act as a feeder system for tech talent to Silicon Valley.\n In the Cisco case, for instance, both John Doe and the manager who outed him graduated from IIT Bombay.\n Harvard professor Ajantha Subramanian, author of “ The Caste of Merit: Engineering Education in India ,” says the IITs have an “outsized influence in U.S. tech culture” through powerful alumni networks that have facilitated the entry of a younger generation into Silicon Valley.\n “While caste bias is not unique to the IITs, it is pervasive on the campuses because of widely shared assumptions among upper-caste faculty and students about upper-caste merit and lower-caste intellectual inferiority,” Subramanian says. “Such assumptions were quite clearly in play in the Cisco case.”\n The consequences of being identified as Dalit can also lead to social exclusion by co-workers, even outside the office. One engineer and former contractor for Cisco said he was temporarily removed from a WhatsApp group with other Cisco workers after sharing a news story critical of Brahmin supremacy.\n Indian engineers said they did not always trust that Americans would comprehend the power dynamics underlying caste oppression. In interviews, many Indian engineers referenced journalist Isabel Wilkerson’s best-selling new book, “ Caste: The Origins of Our Discontents,” which argues that treatment of Black people in the United States is the result of a caste-based hierarchy.\n Despite the risks of speaking out, Dalit engineers and their allies have seized on the discussion around historic racism to share their individual observations and experiences about workplace discrimination.\n The prevalence of caste bias makes the outcome of the Cisco case more urgent, Microsoft’s Kaushik says. “Then it doesn’t matter what Microsoft thinks, it doesn’t matter what Google thinks, it doesn’t matter what Amazon thinks. They have to pay attention to the law.”", "posttime": "2020-10-28 07:52:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工程师,engineers,种姓", "title": "印度的工程师在硅谷茁壮成长。它的种姓制度也是如此", "title_en": "India’s engineers have thrived in Silicon Valley. So has its caste system", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/10/27/indian-caste-bias-silicon-valley/#click=https://t.co/x7aNRmpfF2", "via": "", "real_tags": ["工程师", "engineers", "种姓"]}, {"category": "", "categoryclass": "", "imagename": "2e613c712adbd465643c56df5669e210.jpg", "infoid": 1031656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个Gravitrax Marble Run包含多个塔、蛇、花招和一个雪崩，上面有1000多个彩虹所有颜色的大理石。重要信息：(请……", "note_en": "This Gravitrax Marble Run contains multiple towers, snakes, tricks and an Avalanche with more than 1000 marbles in all colors of the Rainbow. IMPORTANT: (ple...", "posttime": "2020-10-28 07:52:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gravitrax,marble", "title": "Gravitrax大理石与1000颗大理石一起运行", "title_en": "Gravitrax Marble Run with 1000 marbles", "transed": 1, "url": "https://www.youtube.com/watch?v=IRapyO6u1Ak", "via": "", "real_tags": ["gravitrax", "marble"]}]