[{"category": "", "categoryclass": "", "imagename": "37d4db356ff47f5020924c319f26a3fa.jpg", "infoid": 1068398, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "布里斯托尔在去年的技术投资者中特别受欢迎 - 在2020年的41400万美元令人印象深刻的地方，这是第三大U.K.的科技投资。根据WhiteCap的2019-2020生态系统报告，该市在伦敦外，伦敦境外也拥有伦敦境外最具金公司初创公司。\n 该市私营和公共部门实现现代化城市的努力已经帮助它在U.K的顶级智能城市中排名。，吸引了一种技术企业家。它靠近伦敦的意思是，创始人寻求更实惠的住宿是一个很好的选择，同时让他们挖掘资本的财务资源。布里斯托尔大学也拥有欧洲最大的机器人部门。\n   使用折扣码哈博德，每年或两年额外的紧缩成员节省25％。此优惠仅适用于U.K.和欧洲的读者，并于2021年8月31日到期。\n  布里斯托尔也是一个重要的启动加速器，套房。加速器支持五所沐浴大学，布里斯托尔，埃克塞特，南安普顿和萨里的合作努力支持超过4,000名企业家，并帮助他们的初创公司筹集了18亿英镑。其他启动支持员包括新的科学创建VC基金，由企业家哈利斯特克德克罗克（Techspark Engine Shed）设置。\n 来自布里斯托尔的关键新兴初创公司包括GraphCore，开放仿生学，UltraLeap，沉浸式实验室和五个AI。\n 为了更好地了解技术生态系统和该城市的投资者前景，我们调查了培育布里斯托尔初创生态系统的创始人，领导和高管。\n 该调查显示，该市拥有强大的可再生，零碳和Fintech启动景观。机器人，VR，BIO，量子，数字和深度技术也是显示承诺的领域。至于投资现场，虽然布里斯托尔有一个健康的天使网络，但这座城市缺乏机构VC，但与伦敦只有一个驾驶或火车骑行，这并没有证明是一个重大问题。 \n哪个部门是布里斯托尔的科技生态系统强劲？你最兴奋的是什么？它缺乏什么？ Bristol在可再生和零碳创新，Fintech和机器人方面都是强大的。它在工业4.0中疲软。\n 这是布里斯托尔最有趣的初创公司？ Graphcore，Lettus成长，开放仿生学，UltraLeap和YellowDog。\n 布里斯托尔的科技投资者是什么？他们的焦点是什么？我认为很多关于金融气的专注。\n 随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？其他人会搬进去吗？布里斯托尔是一个大型动态城市之间的一个伟大的中间地面（加上它离伦敦不远）和漂亮的乡村地区。通过遥控工作，我们可以预期它将在未来几年内吸引新居民。\n 谁是城市的主要创业人士（例如，投资者，创始人，律师，设计师）？ Aimee Skinner，Abigail Frear和Stuart Harrison。\n 您认为这座城市的技术场景将在五年内？ U.K.创新的第二大城市。\n  哪个部门是布里斯托尔的科技生态系统强劲？你最兴奋的是什么？它缺乏什么？ Bristol在媒体/动画，Edtech，社会影响，健康和科学方面都很强大。我最兴奋的是Edtech，并通过在线学习来实现数百万学生的可能性。它在硬件和金融气中较弱。 \n布里斯托尔的科技投资者是什么？他们的焦点是什么？有几种非常活跃的技术投资网络来自几个角度，例如，大学领导，私人天使组和技术孵化器。伟大的事情是他们都在发动机棚和硅峡谷等举措中合作和分享资源，想法和专业知识。\n 随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？其他人会搬进去吗？距离布里斯托尔有巨大的城市生活方式，距离乡村和西南/威尔士/威尔士度假胜地有着巨大的城市生活方式，距离市中心有20分钟路程。\n 谁是城市的主要创业人士（例如，投资者，创始人，律师，设计师）？布里斯托尔PE俱乐部的Jerry Barnes;在TechSpark的Abby Frear;在罗克马克斯州的Briony Phillips; Jack Jordan-Connelly在Setsquared。\n 您认为这座城市的技术场景将在五年内？它正在迅速发展，有很多支持，因此它将更大，吸引更多的投资，从现在开始，国际舞台上有五年。\n  哪个部门是布里斯托尔的科技生态系统强劲？你最兴奋的是什么？它缺乏什么？我们的技术生态系统在航空航天和国防部门的强劲。我们兴奋于该部门可用的数字转型机会的范围和规模。这一部门的主要弱点是转型速度缓慢，特别是由于流行病。\n  布里斯托尔的科技投资者是什么？他们的焦点是什么？与英国科技部门的平均水平相比，布里斯托尔有一个非常低的成立公司（4％对8％），种子阶段公司比例较高（42％对37％），死亡率较高（21％与17％ ％）。这是一个特别年轻的生态系统。\n 随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？其他人会搬进去吗？由于运输环节，强大的生态系统和城市美丽的美丽，人们搬出伦敦的人们将进入布里斯托尔。 \n您认为这座城市的技术场景将在五年内？如果布里斯托尔出来是欧洲旧金山的话，我不会感到惊讶！\n  哪个部门是布里斯托尔的科技生态系统强劲？它缺乏什么？ Bristol在Medtech，兽医，工业领域是强大的。\n 随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？其他人会搬进去吗？其他人已经搬进去了。\n  您认为这座城市的技术场景将在五年内？我们将在五年内看到大规模增长。\n  哪个部门是布里斯托尔的科技生态系统强劲？你最兴奋的是什么？它缺乏什么？我们的部门在研究人员之间的创业氛围中是薄弱的，因此来自领先的大学的深度科技纺场活动的低利率。我们最兴奋的是，我们在过去两年中看到的活动变化和文化转向创新。\n  布里斯托尔的科技投资者是什么？他们的焦点是什么？浅层科技中等强度;目前深入弱技术。\n 随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？其他人会搬进去吗？人们正在搬进去。 \n谁是城市的主要创业人士（例如，投资者，创始人，律师，设计师）？旋转科学，科学创造和科学天使综合。\n 您认为这座城市的技术场景将在五年内？深度技术与投资的当地企业家，孵化器和投资者群体非常强大。\n  哪个部门是布里斯托尔的科技生态系统强劲？你最兴奋的是什么？它缺乏什么？ Bristol在无线（5G，60 GHz等）中强大，半导体（特别是处理器，AI / ML和并行架构），机器人和其他硬技术/深度技术。\n  布里斯托尔的科技投资者是什么？他们的焦点是什么？它有限。有一些天使，但很少有集中的资金。\n 随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？其他人会搬进去吗？非常相似：人们选择生活在布里斯托尔/浴室以获得生活质量。大部分工作已经是外部 - 通勤到伦敦。\n 谁是城市的主要创业人士（例如，投资者，创始人，律师，设计师）？ Nigel Toon，Simon Knowles，Stan Boland，David May和Nick Sturge。\n 您认为这座城市的技术场景将在五年内？更强大，具有更多处理器和硬件活动。 \n哪个部门是布里斯托尔的科技生态系统强劲？你最兴奋的是什么？它缺乏什么？布里斯托尔有一个强大的机器人，航空航天和可再生能源。我最兴奋地了解布里斯托尔航空航天的遗产如何转化为未来的行业界定公司。生态系统在投资者方面薄弱，虽然伦敦VCS距离伦敦VCS少于两小时的火车之旅。\n  随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？其他人会搬进去吗？我相信布里斯托尔将变得更有吸引力。\n 谁是城市的主要创业人士（例如，投资者，创始人，律师，设计师）？在UltraLeap的Tom Carter，以及在开放仿生的乔尔吉布德。\n 您认为这座城市的技术场景将在五年内？靠近伦敦和剑桥。\n  哪个部门是布里斯托尔的科技生态系统强劲？你最兴奋的是什么？它缺乏什么？布里斯托尔拥有强大的生物技术，量子，数字，科学/深度科技生态系统。我是这个折衷的城市兴奋，有令人兴奋的人，思考不同的人。\n 这是布里斯托尔最有趣的初创公司？任何qtec，setsquared或Unitdx成员和校友。\n 布里斯托尔的科技投资者是什么？他们的焦点是什么？非常早起/新生，大多是天使。 \n随着遥控工作的转变，你认为人们会留在布里斯托尔或他们会搬出去吗？ 其他人会搬进去吗？ 可能搬进来！ 美丽的绿色空间，很多有趣，独立的商店。 （恰好）从伦敦通勤。  谁是城市的主要创业人士（例如，投资者，创始人，律师，设计师）？ 孵化器 -  QTEC，QTIC，Setsquared和UnitDX; 布里斯托尔私募股权俱乐部; Harry DesteCroix。  您认为这座城市的技术场景将在五年内？ 嗡嗡声。 更伟大的初创公司和vcs搬进来。 ", "note_en": "Bristol proved especially popular among tech investors last year — local businesses raked in an impressive $414 million in 2020, making it the third-largest U.K. city for tech investment. The city also has the most fintech startups per head in the U.K. outside London, according to  Whitecap’s 2019-2020 Ecosystem Report.\n Efforts by the city’s private and public sectors to modernize the city have helped it rank among the  top smart cities in the U.K., attracting a bevy of tech entrepreneurs. Its proximity to London has meant that it is a good alternative for founders looking for a more affordable stay while letting them tap the capital’s financial resources. The University of Bristol also has the largest robotics department in Europe.\n   Use discount code  HARBOURSIDE to  save 25% off an annual or two-year Extra Crunch membership. This offer is only available to readers in the U.K. and Europe, and expires on August 31, 2021.\n  Bristol is also home to an important startup accelerator,  SETsquared. A collaborative effort by the five universities of Bath, Bristol, Exeter, Southampton and Surrey, the accelerator has supported over 4,000 entrepreneurs and helped their startups raise a total of £1.8 billion. Other startup support players include the new  Science Creates VC fund, set up by entrepreneur  Harry Destecroix, and  TechSPARK  Engine Shed.\n Key emerging startups from Bristol include Graphcore, Open Bionics, Ultraleap, Immersive Labs and Five AI.\n To get a better idea of the state of the tech ecosystem and the investor outlook for this city, we surveyed founders, leaders and executives involved in nurturing Bristol’s startup ecosystem.\n The survey revealed that the city has a robust renewable, zero-carbon and fintech startup landscape. Robotics, VR, bio, quantum, digital and deep tech are also areas showing promise. As for the investing scene, although Bristol has a healthy angel network, the city lacks institutional VC, but with London only a drive or train ride away, this has not proved a significant problem.\n     Which sectors is Bristol’s tech ecosystem strong in? What are you most excited by? What does it lack? Bristol is strong in renewable and zero-carbon innovation, fintech and robotics. It’s weak in industry 4.0.\n Which are the most interesting startups in Bristol? Graphcore, LettUs Grow, Open Bionics, Ultraleap and YellowDog.\n What are the tech investors like in Bristol? What’s their focus? A lot of focus on fintech, I think.\n With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? Bristol is a great middle ground between a large dynamic city (plus it’s not far from London) and access to nice countryside area. With remote working we can expect it will attract new residents in the next few years.\n Who are the key startup people in the city (e.g., investors, founders, lawyers, designers)? Aimee Skinner, Abigail Frear and Stuart Harrison.\n Where do you think the city’s tech scene will be in five years? Second major city in U.K. innovation.\n  Which sectors is Bristol’s tech ecosystem strong in? What are you most excited by? What does it lack? Bristol is strong in media/animation, edtech, social impact, health and science. I’m most excited by edtech and the possibility to reach and positively impact millions of students via online learning. It’s weaker in hardware and fintech.\n  What are the tech investors like in Bristol? What’s their focus? There are several very active tech investment networks coming from several angles, e.g., university-led, groups of private angels and tech incubators. The great thing is they all collaborate and share resources, ideas and expertise in initiatives such as The Engine Shed and Silicon Gorge.\n With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? More people are moving in, as Bristol has a great urban lifestyle with easy access to the countryside and Southwest/Wales holiday spots, and an international airport 20 minutes from the center.\n Who are the key startup people in the city (e.g., investors, founders, lawyers, designers)? Jerry Barnes at Bristol PE Club; Abby Frear at TechSPARK; Briony Phillips at Rocketmakers; Jack Jordan-Connelly at SETsquared.\n Where do you think the city’s tech scene will be in five years? It’s developing rapidly with lots of support, so it will be bigger, attracting more investment and definitely more on the international scene five years from now.\n  Which sectors is Bristol’s tech ecosystem strong in? What are you most excited by? What does it lack? Our tech ecosystem is strong in the aerospace and defense sector. We are excited by the scope and scale of digital transformation opportunities with AI available in this sector. The main weakness in this sector is the slow pace of transformation, especially now due to the pandemic.\n  What are the tech investors like in Bristol? What’s their focus? Compared to the U.K. tech sector average, Bristol has a  very low proportion of established companies (4% versus 8%), a higher proportion of seed stage companies (42% versus 37%), and a higher death rate (21% versus 17%). It’s a particularly young ecosystem.\n With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? It is possible that people moving out of London will come into Bristol due to the transport links, strong ecosystem and beautiful nature of the city.\n Where do you think the city’s tech scene will be in five years? I wouldn’t be surprised if Bristol turns out to be San Francisco of Europe!\n  Which sectors is Bristol’s tech ecosystem strong in? What does it lack? Bristol is strong in the medtech, veterinary, industrial sectors.\n With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? Others have moved in.\n  Where do you think the city’s tech scene will be in five years? We will see massive growth in five years.\n  Which sectors is Bristol’s tech ecosystem strong in? What are you most excited by? What does it lack? Our sector is weak in entrepreneurial ambition among researchers, and so suffers from low rates of deep tech spinout activity from leading universities. We are most excited by the step change in activity we have seen in the past two years and culture shift towards innovation.\n  What are the tech investors like in Bristol? What’s their focus? Medium strength in shallow tech; currently weak in deep tech.\n With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? People are moving in.\n Who are the key startup people in the city (e.g., investors, founders, lawyers, designers)? Spin Up Science, Science Creates and Science Angel Syndicate.\n Where do you think the city’s tech scene will be in five years? Very strong in deep tech with an invested local community of entrepreneurs, incubators and investors.\n  Which sectors is Bristol’s tech ecosystem strong in? What are you most excited by? What does it lack? Bristol is strong in wireless (5G, 60 GHz, etc.), semiconductors (especially processors, AI/ML and parallel architectures), robotics and other hard tech/deep tech.\n  What are the tech investors like in Bristol? What’s their focus? It’s limited. There are some angels, but few locally focused funds.\n With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? Much the same: People choose to live in Bristol/Bath for quality of life. Much of the work is already external — commuting to London.\n Who are the key startup people in the city (e.g., investors, founders, lawyers, designers)? Nigel Toon, Simon Knowles, Stan Boland, David May and Nick Sturge.\n Where do you think the city’s tech scene will be in five years? Much stronger, with more processor and hardware activity.\n  Which sectors is Bristol’s tech ecosystem strong in? What are you most excited by? What does it lack? Bristol has a strong robotics, aerospace and renewables scene. I’m most excited to see how the legacy in aerospace in Bristol will translate to future industry-defining companies. The ecosystem is weak on the investor side, though London VCs are less than a two-hour train journey away.\n  With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? I believe Bristol will become more attractive.\n Who are the key startup people in the city (e.g., investors, founders, lawyers, designers)? Tom Carter at Ultraleap, and Joel Gibbard at Open Bionics.\n Where do you think the city’s tech scene will be in five years? Getting closer to London and Cambridge.\n  Which sectors is Bristol’s tech ecosystem strong in? What are you most excited by? What does it lack? Bristol has a strong biotech, quantum, digital, science-based/deep tech ecosystem. I’m excited by this eclectic city with exciting people that think differently.\n Which are the most interesting startups in Bristol? Any QTEC, SETsquared, or UnitDX members and alumni.\n What are the tech investors like in Bristol? What’s their focus? Very early/nascent, mostly angels.\n With the shift to remote working, do you think people will stay in Bristol or will they move out? Will others move in? Probably move in! Beautiful green spaces around, lots of interesting, independent shops. And (just about) commutable from London.\n Who are the key startup people in the city (e.g., investors, founders, lawyers, designers)? The incubators — QTEC, QTIC, SETsquared and UnitDX; Bristol Private Equity Club; Harry Destecroix.\n Where do you think the city’s tech scene will be in five years? Buzzing. More great startups and VCs moving in.", "posttime": "2021-06-26 15:17:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "深度,leaders,技术", "title": "8个创始人，领导者强调金融气和深度技术作为布里斯托尔的最高领域 ", "title_en": "\n\t\t\t\t8 founders, leaders highlight fintech and deep tech as Bristol’s top sectors\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/8-founders-leaders-highlight-fintech-and-deep-tech-as-bristols-top-sectors/", "via": "", "real_tags": ["深度", "leaders", "技术"]}, {"category": "", "categoryclass": "", "imagename": "cee1f3a3eb558739b3986835f4ad6078.jpg", "infoid": 1068397, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\n结构化沉积物的典型例子由大Auk的肉头（颅骨和喙）表示，以及铰接式牛椎骨和完整的陶器（可能是其内容）的完整陶器，沉积在Cnip的驾驶室墙壁后面，在刘易斯（苏格兰），在BC第三世纪（ARMIT Referenc ARMIT2006：198＆AMP）的建筑过程中。在这种情况下，这个“基金会存款”可能在新建筑及其居民的奉献中提供了促进作用。 Webley＆＃39; s（参考Webley2007）在英国南部后期青铜时代循环院的研究表明，制定了类似的存款，以表示建筑物的终结＆＃39。圆形楼层似乎已经被家庭碎片精心扫过了，提供了进一步证明某些物品故意留下的。在西南苏格兰的Broxmouth的后期钢铁时代沉降，例如，碟形型材和内壁面的底层证明了频繁的扫除造成的侵蚀（Büster＆amp; armit参考büster，armit，armit和McKenzie2013;图1）-A似乎已经提示后续铺设铺砌的地板表面。\n  遗憾的是，将这种证据标记为结构化存款，这反过来被用作仪式行为的代理，通常是解释过程结束的地方，并使我们更接近理解这种材料沉积背后的动机。考虑到更广泛的“缓存物体”范围内的这些汇编，并将自己的情绪依恋识别为“事物”（例如Bell＆amp; Spikins参考铃声和尖峰2018）可以帮助我们前进。\n “继续债券”理论是由现代丧亲研究（例如Klass等人）制定的悲伤的本质。传统方法强调了对死者的脱离（弗洛伊德·弗洛伊德。参考弗洛伊德，Strachey和Strachey1957），或者断言悲伤进程通过一系列单一的一系列阶段来恢复丧亲前的地位（Kubler-Ross参考Kubler-Ross1969; Bownby参考BowBy1973，参考BowBy1980; Worden参考Worden1991）。然而，悲伤比“恢复”的线性轨迹更复杂，（有意识或无意识地）个人经常形成“持续债券”，这些类型的终身关系持续到他们的生活中更大或更小的关系（ Shuchter＆amp; Zisook参考Shuchter，Zisook，Stroebe，Stroebe和Hansson1993：34;为了在考古背景下在持续债券理论中的应用，请参阅Croucher Reference Croucher2017）。\n 最近的一项研究探讨了考古学在讨论死亡，死亡和丧亲的适用性，医疗保健专业人士（Büster等人参考Büster，喝咖啡，日内，绿色和Faull2018; Croucher等人。参考克力，Büster，日，绿色，Raynsford，男孩和Faull2020）揭示了物体是维持持续债券的核心：\n 当我25岁的时候，我的妈妈突然死了，就在她去世之前，她买了一大浴缸[麦芽牛奶饮料]，她出于某种原因给我，因为她买了两个提供或其他东西，我不能扔掉它。它在橱柜里五年了！它是坚实的。但是因为她买了它，它变得像一个人工制品[...... ......我确实扔掉了它，我想这是我通过悲伤的象征（参与者20，在Büster等人参考文献büster ，蹲伏，日，绿色和faull2018：269）。\n Horlicks-A批量生产和廉价的物品，由死亡前几天收购，因为他们的日常购物旅行的一部分是通过“礼物给予”的行为（和时序）转变为一个情绪上充电的行为人工制品'：两个生物之间的最后一个物理相互作用的材料体现。失去的参与者解释说，虽然他们不喜欢Horlicks（也许在任何情况下都有不恰当的食物），但他们不能随便地处理这个“人工制品”。这不再只是一罐霍洛克斯：它已被转化为深刻有问题的东西。\n 同样的情绪以J.Brammer（参考Brammer2017）的话来回应，写下了清除她已故的母亲的艰巨任务＆＃39; \nWarning: Can only detect less than 5000 characters\n在任何地区或地区的地区，涉及坟墓挖掘的地区传统，有问题的东西的处置可能相当直截了当，因为它可以伴随着身体（或其残余物）的沉积。但是当没有坟墓存入它们时，这些物体发生了什么？例如，史前英国的社区中有问题的东西发生了什么，其主要的死亡方式涉及身体的完全分散通过弹性？人类仍然是有时纳入结构性沉积物。在少年城堡的坑中被切割的股骨粘合在凹坑中，多塞特（股票参考股份2010：239），只提供一个例子。这些骨骼肯定代表死者的令牌残余，从散落的遗骸中收集，这些尸体的尸体仍然是通过弹性的尸体，作为麦肯利（参考麦肯利，Tarlow和Stutz2013：154）类似地争论这一时期的火葬墓葬。考虑到这一点，这可能是不熟悉的，即1500年BC在欧洲大部分欧洲在欧洲的欧洲跨越欧洲的艰巨的迟到令人沮丧，随着武器囤积的增加，往往是经常相关的武器囤积的增加与孤立的人体骨骼并放置在水性上下文中（Fitzpatrick参考Fitzpatrick，Cunliffe和Miles1984; Bradley参考Bradley和Fagan1996：306; Barrett＆amp; Createrham参考Barrett，Centerham，Barrett和Kinnes1988）。相反，欧洲大陆欧洲大陆乌尔涅菲尔德（平墓）墓地的出现（C.1050 BC）在河流中沉积物体的沉积时恰逢令人沮丧（FO\n...... ", "note_en": "Deliberately deposited (or cached) objects are ubiquitous in the archaeological record, yet they are often classified under different categories, such as hoards, structured deposits, grave goods and cenotaph burials, and interpreted according to different criteria. Drawing on contemporary attitudes to death, dying and bereavement, and using later prehistoric Britain as a case study, this article brings the analysis of these objects together within a single interpretive framework, which asserts that much of this material represents the ‘problematic stuff’ left behind by the dead. This approach forces us to reconsider the traditional boundaries drawn between different aspects of the archaeological record and demonstrates the value that emotion has in our interpretations of past societies.\n    Copyright © The Author(s), 2021. Published by Cambridge University Press on behalf of Antiquity Publications Ltd.\n  Various labels are assigned to the deliberately deposited objects recognised in the archaeological record, including hoards, structured deposits and grave goods. Hoards, often comprising metal objects, are usually defined on the basis of their isolated contexts and the perceived quality or quantity of their contents (e.g. Bradley  et al.   Reference Bradley, Haselgrove, Linden and Webley2013: 209). They are traditionally given over to finds specialists. In contrast, grave goods accompanying the dead, inhumed or cremated, lie within the realm of funerary archaeology. Finally, ‘structured deposition’ is a catch-all term given to objects cached in other contexts, often found on settlement sites, for example, in pits, ditches and buildings (cf. Hill   Reference Hill1995). Although these categories of objects are interpreted as the residue of ritual activity, the nature of such ritual behaviour is understood to be distinct in each case. The high material value of hoards leads to the interpretation of their deposition either for safe keeping or, more often, as propitiatory offerings (Bradley   Reference Bradley and Fagan1996: 305). Meanwhile, our tendency to focus on the human body relegates grave goods to the role of  accompanying the dead, either for use in the afterlife or as dedications by mourners (e.g. Parker Pearson   Reference Parker Pearson1999: 7). Structured deposits—by nature a generic category—have been interpreted in more varied and less specific ways (for an overview, see Garrow   Reference Garrow2012). The addition of descriptive terms to highlight differences in composition and depositional context—for example, deliberate, formal, placed, ritual, selected, special, token (Brudenell &amp; Cooper   Reference Brudenell and Cooper2008: 15–16)—adds yet more categories.\n The classification of assemblages described above, based on non-mutually exclusive characteristics, has created unhelpful divisions that hinder our understanding. Structured deposits that include disarticulated human bone, but which are found in settlements, for example, fall outside the focus of mainstream funerary archaeology, while groups of ‘bodiless objects’ within cemeteries—that is, those objects which appear never to have accompanied the deposition of a body—are frequently categorised as ‘cenotaphs’ (e.g. Nilsson Stutz &amp; Tarlow   Reference Nilsson Stutz, Tarlow, Tarlow and Nilsson Stutz2013: 6) in recognition of their probable mortuary associations. Such distinctions have served to elevate the presence of the physical remains of the human body over other types of material, and have thus limited the scope of our interpretations (Brudenell &amp; Cooper   Reference Brudenell and Cooper2008: 25–29). With this in mind, I discuss these various assemblage classes under the umbrella term ‘cached object’ (see Archaeological Institute of America  2020).\n Using later prehistoric Britain as a case study, I use contemporary theories of death, dying and bereavement to suggest that cached objects frequently represent the careful deposition of ‘problematic stuff’ left behind by the dead. This recognition is not intended to identify new types of deposit, nor necessarily to replace existing interpretations, but rather to unite previously divided materials under a common interpretive lens. The objective is to demonstrate that ‘emotional value’ is a legitimate consideration in our understanding of ‘cached’ objects in the archaeological record.\n In contrast to the monumental ritual landscapes of the preceding periods, the archaeological record of later prehistoric Britain, from around 1800 BC, is predominantly ‘domestic’ in character (Brück   Reference Brück1995: 245). With rare regional exceptions (e.g. the Arras Culture in East Yorkshire and the Aylesford-Swarling Culture in south-east England; Stead   Reference Stead1991; Fitzpatrick   Reference Fitzpatrick2007), visible normative burial rites and dedicated funerary monuments are rare (see Harding   Reference Harding2016). There are few formal cemeteries from this period and human remains are elusive. If recovered at all, bones are usually isolated and frequently deposited in settlement contexts (Brück   Reference Brück1995; Armit   Reference Armit, Bradbury and Scarre2017). Indeed, it seems likely that most of the dead were excarnated—defleshed and disarticulated by natural or artificial means (Carr &amp; Knüsel   Reference Carr, Knüsel, Gwilt and Haselgrove1997)—rather than interred in graves. At this time settlements became the focus of ritual activity, and the artefacts we find on such sites probably represent selective deposition, rather than the product of casual loss and discard (e.g. Hill   Reference Hill1995; Bradley   Reference Bradley2005: 33 &amp; 208–209).\n This selectivity is indicated by the unusual distributions of artefacts on later prehistoric settlements in Britain, and the frequent occurrence of ‘structured deposits’: a catch-all term for caches of objects and animal bones (and occasionally human remains; Brück   Reference Brück1995; Armit   Reference Armit, Bradbury and Scarre2017) that were carefully selected and deposited in specific places (e.g. in ditch terminals, roundhouse entrance postholes, pits) at specific times. The term was originally coined in reference to an apparent patterning in the deposition of objects (such as pottery, bone and flint) at Neolithic ritual monuments (Richards &amp; Thomas   Reference Richards, Thomas, Bradley and Gardiner1984), but has since been adopted more widely to describe a variety of cached objects on domestic sites (e.g. Hill   Reference Hill1995).\n A typical example of a structured deposit is represented by the fleshed head (cranium and beak) of a great auk, along with articulated cattle vertebrae and a complete pottery vessel (possibly with its contents), deposited behind the wall of a wheelhouse at Cnip, on Lewis (Scotland), during its construction in the third century BC (Armit   Reference Armit2006: 198 &amp; 220–21). In this instance, this ‘foundation deposit’ presumably served a propitiatory role in the dedication of the new building and its inhabitants. Webley&#39;s (  Reference Webley2007) study of Late Bronze Age roundhouses in southern England demonstrates that similar deposits were made to signify the end of a building&#39;s life. Roundhouse floors appear to have been meticulously swept clean of domestic debris, providing further evidence that certain objects were deliberately left behind. At the Late Iron Age settlement at Broxmouth in south-east Scotland, for example, dished floor profiles and the undercutting of inner wall-faces attest to the erosion caused by frequent sweeping-out (Büster &amp; Armit   Reference Büster, Armit, Armit and McKenzie2013;  Figure 1)—a process that appears to have prompted the subsequent laying of paved floor surfaces.\n  Unfortunately, the labelling of such evidence as structured deposits, which in turn is used as a proxy for ritual behaviour, is often where the interpretive process ends, and brings us no closer to understanding the motives behind the deposition of this material. Considering these assemblages within a broader spectrum of ‘cached objects’ and recognising our own emotional attachment to ‘things’ (e.g. Bell &amp; Spikins   Reference Bell and Spikins2018) may, however, help us to move forward.\n ‘Continuing bonds’ theory was developed by modern bereavement studies (e.g. Klass  et al.   Reference Klass, Silverman and Nickman1996; Walter   Reference Walter1996; Stroebe  et al.   Reference Stroebe, Abakoumkin, Stroebe and Schut2012), growing out of a dissatisfaction with common perceptions of the nature of grief. Traditional approaches emphasised the need for detachment from the deceased (Freud trans.   Reference Freud, Strachey and Strachey1957), or asserted that the grieving process progressed through a unilinear series of stages towards the restoration of a pre-bereavement status quo (Kubler-Ross   Reference Kubler-Ross1969; Bowlby   Reference Bowlby1973,   Reference Bowlby1980; Worden   Reference Worden1991). Grief, however, is far more complex than a linear trajectory of ‘recovery’, and (consciously or unconsciously) individuals often form ‘continuing bonds’ with the dead—new types of relationships that endure to a greater or lesser extent throughout their lives (Shuchter &amp; Zisook   Reference Shuchter, Zisook, Stroebe, Stroebe and Hansson1993: 34; for the application of continuing bonds theory in an archaeological context, see Croucher   Reference Croucher2017).\n A recent study exploring the applicability of archaeology in discussions of death, dying and bereavement with healthcare professionals (Büster  et al.   Reference Büster, Croucher, Dayes, Green and Faull2018; Croucher  et al.   Reference Croucher, Büster, Dayes, Green, Raynsford, Boyes and Faull2020) reveals that objects are central to the maintenance of continuing bonds:\n my mum died very suddenly when I was 25 […] and just before she died, she&#39;d bought a big tub of Horlicks [a malted-milk drink powder] which she gave to me for some reason, because she bought two on offer or something, and I could not throw this away. It was in the cupboard for five years! And it was solid. But because she&#39;d bought it, it became like an artefact […] I did throw it away in the end, I suppose it was a symbol of my getting through the grief (participant 20, in Büster  et al.   Reference Büster, Croucher, Dayes, Green and Faull2018: 269).\n The jar of Horlicks—a mass-produced and inexpensive item, acquired by the deceased only days before their death as part of a routine shopping trip—was transformed through the act (and timing) of ‘gift-giving’ into an emotionally charged ‘artefact’: the material embodiment of the last physical interaction between two living individuals. The bereaved participant explained that, although they did not like Horlicks (and perhaps it would have felt inappropriate to consume it in any case), they could not casually dispose of this ‘artefact’. This was no longer  just a jar of Horlicks: it had been transformed into something deeply problematic.\n The same sentiments are echoed in the words of J. Brammer (  Reference Brammer2017), writing about the difficult task of clearing out her late mother&#39;s house:\n So, when is a doily not a doily? When it goes from being one of my mother&#39;s kitsch furniture accessories when she was alive, into a sacred reminder of her homeliness now that she&#39;s gone […] The significance of the doilies and anything she had touched, grew overnight […] I decided to honour her by framing and hanging them so her story could be woven into the walls of my home.\n Here we see previously old-fashioned and ‘unnecessary’ ephemera taking on new meanings and becoming problematic, not because of their material or aesthetic value, but because of their mnemonic power. If we accept the possibility for emotional attachment to even the most mundane objects, then, as Brudenell and Cooper (  Reference Brudenell and Cooper2008: 24) point out, “ any attempt to define rigid criteria for identifying ‘special’ deposits may ultimately miss the point”.\n There are many examples in the archaeological record of attempts to maintain continuing bonds with the dead, not least in the erection of large funerary monuments that served as mnemonic devices for the living. Equally visible, particularly as structured deposits, but perhaps as yet unrecognised, is the disposal of the problematic stuff that bound the living and the dead together: material that was too entwined with the social identity of the dead to be reused by the living, yet too symbolically charged for casual discard as part of normal processes of waste management.\n The material value of certain artefacts has long been recognised, as signified, for example, through cultural preferences for particular raw materials, the time and skill involved in the manufacture of certain objects, or their rare and exotic nature. It is this form of value that is often prioritised in our understanding and categorisation of hoards. Increasingly, however, materiality (e.g. Meskell   Reference Meskell2005) and biographical (e.g. Gosden &amp; Marshall   Reference Gosden and Marshall1999; Joy   Reference Joy2009) approaches to the study of artefacts have also championed the symbolic value that certain objects may have possessed as material manifestations of distant lands, the product of technological transformations or their embodiment of other (intangible) properties. Interpretations of this nature often influence our understandings of grave goods. But recognition of problematic stuff as a legitimate and powerful response to even the most mundane objects, such as the aforementioned jar of Horlicks, dictates that we include another important value category in our discussion and interpretation: emotion ( Figure 2). It is through this lens that we might better understand the ritual behaviours that led to the caching of objects in the archaeological record. It is, of course, not necessarily the case that any object chosen for or warranting deposition in a controlled and structured way embodies a single value category. Indeed, once such artefacts are brought together, the resulting assemblages will themselves take on new meanings. But it is important to recognise the raw emotional power that everyday objects can acquire at certain times and places.\n In the few areas of Iron Age Britain where a normative visible burial rite exists, bodies are often associated with artefacts (grave goods). The inhumations and chariot burials of the Arras Culture of East Yorkshire, for example, contain some of the most spectacular objects known from this period, including brooches featuring enamel and coral inlay, and elaborate necklaces of glass and amber (Giles   Reference Giles2012). Many of these items presumably belonged to the deceased, or were sufficiently entwined with their social identity to necessitate removal from circulation upon their death.\n Yet, it is not just those items worn on the body that can assume problematic status. We must also consider other categories of artefact ( Figure 3). Objects also become problematic through their association  with the dead body, via, for example, their use in post-mortem care and mortuary rites. This category of object may well be represented by the toilet instruments (e.g. tweezers, nail cleaners and ear scoops) found in graves at Mill Hill (Deal), King Harry Lane (St Albans) and Biddenham Loop (near Bedford) in southern England, and at Arras and Wetwang Slack in East Yorkshire (Harding   Reference Harding2016: 179–80), as well as in later prehistoric graves on the Continent (Fontijn   Reference Fontijn2002: 200–201). Notably, these objects have also been recovered from structured deposits in regions in which formal graves are absent: the nail-cleaner built into the wall of ‘Hut II’ at Hownam Rings in the Scottish Borders (Piggott   Reference Piggott1948: 211) represents one such example. Then come the items owned by the deceased: objects such as those represented in the modern-day quotations presented above. Analogies for these different categories of object have precedence elsewhere. In the medieval Christian church, for example, relics could comprise the physical remains of a saint&#39;s body (‘first class’), objects owned or used by a saint (‘second class’), or objects that had touched a first- or second-class relic (‘third-class’) (Jestice   Reference Jestice and Jestice2004: 887).\n  We could also add an additional tier of problematic stuff: the artefacts associated with the past lives of those still living, such as previous social states transcended through certain rites of passage, or objects that represent “the paraphernalia of a specific kind of personhood” (Fontijn   Reference Fontijn2002: 217). In a modern context, this might manifest itself in the reluctance of parents, for example, to dispose of the infant clothes of grown-up children, with one social media user lamenting that “I have a bag for charity and a bag called ‘I&#39;m not ready to let go yet’”. Other examples might include the retention by adults of teenage clothes that no longer fit or are no longer fashionable, or of cassette tapes that can no longer be played. While such phenomena will be difficult to recognise in the archaeological record, they might be glimpsed, for example, in the inclusion of worn-out objects or miniatures in (adult) graves. Miniature items are often interpreted as ‘votives’ (e.g. Green   Reference Green1987). Using a different interpretive lens, however, there is no reason to discount the possibility that such objects might represent a cherished childhood toy, such as the diminutive sword in its wooden scabbard found in the grave of two adults at the Roman cemetery of Cranmer House, Canterbury (Bennett   Reference Bennett, Frere, Bennett, Rady and Stow1987: 66). Problematic stuff might also be evidenced by the inclusion of adult-sized objects in children&#39;s graves; that is, objects—such as the three copper rings interred with a child at Barrow Hills in Oxfordshire (Brück   Reference Brück2004: 314)—that were destined for individuals who did not live long enough to wear them.\n In any region or period with mortuary traditions that involved the digging of graves, the disposal of problematic stuff would potentially have been fairly straightforward, as it could have accompanied the deposition of the body (or its remnants). But what happened to these objects when there was no grave in which to deposit them? What happened to problematic stuff in the communities of later prehistoric Britain, for example, whose predominant mode of disposal of the dead involved the complete dispersal of the body through excarnation? Human remains are themselves sometimes incorporated into structured deposits. The femur interred with a weaving comb and copper alloy fibula in a pit at Maiden Castle, Dorset (Sharples   Reference Sharples2010: 239), provides just one example. These bones surely represent ‘token’ remnants of the deceased, collected from the scattered remains of bodies that had been defleshed and disarticulated through excarnation, as McKinley (  Reference McKinley, Tarlow and Stutz2013: 154) similarly argues for cremation graves of this period. With this in mind, it is perhaps unsurprising that a downturn in the construction of barrows, and the associated interment of bodies and grave goods, across much of Europe after 1500 BC coincides with an increase in the deposition of weapon hoards, which are frequently associated with isolated human bones and placed in watery contexts (Fitzpatrick   Reference Fitzpatrick, Cunliffe and Miles1984; Bradley   Reference Bradley and Fagan1996: 306; Barrett &amp; Needham   Reference Barrett, Needham, Barrett and Kinnes1988). Conversely, the emergence of large Urnfield (flat grave) cemeteries across continental Europe in the Late Bronze Age ( c. 1050 BC) coincides with a downturn in the deposition of objects in rivers (Fo\n......", "posttime": "2021-06-26 15:10:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缓存,stuff,参考", "title": "'有问题的东西'：死亡，记忆和缓存对象的解释 ", "title_en": "‘Problematic stuff’: death, memory and the interpretation of cached objects", "transed": 1, "url": "https://www.cambridge.org/core/journals/antiquity/article/problematic-stuff-death-memory-and-the-interpretation-of-cached-objects/FEFB14E4C357F336710BA78CF27048AF", "via": "", "real_tags": ["缓存", "stuff", "参考"]}, {"category": "", "categoryclass": "", "imagename": "75a9cc1b6393d9a1e22cbfa337298e13.png", "infoid": 1068396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用逻辑时间戳作为值的版本，以允许跨服务器排序值\n  当存储在多个服务器上的值时，需要一种了解在另一个之前存储的值存储的方式。无法使用系统时间戳，因为壁时钟不是两个不同服务器的单调和时钟值不应进行比较。\n 表示当天时间的系统时间戳由通常用晶体振荡器构建的时钟机械测量。这种机制的已知问题是，基于晶体振荡的快速或慢速，它可以远离当天的实际时间。为了解决此问题，计算机通常具有像NTP这样的服务，它同步互联网上具有众所周知的时间源的计算机时钟。因此，给定服务器上系统时间的两个连续读数可以有时间倒退。\n 由于跨服务器的时钟漂移没有上限，因此无法比较两个不同的服务器上的时间戳\n mvccstore mvccstore; Lamportclock时钟;公共服务器（mvccstore mvccstore）{this.clock =新的Lamportclock（1）;这个.mvccstore = mvccstore; }\n 每当服务器执行任何写入操作时，它应该使用`tick（）`方法前进LAMPORT时钟\n   这样，服务器可以确定在请求之后按下写入，并且在任何其他操作之后服务器已经执行了，因为客户端由客户启动。服务器返回用于将值写入客户端的时间戳。然后，请求客户端使用此时间戳对其他服务器进行任何进一步写入。这样，维持请求的因果链。 \n考虑使用多个服务器节点的简单键值存储的示例。有两个服务器，蓝色和绿色。每个服务器都负责存储特定的键组。当数据在一组服务器上划分数据时，这是一个典型的方案。使用LAMPORT时间戳作为版本号存储为版本值的值。\n   接收服务器对其自己的时间戳进行比较和更新并使用它来编写版本化的键值。 public int write（string key，string值，int equestimestamp）{//更新自己的时钟来反映因果关系int writeattimestamp = clock.tick（equestTimestamp）; mvccstore.put（新版本的key（key，writeattimestamp），值）;返回writeattimestamp; }\n 用于写入该值的时间戳返回给客户端。客户端通过更新自己的时间戳来跟踪最大时间戳。它使用此时间戳来发出任何进一步的写入。\n  Lamportclock时钟=新的Lamportclock（1）; public void write（）{int server1writtenat = server1.write（＆＃34;姓名＆＃34;＆＃34; alice＆＃34;，clock.getlatesttime（））; clock.updateto（server1writtenat）; int server2writtenat = server2.write（＆＃34;标题＆＃34; servervices＆＃34;，clock.getlatesttime（））; clock.updateto（server2writtenat）; asserttrue（server2writtenat＆gt; server1writtenat）; }\n    即使客户端与带有领导者和追随者组的领导者通信的当客户端，每个组都有相同的技术也适用于特定键。客户向本集团的领导者发送请求，如上所述。 LAMPORT时钟实例由该组的领导者维护，并且可以更新与上一节中讨论的完全相同的方式。\n Lamport时钟存储的值仅部分排序。如果两个客户端存储两个单独的服务器中的值，则时间戳值不能用于在服务器上排序。在以下示例中，Bob上的Bob存储的标题在时间戳2处。但是如果Bob存储在Alice上或在Server Blue上的名称中存储了名称之后，则无法确定。\n 对于单个领导者 - 跟随服务器组，其中一个领导者总是负责存储值，版本化值中讨论的基本实现足以维护因果关系。 \n在这种情况下，键值存储可以保留整数符号。 每次从写导向日志应用键值写命令时，它会递增版本计数器。 然后它用递增版本计数器构造新密钥。 只有领导者负责递增版本计数器，追随者使用相同的版本号。  int版本= 0; mvccstore mvccstore = new mvccstore（）; @Override公共完成肥料＆lt;响应＆gt; 放（字符串键，字符串值）{return server.propose（new setvalueCommand（key，value））; 私人响应applysetvaluecommand（setvaluecommand setvaluecommand）{getlogger（）。信息（＆＃34;设置键值＆＃34; + setvalueCommand）; 版本=版本+ 1; mvccstore.put（新版本的key（setvaluecommand.getkey（），版本），setvaluecommand.getValue（））; 响应响应= response.success（版本）; 回复响应; }  数据库如[MongoDB]和[蟑螂]使用Lamport时钟的变型来实现[MVCC]存储 ", "note_en": "Use logical timestamps as a version for a value to allow ordering of values across servers\n  When values are stored across multiple servers, there needs to be a way to know which values were stored before the other. The system timestamp can not be used, because  wall clocks are not monotonic and clock values from two different servers should not be compared.\n The system timestamp, which represents the time of the day, is measured by a clock machinery generally built with an crystal oscillator. The known problem with this mechanism is that it can drift away from the actual time of the day, based on how fast or slow the crystals oscillate. To fix this, computers typically have a service like  NTP which synchronizes computer clocks with well known time sources on the internet. Because of this, two consecutive readings of the system time on a given server can have time going backwards.\n As there is no upper bound on clock drift across servers, it is impossible to compare timestamps on two different servers\n MVCCStore mvccStore; LamportClock clock; public Server(MVCCStore mvccStore) { this.clock = new LamportClock(1); this.mvccStore = mvccStore; }\n Whenever a server carries out any write operation, it should advance the Lamport Clock, using the `tick()` method\n   This way, the server can be sure that the write is sequenced after the request and after any other action the server has carried out since the request was initiated by the client. The server returns the timestamp that was used for writing the value to the client. The requesting client then uses this timestamp to issue any further writes to other set of servers. This way, the causal chain of requests is maintained.\n  Consider an example of a simple key value store with multiple server nodes. There are two servers, Blue and Green. Each server is responsible for storing a specific set of keys. This is a typical scenario when data is partitioned across a set of servers. Values are stored as  Versioned Value with the Lamport Timestamp as a version number.\n   The receiving server compares and updates its own timestamp and uses it to write a versioned key value.   public int write(String key, String value, int requestTimestamp) { //update own clock to reflect causality  int writeAtTimestamp = clock.tick(requestTimestamp); mvccStore.put(new VersionedKey(key, writeAtTimestamp), value); return writeAtTimestamp; }\n The timestamp used for writing the value is returned to the client. The client keeps track of the maximum timestamp, by updating its own timestamp. It uses this timestamp to issue any further writes.\n  LamportClock clock = new LamportClock(1); public void write() { int server1WrittenAt = server1.write(&#34;name&#34;, &#34;Alice&#34;, clock.getLatestTime()); clock.updateTo(server1WrittenAt); int server2WrittenAt = server2.write(&#34;title&#34;, &#34;Microservices&#34;, clock.getLatestTime()); clock.updateTo(server2WrittenAt); assertTrue(server2WrittenAt &gt; server1WrittenAt); }\n    The same technique works even when the client is communicating with a leader with  Leader and Followers groups, with each group responsible for specific keys. The client sends requests to the leader of the group as detailed above. The Lamport Clock instance is maintained by the leader of the group, and is updated exactly the same way as discussed in the previous section.\n The values stored by Lamport Clock are only  partially ordered. If two clients store values in two separate servers, the timestamp values cannot be used to order the values across servers. In the following example, the title stored by Bob on server Green is at timestamp 2. But it can not be determined if Bob stored the title before or after Alice stored the name on server Blue.\n For a single leader-follower group of servers, where a leader is always responsible for storing values, the basic implementation discussed in  Versioned Value is enough to maintain causality.\n   In this case, the key value store keeps an integer version counter. It increments the version counter every time the key value write command is applied from the Write Ahead Log. It then constructs the new key with the incremented version counter. Only the leader is responsible for incrementing the version counter, and followers use the same version number.\n  int version = 0; MVCCStore mvccStore = new MVCCStore(); @Override public CompletableFuture&lt;Response&gt; put(String key, String value) { return server.propose(new SetValueCommand(key, value)); } private Response applySetValueCommand(SetValueCommand setValueCommand) { getLogger().info(&#34;Setting key value &#34; + setValueCommand);  version = version + 1; mvccStore.put(new VersionedKey(setValueCommand.getKey(), version), setValueCommand.getValue()); Response response = Response.success(version); return response; }\n Databases like  [mongodb] and  [cockroachdb] use variants of the Lamport Clock to implement  [mvcc] storage", "posttime": "2021-06-26 15:10:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lamport,存储", "title": "Lamport时钟 ", "title_en": "Lamport Clock", "transed": 1, "url": "https://martinfowler.com/articles/patterns-of-distributed-systems/lamport-clock.html", "via": "", "real_tags": ["lamport", "存储"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克里斯托弗·诺兰的每一个粉丝都知道任何好的魔术伎俩都有三个行为。第一个行为是承诺，魔术师做一些普通的事情。然后转弯，普通变得非凡。第三章是威望，回归非凡的普通。\n 为了避免使用购买，借用，借用，死，美国必须有足够的钱投资升值资产。广泛投资的资产通常在通货膨胀后每年的增长至少为3％，这意味着投资200万美元，为美国家庭薪水中位数提供约60,000美元的年度被动收入。 1000万美元投资规定了300,000美元的年度被动收入，这进入了90百分位数的收入者。这是通过投资者的努力获得的。如果纳税人在收到它们时销售这些收益，那么她将支付资本获得税。 （已经比正常收入率较低）\n 通过使用这一战略，我们的爱国美国公民甚至不需要支付较低的资本收益税。相反，他们可以和平地抗议美国政府的压迫税制，将道路和医院和公共教育的费用牺牲到其较低的上行的同行，而是在艰苦的休假和游艇上度过财富。\n  这个神奇伎俩的第一个行为非常简单。我们的爱国美国公民占据了他们的遗传财富，并购买了升值资产。 100 000,000美元的遗传通常会提供至少600,000美元的收益，其中大约300,000美元将被挽救，以便基金随着通货膨胀而增长，留下30万美元的收入（以通货膨胀增长，而省去了300,000美元）。但那没有出售;第一步是买，不卖。\n  第二幕也很简单。我们的爱国美国公民现在希望从上面的收入中花费300,000美元，逻辑上的意思是销售收益并支付15％的资本收益的收入税。\n 通过撤回300,000美元的债务，爱国美国公民在此转变为非凡的普通人（资本收益300,000美元）。通过这样做，她已经避免了今年的资本收益税，因为他们尚未被销售，因此未经销售，并且她避免向债务缴纳税款，因为债务不征税。尽管在她的资产升值中支付了30万美元，但她今年没有税收。\n 这部分伎俩每年都重复，直到是最终行为的时候。 \n我们的爱国美国公民允许她未实现的收益积累在她生命的过程中。这应该意味着他们终于卖出的时候都征税，但其中谎言的最后一位手;他们从未出售过。相反，爱国美国公民死亡，仍然拥有资产。\n 在这一点上，非常重要的变得普通。欣赏的资产现在始终处于加大，清洗未实现的收益。然后，他们没有任何内置税收，所以遗产就总金额没有税收，包括初始投资，也不是资产的升值。然后，庄园利用资产的赞赏偿还债务。校长仍然存在。\n 因此，结果是没有税收的生命。通过升值，额外财富提供了主要投资，这是债务爱国美国公民的额外财富。当爱国美国公民死亡时，整个财富都销售，免税，债务是通过免税收益支付的。校长仍然是我们的爱国美国公民的后代，他们将遵循买/借用/死亡，以避免缴纳这些投资的收入税。 ", "note_en": "Every fan of Christopher Nolan knows that any good magic trick contains three acts. The first act is the pledge, where the magician does something ordinary. Then comes the turn, where the ordinary becomes extraordinary. The third act is the prestige, returning the extraordinary to the ordinary.\n In order to avoid taxation using Buy, Borrow, Die, an American must first have enough money to invest in appreciating assets.  Broadly invested assets often provide at least 3% growth every year after inflation, which means that $2 Million invested provides an annual passive income of about $60,000, the median American household salary. $10 Million invested provides approximately an annual passive income of $300,000, which is well into the 90th percentile of earners.  This is gained through no effort of the investor. If the taxpayer sells these gains as she receives them, then she will pay capital gains taxes. (already a lower rate than the normal income rates)\n By using this strategy, our Patriotic American Citizens don’t even need to pay the lower capital gains taxes. Instead, they can peacefully protest the American government’s oppressive taxation regime, leaving the expense of roads and hospitals and public education to their less-propertied counterparts, instead spending their wealth on hard-earned vacations and yachts.\n  The first act of this magic trick is very simple. Our Patriotic American Citizen takes their hard-inherited wealth and buys appreciating assets. $10,000,000 inherited will usually provide at least $600,000 in gains, approximately $300,000 of which will be saved so that the fund grows with inflation, leaving $300,000 of income (which grows with inflation, because the other $300,000 is saved). But that is not sold; the first step is  buy, not  sell.\n  The second act is also very simple. Our Patriotic American Citizen now wants to spend her $300,000 in income from above, which logically would mean selling the gains and paying 15% capital gains taxes on their income.\n The Patriotic American Citizen here turns the ordinary ( spending $300,000 in capital gains) into the extraordinary by withdrawing $300,000 in debt. By doing so, she has avoided paying taxes this year on her capital gains, because they have not been sold and are therefore unrealized, and she has avoided paying taxes on the debt because debt is not taxed.  She has paid no taxes this year, despite spending the $300,000 in appreciation of her assets.\n This part of the trick is repeated every year, until it is time for the final act.\n  Our Patriotic American Citizen has allowed her unrealized gains to accumulated over the course of her life. This should mean that they are all taxed when they are finally sold, but therein lies the final sleight of hand; they are never sold. Instead, the Patriotic American Citizen dies, still owning the assets.\n At this point, the extraordinary again becomes the ordinary. The appreciated assets are now at a stepped-up basis, washing away the unrealized gains. They are then sold, without any built-in taxes, so the estate pays  no taxes on the total amount, including not only the initial investment but also the appreciation of the asset. The estate then uses the appreciation of the assets to pay off the debt. The principal remains.\n The result, therefore, is a life without taxes. The principal investment provides, through appreciation, additional wealth, which the Patriotic American Citizen then matches in debt. When the Patriotic American Citizen dies, the whole wealth is sold, tax-free, and the debt is paid with the tax-free proceeds. The principal remains and is invested for the descendants of our Patriotic American Citizen, who will follow  Buy/Borrow/Die in order to avoid paying taxes on their income from these investments.", "posttime": "2021-06-26 15:10:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "借来,borrow,投资", "title": "买，借来，死 ", "title_en": "Buy, Borrow, Die", "transed": 1, "url": "https://www.peoplestaxpage.org/buy-borrow-die", "via": "", "real_tags": ["借来", "borrow", "投资"]}, {"category": "", "categoryclass": "", "imagename": "09a2785173e2a3d8fd72b13f8c104b98.jpg", "infoid": 1068394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十年前，人类学家在西伯利亚的Denisova洞穴中发现了一群未知的一群未知灭绝的人类的化石粉红色。本集团的荣誉被命名为“Denisovans”。现在，对洞穴土壤中的DNA进行了广泛的分析，揭示了它也举办了现代人类 - 谁早早到达，以至于他们可能曾经在那里住在那里，在那里司法和尼安德特人。\n 新的研究“给予了[研究员]前所未有的洞察力，”哥本哈根大学分子古生学家Mikkel Winther Pedersen说，哥本哈根大学的分子古生学家都没有参与这项工作。 “它字面上表明了他们只能在假设中进行了什么。”\n 众所周知，人类 - 包括尼安德特人和丹尼斯瓦尔斯至少占据了Denisova Cave至少300万年。在八个人体化石中出土的是有小指，来自尼安德特人的三个骨头，甚至一个来自一个尼安德特人和一个denisovan父母的孩子。洞穴还含有精致的石材工具和珠宝，较高水平。但没有发现现代人体化石。那些文物，对来自这些骨骼的DNA的广泛研究，甚至从土壤中的DNA早期研究都巩固了洞穴对拼凑人类演变的重要性。\n 但是，八个化石不多继续，所以埃琳娜扎瓦拉是Max Planck进化人类学研究所的研究生，以及与俄罗斯研究人员合作的同事，看看三腔洞的土壤中存在什么样的DNA （见下面的视频）。\n 研究人员一直在研究从土壤中分离的DNA超过40岁，包括来自Permafrost的DNA，但只有在过去4年中只有任何人发现古代土壤中灭绝的人类的DNA。\n 研究人员与此前已经过洞穴的另一个专家团队合作，研究人员挖出了728种土壤样品。经过2年的分析，其中它们分离并测序样品，研究人员在其中175中发现了人类DNA。这使得研究“最大，最具系统性，最具系统性，”Max Planck科学家的考古科学家Katerina Douka表示，这是人类历史科学家的考古科学家，他没有参与工作。\n    这些数据揭示了一种复杂的人类和动物居所的历史，不同的群体随着时间的推移，Zavala和她的同事在自然界中搬到了洞穴。他们的工作证实，Denisovans是洞穴的第一个人类居民，大约300万年前。他们在13万年前消失了，只有一个不同的Denisovans，他们可能会制造许多石工具，大约30,000年后。 Neanderthals在大约17万年前出现在现场，在各种各样的时间点使用不同的群体，与Denisovans有些重叠。 \n最后一个到达的是现代人类，他在大约45,000年前出现。研究人员报告了与来自所有三个人类群体的DNA对应的土壤层。 “每层的时间段非常大，所以我们不能具体说他们重叠是否与否，”扎瓦拉说。但是，Douka补充道，“我无法想到另一个地方，其中三种人类过于时间。”\n 鉴于珠宝和复杂的文物在后来的层里，一些研究人员涉嫌现代。但没有人知道他们早在45,000年前就到达了 - 我们都与我们的两种古老的表兄弟重叠了。 “它建议在维也纳大学的进化人类学家之间建议古老和现代人类之间更加复杂的相互作用。”维也纳大学的进化人类学家罗恩·帕萨斯说。\n 土壤样品还产生来自许多动物的DNA。大约17万年前，气候从更温暖到寒冷，尼安德特人搬进去，所以不同的鬣狗和熊。\n Pinhasi说，这是来自化石和土壤样本的基因组数据的组合，真正使新工作脱颖而出。 “这是一个超级化的方向[未来的工作]。” Douka同意，并说新的研究应该帮助古代土壤DNA成为“主流考古工具”。她已经惊讶于它的进展，即与其他研究相结合，使得成为可能。 “让我们不要忘记，尽管如此，在2010年我们绝对没有证据表明Denisovans存在，而这些各种母亲见过，更不用说他们在一封电子邮件中撰写了反复和共存。” ", "note_en": "A decade ago, anthropologists shocked the world when they discovered a  fossil pinkie bone from a then-unknown group of extinct humans in Siberia’s Denisova Cave. The group was named “Denisovans” in its honor. Now, an extensive analysis of DNA in the cave’s soils reveals it also hosted modern humans—who arrived early enough that they may have once lived there alongside Denisovans and Neanderthals.\n The new study “gives [researchers] unprecedented insight into the past,” says Mikkel Winther Pedersen, a molecular paleoecologist at the University of Copenhagen who was not involved with the work. “It literally shows what [before] they have only been able hypothesize.”\n Humans—including Neanderthals and Denisovans—are known to have occupied Denisova Cave for at least 300,000 years. Among the eight human fossils unearthed there are the pinkie, three bones from Neanderthals, and even one from a child  with one Neanderthal and one Denisovan parent. The cave also contains sophisticated stone tools and jewelry at higher, later levels. But no modern human fossils have been found there. Those artifacts,  extensive studies of DNA from these bones, and even  one early study of DNA from soils have cemented the cave’s importance for piecing together human evolution.\n But eight fossils are not much to go on, so Elena Zavala, a graduate student at the Max Planck Institute for Evolutionary Anthropology, and colleagues teamed up with Russian researchers to see what kind of DNA was present in the soils of the three-chamber cave (see video, below).\n Researchers have been studying DNA isolated from soils for more than 40 years, including  sequencing DNA from permafrost, but only in the past 4 years has anyone  found DNA from extinct humans in ancient soils.\n Working with another team of experts who had previously  dated the layers of the cave, the researchers dug out 728 soil samples. After 2 years of analysis, in which they isolated and sequenced the samples, the researchers found human DNA in 175 of them. That makes the study “the largest and most systematic of its kind,” says Katerina Douka, an archaeological scientist at the Max Planck Institute for the Science of Human History who was not involved in the work.\n    The data reveal  a complex history of human and animal habitation, with different groups moving in and out of the cave over time, Zavala and her colleagues report today in  Nature. Their work confirms that Denisovans were the cave’s first human inhabitants, about 300,000 years ago. They disappeared 130,000 years ago, only to be followed by a different group of Denisovans, who likely made many of the stone tools, some 30,000 years later. Neanderthals appeared on the scene about 170,000 years ago, with different groups using the cave at various points in time, some overlapping with the Denisovans.\n The last to arrive were modern humans, who showed up about 45,000 years ago. The soil layer that corresponds with that period contained DNA from all three human groups, the researchers report. “The time periods [of each layer] are quite large, so we can’t concretely say if they overlapped or not,” Zavala says. But, Douka adds, “I cannot think of another site where three human species lived through time.”\n Given the jewelry and sophisticated artifacts in later layers, some researchers had  suspected moderns had been there. But no one knew they had arrived as early as 45,000 years ago—and overlapped with both of our archaic cousins. “It suggests a more complicated interplay between archaic and modern humans,” says Ron Pinhasi, an evolutionary anthropologist at the University of Vienna who was not involved with the work.\n The soil samples also yielded DNA from many species of animals. About 170,000 years ago, the climate went from warmer to colder, and Neanderthals moved in, so did different species of hyenas and bears.\n It’s the combination of genomic data from both the fossils and the soil samples that really makes the new work stand out, Pinhasi says. “It’s a superpromising direction [for future work].” Douka agrees, and says the new study should help ancient soil DNA become “a mainstream archaeological tool.” She is already amazed at the progress that it, combined with other studies, has made possible. “Let’s not forget that as recently as in 2010 we had absolutely no evidence that Denisovans existed, and that these various hominins ever met, let alone that they interbred repeatedly and co-existed for millennia,” she wrote in an email.", "posttime": "2021-06-26 15:09:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "洞穴,cave,人类", "title": "西伯利亚洞穴主持了Neanderthals，Denisovans和现代人类 ", "title_en": "Siberian cave hosted Neanderthals, Denisovans, and modern humans", "transed": 1, "url": "https://www.sciencemag.org/news/2021/06/ancient-siberian-cave-hosted-neanderthals-denisovans-and-modern-humans-possibly-same", "via": "", "real_tags": ["洞穴", "cave", "人类"]}]