[{"category": "", "categoryclass": "", "imagename": "0535cf7f7bb6131f258656cdb8fc7c23.jpg", "infoid": 1072234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让我在这里花一点时间写出对 ModelingToolkit 的完整规范答案以及它与 Modia 和 Modelica 的关系。这个问题经常出现：为什么 ModelingToolkit 存在而不是建立在 Modelica 编译器的工具上？我首先要说我是 Martin 和 Hilding 工作的忠实粉丝，我们与他们在基于 Julia 的建模和仿真工具的方向上密切合作。 ModelingToolkit 作为一个新系统，在它探索的设计空间中具有一定的灵活性，虽然我们遵循不同的基本理念，但我们有许多相同的目标。 SciML 组织中的一切都围绕联合模块化开发的原则构建：让其他包影响您自己的功能。这在一篇关于 DifferentialEquations.jl 的包结构的论文中得到了强调。基本原则是，并非每个人都希望或需要成为包的开发人员，但仍可能希望做出贡献。例如，ODE 求解器中的研究人员想要构建一个将一个求解器添加到 SciML 生态系统的包的情况并不少见。这样做是为了他们自己的学分，但现在它存在于多重派遣世界中的免费奖金。在DifferentialEquations.jl 的设计中，solve(prob,IRKGL16()) 现在因为它们的包而存在，所以我们将它添加到文档中。有些工作甚至不在组织内部，但我们仍然支持它。其理念是让每位研究人员都成为计算研究领域的萌芽艺术家，包括所有可能的方法，并建立一个促进方法中自由研究氛围的基础设施。顶级默认值和文档可能会引导人们进入生态系统中最稳定的方面，但只需轻按一下开关，您就可以测试最新的研究。 Modelica 生态系统（开放标准、OpenModelica、多种商业实现），基于面向方程建模的简单思想开始，对行业产生了巨大影响，解决了许多困难的实际工业问题。今天的现代仿真系统设计人员希望从他们的语言和编译器堆栈中获得更多。例如，在 Modelica 语言中，没有提到对您的模型进行了哪些转换以使其“可模拟”。人们知道 Pantelides 算法和“奇点消除”，但这不在语言范围内。编译器可能会为您提供一些选项，但用户或代码不会主动与之交互。每个编译器都是不同的，当你使用另一个编译器时，一个编译器的进步对你的模型没有帮助，整个世界都是孤立的。通过这种设计，外部用户很难在 Modelica 中编写编译器过程，这会影响这个模型降低过程。你可以调整旋钮，或者编写一个新的编译器，或者 fork OpenModelica 并破解整个编译器来做你想要的更改。正如 Julia 编译器生态系统所展示的那样，进入门槛可以显着降低。我认为在很多情况下，Modelica 中的一组符号案例可能还不够，而且崭露头角的系统设计人员可能想自己编写。例如，在 SDE 上有一个 Lamperti 变换，它可以将一般 SDE 转换为具有加性噪声的 SDE。它并不总是适用，但当它适用时，它可以大大提高求解器的速度和稳定性。这足够小众，它可能永远不会出现在商业 Modelica 编译器中（实际上，Modelica 目前没有 SDE），但某些用户可能希望能够将其添加到流程中。因此，ModelingToolkit 的初始目标是提供一个开放的模块化转换系统，整个建模生态系统都可以在此系统上蓬勃发展。我之前的博文举例说明了不熟悉的代码转换用例如何解决许多困难的数学问题，我的目标是将这种能力赋予整个开发社区。 `structural_simplify` 是 ModelingToolkit 中内置的东西，用于在标准系统上进行“标准转换”，但转换的世界要大得多。对几个变量进行对数转换？取几个指数以确保积极性？ SDE 的 Lamperti 变换？转换为灵敏度方程？不仅仅是转换，还有用于检查和分析模型的功能。方程是线性的吗？哪些参数在结构上是可识别的？ ModelingToolkit 是对建模语言的解构。它将其分解为组成部分，然后可以轻松构建新的建模语言，例如 Catalyst.jl，这些语言在内部使用 ModelingToolkit 进行所有困难的转换。解构形式是构建新的基于领域的语言以及针对特定模型优化编译器的新转换的一个跳跃点。最后，随着核心 MTK 的改进，基于它构建的每个人都会获得更高的稳定性、性能和并行性。现在有两个主要方面需要处理才能完全实现这样的愿景。如果您希望人们能够在转换之间重用代码，那么您想要的是公开您如何更改代码。为了实现这一目标，为 ModelingToolkit.jl 创建了一个新的计算机代数系统 (CAS) Symbolics.jl。这个想法是，如果我们希望每个人都编写代码转换，他们都应该可以轻松访问用于执行此类代码转换的通用数学工具集。我们不应该让每个人都为差异化、简化和替代构建新代码。而且我们也不应该让每个人都依赖 ModelingToolkit.jl 未记录的内部结构：这应该是开放的、经过良好测试的、有记录的和众所周知的系统，以便每个人都可以轻松成为“ModelingToolkit 编译器开发人员”。通过构建 CAS 并使其成为 Julia 标准，我们可以弥合开发人员之间的差距，因为现在每个人都知道如何轻松操作模型：它们只是 Symbolics.jl 表达式。\n第二个主要方面是实现对宿主语言的自然嵌入。 Modelica 不是一种人们可以编写编译器传递的语言，这在建模者和建模语言扩展的开发者之间引入了主要差距。如果我们想弥合这一差距，我们需要确保整个建模语言都来自主机，这是一种完整的命令式编程语言。并且您需要使用一种交互式、高性能的语言，并且具有用于建模和仿真的完善的生态系统。 Martin 和 Hilding 将这一事实视为 Modia 的综合，Julia 如何独特地满足了这一需求，但我认为我们可以更进一步。要真正使嵌入自然，您应该能够在运行中自动将代码转换为符号形式或从符号形式转换。在上一篇博文中，我展示了 ModelingToolkit.jl 如何通过自动并行化和执行索引减少来改进人们的代码，即使代码不是用 ModelingToolkit.jl 编写的。这使转换语言的开发人员受众从“任何想要转换模型的人”增加到“任何想要自动化改进模型和通用代码的人”。因此，这种受众的扩大吸引了对自动化并行性和 GPU 代码生成等感兴趣的开发人员，并将他们带入 MTK 开发人员社区。反过来，由于所有这些进步都适用于 MTK 内部和代码生成工具，例如 Symbolics.jl 的 build_function，由于社区的组成方式，新功能一直在出现。 CTarget build_function 首先被创建以将 Julia 代码转换为 C，因此 ModelingToolkit 模型可以生成 C 输出以编译到嵌入式系统中。看到一个例子时这是一个意外，但是当您注意到整个系统如此快速增长时，它就是设计。现在我们早期收到的一个问题是，您是否无法与仅用于 Modelica 的专用编译器的性能相匹敌，对吗？虽然从表面上看，超专业化似乎是有益的，但超专业化的真正影响是算法效率较低，因为投入的工作较少。 Symbolics.jl 已经成为一种现象，有多个不同的百条评论线程挖掘其设计的优缺点的许多方面，这甚至不包括 200 人的聊天频道，该频道在CAS 发布后不到 2 个月。很多人都在建议如何改进每一个加法和乘法运算。因此，很快添加了许多细节，但距离 Modelica 的实现还有几年的时间，这应该不足为奇。它自动多线程遍历树并重写规则。它会自动生成快速并行化的代码，并且可以通过撕裂非线性方程的方式来实现。它允许用户定义自己的高性能和并行化函数，注册它们，并将它们粘贴到右侧。这甚至不包括更高级别的结果，例如它是完全可微的，因此允许训练在模型内分解的神经网络，并自动从数据中发现方程。只是在最基本的层面上，我们可以看到 CAS 正在改变科学家和工程师在建模过程的许多方面的工作流程。通过分发改进符号计算的工作，我们已经采取了本质上无法获得的示例，并使用 Symbolics.jl 使其即时化：我们正在为符号生态系统构建一个完整的基准测试系统，以随着时间的推移跟踪性能并确保它达到顶层。它整合了 OSCAR 项目的部分内容，让很多人跟踪他们自己工作中的表现，并建立了一个社区。每一步都是另一项重大改进，这个生态系统正在加快这些步骤。这是一个相当好的问题，因为 Modelica 已经编写了很多模型，如果我们无法连接到该生态系统，那将是一种耻辱。我会暗示，作为 JuliaSim 的一部分，即将推出的工具用于连接到许多预先存在的模型库。此外，我们希望利用像 Modia.jl 和 TinyModia.jl 这样的工具，与 Modelica 社区的合作将帮助我们架起一座桥梁。\nModelingToolkit.jl 的可组合性和分布式开发特性是其催化剂。这就是 ModelingToolkit.jl 看起来像是穿上了火箭鞋的原因：它很快，而且移动得也很快。这是因为设计中的思想。这是因为 ModelingToolkit.jl 将整个研究社区作为其资产而不仅仅是其用户。我计划从这里继续前进，回顾过去向伟人学习，但要按照我们自己的形象进行建设。我们采用建模语言的理念，将其分发到建模和仿真领域最活跃的开发人员社区之一，采用一种旨在构建快速并行代码的语言。你被邀请了。我将发布 Jonathan 在 NASA Launch Services Program 的近期演讲，他看到了从 Simulink 迁移到 ModelingToolkit.jl 后的 15,000 倍加速。说够了。虽然我们不希望每个应用程序都会看到这种加速（尽管我们希望他们会！），但我们很想听听您使用 ModelingToolkit 的经验。 Christopher Rackauckas，ModelingToolkit、Modelica 和 Modia：Julia 的可组合建模未来，Winnower 8：e162133.39054（2021 年）。 DOI：10.15200/winn.162133.39054", "note_en": "Let me take a bit of time here to write out a complete canonical answer to  ModelingToolkit and how it relates to  Modia and  Modelica. This question comes up a lot: why does ModelingToolkit exist instead of building on tooling for Modelica compilers? I&#39;ll start out by saying I am a huge fan of Martin and Hilding&#39;s work and we work very closely with them on the direction of Julia-based tooling for modeling and simulation. ModelingToolkit, being a new system, has some flexibility in the design space it explores, and while we are following a different foundational philosophy, we have many of the same goals.\n  Everything in the SciML organization is built around a principle of confederated modular development: let other packages influence the capabilities of your own. This is highlighted in  a paper about the package structure of DifferentialEquations.jl. The underlying principle is that not everyone wants or needs to be a developer of the package, but still may want to contribute. For example, it&#39;s not uncommon that  a researcher in ODE solvers wants to build a package that adds one solver to the SciML ecosystem. Doing this in their own package for their own academic credit, but with the free bonus that now it exists in the multiple dispatch world. In the design of DifferentialEquations.jl, solve(prob,IRKGL16()) now exists because of their package, and so we  add it to the documentation. Some of this work  is not even inside the organization, but we still support it. The philosophy is to include every researcher as a budding artist in the space of computational research, including all of the possible methods, and building an infrastructure that promotes a free research atmosphere in the methods. Top level defaults and documentation may lead people to the most stable aspects of the ecosystem, but with a flip of a switch you can be testing out the latest research.\n The Modelica ecosystem (open standard, OpenModelica, multiple commercial implementations), which started based on the simple idea of equation oriented modeling, has had a huge impact on industry and solved lots of difficult real industrial problems. The modern simulation system designer today, wants much more from their language and compiler stack. For example, in the Modelica language, there is no reference to what transformations are being done to your models in order to make them &#34;simulatable&#34;. People know about Pantelides algorithm, and &#34;singularity elimination&#34;, but this is outside the language. It&#39;s something that the compiler maybe gives you a few options for, but not something the user or the code actively interacts with. Every compiler is different, advances in one compiler do not help your model when you use another compiler, and the whole world is siloed. By this design, it is extremely difficult for an external user to write compiler passes in Modelica which effects this model lowering process. You can tweak knobs, or write a new compiler, or fork OpenModelica and hack on the whole compiler to just do the change you wanted. The barrier to entry can be significantly lowered, as the Julia compiler ecosystem has showed.\n I think in many cases, the set of symbolic cases in Modelica may not be sufficient, and budding system designers might want to write their own. For example, on SDEs there&#39;s a Lamperti transformation which can exist which transforms general SDEs to SDEs with additive noise. It doesn&#39;t always apply, but when it does it can  greatly enhance solver speed and stability. This is niche enough that it may never be in a commercial Modelica compiler (in fact, Modelica doesn&#39;t have SDEs at this moment), but it&#39;s something that some user might want to be able to add to the process.\n  So the starting goal of  ModelingToolkit is to give an open and modular transformation system on which a whole modeling ecosystem can thrive. My previous blog post  exemplified how unfamiliar use cases for code transformations can solve many difficult mathematical problems, and my goal is to give this power to the whole development community. `structural_simplify` is something built into ModelingToolkit to do &#34;the standard transformations&#34; on the standard systems, but the world of transformations is so much larger. Log-transforming a few variables? Exponentiating a few to ensure positivity? Lamperti transforms of SDEs? Transforming to the sensitivity equations? And not just transformations, but functionality for inspecting and analyzing models. Are the equations linear? Which parameters are structurally identifiable?\n ModelingToolkit is a deconstruction of what a modeling language is. It pulls it down to its component pieces and then makes it  easy to build new modeling languages like Catalyst.jl which internally use ModelingToolkit for all of the difficult transformations. The deconstructed form is a jumping point for building new domain-based languages, along with new transformations which optimize the compiler for specific models. And then in the end, everybody who builds off of it gets improved stability, performance, and parallelism as the core MTK passes improve.\n  Now there&#39;s two major aspects that need to be handle to fully achieve such a vision though. If you want people to be able to reuse code between transformations, what you want is to expose how you are changing code. To achieve this goal,  a new Computer Algebra System (CAS), Symbolics.jl, was created for ModelingToolkit.jl. The idea being, if we want everyone writing code transformations, they should all have easy access to a general mathematical toolset for doing such code transformations. We shouldn&#39;t have everyone building a new code for differentiation, simplify, and substitution. And we shouldn&#39;t have everyone relying on undocumented internals of ModelingToolkit.jl either: this should be something that is open, well-tested, documented, and a well-known system so that everyone can easily become a &#34;ModelingToolkit compiler developer&#34;. By building a CAS and making it a Julia standard, we can bridge that developer gap because now everyone knows how to easily manipulate models: they are just Symbolics.jl expressions.\n The second major aspect is to achieve a natural embedding into the host language. Modelica is not a language in which people can write compiler passes, which introduces a major gap between the modeler and the developer of extensions to the modeling language. If we want to bridge this gap, we need to ensure the whole modeling language is used from a host which is a complete imperative programming language. And you need to do so in a language that is interactive, high performance, and has a well-developed ecosystem for modeling and simulation. Martin and Hilding had seen this fact as the synthesis for Modia with how Julia uniquely satisfies this need, but I think we can take it a step further. To really make the embedding natural, you should be able to on the fly automatically convert code to and from the symbolic form. In the previous blog post  I showcased how ModelingToolkit.jl could improve people&#39;s code by automatically parallelizing it and performing index reduction even if the code was not written in ModelingToolkit.jl. This grows the developer audience of the transformation language from &#34;anyone who wants to transform models&#34; to &#34;anyone who wants to automate improving models and general code&#34;. This expansion of the audience is thus pulling in developers who are interested in things like  automating parallelism and  GPU codegen and bringing them into the MTK developer community.\n In turn, since all of these advances then apply to the MTK internals and code generation tools such as  Symbolics.jl&#39;s build_function, new features are coming all of the time because of how the community is composed. The  CTarget build_function was first created to  transpile Julia code to C, and thus ModelingToolkit models can generate C outputs for compiling into embedded systems. This is serendipity when seeing one example, but it&#39;s design when you notice that this is how the entire system is growing so fast.\n  Now one of the questions we received early on was, won&#39;t you not be able to match the performance of a specialized compiler which was only made to work on Modelica, right? While at face value it may seem like hyperspecialization could be beneficial, the true effect of hyperspecialization is that algorithms are simply less efficient because less work has been put into them. Symbolics.jl has become a phenomenon of its own, with  multiple different hundred  comment threads digging through  many aspects of the  pros and cons of its designs, and that&#39;s not even including the 200 person chat channel which has had tens of thousands of messages in the less than 2 months since the CAS was released. Tons of people are advising how to improve every single plus and multiply operation.\n So it shouldn&#39;t be a surprise that there are many details that have quickly been added which are still years away from a Modelica implementation. It  automatically multithreads tree traversals and rewrite rules. It  automatically generates fast parallelized code, and can  do so in a way that composes with tearing of nonlinear equations. It lets users define their own high-performance and parallelized functions,  register them, and stick them into the right hand side. And that is even excluding the higher level results, like the fact that it is  fully differentiable and thus allows training neural networks decomposed within the models, and  automatically discover equations from data.\n Just at the very basic level we can see that the CAS is transforming the workflows of scientists and engineers in many aspects of the modeling process. By distributing the work of improving symbolic computing, we have already taken examples which were essentially not obtainable and making them instant with Symbolics.jl:\n  We are building out a full benchmarking system for the symbolic ecosystem to track performance over time and ensure it reaches the top level. It&#39;s integrating pieces from  The OSCAR project, getting lots of people tracking performance in their own work, and building a community. Each step is another major improvement and this ecosystem is making these steps fast.\n  This is a rather good question because there are a lot of models already written in Modelica, and it would be a shame for us to not be able to connect with that ecosystem. I will hint that there is coming tooling as part of  JuliaSim for connecting to many pre-existing model libraries. In addition, we hope to make use of tooling like  Modia.jl and  TinyModia.jl and collaboration with the Modelica community will help us make a bridge.\n  The composability and distributed development nature of ModelingToolkit.jl is its catalyst. This is why ModelingToolkit.jl looks like it has rocket shoes on: it is fast and it is moving fast. And it&#39;s because of the thought put into the design. It&#39;s because ModelingToolkit.jl is including the entire research community as its asset instead of just its user. I plan to keep moving forward from here, looking back to learn from the greats, but building it in our own image. We&#39;re taking the idea of a modeling language, distributing it throughout one of the most active developer communities in modeling and simulation, in a language which is made to build fast and parallelized code. And you&#39;re invited.\n  I&#39;m just going to post a self-explanatory recent talk by Jonathan at the NASA Launch Services Program who saw a 15,000x acceleration by moving from Simulink to ModelingToolkit.jl.\n  Enough said. While we don’t expect every application will see this kind of speedup (although we wish they will!), we would love to hear about your experiences with ModelingToolkit.\n  Christopher Rackauckas, ModelingToolkit, Modelica, and Modia: The Composable Modeling Future in Julia, The Winnower 8:e162133.39054 (2021). DOI: 10.15200/winn.162133.39054", "posttime": "2021-08-09 13:41:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "julia,建模,modelica,转换", "title": "ModelingToolkit、Modelica 和 Modia：Julia 中可组合建模的未来", "title_en": "ModelingToolkit, Modelica, and Modia: The Composable Modeling Future in Julia", "transed": 1, "url": "http://www.stochasticlifestyle.com/modelingtoolkit-modelica-and-modia-the-composable-modeling-future-in-julia/", "via": "", "real_tags": ["julia", "建模", "modelica", "转换"]}, {"category": "", "categoryclass": "", "imagename": "900aab2fa3e26afab9d7d2e15663d125.jpg", "infoid": 1072233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更强、更快、更猛、更精细。这就是奥运会对我们的承诺——更高的表现，新的世界纪录。但如果你扔东西就不行了。自 1908 年以来，标枪比赛一直是奥运会的一项赛事。从那时起，伟大的运动员，主要是瑞典人、挪威人和德国人，不断地将长矛投掷得越来越远，直到 1984 年的非凡时刻——不是在奥运会上，而是在田径比赛中在柏林——当德国人 Uwe Hohn 扔得如此之高，到目前为止，他不仅打破了之前的世界纪录，还把保安人员吓跑了。你必须看到这个。 Uwe 的投掷突破了 100 米障碍。在他之前没有人扔过这么远的地方。也许他得到了幸运的微风；也许他就是那么好。但是他的长矛落在了 104.8 米（343.8 英尺）外，让建造田径场的人们感到担忧。体育记者史蒂夫沃尔登说，他们可以想象，“一个毫无戒心的观众 [带着]……一根细长的、与身体一样长的金属长矛在肋骨之间。”这不是一个好主意，尤其是对责任律师而言。此外，标枪越来越平地落地，而不是直立戳入草皮，这使得距离标记变得困难，因此在 1986 年国际田径联合会技术委员会批准了一种新的标枪设计。重心向前移动了 1.6 英寸，尖端进行了修改，以降低标枪的空气动力学性能，这意味着它会更早地低头并更快地着陆，从而将平均飞行距离减少了大约 10%。换句话说，这是一个庆祝人们能投多远的活动，官员说，“不要投那么远。投得更短。”这就是发生的事情。 Uwe Hohn 的世界纪录已被冻结。它现在是“永恒的世界纪录”。自那时以来的最佳表现大约比 Uwe 少 6 米——这使得今天所有的世界冠军都排在第二位。事实上，情况比这更糟糕。我们都知道标枪是一项古老的奥运会项目。 “它是那个时代遗留下来的少数几个之一，”体育作家沃尔登说，“有铁饼、马拉松和短跑，因此具有一定的纯度。例如，你不能对山地自行车说同样的话。 ”\n人们已经扔了很长很长的细长棍子。最初的奥运会始于大约 2700 年前。但最初的长矛运动员又可以追溯到 40 万年前——比奥运会还要古老 150 倍。不是希腊人在运动场上赤身裸体地奔跑，而是想象一些森林人，毛茸茸的多，头骨可能略微突出，他们拿着像现代标枪一样尺寸、行为和外观的棍棒冲过森林。 1990 年代中期，由 Hartmut Thieme 教授领导的德国研究小组发现了一堆埋在古老泥浆中的 40 万年前的长矛。它们由云杉制成，经过精心雕刻，比现代标枪短一点，大约 7 英尺而不是 8 英尺，但它们显然是用来投掷的。无论是谁制造的，都将它们保持在靠近前部的宽度以更好地提升。复制品被制作并送给了一些现代运动员，他们为了好玩而扔它们，让它们飞行长达 70 米——这是一个非常可观的距离。但具有讽刺意味的是，在史前时代，当森林标枪投掷者使用它们时，他们经常以皮革丁字裤的形式添加一点助推器，称为脚踝，这将使标枪旋转，使其飞得更远。希腊奥运选手也使用这种丁字裤，所以他们的投掷，大概也得到了增强，让我思考 - 这不是很尴尬吗？ ——如果我们可以邀请一个穴居人或一个原始的奥林匹亚人观看现代人投掷现代标枪，他们会站在那里，看着这些木棍飞起来，然后飞下来，然后想……他们的问题是什么？我们做得更好。这是一个困惑。我理解安全的必要性，但仍然 - 争夺一个在你内心深处你知道无法与你之前的人相提并论的冠军感觉如何？许多运动员来到奥运会希望成为有史以来最好的。但不是标枪投掷者。他们被告知要梦想更小的梦想（“自 1984 年以来最好的！”），我认为这是一笔不划算的交易。为什么不把这个活动从拥挤的竞技场移开，去一个安全的地方，设计出最好的飞矛，尽可能地把它扔到最远的地方，然后打破记录的人可以对所有的长矛投掷者说，“现在我是第一，真正意义上的——我的飞得比你们所​​有人都飞得更远！", "note_en": "Stronger, faster, fiercer, finer. That&#39;s what the Olympics promise us — higher performance, new world records. But not if you throw things.\n  The javelin throw has been an Olympic event since 1908. Since then, great athletes, mostly Swedes, Norwegians and Germans, kept throwing spears farther and farther until the extraordinary moment in 1984 — not at the Olympics, it was at a track and field meet in Berlin — when German Uwe Hohn threw so high, so far, he not only broke the previous world record, he scared the bejeezus out of the security people. You&#39;ve got to see this.\n    Uwe&#39;s throw broke the 100-meter barrier. No one before him had thrown anywhere near that far. Maybe he got a lucky breeze; maybe he was that good. But his spear landed 104.8 meters (343.8 feet) away, and the folks who build track and field stadiums got worried. They could imagine,  says sportswriter Steve Waldon, &#34;an unsuspecting spectator [with] ... a slender, body-length metal spear between the ribs.&#34; Not a nice thought, especially to liability lawyers.\n  Also, javelins were increasingly landing flat, instead of poking upright into the turf, making distance-marking difficult, so in 1986 the  I nternational Association of Athletics Federations&#39; technical committee authorized a new javelin design. The center of gravity was moved 1.6 inches forward, the tip was modified to make the javelin  less aerodynamic, meaning it would nose down earlier and land sooner, reducing average flight distance by about 10 percent.\n    In other words, here&#39;s an event that celebrates how far people can throw, and the officials said, &#34;Don&#39;t throw that far. Throw shorter.&#34;\n      And that&#39;s what happened. Uwe Hohn&#39;s world record has been frozen. It is now  &#34;an eternal world record.&#34; The best performance since then has been, roughly, six meters shy of Uwe&#39;s — making all of today&#39;s world champions second best.\n  Actually, it&#39;s worse than that. We all know that javelin throwing is an ancient Olympic event. &#34;It&#39;s one of the few that remains from those times,&#34; says sportswriter Waldon, &#34;with discus, the marathon and sprinting, and has a certain purity because of this. You can&#39;t say the same thing about mountain bikes, for instance.&#34;\n  And people have been throwing long, skinny sticks for much, much longer. The original Olympics began around 2,700 years ago. But the original spear throwers go back another 400,000 years — that&#39;s 150 times older than the Olympics. Instead of Greeks running naked across a playing field, imagine some forest people, much hairier, probably with slightly protruding skulls, dashing through the forest with sticks that measure, behave and look like modern javelins.\n  In the mid-1990s, a team of researchers in Germany led by Professor Hartmut Thieme  found a bunch of 400,000-year-old spears buried in ancient mud. They were made of spruce, carefully carved, a little shorter than modern javelins, around seven feet instead of eight, but they are clearly meant to be thrown. Whoever made them, kept them wide close to the front for better lift.\n    Replicas were made and given to some modern athletes, who threw them for fun and got them to fly for up to 70 meters — a very respectable distance. But the irony is, back in prehistoric days, when forest javelin throwers used them, they often added a little booster in the form of a leather thong, called an  ankyle, that would set the javelin spinning, getting it to fly further.\n    Greek Olympians used this thong too, so their throws, presumably, were also enhanced, leaving me to think — and isn&#39;t this embarrassing? — that if we could invite a caveman or an original Olympian to watch modern men throw modern javelins, they&#39;d stand there, watch, see these sticks fly up, then down, and think ... what&#39;s their problem? We did it better.\n  That&#39;s a puzzlement. I understand the need for safety, but still — how must it feel to vie for a championship that in your heart of hearts you know won&#39;t measure up to those who&#39;ve gone before you?\n    Lots of athletes come to the Olympics hoping to be the Best Ever. But not javelin throwers. They&#39;ve been told to dream smaller dreams (&#34;Best Since 1984!&#34;) and I think that&#39;s a bum deal.\n  Why not take this event away from crowded arenas, go someplace safe, design the best flying spear possible, throw it as far as you can, and then whoever breaks the record can say to all spear throwers going back over the ages, &#34;Now I&#39;m Number One, in the truest sense — mine flew further than all of yours!", "posttime": "2021-08-09 12:32:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "标枪,olympic", "title": "为你的奥运标枪感到尴尬：穴居人做得更好吗？", "title_en": "Embarrassed by Your Olympic Javelin: Did Cavemen Do It Better?", "transed": 1, "url": "https://www.npr.org/sections/krulwich/2012/07/27/157486108/embarrassed-by-your-olympic-javelin-did-cavemen-do-it-better", "via": "", "real_tags": ["标枪", "olympic"]}, {"category": "", "categoryclass": "", "imagename": "91aec09dcbc9e53c17374682386bbd3f.jpg", "infoid": 1072230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用 .edu 或大学电子邮件地址，并通过 extracrunch@techcrunch.com 向我们的客户支持团队发送消息。请让他们知道您正在寻求学生折扣。该团队将在 24 小时内回复，并提供一个独特的链接来申请您的折扣。 Extra Crunch 是来自 TechCrunch 的会员制社区，可帮助初创团队和创始人取得成功。会员资格包括经验丰富的企业家对筹款和增长等创业主题的分析和建议。会员可以通过对创始人和投资者的深入采访来了解成功的初创公司如何运作，并通过市场分析、投资者调查和时事通讯发现趋势和机会。如果您有兴趣参加 TechCrunch 活动，作为 Extra Crunch 会员可以节省 20% 的门票费用。加入 Extra Crunch 后，请使用活动名称联系我们的客户服务团队，以获得任何 TechCrunch 活动的折扣代码。", "note_en": "Use a .edu or university email address and send a message to our customer support team at extracrunch@techcrunch.com. Please let them know that you are seeking the student discount.\n The team will respond within 24 hours with a unique link to claim your discount.\n   Extra Crunch is a members-only community from TechCrunch that helps startup teams and founders get ahead. Membership includes analysis and advice from experienced entrepreneurs on startup topics like fundraising and growth. Members can discover how successful startups operate through deep-dive interviews with founders and investors, and spot trends and opportunities with market analysis, investor surveys, and topical newsletters.\n If you have interest in attending TechCrunch events, you can save 20% on tickets as an Extra Crunch member. Once you join Extra Crunch, reach out to our customer service team with the event name to receive a discount code for any TechCrunch event.", "posttime": "2021-08-09 11:47:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crunch,student,团队", "title": "如何为 Extra Crunch 申请学生折扣", "title_en": "\n\t\t\t\tHow to claim a student discount for Extra Crunch\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/08/how-to-claim-a-student-discount-for-extra-crunch/", "via": "", "real_tags": ["crunch", "student", "团队"]}, {"category": "", "categoryclass": "", "imagename": "c3cca0c51b9d3e34a6cb9f4772d3f348.jpg", "infoid": 1072227, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些公司提供“评论者查找”服务，以便卖家可以寻找不满意的客户。如今，亚马逊在线市场上的大部分商品实际上并非来自亚马逊。据估计，该平台上销售的所有产品中有 56% 来自第三方卖家。现在，这些卖家不应该直接向亚马逊客户发送电子邮件，在亚马逊官方渠道之外这样做违反了平台的服务条款。然而，华尔街日报的一篇令人担忧的新报告显示，一些卖家仍在想方设法与买家取得联系，并催促他们编辑或删除负面评论，一些公司甚至提供“电子邮件提取”和“评论者查找”服务，因此卖家可以追捕不满意的客户。 《华尔街日报》采访过的一位这样的客户是纽约人凯瑟琳斯科特，她说她在 3 月份购买的厨房油喷雾瓶留下了负面评论，因为该产品没有达到广告宣传的效果。一周后，有人自称是卖家的客户服务代表，通过电子邮件联系她，要求退款以换取删除她的评论。 “我们愿意全额退款。当我们没有收到回复时，我们将假设您没有看到它，并将继续发送电子邮件，”该消息通过《华尔街日报》阅读。它以恳求结束：“我们希望你能在方便的时候重新考虑删除评论，好吗？”当 Scott 要求退款但拒绝撤下她的评论时，她收到了另一位代表发来的电子邮件，给她 20 美元，是她为该产品支付的价格的两倍，以将其删除。在接下来的几个月里，她又收到了几封不需要的电子邮件，所有这些电子邮件都缠着她撤回她的评论。 “这太令人毛骨悚然了。他们一遍又一遍地直接给我发电子邮件，”斯科特告诉媒体。\n至少有十多条其他类似产品的客户评论提到，卖家主动联系并迫使他们修改负面评论。 “产品不起作用，公司会打扰你，直到你改变评论，”一位客户写道，“华尔街日报”报道。 “卖家提供 20 到 30 美元来删除负面评论，”另一位说。另一位亚马逊客户、俄克拉荷马州塔尔萨市的本·亨丁（Ben Hendin）告诉该商店，在他对手指夹板留下负面评论后，卖家联系了他四次。为了说服他删除评论，卖家不断提高退款金额，最终达到 40 美元，是夹板成本的两倍多。根据其隐私声明，在与第三方卖家共享信息时，亚马逊只发布“与该第三方交易相关的客户个人信息”。合格的卖家可以选择使用亚马逊的买家-卖家消息服务，但该服务使用唯一的加密电子邮件地址，而不是客户的个人电子邮件。 “我们不会与第三方卖家共享客户电子邮件地址，”亚马逊发言人告诉《华尔街日报》。亚马逊针对卖家的客户产品评论政策明确禁止他们要求客户更改或删除他们的评论。卖家也被禁止向评论者提供“退款或其他补偿”以换取编辑他们的评论。至于卖家如何获得她的电子邮件地址，斯科特告诉《华尔街日报》，她有一个理论。她说，她的亚马逊包裹内附有一个“免费礼物”插入一个烹饪温度计，提示她输入她的电子邮件地址和订单 ID。公司发言人告诉《华尔街日报》，这种插入也违反了亚马逊的政策。亨丁说，他直接问卖家他们是如何得到他的联系信息的，据报道，该代表回答说：“老板是通过社交软件搜索姓名找到的。”卖家显然有足够的需求，公司已经开始提供明确致力于为不满意的客户寻找联系信息的服务。据报道，《华尔街日报》调查的一家公司 Matic Chain 为亚马逊卖家提供“电子邮件提取服务”。一位公司代表告诉媒体，它会通过谷歌和社交媒体进行梳理，以将买家的姓名与其联系信息相匹配。\n另一家提供类似服务的公司 ZonBoost 在其网站上公开宣传它。如下图所示，它宣传了一个“评论者查找”工具，只需 60 美元一次，您就可以插入亚马逊评论的链接，ZonBoost 承诺“以 100% 的准确度为您找到那些买家的姓名和个人电子邮件！” （技术上是 60 个“积分”，但每个积分的成本为 1 美元。）“我们所有功能的数据源都是亚马逊的数据库，保证 100% 的准确性！”阅读工具的问答页面。据该媒体报道，在《华尔街日报》就 Scott 的经历与亚马逊取得联系后，该列表、卖家和品牌都从平台上消失了。 “我们的内部流程发现了你强调的问题，并采取了适当的执法行动，”亚马逊发言人告诉媒体。他们继续说道：“亚马逊为卖家提供了大量帮助内容、主动指导、警告和其他帮助，以确保他们始终遵守我们明确规定的政策。我们为评论者和销售合作伙伴制定了明确的政策，禁止滥用我们的社区功能，我们会暂停、禁止并采取法律行动对付违反这些政策的人。试图滥用我们系统的不良行为者只占我们网站活动的一小部分，我们使用复杂的工具来打击他们，我们让他们越来越难以隐藏。”那么，如果卖家试图迫使您更改评论，您应该怎么做？亚马逊发言人告诉《华尔街日报》，客户可以通过发送电子邮件至 community-help@amazon.com 或点击评论页面上的“报告滥用”链接进行举报。在列出了我遇到的问题后，我在手持式仿冒 Waterpic 设备上遇到了这种情况，笨重、笨重、控件放置不当、水库小。他们会寄给我一个退货标签以便更好地审查。不会。他们会免费寄给我另一个改进版本，我可以保留旧版本以便更好地审查。不。然后是以上所有加上 20 美元。不。我看到所有这些好评，知道它们被买断了。我已经够老气了，以至于我想对我的意图和我写的东西诚实——如果我开始越过那条线，我的词就意味着 zilch。我仔细地将它清理干净并装箱——一个家庭成员最终想要它用于旅行。他们一直为改进的评论而纠缠我，不停地谈论有多少人喜欢该产品，我在亚马逊上毁了他们的好名声，等等，我不能只做这件事，加一两颗星然后说几句好话？经过 8 到 9 天的胡说八道，我终于告诉他们我保存了每封电子邮件，并将投诉转发给亚马逊，之后我再也没有听到任何消息。但他们有毅力坚持下去，直到我猜想很多人都屈服了。", "note_en": "Some companies are offering “reviewer lookup” services so sellers can hunt down unsatisfied customers.\n These days, most of the merchandise on Amazon’s online marketplace isn’t actually from Amazon. An   estimated 56% of all products sold on the platform come from third-party sellers. Now, these sellers aren’t  supposed to be able to email their Amazon customers directly, and doing so outside of Amazon’s official channels violates the platform’s terms of service.\n  However, a concerning new   Wall Street Journal report shows that some sellers are still finding ways to get in touch with buyers and hound them about editing or deleting their negative reviews, and some companies even offer “email extraction” and “reviewer lookup” services so sellers can hunt down unsatisfied customers.\n One such customer the Journal spoke with is New Yorker Katherine Scott, who said she left a negative review for a kitchen oil spray bottle that she bought in March after the product didn’t work as advertised. A week later, someone claiming to be a customer service rep from the seller reached out via email to offer her a refund in exchange for deleting her review.\n    “We are willing to refund in full. When we do not receive a response, we will assume that you did not see it, and will continue to send emails,” the message read via the Journal. It concluded with a plea: “We hope you can reconsider deleting comments at your convenience okay?”\n  When Scott asked for a refund but refused to take down her review, she received an email from another representative offering her $20, double what she paid for the product, to delete it. She received several more unwanted emails over the next few months, all pestering her to take her review down.\n   “It was so creepy. They emailed me directly about it over and over,” Scott told the outlet.\n At least a dozen other customer reviews for similar products mentioned that the seller reached out and pressured them to revise their negative review. “Product doesn’t work and company will bother you till you change review,” one customer wrote, the Journal reports. “Seller offers $20-$30 to delete negative reviews,” said another.\n  Another Amazon customer, Ben Hendin of Tulsa, Oklahoma, told the outlet that a seller reached out to him four times after he left a negative review of a finger splint. To try to convince him to delete the review, the seller kept upping the refund amount, eventually reaching $40, more than double what the splint cost.\n When it comes to sharing information with third-party sellers, Amazon only releases “customers’ personal information related to those transactions with that third party,” according to its   privacy notice.  Qualified sellers have the option of using Amazon’s buyer-seller messaging service, but that uses a unique encrypted email address rather than the customer’s personal email.\n  “We do not share customer email addresses with third-party sellers,” an Amazon spokesperson told Journal.\n Amazon’s   customer product review policies for sellers explicitly prohibit them from asking a customer to change or remove their review. Sellers are also banned from offering “a refund or other compensation” to a reviewer in exchange for editing their review.\n  As for how the seller got her email address, Scott told the Journal she had a theory. Her Amazon package came with a “free gift” insert for a cooking thermometer that prompted her to enter her email address and order ID, she said. This kind of insert is also against Amazon’s policies, a company spokesperson told the Journal. Hendin said he asked the seller directly about how they got his contact information, to which the representative reportedly replied: “Boss found it through social software search for names.”\n There’s apparently enough demand from sellers that companies have begun offering services explicitly dedicated to finding contact info for unsatisfied customers. One company the Journal investigated, Matic Chain, reportedly offers an “email extraction service for Amazon sellers.” A company representative told the outlet that it combs through Google and social media to match a buyer’s name with their contact information.\n  Another company that offers similar services, ZonBoost, openly boasts about it on its website. As screenshotted below, it advertises a “Reviewer Lookup” tool where, for just $60 a pop, you can plug in the link to the Amazon review and ZonBoost promises to “find you those buyers’ name &amp; personal email with 100% accuracy!” (Technically it’s 60 “credits,” but each credit costs one dollar.)\n   “The data source of all of our features is Amazon’s database, which guarantees 100% accuracy!” reads the tool’s Q&amp;A page.\n  After the Journal reached out to Amazon about Scott’s experience, the listing, seller, and brand all disappeared from the platform, according to the outlet.\n  “The issue you’re highlighting was detected by our internal processes, and the appropriate enforcement actions were taken,” an Amazon spokesperson told the outlet. They continued:\n “Amazon provides a great deal of help content, proactive coaching, warnings and other assistance to sellers to ensure they remain compliant with our clearly stated policies. We have clear policies for both reviewers and selling partners that prohibit abuse of our community features, and we suspend, ban and take legal action against those who violate these policies. Bad actors that attempt to abuse our system make up a tiny fraction of activity on our site and we use sophisticated tools to combat them and we make it increasingly difficult for them to hide.”\n  So what should you do if a seller tries to pressure you into changing your review? An Amazon spokesperson told the Journal that customers can report them by emailing community-help@amazon.com or click the “Report Abuse” link on the review page.\n        I had this happen with a handheld knock-off Waterpic device after listing the problems I had with it, heavy, cumbersome, poor placement of controls, small reservoir. They would send me a return label for a better review. No. They would send me another improved version free and I could keep the old one for a better review. No. Then came all of the above plus $20 bucks. No. I see all these good reviews and know they are bought off. I am old fashioned enough to feel like I wanted to be honest about my intentions and also what I wrote—if I start crossing that line, my word means zilch. I cleaned it carefully and boxed it up—a family member ended up wanting it for travel. They kept badgering me for that improved review, going on and on about how many people love the product, I am ruining their good name with Amazon, etc., can’t I just do this one thing, add a star or two and say a few good words? After 8-9 days of this nonsense I finally told them I saved every email and will forward them to Amazon with a complaint and after that I never heard another word. But they have the tenacity to keep at it until many, I assume, just give in.", "posttime": "2021-08-09 11:20:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,追捕,party,卖家", "title": "据报道，亚马逊第三方卖家追捕留下差评的客户", "title_en": "Amazon Third-Party Sellers Reportedly Hound Customers Who Leave Bad Reviews", "transed": 1, "url": "https://gizmodo.com/heres-how-amazon-third-party-sellers-reportedly-hound-c-1847446648", "via": "", "real_tags": ["amazon", "亚马逊", "追捕", "party", "卖家"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "等待。在你说点击诱饵之前，让我们关注癌症的定义。它是一组涉及异常细胞生长的疾病，有可能侵入或扩散到身体的其他部位。现在，让我们用软件和工业等词代替疾病和细胞生长。在过去 15 年左右的时间里，自从第一个软件泡沫破灭并且开发人员意识到他们需要一种新的赚钱方式以来，软件语言和开发学科的发展就出现了令人震惊和不受控制的趋势，所有这些都旨在支持并维持自己。一种具有前所未有传播力的生物体。癌症。在测试 Fedora 25 时，我第一次体验了 Wayland，当我访问官方页面并阅读宣言时，我才恍然大悟。在这里，我们有一个新框架，创建它的目的是使开发人员更容易开发它。什么。以前，当我摆弄 systemd 并试图解决由一堆复杂的代码产生的问题时，一种非常相似的情绪爆发，除了成为一堆复杂的代码之外，没有其他目的没有人可以调试，但是对于喜欢写Python的人来说写Python或一些类似的废话更有趣。火狐，同样的事情。我们有一个浏览器，它正在尽一切努力使自己成为一个不同的浏览器。现在，它正在改变它的结构，即扩展机制，以便我们得到一个与旧框架完全不兼容的新扩展框架，而且它会疏远所有现有用户。哦，是的，用户。据称应该从所有这些软件游戏中受益的目标受众。没有了，不会再有了。 Windows 10，Linux Mint 18.1 Serena，更多触发我疲惫不堪的灵魂。新的东西出来取代旧的东西，除了残废，要花很多年才能达到旧软件的成熟程度，然后又被砍掉，发布一个新的残废版本，循环再次开始.这个列表是无止境的。技术（包括软件）的目的是让生活更轻松、更高效、更安全、更愉快。达到目的的手段，而不是目的。我们使用的任何东西都可以帮助我们满足原始需求。例如，浏览器是知识和娱乐的门户。该软件旨在让我们快速有效地访问网页，正确显示它们，并防止在我们的系统上无根据地安装新软件。就这样。而已。但不是。如果你全面看，这不是你得到的。当然，有一个强大的商业元素，当然，但大部分源于这样一个事实，即浏览器需要强大的开发和没有人真正想要的新功能。\n这是一个典型的生物体需要进食的案例，这样它才能变得更好，从而可以喂更多的食物。但是如果你仔细想想，浏览器不需要它们一半的功能，它们的添加和开发只是因为编写软件的人想要确保他们有工作安全和额外的控制权。韦兰，同样的故事。对其存在的论证是毫无意义的。在服务器端，99% 的时间你根本不需要图形环境，所以这与那里的庞大行业无关。在家庭设置中，旧框架做得很好，从用户的角度来看，一切都很好。普通人不知道或不关心是什么为他们的盒子提供动力。这是优秀产品的标志。它是透明的。但是现在，我们有 Wayland - 和 Mir - 并且多年来，我们将处于测试阶段的状态，直到开发人员完成游戏，如果有的话，之后他们将找到另一个借口来创建另一个框架并重新开始，对待整个世界作为他们自己娱乐和利润的一个大沙箱。或者也许只是娱乐。毕竟，当编写代码是你的激情、你的工作和你的目标时，你永远不会真正完成，对吧。 Linux 中的 init 系统也是如此，比如 systemd。简而言之，系统应该快速启动并进入工作会话。我们在 2010 年左右有了这个，使用 init.d 启动时间缩短到仅仅 10 秒。没有缺陷，没有错误。即使在商业领域，使用 init，我也不记得有任何重大问题。然后，突然间，我们有了一个包含一亿个模块的新二进制文件，在过去的五年里，这种不稳定、半生不熟、无法调试的废话是大多数 Linux 发行版的支柱。 systemd 框架的侵入性和普遍性也影响了用户空间的稳定性，这是它本不应该触及的东西，而且几乎所有 Linux 桌面质量问题都与 systemd 的引入相吻合。当然，开发仍在继续，没有充分的理由，只是为了达到我们五年前拥有的稳定性、成熟度和功能性水平。有人通过编写复杂的代码来解决一个不存在的问题，从而为自己赢得了大量的月薪。这种趋势在整个行业都很普遍。所有新的软件框架都非常复杂。所有的编排机制都是功能和流行语的垃圾盛会，没有任何关注最终任务。你从容器之类的东西开始，但它们太复杂了，它们需要一个调控器。所以你最终得到了一个抽象机制，但是网络层很烂，或者它不成熟。所以别人开发了一个基于软件的虚拟网络框架。然后，又有三家公司创建了自己的编排工具，而且碎片化太多了。这需要一个新的框架来管理所有其他框架。都是因为最初的实现很糟糕。这是寄生行为的典型案例。事实上，现代软件开发可以这样总结：就像 Sense &amp; Sensibility，只有更好。当然，整个 dot-com - 或者我应该说 dot-io - 软件狂热是如此有利可图，以至于每个人都赶上了潮流，这是一列现在以 1,450 公里/小时行驶的子弹头列车，每个人都在紧紧抓住，以免他们的利润消亡。这也导致了一群白痴涌入软件世界，现在他们有了特殊的词和短语来打动其他白痴，让他们相信这个数字宗教。\n白痴使用的最特殊的词。公司现在拥​​有快速的发布周期，而不是一年左右发布一次软件，并且他们应该坚持这种敏捷模型，以将自己与潜在的遗留恐龙区分开来。这会导致版本号快速增加并大大降低质量。但这就是事情 - 有很多版本会产生一种活动的印象，这就像是，部长，第 2 季，第 1 集，同情社会中的行政事务部，一家没有病人但有大量行政人员的医院.时间指数17分54秒。纯金：当然，敏捷模型并不真正适用于 90% 的公司，因为他们认为这与速度有关。他们忘记了一些细节，比如指派他们最好的人来开发这些产品、自律的需要、高度的自主权，当然还有能够创建具有合理里程碑的软件产品。但只要他们敏捷，他们就无法触及。因为他们敏捷。敏捷，你听到了！有人认为最好控制代码猴子并阻止它们使操作变得难以忍受。基本上是版本控制和配置管理，系统管理员负责服务器。除了他们把所有的时间都花在编写代码和调试上，而不是管理服务器上。一个美丽的悖论。敏捷 + DevOps 的同义词。如果您听到有人这么说，请询问他们是否使用 TDD，然后告诉他们您更喜欢 OpenTTD 并大笑（或拔掉他们七台显示器中的一台）。管理层最喜欢用的流行语来描述他们不知道它做什么以及它如何工作的东西。但这应该意味着 - 你是一个白痴，你不能编码，在这里，在这里使用这一行，当它运行时，它会从某个地方的服务器检索一些东西。换句话说，很多时候，HTML 命令封装在废话中。有人写了糟糕的代码，所以有人写了更多的代码来以不那么糟糕的方式管理糟糕的代码。赚取巨额资金的绝佳方式。被视为精明的最有利可图的方式，尤其是在云领域。\n这是EVAR最天才的发明。基本上，您将一个微型 Web 服务器嵌入到一切（最有可能是 Linux）中，然后您使用“API”连接到它，这样您就可以以数字方式控制事物。这个概念的智慧在于，它至少会在 20 到 30 年内养活整个 2000 年后的泡沫，所以我们现在还不需要面对另一场革命。物联网现实将在未来几十年内为大约 1 亿开发人员创造就业机会，并为那些做对的人带来大量现金。这就是你的问题根源。当您让具有绝对零社交和营销技能的人告诉世界最终产品应该是什么样子时。当您让软件开发人员定义最终状态时，您的世界看起来就像一个大型调试器会话。这太愚蠢和毫无意义了，看真人秀感觉就像在发明微积分。这就是为什么你有一百种毫无意义的编程语言，它们的目的只是让正在某个地方编写软件的人在椅子上感觉更舒服。用户是一个麻烦，发明使用模式来证明软件决策的合理性。一个很好的例子是顶部标签。这违背了基本的人类思维、阅读逻辑，当然还有 UI 层次结构，但是当您让《星球大战》粉丝决定事物的外观时，这就是您的最终结果。如果有的话，软件产品——好的软件产品——应该由没有受过正规计算科学教育，甚至可能没有技术技能的人设计。您希望他们专注于人类需求以及人们如何与事物互动。不是通过厨师的眼睛，他们将按钮、字段和表格视为下一次薪水的成分，而是通过寻求解决问题和满足原始需求的人的眼睛。取而代之的是，越来越多的公司因为让开发人员上市而失去了对其产品的控制权。原因是，谷歌、微软和 Facebook 是由书呆子创建的，所以每个人都认为，如果他们在相机前放置一个高光谱的人，或者让他们设计软件，他们最终会成为这个价值数十亿美元的企业集团.除了这不是它的工作原理。从本质上讲，编写代码的人只是光荣的数字焊工。他们需要连接以神秘方式书写的点点滴滴的文本，以便他们做一些有用和高尚的事情。当你让软件方法论成为你的工作方式时，坏事就会发生。让我们回到 Firefox，然后我们将更多地讨论 Linux，这两者对我来说都是很宝贵的。\nFirefox 是一个浏览器。一个信息和娱乐的门户。 2011 年的某个时候，Mozilla 决定将 Firefox 更改为更像 Chrome。你猜怎么着？ 2017 年，Firefox 的市场份额比 2011 年减少了约 50%。因为当您可以拥有原始版本时，为什么还要进行克隆？此外，在这六年里，Mozilla 引入了软件驱动的变化，比如顶部垃圾标签（每个标签都是一个单独的过程，谁在胡说八道）、快速的发布周期、几个不需要人类需要的毫无意义的功能，以及现在他们还打算为新的扩展机制更改扩展机制，同样是因为旧的机制太复杂且难以编码或其他东西。他们不会强迫他们的特殊雪花努力工作并创造无缝产品，而是会做完全相反的事情。他们会破坏旧的框架，建立一个新的、未定义的框架，99% 的扩展都会消失，更多的人会放弃浏览器，因为附加组件是人们坚持使用 Firefox 的主要原因。这很明显，但当你喜欢 GOLANG 时就不是这样了。应该做的事情 - 鞭策开发人员提交，迫使他们创建一个支持一切的向后兼容框架，并进行不以任何方式影响用户的后端更改。这就是产品驱动开发的完成方式。相反，您让开发人员谈论 WebExtensions - 注意愚蠢的命名约定 - 以及 API 和主题标签，我们有一个新的小写徽标，我们很酷很现代。您是否了解新的 Mozilla 徽标？查看更改的原因 - 对 URL 语言的认可。什么？如果我问我爷爷关于 URL 语言的问题，他会给我一块砖，让我去雷区玩，但之前不会因为我胡说八道而用它砸我的头。回到 WebExtensions，你有开发人员在谈论如何做到这一点。不，我不想读技术胡言乱语。我不在乎。我关心的是当我启动浏览器时，我的主要需求得到满足。如果代码更改扰乱了我的使用模型，那么它就是糟糕的代码。我不在乎是否有人需要在地下室度过 100 年才能解决这个问题，这不是我的问题。 PS 如果您想知道会发生什么，Firefox 将失去更多的市场份额，因为一旦扩展停止工作，忠实用户将更没有动力继续使用试图模仿 Chrome 的浏览器。 Linux。呃，好吧。关于Linux有什么要说的。一切。相同的功能，10 个不同的程序。 10 种不同的叉子和勺子，创造出来让人们可以在他们喜欢的时候编写代码。臃肿、复杂和自私的新音频和视频框架。更多错误，更多崩溃，性能下降，电池寿命缩短。这就是软件驱动开发的最终结果。因为对于开发者来说，这是一个可爱而多彩的游乐场。这就是他们呼吸和生活的东西。对于最终用户来说，这是业余爱好者设计的噩梦。\n脉冲音频？我的声音好点了吗？不，该死。韦兰？我的图形更好吗？不，该死。系统？我的系统是否更稳定和/或启动更快？不，该死。这个列表一直在继续，一直在继续。 Windows 10。半生不熟的版本。我没有为你将在 2 年内完成的半生不熟的废话付钱。当我在 7/8 年前在 Windows 中拥有完美健全和功能强大的控制面板时，我不需要一个系统设置菜单，它会在 6 个月后等同于控制面板。发布大量小东西的整个过程通常可能会以两位数的智商给白痴们留下深刻印象，但归根结底，如果我们忽略闪亮的开放式办公室、台球桌、免费汽水和其他高科技废话，除了给别无选择的最终用户带来更多痛苦和复杂性之外，没有什么根本性的变化。幸运的是，安抚白痴很容易——只要给他们一些闪亮的东西，让他们更容易观看视频，SFW 和 NSFW 风格，以及充满大图标的可滑动屏幕，就像他们在电影 Idiocracy 中使用的那样。这就是为什么这种由软件驱动的废话可以存活下来的原因。最后，我们需要满足基本需求。然后，意识到一切都非常简单。为什么智能手机会成功？因为它们让普通人可以更便宜、更快速地做他们在 PC 上做的事情。不是我们极客喜欢的高端东西，而是普通用户的普通邮件/pr0n/音乐活动。为什么平板电脑没有成功？因为他们试图同时扮演笔记本电脑和智能手机的角色，但从未完全搞定。就此而言，上网本属于同一类别，正如我在关于计算的未来的文章中已经解释的那样，并且我还提到了高端 PC 的强劲发展。他们再次成为这样，因为人们需要权力。在同一篇文章中，我还谈到了 Firefox 没有消亡或衰落或其他什么——就在他们完全改变他们的重点和方法并毁掉它之前。基本需求。当您通过这些镜头观察技术世界时，您会意识到软件无关紧要。 Linux 桌面毫无意义，但 Android 是移动之王。微软统治了桌面，但它在手机上挣扎。所以它不是软件。这是使用模型。这是他们能满足什么样的基本需求。因此，如果您想知道为什么不允许软件开发人员做任何事情而不仅仅是编写代码，那么请查看成功的产品并尝试找出底层代码的共同点是什么。没有。软件是完全可替换的，并且必须完全透明。\n这是衡量好代码成功与否的一种标准。拿任何产品来说，比如 Linux 桌面。然后从一年前拿一个。你仍然可以做同样的事情和工作负载，或者你是否需要问自己诸如哪个发行版、版本、内核、环境、库之类的问题？不，因为您无法将代码与使用模型分离，所以您知道它毫无意义，需要删除。对于过去五年在 Linux 中出现的几乎所有主要产品和框架来说都是如此。这与软件的年龄以及它是否适合现代时代无关。大多数关键的东西运行在几十年前设计的操作系统上，仍然是用 70 年代的编程语言编写的。大惊小怪的只是整个物联网的废话。真没用的东西。这不是为了让开发人员更容易 - 因为您可能天真地认为他们会有更多时间来解决用户问题。不。因为如果他们的代码有问题，他们就不能一开始就这样做，而是节省所有的时间。一旦他们用一个半成品的产品“钉”了它，他们就会感到无聊并开始着手另一个测试项目。一个活的有机体需要自我维持和成长，记得吗？当增长不受控制时，好吧。刚从大学或大学毕业的孩子们可能会对这个充满混乱和编程语言的勇敢新世界印象深刻，但归根结底，这与用户有关。如果你去找木匠要一件家具，他们应该为你建造。软件开发的类比是，他们会让你相信床比椅子好，以及代码人员如何更容易地构建和支撑椅子。那不飞。每天，我花几个小时坐在电脑前，做各种各样的事情。我宝贵的时间中有相当一部分时间花在了烦恼上，想知道我的浏览器、办公套件、桌面环境，甚至操作系统本身什么时候会突然停止工作，因为一些软件开发人员认为他们很无聊。我不知道老年人对他们的火车、收音机、长途汽车或其他任何东西是否有这种感觉，但我对此表示怀疑。今年2000幼儿园的废话该停止了。一旦软件开发淡入应有的安静背景，公司重新关注用户，我们将看到创造力、质量和乐趣的激增。当我去餐厅时，我不想 k ......", "note_en": "Wait. Before you say clickbait, let&#39;s focus on the definition of cancer. It is a group of diseases involving\r\t\t\t\tabnormal cell growth with the potential to invade or spread to other parts of the body. Now, let&#39;s replace\r\t\t\t\tdiseases and cell growth with words like software and industry.\n  In the past 15 years or so, ever since the first software bubble was burst and developers realized they needed\r\t\t\t\ta new way of making easy money, there&#39;s been an alarming and unchecked trend in the growth of software\r\t\t\t\tlanguages and development disciplines, all designed to support and sustain themselves. A living organism with\r\t\t\t\tunprecedented spread. Cancer.\n    While testing  Fedora 25, I had my first taste of  Wayland, and it was when I visited the official page and read the\r\t\t\t\tmanifesto that it dawned on me. Here we had a new framework, created to make it easier for those developing it\r\t\t\t\tto develop it. What. Previously, a very much similar platter of emotions erupted in my being while fiddling\r\t\t\t\twith  systemd and trying to\r\t\t\t\tsolve problems that were created by, guess, systemd, a complicated pile of code with no other purpose other\r\t\t\t\tthan to be a complicated pile of code that no one can debug, but it is more enjoyable for those who like\r\t\t\t\twriting Python to write Python or some similar nonsense.\n  Firefox, the same thing. We have a browser that is doing everything to make itself into a different browser.\r\t\t\t\tAnd now, it is changing its very fiber, the extensions mechanism, so that we get a new framework of extensions\r\t\t\t\tthat is completely incompatible with the old one, plus it&#39;s going to alienate all the existing users. Oh yes,\r\t\t\t\tusers. Supposedly the target audience who should benefit from all these software games. No, not anymore.\n  Windows 10,  Linux Mint 18.1\r\t\t\t\tSerena, more triggers for my battered, weary soul. New stuff that is coming out to replace old stuff,\r\t\t\t\texcept it&#39;s crippled, it takes a bunch of years to reach the level of maturity of the old software, and then\r\t\t\t\tit&#39;s axed again, a new crippled version is released, and the cycle begins again. The list is endless.\n        The purpose of technology, software included, is to make lives easier, more productive, safer, more enjoyable.\r\t\t\t\tA means to an end, not the end. Anything we use is there to help us satisfy primal needs.\n  For instance, a browser is a portal unto knowledge and entertainment. This piece of software is designed to get\r\t\t\t\tus to webpages quickly and efficiently, display them correctly, and also prevent unwarranted installation of\r\t\t\t\tnew software on our systems. That&#39;s all. Nothing more. But no. If you look across the board, this is not what\r\t\t\t\tyou get. Sure, there&#39;s a strong commercial element, of course, but most of it stems from the fact that browsers\r\t\t\t\trequire strong development and would-be new features that no one truly wants.\n  This is a classic case of an organism that needs to feed so it can get better so it can feed some more. But if\r\t\t\t\tyou think carefully, browsers do not need half the features they have, and they have been added and developed\r\t\t\t\tonly because people who write software want to make sure they have a job security and extra control.\n  Wayland, same story. And the argument for its existence is meaningless. On the server side, 99% of the time you\r\t\t\t\tdon&#39;t need the graphical environment at all, so this has nothing to do with the vast industry out there. In the\r\t\t\t\thome setup, the old framework was doing well, and from the user perspective, things were just fine. Normal\r\t\t\t\tpeople don&#39;t know or care what powers their box. And that&#39;s a sign of an excellent product. It&#39;s transparent.\n  Now though, we have Wayland - and Mir - and for years, we will be in a state of beta limbo until developers\r\t\t\t\tfinish playing, if ever, after which they will find another excuse to create another framework and start again,\r\t\t\t\ttreating the entire world as one big sandbox for their own amusement and profit. Or maybe just amusement. After\r\t\t\t\tall, when writing code is your passion, your job and your goal, you don&#39;t ever really finish, do you.\n    The same can be said of the init systems in Linux, like systemd. In a nutshell, the system should start quickly\r\t\t\t\tand get into a working session. We had this in 2010 or so, with boot times down to mere  10 seconds using init. No flaws, no\r\t\t\t\tbugs. Even in the commercial sphere, working with init, I do not recall any major problems.\n  Then, suddenly, we have this new binary diarrhea with a hundred million modules, and for the past five years,\r\t\t\t\tthis unstable, half-baked, undebuggable nonsense is the backbone of most Linux distros. The invasive and\r\t\t\t\tpervasive nature of the systemd framework has also affected the stability of the user space, the very thing it\r\t\t\t\tshould never have touched, and pretty much all problems with the quality of the Linux desktop nicely coincide\r\t\t\t\twith the introduction of systemd. The development continues, of course, and for no good reason than trying to\r\t\t\t\treach the level of stability, maturity and functionality that we had half a decade ago. Someone landed\r\t\t\t\tthemselves a lot of monthly pay checks by writing complex code to solve a problem that did not exist.\n      And this trend is prevalent across the industry. All the new software frameworks are horribly complex. All the\r\t\t\t\torchestration mechanisms are a garbage fest of functions and buzzwords, without any focus on the end mission.\r\t\t\t\tYou start with something like containers, but they are so complex, they need a governor. So you end up with an\r\t\t\t\tabstraction mechanism, but the network layer sucks, or it is immature. So someone else develops a\r\t\t\t\tsoftware-based virtual network framework. Then, three more companies create their own orchestration tools, and\r\t\t\t\tthere&#39;s too much fragmentation. This calls for a new framework that will manage all these others. All because\r\t\t\t\tthe initial implementation is lousy. This is a classic case of parasitic behavior. In fact, modern software\r\t\t\t\tdevelopment can be summed thusly:\n      Like Sense &amp; Sensibility, only better. Of course, this whole dot-com - or should I say dot-io - software\r\t\t\t\tmania is so profitable that everyone jumped the bandwagon, it&#39;s a bullet train now traveling at 1,450 km/h, and\r\t\t\t\teveryone is clinging dearly and fiercely, lest their profits perish. This has also led to a tide of morons\r\t\t\t\tflocking to the software world, and now they have  special\r\t\t\t\twords and phrases to impress other morons into buying into this digital religion.\n    The most special word used by morons. Rather than releasing software once a year or so, companies now have a\r\t\t\t\trapid release cycle, and they supposedly adhere to this agile model, to distinguish themselves from the\r\t\t\t\twould-be legacy dinosaurs. This leads to a quick increment in versions numbers and much reduced quality.\n  But that&#39;s the thing - having lots of versions creates an impression of ACTIVITY, and this is exactly like the\r\t\t\t\tMinistry for Administrative Affairs in Yes, Minister, Season 2, Episode 1, The Compassionate Society, a\r\t\t\t\thospital with no patients but tons of administrative staff. Time index  17 minutes 54 seconds. Pure gold:\n    Of course, the agile model does not really work for 90% of companies, because they think it&#39;s about speed. They\r\t\t\t\tforget the fine details like assigning their best people to work on these products, the need for\r\t\t\t\tself-discipline, a high level of autonomy, and of course, being able to create software products with\r\t\t\t\treasonable milestones. But as long as they are agile, they are untouchable. Because they are agile. Agile, you\r\t\t\t\thear!\n    Someone thought it would be good to reign in the code monkeys and stop them from making the operations\r\t\t\t\tunbearable. Basically, version control and configuration management, with system administrators in charge of\r\t\t\t\tthe servers. Except they spend all of their time writing code and debugging it rather than administering\r\t\t\t\tservers. A beautiful paradox.\n    A synonym for Agile + DevOps. If you hear someone say this, ask them if they use TDD and then tell them you\r\t\t\t\tprefer  OpenTTD and laugh (or unplug one of their seven monitors).\n        The favorite buzzword used by management to describe something they have no idea what it does and how it works.\r\t\t\t\tBut it supposed to mean - you are an idiot, you cannot code, here, use this line here, and when it runs, it\r\t\t\t\twill retrieve something from a server somewhere. In other words, quite often, HTML commands encapsulated in\r\t\t\t\tbullshit.\n    Someone wrote shitty code, so someone wrote more code to manage shitty code in a less shitty way. An excellent\r\t\t\t\tway of making huge money. The most profitable way of being perceived as savvy, especially in the cloud space.\n    This is the most genius invention EVAR. Basically, you embed a tiny Web server into everything (most likely\r\t\t\t\tLinux), and then you use &#34;API&#34; to connect to it, so you can control things digitally. The wisdom of this\r\t\t\t\tconcept is that it will feed the entire post-2000 bubble for another 20-30 years at least, so we need not face\r\t\t\t\tanother revolution just yet. The IoT reality will create jobs for roughly a hundred million developers in the\r\t\t\t\tnext few decades and bring in shitloads of cash to those who do it right.\n    There&#39;s your root of the problem. When you get people with absolute zero social and marketing skills tell the\r\t\t\t\tworld what the end product should be like. When you let software developers define the final state, your world\r\t\t\t\tlooks like one big debugger session. This is so stupid and pointless that watching  reality TV feels like inventing calculus.\n  This is why you have a hundred pointless programming languages out there, which serve no higher purpose than to\r\t\t\t\tmake whoever is writing a piece of software somewhere feel more comfortable in their chair. The user is a\r\t\t\t\tnuisance, and usage patterns are invented to justify software decisions.\n  A great example is the  tabs-on-top shit. This goes against basic\r\t\t\t\thuman thinking, reading logic, and of course, UI hierarchy, but when you get Star Wars fans dictating how\r\t\t\t\tthings should look, this is what you end up with.\n    If anything, software products - good software products - should be designed by people who have no formal\r\t\t\t\tcompute science education, perhaps even no tech skills. You want them to focus on human needs and how people\r\t\t\t\tinteract with things. Not through the eyes of a cook, who sees buttons and fields and forms as ingredients to\r\t\t\t\ttheir next pay check, but through the eyes of a human who seeks to solve a problem and satisfy a primal need.\n  Instead, more and more companies are losing control of their products by letting their developers go public.\r\t\t\t\tThe reason is, Google and Microsoft and Facebook were created by nerds, so everyone thinks that if they put\r\t\t\t\tsomeone high on the spectrum in front of a camera or perhaps let them design software that they will end up\r\t\t\t\tbeing this multi-billion-dollar conglomerate. Except that&#39;s not how it works.\n  Essentially, people who write code are just glorified digital welders. They need to connect bits and pieces of\r\t\t\t\ttext written in an arcane way so that they do something useful and noble. When you let software methodology\r\t\t\t\tbecome your modus operandi, bad things happen. Let&#39;s go back to Firefox, and then we shall talk some more about\r\t\t\t\tLinux, both of which are dear to me.\n  Firefox is a browser. A portal of information and entertainment. Sometime in 2011, Mozilla decided to change\r\t\t\t\tFirefox to be more like Chrome. Guess what? In 2017, Firefox has about 50% less market share than it did in\r\t\t\t\t2011. Because why go for a clone when you can have the original?\n  Furthermore, in these six years, Mozilla introduced software-driven changes, like tabs-on-top crap (each tab is\r\t\t\t\ta separate process supposedly, who gives a shit), rapid release cycles, several  pointless features that serve no human need, and now they are also going to\r\t\t\t\tchange the extensions mechanism for a new one, again because the OLD ONE IS TOO COMPLEX AND DIFFICULT TO CODE\r\t\t\t\tOR SOMETHING.\n      Rather than forcing their special snowflakes to work hard and create a SEAMLESS product, they will do exactly\r\t\t\t\tthe opposite. They will destroy the old framework, put in place a new and undefined one, 99% of all extensions\r\t\t\t\twill die, and even more people will abandon the browser, because add-ons are the chief reason why people stick\r\t\t\t\twith Firefox. This is so obvious, but not when you pleasure yourself to GOLANG.\n  What should have been done - whip the developers into submission, force them to create a backward-compatible\r\t\t\t\tframework that supports everything, and make backend changes that do not affect the user in any way. That&#39;s how\r\t\t\t\tproduct-driven development is done. Instead, you have developers talking about WebExtensions - notice the\r\t\t\t\tstupid naming convention - and API and hashtag, and we have a new lowercase logo, we&#39;re cool and modern. Did\r\t\t\t\tyou read about the  new Mozilla logo?\n  Look at reasons for the change - a nod to URL language. What? If I had asked my granddad about URL language, he\r\t\t\t\twould haven given me a brick and sent me to play in the minefield, but not before hitting me on the head\r\t\t\t\twith it for talking nonsense.\n  Back to WebExtensions, you have developers talking crap on how this will be done. No. I don&#39;t want to read\r\t\t\t\ttechnobabble. I don&#39;t care. What I do care is that when I launch my browser, my PRIMAL NEEDS are satisfied. If\r\t\t\t\ta code change disrupts my usage model, it&#39;s shitty code. I don&#39;t care if someone needs to spend 100 years in a\r\t\t\t\tbasement fixing this, it&#39;s not my problem. P.S. If you&#39;re wondering, what will happen is, Firefox will lose\r\t\t\t\teven more market share, because once extensions stop working, there will be even less incentive for loyal users\r\t\t\t\tto stay with a browser that is trying to ape Chrome.\n  Linux. Ah well. What is there to say about Linux. Everything. Same functionality, 10 different programs. 10\r\t\t\t\tdifferent forks and spoons, created so someone can write code when they feel like it. New audio and video\r\t\t\t\tframeworks that are bloated and complex and self-serving. More bugs, more crashes, reduced performance, reduced\r\t\t\t\tbattery life. That&#39;s the end result of software-driven development. Because for developers, this is a lovely\r\t\t\t\tand colorful playground. This is what they breathe and live. For end users, it&#39;s a nightmare designed by\r\t\t\t\tamateurs.\n    PulseAudio? Is my sound any better? No. Shit. Wayland? Are my graphics any better? No. Shit. Systemd? Is my\r\t\t\t\tsystem more stable and/or boots faster? No. Shit. And the list goes on and on and on and on.\n  Windows 10. Half-baked releases. I didn&#39;t pay money for a half-baked crap you will complete in 2 years. I don&#39;t\r\t\t\t\tneed a system settings menu that will be  equivalent to the Control\r\t\t\t\tPanel in 6 months when I had the perfectly sane and functional Control Panel in Windows 7/8 years ago.\n  This whole thing of releasing lots of small things often may impress cretins with their double-digit IQ, but\r\t\t\t at the end of the day, if we ignore all the glamor and drama of shiny open-space offices, pool tables, free soda,\r\t\t\t and other hi-tech crap, nothing fundamental changes except more misery and complication for end users, who have\r\t\t\t no choice.\r\t\t\t  Luckily, it&#39;s so easy to placate cretins - just give them shiny things that make it easier to watch videos,\r\t\t\t\tboth the SFW and NSFW flavors, and swipable screens full of big icons the likes of which they use in the film\r\t\t\t\tIdiocracy. That&#39;s why this software-driven nonsense can survive.\n    In the end, we need to go to basic needs. And then, realize how everything is very simple. Why did smartphones\r\t\t\t\tsucceed? Because they allowed a common person to do the same things they did on the PC cheaper and faster. Not\r\t\t\t\thigh-end stuff that we geeks love, but the ordinary mail/pr0n/music activities of the average user. Why did\r\t\t\t\ttablets not succeed? Because they tried to fulfill the roles of a laptop and smartphone at the same time and\r\t\t\t\tnever quite nailed it.\n  For that matter, netbooks fall into the same category, as I&#39;ve already explained in my article on the  future of computing, and where I also mentioned the high-end PC going strong. Which\r\t\t\t\tthey are, once again, because people need power. In that same article, I also talked about Firefox not dying or\r\t\t\t\tdeclining or whatever - this was just before they completely changed their focus and approach and ruined it.\r\t\t\t\tBasic needs.\n    And when you look at the world of technology through these lenses, you realize that software is irrelevant.\r\t\t\t\tLinux desktop is meaningless but Android is the king of the mobile. Microsoft rules the desktop and yet it\r\t\t\t\tstruggles on the phone. So it&#39;s not software. It&#39;s the usage model. It&#39;s what sort of basic needs they can\r\t\t\t\tsatisfy.\n  So if you ever wonder why software developers should not be allowed to do anything more than just write code,\r\t\t\t\tlook at successful products and try to figure out what the common denominator is in terms of underlying code.\r\t\t\t\tThere isn&#39;t any. Software is entirely replaceable, and must be completely transparent.\n  That&#39;s your one measurement of success of good code. Take any product, say a Linux desktop. Then take one from\r\t\t\t\ta year ago. Can you still do the same things and workloads, or do you need to ask yourselves things like which\r\t\t\t\tdistro, version, kernel, environment, library, or such? No, since you cannot decouple code from the usage\r\t\t\t\tmodel, you know it&#39;s pointless and it needs to be deleted. This is true for pretty much any major product and\r\t\t\t\tframework that&#39;s come out in Linux in the past five years.\n  It&#39;s not about the age of the software and how suitable it is to the modern era, either. Most of the critical\r\t\t\t\tstuff runs on operating systems designed decades ago still being written in programming languages from the 70s.\r\t\t\t\tIt&#39;s just the whole IoT nonsense where all the fuss is. The useless stuff really.\n  It&#39;s not about making it easier for developers - because you may naively think they will then have more time to\r\t\t\t\tfix user problems. No. Because if their code is problematic, they can just not do it in the first place and\r\t\t\t\tsave all the time there is. Once they &#39;nail&#39; it with one half-polished product, they will get bored and start\r\t\t\t\tworking on another beta project. A living organism needs to sustain itself and grow, remember? And when the\r\t\t\t\tgrowth is uncontrolled, well.\n    Kids fresh out of university - or college - may be impressed by this brave new world of chaos and programming\r\t\t\t\tlanguages, but at the end of the day, it&#39;s about the user. If you go to a carpenter and ask for a piece of\r\t\t\t\tfurniture, they should build it for you. The analogy for software development is, they will convince you that a\r\t\t\t\tbed is better than a chair, and how it is easier for the code people to build and support a chair. That does\r\t\t\t\tnot fly.\n  Every day, I spend hours sitting in front of a computer, doing all sorts of things. A non-insignificant portion\r\t\t\t\tof my precious time is spent fretting, wondering when my browser, office suite, desktop environment, or even\r\t\t\t\tthe operating system itself will suddenly stop working, because some software developer decided they are bored.\r\t\t\t\tI don&#39;t know if people in the olden age felt this way with their trains, radios, coaches, or whatever, but I\r\t\t\t\tdoubt it. This Year 2000 kindergarten bullshit needs to stop. Once software development fades into the quiet\r\t\t\t\tbackground it deserves, and companies re-focus on the user, we will see an upsurge in creativity, quality, and\r\t\t\t\tfun.\n  When I go to a restaurant, I don&#39;t want to k\n......", "posttime": "2021-08-09 11:20:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开发,软件开发,software", "title": "现代软件开发是癌症", "title_en": "Modern software development is cancer", "transed": 1, "url": "https://www.dedoimedo.com/computers/software-development-cancer.html", "via": "", "real_tags": ["软件", "开发", "软件开发", "software"]}]