[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该存储库包含Arduino库、KiCAD PCB设计文件、Gerber生产文件、BOM和来自2018年OSHWA峰会的开源计算机鼠标礼包项目的组装说明。电路设计、PCB布局和代码由Joel Murphy(又名biomurph|@SafeForRobots)于2018年夏天制作。鼠标滚轮和滚轮支架是与Eugene Chang合作设计的，由有形创意公司制造。生产的PCB板是经过制作和填充的。\n是的，是的，确实是这样。几年前，我试图在开源硬件设计、生产和销售方面取得成功。我在SparkFun之前就做了这样的东西，但它从来没有起飞过。我一直坐在那几天的一小堆零部件上，今年夏天我决定把那一堆零配件砍掉。那就给你吧。一款功能齐全的电脑鼠标，让您随心所欲地修改和修改。欢迎光临！\n如果您有兴趣修改设计文件以更新此项目，我发现仍在销售此类光学鼠标传感器的地方是一家名为PixArt的公司，该公司有多种传感器可供选择。我的目标之一就是做到这一点，所以如果你想成为第一批知道我什么时候有工作原型的人，请看这个回购。\n下载此回购的ZIP或克隆它。然后将名为Mouse的文件移动或复制到Documents&gt；Arduino&&gt;Library文件夹中。打开或重新启动Arduino，Thengoto File&gt；Examples&gt；Mousey&gt；OpenMouse以查找在OpenMouse上运行的草图。\n这款开源计算机鼠标是围绕ATmega32U4构建的，带有Arduino Leonardo引导加载程序。它已经用Mousey库中的示例草图进行了编程。有两种操作模式HID和NOT-HID。使用鼠标左侧的滑动开关选择模式。\n当滑动开关位于距离每孔衬垫样机区域最近的一侧(也称为向下)时，鼠标处于HID模式。当插入微型USB电缆时，鼠标将读取传感器(轮子、按钮、光学传感器)，其功能就像连接到计算机上的鼠标一样！\n当滑动开关位于最靠近7针母接头的一侧(也称为向上)时，鼠标处于非HID模式。当插入微型USB线时，鼠标将读取传感器(轮子、按钮、光学传感器)，并以115200波特率通过串行发送数据。您可以打开任何串行终端从鼠标查看数据。\n将小鼠包装成HID位置的HID选择开关。如果您将鼠标插入计算机，但它的工作方式与鼠标不同，请检查以确保HID开关处于HID模式。标记为SW1的小触控开关是莱昂纳多的复位按钮。您可以即时切换模式，然后按下此重置按钮即可更改模式，而无需拔下鼠标插头。如果所有方法都失败了，请使用Mousey中的示例中的OpenMouse.ino代码重新编程鼠标。", "note_en": "This repository holds the Arduino library, KiCAD PCB design files, gerber production files, BOM, and assembly instructions for the open-source computer mouse goodie bag item from the 2018 OSHWA Summit. The circuit design, PCB layout, and code were produced by Joel Murphy (aka biomurph | @SafeForRobots) in the Summer of 2018. The mouse wheel and wheel holder were designed in collaboration with Eugene Chang, and manufactured by  Tangible Creative. The production PCB boards were fabricated and stuffed  ...\n      Yes, yes it did. Years ago, I tried to make a go of it in open-source hardware design, production and sales. I made something like  this before SparkFun did, but it never got off the ground. I&#39;ve been sitting on a small pile of components from those days, and this summer I decided that I have to chip away at that pile. So here you go. A fully functional computer mouse for you to hack and modify to your hearts delight. You&#39;re welcome!\n If you are interested in modifying the design files to bring this project up to date, the one place that I have found that still sells these kinds of optical mouse sensors is a company called  PixArt that has a variety of sensors to choose from. One of my goals is to do just that, so watch this repo if you want to be among the first to know when I have a working prototype.\n  Either download the ZIP of this repo or clone it. Then move or copy the file named  Mouseyinto your  Documents &gt; Arduino &gt; libraries folder. Open or restart Arduino, Thengoto  File &gt; Examples &gt; Mousey &gt; OpenMouse to find the sketch that runs on OpenMouse.\n  This open-source computer mouse is built around an ATmega32u4 with the Arduino Leonardo bootloader. It has already been programmed with the example sketch from the Mousey library. There are two modes of operation HID and Not-HID. Modes are selected using the slide switch on the left side of the mouse.\n  When the slide switch is on the side closest to the pad per hole prototyping area (aka DOWN), the mouse is in HID mode. When plugged into a micro USB cable, the mouse will read the sensors (wheel, buttons, optical sensor), and function just like a mouse attached to your computer!\n  When the slide switch is on the side closest to the 7 pin female header (aka UP), the mouse is in the Not-HID mode. When plugged into a micro USB cable, the mouse will read the sensors (wheel, buttons, optical sensor) and send the data it gets over serial at 115200 baud. You can open any serial terminal to view the data from the mouse.\n  The mice were packaged with the HID select switch in the HID position. If you plug your mouse in to a computer and it doesn&#39;t work like a mouse should, then check to make sure that the HID switch is in HID mode. The small tact switch labeled  SW1is the reset button for the Leonardo. You can switch modes on the fly, and press this reset button to change modes without unplugging your mouse. If all else fails, re-program the mouse with the OpenMouse.ino code from the example in the Mousey  ...", "posttime": "2020-05-02 18:05:13", "tags": "硬件,开源,鼠标,open,mouse", "title": "开源鼠标固件和硬件存储库", "title_en": "Repository for Open Source Mouse Firmware and Hardware", "transed": 0, "url": "https://github.com/biomurph/Mouse", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["硬件", "开源", "鼠标", "open", "mouse"]}, {"category": "", "categoryclass": "", "imagename": "f92429cfa9d112778efdf62f0b3c702b.jpg", "infoid": 1000298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与世界其他地区一样，加拿大无人机制造商Draganfly一直在焦急地关注着这种新型冠状病毒的传播。2月中旬，当冠状病毒病例开始在华盛顿疗养院如雨后春笋般涌现时，该团队开始集思广益。到今年3月，DraganFly已经获得了从空中提供社交距离和健康监测服务所需的机器视觉和人工智能技术的许可。测试这项技术的需求是“永不满足的”，不仅来自政府和执法部门，也来自卫生部门……。\n但故事并没有到此为止。在西港飞行员突然终止前后，我们与DraganFly首席执行官卡梅隆·切尔(Cameron Chell)进行了交谈。无人机公司还有两名飞行员计划在不到两周内开始工作。切尔说，来自其他司法管辖区的请求已经“淹没”了“蜻蜓”，而私人方面的数字“甚至更多”。“事实上，接下来的几名美国飞行员将在私营部门。一种是基于无人机的，另一种是基于设施的。另外..。\n随着联邦和地方政府努力应对冠状病毒大流行-从跟踪冠状病毒的传播到判断何时取消限制-每个人都在更密切地关注无人机和机器人等自主技术。公共和私营部门迫切需要技术来帮助限制人类接触，并提供有关社会距离等措施的实施和有效性的早期检测数据。任何依赖人工交互的业务，无论是与客户的交互.。\n与大多数无人机公司不同，DraganFly拥有数十年的经验。该公司成立于1998年，切尔引以为豪的是，他领导着“世界上最古老的商用无人机制造商”。这家加拿大公司约有25名员工，总部设在萨斯喀彻温省的萨斯卡通，在温哥华、洛杉矶和北卡罗来纳州的罗利设有办事处。直到这个月，DraganFly可以说最出名的是在2013年开发了第一架被誉为拯救人类生命的无人机。\nVB Transform 2020 Online-2020年7月15日至17日：与领先的人工智能高管一起参加VentureBeat&#39；年度人工智能活动。立即注册，可节省30%的数字访问通行证。\n近年来，得益于市场领军企业大疆(DJI)和鹦鹉，廉价的消费级无人机变得流行起来。但蜻蜓的四个收入来源中没有一个是与消费者相关的。第一个是合同工程(主要是针对美国的一级军事承包商)。第二个是原始系统制造，也就是制造无人机…。\n虽然DraganFly自己不制造消费无人机，但它已经为客户设计了各种有效载荷、万向节附件和软件集成。该公司更喜欢美国法警和边境巡逻员等高度专业化的工作。忘了便宜的无人机吧-想想在较冷的天气里工作的电池，……。\nChell告诉VentureBeat说，DraganFly的客户“通常对性能有更高的要求”。“他们有一些特殊的需求，我们的工程就是根据这些需求来调整的。此外，他们往往不一定会购买那么多的外国产品。那个地区的买家更有责任感，当然是在军事层面上，对安全…。\n大约12周前，当“华盛顿疗养院的情况变得可怕”时，DraganFly团队正试图弄清楚无人机如何能提供帮助。但他们想做的不仅仅是使用无人机从空中对人大喊大叫。\n“我们就像是，‘在无人机上装扬声器？’有什么大不了的。真的？这不是创新，“切尔宣称。“我们在想，如果成功的话，我们需要能够提供比这种非常典型的用例更多的价值。”\n该公司意识到，它没有实现真正想做的事情的人工智能印章。因此，它开始与其合作伙伴进行谈判。\n“我们去找它了，”切尔说。“我们在想‘哦，热像仪！’可能世界上每个人都想过热像仪。我们很快就揭穿了他们的用法。热学不测量核心温度，这是了解是否存在潜在发烧所必需的。..。\n这家加拿大公司进行了研究，构建了用例，进行了测试，并在几周内签署了一项协议。DraganFly花了150万美元获得了一个健康和呼吸监测平台，即生命情报项目的许可，该平台是由UniSA和澳大利亚国防科学部合作开发的。\n生命智能项目可以帮助估计人与人之间的距离，但它也可以监测人群和劳动力中个人的温度、心率和呼吸频率。DraganFly设想这项技术将被航空公司和游轮部署；对于潜在的高危群体，比如护理中的老年人……。\n“我们授权它用于摄像网络和无人机，”切尔解释说。UniSA构建了核心技术--“特定的机器视觉和非产品化形式的人工智能。“蜻蜓”只是碰巧在它的名录中有一所公立研究型大学。然后，该公司开发了", "note_en": "Like the rest of the world, Canadian drone maker  Draganflyhas been anxiously watching the spread of the novel coronavirus. And when COVID-19 cases started springing up across Washington nursing homes in mid-February, the team began brainstorming. By March, Draganfly had licensed the machine vision and AI tech needed to offer social distancing and health monitoring services from the air. Demand to test the technology was “insatiable, ”not just from government and law enforcement, but also from health  ...\n But the story doesn’t end there. We spoke with Draganfly CEO Cameron Chell  before and after the abrupt termination of the Westport pilot. The drone company has two more pilots scheduled to start in less than two weeks. Chell says Draganfly has been “inundated ”with requests from other jurisdictions, while the numbers on the private side “are even more prolific. ”Indeed, the next couple of U.S. pilots will be in the private sector. One is drone-based, and the other is facility-based. Additional  ...\n  As federal and local governments wrestle with the coronavirus pandemic — from tracking the spread of COVID-19 to gauging when to lift restrictions — everyone is taking a closer look at autonomous technologies like  drones and  robots. The public and private sectors are desperate for technology that can help limit human contact and provide early detection data on the implementation and effectiveness of measures like social distancing. Any business that relies on human interaction, whether with customers  ...\n  Unlike most drone companies, Draganfly has decades of experience. It was founded in 1998, and Chell prides himself on leading “the oldest commercial drone manufacturer in the world.” The Canadian company has some 25 employees and is based in Saskatoon, Saskatchewan, with offices in Vancouver; Los Angeles; and Raleigh, North Carolina. Until this month, Draganfly was arguably best known for developing  the first drone credited with saving a human life, in 2013.\n  VB Transform 2020 Online - July 15-17, 2020: Join leading AI executives at VentureBeat&#39;s AI event of the year.  Register today and save 30% off digital access passes.\n Cheap consumer drones have become popular in recent years, thanks to market leaders  DJI and  Parrot. But none of Draganfly ’s four revenue streams is consumer-related. The first is contract engineering (primarily for tier one U.S.-based military contractors). The second is original systems manufacturing, meaning building drones  ...\n  While Draganfly does not build consumer drones itself, it has designed various payloads, gimbal attachments, and software integrations for its customers that do. The company prefers highly specialized work for the likes of U.S. marshals and border patrol. Forget cheap drones —think batteries that operate in colder weather,  ...\n Draganfly customers “generally have a higher performance requirement, ”Chell told VentureBeat. “They have some specialized needs that our engineering is attuned to. Also, they tend to not necessarily buy as much foreign product. The buyers in that area are a bit more conscientious, certainly on a military level, of security  ...\n  Some 12 weeks ago, when “things got scary in Washington with nursing homes,” the Draganfly team was trying to figure out how drones could help. But they wanted to do more than just use drones to yell at people from the skies.\n “We were like,  ‘Put a loudspeaker on a drone?’ Big deal. Really? That’s not innovative,” Chell declared. “We were thinking if this hits, we need to be able to provide more value than very typical use cases like that.”\n The company realized it did not have the AI chops to pull off what it really wanted to do. So it started talking to its partners.\n  “We went looking for it, ”Chell said. “We were thinking ‘Oh, thermal cameras! ’Probably every person in the world has thought about thermal cameras. And we debunked the use of those very quickly. Thermal doesn ’t measure core temperature, which is what is required to understand if there ’s a potential fever present.  ...\n The Canadian company researched, built use cases, ran tests, and in the space of a few weeks had signed a deal. Draganfly paid $1.5 million to license a health and respiratory monitoring platform, the Vital Intelligence Project, developed in a collaboration between UniSA and the Australian Department of Defence Science  ...\n The Vital Intelligence Project can help estimate the distances between people, but it can also monitor temperatures, heart rates, and respiratory rates of individuals in crowds and workforces. Draganfly envisioned the tech being deployed by airlines and cruise ships; for potential at-risk groups, like seniors in care  ...\n “We licensed it for camera networks and for drones, ”Chell explained. UniSA built the core technology —“the specific machine vision and AI in a non-productized form. ”Draganfly simply happened to have the public research university in its Rolodex. The company then developed the productized form, including camera  ...\n “That includes everything from going out and doing the policy development work through to what the GUI needs to look like, ”Chell said. “Both software and mechanical engineering to provide stabilization on the drones so that they ’re optimized to collect this data. That piece of IP, go to market, and actual commercialization  ...\n  Still, some repurposing was required, as the Vital Intelligence Project was not exactly being used to monitor groups of people.\n “They were using it so that they can fly helicopters over …disaster relief zones and pick up the vital signs of survivors on the ground, ”Chell said. “They could determine what resources they needed to apply where or the severity of survivors ’current situation, and did they need to get them right at that moment.  ...\n Draganfly and the university took the technology and adapted it for social distancing and health monitoring. To be clear, the Vital Intelligence Project had never been strapped to a drone and pointed at a crowd before the Westport pilot.\n “The previous use case that would be most similar to this one was designed to be used in disaster relief areas to get the vital signs of survivors on the ground, ”Chell said. “Those happen to be the same set of vital signs that we can now pick up anonymized in a crowd to determine if there ’s infectious or respiratory  ...\n  Draganfly started test flights in Westport, Connecticut to identify social distancing and detect symptoms. The city is in Fairfield County, adjacent to New York City and considered the epicenter for the spread of the coronavirus in Connecticut.\n The three-phase pilot was supposed to validate the technology’s use and have officials develop public safety policy around it. The next step would have been to test those policies. The whole process was supposed to take some 60 days, during which Draganfly hoped to initiate additional pilots.\n  Phase one was to test whether the technology could be an effective resource multiplier, letting officials cover more ground to see if social distancing is being effectively adhered to, for example. Instead of sending a few cruisers out and having officers walk around, they could put one camera up in the sky  ...\n “Social distancing, which we ’ve shown on the videos, that ’s actual visual data, ”Chell said. “It gives the operator of the camera, typically the officer, the real-time data. They should make operational decisions at that point if they need to separate a crowd. Or everything is fine [and] they don ’t need  ...\n  Westport First Selectman Jim Marpe called it the “Flatten the Curve Pilot Program. ”It was supposed to help the community “practice safe social distancing, while identifying possible coronavirus and other life-threatening symptoms. ”Police Chief Foti Koskinas said at the time: “Using drones remains a go-to  ...\n There was no health monitoring in phase one. Before the Westport pilot ended, Chell was already calling phase one a “success, ”so we asked what exactly that meant. “The technology worked in a real-world environment, ”Chell said. “So that was successful. We were able to get very good operational social  ...\n  In announcing the end of the pilot just a couple of days later, Marpe said, “in our good faith effort to get ahead of the virus and potential need to manage and safely monitor crowds and social distancing in this environment, our announcement was perhaps misinterpreted, not well-received, and posed many  ...\n  When we spoke to Chell a few days later, he seemed to understand why the pilot had to end.\n “The official pushback was around health monitoring, and the misunderstanding around how it works, what it does, and what it ’s for, ”he said. “And so at this point, Westport just feels politically that they just don ’t want to move forward with the project. They had been extremely helpful. They provided  ...\n No part of the Vital Intelligence Project employs facial recognition technology, Draganfly has consistently said. Still, we wondered if the resulting output from phase one could be repurposed to do so. Could someone take the video feed and run a facial recognition algorithm on top of it?\n “No more than you could do that on a security camera system today, ”Chell explained. “The requirements to run social distancing, in terms of resolution and stabilization in the video platform are minute compared to what you have to have in order to run the health measurement platform. So while today  ...\n  The pilot never got to phase two, which was the anonymized health measurement. The plan was to test crowds as sample sets —how many are coughing, sneezing, have a fever (considering heart rate, respiratory rate, high blood pressure, and biometric measurements based on skin tones). We asked if the  ...\n “It has. There ’s some challenges with that at times, ”Chell admitted. “So darker skin tones and different types of lights and the rest of it can create some problems. If you have somebody walking up to a kiosk and using this type of technology, it ’s a different scenario because it ’s a controlled  ...\n  That’s not a problem, Chell insists, because the technology is not meant to identify people. The whole point is to measure the health of a population.\n “When you combine things like fever, coughing, elevated heart rate, particular respiratory rates, then you ’ve got a picture of health, ”Chell said. “You ’re not diagnosing if somebody has COVID-19 or not, but you are doing a health measurement and getting a pretty clear idea of the rate of infectious  ...\n  One big difference between phase one and phase two that led to major confusion is that the latter does not output video. Draganfly published videos to show how the technology worked, but that was misleading. The health measurement system does not record the subjects at a location that the drone  ...\n “It just comes back and says in this particular geographic location, where you did the health measurement data, there were 22 people in the field view. Here are the heart rates, here are the respiratory rates, here are the fevers. Here ’s the likelihood, and percentage of, infections and/or  ...\n  “You need at least that much data time to understand respiratory rate, ”Chell explained. “In that timeframe, you also have your heart rate beating so you ’re able to collect that data concurrently. You can get biometric measurements of skin tone data quite quickly as well in that timeframe.  ...\n The drone sends the data it collects back to the cloud (Draganfly uses AWS and Fortinet) for processing. “All of that happens in the cloud through encrypted lines. So that is a secure cloud environment where all of that AI happens. If the drone goes down, there ’s no SD card that you can pull  ...\n  Interestingly, Westport wasn ’t using Draganfly drones —the plan was to deploy its Commander series in phase three. In the interest of time, the first two phases were to rely on third-party drones, which Westport already had. The police department launched its drone program in early 2016  ...\n Draganfly claims its technology works at up to 190 feet away from subjects. “At 190 feet, you ’re talking about a $35,000 drone, just because of the cameras and the additional sensors and stabilization. On a $600 drone, that doesn ’t have really optimized stabilization software and such  ...\n But again, that was meant for phase three. The Draganfly system Westport piloted could have potentially worked from almost 10 times further away. For now, it doesn’t look like Westport will ever verify those claims. Other towns and companies, however, want to try.", "posttime": "2020-05-02 18:05:10", "tags": "开展,pandemic,无人机,draganfly", "title": "美国开展了“蜻蜓”和“大流行无人机”试点研究。", "title_en": "Draganfly and ‘pandemic drone’ pilot studies in the U.S.", "transed": 0, "url": "https://venturebeat.com/2020/04/30/draganfly-pandemic-drone-united-states-pilots/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["开展", "pandemic", "无人机", "draganfly"]}, {"category": "", "categoryclass": "", "imagename": "9f201dcdf46ef4ab8c9832a2c405e78d.jpg", "infoid": 1000297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌对澳大利亚悬而未决的2020年电信立法修正案(国际生产订单)法案(IPO法案)提出了几个担忧，包括英联邦对措辞的选择，建议的记录共享途径，以及该法案与美国澄清海外合法使用数据法案(CLOUD Act)的目的不符。\nIPO法案意在修订1979年美国电信(截取和访问)法案(TIA Act)，为澳洲机构创建一个框架，以便从与澳洲有协议的国家的外国指定通信提供商那里获得存储的电信数据，反之亦然。它还将取消指定的行政上诉法庭成员签发某些逮捕令的能力。\n云法案是澳大利亚获得拟议中的与美国的双边协议以实施云法案的前提条件。\n云法案创建了一个法律框架，规范执法部门如何跨境访问数据。\n如果协议最终敲定并获得批准，澳大利亚和美国的服务提供商将能够回应对方国家要求获取电子证据的合法命令。\n一项双边云法案协议将使澳大利亚执法部门能够为国内订单提供打击直接针对美国公司的严重犯罪所需的通信数据，反之亦然。\n在提交给议会情报与安全联合委员会(PJCIS)及其对IPO法案的审查报告的一份意见书[PDF]中，谷歌表示，虽然它鼓励和支持澳大利亚政府就行政协议进行谈判的努力，但它表示，该法案中的某些内容令人担忧。\n特别是在考虑如何将本条例草案下的截取权力与有争议的“电信和其他立法(协助和接入)法”下的技术能力通知一起使用时，它写道。\n在向PJCIS提出建议时，谷歌表示，该法案不应适用于作为企业或政府实体基础设施提供商的服务提供商，称企业或政府实体最适合自己制作所要求的记录。\n根据条例草案，指定通讯供应商须向提出要求的机构或澳洲指定当局提供任何要求的通讯及数据。谷歌更愿意授权成为一个双向渠道。\n恕我直言，我们的经验是，更好的方法是，所有与澳大利亚执法机构的通信都通过指定的机构进行，该机构充当多个机构的协调人，该机构写道。\n建立一个协调机构将防止重复的风险，并将作为培训、教育和与指定通信提供商联系的单一联系点。\n对不遵守IPO的民事处罚建立了一个合规框架。如果指定通信提供商收到有效的IPO，并且指定通信提供商在IPO发行时达到强制执行阈值，则指定通信提供商必须遵守IPO。\n谷歌将这两步测试称为门槛，即达到门槛相对较低的门槛。\n不遵守首次公开募股(IPO)的规定可能会导致法人团体被处以高达1000万澳元的民事罚款。它表示，强制要求遵守IPO的义务与“云法案”(Cloud Act)的目的背道而驰，该法案旨在解除屏蔽法规，但并未明确规定服务提供商必须承担义务。\n法案的作者似乎意识到了这种二分法，因为法案明确宣称澳大利亚的服务提供商不必遵守国际机构的互惠要求。\n具体地说，这家搜索巨头表示，它对试图将强制性义务强加给总部设在海外的指定通信提供商感到担忧，这种义务只存在于构建一项其他非强制性的国际协议中。\n它写道：[我们]恭敬地要求对此进行修改，以反映云法的意图，即在现有法律中找到执法程序，并删除对民事处罚的提及。\n在其他地方，谷歌正在寻求有关合格法官在批准涉及截获通信的IPO时将扮演的角色的进一步信息。\n鉴于“托拉法”等其他相关立法缺乏适当的基于案情的上诉程序，推迟现有的上诉机制并不令人满意。\n依赖现有法律作为上诉程序的主要来源是特别有问题的…。特别是，海外供应商", "note_en": "Google has raised a handful of concerns with Australia&#39;s pending  Telecommunications Legislation Amendment (International Production Orders) Bill 2020 (IPO Bill), including the Commonwealth&#39;s choice of phrasing, the avenues proposed for record-sharing, and the Bill being at odds with the purpose of the United States&#39;  Clarifying Lawful Overseas Use of Data Act (CLOUD Act).\n The IPO Bill is intended to amend the  Telecommunications (Interception and Access) Act 1979 (TIA Act) to create a framework for Australian agencies to gain access to stored telecommunications data from foreign designated communication providers in countries that have an agreement with Australia, and vice versa. It would also remove the ability for nominated Administrative Appeals Tribunal members to issue certain warrants.\n The  Bill is a precondition for Australia to obtain a proposed bilateral agreement with the United States in order to implement the CLOUD Act.\n The  CLOUD Act creates a legal framework regulating how law enforcement can access data across borders.\n If the agreement is finalised and approved, service providers in Australia and the US would be able to respond to lawful orders from the other country for access to electronic evidence.\n   A bilateral CLOUD Act agreement would enable Australian law enforcement to serve domestic orders for communications data needed to combat serious crime directly on US-based companies, and vice versa.\n In a  submission [PDF] to the Parliamentary Joint Committee on Intelligence and Security (PJCIS) and  its review of the IPO Bill, Google said while it encourages and supports efforts by the Australian government to negotiate an executive agreement, it said there are certain elements of the Bill that give it cause for concern.\n   &#34;Especially when considering how the interception powers under this Bill could be used in tandem with technical capability notices under the controversial Telecommunications and Other Legislation (Assistance and Access) Act,&#34; it wrote.\n Making a recommendation to the PJCIS, Google said the Bill should not apply to service providers in their capacity as infrastructure providers to corporations or government entities, saying corporations or government entities are best placed to produce the requested records themselves.\n  Under the Bill, designated communications providers are instructed to provide any requested communications and data to the requesting agency or the Australian Designated Authority. Google would prefer the authority to be a two-way channel.\n &#34;Respectfully, our experience is that a better approach would be that all communications to and from an Australian law enforcement agency be channelled through the Designated Authority and that this authority acts as a coordinator across multiple agencies,&#34; it wrote.\n &#34;Putting in place a coordinating body will guard against the risk of duplication and will act as a single point of contact for training, education, and access to designated communications providers.&#34;\n  Civil penalties for non-compliance with an IPO establishes a framework for compliance. If a designated communications provider receives a valid IPO and the designated communications provider meets the &#34;enforcement threshold&#34; when the IPO is issued, the designated communications provider must comply with the IPO.\n Google labelled the two-step test that is the threshold, a &#34;relatively low bar to meet&#34;.\n &#34;Failure to comply with an IPO may lead to a civil penalty of up to AU$10 million for body corporates. The imposition of a mandatory obligation to comply with an IPO is contrary to the purpose of the CLOUD Act which is to lift blocking statutes, but explicitly does not create a compulsory obligation on service providers,&#34; it said.\n &#34;The authors of the Bill appear to be aware of this dichotomy as the Bill explicitly asserts that Australian service providers do not have to comply with reciprocal requests from international agencies.&#34;\n Specifically, the search giant said it was concerned by the attempt to impose a mandatory obligation on overseas-based designated communications providers that exists &#34;only in the construct of an otherwise non-compulsory international agreement&#34;.\n &#34;[We] respectfully request that this be amended to reflect the intent of the CLOUD Act, which is that enforcement procedures be found in existing law, and that references to civil penalties be removed,&#34; it wrote.\n Elsewhere, Google is seeking further information about the role that eligible judges will play in approving IPOs that involve the interception of communications.\n  &#34;Deferring to existing appeal mechanisms is not satisfactory given the lack of appropriate merit based appeal processes in other relevant legislation such as the TOLA Act,&#34; it continued.\n &#34;The reliance on existing law as the primary source for appeal procedures is especially problematic … in particular, overseas providers may be subject to other third-country laws, conflicts with which are not and cannot be lifted through the international agreement, yet no option would exist to raise such an impediment to compliance.&#34;\n Google said this would create exactly the type of conflict of laws scenario that the CLOUD Act is designed to prevent.", "posttime": "2020-05-02 18:05:07", "tags": "google,谷歌,希望,australia,法案", "title": "谷歌希望澳大利亚取消云法案准备法案中的民事处罚", "title_en": "Google wants Australia to remove civil penalties from CLOUD Act-readying Bill", "transed": 0, "url": "https://www.zdnet.com/article/google-wants-australia-to-remove-civil-penalties-from-cloud-act-readying-bill/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["google", "谷歌", "希望", "australia", "法案"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SeaFox根据ESTree AST格式生成AST，可用于JavaScript程序的语法分析(解析)或词法分析(标记化)，在ES2015及更高版本中，JavaScript程序可以是脚本也可以是模块。\nSeafox公开的解析方法接受一个可选的Options对象，该对象允许您指定是以脚本模式(默认)还是以模块模式进行解析。\n{//允许使用Module作为目标符号模块进行分析？：boolean；//启用每个节点的开始和结束偏移以及行/列位置信息的标志loc：false；//禁用web兼容性disableWebCompat：false；//将原始属性附加到每个文字和标识符节点raw的标志：false；//Enabled指令指令：false；//允许在全局作用域globalReturn：false中返回的标志；//启用隐含的严格模式ImpliedStrict的标志。\n从&#39；导入{parseScript，parseModule，parse}。/SeaFox&#39；；parseScript(&#39；({x：[y]=0}=1)&#39；)；parseModule(&#39；({x：[y]=0}=1)&#39；，{指令：true，raw：true})；parse(&#39；({x：[y]=0}=1)&#39；，{。parse(&#39；({x：[y]=0}=1)&#39；)；\n词法分析只能在解析期间完成，并且只接受函数类型作为选项。\n需要为开始和结束启用loc选项。否则，此值将设置为未定义。\nSeaFox是为提高性能和降低内存使用量而开发的，该解析器比所有其他javascript解析器快2倍到4倍。", "note_en": "Seafox generates  AST according to  ESTree AST format, and can be used to perform  syntactic analysis (parsing) or  lexical analysis (tokenization) of a JavaScript program, and with  ES2015 and later a JavaScript program can be either  a script or a module.\n The  parse method exposed by  Seafox takes an optional  options object which allows you to specify whether to parse in   script mode (the default) or in   module mode.\n  {   // Allow parsing using Module as the goal symbol  module ?: boolean;   // The flag to enable start and end offsets and line/column location information to each node loc :  false;   // Disable web compatibility disableWebCompat :  false;   // The flag to attach raw property to each literal and identifier node raw :  false;   // Enabled directives directives :  false;   // The flag to allow return in the global scope globalReturn :  false;   // The flag to enable implied strict mode impliedStrict :  false;  //Enable  ...\n  import {  parseScript,  parseModule,  parse }  from   &#39;./seafox &#39;; parseScript(  &#39;({x: [y] = 0} = 1) &#39;); parseModule(  &#39;({x: [y] = 0} = 1) &#39;, { directives:  true, raw:  true }); parse(  &#39;({x: [y] = 0} = 1) &#39;, { module:  true }); parse(  &#39;({x: [y] = 0} = 1) &#39;);\n  Lexical analysis can only be done during parsing and accepts only a function type as the option\n    The  loc option needs to be enabled for  start and  end. Otherwise this values will be set to  undefined\n  Seafox is developed for performance and low memory usage, and the parser is about 2x - 4x faster than all other javascript parsers.", "posttime": "2020-05-02 18:05:02", "tags": "java,javascript,兼容,compliant,false", "title": "快速的100%规范兼容、自托管的JavaScript解析器", "title_en": "A fast 100% spec compliant, self-hosted JavaScript parser", "transed": 0, "url": "https://github.com/KFlash/seafox", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["java", "兼容", "compliant", "false"]}, {"category": "", "categoryclass": "", "imagename": "4f63cc74c2a0a358ef584f6d6c7340f6.jpg", "infoid": 1000295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在2017年6月，苹果就推出了“用于VR的金属”，并强调了与Valve的合作伙伴关系。当时，Valve正在推动VR作为平台，并在Vive系统上与HTC合作；快进到2020年，Valve拥有自己的高端耳机，并刚刚发布了备受期待的标题《Half Life：Alyx》。\n几乎没有支持Mac的游戏，甚至苹果最高端的MacBook Pro也达不到Oculus或SteamVR的最低规格要求。正如Upload的人员指出的那样，Valve最近的硬件调查显示，该平台上只有4%的游戏玩家一开始就使用MacOS，这表明相当少的实际游戏玩家甚至符合Mac拥有的VR用户维恩的图表。\n在Mac上构建虚拟现实内容的游戏开发商很可能喜欢在一台机器上开发和测试的能力。当苹果用Mac Pro和iMac Pro等高价设备积极追逐专业人士时，当一个主要的软件平台认为你不值得努力时，这不是一个很好的外观。", "note_en": "Apple   introduced “Metal for VR” back in June 2017 and highlighted a partnership with Valve. At the time, Valve was pushing VR as a platform and working with HTC on its Vive system; fast-forward to 2020 and Valve has its own high-end headset and has just released its highly-anticipated title “Half Life: Alyx.”\n   Almost no games supported Mac, and even Apple’s highest-end MacBook Pros failed to meet minimum specification requirements for Oculus or SteamVR.  As the folks at  Upload  point out, Valve’s recent  hardware survey  showcases that just 4% of gamers on the platform use macOS to begin with, suggesting a pretty small sliver of actual gamers even fit in the Mac-owning VR user Venn diagram.\n Game developers building VR content on Mac likely enjoyed the ability to develop and test on a single machine. As Apple aggressively chases professionals with high-priced gear like the Mac Pro and iMac Pro, it’s not a great look when a major software platform decides you’re not worth the effort.", "posttime": "2020-05-02 18:04:58", "tags": "mac,macos,drops,游戏,vr", "title": "Value放弃对MacOS的VR支持", "title_en": "Valve drops VR support for macOS", "transed": 0, "url": "https://techcrunch.com/2020/05/01/valve-drops-vr-support-for-macos/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["mac", "macos", "drops", "游戏", "vr"]}, {"category": "", "categoryclass": "", "imagename": "9376556faae6ced37ae727378989fa3d.png", "infoid": 1000294, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在上一篇文章中，我们已经了解了如何可视化时间序列数据。在这篇文章中，我们将讨论如何使用ARMA和ARIMA模型进行时间序列建模。这里AR代表自回归，MA代表移动平均。\n在我们开始讨论ARIMA模型之前，我们应该了解时间序列的平稳性。\n如果观测值的均值、方差和协方差在一段时间内没有变化，则称时间序列为平稳序列。\n换言之，如果观测值的联合分布不变，并且当时间起点偏移k个量时保持不变，则称一个过程是平稳的。\n这意味着均值和方差是恒定的，不依赖于时间。平稳过程有两种类型：严格平稳过程和弱平稳过程。\nARIMA是自回归综合移动平均模型的缩写，是目前应用最广泛的时间序列预测模型之一。\n它还解释了连续时间点之间数据或噪声的增长/下降模式。\n将ARIMA应用于具有非平稳性的数据，并采用连续观测的差值来消除非平稳性。有时需要多次连续观测的差异才能得到修正的平稳模型。\n这就是它被称为集成模型的原因，因为拟合到修改后的序列的平稳模型必须求和或积分，以提供原始非平稳序列的模型。\n我们应该将ARIMA模型拟合到平稳和非季节性的时间序列数据，并遵循上面流程图中描述的过程。\n首先，您应该绘制数据图表，以发现隐藏的模式、趋势和其他行为。\n要稳定和规格化数据，可以使用Box-Cox变换。这是一种变换通常不服从正态分布的数据的方法。\n绘制ACF/PACF以确定ARIMA模型的顺序，即p、d和q值。或者，您也可以使用AICC和BICC来确定p、q、d值。选择AICC和BICC最低的。\n验证残差并确保它看起来像白噪声，否则请尝试使用不同p、q和d值的修改后的模型。请记住，白噪声的残差可以进行预测。\n我们将使用阿莫里市的月度温度数据集。您可以从此链接下载。\n将熊猫作为snssns.set(rc={&#39；figure.figsize&#39；：(15，6)})%matplotlib inlinedf=pd.read_csv(&#39；./monthly_temperature_aomori_city.csv&#39；)df[&#39；DATE&#39；]=pd.to_DateTime(DF[[&#39；Year&#39；，&#39；month&#39；]].assign(DAY=1))df.drop([&#39；]，smimport matplotlib.pylot作为pltimport海运)导入pdimport statsmods.api。年&#39；，&#39；月&#39；]，位置=真，轴=1)df[&#39；温度&#39；]=df[&#39；temperature&#39；]*(9/5)+32df.set_index(&#39；DATE&#39；，inplace=True)df.to_csv(&#39；./monthly_temperature_aomori_city_updt.csv&#39；，索引=真)df.head()。\n让我们为前200行画一张简单的线条图，以了解数据中的模式以及温度是如何趋势的。看起来这里遵循的是一种循环模式。\n我们将绘制前5年的盒子和胡须图，以了解数据分布，并快速获得数据的五点汇总。\n如果您正在寻找有关时间序列分析和可视化的深入教程，可以查看此博客，它是此时间序列分析博客的第1部分。\n为了进一步分析时间序列数据，分解有助于去除数据的季节性。\n基本上，分解有三个组成部分，如下图所示，即趋势、季节性和残差。\n您必须选择一种模型类型，也可以是加法或乘法。我们采用了加法模型，因为季节性从开始到结束变化不大。\nARIMA模型对非平稳数据的处理效果更好，我们首先要检查的是数据的平稳性。增广的Dickey-Fuller检验可以用来检验序列是非平稳的零假设。\nADF检验有助于理解Y的变化是否是线性趋势。如果存在线性趋势，但滞后值不能解释Y随时间的变化，则我们的数据将被认为是非平稳的。\n从statsmods.tsa.stattools导入adfullerdef check_stantality(TimeSeries)：result=adfuller(timeSeries，autolag=&#39；AIC&#39；)dfoutput=pd.Series(result[0：4]，index=[&#39；Test Statistics&#39；，&#39；p-value&#39；，&#39；#LAGS Used&#39；，&#39；；##39；，&#39；]。p-值：%f&#39；%Result[1])为键打印(&#39；临界值：&#39；)，结果[4]中的值。Items()：打印(&#39；\\t%s：%.3f&#39；%(键，值))。\n检验统计量的值小于5%的临界值，p值也小于0.05，因此我们可以拒绝零假设和时间序列平稳的交替假设似乎是正确的。\n", "note_en": "In the previous  post we have seen how to visualize a time series data. In this post we will discuss how to do a time series modelling using ARMA and ARIMA models. Here AR stands for Auto-Regressive and MA stands for Moving Average\n Before we start discussing the ARIMA models, we should know the stationarity of time series\n  A time series is called to be stationary if there is no change in mean, variance and covariance of the observations over a period of time.\n  In other words a process is said to be stationary if the joint distribution of observations does not change and remain same when the origin of time is shifted by amount k\n This means that the mean and variance are constant and do not depend on time. There are two types of stationary processes: Strict &amp; Weak Stationary Process\n      ARIMA stands for Auto-Regressive Integrated Moving Average and it’s one of the widely used time series models for forecasting\n It also accounts for the pattern of growth/decline in the data or noise between consecutive time points\n ARIMA are applied to data that shows Non-Stationarity and difference of successive observations are taken to eliminate the non-stationarity. Sometimes more than one difference of successive observation is required to get a modified stationary model\n That’s the reason it is called as an Integrated model because the stationary model that is fitted to the modified series has to be summed or integrated to provide a model for the original non-stationary series\n   We should be fitting the ARIMA model to a Stationary and non-seasonal time series data and follow the procedure described in the above flow chart\n First thing is you should plot the data to find hidden patterns, trends and other behavior\n  To stabilize and normalize the data you can use the Box-Cox transformation. It is a way to transform data that ordinarily do not follow a normal distribution\n Plot ACF/PACF to determine the order for the ARIMA model i.e. p,d and q values. Alternatively, you can also use AICc and BICc to determine the p,q,d values. Choose the one where AICc and BICc is lowest\n Verify the Residuals and ensure it looks like white noise otherwise try a modified model with different values of p,q and d. Remember Residuals which are white noise can do a forecast\n   We will be using the Monthly Temperature datatset of Armori City. You can download it from this  link\n  import pandas as pdimport statsmodels.api as smimport matplotlib.pyplot as pltimport seaborn as snssns.set(rc={&#39;figure.figsize&#39;:(15,6)})%matplotlib inlinedf = pd.read_csv(&#39;./monthly_temperature_aomori_city.csv&#39;)df[&#39;DATE&#39;] = pd.to_datetime(df[[&#39;year&#39;, &#39;month&#39;]].assign(DAY=1))df.drop([&#39;year&#39;,&#39;month&#39;],inplace=True,axis=1)df[&#39;temperature&#39;] = df[&#39;temperature&#39;]*(9/5)+32df.set_index(&#39;DATE&#39;,inplace=True)df.to_csv(&#39;./monthly_temperature_aomori_city_updt.csv&#39;,index=True)df.head()\n   Let’s draw a simple line plot for first 200 rows to understand the pattern in the data and how the temperature is trending. It looks like that a Cyclic pattern is followed here\n    We will draw a Box and Whisker plot for first 5 years to understand the data distribution and get a quick five point summary for the data\n    If you are looking for in-depth tutorial on Time Series Analysis and Visualization you can check  this blog, which is part 1 of this time series analysis blogs\n  To further analyze the time series data, Decomposition helps to remove the seasonality from the data.\n Basically Decomposition has three components that is shown in the graphs below i.e Trend, Seasonality and Residual\n You have to choose a model type also additive or multiplicative. We have taken an additive model because the seasonality doesn’t varies much from start to end of the years\n          ARIMA model works better on a Non-Stationary data and the first thing that we should be checking is the Stationarity of the data. The Augmented Dickey-Fuller test can be used to test the null hypothesis that the series is non-stationary\n The ADF test helps to understand whether a change in Y is a linear trend or not. If there is a linear trend but the lagged value cannot explain the change in Y over time, then our data will be deemed non-stationary\n  from statsmodels.tsa.stattools import adfullerdef check_stationarity(timeseries): result = adfuller(timeseries,autolag=&#39;AIC&#39;) dfoutput = pd.Series(result[0:4], index=[&#39;Test Statistic&#39;,&#39;p-value&#39;,&#39;#Lags Used&#39;,&#39;Number of Observations Used&#39;]) print(&#39;The test statistic: %f&#39; % result[0]) print(&#39;p-value: %f&#39; % result[1]) print(&#39;Critical Values:&#39;) for key, value in result[4].items(): print(&#39;\\t%s: %.3f&#39; % (key, value))\n   The value of test statistics is less than 5% critical value and p-value is also less than 0.05 so we can reject the null hypothesis and Alternate Hypothesis that time series is Stationary seems to be true\n   There is nothing unusual about the time plot and there appears to be no need to do any data adjustments. There is no evidence of changing variance also so we will not do a Box-Cox transformation.\n  So what does model order of ARIMA(2,1,3) means? It means 2nd order Auto-Regressive (AR) and 3rd order Moving Average (MA). You can think it as ARIMA( AR(p), I(d), MA(q))\n So the d is Integrated I(d) part that is decided based on number of times you have to do a data difference to make it stationary. We will learn more about it in the next section\n  For Moving Average order i.e. q you have to look at the Auto Correlation Factor(ACF) graph. You need some experience to keenly look at the graphs and significant lags and corresponding Correlations to determine the value\n Similarly for the Auto-Regressive order i.e. p you have to look at the partial correlation factor (pacf) graph\n Another Alternate way is to find the set of models with the lowest AIC values Akaike’s Information Criterion\n For determining AIC you have to fit the model with different combination of p,q and d and look for the lowest AIC value\n  Our Data is stationary but just to showcase how data differencing works we will assume that our Time Series data is not Stationary\n We will also do a log transform of the original data to make the seasonality same throughout the data\n   So Basically you have to subtract the value with their previous value to get the difference in data. We will use numpy.diff() function to achieve that\n    The differenced data looks stationary so we don’t have to go for any further differencing\n Again, After our first data differencing we will check the stationarity of data using the ADF test.\n This time the p-value is 0 which is very good and the test statistics is also less than the 5% critical\n     The value of d will be 1 because we have done the data difference one time to achieve stationarity\n  Once our data is set to stationary then the next task is to determine the appropriate value of ARIMA model i.e. p and q\n We can learn some important properties of our time series data with the help of Auto Correlation(ACF) and Partial Auto Correlation (PACF) graphs.\n This provide useful descriptive properties for understanding which model can be used for time series forecasting\n  In other words, ACF is used to understand if there exists a correlation between a time series data point with another point as a function of their time difference\n The Partial Auto Correlation factor(PACF) is the partial correlation between the two points at a specific lag of time.\n Plotting the partial autocorrelative functions one could determine the appropriate lags  p in an AR ( p) model or in an extended ARIMA ( p, d, q) model\n       From the PACF plot we can see a significant correlation at lag of 2. So the PACF suggests an AR(2) model. So an inital order for the model will be (2,0,3)\n  Alternatively, you can also use auto arima to find the appropriate value of p,q and d\n  So if you want to know the value of p,q and d without much of pain then use  Auto arima.\n It’s a python library inspired from the auto arima package in R which is used to find the best fit ARIMA model for the univariate time series data\n  import pyramid as pmauto_arima_fit = pm.auto_arima(df, start_p=1, start_q=1, max_p=3, max_q=3, m=12, start_P=0, seasonal=True, d=1, D=1, trace=True, error_action=&#39;ignore&#39;, suppress_warnings=True, stepwise=True)\n  Fit ARIMA: order=(1, 1, 1) seasonal_order=(0, 1, 1, 12); AIC=7044.189, BIC=7071.210, Fit time=29.769 secondsFit ARIMA: order=(0, 1, 0) seasonal_order=(0, 1, 0, 12); AIC=8721.729, BIC=8732.538, Fit time=0.218 secondsFit ARIMA: order=(1, 1, 0) seasonal_order=(1, 1, 0, 12); AIC=8072.542, BIC=8094.159, Fit time=5.261 seconds\n This will help to choose the best value of p,q and d based on the lowest AIC and BIC values\n  Now we have to fit our data to the ARIMA using the order of model (2,0,3) determined above using ACF and PACF plot.\n This sets the lag value to 2 for autoregression AR(2) and uses a data difference order of 0 since our time series is stationary, and uses a moving average model of 3.\n     A model residuals is difference between the predicted and expected value and can be verified using the fitted model property resid().\n Residual object is of type ndarray so we will store it in a Dataframe for plotting\n In the below line plot we don’t see any large residuals and all of them are within their upper and lower limits\n    Next we will check if these residuals are normally distributed and looks Gaussian or not. So we will plot the density plot to check this. This looks normal with a long left tail and centered at Zero\n    The mean of the residual is close to Zero and there is no significant correlation also that we can see in the pacf plot for residuals\n       The residual diagnostics looks like a white noise since 95% of our sample autocorrelations is between the two blue lines and it meets all our criteria for a good forecast and prediction.\n    Predict function takes a start and end parameters to specify the index at which to start and stop the prediction\n We could have done it another way also by splitting the train and test data and then comparing the test values with the predicted values\n In our case we want to validate the predicted and expected value of first three years 1882-1885. so we will give a start value of 0 and end value of 36 and that will return an ndarray of predicted values\n  Using this returned value and the original value we will plot this and visualize how the predicted and real values differ. The red lines in the graph are original values and green are predicted values\n     This looks good so far but how to quantify how the score of predicted vs Expected values. For this we will calculate the Root Mean Square Error values using Scipy\n      Next and Final Step to forecast the temperature of upcoming years i.e. Out of Sample Forecast. We will use the forecast method of statsmodel for this task.\n You can pass steps as one of the parameter i.e. number of out of sample forecasts from the end of the sample\n    We are forecasting the temperature for next 3 years i.e. 36 months so our steps will be 36 and for a confidence interval of 95% we will pass the alpha value as 0.05\n      It is stored in a variable ci above and this is how the interval value looks like\n    Now we will plot the forecast value which is shown as red line for year 2020 thru 2023 in the below graph.\n The blue strip that you see around the line is the forecast interval which is drawn with the help of fill_between() api of matplotlib\n      Time Series Data Visualization is an important step to understand for analysis &amp; forecasting and finding out the patterns in data\n Dickey-Fuller test performed to determine if the data is stationary or not. It’s necessary to check the stationarity before fitting the data to ARIMA\n Decomposition helps to remove the seasonality from the data and three components of decomposition are Trend, Seasonality and Residual\n Data differencing helps to remove stationarity from data and to determine the value of d\n Plot Auto-Correlation(ACF) and Partial Auto-Correlation (PACF) graph to determine the value of p and q\n Auto Arima package used to determine the value of p,q and d by evaluating the value of Akaike’s Information Criterion (AIC)\n Residual diagnosis is an important step post fitting the ARIMA model to evaluate if forecasting can be done with the fitted model or not\n Residual property of ARIMAResult object used for the Residual Analysis. If the residual is a white noise then we are good and ready for forecasting\n  There are few topics which I have not explained in detail like Additive and Multiplicative Model, Determine the p,q value by reading the ACF and PACF plot and using SARIMAX function for time series data with seasonality. So I would be covering those topics separately in my upcoming posts\n Facebook has an open source tool  Prophet for forecasting time series data and in my next post I will be using prophet to evaluate and compare the forecasting results with python statsmodel", "posttime": "2020-05-02 18:04:55", "tags": "教程,序列,tutorial,数据,data", "title": "时间序列建模和预测综合教程", "title_en": "Comprehensive Tutorial on Time Series Modelling and Forecasting", "transed": 0, "url": "https://kanoki.org/2020/04/30/time-series-analysis-and-forecasting-with-arima-python/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["教程", "序列", "tutorial", "数据", "data"]}, {"category": "", "categoryclass": "", "imagename": "746acbdc70aec3fcdc4dc47d15aefc90.jpg", "infoid": 1000293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对抗复杂性是软件开发的一个反复出现的主题，我已经看到它一次又一次地重复自己。这是我一直看到的在各个层次上都在争论的事情：函数和方法应该进行多少评论？理想的抽象量是多少？一个框架什么时候开始有太多的魔力？一个组织中什么时候会有太多的语言？\n我们试图摆脱复杂性，控制它，追求简单。我认为这样框定事情是被误导的。复杂性必然存在于某个地方。\n弹性工程学教会我的一件事是控制论中的必备多样性的概念：只有复杂性才能处理复杂性。\n如果您使构建工具变得简单，它将无法处理存在的所有奇怪的边缘情况。\n如果您想要处理奇怪的边缘情况，您需要偏离您想要建立的任何规范。\n如果您希望通用默认设置易于使用，则通用默认设置的规则必须在工具和用户之间共享，这些用户会根据工具的期望来调整自己的系统。\n如果您允许配置或编写脚本，则为用户提供了一种指定必须共享的规则的方法，以便该工具适合他们的系统。\n如果要使工具保持简单，则必须强制用户仅在符合此简单性的参数范围内进行操作。\n如果您的用户用例不能很好地与您的简单性相匹配，他们将围绕您的工具构建填隙程序以实现其目标。\n这是无法避免的。复杂性必然存在于某个地方。不管你是否意识到，它总是人们解决问题的一部分。\n不幸的是，如果我们到了清单的最后一点(我们总是以某种方式做到这一点)，垫片就会成为风景的一部分。复杂性不会潜伏。这是每个人学习经历的一部分，他们会适应它。\n他们绕过它，看到两个相互冲突的概念之间的不匹配。这种必要的复杂性可能会移动-回到工具(或新工具)-或者通过重新组织事物来消除。每一次这样的改变都需要付出努力，需要更多的调整，人们需要看到复杂性，理解复杂性，处理复杂性。在某些情况下，变化不会简化事情，它们会通过在不同人的假设之间创造新的不匹配而使事情复杂化，这将…。\n在“日常事物的设计”中，唐·诺曼提到了头脑中的知识和世界中的知识的概念(类似的概念在Roesler&amp；Woods&39；Design for Experts一书中更具学术性)。头脑中的知识是你知道的、你学到的、存在于你记忆中的东西。世界上的知识就是一切：记录下来的信息，设计中的提示(你通过看它的符号就知道电源按钮，你知道它可以……。\n在某些方面，专业知识就是在你的头脑中拥有让你更好地阅读世界的知识。\n我们在软件设计中遇到的一个常见陷阱来自于关注我们发现它是如何阅读和解释给定的代码片段的。专注于简单性充满了危险，因为复杂性是无法消除的：它只能四处移动。如果您将其移出您的代码，它会去哪里？\n当我们设计Rebar3时，我们觉得这个工具可以很简单。其简单性的条件是您对Erlang/OTP项目的预期结构有一个基本的了解。只要你遵循这些规则，事情就会进展顺利。我们将一些复杂性外化到更广泛的生态系统中。规则总是需要学习的(我们是这样假设的)，但是工具现在依赖于对它们的理解。在为了解规则的人简化工具使用的过程中，我们使……。\n这种陷阱在软件体系结构中是隐蔽的。当我们采用像微服务这样的东西时，我们会努力使每项服务都是单独简单的。但是，除非这种简单性太过束缚，以至于您的实际应用程序继承了它并被迫变得简单，否则它仍然必须去某个地方。如果它不在单个的微服务中，那么它在哪里？\n复杂性必然存在于某个地方。如果你幸运的话，它生活在定义明确的地方。在您决定稍微复杂的代码中，在支持代码的文档中，在工程师的培训课程中。你给它一个地方，而不是试图把它全部藏起来。你可以创造方法来管理它。当你需要它的时候，你知道去哪里见它。如果你不走运，只是试图假装复杂性可以完全避免，那么它在这个世界上就无处可去了。..。\n在无处可去的情况下，它不得不在您的系统中到处漫游，无论是在您的代码中，还是在人们的头脑中。随着人们四处转移和离开，我们对它的理解也会受到侵蚀。\n复杂性必然存在于某个地方。如果你拥抱它，给它应有的位置，在知道它存在的情况下设计你的系统和组织，并专注于适应，它可能只会成为一种压力。", "note_en": "Fighting complexity is a recurring theme of software development I&#39;ve seen repeat itself over and over again. It&#39;s something I keep seeing debated at all levels: just how much commenting should go on in functions and methods? What&#39;s the ideal amount of abstraction? When does a framework start having &#34;too much magic&#34;? When are there too many languages in an organisation?\n We try to get rid of the complexity, control it, and seek simplicity. I think framing things that way is misguided. Complexity has to live somewhere.\n One thing Resilience Engineering has taught me is the concept of  Requisite Variety from cybernetics: only complexity can handle complexity.\n  if you make the build tool simple, it won&#39;t handle all the weird edge cases that exist out there\n if you want to handle the weird edge cases, you need to deviate from whatever norm you wanted to establish\n if you want ease of use for common defaults, the rules for common defaults must be shared between the tool and the users, who shape their systems to fit the tool&#39;s expectations\n if you allow configuration or scripting, you give the users a way to specify the rules that must be shared, so the tool fits their systems\n if you want to keep the tool simple, you have to force your users to only play within the parameters that fit this simplicity\n if your users&#39; use cases don&#39;t map well to your simplicity, they will build shims around your tool to attain their objectives\n This cannot be avoided. Complexity  has to live somewhere. It&#39;s always a part of people solving problems, whether you realize it or not.\n Unfortunately, if we make it to the last point of the list (we always do in some way), the shims become part of the landscape. Complexity doesn&#39;t lay dormant. It is part of everyone&#39;s learning experience, and they adapt to it.\n They work around it, see the mismatch between two clashing concepts. That necessary complexity may move around —back into the tool (or a new tool) —or be removed by re-structuring things. Each such change requires an effort and more adjustments, and for people to see the complexity, understand the complexity, and tackle the complexity. And in some cases, changes will not simplify things, they will complexify them by creating new mismatches between assumptions various people had, which will  ...\n In   The Design of Everyday Things, Don Norman mentions the concept of &#34;Knowledge in the head&#34; and &#34;knowledge in the world&#34; (similar concepts are more academically presented in Roesler &amp; Woods&#39;   Designing for Expertise). Knowledge in the head are things you know, that you have learned, that are in your memory. Knowledge in the world is everything else: information written down, cues in design (you know the power button by looking at its symbol, and you know it can  ...\n In some ways, expertise is having knowledge in your head that allows you to better read the world.\n  A common trap we have in software design comes from focusing on how &#34;simple&#34; we find it to read and interpret a given piece of code. Focusing on simplicity is fraught with peril because complexity can&#39;t be removed: it can just be shifted around. If you move it out of your code, where does it go?\n When we designed Rebar3, we felt the tool could be simple. The condition for its simplicity is that you have a basic understanding of the expected structure of Erlang/OTP projects. As long as you follow these rules, things will go well. We externalized some of the complexity into the broader ecosystem. The rules always needed to be learned (so we assumed), but the tool now depended on them being understood. In simplifying tool usage for people who knew the rules, we made it harder for  ...\n The trap is insidious in software architecture. When we adopt something like microservices, we try to make it so that each service is individually simple. But unless this simplicity is so constraining that your actual application inherits it and is forced into simplicity, it still has to go somewhere. If it&#39;s not in the individual microservices, then where is it?\n Complexity has to live  somewhere. If you are lucky, it lives in well-defined places. In code where you decided a bit of complexity should go, in documentation that supports the code, in training sessions for your engineers. You give it a place without trying to hide all of it. You create ways to manage it. You know where to go to meet it when you need it. If you&#39;re unlucky and you just tried to pretend complexity could be avoided altogether, it has no place to go in this world.  ...\n With nowhere to go, it has to roam everywhere in your system, both in your code and in people&#39;s heads. And as people shift around and leave, our understanding of it erodes.\n Complexity has to live somewhere. If you embrace it, give it the place it deserves, design your system and organisation knowing it exists, and focus on adapting, it might just become a strength.", "posttime": "2020-05-02 18:04:51", "tags": "存在,complexity,复杂性", "title": "复杂性必须存在于某个地方", "title_en": "Complexity Has to Live Somewhere", "transed": 0, "url": "https://ferd.ca/complexity-has-to-live-somewhere.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["存在", "复杂性"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天苹果发布了iOS13.5Beta3(似乎将iOS13.4.5重新命名为13.5)，这杀死了我的一个bug。不过，这不是一个普通的错误，这是我发现的第一个0day。而且这可能也是最好的一次。不一定是因为它给了你多少，但肯定是因为我用了它多少，也因为它有多么简单。事实上，如此简单，以至于我在推特上发布的PoC看起来绝对是一个笑话。但这是100%真实的。\n我称它为“通灵纸”是因为，就像“神秘博士”喜欢携带的那个名字的物品一样，它可以让你通过安检，让别人相信你有很多你不应该拥有的证件。\n与几乎任何其他bug和我不得不处理的任何其他漏洞相比，这个错误在没有任何iOS和/或漏洞背景知识的情况下应该是可以理解的。本着这种精神，我也将尝试以一种没有iOS或利用特定知识的方式来撰写这篇文章。不过，我确实希望您大致了解什么是XML、公钥加密和哈希，理解C代码当然是一个很大的优势。\n所以，系好安全带，我大胆地说，这是iOS上迄今为止最强大的沙盒逃逸的最优雅的漏洞。：P。\n基本概念是&lt；tag&gt；打开一个标记，&lt；/tag&gt；关闭它，然后在其间插入内容。这些内容可以是原始文本，也可以是更多标签。空标记可以是自动关闭的，如&lt；tag/&gt；，它们还可以具有a=&#34；b&#34；以及yada yada等属性。上述文件中有三项内容超出了基本标记的范围：\n&lt；？.？&gt；-以问号开头和结尾的标签，即所谓的“处理指令”，会受到特殊处理。\n&lt；！DOCTYPE.&gt；-以！DOCTYPE开头的标记是“文档类型声明”，也会被特殊处理。\n&lt；！-&gt；-以&lt；！--开头和--&gt；结尾的标记是注释，它们加上其内容将被忽略。\n完整的XML规范包含更多内容，但是a)这与我们无关，b)任何人都不应该被强迫阅读。现在，XML很难解析，原因是这篇XKCD很好地说明了这一点：\n因此，您可以构造&lt；mis&gt；matching&lt；/tag&gt；，&lt；属性，这些属性永远不会关闭&gt；，甚至是永远不会关闭的&lt；标记，也可能是这样的标记：&lt；！&gt；，列表就是不会结束。这使得XML成为一种极难正确解析的格式，这一点很快就会变得重要起来。\n现在，在XML的基础上，我们有了“属性列表”，或简称为“plist”：另一种用于存储序列化数据的通用格式。你有数组、带有键-值对的字典、字符串、数字等等。plist文件有一堆不同的形式，但在苹果生态系统中，你会实际看到的只有两种：“bplist”二进制格式和基于XML的格式，这两种格式超出了本文的讨论范围。有效的XML plist可能如下所示：\n&lt；？xml version=&#34；UTF-8&#34；？&gt；&lt；！DOCTYPE plist public&#34；-//APPLIST//dtd plist 1.0//en&#34；&#34；http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34；&gt；&lt；plist version=&#34；1.0&#34；&gt；&lt；dict&&gt;；&lt；key&gt；操作系统内部版本&lt；/key&gt；&lt；string&gt；19D76&lt；/string&gt；IOConsoleLocked&lt；/key&gt；&lt；false/&gt；&lt；！--abc--&gt；&lt；key&gt；IOConsoleUsers&lt；/key&gt；&lt；array&gt；&lt；\nPLIST文件在整个iOS和MacOS中都用于配置文件、软件包属性，最后但并非最不重要的是作为代码签名的一部分。\n所以：代码签名。当二进制文件想要在iOS上运行时，名为AppleMobileFileIntegrity(或“AMFI”)的内核扩展要求它具有有效的代码签名，否则它将被当场杀死。这个代码签名是什么样子对我们来说并不重要，重要的是它是由散列和标识的。此哈希可以通过以下两种方式之一进行验证：\n它可以提前为内核所知，这就是所谓的“临时(ad-hoc)”签名。它用于iOS系统应用程序和守护进程，并且直接根据内核中的已知散列集合检查散列。\n它需要使用有效的代码签名证书进行签名。这适用于所有第三方应用程序，在此场景中，AMFI会调用userland守护进程amfid，让它运行所有必要的检查。\nApp Store证书。这只由苹果自己持有，为了以这种方式签名，你的应用程序需要通过App Store的审查。\n开发者证书。这可以是免费的“7天”证书、“常规”开发人员证书或企业分发证书。\n在后一种情况下，有问题的应用程序还需要“配置配置文件”，即Xcode(或某些第三方软件)可以为您获取的文件，该文件需要放在Payload/Your.app/embedded.mobil的App.ipa包中", "note_en": "Yesterday Apple released iOS 13.5 beta 3 (seemingly renaming iOS 13.4.5 to 13.5 there), and that killed one of my bugs. It wasn’t just any bug though, it was the first 0day I had ever found. And it was probably also the best one. Not necessarily for how much it gives you, but certainly for how much I’ve used it for, and also for how ridiculously simple it is. So simple, in fact, that  the PoC I tweeted out looks like an absolute joke. But it’s 100% real.\n I dubbed it “psychic paper” because, just like  the item by that name that Doctor Who likes to carry, it allows you get past security checks and make others believe you have a wide range of credentials that you shouldn’t have.\n In contrast to virtually any other bug and any other exploit I’ve had to do with, this one should be understandable without any background knowledge in iOS and/or exploitation. In that spirit, I’ll also try and write this post in a manner that assumes no iOS- or exploitation-specific knowledge. I do expect you however to loosely know what XML, public key encryption and hashes are, and understanding C code is certainly a big advantage.\n So strap in for the story of what I’ll boldly claim to be the most elegant exploit for the most powerful sandbox escape on iOS yet. :P\n     The basic concept is that  &lt;tag&gt; opens a tag,  &lt;/tag&gt; closes it, and stuff goes in between. That stuff can be either raw text or more tags. Empty tags can be self-closing like  &lt;tag/&gt;, and they can have attributes like  a=&#34;b&#34; as well, yada yada. There’s three things in the above file that go beyond just basic tags:\n &lt;?...?&gt; - Tags starting and ending with question marks, so-called “processing instructions”, are treated specially.\n  &lt;!DOCTYPE ...&gt; - Tags starting with  !DOCTYPE are, well, “document type declarations” and are treated specially as well.\n  &lt;!-- --&gt; - Tags starting with  &lt;!-- and ending with  --&gt; are comments, and they plus their contents are ignored.\n The full XML specification contains  a lot more, but a) that’s irrelevant to us, and b) nobody should ever be forced to read that. Now, XML is horrible to parse for reasons this XKCD illustrates beautifully:\n  So yeah, you can construct  &lt;mis&gt;matched&lt;/tags&gt;,  &lt;attributes that=&#34;are never closed&gt;, even  &lt;tags that are never closed, maybe a tag like this:  &lt;!&gt;, the list simply doesn’t end. This makes XML a format that’s excruciatingly hard to parse correctly, which will become relevant in a bit.\n Now building on XML, we have “property list”, or “plist” for short: yet another general-purpose format for storing serialised data. You have arrays, dictionaries with key -&gt; value pairs, strings, numbers, etc. Plist files exist in a bunch of different forms, but the only two that you’ll realistically see in an Apple ecosystem are the “bplist” binary format that are out of scope for this post, and the XML-based format. A valid XML plist can look something like this:\n &lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt; &lt;!DOCTYPE plist PUBLIC &#34;-//Apple//DTD PLIST 1.0//EN&#34; &#34;http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34;&gt; &lt;plist  version= &#34;1.0&#34; &gt; &lt;dict&gt;  &lt;key&gt;OS Build Version &lt;/key&gt;  &lt;string&gt;19D76 &lt;/string&gt;  &lt;key&gt;IOConsoleLocked &lt;/key&gt;  &lt;false/&gt;  &lt;!-- abc --&gt;  &lt;key&gt;IOConsoleUsers &lt;/key&gt;  &lt;array&gt;  &lt;dict&gt;  &lt;key&gt;kCGSSessionUserIDKey &lt;/key&gt;  &lt;integer&gt;  ...\n Plist files are used all throughout iOS and macOS for configuration files, package properties, and last but not least as part of code signatures.\n So: code signatures. When a binary wants to run on iOS, a kernel extension called AppleMobileFileIntegrity (or “AMFI”) requires it to have a valid code signature, or else it will be killed on the spot. What this code signature looks like isn’t important for us, all that matters is that it is identified by a hashsum. This hash can be validated in one of two ways:\n It can be known to the kernel ahead of time, which is called an “ad-hoc” signature. This is used for iOS system apps and daemons, and the hash is simply checked against a collection of known hashes directly in the kernel.\n  It needs to be signed with a valid code signing certificate. This is used for all 3rd party apps, and in this scenario, AMFI calls out to the userland daemon  amfid to have it run all the necessary checks.\n  The App Store certificate. This is held only by Apple themselves and in order to get signed this way, your app needs to pass the App Store review.\n  Developer certificates. This can be the free “7-day” certificates, “regular” developer certificate, or enterprise distribution certificates.\n In the latter case, the app in question will also require a “provisioning profile”, a file that Xcode (or some 3rd party software) can fetch for you, and that needs to be placed in your  App.ipa bundle at  Payload/Your.app/embedded.mobileprovision. This file is signed by Apple themselves, and specifies the duration, the list of devices, and the developer accounts it is valid for, as well as all the restrictions that should apply to the app.\n  In a standard UNIX environment, pretty much the only security boundaries you get are UID checks. Processes of one UID can ’t access resources of another UID, and any resource deemed “privileged ”requires UID 0, i.e. “root ”. iOS and macOS still use that, but also introduce the concept of “entitlements ”. In layman ’s terms, entitlements are a list of properties and/or privileges that should be applied to your binary. If present, they are embedded in the code signature of your binary,  ...\n  This would mean that the binary in question “holds the  task_for_pid-allow entitlement”, which in this specific case means is allowed to use the  task_for_pid() mach trap, which is otherwise not allowed at all (at least on iOS). Such entitlements are checked all throughout iOS and macOS and there’s well upwards of a thousand different ones in existence (Jonathan Levin has built  a big catalogue of all the ones he could find, if you ’re curious). The important thing is just that all  ...\n This presents an interesting problem. With iOS system apps and daemons, Apple is the one signing them, so they wouldn ’t put any entitlements on there that they don ’t want the binaries to have. The same goes for App Store apps, where Apple is the one creating the final signature. But with developer certificates, the signature on the binary is created by the developers themselves, and Apple merely signs the provisioning profile. This means that the provisioning profile must create  ...\n  Compared to the over-1000 entitlements in existence, this list is extremely short, with the only two functional entitlements being  keychain-access-groups (related to credentials) and  get-task-allow (allowing your app to be debugged). Not a whole lot to work with.\n  Back in fall 2016  I wrote my first kernel exploit, which was based on the infamous “Pegasus vulnerabilities”. Those were memory corruptions in the XNU kernel in a function called  OSUnserializeBinary, which is a subordinate of another function called  OSUnserializeXML. These two functions are used to parse not exactly XML data, but rather plist data - they are  the way of parsing plist data in the kernel. Now given the vulnerabilities I had just written an exploit for, and the still  ...\n At the same time, I was in the process of figuring out how to build an iOS app without Xcode. Partly because I wanted to understand what’s really going on under the hood, and partly because I just hate GUIs for development, especially when you Google how to do something, and the answer is a series of 17 “click here and there”s that are no longer valid because all the GUI stuff moved somewhere else in the last update. So I was getting a provisioning profile via Xcode every 7 days,  ...\n It was this combination, as well as probably a good portion of dumb luck that made me discover the following bug, and excitedly tweet about it:\n    In an informal sense, it’s clear what it means for a binary to hold an entitlement. But how do you  formally specify that? What would code look like that takes as input a process handle and an entitlement name and just returned a boolean saying whether the process does or does not have that entitlement? Luckily for us, XNU has precisely such a function in   iokit/bsddev/IOKitBSDInit.cpp:\n extern  &#34;C&#34;  boolean_t IOTaskHasEntitlement ( task_t  task ,  const  char  *  entitlement ) {  OSObject  *  obj ;  obj  =  IOUserClient :: copyClientEntitlement ( task ,  entitlement );  if  ( ! obj )  {  return  false ;  }  obj -&gt; release ();  return  obj  !=  kOSBooleanFalse ; }\n The lion’s share of the work here is done by these two functions though, from   iokit/Kernel/IOUserClient.cpp:\n OSDictionary *  IOUserClient :: copyClientEntitlements ( task_t  task ) { #define MAX_ENTITLEMENTS_LEN (128 * 1024)  proc_t  p  =  NULL ;  pid_t  pid  =  0 ;  size_t  len  =  0 ;  void  * entitlements_blob  =  NULL ;  char  * entitlements_data  =  NULL ;  OSObject  * entitlements_obj  =  NULL ;  OSDictionary  * entitlements  =  NULL ;  OSString  * errorString  =  NULL ;  p  =  ( proc_t ) get_bsdtask_info ( task );  if  ( p  ==  NULL )  {  goto  fail ;  }  pid  =  proc_pid ( p );  if  ( cs_entitlements_dictionary_copy ( p ,  ( void  ** ) &amp; entitlements )  ==  0  ...\n So we have a reference implementation for entitlement checks, and it’s backed by  OSUnserializeXML. Great! …or is it?\n A very interesting thing about this bug is that I couldn’t point you at any particular piece of code and say “there’s my bug”. The reason for that is that, of course, iOS doesn’t have just one, or two, or even three plist parsers, it has at least four! These are:\n    The answer to 1) is “all of them”, and to 2)  CFPropertyListCreateWithData. And as a few folks on Twitter already figured out after my tweet, the answer to 3) is obviously “lolnope”. Because it’s very hard to parse XML correctly,  valid XML makes all parsers return the same data, but slightly  invalid XML makes them return just slightly  not the same data. :D In other words, any parser difference can be exploited to make different parsers see different things. This is the  ...\n Before we move on to exploiting this, I would like to note that in all my tests,  OSUnserializeXML and  IOCFUnserialize always returned the same data, so for the rest of this post I will consider them as equivalent. For brevity, I will also be dubbing  OSUnserializeXML/ IOCFUnserialize “IOKit”,  CFPropertyListCreateWithData “CF”, and  xpc_create_from_plist “XPC”.\n  Let’s start with the variant of the PoC I tweeted out, which is perhaps the most elegant way of exploiting this bug:\n &lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt; &lt;!DOCTYPE plist PUBLIC &#34;-//Apple//DTD PLIST 1.0//EN&#34; &#34;http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34;&gt; &lt;plist  version= &#34;1.0&#34; &gt; &lt;dict&gt;  &lt;!-- these aren&#39;t the droids you&#39;re looking for --&gt;  &lt;!---&gt;&lt;!--&gt;  &lt;key&gt;platform-application &lt;/key&gt;  &lt;true/&gt;  &lt;key&gt;com.apple.private.security.no-container &lt;/key&gt;  &lt;true/&gt;  &lt;key&gt;\n The interesting tokens here are  &lt;!---&gt; and  &lt;!--&gt;, which, as per my understanding of the XML specification, are not valid XML tokens. Nonetheless, IOKit, CF and XPC all accept the above XML/plist… just not exactly in the same way.\n I wrote a little tool called   plparse that I have so far been reluctant to open-source because it emphasises the fact that there exist multiple plist parsers in iOS, and that they certainly don’t all work the same. It takes an input file and any combination of  -c,  -i and  -x args to parse the file with the CF, IOKit and XPC engines respectively. Running on the above file, we get:\n % plparse -cix ent.plist {}{ task_for_pid-allow: true, platform-application: true, com.apple.private.security.no-container: true,}{ com.apple.private.security.no-container: true, platform-application: true, task_for_pid-allow: true,}\n The output is a lazy JSON-like format, but you get the gist of it. At the top is CF, followed by IOKit, and finally XPC. This means that when we slap the above entitlements file on our app (plus app identifier that we need and such) and  amfiduses CF to check whether we have any entitlements that the provisioning profile doesn ’t allow, it doesn ’t see any. But then when the kernel or some daemon wants to check whether we ’re allowed to do Fun Stuff ™, they see  ...\n So how does this specific example work? This is the comment tag handling code of CF (the relevant one anyway, there are multiple):\n case  &#39;!&#39; :  // Could be a comment  if  ( pInfo -&gt; curr + 2  &gt;=  pInfo -&gt; end )  {  pInfo -&gt; error  =  __CFPropertyListCreateError ( kCFPropertyListReadCorruptError ,  CFSTR ( &#34;Encountered unexpected EOF&#34; ));  return  false ;  }  if  ( * ( pInfo -&gt; curr + 1 )  ==  &#39;-&#39;  &amp;&amp;  * ( pInfo -&gt; curr + 2 )  ==  &#39;-&#39; )  {  pInfo -&gt; curr  +=  2 ;  skipXMLComment ( pInfo );  }  else  {  pInfo -&gt; error  =  __CFPropertyListCreateError ( kCFPropertyListReadCorruptError ,  CFSTR ( &#34;Encountered  ...\n  if  ( c  ==  &#39;!&#39; )  {  c  =  nextChar ();  bool  isComment  =  ( c  ==  &#39;-&#39; )  &amp;&amp;  (( c  =  nextChar ())  !=  0 )  &amp;&amp;  ( c  ==  &#39;-&#39; );  if  ( ! isComment  &amp;&amp;  ! isAlpha ( c ))  {  return  TAG_BAD ;  // &lt;!1, &lt;!-A, &lt;!eos  }  while  ( c  &amp;&amp;  ( c  =  nextChar ())  !=  0 )  {  if  ( c  ==  &#39;\\n&#39; )  {  state -&gt; lineNumber ++ ;  }  if  ( isComment )  {  if  ( c  !=  &#39;-&#39; )  {  continue ;  }  c  =  nextChar ();  if  ( c  !=  &#39;-&#39; )  {  continue ;  }  c  =  nextChar ();  }  if  ( c  ==  &#39;&gt;&#39;  ...\n As can be seen, IOKit checks for the  !-- chars, and then correctly advances the pointer by three chars before seeing  -&gt;, which doesn’t end the comment. CF on the other hand only advances the pointer by  two chars, so it parses the second  - twice, thus seeing both  &lt;!-- and  --&gt;. This means that while IOKit considers  &lt;!---&gt; as just the start of a comment, CF considers it as both start and end. After that, we feed both parsers the  &lt;!--&gt;token,  ...\n  After discovering this, I didn’t bother reversing XPC, I simply fed it some test data and observed the results. In this case, it turned out to see the same things as IOKit, which was  perfect for my case. I could sneak entitlements past  amfid using CF, but have them show up when parsed by both IOKit and XPC!\n   &lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt; &lt;!DOCTYPE plist PUBLIC &#34;-//Apple//DTD PLIST 1.0//EN&#34; &#34;http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34;&gt; &lt;plist  version= &#34;1.0&#34; &gt; &lt;dict&gt;  &lt;???&gt; &lt;!-- ?&gt; &lt;key&gt;task_for_pid-allow&lt;/key&gt; &lt;true/&gt; &lt;!-- --&gt; &lt;/dict&gt; &lt;/plist&gt;\n  These are all less elegant and less rewarding than the first variant, and I’ll leave it as an exercise to the reader to figure out what parser difference causes those, or how the different parsers react to them.\n One thing to note here though is that, depending on what you use to install IPA files on your iDevice, getting these entitlements to survive that process can be tricky. That is because the entitlements on a provisioned app also contain a team- and app identifier, which at least Cydia Impactor generates randomly every time you sign, and thus has to parse, modify and re-generate the entitlements blob. I don ’t know about any of its alternatives, but I ’ve  ...\n  From this point forward, it’s simply a matter of picking entitlements. For a start, we can give ourselves the three entitlements in my initial PoC:\n com.apple.private.security.no-container - This prevents the sandbox from applying any profile to our process whatsoever, meaning we can now read from and write to any location the  mobile user has access to, execute a ton of syscalls, and talk to many hundreds of drivers and userland services that we previously weren’t allowed to. And as far as user data goes, security no longer exists.\n  task_for_pid-allow - Just in case the file system wasn’t enough, this allows us to look up the task port of any process running as  mobile, which we can then use to read and write process memory, or directly get or set thread register states.\n  platform-application - Normally we would be marked as a non-Apple binary and not be allowed to perform the above operations on task ports of Apple binaries, but this entitlement marks us as a genuine, mint-condition Cupertino Cookie. :P\n And just in case this entitlement magic wasn’t enough, say we needed to pretend to CF that we have certain entitlements as well, we could easily do that with the three above ones now. All we have to do is find a binary that holds the entitlement(s) we want,  posix_spawn it in suspended state, get the newly created process’ task port, and make it do our bidding:\n task_t  haxx ( const  char  * path_of_executable ) {  task_t  task ;  pid_t  pid ;  posix_spawnattr_t  att ;  posix_spawnattr_init ( &amp; att );  posix_spawnattr_setflags ( &amp; att ,  POSIX_SPAWN_START_SUSPENDED );  posix_spawn ( &amp; pid ,  path_of_executable ,  NULL ,  &amp; att ,  ( const  char * []){  path_of_executable ,  NULL  },  ( const  char * []){  NULL  });  posix_spawnattr_destroy ( &amp; att );  task_for_pid ( mach_task_self (),  pid ,  &amp; task );  return  task ; }\n You can further get some JIT entitlements to dynamically load or generate code, you can spawn a shell, or any of literally a thousand other things.\n There are a mere two privileges this bug does not give us: root and kernel. But for both of those, our available attack surfaces just increased a hundredfold, and I would argue that going to root isn’t even worth it, because you might as well go straight for the kernel.\n But I hope you will understand, dear reader, that losing one 0day is loss enough for me, so of course escalating past “mobile with every entitlement ever” is left as an exercise to you. ;)\n  Given the elusive nature of this bug, how did Apple ultimately patch it? Obviously there could only be one way: by introducing MORE PLIST PARSERS!!!one!\n In iOS 13.4 already, Apple hardened entitlement checks somewhat, due to a bug report  credited to Linus Henze:\n Available for: iPhone 6s and later, iPad Air 2 and later, iPad mini 4 and later, and iPod touch 7th generation\n While I don’t know the exact details of that bug, based on  a tweet of Linus I’m assuming this had to do with bplist, which, while also exploiting parser differences, wouldn’t have gotten past  amfid. And my bug actually survived the 13.4 fix, but was finally killed in 13.5 beta 3.\n I also don’t know whether it was Linus, Apple or someone else who went on to look for more parser differences, but having two entitlement bugs fixed in two consecutive minor iOS releases feels like too much of a coincidence, so I’m strongly assuming whoever it was drew inspiration from Linus’ bug.\n Apple’s final fix consists of introducing a new function called  AMFIUnserializeXML, which is pasted into both AMFI.kext and  amfid, and is used to compare against the results of  OSUnserializeXML and  CFPropertyListCreateWithData to make sure they are the same. You can still include a sequence like  &lt;!---&gt;&lt;!--&gt;&lt;!-- --&gt;in your entitlements and it will go through, but try and sneak anything in between those comments, and AMFI will  ...\n  So while this does technically bump the number of XML/plist parsers from 4 to 6, it does sadly actually mitigate my bug. :(\n  As far as first 0days go, I couldn’t have wished for a better one. This single bug has assisted me in dozens of research projects, was used thousands of times every year, and has probably saved me just as many hours. And the exploit for it is in all likelihood the most reliable, clean and elegant one I’ll ever write in my entire life. And it even fits in a tweet!! Well over 3 years since discovery is not half bad for such a bug, but I sure  ...\n We can also ask ourselves how a bug like that could ever exist. Why the hell there are 4 different plist parsers on iOS. Why we are still using XML even. But I figure those are more philosophical than technical in nature. And while this entire story shows that it might be a good idea to periodically ask ourselves whether the inaccuracies of our mental models are acceptable, or something should be documented and communicated more thoroughly,  ...\n Now, I’ve pumped this post out as soon as I possibly could, so if I’ve left any mistake in here, you have any questions, or just wanna chat in general, feel free to  file an issue, hit me up  on Twitter, or shoot me an email at  *@*.net where  * =  siguza.\n At the time of writing, this bug is still present on the latest non-beta version of iOS. The whole project is available  on GitHub, have fun with it while it lasts!\n And finally, some of the reactions I got of Twitter for all of you to enjoy:", "posttime": "2020-05-02 18:04:48", "tags": "ios,沙盒,paper,gt,entitlements", "title": "通灵纸：iOS沙盒逃脱", "title_en": "Psychic Paper: iOS Sandbox Escape", "transed": 0, "url": "https://siguza.github.io/psychicpaper/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["ios", "沙盒", "paper", "gt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dgraph是一个分布式图形数据库，它使用RAFT进行每个分片的复制，并使用自定义事务协议进行快照隔离的跨分片事务。Dgraph解决了我们2018年报告1.0.2版中的所有问题，并要求进行简短的后续行动。我们在版本1.1.1中发现了五个安全问题-其中一些是Dgraph已经知道的-包括观察到瞬时空值的读取、逻辑状态损坏和丢失确认的插入的大窗口。所有这些问题都涉及平板电脑..。\nDgraph是一个图形数据库，其目标是在带标签的有向图上提供可伸缩、高可用性和快照隔离的事务，同时最小化网络通信以提高性能。从概念上讲，Dgraph存储一组(实体、属性、值)三元组。实体(也称为主题)是紧凑的二进制UID。属性(也称为谓词)是命名边。值(也称为对象)可以是文字值，也可以是其他实体的UID。加在一起，这三个人.。\n为了读取此图，Dgraph提供了一种改编自GraphQL的递归查询语言。突变是通过列出要在图中添加或删除的三元组来表示的。为方便起见，Dgraph还可以将与给定实体关联的所有三元组表示为将属性映射到值的JSON对象-其中值是其他实体，该实体的属性和值作为对象递归嵌入。\n为了存储大型数据集，Dgraph按属性分割三元组集合，将属性分解为一个或多个图形输入板，并将每个图形输入板分配给一组节点。每个组使用RAFT在该组的三元组上提供复制的、顺序/线性一致的存储和查询。只要每个组的大多数服务器保持完好和连接，Dgraph就应该保持可用。1个。\n为了提供跨不同RAFT组的事务隔离，Dgraph构建了一个自定义事务系统。存储节点(称为Alpha)由监控系统(称为Zero)控制。零节点形成单个RAFT集群，该集群监督由每个Alpha组形成的RAFT集群。零领导者在提交时分配事务时间戳和检测冲突，以及维护群集成员资格和平板电脑到组的映射。\n作为我们合作的一部分，Dgraph在他们的公共文档中增加了一个关于一致性属性的部分，其中规定Dgraph中的事务确保快照隔离(SI)和实时安全属性：如果事务T1在T2开始之前提交，则T1的提交时间戳严格小于T2的开始时间戳。\n当事务仅与单键交互时，Dgraph的实时保证意味着可线性化。然而，Dgraph事务通常是不可线性化的，因为线性化要求操作(即事务)看起来像是原子发生的，而快照隔离允许事务交织，只要它们的写入集是不相交的。原子事务上的线性化是严格的串行化：一种更强的属性。然而，快照的约束条件是.。\n我们根据前面的分析回顾并更新了Jepsen测试套件，主要更新了错误处理例程，以适应自1.0.6以来的新Dgraph客户端和服务器行为。我们在LXC和EC2上的5节点Debian集群上运行了我们的测试，复制因子为3。Dgraph Alpha节点被组织成两组：一组具有三个副本，另一组具有两个副本。每个节点都运行Zero和Alpha的实例。\n我们测量了Dgraph在各种故障模式下的行为，包括Alpha和Zero崩溃、平板电脑移动、时钟偏差以及具有传递和非传递拓扑的网络分区。\n我们最基本的测试将一个唯一数字序列插入到Dgraph中，然后查询所有现有值。然后，我们检查每个成功确认的插入是否出现在最终读取中。我们运行了这项测试的两个变种。\n第一个变体使用具有类型和值字段的模式，并且对于每个插入的值v，创建一个具有类型“element”和值v的新实体。要查询，我们搜索每个类型为“element”的对象，并返回其相应值。从类型到值属性的联接有助于验证Dgraph的类型索引是否正常工作。\n第二个变体省略了type字段，而是使用单个实体；每次插入v都会创建该实体到v的三元组映射。这意味着我们可以查询与该特定UID相关联的每个值，这直接映射到Dgraph内部存储三元组的方式。Dgraph查找与值谓词相关联的组，在该组中查找该特定实体的UID，并返回所有匹配值，而不使用索引。\n向上插入是一种常见的数据库操作，在该操作中，当且仅当对等记录尚不存在时，才会创建记录。例如，我们可能希望确保用户记录e", "note_en": "Dgraph is a distributed graph database which uses  Raft for per-shard replication and a  custom transactional protocol for snapshot-isolated cross-shard transactions. Dgraph resolved all issues from our  2018 report on version 1.0.2, and requested a brief followup. We found five safety issues in version 1.1.1 —some known to Dgraph already —including reads observing transient null values, logical state corruption, and the loss of large windows of acknowledged inserts. All of these issues involved tablet  ...\n Dgraph is a graph database which aims to provide scalable, highly-available, and snapshot-isolated transactions over a labeled directed graph, while minimizing network communication for performance. Conceptually, Dgraph stores a set of  (entity, attribute, value)triples. Entities (also known as subjects), are compact binary UIDs. Attributes (also known as predicates) are named edges. Values (also known as objects) are either literal values, or the UIDs of other entities. Together, these triples  ...\n To read this graph, Dgraph offers a recursive  query language adapted from  GraphQL.  Mutations are expressed by listing triples to add or remove from the graph. For convenience, Dgraph can also represent all triples associated with a given entity as a  JSON object mapping attributes to values—where values are other entities, that entity’s attributes and values are embedded as an object, recursively.\n To store large datasets Dgraph  shards the set of triples by attribute, breaks attributes into one or more  tablets, and assigns each tablet to a  group of nodes. Each group uses Raft to provide replicated, sequentially/linearizably consistent storage and queries over that group’s triples. So long as a majority of each group’s servers remain intact and connected, Dgraph should remain available.  1\n To provide transactional isolation across different Raft groups, Dgraph has built a  custom transaction system. Storage nodes (called Alpha) are controlled by a supervisory system (called Zero). Zero nodes form a single Raft cluster, which supervises the Raft clusters formed by each Alpha group. Zero leaders assign transaction timestamps and detect conflicts at commit time, as well as maintaining cluster membership, and the mapping of tablets to groups.\n  As a part of our collaboration, Dgraph added a  section on consistency properties to their public documentation, which states that transactions in Dgraph ensure  snapshot isolation (SI) plus a realtime safety property: if transaction   T 1 commits before   T 2 begins, than the commit timestamp of   T 1 is strictly less than the start timestamp of   T 2.  2\n When transactions only interact with single keys, Dgraph’s real-time guarantees imply  linearizability. However, Dgraph transactions are not linearizable in general, because linearizability requires that operations (i.e. transactions) appear to take place atomically, whereas snapshot isolation allows transactions to interleave so long as their write sets are disjoint. Linearizability over atomic transactions is  strict serializability: a stronger property. However, the constraint that snapshot  ...\n  We reviewed and updated the  Jepsen test suite from our  previous analysis, primarily updating error handling routines to adapt to new Dgraph client and server behavior since 1.0.6. We ran our tests on five-node Debian clusters, both on LXC and EC2, with replication factor three. Dgraph Alpha nodes were organized into two groups: one with three replicas, and one with two. Every node ran an instance of both Zero and Alpha.\n We measured Dgraph’s behavior under a  variety of failure modes, including Alpha and Zero crashes, tablet moves, clock skew, and network partitions with both transitive and non-transitive topologies.\n  Our most basic test inserts a sequence of unique numbers into Dgraph, then queries for all extant values. We then check that every successfully acknowledged insert is present in a final read. We ran two variants of this test.\n The  first variant uses a schema with  type and  value fields, and for each inserted value   v, creates a new entity with type “element” and value   v. To query, we search for every object with type “element”, and return their corresponding values. The join from  type to  value attributes helps verify that Dgraph’s  type index works correctly.\n The  second variant omits the  type field and instead uses a single entity; every insert of   v creates a triple mapping that entity to   v. This means that we can query for every value associated with that particular UID, which maps directly to the way Dgraph stores triples internally. Dgraph finds the group associated with the  value predicate, looks up that particular entity’s UID in that group, and returns all matching values, without using indices.\n  An  upsert is a common database operation in which a record is created if and only if an equivalent record does not already exist. For instance, we might wish to ensure a user record exists for a given email, but if the email is already taken, to avoid creating a second user. In SQL databases, a unique primary key can be used as the equivalence relation for upserts, but in Dgraph there are no uniqueness constraints. Instead, users  perform a transactionwhich reads to ensure the record  ...\n However, snapshot isolation only detects conflicts between transactions which write the same objects, but inserts, by definition, write  unique objects and will never conflict. This allows write skew: two concurrent upserts of the same value could read an empty state, insert their respective rows, and commit, resulting in  two records instead of one. To avoid this problem, Dgraph also treats  indices as their own objects for the purposes of conflict detection.\n The index is stored as many key/value pairs, where each key is a combination of the predicate name and some function of the predicate value (e.g. its hash for the hash index). If two transactions modify the same key concurrently, then one will fail.\n To verify that this conflict detection works correctly, we have several transactions concurrently  attempt to upsert the same value, and subsequently read back all objects with that value. If upserts are safe, we should never find more than one copy for a given key.\n  Early experiments with Dgraph led to the suspicion that deleting records might cause anomalous behavior, especially with respect to indices, so we designed a test for  repeated upserts and deletionsof the same value. Axiomatically, upserts should never result in more than one record —we verify this in the upsert test. Our delete test extends this workload by concurrently attempting to delete any records for an indexed value. Since deleting can only lower the number of records, not  ...\n  The bank test stresses several invariants provided by snapshot isolation. We construct a set of bank accounts, each with three attributes:\n type, which is always “account”. We use this to query for all accounts.\n Our test begins with a fixed amount ($100) of money in a single account, and proceeds to randomly  transfer money between accounts. Transfers proceed by reading two random accounts by key, and writing back new amounts for those accounts. Concurrently, clients  read all accounts to observe the total state of the system.\n Since transfers write every key that they read, snapshot isolation precludes concurrent execution of any transfers between intersecting accounts, guaranteeing transfers are serializable. Read-only transactions cannot affect the state of the system, and observe consistent snapshots, which implies they too must be serializable. From this, we can prove that the total of all account balances should be  constant.\n Because we like to live dangerously, we permute the order of reads and writes in transfer transactions at random, upsert new account records when none exist, and delete accounts which have a zero balance. This puts additional stress on Dgraph ’s index, which cannot assume that queries for a certain key always refer to the same entity. We also insert garbage data before aborting certain transactions, to help detect dirty reads. Different accounts use different predicates to  ...\n  For performance reasons, some database systems implement  parallel snapshot isolation, rather than standard snapshot isolation. Parallel snapshot isolation allows an anomaly prevented by standard SI: a  long fork, in which non-conflicting write transactions may be visible in incompatible orders. As an example, consider four transactions over an empty initial state:\n  Here, we insert two records,   x and   y. In a serializable system, one record should have been inserted before the other. However, transaction 3 observes   y inserted before   x, and transaction 4 observes   x inserted before   y. These observations are incompatible with a total order of inserts.\n To test for this behavior, we  insert a sequence of unique keys, and concurrently query for small batches of those keys, hoping to observe a pair of states in which the  implicit order of insertion conflicts.\n  Earlier versions of Dgraph offered a per-client property akin to sequential consistency, which enforced that each individual client observed monotonically increasing states of the graph. To help check this property, we establish a set of registers, each composed of a key and a value. On each register separately, we  performa series of increment operations mixed with reads of that register. Since our transactions only interact with single keys, snapshot isolation implies  ...\n  Our analysis of  Dgraph 1.0.2, completed in August 2018, left four issues unresolved: a deadlock in cluster join, an issue where transactions would time out at the end of set tests, and two snapshot isolation violations which allowed for permanent logical state corruption, associated with and without tablet moves, respectively. Dgraph has since closed all of these issues, and we’d like to review them briefly.\n  When setting up new clusters,  Dgraph Alpha nodes could get stuck indefinitely at the JoinCluster phase. Dgraph believes this problem had to do with a  quorum check performed by the underlying Raft library, combined with Dgraph’s parallel join process. Disabling the quorum check for reads, and ensuring that nodes joined the cluster one at a time, seemed to  resolve the issue by 1.0.8-rc1, and it did not appear in our review of 1.1.1 either.\n  At the end of UID set tests, we found occasional cases where Dgraph could  time out every read query after some point. This problem affected clusters without exogenous faults, and, once triggered, appeared to last indefinitely: we observed up to an hour without recovery. Nodes appeared to be in the middle of an automatic predicate migration which never completed.\n The cause of this issue was never ascertained, but by February 2019, it was  no longer reproducible.\n  In 1.0.5-dev, bank tests—even in healthy clusters—could result in  account balances drifting higher or lower over time. Effects could be limited to particular nodes. Some tests showed only transient incorrect balances, and others appeared permanently altered. This problem appeared even without predicate moves.\n By  version 1.0.7, Dgraph no longer exhibited snapshot isolation violations in bank tests with healthy clusters, though it still corrupted data with network partitions.\n By November 2018, Dgraph had  identified a cause. When a Zero leader received a commit request for a transaction   T, it assigned a timestamp to that commit. If Zero was unable to communicate with its Raft peers, and a new Zero node became the leader, that new leader would begin allocating timestamps at a significantly higher number. Alphas interacting with the new Zero leader would advance their  max-appliedtimestamps to match. Then assume the original Zero leader  ...\n A read   R executed after the new leader advanced the clock, but before   T’s commit was retried, could fail to observe   T—even though   T would go on to commit in the logical past of   R. In essence, this allowed temporary “holes” in the timeline of transactions.\n When an Alpha node applied a write   w for key   k, it would first check   k’s last written timestamp, and ignore   w if it was lower. If   w was a write from the logical  past,   w might be rejected—but other writes from the same transaction might succeed, so long as they hadn’t been written recently. This allowed Dgraph to partially apply transactions.\n In addition, Dgraph identified and fixed a second, related bug in the transaction commit process. When Alpha leaders received transaction commit messages from Zero, they appended those commits via Raft to their log. However, if that append process timed out, Alpha would  give up on appending that commit message. This allowed transactions to be applied on some Alpha groups, but not on others.\n Both of these issues were  fixed in 1.0.11, which prevented Zero leaders-cum-followers from sending transaction commit proposals to new leaders after stepping down, and by forcing Alpha nodes to retry commits on indeterminate failures, rather than giving up on them.\n  Even in healthy clusters, version 1.0.4 exhibited  read skew in bank tests, leading to permanent state corruption. Some of this behavior was caused by queries returning spurious null values instead of valid data, but others were caused by read skew. Account totals could  change gradually over time, fluctuate chaotically, or alternate between two different values.\n While these symptoms were similar to the previous issue, they had different underlying causes: these problems were linked to tablet migration. By  January 2019, Dgraph had  redesigned the tablet migration code: instead of blocking writes on Alphas during a migration, it would instead block commits on the Zero leader —the node with an authoritative view of the tablet-to-group mapping. This prevented writes from sneaking onto the wrong nodes in the interval between  ...\n This redesign prevented account totals from changing permanently. However, reads do  not (for performance reasons) consult Zero, which allowed read-only transactions to observe  occasional transient read skew. Upon receiving a read at time   t, Alpha would block until it had applied every transaction up to   t, to ensure no transaction’s effects would be missing for the read at   t. However, if that particular Alpha had an outdated view of the tablet to group mapping,  ...\n In essence, this problem stemmed from the fact that membership changes and transaction commits formed two separate, asynchronous streams of information from Zero to Alpha; a node might be processing recent transactions, but be out of date on cluster membership. To bring these streams into alignment, Dgraph added a  checksum of the membership stateto each batch of transaction commits, and ensured that Alpha nodes refused to service requests when their membership  ...\n This prevented reads from executing on nodes which didn’t yet, or no longer, held the current copy of that tablet. Dgraph then  passed bank tests even with tablet migrations  3; the patch was released in Dgraph 1.1.\n  In the present work, we tested Dgraph 1.1.1, as well as later development builds. We encountered five safety issues, all involving tablet migration.\n  In 1.1.1 and 1.1.1-56-ge18986f1c, we observed cases where reads would return a null value for a record which should have existed. For instance, consider  this bank test, in which a handful of reads observed null values for account balances…\n    One could interpret this behavior as read skew, since  nil is the initial state of every record—but this problem does not resemble read skew in general. In almost every case, we observed the  absence of data, rather than a value from the wrong timestamp.\n These errors were common in version 1.1.1, occurring with essentially every tablet move. In  sequential tests (issue 4540), they manifested as spurious non-monotonic reads. In  bank tests (issue 4534), we saw transient reads where the total balance was lower than expected, because some accounts showed  nil rather than their actual balance.\n  This issue occurred immediately following tablet migration. When a tablet was moved from one shard to another, the new shard could  serve transactions whose start timestamp was  prior to the tablet move time, and the old shard could serve transactions with a start timestamp  after the move time—i.e. after that shard had deleted the tablet entirely. Without any data, those shards would return null values.\n This bug was fixed in  ec445503, which should be released as a part of 1.1.2; we have verified that this patch dramatically reduces the probability of spurious nulls.\n However, we continued to see this problem infrequently with  1.1.1-56-ge18986f1c. During tablet moves, one read every few thousand seconds observed null instead of the actual value. More recent builds have not exhibited this problem, but we left issue #4575 open until a cause and fix can be confirmed.\n  In versions 1.1.1 and 1.1.1-48-g157896305, bank tests occasionally exhibited permanent changes in the balance of all accounts. Under snapshot isolation, the bank workload should observe a constant balance over time. However, a tablet move could cause a single read query to  observe two account balances from  different timestamps: an anomaly called read skew. This was issue #4543.\n In  this history, a transfer transaction moved $2 from account 4 to account 6, which emptied account 4, and changed account 6’s balance from $1 to $3. However, a later read observed account 4  after the transfer, and account 6  before, resulting in a total of $98 rather than $100. We have elided other transactions for clarity.\n  Transfer transactions which wrote new values based on skewed reads allowed Dgraph to propagate transient read errors into permanent changes: the total of all accounts changed from $100 to $98, and remained that way for the remainder of the test.\n In  this test run, process 5 begins a transfer of $2 from account 6 to account 3, while a tablet move is ongoing. While that transfer is happening, a pair of read transactions observe account 3 ’s balance increase from $5 to $7, but no corresponding decrement is made to account 6. The transfer transaction then fails with an error message indicating that the read timestamp for that transaction was lower than the minimum timestamp available for that  ...\n   It’s not clear from this history whether process 5’s transfer somehow took  partial effect, or whether it cleanly failed and something else in Dgraph caused the value of account 3 to fluctuate. Whatever the case, the effects were permanent: for the rest of the test, every read (except those affected by transient null issues, as described previously) observed a total of $102, rather than $100.\n   In UID set tests with Dgraph 1.1.1, 1.1.1-48-g157896305, and 1.1.1-65-g2851e2d9a, we observed that windows of up to tens of thousands of acknowledged inserts  could be lost. This issue (#4538) appeared to be associated with tablet moves.\n For example, in  this test run, Dgraph acknowledged 22,187 writes successfully. However, of those acknowledged writes, all 11,544 between 11,350 and 23,715 were lost—they failed to appear in a final read. Triples inserted both before and after that window were fine.\n Dgraph believes this problem is related to posting list splits. A  posting list is a collection of edges belonging to some attribute. When a posting list becomes large, it is split into a tree, whose root is identified by a canonical key. However, a bug in Dgraph allowed  the parts of a split posting list to be accessed individually, instead of through the main key. Accessing the posting list through these secondary keys caused issues during  ...\n  In version 1.1.1, we saw something else unusual with UID set tests: Dgraph would successfully acknowledge tens of thousands of inserts of distinct triples, and, when we asked for all of them back,  return exactly one. In  this test run, we successfully inserted 19,030 unique integer values, and, upon reading them back, received:\n    This issue only occurred infrequently, but the impact was severe: not only was all but one write lost, but the  type of value changed! Instead of receiving a list of integers, we got only a single number. This is particularly vexing because the schema for this attribute explicitly defines  value to be a list:  value: [int] .\n Dgraph believes this problem (#4601) could be associated with a  bug in splitting posting lists, and that recent patches have addressed the issue. Indeed, we have not encountered it in 1.1.1-65-g2851e2d9a, or subsequent builds. However, reproducing this issue has proven difficult, and without a plausible account as for  why the posting-list bug could cause the schema to change, we are cautious about declaring it fixed.\n   Dgraph resolved all of the issues we discussed in the previous Jepsen analysis. However, we found significant new safety issues in 1.1.1 which were, in many cases, functionally identical to bugs we’ve seen in the past: read skew, transient missing values, and lost inserts.\n This does not mean that Dgraph has failed to make progress. Indeed, the work Dgraph has undertaken in the last 18 months has dramatically improved safety. In 1.0.2, Jepsen tests routinely observed safety issues even in healthy clusters. In 1.1.1, tests with healthy clusters, clock skew, process kills, and network partitions all passed. Only tablet moves appeared susceptible to safety problems.\n As of 1.1.1-59-g191232226, we have failed to observe any violations of snapshot isolation. The current Jepsen test suite passes—at least with short runs. Unfortunately, some of these bugs were difficult to reproduce, and we have not had sufficient testing time to declare these issues resolved. Since Dgraph Labs has not identified a potential cause or patch resolving  4575 and  4543, we ’ve left these issues categorized as “unresolved ”— ...\n As always, we note that Jepsen takes an experimental approach to safety verification: we can prove the presence of bugs, but not their absence. While we try hard to find problems, we cannot prove the correctness of any distributed system.\n  All of the issues we found had to do with tablet migrations, which raises the obvious question: why migrations in particular? We suggest two potential causes.\n In part, we found issues in tablet migrations because that ’s where we looked. Dgraph Labs knew that 1.1.1 had issues with tablet moves, but had difficulty fixing them, in part because the Jepsen test suite no longer ran reliably. Changes to Dgraph APIs prevented Jepsen from properly detecting common failure conditions, which in turn broke the retry mechanisms Jepsen uses to run tests reliably. Updating the tests to interpret Dgraph  ...\n In more general terms, tablet migrations were error-prone because changing distributed state is just plain  hard. Dgraph relies on Raft for state changes within a group, and Raft is a solid algorithm with mature implementations that handle failure well. Dgraph coordinates transactions between Raft groups by having nodes agree on which groups own which tablets. This too is relatively straightforward —as long as that mapping doesn ’t  ...\n We see this pattern in many Jepsen tests: as more databases adopt proven consensus algorithms like Paxos and Raft for shard state, we’ve found fewer bugs at the level of individual shards. Coordinating cluster metadata and ensuring transactional correctness  across those shards has proven more difficult. This suggests an important avenue of research for academics—and an area of caution for engineers.\n  Dgraph 1.1.1 exhibited significant violations of snapshot isolation related to tablet migration: an infrequent but normal process in Dgraph. Users could experience transient read skew, permanent state corruption, the loss of large windows of committed inserts, or the replacement of a (potentially large) set of values with just one, along with type errors: returning a single integer, rather than a list.\n In version 1.1.1 and below, we recommend exercising caution during tablet moves, if possible. For instance, performing manual tablet migration during a scheduled maintenance window, rather than under normal load, could reduce the probability that transactions encounter anomalous behavior. We also advise discontinuing use of the cluster during tablet migration to prevent update transactions from observing inconsistent data, then  ...\n Recent development builds, like 1.1.1-59-g191232226, have not exhibited these anomalies, but we stress that Jepsen has not had sufficient time to verify these builds in detail. While we cannot make a strong claim of correctness, Version 1.1.2 incorporates many patches which should dramatically reduce the frequency of errors. We advise upgrading to 1.1.2 or higher.\n   Meanwhile, Jepsen has developed  Elle: a novel checker for transactional systems, which should be well-suited to testing Dgraph. We would like to apply Elle to Dgraph, especially with respect towards per-process and realtime guarantees. We would also like to evaluate Dgraph with slow networks, process pauses, and single-node faults like filesystem corruption.\n In general, our tests now go thousands of seconds without finding bugs, but we  did occasionally find issues in development builds. Weak discriminatory power suggests it’s time to redesign the tests to be more aggressive. We could increase key and tablet counts, adjust contention probabilities, and shard tests where appropriate.\n This work was funded by  Dgraph, and conducted in accordance with the  Jepsen ethics policy. Jepsen wishes to thank the entire Dgraph team for their help—especially Manish Jain and Daniel Mai.\n Note that Dgraph may create groups with fewer than the specified number of replicas, when the number of nodes in that group is not evenly divisible by the target replica count. Those shards have reduced fault tolerance. ↩\n This property may be what Elnikety, Pedone, &amp; Zwaenepoel refer to as “conventional snapshot isolation” in  Generalized Snapshot Isolation and a Prefix-Consistent Implementation. ↩\n These passing results may have been somewhat premature; later testing revealed additional issues, which we describe in this report. ↩", "posttime": "2020-05-02 18:04:41", "tags": "杰普森,jepsen,dgraph", "title": "杰普森：Dgraph 1.1.1", "title_en": "Jepsen: Dgraph 1.1.1", "transed": 0, "url": "https://jepsen.io/analyses/dgraph-1.1.1", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["杰普森", "jepsen", "dgraph"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "提交人。\n以.为动力", "note_en": "Presented by\n  Powered by", "posttime": "2020-05-02 18:04:40", "tags": "西斯,tour,提交,presented", "title": "拉美西斯六世法老陵墓虚拟之旅", "title_en": "Virtual tour of the tomb of Pharaoh Ramses VI", "transed": 0, "url": "https://my.matterport.com/show/?m=NeiMEZa9d93&mls=1", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["西斯", "tour", "提交", "presented"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要继续，请单击下面的框，让我们知道您不是机器人。\n请确保您的浏览器支持JavaScript和Cookie，并且您没有阻止它们加载。有关更多信息，您可以查看我们的和。", "note_en": "To continue, please click the box below to let us know you&#39;re not a robot.\n  Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our   and  .", "posttime": "2020-05-02 18:04:39", "tags": "揭示,market,click", "title": "停放在货船上的SUV揭示了美国汽车市场供过于求的范围", "title_en": "SUVs parked on cargo ships reveal scope of U.S. auto market glut", "transed": 0, "url": "https://www.bloomberg.com/news/articles/2020-05-01/suvs-get-parked-in-the-ocean-and-reveal-scope-of-u-s-car-glut", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["揭示", "market", "click"]}, {"category": "", "categoryclass": "", "imagename": "3a2c8ff34fd49b01fe6f2f02913f84b6.jpg", "infoid": 1000286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有什么比电影中的电脑更酷的了，1985年的“杀戮见闻”中有一款特别酷的Apple IIc。加入我的行列，让我一位一位地、一字节一字节地伪造这封信。在这段视频中，我仔细地对电影中的应用程序进行反向工程，并使用Applesoft basic和各种开发技巧在我的Apple IIc上重新创建它。没人问，但我肯定送到了。订阅更多深奥的技术视频！访问https://www.maxpiantoni.com..。", "note_en": "There&#39;s nothing cooler than a computer in a movie, and 1985&#39;s A View To A Kill has a particularly cool Apple IIc. Join me as I forge this Faberge bit by bit, byte by byte. In this video I meticulously reverse engineer the application from the movie and recreate it on my Apple IIc using Applesoft BASIC and a variety of development tricks. No one was asking, but I sure delivered.  Subscribe for more esoteric technology videos!   Visit  https://www.maxpiantoni.com  ...", "posttime": "2020-05-02 18:04:27", "tags": "app,软件,apple,iic,james", "title": "重建詹姆斯·邦德的Apple IIc-A软件赝品[视频]", "title_en": "Rebuilding James Bond's Apple IIc – A Software Forgery [video]", "transed": 0, "url": "https://www.youtube.com/watch?v=YGVfwEEjRfs", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["app", "软件", "apple", "iic", "james"]}, {"category": "", "categoryclass": "", "imagename": "3a44a1681773875b26ef96cd11fbf63e.png", "infoid": 1000285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个星期天，我都会向10.000多名订阅者发送一份时事通讯，名为“周刊”。在这篇文章中，我将深入探讨这些邮件是如何传递给订阅者的。\n要做的第一件事(也可以说是最重要的一件事)是收集所有要包含在时事通讯中的链接。\n只需在浏览器中单击一下，它就会被标记为书签，以便稍后处理。我对我的书签相当自由。在这个阶段，我不需要阅读每一篇文章。如果它看起来很有趣，我会把它放在书签上--稍后会进行策展。\n我经常收到对我发送的时事通讯的回复，那里的读者有一些跟进或与我写的观点不同的观点。这通常会有几个链接供我查看，而且很有可能反馈会出现在下一周的特刊上。\n附注：如果你有一篇有趣的文章，请随时通过Twitter(我的DM是开放的)或通过电子邮件m@ttias.be发送给我。\n我编写了一个小脚本，它与Pocket API对话，检索所有链接，并将其格式化为Markdown。它真的只对我有用，但如果你感兴趣，可以在Github上找到：mattiasgeniar/Generator.cronWeekly.com-v2。\n请注意，这也不是最漂亮的代码-但对我来说已经足够好了。\n结果是时事通讯内容的建议，以我可以使用的方式格式化。\n这为我节省了大量准备时事通讯语法的时间，因为它都是用Markdown写的。口袋里也有每一篇文章的不错的摘要，我只需要稍微调整一下。\n随着Pocket建议以Markdown格式提供，现在开始了最耗时的部分：写作。\n虽然Pocket对项目的描述提出了很好的建议，但对于新闻或教程部分的项目却不太管用。\n在这一点上，我还没有读完所有的链接(我做了很多书签，通常仅仅是基于标题)，大约50%的链接在这一步中被扔掉了。\n这是一个需要我2-3个小时的舞台。一半用来打字，另一半用来阅读文章。\n这一步可能看起来有点倒退，但它适用于我的工作流程：一旦我有了可用的web版本，我将使用它为时事通讯的HTML和TXT视图生成一个不同的版本。\n转换的输入是Hugo解析的Markdown文件。它看起来是这样的：\n作者：mattiasdate：2020-04-26T06：50：00+01：00发布日期：2020-04-26T06：50：00+01：00url：/cronWeek/Issue-131/--大家好！👋欢迎来到Cron.Week Issue131.最后一期发布日期：2020-04-26T06：50：00+01：00url：/cronWeek/Issue-131/--大家好！欢迎来到Cron.Week Issue#131。\n它生成TXT版本(-t标志)或HTML版本(-h标志)，并在Mac上使用pbcopy将输出复制到我的剪贴板。\n我花了相当多的时间来优化这两个视图，使其在任何电子邮件客户端上看起来都很好。上面的脚本生成此HTML输出：\n因为读者是非常技术性的，所以有惊人数量的用户在Mutt(一个纯文本客户端)上阅读它。他们会收到这个版本：\n我尝试了更多的ASCII艺术，但它在每个客户机上呈现的效果都不同(因为它使用您选择的字体)，所以我完全放弃了它。干净而简单(&A&S)。\n网络版在正确的时间自动发布，使用Hugo的PublishDate变量和服务器上的cronjob，每小时重新生成一次站点。\n每小时的cronjob在小时前5分钟运行，因此时事通讯在几分钟后邮件发出之前准时生成。\n发送时事通讯有两个重要组成部分：客户端和MTA。\n我使用一个名为MailCoach的PHP工具，它允许我配置时事通讯，设置HTML和TXT正文，并将它们发送给所有订阅者。\n为了收集新的电子邮件注册，我在这个(静态)网站上嵌入了MailCoach表单。每周存档页面上的表单的POST目标指向MailCoach，然后MailCoach存储电子邮件地址并验证双重选择加入。\n网页版的MailCoach允许我查看之前的活动，监控列表的增长等。\n我强烈支持无跟踪，所以这里没有显示打开率或点击率。MailCoach支持这一点，但我不想跟踪用户。😄。\n我从Sendy转到了MailCoach，因为它允许我轻松地扩展它，这在更低的位置会更方便一些。\nMailCoach，就像Sendy一样，可以使用Amazon SES，MailGun，Sendmail，…发送电子邮件。自从我最近因为重新启动时事通讯(这是我自己的错)而被亚马逊SES解雇后(这是我自己的错)，我转而使用Mailgan。\n它们的速度相当快，时事通讯在不到10分钟的时间内就会发送给大约10.000名订阅者。\n我最近将Mailgan计划升级为每月80美元的增长计划，这让我有了更长的日志保留时间和固定的IP地址。\n自从我现在为Mailgan买单以来，我一直在逐个切换我的所有项目，包括来自Gma的传出电子邮件", "note_en": "Every Sunday, I send out  a newsletter called cron.weekly to over 10.000 subscribers. In this post, I’ll do a deep-dive into  how those mails get delivered to subscribers.\n   The first (and arguably, most important) thing to do is collect all the links to include in the newsletter.\n   A simple click in the browser and it’s bookmarked for later processing. I’m pretty liberal about what I bookmark. At this stage, I don’t have to read  every article. If it looks interesting, I’ll bookmark it - curation happens later.\n  Quite often I get a reply to a newsletter I send, where a reader has some follow-up or a different point of view from what I wrote. This usually comes with a couple of links for me to check out, and chances are that feedback makes it in next weeks’ issue.\n Side note: if you have an interesting article, do feel free to send it to me either  via Twitter (my DMs are open) or via email at  m@ttias.be.\n  I wrote a small script that talks to the Pocket API, retrieves all the links and formats it in Markdown for me. It’s really only useful to me, but it’s available on Github if you’re interested:  mattiasgeniar/generator.cronweekly.com-v2.\n Mind you, it isn’t the prettiest code either - but it’s good enough for me.\n The result is a  suggestion of newsletter content, formatted in a way I can work with.\n  This saves me a lot of time preparing the  syntax of the newsletter, as it’s all written in Markdown. Pocket also has a decent  summary of each article, that I only have to tweak slightly.\n  With the Pocket suggestion available in Markdown format, now begins the most time-intensive part: writing.\n While Pocket makes good suggestions for the description of  projects, it doesn’t quite work for items in the news- or tutorials section.\n At this point, I haven’t read every link yet (I bookmark  a lot, often just based on the title alone), about 50% gets thrown away in this step.\n This is the stage that takes me 2-3 hours. Half of it is spent typing, the other half is reading the articles.\n  This is a step that might seem a bit backwards, but it works for my workflow: once I have the web-version available, I will use that to generate a different version for the HTML and TXT view of the newsletter.\n The input for the conversion is the Markdown file that  hugo parses. It looks like this:\n ---title: &#39;cron.weekly issue  #131: Ubuntu 20.04, Moloch, eBPF, xsv, desed &amp; more&#39;author: mattiasdate: 2020-04-26T06:50:00+01:00publishDate: 2020-04-26T06:50:00+01:00url: /cronweekly/issue-131/---Hi everyone! 👋Welcome to cron.weekly issue  #131.Last week ...\n   It generates the TXT version ( -t flag) or the HTML version ( -h flag) and copies the output to my clipboard using  pbcopy on Mac.\n I’ve spent a considerable amount of time optimizing both views to look good in any e-mail client. The script above generates this HTML output:\n  Because the audience is  very technical, a surprising amount of users read it in  Mutt, a text-only client. They get this version delivered to them:\n  I tried experimenting with more ASCII art, but it renders differently on every client (since it uses your chosen font) so I dropped it altogether. Clean &amp; simple.\n    The web-version gets published automatically at the right time, using Hugo’s  publishDate variable and a cronjob on the server, that regenerates the site every hour.\n  The hourly cronjob runs at 5 minutes before the hour, so the newsletter is generated on time before the mailing goes out a few minutes later.\n  There are two important components to sending out the newsletter: the  client and the  MTA.\n  I use a PHP tool called  Mailcoach that lets me configure the newsletter, set the HTML and TXT body and send them to all subscribers.\n In order to collect new e-mail signups, I embed the Mailcoach form on this (static) website. The POST target of the form you see  on the cron.weekly archive pages points to Mailcoach, which then stores the e-mail addresses and verifies the double opt-in.\n   The web version of Mailcoach allows me to see previous campaigns, monitor the list growth etc.\n  I  strongly believe in  no-tracking, so there are no open- or click-rates to be shown here. Mailcoach supports that, but I don’t want to track users. 😄\n I switched from  using Sendy to Mailcoach because it allows me to easily extend it, which comes in handy a bit further down.\n  Mailcoach, just like Sendy, can send the e-mails using Amazon SES, Mailgun, Sendmail, … Since I recently got  kicked off Amazon SES for getting too many bounces after  I restarted the newsletter (which was my own fault), I switched to using  Mailgun instead.\n They’re pretty fast, the newsletter gets sent out in just under 10 minutes to about 10.000 subscribers.\n I recently upgraded the Mailgun plan to the  Growth plan for $80/month, which gives me longer log retention and a fixed IP address.\n Since I’m now paying for Mailgun, I’ve been switching all my projects over one-by-one, including the outgoing e-mail from Gmail (a step-by-step plan to moving away from Google products, but that’s for another time).\n  A few weeks ago, I extended the Mailcoach app with  Laravel Nova that gives me a useful admin-section straight out of the box.\n  I wrote some extra code to parse the latest newsletter (the TXT version), extract all the links and my comments on them and then randomly takes 20 links to share out on Twitter spread over the next week.\n This step is mostly fully-automated. I sometimes tweak the copy a bit to make more sense in a Tweet. They are all suffixed with  #CronWeekly, so users can mute these if they  follow me and don’t want to see the newsletter repeated to them on their timeline.\n    Lots of layers building on top of other layers, modifying the content in every step of the way. It’s a bit like a complex Unix pipeline, isn’t it?\n  And once that’s done, the whole process starts again: collect new links, curate them, send them out. 😄\n I regretted the weekly deadline a few years ago when  I needed a break and was near burn-out, but now that I’ve  quit my full-time job to focus on  Oh Dear,  DNS Spy and  the newsletter I find it a lot more enjoyable again.\n Now that the user base is large enough, I can  add sponsorships that help pay the bills.\n If you have any other questions about running a newsletter or the business behind it, feel free  to reach out!", "posttime": "2020-05-02 18:04:22", "tags": "撰写,curate,newsletter", "title": "我是如何撰写和策划这份周刊的。", "title_en": "How I write and curate the cron.weekly newsletter", "transed": 0, "url": "https://ma.ttias.be/how-to-cron-weekly-newsletter/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["撰写", "curate"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000284, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员共同工作的家园。加入他们，发展您自己的开发团队，管理权限，并在项目中进行协作。\n报名", "note_en": "GitHub is home to over 50 million developers working together. Join them to grow your own development teams, manage permissions, and collaborate on projects.\n  Sign up", "posttime": "2020-05-02 18:04:20", "tags": "webrtc,cross,发展,developers", "title": "适用于WebRTC的现代跨平台堆栈", "title_en": "Modern and Cross Platform Stack for WebRTC", "transed": 0, "url": "https://github.com/pion", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["webrtc", "cross", "发展"]}, {"category": "", "categoryclass": "", "imagename": "bab7a3b5d4801f38ff113c8412fc0b64.jpeg", "infoid": 1000283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我要告诉你一个秘密：我发现12个月令人困惑。Duodecimos，给这种格式起了正式的拉丁文名称，为了工作，必须被剪切和折叠，更诚实地说，我几乎不能理解刚刚折叠的强加。这就是为什么我总是推荐折叠您自己的格式以理解它们的强加的原因。我们中的一些人可以在头脑中掌握空间中的形状，而我们中的一些人需要将这些东西拿在手中才能看到它们。\n{简而言之：如果您还不熟悉格式(纸张和纸张之间的关系)和拼版(页面如何在表单中排版)的基本概念，那么这份新闻稿将会令人困惑。对不起。如果您手头有我的书，请通读一下第2部分中关于格式的部分，然后回来时准备好对这种荒唐的行为嗤之以鼻。}。\n一对开本，你只需横向折叠一次，你就可以了！再折一次，你就有一个四分音符了。再说一次，这是一辆八度；再一次，是十六辆。(像许多其他书目编写者一样，我倾向于在duodecimo/twilvemo附近从拉丁名切换到英语化名。)。\n用12mo的话，你需要剪掉一条带子，这样才能按顺序得到12片叶子。以下是菲利普·加斯克尔在他的“新目录学导论”中如何展示常见的12mo的内部形式的强加：\n同样，如果你从字面上抓住它，可能会更容易理解正在发生的事情：4的条状折叠并插入到8片叶子的折叠组的中间-4加8等于12！正如你可能很快看到的那样，你也可以在八人组之后加上四人组，但这有点尴尬，因为实际上没有什么东西能把聚会维持在一起，而且你在缝纫时必须小心不要把松散的部分放错了地方。如果是那样的话，那就是……。\n但是，还有另一种选择，这是我在阅读格式图表时知道的，但我并没有仔细考虑过，直到我在Folger遇到了这个可爱的小家伙：\n这个小12mo印刷于1604年。第一件让它很棒的事情是，它仍然有一部分是原来的蓝色包装纸-你可以看到它就挂在那里，前面的刺缝下，整个包装纸都在后面。虽然包装纸被撕掉了一部分可能会让人难过，但这也意味着我们可以从组成这本书的三个聚会的脊梁上看到美丽的景色：\n我很喜欢那些向我们展示他们胆量的书。另一件让这本书有趣的事情是，在B和C聚会中，一些页面仍然没有打开。下面看一下B集合中的最后四个叶子，说明我的意思：叶子B9和10与叶子B11和B12是共轭的(即，作为同一张纸的一部分连接在一起)。\n你不会经常看到这种情况，因为，当然，如果有人真的想要阅读这些叶子上的文字，他们就必须把它们切开。\n这就是我跌跌撞撞的地方。我想这是12个月，因为每次采集都有12片叶子，而且链条是水平排列的。但是它是如何强加的，使得最后四片叶子看起来像这样呢？在普通的12mo拼版中，叶7和8，9和12在前缘连接，10和11连接。(等一下，你还不配合吗？有了纸，理解这件事就容易多了。)。如果是8和4，那么你会看到5：8，6：7和11：12在……相接。\n那么这里到底是怎么回事呢？这是一个倒置的12mo，盖斯凯尔描述说，这是我以前专注于英文书时从未遇到过的东西，因为这显然是一种主要是意大利人的做事方式。它是这样运作的：\n基本上(因为谁会看图表，这就是为什么你一边看书一边折叠，对吧？)。四个人的带子对折，然后包裹在八个人的小组周围。\n这听起来可能很明显，但这就是我如何理解这本书的：我打开盖斯克尔，看看他有各种12mo选项：长的、普通的、8和4的，然后我看到了倒置的。和…。。嗯，老实说，对我来说这就是事情变得模糊的地方。我坐在福尔格阅览室，看到一张看起来可以工作的图表，试着在脑海中想象它，用冷光寻找水印，然后说：“啊哈！！”然后高高兴兴地回家了。我想过去在哪里..。\n所以刚才，当我试着为你们所有人画一张图来确认的时候，我基本上又把自己搞糊涂了，不得不--是的，你们猜对了--拿出一张纸给自己折起来。既然我一直在喋喋不休，下面就是我如何为自己创建纸质模型来理解强迫行为的方法。如果我幸运地有一张我怀疑是我正在看的图表，我会从沿着这些线折叠一张纸开始，在签名标记和……上都打上记号。\n下一步是调整它，使其与我在实际手头的书中看到的相匹配。在这种情况下，我想要", "note_en": "I’m going to let you in on a secret: I find 12mos confusing. Duodecimos, to give the format its formal Latin name, have to be cut and folded in order to work, and to be even more honest, I can barely get my head around impositions that are just folding. This, for what it’s worth, is why I always always always recommend folding your own formats to understand their impositions. Some of us can hold shapes in space in our heads, and some of us need to hold those things in our hands to see them.\n {A brief aside: If you aren’t already familiar with the basic concepts of format (the relationship between leaves and sheet) and imposition (how pages are laid out in a forme) then this newsletter is going to be confusing. I’m sorry. If you have my book at hand, go read through the section on format in Part 2, and then come back prepared to chuckle at this ridiculousness.}\n A folio you fold widthwise once, and there you go! Fold it again and you’ve got a quarto. One more time, it’s an octavo; again, a sixteenmo. (I, like many other bibliographers, tend to switch from the latinate names to the anglicized ones right around duodecimo/twelvemo.)\n With a 12mo, you need to cut off a strip in order to get twelve leaves in sequence. Here’s how Philip Gaskell shows the imposition of the inner forme of the common 12mo in his  A New Introduction to Bibliography:\n   Again, it might be easier to grasp what ’s happening if you literally grasp it: the strip of four is folded and inserted in the middle of the folded group of eight leaves —and four plus eight is twelve! You could, as you probably quickly saw, also add the group of four after the group of eight, but that ’s a bit awkward, since there ’s nothing actually holding the gathering together, and you ’d have to be careful not to misplace the loose section when you were sewing. In that case, it ’d be  ...\n But there’s another option, too, that I knew of from reading format diagrams but I hadn’t really thought about closely until I encountered this sweet little fellow at the Folger:\n   This little 12mo was printed in 1604. The first thing that makes it great is that it’s still partially in its original blue wrapper—you can see it just hanging on there under the stab stitching on the front and the full wrapper is present on the back. While it might be sad that the wrapper has been partially torn off, it also means that we can get a beautiful view from the spine of the three gatherings that make up this book:\n   I’m a sucker for books that show us their guts. The other thing that makes this book fun is that some of the pages are still unopened in the B and C gatherings. Here’s a look at the last four leaves in the B gathering showing what I mean: leaves B9 and 10 are conjugate (that is, connected as part of the same sheet) as are leaves B11 and B12.\n   You don’t see this too often because, of course, if someone were to actually have wanted to read the text on those leaves, they would have had to cut them open.\n So here ’s where I stumbled. I figured this was a 12mo because each gathering had 12 leaves and the chain lines ran horizontally. But how was it imposed so that the last four leaves would look like this? In the common 12mo imposition, leaves 7 and 8, 9 and 12 are joined at the fore-edge and 10 and 11 joined. (Wait, are you still not folding along? It ’s so much easier to make sense of this with paper in hand.) If it was done as an 8 and 4, then you ’d see 5:8, 6:7, and 11:12 joined at  ...\n So what is going on here? It’s an inverted 12mo, something that Gaskell describes that I hadn’t run across before when I was focusing on English books because it’s apparently a primarily Italian way of doing things. Here’s how it works:\n   Basically (because who can read diagrams, which is why you are folding this as you are reading, right??) the strip of four is folded in half and then wrapped around the group of eight.\n That might sound pretty obvious, but this is how I worked out what the book was doing: I opened up Gaskell and looked at the various 12mo options he had: long, common, 8-and-4, and then I saw inverted. And …. well, to be honest, this is where things get fuzzy for me. I sat in the Folger reading room and saw a diagram that looked like it could work, tried to imagine it in my head, got a cold light to look for watermarks, and then said, “Aha!! ”and went home happy. I think where past  ...\n So just now, when I tried to confirm that by drawing a diagram for you all, I basically got myself all confused again and had to —yes, you guessed it —get a piece of paper out and fold it for myself. Since I keep harping on it, here ’s how I go about creating paper models for myself to understand imposition. If I ’m lucky to have a diagram that I suspect is of what I ’m looking at, I start with folding a piece of paper along those lines, marking up both the signature marks and the  ...\n   The next step is to adjust it to match what I’m seeing in an actual book-in-hand. In this case, I want to have the conjoined leaves at the end of the gathering, not the start, so I have to reverse how the strip of four is folded. So I refold and renumber:\n   Satisfied that it works, I then go over it with colored ink to differentiate between pagination and signature marks. I often bracket off the signed marks from the unsigned and when I’m being really careful about all this, I use a sheet on which I’ve drawn a watermark. I was not that obsessive this time. ¯\\_(ツ)_/¯\n But as you can see from this picture, my model does get the conjoined leaves at the end of the gathering, where they are in the  Apologie’s B and C gatherings:\n   Cool! But do you see what problem still remains? In addition to 9:10 and 11:12 being conjugate, I have 7:8 joined as well. And they are clearly not in the book itself.\n So what happened? How did both the B and C gatherings have 7:8 opened but not the other fore-edges? (All of the top conjugates are opened, but it seems less weird to me that those could have been split while the fore-edge left untouched.) If I start offering paid subscriptions to  Early Printed Fun, paid subscribers would be able to leave comments on these letters, which could be fun. As it is now, you can maybe email me ( sarah@earlyprintedbooks.com) with your thoughts or  ...\n Even though I haven’t solved this problem, I’m going to add my model of the inverted 12mo to my stack of paper models of impositions. I hope it encourages you not to be embarrassed by making your own models. Hands on learning is the best learning!\n   When it came to think about what imposition schemes to include in my book, I went with as few as possible, on the principle that mine was a book for beginners and so I could just direct folks to Gaskell and his many diagrams. And so I went with the common 12mo and the 8-and-4. Alas, I am sorry now I didn ’t include the inverted 12mo since I am obsessed with how tidy and fool-proof it is. (In the common imposition, you could mis-fold the strip of four pretty easily, or  ...\n The other, more horrifying thing that I ’m sorry about is that the diagram I included of the common 12mo is actually wrong. I mean, it ’s wrong! In a published book! If you look up my diagram and compare it to Gaskell ’s —or even just try to fold it as is —you ’ll see that I swapped the 2nd and 4th leaves and the 9th and 11th leaves. It folds super awkwardly because of that, and I can ’t imagine anyone would ever have printed that way. I don ’t know why I made that mistake,  ...\n But this is why you are looking at Gaskell’s drawing of the inner form of the common and inverted 12mos rather than diagrams from my book. I guess I have another item to add to my  errata list.\n One last note: the book we’ve been looking at isn’t in the Folger’s online catalog, but the call number is DC122.9 B4 A7 Cage. Here’s a pretty picture of the card itself instead of a link:\n   I owe a big thanks to my friend Andras for calling this book to my attention many years ago. It really is a delightful object.\n   I didn ’t manage to hit my every-other-week goal with this letter. Maybe that ’s too frequent of a schedule? I don ’t think so —I just kind of ran into some personal exhaustion and a whole bunch of exciting ideas to write about that, part way through, had me realize I had to trudge back to the library to see books in person. Sorry for that. But at least now I know you ’ll be so busy making paper models that you won ’t even notice how long it ’s been since the last  ...\n In the meantime, mind your p’s and q’s—and your Gaskell!", "posttime": "2020-05-02 18:04:15", "tags": "mos,折叠,book", "title": "12个月太多了", "title_en": "Too Many 12mos", "transed": 0, "url": "https://sarahwerner.substack.com/p/too-many-12mos", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["mos", "折叠", "book"]}]