[{"category": "", "categoryclass": "", "imagename": "452051f859ec332a3b70c906345db77f.jpg", "infoid": 1017612, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "珍妮·凯西(Jeanne Casey)是MetaProp投资团队的负责人，她在MetaProp领导新投资进入引人注目的Proptech公司，并与投资组合公司密切合作，实施战略增长计划。\n这个人满为患的会议室，至少比任何消防局局长建议的人数多了5人，堆满了可笑的高得可笑的文件和各式各样的廉价钢笔。当我接近第三个小时的尾声和我第七支笔的墨水时，我意识到抵押贷款结账过程可能有点过时了。\n在我的第一套房子接近尾声后，对我来说，生活中其他所有的支出都已经数字化对我来说是不可想象的，但我所做过的最重要的购买需要数百个签名和几张亲笔递交的手写支票。相比之下，我只能通过在线门户网站偿还与首付规模相当的学生贷款。\n新冠肺炎疫情几乎改变了我们生活的方方面面。房地产世界的一线潜在希望可能是对抵押贷款关闭过程的强制清算。像电子关闭这样的技术进步正在加速这一艰难的进程，进入数字时代。美国人口普查局7月份发布的数据显示，由于大流行刺激了对城市地区以外的独栋住宅的需求，全国范围内的住房拥有率有所上升。2020年第二季度抵押贷款申请大幅增加证实了这一点。\n抵押贷款发放过程数字化的第一批迹象出现在2010年年中，当时贷款人开始采用数字披露。尽管有技术可用，但市场完全接受数字结算的速度一直较慢，这使得整个贷款方案能够以电子方式审查、记录、签署和公证。真正的电子结账包括数字期票(“电子票据”)、虚拟结账预约以及县级电子文件转让和记录，所有这些都可以由参与各方远程协调和执行。近年来，市场开始加快步伐，我们已经看到，从2018年到2019年，电子抵押贷款的数量增长了450%以上。", "note_en": "Jeanne Casey is a principal on the investment team at MetaProp, where she leads new investments into compelling proptech companies and works closely with portfolio companies on strategic growth initiatives.\n  The overcrowded conference room, with at least five more people than any fire marshal would recommend, was stacked comically high with paperwork and an eclectic collection of cheap pens. As I neared the end of the third hour and the ink of my seventh pen, I realized the mortgage closing process may be somewhat antiquated.\n After closing on my first home, it was inconceivable to me that every other expense in my life has gone digital, but the most significant purchase I’ve ever made required hundreds of signatures and several handwritten checks delivered in person. By comparison, I have been able to repay my student loans, comparable in magnitude to a down payment, exclusively through online portals.\n  The COVID-19 pandemic has changed nearly every facet of our lives. One potential silver lining for the real estate world may be a forced reckoning with the mortgage closing process. Technological advances like  e-closings are accelerating this arduous process into the digital age. The  U.S. Census Bureau released figures in July citing the rise in homeownership across the country as the pandemic fuels the demand for single-family properties outside of urban areas. This is confirmed by the significant spike in mortgage applications seen in the second quarter of 2020.\n The first signs of digitization of the mortgage origination process were seen in mid-2010 when lenders began adopting digital disclosures. Despite the availability of technology, the market has been slower to fully embrace digital closings that enable the full loan package to be electronically reviewed, recorded, signed and notarized. A true e-closing includes a digital promissory note (“eNote”), a virtual closing appointment and the electronic transfer and recording of documents by the county, all of which can be remotely coordinated and executed by the parties involved. The market started to pick up pace in recent years, and we’ve seen the number  of e-mortgages increase by more than 450% from 2018 to 2019.", "posttime": "2020-08-12 03:19:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "用笔,required,数字", "title": "\n无需用笔：房地产成交的数字未来", "title_en": "\n\t\t\t\tNo pen required: The digital future of real estate closings\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/11/no-pen-required-the-digital-future-of-real-estate-closings/", "via": "", "real_tags": ["用笔", "required", "数字"]}, {"category": "", "categoryclass": "", "imagename": "86eb4329139b1d752e4dca3e10f5f13f.jpg", "infoid": 1017611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Z2R采用了银弹般的极简主义设计，几乎完全由碳纤维制成，重量不到同类飞机的一半，让它像子弹一样起飞，很容易操作，同时充电还可以行驶100英里-你可以在一个小时左右的时间里把“油箱”加满5美元。\n在等另一只鞋掉下来吗？嗯，这可不便宜。但话说回来，很少有船是这样的。\n与该公司同名的Piotr Zin在宝马(BMW)、通用汽车(GM)和其他大公司从事工业设计期间，已经设计赛艇20年了。在西雅图联合湖上的一艘游艇上安顿下来后不久，他意识到他一生享受的水道可能对下一代来说已经不存在了。\n(披露：Zin实际上搬到了我母亲的隔壁，我在拜访她的时候碰巧发现他正在做这件事。)。\n他告诉我说：“我之所以开始做电船，是因为我有一个孩子，我曾有过一次来到耶稣的时刻。”“我意识到：如果我们不亲自做些事情来改善我们生活的水的质量，那么当我的孩子到我这个年纪的时候，水就不会存在了。”\n传统的燃气船在很大程度上是遥远过去的产物，就像开着一辆70年代的汽车半潜水一样。令人惊讶的是，电船也同样陈旧。就像电动汽车一样，它们在20世纪初曾短暂流行过。同样，直到最近，它们才被认为是“真正”划船的可行之选。\n就像大多数事情一样，这归结于物理：“与移动汽车相比，移动一艘船所需的功率绝对是巨大的，”Zin解释说。“这就像一直全速开一档车一样。”\n这一水平的吸引将电动游艇限制在水上相当于高尔夫球车-事实上，手推车和一些更受欢迎的老式电动游艇共享许多部件。如果你坐过一辆，那可能是一辆达菲(Duffy)，自60年代以来，它就一直在制作以3-4节的速度在湖泊周围晃动的模型。非常令人愉快，但并不完全令人兴奋。\n改变一切的是锂离子电池密度的增加和成本的下降。Z2R使用与定制Torqueedo发动机配对的宝马电池，在巡航速度(比如15节)下可以行驶100英里或更远。它可以用任何东西充电，从普通的墙上插头到大多数码头都有的高安培充电电缆(在这种情况下，当你吃三明治的时候，它会在油箱里再加50英里)。考虑到传统船只的燃油效率和不断上涨的船用汽油价格，使用电动可能每年为船主节省数千美元。\n“最高时速超过30节，”Zin指出。“我们把这艘船测试到55度，但决定不卖给人。这简直是疯了。“。\n我自己也坐过它，我可以证实，Z2R确实是以一种平底的方式跳出了底线，再加上它近乎安静，似乎是不可能的。就像特斯拉的消费轿车与兰博基尼在0-60倍的时间内竞争一样，来自特斯拉的瞬时反应几乎是可怕的。\n“这艘船是围绕电池设计的。使用电力系统的独特之处在于我们可以把马达放在我们想要的任何地方，“Zin说。与大多数快艇相比，平放在底部，重心降低，重量分布均匀。“你可以看到很多传统的船型，它们几乎把所有的东西都塞进了船尾。然后当你放下锤子的时候，你在五秒钟内什么也看不见。在这艘船上，没有船头升起--它是平放的。“。\n如此水平意味着几乎没有倾覆它的风险，或者许多其他故障模式是由于在速度上行为不当的不平衡设计造成的。操作简单，性能惊人，似乎是电动车的家常便饭。\nZin为自己从头开始设计这艘船而感到自豪，他使用高性能的流体动力学软件和比例模型来计算船体的形状。\n“造船是一项非常传统的行业。大多数建筑商关注的不是创新，而是‘我们就是这样做的’。“Zin说。“但是能够使用这些工具有一个巨大的优势。就在过去几年里，我们在视频卡上拥有的计算能力，主要是因为游戏行业，已经把可能的东西推得越来越远。“。\n以前，大型计算流体力学套件会让用户提交他们的参数，并以每个数据点X000美元的价格挑选几个里程碑式的速度-10节、20节等等。水对船的反应方式将按这些速度计算，并对介于这些速度之间的速度进行外推。但随着计算能力的提高，这不再是必要的，因为Zin最终向一家商业CFD软件提供商证明了这一点，当时他使用单独的计算堆栈以所有速度和高清晰度连续计算水的行为。\n“现在你可以让船(在模拟中)以任何你想要的速度运行，并看到水喷射的方式，包括小水滴。然后你可以调整船体的形状，以确保那些水滴不会击中乘客。“他说。“这并不完全是大多数造船设计师的做法。因此，利用没有真正发挥其全部潜力的高端软件是令人惊叹的。\n几乎所有东西都是用碳纤维建造的(这本身就是一场磨难)，整艘船的重量约为1700磅-通常一艘20英尺长的船会是这个数字的两倍或更多。这对于确保船能行驶很长距离至关重要；如果有什么不同的话，那就是航程焦虑是水上比公路上更大的问题。当然，这意味着它又快又容易控制。\n然而，这艘船几乎没有尖叫的速度。大型开放式驾驶舱平坦而宽敞，只有一个方向盘、油门和屏幕，屏幕上有友好的距离、媒体控制、GPS等读数。没有震动或发动机轰鸣声。没有像条纹或线条这样的美学选择表明它的爆炸性表现。木质单板(为了减轻重量-它被调到扬声器以提供更好的声音)地板和奶油皮革室内装潢让它感觉更像一辆漂浮的梅赛德斯。\n这不是意外。Zin的第一批客户是那些买得起25万美元左右的船的人。他将其与特斯拉的Roadster相提并论：这是一款针对高端市场的炫耀车型，将为更实用的车型提供资金并证明其需求-Zin已经在设计一款开弓招标车型，价格将高达17.5万美元。\n目标消费者是有钱又有生态意识的人--无论是他们自己的，还是出于需要。\n“有很多来自欧洲的问询，那里的环境限制比北美更严格。但我们也有一些纯净的湖泊，电力供应只是为了保持它们的清洁，“Zin解释说。“所以，如果你住在蒙大拿州的一个只有电动的湖上，你可以选择以5节的速度行驶，你甚至不能过湖，因为船太慢了，…。或者你可以有一艘功能齐全的汽艇，你可以在它后面滑水，速度和你乘坐燃气动力船的速度一样，但它绝对是零排放的。我的意思是，这艘船是最干净的，没有油，没有汽油，没有任何会掉进水里的东西。“。\n这真的让我想知道为什么几年前整个行业都不使用电动汽车。事实上，有几个竞争者，但他们往往是更小众或零碎的工作，将电动发动机与现有的船体配对，并说这是一艘时速50节的电动船。确实是这样--持续了5到10分钟。或者，也有定制的造船商，他们会为Zin类型的客户创造一些相当不错的东西-前往蒙特卡洛，以数百万美元的价格在拍卖会上买一艘。\nZin认为他的船是第一个检查每一个箱子和几个以前没有的箱子的船。速度和汽艇一样快，但几乎是安静的；航程相同，但到达那里的价格只是它的一小部分；操控起来像做梦一样，但几乎不需要维护。它和最智能的汽车一样聪明，根据航道限制车速，自动调整自身以保持在安全港口或充电器的范围内，并通过空中对世界任何地方的软件进行更新。我甚至没有得到任何改变来询问它的自动驾驶能力。\n作为一家硬件公司的第一次创始人，也是一名技术人员，Zin有很多工作要做。他已经筹集了种子资金来准备好原型和生产模型，但需要资金来更快地开始满足他现有的订单。像许多其他初创公司一样，当大流行来袭时，他正准备全力以赴，完全关闭了生产。但他们正准备重新开始生产。\n“我意识到不再有船公司这样的东西了，”Zin说。“我们做的一部分工作是建造一个容纳一切的贝壳，它恰好在水中移动，这使它成为一艘船，但这确实是船的一部分结束了。它真的是一个科技中心，我的公司不只是一家船公司，它必须是一家科技公司。“。\n他说，他的投资者明白，这不是一个一次性的玩具，而是一个极其有价值的知识产权的开始-嗯，随着特斯拉的成功，宣传会自动展开。\n“我们不只是有这样的计划，只是制造一艘非常快的船，”Zin总结道。“我们现在知道我们想用这项技术做什么，我们知道我们在24个月和48个月后要用这项技术做什么，我希望我能向你们展示一些这样的东西。这很艰难，我们今年需要生存下来，但这只是个开始。“", "note_en": "With a minimalist design like a silver bullet, built almost entirely from carbon fiber, the 20-foot Z2R is less than half the weight of comparable craft, letting it take off like a shot and handle easily, while also traveling a hundred miles on a charge — and you can fill the “tank” for about five bucks in an hour or so.\n Waiting for the other shoe to drop? Well, it ain’t cheap. But then, few boats are.\n  Piotr Zin, the company’s namesake, has been designing racing sailboats for 20 years, while working in industrial design at BMW, GM, and other major companies. Soon after settling down on a houseboat on Seattle’s Lake Union, he realized that the waterways he had enjoyed his whole life might not exist for the next generation.\n (Disclosure: Zin actually moved in next door to my mother, and I happened to find out he was working on this while visiting her.)\n “The reason I started working on electric boats specifically is because I had a kid, and I had a come to Jesus moment,” he told me. “I realized: If we’re not going to do something  personally about the quality of the water we live in, it’s not going to be here when my kid is my age.”\n  Traditional gas-powered boats are very much a product of the distant past, like running a ’70s-era car half underwater. Surprisingly, electric boats are  equally old. Like electric cars, they enjoyed a brief vogue in the early 20th century. And likewise they were never considered viable for “real” boating until quite recently.\n  Like most things, it comes down to physics: “The power required to move a boat, versus the power to move a car, is absolutely enormous,” Zin explained. “It’s like driving a car in first gear at full throttle all the time.”\n That level of draw limited electric boats to being the aquatic equivalent of golf carts — in fact, carts and some of the more popular old-school electric boats share many components. If you’ve ridden in one, it was probably a Duffy, which has made models for puttering around lakes at 3-4 knots since the ’60s. Perfectly pleasant, but not exactly thrilling.\n What changed everything was the increasing density and falling cost of lithium-ion batteries. The Z2R uses BMW batteries mated to a custom Torqueedo engine, and at cruising speeds (say 15 knots) can go a hundred miles or more. It recharges using anything from an ordinary wall plug to the high-amperage charging cables found at most marinas (in which case it will put another 50 miles in the tank while you eat a sandwich). Considering traditional boats’ fuel efficiency and the rising price of marine gas, going electric might save a boat owner thousands every year.\n  “The top speed is way over 30 knots,” Zin noted. “We tested this boat to 55, but decided not to sell that to people. It’s just insane.”\n Having ridden in it myself, I can confirm that the Z2R really jumps off the line in a level-bottomed way that, compounded by its near silence, seems impossible. Just as Tesla’s consumer sedans compete with Lamborghinis in 0-60 times, the instantaneous response from is almost frightening.\n “The boat was designed around the battery. The unique part of using an electric system is we can put the motor anywhere we want,” Zin said. By sitting it flat on the bottom, the center of gravity is lowered and weight distribution evened out compared to most speedboats. “You look at a lot of traditional boats’ builds, they kind of cram everything in the back. Then when you put the hammer down, you can’t see anything for five seconds. In this boat, there’s no bow rise — it sits flat.”\n  Being so level means there’s almost no risk of overturning it, or many of the other failure modes resulting from lopsided designs that misbehave at speed. Simplicity of operation and surprising performance seem to be a family characteristic of electric vehicles.\n  Zin is proud to have designed the boat himself from scratch, using both high performance fluid dynamics software and scale models to work out the shape of the hull.\n “Boat building is a very traditional business. Most builders aren’t about innovation, they’re about ‘this is how we do it.’ ” Zin said. “But there’s a huge advantage in being able to use these tools. The computing power that we have in video cards just in the last few years, mainly because of the gaming industry, has pushed what’s possible further and further.”\n Previously, large computational fluid dynamics suites would have users submit their parameters and pick a few milestone speeds at X thousand dollars per data point — 10 knots, 20 knots, etc. The way the water would react to the boat and vice versa would be calculated at those speeds and extrapolated for speeds in between. But with increases in computing power, that’s no longer necessary, as Zin ended up proving to a commercial CFD software provider when he used a separate compute stack to calculate the water’s behavior continuously at all speeds and in high definition.\n “Right now you can run the boat [in the simulation] at any speed you want and see the way the water will spray, including little droplets. And then you can tweak the shape of your hull to make sure those droplets don’t hit the passengers,” he said. “It’s not exactly the way most boat designers would do it. So utilizing high end software that was not really being given its full potential was amazing.”\n Building practically everything out of carbon fiber (an ordeal of its own) puts the whole boat at around 1,700 pounds — normally a 20-foot boat would be twice that or more. That’s crucial for making sure the boat can go long distances; Range anxiety is if anything a bigger problem on the water than on the road. And of course it means it’s quick and easy to control.\n  Yet the boat hardly screams speed. The large open cockpit is flat and spacious, with only a steering wheel, throttle, and screens with friendly readouts for range, media controls, GPS and so on. There’s no vibration or engine roar. No aesthetic choices like stripes or lines suggest its explosive performance. The wood veneer (to save weight — and it’s tuned to the speakers to provide better sound) floor and cream leather upholstery make it feel more like a floating Mercedes.\n That’s not an accident. Zin’s first customers are the type of people who can afford a boat that costs $250,000 or so. He compared it to Tesla’s Roadster: A showy vehicle aimed at the high end that will fund and prove out the demand for a more practical one — an open-bow tender model Zin is already designing that will cost more like $175,000.\n  The target consumer is one who has money and an eco-conscious outlook — either of their own or by necessity.\n “There are a lot of inquiries from Europe, where the environmental restrictions are stricter than in North America. But we also have a number of pristine lakes that are electric only for the purpose of keeping them clean,” Zin explained. “So if you live on a lake in Montana that’s electric only, you have the option to go at five knots, and you can’t even cross the lake because the boat is so slow… or you can have a fully functional powerboat that you can water ski behind, the same speeds you get in a gas power boat, but it’s absolutely emissions free. I mean, this boat is as clean as it gets — there’s zero oil, zero gasoline, zero anything that will get into the water.”\n It really made me wonder why the whole industry didn’t go electric years ago. And in fact there are  a few competitors, but they tend to be even more niche or piecemeal jobs, mating an electric engine to an existing hull and saying it’s an electric boat that goes 50 knots. And it does — for five or ten minutes. Or there are custom boat builders who will create something quite nice for a Zin-type customer —  head on over to Monte Carlo and buy one at auction for a couple million bucks.\n  Zin sees his boat as the first one to check every box and a few that weren’t there before. As fast as a powerboat but nearly silent; same range but a fraction of the price to get there; handles like a dream but requires practically no maintenance. It’s as smart as the smartest car, limiting its speed based on the waterway, automatically adjusting itself to stay within range of a safe harbor or charger, over-the-air updates to the software anywhere in the world. I didn’t even get a change to ask about its self-driving capabilities.\n As a first time founder, a technical one at that, of a hardware company, Zin has his work cut out for him. He’s raised seed money to get the prototype and production model ready, but needs capital to start filling his existing orders faster. Like many other startups, he was just gearing up to go all out when the pandemic struck, shutting down production completely. But they’re just about ready to start manufacturing again.\n  “I realized that there isn’t such a thing as a boat company any more,” said Zin. “Part of what we do is to build that shell that holds everything, and it happens to be moving through the water, which makes it a boat, but that really where the boating part of it ends. It’s really a technology hub, and my company is not just a boat company, it has to be a technology company.”\n He said that his investors understand that this isn’t a one-off toy but the beginnings of an incredibly valuable IP that — well, with Tesla’s success, the pitch writes itself.\n “We don’t only have a plan like, just make one really fast boat,” Zin concluded. “We know what we want to do with this technology right now, we know what we’re going to do with this technology in 24 months, and 48 months, I wish I could show you some of this stuff. It’s tough, and we need to survive this year, but this is just the start.”", "posttime": "2020-08-12 03:19:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,力争,boats,zin", "title": "\n津船重塑电动快艇力争成为海上特斯拉", "title_en": "\n\t\t\t\tZin Boats reinvents the electric speedboat in a bid to become the Tesla of the sea\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/11/zin-boats-reinvents-the-electric-speedboat-in-a-bid-to-become-the-tesla-of-the-sea/", "via": "", "real_tags": ["特斯拉", "力争", "boats", "zin"]}, {"category": "", "categoryclass": "", "imagename": "29a5218544fa1ea7ad3ca79a3e59afd7.jpg", "infoid": 1017610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软可能在玩弄收购Tik-Tok的想法，但比以往任何时候都更重要的是，它的基本业务是面向企业的基础云服务和服务器软件。\n说到并购，微软在收购方面相对活跃，但在最近结束的财年中也相当节俭。\n随着Netflix、Hulu和腾讯的首次加入，该公司的官方认可竞争对手名单正在增加。\n微软现在将限制竞争对手运营的市场(即苹果的App Store)视为其业务面临的重大风险。\n这些是我们从雷蒙德公司提交给美国证券交易委员会(Securities And Exchange Commission)的新Form 10-K文件中的一些内容，这是关于这家科技巨头的年度花絮宝库。除了阅读最新提交的文件外，我们还使用了Microsoft Word中的比较文档功能来帮助我们发现自去年提交文件以来的重大变化。\n今年最大的新增内容是关于新冠肺炎和该公司应对疫情的长篇文章，以及其种族正义、环境可持续性和数字技能倡议，在很大程度上重申了微软过去在这些方面的公开声明和公告。\n在业务方面，最值得注意的是一个部分，该部分将微软的收入细分为与其传统产品线相关的类别：Office、Windows、Xbox等。这与该公司的季度财务报告形成了鲜明对比。它们使用基础广泛且有些模棱两可的部门结构-生产力和业务流程、智能云和更个人化的计算-将不同的业务和产品混合在一起，这样就不会总是容易地按产品线辨别出明确的趋势。\n10-K文件中的替代类别显示出一个明确的趋势：微软的后端服务器产品和云服务正在蓬勃发展。在截至6月30日的财年中，服务器和云服务产品类别的收入增长了近27%，达到414亿美元。\n办公室和云服务收入是增长第二快的类别，占11%，全年收入达到353亿美元。Windows增长9%至223亿美元。\n备案文件显示，微软在2020财年进行了15笔收购，总金额为24亿美元。这一数字低于前一年总计90亿美元的20笔收购，其中包括以75亿美元收购GitHub。\n该公司有记录以来最大的一笔收购是在2016年12月，也就是微软2017财年，以262亿美元收购了LinkedIn。\n微软的官方竞争对手名单正在增加。看看该公司认为哪些竞争对手值得在申报文件中提及，以表明其业务的发展方向，这总是很有趣的。两年前，那是斯莱克。今年，它是Netflix，Hulu和腾讯。\n以下是关于该公司游戏和娱乐竞争的部分现在与这些新增内容一起阅读的方式。\nXbox Live和我们的云游戏服务面临着来自各种在线游戏生态系统和游戏流媒体服务的竞争，包括亚马逊、苹果、Facebook、谷歌和腾讯运营的游戏生态系统和游戏流媒体服务。我们还与Netflix和Hulu等其他娱乐服务提供商展开竞争。我们的游戏平台与任天堂(Nintendo)和索尼(Sony)的游戏机平台展开竞争，这两家公司都拥有庞大的既定客户基础。我们相信，我们的游戏平台基于硬件架构、用户界面、开发者工具、在线游戏和娱乐服务方面的重大创新，以及我们自己的第一方游戏特许经营和其他数字内容提供的持续强劲的独家内容，有效地定位于竞争对手的产品和服务，并与竞争产品和服务独一无二地区分开来。\n有趣的是，看到该公司的主要游戏机竞争对手任天堂(Nintendo)和索尼(Sony)几乎被降级为事后诸葛亮。值得注意的是，这在一定程度上表明，随着Xbox Series X游戏机将于今年晚些时候发布，微软继续将Xbox视为一个更广泛的娱乐平台。\n最后，这份文件反映了微软与运营该公司希望参与的在线市场的竞争对手之间日益紧张的关系。\n这一部分是全新的：“竞争对手管理他们的内容和应用市场的规则可能会限制我们根据我们的技术和商业模式目标通过他们分销产品和服务的能力。”\n微软与苹果在App Store限制方面存在分歧，微软表示，这些限制限制了微软在iOS上提供XCloud游戏服务的能力。\n这些是我们的主要收获。如果你想看一些轻松的读物，这是完整的档案。如果你发现我们遗漏了什么值得注意的东西，请告诉我们。\nGeekWire Space&amp；Science-获奖航空航天和科学编辑艾伦·博伊尔(Alan Boyle)每周头条", "note_en": "Microsoft  may be toying with the idea of buying Tik-Tok, but more than ever, its bread-and-butter is basic cloud services and server software for businesses.\n Speaking of M&amp;A, Microsoft was relatively active on the acquisition front but also pretty thrifty with its spending in its recently completed fiscal year.\n The company’s list of officially recognized competitors is growing, with the addition of Netflix, Hulu and Tencent for the first time.\n  And Microsoft now sees restrictions on marketplaces operated by competitors (i.e., Apple’s App Store) as a material risk to its business.\n Those are some of our takeaways from the Redmond company’s  new Form 10-K filing with the Securities and Exchange Commission, an annual treasure trove of tidbits about the tech giant. In addition to reading the latest filing, we used the Compare Documents feature in Microsoft Word to help us spot significant changes  since last year’s filing.\n The biggest additions this year are long passages about COVID-19 and the company’s response to the pandemic, plus its racial justice, environmental sustainability and digital skills initiatives, largely reiterating Microsoft’s past public statements and announcements on each of those fronts.\n Most notable on the business front is a section that breaks down Microsoft’s revenue into categories associated with its traditional product lines: Office, Windows, Xbox, etc. This is in contrast with the company’s quarterly financial reports. Those use a broad-based and somewhat ambiguous divisional structure — Productivity and Business Processes, Intelligent Cloud, and More Personal Computing — that mix different businesses and products in such a way that it’s not always easy to discern clear trends by product line.\n   The alternative categories in the 10-K filing show a clear trend: Microsoft’s back-end server products and cloud services are booming. Revenue grew by nearly 27% to $41.4 billion in the product category of Server and Cloud Services in the fiscal year ended June 30.\n Office and Cloud Services revenue was the second-fastest growing category, at 11%, reaching $35.3 billion in revenue for the year. Windows grew by 9% to $22.3 billion.\n Microsoft made 15 acquisitions for a total amount of $2.4 billion in its 2020 fiscal year, according to the filing. That was down from 20 acquisitions for a total of $9 billion the year before, which included the $7.5 billion acquisition of GitHub.\n   The company’s biggest acquisition on record was its $26.2 billion purchase of LinkedIn in December 2016, in Microsoft’s 2017 fiscal year.\n Microsoft’s official list of rivals is growing. It’s always interesting to see which competitors the company considers worthy of mentioning in the filing, as an indication of where its business is headed. Two years ago,  it was Slack. This year, it’s Netflix, Hulu and Tencent.\n Here’s how the section on the company’s gaming and entertainment competition now reads with those additions.\n Xbox Live and our cloud gaming services face competition from various online gaming ecosystems and game streaming services, including those operated by Amazon, Apple, Facebook, Google, and Tencent. We also compete with other providers of entertainment services such as Netflix and Hulu. Our gaming platform competes with console platforms from Nintendo and Sony, both of which have a large, established base of customers. We believe our gaming platform is effectively positioned against, and uniquely differentiated from, competitive products and services based on significant innovation in hardware architecture, user interface, developer tools, online gaming and entertainment services, and continued strong exclusive content from our own first-party game franchises as well as other digital content offerings.\n Interesting to see the company’s main console rivals, Nintendo and Sony, practically relegated to afterthoughts. This is notable in part as an indication that Microsoft continues to see Xbox as a broader entertainment platform, with the release of the  Xbox Series X console coming up later this year.\n And finally, the filing reflects the growing tension between Microsoft and competitors that operate online marketplaces in which the company wants to participate.\n This section is entirely new: “Competitors’ rules governing their content and applications marketplaces may restrict our ability to distribute products and services through them in accordance with our technical and business model objectives.”\n Microsoft  is at odds with Apple over App Store restrictions that Microsoft says restrict its ability to offer its xCloud gaming service on iOS.\n Those are our main takeaways. If you’re up for some light reading,  here’s the full filing. Let us know if you spot anything notable that we missed.\n      GeekWire Space &amp; Science - Weekly headlines from Alan Boyle, award-winning aerospace and science editor", "posttime": "2020-08-12 03:18:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,microsoft,微软,收购,total", "title": "提交的文件按产品线细分了微软的收入，显示它在2020财年进行了15次收购，总金额为24亿美元，低于前一年的90亿美元", "title_en": "Filing breaks down Microsoft's revenue by product line and shows it made 15 acquisitions for a total amount of $2.4B in FY'2020, down from $9B the previous year", "transed": 1, "url": "https://www.geekwire.com/2020/filing-shows-microsoft-really-making-money-reveals-m-adds-netflix-hulu-tencent-list-rivals/", "via": "", "real_tags": ["2020", "microsoft", "微软", "收购", "total"]}, {"category": "", "categoryclass": "", "imagename": "6f1501b9d7c015c491f0a1642f92eee4.jpeg", "infoid": 1017609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据LinkedIn的说法，Scribd将于9月24日接管SlideShare业务的运营。\nScribd首席执行官特里普·阿德勒(Trip Adler)认为，两家公司有着非常相似的根源，都是在2006/2007年间成立的，都有TechCrunch上的故事，而且都专注于内容和文档共享。\n阿德勒说：“这两款产品总是有类似的使命。”“不同的是，[SlideShare]更多地关注PowerPoint演示文稿和商业用户，而我们更多地关注PDF、Word文档和长篇书面内容，更多地关注更普通的消费者。”\n随着时间的推移，两家公司的分歧进一步扩大，SlideShare于2012年被LinkedIn收购，LinkedIn本身于2016年被微软收购。\n与此同时，Scribd推出了Netflix式的电子书和有声读物订阅服务，但阿德勒表示，“用户生成端”和“高端端”对业务仍然很重要。\n他说：“我们有来找文件的人，然后注册我们的优质内容。”“但他们也会继续阅读文件。”\n因此，当微软和LinkedIn就收购SlideShare的事宜与Scribd接洽时，阿德勒看到了扩大业务文档方面的机会。他特别指出，SlideShare的内容库有4000万个演示文稿，每月有1亿独立访问者。\n阿德勒说，这笔交易从根本上讲是为了利用SlideShare的“内容和受众”，不过他说，Scribd可能也会在该服务的技术方面进行整合。作为交易的一部分，Scribd不会招收任何新员工；相反，其现有团队将负责SlideShare的运营。\n他补充说，SlideShare将继续作为独立于Scribd的服务运营，他希望它能继续与LinkedIn很好地整合。\n“最初几个月什么都不会改变，”阿德勒说。“我们对这样的产品有很多经验，无论是技术堆栈，还是用户上传内容。我们处于有利地位，使幻灯片分享真正取得成功。“。\n与此同时，LinkedIn工程副总裁克里斯·普鲁特(Chris Pruett)发表声明，强调了该公司自收购以来在SlideShare上所做的工作：\nLinkedIn在2012年5月收购了SlideShare，当时人们越来越清楚地看到，专业人士使用LinkedIn不仅仅是为了建立专业联系。在过去的八年里，SlideShare团队、产品和社区帮助塑造了LinkedIn上的内容体验。我们加入了在LinkedIn上上传、共享和讨论文档的功能。", "note_en": "According to  LinkedIn,    Scribd   will take over operation of the SlideShare business on September 24.\n Scribd CEO Trip Adler argued that the companies have very similar roots, both launching in  2006/ 2007 with stories on TechCrunch, and both of them focused on content- and document-sharing.\n  “The two products always had kind of similar missions,” Adler said. “The difference was, [SlideShare] focused on more on PowerPoint presentations and business users, while we focused more on PDFs and Word docs and long-form written content, more on the more general consumer.”\n Over time, the companies diverged even further, with  SlideShare acquired by LinkedIn in 2012, and LinkedIn itself  acquired by Microsoft in 2016.\n Scribd, meanwhile, launching  a Netflix-style subscription service for e-books and audiobooks, but Adler said that both the “user-generated side” and the “premium side” remain important to the business.\n “We get people who come in looking for documents, then sign up for our premium content,” he said. “But they do continue to read documents, too.”\n So when  Microsoft   and LinkedIn approached Scribd about acquiring SlideShare, Adler saw an opportunity to expand the document side of the business. Specifically, he pointed to SlideShare’s content library of 40 million presentations and its audience of 100 million monthly unique visitors.\n The deal, Adler said, is fundamentally about tapping into SlideShare’s “content and audience,” though he said there may be aspects of the service’s technology that Scribd could incorporate as well. Scribd isn’t taking on any new employees as part of the deal; instead, its existing team is taking responsibility for SlideShare’s operation.\n He added that SlideShare will continue to operate as a standalone service, separate from Scribd, and that he’s hopeful that it will continue to be well-integrated with LinkedIn.\n “Nothing will change in the initial months,” Adler said. “We have a lot of experience with a product like this, both the technology stack and with users uploading content. We’re in a good position make slide share really successful.”\n Meanwhile, a statement from LinkedIn Vice President of Engineering Chris Pruett highlighted the work that the company has done on SlideShare since the acquisition:\n LinkedIn acquired SlideShare in May 2012 at a time when it was becoming clear that professionals were using LinkedIn for more than making professional connections. Over the last eight years, the SlideShare team, product, and community has helped shape the content experience on LinkedIn. We’ve incorporated the ability to upload, share, and discuss documents on LinkedIn.", "posttime": "2020-08-12 03:18:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "文稿,sold,slideshare", "title": "LinkedIn表示，已将演示文稿分享服务SlideShare出售给Scribd，Scribd将于9月24日接管其运营", "title_en": "LinkedIn says it has sold presentation-sharing service SlideShare to Scribd, which will take over its operation on September 24", "transed": 1, "url": "https://techcrunch.com/2020/08/11/scribd-acquires-slideshare/", "via": "", "real_tags": ["文稿", "sold"]}, {"category": "", "categoryclass": "", "imagename": "bff7567a1ac30e3b4dbed2728da3d889.jpeg", "infoid": 1017608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简而言之，我认为对于使用某些编程语言的人来说，使用来自互联网这个广阔的小丑世界的库已经变得太容易了。他们的生态系统使得依赖这些东西变得非常非常容易。问题是，这些库通常是💩的。如果它的某些部分损坏了，您可能无法对其进行编码，并且可能必须实际处理它们才能修复它。\n我有一个简单的规则：永远不要使用可以用一下午的编程来替换的依赖项。\n没有哪种依赖是不言而喻的，以至于您只需不到几个小时的时间就可以让它工作：\n你会有一些东西可以准确地解决你的问题，而不是一般的问题，所以它肯定更短，而且往往更快。\n很多时候，最好的方法是首先在线搜索并将代码读取到其他几个解决方案中，然后使用从了解它们如何工作中获得的知识编写您自己的解决方案。\n有一种观点认为，依赖关系可以解决错误，因此您不必这样做。这可能是对的，但也确实，一般解决方案会有许多您在特定解决方案中不关心的错误，因为编写一般程序要比编写特定程序困难得多。\n总之，任何可以在不到一个下午的时间内编写的代码都应该由您自己处理。\n在软件生态系统中有一个可预测的循环。UNIX、perl、windows、python、php/wordpress…。所有这些都遵循这样的模式：先是标准库很棒，然后是用户库的腾飞，然后是DLL地狱，最后是低质量的用户自制库泛滥。", "note_en": "In short, I think it’s become entirely too easy for people using certain programming languages to use libraries from the wide world of clowns that is the Internet. Their ecosystems make it very very easy to become reliant on this stuff. Trouble is, those libraries are frequently 💩. If something about it is broken, you might not be able to code around it, and may have to actually deal with them to get it fixed.\n I have a simple rule:  never use a dependency that you could replace with an afternoon of programming.\n  No dependency is so self-explanatory that you will be able to get it working with less than a few hours of:\n   You’ll have something that solves exactly your problem instead of a general problems, so it is certainly shorter and often faster.\n Many times, the best approach is first searching online and reading the code to a few other solutions, then writing your own with the knowledge you’ve gained from seeing how they work.\n There is an argument that dependencies solve bugs so you don’t have to. This can be true, but it’s also true that a general solution will have many bugs that you don’t care about in your specific solution because it is much harder to write a general program than a specific one.\n The long and the short of it is that any code that can be written in less than an afternoon should be handled yourself.\n  There’s a predictable cycle in software ecosystems. Unix, Perl, Windows, Python, PHP/Wordpress… All have followed a pattern where first the standard library is great, then user libraries take off, then there’s DLL hell, finally it’s overrun by low quality user-made libraries.", "posttime": "2020-08-12 03:17:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,下午,replace,依赖", "title": "切勿使用可以用一下午的编程时间替换的依赖项", "title_en": "Never use a dependency that you could replace with an afternoon of programming", "transed": 1, "url": "https://blog.carlmjohnson.net/post/2020/avoid-dependencies/", "via": "", "real_tags": ["编程", "下午", "replace", "依赖"]}, {"category": "", "categoryclass": "", "imagename": "2819ed6204ae19936d79fa7a7fad8f17.png", "infoid": 1017607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全套工程师(员工/负责人)", "note_en": "Full Stack Engineer (Staff / Principal)", "posttime": "2020-08-12 03:17:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "build,员工", "title": "BuildZoom(更好的定制房屋建造方式)正在聘请一名首席工程师", "title_en": "BuildZoom (better way to build custom homes) is hiring a principal engineer", "transed": 1, "url": "https://jobs.lever.co/buildzoom", "via": "", "real_tags": ["build", "员工"]}, {"category": "", "categoryclass": "", "imagename": "0f3ee747f762dd5c1f1d3cad80a43281.jpg", "infoid": 1017606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，在Dash 2020上，我们推出了Datadog平台上的新产品和功能，为工程团队提供了对其分布式应用和基础设施的更深层次的可见性。通过这些新增功能，Datadog进一步简化了发布周期的每个步骤，从CI/CD管道中的左移测试到生产中的代码评测。我们还推出了Datadog移动应用程序以简化随叫随到、合规性监控以增强云安全，并将Marketplace作为我们合作伙伴的协作平台。在这篇综合综述中了解更多关于这些发展的详细信息-以及我们在Dash会议上宣布的其他所有信息。\n借助Datadog事件管理，您的团队现在可以使用Datadog轻松创建事件，并从通知到解决和事后跟踪事件。新的事件UI提供了一个中心位置，用于报告和监视所有事件的状态。使用重要信息标记每个事件，如严重性、客户影响、事件指挥官和受影响的环境。事件的时间线自动反映任何新信息或状态更改，任何人都可以从Datadog内部添加额外的降价或交互式图形。事件还可以与其他新功能无缝协作，包括我们的移动应用程序(允许随叫随到的工程师在移动中对警报进行分类)，以及我们的增强型笔记本电脑(现在支持实时、多用户编辑，以便进行协作的事件后审查)。请在此处阅读我们的博客文章，了解有关Datadog如何帮助改进您的事件响应工作流程的更多信息。\nDatadog移动应用程序在这里！这款应用同时适用于iOS和Android设备，让随叫随到的工程师可以从任何地方即时访问您的Datadog仪表盘和警报。现在，当您被PagerDuty或OpsGenie等集成待命服务寻呼时，通知会包含一个指向相关应用内Datadog警报的链接，您将在其中看到最近环境活动的摘要以及即时上下文的交互式指标图。为了实现指标关联和更好地查看服务的运行状况，您可以访问所有仪表板的移动原生版本。您还可以查看警报周围的相关事件，以更全面地了解触发警报的原因，从而轻松快速地对问题的严重性进行分类并决定下一步行动-所有这些都不需要跳到您的笔记本电脑上。\n使用Datadog Security Monitoring，您可以实时检测环境中的潜在安全问题和威胁。为了帮助您更有效地调查这些问题及其产生的背景，我们引入了用于安全监控的开箱即用的调查仪表板。这些控制面板直观地显示了您的环境中按关键实体(如IP地址和用户)细分的安全趋势。它们还包括更丰富上下文的相关可观察性数据，例如与IP或用户相关的HTTP活动。使用这些控制面板可以一目了然地查看您的安全状况。如果您注意到异常情况(如与单个IP相关的多个安全信号)，您可以轻松地过滤仪表板以进一步深入了解该实体的行为。\n我们正在将威胁情报浓缩添加到数据日志安全监控中。威胁情报为接收的日志事件提供有价值的外部环境，因此您可以更快地对安全信号进行分类。威胁情报可识别特定的日志属性(例如，IP、文件哈希、URL等)。可能是恶意的，也可能是良性的，并提供了相关的理由。例如，如果Datadog检测到与潜在攻击关联的IP地址也在利用已知漏洞进行攻击，则Datadog会将产生的安全信号标记为恶意，以便您可以确定此调查的优先级。相反，如果已知IP是良性的，则它很可能是收集情报的扫描仪(例如shodan.io)，并且可以安全地忽略任何相关的安全信号，从而减少警报疲劳。Datadog维护并更新由可信提供商管理的威胁情报馈送，因此日志中包含最新且准确的上下文。\n早在4月，我们就发布了Datadog Security Monitoring，它可以让您实时检测和跟踪整个基础架构中的安全威胁，为开发、运营和安全团队提供保护您的环境所需的洞察力。现在，随着Datadog Compliance Monitoring的发布，我们将帮助您持续监控生产环境中的错误配置，并保持严格的行业标准和框架(如PCI DSS、SOC 2或CIS)的合规性。合规性监控会自动监控关键云资源的状态，例如您的安全组、存储桶和负载均衡器，以便在堆栈的每个级别检测潜在的配置错误和合规性违规。Datadog Agent现在检查您的服务器的本地配置，CON\n如果没有有意义的上下文，可能很难对错误进行故障排除。Datadog错误跟踪会智能地将错误分组为问题，因此您可以很容易地了解错误何时开始、受影响的代码版本以及可能导致错误的原因。错误跟踪使用源代码映射来消除前端JavaScript代码，通过向您显示要调查哪些行来缩短平均解决时间。错误跟踪包含在Datadog Real User Monitoring中，因此不需要安装SDK或修改代码。单击此处阅读有关错误跟踪的更多信息。\n与Web和后端开发人员一样，移动开发人员需要实时了解应用程序性能和用户体验。但是，移动应用程序运行在您的基础设施的边缘，这使得全面了解情况更具挑战性。Datadog Mobile Rum帮助移动开发人员驾驭这一复杂性并自信地部署应用程序。使用Mobile RUM，您可以分析任何应用程序版本、操作系统或设备的使用信息，并获得端到端可见性，以便调查错误和崩溃。由于Mobile Rum与Datadog APM紧密集成，团队可以快速了解问题是否源于应用程序、后端服务器或网络级别，并获得改善用户移动体验所需的洞察力。点击此处阅读更多关于莫比尔朗姆酒的信息。\nDatadog APM Live Search允许您在过去15分钟内按任意跨度上的任何标记搜索100%接收的跟踪。当用户浏览您的网站或移动应用程序时，跟踪会实时流传输，使您能够在停机或性能调查期间完全访问用户请求。在您将新版本的代码部署到生产环境时，向下过滤以跟踪匹配的基础架构、应用程序或自定义标记，并观察请求、错误和延迟百分位数的实时分析。\n有了新的Datadog Marketplace，Datadog合作伙伴现在可以将Datadog作为开发和协作平台来构建定制应用程序，包括第三方集成和监控工具，并将它们提供给他们的客户和整个Datadog社区。在严格的审查标准和全面管理的计费系统的支持下，该市场为我们的合作伙伴开辟了新的途径，以扩大其监控解决方案的范围，并向客户提供原创的集成。有关更多信息，请参阅我们的博客帖子。\n智能警报对于任何监控工作流都是必不可少的；在问题变得严重之前，警报会提醒您注意系统中的问题。但是，随着堆栈的增长和发展，并不总是清楚哪些监控数据是最重要的。现在，Datadog提供了推荐的监视器，这是一套预配置的、可自定义的警报查询和阈值，使客户只需单击一个按钮即可针对他们所依赖的技术制定监视最佳做法。推荐的显示器基于我们许多技术合作伙伴的专业知识，以及我们自己的经验和数千名客户的经验，因此您可以放心，您的系统中的问题不会不被检测到。推荐的显示器目前处于私人测试版。欲了解更多信息，请阅读我们的博客文章。\nBigPanda是一个数据分析平台，它从监控工具获取警报输入，并使用机器学习将它们关联起来，并执行自动根本原因分析。有了Datadog的新集成，您可以将Datadog警报发送给BigPanda，以便更快地显示模式并确定原因。设置集成后，Datadog会将您配置的所有Datadog警报转发给BigPanda进行处理。BigPanda将它们与您的其他应用程序数据相关联，以确定服务更改的原因。当BigPanda识别关联并创建事件时，它还会将事件推送回Datadog。\nDatadog客户现在可以使用Amazon Kinesis Data Firehose交付流将其AWS服务日志直接发送到Datadog。通过这一易于配置的流程，用户可以浏览和分析服务日志，以更深入地了解其AWS基础设施和应用程序的状态。从Kinesis Data Firehose流出的日志会自动包含关键的元数据，例如它们的来源，因此用户可以快速识别是哪项AWS服务生成了日志。通过无限制日志等功能，用户可以从所有日志中分析并生成指标，让他们在只存储所需日志的同时发现™服务中的趋势并发出警报。请在此处阅读有关如何入门的更多信息。\nDatadog现在与AWS无服务器应用模型(SAM)和AWS云开发工具包(CDK)集成，提供零检测无服务器可观察性。有了这些新的集成-以及我们现有的无服务器框架插件-团队可以使用他们选择的开发工具来简化他们构建、管理和排除无服务器应用程序故障的方式。Datadog的新CloudForformation宏自动摄取增强的Lamb\n在Dash 2020上，一个由领导者和开发人员组成的全球社区齐聚一堂，将他们的团队、基础设施和应用程序提升到下一个规模和速度水平。如果你错过了我们的虚拟活动，请继续关注我们主旨演讲和技术讲座的视频，了解Zillow、Nextdoor和Wayfair等公司是如何发展可观察性文化的。如果您是Datadog的新手，您现在可以注册免费试用14天，开始使用我们的所有最新功能和产品。", "note_en": "Today, at  Dash 2020, we unveiled new products and features on the Datadog platform that provide engineering teams with even deeper visibility into their distributed applications and infrastructure. With these additions, Datadog further streamlines every step of your release cycle, from shift-left testing in your CI/CD pipelines to profiling your code in production. We also launched the Datadog mobile app to make on-call easier, Compliance Monitoring for enhanced cloud security, and the Marketplace as a collaboration platform for our Partners. Get more details about these developments—and everything else we announced at Dash—in this comprehensive roundup.\n   With Datadog Incident Management, your teams can now use Datadog to easily create incidents and track them from notification to resolution and postmortem. The new Incidents UI provides a central place for reporting and monitoring the status of all your incidents. Tag each incident with important information like severity, customer impact, incident commander, and affected environments. An incident’s timeline automatically reflects any new information or status changes, and anybody can add additional markdown or interactive graphs from inside Datadog. Incidents also works seamlessly with other new features, including our  mobile app, which allows on-call engineers to triage alerts on the go, as well as our enhanced Notebooks, which now supports live, multi-user editing for collaborative post-incident reviews. Read our blog post  here for more information about how Datadog can help improve your incident response workflow.\n   The  Datadog mobile app is here! Available for both  iOS and  Android devices, the app provides on-call engineers with instant access to your Datadog dashboards and alerts from anywhere. Now, when you get paged by one of your integrated on-call services like  PagerDuty or  OpsGenie, the notification contains a link to the relevant in-app Datadog alert, where you’ll see a summary of recent environment activity along with interactive metric graphs for immediate context. For metric correlations and a better view of the health of your services, you can access mobile-native versions of all your dashboards. You can also view related events around the alert to get a fuller picture of why it was triggered, making it easy to quickly triage the problem’s severity and decide your next course of action—all without needing to hop on your laptop.\n    With Datadog Security Monitoring, you can detect potential security issues and threats to your environment in real time. To help you more effectively investigate these issues and the context in which they arise, we are introducing out-of-the-box investigation dashboards for Security Monitoring. These dashboards visualize security trends in your environment broken down by key entities, such as IP addresses and users. They also include correlated observability data for richer context, such as HTTP activity tied to an IP or user. Use these dashboards to review your security posture at a glance. If you notice an anomaly, like several Security Signals related to a single IP, you can easily filter the dashboard to drill down further into that entity’s behavior.\n   We are adding threat intelligence enrichment to Datadog Security Monitoring. Threat intelligence provides valuable external context to ingested log events so you can more quickly triage Security Signals. Threat intelligence identifies whether specific log attributes (e.g., IPs, file hashes, URLs, etc.) may be malicious or benign and provides an associated rationale. For example, if Datadog detects that an IP address associated with a potential attack has also been observed exploiting a known vulnerability, Datadog will flag the resulting Security Signal as malicious so you can prioritize this investigation. Conversely, if the IP is known to be benign, it is likely a scanner gathering intelligence (e.g., shodan.io), and any associated Security Signal can be safely ignored, reducing alert fatigue. Datadog maintains and updates threat intelligence feeds curated by trusted providers, so logs are enriched with up-to-date and accurate context.\n  Back in April, we announced Datadog  Security Monitoring, which lets you detect and track security threats across your infrastructure in real-time, giving development, operations, and security teams the insights they need to secure your environment. Now, with the release of Datadog Compliance Monitoring, we are helping you to continuously monitor production environments for misconfigurations and maintain compliance with rigorous industry standards and frameworks, such as PCI DSS, SOC 2, or CIS. Compliance Monitoring automatically watches the state of key cloud resources, such as your security groups, storage buckets, and load balancers, in order to detect potential misconfigurations and compliance violations across every level of your stack. The Datadog Agent now checks the local configuration of your servers, containers, and Kubernetes clusters. The Agent also actively monitors the filesystem of containerized environments to provide a production-ready file integrity monitoring (FIM) solution. Finally, with custom detection and compliance rules, users can expand the scope of their out-of-the-box detection capabilities without needing to learn a proprietary query language. Read our blog post  here and sign up for the beta  here.\n    Datadog Continuous Profiler allows you to analyze your application’s performance in production—down to single lines of code and with minimal overhead. Continuous Profiler collects multiple types of profiles (CPU, memory allocation, concurrent locks, I/O, and more) across your entire stack. Inspecting these profiles helps you identify and optimize the most resource-consuming methods in your application, allowing you to reduce end-user latency and cloud provider costs. It also automatically performs heuristic code analysis and shares actionable insights for performance improvements, so anyone on your team can quickly address main problem areas. Whether you’re releasing a new version, investigating an outage, or troubleshooting slow requests, Continuous Profiler helps you debug code-level performance issues across any scope, from a single request to a fleet of applications. Learn more about Continuous Profiler in our  blog post.\n   Datadog Synthetic tests are both robust and easy to create, which saves your team time and prevents alert fatigue. With Synthetic CI/CD Testing, you’re able to integrate your existing, production-level synthetic tests into your CI/CD pipeline in order to prevent bad merges, to automate rollbacks, and to run tests alongside canary deployments. This shift-left approach to testing can be achieved with both our flexible API endpoints and CLI, so you can seamlessly incorporate synthetic tests into the tooling you’ve already set up. Read our  blog post to learn more about Synthetic CI/CD Testing.\n   Errors can be difficult to troubleshoot without meaningful context. Datadog Error Tracking intelligently groups errors into issues, so you can easily understand when an error started, which versions of your code are impacted, and what may have caused it. Error Tracking uses source maps to unminify your frontend JavaScript code, reducing mean time to resolution by showing you which lines to investigate. Error Tracking is included with Datadog Real User Monitoring, so there is no need to install an SDK or modify your code. Read more about Error Tracking  here.\n   Like web and backend developers, mobile developers need real-time visibility into application performance and user experience. But mobile applications run at the edge of your infrastructure, making it more challenging to see the full picture. Datadog Mobile RUM helps mobile developers navigate this complexity and deploy applications with confidence. With Mobile RUM, you can analyze usage information across any app version, OS, or device—and get end-to-end visibility for investigating errors and crashes. Because Mobile RUM is tightly integrated with Datadog APM, teams can quickly understand if an issue originated at the level of the application, backend server, or network, and get the insights they need to improve their users’ mobile experience. Read more about Mobile RUM  here.\n   Datadog APM Live Search allows you to search 100 percent of ingested traces by any tag on any span over the last 15 minutes. Traces are streamed live as users navigate your website or mobile application, giving you complete access to user requests during an outage or performance investigation. Filter down to traces matching infrastructure, application, or custom tags and watch real-time analytics for requests, errors, and latency percentiles as you deploy a new version of code to production.\n    With the new Datadog Marketplace,  Datadog Partners can now use Datadog as a development and collaboration platform to build custom apps, including third-party integrations and monitoring tools, and offer them to their customers and the Datadog community at large. Backed by strict vetting standards and a fully managed billing system, the Marketplace opens up new ways for our Partners to increase the scope of their monitoring solutions and provide original integrations to customers. For more information, see our blog post  here.\n   Smart alerting is essential to any monitoring workflow; alerts draw your attention to problems in your system before they become critical. But as your stack grows and evolves, it’s not always clear which monitoring data is most important. Now, Datadog provides Recommended Monitors, a suite of preconfigured, customizable alert queries and thresholds that enable customers to enact monitoring best practices for the technologies they rely on with the click of a button. Recommended Monitors are based on the expertise of our many technology partners, as well as our own experience and the experience of thousands of customers, so you can trust that problems in your system will not go undetected. Recommended Monitors are currently in private beta. For more information, read our blog post  here.\n   BigPanda is a data analysis platform that takes alert input from monitoring tools and uses machine learning to correlate them and perform automatic root cause analysis. With Datadog’s new integration, you can send your Datadog alerts to BigPanda in order to surface patterns and identify the cause more quickly. After setting up the integration, Datadog will forward all your configured Datadog alerts to BigPanda for processing. BigPanda correlates them with your other app data to determine the cause of a change in a service. When BigPanda identifies a correlation and creates an incident, it will also push events back to Datadog.\n   Datadog customers can now send their AWS service logs directly to Datadog with an Amazon Kinesis Data Firehose delivery stream. Through this  easy-to-configure process, users can explore and analyze service logs to gain deeper insights into the state of their AWS infrastructure and applications. Logs streaming from Kinesis Data Firehose automatically include key metadata such as their source, so users can quickly identify which AWS service generated the log. And with features like Logging without Limits™, users can analyze and generate metrics from all their logs, letting them uncover and alert on trends in their AWS services while only storing the logs they need. Read more about how to get started  here.\n    Datadog now integrates with  AWS Serverless Application Model (SAM) and  AWS Cloud Developer Kit (CDK) to provide zero instrumentation serverless observability. With these new integrations—and our preexisting  Serverless Framework plugin—teams can use their choice of developer tooling to streamline how they build, manage, and troubleshoot their serverless applications. Datadog’s new CloudFormation macro automatically ingests enhanced Lambda metrics, traces, and logs, without any code changes. Once you’re monitoring your serverless infrastructure with Datadog, you can easily search and filter functions by any tag, alert on cold starts, visualize how requests flow across Lambda functions and their dependencies, and more. Read our  blog post to get started with the macro.\n   At Dash 2020, a global community of leaders and developers came together to bring their teams, infrastructure, and applications to the next level of scale and velocity. If you missed our virtual event, stay tuned for videos from our keynotes and technical talks to learn how companies like Zillow, Nextdoor, and Wayfair develop a culture of observability. If you’re new to Datadog, you can sign up for a 14-day  free trial now to start using all our latest features and products.", "posttime": "2020-08-12 03:16:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,事件,releases,datadog", "title": "Datadog发布了事件管理、事件探查器、错误跟踪等功能", "title_en": "Datadog releases Incident Management, Profiler, Error Tracking, and more", "transed": 1, "url": "https://www.datadoghq.com/blog/dash-2020-new-feature-roundup/", "via": "", "real_tags": ["发布", "事件", "releases", "datadog"]}, {"category": "", "categoryclass": "", "imagename": "d026969f8808c6e42464851d1505031c.jpeg", "infoid": 1017605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一项新的研究，砖几乎是建筑材料所能得到的最基本的东西，但这些简单的积木具有隐藏的力量，可以用来提供电力。\n科学家们改造了一块普通的红砖--你可以在当地的五金店以不到一美元的价格找到这种砖--这样它就可以为绿色LED灯供电。这一“智能砖”的概念验证表明，可以追溯到几千年前的砖技术可以进行调整，以具有未来的应用，包括导电性和传感能力。研究结果于周二发表在“自然通讯”(Nature Communications)上。\n该研究的合著者、圣路易斯华盛顿大学化学助理教授胡里奥·D&阿西在一次电话中说：“我们已经创造了一种新的砖块，可以整合到你的房子里，具有储存电能的功能。”这项研究的合著者胡里奥·D&阿西是圣路易斯华盛顿大学的化学助理教授。\n他补充说：“我们认为传感应用对这些砖块来说是一个容易摘到的果实。”\n多年来，达西和他的同事们一直在试验铁锈，这是一种无处不在的微红色薄膜，在任何含有铁的结构上都会形成。生锈通常被视为一种腐蚀性的麻烦，但达西的研究小组已经证明，生锈的氧化铁在材料科学中具有有用的特性。\n达西解释说：“我们发现，如果你真的用化学方法处理铁锈，它实际上会变成反应性的。”“因此，我们通常认为是废物的东西原来是一种有用的化学物质，可以用来生产可以用来储存能量的材料。”\n红砖中的色素部分来自生锈，这激发了研究人员更仔细地研究砖的结构属性，看看它们是否可以转化为一种名为超级电容器的储能装置。\n砖块错综复杂的多孔内部被证明是引入复杂聚合物涂层的理想空间，这种涂层与铁锈反应，增加了砖块的表面积和导电性。\n作为这些修改的结果，该团队能够设计出一种原型智能砖，它储存了足够的能量来为绿灯供电。该研究小组目前正在其发现的基础上，通过制造使用各种金属氧化物和聚合物涂层的特种砖来进行研究。\n除了修补电导率和存储容量外，研究人员还希望证明空气传感器或水净化系统可以集成到砖块中。\n“当水从你的屋顶流下来，穿过砖头时，如果水下来时得到净化，你最终把它收集起来怎么办？”达西推测说。“我们总是想着在过滤器上净化水。但是如果房子是一个过滤器呢？“。\n然而，在短期内，达西和他的同事们正专注于提高这些砖的效率，以便它们可以作为普通家庭的后备电源，比如应急照明系统。\n“如果我们能增加一块砖中可以储存的能量，”达西说，“我们就可以扩大规模，使用更少的砖。”\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "Bricks are about as basic as architectural materials can get, yet these simple building blocks have hidden powers that can be leveraged to provide electricity, according to a new study.\n  Scientists modified a common red brick—the same kind you’ll find on sale for under a dollar at your local hardware store—so that it could power a green LED light. This proof-of-concept for a “smart brick” reveals that brick technology, which dates back thousands of years, can be tweaked to have futuristic applications, including electrical conductivity and sensing capabilities. The results  were published on Tuesday in  Nature Communications.\n   “We have created a new brick that can be incorporated into your house that has the functionality of storing electrical energy,” said study co-author Julio D&#39;Arcy, assistant professor of chemistry at Washington University in St. Louis, in a call.\n  “We are thinking that sensing applications is a low-hanging fruit for these bricks,” he added.\n  For years, D’Arcy and his colleagues have experimented with rust, the ubiquitous reddish film that forms on any structure that contains iron. Rust is normally seen as a corrosive nuisance, but D’Arcy’s team has shown that rusty iron oxides have useful properties for material science.\n  “We discovered that if you actually treat rust chemically, it actually becomes reactive,” D’Arcy explained. “So something that we typically think of as waste turns out to be a useful chemical for producing materials that can be used for storing energy.”\n  The pigment in red bricks is partially derived from rust, which inspired the researchers to take a closer look at the structural properties of bricks to see if they could be converted to an energy-storing device called a supercapacitor.\n  The intricate porous interiors of bricks turned out to be an ideal space to introduce sophisticated polymer coatings, which react with rust to increase the surface area and conductivity of bricks.\n   As a result of the modifications, the team was able to engineer a prototype smart brick that stored enough energy to power the green light. The team is currently building on its findings by manufacturing specialized bricks with various metal oxides and polymer coatings.\n  In addition to tinkering with conductivities and storage capacity, the researchers hope to demonstrate that air sensors or water purification systems could be integrated into the bricks.\n  “When the water runs down your rooftop and it goes through the brick, what if the water gets purified when it comes down and you finally collect it?” D’Arcy speculated. “We always think about purifying water on a filter. But what if the house  was a filter?”\n  In the near-term, however, D’Arcy and his colleagues are focused on boosting the efficiency of these bricks so that they could be incorporated as a back-up power source in regular homes, such as an emergency lighting system.\n  “If we can increase the amount of energy that can be stored in one brick,” D’Arcy said, “we can scale up and use even less bricks.”\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-08-12 03:16:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,普通,turn,砖块", "title": "科学家将普通红砖变成储电超级电容器", "title_en": "Scientists Turn Normal Red Bricks into Electricity-Storing Supercapacitors", "transed": 1, "url": "https://www.vice.com/en_us/article/9358ye/scientists-turn-normal-red-bricks-into-electricity-storing-supercapacitors", "via": "", "real_tags": ["科学家", "普通", "turn", "砖块"]}, {"category": "", "categoryclass": "", "imagename": "6935a4edca342c220b76d3a95e3a35e5.png", "infoid": 1017604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着全市新冠肺炎感染率的下降，许多纽约人开始走出长达数月的封锁。人权律师史蒂文·唐齐格(Steven Donziger)则不是这样，他在过去的12个月里几乎没有离开过他在上西区的两居室公寓。\n“我的自由被剥夺了，”他在厨房里的Zoom上说。“他们想要压垮我，所以我会放弃。”\n这位律师现在55岁左右，留着一头浓密的灰色头发，弯腰站在柜台前，通过厚框眼镜直视他的网络摄像头。但是，尽管他的表情很疲惫，他明确表示他并没有精疲力竭。\n东齐格的工作曾经带他去过世界的各个角落，包括厄瓜多尔亚马逊的深处。近20年前，他代表数千名热带雨林居民起诉了一家跨国石油巨头。随之而来的法律传奇使他于2019年8月6日被软禁在家中。\n这个故事例证了律师所说的对美国法律体系的“企业俘虏”，对于今天的气候运动来说，它的影响是可怕的。\n20世纪70年代，跨国能源公司德士古在厄瓜多尔东北部建立了油田。这些作业泄漏了超过1600万加仑的原油，是英国石油公司2010年深水地平线(Deepwater Horizon)灾难泄漏原油的80倍。该公司还将数十亿加仑的有毒废物倾倒到郁郁葱葱的热带雨林中数百个无衬里的垃圾坑中，使用在德克萨斯州长期以来被禁止的处置过程。厄瓜多尔土著环保活动家、亚马逊捍卫联盟(Amazon Defense Coalition)主席路易斯·延扎(Luis Yanza)十几岁时第一次搬到了受灾地区。\n“从1977年我第一次到那里，我就看到了油池…。还有一股燃料的味道，“他通过翻译说。“我们的皮肤、手上、脸上都会有真菌，它会改变皮肤的颜色，我们会有白色斑点……。当我们还是孩子的时候，上学时，我们会嘲笑颜色的褪色。但这是污染的后果。“。\n事实上，污染渗入了当地社区赖以饮水和洗澡的土壤和水中，不仅与皮炎有关，而且还增加了癌症和出生缺陷的发生率。\n“我看到油池…。还有一股燃料的味道。我们的皮肤、手上、脸上都会有真菌，它会改变皮肤的颜色，我们会有白色斑点……“。\n1992年，德士古的合同到期，该公司退出了该地区，留下了有毒的遗产，被称为“亚马逊的切尔诺贝利”(Amazon‘s Chernobyl)。德士古表示，它已经补救了损坏的情况，但它声称清理的大多数油井仍然充满了有毒污染物。\n“继续有癌症、感染问题和各种各样的病例。野生动物灭绝了。而且那个地区的作物也不一样，“农民雨果·卡马乔(Hugo Camacho)在亚马逊的家中通过翻译在WhatsApp上说。他自1980年以来一直生活在受污染的地区。\n第二年，3万名土著居民和农民，包括卡马乔和他的妻子，决定采取行动。在社区组织者Yanza的帮助下，该组织决定将该公司告上法庭，并呼吁包括Donziger在内的律师帮助他们。\n“坦率地说，我对我看到的…感到震惊。在污染程度方面，公开倾倒有毒废物，“Donziger在谈到他第一次访问该地区时说，他被称为拉戈·阿格里奥(Lago Agrio)。“它是为了污染环境而设计的，目的是尽可能降低成本，尽可能提高利润，但代价是生活在该地区的人们的利益受损。”“。\nDonziger成为厄瓜多尔1993年起诉德士古的首席律师-后来又起诉雪佛龙，雪佛龙于2001年收购了德士古。雪佛龙的法律代表向厄瓜多尔原告承诺，如果他们继续追查案件，他们将面临“终生诉讼”，但他们没有让步。\n经过18年的战斗，唐齐格和他的团队赢得了胜利。2011年情人节当天，在拉戈·阿格里奥法院，法官尼古拉斯·赞布拉诺命令雪佛龙支付180亿美元的赔偿金。\n“这是一场梦，…。经过二十年的奋斗，这是一项重要的成就，“延扎说。“这是一个特别的日子。”\n这一金额后来减少到95亿美元，但仍是历史上最大的人权和环境法庭判决。但律师和原告的运气很快就恶化了。在厄瓜多尔最高法院维持了对雪佛龙不利的裁决后，该公司将其资产转移到了美国，从而阻止了厄瓜多尔原告收取损害赔偿金。\n雪佛龙对外事务高级顾问肖恩·科米(Sean Comey)在一封电子邮件中写道：“针对雪佛龙的环境指控是虚假的，没有科学证据支持。”\n直到今天，雪佛龙还没有支付95亿美元损害赔偿金中的一分钱，这使得原告没有资金来清理漏油和废物，甚至没有资金治疗由此产生的疾病。而且这家石油公司的目标不仅仅是为了保住他们的钱，正如它在2009年的一份公司备忘录中所说的那样，它是为了“妖魔化唐齐格”，它说唐齐格通过非法手段赢得了这场官司。\n直到今天，雪佛龙还没有支付95亿美元损害赔偿金中的一分钱，这使得原告没有资金来清理漏油和废物，甚至没有资金治疗由此产生的疾病。\n科米说：“唐齐格是一个被判定为敲诈勒索的人。”“为了在厄瓜多尔法院实施敲诈勒索计划，他在美国和国外犯下了罪行。”\n2012年，雪佛龙援引Racketeer Influence and Corrupt Organization(RICO)法案-最初创建于20世纪70年代，目的是阻止黑手党活动-对Donziger，Camacho和另一名原告土著领袖Javier Piaguaje提起诉讼，声称厄瓜多尔的决定是通过贿赂和欺诈促成的。此案的法官是纽约美国地区法院法官刘易斯·卡普兰(Lewis Kaplan)，他在之前的一起诉讼中做出了有利于烟草公司的裁决，但没有透露他之前的行业联系。在法庭上，他称赞雪佛龙是“一家对我们的经济相当重要的公司”。\n通过一个有争议的发现过程，雪佛龙获得了唐齐格的私人日记，以及其他一些东西。但该公司的核心证据是他们唯一证人的证词：名誉扫地的厄瓜多尔法官阿尔贝托·格拉(Alberto Guera)，他因腐败指控被免职，并从公司收受了数十万美元和其他福利。在与雪佛龙的律师会面53次后，格拉作证说，唐齐格和他的团队在原审中向法官提供了50万美元的贿赂，并代写了2011年针对雪佛龙的判决。在三年后的一起相关案件中，他承认自己在证词中撒了谎。\n与此同时，唐齐格表示，该公司的其他一些断言是真实的。他说，事实上，他的团队已经付钱给一名法院指定的专家，这名专家撰写了一份独立报告，并与一家美国咨询公司合作，后者起草了该报告的部分内容。然而，他坚持认为，这些行为完全符合厄瓜多尔标准的“法律、习俗和惯例”。雪佛龙指出，这是一起更大规模的非法欺诈的证据，但唐齐格表示，“我们维持这种关系的方式是完全恰当的。”(同样值得注意的是，这份有争议的报告甚至没有在针对雪佛龙的最终判决中被引用)。他一直否认格拉的贿赂指控，这是雪佛龙案件的核心内容。\n卡普兰甚至禁止唐齐格和其他原告在案件中提及雪佛龙在亚马逊地区的污染，他认为这“无关紧要”。\n雪佛龙的诉讼最初要求6000万美元的损害赔偿，但就在开庭前几周，该公司放弃了金钱索赔，从而剥夺了被告参加陪审团的权利，并让卡普兰法官独自负责决定被告的命运。2014年，经过卡普兰法官的全面审判，唐齐格和其他被告被判犯有共谋和犯罪行为罪。\n“Donziger和他领导的厄瓜多尔律师腐败了Lago Agrio案。他们提交了欺诈性的证据。他们.。错误地将[损害赔偿评估]描述为法院指定的、理应不偏不倚的专家的工作，并向美国法院讲述了半真半假或更糟的情况，试图防止揭露这一点和其他不当行为。[他们]亲自撰写了拉戈·阿格里奥法庭的判决书，并承诺向厄瓜多尔法官提供50万美元，让他做出有利于他们的裁决，并签署他们的判决书，“卡普兰法官发现。如果曾经有一个案件需要对通过欺诈获得的判决进行公平救济，那就是这个案件。\n这一裁决得到了第二巡回上诉法院2016年8月发布的一项裁决的确认，上诉法院裁定地区法院的判决“没有驳回或推翻的依据”，并指出“(案件)的记录揭示了一系列腐败行为…。包括胁迫、欺诈和贿赂，最终向桑布拉诺法官承诺从有利于(原告)的判决中获得50万美元。“。\n卡普兰的发现引发了对唐齐格的一系列进一步攻击。2018年，根据法官的调查结果，唐齐格的合法执照未经听证就被吊销。\n卡普兰随后要求联邦检察官对唐齐格提出藐视法庭的刑事指控，指控他未能交出电子设备和护照，也没有放弃从厄瓜多尔案件中获得费用的权利。Donziger说，他拒绝交出这些设备，因为它们包含与合法客户的私人信息。\n当检察官拒绝对唐齐格提出指控时，卡普兰法官做了一件在美国司法界以前闻所未闻的事情：他指定了一家私人律师事务所对唐齐格提起刑事指控，开创了唐齐格所说的“真正可怕的法律先例”。\n卡普兰走得更远，避免了随机指派的标准程序，由亲商的联邦主义者协会顾问洛蕾塔·普雷斯卡(Loretta Preska)法官监督此案。普雷斯卡是亲商的联邦主义社会的顾问，有做出有利于能源公司的裁决的历史。在过去的一年里，她一直将唐齐格禁闭，称他代表着逃跑的风险。5月20日，她宣布，由于冠状病毒大流行，审判要到9月中旬才会进行-并决定唐齐格没有资格接受陪审团审判。\n刚刚过去的3月份，处理对唐齐格的指控的公司Seward和Kissel首次承认，就在2018年，他们还将雪佛龙视为客户，这证实了唐齐格律师的怀疑。基于公司的利益冲突，唐齐格的律师安德鲁·弗里施(Andrew Frisch)最近提交了一项动议，要求以检察官不当行为为由驳回整个案件，使用的方法与前国家安全顾问迈克尔·弗林(Michael Flynn)的律师用来让他的指控被撤销的方法相同。\n动议称：“本案中的异常不当行为和偏见威胁到了本巡回法庭的完整性和声誉。”\n自2011年首次战胜雪佛龙(Chevron)以来的几年里，环境和气候正义运动取得了爆炸性进展。活动人士举行了规模空前的示威活动，民选官员和非政府组织提出了全面的政策建议，组织和市政当局对石油公司及其政府盟友提起的诉讼越来越多，原因是它们对气候危机的贡献。\n唐齐格说：“这种来自草根阶层的压力促成了环境正义方面的许多重大进步。”\n然而，随着这场运动的发展，化石燃料行业已经聘请了律师来与对手作战，通常是与相同的公司律师事务所合作。例如，吉布森(Gibson)、邓恩(Dunn)和克鲁彻(Crutcher)-在雪佛龙起诉唐齐格的Rico案中代表雪佛龙的公司-也在纽约市、旧金山和奥克兰提起的气候案件中代表雪佛龙。另一家公司Paul，Weiss-卡普兰法官在1994年被任命为法官之前在那里工作了17年-在同样的案件中为埃克森美孚辩护。\nDonziger说：“这些公司是骗子，他们通过代表化石燃料公司阻止任何有意义的改变来应对地球，从而赚取巨额法律费用。”\n对于这些巨额资金，这些公司会提供服务。加州城市的诉讼被驳回，理由是全球气候变化问题无法在法庭上解决，纽约市的案件也被驳回，因为法官表示，他没有找到足够的证据证明埃克森美孚对股东撒谎。\n“这些公司是骗子，因为他们通过代表化石燃料公司来阻止任何有意义的改变来应对地球，从而赚取巨额法律费用。”\n但在某些情况下，企业甚至不是为了取胜。活动人士表示，雪佛龙对Donziger和厄瓜多尔原告的反击是针对公众参与的战略诉讼(SLAPP)的一个例子，该诉讼旨在恐吓并让对手保持沉默。在某些情况下，SLAPP诉讼的提供者会在他们受审前放弃他们。在Donziger的案件中，雪佛龙没有撤销对Rico的民事指控-但他们确实撤销了金钱损害赔偿。\n雪佛龙对这起诉讼的这种描述提出了异议。“美国纽约南区地区法院...。认为针对雪佛龙的判决是欺诈和敲诈勒索的产物，认为它在美国无法执行，“雪佛龙的科米说。“。\n但近年来，企业对SLAPP提起的诉讼越来越多，不仅针对亚马逊地区石油钻探的反对者，也针对美国污染行业的反对者，包括石油和天然气管道、高速公路扩建和林业。\n78岁的佛罗里达州活动家玛吉·赫查拉(Maggy Hurchla)是SLAPP诉讼的受害者之一。她被指控的罪行是给马丁县专员发电子邮件，敦促他们退出与Lake Point Restory的交易，Lake Point Restory是一家在佛罗里达州大西洋海岸开采石灰岩的公司，以保护湿地的健康。2013年，该公司起诉她诽谤，称她向政府官员提供虚假信息，破坏了他们的项目。去年，陪审团决定，她应向该公司支付近440万美元的损害赔偿金。今年4月，佛罗里达州最高法院驳回了她的最新上诉。\n赫查拉坚称自己没有做错什么。“这是民主的基础，我们应该能够谈论对我们的政府官员有争议的事情，”她告诉地球人。在评论此案时，该公司的律师表示：“第一修正案非常重要，但它有局限性……。你不允许说谎。你不能撒谎...。而且，如果你实际上没有说实话，而这些谎言是为了伤害或损害一家企业，那么就会有后果。“。\nSLAPP诉讼的目的是用精神和经济负担压倒批评者，让他们撤退。赫查拉说，她选择不对自己的困境施加太大压力--“我很好，不管欠了430万美元，”她笑着说--但经济负担是相当大的。她与丈夫共享的银行账户可能会被篡改。赫查拉已经退休，但她赚的任何工资也将受到扣押。2018年，马丁县警长的副手扣押了她的两艘皮划艇和她2004年的丰田，尽管她把它们拿回来了。\n“如果我没有...。国防基金和我没有耐心的律师，我不可能走到这一步。大多数人做不到，“她说。“(诉讼)很明显是在说，‘闭嘴’，而且很明显是在说，‘如果我们让你闭嘴，其他所有人都会闭嘴。’”\n赫查拉的案件可能会提交给联邦最高法院。她说：“我一直抱有希望，因为我一直相信美国最高法院确实相信第一修正案。”\n不过，她将面临一场艰苦的战斗。最高法院是出了名的亲商，它的保守倾向代表了全国各地法庭上更大规模的保守主义运动。\n在这种有利于商业的环境中，化石燃料公司更有可能继续因其造成的损害而在法庭上逍遥法外，这要归功于唐齐格所说的“企业抓获了我们司法中的元素”。\n“我一直抱有希望，因为我一直相信美国最高法院相信第一修正案。”\n他在一封电子邮件中说，“化石燃料行业确实在坚守阵地，正在利用其巨大的财务影响力和在联邦法院的影响力来抵制和公开攻击这场公民运动，以及站在第一线的倡导者和律师。”\n公司及其律师事务所与法院之间的密切联系并不新鲜。路透社(Reuters)2014年的一项研究发现，在八年的时间里，包括吉布森(Gibson)、邓恩(Dunn)和克鲁彻(Crutcher)在内的十几家公司律师事务所的律师由最高法院审理案件的可能性是最高法院的六倍。其中许多律师曾为前任或现任大法官工作。吉布森律师事务所(Gibson)、邓恩律师事务所(Dunn And Crutcher)和克鲁彻律师事务所(Crutcher)的律师与强大的法院不乏联系-乔治·W·布什(George W.Bush)总统任命了一名合伙人担任他的总检察长和美国哥伦比亚特区上诉法院的法官，几名最高法院大法官的前书记员后来成为该事务所的合伙人。在特朗普政府执政期间，更多对企业友好的法官赢得了任命，其中包括多名吉布森、邓恩和克鲁彻合伙人。\n“特朗普总统…。选择来自法律职业中最极端的亲商派别的法官，由联邦主义协会而不是美国律师协会审查，而不是历史上的审查过程，“Donziger说。“在当今世界，除非你对环境或保护环境所需的政府行动怀有强烈的敌意，否则你根本不可能被任命为美国联邦法院的法官。”\n随着更多亲商业的法官出现在法庭上，克林顿任命的卡普兰法官所代表的更多公然支持企业的法律方法可能会出现。\n雪佛龙欠Donziger厄瓜多尔亚马逊客户的95亿美元是一大笔钱。但Donziger表示，对于这家石油公司来说，即使在全球石油需求疲软的情况下，该公司也花费了数百万美元起诉他，市值达到1750亿美元，这不仅仅是钱的问题-这是他们的商业模式。\n雪佛龙表示，它与目前针对Donziger的案件无关。科米说：“唐齐格持续的无法无天现在应该由检察官和美国法院来决定。”“雪佛龙并未参与唐齐格的刑事起诉.”\n但在实践中，卡普兰在RICO案中对律师的判决意味着该公司可以拒绝向美国的原告付款。\n唐齐格说：“我认为，他们在这起案件中的诉讼策略，就我个人而言，不仅是试图逃避向厄瓜多尔欠他们的人支付清理资金，而且是为了扼杀这起案件的根本想法，”唐齐格说，“我认为他们在这起案件中的诉讼策略，不仅是试图逃避向厄瓜多尔欠他们的人支付清理资金，而且是为了扼杀这起案件的想法。”“他们不想要更多这样的案件，他们想用他们对我的所作所为作为证据，证明那些进入这个竞技场与大型企业污染者进行斗争的人最终将付出非常沉重的代价。”\n与企业污染者的斗争对地球的未来至关重要。雪佛龙自1965年以来排放的温室气体比除沙特阿美以外的任何公司都多。任何合法的气候行动计划都必须废除这些行业，因为这些行业在设计上就使地球不适合居住。\n“他们不想要更多这样的案件，他们想用他们对我的所作所为作为证据，证明那些进入这个竞技场参加这些战斗的人。\n.", "note_en": "Amid falling citywide rates of covid-19 infection, many New Yorkers are beginning to emerge from months of lockdown. That’s not the case for human rights attorney Steven Donziger, who has barely left his two-bedroom Upper West Side apartment for the past twelve months.\n  “My liberty is deprived,” he said on Zoom from his kitchen. “They’re trying to crush me so I’ll give up.”\n The attorney, now in his mid-50s with a head of thick, graying hair, stood bent over his counter, looking directly into his webcam through thick-framed glasses. But though his expression was weary, he made it clear he was not out of energy.\n Donziger’s work used to take him to all corners of the world, including to the depths of Ecuadorian Amazon. Nearly twenty years ago, he sued a multinational oil giant on behalf of thousands of the rainforest’s residents. The ensuing legal   saga landed him in home detention on August 6, 2019.\n The story exemplifies what the lawyer calls the “corporate capture” of the U.S. legal system, and for the climate movement today, its implications are terrifying.\n  In the 1970s, the multinational energy company Texaco set up oil fields in northeast Ecuador. The   operations spilled more than 16 million gallons of crude oil, 80 times more oil than was spilled in BP’s 2010 Deepwater Horizon disaster. The company also dumped billions of gallons of toxic waste into hundreds of unlined waste pits in the lush rainforest using disposal processes which had long been outlawed in Texas. Luis Yanza, an Ecuadorian Indigenous environmental activist and president of the Amazon Defense Coalition, first moved to the affected area as a teenager.\n  “From when I first arrived there in 1977, I saw the oil pooling… and there was the smell of fuel,” he said speaking through a translator. “We would get fungus on our skin, on our hands, on our faces, and it would change the color of the skin, we would get white spots... When we were in school when we were kids, we would laugh about the discoloration. But it was a consequence of contamination.”\n Indeed, the pollution, which leached into the soil and water local communities relied on to drink and bathe, has   been   linked to not only dermatitis, but also increased rates of   cancer and birth defects.\n “I saw the oil pooling… and there was the smell of fuel. We would get fungus on our skin, on our hands, on our faces, and it would change the color of the skin, we would get white spots...”\n In 1992, Texaco’s contract ran out and the company exited the region, leaving a legacy so toxic that it’s   been   called “Amazon’s Chernobyl.”   Texaco said it remediated its damages, but the   majority of the wells it claims to have cleaned were still full of toxic pollutants.\n “There continued to be cases of cancer, infection problems and various things. Wildlife died off. And the crops in that area were not the same,” farmer Hugo Camacho, who has lived in the contaminated area since 1980, said through a translator on a WhatsApp call from his home in the Amazon.\n The following year, 30,000 Indigenous people and peasant farmers, including Camacho and his wife, decided to take action. Aided by community organizer Yanza, the group decided to take the company to court and called on attorneys, including Donziger, to help them.\n  “I was, frankly, shocked at what I saw… in terms of the degree of pollution, the open dumping of toxic waste,” Donziger said of his first trip to the region, known as Lago Agrio.  “It was designed to pollute, designed to keep costs as low as possible and inflate profits as high as possible at the expense of the people who lived in the region. ”\n  Donziger became the lead attorney on the Ecuadorians’ 1993 lawsuit against Texaco—and later against Chevron, which bought Texaco in 2001. Chevron’s legal representatives   promised the Ecuadorian plaintiffs a “lifetime of litigation” if they continued to pursue their case, but they didn’t back down.\n After 18 years of fighting, Donziger and his team   won. On Valentine’s Day 2011 in the Lago Agrio court, Judge Nicolás Zambrano   ordered Chevron to pay $18 billion in compensation.\n “It was a dream… an important achievement after two decades of struggle,” said Yanza. “It was a special day.”\n That amount was later   reduced to $9.5 billion, but it was still the largest human rights and environmental court judgement in history. But the lawyers’ and plaintiffs’ luck quickly soured. After the Ecuadorian Supreme Court upheld the ruling against Chevron, the company moved its assets out of the nation and into the U.S., thereby preventing the Ecuadorian plaintiffs from collecting the damages.\n  “The environmental claims against Chevron are false and unsupported by scientific evidence,” Sean Comey, senior advisor of external affairs at Chevron, wrote in an email.\n To this day, Chevron hasn’t paid a cent of the $9.5 billion in damages, leaving the plaintiffs with no funding to clean up the oil spills and waste, or even treat the resulting illnesses. And the oil company’s goal wasn’t just to keep their money, it was—as it said in a   2009 company memo—to “demonize Donziger,” who it said won the case through illegal means.\n To this day, Chevron hasn’t paid a cent of the $9.5 billion in damages, leaving the plaintiffs with no funding to clean up the oil spills and waste, or even treat the resulting illnesses.\n “Donziger is an adjudicated racketeer,” said Comey. “He committed criminal acts in the U.S. and abroad in pursuit of his extortion scheme in the Ecuadorian courts.”\n In 2012, Chevron invoked the Racketeer Influenced and Corrupt Organizations (RICO) Act—originally created to stop mafia activity in the 1970s—to file a case against Donziger, Camacho, and another plaintiff, Indigenous leader Javier Piaguaje, claiming the Ecuadorean decision was procured by bribery and fraud. The judge on the case was New York U.S. District Court Judge Lewis Kaplan, who in one previous suit had ruled in favor of   tobacco companies without disclosing his previous industry ties. In the courtroom, he   praised Chevron as “a company of considerable importance to our economy.”\n   Through a   controversial discovery process, Chevron   obtained, among   other things, Donziger’s private diary entries. But the company’s central piece of evidence was the testimony of their sole witness: Alberto Guerra, a disgraced Ecuadorian judge who’d been   removed from the bench over allegations of corruption and who had accepted   hundreds of thousands of dollars and other benefits from the company. After meeting with Chevron’s lawyers 53 times, Guerra testified that Donziger and his team had offered the judge in the original trial a $500,000 bribe and had ghostwritten the 2011 decision against Chevron. In a related case three years later, he   admitted he had lied in his testimony.\n Donziger, meanwhile, said some of the company’s other assertions were true. He said his team had, in fact, paid a court-appointed expert who wrote an independent report and worked with an American consulting firm, which drafted parts of that report. Yet he   maintained that those actions fully comported with standard Ecuadorean “law, custom and practice.” Chevron pointed to this as evidence of a larger illegal fraud, but Donziger says “it was totally appropriate how we maintained that relationship.”(It’s also worth noting that the controversial report was   not even cited in the final verdict against Chevron). He has consistently   denied Guerra’s allegations of bribery, which were the centerpiece of Chevron’s case.\n Kaplan barred Donziger and the other plaintiffs in the case from even mentioning Chevron’s pollution in the Amazon in the case, which he   deemed “not relevant.”\n The Chevron suit originally sought $60 million in damages, but just weeks before it went to trial, the company dropped its monetary claims, thereby removing the defendants’ right to a jury and giving Judge Kaplan the sole responsibility of determining the defendants’ fate. In 2014, after a full trial before Judge Kaplan, Donziger and the other defendants were   found guilty of engaging in conspiracy and criminal conduct.\n “Donziger and the Ecuadorian lawyers he led corrupted the Lago Agrio case. They submitted fraudulent evidence. They... falsely presented [a damages assessment] as the work of the court-appointed and supposedly impartial expert, and told half-truths or worse to U.S. courts in attempts to prevent exposure of that and other wrongdoing. [They] wrote the Lago Agrio court’s Judgment themselves and promised $500,000 to the Ecuadorian judge to rule in their favor and sign their judgment,” Judge Kaplan found. “If ever there were a case warranting equitable relief with respect to a judgment procured by fraud, this is it.”\n The ruling was affirmed by a decision issued by the Second Circuit Court of Appeals in August 2016, with the appellate court finding “no basis for dismissal or reversal” of the district court’s judgment, noting that “the record in the [case] reveals a parade of corrupt actions… including coercion, fraud and bribery, culminating in the promise to Judge Zambrano of $500,000 from a judgment in favor of the [plaintiffs].”\n  Kaplan’s findings set off a slew of further attacks on Donziger. In 2018, based on the judge’s findings, Donziger’s legal license was   suspended without a hearing.\n Kaplan then asked federal prosecutors to   bring criminal contempt charges against Donziger for   failing to   hand over his electronic devices and passports and failing to give up his rights to fees from the Ecuadorian case. Donziger said he refused to turn over the devices because they contained private messages with legal clients.\n When the prosecutors declined to press charges against Donziger, Judge Kaplan did something previously   unheard of in the American judiciary: He   appointed a private law firm to levy the criminal charges, setting what Donziger called a “really scary legal precedent.”\n Kaplan went even further, eschewing standard processes of random assignment to handpick Judge Loretta Preska, an   advisor to the pro-business Federalist Society with a   history of   ruling in   favor of energy companies, to oversee the case. She has kept Donziger on lockdown for the past year, saying he represents a flight risk. On May 20, she   announced that due to the coronavirus pandemic, the trial will not take place until mid-September—and decided that Donziger is not entitled to a jury trial.\n  This past March, Seward and Kissel, the firm handling the charges against Donziger,   admitted for the first time that they’d counted Chevron as a client as recently as 2018, confirming Donziger’s lawyer’s   suspicions. Based on the firm’s conflict of interest, Donziger’s attorney Andrew Frisch recently filed a   motion to dismiss the entire case because of prosecutorial misconduct, using the same approach former national security advisor Michael Flynn’s lawyers used to   get his charges dropped.\n  “The extraordinary misconduct and bias in this case threaten the integrity and reputation of this Circuit,” the motion says.\n  In the years since the initial victory against Chevron in 2011, the movement for environmental and climate justice has exploded. Activists have held   demonstrations of   unprecedented   size, elected officials and nongovernmental groups have put forth   comprehensive policy proposals, and organizations and municipalities have filed a growing number of lawsuits   against   oil   companies and their   government allies for their contributions to the climate crisis.\n “This kind of pressure from the grass roots is responsible for many significant advancements in environmental justice,” Donziger said.\n As the movement has grown, however, the fossil fuel industry has lawyered up to fight its opponents, often with the same corporate law firms. For instance, Gibson, Dunn and Crutcher—the firm that represented Chevron in their RICO case against Donziger—also represented the oil giant in climate cases brought by   New York City,   San Francisco and Oakland. Another firm, Paul, Weiss—where Judge Kaplan   worked for 17 years before he was appointed to the bench in 1994—  defended Exxon in the same cases.\n “These firms are grifters in the sense that they make massive sums of legal fees by representing fossil fuel companies to block any meaningful change to deal with the planet,” said Donziger.\n For those massive sums, the firms deliver. The   California cities’ suit was thrown out on the grounds that the global issue of climate change couldn’t be addressed in the courtroom, and New York City’s case was also dismissed as the judge said he didn’t find enough evidence of Exxon lying to shareholders.\n  “These firms are grifters in the sense that they make massive sums of legal fees by representing fossil fuel companies to block any meaningful change to deal with the planet.”\n But in some cases, corporations aren’t even aiming to win. Activists   say Chevron’s counterattack on Donziger and the Ecuadorian plaintiffs is an   example of a Strategic Lawsuit Against Public Participation, or SLAPP lawsuit, which aim to intimidate and exhaust their opponents into silence. In some cases, purveyors of SLAPP suits will   drop them just before they go to trial. In Donziger’s case, Chevron didn’t drop the civil RICO charges—but they did drop the monetary damages.\n Chevron disputes this characterization of the suit. “The U.S. District Court for the Southern District of New York... held that the judgment against Chevron was [a] product of fraud and racketeering, finding it unenforceable in the United States,” said Chevron’s Comey. ”\n But in recent years, corporations have levied an increasing number of SLAPP lawsuits against opponents of not only   oil drilling in the Amazon, but also of polluting industries in the U.S., including oil and gas   pipelines,   highway expansion, and   forestry.\n  Seventy-eight year old Florida activist Maggy Hurchalla was the victim of one of those SLAPP suits. Her alleged crime was to email Martin County commissioners and urge them to back out of a deal with Lake Point Restoration, a company mining for limestone along Florida’s Atlantic coast in order to preserve the health of wetlands. In 2013, the company sued her for   libel, saying she sabotaged their project by providing false information to government officials, and last year, a jury decided she should pay nearly $4.4 million in damages to the corporation. This past April, the Florida Supreme Court   rejected her latest   appeal.\n  Hurchalla maintains that she did nothing wrong. “It is the very basis of democracy, that we should be able to talk about things that are controversial to our public officials,” she told Earther.   Commenting on the case, the company’s attorney has said: “The First Amendment’s very important, but it has limits... You are not allowed to tell falsehoods. You’re not allowed to lie... And, if in fact, you do not tell the truth, and those falsehoods were designed to injure or harm a business, there’s a consequence for that.”\n SLAPP suits aim to overwhelm critics with mental and financial burdens so they retreat. Hurchalla says she is choosing not to stress too much about her predicament—“I’m fine, regardless of owing $4.3 million,” she said, laughing—but the financial burden has been   considerable. A bank account she shares with her husband is subject to being garnished. Hurchalla is retired, but any wages she earned would be subject to garnishment, too. And in 2018, Martin County sheriff’s deputies seized two of her kayaks and   her 2004 Toyota, , though she got them   back.\n “If I didn’t have a... defense fund and I didn’t have patient lawyers, I couldn’t have gotten this far. Most people couldn’t,” she said. “[The suit is] clearly about, ‘shut up,’ and it’s clearly about, ‘if we shut you up, everybody else will shut up.’”\n Hurchalla’s case may be headed for the federal Supreme Court. “I am keeping on hoping because I’m keeping on believing that the U.S. Supreme Court does believe in the First Amendment,” she said.\n She’ll be facing an uphill battle, though. The Supreme Court is notoriously pro-business, and it’s conservative tendencies are representative of a larger   movement toward conservatism in courtrooms around the country.\n In this pro-business environment, fossil fuel companies are more likely to continually be let off the hook in the courts for the damages they’ve caused, thanks to what Donziger called the “corporate capture of elements of our judiciary.”\n  “I am keeping on hoping because I’m keeping on believing that the U.S. Supreme Court does believe in the First Amendment.”\n “The fossil fuel industry has really dug in and is using its enormous financial clout and its influence in the federal courts to resist and openly attack this citizens’ movement and the advocates and lawyers who are on the frontlines,” he said in an email.\n Close ties between corporations and their law firms with courts aren’t new. A 2014   Reuters study found that, over an eight-year period, lawyers at one of a dozen corporate law firms—including Gibson, Dunn and Crutcher—were six times more likely to have their cases heard by the Supreme Court. Many of those lawyers worked for past or current justices. Lawyers at Gibson, Dunn and Crutcher have no shortage of connections to powerful courts—President George W. Bush appointed a partner to be his   Solicitor General and to the   U.S. Court of Appeals for D.C., and   several former clerks for Supreme Court justices went on to become partners at the firm. Under the Trump administration,   even more corporate-friendly judges have won appointments, including   multiple   Gibson, Dunn and Crutcher partners.\n  “President Trump… chooses judges from the most extremist pro-business wing of the legal profession, vetted by the Federalist Society and not the American Bar Association, which historically was the process,” said Donziger. “You simply cannot be appointed to a federal court in the U.S. in today’s world unless you are aggressively hostile to the environment or to governmental action needed to protect the environment.”\n With more pro-business judges in the courts, more of the blatantly pro-corporate approach to law exemplified by Clinton-appointee Judge Kaplan could be on the way.\n   The $9.5 billion that Chevron owes Donziger’s clients in the Ecuadorian Amazon is a lot of money. But Donziger said for the oil company, which has spent millions to sue him and has a market capitalization of   $175 billion even amid tanking global oil demand, it’s not just the money that’s on the line—it’s their business model.\n Chevron says it has nothing to do with the current case against Donziger. “Donziger’s continuing lawlessness is now a matter for prosecutors and the U.S. courts to decide,” said Comey. “Chevron is not involved in Donziger’s criminal prosecution.”\n But in practice, Kaplan’s verdict in the RICO case against the lawyer means the company can refuse to pay the plaintiffs in the United States.\n “I think their litigation strategy in this case, and as it regards me personally, is not only to try to evade paying the funds for cleanup to the people they owe it to in Ecuador, but also to kill off the very idea of this case,” said Donziger. “They don’t want more of these cases, and they want to use what they’re doing to me as evidence that those who enter this arena to take on these fights with big corporate polluters ultimately will pay a very heavy price.”\n Those fights with corporate polluters are central to the future of the planet. Chevron is   responsible for more greenhouse gas emissions since 1965 than any company besides Saudi Aramco. Any legitimate climate action plan will have to do away with these industries, which make the planet uninhabitable by design.\n “They don’t want more of these cases, and they want to use what they’re doing to me as evidence that those who enter this arena to take on these fights\n......", "posttime": "2020-08-12 03:15:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "试图,crush", "title": "雪佛龙试图粉碎一位著名的气候律师", "title_en": "Chevron Is Trying to Crush a Prominent Climate Lawyer", "transed": 1, "url": "https://earther.gizmodo.com/chevron-is-trying-to-crush-a-prominent-climate-lawyer-a-1844685508", "via": "", "real_tags": ["试图", "crush"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017603, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位小说家说，粗心在谷歌上搜索的细节“相当有趣”，他将在读者在他的新书中发现Octoroks和Lizalfos后，让他的书保持原样。\n“穿条纹睡衣的男孩”的获奖作家约翰·博恩承认，粗略的谷歌搜索导致他在自己的新小说中意外地将热门视频游戏“塞尔达传奇：野性的呼吸”中的怪兽收入其中。\n博恩的“智慧之门的旅行者”于公元1世纪上映，2000年后结束，讲述了一位叙述者和他的家人的故事。在一节中，叙述者开始毒死匈奴的阿提拉，使用的原料包括一个“Octorok眼球”和“红色利扎尔福的尾巴和四个Hylian蘑菇”。\n好吧。这是一条线索，但我保证这是值得的。今天在Reddit上，用户u/nonono_ohoh发布了一个页面，摘自爱尔兰著名小说家约翰·博恩的新书“智慧之门的旅行者”(The Traveller At The Gates Of Wisdom)。注意配料。Pic.twitter.com/4RTgZxtUT7。\n-Dana Schwartz(@DanaSchwartzzz)2020年8月3日。\n正如作家达娜·施瓦茨在推特上指出的那样，“如果你觉得这些配料看起来很奇怪，那是因为它们完全出自塞尔达游戏”野性呼吸“。”\n“这是一种致敬吗？复活节彩蛋？嗯。这本书“不是”幻想。这是一部以现实世界为背景的历史剧，“施瓦茨写道，一名Reddit用户提醒她注意到了这一异常现象。\n施瓦茨在谷歌上的搜索表明，博恩肯定是敷衍了事地搜索了“如何将衣服染成红色”，才想出了这篇文章，他登陆了一个网站，列出了游戏中红色染料的配方，这款游戏于2017年发布。\n“他发现了一个列出怪兽部件的网站，不小心把它们放进了他非常严肃的书里。我为他感到非常尴尬，这是我的噩梦，但也非常有趣，“施瓦茨说。“”不管怎样。让这给所有小说家一个教训，让他们阅读你正在寻找书籍的全部背景，但如果你确实犯了错误，至少要让它们变得滑稽可笑。\n博伊恩欣然接受了这一发现，并表示他不会改变这一部分-但会将塞尔达添加到小说平装书的致谢页上，尽管他一生中从未玩过电脑游戏。\n“我会让它保持原样。实际上我觉得这很有趣，你说得完全对。我不记得了，但我一定是谷歌了一下。“他在推特上告诉施瓦茨。“嘿，有时候你只需要举起你的手说‘耶！我的错！‘“。\n他补充道：“给自己的提示是：永远不要再在小说中谈论毒药。”", "note_en": "Novelist says details from careless Google search are ‘quite funny’ and he will leave his book as is after reader spots Octoroks and Lizalfos in his new book\n    John Boyne, the award-winning author of The Boy in the Striped Pyjamas, has acknowledged that a cursory Google led to him accidentally including monsters from the popular video game The Legend of Zelda: Breath of the Wild in his new novel.\n Boyne’s A Traveller at the Gates of Wisdom opens in AD1 and ends 2,000 years later, following a narrator and his family. In one section, the narrator sets out to poison Attila the Hun, using ingredients including an “Octorok eyeball” and “the tail of the red lizalfos and four Hylian shrooms”.\n  OKAY. This is a thread, but it’s worth it I promise.  On Reddit today, user u/NoNoNo_OhOhOh posted a page from acclaimed Irish novelist John Boyne’s latest book, ‘The Traveller At the Gates of Wisdom.  Note the ingredients.  pic.twitter.com/4RTgZxtUT7\n— Dana Schwartz (@DanaSchwartzzz)  August 3, 2020\n As  the writer Dana Schwartz pointed out on Twitter, “if those ingredients look weird to you, it is because they are straight of out of the Zelda game Breath of the Wild”.\n “Is it an homage? An Easter egg? Hmm. The book is *not* a fantasy. It’s a historical drama set in the real world,” wrote Schwartz, who said she was alerted to the anomaly by a Reddit user.\n A Google search on the part of Schwartz suggested that Boyne must have perfunctorily searched for “how to dye clothes red” to come up with the passage, landing on a site listing the recipe for red dye in the game, which was released in 2017.\n “He found a site listing monster parts and accidentally put them in his Very Serious book. I am very embarrassed for him and this is my nightmare but it’s also very funny,” said Schwartz. “Anyway. Let this be a lesson to all novelists to read the full context of the things you’re looking up for your books but if you do make mistakes, at least let them be hilarious.”\n Boyne took the revelation in good spirits, and said he wouldn’t be changing the section – but would add Zelda to the acknowledgments page of the novel’s paperback, despite never having played a computer game in his life.\n “I’ll leave it as it is. I actually think it’s quite funny and you’re totally right. I don’t remember but I must have just Googled it,” he told Schwartz on Twitter. “Hey, sometimes you just gotta throw your hands up and say ‘yup! My bad!’”\n He added: “Note to self: never talk about poisons in a novel again.”", "posttime": "2020-08-12 03:15:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,boyne,搜索", "title": "约翰·博伊恩在小说中意外地将塞尔达视频游戏怪兽包括在内。", "title_en": "John Boyne accidentally includes Zelda video game monsters in novel", "transed": 1, "url": "https://www.theguardian.com/books/2020/aug/03/john-boyne-accidentally-includes-zelda-video-game-monsters-in-novel", "via": "", "real_tags": ["游戏", "boyne", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "4ac42a658d2a8c83daa3d58aecc254d5.png", "infoid": 1017602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周晚些时候，绝大多数艺电股东投票反对该公司的高管薪酬计划。此次投票之前，维权投资者团体发起了一场施压运动，反对他们认为公司高管奖金过高。\n在大型上市公司的股东面前，所谓的薪酬话语权投票很少失败；哈佛商学院(Harvard Business School)最近的一项研究显示，在过去十年左右的时间里，此类投票失败的比例远低于3%。虽然投票结果对公司董事会没有约束力，但他们将不得不否决否决薪酬计划的公司整整68%的有投票权的股份。\n被拒绝的支付计划包括拟议中的2020财年首席执行官安德鲁·威尔逊(Andrew Wilson)的总薪酬为2137万美元，高于2019年的1830万美元。其他高管将面临更大的涨幅，包括首席财务官布莱克·乔根森(Blake Jorgensen)(2019年为941万美元，2020年为1,950万美元)和首席制片官劳拉·米勒(Laura Miele)(695万美元至1,610万美元)，以及首席技术官肯尼斯·莫斯(Kenneth Moss)(695万美元至1,420万美元)。\n在投票前，各式各样的投资者团体联合起来反对艺电提出的薪酬计划，其中包括有影响力的代理投票顾问机构股东服务公司(Institution Sharener Services)和与工会有关联的CtW投资集团(CtW Investment Group)。纽约和加利福尼亚州的公共雇员退休基金紧随这些团体的脚步，投票反对这项提案，帮助导致了该提案的失败。\nCtW执行董事Dieter Waizenegger在一份声明中表示，股东们对艺电存在严重缺陷的高管薪酬做法进行了响亮的抨击，这些做法没有激励高管创造长期价值。这次投票是一个号角，呼吁董事会停止在高管奖励的基础上增加奖励，并确保公司在公司各个层面发展专注于人才培养和留住人才的薪酬理念。\n今年早些时候，CtW还领导了一场公开运动，反对其所说的动视暴雪(Activision Blizzard)高管薪酬过高，其中包括向首席执行官博比·科蒂克(Bobby Kotick)支付近3000万美元的薪酬。虽然动视暴雪的补偿计划在今年夏天早些时候获得通过，但它只获得了不到所有有表决权股份的60%的支持，这对该公司来说是创纪录的低点。\n彭博新闻社(Bloomberg News)最先报道，动视暴雪(Activision Blizzard)的员工联合起来分享匿名薪酬信息，反对视频游戏高管薪酬的举措出台之际。这项调查的结果显示，公司不同角色和人口群体之间，甚至在内部，工资差异巨大。\n根据2019年的公开披露，科蒂克的薪酬是动视员工薪酬中值的319倍，而威尔逊的薪酬是艺电员工薪酬中值的200倍。相比之下，根据AFL-CIO收集的数据，标准普尔500指数成份股公司CEO与员工的平均比例为264：1。", "note_en": "A significant majority of Electronic Arts shareholders voted against the company&#39;s executive compensation plans late last week. The vote follows a pressure campaign from activist investor groups against what they see as excessive bonuses for executives at the company.\n So-called &#34;say-on-pay&#34; votes rarely fail when put before shareholders of major publicly held companies;  a recent Harvard Business School study showed well below 3 percent of such votes failing in the last decade or so. And while the results of the vote aren&#39;t binding on the company&#39;s board of directors, they would have to overrule a full 68 percent of the company&#39;s voting shares that rejected the pay plan.\n The rejected payment plan included a proposed $21.37 million in total compensation for CEO Andrew Wilson in the 2020 fiscal year, up from $18.3 million in 2019. Other executives were set to see much larger bumps, including CFO Blake Jorgensen ($9.41 million in 2019 to $19.5 million in 2020) and Chief Studios Officer Laura Miele ($6.95 million to $16.1 million), and CTO Kenneth Moss ($6.95 million to $14.2 million).\n An assortment of investor groups rallied against EA&#39;s proposed compensation plan ahead of the vote, including influential proxy vote advisors Institutional Shareholder Services and union-affiliated CtW Investment Group. Public employee retirement funds in New York and California followed those groups&#39; lead in voting against the proposal, helping lead to its defeat.\n &#34;Shareholders issued a resounding rebuke of Electronic Arts’ deeply flawed executive pay practices that does not incentivize executives to create long-term value,&#34; CtW Executive Director Dieter Waizenegger said in a statement. &#34;This vote is a clarion call for the board to stop piling awards on top of awards for top executives and make sure that the company develops a pay philosophy that is focused on talent development and retention throughout all levels of the company.&#34;\n Earlier this year, CtW also led a public campaign against  what it says is excessive executive pay at Activision Blizzard, including nearly $30 million in compensation for CEO Bobby Kotick. While Activision Blizzard&#39;s compensation plan passed earlier this summer, it did so with the support of less than 60 percent of all voting shares, a record low for the company.\n The moves against video game executive pay come as employees at Activision Blizzard have banded together to share anonymous salary information,  as first reported by Bloomberg News. The results of that survey show vast wage disparities across, and even within, different roles and demographic groups in the company.\n According to public disclosures for 2019,  Kotick&#39;s compensation was 319 times the median salary of an Activision employee, while  Wilson&#39;s was 200 times the median EA employee salary. That&#39;s compared to an average CEO-to-median-worker ratio of 264-to-1 for the S&amp;P 500, according to  data collected by the AFL-CIO.", "posttime": "2020-08-12 02:52:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股东,shareholders,薪酬", "title": "艺电股东对高管大幅加薪的提议说不", "title_en": "EA shareholders say no to massive proposed raises for executives", "transed": 1, "url": "https://arstechnica.com/gaming/2020/08/ea-shareholders-say-no-to-massive-proposed-raises-for-executives/", "via": "", "real_tags": ["股东", "薪酬"]}, {"category": "", "categoryclass": "", "imagename": "d798db1642ac77ae45dc1489f5a2aa8c.jpg", "infoid": 1017601, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Dealmaster的头条新闻是亚马逊的Fire HD平板电脑的三大折扣。这些交易将Fire HD 8降至60美元，Fire HD 8 Plus降至80美元，Fire HD降至10美元至100美元。尽管我们今年已经看到这些平板电脑打折了几次，但每一次优惠都与我们迄今看到的每台设备的最低价格持平。\nFire HD系列的推力是在硬件和性能上变得足够好，价格明显低于苹果的iPad或高端安卓平板电脑。这三款平板电脑不会改变这一价值主张：即使是苹果的入门级iPad，也为愿意付费的人提供了更优质的设计、更好的显示屏和更全面的应用程序库。但是，如果你决心花100美元或更低的价格买一台平板电脑，Fire HD平板电脑通常都是物美价廉的。\n按照目前的价格，8英寸的Fire HD 8可能是这一系列机型中最物有所值的：它采用舒适的设计，拥有中等清晰度的1280x800显示屏，充电一次电池可以续航几天，虽然它从来不会太快，但它的表现足以满足其预期的基本媒体消费需求。只是不要对游戏的方式寄予太高的期望。\n新款Fire HD 8 Plus增加了无线充电支持、USB-C端口和额外的GB内存(总共3 GB)；考虑到亚马逊的Fire OS不太强调多任务处理，后者并不像听起来那么重要，但如果你想更多地强调性能，它就在那里。与此同时，Fire HD 10配备了10英寸的1080p显示屏，适合那些喜欢用更大的屏幕浏览网页、阅读和观看视频的人。它还配备了一个USB-C端口。每块石板也都有一个microSD插槽，用于扩展存储。\n与亚马逊平板电脑通常的权衡仍然存在。为了避免在锁定屏幕的平板电脑上看到广告，你仍然需要支付额外的费用，而厚皮的Fire OS的设计仍然是为了把你推向亚马逊的内容和服务。如果没有老套的解决办法，你仍然无法访问标准的Android应用商店或安装谷歌官方应用-Gmail、YouTube等。但如果你认为这些烦恼值得你省下的钱，Fire HD平板电脑仍然物有所值，特别是作为家庭的辅助显示器或共享平板电脑。\n不过，如果你已经在平板电脑方面做好了一切准备，我们还有PS4独家游戏的优惠，比如“死亡追踪器”(Death Stranding)和“梦想”(Dreams)，Fitbit的Inspire HR健身跟踪器，索尼降噪耳机等等。下面你自己看看吧。\nDealmaster推出了自己的时事通讯！注册后，就可以收到一份更短的、经过严格管理的网上最佳科技交易清单--不要胡说八道，直接进入你的收件箱，而且通常是在它们进入ARS主页之前。\n注意：ARS Technica可能会通过会员计划从本帖子上的链接中获得销售补偿。\nAukey PB-Y13和USB-C便携式电池-总共18W，10000mAh，18W USB-C PD，2x USB-A，在亚马逊售价18.09美元(剪辑5美元的优惠券和使用代码：NND4Y3IP8-通常是30美元)。\nAUKEY PA-D1 USB-C壁式充电器-总计30W，30W USB-C PD，USB-A在亚马逊售价12.99美元(剪辑7美元优惠券-通常为21美元)。\n联想ThinkPad T490笔记本电脑-英特尔酷睿i5-8265U，14英寸1080p，8 GB RAM，256 GB固态硬盘，联想售价约749美元(使用代码：THINKDEAL-通常为1050美元)。\n联想ThinkPad X1 Carbon(第七代)笔记本电脑-英特尔酷睿i5-10210U，14英寸1080p，16 GB RAM，512 GB固态硬盘，联想售价1,089.50美元(使用代码：THINK50-通常为1,350美元)。\n苹果MacBook Pro(2020)笔记本电脑-英特尔酷睿i5-1038NG7，13.3英寸2560x1600，16 GB RAM，1TB固态硬盘，魔术键盘，亚马逊售价1799.99美元(通常为1,950美元)。\nCalDigit TS3Plus和迅雷3坞站-2x迅雷3，5xUSB-A，USB-C3.1Gen 1，USB-C3.1Gen 2，DisplayPort1.2，Ethernet，SD在亚马逊和B&A；H售价约209.99美元(通常为250美元)。\n最终幻想七翻拍游戏(PS4)在亚马逊、GameStop和PlayStation Store售价39.99亿美元(通常为60美元)。\n尼·诺·库尼：白女巫之怒(Switch)在亚马逊以24.54美元(通常为30美元)的价格出售。\nBayonetta和Vanquish 10周年捆绑包(PS4，XB1)在百思买(Best Buy)售价29.99亿美元(通常为40美元)。\n金属齿轮实心V：PlayStation Store售价4.99美元(通常为20美元)的最终体验(PS4，数字)。\nHori Nintendo Switch双USB游戏机支架+任天堂Switch充电器+支架在亚马逊售价24.50美元(通常为30美元)。\n8Bitdo Gbros。任天堂交换机的无线适配器和控制器适配器在亚马逊售价14.42美元(通常为20美元)。\n65英寸TCLQ825 8系列和4K高清迷你LEDRoku电视，百思买售价999.99美元(通常为1,800美元)。\nTP-Link Kasa HS200智能Wi-Fi灯开关在亚马逊售价14.99美元(剪辑5美元优惠券-通常为20美元)。\nAukey PB-Y13和USB-C便携式电池-总共18W，10000mAh，18W USB-C PD，2x USB-A，在亚马逊售价18.09美元(剪辑5美元的优惠券和使用代码：NND4Y3IP8-通常是30美元)。\nAUKEY PA-D1 USB-C壁式充电器-总计30W，30W USB-C PD，USB-A在亚马逊售价12.99美元(剪辑7美元优惠券-通常为21美元)。\nRAVPower RP-PC120 USB-C壁式充电器-30W USB-C PD，GAN在亚马逊售价12.99美元(夹3美元优惠券，使用代码：FYSYMKOWX9-通常为22美元)。\nRAVPower RP-PC104/USB-C壁式充电器-45W USB-C PD，GAN在RavPower售价13.99美元(使用代码：*PC50--通常为26美元)。", "note_en": "Today&#39;s Dealmaster is headlined by a trio of discounts on Amazon&#39;s Fire HD tablets. The deals drop the  Fire HD 8 to $60, the  Fire HD 8 Plus to $80, and the  Fire HD 10 to $100. Though we&#39;ve seen these tablets discounted a handful of times already this year, each offer matches the lowest price we&#39;ve seen for each device to date.\n The thrust of the Fire HD line is getting  good  enough hardware and performance for significantly lower prices than Apple&#39;s iPads or a premium Android tablet. The three slates here don&#39;t change that value proposition: even  Apple&#39;s entry-level iPad offers a more premium design, a better display, and a more comprehensive app library to those willing to pay for it. But if you&#39;re determined to pay $100 or less for a tablet, the Fire HD slates are generally good buys.\n At its current price, the 8-inch Fire HD 8 might be the best value of the bunch: it offers a moderately sharp 1280x800 display in a comfortable design, its battery can last a few days on a charge, and while it&#39;s never outright fast, it performs competently for the basic media consumption for which it&#39;s intended. Just don&#39;t expect much in the way of gaming.\n The  new Fire HD 8 Plus adds wireless charging support, a USB-C port, and an extra GB of RAM (3GB in total); the latter isn&#39;t as big of a deal as it might sound given that Amazon&#39;s Fire OS doesn&#39;t emphasize multitasking too heavily, but it&#39;s there if you want to stress performance a bit more. The Fire HD 10, meanwhile, comes with a 10-inch 1080p display for those who prefer a bigger screen for Web browsing, reading, video viewing. It  comes with a USB-C port as well. Each slate has a microSD slot for expanding storage, too.\n The  usual trade-offs with Amazon&#39;s tablets are still here. You still have to pay extra to avoid seeing ads on the tablets&#39; lock screens, and the heavily-skinned Fire OS is still engineered to push you toward Amazon content and services. You still can&#39;t access the standard Android app store or install official Google apps—Gmail, YouTube, etc.—without  hacky workarounds. But if you think those annoyances are worth the money saved, the Fire HD tablets remain good value, particularly as a secondary display or a shared tablet for the family.\n If you&#39;re all set on the tablet front, though, we also have deals on PS4-exclusive games like  Death Stranding and  Dreams, Fitbit&#39;s Inspire HR fitness tracker, Sony noise-cancelling headphones, and more. Have a look for yourself below.\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n  Aukey PB-Y13  USB-C portable battery -  18W total, 10,000mAh, 18W USB-C PD, 2x USB-A for  $18.09 at Amazon ( clip $5 coupon and use code:  ND4Y3IP8 - normally $30).\n Aukey PA-D1 USB-C wall charger - 30W total, 30W USB-C PD, USB-A for  $12.99 at Amazon ( clip $7 coupon - normally $21).\n   Lenovo ThinkPad T490 laptop - Intel Core i5-8265U, 14-inch 1080p, 8GB RAM, 256GB SSD for  $749 at Lenovo (use code:  THINKDEAL - normally $1,050).\n Lenovo ThinkPad X1 Carbon (7th gen) laptop - Intel Core i5-10210U, 14-inch 1080p, 16GB RAM, 512GB SSD for  $1,089.50 at Lenovo (use code:  THINK50 - normally $1,350).\n Apple MacBook Pro (2020) laptop - Intel Core i5-1038NG7, 13.3-inch 2560x1600, 16GB RAM, 1TB SSD, Magic Keyboard for  $1,799.99 at Amazon (normally $1,950).\n CalDigit TS3 Plus Thunderbolt 3 dock - 2x Thunderbolt 3, 5x USB-A, USB-C 3.1 Gen 1, USB-C 3.1 Gen 2, DisplayPort 1.2, Ethernet, SD for  $209.99 at Amazon and  B&amp;H (normally $250).\n   Final Fantasy VII Remake (PS4) for  $39.99 at Amazon,  GameStop, and  PlayStation Store (normally $60).\n      Ni No Kuni: Wrath of the White Witch Remastered (Switch) for  $24.54 at Amazon (normally $30).\n   Bayonetta and Vanquish 10th Anniversary Bundle (PS4, XB1) for  $29.99 at Best Buy (normally $40).\n     Metal Gear Solid V: The Definitive Experience (PS4, digital) for  $4.99 at PlayStation Store (normally $20).\n   Hori Nintendo Switch Dual USB Playstand charger + stand for Nintendo Switch for  $24.50 at Amazon (normally $30).\n  8Bitdo Gbros. Wireless Adapter controller adapter for Nintendo Switch for  $14.42 at Amazon (normally $20).\n   65-inch TCL Q825 8 Series 4K HDR Mini-LED Roku TV for  $999.99 at Best Buy (normally $1,800).\n        TP-Link Kasa HS200 smart Wi-Fi light switch for  $14.99 at Amazon ( clip $5 coupon - normally $20).\n   Aukey PB-Y13  USB-C portable battery -  18W total, 10,000mAh, 18W USB-C PD, 2x USB-A for  $18.09 at Amazon ( clip $5 coupon and use code:  ND4Y3IP8 - normally $30).\n Aukey PA-D1 USB-C wall charger - 30W total, 30W USB-C PD, USB-A for  $12.99 at Amazon ( clip $7 coupon - normally $21).\n RavPower RP-PC120 USB-C wall charger - 30W USB-C PD, GaN for  $12.99 at Amazon ( clip $3 coupon and use code:    SYMKOWX9 - normally $22).\n RavPower RP-PC104 USB-C wall charger - 45W USB-C PD, GaN for  $13.99 at RavPower (use code:  PC50 - normally $26).", "posttime": "2020-08-12 02:52:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,电脑,亚马逊,fire,usb", "title": "亚马逊Fire HD 8和Fire HD 10平板电脑今日重新发售", "title_en": "Amazon’s Fire HD 8 and Fire HD 10 tablets are back on sale today", "transed": 1, "url": "https://arstechnica.com/staff/2020/08/amazons-fire-hd-8-and-fire-hd-10-tablets-are-back-on-sale-today/", "via": "", "real_tags": ["amazon", "电脑", "亚马逊", "fire", "usb"]}, {"category": "", "categoryclass": "", "imagename": "4d4ba8120d9226d9c2eed253516cdcf9.jpg", "infoid": 1017600, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "朱利安·夏皮罗(Julian Shapiro)是BellCurve.com的创始人，这是一个成长营销团队，为初创企业提供高级成长方面的培训，帮助招聘高级成长营销人员，并寻找经过审查的成长机构。他还在Julian.com上撰文。\n这就是你如何跟上增长营销策略的最新动态--带着在其他地方很难找到的建议。\n我们的社区由初创公司创始人和成长型公司负责人组成。您可以通过加入Demand Curve的营销培训计划或其松弛小组来参与。\n弄清楚他们属于什么社会团体。这可能是任何事情，从女性创始人团体，到大学校友网络，再到成立餐厅管理行业协会。\n你是怎么知道的？我只要问他们属于什么群体就行了。不要害怕谈话。\n请快乐的用户将您与这些组的负责人联系起来。解决他们共同存在的问题--即使它只与你的业务无关。重要的是，这些理想客户中有更多人了解并信任你。您还可以推荐演讲者、提供交易、为他们撰写内容或提供免费办公时间。\n向其他类似团体中的人伸出援手。参考原始小组的背书，并提供案例研究(在他们允许的情况下)。\n通过群组可以是一种高杠杆的方式来登陆并扩展到理想的受众。", "note_en": "Julian Shapiro is the founder of  BellCurve.com, a growth marketing team that trains startups in advanced growth, helps hire senior growth marketers and finds vetted growth agencies. He also writes at  Julian.com.\n  This is how you stay up-to-date on growth marketing tactics — with advice that’s hard to find elsewhere.\n Our community consists of startup founders and heads of growth. You can participate by joining Demand Curve’s  marketing training program or its  Slack group.\n       Figure out what social groups they belong to. This could be anything from a female founders group, to university alumni networks, to a restaurant management trade association.\n How do you find out? Just ask them what groups they belong to. Don’t be afraid of conversation.\n Ask the happy user to connect you with the heads of those groups. Solve a problem they collectively have — even if it’s only tangentially related to your business. What matters is that more of these ideal customers know and trust you. You can also refer speakers, offer deals, write content for them or offer free office hours.\n  Reach out cold to people in other, similar groups. Reference the endorsement of the original group and provide a case study (with their permission).\n Going through groups can be a high-leverage way to land and expand into ideal audiences.", "posttime": "2020-08-12 02:51:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "访问,social,提供", "title": "\n通过推荐访问社会团体", "title_en": "\n\t\t\t\tAccessing social groups through referrals\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/11/accessing-social-groups-through-referrals/", "via": "", "real_tags": ["访问", "social", "提供"]}, {"category": "", "categoryclass": "", "imagename": "d916e4059931ddd42ddfe683c4cdda48.jpg", "infoid": 1017599, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "投资的时机至关重要，因为该国正在考虑系统性种族主义的影响和影响。在没有哪个领域，黑人专业人士的代表性不足比科技行业更能感受到这一点，在科技行业，缺乏多样性可能会对产品和服务产生深远影响，而这些产品和服务正变得越来越重要，在经济的大部分领域。\n代表性不足的问题和系统性种族主义的根本问题，体现在面部识别技术、社交网络应用程序以及借贷和信贷决策软件上，这些都是美国社会运作的方面。\nValence新任首席执行官盖伊·普里姆斯(Guy Primus)发给用户的一封信显示，Valence最近一轮融资是着眼于技术和创业精神。\n“现在我们有了我们所寻求的资本，我们将做三件事。首先，我们将改进目前的产品。我们对我们到目前为止已经建立的东西感到非常自豪，但我们知道还有一些问题。我们将继续解决这些问题，并将加快工作，以提高该平台的技术性能，“Primus写道。“第二，我们将扩大团队规模。我们预计在接下来的几个月里团队会增加两倍以上，这样我们就可以更好地为您服务。最后，我们将增加功能并扩展我们的服务。我们将提供更多的工具，促进更有意义的联系，并将扩大Valence的范围，将我们成员的专业成长和发展包括在内。“。\n这些产品开发中的很大一部分将用于开发有助于职业发展和职业成长的工具。\nValence联合创始人兼前期风险投资普通合伙人科比·富勒(Kobie Fuller)表示：“我们在如何推动黑人社区的经济机会和财富创造方面非常有针对性。”\n据Primus称，Valence目前有1万人注册了该平台，并以每月约20%的速度增长。其目标是向Valence用户提供教育建议和工具，同时向想要雇用他们的公司提供这群有职业意识的黑人专业人士。\nPrimus表示，Valence将出售其数据库，并将访问权限出售给希望在该平台上找到潜在员工的公司，这种模式是按席位许可的，猎头和人力资源部门可以访问这种模式。\n新一轮投资由国际投资公司GGV Capital牵头，其投资包括Slake、peloton、Wish和StockX。投资这些大型交易的董事总经理董汉思(Hans Dong)将加入该公司的董事会。\n这轮融资的其他投资者包括前期风险投资公司，以及Maveron、软银机会基金(SoftBank Opportunity Fund)和硅谷银行(Silicon Valley Bank)。", "note_en": "The timing for the investment is critical as the country reckons with the implications and effects of systemic racism. In no field is the under-representation of Black professionals more deeply felt than the tech industry, where lack of diversity can have profound implications on products and services that are becoming increasingly central to large swaths of the economy.\n Problems with under-representation and underlying issues of systemic racism manifest in facial recognition technologies, social networking applications and decision-making software for lending and credit that are aspects of how American society functions.\n  It’s with an eye toward technology and entrepreneurship that Valence raised its most recent round, according to a letter sent to the company’s users by new chief executive officer Guy Primus.\n “Now that we have the capital that we were seeking, we will be doing three things. First we will improve the current product. We are very proud of what we have built thus far, but we know there are a few issues. We will continue to address those issues and will accelerate work to enhance technical performance on the platform,” Primus wrote. “Second, we will be expanding the team. We expect the team to more than triple in the coming months so that we can better serve you. Finally, we’ll be adding features and expanding our services. We will be delivering additional tools that facilitate even more meaningful connections and will expand Valence’s scope to include the professional growth and development of our members.”\n A lot of that product development will go toward building tools that can help with professional development and career growth.\n “ We’re being very targeted in how we can drive economic opportunity and wealth creation in the black community,” said Valence co-founder and Upfront Ventures general partner Kobie Fuller.\n   Valence currently has 10,000 people signed up for the platform and is growing at about 20% per month, according to Primus. The goal is to serve educational advice and tools to Valence users while at the same time making that group of career-minded Black professionals available to companies that would want to hire them.\n Primus said that Valence will be selling its database and access to companies that would want to find prospective hires on the platform in a per-seat licensing model that would be accessible to headhunters and human resources departments.\n The new investment round was led by  GGV Capital,   the international investment firm whose investments include Slack, Peloton, Wish and StockX. Hans Tung, the managing director who invested in those marquee deals, will be joining the company’s board of directors.\n Other investors in the round include Upfront Ventures, along with Maveron, the SoftBank Opportunity Fund and Silicon Valley Bank.", "posttime": "2020-08-12 02:51:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "增加,site,valence", "title": "\n致力于增加黑人社区经济机会的网站Valence筹集了525万美元", "title_en": "\n\t\t\t\tValence, the site dedicated to increasing economic opportunity for the Black community, raises $5.25 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/11/valence-the-site-dedicated-to-increasing-economic-opportunity-for-the-black-community-raises-5-25-million/", "via": "", "real_tags": ["增加", "site", "valence"]}, {"category": "", "categoryclass": "", "imagename": "e2c2276030e38e722ea94e97936b1275.jpg", "infoid": 1017598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Airbnb可能重新进行IPO的消息为这家房屋共享独角兽公司动荡的一年画上了句号。该公司曾在2019年承诺将于2020年上市。在新冠肺炎到来之前，人们普遍认为该公司正在考虑直接上市，这将摧毁全球旅游市场，并随之而来的是Airbnb的财务健康。\n由于旅行者呆在家里，该公司被迫大幅裁员，并以与2019年末相比看起来相当昂贵的价格吸收了数十亿美元的资本。\n但自从这些打击以来，Airbnb已经开始大肆宣扬其平台使用方面取得的积极进展，以及隐含的财务表现。\n今年6月，Airbnb表示，“在2020年5月17日至6月6日期间，前往Airbnb在美国上市的旅行预订了更多的夜晚。在全球范围内，在最近的周末(6月5日至7日)，我们看到预订额总额“自2月份以来首次”同比增长。\n今年7月，该公司表示，其用户在全球范围内“在一天内预订了价值100多万晚的Airbnb未来住宿”，这是自3月3日以来首次出现这种情况。\n目前尚不清楚Airbnb在财务上到底走了多远。但该公司裁员后的成本基础可能会降低其恢复到接近盈利水平所需的收入基础，这是一个传统的IPO基准，尽管近年来已经失去了光彩。\n随着当地旅游的起飞-因此，航空公司入住率的缓慢提高并不能反映Airbnb的业绩或健康状况-该公司本可以在COVID之后重组其业务，使其在强劲利润率的情况下仍能带来诱人的收入。\n不用说，我是在炒作阅读Airbnb S-1，所以它越早停用，我就越高兴。深入了解这只独角兽在新冠肺炎期间发生了什么，将是一件令人着迷的事情。\nAirbnb加入了DoorDash、Coinbase、Palantir和其他公司的IPO候选名单。更多的是我们拥有的。", "note_en": "The news that Airbnb’s IPO could be back on caps a tumultuous year for the home-sharing unicorn, which  promised in 2019 to go public in 2020. The company was widely tipped to be considering a direct listing before COVID-19 arrived,  crashing the global travel market, and with it, Airbnb’s financial health.\n  As travelers stayed home, the company was forced to  sharply cut staff, and  take on billions in capital at prices that compared to its late 2019-momentum looked rather expensive.\n But since those blows, Airbnb has began to make noise about positive progress regarding its platform usage, and, implicitly, its financial performance.\n In June  Airbnb said that between “May 17 to June 6, 2020, there were more nights booked for travel to Airbnb listings in the US. than during the same time period in 2019” and that “globally, over the most recent weekend (June 5-7), we saw year-over-year growth in gross booking value” for “the first time since February.”\n And in July, the  company that said that its users had “booked more than 1 million nights’ worth of future stays at Airbnb listings” globally in a single day, the first time since March 3rd that that had happened.\n Precisely how far Airbnb has financially clawed its way back is not clear. But the company’s cost basis in the wake of its layoffs could lower the revenue base it needs to recover to reach something akin to profitability, a traditional IPO benchmark though one that has lost luster in recent years.\n And with local travel taking off — slowly-improving  airline occupancy rates are, therefore, not indicative of Airbnb’s performance or health — the company could have retooled its business in the wake of COVID to something that can still put up attractive revenues at strong margins.\n Needless to say I am hype to read the Airbnb S-1, so the sooner it drops the happier I’ll be. Getting an in-depth look at what happened to the unicorn during COVID-19 is going to be fascinating.\n Airbnb joins  DoorDash,  Coinbase,  Palantir, and others on our IPO shortlist. More as we have it.", "posttime": "2020-08-12 02:51:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可能,file,airbnb", "title": "\nAirbnb可能在本月申请上市", "title_en": "\n\t\t\t\tAirbnb could file to go public this month\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/11/airbnb-could-file-to-go-public-this-month/", "via": "", "real_tags": ["可能", "file", "airbnb"]}]