[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1067228, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此站点需要要启用的cookie才能运行。 请确保cookie已打开，然后重新访问所需的页面。 ", "note_en": "This site requires Cookies to be enabled to function. Please ensure Cookies are  turned on and then re-visit the desired page.", "posttime": "2021-06-22 00:47:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "德国,notifiable,cookie", "title": "Covid-19措施对德国其他通知传染病的影响 ", "title_en": "Impact of Covid-19 measures on other notifiable infectious diseases in Germany", "transed": 1, "url": "https://www.thelancet.com/journals/lanepe/article/PIIS2666-7762(21)00080-6/fulltext", "via": "", "real_tags": ["德国", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "c58ce0f3cee8e5f55b759f577332ba1c.png", "infoid": 1067227, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您如何为客户提供更快，更好，更聪明？这是一个简单的：云本机技术，文化和战略。但是你如何开始向云移动组织？这不是那么容易 - 选择许多，风险阴影每决定，而且整个事情的复杂性在前进时会增长。\n 拥有经验丰富的指导可以产生很大的不同。我们一直在帮助我们的各个行业的客户转到云以前以来云本地有一个名字。我们已经蒸馏了我们学会了一本书的课程，云本机转型：创新的实际模式（O'Reilly Media，2020）。\n   我们为自己的书被用作现实生活企业的云本机转型的蓝图。您不需要成为理解它的工程师。它被编写为任何组织正在考虑如何降低风险和在不确定的商业环境中竞争的人的生存工具包。\n 这本书的核心是一个超过70种模式的图书馆，为客户工作的解决方案。模式解决云本机的基本要素：架构，过程，技术和文化。\n  如何使用它们是什么模式，以及HOMELYGRID如何使用它们来绘制自己的云本机之旅。\n  “集装箱解决方案的人认为不同，不要扮演它的安全，似乎在这方面写了很多乐趣，在书的前言中写道，云建筑师和工程师。 “多年来，他们在一些非常有趣的项目上工作，这是一个不寻常的书”。\n     P Ini Reznik，Contains Solutions的首席税务官和联合创始人，是一家开发商和配置经理，他们花了20多年的提高开发过程和缩短市场时间。 \nContract Solutions的首席执行官和联合创始人Jamie Dobson拥有超过20年的开发商和领导者的经验，最近重点关注战略制定和执行。  Gatsby的高级内容营销经理Michelle Gienow是一个以前的内容团队在集装箱解决方案领先。 她是一个Web开发人员和Jamstack倡导者，充满激情对无服务器架构。 ", "note_en": "How do you serve your customers faster, better, smarter? That’s an easy one: with Cloud Native technology, culture, and strategy. But how do you get started in moving your organisation toward the cloud? That’s not so easy—the choices are many, risk shadows every decision, and the complexity of the whole thing grows as you move forward.\n Having an experienced guide can make a big difference. We have been helping our customers in a variety of industries move to the cloud since before Cloud Native had a name. We’ve distilled the lessons we’ve learned into a book,   Cloud Native Transformation: Practical Patterns for Innovation (O’Reilly Media, 2020).\n   We are proud that our book is being used as a blueprint for Cloud Native transformation by real-life enterprises. You don’t need to be an engineer to understand it. It’s written as a survival kit for anyone whose organisation is thinking about how to reduce its risks and stay competitive in an uncertain business environment.\n The book’s centerpiece is a library of more than 70 patterns, solutions that have worked for our clients. The patterns tackle the essential elements of Cloud Native: architecture, process, technology, and culture.\n  What patterns are, how to use them, and how WealthGrid uses them to map its own Cloud Native journey.\n  ‘The people at Container Solutions think differently, don’t play it safe, and seem to have a lot of fun along the way,’ writes Adrian Cockcroft, noted cloud architect and engineer, in the book’s Foreword.  ‘They’ve worked on some very interesting projects over the years, and this is an unusual book’.\n     P ini Reznik,  chief revenue officer and co-founder of Container Solutions, is a developer and configuration manager who’s spent more than 20 years improving development processes and shortening time to market.\n Jamie Dobson, chief executive officer and co-founder of Container Solutions, has more than 20 years’ experience as a developer and a leader, focusing most recently on strategy formulation and execution.\n    Michelle Gienow, senior content marketing manager at Gatsby, is a former content team lead at Container Solutions. She’s a web developer and JAMstack advocate with a passion for serverless architecture.", "posttime": "2021-06-22 00:47:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,云本,cloud,模式", "title": "免费云本机转换o'reilly书 ", "title_en": "Free Cloud Native Transformation O’Reilly Book", "transed": 1, "url": "https://info.container-solutions.com/cloud-native-transformation-oreillly-book", "via": "", "real_tags": ["免费", "云本", "cloud", "模式"]}, {"category": "", "categoryclass": "", "imagename": "5d51e7954d251bef732fcb25c42a4e0d.png", "infoid": 1067226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由Lars设计的新“保存...”图标•Upstall。 与他们在Dribbble上连接; 设计师和创造性专业人士的全球社会。 ", "note_en": "the new “save …” icon designed by lars • upstruct. Connect with them on Dribbble; the global community for designers and creative professionals.", "posttime": "2021-06-22 00:42:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "保存,save,设计", "title": "新的“保存”图标 ", "title_en": "The New “Save ” Icon", "transed": 1, "url": "https://dribbble.com/shots/1747652-the-new-save-icon", "via": "", "real_tags": ["保存", "save", "设计"]}, {"category": "", "categoryclass": "", "imagename": "eeff386b6bf63f552aaa971bb10fec8b.jpg", "infoid": 1067225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲＆＃39;最高空间官员周一表示，确保在2022年进行Ariane 6 Rocket的第一次发射是一个非常高的优先级。\n ＆＃34;这对我来说是一个顶级，首要任务，＆＃34;欧洲航天局总干事Josef Aschbacher在巴黎航空论坛上表示。 ＆＃34; Ariane 6是我们最重要的发射器。我们必须尽快将所有能量和所有重点放在使少女飞行中。\n 与法国空间局，CNES和Ariane 6＆＃39; Aschbacher的主要承包商，Ariane Group，Aschbacher表示，他已经放了＆＃34;一个小组＆＃34;共同对Ariane 6 Rocket的最终开发阶段进行了独立评估。这项工作队的目标是确保欧洲尽一切推动所需的一切。\n  ＆＃34;这是我们需要一起工作的巨大挑战，＆＃34; aschbacher说。 ＆＃34;因为Don＆＃39; t忘了我们在一起。＆＃34;\n 参考AN＆＃34;按时＆＃34; Aschbacher在欧洲空间局之前说，阿什巴赫说他的意思是，在10月或11月举行的欧洲航天局和部长级会议。这是一个高级会议，其中每个成员国的代表集中在举办政策。欧洲航天局＆＃39;在成员国以不同的金额提供预算。\n    ＆＃34;这是必须的，＆＃34; Aschbacher在2022年会议之前发布了，而＃34则会出现推出;因为我们需要好消息，并良好的成功，为我们的政客看到欧洲表演，欧洲提供的，因此值得投资部长级会议。＆ ＃34;\n Ariane 6 Rocket是一种沉重的车辆，用于取代古老的欧洲Ariane 5火箭。虽然它是不可用的，但欧洲官员打算为Ariane 6提供比其前身更低的发射成本，从而与Spacex＆＃39; S Falcon 9火箭更竞争。然而，欧洲的一些批评者表示，新的火箭不足以挑战重复使用的猎鹰9，这对世界各地的发射成本施加了下行压力。 \n自2014年以来，Ariane Group及其合同合作伙伴一直在正式设计和建造Ariane 6 Rocket，当时部长级理事会同意其发展。 最初，这枚火箭应该在2020年推出。然而，去年11月，欧洲官员表示，他们现在定位了4月2022年6月的第一个Ariane 6飞行。 他们引用了技术问题和全球Covid-19大流行，影响了欧洲的开发设施和火箭队的开发设施活动和法国圭亚那的发射场。  然而，从Aschbacher的评论表明Ariane 6在2022年上半年开始的目标是在启动的目标中。相反，它听起来将在明年年底之前进行发布日期。 ", "note_en": "Europe&#39;s top space official said Monday that ensuring the first launch of the Ariane 6 rocket takes place in 2022 is a very high priority.\n &#34;This for me is a top, top priority,&#34; said Josef Aschbacher, director general of the European Space Agency, at  the Paris Air Forum. &#34;Ariane 6 is our most important launcher to come. We have to put all the energy and all the emphasis into making the maiden flight as soon as possible.\n Together with the leaders of the French space agency, CNES, and the Ariane 6&#39;s prime contractor, Ariane Group, Aschbacher said he had put &#34;a small group&#34; together to make an independent assessment of the schedule for the final development phase of the Ariane 6 rocket. The goal of this task force will be to ensure that Europe does everything it needs to do launch on time.\n  &#34;This is a huge challenge that we need to work together on,&#34; Aschbacher said. &#34;Because don&#39;t forget we are in this together.&#34;\n In referring to an &#34;on time&#34; launch, Aschbacher said he meant next year, before the European Space Agency&#39;s Ministerial Council meeting that is typically held in October or November. This is a high-level meeting where representatives from each member nation of the space agency gather to set policy. The European Space Agency&#39;s budget is provided, in varying amounts, by member nations.\n    &#34;This is a must,&#34; Aschbacher said of launching before the 2022 meeting, &#34;because we need good news, and good success, for our politicians to see that Europe performs, that Europe delivers, and therefore it is worth investing in space in the ministerial conference.&#34;\n The Ariane 6 rocket is a heavy-lift vehicle being developed to replace the venerable European Ariane 5 rocket. Although it is not reusable, European officials intend for Ariane 6 to have a lower launch cost than its predecessor and thus to be more competitive with SpaceX&#39;s Falcon 9 rocket.  Some critics in Europe, however, have said the new rocket does not go far enough to challenge the reusable Falcon 9, which has put downward pressure on launch costs around the world.\n Ariane Group and its contracting partners have been formally designing and building the Ariane 6 rocket since 2014, when the Ministerial Council agreed upon its development. Originally, this rocket was supposed to launch in 2020. Last November, however,  European officials said they were now targeting the period of April through June 2022 for the first Ariane 6 flight. They cited both technical issues and the global COVID-19 pandemic that affected activities at development facilities in Europe and the rocket&#39;s launch site in French Guiana.\n The comments from Aschbacher, however, suggest that Ariane 6 is no longer on target to launch during the first half of 2022. Rather, it sounds like it will be a struggle to make a launch date before the end of next year.", "posttime": "2021-06-22 00:06:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "欧洲,debut", "title": "Ariane 6首次亮相又在欧洲希望推出2022年代迟到的时候再次滑倒 ", "title_en": "The Ariane 6 debut is slipping again as Europe hopes for a late 2022 launch", "transed": 1, "url": "https://arstechnica.com/science/2021/06/europes-space-chief-appoints-task-force-to-assess-ariane-6-schedule-concerns/", "via": "", "real_tags": ["欧洲", "debut"]}, {"category": "", "categoryclass": "", "imagename": "ccaa6543f038be0a35d2d85a1852bb14.jpeg", "infoid": 1067224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所谓的“黑色真菌”感染在印度在Covid-19的毁灭性浪潮之后在印度汹涌澎湃。罕见但毁灭性的感染可以摧毁眼睛并传播到大脑。\n 现在案件是前31,000前31,000人，从上个月估计到几十个案件。媒体报道已经超过了2100多名死亡人员，但联邦卫生当局没有发布官方死亡计数。\n 过去的医学评论估计真菌感染 - 粘膜霉菌 - 的总体死亡率约为50％。然而，死亡率因患者的潜在病症而变化，身体的哪一部分粘液菌受到真菌侵入。感染可以持有胃肠道，皮肤破裂，肺和血液。\n 在印度，真菌似乎主要在鼻子和鼻窦中扎根，在那里他们可以传播到面部骨骼，眼睛，甚至是大脑。一旦建立感染，它可以迅速变得侵略性并导致组织死亡。如果它蔓延到眼睛，很多患者最终会永久性失去视力，在某些情况下，需要完全被移除以保持感染蔓延。\n    粘液是一种普遍存在的一组霉菌，它们通常只会攻击免疫染色患者，例如患有糖尿病的患者。土壤 - 潜伏的模具爱酸性条件，使患有糖尿病酮症病的患者 - 一种复杂性，其中血液变得酸性 - 特别易受伤害。\n 医学专家假设印度粘膜霉病的目前潮流是与Covid-19波有关的因素的汇合。在恢复或最近从Covid-19恢复的人中发生了许多案件。在健康危机中，卫生疾病的结合，该国大量患有糖尿病的人 - 特别是不受控制的糖尿病 - 以及对糖皮质激素类固醇的过度依赖似乎在真菌流行病中发挥作用。类固醇用途可以帮助治疗Covid-19，但它也可以夯实免疫反应，使人们容易受到机会主义感染，如粘膜霉菌素。\n 真菌感染专家称为“三重鞭子”的情况，如前所述。 \n最近几天，由于真菌感染，宣布流行病的地方政府，当地政府，对粘膜病理治疗的黑市销售，媒体报道，印度出于印度的媒体报道已经注意到手术删除的孩子。 ", "note_en": "So-called “black fungus” infections are surging in India in the wake of a devastating wave of COVID-19. The rare but devastating infection can destroy the eyes and spread to the brain.\n Cases now top 31,000, rising from an estimate of dozens to a few hundred cases just last month. Media reports have tallied  over 2,100 deaths, but federal health authorities have not released an official death count.\n Past medical reviews have estimated that the fungal infection—mucormycosis—has an overall fatality rate of around 50 percent. However, mortality rates vary by patients’ underlying condition and what part of the body the mucormycetes fungi invade. Infection can take hold in the gastrointestinal tract, skin breaks, lungs, and the blood.\n In India, the fungi appear to be mainly taking root in the nose and sinuses, where they can spread to facial bones, eyes, and even the brain. Once an infection is established, it can quickly become aggressive and lead to tissue death. If it spreads to the eye, many patients end up permanently losing vision and, in some cases, need to have their eye entirely removed to keep the infection from spreading.\n    Mucormycetes are a ubiquitous group of molds, and they typically only strike immunocompromised patients, such as those with diabetes. The soil-lurking molds love acidic conditions, making patients with  diabetic ketoacidosis—a complication in which the blood becomes acidic—particularly vulnerable.\n Medical experts hypothesize that the current surge of mucormycosis in India is down to a confluence of factors related to the COVID-19 wave. Many of the cases are occurring in people who are recovering or have recently recovered from COVID-19. The combination of poor hygiene amid the health crisis, the country’s large number of people with diabetes—particularly uncontrolled diabetes—and  an over-reliance on glucocorticoid steroids appear to be playing a role in the fungal epidemic. Steroid use can help treat COVID-19, but it can also tamp down immune responses and make people vulnerable to opportunistic infections, such as mucormycosis.\n An expert in fungal infections referred to the situation as “ triple whammy,” as Ars reported previously.\n In recent days, media reports out of India have noted  children having their eyes surgically removed because of fungal infections, local governments  declaring epidemics, and  black-market sales of treatments for mucormycosis.", "posttime": "2021-06-22 00:06:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "破坏,destroying,感染", "title": "眼球破坏“黑色真菌”案件飙升到印度超过30,000辆 ", "title_en": "Eyeball-destroying “black fungus” cases spike to over 30,000 in India", "transed": 1, "url": "https://arstechnica.com/science/2021/06/eyeball-destroying-black-fungus-cases-spike-to-over-30000-in-india/", "via": "", "real_tags": ["破坏", "感染"]}, {"category": "", "categoryclass": "", "imagename": "2969f5f8a5b4df805cd6bb20bfbbfc55.jpg", "infoid": 1067223, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来已经出现了几年的组织使飞跃更容易。例如，我在2018年推出的爱国者训练营，在起始的最早的日子里工作，帮助退伍军人创始人了解建立公司和筹款的关键技能。然而，仍然缺乏网络和资金，特别针对这群企业家。\n 这就是学院投资者网络两家管理合作伙伴的艾米丽麦克马和谢尔曼威廉姆斯的机会，在美国服务学院观察了他们的同龄人。该公司针对5000万美元的最终第一基金，今天宣布了锚的投资者，保险和金融服务提供商USAA的收盘，该公司将投资250万美元。在USAA之前，该基金的第一个投资者是Scout Ventures，它侧重于Frontier Tech，麦克马班是风险伙伴的地方。\n  麦克马甘山于2001年毕业于西点，因为对恐怖战争开始。我说，我真的直接进入了9/11的行动，“她说。从那里，在建立国会邮政之前，她枢转了一个针对联邦市场的创业公司，该职位向退伍军人及其配偶教导了企业家技能，并在2019年折叠到弗吉尼亚州北部北部的合作空间。\n “我的职业生涯一直专注于社区，与企业家合作，真的有点利用老兵企业家社区的能源，”她说。她位于DC，也坐落在爱国训练营的董事会。\n  与此同时，威廉姆斯从海军学院欢呼，2003年毕业于伊拉克战争中的四次部署前，在毕业前几周开始。他最终在芝加哥的展位学校结束，在那里他研究了金融，并将他的职业生涯归功于专注于M＆amp的投资银行业; a。 “我知道我需要学习很多，”他说。我“开始投资和建议初创企业，然后成为银行家，然后使得翻转与艾米莉一起开始冒险冒险。”他是在纽约市。\n 该公司的第一次前往企业正在建立由五名服务学院的明矾组成的投资联合，该学院于2020年6月推出。“我们有宇航员，我们有海军密封，”麦克马甘山说。 “我们真的认为我们非常稳定为一个团体，因为我们都在活跃职责上生活，现在我们继续看到它并继续服务。”自从发射以来，该联合会投资了少数交易，包括博尔科，包括地方政府的在线社区参与平台和在线身份服务ID.ME.\n “这也是我们的许多服务学院毕业生在该桌子上有一个座位，并帮助这些公司的座位，连接，雇用所有这些东西，”麦克马班说。 “所以我们真的很高兴与一些其他机构相提并论 - 哈佛大学，斯坦福 - 也有这些类型的辛迪加斯。” \n威廉姆斯表示，在转向更传统的VC基金模型之前，俱乐部的目标是为公司的投资流程进行了锻炼。他们在1月开始筹款。\n 新基金有一个双轨投资于跨行业的退伍军人，同时选择初创公司，建立对私营部门和政府有用的“两用”技术。 “公民技术，灾难技术 - 认为Fema  -  Defense Tech，显然是军事，情报机构和空间技术。威廉姆斯将影响成分和政府的气候及其周围地区的事物，“他认为他认为公司投资的例子。 “我们希望公司，当它实现成熟时，实现政府以外的大部分收入。”\n 该公司在产品 - 市场契合之后围绕舞台的投资，虽然退伍军人管道可以是真正的手套，但威廉姆斯表示，该公司将在那里选择性地投资于种子前阶段。\n 该公司还在寻求多元化风险资本家和创始人的行列。 McMahan说：“我是一个女性，谢尔曼是一个非洲裔美国，你知道，即使在军队中，我们也是一个独特的团队，所以我们认为我们也能够伸向一个更广泛的经纪人的观众少数民族，妇女和团体，我们觉得我们对作为一支球队的方面非常有吸引力。“\n 鉴于金融服务公司专注于积极服务成员和退伍军人，USAA的锚投资可能并不令人惊讶。它使退伍军人创业的其他投资和赞助，包括进入爱国者训练营。该公司还直接投资于初创公司，如PrecisionHawk和Coinbase。 ", "note_en": "A couple of organizations have popped up over the years to make the leap easier. For instance,  Patriot Boot Camp, which  I profiled back in 2018, works in the earliest days of the startup journey to help veteran founders learn the key skills of building a company and fundraising. Yet, there still remains a lack of networking and funding that particularly targeted this group of entrepreneurs.\n That’s the opportunity that Emily McMahan and Sherman Williams, the two managing partners of  Academy Investor Network, saw when looking at their peers at the five U.S. service academies. The firm is targeting a final first fund of $50 million, and today announced the close of its anchor investor, insurance and financial services provider USAA, which will invest $2.5 million. Prior to USAA, the fund’s first investor was  Scout Ventures, which focuses on frontier tech and  where McMahan is a venture partner.\n  McMahan graduated from West Point in 2001 right as the War on Terror began. I “went really straight into the action post 9/11,” she said. From there, she pivoted into a startup targeting the federal market, before founding Capitol Post, which taught entrepreneurial skills to veterans and their spouses and also had a co-working space in northern Virginia  before folding into Bunker Labs in 2019.\n “My career has always been focused around community, working with entrepreneurs, and really kind of harnessing the energy of the veteran entrepreneur community,” she said. She is based in DC, and also sits on the board of Patriot Boot Camp.\n  Meanwhile, Williams hails from the Naval Academy, graduating in 2003 before going on four deployments in the midst of the war in Iraq, which started just weeks before his graduation. He ultimately ended up at Chicago’s Booth School, where he studied finance and pivoted his career into investment banking focused on M&amp;A. “I knew I needed to learn a lot,” he said. I “started investing and advising startups while as a banker, and then made made the flip to work with Emily to start AIN Ventures.” He’s based in New York City.\n The firm’s first foray into venture was building an investment syndicate composed of alums of the five service academies, which was launched in June 2020. “We’ve got astronauts, we’ve got Navy SEALs,” McMahan said. “We really think that we’re very well positioned as a group, because we’ve all lived it on active duty, and now we continue to see it and continue to serve.” The syndicate has invested in a handful of deals since launching, including into  Polco, an online community engagement platform for local governments, and online identity service  ID.Me.\n “This is also where a lot of our service academy grads are excited to have a seat at that table and help these companies scale, connect, hire, all of those things,” McMahan said. “So we’re really excited to be on par with some of these other institutions — the Harvards, the Stanfords — who also have these types of syndicates.“\n Williams said the goal with the syndicate was to work out the investment processes for the firm before turning toward a more traditional VC fund model. They kicked off fundraising in January.\n The new fund has a two-track thesis of investing in veterans across industries while also selecting startups building “dual-use” technologies that are useful to the private sector and governments. “Civic technology, disaster tech — think FEMA — defense tech, obviously the military, intelligence agencies, and space tech. Things in and around climate that will affect constituents and governments,” Williams said as examples where he sees the firm investing. “We want the company, when it achieves maturity, to achieve the majority of the revenue outside the government.”\n The firm centers its investing around the stage right after product-market fit, although since the veterans pipeline can be a real gauntlet, Williams said the firm will selectively invest at the pre-seed stage there.\n The firm is also seeking to diversify the ranks of both venture capitalists and founders. McMahan said, “I’m a female, Sherman’s an African American, you know, even in the military, we’re sort of a unique team, and so we think we are also able to reach out to a much broader audience of underrepresented minorities, women, and groups, and we feel like we’re pretty attractive in terms of that as a team.“\n USAA’s anchor investment is perhaps not surprising given the financial services company’s focus on active service members and veterans. It has made other investments and sponsorships around veteran entrepreneurship, including into Patriot Boot Camp. The company has also invested directly in startups such as PrecisionHawk and Coinbase.", "posttime": "2021-06-22 00:05:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "学院,harvard", "title": "军方学院可以与斯坦福和哈佛竞技吗？ 两位退伍军人筹集50米才能找到 ", "title_en": "\n\t\t\t\tCan the military academies compete with Stanford and Harvard in venture? Two veterans are raising $50M to find out\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/academy-investor-network-usaa/", "via": "", "real_tags": ["学院", "harvard"]}, {"category": "", "categoryclass": "", "imagename": "803d69c9a961cf90d91c4bafbd0ec15a.jpeg", "infoid": 1067222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于许多专业人士来说，夏威夷似乎是遥远工作的梦想场所。但在Aloha State中脱离遥控工作需要超过一架飞机票和笔记本电脑。\n  大流行破坏了国家的经济。根据夏威夷旅游局，访客抵达2019年8月至8月在次年之间下降了97.6％。据PEW中心称，在州康乐及酒店部门的就业人员占近五个就业岗位的近一份工作岗位，下降了53％。\n  部分归功于国家举措 - 包括抵达前的冠状病毒检测，参观者和营销活动求追求偏远工人 - 旅游正在反弹。 4月份，游客达到近50万，而4月20日4500年。\n  一个程序，称为搬运工和Shakas（以伴随着拇指和小指的友好Y形手势命名，意思是“挂松”），于12月推出，与当地商业领袖。它为偏远工人提供免费一公式，他们承诺至少一个月并参加志愿者活动。该计划的50个斑点吸引了90,000个应用程序。第二轮申请将于本月开放。\n  就像其他地方一样，可靠的Wi-Fi是Litmus测试的许多。夏威夷群岛的一些地区，特别是农村地区，缺乏强大的宽带或蜂窝基础设施。 Tomasz Janczuk是一家位于拥有软件开发公司的西雅图地区45岁的西雅图地区，选择了他和他的家人的三个大岛酒店，基于Wi-Fi强度。\n  您将收取$ +税（如果适用）为华尔街日记。您可以随时在客户中心的任何时间更改帐单偏好或致电客户服务。您将在率或条款的任何变化提前通知您。您可以随时通过调用客户服务来取消订阅。 ", "note_en": "For many professionals, Hawaii seems a dream spot for remote work. But pulling off remote work in the Aloha state takes more than a plane ticket and a laptop.\n  The pandemic devastated the state’s economy. According to the Hawaii Tourism Authority, visitor arrivals fell 97.6% between August 2019 and August the following year. Employment in the state’s leisure and hospitality sector, which accounts for nearly one in five jobs, fell 53% between February and August 2020, according to the Pew Center.\n  Thanks in part to state initiatives—including pre-arrival coronavirus testing for visitors and marketing campaigns wooing remote workers—tourism is on the rebound. In April, visitors reached nearly 500,000, compared with roughly 4,500 in April 2020.\n  One program, called  Movers and Shakas (named after the friendly Y-shaped hand gesture with extended thumb and pinkie that means “hang loose”), was launched in December with local business leaders. It offers free airfare to remote workers who commit to staying at least a month and participate in volunteer activities. The program’s 50 spots attracted 90,000 applications. Applications for the second round will open this month.\n  As it is elsewhere, reliable Wi-Fi is the litmus test for many. Some areas of the Hawaiian islands, especially rural regions, lack robust broadband or cellular infrastructure. Tomasz Janczuk, a 45-year-old based in the Seattle area who owns and operates a software-development firm, chose the three Big Island hotels that he and his family lived in for a month based on Wi-Fi strength.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-06-21 23:59:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发现,remote,地区", "title": "夏威夷的偏远工人发现挑战和奖励 ", "title_en": "Hawaii's Remote Workers Discover Challenges and Rewards", "transed": 1, "url": "https://www.wsj.com/articles/hawaiis-remote-workers-discover-challenges-and-rewards-11624190419", "via": "", "real_tags": ["发现", "remote", "地区"]}, {"category": "", "categoryclass": "", "imagename": "30060724b3bdb3bcb33a324606ba8015.jpg", "infoid": 1067221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您认为播客空间很拥挤，请为Facebook进入现场，为一名球员做好准备。今天宣布，Facebook推出了自己的播客服务，以与其他主要球员竞争。 Facebook注意到播客的流行度过和决定跳入的时候只是一个时间问题。\n 除了播客之外，Facebook还将提供会员访问名为“Live Audio Rooms”的现场音频服务。 Facebook最初于2021年4月宣布这些服务。\n   根据Facebook，任何一个是Facebook成员的人都可以轻松地在瞬间创建播客。但是，播客服务仅被推出到目前的选择。在2021年夏季晚些时候，它将可用。\n 现场音频室与Clubhouse和Twitter空间类似。我目前在Android上拥有更新的Facebook应用程序，并且可以测试实时音频室选项。在房间里，我有能力邀请任何人进入唯一的音频会话，或者我可以随时将其切换到实时视频。或者我可以提供给我房间的链接，允许任何人加入。到目前为止，我已经用少数问题和一些不喜欢Facebook的人的问题测试了这一点，它没有搭便车。\n 您可以在您希望启用Visaunt室会话开始时安排。这些会议最多可容纳50名发言者和无限制的倾听者。您还可以收集捐款，在现场音频室会议期间会出现。当人们试图为有价值的事件筹集捐款时，这将是处理的。使用Clubhouse和Twitter Spaces已经在那里，看看人们是否最终会利用Facebook的工具，这将是有趣的。\n  虽然这一切都声音正面，但这也是一个缺点：它们可能会在不再可用或删除后保留现场音频。这是为了强制执行其策略，这将由人类主持人和机器学习进行。我可以理解这一点，特别是如果这是为了帮助解决犯罪或其他讨厌的东西。与此同时，这是将Facebook进入热水的那种东西，一遍又一遍。与此同时，我不会仅在Facebook上指出手指，因为我相信Twitter和Clubhouse，要参加一些，有类似的政策。\n  Podcasting和Live音频室仅通过Apple IOS和Google Android可用，至少现在。 \n所以你有它，另一个选择播客和音频室的选项。 ", "note_en": "If you thought the podcasting space was crowded, get ready for one more player as Facebook has entered the scene. Announced today, Facebook has launched its own podcasting service to compete against the other major players. It was only a matter of time before Facebook took notice of how popular podcasting has become and decided to jump in.\n In addition to podcasting, Facebook will also offer members access to a live audio service called “ Live Audio Rooms.” Facebook originally announced these services back in  April 2021.\n   According to Facebook, anyone who’s a member of Facebook can easily create a podcast in moments. However, the podcast service is only being rolled out to a select few currently. It will be made available to everyone else later during Summer 2021.\n The Live Audio Room is similar to that of  Clubhouse and  Twitter Spaces. I currently have the updated Facebook app on Android, and the Live Audio Room option was available to test. In the room, I had the ability to invite anyone to an audio-only session, or I could switch it to live video whenever I wanted. Or I could provide a link to my room, allowing anyone to join. So far I’ve tested this with a handful of issues and outside of some of those people not liking Facebook, it worked without a hitch.\n You can schedule when you want the Live Audio Room session to start. These sessions can hold up to 50 speakers and unlimited listeners. You can also collect donations, which will show up during the Live Audio Room session. This will be handle when people are trying to raise donations for worthwhile events. With Clubhouse and Twitter Spaces already out there, it will be interesting to see if people will end up utilizing Facebook’s tools.\n  While this all sounds positive, there’s also a downside to this: they may retain live audio after it is no longer available or deleted. This is to enforce its policies, which will be done both by human moderators and machine learning. I can understand this, especially if this is to help to solve crimes or other nasty things. At the same time, this is the sort of stuff that got Facebook into hot water, over and over. At the same time, I’m not going to point the finger solely at Facebook as I’m sure Twitter and Clubhouse, to name a few, have similar policies.\n  The podcasting and Live Audio Rooms are only available via  Apple iOS and  Google Android, at least for now.\n So there you have it, another option for both your podcasting and audio room gathers.", "posttime": "2021-06-21 23:58:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,播客,推出,launches", "title": "Facebook推出播客和现场音频室服务 ", "title_en": "Facebook Launches Podcast and Live Audio Room Services", "transed": 1, "url": "https://www.theouterhaven.net/2021/06/facebook-launches-podcast-and-live-audio-room-services/", "via": "", "real_tags": ["facebook", "播客", "推出", "launches"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067220, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Git是一种具有强大的潜在原则的版本控制系统，但新手用户令人害怕。当他们犯错时，许多人宁愿删除并重新克隆存储库，而不是尝试解决它。即使是熟练的用户也可以发现通过繁琐的回归。\n 为什么？在一个应该永远不会失去数据的系统中，如何易于“丢失”数据如何？\n 嗯，这并不是太容易失去你的数据 - 而是恢复它太难了。对于您要恢复的每个操作，有一个不同的“魔法”咒语来撤消它。所有数据都在原则上仍然存在，但在实践中也无法访问。\n 这是我的理论：如果他们不怕犯错误，新手和中间用户将显着提高他们的理解和功效。\n  为了解决这个问题，我提供git撤消，部分git-bancless of工具套件。据我所知，这是目前可用于Git的最有能力的撤消工具。例如，它可以轻松撤消糟糕的合并和重新组播，并且甚至有一些罕见的操作，Git撤消可以撤消，它无法与Git Rhallog撤消。\n 我在下面提出了演示，并简要讨论了物品末尾的实施。我的希望是，通过使其更容易解决错误，新手Git用户将能够更自由地进行实验，并更有效地学习。\n     Git撤消通过最近添加到Git：参考交易钩子。这钩子触发了更改的参考，例如分支。通过录制所有参考移动，我们可以在任何前一点的时间内重建提交图的状态。然后，我们通过将所有引用及时恢复到其先前的位置（可能在过程中创建或删除引用）来完成撤消操作。 \n我最初建立了Git-Brancless，以便复制某种Mercurial工作流程，但数据结构变为灵活，足以为我们提供Git撤消功能。 您可以在项目的架构页面上找到更多详细信息。 ", "note_en": "Git is a version control system with robust underlying principles, and yet, novice users are terrified of it. When they make a mistake, many would rather delete and re-clone the repository than try to fix it. Even proficient users can find wading through the reflog tedious.\n Why? How is it so easy to “lose” your data in a system that’s supposed to never lose your data?\n Well, it’s not that it’s too easy to lose your data — but rather, that it’s too difficult to recover it. For each operation you want to recover from, there’s a different “magic” incantation to undo it. All the data is still there in principle, but it’s not accessible to many in practice.\n Here’s my theory: novice and intermediate users would significantly improve their understanding and efficacy with Git if they weren’t afraid of making mistakes.\n  To address this problem, I offer  git undo,  part of the git-branchless suite of tools. To my knowledge, this is the most capable undo tool currently available for Git. For example, it can undo bad merges and rebases with ease, and there are even some rare operations that  git undo can undo  which can’t be undone with  git reflog.\n I’ve presented demos below, and briefly discussed the implementation at the end of the article. My hope is that by making it easier to fix mistakes, novice Git users will be able to experiment more freely and learn more effectively.\n     git undo is made possible by a recent addition to Git: the  reference-transaction hook. This hook triggers whenever a change is made to a reference, such as a branch. By recording all reference moves, we can rebuild the state of the commit graph at any previous point in time. Then we accomplish the undo operation by restoring all references to their previous positions in time (possibly creating or deleting references in the process).\n I originally built  git-branchless in order to replicate a certain Mercurial workflow, but the data structures turn out to be flexible enough to give us a  git undo feature nearly for free. You can find more detail at the  Architecture page for the project.", "posttime": "2021-06-21 23:58:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "撤消,git", "title": "git撤消：我们可以做得更好 ", "title_en": "Git undo: We can do better", "transed": 1, "url": "https://blog.waleedkhan.name/git-undo/", "via": "", "real_tags": ["撤消", "git"]}, {"category": "", "categoryclass": "", "imagename": "f81c94c5e9a9cb2ddedeb20869d59f33.jpg", "infoid": 1067219, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ben Higgins是一个杰出的软件工程师，网络安全公司索引，在协议，解析，加密，安全，系统和性能工程方面拥有丰富的经验。\n  网络行政订单的一个关键要素是“软件资料清单”（SBOM），供应商将被要求作为联邦采购过程的一部分提供。 SBOM将详细介绍在给定产品中使用的精确软件组件，包括任何开源组件，使联邦机构更容易更快，以确定它们是否受到其中一个组件中未覆盖的漏洞。\n SBOM是支持联邦网络安全的重要一步，但这还不够。了解各种产品中包含的软件组件将有助于机构安全团队在漏洞亮起时更快地反应，但在其他场景中，如SolarWinds风格的供应链攻击，偷偷摸摸地插入软件组件，其影响是有限的。\n   这就是为什么拜登政府应延长网络行政命令，不仅包括SBOM，还包括“行为透明度”。\n 透明度要求不是技术中的新概念。证书透明度（CT）是任何公共证书颁发机构（CA）发出的所有证书的公共分类帐，该公式授权（CA）提供了一个监控和审核CA活动的框架，而Apple最近宣布的应用程序跟踪透明度允许用户查看什么活动应用程序跟踪和选择出去。行为透明度是本概念的建议应用于已知的软件行为。\n 行为透明度框架的目的是枚举给定软件的预期动作将在设备上或网络上采用。这有助于安全分析师区分预期的噪音和妥协迹象。反过来，这可以使安全团队在任何专有或开源软件中识别未知漏洞的利用。\n 好消息是，普通软件行为的列举已经是外部网络活动的标准行业实践。大多数主要的软件供应商，包括Meraki，McAfee，Tenable，Logmein / GotoMeeting，以及我自己的公司，extrahop，已经发布了普通产品行为列表。即使是SolarWinds也有文档描述了其网络行为。 \n但拜登政府可以帮助改善这一行业实践，提高公共和私人组织的整体安全姿势的关键变化。\n  首先，网络执行命令应与代表软件和安全软件供应商合作，以及斜切等组织，为必须包括全行为透明度必须包括的网络活动类型的标准。\n 至少，这应该包括外部网络目的地，与其他软件组件的内部网络连接行为等内容，以及适用的相关网络端口列表以及使用这些端口的目的。行为透明度框架还应包括其他网络行为，尤其是看起来像扫描或侦察行为的任何东西。\n  其次，Cyber​​ Evence Order应该要求已知的软件行为以机器可读格式发布，例如JSON或CSV，可以摄取到安全信息和事件管理（SIEM），防火墙，端点保护平台，网络等公共安全产品检测和响应，以及更改管理工具。\n  这是来自当前模型的至关重要，其中大多数行为都在网页上列出，或者在没有机器可读的PDF中列出。通过这种变化，常见的安全工具可以使用该机器可读的行为数据来帮助构建组织内的活动的基线，以更快，准确地检测表明妥协的偏差。 Meraki已经通过CSV格式提供了它的列表来实现这一目标。\n  第三，网络执行命令应建立由网络安全和基础设施安全机构或其他适当联邦机构管理的行为透明度数据的清算室。状态QUO是在供应商的网站上寻找周围，请咨询其内部文档或开立支持案例，以了解网络行为。如果提供的信息不正确，那也是一个支持案例。\n 目前的分散方法深刻有问题。对企业软件产品的无限网络访问引入了大量的安全风险 - 已建立零信任框架，以防止这一点 - 但典型的从业者没有时间或专业知识来单独追踪他们所拥有的每件企业软件的预期行为环境。如果没有集中访问行为透明度数据，即使是最好的零信任实现也将具有围绕企业软件的主要间隙。 \n清算箱将为行为透明度数据提供集中式存储库，由公司，产品和产品版本组织。像Github这样的论坛是这种清算室的理想机制，为此提供了广泛使用的集中式存储库。\n  第四，清算室应包括产品用户可以轻松为软件供应商提供反馈的机制。反馈可以采用问题的形式甚至提取请求，尽管这些公司应该参与批准变更。这样，行为中的缺陷可以在公共论坛中指出。大多数缺陷都是原因，如不反映在行为透明度数据中的产品更新，但随着时间的推移，公司理想地使其成为一种练习，以确保它们保持最新。但也会发现真正的积极因素。\n  Solarwinds软件供应链攻击，首次在2020年12月公开，说明了行为透明度的重要性。在12月11日之前，当Fireeye首先确定了Solarwinds Orion软件中的漏洞时，至少两个其他网络安全公司，Palo Alto和Fidelis，发现他们的Solarwinds安装与攻击者控制的“阶段1”AVSVMCloud [。] COM域。 Palo Alto观察并阻止了额外的恶意行为，但在既未确定与AVSVMCLOUD [。]本身的通信是可疑的。这在很大程度上到了涉及查看网络数据的臭名昭着的“噪声”。\n 但是，如果更多组织可以准备好访问Solarwinds的行为透明度数据，以及一个与基线与基线的偏差进行比较的论坛，事情可能会出现不同的方式。\n Solarwinds Orion没有达到大量的外部目的地，因此当供应链攻击的第一阶段开始击中“Appsync-Api.eu-West-1.avsVMCloud [。] Com的子域，分析师运行Siem查询的威胁狩猎，或者基于机器学习的EDR或NDR产品，可能会更快地确定某些事情是不保证的。\n 同样，低摩擦的公共反馈机制可以倾斜太阳能线和行业，即似乎是孤立的噪音（“Appsync-API，似乎合法的似乎是呢？”）实际上是更令人邪恶的东西。\n 与俄罗斯的制裁同时，网络行政顺序是强烈的早期迹象表明，拜登政府打算对网络安全采取更积极主动的方法。对这些努力的成功至关重要，将与私营部门技术提供者合作。在联邦级别建立关于软件产品的披露标准将使私营部门的网络安全，以及提高软件供应链的整体安全性。 ", "note_en": "Ben Higgins is a distinguished software engineer at cybersecurity company  ExtraHop and has extensive experience in protocols, parsing, encryption, security, systems and performance engineering.\n  One key element of the cyber executive order is a “software bill of materials” (SBOM) that vendors would be required to provide as part of the federal procurement process. The SBOM would detail the exact software components utilized in a given product, including any open-source components, making it much easier and faster for federal agencies to determine whether they are subject to a vulnerability uncovered in one of these components.\n The SBOM is an important step in shoring up federal cybersecurity, but it’s not enough. Understanding the software components included in various products will help agency security teams react more quickly when vulnerabilities come to light, but in other scenarios, like SolarWinds-style supply-chain attacks that surreptitiously insert software components, its impact is limited.\n   That’s why the Biden administration should extend the cyber executive order to include not only an SBOM, but also “behavior transparency.”\n Transparency requirements are not a new concept in technology. Certificate transparency (CT) is a public ledger of all certificates issued by any public certificate authority (CA) that provides a framework for monitoring and auditing CA activity, while Apple’s recently announced  App Tracking Transparency allows users to see what activity apps are tracking and opt out. Behavior transparency is a proposed application of this concept to known software behaviors.\n The purpose of a behavior transparency framework is to enumerate the expected actions of interest that a given piece of software will take on a device or on the network. This helps security analysts distinguish between expected noise and indications of compromise. This, in turn, can give security teams an advantage in identifying the exploitation of unknown vulnerabilities in any proprietary or open-source software.\n The good news is that the enumeration of common software behaviors is already a standard industry practice for external network activity. Most major software vendors, including  Meraki,  McAfee,  Tenable,  LogMeIn/GoToMeeting, and my own company,  ExtraHop, already publish lists of common product behaviors. Even  SolarWinds has documentation describing its network behaviors.\n But the Biden administration can help effect critical changes that improve upon this industry practice and improve the overall security posture for public and private organizations alike.\n  First, the cyber executive order should form a working group in partnership with representative software and security software vendors, as well as organizations such as  MITRE, to create standards for the types of network activity that must be included for full behavior transparency.\n At a minimum, this should include things like external network destinations, internal network connection behavior with other software components, and, where applicable, a list of associated network ports and the purposes for which those ports are used. The behavior transparency framework should also include other network behavior, especially (but not limited to) anything that looks like scanning or reconnaissance behavior.\n  Second, the cyber executive order should mandate that known software behaviors be published in a machine-readable format such as JSON or CSV that could be ingested into common security products like security information and event management (SIEM), firewalls, endpoint protection platforms, network detection and response, and change management tools.\n  This is a crucial distinction from the current model, in which most behaviors are listed on a webpage or in a PDF that isn’t machine-readable. With this change, common security tools could use that machine-readable behavioral data to help build baselines for activity within an organization to more quickly and accurately detect deviations that indicate compromise. Meraki is already doing this by providing its list in CSV format.\n  Third, the cyber executive order should establish a clearinghouse for behavior transparency data, administered by the Cybersecurity and Infrastructure Security Agency or another appropriate federal agency. The status quo is to hunt around on a vendor’s website, consult their in-product documentation or open a support case to find out about network behavior. If the information provided is incorrect, that’s also a support case.\n The current decentralized approach is deeply problematic. Unfettered network access for enterprise software products introduces substantial security risk — Zero Trust frameworks have been established to prevent precisely this — but typical practitioners do not have the time or expertise to individually track down the expected behaviors of each piece of enterprise software they have in the environment. Without centralized access to behavior transparency data, even the best Zero Trust implementations will have major gaps surrounding enterprise software.\n A clearinghouse would provide a centralized repository for behavior transparency data, organized by company, product and product version. A forum like GitHub is an ideal mechanism for such a clearinghouse, providing a widely used, centralized repository for this information.\n  Fourth, the clearinghouse should include a mechanism by which product users can easily provide feedback to software vendors. Feedback can be in the form of issues or even pull requests, though the companies should be involved in approving changes. This way, deficiencies in the behaviors can be pointed out in a public forum. Most deficiencies will be for reasons like a product update that wasn’t reflected in the behavior transparency data, though as time goes on, companies will ideally make it a practice to make sure these are kept up to date. But there will also be true positives found.\n  The SolarWinds software supply chain attack, first disclosed in December 2020, illustrates and underscores the importance of behavior transparency. Prior to December 11, when FireEye first identified the vulnerability in the SolarWinds Orion software, at least two other cybersecurity companies,  Palo Alto and  Fidelis, identified that their SolarWinds installations communicating with the attacker-controlled “stage 1” avsvmcloud[.]com domain. Palo Alto observed and blocked additional malicious behavior, but at the time neither company determined that the communication with avsvmcloud[.]com itself was suspect. That’s due in large part to the notorious amount of “noise” involved in looking at network data.\n But if more organizations had ready access to SolarWinds’ behavior transparency data, as well as a forum in which to compare deviations from the baseline, things might have played out differently.\n SolarWinds Orion doesn’t reach out to a lot of external destinations, so when the first stage of the supply chain attack started hitting subdomains off of “appsync-api.eu-west-1.avsvmcloud[.]com,” an analyst on a threat hunt running a SIEM query, or a machine-learning-based EDR or NDR product armed with that information, might have more quickly determined that something was amiss.\n Likewise, a low-friction public feedback mechanism could have tipped off SolarWinds and the industry that what seemed like noise in isolation (“appsync-api, seems legit?”) was actually something far more nefarious.\n The cyber executive order, alongside the sanctions on Russia, are strong early indications that the Biden administration intends to take a far more proactive approach to cybersecurity. Critical to the success of these efforts will be the partnership the administration forges with private-sector technology providers. Establishing standards at the federal level for disclosures about software products will benefit cybersecurity in the private sector, as well as improve the overall security of the software supply chain.", "posttime": "2021-06-21 23:16:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "网络安全,executive,行为", "title": "Biden关于网络安全的行政命令应包括行为透明度 ", "title_en": "\n\t\t\t\tBiden’s executive order on cybersecurity should include behavior transparency\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/bidens-executive-order-on-cybersecurity-should-include-behavior-transparency/", "via": "", "real_tags": ["网络安全", "executive", "行为"]}, {"category": "", "categoryclass": "", "imagename": "16dbe3eb1eeec1e941a4ab6bf2231c87.jpeg", "infoid": 1067218, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新的合资企业中投资“高级两位数数百万”投资于Cellforce Group GmbH，执行委员会成员Michael Steiner告诉记者，在宣布之前的媒体简报。该工厂还受益于德国政府的6000万欧元（7140万美元）的投资，并将其位于德国政府和Baden-Württemberg的状态。选择化学公司BASF SE供应阴极材料。\n 电池将使用硅作为阳极材料，Porsche表示将显着提高能量密度及其承受高温的能力 - 赛车的重要变量，这必须快速充电，但在电池生产中挑战（电池不具备挑战往往喜欢变热）。\n  因此，本厂将小规模，至少与其他汽车制造商相比，如Tesla，内华达州的Tesla和松下联合设施的35个Gigawatt-hout“Gigafactory”的能力相比，甚至是其母公司VW计划带来240 GWH的计划到2030年，生产到欧洲。保时捷和海关的目标是每年100兆瓦的年产量，或者在2024年开始，1000辆车的电池周围有足够的电池。最初的劳动力预计将从大约13人增长到高达80 2025。\n Steiner说，汽车制造商没有计划在保时捷更加主流阵容的情况下，虽然他指出，如果公司看到潜力降低生产成本，将来可能会有更高批量的机会。 “在这个市场上，我们正在寻找高端汽车和赛车的特殊用途电池，这在今天的市场上不可用，”他说。\n 将该技术扩展到乘用车可能是一个挑战。保时捷在一份声明中表示，硅阳极基细胞化学在非常冷的条件下或在许多充电周期中保持稳定的能力。但是，这不是第一次从为赛道开发的技术受益的车辆：其领先的电气模式Taycan从保时捷919混合赛车借用了许多技术功能。\n 虽然第一辆使用这些电池的车辆将是保时捷制造的，但Steiner表示，该技术将在大众汽车组中的其他品牌提供，如Lamborghini或Bugatti。\n “电池单元是未来的燃烧室，”保时捷首席执行官Oliver Blume在星期一的声明中说。 “这位合资企业使我们能够以全球竞争的最前沿，在开发最强大的电池单元中，使其成为驾驶体验和可持续性明白的保时捷之间的联系。这就是我们塑造跑车的未来。“ ", "note_en": "Porsche invested in “the high double-digit millions” in the new joint venture, dubbed Cellforce Group GmbH, executive board member Michael Steiner told reporters in a media briefing ahead of the announcement. The factory also benefited from a €60 million ($71.4 million) investment from the German government and the state of Baden-Württemberg, where it will be located. Chemical company BASF SE was selected to supply the cathode materials.\n The batteries will use silicon as the anode material, which Porsche says will significantly boost the energy density and their capacity to withstand high temperatures – both important variables for racing cars, which must be recharged quickly, but challenging in battery production (batteries don’t tend to like getting very hot).\n  For that reason, the factory will be small scale, at least compared to other automakers such as the 35 gigawatt-hour “gigafactory” capacity at the Tesla and Panasonic joint facility in Sparks, Nevada or even its parent company VW’s plan to bring  240 GwH of production to Europe by 2030. Porsche and Customcells’ aim is an annual capacity of 100 megawatt-hours, or around enough batteries for 1,000 vehicles, starting in 2024. The initial workforce is expected to grow from around 13 people to up to 80 by 2025.\n The automaker has no plans to scale the technology for use in Porsche’s more mainstream lineup of vehicles, Steiner said, though he noted that there may be a chance for higher volume in the future if the company sees a potential to bring down production costs. “In this market, we are looking for special purpose cells for high-end cars and motorsports, and this is not available in the market today,” he said.\n It may be a challenge to scale this technology to passenger vehicles. The silicon anode-based cell chemistry has not shown the capacity to function in very cold conditions or to remain stable over many charging cycles, Porsche said in a statement. But it wouldn’t be the first time that a Porsche vehicle benefited from technology developed for the race track: its leading electric model Taycan borrowed many of its technical features from the Porsche 919 Hybrid racing car.\n Although the first vehicles to use these batteries will be Porsche-made, Steiner said the technology will be made available to other brands in the Volkswagen Group, like Lamborghini or Bugatti.\n “The battery cell is the combustion chamber of the future,” Porsche CEO Oliver Blume said in a statement Monday. “This joint venture allows us to position ourselves at the forefront of global competition in developing the most powerful battery cell and make it the link between the unmistakable Porsche driving experience and sustainability. This is how we shape the future of the sports car.”", "posttime": "2021-06-21 23:16:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "性能,习惯,high,电池", "title": "保时捷用习惯为合资企业提供高性能电池 ", "title_en": "\n\t\t\t\tPorsche to make high-performance batteries in joint venture with Customcells\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/porsche-to-make-high-performance-batteries-in-joint-venture-with-customcells/", "via": "", "real_tags": ["性能", "习惯", "high", "电池"]}, {"category": "", "categoryclass": "", "imagename": "17fc0b65066fe60754f721ca374b8e44.jpg", "infoid": 1067217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "建立一个面向消费的Fintech公司是昂贵的。如果您想在拥挤的公司拥挤的部门中建立一个，并且资金丰富的初创公司，它可以超级昂贵。\n 这是我们在2020年代后期学到的课程，通过检查许多新手的经营结果。\n Neobanks基本上是银行基础设施的软件层，提供消费者的数字第一，移动友好和往往的低收工银行服务。推动重新思考消费者银行业是一种全球努力，在基本上，Neobanks在你可以想到的每个市场上。私人投资者展示了斗士竞争Neobanks的推出，因为他们有可能为用户提供安全 - 客户 - 长时间产生收入。\n  交易所探索初创公司，市场和金钱。每天早上都在额外的紧缩或每周六获得交换时事通讯。\n  投资者证明愿意在许多新田纳克斯的增长和产品中资助巨额投资，导致独角兽急剧运行结果。简而言之，虽然美国消费者Fintech Chime披露了积极的EBITDA  - 一个调整后的盈利能力公制 - 许多新的新台，我们已经看到的数字已经证明了缺乏盈利能力的迹象。\n  今天早些时候早些时候崇拜的革命结果表明，该公司有一个深深的无利可图2020.但是如果我们挖掘其季度结果，就会找到好消息。纽伯克斯终于可以成本成本结构。\n 所以今天，我们将解析关键的戒律财务结果，看看我们可以从Starling和Monzo挖掘的内容。也许来自罗福特的有点良好的财务新闻不仅仅是一个新的诺贝克？ \n如果您想要更广泛的镜头，我们自己的Romain Dillet在这里广泛看出罗福特的业务。 我们目前只关心其原始财务结果。  这些数字的主旨是该公司的收入增长是坚实的，但提高毛利率允许其毛利于2020年飙升。 ", "note_en": "Building a consumer-facing fintech company is expensive. And if you want to build one in a sector crowded by both incumbent companies and richly funded startups, it can be  super expensive.\n That was the  lesson we learned in late 2020 by examining operating results from a number of neobanks.\n Neobanks are essentially software layers atop banking infrastructure, offering consumers digital-first, mobile-friendly and often lower-fee banking services. The push to rethink consumer banking is a global effort, with neobanks cropping up in essentially every market you can think of. Private investors have shown up in droves to fund competing neobanks because they have the potential to secure users — customers — that generate revenues for long periods of time.\n  The Exchange explores startups, markets and money.   Read it  every morning on Extra Crunch or get  The Exchange newsletter every Saturday.\n  Investors have proven more than willing to fund huge investments in growth and product at many neobanks, leading to steeply negative operating results at the unicorns. In short, while American consumer fintech Chime has  disclosed positive EBITDA — an adjusted profitability metric — many neobanks that we’ve seen numbers from have demonstrated a stark inability to paint a path to profitability.\n  Recent results from Revolut that  TechCrunch covered earlier this morning show that the company had a deeply unprofitable 2020. But if we dig into its quarterly results, there’s good news to be found. Neobanks could be maturing into their cost structure at last.\n So today we’ll parse the key Revolut financial results and look at what we can dig up from Starling and Monzo. Perhaps the somewhat good financial news from Revolut is not merely to be found at just one neobank?\n  Our own  Romain Dillet has a broad look at Revolut’s business  here, if you would like a wider lens. We only care about its raw financial results at the moment.\n   The gist of these figures is that the company’s revenue growth was solid, but improving gross margins allowed its gross profit to spike in 2020.", "posttime": "2021-06-21 23:16:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "休息,neobanks", "title": "也许毕竟尼多克斯将休息 ", "title_en": "\n\t\t\t\tMaybe neobanks will break even after all\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/maybe-neobanks-will-break-even-after-all/", "via": "", "real_tags": ["休息", "neobanks"]}, {"category": "", "categoryclass": "", "imagename": "3326f328847d7f21123b91a7aa35a2c9.jpg", "infoid": 1067216, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首尔 - 学生们在默默地吃午餐，然后收集在一个暗淡的房间里装满了高功率的电脑。在那里，教练帮助他们在一个数字幻想世界中学习了越野的对手，充满了伏击和怪物。学校达到5点，但个人练习持续良好，夜晚 - 所有在韩国许多电子体育院校的学生的艰难工作。\n “我每天只睡觉三到四个小时，”Kim Min-Soo，17岁的学生说，一名右手围绕着一条括号来减少这么多游戏的痛苦。 “但我想成为一个明星。我梦想着一个与粉丝一起包装的电子竞技场，所有人都为我而生。“\n 像Min-Soo这样的学生带来了与韩国教育相同的强烈竞争能源，以在电子体育院校培训。韩国被认为是电子运动的诞生地，但在该国的许多人仍然令人羞辱的是高度选择性的多亿美元产业。学院致力于改变这种形象，让成千上万的年轻人有机会在游戏长期被视为一种生活方式的地方追求职业生涯。\n  “在韩国，玩家必须在玩游戏之前做作业，因为如果他们扰乱了他们团队的效率，他们就可以被驱逐出头，”韩国美国电子游戏开发商暴风雪娱乐韩国负责人表示，他们说。“在最近在首尔的论坛期间。 “韩国游戏玩家致命。”\n 在线游戏在韩国越早起飞，而不是世界上任何地方。当该国在20世纪90年代末开始引入高速互联网时，它看到了24小时游戏咖啡馆的扩散，称为PC Bangs。\n 这些黑暗，往往是地下的地方成为游戏文化的温床，最终举办非正式锦标赛。到2000年，韩国有线电视频道是世界上播放在线游戏比赛的世界第一。\n 根据教育部去年的一项调查，E-Sports现在是韩国学生，在运动员，医生，教师和数字内容创作者之后的第五次流行的未来工作。这将很快成为2022年亚运会的一部分。 \n像Lee Sang-hyeok这样的顶级球员，由游戏名称煽动者，赚取与K-Pop偶像一样多的名声和财富。数百万看着他们在Livestream上玩耍。在大流行之前，粉丝包装成e-sports arenas，看起来像摇滚音乐会和亲摔跤体育场之间的十字架。\n  诱惑可能很难抵抗。父母拖着孩子们咨询游戏成瘾或康复训练营。当尽职责任的目标要求免于韩国强制性军事服务时，官员将调查他们是否扮演涉及枪支和暴力的在线游戏。\n 成绩秋天。有时学生辍学将花更多的时间游戏。但珍贵的少数人会有机会让它变大。\n 这座特许经营的专业电子竞技队在韩国竞争传说中最受欢迎的游戏，租用200名球员。那些没有切割的人有很少的替代品。\n 缺乏良好的成绩 - 通常高中文凭 - 游戏玩家会发现自己有限的工作前景。与一些美国大学不同，韩国学校不根据电子体育技能提供录取。\n 当加利福尼亚州的电子体育公司Gen.G在2019年首尔开设了Elite Esports Academy，它希望解决一些挑战，因为“这是大多数人才所在的挑战，”Joseph Baek说，Gen.g Academy的计划总监。 “韩国仍被认为是电子运动的麦加。”\n 学校训练年轻的韩国人和其他学生如何转动专业人士，并帮助游戏Buff找到垃圾，营销人员和数据分析师的机会。它与教育公司Elite Open School一起开设了一个仅限英语的计划，为学生提供了获得美国高中文凭的机会，以便在美国申请美国的大学对电子体育奖学金。 \n在最近一天早上，睡眠贫困的青少年归档为精英开放的校长面具和品牌T恤和连帽衫。分为哥伦比亚，M.I.T等美国大学以克的教室。和杜克，他们学习英语，美国历史和其他所需的科目。有些人每天早上两个小时到学校。\n “我的挑战是如何让他们在课堂上保持清醒和订婚，”英语老师萨姆苏苏说。\n 真正的工作开始于下午，当时两辆公共汽车将年轻的游戏玩家带到一个谦虚的混凝土建筑，在居住区进行另一个激烈的培训课程。\n 来自法国的22岁的前任Geng.g学院学生Anthony Bazire表示，他选择了韩国作为他的训练，因为他知道这个国家有一些最好的球员。今天，传说中的大奖赛，透气和星际争霸II大多是韩国人。\n “当你看到人们努力工作时，它会推动你努力工作，”他说。\n  Gen.g计划，它在韩国的第一个方案甚至帮助了一些学生说服父母他们做出了聪明的职业发展。\n 2019年，他在高中的第二年，金赫翁yeong每天播放传说10小时。他的技能随着他通过数字幻想世界的方式而改善。那个夏天，他决定成为一个专业运动员和辞职的学校。 \n“我的父母完全反对它，”金先生，19岁。“我告诉他们我会遗憾，因为这是我想要在我生命中尝试的一件事，扔进我所拥有的一切。”\n 他的母亲Lee Ji-Eun，46岁，她躺在床上呻吟着。李女士最终决定在他问她有一天之后支持她的儿子：“妈妈，当你是我的年龄时，你有什么梦想？你有没有生活过这个梦想？“\n  金先生研究了Gen.G计划，该计划每年占25,000美元，并使他的母亲给学院说服她，他可以作为一名电子竞技专业人士找到成功。他通过基于他的网络游戏技能进入肯塔基大学，通过赢得录取来清除今年的梦想对他的梦想进行了一大障碍。\n 法国游戏玩家Bazire先生加入了3月份作为一名实习运动员的Legends of Legends团队。他和其他学员在首尔的共同公寓中获得了谦虚的工资和食物和住宿。他说，他们每天练习长达18小时，比他在法国知道的比赛者多60％至70％。\n 但成为一名实习生的时间不仅仅是固定脚趾。学员必须快速地通过第二部门到主要联盟，其中专业的传说球员每年支付2万美元的平均工资，奖金和赞助优惠。\n 随着年轻和云峰的天赋不断赶上，在韩国最终26岁之前，大多数电子运动运动员的职业生涯结束，周围韩国男子在20多岁的时候感受到开始他们的强制性军事服务。\n Min-Soo，梦想成为电子运动明星的学生，首先在中学时感受到电子体育舞台的电气化氛围。自2019年以来，他每天上午6点醒来，每天都有两小时的公共汽车和地铁到Gen.G学院。他在下午11:30回到家。然后做更多，很少在上午3点之前睡觉。 \n今年，他终于被认为足够好，开始考试成为专业团队的实习生。  “这是一个艰难而孤独的生活，因为你必须放弃其他一切，就像朋友一样，”他说。 “但我最开心，因为我正在做我最喜欢的事情。” ", "note_en": "SEOUL — The students ate lunch in silence before gathering in a dimly lit room packed with high-powered computers. There, coaches helped them learn to outmaneuver opponents in a digital fantasy world fraught with ambushes and monsters. School was over by 5 p.m., but individual practice continued well into the night — all in a hard day’s work for the students at one of South Korea’s many e-sports academies.\n “I sleep only three or four hours a day,” said Kim Min-soo, 17, a student who wore a brace around his right hand to lessen the pain from so much gaming. “But I want to become a star. I dream of an e-sports arena packed with fans all rooting for me.”\n Students like Min-soo have brought the same intense competitive energy often associated with South Korean education to their training at e-sports academies. South Korea is considered a birthplace of e-sports, but the highly selective multibillion-dollar industry is still frowned upon by many in the country. The academies have worked to change that image and give thousands of young people a chance to pursue careers in a place where gaming has long been seen as a way of life.\n  “In South Korea, players must do homework on their game before playing it, because if they disrupt the efficiency of their ​team, they can be expelled,” said Jeon Dong-jin, Korea head of the American video game developer Blizzard Entertainment, during  a recent forum in Seoul. “South Korean gamers are deadly serious.”\n Online gaming took off sooner and faster in South Korea than anywhere else in the world. When the country began introducing high-speed internet in the late 1990s, it saw the proliferation of 24-hour gaming cafes called PC bangs.\n These dark, often underground parlors became hotbeds for gaming culture, eventually hosting informal tournaments. By 2000, South Korean cable channels were the first in the world to broadcast online gaming competitions.\n E-sports is now the fifth-most popular future job among South Korean students, after athletes, doctors, teachers and digital content creators, according to a survey by the Education Ministry last year. It will soon be a part of the Asian Games in 2022.\n Top players like  Lee Sang-hyeok, who goes by the gaming name Faker, earn as much fame and fortune as K-pop idols. Millions watch them play over livestream. Before the pandemic, fans packed into  e-sports arenas that looked like a cross between a rock concert and pro-wrestling stadium.\n  The allure can be hard to resist. Parents have dragged children to counseling for  gaming addiction or to rehabilitation  boot camps. When  conscientious objectors ask to be exempted from South Korea’s mandatory military service, officials will investigate whether they play online games involving guns and violence.\n Grades fall. Sometimes students drop out of school to spend more time gaming. Yet precious few will get the chance to make it big.\n The 10 franchised professional e-sports teams in South Korea competing in League of Legends, the most popular game here, hire only 200 players total. Those who do not make the cut have few alternatives.\n Lacking good grades — and often high school diplomas — gamers will find themselves with limited job prospects. And unlike some American universities, South Korean schools do not offer admission based on e-sports skills.\n When  Gen.G, a California-based e-sports company, opened its  Gen.G Elite Esports Academy in Seoul in 2019, it wanted to address some of those challenges because “this is where most of the talent is,” said Joseph Baek, program director at the Gen.G academy. “South Korea is still considered the mecca of e-sports.”\n The school trains young South Koreans and other students on how to turn pro and helps gaming buffs find opportunities as streamers, marketers and data analysts. Together with the educational company  Elite Open School, it opened an English-only program that offers students a chance to earn an American high school diploma so they can apply to universities in the United States on e-sports scholarships.\n  On a recent morning, the sleep-deprived teenagers filed into Elite Open School wearing masks and branded T-shirts and hoodies. Divided into classrooms named after American universities like Columbia, M.I.T. and Duke, they studied English, American history and other required subjects. Some commuted two hours each morning to school.\n “​My challenge is how to keep them awake and engaged during class,” said Sam Suh, an English teacher.\n The real work began in the afternoon, when two buses carried the young gamers to a modest concrete building in a residential area for another intense training session at the Gen.G academy.\n Anthony Bazire, a 22-year-old former Gen.G academy student from France, said he had chosen South Korea as his training ground because he knew the country had some of the best players. Today, top prize winners in  League of Legends,  Overwatch and  StarCraft II are mostly South Koreans.\n “When you see people working hard, it pushes you to work hard,” he said.\n  The Gen.G program, the first of its kind in South Korea, has even helped some students convince their parents that they made a smart career move.\n In 2019, his second year in high school, Kim Hyeon-yeong played League of Legends for 10 hours a day. ​His skills improved as he romped his way through the digital fantasy world​. That summer, he decided to become a pro e-sports player, and quit school.\n “My parents were totally against it,” said Mr. Kim, 19. “I told them that I would have no regrets, because this was the one thing I wanted to try in my life, throwing in everything I got.”\n His mother, Lee Ji-eun, 46, was so distressed that she lay in bed moaning. Ms. Lee eventually decided to support her son after he asked her one day: “Mom, what dream did you have when you were my age? Have you lived that dream?”\n  Mr. Kim researched the Gen.G program, which costs $25,000 a year, and led his mother to the academy to convince her that he could find success as an e-sports professional. He cleared a big hurdle to his dream this year by winning admission, based on his online game skills, into the University of Kentucky.\n Mr. Bazire, the French gamer, joined Gen.G’s League of Legends team as a trainee player in March. He and other trainees receive modest salaries along with food and lodging at a shared apartment in Seoul. They practice up to 18 hours a day, 60 to 70 percent more than players he knew in France, he said.\n But becoming a trainee is little more than securing a toehold. Trainees must climb fast through the second division to the main league, where professional League of Legends players are paid an average salary of $200,000 a year, and prize money and sponsorship deals.\n With younger and nimbler talents catching up constantly, the careers of most e-sports athletes in South Korea end before they turn 26, around the time when Korean men in their late 20s feel pressure to begin their mandatory military service.\n Min-soo, the student who dreams of becoming an e-sports star, first felt the electrifying vibe of an e-sports arena when he was in middle school. Since 2019, he has woken up at 6 a.m. every day, taking a two-hour bus and subway ride to the Gen.G academy. He returns home at 11:30 p.m. and then practices more, seldom going to bed before 3 a.m.\n This year, he was finally considered good enough to start taking tests to become a trainee on a pro team.\n “It’s a hard and lonely life, because you have to give up everything else, like friends,” he said. “But I am happiest because I am doing what I enjoy the most.”", "posttime": "2021-06-21 23:06:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sports,韩国,rise,游戏", "title": "看看韩国竞技场的巨大崛起，成千上万的年轻人竞争于专业，并努力在该行业中创造可持续工作 ", "title_en": "A look at the huge rise of esports in South Korea, where thousands of young people compete to go pro, and efforts to create sustainable jobs in the industry", "transed": 1, "url": "https://www.nytimes.com/2021/06/19/world/asia/south-korea-esports.html", "via": "", "real_tags": ["sports", "韩国", "rise", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "cda9e9d41d93a93666ef59f881ad4bb7.png", "infoid": 1067215, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Shopify，它通过向商家提供在线工具已经成为电子商务的主要力量，推出了一个新的服务，允许内容发布者链接到商店网络中的商家，根据人们换取交易收入的削减熟悉这种情况。\n 新生进入被称为联盟营销的区域旨在为亚马逊和沃尔玛等互联网零售巨头提供的电子商务合作伙伴提供出版商和零售商，这两者都有很长的网站，这些网站将业务发送他们的一小部分那些销售。 BuzzFeed已经签署了新计划并将其集成到其现场。熟悉此事的人们熟悉，Shopify已经接近了一些其他数字媒体公司，包括复杂的网络和VOX媒体。\n    Shopify，它通过向商家提供在线工具已经成为电子商务的主要力量，推出了一个新的服务，允许内容发布者链接到商店网络中的商家，根据人们换取交易收入的削减熟悉这种情况。新生进入称为联盟营销的区域旨在提供发布商和... ", "note_en": "Shopify, which has become a major force in e-commerce by providing online tools to merchants, is rolling out a new service that will allow content publishers to link to merchants in the Shopify network in exchange for a cut of transaction revenue, according to people familiar with the situation.\n The nascent move into an area known as affiliate marketing is designed to offer publishers and retailers looking for an e-commerce partner an alternative to internet retail giants like Amazon and Walmart, both of which have long given websites that send business their way a small portion of those sales. BuzzFeed already has signed on to the new program and integrated it into its site. Shopify has approached a number of other digital media companies, including Complex Networks and Vox Media, people familiar with the matter said.\n    Shopify, which has become a major force in e-commerce by providing online tools to merchants, is rolling out a new service that will allow content publishers to link to merchants in the Shopify network in exchange for a cut of transaction revenue, according to people familiar with the situation. The nascent move into an area known as affiliate marketing is designed to offer publishers and...", "posttime": "2021-06-21 23:05:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,shopify,提供", "title": "来源：Shopify正在推出一项服务，让Buzzfeed和其他内容出版商链接到商家以换取交易收入的削减 ", "title_en": "Sources: Shopify is rolling out a service that will let BuzzFeed and other content publishers link to merchants in exchange for a cut of transaction revenue", "transed": 1, "url": "https://www.theinformation.com/articles/shopify-seeks-to-challenge-amazon-through-deals-with-buzzfeed-other-sites", "via": "", "real_tags": ["交易", "shopify", "提供"]}, {"category": "", "categoryclass": "", "imagename": "a15c83e7e8abc15a76ac2b5c4fb126b3.png", "infoid": 1067214, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（路透社） - 由亿万富翁投资者丹尼尔·勒布的对冲基金第三点支持的网络安全公司Sentinelone Inc，旨在根据周一的监管申请，估值超过70亿美元的美国首次公开发行（IPO）。\n Sentinelone，其其他投资者包括风险投资资本支持虎全球，红杉资本和洞察力伙伴，计划出售3200万股，每股26美元至29美元，在该范围的顶端筹集了9.28亿美元。\n SentineLone成立于2013年，通过使用人工智能技术来保护笔记本电脑和手机免受安全漏洞，以确定企业网络中的异常行为。由于大多数员工在Covid-19大流行期间开始在家工作，其业务有所推动。\n  山景，基于加利福尼亚州的山景，从包括虎全球和红杉的投资者筹集了2.67亿美元，估值超过30亿美元，几乎三倍于2020年的价值。\n Sentinelone在申请中表示，与Tiger Global，Insight Fordure Partners，第三点企业和Sequoia Capital的第三点企业和Sequoia Capital隶属于购买了一些股票的股票，总价约为5000万美元。\n Sentinelone的IPO计划是华尔街的股票市场的录制竞赛，浮选显示没有速度放缓的迹象。根据DealoGic的数据，在今年的结束，美国IPO已经总计1710亿美元，美国IPO已经达到了171亿美元，黯然失色募股，该日常纪录为1.68亿美元。\n  Sentinelone将在符号“S”下列出纽约证券交易所的股票。 ", "note_en": "(Reuters) - Cybersecurity firm SentinelOne Inc, backed by billionaire investor Daniel Loeb’s hedge fund Third Point, is aiming for a valuation of over $7 billion in its U.S. initial public offering (IPO), according to a regulatory filing on Monday.\n SentinelOne, whose other investors include venture capital backers Tiger Global, Sequoia Capital and Insight Venture Partners, plans to sell 32 million shares priced at between $26 and $29 per share, raising $928 million at the top end of the range.\n Founded in 2013, SentinelOne protects laptops and mobile phones from security breaches by using artificial intelligence technology to identify unusual behavior in enterprise networks. Its business had a boost as most employees started working from home during the COVID-19 pandemic.\n  The Mountain View, California-based company raised $267 million in November from investors including Tiger Global and Sequoia at a valuation of more than $3 billion, almost three times what it was valued in February 2020.\n Entities affiliated with Tiger Global, Insight Venture Partners, Third Point Ventures and Sequoia Capital, have separately agreed to purchase a number of shares with an aggregate price of about $50 million, SentinelOne said in the filing.\n SentinelOne’s IPO plans comes as Wall Street’s record-breaking run for stock market flotations shows no sign of slowing down. With more than six months until the year ends, U.S. IPOs have already totaled $171 billion, eclipsing the 2020 record of $168 billion, according to data from Dealogic.\n  SentinelOne will list its stock on the New York Stock Exchange under the symbol “S”.", "posttime": "2021-06-21 23:05:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,网络安全,floats,sentinelone", "title": "归档：网络安全公司Sentinelone将以26-29美元的价格出售3200万美元，瞄准7B +估值并在顶端筹集92.8米，当它漂浮在纽约证券交易所 ", "title_en": "Filing: cybersecurity company SentinelOne will sell 32M shares at $26-$29, aiming for a $7B+ valuation and raising $928M at the top end, when it floats on NYSE", "transed": 1, "url": "https://www.reuters.com/article/us-sentinelone-ipo-idUSKCN2DX14I", "via": "", "real_tags": ["交易", "网络安全", "floats"]}]