[{"category": "", "categoryclass": "", "imagename": "b84a95b6643cbdca0e6c6837d31dbb57.png", "infoid": 1069004, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的一百年里，交通一直由三个彩色圆圈控制——红色、琥珀色和绿色。这种现在标志性的外观是由最初使用的球形白炽灯塑造的。由于这些技术限制不再存在，我们现在可以让交通灯看起来像我们想要的样子。因此，我们与 UOMP 工业设计中心合作，重新构想未来的交通灯。我们提出了两个交通灯概念。第一个——对经典外观的现代诠释——专注于此时此地。使用旧的红绿灯，有色觉障碍的人可以通过其位置识别信号。有了这种新设计，这条线索会以象形图保留在人们期望它们出现的地方。以前，为了在困难的十字路口分配不同方向的交通流量，城市必须支付额外费用来安装额外的路段——通常是三圈格式。这是解决问题的唯一方法。有了这些新的交通灯，所有的信号都可以整齐地显示在一个屏幕上。第二个概念是方形交通灯。几年后它就可以上街了。我们选择了方形，以便交通灯可以兼作交互式路标。\n如果道路上的情况突然发生变化，交通灯会改变以发出警告信号。未来，这种紧凑型多功能交通灯将不再需要安装垂直型号和大多数标志。我们为新格式想出了一些很酷的动画，包括行人和骑自行车的人。摄像头内置于交通灯的遮阳板中，因此您可以分析道路情况并密切关注周围的车辆流量。如有必要，可以在交通灯的背面安装 5G 模块、Wi-Fi 适配器和用于测量温度、空气质量、湿度和噪音水平的传感器。这使您可以使城市变得“智能”（从美学和规模的角度来看），而无需在单独的电线杆上安装一堆不同的设备。我们很乐意帮助您在您的城市安装未来的交通灯。与我们联系以讨论详细信息。", "note_en": "For the last hundred years, traffic has been regulated by three coloured circles — red, amber, and green. This now iconic look was shaped by the spherical incandescent lamps which were initially used.\n As these technical restrictions no longer exist, we can now make traffic lights look however we want them to look. So, we got together with the UOMP Industrial Design Centre, to reimagine traffic lights for the future.\n We’ve come up with two traffic light concepts. The first — a modern take on the classic look — focuses on the here and now.\n   With old traffic lights, people who have colour vision disorders identified a signal by its location. With this new design, this clue is preserved with pictograms where people would expect them to be.\n  Previously, in order to distribute the flow of traffic going in different directions at difficult intersections, cities had to pay extra to have additional sections installed — in the usual three-circle format. It was the only way to solve the problem. With these new traffic lights, all the signals fit neatly onto one screen.\n       The second concept is a square traffic light. It’ll be ready to hit the streets in just a few years.\n  We chose a square shape so that the traffic light can double up as an interactive road sign.\n   If the situation on a road changes suddenly, the traffic light changes to give a warning signal.\n   In the future, this compact and multifunctional traffic light will remove the need to install both vertical models and most signs.\n  We came up with some cool animations with pedestrians and cyclists for the new format.\n     The camera is built into the traffic light’s visor, so you can analyse the situation on the road and keep an eye on the flow of vehicles around you.\n  Where necessary, a 5G module, Wi-Fi adapter, and sensors to measure temperature, air quality, humidity and noise levels can be installed on the back of the traffic light. This allows you to make the city ‘smart’ (from the point of view of aesthetics and size), without having a bunch of different devices installed on separate poles.\n     We’ll be happy to help you install the traffic lights of the future in your city. Get in touch with us to discuss the details.", "posttime": "2021-07-22 23:28:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "未来,lights,交通灯", "title": "未来的交通灯", "title_en": "Traffic Lights of the Future", "transed": 1, "url": "https://www.artlebedev.com/svetoforus/4/", "via": "", "real_tags": ["未来", "lights", "交通灯"]}, {"category": "", "categoryclass": "", "imagename": "5d45da336636f8c4c11bf8c505364114.jpg", "infoid": 1069003, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2015 年，我们带您参观了弹球博物馆，这里是世界上最大的弹球和街机游戏馆藏之一。从那以后，游戏数量增加了数百个；最后的官方统计是“超过 1,100”。可悲的是，博物馆正在关闭（并被大麻种植业务所取代）。将博物馆搬迁到加利福尼亚州棕榈泉的尝试失败了，整个游戏系列很快就会拍卖。搬迁、获得赞助、出售给一位收藏家等的所有截止日期都已过。因此，所有游戏都将在未来几个月内拍卖。官方公告即将发布。您可以在线和/或亲自出价。主要拍卖将在弹球博物馆的班宁举行。 Pin 图和视频仅通过拍卖出售。该藏品被“锁定”用于拍卖。我们会想念博物馆和精彩纷呈的游戏。拍卖会值得一看。加利福尼亚州班宁——2015 年 1 月 16 日的周末，举办了首届南加州拱廊博览会。该节目拥有超过 750 场弹球和街机游戏，是南加州历史上规模最大的节目。与大多数由志愿者和爱好者带来游戏以与公众分享的街机节目不同，该系列主要由约翰·威克斯 (John Weeks) 拥有，他在过去 40 年中积累了大量游戏。 Weeks 还拥有 40,000 平方英尺的设施，永久举办奥运会，并希望每年至少举办两次赛事。第二个目前计划在 10 月的某个时间进行。尽管第一次演出会出现一些典型的小问题，但它的表现非常出色，3,300 人都在享受大量游戏。有现场音乐，各种风格的比赛，几次研讨会，并试图打破“大多数弹球游戏同时进行”的吉尼斯世界纪录。但是大多数人只是为了游戏而来，我们已经尝试在上面为您记录下来。特别感谢 Pinside 的成员捐赠了他们的照片，以帮助使这个画廊成为可能。\n每个人都提到的 150 美元/天的价格仅适用于几个月前举行的最后一场特别活动。由于 COVID（这迫使取消了前一年的活动价值），它被限制在正常容量的 20% 左右。典型的费率更像是 40-50 美元/天，具体取决于一天的长度，或者整个 3-4 天周末的费用约为 150 美元......与在其他任何地方比赛相比，这会很划算……这里的收藏是无与伦比的），而其他收藏包括参加公开比赛之外的锦标赛。我参加的每场活动都尽可能地挤满了人，而且玩你想要的机器不是一个挑战——你必须等待几分钟的流行/新东西，但总是有很多打开的机器.我曾经在那里进行 3 小时的往返车程，这是非常值得的。", "note_en": "In 2015, we took you on a photo tour of the Museum of Pinball, home to one of the world&#39;s largest collections of pinball and arcade games under one roof. Since then, the number of games grew by hundreds; the last official count was &#34;over 1,100.&#34;\n Sadly, the museum is closing for good (and being  replaced by a cannabis-growing operation). An attempt to relocate the museum to Palm Springs, California,  failed, and the entire collection of games will be going up for auction soon.\n  All deadlines have passed to relocate, obtain a sponsorship, sell to one collector, etc. Therefore, all the games will be auctioned in the upcoming months. The official announcement will be forthcoming. You can bid online and/or in person. The primary auction will take place in Banning at the Museum of Pinball. Pins and vids are being sold via auction only. The collection is “locked” for the auction.\n We&#39;ll miss the museum and the amazing array of games. The auction will be one to watch.\n     BANNING, Calif.—The weekend of January 16, 2015, was host to the inaugural  Southern California Arcade Expo. Featuring over 750 pinball and arcade games, the show was the largest in Southern California&#39;s history. Unlike most arcade shows, where the games are brought by volunteers and enthusiasts to share with the general public, the collection is primarily owned by one man, John Weeks, who has spent the last 40 years amassing his horde of games. Weeks also owns the 40,000-square-foot facility where the games are permanently housed and is hoping to make events there happen at least twice a year. The second one is currently scheduled for some time in October.\n Despite some minor issues typical of a first-time show, it went off spectacularly, with 3,300 people all enjoying the vast collection of games. There was live music, various styles of tournament play, several seminars, and an attempt to break the Guinness World Record for &#34;most games of pinball being played simultaneously.&#34; But most people just came for the games, and we&#39;ve attempted to document them for you above.\n Special thanks to the members of  Pinside who donated their photos to help make this gallery possible.\n  That $150/day price that everyone&#39;s referencing was ONLY for the final special event held a few months ago. It was limited to about 20% of normal capacity due to COVID (which had forced the cancellation of the prior year&#39;s worth of events). Typical rates were more like $40-50/day depending on length of day, or something like $150 for the entire 3-4 day weekend... but again varied a bit as some events were strictly open play (which even at $75 a day would be a bargain compared to playing anywhere else... and the collection here was unparalleled) and others included entries into tournaments that were being held in addition to the open play. Every event I attended was about as packed as it could get without it being a challenge to play the machines you want-- you&#39;d have to wait on the popular/new stuff for a few minutes, but there were always plenty of open machines. I used to make a 3hr round trip drive there and it was well worth it.", "posttime": "2021-07-22 22:54:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "弹球,museum,游戏", "title": "巨大的弹球博物馆将永久关闭", "title_en": "The massive Museum of Pinball is closing its doors for good", "transed": 1, "url": "https://arstechnica.com/gaming/2021/07/a-look-back-at-the-museum-of-pinballs-huge-collection-of-games/", "via": "", "real_tags": ["弹球", "museum", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "0c0b248d6924b6e4ce2e4911b9fa65b4.jpg", "infoid": 1069001, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近组装的列奥纳多·达·芬奇家谱，从 1331 年到现在跨越了 21 代，可​​以为 DNA 测试铺平道路，以确认埋在达·芬奇坟墓中的骨头是否真的是他的。然而，两位艺术史学家希望为这位文艺复兴时期艺术家的才华揭开遗传解释的希望，可能会被科学现实所摧毁。为了构建家谱，艺术史学家 Alessandro Vezzosi 和 Agnese Sabato 挖掘了过去 690 年的出生、死亡和财产记录。他们还采访了在世的亲属，以了解更多关于这位著名艺术家、科学家和发明家的现代大家庭的信息。最后，他们追踪了达芬奇的家族，从他出生于 1331 年的祖父到今天居住的 14 位亲戚。列奥纳多·达·芬奇本人没有孩子，他的现代亲戚都是他 22 个（！）同父异母的兄弟姐妹的后代。现在的家庭在这项新研究中发挥了重要作用。 Vezzosi 和 Sabato 写道：“他们中的许多人与他们的亲属合作收集和验证信息，并热情地帮助联系其他家庭成员并检索新的文件和图像。”那些多次成为伟大的侄女和侄子包括几名办公室工作人员（其中一个在 1960 年代担任海军炮手）、一名退休的室内装潢师、一名测量员和一名“对摩托车和音乐充满热情”的国家雇员。年龄最大的已经85岁了，最小的只有一岁。从一些有趣的历史角度来看，当黑死病到达意大利时，这位艺术家的祖父米歇尔·达·芬奇 (Michele da Vinci) 还只是个少年；他最近的 20 次侄女或侄子出生在 Covid-19 大流行期间。 Vezzosi 和 Sabato 对从达芬奇的父亲（一位名叫 Ser Piero da Vinci 的公证人）到今天几代人的男性血统特别感兴趣。这部分是因为在女性的生活——有时甚至是她们的整个存在——很少被记录在官方记录中的历史文献中，男性血统更容易被追踪。但这主要是因为 Y 染色体，这是人类基因组中唯一可以直接从父亲传给儿子的部分。除了随着时间的推移发生一些小的变化之外，达芬奇现代侄子的 Y 染色体应该与米歇尔、皮耶罗爵士和列奥纳多本人的 Y 染色体极为相似。这意味着，通过将现代亲属的 Y 染色体 DNA 与埋在达芬奇坟墓中的骨骼的古代 DNA 进行比较，有可能解开一个 158 年的谜团：谁被埋葬在圣教堂的达芬奇坟墓中。 -休伯特？列奥纳多·达·芬奇 (Leonardo da Vinci) 在法国度过了他生命的最后四年，在国王弗朗西斯一世 (King Francis I) 的宫廷中担任科学家和工程师。他于 1519 年去世，被埋葬在附近的圣佛罗伦萨教堂，距离他的家人大约 1,200 公里（750 英里）。 （据说，莱昂纳多与他的同父异母兄弟几乎没有接触；有几个比他小十多岁，历史文件表明在继承方面存在一些冲突。）\n这位伟大的文艺复兴时期的学者在那里躺了 275 年左右，直到革命来到他的祖国。法国大革命期间，圣佛罗伦萨教堂大部分被拆毁；几年后，拿破仑·波拿巴完成了这项工作。在这个过程中，达芬奇的坟墓和他的骨头都消失了。工人们在 1863 年发现了一具骨架，埋在地下的还有一些刻有字母的石头碎片：“EO”、“AR”、“DUS”和“VINC”，发现者将其读为铭文的碎片，曾经“列奥纳达·达·芬奇说。”骷髅的牙齿看起来已经磨损得足以与达芬奇去世时的年龄相吻合，一块刻有弗朗西斯一世国王图像的银盾表明了正确的时期。今天，这具骨架位于附近圣休伯特教堂的一座坟墓中，但 DNA 测试可以帮助确认它是否真的是莱昂纳多。当然，这样的测试需要获得许可——可能来自教会、幸存的亲属、文化遗产官员，或这些的某种组合。目前尚不清楚是否有人会热衷于对被广泛认为是达芬奇骨架的破坏性采样。然而，有趣的是，骨架的所有权现在是一个可检验的假设，即使只是技术上。列奥纳多中世纪晚期和文艺复兴时期的大部分家庭成员都被埋葬在芬奇的圣十字教堂，这座小镇距离意大利佛罗伦萨约 20 英里，这个家族的名字也由此而来。后人将姓氏从“达芬奇”改为“芬奇”。但是，埋葬着艺术家的至少六名男性亲属的家族坟墓已经随着时间和教堂建筑的几次翻修而失传。这意味着莱昂纳多的祖父安东尼奥、他的叔叔弗朗西斯科和他同父异母的兄弟多梅尼科迪马特奥等人的尸体在技术上已经失踪，尽管他们几乎可以肯定仍然在现代教堂地板下的某个地方。 Vezzosi 和 Sabato 以及他们在国际达芬奇 DNA 项目中的同事对寻找这些坟墓很感兴趣，因为他们希望从达芬奇的几代男性家族中抽取 DNA 样本。他们声称，这将有助于确认近 700 年文件中记录的家谱与人与人之间的实际遗传关系相符。最近的一次探地雷达调查在教堂地板下寻找被遗忘的坟墓的痕迹。历史记载说，达芬奇古墓位于建筑中心附近，正门对面；通过将历史平面图与现代平面图进行比较，Vezzosi 和 Sabato 设法找到了曾经是中心的教堂区域，正门对面。在大约正确的位置，他们的雷达调查发现了两个异常现象——无线电波反射与周围土壤不同的地方。教会官员不太可能允许在祭坛前挖掘地板寻找达芬奇的亲属。挖掘多组遗骸以获取 DNA 样本可能需要大量资源并引发严重的道德问题。研究人员通常必须证明他们提出了非常引人注目的科学问题，才能获得开展此类项目的许可和资金，而对历史人物的家谱进行实地调查可能达不到标准。\n许多 Vezzosi 和 Sabato 对达芬奇 DNA 的计划——如果它曾经被测序过——实际上并不具有科学意义。它们主要基于一些关于遗传、智力甚至种族的过时想法。对达芬奇的 DNA 进行测序，Vezzosi 和 Sabato 写道，“将提供有用的元素来科学探索他天才的根源，找到关于他的身体能力和他可能早熟的信息，关于他的左撇子和他的健康和可能的遗传性疾病，并解释某些特殊的感官知觉，比如他非凡的视觉质量和联觉。”一些特定的特征，例如左撇子和一些遗传性健康问题，可能至少部分地写入了达芬奇的基因中。其他的，比如联觉，可能有遗传基础，因为它往往在家庭中运行，但遗传学家还没有确定一个。但是没有已知的智力或创造力的遗传标记。 20 世纪早期危害极大的优生学运动是基于这样一种观点，即智力和道德是人们简单地从父母那里继承来的特征，这一观点今天仍然存在。但是科学讲述了一个非常不同的故事，环境影响与数百个基因的输入混合在一起，每个基因都有微小的影响。 “我们进一步认为莱昂纳多出生于两种不同单倍型的遗传相互作用，即来自两个不同种群的特征的假设具有重要意义和吸引力，”Vezzosi 和 Sabato 写道。一些历史学家认为达芬奇的母亲卡特琳娜可能是一名来自卡法或君士坦丁堡的被奴役的妇女，但韦佐西和萨巴托问道：“这会是列奥纳多天才的起源吗？”总而言之，研究列奥纳多的 DNA 以了解是什么让他感到兴奋的想法提供了一个很好的例子，说明为什么研究人员不应该盲目地离开自己的领域工作。多学科研究很重要，但当不同领域的专家一起工作时，效果最好。", "note_en": "A recently assembled Leonardo da Vinci family tree, spanning 21 generations from 1331 to the present, could pave the way for DNA testing that might confirm whether the bones interred in da Vinci’s grave are actually his. Two art historians’ hopes of uncovering a genetic explanation for the Renaissance artist’s brilliance, however, will probably be doomed by scientific reality.\n  To construct the family tree, art historians Alessandro Vezzosi and Agnese Sabato dug through birth, death, and property records spanning the last 690 years. They also interviewed surviving relatives to learn more about the famous artist, scientist, and inventor’s modern extended family. In the end, they traced da Vinci’s family from his grandfather, born in 1331, to the 14 relatives living today. Leonardo da Vinci himself had no children, and his modern relatives all descend from his 22 (!) half-siblings.\n The present family played an essential role in the new study. “Many of them have collaborated, together with their relatives, to the collection and verification of information,” wrote Vezzosi and Sabato, “helping enthusiastically to contact other family members and retrieve new documents and images.” Those many-times-great nieces and nephews include several office workers (one of whom served as a naval gunner in the 1960s), a retired upholsterer, a surveyor, and a state employee who is “passionate about motorcycling and music.” The oldest is now 85 years old, and the youngest is just one year old.\n For some interesting historical perspective, the artist’s grandfather, Michele da Vinci, would have been a teenager when the Black Death arrived in Italy; his latest 20-times-great niece or nephew was born during the Covid-19 pandemic.\n  Vezzosi and Sabato were especially interested in the male line of descent from da Vinci’s father, a notary named Ser Piero da Vinci, to today’s generations. That’s partly because the male line is easier to trace in historical documents from a time where women’s lives—and sometimes their whole existence—seldom got written down in official records. But it’s mostly because of the Y chromosome, the only part of the human genome that gets passed down directly from father to son. Aside from some small changes that happen over time, the Y-chromosomes of da Vinci’s modern nephews should be extremely similar to those of Michele, Ser Piero, and Leonardo himself.\n That means that by comparing the Y chromosome DNA of modern relatives to ancient DNA from the skeleton buried in da Vinci’s grave, it may be possible to solve a 158-year-old mystery: who is buried in da Vinci’s grave in the Chapel of Saint-Hubert?\n    Leonardo da Vinci spent the last four years of his life in France, working as a scientist and engineer in the court of King Francis I. He lived and worked in the town of Amboise, a stone’s throw from the king’s summer palace, and when he died in 1519, he was buried in the nearby church of St. Florentine, about 1,200 km (750 miles) from the rest of his family. (By all accounts, Leonardo had little contact with his half-brothers; several were more than a decade younger, and historical documents suggest some conflicts over inheritance.)\n And there the great Renaissance scholar lay for the next 275 years or so, until revolution came to his adopted country. During the French Revolution, the church of St. Florentine was mostly demolished; Napoleon Bonaparte finished the job a few years later. In the process, da Vinci’s tomb, and his bones, disappeared.\n Workers at the site found a skeleton in 1863, buried along with some fragments of stone carved with letters: “EO,” “AR,” “DUS,” and “VINC,” which the finders read as broken pieces of an inscription that once said “Leonardus da Vinci.” The skeleton’s teeth looked worn enough to fit da Vinci’s age when he died, and a silver shield etched with an image of King Francis I suggested the right time period. Today, the skeleton resides in a tomb at the nearby Chapel of Saint-Hubert, but DNA testing could help confirm whether it’s really Leonardo.\n Of course, such testing would require permission—possibly from the church, from surviving relatives, from cultural heritage officials, or some combination of those. It’s unclear whether anyone would be keen on destructive sampling from what is widely believed to be the skeleton of Leonardo da Vinci. However, it’s interesting that ownership of the skeleton is a testable hypothesis now, even if only technically.\n  Most of Leonardo’s late medieval and Renaissance-era family members were buried in the church of Santa Croce in Vinci, a town about 20 miles from Florence, Italy, from which the family gets its name. Later generations changed the family name from &#34;da Vinci&#34; to just &#34;Vinci.&#34; But the family tomb, in which at least six of the artist’s male relatives are buried, has been lost to time and several renovations of the church building. That means the bodies of Leonardo’s grandfather Antonio, his uncle Francesco, and his half-brother Domenico di Matteo, among others, are technically missing, although they&#39;re almost certainly still somewhere under the modern church floor.\n Vezzosi and Sabato and their colleagues at the International Leonardo da Vinci DNA Project are interested in finding those graves because they hope to sample DNA from several generations of da Vinci’s male family line. That, they claim, would help confirm that the family tree recorded in nearly 700 years of documents matches the actual genetic relationships between people.\n    A recent ground-penetrating radar survey looked for traces of forgotten tombs under the church floor. Historical records say the old da Vinci tomb lay near the center of the building, opposite its main door; by comparing historical floor plans to modern ones, Vezzosi and Sabato managed to find the area of the church that would once have been the center, opposite the main door. And in about the right spot, their radar survey detected two anomalies—places where the radio waves reflect differently than in the surrounding soil.\n It’s unlikely that church officials would grant permission to dig up the floor in front of the altar to look for Leonardo da Vinci’s relatives. Exhuming several sets of remains to get DNA samples would likely require significant resources and raise serious ethical concerns. Researchers typically have to show that they’re asking very compelling scientific questions in order to get permission and funding to undertake that kind of project, and ground-truthing a historical figure’s family tree probably falls short of the standard.\n  Many of Vezzosi and Sabato&#39;s plans for da Vinci’s DNA—if it’s ever sequenced—don’t actually make scientific sense. They’re largely based on some outdated ideas about heredity, intelligence, and even race.\n Sequencing Leonardo da Vinci&#39;s DNA, Vezzosi and Sabato wrote, “will make available useful elements to scientifically explore the roots of his genius, to find information on his physical prowess and on his possibly precocious aging, on his being left-handed and his health and possible hereditary sicknesses, and to explain certain peculiar sensory perceptions, like his extraordinary visual quality and synesthesia.”\n A few specific traits, like left-handedness and some hereditary health problems, might be at least partially written in da Vinci’s genes. Others, like synesthesia, may have a genetic basis since it tends to run in families, but geneticists haven’t yet pinpointed one. But there’s no known genetic marker for intelligence or creativity. The deeply harmful eugenics movement of the early 20 th century was based on the idea that intelligence and morality were traits that people simply inherited from their parents, an idea that persists today.  But science tells a very different story, with environmental influences mixing with the input of hundreds of genes, each having a tiny effect.\n “We further deem significant and fascinating the hypothesis that Leonardo was born from a genetic interaction of two different haplotypes, that is, from the characteristics of two different populations,” Vezzosi and Sabato wrote. Some historians have suggested that da Vinci’s mother Caterina may have been an enslaved woman from Caffa or Constantinople, but Vezzosi and Sabato speculate by asking, “Could this be the origin of Leonardo’s genius?”\n  All in all, the idea of studying Leonardo’s DNA to learn what made him tick offers a great example of why researchers shouldn’t just blindly charge off to work outside their own fields. Multidisciplinary research is important, but it works best when experts in different fields work together.", "posttime": "2021-07-22 22:53:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "系谱学,leonardo,达芬奇", "title": "系谱学家说列奥纳多·达·芬奇有 14 个在世亲属", "title_en": "Genealogists say Leonardo da Vinci has 14 living relatives", "transed": 1, "url": "https://arstechnica.com/science/2021/07/genealogists-say-leonardo-da-vinci-has-14-living-relatives/", "via": "", "real_tags": ["系谱学", "leonardo", "达芬奇"]}, {"category": "", "categoryclass": "", "imagename": "217e50b18f2f9bc8949fb4b7b8f21dcb.jpeg", "infoid": 1069000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着高度传播的 delta 变体的迅速增加和国家疫苗接种工作的基本停滞，COVID-19 大流行继续在美国未接种疫苗的人群中肆虐——情况看起来很严峻。 COVID-19 病例在所有 50 个州和哥伦比亚特区都在上升。目前，每 10 万人每日新增病例平均数最高的州是阿肯色州、密苏里州、佛罗里达州、路易斯安那州和内华达州，它们的疫苗接种率均低于平均水平。在全国范围内，过去两周平均每日病例增加了 140%。住院人数和死亡人数的增幅落后于数周，也分别增长了 34% 和 33%。相对于大流行的其余部分，全国的病例数、住院人数和死亡人数较低——它们与 2020 年 4 月的数字相当或低于。但在某些地方未接种疫苗的病例率与大流行的高度。疫苗接种覆盖率低的地区正在出现激增。密苏里州——只有 40% 的人口完全接种了疫苗——每天的新病例率与去年 10 月冬季高峰期的情况一样高。该州的一些热点正在创造记录。例如，在西南部的塔尼县，现在每天新增病例的 7 天平均值高于以往任何时候，平均每天新增病例 55 例。此前的最高平均水平是每天 45 例新病例，该县在 11 月 22 日和 12 月 10 日再次出现。在阿肯色州的边境，巴克斯特县上周创下了每日新病例的最高平均记录，即 42每天的案例。这超过了 1 月初创下的 32 人之前的记录。巴克斯特县只有 33% 的人口接种了全面疫苗。这些病例激增正在转化为住院人数的增加。在百特，过去两周住院人数增加了 340%。在密苏里州西南部，医院已经不堪重负，重症监护室已满负荷运转，呼吸机不足，医院报告护士短缺。上周，密苏里州斯普林菲尔德-格林县卫生局要求州政府拨款建立一家野战医院，以帮助应对 COVID-19 重症患者激增的情况。在这些地方和全国其他地方，绝大多数因 COVID-19 住院的人都未接种疫苗。在上周五的白宫新闻发布会上，疾病控制与预防中心主任罗谢尔·瓦伦斯基重申，全国进入医院的 COVID-19 患者中有 97% 以上未接种疫苗。随着低疫苗接种率，delta冠状病毒变种的传播是惨淡激增的背后。据估计，Delta 的传染性是最初的大流行冠状病毒株的两倍多。自 2020 年 12 月在印度首次发现以来，它已成为世界上最主要的变种。自从 3 月份在美国首次发现它以来，它已成为这里的主要菌株，迅速超过 alpha (B.1.1.7)。帮助超传播变种传播的事实是，它到达时恰逢美国许多人开始放松警惕，放松口罩的使用和保持身体距离。\n完全接种疫苗的人在很大程度上免受三角洲的影响；当前的疫苗对于从 delta 和其他令人关注的变体中开发出 COVID-19 仍然非常有效。尽管一小部分人会出现所谓的“突破性感染”，但这些感染大多是无症状或轻微的。但是未接种疫苗的人是完全脆弱的。此外，那些只接种了一剂两剂疫苗或仅从 COVID-19 中康复的人并不比完全未接种疫苗的人好多少。在本月早些时候发表在《自然》杂志上的一项研究中，研究人员测试了在大流行早期（即 delta 出现之前）从 COVID-19 中康复的人的免疫反应。具体来说，研究人员研究了参与者的中和抗体——最有效的抗体类型，被认为对预防大流行性冠状病毒至关重要。研究人员观察从早期 COVID-19 病例中康复的人，发现他们的中和抗体在抵抗 delta 变体方面的效果比在抵抗早期版本的病毒方面低四到六倍。同样，仅接受一剂 mRNA 疫苗的人几乎没有任何可检测到的对 delta 起作用的中和抗体。但是，当康复者接种一剂疫苗或部分接种疫苗的人接种第二剂时，中和抗体会猛增，这两个群体都被认为受到高度保护。这一发现促使健康专家更加强烈地呼吁接种疫苗，如果及时接种，这显然对 delta 有效。 Delta 正在迅速蔓延，可能需要长达六周的时间才能完全接种疫苗并受到保护。对于那些仍未接种疫苗的人来说，尽快接种疫苗以避免感染和传播 delta 至关重要。但根据哥伦比亚广播公司新闻的新民意调查数据，新一波疫苗接种似乎不太可能。在未接种疫苗和部分接种疫苗的人群中，只有 48% 的人表示他们担心 delta。在完全接种疫苗的人群中，72% 的人表示担心这种变异。尽管目前的 COVID-19 疫苗已被证明非常有效和安全，但 53% 未接种或部分接种疫苗的人在民意调查中表示，他们担心副作用。 50% 的受访者认为对政府缺乏信任是不接种疫苗的原因。 45% 的人说他们不相信科学。所有这些百分比都高于早先的民意调查，这表明这些反疫苗情绪在未接种疫苗的人群中越来越强烈。一些可能更有说服力的未接种疫苗的人表示，他们正在等待疫苗获得食品和药物管理局的全面批准（目前，他们在紧急使用授权下获得了 FDA 的授权）。周五，辉瑞和 BioNTech 表示，FDA 已授予他们 mRNA 疫苗的优先审评资格，但他们预计要到 2022 年 1 月才能做出全面批准的决定。\n目前，疫苗供应商每天仅接种约 520,000 支 COVID-19 疫苗，低于 4 月份每天 460 万支的记录。有超过 1.61 亿人接种了疫苗，但只有 48.6% 的美国人口完全接种了疫苗。", "note_en": "With the rapid rise of the highly transmissible delta variant and national vaccination efforts largely stalled, the COVID-19 pandemic continues to rage among the unvaccinated in the US—and things are looking grim.\n Cases of COVID-19 are rising in all 50 states and the District of Columbia. Right now, the states with the highest averages for daily new cases per 100,000 people are Arkansas, Missouri, Florida, Louisiana, and Nevada, which all have below-average vaccination rates. Nationwide, average daily cases are up 140 percent over the past two weeks. Hospitalizations and deaths, which lag behind increases in cases by weeks, are also up 34 percent and 33 percent, respectively.\n Relative to the rest of the pandemic, the nationwide numbers of cases, hospitalizations, and deaths are low—they&#39;re matching or are below numbers seen back in April of 2020. But  rates of cases among the unvaccinated in some places rival those seen at the heights of the pandemic. And areas with low vaccination coverage are seeing surges.\n Missouri—with just 40 percent of its population fully vaccinated—is seeing daily new case rates as high as those seen last October, at the foot of the winter peak. And some hot spots in the state are setting records. In the southwestern county of Taney, for instance, the seven-day average for daily new cases is higher now than at any point previously, with an average of 55 new cases per day. The previous highest average was 45 new cases per day, which the county hit on November 22 and again on December 10. Across the border in Arkansas, Baxter county set a record last week for its highest average of daily new cases, which was 42 new cases per day. That surpassed its previous record of 32, set in early January. Only 33 percent of Baxter county&#39;s population is fully vaccinated.\n    These case surges are translating to increases in hospitalizations. In Baxter, hospitalizations are up 340 percent over the last two weeks. In southwestern Missouri,  hospitals have become overwhelmed, with intensive care units hitting capacity, ventilators running low, and hospitals reporting nursing shortages. Last week, Missouri&#39;s Springfield-Greene County Health Department  requested state funding to set up a field hospital to help handle the surge in patients with severe COVID-19 cases.\n  In these places and elsewhere across the country, the vast majority of those hospitalized with COVID-19 are unvaccinated.  In a White House press briefing last Friday, Rochelle Walensky, director of the Centers for Disease Control and Prevention, reiterated that more than 97 percent of COVID-19 patients entering hospitals nationwide are unvaccinated.\n Along with the low vaccination rates, the spread of the delta coronavirus variant is behind the bleak surges. Delta is estimated to be more than twice as infectious as the original pandemic coronavirus strain. Since it was first detected in India in December 2020, it has become the most dominant variant in the world. And since it was first detected in the US in March, it has become  the dominant strain here, quickly overtaking alpha (B.1.1.7). Helping the hyper-transmissible variant spread is the fact that it arrived just as many people in the US began letting their guard down, easing mask use and physical distancing.\n Fully vaccinated people are largely protected from delta; the current vaccines are still highly effective against developing COVID-19 from delta and other variants of concern. Though a small proportion of people can develop so-called &#34;breakthrough infections,&#34; those infections will mostly be asymptomatic or mild. But unvaccinated people are completely vulnerable. Moreover, those who have received only one dose of a two-dose vaccine or have only recovered from COVID-19 are not much better off than those who are completely unvaccinated.\n In  a study published in Nature earlier this month, researchers tested the immune responses of people who had recovered from COVID-19 early on in the pandemic, before delta arose. Specifically, the researchers looked at the participants&#39; neutralizing antibodies—the most potent type of antibody that is thought to be critical for protection against the pandemic coronavirus. Looking at people who had recovered from early cases of COVID-19, researchers found their neutralizing antibodies were four- to six-fold less effective at fighting off the delta variant than they were at fighting off earlier versions of the virus. Likewise, people who had only received one dose of an mRNA vaccine barely had any detectable neutralizing antibodies that worked against delta.\n    But when recovered people received one vaccine dose or when partially vaccinated people received their second dose, neutralizing antibodies shot up, and both groups were considered highly protected.\n  The finding spurred health experts to intensify their calls for vaccination, which is clearly effective against delta—if it&#39;s done in time. Delta is spreading quickly, and it can take up to six weeks to become fully vaccinated and protected. It is critical for those who remain unvaccinated to get their shots as quickly as possible to avoid catching and spreading delta.\n But according to  new polling data from CBS News, a new wave of vaccinations seems unlikely. Among unvaccinated and partly vaccinated people, only 48 percent said they are concerned about delta. Among fully vaccinated people, 72 percent reported being concerned about the variant.\n Despite the fact that the current COVID-19 vaccines have proven highly effective and safe, 53 percent of those who are unvaccinated or partly vaccinated said in the poll that they are concerned about side effects. Fifty percent of the group cited a lack of trust in the government as a reason not to get vaccinated. And 45 percent said they don&#39;t trust the science. All of these percentages are higher than they have been in earlier polls, indicating that these anti-vaccine sentiments are hardening among the unvaccinated.\n Some unvaccinated people who may be more persuadable have said they are  waiting for the vaccines to receive full approval from the Food and Drug Administration (currently, they are authorized by the FDA under an emergency use authorization). On Friday, Pfizer and BioNTech said that the FDA had granted them  a Priority Review designation for their mRNA vaccine, but they didn&#39;t expect a decision on full approval until January 2022.\n Currently, vaccine providers are administering only around 520,000 COVID-19 vaccines per day, down from a record of 4.6 million in a day in April. With over 161 million people vaccinated, only  48.6 percent of the US population is fully vaccinated.", "posttime": "2021-07-22 22:53:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "蔓延,unvaccinated,疫苗", "title": "未接种疫苗的流行病随着 delta 的蔓延而肆虐；所有 50 个州的病例都在增加", "title_en": "Pandemic of unvaccinated rages with delta’s spread; cases up in all 50 states", "transed": 1, "url": "https://arstechnica.com/science/2021/07/pandemic-of-unvaccinated-rages-with-deltas-spread-cases-up-in-all-50-states/", "via": "", "real_tags": ["蔓延", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "30409055e9be79e0dbad6cdf27b60b06.jpg", "infoid": 1068999, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "反舌鸟非常复杂的歌曲与图瓦人的喉咙歌唱、贝多芬的《第五交响曲》、《冰雪奇缘 2》中的歌曲《Show Yourself》和肯德里克·拉马尔的《达克沃斯》有什么共同点？根据最近发表在《心理学前沿》杂志上的一篇论文，知更鸟在创作歌曲时遵循与人类音乐相似的音乐规则。马克斯普朗克经验美学研究所的神经科学家蒂娜·罗斯克（Tina Roeske）说：“当你听一段时间的模仿鸟时，你会听到这只鸟不只是随机地将它模仿的旋律串在一起。” “相反，它似乎根据一致的规则对相似的旋律片段进行排序。然而，为了科学地检查这种预感，我们不得不使用定量分析来测试数据是否真的支持我们的假设。”知更鸟以其模仿其他鸟类和周围环境中某些声音的能力而闻名，前提是这些声音属于知更鸟的声学范围。例如，鸟类可以模仿蓝鸟但不能模仿乌鸦，模仿树蛙但不能模仿牛蛙。知更鸟超过一半的歌曲是模仿的，该物种拥有由数百种短语组成的令人印象深刻的曲目。几十年来，对模仿鸟的歌曲进行了大量研究，这就是科学家们知道模仿鸟通常将每个音节重复三到五次，以微小的呼吸隔开，然后再转换为新事物的原因。 （“音节”可以是单个音符或一组音符。）1987 年的一项研究对来自四只鸟的数千首歌曲进行了分类，得出的结论是，虽然有数百种音节类型，但大多数并不经常产生； 25% 在样本数据中只出现一次。不太了解的是知更鸟如何选择要唱的音节——也就是说，它们如何创作复杂的歌曲。这不是随机抽样。这项新研究是第一次尝试限定或量化模仿鸟在组合其音乐风格时使用的特定作曲策略：所谓的“变形模式”，类似于主题的变化。为此，该团队检查了五种不同的知更鸟的歌声：三种是在春季中期在野外记录的，另外两种来自公开的鸟鸣数据库 (xeno-canto)。三位作者都为这项研究带来了独特的视角。 Roeske 的专长是动物信号的统计分析。 David Rothenberg 是新泽西理工学院的音乐哲学家，他研究音乐与自然之间的联系。 Dave Gammon 是北卡罗来纳州埃隆大学的野外生物学家，他多年来一直在研究知更鸟（尤其是一只鸟）的歌声。 “当面对一首复杂的知更鸟歌曲时，音乐家会听到一件事，鸟类学家会听到另一件事，而信号分析师会听到另一件事，”作者在谈到这种跨学科方法背后的原因时写道。 “对任何自然现象的最完整的人类知识都来自于将不同的人类认知形式结合起来——没有一个观点否定其他观点。当它们一起应用时，它们是最强大的。”\n该团队创建了知更鸟歌曲的频谱图，以帮助可视化组成音节。他们听了录音并对鸟类的“变形模式”（短语之间的过渡）进行了自己的定性评估。最后，他们将所有内容归结为模仿鸟在从一种声音过渡到另一种声音时采用的四种基本作曲策略：音色变化、音高变化、拉伸过渡和挤压过渡。他们根据研究中使用的五只鸟中三只的样本歌曲量化了四种模式的频率，发现大约一半的变形是基于音色的。诚然，这是一种简化，“几乎每一次转换都涉及一种以上这些模式的混合，”作者承认。这四种模式不是严格的分类系统，而是一种启发式工具。 “我们以此为基础，从中可以得出可检验的假设，”他们写道，将四种模式比作音系学中常用的最小对（例如，“房子/鼠标”、“拉/池”和其他词对仅一个音素不同）。音色描述了音符或乐句的颜色或音调质量。这就是为什么人声、长号、双簧管或长笛，例如，可以击中相同的音符，但听起来却截然不同。使用模仿鸟的音色变形模式，音节的所有内容都保持不变，除了音色。这通常发生在模仿鸟从模仿一种鸟类的叫声转变为具有明显不同音调质量的另一种鸟类，而不改变基本节奏时。在一个案例中，反舌鸟从一个类似于蓝鸟的“泵柄”叫声的非模仿短语开始，然后逐渐演变成模仿蓝鸟。作者指出图瓦人的喉咙歌唱（特别是 Huun-Huur-Tu 组的歌曲）作为人类音乐的一个例子，它清楚地显示了相同的音色变形模式。他们写道：“一个人的声音会改变上泛音部分的质量，所以听起来像不止一个人在唱歌。”音高变形模式是指音节的音高或频率发生变化。例如，一只知更鸟可能会首先模仿北方闪烁或卡罗莱纳鹪鹩的叫声，然后为该叫声的非模仿版本记下几个音符。任何听过贝多芬“第五交响曲”开头音符的人都会认出这种策略，其中第一个“duh-duh-duh-DUH”之后是相同的低音乐句。 （传说当被问及开场时，贝多芬回答说：“那是命运敲门的声音。”）当知更鸟放慢或拉伸选择的音节时，就会出现拉伸（或半场）变形模式，就像模仿夏季唐纳雀的叫声并将其拉长，直到它变成北方红衣主教的叫声片段。根据 Roeske 等人的说法，Idina Menzel 在 Show Yourself 的结尾采用了类似的策略。挤压变形模式与拉伸模式相反，其中一个乐句后面跟着一个执行速度更快的相似乐句，同时保持相同的音色和音高。 Kendrick Lamar 在 2017 年专辑 Damn 的“Duckworth”中使用了类似的方法，将挤压与音高变形相结合。 “这并没有白白赢得普利策音乐作曲奖，”作者写道。 “拉马尔使用了一系列的构图策略，这些策略已经为模仿鸟创造了数百万年的奇迹。”\n由此，Roeske 等人。得出的结论是，模仿鸟创作他们的歌曲就像人类作曲家一样，从其他鸟类的旋律中提取出遵循这四种基本变形模式或作曲“规则”的乐句——就像人类遵循“和声运动规则”一样。这里存在一些拟人化的风险：我们对看到我们自己和其他物种之间的相似性有一种过于人性化的偏见。这就是为什么作者煞费苦心地通过额外的分析来控制这种偏见，发现知更鸟通常比偶然预期的更频繁地选择具有相似声学特性的相邻短语。因此，这种它们在短语之间变形的定性感知不仅仅是由于人为偏见。也就是说，他们不能完全排除这些变形模式仅仅是歌曲短语如何存储在大脑中的副产品的可能性。罗斯克等人。实际上，在他们的论文中一次又一次地向后弯腰强调这一点，以免被同事指责“通过仅用鸟的功能性声音听到音乐而超越了科学的界限”。也就是说，他们坚持说，“科学家或音乐学家在进行相关研究之前假设知更鸟没有美感是天真的……”特别是因为有相当多的证据表明其他物种的鸟鸣美学，例如黑头山雀（音高变形）、麻雀（挤压）或峡谷鹪鹩（伸展）。", "note_en": "What do the remarkably complex songs of the  mockingbird have in common with  Tuvan throat singing, Beethoven&#39;s &#34; Fifth Symphony,&#34; the song &#34; Show Yourself&#34; from   Frozen 2, and  Kendrick Lamar&#39;s &#34; Duckworth&#34;? According to  a recent paper published in the journal Frontiers in Psychology, the mockingbird follows similar musical rules when composing its songs to those used in human music.\n &#34;When you listen for a while to a mockingbird, you can hear that the bird isn&#39;t just randomly stringing together the melodies it imitates,&#34;  said co-author Tina Roeske, a neuroscientist at the Max Planck Institute for Empirical Aesthetics. &#34;Rather, it seems to sequence similar snippets of melody according to consistent rules. In order to examine this hunch scientifically, however, we had to use quantitative analyses to test whether the data actually supported our hypotheses.&#34;\n Mockingbirds are known for their ability to mimic other birds and certain sounds from their surrounding environment, provided those sounds fall into the mockingbird&#39;s acoustic range. For example, the birds can mimic blue jays but not ravens, tree frogs but not bullfrogs. Over half of the mockingbird&#39;s songs are mimicry, and the species boasts an impressive repertoire composed of hundreds of types of phrases.\n There have been numerous studies of mockingbird songs over the decades, which is how scientists know that mockingbirds typically repeat each syllable three to five times, separated by tiny breaths, before switching to something new. (A &#34;syllable&#34; can be a single note or a cluster of notes.) One  1987 study classified thousands of song phrases from just four birds, concluding that while there are hundreds of syllable types, most aren&#39;t produced frequently; 25 percent appeared just once in the sample data.\n What&#39;s less understood is how mockingbirds choose which syllables to sing—that is, how they go about composing their complex songs. It&#39;s not a random sampling. This new study is the first attempt to qualify or quantify the specific compositional strategies the mockingbird uses when putting together its musical stylings: so-called &#34;morphing modes,&#34; akin to variations on a theme. To do so, the team examined the songs of five different mockingbirds: three were recorded in the field in mid-spring, and two others came from a publicly available birdsong database (xeno-canto).\n  All three authors brought a unique perspective to the study. Roeske&#39;s specialty is the statistical analysis of animal signals. David Rothenberg is a music philosopher at the New Jersey Institute of Technology who studies the connections between music and nature. And Dave Gammon is a field biologist at Elon University in North Carolina, who has studied the songs of mockingbirds (and one bird in particular) for many years.\n    &#34;When confronted with a complex mockingbird song, a musician will hear one thing, an ornithologist another, and a signal analyst something else,&#34; the authors wrote of the reasoning behind this inter-disciplinary approach. &#34;The most complete human knowledge of any natural phenomenon comes from combining distinct human forms of knowing—no one perspective negates the others. They are strongest when applied together.&#34;\n The team created spectrograms of the mockingbirds&#39; songs to help visualize the component syllables. They listened to the recordings and made their own qualitative assessments of the birds&#39; &#34;morphing modes&#34; (the transitions between phrases). In the end, they boiled everything down to four basic compositional strategies employed by mockingbirds as they transition from one sound to the next:  timbre change,  pitch change, stretching the transition, and squeezing the transition. They quantified the frequency of the four modes based on sample songs from three of the five birds used in the study and found that roughly half of all the morphing was based on timbre.\n Granted, this is a simplification, and &#34;almost every transition involves a mixture of more than one of these modes,&#34; the authors acknowledged. The four modes are not a strict system of classification but more of a heuristic tool. &#34;We use this as the basis from which testable hypotheses can be derived,&#34; they wrote, likening the four modes to the minimal pairs commonly used in phonology (e.g., &#34;house/mouse&#34;, &#34;pull/pool&#34;, and other word pairs that differ by a single phoneme).\n    Timbre describes the color or tonal quality of a musical note or phrasing. It&#39;s why a human voice, a trombone, an oboe, or a flute, for instance, can hit the same note and yet all sound distinctly different. With the timbre morphing mode of mockingbirds, everything about the syllable stays the same, except for the timbre. This typically happens when the mockingbird shifts from mimicking the call of one bird species to another with a markedly different tonal quality, without changing the basic rhythm. In one case, the mockingbird began with a non-mimetic phrase that was similar to the &#34;pump handle&#34; call of the blue jay, then gradually morphed into imitating the blue jay.\n The authors point to Tuvan throat singing (specifically, a song by the group  Huun-Huur-Tu) as an example of human music that clearly shows the same timbre morphing mode. &#34;A single human voice changes the quality of the upper overtone partials so it sounds like more than one person is singing,&#34; they wrote.\n    The pitch morphing mode is when just the pitch or frequency of the syllable changes. For instance, a mockingbird may begin by mimicking the call of a Northern flicker or a Carolina wren, and then take it up a few notes for a non-mimetic version of that call. Anyone who&#39;s heard the opening notes of  Beethoven&#39;s &#34;Symphony No. 5&#34; will recognize the strategy, in which the first &#34;duh-duh-duh-DUH&#34; is followed by the same phrasing at a lower pitch. (Legend has it that when asked about the opening,  Beethoven replied, &#34;That is the sound of fate knocking at the door.&#34;)\n The stretch (or half-time) morphing mode occurs when the mockingbird slows down or stretches the syllable of choice, like mimicking a summer tanager&#39;s call and stretching it out until it morphs into a fragment of a call from a northern cardinal. According to Roeske  et al., Idina Menzel employs a similar strategy toward the end of  Show  Yourself.\n  The squeeze morphing mode is the opposite of the stretch mode, wherein one phrase is followed by a similar phrase that is performed much faster, while maintaining the same timbre and pitch. Kendrick Lamar uses a similar approach in &#34;Duckworth&#34; from the 2017 album   Damn, combining squeezing with pitch morphing. &#34;This did not  win the Pulitzer Prize in music composition for nothing,&#34; the authors wrote. &#34;Lamar uses a whole series of compositional strategies that have worked wonders for mockingbirds for millions of years.&#34;\n From this, Roeske  et al. conclude that mockingbirds compose their songs much like human composers do, drawing phrases from other birds&#39; melodies that follow these four basic morphing modes, or compositional &#34;rules&#34;—just like humans follow the &#34;rules of harmonic motion.&#34;\n There is some risk of anthropomorphism at play here: we have an all-too-human bias toward seeing similarities between ourselves and other species. That&#39;s why the authors took pains to control for such a bias with additional analysis, finding that mockingbirds generally pick adjacent phrases with similar acoustic properties more often than would be expected by chance. So this qualitative perception that they are morphing between phrases is not just due to human bias. That said, they can&#39;t quite rule out the possibility that these morphing modes are a mere byproduct of how song phrases are stored in the brain.\n Roeske  et al. practically bend over backwards in their paper to emphasize this point again and again, lest they be accused by colleagues of &#34;over-stepping the bounds of science by hearing music in the mere functional sounds of a bird.&#34; That said, they insist, &#34;It would be naive... for scientists or musicologists to assume that mockingbirds do not have an aesthetic sense until the relevant studies have been performed,&#34; particularly since there is considerable evidence of birdsong aesthetics in other species, such as  black-capped chickadees (pitch morphing),  field sparrows (squeezing), or  canyon wrens (stretching).", "posttime": "2021-07-22 22:53:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "知更鸟,connection,模仿", "title": "知更鸟之歌与肯德里克·拉马尔之间令人惊讶的联系", "title_en": "The surprising connection between a mockingbird’s song and Kendrick Lamar", "transed": 1, "url": "https://arstechnica.com/science/2021/07/the-surprising-connection-between-a-mockingbirds-song-and-kendrick-lamar/", "via": "", "real_tags": ["知更鸟", "模仿"]}, {"category": "", "categoryclass": "", "imagename": "d7dfce1dec7431c81ee8d39659f9f7b1.jpg", "infoid": 1068998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东部时间上午 9 点 45 分更新：在德克萨斯州西部当地时间上午 8 点 12 分，日出后大约一小时，蓝色起源的新谢泼德发射系统飞向天空。这次飞行任务的乘客不拘一格——亿万富翁杰夫·贝佐斯和他的兄弟马克、著名的女飞行员沃利·芬克和 18 岁的奥利弗·戴门。不到 20 分钟后，所有四个人都从位于德克萨斯州西部沙漠的太空舱中出来。在飞行过程中，他们到达了 107 公里的高度，跨越了国际商定的太空边界。这是蓝色起源的第一次载人航天飞行，紧随其后的是维珍银河公司的创始人理查德布兰森爵士在 9 天前成功飞行。我们真正进入了载人航天的新时代。原帖： 火箭公司 Blue Origin 的官员表示，他们将在周二进行首次载人航天飞行，这将搭载创始人杰夫·贝佐斯和其他三名乘客在西德克萨斯上空 100 公里的亚轨道上跳跃。该任务的首席飞行总监史蒂夫拉尼亚斯在与记者的电话中说，工程师们在周末完成了发射的“飞行准备审查”，发现新谢泼德火箭和太空舱处于完美状态。天气看起来也很合理，预计在美国中部时间上午 8 点（UTC 时间 13:00）的预期起飞时间之前，任何清晨风暴都会过去。贝索斯和其他三名乘客——他的兄弟马克、航空先驱沃利·芬克和来自荷兰的付费客户奥利弗·达门——在本周末接受了大约 14 小时的培训，为期两天。他们的飞行将完全自主。发射后，太空舱将与火箭分离，乘客将有大约三分钟的失重时间，然后他们必须回到座位上返回地球。返回地球大气层后，由于重力作用在返回的车辆上，乘客将经历大约 5 G。 Blue Origin 首席执行官鲍勃·史密斯 (Bob Smith) 表示，这种特殊的太空舱和火箭此前曾进行过两次飞行。尽管 Blue Origin 有少数前宇航员在职，但该公司决定与贝佐斯、他的受邀客人和一位客户一起进行首次飞行，而不是让前宇航员测试飞行器。 “老实说，我们没有看到以这种方法逐步做事的任何价值，”史密斯说。\nBlue Origin 表示，一位不愿透露姓名的竞标者在拍卖会上以 2800 万美元的价格购买了该航班的一个座位，但随后由于日程安排冲突而退出。该公司随后在拍卖期间获得了亚军，荷兰对冲基金经理乔斯·达门 (Joes Daemen)。他为让儿子奥利弗坐飞机的座位付出了未具体说明的代价。史密斯说，来自 150 个国家/地区的 7,500 人参加了 Blue Origin 新谢泼德座椅的拍卖。该公司尚未透露 New Shepard 的座位收费多少，但 Blue Origin 似乎有意获得市场能够承受的任何价格，预计早期航班的座位费用将超过 100 万美元。史密斯说：“早期航班的价格很划算。” Blue Origin 计划在 2021 年再执行两次客户航班，虽然该公司没有透露，但只要没有重大技术问题，它很可能在 2022 年执行大约 12 次这样的任务。对于周二的航班，该公司将提供网络广播，预计将在预计起飞时间前约 90 分钟开始。因此，网络广播应该在德克萨斯州当地时间上午 6:30 或 UTC 时间大约 11:30 上线。", "note_en": "9:45am ET Update: At 8:12 am local time in West Texas, about one hour after sunrise, Blue Origin&#39;s New Shepard launch system rocketed into the sky. The mission carried an eclectic mix of passengers—billionaire Jeff Bezos and his brother Mark, famed female aviator Wally Funk, and 18-year-old Oliver Daemen.\n All four emerged from the capsule, in the west Texas desert, less than 20 minutes later. During the flight they reached an altitude of 107 km, crossing the internationally agreed upon boundary of space.\n This was Blue Origin&#39;s first human spaceflight and follows Virgin Galactic&#39;s successful flight of its founder, Sir Richard Branson, nine days ago. We truly have entered into a new era of human spaceflight.\n Original post: Officials with the rocket company Blue Origin said they remain on track for their first human spaceflight on Tuesday, which will carry founder Jeff Bezos and three other passengers on a suborbital hop 100 km above West Texas.\n Steve Lanias, the lead flight director for the mission, said during a call with reporters that engineers completed a &#34;Flight Readiness Review&#34; for the launch over the weekend and found the New Shepard rocket and capsule to be in perfect condition. Weather, too, looks reasonable with any early morning storms expected to pass before the anticipated liftoff time of 8 am CT (13:00 UTC).\n Bezos and the other three passengers—his brother, Mark, aviation pioneer Wally Funk, and a paying customer from the Netherlands named Oliver Daemen—underwent about 14 hours of training this weekend across two days. Their flight will be entirely autonomous. After launch the capsule will separate from the rocket, and the passengers will have about three minutes of weightlessness before they must strap back into their seats for the return to Earth. Upon reentry to Earth&#39;s atmosphere the passengers will experience about 5 Gs as gravity exerts itself on the returning vehicle.\n    This particular capsule and rocket has made two flights previously, said Blue Origin CEO Bob Smith. Although Blue Origin has a handful of former astronauts on staff, the company decided to fly its first flight with Bezos, his invited guests, and a customer rather than having the former astronauts test the vehicle. &#34;We didn’t see any value, quite honestly, in doing things stepwise in that approach,&#34; Smith said.\n An unnamed bidder paid $28 million at an auction for a seat on this flight but then backed out due to scheduling conflicts, Blue Origin said. The company then turned to a runner-up during the auction, Dutch hedge fund manager Joes Daemen. He paid an unspecified price for the seat to fly his son, Oliver.\n Smith said 7,500 people from 150 countries participated in Blue Origin&#39;s auction for the New Shepard seat. The company has not disclosed how much it will charge for seats on New Shepard, but Blue Origin seems intent on getting whatever price the market will bear, with seats on early flights expected to cost significantly more than $1 million. &#34;The early flights are going for a good price,&#34; Smith said.\n  Blue Origin plans to fly two more customer flights in 2021, and although the company did not say, it is likely to fly about a dozen such missions in 2022 as long as there are no significant technical problems.\n For Tuesday&#39;s flight, the company will provide a webcast, which is expected to begin about 90 minutes before the anticipated liftoff time. So the webcast should go live at 6:30 am local time in Texas, or about 11:30 UTC.", "posttime": "2021-07-22 22:53:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "blue,origin,飞行", "title": "Blue Origin 成功完成首次载人发射 [更新]", "title_en": "Blue Origin successfully completes its first human launch [Updated]", "transed": 1, "url": "https://arstechnica.com/science/2021/07/blue-origin-set-for-historic-first-human-flight-of-its-new-shepard-system/", "via": "", "real_tags": ["blue", "origin", "飞行"]}, {"category": "", "categoryclass": "", "imagename": "9ebfb691a67e5f3aa5436db817b5cc22.jpg", "infoid": 1068997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一份报告称 NSO Group 的 Pegasus 间谍软件被用于针对记者和人权活动家之后，苹果公司面临着与其硅谷竞争对手合作以抵御监控技术的共同威胁的压力。国际特赦组织分析了 NSO 客户针对的数十款智能手机，称苹果公司关于其设备卓越的安全性和隐私性的营销声明已被“撕裂”，因为即使是最新版本的 iPhone 和 iOS 软件也发现了漏洞。 “数以千计的 iPhone 可能遭到入侵，”国际特赦组织技术部门副主任丹娜·英格尔顿 (Danna Ingleton) 说。 “这是一个全球性的问题——任何人和每个人都面临风险，甚至像苹果这样的科技巨头也没有能力应对手头的大规模监控。”安全研究人员表示，苹果可以通过与其他科技公司合作，分享有关漏洞的详细信息并审查其软件更新，从而采取更多措施来解决这个问题。移动安全提供商 Lookout 的首席战略官 Aaron Cockerill 表示：“不幸的是，苹果在这种合作方面做得很差。”与谷歌的 Android 相比，他将 iOS 描述为一个“黑匣子”，他说在那里他“更容易识别恶意行为。”大赦国际与新闻非营利组织 Forbidden Stories 和“飞马计划”的 17监视目标。曾表示其技术旨在仅针对犯罪或恐怖主义嫌疑人的国家统计局将 Pegasus 项目的说法描述为“虚假指控”和“充满错误假设和未经证实的理论”。大赦国际的研究发现，苹果公司的 iMessage 使用所谓的零点击攻击（不需要用户打开链接）进行了多次窃取数据和窃听 iPhone 的尝试。\n公民实验室的研究员比尔·马尔扎克 (Bill Marczak) 是一个广泛记录 NSO 策略的非营利组织，他表示，大赦国际的调查结果表明，苹果在 iMessage 安全方面存在“主要的闪烁红色五级警报问题”。攻击是在 2019 年使用 Facebook 拥有的 WhatsApp Messenger 确定的。 WhatsApp 负责人 Will Cathcart 称最新披露是“对互联网安全的警钟”。在一系列推文中，他指出谷歌、微软和思科等科技公司采取的措施试图反击 Pegasus 和其他商业间谍软件工具。卡斯卡特说：“我们需要更多的公司，尤其是政府，采取措施让 NSO 集团承担责任。”虽然苹果“在保护消费者方面做得很好，”Lookout 的 Cockerill 说。 ，它“应该更多地与像我这样的公司合作”以防止像 Pegasus 这样的攻击。苹果坚称它确实与外部安全研究人员合作，但选择不公开这些活动，其中包括每年支付数百万美元的“安全赏金”奖励发现漏洞并向研究人员提供其硬件。\n“十多年来，苹果在安全创新方面一直处于行业领先地位，因此，安全研究人员一致认为 iPhone 是市场上最安全、最安全的消费移动设备，”苹果在一份声明中表示。 “像所描述的那样的攻击非常复杂，开发成本数百万美元，通常保质期很短，并且用于针对特定个人，”Apple 继续说道。 “虽然这意味着它们不会对我们绝大多数用户构成威胁，但我们将继续不知疲倦地保护所有客户，并不断为他们的设备和数据添加新的保护措施。” © 2021 The Financial Times Ltd. 保留所有权利 不得以任何方式重新分发、复制或修改。", "note_en": "Apple has come under pressure to collaborate with its Silicon Valley rivals to fend off the common threat of surveillance technology after a report alleged that NSO Group’s Pegasus spyware was used to  target journalists and human rights activists. Amnesty International, which analyzed dozens of smartphones targeted by clients of NSO, said Apple’s marketing claims about its devices’ superior security and privacy had been “ripped apart” by the discovery of vulnerabilities in even the most recent versions of its iPhones and iOS software.\n “Thousands of iPhones have potentially been compromised,” said Danna Ingleton, deputy director of Amnesty’s tech unit. “This is a global concern—anyone and everyone is at risk, and even technology giants like Apple are ill-equipped to deal with the massive scale of surveillance at hand.”\n Security researchers said Apple could do more to tackle the problem by working with other tech companies to share details about vulnerabilities and vet their software updates.\n “Apple unfortunately does a poor job at that collaboration,” said Aaron Cockerill, chief strategy officer at Lookout, a mobile security provider. He described iOS as a “black box” compared with Google’s Android, where he said it was “much easier to identify malicious behavior.&#34;\n Amnesty worked with the journalism nonprofit group Forbidden Stories and 17 media partners on the “Pegasus Project” to identify alleged targets of surveillance.\n NSO, which has said its technology was designed to target only criminal or terrorist suspects, described the Pegasus Project’s claims as “false allegations” and “full of wrong assumptions and uncorroborated theories.&#34;\n    Amnesty’s research found that several attempts to steal data and eavesdrop on iPhones had been made through Apple’s iMessage using so-called zero-click attacks, which do not require the user to open a link.\n Bill Marczak, research fellow at Citizen Lab, a nonprofit group that has extensively documented NSO’s tactics, said Amnesty’s findings suggested that Apple had a “major blinking red five-alarm-fire problem with iMessage security.&#34;\n A similar kind of zero-click Pegasus attack was identified using Facebook-owned WhatsApp messenger in 2019.\n Will Cathcart, head of WhatsApp, called the latest disclosures a “wake-up call for security on the Internet.” In a series of tweets, he pointed to steps taken by tech companies including Google, Microsoft, and Cisco that have sought to push back against Pegasus and other commercial spyware tools.\n But Apple, with whom Facebook has a long-running feud over the iPhone’s privacy controls, was absent from his list of collaborators.\n “We need more companies, and, critically, governments, to take steps to hold NSO Group accountable,” Cathcart said.\n While Apple does “a great job protecting consumers,” said Lookout’s Cockerill, it “should be more collaborative with firms like my own” to protect against attacks such as Pegasus.\n  Apple insisted that it did collaborate with external security researchers but chose not to publicize the activities, which included paying out millions of dollars a year in “security bounty” rewards for spotting vulnerabilities and providing its hardware to researchers.\n “For over a decade, Apple has led the industry in security innovation and, as a result, security researchers agree iPhone is the safest, most secure consumer mobile device on the market,” Apple said in a statement.\n “Attacks like the ones described are highly sophisticated, cost millions of dollars to develop, often have a short shelf life and are used to target specific individuals,” Apple continued. “While that means they are not a threat to the overwhelming majority of our users, we continue to work tirelessly to defend all our customers, and we are constantly adding new protections for their devices and data.”\n © 2021 The Financial Times Ltd.  All rights reserved Not to be redistributed, copied, or modified in any way.", "posttime": "2021-07-22 22:52:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,软件,iphone,pressure", "title": "在 NSO 间谍软件声称后，苹果面临 iPhone 安全性的压力", "title_en": "Apple under pressure over iPhone security after NSO spyware claims", "transed": 1, "url": "https://arstechnica.com/information-technology/2021/07/apple-under-pressure-over-iphone-security-after-nso-spyware-claims/", "via": "", "real_tags": ["苹果", "apple", "软件", "iphone", "pressure"]}, {"category": "", "categoryclass": "", "imagename": "c12ac1ea809dd4febd48c104a8f9d001.jpg", "infoid": 1068995, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们现在处于机器学习项目的第三阶段——也就是说，我们已经摆脱了否认和愤怒，我们现在正陷入讨价还价和沮丧。我的任务是使用 Ars Technica 来自五年标题测试的大量数据，这些测试在“A/B”测试中将两个想法相互配对，让读者决定将哪个想法用于一篇文章。目标是尝试构建一种机器学习算法，可以预测任何给定标题的成功。到我上次登记入住时，它是……没有按计划进行。我还花了几美元在 Amazon Web Services 的计算时间上发现了这一点。实验可能有点贵。 （提示：如果您的预算有限，请不要使用“AutoPilot”模式。）我们尝试了几种方法来解析来自 5,500 个标题测试的 11,000 个标题的集合——一半是赢家，一半是输家。首先，我们以逗号分隔值的形式获取了整个语料库，并使用 AWS 的 SageMaker Studio 中的 Autopilot 工具尝试了“Hail Mary”（或者，我回想起来，“Leeroy Jenkins”）。结果验证的准确率为 53%。回想起来，结果并没有那么糟糕，因为当我使用专门为自然语言处理构建的模型——AWS 的 BlazingText——结果是 49% 的准确率，甚至比抛硬币还要糟糕。 （顺便说一句，如果其中大部分内容听起来像是无稽之谈，我建议您重新阅读第 2 部分，在那里我更详细地介绍了这些工具。）AWS 技术布道者 Julien Simon 的经历既令人欣慰又令人沮丧我们的数据也同样缺乏运气。在二进制分类模式下使用我们的数据集尝试替代模型只能勉强达到 53% 到 54% 的准确率。所以现在是时候弄清楚发生了什么以及我们是否可以通过对学习模型进行一些调整来修复它。否则，可能是时候采取完全不同的方法了。", "note_en": "We&#39;re in phase three of our machine-learning project now—that is, we&#39;ve gotten past denial and anger, and we&#39;re now sliding into bargaining and depression. I&#39;ve been tasked with using Ars Technica&#39;s trove of data from five years of headline tests, which pair two ideas against each other in an  &#34;A/B&#34; test to let readers determine which one to use for an article. The goal is to try to build a machine-learning algorithm that can predict the success of any given headline. And  as of my last check-in, it was… not going according to plan.\n I had also spent a few dollars on Amazon Web Services compute time to discover this. Experimentation can be a little pricey. ( Hint: If you&#39;re on a budget, don&#39;t use the &#34;AutoPilot&#34; mode.)\n We&#39;d tried a few approaches to parsing our collection of 11,000 headlines from 5,500 headline tests—half winners, half losers. First, we had taken the whole corpus in comma-separated value form and tried a &#34;Hail Mary&#34; (or, as I see it in retrospect, a &#34; Leeroy Jenkins&#34;) with the Autopilot tool in AWS&#39; SageMaker Studio. This came back with an accuracy result in validation of 53 percent. This turns out to be not that bad, in retrospect, because when I used a model specifically built for natural-language processing—AWS&#39;  BlazingText—the result was 49 percent accuracy, or even worse than a coin-toss. (If much of this sounds like nonsense, by the way, I recommend  revisiting Part 2, where I go over these tools in much more detail.)\n    It was both a bit comforting and also a bit disheartening that AWS technical evangelist Julien Simon was having similar lack of luck with our data. Trying  an alternate model with our data set in binary classification mode only eked out about a 53 to 54 percent accuracy rate. So now it was time to figure out what was going on and whether we could fix it with a few tweaks of the learning model. Otherwise, it might be time to take an entirely different approach.", "posttime": "2021-07-22 22:52:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "标题,headline", "title": "我们的 AI 标题实验还在继续：我们是否打破了机器？", "title_en": "Our AI headline experiment continues: Did we break the machine?", "transed": 1, "url": "https://arstechnica.com/information-technology/2021/07/our-ai-experiment-continues-did-we-break-the-machine/", "via": "", "real_tags": ["标题", "headline"]}, {"category": "", "categoryclass": "", "imagename": "6dab2a58216c55ae1bd1e1fadec667d4.jpeg", "infoid": 1068993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据日本报道，与东京奥运会有关的 COVID-19 病例数已上升至 71 例，其中至少有 3 例在为运动员提供住所的奥运村内得到确认。至少一位公共卫生专家表示，不断增加的病例数表明，围绕奥运会设计的保护性 COVID 泡沫甚至在国际体育赛事开始前几天就已经破裂。据美联社报道，奥运会组织者周二表示，总数达到 71 人，其中包括 31 名抵达东京参加奥运会比赛或工作的国际旅客。该计数还包括日本的奥运会认证承包商和志愿者，他们的冠状病毒检测呈阳性。南非足球队在奥运村内至少出现了三起案件，其中包括两名球员和一名官员。据《纽约时报》报道，目前有 21 名与这些病例有关的人正在隔离。此外，美国奥运官员周一证实，尽管已接种疫苗，但作为女子体操队替补的密苏里人卡拉·埃克 (Missorian她在东京郊外的千叶县训练时检测呈阳性，并已进入 10 至 14 天的隔离期。据说她感觉很好。另一位美国体操替补 Leanne Wong 也因密切接触而被隔离。 《泰晤士报》指出，有报道称捷克排球运动员翁德热·佩鲁希奇在奥运村的检测结果也呈阳性。此外，八名来自英国的旅客正在隔离，其中包括六名运动员和两名奥运会工作人员，因为他们在飞往东京的航班上的一个人在机场测试呈阳性。伦敦国王学院人口健康研究所前所长 Kenji Shibuya 周二对路透社说：“很明显，泡沫系统有点破裂。” “当然，我最担心的是，村里或一些住宿和与当地人的互动会出现集群感染。”\n涩谷对奥运泡沫边缘人群的有限测试以及难以控制个人的动作和互动表示担忧。例如，一名乌干达举重运动员在大阪府的训练营中失踪，几天后又出现在 100 英里外的一个小镇。当他没有出现在他的日常冠状病毒测试中时，官员们意识到他失踪了。尽管迄今为止发现的病例是在数以万计的奥运会工作人员中，但高度传播的 delta 冠状病毒变种的存在和人员的持续混合有可能助长可能在城市外迅速蔓延的疫情。这是日本健康专家反复提出的一个问题。这种情况也引发了人们的质疑，即奥运会组织者是否将奥运会的利润置于居民和运动员的健康和安全之上。由于 COVID-19 病例继续攀升，东京目前处于紧急状态。仅在周六，东京就记录了 1,400 例新病例。自 1 月份出现最大的 COVID-19 激增以来，该地区的每日病例数从未如此高，达到峰值，每天约有 2,500 例新病例。日本只有大约 22% 的人口接种了疫苗。卫生官员已经禁止国内外球迷参加比赛。", "note_en": "The number of COVID-19 cases linked to the Tokyo Olympics has risen to 71, with at least three cases confirmed within the Olympic Village that is housing athletes, according to reports out of Japan.\n At least one public health expert says the rising case count indicates that the protective COVID bubble designed around the games has already burst days before the international sporting event even starts.\n Olympics organizers said Tuesday that  the tally hit 71, including 31 international travelers who had arrived in Tokyo to compete or work at the games, the Associated Press reports. The count also includes Olympic-accredited contractors and volunteers in Japan who have tested positive for the pandemic coronavirus.\n At least three cases have popped up within the Olympic Village among the South African soccer team, including two players and one official. Twenty-one people linked to those cases are now quarantining, according to The New York Times.\n Additionally, US Olympic officials confirmed Monday that Missourian Kara Eaker, an alternate on the women’s gymnastics team, became infected despite being vaccinated. She tested positive while training in Chiba prefecture outside Tokyo and has gone into a 10- to 14-day quarantine. She is said to be feeling fine. Another US gymnastics alternate, Leanne Wong, is also under quarantine due to close contact.\n  The Times noted that there have been reports that Czech Republic volleyball player Ondřej Perušič also tested positive in the Olympic Village. Additionally, eight travelers from Britain are quarantining—including six athletes and two Olympics staff members—after a person on their flight into Tokyo tested positive at the airport.\n    &#34;It&#39;s obvious that  the bubble system is kind of broken,&#34; Kenji Shibuya, the former director of the Institute for Population Health at King&#39;s College London, told Reuters Tuesday. &#34;My biggest concern is, of course, there will be a cluster of infections in the village or some of the accommodation and interaction with local people.&#34;\n Shibuya expressed concern for limited testing among people on the fringes of the Olympic bubble as well as difficulty controlling individual people&#39;s movements and interactions. For example,  a Ugandan weightlifter already went missing from his training camp in Osaka prefecture and turned up days later in a town 100 miles away. Officials realized he was missing when he didn&#39;t show up for his daily coronavirus test.\n Though the cases identified so far are among tens of thousands of people working on the games, the presence of the hyper-transmissible delta coronavirus variant and the continued mixing of people risk fueling outbreaks that could mushroom out of the city. It&#39;s a concern that has been raised repeatedly by health experts in Japan. The situation has also raised questions about whether the Olympic organizers have put profits from the games above the health and safety of residents and athletes.\n Tokyo is currently under a state of emergency due to COVID-19 cases, which continue to climb upward. On Saturday alone, Tokyo logged  1,400 new cases. The area hasn&#39;t seen a daily count that high since its largest COVID-19 surge in January, which peaked with around 2,500 daily new cases. Only about 22 percent of Japan&#39;s population is fully vaccinated. Health officials have already  banned both domestic and foreign fans from attending the games.", "posttime": "2021-07-22 22:52:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新冠病毒,病毒,运动员,athlete,奥运会", "title": "奥运新冠病毒泡沫已经“破裂”，71例，运动员村3例", "title_en": "Olympic COVID bubble already “broken” with 71 cases, 3 in athlete village", "transed": 1, "url": "https://arstechnica.com/science/2021/07/olympic-covid-bubble-already-broken-with-71-cases-3-in-athlete-village/", "via": "", "real_tags": ["新冠病毒", "病毒", "运动员", "athlete", "奥运会"]}, {"category": "", "categoryclass": "", "imagename": "b9137a6fae8cb0320b456cb955164a3c.jpg", "infoid": 1068992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的 Dealmaster 的头条新闻是苹果 iPad Air 的大幅折扣，因为第四代平板电脑目前在亚马逊和百思买上降至 500 美元。这比苹果的建议零售价低了 100 美元，比我们过去几个月在亚马逊上看到的平均街价低了大约 50 美元。无论哪种方式，折扣都标志着我们从主流零售商那里为该设备跟踪的最低价格。请注意，此优惠适用于具有 64GB 存储空间的入门级机型；如果您想升级到更高容量的 256GB 型号，该版本的售价为 650 美元，这是另一个历史最低价。我们在去年 11 月的评测中对 iPad Air 给予了高度评价，称其为“对于大多数负担得起的人来说，它是 Apple 产品线中的最佳选择”。最近推出的新款 11 英寸和 12.9 英寸 iPad Pro 机型均配备了 Apple 令人惊叹的 M1 芯片，带来了更多的皱纹，但总的来说，Air 仍然是 Apple 当前最接近“恰到好处”选项的产品。 iPad阵容。那些想要更简单的儿童平板电脑或媒体消费的人将得到更实惠的第 8 代 iPad 的更好服务。虽然 11 英寸 iPad Pro 的起价较高，而且在匹配传统笔记本电脑的生产力方面仍然受到 iPadOS 的阻碍，但对于想要更高性能容量的发烧友来说，这可能是值得的；更多基本存储空间为 128GB；更亮的显示屏，120 Hz 刷新率明显更平滑；稍微好一点的麦克风、摄像头和扬声器；以及 USB-C 端口中的 Thunderbolt 连接，以及其他升级。虽然这种最新模式是对第 3 代 Air 的明确升级，但它并没有好到需要升级的地步。尽管如此，第 4 代 iPad Air 仍然是一款值得称赞的平板电脑，尤其是 100 美元的折扣。它的 iPad 设计比其前身更现代，边缘方正，边框更薄，没有 Home 键，电源按钮内置 Touch ID，以及 Apple 平板电脑所期望的通常的高品质铝和玻璃外壳。该设备也相对薄（6.1 毫米）和轻（458 克）。 10.9 英寸显示屏非常出色，具有 2360x1640 的清晰分辨率、500 尼特的额定亮度、全层压和防反射涂层，有助于抵抗指纹和眩光。它的 A14 仿生芯片功能强大，足以运行各种游戏、应用程序和生产力软件。它使用更普遍接受的 USB-C 进行充电和连接，它与 Wi-Fi 6 兼容，并且它可以与 Apple 的最新一代 Pencil 手写笔和非常昂贵的妙控键盘配合使用。它的 12 兆像素、支持 4K 的后置摄像头优于第 3 代 Air，而其 7 兆像素的前置摄像头远优于第 8 代 iPad 上颗粒度更高的 1.2 兆像素单元。电池续航时间最长可达 10 小时，不过这取决于显示器的亮度以及视频流或游戏的数量。 Air 的存储情况是其最大的缺点，因为 64GB 可能不足以处理更多涉及的工作，而 256GB 型号是唯一可用的升级。如果您需要比入门级机型更多的空间但不需要 256GB，那么选择 128GB 11 英寸 iPad Pro 可能是值得的。但是，如果您可以使用 64GB 来存储所有游戏和文档，那么 iPad Air 是对入门级 iPad 的重大升级，以这个优惠价格应该是更具吸引力的选择。\n如果您对新 iPad 不感兴趣，我们还有更多优惠，您可以在下面的精选综述中找到所有这些优惠。注意：Ars Technica 可能会通过附属计划从该帖子上的链接中获得销售补偿。 10.9 英寸 Apple iPad Air (64GB) 平板电脑，亚马逊和百思买售价 499.99 美元（通常 550 美元）亚马逊 Kindle Paperwhite（8GB，广告）电子书阅读器，亚马逊售价 84.99 美元（通常 130 美元）：Kindle Paperwhite 在在这一点上牙齿，但长期以来，对于那些寻找通用电子书阅读器的人来说，它一直是我们的最爱。这笔交易比我们追踪的最低价格低了 5 美元，这是我们最后一次在 6 月份亚马逊 Prime 会员日促销期间看到的。 Anker PowerLine II（6 英尺）USB-C 转闪电电缆在亚马逊售价 11.55 美元（通常为 17 美元）：对于那些需要备用 USB-C 转闪电电缆来为 iPhone 或 iPad 快速充电的人来说，这是一笔不错的交易。 Anker 的 PowerLine II 是我们过去推荐的坚固且经过 MFi 认证的充电线。这笔交易比我们追踪的最低价格低约 2 美元，但仍低于 6 英尺型号的通常价格。塞尔达传说：Skyward Sword HD（Switch）在亚马逊、沃尔玛和 GameStop 售价 49.94 美元（通常为 60 美元）：坦率地说，我们对任天堂《塞尔达传说》的 Switch 重制版的视觉升级并没有留下深刻印象： Skyward Sword，但如果你从来没有机会玩过原版 Wii 游戏，但仍然想试一试，这个发布周 10 美元的折扣可能会让它更容易销售。亚马逊 Dice Forge 棋盘游戏，售价 23.80 美元（通常为 29 美元）：我们在之前的棋盘游戏购买指南中推荐了 Dice Forge，称这款引擎建造游戏是“了不起的家庭娱乐”，并赞扬了其整体表现。这笔交易比我们在亚马逊上追踪的最低价格低几美元。\n8Bitdo SN30 Pro+（SN 版）蓝牙游戏手柄，适用于 Switch、PC、iOS 和 Android，亚马逊售价 42.50 美元（通常为 48 美元）：我们在去年 4 月的评测中对 50 美元的 8Bitdo Pro 2 赞不绝口，但新无线游戏手柄的可用性在过去的几个月里一直参差不齐。如果您不介意牺牲一些功能以减少费用，那么上一代 SN30 Pro+ 没有 Pro 2 的可定制后退按钮和一些更微妙的舒适度升级，但它本身仍然是一个多功能的游戏手柄。无论哪种方式，您都会对 Switch 的默认 Joy-Con 进行重大升级。这笔交易与我们追踪的最低价格相差不到 3 美元。亚马逊和百思买售价 454.99 美元的 Apple AirPods Max 蓝牙降噪耳机（通常为 549 美元）：正如我们在之前的 Dealmaster 中指出的那样，要让 Apple 的 AirPods Max 物超所值，需要付出更大的代价。不过，对于那些有钱烧钱的人来说，Max 的设计、开箱即用的音质和主动降噪可以说优于索尼 Ars 最喜欢的 WH-1000XM4。这项为期一天的交易创下历史新低。 Apple MacBook Air (2020) 笔记本电脑——Apple M1、13.3 英寸 2560x1600、8GB RAM、256GB SSD，亚马逊和百思买售价 899 美元（通常为 960 美元）。 Apple MacBook Air（2020 年）笔记本电脑——Apple M1、13.3 英寸 2560x1600、8GB RAM、512GB SSD，亚马逊售价 1,099 美元（通常为 1,165 美元）。 Lenovo Chromebook Duet 二合一 Chrome OS 平板电脑—联发科技 Helio 60T，10.1 英寸 1920x1200，4GB RAM，64GB eMMC，Staples 售价 229.99 美元（通常为 280 美元）。联想 Chromebook Flex 5 二合一笔记本电脑——英特尔酷睿 i3-10110U、13.3 英寸 1080p、4GB RAM、64GB eMMC，亚马逊售价 329.99 美元（通常为 390 美元）。 27 英寸技嘉 M27Q 游戏显示器 — 2560x1440、IPS、170 Hz、FreeSync，亚马逊和百思买售价 309.99 美元（通常为 330 美元）。\n27 英寸 ViewSonic VX2758-2KP-MHD 游戏显示器 — 2560x1440、IPS、144 Hz、FreeSync，B&amp;H 售价 249.99 美元（通常为 300 美元）。 32 英寸戴尔 S3221QS 曲面显示器 — 3840x2160，VA，60 Hz，FreeSync，戴尔和亚马逊售价 349.99 美元（通常为 385 美元）。 SK Hynix Gold S31 (1TB) 2.5 英寸 SATA Gen 3 内置固态硬盘，亚马逊售价 89.24 美元（通常为 105 美元）。 10.9 英寸 Apple iPad Air (64GB) 平板电脑，亚马逊和百思买售价 499.99 美元（通常为 550 美元）。 10.9 英寸 Apple iPad Air (256GB) 平板电脑，亚马逊和百思买售价 649.99 美元（通常为 699 美元）。 Apple AirPods Pro 真无线降噪耳机，亚马逊、沃尔玛和百思买售价 189.99 美元（通常为 200 美元）。 Apple AirPods Max 蓝牙降噪耳机，亚马逊和百思买售价 454.99 美元（通常为 549 美元）。\nJabra Elite 75t（金色米色）真无线降噪耳塞，亚马逊和百思买售价 112.99 美元（通常 135 美元）。罗技 MX Master 3 无线办公鼠标，Staples 售价 79.99 美元（使用代码：97085——通常为 100 美元）。适用于 Mac 无线键盘的 Logitech MX Keys 在 Staples 售价 79.99 美元（使用代码：97085——通常为 100 美元）。 Roku Express 4K+ 4K HDR 媒体流媒体在亚马逊和 Target 售价 29 美元（通常为 37 美元）。 Apple TV 4K (32GB) 4K HDR 流媒体播放器，亚马逊、沃尔玛和山姆会员店售价 169 美元（通常为 179 美元）。 Apple Siri Remote（第二代）适用于 Apple TV 4K 和 Apple TV HD，Verizon 售价 49.97 美元（通常为 59 美元）。索尼 Alpha 7 II（仅限机身）全画幅无反光镜相机，亚马逊售价 898 美元（通常为 1,355 美元）。\nDJI Osmo Mobile 3 手持智能手机万向节在亚马逊和沃尔玛售价 79 美元（通常为 99 美元）。亚马逊 Kindle Unlimited 6 个月会员费为 47.86 美元（24 个月为 143.80 美元，12 个月为 80.30 美元——通常为 60 美元）。亚马逊 eero 6（3 件装）双频网状 Wi-Fi 6 路由器，百思买售价 226 美元（在购物车中添加三个路由器 - 通常为 349 美元）。 The Legend of Zelda: Skyward Sword HD (Switch) 在亚马逊、沃尔玛和 GameStop 售价 49.94 美元（通常为 60 美元）。新超级马里奥兄弟 U 豪华版（Switch）在亚马逊和百思买（通常为 48 美元）售价 40.99 美元。 Immortals Fenyx Rising（Switch、PS5、PS4、Xbox）在亚马逊和 GameStop 售价 24.99 美元（通常为 33 美元）。质量效应：传奇版（PS4、Xbox）在亚马逊、微软和百思买售价 44.99 美元（通常为 60 美元）。\nYakuza: Like a Dragon (PS4, Xbox) 在 Best Buy、Amazon 和 GameStop 上售价 24.99 美元（也在 Game Pass 上——通常是 40 美元）。 Yakuza Remastered Collection (PS4) 在亚马逊和百思买售价 24.99 美元（包括三款游戏——通常为 50 美元）。 13 Sentinels: Aegis Rim (PS4) 在 Best Buy 售价 24.99 美元（仅限店内提货——通常为 45 美元）。耻辱与猎物：Arkane Collection（PS4、Xbox）在亚马逊和百思买售价 21.99 美元（包括四款游戏——通常为 44 美元）。 The Witcher 3: Wild Hunt—Complete Edition (PS4) 在 PlayStation Store 售价 9.99 美元（通常为 35 美元）。星球大战绝地武士：堕落秩序（Xbox）在微软售价 15.99 美元（也在游戏通行证上 - 通常为 30 美元）。最终幻想 XII：十二生肖时代（Xbox）在亚马逊、百思买和 GameStop 售价 14.99 美元（Switch 版售价 20 美元——通常为 23 美元）。\n8Bitdo SN30 Pro+（SN 版）蓝牙游戏手柄，适用于 Switch、PC、iOS 和 Android，亚马逊售价 42.50 美元（通常为 48 美元）。 8Bitdo SN30 Pro（SN 版）蓝牙复古游戏手柄，适用于 Switch、PC、iOS 和 Android，亚马逊售价 38.20 美元（通常为 45 美元）。适用于 Xbox、PC、iOS 和 Android 的 Microsoft Xbox Elite 无线控制器系列 2 无线游戏手柄在 GameStop 上售价 159 美元（结账时可看到折扣 - 通常为 180 美元）。适用于 Xbox、PC、iOS 和 Android 的 Microsoft Xbox 无线控制器（碳黑）在 Microsoft、Amazon 和 GameStop 上售价 49.99 美元（通常为 55 美元）。 Nintendo Switch Pro Controller 在 Amazon 和 GameStop 售价 59 美元（在购物车中看到折扣 - 通常为 65 美元）。适用于 Nintendo Switch 的 Hori Split Pad Pro 手持游戏控制器，亚马逊和沃尔玛售价 39.99 美元（通常为 50 美元）。 Razer BlackWidow TE Chroma v2 无键机械游戏键盘——Razer Orange、Razer Green 或 Razer Yellow 开关，亚马逊售价 69.99 美元（通常为 90 美元）。\nAtGames Legends Ultimate 街机柜 — 24 英寸显示屏，包括 300 款预装游戏，在 Sam&#39;s Club 售价 499.98 美元（通常为 600 美元）。", "note_en": "Today&#39;s Dealmaster is headlined by a big discount on Apple&#39;s iPad Air, as the 4th-generation tablet is  currently down to $500 at Amazon and  Best Buy. That&#39;s $100 off Apple&#39;s MSRP and roughly $50 off the average street price we&#39;ve seen on Amazon over the past few months. Either way, the discount marks the lowest price we&#39;ve tracked for the device from a mainstream retailer.\n Note that this deal applies to the entry-level model with 64GB of storage; if you&#39;re wanting to step up to the higher-capacity 256GB model, that  version is on sale for $650, another all-time low price.\n We gave the iPad Air high marks  in our review last November, calling it &#34;the best pick from Apple&#39;s lineup for most people who can afford it.&#34; The recent introduction of  new 11- and 12.9-inch iPad Pro models, both equipped with Apple&#39;s blazing M1 chip, has introduced a few more wrinkles, but generally speaking, the Air remains the closest thing to a &#34;just right&#34; option in Apple&#39;s current iPad lineup.\n Those who want a simpler tablet for kids or media consumption will remain better served by  the more affordable 8th-gen iPad. While the 11-inch iPad Pro  starts at a higher price and is still hampered by iPadOS when it comes to matching a traditional laptop&#39;s productivity, it may be worth the splurge for enthusiasts who want greater performance capacity; more base storage at 128GB; a brighter display with a noticeably smoother 120 Hz refresh rate; slightly better mics, cameras, and speakers; and Thunderbolt connectivity in its USB-C port, among other upgrades. And while this newest mode is a definite upgrade over the 3rd-gen Air, it&#39;s not so much better that it  demands an upgrade.\n All that said, the 4th-gen iPad Air is still a commendable tablet, especially with a $100 discount. It has a more modern iPad design than its predecessor, with squared-off edges, thinner bezels, no Home button, Touch ID built into the power button, and the usual high-quality aluminum and glass enclosure that is expected from an Apple tablet. The device is relatively thin (6.1 mm) and light (458 g) as well. The 10.9-inch display is excellent, with a sharp 2360x1640 resolution, a rated 500 nits of brightness, full lamination, and an anti-reflective coating that helps it resist fingerprints and glare.\n Its A14 Bionic chip is more than powerful enough to run all sorts of games, apps, and productivity software. It uses the more universally accepted USB-C for charging and connectivity, it&#39;s  compatible with Wi-Fi 6, and it works with  Apple&#39;s latest-gen Pencil stylus and the  great-if-obscenely-expensive Magic Keyboard. Its 12-megapixel, 4K-capable rear camera is better than that of the 3rd-gen Air, while its 7-megapixel front-facing camera is far superior to the grainier 1.2-megapixel unit on the 8th-gen iPad. Battery life is rated at up to 10 hours, though that&#39;ll vary depending on how bright you have the display and how much video streaming or gaming you do.\n The Air&#39;s storage situation is its biggest downside, as 64GB might not be enough for more involved work, and the 256GB model is the only upgrade available. If you need more space than the entry-level model but don&#39;t need as much as 256GB, opting for the 128GB 11-inch iPad Pro might be worth it. But if you can live with 64GB for stashing all your games and documents, the iPad Air is a major upgrade over the entry-level iPad and should be a more attractive proposition at this deal price.\n If you aren&#39;t interested in a new iPad, we have plenty more deals, all of which you can find in our curated roundup below.\n  Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n   10.9-inch Apple iPad Air (64GB) tablet for $499.99 at Amazon and  Best Buy (normally $550)\n Amazon Kindle Paperwhite (8GB, ads) ebook reader for $84.99 at Amazon (normally $130): The Kindle Paperwhite is getting a bit long in the tooth at this point, but it has  long been a favorite of ours for those looking for a general-purpose ebook reader. This deal is $5 off the lowest price we&#39;ve tracked, which we last saw during Amazon&#39;s Prime Day sale in June.\n Anker PowerLine II (6ft) USB-C to Lightning cable for $11.55 at Amazon (normally $17): Here&#39;s a nice deal for those in need of a spare USB-C to Lightning cable for fast-charging their iPhone or iPad. Anker&#39;s PowerLine II is a sturdy and  MFi-certified charging cord  we&#39;ve recommended in the past. This deal is about $2 off the lowest price we&#39;ve tracked but is still below the six-foot model&#39;s usual going rate.\n The Legend of Zelda: Skyward Sword HD (Switch) for $49.94 at Amazon,  Walmart, and  GameStop (normally $60): To be candid, we  were not super impressed by the visual upgrades made to this Switch remaster of Nintendo&#39;s  The Legend of Zelda: Skyward Sword, but if you never had a chance to play the  original Wii game and still want to give it a shot, this launch-week $10 discount might make it an easier sell.\n  Dice Forge board game for $23.80 at Amazon (normally $29): We&#39;ve  recommended  Dice Forge  in previous board game buying guides, calling the engine-building game &#34;terrific family entertainment&#34; and praising its overall presentation. This deal comes within a couple of dollars of the lowest price we&#39;ve tracked on Amazon.\n 8Bitdo SN30 Pro+ (SN Edition) Bluetooth gamepad for Switch, PC, iOS, and Android for $42.50 at Amazon (normally $48): We  heaped praise onto the  $50 8Bitdo Pro 2 in our review this past April, but availability for the new wireless gamepad has been spotty over the past few months. If you don&#39;t mind sacrificing some functionality to pay a bit less, the previous-gen SN30 Pro+ lacks the Pro 2&#39;s customizable back buttons and a few subtler comfort upgrades but remains a  versatile gamepad in its own right. Either way, you&#39;re getting a major upgrade over the Switch&#39;s default Joy-Cons. This deal is within $3 of the lowest price we&#39;ve tracked.\n Apple AirPods Max Bluetooth noise-canceling headphones for $454.99 at Amazon and  Best Buy (normally $549): As we  noted in a previous Dealmaster, it will take a much bigger deal to make Apple&#39;s AirPods Max an out-and-out good value. For those with cash to burn, though, the Max&#39;s design, out-of-the-box sound quality, and active noise cancelation are arguably superior to that of  Sony&#39;s Ars favorite WH-1000XM4. This one-day deal marks a new all-time low.\n   Apple MacBook Air (2020) laptop—Apple M1, 13.3-inch 2560x1600, 8GB RAM, 256GB SSD for  $899 at Amazon and  Best Buy (normally $960).\n Apple MacBook Air (2020) laptop—Apple M1, 13.3-inch 2560x1600, 8GB RAM, 512GB SSD for  $1,099 at Amazon (normally $1,165).\n Lenovo Chromebook Duet 2-in-1 Chrome OS tablet—MediaTek Helio 60T, 10.1-inch 1920x1200, 4GB RAM, 64GB eMMC for  $229.99 at Staples (normally $280).\n Lenovo Chromebook Flex 5 2-in-1 laptop—Intel Core i3-10110U, 13.3-inch 1080p, 4GB RAM, 64GB eMMC for  $329.99 at Amazon (normally $390).\n 27-inch Gigabyte M27Q gaming monitor—2560x1440, IPS, 170 Hz, FreeSync for  $309.99 at Amazon and  Best Buy (normally $330).\n 27-inch ViewSonic VX2758-2KP-MHD gaming monitor—2560x1440, IPS, 144 Hz, FreeSync for  $249.99 at B&amp;H (normally $300).\n 32-inch Dell S3221QS curved monitor—3840x2160, VA, 60 Hz, FreeSync for  $349.99 at Dell and  Amazon (normally $385).\n SK Hynix Gold S31 (1TB) 2.5-inch SATA Gen 3 internal SSD for  $89.24 at Amazon (normally $105).\n   10.9-inch Apple iPad Air (64GB) tablet for  $499.99 at Amazon and  Best Buy (normally $550).\n 10.9-inch Apple iPad Air (256GB) tablet for  $649.99 at Amazon and  Best Buy (normally $699).\n Apple AirPods Pro true wireless noise-canceling earphones for  $189.99 at Amazon,  Walmart, and  Best Buy (normally $200).\n Apple AirPods Max Bluetooth noise-canceling headphones for  $454.99 at Amazon and  Best Buy (normally $549).\n  Jabra Elite 75t (Gold Beige) true wireless noise-canceling earbuds for  $112.99 at Amazon and  Best Buy (normally $135).\n   Logitech MX Master 3 wireless office mouse for  $79.99 at Staples (use code:  97085—normally $100).\n Logitech MX Keys for Mac wireless keyboard for  $79.99 at Staples (use code:  97085—normally $100).\n  Roku Express 4K+ 4K HDR media streamer for  $29 at Amazon and  Target (normally $37).\n Apple TV 4K (32GB) 4K HDR media streamer for  $169 at Amazon,  Walmart, and  Sam&#39;s Club (normally $179).\n Apple Siri Remote (2nd gen) for Apple TV 4K and Apple TV HD for  $49.97 at Verizon (normally $59).\n   Sony Alpha 7 II (body only) full-frame mirrorless camera for  $898 at Amazon (normally $1,355).\n DJI Osmo Mobile 3 handheld smartphone gimbal for  $79 at Amazon and  Walmart (normally $99).\n Amazon Kindle Unlimited 6-month membership for  $47.86 at Amazon (24-month for  $143.80, 12-month for  $80.30—normally $60).\n   Amazon eero 6 (3-pack) dual-band mesh Wi-Fi 6 router for  $226 at Best Buy (add three routers in cart—normally $349).\n   The Legend of Zelda: Skyward Sword HD (Switch) for  $49.94 at Amazon,  Walmart, and  GameStop (normally $60).\n    New Super Mario Bros. U Deluxe (Switch) for  $40.99 at Amazon and  Best Buy (normally $48).\n   Immortals Fenyx Rising (Switch,  PS5,  PS4,  Xbox) for  $24.99 at Amazon and  GameStop (normally $33).\n  Mass Effect: Legendary Edition (PS4,  Xbox) for  $44.99 at Amazon,  Microsoft, and  Best Buy (normally $60).\n      Yakuza: Like a Dragon (PS4,  Xbox) for  $24.99 at Best Buy,  Amazon, and  GameStop (also on Game Pass—normally $40).\n  The Yakuza Remastered Collection (PS4) for  $24.99 at Amazon and  Best Buy (includes three games—normally $50).\n 13 Sentinels: Aegis Rim (PS4) for  $24.99 at Best Buy (in-store pickup only—normally $45).\n Dishonored &amp; Prey: The Arkane Collection (PS4,  Xbox) for  $21.99 at Amazon and  Best Buy (includes four games—normally $44).\n     The Witcher 3: Wild Hunt—Complete Edition (PS4) for  $9.99 at PlayStation Store (normally $35).\n  Star Wars Jedi: Fallen Order (Xbox) for  $15.99 at Microsoft (also on Game Pass—normally $30).\n  Final Fantasy XII: The Zodiac Age (Xbox) for  $14.99 at Amazon,  Best Buy, and  GameStop ( Switch version for  $20—normally $23).\n   8Bitdo SN30 Pro+ (SN Edition) Bluetooth gamepad for Switch, PC, iOS, and Android for  $42.50 at Amazon (normally $48).\n 8Bitdo SN30 Pro (SN Edition) Bluetooth retro gamepad for Switch, PC, iOS, and Android for  $38.20 at Amazon (normally $45).\n Microsoft Xbox Elite Wireless Controller Series 2 wireless gamepad for Xbox, PC, iOS, and Android for  $159 at GameStop (discount seen at checkout—normally $180).\n Microsoft Xbox Wireless Controller (Carbon Black) for Xbox, PC, iOS, and Android for  $49.99 at Microsoft,  Amazon, and  GameStop (normally $55).\n Nintendo Switch Pro Controller for  $59 at Amazon and  GameStop (discount seen in cart—normally $65).\n Hori Split Pad Pro handheld game controller for Nintendo Switch for  $39.99 at Amazon and  Walmart (normally $50).\n  Razer BlackWidow TE Chroma v2 tenkeyless mechanical gaming keyboard—Razer Orange, Razer Green, or Razer Yellow switches for  $69.99 at Amazon (normally $90).\n AtGames Legends Ultimate arcade cabinet—24-inch display, includes  300 preinstalled games for  $499.98 at Sam&#39;s Club (normally $600).", "posttime": "2021-07-22 22:51:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ipad,deal,游戏", "title": "划算：iPad Air 今天跌至 500 美元的新低", "title_en": "Good deal: The iPad Air is down to a new low of $500 today", "transed": 1, "url": "https://arstechnica.com/staff/2021/07/apple-ipad-air-deals-100-off-amazon-best-buy/", "via": "", "real_tags": ["ipad", "deal", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "81dd495cda09b2af92e09b870b6b708b.jpeg", "infoid": 1068990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据 9to5Mac 的一份新报告，苹果正准备推出重新设计的 iPad mini。尽管苹果在 2019 年末用更快的处理器和 Apple Pencil 支持更新了 iPad mini，但自 2012 年推出以来，该设备的基本设计并没有改变。与许多苹果泄密事件一样，这篇文章引用了匿名“知情人士，”所以建议谨慎。也就是说，过去9to5Mac 文章用类似的语言被证明是准确的。 9to5Mac 的消息人士称，新款 iPad mini 的设计将让人联想到最近的 iPad Air，暗示苹果将放弃 Home 键并显着减少屏幕周围的边框。这种方法对于屏幕非常小的 7.9 英寸 iPad mini 来说可能是一个特别的福音。新设计可以让设备保持“迷你”，但提供更身临其境的观看体验。文章还称，iPad mini 将效仿 iPad Pro 和 iPad Air，从 Lightning 端口转向使用更广泛的 USB-C。迷你将包括一个智能连接器，支持外围设备，如苹果的智能键盘保护套或 iPad mini 的妙控键盘。这个故事声称要透露的最后一个 iPad mini 花絮是包含了苹果尚未宣布的 A15 片上系统——预计今年的新 iPhone 机型中将出现相同的 SoC。 （过去，一些 iPad 机型使用的芯片比当前的 iPhone 系列更旧，即使它们大约在同一时间推出。）据报道，A15 使用与之前的 A14 相同的 5 纳米制造工艺。此外，消息人士称，Apple 还在开发速度更快的 A15 变体，称为 A15X，以包含在其他一些 iPad 中。这是一个奇怪的说法，因为具有类似命名法的芯片之前曾出现在 iPad Pro 系列中，Apple 今年更新了该系列以共享第一代 Apple Silicon Mac 中的 M1 芯片。因此，如果 A15X 确实在开发中，还不清楚 A15X 可能会进入哪些 iPad。但这篇文章并不是关于 iPad mini 的。 9to5Mac 的消息人士还表示，10.2 英寸入门级 iPad 将使用苹果的 A13 芯片进行更新，取代目前的 A12 芯片。\n9to5Mac 的故事遵循彭博社的类似报道，该报道称苹果计划今年推出一款新的 iPad mini，但该报道缺乏细节。", "note_en": "Apple is getting ready to introduce a redesigned iPad mini, according to a new report  from 9to5Mac.\n Though Apple updated the iPad mini with a faster processor and Apple Pencil support in late 2019, the basic design of the device has not changed since its introduction back in 2012.\n  Like so many Apple leaks, the article cites anonymous &#34;sources familiar with the matter,&#34; so caution is advised. That said, 9to5Mac articles with similar language have turned out to be accurate in the past. 9to5Mac&#39;s sources say that the new iPad mini will have a design reminiscent of the recent iPad Air, suggesting that Apple will drop the home button and significantly reduce the bezels around the screen. This approach could be a particular boon for the 7.9-inch iPad mini, which has a very small screen. A new design could allow the device to stay &#34;mini&#34; but offer a more immersive viewing experience.\n    The article also claims that the iPad mini will follow the iPad Pro and iPad Air in making the switch from a Lightning port to the more widely used USB-C. The mini would include a Smart Connector, enabling peripherals like a version of Apple&#39;s Smart Keyboard Folio or Magic Keyboard for the iPad mini.\n The final iPad mini tidbit the story claims to reveal is the inclusion of Apple&#39;s yet-to-be-announced A15 system-on-a-chip—the same SoC expected to appear in this year&#39;s new iPhone models. (In the past, some iPad models have used older chips than the current iPhone lineup, even if they launched around the same time.)\n The A15 is reported to use the same 5 nm fabrication process as the A14 that precedes it. Further, the sources say that Apple is also working on faster variant of the A15, called the A15X, for inclusion in some other iPads. This is a curious claim, as chips with similar nomenclature have previously appeared in the iPad Pro line, which Apple this year  updated to share the M1 chip found in the first Apple Silicon Macs. So it&#39;s not clear which iPads an A15X might make their way into, if an A15X is indeed in development.\n But the article is not all about the iPad mini; 9to5Mac&#39;s sources also say that the 10.2-inch, entry-level iPad will be updated with Apple&#39;s A13 chip, replacing the current A12 chip.\n The 9to5Mac story follows a similar one  from Bloomberg that said Apple plans to introduce a new iPad mini this year, but that report lacked details.", "posttime": "2021-07-22 22:51:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,ipad,claims", "title": "报告称苹果最终会给 iPad mini 一些爱", "title_en": "Report claims Apple will finally give the iPad mini some love", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/report-claims-apple-will-finally-give-the-ipad-mini-some-love/", "via": "", "real_tags": ["苹果", "apple", "ipad", "claims"]}, {"category": "", "categoryclass": "", "imagename": "4e842b49493301c0a3b73770fc1f640a.jpg", "infoid": 1068988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple 为 iPhone 12 和 iPhone 12 Pro 推出的新款 MagSafe 电池组现已可在店内取货，第一批在线订单已送达买家家门口。您可以在线购买一个并在未来几天或几周内发货给您（取决于您居住的地方），或者去您当地的 Apple Store 购买一个。可用性将取决于位置。 Apple 的网站提供了多种方法来确定您最近的零售点是否有库存的电池组。例如，如果您在美国，产品的在线商店页面会尝试自动检测您的邮政编码，或者您可以手动输入您的邮政编码。然后产品页面会说明最近的位置是否有电池组可用。 MagSafe 电池组于一周前首次发布并开始在线订购。该电池组适用于 iPhone 12、iPhone mini、iPhone 12 Pro 和 iPhone 12 Pro Max，即任何配备 MagSafe 的 iPhone。 MagSafe 是去年年底随 iPhone 12 系列推出的，尽管该名称在 Apple 产品中的历史悠久。支持它的 iPhone 背面有磁铁，靠近手机的无线充电线圈。这些磁铁可确保使用该技术的充电器和电池组保持最佳对齐状态，以实现最佳充电速度。 MagSafe 还可用于其他配件，如磁性钱包或汽车支架。 MagSafe 电池组可以在未插入电源时以 5 W 或插入时以 15 W 为 iPhone 充电。电池组本身有一个闪电连接器，但它没有配备闪电连接线或电源适配器；您必须使用已与 iPhone 搭配使用的任何 Lightning 数据线和适配器，或者购买新的。 iOS 也直接支持该包，您可以在主屏幕和其他一些地方查看其充电状态。该产品的重点是用户体验和无缝集成，但电池组的价格为 99 美元，比许多类似尺寸的 iPhone 电池组贵得多。", "note_en": "Apple&#39;s  new MagSafe Battery Pack for the iPhone 12 and iPhone 12 Pro is now available for in-store pickup, and the first online orders have arrived at buyers&#39; doorsteps.\n  You can buy one online and have it shipped to you in the coming days or weeks (depending on where you live) or go to your local Apple Store to purchase one. Availability will depend on location. Apple&#39;s website offers multiple ways to determine if your nearest retail location has the battery pack in stock. For example, if you&#39;re in the US, the online store page for the product attempts to automatically detect your ZIP code, or you can enter your ZIP code manually. The product page will then say whether the battery pack is available at the closest location.\n    The MagSafe Battery Pack was  first announced and put up for online order a week ago. The battery pack works with the iPhone 12, iPhone mini, iPhone 12 Pro, and iPhone 12 Pro Max—in other words, any MagSafe-equipped iPhone.\n  MagSafe was introduced with the iPhone 12 lineup late last year, though the name has a longer history in Apple&#39;s products. The iPhones that support it have magnets in the back, near the phones&#39; wireless charging coils. These magnets ensure that chargers and battery packs using the tech stay optimally aligned for the best charging speeds. MagSafe can also be used  for other accessories, like a  magnetic wallet or a  car mount. The MagSafe Battery Pack can charge an iPhone at 5 W when it&#39;s not plugged in or at 15 W when it is plugged in. The battery pack itself has a Lightning connector, but it does not come with a Lightning cable or a power adapter; you&#39;ll have to either use whatever Lightning cable and adapter you use with your iPhone already or buy a new one. The pack is also supported directly by iOS in that you can view its charging status on your home screen and a few other places.\n The product&#39;s focus is on user experience and seamless integration, but the battery pack costs $99, making it much more expensive than many similarly sized battery packs for the iPhone.", "posttime": "2021-07-22 22:50:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,magsafe,电池组", "title": "Apple 的 MagSafe 电池组现已上市，售价 99 美元", "title_en": "Apple’s MagSafe Battery Pack is available in stores now for $99", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/apples-magsafe-battery-pack-is-available-in-store-now-for-99/", "via": "", "real_tags": ["apple", "magsafe", "电池组"]}, {"category": "", "categoryclass": "", "imagename": "f38b7481fd8da6481d118af372987b1d.jpg", "infoid": 1068987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员和政策分析师已经检查并仔细检查了未来的气候情景。我们知道我们可以排放多少二氧化碳，并且仍然可以防止世界变暖超过 2ºC，我们可以使用这个数字来确定我们需要多快摆脱化石燃料。我们有多种途径可以到达那里，其中大部分涉及用最便宜的可再生能源替代化石燃料：风能和太阳能。从那里开始，确定风能和太阳能的使用必须以多快的速度增加才能使我们达到目标是一件简单的事情。在大多数国家，风能和太阳能已成为最便宜的新电力来源，我们现在在它们的生产和安装方面拥有巨大的规模经济。我们还拥有数十年有效管理它们的经验。没有理由认为这些可再生能源不会出现爆炸性增长。然而，一项关于可再生能源历史的新研究表明，只有少数国家出现了这种增长。即使这些国家实现了他们的目标，他们也只是在很短的时间内做到了。 Nature Energy 上的一篇新论文称，大多数技术都经历了可预测的采用模式。它们从一个最小增长时期开始，而该技术价格昂贵、了解甚少，并且无法大规模制造。一旦达到临界点，采用率就会上升到一个快速加速的时期，每年都会出现更高的增长率。然而，随着时间的推移，这种增长会放缓，曲线趋于平缓，从而实现长期稳定增长。这通常被称为 S 曲线，因为如果您绘制随时间的增长图，您会得到看起来像一个扁平的 S 曲线。在增长最快的时期有一条曲线，然后是一条回到稳定增长的曲线在成熟的技术。这与气候目标有什么关系？为了实现这些目标，各国需要尽快让可再生能源进入最大增长期。但仅靠达到最大增长是不够的——各国需要尽可能长时间地停留在最大增长阶段，以便在开始稳定增长期时达到更高的平稳期。如果我们不能做到这一点，我们就需要寻找其他方式来达到我们的排放目标。到目前为止，已经有足够多的国家经历了增长和稳定，研究人员认为他们可以确定是否正在发生足够的增长，如果是，什么条件使他们能够实现增长。他们查看了来自 60 个国家的数据，这些国家的电力生产总量超过 95%。\n首先，研究人员确定了国家何时进入风能或太阳能的增长阶段，他们发现达到 1% 的增长率是一个很好的标志。其中许多国家可以被追踪到一个最大增长时期，然后一些国家的增长再次放缓，产生完整的 S 曲线。正如预期的那样，确切的结果因国家和技术而异。风能的价格首先下降，所以大多数国家看到这项技术比太阳能早十年起飞。但是太阳能变得更快更便宜，而且更容易大规模制造并且需要更少的基础设施来安装。所以它的增长速度更快。当地条件也很重要。几个国家，主要是在北欧，风能起飞了，但太阳能没有出现类似的增长。其他人只看到太阳能经历了快速增长的时期。截至最新数据（2018年），增长加速的国家有11个，另有21个国家连续三年增长放缓，表明它们已经完成了S曲线。至关重要的是，较晚开始加速阶段的国家似乎没有达到更快的增长率，这表明成熟的技术和早期采用者获得的经验并没有让后来采用风能和太阳能的国家变得更容易。研究人员的分析估计，加速期后的中值增长率约为各国风能电力供应的 0.8% 和太阳能电力供应的 0.6%。最高的增长率是每年 1.8% 的电力供应，最大的国家很少看到超过 1% 的增长率。在少数情况下，增长达到了平台期并再次起飞，但只有三个例子发生了。答案是非常明确的“不”。如果我们从气候稳定情景倒推，我们需要风能大约是目前的两倍，从 0.6% 到 1.2%。根据几个大国的经验，这相当于达到了它们的最大增长率，然后停留在那里。太阳能需要将其目前的全球增长率提高三倍，每年增加的产能相当于电力供应的 1%。这两个例子都是基于将气候变化限制在 2ºC 的数字，当时各国都同意 1.5ºC 是一个更可取的目标。\n正如该论文的作者所说，满足我们气候目标的当前情景需要可再生能源的数十年增长速度高于大多数国家在增长高峰期所观察到的速度。这并不是说不可能提高增长率以使事情步入正轨。尽管随意或实际上缺乏政策，但许多国家的可再生能源增长仍然存在。但是，如果各国不在改善其政策状况的过程中，他们要么需要开始寻求替代方案（如效率和碳捕获），要么承认他们实际上并不打算兑现承诺。", "note_en": "Researchers and policy analysts have checked and double-checked future climate scenarios. We know how much carbon dioxide we can emit and still keep the world from getting more than 2ºC warmer, and we can use that number to determine how quickly we need to move away from fossil fuels. We have a variety of routes to get there, most of them involving replacing fossil fuels with the cheapest renewable energy sources: wind and solar power. From there, it&#39;s a simple matter of determining how quickly wind and solar use have to increase to get us there.\n Wind and solar have become the cheapest sources of new electricity in most countries, and we now have massive economies of scale for their production and installation. We also have decades of experience with managing them effectively. There&#39;s little reason to think that these renewables aren&#39;t poised for explosive growth.\n And yet a new study of the history of renewables shows that only a handful of countries have seen that sort of growth. And even when those countries achieved their goals, they only did so for a brief period.\n  A new paper in Nature Energy says that most technologies experience a predictable pattern of adoption. They start with a period of minimal growth, while the technology is expensive, poorly understood, and can&#39;t be manufactured at scale. Once a critical point is reached, adoption ramps up to a period of rapid acceleration, with each year seeing higher rates of growth. Over time, however, this increase slows, and the curve flattens out to an extended period of steady growth.\n  This is typically called an S-curve because if you plot growth over time, you get something that looks like a flattened-out S. There&#39;s a curve up to the period of the fastest increase, followed by a curve back toward the steady increase seen in a mature technology.\n    What does this have to do with climate goals? To reach these goals, countries need to get renewable power sources into the period of maximal growth as quickly as possible. But reaching maximal growth is not enough on its own—countries need to stay in the maximal growth phase for as long as possible to achieve a higher plateau when they start a period of stable growth. If we can&#39;t manage that, we&#39;ll need to look for other ways of hitting our emissions targets.\n By now, enough countries have gone through growth and stabilization that the researchers felt they could determine whether sufficient increases are happening and, if so, what conditions enable them. They looked at data from 60 countries that collectively account for over 95 percent of the world&#39;s electricity production.\n  To start with, the researchers identified when countries entered the growth phase of either wind or solar, and they found that reaching a growth rate of 1 percent was a good marker. Many of those countries could be tracked into a period of maximal growth, and a number then saw growth slow down again, producing the full S curve.\n As expected, the exact results varied by country and technology. Wind came down in price first, so most countries saw that technology take off about a decade earlier than solar. But solar became cheaper faster, and it&#39;s easier to manufacture at scale and requires less infrastructure to install. So its growth ramped up more rapidly.\n Local conditions also mattered. Several countries, mostly in Northern Europe, saw wind take off but haven&#39;t seen a similar growth in solar. Others have seen only solar experience a period of rapid growth.\n As of the most recent data (2018), there were 11 countries where growth was accelerating, and another 21 have seen three consecutive years of reduced growth, indicating that they had completed the S curve. Critically, the countries that started the acceleration phase later don&#39;t seem to hit faster growth rates, suggesting that maturing technology and the experience gained by early adopters don&#39;t make it any easier for the countries that adopt wind and solar later.\n    The researchers&#39; analysis estimated that the median growth rate after the period of acceleration was about 0.8 percent of the countries&#39; electrical supply for wind and 0.6 percent for solar. The highest growth rate was 1.8 percent of the electrical supply per year, and the largest countries rarely saw rates that exceeded 1 percent.\n In a few cases, growth hit a plateau and took off again, but there were only three examples of that happening.\n  The answer is a pretty clear &#34;no.&#34; If we work backward from climate-stabilization scenarios, we&#39;d need wind to roughly double its current rate, going from 0.6 percent to 1.2 percent. Based on the experience of several large countries, that would be the equivalent of reaching their maximum growth rate and then staying there. Solar would need to see its current global rate triple, with capacity additions equal to 1 percent of the electric supply every year. And both of those examples are based on the numbers for limiting climate change to 2ºC, when countries have agreed that 1.5ºC is a preferable goal.\n As the authors of the paper put it, current scenarios that meet our climate goals require decades of growth in renewables at rates higher than those observed during the peak growth periods of most countries.\n That&#39;s not to say it&#39;s impossible to boost growth rates to get things on track. Plenty of countries have seen growth in renewables despite haphazard or effectively absent policies. But if countries aren&#39;t in the process of improving their policy situation, they either need to start pursuing alternatives (like efficiency and carbon capture) or acknowledge that they don&#39;t actually intend to reach their commitments.", "posttime": "2021-07-22 22:50:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "国家,installing,增长", "title": "是否有任何国家以足够快的速度安装可再生能源以实现气候目标？", "title_en": "Is any country installing renewables fast enough to reach climate goals?", "transed": 1, "url": "https://arstechnica.com/science/2021/07/renewable-growth-rates-arent-high-enough-to-reach-climate-goals/", "via": "", "real_tags": ["国家", "增长"]}, {"category": "", "categoryclass": "", "imagename": "4cb1df330196dc79ba39e39cd132d13f.jpg", "infoid": 1068986, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔·拜登总统今天表示，他将提名乔纳森·坎特 (Jonathan Kanter) 担任负责司法部反垄断部门的助理司法部长。坎特是一位以批评谷歌而闻名的律师，他将接管反垄断部门，因为它正在考虑拜登的一项扭转有害合并和打破垄断的计划。白宫公告称，坎特“是一位拥有 20 多年经验的杰出反垄断律师”，并且一直是“推动强有力和有意义的反垄断执法和竞争政策的主要倡导者和专家”。美国参议员 Amy Klobuchar（明尼苏达州民主党）在一份声明中对提名表示赞赏。 “多年来，乔纳森·坎特 (Jonathan Kanter) 一直是联邦、州和国际竞争管理机构加强反垄断执法力度的领导者。他深厚的法律经验和倡导积极行动的历史使他成为领导美国商务部的绝佳人选。司法部的反垄断部门，”克洛布查尔说。 Kanter 创立了 Kanter Law Group，白宫将其描述为“一家支持联邦和州反垄断执法的精品反垄断律师事务所”。该公司的网站称，坎特在司法部、联邦贸易委员会、国会和州检察长面前代表客户。 Kanter 还在 1998 年至 2000 年期间在 FTC 竞争局担任律师。“在奥巴马政府期间，微软聘请 [Kanter] 推动反垄断官员对谷歌采取行动。最近，他代表客户，包括 Yelp Inc.去年敦促司法部起诉谷歌，”布隆伯格今天写道。正如彭博社援引的那样，坎特在 2016 年关于亚马逊的一次活动中说：“反垄断执法几乎无法维持生命。” “你最后一次记得一家大型反垄断机构提起垄断案是什么时候？你不记得的原因是因为他们没有做过。”同样在 2016 年，坎特为《纽约时报》撰写了一篇题为“不要将我们的电视交给谷歌”的专栏文章。坎特的专栏文章批评了当时的联邦通信委员会主席汤姆惠勒的提议，即通过要求有线电视和卫星电视公司向第三方硬件或应用程序的制造商提供内容和节目信息，为消费者提供更多机顶盒选择。坎特辩称，惠勒的计划在有线电视公司的反对下从未被采纳，“威胁要用新的看门人取代一组强大的看门人：谷歌。”\nFCC 必须确保 Google 在用户通过电视进行搜索时不会出现相同的行为。记录表明，如果没有 FCC 的监督，谷歌将在搜索结果中偏爱自己的视频服务，就像今天在购物、新闻和其他类别中所做的一样。谷歌在损害内容提供商方面也有着悠久的历史。为了吸引用户和广告商使用其服务，Google 需要内容。但当用户点击离开其搜索引擎时，它会从额外的搜索中损失广告收入，因此它经常从第三方复制这些内容——有时是小块。例如，谷歌的图片搜索引擎会显示来自第三方网站的高分辨率和大幅面图片，从而促进盗版。谷歌似乎也偏爱依赖广告而非订阅费的网站，这种做法已经削减了新闻媒体的利润率。这些类型的做法使内容提供商的收入和对内容创作的投资冷淡。白宫表示，拜登最近的行政命令鼓励美国司法部和联邦贸易委员会“大力执行反垄断法”，并“挑战过去政府此前未曾挑战的先前不良合并”。作为反垄断部门的负责人，坎特将决定是否对谷歌、亚马逊、Facebook 和苹果等公司提起诉讼，所有这些公司都面临国会审查，民主党提出了更强有力的反垄断规则，可能会拆分大型科技公司。 Kanter 的工作将补充 Lina Khan 的工作，Lina Khan 是一位反垄断学者和大型科技评论家，她于 6 月中旬成为 FTC 主席。消费者权益保护组织 Public Knowledge 的竞争政策主管 Charlotte Slaiman 表示：“就我们在技术和通信政策方面所经历的时刻而言，Kanter 拥有正确的专业知识并持有正确的价值观。” “公众需要一位兼具强大法律知识和必要勇气的助理司法部长来挑战看门人和整合市场，包括宽带提供商和数字平台。乔纳森·坎特（Jonathan Kanter）符合这一要求。”坎特的提名必须得到参议院的批准，斯莱曼敦促参议员们尽快确认坎特。这个过程可能需要几个月的时间。前总统唐纳德特朗普的反垄断负责人马坎德拉希姆于 2017 年 4 月上旬由特朗普提名，并于当年 9 月 27 日获得参议院确认。在拜登提名她后不到三个月，汗就被 FTC 确认了。\n拜登花了大约 180 天的时间才任命了一位反垄断负责人。这是自当时的总统吉米卡特以来最长的一次，他“花了 168 天时间提名约翰·谢菲尔德担任该职位，”Politico 本月早些时候写道。 168 天的等待以前是“现代美国历史上”最长的等待，但在这种情况下，“Shenefield 已经在 [1977 年] 5 月接任代理反垄断负责人，”Politico 写道。拜登在其他提名方面也进展缓慢。他需要提名一名联邦通信委员会成员来打破民主党和共和党之间的 2-2 僵局，他还需要选出一名 FCC 主席。到目前为止，杰西卡·罗森沃塞尔在拜登的整个任期内一直担任代理主席，但由于缺乏民主党多数席位而陷入困境。", "note_en": "President Joe Biden today said he will nominate Jonathan Kanter to be the assistant attorney general in charge of the Department of Justice&#39;s antitrust division. Kanter is an attorney known for his criticism of Google and will take over the antitrust division as it considers a  Biden plan to reverse harmful mergers and break up monopolies.\n Kanter &#34;is a distinguished antitrust lawyer with over 20 years of experience&#34; and has been &#34;a leading advocate and expert in the effort to promote strong and meaningful antitrust enforcement and competition policy,&#34; the  White House announcement said.\n US Sen. Amy Klobuchar (D-Minn.) applauded the nomination in a statement. &#34;For years, Jonathan Kanter has been a leader in the effort to increase antitrust enforcement against monopolies by federal, state, and international competition authorities. His deep legal experience and history of advocating for aggressive action make him an excellent choice to lead the Department of Justice&#39;s Antitrust Division,&#34; Klobuchar said.\n  Kanter founded the  Kanter Law Group, described by the White House as a &#34;boutique antitrust law firm that advocates in favor of federal and state antitrust law enforcement.&#34; The firm&#39;s website says that Kanter represents clients before the Department of Justice, Federal Trade Commission, Congress, and state attorneys general. Kanter also worked as an attorney in the FTC&#39;s competition bureau between 1998 and 2000.\n &#34;During the Obama administration, Microsoft engaged [Kanter] to push antitrust officials to take action against Google. More recently, he represented clients, including Yelp Inc., who urged the Justice Department to sue Google last year,&#34; Bloomberg  wrote today.\n &#34;Antitrust enforcement is barely on life support,&#34; Kanter said at an event about Amazon in 2016, as quoted by Bloomberg. &#34;When was the last time you can remember a major antitrust agency bringing a monopolization case? The reason you can&#39;t remember it is because they haven&#39;t done it.&#34;\n  Also in 2016, Kanter wrote an  op-ed for The New York Times titled &#34;Don&#39;t Hand Our TVs Over to Google.&#34; Kanter&#39;s op-ed criticized then-Federal Communications Commission Chairman Tom Wheeler&#39;s  proposal to give consumers more choices in set-top boxes by requiring cable and satellite-TV companies to provide content and programming information to makers of third-party hardware or applications. Kanter argued that Wheeler&#39;s plan, which was never adopted amid opposition from cable companies, &#34;threatens to replace one set of powerful gatekeepers with a new one: Google.&#34;\n  The FCC must ensure that Google doesn&#39;t engage in the same behavior when users search from their TVs. Absent FCC oversight, the record suggests, Google will favor its own video services in search results just as it does today for shopping, news, and other categories.\n Google also has a long history of harming content providers. To attract users and advertisers to its services, Google needs content. But it loses ad dollars from additional searches when users click away from its search engine, so it often copies that content—sometimes in small pieces—from third parties.\n For example, Google&#39;s image search engine displays high-resolution and large-format images from third-party sites, thereby promoting piracy. Google also seems to favor sites that rely on ads rather than subscription fees, a practice that has cut into news outlets&#39; profit margins. These kinds of practices starve content providers of revenue and chill investment in content creation.\n  Biden&#39;s  recent executive order encouraged the DOJ and FTC &#34;to enforce the antitrust laws vigorously&#34; and to &#34;challenge prior bad mergers that past administrations did not previously challenge,&#34; the White House said.\n As head of the antitrust division, Kanter would decide whether to file lawsuits against companies such as Google, Amazon, Facebook, and Apple, all of which are  facing congressional scrutiny, with Democrats proposing  stronger antitrust rules that could break up Big Tech companies. Kanter&#39;s work would complement that of Lina Khan, an antitrust scholar and Big Tech critic who  became the FTC chair in mid-June.\n &#34;Kanter has the right expertise and holds the right values for the moment we are experiencing in tech and communications policy,&#34;  said Charlotte Slaiman, competition policy director at consumer-advocacy group Public Knowledge. &#34;The public needs an assistant attorney general with both strong legal know-how and the requisite boldness to challenge gatekeepers and consolidated markets, including broadband providers and digital platforms. Jonathan Kanter fits that bill.&#34;\n  Kanter&#39;s nomination must be approved by the Senate, and Slaiman urged senators to confirm Kanter quickly. The process will likely take a few months. Former President Donald Trump&#39;s antitrust chief, Makan Delrahim, was nominated by Trump in  early April 2017 and  confirmed by the Senate on September 27 of that year. Khan was  confirmed to the FTC a bit less than three months after Biden nominated her.\n It took Biden about 180 days to name an antitrust chief. That&#39;s the longest since then-President Jimmy Carter, who &#34;took 168 days to nominate John Shenefield for the post,&#34; Politico  wrote earlier this month. The 168-day wait was previously the longest &#34;in modern US history,&#34; but in that case, &#34;Shenefield had already taken over as acting antitrust head in May [of 1977],&#34; Politico wrote.\n Biden has been slow with other nominations, too. He needs to  nominate a Federal Communications Commission member to break a 2-2 deadlock between Democrats and Republicans, and he still needs to pick an FCC chair. Jessica Rosenworcel has been the acting chairwoman throughout Biden&#39;s term so far but has been hamstrung by the lack of a Democratic majority.", "posttime": "2021-07-22 22:50:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,rust,picks,反垄断", "title": "拜登选择谷歌的敌人来领导司法部的反垄断，因为它正在考虑拆分大型科技公司的计划", "title_en": "Biden picks Google foe to lead DOJ antitrust as it mulls plan to break up Big Tech", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/07/biden-picks-google-foe-to-lead-doj-antitrust-as-it-mulls-plan-to-break-up-big-tech/", "via": "", "real_tags": ["google", "谷歌", "rust", "picks", "反垄断"]}, {"category": "", "categoryclass": "", "imagename": "d202fbfc697e4f5fe3c5ecde41d1adfc.jpg", "infoid": 1068985, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界在周二醒来时发现了两个新漏洞——一个在 Windows 中，另一个在 Linux 中——允许在易受攻击的系统中立足的黑客绕过操作系统安全限制并访问敏感资源。随着操作系统和应用程序变得更难破解，成功的攻击通常需要两个或更多漏洞。一个漏洞允许攻击者访问低特权的操作系统资源，在这些资源中可以执行代码或读取敏感数据。第二个漏洞提升了对为密码存储或其他敏感操作保留的操作系统资源的代码执行或文件访问。因此，所谓的本地提权漏洞的价值近年来有所增加。周一，当一名研究人员观察到他认为即将推出的 Windows 11 测试版中的编码回归时，Windows 漏洞偶然曝光。研究人员发现安全帐户管理器的内容——存储用户帐户和本地计算机上用户的安全描述符——可以被具有有限系统权限的用户读取。这使得提取受密码保护的密码数据、发现用于安装 Windows 的密码、获取 Windows 数据保护 API 的计算机密钥（可用于解密私有加密密钥）以及在易受攻击的计算机上创建帐户成为可能。结果是本地用户可以一直将权限提升到 Windows 中的最高级别 System。 “我还不知道问题的全部范围，但我认为问题太多了，”研究员乔纳斯·莱克加德 (Jonas Lykkegaard) 指出。 “所以没有人怀疑这意味着什么，即使是沙盒应用程序，它也是系统的 EOP。” yarh-出于某种原因，在 win11 上，用户现在可以读取 SAM 文件。因此，如果您启用了 shadowvolumes，您可以像这样读取 sam 文件：我还不知道问题的全部范围，但我认为问题太多了。 pic.twitter.com/kl8gQ1FjFt-Jonas L（@jonasLyk）2021 年 7 月 19 日\n回应 Lykkegaard 的人指出，该行为不是 Windows 11 中引入的回归。相反，最新版本的 Windows 10 中存在相同的漏洞。 美国计算机应急准备小组表示，该漏洞存在于 Volume Shadow复制服务——允许操作系统或应用程序在不锁定文件系统的情况下拍摄整个磁盘的“时间点快照”的 Windows 功能——已打开。如果系统驱动器的 VSS 卷影副本可用，则非特权用户可以利用对这些文件的访问来实现多种影响，包括但不限于： 请注意，在某些配置中，VSS 卷影副本可能不可用；但是，只需拥有一个大于 128GB 的​​系统驱动器，然后执行 Windows 更新或安装 MSI 即可确保自动创建 VSS 卷影副本。要检查系统是否有可用的 VSS 卷影副本，请从特权命令提示符运行以下命令： vssadmin list shadows 研究员 Benjamin Delpy 展示了如何利用该漏洞获取密码哈希或其他敏感数据： 问：当您有 #mimikatz🥝 和一些对 Windows 系统文件（如 SYSTEM、SAM 和 SECURITY）的读取权限？ A：本地权限提升🥳 感谢@jonasLyk 在默认 Windows 上的阅读权限😘 pic.twitter.com/6Y8kGmdCsp — 🥝 Benjamin Delpy (@gentilkiwi) 2021 年 7 月 20 日目前，没有可用的补丁。一位微软代表表示，公司官员正在调查该漏洞，并将根据需要采取适当的行动。该漏洞被跟踪为 CVE-2021-36934。微软在这里表示，野外攻击“更有可能”。\n与此同时，大多数版本的 Linux 正在分发针对周二披露的漏洞的修复程序。 CVE-2021-33909，随着安全漏洞的跟踪，允许不受信任的用户通过创建、挂载和删除总路径长度超过1GB的深层目录结构，然后打开并读取/proc/来获得不受约束的系统权限self/mountinfo 文件。发现该漏洞的安全公司 Qualys 的研究人员表示：“我们成功地利用了这种不受控制的越界写入，并获得了默认安装的 Ubuntu 20.04、Ubuntu 20.10、Ubuntu 21.04、Debian 11 和 Fedora 34 Workstation 的完全 root 权限”并创建了利用它的概念验证代码，写道。 “其他 Linux 发行版当然容易受到攻击，并且可能会被利用。” Qualys 描述的漏洞利用带来了巨大的开销，特别是大约 100 万个嵌套目录。攻击还需要大约 5GB 的内存和 100 万个 inode。尽管存在障碍，但 Qualys 的一位代表将 PoC 描述为“极其可靠”，并表示大约需要三分钟才能完成。 1/ 我们 mkdir() 一个总路径长度超过 1GB 的深层目录结构（大约 1M 嵌套目录），我们将它绑定挂载到一个非特权用户命名空间，然后 rmdir() 它。 2/ 我们创建了一个线程，它 vmalloc() 访问一个小的 eBPF 程序（通过 BPF_PROG_LOAD），并且在我们的 eBPF 程序已经被内核 eBPF 验证器验证之后但在它被 JIT 编译之前我们阻塞了这个线程（通过 userfaultfd 或 FUSE）由内核。 3/ 我们在我们的非特权用户命名空间中 open() /proc/self/mountinfo 并开始 read() 我们的绑定挂载目录的长路径，从而将字符串“//deleted”写入正好 -2GB 的偏移量- 10B 在 vmalloc() 化缓冲区的开头下方。 4/ 我们安排这个“//deleted”字符串覆盖我们经过验证的 eBPF 程序的一条指令（从而使内核 eBPF 验证器的安全检查无效）并将这个不受控制的越界写入转换为信息披露和有限但受控的越界写入。\n5/ 我们通过重用 Manfred Paul 漂亮的 btf 和 map_push_elem 技术，将这种有限的越界写入转换为对内核内存的任意读写：运行 Linux 的人应该与发行商核实以确定是否有补丁可以修复漏洞. Windows 用户应等待 Microsoft 和外部安全专家的建议。我想知道那个 Linux 错误是如何被发现的。 Windows 特权“哎呀”是我可以看到研究人员在对 Win 11 早期版本进行审核的过程中发现的那种事情，但是“创建 1M 嵌套目录，...”序列不太可能弹出在正常的业务过程中！我假设有人正在阅读源代码并从逻辑上解决了这个问题。对那个 linux 漏洞利用表示悲痛。老实说，我不能因为没有找到那个而责怪开发人员，我更敬畏您甚至可以创建这样一个结构，而不会先使文件系统爆炸！", "note_en": "The world woke up on Tuesday to two new vulnerabilities—one in Windows and the other in Linux—that allow hackers with a toehold in a vulnerable system to bypass OS security restrictions and access sensitive resources.\n As operating systems and applications become harder to hack, successful attacks typically require two or more vulnerabilities. One vulnerability allows the attacker access to low-privileged OS resources, where code can be executed or sensitive data can be read. A second vulnerability elevates that code execution or file access to OS resources reserved for password storage or other sensitive operations. The value of so-called local privilege escalation vulnerabilities, accordingly, has increased in recent years.\n  The Windows vulnerability  came to light by accident on Monday when a researcher observed what he believed was a coding regression in a beta version of the upcoming Windows 11. The researcher found that the contents of the  security account manager—the database that stores user accounts and security descriptors for users on the local computer—could be read by users with limited system privileges.\n That made it possible to extract cryptographically protected password data, discover the password used to install Windows, obtain the computer keys for the Windows data protection API—which can be used to decrypt private encryption keys—and create an account on the vulnerable machine. The result is that the local user can elevate privileges all the way to System, the highest level in Windows.\n “I don’t know the full extent of the issue yet, but it’s too many to not be a problem I think,” researcher Jonas Lykkegaard noted. “Just so nobody is in doubt what this means, it’s EOP to SYSTEM for even sandboxed apps.”\n    yarh- for some reason on win11 the SAM file now is READ for users. So if you have shadowvolumes enabled you can read the sam file like this:  I dont know the full extent of the issue yet, but its too many to not be a problem I think.  pic.twitter.com/kl8gQ1FjFt\n— Jonas L (@jonasLyk)  July 19, 2021\n People responding to Lykkegaard pointed out that the behavior wasn’t a regression introduced in Windows 11. Instead, the same vulnerability was present in the latest version of Windows 10. The US Computer Emergency Readiness Team  said that the vulnerability is present when the Volume Shadow Copy Service—the Windows feature that allows the OS or applications to take &#34;point-in-time snapshots&#34; of an entire disk without locking the filesystem—is turned on.\n  If a VSS shadow copy of the system drive is available, a non-privileged user may leverage access to these files to achieve a number of impacts, including but not limited to:\n  Note that VSS shadow copies may not be available in some configurations; however, simply having a system drive that is larger than 128GB in size and then performing a Windows Update or installing an MSI will ensure that a VSS shadow copy will be  automatically created. To check if a system has VSS shadow copies available, run the following command from a privileged command prompt:  vssadmin list shadows\n Researcher Benjamin Delpy  showed how the vulnerability can be exploited to obtain password hashes or other sensitive data:\n Q: what can you do when you have  #mimikatz🥝 &amp; some Read access on Windows system files like SYSTEM, SAM and SECURITY?  A: Local Privilege Escalation 🥳  Thank you  @jonasLyk for this Read access on default Windows😘  pic.twitter.com/6Y8kGmdCsp\n— 🥝 Benjamin Delpy (@gentilkiwi)  July 20, 2021\n Currently, there is no patch available. A Microsoft representative said company officials are investigating the vulnerability and will take appropriate action as needed. The vulnerability is being tracked as CVE-2021-36934. Microsoft said  here that exploits in the wild are &#34;more likely.&#34;\n  Most versions of Linux, meanwhile, are in the process of distributing a fix for a vulnerability disclosed on Tuesday. CVE-2021-33909, as the security flaw is tracked, allows an untrusted user to gain unfettered system rights by creating, mounting, and deleting a deep directory structure with a total path length that exceeds 1GB and then opening and reading the  /proc/self/mountinfo file.\n    “We successfully exploited this uncontrolled out-of-bounds write and obtained full root privileges on default installations of Ubuntu 20.04, Ubuntu 20.10, Ubuntu 21.04, Debian 11, and Fedora 34 Workstation,” researchers from Qualys, the security firm that discovered the vulnerability and created proof-of-concept code that exploits it, wrote. “Other Linux distributions are certainly vulnerable, and probably exploitable.”\n The exploit Qualys described comes with significant overhead, specifically roughly 1 million nested directories. The attack also requires about 5GB of memory and 1 million  inodes. Despite the hurdles, a Qualys representative described the PoC as “extremely reliable” and said it takes about three minutes to complete.\n  1/ We mkdir() a deep directory structure (roughly 1M nested directories) whose total path length exceeds 1GB, we bind-mount it in an unprivileged user namespace, and rmdir() it.\n 2/ We create a thread that vmalloc()ates a small eBPF program (via BPF_PROG_LOAD), and we block this thread (via userfaultfd or FUSE) after our eBPF program has been validated by the kernel eBPF verifier but before it is JIT-compiled by the kernel.\n 3/ We open() /proc/self/mountinfo in our unprivileged user namespace and start read()ing the long path of our bind-mounted directory, thereby writing the string &#34;//deleted&#34; to an offset of exactly -2GB-10B below the beginning of a vmalloc()ated buffer.\n 4/ We arrange for this &#34;//deleted&#34; string to overwrite an instruction of our validated eBPF program (and therefore nullify the security checks of the kernel eBPF verifier) and transform this uncontrolled out-of-bounds write into an information disclosure and into a limited but controlled out-of-bounds write.\n 5/ We transform this limited out-of-bounds write into an arbitrary read and write of kernel memory by reusing Manfred Paul&#39;s beautiful btf and map_push_elem techniques from:\n  People running Linux should check with the distributor to determine if patches are available to fix the vulnerability. Windows users should await advice from Microsoft and outside security experts.\n  I want to know the story of how that Linux bug was found.   The Windows privilege &#34;oops&#34; is the sort of thing that I can see a researcher finding in the course of an audit of the Win 11 early release, but the &#34;create 1M nested directories, ...&#34; sequence isn&#39;t likely to pop up in the normal course of business! I assume someone was reading the source and worked that out logically.\n  good grief on that linux exploit. I honestly can&#39;t fault the devs for not finding that one, i&#39;m more in awe that you can even create such a structure without the file system exploding first!", "posttime": "2021-07-22 22:50:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,漏洞,windows,vulnerabilities", "title": "两个星期二的漏洞让 Windows 和 Linux 用户感到不安", "title_en": "Two-for-Tuesday vulnerabilities send Windows and Linux users scrambling", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/separate-eop-flaws-let-hackers-gain-full-control-of-windows-and-linux-systems/", "via": "", "real_tags": ["linux", "漏洞", "windows"]}]